#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Заказ") Тогда
		
		Заказ = Параметры.Заказ;
		
		ЭтоДозаказ = Ложь; 
		Если Параметры.Свойство("ЭтоДозаказ") Тогда
		
			ЭтоДозаказ = Параметры.ЭтоДозаказ; 	
		
		КонецЕсли;
		
		Если ЭтоДозаказ Тогда
		
			Заказ = b2b_ОбменЗаявками.НайтиОсновнойЗаказпоДозаказу(Заказ); 
			
			Если НЕ  ЗначениеЗаполнено(Заказ) Тогда
			
			Сообщить("Основной заказ не найден"); 	
			
				Возврат; 
			
			КонецЕсли;
		
		КонецЕсли;
		
		b2b_ОбменЗаявками.ОчиститьРегистрОбновленныеЗаказыПоЗаказу(Заказ);
		
		Дозаказ = b2b_ОбменЗаявками.НайтиДоЗаказпоОсновному(Заказ);
		Если ЗначениеЗаполнено(Дозаказ) Тогда
		
		b2b_ОбменЗаявками.ОчиститьРегистрОбновленныеЗаказыПоЗаказу(Дозаказ);	
		
		КонецЕсли;
		
		ЗаполнитьТаблицуТоваровПоЗаказу(); 
		
		СостояниеЗаказа = Заказ.СостояниеНакладной;
		СостояниеСогласования = Заказ.СостояниеСогласования;
		
		НомерЗаявкиКонтрагента = Заказ.НомерЗаказа; 
		
		РНКСуществующее = неопределено; 
		
		РезультатПроверкиСвязи =  b2b_ОбменЗаявками.ПроверитьСвязьСРНК(Заказ.ссылка,РНКСуществующее);
		Если ЗначениеЗаполнено(РНКСуществующее) Тогда
		
			РасходнаяНакладная1 = РНКСуществующее.ссылка;	
		
		КонецЕсли;
		
		РНКСуществующее = неопределено; 
		
		РезультатПроверкиСвязи =  b2b_ОбменЗаявками.ПроверитьСвязьСРНК(Дозаказ.ссылка,РНКСуществующее);
		Если ЗначениеЗаполнено(РНКСуществующее) Тогда
		
			РасходнаяНакладная2 = РНКСуществующее.ссылка;	
		
		КонецЕсли;
		
		РедактированиеДозаказаПоУмолчанию = (СостояниеДоЗаказа = ПредопределенноеЗначение("Перечисление.b2b_СтатусыДоЗаказов.ТребуетПодтверждения")) 
		И СостояниеЗаявки = ПредопределенноеЗначение("Перечисление.b2b_СтатусыЗаказов.ЖдетПодтвержденияДистрибьютором");
		Если РедактированиеДозаказаПоУмолчанию Тогда
			
			НеПересчитыватьКоличествоДозаказ = Истина; 	
			
		КонецЕсли;
 
		
		СохранитьЗаказНаСервере(Истина); 
		
	КонецЕсли;
	
	ЗаблокироватьДокументыЗаказовДляРедактирования();
	
	ЗаполнитьАдресаДоставки(); 
	
	ДоступностьРедактированияЗаказа();
	
	ВывестиПодсказкиПредупреждения(); 
	
	УстановитьУсловноеОформление(); 
	
КонецПроцедуры


&НаКлиенте
Процедура ДанныеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Модифицированность = истина; 
	ИзмененияПоЗаказу = Истина;
	ИзмененияПоЗаказуСтроки = Истина; 
	
	ТекущиеДанные = Элементы.Данные.ТекущиеДанные; 
	Если ТекущиеДанные <> Неопределено Тогда
		
		ТекущиеДанные.ИзмененаСтрока = Истина; 	
		
	КонецЕсли;
	НадписьИзменений();
	ДоступностьЭлементовПриРедактированииНаКлиенте(); 
	//ДоступностьРедактированияЗаказа(); 
КонецПроцедуры

&НаКлиенте
Процедура СостояниеЗаказаПриИзменении(Элемент)
	Модифицированность = истина;
	ИзмененияПоЗаказу = Истина;
КонецПроцедуры
&НаКлиенте
Процедура СостояниеСогласованияПриИзменении(Элемент)
	Модифицированность = Истина; 
	ИзмененияПоЗаказу = Истина;
	НадписьИзменений(); 
КонецПроцедуры

&НаКлиенте
Процедура ПлановаяДатаОтгрузкиПриИзменении(Элемент)
	Модифицированность = истина; 
	ИзмененияПоЗаказу = Истина;
	НадписьИзменений(); 
КонецПроцедуры

&НаКлиенте
Процедура ПунктДоставкиПриИзменении(Элемент)
	Модифицированность = истина;
	ИзмененияПоДозаказу = Истина;
	НадписьИзменений();
КонецПроцедуры


#КонецОбласти    

#Область Команды 

&НаКлиенте
Процедура Сохранить(Команда)
	МассивОшибок.Очистить();
	
	Отбор = Новый Структура("ИзмененаСтрока",истина); 
	Если Данные.НайтиСтроки(Отбор).Количество() > 0// И Не НеПересчитыватьКоличество) 
		 И ДанныеДозаказа.НайтиСтроки(Отбор).Количество() > 0 Тогда //И НЕ НеПересчитыватьКоличествоДозаказ)  Тогда
	
		Сообщить("Изменения будут сохранены только по основному заказу, так как возможны конфликты при записи данных"); 	
		
		МассивОшибок.Добавить("Изменения будут сохранены только по основному заказу, так как возможны конфликты при записи данных"); 
		
		ИзмененияПоДозаказу = Ложь; 
	КонецЕсли;
	
	Если ИзмененияПоЗаказу Тогда
	
		СохранитьЗаказНаСервере();	
		
	Конецесли; 
	
	Если ИзмененияПоДозаказу тогда 
		СохранитьИзмененияВДозаказе();
	КонецЕсли;
	
		
	ЗаполнитьТаблицуТоваровПоЗаказу();
	
	ДоступностьРедактированияЗаказа(); 
	
	НадписьИзменений();
	
	ВывестиТекстошибок(); 
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДозаказ(Команда)
	
	МассивОшибок.Очистить();
	
	СохранитьЗаказНаСервере(,ложь); 
	
	СоздатьДозаказНаСервере();
	
	ОбновитьЗаказНаСервере(); 
	
	ДоступностьРедактированияЗаказа(); 
	
	ВывестиПодсказкиПредупреждения();
	
	ВывестиТекстОшибок();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции
// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ЗаполнитьТаблицуТоваровПоЗаказу()
	
	МассивТоваров = Заказ.Товары.ВыгрузитьКолонку("Номенклатура"); 
	Склад = Заказ.Склад; 
	КэшОстатки = Новый Соответствие; 
	
	b2b_ОбменЗаявками.ПолучитьОстаткиПоЗаявкам(МассивТоваров,Склад,Заказ,КэшОстатки); 
	
		
	//заполняем заказ в наличии или новый заказ 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕЭ_ЗаявкиКлиентовСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЗаказТовары.Количество КАК Количество,
	|	ЗаказТовары.ЦенаИсточник КАК ЦенаИсточник,
	|	ЕЭ_ЗаявкиКлиентовСрезПоследних.Цена КАК Цена,
	|	ЕЭ_ЗаявкиКлиентовСрезПоследних.СтатусЗаказа_b2b КАК СостояниеЗаявки,
	|	ЕЭ_ЗаявкиКлиентовСрезПоследних.ПлановаяДатаОтгрузки КАК ПлановаяДатаОтгрузки,
	|	ЗаказТовары.Заявка КАК Заявка,
	|	ЕЭ_ЗаявкиКлиентовСрезПоследних.Цена * ЗаказТовары.Количество КАК Всего,
	|	ЕЭ_ЗаявкиКлиентовСрезПоследних.МетодДоставки КАК МетодДоставки,
	|	ЕЭ_ЗаявкиКлиентовСрезПоследних.ПричинаОтменыЗаявки КАК ПричинаОтменыЗаявки,
	|	ЕЭ_ЗаявкиКлиентовСрезПоследних.ПричинаОтменыОтгрузкиЗаказа КАК ПричинаОтменыОтгрузкиЗаказа,
	|	ЕЭ_ЗаявкиКлиентовСрезПоследних.ПричинаОтменыОтгрузкиДозаказа КАК ПричинаОтменыОтгрузкиДозаказа,
	|	ЗаказТовары.ПодтвержденнаяЗаявка КАК ПодтвержденнаяЗаявка,
	|	ЗаказТовары.НомерСтроки КАК НомерСтроки,
	|	ЕЭ_ЗаявкиКлиентовСрезПоследних.КоличествоРезерв КАК КоличествоРезерв,
	|	ЗаказТовары.Количество - ЕСТЬNULL(ЕЭ_ЗаявкиКлиентовСрезПоследних.КоличествоРезерв, 0) КАК КоличествоДозаказ,
	|	ЕЭ_ЗаявкиКлиентовСрезПоследних.Скидка КАК Скидка,
	|	ВЫБОР
	|		КОГДА ЕЭ_ЗаявкиКлиентовСрезПоследних.Цена <> ЗаказТовары.Цена
	|				ИЛИ ЕЭ_ЗаявкиКлиентовСрезПоследних.Скидка <> ЗаказТовары.Скидка
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕСТЬИзменения,
	|	ЕЭ_ЗаявкиКлиентовСрезПоследних.ДопСкидкаНаНакладную КАК ДопСкидкаНаНакладную,
	|	ЕЭ_ЗаявкиКлиентовСрезПоследних.СкидкаНаНакладную КАК СкидкаНаНакладную,
	|	ВЫБОР
	|		КОГДА ЕЭ_ЗаявкиКлиентовСрезПоследних.ДопСкидкаНаНакладную <> ЗаказТовары.Ссылка.ДопСкидкаНаНакладную
	|				ИЛИ ЕЭ_ЗаявкиКлиентовСрезПоследних.СкидкаНаНакладную <> ЗаказТовары.Ссылка.Скидка
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕСТЬИзмененияВЗаказе,
	|	ЕЭ_ЗаявкиКлиентовСрезПоследних.ЦенаБезСкидки КАК ЦенаБезСкидки
	|ИЗ
	|	РегистрСведений.b2b_ЗаявкиКлиентов КАК ЕЭ_ЗаявкиКлиентовСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заказ.Товары КАК ЗаказТовары
	|		ПО ЕЭ_ЗаявкиКлиентовСрезПоследних.Заказ = ЗаказТовары.Ссылка
	|			И ЕЭ_ЗаявкиКлиентовСрезПоследних.Номенклатура = ЗаказТовары.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.b2b_Дозаказы КАК b2b_Дозаказы
	|		ПО ЕЭ_ЗаявкиКлиентовСрезПоследних.Заказ = b2b_Дозаказы.Заказ
	|			И (b2b_Дозаказы.Заказ = &Заказ)
	|			И (b2b_Дозаказы.Номенклатура = ЕЭ_ЗаявкиКлиентовСрезПоследних.Номенклатура)
	|ГДЕ
	|	ЕЭ_ЗаявкиКлиентовСрезПоследних.Заказ = &Заказ
	|	И b2b_Дозаказы.Заказ ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Данные.Очистить();
	
	ПерезаписатьЗаказ = Ложь;
	
	РазницаКоличествоРезерв = Ложь;
	ИзмененияПоЗаказуПредварительно = Ложь; 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТовара = Данные.Добавить(); 
		ЗаполнитьЗначенияСвойств(СтрокаТовара,ВыборкаДетальныеЗаписи);
		Если КэшОстатки.Получить(СтрокаТовара.Номенклатура) <> неопределено Тогда
			
			СтрокаТовара.остаток =  КэшОстатки.Получить(СтрокаТовара.Номенклатура).СвободныйОстаток;	
			
		КонецЕсли;
		СостояниеЗаявки = ВыборкаДетальныеЗаписи.СостояниеЗаявки;
		ПлановаяДатаОтгрузки = Заказ.ДатаОтгрузки; //ВыборкаДетальныеЗаписи.ПлановаяДатаОтгрузки; 
		МетодДоставки = ВыборкаДетальныеЗаписи.МетодДоставки; 
		ПричинаОтменыЗаявки = ВыборкаДетальныеЗаписи.ПричинаОтменыЗаявки;
		ПричинаОтменыОтгрузки1 = ВыборкаДетальныеЗаписи.ПричинаОтменыОтгрузкиЗаказа;
		ПричинаОтменыОтгрузки2 = ВыборкаДетальныеЗаписи.ПричинаОтменыОтгрузкиДозаказа;
		Скидка = ВыборкаДетальныеЗаписи.СкидкаНаНакладную; 
		ДопСкидкаНаНакладную = ВыборкаДетальныеЗаписи.ДопСкидкаНаНакладную; 
		
		Если СтрокаТовара.КоличествоРезерв <> СтрокаТовара.Количество 
			 ИЛИ ВыборкаДетальныеЗаписи.ЕстьИзменения тогда 
			 
			РазницаКоличествоРезерв = Истина; 
			
			СтрокаТовара.ИзмененаСтрока = истина; 
		КонецЕсли; 
		
		Если ВыборкаДетальныеЗаписи.ЕСТЬИзмененияВЗаказе Тогда
		
			ИзмененияПоЗаказуПредварительно = Истина; 
		
		КонецЕсли;
		
		
	КонецЦикла;
	
		
	КомментарийКЗаказу = Заказ.Комментарий; 
	//Скидка = заказ.Скидка; 
	//ДопСкидкаНаНакладную = Заказ.ДопСкидкаНаНакладную; 
	
	// Заполняем дозаказ
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕЭ_ЗаявкиКлиентовСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЗаказТовары.Количество КАК Количество,
	|	ЗаказТовары.Цена КАК Цена,
	|	ЗаказТовары.ЦенаИсточник КАК ЦенаИсточник,
	|	ЕЭ_ЗаявкиКлиентовСрезПоследних.СтатусЗаказа_b2b КАК СостояниеЗаявки,
	|	ЕЭ_ЗаявкиКлиентовСрезПоследних.ПлановаяДатаОтгрузки КАК ПлановаяДатаОтгрузки,
	|	b2b_Дозаказы.Комментарий КАК Комментарий,
	|	b2b_Дозаказы.СтатусДоЗаказа_b2b КАК СтатусДоЗаказа_b2b,
	|	b2b_Дозаказы.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
	|	b2b_Дозаказы.СрокПодтвержденияПоДозаказу КАК СрокПодтвержденияПоДозаказу,
	|	ЕЭ_ЗаявкиКлиентовСрезПоследних.Заказ.СостояниеНакладной КАК СостояниеДозаказа,
	|	ЕЭ_ЗаявкиКлиентовСрезПоследних.Заказ.СостояниеСогласования КАК СостояниеСогласованияДозаказа,
	|	b2b_Дозаказы.Заказ КАК Дозаказ,
	|	ЗаказТовары.Заявка КАК Заявка,
	|	ЗаказТовары.Всего КАК Всего,
	|	ЗаказТовары.ПодтвержденнаяЗаявка КАК ПодтвержденнаяЗаявка,
	|	ЗаказТовары.НомерСтроки КАК НомерСтроки,
	|	ЗаказТовары.Скидка КАК Скидка,
	|	ЕЭ_ЗаявкиКлиентовСрезПоследних.ЦенаБезСкидки КАК ЦенаБезСкидки,
	|	b2b_Дозаказы.ПунктДоставки КАК ПунктДоставки,
	|	b2b_Дозаказы.Контрагент КАК Контрагент
	|ИЗ
	|	РегистрСведений.b2b_Дозаказы КАК b2b_Дозаказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.b2b_ЗаявкиКлиентов КАК ЕЭ_ЗаявкиКлиентовСрезПоследних
	|		ПО (ЕЭ_ЗаявкиКлиентовСрезПоследних.Заказ = b2b_Дозаказы.Заказ)
	|			И b2b_Дозаказы.Номенклатура = ЕЭ_ЗаявкиКлиентовСрезПоследних.Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заказ.Товары КАК ЗаказТовары
	|		ПО (ЕЭ_ЗаявкиКлиентовСрезПоследних.Заказ = ЗаказТовары.Ссылка)
	|			И (ЕЭ_ЗаявкиКлиентовСрезПоследних.Номенклатура = ЗаказТовары.Номенклатура)
	|ГДЕ
	|	b2b_Дозаказы.ЗаказОсновной = &Заказ
	|	И НЕ b2b_Дозаказы.Заказ.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ДанныеДозаказа.Очистить();
	Дозаказ = Документы.Заказ.ПустаяСсылка(); 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТовара = ДанныеДозаказа.Добавить(); 
		ЗаполнитьЗначенияСвойств(СтрокаТовара,ВыборкаДетальныеЗаписи);
		Если КэшОстатки.Получить(СтрокаТовара.Номенклатура) <> неопределено Тогда
			
			СтрокаТовара.остаток =  КэшОстатки.Получить(СтрокаТовара.Номенклатура).СвободныйОстаток;	
			
		КонецЕсли;
		
		СтрокаТовара.КоличествоДозаказ = СтрокаТовара.Количество;
		
		СостояниеЗаказаНадозаказ = ВыборкаДетальныеЗаписи.СостояниеДозаказа; 
		СостояниеСогласованияНаДозаказ =  ВыборкаДетальныеЗаписи.СостояниеСогласованияДозаказа; 		 
		СостояниеДоЗаказа = ВыборкаДетальныеЗаписи.СтатусДоЗаказа_b2b; 
		Дозаказ = ВыборкаДетальныеЗаписи.Дозаказ; 
		КомментарийКДозаказу = ВыборкаДетальныеЗаписи.Комментарий; 
		ЖелаемаяДатаОтгрузки = ВыборкаДетальныеЗаписи.ЖелаемаяДатаОтгрузки; 
		СрокПодтвержденияПоДозаказу = ВыборкаДетальныеЗаписи.СрокПодтвержденияПоДозаказу; 
		ПлановаяДатаОтгрузкиДозаказа = Дозаказ.ДатаОтгрузки;
		ПунктДоставки = ВыборкаДетальныеЗаписи.ПунктДоставки; 
		ЮрЛицоДозаказа = ВыборкаДетальныеЗаписи.Контрагент; 
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СрокПодтвержденияПоДозаказу) Тогда    
		 
	    РазницаВСекундах = СрокПодтвержденияПоДозаказу - ТекущаяДата(); 
		ЧасыЦелые = Цел(РазницаВСекундах/3600); //,0,РежимОкругления.Окр15как10);
		//Минуты = Окр(РазницаВСекундах/60,0,РежимОкругления.Окр15как10) - ЧасыЦелые*60; 
		ОстатокСекунд = РазницаВСекундах  - ЧасыЦелые * 3600; 
		Минуты = Цел(ОстатокСекунд/60); //,0,РежимОкругления.Окр15как10);
		
		СрокПодтвержденияВЧасах = Формат(ЧасыЦелые,"ЧН=0; ЧГ=0") + " ч." + Формат(Минуты,"ЧН=0; ЧГ=0") + "минут"; 
	Иначе 
		СрокПодтвержденияВЧасах = ""; 
	КонецЕсли;  
	 
	 ПричинаОтменыЗаявкиКлиентом = b2b_ОбменЗаявками.ПолучитьЗначениеРеквизитаПоДокументу(Заказ.Ссылка,"ПричинаОтменыЗаявки"); 

	 ЗаполнитьДанныеПодвала();
	 
	 СостояниеСогласования = Заказ.СостояниеСогласования; 
	 СостояниеЗаказа  = Заказ.СостояниеНакладной; 
	 
	 Если РазницаКоличествоРезерв 
		 И (Не ЗначениеЗаполнено(Дозаказ) ИЛИ НЕ ЗначениеЗаполнено(СостояниеДоЗаказа)) 
		 И СостояниеСогласования = Перечисления.СостоянияСогласования.НаСогласованииЦО
		 И СостояниеЗаказа = Перечисления.СостоянияЗаказаКонтрагента.ВРаботе Тогда 
		 
		 ИзмененияПоЗаказу = истина; 
		 
	 КонецЕсли;
	 
	 Если Не ИзмененияПоЗаказу
		 И ИзмененияПоЗаказуПредварительно 
		 
		 И (Не ЗначениеЗаполнено(Дозаказ) ИЛИ НЕ ЗначениеЗаполнено(СостояниеДоЗаказа)) 
		 И СостояниеСогласования = Перечисления.СостоянияСогласования.НаСогласованииЦО
		 И СостояниеЗаказа = Перечисления.СостоянияЗаказаКонтрагента.ВРаботе  Тогда
		 
		 ИзмененияПоЗаказу = истина;
		 
	 КонецЕсли;

	 
	 ТекстОшибкиПосл = b2b_ОбменЗаявками.ВывестиТекстОшибкиПоследний(Заказ);
	 ТекстОшибкиПослДЗ = "";
	 
	 ТекстОшибкиПоследний = ""; 
	 Если ЗначениеЗаполнено(Дозаказ) Тогда
		 
		 ТекстОшибкиПослДЗ = b2b_ОбменЗаявками.ВывестиТекстОшибкиПоследний(Дозаказ);	
		  
	 КонецЕсли;
	 Если ЗначениеЗаполнено(ТекстОшибкиПосл)  Тогда
		 
		 ТекстОшибкиПоследний = "Заказ резерва:" + ТекстОшибкиПосл; 
		 
	 КонецЕсли;
	 
	 Если ЗначениеЗаполнено(ТекстОшибкиПослДЗ) 
		 И ЗначениеЗаполнено(ТекстОшибкиПосл) Тогда
		 
		 ТекстОшибкиПоследний = ТекстОшибкиПоследний + "; Дозаказ ЕЕЭ:" + ТекстОшибкиПослДЗ; 
	 ИначеЕсли ЗначениеЗаполнено(ТекстОшибкиПослДЗ) Тогда
		 
		 ТекстОшибкиПоследний = "Дозаказ ЕЕЭ::" + ТекстОшибкиПослДЗ;
	 КонецЕсли;
	 
	
КонецПроцедуры // ЗаполнитьТаблицуТоваровПоЗаказу()
&НаСервере
Функция СохранитьЗаказНаСервере(ТолькоРегистр = Ложь, ИзменятьДозаказ = Истина)
	
	Если Не ТолькоРегистр Тогда
		
		ОбъектЗаказ  = Заказ.ПолучитьОбъект();
		ОбъектЗаказ.СостояниеНакладной = СостояниеЗаказа;
		ОбъектЗаказ.СостояниеСогласования = СостояниеСогласования; 
		ОбъектЗаказ.ДатаОтгрузки = ПлановаяДатаОтгрузки;
		ОбъектЗаказ.Комментарий = КомментарийКЗаказу;
		ОбъектЗаказ.Скидка = Скидка; 
		ОбъектЗаказ.ДопСкидкаНаНакладную = ДопСкидкаНаНакладную; 
		
		СоответствиеТоварДействие = Новый Соответствие;
		МассивТоваровНаДозаказ = Новый Массив;
		
		ИзменитьДозаказ = Ложь;
		
		ДоступностьРедактированияДоЗаказа = (НЕ ЗначениеЗаполнено(СостояниеДоЗаказа)
		 ИЛИ СостояниеДоЗаказа = Перечисления.b2b_СтатусыДоЗаказов.ТребуетПодтверждения) 
		 И СостояниеЗаявки = Перечисления.b2b_СтатусыЗаказов.ЖдетПодтвержденияДистрибьютором;
		
		СоответствиеТоварКоличествоРезерв = Новый Соответствие; 
		СоответствиеТоварЦенаСкидка = Новый Соответствие; 
		
		Для каждого СтрокаТовара Из Данные Цикл
			
			Если НЕ СтрокаТовара.ИзмененаСтрока Тогда
			
				Продолжить; 	
			
			КонецЕсли;
			
			Отбор = Новый Структура("Номенклатура",СтрокаТовара.Номенклатура); 
			СтрокиЗаказа = ОбъектЗаказ.Товары.НайтиСтроки(Отбор);
			
			Если СтрокаТовара.КоличествоДозаказ > 0 Тогда
			
				ИзменитьДозаказ = ДоступностьРедактированияДоЗаказа И ИзменятьДозаказ; 	
			
			КонецЕсли;
			Если СтрокиЗаказа.Количество() > 0  Тогда
				
				Если СтрокаТовара.Количестворезерв = 0 Тогда
				
					ОбъектЗаказ.Товары.Удалить(СтрокиЗаказа[0]); 
					Продолжить; 
				
				КонецЕсли;
				
				СтрокиЗаказа[0].Количество = СтрокаТовара.Количестворезерв; //СтрокаТовара.Количество;
				
				СтруктураЦенаСкидка = Новый Структура("Цена,ЦенаБезСкидки,Скидка,ДопСкидкаНаНакладную,СкидкаНаНакладную"); 
				ЗаполнитьЗначенияСвойств(СтруктураЦенаСкидка,СтрокаТовара); 
				СтруктураЦенаСкидка.СкидкаНаНакладную = Скидка;
				СтруктураЦенаСкидка.ДопСкидкаНаНакладную = ДопСкидкаНаНакладную;
				//
				СоответствиеТоварКоличествоРезерв.Вставить(СтрокаТовара.Номенклатура,СтрокаТовара.КоличествоРезерв); 
				СоответствиеТоварЦенаСкидка.Вставить(СтрокаТовара.Номенклатура,СтруктураЦенаСкидка);
				
				СтрокиЗаказа[0].Цена = СтрокаТовара.Цена;
				СтрокиЗаказа[0].ЦенаБезСкидки = СтрокаТовара.ЦенаБезСкидки;//	
				СтрокиЗаказа[0].Скидка = СтрокаТовара.Скидка;
				//СтрокиЗаказа[0].Сумма = СтрокиЗаказа[0].Цена * СтрокиЗаказа[0].Количество; 
				//СтрокиЗаказа[0].Всего = СтрокиЗаказа[0].Сумма;
				//СтрокиЗаказа[0].ВсегоБезСкидки = СтрокиЗаказа[0].ЦенаБезСкидки * СтрокиЗаказа[0].Количество;
				 b2b_ОбменЗаявками.РассчитатьСуммуТабЧасти_(СтрокиЗаказа[0],ОбъектЗаказ); 
			КонецЕсли;
			//
			//СтруктураТовара = Новый Структура("Действие,КоличествоРезерв,КоличествоДозаказ",СтрокаТовара.Действие,СтрокаТовара.КоличествоРезерв,СтрокаТовара.КоличествоДоЗаказ); 
			//СоответствиеТоварДействие.Вставить(СтрокаТовара.Номенклатура,СтруктураТовара); 
			
		КонецЦикла;
		
		Попытка 			
			
			Попытка			
				ОбъектЗаказ.Записать(РежимЗаписиДокумента.Проведение); 			
			Исключение
				Если ОбъектЗаказ.Проведен Тогда
					ОбъектЗаказ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Иначе 
					ОбъектЗаказ.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;
				
			КонецПопытки;
			 
			
			ПараметрыЗаписиВРегистр = Новый Структура; 
			ПараметрыЗаписиВРегистр.Вставить("ПлановаяДатаОтгрузки",ПлановаяДатаОтгрузки);
			ПараметрыЗаписиВРегистр.Вставить("МетодДоставки",МетодДоставки);
			ПараметрыЗаписиВРегистр.Вставить("СоответствиеТоварКоличествоРезерв",СоответствиеТоварКоличествоРезерв);
			ПараметрыЗаписиВРегистр.Вставить("СоответствиеТоварЦенаСкидка",СоответствиеТоварЦенаСкидка);
			b2b_ОбменЗаявками.ЗаписатьДополнительныеДанныеВРегистрЗаказов(Заказ.Ссылка,ПараметрыЗаписиВРегистр);
			
			
			Модифицированность = Ложь;
			ИзмененияПоЗаказу = Ложь;
			ИзмененияПоЗаказуСтроки = Ложь; 
			
			Если ИзменитьДозаказ Тогда
			
				СоздатьДозаказНаСервере();	
			
			КонецЕсли;
			
			 СнятьФлагИзмененияСтроки("Данные");
			 
		Исключение
			 МассивОшибок.Добавить(ОписаниеОшибки()); 
		КонецПопытки;
	Иначе 
		
		ПараметрыЗаписиВРегистр = Новый Структура; 
		ПараметрыЗаписиВРегистр.Вставить("ПлановаяДатаОтгрузки",ПлановаяДатаОтгрузки);
		ПараметрыЗаписиВРегистр.Вставить("МетодДоставки",МетодДоставки);
		ПараметрыЗаписиВРегистр.Вставить("ВспомогательныеРеквизиты",Истина);
		b2b_ОбменЗаявками.ЗаписатьДополнительныеДанныеВРегистрЗаказов(Заказ.Ссылка,ПараметрыЗаписиВРегистр);
		
		ПараметрыЗаписиВРегистр = Новый Структура; 
		//ПараметрыЗаписиВРегистр.Вставить("МетодДоставки",МетодДоставки); 
		b2b_ОбменЗаявками.ЗаписатьДополнительныеДанныеВРегистрДоЗаказов(Дозаказ.Ссылка,ПараметрыЗаписиВРегистр,ЛОЖЬ);
		
	Конецесли; 
	
КонецФункции // ПреобразоватьТоварыДляПередачи()

&НаСервере
Процедура СоздатьДозаказНаСервере()
	
	ИтогДозаказ = Данные.Итог("КоличествоДозаказ"); 
	
	Если ИтогДозаказ = 0  Тогда
		
		Сообщить("Не найдены товары для формирования запроса на дозаказ");
		
		МассивОшибок.Добавить("Не найдены товары для формирования запроса на дозаказ"); 
		Возврат; 
		
	КонецЕсли;
	
	ЗаказНовый = СоздатьНовыйДокументЗаказаПоДозаказу();
	
	ЗаблокироватьДанныеДляРедактирования(ЗаказНовый,,ЭтаФорма.УникальныйИдентификатор); 
	
	ЗаполнитьТаблицуТоваровПоЗаказу();
		
	
КонецПроцедуры

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервере
Функция СоздатьНовыйДокументЗаказаПоДозаказу()
	
	КомментарийЕЕЭАвтомЗаполнение = ""; 
	Если НЕ ЗначениеЗаполнено(Дозаказ) Тогда
		
		НовыйДокумент = Документы.Заказ.СоздатьДокумент();
		СписокСвойств = "ИдЗаказа,НомерЗаказа,ДатаЗаказа,ИсточникЗаказа,Контрагент,ТипЦен,ИБ,ДатаОтгрузки,ТипЦенРаспродажа,
		|ВидОплаты,КодОперации,Склад,Валюта,Менеджер,Курс,Договор,ПунктДоставки,ОтсрочкаПлатежа,Организация,Подразделение,Отгружен"; 
		
		Если ЗначениеЗаполнено(ПлановаяДатаОтгрузкиДозаказа) Тогда
		
			НовыйДокумент.ДатаОтгрузки = ПлановаяДатаОтгрузкиДозаказа; 	
		
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(НовыйДокумент,Заказ,СписокСвойств);
		
		НовыйДокумент.Дата = ТекущаяДатаСеанса(); 
		НовыйДокумент.ДатаОформления =  ТекущаяДатаСеанса();
		НовыйДокумент.Автор = ПараметрыСеанса.Пользователь;
		//НовыйДокумент.Контрагент = Заказ.Контрагент;
		НовыйДокумент.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.ВРаботе;
		НовыйДокумент.СостояниеСогласования = Перечисления.СостоянияСогласования.НаСогласованииЦО; //сразу отправляется на портал ( в очередь на отправку)
		
		НовыйДокумент.Комментарий = "Создан документ дозаказа из основного " + Строка(Заказ);
		НовыйДокумент.b2b_Дозаказ = Истина;
		
		КомментарийЕЕЭАвтомЗаполнение = Строка(НовыйДокумент.Контрагент) + ", №заявки " + Строка(НовыйДокумент.НомерЗаказа); 
		
		КомментарийКДозаказу = КомментарийЕЕЭАвтомЗаполнение;
		
		НовыйДокумент.ДополнительныеСвойства.Вставить("Этоb2bЗаказ", Истина);
	Иначе 
		
		НовыйДокумент = Дозаказ.ПолучитьОбъект(); 
		
	КонецЕсли; 
	
	МассивТоваровНаДозаказ = Новый Массив; 
	ЗаказОбъект = Заказ.ПолучитьОбъект(); 
	
	Для каждого Строка Из  Данные Цикл
		Если Строка.КоличествоДозаказ = 0 Тогда
			//ИЛИ НЕ Строка.ИзмененаСтрока Тогда
		
			Продолжить;  	
		
		КонецЕсли;
		
		ОтборПоТовару = Новый Структура("Номенклатура",Строка.Номенклатура);
		СтрокиДок = НовыйДокумент.Товары.НайтиСтроки(ОтборПоТовару); 
		Если СтрокиДок.Количество() = 0  Тогда
			
			Новыйтовар =  НовыйДокумент.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(Новыйтовар,Строка);
			Новыйтовар.СтавкаНДС = b2b_ОбменЗаявками.ПолучитьСтавкуНДС_(Новыйтовар.Номенклатура); //.Родитель.СтавкаНДС; 
			Новыйтовар.Цена = Строка.Цена;
			Новыйтовар.ЦенаИсточник = Строка.ЦенаИсточник;
			Новыйтовар.ЦенабезСкидки = Строка.ЦенаБезСкидки;
			Новыйтовар.Количество = Строка.КоличествоДоЗаказ;
			НовыйТовар.Заявка =  Новыйтовар.Количество;
			
			//НовыйТовар.Сумма = Новыйтовар.Количество  * Строка.Цена; 
			//
			//НовыйТовар.Всего = НовыйТовар.Сумма; 
			//Новыйтовар.ВсегоБезСкидки = Новыйтовар.ЦенабезСкидки * Новыйтовар.Количество;
			b2b_ОбменЗаявками.РассчитатьСуммуТабЧасти_(НовыйТовар,НовыйДокумент); 
			Новыйтовар.ПодтвержденнаяЗаявка = 0;
			
		Иначе 
			Новыйтовар = СтрокиДок[0]; 
			Новыйтовар.Количество = Новыйтовар.Количество + Строка.КоличествоДоЗаказ;
			Если НЕ ЗначениеЗаполнено(СостояниеДоЗаказа) Тогда
			
				НовыйТовар.Заявка =  Новыйтовар.Количество;	
			
			КонецЕсли;
			//НовыйТовар.Сумма = Новыйтовар.Количество  * Строка.Цена; 
			////НовыйТовар.Заявка =  Новыйтовар.Количество;
			//НовыйТовар.Всего = НовыйТовар.Сумма; 
			//Новыйтовар.ВсегоБезСкидки = Новыйтовар.ЦенабезСкидки * Новыйтовар.Количество;
			
			b2b_ОбменЗаявками.РассчитатьСуммуТабЧасти_(НовыйТовар,НовыйДокумент);
		КонецЕсли;
				 
		//НовыйТовар.Сумма = Новыйтовар.Количество  * Новыйтовар.Цена;
		//НовыйТовар.Всего = НовыйТовар.Сумма;
		//НовыйТовар.ВсегоБезСкидки = НовыйТовар.Сумма;
		
		СтруктураТовара = новый Структура("Номенклатура,Количество,ЖелаемаяДатаОтгрузки,Комментарий"); 
		ЗаполнитьЗначенияСвойств(СтруктураТовара,Строка);
		СтруктураТовара.Количество = Новыйтовар.Количество; 
		МассивТоваровНаДозаказ.Добавить(СтруктураТовара); 
		
		Если Строка.КоличествоДозаказ = Строка.Заявка Тогда
			
			СтрокаДляУдалить = ЗаказОбъект.Товары.Найти(Строка.Номенклатура,"Номенклатура"); 
			Если ЗначениеЗаполнено(СтрокаДляУдалить) Тогда
				
				ЗаказОбъект.Товары.Удалить(СтрокаДляУдалить);	
				
			КонецЕсли;
			
		ИначеЕсли  Строка.КоличествоДозаказ < Строка.ПодтвержденнаяЗаявка
			 И НЕ ЗначениеЗаполнено(Дозаказ) Тогда  //если изменение, то не нужно вычитать, уже записано количество резерв 
			
			//СтрокаДляИзменения = ЗаказОбъект.Товары.Найти(Строка.Номенклатура,"Номенклатура");
			//СтрокаДляИзменения.Количество = СтрокаДляИзменения.Количество - Строка.КоличествоДозаказ;
			////СтрокаДляИзменения.Цена = 0; 
			//СтрокаДляИзменения.Сумма = СтрокаДляИзменения.Количество  * СтрокаДляИзменения.Цена;
			//СтрокаДляИзменения.Всего = СтрокаДляИзменения.Сумма;
			//СтрокаДляИзменения.ВсегоБезСкидки = СтрокаДляИзменения.Сумма;
			
		КонецЕсли;
				
	КонецЦикла;
	
	Попытка
		
		Попытка
		
			 НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		
		Исключение
		     НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
		
		Дозаказ = НовыйДокумент.ссылка; 
		
		ПараметрыЗаписиНового = Новый Структура; 
		ПараметрыЗаписиНового.Вставить("ОсновнойЗаказ",Заказ); 
		ПараметрыЗаписиНового.Вставить("ПлановаяДатаОтгрузки",НовыйДокумент.ДатаОтгрузки);
		//удалить из заказа основного и записать в Регистры
		
		ЗаказОбъект.Записать();
		
		
		b2b_ОбменЗаявками.ЗаписатьДополнительныеДанныеВРегистрЗаказов(НовыйДокумент.Ссылка,ПараметрыЗаписиНового);
		
		b2b_ОбменЗаявками.ЗаписатьДополнительныеДанныеВРегистрЗаказов(ЗаказОбъект.Ссылка,Новый Структура);
		
		ПараметрыЗаписиВРегистр = Новый Структура; 
		ПараметрыЗаписиВРегистр.Вставить("Товары",МассивТоваровНаДозаказ);
		ПараметрыЗаписиВРегистр.Вставить("ОсновнойЗаказ",ЗаказОбъект.Ссылка);
		ПараметрыЗаписиВРегистр.Вставить("Дополнить",Истина);
		Если  ЗначениеЗаполнено(КомментарийЕЕЭАвтомЗаполнение) Тогда
		
			ПараметрыЗаписиВРегистр.Вставить("Комментарий",КомментарийЕЕЭАвтомЗаполнение);	
		
		КонецЕсли;
		ПараметрыЗаписиВРегистр.Вставить("ПунктДоставки",ПунктДоставки);
		ПараметрыЗаписиВРегистр.Вставить("Контрагент",ЮрЛицоДозаказа);
		b2b_ОбменЗаявками.ЗаписатьДополнительныеДанныеВРегистрДоЗаказов(НовыйДокумент.Ссылка,ПараметрыЗаписиВРегистр,ЛОЖЬ);
		
	Исключение
		
		Сообщить(ОписаниеОшибки()); 
		
		МассивОшибок.Добавить(ОписаниеОшибки()); 
	КонецПопытки;
	
	Возврат НовыйДокумент.Ссылка; 
	
КонецФункции // СоздатьНовыйДокументЗаказаПоДозаказу()

&НаКлиенте
Процедура ОтправитьНаСогласованиеКлиенту(Команда)
	
	МассивОшибок.Очистить();
	
	Если НЕ Заказ.Проведен 
		ИЛИ (ЗначениеЗаполнено(Дозаказ) И Не Дозаказ.Проведен) Тогда
		
		ТекстВопроса = "Найдены непроведенные документы, провести?"; 
		
		Если НЕ Заказ.Проведен 
			И (НЕ ЗначениеЗаполнено(Дозаказ) 
			ИЛИ ЗначениеЗаполнено(Дозаказ) И Дозаказ.Проведен) Тогда
			
			ТекстВопроса = "Не проведен заказ резерва, провести документ?";  	
			
		ИначеЕсли ЗначениеЗаполнено(Дозаказ) И НЕ Дозаказ.Проведен И Заказ.Проведен тогда 
			
			ТекстВопроса = "Не проведен дозаказ, провести документ?"; 
			
		ИначеЕсли НЕ Заказ.Проведен И ЗначениеЗаполнено(Дозаказ) И НЕ Дозаказ.Проведен Тогда
			
			ТекстВопроса = "Не все документы проведены, провести документы?"; 
			
		КонецЕсли;
		
		
		  
		
		ОповещениеВопрос = Новый ОписаниеОповещения("ВопросПровестиДокументОтправкаПолностью",ЭтаФорма); 
		ПоказатьВопрос(ОповещениеВопрос,ТекстВопроса,РежимДиалогаВопрос.ДаНет); 
		
	Иначе
		
		ОтправитьНаСогласованиеЗаказПолностью();
		
		ОбновитьЗаказНаСервере();
		ДоступностьРедактированияЗаказа(); 	
		ВывестиПодсказкиПредупреждения();
		ВывестиТекстОшибок();
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВопросПровестиДокументОтправкаПолностью(ОтветНаВопрос,ДополнительныеПараметры) Экспорт 
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		
		 
		РезультатПроведения = Истина; 
		Если Не Заказ.Проведен Тогда
			
			ТекстСообщения = "";
			РезультатПроведенияЗаказ = Ложь; 
			ПровестиДокументЗаказаНаСервере(Заказ,РезультатПроведенияЗаказ,ТекстСообщения); 
			МассивОшибок.Добавить(ТекстСообщения);
			
			Если НЕ РезультатПроведенияЗаказ Тогда
				РезультатПроведения = ложь; 
			Конецесли; 
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Дозаказ) И Не Дозаказ.Проведен Тогда
			
			ТекстСообщения = "";
			РезультатПроведенияЗаказ = Ложь;
			ПровестиДокументЗаказаНаСервере(Дозаказ,РезультатПроведенияЗаказ,ТекстСообщения); 
			МассивОшибок.Добавить(ТекстСообщения);	
			Если НЕ РезультатПроведенияЗаказ Тогда
				РезультатПроведения = ложь; 
			Конецесли;
		КонецЕсли; 	
		
		Если  РезультатПроведения Тогда
			
			ОтправитьНаСогласованиеЗаказПолностью();		
			
			ОбновитьЗаказНаСервере();
			ДоступностьРедактированияЗаказа(); 	
			ВывестиПодсказкиПредупреждения();			
			
		КонецЕсли;
		
		ВывестиТекстОшибок();
		
		
		
	Иначе 
		ПоказатьПредупреждение(,"Операция отменена, нельзя отпправить на согласование непроведенные документы"); 
	КонецЕсли; 	

КонецПроцедуры // ()


// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ОтменитьЗаказ(ПричинаОтмены)

	//учесть что не все товары, могут быть включены 
	//еще необходимо продумать резерв 
	
	ПараметрыДляОтправки = Новый Структура; 
	ПараметрыДляОтправки.Вставить("НомерЗаявки",Заказ.НомерЗаказа);
	ПараметрыДляОтправки.Вставить("IDЗаявки",заказ.ИдЗаказа);
	ПараметрыДляОтправки.Вставить("СтатусЗаказа","ZD");
	ПараметрыДляОтправки.Вставить("КомментарийОтмены",Строка(ПричинаОтмены));
	
	ПараметрыДляОтправки.Вставить("Дозаказ",Дозаказ.Ссылка);
	
	МассивСообщений = новый Массив; 
	b2b_ОбменЗаявками.ЗаписатьВОчередьНаОтправку(Заказ,"ОтменитьЗаявку",ПараметрыДляОтправки,МассивСообщений);
	
	Для каждого ЭлементМассива Из МассивСообщений Цикл
	
		МассивОшибок.Добавить(ЭлементМассива); 	
	
	КонецЦикла; 

КонецПроцедуры // ПередатьВесьЗаказ()

&НаСервере
Процедура ОтправитьНаСогласованиеТолькоЗаказ()
	
	МассивТоваров = ДобавитьВМассивТоварыЗаказа();
	
	Если МассивТоваров.Количество() = 0  Тогда
	
		Сообщить("Не найдены товары для отправки"); 
		Возврат; 
	
	КонецЕсли; 	
	
	ПараметрыДляОтправки = Новый Структура; 
	ПараметрыДляОтправки.Вставить("НомерЗаявки",Заказ.НомерЗаказа);
	ПараметрыДляОтправки.Вставить("IDЗаявки",заказ.ИдЗаказа);
	ПараметрыДляОтправки.Вставить("СтатусЗаказа","ZA");
	
	ПараметрыДляОтправки.Вставить("Товары",МассивТоваров);
	
	ПараметрыДляОтправки.Вставить("Дозаказ",Дозаказ.Ссылка);
	//ПараметрыДляОтправки.Вставить("Заказ",Заказ.Ссылка);
	
	МассивСообщений = Новый Массив; 
	b2b_ОбменЗаявками.ЗаписатьВОчередьНаОтправку(Заказ,"ОтправитьклиентуТолькоВНаличии",ПараметрыДляОтправки,МассивСообщений);
	
	Сообщить("Отправлен запрос на подтверждение только товара в наличии");
	МассивОшибок.Добавить("Отправлен запрос на подтверждение только товара в наличии"); 
	
	Для каждого ЭлементМассива Из МассивСообщений Цикл
	
		МассивОшибок.Добавить(ЭлементМассива); 	
	
	КонецЦикла;
 

КонецПроцедуры

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервере
Функция ДобавитьВМассивТоварыЗаказа(Дозаказ = Ложь)
	 МассивДанных = Новый Массив; 
	 Для каждого СтрокаДанных Из Данные Цикл
		 
		 СтруктураТовара = Новый Структура; 
		 СтруктураТовара.Вставить("IDТовара",b2b_ОбменЗаявками.ПолучитьКодТовараДляПортала(СтрокаДанных.Номенклатура));
		 СтруктураТовара.Вставить("Количество",?(Дозаказ,0,СтрокаДанных.Количество));
		 СтруктураТовара.Вставить("Цена",СтрокаДанных.Цена);
		 
		 МассивДанных.Добавить(СтруктураТовара); 
		 
	 КонецЦикла;
	 
	 Возврат МассивДанных; 

КонецФункции // ДобавитьВМассивТоварыЗаказа()

&НаСервере
Функция ДобавитьВМассивТоварыДоЗаказа()
	 МассивДанных = Новый Массив; 
	 Для каждого СтрокаДанных Из ДанныеДозаказа Цикл
		 
		 СтруктураТовара = Новый Структура; 
		 СтруктураТовара.Вставить("IDТовара",b2b_ОбменЗаявками.ПолучитьКодТовараДляПортала(СтрокаДанных.Номенклатура));
		 СтруктураТовара.Вставить("Количество",СтрокаДанных.Количество);
		//СтруктураТовара.Вставить("Цена",СтрокаДанных.Цена);
		 
		 МассивДанных.Добавить(СтруктураТовара); 
		 
	 КонецЦикла;
	 
	 Возврат МассивДанных; 

КонецФункции

&НаСервере
Процедура ОтправитьНаСогласованиеТолькоДоЗаказ()

	МассивТоваров = ДобавитьВМассивТоварыЗаказа(истина); 
	
	ПараметрыДляОтправки = Новый Структура; 
	ПараметрыДляОтправки.Вставить("НомерЗаявки",Заказ.НомерЗаказа);
	ПараметрыДляОтправки.Вставить("IDЗаявки",заказ.ИдЗаказа);
	ПараметрыДляОтправки.Вставить("СтатусЗаказа","ZA");
	
	ПараметрыДляОтправки.Вставить("Товары",МассивТоваров);
	
	ПараметрыДляОтправки.Вставить("ОсновнойЗаказ",Заказ.ссылка);
	
	МассивСообщений = Новый Массив; 
	b2b_ОбменЗаявками.ЗаписатьВОчередьНаОтправку(Дозаказ.ссылка,"ОтправитьклиентуТолькоДозаказ",ПараметрыДляОтправки,МассивСообщений);
	
	Сообщить("Отправлен запрос клиенту на подтверждение дозаказа");
	
	МассивОшибок.Добавить("Отправлен запрос клиенту на подтверждение дозаказа"); 
	Для каждого ЭлементМассива Из МассивСообщений Цикл
	
		МассивОшибок.Добавить(ЭлементМассива); 	
	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСогласованиеЗаказПолностью()
	
	МассивТоваров = ДобавитьВМассивТоварыЗаказа();
	
	МассивТоваровДозаказа = ДобавитьВМассивТоварыДоЗаказа();
	
	ПараметрыДляОтправки = Новый Структура; 
	ПараметрыДляОтправки.Вставить("НомерЗаявки",Заказ.НомерЗаказа);
	ПараметрыДляОтправки.Вставить("IDЗаявки",заказ.ИдЗаказа);
	ПараметрыДляОтправки.Вставить("СтатусЗаказа","ZA"); 	
	ПараметрыДляОтправки.Вставить("Дозаказ",Дозаказ.Ссылка);
	ПараметрыДляОтправки.Вставить("Товары",МассивТоваров);
	ПараметрыДляОтправки.Вставить("ТоварыДозаказа",МассивТоваровДозаказа);
	
	МассивСообщений = Новый Массив; 
	b2b_ОбменЗаявками.ЗаписатьВОчередьНаОтправку(Заказ.ссылка,"ОтправитьКлиентуПолностью",ПараметрыДляОтправки,МассивСообщений);
	Для каждого ЭлементМассива Из МассивСообщений Цикл
	
		МассивОшибок.Добавить(ЭлементМассива); 	
	
	КонецЦикла; 
КонецПроцедуры



// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ОтправитьНаСогласованиеКлиентуВопрос(ОтветНаВопрос,ДополнительныеПараметры) Экспорт
	
	//Если ОтветНаВопрос = "ОтправитьТолькоВналичии" Тогда
	//	
	//	ОтправитьНаСогласованиеТолькоЗаказ(истина); 
	//	
	//ИначеЕсли ОтветНаВопрос = "ОтправитьТолькоДозаказ" Тогда
	//	
	//	Если ПроверкаСостоянияДозаказа() Тогда
	//	
	//		ОтправитьНаСогласованиеТолькоДоЗаказ(); 
	//	
	//	КонецЕсли;
	//	
	//ИначеЕсли ОтветНаВопрос = "ОтправитьВсе" Тогда
	//	
	//	Если  ПроверкаСостоянияДозаказа() Тогда
	//		
	//		ОтправитьНаСогласованиеЗаказПолностью()
	//			  
	//	
	//	КонецЕсли;
	//	
	//КонецЕсли;

КонецПроцедуры // ОтправитьНаСогласованиеКлиентуВопрос()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаКлиенте
Функция ПроверкаСостоянияДозаказа()

	Если Не ЗначениеЗаполнено(СостояниеДоЗаказа) Тогда
	    
	    ПоказатьПредупреждение(,"Необходимо создать дозаказ"); 
	    
	    Возврат ЛОЖЬ; 	
	    
	ИначеЕсли СостояниеДоЗаказа <> ПредопределенноеЗначение("Перечисление.b2b_СтатусыДоЗаказов.ТребуетПодтверждения") Тогда  
	    
	    ПоказатьПредупреждение(,"Не завершен процесс оформления дозаказа");
	    
	    Возврат ЛОЖЬ;
		
	КонецЕсли;
	
	Возврат Истина; 

КонецФункции // ОтправитьВсе()



// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Функция ЕстьДоЗаказ()

		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕЭ_ДозаказыСрезПоследних.Заказ КАК Заказ,
		|	ЕЭ_ДозаказыСрезПоследних.СтатусДоЗаказа_b2b КАК СтатусДоЗаказа_b2b
		|ИЗ
		|	РегистрСведений.b2b_Дозаказы КАК ЕЭ_ДозаказыСрезПоследних
		|ГДЕ
		|	ЕЭ_ДозаказыСрезПоследних.ЗаказОсновной = &заказ";
	
	Запрос.УстановитьПараметр("заказ", заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(); 
	
	СтатусДоЗаказа_b2b = неопределено; 
	
	Если Выборка.Следующий() Тогда
	
		СтатусДоЗаказа_b2b = Выборка.СтатусДоЗаказа_b2b; 	
	
	КонецЕсли;
	
	Возврат НЕ РезультатЗапроса.Пустой() 
	И СтатусДоЗаказа_b2b <> ПредопределенноеЗначение("Перечисление.b2b_СтатусыДоЗаказов.Выполнен"); 

КонецФункции // ЕстьДоЗаказ()

&НаКлиенте
Процедура ОтменитьЗаказКоманда(Команда)
	
	Перем ПричинаТекст; 
	
	МассивОшибок.Очистить(); 
	//ПричинаТекст = "Причина отмены"; 
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтменитьЗаказВводПричины",ЭтаФорма); 
	ПоказатьВводЗначения(ОписаниеОповещения,ПричинаТекст,"Причина отмены",Тип("СправочникСсылка.b2b_ПричиныОтменыЗаявок")); 
	
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ОтменитьЗаказВводПричины(ЗначениеВвода,ДополнительныеПараметры)Экспорт

	Если ЗначениеЗаполнено(ЗначениеВвода) Тогда
	
		ОтменитьЗаказ(ЗначениеВвода);
		
		ПричинаОтменыЗаявки = Строка(ЗначениеВВода); 
		Элементы.ПричинаОтменыЗаявки.Видимость = Истина; 
		
		ПараметрыЗаписиВРегистр = Новый Структура; 
		ПараметрыЗаписиВРегистр.Вставить("ПричинаОтменыЗаявки",ЗначениеВВода);
		b2b_ОбменЗаявками.ЗаписатьДополнительныеДанныеВРегистрЗаказов(Заказ.Ссылка,ПараметрыЗаписиВРегистр);
		
		ОбновитьЗаказНаСервере();
		ДоступностьРедактированияЗаказа(); 	
		ВывестиПодсказкиПредупреждения();
		ВывестиТекстОшибок();

	Иначе 
		
		 
		 ПоказатьПредупреждение(,"Необходимо обязательно ввести причину!")

	КонецЕсли;

КонецПроцедуры // ОписаниеОповещения()


&НаКлиенте
Процедура ПодтвердитьДозаказ(Команда)
	МассивОшибок.Очистить();
	Если СостояниеДоЗаказа =  ПредопределенноеЗначение("Перечисление.b2b_СтатусыДоЗаказов.ПредварительноПодтвержден")
		И СостояниеЗаявки = ПредопределенноеЗначение("Перечисление.b2b_СтатусыЗаказов.Согласована") Тогда
	
		ПодтвердитьДозаказНаСервере();
		
		ОбновитьЗаказНаСервере();
		ДоступностьРедактированияЗаказа(); 	
		ВывестиПодсказкиПредупреждения();
	Иначе 
		Сообщить("Запрос на подтверждение не может быть отправлен, проверьте состояние заявки");
		МассивОшибок.Добавить("Запрос на подтверждение не может быть отправлен, проверьте состояние заявки"); 
	КонецЕсли;
	ВывестиТекстОшибок();
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ПодтвердитьДозаказНаСервере()

	ПараметрыДляОтправки = Новый Структура; 
	ПараметрыДляОтправки.Вставить("НомерЗаявки",Заказ.НомерЗаказа);
	ПараметрыДляОтправки.Вставить("IDЗаявки",заказ.ИдЗаказа);
	ПараметрыДляОтправки.Вставить("СтатусДоЗаказа","P");
	
	МассивСообщений = Новый Массив; 
	
	b2b_ОбменЗаявками.ЗаписатьВОчередьНаОтправку(Заказ,"ПодтвердитьДозаказ",ПараметрыДляОтправки,МассивСообщений);
	Для каждого ЭлементМассива Из МассивСообщений Цикл
	
		МассивОшибок.Добавить(ЭлементМассива); 	
	
	КонецЦикла;

КонецПроцедуры // ПодтвердитьДозаказНаСервере()


&НаКлиенте
Процедура ОбновитьЗаказ(Команда)
	МассивОшибок.Очистить();
	ОбновитьЗаказНаСервере(); 	
	
	ДоступностьРедактированияЗаказа();
	
	ВывестиПодсказкиПредупреждения();
	ВывестиТекстОшибок();
	
	
	b2b_ОбменЗаявками.ОчиститьРегистрОбновленныеЗаказыПоЗаказу(Заказ);
	
	Дозаказ = b2b_ОбменЗаявками.НайтиДоЗаказпоОсновному(Заказ);
	Если ЗначениеЗаполнено(Дозаказ) Тогда
		
		b2b_ОбменЗаявками.ОчиститьРегистрОбновленныеЗаказыПоЗаказу(Дозаказ);	
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаказНаСервере(ВернутьИсходноеСостояние = Ложь)
	
	ПараметрыПолучения = Новый Структура;
	ПараметрыПолучения.Вставить("номерЗаявки",Заказ.НомерЗаказа);
	ПараметрыПолучения.Вставить("ВернутьИсходноеСостояние",ВернутьИсходноеСостояние);
	
	ПараметрыПолучения.Вставить("ИзЗаказа",Истина); 
	
	ОбновленныеЗаказы = Новый Массив; 
	
	b2b_ОбменЗаявками.ПолучениеДанныхПоЗаказам(ПараметрыПолучения,ОбновленныеЗаказы); 
	
	//Если ОбновленныеЗаказы.Количество() > 0  Тогда
		
	ЗаполнитьТаблицуТоваровПоЗаказу();
	
	СостояниеЗаказа = Заказ.СостояниеНакладной;
	СостояниеСогласования = Заказ.СостояниеСогласования;
	
	НомерЗаявкиКонтрагента = Заказ.НомерЗаказа; 
	
	РНКСуществующее = неопределено; 
	
	РезультатПроверкиСвязи =  b2b_ОбменЗаявками.ПроверитьСвязьСРНК(Заказ.ссылка,РНКСуществующее);
	Если ЗначениеЗаполнено(РНКСуществующее) Тогда
		
		РасходнаяНакладная1 = РНКСуществующее.ссылка;	
	Иначе 
		РасходнаяНакладная1 = Документы.РасходнаяНакладная.ПустаяСсылка(); 
	КонецЕсли;
	
	РНКСуществующее = неопределено; 
	
	РезультатПроверкиСвязи =  b2b_ОбменЗаявками.ПроверитьСвязьСРНК(Дозаказ.ссылка,РНКСуществующее);
	Если ЗначениеЗаполнено(РНКСуществующее) Тогда
		
		РасходнаяНакладная2 = РНКСуществующее.ссылка;	
	Иначе 
		РасходнаяНакладная2 = Документы.РасходнаяНакладная.ПустаяСсылка();
	КонецЕсли;
	
	РедактированиеДозаказаПоУмолчанию = (СостояниеДоЗаказа = ПредопределенноеЗначение("Перечисление.b2b_СтатусыДоЗаказов.ТребуетПодтверждения")) 
	И СостояниеЗаявки = ПредопределенноеЗначение("Перечисление.b2b_СтатусыЗаказов.ЖдетПодтвержденияДистрибьютором");
	Если РедактированиеДозаказаПоУмолчанию Тогда
		
		НеПересчитыватьКоличествоДозаказ = Истина; 	
		
	КонецЕсли;
КонецПроцедуры // ОбновитьЗаказыНаСервере()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура УстановитьУсловноеОформление() 	
	
	Для каждого ЗначениеСписка Из Элементы.ДанныеДействие.СписокВыбора Цикл
        
        Элемент = УсловноеОформление.Элементы.Добавить();
        ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
        ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДанныеДействие.Имя);
        
        ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Данные.Действие");
        ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
        ОтборЭлемента.ПравоеЗначение = ЗначениеСписка.Значение;
        
        Элемент.Оформление.УстановитьЗначениеПараметра("Текст", ЗначениеСписка.Представление);
                
	КонецЦикла;
	
	Элемент = УсловноеОформление.Элементы.Добавить(); 	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Данные");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Данные.ИзмененаСтрока");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Роса);
	
	
	Элемент = УсловноеОформление.Элементы.Добавить(); 	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДанныеДозаказа");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДанныеДозаказа.ИзмененаСтрока");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Роса);
	
	
	Элемент = УсловноеОформление.Элементы.Добавить(); 	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДанныеКоличество");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Данные.ПодтвержденнаяЗаявка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Данные.Количество");
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЗолотистый);
	
	Элемент = УсловноеОформление.Элементы.Добавить(); 	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДанныеДозаказаКоличество");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДанныеДозаказа.ПодтвержденнаяЗаявка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ДанныеДозаказа.Заявка");;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЗолотистый);
	
	
	Элемент = УсловноеОформление.Элементы.Добавить(); 	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДанныеКоличество");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Данные.КоличествоРезерв");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Данные.Количество");
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЗолотистый);


КонецПроцедуры // УстановитьУсловноеОформление()

&НаКлиенте
Процедура РедактированиеВФормеЗаказа(Команда)
	
	//ОповещениеВопрос = Новый ОписаниеОповещения("РедактированиеВФормеЗаказаВопрос",ЭтаФорма);
	//СписокВопрос = Новый СписокЗначений; 
	//СписокВопрос.Добавить("ОткрытьЗаказРедактирование","Открыть заказ для редактирования"); 
	//СписокВопрос.Добавить("ОткрытьЗаказПросмотр","Открыть заказ для просмотра");
	//СписокВопрос.Добавить("Отмена","Отмена");
	//
	//ПоказатьВопрос(ОповещениеВопрос,"Открыть заказ для редактирования или оставить для просмотра?",СписокВопрос); 
	
	РазблокироватьДокументыЗаказовДляРедактирования(Истина);
	
	ФормаЗаказа = ПолучитьФорму("Документ.Заказ.Форма.ФормаДокумента",Новый Структура("Ключ",Заказ),ЭтаФорма); 
	ФормаЗаказа.ИзАРМb2b = истина; 
	ФормаЗаказа.КлючУникальности = Строка(Новый УникальныйИдентификатор); 
	
	ФормаЗаказа.ОткрытьМодально(); 
	
	//ЗаполнитьТаблицуТоваровПоЗаказу(); 
	//
	//СостояниеЗаказа = Заказ.СостояниеНакладной;
	//СостояниеСогласования = Заказ.СостояниеСогласования;
	
	ОбновитьИзЗаказа(""); 
	
	ЗаблокироватьДокументыЗаказовДляРедактирования(Истина);
	
	СохранитьЗаказНаСервере(Истина);
	
КонецПроцедуры
// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
//&НаКлиенте
//Процедура РедактированиеВФормеЗаказаВопрос(ОтветНаВопрос,ДополнительныеПараметры) Экспорт 

//	Если ОтветНаВопрос = "ОткрытьЗаказПросмотр" Тогда
//		
//		ФормаЗаказа = ПолучитьФорму("Документ.Заказ.Форма.ФормаДокумента",Новый Структура("Ключ",Заказ),ЭтаФорма); 
//		ФормаЗаказа.ИзАРМb2b = истина; 
//		ФормаЗаказа.КлючУникальности = Строка(Новый УникальныйИдентификатор); 
//		
//		ФормаЗаказа.ОткрытьМодально(); 
//		
//		ЗаполнитьТаблицуТоваровПоЗаказу(); 
//		
//		СостояниеЗаказа = Заказ.СостояниеНакладной;
//		СостояниеСогласования = Заказ.СостояниеСогласования;
//		
//		СохранитьЗаказНаСервере(Истина);

//	
//	ИначеЕсли ОтветНаВопрос = "ОткрытьЗаказРедактирование" Тогда
//		
//		ФормаЗаказа = ПолучитьФорму("Документ.Заказ.Форма.ФормаДокумента",Новый Структура("Ключ",Заказ)); 
//		ФормаЗаказа.ИзАРМb2b = истина; 
//		ФормаЗаказа.КлючУникальности = Строка(Новый УникальныйИдентификатор); 
//		
//		ФормаЗаказа.Открыть();
//		
//		ЭтаФорма.Закрыть(); 
//		
//	Иначе 
//		Возврат; 
//	КонецЕсли;

//КонецПроцедуры // РедактированиеВФормеЗаказа()


// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура РазблокироватьДанныеДляРедактированияНаСервере(Знач ДокЗаказ,КлючУникальности)

	РазблокироватьДанныеДляРедактирования(ДокЗаказ,КлючУникальности);

КонецПроцедуры // ()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ЗаблокироватьДанныеДляРедактированияНаСервере(Знач ДокЗаказ,КлючУникальности)
	 
	ЗаблокироватьДанныеДляРедактирования(ДокЗаказ.ссылка,КлючУникальности);

КонецПроцедуры // ()



// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура РедактированиеВФормеЗаказаЗакрытие(ПараметрЗакрытия,ДополнительныеПараметры) Экспорт

	Если ПараметрЗакрытия <> неопределено Тогда
	
		ЗаполнитьТаблицуТоваровПоЗаказу(); 
		
		СостояниеЗаказа = Заказ.СостояниеНакладной;
		СостояниеСогласования = Заказ.СостояниеСогласования;
		
		СохранитьЗаказНаСервере(Истина); 
	
	КонецЕсли;

КонецПроцедуры // РедактированиеВФормеЗаказаЗакрытие()

&НаКлиенте
Процедура РассчитатьЦенуПоТоварам(Команда)
	РассчитатьЦенуПоТоварамНаСервере(); 
	НадписьИзменений();
	ЗаполнитьДанныеПодвала();
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура РассчитатьЦенуПоТоварамНаСервере()
	ДокументОбъект = Заказ.ПолучитьОбъект();
	ДокументОбъект.Скидка = Скидка; 
	ДокументОбъект.ДопСкидкаНаНакладную = ДопСкидкаНаНакладную; 
	
	Для каждого СтрокаТовара  Из Данные Цикл
	
		 Отбор  = Новый Структура("Номенклатура",СтрокаТовара.Номенклатура); 
		 СтрокиТовара = ДокументОбъект.Товары.НайтиСтроки(Отбор); 
		 Если  СтрокиТовара.Количество() > 0 Тогда
			 
			 СтрокиТовара[0].Скидка = СтрокаТовара.Скидка; 	
			 
		 КонецЕсли;
	КонецЦикла;
	b2b_ОбменЗаявками.ПересчетЦены(ДокументОбъект,Скидка);
	
	Для каждого ТоварСтрока Из ДокументОбъект.Товары Цикл
	
		Отбор = Новый Структура("Номенклатура",ТоварСтрока.Номенклатура); 
		СтрокиДанные = Данные.НайтиСтроки(Отбор);
		
		Если СтрокиДанные.Количество() > 0 Тогда
			
			ЦенаРанее = СтрокиДанные[0].Цена; 
		
			СтрокиДанные[0].Цена = ТоварСтрока.Цена;
			СтрокиДанные[0].ЦенаБезСкидки = ТоварСтрока.ЦенаБезСкидки;
			
			СтрокиДанные[0].Скидка = ТоварСтрока.Скидка;
			СтрокиДанные[0].Всего =  СтрокиДанные[0].Цена *СтрокиДанные[0].Количество; 
			Если ЦенаРанее <> СтрокиДанные[0].Цена  Тогда
				
				СтрокиДанные[0].ИзмененаСтрока = Истина; 
				Модифицированность = Истина; 
				ИзмененияПоЗаказу = Истина;
				ИзмененияПоЗаказуСтроки = Истина;	
				
			КонецЕсли;
		     
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры // ()


// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервере
Функция ДоступностьРедактированияЗаказа()
	
	Элементы.ГруппаНаДозаказ.Видимость = ЗначениеЗаполнено(Дозаказ); 
	Элементы.Группа5.Видимость = ЗначениеЗаполнено(Дозаказ);
	Элементы.ОтправитьНаСогласованиеДозаказ.Видимость = ЗначениеЗаполнено(Дозаказ);
	Элементы.ОтменитьОтгрузкуДозаказа.Видимость = ЗначениеЗаполнено(Дозаказ);

	ТолькоПросмотр = b2b_ОбменЗаявками.ДоступностьРедактированияЗаказа(Заказ); 
	
	//Если ТолькоПросмотр Тогда
		
	Элементы.Данные.ТолькоПросмотр = ТолькоПросмотр; 
	
	//Элементы.ГруппаДанныеПоДокументу.ТолькоПросмотр = ТолькоПросмотр;
	
	Элементы.ДанныеЗаполнитьПоОстаткам.Доступность = НЕ ТолькоПросмотр;
	Элементы.ФормаРассчитатьЦенуПоТоварам.Доступность = НЕ ТолькоПросмотр;		
	
	Элементы.ФормаСохранить.Доступность = НЕ ТолькоПросмотр; 
	Элементы.ФормаСоздатьДозаказ.Доступность = НЕ ТолькоПросмотр;
	Элементы.СохранитьДляДальнейшегоРедактирования.Доступность = НЕ ТолькоПросмотр;
	
	Элементы.КомментарийКДозаказу.ТолькоПросмотр = ТолькоПросмотр; 
	Элементы.КомментарийКЗаказу.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ГруппаКомандаОсновногозаказа.ТолькоПросмотр = ТолькоПросмотр; 
	Элементы.РедактироватьВФормеЗаказа.Доступность = Истина; 
		
	//КонецЕсли;
	Элементы.ПлановаяДатаОтгрузки.ТолькоПросмотр = ЗначениеЗаполнено(РасходнаяНакладная1);
	Элементы.ГруппаДанныеПоДокументу.ТолькоПросмотр = ЗначениеЗаполнено(РасходнаяНакладная1); 
	
	Элементы.ПлановаяДатаОтгрузкиДозаказа.ТолькоПросмотр = ЗначениеЗаполнено(РасходнаяНакладная2);
	Элементы.ФормаСохранить.Доступность = НЕ Элементы.ПлановаяДатаОтгрузки.ТолькоПросмотр ИЛИ НЕ Элементы.ПлановаяДатаОтгрузкиДозаказа.ТолькоПросмотр;
	
	Элементы.СохранитьДляДальнейшегоРедактирования.Доступность = (Не ЗначениеЗаполнено(Дозаказ) ИЛИ НЕ ЗначениеЗаполнено(СостояниеДоЗаказа)) 
	И СостояниеСогласования = Перечисления.СостоянияСогласования.НаСогласованииЦО
	И СостояниеЗаказа = Перечисления.СостоянияЗаказаКонтрагента.ВРаботе
	;
	
	СогласованныйЗаказ = СостояниеЗаявки = Перечисления.b2b_СтатусыЗаказов.Согласована; 
	
	Элементы.ПовторитьСозданиеДозаказаНаПортал.Видимость = Истина;
	Элементы.ПовторитьСозданиеДозаказаНаПортал.Доступность = Ложь;
	
	//Элементы.ПодтвердитьДозаказ.Видимость = Ложь;	
	//Элементы.ОтправитьНаСогласованиеДозаказ.Видимость = Ложь;
	//
	Элементы.ПодтвердитьДозаказ.Доступность = Ложь;	
	Элементы.ОтправитьНаСогласованиеДозаказ.Доступность = Ложь;
	
	ДозаказПодтвержденКонтрагентом = Не ЗначениеЗаполнено(Дозаказ) ИЛИ (СостояниеДоЗаказа = Перечисления.b2b_СтатусыДоЗаказов.ТребуетПодтверждения
	ИЛИ СостояниеДоЗаказа = Перечисления.b2b_СтатусыДоЗаказов.Оформлен ИЛИ СостояниеДоЗаказа = Перечисления.b2b_СтатусыДоЗаказов.Отменен); 
	
	//Элементы.ОтправитьНаСогласованиеВналичии.Видимость =  СостояниеЗаявки = Перечисления.b2b_СтатусыЗаказов.ЖдетПодтвержденияДистрибьютором И ДозаказПодтвержденКонтрагентом; 
	//Элементы.ФормаОтправитьНаСогласованиеКлиенту.Видимость = СостояниеЗаявки = Перечисления.b2b_СтатусыЗаказов.ЖдетПодтвержденияДистрибьютором И ДозаказПодтвержденКонтрагентом;
	ПустойЗаказОсновной = Заказ.Товары.Количество() = 0; 
	Элементы.ОтправитьНаСогласованиеВналичии.Доступность =  СостояниеЗаявки = Перечисления.b2b_СтатусыЗаказов.ЖдетПодтвержденияДистрибьютором 
	И ДозаказПодтвержденКонтрагентом
	И НЕ ПустойЗаказОсновной
	И НЕ ИзмененияПоЗаказу; 
	
	Элементы.ФормаОтправитьНаСогласованиеКлиенту.Доступность = СостояниеЗаявки = Перечисления.b2b_СтатусыЗаказов.ЖдетПодтвержденияДистрибьютором 
	И ДозаказПодтвержденКонтрагентом 
	И НЕ ПустойЗаказОсновной
	И НЕ ИзмененияПоДозаказу
	И НЕ ИзмененияПоЗаказу
	И НЕ СостояниеДоЗаказа = Перечисления.b2b_СтатусыДоЗаказов.Отменен;
	
	//Элементы.ОтправитьНаСогласованиеДозаказ.Видимость = СостояниеЗаявки = Перечисления.b2b_СтатусыЗаказов.ЖдетПодтвержденияДистрибьютором;
	
	Элементы.ФормаСоздатьДозаказ.Доступность = НЕ ЗначениеЗаполнено(СостояниеДоЗаказа) И НЕ ТолькоПросмотр И НЕ СогласованныйЗаказ; 
	Если Не ЗначениеЗаполнено(Дозаказ)
		И СостояниеЗаявки = Перечисления.b2b_СтатусыЗаказов.ЖдетПодтвержденияДистрибьютором Тогда
	
		Элементы.ФормаСоздатьДозаказ.Заголовок  = "Создать дозаказ";
		//Элементы.ПовторитьСозданиеДозаказаНаПортал.Видимость = Ложь;
		Элементы.ПовторитьСозданиеДозаказаНаПортал.Доступность = Ложь;
		
	Конецесли;
	
	ДоступностьРедактированияДоЗаказа = ЗначениеЗаполнено(Дозаказ)
		 И (НЕ ЗначениеЗаполнено(СостояниеДоЗаказа)
		 ИЛИ СостояниеДоЗаказа = Перечисления.b2b_СтатусыДоЗаказов.ТребуетПодтверждения) 
		 И СостояниеЗаявки = Перечисления.b2b_СтатусыЗаказов.ЖдетПодтвержденияДистрибьютором; 
		 
	Если ДоступностьРедактированияДоЗаказа Тогда 
		 
		 Элементы.ФормаСоздатьДозаказ.Заголовок  = "Изменить дозаказ";
		 Элементы.ПовторитьСозданиеДозаказаНаПортал.Доступность = Не ИзмененияПоДозаказу;
	 КонецЕсли;
	 
	 Если ЗначениеЗаполнено(Дозаказ) 
		 И СостояниеДоЗаказа = Перечисления.b2b_СтатусыДоЗаказов.ТребуетПодтверждения  
	     И СостояниеЗаявки = Перечисления.b2b_СтатусыЗаказов.ЖдетПодтвержденияДистрибьютором Тогда
		 
		 //Элементы.ОтправитьНаСогласованиеДозаказ.Видимость = Истина;
		 Элементы.ОтправитьНаСогласованиеДозаказ.Доступность = НЕ ИзмененияПоДозаказу;
	 КонецЕсли; 
	 
	Если ЗначениеЗаполнено(Дозаказ) 
		 И СостояниеЗаявки = Перечисления.b2b_СтатусыЗаказов.Согласована 
		 И СостояниеДоЗаказа = Перечисления.b2b_СтатусыДоЗаказов.ПредварительноПодтвержден Тогда  
		 //Элементы.ПодтвердитьДозаказ.Видимость = Истина;
		 Элементы.ПодтвердитьДозаказ.Доступность = Истина; 
	 КонецЕсли;  
	 
	 
	 Элементы.ДанныеДозаказаГруппаКоличествоДозаказ.ТолькоПросмотр = НЕ ДоступностьРедактированияДоЗаказа; 
	 
	 Элементы.ДанныеДозаказаЗаполнитьПоОстаткамДозаказ.Доступность =  ДоступностьРедактированияДоЗаказа;
	 
	 Элементы.ИзменитьМетодДоставки.Доступность =  СостояниеСогласования = Перечисления.СостоянияСогласования.Согласован;
	 
	 Элементы.МетодДоставки.Доступность =  СостояниеСогласования = Перечисления.СостоянияСогласования.Согласован;
	 
	 //Элементы.ОтменитьОтгрузкуДозаказа.Видимость = ЗначениеЗаполнено(Дозаказ);
	 Элементы.ОтменитьОтгрузкуДозаказа.Доступность = ЗначениеЗаполнено(Дозаказ);
	 
	 Элементы.ОтменитьОтгрузкуДозаказа.Доступность = Ложь; 
	 
	 Если ЗначениеЗаполнено(РасходнаяНакладная2)
		 И РасходнаяНакладная2.СостояниеНакладной <> Перечисления.СостоянияНакладной.Отгружена Тогда
		 
		 Элементы.ОтменитьОтгрузкуДозаказа.Доступность =  МетодДоставки = "P" ИЛИ НЕ ЗначениеЗаполнено(МетодДоставки); 	
		 
	 КонецЕсли;
	 
	 Элементы.ОтменитьОтгрузкуСоСклада.Доступность = Ложь;
	 
	 Если ЗначениеЗаполнено(РасходнаяНакладная1)
		 И РасходнаяНакладная1.СостояниеНакладной <> Перечисления.СостоянияНакладной.Отгружена Тогда
		 
		 Элементы.ОтменитьОтгрузкуСоСклада.Доступность = МетодДоставки = "P" ИЛИ НЕ ЗначениеЗаполнено(Дозаказ); 	
		 
	 КонецЕсли;
	 
	 Элементы.ОтменитьЕдинуюОтгрузку.Доступность = Ложь;
	 
	 ЕстьДозаказ = ЗначениеЗаполнено(Дозаказ) И СостояниеДоЗаказа <> Перечисления.b2b_СтатусыДоЗаказов.Отменен;  
	 
	 //И (СостояниеДоЗаказа = Перечисления.b2b_СтатусыДоЗаказов.Оформлен
	 //ИЛИ СостояниеДоЗаказа = Перечисления.b2b_СтатусыДоЗаказов.Выполнен ИЛИ СостояниеДоЗаказа = Перечисления.b2b_СтатусыДоЗаказов.ЧастичноВыполнен); 
	 УсловиеДозаказ = ЕстьДозаказ И ЗначениеЗаполнено(РасходнаяНакладная2)
	 И РасходнаяНакладная2.СостояниеНакладной <> Перечисления.СостоянияНакладной.Отгружена; 
	 
	 УсловиеЗаказ =  ЗначениеЗаполнено(РасходнаяНакладная1)
	 И РасходнаяНакладная1.СостояниеНакладной <> Перечисления.СостоянияНакладной.Отгружена; 
	 
	// Элементы.ИзменитьМетодДоставки.Доступность = Ложь;
	 
	 Если  УсловиеЗаказ И УсловиеДозаказ тогда // ИЛИ Не ЕстьДозаказ) Тогда 
		 
		 Элементы.ОтменитьЕдинуюОтгрузку.Доступность = МетодДоставки = "F";	
		// Элементы.ИзменитьМетодДоставки.Доступность = истина; 
	 КонецЕсли;
	 
	 Элементы.ОтработатьОтгрузку.Доступность = Ложь; 
	 
	 ЕстьДозаказ = ЗначениеЗаполнено(Дозаказ) И СостояниеДоЗаказа <> Перечисления.b2b_СтатусыДоЗаказов.Отменен;  //И (СостояниеДоЗаказа = Перечисления.b2b_СтатусыДоЗаказов.Оформлен
	// ИЛИ СостояниеДоЗаказа = Перечисления.b2b_СтатусыДоЗаказов.Выполнен ИЛИ СостояниеДоЗаказа = Перечисления.b2b_СтатусыДоЗаказов.ЧастичноВыполнен); 
	 
	 УсловиеДозаказ = ЕстьДозаказ И ЗначениеЗаполнено(РасходнаяНакладная2)
	 И РасходнаяНакладная2.СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена; 
	 
	 УсловиеЗаказ =  ЗначениеЗаполнено(РасходнаяНакладная1)
	 И РасходнаяНакладная1.СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена;
	 
	 УсловиеЗаказНеУчитывается = СостояниеЗаказа = Перечисления.СостоянияЗаказаКонтрагента.Отменен;
	 
	 НеРедактируется = СостояниеЗаявки = Перечисления.b2b_СтатусыЗаказов.Выполнена ИЛИ СостояниеЗаявки = Перечисления.b2b_СтатусыЗаказов.Отменена; 
	 
	 Если  (УсловиеЗаказ ИЛИ УсловиеЗаказНеУчитывается) И (УсловиеДозаказ ИЛИ Не ЕстьДозаказ) 
		 И НЕ НеРедактируется Тогда 
		 
		 Элементы.ОтработатьОтгрузку.Доступность = истина;  
		 
	 КонецЕсли;
	 
	 Если МетодДоставки = "P" Тогда
	 
	 	 Элементы.ОтработатьОтгрузку.Доступность = УсловиеЗаказ ИЛИ УсловиеДозаказ;
	 
	 КонецЕсли;
	// Если МетодДоставки = "F" 
	//	 И НЕ Элементы.ОтработатьОтгрузку.Доступность Тогда
	// 
	// 	Элементы.ДекорацияПодсказкаРНК.Заголовок = "Для отработки отгрузки измените метод доставки ""Заказ и дозаказ отдельно"""; 	
	//Иначе 
	//	Элементы.ДекорацияПодсказкаРНК.Заголовок = ""; 
	// КонецЕсли;
	 
	 Элементы.ПричинаОтменыЗаявки.Видимость = ЗначениеЗаполнено(ПричинаОтменыЗаявки);
	 Элементы.ПричинаОтменыОтгрузки1.Видимость = ЗначениеЗаполнено(ПричинаОтменыОтгрузки1);
	 Элементы.ПричинаОтменыОтгрузки2.Видимость = ЗначениеЗаполнено(ПричинаОтменыОтгрузки2);
	 Элементы.ПричинаОтменыЗаявкиКлиентом.Видимость = ЗначениеЗаполнено(ПричинаОтменыЗаявкиКлиентом);
	 
	 Элементы.ГруппаПричиныОтмены.Видимость =  Элементы.ПричинаОтменыЗаявки.Видимость
	 ИЛИ Элементы.ПричинаОтменыОтгрузки1.Видимость
	 ИЛИ  Элементы.ПричинаОтменыОтгрузки2.Видимость
	 ИЛИ  Элементы.ПричинаОтменыЗаявкиКлиентом.Видимость;
	 
	 Элементы.ГруппаИнформация.Видимость = ЗначениеЗаполнено(ТекстОшибкиПоследний); 
	 
	 Элементы.ФормаОтменитьЗаказ.Доступность = НЕ ТолькоПросмотр;
	 
	 СостояниеЗаказаДБ = ПредопределенноеЗначение("Перечисление.СостоянияЗаказаКонтрагента.ВРаботе"); 
	 СостояниеСогласованияДБ = ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Согласован"); 
	 
	 РезультатПроверкиСостояния1 = b2b_ОбменЗаявками.ПроверитьСостояниеЗаказа(Заказ, СостояниеЗаказаДБ,СостояниеСогласованияДБ);
	 
	 СостояниеЗаказаДБ = ПредопределенноеЗначение("Перечисление.СостоянияЗаказаКонтрагента.ВыполненЧастично"); 
	 СостояниеСогласованияДБ = ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Согласован"); 
	 
	 РезультатПроверкиСостояния2 = b2b_ОбменЗаявками.ПроверитьСостояниеЗаказа(Заказ, СостояниеЗаказаДБ,СостояниеСогласованияДБ);
	 
	 Элементы.ДанныеСоздатьРНК.Доступность = РезультатПроверкиСостояния1 ИЛИ РезультатПроверкиСостояния2;
	 
	 РезультатПроверкиСостоянияДозаказа1 = b2b_ОбменЗаявками.ПроверитьСостояниеЗаказа(Дозаказ, СостояниеЗаказаДБ,СостояниеСогласованияДБ);
	 
	 СостояниеЗаказаДБ = ПредопределенноеЗначение("Перечисление.СостоянияЗаказаКонтрагента.ВРаботе"); 
	 СостояниеСогласованияДБ = ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Согласован"); 
	 
	 РезультатПроверкиСостоянияДозаказа2 = b2b_ОбменЗаявками.ПроверитьСостояниеЗаказа(Дозаказ, СостояниеЗаказаДБ,СостояниеСогласованияДБ);
	 
	 ПодтвержденОкончально = СостояниеДоЗаказа = ПредопределенноеЗначение("Перечисление.b2b_СтатусыДоЗаказов.Оформлен")
	 ИЛИ СостояниеДоЗаказа =ПредопределенноеЗначение("Перечисление.b2b_СтатусыДоЗаказов.Выполнен")
	 ИЛИ СостояниеДоЗаказа =ПредопределенноеЗначение("Перечисление.b2b_СтатусыДоЗаказов.ЧастичноВыполнен");
	 
	 РезультатПроверкиСостоянияДозаказа = (РезультатПроверкиСостоянияДозаказа1 ИЛИ РезультатПроверкиСостоянияДозаказа2) И ПодтвержденОкончально; 
	 
	 Элементы.ДанныеДозаказаСоздатьРНКПоДозаказу.Доступность = РезультатПроверкиСостоянияДозаказа;
	 
	 Элементы.СоздатьРНКОбщий.Доступность = (РезультатПроверкиСостояния1 ИЛИ РезультатПроверкиСостояния2) И (Не ЗначениеЗаполнено(Дозаказ) ИЛИ РезультатПроверкиСостоянияДозаказа); 
	 
	 Элементы.ДанныеСоздатьРНК.Доступность = Элементы.ДанныеСоздатьРНК.Доступность И (НЕ ЕстьДоЗаказ ИЛИ ПодтвержденОкончально); 
	  
	 Элементы.ДанныеДозаказаПометитьНаУдалениеДозаказ.Доступность = ЗначениеЗаполнено(Дозаказ) и Не ЗначениеЗаполнено(СостояниеДоЗаказа); 
	 
	 РедактированиеДозаказаПоУмолчанию = (СостояниеДоЗаказа = ПредопределенноеЗначение("Перечисление.b2b_СтатусыДоЗаказов.ТребуетПодтверждения")) 
	 И СостояниеЗаявки = ПредопределенноеЗначение("Перечисление.b2b_СтатусыЗаказов.ЖдетПодтвержденияДистрибьютором");
	 
	 Элементы.ЖелаемаяДатаОтгрузки.Доступность = ЗначениеЗаполнено(Дозаказ) И (Не ЗначениеЗаполнено(СостояниеДоЗаказа)
	 ИЛИ РедактированиеДозаказаПоУмолчанию) ;
	 
	 Элементы.ПунктДоставки.Доступность = ЗначениеЗаполнено(Дозаказ) И (Не ЗначениеЗаполнено(СостояниеДоЗаказа)
	 ИЛИ РедактированиеДозаказаПоУмолчанию) ;
	 
	 Элементы.КомментарийКДозаказу.Доступность = ЗначениеЗаполнено(Дозаказ) И (Не ЗначениеЗаполнено(СостояниеДоЗаказа)
	 ИЛИ РедактированиеДозаказаПоУмолчанию) ;
	 
	 Элементы.УдалитьРНК.Доступность = ЗначениеЗаполнено(РасходнаяНакладная1) ИЛИ  ЗначениеЗаполнено(РасходнаяНакладная2) И НЕ НеРедактируется;
	 //по просьбе пользователей
	 Элементы.УдалитьРНК.Видимость = Ложь; 
	 
	 МассивЭлементов = Новый Массив; 
	 МассивЭлементов.Добавить("ФормаОбновитьЗаказ");
	 МассивЭлементов.Добавить("ФормаОтменитьЗаказ");
	 МассивЭлементов.Добавить("ОтправитьНаСогласованиеВналичии");
	 МассивЭлементов.Добавить("ОтправитьНаСогласованиеДозаказ");
	 МассивЭлементов.Добавить("ФормаОтправитьНаСогласованиеКлиенту");
	 МассивЭлементов.Добавить("ПодтвердитьДозаказ");
	 МассивЭлементов.Добавить("ПовторитьСозданиеДозаказаНаПортал");
	 
	 МассивЭлементов.Добавить("ОтменитьОтгрузкуСоСклада");
	 МассивЭлементов.Добавить("ОтменитьОтгрузкуДозаказа");
	 МассивЭлементов.Добавить("ОтменитьЕдинуюОтгрузку");
	 
	 МассивЭлементов.Добавить("ИзменитьМетодДоставки");
	 МассивЭлементов.Добавить("ОтработатьОтгрузку");
	 МассивЭлементов.Добавить("УдалитьРНК");
	 
	 МассивЭлементов.Добавить("СоздатьРНКОбщий");
	 МассивЭлементов.Добавить("ВернутьВИсходноеСостояние");
	 
	 
	 Элементы.ВернутьВИсходноеСостояние.Доступность = Не ЗначениеЗаполнено(СостояниеДоЗаказа)
	 И СостояниеЗаявки = ПредопределенноеЗначение("Перечисление.b2b_СтатусыЗаказов.ЖдетПодтвержденияДистрибьютором");
	 
	 
	 Для каждого ЭлементМассива Из МассивЭлементов Цикл
	 
	 	Если Элементы[ЭлементМассива].Доступность Тогда
		
			Элементы[ЭлементМассива].Шрифт = Новый Шрифт(Элементы[ЭлементМассива].Шрифт,,10,Истина); 
		Иначе
			Элементы[ЭлементМассива].Шрифт = Новый Шрифт(Элементы[ЭлементМассива].Шрифт,,8,Ложь);
		КонецЕсли;
	 
	КонецЦикла;
	
	//Если  РасходнаяНакладная1  = РасходнаяНакладная2 Тогда
	
	Элементы.ГруппаРНК2.Видимость = РасходнаяНакладная1 <> РасходнаяНакладная2; 	
	
		
	НадписьНеСоответствиеПодтвержденнаяЗаявкаКоличество(); 	 
	 
КонецФункции // ДоступностьРедактированияЗаказа()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ДоступностьЭлементовПриРедактированииНаКлиенте()
	
	ДозаказПодтвержденКонтрагентом = Не ЗначениеЗаполнено(Дозаказ) ИЛИ (СостояниеДоЗаказа = ПредопределенноеЗначение("Перечисление.b2b_СтатусыДоЗаказов.ТребуетПодтверждения")
	ИЛИ СостояниеДоЗаказа = ПредопределенноеЗначение("Перечисление.b2b_СтатусыДоЗаказов.Оформлен")
	ИЛИ СостояниеДоЗаказа = ПредопределенноеЗначение("Перечисление.b2b_СтатусыДоЗаказов.Отменен"));

	ПустойЗаказОсновной = Заказ.Товары.Количество() = 0; 
	Элементы.ОтправитьНаСогласованиеВналичии.Доступность =  СостояниеЗаявки = ПредопределенноеЗначение("Перечисление.b2b_СтатусыЗаказов.ЖдетПодтвержденияДистрибьютором")  
	И ДозаказПодтвержденКонтрагентом
	И НЕ ПустойЗаказОсновной
	И НЕ ИзмененияПоЗаказу; 
	
	Элементы.ФормаОтправитьНаСогласованиеКлиенту.Доступность = СостояниеЗаявки = ПредопределенноеЗначение("Перечисление.b2b_СтатусыЗаказов.ЖдетПодтвержденияДистрибьютором")  
	И ДозаказПодтвержденКонтрагентом 
	И НЕ ПустойЗаказОсновной
	И НЕ ИзмененияПоДозаказу
	И НЕ ИзмененияПоЗаказу;


	ДоступностьРедактированияДоЗаказа = ЗначениеЗаполнено(Дозаказ)
	И (НЕ ЗначениеЗаполнено(СостояниеДоЗаказа)
	ИЛИ СостояниеДоЗаказа = ПредопределенноеЗначение("Перечисление.b2b_СтатусыДоЗаказов.ТребуетПодтверждения")) 
	И СостояниеЗаявки = ПредопределенноеЗначение("Перечисление.b2b_СтатусыЗаказов.ЖдетПодтвержденияДистрибьютором"); 
	
	Если ДоступностьРедактированияДоЗаказа Тогда 
		Элементы.ПовторитьСозданиеДозаказаНаПортал.Доступность = Не ИзмененияПоДозаказу;
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(Дозаказ) 
		И СостояниеДоЗаказа = ПредопределенноеЗначение("Перечисление.b2b_СтатусыДоЗаказов.ТребуетПодтверждения")   
		И СостояниеЗаявки = ПредопределенноеЗначение("Перечисление.b2b_СтатусыЗаказов.ЖдетПодтвержденияДистрибьютором") Тогда
		
		Элементы.ОтправитьНаСогласованиеДозаказ.Доступность = НЕ ИзмененияПоДозаказу;
	КонецЕсли;
	
КонецПроцедуры // ДоступностьЭлементовПриРедактировании()


// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервере
Функция ВывестиПодсказкиПредупреждения()

	ТипыЗапросовВналичии.ЗагрузитьЗначения(b2b_ОбменЗаявками.НеотработанныеЗапросыНаСайт(Заказ));
	ТипыЗапросовДозаказ.ЗагрузитьЗначения(b2b_ОбменЗаявками.НеотработанныеЗапросыНаСайт(Дозаказ));

КонецФункции // ВывестиПодсказкиПредупреждения()

&НаСервере
Процедура ОтправитьНаСогласованиеВналичииНаСервере()
	ОтправитьНаСогласованиеТолькоЗаказ();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаСогласованиеВналичии(Команда)
	
	МассивОшибок.Очистить();
	
	Если НЕ Заказ.Проведен Тогда
		
		ОповещениеВопрос = Новый ОписаниеОповещения("ВопросПровестиДокументОтправкаВНаличии",ЭтаФорма,Заказ); 
		ПоказатьВопрос(ОповещениеВопрос,"Документ не проведен, провести документ?",РежимДиалогаВопрос.ДаНет); 
		
		
	Иначе 
		ОтправитьНаСогласованиеВналичииНаСервере();
		
		
		ОбновитьЗаказНаСервере();
		ДоступностьРедактированияЗаказа(); 	
		ВывестиПодсказкиПредупреждения();
		ВывестиТекстОшибок();
	КонецЕсли;

	
	
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ВопросПровестиДокументОтправкаВНаличии(ОтветНаВопрос,ДополнительныеПараметры) Экспорт 
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		
		ТекстСообщения = ""; 
		РезультатПроведения = Ложь; 
		
		ПровестиДокументЗаказаНаСервере(ДополнительныеПараметры,РезультатПроведения,ТекстСообщения); 
		МассивОшибок.Добавить(ТекстСообщения);
		
		Если  РезультатПроведения Тогда
			
			ОтправитьНаСогласованиеВналичииНаСервере();		
			
			ОбновитьЗаказНаСервере();
			ДоступностьРедактированияЗаказа(); 	
			ВывестиПодсказкиПредупреждения();			
			
		КонецЕсли;
		
		ВывестиТекстОшибок();
		
		
		
	Иначе 
		ПоказатьПредупреждение(,"Операция отменена, нельзя отпправить на согласование непроведенные документы"); 
	КонецЕсли; 	

КонецПроцедуры // ()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервереБезКонтекста
Процедура ПровестиДокументЗаказаНаСервере(Знач ДокЗаказа, РезультатПроведения, ТекстСообщения)

	ДокЗаказаОбъект = ДокЗаказа.ПолучитьОбъект();
	Попытка
		
		ДокЗаказаОбъект.Записать(РежимЗаписиДокумента.Проведение); 
		ТекстСообщения = "Документ успешно проведен"; 
		
		РезультатПроведения = Истина; 
	Исключение
		
		ТекстСообщения = "Не удалось провести документ" + Символы.ПС + ОписаниеОшибки(); 
		
	КонецПопытки;

КонецПроцедуры // ПровестиДокументЗаказаНаСервере()



&НаКлиенте
Процедура ОткрытьДозаказ(Команда)
	РазблокироватьДокументыЗаказовДляРедактирования(,Истина);
	//ДанныеЗакрытия = ОткрытьФормуМодально("Документ.Заказ.Форма.ФормаДокумента",Новый Структура("Ключ",Дозаказ),ЭтаФорма);
	
	ФормаЗаказа = ПолучитьФорму("Документ.Заказ.Форма.ФормаДокумента",Новый Структура("Ключ",Дозаказ),ЭтаФорма); 
	ФормаЗаказа.ИзАРМb2b = истина; 
	ФормаЗаказа.КлючУникальности = Строка(Новый УникальныйИдентификатор); 
	
	ФормаЗаказа.ОткрытьМодально(); 
	
	ОбновитьИзЗаказа("");
	Если НЕ ЗначениеЗаполнено(СостояниеДоЗаказа) Тогда
		
		//ЗаполнитьТаблицуТоваровПоЗаказу(); 
		//СохранитьЗаказНаСервере(Истина); 	
		
		СохранитьЗаказНаСервере(Истина);
		
	КонецЕсли;
	ЗаблокироватьДокументыЗаказовДляРедактирования(,Истина); 
	 
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеВФормеДоЗаказаЗакрытие(ПараметрЗакрытия,ДополнительныеПараметры) Экспорт

	
КонецПроцедуры

&НаКлиенте
Процедура ПовторитьСозданиеДозаказаНаПортал(Команда)	
	
	Если Не ЗначениеЗаполнено(ПунктДоставки) Тогда
		
		ПоказатьПредупреждение(,"Не заполнен адрес доставки"); 
		Возврат; 	
		
	КонецЕсли;
	МассивОшибок.Очистить();
	
	МассивСообщений = Новый Массив; 
	
	b2b_ОбменЗаявками.ЗаписатьВОчередьНаОтправку(Дозаказ.ссылка,"СоздатьДозаказ",Новый Структура,МассивСообщений);
	
	Сообщить("Отправлен запрос на дозаказ");
	МассивОшибок.Добавить("Отправлен запрос на дозаказ"); 
	
	Для каждого ЭлементМассива Из МассивСообщений Цикл
	
		МассивОшибок.Добавить(ЭлементМассива); 	
	
	КонецЦикла;
	
	ОбновитьЗаказНаСервере();
	ДоступностьРедактированияЗаказа(); 	
	ВывестиПодсказкиПредупреждения();
	ВывестиТекстОшибок(); 

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИзЗаказа(Команда)
	Если Команда <> ""  Тогда
	
		МассивОшибок.Очистить();	
	
	КонецЕсли;
	
	ЗаполнитьТаблицуТоваровПоЗаказу(); 
	
	СостояниеЗаказа = Заказ.СостояниеНакладной;
	СостояниеСогласования = Заказ.СостояниеСогласования; 
	
	РНКСуществующее = неопределено; 
	
	РезультатПроверкиСвязи =  b2b_ОбменЗаявками.ПроверитьСвязьСРНК(Заказ.ссылка,РНКСуществующее);
	Если ЗначениеЗаполнено(РНКСуществующее) Тогда
		
		РасходнаяНакладная1 = РНКСуществующее.ссылка;	
	Иначе
		РасходнаяНакладная1 = ПредопределенноеЗначение("Документ.РасходнаяНакладная.ПустаяСсылка"); 
	КонецЕсли;
	
	РНКСуществующее = неопределено; 
	
	РезультатПроверкиСвязи =  b2b_ОбменЗаявками.ПроверитьСвязьСРНК(Дозаказ.ссылка,РНКСуществующее);
	Если ЗначениеЗаполнено(РНКСуществующее) Тогда
		
		РасходнаяНакладная2 = РНКСуществующее.ссылка;	
	Иначе 
		РасходнаяНакладная2 = ПредопределенноеЗначение("Документ.РасходнаяНакладная.ПустаяСсылка");
	КонецЕсли;
	
	ДоступностьРедактированияЗаказа();
	
	ВывестиПодсказкиПредупреждения();
	ВывестиТекстОшибок();

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаСогласованиеДозаказ(Команда)
	
	МассивОшибок.Очистить();
	
	Если Не Дозаказ.Проведен Тогда
		
		ОповещениеВопрос = Новый ОписаниеОповещения("ВопросПровестиДокументОтправкаДозаказ",ЭтаФорма,Дозаказ); 
		ПоказатьВопрос(ОповещениеВопрос,"Документ не проведен, провести документ?",РежимДиалогаВопрос.ДаНет);  	
		
	ИначеЕсли ПроверкаСостоянияДозаказа() Тогда  		
		
		ОтправитьНаСогласованиеТолькоДоЗаказ();
		
		ОбновитьЗаказНаСервере();
		ДоступностьРедактированияЗаказа(); 	
		ВывестиПодсказкиПредупреждения();
		ВывестиТекстОшибок();
		
	КонецЕсли;
 
КонецПроцедуры

&НаКлиенте
Процедура ВопросПровестиДокументОтправкаДозаказ(ОтветНаВопрос,ДополнительныеПараметры) Экспорт 
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		
		ТекстСообщения = ""; 
		РезультатПроведения = Ложь; 
		
		ПровестиДокументЗаказаНаСервере(ДополнительныеПараметры,РезультатПроведения,ТекстСообщения); 
		МассивОшибок.Добавить(ТекстСообщения);
		
		Если  РезультатПроведения Тогда
			
			ОтправитьНаСогласованиеТолькоДоЗаказ();		
			
			ОбновитьЗаказНаСервере();
			ДоступностьРедактированияЗаказа(); 	
			ВывестиПодсказкиПредупреждения();			
			
		КонецЕсли;
		
		ВывестиТекстОшибок();
		
		
		
	Иначе 
		ПоказатьПредупреждение(,"Операция отменена, нельзя отпправить на согласование непроведенные документы"); 
	КонецЕсли; 	

КонецПроцедуры // ()


&НаКлиенте
Процедура ДанныеДозаказаЖелаемаяДатаОтгрузкиПриИзменении(Элемент)
	Модифицированность = истина; 
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДозаказаКомментарийПриИзменении(Элемент)
	Модифицированность = Истина; 
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзмененияДозаказ(Команда)
	МассивОшибок.Очистить();
	СохранитьИзмененияВДозаказе();
	НадписьИзменений();
	ВывестиТекстОшибок();
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура СохранитьИзмененияВДозаказе()	
	
	ИзменитьЗаказ  = Истина; 
	
	ОбъектЗаказ  = Дозаказ.ПолучитьОбъект();
	
	Если ЗначениеЗаполнено(ПлановаяДатаОтгрузкиДозаказа) Тогда
		
		ОбъектЗаказ.ДатаОтгрузки = ПлановаяДатаОтгрузкиДозаказа;	
		
	КонецЕсли;
	
	ОбъектЗаказ.Комментарий = КомментарийКДозаказу; 
	
	Для каждого СтрокаДозаказа Из ДанныеДозаказа Цикл
	
		Если НЕ СтрокаДозаказа.ИзмененаСтрока Тогда
		
			Продолжить; 
		
		КонецЕсли;
		
		Отбор = Новый Структура("Номенклатура",СтрокаДозаказа.Номенклатура); 
		СтрокиЗаказа = ОбъектЗаказ.Товары.НайтиСтроки(Отбор);
		
		Если СтрокаДозаказа.КоличествоРезерв > 0 Тогда
			
			ИзменитьЗаказ = истина; 	
		 
		КонецЕсли;
		Если СтрокиЗаказа.Количество() > 0  Тогда  
			
			
			Если СтрокаДозаказа.КоличествоДозаказ = 0 Тогда
				
				ОбъектЗаказ.Товары.Удалить(СтрокиЗаказа[0]); 
			Иначе 
				
				СтрокиЗаказа[0].Количество = СтрокаДозаказа.КоличествоДозаказ; //СтрокаТовара.Количество;
				Если Не ЗначениеЗаполнено(СостояниеДоЗаказа) Тогда
				
					СтрокиЗаказа[0].Заявка = СтрокиЗаказа[0].Количество;	
				
				КонецЕсли;
				// 
				СтрокиЗаказа[0].Цена = СтрокаДозаказа.Цена; 
				СтрокиЗаказа[0].ЦенаБезСкидки = СтрокаДозаказа.ЦенаБезСкидки;//	
				СтрокиЗаказа[0].Скидка = СтрокаДозаказа.Скидка;
				//СтрокиЗаказа[0].Сумма = СтрокиЗаказа[0].Цена * СтрокиЗаказа[0].Количество; 
				//СтрокиЗаказа[0].Всего = СтрокиЗаказа[0].Сумма;
				//СтрокиЗаказа[0].ВсегоБезСкидки = СтрокиЗаказа[0].ЦенаБезСкидки * СтрокиЗаказа[0].Количество;
				
				b2b_ОбменЗаявками.РассчитатьСуммуТабЧасти_(СтрокиЗаказа[0],ОбъектЗаказ); 
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла;
	
	Попытка
		Попытка
		
			ОбъектЗаказ.Записать(РежимЗаписиДокумента.Проведение);
		
		Исключение
		    ОбъектЗаказ.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
			
		Модифицированность = Ложь; 
		ИзмененияПоДозаказу = ЛОЖЬ;
		
		
		ПараметрыЗаписиВРегистр = Новый Структура; 
		ПараметрыЗаписиВРегистр.Вставить("Комментарий",КомментарийКДозаказу);
		ПараметрыЗаписиВРегистр.Вставить("ЖелаемаяДатаОтгрузки",ЖелаемаяДатаОтгрузки);
		ПараметрыЗаписиВРегистр.Вставить("ПунктДоставки",ПунктДоставки);
		ПараметрыЗаписиВРегистр.Вставить("Контрагент",ЮрЛицоДозаказа);
		b2b_ОбменЗаявками.ЗаписатьДополнительныеДанныеВРегистрДоЗаказов(Дозаказ.Ссылка,ПараметрыЗаписиВРегистр,ложь);
	
		Если ИзменитьЗаказ Тогда
		
			
		     ОбъектОсновнойЗаказ  = Заказ.ПолучитьОбъект();
			 
			 Для каждого  СтрокаДозаказа Из ДанныеДозаказа  Цикл
				 
				 Если НЕ СтрокаДозаказа.ИзмененаСтрока Тогда
					 
					 Продолжить; 
					 
				 КонецЕсли;
				 
				 Отбор = Новый Структура("Номенклатура",СтрокаДозаказа.Номенклатура); 
				 СтрокиЗаказа = ОбъектОсновнойЗаказ.Товары.НайтиСтроки(Отбор);
				 
				 Если СтрокиЗаказа.Количество() = 0 
					 И СтрокаДозаказа.КоличествоРезерв > 0 Тогда
					 
					 ТоварВЗаказе = ОбъектОсновнойЗаказ.Товары.Добавить(); 
					 ЗаполнитьЗначенияСвойств(ТоварВЗаказе,СтрокаДозаказа); 
					 //ТоварВЗаказе.ПодтвержденнаяЗаявка = ТоварВЗаказе.Заявка; 
					 ТоварВЗаказе.Количество = СтрокаДозаказа.КоличествоРезерв;
					 ТоварВЗаказе.ПодтвержденнаяЗаявка = ТоварВЗаказе.Количество;
					 
				 ИначеЕсли СтрокаДозаказа.КоличествоРезерв > 0 Тогда  
					 ТоварВЗаказе = СтрокиЗаказа[0];
					 ТоварВЗаказе.Количество = ТоварВЗаказе.Количество + СтрокаДозаказа.КоличествоРезерв;
				 Иначе 
					 Продолжить; 
				 КонецЕсли;
				 
				 //ТоварВЗаказе.Сумма = ТоварВЗаказе.Цена * ТоварВЗаказе.Количество; 
				 //ТоварВЗаказе.Всего = ТоварВЗаказе.Сумма;
				 //ТоварВЗаказе.ВсегоБезСкидки = ТоварВЗаказе.ЦенаБезСкидки * ТоварВЗаказе.Количество;
				  b2b_ОбменЗаявками.РассчитатьСуммуТабЧасти_(ТоварВЗаказе,ОбъектОсновнойЗаказ);
			 КонецЦикла;
			 
			 Попытка 		 
				 
				 ОбъектОсновнойЗаказ.Записать(РежимЗаписиДокумента.Проведение);
			 Исключение
				 Если ОбъектОсновнойЗаказ.Проведен Тогда
					 ОбъектОсновнойЗаказ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				 Иначе 
					 ОбъектОсновнойЗаказ.Записать(РежимЗаписиДокумента.Запись);
				 КонецЕсли;
				 
			 КонецПопытки;
			  
			 
			 
			 ПараметрыЗаписиВРегистр = Новый Структура; 
			 
			 ПараметрыЗаписиВРегистр.Вставить("ПлановаяДатаОтгрузки",ПлановаяДатаОтгрузки);
			 b2b_ОбменЗаявками.ЗаписатьДополнительныеДанныеВРегистрЗаказов(Заказ.Ссылка,ПараметрыЗаписиВРегистр);
			 
		 КонецЕсли;
		 
		 СнятьФлагИзмененияСтроки("ДанныеДозаказа"); 
		
	Исключение
		Сообщить(ОписаниеОшибки()); 
		МассивОшибок.Добавить(ОписаниеОшибки()); 
	КонецПопытки; 

КонецПроцедуры // СохоанитьИзмененияВДозаказе()

&НаКлиенте
Процедура КомментарийКДозаказуПриИзменении(Элемент)
	Модифицированность = истина;
	ИзмененияПоДозаказу = Истина;
	НадписьИзменений(); 
КонецПроцедуры

&НаКлиенте
Процедура ЖелаемаяДатаОтгрузкиПриИзменении(Элемент)
	Модифицированность = истина;
	ИзмененияПоДозаказу = Истина;
	НадписьИзменений(); 
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура НадписьИзменений()
	Если ИзмененияПоДозаказу Тогда
	
		Элементы.ДекорацияИзмененияДозаказа.Заголовок = "Есть изменения по дозаказу на форме, сохраните дозаказ"; 	
	Иначе 
		Элементы.ДекорацияИзмененияДозаказа.Заголовок = ""; 
	КонецЕсли;
	
	Если ИзмененияПоЗаказу Тогда
	
		Элементы.ДекорацияИзмененияЗаказа.Заголовок = "Есть изменения по заказу на форме, сохраните заказ"; 	
	Иначе 
		Элементы.ДекорацияИзмененияЗаказа.Заголовок = "";
	КонецЕсли;
	
	Если ИзмененияПоДозаказу 
		ИЛИ  ИзмененияПоЗаказу Тогда
		
		Элементы.ФормаСохранить.ЦветТекста = WebЦвета.Красный;
		
	Иначе 
		Элементы.ФормаСохранить.ЦветТекста = WebЦвета.Черный;
		Элементы.СохранитьДляДальнейшегоРедактирования.ЦветТекста =  WebЦвета.Черный;
	КонецЕсли;
	
	Если ИзмененияПоЗаказуСтроки Тогда
	
		Элементы.СохранитьДляДальнейшегоРедактирования.ЦветТекста =  WebЦвета.Красный;
	Иначе 
		
	    Элементы.СохранитьДляДальнейшегоРедактирования.ЦветТекста =  WebЦвета.Черный;
		
	КонецЕсли;
	 

КонецПроцедуры // НадписьИзменений()

&НаКлиенте
Процедура ДанныеКоличествоРезервПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Данные.ТекущиеДанные; 
	
	ДоступностьРедактированияДоЗаказа = (НЕ ЗначениеЗаполнено(СостояниеДоЗаказа)
		 ИЛИ СостояниеДоЗаказа = ПредопределенноеЗначение("Перечисление.b2b_СтатусыДоЗаказов.ТребуетПодтверждения")) 
		 И СостояниеЗаявки = ПредопределенноеЗначение("Перечисление.b2b_СтатусыЗаказов.ЖдетПодтвержденияДистрибьютором");
	
	Если ТекущиеДанные <> Неопределено 
		  И Не НеПересчитыватьКоличество 
		  И ДоступностьРедактированияДоЗаказа Тогда
	
		ТекущиеДанные.КоличествоДозаказ = ТекущиеДанные.ПодтвержденнаяЗаявка - ТекущиеДанные.КоличествоРезерв; 	
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеКоличествоДозаказПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Данные.ТекущиеДанные; 
	
	ДоступностьРедактированияДоЗаказа = (НЕ ЗначениеЗаполнено(СостояниеДоЗаказа)
		 ИЛИ СостояниеДоЗаказа = ПредопределенноеЗначение("Перечисление.b2b_СтатусыДоЗаказов.ТребуетПодтверждения")) 
		 И СостояниеЗаявки = ПредопределенноеЗначение("Перечисление.b2b_СтатусыЗаказов.ЖдетПодтвержденияДистрибьютором");

	Если ТекущиеДанные <> Неопределено 
		 И Не НеПересчитыватьКоличество
		 И ДоступностьРедактированияДоЗаказа Тогда
	
		ТекущиеДанные.КоличествоРезерв = ТекущиеДанные.ПодтвержденнаяЗаявка - ТекущиеДанные.КоличествоДозаказ;
		
		//ТекущиеДанные.КоличествоРезерв = ТекущиеДанные.Количество - ТекущиеДанные.КоличествоДозаказ;
	
	КонецЕсли;
КонецПроцедуры


// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ЗаполнитьДанныеПодвала()

	ВсегоКоличествоДозаказ = ДанныеДозаказа.Итог("Количество");
	ВсегоКоличествоЗаказ = Данные.Итог("Количество");
	
	ВсегоСуммаДозаказ= ДанныеДозаказа.Итог("Всего");
	ВсегоСуммаЗаказ = Данные.Итог("Всего");
	
	ВсегоЗаявкаДозаказ = ДанныеДозаказа.Итог("Заявка");
	ВсегоЗаявкаЗаказ = Данные.Итог("Заявка");
	
	Если СостояниеЗаказа = Перечисления.СостоянияЗаказаКонтрагента.Отменен Тогда
		ВсегоКоличествоЗаказ  = 0; 
		ВсегоСуммаЗаказ	= 0; 
		ВсегоЗаявкаЗаказ  = 0; 
	КонецЕсли;
	
	Если СостояниеЗаказаНадозаказ = Перечисления.СостоянияЗаказаКонтрагента.Отменен Тогда
	
		 ВсегоКоличествоДозаказ  = 0; 
	     ВсегоСуммаДозаказ   = 0; 
		 ВсегоЗаявкаДозаказ = 0; 
		 
	КонецЕсли;
	
	ИтогоКоличество = ВсегоКоличествоДозаказ +  ВсегоКоличествоЗаказ; 
	//ИтогоЗаявка =  ВсегоЗаявкаДозаказ +  ВсегоЗаявкаЗаказ; 
	ИтогоСумма = ВсегоСуммаДозаказ +  ВсегоСуммаЗаказ; 


КонецПроцедуры // ЗаполнитьИтоги()

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	РазблокироватьДокументыЗаказовДляРедактирования(); 
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если (ИзмененияПоДозаказу 
		ИЛИ  ИзмененияПоЗаказу) 
		И НЕ ВопросЗакрытьЗадан Тогда
		
		Отказ = Истина; 
		
		ОповещениеВопрос = Новый ОписаниеОповещения("ПередЗакрытиемВопрос",ЭтаФорма); 
		ПоказатьВопрос(ОповещениеВопрос,"Есть несохраненные изменения, продолжить?",РежимДиалогаВопрос.ДаНет); 
	
	КонецЕсли;
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ПередЗакрытиемВопрос(ОтветНаВопрос,ДополнительныПараметры) Экспорт 
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Да  Тогда
	
		 ВопросЗакрытьЗадан  = истина; 
		 Закрыть(); 
	
	КонецЕсли;

	

КонецПроцедуры // ПередЗакрытиемВопрос()

&НаКлиенте
Процедура ДанныеДозаказаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Модифицированность = истина; 
	ИзмененияПодоЗаказу = Истина;
	
	ТекущиеДанные = Элементы.ДанныеДозаказа.ТекущиеДанные; 
	Если ТекущиеДанные <> Неопределено Тогда
		
		ТекущиеДанные.ИзмененаСтрока = Истина; 	
		
	КонецЕсли;

	
	НадписьИзменений();
	ДоступностьЭлементовПриРедактированииНаКлиенте(); 
	//ДоступностьРедактированияЗаказа();
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДозаказаКоличествоРезервПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДанныеДозаказа.ТекущиеДанные; 
	
	Если ТекущиеДанные <> Неопределено  
		 И НЕ НеПересчитыватьКоличествоДозаказ Тогда
		Если Не ЗначениеЗаполнено(СостояниеДоЗаказа)  Тогда
			
			Количество = ТекущиеДанные.Заявка; 	
		Иначе 
			Количество = ТекущиеДанные.ПодтвержденнаяЗаявка;
		КонецЕсли;
		ТекущиеДанные.КоличествоДозаказ = Количество - ТекущиеДанные.КоличествоРезерв; 	
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДанныеДозаказаКоличествоДозаказПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДанныеДозаказа.ТекущиеДанные; 
	
	Если ТекущиеДанные <> Неопределено
		 И НЕ НеПересчитыватьКоличествоДозаказ Тогда
		
		Если Не ЗначениеЗаполнено(СостояниеДоЗаказа)  Тогда
			
			Количество = ТекущиеДанные.Заявка; 	
		Иначе 
			Количество = ТекущиеДанные.ПодтвержденнаяЗаявка;
		КонецЕсли;
		
		ТекущиеДанные.КоличествоРезерв = Количество - ТекущиеДанные.КоличествоДозаказ; 	
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОстаткам(Команда)
	МассивОшибок.Очистить();
	ЗаполнитьПоОстаткамНаКлиенте();
	НадписьИзменений();
	ВывестиТекстОшибок();
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ЗаполнитьПоОстаткамНаКлиенте(ЗаполнениеПоДозаказу = Ложь)
	
	ТаблицаДанных = ?(ЗаполнениеПоДозаказу,"ДанныеДозаказа","Данные"); 
	
	Для каждого СтрокаДанных Из ЭтаФорма[ТаблицаДанных] Цикл
		
		КоличествоРезервДо = СтрокаДанных.Количестворезерв; 
		КоличествоДозаказДо = СтрокаДанных.КоличествоДозаказ; 
		
		Если ТаблицаДанных = "ДанныеДозаказа"
			И Не ЗначениеЗаполнено(СостояниеДоЗаказа) Тогда
		
			ПодтвержденнаяЗаявка = СтрокаДанных.Заявка; 	
		Иначе 
			ПодтвержденнаяЗаявка = СтрокаДанных.ПодтвержденнаяЗаявка;
		КонецЕсли;
		
		СтрокаДанных.Количестворезерв = Мин(СтрокаДанных.Остаток,ПодтвержденнаяЗаявка); 
		СтрокаДанных.КоличествоДозаказ = ПодтвержденнаяЗаявка - СтрокаДанных.КоличествоРезерв; 
		
		Если КоличествоРезервДо <> СтрокаДанных.Количестворезерв 
			ИЛИ КоличествоДозаказДо <> СтрокаДанных.КоличествоДозаказ Тогда
		
			СтрокаДанных.ИзмененаСтрока = Истина; 
		
		КонецЕсли;
	
	КонецЦикла;
	
	ИзмененияПоДозаказу = ЗаполнениеПоДозаказу; 
	ИзмененияПоЗаказу = Не ЗаполнениеПоДозаказу;
	ИзмененияПоЗаказуСтроки = Не ЗаполнениеПоДозаказу; 

КонецПроцедуры // ЗаполнитьПоОстаткамНаКлиенте()

&НаКлиенте
Процедура ЗаполнитьПоОстаткамДозаказ(Команда)
	ЗаполнитьПоОстаткамНаКлиенте(Истина);
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура СнятьФлагИзмененияСтроки(Таблица)

	  Для каждого СтрокаТаблицы  Из ЭтаФорма[таблица] Цикл
	  
	  	СтрокаТаблицы.ИзмененаСтрока = Ложь; 	
	  
	  КонецЦикла;

КонецПроцедуры // СнятьФлагИзмененияСтроки()

&НаКлиенте
Процедура ОбновитьОстатки(Команда)
	МассивОшибок.Очистить();
	ОбновитьОстаткиНаСервере("Данные");
	ВывестиТекстОшибок();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОстаткиДозаказ(Команда)
	МассивОшибок.Очистить();
	ОбновитьОстаткиНаСервере("ДанныеДозаказа");
	ВывестиТекстОшибок();
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ОбновитьОстаткиНаСервере(ТаблицаДляОбновления)

	МассивТоваров = ЭтаФорма[ТаблицаДляОбновления].Выгрузить().ВыгрузитьКолонку("Номенклатура"); 
	Склад = Заказ.Склад; 
	КэшОстатки = Новый Соответствие; 
	
	b2b_ОбменЗаявками.ПолучитьОстаткиПоЗаявкам(МассивТоваров,Склад,Заказ,КэшОстатки);
	
	Модифицированность = Истина; 
	
	Если ТаблицаДляОбновления = "Данные" Тогда
		
		ИзмененияПоЗаказу = истина;
		ИзмененияПоЗаказуСтроки = Истина; 
		
	КонецЕсли;
	
	Если ТаблицаДляОбновления = "ДанныеДозаказа" Тогда
		
		ИзмененияПоДозаказу = истина; 	
		
	КонецЕсли;
	
	Для каждого СтрокаДанных  Из ЭтаФорма[ТаблицаДляОбновления] Цикл
		
		Если КэшОстатки.Получить(СтрокаДанных.Номенклатура) <> неопределено Тогда
			
			СтрокаДанных.остаток =  КэшОстатки.Получить(СтрокаДанных.Номенклатура).СвободныйОстаток;	
			
		КонецЕсли;	
		
	КонецЦикла;

КонецПроцедуры // ()

&НаКлиенте
Процедура МетодДоставкиПриИзменении(Элемент)
	МассивОшибок.Очистить();
	Если ЗначениеЗаполнено(МетодДоставки)  Тогда  		
			
		ПараметрыЗаписиВРегистр = Новый Структура; 
		ПараметрыЗаписиВРегистр.Вставить("МетодДоставки",МетодДоставки);
		b2b_ОбменЗаявками.ЗаписатьДополнительныеДанныеВРегистрЗаказов(Заказ,ПараметрыЗаписиВРегистр); 		
		
		ПараметрыНаотправку = Новый Структура;
		ПараметрыНаотправку.Вставить("НомерЗаявки",Заказ.НомерЗаказа);
		ПараметрыНаотправку.Вставить("МетодДоставки",МетодДоставки);
		
		МассивСообщений = новый Массив; 
		b2b_ОбменЗаявками.ЗаписатьВОчередьНаОтправку(заказ,"ИзменитьМетодДоставки",ПараметрыНаотправку,МассивСообщений);
		Для каждого ЭлементМассива Из МассивСообщений Цикл
			
			МассивОшибок.Добавить(ЭлементМассива); 	
			
		КонецЦикла;
		
		ВывестиТекстОшибок();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьМетодДоставки(Команда)
	
	МассивОшибок.Очистить();
	ИзменитьМетодДоставкиФрагмент(Элементы.ИзменитьМетодДоставки);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьМетодДоставкиФрагмент(ЭлементФормыОткрыть)
	ИзменитьЗдесь = Ложь; 
	
	Если МетодДоставки = "F" Тогда
		
		МетодДоставки = "P";
		ИзменитьЗдесь = Истина; 
		
	ИначеЕсли МетодДоставки = "P" тогда 
		
		МетодДоставки = "F"; 
		ИзменитьЗдесь = Истина;
	Иначе 
		
		МетодыДоставки = Новый СписокЗначений; 				
		МетодыДоставки.Добавить("F","Заказ и дозаказ вместе"); 
		МетодыДоставки.Добавить("P","Заказ и дозаказ отдельно");  
		
		ОповещениеВыборИзСписка = Новый ОписаниеОповещения("ВыборИзСпискаМетодДоставки",ЭтаФорма,Новый Структура); 
		
		ПоказатьВыборИзСписка(ОповещениеВыборИзСписка,МетодыДоставки,ЭлементФормыОткрыть);
	КонецЕсли;
	
	Если ИзменитьЗдесь Тогда 
		ПараметрыЗаписиВРегистр = Новый Структура; 
		ПараметрыЗаписиВРегистр.Вставить("МетодДоставки",МетодДоставки);
		b2b_ОбменЗаявками.ЗаписатьДополнительныеДанныеВРегистрЗаказов(Заказ,ПараметрыЗаписиВРегистр); 		
		
		ПараметрыНаотправку = Новый Структура;
		ПараметрыНаотправку.Вставить("НомерЗаявки",Заказ.НомерЗаказа);
		ПараметрыНаотправку.Вставить("МетодДоставки",МетодДоставки);
		
		МассивСообщений = Новый Массив; 
		b2b_ОбменЗаявками.ЗаписатьВОчередьНаОтправку(заказ,"ИзменитьМетодДоставки",ПараметрыНаотправку,МассивСообщений);
		Для каждого ЭлементМассива Из МассивСообщений Цикл
			
			МассивОшибок.Добавить(ЭлементМассива); 	
			
		КонецЦикла;
		ВывестиТекстОшибок();
		
		ОбновитьЗаказНаСервере();
		ДоступностьРедактированияЗаказа(); 	
		ВывестиПодсказкиПредупреждения();
		 
	КонецЕсли;

КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ВыборИзСпискаМетодДоставки(ВыбранноеЗначение,ДополнительныеПараметры) Экспорт 
	Если ВыбранноеЗначение = неопределено Тогда
	
		Возврат; 	
	
	КонецЕсли;
	Если ЗначениеЗаполнено(ВыбранноеЗначение.Значение)  Тогда  		
			
		ПараметрыЗаписиВРегистр = Новый Структура; 
		ПараметрыЗаписиВРегистр.Вставить("МетодДоставки",ВыбранноеЗначение.Значение);
		b2b_ОбменЗаявками.ЗаписатьДополнительныеДанныеВРегистрЗаказов(Заказ,ПараметрыЗаписиВРегистр); 		
		
		ПараметрыНаотправку = Новый Структура;
		ПараметрыНаотправку.Вставить("НомерЗаявки",Заказ.НомерЗаказа);
		ПараметрыНаотправку.Вставить("МетодДоставки",ВыбранноеЗначение.Значение);
		
		МассивСообщений = Новый Массив; 
		b2b_ОбменЗаявками.ЗаписатьВОчередьНаОтправку(заказ,"ИзменитьМетодДоставки",ПараметрыНаотправку,МассивСообщений);
		
		Для каждого ЭлементМассива Из МассивСообщений Цикл
			
			МассивОшибок.Добавить(ЭлементМассива); 	
			
		КонецЦикла;
		
		ОбновитьЗаказНаСервере();
		ДоступностьРедактированияЗаказа(); 	
		ВывестиПодсказкиПредупреждения();
		ВывестиТекстОшибок();

	КонецЕсли;
	

КонецПроцедуры // ВыборИзСпискаМетодДоставки()

&НаКлиенте
Процедура ОтработатьОтгрузку(Команда)
	
	МассивОшибок.Очистить();
	Если  НЕ ЗначениеЗаполнено(МетодДоставки)
		 	И (ЗначениеЗаполнено(Дозаказ)
		 	И СостояниеДоЗаказа <> ПредопределенноеЗначение("Перечисление.b2b_СтатусыДоЗаказов.Отменен"))  
		    И СостояниеЗаказа <> ПредопределенноеЗначение("Перечисление.СостоянияЗаказаКонтрагента.Отменен")   Тогда
	
		МетодыДоставки = Новый СписокЗначений; 				
		МетодыДоставки.Добавить("F","Заказ и дозаказ вместе"); 
		МетодыДоставки.Добавить("P","Заказ и дозаказ отдельно");  
		
		ОповещениеВыборИзСписка = Новый ОписаниеОповещения("ВыборИзСпискаМетодДоставкиБезОтправки",ЭтаФорма, Новый Структура); 
		
		ПоказатьВыборИзСписка(ОповещениеВыборИзСписка,МетодыДоставки,Элементы.ОтработатьОтгрузку);
 
		
	Иначе   		 
		 
		 ОтработатьОтгрузкуВОчередь(); 
		 
		 ОбновитьЗаказНаСервере();
		 ДоступностьРедактированияЗаказа(); 	
		 ВывестиПодсказкиПредупреждения();
		 ВывестиТекстОшибок();

	 КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура ОтработатьОтгрузкуВОчередь(ЗаписатьМетодДоставки = Ложь) 	
	
	ПараметрыНаОтправку = Новый Структура;
	ПараметрыНаОтправку.Вставить("НомерЗаявки",Заказ.НомерЗаказа);
	
	ТипЗапроса = "ОтправитьДатуОтгрузкиВместе";
	
	Если ЗначениеЗаполнено(РасходнаяНакладная1.ДатаОтгрузки)
		И РасходнаяНакладная1.СостояниеНакладной = ПредопределенноеЗначение("Перечисление.СостоянияНакладной.Отгружена")  Тогда
		
		ПараметрыНаОтправку.Вставить("ДатаОтгрузкиЗаказа",РасходнаяНакладная1.ДатаОтгрузки);	
		
	КонецЕсли;
	
	Если МетодДоставки = "F"  Тогда
		Если ЗначениеЗаполнено(Дозаказ) 
			И РасходнаяНакладная2.СостояниеНакладной <>  ПредопределенноеЗначение("Перечисление.СостоянияНакладной.Отгружена") Тогда
			
			МетодДоставки = "P";
			
			ЗаписатьМетодДоставки = Истина; 
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РасходнаяНакладная1.ДатаОтгрузки)
			И РасходнаяНакладная1.СостояниеНакладной <> ПредопределенноеЗначение("Перечисление.СостоянияНакладной.Отгружена")  Тогда
			
			МетодДоставки = "P";	
			
			ЗаписатьМетодДоставки = Истина;
		КонецЕсли;
		
		Если РасходнаяНакладная2.СостояниеНакладной =  ПредопределенноеЗначение("Перечисление.СостоянияНакладной.Отгружена")
			И РасходнаяНакладная1.СостояниеНакладной <> ПредопределенноеЗначение("Перечисление.СостоянияНакладной.Отгружена") 
			 И НачалоДня(РасходнаяНакладная1.ДатаОтгрузки) <> НачалоДня(РасходнаяНакладная2.ДатаОтгрузки) Тогда
		
			 МетодДоставки = "P";	
			 
			 ЗаписатьМетодДоставки = Истина;
		
		КонецЕсли;
    КонецЕсли;
	
	
	Если МетодДоставки = "F"  Тогда
		
		ТипЗапроса = "ОтправитьДатуОтгрузкиВместе";
		
		ПараметрыНаОтправку.Вставить("ДатаОтгрузкиЗаказа",РасходнаяНакладная1.ДатаОтгрузки);
		
	КонецЕсли;
	
	Если МетодДоставки = "P"  Тогда
		
		ТипЗапроса = "ОтправитьДатуОтгрузкиОтдельно";
		
		Если ЗначениеЗаполнено(Дозаказ) 
			И РасходнаяНакладная2.СостояниеНакладной = ПредопределенноеЗначение("Перечисление.СостоянияНакладной.Отгружена") Тогда
			
			ПараметрыНаОтправку.Вставить("ДатаОтгрузкиДозаказа",РасходнаяНакладная2.ДатаОтгрузки);
			
		КонецЕсли; 
		Если РасходнаяНакладная1.СостояниеНакладной = ПредопределенноеЗначение("Перечисление.СостоянияНакладной.Отгружена") Тогда
			ПараметрыНаОтправку.Вставить("ДатаОтгрузкиЗаказа",РасходнаяНакладная1.ДатаОтгрузки); 			 
		КонецЕсли;
		
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(МетодДоставки) Тогда
	
		Если ЗначениеЗаполнено(РасходнаяНакладная2.ДатаОтгрузки)
			И РасходнаяНакладная2.СостояниеНакладной = ПредопределенноеЗначение("Перечисление.СостоянияНакладной.Отгружена")  Тогда
			
			ПараметрыНаОтправку.Вставить("ДатаОтгрузкиДозаказа",РасходнаяНакладная2.ДатаОтгрузки);	
			
		КонецЕсли;	
	
	КонецЕсли;
	
	Если ЗаписатьМетодДоставки Тогда
	
		ПараметрыНаОтправку.Вставить("МетодДоставки",МетодДоставки); 	
	
	КонецЕсли;
	
	МассивСообщений = Новый Массив; 
	b2b_ОбменЗаявками.ЗаписатьВОчередьНаОтправку(Заказ,ТипЗапроса,ПараметрыНаОтправку,МассивСообщений);
	
	Для каждого ЭлементМассива Из МассивСообщений Цикл
		
		МассивОшибок.Добавить(ЭлементМассива); 	
		
	КонецЦикла;


КонецПроцедуры

&НаКлиенте
Процедура ВыборИзСпискаМетодДоставкиБезОтправки(ВыбранноеЗначение,ДополнительныеПараметры) Экспорт 
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение.Значение)  Тогда  		
			
		ПараметрыЗаписиВРегистр = Новый Структура; 
		ПараметрыЗаписиВРегистр.Вставить("МетодДоставки",ВыбранноеЗначение.Значение);
		b2b_ОбменЗаявками.ЗаписатьДополнительныеДанныеВРегистрЗаказов(Заказ,ПараметрыЗаписиВРегистр); 		
		
		ОтработатьОтгрузкуВОчередь(истина); 
		
		ОбновитьЗаказНаСервере();
		ДоступностьРедактированияЗаказа(); 	
		ВывестиПодсказкиПредупреждения();
		ВывестиТекстОшибок();
		
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОтгрузкуСоСклада(Команда)
	
	перем ПричинаТекст; 
	
	МассивОшибок.Очистить();
	//ПричинаТекст = "Причина отмены"; 
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтменитьОтгрузкуСоСкладаВводПричины",ЭтаФорма); 
	ПоказатьВводЗначения(ОписаниеОповещения,ПричинаТекст,"Причина отмены",Тип("СправочникСсылка.b2b_ПричиныОтменыЗаявок")); 	
	
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ОтменитьОтгрузкуСоСкладаВводПричины(ПричинаВведенная,ДополнительныеПараметры) Экспорт 

	Если ЗначениеЗаполнено(ПричинаВведенная) Тогда
		
		ПараметрыНаОтправку = Новый Структура;
		ПараметрыНаОтправку.Вставить("НомерЗаявки",Заказ.НомерЗаказа);
		ПараметрыНаОтправку.Вставить("ОтменаЗаказа",Истина);
		ПараметрыНаОтправку.Вставить("КомментарийОтменаЗаказа",Строка(ПричинаВведенная));
		ПараметрыНаОтправку.Вставить("ПричинаОтменаЗаказа",Строка(ПричинаВведенная));
		
		МассивСообщений = Новый Массив; 
		b2b_ОбменЗаявками.ЗаписатьВОчередьНаОтправку(Заказ,"ОтменитьотгрузкуВналичии",ПараметрыНаОтправку,МассивСообщений);
		
		Для каждого ЭлементМассива Из МассивСообщений Цикл
			
			МассивОшибок.Добавить(ЭлементМассива); 	
			
		КонецЦикла;

		
		ПричинаОтменыОтгрузки1 = Строка(ПричинаВведенная); 
		Элементы.ПричинаОтменыОтгрузки1.Видимость = Истина; 
		
		ПараметрыЗаписиВРегистр = Новый Структура; 
		ПараметрыЗаписиВРегистр.Вставить("ПричинаОтменыОтгрузкиЗаказа",ПричинаВведенная);
		b2b_ОбменЗаявками.ЗаписатьДополнительныеДанныеВРегистрЗаказов(Заказ.Ссылка,ПараметрыЗаписиВРегистр);
		
		ОбновитьЗаказНаСервере();
		ДоступностьРедактированияЗаказа(); 	
		ВывестиПодсказкиПредупреждения();
		ВывестиТекстОшибок();
	Иначе 
		ПоказатьПредупреждение(,"Необходимо обязательно ввести причину!")
	КонецЕсли;

КонецПроцедуры // ()


&НаКлиенте
Процедура ОтменитьОтгрузкуДозаказа(Команда)
	
	Перем ПричинаТекст; 
	
	МассивОшибок.Очистить();
	
	//ПричинаТекст = "Причина отмены"; 
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтменитьОтгрузкуДозаказаВводПричины",ЭтаФорма); 
	ПоказатьВводЗначения(ОписаниеОповещения,ПричинаТекст,"Причина отмены",Тип("СправочникСсылка.b2b_ПричиныОтменыЗаявок")); 
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОтгрузкуДозаказаВводПричины(ПричинаВведенная,ДополнительныеПараметры) Экспорт 

	Если ЗначениеЗаполнено(ПричинаВведенная) Тогда
		
		ПараметрыНаОтправку = Новый Структура;
		ПараметрыНаОтправку.Вставить("НомерЗаявки",Заказ.НомерЗаказа);
		ПараметрыНаОтправку.Вставить("ОтменаДозаказа",Истина);
		
		ПараметрыНаОтправку.Вставить("КомментарийОтменаДоЗаказа",Строка(ПричинаВведенная));
		ПараметрыНаОтправку.Вставить("ПричинаОтменаДоЗаказа",Строка(ПричинаВведенная));
		
		МассивСообщений = Новый Массив; 
		b2b_ОбменЗаявками.ЗаписатьВОчередьНаОтправку(Дозаказ,"ОтменитьОтгрузкуДозаказа",ПараметрыНаОтправку,МассивСообщений);
		
		Для каждого ЭлементМассива Из МассивСообщений Цикл
			
			МассивОшибок.Добавить(ЭлементМассива); 	
			
		КонецЦикла;

		
		ПричинаОтменыОтгрузки2 = Строка(ПричинаВведенная); 
		Элементы.ПричинаОтменыОтгрузки2.Видимость = Истина; 
		
		ПараметрыЗаписиВРегистр = Новый Структура; 
		ПараметрыЗаписиВРегистр.Вставить("ПричинаОтменыОтгрузкиДозаказа",ПричинаВведенная);
		b2b_ОбменЗаявками.ЗаписатьДополнительныеДанныеВРегистрЗаказов(Заказ.Ссылка,ПараметрыЗаписиВРегистр);
		
		ОбновитьЗаказНаСервере();
		ДоступностьРедактированияЗаказа(); 	
		ВывестиПодсказкиПредупреждения();
		ВывестиТекстОшибок();
		
	Иначе 
		ПоказатьПредупреждение(,"Необходимо обязательно ввести причину!")
	КонецЕсли;

КонецПроцедуры // ()


&НаКлиенте
Процедура ОтменитьЕдинуюОтгрузку(Команда)
	
	Перем ПричинаТекст; 
	
	МассивОшибок.Очистить();
	//ПричинаТекст = "Причина отмены"; 
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтменитьЕдинуюОтгрузкуВводПричины",ЭтаФорма); 
	ПоказатьВводЗначения(ОписаниеОповещения,ПричинаТекст,"Причина отмены",Тип("СправочникСсылка.b2b_ПричиныОтменыЗаявок"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЕдинуюОтгрузкуВводПричины(ПричинаВведенная,ДополнительныеПараметры) Экспорт 

	Если ЗначениеЗаполнено(ПричинаВведенная) Тогда
		
		ПараметрыНаОтправку = Новый Структура;
		ПараметрыНаОтправку.Вставить("НомерЗаявки",Заказ.НомерЗаказа);
		ПараметрыНаОтправку.Вставить("ОтменаЗаказа",Истина);
		
		ПараметрыНаОтправку.Вставить("КомментарийОтменаЗаказа",Строка(ПричинаВведенная));
		ПараметрыНаОтправку.Вставить("ПричинаОтменаЗаказа",Строка(ПричинаВведенная));
		
		МассивСообщений = Новый Массив; 
		b2b_ОбменЗаявками.ЗаписатьВОчередьНаОтправку(Заказ,"ОтменитьОтгрузкуЕдиную",ПараметрыНаОтправку,МассивСообщений);
		
		Для каждого ЭлементМассива Из МассивСообщений Цикл
			
			МассивОшибок.Добавить(ЭлементМассива); 	
			
		КонецЦикла;

		
		ПричинаОтменыОтгрузки1 = Строка(ПричинаВведенная); 
		Элементы.ПричинаОтменыОтгрузки1.Видимость = Истина; 
		
		ПараметрыЗаписиВРегистр = Новый Структура; 
		ПараметрыЗаписиВРегистр.Вставить("ПричинаОтменыОтгрузкиЗаказа",ПричинаВведенная);
		b2b_ОбменЗаявками.ЗаписатьДополнительныеДанныеВРегистрЗаказов(Заказ.Ссылка,ПараметрыЗаписиВРегистр);

		ОбновитьЗаказНаСервере();
		ДоступностьРедактированияЗаказа(); 	
		ВывестиПодсказкиПредупреждения();
		ВывестиТекстОшибок();
		
	Иначе 
		ПоказатьПредупреждение(,"Необходимо обязательно ввести причину!")
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура СоздатьРНК(Команда)
	
	МассивОшибок.Очистить();
	СоздатьРНКНаКлиенте(Заказ,Заказ.ДатаОтгрузки,Ложь,Элементы.РедактироватьВФормеЗаказа);
	ВывестиТекстОшибок();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРНКНаКлиенте(Знач ДокументЗаказа,ДатаОтгрузки,ЭтоДозаказ,ЭлементФормыОткрыть,ПоОстаткам = Ложь) 	
	
	СостояниеЗаказаДБ1 = ПредопределенноеЗначение("Перечисление.СостоянияЗаказаКонтрагента.ВРаботе"); 
	СостояниеСогласованияДБ = ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Согласован"); 
	
	РезультатПроверкиСостояния1 = b2b_ОбменЗаявками.ПроверитьСостояниеЗаказа(ДокументЗаказа, СостояниеЗаказаДБ1,СостояниеСогласованияДБ);
	
	СостояниеЗаказаДБ2 = ПредопределенноеЗначение("Перечисление.СостоянияЗаказаКонтрагента.ВыполненЧастично"); 
	СостояниеСогласованияДБ = ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Согласован"); 
	
	РезультатПроверкиСостояния2 = b2b_ОбменЗаявками.ПроверитьСостояниеЗаказа(ДокументЗаказа, СостояниеЗаказаДБ2,СостояниеСогласованияДБ);

	
	Если НЕ (РезультатПроверкиСостояния1 ИЛИ РезультатПроверкиСостояния2)  Тогда
		
		ПоказатьПредупреждение(,"Состояние заказа должно быть ""В работе"""); 
		
		Возврат; 	
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаОтгрузки)  Тогда
		
		ПоказатьПредупреждение(,"Необходимо заполнить в заказе поле ""Дата отгрузки""");
		
		Возврат; 
		
	КонецЕсли;
	
	Если НачалоДня(ДатаОтгрузки) <= НачалоДня(ТекущаяДата()) Тогда
	
		ПоказатьПредупреждение(,"""Дата отгрузки"" должна быть больше текущей даты");
		
		Возврат; 	
	
	КонецЕсли;
	
	РНКСуществующее = неопределено; 
	РезультатПроверкиСвязи =  b2b_ОбменЗаявками.ПроверитьСвязьСРНК(ДокументЗаказа,РНКСуществующее); 
	Если НЕ РезультатПроверкиСвязи
		И ЗначениеЗаполнено(РНКСуществующее) Тогда 
		
		//ОповещениеВопрос = Новый ОписаниеОповещения("СоздатьРНКПроверкаВопрос",ЭтаФорма); 
		//ПоказатьВопрос(ОповещениеВопрос,"Есть связанный РНК, изменить связь?",РежимДиалогаВопрос.ДаНет);
		
		ПараметрыФормы = Новый Структура("Ключ", РНКСуществующее);
		ОткрытьФорму("Документ.РасходнаяНакладная.Форма.ФормаДокумента", ПараметрыФормы);
		
	Иначе 
		//проверить, что выбран метод доставки
		
		//МетодДоставки = b2b_ОбменЗаявками.МетодДоставкиПоЗаказу(ДанныеСтроки.ссылка);
		
		Если НЕ ЗначениеЗаполнено(МетодДоставки) 
			И ЗначениеЗаполнено(Дозаказ)
			И (СостояниеДоЗаказа <>  ПредопределенноеЗначение("Перечисление.b2b_СтатусыДоЗаказов.Отменен"))
			И СостояниеЗаказа <> ПредопределенноеЗначение("Перечисление.СостоянияЗаказаКонтрагента.Отменен") Тогда
			
			МетодыДоставки = Новый СписокЗначений; 				
			МетодыДоставки.Добавить("F","Заказ и дозаказ вместе"); 
			МетодыДоставки.Добавить("P","Заказ и дозаказ отдельно");
			
			СтруктураПараметров = Новый Структура("Заказ,Этодозаказ,ПоОстаткам",ДокументЗаказа,ЭтоДозаказ,ПоОстаткам); 
			
			ОповещениеВыборИзСписка = Новый ОписаниеОповещения("ВыборИзСпискаМетодДоставкиСозданиеРНК",ЭтаФорма,СтруктураПараметров); 
			
			ПоказатьВыборИзСписка(ОповещениеВыборИзСписка,МетодыДоставки,ЭлементФормыОткрыть); 
		Иначе 
			МассивСообщений = Новый Массив;
			
			РазблокироватьДокументыЗаказовДляРедактирования(); 
			
			РНКСуществующее = b2b_ОбменЗаявками.СоздатьРНКНаСервере(ДокументЗаказа,ЭтоДозаказ,МассивСообщений,ПоОстаткам);
			
			Для каждого ЭлементМассива Из МассивСообщений Цикл
				
				МассивОшибок.Добавить(ЭлементМассива); 	
				
			КонецЦикла;
			
			ОбновитьЗаказНаСервере(); 
			ДоступностьРедактированияЗаказа(); 	
			ВывестиПодсказкиПредупреждения();
	
			ЗаблокироватьДокументыЗаказовДляРедактирования();
			
			Если ЗначениеЗаполнено(РНКСуществующее)  Тогда
				
				ПараметрыФормы = Новый Структура("Ключ", РНКСуществующее);
				ОткрытьФорму("Документ.РасходнаяНакладная.Форма.ФормаДокумента", ПараметрыФормы);
				
				
			КонецЕсли;
		КонецЕсли;
		
		
		
	КонецЕсли;


КонецПроцедуры


&НаКлиенте
Процедура ВыборИзСпискаМетодДоставкиСозданиеРНК(ВыбранноеЗначение,ДополнительныеПараметры) Экспорт 
	
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение.Значение)  Тогда
		
		Если  ДополнительныеПараметры.Этодозаказ Тогда
			
			ОсновнойЗаказ = b2b_ОбменЗаявками.НайтиОсновнойЗаказпоДозаказу(ДополнительныеПараметры.Заказ); 	
		Иначе
			
			ОсновнойЗаказ =  ДополнительныеПараметры.Заказ; 
			
		КонецЕсли;
		
		ПараметрыЗаписиВРегистр = Новый Структура; 
		ПараметрыЗаписиВРегистр.Вставить("МетодДоставки",ВыбранноеЗначение.Значение);
		b2b_ОбменЗаявками.ЗаписатьДополнительныеДанныеВРегистрЗаказов(ОсновнойЗаказ,ПараметрыЗаписиВРегистр); 		
		
		МассивСообщений = Новый Массив; 
		
		РазблокироватьДокументыЗаказовДляРедактирования();
		
		РНКСуществующее = b2b_ОбменЗаявками.СоздатьРНКНаСервере(ДополнительныеПараметры.Заказ,ДополнительныеПараметры.Этодозаказ,МассивСообщений,ДополнительныеПараметры.ПоОстаткам);
		
		Для каждого ЭлементМассива Из МассивСообщений Цикл
				
				МассивОшибок.Добавить(ЭлементМассива); 	
				
			КонецЦикла;

	
		ОбновитьЗаказНаСервере();
		ДоступностьРедактированияЗаказа(); 	
		ВывестиПодсказкиПредупреждения();
		
		ЗаблокироватьДокументыЗаказовДляРедактирования();
		
		Если ЗначениеЗаполнено(РНКСуществующее)  Тогда
			
			ПараметрыФормы = Новый Структура("Ключ", РНКСуществующее);
			ОткрытьФорму("Документ.РасходнаяНакладная.Форма.ФормаДокумента", ПараметрыФормы);
			
			
		КонецЕсли;

	КонецЕсли;
	

КонецПроцедуры // ВыборИзСпискаМетодДоставки()

&НаКлиенте
Процедура СоздатьРНКПоДозаказу(Команда)
	//
	//СписокВопросов = Новый СписокЗначений; 
	//СписокВопросов.Добавить("ПоФактическомуКоличеству","По фактическому количеству"); 
	//СписокВопросов.Добавить("ПоОстаткам","По остаткам   ");
	//СписокВопросов.Добавить("Отмена","Отмена");
	//
	//ОповещениеВопрос = Новый ОписаниеОповещения("ВопросСозданиеРНКДозаказ",ЭтаФорма); 
	//ПоказатьВопрос(ОповещениеВопрос,"Создать РНК ",СписокВопросов); 
	//
	МассивОшибок.Очистить();
	СоздатьРНКНаКлиенте(Дозаказ,ДатаОтгрузкиПоЗаказу(Дозаказ),Истина,Элементы.ФормаОткрытьДозаказ,Истина);
	ВывестиТекстОшибок();
	
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ВопросСозданиеРНКДозаказ(ОтветНаВопрос,ДополнительныеПараметры) Экспорт 
	Если ОтветНаВопрос = неопределено 
		ИЛИ ОтветНаВопрос = "Отмена" Тогда
		
		
		Возврат; 	
		
	КонецЕсли;
	МассивОшибок.Очистить();
	
	Если  ОтветНаВопрос = "ПоФактическомуКоличеству" Тогда
	    СоздатьРНКНаКлиенте(Дозаказ,ДатаОтгрузкиПоЗаказу(Дозаказ),Истина,Элементы.ФормаОткрытьДозаказ);
	ИначеЕсли ОтветНаВопрос = "ПоОстаткам" Тогда	
	    СоздатьРНКНаКлиенте(Дозаказ,ДатаОтгрузкиПоЗаказу(Дозаказ),Истина,Элементы.ФормаОткрытьДозаказ,Истина);
	КонецЕсли;
	
	ВывестиТекстОшибок();

КонецПроцедуры // ()


// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервереБезКонтекста
Функция ДатаОтгрузкиПоЗаказу(Знач ДокументЗаказа)

	Возврат ДокументЗаказа.ДатаОтгрузки; 	

КонецФункции // ДатаОтгрузкиПоЗаказу()

&НаКлиенте
Процедура СоздатьРНКОбщий(Команда)
	//создаем 2 РНК 
	МассивОшибок.Очистить();
	
	Если Не ЗначениеЗаполнено(Дозаказ)
		
		 ИЛИ (ЗначениеЗаполнено(Дозаказ) 
		 И СостояниеДоЗаказа = ПредопределенноеЗначение("Перечисление.b2b_СтатусыДоЗаказов.Отменен")) Тогда
		
		СоздатьРНКНаКлиенте(Заказ,ПлановаяДатаОтгрузки,Ложь,Элементы.СоздатьРНКОбщий);
		
		
	ИначеЕсли ЗначениеЗаполнено(Дозаказ) И СостояниеЗаказа = ПредопределенноеЗначение("Перечисление.СостоянияЗаказаКонтрагента.Отменен") Тогда 
		
		 
		СоздатьРНКНаКлиенте(Дозаказ,ДатаОтгрузкиПоЗаказу(Дозаказ),истина,Элементы.СоздатьРНКОбщий);
		
		
	Иначе 
		
		
		СостояниеЗаказаДБ1 = ПредопределенноеЗначение("Перечисление.СостоянияЗаказаКонтрагента.ВРаботе");
		СостояниеЗаказаДБ2 = ПредопределенноеЗначение("Перечисление.СостоянияЗаказаКонтрагента.ВыполненЧастично");
		СостояниеСогласованияДБ = ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Согласован"); 
		
		РезультатПроверкиСостояния1 = b2b_ОбменЗаявками.ПроверитьСостояниеЗаказа(Заказ, СостояниеЗаказаДБ1,СостояниеСогласованияДБ);
		РезультатПроверкиСостояния2 = b2b_ОбменЗаявками.ПроверитьСостояниеЗаказа(Заказ, СостояниеЗаказаДБ2,СостояниеСогласованияДБ);
		
		РезультатПроверкиСостоянияДозаказа1 = b2b_ОбменЗаявками.ПроверитьСостояниеЗаказа(Дозаказ, СостояниеЗаказаДБ1,СостояниеСогласованияДБ);
		РезультатПроверкиСостоянияДозаказа2 = b2b_ОбменЗаявками.ПроверитьСостояниеЗаказа(Дозаказ, СостояниеЗаказаДБ2,СостояниеСогласованияДБ);
		
		Если НЕ (РезультатПроверкиСостояния1 ИЛИ РезультатПроверкиСостояния2)
			ИЛИ НЕ (РезультатПроверкиСостоянияДозаказа1 ИЛИ РезультатПроверкиСостоянияДозаказа2) Тогда
			
			ПоказатьПредупреждение(,"Состояния заказов должно быть ""В работе"""); 
			
			Возврат; 	
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Заказ.ДатаОтгрузки)
			 ИЛИ НЕ ЗначениеЗаполнено(Дозаказ.ДатаОтгрузки) Тогда
			
			ПоказатьПредупреждение(,"Необходимо заполнить в заказах поле ""Дата отгрузки""");
			
			Возврат; 
		 	
		КонецЕсли;
		
		Если НачалоДня(Заказ.ДатаОтгрузки) <= НачалоДня(ТекущаяДата()) 
			ИЛИ НачалоДня(Дозаказ.ДатаОтгрузки) <= НачалоДня(ТекущаяДата()) Тогда
		
			ПоказатьПредупреждение(,"Необходимо поменять плановую дату отгрузки, она должна быть больше текущей даты");
			
			Возврат;	
		
		КонецЕсли;
		
		РНК1 = неопределено; 
		РНК1СвязьПустая = b2b_ОбменЗаявками.ПроверитьСвязьСРНК(Заказ,РНК1);
		
		РНК2 = неопределено; 
		РНК2СвязьПустая = b2b_ОбменЗаявками.ПроверитьСвязьСРНК(Дозаказ,РНК2);
		
		Если НЕ РНК1СвязьПустая 
			ИЛИ НЕ РНК2СвязьПустая Тогда
			
			Если РНК1 <> РНК2 Тогда
				
				МассивОшибок.Добавить("Ранее были созданы РНК по документам заказов:"); 
				МассивОшибок.Добавить(Строка(РНК1));
				МассивОшибок.Добавить(Строка(РНК2));
				
				Сообщить("Ранее были созданы РНК по документам заказов:"); 
				Сообщить(Строка(РНК1));
				Сообщить(Строка(РНК2));
			Иначе 
				ПараметрыФормы = Новый Структура("Ключ", РНК1);
				ОткрытьФорму("Документ.РасходнаяНакладная.Форма.ФормаДокумента", ПараметрыФормы);
			КонецЕсли;
			Возврат; 
		КонецЕсли;

		Если Не ЗначениеЗаполнено(МетодДоставки) 
			ИЛИ МетодДоставки = "P" Тогда 
			
			//МетодыДоставки = Новый СписокЗначений; 				
			//МетодыДоставки.Добавить("F","Заказ и дозаказ вместе"); 
			//МетодыДоставки.Добавить("P","Заказ и дозаказ отдельно");  
			//
			//ОповещениеВыборИзСписка = Новый ОписаниеОповещения("ВыборИзСпискаМетодДоставкиПриСозданииРНК",ЭтаФорма, Новый Структура); 
			//
			//ПоказатьВыборИзСписка(ОповещениеВыборИзСписка,МетодыДоставки,Элементы.СоздатьРНКОбщий);
			
			ОповещениеВопрос = Новый ОписаниеОповещения("УстановкаМетодаДоставкиВместе",ЭтаФорма); 
			
			ПоказатьВопрос(ОповещениеВопрос,"Метод доставки будет установлен ""Заказ и дозаказ вместе"", продолжить?",РежимДиалогаВопрос.ОКОтмена); 
		
		Иначе 
			
			//СоздатьРНКНаКлиенте(Заказ,ПлановаяДатаОтгрузки,Ложь,Элементы.СоздатьРНКОбщий);
			//СоздатьРНКНаКлиенте(Дозаказ,ПлановаяДатаОтгрузкиДозаказа,истина,Элементы.СоздатьРНКОбщий);
			
						
			МассивЗаказов = Новый Массив; 
			МассивЗаказов.Добавить(Заказ);
			МассивЗаказов.Добавить(Дозаказ);
			
			МассивСообщений = Новый Массив;
			РазблокироватьДокументыЗаказовДляРедактирования();
			РНКСуществующее = b2b_ОбменЗаявками.СоздатьРНКПоНесколькимЗаказам(МассивЗаказов,МассивСообщений); 
			Для каждого ЭлементМассива Из МассивСообщений Цикл
				
				МассивОшибок.Добавить(ЭлементМассива); 	
				
			КонецЦикла;
			
			//ОбновитьИзЗаказа("");
			ОбновитьЗаказНаСервере();
			ДоступностьРедактированияЗаказа(); 	
			ВывестиПодсказкиПредупреждения();
						
			ЗаблокироватьДокументыЗаказовДляРедактирования();
			
			Если ЗначениеЗаполнено(РНКСуществующее)  Тогда
				
				ПараметрыФормы = Новый Структура("Ключ", РНКСуществующее);
				ОткрытьФорму("Документ.РасходнаяНакладная.Форма.ФормаДокумента", ПараметрыФормы);
				
				
			КонецЕсли;

			
		КонецЕсли; 	
				
	Конецесли; 
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура УстановкаМетодаДоставкиВместе(ОтветНаВопрос,ДополнитеныеПараметры) Экспорт

	Если ОтветНаВопрос = Неопределено Тогда
		
		Возврат; 
		
	КонецЕсли;
	
	Если ОтветНаВопрос = КодВозвратаДиалога.ОК Тогда
	
		МетодДоставки = "F";
		
		ПараметрыЗаписиВРегистр = Новый Структура; 
		ПараметрыЗаписиВРегистр.Вставить("МетодДоставки",МетодДоставки);
		b2b_ОбменЗаявками.ЗаписатьДополнительныеДанныеВРегистрЗаказов(Заказ,ПараметрыЗаписиВРегистр);
		
		МассивЗаказов = Новый Массив; 
		МассивЗаказов.Добавить(Заказ);
		МассивЗаказов.Добавить(Дозаказ);
		
		МассивСообщений = Новый Массив;
		РазблокироватьДокументыЗаказовДляРедактирования(); 
		РНКСуществующее = b2b_ОбменЗаявками.СоздатьРНКПоНесколькимЗаказам(МассивЗаказов,МассивСообщений);
		
		Для каждого ЭлементМассива Из МассивСообщений Цикл
			
			МассивОшибок.Добавить(ЭлементМассива); 	
			
		КонецЦикла;
		
		//ОбновитьИзЗаказа("");
		ОбновитьЗаказНаСервере();
		ДоступностьРедактированияЗаказа(); 	
		ВывестиПодсказкиПредупреждения();
				
		ЗаблокироватьДокументыЗаказовДляРедактирования();
		
		Если ЗначениеЗаполнено(РНКСуществующее)  Тогда
			
			ПараметрыФормы = Новый Структура("Ключ", РНКСуществующее);
			ОткрытьФорму("Документ.РасходнаяНакладная.Форма.ФормаДокумента", ПараметрыФормы);
			
			
		КонецЕсли;

	
	КонецЕсли;

КонецПроцедуры // УстановкаМетодаДоставкиВместе()


// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ВыборИзСпискаМетодДоставкиПриСозданииРНК(ВыбранноеЗначение,ДополнительныеПараметры) Экспорт 

	    Если ВыбранноеЗначение = неопределено Тогда
		
			Возврат; 	
		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыбранноеЗначение.Значение)  Тогда  		
			
			ПараметрыЗаписиВРегистр = Новый Структура; 
			ПараметрыЗаписиВРегистр.Вставить("МетодДоставки",ВыбранноеЗначение.Значение);
			b2b_ОбменЗаявками.ЗаписатьДополнительныеДанныеВРегистрЗаказов(Заказ,ПараметрыЗаписиВРегистр); 		
			
			ПараметрыНаотправку = Новый Структура;
			ПараметрыНаотправку.Вставить("НомерЗаявки",Заказ.НомерЗаказа);
			ПараметрыНаотправку.Вставить("МетодДоставки",ВыбранноеЗначение.Значение);
			
			МассивСообщений = Новый Массив; 
			
			b2b_ОбменЗаявками.ЗаписатьВОчередьНаОтправку(заказ,"ИзменитьМетодДоставки",ПараметрыНаотправку,МассивСообщений);
			
			Для каждого ЭлементМассива Из МассивСообщений Цикл
				
				МассивОшибок.Добавить(ЭлементМассива); 	
				
			КонецЦикла;

			 
			МетодДоставки = ВыбранноеЗначение.Значение; 
			
			СоздатьРНКНаКлиенте(Заказ,ПлановаяДатаОтгрузки,Ложь,Элементы.СоздатьРНКОбщий);
			СоздатьРНКНаКлиенте(Дозаказ,ПлановаяДатаОтгрузкиДозаказа,истина,Элементы.СоздатьРНКОбщий);

			
		КонецЕсли;


КонецПроцедуры // ВыборИзСпискаМетодДоставкиПриСозданииРНК()


&НаКлиенте
Процедура ПометитьНаУдалениеДозаказ(Команда)
	МассивОшибок.Очистить();
	Если Не ЗначениеЗаполнено(СостояниеДоЗаказа) 
			И  ЗначениеЗаполнено(Дозаказ)  Тогда
	
		ПометитьНаУдалениеДозаказНаСервере(); 	
	
	КонецЕсли;
	ВывестиТекстОшибок();
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ПометитьНаУдалениеДозаказНаСервере()
   
	ОбъектДозаказ = Дозаказ.ПолучитьОбъект();
	 
	
	Попытка
		
		Если  ОбъектДозаказ.Проведен Тогда
			
			ОбъектДозаказ.Записать(РежимЗаписиДокумента.ОтменаПроведения);	
			
		КонецЕсли;
		
		ОбъектДозаказ.УстановитьПометкуУдаления(истина); 
		 
		
		НаборЗаписей = РегистрыСведений.b2b_Дозаказы.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Заказ.Установить(ОбъектДозаказ.Ссылка); 
		НаборЗаписей.Записать(); 
	
	Исключение
	   Сообщить(ОписаниеОшибки()); 
	   МассивОшибок.Добавить(ОписаниеОшибки()); 
   КонецПопытки;
   
   ОбновитьЗаказНаСервере(истина);
   ДоступностьРедактированияЗаказа(); 	
   ВывестиПодсказкиПредупреждения();
   
   

КонецПроцедуры // ПометитьНаУдалениеДозаказНаСервере()

&НаКлиенте
Процедура ПлановаяДатаОтгрузкиДозаказаПриИзменении(Элемент)
	Модифицированность = истина; 
	ИзмененияПоДозаказу = Истина;
	НадписьИзменений();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ПересчитатьСрокПодтвержденияПоЗаявке",30);
	ПодключитьОбработчикОжидания("ЗакрытьФормуПриОбновленииЗаказа",1);

	
	НадписьИзменений(); 
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ЗакрытьФормуПриОбновленииЗаказа()

	Если ЭтаФорма.Открыта() 
		И (b2b_ОбменЗаявками.ЗапросНаЗакрытиеФормы(Заказ)
		ИЛИ  b2b_ОбменЗаявками.ЗапросНаЗакрытиеФормы(Дозаказ)) Тогда
		
		Сообщить("Форма заказа была закрыта, так как необходимо обновление данных с сайта " + Строка(Заказ.НомерЗаказа)); 
		ПараметрыЗакрытия = Новый Структура; 
		ПараметрыЗакрытия.Вставить("Сообщить", "Форма заказа " + Строка(Заказ.НомерЗаказа) + " была закрыта, так как необходимо обновление данных с сайта " ); 
				
		Закрыть(ПараметрыЗакрытия);
	КонецЕсли; 

КонецПроцедуры // ЗакрытьФормуПриОбновленииЗаказа()


// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ПересчитатьСрокПодтвержденияПоЗаявке()

	Если ЗначениеЗаполнено(СрокПодтвержденияПоДозаказу) Тогда    
		 
	    РазницаВСекундах =  СрокПодтвержденияПоДозаказу - ТекущаяДата() ; 
		ЧасыЦелые = Цел(РазницаВСекундах/3600);// ,0,РежимОкругления.Окр15как10);
		
		ОстатокСекунд = РазницаВСекундах  - ЧасыЦелые * 3600; 
		Минуты = Цел(ОстатокСекунд/60); //,0,РежимОкругления.Окр15как10);             // Окр(РазницаВСекундах/60,0,РежимОкругления.Окр15как10) - ЧасыЦелые*60; 
		
		СрокПодтвержденияВЧасах = Формат(ЧасыЦелые,"ЧН=0; ЧГ=0") + " ч." + Формат(Минуты,"ЧН=0; ЧГ=0") + "минут"; 
	Иначе 
		СрокПодтвержденияВЧасах = ""; 
	КонецЕсли; 

КонецПроцедуры // ПересчитатьСрокПодтвержденияПоЗаявке()

&НаКлиенте
Процедура СохранитьДляДальнейшегоРедактирования(Команда) 
	МассивОшибок.Очистить();
	
	СоответствиеТоварКоличествоРезерв = Новый Соответствие;
	
	СоответствиеТоварЦенаСкидка = Новый Соответствие;
		
	Для каждого СтрокаТовара Из Данные Цикл
		
		СтруктураЦенаСкидка = Новый Структура("Цена,ЦенаБезСкидки,Скидка,ДопСкидкаНаНакладную,СкидкаНаНакладную"); 
		ЗаполнитьЗначенияСвойств(СтруктураЦенаСкидка,СтрокаТовара); 
		СтруктураЦенаСкидка.СкидкаНаНакладную = Скидка;
		СтруктураЦенаСкидка.ДопСкидкаНаНакладную = ДопСкидкаНаНакладную;
		
		СоответствиеТоварКоличествоРезерв.Вставить(СтрокаТовара.Номенклатура,СтрокаТовара.КоличествоРезерв);	
		СоответствиеТоварЦенаСкидка.Вставить(СтрокаТовара.Номенклатура,СтруктураЦенаСкидка);
		//СтрокаТовара.ИзмененаСтрока = Ложь; 
	КонецЦикла;
	
	ПараметрыЗаписиВРегистр = Новый Структура; 
	ПараметрыЗаписиВРегистр.Вставить("СоответствиеТоварКоличествоРезерв",СоответствиеТоварКоличествоРезерв);
	ПараметрыЗаписиВРегистр.Вставить("СоответствиеТоварЦенаСкидка",СоответствиеТоварЦенаСкидка);
	b2b_ОбменЗаявками.ЗаписатьДополнительныеДанныеВРегистрЗаказов(Заказ.Ссылка,ПараметрыЗаписиВРегистр);
	
	ИзмененияПоЗаказуСтроки = Ложь;
	
	НадписьИзменений();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФактПлан(Команда)
	
	МассивОшибок.Очистить();
	
	ЗаполнитьФактПланНаКлиенте();

	НадписьИзменений(); 
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФактПланНаКлиенте()
	
	
	Для каждого СтрокаДанных Из Данные Цикл	 
		
		Количество = СтрокаДанных.Количество; 
		
		СтрокаДанных.Количество = СтрокаДанных.Заявка; 
		Если Количество <> СтрокаДанных.Количество Тогда 
			СтрокаДанных.ИзмененаСтрока = Истина;
			
			ИзмененияПоЗаказу = истина;
			ИзмененияПоЗаказуСтроки = Истина; 
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПровестиЗаказНаСервере(Знач ДокументЗаказа)
	ОбъектЗаказ = ДокументЗаказа.ПолучитьОбъект(); 
	Попытка
	
		ОбъектЗаказ.Записать(РежимЗаписиДокумента.Проведение); 
	
	Исключение
	    Сообщить(ОписаниеОшибки());
		МассивОшибок.Добавить(ОписаниеОшибки()); 
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПровестиЗаказ(Команда)
	МассивОшибок.Очистить();
	ПровестиЗаказНаСервере(Заказ);
	ВывестиТекстОшибок();
КонецПроцедуры

&НаКлиенте
Процедура ПровестиДозаказ(Команда)
	МассивОшибок.Очистить();
	ПровестиЗаказНаСервере(Дозаказ);
	ВывестиТекстОшибок();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьРНК(Команда)
	МассивОшибок.Очистить();
	Если  СостояниеЗаявки = ПредопределенноеЗначение("Перечисление.b2b_СтатусыЗаказов.Выполнена") Тогда
		
		ПоказатьПредупреждение(,"Пометка на удаление недоступна"); 
		Возврат; 
	КонецЕсли;
	
	Если  СостояниеЗаявки = ПредопределенноеЗначение("Перечисление.b2b_СтатусыЗаказов.ЧастичноВыполнена")
		  И СостояниеДоЗаказа = ПредопределенноеЗначение("Перечисление.b2b_СтатусыДоЗаказов.Отменен") Тогда
		
		ПоказатьПредупреждение(,"Пометка на удаление недоступна"); 
		Возврат; 
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Дозаказ)
		
		ИЛИ (ЗначениеЗаполнено(Дозаказ) 
		И СостояниеДоЗаказа = ПредопределенноеЗначение("Перечисление.b2b_СтатусыДоЗаказов.Отменен")) Тогда
		
		УдалитьРНКНАСервере(Заказ);
		
		ОбновитьИзЗаказа(""); 
		
	ИначеЕсли ЗначениеЗаполнено(Дозаказ) И СостояниеЗаказа = ПредопределенноеЗначение("Перечисление.СостоянияЗаказаКонтрагента.Отменен") Тогда 
		
		УдалитьРНКНАСервере(Дозаказ);
		ОбновитьИзЗаказа("");
	ИначеЕсли ЗначениеЗаполнено(РасходнаяНакладная1) И НЕ ЗначениеЗаполнено(РасходнаяНакладная2) Тогда
		
		УдалитьРНКНАСервере(Заказ);
		
		ОбновитьИзЗаказа("");
		
	ИначеЕсли  НЕ ЗначениеЗаполнено(РасходнаяНакладная1) И ЗначениеЗаполнено(РасходнаяНакладная2) Тогда
		
		УдалитьРНКНАСервере(Дозаказ);
		
		ОбновитьИзЗаказа("");
	Иначе 
		
		ОповещениеВопрос = Новый ОписаниеОповещения("УдалитьРНКВопрос",ЭтаФорма);
		
		СписокНакладных = Новый СписокЗначений; 
		Если РасходнаяНакладная1 = РасходнаяНакладная2 Тогда
			
			СписокНакладных.Добавить("РНК1",Строка(РасходнаяНакладная1));	
		ИначеЕсли СостояниеЗаявки = ПредопределенноеЗначение("Перечисление.b2b_СтатусыЗаказов.ЧастичноВыполнена") Тогда
			Если НЕ (СостояниеРНКОтгружен(РасходнаяНакладная1)
				 И СостояниеЗаказа = ПредопределенноеЗначение("Перечисление.СостоянияЗаказаКонтрагента.ВыполненЧастично")) Тогда
				
				СписокНакладных.Добавить("РНК1",Строка(РасходнаяНакладная2));	
				
			КонецЕсли;
			
			Если НЕ (СостояниеРНКОтгружен(РасходнаяНакладная2)
				 И СостояниеДоЗаказа = ПредопределенноеЗначение("Перечисление.СостоянияЗаказаКонтрагента.ВыполненЧастично")) Тогда
				
				СписокНакладных.Добавить("РНК2",Строка(РасходнаяНакладная2));	
				
			КонецЕсли;
		Иначе 
			СписокНакладных.Добавить("РНК1",Строка(РасходнаяНакладная1));
			СписокНакладных.Добавить("РНК2",Строка(РасходнаяНакладная2));
			СписокНакладных.Добавить("ВыбратьВсе","Выбрать все");
		КонецЕсли;		
		
		СписокНакладных.Добавить("Отмена","Отмена");
		
		ПоказатьВопрос(ОповещениеВопрос,"Выберите РНК для пометки на удаление",СписокНакладных); 
	КонецЕсли; 	
	
КонецПроцедуры

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервереБезКонтекста
Функция СостояниеРНКОтгружен(Знач РНК)

	Возврат РНК.отгружен = Перечисления.Отгружен.Отгружен; 

КонецФункции // СостояниеРНКОтгружен()


// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура УдалитьРНКВопрос(ОтветНаВопрос,ДопПараметры) Экспорт 
	
	Если ОтветНаВопрос = Неопределено Тогда
	
		Возврат; 	
	
	КонецЕсли;
	
	Если ОтветНаВопрос = "РНК1" Тогда
	
		УдалитьРНКНАСервере(Заказ); 	
		
	ИначеЕсли ОтветНаВопрос = "РНК2" Тогда
	
		УдалитьРНКНАСервере(Дозаказ);
		
	ИначеЕсли ОтветНаВопрос = "ВыбратьВсе" Тогда
		
		ОповещениеВопросПослеВыбратьВсе = Новый ОписаниеОповещения("УдалениеПослеВыбратьВсе",ЭтаФорма); 
		ПоказатьВопрос(ОповещениеВопросПослеВыбратьВсе,"Будут помечены РНК и по заказу и по дозаказу, продолжить?",РежимДиалогаВопрос.ДаНет); 
		
	Иначе 
		Возврат; 
	КонецЕсли;
	
	ОбновитьИзЗаказа("");

	

КонецПроцедуры // УдалитьРНКВопрос()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура УдалениеПослеВыбратьВсе(ОтветНаВопрос,ДопПараметры)  Экспорт 

	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда 	
		
		УдалитьРНКНАСервере(Заказ);
		УдалитьРНКНАСервере(Дозаказ);	
		ОбновитьИзЗаказа("");
	КонецЕсли;

КонецПроцедуры // ()


// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура УдалитьРНКНАСервере(Знач ЗаказРНК)
	РезультатУдаления = Ложь; 
	b2b_ОбменЗаявками.ПометитьНаУдалениеРНК(ЗаказРНК,РезультатУдаления); 
	Если  РезультатУдаления тогда 
		Сообщить("РНК был(и) помечен(ы) на удаление");
		МассивОшибок.Добавить("РНК был(и) помечен(ы) на удаление"); 
	Иначе 
		Сообщить("Ошибка установки пометки на удаление");
		МассивОшибок.Добавить("Ошибка установки пометки на удаление"); 
	КонецЕсли;
КонецПроцедуры // УдалитьРНКНАСервере()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура НадписьНеСоответствиеПодтвержденнаяЗаявкаКоличество()
	Элементы.ДекорацияПредупреждениеНесоответствие.Заголовок = ""; 
	Для каждого СтрокаДанных Из Данные Цикл
	
		Если СтрокаДанных.ПодтвержденнаяЗаявка <> СтрокаДанных.Количество Тогда
		
			Элементы.ДекорацияПредупреждениеНесоответствие.Заголовок = "В таблице есть несоответствие ""Подтвержденная заявка"" и ""Количество"" "; 
			
			Прервать; 
		
		КонецЕсли;
	
	КонецЦикла;
	
	Элементы.ДекорацияПредупреждениеНесоответствиеДозаказ.Заголовок = ""; 
	
	Для каждого СтрокаДанных Из Данные Цикл
	
		Если СтрокаДанных.ПодтвержденнаяЗаявка <> СтрокаДанных.Количество Тогда
		
			Элементы.ДекорацияПредупреждениеНесоответствиеДозаказ.Заголовок = "В таблице есть несоответствие ""Подтвержденная заявка"" и ""Количество"" "; 
			
			Прервать; 
		
		КонецЕсли;
	
	КонецЦикла;
	
	Элементы.ДекорацияПредупрежденияПровести.Заголовок = ""; 
	Если Заказ.Товары.Количество() > 0 
		И НЕ Заказ.Проведен  Тогда
	
		Элементы.ДекорацияПредупрежденияПровести.Заголовок = "!!!Товары не зарезервированы, проведите документ"; 	
	
	КонецЕсли;
	

КонецПроцедуры // НадписьНеСоответствиеПодтвержденнаяЗаявкаКоличество()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ВывестиТекстОшибок()

	Массив = МассивОшибок.ВыгрузитьЗначения();
	ТекстОшибки = СтрСоединить(Массив,Символы.ПС); 

КонецПроцедуры // ВывестиТекстошибок()

&НаКлиенте
Процедура ДопСкидкаНаНакладнуюПриИзменении(Элемент)
	ОповещениеВопрос = Новый ОписаниеОповещения("ИзменениеДопСкидкаНаНакладную",ЭтаФорма); 
	ПоказатьВопрос(ОповещениеВопрос,"Перерасчитать Цены?",РежимДиалогаВопрос.ДаНет); 
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ИзменениеДопСкидкаНаНакладную(ОтветНаВопрос,ДополнительныеПараметры) Экспорт 

	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		
		РассчитатьЦенуПоТоварам(""); 
		
	КонецЕсли;

КонецПроцедуры // КлассификаторСтранМира()

&НаКлиенте
Процедура СкидкаПриИзменении(Элемент)
	Если ДопСкидкаНаНакладную Тогда
		
		ОповещениеВопрос = Новый ОписаниеОповещения("ИзменениеДопСкидкаНаНакладную",ЭтаФорма); 
		ПоказатьВопрос(ОповещениеВопрос,"Перерасчитать Цены?",РежимДиалогаВопрос.ДаНет); 	
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеЦенаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Данные.ТекущиеДанные; 
	Если ТекущиеДанные = Неопределено Тогда
	
		Возврат; 	
	
	КонецЕсли;
	
	ТекСкидка = ?(ТекущиеДанные.Скидка=0,Скидка,ТекущиеДанные.Скидка);
	Если ТекСкидка >= 0 Тогда
		ТекущиеДанные.ЦенаБезСкидки=ТекущиеДанные.Цена/(1-ТекСкидка/100);
	Иначе
		ТекущиеДанные.ЦенаБезСкидки=ТекущиеДанные.Цена;
	КонецЕсли;
	
	РассчитатьСуммуТаблицыДанных(ТекущиеДанные,Скидка,ДопСкидкаНаНакладную); 
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуТаблицыДанных(СтрокаТЧ,СкидкаШапки,ДопСкидкаНаНакладную)

	СкидкаТЧ = СтрокаТЧ.Скидка;
	Если СкидкаТЧ = 0 Тогда
		СкидкаРасчетная = СкидкаШапки;
	Иначе
		Если СкидкаТЧ > 0 Тогда				
			СкидкаРасчетная = СкидкаТЧ;
			Если ДопСкидкаНаНакладную Тогда
				СкидкаРасчетная = СкидкаРасчетная + СкидкаШапки;
			КонецЕсли; 
		Иначе
			Если СкидкаТЧ = -1 Тогда
				СкидкаРасчетная = 0;
			Иначе
				СкидкаРасчетная = СкидкаТЧ;
				Если ДопСкидкаНаНакладную Тогда
					СкидкаРасчетная = СкидкаРасчетная + СкидкаШапки;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;	
	
	СтрокаТЧ.Цена	= СтрокаТЧ.ЦенаБезСкидки*(1-СкидкаРасчетная/100); //округление под разрядность реквизита "Цена" документа
	Цена			= СтрокаТЧ.Цена;
		
	СтрокаТЧ.Всего 	= Цена * СтрокаТЧ.Количество; 	


КонецПроцедуры

&НаКлиенте
Процедура ДанныеСкидкаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Данные.ТекущиеДанные; 
	Если ТекущиеДанные = Неопределено Тогда
	
		Возврат; 	
	
	КонецЕсли;
	РассчитатьСуммуТаблицыДанных(ТекущиеДанные,Скидка,ДопСкидкаНаНакладную); 
КонецПроцедуры

&НаКлиенте
Процедура ВернутьВИсходноеСостояние(Команда)
	
	МассивОшибок.Очистить();
	ОбновитьЗаказНаСервере(истина);  	
	
	ДоступностьРедактированияЗаказа();
	
	ВывестиПодсказкиПредупреждения();
	ВывестиТекстОшибок();
	
	
	b2b_ОбменЗаявками.ОчиститьРегистрОбновленныеЗаказыПоЗаказу(Заказ);
	
	Дозаказ = b2b_ОбменЗаявками.НайтиДоЗаказпоОсновному(Заказ);
	Если ЗначениеЗаполнено(Дозаказ) Тогда
		
		b2b_ОбменЗаявками.ОчиститьРегистрОбновленныеЗаказыПоЗаказу(Дозаказ);	
		
	КонецЕсли;

КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ЗаблокироватьДокументыЗаказовДляРедактирования(ТолькоЗаказ = ложь, ТолькоДозаказ = Ложь)
	Если Не ТолькоДозаказ Тогда
		ЗаблокироватьДанныеДляРедактирования(Заказ,,ЭтаФорма.УникальныйИдентификатор);  //
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Дозаказ)
		 И Не ТолькоЗаказ Тогда
		ЗаблокироватьДанныеДляРедактирования(Дозаказ,,ЭтаФорма.УникальныйИдентификатор);//
	Конецесли; 
	
КонецПроцедуры // ЗаблокироватьДокументыЗаказовДляРедактирования()

&НаСервере
Процедура РазблокироватьДокументыЗаказовДляРедактирования(ТолькоЗаказ = ложь, ТолькоДозаказ = Ложь)
	Если Не ТолькоДозаказ Тогда
	
		РазблокироватьДанныеДляРедактирования(Заказ,ЭтаФорма.УникальныйИдентификатор);	
	
	КонецЕсли;
	 
	
	Если ЗначениеЗаполнено(Дозаказ)
		 И НЕ ТолькоЗаказ Тогда
		РазблокироватьДанныеДляРедактирования(Дозаказ,ЭтаФорма.УникальныйИдентификатор);
		
	Конецесли; 

КонецПроцедуры


// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ЗаполнитьАдресаДоставки()
	
	Элементы.ПунктДоставки.СписокВыбора.Очистить();
	
	СоответствиеЮрЛицаПунктыДоставки = Новый Структура("ЮрЛицаПунктыДоставки",новый Соответствие); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	b2b_ПунктыДоставкиДистрибьютора.ПунктДоставки КАК ПунктДоставки,
	|	b2b_ПунктыДоставкиДистрибьютора.Контрагент КАК Контрагент
	|ИЗ
	|	РегистрСведений.b2b_ПунктыДоставкиДистрибьютора КАК b2b_ПунктыДоставкиДистрибьютора";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ПунктДоставкиВыборка = неопределено; 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Элементы.ПунктДоставки.СписокВыбора.Добавить(ВыборкаДетальныеЗаписи.ПунктДоставки);
		
		ПунктДоставкиВыборка = ВыборкаДетальныеЗаписи.ПунктДоставки;
		
		Если СписокЮрЛицПоДозаказу.НайтиПоЗначению(ВыборкаДетальныеЗаписи.Контрагент) = Неопределено Тогда
		
			СписокЮрЛицПоДозаказу.Добавить(ВыборкаДетальныеЗаписи.Контрагент);
	
		
		КонецЕсли;
				
		МассивПунктовДоставки = СоответствиеЮрЛицаПунктыДоставки.ЮрЛицаПунктыДоставки.Получить(ВыборкаДетальныеЗаписи.Контрагент); 
		
		Если  МассивПунктовДоставки = Неопределено Тогда
			
			МассивПунктовДоставки = Новый Массив; 
			
		КонецЕсли;
		МассивПунктовДоставки.Добавить(ВыборкаДетальныеЗаписи.ПунктДоставки); 
		
		СоответствиеЮрЛицаПунктыДоставки.ЮрЛицаПунктыДоставки.Вставить(ВыборкаДетальныеЗаписи.Контрагент,МассивПунктовДоставки); 
		
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ПунктДоставки) Тогда
		
		Если Элементы.ПунктДоставки.СписокВыбора.НайтиПоЗначению(ПунктДоставки) = Неопределено Тогда
			
			Элементы.ПунктДоставки.СписокВыбора.Добавить(ПунктДоставки); 	
			
		КонецЕсли;
		
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЮрЛицоДозаказа) Тогда
		
		Если СписокЮрЛицПоДозаказу.НайтиПоЗначению(ЮрЛицоДозаказа) = неопределено  Тогда
			
			СписокЮрЛицПоДозаказу.Добавить(ЮрЛицоДозаказа);	
			
		КонецЕсли;
		
		
		
	КонецЕсли;
	
	
	ДанныеНастроек = b2b_ОбменЗаявками.ПолучитьПараметрыМетодаЗагрузкиПунктовДоставки();
	
	Если НЕ ЗначениеЗаполнено(ПунктДоставки)
		И НЕ ЗначениеЗаполнено(СостояниеДоЗаказа) Тогда  	
		
		Если ЗначениеЗаполнено(ДанныеНастроек.ПунктДоставкиПоУмолчанию) Тогда
			
			ПунктДоставки = ДанныеНастроек.ПунктДоставкиПоУмолчанию;
			
			Если Элементы.ПунктДоставки.СписокВыбора.НайтиПоЗначению(ПунктДоставки) = Неопределено Тогда
				
				Элементы.ПунктДоставки.СписокВыбора.Добавить(ПунктДоставки); 	
				
			КонецЕсли;
			
			
		ИначеЕсли  Элементы.ПунктДоставки.СписокВыбора.Количество() = 1 Тогда
			ПунктДоставки = ПунктДоставкиВыборка;
		КонецЕсли; 	
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЮрЛицоДозаказа)
		И НЕ ЗначениеЗаполнено(СостояниеДоЗаказа) Тогда
		
		
		Если ЗначениеЗаполнено(ДанныеНастроек.КонтрагентПоУмолчанию) Тогда
			
			ЮрЛицоДозаказа = ДанныеНастроек.КонтрагентПоУмолчанию;
			
			Если СписокЮрЛицПоДозаказу.НайтиПоЗначению(ЮрЛицоДозаказа) = неопределено  Тогда
				
				СписокЮрЛицПоДозаказу.Добавить(ЮрЛицоДозаказа);	
				
			КонецЕсли;
			
			
		ИначеЕсли  СписокЮрЛицПоДозаказу.Количество() = 1 Тогда
			
			ЮрЛицоДозаказа = СписокЮрЛицПоДозаказу[0].Значение;	
			
		КонецЕсли; 	
		
	КонецЕсли;
	
	
	
КонецПроцедуры // ЗаполнитьАдресаДоставки()

&НаКлиенте
Процедура ПунктДоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если СписокЮрЛицПоДозаказу.Количество() > 1  Тогда
	
		СтандартнаяОбработка = Ложь;
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыборЮрЛица",ЭтаФорма);
		
		ПараметрыОткрытия = Новый Структура; 
		ПараметрыОткрытия.Вставить("ВыборЮрЛица",Истина);
		ПараметрыОткрытия.Вставить("МассивКонтрагентов",СписокЮрЛицПоДозаказу.ВыгрузитьЗначения());
		
	    ОткрытьФорму("Обработка.b2b_АРМ_ОтработкаЗаказовССайта.Форма.ФормаВыбораДанныхДозаказа",ПараметрыОткрытия,ЭтаФорма,,,,ОповещениеОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		
	КонецЕсли;
	
	
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ВыборЮрЛица(ВыбранныйКонтрагент,ДополнительныеПараметры)Экспорт
	
	Если ВыбранныйКонтрагент <> неопределено  Тогда
		
		ЮрЛицоДозаказа = ВыбранныйКонтрагент;
		
		МассивАдресов = СоответствиеЮрЛицаПунктыДоставки.ЮрЛицаПунктыДоставки.Получить(ЮрЛицоДозаказа);
		
		Если МассивАдресов = неопределено Тогда 
			ПоказатьПредупреждение(,"Не найдено адресов по юр. лицу");
		ИначеЕсли МассивАдресов.Количество() = 1  Тогда
			
			ПунктДоставки = МассивАдресов[0];
			
			Модифицированность = истина;
			ИзмененияПоДозаказу = Истина;
			НадписьИзменений();
			
		ИначеЕсли МассивАдресов.Количество() = 0  Тогда
			
			ПоказатьПредупреждение(,"Не найдено адресов по юр. лицу"); 
		Иначе 
			ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыборПунктаДоставки",ЭтаФорма);
			
			ПараметрыОткрытия = Новый Структура; 
			ПараметрыОткрытия.Вставить("ВыборПунктаДоставки",Истина);
			ПараметрыОткрытия.Вставить("МассивПунктовДоставки",МассивАдресов);
			
			ОткрытьФорму("Обработка.b2b_АРМ_ОтработкаЗаказовССайта.Форма.ФормаВыбораДанныхДозаказа",ПараметрыОткрытия,ЭтаФорма,,,,ОповещениеОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
			
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ВыборПунктаДоставки(ВыбранныйАдрес,ДополнительныеПараметры) Экспорт

	 Если ВыбранныйАдрес <> Неопределено Тогда
	 
	 	 ПунктДоставки = ВыбранныйАдрес;
		 
		 Модифицированность = истина;
		 ИзмененияПоДозаказу = Истина;
		 НадписьИзменений();

	 
	 КонецЕсли;

КонецПроцедуры // ()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗакрытьФормуЗаказаb2b"
		И (Параметр = Заказ или Параметр  = Дозаказ) Тогда
	
		ПоказатьПредупреждение(,"Форма будет закрыта, необходимо обновление данных с сайта"); 	
	    Закрыть(); 
	КонецЕсли;
КонецПроцедуры



#КонецОбласти











