//СОБЫТИЯ ОБЪЕКТА
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения	=Модифицированность();
	НужноВыгружать	=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	
	Если НЕ ОбменДанными.Загрузка Тогда
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
		Если Отказ Тогда Возврат КонецЕсли;		
	КонецЕсли;
	
	Если ЕстьИзменения Тогда 
		СуммаДокумента		= Товары.Итог("Всего");
		ОбъемДокумента		= Товары.Итог("Объем");
		КоличествоДокумента = Товары.Итог("Количество");
				
		ГруппыТоваров   	= ГруппыТоваровДокумента(ЭтотОбъект);
	КонецЕсли; 
		
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	СостояниеНакладной	=Неопределено;
	Автор				=Неопределено;
	
	ДатаВыгрузки		=Неопределено;
	Валюта				=Неопределено;
	Курс				=Неопределено;	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)	
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	Если Основание=Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;
		
	ВидОснования	= Основание.Метаданные().Имя;		
	ДокОснование	= Основание;	
	Если ЕстьРеквизитДокумента("ИБ",Основание.Метаданные()) Тогда
		ИБ				= Основание.ИБ;		
	КонецЕсли;	
	
	Товары.Очистить();
	Для Каждого СтрокаОснования Из Основание.Товары Цикл
		Если СтрокаОснования.Количество>0 Тогда
			СтрокаТЧ=Товары.Добавить();				
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаОснования);
		КонецЕсли;	
	КонецЦикла; 
КонецПроцедуры

Процедура ПровестПоГТД(Записывать=Ложь) Экспорт
	Если НЕ СписыватьГТД Тогда
		Движения.ОстаткиГТД.Очистить();
		Если НЕ ГТД.Пустая() Тогда
			Для Каждого СтрокаТЧ Из Товары Цикл
				Движение=Движения.ОстаткиГТД.Добавить();			
				Движение.ВидДвижения=ВидДвиженияНакопления.Приход;
				Движение.Период=Дата;
				Движение.ГТД=ГТД;
				Движение.Количество=СтрокаТЧ.Количество;
				Движение.Номенклатура=СтрокаТЧ.Номенклатура;			
			КонецЦикла;		
		КонецЕсли; 
	Иначе		
		Запрос=Новый Запрос;
		Запрос.МенеджерВременныхТаблиц=Новый МенеджерВременныхТаблиц;
		
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Номенклатура КАК Модель,
		|	СУММА(Количество) КАК Количество
		|ПОМЕСТИТЬ ТЧ
		|ИЗ
		|	Документ.ТоварныйДокумент.Товары
		|ГДЕ
		|	Ссылка = &Ссылка
		|	И Номенклатура.ЭтоГруппа
		|СГРУППИРОВАТЬ ПО
		|	Номенклатура";
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Запрос.Выполнить();	
		
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Номенклатура КАК Модель,
		|	ГТД,
		|	КоличествоОстаток КАК Остаток 
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	РегистрНакопления.ОстаткиГТД.Остатки(&Дата1,ГТД<>&ПустаяГТД И Номенклатура В (ВЫБРАТЬ РАЗЛИЧНЫЕ МОДЕЛЬ ИЗ ТЧ))";
		
		Запрос.УстановитьПараметр("Дата1",Новый Граница(МоментВремени(),ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("ПустаяГТД",Справочники.ГТД.ПустаяСсылка());
		
		Запрос.Выполнить();
		
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Остатки.Модель,
		|	Остатки.ГТД КАК ГТД,
		|	Остатки.Остаток
		|ИЗ
		|	Остатки
		|ИТОГИ СУММА(Остаток) ПО Модель";
		
		Остатки=Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
		Для Каждого СтрокаТЧ  Из Товары Цикл		
			НадоСписать=СтрокаТЧ.Количество;
			СтрокаОстаткаПоМодели=Остатки.Строки.Найти(СтрокаТЧ.Номенклатура,"Модель",Ложь);
			
			Если СтрокаОстаткаПоМодели<>Неопределено Тогда
				Для Каждого СтрокаОстатка Из СтрокаОстаткаПоМодели.Строки Цикл
					Если НадоСписать>0 Тогда
						ТекКол=Макс(Мин(НадоСписать,СтрокаОстатка.Остаток),0);
						Если ТекКол>0 Тогда
							Движение=Движения.ОстаткиГТД.Добавить();		
							
							Движение.Период=Дата;
							Движение.ВидДвижения	=ВидДвиженияНакопления.Расход;
							
							Движение.Номенклатура	=СтрокаТЧ.Номенклатура;
							Движение.ГТД			=СтрокаОстатка.ГТД;
							
							Движение.Количество=ТекКол;
							
							НадоСписать=НадоСписать-ТекКол;						
						КонецЕсли; 
					Иначе 
						Прервать;					
					КонецЕсли;				
				КонецЦикла;
			КонецЕсли;		
			
			Если НадоСписать>0 Тогда
				Движение=Движения.ОстаткиГТД.Добавить();		
				
				Движение.Период=Дата;
				Движение.ВидДвижения	=ВидДвиженияНакопления.Расход;
				
				Движение.Номенклатура	=СтрокаТЧ.Номенклатура;
				Движение.ГТД			=Неопределено;
				
				Движение.Количество		=НадоСписать;			
			КонецЕсли; 
		КонецЦикла;	
	КонецЕсли; 
	Если Записывать Тогда
		Движения.ОстаткиГТД.Записать();	
	КонецЕсли;
КонецПроцедуры
 
Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	ПровестПоГТД();
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры
