Процедура ПередЗаписью(Отказ)
	ДополнительныеСвойства.Вставить("ОтключитьЖурнализациюЗаписи",Истина);
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;		
		
	ЕстьОшибкиПакета = Ложь;	
		
	Если Модифицированность() Тогда		
		Если НЕ ЗначениеЗаполнено(ВерсияДанных) Тогда
			Если НЕ ЗначениеЗаполнено(ИД_Пакета) Тогда
				ИД_Пакета=Новый УникальныйИдентификатор();				
			КонецЕсли;
			УстановитьСсылкуНового(Справочники.ФР_ПакетыДанных.ПолучитьСсылку(ИД_Пакета));
		КонецЕсли;
		
		КоличествоОшибокЗагрузки = ОшибкиПакета.Количество();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)		
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)	
	мПрефикс = "";
	Если ЗначениеЗаполнено(ПланОбмена) Тогда
		МетаОбъект = Метаданные.ПланыОбмена.Найти(ПланОбмена);
		Если МетаОбъект <> Неопределено Тогда
			мПрефикс = ОбщегоНазначения_ПИ.ЭтотУзелКод(ПланОбмена);
		Иначе                                          
			ТекстОшибки = СтрШаблон("Не найден план обмена: '%1' при записи пакета данных.", ПланОбмена);
			ЗаписатьВЛог("ОбменДанными", ТекстОшибки, "Ошибка");
			
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	Иначе   
		ТекстОшибки = СтрШаблон("Не найден план обмена: '%1' при записи пакета данных.", ПланОбмена);
		ЗаписатьВЛог("ОбменДанными", ТекстОшибки, "Ошибка");	
		
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Префикс = ?(ПустаяСтрока(мПрефикс), "ZZZ", мПрефикс) + "-";	
КонецПроцедуры //ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)

