#Область ПрограммныйИнтерфейс

// Рассчитывает минимальную премию за месяц для направлений продаж, где начисленная сумма меньше минимальной суммы премии.
//
// Параметры:
//   МесяцРасчетов - Дата - месяц, за который производится расчет
Процедура РассчитатьМинимальнуюПремиюЗаМесяц(МесяцРасчетов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МесяцРасчетов", МесяцРасчетов);
	Запрос.Текст = "ВЫБРАТЬ
	|	Док.Ссылка.ВидНачисления.НаправлениеПродаж КАК Направление,
	|	МАКСИМУМ(Док.Ссылка.ВидНачисления.НаправлениеПродаж.МинимальнаяСуммаПремии) КАК МинимальнаяСуммаПремии,
	|	СУММА(Док.Начислено) КАК Начислено
	|ПОМЕСТИТЬ НаправленияСМинимальнойПремией
	|ИЗ
	|	Документ.НачислениеПремииЗаВыполнениеПлана.РасчетПоМенеджеру КАК Док
	|ГДЕ
	|	Док.Ссылка.Проведен
	|	И Док.Ссылка.МесяцНачисления = &МесяцРасчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	Док.Ссылка.ВидНачисления.НаправлениеПродаж
	|
	|ИМЕЮЩИЕ
	|	СУММА(Док.Начислено) < МАКСИМУМ(Док.Ссылка.ВидНачисления.НаправлениеПродаж.МинимальнаяСуммаПремии)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаправленияСМинимальнойПремией.Направление КАК Направление,
	|	Док.Ссылка КАК Документ,
	|	Док.НомерСтроки КАК КоличествоСтрок,
	|	НаправленияСМинимальнойПремией.МинимальнаяСуммаПремии КАК МинимальнаяСуммаПремии
	|ИЗ
	|	НаправленияСМинимальнойПремией КАК НаправленияСМинимальнойПремией
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеПремииЗаВыполнениеПлана.РасчетПоМенеджеру КАК Док
	|		ПО НаправленияСМинимальнойПремией.Направление = Док.Ссылка.ВидНачисления.НаправлениеПродаж
	|			И (Док.Ссылка.Проведен)
	|			И (Док.Ссылка.МесяцНачисления = &МесяцРасчетов)
	|ИТОГИ
	|	КОЛИЧЕСТВО(КоличествоСтрок),
	|	МАКСИМУМ(МинимальнаяСуммаПремии)
	|ПО
	|	Направление,
	|	Документ";
	
	ВыборкаНаправления = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Направление");
	Пока ВыборкаНаправления.Следующий() Цикл
		РассчитатьМинимальнуюПремиюПоНаправлению(ВыборкаНаправления);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура РассчитатьМинимальнуюПремиюПоНаправлению(ВыборкаНаправления)
	
	НачатьТранзакцию();
	
	ДокОбъект = Неопределено;
	ОсталосьРаспределить = 0;
	МинимальнаяСуммаПремии = ВыборкаНаправления.МинимальнаяСуммаПремии;
	ОбщееКоличествоСтрок = ВыборкаНаправления.КоличествоСтрок;
	Если ОбщееКоличествоСтрок = 0 Или ОбщееКоличествоСтрок = Null Тогда
		Возврат;
	КонецЕсли;
	СуммаНаСтроку = Окр(МинимальнаяСуммаПремии / ОбщееКоличествоСтрок, 2);
	ОсталосьРаспределить = МинимальнаяСуммаПремии;
	
	ВыборкаДокументы = ВыборкаНаправления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Документ");
	Пока ВыборкаДокументы.Следующий() Цикл
		ДокОбъект = ВыборкаДокументы.Документ.ПолучитьОбъект();
		Для Каждого СтрТЧ Из ДокОбъект.РасчетПоМенеджеру Цикл
			СтрТЧ.ВидНачисленияПремии = Перечисления.ВидыНачисленияПремий.МинимальнаяПремия;
			СтрТЧ.Начислено = Мин(ОсталосьРаспределить, СуммаНаСтроку);
			ОсталосьРаспределить = ОсталосьРаспределить - СтрТЧ.Начислено;
			ОсталосьРаспределить = Макс(ОсталосьРаспределить, 0);
		КонецЦикла;
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОтменитьТранзакцию();
			ТекстСообщения = "Не удалось рассчитать минимальную премию " + ОписаниеОшибки();
			ВызватьИсключение ТекстСообщения;
		КонецПопытки;		
	КонецЦикла;
	Если ОсталосьРаспределить > 0 И ДокОбъект <> Неопределено Тогда
		ДокОбъект.РасчетПоМенеджеру[0].Начислено = ДокОбъект.РасчетПоМенеджеру[0].Начислено + ОсталосьРаспределить;
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОтменитьТранзакцию();
			ТекстСообщения = "Не удалось рассчитать минимальную премию " + ОписаниеОшибки();
			ВызватьИсключение ТекстСообщения;
		КонецПопытки;
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

#КонецОбласти