#Область ПрограммныйИнтерфейс

// Выполняет расчет всех данных (план, факт, премия) с использованием входящей структуры данных.
//
Процедура РассчитатьВсеДанные() Экспорт

	СтруктураВходящихДанных = Новый Структура("ТаблицаКритериев,МассивКонтрагентов,ТаблицаЭлементовНоменклатуры",
		Неопределено, Неопределено, Неопределено);

	ЗаполнитьДанныеСтруктураВходящихДанных(СтруктураВходящихДанных);
	Если Не ПланРассчитан Тогда
		РассчитатьПлан(СтруктураВходящихДанных);
	КонецЕсли;

	Если Не ФактРассчитан Тогда
		РассчитатьФакт(СтруктураВходящихДанных);
	КонецЕсли;

	Если Не ПремияРассчитана Тогда
		Если СтруктураВходящихДанных.ТаблицаКритериев.Количество() = 0 Тогда
			МинимальнаяПремия = 0;
		Иначе
			МинимальнаяПремия = СтруктураВходящихДанных.ТаблицаКритериев[0].МинимальнаяСуммаПремии;
		КонецЕсли;
		СтруктураВходящихДанных.Вставить("МинимальнаяПремия", МинимальнаяПремия);

		РассчитатьПремию(СтруктураВходящихДанных);
	КонецЕсли;

КонецПроцедуры

// Рассчитывает и заполняет план продаж по менеджерам
//
// Параметры:
//   СтруктураВходящихДанных - Структура:
//     * МассивКонтрагентов - Массив из СправочникСсылка.Контрагенты
//     * ТаблицаКритериев - ТаблицаЗначений:
//       ** КритерийНачисления - СправочникСсылка.Номенклатура
//     * ТаблицаЭлементовНоменклатуры - ТаблицаЗначений:
//       ** ЭлементНоменклатуры - СправочникСсылка.Номенклатура
//
Процедура РассчитатьПлан(СтруктураВходящихДанных) Экспорт      
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("МассивКонтрагентов", СтруктураВходящихДанных.МассивКонтрагентов);
	Запрос.УстановитьПараметр("МассивНоменклатуры", СтруктураВходящихДанных.ТаблицаКритериев.ВыгрузитьКолонку(
		"КритерийНачисления"));
	Запрос.УстановитьПараметр("МесяцНачисления", МесяцНачисления);
	Запрос.УстановитьПараметр("ТаблицаЭлементовНоменклатуры", СтруктураВходящихДанных.ТаблицаЭлементовНоменклатуры);
	Запрос.Текст = "ВЫБРАТЬ
				   |	ВременнаяТаблица.Критерий КАК Критерий,
				   |	ВременнаяТаблица.ЭлементНоменклатуры КАК ЭлементНоменклатуры
				   |ПОМЕСТИТЬ ТаблицаТоваров
				   |ИЗ
				   |	&ТаблицаЭлементовНоменклатуры КАК ВременнаяТаблица
				   |
				   |ИНДЕКСИРОВАТЬ ПО
				   |	ЭлементНоменклатуры
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	СУММА(ПланПродажОбороты.СуммаОборот) КАК План,
				   |	ПланПродажОбороты.Номенклатура КАК Номенклатура
				   |ПОМЕСТИТЬ ПланПродаж
				   |ИЗ
				   |	РегистрНакопления.ПланПродаж.Обороты(&МесяцНачисления, КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ), Месяц, Номенклатура
				   |		В ИЕРАРХИИ (&МассивНоменклатуры)
				   |		И Контрагент В (&МассивКонтрагентов)) КАК ПланПродажОбороты
				   |СГРУППИРОВАТЬ ПО
				   |	ПланПродажОбороты.Номенклатура
				   |
				   |ИНДЕКСИРОВАТЬ ПО
				   |	Номенклатура
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ТаблицаТоваров.Критерий КАК КритерийНачисления,
				   |	СУММА(ЕСТЬNULL(ПланПродаж.План,0)) КАК План
				   |ИЗ
				   |	ТаблицаТоваров КАК ТаблицаТоваров
				   |		ЛЕВОЕ СОЕДИНЕНИЕ ПланПродаж КАК ПланПродаж
				   |		ПО ПланПродаж.Номенклатура = ТаблицаТоваров.ЭлементНоменклатуры
				   |СГРУППИРОВАТЬ ПО
				   |	ТаблицаТоваров.Критерий";
	ТаблицаПланов = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТЧ Из РасчетПоМенеджеру Цикл

		СтрокаПланов = ТаблицаПланов.Найти(СтрокаТЧ.КритерийНачисления, "КритерийНачисления");
		Если СтрокаПланов <> Неопределено Тогда
			СтрокаТЧ.План = СтрокаПланов.План;
		Иначе
			СтрокаТЧ.План = 0;
		КонецЕсли;
	КонецЦикла;
	ПланРассчитан = Истина;       
	
КонецПроцедуры  

// Рассчитывает фактические продажи для строк таблицы расчета по менеджерам за указанный месяц.
//
// Параметры:
//   СтруктураВходящихДанных - Структура:
//     * МассивКонтрагентов - Массив из СправочникСсылка.Контрагенты - контрагенты для выборки
//     * ТаблицаКритериев - ТаблицаЗначений - содержит колонку КритерийНачисления
//     * ТаблицаЭлементовНоменклатуры - ТаблицаЗначений - таблица для соединения с продажами, содержит колонки Критерий, ЭлементНоменклатуры
//
Процедура РассчитатьФакт(СтруктураВходящихДанных) Экспорт     
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивКонтрагентов", СтруктураВходящихДанных.МассивКонтрагентов);
	Запрос.УстановитьПараметр("МассивНоменклатуры", СтруктураВходящихДанных.ТаблицаКритериев.ВыгрузитьКолонку(
		"КритерийНачисления"));
	Запрос.УстановитьПараметр("МесяцНачисления", МесяцНачисления);
	Запрос.УстановитьПараметр("ТаблицаЭлементовНоменклатуры", СтруктураВходящихДанных.ТаблицаЭлементовНоменклатуры);
	Запрос.Текст = "ВЫБРАТЬ
				   |	ВременнаяТаблица.Критерий КАК Критерий,
				   |	ВременнаяТаблица.ЭлементНоменклатуры КАК ЭлементНоменклатуры
				   |ПОМЕСТИТЬ ТаблицаТоваров
				   |ИЗ
				   |	&ТаблицаЭлементовНоменклатуры КАК ВременнаяТаблица
				   |
				   |ИНДЕКСИРОВАТЬ ПО
				   |	ЭлементНоменклатуры
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	СУММА(Продажи.ОборотОборот) КАК Факт,
				   |	Продажи.Номенклатура КАК Номенклатура
				   |ПОМЕСТИТЬ Продажи
				   |ИЗ
				   |	РегистрНакопления.Продажи.Обороты(&МесяцНачисления, КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ), Месяц, Номенклатура
				   |		В ИЕРАРХИИ (&МассивНоменклатуры)
				   |		И Покупатель В (&МассивКонтрагентов)) КАК Продажи
				   |СГРУППИРОВАТЬ ПО
				   |	Продажи.Номенклатура
				   |
				   |ИНДЕКСИРОВАТЬ ПО
				   |	Номенклатура
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ТаблицаТоваров.Критерий КАК КритерийНачисления,
				   |	СУММА(ЕСТЬNULL(Продажи.Факт, 0)) КАК Факт
				   |ИЗ
				   |	ТаблицаТоваров КАК ТаблицаТоваров
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Продажи КАК Продажи
				   |		ПО Продажи.Номенклатура = ТаблицаТоваров.ЭлементНоменклатуры
				   |СГРУППИРОВАТЬ ПО
				   |	ТаблицаТоваров.Критерий";
	ТаблицаПродаж = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТЧ Из РасчетПоМенеджеру Цикл

		СтрокаПродаж = ТаблицаПродаж.Найти(СтрокаТЧ.КритерийНачисления, "КритерийНачисления");
		Если СтрокаПродаж <> Неопределено Тогда
			СтрокаТЧ.Факт = СтрокаПродаж.Факт;
		Иначе
			СтрокаТЧ.Факт = 0;
		КонецЕсли;
	КонецЦикла;
	ФактРассчитан = Истина; 
	
КонецПроцедуры

// Рассчитывает премию менеджера.
//
// Параметры:
//   СтруктураВходящихДанных - Структура - структура, содержащая данные для расчета:
//     - ТаблицаКритериев - ТаблицаЗначений - таблица критериев начисления премии
//       - КритерийНачисления - СправочникСсылка.Номенклатура
//
Процедура РассчитатьПремию(СтруктураВходящихДанных) Экспорт    
	
	Для Каждого СтрокаТЧ Из РасчетПоМенеджеру Цикл
		СтрокаКритерия = СтруктураВходящихДанных.ТаблицаКритериев.Найти(СтрокаТЧ.КритерийНачисления,
			"КритерийНачисления");
		РасчетПремииПоСтроке(СтрокаТЧ, СтрокаКритерия);
	КонецЦикла;
	ПремияРассчитана = Истина;

КонецПроцедуры

// Заполняет критерии начисления номенклатурой из табличной части товаров элемента справочника РаспределениеСотрудниковПоНаправлениямПродаж, соответствующего текущему виду начисления.
//
Процедура ЗаполнитьКритерииПоНаправлению() Экспорт      
	
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	Спр.Номенклатура КАК КритерийНачисления
				   |ИЗ
				   |	Справочник.РаспределениеСотрудниковПоНаправлениямПродаж.Товары КАК Спр
				   |ГДЕ
				   |	Спр.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ВидНачисления);

	РасчетПоМенеджеру.Загрузить(Запрос.Выполнить().Выгрузить()); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
	
	Если Не ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если Не ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ТаблицаДвижений = СформироватьТаблицуДвижений();
	РегистрыНакопления.ПремииСотрудников.ВыполнитьДвижения(ЭтотОбъект, ТаблицаДвижений, Истина); 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)          
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность() Тогда
		ВсегоНачислено = РасчетПоМенеджеру.Итог("Начислено");
		ВсегоФакт = РасчетПоМенеджеру.Итог("Факт");
		ВсегоПлан = РасчетПоМенеджеру.Итог("План");
	КонецЕсли;           
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьДанныеСтруктураВходящихДанных(СтруктураВходящихДанных)              
	
	ЗаполнитьТаблицуКритериев(СтруктураВходящихДанных);
	ЗаполнитьМассивКонтрагентов(СтруктураВходящихДанных);
	Если Не ПланРассчитан Или Не ФактРассчитан Тогда
		РазвернутьТаблицуКритериевДоЭлементов(СтруктураВходящихДанных);
	КонецЕсли;      
	
КонецПроцедуры

Процедура РазвернутьТаблицуКритериевДоЭлементов(СтруктураВходящихДанных)         
	
	Запрос = Новый Запрос;
	Запрос.Текст = ОбщегоНазначенияС.ПолучитьТекстЗапросаТранзитивногоЗамыканияПоСправочнику("Номенклатура", 6);
	Запрос.Текст = Запрос.Текст + ";
							  |ВЫБРАТЬ 
							  | Т1.Предок КАК Критерий,
							  | Т1.Потомок КАК ЭлементНоменклатуры
							  |ИЗ ТаблицаДанных КАК Т1
							  |ГДЕ Т1.Предок В (&МассивНоменклатуры)
							  |И НЕ Т1.Потомок.ЭтоГруппа";
	Запрос.УстановитьПараметр("МассивНоменклатуры", СтруктураВходящихДанных.ТаблицаКритериев.ВыгрузитьКолонку(
		"КритерийНачисления"));
	СтруктураВходящихДанных.ТаблицаЭлементовНоменклатуры = Запрос.Выполнить().Выгрузить();   
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуКритериев(СтруктураВходящихДанных)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				   |	ПараметрыРасчётаПремии.Ссылка КАК Ссылка,
				   |	МАКСИМУМ(ПараметрыРасчётаПремии.Дата) КАК Дата
				   |ПОМЕСТИТЬ ПоледнийПоДатеДокумент
				   |ИЗ
				   |	Документ.ПараметрыРасчётаПремии КАК ПараметрыРасчётаПремии
				   |ГДЕ
				   |	ПараметрыРасчётаПремии.ВидНачисления = &ВидНачисления
				   |	И ПараметрыРасчётаПремии.ДатаНачалаДействия <= &МесяцНачисления
				   |	И ПараметрыРасчётаПремии.ДатаОкончанияДействия >= &МесяцНачисления
				   |	И ПараметрыРасчётаПремии.Проведен
				   |СГРУППИРОВАТЬ ПО
				   |	ПараметрыРасчётаПремии.Ссылка
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |	Дата УБЫВ
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ПараметрыРасчётаПремииПараметры.КритерийНачисления КАК КритерийНачисления,
				   |	ПараметрыРасчётаПремииПараметры.Ссылка.ВидНачисления.НаправлениеПродаж.МинимальнаяСуммаПремии КАК МинимальнаяСуммаПремии,
				   |	ПараметрыРасчётаПремииПараметры.МаксимальноОплачиваемыйПроцентВыполнения КАК
				   |		МаксимальноОплачиваемыйПроцентВыполнения,
				   |	ПараметрыРасчётаПремииПараметры.ПремияПриВыполненииСтаПроцентовПлана КАК ПремияПриВыполненииСтаПроцентовПлана
				   |ИЗ
				   |	Документ.ПараметрыРасчётаПремии.Параметры КАК ПараметрыРасчётаПремииПараметры
				   |		ЛЕВОЕ СОЕДИНЕНИЕ ПоледнийПоДатеДокумент КАК ПоледнийПоДатеДокумент
				   |		ПО ПоледнийПоДатеДокумент.Ссылка = ПараметрыРасчётаПремииПараметры.Ссылка";
	Запрос.УстановитьПараметр("ВидНачисления", ВидНачисления);
	Запрос.УстановитьПараметр("МесяцНачисления", МесяцНачисления);
	СтруктураВходящихДанных.ТаблицаКритериев = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

Процедура ЗаполнитьМассивКонтрагентов(СтруктураВходящихДанных)   
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	Спр.Контрагент КАК Контрагент
				   |ИЗ
				   |	Справочник.РаспределениеСотрудниковПоНаправлениямПродаж.Контрагенты КАК Спр
				   |ГДЕ
				   |	не Спр.Ссылка.ПометкаУдаления
				   |	И Спр.Ссылка.Ссылка = &ВидНачисления";
	Запрос.УстановитьПараметр("ВидНачисления", ВидНачисления);
	СтруктураВходящихДанных.МассивКонтрагентов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Контрагент");    
	
КонецПроцедуры

Процедура РасчетПремииПоСтроке(СтрокаТЧ, СтрокаКритерия)     
	
	Если СтрокаКритерия <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаКритерия);
	КонецЕсли;

	Если СтрокаТЧ.План = 0 Тогда
		СтрокаТЧ.ПроцентВыполнения = 0;
	Иначе
		СтрокаТЧ.ПроцентВыполнения = Окр(100 * СтрокаТЧ.Факт / СтрокаТЧ.План, 2);
	КонецЕсли;

	ПроцентДляРасчетов = Мин(СтрокаТЧ.ПроцентВыполнения, СтрокаТЧ.МаксимальноОплачиваемыйПроцентВыполнения);
	СтрокаТЧ.Начислено = СтрокаТЧ.ПремияПриВыполненииСтаПроцентовПлана * ПроцентДляРасчетов / 100;
	СтрокаТЧ.ВидНачисленияПремии = Перечисления.ВидыНачисленияПремий.ПремияЗаВыполнениеПлана;    
	
КонецПроцедуры

Функция СформироватьТаблицуДвижений() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	РаспределениеСотрудниковПоНаправлениямПродажСотрудники.Сотрудник КАК Сотрудник
				   |ПОМЕСТИТЬ Менеджеры
				   |ИЗ
				   |	Справочник.РаспределениеСотрудниковПоНаправлениямПродаж.Сотрудники КАК РаспределениеСотрудниковПоНаправлениямПродажСотрудники
				   |ГДЕ
				   |	РаспределениеСотрудниковПоНаправлениямПродажСотрудники.Ссылка = &ВидНачисления
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ТЗ.Менеджер КАК Сотрудник,
				   |	ТЗ.КритерийНачисления КАК КритерийНачисления,
				   |	&ВидНачисления КАК ВидНачисления,
				   |	ТЗ.План КАК План,
				   |	ТЗ.Факт КАК Факт,
				   |	ТЗ.Начислено КАК Начислено,
				   |	ТЗ.ВидНачисленияПремии КАК ВидНачисленияПремии
				   |ПОМЕСТИТЬ ВТ
				   |ИЗ
				   |	&РасчетПоМенеджеру КАК ТЗ
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ВТ.КритерийНачисления КАК КритерийНачисления,
				   |	СУММА(ВТ.План) КАК План,
				   |	СУММА(ВТ.Факт) КАК Факт,
				   |	СУММА(ВТ.Начислено) КАК Начислено,
				   |	ВТ.ВидНачисления КАК ВидНачисления,
				   |	ВТ.ВидНачисленияПремии КАК ВидНачисленияПремии,
				   |	&Дата КАК Период,
				   |	Менеджеры.Сотрудник КАК Сотрудник
				   |ИЗ
				   |	ВТ КАК ВТ,
				   |	Менеджеры КАК Менеджеры
				   |
				   |СГРУППИРОВАТЬ ПО
				   |	ВТ.КритерийНачисления,
				   |	ВТ.ВидНачисления,
				   |	ВТ.ВидНачисленияПремии,
				   |	Менеджеры.Сотрудник
				   |
				   |ИМЕЮЩИЕ
				   |	СУММА(ВТ.Начислено) > 0
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |	Сотрудник,
				   |	КритерийНачисления";
	Запрос.УстановитьПараметр("РасчетПоМенеджеру", РасчетПоМенеджеру);
	Запрос.УстановитьПараметр("ВидНачисления", ВидНачисления);
	Запрос.УстановитьПараметр("Дата", МесяцНачисления);

	Возврат Запрос.Выполнить().Выгрузить();  
	
КонецФункции

#КонецОбласти