Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)			
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения		=Модифицированность();
	НужноВыгружать		=Ложь;
		
	Если НЕ ОбменДанными.Загрузка Тогда		
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
		Если Отказ Тогда Возврат КонецЕсли; 	
	КонецЕсли;		

	Если Отказ Тогда Возврат КонецЕсли;
		
	Если ЕстьИзменения Тогда 
		ТипТовара			= Брэнд.Родитель;		
		КоличествоДокумента = Состав.Итог("Количество");
		ГруппыТоваров		= ГруппыТоваровДокумента(ЭтотОбъект,"Состав",?(Детальный,"Номенклатура","Модель"));
		
		Состав.Сортировать("ТипТовара,Брэнд,Модель,Номенклатура");
		
		НужноВыгружать		= Истина;
	Иначе
		Если (НЕ Ссылка.Проведен И РежимЗаписи=РежимЗаписиДокумента.Проведение) ИЛИ Ссылка.ПометкаУдаления<>ПометкаУдаления Тогда
			НужноВыгружать=Истина;			
		КонецЕсли;		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	ЗапросПоДням=Новый Запрос;
	ЗапросПоДням.Текст="
	|ВЫБРАТЬ
	|	КалендарьДни.Дата КАК Дата
	|ИЗ
	|	Справочник.Календарь.Дни КАК КалендарьДни
	|ГДЕ
	|	КалендарьДни.Ссылка.Период = &Период
	|	И КалендарьДни.Часы > 0
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Дата)
	|ПО ОБЩИЕ";
	
	ЗапросПоДням.УстановитьПараметр("Период",НачалоМесяца(Дата));
	РезультатПоДням	=ЗапросПоДням.Выполнить();
	
	ВсегоДней=0;
	
	ВыборкаПоДням	=РезультатПоДням.Выбрать();
	Пока ВыборкаПоДням.Следующий() Цикл
		Если ВыборкаПоДням.ТипЗаписи()=ТипЗаписиЗапроса.ОбщийИтог Тогда
			ВсегоДней=ВыборкаПоДням.Дата;			
		Иначе					
			Прервать;
		КонецЕсли;	
	КонецЦикла; 
	
	Если ВсегоДней=0 Тогда
		Сообщить("Не заполнен календарь на: " +ПредставлениеПериода(НачалоМесяца(Дата),КонецМесяца(Дата)),СтатусСообщения.Важное);					
		Отказ=Истина;
		Возврат;			
	КонецЕсли;
	
	ТР=Новый ТаблицаЗначений;
	ТР.Колонки.Добавить("ИтогоРасчКол");
	ТР.Колонки.Добавить("ИтогоФактКол");
	ТР.Колонки.Добавить("Отклонение");	
	
	Для Каждого СтрокаТЧ Из Состав Цикл
		ИтогоРасчКол=0;
		ИтогоФактКол=0;		
		
		ВыборкаПоДням=РезультатПоДням.Выбрать();			
		Пока ВыборкаПоДням.Следующий() Цикл
			Если ВыборкаПоДням.ТипЗаписи()=ТипЗаписиЗапроса.ОбщийИтог Тогда Продолжить КонецЕсли;
			
			Движение = Движения.ПланОтгрузок.Добавить();	
			
			Движение.Период			=ВыборкаПоДням.Дата;
			Движение.Номенклатура	=СтрокаТЧ.Номенклатура;
			Движение.Склад			=Склад;
			
			РасчКол					=СтрокаТЧ.Количество/ВсегоДней;			
			Движение.Количество		=РасчКол;
			
			ИтогоРасчКол			=ИтогоРасчКол+РасчКол;
			ИтогоФактКол			=ИтогоФактКол+Движение.Количество;
			
			Корректировка=Окр(ИтогоРасчКол-ИтогоФактКол,0,1);
			Если Корректировка<>0 Тогда
				Движение.Количество	=Движение.Количество+Корректировка;
				ИтогоФактКол		=ИтогоФактКол+Корректировка;					
			КонецЕсли;
			
			Если Движение.Количество=0 Тогда
				Движения.ПланОтгрузок.Удалить(Движение);				
			КонецЕсли; 
			
		КонецЦикла;		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		ИБ 		= Основание.ИБ;
		Склад 	= Основание.Склад;
		
		Для Каждого СтрокаИст Из Основание.Товары  Цикл
			Если СтрокаИст.Количество <> 0 Тогда
				ЗаполнитьЗначенияСвойств(Состав.Добавить(),СтрокаИст);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
