//Тимофеев Ю.А. 09.08.2023
//проверка на корректность введенного вручную электронного адреса
Функция ПроверкаЭлектронногоАдресаНаКорректность(АдресПочты)  Экспорт
	
	длинаПочты =СтрДлина(АдресПочты);
	
	Если длинаПочты<4 Тогда
		Сообщить("Некорректный адрес - подозрительно маленькая длина");
		Возврат Ложь; 		
	КонецЕсли;
	
	// Проверим наличие в адресе @
	ПозицияСобаки = Найти(АдресПочты, "@");
	
	Если Не ПозицияСобаки = 0 Тогда
		// и наличие точки после собаки
		Если Найти(Сред(АдресПочты, ПозицияСобаки + 1), ".") = 0 Тогда
			Сообщить("Некорректный адрес - нет точки");
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Сообщить("Некорректный адрес - нет @");
		Возврат Ложь;
	КонецЕсли;
	
	// Проверим адрес на допустимые символы
	ДопустимыеСимволы = "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЪЭЮЯ
	|ABCDEFGHIJKLMNOPQRSTUVWXYZ
	|0123456789
	|._-@";
	
	Позиция = 1; 	
	Пока Позиция <= длинаПочты Цикл 		
		ТекущийСимвол = ВРег(Сред(АдресПочты, Позиция, 1));		
		Если Найти(ДопустимыеСимволы, ТекущийСимвол) = 0 Тогда
			Сообщить("Некорректный адрес - содержит недопустимый символ "+ТекущийСимвол);
			Возврат Ложь;
		КонецЕсли;      		
		Позиция = Позиция + 1;  		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции
//Тимофеев Ю.А. 09.08.2023