
Процедура ПриКопировании(ОбъектКопирования)
	
	Автор = ПараметрыСеанса.Пользователь;
	ТоварнаяКатегория 			= ОбъектКопирования.ТоварнаяКатегория;
	ПодразделенияПродажи 		= ОбъектКопирования.ПодразделенияПродажи;
	ВидНоменклатуры				= ОбъектКопирования.ВидНоменклатуры;
	Брэнд 						= ОбъектКопирования.Брэнд;
	СырьеваяСоставляющая 		= ОбъектКопирования.СырьеваяСоставляющая;
	СсылкаНаПапкуАналитическихДанных 				= ОбъектКопирования.СсылкаНаПапкуАналитическихДанных;
	ПлановыйПериодПроведенияАссортиментногоКомитета = ОбъектКопирования.ПлановыйПериодПроведенияАссортиментногоКомитета;
	ПлановаяДатаПолученияОбразцов 					= ОбъектКопирования.ПлановаяДатаПолученияОбразцов;
	ПлановыйОбъем 				= ОбъектКопирования.ПлановыйОбъем;
	ПолоВозрастнойПризнак 		= ОбъектКопирования.ПолоВозрастнойПризнак;
	
	ТекущаяСтадияДокумента = 1;
	АссортиментныйКомитет.Очистить();
	ИсходникиФотоСессий.Очистить();
	Презентации.Очистить();
	МакетыУпаковки.Очистить();
	
КонецПроцедуры
