// Функция определяет необходимость выполнения замеров.
//
// Возвращаемое значение:
//  Булево - Истина выполнять, Ложь не выполнять.
//
Функция ВыполнятьЗамерыПроизводительности() Экспорт
	
	Возврат ПараметрыСеанса.ВыполнятьЗамерыПроизводительности;	
	
КонецФункции

Функция СмещениеОтСтандартногоВремени() Экспорт

	ЧасовойПоясСервера = ЧасовойПояс();
	ТекущаяДатаСервера = ТекущаяДата();
	ЧасовойПоясИнформационнойБазы = ПолучитьЧасовойПоясИнформационнойБазы(); // Europe/Moscow

	УниверсальнаяДата = УниверсальноеВремя(ТекущаяДатаСервера, ЧасовойПоясСервера);
	
	// Смещение времени в секундах между указанным часовым поясом и универсальным временем (UTC)
	Возврат СмещениеСтандартногоВремени(ЧасовойПоясИнформационнойБазы, УниверсальнаяДата);
КонецФункции //СмещениеОтСтандартногоВремени() Экспорт