&НаКлиенте
Процедура ДобавитьКоды(Команда)
	Коды = МаркировкаК.ВвестиКоды();
	ДобавитьКоды_НаСервере(Коды);
КонецПроцедуры

&НаСервере
Процедура ДобавитьКоды_НаСервере(Коды)
	МаркировкаС.ДобавитьКоды(Объект, Коды);	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтатусПоСтроке(Команда)
	ТекСтрока = Элементы.ШтрихкодыУпаковок.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		Колонка = "";		
		Если Элементы.ШтрихкодыУпаковок.ТекущийЭлемент.Имя = "ШтрихкодыУпаковокСтатусФакт" Тогда
			Колонка = "СтатусФакт";
		ИначеЕсли Элементы.ШтрихкодыУпаковок.ТекущийЭлемент.Имя = "ШтрихкодыУпаковокСтатусЧЗ" Тогда
			Колонка = "СтатусФакт";			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Колонка) Тогда
			Значение = МаркировкаКС.ПолучитьЗначениеПараметра(ТекСтрока, Колонка);			
			ЗаполнитьЗначенияКолонки_НаСервере(Колонка, Значение);			
		Иначе
			Сообщить(СтрШаблон("Недопустимая колонка : '%1' !", Колонка), СтатусСообщения.Важное);						
		КонецЕсли;
	Иначе
		Сообщить("Не выбрана строка документа !", СтатусСообщения.Важное);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияКолонки_НаСервере(Колонка, Значение)
	Для каждого СтрокаТЧ Из Объект.ШтрихкодыУпаковок Цикл
		Если СтрокаТЧ[Колонка] <> Значение Тогда
			СтрокаТЧ[Колонка] = Значение;		
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры