
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	рОбработки = ОбновитьСоставКоробок_НаСервере(ПараметрКоманды);
	Если НЕ рОбработки.Успешно Тогда
		МаркировкаКС.ВывестиОшибки(рОбработки);
	КонецЕсли;
	МаркировкаКС.ВывестиСообщения(рОбработки);
КонецПроцедуры

&НаСервере
Функция ОбновитьСоставКоробок_НаСервере(ДокСсылка)
	Результат = МаркировкаКС.СтруктураРезультата();
	Если НЕ ЗначениеЗаполнено(ДокСсылка) Тогда
		Результат.Ошибки.Добавить("Не выбран обрабатываемый документ !");
	Иначе
		ВидОперации = ПолучитьРеквизитШапки(ДокСсылка, "ВидОперации");
		Если ВидОперации <> Перечисления.ВидыОперацийМаркировки.Агрегация Тогда
			ТекстОшибки = СтрШаблон("Не допустимый вид операции документа: '%1', ожидаемый вид операции 'Агрегация' !", ВидОперации);
			Результат.Ошибки.Добавить(ТекстОшибки);					
		КонецЕсли;
	КонецЕсли;                                   
	
	Если Результат.Ошибки.Количество() = 0  Тогда
		рОбработки = Документы.МаркировкаТоваровИСМП.ПроверитьЗаполнитьСоставАгрегационныхКодов(ДокСсылка);			
		Если рОбработки.ОбработаноОбъектов > 0 Тогда
			Результат.Сообщения.Добавить(СтрШаблон("Обновлен состав у %1 коробок.", рОбработки.ОбработаноОбъектов));
		Иначе                                                                                     
			Результат.Сообщения.Добавить("Состав коробок соответствует содержимому документа агрегации.");
		КонецЕсли;
	Иначе
		Результат.Успешно = Ложь;
	КонецЕсли;                   
	
	Возврат Результат;	
КонецФункции //ОбновитьСоставКоробок_НаСервере(ДокСсылка)