
Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтоНовый()	и НЕ Обменданными.Загрузка тогда
		//УстановитьНомерДокумента(ЭтотОбъект);  //Мессерле 01,11,12
		ЭтотОбъект.УстановитьНовыйНомер(Сокрлп(параметрысеанса.ЭтотУзел.Подразделение.КодФизическогоУзла77));
	Конецесли;
	
	ЕстьИзменения		=Модифицированность();	
	НужноВыгружать		=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	Если НужноВыгружать Тогда
		Подразделения2="";
		для каждого стр из подразделения цикл
			Подразделения2=	Подразделения2+стр.подразделение+";";
		Конеццикла;
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;

КонецПроцедуры
