Процедура ПередЗаписью(Отказ, Замещение)
	НадоВыгружать = Ложь;
	Если ОбменДанными.Загрузка Тогда
		НадоВыгружать = Ложь;
	Иначе 
		НадоВыгружать = Истина;
	КонецЕсли;
	Если НадоВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	КонецЕсли;
	//Кухарь 21.12.16 начало
	//Перенёс всё в подписку
	////кухарь 20.10.14 начало
	////запись изменений  в регистр журнал изменений 	
	//СтароеЗначение=ПолучитьСтароеЗначение();
	//Для каждого стр из СтароеЗначение Цикл 
	//	ЗаписатьВЖурналИзмененийРеквизитов(стр.Документ,стр.ИмяРеквизита,стр.ЗначениеРеквизита,0,ОбменДанными,Истина);
	//КонецЦикла;
	//Для Каждого Запись Из ЭтотОбъект Цикл
	//	//кухарь 23.10.14 начало
	//	//ЗаписатьВЖурналИзмененийРеквизитов(Запись.Документ,запись.ИмяРеквизита,СтароеЗначение,Запись.ЗначениеРеквизита,ОбменДанными,ложь);
	//	ЗаписатьВЖурналИзмененийРеквизитов(Запись.Документ,запись.ИмяРеквизита,"",Запись.ЗначениеРеквизита,ОбменДанными,ложь);
	//	//кухарь 23.10.14 конец
	//КонецЦикла; 	
	////кухарь 20.10.14 конец
	//Кухарь 21.12.16 конец	
КонецПроцедуры
 	//Кухарь 21.12.16 начало
	//Перенёс всё в подписку
//кухарь 20.10.14 начало
//запись изменений  в регистр журнал изменений 

//Процедура ЗаписатьВЖурналИзмененийРеквизитов(Документ,ИмяРеквизита,СтароеЗначение,НовоеЗначение,ОбменДанными,ПерваяЗапись)
//	
//	если ПерваяЗапись Тогда 
//		Запись=РегистрыСведений.ЖурналИзмененийРеквизитов.СоздатьМенеджерЗаписи();
//		
//		Запись.Дата				=ТекущаяДата();
//		Запись.Документ			=Документ;
//		Запись.ТипДокумента		=Документ.метаданные().имя;
//		Запись.ИмяРеквизита		=ИмяРеквизита;
//		Запись.СтароеЗначение	=СтароеЗначение;
//		Запись.НовоеЗначение	=0;
//		Запись.Пользователь		=ПараметрыСеанса.Пользователь;
//		Если ОбменДанными.Загрузка Тогда
//			Запись.Отправитель		=ОбменДанными.Отправитель;		
//			Запись.НомерСообщения	=ПараметрыСеанса.НомерСообщения;
//		КонецЕсли;	
//		Запись.Записать();
//	иначе		
//		ДанныеВБазе=РегистрыСведений.ЖурналИзмененийРеквизитов.СоздатьНаборЗаписей();		
//		ДанныеВБазе.Отбор.Документ.Установить(Отбор.Документ.Значение);
//		ДанныеВБазе.Отбор.ИмяРеквизита.Установить(Отбор.ИмяРеквизита.Значение);	
//		ДанныеВБазе.Прочитать();
//		Для Каждого Запись Из ДанныеВБазе Цикл
//			СтароеЗначение=Запись.СтароеЗначение;
//		КонецЦикла;
//		//кухарь 23.10.14 начало 
//		если СтароеЗначение<>НовоеЗначение тогда
//			//кухарь 23.10.14 конец
//			Запись=РегистрыСведений.ЖурналИзмененийРеквизитов.СоздатьМенеджерЗаписи();		
//			Запись.Дата				=ТекущаяДата();
//			Запись.Документ			=Документ;
//			Запись.ТипДокумента		=Документ.метаданные().имя;
//			Запись.ИмяРеквизита		=ИмяРеквизита;
//			Запись.СтароеЗначение	=СтароеЗначение;
//			Запись.НовоеЗначение	=НовоеЗначение;
//			Запись.Пользователь		=ПараметрыСеанса.Пользователь;
//			Если ОбменДанными.Загрузка Тогда
//				Запись.Отправитель		=ОбменДанными.Отправитель;		
//				Запись.НомерСообщения	=ПараметрыСеанса.НомерСообщения;
//			КонецЕсли;	
//			Запись.Записать();
//			//кухарь 23.10.14 начало
//		КонецЕсли;
//		//кухарь 23.10.14 конец
//		
//	КонецЕсли;
//КонецПроцедуры 

//Функция ПолучитьСтароеЗначение()
//	ДанныеВБазе=РегистрыСведений.РеквизитыДокументов.СоздатьНаборЗаписей();
//	
//	ДанныеВБазе.Отбор.Документ.Установить(Отбор.Документ.Значение);
//	ДанныеВБазе.Отбор.ИмяРеквизита.Установить(Отбор.ИмяРеквизита.Значение);	
//	
//	ДанныеВБазе.Прочитать();
//	ТЗ=новый ТаблицаЗначений;
//	тз.колонки.Добавить("ЗначениеРеквизита");
//	тз.колонки.Добавить("Документ");
//	тз.колонки.Добавить("ИмяРеквизита");
//	Для Каждого Запись Из ДанныеВБазе Цикл
//		стр=тз.Добавить();
//		ЗаполнитьЗначенияСвойств(стр,Запись);
//	КонецЦикла;
//	возврат ТЗ;
//КонецФункции	
////кухарь 20.10.14 конец
	//Кухарь 21.12.16 конец