Процедура ОбработкаПроведения(Отказ, РежимПроведения)	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	Запрос=Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Ссылка КАК ОС
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ ЭтоГруппа
	|	И Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.ОсновноеСредство)";
	
	МассивОС=Новый Массив;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		МассивОС.Добавить(Выборка.ОС);	
	КонецЦикла; 
	
	Запрос.Текст="	
	|ВЫБРАТЬ 
	|	Склад,
	|	ОС,
	|	СУММА(Балансовая) КАК Балансовая,
	|	СУММА(Амортизация) КАК Амортизация,
	|	СУММА(Балансовая)-СУММА(Амортизация) КАК Остаточная	
	|ПОМЕСТИТЬ ОстаткиОС
	|ИЗ
	|(		
	|ВЫБРАТЬ
	|	Склад,
	|	Номенклатура КАК ОС,
	|	СуммаОстаток КАК Балансовая,
	|	0 КАК Амортизация	
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(&Дата1, Номенклатура В (&МассивОС))
	|ГДЕ
	|	НЕ Склад.НеНачислятьАмортизацию
	|ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ
	|	Склад,
	|	ОС,
	|	0,
	|   АмортизацияОстаток КАК Амортизация
	|ИЗ
	|	РегистрНакопления.Амортизация.Остатки(&Дата1)
	|) КАК Сводный
	|СГРУППИРОВАТЬ ПО 
	|	Склад,ОС";
			
	Запрос.УстановитьПараметр("Дата1",КонецМесяца(Дата));
	Запрос.УстановитьПараметр("МассивОС",МассивОС);
	Запрос.Выполнить();
	
	Запрос.Текст="
	|ВЫБРАТЬ	
	|	ОстаткиОС.Склад КАК Склад,
	|	ОстаткиОС.Склад.Подразделение КАК Подразделение,
	|	ОстаткиОС.ОС КАК ОС,
	|	ОстаткиОС.Балансовая КАК Балансовая,
	|	ОстаткиОС.Амортизация КАК Амортизация,
	|	ОстаткиОС.Остаточная КАК Остаточная,		
	|	СтатьяЗатрат,
	|	IsNull(НачислятьАмортизацию,Ложь)		КАК НачислятьАмортизацию,
	|	IsNull(НачислятьИзнос,Ложь)				КАК НачислятьИзнос,
	|	IsNull(Выбыло,Ложь)						КАК Выбыло,
	|	IsNull(СрокПолезногоИспользования,0)	КАК СрокПолезногоИспользования
	|ИЗ
	|	ОстаткиОС
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СостояниеОС.СрезПоследних(&Дата1) КАК СостояниеОС
	|ПО 
	|	ОстаткиОС.ОС=СостояниеОС.ОС";
	
	Выборка=Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		Если НЕ (Выборка.НачислятьАмортизацию ИЛИ Выборка.НачислятьИзнос) Тогда Продолжить КонецЕсли; 
		Если Выборка.Остаточная<=0 Тогда Продолжить КонецЕсли;
		Если Выборка.Выбыло Тогда Продолжить КонецЕсли;
		
		Если Выборка.СрокПолезногоИспользования=0 Тогда 
			Сообщить("По ОС: инв. №: """+Выборка.ОС.Код+""" не указан срок полезного использования !",СтатусСообщения.Важное);
			Продолжить; 
		КонецЕсли; 
		
		Если Выборка.НачислятьАмортизацию Тогда
			РасчетнаяАмортизация=Выборка.Балансовая/Выборка.СрокПолезногоИспользования		
		Иначе
			Если Месяц(Дата)=12 Тогда   //Износ начисляется раз в год
				РасчетнаяАмортизация=12*Выборка.Балансовая/Выборка.СрокПолезногоИспользования						
			Иначе
				РасчетнаяАмортизация=0;		
			КонецЕсли;		
		КонецЕсли; 
		
		РасчетнаяАмортизация=Мин(РасчетнаяАмортизация,Выборка.Остаточная);		
		Если РасчетнаяАмортизация>0 Тогда		
			Движение=Движения.Амортизация.Добавить();
			
			Движение.Период=Дата;
			Движение.ВидДвижения	=ВидДвиженияНакопления.Приход;
			
			Движение.Склад			=Выборка.Склад;
			Движение.ОС				=Выборка.ОС;
			
			Движение.Амортизация	=РасчетнаяАмортизация;
			Движение.Подразделение	=Выборка.Подразделение;
			Движение.СтатьяЗатрат	=Выборка.СтатьяЗатрат;
			
			//ЗАТАРАТЫ
			Движение=Движения.Затраты.Добавить();
			
			Движение.Период=Дата;
			Движение.ВидДвижения	=ВидДвиженияНакопления.Приход;
			
			Движение.Подразделение	=Выборка.Подразделение;
			Движение.СтатьяЗатрат	=Выборка.СтатьяЗатрат;		
			
			Движение.СуммаУпр		=РасчетнаяАмортизация;			
			
			Движение.СуммаДокумента	=РасчетнаяАмортизация;			
			Движение.ВалютаДокумента=ПараметрыСеанса.ВалютаУпр_2009;	
			Движение.ДатаЗаписи		=ТекущаяДата();
		КонецЕсли; 
	КонецЦикла;	
КонецПроцедуры
