Процедура ПередЗаписью(Отказ)
	ДополнительныеСвойства.Вставить("ОтключитьЖурнализациюЗаписи",Истина);
	Если НЕ ОбменДанными.Загрузка Тогда		
		Если Модифицированность() Тогда
			Если ЭтоНовый() Тогда
				ИД_Пакета=ПолучитьСсылкуНового().УникальныйИдентификатор();			
			КонецЕсли; 
			КоличествоОбъектов	= ОбработанныеОбъекты.Количество();
			ЕстьОшибки	= (ОшибкиОбмена.Количество()>0);
			Если НЕ ЕстьОшибки Тогда
				Для Каждого Строка Из ОбработанныеОбъекты Цикл
					Если НЕ ПустаяСтрока(Строка.Ошибки) Тогда
						ЕстьОшибки=Истина;
						Прервать;				
					КонецЕсли; 							
				КонецЦикла;			
			КонецЕсли;			 
		КонецЕсли;		
	КонецЕсли; 
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Пользователь	= ПараметрыСеанса.ТекущийПользователь;
	Дата			= ТекущаяДата();
КонецПроцедуры
