
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	//СписокВыбора.ПроизвольныйЗапрос = Истина;
	//СписокВыбора.ТекстЗапроса = ТекстЗапроса;
	//сообщить("СписокВыбора.ТекстЗапроса " + ТекстЗапроса);
	Параметры.ЗакрыватьПриВыборе = Истина;
	СписокВыбора.ТекстЗапроса = Параметры.ТекстЗапроса;
	СписокВыбора.ОсновнаяТаблица = Параметры.ОсновнаяТаблица;
	СписокВыбора.Порядок.Элементы.Очистить();
	ЭлементПорядкаСВ = СписокВыбора.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядкаСВ.Поле = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементПорядкаСВ.Использование = Истина;
	ЭлементПорядкаСВ.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	//Вставить содержимое обработчика
	//СписокВыбора.ПроизвольныйЗапрос = Истина;
	//СписокВыбора.ТекстЗапроса = ТекстЗапроса;
	//СписокВыбора.ОсновнаяТаблица = ОсновнаяТаблица;
	//СписокВыбора.Порядок.Элементы.Добавить("Ссылка").ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
	

	
	//сообщить("СписокВыбора.ТекстЗапроса " + ТекстЗапроса);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыбратьНаСервере()
	// Вставить содержимое обработчика.
	//ОповеститьОВыборе(Элементы.СписокВыбора.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)

	ОтветМ = Новый Массив;
	Если Элементы.СписокВыбора.ВыделенныеСтроки.Количество() Тогда
		Для Каждого ВыдСтр Из Элементы.СписокВыбора.ВыделенныеСтроки Цикл
			ТекСтр = Элементы.СписокВыбора.ДанныеСтроки(ВыдСтр);
			ОтветМ.Добавить(ТекСтр["Ссылка"]);
		КонецЦикла;
	КонецЕсли;
	ОповеститьОВыборе(ОтветМ);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	//ОповеститьОВыборе(Элементы.СписокВыбора.ТекущиеДанные.Ссылка);
	ОтветМ = Новый Массив;
	Если Элементы.СписокВыбора.ВыделенныеСтроки.Количество() Тогда
		Для Каждого ВыдСтр Из Элементы.СписокВыбора.ВыделенныеСтроки Цикл
			ТекСтр = Элементы.СписокВыбора.ДанныеСтроки(ВыдСтр);
			ОтветМ.Добавить(ТекСтр["Ссылка"]);
		КонецЦикла;
	КонецЕсли;
	ОповеститьОВыборе(ОтветМ);
КонецПроцедуры
