
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ТЗ=новый ТаблицаЗначений;
	тз.Колонки.Добавить("Номенклатура");
	для Каждого СтрКороба из КоробаКонтрагентов цикл
		ТекКороб=СтрКороба.Короб;
		для каждого СтрТовара из ТекКороб.Товары цикл
			СтрТз=тз.Добавить();
			СтрТз.Номенклатура=СтрТовара.Номенклатура;
		КонецЦикла;
	КонецЦикла;
	
	ТЗкопия=ТЗ.Скопировать();
	ТЗкопия.Свернуть("Номенклатура");
	если ТЗ.Количество()<>ТЗкопия.Количество() тогда
		Сообщить("Нельзя в одной матрице использовать короба с одинаковой номенклатурой!");
		отказ=Истина;
	КонецЕсли;	
КонецПроцедуры
