
Перем КритичОшибки Экспорт;

Перем ПрефиксУзлаCML;
Перем НачалоЭлементаCML;
Перем КонецЭлементаCML;
Перем ПрефиксАтрибутаCML;

Перем ПараметрЗапросаHTTP_Инициализация;
Перем ПараметрЗапросаHTTP_ПередачаФайла;
Перем ПараметрЗапросаHTTP_ИмпортФайлаСервером;
Перем ПараметрЗапросаHTTP_ПолучитьДанные; 
Перем ПараметрЗапросаHTTP_УспешноеЗавершениеИмпорта;

Перем ОтветСервера_ZIPРазрешен;
Перем ОтветСервера_ОграничениеРазмераФрагментаФайлаОбмена;
Перем ОтветСервера_УспешноеЗавершениеТекущейОперации;
Перем ОтветСервера_АварийноеЗавершениеТекущейОперации;
Перем ОтветСервера_ВыполнениеТекущейОперации;



Перем ПустаяХарактеристикаСсылка;

Перем НаименованиеНалога;

Перем БулевоЗначениеCML_Истина;
Перем БулевоЗначениеCML_Да;

Перем ТипНоменклатурыCML_Услуга;
Перем ТипНоменклатурыCML_Товар;
Перем ЗначениеCML_ТипНоменклатуры;

Перем мСоответствиеНаименованийКатегорийДокумента;
Перем мСтруктураИнформацииИсторииОбмена;

Перем мВидНоменклатурыУслуга;	
Перем мВидНоменклатурыТовар;
Перем мКоэффициентПересчетаВесаТоваровВГраммыДляОбменаССайтом;

Перем мМассивЗагруженныхДокументов;

Перем мТаблицаКаталогов;

Перем мДатаФормирования;


Перем мОрганизацияВладелец;

Перем мРезультатЗапросаИерархияНоменклатуры;
Перем мРезультатЗапросаСвойстваНоменклатуры;

Перем мКаталогНаДиске;
Перем мПодкаталогФайлов;
Перем мПодкаталогБезопасностиКаталогаВыгрузки;

Перем мУчетнаяПолитика;
Перем мПринудительнаяПолнаяВыгрузка;

Перем мМВТ;

Перем мЗапросПоКартинкам, мЗапросПоФайлам;
Перем мЗапросПоЗначениямСвойствХарактеристик;
Перем мЗапросПоСвойствамНоменклатуры;
Перем мЗапросПоЦенам;
Перем мЗапросПоСкидкам;
Перем мЗапросПоВремениДействияСкидок;
Перем мЗапросПоВариантамЗначенияСвойства;
Перем мЗапросПоШК;

Перем НастройкаОбмена;
Перем Рубли;


Перем ПРиКрОш;
Перем МассивОтклоненныхДокументов;

Перем ПризПервичнойСкидки10,ТзЦвет;

Перем мКаталогВременныхФайлов;

Перем мНомерВыгрузки;
ПЕрем тСписокЗаказовНаОтправку;
ПЕрем тСписокЗаказовНаОтправкуОтгрузки;


Перем ТЗФайловИМ, МассивЗнИм;
Перем НомерНастройки;




// Процедура устанавливает номер документа.
//
// Параметры:
//  ДокументОбъект  - ДокументОбъект. Экземпляр документа, которому 
//                    необходимо присвоить новый номер
//
Процедура УстановитьНомерДокумента2(ДокументОбъект) 
	// Если  нет реквизита "Организация" или для нее не задан префикс, то 
	// используем пустой префикс,
	// иначе используем префикс организации.
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	ДопБуква="";
	Если МетаданныеДокумента.Имя="РасходнаяНакладная" Тогда
		ДопБуква=?(ДокументОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН,"б","а");
	ИначеЕсли МетаданныеДокумента.Имя="ОтчетКассовойСмены" Тогда
		ДопБуква=?(ДокументОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН,"кб","кн");	
	КонецЕсли; 
	
	Вид=МетаданныеДокумента.Имя;
	Если Вид="ЛистНабора" Тогда
		ДокументОбъект.УстановитьНовыйНомер(СокрЛП(ДокументОбъект.ДокОснование.Номер)+"/");
	ИначеЕсли Вид="СчетФактура" Тогда 		
		Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
			Префикс=ПараметрыСеанса.ЭтотУзел.Код;
		Иначе
			ПрефиксКонтрагента="";
			
			Если ДокументОбъект.Накладные.Количество()>0 Тогда
				Накладная=ДокументОбъект.Накладные[0].Накладная;
				Если ЕстьРеквизитДокумента("ПунктДоставки",Накладная.Метаданные()) И ЗначениеЗаполнено(Накладная.ПунктДоставки.ПрефиксСФ) Тогда
					ПрефиксКонтрагента=СокрЛП(Накладная.ПунктДоставки.ПрефиксСФ);
				КонецЕсли;			
			КонецЕсли;			
			
			Если ПустаяСтрока(ПрефиксКонтрагента) Тогда
				ПрефиксКонтрагента=СокрЛП(ПолучитьРеквизитРодителя(ДокументОбъект.Контрагент,"ПрефиксСФ"));			
			КонецЕсли; 
			
			Если ПустаяСтрока(ПрефиксКонтрагента) Тогда
				ПрефиксСклада	=СокрЛП(ДокументОбъект.Склад.Префикс);
				ПрефиксИБ		=СокрЛП(ДокументОбъект.Склад.ПрефиксИБ);
				
				Если ПрефиксИБ="SNL" Тогда
					Префикс=ПрефиксИБ;
				Иначе
					Префикс=?(НЕ ПустаяСтрока(ДокументОбъект.Организация.Префикс),СокрЛП(ДокументОбъект.Организация.Префикс)+ПрефиксСклада,ДокументОбъект.ИБ.Код);				
				КонецЕсли;				
			Иначе				
				Префикс=?(НЕ ПустаяСтрока(ДокументОбъект.Организация.Префикс),СокрЛП(ДокументОбъект.Организация.Префикс)+ПрефиксКонтрагента,ДокументОбъект.ИБ.Код);			
			КонецЕсли;			
		КонецЕсли; 
		
		Если ПерваяСФ2(Префикс,ДокументОбъект.Дата) Тогда
			Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
				КоличествоПропусков=2;			
			ИначеЕсли Лев(Префикс,2)="КБ" Тогда
				КоличествоПропусков=4;
			Иначе	
				КоличествоПропусков=1;						
			КонецЕсли;			
		Иначе
			КоличествоПропусков=0;
		КонецЕсли;
		
		УстановитьНормальныйНовыйНомер2(ДокументОбъект,Префикс+"-",КоличествоПропусков);
	ИначеЕсли ЕстьРеквизитДокумента("ИБ",МетаданныеДокумента) Тогда
		ЭтотУзел=ПараметрыСеанса.ЭтотУзел;
		
		Если МетаданныеДокумента.Имя="РасходнаяНакладная" И СокрЛП(ДокументОбъект.Контрагент.Код)="SSP-8643" Тогда		
			КодИБ="SSP";
		Иначе
			Если ЕстьРеквизитДокумента("Склад",МетаданныеДокумента) Тогда
				ПрефиксИБ=ДокументОбъект.Склад.ПрефиксИБ;
			КонецЕсли;		
			Если ПустаяСтрока(ПрефиксИБ) Тогда
				ПрефиксИБ=ДокументОбъект.ИБ.Код;			
			КонецЕсли; 
			
			КодИБ=?(ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение,ПрефиксИБ,ЭтотУзел.Код);			
		КонецЕсли;		
		
		Если МетаданныеДокумента.Имя="ПриходнаяНакладная" И КодИБ="SSP" Тогда
			ДокументОбъект.УстановитьНовыйНомер(КодИБ+"-0");
		Иначе
			ДокументОбъект.УстановитьНовыйНомер(КодИБ+ДопБуква+"-");
		КонецЕсли;		
	ИначеЕсли Вид="УслугиСтороннихОрганизаций" Тогда
		Префикс=ДокументОбъект.Организация.Префикс+"-";
		ДокументОбъект.УстановитьНовыйНомер(Префикс);
	Иначе		
		КодИБ=ПараметрыСеанса.ЭтотУзел.Код;
		
		ДокументОбъект.УстановитьНовыйНомер(КодИБ+"-");		
	КонецЕсли;	
КонецПроцедуры // УстановитьНомерДокумента()

//  Процедура определяет ситуацию, когда при изменении своей даты документ 
//  оказывается в другом периоде нумерации документов, и в это м случае
//  присваивает документу новый уникальный номер.
//
// Параметры:
//  ДокументОбъект         - контекст документа,из которого вызвана процедура 
//  НачальнаяДатаДокумента - начальная дата документа 
// 
Функция ПроверитьНомерДокумента2(ДокументОбъект, НачальнаяДатаДокумента,Предупреждать=Истина)   // в разработке
	
	// Определяем назначенную для данного вида документов периодичность смены номера
	ПериодСменыНомера = ДокументОбъект.Метаданные().ПериодичностьНомера;
	
	//В зависимости от установленной периодичности смены номеров,
	//определяем разность старой и новой датами документа.
	РазностьДат=0;
	
	Если ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Год Тогда
		РазностьДат = НачалоГода(НачальнаяДатаДокумента) - НачалоГода(ДокументОбъект.Дата);
		
	ИначеЕсли ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Квартал Тогда
		РазностьДат = НачалоКвартала(НачальнаяДатаДокумента) - НачалоКвартала(ДокументОбъект.Дата);
		
	ИначеЕсли ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Месяц Тогда
		РазностьДат = НачалоМесяца(НачальнаяДатаДокумента) - НачалоМесяца(ДокументОбъект.Дата);
		
	ИначеЕсли ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.День Тогда
		РазностьДат = НачальнаяДатаДокумента - ДокументОбъект.Дата; 
	КонецЕсли;
	
	Если РазностьДат <> 0 Тогда
		Если Предупреждать Тогда
			//Ответ=Вопрос("Изменена дата документа ! Номер документа будет изменен ! Продолжать ?",РежимДиалогаВопрос.ДаНет);
			//Если Ответ<>КодВозвратаДиалога.Да Тогда
			//	Возврат Ложь;			
			//КонецЕсли;
		КонецЕсли;		
		УстановитьНомерДокумента2(ДокументОбъект);
	КонецЕсли;
	
	Возврат Истина;
КонецФункции// ПроверитьНомерДокумента()

Функция КоличествоПД2(Контрагент) Экспорт
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ссылка) КАК Количество
		|ИЗ
		|	Справочник.ПунктыДоставки КАК ПунктыДоставки
		|ГДЕ
		|	Владелец = &Владелец";
		
		Запрос.УстановитьПараметр("Владелец",Контрагент);
		
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Количество;			
		КонецЕсли;		
	КонецЕсли;
	
	Возврат 0;
КонецФункции //КоличествоПД(Контрагент)

Процедура УстановитьДоговорСб2б(ДокументОбъект,ИмяРеквизитаКонтрагент="Контрагент",ИмяРеквизитаДоговор="Договор") Экспорт
	Контрагент	=ДокументОбъект[ИмяРеквизитаКонтрагент];
	Договор		=ДокументОбъект[ИмяРеквизитаДоговор];
	Организация	=ДокументОбъект.Организация;
	
	КодЦБ=?(ПустаяСтрока(Контрагент.КодЦБ),Контрагент.Код,Контрагент.КодЦБ);
	
	//По просьбе Ярослава, задача № 0000000468 
	//Если НЕ(Договор.Пустая()) Тогда
	//	Если СокрЛП(Договор.КодЦБ)=СокрЛП(КодЦБ) Тогда
	//		Возврат;
	//	КонецЕсли; 		
	//КонецЕсли;
	
	ДокументОбъект[ИмяРеквизитаДоговор]=Неопределено;
	
	Если Контрагент.Пустая() Тогда Возврат КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Контрагент.ОсновнойДоговор) Тогда
		Договора=ПолучитьДоговорыКонтрагентаСб2б(Контрагент,Организация);
	Иначе
		Договора=Новый Массив;	
		Договора.Добавить(Контрагент.ОсновнойДоговор);
	КонецЕсли;	
	
	//Нечаева// 
	Если Договора.ВГраница()<0 Тогда
		//Предупреждение("Невозможно определить договор контрагента !");
	ИначеЕсли Договора.ВГраница()=0 Тогда
		ДокументОбъект[ИмяРеквизитаДоговор]=Договора[0];			
	Иначе
		#Если клиент тогда
		сообщить("У контрагента: """+Контрагент+""" заключено несколько договоров с организацией """+Организация+""" !"+Символы.ПС+
		"Основной договор для данного контрагента не указан !"+Символы.ПС+
		"Требуется вручную выбрать необходимый договор !");
		записатьвлог("b2b",""+Контрагент+" заключено несколько договоров с организацией "+Организация+"! Основной договор для данного контрагента не указан !Требуется вручную выбрать необходимый договор !",,,,);
		#конецЕсли
	КонецЕсли;	

КонецПроцедуры

Процедура УстановитьПунктДоставкиСб2б(ДокументОбъект,ИмяРеквизитаКонтрагент="Контрагент",ИмяРеквизитаПД="ПунктДоставки") 	Экспорт
	Контрагент		=ДокументОбъект[ИмяРеквизитаКонтрагент];
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Если ЕстьРеквизитДокумента("ОсновнойПунктДоставки",Контрагент.Метаданные()) И ЗначениеЗаполнено(Контрагент.ОсновнойПунктДоставки) Тогда
			ДокументОбъект[ИмяРеквизитаПД]=Контрагент.ОсновнойПунктДоставки;	
		ИначеЕсли КоличествоПД2(Контрагент)=1 Тогда		
			Выборка=Справочники.ПунктыДоставки.Выбрать(,Контрагент);
			Пока Выборка.Следующий() Цикл
				ДокументОбъект[ИмяРеквизитаПД]=Выборка.Ссылка;			
			КонецЦикла;
			//крохин начало
			//для складов, если несколько ПД, выбираем первый
		ИначеЕсли ИмяРеквизитаКонтрагент = "СкладПолучатель" Тогда
			//крохин начало 28.07.2011
			//выбираем первый по наименованию
			//Выборка=Справочники.ПунктыДоставки.Выбрать(,Контрагент);
			Выборка=Справочники.ПунктыДоставки.Выбрать(,Контрагент,,"Наименование Убыв");
			//крохин конец 28.07.2011
			Пока Выборка.Следующий() Цикл
				ДокументОбъект[ИмяРеквизитаПД]=Выборка.Ссылка;			
			КонецЦикла;
			//крохин конец
		Иначе
			ДокументОбъект[ИмяРеквизитаПД]=Неопределено;		
		КонецЕсли;		
	Иначе
		ДокументОбъект[ИмяРеквизитаПД]=Неопределено;		
	КонецЕсли;	
КонецПроцедуры//УстановитьПунктДоставки(ДокументОбъект,ИмяРеквизитаКонтрагент="Контрагент")

Функция ПолучитьДоговорыКонтрагентаСб2б(Контрагент,Организация=Неопределено)  Экспорт
	МассивДоговоров=Новый Массив;
	
	КодЦБ=?(ПустаяСтрока(Контрагент.КодЦБ),Контрагент.Код,Контрагент.КодЦБ);
	
	Выборка=Справочники.Договоры.Выбрать(,,Новый Структура("КодЦБ",КодЦБ));
	Пока Выборка.Следующий() Цикл
		//Если задана организация то договора с другой организацией пропускаем
		//	Если Организация<>Неопределено И НЕ Организация.Пустая() И Выборка.Организация<>Организация Тогда Продолжить КонецЕсли; 	
		
		
		МассивДоговоров.Добавить(Выборка.Ссылка);
	КонецЦикла; 
	
	Возврат МассивДоговоров;
КонецФункции // ПолучитьДОговорыКорагента()




Функция ПерваяСФ2(Префикс,Дата) 
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ
	|	Документ.СчетФактура КАК СчетФактура
	|ГДЕ
	|	Дата МЕЖДУ &Дата1 И &Дата2
	|	И Номер ПОДОБНО &Номер
	|	И НЕ ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Дата));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата));
	Запрос.УстановитьПараметр("Номер",Префикс+"%");		
	
	Возврат Запрос.Выполнить().Пустой();
КонецФункции //ПерваяСФ(Префикс,Дата)

// Процедура устанавливает номер документа.
//
// Параметры:
//  ДокументОбъект  - ДокументОбъект. Экземпляр документа, которому 
//                    необходимо присвоить новый номер
//
Функция УстановитьНормальныйНовыйНомер2(ДокументОбъект,Префикс,КоличествоПропусков=0) 
	МетаДок=ДокументОбъект.Метаданные();	
	Периодичность=МетаДок.ПериодичностьНомера;
	ДлинаЧисловойЧасти=МетаДок.ДлинаНомера-СтрДлина(СокрЛП(Префикс));;
	
	Если МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Год Тогда
		Дата1=НачалоГода(ДокументОбъект.Дата);	
		Дата2=КонецГода(ДокументОбъект.Дата);	
	ИначеЕсли МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Квартал Тогда
		Дата1=НачалоКвартала(ДокументОбъект.Дата);	
		Дата2=КонецКвартала(ДокументОбъект.Дата);					
	ИначеЕсли МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Месяц Тогда
		Дата1=НачалоМесяца(ДокументОбъект.Дата);	
		Дата2=КонецМесяца(ДокументОбъект.Дата);					
	ИначеЕсли МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.День Тогда
		Дата1=НачалоДня(ДокументОбъект.Дата);	
		Дата2=КонецДня(ДокументОбъект.Дата);
	Иначе
		Дата1=Неопределено;		
		Дата2=Неопределено;
	КонецЕсли;
	
	Шаблон=СокрЛП(Префикс);
	Для Сч=1 По ДлинаЧисловойЧасти Цикл
		Шаблон=Шаблон+"[0-9]";	
	КонецЦикла;
	Запрос=Новый Запрос;
	
	Запрос.Текст="
	|ВЫБРАТЬ
	|	МАКСИМУМ(Номер) КАК Номер
	|ИЗ
	|	Документ."+МетаДок.Имя+"
	|ГДЕ
	|	"+?(Дата1=Неопределено,"","Дата МЕЖДУ &Дата1 И &Дата2 И ")+"
	|	Номер ПОДОБНО &Шаблон";
	
	Запрос.УстановитьПараметр("Шаблон",Шаблон);
	
	Если Дата1<>Неопределено Тогда
		Запрос.УстановитьПараметр("Дата1",Дата1);
		Запрос.УстановитьПараметр("Дата2",Дата2);
	КонецЕсли;
	
	НомерДока		=Неопределено;
	ПоследнийНомер =0;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.Номер) Тогда
			НомерДока		=Выборка.Номер;
			ПоследнийНомер	=Число(СтрЗаменить(Выборка.Номер,СокрЛП(Префикс),""));
		КонецЕсли;		
	КонецЕсли;	
	
	Коэффициент=1;
	Если НомерДока<>Неопределено Тогда	
		ПоследнийДок=Документы[МетаДок.Имя].НайтиПоНомеру(НомерДока,ДокументОбъект.Дата);
		Если ПоследнийДок<>Неопределено Тогда
			Коэффициент=Цел(Макс(1,(КонецДня(ДокументОбъект.Дата)-КонецДня(ПоследнийДок.Дата))/(24*60*60)));
		КонецЕсли;
	КонецЕсли;
	
	ДокументОбъект.Номер=СокрЛП(Префикс)+Формат(ПоследнийНомер+1+КоличествоПропусков*Коэффициент,"ЧЦ="+ДлинаЧисловойЧасти+"; ЧВН=");
КонецФункции //УстановитьНормальныйНовыйНомер(ДокументОбъект,Префикс,КоличествоПропусков=0)


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ CML ИЗ СПИСКА ЗНАЧЕНИЙ

Процедура ЗаписатьCMLПоСпискуЗначений(ОбъектCML, СписокЗначений);
	
	Для Каждого Элемент Из СписокЗначений Цикл
		Если Элемент.Представление = КонецЭлементаCML Тогда
			ОбъектCML.ЗаписатьКонецЭлемента();
		ИначеЕсли Элемент.Представление = НачалоЭлементаCML Тогда	
			ОбъектCML.ЗаписатьНачалоЭлемента(Элемент.Значение);
		ИначеЕсли Элемент.Представление = "" Тогда
			ОбъектCML.ЗаписатьТекст(Элемент.Значение);
		ИначеЕсли Найти(Элемент.Представление, ПрефиксУзлаCML) > 0 Тогда
			ИмяУзла = СтрЗаменить(Элемент.Представление, ПрефиксУзлаCML, "");
			ЗаписатьТекстовойУзел(ОбъектCML, ИмяУзла, Элемент.Значение);	
		ИначеЕсли Найти(Элемент.Представление, ПрефиксАтрибутаCML) > 0 Тогда
			ИмяАтрибута = СтрЗаменить(Элемент.Представление, ПрефиксАтрибутаCML, "");
			ОбъектCML.ЗаписатьАтрибут(ИмяАтрибута, Элемент.Значение);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ДобавитьУзелCML(СписокЗначений, НаименованиеУзла, Значение);
	СписокЗначений.Добавить(Значение, ПрефиксУзлаCML + НаименованиеУзла);
КонецПроцедуры	

Процедура ДобавитьАтрибутCML(СписокЗначений, НаименованиеАтрибута, Значение)
	СписокЗначений.Добавить(Значение, ПрефиксАтрибутаCML + НаименованиеАтрибута);
КонецПроцедуры	

Процедура ДобавитьТекстCML(СписокЗначений, Значение)
	СписокЗначений.Добавить(Значение, "");
КонецПроцедуры	

Процедура ДобавитьНачалоЭлементаCML(СписокЗначений, НаименованиеЭлемента);
	СписокЗначений.Добавить(НаименованиеЭлемента, НачалоЭлементаCML); 
КонецПроцедуры	

Процедура ДобавитьКонецЭлементаCML(СписокЗначений);
	СписокЗначений.Добавить("", КонецЭлементаCML); 
КонецПроцедуры	

Процедура ЗаполнитьСписокЗначенийОсновныхРеквизитовТовара(СписокЗначенийCML, Товар)
	
	//++-++ - свойства товара заполнять для файла номенклатуры тут.
	
	ИдТовара = Товар.Код;
	
	ДобавитьУзелCML(СписокЗначенийCML, "Ид"				   , ИдТовара); 
	ДобавитьУзелCML(СписокЗначенийCML, "Штрихкод"		   , ""); //Товар.Штрихкод
	ДобавитьУзелCML(СписокЗначенийCML, "Артикул"		   , ""); //Товар.НоменклатураСсылка.Артикул
	ДобавитьУзелCML(СписокЗначенийCML, "Наименование"	   , ФорматНаименованияДляCML(Товар.Ссылка.Наименование));
	
	//ЭлементТов=ДокументДом.СоздатьЭлемент("БазоваяЕдиница");
	//		ТекУзелТов=ТекУзел2Т.ДобавитьДочерний(ЭлементТов);
	//		ЭлементТов.УстановитьАтрибут("Код","796");
	//		ЭлементТов.УстановитьАтрибут("НаименованиеПолное","Штука");
	//		текстДом=ДокументДом.СоздатьТекстовыйУзел("Штука");
	//		ТекУзелТов.ДобавитьДочерний(ТекстДом);
	
	
	ДобавитьНачалоЭлементаCML(СписокЗначенийCML, "БазоваяЕдиница");	
	
	ДобавитьАтрибутCML(СписокЗначенийCML, "Код"					   , "796");
	ДобавитьАтрибутCML(СписокЗначенийCML, "НаименованиеПолное"	   , "Штука");
	
	ДобавитьТекстCML(СписокЗначенийCML, "Штука");
	ДобавитьКонецЭлементаCML(СписокЗначенийCML);	
	
КонецПроцедуры

Функция ПолучитьСтрокуЗаписиДляXML(Значение)
	//преобразует в строку
	СтрокаЗаписи = Строка(Значение);
	
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		
		СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, Символы.НПП, "");
		СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, ",", ".");
		
	ИначеЕсли ТипЗнч(Значение) = Тип("Булево") Тогда
		
		Если Значение Тогда
			СтрокаЗаписи = "true";
		Иначе
			СтрокаЗаписи = "false";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтрокаЗаписи;
	
КонецФункции

Процедура ЗаписатьТекстовойУзел(ОбъектXML, Имя, Значение, ОбязательнаяПроверкаНаПустуюСтроку = Истина)
	
	СтрокаЗаписи = ПолучитьСтрокуЗаписиДляXML(Значение);
	
	Если ОбязательнаяПроверкаНаПустуюСтроку
		И НЕ ЗначениеЗаполнено(СтрокаЗаписи) Тогда
		
		Возврат;		
		
	КонецЕсли;	
	
	ОбъектXML.ЗаписатьНачалоЭлемента(Имя);
	ОбъектXML.ЗаписатьТекст(СтрокаЗаписи);
	ОбъектXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Функция ФорматКомментарияДляCML(Комментарий)
	Возврат Лев(Комментарий, 3000);
КонецФункции	

Функция ФорматНаименованияДляCML(Наименование)
	Возврат Лев(Наименование, 250);
КонецФункции	

Процедура ЗаписатьАтрибутВXML(ОбъектЗаписи, ИмяАтрибута, ЗначениеАтрибута)
	
	СтрокаЗаписи = ПолучитьСтрокуЗаписиДляXML(ЗначениеАтрибута);
	
	ОбъектЗаписи.ЗаписатьАтрибут(ИмяАтрибута, СтрокаЗаписи);	
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРА ВЫГРУЗКИ ДАННЫХ

Функция СформироватьУникальныйИдентификаторОбъекта(Объект, Характеристика = Неопределено)
	
	Ид = Строка(Объект.УникальныйИдентификатор());
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.Номенклатура")
		И (НЕ Объект.ЭтоГруппа)
		И Объект.ВестиУчетПоХарактеристикам
		И ЗначениеЗаполнено(Характеристика) Тогда
		
		Ид = Ид + "#" + Строка(Характеристика.УникальныйИдентификатор());
		
	КонецЕсли;	
	
	Возврат Ид;
	
КонецФункции

///////////////////////////////////////////////////////////////////

Функция ПолучитьОбъектДляЗаписиXML(ИмяФайла, ДатаФормирования)
	
	ЗаписьXML = Новый ЗаписьXML;
	
	Если ПустаяСтрока(ИмяФайла) Тогда
		ЗаписьXML.УстановитьСтроку("UTF-8");
	Иначе
		ЗаписьXML.ОткрытьФайл(ИмяФайла, "UTF-8"); 
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("КоммерческаяИнформация");
	//	ЗаписьXML.ЗаписатьАтрибут("ВерсияСхемы", "2.04");
	ЗаписьXML.ЗаписатьАтрибут("ДатаФормирования", Формат(ДатаФормирования, "ДФ=yyyy-MM-dd'T'ЧЧ:мм:сс"));	
	
	ЗаписьXML.ЗаписатьАтрибут("ВерсияСхемы","2.04.1CBitrix");
	ЗаписьXML.ЗаписатьАтрибут("ФорматДаты","ДФ=dd.MM.yyyy; ДЛФ=D");
	ЗаписьXML.ЗаписатьАтрибут("ФорматВремени","ДФ=ЧЧ:мм:сс; ДЛФ=T");
	ЗаписьXML.ЗаписатьАтрибут("РазделительДатаВремя","T");
	ЗаписьXML.ЗаписатьАтрибут("ФорматСуммы","ЧЦ=18; ЧДЦ=2; ЧРД=,; ЧГ=""");
	ЗаписьXML.ЗаписатьАтрибут("ФорматКоличества","ЧЦ=18; ЧДЦ=2; ЧРД=,; ЧГ=""");
	//	ЗаписьXML.ЗаписатьАтрибут("ДатаФормирования",ПараметрЗаголовка);
	
	
	Возврат ЗаписьXML;
	
КонецФункции




///////////////////////////////////////////////////////////////////////////////////////-------------------------------------------------------------------------------


Функция HTTPВыгрузитьНаСервер(СтруктураПараметровСайта, МассивПодкаталогов = Неопределено, ОжидатьЗавершенияИмпортаФайловСервером = Ложь,ТипСоединения = "catalog")
	
	
	Успешно    = Истина;
	
	ОтветСервера = "";
	Соединение = Неопределено;
	
	АдресДляРаботы = СтруктураПараметровСайта.АдресСкрипта + "?type=" + ТипСоединения; 
	
	СтрокаСообщенияПользователю = "";
	Успешно = ПроцедурыОбменаССайтом.HTTPВыполнитьАвторизациюДляСоединения(Соединение, СтруктураПараметровСайта, ОтветСервера, СтрокаСообщенияПользователю, ТипСоединения);
	Если Не ПустаяСтрока(СтрокаСообщенияПользователю) Тогда
		
		СообщитьОбОшибкеОбмена(СтрокаСообщенияПользователю, Истина);						
	КонецЕсли;
	
	Если Не Успешно Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	КукиИмя      	  = СтрПолучитьСтроку(ОтветСервера, 2);
	КукиЗначение 	  = СтрПолучитьСтроку(ОтветСервера, 3);
	ЗаголовкиЗапросов = "Cookie: " + КукиИмя + "=" + КукиЗначение;
	
	ОтобразитьСостояние("Запрос параметров обмена...");
	
	ОтветСервера = ПроцедурыОбменаССайтом.HTTPПолучитьДанныеССервера(Соединение, АдресДляРаботы + ПараметрЗапросаHTTP_Инициализация, ЗаголовкиЗапросов);
	
	Если ОтветСервера = Неопределено Тогда 
		СообщитьОбОшибкеОбмена("Не удалось получить параметры обмена с сервера.", Истина);
		Возврат Ложь;
	КонецЕсли;
	
	ZIPФайлыРазрешены = Ложь;
	ОграничениеРазмераФрагментаФайлаОбмена = 0;
	
	Если СтрЧислоСтрок(ОтветСервера) <> 2 тогда	
		СообщитьОбОшибкеОбмена("Не удалось прочитать ответ сервера. Параметры обмена не получены.", Истина);
		Возврат Ложь;
	КонецЕсли;
	
	ZIPФайлыРазрешены = СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера, 1))) = ОтветСервера_ZIPРазрешен;
	
	Попытка 
		ОграничениеРазмераФрагментаФайлаОбмена = Число(СтрЗаменить(СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера, 2))), ОтветСервера_ОграничениеРазмераФрагментаФайлаОбмена, ""));
	Исключение
		СообщитьОбИсключительнойОшибке(Истина);
		ОграничениеРазмераФрагментаФайлаОбмена = -1;
	КонецПопытки;	
	
	МассивИсходныхCMLФайлов = НайтиФайлы(мКаталогНаДиске, "*.xml");
	СписокФайловДляОтправки = ПолучитьСписокФайловДляОтправки(МассивПодкаталогов);
	
	Если ZIPФайлыРазрешены Тогда
		ОтобразитьСостояние("Подготовка ZIP-архива...");
		СписокФайловДляОтправки = ПодготовитьZIPАрхивы(СписокФайловДляОтправки);
	КонецЕсли;	
	
	Если ОграничениеРазмераФрагментаФайлаОбмена > 0 Тогда
		СписокФайловДляОтправки = РазделитьФайлыНаФрагменты(СписокФайловДляОтправки, ОграничениеРазмераФрагментаФайлаОбмена);
	КонецЕсли;	
	
	ВсегоФайлов = СписокФайловДляОтправки.Количество();
	
	Для Каждого ТекФайл Из СписокФайловДляОтправки цикл
		
		ОтобразитьСостояние("Идет отправка файла на сервер (" + Строка(СписокФайловДляОтправки.Индекс(ТекФайл) + 1) + " из " + Строка(ВсегоФайлов) + "): " + ТекФайл.Значение);
		
		ОтветСервера = HTTPОтправитьФайлНаСервер(ТекФайл.Значение, Соединение, АдресДляРаботы + ПараметрЗапросаHTTP_ПередачаФайла + ТекФайл.Представление, ЗаголовкиЗапросов);
		// изменение!!!!
		//команда = "local/crons/import/1c_exchange.php?type=sale&mode=import&filename=";
		//ОтветСервера = HTTPОтправитьФайлНаСервер(ТекФайл.Значение, Соединение, Команда + ТекФайл.Представление, ЗаголовкиЗапросов);
		//
		
		Если ZIPФайлыРазрешены Тогда
			Попытка
				УдалитьФайлы(ТекФайл.Значение);
			Исключение
			КонецПопытки;	
		КонецЕсли;	
		
		Если ОтветСервера = Неопределено Тогда
			СообщитьОбОшибкеОбмена("Не удалось получить ответ сервера. Файл не отправлен (" + ТекФайл.Значение + ").", Истина);
			Возврат Ложь;
		КонецЕсли;
		
		СостояниеОбмена = СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера,1)));
		
		Если СостояниеОбмена = ОтветСервера_АварийноеЗавершениеТекущейОперации Тогда
			
			СообщитьОбОшибкеОбмена("Произошла ошибка на стороне сервера. Файл не отправлен (" + ТекФайл.Значение + ").", Истина);
			СообщитьРасширенноеОписаниеОтветаСервера(ОтветСервера);
			Возврат Ложь;
			
		ИначеЕсли СостояниеОбмена = ОтветСервера_УспешноеЗавершениеТекущейОперации Тогда
			
			Если СтрЧислоСтрок(ОтветСервера) > 1 Тогда
				СообщитьПользователю("Получен расширенный статус успешного завершения сеанса", Истина, СтатусСообщения.Информация);
				СообщитьРасширенноеОписаниеОтветаСервера(ОтветСервера);	
			КонецЕсли;
			
		Иначе
			
			СообщитьОбОшибкеОбмена("Произошла ошибка на стороне сервера. Не получен статус завершения операции. Файл не отправлен (" + ТекФайл.Значение + ").", Истина);
			СообщитьРасширенноеОписаниеОтветаСервера(ОтветСервера);
			Возврат Ложь;
			
		КонецЕсли;		
		
	КонецЦикла;
	
	//ИмпортУспешноЗавершен = истина;
	
	// временно закомм
	 ИмпортУспешноЗавершен = Ложь;
	ОжидатьЗавершенияИмпортаФайловСервером =истина;

	Если ОжидатьЗавершенияИмпортаФайловСервером Тогда
		
		Для Каждого ТекФайл Из МассивИсходныхCMLФайлов Цикл
			
			ИмпортПродолжается = Истина;
			ТекущееСостояние = "";
			
			Пока ИмпортПродолжается Цикл
				
				//ОбработкаПрерыванияПользователя();
				ИмпортПродолжается = Ложь;
				
				ОтобразитьСостояние("Ожидание окончания загрузки данных сервером: " + ТекущееСостояние);
				//Сообщить("Ожидание окончания загрузки данных сервером: " + ТекущееСостояние);
				ТекущееСостояние = "";
				
				ОтветСервера = ПроцедурыОбменаССайтом.HTTPПолучитьДанныеССервера(Соединение, АдресДляРаботы + ПараметрЗапросаHTTP_ИмпортФайлаСервером + ТекФайл.Имя, ЗаголовкиЗапросов);
				
				Если ОтветСервера = Неопределено Тогда 
					
					Успешно = Ложь;
					СообщитьОбОшибкеОбмена("Не удалось получить текущее состояние процесса обмена. Данные обмена отправлены, но не загружены.", Истина);
					
				ИначеЕсли СтрЧислоСтрок(ОтветСервера) = 0 Тогда
					Успешно = Ложь;
					СообщитьОбОшибкеОбмена("Не удалось прочитать данные о текущем состоянии процесса обмена. Данные обмена отправлены, но не загружены.", Истина);	
				Иначе
					
					СостояниеОбмена = СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера, 1)));
					Если СостояниеОбмена = ОтветСервера_АварийноеЗавершениеТекущейОперации Тогда
						Успешно = Ложь;
						СообщитьОбОшибкеОбмена("Произошла ошибка на стороне сервера.", Истина);
						СообщитьРасширенноеОписаниеОтветаСервера(ОтветСервера);
					ИначеЕсли СостояниеОбмена = ОтветСервера_УспешноеЗавершениеТекущейОперации Тогда
						ИмпортУспешноЗавершен = Истина;
					ИначеЕсли СостояниеОбмена = ОтветСервера_ВыполнениеТекущейОперации Тогда
						ТекущееСостояние = ТекущееСостояние + СтрПолучитьСтроку(ОтветСервера, 2);
						ИмпортПродолжается = Истина;
					Иначе
						Успешно = Ложь;
						СообщитьОбОшибкеОбмена("Произошла ошибка на стороне сервера. Получен неизвестный статус импорта.", Истина);
						СообщитьРасширенноеОписаниеОтветаСервера(ОтветСервера);
					КонецЕсли;
					
				КонецЕсли;					
				
			КонецЦикла;	//Импорт
			
			Если НЕ ИмпортУспешноЗавершен Тогда
				Прервать;
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЕсли;								
	
	Возврат Успешно;
	
КонецФункции	

// выгружаем маленький файл здесь.
Функция HTTPВыгрузитьНаСерверДопФайлы(СтруктураПараметровСайта, МассивПодкаталогов = Неопределено, ОжидатьЗавершенияИмпортаФайловСервером = Ложь,ТипСоединения = "catalog")
	
	Успешно    = Истина;
	
	ОтветСервера = "";
	Соединение = Неопределено;
	
	АдресДляРаботы = СтруктураПараметровСайта.АдресСкрипта + "?type=" + ТипСоединения; 
	
	СтрокаСообщенияПользователю = "";
	Успешно = ПроцедурыОбменаССайтом.HTTPВыполнитьАвторизациюДляСоединения(Соединение, СтруктураПараметровСайта, ОтветСервера, СтрокаСообщенияПользователю, ТипСоединения);
	Если Не ПустаяСтрока(СтрокаСообщенияПользователю) Тогда
		
		СообщитьОбОшибкеОбмена(СтрокаСообщенияПользователю, Истина);						
	КонецЕсли;
	
	Если Не Успешно Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	КукиИмя      	  = СтрПолучитьСтроку(ОтветСервера, 2);
	КукиЗначение 	  = СтрПолучитьСтроку(ОтветСервера, 3);
	ЗаголовкиЗапросов = "Cookie: " + КукиИмя + "=" + КукиЗначение;
	
	ОтобразитьСостояние("Запрос параметров обмена...");
	
	
	ZIPФайлыРазрешены = СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера, 1))) = ОтветСервера_ZIPРазрешен;
	
	Попытка 
		ОграничениеРазмераФрагментаФайлаОбмена = Число(СтрЗаменить(СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера, 2))), ОтветСервера_ОграничениеРазмераФрагментаФайлаОбмена, ""));
	Исключение
		//	СообщитьОбИсключительнойОшибке(Истина);
		ОграничениеРазмераФрагментаФайлаОбмена = -1;
	КонецПопытки;	
	
	МассивИсходныхCMLФайлов = НайтиФайлы(мКаталогНаДиске, "*.xml");
	СписокФайловДляОтправки = ПолучитьСписокФайловДляОтправки(МассивПодкаталогов);
	
	Если ZIPФайлыРазрешены Тогда
		ОтобразитьСостояние("Подготовка ZIP-архива...");
		СписокФайловДляОтправки = ПодготовитьZIPАрхивы(СписокФайловДляОтправки);
	КонецЕсли;	
	
	Если ОграничениеРазмераФрагментаФайлаОбмена > 0 Тогда
		СписокФайловДляОтправки = РазделитьФайлыНаФрагменты(СписокФайловДляОтправки, ОграничениеРазмераФрагментаФайлаОбмена);
	КонецЕсли;	
	
	ВсегоФайлов = СписокФайловДляОтправки.Количество();
	
	Для Каждого ТекФайл Из СписокФайловДляОтправки цикл
		
		ОтобразитьСостояние("Идет отправка файла на сервер (" + Строка(СписокФайловДляОтправки.Индекс(ТекФайл) + 1) + " из " + Строка(ВсегоФайлов) + "): " + ТекФайл.Значение);
		// здесь же будем отправлять маленький файл
		ОтветСервера = HTTPОтправитьДопФайлНаСервер(ТекФайл.Значение, Соединение, АдресДляРаботы + ПараметрЗапросаHTTP_ПередачаФайла + ТекФайл.Представление, ЗаголовкиЗапросов,СтруктураПараметровСайта,ТекФайл.Представление);
		
		
		Если ZIPФайлыРазрешены Тогда
			Попытка
				УдалитьФайлы(ТекФайл.Значение);
			Исключение
			КонецПопытки;	
		КонецЕсли;	
		
		//	Если ОтветСервера = Неопределено Тогда
		//		СообщитьОбОшибкеОбмена("Не удалось получить ответ сервера. Файл не отправлен (" + ТекФайл.Значение + ").", Истина);
		//		Возврат Ложь;
		//	КонецЕсли;
		//	
		//	СостояниеОбмена = СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера,1)));
		//	
		//	Если СостояниеОбмена = ОтветСервера_АварийноеЗавершениеТекущейОперации Тогда
		//		
		//		СообщитьОбОшибкеОбмена("Произошла ошибка на стороне сервера. Файл не отправлен (" + ТекФайл.Значение + ").", Истина);
		//		СообщитьРасширенноеОписаниеОтветаСервера(ОтветСервера);
		//		Возврат Ложь;
		//		
		//	ИначеЕсли СостояниеОбмена = ОтветСервера_УспешноеЗавершениеТекущейОперации Тогда
		//		
		//		Если СтрЧислоСтрок(ОтветСервера) > 1 Тогда
		//			СообщитьПользователю("Получен расширенный статус успешного завершения сеанса", Истина, СтатусСообщения.Информация);
		//			СообщитьРасширенноеОписаниеОтветаСервера(ОтветСервера);	
		//		КонецЕсли;
		//		
		//	Иначе
		//		
		//		СообщитьОбОшибкеОбмена("Произошла ошибка на стороне сервера. Не получен статус завершения операции. Файл не отправлен (" + ТекФайл.Значение + ").", Истина);
		//		СообщитьРасширенноеОписаниеОтветаСервера(ОтветСервера);
		//		Возврат Ложь;
		//		
		//	КонецЕсли;		
		//	
	КонецЦикла;
	
	
	
	//
	//
	////-------------------------------------------------------------------------------------------------------------------------------------
	//ИмпортУспешноЗавершен = Ложь;
	//
	//
	//Если ОжидатьЗавершенияИмпортаФайловСервером Тогда
	//	
	//	Для Каждого ТекФайл Из МассивИсходныхCMLФайлов Цикл
	//		
	//		ИмпортПродолжается = Истина;
	//		ТекущееСостояние = "";
	//		
	//		Пока ИмпортПродолжается Цикл
	//			
	//			//ОбработкаПрерыванияПользователя();
	//			ИмпортПродолжается = Ложь;
	//			
	//			ОтобразитьСостояние("Ожидание окончания загрузки данных сервером: " + ТекущееСостояние);
	//			//Сообщить("Ожидание окончания загрузки данных сервером: " + ТекущееСостояние);
	//			ТекущееСостояние = "";
	//			
	//			ОтветСервера = ПроцедурыОбменаССайтом.HTTPПолучитьДанныеССервера(Соединение, АдресДляРаботы + ПараметрЗапросаHTTP_ИмпортФайлаСервером + ТекФайл.Имя, ЗаголовкиЗапросов);
	//			
	//			Если ОтветСервера = Неопределено Тогда 
	//				
	//				Успешно = Ложь;
	//				СообщитьОбОшибкеОбмена("Не удалось получить текущее состояние процесса обмена. Данные обмена отправлены, но не загружены.", Истина);
	//				
	//			ИначеЕсли СтрЧислоСтрок(ОтветСервера) = 0 Тогда
	//				Успешно = Ложь;
	//				СообщитьОбОшибкеОбмена("Не удалось прочитать данные о текущем состоянии процесса обмена. Данные обмена отправлены, но не загружены.", Истина);	
	//			Иначе
	//				
	//				СостояниеОбмена = СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера, 1)));
	//				Если СостояниеОбмена = ОтветСервера_АварийноеЗавершениеТекущейОперации Тогда
	//					Успешно = Ложь;
	//					СообщитьОбОшибкеОбмена("Произошла ошибка на стороне сервера.", Истина);
	//					СообщитьРасширенноеОписаниеОтветаСервера(ОтветСервера);
	//				ИначеЕсли СостояниеОбмена = ОтветСервера_УспешноеЗавершениеТекущейОперации Тогда
	//					ИмпортУспешноЗавершен = Истина;
	//				ИначеЕсли СостояниеОбмена = ОтветСервера_ВыполнениеТекущейОперации Тогда
	//					ТекущееСостояние = ТекущееСостояние + СтрПолучитьСтроку(ОтветСервера, 2);
	//					ИмпортПродолжается = Истина;
	//				Иначе
	//					Успешно = Ложь;
	//					СообщитьОбОшибкеОбмена("Произошла ошибка на стороне сервера. Получен неизвестный статус импорта.", Истина);
	//					СообщитьРасширенноеОписаниеОтветаСервера(ОтветСервера);
	//				КонецЕсли;
	//				
	//			КонецЕсли;					
	//			
	//		КонецЦикла;	//Импорт
	//		
	//		Если НЕ ИмпортУспешноЗавершен Тогда
	//			Прервать;
	//		КонецЕсли;	
	//		
	//	КонецЦикла;	
	//	
	//КонецЕсли;								
	Если ОтветСервера = Неопределено тогда
		успешно = истина;
	КонецЕсли;	
	
	Возврат Успешно;
	
КонецФункции	



Функция HTTPОтправитьФайлНаСервер(ПолноеИмяФайла, Соединение, ПараметрыЗапроса="", Заголовки="")
	
	
	ОтветСервера = Неопределено;
	ИмяФайлаОтвета = ПолучитьИмяВременногоФайла();
	
	Попытка
		Соединение.ОтправитьДляОбработки(ПолноеИмяФайла, СокрЛП(ПараметрыЗапроса), ИмяФайлаОтвета, СокрЛП(Заголовки));
	Исключение
		СообщитьОбИсключительнойОшибке(Истина, ОписаниеОшибки());
	КонецПопытки;	
	
	ФайлОтвета = Новый Файл(ИмяФайлаОтвета);
	
	Если ФайлОтвета.Существует() Тогда
		
		ТекстОтвета = Новый ТекстовыйДокумент();
		ТекстОтвета.Прочитать(ИмяФайлаОтвета);
		Если ТекстОтвета.КоличествоСтрок()>0 Тогда
			ОтветСервера = ТекстОтвета.ПолучитьТекст();	
		Иначе
			СообщитьПользователю("Отправка файла на сервер: Получен пустой ответ сервера.", Истина); 	
		КонецЕсли;	
		
	Иначе	
		СообщитьПользователю("Отправка файла на сервер: Ответ сервера не получен.", Истина); 
	КонецЕсли;	
	
	
	Попытка
		УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайлаОтвета);   
	Исключение
	КонецПопытки;
	
	Возврат ОтветСервера;	
	
КонецФункции	

// здесь отправляем дополнительный файл "маленький" для изменения количества от нас
Функция HTTPОтправитьДопФайлНаСервер_ст(ПолноеИмяФайла, Соединение, ПараметрыЗапроса="", Заголовки="",СтруктураПараметровСайта,КраткоеИмяФайла)
	
	
	//	от Федора
	//	Вот пример рабочего POST запроса на короткий XML файл с изменениями к заказу:
	
	//POST /local/crons/import/orders.php HTTP/1.1
	//Host: test.collant.ru
	//Cookie: BITRIX_SM_GUEST_ID=411; BITRIX_SM_LAST_VISIT=28.09.2021+12%3A51%3A44; PHPSESSID=lBaB7Uh2at5g1uGqPbuc17JfetCHUlts
	//Content-Length: 170
	//Content-Type: multipart/form-data; boundary=----WebKitFormBoundary7MA4YWxkTrZu0gW
	
	//----WebKitFormBoundary7MA4YWxkTrZu0gW
	//Content-Disposition: form-data; name="file"; filename="26.xml"
	//Content-Type: text/xml
	
	//(data)
	//----WebKitFormBoundary7MA4YWxkTrZu0gW
	
	//Обязательно адрес с https:// указывать!
	
	
	//Создаем HTTPЗапрос через Новый HTTPЗапрос()
	//Методом HTTP запроса УстановитьТелоИзДвоичныхДанных() передаем в него картинку и отправляем
	//	
	
	
	// здесь меняем запрос отправки на сервер.
	
	ОтветСервера = Неопределено;
	ИмяФайлаОтвета = ПолучитьИмяВременногоФайла();
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".txt");
	
	АдресТ = "test.collant.ru" ;   
	попытка 
		Соединение = Новый HTTPСоединение(АдресТ,443,СтруктураПараметровСайта.ИмяПользователя,СтруктураПараметровСайта.Пароль,,,Новый ЗащищенноеСоединениеOpenSSL);  // логин  пароль сюда пропсиать
	исключение
		//Сообщить(ОписаниеОшибки());
	конецПопытки;
	
	команда = "/local/crons/import/orders.php?";  
	
	HTTPзапрос = новый HTTPзапрос();
	HTTPзапрос.АдресРесурса = Команда;
	
	КартинкаИмяПараметра = "file";
	КартинкаИмяФайла = КраткоеИмяФайла;
	Картинка = Новый Файл(ПолноеИмяФайла); // любым удобным способом, по факту нужны ДД изображения
	// 
	Разделитель = СтрЗаменить(Новый УникальныйИдентификатор(), "-", ""); // все что угодно, можно даже руками указать "razzdell", главное что бы оно было уникальное во всем тексте тела
	
	// формируем файл для отправки
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".txt");
	имяФайлаОтправки = ПолучитьИмяВременногоФайла(".txt");
	Boundary = "--WebKitFormBoundary"+СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
	
	// параметр "text"
	ФайлДляПередачи = Новый ТекстовыйДокумент;
	ФайлДляПередачи.Прочитать(ПолноеИмяФайла);
	
	ЗаписьТекста = Новый ЗаписьТекста(имяФайлаОтправки);
	
	ЗаписьТекста.ЗаписатьСтроку("POST /local/crons/import/orders.php HTTP/1.1");
	ЗаписьТекста.ЗаписатьСтроку("Host: test.collant.ru");
	ЗаписьТекста.ЗаписатьСтроку("Content-Type: multipart/form-data; boundary=--"+Boundary);
	
	ЗаписьТекста.ЗаписатьСтроку("");
	ЗаписьТекста.ЗаписатьСтроку("--"+boundary);
	ЗаписьТекста.ЗаписатьСтроку("Content-Disposition: form-data; name=""file""; filename="""+КраткоеИмяФайла);
	ЗаписьТекста.ЗаписатьСтроку("Content-Type: text/xml");
	
	ЗаписьТекста.ЗаписатьСтроку("");
	ЗаписьТекста.Записать(ФайлДляПередачи.ПолучитьТекст());
	ЗаписьТекста.ЗаписатьСтроку("");
	
	// закроем разделитель
	ЗаписьТекста.ЗаписатьСтроку("--"+boundary+"--");  // ??
	
	ЗаписьТекста.Закрыть();
	
	ФайлОтправки = Новый Файл(имяФайлаОтправки);
	РазмерФайлаОтправки = XMLСтрока(ФайлОтправки.Размер());
	
	// передадим данные на сервер 
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "multipart/form-data, boundary="+boundary);
	Заголовки.Вставить("Content-Lenght", РазмерФайлаОтправки);
	Заголовки.Вставить("Host", "test.collant.ru");
	Заголовки.Вставить("POST", "/local/crons/import/orders.php");
	
	попытка
		Соединение.ОтправитьДляОбработки(имяФайлаОтправки, команда, ИмяВременногоФайла, Заголовки);   
	исключение
		СообщитьПользователю("Ошибка отправки Файла по количеству товаров. "+ОписаниеОшибки(),истина);
	конецПопытки;
	
	ФайлОтвета = Новый Файл(ИмяВременногоФайла);
	
	Если ФайлОтвета.Существует() Тогда
		
		ТекстОтвета = Новый ТекстовыйДокумент();
		ТекстОтвета.Прочитать(ИмяВременногоФайла);
		Если ТекстОтвета.КоличествоСтрок()>0 Тогда
			ОтветСервера = ТекстОтвета.ПолучитьТекст();	
		Иначе
			// если пустой ответ, то все прогрузилось
			//СообщитьПользователю("Файл по количеству товаров отправлен.",истина);
		КонецЕсли;	
		
	Иначе	
		//СообщитьПользователю("Отправка файла на сервер: Ответ сервера не получен.", Истина); 
	КонецЕсли;	
	
	
	Попытка
		УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайлаОтвета);   
	Исключение
	КонецПопытки;
	
	Возврат ОтветСервера;	
	
КонецФункции	

//нечаева 25,09,23+++
// здесь отправляем дополнительный файл "маленький" для изменения количества от нас
Функция HTTPОтправитьДопФайлНаСервер(ПолноеИмяФайла, Соединение, ПараметрыЗапроса="", Заголовки="",СтруктураПараметровСайта,КраткоеИмяФайла)
	
	
	//	от Федора
	//	Вот пример рабочего POST запроса на короткий XML файл с изменениями к заказу:
	
	//POST /local/crons/import/orders.php HTTP/1.1
	//Host: test.collant.ru
	//Cookie: BITRIX_SM_GUEST_ID=411; BITRIX_SM_LAST_VISIT=28.09.2021+12%3A51%3A44; PHPSESSID=lBaB7Uh2at5g1uGqPbuc17JfetCHUlts
	//Content-Length: 170
	//Content-Type: multipart/form-data; boundary=----WebKitFormBoundary7MA4YWxkTrZu0gW
	
	//----WebKitFormBoundary7MA4YWxkTrZu0gW
	//Content-Disposition: form-data; name="file"; filename="26.xml"
	//Content-Type: text/xml
	
	//(data)
	//----WebKitFormBoundary7MA4YWxkTrZu0gW
	
	//Обязательно адрес с https:// указывать!
	
	
	//Создаем HTTPЗапрос через Новый HTTPЗапрос()
	//Методом HTTP запроса УстановитьТелоИзДвоичныхДанных() передаем в него картинку и отправляем
	//	
	
	
	// здесь меняем запрос отправки на сервер.
	
	ОтветСервера = Неопределено;
	ИмяФайлаОтвета = ПолучитьИмяВременногоФайла();
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".txt");
	
	АдресТ = СтруктурапараметровСайта.Сервер; //"test.collant.ru" ;   
	попытка 
		Соединение = Новый HTTPСоединение(АдресТ,443,СтруктураПараметровСайта.ИмяПользователя,СтруктураПараметровСайта.Пароль,,,Новый ЗащищенноеСоединениеOpenSSL);  // логин  пароль сюда пропсиать
	исключение
		//Сообщить(ОписаниеОшибки());
	конецПопытки;
	
	команда = "/local/crons/import/orders.php?";  
	
	HTTPзапрос = новый HTTPзапрос();
	HTTPзапрос.АдресРесурса = Команда;
	
	КартинкаИмяПараметра = "file";
	КартинкаИмяФайла = КраткоеИмяФайла;
	Картинка = Новый Файл(ПолноеИмяФайла); // любым удобным способом, по факту нужны ДД изображения
	// 
	Разделитель = СтрЗаменить(Новый УникальныйИдентификатор(), "-", ""); // все что угодно, можно даже руками указать "razzdell", главное что бы оно было уникальное во всем тексте тела
	
	// формируем файл для отправки
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".txt");
	имяФайлаОтправки = ПолучитьИмяВременногоФайла(".txt");
	Boundary = "--WebKitFormBoundary"+СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
	
	// параметр "text"
	ФайлДляПередачи = Новый ТекстовыйДокумент;
	ФайлДляПередачи.Прочитать(ПолноеИмяФайла);
	
	ЗаписьТекста = Новый ЗаписьТекста(имяФайлаОтправки);
	
	ЗаписьТекста.ЗаписатьСтроку("POST /local/crons/import/orders.php HTTP/1.1");
	ЗаписьТекста.ЗаписатьСтроку("Host: "+СтруктурапараметровСайта.Сервер); //test.collant.ru");
	ЗаписьТекста.ЗаписатьСтроку("Content-Type: multipart/form-data; boundary=--"+Boundary);
	
	ЗаписьТекста.ЗаписатьСтроку("");
	ЗаписьТекста.ЗаписатьСтроку("--"+boundary);
	ЗаписьТекста.ЗаписатьСтроку("Content-Disposition: form-data; name=""file""; filename="""+КраткоеИмяФайла);
	ЗаписьТекста.ЗаписатьСтроку("Content-Type: text/xml");
	
	ЗаписьТекста.ЗаписатьСтроку("");
	ЗаписьТекста.Записать(ФайлДляПередачи.ПолучитьТекст());
	ЗаписьТекста.ЗаписатьСтроку("");
	
	// закроем разделитель
	ЗаписьТекста.ЗаписатьСтроку("--"+boundary+"--");  // ??
	
	ЗаписьТекста.Закрыть();
	
	ФайлОтправки = Новый Файл(имяФайлаОтправки);
	РазмерФайлаОтправки = XMLСтрока(ФайлОтправки.Размер());
	
	// передадим данные на сервер 
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "multipart/form-data, boundary="+boundary);
	Заголовки.Вставить("Content-Lenght", РазмерФайлаОтправки);
	Заголовки.Вставить("Host", СтруктурапараметровСайта.Сервер);   //"test.collant.ru");
	Заголовки.Вставить("POST", "/local/crons/import/orders.php");
	
	попытка
		Соединение.ОтправитьДляОбработки(имяФайлаОтправки, команда, ИмяВременногоФайла, Заголовки);   
	исключение
		СообщитьПользователю("Ошибка отправки Файла по количеству товаров. "+ОписаниеОшибки(),истина);
	конецПопытки;
	
	ФайлОтвета = Новый Файл(ИмяВременногоФайла);
	
	Если ФайлОтвета.Существует() Тогда
		
		ТекстОтвета = Новый ТекстовыйДокумент();
		ТекстОтвета.Прочитать(ИмяВременногоФайла);
		Если ТекстОтвета.КоличествоСтрок()>0 Тогда
			ОтветСервера = ТекстОтвета.ПолучитьТекст();	
		Иначе
			// если пустой ответ, то все прогрузилось
			//СообщитьПользователю("Файл по количеству товаров отправлен.",истина);
		КонецЕсли;	
		
	Иначе	
		//СообщитьПользователю("Отправка файла на сервер: Ответ сервера не получен.", Истина); 
	КонецЕсли;	
	
	
	Попытка
		УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайлаОтвета);   
	Исключение
	КонецПопытки;
	
	Возврат ОтветСервера;	
	
КонецФункции	



////----------------------------------------------------------------------------------------------------------------------------------------------------------------------


Функция HTTPЗагрузитьССервера(СтруктураПараметровСайта, ТипСоединения, КоличествоОбработанныхДокументов)
	
	//возврат Истина;
	записатьВЛог("b2b"," 4 загрузка заказов ","");
	Успешно = Истина;
	ОтветСервера = "";
	Соединение = Неопределено;
	КоличествоОбработанныхДокументов = 0;
	
	АдресДляРаботы = СтруктураПараметровСайта.АдресСкрипта + "?type=" + ТипСоединения;
	
	СтрокаСообщенияПользователю = "";
	Успешно = ПроцедурыОбменаССайтом.HTTPВыполнитьАвторизациюДляСоединения(Соединение, СтруктураПараметровСайта, ОтветСервера, СтрокаСообщенияПользователю, ТипСоединения);
	Если Не ПустаяСтрока(СтрокаСообщенияПользователю) Тогда
		СообщитьОбОшибкеОбмена(СтрокаСообщенияПользователю, Ложь);
		//ЗаписатьВЛог("ОбменССайтом",СтрокаСообщенияПользователю,"Инф");
		//ЗаписатьВЛог("ОбменССайтом",""+СтруктураПараметровСайта.ИмяПользователя+" + "+СтруктураПараметровСайта.Пароль,"Инф");
		
	КонецЕсли;
	
	Если Не Успешно Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КукиИмя      	  = СтрПолучитьСтроку(ОтветСервера,2);
	КукиЗначение 	  = СтрПолучитьСтроку(ОтветСервера,3);
	ЗаголовкиЗапросов = "Cookie: " + КукиИмя + "=" + КукиЗначение;
	
	ОтобразитьСостояние("Загрузка данных с сервера...");
	ЗаписатьВЛог("ОбменССайтом","Загрузка данных с сервера...","Инф");
	
	
	ИнформацияДляПользователя = "";
	ОтветСервера = ПроцедурыОбменаССайтом.HTTPПолучитьДанныеССервера(Соединение, АдресДляРаботы + ПараметрЗапросаHTTP_ПолучитьДанные, ЗаголовкиЗапросов, ИнформацияДляПользователя);
	Если Не ПустаяСтрока(ИнформацияДляПользователя) Тогда
		СообщитьПользователю(ИнформацияДляПользователя, Ложь);
		//ЗаписатьВЛог("ОбменССайтом",ИнформацияДляПользователя,"Инф");
	КонецЕсли;
	
	Если ОтветСервера = Неопределено Тогда 
		СообщитьОбОшибкеОбмена("Не удалось загрузить данные с сервера.", Ложь);
		ЗаписатьВЛог("ОбменССайтом","Не удалось загрузить данные с сервера.","Инф");
		Возврат Ложь;
	КонецЕсли;
	
	
	
	//	возврат ложь;
	СтрокаCML = "";
	
	// временно для тестов.  !!!!!! нечаева  
	//  из сохраненного файле будем брать данные
	
	//ОтветСервера=
	
	пп=1;
	//проверка
	//
	//ТекстОтвета = Новый ТекстовыйДокумент();
	//ТекстОтвета.Прочитать("C:\Users\nechaeva\Desktop\Работа с заказми битрикс\1212.txt");
	////ТекстОтвета.Прочитать("C:\Users\nechaeva\Desktop\Работа с заказми битрикс\заказы\1234.txt");
	//Если ТекстОтвета.КоличествоСтрок()>0 Тогда
	//	ОтветСервера = ТекстОтвета.ПолучитьТекст();	
	//Иначе
	//	СообщитьПользователю("Заказов нет", Истина); 	
	//КонецЕсли;	
	
		
	//возврат ложь; 
		
	Если Лев(ОтветСервера, 2) = "PK" Тогда
		СтрокаCML = РаспаковатьZIPАрхив(ОтветСервера);
	Иначе
		Если Лев(ОтветСервера, 5) = "<?xml" Тогда
			СтрокаCML = ОтветСервера;   ///  !!!!!!!!!!!!!!!!!!!!!!!!!!!  тут передавать строку заказа с ответом сервера
		КонецЕсли;	
	КонецЕсли;						
	
	Если НЕ ЗначениеЗаполнено(СтрокаCML) Тогда
		СообщитьОбОшибкеОбмена("Не удалось прочитать данные, загруженные с сервера.", Ложь);
		Возврат Ложь;		
	КонецЕсли;
	
	ДеревоДокументов = РазобратьCML(СтрокаCML);
	записатьВЛог("b2b"," 5 ","");
	Если ДеревоДокументов = Неопределено Тогда
		СообщитьОбОшибкеОбмена("Не удалось разобрать данные, загруженные с сервера.", Ложь);
		Возврат Ложь;		
	КонецЕсли;
	// дереводокументов = новый ДеревоЗначений;
	
	Успешно = ОбработатьДокументы(ДеревоДокументов, КоличествоОбработанныхДокументов);
	
	Если НЕ Успешно Тогда 
		СообщитьОбОшибкеОбмена("Не удалось обработать документы, загруженные с сервера.", Ложь);
		Возврат Ложь;
	КонецЕсли;
	
	ИнформацияДляПользователя = "";
	ПроцедурыОбменаССайтом.HTTPПолучитьДанныеССервера(Соединение, АдресДляРаботы + ПараметрЗапросаHTTP_УспешноеЗавершениеИмпорта, ЗаголовкиЗапросов, ИнформацияДляПользователя);
	Если Не ПустаяСтрока(ИнформацияДляПользователя) Тогда
		СообщитьПользователю(ИнформацияДляПользователя, Ложь);
	КонецЕсли;
	
	Возврат Успешно;
	
КонецФункции



// начальная процедура обмена данными.
// !!!!!!!!!!!!!!!!

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ УПРАВЛЕНИЯ ВЫГРУЗКОЙ ДАННЫХ

Процедура ПРоверкаРНКНаОтгрузку()
	
	// сначала все РНК проверим, что они в РГ к заказам.
	// выберем все заказы, которые оформлены , но не отгружены. и к ним будем искать РНК.
	// после отправки РНК мы будем менять статус в категории обьектов - на выполнен и не будет отбираться.
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Заказ.Ссылка КАК ЗаказСсылка,
	               |	Заказ.ДатаОтгрузки КАК ДатаОтгрузки,
	               |	Заказ.СостояниеСогласования КАК СостояниеСогласования
	               |ИЗ
	               |	Документ.Заказ КАК Заказ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	               |		ПО (КатегорииОбъектов.Объект = Заказ.Ссылка)
	               |			И (КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ЗаказСWEBСайта))
	               |ГДЕ
	               |	&УсловиеОграниченияПоДокументам
	               |	И Заказ.СостояниеСогласования = &Оформлен
	               |	И Заказ.ДатаОтгрузки >= &ТекДатаОтгрузки";

	 Запрос.УстановитьПараметр("УсловиеОграниченияПоДокументам", Истина);
	 Запрос.УстановитьПараметр("ТекДатаОтгрузки",ТекущаяДата() - 15*60*24);
	 Запрос.УстановитьПараметр("Оформлен", перечисления.СостоянияСогласования.Согласован);
	 КолЗаказов = Запрос.Выполнить().Выбрать();
	 // к ним выберем РНК к каждому и проверим, что они уже РГ или отгружены.
	 Пока колЗаказов.Следующий() цикл
		 // проставим для РНК признак отправки. // состояние веб заказ.
		 Запрос = новый Запрос;
		 Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		                |	Заказ.Ссылка КАК ЗаказСсылка,
		                |	Заказ.ДатаОтгрузки КАК ДатаОтгрузки,
		                |	Заказ.СостояниеНакладной КАК СостояниеСогласования
		                |ИЗ
		                |	Документ.РасходнаяНакладная КАК Заказ
		                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
		                |		ПО (КатегорииОбъектов.Объект = Заказ.Ссылка)
		                |			И (КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ЗаказСWEBСайта))
		                |ГДЕ
		                |	&УсловиеОграниченияПоДокументам
		                |	И (Заказ.СостояниеНакладной = &ГтовКОтгр или Заказ.СостояниеНакладной = &Отгружено)
		                |	И Заказ.ДатаОтгрузки >= &ТекДатаОтгрузки";
		 
		 Запрос.УстановитьПараметр("УсловиеОграниченияПоДокументам", Истина);
		 Запрос.УстановитьПараметр("ТекДатаОтгрузки",ТекущаяДата() - 15*60*24);
		 Запрос.УстановитьПараметр("ГтовКОтгр", перечисления.СостоянияНакладной.ГотоваКОтгрузке);
		 Запрос.УстановитьПараметр("ГтовКОтгр", перечисления.СостоянияНакладной.Отгружена);
		 КолЗаказов2 = Запрос.Выполнить().Выбрать();
		 // тут проставлять надо будет
		 
		 
		 
	 КонецЦикла;	 
	 

	
	
	
	
КонецПроцедуры	


Процедура ВыгрузитьДанные(ТестоваяВыгрузка = Ложь) Экспорт
	
	//сообщить(ВыгружатьЦветаИМ);
	
	//НомерНастройки = "031"; 
	//ЗаписатьВЛог("b2b"," Интернет-магазин. Начало выгрузки!","");
	//++Данилова Е.В. 11.09.2024 для теста через форму
	Если ЗначениеЗаполнено(НастройкаСсылка) 
		И Не ЗначениеЗаполнено(НомерНастройки) Тогда
		
		НомерНастройки = НастройкаСсылка.Код; 
		
	ИначеЕсли НЕ ЗначениеЗаполнено(НомерНастройки) 
		 И ТестоваяВыгрузка = ЛОЖЬ Тогда
		
		НомерНастройки = "031"	
		
	КонецЕсли;
	
	//--Данилова Е.В. 11.09.2024
	
	//++Данилова Е.В. 11.09.2024
	Если ТестоваяВыгрузка <> ИСТИНА Тогда 
		//--Данилова Е.В. 11.09.2024
		СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
		ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
		//Кухарь А.Ю. 31.03.2026 начало
		// Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом тогда
		Если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() тогда
			//Кухарь А.Ю. 31.03.2026 конец
			
			ЗаписатьВЛог("b2b","!!! Отмена выполнения. Задача: Обмен заказами. Автообмен разрешен для базы: """+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
			Возврат;
		КонецЕсли;
		//++Данилова Е.В. 11.09.2024
	КонецЕсли;
	//--Данилова Е.В. 11.09.2024
	
	записатьВЛог("b2b"," 2 - 1. Начало выгрузки!","");
	
	
	
	//ПРоверкаРНКНаОтгрузку();

			
	
	мПринудительнаяПолнаяВыгрузка = ПроцедурыОбменаССайтом.ПолучитьФлагПринудительнойПолнойВыгрузки(НастройкаСсылка);
	мДатаФормирования = ТекущаяДата();
	мСтруктураИнформацииИсторииОбмена = ПолучитьСтруктуруИнформацииДляИстории();
	мСтруктураИнформацииИсторииОбмена.ДатаНачалаПоследнейВыгрузки = ТекущаяДата();
	мНомерВыгрузки = НастройкаСсылка.код;  //НомерНастройки;  //
	
	//	записатьВЛог("b2b"," "+НастройкаСсылка.код,"");
	
	НастройкаСсылка= справочники.НастройкиОбменаССайтом.НайтиПоКоду(НомерНастройки);
	
	записатьВЛог("b2b"," "+НомерНастройки,"");

	Если Настройкассылка.Пустая() Тогда
		
		возврат;
		
	КонецЕсли;
	
		
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкаСсылка); // заполяем параметры обработки данными.
	
	НачалоАдресаСкрипта = НастройкаСсылка.HTTPОбменАдресСайта;
	СтруктураАдреса = ПроцедурыОбменаССайтом.РазобратьАдресСайта(НачалоАдресаСкрипта);
	
	HTTPОбменПорт = СтруктураАдреса.HTTPПорт;
	HTTPОбменСервер = СтруктураАдреса.HTTPСервер;
	HTTPОбменЗащищенноеСоединение = СтруктураАдреса.HTTPЗащищенноеСоединение;
	НачалоАдресаСкрипта = СтруктураАдреса.HTTPАдресСкрипта;
	СтруктураИзменений=Неопределено;
	
	//	ЗаписатьВЛог("ОбменССайтом",""+HTTPОбменИмяПользователя+" + "+HTTPОбменПароль,"Инф");
	
	
	//Если ВыгружатьТолькоИзменения Тогда
	//	СтруктураИзменений = ПолучитьВсеИзмененияИзПланаОбмена();
	//КонецЕсли;
	
	
	Если ПустаяСтрока(КаталогВыгрузки) Тогда
		КаталогВыгрузки = КаталогВременныхФайлов(); //КаталогВременныхФайлов();
	Иначе
		ПоследнийСимвол = Сред(КаталогВыгрузки, СтрДлина(КаталогВыгрузки), 1);
		Если ПоследнийСимвол <> "\" Тогда
			КаталогВыгрузки = КаталогВыгрузки + "\";			
		КонецЕсли;
	КонецЕсли;
	
	мКаталогНаДиске = КаталогВыгрузки + мПодкаталогБезопасностиКаталогаВыгрузки+ "\";
	
	СоздатьКаталог(мКаталогНаДиске);
	
	ОчиститьКаталогНаДиске();
	
	ФайлЗагрузки = мКаталогНаДиске + "\order.xml";
	
		
	
	Если ОбменЗаказами Тогда
		
		ЗаказыУспешноВыгружены = ВыполнитьОбменЗаказами(СтруктураИзменений);
		
	Иначе
		ЗаказыУспешноВыгружены = Истина;
	КонецЕсли;
	//***********************************************************
	//           выгрузим акции
	//***********************************************************
	АкцииВыгружены = загрузитьпромоакции();
	записатьвлог("b2b"," акции выгружены "+АкцииВыгружены,);
	
	//мСтруктураИнформацииИсторииОбмена.ДатаПоследнейВыгрузки = ТекущаяДата();
	//мСтруктураИнформацииИсторииОбмена.РезультатПоследнейВыгрузки = ТоварыУспешноВыгружены; // И ЗаказыУспешноВыгружены;
	//ЗаписатьИнформациюВПротоколОбмена(мСтруктураИнформацииИсторииОбмена);
	//
	
	ЗаписатьВЛог("b2b"," Интернет-магазин. Загрузка РНК и акций закончена!","Инф");
	
	
КонецПроцедуры


Процедура ОчиститьКаталогНаДиске()
	Попытка
		УдалитьФайлы(мКаталогНаДиске, "*.*");  
		
	Исключение
		СообщитьОбИсключительнойОшибке(Истина, "Не удалось очистить каталог обмена! (" + мКаталогНаДиске + ")");
	КонецПопытки;	
КонецПроцедуры	
////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ УПРАВЛЕНИЯ ПРОФИЛЯМИ (НАСТРОЙКАМИ)

Функция ОпределитьМожноВыгрузитьТовары()
	
	ЕстьКаталогВыгрузки   = ЗначениеЗаполнено(КаталогВыгрузки);
	ЕстьСайт			  = ЗначениеЗаполнено(HTTPОбменСервер);
	
	Если ВыгружатьНаСайт Тогда
		Возврат ЕстьСайт;
	Иначе
		Возврат ЕстьКаталогВыгрузки;
	КонецЕсли;
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////////
//// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ОБРАБОТКИ ФАЙЛОВ


Функция РаспаковатьZIPАрхив(СтрокаZIP)
	
	СтрокаСодержимого = "ZIP_ERROR";
	
	ИмяФайла    = ПолучитьИмяВременногоФайла("zip");
	ИмяКаталога = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор);
	СоздатьКаталог(ИмяКаталога);
	
	СтрокаВФайл = Новый ТекстовыйДокумент;
	СтрокаВФайл.УстановитьТекст(СтрокаZIP);
	Попытка
		СтрокаВФайл.Записать(ИмяФайла);
	Исключение
	КонецПопытки;
	
	ЧтениеZIP = Новый ЧтениеZIPФайла(ИмяФайла);
	ЧтениеZIP.ИзвлечьВсе(ИмяКаталога);
	ЧтениеZIP.Закрыть();
	
	РаспакованныеФайлы = НайтиФайлы(ИмяКаталога, "*.xml");
	
	Если РаспакованныеФайлы.Количество() = 1 Тогда
		СтрокаИзФайла 	  = Новый ТекстовыйДокумент;
		СтрокаИзФайла.Прочитать(РаспакованныеФайлы[0].ПолноеИмя);
		СтрокаСодержимого = СтрокаИзФайла.ПолучитьТекст();
	КонецЕсли;
	
	Попытка
		УдалитьФайлы(ИмяФайла);
		УдалитьФайлы(ИмяКаталога);
	Исключение
	КонецПопытки;
	
	Возврат СтрокаСодержимого;
	
КонецФункции	

Функция РазделитьФайлыНаФрагменты(СписокФайлов, ОграничениеРазмераФрагмента)
	
	НовыйСписокФайлов = Новый СписокЗначений;
	Для Каждого ТекФайл Из СписокФайлов цикл
		
		ФайлНаДиске = Новый Файл(ТекФайл.Значение);
		Если ФайлНаДиске.Размер() > ОграничениеРазмераФрагмента Тогда
			МассивФрагментов = РазделитьФайл(ФайлНаДиске.ПолноеИмя, ОграничениеРазмераФрагмента);
			Для Каждого НовыйФайл Из МассивФрагментов Цикл
				НовыйСписокФайлов.Добавить(НовыйФайл, ТекФайл.Представление);
			КонецЦикла;	
			УдалитьФайлы(ФайлНаДиске.ПолноеИмя);
		Иначе
			НовыйСписокФайлов.Добавить(ТекФайл.Значение, ТекФайл.Представление);	
		КонецЕсли;	
		
	КонецЦикла;
	Возврат НовыйСписокФайлов;
	
КонецФункции

Функция ПодготовитьZIPАрхивы(СписокФайлов)
	
	ПолноеИмяФайлаАрхива = ПолучитьИмяВременногоФайла("zip");
	ЗаписьАрхива   	     = Новый ЗаписьZipФайла(ПолноеИмяФайлаАрхива);
	
	СоздатьКаталог(мКаталогНаДиске);
	
	ЗаписьАрхива.Добавить(мКаталогНаДиске + "\*.*", РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно); //.ОбрабатыватьРекурсивно;
	ЗаписьАрхива.Записать();
	
	НовыйСписокФайлов = Новый СписокЗначений;
	НовыйСписокФайлов.Добавить(ПолноеИмяФайлаАрхива, ПолучитьИмяФайла(ПолноеИмяФайлаАрхива));
	
	Возврат НовыйСписокФайлов;
	
КонецФункции

Функция ПолучитьИмяФайла(ПолноеИмяФайла)
	
	ИмяФайла = "";
	
	ПромТекст = СтрЗаменить(ПолноеИмяФайла, "/", "\");
	ПромТекст = СтрЗаменить(ПолноеИмяФайла, "\", Символы.ПС);
	
	КоличествоЭлементов = СтрЧислоСтрок(ПромТекст);
	Для Счетчик = 1 По КоличествоЭлементов Цикл
		ИмяФайла = СтрПолучитьСтроку(ПромТекст, Счетчик);
	КонецЦикла;	
	
	Возврат ИмяФайла;
	
КонецФункции

Функция ПодготовитьИмяФайлаДляСервера(ФайлОбъект)
	
	ПолноеИмяФайлаДляСервера = "";
	
	Если Найти(ФайлОбъект.Имя, ".xml") > 0 Тогда
		ПолноеИмяФайлаДляСервера = ФайлОбъект.Имя;
	Иначе	
		//у картинки надо оставить 2 папки и развернуть слэши
		ПолноеИмяФайлаДляСервера = ФайлОбъект.ПолноеИмя;
		ПутьДляУдаления 		 = мКаталогНаДиске + "\";
		ПолноеИмяФайлаДляСервера = СтрЗаменить(ПолноеИмяФайлаДляСервера, ПутьДляУдаления, "");
		ПолноеИмяФайлаДляСервера = СтрЗаменить(ПолноеИмяФайлаДляСервера, "\", "/");
	КонецЕсли;
	
	ПолноеИмяФайлаДляСервера = УдалитьДополнительныеРасширенияФайла(ПолноеИмяФайлаДляСервера);
	
	Возврат ПолноеИмяФайлаДляСервера;
	
КонецФункции


Функция УдалитьДополнительныеРасширенияФайла(ИсходноеИмяФайла)
	
	ПозицияТочки 			  = Найти(ИсходноеИмяФайла, ".");
	ИмяФайла    			  = Лев(ИсходноеИмяФайла, ПозицияТочки - 1);
	ПраваяЧастьИсходногоИмени = Прав(ИсходноеИмяФайла, СтрДлина(ИсходноеИмяФайла) - ПозицияТочки);
	ПозицияТочки 			  = Найти(ПраваяЧастьИсходногоИмени, ".");
	Расширение 				  = ПраваяЧастьИсходногоИмени;
	Если ПозицияТочки > 0 Тогда
		Расширение = Лев(ПраваяЧастьИсходногоИмени, ПозицияТочки - 1);	
	КонецЕсли;	
	
	Возврат ИмяФайла + "." + Расширение;
	
КонецФункции	

Функция ПолучитьСписокФайловДляОтправки(МассивПодкаталогов);
	
	СписокФайлов = Новый СписокЗначений;
	Маска = "*.*";
	
	ВсеФайлыДляВыгрузки = НайтиФайлы(мКаталогНаДиске, Маска);
	
	Если МассивПодкаталогов <> Неопределено Тогда
		
		Для Каждого Подкаталог Из МассивПодкаталогов Цикл
			
			ФайлыВПодкаталоге = НайтиФайлы(мКаталогНаДиске + "\" + Подкаталог, Маска);
			Для Каждого ТекФайл Из ФайлыВПодкаталоге Цикл
				
				Если ТекФайл.ЭтоКаталог() Тогда
					
					ФайлыВДобавочномПодкаталоге = НайтиФайлы(ТекФайл.ПолноеИмя, Маска);
					Для Каждого ТекФайлВПодкаталоге Из ФайлыВДобавочномПодкаталоге Цикл
						
						Если НЕ ТекФайлВПодкаталоге.ЭтоКаталог() Тогда	
							ВсеФайлыДляВыгрузки.Добавить(ТекФайлВПодкаталоге);  								
						КонецЕсли;	
						
					КонецЦикла;	
					
				Иначе	
					ВсеФайлыДляВыгрузки.Добавить(ТекФайл);  
				КонецЕсли;	
				
			КонецЦикла;	
			
		КонецЦикла;			
		
	КонецЕсли;
	
	Для Каждого ТекФайл Из ВсеФайлыДляВыгрузки цикл
		
		Если НЕ ТекФайл.ЭтоКаталог() Тогда
			ПолноеИмяФайлаДляСервера = ПодготовитьИмяФайлаДляСервера(ТекФайл);
			СписокФайлов.Добавить(ТекФайл.ПолноеИмя, ПолноеИмяФайлаДляСервера);
		КонецЕсли;	
		
	КонецЦикла;	
	
	Возврат СписокФайлов;
	
КонецФункции		

//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ И ФУНКЦИИ ОПИСАНИЯ И ВЫВОДА ОШИБОК И СООБЩЕНИЙ

Функция ПолучитьСтруктуруИнформацииДляИстории()
	
	СтруктураДляИстории = Новый Структура("ДатаПоследнейЗагрузки,ДатаПоследнейВыгрузки,ДатаНачалаПоследнейЗагрузки,
	|ДатаНачалаПоследнейВыгрузки,РезультатПоследнейЗагрузки,РезультатПоследнейВыгрузки,
	|КомментарийКЗагрузкеДанных,КомментарийКВыгрузкеДанных");
	
	СтруктураДляИстории.КомментарийКЗагрузкеДанных = "";
	СтруктураДляИстории.КомментарийКВыгрузкеДанных = "";
	
	Возврат СтруктураДляИстории;
	
КонецФункции

Процедура ДобавитьТехническуюИнформацияВСообщение(СокращенноеСообщение, СообщениеСТехИнформацией)
	
	Если СокращенноеСообщение = СообщениеСТехИнформацией Тогда
		Возврат;
	КонецЕсли;
	
	СокращенноеСообщение = СокращенноеСообщение + Символы.ПС + Символы.ПС + "Техническая информация:" + Символы.ПС + СообщениеСТехИнформацией;	
	
КонецПроцедуры

Процедура ЗаписатьИнформациюВПротоколОбмена(СтруктураИнформации)
	
	ДатаПоследнегоОбмена = ТекущаяДата();				
	
	НаборЗаписейИстории = РегистрыСведений.ИсторияОбменаДанными.СоздатьНаборЗаписей();
	НаборЗаписейИстории.Отбор.УзелИнформационнойБазы.Установить(НастройкаСсылка);
	НаборЗаписейИстории.Отбор.Период.Установить(ДатаПоследнегоОбмена);
	
	СтрокаИстории = НаборЗаписейИстории.Добавить();
	
	СтрокаИстории.Период = ДатаПоследнегоОбмена;
	СтрокаИстории.УзелИнформационнойБазы = НастройкаСсылка;
	
	
	Если ЗначениеЗаполнено(СтруктураИнформации.ДатаПоследнейЗагрузки) Тогда
		
		СтрокаИстории.ДатаПоследнейЗагрузки = СтруктураИнформации.ДатаПоследнейЗагрузки;	
		СтрокаИстории.ДатаНачалаПоследнейЗагрузки = СтруктураИнформации.ДатаНачалаПоследнейЗагрузки;
		СтрокаИстории.РезультатПоследнейЗагрузки = СтруктураИнформации.РезультатПоследнейЗагрузки;
		
		СтрокаИстории.КомментарийКЗагрузкеДанных = ""; //ОбщегоНазначения.СформироватьТекстСообщения(СокрЛП(СтруктураИнформации.КомментарийКЗагрузкеДанных));
		
		Если Не ПустаяСтрока(СтрокаИстории.КомментарийКЗагрузкеДанных) 
			И Не ПустаяСтрока(СтруктураИнформации.КомментарийКЗагрузкеДанных) Тогда
			
			ДобавитьТехническуюИнформацияВСообщение(СтрокаИстории.КомментарийКЗагрузкеДанных, СтруктураИнформации.КомментарийКЗагрузкеДанных);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураИнформации.ДатаПоследнейВыгрузки) Тогда
		
		СтрокаИстории.ДатаПоследнейВыгрузки = СтруктураИнформации.ДатаПоследнейВыгрузки;	
		СтрокаИстории.ДатаНачалаПоследнейВыгрузки = СтруктураИнформации.ДатаНачалаПоследнейВыгрузки;
		СтрокаИстории.РезультатПоследнейВыгрузки = СтруктураИнформации.РезультатПоследнейВыгрузки;
		
		СтрокаИстории.КомментарийКВыгрузкеДанных = ""; // ОбщегоНазначения.СформироватьТекстСообщения(СокрЛП(СтруктураИнформации.КомментарийКВыгрузкеДанных));
		
		Если Не ПустаяСтрока(СтрокаИстории.КомментарийКВыгрузкеДанных) 
			И Не ПустаяСтрока(СтруктураИнформации.КомментарийКВыгрузкеДанных) Тогда
			
			ДобавитьТехническуюИнформацияВСообщение(СтрокаИстории.КомментарийКВыгрузкеДанных, СтруктураИнформации.КомментарийКВыгрузкеДанных);
			
		КонецЕсли;		
		
	КонецЕсли;	
	
	Попытка
		
		НаборЗаписейИстории.Записать();
		
	Исключение
		
		СообщитьОбОшибке("Возникла ошибка при записи истории обмена данными: " + ОписаниеОшибки());			
		
	КонецПопытки;	
	
КонецПроцедуры

Процедура ОтобразитьСостояние(ТекстСообщения)
	#Если Клиент Тогда
		Состояние(ТекстСообщения);
	#Иначе
		//ЗаписатьВЛог("ОбменССайтом",ТекстСообщения,"Информация"); 	
	#КонецЕсли	
КонецПроцедуры

Процедура ДобавитьТекстКСообщениюДляПользователя(ТекущееСообщение, ДобавляемоеСообщение)
	
	ТекущееСообщение = СокрЛП(ТекущееСообщение + Символы.ПС + ДобавляемоеСообщение);	
	
КонецПроцедуры

Процедура СообщитьПользователю(ТекстСообщения, ИнформацияОВыгрузке, Статус = Неопределено)
	
	//Если ИнформацияОВыгрузке Тогда
	//	ДобавитьТекстКСообщениюДляПользователя(мСтруктураИнформацииИсторииОбмена.КомментарийКВыгрузкеДанных, ТекстСообщения);
	//Иначе
	//	ДобавитьТекстКСообщениюДляПользователя(мСтруктураИнформацииИсторииОбмена.КомментарийКЗагрузкеДанных, ТекстСообщения);
	//КонецЕсли;
	
	#Если Клиент Тогда
		Если Статус = Неопределено Тогда
			Статус = СтатусСообщения.Обычное;	
		КонецЕсли;
		Сообщить(ТекстСообщения, Статус);
	#Иначе
		ЗаписатьВЛог("ОбменССайтом",ТекстСообщения,"Информация");                     
	#КонецЕсли
	
КонецПроцедуры	

// Процедура выводит текст ответа сервера, если в нем имеется
// расширенное описание ошибки (строки, начиная со 2-й)
//
// Параметры:
//  ОтветСервера - строка, текст ответа сервера
//
Процедура СообщитьРасширенноеОписаниеОтветаСервера(ОтветСервера)
	
	ТекстСообщения = "Ответ сервера:" + Символы.ПС;
	
	Если СтрЧислоСтрок(ОтветСервера) > 1 Тогда
		Для ТекСтрока = 2 по СтрЧислоСтрок(ОтветСервера) Цикл
			ТекстСообщения = ТекстСообщения + СтрПолучитьСтроку(ОтветСервера, ТекСтрока) + Символы.ПС;
		КонецЦикла;	
	КонецЕсли;
	
	СообщитьПользователю(ТекстСообщения, Истина, СтатусСообщения.Информация);	
	
КонецПроцедуры	


//// Процедура выводит текст сообщения об ошибке обмена
//// и текст "Обмен не выполнен."
////
//// Параметры:
////  ТекстСообщения - строка, текст сообщения
////
Процедура СообщитьОбОшибкеОбмена(ТекстСообщения, ИнформацияОВыгрузке)
	
	ТекстСообщения = ТекстСообщения + Символы.ПС + "Обмен не выполнен";
	СообщитьПользователю(ТекстСообщения, ИнформацияОВыгрузке, СтатусСообщения.Важное);	
	
КонецПроцедуры	

//// Процедура выводит текст сообщения об исключительной ошибке
////
//// Параметры:
////
Процедура СообщитьОбИсключительнойОшибке(ИнформацияОВыгрузке, ТекстНачалаСообщения =  "", ТекстОкончанияСообщения = "")
	
	
	РасширеннаяИнформацияОбОшибке = ИнформацияОбОшибке();
	ТекстСообщения = "";
	Если ЗначениеЗаполнено(ТекстНачалаСообщения) Тогда
		ТекстСообщения = ТекстНачалаСообщения + Символы.ПС;
	КонецЕсли;	
	ТекстСообщения = ТекстСообщения
	+ "Произошла ошибка: "
	+ РасширеннаяИнформацияОбОшибке.Описание;
	
	Если НЕ Строка(РасширеннаяИнформацияОбОшибке.Причина) = "ИнформацияОбОшибке" Тогда
		ТекстСообщения = ТекстСообщения
		+ ". По причине: "
		+ РасширеннаяИнформацияОбОшибке.Причина;
	КонецЕсли;	
	
	ТекстСообщения = ТекстСообщения + Символы.ПС + ТекстОкончанияСообщения;
	
	СообщитьПользователю(ТекстСообщения, ИнформацияОВыгрузке, СтатусСообщения.Важное);	
	
КонецПроцедуры	



//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ АНАЛИЗА ИЗМЕНЕНИЙ ДАННЫХ

Процедура ЗаполнитьСтруктуруИзмененийДляУзла(УзелПланаОбмена, СтруктураВозврата, ИнформацияОТоварах = Истина)
	
	Если НЕ ЗначениеЗаполнено(УзелПланаОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку();
	
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	
	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, УзелПланаОбмена);
	
	Если ИнформацияОТоварах Тогда
		СтруктураВозврата.НомерСообщенияТовары = ЗаписьСообщения.НомерСообщения;
	Иначе
		СтруктураВозврата.НомерСообщенияЗаказы = ЗаписьСообщения.НомерСообщения;
	КонецЕсли;
	
	// Получение Изменений
	#Если Клиент Тогда
		ОтобразитьСостояние("Выбор изменений ...");
		Счетчик = 0;
	#КонецЕсли
	
	Выборка = ПланыОбмена.ВыбратьИзменения(ЗаписьСообщения.Получатель, ЗаписьСообщения.НомерСообщения); 
	
	Пока Выборка.Следующий() Цикл
		
		#Если Клиент Тогда
			Счетчик = Счетчик + 1;
			Если Счетчик % 100 = 0 Тогда
				ОтобразитьСостояние("Обработано объектов: " + Счетчик);
			КонецЕсли;
		#КонецЕсли
		
		Данные 	  = Выборка.Получить();
		ТипДанных = ТипЗнч(Данные);
		
		Если ТипДанных = Тип("СправочникОбъект.Номенклатура") Тогда
			
			СтруктураВозврата.Товары.Добавить(Данные.Ссылка);
			
		ИначеЕсли ТипДанных = Тип("ДокументОбъект.Заказ") Тогда   //продажа им
			
			СтруктураВозврата.Заказы.Добавить(Данные.Ссылка);	
			//крохин начало 04.02.2013
			//нет такого справочника
			//	ИначеЕсли ТипДанных = Тип("СправочникОбъект.ХранилищеДополнительнойИнформации") Тогда
			
			//		СтруктураВозврата.Картинки.Добавить(Данные.Ссылка);
			//крохин конец 04.02.2013		
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьВсеИзмененияИзПланаОбмена()
	
	СтруктураВозврата = Новый Структура("Товары,Заказы,Картинки,НомерСообщенияТовары,НомерСообщенияЗаказы", 
	Новый Массив(), Новый Массив(), Новый Массив());
	
	Если ОбменТоварами Тогда
		ЗаполнитьСтруктуруИзмененийДляУзла(УзелОбменаТоварами, СтруктураВозврата, Истина);
	КонецЕсли;
	
	//Если ОбменЗаказами Тогда
	//	ЗаполнитьСтруктуруИзмененийДляУзла(УзелОбменаЗаказами, СтруктураВозврата, Ложь);
	//КонецЕсли;
	
	Возврат СтруктураВозврата; 
	
КонецФункции	


//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ УПРАВЛЕНИЯ ОБМЕНОМ ЗАКЗАМИ

Процедура ОчисткаОчередиДокументовНаОтправку()
	
	//МассивИзменений   = Новый Массив;
	//
	//Если ВыгружатьТолькоИзменения И НЕ мПринудительнаяПолнаяВыгрузка Тогда
	//	
	//	//МассивИзменений = СтруктураИзменений.Заказы;
	//	
	//	// из этого массива нужно удалить все только что загруженные заказы
	//	Для Каждого Эл Из мМассивЗагруженныхДокументов Цикл
	//		
	//		ИндексЭлемента = МассивИзменений.Найти(Эл);
	//		Если ИндексЭлемента <> Неопределено Тогда
	//			МассивИзменений.Удалить(ИндексЭлемента);
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//	
	//	Если МассивИзменений.Количество() = 0 Тогда
	//		
	//		СообщитьПользователю("Изменения заказов не зарегистрированы. Выгрузка заказов не произведена.", Истина); 
	//		Возврат;
	//		
	//	КонецЕсли;	
	//	
	//КонецЕсли;

	//ТаблицаДокументов = ПроцедурыОбменаССайтом.ПолучитьЗаказыСОплатойИОтгрузкойПоКатегориямПоРегистру(МассивИзменений, мМассивЗагруженныхДокументов);
	//
	//Для каждого Текстрока из ТаблицаДокументов цикл
	//	
	//	
	//	
	//	
	//	
	//	
	//КонецЦикла;	
	
	
КонецПроцедуры


Функция ВыполнитьОбменЗаказами(СтруктураИзменений)
	
	//возврат истина;	
	
	УспешноВыгружено = истина;
	
	Если НЕ ОпределитьМожноВыгружатьЗаказы() Тогда
		
		СообщитьПользователю("Выгрузка заказов не произведена.", Истина);
		Возврат Истина;
		
	КонецЕсли;
	
	мМассивЗагруженныхДокументов = Новый Массив();
	КоличествоОбработанныхДокументовНаЗагрузке = 0;
	КоличествоОбработанныхДокументовНаВыгрузке = 0;
	
	Если ВыгружатьНаСайт Тогда
		
		HTTPОбменАдресСкрипта = НачалоАдресаСкрипта;
		СтруктураПараметровСайта = ПроцедурыОбменаССайтом.ПолучитьСтруктуруПараметровДляСоединения(ЭтотОбъект);		
		
		мСтруктураИнформацииИсторииОбмена.ДатаПоследнейЗагрузки = Текущаядата();
		УспешноЗагружено = истина;
		
		мСтруктураИнформацииИсторииОбмена.РезультатПоследнейЗагрузки = УспешноЗагружено;
		мСтруктураИнформацииИсторииОбмена.ДатаПоследнейЗагрузки = Текущаядата();
		//   тут мы отгрузки выгружаем только
		УспешноВыгружено = ВыгрузитьЗаказыНаСайт(СтруктураИзменений, СтруктураПараметровСайта, КоличествоОбработанныхДокументовНаВыгрузке);
		
		// тут очистим регистр, если успешно.
				
		УспешноВыгружено = истина;
		
	Иначе
		// ничего не загружаем
	КонецЕсли;	
	
	Успешно = УспешноЗагружено И УспешноВыгружено;
	
	Если Успешно Тогда
		
		Если КоличествоОбработанныхДокументовНаЗагрузке + КоличествоОбработанныхДокументовНаВыгрузке > 0 Тогда
			СообщитьПользователю("Обмен заказами успешно завершен", Истина);
		КонецЕсли;
		
	Иначе
		СообщитьПользователю("Обмен заказами завершен с ошибками!!!", Истина);
	КонецЕсли;
	
	Возврат Успешно;
	
КонецФункции	

// тут только РНК сейчас выгружаются
Функция ВыгрузитьЗаказыНаСайт_ст(СтруктураИзменений, СтруктураПараметровСайта, КоличествоОбработанныхДокументовНаВыгрузке)
	
	//возврат истина;
 	ЗаписатьВЛог("b2b", "3, начало ",,,,);
	КоличествоОбработанныхДокументовНаВыгрузке = 0;
	//
	тСписокЗаказовНаОтправку = неопределено;  // передавать везде этот список
	МассивИзменений = новый Массив;
	
	тСписокЗаказовНаОтправку = ПроцедурыОбменаССайтом.ПолучитьЗаказыСОплатойИОтгрузкойПоКатегориямПоРегистру(МассивИзменений, мМассивЗагруженныхДокументов);
	
	//------------------------------------------------------------------------------------------------------------
	// тут сделаю выгрузку не по обмену заказами, а по обмену Отгрузками, там другой отбор РНК и состав документов
	// зафиксируем все РНК на текущий момент, чтобы отправить и снять регистрацию только с них.
	тСписокЗаказовНаОтправкуОтгрузки = ПроцедурыОбменаССайтом.ПолучитьЗаказыСОплатойИОтгрузкойПоКатегориямПоРегиструЗаказыДляРНК(МассивИзменений, мМассивЗагруженныхДокументов);
	тСписокВсехРНК = ПроцедурыОбменаССайтом.ПолучитьВсеРНКПоРегиструДляВыгрузки(МассивИзменений, мМассивЗагруженныхДокументов);
	
	Успешно = истина;
	
	Если тСписокВсехРНК.количество() =0 тогда
		возврат успешно;
	КонецЕсли;	
	
	
	//-------------------------------------------------------------------------------------
	// скопируем все файлы на фтп
		
	ОчиститьКаталогНаДиске();
	ПутьСохранения = "\\Srv-data\1C_Base\8.1\ExtForms\TEST11\Doc\";
	Попытка
		УдалитьФайлы(ПутьСохранения, "*.*");  
	Исключение
		СообщитьОбИсключительнойОшибке(Истина, "Не удалось очистить каталог обмена! (" + мКаталогНаДиске + ")");
	КонецПопытки;
		
	//----------------------------------------------------------------------------------------
	// сформируем файлы xls по РНК.
	 Для каждого текстрока из тСписокВсехРНК цикл
		// РНК
		РНК = ТекСтрока.Заказссылка;
		
		номеррнк = РНК.номер;
		НомерРНк = СтрЗаменить(НомерРНК,"б","");
		НомерРНк = СтрЗаменить(НомерРНК,"а","");
		НомерРНк = СтрЗаменить(НомерРНК,"-","");
			
		ИдЗаказа = Рнк.докОснование.ИдЗаказа;
		Если ИдЗаказа ="" Тогда
			ИдЗаказа = Рнк.докОснование.НомерЗаказа ;
		КонецЕсли;	
			
		ИмяФайла = "Id_"+ИдЗаказа+"_"+Рнк.НомерЗаказа+"_"+НомерРНК+".xls";
		
				
		// нечаева 20,04,2023++++
		ИмяФайла = СтрЗаменить(ИмяФайла,"/","_");
		ИмяФайла = СтрЗаменить(ИмяФайла,"\","_");
		// нечаева 20,04,2023---

		
		
		
		ИмяФайлаВыгрузки =ПутьСохранения+ИмяФайла; 
		
		ТАБДОК = СформироватьСФ(РНК,,Ложь);
		Если ТабДок<>Неопределено ТОгда
			  
			 # Если клиент тогда
			 	сообщить(""+ИмяФайлаВыгрузки);
			 # конецесли
 
			 ТабДок.Записать(ИмяФайлаВыгрузки, ТипФайлаТабличногоДокумента.XLS);
			 
			 # Если клиент тогда
			 	сообщить("Сохранен - "+ПутьСохранения+ИмяФайла);
			 # конецесли
		КонецЕсли;	
		//    /upload/import/shipment
		ПроцедурыОбменаССайтом.СкопироватьНаFTP(ИмяФайлаВыгрузки,ИмяФайла,"shipment");
	
	КонецЦикла;
	
	ЗаписатьВЛог("b2b", "4. начало ",,,,);

	
	//---------------------------------------------------------------------------------------
	// сформируем хмл файл , со списком РНК и заказов
	ИмяФайлаОбмена 		 = "shipment.xml";  //"1cbitrix-" + Строка(Новый УникальныйИдентификатор) + ".xml";
	ПолноеИмяФайлаОбмена = мКаталогНаДиске + "\" + ИмяФайлаОбмена;
	//!!!!
	#если клиент    тогда
		Сообщить(ПолноеИмяФайлаОбмена);   // для тестов надо
	#конецесли

	ОбъектXML = Новый ЗаписьXML;
	
	Если ПустаяСтрока(ПолноеИмяФайлаОбмена) Тогда
		ОбъектXML.УстановитьСтроку("UTF-8");
	Иначе
		ОбъектXML.ОткрытьФайл(ПолноеИмяФайлаОбмена, "UTF-8"); 
	КонецЕсли;   
	
	ОбъектXML.ЗаписатьОбъявлениеXML();
	ОбъектXML.ЗаписатьНачалоЭлемента("КоммерческаяИнформация");
	ОбъектXML.ЗаписатьАтрибут("ДатаФормирования", Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd'T'ЧЧ:мм:сс"));	
	ОбъектXML.ЗаписатьАтрибут("ВерсияСхемы","2.04.1CBitrix"); 
		       	
	 Для каждого текстрока из тСписокВсехРНК цикл
		// РНК
		РНК = ТекСтрока.Заказссылка;
		
		номеррнк = РНК.номер;
		НомерРНк = СтрЗаменить(НомерРНК,"б","");
		НомерРНк = СтрЗаменить(НомерРНК,"а","");
		НомерРНк = СтрЗаменить(НомерРНК,"-","");

		
		ИдЗаказа = Рнк.докОснование.ИдЗаказа;
		Если ИдЗаказа ="" Тогда
			ИдЗаказа = Рнк.докОснование.НомерЗаказа ;
		КонецЕсли;	
		ИмяФайла = "Id_"+ИдЗаказа+"_"+Рнк.НомерЗаказа+"_"+НомерРНК+".xls";
		
		
		// нечаева 20,04,2023++++
		ИмяФайла = СтрЗаменить(ИмяФайла,"/","_");
		ИмяФайла = СтрЗаменить(ИмяФайла,"\","_");
		// нечаева 20,04,2023---

		
		ОбъектXML.ЗаписатьНачалоЭлемента("Документ");
				
		ЗаписатьТекстовойУзел2(ОбъектXML, "Ид", НомерРнк);
	    ЗаписатьТекстовойУзел2(ОбъектXML, "Статус", "Новый");
		ЗаписатьТекстовойУзел2(ОбъектXML, "Имя", "Заказ Ид"+Рнк.докОснование.номерзаказа+" номер отгрузки - "+РНК.номер+" дата отгрузки "+РНК.датаОтгрузки);
		ЗаписатьТекстовойУзел2(ОбъектXML, "Файл", "/upload/import/shipment/"+ИмяФайла);
		
				
		ОбъектXML.ЗаписатьНачалоЭлемента("Заказы");
		
		
		 ЗапросН = Новый Запрос;
		 попытка
			 ЗапросН.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			 |	РасходнаяНакладнаяЗаказы.Заказ КАК Заказ
			 |ИЗ
			 |	Документ.РасходнаяНакладная.Заказы КАК РасходнаяНакладнаяЗаказы
			 |ГДЕ
			 |	РасходнаяНакладнаяЗаказы.Ссылка = &текрнк
			 |
			 |ОБЪЕДИНИТЬ ВСЕ
			 |
			 |ВЫБРАТЬ
			 |	РасходнаяНакладная.ДокОснование
			 |ИЗ
			 |	Документ.РасходнаяНакладная КАК РасходнаяНакладная
			 |ГДЕ
			 |	РасходнаяНакладная.Ссылка = &текРНК";
			 ЗапросН.УстановитьПараметр("текРНК",РНК); 
			 ТЗ = ЗапросН.Выполнить().Выгрузить();
		 исключение
			 
			 ЗапросН.Текст = "ВЫБРАТЬ 
			 |
			 |	РасходнаяНакладная.ДокОснование как заказ
			 |ИЗ
			 |	Документ.РасходнаяНакладная КАК РасходнаяНакладная
			 |ГДЕ
			 |	РасходнаяНакладная.Ссылка = &текРНК";
			 ЗапросН.УстановитьПараметр("текРНК",РНК); 
			 ТЗ = ЗапросН.Выполнить().Выгрузить();
			 
		 конецпопытки;
		 
		 ТЗ.Свернуть("Заказ");
			 
		 
		 Для каждого текстрока из ТЗ цикл 
					 
			 //ОбъектXML.ЗаписатьНачалоЭлемента("Заказ");                                       
			 ИдЗаказа = ТекСтрока.заказ.ИдЗаказа;
			 Если ИдЗаказа ="" Тогда
				 ИдЗаказа = ТекСтрока.заказ.НомерЗаказа ;
			 КонецЕсли;	
			 ЗаписатьТекстовойУзел(ОбъектXML, "Заказ", ИдЗаказа);
						 
			 //ОбъектXML.ЗаписатьКонецЭлемента();  // заказ
		 конецЦикла;
		 			 
		 ОбъектXML.ЗаписатьКонецЭлемента();  // заказы

		 ОбъектXML.ЗаписатьКонецЭлемента();  // документ

    	//---------------------------------------------------------------------------------------------------------
		
	КонецЦикла;
	
	//ОбъектXML.ЗаписатьКонецЭлемента();
	ОбъектXML.ЗаписатьКонецЭлемента();

    ОбъектXML.Закрыть();
	// скопируем его на фтп, туда же.
	ПроцедурыОбменаССайтом.СкопироватьНаFTP(ПолноеИмяФайлаОбмена,ИмяФайлаОбмена,"shipment");

	
	//------------------------------------------------------------------------------------------
	// передадим команду, прикрепить по заказам файлы
	//  https://test.collant.ru/local/crons/import/shipment.php
	
	команда = "local/crons/import/shipment.php"; 
	КомандаЗагрузки(СтруктураПараметровСайта,команда);
	
	//------------------------------------------------------------------------------------------
	// очистить документы на выгрузку.
	ЗаписатьВЛог("b2b", "5. начало ",,,,);

	ОчиститьКаталогНаДиске();
	// поменяем статус на отгружено! у заказа и у рнк 
	Если успешно тогда
		
		ОчиститьСписокРНКНаВыгрузку(тСписокЗаказовНаОтправкуОтгрузки,ТСписокВсехРНК);
				
	конецЕсли;	
	ЗаписатьВЛог("b2b", "6. начало ",,,,);
	
	ТСписокЗаказовНаВыгрузку= новый ТаблицаЗначений;
	тСписокЗаказовНаОтправку = новый ТаблицаЗначений;
	ТСписокВсехРНК  = новый ТаблицаЗначений;
	             
	Возврат Успешно;
	

	
	//// старый вариант с выгрузкой файлов. 
	//Успешно = ВыгрузитьЗаказыВФайлДляОтгрузок(СтруктураИзменений, СтруктураПараметровСайта, КоличествоОбработанныхДокументовНаВыгрузке);  // 
	//Успешно=Истина;
	//
	//Если Не Успешно	Тогда
	//	Возврат Ложь;
	//ИначеЕсли КоличествоОбработанныхДокументовНаВыгрузке = 0 Тогда
	//	Возврат Истина;
	//КонецЕсли;
	////
	//Успешно = HTTPВыгрузитьНаСервер(СтруктураПараметровСайта, , , "sale");
	//ОчиститьКаталогНаДиске();
	//
	//// поменяем статус на отгружено! у заказа и у рнк 
	//Если успешно тогда
	//	
	//	ОчиститьСписокРНКНаВыгрузку(тСписокЗаказовНаОтправкуОтгрузки,ТСписокВсехРНК);
	//			
	//конецЕсли;	
	//	
	//ТСписокЗаказовНаВыгрузку= новый ТаблицаЗначений;
	//тСписокЗаказовНаОтправку = новый ТаблицаЗначений;
	//ТСписокВсехРНК  = новый ТаблицаЗначений;
	//             
	//Возврат Успешно;
	
КонецФункции


// 25,09,23+++ нечаева
Функция ВыгрузитьЗаказыНаСайт(СтруктураИзменений, СтруктураПараметровСайта, КоличествоОбработанныхДокументовНаВыгрузке)
	
	//возврат истина;
	ЗаписатьВЛог("b2b", "3, начало ",,,,);
	КоличествоОбработанныхДокументовНаВыгрузке = 0;
	//
	тСписокЗаказовНаОтправку = неопределено;  // передавать везде этот список
	МассивИзменений = новый Массив;
	
	тСписокЗаказовНаОтправку = ПроцедурыОбменаССайтом.ПолучитьЗаказыСОплатойИОтгрузкойПоКатегориямПоРегистру(МассивИзменений, мМассивЗагруженныхДокументов);
	
	//------------------------------------------------------------------------------------------------------------
	// тут сделаю выгрузку не по обмену заказами, а по обмену Отгрузками, там другой отбор РНК и состав документов
	// зафиксируем все РНК на текущий момент, чтобы отправить и снять регистрацию только с них.
	тСписокЗаказовНаОтправкуОтгрузки = ПроцедурыОбменаССайтом.ПолучитьЗаказыСОплатойИОтгрузкойПоКатегориямПоРегиструЗаказыДляРНК(МассивИзменений, мМассивЗагруженныхДокументов);
	тСписокВсехРНК_ПРМ = ПроцедурыОбменаССайтом.ПолучитьВсеРНКПоРегиструДляВыгрузки(МассивИзменений, мМассивЗагруженныхДокументов);
	
	Успешно = истина;
	
	Если тСписокВсехРНК_ПРМ.количество() =0 тогда
		возврат успешно;
	КонецЕсли;	
	
	
	//-------------------------------------------------------------------------------------
	// скопируем все файлы на фтп
	
	ОчиститьКаталогНаДиске();
	//ПутьСохранения = "\\Srv-data\1C_Base\8.1\ExtForms\TEST11\TEST_Distr\нечаева\dok\";
	ПутьСохранения = "\\Srv-data\1C_Base\8.1\ExtForms\TEST11\Doc\";

	Попытка
		УдалитьФайлы(ПутьСохранения, "*.*");  
	Исключение
		СообщитьОбИсключительнойОшибке(Истина, "Не удалось очистить каталог обмена! (" + мКаталогНаДиске + ")");
	КонецПопытки;
	
	//----------------------------------------------------------------------------------------
	// сформируем файлы xls по РНК.
	//++Данилова Е.В. 11.09.2024
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);//++Данилова Е.В. 29.04.2025 ASU-2239
	
	АдресФТП = НастройкаСсылка.FTPОбменАдресСайта;
	ЛогинФТП = НастройкаСсылка.FTPОбменЛогин;
	ПарольФТП = НастройкаСсылка.FTPОбменПароль;
	//--Данилова Е.В. 11.09.2024
	Для каждого текстрока из тСписокВсехРНК_ПРМ цикл
		// РНК
		РНК = ТекСтрока.Заказссылка;
		ВидОбъекта	= РНК.Метаданные().Имя;
		
		
		Если  ВидОбъекта = "РасходнаяНакладная" Тогда
			
			//Если РНК тогда
			
			номеррнк = РНК.номер;
			НомерРНк = СтрЗаменить(НомерРНК,"б","");
			НомерРНк = СтрЗаменить(НомерРНК,"а","");
			НомерРНк = СтрЗаменить(НомерРНК,"-","");
			
			//++Данилова Е.В. 06.12.2024
			
			//ИдЗаказа = Рнк.докОснование.ИдЗаказа;
			//Если ИдЗаказа ="" Тогда
			//	ИдЗаказа = Рнк.докОснование.НомерЗаказа ;
			//КонецЕсли;
			
			ЗаказыМассив = ПроцедурыОбменаССайтом.ПолучитьЗаказыПоРНК(РНК);
			
			Для каждого ЗаказИзМассива Из ЗаказыМассив Цикл
				
				Если  НЕ ЗначениеЗаполнено(ЗаказИзМассива.ИдЗаказа) Тогда
					
					ИдЗаказа = ЗаказИзМассива.НомерЗаказа; 
				Иначе 
					ИдЗаказа = ЗаказИзМассива.ИдЗаказа;
				КонецЕсли; 					
				
				
				ИмяФайла = "Id_"+ИдЗаказа+"_"+Рнк.НомерЗаказа+"_"+НомерРНК+".xls";
				
				
				// нечаева 20,04,2023++++
				ИмяФайла = СтрЗаменить(ИмяФайла,"/","_");
				ИмяФайла = СтрЗаменить(ИмяФайла,"\","_");
				// нечаева 20,04,2023---
				
				ИмяФайлаВыгрузки =ПутьСохранения+ИмяФайла; 
				//++Данилова Е.В. 11.09.2024
				Попытка
					//--Данилова Е.В. 11.09.2024
					ТАБДОК = СформироватьСФ(РНК,,Ложь,ЗаказИзМассива); 				
					
					Если ТабДок<>Неопределено ТОгда
						
						# Если клиент тогда
							сообщить(""+ИмяФайлаВыгрузки);
						# конецесли
						
						ТабДок.Записать(ИмяФайлаВыгрузки, ТипФайлаТабличногоДокумента.XLS);
						
						# Если клиент тогда
							сообщить("Сохранен - "+ПутьСохранения+ИмяФайла);
						# конецесли
					КонецЕсли;
					//++Данилова Е.В. 11.09.2024
				Исключение
					Если ТранзакцияАктивна() Тогда
						
						ОтменитьТранзакцию();
						
					КонецЕсли;
				КонецПопытки;
				//--Данилова Е.В. 11.09.2024
			КонецЦикла;
			//--Данилова Е.В. 09.12.2024
		иначе
			
			// это перемещение  
			номеррнк = РНК.номер;
			НомерРНк = СтрЗаменить(НомерРНК,"б","");
			НомерРНк = СтрЗаменить(НомерРНК,"а","");
			НомерРНк = СтрЗаменить(НомерРНК,"-","");
			
			ИдЗаказа = Рнк.докОснование.ИдЗаказа;
			Если ИдЗаказа ="" Тогда
				ИдЗаказа = Рнк.докОснование.НомерЗаказа;
			КонецЕсли;	
			
			ИмяФайла = "Id_"+ИдЗаказа+"_"+Рнк.докОснование.НомерЗаказа+"_"+НомерРНК+".xls";
			
			
			// нечаева 20,04,2023++++
			ИмяФайла = СтрЗаменить(ИмяФайла,"/","_");
			ИмяФайла = СтрЗаменить(ИмяФайла,"\","_");
			// нечаева 20,04,2023---
			
			ИмяФайлаВыгрузки =ПутьСохранения+ИмяФайла; 
			//++Данилова Е.В. 11.09.2024
			Попытка
				//--Данилова Е.В. 11.09.2024
				ТАБДОК = СформироватьНакладную(РНК,);
				Если ТабДок<>Неопределено ТОгда
					
					# Если клиент тогда
						сообщить(""+ИмяФайлаВыгрузки);
					# конецесли
					
					ТабДок.Записать(ИмяФайлаВыгрузки, ТипФайлаТабличногоДокумента.XLS);
					
					# Если клиент тогда
						сообщить("Сохранен - "+ПутьСохранения+ИмяФайла);
					# конецесли
				КонецЕсли;	
				
				//++Данилова Е.В. 11.09.2024
			Исключение
				Если ТранзакцияАктивна() Тогда
				 
				 	 ОтменитьТранзакцию();
				 
				 КонецЕсли;
			КонецПопытки;
			   //--Данилова Е.В. 11.09.2024
		конецЕсли;
		
		
		СкопироватьВ_архив22("XLS\"); 
	
		//----------------------------------------------------------
		// временно для тестирования
		//++Данилова Е.В. 11.09.2024
		//ПроцедурыОбменаССайтом.СкопироватьНаFTP(ИмяФайлаВыгрузки,ИмяФайла,"shipment");
		ПроцедурыОбменаССайтом.СкопироватьНаFTP(ИмяФайлаВыгрузки,ИмяФайла,"shipment",АдресФТП,ЛогинФТП,ПарольФТП);
		//--Данилова Е.В. 11.09.2024
		
	КонецЦикла;
	//++Данилова Е.В. 11.09.2024
	Если ТранзакцияАктивна() Тогда
		
		ЗафиксироватьТранзакцию();
		
	КонецЕсли;
	//--Данилова Е.В. 11.09.2024
	
	ЗаписатьВЛог("b2b", "4. начало ",,,,);
	
		
	//---------------------------------------------------------------------------------------
	// сформируем хмл файл , со списком РНК и заказов
	ИмяФайлаОбмена 		 = "shipment.xml";  //"1cbitrix-" + Строка(Новый УникальныйИдентификатор) + ".xml";
	ПолноеИмяФайлаОбмена = мКаталогНаДиске + "\" + ИмяФайлаОбмена;
	//!!!!
	#если клиент    тогда
		Сообщить(ПолноеИмяФайлаОбмена);   // для тестов надо
	#конецесли
	
	ОбъектXML = Новый ЗаписьXML;
	
	Если ПустаяСтрока(ПолноеИмяФайлаОбмена) Тогда
		ОбъектXML.УстановитьСтроку("UTF-8");
	Иначе
		ОбъектXML.ОткрытьФайл(ПолноеИмяФайлаОбмена, "UTF-8"); 
	КонецЕсли;   
	
	ОбъектXML.ЗаписатьОбъявлениеXML();
	ОбъектXML.ЗаписатьНачалоЭлемента("КоммерческаяИнформация");
	ОбъектXML.ЗаписатьАтрибут("ДатаФормирования", Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd'T'ЧЧ:мм:сс"));	
	ОбъектXML.ЗаписатьАтрибут("ВерсияСхемы","2.04.1CBitrix"); 
	
	Для каждого текстрока из тСписокВсехРНК_ПРМ цикл
		// РНК
		РНК = ТекСтрока.Заказссылка;
		ВидОбъекта	= РНК.Метаданные().Имя;
		
		
		Если  ВидОбъекта = "РасходнаяНакладная" Тогда
			
			
			номеррнк = РНК.номер;
			НомерРНк = СтрЗаменить(НомерРНК,"б","");
			НомерРНк = СтрЗаменить(НомерРНК,"а","");
			НомерРНк = СтрЗаменить(НомерРНК,"-","");
			
			
			//ИдЗаказа = Рнк.докОснование.ИдЗаказа;
			//Если ИдЗаказа ="" Тогда
			//	ИдЗаказа = Рнк.докОснование.НомерЗаказа ;
			//КонецЕсли;
			
			ЗаказыМассив = ПроцедурыОбменаССайтом.ПолучитьЗаказыПоРНК(РНК);
			Для каждого ЗаказИзМассива  Из ЗаказыМассив Цикл
				
				Если  НЕ ЗначениеЗаполнено(ЗаказИзМассива.ИдЗаказа) Тогда
					
					ИдЗаказа = ЗаказИзМассива.НомерЗаказа; 
				Иначе 
					ИдЗаказа = ЗаказИзМассива.ИдЗаказа;
				КонецЕсли; 	
				
				//КонецЦикла;
				ИмяФайла = "Id_"+ИдЗаказа+"_"+Рнк.НомерЗаказа+"_"+НомерРНК+".xls";
				
				
				// нечаева 20,04,2023++++
				ИмяФайла = СтрЗаменить(ИмяФайла,"/","_");
				ИмяФайла = СтрЗаменить(ИмяФайла,"\","_");
				// нечаева 20,04,2023---
				
				
				ОбъектXML.ЗаписатьНачалоЭлемента("Документ");
				
				ЗаписатьТекстовойУзел2(ОбъектXML, "Ид", НомерРнк);
				ЗаписатьТекстовойУзел2(ОбъектXML, "Статус", "Новый");
				ЗаписатьТекстовойУзел2(ОбъектXML, "Имя", "Заказ Ид"+ЗаказИзМассива.номерзаказа+" номер отгрузки - "+РНК.номер+" дата отгрузки "+Формат(РНК.датаОтгрузки, "ДЛФ=D"));
				ЗаписатьТекстовойУзел2(ОбъектXML, "Файл", "/upload/import/shipment/"+ИмяФайла);
				
				
				ОбъектXML.ЗаписатьНачалоЭлемента("Заказы");
				
				
				ЗапросН = Новый Запрос;
				попытка
					//++Данилова Е.В. 09.12.2024
					//ЗапросН.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
					//|	РасходнаяНакладнаяЗаказы.Заказ КАК Заказ
					//|ИЗ
					//|	Документ.РасходнаяНакладная.Заказы КАК РасходнаяНакладнаяЗаказы
					//|ГДЕ
					//|	РасходнаяНакладнаяЗаказы.Ссылка = &текрнк
					//|
					//|ОБЪЕДИНИТЬ ВСЕ
					//|
					//|ВЫБРАТЬ
					//|	РасходнаяНакладная.ДокОснование
					//|ИЗ
					//|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
					//|ГДЕ
					//|	РасходнаяНакладная.Ссылка = &текРНК ";
					ЗапросН.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
					                |	РасходнаяНакладнаяЗаказы.Ссылка КАК Заказ
					                |ИЗ
					                |	Документ.Заказ.РасходныеНакладные КАК РасходнаяНакладнаяЗаказы
					                |ГДЕ
					                |	РасходнаяНакладнаяЗаказы.Документ = &текрнк
					                |
					                |ОБЪЕДИНИТЬ ВСЕ
					                |
					                |ВЫБРАТЬ
					                |	РасходнаяНакладная.ДокОснование
					                |ИЗ
					                |	Документ.РасходнаяНакладная КАК РасходнаяНакладная
					                |ГДЕ
					                |	РасходнаяНакладная.Ссылка = &текРНК
					                |	И РасходнаяНакладная.ДокОснование ССЫЛКА Документ.Заказ";
					//--Данилова Е.В. 09.12.2024
					ЗапросН.УстановитьПараметр("текРНК",РНК); 
					ТЗ = ЗапросН.Выполнить().Выгрузить();
				исключение
					
					ЗапросН.Текст = "ВЫБРАТЬ
					                |	РасходнаяНакладная.ДокОснование КАК заказ
					                |ИЗ
					                |	Документ.РасходнаяНакладная КАК РасходнаяНакладная
					                |ГДЕ
					                |	РасходнаяНакладная.Ссылка = &текРНК
									//++Данилова Е.В. 09.12.2024
					                |	И РасходнаяНакладная.ДокОснование ССЫЛКА Документ.Заказ";
					ЗапросН.УстановитьПараметр("текРНК",РНК); 
					ТЗ = ЗапросН.Выполнить().Выгрузить();
					
				конецпопытки;
				
				ТЗ.Свернуть("Заказ");
				
				
				Для каждого текстрока из ТЗ цикл 
					
					//ОбъектXML.ЗаписатьНачалоЭлемента("Заказ");                                       
					ИдЗаказа = ТекСтрока.заказ.ИдЗаказа;
					Если ИдЗаказа ="" Тогда
						ИдЗаказа = ТекСтрока.заказ.НомерЗаказа ;
					КонецЕсли;	
					ЗаписатьТекстовойУзел(ОбъектXML, "Заказ", ИдЗаказа);
					
					//ОбъектXML.ЗаписатьКонецЭлемента();  // заказ
				конецЦикла;
				
				ОбъектXML.ЗаписатьКонецЭлемента();  // заказы
				
				ОбъектXML.ЗаписатьКонецЭлемента();  // документ
				
			КонецЦикла;
		иначе
			//--------------------------------------------------------------
			//для перем
			
			
			номеррнк = РНК.номер;
			НомерРНк = СтрЗаменить(НомерРНК,"б","");
			НомерРНк = СтрЗаменить(НомерРНК,"а","");
			НомерРНк = СтрЗаменить(НомерРНК,"-","");
			
			
			ИдЗаказа = Рнк.докОснование.ИдЗаказа;
			Если ИдЗаказа ="" Тогда
				ИдЗаказа = Рнк.докОснование.НомерЗаказа; //Заказа ;
			КонецЕсли;	                                 // номер заказа  - номер прм
			ИмяФайла = "Id_"+ИдЗаказа+"_"+Рнк.ДокОснование.НомерЗаказа+"_"+НомерРНК+".xls";
			
			
			// нечаева 20,04,2023++++
			ИмяФайла = СтрЗаменить(ИмяФайла,"/","_");
			ИмяФайла = СтрЗаменить(ИмяФайла,"\","_");
			// нечаева 20,04,2023---
			
			
			ОбъектXML.ЗаписатьНачалоЭлемента("Документ");
			
			ЗаписатьТекстовойУзел2(ОбъектXML, "Ид", НомерРнк);
			ЗаписатьТекстовойУзел2(ОбъектXML, "Статус", "Новый");
			ЗаписатьТекстовойУзел2(ОбъектXML, "Имя", "Заказ Ид"+Рнк.докОснование.номерзаказа+" номер отгрузки - "+РНК.номер+" дата отгрузки "+Формат(РНК.датаОтгрузки, "ДЛФ=D"));
			ЗаписатьТекстовойУзел2(ОбъектXML, "Файл", "/upload/import/shipment/"+ИмяФайла);
			
			
			ОбъектXML.ЗаписатьНачалоЭлемента("Заказы");
			
			
			
			ИдЗаказа = РНК.ДокОснование.ИдЗаказа;
			Если ИдЗаказа ="" Тогда
				ИдЗаказа = РНК.ДокОснование.НомерЗаказа;
			КонецЕсли;	
			ЗаписатьТекстовойУзел(ОбъектXML, "Заказ", ИдЗаказа);
			
			
			
			ОбъектXML.ЗаписатьКонецЭлемента();  // заказы
			
			ОбъектXML.ЗаписатьКонецЭлемента();  // документ
		конецЕсли;
		//---------------------------------------------------------------------------------------------------------
		
	КонецЦикла;
	
	
	//ОбъектXML.ЗаписатьКонецЭлемента();
	ОбъектXML.ЗаписатьКонецЭлемента();
	
	ОбъектXML.Закрыть();
	// скопируем его на фтп, туда же. 
	
		
	
	
	//временно
	//++Данилова Е.В. 11.09.2024
		//ПроцедурыОбменаССайтом.СкопироватьНаFTP(ПолноеИмяФайлаОбмена,ИмяФайлаОбмена,"shipment");
		ПроцедурыОбменаССайтом.СкопироватьНаFTP(ПолноеИмяФайлаОбмена,ИмяФайлаОбмена,"shipment",АдресФТП,ЛогинФТП,ПарольФТП);
		//--Данилова Е.В. 11.09.2024
		СкопироватьВ_архив("XLS\"); 

		
		//------------------------------------------------------------------------------------------
		// передадим команду, прикрепить по заказам файлы
		//  https://test.collant.ru/local/crons/import/shipment.php
		
		команда = "local/crons/import/shipment.php"; 
		КомандаЗагрузки(СтруктураПараметровСайта,команда);
		
		//------------------------------------------------------------------------------------------
		// очистить документы на выгрузку.
		ЗаписатьВЛог("b2b", "5. начало ",,,,);
	
		ОчиститьКаталогНаДиске();
		// поменяем статус на отгружено! у заказа и у рнк 
		Если успешно тогда
			
			ОчиститьСписокРНКНаВыгрузку(тСписокЗаказовНаОтправкуОтгрузки,ТСписокВсехРНК_ПРМ);
					
		конецЕсли;	
	
	
	
	ЗаписатьВЛог("b2b", "6. начало ",,,,);
	
	ТСписокЗаказовНаВыгрузку= новый ТаблицаЗначений;
	тСписокЗаказовНаОтправку = новый ТаблицаЗначений;
	ТСписокВсехРНК  = новый ТаблицаЗначений;
	
	Возврат Успешно;
	
	
	
	//// старый вариант с выгрузкой файлов. 
	//Успешно = ВыгрузитьЗаказыВФайлДляОтгрузок(СтруктураИзменений, СтруктураПараметровСайта, КоличествоОбработанныхДокументовНаВыгрузке);  // 
	//Успешно=Истина;
	//
	//Если Не Успешно	Тогда
	//	Возврат Ложь;
	//ИначеЕсли КоличествоОбработанныхДокументовНаВыгрузке = 0 Тогда
	//	Возврат Истина;
	//КонецЕсли;
	////
	//Успешно = HTTPВыгрузитьНаСервер(СтруктураПараметровСайта, , , "sale");
	//ОчиститьКаталогНаДиске();
	//
	//// поменяем статус на отгружено! у заказа и у рнк 
	//Если успешно тогда
	//	
	//	ОчиститьСписокРНКНаВыгрузку(тСписокЗаказовНаОтправкуОтгрузки,ТСписокВсехРНК);
	//			
	//конецЕсли;	
	//	
	//ТСписокЗаказовНаВыгрузку= новый ТаблицаЗначений;
	//тСписокЗаказовНаОтправку = новый ТаблицаЗначений;
	//ТСписокВсехРНК  = новый ТаблицаЗначений;
	//             
	//Возврат Успешно;
	
КонецФункции



//нечаева 21,09,22++
Процедура СкопироватьВ_архив(ДопИмя="")

	возврат;
	
	ИмяФайла = ""+Год(ТекущаяДата())+"_"+месяц(ТекущаяДата())+"_"+День(ТекущаяДата())+"_"+Час(ТекущаяДата())+"_"+минута(ТекущаяДата());
    НовыйАрхив = Новый ЗаписьZipФайла(
        "\\srvfiles\b2b_files\TEST_DISTR\"+ДопИмя+ИмяФайла+".zip",
        "", 
        "архив изменений данных для б2б товары", // комментарий к архиву
        МетодСжатияZIP.Сжатие, 
		УровеньСжатияZIP.Оптимальный,
        МетодШифрованияZIP.Zip20
    );
 
  
	//НовыйАрхив.Добавить(
	//    "c:\readme.txt" // указываем полный путь к файлу
	//);
 
     
     // А что если в "c:\work" находится другая папка, в которой
    // в свою очередь тоже есть txt файлы. Чтобы обработать
    // и эти файлы наш предыдущий пример следует изменить вот так:    
 
    НовыйАрхив.Добавить(
        мКаталогНаДиске+"\*.xml", // указываем маску к файлам
        РежимСохраненияПутейZIP.СохранятьОтносительныеПути,
        РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно
    );
       
     Попытка
		НовыйАрхив.Записать();
	Исключение
	КонецПопытки;
	
	
	
конецПроцедуры

//нечаева 21,09,22++
Процедура СкопироватьВ_архив22(ДопИмя="")

	возврат;
	
	ИмяФайла = ""+Год(ТекущаяДата())+"_"+месяц(ТекущаяДата())+"_"+День(ТекущаяДата())+"_"+Час(ТекущаяДата())+"_111_"+минута(ТекущаяДата());
    НовыйАрхив = Новый ЗаписьZipФайла(
        "\\srvfiles\b2b_files\TEST_DISTR\"+ДопИмя+ИмяФайла+".zip",
        "", 
        "архив изменений данных для б2б товары", // комментарий к архиву
        МетодСжатияZIP.Сжатие, 
		УровеньСжатияZIP.Оптимальный,
        МетодШифрованияZIP.Zip20
    );
 
  
	//НовыйАрхив.Добавить(
	//    "c:\readme.txt" // указываем полный путь к файлу
	//);
 
     
     // А что если в "c:\work" находится другая папка, в которой
    // в свою очередь тоже есть txt файлы. Чтобы обработать
    // и эти файлы наш предыдущий пример следует изменить вот так:    
    КАт = "\\Srv-data\1C_Base\8.1\ExtForms\TEST11\TEST_Distr\нечаева\dok\";   // мКаталогНаДиске   \\Srv-data\1C_Base\8.1\ExtForms\TEST11\TEST_Distr\нечаева\dok\
    НовыйАрхив.Добавить(
       КАт+"\*.*", // указываем маску к файлам
        РежимСохраненияПутейZIP.СохранятьОтносительныеПути,
        РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно
    );
       
    НовыйАрхив.Записать();
	
	
	
конецПроцедуры






//процедура СкопироватьНаFTP(ИмяФайла,КраткоеИмя,ИмяПапкиНаСервере="catalog")
//	//----------------------------------------------
//	//	 переносим автоматом на их фтп - сервер
//	//----------------------------------------------
//	
//	Попытка
//			
//		Сервер=Новый FTPСоединение("212.109.217.46",,"1c_collant","pB4lB6fK5hxC5b"); 
//		
//	Исключение
//		КритичОшибки.Добавить("Файл не передан на ФТП"+ОписаниеОшибки());
//		СообщитьПользователю("Файл не передан на ФТП"+ОписаниеОшибки(),,);
//		
//		Возврат;
//	КонецПопытки;
//			
//	
//	Попытка
//		Сервер.Записать(ИмяФайла,"/"+ИмяПапкиНаСервере+"/"+КраткоеИмя);
//	Исключение
//		КритичОшибки.Добавить("Файл не передан на ФТП  "+ОписаниеОшибки() );
//		СообщитьПользователю("Файл не передан на ФТП"+ОписаниеОшибки(),,);

//	КонецПопытки;
//		
//		
//	Сервер=Неопределено;
//		
//		
//КонецПроцедуры


//----------------------------------------------
Функция КомандаЗагрузки(СтруктураПараметровСайта, команда)

	ОтветСервера = Неопределено;
	ИмяФайлаОтвета = ПолучитьИмяВременногоФайла();
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".txt");
	
	АдресТ = СтруктурапараметровСайта.Сервер; //"test.collant.ru" ;   
	попытка 
		Соединение = Новый HTTPСоединение(АдресТ,443,СтруктураПараметровСайта.ИмяПользователя,СтруктураПараметровСайта.Пароль,,,Новый ЗащищенноеСоединениеOpenSSL);  // логин  пароль сюда пропсиать
	исключение
		//Сообщить(ОписаниеОшибки());
	конецПопытки;
		
	//команда = "local/crons/import/catalog.php?";   
		
	HTTPзапрос = новый HTTPзапрос();
	HTTPзапрос.АдресРесурса = Команда;
	
	// формируем файл для отправки
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".txt");
		
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json");
	ЗаголовокHTTP.Вставить("Accept", "text/xml");
	ЗаголовокHTTP.Вставить("Accept-Language", "ru");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("Content-Language", "ru");
	ЗаголовокHTTP.Вставить("Content-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("Host", СтруктурапараметровСайта.Сервер); //"test.collant.ru");
	
	HTTPзапрос.Заголовки = ЗаголовокHTTP;

	//Ответ = Соединение.Получить(HTTP_запрос);  // ИмяВыходногоФайла
	
	попытка
		Соединение.Получить(HTTPзапрос, ИмяВременногоФайла);   
	исключение
		СообщитьПользователю("Ошибка отправки Файла по количеству товаров. "+ОписаниеОшибки(),истина);
	конецПопытки;
		
	ФайлОтвета = Новый Файл(ИмяВременногоФайла);
	ОтветСервера = неопределено;
	
	Если ФайлОтвета.Существует() Тогда
		
		ТекстОтвета = Новый ТекстовыйДокумент();
		ТекстОтвета.Прочитать(ИмяВременногоФайла);
		Если ТекстОтвета.КоличествоСтрок()>0 Тогда
			ОтветСервера = ТекстОтвета.ПолучитьТекст();	
		Иначе
			// если пустой ответ, то все прогрузилось
			//СообщитьПользователю("Файл по количеству товаров отправлен.",истина);
		КонецЕсли;	
		
	Иначе	
		//СообщитьПользователю("Отправка файла на сервер: Ответ сервера не получен.", Истина); 
	КонецЕсли;	
//	сообщить(ОтветСервера);
	//
	//
	//Попытка
	//	УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайлаОтвета);   
	//Исключение
	//КонецПопытки;

	возврат ОтветСервера;	
	

конецФункции
//------------------------------------------------------------------------------------------------------------------





Процедура ОчиститьСписокЗаказовНаВыгрузку(СписокЗаказов)
	
	Для каждого текстрока из СписокЗаказов цикл
		
		Докссылка = ТекСтрока.Заказссылка;
		попытка
			НаборЗаписей = РегистрыСведений.РегистрацияОбменаЗаказамиb2b.СоздатьНаборЗаписей(); 
			НаборЗаписей.Отбор.Документ.Установить(ДокСсылка); 
			Наборзаписей.Записать(); // очистим предыдущую запись
			
			НоваяЗапись = НаборЗаписей.Добавить(); 
			
			НоваяЗапись.НомерЗаказа = СокрЛП(ДокСсылка.НомерЗаказа);
			НоваяЗапись.датаЗаказа  = ДокСсылка.ДатаЗаказа;
			Новаязапись.Документ = ДокСсылка;
			новаязапись.НужноОтправить = ложь;
			новаязапись.дата = ТекущаяДата();
			новаязапись.СтатусОтправки = ДокСсылка.состояниеСогласования;
			
			НаборЗаписей.Записать();
			
		исключение
		конецПопытки;
		
	КонецЦикла;
	
	
КонецПроцедуры



Функция ЗагрузитьЗаказыИзФайла(КоличествоОбработанныхДокументов)
	
	КоличествоОбработанныхДокументов = 0;
	
	Файл = Новый Файл(ФайлЗагрузки);
	Если НЕ Файл.Существует()
		ИЛИ Файл.ЭтоКаталог() Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	мСтруктураИнформацииИсторииОбмена.ДатаПоследнейЗагрузки = Текущаядата();
	
	ФайлCML = Новый ТекстовыйДокумент;
	ФайлCML.Прочитать(ФайлЗагрузки);
	СтрокаCML = ФайлCML.ПолучитьТекст();
	ДеревоДокументов = РазобратьCML(СтрокаCML);
	
	Если ДеревоДокументов = Неопределено Тогда
		
		мСтруктураИнформацииИсторииОбмена.РезультатПоследнейЗагрузки = Истина;
		мСтруктураИнформацииИсторииОбмена.ДатаПоследнейЗагрузки = Текущаядата();
		Возврат Истина;
		
	КонецЕсли;
	
	Успешно = ОбработатьДокументы(ДеревоДокументов, КоличествоОбработанныхДокументов);
	Если НЕ Успешно Тогда 
		СообщитьОбОшибкеОбмена("Не удалось обработать документы, загруженные из файла.", Ложь);		
	КонецЕсли;	
	
	мСтруктураИнформацииИсторииОбмена.РезультатПоследнейЗагрузки = Успешно;
	мСтруктураИнформацииИсторииОбмена.ДатаПоследнейЗагрузки = Текущаядата();
	
	Возврат Успешно;
	
КонецФункции	

Функция ВыгрузитьЗаказыВФайл(СтруктураИзменений, СтруктураПараметровСайта, КоличествоВыгруженныхЗаказов = 0)
	
	//возврат истина;
	Успешно = Истина;
	КоличествоВыгруженныхЗаказов = 0;
	
	МассивИзменений   = Новый Массив;
	
	Если ВыгружатьТолькоИзменения И НЕ мПринудительнаяПолнаяВыгрузка Тогда
		
		МассивИзменений = СтруктураИзменений.Заказы;
		
		// из этого массива нужно удалить все только что загруженные заказы
		Для Каждого Эл Из мМассивЗагруженныхДокументов Цикл
			
			ИндексЭлемента = МассивИзменений.Найти(Эл);
			Если ИндексЭлемента <> Неопределено Тогда
				МассивИзменений.Удалить(ИндексЭлемента);
			КонецЕсли;
			
		КонецЦикла;
		
		Если МассивИзменений.Количество() = 0 Тогда
			
			СообщитьПользователю("Изменения заказов не зарегистрированы. Выгрузка заказов не произведена.", Истина); 
			Возврат Истина;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	ОбъектCMLСтрока   = "";
	ТаблицаДокументов = СформироватьCMLСРанееЗагруженнымиЗаказами(ОбъектCMLСтрока, МассивИзменений);
	
	КоличествоВыгруженныхЗаказов = ТаблицаДокументов.Количество();
	
	Если КоличествоВыгруженныхЗаказов = 0 Тогда
		
		СообщитьПользователю("Не выгружен ни один заказ.", Истина);
		Возврат Успешно;
		
	КонецЕсли;
	
	ИмяФайлаОбмена 		 = "1cbitrix-" + Строка(Новый УникальныйИдентификатор) + ".xml";
	ПолноеИмяФайлаОбмена = мКаталогНаДиске + "\" + ИмяФайлаОбмена;
	//!!!!
	//	Сообщить(ПолноеИмяФайлаОбмена);   // для тестов надо
	
	ФайлCMLНаДиске = Новый ТекстовыйДокумент;
	ФайлCMLНаДиске.УстановитьТекст(ОбъектCMLСтрока);
	
	Попытка
		ФайлCMLНаДиске.Записать(ПолноеИмяФайлаОбмена, "UTF-8");
	Исключение
		СообщитьОбИсключительнойОшибке(Истина, "Не удалось записать CML файл на диск: " + ПолноеИмяФайлаОбмена + Символы.ПС + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	СообщитьПользователю("Выгружено заказов: " + ТаблицаДокументов.Количество(), Истина);	
	Возврат Истина;
	
КонецФункции

Функция ВыгрузитьКоличествоЗаказовВФайл(СтруктураИзменений, СтруктураПараметровСайта, КоличествоВыгруженныхЗаказов = 0)
	
	//возврат истина;
	Успешно = Истина;
	КоличествоВыгруженныхЗаказов = 0;
	
	МассивИзменений   = Новый Массив;
	
	Если ВыгружатьТолькоИзменения И НЕ мПринудительнаяПолнаяВыгрузка Тогда
		
		МассивИзменений = СтруктураИзменений.Заказы;
		
		// из этого массива нужно удалить все только что загруженные заказы
		Для Каждого Эл Из мМассивЗагруженныхДокументов Цикл
			
			ИндексЭлемента = МассивИзменений.Найти(Эл);
			Если ИндексЭлемента <> Неопределено Тогда
				МассивИзменений.Удалить(ИндексЭлемента);
			КонецЕсли;
			
		КонецЦикла;
		
		Если МассивИзменений.Количество() = 0 Тогда
			
			СообщитьПользователю("Изменения заказов не зарегистрированы. Выгрузка заказов не произведена.", Истина); 
			Возврат Истина;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	ОбъектCMLСтрока   = "";
	ТаблицаДокументов = СформироватьCMLСРанееЗагруженнымиЗаказамиВыгрузкаКоличества(ОбъектCMLСтрока, МассивИзменений);
	
	КоличествоВыгруженныхЗаказов = ТаблицаДокументов.Количество();
	
	Если КоличествоВыгруженныхЗаказов = 0 Тогда
		
		СообщитьПользователю("Не выгружен ни один заказ.", Истина);
		Возврат Успешно;
		
	КонецЕсли;
	
	ИмяФайлаОбмена 		 = "1cbitrix-" + Строка(Новый УникальныйИдентификатор) + ".xml";
	ПолноеИмяФайлаОбмена = мКаталогНаДиске + "\" + ИмяФайлаОбмена;
	//!!!!
//	Сообщить(ПолноеИмяФайлаОбмена);
	
	ФайлCMLНаДиске = Новый ТекстовыйДокумент;
	ФайлCMLНаДиске.УстановитьТекст(ОбъектCMLСтрока);
	
	Попытка
		ФайлCMLНаДиске.Записать(ПолноеИмяФайлаОбмена, "UTF-8");
	Исключение
		СообщитьОбИсключительнойОшибке(Истина, "Не удалось записать CML файл на диск: " + ПолноеИмяФайлаОбмена + Символы.ПС + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	//СообщитьПользователю("Выгружено заказов: " + ТаблицаДокументов.Количество(), Истина);	
	Возврат Истина;
	
	
КонецФункции


Функция ОпределитьМожноВыгружатьЗаказы()
	
	ЕстьФайлЗагрузки 			= ЗначениеЗаполнено(ФайлЗагрузки);
	ЕстьСайт			  		= ЗначениеЗаполнено(HTTPОбменСервер);	
	
	ЕстьОрганизация  			= ЗначениеЗаполнено(Организация);
	ЕстьПараметрыИдентификации  = ЗначениеЗаполнено(СпособИдентификацииКонтрагентов);
	ЕстьЕдиницаИзмерения		= ЗначениеЗаполнено(ЕдиницаИзмеренияНовойНоменклатуры);
	
	Если ВыгружатьНаСайт Тогда
		Возврат	ЕстьСайт И ЕстьОрганизация И ЕстьПараметрыИдентификации И ЕстьЕдиницаИзмерения;
	Иначе
		Возврат ЕстьФайлЗагрузки;
	КонецЕсли;	
	
КонецФункции
//--------------------------------------------------------------------------------
//////////////////////////////////////////////////////////////////////////////////
// блок для отгрузок
//****************************************************************************************************************************************************************************

Функция ВыгрузитьЗаказыВФайлДляОтгрузок(СтруктураИзменений, СтруктураПараметровСайта, КоличествоВыгруженныхЗаказов = 0)
	
	//возврат истина;
	Успешно = Истина;
	КоличествоВыгруженныхЗаказов = 0;
	
	МассивИзменений   = Новый Массив;
	
	Если ВыгружатьТолькоИзменения И НЕ мПринудительнаяПолнаяВыгрузка Тогда
		
		МассивИзменений = СтруктураИзменений.Заказы;
		
		// из этого массива нужно удалить все только что загруженные заказы
		Для Каждого Эл Из мМассивЗагруженныхДокументов Цикл
			
			ИндексЭлемента = МассивИзменений.Найти(Эл);
			Если ИндексЭлемента <> Неопределено Тогда
				МассивИзменений.Удалить(ИндексЭлемента);
			КонецЕсли;
			
		КонецЦикла;
		
		Если МассивИзменений.Количество() = 0 Тогда
			
			СообщитьПользователю("Изменения заказов не зарегистрированы. Выгрузка заказов не произведена.", Истина); 
			Возврат Истина;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	ОбъектCMLСтрока   = "";
	ТаблицаДокументов = СформироватьCMLСРанееЗагруженнымиЗаказамиОтгрузки(ОбъектCMLСтрока, МассивИзменений);
	
	КоличествоВыгруженныхЗаказов = ТаблицаДокументов.Количество();
	
	Если КоличествоВыгруженныхЗаказов = 0 Тогда
		
		СообщитьПользователю("Не выгружен ни один заказ.", Истина);
		Возврат Успешно;
		
	КонецЕсли;
	
	ИмяФайлаОбмена 		 = "1cbitrix-" + Строка(Новый УникальныйИдентификатор) + ".xml";
	ПолноеИмяФайлаОбмена = мКаталогНаДиске + "\" + ИмяФайлаОбмена;
	//!!!!
	#если клиент    тогда
		Сообщить(ПолноеИмяФайлаОбмена);   // для тестов надо
	#конецесли
	ФайлCMLНаДиске = Новый ТекстовыйДокумент;
	ФайлCMLНаДиске.УстановитьТекст(ОбъектCMLСтрока);
	
	Попытка
		ФайлCMLНаДиске.Записать(ПолноеИмяФайлаОбмена, "UTF-8");
	Исключение
		СообщитьОбИсключительнойОшибке(Истина, "Не удалось записать CML файл на диск: " + ПолноеИмяФайлаОбмена + Символы.ПС + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	СообщитьПользователю("Выгружено заказов: " + ТаблицаДокументов.Количество(), Истина);	
	Возврат Истина;
	
КонецФункции

Функция СформироватьCMLСРанееЗагруженнымиЗаказамиОтгрузки(СтрокаCML, МассивИзменений) 
	//
	ОтобразитьСостояние("Поиск открытых заказов, загруженных с " + HTTPОбменСервер + "...");
	
	ТаблицаДокументов = тСписокЗаказовНаОтправкуОтгрузки; //ПроцедурыОбменаССайтом.ПолучитьЗаказыСОплатойИОтгрузкойПоКатегориямПоРегистру(МассивИзменений, мМассивЗагруженныхДокументов);
	
	Если ТаблицаДокументов.Количество() = 0 Тогда  
		Возврат ТаблицаДокументов;
	КонецЕсли;
		
	ОбъектCML = ПолучитьОбъектДляЗаписиXMLРНК("",ТекущаяДата());
	НачатьCML(ОбъектCML);
		
		
	Для Каждого СтрокаТД Из ТаблицаДокументов Цикл
		ОбъектCML.ЗаписатьНачалоЭлемента("Контейнер");

		ОбъектCML.ЗаписатьНачалоЭлемента("Документ");
		
		// первая часть, сам заказ, потом цикл по РНК
		ВыгрузитьЗаказВCML(ОбъектCML, СтрокаТД);  //--
			
		ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияРеквизитов");
		
		ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Номер по 1С", СтрокаТД.Номер);
		ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Дата по 1С", ФорматДатыДляCML(СтрокаТД.Дата));
		ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "ПометкаУдаления", СтрокаТД.ПометкаУдаления);
		ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Проведен", СтрокаТД.Проведен);
		
		ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Финальный статус", "false");
		
		ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Платежный профиль", СтрокаТД.ЗаказСсылка.контрагент.ведущий.код);
		ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Код пользователя", СтрокаТД.ЗаказСсылка.контрагент.код);
		ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Адрес доставки", СтрокаТД.ЗаказСсылка.пунктДоставки.код);
		ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Дата доставки", ФорматДатыДляCML(СтрокаТД.ЗаказСсылка.ДатаОтгрузки));
		
		
		ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Статуса заказа ИД", "O");
		ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Статуса заказа", "[O] Отгружен");
			
		ОбъектCML.ЗаписатьКонецЭлемента();
		ОбъектCML.ЗаписатьКонецЭлемента();
		
		// вторая часть цикл по РНК.
		ТаблицаДокументовРНК = новый ТаблицаЗначений;
		// здесь уже отбираем и новые, и уже отгруженныеранее  РНК по заказу.
		ТаблицаДокументовРНК = ПроцедурыОбменаССайтом.ПолучитьТаблицуДокументовРНК(МассивИзменений,ТаблицаДокументовРНК,СтрокаТД.ЗаказСсылка);
		
		Для Каждого СтрокаТД Из ТаблицаДокументовРНК Цикл
			
			ОбъектCML.ЗаписатьНачалоЭлемента("Документ");
			
			// первая часть, сам заказ, потом цикл по РНК
			ВыгрузитьЗаказВCMLРНК(ОбъектCML, СтрокаТД);  //--
			
			ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияРеквизитов");
			
			ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Номер по 1С", СтрокаТД.Номер);
			ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Дата по 1С", ФорматДатыДляCML(СтрокаТД.Дата));
			ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "ПометкаУдаления", СтрокаТД.ПометкаУдаления);
			ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Проведен", СтрокаТД.Проведен);
			
			ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Финальный статус", "false");
			
			ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Платежный профиль", СтрокаТД.ЗаказСсылка.контрагент.ведущий.код);
			ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Код пользователя", СтрокаТД.ЗаказСсылка.контрагент.код);
			ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Адрес доставки", СтрокаТД.ЗаказСсылка.пунктДоставки.код);
			ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Дата доставки", ФорматДатыДляCML(СтрокаТД.ЗаказСсылка.ДатаОтгрузки));
			
			
			ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Статуса заказа ИД", "O");
			ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Статуса заказа", "[O] Отгружен");
			
			ОбъектCML.ЗаписатьКонецЭлемента();
			ОбъектCML.ЗаписатьКонецЭлемента();
		КонецЦикла;	
				
		ОбъектCML.ЗаписатьКонецЭлемента();  // контейнер
	КонецЦикла;	
		
	СтрокаCML = ЗавершитьCML(ОбъектCML);
	
	Возврат ТаблицаДокументов;
	
КонецФункции

//это кусок для РНК-отгрузки, второй части контейнера
Процедура ВыгрузитьЗаказВCMLРНК(ОбъектCML, Док)
	
	номеррнк = Док.ЗаказСсылка.номер;
	НомерРНк = СтрЗаменить(НомерРНК,"б","");
	НомерРНк = СтрЗаменить(НомерРНК,"а","");
	
	ИдЗаказа = Док.ЗаказСсылка.докОснование.ИдЗаказа;
	Если ИдЗаказа ="" Тогда
		ИдЗаказа = номеррнк ;
	КонецЕсли;	
	

	
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид"	,ИдЗаказа) ; //Строка(Док.ЗаказСсылка.УникальныйИдентификатор()));
	// тут под вопросом какой номер ???
	ЗаписатьТекстовойУзел(ОбъектCML, "Номер", номеррнк); //Док.НомерВходящегоДокументаЭлектронногоОбмена);
	ЗаписатьТекстовойУзел(ОбъектCML, "Дата" , ФорматДатыДляCML(Док.ДатаВходящегоДокументаЭлектронногоОбмена, Истина, Ложь));	
	ЗаписатьТекстовойУзел(ОбъектCML, "Номер1С", НомерРНк);  // Док.Номер
	ЗаписатьТекстовойУзел(ОбъектCML, "Дата1С" , ФорматДатыДляCML(Док.Дата, Истина, Ложь));	

	ЗаписатьТекстовойУзел(ОбъектCML, "ХозОперация", "Отпуск товара");
	
	ЗаписатьТекстовойУзел(ОбъектCML, "Роль"		  , "Продавец");
	ЗаписатьТекстовойУзел(ОбъектCML, "Валюта"	  , ФорматВалютыДляCML(Док.ВалютаДокумента));
	ЗаписатьТекстовойУзел(ОбъектCML, "Курс"	      , Док.КурсВзаиморасчетов);
	ЗаписатьТекстовойУзел(ОбъектCML, "Сумма"      , Док.СуммаДокумента); //ФорматЗначенияДляCML(Док.СуммаДокумента, ФорматСуммы));	
		
	ОбъектCML.ЗаписатьНачалоЭлемента("Контрагенты");
		
	ВыгрузитьКонтрагентаДок(ОбъектCML, Док.Контрагент,,,,Док.ЗаказСсылка.ПунктДоставки); 	
	//ВыгрузитьРеквизитыКонтрагентаВCML(ОбъектCML, Док.Контрагент);
	ОбъектCML.ЗаписатьКонецЭлемента();   //контрагенты
		
	ЗаписатьТекстовойУзел(ОбъектCML, "Время", ФорматДатыДляCML(Док.ДатаВходящегоДокументаЭлектронногоОбмена, Ложь, Истина));
	ЗаписатьТекстовойУзел(ОбъектCML, "СрокПлатежа", ФорматДатыДляCML(Док.ДатаОплаты, Истина, Ложь));
	
	ЗаписатьТекстовойУзел(ОбъектCML, "Комментарий", ФорматНаименованияДляCML(""+Док.Комментарий+" номер отгрузки - "+Док.ЗаказСсылка.Номер+" дата отгрузки - "+Док.ЗаказСсылка.ДатаОтгрузки));
	
		
	ВыгрузитьТоварыУслугиЗаказаВCML(ОбъектCML, Док);
	
	
	
КонецПроцедуры

Функция ПолучитьОбъектДляЗаписиXMLРНК(ИмяФайла, ДатаФормирования)
	
	ЗаписьXML = Новый ЗаписьXML;
	
	Если ПустаяСтрока(ИмяФайла) Тогда
		ЗаписьXML.УстановитьСтроку("UTF-8");
	Иначе
		ЗаписьXML.ОткрытьФайл(ИмяФайла, "UTF-8"); 
	КонецЕсли;   
	// пример
	//	<КоммерческаяИнформация xmlns="urn:1C.ru:commerceml_2" xmlns:xs="http://www.w3.org/2001/XMLSchema" 
	//   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" ВерсияСхемы="3.1" ДатаФормирования="2015-06-29T18:27:13" Ид="1">
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("КоммерческаяИнформация");
	ЗаписьXML.ЗаписатьАтрибут("ДатаФормирования", Формат(ДатаФормирования, "ДФ=yyyy-MM-dd'T'ЧЧ:мм:сс"));	
	ЗаписьXML.ЗаписатьАтрибут("ВерсияСхемы","3.1"); 
	ЗаписьXML.ЗаписатьАтрибут("xmlns","urn:1C.ru:commerceml_2");
	ЗаписьXML.ЗаписатьАтрибут("xmlns:xs","http://www.w3.org/2001/XMLSchema");
	ЗаписьXML.ЗаписатьАтрибут("xmlns:xsi","http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьАтрибут("Ид","1");
		
	Возврат ЗаписьXML;
	
КонецФункции



Функция ВыгрузитьЗаказыНаСайтДляСменыСтатуса(СтруктураИзменений, СтруктураПараметровСайта, КоличествоОбработанныхДокументовНаВыгрузке,Статус,СписокаказовРНК, СписокЗаказов)
	
	 пп=1;
	 
	//возврат истина;;
	КоличествоОбработанныхДокументовНаВыгрузке = 0;
	//
	//// это выгрузка большого файла, со статусами
	
	тСписокЗаказовНаОтправку = неопределено;  // передавать везде этот список
	МассивИзменений = новый Массив;
	//тСписокЗаказовНаОтправку = ПроцедурыОбменаССайтом.ПолучитьЗаказыСОплатойИОтгрузкойПоКатегориямПоРегистру(МассивИзменений, мМассивЗагруженныхДокументов);

	тСписокЗаказовНаОтправку = СписокЗаказов; //нужно проверять будет, все ли отгружены.
	
	Успешно = ВыгрузитьЗаказыВФайл(СтруктураИзменений, СтруктураПараметровСайта, КоличествоОбработанныхДокументовНаВыгрузке);
	Успешно=Истина;
	
	Если Не Успешно	Тогда
		Возврат Ложь;
	ИначеЕсли КоличествоОбработанныхДокументовНаВыгрузке = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	//
	Успешно = HTTPВыгрузитьНаСервер(СтруктураПараметровСайта, , , "sale");
	//ОчиститьКаталогНаДиске();
	
	//маленький не выгружаем
		
	ТСписокЗаказовНаВыгрузку = новый ТаблицаЗначений;
	                  
	Возврат Успешно;
	
КонецФункции



Процедура ОчиститьСписокРНКНаВыгрузку(СписокЗаказов=неопределено, СписокЗаказовРНК=неопределено)
	
		
	// и все РНК переведем в отгружено, которые мы отправили. чтобы не переотправлять
	

	// и статусы у самого заказа поменяем на сайте.
	// из обмена по заказам взять кусок.
	
	HTTPОбменАдресСкрипта = НачалоАдресаСкрипта;
	СтруктураПараметровСайта = ПроцедурыОбменаССайтом.ПолучитьСтруктуруПараметровДляСоединения(ЭтотОбъект);		
		
	мСтруктураИнформацииИсторииОбмена.ДатаПоследнейЗагрузки = Текущаядата();
	СтруктураИзменений = неопределено;
	КоличествоОбработанныхДокументовНаВыгрузке = 0;
	Статус = "CO"; // частично выполнен
	//F выполнен
	
	ВыгрузитьЗаказыНаСайтДляСменыСтатуса(СтруктураИзменений, СтруктураПараметровСайта, КоличествоОбработанныхДокументовНаВыгрузке,Статус, СписокЗаказовРНК, СписокЗаказов);
	
	//-----------------------------------------------------------------------
	Для каждого текстрока из СписокЗаказовРНК цикл
		
		// для заказа пока не делаем , только для РНК
		Докссылка = ТекСтрока.Заказссылка;
		попытка
			НаборЗаписей = РегистрыСведений.КатегорииОбъектов.СоздатьНаборЗаписей(); 
			НаборЗаписей.Отбор.Объект.Установить(ДокСсылка); 
			Наборзаписей.Записать(); // очистим предыдущую запись
			
			НоваяЗапись = НаборЗаписей.Добавить(); 
			НоваяЗапись.Объект = ДокСсылка.ссылка;
			НоваяЗапись.Категория  = справочники.КатегорииОбъектов.СостояниеЗаказаНаWEBСайтеОтгружен;
					
			НаборЗаписей.Записать();
			
		исключение
		конецПопытки;
		
	КонецЦикла;
	
	
	 	
КонецПроцедуры

//***************************************************************************************************************************************************************************


//


//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ ОБРАБОТКИ ЗАГРУЖЕННЫХ ДАННЫХ

Процедура Договор_ПриИзменении2(ДокОбъект)
	
	Договор = ДокОбъект.договор;
	Док = ДокОбъект;
	//контроль менеджера
	Если НЕ Договор.Менеджер.Пустая() И НЕ Договор.Менеджер.Штатный Тогда
		//Предупреждение("Некорректный менеджер в договоре!");			
		Если НЕ РольДоступна("Администратор") Тогда
			Договор=Неопределено;		
		КонецЕсли;		
	КонецЕсли;
	
	Если НЕ Договор.Пустая() Тогда
		если Док.ЭтоНовый()	тогда
			если ЗначениеЗаполнено(Договор.ВидОплаты) тогда	
				Док.ВидОплаты=Договор.ВидОплаты;
				УстановитьНомерДокумента2(ДокОбъект);
			КонецЕсли;
		иначе
			если Договор.ВидОплаты<>Док.ВидОплаты и ЗначениеЗаполнено(Договор.ВидОплаты) тогда
				//сообщить("Не сопадают виды оплаты накладной и договора, договор не был изменён!");
				Договор=Док.Ссылка.ПолучитьОбъект().договор;
			КонецЕсли;
		КонецЕсли;
		
		
		Если Док.ТипЦен.Пустая() Тогда
			Док.ТипЦен		=Договор.ТипЦен;		
		КонецЕсли;
		Если Док.ОтсрочкаПлатежа<>Договор.ОтсрочкаПлатежа Тогда
			Если НЕ Док.ОтсрочкаПлатежа.Пустая() Тогда
				//	Предупреждение("Изменена отсрочка платежа",2);			
			КонецЕсли; 
			Док.ОтсрочкаПлатежа =Договор.ОтсрочкаПлатежа;
			//			Док.ОтсрочкаПлатежаПриИзменении();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Договор.Менеджер) Тогда
			Док.Менеджер=Договор.Менеджер;		
		Иначе
			Док.Менеджер=Док.Контрагент.Менеджер;
		КонецЕсли; 
		//Кухарь 15.03.16 начало
		//Чтобы подразделение поменять
		//	Менеджер_ПриИзменении();
		//Кухарь 15.03.16 конец
		
		//	ДатаПриИзменении(Элемент);
		
		Если ЗначениеЗаполнено(Договор.Организация) Тогда
			Док.Организация=Договор.Организация;
			//крохин начало
			Док.БанковскийСчет = Док.Организация.ОсновнойБанковскийСчет;
			//крохин конец
		КонецЕсли;
		
		
		// Нечаева +++ 27,02,13   берем из договора номер счета
		Если ЗначениеЗаполнено(Договор.РасчетныйСчетДляОплаты)  Тогда
			Док.БанковскийСчет = Договор.РасчетныйСчетДляОплаты;
		КонецЕсли;
		
		если Договор.ВалютаКредита<>Док.Валюта  тогда
			Док.Валюта=Договор.ВалютаКредита;
			//ОбнулитьЦеныВТабЧасти(Товары,ЭтотОбъект);
		КонецЕсли;
		
		
		//	ЗапросНаПересчетЦен();	
		
		Если Док.Контрагент.Ведущий.ТолькоПредоплата Тогда
			Док.ОтсрочкаПлатежа = Справочники.ОтсрочкиПлатежа.НайтиПоКоду("1");
			Док.ОтсрочкаПлатежаПриИзменении();
		КонецЕсли;
		
		
	КонецЕсли;	
	
	
	
КонецПроцедуры

Функция ОбработатьНачалоЭлемента(ОбъектCML, Знач ИмяЭлемента, ДеревоДокументов);
	
	Успешно = Истина;
	
	ТекущаяСтрокаДерева  	  = Неопределено;
	ТекущаяСтрокаТоваровУслуг = Неопределено;
	
	КоличествоДокументов 	  = ДеревоДокументов.Строки.Количество();
	Если КоличествоДокументов > 0 Тогда
		
		ТекущаяСтрокаДерева    = ДеревоДокументов.Строки[КоличествоДокументов - 1];
		КоличествоТоваровУслуг = ТекущаяСтрокаДерева.Строки.Количество();
		
		Если КоличествоТоваровУслуг > 0 Тогда
			ТекущаяСтрокаТоваровУслуг = ТекущаяСтрокаДерева.Строки[КоличествоТоваровУслуг - 1];
		КонецЕсли;	
		
	КонецЕсли;	
	
	//123
	//	сообщить(ИмяЭлемента);     //  Документ.ЗначенияРеквизитов.ЗначениеРеквизита
	
	
	Если ИмяЭлемента = "Документ" Тогда
		
		НовыйДокумент = Документы.Заказ.СоздатьДокумент();
		НовыйДокумент.ТипЦен = Справочники.ТипыЦен.НайтиПоКоду("SNL-0219");
		//	НовыйДокумент.ТипЦенРаспродажа = Справочники.ТипыЦен.НайтиПоКоду("SNL-0393"); //  или сале //++-++
		//	НовыйДокумент.ТипСкидок = Справочники.ТипыСкидок.НайтиПоКоду("SNL-0008"); // ниже не куда
		//НовыйДокумент.Контрагент =Справочники.Контрагенты.НайтиПоКоду("SSR-0519"); // поиск по коду  пусть так пока
		
		НовыйДокумент.ИБ=Справочники.ИБ.НайтиПоКоду("SSP"); // 
		НовыйДокумент.ВидОплаты=перечисления.ВидыОплаты.БН; //++-++
		НовыйДокумент.КодОперации=перечисления.КодыОперацийОстатки.Реализация; //++-++
		НовыйДокумент.СостояниеНакладной=перечисления.СостоянияЗаказаКонтрагента.ВРаботе; //++-++
		НовыйДокумент.СостояниеСогласования = перечисления.СостоянияСогласования.НаСогласованииЦО;
		
		
		//НовыйДокумент.Подразделение=справочники.Подразделения.НайтиПоКоду("SSP-0004");
		
		НовыйДокумент.Склад = Справочники.Склады.НайтиПоКоду("STC-60"); // 
		
		
		//НовыйДокумент.УчитыватьНДС	   = Истина;
		//НовыйДокумент.СуммаВключаетНДС = Истина;
		НовСтрокаДерева 			   = ДеревоДокументов.Строки.Добавить();
		НовСтрокаДерева.ДокументОбъект = НовыйДокумент;
		НовСтрокаДерева.СтавкаНДС 	   = Перечисления.СтавкиНДС.БезНДС;
		НовСтрокаДерева.СтруктураДанныхКонтрагента = Новый Структура;
		
	ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент" Тогда
		
		ДеревоАдресов = Новый ДеревоЗначений;
		ДеревоАдресов.Колонки.Добавить("ВидАдреса");
		ДеревоАдресов.Колонки.Добавить("Представление");
		ДеревоАдресов.Колонки.Добавить("Комментарий");
		ДеревоАдресов.Колонки.Добавить("Ид");
		ДеревоАдресов.Колонки.Добавить("ПолеТип");
		ДеревоАдресов.Колонки.Добавить("ПолеЗначение");
		ДеревоАдресов.Колонки.Добавить("ПунктДоставки");
		ДеревоАдресов.Колонки.Добавить("ПлатежныйПрофиль");
		
		
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДеревоАдресов", ДеревоАдресов);
		
		ТаблицаКонтактов = Новый ТаблицаЗначений;
		ТаблицаКонтактов.Колонки.Добавить("КонтактТип");
		ТаблицаКонтактов.Колонки.Добавить("КонтактЗначение");
		ТаблицаКонтактов.Колонки.Добавить("КонтактКомментарий");
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ТаблицаКонтактов", ТаблицаКонтактов);
		
		ТаблицаКонтактныхЛиц = Новый ТаблицаЗначений;
		ТаблицаКонтактныхЛиц.Колонки.Добавить("Наименование");
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ТаблицаКонтактныхЛиц", ТаблицаКонтактныхЛиц);
		
		ТаблицаБанковскихРеквизитов = Новый ТаблицаЗначений;
		ТаблицаБанковскихРеквизитов.Колонки.Добавить("НомерСчета");
		ТаблицаБанковскихРеквизитов.Колонки.Добавить("Комментарий");
		ТаблицаБанковскихРеквизитов.Колонки.Добавить("Банк");
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ТаблицаБанковскихРеквизитов", ТаблицаБанковскихРеквизитов);
		
		//ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.УдостоверениеЛичности" Тогда		
	ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Ид" Тогда
		
		//НовыйДокумент.Контрагент ="" //Справочники.Контрагенты.НайтиПоКоду("SSR-0519"); 
		тт=1;
		
		
		
		
	ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.АдресРегистрации" Тогда
		
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ДеревоАдресов", ДеревоАдресов);
		НовСтрокаДерева	= ДеревоАдресов.Строки.Добавить();
		НовСтрокаДерева.ВидАдреса = "АдресРегистрации";
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДеревоАдресов", ДеревоАдресов);
		
	ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.АдресРегистрации.АдресноеПоле" Тогда
		
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ДеревоАдресов", ДеревоАдресов);
		СтрокаДерева 	= ДеревоАдресов.Строки.Найти("АдресРегистрации", "ВидАдреса");
		НовСтрокаДерева = СтрокаДерева.Строки.Добавить();
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДеревоАдресов", ДеревоАдресов);
		
		//ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.МестоРаботы.Организация.Контрагент" Тогда	
		//ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.МестоРаботы" Тогда		
		
	ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.ЮридическийАдрес" Тогда
		
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ДеревоАдресов", ДеревоАдресов);
		НовСтрокаДерева	= ДеревоАдресов.Строки.Добавить();
		НовСтрокаДерева.ВидАдреса = "ЮридическийАдрес";
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДеревоАдресов", ДеревоАдресов);
		
	ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.ЮридическийАдрес.АдресноеПоле" Тогда
		
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ДеревоАдресов", ДеревоАдресов);
		СтрокаДерева 	= ДеревоАдресов.Строки.Найти("ЮридическийАдрес", "ВидАдреса");
		НовСтрокаДерева = СтрокаДерева.Строки.Добавить();
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДеревоАдресов", ДеревоАдресов);
		
	ИначеЕсли ИмяЭлемента ="Документ.Контрагенты.Контрагент.ЮридическийАдрес.Представление" Тогда	
		
		//ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ДеревоАдресов", ДеревоАдресов);
		//СтрокаДерева 	= ДеревоАдресов.Строки.Найти("ЮридическийАдрес", "Представление");
		//НовСтрокаДерева = СтрокаДерева.Строки.Добавить();
		//ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДеревоАдресов", ДеревоАдресов);
		
		
	ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет" Тогда
		
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ТаблицаБанковскихРеквизитов", ТаблицаБанковскихРеквизитов);
		НоваяСтрокаТаблицыБанковскихРеквизитов = ТаблицаБанковскихРеквизитов.Добавить();
		
		НоваяСтрокаТаблицыБанковскихРеквизитов.Банк = Новый Структура("
		|	СчетКорреспондентский,
		|	Наименование,
		|	Адрес,
		|	БИК,
		|	SWIFT");
		
		НоваяСтрокаТаблицыБанковскихРеквизитов.Банк.Адрес = Новый Структура;
		НоваяСтрокаТаблицыБанковскихРеквизитов.Банк.Адрес.Вставить("Представление");
		ТаблицаАдресныхПолей = Новый ТаблицаЗначений;
		ТаблицаАдресныхПолей.Колонки.Добавить("ПолеТип");
		ТаблицаАдресныхПолей.Колонки.Добавить("ПолеЗначение");
		НоваяСтрокаТаблицыБанковскихРеквизитов.Банк.Адрес.Вставить("ТаблицаАдресныхПолей", ТаблицаАдресныхПолей);
		
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ТаблицаБанковскихРеквизитов", ТаблицаБанковскихРеквизитов);
		
		//ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.БанкКорреспондент.Банк" Тогда	
		//ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.БанкКорреспондент.Банк.Адрес" Тогда	
		//ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.БанкКорреспондент.Банк.Адрес.АдресноеПоле" Тогда	
		
		//ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.Банк" Тогда
		//ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.Банк.Адрес" Тогда	
		
	ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.Банк.Адрес.АдресноеПоле" Тогда		
		
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ТаблицаБанковскихРеквизитов", ТаблицаБанковскихРеквизитов);	
		СтрокаТаблицыБанковскихРеквизитов = ТаблицаБанковскихРеквизитов[ТаблицаБанковскихРеквизитов.Количество() - 1];
		СтруктураДанныхБанка = СтрокаТаблицыБанковскихРеквизитов.Банк;
		СтруктураДанныхБанка.Адрес.ТаблицаАдресныхПолей.Добавить();
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ТаблицаБанковскихРеквизитов", ТаблицаБанковскихРеквизитов);
		
	ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Адрес" Тогда	
		
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ДеревоАдресов", ДеревоАдресов);
		НовСтрокаДерева	= ДеревоАдресов.Строки.Добавить();
		НовСтрокаДерева.ВидАдреса = "Адрес";
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДеревоАдресов", ДеревоАдресов);
		
	ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Адрес.АдресноеПоле" Тогда		
		
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ДеревоАдресов", ДеревоАдресов);
		СтрокаДерева 	= ДеревоАдресов.Строки.Найти("Адрес", "ВидАдреса");
		НовСтрокаДерева = СтрокаДерева.Строки.Добавить();
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДеревоАдресов", ДеревоАдресов);
		
	ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Контакты.Контакт" Тогда
		
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ТаблицаКонтактов", ТаблицаКонтактов);
		ТаблицаКонтактов.Добавить();
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ТаблицаКонтактов", ТаблицаКонтактов);
		
	ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Представители.Представитель.Контрагент" Тогда	
		
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ТаблицаКонтактныхЛиц", ТаблицаКонтактныхЛиц);
		ТаблицаКонтактныхЛиц.Добавить();
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ТаблицаКонтактныхЛиц", ТаблицаКонтактныхЛиц);
		
		//ИначеЕсли ИмяЭлемента = "Документ.Налоги.Налог" Тогда
		//ИначеЕсли ИмяЭлемента = "Документ.Скидки.Скидка" Тогда
		//ИначеЕсли ИмяЭлемента = "Документ.ДопРасходы.ДопРасход" Тогда
		
	ИначеЕсли ИмяЭлемента = "Документ.Товары.Товар" Тогда
		
		НовСтрокаДерева = ТекущаяСтрокаДерева.Строки.Добавить();
		
	ИначеЕсли ИмяЭлемента = "Документ.Товары.Товар.БазоваяЕдиница" Тогда		
		
		Пока ОбъектCML.ПрочитатьАтрибут() Цикл
			Если ОбъектCML.Имя = "Код" Тогда
				КодБазовойЕдиницы = ОбъектCML.Значение;
				ТекущаяСтрокаТоваровУслуг.ТоварУслугаБазоваяЕдиницаКод = КодБазовойЕдиницы;
				Прервать;
			КонецЕсли;	
		КонецЦикла
		
	ИначеЕсли ИмяЭлемента = "Документ.Товары.Товар.ЗначенияРеквизитов.ЗначениеРеквизита" Тогда
		
		ТекущаяСтрокаТоваровУслуг.Строки.Добавить();
		
	ИначеЕсли ИмяЭлемента = "Документ.Товары.Товар.Скидки.Скидка" Тогда
		
		ТекущаяСтрокаТоваровУслуг.Строки.Добавить();
		
	ИначеЕсли ИмяЭлемента = "Документ.ЗначенияРеквизитов.ЗначениеРеквизита" Тогда
		
		НовСтрокаДерева = ТекущаяСтрокаДерева.Строки.Добавить();
		
	КонецЕсли;
	
	Возврат Успешно;
	
КонецФункции                       

Функция КонтрагентПРиИзменении2(Док);
	
	Контрагент = Док.Контрагент;
	Док.дата = ТекущаяДата();
	
	Если Контрагент.НеИспользовать Тогда
		//Предупреждение("Данный контрагент запрещен к использованию в документах !");			
		Если НЕ РольДоступна("Администратор") Тогда
			Контрагент=Неопределено;		
		КонецЕсли;		
	КонецЕсли;
	
	
	Если НЕ Контрагент.Менеджер.Штатный Тогда
		//Предупреждение("Некорректный менеджер контрагента!");			
		Если НЕ РольДоступна("Администратор") Тогда
			Контрагент=Неопределено;		
		КонецЕсли;		
	КонецЕсли;
	
	
	ТипЦенКонтрагента=ПолучитьРеквизитРодителя(Контрагент,"ТипЦен");
	Док.ТипЦен=ТипЦенКонтрагента;
	
	ТипЦенРаспродажаКонтрагента=ПолучитьРеквизитРодителя(Контрагент,"ТипЦенРаспродажа");
	Док.ТипЦенРаспродажа=ТипЦенРаспродажаКонтрагента;
	
	СкидкаКонтрагента=ПолучитьРеквизитРодителя(Контрагент,"Скидка");
	Док.Скидка=СкидкаКонтрагента;
	
	
	БылДоговор=Док.Договор;
	
	УстановитьДоговорСб2б(док);	
	Договор_ПриИзменении2(Док);			
	
	Если Ложь Тогда
		Если Контрагент.Менеджер.Подразделение = ПараметрыСеанса.ЭтотУзел.Подразделение ИЛИ Контрагент.Менеджер.Подразделение = ПараметрыСеанса.ЭтотУзел.Подразделение.Менеджер.Подразделение Тогда
			Док.Менеджер = Контрагент.Менеджер;
		ИначеЕсли Контрагент.МенеджерТЦ.Подразделение = ПараметрыСеанса.ЭтотУзел.Подразделение ИЛИ Контрагент.МенеджерТЦ.Подразделение = ПараметрыСеанса.ЭтотУзел.Подразделение.Менеджер.Подразделение Тогда
			Док.Менеджер = Контрагент.МенеджерТЦ;
		Иначе
			Док.Менеджер = ПараметрыСеанса.ЭтотУзел.Подразделение.Менеджер;	
		Конецесли;
		
		
		Если Док.Менеджер <> Контрагент.Менеджер И Док.Менеджер <> Контрагент.МенеджерТЦ Тогда
		//	Сообщить("Не совпадают менеджеры контрагента и подразделения!");	
		КонецЕсли;		
	Иначе
		Док.Менеджер				= Контрагент.Менеджер;
	КонецЕсли;
	
	//Менеджер_ПриИзменении();
	
	Док.Регион					= Контрагент.Регион;
	Док.состояниенакладной = перечисления.СостоянияЗаказаКонтрагента.ВРаботе;
	//УстановитьПунктДоставки(Док);
	Док.типСкидок = Контрагент.ТипСкидок;
	
	//ПунктДоставки_ПриИзменении();
	
	//Если ИзмененТипЦен Тогда
	//	ЗапросНаПересчетЦен();		
	//КонецЕсли; 
	//
	//Если СокрЛП(Контрагент.Код)=КодМетро И Лев(Номер,3)<>"SSP" Тогда
	//	УстановитьНомерДокумента(ЭтотОбъект);	
	//КонецЕсли;			
	
	//	Док.ЛевыйКонтрагент=Контрагент;
	
	Если Контрагент.Ведущий.ТолькоПредоплата Тогда
		Док.ОтсрочкаПлатежа = Справочники.ОтсрочкиПлатежа.НайтиПоКоду("1");
		Док.ОтсрочкаПлатежаПриИзменении();
	КонецЕсли;
	
	//УстановитьЗаголовокКнопкиЦеныВалюта(ЭтаФорма);
	
	
	
	
КонецФункции	


////отгрузки белорусским контрагентам
Процедура НулеваяСтавкаНДСПриИзменении2(док)
	Для Каждого СтрокаТЧ Из док.Товары Цикл
		Если Док.НулеваяСтавкаНДС Тогда
			СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НДС0;
		Иначе
			СтрокаТЧ.СтавкаНДС = СтрокаТЧ.Номенклатура.Родитель.СтавкаНДС;			
		КонецЕсли;
		РассчитатьСуммуТабЧасти(СтрокаТЧ, Док,"ОтВсего");
	КонецЦикла;
КонецПроцедуры

//  19.08.2020 Кухарь начало
//Иногда нужно вызывать из обработок
//Процедура ПунктДоставки_ПриИзменении(Элемент=Неопределено)
Процедура ПунктДоставкиПриИзменении2(док) 
	
	//Док.ТипДоставки=Док.ПунктДоставки.ТипДоставки;
	ПунктДоставки = Док.ПунктДоставки;
	
	Если НЕ Док.ПунктДоставки.Пустая() Тогда
		
		
		НуженПересчетЦен=Ложь;
		
		Если ЗначениеЗаполнено(Док.ПунктДоставки.Договор)  Тогда
			Док.Договор=Док.ПунктДоставки.Договор;
			Договор_ПриИзменении2(Док);
		КонецЕсли;
		
		//доставка
		Если ЗначениеЗаполнено(ПунктДоставки.РайонДоставки) Тогда
			Док.РайонДоставки=ПунктДоставки.РайонДоставки;			
		КонецЕсли;	
		Если ЗначениеЗаполнено(ПунктДоставки.Регион) Тогда
			Док.Регион=ПунктДоставки.Регион;			
		КонецЕсли;	
		
		если ПунктДоставки.ТипДоставки=Перечисления.ТипыДоставки.ТранспортнаяКомпания тогда
			Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
				Док.ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
			иначе
				Док.ТранспортнаяКомпания=Справочники.Контрагенты.ПустаяСсылка();
			КонецЕсли;	
			Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
				Док.ПунктПерегруза=ПунктДоставки.ПунктПерегруза;
			иначе
				Док.ПунктПерегруза=Справочники.ПунктыДоставки.ПустаяСсылка();
			КонецЕсли;	
		иначе
			Док.ТранспортнаяКомпания=Справочники.Контрагенты.ПустаяСсылка();	
			Док.ПунктПерегруза=Справочники.ПунктыДоставки.ПустаяСсылка();
		КонецЕсли;
		//Кухарь 26.01.16 конец
		
		Если ЗначениеЗаполнено(ПунктДоставки.Грузополучатель) Тогда
			Док.Грузополучатель=ПунктДоставки.Грузополучатель;		
		КонецЕсли;
		Если ЗначениеЗаполнено(ПунктДоставки.Получатель) Тогда
			Док.Получатель=ПунктДоставки.Получатель;		
		КонецЕсли;
		Если ЗначениеЗаполнено(ПунктДоставки.ОтсрочкаПлатежа) Тогда
			Док.ОтсрочкаПлатежа=ПунктДоставки.ОтсрочкаПлатежа;		
		КонецЕсли;
		
		//типы цен скидки
		Если ЗначениеЗаполнено(ПунктДоставки.ТипЦен) И Док.ТипЦен<>ПунктДоставки.ТипЦен Тогда
			Док.ТипЦен=ПунктДоставки.ТипЦен;		
			НуженПересчетЦен=Истина;
		КонецЕсли; 
		Если ЗначениеЗаполнено(ПунктДоставки.ТипСкидок) И Док.ТипСкидок<>ПунктДоставки.ТипСкидок Тогда
			Док.ТипСкидок=ПунктДоставки.ТипСкидок;		
			НуженПересчетЦен=Истина;
		КонецЕсли;
		Если ПунктДоставки.Скидка<>0 И ПунктДоставки.Скидка<>Док.Скидка Тогда
			Док.Скидка=ПунктДоставки.Скидка;		
			НуженПересчетЦен=Истина;
		КонецЕсли;
		Если НуженПересчетЦен Тогда
			//ПересчетТЧ(Док,"Товары",Валюта,Валюта,Курс,Курс,Истина);			
		КонецЕсли;	
		
		//ставка НДС
		Если ПунктДоставки.НулеваяСтавкаНДС или Док.Контрагент.НулеваяСтавкаНДС Тогда
			Док.НулеваяСтавкаНДС = Истина;	
			НулеваяСтавкаНДСПриИзменении2(Док);
		ИначеЕсли Док.НулеваяСтавкаНДС Тогда
			Док.НулеваяСтавкаНДС = Ложь;
			НулеваяСтавкаНДСПриИзменении2(Док);
			
		КонецЕсли;
		
	КонецЕсли; 
	
	
	
	КодПоставщикаПунктаДоставки=ПунктДоставки.КодПоставщика;
	Если НЕ КодПоставщикаПунктаДоставки.Пустая() И Док.КодПоставщика<>КодПоставщикаПунктаДоставки Тогда
		Док.КодПоставщика=КодПоставщикаПунктаДоставки;
	КонецЕсли; 
	ВремяДоставки=ПолучитьВремяПриемки(док.ссылка);
	если ВремяДоставки=Справочники.ВремяПриемки.ПустаяСсылка() или ВремяДоставки=Неопределено тогда
		пВремяДоставки=ПунктДоставки.ВремяДоставки;
	иначе
		пВремяДоставки=ВремяДоставки;
	КонецЕсли;
	
	ДатаПриемки=ОпределитьДатуАвизацииДокумента(док.Ссылка);	
	КодПоставщикаПунктаДоставки=ПунктДоставки.КодПоставщика;
	Если НЕ КодПоставщикаПунктаДоставки.Пустая() И Док.КодПоставщика<>КодПоставщикаПунктаДоставки Тогда
		Док.КодПоставщика=КодПоставщикаПунктаДоставки;
	КонецЕсли; 
	
	
КонецПроцедуры


//// код пользователя -- интегральный    Адрес доставки - ПД
//// код пункта доставки - Документ.Контрагенты.Контрагент.Адрес.АдресноеПоле.Значение
//// платежный профиль -   Документ.ЗначенияРеквизитов.ЗначениеРеквизита.Значение
Функция ОбработатьЗначениеЭлемента2(Знач ИмяЭлемента, Знач ЗначениеЭлемента, ДеревоДокументов);
	
	//возврат истина;
	//
	Успешно 			 		= Истина;
	КоличествоДокументов 		= ДеревоДокументов.Строки.Количество();
	ИмяТекущегоЭлемента  		= ПолучитьИмяЭлементаИзПоследовательности(ИмяЭлемента);
	ДеревоАдресов		 		= Неопределено;
	ТаблицаКонтактов		    = Неопределено;
	ТаблицаКонтактныхЛиц 		= Неопределено;
	ТаблицаБанковскихРеквизитов = НеОпределено;
	ПунктДоставки = неопределено;
	
	Если КоличествоДокументов > 0 Тогда
		
		ТекущаяСтрокаДерева       = ДеревоДокументов.Строки[КоличествоДокументов - 1];
		ТекущийДокумент 	      = ТекущаяСтрокаДерева.ДокументОбъект;
		
		ТекущаяСтрокаТоваровУслуг = Неопределено;
		ТекущаяСтрокаСкидок 	  = Неопределено;
		
		КоличествоТоваровУслуг    = ТекущаяСтрокаДерева.Строки.Количество();
		
		Если КоличествоТоваровУслуг > 0 Тогда
			
			ТекущаяСтрокаТоваровУслуг = ТекущаяСтрокаДерева.Строки[КоличествоТоваровУслуг - 1];	
			
			КоличествоСкидок    	  = ТекущаяСтрокаТоваровУслуг.Строки.Количество();
			
			Если КоличествоСкидок > 0 Тогда
				ТекущаяСтрокаСкидок = ТекущаяСтрокаТоваровУслуг.Строки[КоличествоСкидок - 1];	
			КонецЕсли;
			
		КонецЕсли;	
		
		Если ИмяЭлемента = "Документ.Номер" Тогда
			
			ТекущийДокумент.Организация   = Организация; 
			//	ТекущийДокумент.Ответственный = Ответственный;
			ТекущийДокумент.Подразделение = Подразделение;
			ТекущийДокумент.Видоплаты = перечисления.ВидыОплаты.БН;
			ТекущийДокумент.ИсточникЗаказа = Перечисления.ИсточникЗаказа.Сайт;
			//ТекущийДокумент.Комментарий   = "№ " + ЗначениеЭлемента + " " + HTTPОбменСервер;
			
			//ТекущийДокумент.НомерВходящегоДокументаЭлектронногоОбмена = ЗначениеЭлемента;
			ТекущийДокумент.Номерзаказа=  ЗначениеЭлемента;
			ТекущаяСтрокаДерева.НомерВходящий = ЗначениеЭлемента;
			
			ОтобразитьСостояние("Обработка документа CML: " + ТекущаяСтрокаДерева.НомерВходящий);
			
		ИначеЕсли ИмяЭлемента = "Документ.Дата" Тогда
			
			ДатаВремя = ОбработатьДатуВремяCML(ЗначениеЭлемента);
			
			Если ЗаписыватьДокументыТекущейДатой Тогда
				ТекущийДокумент.Дата = ТекущаяДата();
			Иначе	
				ТекущийДокумент.Дата = ДатаВремя;
			КонецЕсли;	
			
			ТекущийДокумент.ДатаЗаказа = ДатаВремя;
			
		ИначеЕсли ИмяЭлемента = "Документ.Время" Тогда
			
			Если НЕ ЗаписыватьДокументыТекущейДатой Тогда
				ТекущийДокумент.Дата = ОбработатьДатуВремяCML(ЗначениеЭлемента, ТекущийДокумент.Дата);
			КонецЕсли;	
			
			ТекущийДокумент.ДатаЗаказа = ОбработатьДатуВремяCML(ЗначениеЭлемента, ТекущийДокумент.ДатаЗаказа);
			
		ИначеЕсли ИмяЭлемента = "Документ.ХозОперация" Тогда
			
			Если НЕ ЗначениеЭлемента = "Заказ товара" Тогда	
				СообщитьОбОшибкеОбмена("Ошибка в значении узла <Документ>.<ХозОперация> документа CML (" + ЗначениеЭлемента + ").", Ложь);
				Успешно = Ложь;
			КонецЕсли;	
			
		ИначеЕсли ИмяЭлемента = "Документ.Валюта" Тогда
			
			ТекущийДокумент.Валюта = ОбработатьВалютуCML(ЗначениеЭлемента);
			Если НЕ ЗначениеЗаполнено(ТекущийДокумент.Валюта) Тогда
				СообщитьОбОшибкеОбмена("Ошибка в значении узла <Документ>.<Валюта> документа CML (" + ЗначениеЭлемента + ").", Ложь);
				Успешно = Ложь;
			КонецЕсли;	
			
		ИначеЕсли ИмяЭлемента = "Документ.Бонус" Тогда
			
			//ТекущийДокумент.СуммаБонуса = Число(ЗначениеЭлемента);
			
		ИначеЕсли ИмяЭлемента = "Документ.Курс" Тогда
			
			КурсCML = Число(ЗначениеЭлемента);
			ТекущийДокумент.Курс      = КурсCML;
			//ТекущийДокумент.КратностьВзаиморасчетов = 1;
			
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Ид" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("Код", ЗначениеЭлемента);
			ТекущийДокумент.Контрагент = Справочники.Контрагенты.НайтиПоКоду(СокрЛП(ЗначениеЭлемента));
			//ТекущийДокумент.ПунктДоставки = ТекущийДокумент.Контрагент.ОсновнойПунктДоставки;
			
			 // раскоментировать 240222
			ЗаполнитьШапкуДокумента(ТекущийДокумент, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
			УстановитьНомерДокумента2(ТекущийДокумент);
			//		
			
			
			ТекущийДокумент.КодОперации = Перечисления.КодыОперацийОстатки.Реализация;
			
			ТекущийДокумент.ДатаОформления	= ТекущаяДата();
						
			
			//«ЗаполнитьШапкуДокумента» и «КонтрагентПриИзменении» 
			
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Наименование" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("Наименование", ЗначениеЭлемента); 
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Комментарий" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("Комментарий", ЗначениеЭлемента); 
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.ПолноеНаименование"
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.ОфициальноеНаименование" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("НаименованиеПолное", ЗначениеЭлемента); 
			
			Если ИмяЭлемента = "Документ.Контрагенты.Контрагент.ПолноеНаименование" Тогда
				ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ЮрФизЛицо", Перечисления.ЮрФизЛицо.ФизЛицо);
			Иначе
				ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ЮрФизЛицо", Перечисления.ЮрФизЛицо.ЮрЛицо);
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Фамилия" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("Фамилия", ЗначениеЭлемента);
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Имя" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("Имя", ЗначениеЭлемента);
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Отчество" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("Отчество", ЗначениеЭлемента);
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.ДатаРождения" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДатаРождения", ЗначениеЭлемента); 
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.МестоРождения" Тогда	
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("МестоРождения", ЗначениеЭлемента); 
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Пол" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("Пол", ЗначениеЭлемента); 
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.ИНН" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ИНН", ЗначениеЭлемента); 
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.КПП" Тогда		
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("КПП", ЗначениеЭлемента);
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.УдостоверениеЛичности.ВидДокумента"
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.УдостоверениеЛичности.Серия"
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.УдостоверениеЛичности.Номер"
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.УдостоверениеЛичности.ДатаВыдачи"
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.УдостоверениеЛичности.КемВыдан" Тогда		
			
			СохраненноеЗначение = "";
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ДокументУдостоверяющийЛичность", СохраненноеЗначение); 
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДокументУдостоверяющийЛичность", СохраненноеЗначение + ЗначениеЭлемента + " "); 
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.АдресРегистрации.Представление"
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.АдресРегистрации.Комментарий" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ДеревоАдресов", ДеревоАдресов);
			СтрокаДерева = ДеревоАдресов.Строки.Найти("АдресРегистрации", "ВидАдреса");
			СтрокаДерева[ИмяТекущегоЭлемента] = ЗначениеЭлемента;
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДеревоАдресов", ДеревоАдресов);
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.АдресРегистрации.АдресноеПоле.Тип"
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.АдресРегистрации.АдресноеПоле.Значение" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ДеревоАдресов", ДеревоАдресов);
			СтрокаДерева = ДеревоАдресов.Строки.Найти("АдресРегистрации", "ВидАдреса");
			СтрокаАдресногоПоля = СтрокаДерева.Строки[СтрокаДерева.Строки.Количество() - 1];
			СтрокаАдресногоПоля["Поле" + ИмяТекущегоЭлемента] = ЗначениеЭлемента;
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДеревоАдресов", ДеревоАдресов);
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.ЮридическийАдрес.Представление"
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.ЮридическийАдрес.Комментарий" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ДеревоАдресов", ДеревоАдресов);
			СтрокаДерева = ДеревоАдресов.Строки.Найти("ЮридическийАдрес", "ВидАдреса");
			СтрокаДерева[ИмяТекущегоЭлемента] = ЗначениеЭлемента;
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДеревоАдресов", ДеревоАдресов);
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.ЮридическийАдрес.АдресноеПоле.Тип"
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.ЮридическийАдрес.АдресноеПоле.Значение" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ДеревоАдресов", ДеревоАдресов);
			СтрокаДерева = ДеревоАдресов.Строки.Найти("ЮридическийАдрес", "ВидАдреса");
			СтрокаАдресногоПоля = СтрокаДерева.Строки[СтрокаДерева.Строки.Количество() - 1];
			СтрокаАдресногоПоля["Поле" + ИмяТекущегоЭлемента] = ЗначениеЭлемента;
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДеревоАдресов", ДеревоАдресов);
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.КПП" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("КПП", ЗначениеЭлемента); 
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.ОсновнойВидДеятельности" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ОсновнойВидДеятельности", ЗначениеЭлемента); 
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.НомерСчета" 
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.Комментарий" Тогда	
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ТаблицаБанковскихРеквизитов", ТаблицаБанковскихРеквизитов);
			СтрокаТаблицы = ТаблицаБанковскихРеквизитов[ТаблицаБанковскихРеквизитов.Количество() - 1];
			СтрокаТаблицы[ИмяТекущегоЭлемента] = ЗначениеЭлемента;
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ТаблицаБанковскихРеквизитов", ТаблицаБанковскихРеквизитов);
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.Банк.СчетКорреспондентский" 
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.Банк.Наименование"	
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.Банк.БИК"
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.Банк.SWIFT" Тогда	
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ТаблицаБанковскихРеквизитов", ТаблицаБанковскихРеквизитов);
			СтрокаТаблицы = ТаблицаБанковскихРеквизитов[ТаблицаБанковскихРеквизитов.Количество() - 1];
			СтрокаТаблицы.Банк[ИмяТекущегоЭлемента] = ЗначениеЭлемента;
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ТаблицаБанковскихРеквизитов", ТаблицаБанковскихРеквизитов);
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.Банк.Адрес.Представление"	Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ТаблицаБанковскихРеквизитов", ТаблицаБанковскихРеквизитов);
			СтрокаТаблицы = ТаблицаБанковскихРеквизитов[ТаблицаБанковскихРеквизитов.Количество() - 1];
			СтрокаТаблицы.Банк.Адрес[ИмяТекущегоЭлемента] = ЗначениеЭлемента;
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ТаблицаБанковскихРеквизитов", ТаблицаБанковскихРеквизитов);
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.Банк.Адрес.АдресноеПоле.Тип"	
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.Банк.Адрес.АдресноеПоле.Значение" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ТаблицаБанковскихРеквизитов", ТаблицаБанковскихРеквизитов);
			СтрокаТаблицы = ТаблицаБанковскихРеквизитов[ТаблицаБанковскихРеквизитов.Количество() - 1];
			СтрокаАдреса = СтрокаТаблицы.Банк.Адрес.ТаблицаАдресныхПолей[СтрокаТаблицы.Банк.Адрес.ТаблицаАдресныхПолей.Количество() - 1];
			СтрокаАдреса["Поле" + ИмяТекущегоЭлемента] = ЗначениеЭлемента;
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ТаблицаБанковскихРеквизитов", ТаблицаБанковскихРеквизитов);
			
			//Документ.Контрагенты.Контрагент.Адрес.Представление	
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Адрес.Представление"  тогда
			// тут код пункта доставки
			
			
			ПунктДоставки = Справочники.ПунктыДоставки.НайтиПоКоду(ЗначениеЭлемента); 
			
			Если пунктДоставки<> неопределено тогда
				// перезапишем из ПД
				ТекущийДокумент.Контрагент = ПунктДоставки.Владелец;
				ТекущийДокумент.ПунктДоставки = ПунктДоставки;
				
				ЗаполнитьШапкуДокумента(ТекущийДокумент, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
				УстановитьНомерДокумента2(ТекущийДокумент);
				//раскоментировать!!!!!!! 240222
				КонтрагентПриИзменении2(ТекущийДокумент);
				ПунктДоставкиПриИзменении2(ТекущийДокумент);
				ТекущийДокумент.Дата	= ТекущаяДата();
				//
				
				
			КонецЕсли;	
			
					
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ДеревоАдресов", ДеревоАдресов);
			СтрокаДерева = ДеревоАдресов.Строки.Найти("Адрес", "ВидАдреса");
			СтрокаДерева[ИмяТекущегоЭлемента] = ЗначениеЭлемента;
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДеревоАдресов", ДеревоАдресов)
			
			
		ИначеЕсли  ИмяЭлемента = "Документ.Контрагенты.Контрагент.Адрес.Комментарий" Тогда	
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ДеревоАдресов", ДеревоАдресов);
			СтрокаДерева = ДеревоАдресов.Строки.Найти("Адрес", "ВидАдреса");
			СтрокаДерева[ИмяТекущегоЭлемента] = ЗначениеЭлемента;
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДеревоАдресов", ДеревоАдресов);
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Адрес.АдресноеПоле.Тип"	
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.Адрес.АдресноеПоле.Значение" Тогда	
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ДеревоАдресов", ДеревоАдресов);
			СтрокаДерева = ДеревоАдресов.Строки.Найти("Адрес", "ВидАдреса");
			СтрокаАдресногоПоля = СтрокаДерева.Строки[СтрокаДерева.Строки.Количество() - 1];
			СтрокаАдресногоПоля["Поле" + ИмяТекущегоЭлемента] = ЗначениеЭлемента;
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДеревоАдресов", ДеревоАдресов);
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Контакты.Контакт.Тип" 
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.Контакты.Контакт.Значение"
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.Контакты.Контакт.Комментарий" Тогда		
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ТаблицаКонтактов", ТаблицаКонтактов);
			СтрокаТаблицы = ТаблицаКонтактов[ТаблицаКонтактов.Количество() - 1];
			СтрокаТаблицы["Контакт" + ИмяТекущегоЭлемента] = ЗначениеЭлемента;
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ТаблицаКонтактов", ТаблицаКонтактов);
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Представители.Представитель.Контрагент.Наименование" Тогда		
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ТаблицаКонтактныхЛиц", ТаблицаКонтактныхЛиц);
			СтрокаТаблицы = ТаблицаКонтактныхЛиц[ТаблицаКонтактныхЛиц.Количество() - 1];
			СтрокаТаблицы["Наименование"] = ЗначениеЭлемента;
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ТаблицаКонтактныхЛиц", ТаблицаКонтактныхЛиц);
			
		ИначеЕсли ИмяЭлемента = "Документ.Комментарий" Тогда	
			Если ТекущийДокумент.Комментарий<>"" тогда 
				ТекущийДокумент.Комментарий = ТекущийДокумент.Комментарий + ": " + ЗначениеЭлемента;
			иначе
				ТекущийДокумент.Комментарий = ЗначениеЭлемента;
			конецЕсли;
			
		ИначеЕсли ИмяЭлемента = "Документ.Налоги.Налог.УчтеноВСумме" Тогда
			
			//ТекущийДокумент.СуммаВключаетНДС = Ложь;
			//Если ЗначениеЭлемента = БулевоЗначениеCML_Истина Тогда
			//	ТекущийДокумент.СуммаВключаетНДС = Истина;
			//КонецЕсли;	
			
		ИначеЕсли ИмяЭлемента = "Документ.Налоги.Налог.Ставка" Тогда
			
			ТекущийДокумент.УчитыватьНДС = ЗначениеЗаполнено(ЗначениеЭлемента);
			
			Если ТекущийДокумент.УчитыватьНДС Тогда
				
				ТекущаяСтрокаДерева.СтавкаНДС = ПолучитьПоЗначениюДляВыгрузкиСтавкуНДС(ЗначениеЭлемента);
				
			КонецЕсли;	
			
		ИначеЕсли ИмяЭлемента = "Документ.Товары.Товар.СтавкиНалогов.СтавкаНалога.Ставка" Тогда
			
			//ТекущийДокумент.УчитыватьНДС = ЗначениеЗаполнено(ЗначениеЭлемента);
			//
			//Если ТекущийДокумент.УчитыватьНДС Тогда
			//	
			//	ТекущаяСтрокаТоваровУслуг.СтавкаНДС = ПолучитьПоЗначениюДляВыгрузкиСтавкуНДС(ЗначениеЭлемента);
			//	
			//КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "Документ.Скидки.Скидка.Сумма" Тогда
			
			СуммаЧисло = Число(ЗначениеЭлемента);
			ТекущаяСтрокаДерева.СуммаСкидки = СуммаЧисло;
			
		ИначеЕсли ИмяЭлемента = "Документ.Скидки.Скидка.УчтеноВСумме" Тогда
			
			ТекущаяСтрокаДерева.СкидкаВСумме = Ложь;
			Если ЗначениеЭлемента = БулевоЗначениеCML_Истина Тогда
				ТекущаяСтрокаДерева.СкидкаВСумме = Истина;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "Документ.Товары.Товар.Ид"
			ИЛИ ИмяЭлемента = "Документ.Товары.Товар.БазоваяЕдиница"
			ИЛИ ИмяЭлемента = "Документ.Товары.Товар.Наименование" Тогда
			
			ТекущаяСтрокаТоваровУслуг["ТоварУслуга" + ИмяТекущегоЭлемента] = ЗначениеЭлемента;
			
		ИначеЕсли ИмяЭлемента = "Документ.Товары.Товар.ЦенаЗаЕдиницу"
			ИЛИ ИмяЭлемента = "Документ.Товары.Товар.Сумма"
			ИЛИ ИмяЭлемента = "Документ.Товары.Товар.Количество" Тогда
			
			ТекущаяСтрокаТоваровУслуг["ТоварУслуга" + ИмяТекущегоЭлемента] = Число(ЗначениеЭлемента);			  
			
			
		ИначеЕсли ИмяЭлемента = "Документ.Товары.Товар.ЗначенияРеквизитов.ЗначениеРеквизита.Наименование"
			ИЛИ ИмяЭлемента = "Документ.Товары.Товар.ЗначенияРеквизитов.ЗначениеРеквизита.Значение" Тогда
			
			ТекущаяСтрокаСкидок["ЗначениеРеквизита" + ИмяТекущегоЭлемента] = ЗначениеЭлемента;
			
		ИначеЕсли ИмяЭлемента = "Документ.Товары.Товар.Скидки.Скидка.Сумма" Тогда
			
			СуммаЧисло = Число(ЗначениеЭлемента);
			ТекущаяСтрокаСкидок.СуммаСкидки = СуммаЧисло;
			
		ИначеЕсли ИмяЭлемента = "Документ.Товары.Товар.Скидки.Скидка.УчтеноВСумме" Тогда
			
			ТекущаяСтрокаСкидок.СкидкаВСумме = Ложь;
			Если ЗначениеЭлемента = БулевоЗначениеCML_Истина Тогда
				ТекущаяСтрокаСкидок.СкидкаВСумме = Истина;
			КонецЕсли;	
			
		ИначеЕсли ИмяЭлемента = "Документ.ЗначенияРеквизитов.ЗначениеРеквизита.Наименование"
			ИЛИ ИмяЭлемента = "Документ.ЗначенияРеквизитов.ЗначениеРеквизита.Значение" Тогда
			
			ТекущаяСтрокаТоваровУслуг["Свойство" + ИмяТекущегоЭлемента] = ЗначениеЭлемента;
			
		КонецЕсли;
		
		
		///Документ.ЗначенияРеквизитов.ЗначениеРеквизита.Наименование"   значение =  "метод оплаты" как пример
		///Документ.ЗначенияРеквизитов.ЗначениеРеквизита.Значение
		
		
		
		
		
	КонецЕсли; 
	
	Возврат Успешно;
	
КонецФункции

Функция РазобратьCML(СтрокаCML)
	
	Успешно = Истина;
	
	ОбъектCML = Новый ЧтениеXML;
	
	Попытка
		ОбъектCML.УстановитьСтроку(СтрокаCML);
	Исключение
		СообщитьОбИсключительнойОшибке(Ложь);
		Возврат Неопределено;
	КонецПопытки;
	
	ПоследовательностьЭлементов = "";
	
	ДеревоДокументов = Новый ДеревоЗначений;
	
	ДеревоДокументов.Колонки.Добавить("ДокументОбъект");
	ДеревоДокументов.Колонки.Добавить("НомерВходящий");
	ДеревоДокументов.Колонки.Добавить("РанееЗагруженныйДокументСсылка", Новый ОписаниеТипов("ДокументСсылка.Заказ"));   //  ПродажаИм
	ДеревоДокументов.Колонки.Добавить("ЕстьСсылкиНаРанееЗагруженныйДокумент", Новый ОписаниеТипов("Булево"));
	ДеревоДокументов.Колонки.Добавить("СтруктураДанныхКонтрагента");
	ДеревоДокументов.Колонки.Добавить("СтавкаНДС");
	ДеревоДокументов.Колонки.Добавить("Бонус");
	
	
	// Подчинение документу
	
	ДеревоДокументов.Колонки.Добавить("ТоварУслугаТипНоменклатуры");
	ДеревоДокументов.Колонки.Добавить("ТоварУслугаНаименование");
	ДеревоДокументов.Колонки.Добавить("ТоварУслугаБазоваяЕдиницаКод");
	ДеревоДокументов.Колонки.Добавить("ТоварУслугаБазоваяЕдиница");
	ДеревоДокументов.Колонки.Добавить("ТоварУслугаСумма");
	ДеревоДокументов.Колонки.Добавить("ТоварУслугаКомментарий");
	ДеревоДокументов.Колонки.Добавить("ТоварУслугаЦенаЗаЕдиницу");
	ДеревоДокументов.Колонки.Добавить("ТоварУслугаКоличество");
	ДеревоДокументов.Колонки.Добавить("ТоварУслугаИд");
	
	ДеревоДокументов.Колонки.Добавить("СвойствоНаименование");
	ДеревоДокументов.Колонки.Добавить("СвойствоЗначение");
	
	// Подчинение товарам/услугам
	
	ДеревоДокументов.Колонки.Добавить("СуммаСкидки", Новый ОписаниеТипов("Число"));
	ДеревоДокументов.Колонки.Добавить("СкидкаВСумме", Новый ОписаниеТипов("Булево"));
	
	ДеревоДокументов.Колонки.Добавить("ЗначениеРеквизитаНаименование");
	ДеревоДокументов.Колонки.Добавить("ЗначениеРеквизитаЗначение");
	
	Пока Истина Цикл
		
		ОчереднойУзелCMLПрочитан = Ложь;
		
		Попытка
			ОчереднойУзелCMLПрочитан = ОбъектCML.Прочитать();
		Исключение
			Успешно = Ложь;
			СообщитьОбИсключительнойОшибке(Ложь);
			Прервать;
		КонецПопытки;	
		
		Если НЕ ОчереднойУзелCMLПрочитан Тогда
			Прервать;
		КонецЕсли;	
		
		ТипУзла = ОбъектCML.ТипУзла;
		ИмяУзла = ОбъектCML.Имя;
		
		Если ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			ПоследовательностьЭлементов = ДобавитьЭлементКПоследовательности(ПоследовательностьЭлементов, ИмяУзла);
			Успешно = ОбработатьНачалоЭлемента(ОбъектCML, ПоследовательностьЭлементов, ДеревоДокументов);
			Если НЕ Успешно Тогда
				СообщитьПользователю("Не удалось обработать начало элемента (" + ПоследовательностьЭлементов + ").", Ложь);
				Прервать;
			КонецЕсли;	
			
		ИначеЕсли ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			
			ПоследовательностьЭлементов = УдалитьПоследнийЭлементИзПоследовательности(ПоследовательностьЭлементов);
			
		ИначеЕсли ТипУзла = ТипУзлаXML.Текст Тогда	
			
			ЗначениеЭлемента = ОбъектCML.Значение;  
			Успешно = ОбработатьЗначениеЭлемента2(ПоследовательностьЭлементов, ЗначениеЭлемента, ДеревоДокументов);
			Если НЕ Успешно Тогда
				СообщитьПользователю("Не удалось обработать значение элемента (" + ПоследовательностьЭлементов + ") = (" + ЗначениеЭлемента + ").", Ложь);
				Прервать;
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбъектCML.Закрыть();
	
	Если НЕ Успешно Тогда
		ДеревоДокументов = Неопределено;
	КонецЕсли;	
	
	Возврат ДеревоДокументов;
	
КонецФункции	

Функция ДобавитьЭлементКПоследовательности(Знач ПоследовательностьЭлементов, Знач ИмяУзла)
	
	ИсключатьИзПоследовательности = Новый Массив;
	ИсключатьИзПоследовательности.Добавить("КоммерческаяИнформация");
	
	Если ИсключатьИзПоследовательности.Найти(ИмяУзла) = Неопределено Тогда
		
		Если НЕ ПоследовательностьЭлементов = "" Тогда
			ПоследовательностьЭлементов = ПоследовательностьЭлементов + ".";	
		КонецЕсли;	
		ПоследовательностьЭлементов = ПоследовательностьЭлементов + ИмяУзла;
		
	КонецЕсли;
	
	Возврат ПоследовательностьЭлементов;
	
КонецФункции	

Функция УдалитьПоследнийЭлементИзПоследовательности(Знач ПоследовательностьЭлементов);
	
	ПромСтрока 			= СтрЗаменить(ПоследовательностьЭлементов, ".", Символы.ПС);
	КоличествоЭлементов = СтрЧислоСтрок(ПромСтрока);
	
	ПоследовательностьЭлементов	= "";
	Если КоличествоЭлементов > 0 Тогда
		КоличествоЭлементов = КоличествоЭлементов - 1;
		Для Счетчик = 1 По КоличествоЭлементов Цикл
			ПоследовательностьЭлементов	= ПоследовательностьЭлементов + "." + СтрПолучитьСтроку(ПромСтрока, Счетчик);
		КонецЦикла;	
		ПоследовательностьЭлементов = Прав(ПоследовательностьЭлементов, СтрДлина(ПоследовательностьЭлементов) - 1);
	КонецЕсли;
	
	Возврат ПоследовательностьЭлементов;
КонецФункции	

Функция ПолучитьИмяЭлементаИзПоследовательности(Знач ПоследовательностьЭлементов)
	
	ПромСтрока 			= СтрЗаменить(ПоследовательностьЭлементов, ".", Символы.ПС);
	КоличествоЭлементов = СтрЧислоСтрок(ПромСтрока);
	
	ИмяПоследнегоЭлемента = "";
	Если КоличествоЭлементов > 0 Тогда
		ИмяПоследнегоЭлемента = СтрПолучитьСтроку(ПромСтрока, КоличествоЭлементов);
	КонецЕсли;
	
	Возврат ИмяПоследнегоЭлемента;
	
КонецФункции	



Функция ОбработатьДокументы(ДеревоДокументов, КоличествоОбработанныхДокументов)  Экспорт
	
//	возврат истина;

	Успешно = Истина;
	КоличествоОбработанныхДокументов = 0;
	
	СтруктураСтатистики = Новый Структура;
	СтруктураСтатистики.Вставить("Создано"  , 0);
	СтруктураСтатистики.Вставить("Обновлено", 0);
	СтруктураСтатистики.Вставить("Пропущено", 0);
	СтруктураСтатистики.Вставить("ОплаченСписок", Новый Массив);
	СтруктураСтатистики.Вставить("ДоставкаРазрешенаСписок", Новый Массив);
	СтруктураСтатистики.Вставить("ФинальныйСтатусСписок", Новый Массив);
	
	ОтобразитьСостояние("Поиск ранее загруженных документов...");
	
	ПолучитьРанееЗагруженныеДокументы(ДеревоДокументов);
	
		
	//*********************************************************************************************
	// тут перезаписываем изменения номенклатуры в ранее загруженном и для новых заказов.
	Успешно = ИдентифицироватьНоменклатуру(ДеревоДокументов);
	Если НЕ Успешно Тогда
		//ОтменитьТранзакцию();
		ЗаписатьВЛог("ОбменССайтом","Не удалось найти/создать номенклатуру.","Информация"); 
		СообщитьПользователю("Не удалось найти/создать номенклатуру.", Ложь);
		Возврат Ложь;
	КонецЕсли;
	
	
	//************ тут !!!!
	МассивДокументовДляПроведения = Новый Массив();
	Успешно = СоздатьОбновитьДокументы(ДеревоДокументов, СтруктураСтатистики, МассивДокументовДляПроведения, мМассивЗагруженныхДокументов);	
	Если НЕ Успешно Тогда
		//ОтменитьТранзакцию();
		ЗаписатьВЛог("ОбменССайтом","Не удалось создать/обновить документы.","Информация"); 
		СообщитьПользователю("Не удалось создать/обновить документы.", Ложь);
		Возврат Ложь;
	КонецЕсли;
	
	
	МассивОтклоненныхДокументов = Новый Массив(); // способ доставки и т.д.
	Успешно = ЗаписатьСвойстваДокументов(ДеревоДокументов, СтруктураСтатистики, МассивОтклоненныхДокументов);
	Если НЕ Успешно Тогда
		//ОтменитьТранзакцию();
		ЗаписатьВЛог("ОбменССайтом","Не удалось записать свойства документов.","Информация"); 
		СообщитьПользователю("Не удалось записать свойства документов.", Ложь);
		Возврат Ложь;
	КонецЕсли;
	
	//ЗафиксироватьТранзакцию();  ///!!!!!!!!!!!!!!!!!!!
	
	ОтобразитьСостояние("Проведение загруженных документов...");
	
	// если документы нужно проводить, то попытаемся их провести
	РежимПроведения = ?(ПроводитьДокументыОперативно, РежимПроведенияДокумента.Оперативный, РежимПроведенияДокумента.Неоперативный);
	Для Каждого ДокументПроведения Из МассивДокументовДляПроведения Цикл
		
		Если МассивОтклоненныхДокументов.Найти(ДокументПроведения.Ссылка) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДокументПРоведения = документы.Заказ.ПустаяСсылка() тогда
			продолжить;
		КонецЕсли;	
		
		Попытка
			Докк=ДокументПроведения.ПолучитьОбъект();		
			Докк.ПометкаУдаления=Ложь;
			Докк.Записать(РежимЗаписиДокумента.Проведение, РежимПроведения);			
			
		Исключение
			ЗаписатьВЛог("ОбменССайтом", "Ошибка при проведении документа: " + Строка(ДокументПроведения) + Символы.ПС + ОписаниеОшибки(),"Информация");                     
			СообщитьОбИсключительнойОшибке(Ложь, "Ошибка при проведении документа: " + Строка(ДокументПроведения) + Символы.ПС + ОписаниеОшибки());
			Возврат Ложь;
			
		КонецПопытки;
		
	КонецЦикла;
	
		
	
	Для Каждого ДокументПроведения Из МассивОтклоненныхДокументов Цикл
		ДокОбъект = ДокументПроведения.ПолучитьОбъект();
		Если ДействияСОтмененнымиЗаказами = 0 Тогда // Удалять
			Если НЕ ДокОбъект.ПометкаУдаления Тогда
				ДокОбъект.ПометкаУдаления = Истина;
				Попытка
					ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);			
				Исключение
					ЗаписатьВЛог("ОбменССайтом", "Ошибка при установке пометки на удаление документа: " + Строка(ДокументПроведения) + Символы.ПС + ОписаниеОшибки(),"Информация");                     
					СообщитьОбИсключительнойОшибке(Ложь, "Ошибка при установке пометки на удаление документа: " + Строка(ДокументПроведения) + Символы.ПС + ОписаниеОшибки());
					Возврат Ложь;
				КонецПопытки;
			КонецЕсли;	
		Иначе // отменять
			Если ДокОбъект.Проведен Тогда
				Попытка
					ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);			
				Исключение
					ЗаписатьВЛог("ОбменССайтом", "Ошибка при отмене проведения документа: " + Строка(ДокументПроведения) + Символы.ПС + ОписаниеОшибки(),"Информация");                     
					СообщитьОбИсключительнойОшибке(Ложь, "Ошибка при отмене проведения документа: " + Строка(ДокументПроведения) + Символы.ПС + ОписаниеОшибки());
					Возврат Ложь;
				КонецПопытки;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	
	
	
	
	//Если Док.ДокументОбъект.состояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе или 
	//	Док.ДокументОбъект.состояниеНакладной=Перечисления.СостоянияНакладной.Отгружена 
	//	Попытка
	//		Док.ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//	исключение
	//		СообщитьОбИсключительнойОшибке(Ложь, ОписаниеОшибки());
	//	конецПопытки;
	//	
	//Иначе
	//
	//	Попытка
	//		Док.ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	//	исключение
	//		СообщитьОбИсключительнойОшибке(Ложь, ОписаниеОшибки());
	//		Возврат Ложь;
	//		
	//	конецПопытки;
	//КонецЕсли;	
	//
	//
	//
	
	
	//Если НЕ ДействияСОтмененнымиЗаказами = 3 Тогда // Ничего
	//	Если ДействияСОтмененнымиЗаказами = 2 Тогда // закрыть
	//		Информация = "";
	//		Если ЗакрытьЗаказы(МассивОтклоненныхДокументов, Информация) Тогда
	//			Если НЕ ПустаяСтрока(Информация) Тогда
	//				СообщитьПользователю("Сформирован и проведен документ " + Информация, Ложь);
	//			КонецЕсли;	
	//		Иначе	
	//			СообщитьОбИсключительнойОшибке(Ложь, Информация + Символы.ПС + ОписаниеОшибки());
	//			Возврат Ложь;
	//		КонецЕсли;	
	//	Иначе	
	//		Для Каждого ДокументПроведения Из МассивОтклоненныхДокументов Цикл
	//			ДокОбъект = ДокументПроведения.ПолучитьОбъект();
	//			Если ДействияСОтмененнымиЗаказами = 0 Тогда // Удалять
	//				Если НЕ ДокОбъект.ПометкаУдаления Тогда
	//					ДокОбъект.ПометкаУдаления = Истина;
	//					Попытка
	//						ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);			
	//					Исключение
	//						СообщитьОбИсключительнойОшибке(Ложь, "Ошибка при установке пометки на удаление документа: " + Строка(ДокументПроведения) + Символы.ПС + ОписаниеОшибки());
	//						Возврат Ложь;
	//					КонецПопытки;
	//				КонецЕсли;	
	//			Иначе // отменять
	//				Если ДокОбъект.Проведен Тогда
	//					Попытка
	//						ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);			
	//					Исключение
	//						СообщитьОбИсключительнойОшибке(Ложь, "Ошибка при отмене проведения документа: " + Строка(ДокументПроведения) + Символы.ПС + ОписаниеОшибки());
	//						Возврат Ложь;
	//					КонецПопытки;
	//				КонецЕсли;	
	//			КонецЕсли;	
	//		КонецЦикла;	
	//	КонецЕсли;
	//КонецЕсли;
	
	// не нужно регистрировать изменения для только что загруженных документов
	//Если мМассивЗагруженныхДокументов.Количество() <> 0 Тогда
	//	
	//	МассивУзлов = ПроцедурыОбменаССайтом.ПолучитьМассивУзловДляРегистрации(Ложь);
	//	
	//	Для Каждого СсылкаНаДокумент Из мМассивЗагруженныхДокументов Цикл
	//		ПланыОбмена.УдалитьРегистрациюИзменений(МассивУзлов, СсылкаНаДокумент);
	//	КонецЦикла;		
	//			
	//КонецЕсли;
	
	Отступ = Символы.НПП + Символы.НПП;
	
	КоличествоОбработанныхДокументов = ДеревоДокументов.Строки.Количество();
	
	Если КоличествоОбработанныхДокументов > 0 Тогда
		
		ТекстСообщения = "Успешно получено и обработано документов: " + Строка(КоличествоОбработанныхДокументов);
		
		
		ТекстСообщения = ТекстСообщения + Символы.ПС + "Список обработанных документов: ";		
		Для Каждого СтрокаДД Из ДеревоДокументов.Строки Цикл
			ТекстСообщения = ТекстСообщения + Символы.ПС + Отступ + СтрокаДД.ДокументОбъект.Ссылка;
		КонецЦикла;
		
		ТекстСообщения = ТекстСообщения + Символы.ПС + "В том числе:";
		Если СтруктураСтатистики.Создано <> 0 Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + Отступ + "создано новых: " + СтруктураСтатистики.Создано;
		КонецЕсли;
		
		Если СтруктураСтатистики.Обновлено <> 0 Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + Отступ + "обновлено: " + СтруктураСтатистики.Обновлено;
		КонецЕсли;
		
		Если СтруктураСтатистики.Пропущено <> 0 Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + Отступ + "пропущено: " + СтруктураСтатистики.Пропущено;
		КонецЕсли;
		
		Если СтруктураСтатистики.ОплаченСписок.Количество() > 0 Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + "Получено оплаченных документов: " + СтруктураСтатистики.ОплаченСписок.Количество();
			Для Каждого Док Из СтруктураСтатистики.ОплаченСписок Цикл
				ТекстСообщения = ТекстСообщения + Символы.ПС + Отступ + Док;
			КонецЦикла;
		КонецЕсли;	
		
		Если СтруктураСтатистики.ДоставкаРазрешенаСписок.Количество() > 0 Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + "Получено документов с разрешенной доставкой: " + СтруктураСтатистики.ДоставкаРазрешенаСписок.Количество();
			Для Каждого Док Из СтруктураСтатистики.ДоставкаРазрешенаСписок Цикл
				ТекстСообщения = ТекстСообщения + Символы.ПС + Отступ + Док;
			КонецЦикла;
		КонецЕсли;	
		
		Если СтруктураСтатистики.ФинальныйСтатусСписок.Количество() > 0 Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + "Получено документов в финальном статусе: " + СтруктураСтатистики.ФинальныйСтатусСписок.Количество();
			Для Каждого Док Из СтруктураСтатистики.ФинальныйСтатусСписок Цикл
				ТекстСообщения = ТекстСообщения + Символы.ПС + Отступ + Док;
			КонецЦикла;
		КонецЕсли;
		
		СообщитьПользователю(ТекстСообщения, Ложь);
		
	КонецЕсли;
	
	Возврат Успешно;
	
КонецФункции	

Функция ЗакрытьЗаказы(МассивДокументов, Информация)
	
	Если МассивДокументов.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	ЗакрытиеЗаказовПокупателейЗаказы.Ссылка
	|ИЗ
	|	Документ.ЗакрытиеЗаказовПокупателей.Заказы КАК ЗакрытиеЗаказовПокупателейЗаказы
	|ГДЕ
	|	ЗакрытиеЗаказовПокупателейЗаказы.Ссылка.Проведен
	|	И ЗакрытиеЗаказовПокупателейЗаказы.ПродажаИМ = &ЗаказПокупателя");
	
	Док = Документы.ЗакрытиеЗаказовПокупателей.СоздатьДокумент();
	Док.ВидОперации=Перечисления.ВидыОперацийЗакрытиеЗаказовПокупателей.ЗакрытиеЗаказов;
	Док.Дата = ТекущаяДата();
	Док.Комментарий = "Создан автоматически при обмене с сайтом";
	Док.Ответственный = параметрысеанса.Пользователь; //глЗначениеПеременной("глТекущийПользователь");
	
	Для Каждого ДокЗаказ Из МассивДокументов Цикл
		Запрос.УстановитьПараметр("ЗаказПокупателя", ДокЗаказ);
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			Продолжить;
		КонецЕсли;	
		НовСтрока = Док.Заказы.Добавить();
		НовСтрока.ЗаказПокупателя = ДокЗаказ;
		НовСтрока.ПричинаЗакрытияЗаказа = ПричинаЗакрытияЗаказов;
	КонецЦикла;	
	
	Если Док.Заказы.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;	
	
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
		Информация = Строка(Док);
	Исключение
		Информация = "Не удалось провести документ " + Док + " по причине: " + ОписаниеОшибки();
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
КонецФункции

Процедура ПолучитьРанееЗагруженныеДокументы(ДеревоДокументов)
	
	МассивНомеров = ДеревоДокументов.Строки.ВыгрузитьКолонку("НомерВходящий");
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Категория"	 , Справочники.КатегорииОбъектов.ЗаказСWEBСайта);
	Запрос.УстановитьПараметр("МассивНомеров", МассивНомеров);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заказ.Ссылка КАК ДокументСсылка
	|ИЗ
	|   Документ.Заказ КАК Заказ
	|   Внутреннее соединение РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	|		ПО (КатегорииОбъектов.Объект = Заказ.Ссылка)
	|			И КатегорииОбъектов.Категория = Значение(Справочник.КатегорииОбъектов.ЗаказСWEBСайта)
	|ГДЕ
	|	Заказ.НомерЗаказа В (&МассивНомеров)";		
	
	РезультатЗапроса = Запрос.Выполнить();	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	МассивНайденныхСсылокНаДокументы = Новый Массив();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрокаДД = ДеревоДокументов.Строки.Найти(Выборка.ДокументСсылка.НомерЗаказа, "НомерВходящий");
		СтрокаДД.РанееЗагруженныйДокументСсылка = Выборка.ДокументСсылка;			
		
		МассивНайденныхСсылокНаДокументы.Добавить(Выборка.ДокументСсылка);
		
	КонецЦикла;
	
	
	// ищем ссылки на ранее загруженные документы
	// тут товары еще не загружены в новый документ 
	ТаблицаСсылок = НайтиПоСсылкам(МассивНайденныхСсылокНаДокументы);
	
	Для Каждого СтрокаТС Из ТаблицаСсылок Цикл
		
		Если Метаданные.РегистрыСведений.Содержит(СтрокаТС.Метаданные)
			ИЛИ СтрокаТС.Данные = СтрокаТС.Ссылка Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		СтрокаДД = ДеревоДокументов.Строки.Найти(СтрокаТС.Ссылка, "РанееЗагруженныйДокументСсылка");
		Если СтрокаДД<>Неопределено тогда
			СтрокаДД.ЕстьСсылкиНаРанееЗагруженныйДокумент = Истина;
		конецесли;
		
	КонецЦикла;	
	
	
	Для Каждого СтрокаДД Из ДеревоДокументов.Строки Цикл
		
		
		Если НЕ ЗначениеЗаполнено(СтрокаДД.РанееЗагруженныйДокументСсылка) Тогда
			Продолжить;
		КонецЕсли;
		
		
		ДокументОбъект = СтрокаДД.РанееЗагруженныйДокументСсылка.ПолучитьОбъект();
		
		//  //крохин начало 18.11.2021
		//  СтрокаДД.ДокументОбъект = ДокументОбъект;
		//Продолжить;
		//крохин конец 18.11.2021
		
		
		Если НЕ СтрокаДД.ЕстьСсылкиНаРанееЗагруженныйДокумент Тогда
			
			ЗаполнитьЗначенияСвойств(ДокументОбъект, СтрокаДД.ДокументОбъект, , "Номер"); 
			//	ДокументОбъект.Товары.Очистить();
			//	ДокументОбъект.Услуги.Очистить();
			
			
		КонецЕсли;	
		
		
		// уже не очищаем, а перезаписываем соотв. значения. подтв. заявка и количество
		
		// ??? стутус документа где меняем????	
		
		//СтрокаДД.ДокументОбъект = ДокументОбъект;		
		
	КонецЦикла;
	
КонецПроцедуры	

Функция ОбработатьДатуВремяCML(ДатаВремяСтрока, НачальнаяДата = Неопределено)
	
	ДатаВремя = Неопределено;
	
	Если ЗначениеЗаполнено(НачальнаяДата) Тогда
		Время 	  = СтрЗаменить(ДатаВремяСтрока, ":", "");
		ДатаВремя = Дата(Формат(НачальнаяДата, "ДФ=yyyyMMdd") + Время);
	Иначе	
		ДатаВремя = Дата(СтрЗаменить(ДатаВремяСтрока, "-", "") + "000000");	
	КонецЕсли;	
	
	Возврат ДатаВремя;
КонецФункции

Функция ОбработатьВалютуCML(КодВалютыСтрока)
	
	Валюта = Справочники.Валюты.НайтиПоНаименованию(КодВалютыСтрока);
	Возврат Валюта;
	
КонецФункции	


Функция СоздатьОбновитьДокументы(ДеревоДокументов, СтруктураСтатистики, МассивДокументовДляПроведения, МассивЗагруженныхДокументов)
	
	
	// создание документов Заказ.
	//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!+++++++!!!!!!!!
	
	
	Успешно = Истина;
	//сообщить("------------- создать оюновить документы");
	Для Каждого Док Из ДеревоДокументов.Строки Цикл
		
		НовыйДокумент = Истина;
		ПризнакПроведения=Док.РанееЗагруженныйДокументСсылка.Проведен;
		
		Попытка
			ДокЗагруженныйОб = Док.РанееЗагруженныйДокументСсылка.получитьОбЪект();
		Исключение
			ДокЗагруженныйОб =неопределено;
		КонецПопытки;
		
		Если ДокЗагруженныйОб <> неопределено Тогда
			
			НовыйДокумент=ложь;
			
		КонецЕсли;	
		
		
		// если не 3 статуса, тогда только обновляем статусы на сайте, номенклатуру, документы не перезаписываем!!!
		ТаблицаСтрок=Док.строки;  
		// тут все параметры считаны, доп. реквизиты.
		Обновлять=Ложь;   
		
		//--------------------------------------------------------------------------
		СтатусЗаказа=""; // имя колонки
		
		НайденнаяСтрока = ТаблицаСтрок.Найти("Статуса заказа ИД", "СвойствоНаименование");
		
		Если НайденнаяСтрока = Неопределено Тогда
		Иначе
			СтатусЗаказа = СокрЛП(НайденнаяСтрока.СвойствоЗначение);
		КонецЕсли;
		
		//--------------------------------------------------------------------------
		НайденнаяСтрока = ТаблицаСтрок.Найти("Статус заказа", "СвойствоНаименование");
		ЗначениеСтатуса=Неопределено;
		Если НайденнаяСтрока = Неопределено Тогда
		Иначе
			ЗначениеСтатуса = НайденнаяСтрока.СвойствоЗначение;
		КонецЕсли;
		//--------------------------------------------------------------------------
		// "Комментарии покупателя"
		КомментарииПокупателя = "";
		НайденнаяСтрока = ТаблицаСтрок.Найти("Комментарии покупателя", "СвойствоНаименование");
		
		Если НайденнаяСтрока = Неопределено Тогда
		Иначе
			КомментарииПокупателя = СокрЛП(НайденнаяСтрока.СвойствоЗначение);
		КонецЕсли;
		Если новыйДокумент Тогда
			Док.ДокументОбъект.комментарий = КомментарииПокупателя;
		КонецЕсли;

		//----------------------------------------------------------------------
		// пока для подстраховки
		//"Отменен"
		ЗаказОтменен = ложь; // имя колонки
		
		НайденнаяСтрока = ТаблицаСтрок.Найти("Отменен", "СвойствоНаименование");
		
		Если НайденнаяСтрока = Неопределено Тогда
		Иначе
			ЗаказОтменен = СокрЛП(НайденнаяСтрока.СвойствоЗначение);
			Если ЗаказОтменен Тогда
				СтатусЗаказа = "D"
			конецЕсли;	
		КонецЕсли;
		ЕстьИзмененияСтатуса = истина;
		// проверим , что есть изменения статуса, тогда меняем данные
		Если не НовыйДокумент ТОгда
			Если СтатусЗаказа = "D" и 
				(Док.РанееЗагруженныйДокументСсылка.состояниеСогласования = перечисления.СостоянияСогласования.ОтмененКонтрагент или 
				Док.РанееЗагруженныйДокументСсылка.состояниеСогласования = перечисления.СостоянияСогласования.ОтмененЦО) ТОгда
				
				СтруктураСтатистики.Пропущено = СтруктураСтатистики.Пропущено + 1;
				ЕстьИзмененияСтатуса = ложь;  // для уже отмененных и отмеченных дальше ничего не делаем
				
				продолжить;
				
			КонецЕсли;
			
		КонецЕсли;
		
		
		// все равно нужно загрузить, иначе битрикс его до бесконечности будет отправлять
		Если НовыйДокумент и  СтатусЗаказа = "D" ТОгда
			
				
			Док.ДокументОбъект.состояниеСогласования = перечисления.СостоянияСогласования.ОтмененКонтрагент;
			
		КонецЕсли;	
		
		
		//-----------------------------------------------
		
		НеПерезаписывать= ложь; ///   Док.РанееЗагруженныйДокументСсылка.БольшеНеПерезаписыватьДокумент;
		Если ЗначениеСтатуса<>Неопределено Тогда
			Если СтрЧислоВхождений(ЗначениеСтатуса, "[A]")>0  или СтрЧислоВхождений(ЗначениеСтатуса, "[N]")>0 
				или СтрЧислоВхождений(ЗначениеСтатуса, "[D]")>0  или СтрЧислоВхождений(ЗначениеСтатуса, "[P]")>0
				Тогда
				Обновлять=Истина;
			КонецЕСли;
		КонецЕсли;
		
		// d B P только статусы меняем и все.
		//--------------------------------------------------------------------------------------------
		Если СтатусЗаказа = "D" и не НовыйДокумент Тогда
			попытка
				ДокРанееЗагр = ДокЗагруженныйОб;
				ДокРанееЗагр.состояниеСогласования = перечисления.СостоянияСогласования.ОтмененКонтрагент;
				ДокРанееЗагр.записать();
				
				СтруктураСтатистики.Обновлено = СтруктураСтатистики.Обновлено + 1;
				НовыйДокумент = Ложь;
				
				Если ПризнакПроведения Тогда
					
					МассивДокументовДляПроведения.Добавить(Док.ДокументОбъект.ссылка);
					
				КонецЕсли;	
				
				продолжить;
			исключение
			//	сообщить(ОписаниеОшибки());
			конецпопытки;
		КонецЕсли;	
		
		//*************************************************
		//попытка
		Если СтатусЗаказа = "P" и Док.РанееЗагруженныйДокументСсылка.состояниеСогласования <> перечисления.СостоянияСогласования.Согласован и не НовыйДокумент Тогда
			попытка
				ДокРанееЗагр = ДокЗагруженныйОб;
				ДокРанееЗагр.состояниеСогласования = перечисления.СостоянияСогласования.Согласован;
			исключение
				
				
			конецПопытки;
			
		КонецЕсли;	
		//***********************************************
		
		Если (СтатусЗаказа = "A") и НЕ НовыйДокумент Тогда      //    			
			ДокРанееЗагр = ДокЗагруженныйОб;
			//ДокРанееЗагр.состояниеСогласования = перечисления.СостоянияСогласования.ОтправленКонтаргенту; 
			ДокРанееЗагр.состояниеСогласования = перечисления.СостоянияСогласования.НаСогласованииКонтрагент;
			ДокРанееЗагр.записать();
			СтруктураСтатистики.Обновлено = СтруктураСтатистики.Обновлено + 1;

			Если ПризнакПроведения Тогда
				
				МассивДокументовДляПроведения.Добавить(Док.ДокументОбъект.ссылка);
				
			КонецЕсли;	

			продолжить;
			
		КонецЕсли;	
		
		///   тут запись документов
		Если (СтатусЗаказа = "N") и НЕ НовыйДокумент Тогда    			
			
			ДокРанееЗагр = ДокЗагруженныйОб; 
			ДокРанееЗагр.состояниеСогласования = перечисления.СостоянияСогласования.НаСогласованииЦО;
			
			
		КонецЕсли;	

		
		
		// --------------------------------------------------------------------------------------------
		// отладка	
		//	сообщить(""+Док.ДокументОбъект.НомерВходящегоДокументаЭлектронногоОбмена+"  "+Значение+"   "+Док.РанееЗагруженныйДокументСсылка+"  "+Обновлять);
		
		//-----------------------------------------------------------------------------
		Если Не Обновлять или НеПерезаписывать Тогда
			продолжить;
		КонецЕсли;	
		//-----------------------------------------------------------------------------
		
				
		// если на документ есть ссылки, то он вообще пропускается и не загружается  !!!
		Если Док.ЕстьСсылкиНаРанееЗагруженныйДокумент Тогда
			СтруктураСтатистики.Пропущено = СтруктураСтатистики.Пропущено + 1;
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Док.РанееЗагруженныйДокументСсылка) Тогда
			СтруктураСтатистики.Обновлено = СтруктураСтатистики.Обновлено + 1;
			НовыйДокумент = Ложь;
		Иначе
			СтруктураСтатистики.Создано   = СтруктураСтатистики.Создано + 1;
		КонецЕсли;	
		
		Попытка
			
			// отдельная работа с комментарием
			Если Не ПустаяСтрока(Док.ДокументОбъект.Комментарий) Тогда
				Попытка
					СтрокаИмениСайта = Док.Строки.Найти("Сайт", "СвойствоНаименование");
					Если СтрокаИмениСайта = Неопределено Тогда
						ИмяСайта = HTTPОбменСервер;
					Иначе					
						ИмяСайта = СтрокаИмениСайта.СвойствоЗначение;
					КонецЕсли;
					Док.ДокументОбъект.Комментарий   = Док.ДокументОбъект.Комментарий ; //+ " " + ИмяСайта;
				Исключение
				КонецПопытки;
			КонецЕсли;
			
			
			
			Если НЕ НовыйДокумент Тогда
				
				// ранее загруж. пересчитаем
						
				ПересчетТЧ(ДокЗагруженныйОб,"Товары",Рубли,Рубли,1,1,Истина); 
				
			Иначе
				// это новый документ    ++++++++++
				УстановитьНомерДокумента2(Док.ДокументОбъект);
				пп=1;
				
				Док.ДокументОбъект.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.ВРаботе;
					
				// статус тут прописывать?!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
				
				
				//-------------------------------------
				ПересчетТЧ(Док.ДокументОбъект,"Товары",Рубли,Рубли,1,1,Истина); 
				
			КонецЕсли;	
			
			Если новыйДокумент тогда
				Попытка
					
					Док.ДокументОбъект.дата = текущаядата();
					Док.ДокументОбъект.Записать(); // ???? Зачем новый записывать, 
					
					
				Исключение
					СообщитьОбИсключительнойОшибке(Ложь,""+ Док.ДокументОбъект+ ОписаниеОшибки());
					ЗаписатьВЛог("ОбменССайтом",""+ Док.ДокументОбъект+ОписаниеОшибки(),"");
					Возврат Ложь;
				конецПопытки;
				
				
				Если ПризнакПроведения Тогда
					
					МассивДокументовДляПроведения.Добавить(Док.ДокументОбъект.ссылка);
					
				КонецЕсли;	
			Иначе	
				попытка
					ДокЗагруженныйОб.записать();
				исключение
					СообщитьОбИсключительнойОшибке(Ложь,""+ДокЗагруженныйОб+ ОписаниеОшибки());
					ЗаписатьВЛог("ОбменССайтом",""+ ДокЗагруженныйОб +ОписаниеОшибки(),"");
					Возврат Ложь;
				конецПопытки;
				
			конецЕсли;
			
			
			
			//*********************************************			
			
			//	Если ПризнакПроведения и НЕ Док.ДокументОбъект.ПометкаУдаления  ТОгда
			//		
			//		//МассивДокументовДляПроведения.Добавить(Док.ДокументОбъект);
			//		Попытка
			//			Док.ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			//		Исключение
			//			СообщитьОбИсключительнойОшибке(Ложь,""+ Док.ДокументОбъект+ ОписаниеОшибки());
			//			ЗаписатьВЛог("ОбменССайтом",""+ Док.ДокументОбъект+ОписаниеОшибки(),"");
			//			Возврат Ложь;
			//		конецПопытки;
			//		
			//	КонецЕсли;	
			//
			//	
			//	Если ПризнакПроведения и Док.ДокументОбъект.ПометкаУдаления  ТОгда
			//	Попытка
			//			Док.ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			//		Исключение
			//			СообщитьОбИсключительнойОшибке(Ложь,""+ Док.ДокументОбъект+ ОписаниеОшибки());
			//			ЗаписатьВЛог("ОбменССайтом",""+ Док.ДокументОбъект+ОписаниеОшибки(),"");
			//			Возврат Ложь;
			//   		конецПопытки;
			//КонецЕсли;
			//	
			//	
			//	Если НЕ ПризнакПроведения ТОгда
			//		Попытка
			//			Док.ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			//		Исключение
			//			СообщитьОбИсключительнойОшибке(Ложь,""+ Док.ДокументОбъект+ ОписаниеОшибки());
			//			ЗаписатьВЛог("ОбменССайтом",""+ Док.ДокументОбъект+ОписаниеОшибки(),"");
			//			Возврат Ложь;
			//   		конецПопытки;
			//	КонецЕсли;
			
		
			//*********************************************			
			
			СсылкаНаДокумент = Док.ДокументОбъект.Ссылка;
			
			МассивЗагруженныхДокументов.Добавить(СсылкаНаДокумент);
			
			//Если ПроводитьДокументы 
			//	ИЛИ Док.ДокументОбъект.Проведен Тогда
			//	
			//	МассивДокументовДляПроведения.Добавить(Док.ДокументОбъект);	
			//	
			//КонецЕсли;
			
		Исключение
			
			СообщитьОбИсключительнойОшибке(Ложь, ОписаниеОшибки());
			Возврат Ложь;
			
		КонецПопытки;
		
	КонецЦикла;	
	
	Возврат Успешно;
	
КонецФункции



Функция ЗаписатьСвойстваДокументов(ДеревоДокументов, СтруктураСтатистики, МассивОтклоненныхДокументов)
	// тут пишутся только свойства - метод оплаты способ доставки и т.д.
	Успешно = Истина;
	//Сообщить("----------записать свойства");
	Для Каждого СтрокаДД Из ДеревоДокументов.Строки Цикл
		// регистр категории объектов
		
		
		// если не 3 статуса, тогда только обновляем статусы на сайте, номенклатуру, документы не перезаписываем!!!
		ТаблицаСтрок=СтрокаДД.строки;
		Обновлять=Ложь;                                                 // имя колонки
		НайденнаяСтрока = ТаблицаСтрок.Найти("Статус заказа", "СвойствоНаименование");
		Значение=Неопределено;
		Если НайденнаяСтрока=Неопределено Тогда
		Иначе
			Значение = НайденнаяСтрока.СвойствоЗначение;
		КонецЕсли;
		
		// обновляем и записываем для новых и А
		Если Значение<>Неопределено Тогда
			Если СтрЧислоВхождений(Значение, "[A]")>0 или СтрЧислоВхождений(Значение, "[N]")>0 или СтрЧислоВхождений(Значение, "[P]")>0 Тогда
				Обновлять=Истина;
			КонецЕСли;
		КонецЕсли;
		
		//	сообщить(""+СтрокаДД.ДокументОбъект.НомерВходящегоДокументаЭлектронногоОбмена+"  "+Значение+"   "+СтрокаДД.РанееЗагруженныйДокументСсылка+"  "+Обновлять);
		
		//-----------------------------------------------------------------------------
		Если Не Обновлять и СтрокаДД.РанееЗагруженныйДокументСсылка.Пустая() Тогда
			продолжить;
		КонецЕсли;	
		//-----------------------------------------------------------------------------
		
		Если НЕ СтрокаДД.РанееЗагруженныйДокументСсылка.пустая() Тогда
			// потом тут решить, что делать со статусами!!! 
			продолжить;
		КонецЕсли;	
		
		Успешно = УстановитьКатегориюДокумента(СтрокаДД.ДокументОбъект.Ссылка, Справочники.КатегорииОбъектов.ЗаказСWEBСайта, Истина);
		
		Если НЕ Успешно Тогда
			СообщитьПользователю("Не удалось установить категорию документа ""Заказ с WEB-сайта""", Ложь);
			Прервать;
		КонецЕсли;	
		// вот тут можно перезапись документа сделать.				
		Для Каждого ТоварУслугаСвойство Из СтрокаДД.Строки Цикл
			
			Если НЕ ЗначениеЗаполнено(ТоварУслугаСвойство.СвойствоНаименование) Тогда
				Продолжить;
			КонецЕсли;
			
			КатегорияСсылка = мСоответствиеНаименованийКатегорийДокумента[ТоварУслугаСвойство.СвойствоНаименование];
			
			Если КатегорияСсылка <> Неопределено Тогда
				
				ОбъектПринадлежитКатегории = (ТоварУслугаСвойство.СвойствоЗначение = БулевоЗначениеCML_Истина)
				ИЛИ (ТоварУслугаСвойство.СвойствоЗначение = БулевоЗначениеCML_Да);
				
				Успешно = УстановитьКатегориюДокумента(СтрокаДД.ДокументОбъект.Ссылка, КатегорияСсылка, ОбъектПринадлежитКатегории);
				
				Если НЕ Успешно Тогда
					
					СообщитьПользователю("Не удалось установить категорию документа - " + Строка(КатегорияСсылка), Ложь);
					Прервать;
					
				КонецЕсли;
				
				Если ОбъектПринадлежитКатегории Тогда
					
					Если КатегорияСсылка = Справочники.КатегорииОбъектов.СостояниеЗаказаНаWEBСайтеОплачен Тогда
						СтруктураСтатистики.ОплаченСписок.Добавить(СтрокаДД.ДокументОбъект.Ссылка);
					ИначеЕсли КатегорияСсылка = Справочники.КатегорииОбъектов.СостояниеЗаказаНаWEBСайтеДоставкаРазрешена Тогда
						СтруктураСтатистики.ДоставкаРазрешенаСписок.Добавить(СтрокаДД.ДокументОбъект.Ссылка);
					ИначеЕсли КатегорияСсылка = Справочники.КатегорииОбъектов.СостояниеЗаказаНаWEBСайтеЗавершен Тогда
						СтруктураСтатистики.ФинальныйСтатусСписок.Добавить(СтрокаДД.ДокументОбъект.Ссылка);
					ИначеЕсли КатегорияСсылка = Справочники.КатегорииОбъектов.СостояниеЗаказаНаWEBСайтеОтменен Тогда
						МассивОтклоненныхДокументов.Добавить(СтрокаДД.ДокументОбъект.Ссылка);
					КонецЕСли;	
					
				КонецЕсли;
				
			Иначе 
				
				ИмяСвойства      = ТоварУслугаСвойство.СвойствоНаименование;
				ЗначениеСвойства = ТоварУслугаСвойство.СвойствоЗначение;
				
				Если ЗначениеЗаполнено(ИмяСвойства)
					И ЗначениеЗаполнено(ЗначениеСвойства) Тогда
					
					Успешно = НайтиСоздатьУстановитьСвойствоДокумента(СтрокаДД.ДокументОбъект.Ссылка, ИмяСвойства, ЗначениеСвойства);
					
					Если НЕ Успешно Тогда
						СообщитьПользователю("Не удалось установить свойство документа - " + ИмяСвойства, Ложь);
						Прервать;
					КонецЕсли;	
					
				КонецЕсли;
				
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЦикла;	
	
	Возврат Успешно;
	
КонецФункции	


Функция УстановитьКатегориюДокумента(ОбъектСсылка, КатегорияСсылка, ОбъектПринадлежитКатегории);
	
	НаборЗаписей = РегистрыСведений.КатегорииОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(ОбъектСсылка);
	НаборЗаписей.Отбор.Категория.Установить(КатегорияСсылка);
	
	Если ОбъектПринадлежитКатегории Тогда
		
		Запись = НаборЗаписей.Добавить();
		Запись.Объект = ОбъектСсылка;
		Запись.Категория = КатегорияСсылка;
		
	КонецЕсли;	
	
	Попытка
		
		НаборЗаписей.Записать();
		
	Исключение
		СообщитьОбИсключительнойОшибке(Ложь, "Не удалось установить/снять категорию """ + КатегорияСсылка.Наименование + """ документу " + Строка(ОбъектСсылка));
		Возврат Ложь;
	КонецПопытки;
	
	
	Возврат Истина;
	
КонецФункции	

Функция НайтиСоздатьУстановитьСвойствоДокумента(ОбъектСсылка, ИмяСвойства, ЗначениеСвойства);
	
	//++-++
	Успешно = Истина;
	
	возврат успешно;
	// пока не записываем свойства, не понятно нужны ли они вообще.
	
	
	
	СвойствоСсылка 	 = ПланыВидовХарактеристик.СвойстваОбъектов.ПустаяСсылка();
	НазначениеСсылка = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.ПродажаИМ; // ???
	
	ТипНазначенияСвойств = Новый ОписаниеТипов("ДокументСсылка.Заказ"); //продажаим
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Назначение" , НазначениеСсылка);
	Запрос.УстановитьПараметр("ИмяСвойства", ИмяСвойства);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СвойстваОбъектов.Ссылка Как СвойствоСсылка
	|ИЗ
	|	ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектов
	|ГДЕ
	|	СвойстваОбъектов.НазначениеСвойства = &Назначение
	|	И СвойстваОбъектов.Наименование = &ИмяСвойства";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СвойствоСсылка = Выборка.СвойствоСсылка;	
	КонецЕсли;	
	
	Если СвойствоСсылка = ПланыВидовХарактеристик.СвойстваОбъектов.ПустаяСсылка() Тогда
		
		НовоеСвойство = ПланыВидовХарактеристик.СвойстваОбъектов.СоздатьЭлемент();
		НовоеСвойство.НазначениеСвойства = НазначениеСсылка;
		НовоеСвойство.Наименование 		 = ИмяСвойства;
		ОписаниеТипов 					 = Новый ОписаниеТипов(Строка(ТипЗнч(ЗначениеСвойства)));
		НовоеСвойство.ТипЗначения 		 = ОписаниеТипов;	
		
		Попытка 
			НовоеСвойство.Записать();
		Исключение
			СообщитьОбИсключительнойОшибке(Ложь, "Не удалось записать свойство документа " + ИмяСвойства);
			Возврат Ложь;
		КонецПопытки;	
		
		СвойствоСсылка = НовоеСвойство.Ссылка;
		
	КонецЕсли;	
	
	Запись = РегистрыСведений.ЗначенияСвойствОбъектовИнтернетМагазин.СоздатьМенеджерЗаписи();
	Запись.Значение = ЗначениеСвойства;
	Запись.Объект	= ОбъектСсылка;
	Запись.Свойство = СвойствоСсылка;
	
	Попытка
		Запись.Записать();
	Исключение
		Успешно = Ложь;
		СообщитьОбИсключительнойОшибке(Ложь, "Не удалось записать значение свойства " + ЗначениеСвойства);
	КонецПопытки;
	
	// после записи документа, устанавливаются статусы и признаки.
	//-------------------------------------------------------------------------------------------------------
	
	
	
	
	Если ОбъектСсылка.договор.пустая() Тогда
		// заполняем договор
		
		
		//Если СвойствоСсылка.Наименование="Метод оплаты" Тогда
		//	Договор=Неопределено;
		//	Если ЗначениеСвойства="Наличный расчет" ТОгда
		//		Договор=справочники.Договоры.НайтиПоКоду("SNL-005815"); // основной
		//	ИначеЕсли ЗначениеСвойства="Пластиковой картой курьеру" Тогда
		//		Договор=справочники.Договоры.НайтиПоКоду("SNL-006149"); // без нал пк
		//	ИначеЕсли ЗначениеСвойства="Банковским переводом" Тогда
		//		Договор=справочники.Договоры.НайтиПоКоду("SNL-006147"); // почтой
		//	ИначеЕсли ЗначениеСвойства="Пластиковой картой, электронными деньгами, через терминалы QIWI, Элекснет, Comepay и другие, SMS платеж (предоплата)" Тогда
		//		Договор=справочники.Договоры.НайтиПоКоду("SNL-006148"); // инет кошелек
		//	КонецЕсли;	
		//	
		//	
		//	Если Договор<>Неопределено Тогда
		//		ДокОбъект=ОбъектСсылка.получитьОбъект();
		//		ДокОбъект.Договор=Договор;
		//		ДокОбъект.Записать();
		//	КонецЕсли;
		//	
		//КонецЕсли;
		//
		
		
		
	КонецЕсли;
	
	
	//РежимЗаписи=РежимЗаписиДокумента.Запись;
	//Если ИмяСвойства="Статус заказа" Тогда
	//	// ищем значения перепроводим документ
	//	//к оплате, упаковывается, упаковано....
	//	
	//	Если Найти(ЗначениеСвойства,"[M]")>0 или (Найти(ЗначениеСвойства,"[P]")>0)или (Найти(ЗначениеСвойства,"[A]")>0) или (Найти(ЗначениеСвойства,"[R]")>0) Тогда
	//		ДокОбъект=ОбъектСсылка.получитьОбъект();
	//		ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВНаборе;
	//	ИначеЕсли Найти(ЗначениеСвойства,"[C]")>0 или (Найти(ЗначениеСвойства,"[T]")>0) или (Найти(ЗначениеСвойства,"[G]")>0) или
	//		(Найти(ЗначениеСвойства,"[S]")>0) или (Найти(ЗначениеСвойства,"[B]")>0)  или (Найти(ЗначениеСвойства,"[F]")>0) Тогда
	//		
	//		ДокОбъект=ОбъектСсылка.получитьОбъект();
	//		ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена;
	//		
	//	ИначеЕсли Найти(ЗначениеСвойства,"[Z]")>0 или (Найти(ЗначениеСвойства,"[Y]")>0) Тогда
	//		ДокОбъект=ОбъектСсылка.получитьОбъект();
	//		ДокОбъект.пометкаУдаления=Истина;
	//		ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
	//	Иначе
	//		ДокОбъект=ОбъектСсылка.получитьОбъект();
	//		ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
	//	КонецЕсли;
	//	
	//	
	//	Если ДокОбъект.Проведен Тогда 
	//		РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения;
	//		
	//	КонецЕсли;		
	//	
	//	Если ДокОбъект.Проведен и ДокОбъект.пометкаУдаления=ЛОжь Тогда 
	//		РежимЗаписи=РежимЗаписиДокумента.Проведение;
	//	КонецЕсли;		
	//		
	//	ДокОбъект.Записать(РежимЗаписи);
	//	
	//КонецЕсли; 
	
	
	Возврат Успешно;
	
КонецФункции	


Функция ПолучитьПоСтруктуреСтрокиСФИО(СтруктураДанныхКонтрагента)
	
	ТекущаяСтрока = "";
	Фамилия = "";
	Имя = "";
	Отчество = "";
	
	СтруктураДанныхКонтрагента.Свойство("Фамилия", Фамилия);
	СтруктураДанныхКонтрагента.Свойство("Имя", Имя);
	СтруктураДанныхКонтрагента.Свойство("Отчество", Отчество);
	
	Если ЗначениеЗаполнено(Фамилия) Тогда
		ТекущаяСтрока = Фамилия;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Имя) Тогда
		ТекущаяСтрока = СокрЛП(ТекущаяСтрока + " " + Имя);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отчество) Тогда
		ТекущаяСтрока = СокрЛП(ТекущаяСтрока + " " + Отчество);
	КонецЕсли;
	
	Возврат ТекущаяСтрока;
	
КонецФункции


Функция ОпределитьВидНоменклатурыПоТипу(ТипНоменклатуры)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|ВидыНоменклатуры.Ссылка КАК ВидНоменклатуры
	|ИЗ
	|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|ГДЕ
	|	ВидыНоменклатуры.ТипНоменклатуры = &ТипНоменклатуры
	|";
	Запрос.УстановитьПараметр("ТипНоменклатуры", ТипНоменклатуры);	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить()[0].ВидНоменклатуры;
	
КонецФункции

Функция ИнициализироватьВидыНоменкалтуры()
	
	Если ЗначениеЗаполнено(мВидНоменклатурыТовар)
		И ЗначениеЗаполнено(мВидНоменклатурыУслуга) Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	мВидНоменклатурыТовар = Перечисления.ВидыНоменклаутры.Товар;
	мВидНоменклатурыУслуга = Перечисления.ВидыНоменклаутры.Услуга;	
	
	Если ЗначениеЗаполнено(мВидНоменклатурыТовар)
		И ЗначениеЗаполнено(мВидНоменклатурыУслуга) Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(мВидНоменклатурыТовар) Тогда
		
		СообщитьПользователю("Не удалось найти вид номенклатуры: Товар", Ложь);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(мВидНоменклатурыУслуга) Тогда
		
		СообщитьПользователю("Не удалось найти вид номенклатуры: Услуга", Ложь);
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

//// Распределяет заданную сумму по выбранной колонке 
////
//// Параметры: 
////  ИмяКолонки         - cтрока, имя колонки, по которой распределяется сумма ("Количество" или "Сумма");
////  СуммаРаспределения - число, распределяемая сумма
////
////
Процедура РаспределитьСуммуПоКолонке(ДокументОбъект, Товары, ИмяТабЧасти, СуммаРаспределения)	
	
	МассивДанныхКолонки = Товары.ВыгрузитьКолонку("Сумма");
	
	МассивРаспределения = ПроцедурыОбменаССайтом.РаспределитьПропорционально(СуммаРаспределения, МассивДанныхКолонки);
	
	Если МассивРаспределения = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	мТекущийПользователь = ПараметрыСеанса.Пользователь; //глЗначениеПеременной("глТекущийПользователь");
	
	Индекс = 0;
	Для каждого СтрокаТабличнойЧасти Из Товары Цикл
		
		СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Сумма + МассивРаспределения[Индекс];
		//ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект, мТекущийПользователь ,,истина, ,истина, ИмяТабЧасти);
		
		Индекс = Индекс + 1;
	КонецЦикла;
	
КонецПроцедуры


//// тут заполняются по строкам товары и меняются значения в загруженных документах.

Функция ИдентифицироватьНоменклатуру(ДеревоДокументов)
	//возврат ложь;
	
	//++++++++++++++++++++++++++++++++++++++++
	//	сообщить("------------ идентифицировать номенклатуры");
	Успешно = Истина;
	ЕстьИзмененияДок = ложь;
	Успешно = ИнициализироватьВидыНоменкалтуры();
	
	Если НЕ Успешно Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	
	ТЗТОваровССайта = Новый ТаблицаЗначений;
	ТЗТОваровССайта.колонки.Добавить("Номенклатура");
	
	
	Для Каждого СтрокаДД Из ДеревоДокументов.Строки Цикл
		
		//Если СтрокаДД.ЕстьСсылкиНаРанееЗагруженныйДокумент Тогда
		//	Продолжить;
		//КонецЕсли;	
		
		
		//*************************************************************************************
		// не грузим определененные параметры, не обновляем номенклатуру в этом случае.
		ТаблицаСтрок=СтрокаДД.строки;
		Обновлять=Ложь;                                                 // имя колонки
		НайденнаяСтрока = ТаблицаСтрок.Найти("Статус заказа", "СвойствоНаименование");
		Значение=Неопределено;
		Если НайденнаяСтрока = Неопределено Тогда
		Иначе
			Значение = НайденнаяСтрока.СвойствоЗначение;
		КонецЕсли;
		
		НеПерезаписывать= ложь;  //СтрокаДД.РанееЗагруженныйДокументСсылка.БольшеНеПерезаписыватьДокумент;
		
		Если Значение<>Неопределено Тогда
			Если СтрЧислоВхождений(Значение, "[A]")>0 или СтрЧислоВхождений(Значение, "[N]")>0 или СтрЧислоВхождений(Значение, "[P]")>0 Тогда
				Обновлять=Истина;
			КонецЕСли;
		КонецЕсли;
		//сообщить(""+СтрокаДД.ДокументОбъект.НомерВходящегоДокументаЭлектронногоОбмена+"  "+Значение+"   "+СтрокаДД.РанееЗагруженныйДокументСсылка+" --"+Обновлять);
		//-------------------------------------------------------------------------------------
		Если Не Обновлять или НеПерезаписывать Тогда
			продолжить;
		КонецЕсли;	
		//-------------------------------------------------------------------------------------
		//*************************************************************************************
		
		ОтобразитьСостояние("Идентификация товаров в документе: " + СтрокаДД.ДокументОбъект);
		СущДок = неопределено;
		колСтрокТоваровСущДок =0;
		Если не СтрокаДД.РанееЗагруженныйДокументСсылка.пустая() ТОгда
			СущДок = СтрокаДД.РанееЗагруженныйДокументСсылка.получитьОбъект();
			СтрокаИзСущДок=СущДок.Товары;
			КолСтрокТоваровСущДок = СущДок.товары.количество();
		КонецЕсли;
		
		
		Для Каждого ТоварУслугаСвойство Из СтрокаДД.Строки Цикл
			Номенклатура=Неопределено;
			Если ЗначениеЗаполнено(ТоварУслугаСвойство.СвойствоНаименование) Тогда
				Продолжить;
			КонецЕсли;
			
			ТипНоменклатурыCML = "";
			
			Для Каждого ПодчиненнаяСтрокаТовараУслуги Из ТоварУслугаСвойство.Строки Цикл
				
				Если ЗначениеЗаполнено(ПодчиненнаяСтрокаТовараУслуги.ЗначениеРеквизитаНаименование)
					И ПодчиненнаяСтрокаТовараУслуги.ЗначениеРеквизитаНаименование = ЗначениеCML_ТипНоменклатуры Тогда
					
					ТипНоменклатурыCML = ПодчиненнаяСтрокаТовараУслуги.ЗначениеРеквизитаЗначение;
					Прервать;
					
				КонецЕсли;	
				
			КонецЦикла;			
			
			ХарактеристикаНоменклатуры =Неопределено;  //Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
			СтавкаНДСНоменклатуры = ?(ЗначениеЗаполнено(ТоварУслугаСвойство.СтавкаНДС), ТоварУслугаСвойство.СтавкаНДС, СтрокаДД.СтавкаНДС);
			
			Если ТипНоменклатурыCML = ТипНоменклатурыCML_Услуга Тогда	
				Номенклатура = НайтиСоздатьНоменклатуру(ТоварУслугаСвойство, мВидНоменклатурыУслуга, СтавкаНДСНоменклатуры);
			Иначе
				Номенклатура = НайтиСоздатьНоменклатуру(ТоварУслугаСвойство, мВидНоменклатурыТовар, СтавкаНДСНоменклатуры, ХарактеристикаНоменклатуры);
				//++-++
			КонецЕсли;
			//*******************
			НовстрССайта = ТЗТОваровССайта.Добавить();
			НовстрССайта.Номенклатура = Номенклатура;
			//******************/
			//!!!! добавляем документ первый раз
			Если СтрокаДД.РанееЗагруженныйДокументСсылка.пустая() Тогда
				
				
				Если Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Услуга Тогда
					
					// добавляем в новый документ (обновляем старый)
					НовСтрока = СтрокаДД.ДокументОбъект.Услуги.Добавить();
					НовСтрока.Номенклатура = Номенклатура;
					НовСтрока.Единица 		     = Номенклатура.основнаяЕдиница; //.ЕдиницаХраненияОстатков;
					НовСтрока.Содержание   = Номенклатура.Наименование;
					НовСтрока.Количество   = ТоварУслугаСвойство.ТоварУслугаКоличество;
					НовСтрока.Заявка   = ТоварУслугаСвойство.ТоварУслугаКоличество;
					НовСтрока.ПодтвержденнаяЗаявка   = ТоварУслугаСвойство.ТоварУслугаКоличество;
					НовСтрока.Коэффициент      			 = Номенклатура.ОсновнаяЕдиница.Коэффициент;
					НовСтрока.СтавкаНДС    = ПолучитьСтавкуНДС(Номенклатура);
					НовСтрока.Сумма	= РассчитатьСуммуСУчетомСкидок(ТоварУслугаСвойство);
					НовСтрока.Скидка= ТоварУслугаСвойство.СуммаСкидки;
					
					
					СтавкаНДС=ПроцентНДСпоСтавке(НовСтрока.СтавкаНДС);
					НовСтрока.НДС	=НовСтрока.Сумма*СтавкаНДС/(1+СтавкаНДС);			
					НовСтрока.Всего	=НовСтрока.Сумма;
					НовСтрока.Сумма  =НовСтрока.Всего-НовСтрока.НДС;
					
					
				Иначе	
					// вид товар новый документ
					
					НовСтрока = СтрокаДД.ДокументОбъект.Товары.Добавить();
					НовСтрока.Номенклатура     			 = Номенклатура;
					НовСтрока.Единица 		     = Номенклатура.основнаяЕдиница; //.ЕдиницаХраненияОстатков;
					НовСтрока.Количество   	   	 = ТоварУслугаСвойство.ТоварУслугаКоличество;
					НовСтрока.Заявка   = ТоварУслугаСвойство.ТоварУслугаКоличество;
					НовСтрока.ПодтвержденнаяЗаявка   = ТоварУслугаСвойство.ТоварУслугаКоличество;
					НовСтрока.Коэффициент      			 = Номенклатура.ОсновнаяЕдиница.Коэффициент;
					НовСтрока.СтавкаНДС    = ПолучитьСтавкуНДС(Номенклатура);
					НовСтрока.Сумма	= РассчитатьСуммуСУчетомСкидок(ТоварУслугаСвойство);
					НовСтрока.Скидка= ТоварУслугаСвойство.СуммаСкидки;
					НовСтрока.ЦенаИсточник = ТоварУслугаСвойство.ТоварУслугаЦенаЗаЕдиницу;
					
					//РассчитатьСуммуТабЧасти(НовСтрока, СтрокаДД.ДокументОбъект);
					//ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(НовСтрока, СтрокаДД.ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"),,истина, ,истина, "Товары");
					//ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НовСтрока, СтрокаДД.ДокументОбъект);
					//
				КонецЕсли;
				
			Иначе
				//!!!!! уже есть документ, нужно проверить откорректировать данные по документу
				// если на сайте обнулили, то строки этой в заказе нет.
				
				
				Если Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Услуга Тогда
					
					// услуги просто обновляем		
					
					НовСтрока = СтрокаДД.ДокументОбъект.Услуги.Добавить();
					НовСтрока.Номенклатура = Номенклатура;
					НовСтрока.Единица 		     = Номенклатура.основнаяЕдиница; //.ЕдиницаХраненияОстатков;
					НовСтрока.Содержание   = Номенклатура.Наименование;
					НовСтрока.Заявка   = ТоварУслугаСвойство.ТоварУслугаКоличество;
					НовСтрока.ПодтвержденнаяЗаявка   = ТоварУслугаСвойство.ТоварУслугаКоличество;
					НовСтрока.Коэффициент      			 = Номенклатура.ОсновнаяЕдиница.Коэффициент;
					НовСтрока.СтавкаНДС    = ПолучитьСтавкуНДС(Номенклатура);
					НовСтрока.Сумма	= РассчитатьСуммуСУчетомСкидок(ТоварУслугаСвойство);
					НовСтрока.Скидка= ТоварУслугаСвойство.СуммаСкидки;
					
					
					СтавкаНДС=ПроцентНДСпоСтавке(НовСтрока.СтавкаНДС);
					НовСтрока.НДС	=НовСтрока.Сумма*СтавкаНДС/(1+СтавкаНДС);			
					НовСтрока.Всего	=НовСтрока.Сумма;
					НовСтрока.Сумма  =НовСтрока.Всего-НовСтрока.НДС;
					
					
				Иначе
					
					// если вид товары и документ уже был загружен
					
					НайденнаяСтрока = СтрокаИзСущДок.Найти(Номенклатура, "Номенклатура");
					Если НайденнаяСтрока = Неопределено Тогда
						//тогда добавляем просто
						попытка
							НовСтрока = СтрокаДД.РанееЗагруженныйДокументСсылка.Товары.Добавить();
							НовСтрока.Номенклатура     	 = Номенклатура;
							НовСтрока.Единица 		     = Номенклатура.основнаяЕдиница; //.ЕдиницаХраненияОстатков;
							НовСтрока.ПодтвержденнаяЗаявка   = ТоварУслугаСвойство.ТоварУслугаКоличество;
							НовСтрока.Коэффициент      		 = Номенклатура.ОсновнаяЕдиница.Коэффициент;
							НовСтрока.СтавкаНДС    = ПолучитьСтавкуНДС(Номенклатура);
							НовСтрока.Сумма	= РассчитатьСуммуСУчетомСкидок(ТоварУслугаСвойство);
							НовСтрока.Скидка= ТоварУслугаСвойство.СуммаСкидки;
						исключение
						//	сообщить(ОписаниеОшибки());
						конецПопытки;
						
					Иначе
						//изменяем подтв. количество, общее количество -  не меняем
						Если  НайденнаяСтрока.ПодтвержденнаяЗаявка<> ТоварУслугаСвойство.ТоварУслугаКоличество ТОгда
							
							НайденнаяСтрока.ПодтвержденнаяЗаявка   = ТоварУслугаСвойство.ТоварУслугаКоличество;
							РассчитатьСуммуТабЧасти(НайденнаяСтрока, СущДок);
							
							ЕстьИзмененияДок = истина;
							
						КонецЕсли;						
						
						
					КонецЕсли;
					
					
				КонецЕсли;
				
				
				
			КонецЕсли;
			
			
			
		КонецЦикла;
		
		
		// смотрим не пропустили ли удаленные строки из заказа, их добавляем и обнуляем подтв. заявку и количество.???
		// Сравним общее количество строк.
		Если СущДок<>Неопределено Тогда
			Если  ТЗТОваровССайта.Количество()<> колСтрокТоваровСущДок  Тогда
				
				Таблица1= сущдок.товары.выгрузить();
				ТЗУдаленныеСтроки = РазницаТаблицЗначений(ТЗТОваровССайта, Таблица1, "Номенклатура");
				// обнулим строки
				Для каждого Текстрока из ТЗУдаленныеСтроки цикл
					
					НоменУд = Текстрока.Номенклатура;
					
					НайденнаяСтрока = СтрокаИзСущДок.Найти(НоменУд, "Номенклатура");
					Если НЕ НайденнаяСтрока = Неопределено   Тогда
						//изменяем подтв. количество, общее количество -  не меняем
						Если  НайденнаяСтрока.ПодтвержденнаяЗаявка<>0  Тогда						
							НайденнаяСтрока.ПодтвержденнаяЗаявка   = 0;
							РассчитатьСуммуТабЧасти(НайденнаяСтрока, СущДок);
							
							ЕстьИзмененияДок = истина;
							
						КонецЕсли;		
						
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;	
		
		Если  не СущДок = Неопределено  Тогда
			
			Если СтрЧислоВхождений(Значение, "[A]")>0 или СтрЧислоВхождений(Значение, "[N]")>0    Тогда
				СущДок.состояниеСогласования = перечисления.СостоянияСогласования.НаСогласованииЦО;
			КонецЕсли;	
			
			Если  СтрЧислоВхождений(Значение, "[P]")>0   Тогда
				СущДок.состояниеСогласования = перечисления.СостоянияСогласования.Согласован;
			КонецЕсли;	
		КонецЕсли;
		
		Если ЕстьИзмененияДок и не СущДок = Неопределено Тогда
			
			//СущДок.состояниеСогласования = перечисления.СостоянияСогласования.НаСогласованииЦО;
			попытка
				ПересчетТЧ(СущДок,"Товары",Рубли,Рубли,1,1,Истина); 
				СущДок.записать();
			исключение
				#если клиент тогда
					сообщить(""+ОписаниеОшибки());
				# конецЕсли
			конецПопытки;
			
		КонецЕсли;	

		
	КонецЦикла;	
	
	//Если ЕстьИзмененияДок и не СущДок = Неопределено Тогда
	//	
	//	//СущДок.состояниеСогласования = перечисления.СостоянияСогласования.НаСогласованииЦО;
	//	попытка
	//		ПересчетТЧ(СущДок,"Товары",Рубли,Рубли,1,1,Истина); 
	//		СущДок.записать(РежимЗаписиДокумента.Проведение);
	//	исключение
	//		#если клиент тогда
	//			сообщить(""+ОписаниеОшибки());
	//		# конецЕсли
	//	конецПопытки;
	//	
	//КонецЕсли;	
	//
	
	
	Возврат Успешно;
	
	
КонецФункции	

Функция РазницаТаблицЗначений(Таблица0, Таблица1, Измерения) 
	// возвращает удаленные товары в заказе на стороне сайта. (разница между двумя таблицами значений)
	
	ВсеКолонки = "";
	Для Каждого Колонка Из Таблица0.Колонки Цикл 
		ВсеКолонки = ВсеКолонки + ", " + Колонка.Имя
	КонецЦикла;
	ВсеКолонки = Сред(ВсеКолонки, 2);
	
	Таблица = Таблица1.Скопировать();    
	
	Таблица.Колонки.Добавить("Знак", Новый ОписаниеТипов("Число"));
	
	Таблица.ЗаполнитьЗначения(1, "Знак");
	
	Для Каждого Строка Из Таблица0 Цикл ЗаполнитьЗначенияСвойств(Таблица.Добавить(), Строка) КонецЦикла;
	
	Таблица.Колонки.Добавить("Счёт");
	Таблица.ЗаполнитьЗначения(1, "Счёт");
	
	Таблица.Свернуть(ВсеКолонки, "Знак, Счёт");
	
	Ответ = Таблица.Скопировать(Новый Структура("Счёт", 1), ВсеКолонки + ", Знак");
	
	Ответ.Сортировать(Измерения);
	
	Возврат Ответ
	
КонецФункции



Функция РассчитатьСуммуСУчетомСкидок(СтрокаТовара);
	
	Сумма 		= СтрокаТовара.ТоварУслугаСумма;
	ЦенаЗаЕдиницу 	= СтрокаТовара.ТоварУслугаЦенаЗаЕдиницу;
	СуммаСкидки = 0;
	
	Для Каждого СтрокаСкидки Из СтрокаТовара.Строки Цикл
		
		Если ЗначениеЗаполнено(СтрокаСкидки.СуммаСкидки)Тогда
			//И НЕ СтрокаСкидки.СкидкаВСумме Тогда
			
			СуммаСкидки = СуммаСкидки + СтрокаСкидки.СуммаСкидки;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Если СуммаСкидки>0 Тогда
		СтрокаТовара.СуммаСкидки=Окр((СуммаСкидки*100/(ЦенаЗаЕдиницу+СуммаСкидки)),0);
	Иначе
		СтрокаТовара.СуммаСкидки=0;
	КонецЕсли;	
	
	// Сумма = Сумма - СуммаСкидки;		
	Возврат Сумма;
	
КонецФункции

Функция ПолучитьИдНоменклатуры(Знач Ид)
	
	ПозицияРазделителя = Найти(Ид, "#");
	Если ПозицияРазделителя > 0 Тогда
		ИдНоменклатуры = Лев(Ид, ПозицияРазделителя - 1);
	Иначе
		ИдНоменклатуры = Ид;
	КонецЕсли;
	
	Если Ид="ORDER_DELIVERY" Тогда 
		Ид="SNL-228028";
	КонецЕсли;	
	
	Если Ид="ORDER_DELIVERY" Тогда 
		Ид="SNL-228028";
	КонецЕсли;	
	
	
	
	Возврат ИдНоменклатуры;
	
КонецФункции

Функция ПолучитьИдХарактеристики(Знач Ид)
	
	ПозицияРазделителя = Найти(Ид, "#");
	Если ПозицияРазделителя > 0 Тогда
		ИдХарактеристики = Прав(Ид, СтрДлина(Ид) - ПозицияРазделителя);
	Иначе
		ИдХарактеристики = "";
	КонецЕсли;	
	
	Возврат ИдХарактеристики;
	
КонецФункции

Функция ВыполнитьПоискНоменклатурыХарактеристикиПоСсылкам(СтрокаТовара, Номенклатура, ХарактеристикаНоменклатуры)
	
	Если НЕ ЗначениеЗаполнено(СтрокаТовара.ТоварУслугаИд) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИдНоменклатуры1 = СтрокаТовара.ТоварУслугаИд;
	ИдНоменклатурыП = стрНайти(СтрокаТовара.ТоварУслугаИд,"#");
	ИдНоменклатуры = Сред(СтрокаТовара.ТоварУслугаИд,ИдНоменклатурыП+1,СтрДлина(СтрокаТовара.ТоварУслугаИд)-ИдНоменклатурыП);
	
	
	
	Попытка
		
		//ИдНоменклатуры = СтрокаТовара.ТоварУслугаИд; //ПолучитьИдНоменклатуры(СтрокаТовара.ТоварУслугаИд);
		
		Если ИдНоменклатуры="ORDER_DELIVERY" Тогда
			ИдНоменклатуры="SNL-228028";
		КонецЕсли;
		
		Если ИдНоменклатуры="91206" Тогда  // 500 сертификат
			ИдНоменклатуры="SNL-096562";
		КонецЕсли;
		
		Если ИдНоменклатуры="91205" Тогда // 1000 
			ИдНоменклатуры="SNL-095774";
		КонецЕсли;
		
		Если ИдНоменклатуры="91204" Тогда // 2000 
			ИдНоменклатуры="SNL-096577";
		КонецЕсли;
		
		Если ИдНоменклатуры="91203" Тогда // 3000 
			ИдНоменклатуры="SNL-096561";
		КонецЕсли;
		//крохин начало 22.09.2011
		//завели заново на сайте
		//Если ИдНоменклатуры="91198" Тогда // 5000 
		Если ИдНоменклатуры="124354" Тогда // 5000 
			//крохин конец 22.09.2011
			ИдНоменклатуры="SNL-231090";
		КонецЕсли;
		
		//крохин начало 22.09.2011
		//новые номиналы
		Если ИдНоменклатуры="124352" Тогда // 7000
			ИдНоменклатуры="SNL-279212";
		КонецЕсли;
		Если ИдНоменклатуры="124353" Тогда // 10000
			ИдНоменклатуры="SNL-279214";
		КонецЕсли;		
		//крохин конец 22.09.2011
		
		
		Если ИдНоменклатуры="90429" Тогда
			ИдНоменклатуры="SNL-232812"; // скидка на первичный заказ
			ПризПервичнойСкидки10=Истина;
		КонецЕсли;
		
		//крохин начало 06.03.2012
		//электронные сертификаты
		Если ИдНоменклатуры="133691" Тогда // эл. сертификат
			ИдНоменклатуры="SNL-288462";
		КонецЕсли;
		//крохин конец 06.03.2012
		
		
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду(ИдНоменклатуры);   //.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдНоменклатуры));
		Если Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда			
			Возврат Ложь;
		КонецЕсли;
		
		Если Номенклатура.ПолучитьОбъект() = Неопределено Тогда
			// Объект не найден
			СообщитьПользователю("Номенклатура не найдена по уникальному идентификатору: " + ИдНоменклатуры, Ложь);
			Возврат Ложь;
		КонецЕсли;	
		
		//Если НЕ Номенклатура.ВестиУчетПоХарактеристикам Тогда
		//	Возврат Истина;
		//КонецЕсли;
		//
		//ИдХарактеристики = ПолучитьИдХарактеристики(СтрокаТовара.ТоварУслугаИд);
		//Если ПустаяСтрока(ИдХарактеристики) Тогда
		//	Возврат Истина;
		//КонецЕсли;
		
		ХарактеристикаНоменклатуры =Неопределено; //= Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдХарактеристики));
		
		//Если ХарактеристикаНоменклатуры = ПустаяХарактеристикаСсылка Тогда
		//	Возврат Истина;
		//КонецЕсли;
		//	
		//Если ХарактеристикаНоменклатуры.ПолучитьОбъект() = Неопределено Тогда
		//	СообщитьПользователю("Объект <ХарактеристикаНоменклатуры> не найден: " + Строка(ИдХарактеристики)
		//		+ ". Будет создан новый объект.", Ложь);
		//		
		//	Возврат Ложь;
		//	
		//КонецЕсли;			
		
		
		Возврат Истина;
		
	Исключение
		
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Функция НайтиНоменклатуруПоНаименованиюИВиду(НаименованиеНоменклатуры, ВидНоменклатуры)
	
	// поиск номенклатуры по наименованию и виду
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
	Запрос.УстановитьПараметр("Наименование", НаименованиеНоменклатуры);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Номенклатура.Ссылка Как Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
	|	И Номенклатура.Наименование = &Наименование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Номенклатура;
		
	КонецЕсли;	
	
	Возврат Неопределено;
	
КонецФункции


Функция НайтиСоздатьНоменклатуру(СтрокаТовара, Знач ВидНоменклатуры, СтавкаНДС, ХарактеристикаНоменклатуры = Неопределено)
	
	Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	ХарактеристикаНоменклатуры = Неопределено;
	
	УспешноНайдено = ВыполнитьПоискНоменклатурыХарактеристикиПоСсылкам(СтрокаТовара, Номенклатура, ХарактеристикаНоменклатуры);
	Если УспешноНайдено Тогда
		Возврат Номенклатура;
	КонецЕсли;	
	
	ХарактеристикаНоменклатуры = Неопределено;
	
	ВидНоменклатуры=Перечисления.ВидыНоменклаутры.Услуга; 	
	Номенклатура = НайтиНоменклатуруПоНаименованиюИВиду(СтрокаТовара.ТоварУслугаНаименование, ВидНоменклатуры);
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Номенклатура;
	КонецЕсли;
	
	ЕдиницаПоКлассификатору =неопределено;  //Справочники.Единицы.НайтиПоКоду("");   //кеди.КлассификаторЕдиницИзмерения.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(СтрокаТовара.ТоварУслугаБазоваяЕдиницаКод) Тогда
		ЕдиницаПоКлассификатору = Справочники.ОКЕИ.НайтиПоКоду(СтрокаТовара.ТоварУслугаБазоваяЕдиницаКод);
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ЕдиницаПоКлассификатору)
		И ЗначениеЗаполнено(СтрокаТовара.ТоварУслугаБазоваяЕдиница) Тогда
		
		ЕдиницаПоКлассификатору = Справочники.ОКЕИ.НайтиПоНаименованию(СтрокаТовара.ТоварУслугаБазоваяЕдиница, Истина);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЕдиницаПоКлассификатору) Тогда
		
		ЕдиницаПоКлассификатору = ЕдиницаИзмеренияНовойНоменклатуры;
		
	КонецЕсли;
	#если клиент  тогда
	Сообщить("Не найдена номенклатура "+СтрокаТовара.ТоварУслугаИд+" - "+СтрокаТовара.ТоварУслугаНаименование+ " создана новая ");
	# конецЕсли
	Номенклатура = Справочники.Номенклатура.СоздатьЭлемент();
	
	Номенклатура.БазоваяЕдиница = ЕдиницаПоКлассификатору;
	Номенклатура.Код = СтрокаТовара.ТоварУслугаИд;
	Номенклатура.Родитель				 = ГруппаДляНовойНоменклатуры;
	Номенклатура.ВидНоменклатуры 		 = ВидНоменклатуры;
	Номенклатура.Комментарий 			 = СтрокаТовара.ТоварУслугаКомментарий;
	Номенклатура.Наименование 			 = СтрокаТовара.ТоварУслугаНаименование;
	//	Номенклатура.НаименованиеПолное		 = СтрокаТовара.ТоварУслугаНаименование;
	//Номенклатура.СтавкаНДС 				 = СтавкаНДС;
	
	
	Номенклатура.Услуга 				 = ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Услуга;	
	
	Попытка
		
		Номенклатура.Записать();
		Если ОбменТоварами
			И ВыгружатьТолькоИзменения Тогда
			//9999	
			ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбменаТоварами, Номенклатура.Ссылка);
		КонецЕсли;
		
	Исключение
		
		СообщитьОбИсключительнойОшибке(Ложь, ОписаниеОшибки());
		Возврат Справочники.Номенклатура.ПустаяСсылка();
		
	КонецПопытки;	
	
	//ЕдиницаХраненияОстатков = Справочники.Единицы.СоздатьЭлемент();
	//
	//ЕдиницаХраненияОстатков.Наименование            = Номенклатура.БазоваяЕдиница.Наименование;
	//ЕдиницаХраненияОстатков.ОКЕИ  = Номенклатура.БазоваяЕдиница;
	//ЕдиницаХраненияОстатков.Коэффициент             = 1;
	//ЕдиницаХраненияОстатков.Владелец                = Номенклатура.Ссылка;
	//
	//Попытка
	//	ЕдиницаХраненияОстатков.Записать();
	//Исключение
	//	СообщитьОбИсключительнойОшибке(Ложь, ОписаниеОшибки());
	//	Возврат Справочники.Номенклатура.ПустаяСсылка();
	//КонецПопытки;	
	//
	//Номенклатура.ЕдиницаХраненияОстатков = ЕдиницаХраненияОстатков.Ссылка;
	//Номенклатура.ЕдиницаДляОтчетов 		 = ЕдиницаХраненияОстатков.Ссылка;
	
	Попытка
		Номенклатура.Записать();
	Исключение
		СообщитьОбИсключительнойОшибке(Ложь, ОписаниеОшибки());
		Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	КонецПопытки;	
	
	Возврат Номенклатура.Ссылка;	
	
КонецФункции				

Функция ОпределитьПоТтипуИмяПоляКонтактнойИнформации(ИмяТипа)
	
	ИмяПоля = "Поле10";
	
	Если ИмяТипа = "Почтовый индекс"
		ИЛИ ИмяТипа = "Страна" Тогда
		ИмяПоля = "Поле1";
	ИначеЕсли ИмяТипа = "Регион" Тогда
		ИмяПоля = "Поле2";
	ИначеЕсли ИмяТипа = "Район" Тогда
		ИмяПоля = "Поле3";
	ИначеЕсли ИмяТипа = "Город" Тогда
		ИмяПоля = "Поле4";
	ИначеЕсли ИмяТипа = "Населенный пункт" Тогда
		ИмяПоля = "Поле5";
	ИначеЕсли ИмяТипа = "Улица" Тогда
		ИмяПоля = "Поле6";
	ИначеЕсли ИмяТипа = "Дом" Тогда
		ИмяПоля = "Поле7";
	ИначеЕсли ИмяТипа = "Корпус" Тогда
		ИмяПоля = "Поле8";
	ИначеЕсли ИмяТипа = "Квартира" Тогда
		ИмяПоля = "Поле9";
	Конецесли;		
	
	Возврат ИмяПоля;
	
КонецФункции

Процедура ОпределитьПоданнымТипВидКонтактнойИнформации(КонтактТип, ТипКИ, ВидКИ)
	
	Если КонтактТип = "ТелефонРабочий" Тогда
		
		ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон;
		ВидКИ = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
		
	ИначеЕсли КонтактТип = "Почта" Тогда
		
		ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		ВидКИ = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами;
		
	КонецЕсли;
	
КонецПроцедуры


Функция СтранаРФ(СтруктураДанных)
	Если НЕ СтруктураДанных.ПолеТип = "Страна" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Страна = СокрЛП(ВРег(СтруктураДанных.ПолеЗначение));
	Если Страна = "РОССИЯ"
		ИЛИ Страна = "РФ"	
		ИЛИ Страна = "РОССИЙСКАЯ ФЕДЕРАЦИЯ" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции			


Функция ПолучитьГородБанка(ТаблицаАдресныхПолей)
	Город = "";
	Найдено = ТаблицаАдресныхПолей.Найти("Город", "ПолеТип");
	Если НЕ Найдено = НеОпределено Тогда
		Город = СокрЛП(Найдено.ПолеЗначение);
	КонецЕсли;	
	Возврат Город;
КонецФункции	

Функция ПолучитьПоЗначениюДляВыгрузкиСтавкуНДС(ЗначениеНалога)
	
	Если ЗначениеНалога = "0" Тогда		
		СтавкаНДС = Перечисления.СтавкиНДС.НДС0;
	ИначеЕсли ЗначениеНалога = "10" Тогда		
		СтавкаНДС = Перечисления.СтавкиНДС.НДС10;
	ИначеЕсли ЗначениеНалога = "18" Тогда		
		СтавкаНДС = Перечисления.СтавкиНДС.НДС18;
	ИначеЕсли ЗначениеНалога = "20" Тогда				
		СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
	Иначе
		СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
	КонецЕсли;
	
	Возврат СтавкаНДС;
	
КонецФункции


Функция  ПолучитьСтатусЗаказа_ст(ТекЗаказ)
	
	ТекСтатус = "F";	
	
	Запрос = Новый Запрос;
	попытка
		запрос.Текст = "ВЫБРАТЬ
		|	РасходнаяНакладнаяЗаказы.Ссылка КАК РНК,
		|	РасходнаяНакладнаяЗаказы.Ссылка.СостояниеНакладной КАК СостояниеНакладной
		|ИЗ
		|	Документ.РасходнаяНакладная.Заказы КАК РасходнаяНакладнаяЗаказы
		|ГДЕ
		|	РасходнаяНакладнаяЗаказы.Заказ = &Текзаказ
		|	И РасходнаяНакладнаяЗаказы.Ссылка.ДатаОтгрузки >= &датаотгрузки
		|	И РасходнаяНакладнаяЗаказы.Ссылка.Проведен = истина
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка,
		|	РасходнаяНакладная.СостояниеНакладной
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.ДокОснование = &Текзаказ
		|	И РасходнаяНакладная.ДатаОтгрузки >= &ДатаОтгрузки
		|	И РасходнаяНакладная.Проведен = истина";
		Запрос.УстановитьПараметр("Текзаказ",ТекЗаказ); 
		Запрос.УстановитьПараметр("ДатаОтгрузки",ТекущаяДата()-3*30*24*60*60);  // за 3 месяца назад
				
		ТЗ = Запрос.Выполнить().Выгрузить();

	исключение
		
		запрос.Текст = "ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка как РНК,
		|	РасходнаяНакладная.СостояниеНакладной КАК СостояниеНакладной
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.ДокОснование = &Текзаказ
		|	И РасходнаяНакладная.ДатаОтгрузки >= &ДатаОтгрузки
		|	И РасходнаяНакладная.Проведен = истина";
		
		Запрос.УстановитьПараметр("Текзаказ",ТекЗаказ); 
		Запрос.УстановитьПараметр("ДатаОтгрузки",ТекущаяДата()-3*30*24*60*60);  // за 3 месяца назад
	
		ТЗ = Запрос.Выполнить().Выгрузить();

	конецПопытки;
	
		 
				 
		 
	Для каждого текстр из ТЗ цикл
		
		Если ТекСтр.состояниеНакладной<> перечисления.СостоянияНакладной.Отгружена Тогда
			
			 возврат "CO";
			 прервать;
			 
		конецЕсли;	
		
	конецЦикла;
	
	возврат "F";	
	
КонецФункции	

// нечаева 25,09,23+++
Функция  ПолучитьСтатусЗаказа(ТекЗаказ)
	
	ТекСтатус = "F";	
	
	Запрос = Новый Запрос;
	//++Данилова Е.В. 06.12.2024
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказРасходныеНакладные.Документ КАК Документ
	|ПОМЕСТИТЬ ВТРНК
	|ИЗ
	|	Документ.Заказ.РасходныеНакладные КАК ЗаказРасходныеНакладные
	|ГДЕ
	|	ЗаказРасходныеНакладные.Ссылка = &Текзаказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасходнаяНакладная.Ссылка КАК Док,
	|	РасходнаяНакладная.СостояниеНакладной КАК СостояниеНакладной
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРНК КАК ВТРНК
	|		ПО (ВТРНК.Документ = РасходнаяНакладная.Ссылка)
	|ГДЕ
	|	(РасходнаяНакладная.ДокОснование = &Текзаказ
	|			ИЛИ НЕ ВТРНК.Документ ЕСТЬ NULL)
	|	И РасходнаяНакладная.ДатаОтгрузки >= &ДатаОтгрузки
	|	И РасходнаяНакладная.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Перемещение.Ссылка,
	|	Перемещение.СостояниеНакладной
	|ИЗ
	|	Документ.Перемещение КАК Перемещение
	|ГДЕ
	|	Перемещение.ДокОснование = &Текзаказ
	|	И Перемещение.ДатаОтгрузки >= &ДатаОтгрузки
	|	И Перемещение.Склад = &ТекСклад
	|	И Перемещение.Проведен"; 
	//
	//запрос.Текст = "ВЫБРАТЬ
	//               |	РасходнаяНакладная.Ссылка КАК Док,
	//               |	РасходнаяНакладная.СостояниеНакладной КАК СостояниеНакладной
	//               |ИЗ
	//               |	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	//               |ГДЕ
	//               |	РасходнаяНакладная.ДокОснование = &Текзаказ
	//               |	И РасходнаяНакладная.ДатаОтгрузки >= &ДатаОтгрузки
	//               |	И РасходнаяНакладная.Проведен = ИСТИНА
	//               |
	//               |ОБЪЕДИНИТЬ ВСЕ
	//               |
	//               |ВЫБРАТЬ
	//               |	Перемещение.Ссылка,
	//               |	Перемещение.СостояниеНакладной
	//               |ИЗ
	//               |	Документ.Перемещение КАК Перемещение
	//               |ГДЕ
	//               |	Перемещение.ДокОснование = &Текзаказ
	//               |	И Перемещение.ДатаОтгрузки >= &ДатаОтгрузки
	//               |	И Перемещение.Склад = &ТекСклад
	//               |	И Перемещение.Проведен = ИСТИНА";
	//--Данилова Е.В. 06.12.2024
	// НЕ ВСе ПРМ брать!!!!
	
	Запрос.УстановитьПараметр("Текзаказ",ТекЗаказ); 
	Запрос.УстановитьПараметр("ТекСклад",ТекЗаказ.Склад);
	Запрос.УстановитьПараметр("ДатаОтгрузки",ТекущаяДата()-3*30*24*60*60);  // за 3 месяца назад
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	ТЗ.Свернуть("Док, СостояниеНакладной");
	
	
	
	
	Для каждого текстр из ТЗ цикл
		
		Если ТекСтр.состояниеНакладной<> перечисления.СостоянияНакладной.Отгружена Тогда
			
			возврат "CO";
			прервать;
			
		конецЕсли;	
		
	конецЦикла;
	
	возврат "F";	
	
КонецФункции	

// нечаева 03,11,23+++
Процедура ЗаписатьДокументЗаказ(ДокументПРоведения)

	РежимПроведения = ?(ПроводитьДокументыОперативно, РежимПроведенияДокумента.Оперативный, РежимПроведенияДокумента.Неоперативный);
	
	Если ДокументПРоведения = документы.Заказ.ПустаяСсылка() тогда
		возврат;
	КонецЕсли;	
	//++Данилова Е.В. 11.09.2024
	//Докк = ДокументПроведения.ПолучитьОбъект();
	Если ТипЗнч(ДокументПРоведения) = Тип("ДокументСсылка.Заказ") Тогда
	
		Докк = ДокументПроведения.ПолучитьОбъект();
		
	ИначеЕсли ТипЗнч(ДокументПРоведения) = Тип("ДокументОбъект.Заказ") Тогда
		
		Докк = ДокументПРоведения; 
		
	КонецЕсли;
	//--Данилова Е.В. 11.09.2024
	
	Если  НЕ  ДокументПРоведения.пометкаУдаления = истина ТОгда
	
		
		Попытка
			
			Докк.Записать(РежимЗаписиДокумента.Проведение, РежимПроведения);			
			
		Исключение
			ЗаписатьВЛог("b2b", "Ошибка при проведении документа: " + Строка(ДокументПРоведения) + Символы.ПС + ОписаниеОшибки(),"Информация"); 
			//++Данилова Е.В. 11.09.2024
			Если ТранзакцияАктивна() Тогда
			
				ОтменитьТранзакцию();
			
			КонецЕсли;
			//--Данилова Е.В. 11.09.2024
		конецПопытки;
	иначе
		Попытка
			Докк.Записать(РежимЗаписиДокумента.ОтменаПроведения);			
		Исключение
			ЗаписатьВЛог("b2b", "Ошибка при установке пометки на удаление документа: " + Строка(ДокументПроведения) + Символы.ПС + ОписаниеОшибки(),"Информация");                     
			СообщитьОбИсключительнойОшибке(Ложь, "Ошибка при установке пометки на удаление документа: " + Строка(ДокументПроведения) + Символы.ПС + ОписаниеОшибки());
			//++Данилова Е.В. 11.09.2024
			Если ТранзакцияАктивна() Тогда
			
				ОтменитьТранзакцию();
			
			КонецЕсли;
			//--Данилова Е.В. 11.09.2024
			Возврат;
		КонецПопытки;
	конецЕсли;
	
КонецПРоцедуры
//нечаева 03,11,23--

Функция СформироватьCMLСРанееЗагруженнымиЗаказами(СтрокаCML, МассивИзменений) 
	//
	ОтобразитьСостояние("Поиск открытых заказов, загруженных с " + HTTPОбменСервер + "...");
	
	ТаблицаДокументов = тСписокЗаказовНаОтправку; //ПроцедурыОбменаССайтом.ПолучитьЗаказыСОплатойИОтгрузкойПоКатегориямПоРегистру(МассивИзменений, мМассивЗагруженныхДокументов);
	
	Если ТаблицаДокументов.Количество() = 0 Тогда  
		Возврат ТаблицаДокументов;
	КонецЕсли;
	
	ОбъектCML = ПолучитьОбъектДляЗаписиXML("",ТекущаяДата());
	НачатьCML(ОбъектCML);
	
	// тут не будем табличную часть передавать.
	
	//++Данилова Е.В. 11.09.2024
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);//++Данилова Е.В. 29.04.2025 ASU-2239 
	//--Данилова Е.В. 11.09.2024
	Для Каждого СтрокаТД Из ТаблицаДокументов Цикл
		
		ТекЗаказ =  СтрокаТД.ЗаказСсылка;
		//нечаева 06,05,22+++
		ТекСтатус = ПолучитьСтатусЗаказа(ТекЗаказ);
		// поменяем статус у самого заказа.
		Если ТекСтатус = "CO" ТОгда
			ЗакОб  = текзаказ.ПолучитьОбъект();
			ЗакОб.СостояниеНакладной = перечисления.СостоянияЗаказаКонтрагента.ВыполненЧастично;
			//ЗакОб.записать();
			//++Данилова Е.В. 11.09.2024
			//ЗаписатьДокументЗаказ(текзаказ);
			ЗаписатьДокументЗаказ(ЗакОб);
			//--Данилова Е.В. 11.09.2024

		иначе
			попытка
				ЗакОб  = текзаказ.ПолучитьОбъект();
				ЗакОб.СостояниеНакладной = перечисления.СостоянияЗаказаКонтрагента.Выполнен;
				ЗакОб.СостояниеСогласования = перечисления.СостоянияСогласования.Выполнен;
				//ЗакОб.записать();
				//++Данилова Е.В. 11.09.2024
				//ЗаписатьДокументЗаказ(текзаказ);
				ЗаписатьДокументЗаказ(ЗакОб);
				//--Данилова Е.В. 11.09.2024

			исключение
					ЗаписатьВЛог("b2b", "Ошибка при проведении документа: " + Строка(ЗакОб) + Символы.ПС + ОписаниеОшибки(),"Информация");                     
			//СообщитьОбИсключительнойОшибке(Ложь, "Ошибка при проведении документа: " + Строка(ДокументПроведения) + Символы.ПС + ОписаниеОшибки());
			//Возврат Ложь;

			конецпопытки;
		конецЕсли;
		//нечаева 06,05,22--
		
		ОбъектCML.ЗаписатьНачалоЭлемента("Документ");
		
		ВыгрузитьЗаказВCML(ОбъектCML, СтрокаТД);
		
		ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияРеквизитов");
		
		ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Номер по 1С", СтрокаТД.Номер);
		ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Дата по 1С", ФорматДатыДляCML(СтрокаТД.Дата));
		ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "ПометкаУдаления", СтрокаТД.ПометкаУдаления);
		ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Проведен", СтрокаТД.Проведен);
		
		ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Финальный статус", "false");
		
		ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Платежный профиль", ТекЗаказ.контрагент.ведущий.код);
		ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Код пользователя", ТекЗаказ.контрагент.код);
		ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Адрес доставки", ТекЗаказ.пунктДоставки.код);
		ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Дата доставки", ФорматДатыДляCML(ТекЗаказ.ДатаОтгрузки));

				
		// тут меняем статус заказа
		Если ТекСтатус = "CO" ТОгда
			
			ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Статуса заказа ИД", "CO");
			ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Статуса заказа", "[CO] Частично отгружено");
		иначе
					
			ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Статуса заказа ИД", "F");
			ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Статуса заказа", "[F] Выполнен");
		конецЕсли;
		
		
		// "[P] Оформлен"
		// [D] Отменен
		// [N] В обработке
		// [A] Требует подтверждения
		// [P] Оформлен
		// CO - частично отгружен
		// [F] Выполнен
		
		
		ОбъектCML.ЗаписатьКонецЭлемента();
		ОбъектCML.ЗаписатьКонецЭлемента();
		
	КонецЦикла;
	
	//ОбъектCML.ЗаписатьКонецЭлемента();
	
	СтрокаCML = ЗавершитьCML(ОбъектCML);
	
	//++Данилова Е.В. 11.09.2024
	Если ТранзакцияАктивна() Тогда
		
		ЗафиксироватьТранзакцию();
		
	КонецЕсли;
	//--Данилова Е.В. 11.09.2024
	
	Возврат ТаблицаДокументов;
	
КонецФункции
//-----------------------------------------------------------------------------------------------------------------------------------------------
// выгрузка маленького файла
Функция СформироватьCMLСРанееЗагруженнымиЗаказамиВыгрузкаКоличества(СтрокаCML, МассивИзменений) 
	
	ОтобразитьСостояние("Поиск 2 открытых заказов, загруженных с " + HTTPОбменСервер + "...");
	
	// теже самые документы выгружаем по количеству, потом проверку на статус сделаем
	ТаблицаДокументов = тСписокЗаказовНаОтправку ; //ПроцедурыОбменаССайтом.ПолучитьЗаказыСОплатойИОтгрузкойПоКатегориямПоРегистру(МассивИзменений, мМассивЗагруженныхДокументов);
	
	Если ТаблицаДокументов.Количество() = 0 Тогда  
		Возврат ТаблицаДокументов;
	КонецЕсли;
	
	ОбъектCML = ПолучитьОбъектДляЗаписиXML("",ТекущаяДата());
	НачатьCML(ОбъектCML);
	
	
	Для Каждого СтрокаТД Из ТаблицаДокументов Цикл
		
		ОбъектCML.ЗаписатьНачалоЭлемента("Документ");
		
		//ВыгрузитьЗаказВCML(ОбъектCML, СтрокаТД);
		СформироватьДопФайл(СтрокаТД.ЗаказСсылка,ОбъектCML);
		
		// "[P] Оформлен"
		// [D] Отменен
		// [N] В обработке
		// [A] Требует подтверждения
		// [P] Оформлен
		// [F] Выполнен
		
		
		ОбъектCML.ЗаписатьКонецЭлемента();  // здесь документ
		
	КонецЦикла;	
	//ОбъектCML.ЗаписатьКонецЭлемента();
	
	СтрокаCML = ЗавершитьCML(ОбъектCML);
	
	Возврат ТаблицаДокументов;
	
КонецФункции

// формирование маленького файла, для изменения количества
Процедура СформироватьДопФайл(Док,ЗаписьXML)
	
	
	//	сообщить(ИмяФайлаОбмена);
	
	
	//ЗаписьXML=Новый ЗаписьXML;
	//ЗаписьXML.ОткрытьФайл(ИмяФайлаОбмена);   //(Путь+Имя+".xml");
	// 
	//ЗаписьXML.ЗаписатьОбъявлениеXML();    
	//  ЗаписьXML.ЗаписатьНачалоЭлемента("КоммерческаяИнформация");
	//ЗаписьXML.ЗаписатьНачалоЭлемента("Документ");
	
	
	ИдЗаказа = Док.ИдЗаказа;
	Если ИдЗаказа ="" Тогда
		ИдЗаказа = Док.НомерЗаказа ;
	КонецЕсли;	
	

	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Ид");
	ЗаписьXML.ЗаписатьТекст(Док.ИдЗаказа);
	ЗаписьXML.ЗаписатьКонецЭлемента(); // Ид
	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Товары");
	Для Каждого Текстрока  Из док.Товары Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Товар");
		
		///------------------------------------------------------
		ЗаписьXML.ЗаписатьНачалоЭлемента("Ид");
		ЗаписьXML.ЗаписатьТекст(""+Текстрока.Номенклатура.РОдитель.Код+"#"+Текстрока.Номенклатура.Код);
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Ид
		///------------------------------------------------------
		ЗаписьXML.ЗаписатьНачалоЭлемента("ЦенаЗаЕдиницу");
		ЗаписьXML.ЗаписатьТекст(Строка(ТекСтрока.Цена));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Ид
		///------------------------------------------------------
		ЗаписьXML.ЗаписатьНачалоЭлемента("Количество");
		ЗаписьXML.ЗаписатьТекст(Строка(Текстрока.Количество));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Ид
		///------------------------------------------------------
		ЗаписьXML.ЗаписатьНачалоЭлемента("Сумма");
		ЗаписьXML.ЗаписатьТекст(Строка(Текстрока.Всего));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Ид
		
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Блюдо
		
	КонецЦикла;
	
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // товары
	
	//ЗаписьXML.ЗаписатьКонецЭлемента(); // документ 
	// ЗаписьXML.ЗаписатьКонецЭлемента(); // документ 
	
	//
	//ЗаписьXML.Закрыть();
	
	
	
КонецПроцедуры

////----------------------------------------------------------------------------------------------------------



Процедура НачатьCML(ЗаписьXML);
	
	//ЗаписьXML.ЗаписатьНачалоЭлемента("КоммерческаяИнформация");
	//ЗаписьXML.ЗаписатьАтрибут("ВерсияСхемы"			, "2.04.1CBitrix");
	//ЗаписьXML.ЗаписатьАтрибут("ФорматДаты"			, ФорматДаты);
	//ЗаписьXML.ЗаписатьАтрибут("ФорматВремени"		, ФорматВремени);
	//ЗаписьXML.ЗаписатьАтрибут("РазделительДатаВремя", РазделительДатаВремя);
	//ЗаписьXML.ЗаписатьАтрибут("ФорматСуммы"			, ФорматСуммы);
	//ЗаписьXML.ЗаписатьАтрибут("ФорматКоличества"	, ФорматКоличества);
	//ЗаписьXML.ЗаписатьАтрибут("ДатаФормирования"	, ФорматДатыДляCML(мДатаФормирования, Истина, Истина));
	
КонецПроцедуры

Функция ЗавершитьCML(ЗаписьXML)
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Возврат ЗаписьXML.Закрыть();
КонецФункции

Функция ФорматВалютыДляCML(НаименованиеВалюты)
	
	Возврат Лев(НаименованиеВалюты, 3);;
	
КонецФункции

Функция ФорматНаименованияДляXDTO(Наименование)
	
	Возврат Лев(Наименование, 250);
	
КонецФункции


Процедура ВыгрузитьЗаказВCML(ОбъектCML, Док)
	
			
	ИдЗаказа = Док.ЗаказССылка.ИдЗаказа;
	Если ИдЗаказа ="" Тогда
		ИдЗаказа = Док.НомерВходящегоДокументаЭлектронногоОбмена ;
	КонецЕсли;	
	
	
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид"	, ИдЗаказа) ; //Строка(Док.ЗаказСсылка.УникальныйИдентификатор()));
	ЗаписатьТекстовойУзел(ОбъектCML, "Номер", Док.НомерВходящегоДокументаЭлектронногоОбмена);
	ЗаписатьТекстовойУзел(ОбъектCML, "Дата" , ФорматДатыДляCML(Док.ДатаВходящегоДокументаЭлектронногоОбмена, Истина, Ложь));	
	ЗаписатьТекстовойУзел(ОбъектCML, "ХозОперация", "Заказ товара");
	
	ЗаписатьТекстовойУзел(ОбъектCML, "Роль"		  , "Продавец");
	ЗаписатьТекстовойУзел(ОбъектCML, "Валюта"	  , ФорматВалютыДляCML(Док.ВалютаДокумента));
	ЗаписатьТекстовойУзел(ОбъектCML, "Курс"	      , Док.КурсВзаиморасчетов);
	ЗаписатьТекстовойУзел(ОбъектCML, "Сумма"      , Док.СуммаДокумента); //ФорматЗначенияДляCML(Док.СуммаДокумента, ФорматСуммы));	
		
	ОбъектCML.ЗаписатьНачалоЭлемента("Контрагенты");
		
	ВыгрузитьКонтрагентаДок(ОбъектCML, Док.Контрагент,,,,Док.ЗаказСсылка.ПунктДоставки); 	
	//ВыгрузитьРеквизитыКонтрагентаВCML(ОбъектCML, Док.Контрагент);
	ОбъектCML.ЗаписатьКонецЭлемента();   //контрагенты
		
	ЗаписатьТекстовойУзел(ОбъектCML, "Время", ФорматДатыДляCML(Док.ДатаВходящегоДокументаЭлектронногоОбмена, Ложь, Истина));
	ЗаписатьТекстовойУзел(ОбъектCML, "СрокПлатежа", ФорматДатыДляCML(Док.ДатаОплаты, Истина, Ложь));
	
	ЗаписатьТекстовойУзел(ОбъектCML, "Комментарий", ФорматНаименованияДляCML(Док.Комментарий));
	
	//----------------------------------------------------	
	// для смены статуса нам товары не нужны
	//ВыгрузитьТоварыУслугиЗаказаВCML(ОбъектCML, Док);
	
	
КонецПроцедуры


процедура   ВыгрузитьТоварыУслугиЗаказаВCML(ОбъектCML, Док)
	
	// выгрузка товаров для заказа --------------------------------------------------------------	
	ОбъектCML.ЗаписатьНачалоЭлемента("Товары");
	СохрНомерСтроки = 0;
	ТипДок = док.заказСсылка.метаданные().Имя;
	
	Если ТИпДок <> "Заказ" тогда
		типдок = "РНК";
	КонецЕсли;	
	
	ТЧТовары = док.заказссылка.товары;  // было - количество бралось, а нам нужны исходные данные  Док.товары
		
	Для каждого выборка из  ТЧТовары Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.Номенклатура) Тогда 
			Продолжить;
		КонецЕсли;
		
		//Не выгружаем дубли строки, которые возникают если один товар имеет более одного штрихкода
		Если СохрНомерСтроки = Выборка.НомерСтроки Тогда
			Продолжить;
		Иначе
			СохрНомерСтроки = Выборка.НомерСтроки;
		КонецЕсли;
		
		ОбъектCML.ЗаписатьНачалоЭлемента("Товар");
		
		ВыгрузитьОсновныеРеквизитыТовара(ОбъектCML, Выборка, ""+Выборка.Номенклатура.Родитель.код+"#"+""+Выборка.Номенклатура.код);
		
		
		ВыгрузитьБазовыеРеквизитыТабличнойЧастиТоваров(ОбъектCML, Выборка, "b2b",ТипДок);
		
		//Выгрузка информации по налогам
		//ВыгрузитьИнформациюОНалогахДляВыборки(ОбъектCML, Выборка);
		
		//ВыгрузитьИнформациюОСерийномНомере(ОбъектXML, Выборка);
		
		ОбъектCML.ЗаписатьКонецЭлемента();
		
		
	КонецЦикла;
	
	ОбъектCML.ЗаписатьКонецЭлемента();
	

	
	
конецПроцедуры


// Процедура пищет в XML-файл обязательные для товара реквизиты
// если передан пустой идентификатор, то он формируется по умолчанию
//
// Параметры:
//  ОбъектXML - объект типа ЗаписьXML
//  Товар     - структура, содержащая реквизиты товара
//  Ид        - строка идентификатор товара
//
Процедура ВыгрузитьОсновныеРеквизитыТовара(ОбъектXML, Товар, Ид = Неопределено)
	
		Если НЕ ЗначениеЗаполнено(Ид) Тогда
		ИдТовара = СформироватьИдентификатовТовара(Товар.НоменклатураСсылка, Товар.ХарактеристикаСсылка);
		ЗаписатьТекстовойУзел(ОбъектXML, "Ид", ИдТовара);
	Иначе
		ЗаписатьТекстовойУзел(ОбъектXML, "Ид", Ид);		
	КонецЕсли;
	
	//++-++
	// выводить штрих код товара
	
	ШтрихКод="";
	//-------------------
	Попытка
		
		ТипШк = Перечисления.ТипыШтрихКодов.Штука;
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	ШтрихКоды.Владелец КАК Номенклатура,
		|	ШтрихКоды.Наименование КАК номер,
		|	ШтрихКоды.Код
		|ИЗ
		|	Справочник.ШтрихКоды КАК ШтрихКоды
		|ГДЕ
		|	ШтрихКоды.ТипШК = &ТипШК
		|	И ШтрихКоды.Владелец = &ТекНом
		|	И ШтрихКоды.ВидШК = &Основной";
		
		Запрос.УстановитьПараметр("ТекНом",Товар.НоменклатураСсылка); 
		Запрос.УстановитьПараметр("ТипШК",ТипШк);
		Запрос.УстановитьПараметр("Основной",Перечисления.ВидыШК.Основной);
		
		Выборка1 = запрос.Выполнить().Выбрать();
		
		Пока выборка1.Следующий() Цикл
			ШтрихКод=выборка1.Номер; //ШКО+"@"
		КонецЦикла;	
		
	Исключение
	КонецПопытки;
	
	Тов5=Товар.Номенклатура;
	
	ЗаписатьТекстовойУзел(ОбъектXML, "Штрихкод",    ШтрихКод);
	//ЗаписатьТекстовойУзел(ОбъектXML, "Артикул",      Товар.Артикул);
	ЗаписатьТекстовойУзел(ОбъектXML, "Артикул",    Строка(Тов5.Родитель.КодПроизводителя));
	
	ВыгрузитьНаименованиеНоменклатуры(ОбъектXML, Тов5);
	
	ВыгрузитьИнформациюОЕдиницеИзмерения(ОбъектXML, Тов5);
	
	//ВыгрузитьИдентификаторГруппыДляТовара(ОбъектXML, Товар);
	
	// выгрузить информацию по ставке налога
	ВыгрузитьИнформациюОСтавкеНалога(ОбъектXML, Тов5);
	
	ВыгрузитьДопИнформациюОНоменклатуре(ОбъектXML, Тов5);	

	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////

// Процедура проводит проверку значнеие и пишет текстовой узел в файл XML
//
// Параметры:
//  ОбъектXML - объект ЗаписьXML
//  Имя       - наименования узла
//  Значение  - текстовое значение для записи в файл
//
Процедура ЗаписатьТекстовойУзел2(ОбъектXML, Имя, Значение, ОбязательнаяПроверкаНаПустуюСтроку = Истина)
	
	СтрокаЗаписи = Строка(Значение);
	Если ОбязательнаяПроверкаНаПустуюСтроку
		И НЕ ЗначениеЗаполнено(СтрокаЗаписи) Тогда
		
		Возврат;		
		
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		
		СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, Символы.НПП, "");
		СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, ",", ".");
		
	ИначеЕсли ТипЗнч(Значение) = Тип("Булево") Тогда
		
		Если Значение Тогда
			СтрокаЗаписи = "true";
		Иначе
			СтрокаЗаписи = "false";
		КонецЕсли;
		
	КонецЕсли;
	
	ОбъектXML.ЗаписатьНачалоЭлемента(Имя);
	ОбъектXML.ЗаписатьТекст(СтрокаЗаписи);
	ОбъектXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

// Процедура проводит проверку значнеие и пишет текстовой узел в файл XML
//
// Параметры:
//  ОбъектXML - объект ЗаписьXML
//  Имя       - наименования узла
//  Значение  - текстовое значение для записи в файл
//
Процедура ЗаписатьАтрибут(ОбъектXML, Имя, Значение)
	
	СтрокаЗаписи = Строка(Значение);
	Если ЗначениеЗаполнено(СтрокаЗаписи) Тогда
		ОбъектXML.ЗаписатьАтрибут(Имя, СтрокаЗаписи)
	КонецЕсли;
	
КонецПроцедуры

// Функция формирует идентификатор для товара, по элементу номенклатуры и характеристика
//
// Параматры:
//  Номенклатура   - справочник-ссылка Номенклатура
//  Характеристика - справочник-ссылка ХарактеристикиНоменклатуры
//
// Возвращаемое значение:
//  строка - идентификатор товара для каталога
//
Функция СформироватьИдентификатовТовара(Номенклатура, Характеристика)
	
	Если НЕ ЗначениеЗаполнено(Характеристика) Тогда
		
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда
			Возврат "";
		Иначе		
			Возврат Строка(Номенклатура.УникальныйИдентификатор());
		КонецЕсли;
		
	Иначе
		
		Возврат Строка(Номенклатура.УникальныйИдентификатор()) + "#" + Строка(Характеристика.УникальныйИдентификатор());
		
	КонецЕсли;
	
КонецФункции

// Функция формирует идентификатор для товара, по элементу номенклатуры и характеристика
//
// Параматры:
//  Номенклатура   - справочник-ссылка Номенклатура
//  Характеристика - справочник-ссылка ХарактеристикиНоменклатуры
//
// Возвращаемое значение:
//  строка - идентификатор товара для каталога
//
Функция СформироватьИдентификатовТовараПоКодам(Номенклатура, Характеристика)
	
	Если НЕ ЗначениеЗаполнено(Характеристика) Тогда
		Возврат Строка(Номенклатура.Код);
	Иначе
		Возврат Строка(Номенклатура.Код) + СтрЗаменить(Строка(Характеристика.УникальныйИдентификатор()), "-", "");
	КонецЕсли;
	
КонецФункции





////////////////////////////////////////////////////////////////////////////////

Функция ВыгрузитьНаименованиеНоменклатуры(ОбъектXML, Товар)
	
	НаименованиеНоменклатуры =  Товар.Наименование;
	
	ИмяТовара = НаименованиеНоменклатуры;
	
	//
	//Если НЕ ЗначениеЗаполнено(Товар.ХарактеристикаСсылка) Тогда
	//	ИмяТовара = НаименованиеНоменклатуры;
	//Иначе
	//	ИмяТовара = СокрЛП(НаименованиеНоменклатуры) + " (" + СокрЛП(Товар.НаименованиеХарактеристики) + ")";
	//КонецЕсли;
	
	ЗаписатьТекстовойУзел(ОбъектXML, "Наименование", ИмяТовара);
	
КонецФункции

Процедура ВыгрузитьРазмерСтавкиНДС(ОбъектXML, Товар)
	
	//++-++
	// получить ставку НДС для товара
	
	
	ЗаписатьТекстовойУзел(ОбъектXML, "Ставка", Товар.СтавкаНДС);
	
КонецПроцедуры

Процедура ВыгрузитьИнформациюОСтавкеНалога(ОбъектXML, Товар)
	
	Если Не ЗначениеЗаполнено(Товар.СтавкаНДС) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектXML.ЗаписатьНачалоЭлемента("СтавкиНалогов");
	
	ОбъектXML.ЗаписатьНачалоЭлемента("СтавкаНалога");
	
	ЗаписатьТекстовойУзел(ОбъектXML, "Наименование", "НДС");
	
	ВыгрузитьРазмерСтавкиНДС(ОбъектXML, Товар);
	
	ОбъектXML.ЗаписатьКонецЭлемента();
	
	ОбъектXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ВыгрузитьИнформациюОЕдиницеИзмерения(ОбъектXML, Товар)
	
		Если ЗначениеЗаполнено(Товар.ОсновнаяЕдиница) Тогда
		
		ОбъектXML.ЗаписатьНачалоЭлемента("БазоваяЕдиница");
		
		ОбъектXML.ЗаписатьАтрибут("Код", "796");
		
		Если Не ПустаяСтрока(Товар.ОсновнаяЕдиница.Наименование) Тогда
			ОбъектXML.ЗаписатьАтрибут("НаименованиеПолное", "Штука"); //Стрзаменить(Товар.ОсновнаяЕдиница.Наименование,".",""));
		КонецЕсли;
		
		ОбъектXML.ЗаписатьАтрибут("МеждународноеСокращение", "PCE");
		ОбъектXML.ЗаписатьТекст(Стрзаменить(Товар.ОсновнаяЕдиница.Наименование,".",""));
		
				
		ОбъектXML.ЗаписатьКонецЭлемента();		
		
	КонецЕсли;

	
КонецПроцедуры

Процедура ВыгрузитьДопИнформациюОНоменклатуре(ОбъектXML, Товар)
	
	
	//ОбъектXML.ЗаписатьНачалоЭлемента("ЗначенияРеквизитов");
	//попытка
	//	ТипТ=Товар.Родитель.Родитель.Родитель.Родитель.наименование;
	//исключение
	//	попытка
	//		ТипТ=Товар.Родитель.Родитель.Родитель.наименование;
	//	исключение
	//		ТипТ=Товар.Родитель.Родитель.наименование;
	//	КонецПопытки;
	//Конецпопытки;
	//
	//ОбъектXML.ЗаписатьНачалоЭлемента("ЗначениеРеквизита");	
	//ЗаписатьТекстовойУзел(ОбъектXML, "Наименование",  "ВидНоменклатуры");
	//ЗаписатьТекстовойУзел(ОбъектXML, "Значение",  ТипТ);
	//ОбъектXML.ЗаписатьКонецЭлемента();
	//
	//ОбъектXML.ЗаписатьНачалоЭлемента("ЗначениеРеквизита");	
	//ЗаписатьТекстовойУзел(ОбъектXML, "Наименование",  "ТипНоменклатуры");
	//ЗаписатьТекстовойУзел(ОбъектXML, "Значение",  Строка(Товар.Родитель.ТипТовара));
	//ОбъектXML.ЗаписатьКонецЭлемента();
	//
	//ОбъектXML.ЗаписатьНачалоЭлемента("ЗначениеРеквизита");	
	//ЗаписатьТекстовойУзел(ОбъектXML, "Наименование",  "НаименованиеКраткое");
	//ЗаписатьТекстовойУзел(ОбъектXML, "Значение",  Строка(Товар.Родитель.КодПроизводителя));
	//ОбъектXML.ЗаписатьКонецЭлемента();
	//
	//ОбъектXML.ЗаписатьНачалоЭлемента("ЗначениеРеквизита");	
	//ЗаписатьТекстовойУзел(ОбъектXML, "Наименование",  "НаименованиеПолное");
	//ЗаписатьТекстовойУзел(ОбъектXML, "Значение",  Строка(Товар.Наименование));
	//ОбъектXML.ЗаписатьКонецЭлемента();
	//
	//ОбъектXML.ЗаписатьКонецЭлемента();
	//
	////ЗаписатьТекстовойУзел(ОбъектXML,"ИДКаталога", Строка(Товар.Родитель.УникальныйИдентификатор()));
	//
	//ЗаписатьТекстовойУзел(ОбъектXML,"ИДКаталога", Строка("clothes_offers_s1"));
	
	
	ЗаписатьТекстовойУзел(ОбъектXML,"ИдКаталога", Строка("clothes_offers_s1"));

	ОбъектXML.ЗаписатьНачалоЭлемента("ЗначенияРеквизитов");
	попытка
		ТипТ=Товар.Родитель.Родитель.Родитель.Родитель.наименование;
	исключение
		попытка
			ТипТ=Товар.Родитель.Родитель.Родитель.наименование;
		исключение
			ТипТ=Товар.Родитель.Родитель.наименование;
		КонецПопытки;
	Конецпопытки;
	
	ОбъектXML.ЗаписатьНачалоЭлемента("ЗначениеРеквизита");	
	ЗаписатьТекстовойУзел(ОбъектXML, "Наименование",  "ВидНоменклатуры");
	ЗаписатьТекстовойУзел(ОбъектXML, "Значение",  "Товар");
	ОбъектXML.ЗаписатьКонецЭлемента();
	
	ОбъектXML.ЗаписатьНачалоЭлемента("ЗначениеРеквизита");	
	ЗаписатьТекстовойУзел(ОбъектXML, "Наименование",  "ТипНоменклатуры");
	ЗаписатьТекстовойУзел(ОбъектXML, "Значение", "Товар" ); //Строка(Товар.Родитель.ТипТовара));
	ОбъектXML.ЗаписатьКонецЭлемента();
			
	ОбъектXML.ЗаписатьКонецЭлемента();

	
КонецПроцедуры


Процедура ВыгрузитьИнформациюОНалогахДляВыборки(ОбъектXML, Выборка)
	
	//Выгрузка информации по налогам в докменте
	Если Выборка.СуммаНДС Тогда
		ОбъектXML.ЗаписатьНачалоЭлемента("Налоги");
		ВыгрузитьНДС(ОбъектXML, "True", Выборка.СуммаНДС);  // сума включает НДС
		ОбъектXML.ЗаписатьКонецЭлемента();
	КонецЕсли;	
	
КонецПроцедуры

Процедура ВыгрузитьБазовыеРеквизитыТабличнойЧастиТоваров(ОбъектXML, Выборка, ИдКаталога, ТИпДОк)
	
	//нечаева 23,03,22+++
	Если ТИпДок = "Заказ" ТОгда
		
		ЗаписатьТекстовойУзел(ОбъектXML, "ЦенаЗаЕдиницу",    Выборка.ЦенаИсточник); // цена
	Иначе
		// для рнк
		ЗаписатьТекстовойУзел(ОбъектXML, "ЦенаЗаЕдиницу",    Выборка.Цена); // цена
		
	КонецЕсли;
	//нечаева 23,03,22
	
	
	Если ТИпДок = "Заказ" ТОгда
		
		
		Если Выборка.Заявка>0 Тогда
			ЗаписатьТекстовойУзел(ОбъектXML, "Количество",       Выборка.Заявка);  
		иначе
			ЗаписатьТекстовойУзел(ОбъектXML, "Количество",       Выборка.Количество);  
			
		конецЕсли;
	иначе
		// для рнк
		ЗаписатьТекстовойУзел(ОбъектXML, "Количество",       Выборка.Количество); 
	конецЕсли;
	ЗаписатьТекстовойУзел(ОбъектXML, "Сумма",            Выборка.Сумма);
	ЗаписатьТекстовойУзел(ОбъектXML, "Единица",          СтрЗаменить(Выборка.Единица,".",""));
	ЗаписатьТекстовойУзел(ОбъектXML, "Коэффициент",      "1");	
	

КонецПроцедуры

// Процедура пищет в XML-файл информацию о налоге НДС
//
// Параметры:
//  ОбъектXML    - объект типа ЗаписьXML
//  УчтеноВСумме - флаг НДС в сумме
//  Сумма        -  сумма НДС
//
Процедура ВыгрузитьНДС(ОбъектXML, УчтеноВСумме, Сумма = 0)
	
	ОбъектXML.ЗаписатьНачалоЭлемента("Налог");
	ЗаписатьТекстовойУзел(ОбъектXML, "Наименование", "НДС");
	ЗаписатьТекстовойУзел(ОбъектXML, "УчтеноВСумме", УчтеноВСумме);
	Если Сумма Тогда
		ЗаписатьТекстовойУзел(ОбъектXML, "Сумма", Сумма);
	КонецЕсли;
	ОбъектXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры



//// Процедура пищет в XML-файл информацию о контрагенте при выгрузке документов
////
//// Параметры:
////  ОбъектXML  - объект типа ЗаписьXML
////  Контрагент - справочник-ссылка "КОнтрагенты"
////  Роль       - строка - значение тэга "Роль"
////
Процедура ВыгрузитьКонтрагентаДок(ОбъектXML, Контрагент, Роль = Неопределено, СтруктурнаяЕдиница = Неопределено, ИмяГруппыВыгрузки = "Контрагент",ПунктДоставки=неопределено)
	
	ОбъектXML.ЗаписатьНачалоЭлемента(ИмяГруппыВыгрузки);
	
	ЗаписатьТекстовойУзел(ОбъектXML, "Ид",           Строка(Контрагент.ведущий.код));
	ЗаписатьТекстовойУзел(ОбъектXML, "Наименование", Контрагент.Наименование);
	
	//Если Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
	//	ЗаписатьТекстовойУзел(ОбъектXML, "ОфициальноеНаименование", Контрагент.НаименованиеПолное);
	////	
	////	// выгрузка юридического адреса
	////	Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.Организации") Тогда
	////		ВыгрузитьЮрАдресОрганизации(ОбъектXML, Контрагент);
	////	КонецЕсли;
	////	
	//Иначе
	//	ЗаписатьТекстовойУзел(ОбъектXML, "ПолноеНаименование", Контрагент.НаименованиеПолное);
	//КонецЕсли;
	
	
	
	//-------------------------------------------------------------------------------------
	// адрес организации
	Если ПунктДоставки<> неопределено тогда
		
		ОбъектXML.ЗаписатьНачалоЭлемента("Адрес");
		ЗаписатьТекстовойУзел(ОбъектXML, "Представление", ПунктДоставки.код);
		
		ОбъектXML.ЗаписатьКонецЭлемента(); // адрес
		
	КонецЕсли;	
	//--- конец адреса организации
	
	ЗаписатьТекстовойУзел(ОбъектXML, "ИНН", Контрагент.ИНН);
	ЗаписатьТекстовойУзел(ОбъектXML, "КПП", Контрагент.КПП);
	Попытка
		// для организации
		ЗаписатьТекстовойУзел(ОбъектXML, "ОКПО", Контрагент.КодПоОКПО);
	исключение
	конецпопытки;
	
	Попытка
		// для контрагента
		ЗаписатьТекстовойУзел(ОбъектXML, "ОКПО", Контрагент.ОКПО);
	исключение
	конецпопытки;
	
	
	//ВыгрузитьБанковскийсчетОрганизации(ОбъектXML, СтруктурнаяЕдиница);
	
	//Если Роль <> Неопределено Тогда
	ЗаписатьТекстовойУзел(ОбъектXML, "Роль", "Покупатель");
	//КонецЕсли;
	
	ОбъектXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

// нечаева 10,12,21  + +++
Функция КомандаЗагрузкиСогласиеПромо(СтруктураПараметровСайта) Экспорт 

	ОтветСервера = Неопределено;
	ИмяФайлаОтвета = ПолучитьИмяВременногоФайла();
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".txt");
	
	АдресТ = СтруктурапараметровСайта.Сервер;   
	попытка 
		Соединение = Новый HTTPСоединение(АдресТ,443,СтруктураПараметровСайта.ИмяПользователя,СтруктураПараметровСайта.Пароль,,,Новый ЗащищенноеСоединениеOpenSSL);  // логин  пароль сюда пропсиать
	исключение
		//Сообщить(ОписаниеОшибки());
	конецПопытки;
	//https://collant.prominado.dev/local/crons/export/promos.php?from=01.01.2021 	
	команда = "/local/crons/export/promos.php?from=01.01.2021";   
		
	HTTPзапрос = новый HTTPзапрос();
	HTTPзапрос.АдресРесурса = Команда;
	
	// формируем файл для отправки
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".xml");
		
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "text/xml;charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept", "text/xml");
	ЗаголовокHTTP.Вставить("Host", СтруктурапараметровСайта.Сервер);
	
	ЗаголовокHTTP.Вставить("Accept-Language", "ru");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("Content-Language", "ru");
	ЗаголовокHTTP.Вставить("Content-Charset", "utf-8");
	//ЗаголовокHTTP.Вставить("Content-type", "application/json");
	
		
	HTTPзапрос.Заголовки = ЗаголовокHTTP;

	//Ответ = Соединение.Получить(HTTP_запрос);  // ИмяВыходногоФайла
	
	попытка
		Соединение.Получить(HTTPзапрос, ИмяВременногоФайла);   
	исключение
		СообщитьПользователю("Ошибка отправки Файла по количеству товаров. "+ОписаниеОшибки(),истина);
	конецПопытки;
		
	ФайлОтвета = Новый Файл(ИмяВременногоФайла);
	ОтветСервера = неопределено;
	
	Если ФайлОтвета.Существует() Тогда
		
		ТекстОтвета = Новый ТекстовыйДокумент();
		ТекстОтвета.Прочитать(ИмяВременногоФайла, КодировкаТекста.UTF8);
		Если ТекстОтвета.КоличествоСтрок()>0 Тогда
			ОтветСервера = ТекстОтвета.ПолучитьТекст();	
			//сообщить(ИмяВременногоФайла);
		Иначе
			// если пустой ответ, то все прогрузилось
			//СообщитьПользователю("Файл по количеству товаров отправлен.",истина);
		КонецЕсли;	
		
	Иначе	
		//СообщитьПользователю("Отправка файла на сервер: Ответ сервера не получен.", Истина); 
	КонецЕсли;	

	//сообщить(ответсервера);
	
	//
	//
	//Попытка
	//	УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайлаОтвета);   
	//Исключение
	//КонецПопытки;

	возврат ИмяВременногоФайла;	
	

конецФункции
// нечаева 10,12,21  ----



функция загрузитьпромоакции()
	
	// больше тут не грузим согласие на акции 10,07,23
	возврат истина;
	ОтправитьПисьмо = Ложь;
	МассивК =Новый Массив;
	
	// herfvb
	СтруктураПараметровСайта = ПроцедурыОбменаССайтом.ПолучитьСтруктуруПараметровДляСоединения(ЭтотОбъект);
	ИмяПутиОтвета = КомандаЗагрузкиСогласиеПромо(СтруктураПараметровСайта);
	
	
	///------------------------------------------------------------
	// обработка и загрузка документа акции
	ТЗЗагрузки = Новый ТаблицаЗначений;
	
	 // максимальная длина строки - 20 символов
    КвалификаторыСтроки = Новый КвалификаторыСтроки(20);
    ОписаниеСтроки = Новый ОписаниеТипов("Строка", ,КвалификаторыСтроки);
	
	ТЗЗагрузки.Колонки.Добавить("Акция", ОписаниеСтроки);
	ТЗЗагрузки.Колонки.Добавить("Контрагент", ОписаниеСтроки);
	
	Файл = Новый ЧтениеXML;
	//Путь = "C:\Users\nechaeva\Desktop\Работа с заказми битрикс\confirmSales.xml";
	Путь =  ИмяПутиОтвета;
	Попытка
		Файл.ОткрытьФайл(Путь);
	Исключение
		//сообщить("Ошибка чтения файла");
		возврат ложь;
	КонецПопытки;
	
	
	Пока Файл.Прочитать() Цикл
		
		Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Файл.ЛокальноеИмя = "Акция" тогда
			СтрокаТаблицы = ТЗЗагрузки.Добавить();
		КонецЕсли;
		
		Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Файл.ЛокальноеИмя = "КодПользователя" тогда
			файл.Прочитать(); 
			НомерК = Файл.Значение;
			СтрокаТаблицы.Контрагент = НомерК;
		КонецЕсли;
		
		Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Файл.ЛокальноеИмя = "КодАкции" тогда
			файл.Прочитать(); 
			Номер = Файл.Значение;
			СтрокаТаблицы.Акция = Номер;
		КонецЕсли;
		
	КонецЦикла;		
	// выберем различные документы акции, и потом по ним будем проставлять галки	
	ТЗАкций = новый таблицаЗначений;
	//ТЗАкций.Колонки.Добавить("Акция");
	ТЗАкций = ТЗЗагрузки.Скопировать();
	ТЗАкций.свернуть("Акция");
	
	Для каждого ТекСтрокаАкция из ТЗАкций цикл
		
		ТекКодАкции = ТекСтрокаАкция.Акция;
		ТекКод = Сред(ТекКодАкции,4,СтрДлина(ТекКодАкции)-3);
		// выберем всех контаргентов оттуда;
		
		
		ТЗ2  = Новый ТаблицаЗначений;
		ТЗ2.Колонки.Добавить("Акция", ОписаниеСтроки);
		ТЗ2.Колонки.Добавить("Контрагент", ОписаниеСтроки);
		
		Запрос = Новый Запрос;
		ДанныеСкладов=Неопределено;
		МВТ = Новый МенеджерВременныхТаблиц;
		Запрос.МенеджерВременныхТаблиц = МВТ;
		Запрос.Текст  = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗ2.Акция КАК Акция,
		|	ТЗ2.Контрагент
		|ПОМЕСТИТЬ ТЗ2
		|ИЗ
		|	&ТЗ2 КАК ТЗ2
		|ГДЕ
		|	ТЗ2.Акция = &ТекАкция";
		Запрос.УстановитьПараметр("ТекАкция",ТекКодАкции);
		Запрос.УстановитьПараметр("ТЗ2", ТЗЗагрузки);
		Запрос.Выполнить();
		
		Запрос.Текст="ВЫБРАТЬ
		|	ТЗ2.акция КАК акция,
		|	ТЗ2.контрагент
		|ИЗ
		|	ТЗ2 КАК ТЗ2
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контрагент";
		РезНом=Запрос.Выполнить().Выгрузить();
		
		ТекДок = документы.УстановкаСкидокПоКонтрагентам.НайтиПоНомеру(ТекКод, НачалоГОда(ТекущаяДата()));
		#если клиент тогда
			Сообщить(ТекДок);
		#конецесли
		
		Если Текдок = документы.УстановкаСкидокПоКонтрагентам.ПустаяСсылка() Тогда
			продолжить;
		КонецЕсли;
		//--------------------------------------
		НачатьТранзакцию();
		ТО = ТекДок.ПолучитьОбъект();
		естьИзменения= ложь;
		Для каждого текстрока из Резном цикл
			
			ТКонтрагент = Справочники.Контрагенты.НайтиПоКоду(Текстрока.контрагент);
			НайденнаяСтрока = ТО.Контрагенты.Найти(ТКонтрагент,"контрагент");
			Если НайденнаяСтрока <> Неопределено и НайденнаяСтрока.согласован = ложь  Тогда
				НайденнаяСтрока.согласован = истина;
				естьИзменения=истина;
				ОтправитьПисьмо = истина;
				МассивК.Добавить(" "+ТКонтрагент+" "+ТекДок);
			КонецЕсли;	
			#если клиент тогда
			Сообщить(ТКонтрагент);
			#конецесли
		КонецЦикла;
		
		Если ЕстьИзменения тогда
			ТО.Записать();
		конецЕсли;
		ЗафиксироватьТранзакцию();
		
	КонецЦикла;	
	
	
	Если  МассивК.Количество()>0 Тогда
		
		 СообщитьКритОшибки(МассивК);
		
	КонецЕсли;	
	
	
	//ТекКодАкции
	//Сообщить("Акции прогружены");
	пп=1;

	возврат истина;	
	
конецФункции



Процедура СообщитьКритОшибки(МассивК) Экспорт
	
	
	Профиль= Новый ИнтернетПочтовыйПрофиль;
		ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);		 
	// Кухарь А.Ю.  08.09.2022 конец

	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	//------------------------------------------------
	// сообщение о критических ошибках
	//------------------------------------------------
	сообщениеКрит=новый интернетПочтовоеСообщение;
	СообщениеКрит.Получатели.Добавить("nechaeva@collant.ru");
		
	сообщениеКрит.Отправитель="ecode@collant.ru";
	СообщениеКрит.Тема="Автообмен Ecode. Новый галки участия в акциях!";
	Строка="Добрый день!!!"+Символ(13);
	НомСтр=1;
	Если  МассивК.Количество()>0 Тогда
		Для рр=0 по МассивК.Количество()-1 Цикл
			Строка=Строка+Символ(13)+НомСтр+". "+МассивК[рр];
			Строка=Строка+Символ(13);
			НомСтр=НомСтр+1;
		КонецЦикла;
	КонецЕсли;
	
	Строка=Строка+Символ(13)+"________________________________________________________________";
	//-----------------------------------------
	СообщениеКрит.Тексты.Добавить(Строка);
	
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
		почта.Послать(СообщениеКрит);
		Почта.Отключиться();
	исключение
		ЗаписатьВЛог("екод","Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки(),"Информация");
		
	конецПопытки;
	
КонецПроцедуры





//------------------------------------------------------------------------------------------------------------------


Процедура ДобавитьНовоеЗначениеРеквизита(ОбъектXML, Наименование, Значение, ПустоеЗначение = "", ИмяГруппыЭлементов = "ЗначениеРеквизита")
	
	ЗначениеДляЗаписи = Значение;
	Если ЗначениеДляЗаписи = Null Тогда
		ЗначениеДляЗаписи = ПустоеЗначение;
	КонецЕсли;
	
	Если ЗначениеДляЗаписи = "" Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектXML.ЗаписатьНачалоЭлемента(ИмяГруппыЭлементов);
	
	ЗаписатьТекстовойУзел(ОбъектXML, "Наименование",  Наименование, Ложь);
	ЗаписатьТекстовойУзел(ОбъектXML, "Значение",  ЗначениеДляЗаписи, Ложь);
	
	ОбъектXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Функция ФорматДатыДляCML(ЗначениеДата, ВернутьДату = Истина, ВернутьВремя = Ложь)
	ФорматДаты ="ДЛФ=Д";
	ФорматВремени = "ДЛФ=В";
	
	
	ДатаСтрока  = Формат(ЗначениеДата, ФорматДаты);
	ВремяСтрока = Формат(ЗначениеДата, ФорматВремени);	
	Результат   = "";
	
	Если ВернутьДату И ВернутьВремя Тогда
		Результат = ДатаСтрока + РазделительДатаВремя + ВремяСтрока;
	ИначеЕсли ВернутьДату И (НЕ ВернутьВремя) Тогда	
		Результат = ДатаСтрока;
	ИначеЕсли (НЕ ВернутьДату) И ВернутьВремя Тогда		
		Результат = ВремяСтрока;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции	

//-------------------------------------------------------------------------------------------------------------------
// печать формы для контрагента.

Функция ИдПоВидуДокумента(Вид)
	Возврат Метаданные.Документы[Вид].Синоним;	
КонецФункции //ВнутреннийИдВидаДокумента

Функция ВидПоИДДокумента(Ид)
	Для Каждого МетаДок Из Метаданные.Документы Цикл
		Если МетаДок.Синоним=Ид Тогда
			Возврат МетаДок.Имя;
		КонецЕсли;	    
	КонецЦикла;    
	Возврат "";
КонецФункции //ВидпоИД

Функция РасчСчет(Контрагент,Договор = "")
	РС=Контрагент.ОсновнойБанковскийСчет;
	ПечататьПолныеРеквизитыБанка = ложь;
	//крохин начало 29.01.2013
	Если  Договор <> "" Тогда
		Если НЕ Договор.РасчетныйСчетДляОплаты.Пустая() Тогда
			РС = Договор.РасчетныйСчетДляОплаты;	
		КонецЕсли;
	КонецЕсли;
	//крохин конец 29.01.2013
	Если РС.Пустая() Тогда
		Возврат "";
	Иначе
		Если РС.Банк.Пустая() Тогда
			Возврат ", Р/С: "+РС.НомерСчета+", в "+СокрЛП(РС.Наименование)+?(НЕ ПустаяСтрока(РС.Банк.Город),", "+СокрЛП(РС.Банк.Город),"");
		Иначе
			Возврат ", Р/С: "+РС.НомерСчета+", в "+СокрЛП(РС.Банк)+?(НЕ ПустаяСтрока(РС.Банк.Город),", "+СокрЛП(РС.Банк.Город),"")+?(ПечататьПолныеРеквизитыБанка,", БИК "+РС.Банк.Код+", К/С "+РС.Банк.КоррСчет,"");		
		КонецЕсли;		
	КонецЕсли;
КонецФункции // РасчСчет()

Функция ПолучитьМакетВыходнойФормы(ИмяМакета)
	ИмяФайлаВнешнегоШаблона = "";
	Если ПустаяСтрока(ИмяФайлаВнешнегоШаблона) Тогда
		Макет 	= ПолучитьМакет(ИмяМакета);
	Иначе
		Макет 	= Новый ТабличныйДокумент;	
		Макет.Прочитать(Константы.КаталогВнешнихОтчетов.Получить()+"PrnForms\"+ИмяФайлаВнешнегоШаблона);
	КонецЕсли;
	
	Возврат  Макет;
КонецФункции //ПолучитьМакетВыходнойФормы(ИмяМакета) 

Функция _глСформироватьШКДока(Док,НомерСтраницы=1,ВсегоСтраниц=0)
	//Если Док = Неопределено ИЛИ Док.Пустая() Тогда Возврат "" КонецЕсли;
	//КодИсх="*"+ИдПоВидуДокумента(Док.Метаданные().Имя)+"*"+Док.Номер+"*"+Прав(""+Год(Док.Дата),2)+"*"+НомерСтраницы+"*"+ВсегоСтраниц+"*";		
	//Возврат Закодировать64(КодИсх);
	
	возврат "";
КонецФункции //СформироватьШКДока


Функция ПолучитьАртикулКонтрагента(Номенклатура,ВыбТипАртикула)
	Если ВыбТипАртикула=Неопределено ИЛИ ВыбТипАртикула.Пустая() Тогда Возврат "" КонецЕсли; 
	
	Выборка = Справочники.АртикулыКонтрагентов.Выбрать(,Номенклатура,Новый Структура("ТипАртикула",ВыбТипАртикула));
	Пока Выборка.Следующий() Цикл
		Если Не ПустаяСтрока(Выборка.Наименование) Тогда
			Возврат СокрЛП(Выборка.Наименование);		
		КонецЕсли;		
	КонецЦикла;
	
	Если НЕ Номенклатура.ЭтоГруппа Тогда
		Возврат ПолучитьАртикулКонтрагента(Номенклатура.Родитель,ВыбТипАртикула);	
	Иначе
		Возврат "";
	КонецЕсли;	
КонецФункции //ПолучитьАртикулКонтрагента(Номенклатура,ТипАртикула) 


Функция ПолучитьСоставТовараНаАнглийском(Номенклатура)
	//формируем основной состав
	СтрСостав = "";
	Для каждого ТекСтр из Номенклатура.СоставНоменклатуры цикл
		
		Если Не ТекСтр.МатериалСостав.Пустая() Тогда
			
			СтрСостав = СтрСостав+" "+ТекСтр.Процент+"% "+текстр.МатериалСостав.АнглоязычноеНаименование+",";
		КонецЕсли;
		
	КонецЦикла;
	СтрСостав = СокрЛП(СтрСостав);
	// обрезаем последнюю запятую.
	СтрСостав = Лев(стрСостав,СтрДлина(СтрСостав)-1); 
	Возврат СтрСостав;	
	
КонецФункции


Функция ПолучитьТаблицуНакладнойУслуги(ДокОбъект,Режим="Накладная",СФ=Неопределено)
	
	Кратко = ложь;    НеУчитыватьРекламации = ложь;

	ТН=Новый ТаблицаЗначений;
	фСводнаяСФ = ложь;  ПечататьШтрихКоды = ложь; ВидШтрихКода="ШтрихКод";

	ТН.Колонки.Добавить("Номенклатура");	
	ТН.Колонки.Добавить("Количество");
	ТН.Колонки.Добавить("НДС");
	ТН.Колонки.Добавить("Сумма");
	ТН.Колонки.Добавить("Всего");	
	
	Если Режим="СФ" И фСводнаяСФ Тогда		
		Если СФ=Неопределено ИЛИ СФ.Пустая() Тогда
			//Предупреждение("Невоможно определить сводную СФ для печати !");		
		Иначе
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ Накладная ИЗ Документ.СчетФактура.Накладные ГДЕ Ссылка=&СФ";
			Запрос.УстановитьПараметр("СФ",СФ);			
			СписокНакладных=Запрос.Выполнить().Выгрузить();
			
			Запрос=Новый Запрос;
			Запрос.Текст="
			|ВЫБРАТЬ
			|	Номенклатура,
			|	СУММА(Количество) КАК Количество,
			|	СУММА(НДС) КАК НДС,
			|	СУММА(Всего) КАК Всего,
			|	Номенклатура.Родитель КАК Модель
			|ИЗ
			|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
			|ГДЕ
			|	РасходнаяНакладнаяТовары.Ссылка.Ссылка В(&СписокНакладных)
			|СГРУППИРОВАТЬ ПО Номенклатура";		
			
			Запрос.УстановитьПараметр("СписокНакладных",СписокНакладных);
			ИсходнаяТЧ=Запрос.Выполнить().Выгрузить();	
			//крохин начало 15.02.2012
			//сделаем таблицей значений, без ограничения типа
			ИсходнаяТЧ = Новый ТаблицаЗначений;
			ИсходнаяТЧ.Колонки.Добавить("Номенклатура");	
			ИсходнаяТЧ.Колонки.Добавить("Количество");
			ИсходнаяТЧ.Колонки.Добавить("НДС");
			ИсходнаяТЧ.Колонки.Добавить("Сумма");
			ИсходнаяТЧ.Колонки.Добавить("Всего");
			ИсходнаяТЧ.Колонки.Добавить("Цена");
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Если  Выборка.Количество = 0 Тогда Продолжить КонецЕсли;
				СтрокаИсходнойТЧ = ИсходнаяТЧ.Добавить();
				СтрокаИсходнойТЧ.Номенклатура = Выборка.Номенклатура;
				СтрокаИсходнойТЧ.Количество = Выборка.Количество;
				СтрокаИсходнойТЧ.НДС = Выборка.НДС;
				СтрокаИсходнойТЧ.Сумма = Выборка.Всего - Выборка.НДС;
				СтрокаИсходнойТЧ.Всего = Выборка.Всего;
				СтрокаИсходнойТЧ.Цена = Выборка.Всего/Выборка.Количество;
			КонецЦикла;
			//крохин конец 15.02.2012
			
		КонецЕсли; 
	Иначе
		//крохин начало 29.11.2011
		//ИсходнаяТЧ=ДокОбъект.Товары;
		ИсходнаяТЧ=ДокОбъект.Товары.Выгрузить();
		//крохин конец 29.11.2011
		//крохин начало 15.02.2012
		//сделаем таблицей значений, без ограничения типа
		ИсходнаяТЧ = Новый ТаблицаЗначений;
		ИсходнаяТЧ.Колонки.Добавить("Номенклатура");	
		ИсходнаяТЧ.Колонки.Добавить("Количество");
		ИсходнаяТЧ.Колонки.Добавить("НДС");
		ИсходнаяТЧ.Колонки.Добавить("Сумма");
		ИсходнаяТЧ.Колонки.Добавить("Всего");
		ИсходнаяТЧ.Колонки.Добавить("Цена");
		
		Для Каждого СтрокаТЧ Из ДокОбъект.Товары Цикл
			Если  СтрокаТЧ.Количество = 0 Тогда Продолжить КонецЕсли;
			//крохин начало 29.01.2019
			//для иностранцев услуги печатаем в УПД, но не печатаем в ТТН и Упаковочном листе
			Если Режим = "ТТН" ИЛИ Режим = "УпаковочныйЛист" ИЛИ режим = "CMR" Тогда
				Если СтрокаТЧ.Номенклатура.Родитель.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Услуга Тогда
					Продолжить;	
				КонецЕсли;
			КонецЕсли;
			//крохин конец 29.01.2019
			СтрокаИсходнойТЧ = ИсходнаяТЧ.Добавить();
			СтрокаИсходнойТЧ.Номенклатура = СтрокаТЧ.Номенклатура;
			СтрокаИсходнойТЧ.Количество = СтрокаТЧ.Количество;
			СтрокаИсходнойТЧ.НДС = СтрокаТЧ.НДС;
			СтрокаИсходнойТЧ.Сумма = СтрокаТЧ.Сумма;
			СтрокаИсходнойТЧ.Всего = СтрокаТЧ.Всего;
			СтрокаИсходнойТЧ.Цена = СтрокаТЧ.Всего/СтрокаТЧ.Количество;
		КонецЦикла;
		//крохин конец 15.02.2012
		
	КонецЕсли;
	//крохин начало 21.11.2011
	//рекламации
	
	
	//22,11,16+++
	// переделываем на регистр, учитывать в торг-12, вычерки.
	Если НЕ НеУчитыватьРекламации Тогда
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	РекламационнаяНакладнаяТовары.Номенклатура,
		|	СУММА(РекламационнаяНакладнаяТовары.Количество) КАК Количество,
		|	СУММА(РекламационнаяНакладнаяТовары.НДС) КАК НДС,
		|	СУММА(РекламационнаяНакладнаяТовары.Всего) КАК Всего,
		|	РекламационнаяНакладнаяТовары.Ссылка
		|ИЗ
		|	Документ.РекламационнаяНакладная.Товары КАК РекламационнаяНакладнаяТовары
		|ГДЕ
		|	РекламационнаяНакладнаяТовары.Ссылка.ДокОснование.Ссылка В(&СписокНакладных)
		|	И РекламационнаяНакладнаяТовары.Ссылка.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	РекламационнаяНакладнаяТовары.Номенклатура,
		|	РекламационнаяНакладнаяТовары.Ссылка";		
		Если  СписокНакладных = Неопределено Тогда
			СписокНакладных = ДокОбъект.Ссылка;
		КонецЕсли;
		Запрос.УстановитьПараметр("СписокНакладных",СписокНакладных);
		
		//нечаева 22,09,16++
		СпУч = Новый Массив;
		СпУч.Добавить(перечисления.УчитыватьВРНК.ПустаяСсылка());
		СпУч.Добавить(перечисления.УчитыватьВРНК.УчитыватьВТорг12);
		Запрос.УстановитьПараметр("СписокУч",СпУч);
		//нечаева 22,09,16---
		
		РекламационнаяТЧ=Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаТЧ Из РекламационнаяТЧ Цикл
			
			//нечаева 22,11,16 +++
			// получаем значение "учитывать в торг-12"
			ЗначениеДокументаУчитыватьВРНК =  ПолучитьДанныеРегистраУчитыватьВычерки(СтрокаТЧ.ссылка);
			Если ЗначениеДокументаУчитыватьВРНК = перечисления.УчитыватьВРНК.КСФ 
				//нечаева 28,05,19 +++
				или  ЗначениеДокументаУчитыватьВРНК = Перечисления.УчитыватьВРНК.ПустаяСсылка()	
				//нечаева 28,05,19 ---
				Тогда
				продолжить;
			КонецЕсли;	
			// нечаева 22,11,16 ---	
			СтрокаТН=ИсходнаяТЧ.Добавить();
			СтрокаТН.Номенклатура = СтрокаТЧ.Номенклатура;
			СтрокаТН.НДС = -СтрокаТЧ.НДС;
			СтрокаТН.Всего = -СтрокаТЧ.Всего;
			СтрокаТН.Количество = -СтрокаТЧ.Количество;
		КонецЦикла;
		ИсходнаяТЧ.Свернуть("Номенклатура","НДС,Количество,Всего");
		// нечаева 20,11,13  ++++++++++
		
		// рекламации по ценам
		// нечаева 05,08,14 +++++++++++
		
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	КорректировкаЦенВНакладнойТовары.Номенклатура,
		|	СУММА(КорректировкаЦенВНакладнойТовары.Количество) КАК Количество,
		|	СУММА(КорректировкаЦенВНакладнойТовары.НДС) КАК НДС,
		|	СУММА(КорректировкаЦенВНакладнойТовары.Всего) КАК Всего,
		|	КорректировкаЦенВНакладнойТовары.Ссылка
		|ИЗ
		|	Документ.КорректировкаЦенВНакладной.Товары КАК КорректировкаЦенВНакладнойТовары
		|ГДЕ
		|	КорректировкаЦенВНакладнойТовары.Ссылка.ДокОснование.Ссылка В(&СписокНакладных)
		|	И КорректировкаЦенВНакладнойТовары.Ссылка.Проведен
		|	И КорректировкаЦенВНакладнойТовары.Ссылка.ВидРекламации = &Вычерк
		|
		|СГРУППИРОВАТЬ ПО
		|	КорректировкаЦенВНакладнойТовары.Номенклатура,
		|	КорректировкаЦенВНакладнойТовары.Ссылка";	
		
		//нечаева 22,09,16++
		СпУч = Новый Массив;
		СпУч.Добавить(перечисления.УчитыватьВРНК.ПустаяСсылка());
		СпУч.Добавить(перечисления.УчитыватьВРНК.УчитыватьВТорг12);
		Запрос.УстановитьПараметр("СписокУч",СпУч);
		//нечаева 22,09,16---
		
		
		Если  СписокНакладных = Неопределено Тогда
			СписокНакладных = ДокОбъект.Ссылка;
		КонецЕсли;
		Запрос.УстановитьПараметр("СписокНакладных",СписокНакладных);
		Запрос.УстановитьПараметр("Вычерк",перечисления.ВидыРекламаций.Вычерк);
		
		РекламационнаяТЧ=Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаТЧ Из РекламационнаяТЧ Цикл
			//нечаева 22,11,16 +++
			// получаем значение "учитывать в торг-12"
			ЗначениеДокументаУчитыватьВРНК =  ПолучитьДанныеРегистраУчитыватьВычерки(СтрокаТЧ.ссылка);
			Если ЗначениеДокументаУчитыватьВРНК = перечисления.УчитыватьВРНК.КСФ 
				//нечаева 28,05,19 +++
				или  ЗначениеДокументаУчитыватьВРНК = Перечисления.УчитыватьВРНК.ПустаяСсылка()	
				//нечаева 28,05,19 ---
				
				Тогда
				продолжить;
			КонецЕсли;	
			// нечаева 22,11,16 ---	
			
			СтрокаТН=ИсходнаяТЧ.Добавить();
			СтрокаТН.Номенклатура = СтрокаТЧ.Номенклатура;
			СтрокаТН.НДС = -СтрокаТЧ.НДС;
			СтрокаТН.Всего = -СтрокаТЧ.Всего;
			СтрокаТН.Количество =0;
		КонецЦикла;
		ИсходнаяТЧ.Свернуть("Номенклатура","НДС,Количество,Всего");
		// нечаева 05,08,14 -------------
		
		
		
	Иначе
		
			// нечаева 20,11,13 ---- 
	КонецЕсли;
	
	//крохин конец 21.11.2011
	
	
	
	Для Каждого СтрокаТЧ Из ИсходнаяТЧ Цикл
		Если СтрокаТЧ.Количество=0 Тогда Продолжить КонецЕсли; 
		
		СтрокаТН=ТН.Добавить();		
		
		СтрокаТН.Количество	=СтрокаТЧ.Количество;		
		СтрокаТН.Всего		=СтрокаТЧ.Всего;
		СтрокаТН.НДС		=СтрокаТЧ.НДС;		
		СтрокаТН.Сумма		=СтрокаТЧ.Всего-СтрокаТЧ.НДС;
		
		Номенклатура		=СтрокаТЧ.Номенклатура;
		Модель				=Номенклатура.Родитель;
		//крохин начало 21.10.2019
		//упаковочный лист сворачивается позже
		Если Режим <> "УпаковочныйЛист" Тогда
			СтрокаТН.Номенклатура=?(Кратко=0,СтрокаТЧ.Номенклатура,Модель);
		Иначе
			СтрокаТН.Номенклатура = СтрокаТЧ.Номенклатура; 
		КонецЕсли; 
		//крохин конец 21.10.2019
		
	КонецЦикла;
	
	//крохин начало 30.01.2019
	//для Упаковочного листа нужны дополнительные реквизиты
	//Если Кратко Тогда
	//	ТН.Свернуть("Номенклатура","Количество,Сумма,НДС,Всего");
	//КонецЕсли; 
	
	//крохин начало 12.11.2020
	//для упаковочного листа вес брутто можно указывать в РНК
	ЗапВРег=РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();	
	ЗапВРег.Отбор.ИмяРеквизита.значение="ВесБруттоФакт";
	ЗапВРег.Отбор.Документ.значение=ДокОбъект.Ссылка;
	ЗапВРег.Отбор.ИмяРеквизита.использование=Истина;
	ЗапВРег.Отбор.Документ.использование=Истина;
	
	ЗапВРег.Прочитать();
	ВесБруттоФакт = 0;
	для каждого СтрЗР из ЗапВРег цикл
		ВесБруттоФакт =СтрЗР.ЗначениеРеквизита;
	КонецЦикла;
	
	КоэффициентВеса = 1;
	Если ВесБруттоФакт <> 0 Тогда
		ВесБруттоРасчетный =  0;
		Для Каждого СтрокаТН Из ДокОбъект.Товары Цикл
			Если СтрокаТН.Номенклатура.Родитель.ШтукВКоробке <> 0 Тогда
				Если СтрокаТН.Номенклатура.ВесБруттоКоробки <> 0 Тогда
					ВесБруттоРасчетный =	ВесБруттоРасчетный + Окр(СтрокаТН.Номенклатура.ВесБруттоКоробки*СтрокаТН.Количество/СтрокаТН.Номенклатура.Родитель.ШтукВКоробке,3);
				Иначе
					ВесБруттоРасчетный =	ВесБруттоРасчетный + Окр(СтрокаТН.Номенклатура.Родитель.ВесБруттоКоробки*СтрокаТН.Количество/СтрокаТН.Номенклатура.Родитель.ШтукВКоробке,3);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ВесБруттоРасчетный <> 0 Тогда
			КоэффициентВеса = Окр(ВесБруттоФакт/ВесБруттоРасчетный,3);
		КонецЕсли;
	КонецЕсли;
	
	//крохин конец 12.11.2020
	Кратко = ложь;    НеУчитыватьРекламации = ложь;
	Если Режим <> "УпаковочныйЛист" И режим <> "CMR" Тогда
		Если Кратко Тогда
			ТН.Свернуть("Номенклатура","Количество,Сумма,НДС,Всего");
		КонецЕсли; 
	Иначе
		ТН.колонки.Добавить("Нетто");
		ТН.Колонки.Добавить("Брутто");
		ТН.Колонки.ДОбавить("Объем");
		ТН.колонки.Добавить("ТНВЭД");
		Для Каждого СтрокаТН Из ТН Цикл
			
			//крохин начало 02.12.2020	
			//расчет такой же, как в упаковочном листе, с округлением
			////Кухарь 18.03.19 начало 
			////СтрокаТН.Брутто = ?(СтрокаТН.Номенклатура.Родитель.ШтукВКоробке = 0,0,СтрокаТН.Номенклатура.Родитель.ВесБруттоКоробки*СтрокаТН.Количество/СтрокаТН.Номенклатура.Родитель.ШтукВКоробке);
			//СтрокаТН.Брутто = ?(СтрокаТН.Номенклатура.Родитель.ШтукВКоробке = 0,0,СтрокаТН.Номенклатура.ВесБруттоКоробки*СтрокаТН.Количество/СтрокаТН.Номенклатура.Родитель.ШтукВКоробке);
			//если СтрокаТН.Брутто=0 тогда
			//	СтрокаТН.Брутто = ?(СтрокаТН.Номенклатура.Родитель.ШтукВКоробке = 0,0,СтрокаТН.Номенклатура.Родитель.ВесБруттоКоробки*СтрокаТН.Количество/СтрокаТН.Номенклатура.Родитель.ШтукВКоробке);
			//КонецЕсли;
			////Кухарь 18.03.19 конец
			
			Если СтрокаТН.Номенклатура.Родитель.ШтукВКоробке <> 0 Тогда
				Если СтрокаТН.Номенклатура.ВесБруттоКоробки <> 0 Тогда
					СтрокаТН.Брутто =	Окр(СтрокаТН.Номенклатура.ВесБруттоКоробки*СтрокаТН.Количество/СтрокаТН.Номенклатура.Родитель.ШтукВКоробке,3);
				Иначе
					СтрокаТН.Брутто =	Окр(СтрокаТН.Номенклатура.Родитель.ВесБруттоКоробки*СтрокаТН.Количество/СтрокаТН.Номенклатура.Родитель.ШтукВКоробке,3);
				КонецЕсли;
				
			Иначе
				СтрокаТН.Брутто = 0; 
			КонецЕсли;
			//крохин конец 02.12.2020
			
			
			//крохин начало 02.11.2020
			//крохин начало 12.11.2020
			//СтрокаТН.Брутто = СтрокаТН.Брутто*КоэффициентВеса;
			СтрокаТН.Брутто = Окр(КоэффициентВеса*СтрокаТН.Брутто,3);
			//крохин конец 12.11.2020
			//крохин конец 02.11.2020
			
			
			
			//крохин начало 23.08.2019
			//из-за округления при выводе не совпадает общая сумма и построчная
			//СтрокаТН.Нетто = 0.9*СтрокаТН.Брутто;
			//СтрокаТН.Объем = ?(СтрокаТН.Номенклатура.Родитель.ШтукВКоробке = 0,0,СтрокаТН.Номенклатура.Родитель.ОбъемКоробки*СтрокаТН.Количество/СтрокаТН.Номенклатура.Родитель.ШтукВКоробке);
			СтрокаТН.Нетто = Окр(0.9*СтрокаТН.Брутто,3);
			СтрокаТН.Объем = Окр(?(СтрокаТН.Номенклатура.Родитель.ШтукВКоробке = 0,0,СтрокаТН.Номенклатура.Родитель.ОбъемКоробки*СтрокаТН.Количество/СтрокаТН.Номенклатура.Родитель.ШтукВКоробке),3);
			//крохин конец 23.08.2019
			
			СтрокаТН.ТНВЭД = СтрокаТН.Номенклатура.Родитель.ТНВЭД;
			//крохин начало 21.10.2019
			//упаковочный лист сворачивается позже
			Если Кратко Тогда
				СтрокаТН.Номенклатура=СтрокаТН.номенклатура.Родитель;
			КонецЕсли; 
			//крохин конец 21.10.2019
			
			
		КонецЦикла;
		
		Если Кратко Тогда
			ТН.Свернуть("Номенклатура,ТНВЭД","Количество,Сумма,НДС,Всего,Нетто,Брутто,Объем");
		КонецЕсли; 
		ТН.Сортировать("ТНВЭД,Номенклатура");
	КонецЕсли;
	//крохин конец 30.01.2019
	
	
	
	
	ТН.Колонки.Добавить("Цена");
	ТН.Колонки.Добавить("СтавкаНДС");
	ТН.Колонки.Добавить("НоменклатураПредставление");
	ТН.Колонки.Добавить("Единица");	
	ТН.Колонки.Добавить("ОКЕИ");	
	ТН.Колонки.Добавить("Страна");
	//крохин начало 23.01.2012
	//новая форма
	ТН.Колонки.Добавить("СтранаКод");
	//крохин конец 23.01.2012
	ТН.Колонки.Добавить("НомерГТД");
	ТН.Колонки.Добавить("ШтрихКод");
	ТН.Колонки.Добавить("КодКонтрагента");
	ТН.Колонки.Добавить("КоличествоКоробок");
	ТН.Колонки.Добавить("ШтукВКоробке");
	//Лобан 260713 +++
	//новая форма е5
	ТН.Колонки.Добавить("ШКТовара");
	//Лобан 260713 +++
	ТН.Колонки.Добавить("Состав");	
	
	//крохин начало 01.03.2019
	//для развернутых документов надо рассчитывать ГТД по моделям
	Если НЕ Кратко Тогда
		ТНГТД = ТН.Скопировать();
		
		Для Каждого СтрокаТНГТД ИЗ ТНГТД Цикл
			СтрокаТНГТД.Номенклатура =	СтрокаТНГТД.Номенклатура.Родитель;
		КонецЦикла;
		ТНГТД.Свернуть("Номенклатура");
		ТНГТД.Колонки.Добавить("ГТД");
		Для Каждого СтрокаТНГТД ИЗ ТНГТД Цикл
			СтрокаТНГТД.ГТД = "";  //	ПолучитьГрупповойПериодическийРеквизит(СтрокаТНГТД.Номенклатура,"НомерГТД",ДокОбъект.Дата);
		КонецЦикла;
	КонецЕсли;	
	//крохин конец 01.03.2019
	
	Для Каждого СтрокаТН Из ТН Цикл
		Номенклатура=СтрокаТН.Номенклатура;
		Модель		=?(Кратко,СтрокаТН.Номенклатура,СтрокаТН.Номенклатура.Родитель);
		
		СтрокаТН.Цена		=?(СтрокаТН.Количество=0,0,СтрокаТН.Сумма/СтрокаТН.Количество);
		Если СтрокаТН.Сумма=0 Тогда
			СтрокаТН.СтавкаНДС=100*ПроцентНДСпоСтавке(ПолучитьРеквизитРодителя(СтрокаТН.Номенклатура,"СтавкаНДС"));
		Иначе			
			СтрокаТН.СтавкаНДС	=Окр(100*(СтрокаТН.НДС/СтрокаТН.Сумма),0,1);
		КонецЕсли;			
		
		СтрокаТН.Единица	="шт.";			
		СтрокаТН.ОКЕИ		="796";
		//Кухарь 28.11.16 начало
		//крохин начало 16.12.2016
		//пока отменяем
		
		//крохин начало 05.12.2019
		//для CMR ГТД не нужен, для ускорения формирования уберем
		//ГТД=ПолучитьГрупповойПериодическийРеквизит(Модель,"НомерГТД",ДокОбъект.Дата);
		
		
		// тут ошибка в задании возникает  временно
		ГТД = Неопределено;
				
		//Если Режим <> "CMR" Тогда
		//	//крохин начало 01.03.2019
		//	//для развернутых документов надо рассчитывать ГТД по моделям
		//	//ГТД=ПолучитьГрупповойПериодическийРеквизит(Модель,"НомерГТД",ДокОбъект.Дата);					
		//	Если Кратко Тогда
		//		ГТД=ПолучитьГрупповойПериодическийРеквизит(Модель,"НомерГТД",ДокОбъект.Дата);
		//	Иначе
		//		НайденнаяСтрокаГТД = ТНГТД.Найти(Модель, "Номенклатура");
		//		Если НайденнаяСтрокаГТД = Неопределено Тогда
		//			ГТД = Неопределено;
		//		Иначе
		//			ГТД = НайденнаяСтрокаГТД.ГТД;
		//		КонецЕсли;			
		//	КонецЕсли;
		//	//крохин конец 01.03.2019					
		//Иначе
		//	ГТД = Неопределено;
		//КонецЕсли;
		
		//крохин конец 05.12.2019
		Страна	="Россия";
		НомерГТД="--------";
		//крохин начало 23.01.2012
		//новая форма
		//Кухарь 23.03.18 начало
		//для РФ теперь будут чёрточки
		//СтранаКод = "643";
		СтранаКод = "-----";		
		//Кухарь 23.03.18 конец	
		
		//крохин конец 23.01.2012
		
		Если ГТД<>Неопределено И Врег(""+ГТД.СтранаПроисхождения)<>"РОССИЯ" И НЕ ПустаяСтрока(""+ГТД.СтранаПроисхождения) Тогда
			Страна		=""+ГТД.СтранаПроисхождения;
			НомерГТД	=СокрЛП(""+ГТД.Наименование);
			СтранаКод = ГТД.СтранаПроисхождения.Код;
		КонецЕсли;
		
		Если Страна<>"Россия" И СтрДлина(НомерГТД)<25 Тогда			
			Если СтрДлина(НомерГТД)<23 Тогда
				//Сообщить("Кривой ГТД !!! Товар: """+СтрокаТН.Номенклатура+""", ГТД: """+НомерГТД+""" !");		
			Иначе
				//Сообщить("Отсутствует 4-ый сегмент ГТД !!! Товар: """+СтрокаТН.Номенклатура+""", ГТД: """+НомерГТД+""" !");
				
				НомерГТД=НомерГТД+"/3";
			КонецЕсли; 					
		КонецЕсли;
		Если Страна="Россия" Тогда
			Страна	="--------";
		КонецЕсли;
		СтрокаТН.Страна		= Страна;
		СтрокаТН.НомерГТД	= НомерГТД;
		СтрокаТН.СтранаКод = СтранаКод;
		//
		 		
		ИндивидуальнаяНастройкаПодКонтрагента = неопределено;
		СтрокаТН.Состав = ПолучитьСоставТовараНаАнглийском(Модель);
		
		
		//Лобан +++ 260713
		//Новая форма е5
		СтрокаТН.ШКТовара=ПолучитьШтрихКодТовара(СтрокаТН.Номенклатура);
		//Лобан --- 260713
		типартикула = неопределено;
		Если ПечататьШтрихКоды Тогда
			Если ВидШтрихКода="Внутренний" Тогда
				СтрокаТН.ШтрихКод=?(Кратко,СокрЛП(СтрокаТН.Номенклатура.Код77),Прав(ПолучитьШтрихКодТовара(СтрокаТН.Номенклатура),6));			
			ИначеЕсли ВидШтрихКода="Контрагент" Тогда
				//Нечаева 29,10,2014 +++
				Если ДокОбъект.Контрагент.ИспользоватьНоменклатурнуюМатрицу Тогда
					СтрокаТН.ШтрихКод=ПолучитьАртикулКонтрагентаПоМатрице(ДокОбъект,СтрокаТН.Номенклатура);				
				Иначе
					СтрокаТН.ШтрихКод=ПолучитьАртикулКонтрагента(СтрокаТН.Номенклатура,ТипАртикула);				
				КонецЕсли;	
				//Нечаева 29,10,2014 ---
			ИначеЕсли ВидШтрихКода="ШтрихКод" Тогда
				СтрокаТН.ШтрихКод=ПолучитьШтрихКодТовара(СтрокаТН.Номенклатура);
			КонецЕсли;			
		КонецЕсли;				
		//Лобан +++ 090813
		//Печать кратности по ленте из матрицы 
		//Кухарь 27.07.16 начало
		//Теперь и для ашана
		//Если ДокОбъект.Контрагент.Родитель.Код = "SSR-4123" тогда
		Если ДокОбъект.Контрагент.Родитель.Код = "SSR-4123" или ИндивидуальнаяНастройкаПодКонтрагента=Справочники.НастройкиПечатиПодКонтрагента.Ашан тогда
			//Кухарь 27.07.16 конец
			
			Запрос.Текст = "ВЫБРАТЬ
			|	МатрицаТовары.Номенклатура,
			|	МатрицаТовары.Кратность,
			|	МатрицаТовары.КратностьКоробки
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|ГДЕ
			|	МатрицаТовары.Ссылка.Проведен
			|	И МатрицаТовары.Ссылка.Дата <= &Дата
			//|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата
			//нечаева 28,09,16 ++
			|	И КонецПериода(МатрицаТовары.Ссылка.ДатаОкончания,день) >= КонецПериода(&Дата,День)
			//нечаева 28,09,16 --
			|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент";
			
			//нечаева 18,07,17+++
			Попытка
				Если ДокОбъект.ПостояннаяАкция Тогда
					Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
					//крохин начало 28.07.2017
					//постоянные акции только под галку
				Иначе
					Запрос.Текст = Запрос.Текст +" И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция";
					//крохин конец 28.07.2017
				КонецЕсли;
			Исключение
				
			КонецПопытки;
			//Запрос.Текст = Запрос.Текст +"
			//|УПОРЯДОЧИТЬ ПО
			//|	Дата УБЫВ";
			//нечаева 18,07,17---
			
			
			Запрос.УстановитьПараметр("Контрагент",ДокОбъект.Контрагент);
			Запрос.УстановитьПараметр("Дата",ДокОбъект.Дата);
			ТЗ = Запрос.Выполнить().Выгрузить();
			
			Отбор = Новый Структура();
			Отбор.Вставить("Номенклатура",СтрокаТН.номенклатура.Ссылка);
			НайденныеСтроки = ТЗ.НайтиСтроки(Отбор);
			для Каждого Строчка из НайденныеСтроки Цикл 
				ШтВКоробке = Строчка.КратностьКоробки;
				ШтВБлочке   = Строчка.Кратность
			КонецЦикла;
			//Кухарь 27.07.16 начало
			//Теперь и для ашана
			//СтрокаТН.ШтукВКоробке=ШтВБлочке;
			Если ИндивидуальнаяНастройкаПодКонтрагента=Справочники.НастройкиПечатиПодКонтрагента.Ашан тогда
				СтрокаТН.ШтукВКоробке=ШтВКоробке;		
			иначе
				СтрокаТН.ШтукВКоробке=ШтВБлочке;
			КонецЕсли;
			//Кухарь 27.07.16 конец
			
			//крохин начало 18.08.2016
			//в отсутствие матрицы сохраняем пустой документ
			Если СтрокаТН.ШтукВКоробке = Неопределено Тогда
				//Сообщить("По номенклатуре "+СтрокаТН.Номенклатура + " не указана кратность! Документы оформлены некорректно!");			
				ТН.Очистить();
				Возврат ТН;
			КонецЕсли;
			//крохин конец 18.08.2016
			
			
			Если СтрокаТН.ШтукВКоробке<>0 Тогда
				СтрокаТН.КоличествоКоробок=СтрокаТН.Количество/СтрокаТН.ШтукВКоробке; 			
			КонецЕсли;
		иначе
			СтрокаТН.ШтукВКоробке=Модель.ШтукВКоробке;
			Если Модель.ШтукВКоробке<>0 Тогда
				СтрокаТН.КоличествоКоробок=СтрокаТН.Количество/Модель.ШтукВКоробке; 			
			КонецЕсли;
		КонецЕсли;
		//Лобан --- 090813
		
		//Лобан 120314 +++
		//Печать наименование номенклатуры для контрагента из матрицы
		//СтрокаТН.НоменклатураПредставление=СокрЛП(Модель.ТипТовара)+" "+СокрЛП(Модель.Родитель.Брэнд)+" "+СокрЛП(Модель.КодПроизводителя)+" "+Номенклатура.Наименование;
		//крохин начало 05.02.2019
		Если ДокОбъект.Контрагент.ИспользоватьНоменклатурнуюМатрицу Тогда
			//крохин конец 05.02.2019	
			Запрос = Новый запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	МатрицаТовары.Номенклатура,
			|	МатрицаТовары.НаименованиеКонтрагента КАК НаименованиеКонтрагента
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|ГДЕ
			|	МатрицаТовары.Ссылка.Проведен
			|	И МатрицаТовары.Ссылка.Дата <= &Дата
			|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата
			|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент";
			
			//нечаева 18,07,17+++
			Попытка
				Если ДокОбъект.ПостояннаяАкция Тогда
					Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
					//крохин начало 28.07.2017
					//постоянные акции только под галку
				Иначе
					Запрос.Текст = Запрос.Текст +" И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция";
					//крохин конец 28.07.2017
				КонецЕсли;
			Исключение
				
			КонецПопытки;
			//нечаева 18,07,17---
			
			Запрос.УстановитьПараметр("Контрагент",ДокОбъект.Контрагент);
			Запрос.УстановитьПараметр("Дата",ДокОбъект.Дата);
			ТЗ = Запрос.Выполнить().Выгрузить();	
			Отбор = Новый Структура();
			Отбор.Вставить("Номенклатура",СтрокаТН.номенклатура.Ссылка);
			НайденныеСтроки = ТЗ.НайтиСтроки(Отбор);
			для Каждого Строчка из НайденныеСтроки Цикл 
				НаименованиеКонтрагента = Строчка.НаименованиеКонтрагента;
			КонецЦикла;
			//крохин начало 05.02.2019
		Иначе
			НаименованиеКонтрагента = "";
		КонецЕсли;
		//крохин конец 05.02.2019
		если Не ПустаяСтрока(НаименованиеКонтрагента) тогда
			СтрокаТН.НоменклатураПредставление = НаименованиеКонтрагента 
		иначе		
			СтрокаТН.НоменклатураПредставление=СокрЛП(Модель.ТипТовара)+" "+СокрЛП(Модель.Родитель.Брэнд)+" "+СокрЛП(Модель.КодПроизводителя)+" "+Номенклатура.Наименование;		
		КонецЕсли;	
		//Лобан 120314 ---
	КонецЦикла; 
	
	//ДЛЯ КИТАЙЦЕВ ПИШЕМ "Русское наименование" в УПД 
	Если Режим = "СФ" Тогда
		Если Модель.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Услуга Тогда
			СтрокаТН.НоменклатураПредставление = Модель.РусскоеНаименование;	
		КонецЕсли;
	КонецЕсли;
	
	
	
	//нечаева погрешность окр, для клиента сладкая жизнь, копейка москва  23,09,15++   цена по одному товару разная в СФ
	попытка
		Если  ДокОбъект.Ссылка.контрагент = справочники.Контрагенты.НайтиПоКоду("SSP-3286")
			или 
			ДокОбъект.Ссылка.контрагент = справочники.Контрагенты.НайтиПоКоду("SSR-1151")
			Тогда
			
			// округлим цену до 3 знака
			Для Каждого ТекСтр из ТН Цикл
				
				ТекСтр.Цена = Окр (ТекСтр.Цена,3);
				
			КонецЦикла;
			
		КонецЕсли;
	исключение
		
	конецПопытки;

	
	
		
	
			
	Возврат ТН;
//	
КонецФункции // ПолучитьТаблицуНакладной()


Функция ПолучитьАртикулКонтрагентаПоМатрице(ДокОБъект,Номенклатура)
	//кухарь 05.03.15 начало
	//для свёрнутых наборов форм
	Кратко = ложь;    НеУчитыватьРекламации = ложь;
	ТипАртикула = неопределено;  ПечататьШтрихКоды = ложь;
	если Номенклатура.этогруппа=истина тогда
		АртикулГруппа=ПолучитьАртикулКонтрагентаПоМатрицеДляСвернутых(ДокОБъект,Номенклатура);
		Возврат АртикулГруппа;
	КонецЕсли;
	//кухарь 05.03.15 конец	
	Контрагент = ДокОбъект.контрагент;
	//нечаева 26,04,18++
	Договор = ДокОбъект.Договор;
	
	Запрос=Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(МатрицаТовары.АртикулКонтрагента КАК СТРОКА(20)) КАК артикул,
	|	МатрицаТовары.Ссылка,
	|	МатрицаТовары.Ссылка.Дата КАК Дата,
	|	МатрицаТовары.Ссылка.ДатаОкончания,
	|	МатрицаТовары.Номенклатура
	|ИЗ
	|	Документ.Матрица.Товары КАК МатрицаТовары
	|ГДЕ
	|	МатрицаТовары.Ссылка.Проведен = ИСТИНА
	|	И (НЕ (ВЫРАЗИТЬ(МатрицаТовары.АртикулКонтрагента КАК СТРОКА(20))) = """""""")
	|	И МатрицаТовары.Ссылка.Контрагент = &ТекКонтрагент
	|	И МатрицаТовары.Ссылка.Договор = &Договор
	|	И МатрицаТовары.Ссылка.ДатаОкончания >= &датаДок2
	|	И МатрицаТовары.Ссылка.Дата <= &датаДок1
	|	И МатрицаТовары.Номенклатура = &ТекНом";
	
	//нечаева 18,07,17+++
	Попытка
		Если ДокОбъект.ПостояннаяАкция Тогда
			Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
			//крохин начало 28.07.2017
			//постоянные акции только под галку
		Иначе
			Запрос.Текст = Запрос.Текст +" И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция";
			//крохин конец 28.07.2017
		КонецЕсли;
	Исключение
		
	КонецПопытки;
	
	Запрос.Текст = Запрос.Текст +"
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	//нечаева 18,07,17---
	
	Запрос.УстановитьПараметр("ТекКонтрагент",контрагент);
	Запрос.УстановитьПараметр("Договор",договор);
	Запрос.УстановитьПараметр("ТекНом",Номенклатура);
	Запрос.УстановитьПараметр("ДатаДок2",НачалоДня(ДокОбъект.дата));
	Запрос.УстановитьПараметр("ДатаДок1",КонецДня(ДокОбъект.дата));
	
	
	Рез=Запрос.Выполнить().Выбрать();	
	
	Пока Рез.Следующий() Цикл
		Если Не ПустаяСтрока(Рез.Артикул) Тогда
			Возврат СокрЛП(Рез.Артикул);		
		КонецЕсли;		
	КонецЦикла;
	
	
	
	// поищем без договора, если нет.
	
	Запрос=Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(МатрицаТовары.АртикулКонтрагента КАК СТРОКА(20)) КАК артикул,
	|	МатрицаТовары.Ссылка,
	|	МатрицаТовары.Ссылка.Дата КАК Дата,
	|	МатрицаТовары.Ссылка.ДатаОкончания,
	|	МатрицаТовары.Номенклатура
	|ИЗ
	|	Документ.Матрица.Товары КАК МатрицаТовары
	|ГДЕ
	|	МатрицаТовары.Ссылка.Проведен = ИСТИНА
	|	И (НЕ (ВЫРАЗИТЬ(МатрицаТовары.АртикулКонтрагента КАК СТРОКА(20))) = """""""")
	|	И МатрицаТовары.Ссылка.Контрагент = &ТекКонтрагент
	//|	И МатрицаТовары.Ссылка.Договор = &Договор
	|	И МатрицаТовары.Ссылка.ДатаОкончания >= &датаДок2
	|	И МатрицаТовары.Ссылка.Дата <= &датаДок1
	|	И МатрицаТовары.Номенклатура = &ТекНом";
	
	//нечаева 18,07,17+++
	Попытка
		Если ДокОбъект.ПостояннаяАкция Тогда
			Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
			//крохин начало 28.07.2017
			//постоянные акции только под галку
		Иначе
			Запрос.Текст = Запрос.Текст +" И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция";
			//крохин конец 28.07.2017
		КонецЕсли;
	Исключение
		
	КонецПопытки;
	
	Запрос.Текст = Запрос.Текст +"
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	//нечаева 18,07,17---
	
	Запрос.УстановитьПараметр("ТекКонтрагент",контрагент);
	Запрос.УстановитьПараметр("Договор",договор);
	Запрос.УстановитьПараметр("ТекНом",Номенклатура);
	Запрос.УстановитьПараметр("ДатаДок2",НачалоДня(ДокОбъект.дата));
	Запрос.УстановитьПараметр("ДатаДок1",КонецДня(ДокОбъект.дата));
	
	
	Рез=Запрос.Выполнить().Выбрать();	
	
	Пока Рез.Следующий() Цикл
		Если Не ПустаяСтрока(Рез.Артикул) Тогда
			Возврат СокрЛП(Рез.Артикул);		
		КонецЕсли;		
	КонецЦикла;
	
	
	
	
	Возврат "";
	
	
КонецФункции //ПолучитьАртикулКонтрагента(Номенклатура,ТипАртикула) 


////нечаева 28,10,2014 ---
////кухарь 05.03.15 начало
////для свёрнутых наборов форм
Функция ПолучитьАртикулКонтрагентаПоМатрицеДляСвернутых(докобъект,Номенклатура)
	
	Кратко = ложь;    НеУчитыватьРекламации = ложь;
	ТипАртикула = неопределено;
	
	Контрагент = ДокОбъект.контрагент;
	Запрос=Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(МатрицаТовары.АртикулКонтрагента КАК СТРОКА(20)) КАК артикул,
	|	МатрицаТовары.Ссылка,
	|	МатрицаТовары.Ссылка.Дата КАК Дата,
	|	МатрицаТовары.Ссылка.ДатаОкончания,
	|	МатрицаТовары.Номенклатура
	|ИЗ
	|	Документ.Матрица.Товары КАК МатрицаТовары
	|ГДЕ
	|	МатрицаТовары.Ссылка.Проведен = ИСТИНА
	|	И (НЕ (ВЫРАЗИТЬ(МатрицаТовары.АртикулКонтрагента КАК СТРОКА(20))) = """""""")
	|	И МатрицаТовары.Ссылка.Контрагент = &ТекКонтрагент
	|	И МатрицаТовары.Ссылка.ДатаОкончания >= &датаДок2
	|	И МатрицаТовары.Ссылка.Дата <= &датаДок1
	|	И МатрицаТовары.Номенклатура В иерархии (&ТекНом)";
	
	//нечаева 18,07,17+++
	Попытка
		Если ДокОбъект.ПостояннаяАкция Тогда
			Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
			//крохин начало 28.07.2017
			//постоянные акции только под галку
		Иначе
			Запрос.Текст = Запрос.Текст +" И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция";
			//крохин конец 28.07.2017
			
		КонецЕсли;
	Исключение
		
	КонецПопытки;
	
	Запрос.Текст = Запрос.Текст +"
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	//нечаева 18,07,17---
	
	Запрос.УстановитьПараметр("ТекКонтрагент",контрагент);
	Запрос.УстановитьПараметр("ТекНом",Номенклатура);
	Запрос.УстановитьПараметр("ДатаДок2",НачалоДня(ДокОбъект.дата));
	Запрос.УстановитьПараметр("ДатаДок1",КонецДня(ДокОбъект.дата));
	
	
	Рез=Запрос.Выполнить().Выбрать();	
	
	Пока Рез.Следующий() Цикл
		Если Не ПустаяСтрока(Рез.Артикул) Тогда
			Возврат СокрЛП(Рез.Артикул);		
		КонецЕсли;		
	КонецЦикла;
//	
	Возврат "";
//	
КонецФункции


Функция ПолучитьТаблицуНакладнойТандерЭкспозиторы(ДокОбъект,Режим="Накладная",СФ=Неопределено,Экспозитор)
	Кратко = ложь;    НеУчитыватьРекламации = ложь;
	ТипАртикула = неопределено;
	ТН=Новый ТаблицаЗначений;
	ПечататьШтрихКоды = ложь; ВидШтрихКода="Внутренний";
	//
	ТН.Колонки.Добавить("Номенклатура");	
	ТН.Колонки.Добавить("Количество");
	ТН.Колонки.Добавить("НДС");
	ТН.Колонки.Добавить("Сумма");
	ТН.Колонки.Добавить("СтавкаНДС");
	ТН.Колонки.Добавить("Всего");
	ТН.Колонки.Добавить("Цена");
	
	ИсходнаяТЧ=ДокОбъект.Товары.Выгрузить();
	ИсходнаяТЧ = Новый ТаблицаЗначений;
	ИсходнаяТЧ.Колонки.Добавить("Номенклатура");	
	ИсходнаяТЧ.Колонки.Добавить("Количество");
	ИсходнаяТЧ.Колонки.Добавить("НДС");
	ИсходнаяТЧ.Колонки.Добавить("Сумма");
	ИсходнаяТЧ.Колонки.Добавить("Всего");
	ИсходнаяТЧ.Колонки.Добавить("Цена");
	//
	//
	//// заменияем на колво экспозиторов. Цену берем из матрицы.
	//
	ОбщКолво = ДокОбъект.товары.Итог("Количество");
	КолвВ1Эксп = Экспозитор.Коплектующие.Итог("Количество");
	ВсегоЭксп  = Окр(ОбщКолво/КолвВ1Эксп);
	
	
	//------------------------------------------------------------------------
	//------------------------------------------------------------------------
	НовСтр = ТН.Добавить();
	НовСТр.Номенклатура = Экспозитор;
	НовСТр.Количество = ВсегоЭксп;
	//ЗаполнитьЦенуНоменклатурыТабЧастиПоМатрице(НовСТр, ДокОбъект) ;
	//ПриИзмененииНоменклатурыТабЧасти(НовСтр, ТекОб);
	
	
	
	//получим цену номенклатуры
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	МатрицаТовары.Номенклатура,
	|	МатрицаТовары.Цена,
	|	МатрицаПунктыДоставки.Ссылка
	|ИЗ
	|	Документ.Матрица.Товары КАК МатрицаТовары
	|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
	|ГДЕ
	|	МатрицаТовары.Ссылка.Дата <= &Дата1
	|	И МатрицаТовары.Ссылка.Проведен
	|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
	|	И МатрицаТовары.Ссылка.Договор = &Договор
	|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
	//	|	И МатрицаТовары.Ссылка.Акция = ИСТИНА
	|	И МатрицаТовары.Номенклатура = &ТекНом
	//	|	И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункДоставки
	|	УПОРЯДОЧИТЬ ПО
	|	МатрицаТовары.Ссылка.Дата УБЫВ
	|АВТОУПОРЯДОЧИВАНИЕ";
	//нечаева 18,07,17---
	Запрос.УстановитьПараметр("ТекНом",Экспозитор);			   
	Запрос.УстановитьПараметр("Дата2",НачалоДня(ДокОбъект.дата));
	Запрос.УстановитьПараметр("Дата1",КонецДня(ДокОбъект.дата));
	Запрос.УстановитьПараметр("Контрагент",ДокОбъект.Контрагент);
	Запрос.УстановитьПараметр("Договор",ДокОбъект.Договор);
	
	Запрос.УстановитьПараметр("ТекПункДоставки",ДокОбъект.пунктДоставки);
	// цена по акции
	ТЗ1 = Запрос.Выполнить().Выгрузить();
	Если ТЗ1.Количество()>0 Тогда
		Цена = ТЗ1[0].Цена;
	Иначе	
		Цена = 0;
	КонецЕсли;	
	//------------------------------------------------------------------------------------------
	
	
	
	НовСтр.Цена = Цена;
	
	
	//Цена = ПолучитьЦенуНоменклатурыТабЧастиПоМатрице(НовСТр, ДокОбъект);
	//РассчитатьСуммуТабЧасти(НовСтр, ТекОб);
	
	НовСТр.Сумма 	= НовСТр.Цена * НовСТр.Количество;
	НовСТр.СтавкаНДС=ПолучитьСтавкуНДС(Экспозитор);
	СтавкаНДС=ПроцентНДСпоСтавке(НовСтр.СтавкаНДС);
	НовСтр.НДС	= НовСтр.Сумма*СтавкаНДС/(1+СтавкаНДС);			
	НовСтр.Всего	= НовСтр.Сумма;
	НовСтр.Сумма  = НовСтр.Всего - НовСтр.НДС;
	//------------------------------------------------------------------------
	//------------------------------------------------------------------------
	
	//нечаева 24,07,2018+++
	Если ДокОбъект.контрагент.НДС_Сверху Тогда
		
		НовСТр.СтавкаНДС=ПолучитьСтавкуНДС(Экспозитор);
		ЦенаБезНДС = Окр(НовСтр.Цена/(1+СтавкаНДС),2);	
		
		НовСТр.Сумма 	= ЦенаБезНДС * НовСТр.Количество;
		
		НовСтр.НДС	= Окр(НовСтр.Сумма*СтавкаНДС,2);			
		НовСтр.Всего	= НовСтр.Сумма+НовСтр.НДС;
		
		//----------------------------------------------
		
	КонецЕсли;
	//нечаева 24,07,18---
	
	
	
	
	ТН.Колонки.Добавить("ШтрихКод");
	//ТН.Колонки.Добавить("Цена");
	//ТН.Колонки.Добавить("СтавкаНДС");
	ТН.Колонки.Добавить("НоменклатураПредставление");
	ТН.Колонки.Добавить("Единица");	
	ТН.Колонки.Добавить("ОКЕИ");	
	ТН.Колонки.Добавить("Страна");
	ТН.Колонки.Добавить("СтранаКод");
	ТН.Колонки.Добавить("НомерГТД");
	ТН.Колонки.Добавить("КодКонтрагента");
	ТН.Колонки.Добавить("КоличествоКоробок");
	ТН.Колонки.Добавить("ШтукВКоробке");
	
	ТН.Колонки.Добавить("ШКТовара");
	
	//крохин начало 01.03.2019
	//для развернутых документов надо рассчитывать ГТД по моделям
	Если НЕ Кратко Тогда
		ТНГТД = ТН.Скопировать();
		
		Для Каждого СтрокаТНГТД ИЗ ТНГТД Цикл
			СтрокаТНГТД.Номенклатура =	СтрокаТНГТД.Номенклатура.Родитель;
		КонецЦикла;
		ТНГТД.Свернуть("Номенклатура");
		ТНГТД.Колонки.Добавить("ГТД");
		Для Каждого СтрокаТНГТД ИЗ ТНГТД Цикл
			СтрокаТНГТД.ГТД =	неопределено ; //ПолучитьГрупповойПериодическийРеквизит(СтрокаТНГТД.Номенклатура,"НомерГТД",ДокОбъект.Дата);
		КонецЦикла;
	КонецЕсли;	
	//крохин конец 01.03.2019
	
	
	Для Каждого СтрокаТН Из ТН Цикл
		Номенклатура=СтрокаТН.Номенклатура;
		Модель		=?(Кратко,СтрокаТН.Номенклатура,СтрокаТН.Номенклатура.Родитель);
		
		СтрокаТН.Цена		=?(СтрокаТН.Количество=0,0,СтрокаТН.Сумма/СтрокаТН.Количество);
		Если СтрокаТН.Сумма=0 Тогда
			СтрокаТН.СтавкаНДС=100*ПроцентНДСпоСтавке(ПолучитьРеквизитРодителя(СтрокаТН.Номенклатура,"СтавкаНДС"));
		Иначе			
			СтрокаТН.СтавкаНДС	=Окр(100*(СтрокаТН.НДС/СтрокаТН.Сумма),0,1);
		КонецЕсли;			
		
		СтрокаТН.Единица	="шт.";			
		СтрокаТН.ОКЕИ		="796";
		
		
		//Кухарь 28.11.16 начало
		//крохин начало 16.12.2016
		//пока отменяем
		//крохин начало 01.03.2019
		//для развернутых документов надо рассчитывать ГТД по моделям
		//ГТД=ПолучитьГрупповойПериодическийРеквизит(Модель,"НомерГТД",ДокОбъект.Дата);					
		Если Кратко Тогда
			ГТД= неопределено; //  ПолучитьГрупповойПериодическийРеквизит(Модель,"НомерГТД",ДокОбъект.Дата);
		Иначе
			НайденнаяСтрокаГТД = ТНГТД.Найти(Модель, "Номенклатура");
			Если НайденнаяСтрокаГТД = Неопределено Тогда
				ГТД = Неопределено;
			Иначе
				ГТД = НайденнаяСтрокаГТД.ГТД;
			КонецЕсли;			
		КонецЕсли;
		//крохин конец 01.03.2019					
		Страна	="Россия";
		НомерГТД="--------";
		//крохин начало 23.01.2012
		//новая форма
		СтранаКод = "643";
		//крохин конец 23.01.2012
		
		Если ГТД<>Неопределено И Врег(""+ГТД.СтранаПроисхождения)<>"РОССИЯ" И НЕ ПустаяСтрока(""+ГТД.СтранаПроисхождения) Тогда
			Страна		=""+ГТД.СтранаПроисхождения;
			НомерГТД	=СокрЛП(""+ГТД.Наименование);
			СтранаКод = ГТД.СтранаПроисхождения.Код;
		КонецЕсли;
		
		Если Страна<>"Россия" И СтрДлина(НомерГТД)<25 Тогда			
			Если СтрДлина(НомерГТД)<23 Тогда
				//Сообщить("Кривой ГТД !!! Товар: """+СтрокаТН.Номенклатура+""", ГТД: """+НомерГТД+""" !");		
			Иначе
				//Сообщить("Отсутствует 4-ый сегмент ГТД !!! Товар: """+СтрокаТН.Номенклатура+""", ГТД: """+НомерГТД+""" !");
				
				НомерГТД=НомерГТД+"/3";
			КонецЕсли; 					
		КонецЕсли;
		Если Страна="Россия" Тогда
			Страна	="--------";
		КонецЕсли;
		СтрокаТН.Страна		= Страна;
		СтрокаТН.НомерГТД	= НомерГТД;
		СтрокаТН.СтранаКод = СтранаКод;
		
		
		//Лобан 120314 +++
		//Печать наименование номенклатуры для контрагента из матрицы
		//СтрокаТН.НоменклатураПредставление=СокрЛП(Модель.ТипТовара)+" "+СокрЛП(Модель.Родитель.Брэнд)+" "+СокрЛП(Модель.КодПроизводителя)+" "+Номенклатура.Наименование;
		Запрос = Новый запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура,
		|	МатрицаТовары.НаименованиеКонтрагента КАК НаименованиеКонтрагента
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	МатрицаТовары.Ссылка.Проведен
		|	И МатрицаТовары.Ссылка.Дата <= &Дата
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент";
		
		//нечаева 18,07,17+++
		Попытка
			Если ДокОбъект.ПостояннаяАкция Тогда
				Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
				//крохин начало 28.07.2017
				//постоянные акции только под галку
			Иначе
				Запрос.Текст = Запрос.Текст +" И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция";
				//крохин конец 28.07.2017
			КонецЕсли;
		Исключение
			
		КонецПопытки;
		//нечаева 18,07,17---
		
		Запрос.УстановитьПараметр("Контрагент",ДокОбъект.Контрагент);
		Запрос.УстановитьПараметр("Дата",ДокОбъект.Дата);
		ТЗ = Запрос.Выполнить().Выгрузить();	
		Отбор = Новый Структура();
		Отбор.Вставить("Номенклатура",СтрокаТН.номенклатура.Ссылка);
		НайденныеСтроки = ТЗ.НайтиСтроки(Отбор);
		для Каждого Строчка из НайденныеСтроки Цикл 
			НаименованиеКонтрагента = Строчка.НаименованиеКонтрагента;
		КонецЦикла;
		если Не ПустаяСтрока(НаименованиеКонтрагента) тогда
			СтрокаТН.НоменклатураПредставление = НаименованиеКонтрагента 
		иначе		
			СтрокаТН.НоменклатураПредставление=СокрЛП(Модель.ТипТовара)+" "+СокрЛП(Модель.Родитель.Брэнд)+" "+СокрЛП(Модель.КодПроизводителя)+" "+Номенклатура.Наименование;		
		КонецЕсли;	
		//Лобан 120314 ---
		
		
		//Лобан +++ 260713
		//Новая форма е5
		СтрокаТН.ШКТовара=ПолучитьШтрихКодТовара(СтрокаТН.Номенклатура);
		//Лобан --- 260713
		
		Если ПечататьШтрихКоды Тогда
			Если ВидШтрихКода="Внутренний" Тогда
				СтрокаТН.ШтрихКод=?(Кратко,СокрЛП(СтрокаТН.Номенклатура.Код77),Прав(ПолучитьШтрихКодТовара(СтрокаТН.Номенклатура),6));			
			ИначеЕсли ВидШтрихКода="Контрагент" Тогда
				//Нечаева 29,10,2014 +++
				Если ДокОбъект.Контрагент.ИспользоватьНоменклатурнуюМатрицу Тогда
					СтрокаТН.ШтрихКод=ПолучитьАртикулКонтрагентаПоМатрице(ДокОбъект,СтрокаТН.Номенклатура);				
				Иначе
					СтрокаТН.ШтрихКод=ПолучитьАртикулКонтрагента(СтрокаТН.Номенклатура,ТипАртикула);				
				КонецЕсли;	
				//Нечаева 29,10,2014 ---
			ИначеЕсли ВидШтрихКода="ШтрихКод" Тогда
				СтрокаТН.ШтрихКод=ПолучитьШтрихКодТовара(СтрокаТН.Номенклатура);
			КонецЕсли;			
		КонецЕсли;				
		
		
	КонецЦикла; 
	
	
	
	Возврат ТН;
КонецФункции // ПолучитьТаблицуНакладной()


Функция ПолучитьТаблицуНакладной(ДокОбъект,Режим="Накладная",СФ=Неопределено)
	
		Кратко = ложь;    НеУчитыватьРекламации = ложь;  ТипАртикула = неопределено;
		ВидШтрихКода="Внутренний";  ВидШтрихКода="ШтрихКод";

		
	НакладнаяСсылка=ДокОбъект.ссылка;
	Контрагент=ДокОбъект.контрагент;
	
	ТН = новый ТаблицаЗначений;
	//
	////03,04,18+++ нечаева
	//для экспозиторов по Тандеру
	запрос=новый Запрос;
	запрос.Текст="ВЫБРАТЬ
	|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита как Экспозитор
	|ИЗ
	|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
	|ГДЕ
	|	РеквизитыРНКПНКПРМ.Документ = &Документ
	|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = ""Экспозитор"""; 
	запрос.УстановитьПараметр("Документ",НакладнаяСсылка);
	результат=запрос.Выполнить().Выбрать();
	если результат.Количество()>0 тогда
		Результат.Следующий();
		
		Возврат  ПолучитьТаблицуНакладнойТандерЭкспозиторы(ДокОбъект,Режим,СФ,Результат.Экспозитор);
	КонецЕсли;	
	//03,04,18--- нечаева
	
		
	фСводнаяСФ = ложь;
	
	Если Режим="СФ" И фСводнаяСФ Тогда		
		Если СФ=Неопределено ИЛИ СФ.Пустая() Тогда
			//Предупреждение("Невоможно определить сводную СФ для печати !");		
		Иначе
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ Накладная ИЗ Документ.СчетФактура.Накладные ГДЕ Ссылка=&СФ";
			Запрос.УстановитьПараметр("СФ",СФ);			
			СписокНакладных=Запрос.Выполнить().Выгрузить();
		КонецЕсли;	
	КонецЕсли;
	
	
	Запрос=новый запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	Т1.Номенклатура КАК Номенклатура,
	|	СУММА(Т1.Количество) КАК Количество,
	|	СУММА(Т1.НДС) КАК НДС,
	|	СУММА(Т1.Всего) КАК Всего,
	|	Т1.Модель КАК Модель,
	|	СУММА(Т1.НомерСтроки) КАК НомерСтроки,
	// Кухарь А.Ю. 21.07.2021 начало
	// Правильнее брать из товаров, а не из номенклатуры
	|	Т1.СтавкаНДС КАК СтавкаНДС				  
	// Кухарь А.Ю. 21.07.2021 конец
	|ПОМЕСТИТЬ ТЗТоваров
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	|		РасходнаяНакладнаяТовары.Количество КАК Количество,
	|		РасходнаяНакладнаяТовары.НДС КАК НДС,
	|		РасходнаяНакладнаяТовары.Всего КАК Всего,
	|		РасходнаяНакладнаяТовары.Номенклатура.Родитель КАК Модель,
	|		РасходнаяНакладнаяТовары.НомерСтроки КАК НомерСтроки,
	// Кухарь А.Ю. 21.07.2021 начало
	//  // Правильнее брать из товаров, а не из номенклатуры
	|		РасходнаяНакладнаяТовары.СтавкаНДС КАК СтавкаНДС				  
	// Кухарь А.Ю. 21.07.2021 конец
	
	|	ИЗ
	|		Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	|	ГДЕ
	|		РасходнаяНакладнаяТовары.Количество > 0
	|		И РасходнаяНакладнаяТовары.Ссылка В(&СписокНакладных)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РекламационнаяНакладнаяТовары.Номенклатура,
	|		-РекламационнаяНакладнаяТовары.Количество,
	|		-РекламационнаяНакладнаяТовары.НДС,
	|		-РекламационнаяНакладнаяТовары.Всего,
	|		РекламационнаяНакладнаяТовары.Номенклатура.Родитель,
	|		0,             
	// Кухарь А.Ю. 21.07.2021 начало
	//  // Правильнее брать из товаров, а не из номенклатуры
	|		РекламационнаяНакладнаяТовары.СтавкаНДС			  
	// Кухарь А.Ю. 21.07.2021 конец
	
	|	ИЗ
	|		Документ.РекламационнаяНакладная.Товары КАК РекламационнаяНакладнаяТовары
	|	ГДЕ
	|		РекламационнаяНакладнаяТовары.Ссылка.ДокОснование.Ссылка В(&СписокНакладных)
	|		И РекламационнаяНакладнаяТовары.Ссылка.Проведен
	|		И &УчитыватьВычерки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КорректировкаЦенВНакладнойТовары.Номенклатура,
	|		0,
	|		-КорректировкаЦенВНакладнойТовары.НДС,
	|		-КорректировкаЦенВНакладнойТовары.Всего,
	|		КорректировкаЦенВНакладнойТовары.Номенклатура.Родитель,
	|		0,       
	// Кухарь А.Ю. 21.07.2021 начало
	//   Правильнее брать из товаров, а не из номенклатуры
	|		КорректировкаЦенВНакладнойТовары.СтавкаНДС			  
	// Кухарь А.Ю. 21.07.2021 конец
	
	|	ИЗ
	|		Документ.КорректировкаЦенВНакладной.Товары КАК КорректировкаЦенВНакладнойТовары
	|	ГДЕ
	|		КорректировкаЦенВНакладнойТовары.Ссылка.ДокОснование.Ссылка В(&СписокНакладных)
	|		И КорректировкаЦенВНакладнойТовары.Ссылка.Проведен
	|		И КорректировкаЦенВНакладнойТовары.Ссылка.ВидРекламации = &Вычерк
	|		И &УчитыватьВычерки) КАК Т1
	|
	|СГРУППИРОВАТЬ ПО
	|	Т1.Номенклатура,
	|	Т1.Модель,
	|	Т1.СтавкаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ИсторияСрезПоследних.Период) КАК Период,
	|	ТЗТоваров.Модель КАК Модель,
	|	ИсторияСрезПоследних.Реквизит КАК Реквизит
	|ПОМЕСТИТЬ СрезПоследнихГТД
	|ИЗ
	|	ТЗТоваров КАК ТЗТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.История.СрезПоследних(&Дата2, Реквизит = ""НомерГТД"") КАК ИсторияСрезПоследних
	|		ПО ТЗТоваров.Модель = ИсторияСрезПоследних.Объект
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЗТоваров.Модель,
	|	ИсторияСрезПоследних.Реквизит
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ЕСТЬNULL(ШтрихКоды.Наименование, """")) КАК ШтрихКод,
	|	ТЗТоваров.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТЗШК
	|ИЗ
	|	ТЗТоваров КАК ТЗТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихКоды КАК ШтрихКоды
	|		ПО ТЗТоваров.Номенклатура = ШтрихКоды.Владелец
	|			И (ШтрихКоды.ТипШК = &ТипШК)
	|			И (ШтрихКоды.ВидШК = &ВидШК)
	|			И (НЕ ШтрихКоды.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЗТоваров.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоследнихГТД.Модель КАК Модель,
	|	МАКСИМУМ(ИсторияСрезПоследних.Значение) КАК Значение
	|ПОМЕСТИТЬ НомераГТД
	|ИЗ
	|	СрезПоследнихГТД КАК СрезПоследнихГТД
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.История.СрезПоследних(&Дата2, Реквизит = ""НомерГТД"") КАК ИсторияСрезПоследних
	|		ПО СрезПоследнихГТД.Период = ИсторияСрезПоследних.Период
	|			И СрезПоследнихГТД.Модель = ИсторияСрезПоследних.Объект
	|			И СрезПоследнихГТД.Реквизит = ИсторияСрезПоследних.Реквизит
	|
	|СГРУППИРОВАТЬ ПО
	|	СрезПоследнихГТД.Модель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	|	РасходнаяНакладнаяТовары.Количество КАК Количество,
	|	РасходнаяНакладнаяТовары.НДС КАК НДС,
	|	РасходнаяНакладнаяТовары.Всего КАК Всего,
	|	РасходнаяНакладнаяТовары.Модель КАК Модель,
	|	РасходнаяНакладнаяТовары.Всего - РасходнаяНакладнаяТовары.НДС КАК Сумма,
	// Кухарь А.Ю. 21.07.2021 начало
	//      Правильнее брать из товаров, а не из номенклатуры			 
	//|	РасходнаяНакладнаяТовары.Модель.СтавкаНДС КАК СтавкаНДССсылка,
	|	РасходнаяНакладнаяТовары.СтавкаНДС КАК СтавкаНДССсылка,				 
	// Кухарь А.Ю. 21.07.2021 конец
	
	|	РасходнаяНакладнаяТовары.Номенклатура.Код77 КАК Код77,
	|	РасходнаяНакладнаяТовары.Модель.ТипТовара + "" "" + РасходнаяНакладнаяТовары.Модель.Родитель.Брэнд + "" "" + РасходнаяНакладнаяТовары.Модель.КодПроизводителя + "" "" + РасходнаяНакладнаяТовары.Номенклатура.Наименование КАК НоменклатураПредставление,
	|	РасходнаяНакладнаяТовары.Модель.ШтукВКоробке КАК ШтукВКоробке,
	|	РасходнаяНакладнаяТовары.Модель.ШтукВКоробочке КАК ШтукВКоробочке,
	|	ТЗШК.ШтрихКод КАК ШтрихКод,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(НомераГТД.Значение КАК Справочник.ГТД).Наименование, ""--------"") КАК НомерГТД,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(НомераГТД.Значение КАК Справочник.ГТД).СтранаПроисхождения, ""Россия"") КАК Страна,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(НомераГТД.Значение КАК Справочник.ГТД).СтранаПроисхождения.Код, ""-----"") КАК СтранаКод,
	|	РасходнаяНакладнаяТовары.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ТЗТоваров КАК РасходнаяНакладнаяТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомераГТД КАК НомераГТД
	|		ПО РасходнаяНакладнаяТовары.Модель = НомераГТД.Модель
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТЗШК КАК ТЗШК
	|		ПО РасходнаяНакладнаяТовары.Номенклатура = ТЗШК.Номенклатура
	|ГДЕ
	|	РасходнаяНакладнаяТовары.Количество > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	запрос.УстановитьПараметр("Дата2",ДокОбъект.дата);
	запрос.УстановитьПараметр("УчитыватьВычерки",не НеУчитыватьРекламации);
	Если  СписокНакладных = Неопределено Тогда
		СписокНакладных = НакладнаяСсылка;
	КонецЕсли;
	запрос.УстановитьПараметр("СписокНакладных",СписокНакладных);
	Запрос.УстановитьПараметр("Вычерк",перечисления.ВидыРекламаций.Вычерк);
	Запрос.УстановитьПараметр("ВидШК",перечисления.ВидыШК.Основной);
	Запрос.УстановитьПараметр("ТипШК",перечисления.ТипыШтрихКодов.Штука);
	
	// Кухарь А.Ю. 09.09.2021 начало
	// Иногда печатают на ПРМ
	если ДокОбъект.метаданные().имя="Перемещение" тогда
		Запрос.Текст=СтрЗаменить(запрос.Текст,"Документ.РасходнаяНакладная.Товары","Документ.Перемещение.Товары");
	КонецЕсли;
	// Кухарь А.Ю. 09.09.2021 конец
	ПечататьШтрихКоды = ложь;
	
	если Кратко тогда
		//запрос.Текст=СтрЗаменить(запрос.Текст,"Т1.Номенклатура КАК Номенклатура,","");
		//запрос.Текст=СтрЗаменить(запрос.Текст,"Т1.Номенклатура,","");
		//запрос.Текст=СтрЗаменить(запрос.Текст,"РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,","");
		//запрос.Текст=СтрЗаменить(запрос.Текст,"КорректировкаЦенВНакладнойТовары.Номенклатура,","");
		//запрос.Текст=СтрЗаменить(запрос.Текст,"РекламационнаяНакладнаяТовары.Номенклатура,","");	
		//запрос.Текст=СтрЗаменить(запрос.Текст,"РасходнаяНакладнаяТовары.Номенклатура = ШтрихКоды.Владелец","Ложь");
		запрос.Текст=СтрЗаменить(запрос.Текст,"РасходнаяНакладнаяТовары.Номенклатура.Код77","РасходнаяНакладнаяТовары.Модель.Код77");
		запрос.Текст=СтрЗаменить(запрос.Текст,"РасходнаяНакладнаяТовары.Модель.ТипТовара + "" "" + РасходнаяНакладнаяТовары.Модель.Родитель.Брэнд + "" "" + РасходнаяНакладнаяТовары.Модель.КодПроизводителя + "" "" + РасходнаяНакладнаяТовары.Номенклатура.Наименование",											  "РасходнаяНакладнаяТовары.Модель.ТипТовара + "" "" + РасходнаяНакладнаяТовары.Модель.Родитель.Брэнд + "" "" + РасходнаяНакладнаяТовары.Модель.КодПроизводителя + "" "" + РасходнаяНакладнаяТовары.Модель.Наименование");			
	КонецЕсли;
	ТН=запрос.Выполнить().Выгрузить();
	если Кратко тогда
		ТН.Свернуть("Модель,СтавкаНДССсылка,НоменклатураПредставление,Код77,ШтукВКоробке,ШтукВКоробочке,НомерГТД,Страна,СтранаКод","Количество,НДС,Всего,Сумма");		
	КонецЕсли;
	
	
	ТН.Колонки.Добавить("Цена");
	ТН.Колонки.Добавить("Единица");	
	ТН.Колонки.Добавить("ОКЕИ");	
	ТН.Колонки.Добавить("КодКонтрагента");
	ТН.Колонки.Добавить("КоличествоКоробок");
	ТН.Колонки.Добавить("СтавкаНДС");
	ТН.Колонки.Добавить("ШКТовара");
	
	если Кратко тогда
		ТН.Колонки.Добавить("Номенклатура",новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТН.Колонки.Добавить("ШтрихКод");		
	КонецЕсли;
	
	Запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ
	|	Контрагенты.ИспользоватьНоменклатурнуюМатрицу КАК ИспользоватьНоменклатурнуюМатрицу,
	|	Контрагенты.Родитель.Код КАК КодРодителя,
	|	Контрагенты.Код КАК Код
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Ссылка";
	запрос.УстановитьПараметр("Ссылка",Контрагент);
	ВыбКонтр=запрос.Выполнить().Выбрать();	
	// Кухарь А.Ю. 14.06.2024 начало
	//
	ИспользоватьНоменклатурнуюМатрицу=ложь;
	КодРодителя						 ="";
	КодКонтрагента					 ="";	
	// Кухарь А.Ю. 14.06.2024 конец
	
	пока ВыбКонтр.Следующий() цикл
		ИспользоватьНоменклатурнуюМатрицу=ВыбКонтр.ИспользоватьНоменклатурнуюМатрицу;
		КодРодителя						 =ВыбКонтр.КодРодителя;
		КодКонтрагента					 =ВыбКонтр.Код;
	КонецЦикла;
	
	Если ИспользоватьНоменклатурнуюМатрицу и не Кратко Тогда
		Запрос = Новый запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура КАК Номенклатура,
		|	МатрицаТовары.НаименованиеКонтрагента КАК НаименованиеКонтрагента,
		|	МатрицаТовары.ШККонтрагента КАК ШККонтрагента,
		|	МатрицаТовары.АртикулКонтрагента КАК АртикулКонтрагента,
		|	МатрицаТовары.Кратность КАК Кратность,
		|	МатрицаТовары.КратностьКоробки КАК КратностьКоробки
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	МатрицаТовары.Ссылка.Проведен
		|	И МатрицаТовары.Ссылка.Дата <= &Дата
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент";
		Попытка
			Если ДокОбъект.ПостояннаяАкция Тогда
				Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
			Иначе
				Запрос.Текст = Запрос.Текст +" И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция";
			КонецЕсли;
		Исключение	
		КонецПопытки;
		Запрос.УстановитьПараметр("Контрагент",ДокОбъект.Контрагент);
		Запрос.УстановитьПараметр("Дата",ДокОбъект.Дата);
		Запрос.УстановитьПараметр("Номенклатура",ТН.ВыгрузитьКолонку("Номенклатура"));	
		ТЗНаименований = Запрос.Выполнить().Выгрузить();	
	Иначе
		ТЗНаименований = Новый ТаблицаЗначений;
		ТЗНаименований.Колонки.Добавить("Номенклатура");
		ТЗНаименований.Колонки.Добавить("НаименованиеКонтрагента");
	КонецЕсли;
	
	Для Каждого СтрокаТН Из ТН Цикл
		если Кратко тогда
			Номенклатура=СтрокаТН.Модель;
			СтрокаТН.Номенклатура=Номенклатура;
		иначе
			Номенклатура=СтрокаТН.Номенклатура;
		КонецЕсли;	
		
		Модель		=СтрокаТН.Модель;
		
		СтрокаТН.Цена		=?(СтрокаТН.Количество=0,0,СтрокаТН.Сумма/СтрокаТН.Количество);
		Если СтрокаТН.Сумма=0 Тогда
			СтрокаТН.СтавкаНДС=100*ПроцентНДСпоСтавке(СтрокаТН.СтавкаНДССсылка);
		Иначе			
			СтрокаТН.СтавкаНДС	=Окр(100*(СтрокаТН.НДС/СтрокаТН.Сумма),0,1);
		КонецЕсли;			
		
		СтрокаТН.Единица	="шт.";			
		СтрокаТН.ОКЕИ		="796";
		
		Если СтрокаТН.Страна<>"Россия" И СтрДлина(СтрокаТН.НомерГТД)<25 Тогда			
			Если СтрДлина(СтрокаТН.НомерГТД)<23 Тогда
				//Сообщить("Кривой ГТД !!! Товар: """+Номенклатура+""", ГТД: """+СтрокаТН.НомерГТД+""" !");		
			Иначе
				//Сообщить("Отсутствует 4-ый сегмент ГТД !!! Товар: """+Номенклатура+""", ГТД: """+СтрокаТН.НомерГТД+""" !");		
				СтрокаТН.НомерГТД=СтрокаТН.НомерГТД+"/3";
			КонецЕсли; 					
		КонецЕсли;
		Если СтрокаТН.Страна="Россия" Тогда
			СтрокаТН.Страна	="--------";
		КонецЕсли;
		
		
		ШКМатрицы="";
		АртикулМатрицы="";
		КратностьМатрицы=0;
		КратностьКоробкиМатрицы=0;
		Если ТЗНаименований.Количество() > 0  Тогда
			Отбор = Новый Структура();
			Отбор.Вставить("Номенклатура",номенклатура);
			НайденныеСтроки = ТЗНаименований.НайтиСтроки(Отбор);
			
			для Каждого Строчка из НайденныеСтроки Цикл 
				НаименованиеКонтрагента = Строчка.НаименованиеКонтрагента;
				ШКМатрицы=Строчка.ШККонтрагента;
				АртикулМатрица=Строчка.АртикулКонтрагента;
				КратностьМатрицы=Строчка.Кратность;
				КратностьКоробкиМатрицы=Строчка.КратностьКоробки;
				Прервать;
			КонецЦикла;
			
			если Не ПустаяСтрока(НаименованиеКонтрагента) тогда
				СтрокаТН.НоменклатураПредставление = НаименованиеКонтрагента; 		
			КонецЕсли;
		КонецЕсли;
		
		СтрокаТН.ШКТовара=СтрокаТН.ШтрихКод; //Я хз зачем тут нужно 2 колонки с ШК, но на всякий пока оставлю
		
		Если ПечататьШтрихКоды Тогда
			Если ВидШтрихКода="Внутренний" Тогда
				СтрокаТН.ШтрихКод=?(Кратко,СокрЛП(СтрокаТН.Код77),Прав(СтрокаТН.ШтрихКод,6));			
			ИначеЕсли ВидШтрихКода="Контрагент" Тогда
				//Нечаева 29,10,2014 +++
				Если ИспользоватьНоменклатурнуюМатрицу Тогда
					СтрокаТН.ШтрихКод=АртикулМатрица;				
				Иначе
					СтрокаТН.ШтрихКод=ПолучитьАртикулКонтрагента(Номенклатура,ТипАртикула);				
				КонецЕсли;	
				//Нечаева 29,10,2014 ---
			ИначеЕсли ВидШтрихКода="ШтрихКод" Тогда
				СтрокаТН.ШтрихКод=СтрокаТН.ШтрихКод;
			КонецЕсли;
			// Кухарь А.Ю. 17.02.2022 начало
			//
		иначе
			СтрокаТН.ШтрихКод=""; 
			// Кухарь А.Ю. 17.02.2022 конец
			
		КонецЕсли;				
		ИндивидуальнаяНастройкаПодКонтрагента = неопределено;

		
		Если КодРодителя="SSR-4123" или  ИндивидуальнаяНастройкаПодКонтрагента=Справочники.НастройкиПечатиПодКонтрагента.Ашан тогда			
			ШтВКоробке = КратностьКоробкиМатрицы;
			ШтВБлочке   = КратностьМатрицы;
			
			Если ИндивидуальнаяНастройкаПодКонтрагента=Справочники.НастройкиПечатиПодКонтрагента.Ашан тогда
				СтрокаТН.ШтукВКоробке=ШтВКоробке;		
			иначе
				СтрокаТН.ШтукВКоробке=ШтВБлочке;
			КонецЕсли;
			
			Если СтрокаТН.ШтукВКоробке = Неопределено или СтрокаТН.ШтукВКоробке=0 Тогда
			//	Сообщить("По номенклатуре "+Номенклатура + " не указана кратность! Документы оформлены некорректно!");			
				ТН.Очистить();
				Возврат ТН;
			КонецЕсли;
			
			Если СтрокаТН.ШтукВКоробке<>0 Тогда
				СтрокаТН.КоличествоКоробок=СтрокаТН.Количество/СтрокаТН.ШтукВКоробке; 			
			КонецЕсли;
		иначе
			Если СтрокаТН.ШтукВКоробке<>0 Тогда
				СтрокаТН.КоличествоКоробок=СтрокаТН.Количество/СтрокаТН.ШтукВКоробке; 			
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла; 
	
	
	
	
	Если  КодКонтрагента = "SSP-3286" 	или  КодКонтрагента="SSR-1151" тогда
		Для Каждого ТекСтр из ТН Цикл			
			ТекСтр.Цена = Окр (ТекСтр.Цена,3);				
		КонецЦикла;		
	КонецЕсли;
	
		
	Возврат ТН;
	
КонецФункции // ПолучитьТаблицуНакладной()

Функция ПолучитьДанныеРегистраУчитыватьВычерки(Док)
	
	УчитыватьВРНк = Перечисления.УчитыватьВРНК.ПустаяСсылка();
	
	запрос  = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	УчитыватьВычеркиВТорг12.Значение
	|ИЗ
	|	РегистрСведений.УчитыватьВычеркиВТорг12 КАК УчитыватьВычеркиВТорг12
	|ГДЕ
	|	УчитыватьВычеркиВТорг12.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ",Док);
	Рез = Запрос.Выполнить().выбрать();
	Если Рез.Следующий() Тогда
		УчитыватьВРНК = Рез.Значение;
	КонецЕсли;
	
	возврат учитыватьВРНК;
	
КонецФункции


Функция СформироватьСФ(ДокОбъект,Элемент=Неопределено,ПредварительнаяПечать=Ложь,ЗаказОснование = неопределено) Экспорт 
	//
	Организация = справочники.Организации.НайтиПоКоду("SS-001");
	МетаДок=ДокОбъект.Метаданные();
	ВидДокумента="РасходнаяНакладная";
	Дата = ДокОбъект.дата;
	ТекДок = ДокОбъект.ссылка; ПечататьНомерЗаказа = истина; ПечататьДатуЗаказа = истина;
	 ИмяФайлаВнешнегоШаблона = "";
	ПечататьИННвАдресе = ложь;  ПечататьКодПоставщика = истина; ПечататьПочтовыйАдресвСФ = истина; ПечататьЮрАдресВместоПочтового = ложь;
	УпорядочитьНоменклатуру = ложь; 
	// 
	ТабДок = новый ТабличныйДокумент; 
	 //крохин начало
	//для нальных РНК с/ф всегда отсутствует
	Если ВидДокумента="РасходнаяНакладная" Тогда
		Если ДокОбъект.ВидОплаты = Перечисления.ВидыОплаты.НАЛ Тогда
			БелаяСФ = Ложь;			
		КонецЕсли;
		//крохин начало 10.01.2012
		//для РНК без цен тоже нет СФ
		Если ДокОбъект.СуммаДокумента = 0 Тогда
			БелаяСФ = Ложь;			
		КонецЕсли;
		//крохин конец 10.01.2012
		
		//крохин начало 05.05.2020
		//комиссионная торговля
		Если ДокОбъект.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия Тогда
			БелаяСФ = Ложь;
		КонецЕсли;	
		//крохин конец 05.05.2020
		
		
		//Катаев+ 20/08/13
		Если ПредварительнаяПечать Тогда
			БелаяСФ = Ложь;
		КонецЕсли;
		//Катаев- 20/08/13
		
	КонецЕсли;	
	//крохин конец
	
	
	
	//крохин начало 17.11.2011
	//для метро
	номерлиста = 1; 
	//крохин конец 17.11.2011
	
	//нечаева 27,09,17+++
	ИмяМакета = "СФ";
	// Кухарь А.Ю. 22.06.2021 начало
	//	Если ДокОбъект.ДатаОтгрузки >= Дата(2017,10,01)  Тогда
	Если ДокОбъект.ДатаОтгрузки >= Дата(2021,07,01)  Тогда
		ИмяМакета ="СФ20210701";
	ИначеЕсли ДокОбъект.ДатаОтгрузки >= Дата(2017,10,01)  Тогда
		// Кухарь А.Ю. 22.06.2021 конец
		ИмяМакета ="СФ20171001";
	КонецЕсли;
	//нечаева 27,09,17---
	
	
	НеПечататьШтрихКодДокумента = ложь;
	
	//нечаева 29,09,17 +++
	//Если ДокОбъект.ДатаОтгрузки>=Дата(2017,10,01) и ИмяФайлаВнешнегоШаблона  = "СФ_Зельгрос.mxl" ТОгда
	//	ИмяФайлаВнешнегоШаблона  = "СФ_Зельгрос20171001.mxl";
	//КонецЕсли;
	//
	//Если ДокОбъект.ДатаОтгрузки>=Дата(2017,10,01) и ИмяФайлаВнешнегоШаблона  = "СФ_Фрешмаркет.mxl" ТОгда
	//	ИмяФайлаВнешнегоШаблона  = "СФ_Фрешмаркет20171001.mxl";
	//КонецЕсли;
	//
	//Если ДокОбъект.ДатаОтгрузки>=Дата(2017,10,01) и ИмяФайлаВнешнегоШаблона  = "СФАтак.mxl" ТОгда
	//	ИмяФайлаВнешнегоШаблона  = "СФАтак20171001.mxl";
	//КонецЕсли;
	//
	//Если ДокОбъект.ДатаОтгрузки>=Дата(2017,10,01) и ИмяФайлаВнешнегоШаблона  = "СФАшан.mxl" ТОгда
	//	ИмяФайлаВнешнегоШаблона  = "СФАшан20171001.mxl";
	//КонецЕсли;
	//
	//Если ДокОбъект.ДатаОтгрузки>=Дата(2017,10,01) и ИмяФайлаВнешнегоШаблона  = "СФМетроКазахстан.mxl" ТОгда
	//	ИмяФайлаВнешнегоШаблона  = "СФМетроКазахстан20171001.mxl";
	//КонецЕсли;
	//
	//Если ДокОбъект.ДатаОтгрузки>=Дата(2017,10,01) и ИмяФайлаВнешнегоШаблона  = "СФРеал.mxl" ТОгда
	//	ИмяФайлаВнешнегоШаблона  = "СФРеал20171001.mxl";
	//КонецЕсли;
	////нечаева 29,09,17 ---
	
	ИндивидуальнаяНастройкаПодКонтрагента = неопределено;

	Макет 	= ПолучитьМакетВыходнойФормы(ИмяМакета);	
	
	ТабДок	= Новый ТабличныйДокумент;
	
	ВидДокумента=ДокОбъект.Метаданные().Имя;	
	
	ПараметрыПокупатель	= Новый Структура;
	//Кухарь 29.01.18 начало
	//Юр адрес ЕЕЭ теперь хранится в периодическом РС
	ЮрАдресОрганизации=ПолучитьПоследнееЗначениеИзПериодическиеРеквизитыДокументовИСправочников("ЮридическийАдрес",Организация,ДокОбъект.дата); 
	если ЮрАдресОрганизации=Неопределено тогда
		ЮрАдресОрганизации=Организация.ЮридическийАдрес;
	КонецЕсли;
	//Кухарь 29.01.18 конец	
	Если ВидДокумента="Перемещение" Тогда		
		Если ДокОбъект.ПунктДоставки.Пустая() Тогда
			Покупатель		=""+Организация.НаименованиеПолное+","+ДокОбъект.СкладПолучатель;
		Иначе
			ПунктДоставки	=ДокОбъект.ПунктДоставки;
			Покупатель		=""+Организация.НаименованиеПолное+","+ПунктДоставки.Наименование;			
		КонецЕсли;
		
		Грузополучатель		=Покупатель;
		//крохин
		//	АдресГрузополучателя="";
		АдресГрузополучателя = ДокОбъект.СкладПолучатель.Адрес ;
		ПараметрыПокупатель.Вставить("ИНН",Организация.ИНН);
		ПараметрыПокупатель.Вставить("КПП",Организация.КПП);
		//Кухарь 29.01.18 начало
		//Юр адрес ЕЕЭ теперь хранится в периодическом РС		
		//ПараметрыПокупатель.Вставить("ЮридическийАдрес",	Организация.ЮридическийАдрес);
		ПараметрыПокупатель.Вставить("ЮридическийАдрес",	ЮрАдресОрганизации);
		//Кухарь 29.01.18 конец				
		//крохин;
		ПараметрыПокупатель.Вставить("Покупатель",			Покупатель);
		ПараметрыПокупатель.Вставить("Грузополучатель",		Грузополучатель);
		ПараметрыПокупатель.Вставить("АдресГрузополучателя",АдресГрузополучателя);	
	Иначе
		
			ТекКонтрагент	=ДокОбъект.Контрагент;
			ПунктДоставки	=?(ЕстьРеквизитДокумента("ПунктДоставки",ДокОбъект.Метаданные()),ДокОбъект.ПунктДоставки,Справочники.ПунктыДоставки.ПустаяСсылка());
		
		
		
		Если ЕстьРеквизитДокумента("Договор",МетаДок) Тогда
			ТекДоговор	=?(ДокОбъект.Договор.Пустая(),ТекКонтрагент.ОсновнойДоговор,ДокОбъект.Договор);		
		Иначе
			ТекДоговор	=ТекКонтрагент.ОсновнойДоговор;		
		КонецЕсли;		
		
		Покупатель					=ТекКонтрагент;		
		Грузополучатель				=Покупатель;			
		ПочтовыйАдресПокупателя		=Покупатель.ПочтовыйАдрес;
		
		Если ВидДокумента="РасходнаяНакладная" Тогда
			Если НЕ ДокОбъект.ТранспортнаяКомпания.Пустая() Тогда				
				//		Грузополучатель = ДокОбъект.ТранспортнаяКомпания;
			ИначеЕсли НЕ ДокОбъект.Грузополучатель.Пустая() Тогда
				Грузополучатель = ДокОбъект.Грузополучатель;
			КонецЕсли;		
		КонецЕсли;
		
		Если ПунктДоставки.Пустая() Тогда
			АдресГрузополучателя	=Грузополучатель.ПочтовыйАдрес;
		Иначе
			АдресГрузополучателя	=ПунктДоставки.ПочтовыйАдрес;		
			Если ПечататьЮрАдресВместоПочтового Тогда
				АдресГрузополучателя	=Покупатель.ЮридическийАдрес;						
			КонецЕсли;
			ПочтовыйАдресПокупателя	=ПунктДоставки.ПочтовыйАдрес;
		КонецЕсли; 	
		
		
		ПараметрыПокупатель.Вставить("ЮридическийАдрес",?(ПечататьПочтовыйАдресвСФ,ПочтовыйАдресПокупателя,Покупатель.ЮридическийАдрес));
		//Кухарь 10.11.15 начало
		//Если ИНН незаполнен, значит печатаем ИНН иностранного контрагента
		//ПараметрыПокупатель.Вставить("ИНН",Покупатель.ИНН);
		ПараметрыПокупатель.Вставить("ИНН",?(Покупатель.ИНН<>"00",Покупатель.ИНН,Покупатель.ИННИностранногоКонтрагента));
		//Кухарь 10.11.15 конец
		ПараметрыПокупатель.Вставить("КПП",?(ПустаяСтрока(ПунктДоставки.КПП),Покупатель.КПП,ПунктДоставки.КПП));
		
		ПараметрыПокупатель.Вставить("Покупатель",			Покупатель.ПолноеНаименование);
		ПараметрыПокупатель.Вставить("Грузополучатель",		Грузополучатель.ПолноеНаименование);
		ПараметрыПокупатель.Вставить("АдресГрузополучателя",АдресГрузополучателя);	
		//крохин концепция начало
		Если ВидДокумента="РасходнаяНакладная" Тогда
			ПунктДоставки = ДокОбъект.ПунктДоставки;
			Если НЕ Пустаястрока(ПунктДоставки.ПочтовыйАдресДляДокументов + ПунктДоставки.ПечГрузополучательТорг12 + ПунктДоставки.ПечГрузополучательСФ + 
				ПунктДоставки.ПечПлательщикТорг12 + ПунктДоставки.ПечПлательщикСФ + ПунктДоставки.ПечАдресПлательщикаСФ + ПунктДоставки.ПечИННСФ +
				ПунктДоставки.ПечКППСФ)Тогда
				
				
				ПунктДоставки = ДокОбъект.ПунктДоставки;
				Контрагент = ДокОбъект.Контрагент;
				Если ПунктДоставки.ДругоеЮрЛицо Тогда
					НаименованиеГрузополучателя = "";
				Иначе
					НаименованиеГрузополучателя = Контрагент.ПолноеНаименование + ","; 
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(ПунктДоставки.ПочтовыйАдресДляДокументов) Тогда
					АдресГрузополучателя = ПунктДоставки.ПочтовыйАдресДляДокументов + ",";
				иначе
					АдресГрузополучателя = Контрагент.ПочтовыйАдрес + ",";
				Конецесли;
				
				//Кухарь 09.11.15 начало
				//Если ИНН незаполнен, значит печатаем ИНН иностранного контрагента
				//ИННГрузополучателя = ?(ПечататьИННвАдресе,Контрагент.ИНН + "/","");
				ИННГрузополучателя = ?(ПечататьИННвАдресе,?(Контрагент.ИНН<>"00",Контрагент.ИНН,Контрагент.ИННИностранногоКонтрагента) + "/","");
				//Кухарь 09.11.15 конец
				
				КППГрузополучателя = ?(ПечататьИННвАдресе,?(ПустаяСтрока(ПунктДоставки.КПП),Контрагент.КПП,ПунктДоставки.КПП),"");
				СчетГрузополучателя = ?(ПунктДоставки.ДругоеЮрЛицо,"",РасчСчет(Контрагент));
				
				КонтактыГрузополучателя = ?(ПустаяСтрока(ПунктДоставки.Телефоны),"тел: "+Контрагент.Телефоны,"тел: "+ПунктДоставки.Телефоны);
				
				НаименованиеПлательщика = Контрагент.ПолноеНаименование;
				АдресПлательщика = Контрагент.ЮридическийАдрес;
				//Кухарь 09.11.15 начало
				//Если ИНН незаполнен, значит печатаем ИНН иностранного контрагента
				//ИННПлательщика = Контрагент.ИНН;
				ИННПлательщика = ?(Контрагент.ИНН<>"00",Контрагент.ИНН,Контрагент.ИННИностранногоКонтрагента);
				//Кухарь 09.11.15 конец
				
				КПППлательщика = ?(ПунктДоставки.ИспользоватьКППДляПлательщика,ПунктДоставки.КПП,Контрагент.КПП);
				СчетПлательщика = РасчСчет(Контрагент);
				
				Грузополучатель = НаименованиеГрузополучателя + АдресГрузополучателя + ИННГрузополучателя + КППГрузополучателя;
				//Плательщик = НаименованиеПлательщика + АдресПлательщика + ИННПлательщика + КПППлательщика + СчетПлательщика;
				
				Если НЕ ПустаяСтрока(ПунктДоставки.ПечГрузополучательСФ) тогда
					Грузополучатель = ПунктДоставки.ПечГрузополучательСФ;
				КонецЕсли;
				Если НЕ ПустаяСтрока(ПунктДоставки.ПечПлательщикСФ) тогда
					АдресПлательщика = ПунктДоставки.ПечАдресПлательщикаСФ;
					НаименованиеПлательщика = ПунктДоставки.ПечПлательщикСФ;
					ИННПлательщика = ПунктДоставки.ПечИННСФ;
					КПППлательщика = ПунктДоставки.ПечКППСФ;
				КонецЕсли;
				ПараметрыПокупатель.Вставить("ЮридическийАдрес",АдресПлательщика);
				ПараметрыПокупатель.Вставить("ИНН",ИННПлательщика);		
				ПараметрыПокупатель.Вставить("КПП",КПППлательщика);		
				ПараметрыПокупатель.Вставить("Покупатель",			НаименованиеПлательщика);
				ПараметрыПокупатель.Вставить("Грузополучатель",		Грузополучатель);
				ПараметрыПокупатель.Вставить("АдресГрузополучателя","");
				
				
			КонецЕсли;	
			
		КонецЕсли;	
		//крохин концепция конец
		
		
	КонецЕсли;	
	
	// Кухарь А.Ю. 22.06.2021 начало
	ПараметрыПокупатель.Вставить("НомерНакладной",ДокОбъект.Номер);
	ПараметрыПокупатель.Вставить("ДатаОтгрузки",формат(ДокОбъект.ДатаОтгрузки,"ДФ=dd.MM.yyyy"));
	// Кухарь А.Ю. 22.06.2021 конец
	
	// Кухарь А.Ю. 21.07.2021 начало
	// Исправление пункта 5а	
	СФ=Неопределено;
	СФ=СчетФактураНакладной(ДокОбъект.Ссылка,Организация);
	
		
		ТН=ПолучитьТаблицуНакладной(ДокобЪект,"СФ",СФ);
	
	
	КоличествоСтрокТоваров=ТН.количество();
	если КоличествоСтрокТоваров > 1 тогда
		ПараметрыПокупатель.Вставить("ИнтервалСтрокТоваров","-"+КоличествоСтрокТоваров);	 
	КонецЕсли;
	// Кухарь А.Ю. 21.07.2021 конец
	
	
	НомерЗаказа="";
	Если ПечататьКодПоставщика Тогда
		НомерЗаказа=НомерЗаказа+"Поставщик №: "+ДокОбъект.КодПоставщика;	
	КонецЕсли; 
	Если ПечататьНомерЗаказа Тогда
		//++Данилова Е.В. 09.12.2024
		//НомерЗаказа=НомерЗаказа+?(ПустаяСтрока(НомерЗаказа),"",". ")+"Заказ №: "+ДокОбъект.НомерЗаказа;
		Если  ЗаказОснование <> неопределено Тогда  		
			НомерЗаказа =  ЗаказОснование.НомерЗаказа; 
		Иначе 
			НомерЗаказа=НомерЗаказа+?(ПустаяСтрока(НомерЗаказа),"",". ")+"Заказ №: "+ДокОбъект.НомерЗаказа; 
		КонецЕсли;
		//--Данилова Е.В. 09.12.2024
	КонецЕсли; 
	Если ПечататьДатуЗаказа Тогда
		//++Данилова Е.В. 09.12.2024
		//НомерЗаказа=НомерЗаказа+" от "+Формат(ДокОбъект.ДатаЗаказа,"ДФ=dd.MM.yyyy");
		
		Если  ЗаказОснование <> неопределено Тогда  		
			НомерЗаказа =  НомерЗаказа+" от "+Формат(ЗаказОснование.ДатаОформления,"ДФ=dd.MM.yyyy"); 
		Иначе 
			НомерЗаказа=НомерЗаказа+" от "+Формат(ДокОбъект.ДатаЗаказа,"ДФ=dd.MM.yyyy"); 
		КонецЕсли;
		
		//--Данилова Е.В. 09.12.2024
	КонецЕсли;
	ПараметрыПокупатель.Вставить("НомерЗаказа",НомерЗаказа);
	
	//Зельгрос 230115 Лобан +++
	Если ИндивидуальнаяНастройкаПодКонтрагента=Справочники.НастройкиПечатиПодКонтрагента.Зельгрос Тогда
		ПараметрыПокупатель.Вставить("НомерПоставщика","Поставщик №: "+ДокОбъект.КодПоставщика);
		Если ДокОбъект.ПунктДоставки.номермагазина <> "" тогда
			ПараметрыПокупатель.Вставить("Магазин",ДокОбъект.ПунктДоставки.номермагазина);
		иначе
			ПараметрыПокупатель.Вставить("Магазин",ДокОбъект.ПунктДоставки.ДопНаименование);
		КонецЕсли;
		// Кухарь А.Ю. 22.06.2021 начало
		//Перенёс в другое место
		//		ПараметрыПокупатель.Вставить("НомерНакладной",ДокОбъект.Номер);
		// Кухарь А.Ю. 22.06.2021 конец
		//++Данилова Е.В. 09.12.2024
		Если  ЗаказОснование <> неопределено Тогда  		
			НомерЗаказа =  ЗаказОснование.НомерЗаказа; 
		Иначе 
			НомерЗаказа=НомерЗаказа+?(ПустаяСтрока(НомерЗаказа),"",". ")+"Заказ №: "+ДокОбъект.НомерЗаказа; 
		КонецЕсли;
		//--Данилова Е.В. 09.12.2024
		ПараметрыПокупатель.Вставить("номерзаказа",НомерЗаказа); //ДокОбъект.НомерЗаказа);
	КонецЕсли;	
	//Зельгрос 230115 Лобан ---
	//крохин начало 17.11.2011
	//метро
	Если ИндивидуальнаяНастройкаПодКонтрагента = Справочники.НастройкиПечатиПодКонтрагента.Метро Тогда
		ПараметрыПокупатель.Вставить("НомерПоставщика",ДокОбъект.Договор.Номер);
		ПараметрыПокупатель.Вставить("ИЛНпоставщика","4607182769990");
		ПараметрыПокупатель.Вставить("Магазин",ДокОбъект.ПунктДоставки.ДопНаименование);
		ПараметрыПокупатель.Вставить("ИЛНмагазина",ДокОбъект.ПунктДоставки.КодИЛН);
		Если ПечататьНомерЗаказа Тогда
			//крохин начало 03.07.2012
			//НомерЗаказа=НомерЗаказа+?(ПустаяСтрока(НомерЗаказа),"",". ")+"Заказ №:"+ДокОбъект.НомерЗаказа;
			Если ДокОбъект.Метаданные().Имя = "РасходнаяНакладная" И ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSR-2586") Тогда
				Если  ПустаяСтрока(НомерЗаказа) Тогда
					//НомерЗаказа=НомерЗаказа+?(ПустаяСтрока(НомерЗаказа),"",". ")+"Заказ №:"+ДокОбъект.НомерЗаказа;	
					НомерЗаказа="Заказ №:"+ДокОбъект.НомерЗаказа;
				КонецЕсли;
			Иначе
				НомерЗаказа= "Заказ №:"+ДокОбъект.НомерЗаказа;
			КонецЕсли;
			//крохин конец 03.07.2012
		КонецЕсли; 
		Если ПечататьДатуЗаказа Тогда
			НомерЗаказа=НомерЗаказа+" от "+Формат(ДокОбъект.ДатаЗаказа,"ДФ=dd.MM.yyyy");
		КонецЕсли;
		ПараметрыПокупатель.Вставить("номерзаказа",НомерЗаказа);
		ПараметрыПокупатель.Вставить("приемка","");
		
	КонецЕсли;
	//крохин начало 21.05.2012
	Если ИндивидуальнаяНастройкаПодКонтрагента = Справочники.НастройкиПечатиПодКонтрагента.Метро Тогда
		Если  ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSR-2586") Тогда
			ПараметрыПокупатель.Вставить("НомерПоставщика","11638 от.20.02.2012");	
		КонецЕсли;
	КонецЕсли;
	//крохин конец 21.05.2012
	Если ИндивидуальнаяНастройкаПодКонтрагента = Справочники.НастройкиПечатиПодКонтрагента.Ашан Тогда
		//Лобан +++ 150113
		//по письму 
		//ПараметрыПокупатель.Вставить("Магазин","4661");
		//Катаев+ 16/07/14 код поставщика берем из РНК
		//ПараметрыПокупатель.Вставить("Магазин","8614");
		ПараметрыПокупатель.Вставить("Магазин",ДокОбъект.КодПоставщика);
		//Катаев -16/07/14
		//Лобан --- 150113
		ПараметрыПокупатель.Вставить("НомерЗаказа","Заказ №:"+ДокОбъект.НомерЗаказа);
	КонецЕсли;
	//крохин конец 17.11.2011
	
	//Кухарь 01.10.15 начало
	//Для фрешмаркета
	//Кухарь 12.11.15 начало
	//Сменим временный вариант, на правильный
	//	если ДокОбъект.контрагент=Справочники.Контрагенты.НайтиПоКоду("SSR-6067") тогда
	Если ИндивидуальнаяНастройкаПодКонтрагента = Справочники.НастройкиПечатиПодКонтрагента.ФрешМаркет Тогда
		//Кухарь 12.11.15 конец	
		ПредставлениеДоговора= ТекДоговор.Наименование+". Заказ номер "+ДокОбъект.НомерЗаказа+" от "+Лев(Строка(ДокОбъект.дата),10)+", код поставщика "+ДокОбъект.пунктдоставки.КодПоставщика;
		ПараметрыПокупатель.Вставить("ПредставлениеДоговора",ПредставлениеДоговора);
		
	КонецЕсли;
	//Кухарь 01.10.15 конец	
	
	//крохин начало 30.08.2012
	Если ДокОбъект.Метаданные().Имя = "РасходнаяНакладная" И НЕ ПустаяСтрока(ДокОбъект.НомерПлатежногоПоручения) Тогда
		ПараметрыПокупатель.Вставить("ДатаПлатежногоПоручения",Формат(ДокОбъект.ДатаПлатежногоПоручения,"ДФ=dd.MM.yyyy"));
		ПараметрыПокупатель.Вставить("НомерПлатежногоПоручения",ДокОбъект.НомерПлатежногоПоручения);
	Иначе
		ПараметрыПокупатель.Вставить("ДатаПлатежногоПоручения","  ");
		ПараметрыПокупатель.Вставить("НомерПлатежногоПоручения","  ");
		
	КонецЕсли;
	
	//крохин конец 30.08.2012
	
	ОблЗаголовокПокупатель	= Макет.ПолучитьОбласть("ЗаголовокПокупатель");	
	ОблЗаголовокПокупатель.Параметры.Заполнить(ПараметрыПокупатель);	
	
	
	//Нечаева 19,06,17+++
	// новая шапка с июля, добавилась строка.
	ОблЗаголовокПродавец	= Макет.ПолучитьОбласть("ЗаголовокПродавец");
	попытка
		//нечаева 28,09,17+++
		Если  НачалоДня(ДокОбъект.Дата)>=Дата(2017,07,01) и НачалоДня(ДокОбъект.ДатаОтгрузки)<Дата(2017,10,01) Тогда
			ОблЗаголовокПокупатель	= Макет.ПолучитьОбласть("ЗаголовокПокупатель2017");	
			ОблЗаголовокПокупатель.Параметры.Заполнить(ПараметрыПокупатель);
			
			//нечаева 29,06,17+++
			ОблЗаголовокПродавец.Параметры.Дополнение = " (в ред. Постановления Правительства РФ от 25.05.2017 № 625)";
			//нечаева 29,06,17---
			
		КонецЕсли;
		
		// Кухарь А.Ю. 22.06.2021 начало
		//Если  НачалоДня(ДокОбъект.ДатаОтгрузки)>= Дата(2017,10,01) Тогда
		Если  НачалоДня(ДокОбъект.ДатаОтгрузки)>= Дата(2017,10,01) и НачалоДня(ДокОбъект.ДатаОтгрузки)< Дата(2021,07,01) Тогда	 
			// Кухарь А.Ю. 22.06.2021 конец
			
			
			ОблЗаголовокПокупатель	= Макет.ПолучитьОбласть("ЗаголовокПокупатель2017");	
			ОблЗаголовокПокупатель.Параметры.Заполнить(ПараметрыПокупатель);
			
			//нечаева 29,06,17+++
			ОблЗаголовокПродавец.Параметры.Дополнение = " (в ред. Постановлений Правительства РФ от 25.05.2017 № 625 и от 19.08.2017 №981)";
			//нечаева 29,06,17---
			
		КонецЕсли;
		
		//нечаева 28,09,17---
		
		// Кухарь А.Ю. 22.06.2021 начало
		
		Если  НачалоДня(ДокОбъект.ДатаОтгрузки)>= Дата(2021,07,01) Тогда	 
			
			
			ОблЗаголовокПокупатель	= Макет.ПолучитьОбласть("ЗаголовокПокупатель2017");	
			ОблЗаголовокПокупатель.Параметры.Заполнить(ПараметрыПокупатель);
			
			//нечаева 29,06,17+++
			ОблЗаголовокПродавец.Параметры.Дополнение = " (в ред. Постановлений Правительства РФ от 02.04.2021 № 534)";
			//нечаева 29,06,17---
			
		КонецЕсли;
		// Кухарь А.Ю. 22.06.2021 конец
		
		
		
	исключение
		возврат неопределено;
	конецПопытки;
	//Нечаева 19,06,17---
	
	
	
	//кухарь вывод номера приёмки метро начало 22.08.13 начало
	Попытка
		если ИмяФайлаВнешнегоШаблона="СФМетро.mxl" или ИмяФайлаВнешнегоШаблона="СФРеал.mxl"  тогда
			ПоискНомера=новый Запрос;
			ПоискНомера.Текст="ВЫБРАТЬ
			|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита КАК приемка
			|ИЗ
			|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
			|ГДЕ
			|	РеквизитыРНКПНКПРМ.Документ = &Документ
			|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = &ИмяРеквизита";
			ПоискНомера.УстановитьПараметр("Документ", ДокОбъект.ссылка);
			ПоискНомера.УстановитьПараметр("ИмяРеквизита", "НомерПриемкиМетро");
			
			СписокНомеров=ПоискНомера.Выполнить().Выгрузить();
			если СписокНомеров.Количество()=1 тогда
				ОблЗаголовокПокупатель.параметры.приемка=СписокНомеров.Получить(0).приемка;
			ИначеЕсли СписокНомеров.Количество()=0 тогда
			//	сообщить("Отсутствует номер приёмки");
			ИначеЕсли СписокНомеров.Количество()>1 тогда 
			//	сообщить("Имеется более одного номера приёмки на эту накладную");
			КонецЕсли;	
		КонецЕсли;
	Исключение
	КонецПопытки;
	//кухарь вывод номера приёмки метро начало 22.08.13 конец
	
	
	ПараметрыПродавец	= Новый Структура;
	
	// Кухарь А.Ю. 21.07.2021 начало
	//  Перенёс выше
	//	СФ=Неопределено;
	СФ=СчетФактураНакладной(ДокОбъект.Ссылка,Организация);
	// Кухарь А.Ю. 21.07.2021 конец
	ПечатататьИсходныйНомер = истина; БелаяСФ = истина;;
	Если БелаяСФ И ДокОбъект.Метаданные().Имя<>"Перемещение" Тогда
		
		//крохин начало 20.12.2011	
		//вопрос задаем только в офисе
		//Если СФ.Пустая() Тогда
		
		//Ответ=Вопрос("Не найдена СФ к накладной №: "+ТекДок.Номер+" от "+ТекДок.Дата+"
		//|	Контрагент: """+ТекДок.Контрагент+"""
		//|	Организация: """+Организация+""" !
		//|Выписать новую ?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
		//
		//Если Ответ<>КодВозвратаДиалога.Да Тогда
		//	Возврат Неопределено;			
		//Иначе
		Если СФ.Пустая() Тогда
			возврат неопределено;
		конецесли;	
		//	Если ПараметрыСеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		//		Ответ=Вопрос("Не найдена СФ к накладной №: "+ТекДок.Номер+" от "+ТекДок.Дата+"
		//		|	Контрагент: """+ТекДок.Контрагент+"""
		//		|	Организация: """+Организация+""" !
		//		|Выписать новую ?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
		//		
		//		Если Ответ<>КодВозвратаДиалога.Да Тогда
		//			Возврат Неопределено;
		//		КонецЕсли;
		//	КонецЕсли;
		//	//крохин конец 20.12.2011	
		//	//Кухарь 10.11.15 начало
		//	//Нельзя печатать СФ с пустой датой отгрузки
		//	если ДокОбъект.датаотгрузки=ПустаяДата() тогда
		//		//Сообщить("Невозможно создать СФ, не указана дата отгрузки».");
		//		возврат Неопределено;
		//	КонецЕсли;
		//	//Кухарь 10.11.15 конец
		//	
		//	
		//	СФ_Объект=Документы.СчетФактура.СоздатьДокумент();				
		//	
		//	ЗаполнитьШапкуДокумента(СФ_Объект,ПараметрыСеанса.Пользователь,ПараметрыСеанса.ВалютаНац, "Продажа");				
		//	СФ_Объект.Заполнить(ДокОбъект.Ссылка);
		//	СФ_Объект.Организация=Организация;
		//	
		//	Если ВидДокумента="РасходнаяНакладная" Тогда
		//		СФ_Объект.Дата=ДокОбъект.ДатаОтгрузки;			
		//	КонецЕсли;				
		//	
		//	УстановитьНомерДокумента(СФ_Объект);				
		//	
		//	СФ_Объект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
		//	
		//	СФ=СФ_Объект.Ссылка;
		//	
		//	//Оповестить("ОбновитьСписокСФ",ТекДок,ЭтаФорма.ВладелецФормы);
		//	//		КонецЕсли; 			
		//КонецЕсли;		
		
		//крохин начало 13.09.2012
		//реал
		//ПараметрыПродавец.Вставить("Номер",СФ.Номер);
		Если ДокОбъект <> Неопределено И ДокОбъект.метаданные().Имя = "РасходнаяНакладная" И ДокОбъект.Контрагент.Код = "SSP-2412" Тогда
			ПараметрыПродавец.Вставить("Номер",ВРег(СФ.Номер));
		Иначе
			ПараметрыПродавец.Вставить("Номер",СФ.Номер);
		КонецЕсли;
		//крохин конец 13.09.2012
		ПараметрыПродавец.Вставить("Дата",?(ЗначениеНеЗаполнено(Дата),Формат(СФ.Дата,"ДФ=dd.MM.yyyy"),Формат(Дата,"ДФ=dd.MM.yyyy")));		
	Иначе
		ПараметрыПродавец.Вставить("Номер",?(ПечатататьИсходныйНомер,ДокОбъект.Номер,"_______________"));
		ПараметрыПродавец.Вставить("Дата",?(ЗначениеНеЗаполнено(Дата),"_______________",Формат(Дата,"ДФ=dd.MM.yyyy")));
	КонецЕсли; 
	//крохин начало
	//с июня 2009 изменились правила печати с/ф
	//ПараметрыПродавец.Вставить("Продавец",			Организация.НаименованиеПолное);
	Если ДокОбъект <> Неопределено И ДокОбъект.Дата > '20090609' Тогда
		ПараметрыПродавец.Вставить("Продавец",			Организация.НаименованиеПолное + "("+Организация.Наименование+")");
	иначе
		ПараметрыПродавец.Вставить("Продавец",			Организация.НаименованиеПолное);
	КонецЕсли;
	//крохин начало 10.02.2012
	//с 2012 года снова изменились. 
	//	Если ДокОбъект <> Неопределено И ДокОбъект.Дата > '20090609' Тогда
	ПараметрыПродавец.Вставить("Продавец",			Организация.НаименованиеПолное);	
	//	КонецЕсли;
	//крохин конец 10.02.2012
	//крохин конец
	ПараметрыПродавец.Вставить("Грузоотправитель",	Организация.НаименованиеПолное);
	
	//Подразделение=ПараметрыСеанса.ЭтотУзел.Подразделение;
	//Если НЕ Подразделение.Пустая() И НЕ ПустаяСтрока(Подразделение.ПочтовыйАдрес) Тогда
	//	ПараметрыПродавец.Вставить("ЮридическийАдрес",	Подразделение.ПочтовыйАдрес);
	//Иначе	
	//крохин начало 23.09.2011
	//Адрес печатаем обособленного подразделения, если задан КПП
	//ПараметрыПродавец.Вставить("ЮридическийАдрес",	Организация.ЮридическийАдрес);
	Если ВидДокумента="РасходнаяНакладная" И НЕ ПустаяСтрока(ДокОбъект.Склад.Подразделение.КПП) Тогда
		АдресПродавца = ДокОбъект.Склад.Подразделение.ПочтовыйАдрес;
	Иначе
		
		//Кухарь 29.01.18 начало
		//Юр адрес ЕЕЭ теперь хранится в периодическом РС		
		//АдресПродавца = Организация.ЮридическийАдрес;
		АдресПродавца = ЮрАдресОрганизации;
		//Кухарь 29.01.18 конец				
	КонецЕсли;
	//крохин начало 22.11.2011
	//продавец - юр.адрес, грузоотправитель - факт.адрес
	//ПараметрыПродавец.Вставить("ЮридическийАдрес",	АдресПродавца);
	Попытка
		//Кухарь 29.01.18 начало
		//Юр адрес ЕЕЭ теперь хранится в периодическом РС		
		//ПараметрыПродавец.Вставить("ЮридическийАдрес",	Организация.ЮридическийАдрес);
		ПараметрыПродавец.Вставить("ЮридическийАдрес",	ЮрАдресОрганизации);
		//Кухарь 29.01.18 конец			
		
		ПараметрыПродавец.Вставить("ПочтовыйАдрес",	АдресПродавца);
	Исключение
		ПараметрыПродавец.Вставить("ЮридическийАдрес",	АдресПродавца);	
	КонецПопытки;
	//крохин конец 22.11.2011
	
	//крохин конец 23.09.2011
	//КонецЕсли; 
	
	ПараметрыПродавец.Вставить("ИНН",				Организация.ИНН);
	//крохин начало 23.09.2011
	//КПП печатаем обособленного подразделения, если есть
	//ПараметрыПродавец.Вставить("КПП",				Организация.КПП);
	Если ВидДокумента="РасходнаяНакладная" И НЕ ПустаяСтрока(ДокОбъект.Склад.Подразделение.КПП) Тогда
		КПП = ДокОбъект.Склад.Подразделение.КПП;
	Иначе
		КПП = Организация.КПП;
	КонецЕсли;
	ПараметрыПродавец.Вставить("КПП",				КПП);
	//крохин конец 23.09.2011
	
	//крохин начало 24.05.2012
	//номер исправления
	Исправление = ложь;
	Если Не Исправление ИЛИ ДокОбъект.Метаданные().Имя <> "РасходнаяНакладная" Тогда
		ПараметрыПродавец.Вставить("НомерИсправления","--");
		ПараметрыПродавец.Вставить("ДатаИсправления","--");
	Иначе
		
		//Запрос = Новый Запрос;
		//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	ДЕНЬ(РекламационнаяНакладная.Дата) КАК ДатаРКМ
		//|ИЗ
		//|	Документ.РекламационнаяНакладная КАК РекламационнаяНакладная
		//|ГДЕ
		//|	РекламационнаяНакладная.ДокОснование = &ДокОснование
		//|	И (НЕ РекламационнаяНакладная.ПометкаУдаления)
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	ДатаРКМ УБЫВ
		//|АВТОУПОРЯДОЧИВАНИЕ";
		
		// нечаева 07,02,14 +++
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НачалоПериода(РекламационнаяНакладная.Дата,День) КАК ДатаРКМ
		|ИЗ
		|	Документ.РекламационнаяНакладная КАК РекламационнаяНакладная
		|ГДЕ
		|	РекламационнаяНакладная.ДокОснование = &ДокОснование
		|	И (НЕ РекламационнаяНакладная.ПометкаУдаления)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НачалоПериода(КорректировкаЦенВНакладной.Дата,День)
		|ИЗ
		|	Документ.КорректировкаЦенВНакладной КАК КорректировкаЦенВНакладной
		|ГДЕ
		|	КорректировкаЦенВНакладной.ДокОснование = &ДокОснование
		|	И (НЕ КорректировкаЦенВНакладной.ПометкаУдаления)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаРКМ УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		// нечаева 07,02,14 ---
		
		
		Запрос.УстановитьПараметр("ДокОснование",ДокОбъект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() = 0 Тогда
			ПараметрыПродавец.Вставить("НомерИсправления","--");
			ПараметрыПродавец.Вставить("ДатаИсправления","--");
		Иначе
			Выборка.Следующий();
			ПараметрыПродавец.Вставить("НомерИсправления",Выборка.Количество());
			ПараметрыПродавец.Вставить("ДатаИсправления",формат(Выборка.датаРКМ,"ДЛФ=D"));
			
		КонецЕсли;
	КонецЕсли;
	//крохин конец 24.05.2012
	
	//нечаева - перенесла29,06,17++
	//ОблЗаголовокПродавец	= Макет.ПолучитьОбласть("ЗаголовокПродавец");
	//нечаева 29,06,17---
	
	ОблЗаголовокПродавец.Параметры.Заполнить(ПараметрыПродавец);
	//крохин начало
	//с июня 2009 изменились правила печати с/ф
	//Если ДокОбъект <> Неопределено И ДокОбъект.Дата > '20090609' Тогда
	//	ОблЗаголовокПродавец.Параметры.Дополнение = ",от 26 мая 2009 г. №451";
	//	//крохин начало 23.12.2011
	//	//очередное изменение
	//	ОблЗаголовокПродавец.Параметры.Дополнение = ",от 26 мая 2009 г. №451,от 26 декабря 2011 г. №1137";
	//	//крохин конец 23.12.2011
	//	
	//иначе
	//	ОблЗаголовокПродавец.Параметры.Дополнение = "";		
	//конецесли;
	//
	////крохин начало 10.02.2012 
	////изменение формы
	//ОблЗаголовокПродавец.Параметры.Дополнение = "";
	//
	//
	//ОблЗаголовокПродавец.Параметры.Дополнение = " (в ред. Постановления Правительства РФ от 25.05.2017 № 625)";
	//
	
	//крохин конец 10.02.2012
	//крохин конец
	
	
	//крохин начало 21.03.2011
	ОбъектШК=ОблЗаголовокПродавец.Рисунки.ОбъектШК.Объект;
	
	Попытка	
		Если НЕ НеПечататьШтрихКодДокумента Тогда
			ОбъектШК.Сообщение=_глСформироватьШКДока(СФ,1);
			ОбъектШК.ОтображатьТекст=Ложь;
			ОбъектШК.ВыравниваниеКода=0;			
			
			ОблЗаголовокПродавец.Рисунки.ОбъектШК.Расположить(ОблЗаголовокПродавец.Область(1,1,1,4));
		Иначе
			ОблЗаголовокПродавец.Рисунки.Удалить(ОблЗаголовокПродавец.Рисунки.ОбъектШК);
		КонецЕсли;		
	Исключение	
	КонецПопытки;
	СписокРисунков=Новый СписокЗначений;
	//крохин конец 21.03.2011
	
	
	ТабДок.Вывести(ОблЗаголовокПродавец);
	ТабДок.Вывести(ОблЗаголовокПокупатель);
	
	
	ВидШтрихКода="Контрагент";
	ПечататьШтрихКоды =истина; ТипАртикула="";
	
	ПараметрыШапки=Новый Структура;
	
	ОблШапка=Макет.ПолучитьОбласть("Шапка");	
	//Если ПечататьШтрихКоды И ВидШтрихКода="Контрагент" Тогда
	//	// Кухарь А.Ю. 07.02.2022 начало
	//	//		ПараметрыШапки.Вставить("ТипАртикула","1/1 "+ТипАртикула);
	//	если ИндивидуальнаяНастройкаПодКонтрагента <> Справочники.НастройкиПечатиПодКонтрагента.БэстПрайс Тогда
	//		ПараметрыШапки.Вставить("ТипАртикула","1/1 "+ТипАртикула);//БэстПрайс
	//	КонецЕсли;
	//	// Кухарь А.Ю. 07.02.2022 конец

	//КонецЕсли; 
	ОблШапка.Параметры.Заполнить(ПараметрыШапки);
	ТабДок.Вывести(ОблШапка);
	ТабДок.ИмяПараметровПечати	= "СФ_"+ЭтотОбъект.Метаданные().Имя;
	
	//крохин начало 21.03.2011
	Если НеПечататьШтрихКодДокумента Тогда
		ТабДок.Рисунки.Удалить(ТабДок.Рисунки[0]);
	Иначе
		ТабДок.Рисунки.Удалить(ТабДок.Рисунки[1]);	
		СписокРисунков.Добавить(ТабДок.Рисунки[0],Формат(1,"ЧЦ=10; ЧРГ=; ЧВН=; ЧГ="));
	КонецЕсли;	
	//крохин конец 21.03.2011
	
	
	//// Кухарь А.Ю. 21.07.2021 начало
	//// Перенёс выше
	//// Нечаева++
	//Если ВидДокумента="ПродажаИМ" Тогда
	//	ТН=ПолучитьТаблицуНакладнойТорг12("СФ",СФ,перечисления.ВидыНоменклаутры.Товар,перечисления.ВидыНоменклаутры.Услуга);
	//Иначе	
	//	ТН=ПолучитьТаблицуНакладной("СФ",СФ);
	//КонецЕсли;
	//// нечаева ---	 
	//// Кухарь А.Ю. 21.07.2021 конец
	
	
	
	
	ОблИтого=Макет.ПолучитьОбласть("Итого");
	ОблПодвал=Макет.ПолучитьОбласть("ПодвалЕЕ");
	
	ЗначениеОВЛ = ПолучитьСтрокуСДаннымиОтветственноеЛицо(ДокОбъект);
	ОВЛ = ЗначениеОВЛ.Овл;
	СтрокаСотрудников = ЗначениеОВЛ.СтрокаСотрудников;
	
	ОблПодвал.Параметры.ОВЛ = ОВЛ;
	ОблПодвал.Параметры.СтрокаСотрудников = СтрокаСотрудников;
	
	//крохин конец 25.04.2013
	
	ПоследняяСтрока=Ложь;
	//Кухарь 01.11.16 начало
	//пока что только для Атака
	ИтогНДС10=0;
	ИтогНДС18=0;
	//Кухарь 01.11.16 конец
	
	// Кухарь А.Ю. 22.06.2021 начало
	//
	НПП=1;
	ТН.колонки.добавить("НПП");
	// Кухарь А.Ю. 22.06.2021 конец
	
	
	// Кухарь А.Ю. 21.07.2021 начало
	//
	КолонкаСтавкаНДС=ТН.колонки.найти("СтавкаНДССсылка");
	если КолонкаСтавкаНДС<>Неопределено тогда
		ЕстьСсылкаНаСтавку=Истина;
	иначе
		ЕстьСсылкаНаСтавку=ложь;
	КонецЕсли;
	// Кухарь А.Ю. 21.07.2021 конец
	
	
	Для Каждого СтрокаТН  Из ТН Цикл
		ОблСтрока=Макет.ПолучитьОбласть("Строка");	
		// Кухарь А.Ю. 22.06.2021 начало
		СтрокаТН.НПП=НПП;
		НПП=НПП+1;
		// Кухарь А.Ю. 22.06.2021 конец
		
		
		ОблСтрока.Параметры.Заполнить(СтрокаТН);
		
		// Кухарь А.Ю. 21.07.2021 начало
		// Исправление отображения ставки НДС "Без НДС"
		если ЕстьСсылкаНаСтавку и СтрокаТН.СтавкаНДССсылка = Перечисления.СтавкиНДС.БезНДС тогда
			ОбластьСтавкаНДС=ОблСтрока.области.найти("СтавкаНДС");
			если ОбластьСтавкаНДС<>Неопределено тогда
				ОбластьСтавкаНДС.текст=СтрЗаменить(ОбластьСтавкаНДС.текст," %","");
				ОбластьСтавкаНДС.текст=СтрЗаменить(ОбластьСтавкаНДС.текст,"%","");
				ОблСтрока.Параметры.СтавкаНДС="Без НДС";
			КонецЕсли;
		КонецЕсли;
		// Кухарь А.Ю. 21.07.2021 конец
		
		
		
		//нечаева 2017,09,28++
		Попытка
			Если ДокОбъект.Контрагент.НулеваяСтавкаНДС = Истина Тогда
				ОблСтрока.Параметры.КодТНВЕД = СтрокаТН.Номенклатура.Родитель.ТНВЭД.код;
			Иначе
				ОблСтрока.Параметры.КодТНВЕД = "-";
			КонецЕсли;
		Исключение
		КонецПопытки;
		//нечаева 2017,09,28---
		
		
		//Кухарь 01.11.16 начало
		//пока что только для Атака
		попытка
			если ОблСтрока.параметры.ставкаНДС=18 тогда
				ОблСтрока.параметры.НДС18=ОблСтрока.параметры.НДС;
				ИтогНДС18=ИтогНДС18+ОблСтрока.параметры.НДС18;
			ИначеЕсли ОблСтрока.параметры.ставкаНДС=10 тогда
				ОблСтрока.параметры.НДС10=ОблСтрока.параметры.НДС;
				ИтогНДС10=ИтогНДС10+ОблСтрока.параметры.НДС10;
			КонецЕсли;
		Исключение
		КонецПопытки;
		//Кухарь 01.11.16 конец
		
		//Кухарь 01.10.15 начало
		//Для фрешмаркета
		//Кухарь 12.11.15 начало
		//Сменим временный вариант, на правильный
		//	если ДокОбъект.контрагент=Справочники.Контрагенты.НайтиПоКоду("SSR-6067") тогда
		Если ИндивидуальнаяНастройкаПодКонтрагента = Справочники.НастройкиПечатиПодКонтрагента.ФрешМаркет Тогда
			//Кухарь 12.11.15 конец	
			ОблСтрока.Параметры.ШтрихКод13=ПолучитьШтрихКодТовара(СтрокаТН.Номенклатура);
		КонецЕсли;
		//Кухарь 01.10.15 конец	
		ОблСтрока.Параметры.ШтрихКод=ПолучитьШтрихКодТовара(СтрокаТН.Номенклатура);
		
		МТ=Новый Массив;		
		МТ.Добавить(ОблСтрока);
		//крохин начало
		//неверно считаются страницы при добавлении рисунка, сделаем запас
		ПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
		МТ.Добавить(ПустаяСтрока);
		МТ.Добавить(ПустаяСтрока);
		//	МТ.Добавить(ПустаяСтрока);
		//	МТ.Добавить(ПустаяСтрока);
		//крохин конец
		
		НужнаНоваяСтраница=Ложь;		
		
		Если ТН.Индекс(СтрокаТН)=ТН.Количество()-1 Тогда		
			ПоследняяСтрока=Истина;
			
			МТ.Добавить(ОблИтого);
			МТ.Добавить(ОблПодвал);		
		КонецЕсли;
		
		Если НЕ ТабДок.ПроверитьВывод(МТ) Тогда			
			//	Если ПоследняяСтрока Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();			
			//	КонецЕсли; 
			//крохин начало 17.11.2011
			//метро, доп. шапка
			Если ИндивидуальнаяНастройкаПодКонтрагента = Справочники.НастройкиПечатиПодКонтрагента.Метро Тогда
				ОблШапкаНиз = Макет.ПолучитьОбласть("ШапкаНиз");
				ОблШапкаНиз.Параметры.Заполнить(ПараметрыПокупатель);
				ОблШапкаНиз.Параметры.Номер = СФ.Номер;
				ОблШапкаНиз.Параметры.Дата = СФ.Дата;
				номерлиста = номерлиста+1;
				ОблШапкаНиз.Параметры.Номерлиста = "Страница №"+" "+номерлиста;
				
				//кухарь вывод номера приёмки метро начало 22.08.13 начало
				Попытка
					если ИмяФайлаВнешнегоШаблона="СФМетро.mxl" или ИмяФайлаВнешнегоШаблона="СФРеал.mxl"  тогда
						ПоискНомера=новый Запрос;
						ПоискНомера.Текст="ВЫБРАТЬ
						|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита КАК приемка
						|ИЗ
						|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
						|ГДЕ
						|	РеквизитыРНКПНКПРМ.Документ = &Документ
						|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = &ИмяРеквизита";
						ПоискНомера.УстановитьПараметр("Документ", ДокОбъект.ссылка);
						ПоискНомера.УстановитьПараметр("ИмяРеквизита", "НомерПриемкиМетро");
						
						СписокНомеров=ПоискНомера.Выполнить().Выгрузить();
						если СписокНомеров.Количество()=1 тогда
							ОблШапкаНиз.параметры.приемка=СписокНомеров.Получить(0).приемка;
						ИначеЕсли СписокНомеров.Количество()=0 тогда
							//сообщить("Отсутствует номер приёмки");
						ИначеЕсли СписокНомеров.Количество()>1 тогда 
							//сообщить("Имеется более одного номера приёмки на эту накладную");
						КонецЕсли;	
					КонецЕсли;
				Исключение
				КонецПопытки;
				//кухарь вывод номера приёмки метро начало 22.08.13 конец
				
				
				
				
				
				ТабДок.Вывести(ОблШапкаНиз);
			КонецЕсли;
			//крохин конец 17.11.2011
			ТабДок.Вывести(ОблШапка);
			//крохин начало 21.03.2011
			
			НомерСтроки=ТабДок.ВысотаТаблицы-ОблШапка.ВысотаТаблицы+1;
			//крохин начало 17.11.2011
			//метро, доп. шапка
			Если ИндивидуальнаяНастройкаПодКонтрагента = Справочники.НастройкиПечатиПодКонтрагента.Метро Тогда
				НомерСтроки = НомерСтроки - ОблШапкаНиз.ВысотаТаблицы;	
			КонецЕсли;
			//крохин конец 17.11.2011
			
			Если НЕ НеПечататьШтрихКодДокумента Тогда
				ТабДок.Область(НомерСтроки,,НомерСтроки,).ВысотаСтроки=40;									
			КонецЕсли;
			СписокРисунков.Добавить(ТабДок.Рисунки[ТабДок.Рисунки.Количество()-1],Формат(НомерСтроки,"ЧЦ=10; ЧРГ=; ЧВН=; ЧГ="));
			//крохин конец 21.03.2011
		КонецЕсли;
		
		
		ТабДок.Вывести(ОблСтрока);
	КонецЦикла; 
	//крохин начало 21.03.2011	
	СписокРисунков.СортироватьПоПредставлению();
	Сч=0;ВсегоСтраниц=СписокРисунков.Количество();
	НеПечататьШтрихКодДокумента = истина;
	ИндивидуальнаяНастройкаПодКонтрагента = неопределено;
	Для Каждого СтрокаРисунка Из СписокРисунков Цикл
		Сч=Сч+1;
		
		Рисунок	=СтрокаРисунка.Значение;
		ОбъектШК=Рисунок.Объект;
		
		Если НЕ НеПечататьШтрихКодДокумента Тогда
			ОбъектШК.Сообщение			= _глСформироватьШКДока(СФ,Сч,ВсегоСтраниц);
			ОбъектШК.ОтображатьТекст	= Ложь;
			ОбъектШК.ВыравниваниеКода	= 0;			
			
			НомерСтроки=Число(СтрокаРисунка.Представление);
			Рисунок.Расположить(ТабДок.Область(НомерСтроки,2,НомерСтроки,10));
			
			Если ИндивидуальнаяНастройкаПодКонтрагента = Справочники.НастройкиПечатиПодКонтрагента.Метро Тогда
				Рисунок.Расположить(ТабДок.Область(НомерСтроки,4,НомерСтроки,12));	
			КонецЕсли;
			//крохин конец 17.11.2011
			
			
			//крохин начало 22.03.2011
			Если НомерСтроки = 1 Тогда
				НомерСтроки = 15;
			КонецЕсли;
			
			Если НомерСтроки <> 15 Тогда
				
				Если ЗначениеНеЗаполнено(Дата) Тогда
					ТабДок.Область(НомерСтроки,14,НомерСтроки,14).Текст = "СФ "+СФ.Номер+ " от "+ФОрмат(ТекДок.Дата,"ДФ=dd.MM.yyyy")+" стр. "+Сч + " из "+ВсегоСтраниц; 
				Иначе
					ТабДок.Область(НомерСтроки,14,НомерСтроки,14).Текст = "СФ "+СФ.Номер+ " от "+ФОрмат(Дата,"ДФ=dd.MM.yyyy")+" стр. "+Сч + " из "+ВсегоСтраниц; 
				КонецЕсли;
				ТабДок.Область(НомерСтроки,14,НомерСтроки,14).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право; 
				Если ИндивидуальнаяНастройкаПодКонтрагента = Справочники.НастройкиПечатиПодКонтрагента.Метро Тогда
					ТабДок.Область(НомерСтроки,14,НомерСтроки,14).Очистить();
					ТабДок.Область(НомерСтроки+6,16,НомерСтроки+6,16).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
				КонецЕсли;
				//ашан
				Если ИндивидуальнаяНастройкаПодКонтрагента = Справочники.НастройкиПечатиПодКонтрагента.Ашан Тогда
					ТабДок.Область(НомерСтроки,14,НомерСтроки,14).Очистить(); 
					Если ЗначениеНеЗаполнено(Дата) Тогда
						ТабДок.Область(НомерСтроки,16,НомерСтроки,16).Текст = "СФ "+СФ.Номер+ " от "+ФОрмат(ТекДок.Дата,"ДФ=dd.MM.yyyy")+" стр. "+Сч + " из "+ВсегоСтраниц+". Валюта: руб";
					Иначе
						ТабДок.Область(НомерСтроки,16,НомерСтроки,16).Текст = "СФ "+СФ.Номер+ " от "+ФОрмат(Дата,"ДФ=dd.MM.yyyy")+" стр. "+Сч + " из "+ВсегоСтраниц+". Валюта: руб";
					КонецЕсли;
					//крохин конец 14.02.2013
					ТабДок.Область(НомерСтроки,16,НомерСтроки,16).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
				КонецЕсли;
			Иначе
				
				Если ЗначениеНеЗаполнено(Дата) Тогда
					ТабДок.Область(НомерСтроки,14,НомерСтроки,14).Текст = "СФ "+СФ.Номер+ " от "+ФОрмат(ТекДок.Дата,"ДФ=dd.MM.yyyy")+" стр. "+Сч + " из "+ВсегоСтраниц+". Валюта: руб";
				Иначе
					ТабДок.Область(НомерСтроки,14,НомерСтроки,14).Текст = "СФ "+СФ.Номер+ " от "+ФОрмат(Дата,"ДФ=dd.MM.yyyy")+" стр. "+Сч + " из "+ВсегоСтраниц+". Валюта: руб";
				КонецЕсли;
				//крохин конец 14.02.2013
				ТабДок.Область(НомерСтроки,14,НомерСтроки,14).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право; 
				//крохин конец 23.01.2012
				
				//метро, другая MXL
				Если ИндивидуальнаяНастройкаПодКонтрагента = Справочники.НастройкиПечатиПодКонтрагента.Метро Тогда
					ТабДок.Область(НомерСтроки,14,НомерСтроки,14).Очистить();
					ТабДок.Область(НомерСтроки,16,НомерСтроки,16).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
				КонецЕсли;
				
				//ашан
				Если ИндивидуальнаяНастройкаПодКонтрагента = Справочники.НастройкиПечатиПодКонтрагента.Ашан Тогда
					ТабДок.Область(НомерСтроки,14,НомерСтроки,14).Очистить(); 
					Если ЗначениеНеЗаполнено(Дата) Тогда
						ТабДок.Область(НомерСтроки+1,16,НомерСтроки+1,16).Текст = "СФ "+СФ.Номер+ " от "+ФОрмат(ТекДок.Дата,"ДФ=dd.MM.yyyy")+" стр. "+Сч + " из "+ВсегоСтраниц+". Валюта: руб"; 
					Иначе
						ТабДок.Область(НомерСтроки+1,16,НомерСтроки+1,16).Текст = "СФ "+СФ.Номер+ " от "+ФОрмат(Дата,"ДФ=dd.MM.yyyy")+" стр. "+Сч + " из "+ВсегоСтраниц+". Валюта: руб"; 
					КонецЕсли;
					ТабДок.Область(НомерСтроки+1,16,НомерСтроки+1,16).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			ТабДок.Рисунки.Удалить(Рисунок);			
		КонецЕсли;	
	КонецЦикла; 
	//крохин конец 21.03.2011
	
	
	ОблИтого.Параметры.Всего			=ТН.Итог("Всего");	
	ОблИтого.Параметры.НДС				=ТН.Итог("НДС");
	
	//Кухарь 01.11.16 начало
	//пока что только для Атака
	
	попытка		
		ОблИтого.параметры.НДС18=ИтогНДС18;
		ОблИтого.параметры.НДС10=ИтогНДС10;
	Исключение
	КонецПопытки;
	//Кухарь 01.11.16 конец
	
	
	//крохин начало 28.02.2012
	//с 2012 года Сумма присутствует в СФ
	ОблИтого.Параметры.Сумма			=ТН.Итог("Сумма");
	//крохин конец 28.02.2012
	
	ТабДок.Вывести(ОблИтого);	
	
	ОтветственныеЛица=ОтветственныеЛица(Организация,ДокОбъект.Дата);	
	ОблПодвал.Параметры.Заполнить(ОтветственныеЛица);	
	
	//крохин конец 08.02.2019
	ТабДок.Вывести(ОблПодвал);	
	
	ТабДок.ОтображатьСетку 		= Ложь;	
	ТабДок.ОтображатьЗаголовки 	= Ложь;
	
	ТабДок.КоличествоЭкземпляров=1;
	//табдок.Показать();
	
	Возврат ТабДок;
	
	
	
КонецФункции

//---------------------------------------------
// печать ПРМ

// нечаева 21,09,23++
Функция СформироватьНакладную(ДокОбъект,ДопПараметры=Неопределено) Экспорт 
	
	ТабДок	= Новый ТабличныйДокумент;
	
	МетаДок		= ДокОбъект.Метаданные();
	ВидДокумента= МетаДок.Имя;
	
	Если ВидДокумента="РасходнаяНакладная" Тогда
		ВидНакладной="Расходная накладная";
		Получатель	=ДокОбъект.Контрагент;
	ИначеЕсли ВидДокумента="ПриходнаяНакладная" Тогда
		ВидНакладной="Приходная накладная";				
		Получатель	=ДокОбъект.Склад;
	ИначеЕсли ВидДокумента="Перемещение" Тогда
		ВидНакладной="Перемещение";		
		Получатель	=ДокОбъект.СкладПолучатель;
	ИначеЕсли ВидДокумента="ОтчетКассовойСмены" Тогда
		ВидНакладной="ОКС";		
		Получатель	=ДокОбъект.Касса;				
	ИначеЕсли ВидДокумента="ПродажаИМ" Тогда
		ВидНакладной="Продажа интернет-магазина";		
		Получатель	=ДокОбъект.Контрагент;
		
	Иначе
		ВидНакладной="";		
	КонецЕсли; 
	
	Макет=ПолучитьМакет("Накладная");
	ОблЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	//крохин начало 23.08.2011
	//в ЛН нет организации	
	//ОблЗаголовок.Параметры.Фирма		= ДокОбъект.Организация.НаименованиеПолное;
	МетаданныеДокумента = ДокОбъект.Метаданные();
	Если ЕстьРеквизитДокумента("Организация",МетаданныеДокумента) Тогда
		ОблЗаголовок.Параметры.Фирма		= ДокОбъект.Организация.НаименованиеПолное;
	Иначе
		ОблЗаголовок.Параметры.Фирма        = Справочники.Организации.НайтиПоКоду("SS-001").НаименованиеПолное; 
	КонецЕсли;
	//крохин конец 23.08.2011
	ОблЗаголовок.Параметры.Склад		= "Склад: "+ДокОбъект.Склад;
	ОблЗаголовок.Параметры.ВидНакладной = ВидНакладной;
	ОблЗаголовок.Параметры.Номер		= ДокОбъект.Номер;		
	ОблЗаголовок.Параметры.Дата			= Формат(ДокОбъект.Дата,"ДФ=dd.MM.yyyy");		
	ОблЗаголовок.Параметры.Получатель	= Получатель;
	Попытка
		ОблЗаголовок.Параметры.ДатаОтгрузки	= "Дата отгрузки: "+Формат(ДокОбъект.ДатаОтгрузки,"ДФ=dd.MM.yyyy");			
	Исключение
		
	КонецПопытки;
	
	Если ЕстьРеквизитДокумента("Комментарий",МетаДок) Тогда
		ОблЗаголовок.Параметры.Комментарий	= СокрЛП(ДокОбъект.Комментарий);	
	КонецЕсли; 
	
	ТабДок.Вывести(ОблЗаголовок);
	
	
	Если ВидДокумента="РасходнаяНакладная" И ДокОбъект.ДопОбработка>0 Тогда
		ТабДок.Вывести(Макет.ПолучитьОбласть("ЗаголовокДопОбработка"));
		Для Каждого СтрокаТЧ Из ДокОбъект.ДопОбработки Цикл
			Если СтрокаТЧ.ВидДопОбработки=Справочники.ВидыДопОбработки.БезОбработки Тогда Продолжить КонецЕсли; 
			
			ОблСтрока=Макет.ПолучитьОбласть("СтрокаДопОбработки");		
			ОблСтрока.Параметры.Заполнить(СтрокаТЧ);
			
			ОблСтрока.Параметры.ВидДопОбработки = ?(Пустаястрока(строкаТЧ.ВидДопОбработки.Описание) ,строкаТЧ.ВидДопОбработки,СтрокаТЧ.ВидДопОбработки.Описание);
			
			
			ТабДок.Вывести(ОблСтрока);			
		КонецЦикла;	
	КонецЕсли;
	
	ОблШапка	= Макет.ПолучитьОбласть("Шапка");
	
	ТабДок.Вывести(ОблШапка);
	
	ТШК=ПолучитьШтрихКоды(ДокОбъект.Товары);
	
	Сч=0;
	
	//нечаева 03,07,14 добавила кцн++
	//16,07,14 +++ нечаева
	ТекДокумент=ДокОбъект;
	ТК=ПолучитьТаблицуНакладной(ДокОбъект);               
	//16,07,14 --- нечаева
	//нечаева 03,07,14 добавила кцн--
	
	
	Для Каждого СтрокаТоваров Из ТК Цикл
		Если СтрокаТоваров.Количество=0 Тогда Продолжить КонецЕсли; 
		
		СтрокаТШК=ТШК.Найти(СтрокаТоваров.Номенклатура,"Номенклатура");
		Если СтрокаТШК=Неопределено Тогда
			СтрокаТШК=ТШК.Добавить();			
			СтрокаТШК.Номенклатура=СтрокаТоваров.Номенклатура;
		КонецЕсли; 
		
		Сч=Сч+1;
		
		ОблСтрока	= Макет.ПолучитьОбласть("Строка");
		
		ОблСтрока.Параметры.Сч=Сч;
		
		ОблСтрока.Параметры.Заполнить(СтрокаТоваров);					
		ОблСтрока.Параметры.Заполнить(СтрокаТоваров.Номенклатура);		
		ОблСтрока.Параметры.ШтрихКод=СтрокаТШК.ШтрихКод;
		
		ТабДок.Вывести(ОблСтрока);		
	КонецЦикла; 
	
	// нечаева ++
	Если ВидДокумента="ПродажаИМ" Тогда
		
		Для Каждого СтрокаТоваров Из ДокОбъект.Услуги Цикл
			//Если СтрокаТоваров.Количество=0 Тогда Продолжить КонецЕсли; 
			
			СтрокаТШК=ТШК.Найти(СтрокаТоваров.Номенклатура,"Номенклатура");
			Если СтрокаТШК=Неопределено Тогда
				СтрокаТШК=ТШК.Добавить();			
				СтрокаТШК.Номенклатура=СтрокаТоваров.Номенклатура;
			КонецЕсли; 
			
			Сч=Сч+1;
			
			ОблСтрока	= Макет.ПолучитьОбласть("Строка");
			
			ОблСтрока.Параметры.Сч=Сч;
			
			ОблСтрока.Параметры.Заполнить(СтрокаТоваров);					
			ОблСтрока.Параметры.Заполнить(СтрокаТоваров.Номенклатура);		
			ОблСтрока.Параметры.ШтрихКод=СтрокаТШК.ШтрихКод;
			ОблСтрока.Параметры.Количество=0;
			
			ТабДок.Вывести(ОблСтрока);		
		КонецЦикла; 
		
		ОблПодвал	= Макет.ПолучитьОбласть("ПодвалИМ");
		ОблПодвал.Параметры.Сч=Сч;
		ОблПодвал.Параметры.Количество	=ДокОбъект.Товары.Итог("Количество");
		
		ОблПодвал.Параметры.Всего		=ДокОбъект.Товары.Итог("Всего")+ДокОбъект.Услуги.Итог("Всего");
		
		//крохин начало 06.03.2012
		//есть ещё оплата сертификатом
		//ОблПодвал.Параметры.ВсегоКОплате=ДокОбъект.Товары.Итог("Всего")+ДокОбъект.Услуги.Итог("Всего")-ДокОбъект.СуммаБонуса;
		ОблПодвал.Параметры.СуммаОплатыСертификатом = ДокОбъект.СуммаОплатыСертификатом;
		ОблПодвал.Параметры.ВсегоКОплате=ДокОбъект.Товары.Итог("Всего")+ДокОбъект.Услуги.Итог("Всего")-ДокОбъект.СуммаБонуса-ДокОбъект.СуммаОплатыСертификатом;
		//крохин конец 06.03.2012
		ОблПодвал.Параметры.СуммаБонуса	=ДокОбъект.СуммаБонуса;
		
		
	Иначе
		
		
		ОблПодвал	= Макет.ПолучитьОбласть("Подвал");
		ОблПодвал.Параметры.Сч=Сч;
		ОблПодвал.Параметры.Количество	=ДокОбъект.Товары.Итог("Количество");
		
		ОблПодвал.Параметры.Всего		=ТК.Итог("Всего");
		
		
		
		
	КонецЕсли;
	
	// Нечаева ----
	
	
	ТабДок.Вывести(ОблПодвал);		
	
	ВывестиКонтрольнуюИнформациюВВыходнуюТаблицуН(ДокОбъект,ТабДок,ПолучитьМакет("Накладная"));
	
	
	ТабДок.ИмяПараметровПечати	= "ПараметрыПечати_"+ДокОбъект.Метаданные().Имя+"_"+ВидДокумента;
	ТабДок.ОтображатьСетку 		= Ложь;	
	ТабДок.ОтображатьЗаголовки 	= Ложь;
	
	Возврат ТабДок;
	
	
	
КонецФункции // Печать()

//вывод контрольной информации в печ. форму для сравнения спецификаций
Процедура ВывестиКонтрольнуюИнформациюВВыходнуюТаблицуН(ДокОбъект,Таб,Макет) Экспорт	
	Если Константы.НеВыводитьКонтрольнуюИнформациюПриПечати.Получить() Тогда Возврат КонецЕсли;
	
	МетаДок=ДокОбъект.Метаданные();
	
	ПараметрыШапки=Новый Структура;
	
	Вид80=ДокОбъект.Метаданные().Имя;
	Если Вид80="РасходнаяНакладная" Тогда
		Вид77=?(ДокОбъект.ВидОплаты=Перечисления.ВидыОплаты.НАЛ,"РасходнаяНАЛ","РасходнаяБН");
	Иначе
		Вид77=Вид80;			
	КонецЕсли; 
	
	ПараметрыШапки.Вставить("Вид77",Вид77);
	ПараметрыШапки.Вставить("Номер",ДокОбъект.Номер);
	ПараметрыШапки.Вставить("Дата",	ДокОбъект.Дата);
	
	Если ЕстьРеквизитДокумента("ДатаОтгрузки",МетаДок) Тогда
		ПараметрыШапки.Вставить("ДатаОтгрузки",	ДокОбъект.ДатаОтгрузки);		
	КонецЕсли; 
	
	Если ЕстьРеквизитДокумента("Контрагент",МетаДок) Тогда
		ПараметрыШапки.Вставить("КонтрагентНаименование",	ДокОбъект.Контрагент.Наименование);	
		ПараметрыШапки.Вставить("КонтрагентКод",			ДокОбъект.Контрагент.Код);
	КонецЕсли;
	
	ПараметрыШапки.Вставить("СкладНаименование",		ДокОбъект.Склад.Наименование);
	ПараметрыШапки.Вставить("СкладКод",					ДокОбъект.Склад.Код);	
	Если ЕстьРеквизитДокумента("Организация",ДокОбъект.Метаданные()) Тогда
		попытка
			ПараметрыШапки.Вставить("ОрганизацияНаименование",	ДокОбъект.Организация.Наименование);
		исключение
			ПараметрыШапки.Вставить("ОрганизацияНаименование",	Справочники.Организации.НайтиПоКоду("SS-001"));
		КонецПопытки;
	КонецЕсли;	
	
	Обл_Шапка=Макет.ПолучитьОбласть("Контроль_Шапка");
	Обл_Шапка.Параметры.Заполнить(ПараметрыШапки);
	
	НачСтрока=Таб.ВысотаТаблицы+1;
	
	Таб.Вывести(Обл_Шапка);
	
	Для Каждого СтрокаТЧ Из ДокОбъект.Товары  Цикл
		ОблСтрока=Макет.ПолучитьОбласть("Контроль_Строка");
		
		ПараметрыСтроки=Новый Структура;
		
		ПараметрыСтроки.Вставить("Код77",		СтрокаТЧ.Номенклатура.Код77);
		ПараметрыСтроки.Вставить("Наименование",СтрокаТЧ.Номенклатура.Наименование);
		ПараметрыСтроки.Вставить("Количество",	СтрокаТЧ.Количество);
		
		Если Вид80<>"ЛистНабора" Тогда
			ПараметрыСтроки.Вставить("Цена",		СтрокаТЧ.Цена);
			ПараметрыСтроки.Вставить("НДС",			СтрокаТЧ.НДС);
			ПараметрыСтроки.Вставить("Всего",		СтрокаТЧ.Всего);		
		КонецЕсли; 
		
		ОблСтрока.Параметры.Заполнить(ПараметрыСтроки);		
		
		Таб.Вывести(ОблСтрока);
	КонецЦикла;
	
	Таб.Область(НачСтрока,,Таб.ВысотаТаблицы).Видимость=Ложь;
КонецПроцедуры

Функция ПолучитьШтрихКоды(ТЧ)
	Номенклатура=ТЧ.ВыгрузитьКолонку("Номенклатура");
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ШтрихКоды.Владелец КАК Номенклатура,
	|	ШтрихКоды.Наименование КАК ШтрихКод
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.Владелец В(&Номенклатура)
	//крохин начало 22.09.2015
	//все 9 - служебный ШК, не для печати
	|	И ШтрихКоды.Наименование <> ""9999999999999""	
	//крохин конец 22.09.2015
	|	И ШтрихКоды.ТипШК = &ТипШК
	|	И ШтрихКоды.ВидШК = &ВидШК";
	
	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ТипШК",Перечисления.ТипыШтрихКодов.Штука);
	Запрос.УстановитьПараметр("ВидШК",Перечисления.ВидыШК.Основной);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // ПолучитьШтрихКоды()
//21,09,23--

//-------------------------------------------------------------------------------------------------------------------
//// сделаем отдельно обмен, без обмена с веб сайтом

Процедура Сформировать(ТаблицаПараметров=НЕОПРЕДЕЛЕНО) Экспорт

	
	
	
	
	ЗаписатьВЛог("b2b","++Начало выполнения. Задача: Выгрузка файлов отгрузок. !","Информация");
	
	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	
		
	Если ТаблицаПараметров<>Неопределено Тогда
		Параметры=Новый Соответствие;
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
			ЗаписатьВЛог("b2b","++Параметр: "+СтрокаТП.Имя+" - "+СтрокаТП.Значение,"Информация");		
			Параметры.Вставить(СтрокаТП.Имя,СтрокаТП.Значение);
		КонецЦикла;	
	КонецЕсли;
	
	//++Данилова Е.В. 11.09.2024
	ФлагТестовойВыгрузки = Параметры.Получить("Тест");
	ФлагТестовойВыгрузки = ?(ФлагТестовойВыгрузки = неопределено,ложь,ФлагТестовойВыгрузки);
	//--Данилова Е.В. 11.09.2024
	

	//Кухарь А.Ю. 31.03.2026 начало
	// Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом 
	Если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() 
		//Кухарь А.Ю. 31.03.2026 конец
		//++Данилова Е.В. 11.09.2024
		И ФлагТестовойВыгрузки <> Истина Тогда    
		//--Данилова Е.В. 11.09.2024         
		ЗаписатьВЛог("b2b","++Отмена выполнения. Задача: Выгрузка файлов отгрузок. Автообмен разрешен для базы: """+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
		Возврат;
	КонецЕсли;
	
	ЗаписатьВЛог("b2b","++Начало выполнения. Задача: Выгрузка файлов отгрузок. !","Информация");                     
	
	Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
		
		
		// нечаева 04,10,23+++ проверим, что нет блокировки обмена. иначе сбивает загрузку заказов
		КодОбмена = "b2b_zakaz";
					
		НаборЗаписей = РегистрыСведений.БлокировкаОбменов_b2b.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.НаименованиеОбмена.Установить(КодОбмена);
		НаборЗаписей.Отбор.Заблокирован.Установить(истина);
		Наборзаписей.Прочитать();
	    Выгр =наборзаписей.Выгрузить();
		Если Выгр.Количество()>0 ТОгда
			
			Если Выгр[0].Заблокирован =Истина Тогда
				ЗаписатьВЛог("b2b"," Отмена выполнения. Задача: обмен заказами  !!!! Обмен заблокирован, ждем окончания предыдущего, текущий не выполнен.","Информация");
				ЗаписатьВЛог("b2b","........Конец выполнения всех обменов (для отмены). Задача:  Обмен заказами. !","Информация");  
				возврат;
			Иначе
				НоваяЗапись = РегистрыСведений.БлокировкаОбменов_b2b.СоздатьМенеджерЗаписи();
				НоваяЗапись.НаименованиеОбмена = КодОбмена;
				НоваяЗапись.Заблокирован = истина;
				НоваяЗапись.Записать(Истина);

			КонецЕсли;
		иначе
			
			НоваяЗапись = РегистрыСведений.БлокировкаОбменов_b2b.СоздатьМенеджерЗаписи();
			НоваяЗапись.НаименованиеОбмена = КодОбмена;
			НоваяЗапись.Заблокирован = истина;
			
			НоваяЗапись.Записать(Истина);
					
			
		КонецЕсли;

		
		НомерНастройки = параметры.Получить("НомерНастройки");
		ЗаписатьВЛог("b2b","++ном "+НомерНастройки,"Информация");
		//++Данилова Е.В. 11.09.2024
		//ВыгрузитьДанные(); //
		ВыгрузитьДанные(ФлагТестовойВыгрузки); 
		//--Данилова Е.В. 11.09.2024
			
	КонецЕсли;
	// разблокируем обмен.
	
	// разблокируем обмен. удалить запись;
	НоваяЗапись = РегистрыСведений.БлокировкаОбменов_b2b.СоздатьМенеджерЗаписи();
    НоваяЗапись.НаименованиеОбмена = КодОбмена;
	НоваяЗапись.Заблокирован = истина;
    НаборЗаписей.Записать();
	// нечаева 04,10,23----

	
	// теперь пропишем у уже загруженных заказов кода
	ЗаписатьВЛог("b2b","++Конец выполнения. Задача: Выгрузка файлов отгрузок. !","Информация");                     
	

	
	
	
	
			
КонецПроцедуры


ТипЦен=Справочники.ТипыЦен.НайтиПоКоду("SSP-0301");





//////////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ


мКаталогВременныхФайлов="С:\1c_obmen\";

ПрефиксУзлаCML	   = "CMLУзел.";
ПрефиксАтрибутаCML = "CMLАтрибут.";
НачалоЭлементаCML  = "CMLНачалоЭлемента";
КонецЭлементаCML   = "CMLКонецЭлемента";

мПодкаталогФайлов 			 	    	= "import_files";
мПодкаталогБезопасностиКаталогаВыгрузки = "1cbitrix";

ПараметрЗапросаHTTP_Инициализация       	  = "&mode=init";
ПараметрЗапросаHTTP_ПередачаФайла       	  = "&mode=file&filename=";
ПараметрЗапросаHTTP_ИмпортФайлаСервером		  = "&mode=import&filename=";
ПараметрЗапросаHTTP_ПолучитьДанные	    	  = "&mode=query"; 
ПараметрЗапросаHTTP_УспешноеЗавершениеИмпорта = "&mode=success";

ОтветСервера_ZIPРазрешен							= "zip=yes";
ОтветСервера_ОграничениеРазмераФрагментаФайлаОбмена = "file_limit=";
ОтветСервера_УспешноеЗавершениеТекущейОперации 		= "success";
ОтветСервера_АварийноеЗавершениеТекущейОперации		= "failure";
ОтветСервера_ВыполнениеТекущейОперации 				= "progress";

ПустаяХарактеристикаСсылка = Неопределено; //Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
НаименованиеНалога 			= "НДС";

БулевоЗначениеCML_Истина 	= "true";
БулевоЗначениеCML_Да = "Да";

ТипНоменклатурыCML_Услуга 	= "Услуга";
ТипНоменклатурыCML_Товар  	= "Товар";
ЗначениеCML_ТипНоменклатуры = "ТипНоменклатуры";

мСоответствиеНаименованийКатегорийДокумента = Новый Соответствие;
мСоответствиеНаименованийКатегорийДокумента.Вставить("Заказ оплачен"	 , Справочники.КатегорииОбъектов.СостояниеЗаказаНаWEBСайтеОплачен);
мСоответствиеНаименованийКатегорийДокумента.Вставить("Доставка разрешена", Справочники.КатегорииОбъектов.СостояниеЗаказаНаWEBСайтеДоставкаРазрешена);
мСоответствиеНаименованийКатегорийДокумента.Вставить("Финальный статус"	 , Справочники.КатегорииОбъектов.СостояниеЗаказаНаWEBСайтеЗавершен);
мСоответствиеНаименованийКатегорийДокумента.Вставить("Отменен"	         , Справочники.КатегорииОбъектов.СостояниеЗаказаНаWEBСайтеОтменен);

ПостроительЗапроса = Новый ПостроительЗапроса;


мКоэффициентПересчетаВесаТоваровВГраммыДляОбменаССайтом = 1;

//мКоэффициентПересчетаВесаТоваровВГраммыДляОбменаССайтом = Константы.КоэффициентПересчетаВесаТоваровВГраммыДляОбменаССайтом.Получить();
//Если НЕ ЗначениеЗаполнено(мКоэффициентПересчетаВесаТоваровВГраммыДляОбменаССайтом) Тогда
//	мКоэффициентПересчетаВесаТоваровВГраммыДляОбменаССайтом = 1;
//КонецЕсли;

тСписокДокументовНаОтправку = Новый ТаблицаЗначений;

тСписокДокументовНаОтправкуОтгрузки = Новый ТаблицаЗначений;


Рубли=Константы.НациональнаяВалюта.Получить();
КэшОстатков=Новый Соответствие;	

КритичОшибки= Новый массив;
ПРиКрОш=Ложь;

ТзЦвет=Новый ТаблицаЗначений;
ТзЦвет.Колонки.Добавить("Цвет");




