Процедура ФР_СсылочныйОбъект_ПередЗаписью(Источник, Отказ) Экспорт
	Источник.ДополнительныеСвойства.Вставить("Модифицированность",Источник.Модифицированность());	
КонецПроцедуры

Процедура ФР_СсылочныйОбъект_ПриЗаписи(Источник, Отказ) Экспорт
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	Если НЕ ОбщегоНазначения_ПИ.РасширениеИспользуется("Франчайзинг") Тогда Возврат КонецЕсли; 
	//+ASU-1896 20241226 Михайловский
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.ШтрихкодыУпаковокТоваров")  Тогда
		Возврат; 
	КонецЕсли;
	//-ASU-1896 20241226 Михайловский  
	//+Проблемы перехода 18-26 20250404 Михайловский
	//Модуль_ФР_ОбщегоНазначения_ПИ=Вычислить("ФР_ОбщегоНазначения_ПИ"); 
	//это в попытку 
	Попытка
		Если ФР_ОбщегоНазначения_ПИ.ТипУчавствуетВОбмене(Источник.Метаданные().ПолноеИмя()) Тогда
			//Иногда нужно пропустить регистрацию
			Если Источник.ДополнительныеСвойства.Свойство("НеРегистрировать") Тогда Возврат КонецЕсли;
			
			Модифицированность	= Ложь;	
			Если Источник.ДополнительныеСвойства.Свойство("Модифицированность",Модифицированность) И Модифицированность Тогда
				//Валетов + 29.10.2024  Загрузка ХКМ Приемки в возврата из розницы.
				//Поменял условие чтоб было меньше обращений через точки.
				// Сначала убедимся что проводится, ХКМ ИЛИ НЕТ
				Если НЕ ТипЗнч(Источник) = Тип("ДокументОбъект.ХранилищеКодовМаркировки")  Тогда
					// Поменял условие регистрации, падало при записи Заказа и РНК // Шворобей ВЮ 23.10.2024
					//Если (Источник.ДополнительныеСвойства.Свойство("ПараметрыЗагрузки") И Источник.ДополнительныеСвойства.ПараметрыЗагрузки.Свойство("Отправитель") 					
					//	И ЗначениеЗаполнено(Источник.ДополнительныеСвойства.ПараметрыЗагрузки.Отправитель)
					//	И Источник.ДополнительныеСвойства.ПараметрыЗагрузки.Отправитель.Наименование = "ЦО ФР") Тогда
					//Иначе
					//	РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьОбъект(Источник.Ссылка);
					//КонецЕсли;
					РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьОбъект(Источник.Ссылка);
				ИначеЕсли ВРег(Источник.КодУзлаСоздания) = "OD7" ИЛИ Врег(Источник.КодУзлаСоздания) = "SNL" Тогда //Если ХКМ, то смотрим где создан
					//Валетов+ 31,05,2025 если нет регистра валится с ошибкой  
					Если Метаданные.РегистрыСведений.Найти("ФР_ОбъектыКВыгрузке")<>Неопределено Тогда
						РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьОбъект(Источник.Ссылка);
					КонецЕсли;
					//валетов-
				Иначе  // это наш случай, ХКМ из розницы, с ним ничего не делаем
					Возврат;			
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли; 
	Исключение
	КонецПопытки;
	//-Проблемы перехода 18-26 20250404 Михайловский
КонецПроцедуры 

Процедура ФР_Документ_ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	ФР_СсылочныйОбъект_ПередЗаписью(Источник, Отказ);	
КонецПроцедуры

Процедура ФР_РегистрСведений_ПередЗаписью(Источник, Отказ, Замещение) Экспорт
	Источник.ДополнительныеСвойства.Вставить("Модифицированность",Источник.Модифицированность());	
КонецПроцедуры

Процедура ФР_РегистрСведений_ПриЗаписи(Источник, Отказ, Замещение) Экспорт
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	Если НЕ ОбщегоНазначения_ПИ.РасширениеИспользуется("Франчайзинг") Тогда Возврат КонецЕсли; 
	//+Проблемы перехода 18-26 20250404 Михайловский	
	//Модуль_ФР_ОбщегоНазначения_ПИ=Вычислить("ФР_ОбщегоНазначения_ПИ");
	Попытка
		Если ФР_ОбщегоНазначения_ПИ.ТипУчавствуетВОбмене(Источник.Метаданные().ПолноеИмя()) Тогда
			Модифицированность	= Ложь;	
			Если Источник.ДополнительныеСвойства.Свойство("Модифицированность",Модифицированность) И Модифицированность Тогда
				//+HELP-6073 HELP-5909 20251017 Михайловский
				//РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьОбъект(Источник);	
				Если Источник.Метаданные().ПолноеИмя() = Метаданные.РегистрыСведений.ЦеныНоменклатуры.ПолноеИмя() Тогда
					Попытка  
						МПрайс = Новый Массив;
						Для Каждого СтрИст Из Источник Цикл
							Прайс = СтрИст.Прайс;
							Если ЗначениеЗаполнено(Прайс) И МПрайс.Найти(Прайс) = Неопределено Тогда
								МПрайс.Добавить(Прайс);
							КонецЕсли;	
						КонецЦикла;	
						  
						
						Если МПрайс.Количество() Тогда
							Для Каждого ТПрайс Из МПрайс Цикл
								РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьОбъект(ТПрайс);
							КонецЦикла;	
						КонецЕсли;	
					Исключение
					КонецПопытки;
				ИначеЕсли Источник.Метаданные().ПолноеИмя() = Метаданные.РегистрыСведений.СкидкиНоменклатуры.ПолноеИмя() Тогда
					Попытка
						МДокУС = Новый Массив;
						Для Каждого СтрИст Из Источник Цикл
							ДокУС = СтрИст.Документ;
							Если ЗначениеЗаполнено(ДокУС) И МДокУС.Найти(ДокУС) = Неопределено Тогда
								МДокУС.Добавить(ДокУС);
							КонецЕсли;	
						КонецЦикла;	
						  
						
						Если МДокУС.Количество() Тогда
							Для Каждого ТДокУС Из МДокУС Цикл
								РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьОбъект(ТДокУС);
							КонецЦикла;	
						КонецЕсли;
					Исключение
					КонецПопытки;
				Иначе
					РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьОбъект(Источник);
				КонецЕсли;	
				//-HELP-6073 HELP-5909 20251017 Михайловский
			КонецЕсли;	
		КонецЕсли;
	Исключение
	КонецПопытки;
	//-Проблемы перехода 18-26 20250404 Михайловский
КонецПроцедуры


