
Функция ПроверитьЗаполнениеОбязательныхПолей() Экспорт

	ТекстОшибок = "";
	
	Если НЕ ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда
		ТекстОшибок = ТекстОшибок + Символы.ПС + "Не указан адрес (E-mail) учетной записи.";
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Логин) Тогда
		ТекстОшибок = ТекстОшибок + Символы.ПС + "Не указано имя пользователя для доступа к почтовому серверу.";
	КонецЕсли;

	Если ИспользоватьДляОтправки Тогда
		Если НЕ ЗначениеЗаполнено(SMTPСервер) Тогда
			ТекстОшибок = ТекстОшибок + Символы.ПС + "Не указано имя SMTP сервера.";
		КонецЕсли; 

		Если НЕ ЗначениеЗаполнено(ПортSMTP) Тогда
			ТекстОшибок = ТекстОшибок + Символы.ПС + "Не указан порт SMTP сервера.";
		КонецЕсли;
	КонецЕсли;
	
	IMAP = ЗначениеЗаполнено(IMAPСервер);

	Если ИспользоватьДляПолучения Тогда
		Если IMAP Тогда
			Если НЕ ЗначениеЗаполнено(IMAPСервер) Тогда
				ТекстОшибок = ТекстОшибок + Символы.ПС + "Не указано имя IMAP сервера.";
			КонецЕсли; 
		Иначе
			Если НЕ ЗначениеЗаполнено(POP3Сервер) Тогда
				ТекстОшибок = ТекстОшибок + Символы.ПС + "Не указано имя POP3 сервера.";
			КонецЕсли; 

			Если НЕ ЗначениеЗаполнено(ПортPOP3) Тогда
				ТекстОшибок = ТекстОшибок + Символы.ПС + "Не указан порт POP3 сервера.";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СокрЛП(ТекстОшибок);

КонецФункции


