Функция СоздатьСФНаАванс(пОбработки = Неопределено)
	ДЗР = Константы.ДатаЗапретаРедактирования.Получить();
	Если НЕ ЗначениеЗаполнено(ДЗР) Тогда
		ДЗР = КонецДня('20251231');	
	КонецЕсли;
	
	Дата1 = МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "Дата1", ДЗР);
	Дата2 = МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "Дата2", ТекущаяДата());
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Регистратор,
	|	Договор,
	|	ДокументРасчетов,
	|	СуммаВал	
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыПоДокументамРасчетов КАК Взаиморасчеты
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.СчетФактураНаАванс.Авансы КАК Авансы
	|ПО	
	|	Авансы.ДокументОснование = Взаиморасчеты.ДокументРасчетов
	|ГДЕ
	|	Взаиморасчеты.Период МЕЖДУ &Дата1 И &Дата2
	|	И ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ДокументРасчетов ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет
	|	И СуммаВал > 0
	|	И Авансы.ДокументОснование ЕСТЬ NULL
	|";
	
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Дата2));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
			
	КонецЦикла;
КонецФункции //СоздатьСФНаАванс(пОбработки = Неопределено)

