#Область СобытияДокумента

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);	
	
	Дата 	= ТекущаяДата();	
	Валюта	= ОбщегоНазначения_ПИ.ВалютаНац();	
	Автор	= ПараметрыСеанса.Пользователь;
	
	мДокОснование = Неопределено;
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		мДокОснование 	= МаркировкаКС.ПолучитьЗначениеПараметра(ДанныеЗаполнения, "ДокОснование");
		Сумма			= МаркировкаКС.ПолучитьЗначениеПараметра(ДанныеЗаполнения, "Сумма");
		СтавкаНДС		= МаркировкаКС.ПолучитьЗначениеПараметра(ДанныеЗаполнения, "СтавкаНДС", Перечисления.СтавкиНДС.СтавкаНДСПоУмолчанию(Дата));
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипДанныхЗаполнения) Тогда
		мДокОснование = ДанныеЗаполнения;		
	КонецЕсли;	
	
	ДокументОснование   = мДокОснование;
	
	ТипОснования = ТипЗнч(ДокументОснование);
	
	Если ТипОснования = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда		
		Сумма = ПолучитьСуммаАвансаПоПП(ДокументОснование);
	Иначе                                                  
		Сумма = ПолучитьСуммаАвансаПоРегистратору(ДокументОснование);		
	КонецЕсли;
	
	ТипОснования = ТипЗнч(мДокОснование);	
	
	Если ТипОснования = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
		ДокументОснование	= мДокОснование;
		
		ВидСчетаФактуры		= Перечисления.ВидСчетаФактурыВыставленного.НаАванс;		
		
		рШапки = ПолучитьРеквизитыШапки(ДокументОснование, "Дата,Организация,Контрагент,Договор,НомерВходящегоДокумента,ДатаВходящегоДокумента");
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, рШапки);	
		
		НомерПлатежноРасчетногоДокумента	= рШапки.НомерВходящегоДокумента;
		ДатаПлатежноРасчетногоДокумента		= рШапки.ДатаВходящегоДокумента;
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		ДокументОснование	= мДокОснование;
		
		ВидСчетаФактуры		= Перечисления.ВидСчетаФактурыВыставленного.НаАванс;		
		
		рШапки = ПолучитьРеквизитыШапки(ДокументОснование, "Дата,Организация,Контрагент,Договор,Номер");
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, рШапки);	
		
		НомерПлатежноРасчетногоДокумента	= рШапки.Номер;
		ДатаПлатежноРасчетногоДокумента		= рШапки.Дата;	
		// Кухарь А.Ю. 09.06.2026 начало     
		//Наряд 0000001116
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.РекламационнаяНакладная") Тогда
		ДокументОснование	= мДокОснование;	
		
		рШапки = ПолучитьРеквизитыШапки(ДокументОснование, "Корреспондент,Договор");
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, рШапки);
		Контрагент = рШапки.Корреспондент;
		// Кухарь А.Ю. 09.06.2026 конец		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтавкаНДС) Тогда
		СтавкаНДС	= Перечисления.СтавкиНДС.СтавкаНДСПоУмолчанию(Дата);		
	КонецЕсли;
		
	ПроцентНДС	= 100*ПроцентНДСпоСтавке(СтавкаНДС); //Вот такая волшебная функция
	СуммаНДС 	= Сумма*ПроцентНДС/(100 + ПроцентНДС);
	
	Авансы.Очистить();
		
	СтрокаА = Авансы.Добавить();
	
	СтрокаА.ДокументОснование   = ДокументОснование;
	СтрокаА.Контрагент 			= Контрагент;
	СтрокаА.СтавкаНДС			= СтавкаНДС;
	СтрокаА.Сумма				= Сумма;
	СтрокаА.СуммаНДС	 		= СуммаНДС;
	СтрокаА.Содержание			= "Предоплата";
	
	СтрокаА.НомерПлатежноРасчетногоДокумента	= НомерПлатежноРасчетногоДокумента;
	СтрокаА.ДатаПлатежноРасчетногоДокумента		= ДатаПлатежноРасчетногоДокумента;		
	
	ПлатежноРасчетныеДокументы.Очистить();
	
	СтрокаПРД = ПлатежноРасчетныеДокументы.Добавить();                           
	
	СтрокаПРД.НомерДокумента	= НомерПлатежноРасчетногоДокумента;
	СтрокаПРД.ДатаДокумента		= ДатаПлатежноРасчетногоДокумента;
	
	Выставлен   	= Истина;       
	ДатаВыставления = Дата;
	
	ОтветственныеЛица = ОтветственныеЛица(Организация, Дата);
	
	Руководитель		= МаркировкаКС.ПолучитьЗначениеПараметра(ОтветственныеЛица, "Руководитель");
	ГлавныйБухгалтер	= МаркировкаКС.ПолучитьЗначениеПараметра(ОтветственныеЛица, "ГлавныйБухгалтер");	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Модифицированность() Тогда
		ДатаИзменения = ТекущаяДата();
		
		Сумма 		= Авансы.Итог("Сумма");		
		СуммаНДС	= Авансы.Итог("СуммаНДС");
	КонецЕсли;
	Если ЭтоНовый() Тогда
		ДатаСоздания = ТекущаяДата();	
	КонецЕсли;
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если ЗначениеЗаполнено(Организация) Тогда
		Префикс = СокрЛП(Организация.Префикс);
	КонецЕсли;
	Префикс = Символ(КодСимвола("A") + Число(Прав(""+Год(ТекущаяДата()), 1)-1)) + "-" + Формат(Дата, "ДФ=ММдд") + "-";
КонецПроцедуры //ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)

#КонецОбласти

Функция ПолучитьСуммаАвансаПоПП(ППВход)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СУММА(Взаиморасчеты.СуммаВал) КАК Сумма	
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыПоДокументамРасчетов КАК Взаиморасчеты
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ППВход
	|ПО 
	|	Взаиморасчеты.Регистратор 			= ППВход.ДокОснование
	|	И Взаиморасчеты.ДокументРасчетов	= ППВход.Ссылка		 
	|ГДЕ
	|	ППВход.Ссылка = &ППВход
	|	И Взаиморасчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Взаиморасчеты.СуммаВал > 0	
	|";
	
	Запрос.УстановитьПараметр("ППВход", ППВход);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = 0;
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Сумма) Тогда
		Результат = Выборка.Сумма;	
	КонецЕсли;                     
	
	Возврат Результат;
КонецФункции //ПолучитьСуммаАвансаПоПП(ППВход)

Функция ПолучитьСуммаАвансаПоРегистратору(Регистратор)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СУММА(СуммаВал) КАК Сумма	
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыПоДокументамРасчетов	
	|ГДЕ	
	|	Регистратор = &Регистратор
	|	И ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И СуммаВал > 0	
	|";
	
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = 0;
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Сумма) Тогда
		Результат = Выборка.Сумма;	
	КонецЕсли;                     
	
	Возврат Результат;
КонецФункции //ПолучитьСуммаАвансаПоРегистратору(ПКО)

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	НеПроверяемыеРеквизиты = Новый Массив;
	
	Если Исправление Тогда
		ПроверяемыеРеквизиты.Добавить("НомерИсправления");
		
		ПроверяемыеРеквизиты.Добавить("НомерИсходногоДокумента");
		ПроверяемыеРеквизиты.Добавить("ДатаИсходногоДокумента");		
	КонецЕсли;		
КонецПроцедуры
