
Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим) Экспорт
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Если ТекСтрокаТовары.Отправлено <> ТекСтрокаТовары.Принято Тогда
			Движение = Движения.РасхожденияПоАкту.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.РНК = РНК;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Отправлено = ТекСтрокаТовары.Отправлено;
			Движение.Принято = ТекСтрокаТовары.Принято;
		КонецЕсли;
	КонецЦикла;
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		// Заполнение шапки
		ДатаЗаказа = Основание.ДатаЗаказа;
		Контрагент = Основание.Контрагент;
		НомерЗаказа = Основание.НомерЗаказа;
		ПунктДоставки = Основание.ПунктДоставки;
		Склад = Основание.Склад;
		Организация = Основание.Организация;
		РНК = Основание.Ссылка;
		Для Каждого ТекСтрокаТовары Из Основание.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Заказано = ТекСтрокаТовары.Заявка;
			НоваяСтрока.Отправлено = ТекСтрокаТовары.Количество;
			НоваяСтрока.Принято = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//Катаев+ 09/04/13
	//Если ЭтотОбъект.Проведен Тогда
	//	Отказ = Истина;
	//КонецЕсли;
	//Катаев- 09/04/13
	// Проверяем наличие РКМ по РНК
	Если РНК <> Документы.РасходнаяНакладная.ПустаяСсылка() Тогда
		//Запрос = Новый Запрос;
		//Запрос.Текст =
		//"ВЫБРАТЬ
		//|	РекламационнаяНакладная.Ссылка
		//|ИЗ
		//|	Документ.РекламационнаяНакладная КАК РекламационнаяНакладная
		//|ГДЕ
		//|	РекламационнаяНакладная.ДокОснование = &РНК";
		//Запрос.УстановитьПараметр("РНК", РНК);
		//Выборка = Запрос.Выполнить().Выбрать();
		//Если Выборка.Следующий() Тогда
		//	Отказ = Истина;
		//КонецЕсли;
	КонецЕсли;
	// Проверяем наличие рассхождений
	СостояниеДокумента1 = Перечисления.СостоянияНакладной.Доставлена;
	СостоянияРКМ1 = Перечисления.СостоянияРКМ.НеТребуется;
	Если Товары.Итог("Отправлено") = Товары.Итог("Принято") Тогда
		Для каждого стр из Товары Цикл
			Если стр.Отправлено <> стр.Принято Тогда
				СостояниеДокумента1 = Перечисления.СостоянияНакладной.Принята;
				СостоянияРКМ1 = Перечисления.СостоянияРКМ.Отсутствует;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		СостояниеДокумента1 = Перечисления.СостоянияНакладной.Принята;
		СостоянияРКМ1 = Перечисления.СостоянияРКМ.Отсутствует;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//Катаев+ 03/12/14 переделал регистрацию в узлах, по причине что и в филиалах акты приемки грузятся
	////Катаев+ 14/02/14 Регистрируем акты приемки в Одинцово1 по Контрагентам которые участвуют в ЭСФ
	////Катаев+ 23/04/14 Регистрацию надо делать только из ЦО
	//Если ПланыОбмена.Основной.ЭтотУзел().Код <> "SNL" Тогда
	//	Возврат;
	//КонецЕсли;
	////Катаев- 23/04/14
	//Если Контрагент.ДатаНачалаЭСФ <> Дата(1,1,1) Тогда
	//	ПланыОбмена.ЗарегистрироватьИзменения(ПланыОбмена.Основной.НайтиПоКоду("ODN"), ЭтотОбъект.Ссылка);
	//КонецЕсли;
	////Катаев- 14/02/14
	
	//+++Чирков 10.09.2029
	//Если ПланыОбмена.Основной.ЭтотУзел().Код = "SNL" Тогда
	//	Если Контрагент.ДатаНачалаЭСФ <> Дата(1,1,1) И Склад.ТипСклада <> Перечисления.ТипСклада.Филиал Тогда
	//		// нечаева 08,02,16+++
	//		ПланыОбмена.ЗарегистрироватьИзменения(ПланыОбмена.Основной.НайтиПоКоду("OD7"), ЭтотОбъект.Ссылка);
	//		// нечаева 08,02,16---
	//	КонецЕсли;
	//ИначеЕсли ПланыОбмена.Основной.ЭтотУзел().Подразделение.ЕстьВыделенныйСклад И Склад.КодФизическогоУзла = ПланыОбмена.Основной.ЭтотУзел().Код Тогда
	//	ПланыОбмена.ЗарегистрироватьИзменения(ПланыОбмена.Основной.НайтиПоКоду("SNL"), ЭтотОбъект.Ссылка);
	//КонецЕсли;            
	
	Если ОбщегоНазначения_ПИ.ЭтоУзел_ЦО() Тогда
		Если Контрагент.ДатаНачалаЭСФ <> Дата(1,1,1) И Склад.ТипСклада <> Перечисления.ТипСклада.Филиал Тогда
			// нечаева 08,02,16+++
			ПланыОбмена.ЗарегистрироватьИзменения(Маркировка_ПИ.УзелПоКоду("OD7", "Основной"), Ссылка);
			// нечаева 08,02,16---
		КонецЕсли;
	Иначе
		мПодразделение = ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла();		
		Если мПодразделение.ЕстьВыделенныйСклад И Склад.КодФизическогоУзла = ОбщегоНазначения_ПИ.ЭтотУзелКод("Основной") Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(Маркировка_ПИ.УзелПоКоду("SNL", "Основной"), Ссылка);
		КонецЕсли;		
	КонецЕсли;	
	//---Чирков 10.09.2029
	
	//Катаев- 03/12/14
КонецПроцедуры
