Процедура ОбработкаПроведения(Отказ, Режим)	
	СписокСкладов=Новый Массив;
	СписокСкладов.Добавить(Склад);
	Для Каждого СтрокаСклада Из Склады Цикл
		СписокСкладов.Добавить(СтрокаСклада.Склад);	
	КонецЦикла; 
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	Для Каждого ТекСтрокаСостав Из Состав Цикл		
		Для Каждого ТекСклад Из СписокСкладов Цикл
			Движение = Движения.Распределение.Добавить();
			Движение.Период		= Дата;
		
			Движение.Склад			= ТекСклад;
			Движение.Номенклатура	= ТекСтрокаСостав.Номенклатура;
			Движение.Процент		= ТекСтрокаСостав.Процент;		
		КонецЦикла;		
	КонецЦикла;	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если Модифицированность() ИЛИ ТипТовара.Пустая() ИЛИ Брэнд.Пустая() ИЛИ ПустаяСтрока(НаименованиеМодели) Тогда
		ТипТовара			=Модель.Родитель.Родитель;
		Брэнд				=Модель.Родитель;
		НаименованиеМодели  =Модель.Наименование;	
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры
