// Катаев+ 19/03/13
Перем мСозданиеНевозможно Экспорт;
// Катаев- 19/03/13
//Катаев+ 06/10/14
Перем НужноВыгружать;
//Катаев- 06/10/14

Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,Записывать=Ложь)
	Для Каждого НаборДвижений Из ДвиженияПоРегистрам Цикл
		ИмяРегистра		=НаборДвижений.Ключ;
		ТаблицаДвижения =НаборДвижений.Значение;
		
		Если Движения.Найти(ИмяРегистра)=Неопределено Тогда Возврат  КонецЕсли; 
		
		НаборЗаписей=Движения[ИмяРегистра];		
		НаборЗаписей.Очистить();
		
		Для Каждого Движение Из ТаблицаДвижения Цикл
			Запись=НаборЗаписей.Добавить();	
			ЗаполнитьЗначенияСвойств(Запись,Движение);	
			
			Запись.Регистратор=Ссылка;
		КонецЦикла;	
		
		Если Записывать Тогда
			НаборЗаписей.Записать();		
		КонецЕсли; 
	КонецЦикла;	
КонецПроцедуры 

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли; 
	
	ЕстьИзменения		= Модифицированность();
	НужноВыгружать		= НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	
	
	Если НЕ ОбменДанными.Загрузка Тогда
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
		
		
		
		Если Отказ Тогда Возврат КонецЕсли; 	
	КонецЕсли;
	
	Если ЕстьИзменения Тогда		
		СуммаДокумента		= Товары.Итог("Всего");
		ОбъемДокумента		= Товары.Итог("Объем");
		КоличествоДокумента = Товары.Итог("Количество");
		
		ГруппыТоваров   	= ГруппыТоваровДокумента(ЭтотОбъект);
	КонецЕсли; 
	
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
		//Катаев+ 08/10/14
		Если Не ЭтотОбъект.Ссылка.Пустая() Тогда
			НужноВыгружать = Ложь;
		КонецЕсли;
		//Катаев- 08/10/14
	КонецЕсли;
	
	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт

	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	Если СостояниеНакладной = Перечисления.СостоянияДляЗаявок.Выполнена Тогда

	ДвиженияПоРегистрам=Неопределено;	
	
	РезультатПроведения=ПроведениеПоРегистрамЗаказыКонтрагентов(Ссылка,ДвиженияПоРегистрам,ОбменДанными.Загрузка);	
	
	Результат=РезультатПроведения["Результат"];
	
	
	Если Не Отказ Тогда
		ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,ОбменДанными.Загрузка);		
	КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание) 	
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	Если Основание=Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;
	
		
	ВидОснования	= Основание.Метаданные().Имя;
		
	ДокОснование	= Основание;
	




	    Контрагент      = ПолучитьРеквизитОбъекта(ДокОснование,"Контрагент"); 
		ПунктДоставки	= ПолучитьРеквизитОбъекта(ДокОснование,"ПунктДоставки");			
		Менеджер 		= ПолучитьРеквизитОбъекта(ДокОснование,"Менеджер");			
		Организация		= ПолучитьРеквизитОбъекта(ДокОснование,"Организация");	
		ТипЦен			= ПолучитьРеквизитОбъекта(ДокОснование,"ТипЦен");
		ТипСкидок		= ПолучитьРеквизитОбъекта(ДокОснование,"ТипСкидок");
		Склад           = ПолучитьРеквизитОбъекта(ДокОснование,"Склад");
		ВидОплаты       = ПолучитьРеквизитОбъекта(ДокОснование,"ВидОплаты");
		ДатаОплаты      = ПолучитьРеквизитОбъекта(ДокОснование,"ДатаОплаты");
	// Катаев- 19/03/13 
	
	//крохин начало 29.01.2013
	//менеджер, для отчета "продажи"
	Менеджер			= ПолучитьРеквизитОбъекта(ДокОснование,"Менеджер");
	//крохин конец 29.01.2013
		
	Комментарий		= ""+ДокОснование.Метаданные()+" № " + ДокОснование.Номер + " от " + Формат(ДокОснование.Дата,"ДФ=dd.MM.yy");		
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказыКонтрагентовОстатки.Контрагент КАК Контрагент,
	               |	ЗаказыКонтрагентовОстатки.Номенклатура КАК Номенклатура,
	               |	ЗаказыКонтрагентовОстатки.Заказ КАК Заказ,
	               |	ЗаказыКонтрагентовОстатки.КоличествоОстаток КАК Количество,
	               |	ЗаказыКонтрагентовОстатки.СуммаОстаток КАК Всего
	               |ИЗ
	               |	РегистрНакопления.ЗаказыКонтрагентов.Остатки(&Дата1, Заказ = &Заказ) КАК ЗаказыКонтрагентовОстатки";
	
	Запрос.УстановитьПараметр("Дата1",ТекущаяДата());
	Запрос.УстановитьПараметр("Заказ",ДокОснование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	//Для Каждого ИсхСтрокаТЧ ИЗ ДокОснование.Товары Цикл
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Количество() = 0 Тогда Продолжить; КонецЕсли;
		
		ИсхСтрокаТЧ = ДокОснование.товары.Найти(Выборка.Номенклатура,"Номенклатура");
		Если ИсхСтрокаТЧ <> Неопределено Тогда
				СтрокаТЧ=Товары.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЧ,ИсхСтрокаТЧ,,"Количество");
			
				СтрокаТЧ.КоличествоИсх	=Выборка.Количество;
				СтрокаТЧ.КоличествоФакт	=0;
				СтрокаТЧ.Количество		=выборка.Количество;				
				
				РассчитатьСуммуТабЧасти(СтрокаТЧ,ЭтотОбъект);		
			Иначе
				
			КонецЕсли;
			
	КонецЦикла;
	
	
КонецПроцедуры


Процедура ПередУдалением(Отказ)
	
	//доработки Чиркова для свертки базы, 04.08.2016 начало
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;	
	//доработки Чиркова для свертки базы, начало 04.08.2016 конец
	
	

КонецПроцедуры

      
Процедура ПриЗаписи(Отказ)
КонецПроцедуры







