
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	рПроверки = ПроверитьДокументыКОбработке(ПараметрКоманды);
	
	Если рПроверки.ОшибкиНоменклатуры.Количество()>0 Тогда
		ФормаОбработки = ПолучитьФорму("Обработка.ПроверкаКарточекДляНК.Форма.Форма", Новый Структура,, 1);
		
		ФормаОбработки.Открыть();
		ФормаОбработки.ВывестиРезультатыПроверки(рПроверки.ОшибкиНоменклатуры, рПроверки.мНоменклатура);
	Иначе		
		Сообщить("Карточки соответствуют требованиям НК.", СтатусСообщения.Информация);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПроверитьДокументыКОбработке(мСсылки)
	Результат 			= Новый Структура("ОшибкиНоменклатуры,ОшибкиДокументов,ДокументыКОбработке", , Новый Массив, Новый Массив);
	
	ОбработкаПроверки 	= Обработки.ПроверкаКарточекДляНК.Создать();
	
	Для Каждого ДокСсылка Из мСсылки Цикл
		тОшибок = ОбработкаПроверки.ПроверитьДанныеТоваровДляМаркировки(ДокСсылка);	
		Если Результат.ОшибкиНоменклатуры = Неопределено Тогда
			Результат.ОшибкиНоменклатуры = тОшибок;
			Результат.Вставить("мНоменклатура", МаркировкаС.ПолучитьНоменклатуруДокумента(ДокСсылка));
		Иначе
			Для Каждого СтрокаИст Из тОшибок Цикл
				СтрокаПол = Результат.ОшибкиНоменклатуры.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПол, СтрокаИст);			
			КонецЦикла; 
		КонецЕсли; 
		
		Если тОшибок.Количество() = 0 Тогда
			Статус = ПолучитьРеквизитШапки(ДокСсылка, "Статус");
			Если ЗначениеЗаполнено(Статус) И Статус <> Перечисления.СтатусыДокументовМаркировки.ВРаботе Тогда
				ТекстОшибки = СтрШаблон("Не допустимый статус док-та: %1, статус: '%2', должен быть: 'В работе'.", ДокСсылка, Статус);
				Результат.ОшибкиДокументов.Добавить(ТекстОшибки);				
			Иначе
				Результат.ДокументыКОбработке.Добавить(ДокСсылка);				
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 	
	
	Возврат Результат;
КонецФункции //ПроверитьДокументыКОбработке(мСсылки)