Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	ЦО = Справочники.Подразделения.НайтиПоКоду("SSP-0001");
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Контрагент,
	|	Договор,
	|	Договор.ВидДоговора_Новый.СтатьяЗатратКР КАК СтатьяЗатратКР,
	|	СуммаВалОстаток КАК СумВал,
	|	СуммаУпрОстаток	КАК СумУпр,
	|	Договор.ВалютаКредита КАК ВалютаРасчетов
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.Остатки(&Дата2) КАК ВзаиморасчетыОстатки";
		
	Запрос.УстановитьПараметр("Дата2",МоментВремени());
	
	ВалютаУпр	=ПараметрыСеанса.ВалютаУпр_2009;
	КурсУпр		=ПолучитьКурсВалюты_ПоРусски(ВалютаУпр,Дата);
	
	КэшКурсов=Новый Соответствие;
	
	Сч=0;	
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВалютаРасчетов	= ?(ЗначениеЗаполнено(Выборка.ВалютаРасчетов),Выборка.ВалютаРасчетов,ПараметрыСеанса.ВалютаНац);
		Курс			= КэшКурсов.Получить(ВалютаРасчетов);
		
		Если Курс=Неопределено Тогда
			Курс=ПолучитьКурсВалюты_ПоРусски(ВалютаРасчетов,Дата);		
			КэшКурсов.Вставить(ВалютаРасчетов,Курс);
		КонецЕсли;
		
		КурсоваяРазница=Выборка.СумУпр-глПересчет(Выборка.СумВал,ВалютаРасчетов,Курс,ВалютаУпр,КурсУпр);
		
		Если КурсоваяРазница<>0 Тогда
			//Взаиморасчеты
			Движение=Движения.Взаиморасчеты.Добавить();
			
			Движение.Период		=Дата;
			
			Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
			Движение.Контрагент	=Выборка.Контрагент;
			Движение.Договор	=Выборка.Договор;	
			
			Движение.СуммаУпр	=КурсоваяРазница;					
			
			Если ЗначениеЗаполнено(Выборка.СтатьяЗатратКР) Тогда
				СтатьяЗатрат	=Выборка.СтатьяЗатратКР;							
			Иначе
				СтатьяЗатрат	=Справочники.СтатьиЗатрат.КурсовыеРазницыКредиторскаяЗадолженность;										
			КонецЕсли;			
			Движение.СтатьяДДС	=СтатьяЗатрат;
			
			//Затраты
			Движение=Движения.Затраты.Добавить();	
			Движение.Период			=Дата;
			Движение.ВидДвижения	=ВидДвиженияНакопления.Приход;
			
			Движение.СтатьяЗатрат	=СтатьяЗатрат;
			Движение.СуммаУпр		=КурсоваяРазница;
			//крохин начало
			Движение.Подразделение = ЦО;
			//крохин конец
			Движение.Контрагент		=Выборка.Контрагент;
			Движение.Договор		=Выборка.Договор;
		//крохин начало
		Движение.Комментарий        = "списание курсовых разниц";
		//крохин конец

		КонецЕсли;
	КонецЦикла; 
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	БанковскийСчет,	
	|	СуммаОстаток 			КАК СумВал,
	|	СуммаУпрОстаток			КАК СумУпр,
	|	Валюта				 	КАК ВалютаРасчетов
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Остатки(&Дата2,)";
	
	Запрос.УстановитьПараметр("Дата2",МоментВремени());
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВалютаРасчетов	= ?(ЗначениеЗаполнено(Выборка.ВалютаРасчетов),Выборка.ВалютаРасчетов,ПараметрыСеанса.ВалютаНац);
		Курс			= КэшКурсов.Получить(ВалютаРасчетов);
		
		Если Курс=Неопределено Тогда
			Курс=ПолучитьКурсВалюты_ПоРусски(ВалютаРасчетов,Дата);		
			КэшКурсов.Вставить(ВалютаРасчетов,Курс);
		КонецЕсли;
		
		КурсоваяРазница=Выборка.СумУпр-глПересчет(Выборка.СумВал,ВалютаРасчетов,Курс,ВалютаУпр,КурсУпр);
		
		Если КурсоваяРазница<>0 Тогда
			Движение=Движения.ДенежныеСредства.Добавить();
			Движение.Период		=Дата;
			
			Движение.ВидДвижения	=ВидДвиженияНакопления.Расход;
			
			Движение.БанковскийСчет	=Выборка.БанковскийСчет;
			Движение.Валюта			=Выборка.ВалютаРасчетов;	
			
			Движение.СтатьяДДС		=Справочники.СтатьиЗатрат.КурсовыеРазницыДС;
			
			Движение.СуммаУпр		=КурсоваяРазница;		
			
			Движение=Движения.Затраты.Добавить();	
			Движение.Период			=Дата;
			Движение.ВидДвижения	=ВидДвиженияНакопления.Приход;
			
			Движение.СтатьяЗатрат	=Справочники.СтатьиЗатрат.КурсовыеРазницыДС;
			Движение.СуммаУпр		=КурсоваяРазница;
		   //крохин начало
			Движение.Подразделение = ЦО;
			//крохин конец
		//крохин начало
		Движение.Комментарий        = "списание курсовых разниц";
		//крохин конец

			
			Движение.Контрагент		=Выборка.БанковскийСчет;			
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры
