
#Область ОписаниеПеременных
Перем СкладДОП;
// Кухарь А.Ю. 24.05.2024 начало
//
 Перем ОткатыватьТранзацию;
// Кухарь А.Ю. 24.05.2024 конец
#КонецОбласти



Процедура ОбработкаПроведения(Отказ, Режим)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		Движение = Движения.ОстаткиТМЦВнешние.Добавить();
		Если КодОперации=перечисления.КодыОперацийОстатки.Реализация или НЕ ЗначениеЗаполнено(КодОперации) тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		иначеесли КодОперации=перечисления.КодыОперацийОстатки.Закупка тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		иначеЕсли  КодОперации=перечисления.КодыОперацийОстатки.Реализация тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		иначе
			Сообщить("Некорректный код операции!");Оказ=ИСТИНА;Возврат;
		Конецесли;
		
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Контрагент=Контрагент;
		Движение.ПокупательКонтрагента = ПокупательКонтрагента;
		
	КонецЦикла;
	
КонецПроцедуры

// Кухарь А.Ю. 22.09.2025 начало    
// ASU-2504
//Процедура РасчитатьДанныеПополнения (РасчитыватьТоварыВПути=Истина) экспорт 
Процедура РасчитатьДанныеПополнения (РасчитыватьТоварыВПути=Истина, ДополнительныеПараметры = Неопределено) экспорт 
	// Кухарь А.Ю. 22.09.2025 конец
	
	
	// Кухарь А.Ю. 19.08.2025 начало
	ТекОрганизация = ПолучитьРеквизитШапки(Договор,"Организация","Справочник");
	#Если Клиент тогда
		если не ЗначениеЗаполнено(ТекОрганизация) тогда 
			Сообщить("Не найдена организация по договору");
		КонецЕсли;
	#КонецЕсли  
	
	Запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	|	ПравилаПополненияСкладовМаркетплейсов.Ссылка КАК Ссылка,
	|	ПравилаПополненияСкладовМаркетплейсов.ДнейТоварногоЗапаса КАК ДнейТоварногоЗапаса,
	|	ПравилаПополненияСкладовМаркетплейсов.КатегорияМаркетПлейсы КАК КатегорияМаркетПлейсы
	|ИЗ
	|	Справочник.ПравилаПополненияСкладовМаркетплейсов КАК ПравилаПополненияСкладовМаркетплейсов
	|ГДЕ
	|	ПравилаПополненияСкладовМаркетплейсов.Контрагент = &Контрагент
	|	И ПравилаПополненияСкладовМаркетплейсов.Организация = &Организация
	|	И не ПравилаПополненияСкладовМаркетплейсов.ПометкаУдаления";     
	запрос.УстановитьПараметр("Организация",ТекОрганизация);  
	запрос.УстановитьПараметр("Контрагент",Контрагент);	
	ТаблицаПравилПоКатегориям = запрос.Выполнить().Выгрузить();
	// Кухарь А.Ю. 19.08.2025 конец
	
	
	ТЗМатрицы=ПолучитьТЗМатриц();   
	если РасчитыватьТоварыВПути тогда

		// Кухарь А.Ю. 22.09.2025 начало  
		// ASU-2504
		//ТЗВПути=ПолучитьТоварыВПути();
		ТЗВПути=ПолучитьТоварыВПути(ДополнительныеПараметры);
		// Кухарь А.Ю. 22.09.2025 конец
		
	КонецЕсли;	
	// Кухарь А.Ю.  09.04.2024 начало
	//	для каждого СтрТЧ из Товары цикл	
	Запрос=новый запрос;
	запрос.Текст="Выбрать * 
	|ПОМЕСТИТЬ ВТ 
	|из 
	|  &ТЗ как Товары 
	|; 
	|Выбрать *
	|, Номенклатура.КатегорияМаркетПлейсы как КатегорияМаркетПлейсы      
	|,Номенклатура.Родитель.ШтукВКоробке как ШтукВКоробкеИзНоменклатуры 
	|из ВТ как ВремТЗ";
	запрос.УстановитьПараметр("ТЗ",Товары);
	ТЗТовары=запрос.Выполнить().Выгрузить();
	для каждого СтрТЧ из ТЗТовары цикл
		// Кухарь А.Ю.  09.04.2024 конец
		
		// Кухарь А.Ю.  17.01.2024 начало
		если СтрТЧ.Количество>0 Тогда
			СтрТЧ.ОборачиваемостьВДнях=30*СтрТЧ.ОстатокКонтрагента/(СтрТЧ.Количество); 
		иначе
			СтрТЧ.ОборачиваемостьВДнях=0;
		КонецЕсли;
		// Кухарь А.Ю.  17.01.2024 конец
		
		Номенклатура=СтрТЧ.Номенклатура;
		СтрМатрицы=ТЗМатрицы.найти(Номенклатура);
		если РасчитыватьТоварыВПути тогда
			СтрВПути=ТЗВПути.найти(Номенклатура);
			Если СтрВПути=Неопределено тогда
				СтрТЧ.ВПути=0;
			иначе
				СтрТЧ.ВПути=СтрВПути.Количество;
			КонецЕсли;
		КонецЕсли;
		
		если СтрМатрицы=Неопределено тогда
			СтрТЧ.НедостающееКоличество=0;
			СтрТЧ.КОтгрузке=0;
			СтрТЧ.СпособПоставки=Перечисления.СпособПоставкиКонтрагенту.Микс;
			Продолжить;		
		иначе					
			//Михайловский С. 20230314 +++
			СтрТЧ.ПунктДоставки=СтрМатрицы.ПунктДоставки;
			//Михайловский С. 20230314 ---
			
			если СтрМатрицы.МинимальныйОстатокВДнях=0 и СтрТЧ.КоличествоПлан = 0 тогда
				СтрТЧ.НедостающееКоличество=0;
				СтрТЧ.КОтгрузке=0;
				//СтрТЧ.СпособПоставки=Перечисления.СпособПоставкиКонтрагенту.Микс;
				Продолжить;
			иначе			
			КонецЕсли;	
			ЗаполнитьЗначенияСвойств(СтрТЧ,СтрМатрицы);
		КонецЕсли;		
		
		если не ЗначениеЗаполнено(СтрТЧ.СпособПоставки) тогда
			СтрТЧ.СпособПоставки=Перечисления.СпособПоставкиКонтрагенту.Микс;
		КонецЕсли;             
		
		//Кухарь А.Ю. 01.08.2025 начало
		//HELP-6284 
		если СтрТЧ.КоличествоПлан>0 тогда      
			если ЗначениеЗаполнено(СтрТЧ.КатегорияМаркетПлейсы) тогда   
				Категория=СтрТЧ.КатегорияМаркетПлейсы;
			Иначе
				Категория=Неопределено;
			КонецЕсли;             
			
			
			
			// Кухарь А.Ю. 19.08.2025 начало  
			//если Категория = Перечисления.КатегорииABC.A тогда
			//	КоличествоДнейПоКатегории = 30;
			//ИначеЕсли Категория = Перечисления.КатегорииABC.B тогда 
			//	КоличествоДнейПоКатегории = 21;   
			//ИначеЕсли Категория = Перечисления.КатегорииABC.C тогда 
			//	КоличествоДнейПоКатегории = 14;			
			//Иначе  
			//	КоличествоДнейПоКатегории = 0;  
			//КонецЕсли;     
			СтрокаПравилКатегории = ТаблицаПравилПоКатегориям.Найти(Категория,"КатегорияМаркетПлейсы");
			если СтрокаПравилКатегории = Неопределено тогда  
				КоличествоДнейПоКатегории = 0;
			иначе 
				КоличествоДнейПоКатегории = СтрокаПравилКатегории.ДнейТоварногоЗапаса
			КонецЕсли;			 
			// Кухарь А.Ю. 19.08.2025 конец
			
			
			СтрТЧ.НедостающееКоличество=Макс(0,КоличествоДнейПоКатегории*(СтрТЧ.КоличествоПлан/30)-СтрТЧ.ВПути-СтрТЧ.ОстатокКонтрагента);   
			
			ШтукВКоробке =СтрМатрицы.КратностьКоробки;
			если ШтукВКоробке = 0 тогда
				ШтукВКоробке = СтрТЧ.ШтукВКоробкеИзНоменклатуры;
			КонецЕсли;

			
			если СтрТЧ.НедостающееКоличество>0 и ШтукВКоробке > 0 тогда  
				КолТары=СтрТЧ.НедостающееКоличество/ШтукВКоробке;
				если Цел(КолТары)<>КолТары тогда
					КолТары=Цел(КолТары)+1;
				КонецЕсли;   
				СтрТЧ.КОтгрузке=КолТары*ШтукВКоробке; 
				
				// Кухарь А.Ю. 22.09.2025 начало
				// ASU-2504
				если СтрТЧ.КОтгрузке>0 тогда
					если ШтукВКоробке>0 тогда
						СтрТЧ.КоробокКОтгрузке=СтрТЧ.КОтгрузке/ШтукВКоробке;
					КонецЕсли;
				КонецЕсли;			
				// Кухарь А.Ю. 22.09.2025 конец
				
		
			иначе
				СтрТЧ.КОтгрузке=0;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		//Кухарь А.Ю.  01.08.2025 конец
		
		
		
		// Кухарь А.Ю. 13.10.2020 начало
		//Некоторые позиции только начали продаваться, и средние продажи на основании 2 недель будут некорректны
		// СреднийРасход=СтрТЧ.Количество/КоличествоДнейПродаж;	
		если СтрТЧ.ДнейПродажИзФайла>0 и СтрТЧ.ДнейПродажИзФайла<КоличествоДнейПродаж тогда
			ДнейПродаж=СтрТЧ.ДнейПродажИзФайла;
		иначе
			ДнейПродаж=КоличествоДнейПродаж;
		КонецЕсли;
		
		если ДнейПродаж>0 тогда
			СреднийРасход=СтрТЧ.Количество/ДнейПродаж;
		иначе
			СреднийРасход=0;
		КонецЕсли;
		// Кухарь А.Ю. 13.10.2020 конец
		
		
		ТребуемоеКоличество=СтрМатрицы.МинимальныйОстатокВДнях*СреднийРасход;			
		НужноПополнить=ТребуемоеКоличество-СтрТЧ.ОстатокКонтрагента;
		
		// Кухарь А.Ю. 28.02.2023 начало
		// Наталья попросила сделать, чтобы если была продажа и товара на остатках < 5, то умножалось на 1.3
		если  СтрТЧ.ОстатокКонтрагента<5 тогда
			НужноПополнить=Окр(НужноПополнить*1.3,0);
		КонецЕсли;
		// Кухарь А.Ю. 28.02.2023 конец
		
		// Кухарь А.Ю. 08.10.2020 начало
		// Иногда товар давно не поставлялся, тогда в файле его нет а в матрицах есть. Будем отгружать 1 коробку
		если СреднийРасход=0 и СтрТЧ.ОстатокКонтрагента=0 и СтрМатрицы.МинимальныйОстатокВДнях>0 тогда
			СтрТЧ.СпособПоставки=Перечисления.СпособПоставкиКонтрагенту.МоноКороб;
			НужноПополнить=СтрМатрицы.КратностьКоробки;
		КонецЕсли;
		// Кухарь А.Ю. 08.10.2020 конец
		
		СтрТЧ.НедостающееКоличество=Макс(0,НужноПополнить-СтрТЧ.ВПути);
		СтрТЧ.КОтгрузке=СтрТЧ.НедостающееКоличество;
		
		
		
		
		
		//Кухарь А.Ю. 21.09.2023 начало
		//если СтрТЧ.СпособПоставки=Перечисления.СпособПоставкиКонтрагенту.МоноПаллета и СтрМатрицы.КратностьПаллеты>1 тогда
		если СтрТЧ.СпособПоставки =Перечисления.СпособПоставкиКонтрагенту.МиксПаллеты3Артикула тогда 
			// Кухарь А.Ю.  22.11.2023 начало
			//
			если СтрМатрицы.КратностьПаллеты=0 тогда
				Сообщить("Пустая кратность паллеты у "+СтрТЧ.Номенклатура);
				Продолжить;
			КонецЕсли;
			// Кухарь А.Ю.  22.11.2023 конец
			
			КолТары=СтрТЧ.НедостающееКоличество/СтрМатрицы.КратностьПаллеты;
			
			если КолТары>0.33333 тогда
				//СтрТЧ.СпособПоставки=Перечисления.СпособПоставкиКонтрагенту.МоноПаллета;
				СтрТЧ.КОтгрузке=СтрМатрицы.КратностьПаллеты/3;
				//++Данилова Е.В. 17.06.2026 №0000000008
				//СообщитьИзМодуля(СтрШаблон("У %1, количество больше 0.33 паллета, количество уменьшено до 0.33 паллеты",СтрТЧ.Номенклатура));
				Сообщить(СтрШаблон("У %1, количество больше 0.33 паллета, количество уменьшено до 0.33 паллеты",СтрТЧ.Номенклатура)); 
				//--Данилова Е.В. 17.06.2026 
			иначе
				если Цел(КолТары)<>КолТары тогда
					КолТары=Цел(КолТары)+1;
					СтрТЧ.КОтгрузке=КолТары*СтрМатрицы.КратностьПаллеты/3;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		//Кухарь А.Ю. 21.09.2023 конец
		
		если (СтрТЧ.СпособПоставки=Перечисления.СпособПоставкиКонтрагенту.МоноПаллета или СтрТЧ.СпособПоставки=Перечисления.СпособПоставкиКонтрагенту.Монопаллета120)  и СтрМатрицы.КратностьПаллеты>1 тогда
			//Кухарь А.Ю. 21.09.2023 конец	
			
			// Кухарь А.Ю.  22.11.2023 начало
			//
			если СтрМатрицы.КратностьПаллеты=0 тогда
				Сообщить("Пустая кратность паллеты у "+СтрТЧ.Номенклатура);
				Продолжить;
			КонецЕсли;
			// Кухарь А.Ю.  22.11.2023 конец
			
			КолТары=СтрТЧ.НедостающееКоличество/СтрМатрицы.КратностьПаллеты;
			если Цел(КолТары)<>КолТары тогда
				КолТары=Цел(КолТары)+1;
				СтрТЧ.КОтгрузке=КолТары*СтрМатрицы.КратностьПаллеты;
			КонецЕсли;
			
		КонецЕсли;	
		
		если СтрТЧ.ШтукВКоробкеИзНоменклатуры=0 тогда
			Сообщить(СтрШаблон("У номенклатуры %1 пустое количество штук в коробке в карточке.",СтрТЧ.Номенклатура));
		КонецЕсли;
		 
		
		
		КратностьОкругления=0;
		
		// Кухарь А.Ю.  17.10.2023 начало
		если СтрТЧ.СпособПоставки<>Перечисления.СпособПоставкиКонтрагенту.МиксПаллеты3Артикула и СтрМатрицы.ШтукВКоробкеИзНоменклатуры<>0 тогда 
			// Кухарь А.Ю.  17.10.2023 конец
			
			если Контрагент.Код="SSP-4991" тогда
				КратностьОкругления=5;
				
				// Кухарь А.Ю.  09.04.2024 начало
				//
				// Кухарь А.Ю.  06.08.2024 начало
				//ИначеЕсли Контрагент.Код="SSR-9059"  тогда 
			ИначеЕсли Контрагент.Код="SSR-9059" или Контрагент.Код="SST-1208"  тогда 
				
				
				// Кухарь А.Ю.  06.08.2024 конец
				
				// Кухарь А.Ю.  09.04.2024 конец
				
				КратностьОкругления=10;				
			КонецЕсли;
			
			// Кухарь А.Ю.  17.10.2023 начало
			//
		иначе
			КратностьОкругления=СтрМатрицы.ШтукВКоробкеИзНоменклатуры;
		КонецЕсли; 
		// Кухарь А.Ю.  17.10.2023 конец
		
		
		// Кухарь А.Ю.  09.04.2024 начало
		 
		// Кухарь А.Ю.  06.08.2024 начало
		// если Контрагент.Код= "SSR-9059" 
		если (Контрагент.Код= "SSR-9059" или Контрагент.Код= "SST-1208")
		// Кухарь А.Ю.  06.08.2024 конец			
			и СтрТЧ.СпособПоставки<>Перечисления.СпособПоставкиКонтрагенту.МоноПаллета
			и СтрТЧ.СпособПоставки<>Перечисления.СпособПоставкиКонтрагенту.Монопаллета120
			тогда
			//// Кухарь А.Ю.  17.04.2024 начало
			////
			//	Продолжить;		 
			//// Кухарь А.Ю.  17.04.2024 конец
			

		КонецЕсли;
		// Кухарь А.Ю.  09.04.2024 конец
			
		если КратностьОкругления>0 тогда
			КолТары=СтрТЧ.КОтгрузке/КратностьОкругления;
			если Цел(КолТары)<>КолТары тогда
				КолТары=Цел(КолТары)+1;
				СтрТЧ.КОтгрузке=КолТары*КратностьОкругления;
			КонецЕсли;		
		КонецЕсли;
		// Кухарь А.Ю. 12.10.2022 конец	
		
		
		// Кухарь А.Ю.  25.10.2022 начало
		// Увеличение количества от коэффициента установленного вручную
		если КоэффициентУвеличения=0 тогда
			КоэффициентУвеличения=1;
		КонецЕсли;
		
		//Кухарь А.Ю. 21.09.2023 начало
		//СтрТЧ.КОтгрузке = СтрТЧ.КОтгрузке*КоэффициентУвеличения;
		
		если СтрТЧ.СпособПоставки<>Перечисления.СпособПоставкиКонтрагенту.МиксПаллеты3Артикула тогда
			СтрТЧ.КОтгрузке = СтрТЧ.КОтгрузке*КоэффициентУвеличения;
		КонецЕсли;
		// Кухарь А.Ю.  25.10.2022 конец
		
		
		// Кухарь А.Ю. 26.08.2021 начало
		если не ЗначениеЗаполнено(СтрТЧ.СпособПоставки) тогда
			СтрТЧ.СпособПоставки=Перечисления.СпособПоставкиКонтрагенту.Микс
		КонецЕсли;
		// Кухарь А.Ю. 26.08.2021 конец 		
		
		// Кухарь А.Ю. 12.03.2021 начало
		// Количество коробов теперь реквизит ТЧ
		если СтрТЧ.КОтгрузке>0 тогда
			ШтукВКоробе=СтрМатрицы.КратностьКоробкиИзНоменклатуры;
			если ШтукВКоробе>0 тогда
				СтрТЧ.КоробокКОтгрузке=СтрТЧ.КОтгрузке/ШтукВКоробе;
			КонецЕсли;
		КонецЕсли;
		// Кухарь А.Ю. 12.03.2021 конец
		
		
		Если СтрТЧ.ШтукВКоробкеИзНоменклатуры>0 и (СтрТЧ.СпособПоставки=Перечисления.СпособПоставкиКонтрагенту.МоноКороб 
			или СтрТЧ.СпособПоставки=Перечисления.СпособПоставкиКонтрагенту.МоноПаллета 
			или СтрТЧ.СпособПоставки=Перечисления.СпособПоставкиКонтрагенту.Монопаллета120)  
			тогда
			
			КолТары=СтрТЧ.НедостающееКоличество/СтрТЧ.ШтукВКоробкеИзНоменклатуры;
			
			если Цел(КолТары)<>КолТары тогда
				КолТары=Цел(КолТары)+1;		
				СтрТЧ.КОтгрузке=КолТары*СтрМатрицы.ШтукВКоробкеИзНоменклатуры;	
				
				// Кухарь А.Ю.  29.08.2024 начало
				СтрТЧ.КОтгрузке=СтрТЧ.КОтгрузке*КоэффициентУвеличения; 
				// Кухарь А.Ю.  29.08.2024 конец
				
			КонецЕсли;		
		КонецЕсли;	
		
		
	КонецЦикла;
	
	
	// Кухарь А.Ю.  09.04.2024 начало
	товары.Загрузить(ТЗТовары);	 
	// Кухарь А.Ю.  09.04.2024 конец
	

	
	
	РасчитатьМиксПаллеты();
	
	
КонецПроцедуры

// Кухарь А.Ю.  26.09.2023 начало
//

Процедура РасчитатьМиксПаллеты()
	
	//Перем ВремТЗ, ВыборкаКоличествоКомплектующих, ВыборкаКоличествоЦветов, ВыборкаКратностьПаллеты, ВыборкаНоменклатура, ВыборкаНоменклатурнаяМатрица, ВыборкаПостояннаяАкция, ВыборкаПунктДоставки, Запрос, КолТары, МассивМикса, МассСтрок, СтрМасс, СтрТЧ;
	
	//Кухарь А.Ю. 21.09.2023 начало
	ВремТЗ=товары.Выгрузить(,"Номенклатура,КратностьПаллеты,СпособПоставки,КОтгрузке,ПунктДоставки,НоменклатурнаяМатрица");
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ТЗ.Номенклатура КАК Номенклатура,
	|	ТЗ.СпособПоставки КАК СпособПоставки,
	|	ТЗ.КратностьПаллеты КАК КратностьПаллеты,
	|	ТЗ.КОтгрузке КАК КОтгрузке,
	|	ТЗ.ПунктДоставки КАК ПунктДоставки,
	|	ТЗ.НоменклатурнаяМатрица КАК НоменклатурнаяМатрица
	|ПОМЕСТИТЬ ВремТЗ
	|ИЗ
	|	Документ.ДвижениеТовараВнешнегоКонтрагента.Товары КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗСКМП.Номенклатура КАК Номенклатура,
	|	ТЗСКМП.Номенклатура.Родитель.ШтукВКоробке КАК ШтукВКоробкеИзНоменклатуры
	|ИЗ
	|	ВремТЗ КАК ТЗСКМП
	|ГДЕ
	|	ТЗСКМП.СпособПоставки = &СпособПоставки
	|	И ТЗСКМП.КратностьПаллеты > 0
	|	И ТЗСКМП.КОтгрузке > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура ИЕРАРХИЯ";
	запрос.Текст=СтрЗаменить(запрос.Текст,"Документ.ДвижениеТовараВнешнегоКонтрагента.Товары КАК ТЗ","&ТЗ как ТЗ");
	запрос.УстановитьПараметр("ТЗ",ВремТЗ);
	запрос.УстановитьПараметр("СпособПоставки",Перечисления.СпособПоставкиКонтрагенту.МиксПаллеты3Артикула);
	
	ТЗ=запрос.Выполнить().выгрузить();
	МассивМикса=новый Массив;			
	
	
	КоличествоСтрок=ТЗ.Количество();
	КоличествоСтрокНеКратное3=КоличествоСтрок-3*Цел(КоличествоСтрок/3);
	Если КоличествоСтрокНеКратное3>0 тогда
		НачальнаяСтрокаЛишнегоТовара=КоличествоСтрок-КоличествоСтрокНеКратное3;
		Для сч=НачальнаяСтрокаЛишнегоТовара по КоличествоСтрок-1 цикл
			Номенклатура=ТЗ.Получить(сч).номенклатура;
			//++Данилова Е.В. 17.06.2026 №0000000008
			//СообщитьИзМодуля("У "+Номенклатура+" не нашлось группы для формирования микса"); 
			Сообщить("У "+Номенклатура+" не нашлось группы для формирования микса"); 
			//--Данилова Е.В. 17.06.2026 
			МассСтрок=Товары.НайтиСтроки(новый Структура("Номенклатура,СпособПоставки",Номенклатура,Перечисления.СпособПоставкиКонтрагенту.МиксПаллеты3Артикула));
			для каждого СтрТЧ из МассСтрок цикл
				СтрТЧ.СпособПоставки=Перечисления.СпособПоставкиКонтрагенту.МоноПаллета;
				КолТары=СтрТЧ.НедостающееКоличество/СтрТЧ.КратностьПаллеты;
				если Цел(КолТары)<>КолТары тогда
					КолТары=Цел(КолТары)+1;
					СтрТЧ.КОтгрузке=КоэффициентУвеличения*КолТары*СтрТЧ.КратностьПаллеты;
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;
	иначе
		НачальнаяСтрокаЛишнегоТовара=КоличествоСтрок;
	КонецЕсли;
	
	сч=0;
	Для каждого ВыборкаНоменклатура из ТЗ цикл
		если сч=НачальнаяСтрокаЛишнегоТовара тогда
			Прервать;
		КонецЕсли;
		
		
		МассСтрок=Товары.НайтиСтроки(новый Структура("Номенклатура,СпособПоставки",ВыборкаНоменклатура.Номенклатура,Перечисления.СпособПоставкиКонтрагенту.МиксПаллеты3Артикула));
		для каждого СтрТЧ из МассСтрок цикл
			КолТары=СтрТЧ.НедостающееКоличество/СтрТЧ.КратностьПаллеты;
			если КолТары>0.333 или КолТары <0.3 тогда											
				
				СтараяОтгрузка=СтрТЧ.КОтгрузке;
				СтрТЧ.КОтгрузке=СтрТЧ.КратностьПаллеты/3;								
				КратностьОкругления=ВыборкаНоменклатура.ШтукВКоробкеИзНоменклатуры;
				если КратностьОкругления>0 тогда
					КолТары=СтрТЧ.КОтгрузке/КратностьОкругления;
					если Цел(КолТары)<>КолТары тогда
						КолТары=Цел(КолТары)+1;
						СтрТЧ.КОтгрузке=КолТары*КратностьОкругления;
					КонецЕсли;	
				КонецЕсли;
				если СтараяОтгрузка<>СтрТЧ.КОтгрузке тогда
					//++Данилова Е.В. 17.06.2026 №0000000008
					//СообщитьИзМодуля(СтрШаблон("У %1, количество больше 0.33 паллета, количество изменено на %2",ВыборкаНоменклатура.Номенклатура,СтрТЧ.КОтгрузке));
					Сообщить(СтрШаблон("У %1, количество больше 0.33 паллета, количество изменено на %2",ВыборкаНоменклатура.Номенклатура,СтрТЧ.КОтгрузке)); 
					//--Данилова Е.В. 17.06.2026 
				КонецЕсли;
			КонецЕсли;									
		КонецЦикла;
		сч=сч+1;
	КонецЦикла;
	
	
КонецПроцедуры

// Кухарь А.Ю.  26.09.2023 конец



Функция ПолучитьТЗМатриц ()
	
	Запрос	= Новый Запрос;				
	Запрос.Текст 	=
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МатрицаТовары.Ссылка КАК Ссылка,
	|	МатрицаТовары.Номенклатура КАК Номенклатура,
	|	МатрицаТовары.Номенклатура.Родитель.ШтукВКоробке КАК ШтукВКоробкеИзНоменклатуры,
	|	МатрицаТовары.ШККонтрагента КАК ШККонтрагента,
	|	МатрицаТовары.МинимальныйОстатокВДнях КАК МинимальныйОстатокВДнях,
	|	МатрицаТовары.КратностьКоробки КАК КратностьКоробки,
	|	МатрицаТовары.КратностьПаллеты КАК КратностьПаллеты,
	|	МатрицаТовары.СпособПоставки КАК СпособПоставки,
	|	МатрицаТовары.Ссылка.Дата КАК ДатаМатрицы,
	|	МатрицаТовары.ШККонтрагентаДополнительный КАК ШККонтрагентаДополнительный,
	|	ВЫРАЗИТЬ(МатрицаТовары.НаименованиеБрендаДляКонтрагента КАК СТРОКА(200)) КАК НаименованиеБрендаДляКонтрагента,
	|	МатрицаТовары.Номенклатура.Родитель.ШтукВКоробке КАК КратностьКоробкиИзНоменклатуры,
	|	МатрицаТовары.ВыделятьВДокументах КАК ВыделятьВДокументах,
	|	МатрицаТовары.ПунктДоставки КАК ПунктДоставки,
	|	МатрицаТовары.Цена КАК Цена,
	|	ВЫРАЗИТЬ(МатрицаТовары.ТипТовараДляКонтрагента КАК СТРОКА(250)) КАК ТипТовараДляКонтрагента
	|ИЗ
	|	Документ.Матрица.Товары КАК МатрицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
	|ГДЕ
	|	МатрицаТовары.Ссылка.Проведен
	|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
	|	И МатрицаТовары.Ссылка.Договор = &Договор
	|	И МатрицаТовары.Ссылка.Дата <= &Дата1
	|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
	|	И МатрицаПунктыДоставки.ПунктДоставки = &ПунктДоставки
	|	И МатрицаТовары.Номенклатура В(&Номенклатура)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаМатрицы УБЫВ";
	
	Запрос.УстановитьПараметр("Дата2",			НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Дата1",			КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Контрагент",		Контрагент);	
	запрос.УстановитьПараметр("ПунктДоставки",ПунктДоставки);
	запрос.УстановитьПараметр("Договор",Договор);
	запрос.УстановитьПараметр("Номенклатура",Товары.ВыгрузитьКолонку("Номенклатура"));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции


// Кухарь А.Ю. 22.09.2025 начало   
// ASU-2504
// Функция ПолучитьТоварыВПути ()
Функция ПолучитьТоварыВПути (ДополнительныеПараметры = Неопределено)    
	ОтключитьКонтрольПунктовДоставки = ложь;
	если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") тогда   
		если ДополнительныеПараметры.Свойство("ОтключитьКонтрольПунктовДоставки") тогда 
			ОтключитьКонтрольПунктовДоставки = ДополнительныеПараметры.ОтключитьКонтрольПунктовДоставки; 
		КонецЕсли;
	КонецЕсли;
	// Кухарь А.Ю. 22.09.2025 конец
	
	СписокПД=новый СписокЗначений;
	СписокПД.Добавить(ПунктДоставки);
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеквизитыСправочников.Справочник КАК ПД
	|ИЗ
	|	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
	|ГДЕ
	|	РеквизитыСправочников.ЗначениеРеквизита = &Справочник
	|	И РеквизитыСправочников.ИмяРеквизита = ""Связанный адрес""";	
	запрос.УстановитьПараметр("Справочник",ПунктДоставки);
	результат=запрос.Выполнить().Выбрать();
	пока результат.Следующий() цикл
		СписокПД.Добавить(результат.ПД);
	КонецЦикла;
	
	запрос=новый запрос;
	
	запрос.Текст= "ВЫБРАТЬ
	              |	СУММА(т1.Количество) КАК Количество,
	              |	т1.Номенклатура КАК Номенклатура
	              |ИЗ
	              |	(ВЫБРАТЬ
	              |		СУММА(РасходнаяНакладнаяТовары.Количество) КАК Количество,
	              |		РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура
	              |	ИЗ
	              |		Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	              |	ГДЕ
	              |		(РасходнаяНакладнаяТовары.Ссылка В (&списокРНК)
	              |				ИЛИ РасходнаяНакладнаяТовары.Ссылка.Проведен
	              |					И РасходнаяНакладнаяТовары.Ссылка.КодОперации = &КодОперации
	              |					И РасходнаяНакладнаяТовары.Ссылка.Контрагент = &Контрагент
	              |					И (РасходнаяНакладнаяТовары.Ссылка.ПунктДоставки В (&ПунктДоставки)
	              |						ИЛИ &ОтключитьКонтрольПунктовДоставки)
	              |					И РасходнаяНакладнаяТовары.Количество > 0
	              |					И (РасходнаяНакладнаяТовары.Ссылка.Отгружен = &Резерв
	              |						ИЛИ РасходнаяНакладнаяТовары.Ссылка.ДатаОтгрузки = НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)))
	              |		И РасходнаяНакладнаяТовары.Номенклатура В(&Номенклатура)
	              |		И РасходнаяНакладнаяТовары.Ссылка.Дата >= &Дата
	              |		И НЕ РасходнаяНакладнаяТовары.Ссылка.Склад.ЭтоСкладFBS
	              |	
	              |	СГРУППИРОВАТЬ ПО
	              |		РасходнаяНакладнаяТовары.Номенклатура
	              |	
	              |	ОБЪЕДИНИТЬ ВСЕ
	              |	
	              |	ВЫБРАТЬ
	              |		СУММА(Товары.Количество),
	              |		Товары.Номенклатура
	              |	ИЗ
	              |		Документ.Комплектация.Товары КАК Товары
	              |	ГДЕ
	              |		Товары.Ссылка В(&списокРНК)
	              |		И Товары.Номенклатура В(&Номенклатура)
	              |		И Товары.Ссылка.Отгружен = &Резерв
	              |	
	              |	СГРУППИРОВАТЬ ПО
	              |		Товары.Номенклатура) КАК т1
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	т1.Номенклатура"; 
	// Кухарь А.Ю. 18.08.2021 конец
	
	Запрос.УстановитьПараметр("Контрагент",		Контрагент);	
	запрос.УстановитьПараметр("ПунктДоставки",СписокПД);
	запрос.УстановитьПараметр("Дата",Константы.ДатаЗапретаРедактирования.Получить()-30*24*3600);
	запрос.УстановитьПараметр("Номенклатура",Товары.ВыгрузитьКолонку("Номенклатура"));
	запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	запрос.УстановитьПараметр("Резерв",Перечисления.Отгружен.Резерв);
	запрос.УстановитьПараметр("списокРНК",РНКПути.ВыгрузитьКолонку("Накладная"));
	Запрос.УстановитьПараметр("КодОперации",		Перечисления.КодыОперацийОстатки.Комиссия);
	// Кухарь А.Ю. 22.09.2025 начало
	// ASU-2504
	Запрос.УстановитьПараметр("ОтключитьКонтрольПунктовДоставки",		ОтключитьКонтрольПунктовДоставки);
	// Кухарь А.Ю. 22.09.2025 конец
	
	ТЗТоваровВпути=запрос.Выполнить().Выгрузить();	
	Для каждого СтрТЗ из ТоварыВПути цикл
		СтрПути=ТЗТоваровВпути.Найти(СтрТЗ.номенклатура);
		если СтрПути=Неопределено тогда
			СтрПути=ТЗТоваровВпути.Добавить();
			ЗаполнитьЗначенияСвойств(СтрПути,СтрТЗ);
		иначе
			СтрПути.Количество=СтрПути.количество+СтрТЗ.Количество;
		КонецЕсли;						
	КонецЦикла;
	Возврат ТЗТоваровВпути;

КонецФункции
//Данилова Е.В. 03.06.2026 0000000104 
Процедура СоздатьНаборРНКНаНедостающееКоличество(КакойДокументСоздавать = "РНК",СозданныеРНК = неопределено) Экспорт   // Шворобей ВЮ 09.07.2024 ++
	//// ПЕРЕДЕЛЫВАЮ ///////////////////////////////////////////////////////////////////////
	
	РазбиватьНакладныеПоВидуСпаек = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ИнетМагазины.РазбиватьПоВидуСпаек КАК РазбиватьНакладныеПоВидуСпаек
	|ИЗ
	|	Справочник.ИнетМагазины КАК ИнетМагазины
	|ГДЕ
	|	ИнетМагазины.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	УстановитьПривилегированныйРежим(Истина);
	ТЗ = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ТЗ.Следующий() Тогда
		РазбиватьНакладныеПоВидуСпаек = ТЗ.РазбиватьНакладныеПоВидуСпаек;
	КонецЕсли;	

	Сооб = "";
	
	ОтвСтру = РазбиватьРНК();
	
	// Шворобей ВЮ 27.10.2022 ++
	РазбиватьКратноКоробу = ?(КакойДокументСоздавать = "ЗаявкаНаПерепаковку", Истина, Ложь);
	// Шворобей ВЮ 25.11.2022 ++
	РазбиватьКратноКоробу = Ложь;     // ОТКЛЮЧИЛ!!!
	// Шворобей ВЮ 25.11.2022 ++
	
	Если ОтвСтру.Разбивка Тогда
		//Михайловский С. 20230314 +++
		Если КакойДокументСоздавать = "РНК" Тогда
			МассивДокументов = СоздатьНаборРНКНаНедостающееКоличество_Нов1(КакойДокументСоздавать, РазбиватьКратноКоробу);
		Иначе
			МассивДокументов = СоздатьНаборРНКНаНедостающееКоличество_Нов(КакойДокументСоздавать, РазбиватьКратноКоробу);
		КонецЕсли;	
		//Михайловский С. 20230314 ---
		Если ОткатыватьТранзацию<>Истина тогда
			Для Каждого Документ Из МассивДокументов Цикл
				Сооб = Сооб+ОбработатьРНК(Документ,ОтвСтру.Склады, КакойДокументСоздавать) + Символы.ПС;
			КонецЦикла;	
			Сообщить(Сооб);
		КонецЕсли;
	ИначеЕсли РазбиватьНакладныеПоВидуСпаек Тогда
		МассивВозврата = Документы.ДвижениеТовараВнешнегоКонтрагента.СоздатьРазбивкуРНК_ПоВидуСпаек(Ссылка, Истина);
		Если МассивВозврата.Количество() > 0 Тогда 
			СозданныеРНК = Новый Массив; 
			Для Каждого РНК Из МассивВозврата Цикл 
				//++Данилова Е.В. 03.06.2026 0000000104
				//Форма = РНК.ПолучитьФорму("ФормаДокумента");
				//форма.Открыть();
				СозданныеРНК.Добавить(РНК); 
				//--Данилова Е.В. 03.06.2026 
			КонецЦикла;
		КонецЕсли;
	Иначе
		//++Данилова Е.В. 03.06.2026 0000000104 
		//СоздатьНаборРНКНаНедостающееКоличество_Пред(КакойДокументСоздавать, РазбиватьКратноКоробу); 
		СоздатьНаборРНКНаНедостающееКоличество_Пред(КакойДокументСоздавать, РазбиватьКратноКоробу,СозданныеРНК);
		//--Данилова Е.В. 03.06.2026 
	КонецЕсли;
	// Шворобей ВЮ 03.07.2024 ++
	
КонецПроцедуры

//Михайловский С. 20220224 +++
//   "ЗаявкаНаПерепаковку"
//   "РНК"
//   Шворобей ВЮ 01.11.2022 ++
Функция ОбработатьРНК(РНКСсыл,МСкл, КакойДокументСоздавать = "РНК",ДокументРНКСозданный = неопределено) //Данилова Е.В. 01.11.2025 HELP-7698
	
	Рез="";
	ЕстьДопСкл=Ложь;
	Если НЕ МСкл=неопределено Тогда
		ЕстьДопСкл=МСкл.Количество();
	КонецЕсли;	
	
	ТЗНом=РНКСсыл.Товары.Выгрузить();
	// Шворобей ВЮ 28.10.2022 ++
	Если КакойДокументСоздавать = "РНК" Тогда
		Для Каждого ТСтр Из ТЗНом Цикл
			ТСтр.Количество=ТСтр.Заявка;
		КонецЦикла;
	КонецЕсли;
	// Шворобей ВЮ 28.10.2022 ++	
	ТЗНом.Свернуть("Номенклатура","Количество");
	СпН = ТЗНом.ВыгрузитьКолонку("Номенклатура");
	
	Если ЕстьДопСкл Тогда
		Запрос1=Новый Запрос;
		Запрос1.Текст =
		"ВЫБРАТЬ
		//|	СУММА(Остатки.СуммаОстаток) КАК СебестоимостьБух,
		|	СУММА(Остатки.КоличествоОстаток - ЕСТЬNULL(Резервы.КоличествоОстаток, 0)) КАК КолКонФакт,
		|	СУММА(ЕСТЬNULL(Резервы.КоличествоОстаток, 0)) КАК Резерв,
		|	Остатки.Склад КАК Склад,
		|	Остатки.Номенклатура КАК Номенклатура
		//|	ПОМЕСТИТЬ ВТ_ОстСкл
		|ИЗ
		|	РегистрНакопления.ОстаткиТМЦ.Остатки(
		|			,
		|			Склад В (&Склады)
		|				И Номенклатура В ИЕРАРХИИ (&Ном)) КАК Остатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
		|				,
		|				Склад В (&Склады)
		|					И Номенклатура В ИЕРАРХИИ (&Ном)) КАК Резервы
		|		ПО Остатки.Номенклатура = Резервы.Номенклатура
		|			И Остатки.Склад = Резервы.Склад
		|
		|СГРУППИРОВАТЬ ПО
		|	Остатки.Номенклатура,
		|	Остатки.Склад
		
		|";
		
		Запрос1.УстановитьПараметр("ном",СпН);
		Запрос1.УстановитьПараметр("Склады",МСкл);
		ТЗОстДоп=Запрос1.Выполнить().Выгрузить();
	КонецЕсли;
	
	Запрос=Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЗНом.Номенклатура КАК Номенклатура,
	|	ТЗНом.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_НомДок
	|ИЗ
	|	&ТЗНом КАК ТЗНом
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(Остатки.КоличествоОстаток - ЕСТЬNULL(Резервы.КоличествоОстаток, 0)) КАК КолКонФакт,
	|	СУММА(ЕСТЬNULL(Резервы.КоличествоОстаток, 0)) КАК Резерв,
	|	ЛОЖЬ КАК Комплект,
	|	Остатки.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_ОстСкл
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(
	|			,
	|			Склад В ИЕРАРХИИ (&Склад)
	|				И Номенклатура В ИЕРАРХИИ (&Ном)) КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	|				,
	|				Склад В ИЕРАРХИИ (&Склад)
	|					И Номенклатура В ИЕРАРХИИ (&Ном)) КАК Резервы
	|		ПО Остатки.Номенклатура = Резервы.Номенклатура
	|			И Остатки.Склад = Резервы.Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НомДок.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ОстСкл.КолКонФакт, 0) КАК Доступно,
	|	НомДок.Количество - ЕСТЬNULL(ОстСкл.КолКонФакт, 0) КАК НеХват,
	|	0 КАК Добавка,
	|	0 КАК Добавка1,
	|	ЛОЖЬ КАК ПолнПодпит,
	|	ВЫБОР
	|		КОГДА &Провод
	|			ТОГДА НомДок.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК УжеРезерв
	|ИЗ
	|	ВТ_НомДок КАК НомДок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстСкл КАК ОстСкл
	|		ПО НомДок.Номенклатура = ОстСкл.Номенклатура
	|ГДЕ
	|	НомДок.Количество > ЕСТЬNULL(ОстСкл.КолКонФакт, 0) + ВЫБОР
	|			КОГДА &Провод
	|				ТОГДА НомДок.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ном",СпН);
	Запрос.УстановитьПараметр("Склад",РНКСсыл.Склад);
	Запрос.УстановитьПараметр("Провод",РНКСсыл.Проведен);
	Запрос.УстановитьПараметр("ТЗНом",ТЗНом);
	
	ТЗКорр=Запрос.Выполнить().Выгрузить();
	Если НЕ ТЗКорр.Количество() Тогда
		ДокРНК1=РНКСсыл.ПолучитьОбъект();
		
		Если КакойДокументСоздавать = "РНК" Тогда
			ДокРНК1.СостояниеНакладной = Перечисления.СостоянияНакладной.ВРаботе;
		КонецЕсли;
		ДокРНК1.Дата=ТекущаяДатаСеанса();
		ДокРНК1.Записать(РежимЗаписиДокумента.Проведение);
		//ЗаписатьВЛог("ВБрз","Окончание выполнения. Задача: Контроль остатка ВБ Переведено в состояние КОтправкеНаСклад! 2  ","Информация");
		Рез="Документ " + Строка(РНКСсыл) + " не требует модификации";
		Возврат Рез;
	КонецЕсли;
	
	Если ЕстьДопСкл Тогда
		СоздПРМ=Ложь;
		ТЗОстДоп1=ТЗОстДоп.Скопировать();
		ТЗОстДоп1.Свернуть("Номенклатура","КолКонФакт");
		Для Каждого ТекСтр Из ТЗКорр Цикл
			Найды=ТЗОстДоп1.НайтиСтроки(Новый Структура("Номенклатура",ТекСтр.Номенклатура));
			Если Найды.Количество() Тогда
				
				Если ТекСтр.НеХват>Найды[0].КолКонФакт Тогда
					ТекСтр.Добавка=Найды[0].КолКонФакт;
				Иначе
					ТекСтр.Добавка=ТекСтр.НеХват;
				КонецЕсли;	
				Если НЕ ТекСтр.Добавка=0 Тогда
					СоздПРМ=Истина;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;
		
		Если СоздПРМ Тогда
			МасСклПост=Новый Массив;
			
			Для Каждого ТекСтр Из ТЗКорр Цикл
				Если ТекСтр.Добавка>0 Тогда
					Найды=ТЗОстДоп.НайтиСтроки(Новый Структура("Номенклатура",ТекСтр.Номенклатура));
					Для Каждого Найд Из Найды Цикл
						Если МасСклПост.Найти(Найд.Склад)=неопределено Тогда
							МасСклПост.Добавить(Найд.Склад);	
							
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			Для Каждого Скл Из МасСклПост Цикл
				//Михайловский С. корректировка 20220519 +++
				Если НЕ (Скл=РНКСсыл.Склад) Тогда
					//Михайловский С. корректировка 20220519 ---	
					Подсортировка=документы.Перемещение.СоздатьДокумент();
					Подсортировка.СкладПолучатель=РНКСсыл.Склад;
					Подсортировка.Склад=Скл;
					Подсортировка.ИБ=РНКСсыл.иб;
					Подсортировка.Менеджер=ПараметрыСеанса.Пользователь.ФизЛицо;
					Подсортировка.Автор=ПараметрыСеанса.Пользователь;
					Подсортировка.Организация=РНКСсыл.организация;
					Подсортировка.ПунктДоставки=РНКСсыл.ПунктДоставки;
					Подсортировка.Комментарий="Создано обработкой при разбивке док-тов";
					Подсортировка.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
					Подсортировка.СостояниеНакладнойУПолучателя=Перечисления.СостоянияНакладной.ВРаботе;
					Подсортировка.Отгружен=Перечисления.Отгружен.Отгружен;
					Подсортировка.ДокОснование=РНКСсыл;
					Подсортировка.Дата=ТекущаяДата();
					Подсортировка.Валюта=Справочники.Валюты.НайтиПоКоду("810");
					Подсортировка.Курс=1;
					
					УстановитьНомерДокументаКлиентСервер(Подсортировка);
					
					Для Каждого ТекСтр Из ТЗКорр Цикл
						Если ТекСтр.Добавка>0 Тогда
							Найды=ТЗОстДоп.НайтиСтроки(Новый Структура("Номенклатура, Склад",ТекСтр.Номенклатура, Скл));
							Если Найды.Количество() Тогда
								СтрокаТЗДляПРМ=Найды[0];
								Ост1=ТекСтр.Добавка-ТекСтр.Добавка1;
								Если (Ост1)>0 Тогда
									Ост2=СтрокаТЗДляПРМ.КолКонФакт;
									Если Ост1>Ост2 Тогда
										ТКоличество=Ост2;
									Иначе
										ТКоличество=Ост1;
									КонецЕсли;	
									//Для Каждого СтрокаТЗДляПРМ Из Найды Цикл
									СтрТЧ=Подсортировка.Товары.Добавить();
									СтрТЧ.Номенклатура=СтрокаТЗДляПРМ.номенклатура;
									СтрТЧ.Заявка=ТКоличество;
									стртч.ПодтвержденнаяЗаявка=ТКоличество;			
									стртч.ПодтвержденнаяЗаявкаПеремещения=ТКоличество;
									СтрТЧ.Количество=ТКоличество;				
									ПриИзмененииНоменклатурыТабЧасти(СтрТЧ, Подсортировка);
									РассчитатьСуммуТабЧасти(СтрТЧ, Подсортировка);
									//КонецЦикла;
									ТекСтр.Добавка1=ТекСтр.Добавка1+ТКоличество;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					Если Подсортировка.Товары.Количество() Тогда
						Подсортировка.Дата=ТекущаяДата();
						Подсортировка.Записать(РежимЗаписиДокумента.Проведение);
						// Кухарь 16.03.2022 начало
						//
						//++Данилова Е.В. 17.06.2026 №0000000008
						//СообщитьИзМодуля(""+Подсортировка);
						Сообщить(""+Подсортировка); 
						//--Данилова Е.В. 17.06.2026 
						
						// Кухарь  16.03.2022 конец
						
						
					КонецЕсли;	
					//Михайловский С. корректировка 20220519 +++	
				КонецЕсли;
				//Михайловский С. корректировка 20220519 ---
			КонецЦикла;
			
		КонецЕсли;	
	КонецЕсли;
	
	// Шворобей ВЮ 01.11.2022 ++
	ЕстьПозиции=Ложь; ЕстьПозиции1=Ложь;
	Для Каждого ТекСтр Из ТЗКорр Цикл
		Если ТекСтр.НеХват > ТекСтр.Добавка1 Тогда
			ЕстьПозиции = Истина;
		КонецЕсли;
		Если ТекСтр.Добавка1>0 Тогда
			ЕстьПозиции1=Истина;
		КонецЕсли;	
	КонецЦикла;
	// Шворобей ВЮ 01.11.2022 ++
	
	// Шворобей ВЮ 01.11.2022 ++
	//Для Каждого ТекСтр Из ТЗКорр Цикл
	//	Если ТекСтр.Добавка1>0 Тогда
	//		ЕстьПозиции1=Истина;
	//	КонецЕсли;	
	//КонецЦикла;
	// Не надо одну и ту же ТЧ 2 раза обходить :-)
	
	Если ЕстьПозиции И ЕстьПозиции1 Тогда
		Попытка
			НачатьТранзакцию();
			
			// Шворобей ВЮ 01.11.2022 ++
			Если КакойДокументСоздавать = "РНК" Тогда
				ДокРНК2=Документы.РасходнаяНакладная.СоздатьДокумент();
				ЗаполнитьЗначенияСвойств(ДокРНК2,РНКСсыл);
				ДокРНК2.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
			ИначеЕсли КакойДокументСоздавать = "ЗаявкаНаПерепаковку" Тогда
				ДокРНК2 = Документы.ЗаявкаНаПерепаковку.СоздатьДокумент();
				ЗаполнитьЗначенияСвойств(ДокРНК2,РНКСсыл);
				ДокРНК2.ДокОснование = Ссылка;
				ДокРНК2.Автор = ПараметрыСеанса.Пользователь;
			КонецЕсли;
			
			ДокРНК2.Товары.Очистить();
			Для Каждого ТекСтр Из ТЗКорр Цикл
				Если ТекСтр.НеХват>ТекСтр.Добавка1 Тогда
					Кол=ТекСтр.НеХват-ТекСтр.Добавка1;
					СтрТЧ=ДокРНК2.Товары.Добавить();
					СтрТЧ.Номенклатура=ТекСтр.Номенклатура;
					СтрТЧ.Количество=Кол;
					Если КакойДокументСоздавать = "РНК" Тогда
						СтрТЧ.Заявка=Кол;
						СтрТЧ.ПодтвержденнаяЗаявка = Кол;
						ПриИзмененииНоменклатурыТабЧасти(СтрТЧ, ДокРНК2);
						РассчитатьСуммуТабЧасти(СтрТЧ, ДокРНК2);
					КонецЕсли;
				КонецЕсли;	
			КонецЦикла;
			
			ДокРНК2.Проведен=Ложь;
			
			Если ДокРНК2.Товары.Количество() Тогда
				
				// Шворобей ВЮ 01.11.2022 ++
				Если КакойДокументСоздавать = "ЗаявкаНаПерепаковку" Тогда
					ДокРНК2.ЗаполнитьКомплектующие();
					// Шворобей ВЮ 29.11.2022 ++
					ДокРНК2.ПостобработкаКомплектующих();
					// Шворобей ВЮ 29.11.2022 ++
				КонецЕсли;
				// Шворобей ВЮ 01.11.2022 ++
				
				УстановитьНомерДокументаКлиентСервер(ДокРНК2);
				ДокРНК2.Дата=ТекущаяДата();
				
				// Шворобей ВЮ 29.11.2022 ++
				Если КакойДокументСоздавать = "ЗаявкаНаПерепаковку" Тогда
					Попытка
						ДокРНК2.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						ДокРНК2.Записать(РежимЗаписиДокумента.Запись);
					КонецПопытки;
				Иначе
					ДокРНК2.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;
				// Шворобей ВЮ 29.11.2022 ++
				
				// Кухарь 16.03.2022 начало  
				//++Данилова Е.В. 17.06.2026 №0000000008
				//СообщитьИзМодуля(""+ДокРНК2);
				Сообщить(""+ДокРНК2); 
				//--Данилова Е.В. 17.06.2026 
				// Кухарь  16.03.2022 конец
				
			КонецЕсли;
			// Шворобей ВЮ 01.11.2022 ++
			
			ДокРНК1=РНКСсыл.ПолучитьОбъект();
			// Шворобей ВЮ 01.11.2022 ++
			Если КакойДокументСоздавать = "РНК" Тогда
				ДокРНК1.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
			КонецЕсли;
			
			Для Каждого ТекСтр Из ТЗКорр Цикл
				Если ТекСтр.НеХват>ТекСтр.Добавка1 Тогда
					Кол=ТекСтр.Добавка1;
					СтрТЧы=ДокРНК1.Товары.НайтиСтроки(Новый Структура("Номенклатура", ТекСтр.Номенклатура));
					//НовСтр.Номенклатура=ТекСтр.Номенклатура;
					//СтрТЧ=рнк.Товары.Добавить();
					Если СтрТЧы.Количество() Тогда
						СтрТЧ=СтрТЧы[0];
						СтрТЧ.Номенклатура=ТекСтр.Номенклатура;
						СтрТЧ.Количество=Кол;
						// Шворобей ВЮ 01.11.2022 ++
						Если КакойДокументСоздавать = "РНК" Тогда
							СтрТЧ.Заявка=Кол;
							СтрТЧ.ПодтвержденнаяЗаявка=Кол;
							ПриИзмененииНоменклатурыТабЧасти(СтрТЧ, ДокРНК1);
							РассчитатьСуммуТабЧасти(СтрТЧ, ДокРНК1);
						КонецЕсли;
						// Шворобей ВЮ 01.11.2022 ++
					КонецЕсли;
				КонецЕсли;	
			КонецЦикла;
			
			н=ДокРНК1.Товары.Количество()-1;
			Пока н>=0 Цикл
				ТС=ДокРНК1.Товары.Получить(н);
				Если ТС.Количество=0 Тогда
					ДокРНК1.Товары.Удалить(н);
				КонецЕсли;	
				н=н-1;
			КонецЦикла;	
			
			Если ДокРНК1.Товары.Количество() Тогда
				
				// Шворобей ВЮ 01.11.2022 ++
				Если КакойДокументСоздавать = "ЗаявкаНаПерепаковку" Тогда
					ДокРНК1.ЗаполнитьКомплектующие();
				КонецЕсли;
				// Шворобей ВЮ 01.11.2022 ++
				
				ДокРНК1.Дата=ТекущаяДата();
				Попытка
					ДокРНК1.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					ДокРНК1.Записать(РежимЗаписиДокумента.Запись);
				КонецПопытки;	
				
			Иначе
				ДокРНК1.Дата=ТекущаяДата();
				ДокРНК1.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;	
			
			ЗафиксироватьТранзакцию();
			Рез="Разделен по причине нехватки товаров документ "+Строка(РНКСсыл)+" добавлен документ "+Строка(ДокРНК2.Ссылка);
			//++Данилова Е.В. 01.11.2025 HELP-7698 
			ДокументРНКСозданный = ДокРНК2.Ссылка; 
			//--Данилова Е.В. 01.11.2025
			
		Исключение
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию(); 
				//++Данилова Е.В. 01.11.2025 HELP-7698
				ОткатыватьТранзацию = Истина; 
				//--Данилова Е.В. 01.11.2025
			КонецЕсли;
			Рез=" !ошибка при формировании документов в ходе контроля остатков "+ ОписаниеОшибки();
			//ЗаписатьВЛог("ВБрз"," !ошибка при формировании документов в ходе контроля остатков "+ ОписаниеОшибки(),"Информация");
		КонецПопытки;
	Иначе
		Рез="При нехватке товаров "+Строка(РНКСсыл)+" добавлены через ПРМ ";
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции	

//Михайловский С. 20220224 +++
//это прежняя версия 
//Данилова Е.В. 03.06.2026 0000000104 
Процедура СоздатьНаборРНКНаНедостающееКоличество_Пред(КакойДокументСоздавать = "РНК", РазбиватьКратноКоробу = Ложь, СозданныеРНК = неопределено)   // Шворобей ВЮ 28.10.2022 ++
	
	Запрос = Новый Запрос;
	// Шворобей ВЮ 18.01.2023 ++
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т1.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &РазбиватьКратноКоробу
	|			ТОГДА т1.ШтукВКоробке * т1.МножительДляКороба
	|		ИНАЧЕ т1.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА т1.КоличествоЦветов = 0
	|			ТОГДА 1
	|		КОГДА &РазбиватьПоКоличествуЦветов
	|			ТОГДА т1.КоличествоЦветов
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоличествоЦветов,
	|	ВЫБОР
	|		КОГДА т1.КоличествоКМП = 0
	|			ТОГДА 0
	|		КОГДА &РазбиватьПоКоличествуВСпайке
	|			ТОГДА т1.КоличествоКМП
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоличествоКМП,
	|	ВЫБОР
	|		КОГДА &РазбиватьПоСпособуПоставки
	|			ТОГДА т1.СпособПоставки
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособПоставкиКонтрагенту.Микс)
	|	КОНЕЦ КАК СпособПоставки,
	|	ВЫБОР
	|		КОГДА &РазбиватьПоНоменклатурнымМатрицам
	|			ТОГДА ЕСТЬNULL(т1.НоменклатурнаяМатрица, ЗНАЧЕНИЕ(Документ.Матрица.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.Матрица.ПустаяСсылка)
	|	КОНЕЦ КАК НоменклатурнаяМатрица,
	|	ВЫБОР
	|		КОГДА &РазбиватьПоНоменклатурнымМатрицам
	|			ТОГДА ЕСТЬNULL(т1.НоменклатурнаяМатрица.ПостояннаяАкция, ЛОЖЬ)
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПостояннаяАкция,
	|	ВЫБОР
	|		КОГДА &РазбиватьНакладныеПоВидуСпаек
	|				И т1.Номенклатура.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВидКомплекта,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(т1.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|				И ЕСТЬNULL(т1.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1)) < &ТекущаяДата

	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Маркировка
	|ИЗ
	|	(ВЫБРАТЬ
	|		Товары.Номенклатура КАК Номенклатура,
	|		Товары.СпособПоставки КАК СпособПоставки,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Комплектующие.Номенклатура.Цвет) КАК КоличествоЦветов,
	|		МАКСИМУМ(ЕСТЬNULL(Товары.КОтгрузке, 0)) КАК Количество,
	|		СУММА(ЕСТЬNULL(Комплектующие.Количество, 0)) КАК КоличествоКМП,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА Товары.Номенклатура.Родитель.ШтукВКоробке <> 0
	|					ТОГДА Товары.Номенклатура.Родитель.ШтукВКоробке
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|							ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|						ИНАЧЕ 1
	|					КОНЕЦ
	|			КОНЕЦ) КАК ШтукВКоробке,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА ЕСТЬNULL(Товары.КОтгрузке, 0) / ВЫБОР
	|							КОГДА Товары.Номенклатура.Родитель.ШтукВКоробке <> 0
	|								ТОГДА Товары.Номенклатура.Родитель.ШтукВКоробке
	|							ИНАЧЕ ВЫБОР
	|									КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|										ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|									ИНАЧЕ 1
	|								КОНЕЦ
	|						КОНЕЦ > 0
	|						И ЕСТЬNULL(Товары.КОтгрузке, 0) <> ВЫБОР
	|							КОГДА Товары.Номенклатура.Родитель.ШтукВКоробке <> 0
	|								ТОГДА Товары.Номенклатура.Родитель.ШтукВКоробке
	|							ИНАЧЕ ВЫБОР
	|									КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|										ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|									ИНАЧЕ 1
	|								КОНЕЦ
	|						КОНЕЦ
	|					ТОГДА (ВЫРАЗИТЬ(ЕСТЬNULL(Товары.КОтгрузке, 0) / ВЫБОР
	|								КОГДА Товары.Номенклатура.Родитель.ШтукВКоробке <> 0
	|									ТОГДА Товары.Номенклатура.Родитель.ШтукВКоробке
	|								ИНАЧЕ ВЫБОР
	|										КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|											ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|										ИНАЧЕ 1
	|									КОНЕЦ
	|							КОНЕЦ - 0.5 КАК ЧИСЛО(15, 0))) + 1
	|				ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(Товары.КОтгрузке, 0) / ВЫБОР
	|							КОГДА Товары.Номенклатура.Родитель.ШтукВКоробке <> 0
	|								ТОГДА Товары.Номенклатура.Родитель.ШтукВКоробке
	|							ИНАЧЕ ВЫБОР
	|									КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|										ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|									ИНАЧЕ 1
	|								КОНЕЦ
	|						КОНЕЦ - 0.5 КАК ЧИСЛО(15, 0))
	|			КОНЕЦ) КАК МножительДляКороба,
	|		Товары.НоменклатурнаяМатрица КАК НоменклатурнаяМатрица
	|	ИЗ
	|		Документ.ДвижениеТовараВнешнегоКонтрагента.Товары КАК Товары
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК Комплектующие
	|			ПО Товары.Номенклатура = Комплектующие.Ссылка
	|				И (Комплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар))
	|	ГДЕ
	|		Товары.Ссылка = &Ссылка
	|		И Товары.КОтгрузке > 0
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Товары.Номенклатура,
	|		Товары.СпособПоставки,
	|		Товары.НоменклатурнаяМатрица) КАК т1
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	СпособПоставки,
	|	КоличествоЦветов,
	|	КоличествоКМП,
	|	ПостояннаяАкция,
	|	НоменклатурнаяМатрица,
	|	Маркировка,
	|	Номенклатура";
	// Шворобей ВЮ 18.01.2023 ++
	
	Запрос.УстановитьПараметр("РазбиватьКратноКоробу", РазбиватьКратноКоробу);
	Запрос.УстановитьПараметр("РазбиватьПоСпособуПоставки",ложь);
	Запрос.УстановитьПараметр("РазбиватьПоКоличествуВСпайке",Истина);
	Запрос.УстановитьПараметр("РазбиватьПоКоличествуЦветов",Истина);
	// Кухарь А.Ю.  10.09.2024 начало
	//
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	// Кухарь А.Ю.  10.09.2024 конец
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	// Кухарь А.Ю. 17.02.2022 конец
	Если Контрагент.Код="SSP-4991" тогда
		Запрос.УстановитьПараметр("РазбиватьПоСпособуПоставки",Ложь);
		Запрос.УстановитьПараметр("РазбиватьПоКоличествуВСпайке",ложь);
	КонецЕсли;
	// Кухарь А.Ю. 26.08.2021 конец
	
	// Шворобей ВЮ 08.07.2024 ++
	Запрос.УстановитьПараметр("РазбиватьНакладныеПоВидуСпаек", Ложь);
	// Шворобей ВЮ 08.07.2024 ++
	
	// Шворобей ВЮ 18.01.2023 ++
	Запрос.УстановитьПараметр("РазбиватьПоНоменклатурнымМатрицам", Истина);
	// Шворобей ВЮ 18.01.2023 ++
	
	ВыборкаСпособовПоставки=запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"СпособПоставки");   // 1
	Пока ВыборкаСпособовПоставки.Следующий() Цикл
		КСпособПоставки="Поставка";		 
		
		ВыборкаКоличествоЦветов=ВыборкаСпособовПоставки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"КоличествоЦветов");  // 2
		Пока ВыборкаКоличествоЦветов.Следующий() Цикл
			
			кКоличествоЦветов=", количество цветов " + ВыборкаКоличествоЦветов.КоличествоЦветов;
			
			ВыборкаВидовНоменклатуры=ВыборкаКоличествоЦветов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"КоличествоКМП");  // 3
			
			// Кухарь А.Ю. 12.11.2020 начало
			Пока ВыборкаВидовНоменклатуры.Следующий() Цикл
				
				кКоличествоКМП=", количество КМП " + ВыборкаВидовНоменклатуры.КоличествоКМП;
				
				ВыборкаПоПостояннымАкциям = ВыборкаВидовНоменклатуры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ПостояннаяАкция");  // 4
				
				Пока ВыборкаПоПостояннымАкциям.Следующий() Цикл
					
					ВыборкаПоНоменклатурнымМатрицам = ВыборкаПоПостояннымАкциям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"НоменклатурнаяМатрица");  // 5
					// Кухарь А.Ю. 17.02.2022 конец
					
					Пока ВыборкаПоНоменклатурнымМатрицам.Следующий() Цикл
						
						ВыборкаПоМаркировке = ВыборкаПоНоменклатурнымМатрицам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Маркировка");  // 6
						
						Пока ВыборкаПоМаркировке.Следующий() Цикл
							
							кМаркировка = ?(ВыборкаПоМаркировке.Маркировка = Истина, ", товар маркирован", ", товар без маркировки");
							
							ВыборкаНоменклатуры = ВыборкаПоМаркировке.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Номенклатура");  // 7
							
							// Кухарь А.Ю. 12.11.2020 конец
							// Шворобей ВЮ 27.10.2022 ++
							Если КакойДокументСоздавать = "РНК" Тогда 
								//++Данилова Е.В. 03.06.2026 
								//СоздатьРНКНаСпособПоставки(ВыборкаСпособовПоставки.СпособПоставки,ВыборкаНоменклатуры,КСпособПоставки + кКоличествоЦветов + кКоличествоКМП);
								СоздатьРНКНаСпособПоставки(ВыборкаСпособовПоставки.СпособПоставки,ВыборкаНоменклатуры,КСпособПоставки + кКоличествоЦветов + кКоличествоКМП,СозданныеРНК);
								//--Данилова Е.В. 03.06.2026 
							ИначеЕсли КакойДокументСоздавать = "ЗаявкаНаПерепаковку" Тогда
								ДокЗаявка = Документы.ДвижениеТовараВнешнегоКонтрагента.СоздатьЗаявкуНаПерепаковкуНаСпособПоставки(Ссылка,ВыборкаНоменклатуры,
									СкладДОП, КСпособПоставки + кКоличествоЦветов + кКоличествоКМП);
							КонецЕсли;
							
						КонецЦикла;
						
					КонецЦикла;
					
				КонецЦикла;
				// Шворобей ВЮ 27.10.2022 ++
				// Кухарь А.Ю. 12.11.2020 начало
			КонецЦикла; 
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры
//Михайловский С. 20220224 ---

//Михайловский С. 20220224 +++
//это прежняя версия
Функция СоздатьНаборРНКНаНедостающееКоличество_Нов(КакойДокументСоздавать = "РНК", РазбиватьКратноКоробу = Ложь) // Шворобей ВЮ 28.10.2022 ++
	
	МассивДокументов = Новый Массив;
	ЕстьРаздел=Истина;
	ЛимПоз=5000;
	Попытка
		Запрос=Новый Запрос;
		Запрос.Текст=
		"ВЫБРАТЬ
		|	ИнетМагазины.РазбиватьПоЛимитуКоличество1 КАК РазбиватьПоЛимитуКоличество1,
		|	ИнетМагазины.ЛимитПоКоличеству1 КАК ЛимитПоКоличеству1
		|ИЗ
		|	Справочник.ИнетМагазины КАК ИнетМагазины
		|ГДЕ
		|	ИнетМагазины.Контрагент = &Контрагент";
		Запрос.УстановитьПараметр("Контрагент", Ссылка.Контрагент);
		ТЗ=Запрос.Выполнить().Выбрать();
		Если ТЗ.Следующий() Тогда
			ЕстьРаздел=ТЗ.РазбиватьПоЛимитуКоличество1;
			Если ЕстьРаздел Тогда
				ЛимПоз=ТЗ.ЛимитПоКоличеству1;
			КонецЕсли;
		КонецЕсли;	
	Исключение
	КонецПопытки;
	
	// Шворобей ВЮ 18.01.2023 ++
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т1.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &РазбиватьКратноКоробу
	|			ТОГДА т1.ШтукВКоробке * т1.МножительДляКороба
	|		ИНАЧЕ т1.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА т1.КоличествоЦветов = 0
	|			ТОГДА 1
	|		КОГДА &РазбиватьПоКоличествуЦветов
	|			ТОГДА т1.КоличествоЦветов
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоличествоЦветов,
	|	ВЫБОР
	|		КОГДА т1.КоличествоКМП = 0
	|			ТОГДА 0
	|		КОГДА &РазбиватьПоКоличествуВСпайке
	|			ТОГДА т1.КоличествоКМП
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоличествоКМП,
	|	ВЫБОР
	|		КОГДА &РазбиватьПоСпособуПоставки
	|			ТОГДА т1.СпособПоставки
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособПоставкиКонтрагенту.Микс)
	|	КОНЕЦ КАК СпособПоставки,
	|	ВЫБОР
	|		КОГДА &РазбиватьПоНоменклатурнымМатрицам
	|			ТОГДА ЕСТЬNULL(т1.НоменклатурнаяМатрица, ЗНАЧЕНИЕ(Документ.Матрица.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.Матрица.ПустаяСсылка)
	|	КОНЕЦ КАК НоменклатурнаяМатрица,
	|	ВЫБОР
	|		КОГДА &РазбиватьПоНоменклатурнымМатрицам
	|			ТОГДА ЕСТЬNULL(т1.НоменклатурнаяМатрица.ПостояннаяАкция, ЛОЖЬ)
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПостояннаяАкция,
	|	ВЫБОР
	|		КОГДА &РазбиватьНакладныеПоВидуСпаек
	|				И т1.Номенклатура.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВидКомплекта,
	|	ВЫБОР
	|					КОГДА ЕСТЬNULL(т1.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|				И ЕСТЬNULL(т1.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1)) < &ТекущаяДата

	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Маркировка
	|ИЗ
	|	(ВЫБРАТЬ
	|		Товары.Номенклатура КАК Номенклатура,
	|		Товары.СпособПоставки КАК СпособПоставки,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Комплектующие.Номенклатура.Цвет) КАК КоличествоЦветов,
	|		МАКСИМУМ(ЕСТЬNULL(Товары.КОтгрузке, 0)) КАК Количество,
	|		СУММА(ЕСТЬNULL(Комплектующие.Количество, 0)) КАК КоличествоКМП,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА Товары.Номенклатура.Родитель.ШтукВКоробке <> 0
	|					ТОГДА Товары.Номенклатура.Родитель.ШтукВКоробке
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|							ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|						ИНАЧЕ 1
	|					КОНЕЦ
	|			КОНЕЦ) КАК ШтукВКоробке,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА ЕСТЬNULL(Товары.КОтгрузке, 0) / ВЫБОР
	|							КОГДА Товары.Номенклатура.Родитель.ШтукВКоробке <> 0
	|								ТОГДА Товары.Номенклатура.Родитель.ШтукВКоробке
	|							ИНАЧЕ ВЫБОР
	|									КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|										ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|									ИНАЧЕ 1
	|								КОНЕЦ
	|						КОНЕЦ > 0
	|						И ЕСТЬNULL(Товары.КОтгрузке, 0) <> ВЫБОР
	|							КОГДА Товары.Номенклатура.Родитель.ШтукВКоробке <> 0
	|								ТОГДА Товары.Номенклатура.Родитель.ШтукВКоробке
	|							ИНАЧЕ ВЫБОР
	|									КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|										ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|									ИНАЧЕ 1
	|								КОНЕЦ
	|						КОНЕЦ
	|					ТОГДА (ВЫРАЗИТЬ(ЕСТЬNULL(Товары.КОтгрузке, 0) / ВЫБОР
	|								КОГДА Товары.Номенклатура.Родитель.ШтукВКоробке <> 0
	|									ТОГДА Товары.Номенклатура.Родитель.ШтукВКоробке
	|								ИНАЧЕ ВЫБОР
	|										КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|											ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|										ИНАЧЕ 1
	|									КОНЕЦ
	|							КОНЕЦ - 0.5 КАК ЧИСЛО(15, 0))) + 1
	|				ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(Товары.КОтгрузке, 0) / ВЫБОР
	|							КОГДА Товары.Номенклатура.Родитель.ШтукВКоробке <> 0
	|								ТОГДА Товары.Номенклатура.Родитель.ШтукВКоробке
	|							ИНАЧЕ ВЫБОР
	|									КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|										ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|									ИНАЧЕ 1
	|								КОНЕЦ
	|						КОНЕЦ - 0.5 КАК ЧИСЛО(15, 0))
	|			КОНЕЦ) КАК МножительДляКороба,
	|		Товары.НоменклатурнаяМатрица КАК НоменклатурнаяМатрица
	|	ИЗ
	|		Документ.ДвижениеТовараВнешнегоКонтрагента.Товары КАК Товары
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК Комплектующие
	|			ПО Товары.Номенклатура = Комплектующие.Ссылка
	|				И (Комплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар))
	|	ГДЕ
	|		Товары.Ссылка = &Ссылка
	|		И Товары.КОтгрузке > 0
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Товары.Номенклатура,
	|		Товары.СпособПоставки,
	|		Товары.НоменклатурнаяМатрица) КАК т1
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	СпособПоставки,
	|	КоличествоЦветов,
	|	КоличествоКМП,
	|	ПостояннаяАкция,
	|	НоменклатурнаяМатрица,
	|	Маркировка,
	|	Номенклатура";
	// Шворобей ВЮ 18.01.2023 ++
	
	// Кухарь А.Ю.  24.11.2022 начало
	//По просьбе Натальи вернул разбивку для ВБ
	// 	Запрос.УстановитьПараметр("РазбиватьПоСпособуПоставки",ложь);
	// Кухарь А.Ю.  06.08.2024 начало
	// Если Контрагент.Код="SSR-9059" тогда
	Если Контрагент.Код="SSR-9059" или  Контрагент.Код="SST-1208"   тогда 
		// Кухарь А.Ю.  06.08.2024 конец
		
		Запрос.УстановитьПараметр("РазбиватьПоСпособуПоставки",Истина);
	иначе
		Запрос.УстановитьПараметр("РазбиватьПоСпособуПоставки",ложь);
	КонецЕсли;
	// Кухарь А.Ю.  24.11.2022 конец
	
	Запрос.УстановитьПараметр("РазбиватьКратноКоробу", РазбиватьКратноКоробу);
	Запрос.УстановитьПараметр("РазбиватьПоКоличествуВСпайке",Истина);
	Запрос.УстановитьПараметр("РазбиватьПоКоличествуЦветов",Истина);
	// Кухарь А.Ю.  10.09.2024 начало
	//
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	// Кухарь А.Ю.  10.09.2024 конец
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	// Шворобей ВЮ 18.01.2023 ++
	Запрос.УстановитьПараметр("РазбиватьПоНоменклатурнымМатрицам", Истина);
	// Шворобей ВЮ 08.07.2024 ++
	Запрос.УстановитьПараметр("РазбиватьНакладныеПоВидуСпаек", Ложь);
	// Шворобей ВЮ 08.07.2024 ++
	
	ВыборкаСпособовПоставки=запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"СпособПоставки");   // 1
	Пока ВыборкаСпособовПоставки.Следующий() цикл
		
		// Кухарь А.Ю.  24.11.2022 начало
		//По просьбе Натальи вернул разбивку для ВБ
		
		// Кухарь А.Ю.  06.08.2024 начало
		// если Контрагент.Код="SSR-9059"  тогда
		если Контрагент.Код="SSR-9059" или Контрагент.Код="SST-1208"  тогда
			// Кухарь А.Ю.  06.08.2024 конец
			
			КСпособПоставки=""+ВыборкаСпособовПоставки.СпособПоставки;
		иначе
			КСпособПоставки="";
		КонецЕсли;
		// Кухарь А.Ю.  24.11.2022 конец
		
		ВыборкаКоличествоЦветов=ВыборкаСпособовПоставки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"КоличествоЦветов");  // 2
		Пока ВыборкаКоличествоЦветов.Следующий() Цикл
			
			кКоличествоЦветов=", количество цветов "+ВыборкаКоличествоЦветов.КоличествоЦветов;
			
			ВыборкаВидовНоменклатуры=ВыборкаКоличествоЦветов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"КоличествоКМП"); // 3
			// Кухарь А.Ю. 17.02.2022 конец
			
			// Кухарь А.Ю. 12.11.2020 начало
			Пока ВыборкаВидовНоменклатуры.Следующий() Цикл
				// Кухарь А.Ю. 17.02.2022 начало
				//
				кКоличествоКМП=", количество КМП "+ВыборкаВидовНоменклатуры.КоличествоКМП;
				
				ВыборкаПоПостояннымАкциям = ВыборкаВидовНоменклатуры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ПостояннаяАкция");  // 4
				
				Пока ВыборкаПоПостояннымАкциям.Следующий() Цикл
					
					ВыборкаПоНоменклатурнымМатрицам = ВыборкаПоПостояннымАкциям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"НоменклатурнаяМатрица");   // 5
					
					Пока ВыборкаПоНоменклатурнымМатрицам.Следующий() Цикл
						
						ВыборкаПоМаркировке = ВыборкаПоНоменклатурнымМатрицам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Маркировка");  // 6
						
						Пока ВыборкаПоМаркировке.Следующий() Цикл
							
							кМаркировка = ?(ВыборкаПоМаркировке.Маркировка = Истина, ", товар маркирован", ", товар без маркировки");
							
							ВыборкаНоменклатуры = ВыборкаПоМаркировке.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Номенклатура");  // 7
							
							// Кухарь А.Ю. 12.11.2020 конец
							// Шворобей ВЮ 27.10.2022 ++
							Если КакойДокументСоздавать = "РНК" Тогда
								МНовДок = СоздатьРНКНаСпособПоставки_Ф1(ВыборкаСпособовПоставки.СпособПоставки,ВыборкаНоменклатуры,ЕстьРаздел,ЛимПоз,
									КСпособПоставки + кКоличествоЦветов + кКоличествоКМП);
							ИначеЕсли КакойДокументСоздавать = "ЗаявкаНаПерепаковку" Тогда
								МНовДок = Документы.ДвижениеТовараВнешнегоКонтрагента.СоздатьЗаявкуНаПерепаковкуНаСпособПоставки_Ф1(Ссылка,
									ВыборкаНоменклатуры, СкладДОП, КСпособПоставки + кКоличествоЦветов + кКоличествоКМП, ЕстьРаздел, ЛимПоз);
							КонецЕсли;
							Если МНовДок.Количество() Тогда
								Для Каждого НовДок Из МНовДок Цикл
									МассивДокументов.Добавить(НовДок);
								КонецЦикла;	
							КонецЕсли;
							
						КонецЦикла;
						
					КонецЦикла;
					
				КонецЦикла;
				// Шворобей ВЮ 27.10.2022 ++
			КонецЦикла; 
			// Кухарь А.Ю. 17.02.2022 начало
		КонецЦикла;
		// Кухарь А.Ю. 17.02.2022 конец
		
	КонецЦикла;
	Возврат МассивДокументов;
	
КонецФункции
//Михайловский С. 20220224 ---

//Михайловский С. 20230314 +++
//это прежняя версия
Функция СоздатьНаборРНКНаНедостающееКоличество_Нов1(КакойДокументСоздавать = "РНК", РазбиватьКратноКоробу = Ложь) // Шворобей ВЮ 28.10.2022 ++
	ОткатыватьТранзацию=ложь;
	// Кухарь А.Ю. 24.05.2024 начало
	//
	НачатьТранзакцию(); 
	// Кухарь А.Ю. 24.05.2024 конец
	
	МассивДокументов = Новый Массив;
	ЕстьРаздел=Истина;
	ЛимПоз=5000;
	Попытка
		Запрос=Новый Запрос;
		Запрос.Текст=
		"ВЫБРАТЬ
		|	ИнетМагазины.РазбиватьПоЛимитуКоличество1 КАК РазбиватьПоЛимитуКоличество1,
		|	ИнетМагазины.ЛимитПоКоличеству1 КАК ЛимитПоКоличеству1
		|ИЗ
		|	Справочник.ИнетМагазины КАК ИнетМагазины
		|ГДЕ
		|	ИнетМагазины.Контрагент = &Контрагент";
		Запрос.УстановитьПараметр("Контрагент", Ссылка.Контрагент);
		ТЗ=Запрос.Выполнить().Выбрать();
		Если ТЗ.Следующий() Тогда
			ЕстьРаздел=ТЗ.РазбиватьПоЛимитуКоличество1;
			Если ЕстьРаздел Тогда
				ЛимПоз=ТЗ.ЛимитПоКоличеству1;
			КонецЕсли;
		КонецЕсли;	
	Исключение
	КонецПопытки;
	
	// Шворобей ВЮ 18.01.2023 ++
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т1.Номенклатура КАК Номенклатура,
	|	т1.Номенклатура.Родитель.ШтукВКоробочке КАК ШтукВКоробочке,
	|	т1.Номенклатура.Родитель.ШтукВКоробке КАК ШтукВКоробке,
	|	ВЫБОР
	|		КОГДА &РазбиватьКратноКоробу
	|			ТОГДА т1.ШтукВКоробке * т1.МножительДляКороба
	|		ИНАЧЕ т1.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА т1.КоличествоЦветов = 0
	|			ТОГДА 1
	|		КОГДА &РазбиватьПоКоличествуЦветов
	|			ТОГДА т1.КоличествоЦветов
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоличествоЦветов,
	|	ВЫБОР
	|		КОГДА т1.КоличествоКМП = 0
	|			ТОГДА 0
	|		КОГДА &РазбиватьПоКоличествуВСпайке
	|			ТОГДА т1.КоличествоКМП
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоличествоКМП,
	|	ВЫБОР
	|		КОГДА &РазбиватьПоСпособуПоставки
	|			ТОГДА т1.СпособПоставки
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособПоставкиКонтрагенту.Микс)
	|	КОНЕЦ КАК СпособПоставки,
	|	ВЫБОР
	|		КОГДА &РазбиватьПоНоменклатурнымМатрицам
	|			ТОГДА ЕСТЬNULL(т1.НоменклатурнаяМатрица, ЗНАЧЕНИЕ(Документ.Матрица.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.Матрица.ПустаяСсылка)
	|	КОНЕЦ КАК НоменклатурнаяМатрица,
	|	т1.ПунктДоставки КАК ПунктДоставки,
	|	ВЫБОР
	|		КОГДА &РазбиватьПоНоменклатурнымМатрицам
	|			ТОГДА ЕСТЬNULL(т1.НоменклатурнаяМатрица.ПостояннаяАкция, ЛОЖЬ)
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПостояннаяАкция,
	|	ВЫБОР
	|		КОГДА &РазбиватьНакладныеПоВидуСпаек
	|				И т1.Номенклатура.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВидКомплекта,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(т1.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|				И ЕСТЬNULL(т1.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1)) < &ТекущаяДата
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Маркировка,
	|	т1.Расходник КАК Расходник
	|ИЗ
	|	(ВЫБРАТЬ
	|		Товары.Номенклатура КАК Номенклатура,
	|		Товары.СпособПоставки КАК СпособПоставки,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Комплектующие.Номенклатура.Цвет) КАК КоличествоЦветов,
	|		МАКСИМУМ(ЕСТЬNULL(Товары.КОтгрузке, 0)) КАК Количество,
	|		СУММА(ЕСТЬNULL(Комплектующие.Количество, 0)) КАК КоличествоКМП,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА Товары.Номенклатура.Родитель.ШтукВКоробке <> 0
	|					ТОГДА Товары.Номенклатура.Родитель.ШтукВКоробке
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|							ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|						ИНАЧЕ 1
	|					КОНЕЦ
	|			КОНЕЦ) КАК ШтукВКоробке,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА ЕСТЬNULL(Товары.КОтгрузке, 0) / ВЫБОР
	|							КОГДА Товары.Номенклатура.Родитель.ШтукВКоробке <> 0
	|								ТОГДА Товары.Номенклатура.Родитель.ШтукВКоробке
	|							ИНАЧЕ ВЫБОР
	|									КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|										ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|									ИНАЧЕ 1
	|								КОНЕЦ
	|						КОНЕЦ > 0
	|						И ЕСТЬNULL(Товары.КОтгрузке, 0) <> ВЫБОР
	|							КОГДА Товары.Номенклатура.Родитель.ШтукВКоробке <> 0
	|								ТОГДА Товары.Номенклатура.Родитель.ШтукВКоробке
	|							ИНАЧЕ ВЫБОР
	|									КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|										ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|									ИНАЧЕ 1
	|								КОНЕЦ
	|						КОНЕЦ
	|					ТОГДА (ВЫРАЗИТЬ(ЕСТЬNULL(Товары.КОтгрузке, 0) / ВЫБОР
	|								КОГДА Товары.Номенклатура.Родитель.ШтукВКоробке <> 0
	|									ТОГДА Товары.Номенклатура.Родитель.ШтукВКоробке
	|								ИНАЧЕ ВЫБОР
	|										КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|											ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|										ИНАЧЕ 1
	|									КОНЕЦ
	|							КОНЕЦ - 0.5 КАК ЧИСЛО(15, 0))) + 1
	|				ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(Товары.КОтгрузке, 0) / ВЫБОР
	|							КОГДА Товары.Номенклатура.Родитель.ШтукВКоробке <> 0
	|								ТОГДА Товары.Номенклатура.Родитель.ШтукВКоробке
	|							ИНАЧЕ ВЫБОР
	|									КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|										ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|									ИНАЧЕ 1
	|								КОНЕЦ
	|						КОНЕЦ - 0.5 КАК ЧИСЛО(15, 0))
	|			КОНЕЦ) КАК МножительДляКороба,
	|		Товары.НоменклатурнаяМатрица КАК НоменклатурнаяМатрица,
	|		Товары.ПунктДоставки КАК ПунктДоставки,
	|		МАКСИМУМ(Расходники.Номенклатура) КАК Расходник
	|	ИЗ
	|		Документ.ДвижениеТовараВнешнегоКонтрагента.Товары КАК Товары
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК Комплектующие
	|			ПО Товары.Номенклатура = Комплектующие.Ссылка
	|				И (Комплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК Расходники
	|			ПО Товары.Номенклатура = Расходники.Ссылка
	|				И (Расходники.Номенклатура.Родитель.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар))
	|	ГДЕ
	|		Товары.Ссылка = &Ссылка
	|		И Товары.КОтгрузке > 0
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Товары.Номенклатура,
	|		Товары.СпособПоставки,
	|		Товары.НоменклатурнаяМатрица,
	|		Товары.ПунктДоставки) КАК т1
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	СпособПоставки,
	|	КоличествоЦветов,
	|	КоличествоКМП,
	|	ПостояннаяАкция,
	|	НоменклатурнаяМатрица,
	|	ПунктДоставки,
	|	Маркировка,
	|	Расходник,
	|	Номенклатура";
	// Шворобей ВЮ 18.01.2023 ++
	
	// Кухарь А.Ю.  24.11.2022 начало
	//По просьбе Натальи вернул разбивку для ВБ
	// 	Запрос.УстановитьПараметр("РазбиватьПоСпособуПоставки",ложь);
	// Кухарь А.Ю.  06.08.2024 начало
	// 	Если Контрагент.Код="SSR-9059" тогда
	Если Контрагент.Код="SSR-9059" или Контрагент.Код="SST-1208" тогда
		// Кухарь А.Ю.  06.08.2024 конец
		
		Запрос.УстановитьПараметр("РазбиватьПоСпособуПоставки",Истина);
		// Малахов В.С. 18.01.24 начало
		//По просьбе Алины убрали разбивку для микс 3 паллеты 
		ОтклРазбивку=" и не т1.СпособПоставки=ЗНАЧЕНИЕ(Перечисление.СпособПоставкиКонтрагенту.МиксПаллеты3Артикула)";
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"КОГДА &РазбиватьКратноКоробу","КОГДА &РазбиватьКратноКоробу"+ОтклРазбивку);
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"КОГДА &РазбиватьПоКоличествуЦветов","КОГДА &РазбиватьПоКоличествуЦветов"+ОтклРазбивку);
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"КОГДА &РазбиватьПоКоличествуВСпайке","КОГДА &РазбиватьПоКоличествуВСпайке"+ОтклРазбивку);
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"КОГДА &РазбиватьПоНоменклатурнымМатрицам","КОГДА &РазбиватьПоНоменклатурнымМатрицам"+ОтклРазбивку);
		//Малахов В.С. 18.01.24 конец
	иначе
		Запрос.УстановитьПараметр("РазбиватьПоСпособуПоставки",ложь);
	КонецЕсли;
	// Кухарь А.Ю.  24.11.2022 конец
	
	Запрос.УстановитьПараметр("РазбиватьКратноКоробу", РазбиватьКратноКоробу);
	Запрос.УстановитьПараметр("РазбиватьПоКоличествуВСпайке",Истина);
	Запрос.УстановитьПараметр("РазбиватьПоКоличествуЦветов",Истина);
	// Кухарь А.Ю.  10.09.2024 начало
	//
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата()); 
	// Кухарь А.Ю.  10.09.2024 конец
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	// Шворобей ВЮ 18.01.2023 ++
	Запрос.УстановитьПараметр("РазбиватьПоНоменклатурнымМатрицам", Истина);
	// Шворобей ВЮ 08.07.2024 ++
	Запрос.УстановитьПараметр("РазбиватьНакладныеПоВидуСпаек", Ложь);
	// Шворобей ВЮ 08.07.2024 ++
	
	ВыборкаСпособовПоставки = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"СпособПоставки");  // 1
	Пока ВыборкаСпособовПоставки.Следующий() цикл
		
		// Кухарь А.Ю.  24.11.2022 начало
		//По просьбе Натальи вернул разбивку для ВБ
		// Кухарь А.Ю.  06.08.2024 начало
		// 	если Контрагент.Код="SSR-9059"  тогда
		если Контрагент.Код="SSR-9059" или Контрагент.Код="SST-1208"   тогда 
			// Кухарь А.Ю.  06.08.2024 конец
			
			КСпособПоставки=""+ВыборкаСпособовПоставки.СпособПоставки;
		иначе
			КСпособПоставки="";
		КонецЕсли;
		// Кухарь А.Ю.  24.11.2022 конец
		
		ВыборкаКоличествоЦветов=ВыборкаСпособовПоставки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"КоличествоЦветов");   // 2
		Пока ВыборкаКоличествоЦветов.Следующий() Цикл
			
			кКоличествоЦветов=", количество цветов "+ВыборкаКоличествоЦветов.КоличествоЦветов;
			
			ВыборкаВидовНоменклатуры=ВыборкаКоличествоЦветов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"КоличествоКМП");  // 3
			// Кухарь А.Ю. 17.02.2022 конец
			
			// Кухарь А.Ю. 12.11.2020 начало
			Пока ВыборкаВидовНоменклатуры.Следующий() Цикл
				// Кухарь А.Ю. 17.02.2022 начало
				//
				кКоличествоКМП=", количество КМП "+ВыборкаВидовНоменклатуры.КоличествоКМП;
				
				ВыборкаПоПостояннымАкциям = ВыборкаВидовНоменклатуры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ПостояннаяАкция");  // 4
				
				Пока ВыборкаПоПостояннымАкциям.Следующий() Цикл
					
					ВыборкаПоНоменклатурнымМатрицам = ВыборкаПоПостояннымАкциям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"НоменклатурнаяМатрица"); // 5
					
					Пока ВыборкаПоНоменклатурнымМатрицам.Следующий() Цикл
						//Михайловский С. 20230314 +++
						ВыборкаПоПунктамДоставки = ВыборкаПоНоменклатурнымМатрицам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ПунктДоставки");   // 6
						
						Пока ВыборкаПоПунктамДоставки.Следующий() Цикл
						
							ВыборкаПоМаркировке = ВыборкаПоПунктамДоставки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Маркировка");  // 7
						
							Пока ВыборкаПоМаркировке.Следующий() Цикл
								
								кМаркировка = ?(ВыборкаПоМаркировке.Маркировка = Истина, ", товар маркирован", ", товар без маркировки");
								// Кухарь А.Ю. 26.03.2025 начало
								// ВыборкаНоменклатуры = ВыборкаПоМаркировке.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Номенклатура");  // 8

								ВыборкаПоРасходнику=ВыборкаПоМаркировке.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Расходник");  
								пока ВыборкаПоРасходнику.Следующий() цикл
									ВыборкаНоменклатуры = ВыборкаПоРасходнику.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Номенклатура");  // 9
									// Кухарь А.Ю. 26.03.2025 конец
									
									
									
									// Кухарь А.Ю. 12.11.2020 конец
									// Шворобей ВЮ 27.10.2022 ++
									Если КакойДокументСоздавать = "РНК" Тогда
										МНовДок = СоздатьРНКНаСпособПоставки_Ф11(ВыборкаСпособовПоставки.СпособПоставки,ВыборкаПоПунктамДоставки.ПунктДоставки,
										ВыборкаНоменклатуры,ЕстьРаздел,ЛимПоз,КСпособПоставки + кКоличествоЦветов + кКоличествоКМП);
									ИначеЕсли КакойДокументСоздавать = "ЗаявкаНаПерепаковку" Тогда
										МНовДок = Документы.ДвижениеТовараВнешнегоКонтрагента.СоздатьЗаявкуНаПерепаковкуНаСпособПоставки_Ф1(Ссылка,
										ВыборкаНоменклатуры, СкладДОП, КСпособПоставки + кКоличествоЦветов + кКоличествоКМП, ЕстьРаздел, ЛимПоз);
									КонецЕсли;
									
									Если МНовДок.Количество() Тогда
										Для Каждого НовДок Из МНовДок Цикл
											МассивДокументов.Добавить(НовДок);
										КонецЦикла;	
									КонецЕсли;
									// Кухарь А.Ю. 26.03.2025 начало
									// Пустая задача
								КонецЦикла; 
								// Кухарь А.Ю. 26.03.2025 конец
								
							КонецЦикла;
						
						КонецЦикла;
						
					КонецЦикла;
					
				КонецЦикла;
				// Шворобей ВЮ 27.10.2022 ++
			КонецЦикла; 
			// Кухарь А.Ю. 17.02.2022 начало
		КонецЦикла;
		// Кухарь А.Ю. 17.02.2022 конец
		
	КонецЦикла;
	
	Если ТранзакцияАктивна() Тогда
		Если ОткатыватьТранзацию = Истина Тогда
			ОтменитьТранзакцию();
		Иначе
			ЗафиксироватьТранзакцию(); 
		КонецЕсли;
	КонецЕсли;
	// Кухарь А.Ю. 24.05.2024 конец
	
	Возврат МассивДокументов;
	
КонецФункции
//Михайловский С. 20230314 ---

//Михайловский С. 20220224 +++
Функция РазбиватьРНК()
	Рез=Новый Структура;
	Рез.Вставить("Разбивка",Ложь);
	Рез.Вставить("Склады",неопределено);
	Попытка
		Запрос=Новый Запрос;
		Запрос.Текст=
		"ВЫБРАТЬ 
		|	ИнетМагазиныСкладыПодсортировкиFBO.Ссылка КАК Ссылка,
		|	ИнетМагазиныСкладыПодсортировкиFBO.Ссылка.СоздаватьПодсортировкиFBO КАК СоздаватьПодсортировкиFBO,
		|	ИнетМагазиныСкладыПодсортировкиFBO.Склад КАК Склад
		|ИЗ
		|	Справочник.ИнетМагазины.СкладыПодсортировкиFBO КАК ИнетМагазиныСкладыПодсортировкиFBO
		|ГДЕ
		|	ИнетМагазиныСкладыПодсортировкиFBO.Ссылка.Контрагент = &Контрагент";
		Запрос.УстановитьПараметр("Контрагент", Ссылка.Контрагент);
		ТЗ=Запрос.Выполнить().Выгрузить();
		Если ТЗ.Количество() Тогда
			Рез.Вставить("Разбивка",ТЗ[0].СоздаватьПодсортировкиFBO);
			Рез.Вставить("Склады",ТЗ.ВыгрузитьКолонку("Склад"));
		КонецЕсли;	
	Исключение
	КонецПопытки;
	Возврат Рез;
КонецФункции	
//Михайловский С. 20220224 ---
// Кухарь А.Ю. 17.02.2022 начало
//Процедура СоздатьРНКНаСпособПоставки(СпособПоставки,ВыборкаНоменклатуры)

Функция КонтрольПоКолвоРНК(РНКСсыл,ЛимПоз)
	сообщить("Контроль кол-ва "+Строка(РНКСсыл));
	Рез=Новый Структура;
	
	//МасЗак=Новый Массив;
	МасРНК=Новый Массив;
	ЗаписатьВЛог("ВБрзВБО","Начало выполнения. Задача: Контроль колво ВБ.!  ","Информация");
	СостНакл=РНКСсыл.СостояниеНакладной;
	РЗ=РежимЗаписиДокумента.Запись;
	Если РНКСсыл.Проведен Тогда
		РЗ=РежимЗаписиДокумента.Проведение;
	КонецЕсли;	
	Компл=РНКСсыл.ОтгрузкаКомплектов;
	
	ДокРНК=РНКСсыл.ПолучитьОбъект();
	
	
	МасРНК.Добавить(РНКСсыл);
	
	//Рез.Вставить("МасЗак",МасЗак);
	Рез.Вставить("МасРНК",МасРНК);
	
	
	Если Компл Тогда
		ТЗНом1=РНКСсыл.Комплектующие.Выгрузить();
	Иначе
		ТЗНом1=РНКСсыл.Товары.Выгрузить();
	КонецЕсли;
	ТотКол=ТЗНом1.Итог("Количество");
	сообщить("ОКол "+Строка(ТотКол));
	к=ТЗНом1.Количество()-1;
	Если ТотКол<=ЛимПоз Тогда
		сообщить("Контроль кол-ва ок "+Строка(РНКСсыл));
		ЗаписатьВЛог("ВБрзВБО","Контроль кол-ва ок "+Строка(РНКСсыл)+"ОКол "+Строка(ТотКол),"Информация");
		
		//ДокРНК.СостояниеНакладной=СостНакл;
		//ДокРНК.Записать(РЗ);
		//ЗаписатьВЛог("ВБрз","Окончание выполнения. Задача: Контроль остатка ВБ Переведено в состояние КОтправкеНаСклад! 3 позиций менее предельного  ","Информация");
		Возврат Рез;
	КонецЕсли;	
	ЗаписатьВЛог("ВБрзВБО","Контроль кол-ва ок "+Строка(РНКСсыл)+" ОКол "+Строка(ТотКол),"Информация");
	МасНом=Новый Массив;
	НачатьТранзакцию();
	Попытка
		//чтоб не цеплять остатки на др. доки
		Если ДокРНК.Проведен Тогда
			ДокРНК.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
		Если Цел(ТотКол/ЛимПоз)=(ТотКол/ЛимПоз) Тогда
			КолИтер=Цел(ТотКол/ЛимПоз);
		Иначе	
			КолИтер=Цел(ТотКол/ЛимПоз)+1;
		КонецЕсли;	
		//ДокРНК=РНКСсыл.ПолучитьОбъект();
		н=КолИтер-1;
		ТекКол=ТотКол;
		ЛокКол=0;
		Пока н>0 Цикл
			
			//ДокЗак2=Документы.ЗаказКлиентаFBS.СоздатьДокумент();
			//ЗаполнитьЗначенияСвойств(ДокЗак2,ЗаказКФ);
			МасНом.Очистить();
			Пока Истина Цикл
				
				ТекСтр=ТЗНом1.Получить(к);
				ЛокКол=ЛокКол+ТекСтр.Количество;
				Если Компл Тогда
					Если МасНом.Найти(ТекСтр.Продукция)=неопределено Тогда
						МасНом.Добавить(ТекСтр.Продукция);
					КонецЕсли;
				Иначе	
					Если МасНом.Найти(ТекСтр.Номенклатура)=неопределено Тогда
						МасНом.Добавить(ТекСтр.Номенклатура);
					КонецЕсли;	
				КонецЕсли;	
				Если ((ТотКол-ЛокКол)<(ЛимПоз*н)) ИЛИ (к<=0) Тогда
					ЗаписатьВЛог("ВБрзВБО","Контроль кол-ва "+Строка(РНКСсыл)+" ОКол "+Строка(ТотКол)+" ТКол "+Строка(ЛокКол),"Информация");
					Прервать;
				КонецЕсли;
				к=к-1;
			КонецЦикла;
			Если МасНом.Количество() Тогда
				ДокРНК21=Документы.РасходнаяНакладная.СоздатьДокумент();
				ЗаполнитьЗначенияСвойств(ДокРНК21,ДокРНК);
				// Кухарь А.Ю.  28.03.2024 начало
				если ЗначениеЗаполнено(Договор) тогда
					ДокРНК21.Организация=Договор.Организация; 
				КонецЕсли;
				// Кухарь А.Ю.  28.03.2024 конец
				
				
				ДокРНК21.Товары.Очистить();
				т=ДокРНК.Товары.Количество()-1;
				Пока т>=0 Цикл
					ТекСтр=ДокРНК.Товары.Получить(т);
					Ном=ТекСтр.Номенклатура;
					Если НЕ МасНом.Найти(Ном)=неопределено Тогда
						НовСтр=ДокРНК21.Товары.Добавить();
						ЗаполнитьЗначенияСвойств(НовСтр,ТекСтр);
						ДокРНК.Товары.Удалить(т);
					КонецЕсли;
					т=т-1;
				КонецЦикла;	
				
				
				
				Если Компл Тогда
					ЗаполнитьКомплектующие(ДокРНК21);
				КонецЕсли;
				ДокРНК21.СостояниеНакладной=СостНакл;
				ДокРНК21.Дата=ТекущаяДатаСеанса();
				УстановитьНомерДокументаКлиентСервер(ДокРНК21);
				Если ДокРНК21.Товары.Количество() Тогда
					Попытка
						//ПунктДоставки_ПриИзменении(ДокРНК21.ПунктДоставки,ДокРНК21);
						ДокРНК21.Дата=ТекущаяДата();
						
						ДокРНК21.Комментарий=ДокРНК21.Комментарий+" исх. док-т "+Строка(РНКСсыл);
						ДокРНК21.Записать(РЗ);
					Исключение
						ДокРНК21.Проведен=Ложь;
						ДокРНК21.Записать(РежимЗаписиДокумента.Запись);
					КонецПопытки;
					сообщить("Контроль кол-ва добавляем "+Строка(ДокРНК21.Ссылка));			
					МасРНК.Добавить(ДокРНК21.Ссылка);
					ЗаписатьВЛог("ВБрзВБО","Контроль кол-ва  кол0  "+Строка(ДокРНК.Товары.Количество())+" Кол1 "+Строка(ДокРНК21.Товары.Количество()),"Информация");
				КонецЕсли;
			КонецЕсли;
			н=н-1;
		КонецЦикла;	
		
		Если Компл Тогда
			ЗаполнитьКомплектующие(ДокРНК);
		КонецЕсли;
		
		
		
		ДокРНК.СостояниеНакладной=СостНакл;
		//ДокРНК.Записать(РЗ);
		Попытка
			//ПунктДоставки_ПриИзменении(ДокРНК.ПунктДоставки,ДокРНК);
			ДокРНК.Дата=ТекущаяДата();
			ДокРНК.Записать(РЗ);
		Исключение
			ДокРНК.Проведен=Ложь;
			ДокРНК.Дата=ТекущаяДата();
			ДокРНК.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		ЗаписатьВЛог("ВБрзВБО","Контроль кол-ва ок кол0  "+Строка(РНКСсыл.Товары.Количество())+" ОКол1 "+Строка(ДокРНК21.Товары.Количество()),"Информация");
		ЗафиксироватьТранзакцию();
	Исключение
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		ЗаписатьВЛог("ВБрзФБО"," !ошибка при формировании документов в ходе контроля кол-ва "+ ОписаниеОшибки(),"Информация");
	КонецПопытки;
	
	
	
	Рез.Вставить("МасРНК",МасРНК);
	Возврат Рез;
КонецФункции	

Процедура ЗаполнитьКомплектующие(РНК)
	
	РНК.Комплектующие.Очистить();
	
	// Кухарь А.Ю.  15.08.2022 начало
	Запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НоменклатураКоплектующие.Номенклатура КАК Запчасть,
	|	НоменклатураКоплектующие.Номенклатура.НоменклатураЗамены КАК ЗаменаЗапчасти,
	|	НоменклатураКоплектующие.Ссылка КАК Продукция
	|ИЗ
	|	Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
	|ГДЕ
	|	НоменклатураКоплектующие.Ссылка В(&СписокНоменклатуры)";
	запрос.УстановитьПараметр("СписокНоменклатуры",РНК.товары.ВыгрузитьКолонку("Номенклатура"));
	ТаблицаЗамен=запрос.Выполнить().Выгрузить();
	// Кухарь А.Ю.  15.08.2022 конец
	
	
	Для Каждого СтрокаТоваров Из РНК.Товары Цикл	
		
		Если СтрокаТоваров.Количество = 0 Тогда 
			Продолжить 
		КонецЕсли; 
		
		Номенклатура = СтрокаТоваров.Номенклатура;
		
		Если Номенклатура.Коплектующие.Количество() > 0 Тогда
			// комплект
			Для Каждого СтрокаКомплекта Из Номенклатура.Коплектующие Цикл
				Если СтрокаКомплекта.Количество = 0 Тогда 
					Продолжить 
				КонецЕсли; 
				
				СтрокаТЧ = РНК.Комплектующие.Добавить();	
				
				СтрокаТЧ.Продукция		= Номенклатура;
				СтрокаТЧ.Номенклатура	= СтрокаКомплекта.Номенклатура;
				
				// Кухарь А.Ю.  15.08.2022 начало
				СтрокаЗамены=ТаблицаЗамен.Найти(СтрокаТЧ.Номенклатура,"Запчасть");
				если СтрокаЗамены<>Неопределено и ЗначениеЗаполнено(СтрокаЗамены.ЗаменаЗапчасти) тогда
					СтрокаТЧ.Номенклатура	= СтрокаЗамены.ЗаменаЗапчасти;
				КонецЕсли;				
				// Кухарь А.Ю.  15.08.2022 конец
				
				
				ПриИзмененииНоменклатурыТабЧасти(СтрокаТЧ, РНК);
				
				СтрокаТЧ.Единица		= СтрокаКомплекта.Единица;
				СтрокаТЧ.Коэффициент	= СтрокаКомплекта.Коэффициент;
				СтрокаТЧ.Количество		= СтрокаКомплекта.Количество * СтрокаТоваров.Количество * СтрокаТоваров.Коэффициент; // и разделить на СтрокаКомплекта.Коэффициент?
				//нечаева 06,03,18+++
				РассчитатьСуммуТабЧасти(СтрокаТЧ, РНК);
				//нечаева 06,03,18---
				
				РНК.ОтгрузкаКомплектов =истина;
				
			КонецЦикла; 
		Иначе			
			// обычный товар
			СтрокаТЧ = РНК.Комплектующие.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаТоваров);
			СтрокаТЧ.Продукция = Номенклатура;
		КонецЕсли;
		
	КонецЦикла;	
	
	//нечаева 02,02,21
	Если НЕ РНК.ОтгрузкаКомплектов =истина Тогда
		РНК.Комплектующие.Очистить();
	КонецЕсли;	
	// нечаева 02,02,21 ---
	
	
	
	
	
	
КонецПроцедуры

Процедура ПунктДоставки_ПриИзменении(ПунктДоставки,РНК) Экспорт
	//  19.08.2020 Кухарь конец
	
	
	
	//Кухарь 01.05.18 начало
	//Будем тип доставки фиксировать в документах
	ТипДоставки=ПунктДоставки.ТипДоставки;
	//Кухарь 01.05.18 конец
	
	
	Если НЕ ПунктДоставки.Пустая() Тогда
		
		
		НуженПересчетЦен=Ложь;
		
		Если ЗначениеЗаполнено(ПунктДоставки.Договор)  Тогда
			РНК.Договор=ПунктДоставки.Договор;
			//	РНК.Договор_ПриИзменении(Неопределено);
		КонецЕсли;
		
		//крохин конец 07.04.2011
		
		//доставка
		Если ЗначениеЗаполнено(ПунктДоставки.РайонДоставки) Тогда
			РНК.РайонДоставки=ПунктДоставки.РайонДоставки;			
		КонецЕсли;	
		Если ЗначениеЗаполнено(ПунктДоставки.Регион) Тогда
			рнк.Регион=ПунктДоставки.Регион;			
		КонецЕсли;	
		
		если РНК.ПунктДоставки.ТипДоставки=Перечисления.ТипыДоставки.ТранспортнаяКомпания тогда
			Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
				РНК.ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
			иначе
				РНК.ТранспортнаяКомпания=Справочники.Контрагенты.ПустаяСсылка();
			КонецЕсли;	
			Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
				РНК.ПунктПерегруза=ПунктДоставки.ПунктПерегруза;
			иначе
				РНК.ПунктПерегруза=Справочники.ПунктыДоставки.ПустаяСсылка();
			КонецЕсли;	
		иначе
			РНК.ТранспортнаяКомпания=Справочники.Контрагенты.ПустаяСсылка();	
			РНК.ПунктПерегруза=Справочники.ПунктыДоставки.ПустаяСсылка();
		КонецЕсли;
		//Кухарь 26.01.16 конец
		
		Если ЗначениеЗаполнено(ПунктДоставки.Грузополучатель) Тогда
			РНК.Грузополучатель=ПунктДоставки.Грузополучатель;		
		КонецЕсли;
		Если ЗначениеЗаполнено(ПунктДоставки.Получатель) Тогда
			РНК.Получатель=ПунктДоставки.Получатель;		
		КонецЕсли;
		Если ЗначениеЗаполнено(ПунктДоставки.ОтсрочкаПлатежа) Тогда
			РНК.ОтсрочкаПлатежа=ПунктДоставки.ОтсрочкаПлатежа;		
		КонецЕсли;
		
		//типы цен скидки
		Если ЗначениеЗаполнено(ПунктДоставки.ТипЦен) И РНК.ТипЦен<>ПунктДоставки.ТипЦен Тогда
			РНК.ТипЦен=ПунктДоставки.ТипЦен;		
			РНК.НуженПересчетЦен=Истина;
		КонецЕсли; 
		Если ЗначениеЗаполнено(ПунктДоставки.ТипСкидок) И РНК.ТипСкидок<>ПунктДоставки.ТипСкидок Тогда
			РНК.ТипСкидок=ПунктДоставки.ТипСкидок;		
			РНК.НуженПересчетЦен=Истина;
		КонецЕсли;
		Если ПунктДоставки.Скидка<>0 И ПунктДоставки.Скидка<>РНК.Скидка Тогда
			РНК.Скидка=ПунктДоставки.Скидка;		
			РНК.НуженПересчетЦен=Истина;
		КонецЕсли;
		Если НуженПересчетЦен Тогда
			ПересчетТЧ(РНК,"Товары",РНК.Валюта,РНК.Валюта,РНК.Курс,РНК.Курс,Истина);			
		КонецЕсли;	
		//крохин начало 29.03.2011
		//ставка НДС
		//Если ПунктДоставки.НулеваяСтавкаНДС или Контрагент.НулеваяСтавкаНДС Тогда
		//	РНК.НулеваяСтавкаНДС = Истина;	
		//	НулеваяСтавкаНДСПриИзменении(Неопределено);
		//	//крохин начало 03.10.2012
		//ИначеЕсли НулеваяСтавкаНДС Тогда
		//	НулеваяСтавкаНДС = Ложь;
		//	НулеваяСтавкаНДСПриИзменении(Неопределено);
		//	//крохин конец 03.10.2012
		//КонецЕсли;
		//крохин конец 29.03.2011
		//УстановитьЗаголовокКнопкиЦеныВалюта(ЭтаФорма);
	КонецЕсли; 
	//крохин начало 15.04.2011
	//Доп. обработки, заполняем из пункта доставки, если они там есть
	//Если ДопОбработки.Количество()>0 Тогда
	//	Предупреждение("Доп. обработки будут перезаполнены по умолчанию из карточки контрагента !");
	//КонецЕсли;	
	РНК.ДопОбработки.Очистить();
	Если ПунктДоставки.ВидыДопОбработок.Количество() = 0 Тогда
		Для Каждого СтрокаТЧ Из Контрагент.ВидыДопОбработок Цикл
			СтрокаДО=РНК.ДопОбработки.Добавить();	
			СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
		КонецЦикла;
	Иначе
		Для Каждого СтрокаТЧ Из ПунктДоставки.ВидыДопОбработок Цикл
			СтрокаДО=РНК.ДопОбработки.Добавить();	
			СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
		КонецЦикла;
		
	КонецЕсли;
	//крохин конец 15.04.2011
	//крохин начало 29.04.2011
	КодПоставщикаПунктаДоставки=ПунктДоставки.КодПоставщика;
	Если НЕ КодПоставщикаПунктаДоставки.Пустая() И РНК.КодПоставщика<>КодПоставщикаПунктаДоставки Тогда
		РНК.КодПоставщика=КодПоставщикаПунктаДоставки;
	КонецЕсли; 
	//крохин конец 29.04.2011
	
	//
	//РНК.ВремяДоставки=ПолучитьВремяПриемки(РНК.Ссылка);
	//если РНК.ВремяДоставки=Справочники.ВремяПриемки.ПустаяСсылка() или РНК.ВремяДоставки=Неопределено тогда
	//	пВремяДоставки=ПунктДоставки.ВремяДоставки;
	//иначе
	//	пВремяДоставки=РНК.ВремяДоставки;
	//КонецЕсли;
	
	РНК.ДатаПриемки=ОпределитьДатуАвизацииДокумента(РНК.Ссылка);	
	КодПоставщикаПунктаДоставки=ПунктДоставки.КодПоставщика;
	Если НЕ КодПоставщикаПунктаДоставки.Пустая() И РНК.КодПоставщика<>КодПоставщикаПунктаДоставки Тогда
		РНК.КодПоставщика=КодПоставщикаПунктаДоставки;
	КонецЕсли; 
	Если ЗначениеЗаполнено(ПунктДоставки.СкладКомиссия) Тогда
		РНК.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия;
		РНК.СкладКомиссия = ПунктДоставки.СкладКомиссия;
		//	ДоговорКомиссия = ПунктДоставки.ДоговорКомиссия;
	Иначе
		Если РНК.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия Тогда
			РНК.КодОперации = Перечисления.КодыОперацийОстатки.Реализация;
			РНК.СкладКомиссия = Справочники.Склады.ПустаяСсылка();
			//		ДоговорКомиссия = Справочники.Договоры.ПустаяСсылка();
			
		КонецЕсли;	
	КонецЕсли;
	
	
КонецПроцедуры

Процедура РасчитатьТолькоКороба () экспорт
	ТЗМатрицы=ПолучитьТЗМатриц();	
	
	для каждого СтрТЧ из Товары цикл
		Номенклатура=СтрТЧ.Номенклатура;
		СтрМатрицы=ТЗМатрицы.найти(Номенклатура);
		
		если СтрМатрицы=Неопределено тогда
			Продолжить;		
		иначе		
		КонецЕсли;		
		
		
		// Кухарь А.Ю. 12.03.2021 начало
		// Количество коробов теперь реквизит ТЧ
		если СтрТЧ.КОтгрузке>0 тогда
			ШтукВКоробе=СтрМатрицы.КратностьКоробкиИзНоменклатуры;
			если ШтукВКоробе>0 тогда
				СтрТЧ.КоробокКОтгрузке=СтрТЧ.КОтгрузке/ШтукВКоробе;
			КонецЕсли;
		КонецЕсли;
		// Кухарь А.Ю. 12.03.2021 конец
		
		
	КонецЦикла;
	
КонецПроцедуры

// Кухарь А.Ю. 17.03.2021 конец

//////////// РАСЧЕТ /////////////////////////////////////////////////////////////////////////
////// СОЗДАНИЕ РНК /////////////////////////////////////////////////////////////////////////
//Данилова Е.В. 03.06.2026 0000000104 добавление параметра
Процедура СоздатьРНКНаСпособПоставки(СпособПоставки,ВыборкаНоменклатуры,КомментарийРНК="",СозданныеРНК = неопределено)
	
	// Кухарь А.Ю. 17.02.2022 конец
	
	Рнк = документы.РасходнаяНакладная.СоздатьДокумент();
	Рнк.Контрагент=Контрагент;
	Рнк.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
	// Шворобей ВЮ 11.03.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2410
	Рнк.Дата = ТекущаяДатаСеанса();
	// Шворобей ВЮ 10.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5396 
	//Рнк.ДатаОтгрузки = Рнк.Дата;
	// Шворобей ВЮ 10.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5396 
	// Шворобей ВЮ 11.03.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2410
	рнк.ПунктДоставки=ПунктДоставки;
	рнк.Договор=Договор;
	Рнк.ОтсрочкаПлатежа=Договор.ОтсрочкаПлатежа;
	
	// Кухарь А.Ю. 28.04.2022 начало
	рнк.Склад=СкладДОП;
	// Кухарь А.Ю. 28.04.2022 конец
	
	//++Данилова Е.В. 29.09.2025 HELP-7048
	//рнк.Подразделение=Контрагент.Менеджер.Подразделение;
	рнк.Подразделение=ЗаполнениеДокументов.ПодразделениеПродажПоМенеджеру(Контрагент.Менеджер);
	//--Данилова Е.В. 29.09.2025
	рнк.Менеджер=Контрагент.Менеджер;
	
	
	// Кухарь А.Ю. 17.02.2022 начало
	//
	если ЗначениеЗаполнено(КомментарийРНК) тогда
		рнк.Комментарий=КомментарийРНК;
	КонецЕсли;
	// Кухарь А.Ю. 17.02.2022 конец
	
	
	ЗаполнитьШапкуДокумента(РНК, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
	
	// Кухарь А.Ю. 04.02.2022 начало
	// Исправление
	рнк.КодОперации=Перечисления.КодыОперацийОстатки.Комиссия;
	УстановитьНомерДокументаКлиентСервер(РНК); 
	// Кухарь А.Ю. 04.02.2022 конец
	
	// Кухарь А.Ю.  28.03.2024 начало
	если ЗначениеЗаполнено(Договор) тогда
		рнк.Организация=Договор.Организация; 
	КонецЕсли;
	// Кухарь А.Ю.  28.03.2024 конец
	
	
	// Кухарь А.Ю. 11.01.2021 начало
	// цены почему-то не заполняются
	Если НЕ ЗначениеЗаполнено(рнк.ТипЦенРаспродажа) тогда
		рнк.ТипЦенРаспродажа=РНК.Контрагент.ТипЦенРаспродажа;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(рнк.ТипЦен) тогда
		рнк.ТипЦен=Контрагент.ТипЦен;
	КонецЕсли;
	// Кухарь А.Ю. 11.01.2021 конец
	
	РНК.ПунктДоставки = ПунктДоставки;
		
	// Шворобей ВЮ 22.10.2024 ++ https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2033
	Если НЕ ЗначениеЗаполнено(РНК.ПунктДоставки) Тогда
		РНК.ПунктДоставки = ЗаполнениеДокументов.УстановитьПунктДоставкиСервер(РНК);
		Если НЕ ЗначениеЗаполнено(РНК.ПунктДоставки) Тогда
			//++Данилова Е.В. 17.06.2026 №0000000008
			//СообщитьИзМодуля("Не удалось заполнить Пункт Доставки");
			Сообщить("Не удалось заполнить Пункт Доставки"); 
			//--Данилова Е.В. 17.06.2026 
		КонецЕсли;
	КонецЕсли;
		
	//ПунктДоставки_ПриИзменении(РНК.ПунктДоставки,РНК);
	Если ЗначениеЗаполнено(РНК.ПунктДоставки.РайонДоставки) Тогда
		РНК.РайонДоставки = РНК.ПунктДоставки.РайонДоставки;			
	КонецЕсли;	
	Если ЗначениеЗаполнено(РНК.ПунктДоставки.Регион) Тогда
		РНК.Регион = РНК.ПунктДоставки.Регион;			
	КонецЕсли;
	
	Если РНК.ПунктДоставки.ТипДоставки = Перечисления.ТипыДоставки.ТранспортнаяКомпания Тогда
		РНК.ТранспортнаяКомпания = ?(ЗначениеЗаполнено(РНК.ПунктДоставки.ТраспортнаяКомпания), РНК.ПунктДоставки.ТраспортнаяКомпания, Неопределено);
		РНК.ПунктПерегруза = ?(ЗначениеЗаполнено(РНК.ПунктДоставки.ПунктПерегруза), РНК.ПунктДоставки.ПунктПерегруза, Неопределено);
	Иначе
		РНК.ТранспортнаяКомпания = Неопределено;	
		РНК.ПунктПерегруза = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РНК.ПунктДоставки.Грузополучатель) Тогда
		РНК.Грузополучатель = РНК.ПунктДоставки.Грузополучатель;		
	КонецЕсли;
	Если ЗначениеЗаполнено(РНК.ПунктДоставки.Получатель) Тогда
		РНК.Получатель = РНК.ПунктДоставки.Получатель;		
	КонецЕсли;
	
	РНК.ДопОбработки.Очистить();
	Если РНК.ПунктДоставки.ВидыДопОбработок.Количество() = 0 Тогда
		Для Каждого СтрокаТЧ Из РНК.Контрагент.ВидыДопОбработок Цикл
			СтрокаДО = РНК.ДопОбработки.Добавить();	
			СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
		КонецЦикла;
	Иначе
		Для Каждого СтрокаТЧ Из РНК.ПунктДоставки.ВидыДопОбработок Цикл
			СтрокаДО = РНК.ДопОбработки.Добавить();	
			СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
		КонецЦикла;
	КонецЕсли;
	// Шворобей ВЮ 22.10.2024 ++ https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2033
	
	Пока ВыборкаНоменклатуры.Следующий() Цикл
		
		// Шворобей ВЮ 02.02.2023 ++
		рнк.ПостояннаяАкция = ВыборкаНоменклатуры.ПостояннаяАкция;
		// Шворобей ВЮ 02.02.2023 ++
		
		СтрТЧ=рнк.Товары.Добавить();
		СтрТЧ.Номенклатура=ВыборкаНоменклатуры.Номенклатура;
		СтрТЧ.Количество=ВыборкаНоменклатуры.Количество;
		СтрТЧ.Заявка=ВыборкаНоменклатуры.Количество;
		СтрТЧ.ПодтвержденнаяЗаявка=ВыборкаНоменклатуры.Количество;
		ПриИзмененииНоменклатурыТабЧасти(СтрТЧ, РНК);
		РассчитатьСуммуТабЧасти(СтрТЧ, РНК);
		
	КонецЦикла;
	
	Если Контрагент.ИспользоватьНоменклатурнуюМатрицу  Тогда
		ПересчетТЧМатрицы(РНК,"Товары",ПараметрыСеанса.ВалютаНац,ПараметрыСеанса.ВалютаНац,1,1);	
	Иначе
		ПересчетТЧ(РНК,"Товары",ПараметрыСеанса.ВалютаНац,ПараметрыСеанса.ВалютаНац,1,1,Истина);	
	Конецесли;		
	// Кухарь А.Ю. 11.01.2021 начало
	// На часть позиций нули.
	МассНулей=рнк.Товары.НайтиСтроки(Новый Структура("Цена",0)); 
	для каждого СтрМассНулей из МассНулей цикл 
		//++Данилова Е.В. 17.06.2026 №0000000008
		//СообщитьИзМодуля("Пустая цена у "+СтрМассНулей.номенклатура);
		Сообщить("Пустая цена у "+СтрМассНулей.номенклатура); 
		//--Данилова Е.В. 17.06.2026 
	КонецЦикла;
	// Кухарь А.Ю. 11.01.2021 конец
	
	//если РольДоступна("Администратор") тогда Возврат;КонецЕсли;
	
	// Кухарь А.Ю. 28.04.2022 начало
	//
	ОбменМаркетПлейс.ПунктДоставки_ПриИзменении(рнк); 
	// Кухарь А.Ю. 28.04.2022 конец
	
	
	рнк.Записать();
	// Кухарь 16.03.2022 начало
	// 
	//++Данилова Е.В. 17.06.2026 №0000000008
	//СообщитьИзМодуля(""+РНК); 
	Сообщить(""+РНК); 
	//--Данилова Е.В. 17.06.2026 
	
	// Кухарь  16.03.2022 конец
	//++Данилова Е.В. 03.06.2026 0000000104 
	//Форма=РНК.ПолучитьФорму("ФормаДокумента");
	//форма.Открыть();
	СозданныеРНК = Новый Массив; 
	СозданныеРНК.Добавить(РНК); 
	//--Данилова Е.В. 03.06.2026 
	// Кухарь А.Ю. 28.04.2022 начало
	// Кухарь А.Ю. 28.04.2022 конец
	
КонецПроцедуры
// Кухарь А.Ю. 02.09.2020 конец

Функция СоздатьРНКНаСпособПоставки_Ф1(СпособПоставки,ВыборкаНоменклатуры,ЕстьРаздел, ЛимПоз, КомментарийРНК="")
	
	Рез=Новый Массив;
	
	Если ЕстьРаздел И ЗначениеЗаполнено(ЛимПоз) Тогда
		СчтКол=ЛимПоз;
	Иначе
		СчтКол=10000000;
	КонецЕсли;	
	ТотПоз=ВыборкаНоменклатуры.Количество();
	сообщить("всего "+строка(тотпоз));
	н=0;
	ТекПоз=0;
	Пока Истина Цикл
		РНК=документы.РасходнаяНакладная.СоздатьДокумент();
		рнк.Контрагент=Контрагент;
		рнк.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
		
		// Шворобей ВЮ 11.03.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2410
		Рнк.Дата = ТекущаяДата();
		// Шворобей ВЮ 10.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5396
		//Рнк.ДатаОтгрузки = Рнк.Дата;
		// Шворобей ВЮ 10.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5396
		// Шворобей ВЮ 11.03.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2410
		
		рнк.Договор=Договор;
		Рнк.ОтсрочкаПлатежа=Договор.ОтсрочкаПлатежа;
		//Рнк.ДатаОплаты =ПолучитьДатуОплаты(ДатаОтгрузки,Рнк.ОтсрочкаПлатежа);
		// Кухарь А.Ю. 28.04.2022 начало
		// 	рнк.Склад=Константы.УзелТранспортногоОтдела.Получить().Подразделение.ОсновнойСклад;
		рнк.Склад=СкладДОП;
		// Кухарь А.Ю. 28.04.2022 конец
		//++Данилова Е.В. 29.09.2025 HELP-7048  
		//рнк.Подразделение=Контрагент.Менеджер.Подразделение;
		рнк.Подразделение=ЗаполнениеДокументов.ПодразделениеПродажПоМенеджеру(Контрагент.Менеджер); 
		//--Данилова Е.В. 29.09.2025
		рнк.Менеджер=Контрагент.Менеджер;
		
		// Кухарь А.Ю. 17.02.2022 начало
		//
		если ЗначениеЗаполнено(КомментарийРНК) тогда
			рнк.Комментарий=КомментарийРНК;
		КонецЕсли;
		// Кухарь А.Ю. 17.02.2022 конец
		
		ЗаполнитьШапкуДокумента(РНК, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
		
		// Кухарь А.Ю. 04.02.2022 начало
		// Исправление
		рнк.КодОперации=Перечисления.КодыОперацийОстатки.Комиссия;
		УстановитьНомерДокументаКлиентСервер(РНК); 
		// Кухарь А.Ю. 04.02.2022 конец
		
		// Кухарь А.Ю.  28.03.2024 начало
		если ЗначениеЗаполнено(Договор) тогда
			рнк.Организация = Договор.Организация; 
		КонецЕсли;
		// Кухарь А.Ю.  28.03.2024 конец
		
		// Кухарь А.Ю. 11.01.2021 начало
		// цены почему-то не заполняются
		если не ЗначениеЗаполнено(рнк.ТипЦенРаспродажа) тогда
			рнк.ТипЦенРаспродажа=РНК.Контрагент.ТипЦенРаспродажа;
		КонецЕсли;
		если не ЗначениеЗаполнено(рнк.ТипЦен) тогда
			рнк.ТипЦен=Контрагент.ТипЦен;
		КонецЕсли;
		// Кухарь А.Ю. 11.01.2021 конец
		
		РНК.ПунктДоставки = ПунктДоставки;
		
		// Шворобей ВЮ 22.10.2024 ++ https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2033
		Если НЕ ЗначениеЗаполнено(РНК.ПунктДоставки) Тогда
			РНК.ПунктДоставки = ЗаполнениеДокументов.УстановитьПунктДоставкиСервер(РНК);
			Если НЕ ЗначениеЗаполнено(РНК.ПунктДоставки) Тогда 
				//++Данилова Е.В. 17.06.2026 №0000000008
				//СообщитьИзМодуля("Не удалось заполнить Пункт Доставки");
				Сообщить("Не удалось заполнить Пункт Доставки"); 
				//--Данилова Е.В. 17.06.2026 
			КонецЕсли;
		КонецЕсли;
		
		//ПунктДоставки_ПриИзменении(РНК.ПунктДоставки,РНК);
		Если ЗначениеЗаполнено(РНК.ПунктДоставки.РайонДоставки) Тогда
			РНК.РайонДоставки = РНК.ПунктДоставки.РайонДоставки;			
		КонецЕсли;	
		Если ЗначениеЗаполнено(РНК.ПунктДоставки.Регион) Тогда
			РНК.Регион = РНК.ПунктДоставки.Регион;			
		КонецЕсли;
		
		Если РНК.ПунктДоставки.ТипДоставки = Перечисления.ТипыДоставки.ТранспортнаяКомпания Тогда
			РНК.ТранспортнаяКомпания = ?(ЗначениеЗаполнено(РНК.ПунктДоставки.ТраспортнаяКомпания), РНК.ПунктДоставки.ТраспортнаяКомпания, Неопределено);
			РНК.ПунктПерегруза = ?(ЗначениеЗаполнено(РНК.ПунктДоставки.ПунктПерегруза), РНК.ПунктДоставки.ПунктПерегруза, Неопределено);
		Иначе
			РНК.ТранспортнаяКомпания = Неопределено;	
			РНК.ПунктПерегруза = Неопределено;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РНК.ПунктДоставки.Грузополучатель) Тогда
			РНК.Грузополучатель = РНК.ПунктДоставки.Грузополучатель;		
		КонецЕсли;
		Если ЗначениеЗаполнено(РНК.ПунктДоставки.Получатель) Тогда
			РНК.Получатель = РНК.ПунктДоставки.Получатель;		
		КонецЕсли;
		
		РНК.ДопОбработки.Очистить();
		Если РНК.ПунктДоставки.ВидыДопОбработок.Количество() = 0 Тогда
			Для Каждого СтрокаТЧ Из РНК.Контрагент.ВидыДопОбработок Цикл
				СтрокаДО = РНК.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки = СтрокаТЧ.ДопОбработка;
			КонецЦикла;
		Иначе
			Для Каждого СтрокаТЧ Из РНК.ПунктДоставки.ВидыДопОбработок Цикл
				СтрокаДО = РНК.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки = СтрокаТЧ.ДопОбработка;
			КонецЦикла;
		КонецЕсли;
		// Шворобей ВЮ 22.10.2024 ++ https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2033
		
		л=0;
		ТекКол=0;
		сообщить(текпоз);
		ВыборкаНоменклатуры.Сбросить();
		Пока ВыборкаНоменклатуры.Следующий() цикл
			Если л>=ТекПоз Тогда
				
				// Шворобей ВЮ 02.02.2023 ++
				рнк.ПостояннаяАкция = ВыборкаНоменклатуры.ПостояннаяАкция;
				// Шворобей ВЮ 02.02.2023 ++
				
				СтрТЧ=рнк.Товары.Добавить();
				СтрТЧ.Номенклатура=ВыборкаНоменклатуры.Номенклатура;
				СтрТЧ.Количество=ВыборкаНоменклатуры.Количество;
				СтрТЧ.Заявка=ВыборкаНоменклатуры.Количество;
				СтрТЧ.ПодтвержденнаяЗаявка=ВыборкаНоменклатуры.Количество;
				Если ВыборкаНоменклатуры.Номенклатура.Коплектующие.Количество() Тогда
					ТЗК=ВыборкаНоменклатуры.Номенклатура.Коплектующие.Выгрузить();
					ТекКол=ТекКол+(ВыборкаНоменклатуры.Количество*ТЗК.Итог("Количество"));
				Иначе
					ТекКол=ТекКол+(ВыборкаНоменклатуры.Количество);
				КонецЕсли;
				ПриИзмененииНоменклатурыТабЧасти(СтрТЧ, РНК);
				РассчитатьСуммуТабЧасти(СтрТЧ, РНК);
				ТекПоз=ТекПоз+1;
			КонецЕсли;
			Если ТекКол>СчтКол Тогда
				Прервать;
			КонецЕсли;	
			л=л+1;
		КонецЦикла;		
		Если Контрагент.ИспользоватьНоменклатурнуюМатрицу  Тогда
			ПересчетТЧМатрицы(РНК,"Товары",ПараметрыСеанса.ВалютаНац,ПараметрыСеанса.ВалютаНац,1,1);	
		Иначе
			ПересчетТЧ(РНК,"Товары",ПараметрыСеанса.ВалютаНац,ПараметрыСеанса.ВалютаНац,1,1,Истина);	
		Конецесли;		
		// Кухарь А.Ю. 11.01.2021 начало
		// На часть позиций нули.
		МассНулей=рнк.Товары.НайтиСтроки(Новый Структура("Цена",0)); 
		для каждого СтрМассНулей из МассНулей цикл
			//++Данилова Е.В. 17.06.2026 №0000000008
			//СообщитьИзМодуля("Пустая цена у "+СтрМассНулей.номенклатура); 
			Сообщить("Пустая цена у "+СтрМассНулей.номенклатура); 
			//--Данилова Е.В. 17.06.2026 
		КонецЦикла;
		// Кухарь А.Ю. 11.01.2021 конец
		
		//если РольДоступна("Администратор") тогда Возврат;КонецЕсли;
		
		Если рнк.Товары.Количество() Тогда
			
			ОбменМаркетПлейс.ПунктДоставки_ПриИзменении(рнк);
			рнк.Дата=ТекущаяДата();
			рнк.Записать();
			
			
			Рез.Добавить(рнк.Ссылка);
		КонецЕсли;
		Если ТекПоз>=ТотПоз Тогда
			Прервать;
		КонецЕсли;
		
		н=н+1;
	КонецЦикла;
	// Кухарь А.Ю. 16.03.2022 начало
	// 
	//++Данилова Е.В. 17.06.2026 №0000000008
	//СообщитьИзМодуля("РНК кол-во "+Строка(Рез.Количество()));
	Сообщить("РНК кол-во "+Строка(Рез.Количество())); 
	//--Данилова Е.В. 17.06.2026 
	ЗаписатьВЛог("ВБрзВБО","Создано док  "+Строка(Рез.Количество()),"Информация");
	// Кухарь А.Ю. 16.03.2022 конец
	
	
	Возврат Рез;
КонецФункции

//Михайловский С. 20230314 +++
//модиф из СоздатьРНКНаСпособПоставки_Ф1
Функция СоздатьРНКНаСпособПоставки_Ф11(СпособПоставки,ПунктДоставкиВыб,ВыборкаНоменклатуры,ЕстьРаздел, ЛимПоз,
	КомментарийРНК="",БлочковаяРНК=Неопределено,ЗаписыватьДокумент = Истина)  //++Данилова Е.В. 19.12.2025 HELP-8278 
	
	Рез=Новый Массив;
	//Кухарь А.Ю. 21.09.2023 начало	
	//Пока что не будем разбивать по количеству миксованные паллеты.
	//Если ЕстьРаздел И ЗначениеЗаполнено(ЛимПоз) Тогда
	Если ЕстьРаздел И ЗначениеЗаполнено(ЛимПоз) и СпособПоставки<>Перечисления.СпособПоставкиКонтрагенту.МиксПаллеты3Артикула Тогда
		//Кухарь А.Ю. 21.09.2023 конец		
		СчтКол=ЛимПоз;
	Иначе
		СчтКол=10000000;
	КонецЕсли;	
	
	
	// Кухарь А.Ю.  24.04.2024 начало
	
	ТаблицаНоменклатурыНеВКоробке=новый ТаблицаЗначений;
	ТаблицаНоменклатурыНеВКоробке.Колонки.Добавить("Номенклатура");
	ТаблицаНоменклатурыНеВКоробке.Колонки.Добавить("Количество");
	если СпособПоставки=Перечисления.СпособПоставкиКонтрагенту.МоноКороб 
		или СпособПоставки=Перечисления.СпособПоставкиКонтрагенту.МоноПаллета 
		или СпособПоставки=Перечисления.СпособПоставкиКонтрагенту.Микс 		
		или СпособПоставки=Перечисления.СпособПоставкиКонтрагенту.Монопаллета120 
		тогда
		ОтделятьБлочки=Истина;
	иначе 
		ОтделятьБлочки = ложь;
	КонецЕсли;
	// Кухарь А.Ю.  24.04.2024 конец
	
	ТотПоз=ВыборкаНоменклатуры.Количество();
	сообщить("всего "+строка(тотпоз));
	н=0;
	ТекПоз=0;
	//Пока Истина Цикл
	РНК=документы.РасходнаяНакладная.СоздатьДокумент();
	рнк.Контрагент=Контрагент;
	рнк.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;		
	
	// Шворобей ВЮ 11.03.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2410
	Рнк.Дата = ТекущаяДата();
	// Шворобей ВЮ 10.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5396 
	//Рнк.ДатаОтгрузки = Рнк.Дата;
	// Шворобей ВЮ 10.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5396 
	// Шворобей ВЮ 11.03.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2410
	
	рнк.Договор=Договор;
	Рнк.ОтсрочкаПлатежа=Договор.ОтсрочкаПлатежа;
	//Рнк.ДатаОплаты =ПолучитьДатуОплаты(ДатаОтгрузки,Рнк.ОтсрочкаПлатежа);
	// Кухарь А.Ю. 28.04.2022 начало
	// 	рнк.Склад=Константы.УзелТранспортногоОтдела.Получить().Подразделение.ОсновнойСклад;
	рнк.Склад=СкладДОП;
	// Кухарь А.Ю. 28.04.2022 конец
	//++Данилова Е.В. 29.09.2025 HELP-7048	
	//рнк.Подразделение=Контрагент.Менеджер.Подразделение;
	рнк.Подразделение=ЗаполнениеДокументов.ПодразделениеПродажПоМенеджеру(Контрагент.Менеджер);
	//--Данилова Е.В. 29.09.2025
	рнк.Менеджер=Контрагент.Менеджер;
	// Кухарь А.Ю.  28.03.2024 начало
	если ЗначениеЗаполнено(Договор) тогда
		рнк.Организация=Договор.Организация; 
	КонецЕсли;
	// Кухарь А.Ю.  28.03.2024 конец
	
	
	// Кухарь А.Ю. 17.02.2022 начало
	//
	если ЗначениеЗаполнено(КомментарийРНК) тогда
		рнк.Комментарий=КомментарийРНК;
	КонецЕсли;
	// Кухарь А.Ю. 17.02.2022 конец
	
	
	ЗаполнитьШапкуДокумента(РНК, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
	
	// Кухарь А.Ю. 04.02.2022 начало
	// Исправление
	рнк.КодОперации=Перечисления.КодыОперацийОстатки.Комиссия;
	УстановитьНомерДокументаКлиентСервер(РНК); 
	// Кухарь А.Ю. 04.02.2022 конец
	
	// Кухарь А.Ю. 11.01.2021 начало
	// цены почему-то не заполняются
	если не ЗначениеЗаполнено(рнк.ТипЦенРаспродажа) тогда
		рнк.ТипЦенРаспродажа=РНК.Контрагент.ТипЦенРаспродажа;
	КонецЕсли;
	если не ЗначениеЗаполнено(рнк.ТипЦен) тогда
		рнк.ТипЦен=Контрагент.ТипЦен;
	КонецЕсли;
	// Кухарь А.Ю. 11.01.2021 конец
	
	Если ЗначениеЗаполнено(ПунктДоставкиВыб) Тогда
		РНК.ПунктДоставки = ПунктДоставкиВыб;
	Иначе
		РНК.ПунктДоставки = ПунктДоставки;
	КонецЕсли;
	
	// Шворобей ВЮ 22.10.2024 ++ https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2033
	Если НЕ ЗначениеЗаполнено(РНК.ПунктДоставки) Тогда
		РНК.ПунктДоставки = ЗаполнениеДокументов.УстановитьПунктДоставкиСервер(РНК);
		Если НЕ ЗначениеЗаполнено(РНК.ПунктДоставки) Тогда 
			//++Данилова Е.В. 17.06.2026 №0000000008
			//СообщитьИзМодуля("Не удалось заполнить Пункт Доставки");
			Сообщить("Не удалось заполнить Пункт Доставки"); 
			//--Данилова Е.В. 17.06.2026 
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РНК.ПунктДоставки.РайонДоставки) Тогда
		РНК.РайонДоставки = РНК.ПунктДоставки.РайонДоставки;			
	КонецЕсли;	
	Если ЗначениеЗаполнено(РНК.ПунктДоставки.Регион) Тогда
		РНК.Регион = РНК.ПунктДоставки.Регион;			
	КонецЕсли;
	
	Если РНК.ПунктДоставки.ТипДоставки = Перечисления.ТипыДоставки.ТранспортнаяКомпания Тогда
		РНК.ТранспортнаяКомпания = ?(ЗначениеЗаполнено(РНК.ПунктДоставки.ТраспортнаяКомпания), РНК.ПунктДоставки.ТраспортнаяКомпания, Неопределено);
		РНК.ПунктПерегруза = ?(ЗначениеЗаполнено(РНК.ПунктДоставки.ПунктПерегруза), РНК.ПунктДоставки.ПунктПерегруза, Неопределено);
	Иначе
		РНК.ТранспортнаяКомпания = Неопределено;	
		РНК.ПунктПерегруза = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РНК.ПунктДоставки.Грузополучатель) Тогда
		РНК.Грузополучатель = РНК.ПунктДоставки.Грузополучатель;		
	КонецЕсли;
	Если ЗначениеЗаполнено(РНК.ПунктДоставки.Получатель) Тогда
		РНК.Получатель = РНК.ПунктДоставки.Получатель;		
	КонецЕсли;
	
	РНК.ДопОбработки.Очистить();
	Если РНК.ПунктДоставки.ВидыДопОбработок.Количество() = 0 Тогда
		Для Каждого СтрокаТЧ Из РНК.Контрагент.ВидыДопОбработок Цикл
			СтрокаДО = РНК.ДопОбработки.Добавить();	
			СтрокаДО.ВидДопОбработки = СтрокаТЧ.ДопОбработка;
		КонецЦикла;
	Иначе
		Для Каждого СтрокаТЧ Из РНК.ПунктДоставки.ВидыДопОбработок Цикл
			СтрокаДО = РНК.ДопОбработки.Добавить();	
			СтрокаДО.ВидДопОбработки = СтрокаТЧ.ДопОбработка;
		КонецЦикла;
	КонецЕсли;
	// Шворобей ВЮ 22.10.2024 ++ https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2033
	
	л=0;
	ТекКол=0;
	сообщить(текпоз);
	//ВыборкаНоменклатуры.Сбросить();
	Пока ВыборкаНоменклатуры.Следующий() цикл
		//Если л>=ТекПоз Тогда
		
		// Шворобей ВЮ 02.02.2023 ++
		рнк.ПостояннаяАкция = ВыборкаНоменклатуры.ПостояннаяАкция;
		// Шворобей ВЮ 02.02.2023 ++
		
		// Кухарь А.Ю.  24.04.2024 начало
		ОтгружаемоеКоличество=ВыборкаНоменклатуры.Количество;
		
		если ОтделятьБлочки тогда
			КратностьКороба=ВыборкаНоменклатуры.ШтукВКоробке;
			КратностьБлочка=ВыборкаНоменклатуры.ШтукВКоробочке;
			если КратностьКороба>0 тогда
				КоличествоКоробов=Цел(ОтгружаемоеКоличество/КратностьКороба);
				если КоличествоКоробов>=1 тогда 
					КоробнаяОтгрузка=КоличествоКоробов*КратностьКороба;
					БлочковаяОтгрузка=ОтгружаемоеКоличество-КоробнаяОтгрузка;
				иначе
					КоробнаяОтгрузка=0;
					БлочковаяОтгрузка=ОтгружаемоеКоличество;
				КонецЕсли;
			иначе
				КоробнаяОтгрузка=0;
				БлочковаяОтгрузка=ОтгружаемоеКоличество; 
			КонецЕсли;
			
			//ВыборкаНоменклатуры.Количество=КоробнаяОтгрузка;
			если БлочковаяОтгрузка>0 тогда
				СтрокаБлочки=ТаблицаНоменклатурыНеВКоробке.Добавить();
				СтрокаБлочки.Номенклатура=ВыборкаНоменклатуры.Номенклатура;
				СтрокаБлочки.Количество=БлочковаяОтгрузка;
			КонецЕсли;
			если КоробнаяОтгрузка=0 тогда 
				// Кухарь А.Ю. 24.05.2024 начало
				//ТекПоз=ТекПоз+1;						
				// Кухарь А.Ю. 24.05.2024 конец
				
				Продолжить;
			КонецЕсли;
			ОтгружаемоеКоличество=КоробнаяОтгрузка;
		КонецЕсли;				
		// Кухарь А.Ю.  24.04.2024 конец
		
		
		СтрТЧ=рнк.Товары.Добавить();
		СтрТЧ.Номенклатура=ВыборкаНоменклатуры.Номенклатура;
		
		// Кухарь А.Ю.  24.04.2024 начало
		//СтрТЧ.Количество=ВыборкаНоменклатуры.Количество;
		//СтрТЧ.Заявка=ВыборкаНоменклатуры.Количество;
		//СтрТЧ.ПодтвержденнаяЗаявка=ВыборкаНоменклатуры.Количество;
		СтрТЧ.Количество=ОтгружаемоеКоличество;
		СтрТЧ.Заявка=ОтгружаемоеКоличество;
		СтрТЧ.ПодтвержденнаяЗаявка=ОтгружаемоеКоличество;			
		// Кухарь А.Ю.  24.04.2024 конец
		
		
		Если ВыборкаНоменклатуры.Номенклатура.Коплектующие.Количество() Тогда
			ТЗК=ВыборкаНоменклатуры.Номенклатура.Коплектующие.Выгрузить();
			ТекКол=ТекКол+(ВыборкаНоменклатуры.Количество*ТЗК.Итог("Количество"));
		Иначе
			// Кухарь А.Ю.  24.04.2024 начало
			// ТекКол=ТекКол+(ВыборкаНоменклатуры.Количество);
			ТекКол=ТекКол+ОтгружаемоеКоличество;					 
			// Кухарь А.Ю.  24.04.2024 конец
			
		КонецЕсли;
		ПриИзмененииНоменклатурыТабЧасти(СтрТЧ, РНК);
		РассчитатьСуммуТабЧасти(СтрТЧ, РНК);
		//ТекПоз=ТекПоз+1;
		//КонецЕсли;
		//Если ТекКол>СчтКол Тогда
		//	Прервать;
		//КонецЕсли;	
		//л=л+1;
	КонецЦикла;		
	Если Контрагент.ИспользоватьНоменклатурнуюМатрицу  Тогда
		ПересчетТЧМатрицы(РНК,"Товары",ПараметрыСеанса.ВалютаНац,ПараметрыСеанса.ВалютаНац,1,1);	
	Иначе
		ПересчетТЧ(РНК,"Товары",ПараметрыСеанса.ВалютаНац,ПараметрыСеанса.ВалютаНац,1,1,Истина);	
	Конецесли;		
	// Кухарь А.Ю. 11.01.2021 начало
	// На часть позиций нули.
	МассНулей=рнк.Товары.НайтиСтроки(Новый Структура("Цена",0)); 
	для каждого СтрМассНулей из МассНулей цикл
		//++Данилова Е.В. 17.06.2026 №0000000008
		//СообщитьИзМодуля("Пустая цена у "+СтрМассНулей.номенклатура);
		Сообщить("Пустая цена у "+СтрМассНулей.номенклатура); 
		//--Данилова Е.В. 17.06.2026 
	КонецЦикла;
	// Кухарь А.Ю. 11.01.2021 конец
	
	//если РольДоступна("Администратор") тогда Возврат;КонецЕсли;
	
	Если рнк.Товары.Количество() Тогда
		
		ОбменМаркетПлейс.ПунктДоставки_ПриИзменении(рнк);
		рнк.Дата=ТекущаяДата();
		//++Данилова Е.В. 19.12.2025 HELP-8278 
		Если ЗаписыватьДокумент Тогда
			попытка				
				рнк.Записать();
				Рез.Добавить(рнк.Ссылка); 			
			Исключение
				ОтменитьТранзакцию();
				НачатьТранзакцию();
				Сообщить(ОписаниеОшибки());
				ОткатыватьТранзацию=Истина;
			КонецПопытки;
		Иначе
			Рез.Добавить(рнк);
		КонецЕсли;
		//--Данилова Е.В. 19.12.2025
		
	КонецЕсли;
	//Если ТекПоз>=ТотПоз Тогда
	//	Прервать;
	//КонецЕсли;
	
	н=н+1;
	//КонецЦикла;
	//Форма=РНК.ПолучитьФорму("ФормаДокумента");
	//форма.Открыть();
	//
	//форма.ПунктДоставки_ПриИзменении(Неопределено);	
	// Кухарь А.Ю. 16.03.2022 начало
	// 
	//++Данилова Е.В. 17.06.2026 №0000000008
	//СообщитьИзМодуля("РНК кол-во "+Строка(Рез.Количество()));
	Сообщить("РНК кол-во "+Строка(Рез.Количество())); 
	//--Данилова Е.В. 17.06.2026 
	ЗаписатьВЛог("ВБрзВБО","Создано док  "+Строка(Рез.Количество()),"Информация");
	// Кухарь А.Ю. 16.03.2022 конец
	
	
	// Кухарь А.Ю.  24.04.2024 начало
	если ТаблицаНоменклатурыНеВКоробке.Количество()>0 тогда
		ДопРНК=Документы.РасходнаяНакладная.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(ДопРНК,РНК,,"Номер");
		ДопРНК.ДопОбработки.Загрузить(РНК.ДопОбработки.Выгрузить());
		ДопРНК.Комментарий="Не коробная отгрузка. "+ДопРНК.Комментарий;
		
		// Кухарь А.Ю.  28.05.2024 начало
		//
		ОбменМаркетПлейс.ПунктДоставки_ПриИзменении(ДопРНК);
		// Кухарь А.Ю.  28.05.2024 конец
		
		
		для каждого СтрТЗ из ТаблицаНоменклатурыНеВКоробке цикл
			СтрТЧ=ДопРНК.Товары.Добавить();
			СтрТЧ.Номенклатура=СтрТЗ.Номенклатура;
			СтрТЧ.Количество=СтрТЗ.Количество;
			СтрТЧ.Заявка=СтрТЗ.Количество;
			СтрТЧ.ПодтвержденнаяЗаявка=СтрТЗ.Количество;			
			ПриИзмененииНоменклатурыТабЧасти(СтрТЧ, ДопРНК);
			РассчитатьСуммуТабЧасти(СтрТЧ, ДопРНК);
		КонецЦикла;
		
		
		МассНулей=ДопРНК.Товары.НайтиСтроки(Новый Структура("Цена",0)); 
		для каждого СтрМассНулей из МассНулей цикл
			//++Данилова Е.В. 17.06.2026 №0000000008
			//СообщитьИзМодуля("Пустая цена у "+СтрМассНулей.номенклатура);
			Сообщить("Пустая цена у "+СтрМассНулей.номенклатура); 
			//--Данилова Е.В. 17.06.2026 
		КонецЦикла;
		//++Данилова Е.В. 19.12.2025 HELP-8278 
		Если ЗаписыватьДокумент Тогда	
			попытка
				ДопРНК.Записать();
				Рез.Добавить(ДопРНК.Ссылка);		
			Исключение
				ОтменитьТранзакцию();
				НачатьТранзакцию();
				Сообщить(ОписаниеОшибки());
				ОткатыватьТранзацию=Истина;
			КонецПопытки;
		Иначе
			Рез.Добавить(ДопРНК);
		КонецЕсли;
		//--Данилова Е.В. 19.12.2025 
	КонецЕсли;
	// Кухарь А.Ю.  24.04.2024 конец
	
	
	
	Возврат Рез;
КонецФункции
//Михайловский С. 20230314 ---

// Кухарь А.Ю. 17.03.2021 начало
/////////////////////////////////////////////////////////////////////////////////////////////

/////////////// НЕ ИСПОЛЬЗУЕТСЯ /////////////////////////////////////////////////////////////
Функция СоздатьРНКНаСпособПоставки_Ф(СпособПоставки,ВыборкаНоменклатуры,КомментарийРНК="")
	
	// Кухарь А.Ю. 17.02.2022 конец
	Рез=неопределено;
	
	
	РНК=документы.РасходнаяНакладная.СоздатьДокумент();
	
	
	рнк.Контрагент=Контрагент;
	рнк.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;		
	
	// Шворобей ВЮ 11.03.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2410
	Рнк.Дата = ТекущаяДата();
	// Шворобей ВЮ 10.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5396 
	//Рнк.ДатаОтгрузки = Рнк.Дата;
	// Шворобей ВЮ 10.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5396 
	// Шворобей ВЮ 11.03.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2410
	
	рнк.ПунктДоставки=ПунктДоставки;
	рнк.Договор=Договор;
	Рнк.ОтсрочкаПлатежа=Договор.ОтсрочкаПлатежа;
	//Рнк.ДатаОплаты =ПолучитьДатуОплаты(ДатаОтгрузки,Рнк.ОтсрочкаПлатежа);
	// Кухарь А.Ю. 28.04.2022 начало
	// 	рнк.Склад=Константы.УзелТранспортногоОтдела.Получить().Подразделение.ОсновнойСклад;
	рнк.Склад=СкладДОП;
	// Кухарь А.Ю. 28.04.2022 конец
	
	// Кухарь А.Ю. 28.04.2022 начало
	//
	
	// Кухарь А.Ю. 28.04.2022 конец
	
	// Кухарь А.Ю.  28.03.2024 начало
	если ЗначениеЗаполнено(Договор) тогда
		рнк.Организация=Договор.Организация; 
	КонецЕсли;
	// Кухарь А.Ю.  28.03.2024 конец
	
	//++Данилова Е.В. 29.09.2025 HELP-7048
	//рнк.Подразделение=Контрагент.Менеджер.Подразделение;
	рнк.Подразделение = ЗаполнениеДокументов.ПодразделениеПродажПоМенеджеру(Контрагент.Менеджер);
	//--Данилова Е.В. 29.09.2025
	рнк.Менеджер=Контрагент.Менеджер;
	
	
	// Кухарь А.Ю. 17.02.2022 начало
	//
	если ЗначениеЗаполнено(КомментарийРНК) тогда
		рнк.Комментарий=КомментарийРНК;
	КонецЕсли;
	// Кухарь А.Ю. 17.02.2022 конец
	
	
	ЗаполнитьШапкуДокумента(РНК, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
	
	// Кухарь А.Ю. 04.02.2022 начало
	// Исправление
	рнк.КодОперации=Перечисления.КодыОперацийОстатки.Комиссия;
	УстановитьНомерДокументаКлиентСервер(РНК); 
	// Кухарь А.Ю. 04.02.2022 конец
	
	
	// Кухарь А.Ю. 11.01.2021 начало
	// цены почему-то не заполняются
	если не ЗначениеЗаполнено(рнк.ТипЦенРаспродажа) тогда
		рнк.ТипЦенРаспродажа=РНК.Контрагент.ТипЦенРаспродажа;
	КонецЕсли;
	если не ЗначениеЗаполнено(рнк.ТипЦен) тогда
		рнк.ТипЦен=Контрагент.ТипЦен;
	КонецЕсли;
	// Кухарь А.Ю. 11.01.2021 конец
	
	пока ВыборкаНоменклатуры.следующий() цикл 
		СтрТЧ=рнк.Товары.Добавить();
		СтрТЧ.Номенклатура=ВыборкаНоменклатуры.Номенклатура;
		СтрТЧ.Количество=ВыборкаНоменклатуры.Количество;
		СтрТЧ.Заявка=ВыборкаНоменклатуры.Количество;
		СтрТЧ.ПодтвержденнаяЗаявка=ВыборкаНоменклатуры.Количество;
		ПриИзмененииНоменклатурыТабЧасти(СтрТЧ, РНК);
		РассчитатьСуммуТабЧасти(СтрТЧ, РНК);
	КонецЦикла;			
	Если Контрагент.ИспользоватьНоменклатурнуюМатрицу  Тогда
		ПересчетТЧМатрицы(РНК,"Товары",ПараметрыСеанса.ВалютаНац,ПараметрыСеанса.ВалютаНац,1,1);	
	Иначе
		ПересчетТЧ(РНК,"Товары",ПараметрыСеанса.ВалютаНац,ПараметрыСеанса.ВалютаНац,1,1,Истина);	
	Конецесли;		
	// Кухарь А.Ю. 11.01.2021 начало
	// На часть позиций нули.
	МассНулей=рнк.Товары.НайтиСтроки(Новый Структура("Цена",0)); 
	для каждого СтрМассНулей из МассНулей цикл
		//++Данилова Е.В. 17.06.2026 №0000000008
		//СообщитьИзМодуля("Пустая цена у "+СтрМассНулей.номенклатура);
		Сообщить("Пустая цена у "+СтрМассНулей.номенклатура); 
		//--Данилова Е.В. 17.06.2026 
	КонецЦикла;
	// Кухарь А.Ю. 11.01.2021 конец
	
	//если РольДоступна("Администратор") тогда Возврат;КонецЕсли;
	
	Если рнк.Товары.Количество() Тогда
		
		ОбменМаркетПлейс.ПунктДоставки_ПриИзменении(рнк);
		рнк.Дата=ТекущаяДата();
		рнк.Записать();
		
		
		Рез=рнк.Ссылка;
	КонецЕсли;
	//Форма=РНК.ПолучитьФорму("ФормаДокумента");
	//форма.Открыть();
	//
	//форма.ПунктДоставки_ПриИзменении(Неопределено);	
	// Кухарь А.Ю. 16.03.2022 начало
	//
	//++Данилова Е.В. 17.06.2026 №0000000008
	//СообщитьИзМодуля("РНК "+Рез);
	Сообщить("РНК "+Рез); 
	//--Данилова Е.В. 17.06.2026 
	ЗаписатьВЛог("ВБрзВБО","Создан "+Строка(Рез),"Информация");
	// Кухарь А.Ю. 16.03.2022 конец
	
	
	Возврат Рез;
КонецФункции

/////////////////////////////////////////////////////////////////////////////////////////////


// Кухарь А.Ю. 26.03.2025 начало

Процедура ВыделитьКоличествоИзНакладной(Знач РНК,Лимит,МассивДокументов)

	РНКСтарая=РНК.ПолучитьОбъект();
	ПараметрыСеанса.ЗапущенаОбработка=Истина;
	
	ТаблицаТоваровДляНовойРНК=РНКСтарая.Товары.Выгрузить();
	ТаблицаТоваровДляНовойРНК.Очистить();
	ВремТЗ=ТаблицаТоваровДляНовойРНК.Скопировать();

	
	
	для каждого СтрТЧ из РНКСтарая.Товары цикл
		если СтрТЧ.Количество=0 тогда Продолжить;КонецЕсли;
		Коэффициент=СтрТЧ.КоличествоКомплектующих/СтрТЧ.Количество;
		если СтрТЧ.КоличествоКомплектующих> Лимит тогда
			КоличествоПорций=СтрТЧ.КоличествоКомплектующих/Лимит;
			если Цел(КоличествоПорций)<>КоличествоПорций тогда
				КоличествоПорций=Цел(КоличествоПорций)+1;
			КонецЕсли;	
			ОсталосьРаспределить=СтрТЧ.КоличествоКомплектующих;
			пока ОсталосьРаспределить>0 цикл
				СтрокаТаблицы=ТаблицаТоваровДляНовойРНК.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы,СтрТЧ);	
				СтрокаТаблицы.КоличествоКомплектующих=Мин(Лимит,ОсталосьРаспределить);
				СтрокаТаблицы.Количество=СтрокаТаблицы.КоличествоКомплектующих/Коэффициент;
				ОсталосьРаспределить=ОсталосьРаспределить-Лимит;
			КонецЦикла;
		иначе
			СтрокаТаблицы=ТаблицаТоваровДляНовойРНК.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы,СтрТЧ);		
		КонецЕсли;
		
	КонецЦикла;	
	
	ТаблицаТоваровДляНовойРНК.Сортировать("Количество Убыв");
	ТекущееКоличество=0;
	сч=1;
	ЛимитЭтойНакладнойВыбран=ложь;
	
	КоличествоСТрок=ТаблицаТоваровДляНовойРНК.Количество();
	для каждого СтрТЗ из ТаблицаТоваровДляНовойРНК цикл
		Коэффициент=СтрТЗ.КоличествоКомплектующих/СтрТЗ.Количество;

		если сч=КоличествоСтрок  тогда  
			ВремСтр=ВремТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(ВремСтр,СтрТЗ);	
			ВремСтр.Количество=СтрТЗ.количество;				
			СоздатьРНКНаВыделяемоеКоличество(ВремТЗ,не ЛимитЭтойНакладнойВыбран,РНК,МассивДокументов);
			Продолжить;;
		КонецЕсли;
		
		если СтрТЗ.КоличествоКомплектующих = Лимит тогда
			ВремСтр=ВремТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(ВремСтр,СтрТЗ);	
			ВремСтр.Количество=СтрТЗ.количество;			
			СоздатьРНКНаВыделяемоеКоличество (ВремТЗ,не ЛимитЭтойНакладнойВыбран,РНК,МассивДокументов);
			ВремТЗ.Очистить();
			ЛимитЭтойНакладнойВыбран=Истина;
			сч=сч+1;
			Продолжить;
		КонецЕсли;
		ВремСтр=ВремТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(ВремСтр,СтрТЗ);	
		
		ТекущееКоличество=ТекущееКоличество+СтрТЗ.КоличествоКомплектующих;
		БудущееКоличество=ТекущееКоличество+ТаблицаТоваровДляНовойРНК.Получить(сч).КоличествоКомплектующих;
		если БудущееКоличество>Лимит тогда
			СоздатьРНКНаВыделяемоеКоличество(ВремТЗ,не ЛимитЭтойНакладнойВыбран,РНК,МассивДокументов);
			ВремТЗ.Очистить();
			ЛимитЭтойНакладнойВыбран=Истина;
			ТекущееКоличество=0;
		КонецЕсли;	
		
		сч=сч+1;	
	КонецЦикла;
	//ЗафиксироватьТранзакцию();
	ПараметрыСеанса.ЗапущенаОбработка=Ложь;

КонецПроцедуры

Процедура СоздатьРНКНаВыделяемоеКоличество (ТаблицаТоваровДляНовойРНК, ИспользоватьСтаруюРНК,РНК,МассивДокументов);
	
	если ИспользоватьСтаруюРНК тогда
		РНКНовая=РНК.ПолучитьОбъект();
	иначе
		РНКНовая=документы.РасходнаяНакладная.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(РНКНовая,РНК,,"Номер");
		РНКНовая.Дата=ТекущаяДата();
		УстановитьНомерДокументаКлиентСервер(РНКНовая); 	
		РНКНовая.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;  
		
		
		// Кухарь А.Ю.  03.04.2025 начало
		// Пустая задача
		РНКНовая.ДопОбработки.Очистить();
		Если РНКНовая.ПунктДоставки.ВидыДопОбработок.Количество() = 0 Тогда
			Для Каждого СтрокаТЧ Из РНКНовая.Контрагент.ВидыДопОбработок Цикл
				СтрокаДО=РНКНовая.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
			КонецЦикла;
		Иначе
			Для Каждого СтрокаТЧ Из РНКНовая.ПунктДоставки.ВидыДопОбработок Цикл
				СтрокаДО=РНКНовая.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
			КонецЦикла;
			
		КонецЕсли;
		// Кухарь А.Ю.  03.04.2025 конец

	КонецЕсли;
	РНКНовая.Товары.Загрузить(ТаблицаТоваровДляНовойРНК);   
	для каждого СтрТЧ из РНКНовая.Товары цикл 
		СтрТЧ.Заявка=СтрТЧ.Количество;
		СтрТЧ.ПодтвержденнаяЗаявка=СтрТЧ.Количество;
		РассчитатьСуммуТабЧасти(СтрТЧ, РНКНовая);
	КонецЦикла;

	ЗаполнениеДокументов.ЗаполнитьТЧКомплектующие(РНКНовая); 
	МаркировкаКС.ЗаполнитьТабличныеЧастиПризнакомМаркировки(РНКНовая);	
	РНКНовая.Записать(РежимЗаписиДокумента.Запись);
	если не ИспользоватьСтаруюРНК тогда
		МассивДокументов.добавить(РНКНовая.Ссылка);
	КонецЕсли;
	Сообщить(""+РНКНовая);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры
 
// Кухарь А.Ю. 26.03.2025 конец 

#Область СозданиеРНКСОбъединением
//++Данилова Е.В. 31.10.2025 HELP-7698
Функция СоздатьНаборРНКСОбъединением() Экспорт 

	НастройкиДляСозданияРНК  = ПолучитьНастройкиИзИнтернетМагазина();
	
	Если НастройкиДляСозданияРНК.СоздаватьПодсортировкиFBO Тогда
		
		РезультатСтруктура = СоздатьНаборРНКПоКоличествуШтукВСпайке(НастройкиДляСозданияРНК);
		МассивДокументов = РезультатСтруктура.МассивДокументов; 
		СоответствиеКМПРНК = РезультатСтруктура.СоответствиеКМПРНК; 
		СоответствиеРНК1РНК2 = Новый Соответствие; 
		//Если ОткатыватьТранзацию<>Истина тогда 
		//++Данилова Е.В. 19.12.2025 HELP-8278 
		//Сооб = ""; 
		//Для Каждого Документ Из МассивДокументов Цикл
		//	ДокументРНКСозданный = Неопределено; 
		//	Сооб = Сооб+ОбработатьРНК(Документ,НастройкиДляСозданияРНК.Склады, "РНК",ДокументРНКСозданный) + Символы.ПС; 
		//	Если ДокументРНКСозданный <> Неопределено Тогда
		//		
		//		СоответствиеРНК1РНК2.Вставить(Документ,ДокументРНКСозданный); 	
		//		
		//	КонецЕсли;
		//КонецЦикла;	
		//Сообщить(Сооб);
		//--Данилова Е.В. 19.12.2025
		//Если ОткатыватьТранзацию<>Истина Тогда
		
		МассивРНКПослеОбъединения = Новый Массив;
		ОшибкаОбъединения = ложь; 
		Для каждого ЭлСоответствия Из  СоответствиеКМПРНК Цикл
			
			МассивРНКДляОб = ЭлСоответствия.Значение;
			//++Данилова Е.В. 19.12.2025 HELP-8278
			//ДобавитьСозданныеРНКВМассивРНК(МассивРНКДляОб,СоответствиеРНК1РНК2);
			//--Данилова Е.В. 19.12.2025 
			ОтгрузкаКомплектов = Ложь; 
			Если ЭлСоответствия.Ключ > 0  Тогда
				
				ОтгрузкаКомплектов = Истина; 	
				
			КонецЕсли;
			РНКСозданные = ОбъединитьРНК(МассивРНКДляОб,ОтгрузкаКомплектов);
			Если РНКСозданные = неопределено Тогда
				
				Сообщить("Ошибка объединения РНК");
				ОшибкаОбъединения = истина; 
				Прервать; 
			Иначе 
				Для каждого НовыйРНК Из  РНКСозданные Цикл
					
					МассивРНКПослеОбъединения.Добавить(НовыйРНК); 	
					
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ОшибкаОбъединения Тогда
			
			МассивДокументов = 	МассивРНКПослеОбъединения; 
			
		КонецЕсли; 
		
		//КонецЕсли;
		//КонецЕсли;  
		//
	ИначеЕсли НастройкиДляСозданияРНК.РазбиватьНакладныеПоВидуСпаек Тогда  
		
		МассивДокументов = Документы.ДвижениеТовараВнешнегоКонтрагента.СоздатьРазбивкуРНК_ПоВидуСпаек(Ссылка, Истина);
		
	Иначе
		
		РезультатСтруктура = СоздатьНаборРНКНаНедостающееКоличество_Пред_РНК();
		
		МассивДокументов 	= РезультатСтруктура.МассивДокументов; 
		СоответствиеКМПРНК 	= РезультатСтруктура.СоответствиеКМПРНК;
		
		//Если ОткатыватьТранзацию<>Истина Тогда
			
		МассивРНКПослеОбъединения = Новый Массив;
		ОшибкаОбъединения = ложь; 
		Для каждого ЭлСоответствия Из  СоответствиеКМПРНК Цикл
			
			МассивРНКДляОб = ЭлСоответствия.Значение;
			ОтгрузкаКомплектов = Ложь; 
			Если ЭлСоответствия.Ключ > 0  Тогда
				
				ОтгрузкаКомплектов = Истина; 	
				
			КонецЕсли;
			РНКСозданные = ОбъединитьРНК(МассивРНКДляОб,ОтгрузкаКомплектов);
			Если РНКСозданные = неопределено Тогда
				
				Сообщить("Ошибка объединения РНК");
				ОшибкаОбъединения = истина; 
				Прервать; 
			Иначе 
				Для каждого НовыйРНК Из  РНКСозданные Цикл
					
					МассивРНКПослеОбъединения.Добавить(НовыйРНК); 	
					
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ОшибкаОбъединения Тогда
			
			МассивДокументов = 	МассивРНКПослеОбъединения; 
			
		КонецЕсли; 
		
		//КонецЕсли;

	КонецЕсли;
	
	Если ОткатыватьТранзацию<>Истина Тогда
	
		Возврат МассивДокументов; 	
	иначе 
		Возврат Неопределено; 
	КонецЕсли;


КонецФункции 

Функция ДобавитьСозданныеРНКВМассивРНК(МассивРНК,СоответствиеРНК1РНК2)
	МассивРНКНовый = МассивРНК; 
	Для каждого РНКСозданный Из МассивРНКНовый Цикл
		
		Если СоответствиеРНК1РНК2.Получить(РНКСозданный) <> неопределено Тогда
			
			МассивРНК.Добавить(СоответствиеРНК1РНК2.Получить(РНКСозданный)); 	
			
		КонецЕсли;
		
	КонецЦикла;

КонецФункции 

Функция ОбъединитьРНК(МассивРНК,ОтгрузкаКомплектов)  	
	//++Данилова Е.В. 19.12.2025 HELP-8278
	Если МассивРНК.Количество() = 0 Тогда
	
		Возврат Новый Массив; 	
	
	КонецЕсли;
	Запрос = Новый Запрос; 
	ТекстЗапроса = ""; 
	НомерРНК = 1; 
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
	Для каждого РНКОб Из МассивРНК Цикл
		
		ТекстЗапросаN =  
		"ВЫБРАТЬ
		|	НакладнаяТовары.Номенклатура КАК Номенклатура,
		|	НакладнаяТовары.Количество КАК Количество,
		|	НакладнаяТовары.Всего КАК Всего,
		|	НакладнаяТовары.Заявка КАК Заявка,
		|	НакладнаяТовары.ПодтвержденнаяЗаявка КАК ПодтвержденнаяЗаявка
		|ПОМЕСТИТЬ ВТТоварыN
		|ИЗ
		|	&ТоварыN КАК НакладнаяТовары; "; 
		
		ТекстЗапросаN = СтрЗаменить(ТекстЗапросаN,"ВТТоварыN", "ВТТовары" + Строка(НомерРНК));
		ТекстЗапросаN = СтрЗаменить(ТекстЗапросаN,"ТоварыN", "Товары" + Строка(НомерРНК));
		Запрос.УстановитьПараметр("Товары" + Строка(НомерРНК),РНКОб.Товары.выгрузить()); 
		ТекстЗапроса = ТекстЗапроса + ТекстЗапросаN; 
		НомерРНК = НомерРНК + 1;
	КонецЦикла;

	Запрос.Текст = ТекстЗапроса; 
	Запрос.Выполнить(); 
	
	ТекстЗапроса = "";
	
	Для НомерРНК1 = 1 По  НомерРНК-1 Цикл	
		
		Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
			
			ТекстЗапроса = ТекстЗапроса + " ОБЪЕДИНИТЬ ВСЕ "; 	
			
		КонецЕсли;
		
		ТекстЗапросаN =  
		" ВЫБРАТЬ
		|	НакладнаяТовары.Номенклатура КАК Номенклатура,
		|	СУММА(НакладнаяТовары.Количество) КАК Количество,
		|	СУММА(НакладнаяТовары.Всего) КАК Всего,
		|	СУММА(НакладнаяТовары.Заявка) КАК Заявка,
		|	СУММА(НакладнаяТовары.ПодтвержденнаяЗаявка) КАК ПодтвержденнаяЗаявка
		|ИЗ
		|	ВТТоварыN КАК НакладнаяТовары
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &Белье
		|				ТОГДА НакладнаяТовары.Номенклатура В ИЕРАРХИИ (&ГруппаБелье)
		|			ИНАЧЕ НЕ НакладнаяТовары.Номенклатура В ИЕРАРХИИ (&ГруппаБелье)
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	НакладнаяТовары.Номенклатура";
		
		ТекстЗапросаN = СтрЗаменить(ТекстЗапросаN,"ВТТоварыN", "ВТТовары" + Строка(НомерРНК1));		
		ТекстЗапроса = ТекстЗапроса + ТекстЗапросаN; 
		 
	КонецЦикла; 
	Запрос.Текст = ТекстЗапроса; 	
	//Запрос = Новый Запрос;
	//Запрос.Текст="ВЫБРАТЬ
	//             |	НакладнаяТовары.Номенклатура КАК Номенклатура,
	//             |	СУММА(НакладнаяТовары.Количество) КАК Количество,
	//             |	СУММА(НакладнаяТовары.Всего) КАК Всего,
	//             |	СУММА(НакладнаяТовары.Заявка) КАК Заявка,
	//             |	СУММА(НакладнаяТовары.ПодтвержденнаяЗаявка) КАК ПодтвержденнаяЗаявка
	//             |ИЗ
	//             |	Документ.РасходнаяНакладная.Товары КАК НакладнаяТовары
	//             |ГДЕ
	//             |	НакладнаяТовары.Ссылка В(&СписокНакладных)
	//			 //без деления на маркированный и немаркированный товар
	//			 //|	И ВЫБОР
	//			 //|			КОГДА &МаркированныйТовар
	//			 //|				ТОГДА НакладнаяТовары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой <> ДАТАВРЕМЯ(1, 1, 1)
	//			 //|						И НакладнаяТовары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой < &ДатаРНК
	//			 //|			ИНАЧЕ НакладнаяТовары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой = ДАТАВРЕМЯ(1, 1, 1)
	//			 //|					ИЛИ НакладнаяТовары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой >= &ДатаРНК
	//			 //|		КОНЕЦ
	//             |	И ВЫБОР
	//             |			КОГДА &Белье
	//             |				ТОГДА НакладнаяТовары.Номенклатура В ИЕРАРХИИ (&ГруппаБелье)
	//             |			ИНАЧЕ НЕ НакладнаяТовары.Номенклатура В ИЕРАРХИИ (&ГруппаБелье)
	//             |		КОНЕЦ
	//             |
	//             |СГРУППИРОВАТЬ ПО
	//             |	НакладнаяТовары.Номенклатура";
	//--Данилова Е.В. 19.12.2025 
	//Белье поясное MINIMI Basic  classic SNL-339492
	БельеМиними = Справочники.Номенклатура.НайтиПоКоду("SNL-339492"); 
	//Белье поясное SISI Basic  classic SNL-566171
	БельеСиси = Справочники.Номенклатура.НайтиПоКоду("SNL-566171");
	
	ГруппаБелье = Новый Массив; 
	ГруппаБелье.Добавить(БельеМиними); 
	ГруппаБелье.Добавить(БельеСиси);     
	
	Запрос.УстановитьПараметр("СписокНакладных", МассивРНК);
	Запрос.УстановитьПараметр("ГруппаБелье", ГруппаБелье);
		
		
	ДополнительныеРеквизиты = Новый Структура("КодОперации, Контрагент, Склад, Договор, Организация, ПунктДоставки, СостояниеНакладной, 
				|Отгружен, Менеджер,Подразделение",
				Перечисления.КодыОперацийОстатки.Комиссия, МассивРНК[0].Контрагент, МассивРНК[0].Склад,
				МассивРНК[0].Договор, Справочники.Организации.НайтиПоКоду("SS-001"),
				МассивРНК[0].ПунктДоставки,
				Перечисления.СостоянияНакладной.ВРаботе,Перечисления.Отгружен.Резерв,
				ПараметрыСеанса.Пользователь.ФизЛицо,МассивРНК[0].Подразделение);			
				
	КомментарийРНК = " Создан из движения товара внешнего контрагента"; 
	
	Запрос.УстановитьПараметр("ДатаРНК",ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Белье",Истина); 
	//Запрос.УстановитьПараметр("МаркированныйТовар",Ложь);
	
	
	ТаблицаКЗагрузке = Запрос.Выполнить().Выгрузить();
	//++Данилова Е.В. 19.12.2025 HELP-8278 
	ТаблицаКЗагрузке.Свернуть("Номенклатура","Количество,Всего,Заявка,ПодтвержденнаяЗаявка"); 
	//--Данилова Е.В. 19.12.2025 
	
	ДокументыКПроведению = Новый Массив; 
	
	/////////////// БЕЛЬЕ
	Если ТаблицаКЗагрузке.Количество() > 0  Тогда   						
		
		ДокПолучатель = ЗаполнениеДокументов.СоздатьРасходнуюНакладную(Неопределено, ТаблицаКЗагрузке, ДополнительныеРеквизиты, Ложь,
		КомментарийРНК + " БЕЛЬЕ",ОтгрузкаКомплектов,,истина);
		
		Если ДокПолучатель =  Неопределено Тогда
			
			Сообщить("Не удалось объединить РНК, обработка прервана"); 
			
			Возврат Неопределено ;
		Иначе 
			ДокументыКПроведению.Добавить(ДокПолучатель); 
		КонецЕсли;						
		
	КонецЕсли;
	
	/////////////////Маркированный товар  БЕЛЬЕ
	//Запрос.УстановитьПараметр("Белье",Истина);
	//Запрос.УстановитьПараметр("МаркированныйТовар",Истина);
	//ТаблицаКЗагрузке = Запрос.Выполнить().Выгрузить();
	//Если ТаблицаКЗагрузке.Количество() > 0  Тогда   						
	//	
	//	ДокПолучатель = ЗаполнениеДокументов.СоздатьРасходнуюНакладную(Неопределено, ТаблицаКЗагрузке, ДополнительныеРеквизиты, Ложь,
	//	КомментарийРНК + " БЕЛЬЕ (маркированный товар)",ОтгрузкаКомплектов,,истина);
	//	
	//	Если ДокПолучатель =  Неопределено Тогда
	//		
	//		Сообщить("Не удалось объединить РНК, обработка прервана"); 
	//		
	//		Возврат неопределено;
	//	Иначе 
	//		ДокументыКПроведению.Добавить(ДокПолучатель); 
	//	КонецЕсли;						
	//	
	//КонецЕсли;
	
	///////////////НЕ БЕЛЬЕ
	Запрос.УстановитьПараметр("Белье",ЛОЖЬ); 
	//Запрос.УстановитьПараметр("МаркированныйТовар",Ложь);
	
	ТаблицаКЗагрузке = Запрос.Выполнить().Выгрузить();
	//++Данилова Е.В. 19.12.2025 HELP-8278 
	ТаблицаКЗагрузке.Свернуть("Номенклатура","Количество,Всего,Заявка,ПодтвержденнаяЗаявка"); 
	//--Данилова Е.В. 19.12.2025 
	Если ТаблицаКЗагрузке.Количество() > 0  Тогда   						
		
		ДокПолучатель = ЗаполнениеДокументов.СоздатьРасходнуюНакладную(Неопределено, ТаблицаКЗагрузке, ДополнительныеРеквизиты, Ложь,
		КомментарийРНК,ОтгрузкаКомплектов,,истина);
		
		Если ДокПолучатель =  Неопределено Тогда
			
			Сообщить("Не удалось объединить РНК, обработка прервана"); 
			
			Возврат неопределено;
		Иначе 
			ДокументыКПроведению.Добавить(ДокПолучатель); 
		КонецЕсли;						
		
	КонецЕсли;
	
	///////////////Маркированный товар  НЕ БЕЛЬЕ
	//Запрос.УстановитьПараметр("Белье",ЛОЖЬ);
	//Запрос.УстановитьПараметр("МаркированныйТовар",Истина);
	//ТаблицаКЗагрузке = Запрос.Выполнить().Выгрузить();
	//Если ТаблицаКЗагрузке.Количество() > 0  Тогда   						
	//	
	//	ДокПолучатель = ЗаполнениеДокументов.СоздатьРасходнуюНакладную(Неопределено, ТаблицаКЗагрузке, ДополнительныеРеквизиты, Ложь,
	//	КомментарийРНК + " маркированный товар",ОтгрузкаКомплектов,,истина);
	//	
	//	Если ДокПолучатель =  Неопределено Тогда
	//		
	//		Сообщить("Не удалось объединить РНК, обработка прервана"); 
	//		
	//		Возврат неопределено;
	//	Иначе 
	//		ДокументыКПроведению.Добавить(ДокПолучатель); 
	//	КонецЕсли;						
	//	
	//КонецЕсли;

	//не проводим	
	//
	//НачатьТранзакцию(); 
	//
	//Попытка
	//	////////////сначала снимаем движения 
	//	Для каждого Накладная Из МассивРНК Цикл
	//		
	//		ОбъектНакладная  = Накладная.ПолучитьОбъект(); 
	//		ОбъектНакладная.Записать(РежимЗаписиДокумента.ОтменаПроведения); 
	//		ОбъектНакладная.УстановитьПометкуУдаления(Истина); 
	//		
	//	КонецЦикла;
	//	////////////потом пытаемся провести 
	//	
	//	Для каждого ДокументКПроведению Из ДокументыКПроведению Цикл
	//		
	//		ДокументКПроведениюОбъект = ДокументКПроведению.ПолучитьОбъект();
	//		
	//		ДокументКПроведениюОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//		
	//	КонецЦикла;		
	//	
	//Исключение  
	//	
	//	ОтменитьТранзакцию();
	//	
	//	Сообщить("Не удалось провести РНК:" + ОписаниеОшибки());
	//	
	//	Возврат Неопределено; 
	//	
	//КонецПопытки;
	//
	//Если ТранзакцияАктивна() Тогда
	//	
	//	ЗафиксироватьТранзакцию();
	//	
	//КонецЕсли;
	
	Возврат ДокументыКПроведению; 

КонецФункции

Функция ПолучитьНастройкиИзИнтернетМагазина()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнетМагазины.РазбиватьПоВидуСпаек КАК РазбиватьНакладныеПоВидуСпаек,
		|	ИнетМагазины.СоздаватьПодсортировкиFBO КАК СоздаватьПодсортировкиFBO,
		|	ИнетМагазины.РазбиватьПоЛимитуКоличество1 КАК РазбиватьПоЛимитуКоличество,
		|	ИнетМагазины.ЛимитПоКоличеству1 КАК ЛимитПоКоличеству
		|ИЗ
		|	Справочник.ИнетМагазины КАК ИнетМагазины
		|ГДЕ
		|	ИнетМагазины.Контрагент = &Контрагент
		|	И ИнетМагазины.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИнетМагазиныСкладыПодсортировкиFBO.Склад КАК Склад
		|ИЗ
		|	Справочник.ИнетМагазины.СкладыПодсортировкиFBO КАК ИнетМагазиныСкладыПодсортировкиFBO
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнетМагазины КАК ИнетМагазины
		|		ПО ИнетМагазиныСкладыПодсортировкиFBO.Ссылка = ИнетМагазины.Ссылка
		|ГДЕ
		|	ИнетМагазины.Контрагент = &Контрагент
		|	И ИнетМагазины.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Константы.ОсновнаяОрганизацияУправленческогоУчета.Получить());
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	Настройки = Новый Структура("РазбиватьНакладныеПоВидуСпаек,СоздаватьПодсортировкиFBO,РазбиватьПоЛимитуКоличество,ЛимитПоКоличеству,Склады",ложь,ложь,ложь,0,Новый Массив); 
	
	ВыборкаОсновные = ПакетРезультатов[0].Выбрать(); 
	ТЧСклады = ПакетРезультатов[1].Выгрузить();
	Если ВыборкаОсновные.Следующий() Тогда
	
		ЗаполнитьЗначенияСвойств(Настройки,ВыборкаОсновные); 	
	
	КонецЕсли;
	Если ТЧСклады.Количество() > 0  Тогда
		Настройки.Склады = ТЧСклады.ВыгрузитьКолонку("Склад");; 
	КонецЕсли;
		
		
	Возврат Настройки; 

КонецФункции // ПолучитьНастройкиИзИнтернетМагазина()

Функция СоздатьНаборРНКПоКоличествуШтукВСпайке(НастройкиДляСозданияРНК)
	ОткатыватьТранзацию = ложь;
	
	РазбиватьКратноКоробу = Ложь; 
	//Данилова Е.В. 19.12.2025 HELP-8278 
	//без сохранения РНК промежуточных 
	//НачатьТранзакцию(); 
	
	
	МассивДокументов = Новый Массив;
	ЕстьРаздел = Истина;
	ЛимПоз = 5000;
	Если НастройкиДляСозданияРНК.РазбиватьПоЛимитуКоличество Тогда
		
		ЛимПоз = НастройкиДляСозданияРНК.ЛимитПоКоличеству; 	
		
	КонецЕсли;	
	
	
	// Шворобей ВЮ 18.01.2023 ++
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т1.Номенклатура КАК Номенклатура,
	|	т1.Номенклатура.Родитель.ШтукВКоробочке КАК ШтукВКоробочке,
	|	т1.Номенклатура.Родитель.ШтукВКоробке КАК ШтукВКоробке,
	|	ВЫБОР
	|		КОГДА &РазбиватьКратноКоробу
	|			ТОГДА т1.ШтукВКоробке * т1.МножительДляКороба
	|		ИНАЧЕ т1.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА т1.КоличествоЦветов = 0
	|			ТОГДА 1
	|		КОГДА &РазбиватьПоКоличествуЦветов
	|			ТОГДА т1.КоличествоЦветов
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоличествоЦветов,
	|	ВЫБОР
	|		КОГДА т1.КоличествоКМП = 0
	|			ТОГДА 0
	|		КОГДА &РазбиватьПоКоличествуВСпайке
	|			ТОГДА т1.КоличествоКМП
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоличествоКМП,
	|	ВЫБОР
	|		КОГДА &РазбиватьПоСпособуПоставки
	|			ТОГДА т1.СпособПоставки
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособПоставкиКонтрагенту.Микс)
	|	КОНЕЦ КАК СпособПоставки,
	|	ВЫБОР
	|		КОГДА &РазбиватьПоНоменклатурнымМатрицам
	|			ТОГДА ЕСТЬNULL(т1.НоменклатурнаяМатрица, ЗНАЧЕНИЕ(Документ.Матрица.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.Матрица.ПустаяСсылка)
	|	КОНЕЦ КАК НоменклатурнаяМатрица,
	|	т1.ПунктДоставки КАК ПунктДоставки,
	|	ВЫБОР
	|		КОГДА &РазбиватьПоНоменклатурнымМатрицам
	|			ТОГДА ЕСТЬNULL(т1.НоменклатурнаяМатрица.ПостояннаяАкция, ЛОЖЬ)
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПостояннаяАкция,
	|	ВЫБОР
	|		КОГДА &РазбиватьНакладныеПоВидуСпаек
	|				И т1.Номенклатура.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВидКомплекта,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(т1.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|				И ЕСТЬNULL(т1.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1)) < &ТекущаяДата
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Маркировка,
	|	т1.Расходник КАК Расходник
	|ИЗ
	|	(ВЫБРАТЬ
	|		Товары.Номенклатура КАК Номенклатура,
	|		Товары.СпособПоставки КАК СпособПоставки,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Комплектующие.Номенклатура.Цвет) КАК КоличествоЦветов,
	|		МАКСИМУМ(ЕСТЬNULL(Товары.КОтгрузке, 0)) КАК Количество,
	|		СУММА(ЕСТЬNULL(Комплектующие.Количество, 0)) КАК КоличествоКМП,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА Товары.Номенклатура.Родитель.ШтукВКоробке <> 0
	|					ТОГДА Товары.Номенклатура.Родитель.ШтукВКоробке
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|							ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|						ИНАЧЕ 1
	|					КОНЕЦ
	|			КОНЕЦ) КАК ШтукВКоробке,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА ЕСТЬNULL(Товары.КОтгрузке, 0) / ВЫБОР
	|							КОГДА Товары.Номенклатура.Родитель.ШтукВКоробке <> 0
	|								ТОГДА Товары.Номенклатура.Родитель.ШтукВКоробке
	|							ИНАЧЕ ВЫБОР
	|									КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|										ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|									ИНАЧЕ 1
	|								КОНЕЦ
	|						КОНЕЦ > 0
	|						И ЕСТЬNULL(Товары.КОтгрузке, 0) <> ВЫБОР
	|							КОГДА Товары.Номенклатура.Родитель.ШтукВКоробке <> 0
	|								ТОГДА Товары.Номенклатура.Родитель.ШтукВКоробке
	|							ИНАЧЕ ВЫБОР
	|									КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|										ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|									ИНАЧЕ 1
	|								КОНЕЦ
	|						КОНЕЦ
	|					ТОГДА (ВЫРАЗИТЬ(ЕСТЬNULL(Товары.КОтгрузке, 0) / ВЫБОР
	|								КОГДА Товары.Номенклатура.Родитель.ШтукВКоробке <> 0
	|									ТОГДА Товары.Номенклатура.Родитель.ШтукВКоробке
	|								ИНАЧЕ ВЫБОР
	|										КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|											ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|										ИНАЧЕ 1
	|									КОНЕЦ
	|							КОНЕЦ - 0.5 КАК ЧИСЛО(15, 0))) + 1
	|				ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(Товары.КОтгрузке, 0) / ВЫБОР
	|							КОГДА Товары.Номенклатура.Родитель.ШтукВКоробке <> 0
	|								ТОГДА Товары.Номенклатура.Родитель.ШтукВКоробке
	|							ИНАЧЕ ВЫБОР
	|									КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|										ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|									ИНАЧЕ 1
	|								КОНЕЦ
	|						КОНЕЦ - 0.5 КАК ЧИСЛО(15, 0))
	|			КОНЕЦ) КАК МножительДляКороба,
	|		Товары.НоменклатурнаяМатрица КАК НоменклатурнаяМатрица,
	|		Товары.ПунктДоставки КАК ПунктДоставки,
	|		МАКСИМУМ(Расходники.Номенклатура) КАК Расходник
	|	ИЗ
	|		Документ.ДвижениеТовараВнешнегоКонтрагента.Товары КАК Товары
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК Комплектующие
	|			ПО Товары.Номенклатура = Комплектующие.Ссылка
	|				И (Комплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК Расходники
	|			ПО Товары.Номенклатура = Расходники.Ссылка
	|				И (Расходники.Номенклатура.Родитель.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар))
	|	ГДЕ
	|		Товары.Ссылка = &Ссылка
	|		И Товары.КОтгрузке > 0
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Товары.Номенклатура,
	|		Товары.СпособПоставки,
	|		Товары.НоменклатурнаяМатрица,
	|		Товары.ПунктДоставки) КАК т1
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	СпособПоставки,
	|	КоличествоЦветов,
	|	КоличествоКМП,
	|	ПостояннаяАкция,
	|	НоменклатурнаяМатрица,
	|	ПунктДоставки,
	|	Маркировка,
	|	Расходник,
	|	Номенклатура";
	// Шворобей ВЮ 18.01.2023 ++
	
	// Кухарь А.Ю.  24.11.2022 начало
	//По просьбе Натальи вернул разбивку для ВБ
	// 	Запрос.УстановитьПараметр("РазбиватьПоСпособуПоставки",ложь);
	// Кухарь А.Ю.  06.08.2024 начало
	// 	Если Контрагент.Код="SSR-9059" тогда
	Если Контрагент.Код="SSR-9059" или Контрагент.Код="SST-1208" тогда
		// Кухарь А.Ю.  06.08.2024 конец
		
		Запрос.УстановитьПараметр("РазбиватьПоСпособуПоставки",Истина);
		// Малахов В.С. 18.01.24 начало
		//По просьбе Алины убрали разбивку для микс 3 паллеты 
		ОтклРазбивку=" и не т1.СпособПоставки=ЗНАЧЕНИЕ(Перечисление.СпособПоставкиКонтрагенту.МиксПаллеты3Артикула)";
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"КОГДА &РазбиватьКратноКоробу","КОГДА &РазбиватьКратноКоробу"+ОтклРазбивку);
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"КОГДА &РазбиватьПоКоличествуЦветов","КОГДА &РазбиватьПоКоличествуЦветов"+ОтклРазбивку);
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"КОГДА &РазбиватьПоКоличествуВСпайке","КОГДА &РазбиватьПоКоличествуВСпайке"+ОтклРазбивку);
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"КОГДА &РазбиватьПоНоменклатурнымМатрицам","КОГДА &РазбиватьПоНоменклатурнымМатрицам"+ОтклРазбивку);
		//Малахов В.С. 18.01.24 конец
	иначе
		Запрос.УстановитьПараметр("РазбиватьПоСпособуПоставки",ложь);
	КонецЕсли;
	// Кухарь А.Ю.  24.11.2022 конец
	
	Запрос.УстановитьПараметр("РазбиватьКратноКоробу", РазбиватьКратноКоробу);
	Запрос.УстановитьПараметр("РазбиватьПоКоличествуВСпайке",Истина);
	Запрос.УстановитьПараметр("РазбиватьПоКоличествуЦветов",Истина);
	// Кухарь А.Ю.  10.09.2024 начало
	//
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата()); 
	// Кухарь А.Ю.  10.09.2024 конец
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	// Шворобей ВЮ 18.01.2023 ++
	Запрос.УстановитьПараметр("РазбиватьПоНоменклатурнымМатрицам", Истина);
	// Шворобей ВЮ 08.07.2024 ++
	Запрос.УстановитьПараметр("РазбиватьНакладныеПоВидуСпаек", Ложь);
	// Шворобей ВЮ 08.07.2024 ++
	
	ВыборкаСпособовПоставки = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"СпособПоставки");  // 1  
	
	СоответствиеКМПРНК = Новый Соответствие; 
	
	Пока ВыборкаСпособовПоставки.Следующий() цикл
		
		// Кухарь А.Ю.  24.11.2022 начало
		//По просьбе Натальи вернул разбивку для ВБ
		// Кухарь А.Ю.  06.08.2024 начало
		// 	если Контрагент.Код="SSR-9059"  тогда
		если Контрагент.Код="SSR-9059" или Контрагент.Код="SST-1208"   тогда 
			// Кухарь А.Ю.  06.08.2024 конец
			
			КСпособПоставки=""+ВыборкаСпособовПоставки.СпособПоставки;
		иначе
			КСпособПоставки="";
		КонецЕсли;
		// Кухарь А.Ю.  24.11.2022 конец
		
		ВыборкаКоличествоЦветов=ВыборкаСпособовПоставки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"КоличествоЦветов");   // 2
		Пока ВыборкаКоличествоЦветов.Следующий() Цикл
			
			кКоличествоЦветов=", количество цветов "+ВыборкаКоличествоЦветов.КоличествоЦветов;
			
			ВыборкаВидовНоменклатуры=ВыборкаКоличествоЦветов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"КоличествоКМП");  // 3
			// Кухарь А.Ю. 17.02.2022 конец
			
			// Кухарь А.Ю. 12.11.2020 начало
			Пока ВыборкаВидовНоменклатуры.Следующий() Цикл
				// Кухарь А.Ю. 17.02.2022 начало
				//
				кКоличествоКМП=", количество КМП "+ВыборкаВидовНоменклатуры.КоличествоКМП;
				
				ВыборкаПоПостояннымАкциям = ВыборкаВидовНоменклатуры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ПостояннаяАкция");  // 4
				
				Пока ВыборкаПоПостояннымАкциям.Следующий() Цикл
					
					ВыборкаПоНоменклатурнымМатрицам = ВыборкаПоПостояннымАкциям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"НоменклатурнаяМатрица"); // 5
					
					Пока ВыборкаПоНоменклатурнымМатрицам.Следующий() Цикл
						//Михайловский С. 20230314 +++
						ВыборкаПоПунктамДоставки = ВыборкаПоНоменклатурнымМатрицам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ПунктДоставки");   // 6
						
						Пока ВыборкаПоПунктамДоставки.Следующий() Цикл
						
							ВыборкаПоМаркировке = ВыборкаПоПунктамДоставки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Маркировка");  // 7
						
							Пока ВыборкаПоМаркировке.Следующий() Цикл
								
								кМаркировка = ?(ВыборкаПоМаркировке.Маркировка = Истина, ", товар маркирован", ", товар без маркировки");
								// Кухарь А.Ю. 26.03.2025 начало
								// ВыборкаНоменклатуры = ВыборкаПоМаркировке.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Номенклатура");  // 8

								ВыборкаПоРасходнику=ВыборкаПоМаркировке.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Расходник");  
								пока ВыборкаПоРасходнику.Следующий() цикл
									ВыборкаНоменклатуры = ВыборкаПоРасходнику.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Номенклатура");  // 9
									// Кухарь А.Ю. 26.03.2025 конец
									
									
									
									// Кухарь А.Ю. 12.11.2020 конец
									// Шворобей ВЮ 27.10.2022 ++
									//++Данилова Е.В. 19.12.2025  HELP-8278 
									
									МНовДок = СоздатьРНКНаСпособПоставки_Ф11(ВыборкаСпособовПоставки.СпособПоставки,ВыборкаПоПунктамДоставки.ПунктДоставки,
									ВыборкаНоменклатуры,ЕстьРаздел,ЛимПоз,КСпособПоставки + кКоличествоЦветов + кКоличествоКМП,,ложь); 								
									
									Если МНовДок.Количество() Тогда
										Для Каждого НовДок Из МНовДок Цикл
											МассивДокументов.Добавить(НовДок);
											
											МассивДокКМП = СоответствиеКМПРНК.Получить(ВыборкаВидовНоменклатуры.КоличествоКМП);
											Если МассивДокКМП = неопределено Тогда
												
												МассивДокКМП = Новый Массив; 	
												
											КонецЕсли;
											МассивДокКМП.Добавить(НовДок); 
											СоответствиеКМПРНК.Вставить(ВыборкаВидовНоменклатуры.КоличествоКМП,МассивДокКМП); 
											
										КонецЦикла;	
									КонецЕсли;
									// Кухарь А.Ю. 26.03.2025 начало
									// Пустая задача
								КонецЦикла; 
								// Кухарь А.Ю. 26.03.2025 конец
								
							КонецЦикла;
						
						КонецЦикла;
						
					КонецЦикла;
					
				КонецЦикла;
				// Шворобей ВЮ 27.10.2022 ++
			КонецЦикла; 
			// Кухарь А.Ю. 17.02.2022 начало
		КонецЦикла;
		// Кухарь А.Ю. 17.02.2022 конец
		
	КонецЦикла;
	//Данилова Е.В. 19.12.2025 HELP-8278
	//Если ТранзакцияАктивна() Тогда
	//	Если ОткатыватьТранзацию = Истина Тогда
	//		ОтменитьТранзакцию();
	//	Иначе
	//		ЗафиксироватьТранзакцию(); 
	//	КонецЕсли;
	//КонецЕсли;
	// Кухарь А.Ю. 24.05.2024 конец
	
	Возврат Новый Структура("СоответствиеКМПРНК,МассивДокументов",СоответствиеКМПРНК,МассивДокументов);

	
КонецФункции

Функция СоздатьНаборРНКНаНедостающееКоличество_Пред_РНК() 
	//Данилова Е.В. 19.12.2025 HELP-8278 
	//НачатьТранзакцию(); 
	РазбиватьКратноКоробу = ложь; 
	
	МассивДокументов = Новый Массив; 
	
	Запрос = Новый Запрос;
	// Шворобей ВЮ 18.01.2023 ++
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т1.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &РазбиватьКратноКоробу
	|			ТОГДА т1.ШтукВКоробке * т1.МножительДляКороба
	|		ИНАЧЕ т1.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА т1.КоличествоЦветов = 0
	|			ТОГДА 1
	|		КОГДА &РазбиватьПоКоличествуЦветов
	|			ТОГДА т1.КоличествоЦветов
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоличествоЦветов,
	|	ВЫБОР
	|		КОГДА т1.КоличествоКМП = 0
	|			ТОГДА 0
	|		КОГДА &РазбиватьПоКоличествуВСпайке
	|			ТОГДА т1.КоличествоКМП
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоличествоКМП,
	|	ВЫБОР
	|		КОГДА &РазбиватьПоСпособуПоставки
	|			ТОГДА т1.СпособПоставки
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособПоставкиКонтрагенту.Микс)
	|	КОНЕЦ КАК СпособПоставки,
	|	ВЫБОР
	|		КОГДА &РазбиватьПоНоменклатурнымМатрицам
	|			ТОГДА ЕСТЬNULL(т1.НоменклатурнаяМатрица, ЗНАЧЕНИЕ(Документ.Матрица.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.Матрица.ПустаяСсылка)
	|	КОНЕЦ КАК НоменклатурнаяМатрица,
	|	ВЫБОР
	|		КОГДА &РазбиватьПоНоменклатурнымМатрицам
	|			ТОГДА ЕСТЬNULL(т1.НоменклатурнаяМатрица.ПостояннаяАкция, ЛОЖЬ)
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПостояннаяАкция,
	|	ВЫБОР
	|		КОГДА &РазбиватьНакладныеПоВидуСпаек
	|				И т1.Номенклатура.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВидКомплекта,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(т1.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|				И ЕСТЬNULL(т1.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1)) < &ТекущаяДата

	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Маркировка
	|ИЗ
	|	(ВЫБРАТЬ
	|		Товары.Номенклатура КАК Номенклатура,
	|		Товары.СпособПоставки КАК СпособПоставки,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Комплектующие.Номенклатура.Цвет) КАК КоличествоЦветов,
	|		МАКСИМУМ(ЕСТЬNULL(Товары.КОтгрузке, 0)) КАК Количество,
	|		СУММА(ЕСТЬNULL(Комплектующие.Количество, 0)) КАК КоличествоКМП,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА Товары.Номенклатура.Родитель.ШтукВКоробке <> 0
	|					ТОГДА Товары.Номенклатура.Родитель.ШтукВКоробке
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|							ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|						ИНАЧЕ 1
	|					КОНЕЦ
	|			КОНЕЦ) КАК ШтукВКоробке,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА ЕСТЬNULL(Товары.КОтгрузке, 0) / ВЫБОР
	|							КОГДА Товары.Номенклатура.Родитель.ШтукВКоробке <> 0
	|								ТОГДА Товары.Номенклатура.Родитель.ШтукВКоробке
	|							ИНАЧЕ ВЫБОР
	|									КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|										ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|									ИНАЧЕ 1
	|								КОНЕЦ
	|						КОНЕЦ > 0
	|						И ЕСТЬNULL(Товары.КОтгрузке, 0) <> ВЫБОР
	|							КОГДА Товары.Номенклатура.Родитель.ШтукВКоробке <> 0
	|								ТОГДА Товары.Номенклатура.Родитель.ШтукВКоробке
	|							ИНАЧЕ ВЫБОР
	|									КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|										ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|									ИНАЧЕ 1
	|								КОНЕЦ
	|						КОНЕЦ
	|					ТОГДА (ВЫРАЗИТЬ(ЕСТЬNULL(Товары.КОтгрузке, 0) / ВЫБОР
	|								КОГДА Товары.Номенклатура.Родитель.ШтукВКоробке <> 0
	|									ТОГДА Товары.Номенклатура.Родитель.ШтукВКоробке
	|								ИНАЧЕ ВЫБОР
	|										КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|											ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|										ИНАЧЕ 1
	|									КОНЕЦ
	|							КОНЕЦ - 0.5 КАК ЧИСЛО(15, 0))) + 1
	|				ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(Товары.КОтгрузке, 0) / ВЫБОР
	|							КОГДА Товары.Номенклатура.Родитель.ШтукВКоробке <> 0
	|								ТОГДА Товары.Номенклатура.Родитель.ШтукВКоробке
	|							ИНАЧЕ ВЫБОР
	|									КОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке <> 0
	|										ТОГДА Товары.Номенклатура.Родитель.Родитель.ШтукВКоробке
	|									ИНАЧЕ 1
	|								КОНЕЦ
	|						КОНЕЦ - 0.5 КАК ЧИСЛО(15, 0))
	|			КОНЕЦ) КАК МножительДляКороба,
	|		Товары.НоменклатурнаяМатрица КАК НоменклатурнаяМатрица
	|	ИЗ
	|		Документ.ДвижениеТовараВнешнегоКонтрагента.Товары КАК Товары
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК Комплектующие
	|			ПО Товары.Номенклатура = Комплектующие.Ссылка
	|				И (Комплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар))
	|	ГДЕ
	|		Товары.Ссылка = &Ссылка
	|		И Товары.КОтгрузке > 0
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Товары.Номенклатура,
	|		Товары.СпособПоставки,
	|		Товары.НоменклатурнаяМатрица) КАК т1
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	СпособПоставки,
	|	КоличествоЦветов,
	|	КоличествоКМП,
	|	ПостояннаяАкция,
	|	НоменклатурнаяМатрица,
	|	Маркировка,
	|	Номенклатура";
	// Шворобей ВЮ 18.01.2023 ++
	
	Запрос.УстановитьПараметр("РазбиватьКратноКоробу", РазбиватьКратноКоробу);
	Запрос.УстановитьПараметр("РазбиватьПоСпособуПоставки",ложь);
	Запрос.УстановитьПараметр("РазбиватьПоКоличествуВСпайке",Истина);
	Запрос.УстановитьПараметр("РазбиватьПоКоличествуЦветов",Истина);
	// Кухарь А.Ю.  10.09.2024 начало
	//
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	// Кухарь А.Ю.  10.09.2024 конец
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	// Кухарь А.Ю. 17.02.2022 конец
	Если Контрагент.Код="SSP-4991" тогда
		Запрос.УстановитьПараметр("РазбиватьПоСпособуПоставки",Ложь);
		Запрос.УстановитьПараметр("РазбиватьПоКоличествуВСпайке",ложь);
	КонецЕсли;
	// Кухарь А.Ю. 26.08.2021 конец
	
	// Шворобей ВЮ 08.07.2024 ++
	Запрос.УстановитьПараметр("РазбиватьНакладныеПоВидуСпаек", Ложь);
	// Шворобей ВЮ 08.07.2024 ++
	
	// Шворобей ВЮ 18.01.2023 ++
	Запрос.УстановитьПараметр("РазбиватьПоНоменклатурнымМатрицам", Истина);
	// Шворобей ВЮ 18.01.2023 ++
	СоответствиеКМПРНК = Новый Соответствие; 
	
	ВыборкаСпособовПоставки=запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"СпособПоставки");   // 1
	Пока ВыборкаСпособовПоставки.Следующий() Цикл
		КСпособПоставки="Поставка";		 
		
		ВыборкаКоличествоЦветов=ВыборкаСпособовПоставки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"КоличествоЦветов");  // 2
		Пока ВыборкаКоличествоЦветов.Следующий() Цикл
			
			кКоличествоЦветов=", количество цветов " + ВыборкаКоличествоЦветов.КоличествоЦветов;
			
			ВыборкаВидовНоменклатуры=ВыборкаКоличествоЦветов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"КоличествоКМП");  // 3
			
			// Кухарь А.Ю. 12.11.2020 начало
			Пока ВыборкаВидовНоменклатуры.Следующий() Цикл
				
				кКоличествоКМП=", количество КМП " + ВыборкаВидовНоменклатуры.КоличествоКМП;
				
				ВыборкаПоПостояннымАкциям = ВыборкаВидовНоменклатуры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ПостояннаяАкция");  // 4
				
				Пока ВыборкаПоПостояннымАкциям.Следующий() Цикл
					
					ВыборкаПоНоменклатурнымМатрицам = ВыборкаПоПостояннымАкциям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"НоменклатурнаяМатрица");  // 5
					// Кухарь А.Ю. 17.02.2022 конец
					
					Пока ВыборкаПоНоменклатурнымМатрицам.Следующий() Цикл
						
						ВыборкаПоМаркировке = ВыборкаПоНоменклатурнымМатрицам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Маркировка");  // 6
						
						Пока ВыборкаПоМаркировке.Следующий() Цикл
							
							кМаркировка = ?(ВыборкаПоМаркировке.Маркировка = Истина, ", товар маркирован", ", товар без маркировки");
							
							ВыборкаНоменклатуры = ВыборкаПоМаркировке.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Номенклатура");  // 7
							
							// Кухарь А.Ю. 12.11.2020 конец
							// Шворобей ВЮ 27.10.2022 ++
							
							РНКСозданный = СоздатьРНКНаСпособПоставки_Пред(ВыборкаСпособовПоставки.СпособПоставки,ВыборкаНоменклатуры,КСпособПоставки + кКоличествоЦветов + кКоличествоКМП);
							МассивДокументов.Добавить(РНКСозданный);
							
							МассивДокКМП = СоответствиеКМПРНК.Получить(ВыборкаВидовНоменклатуры.КоличествоКМП);
							Если МассивДокКМП = неопределено Тогда
								
								МассивДокКМП = Новый Массив; 	
								
							КонецЕсли;
							МассивДокКМП.Добавить(РНКСозданный); 
							СоответствиеКМПРНК.Вставить(ВыборкаВидовНоменклатуры.КоличествоКМП,МассивДокКМП);
						КонецЦикла;
						
					КонецЦикла;
					
				КонецЦикла;
				// Шворобей ВЮ 27.10.2022 ++
				// Кухарь А.Ю. 12.11.2020 начало
			КонецЦикла; 
			
		КонецЦикла;
		
	КонецЦикла; 
	//Данилова Е.В. 19.12.2025 HELP-8278
	//Если ТранзакцияАктивна() Тогда
	//	
	//	ЗафиксироватьТранзакцию();
	//Иначе 
	//	ОткатыватьТранзацию = истина; 
	//КонецЕсли;
	
	Возврат Новый Структура("МассивДокументов,СоответствиеКМПРНК",МассивДокументов,СоответствиеКМПРНК); 
КонецФункции 

Функция СоздатьРНКНаСпособПоставки_Пред(СпособПоставки,ВыборкаНоменклатуры,КомментарийРНК="")
	
	// Кухарь А.Ю. 17.02.2022 конец
	
	Рнк = документы.РасходнаяНакладная.СоздатьДокумент();
	Рнк.Контрагент=Контрагент;
	Рнк.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
	// Шворобей ВЮ 11.03.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2410
	Рнк.Дата = ТекущаяДатаСеанса();
	// Шворобей ВЮ 10.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5396 
	//Рнк.ДатаОтгрузки = Рнк.Дата;
	// Шворобей ВЮ 10.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5396 
	// Шворобей ВЮ 11.03.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2410
	рнк.ПунктДоставки=ПунктДоставки;
	рнк.Договор=Договор;
	Рнк.ОтсрочкаПлатежа=Договор.ОтсрочкаПлатежа;
	
	// Кухарь А.Ю. 28.04.2022 начало
	рнк.Склад=СкладДОП;
	// Кухарь А.Ю. 28.04.2022 конец
	
	//++Данилова Е.В. 29.09.2025 HELP-7048
	//рнк.Подразделение=Контрагент.Менеджер.Подразделение;
	рнк.Подразделение=ЗаполнениеДокументов.ПодразделениеПродажПоМенеджеру(Контрагент.Менеджер);
	//--Данилова Е.В. 29.09.2025
	рнк.Менеджер=Контрагент.Менеджер;
	
	
	// Кухарь А.Ю. 17.02.2022 начало
	//
	если ЗначениеЗаполнено(КомментарийРНК) тогда
		рнк.Комментарий=КомментарийРНК;
	КонецЕсли;
	// Кухарь А.Ю. 17.02.2022 конец
	
	
	ЗаполнитьШапкуДокумента(РНК, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
	
	// Кухарь А.Ю. 04.02.2022 начало
	// Исправление
	рнк.КодОперации=Перечисления.КодыОперацийОстатки.Комиссия;
	УстановитьНомерДокументаКлиентСервер(РНК); 
	// Кухарь А.Ю. 04.02.2022 конец
	
	// Кухарь А.Ю.  28.03.2024 начало
	если ЗначениеЗаполнено(Договор) тогда
		рнк.Организация=Договор.Организация; 
	КонецЕсли;
	// Кухарь А.Ю.  28.03.2024 конец
	
	
	// Кухарь А.Ю. 11.01.2021 начало
	// цены почему-то не заполняются
	Если НЕ ЗначениеЗаполнено(рнк.ТипЦенРаспродажа) тогда
		рнк.ТипЦенРаспродажа=РНК.Контрагент.ТипЦенРаспродажа;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(рнк.ТипЦен) тогда
		рнк.ТипЦен=Контрагент.ТипЦен;
	КонецЕсли;
	// Кухарь А.Ю. 11.01.2021 конец
	
	РНК.ПунктДоставки = ПунктДоставки;
		
	// Шворобей ВЮ 22.10.2024 ++ https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2033
	Если НЕ ЗначениеЗаполнено(РНК.ПунктДоставки) Тогда
		РНК.ПунктДоставки = ЗаполнениеДокументов.УстановитьПунктДоставкиСервер(РНК);
		Если НЕ ЗначениеЗаполнено(РНК.ПунктДоставки) Тогда
			//++Данилова Е.В. 17.06.2026 №0000000008
			//СообщитьИзМодуля("Не удалось заполнить Пункт Доставки"); 
			Сообщить("Не удалось заполнить Пункт Доставки"); 
			//--Данилова Е.В. 17.06.2026 
		КонецЕсли;
	КонецЕсли;
		
	//ПунктДоставки_ПриИзменении(РНК.ПунктДоставки,РНК);
	Если ЗначениеЗаполнено(РНК.ПунктДоставки.РайонДоставки) Тогда
		РНК.РайонДоставки = РНК.ПунктДоставки.РайонДоставки;			
	КонецЕсли;	
	Если ЗначениеЗаполнено(РНК.ПунктДоставки.Регион) Тогда
		РНК.Регион = РНК.ПунктДоставки.Регион;			
	КонецЕсли;
	
	Если РНК.ПунктДоставки.ТипДоставки = Перечисления.ТипыДоставки.ТранспортнаяКомпания Тогда
		РНК.ТранспортнаяКомпания = ?(ЗначениеЗаполнено(РНК.ПунктДоставки.ТраспортнаяКомпания), РНК.ПунктДоставки.ТраспортнаяКомпания, Неопределено);
		РНК.ПунктПерегруза = ?(ЗначениеЗаполнено(РНК.ПунктДоставки.ПунктПерегруза), РНК.ПунктДоставки.ПунктПерегруза, Неопределено);
	Иначе
		РНК.ТранспортнаяКомпания = Неопределено;	
		РНК.ПунктПерегруза = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РНК.ПунктДоставки.Грузополучатель) Тогда
		РНК.Грузополучатель = РНК.ПунктДоставки.Грузополучатель;		
	КонецЕсли;
	Если ЗначениеЗаполнено(РНК.ПунктДоставки.Получатель) Тогда
		РНК.Получатель = РНК.ПунктДоставки.Получатель;		
	КонецЕсли;
	
	РНК.ДопОбработки.Очистить();
	Если РНК.ПунктДоставки.ВидыДопОбработок.Количество() = 0 Тогда
		Для Каждого СтрокаТЧ Из РНК.Контрагент.ВидыДопОбработок Цикл
			СтрокаДО = РНК.ДопОбработки.Добавить();	
			СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
		КонецЦикла;
	Иначе
		Для Каждого СтрокаТЧ Из РНК.ПунктДоставки.ВидыДопОбработок Цикл
			СтрокаДО = РНК.ДопОбработки.Добавить();	
			СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
		КонецЦикла;
	КонецЕсли;
	// Шворобей ВЮ 22.10.2024 ++ https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2033
	
	Пока ВыборкаНоменклатуры.Следующий() Цикл
		
		// Шворобей ВЮ 02.02.2023 ++
		рнк.ПостояннаяАкция = ВыборкаНоменклатуры.ПостояннаяАкция;
		// Шворобей ВЮ 02.02.2023 ++
		
		СтрТЧ=рнк.Товары.Добавить();
		СтрТЧ.Номенклатура=ВыборкаНоменклатуры.Номенклатура;
		СтрТЧ.Количество=ВыборкаНоменклатуры.Количество;
		СтрТЧ.Заявка=ВыборкаНоменклатуры.Количество;
		СтрТЧ.ПодтвержденнаяЗаявка=ВыборкаНоменклатуры.Количество;
		ПриИзмененииНоменклатурыТабЧасти(СтрТЧ, РНК);
		РассчитатьСуммуТабЧасти(СтрТЧ, РНК);
		
	КонецЦикла;
	
	Если Контрагент.ИспользоватьНоменклатурнуюМатрицу  Тогда
		ПересчетТЧМатрицы(РНК,"Товары",ПараметрыСеанса.ВалютаНац,ПараметрыСеанса.ВалютаНац,1,1);	
	Иначе
		ПересчетТЧ(РНК,"Товары",ПараметрыСеанса.ВалютаНац,ПараметрыСеанса.ВалютаНац,1,1,Истина);	
	Конецесли;		
	// Кухарь А.Ю. 11.01.2021 начало
	// На часть позиций нули.
	МассНулей=рнк.Товары.НайтиСтроки(Новый Структура("Цена",0)); 
	для каждого СтрМассНулей из МассНулей цикл
		//++Данилова Е.В. 17.06.2026 №0000000008
		//СообщитьИзМодуля("Пустая цена у "+СтрМассНулей.номенклатура);
		Сообщить("Пустая цена у "+СтрМассНулей.номенклатура); 
		//--Данилова Е.В. 17.06.2026 
	КонецЦикла;
	// Кухарь А.Ю. 11.01.2021 конец
	
	//если РольДоступна("Администратор") тогда Возврат;КонецЕсли;
	
	// Кухарь А.Ю. 28.04.2022 начало
	//
	ОбменМаркетПлейс.ПунктДоставки_ПриИзменении(рнк); 
	// Кухарь А.Ю. 28.04.2022 конец
	
	//Данилова Е.В. 19.12.2025 HELP-8278  
	//рнк.Записать();
	// Кухарь 16.03.2022 начало
	//
	//Данилова Е.В. 19.12.2025 HELP-8278
	//СообщитьИзМодуля(""+РНК);
	
	// Кухарь  16.03.2022 конец
	
	//Форма=РНК.ПолучитьФорму("ФормаДокумента");
	//форма.Открыть();
	
	// Кухарь А.Ю. 28.04.2022 начало
	// Кухарь А.Ю. 28.04.2022 конец
	//Данилова Е.В. 19.12.2025 HELP-8278
	//Возврат РНК.Ссылка;
	Возврат РНК;
	
КонецФункции

Процедура СоздатьЗаказыFBO(Знач МассивРНК) Экспорт
    НачатьТранзакцию();
	МассивЗаказов = Новый Массив; 
	Для каждого РНК Из МассивРНК Цикл
		
		НовыйДокумент = Документы.ЗаказСмешанныхСпаекFBO.СоздатьДокумент(); 
		НовыйДокумент.Заполнить(РНК);
		НовыйДокумент.Дата = ТекущаяДатаСеанса(); 
		НовыйДокумент.Автор = ПараметрыСеанса.Пользователь; 
		
		Попытка
		
			НовыйДокумент.Записать(); 	
		    МассивЗаказов.Добавить(НовыйДокумент.Ссылка); 
		Исключение
		     ОтменитьТранзакцию();
			 Сообщить(ОписаниеОшибки()); 
		КонецПопытки;
	КонецЦикла;
	
	Если ТранзакцияАктивна()  Тогда
	
		ЗафиксироватьТранзакцию();	
		
		Сообщить("Созданы заказы FBO:" + Символы.ПС + СтрСоединить(МассивЗаказов,Символы.ПС));
		
	КонецЕсли;

КонецПроцедуры  

Процедура ЗаполнитьКомплектующиеПоРНК(Знач МассивРНК) Экспорт 
	
	Для каждого РНК Из МассивРНК Цикл
	
		РНКОбъект = РНК.ПолучитьОбъект(); 
		ЗаполнениеДокументов.ЗаполнитьТЧКомплектующие(РНКОбъект);
	    Попытка
		
			РНКОбъект.Записать(); 	
		    
		Исключение
		     
			 Сообщить("Не удалось заполнить ТЧ Комплектующие по " + Строка(РНК)); 
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

//--Данилова Е.В. 31.10.2025
#КонецОбласти

//++Данилова Е.В. 19.06.2026 Изм.№0000000008
//СкладДОП=Справочники.Склады.НайтиПоКоду("STC-60");
СкладДОП=Справочники.Склады.НайтиПоКоду("STЕ-49");
//--Данилова Е.В. 19.06.2026 
