Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Подразделение,
	|	СтатьяЗатрат,
	|	СуммаУпрКонечныйОстаток  КАК СумКон
	|ИЗ
	|	РегистрНакопления.Затраты.ОстаткиИОбороты(&Дата2, &Дата2, , , )";
	
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата));
	СписаноЗатрат=0;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение=Движения.Затраты.Добавить();	
		
		Движение.Период=Дата;
		
		Движение.ВидДвижения	=ВидДвиженияНакопления.Расход;
		Движение.Подразделение	=Выборка.Подразделение;
		Движение.СтатьяЗатрат	=Выборка.СтатьяЗатрат;
		
		Движение.СуммаУпр		=Выборка.СумКон;	
		
		//крохин начало
		Движение.Комментарий        = "реформация баланса";
		//крохин конец
		
		СписаноЗатрат=СписаноЗатрат+Выборка.СумКон;
	КонецЦикла; 
	
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ВидНоменклатуры,
	|	Подразделение,
	|	СуммаКонечныйОстаток КАК СумКон
	|ИЗ
	|	РегистрНакопления.Профит.ОстаткиИОбороты(&Дата2, &Дата2, , , )";
	
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата));
	
	СписаноПрофита=0;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение=Движения.Профит.Добавить();	
		
		Движение.Период=Дата;
		
		Движение.ВидДвижения		=ВидДвиженияНакопления.Расход;
		Движение.Подразделение		=Выборка.Подразделение;
		Движение.ВидНоменклатуры	=Выборка.ВидНоменклатуры;
		
		Движение.Сумма				=Выборка.СумКон;	
		
		СписаноПрофита=СписаноПрофита+Выборка.СумКон;
	КонецЦикла;
	
	Если НЕ Контрагент.Пустая() Тогда
		ФинРезультат=СписаноПрофита-СписаноЗатрат;
		Движение=Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
		Движение.Период		=Дата;
		Движение.Контрагент	=Контрагент;
		Движение.Договор	=Договор;
		Движение.СуммаВал	=глПересчет(ФинРезультат,ПараметрыСеанса.ВалютаУпр_2009,Дата,Договор.ВалютаКредита,Дата);
		Движение.СуммаУпр	=ФинРезультат;	
	КонецЕсли;	
КонецПроцедуры
