#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ЗаписьXML;
Перем КорневыеПространстваИмен;

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ДобавитьУзел(Родитель, Имя, Знач Значение = Неопределено, Знач МожетОтсутствовать = Ложь, Знач МожетБытьНеопределено = Неопределено) Экспорт
	Если Родитель = Неопределено Тогда
		Родитель = ДеревоXML;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Имя) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Узел = Родитель.Строки.Добавить();
	Узел.Имя                   = Имя;
	Узел.Значение              = Значение;
	Узел.Текст                 = Ложь;
	Узел.МожетОтсутствовать    = МожетОтсутствовать;
	Узел.МожетБытьНеопределено = МожетБытьНеопределено;
	
	Возврат Узел;
КонецФункции

Процедура ДобавитьАтрибут(Узел, Имя, Знач Значение = Неопределено, Знач МожетОтсутствовать = Ложь) Экспорт
	Атрибут = Узел.Строки.Добавить();
	Атрибут.ЭтоАтрибут            = Истина;
	Атрибут.Имя                   = Имя;
	Атрибут.Значение              = Значение;
	Атрибут.Текст                 = Ложь;
	Атрибут.МожетОтсутствовать    = МожетОтсутствовать;
	Атрибут.МожетБытьНеопределено = Ложь;
КонецПроцедуры

Процедура ДобавитьПространствоИмен(Узел, Префикс, URI) Экспорт
	Если Узел = Неопределено Тогда
		ПространстваИмен = КорневыеПространстваИмен;
	Иначе
		ПространстваИмен = Узел.ПространстваИмен;
		Если ПространстваИмен = Неопределено Тогда
			ПространстваИмен = Новый СписокЗначений;
			Узел.ПространстваИмен = ПространстваИмен;
		КонецЕсли;
	КонецЕсли;
	ПространстваИмен.Добавить(Префикс, URI);
КонецПроцедуры

Функция НачатьЗаписьВСтрокуXML(ЗаписатьОбъявлениеXML = Истина, Кодировка = "windows-1251") Экспорт
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку(Кодировка);
	Если ЗаписатьОбъявлениеXML Тогда
		ЗаписьXML.ЗаписатьОбъявлениеXML();
	КонецЕсли;
	Для Каждого ЭлементСписка Из КорневыеПространстваИмен Цикл
		ЗаписьXML.ЗаписатьСоответствиеПространстваИмен(ЭлементСписка.Значение, ЭлементСписка.Представление);
	КонецЦикла;
	Возврат ЗаписьXML;
КонецФункции

Процедура ЗаписатьДеревоXML() Экспорт
	Если ЗаписьXML = Неопределено Тогда
		НачатьЗаписьВСтрокуXML();
	КонецЕсли;
	
	ПодготовитьКВыгрузкеРекурсивно(ДеревоXML.Строки, Ложь, Ложь);
	
	Для Каждого Узел Из ДеревоXML.Строки Цикл
		ЗаписатьУзелXML(Узел);
	КонецЦикла;
	
	ДеревоXML.Строки.Очистить();
КонецПроцедуры

Функция СтрокаXML() Экспорт
	ЗаписатьДеревоXML();
	Возврат ЗаписьXML.Закрыть();
КонецФункции

// Возвращает результат чтения XML.
// 
// Параметры:
// 	Данные - Поток - поток для чтения.
// 	       - Строка - имя файла.
// 	ТипЗначения - ТипЗначенияXDTO
// Возвращаемое значение:
// 	ОбъектXDTO
Функция ПрочитатьXDTO(Данные, ТипЗначения = Неопределено) Экспорт
	
	ОбъектXML = Новый ЧтениеXML;
	Если ТипЗнч(Данные) = Тип("Поток") Тогда
		Данные.Перейти(0, ПозицияВПотоке.Начало);
		ОбъектXML.ОткрытьПоток(Данные);
	Иначе
		ОбъектXML.ОткрытьФайл(Данные);
	КонецЕсли;
	РезультатЧтения = ФабрикаXDTO.ПрочитатьXML(ОбъектXML, ТипЗначения);
	ОбъектXML.Закрыть();
	
	Возврат РезультатЧтения;
	
КонецФункции

// Возвращает значение свойства XDTO.
// 
// Параметры:
// 	ОбъектXDTO - ОбъектXDTO
// 	ИмяСвойства - Строка
// 	ЗначениеПоУмолчанию - Произвольный - значение, которое будет возвращено, в случае отсутствия значения
// 	Тип - Строка - тип, к которому будет приведено возвращаемое значение
// 	ЭтоСписок - Булево
// 	НеопределеноПоУмолчанию - Булево - не приводить к значению по умолчанию типа, указанного в параметре Тип.
// 	                          В случае отсутствия значения, будет возвращено Неопределено.
// Возвращаемое значение:
// 	Произвольный
Функция ЗначениеСвойстваXDTO(ОбъектXDTO, ИмяСвойства, ЗначениеПоУмолчанию = Неопределено, Тип = Неопределено,
	ЭтоСписок = Ложь, НеопределеноПоУмолчанию = Ложь) Экспорт
	
	Значение = ЗначениеСвойстваXDTOСлужебный(ОбъектXDTO, ИмяСвойства);
	
	Если Тип <> Неопределено Тогда
		
		Если Значение <> Неопределено Тогда
			Если Тип = "Число" Тогда
				Значение = Число(Значение);
			ИначеЕсли Тип = "Дата" Тогда
				Значение = ДатаИзСтроки(Значение);
			ИначеЕсли Тип = "Время" Тогда
				Значение = ВремяИзСтроки(Значение);
			ИначеЕсли Тип = "XMLДата" Тогда
				Значение = XMLЗначение(Тип("Дата"),Значение);
			ИначеЕсли Тип = "Булево" Тогда
				Значение = Булево(Значение);
			КонецЕсли;
			
		ИначеЕсли НеопределеноПоУмолчанию Тогда
			Значение = Неопределено;
		ИначеЕсли Тип = "Число" Тогда
			Значение = 0;
		ИначеЕсли Тип = "Дата" Тогда
			Значение = '00010101';
		ИначеЕсли Тип = "XMLДата" Тогда
			Значение = '00010101';
		ИначеЕсли Тип = "Булево" Тогда
			Значение = Ложь;
		ИначеЕсли Тип = "Строка" Тогда
			Значение = "";
		КонецЕсли;
		
	ИначеЕсли ЭтоСписок И ТипЗнч(Значение) <> Тип("СписокXDTO") И Значение <> Неопределено Тогда
		
		// При чтении xml файла фабрикой XDTO без указания типа, если в СпискеXDTO только 1 строка,
		// то список конвертируется в ОбъектXDTO. Вернем его в массиве, чтобы
		// всегда обходить в цикле, вне зависимости от количества строк.
		
		Коллекция = Новый Массив;
		Коллекция.Добавить(Значение);
		
		Значение = Коллекция;
		
	КонецЕсли;
	
	Если Значение = Неопределено И ЗначениеПоУмолчанию <> Неопределено Тогда
		Значение = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьУзелXML(Узел)
	Если Не Узел.ТребуетсяВыгрузить Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента(Узел.Имя);
	
	Если Узел.ПространстваИмен <> Неопределено Тогда
		Для Каждого ЭлементСписка Из Узел.ПространстваИмен Цикл
			ЗаписьXML.ЗаписатьСоответствиеПространстваИмен(ЭлементСписка.Значение, ЭлементСписка.Представление);
		КонецЦикла;
	КонецЕсли;
	
	Если Узел.Текст <> Неопределено Тогда
		ЗаписьXML.ЗаписатьТекст(Узел.Текст);
	ИначеЕсли Не Узел.ТребуетсяВыгрузитьПодчиненные Тогда
		ЗаписьXML.ЗаписатьАтрибут("xsi:nil", "true");
	КонецЕсли;
	
	Для Каждого ВложенныйУзел Из Узел.Строки Цикл
		Если ВложенныйУзел.ЭтоАтрибут Тогда
			Если ВложенныйУзел.ТребуетсяВыгрузить Тогда
				ЗаписьXML.ЗаписатьАтрибут(ВложенныйУзел.Имя, ВложенныйУзел.Текст);
			КонецЕсли;
		Иначе
			ЗаписатьУзелXML(ВложенныйУзел);
		КонецЕсли;
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
КонецПроцедуры

Процедура ПодготовитьКВыгрузкеРекурсивно(Узлы, ЗначениеПодчиненныхЗаполнено, ТребуетсяВыгрузитьПодчиненные)
	Для Каждого Узел Из Узлы Цикл
		МожетБытьНеопределено = (Узел.МожетБытьНеопределено = Истина);
		Если Узел.Текст = Ложь Тогда
			Узел.ЗначениеЗаполнено = ЗначениеЗаполнено(Узел.Значение);
			Если Узел.Значение = Неопределено
				Или Узел.Значение = Null
				Или (МожетБытьНеопределено И Не ЗначениеЗаполнено(Узел.Значение)) Тогда
				Узел.Текст = Неопределено;
			Иначе
				Тип = ТипЗнч(Узел.Значение);
				Если Тип = Тип("Строка") Тогда
					Узел.Текст = Узел.Значение;
				ИначеЕсли Тип = Тип("Дата") И ЗначениеЗаполнено(ФорматДат) Тогда
					Узел.Текст = Формат(Узел.Значение, ФорматДат);
				Иначе
					Узел.Текст = XMLСтрока(Узел.Значение);
				КонецЕсли;
			КонецЕсли;
		Иначе
			Узел.ЗначениеЗаполнено = ЗначениеЗаполнено(Узел.Текст);
		КонецЕсли;
		ПодготовитьКВыгрузкеРекурсивно(Узел.Строки, Узел.ЗначениеПодчиненныхЗаполнено, Узел.ТребуетсяВыгрузитьПодчиненные);
		// Если явно установлен признак nillable и текст подчиненных не заполнен, то группа считается пустой (nil="true").
		// Если есть непустые атрибуты, то группа также не может считаться пустой.
		Если МожетБытьНеопределено И Узел.Текст = Неопределено И Не Узел.ЗначениеПодчиненныхЗаполнено Тогда
			Узел.ТребуетсяВыгрузитьПодчиненные = Ложь;
			Для Каждого ВложенныйУзел Из Узел.Строки Цикл
				Если Не ВложенныйУзел.ЭтоАтрибут Тогда
					ВложенныйУзел.ТребуетсяВыгрузить = Ложь;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если Узел.ЗначениеЗаполнено Или Узел.ЗначениеПодчиненныхЗаполнено Тогда
			ЗначениеПодчиненныхЗаполнено = Истина;
		КонецЕсли;
		Узел.ТребуетсяВыгрузить = ТребуетсяВыгрузитьУзел(Узел);
		Если Узел.ТребуетсяВыгрузить Тогда
			ТребуетсяВыгрузитьПодчиненные = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ТребуетсяВыгрузитьУзел(Узел)
	Возврат Не Узел.МожетОтсутствовать
		Или Узел.ЗначениеЗаполнено
		Или Узел.ЗначениеПодчиненныхЗаполнено;
КонецФункции

// Возвращает значение свойства XDTO
//
// Параметры:
//  ОбъектXDTO - ОбъектXDTO - объект, значение свойства которого нужно получить
//  Путь - Строка - путь к свойству, разделителем является символ ".".
// 
// Возвращаемое значение:
//  Неопределено - данное свойство отсутствует;
//  Строка - значение свойства;
//  ОбъектXDTO - объект XDTO.
//
Функция ЗначениеСвойстваXDTOСлужебный(ОбъектXDTO, Путь) Экспорт
	
	Если ТипЗнч(ОбъектXDTO) <> Тип("ОбъектXDTO") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МассивСтрок = РазложитьСтрокуВМассивСлов(Путь, ".");
	
	Если ОбъектXDTO.Свойства().Получить(МассивСтрок[0]) = Неопределено Тогда
		Возврат Неопределено
	КонецЕсли;
	
	Если МассивСтрок.Количество() = 1 Тогда
		Значение = ОбъектXDTO[МассивСтрок[0]];
		Если ТипЗнч(Значение) = Тип("ОбъектXDTO") И Значение.Свойства().Количество() = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		Возврат Значение;
	Иначе
		НаборСвойств = ОбъектXDTO.Свойства();
		Свойство = НаборСвойств.Получить(МассивСтрок[0]);
		Если Свойство = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		Если Свойство.ВерхняяГраница = 1 Тогда
			ПодОбъектXDTO = ОбъектXDTO.ПолучитьXDTO(Свойство);
		Иначе
			Список = ОбъектXDTO.ПолучитьСписок(Свойство);
			Если Список.Количество() = 0 Тогда
				Возврат Неопределено;
			Иначе
				ПодОбъектXDTO = Список[0];
			КонецЕсли;
		КонецЕсли;
		МассивСтрок.Удалить(0);
		НоваяСтрока = "";
		Для Каждого Элемент Из МассивСтрок Цикл
			НоваяСтрока = НоваяСтрока + ?(ПустаяСтрока(НоваяСтрока), "", ".") + Элемент;
		КонецЦикла;
		Возврат ЗначениеСвойстваXDTO(ПодОбъектXDTO, НоваяСтрока);
	КонецЕсли;
	
КонецФункции
// Определяет, является ли символ разделителем.
//
// Параметры:
//  КодСимвола      - Число  - код проверяемого символа;
//  РазделителиСлов - Строка - символы разделителей. Если параметр не указан, то 
//                             разделителем считаются все символы, не являющиеся цифрами, 
//                             латинскими и кириллическими буквами, а также знаком подчеркивания.
//
// Возвращаемое значение:
//  Булево - Истина, если символ с кодом КодСимвола является разделителем.
//
Функция ЭтоРазделительСлов(КодСимвола, РазделителиСлов = Неопределено) Экспорт
	
	Если РазделителиСлов <> Неопределено Тогда
		Возврат СтрНайти(РазделителиСлов, Символ(КодСимвола)) > 0;
	КонецЕсли;
		
	Диапазоны = Новый Массив;
	ПриОпределенииСимволовСлов(Диапазоны);
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 48, 57)); 	// цифры
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 65, 90)); 	// латиница большие
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 97, 122)); 	// латиница маленькие
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 95, 95)); 	// символ "_"
	
	Для Каждого Диапазон Из Диапазоны Цикл
		Если КодСимвола >= Диапазон.Мин И КодСимвола <= Диапазон.Макс Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Разбивает строку на несколько строк, используя заданный набор разделителей.
// Если параметр РазделителиСлов не задан, то разделителем слов считается любой из символов, 
// не относящихся к символам латиницы, кириллицы, цифры, подчеркивания.
//
// Параметры:
//  Значение        - Строка - исходная строка, которую необходимо разложить на слова.
//  РазделителиСлов - Строка - перечень символов-разделителей. Например, ".,;".
//
// Возвращаемое значение:
//  Массив - список слов.
//
// Пример:
//  СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов("один-@#два2_!три") возвратит массив значений: "один",
//  "два2_", "три"; СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов("один-@#два2_!три", "#@!_") возвратит массив
//  значений: "один-", "два2", "три".
//
Функция РазложитьСтрокуВМассивСлов(Знач Значение, РазделителиСлов = Неопределено) Экспорт
	
	Слова = Новый Массив;
	
	РазмерТекста = СтрДлина(Значение);
	НачалоСлова = 1;
	Для Позиция = 1 По РазмерТекста Цикл
		КодСимвола = КодСимвола(Значение, Позиция);
		Если ЭтоРазделительСлов(КодСимвола, РазделителиСлов) Тогда
			Если Позиция <> НачалоСлова Тогда
				Слова.Добавить(Сред(Значение, НачалоСлова, Позиция - НачалоСлова));
			КонецЕсли;
			НачалоСлова = Позиция + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если Позиция <> НачалоСлова Тогда
		Слова.Добавить(Сред(Значение, НачалоСлова, Позиция - НачалоСлова));
	КонецЕсли;
	
	Возврат Слова;
	
КонецФункции

// Определяет коды символов, которые не считаются разделителем.
// Если явно не указан разделитель слов.
//
// Параметры:
//   Диапазоны - Массив из Структура:
//    * Мин - Число - код символа, с которого начинается диапазон.
//    * Макс - Число - код символа, на котором заканчивается диапазон.
//
Процедура ПриОпределенииСимволовСлов(Диапазоны) Экспорт
	// Локализация
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 1040, 1103));  // кириллица
	// АПК:163-выкл
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 1025, 1025));  // символ "Ё"
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 1105, 1105));  // символ "ё"
	// АПК:163-вкл
	
	// Конец Локализация
КонецПроцедуры

// Преобразует строковое представление времени в форматах HH.mm.ss в дату.
//
// Параметры:
//  ВремяСтрокой - Строка - представление времени.
//  Разделитель - Строка - разделитель часов, минут, секунд.
// Возвращаемое значение:
//  Дата - преобразованное значение.
//
Функция ВремяИзСтроки(Знач ВремяСтрокой, Знач Разделитель = ".")
	
	ЧастьДаты = "00010101";
	ЧастьВремени = СтрЗаменить(СокрЛП(ВремяСтрокой), Разделитель, "");
	
	Возврат Дата(ЧастьДаты + ЧастьВремени);
	
КонецФункции

// Преобразует строковое представление даты в форматах DD.MM.YYYY, YYYY-MM-DD в дату.
//
// Параметры:
//  Строка	 - Строка - представление даты.
// Возвращаемое значение:
//  Дата - преобразованное значение.
//
Функция ДатаИзСтроки(Строка) Экспорт
	
	Если ТипЗнч(Строка) = Тип("Дата") Тогда
		Возврат Строка;
	КонецЕсли;
	
	ЧастьДаты    = "";
	ЧастьВремени = "000000";
	Если Не ТолькоЦифрыВСтроке(Сред(Строка, 3, 1)) Тогда
		ЧастьДаты = Сред(Строка, 7, 4) + Сред(Строка, 4, 2) + Сред(Строка, 1, 2);
		// заполним дополнительно время для формата "dd.MM.yyyy HH.mm.ss".
		Если СтрДлина(Строка) = 19 Тогда
			ЧастьВремени = ЗаменитьОдниСимволыДругими(".:", Сред(Строка, 12), "");
		КонецЕсли;
	Иначе
		ЧастьДаты = Сред(Строка, 1, 4) + Сред(Строка, 6, 2) + Сред(Строка, 9, 2);
		// заполним дополнительно время для формата 20 символов.
		Если СтрДлина(Строка) = 20 Тогда
			ЧастьВремени = ЗаменитьОдниСимволыДругими(".:", Сред(Строка, 12), "");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Дата(ЧастьДаты + ЧастьВремени);
	
КонецФункции

// Проверяет, содержит ли строка только цифры.
//
// Параметры:
//  Значение         - Строка - проверяемая строка.
//  Устаревший       - Булево - устаревший параметр, не используется.
//  ПробелыЗапрещены - Булево - если Ложь, то в строке допустимо наличие пробелов.
//
// Возвращаемое значение:
//   Булево - Истина - строка содержит только цифры или пустая, Ложь - строка содержит иные символы.
//
// Пример:
//  Результат = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке("0123"); // Истина
//  Результат = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке("0123abc"); // Ложь
//  Результат = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке("01 2 3",, Ложь); // Истина
//
Функция ТолькоЦифрыВСтроке(Знач Значение, Знач Устаревший = Истина, Знач ПробелыЗапрещены = Истина) Экспорт
	
	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПробелыЗапрещены Тогда
		Значение = СтрЗаменить(Значение, " ", "");
	КонецЕсли;
		
	Если СтрДлина(Значение) = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Если содержит только цифры, то в результате замен должна быть получена пустая строка.
	// Проверять при помощи ПустаяСтрока нельзя, так как в исходной строке могут быть пробельные символы.
	Возврат СтрДлина(
		СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить(
		СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( 
			Значение, "0", ""), "1", ""), "2", ""), "3", ""), "4", ""), "5", ""), "6", ""), "7", ""), "8", ""), "9", "")) = 0;
	
КонецФункции

// Выполняет замену символов в строке.
// Предназначена для простых случаев - например, для замены латиницы на похожие кириллические символы.
//
// Параметры:
//  ЗаменяемыеСимволы - Строка - строка символов, каждый из которых требует замены;
//  Значение          - Строка - исходная строка, в которой требуется замена символов;
//  СимволыЗамены     - Строка - строка символов, на каждый из которых нужно заменить символы параметра
//                               ЗаменяемыеСимволы.
// 
// Возвращаемое значение:
//  Строка - строка после замены символов.
//
Функция ЗаменитьОдниСимволыДругими(ЗаменяемыеСимволы, Значение, СимволыЗамены) Экспорт
	
	Результат = Значение;
	
	Для НомерСимвола = 1 По СтрДлина(ЗаменяемыеСимволы) Цикл
		Результат = СтрЗаменить(Результат, Сред(ЗаменяемыеСимволы, НомерСимвола, 1), Сред(СимволыЗамены, НомерСимвола, 1));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Инициализация

ДеревоXML.Колонки.Добавить("Имя",   Новый ОписаниеТипов("Строка"));
ДеревоXML.Колонки.Добавить("Текст", Новый ОписаниеТипов("Строка, Булево"));
ДеревоXML.Колонки.Добавить("Значение");
ДеревоXML.Колонки.Добавить("Атрибуты");
ДеревоXML.Колонки.Добавить("ПространстваИмен");
ДеревоXML.Колонки.Добавить("ЭтоАтрибут",                    Новый ОписаниеТипов("Булево"));
ДеревоXML.Колонки.Добавить("МожетОтсутствовать",            Новый ОписаниеТипов("Булево"));
ДеревоXML.Колонки.Добавить("МожетБытьНеопределено",         Новый ОписаниеТипов("Строка, Булево"));
ДеревоXML.Колонки.Добавить("ЗначениеЗаполнено",             Новый ОписаниеТипов("Булево"));
ДеревоXML.Колонки.Добавить("ЗначениеПодчиненныхЗаполнено",  Новый ОписаниеТипов("Булево"));
ДеревоXML.Колонки.Добавить("ТребуетсяВыгрузить",            Новый ОписаниеТипов("Булево"));
ДеревоXML.Колонки.Добавить("ТребуетсяВыгрузитьПодчиненные", Новый ОписаниеТипов("Булево"));

ФорматДат = "ДФ=yyyy-MM-dd";

ВыгружатьПустые = Истина;

КорневыеПространстваИмен = Новый СписокЗначений;

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли