
Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	СформироватьОтчет(ТаблицаПараметров);
КонецПроцедуры

Процедура СформироватьОтчет(ТаблицаПараметров = Неопределено)
	
	СписокПолучателей = Новый СписокЗначений;
	
	Если ТаблицаПараметров <> Неопределено Тогда
		
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
			
			Если СтрокаТП.Имя = "Получатель" Тогда			
				СписокПолучателей.Добавить(СтрокаТП.Значение);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если СписокПолучателей.Количество() = 0 Тогда Возврат; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Код КАК Код,
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.СнятСПроизводства
	|	И Номенклатура.ПредполагаемаяДатаПоследнейПоставки <> ДАТАВРЕМЯ(1, 1, 1)
	|	И Номенклатура.ПредполагаемаяДатаПоследнейПоставки < &ТекущаяДата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	ТекстПисьма = "";
	Пока Выборка.Следующий() Цикл
		ТекстПисьма = ТекстПисьма + СокрЛП(Выборка.Код) + " " + СокрЛП(Выборка.Ссылка) + Символы.ПС;	
	КонецЦикла;
	
	ТемаПисьма = "Необходимость редактировать список Номенклатуры: поставить «Снят с производства» либо изменить «Предполагаемую дату последней поставки»";
	
	ОшибкиУведомления = СформироватьВнутреннееУведомление(СписокПолучателей, ТекстПисьма, ТемаПисьма,,,, "robot@collant.ru");
	
КонецПроцедуры