Процедура РасчетСуммОплатСертификатами() Экспорт
	// было
	//СуммаКРаспределению = Мин(ПодарочныеСертификаты.Итог("Номинал"),СуммаДокумента);	
	//Для Каждого СтрокаТЧ Из ПодарочныеСертификаты Цикл
	//	СуммаЗачета=Макс(Мин(СтрокаТЧ.Номинал,СуммаКРаспределению),0);
	//	Если СтрокаТЧ.СуммаОплатыСертификатами<>СуммаЗачета Тогда
	//		СтрокаТЧ.СуммаОплатыСертификатами=СуммаЗачета;
	//	КонецЕсли;		
	//	СуммаКРаспределению=СуммаКРаспределению-СуммаЗачета;
	//КонецЦикла;
	//Если СуммаОплатыСертификатами<>ПодарочныеСертификаты.Итог("СуммаОплатыСертификатами") Тогда
	//	СуммаОплатыСертификатами=ПодарочныеСертификаты.Итог("СуммаОплатыСертификатами");	
	//КонецЕсли;	
	
	
	
	//-------------------------------------------------------------------------
	// обнулим суммы к оплате по сертификатам, при сканировании следующего
	
	Если модифицированность() =ложь Тогда
		возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из ПодарочныеСертификаты Цикл
		
		СтрокаТЧ.СуммаОплатыСертификатами = 0;
		
	КонецЦикла;		
    	
	//-------------------------------------------------------------------------
	
	// нечаева 18,10,17++++
	// получим список сертификатов для отоваривания 
	
	// 1 - учитываем сертификаты с % оплаты.
	
	СуммаЧека = СуммаДокумента;
	
	
	// тут пока просто собираем данные в разные ТЗ, по разным типам сертификатов.
	СуммаПодарочСертификСоСкидкой30 = 0;
	СписокПодСертСоСк = Новый ТаблицаЗначений;
	СписокПодСертСоСк.Колонки.Добавить("НомерСтроки");
	СписокПодСертСоСк.Колонки.Добавить("Сертификат");
	СписокПодСертСоСк.Колонки.Добавить("ПроцентОплаты");
	СписокПодСертСоСк.Колонки.Добавить("Номинал");
	СписокПодСертСоСк.Колонки.Добавить("СуммаОплаты");
	
	Для Каждого СтрокаТЧ Из ПодарочныеСертификаты Цикл
		
		Если НЕ СтрокаТЧ.Сертификат.ОплатаНеБолее30Процентов Тогда
			продолжить;
		КонецЕсли;  
		
		НовСтр = СписокПодСертСоСк.Добавить() ;
		НовСтр.номерСтроки = Строкатч.НомерСтроки;
		НовСтр.сертификат = СтрокаТЧ.Сертификат;
		НовСтр.ПроцентОплаты = СтрокаТЧ.Сертификат.МаксимальныйПроцентОтоваривания;
		НовСтр.Номинал = СтрокаТЧ.Номинал;
		НовСтр.СуммаОплаты = 0;
		
	КонецЦикла;		
	СписокПодСертСоСк.Сортировать("Номинал Убыв");
	СуммаПодарочСертификСоСкидкой30 = СписокПодСертСоСк.Итог("Номинал");
	СуммаВозможнойОплатыСертСоСк = 0;
	
	Если СуммаПодарочСертификСоСкидкой30>0 Тогда 
		СуммаВозможнойОплатыСертСоСк = Окр(СуммаДокумента/100*СписокПодСертСоСк[0].ПроцентОплаты,0); // до целых округлим
	КонецЕсли;	
      	
	
	// 2 - учитываем сертификаты, не подарки
	СуммаПодарочНеПод = 0;
	СписокПодСертНеПод = Новый ТаблицаЗначений;
	СписокПодСертНеПод.Колонки.Добавить("НомерСтроки");
	СписокПодСертНеПод.Колонки.Добавить("Сертификат");
	СписокПодСертНеПод.Колонки.Добавить("ПроцентОплаты");
	СписокПодСертНеПод.Колонки.Добавить("Номинал");
	СписокПодСертНеПод.Колонки.Добавить("СуммаОплаты");
	
	Для Каждого СтрокаТЧ Из ПодарочныеСертификаты Цикл
		
		Если СтрокаТЧ.Сертификат.Подарок Тогда
			продолжить;
		КонецЕсли;  
		
		НовСтр = СписокПодСертНеПод.Добавить() ;
		НовСтр.номерСтроки = Строкатч.НомерСтроки;
		НовСтр.сертификат = СтрокаТЧ.Сертификат;
		НовСтр.Номинал = СтрокаТЧ.Номинал;
		НовСтр.СуммаОплаты = 0;    
		
	КонецЦикла;		
	СуммаПодарочСертификНеПод= СписокПодСертНеПод.Итог("Номинал");
    СписокПодСертНеПод.Сортировать("Номинал Убыв");
	
	// 3 - учитываем сертификаты подарки, без % скидок
	
	СуммаПодарочСертификПодаркиБезПроцента = 0;
	СписокПодСертБезПроц = Новый ТаблицаЗначений;
	СписокПодСертБезПроц.Колонки.Добавить("НомерСтроки");
	СписокПодСертБезПроц.Колонки.Добавить("Сертификат");
	СписокПодСертБезПроц.Колонки.Добавить("ПроцентОплаты");
	СписокПодСертБезПроц.Колонки.Добавить("Номинал");
	СписокПодСертБезПроц.Колонки.Добавить("СуммаОплаты");
	
	Для Каждого СтрокаТЧ Из ПодарочныеСертификаты Цикл
		
		Если НЕ (СтрокаТЧ.Сертификат.ОплатаНеБолее30Процентов) и СтрокаТЧ.Сертификат.подарок Тогда
			
			
			НовСтр = СписокПодСертБезПроц.Добавить() ;
			НовСтр.номерСтроки = Строкатч.НомерСтроки;
			НовСтр.сертификат = СтрокаТЧ.Сертификат;
			НовСтр.Номинал = СтрокаТЧ.Номинал;
			НовСтр.СуммаОплаты = 0;
			
		КонецЕсли;  
		
	КонецЦикла;		
	СуммаПодарочСертификПодаркиБезПроцента = СписокПодСертБезПроц.Итог("Номинал");
	СписокПодСертБезПроц.Сортировать("Номинал Убыв");
    
	// нечаева 18,10,17   ---
	//-----------------------------------------------------------------------------
	//                           реализация алгоритма
	//-----------------------------------------------------------------------------
	
	//// только полные оплаты сертификатами    
	//Если СуммаВозможнойОплатыСертСоСк=0 Тогда
	//	
	//	СуммаКРаспределению = Мин(ПодарочныеСертификаты.Итог("Номинал"),СуммаДокумента);	
	//	Для Каждого СтрокаТЧ Из ПодарочныеСертификаты Цикл
	//		СуммаЗачета=Макс(Мин(СтрокаТЧ.Номинал,СуммаКРаспределению),0);
	//		Если СтрокаТЧ.СуммаОплатыСертификатами<>СуммаЗачета Тогда
	//			СтрокаТЧ.СуммаОплатыСертификатами=СуммаЗачета;
	//		КонецЕсли;		
	//		СуммаКРаспределению=СуммаКРаспределению-СуммаЗачета;
	//	КонецЦикла;
	//	Если СуммаОплатыСертификатами<>ПодарочныеСертификаты.Итог("СуммаОплатыСертификатами") Тогда
	//		СуммаОплатыСертификатами=ПодарочныеСертификаты.Итог("СуммаОплатыСертификатами");	
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	
	
	// есть частичные сертификаты
	//  нечаева 18,10,17 +++ 
	Учтено = 0;
	Если СуммаВозможнойОплатыСертСоСк>0 Тогда
		//   1
		// распределим  сумму,  с учетом того, что оплалить можно не более 30% от  оставшейся суммы чека.
		//Берем от суммы документа только 30%
		СуммаКоторуюНадоПогаситьОтЧека=Окр(СуммаДокумента*СписокПодСертСоСк[0].ПроцентОплаты/100,0);
		
		СуммаПогашенияСерСоСк = Макс( Мин(СуммаВозможнойОплатыСертСоСк,СуммаКоторуюНадоПогаситьОтЧека),0);
		
		СуммаКРаспределению = СуммаПогашенияСерСоСк;	//сколько нужно денег по сертификатам погасить.
		
		Учтено2 = 0; // сколько уже учли сумм по сертификатам. от каждого берем только с нужным процентом!!
		Для Каждого СтрокаТЧ Из ПодарочныеСертификаты Цикл
			
			Если СтрокаТЧ.сертификат.ОплатаНеБолее30Процентов= ложь   Тогда
				продолжить;
			КонецЕсли;
			
			//СуммаВысчПроц = СтрокаТч.Сертификат.МаксимальныйПроцентОтоваривания*СтрокаТч.Сертификат.Номинал/100;
			
			СуммаЗачета=Макс(Мин(СтрокаТЧ.Номинал,СуммаКРаспределению),0); // сумма учтенная по текущему сертификату
			Если СтрокаТЧ.СуммаОплатыСертификатами<>СуммаЗачета Тогда
				СтрокаТЧ.СуммаОплатыСертификатами=СуммаЗачета;
			КонецЕсли;		
			
			Учтено = Учтено+СуммаЗачета;
			СуммаКРаспределению=СуммаКРаспределению-СуммаЗачета;
			
		КонецЦикла;
		
		// посчитали итоги.
		Если СуммаОплатыСертификатами<>ПодарочныеСертификаты.Итог("СуммаОплатыСертификатами") Тогда
			СуммаОплатыСертификатами=ПодарочныеСертификаты.Итог("СуммаОплатыСертификатами");	
		КонецЕсли;
	КонецЕсли; 
	
	// 2 если есть сертификаты купленные, не подарки.
	//Новая сумма к распределению тут минимум   =  сумма документа  -  уже оплаченное сертификатами подарками со скидкой 30%, и сумма номинала по сертификатам не подаркам.
	Если     СписокПодСертНеПод.Итог("Номинал")>0 Тогда
		
		СуммаКРаспределению =  Макс(Мин((СуммаДокумента - ПодарочныеСертификаты.Итог("СуммаОплатыСертификатами")), СписокПодСертНеПод.Итог("Номинал") ),0);
		
		Если СуммаКРаспределению>0 Тогда
			
			Для Каждого СтрокаТЧ Из ПодарочныеСертификаты Цикл
				
				Если СтрокаТЧ.сертификат.Подарок = истина   Тогда
					продолжить;
				КонецЕсли;
				
				СуммаЗачета=Макс(Мин(СтрокаТЧ.Номинал,СуммаКРаспределению),0); // сумма учтенная по текущему сертификату
				Если СтрокаТЧ.СуммаОплатыСертификатами<>СуммаЗачета Тогда
					СтрокаТЧ.СуммаОплатыСертификатами=СуммаЗачета;
				КонецЕсли;		
				
				Учтено = Учтено+СуммаЗачета;
				СуммаКРаспределению=СуммаКРаспределению-СуммаЗачета;
				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// и третий тип  отовариваем сертификаты подарки без % скидки, если они есть..
	Если СписокПодСертБезПроц.Итог("Номинал")>0 Тогда
		СуммаКРаспределению = Макс( Мин((СуммаДокумента - ПодарочныеСертификаты.Итог("СуммаОплатыСертификатами")), СписокПодСертБезПроц.Итог("Номинал") ),0);
		
		Если СуммаКРаспределению>0 Тогда
			
			Для Каждого СтрокаТЧ Из ПодарочныеСертификаты Цикл
				
				Если НЕ (СтрокаТЧ.сертификат.Подарок = истина и СтрокаТЧ.сертификат.ОплатаНеБолее30Процентов= ложь)Тогда
					продолжить;
				КонецЕсли;
				
				СуммаЗачета=Макс(Мин(СтрокаТЧ.Номинал,СуммаКРаспределению),0); // сумма учтенная по текущему сертификату
				Если СтрокаТЧ.СуммаОплатыСертификатами<>СуммаЗачета Тогда
					СтрокаТЧ.СуммаОплатыСертификатами=СуммаЗачета;
				КонецЕсли;		
				
				Учтено = Учтено+СуммаЗачета;
				СуммаКРаспределению=СуммаКРаспределению-СуммаЗачета;
				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	//пересчитаем итоги.
	Если СуммаОплатыСертификатами<>ПодарочныеСертификаты.Итог("СуммаОплатыСертификатами") Тогда
			СуммаОплатыСертификатами=ПодарочныеСертификаты.Итог("СуммаОплатыСертификатами");	
	КонецЕсли;
    
	// нечаева 18,10,17 -----
	
	
	
	
	
	
	// было ранее
	//
	//
	//// нечаева 29,04,16++++
	//Запрос = Новый Запрос;
	//запрос.Текст = "ВЫБРАТЬ
	//			   |	ЧекПодарочныеСертификаты.Сертификат,
	//			   |	ЧекПодарочныеСертификаты.Номинал,
	//			   |	ЧекПодарочныеСертификаты.СуммаОплатыСертификатами,
	//			   |	ЧекПодарочныеСертификаты.Сертификат.ОплатаНеБолее30Процентов КАК СертификатОплатаНеБолее30Процентов,
	//			   |	ЧекПодарочныеСертификаты.НомерСтроки
	//			   |ИЗ
	//			   |	Документ.Чек.ПодарочныеСертификаты КАК ЧекПодарочныеСертификаты
	//			   |ГДЕ
	//			   |	ЧекПодарочныеСертификаты.Сертификат.ОплатаНеБолее30Процентов = ЛОЖЬ
	//			   |	И ЧекПодарочныеСертификаты.Ссылка = &ТекДок
	//			   |
	//			   |УПОРЯДОЧИТЬ ПО
	//			   |	СертификатОплатаНеБолее30Процентов";
	//Запрос.УстановитьПараметр("ТекДок",ссылка);
	//РезПолныхОплат = Запрос.Выполнить().Выгрузить();
	////--------------------------------------------------------------------------------------------------------------------
	//Запрос = Новый Запрос;
	//запрос.Текст = "ВЫБРАТЬ
	//			   |	ЧекПодарочныеСертификаты.Сертификат,
	//			   |	ЧекПодарочныеСертификаты.Номинал,
	//			   |	ЧекПодарочныеСертификаты.СуммаОплатыСертификатами,
	//			   |	ЧекПодарочныеСертификаты.Сертификат.ОплатаНеБолее30Процентов КАК СертификатОплатаНеБолее30Процентов,
	//			   |	ЧекПодарочныеСертификаты.НомерСтроки
	//			   |ИЗ
	//			   |	Документ.Чек.ПодарочныеСертификаты КАК ЧекПодарочныеСертификаты
	//			   |ГДЕ
	//			   |	ЧекПодарочныеСертификаты.Сертификат.ОплатаНеБолее30Процентов = ИСТИНА
	//			  |	И ЧекПодарочныеСертификаты.Ссылка = &ТекДок
	//			   |
	//			   |УПОРЯДОЧИТЬ ПО
	//			   |	СертификатОплатаНеБолее30Процентов";
	//Запрос.УстановитьПараметр("ТекДок",ссылка);			   
	//Рез30ПроцОплат = Запрос.Выполнить().Выгрузить();
	////--------------------------------------------------------------------------------------------------------------------

	//
	//Если Рез30ПроцОплат.Количество() = 0 Тогда
	//	// только полные оплаты сертификатами                                          	
	//	СуммаКРаспределению = Мин(ПодарочныеСертификаты.Итог("Номинал"),СуммаДокумента);	
	//	Для Каждого СтрокаТЧ Из ПодарочныеСертификаты Цикл
	//		СуммаЗачета=Макс(Мин(СтрокаТЧ.Номинал,СуммаКРаспределению),0);
	//		Если СтрокаТЧ.СуммаОплатыСертификатами<>СуммаЗачета Тогда
	//			СтрокаТЧ.СуммаОплатыСертификатами=СуммаЗачета;
	//		КонецЕсли;		
	//		СуммаКРаспределению=СуммаКРаспределению-СуммаЗачета;
	//	КонецЦикла;
	//	Если СуммаОплатыСертификатами<>ПодарочныеСертификаты.Итог("СуммаОплатыСертификатами") Тогда
	//		СуммаОплатыСертификатами=ПодарочныеСертификаты.Итог("СуммаОплатыСертификатами");	
	//	КонецЕсли;
	//	
	//Иначе
	//	// есть оплаты по сертификатам и 30% и полным.
	//	ИтогПоПолным = РезПолныхОплат.Итог("Номинал");
	//	
	//	СуммаКРаспределению = Мин(ИтогПоПолным,СуммаДокумента);	//сколько нужно денег по сертификатам погасить.
	//	
	//	Учтено = 0; // сколько уже учли сумм по сертификатам.
	//	Для Каждого СтрокаТЧ Из ПодарочныеСертификаты Цикл
	//		
	//		Если СтрокаТЧ.сертификат.ОплатаНеБолее30Процентов= истина   Тогда
	//			продолжить;
	//		КонецЕсли;
	//		
	//		СуммаЗачета=Макс(Мин(СтрокаТЧ.Номинал,СуммаКРаспределению),0); // сумма учтенная по текущему сертификату
	//		Если СтрокаТЧ.СуммаОплатыСертификатами<>СуммаЗачета Тогда
	//			СтрокаТЧ.СуммаОплатыСертификатами=СуммаЗачета;
	//		КонецЕсли;		
	//		
	//		Учтено = Учтено+СуммаЗачета;
	//		СуммаКРаспределению=СуммаКРаспределению-СуммаЗачета;
	//		
	//	КонецЦикла;
	//	
	//	// распределим оставшуюся сумму,  с учетом того, что оплалить можно не более 30% от  оставшейся суммы чека.
	//	
	//	ОстатокСуммыПоДоку = СуммаДокумента-Учтено;
	//	
	//	Если ОстатокСуммыПоДоку>0 Тогда
	//		//Берем от этой суммы только 30%
	//		ОстатокСуммыПоДоку=ОстатокСуммыПоДоку*0.30;
	//	КонецЕсли;
	//	
	//	ИтогПо30 = Рез30ПроцОплат.Итог("Номинал");
	//	СуммаКРаспределению = Мин(ИтогПо30,ОстатокСуммыПоДоку);	//сколько нужно денег по сертификатам погасить.
	//	
	//	Учтено2 = 0; // сколько уже учли сумм по сертификатам.
	//	Для Каждого СтрокаТЧ Из ПодарочныеСертификаты Цикл
	//		
	//		Если СтрокаТЧ.сертификат.ОплатаНеБолее30Процентов= ложь   Тогда
	//			продолжить;
	//		КонецЕсли;
	//		
	//		СуммаЗачета=Макс(Мин(СтрокаТЧ.Номинал,СуммаКРаспределению),0); // сумма учтенная по текущему сертификату
	//		Если СтрокаТЧ.СуммаОплатыСертификатами<>СуммаЗачета Тогда
	//			СтрокаТЧ.СуммаОплатыСертификатами=СуммаЗачета;
	//		КонецЕсли;		
	//		
	//		Учтено2 = Учтено2+СуммаЗачета;
	//		СуммаКРаспределению=СуммаКРаспределению-СуммаЗачета;
	//		
	//	КонецЦикла;
	//	
	//	// посчитали итоги.
	//	Если СуммаОплатыСертификатами<>ПодарочныеСертификаты.Итог("СуммаОплатыСертификатами") Тогда
	//		СуммаОплатыСертификатами=ПодарочныеСертификаты.Итог("СуммаОплатыСертификатами");	
	//	КонецЕсли;
	// 
	//	
	//КонецЕсли;	
	//// нечаева 29,04,16 ----
	
КонецПроцедуры

Процедура РассчитатьСуммуПроданыхСертификатов() Экспорт
	ТекСумма=0;
	Для Каждого СтрокаТЧ Из Товары Цикл
		Если НЕ СтрокаТЧ.Сертификат.Пустая() Тогда			
			ТекСумма=ТекСумма+СтрокаТЧ.Всего;			
		КонецЕсли;	
	КонецЦикла;	
	Если ТекСумма<>СуммаПроданныхСертификатов Тогда
		СуммаПроданныхСертификатов=ТекСумма;	
	КонецЕсли; 
КонецПроцедуры 

 //нечаева 19,12,13   ++
 Функция АкцияПлПодарки()

	//АкцияПластиковыеСертификатыПодарки = Подразделение.АкцияСертификатыИзЧека;
	//нечаева 11,12,13 +++
	АкцияПластиковыеСертификатыПодарки = Подразделение.АкцияСертификатыПластиковые; //.АкцияСертификатыИзЧека;
	//нечаева 11,12,13 ---
	
	
	Если КодОперации = Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя Тогда
		АкцияПластиковыеСертификатыПодарки = Справочники.Акции.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ АкцияПластиковыеСертификатыПодарки.Пустая() И (АкцияПластиковыеСертификатыПодарки.ДатаНачала>Дата ИЛИ АкцияПластиковыеСертификатыПодарки.ДатаОкончания<Дата) Тогда		
		АкцияПластиковыеСертификатыПодарки=Справочники.Акции.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ АкцияПластиковыеСертификатыПодарки.Пустая() И АкцияПластиковыеСертификатыПодарки.ПроверятьВремя Тогда	
		ВремяНачала = АкцияПластиковыеСертификатыПодарки.ВремяНачала - Дата(1,1,1);
		ВремяОкончания =  АкцияПластиковыеСертификатыПодарки.Времяокончания - Дата(1,1,1);
		ТекущееВремя = ТекущаяДата() - НачалоДня(ТекущаяДата());
		Если ВремяНачала > ТекущееВремя ИЛИ ВремяОкончания < ТекущееВремя Тогда
			АкцияПластиковыеСертификатыПодарки=Справочники.Акции.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	Если Не АкцияПластиковыеСертификатыПодарки.Пустая() И АкцияПластиковыеСертификатыПодарки.ДатыАктивности.Количество() > 0 Тогда
		ДеньСовпадает = Ложь; 
		Для Каждого СтрокаАкций Из АкцияПластиковыеСертификатыПодарки.ДатыАктивности Цикл
			Если НачалоДня(Дата) = НачалоДня(СтрокаАкций.Дата) Тогда
				ДеньСовпадает = Истина;
			КонецЕсли;				
		КонецЦикла;
		Если НЕ ДеньСовпадает Тогда
			АкцияПластиковыеСертификатыПодарки=Справочники.Акции.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	
	Если Акция.ВыдаватьПластиковыеСертификаты Тогда
		АкцияПластиковыеСертификатыПодарки = Акция;
	КонецЕсли;
	
	Если АкцияПластиковыеСертификатыПодарки.ТолькоДляЧастногоЛица И Контрагент <> Подразделение.ЧастноеЛицо Тогда
		АкцияПластиковыеСертификатыПодарки = Справочники.Акции.ПустаяСсылка();
	КонецЕсли;		
	//крохин конец 15.11.2012

	возврат АкцияПластиковыеСертификатыПодарки;
	
КонецФункции
 //нечаева 19,12,13 --




Функция ПогаситьВернутьСертификаты()  Экспорт
	Ответ="";
	
	Для Каждого СтрокаТЧ Из Товары Цикл
		Если НЕ СтрокаТЧ.Сертификат.Пустая() Тогда
			СертификатОбъект=СтрокаТЧ.Сертификат.ПолучитьОбъект();
			
			Если СертификатОбъект.Использован Тогда
				Если СертификатОбъект.НомерЧекаПогашения<>Номер Тогда
					Ответ=Ответ+?(ПустаяСтрока(Ответ),"",Символы.ПС)+"Сертификат: "+СертификатОбъект+" уже использован !";					
				КонецЕсли;
			Иначе
				Если КодОперации=Перечисления.КодыОперацийОстатки.Реализация Тогда
					СертификатОбъект.ДатаВыдачи			=Дата;					
					СертификатОбъект.НомерЧекаВыдачи	=Номер;
					СертификатОбъект.ПодразделениеВыдачи=Склад.Подразделение;
					//крохин начало 21.12.2013
					//ошибка, проставляться даты должны только на подарки
					////нечаева 19,12,13 +++
					//АкцияСертификатыИзЧека=АкцияПлПодарки();
					//
					//сертификатОбъект.НачалоДействия					= АкцияСертификатыИзЧека.ДатаНачалаПродаж;
					//сертификатОбъект.ОкончаниеДействия 				= АкцияСертификатыИзЧека.ДатаОкончанияПродаж;
					////нечаева 19,12,13 - --
					//крохин конец 21.12.2013
				

			
				Иначе
					//крохин начало 20.05.2021
					//СертификатОбъект.ДатаВыдачи=Неопределено;
					СертификатОбъект.ДатаПогашения = дата;
	СертификатОбъект.Использован = Истина;
	СертификатОбъект.НомерЧекаПогашения = номер;
	СертификатОбъект.ПодразделениеПредъявления = подразделение;
	СертификатОбъект.Код = "R"+Прав(СертификатОбъект.Код,12);
	СертификатОбъект.Комментарий = "Сертификат был возвращен";

					//крохин конец 20.05.2021
					
					
					//нечаева 26,04,16++
					//сбросим параметры,на всякий случай, при возврате подаренного чертификата из чека
					Если строкаТЧ.Всего = 0 Тогда
						сертификатОбъект.МаксимальныйПроцентОтоваривания = 0;
						сертификатОбъект.ОплатаНеБолее30Процентов = ложь;
					КонецЕсли;
					//нечаева 26,04,16---
					
					
				КонецЕсли;
				
				СертификатОбъект.Записать();				
			КонецЕсли;			
		КонецЕсли;	
	КонецЦикла;
	
	Попытка
		Для Каждого СтрокаТЧ Из ПодарочныеСертификаты Цикл
			Если НЕ СтрокаТЧ.Сертификат.Пустая() Тогда
				СертификатОбъект							= СтрокаТЧ.Сертификат.ПолучитьОбъект();				
				Если СертификатОбъект.Использован И СертификатОбъект.НомерЧекаПогашения<>Номер Тогда
					Ответ=Ответ+?(ПустаяСтрока(Ответ),"",Символы.ПС)+"Сертификат: "+СертификатОбъект+" уже использован !";				
				Иначе
					СертификатОбъект.Использован				= Истина;
					СертификатОбъект.ПодразделениеПредъявления	= Склад.Подразделение;			
					СертификатОбъект.ДатаПогашения				= Дата;
					СертификатОбъект.НомерЧекаПогашения			= Номер;
					//крохин начало
					//меняем код сертификата, чтобы можно было его использовать повторно
					//код сертификата устанавливается сразу, при эмиссии
					//СертификатОбъект.КодСертификата = СертификатОбъект.Код;
					СертификатОбъект.Код = СтрЗаменить(Номер,"-","") + Прав(Формат(Дата,"ДФ=dd.MM.yy"),2)+Формат(СтрокаТЧ.НомерСтроки,"ЧЦ=2; ЧДЦ=0; ЧВН=");
					//крохин конец
					
					СертификатОбъект.Записать();
				КонецЕсли;				
			КонецЕсли;	
		КонецЦикла;	
		//крохин начало 18.05.2011
		//активируем сертификаты-подарки
		Для Каждого строкаТЧ Из Товары Цикл
			Если строкаТЧ.Сертификат <> Справочники.ПодарочныеСертификаты.ПустаяСсылка() И 	строкаТЧ.Всего = 0 Тогда
				сертификатОбъект = строкаТЧ.Сертификат.ПолучитьОбъект();
				сертификатОбъект.Подарок = Истина;
				сертификатОбъект.ДатаВыдачи = Дата;
				//крохин начало
				//для сертификатов-подарков из чека зафиксируем номер чека выдачи
				//сертификатОбъект.НомерЧекаВыдачи = "Подарок";
				сертификатОбъект.НомерЧекаВыдачи = Номер;
				//крохин конец
				Если Акция <> Неопределено Тогда
					СертификатОбъект.ПодразделениеЗатрат = Акция.ПодразделениеЗатрат;
				иначе
					сертификатОбъект.ПодразделениеЗатрат = Подразделение;
				КонецЕсли;
				сертификатОбъект.Акция = Акция;
				//крохин начало 21.12.2013
				//опять появились дата приема
				АкцияСертификатыИзЧека=АкцияПлПодарки();
				Если НЕ АкцияСертификатыИзЧека.Пустая() Тогда
					сертификатОбъект.Акция = АкцияСертификатыИзЧека;	
					сертификатОбъект.НачалоДействия					= АкцияСертификатыИзЧека.ДатаНачалаПродаж;
					сертификатОбъект.ОкончаниеДействия 				= АкцияСертификатыИзЧека.ДатаОкончанияПродаж;
										
					// нечаева пластиковые сертификаты если все верно проставляем в сертификатах галку 30% оплаты, если нужно  26,04,16+++
					// нечаева 25,08,16+++
					Если АкцияСертификатыИзЧека.ОплатаВыдСертНеБолее30Процентов=истина Тогда
						
						сертификатОбъект.МаксимальныйПроцентОтоваривания = АкцияСертификатыИзЧека.МаксимальныйПроцентОтоваривания;
						сертификатОбъект.ОплатаНеБолее30Процентов = АкцияСертификатыИзЧека.ОплатаВыдСертНеБолее30Процентов;
						
					КонецЕсли;	
					// нечаева 25,08,16---
					// нечаева   26,04,16---
					
							
				КонецЕсли;
				//крохин конец 21.12.2013
				сертификатОбъект.Записать();
			КонецЕсли;
		КонецЦикла;
		//крохин конец
		//крохин конец 18.05.2011
		
		
	Исключение
		Ответ="Ошибка записи информации о продаже сертификатов ! "+ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Ответ;
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если ЭтоНовый() И Организация.Пустая() И НЕ Склад.Пустая() И НЕ Склад.Организация.Пустая() Тогда
		Организация=Склад.Организация;	
	КонецЕсли;
	
	РасчетСуммОплатСертификатами();
	
	ЕстьИзменения		=Модифицированность();
	
	Если НЕ ОбменДанными.Загрузка Тогда		
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);
	КонецЕсли;	
	
	//Кухарь 19.02.16 начало
	//Для корректного вывода суммы оплаты баллами.
	//Кухарь 02.03.16 начало
	//проверять будем только при пробитии
	если РежимЗаписи=РежимЗаписиДокумента.Проведение и ЧекПробитНаККМ тогда
	//Кухарь 02.03.16 конец
	отбор=новый Структура;
	отбор.Вставить("Вид",Перечисления.ВидТранзакцииБН.Списание);
	отбор.Вставить("ВидОплаты",Перечисления.ВалютаТранзакцииБН.Баллы);
	отбор.Вставить("Отменена",ложь);
	ТрОплаты=ТранзакцииБН.найтистроки(отбор);
	если ТрОплаты.Количество()>1 тогда
		отказ=Истина;
	иначеесли ТрОплаты.Количество()>0 тогда
		СуммаОплатыБаллами = ТрОплаты.получить(0).СуммаТранзакции;
	иначе		
		СуммаОплатыБаллами=0;
	КонецЕсли;
	//Кухарь 02.03.16 начало
	//проверять будем только при пробитии
	КонецЕсли;
	//Кухарь 02.03.16 конец
	//Кухарь 19.02.16 конец
	
	
	Если Отказ Тогда Возврат КонецЕсли;	
	
	Если НЕ ЕстьИзменения Тогда Возврат КонецЕсли;	
	
	СуммаДокумента				= Товары.Итог("Всего");	
	ОбъемДокумента				= Товары.Итог("Объем");
	КоличествоДокумента 		= Товары.Итог("Количество");
	ГруппыТоваров				= ГруппыТоваровДокумента(ЭтотОбъект);	
	
КонецПроцедуры

Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам)
	Для Каждого НаборДвижений Из ДвиженияПоРегистрам Цикл
		ИмяРегистра		=НаборДвижений.Ключ;
		ТаблицаДвижения =НаборДвижений.Значение;
		
		Если Движения.Найти(ИмяРегистра)=Неопределено Тогда Возврат  КонецЕсли; 
		
		НаборЗаписей=Движения[ИмяРегистра];		
		НаборЗаписей.Очистить();
		
		Для Каждого Движение Из ТаблицаДвижения Цикл
			Запись=НаборЗаписей.Добавить();	
			ЗаполнитьЗначенияСвойств(Запись,Движение);	
			
			Запись.Регистратор=Ссылка;
		КонецЦикла;	
	КонецЦикла;	
КонецПроцедуры 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если НЕ ПустаяСтрока(ДК)   Тогда
		Если Дк.ЧленКлуба ИЛИ Дк.ЧленКлубаГП Тогда
			Отказ = Ложь;
			Если Отказ Тогда
				Возврат;
			КонецЕсли;
		Конецесли;
	КонецЕсли;
	Если Акция = Справочники.Акции.НайтиПоКоду("SNL-00042") Тогда;
		ДКобъект = дк.ПолучитьОбъект();
	
		Если Дата>='20140101' Тогда
			// чтобы записать только 1 раз
			Запрос=Новый запрос;
			Запрос.Текст="ВЫБРАТЬ
			             |	ДисконтныеКартыИспользованныеДР.Год КАК Год
			             |ИЗ
			             |	Справочник.ДисконтныеКарты.ИспользованныеДР КАК ДисконтныеКартыИспользованныеДР
			             |ГДЕ
			             |	ДисконтныеКартыИспользованныеДР.Ссылка = &ТекДК
			             |	И НачалоПериода(ДисконтныеКартыИспользованныеДР.Год,Год) = &ТекГОд";
			Запрос.УстановитьПараметр("ТекДК",ДК);
			Запрос.УстановитьПараметр("ТекГод",НачалоГода(Дата));
			Рез=Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() Тогда
				ДРПокупателяИспользован = истина;
			Иначе
				СтрДР=ДКобъект.ИспользованныеДР.Добавить();
				СтрДр.Год = Дата;
			КонецЕсли;
       Иначе
								
		 	ДКобъект.ИспользованДР2010 = Истина;
		КонецЕсли;
		// Нечаева 16,12,13 ---
		
		ДКобъект.Записать();
	Конецесли;
	//крохин начало 18.05.2011
	//по некоторым акциям меняем скидку
	Если НЕ ДК.Пустая() Тогда
		ДКобъект = дк.ПолучитьОбъект();
			
		Если Акция.СкидкаДК > ДКОбъект.Скидка И Акция.СкидкаДК > ДКОбъект.СкидкаСтарая Тогда
			ДКОбъект.СкидкаСтарая = Акция.СкидкаДК;
			ДКобъект.Записать();
			Сообщить("Изменена скидка ДК с " + МАКС(ДКОбъект.Скидка,ДКобъект.СкидкаСтарая) + "% на "  +Акция.СкидкаДК+ "%");
		КонецЕсли;
		//по некоторым акциям меняем скидку от суммы чека
		Если Акция.ИзмененияСкидкиДК.Количество() > 0 Тогда
			ИзменениеСкидки = 0;
			Для Каждого СтрокаИзмененийСкидкиДК ИЗ Акция.ИзмененияСкидкиДК Цикл
				Если Товары.Итог("Всего") >= СтрокаИзмененийСкидкиДК.СуммаЧека Тогда
					ИзменениеСкидки = Макс(ИзменениеСкидки,СтрокаИзмененийСкидкиДК.СкидкаДК);	
				КонецЕсли;
			КонецЦикла;
			Если ИзменениеСкидки > ДКОбъект.Скидка И ИзменениеСкидки > ДКОбъект.СкидкаСтарая Тогда
				ДКОбъект.СкидкаСтарая = ИзменениеСкидки;
				Сообщить("Изменена скидка ДК с " + МАКС(ДКОбъект.Скидка,ДКобъект.СкидкаСтарая) + "% на "  +ИзменениеСкидки+ "%");
				ДКобъект.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	ДвиженияПоРегистрам=Неопределено;
	
	РезультатПроведения=ПроведениеПоРегистрамОстатков(Ссылка,ДвиженияПоРегистрам);	
	Результат=РезультатПроведения["Результат"];
	
	Если Результат<0 Тогда		
		Отказ=Ложь;		
	КонецЕсли; 
	
	Если НЕ Отказ Тогда
		ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам);
		Ошибки=ПроверитьСертификаты();
		Если НЕ ПустаяСтрока(Ошибки) Тогда
			СообщитьОбОшибке(Ошибки);
			Отказ=Истина;
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	Если Основание=Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;
	
	
	ВидОснования	= Основание.Метаданные().Имя;
	
	
	ВариантЗаполнения="Целиком";
	
	ДокОснование	= Основание;
	
	ИБ				= Основание.ИБ;
	
	Контрагент 		= ПолучитьРеквизитОбъекта(ДокОснование,"Контрагент");
	
	БанковскийСчет	= ПолучитьРеквизитОбъекта(ДокОснование,"БанковскийСчет");		
	ОтсрочкаПлатежа = ПолучитьРеквизитОбъекта(ДокОснование,"ОтсрочкаПлатежа");			
	ВидОплаты		= ПолучитьРеквизитОбъекта(ДокОснование,"ВидОплаты");		
	
	Организация		= ПолучитьРеквизитОбъекта(ДокОснование,"Организация");			
	//крохин начало
	//склад по умолчанию - всегда из подразделения
	//Склад			= ?(ВидОснования="Перемещение",ДокОснование.СкладПолучатель,ПолучитьРеквизитОбъекта(ДокОснование,"Склад"));
	Склад =  ПолучитьЗначениеПоУмолчанию("ОсновнойСклад");
	//крохин конец
	
	
	ГруппыТоваров	= ПолучитьРеквизитОбъекта(ДокОснование,"ГруппыТоваров");
	
	ТипЦен			= ПолучитьРеквизитОбъекта(ДокОснование,"ТипЦен");
	ТипСкидок		= ПолучитьРеквизитОбъекта(ДокОснование,"ТипСкидок");
	Скидка			= ПолучитьРеквизитОбъекта(ДокОснование,"Скидка");
	
	Комментарий		= Комментарий+ДокОснование.Метаданные()+" № " + ДокОснование.Номер + " от " + Формат(ДокОснование.Дата,"ДФ=dd.MM.yy");
	
	//крохин начало	
	//Подразделение=ПолучитьПериодическийРеквизит(Контрагент.Менеджер,"Подразделение");
	Если Контрагент.Менеджер <> Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
		//крохин начало 19.05.2011
		//меняем схему выбора менеджера на ту, что в РНК
		//Если  Склад.Подразделение.Менеджер <> Справочники.ФизическиеЛица.ПустаяСсылка() И Контрагент.Менеджер.Подразделение.Родитель <> ПараметрыСеанса.ЭтотУзел.Подразделение.Родитель Тогда
		//	Если Контрагент.МенеджерТЦ <> Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
		//		Менеджер = Контрагент.МенеджерТЦ;
		//	Иначе
		//		Менеджер = Склад.Подразделение.Менеджер;
		//	КонецЕсли;
		//	Если Склад.Подразделение.Менеджер.Родитель <> Контрагент.Менеджер.Родитель И Склад.Подразделение.Менеджер.Родитель <> Контрагент.МенеджерТЦ.Родитель Тогда
		//		Сообщить("Не совпадают менеджеры контрагента и подразделения!");	
		//	КонецЕсли;		
		//иначе
		//	Менеджер = Контрагент.Менеджер;
		//Конецесли;
		
		//крохин начало 23.05.2011
		//у менеджера по умолчанию может быть другое подразделение, Вэймарт 
		//Если Контрагент.Менеджер.Подразделение = ПараметрыСеанса.ЭтотУзел.Подразделение Тогда
		//	Менеджер = Контрагент.Менеджер;
		//ИначеЕсли Контрагент.МенеджерТЦ.Подразделение = ПараметрыСеанса.ЭтотУзел.Подразделение Тогда
		//	Менеджер = Контрагент.МенеджерТЦ;
		//Иначе
		//	Менеджер = ПараметрыСеанса.ЭтотУзел.Подразделение.Менеджер;	
		//Конецесли;
		//крохин начало 17.09.2013
	//менеджерТЦ не используется
		//Если Контрагент.Менеджер.Подразделение = ПараметрыСеанса.ЭтотУзел.Подразделение ИЛИ Контрагент.Менеджер.Подразделение = ПараметрыСеанса.ЭтотУзел.Подразделение.Менеджер.Подразделение Тогда
		//	Менеджер = Контрагент.Менеджер;
		//ИначеЕсли Контрагент.МенеджерТЦ.Подразделение = ПараметрыСеанса.ЭтотУзел.Подразделение ИЛИ Контрагент.МенеджерТЦ.Подразделение = ПараметрыСеанса.ЭтотУзел.Подразделение.Менеджер.Подразделение Тогда
		//	Менеджер = Контрагент.МенеджерТЦ;
		//Иначе
		//	Менеджер = ПараметрыСеанса.ЭтотУзел.Подразделение.Менеджер;	
		//Конецесли;
		Менеджер = Контрагент.Менеджер;
		//крохин конец 17.09.2013
		//крохин конец 23.05.2011
		
			//крохин начало 17.09.2013
	//менеджерТЦ не используется
		//Если Менеджер <> Контрагент.Менеджер И Менеджер <> Контрагент.МенеджерТЦ Тогда
		//	Сообщить("Не совпадают менеджеры контрагента и подразделения!");	
		//КонецЕсли;	
				//крохин конец 17.09.2013

		//крохин конец 19.05.2011
	иначе
		Менеджер = Справочники.ФизическиеЛица.ПустаяСсылка();
	КонецЕсли;
	Если Менеджер <> Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
		Подразделение = Менеджер.Подразделение;
	Иначе
		Подразделение = Склад.подразделение;
	КонецЕсли;
	//крохин начало
	//всех оптовых клиентов Вэймарта записываем на ОптВэймарт
	Если Контрагент.Родитель <> ПараметрыСеанса.ЭтотУзел.Подразделение.ЧастноеЛицо.Родитель Тогда
		Подразделение = ПараметрыСеанса.ЭтотУзел.Подразделение.Менеджер.Подразделение;
	КонецЕсли;
	//крохин конец
	//крохин конец
	
	//Мессерле 12.07.11
	 //было 
	//Если Контрагент.Родитель <> ПараметрыСеанса.ЭтотУзел.Подразделение.ЧастноеЛицо.Родитель И Контрагент.Ведущий <> Справочники.Контрагенты.НайтиПоКоду("SMN-1118") Тогда
	//	Сообщить("Контрагент: """+Контрагент+""" запрещен к использованию в чеке! Сделайте РНК и ПКО",СтатусСообщения.Важное);			
	//	
	//	Контрагент	=Справочники.Контрагенты.ПустаяСсылка();
	//	ДК			=Справочники.ДисконтныеКарты.ПустаяСсылка();
	//	
	//КонецЕсли;
	//Мессерле 12.07.11
	//нечаева 19,01,15 +++ закрыла вывод сообщения для франчей, и у них прописывается не сотрудник, а просто ЧЛ. ????
	Если НЕ ПараметрыСеанса.ЭтотУзел.Подразделение.ВидПодразделения = перечисления.ВидыПодразделений.Франчайзинг Тогда 
		Если Контрагент.Родитель <> ПараметрыСеанса.ЭтотУзел.Подразделение.ЧастноеЛицо.Родитель И Контрагент.Ведущий <> Справочники.Контрагенты.НайтиПоКоду("SMN-1118") Тогда
			Сообщить("Контрагент: """+Контрагент+""" запрещен к использованию в чеке! Сделайте РНК и ПКО",СтатусСообщения.Важное);			
			
			Контрагент	=Справочники.Контрагенты.ПустаяСсылка();
			ДК			=Справочники.ДисконтныеКарты.ПустаяСсылка();
			
		КонецЕсли;
	
	конецЕсли;
	//нечаева 19,01,15 +++
    
	//крохин начало 25.07.2011
	//установим ДК из чека-основания
	Если ВидОснования = "Чек" Тогда
		ДК = Основание.ДК;
	КонецЕсли;
	//крохин конец 25.07.2011
	
	
	Для Каждого исхСтрокаТЧ Из ДокОснование.Товары Цикл
		Если исхСтрокаТЧ.Количество=0 Тогда Продолжить КонецЕсли;
		
		СтрокаТЧ=Товары.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,исхСтрокаТЧ);
		//нечаева 02,08,13++
		Если НЕ ВидОснования = "Чек" Тогда
			РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект);	
		иначе
			// чек возвратный. цены берем из чека, по каким купили
			// для акции по блочкам не пересчитываем цены
			Если СтрокаТЧ.Акция.КолВБлочке= 0 Тогда
				РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект);
			КонецЕсли;
			//РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект);		
		КонецЕсли;
		//нечаева 02,08,13 ---
		
	КонецЦикла;	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Автор			= Неопределено;
	ЧекПробитНаККМ	= Ложь;
	Кратко			= Ложь;
	СуммаОплаты		= 0;
	
	ПодарочныеСертификаты.Очистить();
КонецПроцедуры

///ПЕЧАТЬ ЧЕКА НА ФР
Функция ПробитьПогашениеСертификатов(СтрокаФР)	
	СписокТоваров=Новый ТаблицаЗначений;
	СписокТоваров.Колонки.Добавить("Номенклатура");
	СписокТоваров.Колонки.Добавить("Количество",	ПолучитьОписаниеТиповЧисла(19,2));
	СписокТоваров.Колонки.Добавить("Цена",			ПолучитьОписаниеТиповЧисла(19,2));
	СписокТоваров.Колонки.Добавить("Скидка",		ПолучитьОписаниеТиповЧисла(19,2));
	СписокТоваров.Колонки.Добавить("СтавкаНДС");
	СписокТоваров.Колонки.Добавить("Секция");	
	СписокТоваров.Колонки.Добавить("СуммаСкидки",	ПолучитьОписаниеТиповЧисла(19,2));
	
	СуммаСертификатов=0;
	
	Для Каждого СтрокаСертификатов Из ПодарочныеСертификаты Цикл
		Если НЕ СтрокаСертификатов.Сертификат.Пустая() Тогда
			
			//крохин начало 30.01.2017
			//с 01.02.2017г пробиваем сумму оплаты, а не номинал
			//СуммаСертификатов=СуммаСертификатов+СтрокаСертификатов.Номинал;
			СуммаСертификатов=СуммаСертификатов+СтрокаСертификатов.СуммаОплатыСертификатами;
			//крохин конец 30.01.2017
			
			ЭлементСписка = СписокТоваров.Добавить();
			
			ЭлементСписка.Номенклатура	= "Серт. №: "+СтрокаСертификатов.Сертификат+", номинал: "+СтрокаСертификатов.Номинал;
			ЭлементСписка.Количество	= 1;
			//крохин начало 30.01.2017
			//с 01.02.2017г пробиваем сумму оплаты, а не номинал
			//ЭлементСписка.Цена			= СтрокаСертификатов.Номинал;
			ЭлементСписка.Цена			= СтрокаСертификатов.СуммаОплатыСертификатами;
			//крохин конец 30.01.2017
			ЭлементСписка.Скидка		= 0;	
			//крохин начало 21.12.2018
			//изменение ставки НДС
			//ЭлементСписка.СтавкаНДС		= Перечисления.СтавкиНДС.НДС18;
			//крохин начало 21.01.2018
			//ошибка
		//	Если Дата >= '20190101' Тогда
		//	ЭлементСписка.СтавкаНДС		= Перечисления.СтавкиНДС.НДС20;	
		//ИначеЕсли ПараметрыСеанса.ЭтотУзел.Подразделение.НулеваяСтавкаНДСвЧеке Тогда
		//	ЭлементСписка.СтавкаНДС		= Перечисления.СтавкиНДС.БезНДС;
		    Если Дата >= '20190101' Тогда
				Если ПараметрыСеанса.ЭтотУзел.Подразделение.НулеваяСтавкаНДСвЧеке Тогда
				ЭлементСписка.СтавкаНДС		= Перечисления.СтавкиНДС.БезНДС;
					Иначе
			    ЭлементСписка.СтавкаНДС		= Перечисления.СтавкиНДС.НДС20;	
		        КонецЕсли;
			//крохин конец 21.01.2018
			Иначе
			ЭлементСписка.СтавкаНДС		= Перечисления.СтавкиНДС.НДС18;	
			КонецЕсли; 
			//крохин конец 21.12.2018
			ЭлементСписка.Секция		= 2;			
		КонецЕсли;	
	КонецЦикла;	
	
	Если СуммаСертификатов=0 Тогда Возврат "" КонецЕсли; 
	
	Параметры  = Новый Структура();
	
	Параметры.Вставить("СписокТоваров",  СписокТоваров);
	Параметры.Вставить("НомерСекции",    НомерСекции);
	Параметры.Вставить("ЧекНаВозврат",   Истина);
	Параметры.Вставить("ПолученоНАЛ",    0);
	Параметры.Вставить("ПолученоБН",	 0);
	Параметры.Вставить("ПолученоСер1", 	 0);
	Параметры.Вставить("ПолученоСер2", 	 СуммаСертификатов);	
	
	Параметры.Вставить("НДС",            18);
	
	Ответ="";
	глТорговоеОборудование.ПечататьЧек(СтрокаФР, Параметры, Ответ);	
	
	//задержка
	//крохин начало
	//Дата0=ТекущаяДата();
	//Пока (ТекущаяДата()-Дата0)<2 Цикл			
	//КонецЦикла; 	//задержка
	Дата0=ТекущаяДата();
	Задержка = Макс(ПодарочныеСертификаты.Количество(),5);
	Пока (ТекущаяДата()-Дата0)< Задержка Цикл			
		#Если Клиент Тогда
			Состояние("задержка печати чека. Осталось "+(Задержка -(ТекущаяДата()-Дата0))+ " секунд");		 
		#КонецЕсли		
	КонецЦикла;
	//крохин конец
	
	Возврат Ответ;	
КонецФункции //ПробитьВозвратСертификатов()

Функция ПечатьЧекаНаФР(Модель, НомерЛУ, КассаККМ)
	Ответ       = "";		
	СтрокаФР  	= глТорговоеОборудование.млФР.Найти(КассаККМ, "КассаККМ");		
	НомерСекции	= 1;
	
	//крохин начало 20.05.2021
	//сертификаты больше не пробиваются отдельным чеком
	//Ответ		= ПробитьПогашениеСертификатов(СтрокаФР);
	//крохин конец 20.05.2021
	Если НЕ ПустаяСтрока(Ответ) Тогда
		Возврат Ответ;	
	КонецЕсли;
	
	Если ВидОплаты=Перечисления.ВидыОплаты.НАЛ Тогда
		ПолученоНал	= СуммаОплаты;
		ПолученоБН  = 0;		
	Иначе
		ПолученоНал	= 0;
		ПолученоБН  = СуммаОплаты;		
	КонецЕсли;	
	
	ПолученоСер1	= 0;
	ПолученоСер2	= 0;
	Для Каждого СтрокаСерт Из ПодарочныеСертификаты Цикл
		Если СтрокаСерт.Сертификат.Пустая() Тогда
			ПолученоСер1		= ПолученоСер1+СтрокаСерт.СуммаОплатыСертификатами;		
		Иначе
			ПолученоСер2		= ПолученоСер2+СтрокаСерт.СуммаОплатыСертификатами;					
		КонецЕсли;		
	КонецЦикла;
	
	//кухарь баллы
	если КодОперации=Перечисления.КодыОперацийОстатки.Реализация тогда
		отбор=новый Структура;
		отбор.Вставить("Вид",Перечисления.ВидТранзакцииБН.Списание);
		отбор.Вставить("ВидОплаты",Перечисления.ВалютаТранзакцииБН.Баллы);
		отбор.Вставить("Отменена",ложь);
		ТрОплаты=ТранзакцииБН.найтистроки(отбор);
		если ТрОплаты.Количество()>0 тогда
			ОплатилиБалами = ТрОплаты.получить(0).СуммаТранзакции; 
		иначе
			ОплатилиБалами=0;
		КонецЕсли;
	иначе
		отбор=новый Структура;
		отбор.Вставить("Вид",Перечисления.ВидТранзакцииБН.Списание);
		отбор.Вставить("ВидОплаты",Перечисления.ВалютаТранзакцииБН.Баллы);
		отбор.Вставить("Отменена",ложь);
		ТрОплаты=ДокОснование.ТранзакцииБН.найтистроки(отбор);
		если ТрОплаты.Количество()>0 тогда
			ОплатилиБалами = Окр(СуммаДокумента*(ТрОплаты.получить(0).СуммаТранзакции)/ДокОснование.СуммаДокумента,2);  
		иначе
			ОплатилиБалами=0;
		КонецЕсли;
	КонецЕсли;
	
	ПолученоСер1=ПолученоСер1+ОплатилиБалами;
	//кухарь баллы
	
	// Все строки напечатаны	
	СписокТоваров=Новый ТаблицаЗначений;
	СписокТоваров.Колонки.Добавить("Номенклатура");
	СписокТоваров.Колонки.Добавить("Количество",	ПолучитьОписаниеТиповЧисла(19,2));
	СписокТоваров.Колонки.Добавить("Цена",			ПолучитьОписаниеТиповЧисла(19,2));
	СписокТоваров.Колонки.Добавить("Скидка",		ПолучитьОписаниеТиповЧисла(19,2));
	СписокТоваров.Колонки.Добавить("СтавкаНДС");
	СписокТоваров.Колонки.Добавить("Секция");
	СписокТоваров.Колонки.Добавить("СуммаСкидки",	ПолучитьОписаниеТиповЧисла(19,2));
	//крохин начало 21.03.2017
	//СписокТоваров.Колонки.Добавить("ТипТовара");
	//крохин конец 21.03.2017
	
	//крохин начало 20.05.2021
	СписокТоваров.Колонки.Добавить("ПризнакСпособаРасчета");
    СписокТоваров.Колонки.Добавить("ПризнакПредметаРасчета");
	//крохин конец 20.05.2021
	
	Если Кратко Тогда
		Если СуммаПроданныхСертификатов<>0 Тогда
			Возврат "Не допускается продажа сертификатов в кратких чеках !";		
		КонецЕсли; 
		
		ТЧ		= Товары.Выгрузить();
		ТЧ.Свернуть("СтавкаНДС","Всего");		
		Для Каждого СтрокаТЧ ИЗ ТЧ  Цикл
			ЭлементСписка = СписокТоваров.Добавить();
			
			ЭлементСписка.Номенклатура	= "Получено";
			ЭлементСписка.Количество	= 1;
			ЭлементСписка.Цена			= СтрокаТЧ.Всего;
			ЭлементСписка.Скидка		= 0;			
			ЭлементСписка.СтавкаНДС		= СтрокаТЧ.СтавкаНДС;					
			ЭлементСписка.Секция		= 1;
			//крохин начало 20.05.2021
			ЭлементСписка.ПризнакСпособаРасчета = "ПолныйРасчет";
			ЭлементСписка.ПризнакСпособаРасчета = "Товар";
			//крохин конец 20.05.2021
		КонецЦикла; 
	Иначе
		Для Каждого СтрокаТЧ Из Товары Цикл
			ЭлементСписка = СписокТоваров.Добавить();
			
			Если СтрокаТЧ.Сертификат.Пустая() Тогда
				//крохин начало 15.03.2017
				//для новой кассы печатаем 57 символов
				//ЭлементСписка.Номенклатура	= ""+СтрокаТЧ.Номенклатура.Родитель.ТипТовара+" "+СтрокаТЧ.Номенклатура;
				//ЭлементСписка.Номенклатура	= ""+СтрокаТЧ.Номенклатура.Родитель.ТипТовара+" "+Прав(СтрокаТЧ.Номенклатура,57-1-СтрДлина(СтрокаТЧ.Номенклатура.Родитель.ТипТовара));
				//ЭлементСписка.Номенклатура = Прав(СтрокаТЧ.Номенклатура.Наименование,57);
				//ЭлементСписка.ТипТовара = СтрокаТЧ.Номенклатура.Родитель.ТипТовара;
				ЭлементСписка.Номенклатура =  Прав("" + СтрокаТЧ.Номенклатура.Код + " "+СтрокаТЧ.Номенклатура.Родитель.ТипТовара + " "+ СтрокаТЧ.Номенклатура.Родитель.Брэнд + " "+СтрокаТЧ.Номенклатура.Размер,57);
				//крохин конец 15.03.2017
				
				//крохин начало 20.05.2021

			ЭлементСписка.ПризнакСпособаРасчета = "ПолныйРасчет";
			ЭлементСписка.ПризнакПредметаРасчета = "Товар";

			//крохин конец 20.05.2021

			Иначе
				ЭлементСписка.Номенклатура	= ""+СтрокаТЧ.Номенклатура+" "+СтрокаТЧ.Сертификат.Код;
				//крохин начало 20.05.2021
				ЭлементСписка.ПризнакСпособаРасчета = "Аванс";
			ЭлементСписка.ПризнакПредметаРасчета = "Платеж";
			//крохин конец 20.05.2021

			КонецЕсли; 
			
			ЭлементСписка.Количество	= СтрокаТЧ.Количество;
			//крохин начало 17.03.2017
			//цена без скидки в ФР не передается
			//ЭлементСписка.Цена			= СтрокаТЧ.ЦенаБезСкидки;
			ЭлементСписка.Цена			= СтрокаТЧ.Цена;
			//крохин конец 17.03.2017
			ЭлементСписка.Скидка		= 0;			
			ЭлементСписка.СтавкаНДС		= СтрокаТЧ.СтавкаНДС;
			ЭлементСписка.СуммаСкидки	= СтрокаТЧ.ВсегоБезСкидки-СтрокаТЧ.Всего;
			
			Если СтрокаТЧ.Сертификат.Пустая() Тогда			
				ЭлементСписка.Секция=1;
			Иначе
				ЭлементСписка.Секция=2;
			КонецЕсли; 
		КонецЦикла;
		//крохин начало 20.05.2021
		//пробиваем невыданную сдачу сертификата как внереализационный доход
		//СуммаДохода = 0;
		//Для Каждого СтрокаТЧ Из ПодарочныеСертификаты Цикл
		//СуммаДохода = СуммаДохода + СтрокаТЧ.Номинал - СтрокаТЧ.СуммаОплатыСертификатами;	
		//КонецЦикла;
		//Если СуммаДохода > 0 Тогда
		//	ЭлементСписка = СписокТоваров.Добавить();
		//	ЭлементСписка.Номенклатура	= "Остаток подарочного сертификата";
		//	//крохин начало 20.05.2021
		//	ЭлементСписка.ПризнакСпособаРасчета = "ПолныйРасчет";
		//	ЭлементСписка.ПризнакПредметаРасчета = "ВнереализационныйДоход";
		//	//крохин конец 20.05.2021
		//    ЭлементСписка.Количество = 1;
		//	ЭлементСписка.Цена			= СуммаДохода;
		//	ЭлементСписка.Скидка		= 0;			
		//	Если Подразделение.НулеваяСтавкаНДСвЧеке Тогда
		//	ЭлементСписка.СтавкаНДС		= Перечисления.СтавкиНДС.БезНДС;	
		//		Иначе
		//	ЭлементСписка.СтавкаНДС		= Перечисления.СтавкиНДС.НДС20;
		//	КонецЕсли;
		//	ЭлементСписка.СуммаСкидки	= 0;
		//	ЭлементСписка.Секция=1;
		//КонецЕсли;
		//крохин конец 20.05.2021
	КонецЕсли;	
	
	Параметры  = Новый Структура();
	
	Параметры.Вставить("СписокТоваров",  СписокТоваров);
	Параметры.Вставить("НомерСекции",    НомерСекции);
	Параметры.Вставить("ЧекНаВозврат",   ?(КодОперации=Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя,Истина,Ложь));
	
	Параметры.Вставить("ПолученоНАЛ",    ПолученоНал);
	Параметры.Вставить("ПолученоБН",	 ПолученоБН);
	Параметры.Вставить("ПолученоСер1", 	 ПолученоСер1);
	Параметры.Вставить("ПолученоСер2", 	 ПолученоСер2);	
	
	Параметры.Вставить("НДС",            18);
	
	//крохин начало 16.06.2018
	//уведомления для покупателей
	Если НЕ АнкетаДляРассылкиЭлектронногоЧека.Пустая() Тогда
		Если ТипРассылкиЭлектронногоЧека = Перечисления.ТипыРассылкиЭлектронногоЧека.Телефон Тогда
	Параметры.Вставить("CustomerEmail",АнкетаДляРассылкиЭлектронногоЧека.Телефон);
ИначеЕсли  ТипРассылкиЭлектронногоЧека = Перечисления.ТипыРассылкиЭлектронногоЧека.ЭлектроннаяПочта Тогда
	Параметры.Вставить("CustomerEmail",АнкетаДляРассылкиЭлектронногоЧека.ЭлектроннаяПочта);
	КонецЕсли;
	КонецЕсли;
	//крохин конец 16.06.2018
	
	
	глТорговоеОборудование.ПечататьЧек(СтрокаФР, Параметры, Ответ);	
	
	//крохин начало 20.05.2021
	//сдача с сертификата
	    СуммаСдачи = ПодарочныеСертификаты.Итог("Сдача");
		Если СуммаСдачи > 0 Тогда
		СписокТоваров=Новый ТаблицаЗначений;
	СписокТоваров.Колонки.Добавить("Номенклатура");
	СписокТоваров.Колонки.Добавить("Количество",	ПолучитьОписаниеТиповЧисла(19,2));
	СписокТоваров.Колонки.Добавить("Цена",			ПолучитьОписаниеТиповЧисла(19,2));
	СписокТоваров.Колонки.Добавить("Скидка",		ПолучитьОписаниеТиповЧисла(19,2));
	СписокТоваров.Колонки.Добавить("СтавкаНДС");
	СписокТоваров.Колонки.Добавить("Секция");
	СписокТоваров.Колонки.Добавить("СуммаСкидки",	ПолучитьОписаниеТиповЧисла(19,2));

	СписокТоваров.Колонки.Добавить("ПризнакСпособаРасчета");
    СписокТоваров.Колонки.Добавить("ПризнакПредметаРасчета");
	Для Каждого СтрокаТЧ Из ПодарочныеСертификаты Цикл
		Если СтрокаТЧ.Сдача = 0 Тогда Продолжить; КонецЕсли;
			
			ЭлементСписка = СписокТоваров.Добавить();
			
			ЭлементСписка.Номенклатура	= "Подарочный сертификат "+СтрокаТЧ.Сертификат.КодСертификата;
			ЭлементСписка.ПризнакСпособаРасчета = "Аванс";
			ЭлементСписка.ПризнакПредметаРасчета = "Платеж";

			
			ЭлементСписка.Количество	= 1;

			ЭлементСписка.Цена			= СтрокаТЧ.Сдача;
			ЭлементСписка.Скидка		= 0;			
			ЭлементСписка.СтавкаНДС		= Перечисления.СтавкиНДС.НДС20;
			ЭлементСписка.СуммаСкидки	= 0;
			
			ЭлементСписка.Секция=2;
			
		КонецЦикла;

	
				Параметры  = Новый Структура();
	
	Параметры.Вставить("СписокТоваров",  СписокТоваров);
	Параметры.Вставить("НомерСекции",    НомерСекции);
	Параметры.Вставить("ЧекНаВозврат",   Истина);
	
	Параметры.Вставить("ПолученоНАЛ",    СуммаСдачи);
	Параметры.Вставить("ПолученоБН",	 0);
	Параметры.Вставить("ПолученоСер1", 	 0);
	Параметры.Вставить("ПолученоСер2", 	 0);	
	
	Параметры.Вставить("НДС",            18);

				Если НЕ АнкетаДляРассылкиЭлектронногоЧека.Пустая() Тогда
		Если ТипРассылкиЭлектронногоЧека = Перечисления.ТипыРассылкиЭлектронногоЧека.Телефон Тогда
	Параметры.Вставить("CustomerEmail",АнкетаДляРассылкиЭлектронногоЧека.Телефон);
ИначеЕсли  ТипРассылкиЭлектронногоЧека = Перечисления.ТипыРассылкиЭлектронногоЧека.ЭлектроннаяПочта Тогда
	Параметры.Вставить("CustomerEmail",АнкетаДляРассылкиЭлектронногоЧека.ЭлектроннаяПочта);
	КонецЕсли;
	КонецЕсли;

		глТорговоеОборудование.ПечататьЧек(СтрокаФР, Параметры, Ответ);	
		КонецЕсли;
	//крохин конец 20.05.2021
	
	Если ПустаяСтрока(Ответ) Тогда
		// Чек напечатан, устанавливаем значения реквизитов
		НомерЧекаККМ="";НомерСменыККМ="";		
		
		Параметры.Свойство("НомерЧека",  НомерЧекаККМ);
		Параметры.Свойство("НомерСмены", НомерСменыККМ);		
		
		НомерСменыККМ	= НомерСменыККМ+1;
		ЧекПробитНаККМ 	= Истина;
		// И открываем, в случае необходимости, денежный ящик
		глТорговоеОборудование.ОткрытьДенежныйЯщик(КассаККМ);
	КонецЕсли;
	
	//крохин начало
	//СуммаДенег = СуммаДокумента - ПодарочныеСертификаты.Итог("СуммаОплатыСертификатами");
	//2011 год, сумма денег = сумма документа
	//крохин начало 26.04.2011
	//изменился расчет суммы денег
	//СуммаДенег = СуммаДокумента;
	
	
	//Нечаева по письму Мотковой и Согл. С Тереховой теперь для выдачи серьтификатов учитывается сумма чека, не зависимо, от подароч. серт. хоть весь чек могут ими оплатить.
	// 02,09,2013 +++    нечаева
	// ---- было
	//
	//СуммаОплатыСертификатамиПодарками = 0;
	//Для Каждого СтрокаСертификатов Из ПодарочныеСертификаты Цикл
	//	Если СтрокаСертификатов.Сертификат.ВидСертификата = Справочники.ВидыПодарочныхСертификатов.ЕЕИзЧека2011 Тогда
	//		СуммаОплатыСертификатамиПодарками = СуммаОплатыСертификатамиПодарками + СтрокаСертификатов.СуммаОплатыСертификатами;	
	//	КонецЕсли;
	//КонецЦикла;
	//СуммаДенег = СуммаДокумента - СуммаОплатыСертификатамиПодарками;
	//крохин конец 26.04.2011
	//-------- стало
	СуммаДенег = СуммаДокумента;
	// 02,09,2013 ----    нечаева
	
	
	
	
	//крохин начало 15.11.2012
	//акция теперь - из подразделения
	//Если Акция.ВыдаватьСертификат И СуммаДенег>=Акция.МинимальнаяСуммаПокупки Тогда
	АкцияСертификатыИзЧека = Подразделение.АкцияСертификатыИзЧека;
	//крохин начало 11.03.2013
	//для возвратов акция не используется
	Если КодОперации = Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя Тогда
		АкцияСертификатыИзЧека = Справочники.Акции.ПустаяСсылка();
	КонецЕсли;
	//крохин конец 11.03.2013
	Если НЕ АкцияСертификатыИзЧека.Пустая() И (АкцияСертификатыИзЧека.ДатаНачала>Дата ИЛИ АкцияСертификатыИзЧека.ДатаОкончания<Дата) Тогда
		//	Предупреждение("Дата чека не в интервале действия выбранной акции !");		
		АкцияСертификатыИзЧека=Справочники.Акции.ПустаяСсылка();
	КонецЕсли;
	Если НЕ АкцияСертификатыИзЧека.Пустая() И АкцияСертификатыИзЧека.ПроверятьВремя Тогда	
		ВремяНачала = АкцияСертификатыИзЧека.ВремяНачала - Дата(1,1,1);
		ВремяОкончания =  АкцияСертификатыИзЧека.Времяокончания - Дата(1,1,1);
		ТекущееВремя = ТекущаяДата() - НачалоДня(ТекущаяДата());
		Если ВремяНачала > ТекущееВремя ИЛИ ВремяОкончания < ТекущееВремя Тогда
			//	Предупреждение("Время чека не в интервале действия выбранной акции !");	
			АкцияСертификатыИзЧека=Справочники.Акции.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	//крохин начало 23.04.2013
	//некоторые акции имеют период действия - определенные дни
	Если Не АкцияСертификатыИзЧека.Пустая() И АкцияСертификатыИзЧека.ДатыАктивности.Количество() > 0 Тогда
		ДеньСовпадает = Ложь; 
		Для Каждого СтрокаАкций Из АкцияСертификатыИзЧека.ДатыАктивности Цикл
			Если НачалоДня(Дата) = НачалоДня(СтрокаАкций.Дата) Тогда
				ДеньСовпадает = Истина;
			КонецЕсли;				
		КонецЦикла;
		Если НЕ ДеньСовпадает Тогда
			АкцияСертификатыИзЧека=Справочники.Акции.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	//крохин конец 23.04.2013
	Если Акция.ВыдаватьСертификат Тогда
		АкцияСертификатыИзЧека = Акция;
	КонецЕсли;
	
	Если АкцияСертификатыИзЧека.ТолькоДляЧастногоЛица И Контрагент <> Подразделение.ЧастноеЛицо Тогда
		//	Предупреждение("Выбранная акция используется только при продаже частному лицу");
		АкцияСертификатыИзЧека = Справочники.Акции.ПустаяСсылка();
	КонецЕсли;
	//крохин начало 25.04.2014
	//сертификаты из чека печатаются на сумму товара и платной рекламы, сертификаты не учитываются
	СуммаДенег  = 0;
	Для Каждого СтрокаТЧ из товары Цикл
                Если ПолучитьРеквизитРодителя(СтрокаТЧ.Номенклатура,"ВидНоменклатуры") = Перечисления.ВидыНоменклаутры.Товар или 
				ПолучитьРеквизитРодителя(СтрокаТЧ.Номенклатура,"ВидНоменклатуры") = Перечисления.ВидыНоменклаутры.РекламаПлатная  Тогда
				СуммаДенег = СуммаДенег + СтрокаТЧ.Всего;
			КонецЕсли;
		КонецЦикла;

	//крохин конец 25.04.2014
	
	Если АкцияСертификатыИзЧека.ВыдаватьСертификат И СуммаДенег>=АкцияСертификатыИзЧека.МинимальнаяСуммаПокупки Тогда
		
		
		//крохин конец 15.11.2012
		
		
		
		
		//крохин начало
		//на 2010 год поменялся алгоритм расчета суммы сертификата
		//СуммаСертификата = Цел(СуммаДокумента*Акция.ПроцентСертификата/100);   //2009 год
		//СуммаСертификата = Цел(СуммаДенег*Акция.ПроцентСертификата/10000)*100; //2010 год
		//СуммаСертификата = 500; //2011 год
		//КоличествоСертификатов = Цел(СуммаДенег*Акция.ПроцентСертификата/50000);//2011 год
		СуммаСертификата = 100;                                                    //2012 год
		КоличествоСертификатов = Цел(СуммаДенег/1000);
		//крохин начало 20.04.2012
		//с 23 апреля новая акция - новый алгоритм расчета
		//крохин начало 04.10.2012
		//с 22 октября новая акция- новый алгоритм расчета
		//КоличествоСертификатов = 1;
		//Если СуммаДенег >= 10000 Тогда
		//	КоличествоСертификатов = 20;
		//ИначеЕсли СуммаДенег >= 9000 Тогда
		//	КоличествоСертификатов = 13;
		//ИначеЕсли СуммаДенег >= 8000 Тогда
		//	КоличествоСертификатов = 12;
		//ИначеЕсли СуммаДенег >= 7000 Тогда
		//	КоличествоСертификатов = 11;
		//ИначеЕсли СуммаДенег >= 6000 Тогда
		//	КоличествоСертификатов = 9;
		//ИначеЕсли СуммаДенег >= 5000 Тогда
		//	КоличествоСертификатов = 7;
		//ИначеЕсли СуммаДенег >= 4000 Тогда
		//	КоличествоСертификатов = 6;
		//ИначеЕсли СуммаДенег >= 3000 Тогда
		//	КоличествоСертификатов = 4;
		//ИначеЕсли СуммаДенег >= 2000 Тогда
		//	КоличествоСертификатов = 2;
		//ИначеЕсли СуммаДенег >= 1000 Тогда
		//	КоличествоСертификатов = 1;
		//КонецЕсли;
		КоличествоСертификатов = 1;
		Если СуммаДенег >= 10000 Тогда
			КоличествоСертификатов = 20;
		ИначеЕсли СуммаДенег >= 9000 Тогда
			КоличествоСертификатов = 13;
		ИначеЕсли СуммаДенег >= 8000 Тогда
			КоличествоСертификатов = 12;
		ИначеЕсли СуммаДенег >= 7000 Тогда
			КоличествоСертификатов = 11;
		ИначеЕсли СуммаДенег >= 6000 Тогда
			КоличествоСертификатов = 9;
		ИначеЕсли СуммаДенег >= 5000 Тогда
			КоличествоСертификатов = 7;
		ИначеЕсли СуммаДенег >= 4000 Тогда
			КоличествоСертификатов = 6;
		ИначеЕсли СуммаДенег >= 3000 Тогда
			КоличествоСертификатов = 4;
		ИначеЕсли СуммаДенег >= 2000 Тогда
			КоличествоСертификатов = 2;
			//ИначеЕсли СуммаДенег >= 1000 Тогда
			//	КоличествоСертификатов = 1;
		КонецЕсли;
		
		//крохин конец 04.10.2012
		//крохин конец 20.04.2012
		
		//крохин начало 15.11.2012
		//количество и сертификатов - из ТЧ
		ПараметрыСертификатов = ПолучитьПараметрыСертификатов(АкцияСертификатыИзЧека,СуммаДенег);
		КоличествоСертификатов = ПараметрыСертификатов.КоличествоСертификатов;
		СуммаСертификата = ПараметрыСертификатов.СуммаСертификата;
		
		
		//нечаева 25,04,2016 +++
		ОплатаВыдСертНеБолее30Процентов = ложь;
		МаксимальныйПроцентОтоваривания = 0; // значит 100 % чтобы старые не трогать. Если >0 тогда сравниваем
		Если АкцияСертификатыИзЧека.ОплатаВыдСертНеБолее30Процентов Тогда
			ОплатаВыдСертНеБолее30Процентов = истина;
			МаксимальныйПроцентОтоваривания =  АкцияСертификатыИзЧека.МаксимальныйПроцентОтоваривания; 
		КонецЕсли;
		//нечаева 25,04,2016 ---	
			
			
			
		//крохин конец 15.11.2012
		
		Пока КоличествоСертификатов > 0 Цикл
			//НомерСертификата = Прав(Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy"),2)+Прав(Склад.Подразделение.Код,4)+Прав(Номер,6);
			//НомерСертификата = НомерСертификата + КонтрольныйСимволEAN(НомерСертификата,13);
			//крохин начало 24.08.2012
			//значащих цифр в чеке оказалось 5
			//НомерСертификата = Прав(Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy"),2)+Прав(Склад.Подразделение.Код,4);
			//НомерСертификата = НомерСертификата + Формат(КоличествоСертификатов,"ЧЦ=2; ЧДЦ=0; ЧВН=")+Прав(Номер,4);
			НомерСертификата = Прав(Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy"),1)+Прав(Склад.Подразделение.Код,4);
			НомерСертификата = НомерСертификата + Формат(КоличествоСертификатов,"ЧЦ=2; ЧДЦ=0; ЧВН=")+Прав(Номер,5);
			//крохин конец 24.08.2012
			НомерСертификата = НомерСертификата + КонтрольныйСимволEAN(НомерСертификата,13);
			
			
			//крохин конец
			
			
			Параметры.Вставить("СуммаСертификата",СуммаСертификата);
			//крохин начало 15.11.2012
			//акция-  из подразделения
			//Параметры.Вставить("ДатаНачалаПродаж",Формат(Акция.ДатаНачалаПродаж,"ДФ=dd.MM.yyyy"));
			//Параметры.Вставить("ДатаОкончанияПродаж",Формат(Акция.ДатаОкончанияПродаж,"ДФ=dd.MM.yyyy"));
			//Параметры.Вставить("НомерСертификата",НомерСертификата);//Прав(Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy"),2)+Прав(Склад.Подразделение.Код,4)+Прав(Номер,6));
			//Параметры.Вставить("МинимальнаяСумма",Акция.МинимальнаяСуммаОплаты);
			Параметры.Вставить("ДатаНачалаПродаж",Формат(АкцияСертификатыИзЧека.ДатаНачалаПродаж,"ДФ=dd.MM.yyyy"));
			Параметры.Вставить("ДатаОкончанияПродаж",Формат(АкцияСертификатыИзЧека.ДатаОкончанияПродаж,"ДФ=dd.MM.yyyy"));
			Параметры.Вставить("НомерСертификата",НомерСертификата);//Прав(Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy"),2)+Прав(Склад.Подразделение.Код,4)+Прав(Номер,6));
			Параметры.Вставить("МинимальнаяСумма",АкцияСертификатыИзЧека.МинимальнаяСуммаОплаты);
			
			
			//нечаева 25,04,2016 +++
			Параметры.Вставить("ОплатаНеБолее30Процентов",ОплатаВыдСертНеБолее30Процентов);
			Параметры.Вставить("МаксимальныйПроцентОтоваривания",МаксимальныйПроцентОтоваривания); 
			//нечаева 25,04,2016 ----
						
			//крохин конец 15.11.2012
			глТорговоеОборудование.ПечататьСертификатЕЕЭ(СтрокаФР, Параметры, Ответ);	
			Если ПустаяСтрока(Ответ) Тогда
				
				// нечаева +++ 23,08  если сбой чтобы не выходила ошибка и не пытался перезаписывать сертификат. он уже есть
				НовыйСертификат=Справочники.ПодарочныеСертификаты.ПустаяСсылка();
				Запрос= Новый Запрос;
				Запрос.Текст="ВЫБРАТЬ
				             |	ПодарочныеСертификаты.Код,
				             |	ПодарочныеСертификаты.Ссылка
				             |ИЗ
				             |	Справочник.ПодарочныеСертификаты КАК ПодарочныеСертификаты
				             |ГДЕ
				             |	ПодарочныеСертификаты.Код = &ТекКод";
				Запрос.УстановитьПараметр("ТекКод",НомерСертификата);
				Рез=Запрос.Выполнить().Выбрать();
				Если Рез.Следующий() Тогда
					 КоличествоСертификатов = КоличествоСертификатов - 1;
					 продолжить;
				КонецЕсли;	
				// нечаева --- 23,08
								
				
				НовыйСертификат = Справочники.ПодарочныеСертификаты.СоздатьЭлемент();
				
				НовыйСертификат.Владелец		= Справочники.Номенклатура.НайтиПоКоду("SNL-143459");
				НовыйСертификат.ВидСертификата					= Справочники.ВидыПодарочныхСертификатов.ЕЕИзЧека2011;
				//крохин начало 15.11.2012
				//акция-  из подразделения
				//НовыйСертификат.Акция							= Акция;
				НовыйСертификат.Акция							= АкцияСертификатыИзЧека;
				//крохин конец 15.11.2012
				НовыйСертификат.ДатаВыдачи						= ТекущаяДата();
				НовыйСертификат.Код								= НомерСертификата;
				НовыйСертификат.КодСертификата					= НомерСертификата;
				//крохин начало 15.11.2012
				//акция-  из подразделения
				//НовыйСертификат.НачалоДействия					= Акция.ДатаНачалаПродаж;
				НовыйСертификат.НачалоДействия					= АкцияСертификатыИзЧека.ДатаНачалаПродаж;
				//крохин конец 15.11.2012
				НовыйСертификат.НомерЧекаВыдачи					= Номер;
				НовыйСертификат.Номинал							= СуммаСертификата;
				//крохин начало 15.11.2012
				//акция-  из подразделения
				//НовыйСертификат.ОкончаниеДействия 				= Акция.ДатаОкончанияПродаж;
				НовыйСертификат.ОкончаниеДействия 				= АкцияСертификатыИзЧека.ДатаОкончанияПродаж;
				//крохин конец 15.11.2012
				НовыйСертификат.Подарок							= Истина;
				НовыйСертификат.ПодразделениеВыдачи				= Склад.Подразделение;
				НовыйСертификат.СрокДействия					= 180;
				//крохин начало 15.11.2012
				//акция-  из подразделения
				//НовыйСертификат.МинимальнаяСуммаЧекаПогашения 	= Акция.МинимальнаяСуммаОплаты;
				НовыйСертификат.МинимальнаяСуммаЧекаПогашения 	= АкцияСертификатыИзЧека.МинимальнаяСуммаОплаты;
				//нечаева 25,08,16+++
				НовыйСертификат.ОплатаНеБолее30Процентов = ОплатаВыдСертНеБолее30Процентов;
				//нечаева 25,08,16---
				НовыйСертификат.МаксимальныйПроцентОтоваривания = МаксимальныйПроцентОтоваривания;
				
			//нечаева 25,04,2016 +++
			Параметры.Вставить("ОплатаНеБолее30Процентов",ОплатаВыдСертНеБолее30Процентов);
			Параметры.Вставить("МаксимальныйПроцентОтоваривания",МаксимальныйПроцентОтоваривания); 
			//нечаева 25,04,2016 ----

				
				
				
				//крохин конец 15.11.2012
				НовыйСертификат.Записать();
			КонецЕсли;
			//крохин начало 25.04.2011
			//иначе получается бесконечный цикл
			КоличествоСертификатов = КоличествоСертификатов - 1;
			//крохин конец  25.04.2011
		КонецЦикла;
	КонецЕсли;
	//крохин конец
	
	//крохин начало 29.11.2012
	//новая акция
	
	АкцияПечататьТекстНаЧеке= Подразделение.АкцияПечататьТекстНаЧеке;
	Если НЕ АкцияПечататьТекстНаЧеке.Пустая() И (АкцияПечататьТекстНаЧеке.ДатаНачала>Дата ИЛИ АкцияПечататьТекстНаЧеке.ДатаОкончания<Дата) Тогда
		//	Предупреждение("Дата чека не в интервале действия выбранной акции !");		
		АкцияПечататьТекстНаЧеке=Справочники.Акции.ПустаяСсылка();
	КонецЕсли;
	Если НЕ АкцияПечататьТекстНаЧеке.Пустая() И АкцияПечататьТекстНаЧеке.ПроверятьВремя Тогда	
		ВремяНачала = АкцияПечататьТекстНаЧеке.ВремяНачала - Дата(1,1,1);
		ВремяОкончания =  АкцияПечататьТекстНаЧеке.Времяокончания - Дата(1,1,1);
		ТекущееВремя = ТекущаяДата() - НачалоДня(ТекущаяДата());
		Если ВремяНачала > ТекущееВремя ИЛИ ВремяОкончания < ТекущееВремя Тогда
			//	Предупреждение("Время чека не в интервале действия выбранной акции !");	
			АкцияПечататьТекстНаЧеке=Справочники.Акции.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	//крохин начало 07.11.2018
	//печать купонов на скидку
	АкцияПечатьКупонаНаСкидку= Подразделение.АкцияПечатьКупонаНаСкидку;
	
	Если АкцияПечатьКупонаНаСкидку.КупоныНаСкидку.Количество() = 0 Тогда
		АкцияПечатьКупонаНаСкидку = Справочники.Акции.ПустаяСсылка();
	КонецЕсли;
	Если НЕ АкцияПечатьКупонаНаСкидку.Пустая() И (АкцияПечатьКупонаНаСкидку.ДатаНачала>Дата ИЛИ АкцияПечатьКупонаНаСкидку.ДатаОкончания<Дата) Тогда
		//	Предупреждение("Дата чека не в интервале действия выбранной акции !");		
		АкцияПечатьКупонаНаСкидку=Справочники.Акции.ПустаяСсылка();
	КонецЕсли;
	Если НЕ АкцияПечатьКупонаНаСкидку.Пустая() И АкцияПечатьКупонаНаСкидку.ПроверятьВремя Тогда	
		ВремяНачала = АкцияПечатьКупонаНаСкидку.ВремяНачала - Дата(1,1,1);
		ВремяОкончания =  АкцияПечатьКупонаНаСкидку.Времяокончания - Дата(1,1,1);
		ТекущееВремя = ТекущаяДата() - НачалоДня(ТекущаяДата());
		Если ВремяНачала > ТекущееВремя ИЛИ ВремяОкончания < ТекущееВремя Тогда
			//	Предупреждение("Время чека не в интервале действия выбранной акции !");	
			АкцияПечатьКупонаНаСкидку=Справочники.Акции.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	//крохин конец 07.11.2018
	
	//крохин начало 23.04.2013
	//некоторые акции имеют период действия - определенные дни
	Если Не АкцияСертификатыИзЧека.Пустая() И АкцияСертификатыИзЧека.ДатыАктивности.Количество() > 0 Тогда
		ДеньСовпадает = Ложь; 
		Для Каждого СтрокаАкций Из АкцияСертификатыИзЧека.ДатыАктивности Цикл
			Если НачалоДня(Дата) = НачалоДня(СтрокаАкций.Дата) Тогда
				ДеньСовпадает = Истина;
			КонецЕсли;				
		КонецЦикла;
		Если НЕ ДеньСовпадает Тогда
			АкцияСертификатыИзЧека=Справочники.Акции.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	//крохин конец 23.04.2013
	Если Акция.ПечататьТекстНаЧеке Тогда
		АкцияПечататьТекстНаЧеке = Акция;
	КонецЕсли;
	
		
	Если АкцияПечататьТекстНаЧеке.ТолькоДляЧастногоЛица И Контрагент <> Подразделение.ЧастноеЛицо Тогда
		//	Предупреждение("Выбранная акция используется только при продаже частному лицу");
		АкцияПечататьТекстНаЧеке = Справочники.Акции.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ АкцияПечататьТекстНаЧеке.Пустая() Тогда
		Параметры.Вставить("ТекстЧека",ПолучитьТекстЧека());
		
		глТорговоеОборудование.ПечататьТекстНаЧеке(СтрокаФР, Параметры, Ответ);
	КонецЕсли;
	
	//крохин конец 29.11.2012
	
	//крохин начало 07.11.2018
	//Выбор печати купонов вручную
	Если Акция.КупоныНаСкидку.Количество() > 0 Тогда
	АкцияПечатьКупонаНаСкидку = Акция;	
    КонецЕсли;

    Если АкцияПечатьКупонаНаСкидку.ТолькоДляЧастногоЛица И Контрагент <> Подразделение.ЧастноеЛицо Тогда
		//	Предупреждение("Выбранная акция используется только при продаже частному лицу");
		АкцияПечатьКупонаНаСкидку = Справочники.Акции.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ АкцияПечатьКупонаНаСкидку.Пустая() Тогда
		
		ПараметрыКупона = ПолучитьПараметрыКупона(АкцияПечатьКупонаНаСкидку);
		Если ПараметрыКупона <> Неопределено Тогда
		Параметры.Вставить("ПараметрыКупона",ПараметрыКупона);
		
		глТорговоеОборудование.ПечататьКупонНаЧеке(СтрокаФР, Параметры, Ответ);
		КонецЕсли;
	КонецЕсли;


	//крохин конец 07.11.2018

	
	Возврат Ответ;	
КонецФункции

Функция ПолучитьТекстЧека()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТекстДляЧеков.Текст
	|ИЗ
	|	Справочник.ТекстДляЧеков КАК ТекстДляЧеков
	|ГДЕ
	|	ТекстДляЧеков.Активность";
	
	Выборка = запрос.Выполнить().Выбрать();
	
	МаксЗначение = Выборка.Количество();
	Если МаксЗначение = 0 Тогда
		//Возврат "";	
	КонецЕсли;
	
	
	СлучайноеЧисло = ТекущаяДата();
	СлучайноеЧисло = Секунда(СлучайноеЧисло)+Минута(СлучайноеЧисло)*60+Час(СлучайноеЧисло)*60*60;
	
	НомерСтроки =  1 + СлучайноеЧисло - Цел(СлучайноеЧисло/МаксЗначение)*МаксЗначение;
	
	ТекСтрока = 1;
	Пока Выборка.Следующий() Цикл
		Если ТекСтрока = НомерСтроки Тогда
			Возврат Выборка.Текст;
		КонецЕсли;
		ТекСтрока = ТекСтрока + 1;	
	КонецЦикла;
	
	Возврат "Пусть всегда будет солнце!";
	
	
	//Возврат "Пусть всегда будет солнце!";	
КонецФункции

//крохин начало 07.11.2018
//печать купонов
Функция ПолучитьПараметрыКупона(АкцияПечатьКупонаНаСкидку)
      СкидкаПоАкции = 0;
	  ШККупона = "";
Для каждого Текстрока из АкцияПечатьКупонаНаСкидку.КупоныНаСкидку цикл
	Если Текстрока.подразделение <> Подразделение Тогда 
		Продолжить;
	КонецЕсли;
	
		Если СуммаДокумента>=Текстрока.Сумма  тогда
			СкидкаПоАкции= ТекСтрока.скидка;
			ШККупона = Текстрока.ШК;
		конецЕсли;
		
	КонецЦикла;
	Если СкидкаПоАкции > 0 Тогда
		//"^" используется вместо переноса строки
		ТекстКупона = "ВАША ПЕРСОНАЛЬНАЯ СКИДКА^"+СкидкаПоАкции+"%^";
		Если ЗначениеЗаполнено(АкцияПечатьКупонаНаСкидку.ДатаНачалаПродажКупон) Тогда
		ТекстКупона = ТекстКупона + "Срок действия с " +формат(АкцияПечатьКупонаНаСкидку.ДатаНачалаПродажКупон,"ДФ=dd.MM.yyyy") +" по " + Формат(АкцияПечатьКупонаНаСкидку.ДатаОкончанияПродажКупон,"ДФ=dd.MM.yyyy")+"^";	
		КонецЕсли;
        ТекстКупона = ТекстКупона + "Скидка не суммируется с иными скидками и предложениями^";
		ТекстКупона = ТекстКупона + "Воспользоваться предложением вы можете в ТЦ ""Стильпарк"", "+Склад.Адрес;
     ПараметрыКупона = Новый Структура;          
	 
	 ПараметрыКупона.Вставить("ТекстКупона",ТекстКупона);
	 ПараметрыКупона.Вставить("ШККупона",ШККупона);
	 Возврат ПараметрыКупона;
 Иначе
	 Возврат Неопределено;
	 КонецЕсли;
	 
КонецФункции

//крохин конец 07.11.2018
Функция ПровестиИРаспечататьЧек(Ответ, Отказ,ВремяНачалаПечатиЧека = Неопределено) Экспорт
	
	Перем ФискальныйРегистратор;
	Перем Параметры;
	Перем Ошибки;
	
	Ошибки = "";
	Отказ  = Ложь;
	ФР	   = Неопределено;
	//крохин начало
	//поправим очередность проверок
	//Если (СуммаОплаты+СуммаОплатыСертификатами)<Товары.Итог("Всего") Тогда
	//	Ошибки=" - Сумма оплаты меньше суммы чека !";	
	//КонецЕсли; 
	
	//// Попытка провести документ
	//Попытка
	//	Записать(РежимЗаписиДокумента.Проведение);
	//Исключение
	//	Ошибки = " - Не удалось провести документ.";
	//	ЗаписатьВЛог("Ошибки чеков",Ошибки+" "+ОписаниеОшибки(),"Ошибка");		
	//КонецПопытки;
	
	//кухарь баллы 03.07.13 начало
	//Если (СуммаОплаты+СуммаОплатыСертификатами)<Товары.Итог("Всего") Тогдажж			
	если КодОперации=Перечисления.КодыОперацийОстатки.Реализация тогда
		отбор=новый Структура;
		отбор.Вставить("Вид",Перечисления.ВидТранзакцииБН.Списание);
		отбор.Вставить("ВидОплаты",Перечисления.ВалютаТранзакцииБН.Баллы);
		отбор.Вставить("Отменена",ложь);
		ТрОплаты=ТранзакцииБН.найтистроки(отбор);
		если ТрОплаты.Количество()>0 тогда
			ОплатилиБалами = ТрОплаты.получить(0).СуммаТранзакции; 
		иначе
			ОплатилиБалами=0;
		КонецЕсли;
	иначе
		отбор=новый Структура;
		отбор.Вставить("Вид",Перечисления.ВидТранзакцииБН.Списание);
		отбор.Вставить("ВидОплаты",Перечисления.ВалютаТранзакцииБН.Баллы);
		отбор.Вставить("Отменена",ложь);
		ТрОплаты=ДокОснование.ТранзакцииБН.найтистроки(отбор);
		если ТрОплаты.Количество()>0 тогда
			ОплатилиБалами = Окр(СуммаДокумента*(ТрОплаты.получить(0).СуммаТранзакции)/ДокОснование.СуммаДокумента,2); 
		иначе
			ОплатилиБалами=0;
		КонецЕсли;
	КонецЕсли;
	
	Если (СуммаОплаты+СуммаОплатыСертификатами+ОплатилиБалами)<Товары.Итог("Всего") Тогда
		Ошибки=" - Сумма оплаты меньше суммы чека !";	
	КонецЕсли; 
	//кухарь баллы 03.07.13 конец
	// Попытка провести документ
	Если ПустаяСтрока(Ошибки) Тогда
		Попытка
			Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Ошибки = " - Не удалось провести документ.";
			ЗаписатьВЛог("Ошибки чеков",Ошибки+" "+ОписаниеОшибки(),"Ошибка");		
		КонецПопытки;
	КонецЕсли;
	//крохин конец
	
	// Если Документ проведён и не пробит чек
	Если ПустаяСтрока(Ошибки) И (НЕ ЧекПробитНаККМ) Тогда
		
		// Если торговое оборудование подключено
		Если глТорговоеОборудование <> Неопределено Тогда
			ФР = глТорговоеОборудование.млФР.Найти(КассаККМ,"КассаККМ");
			// Есть на чём пробивать 
			Если ФР <> Неопределено Тогда
				
				// Предпринимаем попытку печати чека на ФР
				Параметры = Новый Структура();
				Параметры.Вставить("НомерСекции", НомерСекции);
				Параметры.Вставить("КассаККМ",    КассаККМ);
				
				//крохин начало 20.02.2013
				//время открытия чека
				Если ТекущаяДата() - ВремяНачалаПечатиЧека > 0 Тогда
					ЗаписатьВЛог("ПробитиеЧека","Пользователь: "+ИмяПользователя()+", компьютер: "+ИмяКомпьютера()+" Чек: "+ Номер+" Время: "+(ТекущаяДата() - ВремяНачалаПечатиЧека)+ " сек.","Информация",,,ТекущаяДата() - ВремяНачалаПечатиЧека);
				КонецЕсли;
				//крохин конец 20.02.2013
				
				Ответ     = ПечатьЧекаНаФР(ФР.Модель,ФР.НомерЛУ,КассаККМ);
				
				Если ПустаяСтрока(Ответ) Тогда
					
					// Чек напечатан, пытаемся записать документ с обновлёнными
					// значениями реквизитов
					Попытка
						Записать(РежимЗаписиДокумента.Запись);
						//крохин начало 18.05.2011
						//гасим сертификаты
						Ошибки=ПогаситьВернутьСертификаты();
						//крохин конец 18.05.2011
					Исключение
						Если Не ПустаяСтрока(Ошибки) Тогда
							Ошибки = Ошибки + "
							|";
						КонецЕсли;
						Ошибки = Ошибки + " - Не удалось записать чек с признаком ""ЧекПробитНаККМ"" = Истина.";
						ЗаписатьВЛог("Ошибки чеков",Ошибки+" "+ОписаниеОшибки(),"Ошибка");		
						Отказ  = Истина;
					КонецПопытки;
					
				Иначе
					
					// Чек напечатать не удалось
					Если Не ПустаяСтрока(Ошибки) Тогда
						Ошибки = Ошибки + "
						|";
					КонецЕсли;
					Ошибки = Ошибки + " - Не удалось напечатать чек: " + Ответ;
					//кухарь сообщение об отмене БН платежа 15.05.13 начало
					//если ЭтотОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН тогда
					//	Ошибки=Ошибки+ " возможно стоит сделать отмену платежа";
					//КонецЕсли;
					//кухарь сообщение об отмене БН платежа 15.05.13  конец 
					ЗаписатьВЛог("Ошибки чеков",Ошибки+ " .Номер Чека: "+Номер,"Ошибка");
					
					// Попытка распровести документ
					Попытка
						Записать(РежимЗаписиДокумента.ОтменаПроведения);
					Исключение
						Ошибки = Ошибки + "
						| - Не удалось отменить проведение документа.";
						ЗаписатьВЛог("Ошибки чеков",Ошибки+" "+ОписаниеОшибки(),"Ошибка");		
						Отказ = Истина;
					КонецПопытки;
					
				КонецЕсли; // ПустаяСтрока(Ответ)
			Иначе
				//эта ерунда из-за Лиги в которой нету кассы - удалить в обязательном порядке
				ЧекПробитНаККМ=Истина;
				Записать(РежимЗаписиДокумента.Запись);				
			КонецЕсли; // ФискальныйРегистратор <> Неопределено
		КонецЕсли; // глТорговоеОборудование <> Неопределено
		
	КонецЕсли; // ПустаяСтрока(Ошибки) И (Не ЧекПробитНаККМ)	
	
	Если ФР=Неопределено И КассаККМ.ПодключенФР И ПустаяСтрока(Ошибки) И НЕ ЧекПробитНаККМ Тогда
		Ошибки="К кассе: """+КассаККМ+""" не подключен фискальный регистратор !";		
	КонецЕсли; 
	
	Если ПустаяСтрока(Ошибки) Тогда
		// Успешное завершение операции
		Ответ = "";
		Отказ = Ложь;
		Возврат Истина;
	Иначе
		// Неудачное завершение операции
		Ответ = ?(Отказ,
		"Были обнаружены ошибки, которые могут привести к расхождениям в данных
		|информационной базы и ленты контрольно-кассового аппарата:",
		"Были обнаружены следующие ошибки:") + "
		|" + Ошибки;
		Возврат Ложь;
	КонецЕсли; // ПустаяСтрока(Ошибки)
	
КонецФункции

//крохин начало
Функция ЗаписатьДК()
	ДКОбъект = Дк.ПолучитьОбъект();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДисконтныеКартыЧеки.Сумма КАК Итого
	|ИЗ
	|	Справочник.ДисконтныеКарты.Чеки КАК ДисконтныеКартыЧеки
	|ГДЕ
	|	ДисконтныеКартыЧеки.Ссылка = &ДК
	|	И ДисконтныеКартыЧеки.НомерЧека = &Чек
	|	И ДисконтныеКартыЧеки.ДатаЧека = &ДатаЧека";
	Запрос.УстановитьПараметр("Чек",Ссылка.Номер);
	Запрос.УстановитьПараметр("ДатаЧека",Ссылка.Дата);
	Запрос.УстановитьПараметр("ДК",ДК);
	Выборка = Запрос.Выполнить().Выбрать();
	Если  Выборка.Следующий() Тогда
		Если Выборка.Итого <> СуммаДокумента Тогда
			Сообщить("Изменение суммы чека, пробитого по ДК, невозможно");
			Возврат Истина;
		иначе
			Возврат Ложь;
		Конецесли;
	иначе
		Если КодОперации = Перечисления.КодыОперацийОстатки.Реализация Тогда
			СуммаСкидки = Товары.Итог("ВсегоБезСкидки")-Товары.Итог("Всего");
			
			СтрокаЧековДК = ДКОбъект.Чеки.Добавить();
			//СтрокаЧековДК.Чек = Ссылка;
			СтрокаЧековДК.ДатаЧека = Ссылка.Дата;
			СтрокаЧековДК.НомерЧека = Ссылка.Номер;
			СтрокаЧековДК.Количество = КоличествоДокумента;
			СтрокаЧековДК.Кассир = ПараметрыСеанса.Пользователь;
			СтрокаЧековДК.Подразделение = Склад.Подразделение;
			СтрокаЧековДК.Продавец = Продавец;
			СтрокаЧековДК.ПроцентСкидки = Скидка;
			СтрокаЧековДК.Сумма = СуммаДокумента;
			СтрокаЧековДК.СуммаСкидки =  СуммаСкидки;
		иначе
			СуммаСкидки = Товары.Итог("ВсегоБезСкидки")-Товары.Итог("Всего");
			
			СтрокаЧековДК = ДКОбъект.Чеки.Добавить();
			//СтрокаЧековДК.Чек = Ссылка;
			СтрокаЧековДК.ДатаЧека = Ссылка.Дата;
			СтрокаЧековДК.НомерЧека = Ссылка.Номер;
			СтрокаЧековДК.Количество = -КоличествоДокумента;
			СтрокаЧековДК.Кассир = ПараметрыСеанса.Пользователь;
			СтрокаЧековДК.Подразделение = Склад.Подразделение;
			СтрокаЧековДК.Продавец = Продавец;
			СтрокаЧековДК.ПроцентСкидки = Скидка;
			СтрокаЧековДК.Сумма = -СуммаДокумента;
			СтрокаЧековДК.СуммаСкидки =  -СуммаСкидки;
			
			
		КонецЕсли;
		
		Для Каждого СтрокаТоваров Из Товары Цикл
			Если КодОперации = Перечисления.КодыОперацийОстатки.Реализация Тогда
				
				СтрокаПокупкиДК = ДКОбъект.Покупки.Добавить();
				СтрокаПокупкиДК.Количество = СтрокаТоваров.Количество;
				СтрокаПокупкиДК.Номенклатура = СтрокаТоваров.Номенклатура;
				СтрокаПокупкиДК.Сумма = СтрокаТоваров.Всего;
				СтрокаПокупкиДК.СуммаСкидки = СтрокаТоваров.ВсегоБезСкидки - СтрокаТоваров.Всего  ;
			иначе
				СтрокаПокупкиДК = ДКОбъект.Покупки.Добавить();
				СтрокаПокупкиДК.Количество = -СтрокаТоваров.Количество;
				СтрокаПокупкиДК.Номенклатура = СтрокаТоваров.Номенклатура;
				СтрокаПокупкиДК.Сумма = -СтрокаТоваров.Всего;
				СтрокаПокупкиДК.СуммаСкидки = -(СтрокаТоваров.ВсегоБезСкидки - СтрокаТоваров.Всего)  ;
			КонецЕсли;
			
		КонецЦикла;
		
		ДКОбъект.Покупки.Свернуть("Номенклатура","Количество,Сумма,СуммаСкидки");
		Если КодОперации = Перечисления.КодыОперацийОстатки.Реализация Тогда
			ДКОбъект.ОбщаяСумма = ДКОбъект.ОбщаяСумма + СуммаДокумента;
			ДКОбъект.ОбщееКоличество = ДКОбъект.ОбщееКоличество + КоличествоДокумента;
		Иначе
			ДКОбъект.ОбщаяСумма = ДКОбъект.ОбщаяСумма - СуммаДокумента;
			ДКОбъект.ОбщееКоличество = ДКОбъект.ОбщееКоличество - КоличествоДокумента;
			
		КонецЕсли;
		Если КодОперации = Перечисления.КодыОперацийОстатки.Реализация Тогда
			Если ВидОплаты = Перечисления.ВидыОплаты.БН Тогда
				ДКОбъект.СуммаБН = ДКОбъект.СуммаБН + СуммаДокумента;
			иначе
				ДКОбъект.СуммаНал = ДКОбъект.СуммаНал + СуммаДокумента;
			КонецЕсли;
		иначе
			Если ВидОплаты = Перечисления.ВидыОплаты.БН Тогда
				ДКОбъект.СуммаБН = ДКОбъект.СуммаБН - СуммаДокумента;
			иначе
				ДКОбъект.СуммаНал = ДКОбъект.СуммаНал - СуммаДокумента;
			КонецЕсли;
			
			
		Конецесли;
		//крохин начало 17.10.2012
		//новые карты скидку не меняют
		//Если ДКОбъект.Скидка <> РассчитатьСкидкуДК(ДКОбъект.ОбщаяСумма) Тогда
		//	Если ДКОбъект.Скидка < ДКОбъект.СкидкаСтарая Тогда
		//		Сообщить("Изменена скидка ДК с " + ДКОбъект.Скидка + "% на "  +РассчитатьСкидкуДК(ДКОбъект.ОбщаяСумма)+ "%");
		//	КонецЕсли;
		//	Если ДКОбъект.СкидкаСтарая = 0 Тогда
		//		ДКОбъект.СкидкаСтарая = ДКОбъект.Скидка;	
		//	Конецесли;
		//	
		//	ДКОбъект.Скидка = РассчитатьСкидкуДК(ДКОбъект.ОбщаяСумма);
		//	
		//Конецесли;
		//крохин начало 15.11.2012
		////ДК теперь выдаются в ТЦ все, по кнопке "пробить чек"
		//СкидкаПоСумме = РассчитатьСкидкуДК(ДКОбъект.ОбщаяСумма);
		//Если Макс(ДКОбъект.Скидка,ДКОбъект.СкидкаСтарая) < РассчитатьСкидкуДК(ДКОбъект.ОбщаяСумма) Тогда
		//Если Дата < '20121024' Тогда
		//		Сообщить("Изменена скидка ДК с " + ДКОбъект.Скидка + "% на "  +СкидкаПоСумме+ "%");
		//	Если ДКОбъект.СкидкаСтарая = 0 Тогда
		//		ДКОбъект.СкидкаСтарая = ДКОбъект.Скидка;	
		//	Конецесли;
		//	
		//	ДКОбъект.Скидка = СкидкаПоСумме;
		//Иначе
		//Если СкидкаПоСумме < 20 Тогда
		//Сообщить("Сумма наколений по ДК достаточна для замены карты на "  +СкидкаПоСумме+ "%");
		//Сообщить("Предложите покупателю поменять карту");	
		//Иначе
		//Сообщить("Сумма наколений по ДК достаточна для замены карты на "  +СкидкаПоСумме+ "%");
		//Сообщить("Замена карты на скидку более 15% осуществляется по запросу из офиса");
		//КонецЕсли;
		//крохин конец 15.11.2012
		//	Конецесли;
		//   Конецесли;
		//крохин конец 15.11.2012
		//крохин конец 17.10.2012
		ДКОбъект.Записать();
		
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция РассчитатьСкидкуДК(ОбщаяСумма)
	//крохин начало 17.10.2012
	//новая шкала
	Если Дата >= '20121024' Тогда
		Возврат ПолучитьСкидкуДК(ОбщаяСумма);	
	КонецЕсли;
	//крохин конец 17.10.2012
	Если ДК.ЧленКлуба Тогда
		Если ОбщаяСумма < 15000 тогда
			//крохин начало 16.02.2012
			//начальная скидка изменилась
			//Возврат 3;
			Если Дата >= '20120217' Тогда 
				Возврат 5;
			Иначе
				Возврат 3;
			КонецЕсли;
			//крохин конец 16.02.2012
		ИначеЕсли ОбщаяСумма < 30000 Тогда 
			Возврат 5;
		ИначеЕсли ОбщаяСумма < 45000 Тогда
			Возврат 10;
		Иначе
			Возврат 15;
		Конецесли;	
	ИначеЕсли дк.ЧленКлубаГП Тогда
		Если ОбщаяСумма < 3000 тогда
			Возврат 3;
		ИначеЕсли ОбщаяСумма < 10000 Тогда 
			Возврат 5;
		ИначеЕсли ОбщаяСумма < 15000 Тогда
			Возврат 10;
		Иначе
			Возврат 15;
		Конецесли;		
	Иначе 
		Возврат 3;
	КонецЕсли;
	
КонецФункции
//крохин конец

//крохин начало
Функция ПроверитьСертификаты()
	Ответ = "";
	//использованные
	Для Каждого СтрокаТЧ Из Товары Цикл
		
		Если НЕ СтрокаТЧ.Сертификат.Пустая() Тогда
			СертификатОбъект=СтрокаТЧ.Сертификат.ПолучитьОбъект();
			
			Если СертификатОбъект.Использован Тогда
				Если СертификатОбъект.НомерЧекаПогашения<>Номер Тогда
					Ответ=Ответ+?(ПустаяСтрока(Ответ),"",Символы.ПС)+"Сертификат: "+СертификатОбъект+" уже использован !";					
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаТЧ Из ПодарочныеСертификаты Цикл
		
		Если НЕ СтрокаТЧ.Сертификат.Пустая() Тогда
			СертификатОбъект=СтрокаТЧ.Сертификат.ПолучитьОбъект();
			
			Если СертификатОбъект.Использован Тогда
				Если СертификатОбъект.НомерЧекаПогашения<>Номер Тогда
					Ответ=Ответ+?(ПустаяСтрока(Ответ),"",Символы.ПС)+"Сертификат: "+СертификатОбъект+" уже использован !";					
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ответ;
КонецФункции
//крохин конец

Функция ПолучитьПараметрыСертификатов(АкцияСертификатыИзЧека,СуммаДенег)
	ПараметрыСертификатов = Новый Структура;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	АкцииПараметрыСертификатовИзЧека.НоминалСертификата,
	|	АкцииПараметрыСертификатовИзЧека.КоличествоСертификатов,
	|	АкцииПараметрыСертификатовИзЧека.СуммаДенег КАК СуммаДенег
	|ИЗ
	|	Справочник.Акции.ПараметрыСертификатовИзЧека КАК АкцииПараметрыСертификатовИзЧека
	|ГДЕ
	|	АкцииПараметрыСертификатовИзЧека.Ссылка = &Акция
	|	И АкцииПараметрыСертификатовИзЧека.СуммаДенег <= &СуммаДенег
	|
	|УПОРЯДОЧИТЬ ПО
	|	СуммаДенег УБЫВ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Акция",АкцияСертификатыИзЧека);
	запрос.УстановитьПараметр("СуммаДенег",СуммаДенег);
	
	Выборка = запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПараметрыСертификатов.Вставить("КоличествоСертификатов",Выборка.КоличествоСертификатов);
		ПараметрыСертификатов.Вставить("СуммаСертификата",Выборка.НоминалСертификата);
	Иначе
		ПараметрыСертификатов.Вставить("КоличествоСертификатов",0);
		ПараметрыСертификатов.Вставить("СуммаСертификата",0);
		
	КонецЕсли;
	Возврат ПараметрыСертификатов;
	
КонецФункции

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры


ЗаписьБезКонтроля=Ложь;