Функция ТипУчавствуетВОбмене(Тип) Экспорт
	Возврат ФР_ОбщегоНазначения_ПИ.ТипУчавствуетВОбмене(Тип);	
КонецФункции //ТипУчавствуетВОбмене(Тип)

Функция Узел_ФранчБаза() Экспорт
	ЭтотУзелКод	= ПланыОбмена.Основной.ЭтотУзел().Код;
	
	Если ЭтотУзелКод="SNL" Тогда //Это база ЦО
		ПО_Менеджер	= ПланыОбмена.ФР_ОбменСФРК;
		ЭтотУзел	= ПО_Менеджер.ЭтотУзел();
		Результат	= ПО_Менеджер.ПустаяСсылка();
		
		Выборка	= ПланыОбмена.ФР_ОбменСФРК.Выбрать();	
		Пока Выборка.Следующий() Цикл
			Если НЕ Выборка.ПометкаУдаления И Выборка.Ссылка <> ЭтотУзел Тогда 
				Результат = Выборка.Ссылка;
				Прервать;		
			КонецЕсли; 			
		КонецЦикла;		
	Иначе //Если вдруг прямая выгрузка из периферийной базы ЕЕ
		Результат=ПланыОбмена.ФР_ОбменСФРК.ЭтотУзел();
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции //Узел_ФранчБаза()

Функция СписокТиповСверхуВниз() Экспорт
	Результат		= Новый Соответствие;
	ИсключаемыеТипы	= ИсключаемыеТипыСверхуВниз();
	
	ММ	= Новый Массив;
	ММ.Добавить(Документы.БлокировкаАкции);
	ММ.Добавить(Документы.ЗаказПоставщику);
	ММ.Добавить(Документы.ПрайсЛист);
	ММ.Добавить(Документы.ПриходнаяНакладная);
	ММ.Добавить(Документы.РекламационнаяНакладная);
	ММ.Добавить(Документы.СверкаДанных);	
	ММ.Добавить(Документы.УстановкаСкидок);	
	
	//Справочники - все кроме Пользователи...... 	
	Для Каждого МетаОбъект Из Метаданные.Справочники Цикл		
		Если ИсключаемыеТипы.Получить(МетаОбъект.ПолноеИмя())=Неопределено Тогда
			ММ.Добавить(Справочники[МетаОбъект.Имя]);		
		КонецЕсли; 	
	КонецЦикла;	
	
	ММ.Добавить(ПланыВидовХарактеристик.СвойстваОбъектов);
	
	Для Каждого Менеджер Из ММ Цикл
		Результат.Вставить(ФР_ОбщегоНазначения_ПИ.ИмяТипаПоМенеджеру(ЗначениеВСтрокуВнутр(Менеджер)),Истина);	
	КонецЦикла;	
	
	Возврат Результат;
КонецФункции //СписокТиповСверхуВниз()

Функция СписокТиповСнизуВверх() Экспорт
	Результат		= Новый Соответствие;
	ИсключаемыеТипы	= ИсключаемыеТипыСнизуВверх();
	
	ММ	= Новый Массив;
	
	//Документы - Все кроме прайсов
	Для Каждого МетаДок Из Метаданные.Документы Цикл		
		Если ИсключаемыеТипы.Получить(МетаДок.ПолноеИмя())=Неопределено Тогда
			ММ.Добавить(Документы[МетаДок.Имя]);		
		КонецЕсли; 	
	КонецЦикла;
	
	//Справочники - только ПодарочныеСертификаты,Пользователи,ФизическиеЛица...... 	
	ММ.Добавить(Справочники.ПодарочныеСертификаты);
	ММ.Добавить(Справочники.Пользователи);
	ММ.Добавить(Справочники.ФизическиеЛица);
	
	Для Каждого Менеджер Из ММ Цикл
		Результат.Вставить(ФР_ОбщегоНазначения_ПИ.ИмяТипаПоМенеджеру(ЗначениеВСтрокуВнутр(Менеджер)),Истина);	
	КонецЦикла;	
	
	Возврат Результат;
КонецФункции //СписокТиповСнизуВверх()

Функция СписокТиповСверхуВнизДляСтарыхУзлов() Экспорт
	Результат		= Новый Соответствие;
	ИсключаемыеТипы	= ИсключаемыеТипыСверхуВниз();
	
	ММ	= Новый Массив;
	ММ.Добавить(Документы.ЗаказПоставщику);	
	ММ.Добавить(Документы.Инвентаризация);
	ММ.Добавить(Документы.ОприходованиеТМЦ);
	ММ.Добавить(Документы.ОтчетКассовойСмены);	
	ММ.Добавить(Документы.ПереводСредств);
	ММ.Добавить(Документы.Перемещение);
	ММ.Добавить(Документы.ПрайсЛист);
	ММ.Добавить(Документы.ПриходнаяНакладная);
	ММ.Добавить(Документы.РасходнаяНакладная);	
	ММ.Добавить(Документы.СписаниеТМЦ);	
	ММ.Добавить(Документы.УстановкаСкидок);	
	ММ.Добавить(Документы.ЭмиссияПодарочныхСертификатов);	
	
	//Справочники - все кроме Пользователи...... 	
	Для Каждого МетаОбъект Из Метаданные.Справочники Цикл		
		Если ИсключаемыеТипы.Получить(МетаОбъект.ПолноеИмя())=Неопределено Тогда
			ММ.Добавить(Справочники[МетаОбъект.Имя]);		
		КонецЕсли; 	
	КонецЦикла;	
	
	ММ.Добавить(ПланыВидовХарактеристик.СвойстваОбъектов);
	
	Для Каждого Менеджер Из ММ Цикл
		Результат.Вставить(ФР_ОбщегоНазначения_ПИ.ИмяТипаПоМенеджеру(ЗначениеВСтрокуВнутр(Менеджер)),Истина);	
	КонецЦикла;	
	
	Возврат Результат;
КонецФункции //СписокТиповСверхуВниз()

Функция СписокТиповТудаСюда() Экспорт
	Результат		= Новый Соответствие;	
	
	ММ=Новый Массив;
	
	////Документы - почти ничего
	ММ.Добавить(Документы.ЗаказПоставщику);
	ММ.Добавить(Документы.ЗаявкаНаВозвратОтПокупателя);	
	ММ.Добавить(Документы.ХранилищеКодовМаркировки);
	
	//+ HELP-5737 20250708 Михайловский
	//ММ.Добавить(Документы.МаркировкаОстатковТЦ);
	//- HELP-5737 20250708 Михайловский
	
	//+HELP-2306 20250220 Михайловский
	ММ.Добавить(Документы.ЗаявкаНаПостСторонАссорт);
	//-HELP-2306 20250220 Михайловский
	Для Каждого Менеджер Из ММ Цикл
		Результат.Вставить(ФР_ОбщегоНазначения_ПИ.ИмяТипаПоМенеджеру(ЗначениеВСтрокуВнутр(Менеджер)),Истина);	
	КонецЦикла;	
	
	Возврат Результат;
КонецФункции //СписокТиповСнизуВверх()

Функция ИсключаемыеТипыСнизуВверх()
	МТ=Новый Массив;
	
	МТ.Добавить(Документы.ПрайсЛист);
	МТ.Добавить(Документы.УстановкаСкидок);
	
	Возврат МТ_ВСоответствие(МТ);
КонецФункции //ИсключаемыеТипыСнизуВверх()

Функция ИсключаемыеТипыСверхуВниз()
	МТ=Новый Массив;
	
	МТ.Добавить(Справочники.Пользователи);
	МТ.Добавить(Справочники.ПодарочныеСертификаты);
	//МТ.Добавить(Документы.ОтчетКассовойСмены);
	//МТ.Добавить(Документы.СписаниеТМЦ);
	//МТ.Добавить(Документы.ОприходованиеТМЦ);
	
	Возврат МТ_ВСоответствие(МТ);
КонецФункции //ИсключаемыеТипыСверхуВниз()
 
        
Функция МТ_ВСоответствие(МТ,Значение=Истина) 
	Результат = Новый Соответствие;
	Для Каждого Менеджер Из МТ Цикл
		Результат.Вставить(ФР_ОбщегоНазначения_ПИ.ИмяТипаПоМенеджеру(ЗначениеВстрокувнутр(Менеджер)),Значение);	
	КонецЦикла; 
	
	Возврат Результат;
КонецФункции //МТ_ВСоответствие(МТ)

