Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	
	локУстановитьСписокПолучателей();	
КонецПроцедуры

Функция локУстановитьСписокПолучателей()	
	Регистратор	= Отбор.Регистратор.Значение;
	
	Получатели 	= Новый Массив;
	
	ТипРегистратора = ТипЗнч(Регистратор);	
	
	Если Маркировка_ПИ.ТипТекущегоУзла() = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		
		Получатели = Маркировка_ПИ.ПолучитьМассивУзловПоТипу(Перечисления.ТипУзлаИБ.Склад);
		
	КонецЕсли;  
	
	Для Каждого Получатель Из Получатели Цикл
		ОбменДанными.Получатели.Добавить(Получатель);	
	КонецЦикла;
	
КонецФункции //локУстановитьСписокПолучателей()