

Процедура Сформировать(ТаблицаПараметров=НЕОПРЕДЕЛЕНО) Экспорт
	МассивТСД = Новый Массив;
	ГлавныйУзел = ПланыОбмена.СкладТСД.НайтиПоНаименованию("Все",Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкладТСД.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.СкладТСД КАК СкладТСД
		|ГДЕ
		|	НЕ(СкладТСД.Наименование = ""Все""
		|				ИЛИ СкладТСД.Наименование = ""Основной"")";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивТСД.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихКоды.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ШтрихКоды КАК ШтрихКоды
		|ГДЕ
		|	ШтрихКоды.Владелец В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				НоменклатураИзменения.Ссылка КАК Номенклатура
		|			ИЗ
		|				Справочник.Номенклатура.Изменения КАК НоменклатураИзменения
		|			ГДЕ
		|				НоменклатураИзменения.Узел = &Узел)
		|	И НЕ ШтрихКоды.ПометкаУдаления
		|	И НЕ ШтрихКоды.Владелец В
		|				(ВЫБРАТЬ
		|					ШтрихКодыИзменения.Ссылка
		|				ИЗ
		|					Справочник.ШтрихКоды.Изменения КАК ШтрихКодыИзменения
		|				ГДЕ
		|					ШтрихКодыИзменения.Узел = &Узел)";
	
	Запрос.УстановитьПараметр("Узел", ГлавныйУзел);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НачатьТранзакцию();
		Попытка
			ПланыОбмена.ЗарегистрироватьИзменения(ГлавныйУзел, ВыборкаДетальныеЗаписи.Ссылка);	
			
			ПланыОбмена.УдалитьРегистрациюИзменений(ГлавныйУзел, Метаданные.Справочники["Номенклатура"]);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			// Сюда писать код обработки ошибки
			ВызватьИсключение;
		КонецПопытки;	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихКодыИзменения.Узел КАК Узел,
		|	ШтрихКодыИзменения.НомерСообщения КАК НомерСообщения,
		|	ШтрихКодыИзменения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ШтрихКоды.Изменения КАК ШтрихКодыИзменения
		|ГДЕ
		|	ШтрихКодыИзменения.Узел = &Узел";
	
	Запрос.УстановитьПараметр("Узел", ГлавныйУзел);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НачатьТранзакцию();
		Попытка
			Для каждого ТСД Из МассивТСД Цикл
				ПланыОбмена.ЗарегистрироватьИзменения(ТСД, ВыборкаДетальныеЗаписи.Ссылка);	
			КонецЦикла;
			ПланыОбмена.УдалитьРегистрациюИзменений(ГлавныйУзел, ВыборкаДетальныеЗаписи.Ссылка);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			// Сюда писать код обработки ошибки
			ВызватьИсключение;
		КонецПопытки;	
	КонецЦикла;
КонецПроцедуры