
&НаКлиенте
Процедура СоздатьНаОсновании(Команда)
	
	СсылкаНаОбъект = Элементы.Список.ТекущиеДанные.Ссылка;
	
	Если ЗначениеНеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Статус = ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, "Статус");
	
	Если Статус <> Перечисления.СтатусыЗаявокНаСкидки.Утверждена Тогда
		Сообщить("Заявка не в статусе <Утверждена>");
		Возврат;
	КонецЕсли;
	
	СписокДокументов = ЗаполнениеДокументов.СуществуютТипыДокументовВводимыеНаОсновании(СсылкаНаОбъект);
	
	ВыбЭлемент = СписокДокументов.ВыбратьЭлемент("Выберите основание");
	
	Если ВыбЭлемент <> Неопределено Тогда
		
		Длина = СтрДлина(ВыбЭлемент.Значение);
		Позиция = Найти(ВыбЭлемент.Значение, ".");
		Имя = Прав(ВыбЭлемент.Значение, Длина - Позиция);
		
		ПолноеИмяФормы = "Документ." + Имя + ".Форма.ФормаДокумента";
		
		ДокОбъект = Документы[Имя].СоздатьДокумент();
		//крохин начало 27.12.2022
		//ДокОбъект.Дата = ТекущаяДата();
		ДокОбъект.Дата = НачалоДня(ТекущаяДата());
		//крохин конец 27.12.2022
		Если ЕстьРеквизитДокумента("Дата2", ДокОбъект.Метаданные()) Тогда
			ДокОбъект.Дата2 = КонецГода((ТекущаяДата()+31536000));	
		КонецЕсли;
		ДокОбъект.Заполнить(СсылкаНаОбъект);
		
		// Кухарь А.Ю.  31.03.2023 начало
		// ДокОбъект.дата=НачалоДня(ДокОбъект.дата);
		ДокОбъект.дата=НачалоДня(ДокОбъект.дата);	
		ДокОбъект.Дата2=СсылкаНаОбъект.ДействителенПо;
		// Кухарь А.Ю.  31.03.2023 конец

		
		ДокОбъект.Записать();
		
		НаборЗаписей = РегистрыСведений.СкидкиНоменклатуры.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(ДокОбъект.Ссылка);
		НаборЗаписей.Прочитать();
		
		ТабличнаяЧасть = СсылкаНаОбъект["Скидки"].Выгрузить();
		
		Для Каждого Стр ИЗ ТабличнаяЧасть Цикл
			
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Стр);
			
			НоваяЗапись.Документ = ДокОбъект.Ссылка;
			НоваяЗапись.Период = ДокОбъект.Дата;
			НоваяЗапись.ТипСкидок = ДокОбъект.ТипСкидок;
			
		КонецЦикла;
		
		НаборЗаписей.Записать(Истина);
		
		ФормаДокумента = ДокОбъект.ПолучитьФорму();
		ФормаДокумента.Открыть();
		
	КонецЕсли;
	
КонецПроцедуры
