 //++Данилова Е.В. 12.02.2026 SNL-139 
 Функция СтруктураПечатиЭтикеткиОнлайн() Экспорт
	 
	 Структура = Новый Структура; 
     Структура.Вставить("КодАгрегации","");
	 Структура.Вставить("ЭтоУзел_Склад",ложь);
	 Структура.Вставить("ДопПараметрыНакладной",Неопределено);
	 Структура.Вставить("КоличествоЕдиниц",0);
	 Структура.Вставить("ПравилаРаботыСАгрегациейЧЗ",Неопределено);
	 	 
	 Возврат Структура; 
 
 КонецФункции // ()
 
 Функция ПечатьЭтикеткиОнлайн(ДокументПечатиОбъект, Форма, ДопПараметры,ВнешнийТД = Неопределено,ВнешнийДополнительныйТД = Неопределено) Экспорт
	 
	 КодАгрегации 				= ДопПараметры.КодАгрегации;
	 //ВнешнийТД				= ДопПараметры.ВнешнийТД;
	 ЭтоУзел_Склад 				= ДопПараметры.ЭтоУзел_Склад;
	 ДопПараметрыНакладной 		= ДопПараметры.ДопПараметрыНакладной;
	 КоличествоЕдиниц 			= ДопПараметры.КоличествоЕдиниц;
	 ПравилаРаботыСАгрегациейЧЗ = ДопПараметры.ПравилаРаботыСАгрегациейЧЗ;
	 //КоличествоЕдиниц 			= ДопПараметры.КоличествоЕдиниц;
	 //++Данилова Е.В. 07.05.2026 HELP-8363 
	 //СтруктураРезультат = Новый Структура("Успех,ТабДокумент,ТабДокументДоп,ЗаменятьЭтикеткуОнлайн,Ошибки,СтараяЭтикеткаОнлайн",
	 //Ложь,Новый ТабличныйДокумент,Новый ТабличныйДокумент,ложь,Новый Массив,Ложь);
	 СтруктураРезультат = Новый Структура("Успех,ТабДокумент,ТабДокументДоп,ЗаменятьЭтикеткуОнлайн,Ошибки,СтараяЭтикеткаОнлайн,МассивКодовQR",
	 Ложь,Новый ТабличныйДокумент,Новый ТабличныйДокумент,ложь,Новый Массив,Ложь,Новый Массив);
	 //--Данилова Е.В. 07.05.2026 
	 
	 ДокОснование = ДокументПечатиОбъект.ДокОснование; 
	 МетаДок						=	ДокОснование.Метаданные();	
	 ВидДокументаОснования			=	МетаДок.Имя;
	 
	 если ВидДокументаОснования = "РасходнаяНакладная" тогда
		 СтрокаРеквизитовДокОснования	=	"Контрагент,Контрагент.Код,Контрагент.Наименование,Контрагент.Родитель.Код,
		 |СостояниеНакладной,КоличествоКоробок,Номер,
		 |ПунктДоставки,ПунктДоставки.Регион,ПунктДоставки.Наименование,ПунктДоставки.НомерМагазина,ПунктДоставки.АдресПолучателя,ПунктДоставки.Телефоны,
		 |РайонДоставки.Сектор.Наименование,
		 |Организация.Наименование,Организация.Телефоны,Организация.ЮридическийАдрес";
	 иначе
		 СтрокаРеквизитовДокОснования	=	"Контрагент,Контрагент.Код,Контрагент.Наименование,Контрагент.Родитель.Код,
		 |СостояниеНакладной,КоличествоКоробок,Номер,
		 |ПунктДоставки,ПунктДоставки.Регион,ПунктДоставки.Наименование,ПунктДоставки.НомерМагазина,ПунктДоставки.АдресПолучателя,ПунктДоставки.Телефоны,
		 |Организация.Наименование,Организация.Телефоны,Организация.ЮридическийАдрес";	
	 КонецЕсли;
	 
	 РеквизитыДокОснования			=	ПолучитьРеквизитыШапки(ДокОснование,СтрокаРеквизитовДокОснования,"Документ");
	 если ВидДокументаОснования <> "РасходнаяНакладная" тогда
		 РеквизитыДокОснования.вставить("РайонДоставки_Сектор_Наименование","");       
		 
	 иначе
		 ЗаменятьЭтикеткуОнлайн = ОбщегоНазначения_ПИ.ПолучитьЗначениеРСРеквизитыСправочников(РеквизитыДокОснования.Контрагент,"ЗаменятьЭтикеткуОнлайн",Ложь); 
		 если ЗаменятьЭтикеткуОнлайн тогда
			 
			 
			 СтруктураРезультат.ЗаменятьЭтикеткуОнлайн = Истина; 
			 ////////////////////////////// ПЕЧАТЬ В ЛН/ЛП Печать()
			 //////////////////////////////
			 Возврат СтруктураРезультат;
			 
		 КонецЕсли;
		 
	 КонецЕсли;
	 
	 КодКонтрагента					=	РеквизитыДокОснования.Контрагент_Код; 
	 КодКонтрагентаРодителя			=	РеквизитыДокОснования.Контрагент_Родитель_Код;  
	 СостояниеНакладной				=	РеквизитыДокОснования.СостояниеНакладной;        
	 КоличествоКоробокНакладной		=	РеквизитыДокОснования.КоличествоКоробок; 
	 //++Данилова Е.В. 27.03.2026 SNL-153
	 //ПечатьНовойКомпонентой=ОбщегоНазначения_ПИ.ПолучитьЗначениеРСРеквизитыСправочников(РеквизитыДокОснования.Контрагент,"НоваяПечатьКоробов",Ложь);
	 ВыводитьКодАгрегацииВЭтикетку=ОбщегоНазначения_ПИ.ПолучитьЗначениеРСРеквизитыСправочников(РеквизитыДокОснования.Контрагент,"НоваяПечатьКоробов",Ложь);
	 //--Данилова Е.В. 27.03.2026 
	 если ПравилаРаботыСАгрегациейЧЗ = Неопределено тогда  
		 ПравилаРаботыСАгрегациейЧЗ = МаркировкаКС.ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладной(ДокОснование);
	 КонецЕсли;   	       
	 
	 если ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияКоробок тогда 
		 если не СформироватьКодАгрегацииНаКоробку(КодАгрегации,ДокументПечатиОбъект,ДокОснование,Форма,ПравилаРаботыСАгрегациейЧЗ) тогда 
			 Сообщить("Не удалось сформировать код агрегации");
			 СтруктураРезультат.Ошибки.Добавить("Не удалось сформировать код агрегации"); 
			 Возврат СтруктураРезультат;
		 КонецЕсли; 	  
	 иначе
		 
		 ПечатьНовойКомпонентой = Истина;
				 
	 КонецЕсли;
	 //++Данилова Е.В. 27.03.2026 SNL-153 
	 //всегда будет печать через компоненту QR только код агрегации выводим, если стоит 
	 // НоваяПечатьКоробов 
	 ПечатьНовойКомпонентой = Истина;
	 Если ВыводитьКодАгрегацииВЭтикетку
		 И Не ЗначениеЗаполнено(КодАгрегации) 
		 И ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияКоробок Тогда
	 
	 	КодАгрегацииИзТЧ = ПолучитьКодАгрегацииКоробкиИзТЧ(ДокументПечатиОбъект); 
		Если ЗначениеЗаполнено(КодАгрегацииИзТЧ)  Тогда
			
			КодАгрегации = КодАгрегацииИзТЧ; 	
			ДопПараметры.КодАгрегации = КодАгрегации; 
		КонецЕсли;
		
	 КонецЕсли;
	 //--Данилова Е.В. 27.03.2026 
	 	 
	 /////////////////после всего признак завершения 
	 если не ПечатьНовойКомпонентой тогда 
		 
		 СтруктураРезультат.СтараяЭтикеткаОнлайн = Истина; 		 
		 возврат ЭтикеткаОнлайнСтарая(ДокументПечатиОбъект, Форма, ДопПараметры,Неопределено,Неопределено);
		 
	 КонецЕсли;
	 ТипШК = ДокументПечатиОбъект.ТипШК; 
	 ВидДокументаПечати = ДокументПечатиОбъект.ссылка.Метаданные().Имя; 
	 Если ВнешнийТД=Неопределено тогда
		 Если  ЭтоУзел_Склад  и (ВидДокументаОснования="РасходнаяНакладная" или ВидДокументаОснования="Перемещение") тогда	
			 если ДопПараметрыНакладной<>Неопределено и ДопПараметрыНакладной.НеКонтролироватьКоличествоЕдиниц тогда 
			 иначе	
				 Если ТипШК=Перечисления.ТипыШтрихКодов.Коробка
					 И ВидДокументаПечати = "ЛистНабора" тогда
					 ТекКоличествоКоробок=0;	
					 Для Каждого СтрокаТз из ДокументПечатиОбъект.Товары цикл
						 ТекКоличествоКоробок=ТекКоличествоКоробок+?(СтрокаТЗ.ШтВКоробе=0,СтрокаТз.Количество,СтрокаТз.Количество/СтрокаТз.ШтВКоробе);
					 Конеццикла;			
					 
					 Если КоличествоЕдиниц<>ТекКоличествоКоробок тогда
						 Сообщить("Не совпало расчётное количество единиц с фактическим");
						 СтруктураРезультат.Ошибки.Добавить("Не совпало расчётное количество единиц с фактическим"); 
						 Возврат СтруктураРезультат;
					 КонецЕсли;			
				 Иначе
					 Если ВидДокументаПечати = "ЛистНабора"
						 И КоличествоЕдиниц<>ДокументПечатиОбъект.Товары.Итог("Количество") тогда
						 Сообщить("Не совпало расчётное количество единиц с фактическим");
						 СтруктураРезультат.Ошибки.Добавить("Не совпало расчётное количество единиц с фактическим");
						 Возврат СтруктураРезультат;
					 КонецЕсли;
				 КонецЕсли;
			 КонецЕсли;
			 //++Данилова Е.В. 04.03.2026 SNL-153
			 Если ВидДокументаПечати = "ЛистПереукладки" Тогда 
				 РезультатПроверки = ДокументПечатиОбъект.СверитьКолШтВКоробке();
				 Если НЕ РезультатПроверки.Успешно Тогда			
					 Для каждого СтрПроверки Из РезультатПроверки.ошибки Цикл
						 
						 СтруктураРезультат.Ошибки.Добавить(СтрПроверки); 	
						 
					 КонецЦикла; 
					 Возврат СтруктураРезультат;  
				 КонецЕсли;
			 КонецЕсли;
			 //--Данилова Е.В. 04.03.2026

		 КонецЕсли;   
		 
		 Если ДокументПечатиОбъект.ЭтоНовый() тогда
			 ПеремОтказ=ложь;
			 //ПередЗаписью(ПеремОтказ,РежимЗаписиДокумента.Проведение,Неопределено);
			 //Если ПеремОтказ=ложь тогда
			 РезультатЗаписи = Форма.ЗаписатьВФорме(РежимЗаписиДокумента.Проведение); 
			 Если РезультатЗаписи = Ложь Тогда
				 
				 Сообщить("Не удалось записать документ"); 
				 Возврат СтруктураРезультат; 
				 
			 КонецЕсли;
			 //КонецЕсли;
		 Иначе 
			 если ДопПараметрыНакладной<>Неопределено и (ДопПараметрыНакладной.имя="WB_FBS" или ДопПараметрыНакладной.имя="OZON_FBS") тогда				
				 НужноПроводить= не ПолучитьРеквизитШапки(ДокументПечатиОбъект.ссылка,"Проведен","Документ");
				 если НужноПроводить тогда
					 //ПеремОтказ=ложь;
					 Дата=ТекущаяДатаСеанса();
					 //ПередЗаписью(ПеремОтказ,РежимЗаписиДокумента.Проведение,Неопределено);
					 //Если ПеремОтказ=ложь тогда
					 РезультатЗаписи = Форма.ЗаписатьВФорме(РежимЗаписиДокумента.Проведение);
					 Если РезультатЗаписи = Ложь Тогда
						 
						 Сообщить("Не удалось провести документ"); 
						 Возврат СтруктураРезультат; 
						 
					 КонецЕсли;
					 //КонецЕсли;
				 КонецЕсли;
			 КонецЕсли;
		 КонецЕсли;
		 
	 КонецЕсли;	           
	 //++Данилова Е.В. 17.03.2026 SNL-27
	 ДанныеДляПерезаполнения = неопределено; 
     //СтруктураКоробок=ПолучитьСписокШКкоробокЛистаНабора(ДокументПечатиОбъект.ссылка,Истина);
	 СтруктураКоробок=ПолучитьСписокШКкоробокЛистаНабора(ДокументПечатиОбъект,Истина,ДанныеДляПерезаполнения);
	 Обработки.ПечатьЛистаНабора.ПерезаполнитьНомераКоробок(ДокументПечатиОбъект,ДанныеДляПерезаполнения);
	//--Данилова Е.В. 17.03.2026 	 
		 
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ПланНабора.Ссылка КАК ПланНабора
	|ИЗ
	|	Документ.ПланНабора КАК ПланНабора
	|ГДЕ
	|	ПланНабора.Проведен
	|	И ПланНабора.Накладная = &ДокОснование";	
	
	запрос.УстановитьПараметр("ДокОснование",ДокОснование);
	результат2=запрос.Выполнить().Выбрать();       
	МожноВыводитьОбщееКоличествоМест=истина;
	пока результат2.Следующий() цикл
		ПН=результат2.планНабора.получитьОбъект();
		если ложь тогда
			ПН=Документы.ПланНабора.НайтиПоНомеру("").ПолучитьОбъект();
		КонецЕсли;
		ТЗБР=ПН.тБрэндов.Выгрузить();
		ТЗБР.Свернуть("Состояние,СекторХранения");	 
		для каждого СтрТЗБР из ТЗБР цикл			
			если ПолучитьНомерСостоянияНакладной(СтрТЗБР.Состояние,СтрТЗБР.СекторХранения="2")<800 тогда				 
				МожноВыводитьОбщееКоличествоМест=Ложь;
			КонецЕсли;
		КонецЦикла;		
	КонецЦикла;
	
	если МожноВыводитьОбщееКоличествоМест тогда		
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ
		|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита как ЗначениеРеквизита
		|ИЗ
		|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
		|ГДЕ
		|	РеквизитыРНКПНКПРМ.Документ = &Документ
		|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = ""СмешаннаяНакладная""";
		запрос.УстановитьПараметр("Документ",ДокОснование);
		результат=запрос.Выполнить().Выбрать();
		пока результат.Следующий() цикл
			если результат.ЗначениеРеквизита=Истина тогда 
				если СостояниеНакладной=Перечисления.СостоянияНакладной.ОжиданиеПаллетирования или
					// Кельманов А.В. - Это не нужно - 2026.04.16 {
					//// Кельманов А.В. - SNL-119 - 2026.04.03 {
					//(СостояниеНакладной=Перечисления.СостоянияНакладной.Переукладка И ИспользоватьЛНТолькоДляНабора(ДокОснование)) или
					//// Кельманов А.В. - SNL-119 - 2026.04.03 }
					// Кельманов А.В. - Это не нужно - 2026.04.16 }
					СостояниеНакладной=Перечисления.СостоянияНакладной.Паллетирование или
					СостояниеНакладной=Перечисления.СостоянияНакладной.ОжиданиеТермоусадки или
					СостояниеНакладной=Перечисления.СостоянияНакладной.Термоусадка или
					СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке тогда
				иначе
					МожноВыводитьОбщееКоличествоМест=Ложь;
				КонецЕсли;			
			КонецЕсли;
		КонецЦикла;
		
		если ДопПараметрыНакладной<>Неопределено и ДопПараметрыНакладной.ОтгрузкаFBS = Истина  тогда
			если СостояниеНакладной=Перечисления.СостоянияНакладной.ОжиданиеПаллетирования или
				СостояниеНакладной=Перечисления.СостоянияНакладной.ОжиданиеДопОбработки или
				СостояниеНакладной=Перечисления.СостоянияНакладной.ДопОбработка или
				// Кельманов А.В. - Это не нужно - 2026.04.16 {
				//// Кельманов А.В. - SNL-119 - 2026.04.03 {
				//(СостояниеНакладной=Перечисления.СостоянияНакладной.Переукладка И ИспользоватьЛНТолькоДляНабора(ДокОснование)) или
				//// Кельманов А.В. - SNL-119 - 2026.04.03 }
				// Кельманов А.В. - Это не нужно - 2026.04.16 }
				СостояниеНакладной=Перечисления.СостоянияНакладной.Паллетирование или
				СостояниеНакладной=Перечисления.СостоянияНакладной.ОжиданиеТермоусадки или
				СостояниеНакладной=Перечисления.СостоянияНакладной.Термоусадка или
				СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена или 	
				СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке тогда
			иначе
				МожноВыводитьОбщееКоличествоМест=Ложь;
			КонецЕсли;
		КонецЕсли;  
	КонецЕсли;
	
	если МожноВыводитьОбщееКоличествоМест тогда	
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ
		             |	СУММА(ЕСТЬNULL(ЛистНабораДок.КоличествоКоробок, 0)) КАК КоличествоКоробок
		             |ИЗ
		             |	Документ.ЛистНабора КАК ЛистНабораДок
		             |ГДЕ
		             |	ЛистНабораДок.Проведен
		             |	И ЛистНабораДок.ДокОснование = &ДокОснование";
		запрос.УстановитьПараметр("ДокОснование",ДокОснование);
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Документ.ЛистНабора","документ." + ВидДокументаПечати); 
		КолКоробок=0;
		результат2=запрос.Выполнить().Выбрать();
		пока результат2.Следующий() цикл
			если результат2.КоличествоКоробок=null тогда Продолжить;КонецЕсли;
			КолКоробок=КолКоробок+результат2.КоличествоКоробок;		
		КонецЦикла;	
	КонецЕсли;
	
	если ТипШК=Перечисления.ТипыШтрихКодов.Коробка и ДокументПечатиОбъект.Товары.Количество()>1 тогда
		ТабНом=СтруктураКоробок.Скопировать();
		ТабНом.Свернуть("Номенклатура");
		СтруктураКоробок.колонки.добавить("ПорядковыйНомерСканирования");
		для каждого СтрТЗ из ТабНом цикл
			Отбор=новый Структура;
			Отбор.Вставить("Номенклатура",СтрТЗ.Номенклатура);
			МассИзТч=ДокументПечатиОбъект.Товары.НайтиСтроки(Отбор);
			если МассИзТч.Количество()<>1 тогда Продолжить; КонецЕсли;
			МассИзСтруктурыКоробок=СтруктураКоробок.НайтиСтроки(Отбор);
			//++Данилова Е.В. 16.03.2026 SNL-153 
			если ВидДокументаПечати = "ЛистНабора" Тогда 
				ТекстНомеровСтрок=МассИзТч.Получить(0).ПорядковыйНомерКоробки;
			Иначе
				ТекстНомеровСтрок= ""; 
			КонецЕсли;
			//--Данилова Е.В. 16.03.2026 
			если ТекстНомеровСтрок="" тогда
				Продолжить;
			КонецЕсли;
			ТекстНомеровСтрок=СтрЗаменить(ТекстНомеровСтрок,";",Символы.ПС);
			Сч=1;
			Для Каждого СтрМассСтруктуры из МассИзСтруктурыКоробок цикл  
				если СтрПолучитьСтроку(ТекстНомеровСтрок,сч)<>"" тогда
					СтрМассСтруктуры.ПорядковыйНомерСканирования=число(СтрПолучитьСтроку(ТекстНомеровСтрок,сч));
				иначе
					СтрМассСтруктуры.ПорядковыйНомерСканирования=0;
				КонецЕсли;		
				сч=сч+1;
			КонецЦикла;				
		КонецЦикла;
		//++Данилова Е.В. 16.03.2026 SNL-153
		если ВидДокументаПечати = "ЛистНабора"
			И ДокументПечатиОбъект.товары.Получить(0).ПорядковыйНомерКоробки<>"" тогда
			//--Данилова Е.В. 16.03.2026 
			СтруктураКоробок.Сортировать("ПорядковыйНомерСканирования");
		КонецЕсли;	
	КонецЕсли;         
	
	
	ТабДок	= Новый ТабличныйДокумент;
	
	
	если не ПечатьНовойКомпонентой тогда
		Макет=Обработки.НаклейкиНаКоробки.ПолучитьМакет("ШК");
	иначе  
		Макет=Обработки.НаклейкиНаКоробки.ПолучитьМакет("ШКНоваяКомпонента");
	КонецЕсли;
	
	НаборПолей = Новый Структура;
	попытка
		сектор = Лев(РеквизитыДокОснования.РайонДоставки_Сектор_Наименование,2);
		НаборПолей.Вставить("сектор",сектор);
	Исключение
	КонецПопытки;
	
	НаборПолей.Вставить("Отправитель",РеквизитыДокОснования.Организация_Наименование);
	НаборПолей.Вставить("Телефон",РеквизитыДокОснования.Организация_Телефоны);	
	НаборПолей.Вставить("ЮрАД",РеквизитыДокОснования.Организация_ЮридическийАдрес);		 
	
	Регион=Неопределено; 
	АдресДляЭтикеткиИзРег ="";
	Если ВидДокументаПечати="Перемещение" Тогда
		Получатель = РеквизитыДокОснования.Организация_Наименование+" "+РеквизитыДокОснования.ПунктДоставки;
		Регион= РеквизитыДокОснования.ПунктДоставки_Регион;
	ИначеЕсли ВидДокументаПечати="ПриходнаяНакладная" тогда
		Получатель	=РеквизитыДокОснования.Контрагент_наименование;
		Регион= РеквизитыДокОснования.ПунктДоставки_Регион;
	ИначеЕсли ВидДокументаПечати="РасходнаяНакладная" тогда
		Получатель	=РеквизитыДокОснования.Контрагент_наименование;;
		Регион= РеквизитыДокОснования.ПунктДоставки_Регион;	
		Грузополучатель=РеквизитыДокОснования.Контрагент;		
		Получатель=СокрЛП(РеквизитыДокОснования.Контрагент_Наименование)+" "+СокрЛП(РеквизитыДокОснования.ПунктДоставки);
		если ДопПараметрыНакладной.имя="SSP-3698" тогда
			НаборПолей.Вставить("НомерМагазина",РеквизитыДокОснования.ПунктДоставки_НомерМагазина);	 
		КонецЕсли;   
		АдресДляЭтикеткиИзРег=ПрочитатьЗначениеРеквизитаПНКПРМРНК("АдресДляЭтикетки",ДокОснование);	
	Иначе
		Грузополучатель=?(ДокОснование.Грузополучатель.Пустая(),ДокОснование.Контрагент,ДокОснование.Грузополучатель);		
		Получатель	=Грузополучатель.Наименование;
		Если НЕ Грузополучатель.Регион.Пустая() Тогда					
			Регион=Грузополучатель.Регион;
		КонецЕсли;
		Если ЕстьРеквизитДокумента("ПунктДоставки",МетаДок) И ЗначениеЗаполнено(ДокОснование.ПунктДоставки) Тогда
			Получатель=СокрЛП(Получатель)+" "+СокрЛП(ДокОснование.ПунктДоставки);
		КонецЕсли; 		
	КонецЕсли; 
	НаборПолей.Вставить("Получатель",Получатель);	
	НаборПолей.Вставить("Регион",Регион);	
	
	НаборПолей.Вставить("ад", РеквизитыДокОснования.ПунктДоставки_АдресПолучателя+ " тел.: "+РеквизитыДокОснования.ПунктДоставки_Телефоны);
	если ЗначениеЗаполнено(АдресДляЭтикеткиИзРег) тогда
		НаборПолей.ад=АдресДляЭтикеткиИзРег;
	КонецЕсли;
	НаборПолей.Вставить("Пользователь",Строка(ДокументПечатиОбъект.Сканировщик)+?(ПараметрыСеанса.Пользователь.ФизЛицо=ДокументПечатиОбъект.Сканировщик,"","\"+Строка(ПараметрыСеанса.Пользователь.ФизЛицо)));
	
	НаборПолей.Вставить("Номер", РеквизитыДокОснования.Номер);	
	
	если ТипШК<>Перечисления.ТипыШтрихКодов.Коробка тогда
		НаборПолей.Вставить("ШтукВЛН"," - "+ДокументПечатиОбъект.Товары.Итог("Количество")+"шт.");	
		НужноОбрезать=Истина;
	иначе
		НужноОбрезать=Ложь;
	КонецЕсли;
	
	ДопПараметрыПечати=новый Структура("КодКонтрагента,КодКонтрагентаРодителя,КолКоробок,МожноВыводитьОбщееКоличествоМест,НаборПолей,НужноОбрезать,ТабДок"
		,КодКонтрагента,КодКонтрагентаРодителя,КолКоробок,МожноВыводитьОбщееКоличествоМест,НаборПолей,НужноОбрезать,ТабДок);        
	//++Данилова Е.В. 26.03.2026 SNL-153
	//КодАгрегации = ДокументПечатиОбъект.КодАгрегации;
	
	КодАгрегации = ДопПараметры.КодАгрегации;
	//--Данилова Е.В. 26.03.2026
	//++Данилова Е.В. 27.03.2026 SNL-153 
	//ДопПараметрыПечати.Вставить("ТребуетсяАгрегацияКоробок",ЗначениеЗаполнено(КодАгрегации));	
	ТребуетсяВыводКоробки = ВыводитьКодАгрегацииВЭтикетку И  ЗначениеЗаполнено(КодАгрегации); 
	ДопПараметрыПечати.Вставить("ТребуетсяАгрегацияКоробок",ТребуетсяВыводКоробки);
	//--Данилова Е.В. 27.03.2026 
	ДопПараметрыПечати.Вставить("ОбработкаПечати", Обработки.ПечатьЭтикетокЧЗ.Создать());     
	
	если ЗначениеЗаполнено(КодАгрегации) тогда
		ТипШКАгрегации = ПолучитьРеквизитШапки(РеквизитыДокОснования.Контрагент,"ТипШКАгрегации","Справочник"); 
		если ТипШКАгрегации = Перечисления.ТипыКодировокШК.Code128 тогда   
			ДопПараметрыПечати.Вставить("ПечататьCode128ДляАгрегаций",Истина);
		иначе
			ДопПараметрыПечати.Вставить("ПечататьCode128ДляАгрегаций",ложь);
		КонецЕсли;
	КонецЕсли;	
	//++Данилова Е.В. 07.05.2026 HELP-8363 
	МассивКодовQR = Новый Массив; 
	//--Данилова Е.В. 07.05.2026 
	для Каждого СтрТз из СтруктураКоробок цикл 	
		//++Данилова Е.В. 26.03.2026 SNL-153  
		//ПечатьЭтикеткиОнлайнНаСтрокуКороба(СтрТЗ,ДопПараметрыПечати,ДокументПечатиОбъект,Макет,ДокОснование);
		//++Данилова Е.В. 07.05.2026 HELP-8363
		ШтрихКодЭтикетки = Неопределено; 
		ПечатьЭтикеткиОнлайнНаСтрокуКороба(СтрТЗ,ДопПараметрыПечати,ДокументПечатиОбъект,Макет,ДокОснование,КодАгрегации,ШтрихКодЭтикетки);
		Если ЗначениеЗаполнено(ШтрихКодЭтикетки) Тогда
		
			МассивКодовQR.Добавить(ШтрихКодЭтикетки); 	
		
		КонецЕсли; 
		//--Данилова Е.В. 07.05.2026 
		//--Данилова Е.В. 26.03.2026 
	КонецЦикла; 
	//++Данилова Е.В. 07.05.2026 HELP-8363
	СтруктураРезультат.МассивКодовQR  = МассивКодовQR;  
	//--Данилова Е.В. 07.05.2026 
	если не ЗначениеЗаполнено(ТабДок.ИмяПараметровПечати) тогда
		ТабДок.ИмяПараметровПечати	= "ПараметрыПечати_"+ВидДокументаПечати+"_НаклейкиНаКоробки";
	КонецЕсли;
	
	ТабДок.ОтображатьСетку 		= Ложь;	
	ТабДок.ОтображатьЗаголовки 	= Ложь;	
	ТабДок.ПолеСверху=0; ТабДок.ПолеСнизу=0; ТабДок.ПолеСлева=3; ТабДок.ПолеСправа=0;
	
	если ВнешнийТД<>Неопределено тогда
		ВнешнийТД.вывести(ТабДок);
	иначе
		//ТабДок.Показать("Наклейки "+ РеквизитыДокОснования.Номер);
		СтруктураРезультат.Успех = истина; 
		СтруктураРезультат.ТабДокумент = ТабДок; 
	КонецЕсли;
	
	
	если МожноВыводитьОбщееКоличествоМест тогда
		   
		если КоличествоКоробокНакладной<>КолКоробок тогда   		 
			
			НакладнаяОбъект=ДокОснование.ПолучитьОбъект();
			СтрТЗ=ФинальныйПересчетКоробокИОбъемов(ДокОснование.ПолучитьОбъект());
			ЗаполнитьЗначенияСвойств(НакладнаяОбъект,СтрТЗ);
			НакладнаяОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	КонецЕсли;
	
	
	ТабДокументДоп = НапечататьДополнительнуюЭтикетку(ДокОснование,ДокументПечатиОбъект,Форма,ВнешнийДополнительныйТД,ДопПараметрыНакладной); 
	Если ВнешнийДополнительныйТД = неопределено  Тогда
		
		СтруктураРезультат.ТабДокументДоп = ТабДокументДоп; 	
		
	КонецЕсли;
	если ДопПараметрыНакладной <> Неопределено и  ДопПараметрыНакладной.ОтгрузкаКомплектов тогда	 
		если   ДопПараметрыНакладной.имя = "OZON_FBS" тогда
			ТЗУпаковки=ПолучитьРазбивкуНоменклатурыПоУпаковкеДокумента(ДокументПечатиОбъект.Товары.ВыгрузитьКолонку("Номенклатура"),ДопПараметрыНакладной.МассивДО);
			Для каждого СтрТЗ из ТЗУпаковки цикл
				Сообщить("Положите "+СтрТЗ.Владелец+" в "+СтрТЗ.Упаковка);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли; 

	Возврат СтруктураРезультат;  
	 
КонецФункции // ПечатьЭтикеткиОнлайн() 

Функция НапечататьДополнительнуюЭтикетку(ДокОснование,ДокументПечати,Форма,ВнешнийДополнительныйТД,ДопПараметрыНакладной) 
	Накладная = ДокОснование;
	если не ЗначениеЗаполнено(ДокументПечати.Ссылка) тогда
		возврат Неопределено;
	КонецЕсли;
	
	если ложь тогда Накладная = Документы.РасходнаяНакладная.ПустаяСсылка();КонецЕсли;
	
	если Накладная.Метаданные().Имя <> "РасходнаяНакладная" тогда
		возврат Неопределено;
	КонецЕсли;
	
	ПараметрыПечати=ПолучитьПараметрыПечати(Накладная);
	если ПараметрыПечати=Неопределено тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаТоваров=ДокументПечати.Товары.выгрузить();
	если ПараметрыПечати.СворачиватьТовары тогда
		ТаблицаТоваров.свернуть(ПараметрыПечати.КолонкиГруппировки,ПараметрыПечати.КолонкиСуммы);
	КонецЕсли;
	ТабДок=Новый ТабличныйДокумент;
	 
	ИмяПараметровПечати = "ДополнительнаяЭтикеткаНаКоробИзЛН" + СтрЗаменить(Накладная.контрагент.код, "-", "");
	ТабДок.ИмяПараметровПечати = ИмяПараметровПечати;
	
	Макет=ПараметрыПечати.Макет;
	МожноПечатать=Истина; 
	
	если Накладная.контрагент.код="SSR-9059" или Накладная.контрагент.код="SST-1208" тогда //Вайлдберриз
		если не ДокументПечати.Проведен тогда
			Форма.ЗаписатьВФорме(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		
		Если НЕ  Накладная.ОтгрузкаКомплектов 
			И ОтсканированыКоробаВЛН(ДокументПечати) Тогда  		
			
			ТабДок = НапечататьДополнительнуюЭтикеткуПоВБПоНесколькимТоварам(ПараметрыПечати,ДокОснование,ДокументПечати,ДопПараметрыНакладной);
			Если ТабДок = неопределено  Тогда
				
				Возврат Неопределено; 	
				
			КонецЕсли;
			ТабДок.ИмяПараметровПечати = ИмяПараметровПечати;
		Иначе 
			
			
			ОблЭтикетка=Макет.получитьобласть("Этикетка");
			Если Накладная.ОтгрузкаКомплектов тогда
				Возврат Неопределено;
			КонецЕсли;	
			Если ТаблицаТоваров.Количество()<>1 тогда
				возврат Неопределено;
			КонецЕсли;
			Номенклатура=ТаблицаТоваров.Получить(0).Номенклатура;
			
			СтрШК = ШКпоИндексуТекЛН(Накладная,Номенклатура,ДопПараметрыНакладной,ДокументПечати); 
			
			Если СтрШК = Неопределено Тогда
				
				Возврат Неопределено; 	
				
			КонецЕсли;
			
			ОбработкаПечати = Обработки.ПечатьЭтикетокЧЗ.Создать();
			Для Каждого Рисунок Из ОблЭтикетка.Рисунки Цикл							
				
				ДопПараметры = Новый Структура; 
				ДопПараметры.Вставить("НужнаТолькоКартинка", Истина);
				ДопПараметры.Вставить("ОтображатьТекст", Ложь); 
				ДопПараметры.Вставить("ВысотаРисунка", Рисунок.Высота);
				ДопПараметры.Вставить("ШиринаРисунка", Рисунок.Ширина);
				ДопПараметры.Вставить("БезПрефикса", Истина); // Кельманов А.В. - HELP-5825 - 2025.07.02
				КартинкаКода 		=  ОбработкаПечати.СформироватьКА(Макет,СтрШК.ШтрихКод,,,,ДопПараметры);     
				Рисунок.Картинка 	= КартинкаКода;
				ОблЭтикетка.Параметры.СтараяНоменклатура = СтрШК.ШтрихКод; 
				
			КонецЦикла; 	
			
			ТабДок.Вывести(ОблЭтикетка);
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЕсли; 
		
	иначе
		если Накладная.контрагент.код="SSR-5004" тогда //МАКСИМА ГРУПП
			//если Накладная.контрагент.код="SSR-1593" тогда //для теста
			//SSR-1593
			ОблШапка=Макет.ПолучитьОбласть("шапка");
			ОблСтрока = Макет.ПолучитьОбласть("Строка");
			НомерПоставщика = ДокументПечати.Ссылка.ДокОснование.Контрагент.КодПоставщика;
			ОблШапка.Параметры.НомерПоставщика=НомерПоставщика;
			НомерЛистаНабора = Прав(ДокументПечати.Ссылка.Номер,6);
			НомерЛистаНабора = Число(НомерЛистаНабора);
			ОблШапка.Параметры.НомерКороба=НомерЛистаНабора;
			ВсегоЛистовНабора = 0; 
			Если ДокументПечати.Ссылка.Метаданные().Имя = "ЛистНабора" Тогда 
				ВсегоЛистовНабора = ДокументПечати.Ссылка.ЛистыНабора.Количество();
			КонецЕсли;
			ТекЛистНабора = ДокументПечати.Ссылка;
			Если ТекЛистНабора.Проведен = Ложь Тогда
				
				Возврат Неопределено;		
			КонецЕсли;
			
				
			ТабДок.Вывести(ОблШапка);		
			ОблЗаголовок = Макет.ПолучитьОбласть("заголовок");
			ТабДок.Вывести(ОблЗаголовок);
						
			ТЗ=ДокументПечати.Товары.Выгрузить();
			ТЗ.Свернуть("Номенклатура,ШКМатрицы","Количество");
			
			ТЗ.Колонки.Добавить("артикул");
			ТЗ.Колонки.Добавить("ШККонтрагента");
			
			Для каждого СтрокаТЗ Из ТЗ Цикл
				Попытка
					СтрокаТЗ.ФамилияНаменованиеТовара =  ПолучитьСвойстваНоменклатуры1(СтрокаТЗ.Номенклатура).ФамилияНаменованиеТовара.Наименование;
					сообщить(СтрокаТЗ.ФамилияНаменованиеТовара);
				Исключение КонецПопытки;
				
				Попытка
					СтрокаТЗ.ФамилияМодель = ПолучитьСвойстваНоменклатуры1(СтрокаТЗ.Номенклатура).ФамилияМодель.Наименование;
				Исключение КонецПопытки;
				
				ЗапросНов=Новый Запрос;
				ЗапросНов.Текст = "ВЫБРАТЬ
				|	МатрицаТовары.КодПроизводителяКонтрагента КАК КодПроизводителяКонтрагента,
				|	МатрицаТовары.НаименованиеКонтрагента КАК НаименованиеКонтрагента,
				|	МатрицаТовары.АртикулКонтрагента КАК АртикулКонтрагента,
				|	МатрицаТовары.КратностьКоробки КАК Кратность,
				|	МатрицаТовары.ШККонтрагента  КАК ШККонтрагента
				|ИЗ
				|	Документ.Матрица.Товары КАК МатрицаТовары
				|ГДЕ
				|	МатрицаТовары.Номенклатура = &Номенклатура
				|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
				|	И МатрицаТовары.Ссылка.Договор = &Договор
				|	И МатрицаТовары.Ссылка.Проведен
				|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата1
				|	И МатрицаТовары.Ссылка.Дата <= &Дата2
				|
				|УПОРЯДОЧИТЬ ПО
				|	МатрицаТовары.Ссылка.Дата УБЫВ
				|АВТОУПОРЯДОЧИВАНИЕ";
				ЗапросНов.УстановитьПараметр("Номенклатура",СтрокаТЗ.Номенклатура);
				ЗапросНов.УстановитьПараметр("Контрагент",Накладная.Контрагент);
				ЗапросНов.УстановитьПараметр("Договор",Накладная.Договор);
				ЗапросНов.УстановитьПараметр("Дата1",НачалоДня(ТекущаяДата()));
				ЗапросНов.УстановитьПараметр("Дата2",КонецДня(ТекущаяДата()));
				ВыборкаНов = 	ЗапросНов.Выполнить().Выбрать();
				Если ВыборкаНов.Следующий() Тогда
					
					СтрокаТЗ.ШККонтрагента = ВыборкаНов.ШККонтрагента;
					СтрокаТЗ.Артикул  = ВыборкаНов.АртикулКонтрагента;
					
				КонецЕсли;
				
			КонецЦикла;
			
			НПП = 1;
			Для Каждого СтрокаТЧ Из ТЗ Цикл
				ПараметрыСтрока = Новый Структура;
				номенклатураНаименование =СтрокаТЧ.Номенклатура.Наименование;
				НоменклатураМодель = СтрокаТЧ.Номенклатура.Родитель.Наименование;
				Если ЗначениеЗаполнено(СтрокаТЧ.ШККонтрагента) Тогда
					ШККонтрагента = СтрокаТЧ.ШККонтрагента;
				Иначе
					ШККонтрагента = СтрокаТЧ.ШКМатрицы;
				КонецЕсли;
				
				попытка
					Номенклатура = номенклатураНаименование+" "+НоменклатураМодель;
				Исключение Номенклатура  = ""; КонецПопытки;
				ПараметрыСтрока.Вставить("ШККонтрагента", ШККонтрагента);
				ПараметрыСтрока.Вставить("наименование", номенклатура);	
				ПараметрыСтрока.Вставить("количество",СтрокаТЧ.количество);
				артикул=СтрокаТЧ.Артикул;
				
				
				ПараметрыСтрока.Вставить("артикул",артикул);
								
				
				Рисунок				=ОблСтрока.Рисунки.ОбъектШКНом;
				ОбъектШК			=Рисунок.Объект;
				
				ОбъектШК.Сообщение = ШККонтрагента;
				ОблСтрока.Параметры.Нпп=НПП;//(ТекЛистНабора.Товары.Индекс(СтрокаТЧ)+1);
				НПП = НПП + 1;
				ОблСтрока.Параметры.Заполнить(ПараметрыСтрока);
				ТабДок.Вывести(ОблСтрока);
				
			КонецЦикла; 
			
			ОблИтого = Макет.ПолучитьОбласть("Итого");
			ОблИтого.Параметры.итогопостоке = ТекЛистНабора.КоличествоДокумента;
			ТабДок.Вывести(ОблИтого);
			ОблПодвал = Макет.ПолучитьОбласть("Подвал");
			ОблПодвал.Параметры.дата  = Формат(Накладная.ДатаОтгрузки,"ДФ=dd.MM.yyyy");
			ТабДок.Вывести(ОблПодвал);
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЕсли;
		
	КонецЕсли;	
	
	если МожноПечатать тогда		
		
		если ВнешнийДополнительныйТД=Неопределено тогда
			//ТабДок.Показать(ИмяПараметровПечати);
			Возврат ТабДок; 
		иначе
			
			ВнешнийДополнительныйТД.ИмяПараметровПечати = ИмяПараметровПечати;
			
			ВнешнийДополнительныйТД.Вывести(ТабДок);
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьПараметрыПечати (Накладная)
	если ложь тогда Накладная=Документы.РасходнаяНакладная.ПустаяСсылка();КонецЕсли;
	СтруктураПараметров=новый Структура;
	
	СтруктураПараметров.Вставить("СворачиватьТовары",Истина);
	СтруктураПараметров.Вставить("КолонкиГруппировки","Номенклатура");	
	СтруктураПараметров.Вставить("КолонкиСуммы","Количество");	
	СтруктураПараметров.Вставить("Макет",Неопределено);	
	СтруктураПараметров.Вставить("РаботаПоМатрица",Накладная.Контрагент.ИспользоватьНоменклатурнуюМатрицу);	
	если Накладная.контрагент.код="SSR-9059" или  Накладная.контрагент.код="SST-1208" тогда //Вайлдберриз
		попытка  
			СтруктураПараметров.Вставить("Макет",ВнешниеОбработки.Создать(Константы.КаталогВнешнихОтчетов.Получить()+"ПечатьШКWB.epf").получитьмакет("МакетНоваяКомпонента"));
			
		исключение
			возврат Неопределено;
		КонецПопытки;				
	иначе
		если Накладная.контрагент.код="SSR-5004" тогда //МАКСИМА ГРУПП
			
			попытка
				СтруктураПараметров.Вставить("Макет",ВнешниеОбработки.Создать(Константы.КаталогВнешнихОтчетов.Получить()+"ПечатьШКМГ.epf").получитьмакет("Макет"));
			исключение
				возврат Неопределено;
			КонецПопытки;				
		иначе	
			возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	возврат СтруктураПараметров;
КонецФункции

Функция ОтсканированыКоробаВЛН(Знач ДокПечати)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК КАК ТипШК
	|ИЗ
	|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	|ГДЕ
	|	ЛистНабораШтрихкодыУпаковок.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокПечати.Ссылка);
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"Документ.ЛистНабора","Документ." + ДокПечати.ссылка.Метаданные().Имя); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТипыШК = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ТипШК"); 	
	
	Если ТипыШК.Количество() > 0 
		И ТипыШК[0] = Перечисления.ТипыШтрихКодов.Коробка Тогда
		
		Возврат Истина;		
		
	КонецЕсли;
	
	Возврат Ложь; 
	
КонецФункции
//Данилова Е.В. 07.05.2026 HELP-8363 
//Данилова Е.В. 26.03.2026  SNL-153 
Процедура ПечатьЭтикеткиОнлайнНаСтрокуКороба(СтрТЗ,ДопПараметрыПечати,ДокументПечати, Макет,Докоснование,КодАгрегации = неопределено,ШтрихКодЭтикетки = неопределено)
	КодКонтрагента 						=	ДопПараметрыПечати.КодКонтрагента; 
	КодКонтрагентаРодителя 				=	ДопПараметрыПечати.КодКонтрагентаРодителя;
	КолКоробок 							= 	ДопПараметрыПечати.КолКоробок;
	МожноВыводитьОбщееКоличествоМест 	= 	ДопПараметрыПечати.МожноВыводитьОбщееКоличествоМест;
	НаборПолей							= 	ДопПараметрыПечати.НаборПолей;
	НужноОбрезать 						= 	ДопПараметрыПечати.НужноОбрезать;
	ТабДок 								= 	ДопПараметрыПечати.ТабДок;
	ТребуетсяАгрегацияКоробок 			=	ДопПараметрыПечати.ТребуетсяАгрегацияКоробок;              
	
	ОбработкаПечати						= 	ДопПараметрыПечати.ОбработкаПечати;
	Лист								=	ДокументПечати.Ссылка;
	
	//Если СтруктураДанныхКомпонентыПечати=Неопределено тогда   
	ОбработкаФормированияКартинки=Обработки.СформироватьКартинкуКодаШКQR.Создать();
	СтруктураДанныхКомпонентыПечати=ОбработкаФормированияКартинки.ПолучитьКомпонентуФормированияDataMatrixКода();	
	если не СтруктураДанныхКомпонентыПечати.Успех тогда 
		Сообщить(СтруктураДанныхКомпонентыПечати.Ошибки);
		возврат;
	КонецЕсли;      
	//КонецЕсли; 	
	
	если   ТребуетсяАгрегацияКоробок  тогда
		ОблЭтикетка=Макет.ПолучитьОбласть("Строка|Этикетка"); 
		ПечататьCode128ДляАгрегаций 		= 	ДопПараметрыПечати.ПечататьCode128ДляАгрегаций;  
	иначе 
		ОблЭтикетка=Макет.ПолучитьОбласть("СтрокаQR|Этикетка");
		ПечататьCode128ДляАгрегаций 		= 	ложь;  
	КонецЕсли;  
	
	
	если   ТребуетсяАгрегацияКоробок тогда
		ИмяОбластиНоменклатура =  "ОбластьНоменклатура";
		ИмяОбластиКороба =  "ОбластьКороба";
	иначе 
		ИмяОбластиНоменклатура =  "ОбластьНоменклатураQR"; 
		ИмяОбластиКороба =  "ОбластьКоробаQR";
	КонецЕсли;
	
	если не ТребуетсяАгрегацияКоробок тогда
		попытка
			Рисунок=ОблЭтикетка.Рисунки.QRКод;     
		Исключение  
			СообщитьИзМодуля("В области макета не обнаружено рисунка с именем QRКод");
			возврат;
		КонецПопытки;    	 
	иначе
		попытка
			Рисунок=ОблЭтикетка.Рисунки.ШтрихКод;     
		Исключение  
			СообщитьИзМодуля("В области макета не обнаружено рисунка с именем ШтрихКод");
			возврат;
		КонецПопытки;    
	КонецЕсли; 	          
	
	
	если ТипЗнч(СтрТЗ.номенклатура)=Тип("СправочникСсылка.Номенклатура") тогда
		если ЗначениеЗаполнено(СтрТЗ.ШтукВКоробке) тогда
			ШтукВКоробе=СтрТЗ.ШтукВКоробке;
		иначе
			ШтукВКоробе=СтрТЗ.номенклатура.родитель.ШтукВКоробке;
		КонецЕсли;		 
		если ШтукВКоробе>0 тогда
			НаборПолей.Вставить("ШтукВЛН"," - "+ШтукВКоробе+"шт.");	
		КонецЕсли;
	КонецЕсли;		         
	
	
	ДопПараметры = новый Структура;
	
	если не ТребуетсяАгрегацияКоробок тогда  
		
		КодЭтикетки	=  ЗакодироватьЛистИКоробкуВСтроку(Лист,СтрТЗ.НомерКоробки);
		// Кухарь А.Ю.  29.07.2025 начало
		ДопПараметры.Вставить("ТипКода",16);
		// Кухарь А.Ю.  29.07.2025 конец
		
		КартинкаКода=ОбработкаФормированияКартинки.СформироватьКартинкуШК_DataMatrix(СтруктураДанныхКомпонентыПечати,КодЭтикетки,ДопПараметры);  
		Рисунок.Картинка=КартинкаКода;      
		НаборПолей.Вставить("ШтрихКод",КодЭтикетки);
		//++Данилова Е.В. 07.05.2026 HELP-8363 
		ШтрихКодЭтикетки = КодЭтикетки; 
		//--Данилова Е.В. 07.05.2026 
	иначе
		//++Данилова Е.В. 26.03.2026  SNL-153 
		Если Не ЗначениеЗаполнено(КодАгрегации) Тогда 
			КодАгрегации=ПолучитьРеквизитШапки(Лист,"КодАгрегации","Документ"); 
		КонецЕсли;
		//--Данилова Е.В. 26.03.2026 
		Если ПечататьCode128ДляАгрегаций Тогда 
			ДопПараметры.Вставить("АгрегацииВCode128",ПечататьCode128ДляАгрегаций);
		иначе
			ДопПараметры.Вставить("ДобавлятьСкобочкиВТекст",Истина); 
		КонецЕсли;		 
		ДопПараметры.Вставить("НужнаТолькоКартинка",Истина);   
		ДопПараметры.Вставить("ОтображатьТекст",ложь); 
		ДопПараметры.Вставить("ВысотаРисунка",Рисунок.Высота);
		ДопПараметры.Вставить("ШиринаРисунка",Рисунок.Ширина);		 
		Рисунок.Картинка = ОбработкаПечати.СформироватьКА(Макет, ПолучитьРеквизитШапки(КодАгрегации,"Наименование","справочник"), 0, 0, ДопПараметры);  
		
		ПрефиксКодаАгрегации="";	
		если  ДопПараметры.Свойство("ДобавлятьСкобочкиВТекст") тогда
			если ДопПараметры.ДобавлятьСкобочкиВТекст=Истина тогда
				ПрефиксКодаАгрегации="(00)";		
			КонецЕсли;
		КонецЕсли;
		НаборПолей.вставить("ШтрихКод",ПрефиксКодаАгрегации+КодАгрегации);
		//++Данилова Е.В. 07.05.2026 HELP-8363 
		ШтрихКодЭтикетки = КодАгрегации; 
		//--Данилова Е.В. 07.05.2026
	КонецЕсли;
	
	ОблЭтикетка.Параметры.Заполнить(НаборПолей);	 	    	
	ОблЭтикетка.Параметры.номенклатура=СтрТЗ.номенклатура;  	
	
	попытка
		если СтрДлина(ОблЭтикетка.Параметры.Номенклатура)>48 и НужноОбрезать тогда
			ОблЭтикетка.Параметры.Номенклатура=СтрЗаменить(ОблЭтикетка.Параметры.Номенклатура,"АРТ:","");
		КонецЕсли;
	Исключение
	КонецПопытки; 
	
	ОбластьНоменклатура=ОблЭтикетка.Области.Найти(ИмяОбластиНоменклатура); 
	если ОбластьНоменклатура<>Неопределено тогда
		если СтрДлина(ОблЭтикетка.Параметры.Номенклатура)>70 тогда
			ОбластьНоменклатура.шрифт=Новый Шрифт(ОбластьНоменклатура.шрифт,,5);
		иначеесли СтрДлина(ОблЭтикетка.Параметры.Номенклатура)>50 тогда
			ОбластьНоменклатура.шрифт=Новый Шрифт(ОбластьНоменклатура.шрифт,,6);
		иначеесли СтрДлина(ОблЭтикетка.Параметры.Номенклатура)>40 тогда
			ОбластьНоменклатура.шрифт=Новый Шрифт(ОбластьНоменклатура.шрифт,,7);
		КонецЕсли;
	КонецЕсли;         
	
	ОблЭтикетка.Параметры.НомерКороба=СтрТЗ.НомерКоробки;			
	
	ОбластьКороба=ОблЭтикетка.Области.Найти(ИмяОбластиКороба); 
	
	если МожноВыводитьОбщееКоличествоМест и облЭтикетка.Параметры.НомерКороба=КолКоробок  тогда			
		ОблЭтикетка.Параметры.ВсегоКоробов=КолКоробок;
	иначе       
		если ОбластьКороба<>Неопределено тогда
			ОбластьКороба.Текст=СтрЗаменить(ОбластьКороба.Текст,"из","");         
		КонецЕсли;
	КонецЕсли;
	
	
	Если КодКонтрагента = "EKF-0301" или КодКонтрагента = "SSR-1593" или КодКонтрагентаРодителя="SSR-7156" тогда	
		АдресИзРегистра=ПрочитатьЗначениеРеквизитаПНКПРМРНК("АдресДляЭтикетки",ДокОснование);
		если ЗначениеЗаполнено(АдресИзРегистра) тогда
			ОблЭтикетка.Параметры.АД=АдресИзРегистра;
		КонецЕсли;
		ОблЭтикетка.Параметры.НомерЗаказаЭтикетка=ДокОснование.НомерЗаказа;
		ОблЭтикетка.Параметры.Регион="";
		// Кухарь А.Ю.  11.06.2025 начало
		//ОблЭтикетка.Область("ГородЗаголовок").Текст="Заказ №";
		если ДопПараметрыПечати.ТребуетсяАгрегацияКоробок тогда 
			ОблЭтикетка.Область("ГородЗаголовок").Текст="Заказ №";
		иначе
			ОблЭтикетка.Область("ГородЗаголовок1").Текст="Заказ №";
		КонецЕсли;		 
		// Кухарь А.Ю.  11.06.2025 конец
		
	КонецЕсли;   
	
	ТабДок.Вывести(ОблЭтикетка);
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	
КонецПроцедуры

Функция НапечататьДополнительнуюЭтикеткуПоВБПоНесколькимТоварам(ПараметрыПечати,ДокОснование,докПечати,ДопПараметрыНакладной)
	
	Макет = ПараметрыПечати.Макет;
	
	ТабДокумент = Новый ТабличныйДокумент; 
	
	Для каждого СтрокаТовара Из докПечати.Товары Цикл  	
		
		СтрШК = ШКпоИндексуТекЛН(ДокОснование,СтрокаТовара.Номенклатура,ДопПараметрыНакладной,ДокПечати); 
		
		Если СтрШК = неопределено  Тогда
			
			Возврат неопределено; 	
			
		КонецЕсли;
		
		ОблЭтикетка = Макет.получитьобласть("Номенклатура");
		ОблЭтикетка.Параметры.Номенклатура = СтрокаТовара.Номенклатура;
		
		ТабДокумент.Вывести(ОблЭтикетка);
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ОблЭтикетка = Макет.получитьобласть("Этикетка"); 
		
		ОбработкаПечати = Обработки.ПечатьЭтикетокЧЗ.Создать();
		Для Каждого Рисунок Из ОблЭтикетка.Рисунки Цикл
			ДопПараметры = Новый Структура; 
			ДопПараметры.Вставить("НужнаТолькоКартинка",истина);
			ДопПараметры.Вставить("ОтображатьТекст",ложь); 
			ДопПараметры.Вставить("ВысотаРисунка",Рисунок.Высота);
			ДопПараметры.Вставить("ШиринаРисунка",Рисунок.Ширина);  
			// Кухарь А.Ю.  22.07.2025 начало
			если не ДопПараметры.Свойство("БезПрефикса") тогда
				ДопПараметры.Вставить("БезПрефикса", Истина);
			иначе
				ДопПараметры.БезПрефикса = Истина;
			КонецЕсли;
			// Кухарь А.Ю.  22.07.2025 конец
			
			КартинкаКода= ОбработкаПечати.СформироватьКА(Макет,СтрШК.ШтрихКод,,,,ДопПараметры); 
			Рисунок.Картинка=КартинкаКода;
			ОблЭтикетка.Параметры.СтараяНоменклатура = СтрШК.ШтрихКод;
		КонецЦикла;
		ТабДокумент.Вывести(ОблЭтикетка);
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецЦикла;
	
	Возврат ТабДокумент; 
	
	
КонецФункции // НапечататьДополнительнуюЭтикеткуПоВБПоНесколькимТоварам() 

Функция ШКпоИндексуТекЛН(Накладная,Номенклатура,ДопПараметрыНакладной,ДокПечати)  Экспорт
	
	Запрос=Новый запрос;
	запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеквизитыТЧ_Товары_РНКПНКПРМ.ЗначениеРеквизита КАК ШтрихКод,
	|	РеквизитыТЧ_Товары_РНКПНКПРМ.ИмяРеквизита КАК ИмяРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыТЧ_Товары_РНКПНКПРМ КАК РеквизитыТЧ_Товары_РНКПНКПРМ
	|ГДЕ
	|	РеквизитыТЧ_Товары_РНКПНКПРМ.Документ = &Документ
	|	И РеквизитыТЧ_Товары_РНКПНКПРМ.Номенклатура = &Номенклатура
	|	И РеквизитыТЧ_Товары_РНКПНКПРМ.ИмяРеквизита ПОДОБНО &ИмяРеквизита
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИмяРеквизита";
	Запрос.УстановитьПараметр("Документ",Накладная);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ИмяРеквизита","Код артикула%");
	ТаблицаШК=запрос.Выполнить().Выгрузить();
	Если ТаблицаШК.Количество()=0 тогда
		// Кухарь А.Ю. 23.08.2021 начало
		// Для ФБО вайлдберриса
		если ДопПараметрыНакладной.имя<>"WB_FBS" тогда
			Сообщить("нет ШК WB, обратитесь к менеджеру");
		КонецЕсли;
		// Кухарь А.Ю. 23.08.2021 конец
		
		Возврат неопределено;
	КонецЕсли;
	
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ различные
	|	ЛистНабораТовары.Ссылка КАК ЛН
	|ИЗ
	|	Документ.ЛистНабора.Товары КАК ЛистНабораТовары
	|ГДЕ
	|	ЛистНабораТовары.Ссылка.Дата >= &Дата
	|	И ЛистНабораТовары.Ссылка.Проведен
	|	И ЛистНабораТовары.Номенклатура = &Номенклатура
	|	И ЛистНабораТовары.Ссылка.ДокОснование = &Накладная
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛистНабораТовары.Ссылка.Дата";
	запрос.УстановитьПараметр("Дата",ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования()-30*24*3600);
	запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	запрос.УстановитьПараметр("Накладная",Накладная);
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"Документ.ЛистНабора","Документ." + ДокПечати.ссылка.Метаданные().Имя);
	ТаблицаЛН=запрос.Выполнить().Выгрузить();
	Если ТаблицаЛН.Количество()>ТаблицаШК.Количество() тогда  //Значит что-то не распределили или ещё какая-нибудь шляпа.
		Сообщить("Ошибка распределения ШК вайлдберрис. Проверьте этикетки на все короба.");
		возврат неопределено;
	КонецЕсли;
	
	
	ИндексТекЛН=ТаблицаЛН.Индекс(ТаблицаЛН.Найти(ДокПечати.Ссылка)); 
	
	СтрШК = ТаблицаШК.Получить(ИндексТекЛН);
	
	Возврат  СтрШК; 
	
	
КонецФункции // ИндексТекЛН()

Функция ПолучитьСвойстваНоменклатуры1(Номенклатура) Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЗначенияСвойствОбъектов.Объект = &Брэнд
	|			ТОГДА 1
	|		КОГДА ЗначенияСвойствОбъектов.Объект = &Модель
	|			ТОГДА 2
	|		КОГДА ЗначенияСвойствОбъектов.Объект = &Номенклатура
	|			ТОГДА 3
	|		ИНАЧЕ 4
	|	КОНЕЦ КАК Уровень,
	|	ЗначенияСвойствОбъектов.Свойство,
	|	ЗначенияСвойствОбъектов.Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	(ЗначенияСвойствОбъектов.Объект = &Модель
	|			ИЛИ ЗначенияСвойствОбъектов.Объект = &Брэнд
	|			ИЛИ ЗначенияСвойствОбъектов.Объект = &Номенклатура)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Уровень,
	|	ЗначенияСвойствОбъектов.Объект";	
	
	Свойства=Новый Структура;
	
	Запрос.УстановитьПараметр("Модель",Номенклатура.Родитель);
	Запрос.УстановитьПараметр("Брэнд",Номенклатура.Родитель.родитель);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			КодСвойства=СтрЗаменить(Выборка.Свойство,"""","");	
			КодСвойства=СтрЗаменить(Выборка.Свойство," ","");
			
			Свойства.Вставить(КодСвойства,Выборка.Значение);		
		Исключение
			Сообщить("Ошибочное свойство: "+Выборка.Свойство);
		КонецПопытки;		
	КонецЦикла;	
	
	Возврат Свойства;
КонецФункции
 
 Функция СформироватьКодАгрегацииНаКоробку(Знач КодАгрегации, ДокументПечатиОбъект,ДокОснование,Форма,ПравилаРаботыСАгрегациейЧЗ) 
	если ЗначениеЗаполнено(КодАгрегации) тогда
		возврат Истина;
	КонецЕсли; 
	
	ВидДокументаОснования =	ДокОснование.Метаданные().Имя;
	
	ВидДокументаПечати 	= ДокументПечатиОбъект.ссылка.Метаданные().Имя; 
	ТипШК 				=  ДокументПечатиОбъект.ТипШК; 
		
	если ДокументПечатиОбъект.ШтрихкодыКоробокДляАгрегации.Количество()> 0 тогда
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ
		|	ТЧ.ИсходныйКодКоробки КАК ИсходныйКодКоробки
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТЧ КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.ИсходныйКодКоробки.Ссылка КАК ИсходныйКодКоробкиСсылка
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	ВТ.ИсходныйКодКоробки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)";
		запрос.УстановитьПараметр("ТЧ",ДокументПечатиОбъект.ШтрихкодыКоробокДляАгрегации.Выгрузить());
		Выборка = запрос.Выполнить().Выбрать();
		пока выборка.Следующий() цикл
			возврат Истина;
		КонецЦикла;
	КонецЕсли;
	
	если ВидДокументаПечати = "ЛистНабора" 
		И ЕстьЛПСАгрегацией(ДокОснование) тогда
		Сообщить("Агрегация начата в листах переукладки");
		возврат ложь;
	КонецЕсли;
	
	если ВидДокументаОснования <> "РасходнаяНакладная"		
		И НЕ РазрешенаПечатьАгрегатаПоПНК(ТипШК,ВидДокументаОснования,ДокОснование) тогда 		 
		 
		Сообщить("Код агрегации печатается только для РНК и для ПНК Закупка Р");
		Возврат ложь;
	КонецЕсли;
	
	АгрегацияБудетВЛистахПереукладки=ОбщегоНазначения_ПИ.ПланируетсяРаботаСАгрегациейЧЗвЛП(ДокОснование);         
	Если ВидДокументаПечати = "ЛистНабора" 
		И АгрегацияБудетВЛистахПереукладки тогда
		Сообщить("Агрегацию требуется нужно выполнить по коробам, сформированных листами переукладки");
		Возврат ложь;
	КонецЕсли;
	
	если ТипШК<>Перечисления.ТипыШтрихКодов.Коробка тогда
		ШтукЧЗВКоробке = ДокументПечатиОбъект.ШтрихкодыУпаковок.Количество();
		если ШтукЧЗВКоробке=0 тогда
			Сообщить("В ЛН отсутствуют коды ЧЗ, агрегация не требуется");
			Возврат ложь;
		КонецЕсли; 		
	КонецЕсли;  
	
	если  ДокументПечатиОбъект.ШтрихкодыУпаковок.Количество()= 0 тогда
		Сообщить("Нет ни одного отсканированного кода ЧЗ в ЛН. Нечего агрегировать");
		Возврат ложь;
	КонецЕсли;
	
	если не ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияКоробок
		И НЕ РазрешенаПечатьАгрегатаПоПНК(ТипШК,ВидДокументаОснования,ДокОснование) тогда  	
		Сообщить("В правилах агрегации не указано, что требуются коробки");
		Возврат ложь
	КонецЕсли; 
	
	ТЗТовары = ДокументПечатиОбъект.товары.Выгрузить(,"Номенклатура");
	ТЗТовары.Свернуть("Номенклатура");
	если ТЗТовары.Количество()>1 тогда 
		ТипУпаковки=Перечисления.ТипыУпаковок.МультитоварнаяУпаковка;
	иначе	
		ТипУпаковки=Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
	КонецЕсли;	
	 
	если  ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияБлочков тогда
		 
		РезультатПроверкиКодов = ПроверитьОтсканированныеКодыДляАгрегПоБлочкам(ДокументПечатиОбъект.ШтрихкодыУпаковок,ТипШК);
		
		Если НЕ РезультатПроверкиКодов Тогда
			
			Возврат ЛОЖЬ; 	
			
		КонецЕсли;
	КонецЕсли;

	если КодАгрегации=Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка() тогда   	
		 
		ДокументПечатиОбъект.ТребуетПроверки=Истина;	
		ДокументПечатиОбъект.Проведен = Истина; 
		 
		если не Форма.Модифицированность() тогда
			если не ДокументПечатиОбъект.ДополнительныеСвойства.Свойство("УпрощенныйРежим") тогда
				ДокументПечатиОбъект.ДополнительныеСвойства.Вставить("УпрощенныйРежим",Истина);
			иначе
				ДокументПечатиОбъект.ДополнительныеСвойства.УпрощенныйРежим=Истина;
			КонецЕсли;
		КонецЕсли;
		Форма.ЗаписатьВФорме();	 	
		
		РезультатПроверкиАгрегатов = Истина; 
		ФормироватьКодАгрегацииНовый = Ложь; 
		ДокументПечатиОбъект.КодАгрегации = ОтработатьПечатьКодаАгрегацииПоАгрегатам(РезультатПроверкиАгрегатов,
		ФормироватьКодАгрегацииНовый,ДокОснование,ТипШК,ПравилаРаботыСАгрегациейЧЗ, ДокументПечатиОбъект); 
		
		Если НЕ РезультатПроверкиАгрегатов Тогда
			
			Возврат Ложь; 	
			
		КонецЕсли; 
		
		если НЕ ЗначениеЗаполнено(ДокументПечатиОбъект.КодАгрегации) 
			И НЕ ФормироватьКодАгрегацииНовый 
			И Маркировка_ПИ.ЕстьПредварительноСозданыйАгрегат(ДокОснование) тогда
			
			
			Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
			
			рБронирования= Документы.МаркировкаТоваровИСМП.ПолучитьРанееЗабронированныйКодАгрегацииДляЛиста(ДокументПечатиОбъект.ссылка,ДокОснование, Перечисления.ТипыШтрихКодов.Коробка);
			
			
			ВремяВыполнения = (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000;
			ЗаписатьВЛог("Мониторинг СтатусыКМ_Факт", "Документы.МаркировкаТоваровИСМП.ПолучитьРанееЗабронированныйКодАгрегацииДляЛиста (ЛН)", , , , ВремяВыполнения);
			
			
			Если рБронирования.Успешно тогда			
				ПолучаемыйКодАгрегации = рБронирования.Данные[0];
				запрос=новый запрос;
				запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
				|	ЛистНабора.КодАгрегации КАК КодАгрегации,
				|	ЛистНабора.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.ЛистНабора КАК ЛистНабора
				|ГДЕ
				|	ЛистНабора.Проведен
				|	И ЛистНабора.КодАгрегации = &КодАгрегации
				|	И ЛистНабора.Ссылка <> &Ссылка";
				запрос.УстановитьПараметр("КодАгрегации",ПолучаемыйКодАгрегации);
				запрос.УстановитьПараметр("Ссылка",ДокументПечатиОбъект.ссылка);
				Выборка=запрос.Выполнить().Выбрать();
				пока выборка.Следующий() Цикл 
					Сообщить(СтрШаблон("Обнаружен дубль кода %1 в %2",ПолучаемыйКодАгрегации,выборка.ссылка));
					Возврат ложь;	
				КонецЦикла;
				ДокументПечатиОбъект.КодАгрегации=ПолучаемыйКодАгрегации;
				попытка
					
					если не ДокументПечатиОбъект.ДополнительныеСвойства.Свойство("УпрощенныйРежим") тогда
						ДокументПечатиОбъект.ДополнительныеСвойства.Вставить("УпрощенныйРежим",Истина);
					иначе
						ДокументПечатиОбъект.ДополнительныеСвойства.УпрощенныйРежим=Истина;
					КонецЕсли;
					
					Форма.ЗаписатьВФорме();	
					
					ДокументПечатиОбъект.ДополнительныеСвойства.УпрощенныйРежим=ложь;
					
					
				Исключение     
					ДокументПечатиОбъект.КодАгрегации=Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка();
				КонецПопытки;
			Иначе
				МаркировкаКС.ВывестиОшибки(рБронирования);			
			КонецЕсли;
		КонецЕсли;
		
		
		если ДокументПечатиОбъект.КодАгрегации=Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка() тогда
			// Кухарь А.Ю.  02.04.2025 конец
			
			Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
			
			рБронирования = Документы.МаркировкаТоваровИСМП.ПолучитьЗабронироватьКодАгрегацииДляЛН(ДокументПечатиОбъект.ссылка, Перечисления.ТипыШтрихКодов.Коробка,ТипУпаковки);
			
			ВремяВыполнения = (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000;
			ЗаписатьВЛог("Мониторинг СтатусыКМ_Факт", "Документы.МаркировкаТоваровИСМП.ПолучитьЗабронироватьКодАгрегацииДляЛН (ЛН)", , , , ВремяВыполнения);
			
			Если рБронирования.Успешно тогда			
				ПолучаемыйКодАгрегации = рБронирования.Данные;
				запрос=новый запрос;
				запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
				|	ЛистНабора.КодАгрегации КАК КодАгрегации,
				|	ЛистНабора.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.ЛистНабора КАК ЛистНабора
				|ГДЕ
				|	ЛистНабора.Проведен
				|	И ЛистНабора.КодАгрегации = &КодАгрегации
				|	И ЛистНабора.Ссылка <> &Ссылка";
				запрос.УстановитьПараметр("КодАгрегации",ПолучаемыйКодАгрегации);
				запрос.УстановитьПараметр("Ссылка",ДокументПечатиОбъект.ссылка);
				Выборка=запрос.Выполнить().Выбрать();
				пока выборка.Следующий() Цикл 
					Сообщить(СтрШаблон("Обнаружен дубль кода %1 в %2",ПолучаемыйКодАгрегации,выборка.ссылка));
					Возврат ложь;	
				КонецЦикла;
				ДокументПечатиОбъект.КодАгрегации=ПолучаемыйКодАгрегации;
				попытка
					
					если не ДокументПечатиОбъект.ДополнительныеСвойства.Свойство("УпрощенныйРежим") тогда
						ДокументПечатиОбъект.ДополнительныеСвойства.Вставить("УпрощенныйРежим",Истина);
					иначе
						ДокументПечатиОбъект.ДополнительныеСвойства.УпрощенныйРежим=Истина;
					КонецЕсли;
					
					Форма.ЗаписатьВФорме();	
					
					ДокументПечатиОбъект.ДополнительныеСвойства.УпрощенныйРежим=ложь;
					
					
				Исключение     
					ДокументПечатиОбъект.КодАгрегации=Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка();
				КонецПопытки;
			Иначе
				МаркировкаКС.ВывестиОшибки(рБронирования);	
				возврат Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		
	КонецЕсли;	
	
	
	возврат Истина;
КонецФункции

Функция ПроверитьОтсканированныеКодыДляАгрегПоБлочкам(ШтрихкодыУпаковок,ТипШК)
	
	Если НЕ ПроверитьОтсканированныеШКПоТипамШК(ШтрихкодыУпаковок,ТИпШК) Тогда
		
		Возврат ЛОЖЬ; 
		
	Конецесли;
	
	Если ШтрихкодыУпаковок.Количество() = 0 Тогда
		
		Возврат ЛОЖЬ; 	
		
	КонецЕсли; 
	
	ТипШК = ШтрихкодыУпаковок[0].ШтрихкодУпаковки.ТипШК; 
	
	Если ТипШК = Перечисления.ТипыШтрихКодов.Штука Тогда
		
		МассивПустыхБлочков=ШтрихкодыУпаковок.НайтиСтроки(новый Структура("ШтрихкодБлочка",Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка()));
		если МассивПустыхБлочков.Количество()>0 тогда
			Сообщить("Закончите печать кодов на блочок.");
			Возврат ложь;
		КонецЕсли;
		
	ИначеЕсли  ТипШК = Перечисления.ТипыШтрихКодов.Блочок Тогда 
		Возврат Истина; 
	Иначе
		Сообщить("Печать кода коробки или по блочкам или по штукам.");
		Возврат Ложь; 
	КонецЕсли;
	
	Возврат истина; 
	
КонецФункции

Функция ПроверитьОтсканированныеШКПоТипамШК(ШтрихкодыУпаковок,ТипШК)
	
	ТипыШтрихСоответств = Новый Соответствие; 
	Для каждого СтрокаШК из ШтрихкодыУпаковок цикл
		ТипыШтрихСоответств.Вставить(СтрокаШК.ШтрихкодУпаковки.ТипШК,истина); 			
	КонецЦикла;
	Если ТипыШтрихСоответств.Количество() > 0  
		И ТипыШтрихСоответств.Получить(ТипШК)  = неопределено Тогда 
		Сообщить("В документе присутствуют уже коды с другим типом ШК!! - " + Строка(ШтрихкодыУпаковок[0].ШтрихкодУпаковки.ТипШК));
		
		Возврат Ложь; 
		
	КонецЕсли;
	
	Возврат Истина; 
	
	
КонецФункции

Функция РазрешенаПечатьАгрегатаПоПНК(ТипШК,ВидДокументаОснования,ДокОснование)
	
	РазрешенаПечать = 
	ТипШК <> перечисления.ТипыШтрихКодов.Коробка
	И ВидДокументаОснования = "ПриходнаяНакладная" 
	И  ПолучитьРеквизитШапки(ДокОснование,"КодОперации","Документ") = Перечисления.КодыОперацийОстатки.ЗакупкаР; 
	
    Возврат РазрешенаПечать; 
КонецФункции

Функция ОтработатьПечатьКодаАгрегацииПоАгрегатам(РезультатПроверкиПоАгрегатам,ФормироватьКодАгрегата,ДокОснование,ТипШК,ПравилаРаботыСАгрегациейЧЗ, Докпечати)
	ВидДокументаОснования = ДокОснование.Метаданные().Имя; 
	
	Если НЕ ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияКоробок 
		
		И НЕ РазрешенаПечатьАгрегатаПоПНК(ТипШК,ВидДокументаОснования,ДокОснование) тогда 
		
		Сообщить("В правилах агрегации не указано, что требуются коробки");
		
		РезультатПроверкиПоАгрегатам = Ложь;
		
		Возврат Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка(); 
		
	КонецЕсли;
	
	ТипыШтрихСоответств = Новый Соответствие; 
	Для каждого СтрокаШК из Докпечати.ШтрихкодыУпаковок цикл
		ТипыШтрихСоответств.Вставить(СтрокаШК.ШтрихкодУпаковки.ТипШК,истина); 			
	КонецЦикла; 
	
	Если ТипыШтрихСоответств.Получить(Перечисления.ТипыШтрихКодов.Коробка) <> неопределено Тогда 
		
		Если  ДокПечати.ШтрихкодыУпаковок.Количество()  > 1 тогда
			
			Сообщить("Для печати кода агрегации по коробке может быть отсканирована только одна коробка!!!"); 
			
			РезультатПроверкиПоАгрегатам = Ложь; 
			
			Возврат Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка(); 
			
		Иначе 
			
			ФормироватьКодАгрегата = истина;
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СтатусыКМ_ФактСрезПоследних.ШтрихКодУпаковки КАК ШтрихКодУпаковки
			|ИЗ
			|	РегистрСведений.СтатусыКМ_Факт.СрезПоследних(, ШтрихКодУпаковки в (&ШК)) КАК СтатусыКМ_ФактСрезПоследних
			|ГДЕ
			|	СтатусыКМ_ФактСрезПоследних.Статус В(&Статусы)";
			
			СтатусыМассив = Новый Массив; 
			СтатусыМассив.Добавить(Перечисления.СтатусыКодовМаркировкиФакт.ВОбороте);
			СтатусыМассив.Добавить(Перечисления.СтатусыКодовМаркировкиФакт.Нанесен);
			Запрос.УстановитьПараметр("ШК", Докпечати.ШтрихкодыУпаковок[0].ШтрихкодУпаковки);
			Запрос.УстановитьПараметр("Статусы",СтатусыМассив);  
			РезультатЗапроса = Запрос.Выполнить();
			
			Если НЕ РезультатЗапроса.Пустой() Тогда
				
				Возврат Докпечати.ШтрихкодыУпаковок[0].ШтрихкодУпаковки; 
			Иначе 
				
				Сообщить("Отсканированный код не в обороте, будет сформирован новый агрегационный код");
				Возврат Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка(); 
			КонецЕсли;	
			
		КонецЕсли; 
	Иначе 
		РезультатПроверкиПоАгрегатам = Истина;
		//++Данилова Е.В. 15.06.2026 0000001470
		Возврат Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка();
		//--Данилова Е.В. 15.06.2026 
	КонецЕсли; 
	
	
КонецФункции
 
Функция ЭтикеткаОнлайнСтарая(ДокументПечатиОбъект, Форма, ДопПараметры,ВнешнийТД = Неопределено,ВнешнийДополнительныйТД = Неопределено) экспорт
	ВидДокументаПечати =  ДокументПечатиОбъект.ссылка.Метаданные().Имя;
	если не ДокументПечатиОбъект.ЭтоНовый() тогда
		если ВидДокументаПечати = "ЛистНабора"
			И ПолучитьРеквизитШапки(ДокументПечатиОбъект.Ссылка,"ШКЛистаНабора","Документ")="" и ДокументПечатиОбъект.ШКЛистаНабора<>"" тогда
			Форма.ЗаписатьВФорме();
		КонецЕсли;
		если ВидДокументаПечати = "ЛистПереукладки"
			И ПолучитьРеквизитШапки(ДокументПечатиОбъект.Ссылка,"ШтрихКод","Документ")="" и ДокументПечатиОбъект.штрихкод<>"" тогда
			Форма.ЗаписатьВФорме();
		КонецЕсли;
	КонецЕсли;
	
	КодАгрегации 				= ДопПараметры.КодАгрегации;
	//ВнешнийТД					= ДопПараметры.ВнешнийТД;
	ЭтоУзел_Склад 				= ДопПараметры.ЭтоУзел_Склад;
	ДопПараметрыНакладной 		= ДопПараметры.ДопПараметрыНакладной;
	КоличествоЕдиниц 			= ДопПараметры.КоличествоЕдиниц;
	ПравилаРаботыСАгрегациейЧЗ 	= ДопПараметры.ПравилаРаботыСАгрегациейЧЗ;
	//КоличествоЕдиниц 			= ДопПараметры.КоличествоЕдиниц; 
	СтруктураРезультат = Новый Структура("Успех,ТабДокумент,ТабДокументДоп,ЗаменятьЭтикеткуОнлайн,Ошибки,СтараяЭтикеткаОнлайн",
	Ложь,Новый ТабличныйДокумент,Неопределено,ложь,Новый Массив,Ложь); 
	
	ДокОснование = ДокументПечатиОбъект.ДокОснование; 
	МетаДок						=	ДокОснование.Метаданные();	
	ВидДокументаОснования		=	МетаДок.Имя; 
	
	 
	
	
	КодКонтрагента=ДокОснование.Контрагент.Код; 
	КодКонтрагентаРодителя=ДокОснование.Контрагент.Родитель.Код;
	//  
	ТипШК = ДокументПечатиОбъект.ТипШК; 
	если ВнешнийТД=Неопределено тогда 
			
		Если  ЭтоУзел_Склад и ПараметрыСеанса.ЭтотУзел.Код<>"RI2" и (ВидДокументаОснования="РасходнаяНакладная" или ВидДокументаОснования="Перемещение") тогда	
			// Кухарь А.Ю. 12.10.2021 начало
			//  У некоторых количество единиц в целях ускорения решили не контролировать
			если ДопПараметрыНакладной<>Неопределено и ДопПараметрыНакладной.НеКонтролироватьКоличествоЕдиниц тогда 
			иначе
				// Кухарь А.Ю. 12.10.2021 конец
				
				Если ТипШК=Перечисления.ТипыШтрихКодов.Коробка
					И ВидДокументаПечати = "ЛистНабора" тогда
					ТекКоличествоКоробок=0;	
					Для Каждого СтрокаТз из ДокументПечатиОбъект.Товары цикл
						ТекКоличествоКоробок=ТекКоличествоКоробок+?(СтрокаТЗ.ШтВКоробе=0,СтрокаТз.Количество,СтрокаТз.Количество/СтрокаТз.ШтВКоробе);
					Конеццикла;			
					
					Если КоличествоЕдиниц<>ТекКоличествоКоробок тогда 
						//++Данилова Е.В. 19.03.2026 без задачи 
						//Предупреждение("Не совпало расчётное количество единиц с фактическим"); 
						Сообщить("Не совпало расчётное количество единиц с фактическим");
						//--Данилова Е.В. 19.03.2026 
						Возврат СтруктураРезультат;
					КонецЕсли;			
				Иначе
					Если ВидДокументаПечати = "ЛистНабора" 
						И КоличествоЕдиниц<>ДокументПечатиОбъект.Товары.Итог("Количество") тогда
						//++Данилова Е.В. 19.03.2026 без задачи
						//Предупреждение("Не совпало расчётное количество единиц с фактическим"); 
						Сообщить("Не совпало расчётное количество единиц с фактическим"); 
						//--Данилова Е.В. 19.03.2026
						Возврат СтруктураРезультат;
					КонецЕсли;
				КонецЕсли;
				
				
			КонецЕсли; 
			
			//++Данилова Е.В. 04.03.2026 SNL-153
			Если ВидДокументаПечати = "ЛистПереукладки" Тогда 
				РезультатПроверки = ДокументПечатиОбъект.СверитьКолШтВКоробке();
				Если НЕ РезультатПроверки.Успешно Тогда			
					Для каждого СтрПроверки Из РезультатПроверки.ошибки Цикл
						
						СтруктураРезультат.Ошибки.Добавить(СтрПроверки); 	
						
					КонецЦикла; 
					Возврат СтруктураРезультат;  
				КонецЕсли;
			КонецЕсли;
			//--Данилова Е.В. 04.03.2026

		КонецЕсли;
			
		
		Если ДокументПечатиОбъект.ЭтоНовый() тогда
			//Кухарь 07.06.17 начало
			//Небольшой костыль
			//ЭтотОбъект.Записать(РежимЗаписиДокумента.Проведение);
			//ПеремОтказ=ложь;
			//ПередЗаписью(ПеремОтказ,РежимЗаписиДокумента.Проведение,Неопределено);
			//Если ПеремОтказ=ложь тогда  				 
			РезультатЗаписи = 	Форма.ЗаписатьВФорме(РежимЗаписиДокумента.Проведение); 			 
			Если РезультатЗаписи = Ложь Тогда
				
				Сообщить("Не удалось провести документ"); 
				Возврат СтруктураРезультат; 
				
			КонецЕсли;
			
			//КонецЕсли;
		Иначе 
			
			
			если ДопПараметрыНакладной<>Неопределено и (ДопПараметрыНакладной.имя="WB_FBS" или ДопПараметрыНакладной.имя="OZON_FBS") тогда				
				// Кухарь А.Ю. 24.02.2025 конец
				
				НужноПроводить= не ПолучитьРеквизитШапки(ДокументПечатиОбъект.Ссылка,"Проведен","Документ");
				если НужноПроводить тогда
					//ПеремОтказ=ложь;
					ДокументПечатиОбъект.Дата=ТекущаяДатаСеанса();
					//ПередЗаписью(ПеремОтказ,РежимЗаписиДокумента.Проведение,Неопределено);
					//Если ПеремОтказ=ложь тогда
						 
					РезультатЗаписи = Форма.ЗаписатьВФорме(РежимЗаписиДокумента.Проведение); 			 
					Если РезультатЗаписи = Ложь Тогда
						
						Сообщить("Не удалось провести документ"); 
						Возврат СтруктураРезультат; 
						
					КонецЕсли;	
					
					//КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			
		КонецЕсли;           
		
		если не ОбщегоНазначения_ПИ.ПечататьКоробныеЭтикеткиНовойКомпонентой(ДокОснование) тогда
			
			если ВидДокументаПечати = "Листнабора" Тогда 
				запрос=новый Запрос;
				запрос.Текст="ВЫБРАТЬ
				|	ЛистНабора.ШКЛистаНабора,
				|	ЛистНабора.Ссылка
				|ИЗ
				|	Документ.ЛистНабора КАК ЛистНабора
				|ГДЕ
				|	ЛистНабора.Дата >= &Дата
				|	И ЛистНабора.ШКЛистаНабора = &ШКЛистаНабора
				|
				|СГРУППИРОВАТЬ ПО
				|	ЛистНабора.ШКЛистаНабора,
				|	ЛистНабора.Ссылка";
				запрос.УстановитьПараметр("Дата",НачалоДня(ДокументПечатиОбъект.Дата));
				запрос.УстановитьПараметр("ШКЛистаНабора",ДокументПечатиОбъект.ШКЛистаНабора);
				результат=запрос.Выполнить().Выгрузить();
				если результат.Количество()>1 тогда
					ДокументПечатиОбъект.ШКЛистаНабора="";
					 
					Форма.ЗаписатьВФорме(РежимЗаписиДокумента.Проведение); 			 
					
					
					Сообщить("Неудачная попытка распечатать этикетку, попробуйте ещё раз.");
					
					Возврат СтруктураРезультат;
					
					
				КонецЕсли; 
			Иначе
				запрос=новый Запрос;
				запрос.Текст="ВЫБРАТЬ
				             |	ЛистНабораДок.Штрихкод КАК Штрихкод,
				             |	ЛистНабораДок.Ссылка КАК Ссылка
				             |ИЗ
				             |	Документ.ЛистПереукладки КАК ЛистНабораДок
				             |ГДЕ
				             |	ЛистНабораДок.Дата >= &Дата
				             |	И ЛистНабораДок.Штрихкод = &Штрихкод
				             |
				             |СГРУППИРОВАТЬ ПО
				             |	ЛистНабораДок.Штрихкод,
				             |	ЛистНабораДок.Ссылка";
				запрос.УстановитьПараметр("Дата",НачалоДня(ДокументПечатиОбъект.Дата));
				запрос.УстановитьПараметр("Штрихкод",ДокументПечатиОбъект.Штрихкод);
				результат=запрос.Выполнить().Выгрузить();
				если результат.Количество()>1 тогда
					ДокументПечатиОбъект.Штрихкод="";
					 
					Форма.ЗаписатьВФорме(РежимЗаписиДокумента.Проведение); 			 
					
					
					Сообщить("Неудачная попытка распечатать этикетку, попробуйте ещё раз.");
					
					Возврат СтруктураРезультат;
					
					
				КонецЕсли; 

			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	
	//++Данилова Е.В. 17.03.2026  SNL-27 
	ДанныеДляПерезаполнения = Неопределено; 
	//СтруктураКоробок=ПолучитьСписокШКкоробокЛистаНабора(ДокументПечатиОбъект.Ссылка);
	СтруктураКоробок=ПолучитьСписокШКкоробокЛистаНабора(ДокументПечатиОбъект,,ДанныеДляПерезаполнения);
	Обработки.ПечатьЛистаНабора.ПерезаполнитьНомераКоробок(ДокументПечатиОбъект,ДанныеДляПерезаполнения); 
	//--Данилова Е.В. 17.03.2026	
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ПланНабора.Ссылка как ПланНабора
	|ИЗ
	|	Документ.ПланНабора КАК ПланНабора
	|ГДЕ
	|	ПланНабора.Проведен
	//Кухарь 16.12.19 начало
	//|	И ПланНабора.ДокОснование = &ДокОснование";
	|	И ПланНабора.Накладная = &ДокОснование";	
	//Кухарь 16.12.19 начало	
	запрос.УстановитьПараметр("ДокОснование",ДокОснование);
	результат2=запрос.Выполнить().Выбрать();       
	МожноВыводитьОбщееКоличествоМест=истина;
	пока результат2.Следующий() цикл
		ПН=результат2.планНабора.получитьОбъект();
		если ложь тогда
			ПН=Документы.ПланНабора.НайтиПоНомеру("").ПолучитьОбъект();
		КонецЕсли;
		ТЗБР=ПН.тБрэндов.Выгрузить();
		попытка
			если ТЗБР.Получить(0).Брэнд.СекторХранения="2" тогда
				ЭтоБельё=Истина;
			иначе
				ЭтоБельё=Ложь;
			КонецЕсли;
		Исключение
			ЭтоБельё=Ложь;
		КонецПопытки;
		
		
		
		ТЗБР.Свернуть("Состояние,СекторХранения");	 
		
		
		для каждого СтрТЗБР из ТЗБР цикл			
			
			если ПолучитьНомерСостоянияНакладной(СтрТЗБР.Состояние,СтрТЗБР.СекторХранения="2")<800 тогда				 
							
				МожноВыводитьОбщееКоличествоМест=Ложь;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;

	если МожноВыводитьОбщееКоличествоМест тогда
		
	
		Накладная=ДокОснование;
				
		СостояниеНакладной=Накладная.СостояниеНакладной;
		
		
		
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ
		|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита как ЗначениеРеквизита
		|ИЗ
		|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
		|ГДЕ
		|	РеквизитыРНКПНКПРМ.Документ = &Документ
		|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = ""СмешаннаяНакладная""";
		запрос.УстановитьПараметр("Документ",Накладная);
		результат=запрос.Выполнить().Выбрать();
		пока результат.Следующий() цикл
			если результат.ЗначениеРеквизита=Истина тогда 
				если СостояниеНакладной=Перечисления.СостоянияНакладной.ОжиданиеПаллетирования или
					СостояниеНакладной=Перечисления.СостоянияНакладной.Паллетирование или
					СостояниеНакладной=Перечисления.СостоянияНакладной.ОжиданиеТермоусадки или
					СостояниеНакладной=Перечисления.СостоянияНакладной.Термоусадка или
					СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке тогда
				иначе
					МожноВыводитьОбщееКоличествоМест=Ложь;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		если ДопПараметрыНакладной<>Неопределено и ДопПараметрыНакладной.ОтгрузкаFBS = Истина  тогда
			если СостояниеНакладной=Перечисления.СостоянияНакладной.ОжиданиеПаллетирования или
				// Кухарь А.Ю. 19.01.2022 начало
				//
				СостояниеНакладной=Перечисления.СостоянияНакладной.ОжиданиеДопОбработки или
				СостояниеНакладной=Перечисления.СостоянияНакладной.ДопОбработка или
				// Кухарь А.Ю. 19.01.2022 конец
				
				СостояниеНакладной=Перечисления.СостоянияНакладной.Паллетирование или
				СостояниеНакладной=Перечисления.СостоянияНакладной.ОжиданиеТермоусадки или
				СостояниеНакладной=Перечисления.СостоянияНакладной.Термоусадка или
				// Кухарь А.Ю.  07.06.2022 начало
				СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена или 
				// Кухарь А.Ю.  07.06.2022 конец
				
				СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке тогда
			иначе
				МожноВыводитьОбщееКоличествоМест=Ложь;
			КонецЕсли;
		КонецЕсли;
		// Кухарь А.Ю. 02.11.2021 конец
		
	КонецЕсли;
	//Кухарь 10.01.19 конец
	
	
	если МожноВыводитьОбщееКоличествоМест тогда
				
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ
		             |	СУММА(ЕСТЬNULL(ЛистНабораДок.КоличествоКоробок, 0)) КАК КоличествоКоробок
		             |ИЗ
		             |	Документ.ЛистНабора КАК ЛистНабораДок
		             |ГДЕ
		             |	ЛистНабораДок.Проведен
		             |	И ЛистНабораДок.ДокОснование = &ДокОснование";
		запрос.УстановитьПараметр("ДокОснование",ДокОснование);
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Документ.ЛистНабора","документ." + ВидДокументаПечати);
		КолКоробок=0;
		результат2=запрос.Выполнить().Выбрать();
		пока результат2.Следующий() цикл
			если результат2.КоличествоКоробок=null тогда Продолжить;КонецЕсли;
			КолКоробок=КолКоробок+результат2.КоличествоКоробок;
		КонецЦикла;
		
	КонецЕсли;
	
	если ложь тогда СтруктураКоробок=новый ТаблицаЗначений; КонецЕсли;
	если ТипШК=Перечисления.ТипыШтрихКодов.Коробка и ДокументПечатиОбъект.Товары.Количество()>1 тогда
				
		ТабНом=СтруктураКоробок.Скопировать();
		ТабНом.Свернуть("Номенклатура");
		СтруктураКоробок.колонки.добавить("ПорядковыйНомерСканирования");
		для каждого СтрТЗ из ТабНом цикл
			Отбор=новый Структура;
			Отбор.Вставить("Номенклатура",СтрТЗ.Номенклатура);
			МассИзТч=ДокументПечатиОбъект.Товары.НайтиСтроки(Отбор);
			если МассИзТч.Количество()<>1 тогда Продолжить; КонецЕсли;
			МассИзСтруктурыКоробок=СтруктураКоробок.НайтиСтроки(Отбор);
			Если ВидДокументаПечати = "ЛистПереукладки" Тогда
				ТекстНомеровСтрок= ""; 
			Иначе	
				ТекстНомеровСтрок=МассИзТч.Получить(0).ПорядковыйНомерКоробки;
			КонецЕсли;
			если ТекстНомеровСтрок="" тогда
				Продолжить;
			КонецЕсли;
			ТекстНомеровСтрок=СтрЗаменить(ТекстНомеровСтрок,";",Символы.ПС);
			Сч=1;
			Для Каждого СтрМассСтруктуры из МассИзСтруктурыКоробок цикл  
				если СтрПолучитьСтроку(ТекстНомеровСтрок,сч)<>"" тогда
					СтрМассСтруктуры.ПорядковыйНомерСканирования=число(СтрПолучитьСтроку(ТекстНомеровСтрок,сч));
				иначе
					СтрМассСтруктуры.ПорядковыйНомерСканирования=0;
				КонецЕсли;
				
				сч=сч+1;
			КонецЦикла;				
		КонецЦикла;
		если ВидДокументаПечати = "ЛистНабора"
			И ДокументПечатиОбъект.товары.Получить(0).ПорядковыйНомерКоробки<>"" тогда
			СтруктураКоробок.Сортировать("ПорядковыйНомерСканирования");
		КонецЕсли;
		
	КонецЕсли;
		
	
	Объект = ДокОснование;
	
	ТабДок	= Новый ТабличныйДокумент;
	
	
	если КодКонтрагента="SSR-5327" или  КодКонтрагента="SST-0419"  тогда 
		
		
		Макет=Обработки.НаклейкиНаКоробки.ПолучитьМакет("УлыбкаРадугиКоробочный");
		
		ТабДок.ИмяПараметровПечати="УлыбкаРадугиКоробочныйИзЛН"; 
				
		ИспользуютсяДанныеМатрицы=Истина;
	иначе
		Макет=Обработки.НаклейкиНаКоробки.ПолучитьМакет("ШК");
		ИспользуютсяДанныеМатрицы=Ложь;
	КонецЕсли;
	если ИспользуютсяДанныеМатрицы тогда
		СтрокиМатриц=ПолучитьТаблицуМатриц(ДокОснование);
	КонецЕсли;	 
		
	
	НаборПолей = Новый Структура;
	попытка
		сектор = Лев(Объект.РайонДоставки.Сектор.Наименование,2);
		НаборПолей.Вставить("сектор",сектор);
	Исключение
	КонецПопытки;
	
	
	
	попытка
		НаборПолей.Вставить("Отправитель",Объект.Организация.Наименование);
		НаборПолей.Вставить("Телефон",Объект.Организация.Телефоны);	
		НаборПолей.Вставить("ЮрАД",Объект.Организация.ЮридическийАдрес);		 
	исключение
		ЕЕ =  Справочники.Организации.НайтиПоКоду("SS-001");
		НаборПолей.Вставить("Отправитель",ЕЕ);
		НаборПолей.Вставить("Телефон",ЕЕ.Телефоны);	
		НаборПолей.Вставить("ЮрАД",ЕЕ.ЮридическийАдрес);	 
	конецпопытки;	
	
	ВидДокумента=Объект.Метаданные().Имя;
	МетаДок=Объект.Метаданные();	 
	Регион=Неопределено;
	Если ВидДокумента="Перемещение" Тогда
		Получатель	=Объект.ПунктДоставки.наименование;
		Регион= Объект.ПунктДоставки.Регион;
		//Кухарь 19.09.17 начало
	ИначеЕсли ВидДокумента="ПриходнаяНакладная" тогда
		Получатель	=Объект.Контрагент.наименование;
		Регион= Объект.ПунктДоставки.Регион;
		//Кухарь 19.09.17 начало
	Иначе
		Грузополучатель=?(Объект.Грузополучатель.Пустая(),Объект.Контрагент,Объект.Грузополучатель);		
		Получатель	=Грузополучатель.Наименование;
		Если НЕ Грузополучатель.Регион.Пустая() Тогда					
			Регион=Грузополучатель.Регион;
		КонецЕсли;
		Если ЕстьРеквизитДокумента("ПунктДоставки",МетаДок) И ЗначениеЗаполнено(Объект.ПунктДоставки) Тогда
			Получатель=СокрЛП(Получатель)+" "+СокрЛП(Объект.ПунктДоставки);
		КонецЕсли; 
		
		Попытка
			
			если ДопПараметрыНакладной.имя="SSP-3698" тогда
				НаборПолей.Вставить("НомерМагазина",Объект.ПунктДоставки.НомерМагазина);	 
			КонецЕсли;	
				
		исключение
		конецпопытки;
	КонецЕсли; 
	
	Если ВидДокумента="Перемещение" Тогда
		попытка
			НаборПолей.Вставить("Получатель", Объект.Организация.Наименование+" "+Объект.ПунктДоставки);
		Исключение
			НаборПолей.Вставить("Получатель", ЕЕ.Наименование+" "+Объект.ПунктДоставки);			 
		КонецПопытки;
	Иначе 	
		если Объект.Контрагент.Код = "SSR-0335" тогда 
			НаборПолей.Вставить("Получатель",Справочники.Контрагенты.НайтиПоКоду("SSP-1243").Наименование);
		иначе
			НаборПолей.Вставить("Получатель", Объект.Контрагент.Наименование);
		КонецЕсли;
	КонецЕсли;
	
	НаборПолей.Вставить("Регион", Объект.пунктДоставки.Регион);
	НаборПолей.Вставить("ад", Объект.ПунктДоставки.АдресПолучателя+ " тел.: "+Объект.ПунктДоставки.Телефоны);
	
	АдресДляЭтикеткиИзРег=ПрочитатьЗначениеРеквизитаПНКПРМРНК("АдресДляЭтикетки",Объект.Ссылка);
	если ЗначениеЗаполнено(АдресДляЭтикеткиИзРег) тогда
		НаборПолей.ад=АдресДляЭтикеткиИзРег;
	КонецЕсли;
	Сканировщик  = ДокументПечатиОбъект.Сканировщик; 
	НаборПолей.Вставить("Пользователь",Строка(Сканировщик)+?(ПараметрыСеанса.Пользователь.ФизЛицо=Сканировщик,"","\"+Строка(ПараметрыСеанса.Пользователь.ФизЛицо)));
	
	НаборПолей.Вставить("Номер", Объект.Номер);
		
	если ТипШК<>Перечисления.ТипыШтрихКодов.Коробка тогда
		НаборПолей.Вставить("ШтукВЛН"," - "+ДокументПечатиОбъект.Товары.Итог("Количество")+"шт.");	
		НужноОбрезать=Истина;
	иначе
		НужноОбрезать=Ложь;
	КонецЕсли;
	если ДокОснование.Контрагент.Код = "SSR-9059" или ДокОснование.Контрагент.Код = "SST-1208"  тогда
		// Кухарь А.Ю.  06.08.2024 конец	
		МоноКороба=ПрочитатьЗначениеРеквизитаПНКПРМРНК("ОтгрузкаМоноКоробами",ДокОснование);
		если МоноКороба =Истина тогда		
			ТЗВБ=ДокОснование.товары.Выгрузить(,"Номенклатура,Количество");
			ТЗВБ.Колонки.Добавить("НомерСтроки");
			сч=1;
			Для каждого СтрТЗВБ из ТЗВБ цикл
				если СтрТЗВБ.количество=0 тогда Продолжить;КонецЕсли;
				СтрТЗВБ.НомерСтроки=сч;
				сч=сч+1;				
			КонецЦикла;
			
			ТЗТоваров=ДокументПечатиОбъект.товары.Выгрузить(,"Номенклатура");
			ТЗТоваров.Свернуть("Номенклатура");
			если ТЗТоваров.Количество()<>1 тогда
				Сообщить("В монокоробах должен быть 1 товар.");
				Возврат СтруктураРезультат;
			КонецЕсли;
			
			
			
		КонецЕсли;
	КонецЕсли;
	
	для Каждого СтрТз из СтруктураКоробок цикл 		
		ОблЭтикетка=Макет.ПолучитьОбласть("Строка|Этикетка"); 
		 
		если ДопПараметрыНакладной<>Неопределено и ДопПараметрыНакладной.имя="SSP-3698" тогда 
			ОблЭтикетка.область("R3C2:R3C5").шрифт=Новый Шрифт(облэтикетка.область("R3C2:R3C5").шрифт,,18);
		КонецЕсли;		
		
		если ТипЗнч(СтрТЗ.номенклатура)=Тип("СправочникСсылка.Номенклатура") тогда
			
			если ЗначениеЗаполнено(СтрТЗ.ШтукВКоробке) тогда
				ШтукВКоробе=СтрТЗ.ШтукВКоробке;
			иначе
				ШтукВКоробе=СтрТЗ.номенклатура.родитель.ШтукВКоробке;
			КонецЕсли;		 
			
			
			если ШтукВКоробе>0 тогда
				НаборПолей.Вставить("ШтукВЛН"," - "+ШтукВКоробе+"шт.");	
			КонецЕсли;
		КонецЕсли;
				
		
		ОблЭтикетка.Параметры.Заполнить(НаборПолей);	 	 
		Для Каждого Рисунок Из ОблЭтикетка.Рисунки Цикл				
			Если Рисунок.Имя="ШКОбъект" Тогда
				ОбъектШК			=Рисунок.Объект;
				попытка
					ОбъектШК.Сообщение	= СтрТЗ.ШК;
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
		ОблЭтикетка.Параметры.номенклатура=СтрТЗ.номенклатура; 
		попытка
			если СтрДлина(ОблЭтикетка.Параметры.Номенклатура)>48 и НужноОбрезать тогда
				ОблЭтикетка.Параметры.Номенклатура=СтрЗаменить(ОблЭтикетка.Параметры.Номенклатура,"АРТ:","");
			КонецЕсли;
		Исключение
		КонецПопытки;
		если СтрДлина(ОблЭтикетка.Параметры.Номенклатура)>70 тогда
			ОблЭтикетка.область("R2C1:R2C5").шрифт=Новый Шрифт(облэтикетка.область("R2C1:R2C5").шрифт,,5);
		иначеесли СтрДлина(ОблЭтикетка.Параметры.Номенклатура)>50 тогда
			ОблЭтикетка.область("R2C1:R2C5").шрифт=Новый Шрифт(облэтикетка.область("R2C1:R2C5").шрифт,,6);
		иначеесли СтрДлина(ОблЭтикетка.Параметры.Номенклатура)>40 тогда
					
			ОблЭтикетка.область("R2C1:R2C5").шрифт=Новый Шрифт(облэтикетка.область("R2C1:R2C5").шрифт,,7);
		КонецЕсли;
		// Кухарь А.Ю. 06.10.2020 конец
		
		
		ОблЭтикетка.Параметры.НомерКороба=СтрТЗ.НомерКоробки;	
		
		если ДокОснование.Контрагент.Код = "SSR-9059" или ДокОснование.Контрагент.Код = "SST-1208" тогда	 
			// Кухарь А.Ю.  06.08.2024 конец
			
			если МоноКороба = Истина тогда
				СтрТЗВБ=тзвб.Найти(ДокументПечатиОбъект.товары.Получить(0).Номенклатура);
				ОблЭтикетка.Параметры.НомерКороба=СтрТЗВБ.НомерСтроки;
						
				запрос=новый запрос;
				запрос.Текст= "ВЫБРАТЬ ПЕРВЫЕ 1
				|	ЛистНабораДок.ШКЛистаНабора КАК ШКЛистаНабора
				|ИЗ
				|	Документ.ЛистНабора КАК ЛистНабораДок
				|ГДЕ
				|	ЛистНабораДок.Дата >= &Дата1
				|	И ЛистНабораДок.ДокОснование = &ДокОснование
				|	И ЛистНабораДок.Проведен
				|	И ЛистНабораДок.Товары.Номенклатура = &Номенклатура
				|	И ЛистНабораДок.Ссылка <> &Ссылка
				|	И ЛистНабораДок.Дата < &Дата2
				|
				|УПОРЯДОЧИТЬ ПО
				|	ЛистНабораДок.Дата";
				запрос.УстановитьПараметр("Дата1",ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования());
				запрос.УстановитьПараметр("ДокОснование",ДокОснование);
				запрос.УстановитьПараметр("Ссылка",ДокументПечатиОбъект.Ссылка);
				запрос.УстановитьПараметр("Дата2",ДокументПечатиОбъект.Дата);
				запрос.УстановитьПараметр("Номенклатура",ДокументПечатиОбъект.Товары.Получить(0).Номенклатура);
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"Документ.ЛистНабора","документ." + ВидДокументаПечати);
				Если ВидДокументаПечати = "ЛистПереукладки"  Тогда
				
					Запрос.Текст = СтрЗаменить(Запрос.Текст,"ЛистНабораДок.ШКЛистаНабора","ЛистНабораДок.ШтрихКод");	
				
				КонецЕсли;
				СтарыеЛН=запрос.Выполнить().Выбрать();
				
				пока СтарыеЛН.Следующий() цикл
					ТекШК=СтарыеЛН.ШКЛистаНабора+формат(1,"ЧЦ=5; ЧВН=");
					ТекШК=ТекШК+КонтрольныйСимволEAN(ТекШК,13);
					Для Каждого Рисунок Из ОблЭтикетка.Рисунки Цикл				
						Если Рисунок.Имя="ШКОбъект" Тогда
							ОбъектШК			=Рисунок.Объект;
							ОбъектШК.Сообщение	= ТекШК;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
				// Кухарь А.Ю. 18.08.2020 конец
				
			КонецЕсли;	
			
		КонецЕсли;
		
		СтрокаПолучателя = ОблЭтикетка.Параметры.Получатель;
		Если СтрДлина(СтрокаПолучателя) > 36 Тогда
			ОблЭтикетка.Область("R3C2:R3C5").Шрифт = Новый Шрифт(,8,Истина);
		ИначеЕсли СтрДлина(СтрокаПолучателя) > 28 Тогда
			
			ОблЭтикетка.Область("R3C2:R3C5").Шрифт = Новый Шрифт(,9,Истина);
			
		КонецЕсли;	
		
		если МожноВыводитьОбщееКоличествоМест и облЭтикетка.Параметры.НомерКороба=КолКоробок  тогда			
			ОблЭтикетка.Параметры.ВсегоКоробов=КолКоробок;
		иначе
			ОблЭтикетка.Область("R1C4:R1C6").Текст=СтрЗаменить(ОблЭтикетка.Область("R1C4:R1C6").Текст,"из","");
		КонецЕсли;
		
		если КодКонтрагента="SSR-5327" или  КодКонтрагента="SST-0419"  тогда
						
			если ТипЗнч(СтрТЗ.номенклатура)=Тип("СправочникСсылка.Номенклатура") тогда
				Номенклатура=СтрТЗ.Номенклатура;
			иначе
				Номенклатура=ДокументПечатиОбъект.товары.Получить(0).Номенклатура;
			КонецЕсли;
			СтрокаМатрицы=СтрокиМатриц.найти(Номенклатура,"Номенклатура");
			если СтрокаМатрицы<>Неопределено тогда
				ОблЭтикетка.Параметры.АртикулКонтрагента=СтрокаМатрицы.АртикулКонтрагента;
				ОблЭтикетка.Параметры.НомерЗаказа=ДокОснование.НомерЗаказа;
				если ТипШК=Перечисления.ТипыШтрихКодов.Коробка тогда			
					ОблЭтикетка.Параметры.количестводокумента=Номенклатура.Родитель.ШтукВКоробке;
				иначе
					ОблЭтикетка.Параметры.количестводокумента=ДокументПечатиОбъект.КоличествоДокумента;
				КонецЕсли;
			КонецЕсли;	
				
		ИначеЕсли КодКонтрагента = "EKF-0301" или КодКонтрагента = "SSR-1593" или КодКонтрагентаРодителя="SSR-7156" тогда	
			АдресИзРегистра=ПрочитатьЗначениеРеквизитаПНКПРМРНК("АдресДляЭтикетки",ДокОснование);
			если ЗначениеЗаполнено(АдресИзРегистра) тогда
				ОблЭтикетка.Параметры.АД=АдресИзРегистра;
			КонецЕсли;
			ОблЭтикетка.Параметры.НомерЗаказаЭтикетка=ДокОснование.НомерЗаказа;
			ОблЭтикетка.Параметры.Регион="";
			ОблЭтикетка.Область("ГородЗаголовок").Текст="Заказ №"; 		
			
			
		КонецЕсли;
		
		
		
		ТабДок.Вывести(ОблЭтикетка);
		
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц(); 
		
		
	КонецЦикла;
	
	// Кухарь А.Ю.  07.10.2022 начало
	// 	ТабДок.ИмяПараметровПечати	= "ПараметрыПечати_"+ЭтотОбъект.Метаданные().Имя+"_НаклейкиНаКоробки";
	если не ЗначениеЗаполнено(ТабДок.ИмяПараметровПечати) тогда
		ТабДок.ИмяПараметровПечати	= "ПараметрыПечати_"+ВидДокументаПечати+"_НаклейкиНаКоробки";
	КонецЕсли;
	// Кухарь А.Ю.  07.10.2022 конец
	
	
	
	ТабДок.ОтображатьСетку 		= Ложь;	
	ТабДок.ОтображатьЗаголовки 	= Ложь;
	
	ТабДок.ПолеСверху=0; ТабДок.ПолеСнизу=0; ТабДок.ПолеСлева=3; ТабДок.ПолеСправа=0;
	
		
	если ВнешнийТД<>Неопределено тогда
		ВнешнийТД.вывести(ТабДок);
	иначе
		//ТабДок.Показать("Наклейки "+ Объект.Номер); 
		СтруктураРезультат.Успех = истина;
		СтруктураРезультат.ТабДокумент = ТабДок; 
	КонецЕсли; 

	если МожноВыводитьОбщееКоличествоМест тогда
		если Накладная.КоличествоКоробок<>КолКоробок тогда
			НакладнаяОбъект=Накладная.ПолучитьОбъект();
			СтрТЗ=ФинальныйПересчетКоробокИОбъемов(Накладная.ПолучитьОбъект());
			ЗаполнитьЗначенияСвойств(НакладнаяОбъект,СтрТЗ);
			НакладнаяОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	КонецЕсли;
	
	ТабДокДоп = НапечататьДополнительнуюЭтикетку(ДокОснование,ДокументПечатиОбъект,Форма,ВнешнийДополнительныйТД,ДопПараметрыНакладной);
	СтруктураРезультат.Вставить("ТабДокументДоп",ТабДокДоп); 
	
	если ДопПараметрыНакладной <> Неопределено и  ДопПараметрыНакладной.ОтгрузкаКомплектов тогда	 
				
		если   ДопПараметрыНакладной.имя = "OZON_FBS" тогда
			ТЗУпаковки=ПолучитьРазбивкуНоменклатурыПоУпаковкеДокумента(ДокументПечатиОбъект.Товары.ВыгрузитьКолонку("Номенклатура"),ДопПараметрыНакладной.МассивДО);
			Для каждого СтрТЗ из ТЗУпаковки цикл
				Сообщить("Положите "+СтрТЗ.Владелец+" в "+СтрТЗ.Упаковка);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураРезультат; 
		
КонецФункции
 
 //--Данилова Е.В. 12.02.2026
 //++Данилова Е.В. 03.03.2026
 Функция КодАгрегацииИзТЧШтрихкодов(Знач ТаблицаКодовКоробок)  Экспорт
	 Результат = маркировкаКС.СтруктураРезультата(истина); 
	 Если ТаблицаКодовКоробок.Количество() = 1 тогда
		 запрос=новый запрос;
		 запрос.Текст="ВЫБРАТЬ
		              |	ВЫРАЗИТЬ(ТЧ.НовыйКодКоробки КАК Справочник.ШтрихкодыУпаковокТоваров) КАК НовыйКодКоробки
		              |ПОМЕСТИТЬ ВТ
		              |ИЗ
		              |	&ТЧ КАК ТЧ
		              |;
		              |
		              |////////////////////////////////////////////////////////////////////////////////
		              |ВЫБРАТЬ
		              |	ВТ.НовыйКодКоробки КАК НовыйКодКоробки
		              |ИЗ
		              |	ВТ КАК ВТ
		              |ГДЕ
		              |	ВТ.НовыйКодКоробки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)";
		 запрос.УстановитьПараметр("ТЧ",ТаблицаКодовКоробок);
		 Выборка = Запрос.Выполнить().Выбрать(); 
		 Если Выборка.Следующий() Тогда
			 
			 Результат.Данные = Выборка.НовыйКодКоробки; 	
			 
		 КонецЕсли;
	 ИначеЕсли ТаблицаКодовКоробок.Количество() > 1 тогда 
		  Результат.Успешно = Ложь; 
		  Результат.Ошибки.Добавить("Отсканированы коробки в ЧЗ!!Код не может быть распечатан!!"); 
	 КонецЕсли;
	 
	 Возврат Результат; 
	 
 КонецФункции // КодАгрегацииИзТЧ()
  
 //--Данилова Е.В. 03.03.2026
 
 //++Данилова Е.В. 17.03.2026 SNL-27 
 //Данилова Е.В. 13.05.2026 HELP-9756
 Функция ПолучитьНомерКоробкиПоЛистуПереукладки(Знач ЛистПереукладки,НомерПопытки = 1,ЗаписыватьВРС = Истина) Экспорт 
 
	 Если ЗначениеЗаполнено(ЛистПереукладки.номерКоробки) Тогда
		 
		 Возврат ЛистПереукладки.НомерКоробки; 	
		 
	 КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛистПереукладки.НомерКоробки КАК НомерКоробки
		|ПОМЕСТИТЬ ВТНомераИспользуемые
		|ИЗ
		|	Документ.ЛистПереукладки КАК ЛистПереукладки
		|ГДЕ
		|	ЛистПереукладки.ДокОснование = &ДокОснование
		|	И ЛистПереукладки.НомерКоробки <> 0
		|	И ЛистПереукладки.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТНомераИспользуемые.НомерКоробки + 1 КАК НомерКоробки,
		|	0 КАК Приоритет
		|ПОМЕСТИТЬ ВТНомерКоробкиСледующий
		|ИЗ
		|	ВТНомераИспользуемые КАК ВТНомераИспользуемые
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТНомераИспользуемые.НомерКоробки УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	0 КАК Цифра
		|ПОМЕСТИТЬ ВТ_Цифры
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	3
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	4
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	5
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	6
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	7
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	8
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	9
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Число КАК Число
		|ПОМЕСТИТЬ ВТВсеЧислаДоПоследнего
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_Цифры.Цифра * 100 + ВТ_Цифры1.Цифра * 10 + ВТ_Цифры2.Цифра КАК Число
		|	ИЗ
		|		ВТ_Цифры КАК ВТ_Цифры,
		|		ВТ_Цифры КАК ВТ_Цифры1,
		|		ВТ_Цифры КАК ВТ_Цифры2) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНомерКоробкиСледующий КАК ВТНомерКоробкиСледующий
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВложенныйЗапрос.Число < ВТНомерКоробкиСледующий.НомерКоробки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТВсеЧислаДоПоследнего.Число КАК НомерКоробки,
		|	1 КАК Приоритет
		|ПОМЕСТИТЬ ВТНомераПомеченные
		|ИЗ
		|	ВТВсеЧислаДоПоследнего КАК ВТВсеЧислаДоПоследнего
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНомераИспользуемые КАК ВТНомераИспользуемые
		|		ПО ВТВсеЧислаДоПоследнего.Число = ВТНомераИспользуемые.НомерКоробки
		|ГДЕ
		|	ВТНомераИспользуемые.НомерКоробки ЕСТЬ NULL
		|	И ВТВсеЧислаДоПоследнего.Число <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТВсеЧислаДоПоследнего.Число
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТНомера.НомерКоробки КАК НомерКоробки,
		|	ВТНомера.Приоритет КАК Приоритет
		|ИЗ
		|	ВТНомерКоробкиСледующий КАК ВТНомера
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТНомераПомеченные.НомерКоробки,
		|	ВТНомераПомеченные.Приоритет
		|ИЗ
		|	ВТНомераПомеченные КАК ВТНомераПомеченные
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТНомера.Приоритет УБЫВ";
	
	Запрос.УстановитьПараметр("ДокОснование", ЛистПереукладки.ДокОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		//++Данилова Е.В. 28.04.2026 HELP-9565
		//Возврат ВыборкаДетальныеЗаписи.НомерКоробки;
		НомерКоробки =  ВыборкаДетальныеЗаписи.НомерКоробки;
		//--Данилова Е.В. 28.04.2026 
	Иначе 
		НомерКоробки = 1;
	КонецЕсли;
	
	//Возврат 1;
	//++Данилова Е.В. 13.05.2026  HELP-9756 
	Если ЗаписыватьВРС Тогда 
		//++Данилова Е.В. 28.04.2026 HELP-9565
		ПараметрыЗаписи = РегистрыСведений.НомераКоробокПоЛистам.СтруктураПараметровЗаписиВРегистр(); 
		ПараметрыЗаписи.Докоснование 	= ЛистПереукладки.ДокОснование; 
		ПараметрыЗаписи.НомерКоробки 	= НомерКоробки; 
		ПараметрыЗаписи.Лист 			= ЛистПереукладки.ссылка;
		
		РезультатЗаписи = РегистрыСведений.НомераКоробокПоЛистам.ЗаписатьНомерКоробки(ПараметрыЗаписи);
		Если РезультатЗаписи.Успешно Тогда
			
			Возврат НомерКоробки;	
			
		ИначеЕсли НомерПопытки < 3 Тогда 
			
			Возврат ПолучитьНомерКоробкиПоЛистуПереукладки(ЛистПереукладки,НомерПопытки + 1); 
			
		Иначе
			
			ВызватьИсключение "Не удалось получить номер коробки!!Попробуйте заново сформировать этикетку";
			
		КонецЕсли;
		
		
		//--Данилова Е.В. 28.04.2026 
	Иначе
		
		Возврат НомерКоробки; 
		
	КонецЕсли; 
	//--Данилова Е.В. 13.05.2026 
 
КонецФункции // ПолучитьНомерКоробкиПоЛистуПереукладки() 

Функция ПолучитьНомерКоробкиПоЛистуНабора(Знач ЛистНабора, ТЗТоваров,НомерПопытки = 1,ЗаписыватьВРС = Истина)Экспорт 

	//надо получить начальный номер, а затем уже идти по таблице товаров сч +1 
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛистНабораНомераКоробок.НомерКоробки КАК НомерКоробки
		|ПОМЕСТИТЬ ВТНомераИспользуемые
		|ИЗ
		|	Документ.ЛистНабора КАК ЛистНабораДок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.НомераКоробок КАК ЛистНабораНомераКоробок
		|		ПО ЛистНабораДок.Ссылка = ЛистНабораНомераКоробок.Ссылка
		|ГДЕ
		|	ЛистНабораДок.ДокОснование = &ДокОснование
		|	И ЛистНабораНомераКоробок.НомерКоробки <> 0
		|	И ЛистНабораДок.Проведен
		|	И ЛистНабораНомераКоробок.Ссылка <> &ЭтотЛист
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТНомераИспользуемые.НомерКоробки + 1 КАК НомерКоробки,
		|	0 КАК Приоритет
		|ПОМЕСТИТЬ ВТНомерКоробкиСледующий
		|ИЗ
		|	ВТНомераИспользуемые КАК ВТНомераИспользуемые
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТНомераИспользуемые.НомерКоробки УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	0 КАК Цифра
		|ПОМЕСТИТЬ ВТ_Цифры
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	3
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	4
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	5
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	6
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	7
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	8
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	9
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Число КАК Число
		|ПОМЕСТИТЬ ВТВсеЧислаДоПоследнего
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_Цифры.Цифра * 100 + ВТ_Цифры1.Цифра * 10 + ВТ_Цифры2.Цифра КАК Число
		|	ИЗ
		|		ВТ_Цифры КАК ВТ_Цифры,
		|		ВТ_Цифры КАК ВТ_Цифры1,
		|		ВТ_Цифры КАК ВТ_Цифры2) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНомерКоробкиСледующий КАК ВТНомерКоробкиСледующий
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВложенныйЗапрос.Число < ВТНомерКоробкиСледующий.НомерКоробки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТВсеЧислаДоПоследнего.Число КАК НомерКоробки,
		|	1 КАК Приоритет
		|ПОМЕСТИТЬ ВТНомераПомеченные
		|ИЗ
		|	ВТВсеЧислаДоПоследнего КАК ВТВсеЧислаДоПоследнего
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНомераИспользуемые КАК ВТНомераИспользуемые
		|		ПО ВТВсеЧислаДоПоследнего.Число = ВТНомераИспользуемые.НомерКоробки
		|ГДЕ
		|	ВТНомераИспользуемые.НомерКоробки ЕСТЬ NULL
		|	И ВТВсеЧислаДоПоследнего.Число <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТНомера.НомерКоробки КАК НомерКоробки,
		|	ВТНомера.Приоритет КАК Приоритет
		|ИЗ
		|	ВТНомерКоробкиСледующий КАК ВТНомера
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТНомераПомеченные.НомерКоробки,
		|	ВТНомераПомеченные.Приоритет
		|ИЗ
		|	ВТНомераПомеченные КАК ВТНомераПомеченные
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТНомера.Приоритет УБЫВ,
		|	НомерКоробки";
	
	Запрос.УстановитьПараметр("ДокОснование", ЛистНабора.ДокОснование);
	Запрос.УстановитьПараметр("ЭтотЛист", ЛистНабора.ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	НачНомерКоробки = 1; 
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	КоличествоКодов = ТЗТоваров.Количество(); 
	
	МассивСвободныхКодов = Новый Массив; 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если МассивСвободныхКодов.Количество() =  КоличествоКодов Тогда
		
			Прервать; 	
		
		КонецЕсли;
		МассивСвободныхКодов.Добавить(ВыборкаДетальныеЗаписи.НомерКоробки); 
	КонецЦикла;
	
	Если РезультатЗапроса.Пустой() Тогда
	
		МассивСвободныхКодов.Добавить(1); 	
	
	КонецЕсли;
	//++Данилова Е.В. 02.04.2026  SNL-27 
	МассивТипов = Новый Массив; 
	МассивТипов.Добавить(Тип("СправочникСсылка.Номенклатура"));
	МассивТипов.Добавить(Тип("Строка"));
	ОписаниеТипаНоменклатура = Новый ОписаниеТипов(МассивТипов,,,,Новый КвалификаторыСтроки(150)); 
	ТаблицаНомеров = Новый ТаблицаЗначений; 
	ТаблицаНомеров.Колонки.Добавить("НомерКоробки",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(6,0)));
	ТаблицаНомеров.Колонки.Добавить("Номенклатура",ОписаниеТипаНоменклатура);
	ТаблицаНомеров.Колонки.Добавить("НомерСтроки",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(6,0))); 
	//--Данилова Е.В. 02.04.2026 
	Сч = 0;
	Сч1 = 1; 
	ПоследнийНомерКоробки = 0; 
	Для каждого СтрокаТоваров Из ТЗТоваров Цикл 
		
		Если МассивСвободныхКодов.ВГраница() < Сч Тогда
			
			СтрокаНомеров = ТаблицаНомеров.Добавить();
			СтрокаНомеров.Номенклатура = СтрокаТоваров.Номенклатура; 
			СтрокаНомеров.НомерКоробки = ПоследнийНомерКоробки + Сч1;  
			СтрокаНомеров.НомерСтроки = Сч + 1;
			Сч1  =Сч1 + 1; 
		Иначе 
			СтрокаНомеров = ТаблицаНомеров.Добавить();
			СтрокаНомеров.Номенклатура = СтрокаТоваров.Номенклатура; 
			СтрокаНомеров.НомерКоробки = МассивСвободныхКодов[Сч]; //НачНомерКоробки + Сч;
			СтрокаНомеров.НомерСтроки = Сч + 1;
			
			ПоследнийНомерКоробки =  СтрокаНомеров.НомерКоробки; 
		КонецЕсли; 
		
		Сч = Сч + 1; 
	КонецЦикла;
	
	//++Данилова Е.В. 28.04.2026  HELP-9565 
	
	ПолучитьПовторно = Ложь; 
	//++Данилова Е.В. 13.05.2026 HELP-9756 
	Если ЗаписыватьВРС Тогда  
		Для каждого СтрокаТЧ  Из ТаблицаНомеров Цикл
			
			ПараметрыЗаписи = РегистрыСведений.НомераКоробокПоЛистам.СтруктураПараметровЗаписиВРегистр(); 	
			ПараметрыЗаписи.Докоснование 	= ЛистНабора.ДокОснование; 
			ПараметрыЗаписи.НомерКоробки 	= СтрокаТЧ.НомерКоробки; 
			ПараметрыЗаписи.Лист 			= ЛистНабора.ссылка;
			ПараметрыЗаписи.НомерСтрокиЛН    = СтрокаТЧ.НомерСтроки; 
			РезультатЗаписи = РегистрыСведений.НомераКоробокПоЛистам.ЗаписатьНомерКоробки(ПараметрыЗаписи);
			Если НЕ РезультатЗаписи.Успешно Тогда
				ПолучитьПовторно = Истина; 
				прервать; 
			КонецЕсли;
		КонецЦикла;
		Если ПолучитьПовторно Тогда
			
			РегистрыСведений.НомераКоробокПоЛистам.ОчиститьЗаписьПоЛисту(ЛистНабора); 
			
			Если НомерПопытки < 3 Тогда 
				Возврат  ПолучитьНомерКоробкиПоЛистуНабора(ЛистНабора,ТЗТоваров, НомерПопытки + 1);
			Иначе
				ВызватьИсключение "Не удалось получить номер коробки!!Попробуйте заново сформировать этикетку";;
			КонецЕсли; 		
		Иначе
			Возврат ТаблицаНомеров;
		КонецЕсли;
		//--Данилова Е.В. 28.04.2026 
		
		//Возврат ТаблицаНомеров; 
	Иначе
		Возврат ТаблицаНомеров;
	КонецЕсли;
	//--Данилова Е.В. 13.05.2026 
КонецФункции // ПолучитьНомерКоробкиПоЛистуНабора()
 //Данилова Е.В. 13.05.2026 HELP-9756
Функция ПолучитьСписокШКкоробокЛистаНабораИПереукладки(ЛН,ПечатьПоНовому,ДанныеДляПерезаписиНомеров = неопределено,ЗаписыватьВРС = Истина) Экспорт 
   
	ТЗ=новый таблицазначений;
	тз.Колонки.Добавить("НомерКоробкиЛН");	
	тз.Колонки.Добавить("НомерКоробки");
	тз.Колонки.Добавить("ШК");		
	тз.Колонки.Добавить("Номенклатура");
	тз.Колонки.Добавить("ШтукВКоробке");
	
	если лн.ТипШК=Перечисления.ТипыШтрихКодов.Коробка тогда
		ТабНоменклатурыПоКоробам=новый ТаблицаЗначений;
		ТабНоменклатурыПоКоробам.Колонки.Добавить("Номенклатура");
		ТабНоменклатурыПоКоробам.Колонки.Добавить("ШтукВКоробке"); 
		Для Каждого СтрокаТЧ Из ЛН.Товары Цикл
			КоличествоКоробов=?(СтрокаТЧ.ШтВКоробе=0,СтрокаТЧ.количество,СтрокаТЧ.количество/СтрокаТЧ.ШтВКоробе);
			Для СчКоробов=1 по КоличествоКоробов цикл
				СтрТабНом=ТабНоменклатурыПоКоробам.Добавить();
				СтрТабНом.Номенклатура=СтрокаТЧ.Номенклатура;
				СтрТабНом.ШтукВКоробке=СтрокаТЧ.ШтВКоробе; 
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	если ТипЗнч(ЛН) = Тип("ДокументСсылка.ЛистНабора") 
		или ТипЗнч(ЛН) = Тип("ДокументОбъект.ЛистНабора") тогда
		ЭтоЛН=Истина;
	иначе
		ЭтоЛН=Ложь;
	КонецЕсли;
	
	ТаблицаНомеров = Новый ТаблицаЗначений; 
	ТаблицаНомеров.Колонки.Добавить("НомерКоробки");
	ТаблицаНомеров.Колонки.Добавить("Номенклатура");
	
	НомерКоробкиПоЛП = ""; 
	Если ТипЗнч(ЛН) = Тип("ДокументСсылка.ЛистПереукладки") 
		или ТипЗнч(ЛН) = Тип("ДокументОбъект.ЛистПереукладки") Тогда
	    //++Данилова Е.В. 13.05.2026 HELP-9756 
		//НомерКоробкиПоЛП = Обработки.ПечатьЛистаНабора.ПолучитьНомерКоробкиПоЛистуПереукладки(ЛН);
		НомерКоробкиПоЛП = Обработки.ПечатьЛистаНабора.ПолучитьНомерКоробкиПоЛистуПереукладки(ЛН,,ЗаписыватьВРС);
		//--Данилова Е.В. 13.05.2026 
		ДанныеДляПерезаписиНомеров = НомерКоробкиПоЛП; 
		
	КонецЕсли;
	
	Если ЭтоЛН Тогда
		
		ТаблицаНомеров = ЛН.НомераКоробок.Выгрузить();
			
	КонецЕсли;
	
	Для Сч=1 по ЛН.КоличествоКоробок Цикл 
		СтрТЗ=тз.Добавить();
		СтрТЗ.НомерКоробкиЛН = сч;
		
		если не ПечатьПоНовому тогда		
			
			Если ЭтоЛН
				И Не ЗначениеЗаполнено(ЛН.ШКЛистаНабора) Тогда  
				ТекШК = ""; 	
			Иначеесли ЭтоЛН тогда
				
				ТекШК=ЛН.ШКЛистаНабора+формат(Сч,"ЧЦ=5; ЧВН=");
				ТекШК=ТекШК+КонтрольныйСимволEAN(ТекШК,13);
			иначе
				ТекШК=ЛН.ШтрихКод;		
			КонецЕсли;
			
		Иначе
			
		КонецЕсли;			
		
		СтрТЗ.ШК=ТекШК;
		
		если лн.ТипШК=Перечисления.ТипыШтрихКодов.Коробка и ТабНоменклатурыПоКоробам.Количество()>0 тогда
			ТекСтрокаНоменклатурыПоКоробам= ТабНоменклатурыПоКоробам.Получить(Сч-1);
			ТекНоменклатура=ТекСтрокаНоменклатурыПоКоробам.номенклатура;
			ТекШтукВКоробке=ТекСтрокаНоменклатурыПоКоробам.ШтукВКоробке;			 
		иначе
			ТекШтукВКоробке=ЛН.КоличествоДокумента; 
			если ЛН.товары.количество()>1 тогда
				ТекНоменклатура = ЛН.ГруппыТоваров+" mix";
			ИначеЕсли ЛН.товары.количество()=0 тогда
				ТекНоменклатура = "Номенклатура: Сборная ("+ ЛН.ГруппыТоваров+")";
			иначе
				ТекНоменклатура = "АРТ: "+ ЛН.товары.получить(0).Номенклатура;
			КонецЕсли;
		КонецЕсли;
		СтрТЗ.ШтукВКоробке=ТекШтукВКоробке; 
		СтрТЗ.номенклатура=ТекНоменклатура;
		
		Если НЕ ЭтоЛН
			и ЗначениеЗаполнено(НомерКоробкиПоЛП) Тогда
		
			СтрТЗ.НомерКоробки = НомерКоробкиПоЛП; 	
		
		КонецЕсли;
				
	КонецЦикла;
	
	Если ЭтоЛН Тогда
		ПереформироватьТаблицуНомеров = Ложь; 
		Если ТаблицаНомеров.Количество() <> ТЗ.Количество() Тогда
			
			ТаблицаНомеров.Очистить();
			//++Данилова Е.В. 13.05.2026 HELP-9756
			//ТаблицаНомеров = ПолучитьНомерКоробкиПоЛистуНабора(ЛН,ТЗ);
			ТаблицаНомеров = ПолучитьНомерКоробкиПоЛистуНабора(ЛН,ТЗ,,ЗаписыватьВРС);
			 //--Данилова Е.В. 13.05.2026 
			ПереформироватьТаблицуНомеров = Истина; 
		Иначе
			 
			Для каждого СтрокаТЗ Из ТЗ Цикл                
				// Кухарь А.Ю.  07.04.2026 начало
				если ТипЗнч(СтрокаТЗ.Номенклатура) = Тип("Строка") и СтрДлина(СтрокаТЗ.Номенклатура)>150 тогда 
					СтрокаТЗ.Номенклатура = Лев(СтрокаТЗ.Номенклатура,150);
				КонецЕсли;				 
				// Кухарь А.Ю.  07.04.2026 конец
				
			    ОтборНом = Новый Структура("Номенклатура",СтрокаТЗ.Номенклатура); 
				СтрокиИзНомеров = ТаблицаНомеров.НайтиСтроки(ОтборНом);
				Если  СтрокиИзНомеров.Количество() > 1 Тогда
					ОтборНом = Новый Структура("Номенклатура,НомерСтроки",СтрокаТЗ.Номенклатура,СтрокаТЗ.НомерКоробкиЛН);
					СтрокиИзНомеров = ТаблицаНомеров.НайтиСтроки(ОтборНом);
					Если СтрокиИзНомеров.Количество() > 0 Тогда
						
						СтрокаТЗ.НомерКоробки = СтрокиИзНомеров[0].НомерКоробки;	
					Иначе 
						ПереформироватьТаблицуНомеров = Истина; 
						Прервать;
					КонецЕсли;
					
				ИначеЕсли СтрокиИзНомеров.Количество() > 0 Тогда
					СтрокаТЗ.НомерКоробки = СтрокиИзНомеров[0].НомерКоробки;
				Иначе 
					ПереформироватьТаблицуНомеров = Истина; 
					Прервать; 
					
				КонецЕсли;
			     
			КонецЦикла;
			
			Если ПереформироватьТаблицуНомеров Тогда
			    //++Данилова Е.В. 13.05.2026 HELP-9756 
				//ТаблицаНомеров = ПолучитьНомерКоробкиПоЛистуНабора(ЛН,ТЗ);
				ТаблицаНомеров = ПолучитьНомерКоробкиПоЛистуНабора(ЛН,ТЗ,,ЗаписыватьВРС);
				//--Данилова Е.В. 13.05.2026
			
			КонецЕсли;
			
		КонецЕсли; 
		
		Если ПереформироватьТаблицуНомеров Тогда
			
			Для каждого СтрокаТЗ Из ТЗ Цикл
				ОтборНом = Новый Структура("Номенклатура",СтрокаТЗ.Номенклатура); 
				СтрокиИзНомеров = ТаблицаНомеров.НайтиСтроки(ОтборНом);
				Если  СтрокиИзНомеров.Количество() > 1 Тогда
					ОтборНом = Новый Структура("Номенклатура,НомерСтроки",СтрокаТЗ.Номенклатура,СтрокаТЗ.НомерКоробкиЛН);
					СтрокиИзНомеров = ТаблицаНомеров.НайтиСтроки(ОтборНом);
					Если СтрокиИзНомеров.Количество() > 0 Тогда
						СтрокаТЗ.НомерКоробки = СтрокиИзНомеров[0].НомерКоробки; 
					КонецЕсли;
				ИначеЕсли СтрокиИзНомеров.Количество() > 0 Тогда
					СтрокаТЗ.НомерКоробки = СтрокиИзНомеров[0].НомерКоробки;
				КонецЕсли;
				
			КонецЦикла; 		
			
		КонецЕсли;
		
		ДанныеДляПерезаписиНомеров = ТаблицаНомеров; 
		
	КонецЕсли;
	
	Возврат ТЗ;	


КонецФункции // ПолучитьСписокШКкоробокЛистаНабора()

Процедура ПерезаполнитьНомераКоробок(ЛистОбъект,ДанныеДляПерезаполнения) Экспорт 

	Если ДанныеДляПерезаполнения  = Неопределено Тогда
	
		Возврат; 	
	
	КонецЕсли;
	
	Если ТипЗнч(ЛистОбъект) = Тип("ДокументОбъект.ЛистНабора")
		И ТипЗнч(ДанныеДляПерезаполнения) = Тип("ТаблицаЗначений") Тогда
		Если НЕ ТаблицыНомераКоробокИдентичны(ЛистОбъект.НомераКоробок.выгрузить(),ДанныеДляПерезаполнения) Тогда 
			ЛистОбъект.НомераКоробок.Очистить(); 
			ЛистОбъект.НомераКоробок.Загрузить(ДанныеДляПерезаполнения);
			//++Данилова Е.В. 05.05.2026 HELP-9636 
			Попытка
				ЛистОбъект.Записать();
			Исключение
				Обработки.ПечатьЛистаНабора.ОчиститьРегистрНомераКоробокСПредварСверкой(ЛистОбъект.ссылка); 
			КонецПопытки; 
			//--Данилова Е.В. 05.05.2026 
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ЛистОбъект) = Тип("ДокументОбъект.ЛистПереукладки")
		И ТипЗнч(ДанныеДляПерезаполнения) = Тип("Число") Тогда
		Если ЛистОбъект.НомерКоробки <> ДанныеДляПерезаполнения Тогда
			
			ЛистОбъект.НомерКоробки = ДанныеДляПерезаполнения;	
			//++Данилова Е.В. 05.05.2026 HELP-9636 
			Попытка
				ЛистОбъект.Записать();
			Исключение
				Обработки.ПечатьЛистаНабора.ОчиститьРегистрНомераКоробокСПредварСверкой(ЛистОбъект.ссылка); 
			КонецПопытки; 
			//--Данилова Е.В. 05.05.202
		КонецЕсли; 
	
	КонецЕсли;
	
	 

КонецПроцедуры // ПерезаписатьНомераКоробок()

Функция ТаблицыНомераКоробокИдентичны(ТЧ1,ТЧ2)Экспорт
   	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЧ1",ТЧ1);
	Запрос.УстановитьПараметр("ТЧ2",ТЧ2);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧ1.НомерКоробки КАК НомерКоробки,
		|	ТЧ1.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ТЧ1
		|ИЗ
		|	&ТЧ1 КАК ТЧ1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧ2.НомерКоробки КАК НомерКоробки,
		|	ТЧ2.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ТЧ2
		|ИЗ
		|	&ТЧ2 КАК ТЧ2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТЧ1.НомерКоробки КАК НомерКоробки,
		|	ТЧ2.НомерКоробки КАК НомерКоробки1
		|ИЗ
		|	ТЧ1 КАК ТЧ1
		|		ПОЛНОЕ СОЕДИНЕНИЕ ТЧ2 КАК ТЧ2
		|		ПО ТЧ1.НомерКоробки = ТЧ2.НомерКоробки
		|			И ТЧ1.Номенклатура = ТЧ2.Номенклатура
		|ГДЕ
		|	(ТЧ1.НомерКоробки ЕСТЬ NULL
		|			ИЛИ ТЧ2.НомерКоробки ЕСТЬ NULL
		|			ИЛИ ТЧ1.Номенклатура ЕСТЬ NULL
		|			ИЛИ ТЧ2.Номенклатура ЕСТЬ NULL)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой(); 	

КонецФункции // СравнитьТаблицы()

 
 //--Данилова Е.В. 17.03.2026 
 //++Данилова Е.В. 05.05.2026  HELP-9636 
 Процедура ОчиститьРегистрНомераКоробокСПредварСверкой(Знач Лист) Экспорт
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	НомераКоробокПоЛистам.ДокОснование КАК ДокОснование,
	 |	НомераКоробокПоЛистам.НомерКоробки КАК НомерКоробки
	 |ИЗ
	 |	РегистрСведений.НомераКоробокПоЛистам КАК НомераКоробокПоЛистам
	 |ГДЕ
	 |	НомераКоробокПоЛистам.Лист = &Лист
	 |	И НомераКоробокПоЛистам.ДокОснование = &ДокОснование";
	 
	 Запрос.УстановитьПараметр("ДокОснование", Лист.ДокОснование);
	 Запрос.УстановитьПараметр("Лист", Лист);
	 
	 РезультатЗапроса = Запрос.Выполнить();
	 Если РезультатЗапроса.Пустой() Тогда
		 
		 Возврат; 	
		 
	 КонецЕсли;
	 
	 Выборка = РезультатЗапроса.Выбрать(); 
	  
	 
	 Если ТипЗнч(Лист) = Тип("ДокументСсылка.ЛистПереукладки") Тогда
		 
		 Выборка.Следующий();
		 Если НЕ ЗначениеЗаполнено(Лист.НомерКоробки)
			 ИЛИ Лист.НомерКоробки <> Выборка.НомерКоробки Тогда
			 
			 РегистрыСведений.НомераКоробокПоЛистам.ОчиститьЗаписьПоЛисту(Лист);  
			 
		 КонецЕсли;
	 ИначеЕсли ТипЗнч(Лист) = Тип("ДокументСсылка.ЛистНабора") Тогда
		 
		 Если Лист.НомераКоробок.Количество() = 0   Тогда
			 
			 РегистрыСведений.НомераКоробокПоЛистам.ОчиститьЗаписьПоЛисту(Лист); 
		 Иначе
			 ОчиститьРС = Ложь; 
			 Пока Выборка.Следующий()  Цикл
				 
				 НомерКоробки = Выборка.НомерКоробки; 
				 Отбор = Новый Структура("НомерКоробки",НомерКоробки); 
				 СтрокиНайденные = Лист.НомераКоробок.НайтиСтроки(Отбор); 	 
				 Если СтрокиНайденные.Количество() = 0  Тогда
					 
					 ОчиститьРС = Истина; 	
					 Прервать; 
				 КонецЕсли;
			 КонецЦикла;
			 Если ОчиститьРС Тогда
				 
				 РегистрыСведений.НомераКоробокПоЛистам.ОчиститьЗаписьПоЛисту(Лист);	
				 
			 КонецЕсли;		 
			 
		 КонецЕсли;
		 
		 
	 КонецЕсли;
	 
 КонецПроцедуры // ОчиститьРегистрНомераКоробокСПредварСверкой()
 
 //--Данилова Е.В. 05.05.2026
 
 //++Данилова Е.В. 26.03.2026
 Функция ПолучитьКодАгрегацииКоробкиИзТЧ(Знач ДокументПечатиОбъект) Экспорт
 
 	если ДокументПечатиОбъект.ШтрихкодыКоробокДляАгрегации.Количество()> 0 тогда
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ
		|	ТЧ.ИсходныйКодКоробки КАК ИсходныйКодКоробки
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТЧ КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.ИсходныйКодКоробки.Ссылка КАК ИсходныйКодКоробки
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	ВТ.ИсходныйКодКоробки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)";
		запрос.УстановитьПараметр("ТЧ",ДокументПечатиОбъект.ШтрихкодыКоробокДляАгрегации.Выгрузить());
		Выборка = запрос.Выполнить().Выбрать();
		пока выборка.Следующий() цикл
			возврат выборка.ИсходныйКодКоробки;
		КонецЦикла;
		
		Возврат Неопределено; 
	КонецЕсли;

     Возврат Неопределено; 
 КонецФункции // ()
 
 //--Данилова Е.В. 26.03.2026  
  //++Данилова Е.В. 08.05.2026 HELP-9716 
  Функция ПроверитьЗанятыеНомераБезЗаписиВЛист(Знач ДокОснование, Знач Лист) Экспорт
	  Если ТипЗнч(Лист) = Тип("ДокументСсылка.ЛистНабора") Тогда
		  
		  Запрос = Новый Запрос;
		  Запрос.Текст = 
		  "ВЫБРАТЬ
		  |	НомераКоробокПоЛистам.ДокОснование КАК ДокОснование,
		  |	НомераКоробокПоЛистам.Лист КАК Лист
		  |ИЗ
		  |	РегистрСведений.НомераКоробокПоЛистам КАК НомераКоробокПоЛистам
		  |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистНабора.НомераКоробок КАК ЛистНабораНомераКоробок
		  |		ПО НомераКоробокПоЛистам.Лист = ЛистНабораНомераКоробок.Ссылка
		  |ГДЕ
		  |	НомераКоробокПоЛистам.ДокОснование = &ДокОснование
		  |	И ЛистНабораНомераКоробок.Ссылка ЕСТЬ NULL
		  |	И НомераКоробокПоЛистам.Лист ССЫЛКА Документ.ЛистНабора";  	  
		  
	  Иначе 
		  Запрос = Новый Запрос;
		  Запрос.Текст = 
		  "ВЫБРАТЬ
		  |	НомераКоробокПоЛистам.ДокОснование КАК ДокОснование,
		  |	НомераКоробокПоЛистам.Лист КАК Лист
		  |ИЗ
		  |	РегистрСведений.НомераКоробокПоЛистам КАК НомераКоробокПоЛистам
		  |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладкиДок
		  |		ПО НомераКоробокПоЛистам.Лист = ЛистПереукладкиДок.Ссылка
		  |ГДЕ
		  |	НомераКоробокПоЛистам.ДокОснование = &ДокОснование
		  |	И ЛистПереукладкиДок.НомерКоробки = 0
		  |	И НомераКоробокПоЛистам.Лист ССЫЛКА Документ.ЛистПереукладки";  	  
		 
	  КонецЕсли;
	  Запрос.УстановитьПараметр("ДокОснование", ДокОснование);
	  РезультатЗапроса = Запрос.Выполнить();
	  
	  ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();  	  
	  
	  Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		  РегистрыСведений.НомераКоробокПоЛистам.ОчиститьЗаписьПоЛисту(ВыборкаДетальныеЗаписи.Лист); 
	  КонецЦикла; 
  КонецФункции // ПроверитьЗанятыеНомераБезЗаписиВЛист()
 //--Данилова Е.В. 08.05.2026
