Функция СформироватьДвижения(Регистратор) Экспорт
	Если НЕ Метаданные.РегистрыСведений.СтатусыКМ_Факт_А.СтандартныеРеквизиты.Регистратор.Тип.СодержитТип(ТипЗнч(Регистратор)) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Период,
	|	Регистратор,
	|	ТипШК,
	|	ШтрихКодУпаковки,
	|	Статус,
	|	Местонахождение,
	|	ВПути,
	|	ШтрихКодУпаковки.СпособВводаВОборот КАК СпособВводаВОборот
	|ИЗ
	|	РегистрСведений.СтатусыКМ_Факт КАК СтатусыКМ_Факт
	|ГДЕ
	|	Регистратор = &Регистратор
	|	И ТипШК <> ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	|";
	
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	НЗ = РегистрыСведений.СтатусыКМ_Факт_А.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(Регистратор, Истина);
	
	НЗ.Загрузить(Запрос.Выполнить().Выгрузить());
	
	НЗ.Записать();	
КонецФункции //СформироватьДвижения(Регистратор) Экспорт