

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	если ЭтоНовый() и не ОбменДанными.Загрузка тогда
		Автор=ПараметрыСеанса.Пользователь;
	КонецЕсли;
КонецПроцедуры


Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	//крохин начало 05.10.2021
	//СтандартнаяОбработка=Истина;
	//если СокрЛП(Префикс)="" тогда
	//	УстановитьНомерДокумента(ЭтотОбъект);
	//КонецЕсли;
	#ЕСЛИ КЛИЕНТ ТОГДА
		СтандартнаяОбработка=Истина;
	если СокрЛП(Префикс)="" тогда
		УстановитьНомерДокумента(ЭтотОбъект);
	КонецЕсли;
	#КОНЕЦЕСЛИ	
	//крохин конец 05.10.2021
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	если СозданаЗаявкаНаОплату=Ложь тогда
		для каждого СтрТЧ из УСО цикл
			ТекУСО=СтрТЧ.Документ.ПолучитьОбъект();
			ТекУСО.СозданСчет=Истина;
			ТекУСО.ПерезаписатьДокументБезКонтроля();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	если не ОбменДанными.Загрузка тогда
		если СозданаЗаявкаНаОплату тогда
			#Если клиент тогда
				Сообщить("На эту заявку уже оформлено ЗНО. Нужно сначала пометить его на удаление");
			#КонецЕсли
			отказ=Истина;
		КонецЕсли;
		если не Отказ тогда
			для каждого СтрТЧ из УСО цикл
				ТекУСО=СтрТЧ.Документ.ПолучитьОбъект();
				ТекУСО.СозданСчет=ложь;
				//Кухарь 02.06.17 начало   
				//будем записывать УСО в закрытом периоде
				//ТекУСО.Записать(РежимЗаписиДокумента.Запись);
				ТекУСО.ПерезаписатьДокументБезКонтроля();
				
				//Кухарь 02.06.17 конец
				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

