
&НаСервере
Процедура ОтправитьНаОтработкуНаСервере()
	ОбОбработка = РеквизитФормыВЗначение("Объект");
	ОбОбработка.Организация = Организация;
	ОбОбработка.Подразделение = Подразделение;                  
	ОбОбработка.ОтправитьНаОтработкуВЧЗЗАказыКМ(ЗаказыКМ.ВыгрузитьЗначения()); 
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаОтработку(Команда)
	ОтправитьНаОтработкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЭтапВторойНаСервере()
	ОбОбработка = РеквизитФормыВЗначение("Объект");
	ОбОбработка.Организация = Организация;
	ОбОбработка.Подразделение = Подразделение;
	ОбОбработка.ЭтапВторой();
КонецПроцедуры

&НаКлиенте
Процедура ЭтапВторой(Команда)
	ЭтапВторойНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЭтапТретийНаСервере()
	ОбОбработка = РеквизитФормыВЗначение("Объект");
	ОбОбработка.Организация = Организация;
	ОбОбработка.Подразделение = Подразделение;
	ОбОбработка.ЭтапТретий();
КонецПроцедуры

&НаКлиенте
Процедура ЭтапТретий(Команда)
	ЭтапТретийНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЭтапПервыйНаСервере()
	ОбОбработка = РеквизитФормыВЗначение("Объект");
	ОбОбработка.Организация = Организация;
	ОбОбработка.Подразделение = Подразделение;
	
	ПараметрыОбработки = Новый Структура; 
	ПараметрыОбработки.Вставить("Организация",Организация);
	ПараметрыОбработки.Вставить("Подразделение",Подразделение.ВыгрузитьЗначения());
	ОбОбработка.ЭтапПервый(ПараметрыОбработки); 	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапПервый(Команда)
	ЭтапПервыйНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЭтапЧетвертыйНаСервере()
	ОбОбработка = РеквизитФормыВЗначение("Объект");
	ОбОбработка.Организация = Организация;
	ОбОбработка.Подразделение = Подразделение;
	ОбОбработка.ЭтапЧетвертый();
КонецПроцедуры

&НаКлиенте
Процедура ЭтапЧетвертый(Команда)
	ЭтапЧетвертыйНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЭтапПятыйНаСервере()
	ОбОбработка = РеквизитФормыВЗначение("Объект");
	ОбОбработка.Организация = Организация;
	ОбОбработка.Подразделение = Подразделение;
	ОбОбработка.ЭтапПятый();
КонецПроцедуры

&НаКлиенте
Процедура ЭтапПятый(Команда)
	ЭтапПятыйНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЭтапШестойНаСервере()
	ОбОбработка = РеквизитФормыВЗначение("Объект");
	ОбОбработка.Организация = Организация;
	ОбОбработка.Подразделение = Подразделение;
	ОбОбработка.ЭтапШестой();

КонецПроцедуры

&НаКлиенте
Процедура ЭтапШестой(Команда)
	ЭтапШестойНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЭтапСедьмойНаСервере() 
	
	ОбОбработка = РеквизитФормыВЗначение("Объект");
	ОбОбработка.Организация = Организация;
	ОбОбработка.Подразделение = Подразделение;
	ОбОбработка.ЭтапСедьмой();


КонецПроцедуры

&НаКлиенте
Процедура ЭтапСедьмой(Команда)
	ЭтапСедьмойНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЭтапВосьмойНаСервере() 
	
	ОбОбработка = РеквизитФормыВЗначение("Объект");
	ОбОбработка.Организация = Организация;
	ОбОбработка.Подразделение = Подразделение;
	
	ПараметрыОбработки = Новый Структура; 
	ПараметрыОбработки.Вставить("Организация",Организация);
	ПараметрыОбработки.Вставить("Подразделение",Подразделение.ВыгрузитьЗначения());
	
	ОбОбработка.ЭтапВосьмой(ПараметрыОбработки);  
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапВосьмой(Команда)
	ЭтапВосьмойНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВвестиПарольДоступаКЗакрытомуКлючу(Команда)
	
	ПарольДоступаКЗакрытомуКлючу = ""; 
	
	ОписаниеВвода = Новый ОписаниеОповещения("ПослеВВодаКлюча",ЭтаФорма); 
	
	ПоказатьВводЗначения(ОписаниеВвода,ПарольДоступаКЗакрытомуКлючу,"Введите пароль к ключу ЭЦП"); 
	
	//ВвестиЗначение(ПарольДоступаКЗакрытомуКлючу, "Введите пароль к ключу ЭЦП");
		
КонецПроцедуры
	
	// <Описание процедуры>
	//
	// Параметры:
	//  <Параметр1>  - <Тип.Вид> - <описание параметра>
	//                 <продолжение описания параметра>
	//  <Параметр2>  - <Тип.Вид> - <описание параметра>
	//                 <продолжение описания параметра>
	//
&НаКлиенте
Процедура ПослеВВодаКлюча(ЗначениеВвода,ДополнительныеПараметры) Экспорт 
	
	Если ЗначениеВвода <> неопределено Тогда
		
		ПослеВВодаКлючаНаСервере(ЗначениеВвода);   	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеВВодаКлючаНаСервере(Знач ЗначениеВвода)
	
	Перем КлючОбъекта_ДляНастроек;
	
	КлючОбъекта_ДляНастроек = "АпиЧЗ";
	
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта_ДляНастроек, "ПарольДоступаКЗакрытомуКлючу", ЗначениеВвода);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаказыНаЭмиссиюНаСервере()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
	                      |ГДЕ
	                      |	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Проведен
	                      |	И ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Дата >= ДАТАВРЕМЯ(2025, 8, 1)
	                      |	И ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Статус = Значение(Перечисление.СтатусыДокументовМаркировки.Вработе)");
	ЗаказыКМ.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗаказыНаЭмиссию(Команда)
	ЗаполнитьЗаказыНаЭмиссиюНаСервере();
КонецПроцедуры
 // ()

