//Кухарь А.Ю. 18.05.2025 начало 
Процедура ЗаписатьВЛогФоново(ИмяЛога,Сообщение,ТипСообщения, ДопПараметры = Неопределено, АдресВозврата = Неопределено) экспорт 	
	//Пример вызова
	//пВыполнения 		= инт_ДлительныеОперации.ПараметрыВыполненияВФоне();			
	//КоличествоПотоков	= 1;			
	//пПроцедуры = Новый Массив;
	//пПроцедуры.Добавить("Отладка");	
	//пПроцедуры.Добавить(СтрШаблон("%1. Дубль кода %2",Выборка.Дата,Выборка.ШКУпаковки));	
	//пПроцедуры.Добавить("Система");	
	//рЗапуска = инт_ДлительныеОперации.ВыполнитьВФоне("РегистрыСведений.Логи.ЗаписатьВЛогФоново", пПроцедуры, пВыполнения); 
	
	ЗаписатьВЛог(ИмяЛога,Сообщение,ТипСообщения);
КонецПроцедуры				
//Кухарь А.Ю. 18.05.2025 конец
					