
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЭтотОбъект.Статус = Перечисления.СтатусыЗаявокНаУстановкуЦен.ВРаботе;
	ЭтотОбъект.Автор = ПараметрыСеанса.Пользователь;
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда Возврат; КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПрайсЛист") Тогда
		ЭтотОбъект.ВидЗаявки = Перечисления.ВидыЗаявокНаУстановкуЦен.ПродлениеЦен;
		
		ЭтотОбъект.ДокОснование = ДанныеЗаполнения;
		
		МассивПолей = Новый Массив;
		МассивПолей.Добавить("ТипЦен");
		МассивПолей.Добавить("Комментарий");
		
		ЗначенияРеквизитовОснования = ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, СтрСоединить(МассивПолей, ","));
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗначенияРеквизитовОснования);
		
		// заполним ТЧ ЦеныНоменклатуры существующими ценами
		НаборЗаписей = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Прайс.Установить(ДанныеЗаполнения);
		НаборЗаписей.Прочитать();
		
		ЭтотОбъект.ЦеныНоменклатуры.Загрузить(НаборЗаписей.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.Автор = ПараметрыСеанса.Пользователь;
	ЭтотОбъект.Статус = Перечисления.СтатусыЗаявокНаУстановкуЦен.ВРаботе;
КонецПроцедуры
