
Функция НачатьОбмен(КодУзла, НомерОтправленного, НомерПринятого)	
	
	УзелОбмена = ПланыОбмена.МобильныеТСД.НайтиПоКоду(КодУзла);
	
	Если УзелОбмена.Пустая() Тогда Возврат "" КонецЕсли;	
	
	Если УзелОбмена.НомерОтправленного <> НомерОтправленного ИЛИ УзелОбмена.НомерПринятого <> НомерПринятого Тогда
		
		Узел 					= УзелОбмена.ПолучитьОбъект();
		
		Узел.НомерОтправленного = НомерОтправленного;		
		Узел.НомерПринятого		= НомерПринятого;
		
		Узел.Записать();
		
		//Обмен.ЗарегистрироватьИзмененияДанных(УзелОбмена);		
	КонецЕсли;	
	
	Возврат УзелОбмена.Код;	
КонецФункции

//Кухарь 15.08.19 начало
//Не пойму зачем 2 раза соединятся с базой через WS
//если можно всё сделать 1м соединением
//Перенёс сюда функцию НачатьОбмен() а её саму удалю потом, когда выясню, что ничего не сломалось
//Функция ПолучитьДанные(КодУзла,ШтрихКод)
Функция ПолучитьДанные(КодУзла,ШтрихКод, НомерОтправленного, НомерПринятого, ВидКоманды, ТаблицаПараметров)
	ДанныеЗамера = ОценкаПроизводительностиКлиентСервер.НачатьЗамерФункции("wsExchangeTSD.ПолучитьДанные");	
	Ошибки = "";
	
	ЧтениеJSON = Новый ЧтениеJSON;                                 
	ЧтениеJSON.УстановитьСтроку(ТаблицаПараметров);
	СтруктураДопПараметров = Новый Структура;
	
	пока ЧтениеJSON.Прочитать() цикл
		если ЧтениеJSON.ТипТекущегоЗначения=ТипЗначенияJSON.ИмяСвойства тогда
			ИмяСвойства=ЧтениеJSON.ТекущееЗначение;
			Продолжить;
		КонецЕсли;
		если ИмяСвойства<>Неопределено и (ЧтениеJSON.ТипТекущегоЗначения=ТипЗначенияJSON.Строка или ЧтениеJSON.ТипТекущегоЗначения=ТипЗначенияJSON.Число или ЧтениеJSON.ТипТекущегоЗначения=ТипЗначенияJSON.Булево)  тогда
			СтруктураДопПараметров.Вставить(ИмяСвойства,ЧтениеJSON.ТекущееЗначение);
		КонецЕсли;
	КонецЦикла;
	//////////////////////////////////////////////////////////
	
	// Кухарь А.Ю.  18.01.2023 начало
	// проверим, что дата на ТСД - правильная
	если СтруктураДопПараметров.Свойство("ТекущаяДатаТСД") тогда
		попытка
			ТекущаяДатаТСД=СтруктураДопПараметров.ТекущаяДатаТСД;
			ТекущаяДатаТСД=СтрЗаменить(ТекущаяДатаТСД,"-","");
			ТекущаяДатаТСД=СтрЗаменить(ТекущаяДатаТСД,"T","");
			ТекущаяДатаТСД=СтрЗаменить(ТекущаяДатаТСД,":","");
			ТекущаяДатаТСД=Дата(ТекущаяДатаТСД);
			
			Дельта=Модуль(ТекущаяДатаТСД-ТекущаяДата());
			если дельта>3600 тогда
				возврат Новый ХранилищеЗначения("Ошибки: Неверная дата устройства. Настройте на ТСД правильные дату и время.", Новый СжатиеДанных(9));
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	УзелОбмена = ПланыОбмена.МобильныеТСД.НайтиПоКоду(КодУзла);
	
	Если УзелОбмена.Пустая() Тогда		
		ВызватьИсключение("Неизвестное устройство – " + КодУзла);		
	КонецЕсли;
	
	Если УзелОбмена.НомерОтправленного <> НомерОтправленного ИЛИ УзелОбмена.НомерПринятого <> НомерПринятого Тогда		
		Узел 					= УзелОбмена.ПолучитьОбъект();	
		Узел.НомерОтправленного = НомерОтправленного;		
		Узел.НомерПринятого		= НомерПринятого;		
		Узел.Записать();		
	КонецЕсли;	
	
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("ШтрихКодСпецификации", "");
	
	Если ШтрихКод <> "" Тогда			
		
		// Кельманов А.В. - SNL-120 - 2026.04.08 {
		//Результат = ОбменСТСД.ЗарегистрироватьЗаданиеНаНаборПоШК(УзелОбмена, ШтрихКод, Ошибки, СтруктураДопПараметров);	
		//
		//Если Не Результат Тогда		
		//	
		//	Ошибки = "Ошибки:" + Ошибки;			
		//	
		//	Возврат Новый ХранилищеЗначения(Ошибки, Новый СжатиеДанных(9));	
		//	
		//КонецЕсли;
		//
		//ДопПараметры.ШтрихКодСпецификации = ШтрихКод;
		Если ВидКоманды = "ПолучитьДанныеFBS" Тогда
			
			Результат = ОбменСТСД.ЗарегистрироватьДанныеFBSПоНакладной(УзелОбмена, ШтрихКод, Ошибки, СтруктураДопПараметров);	
			
			Если Не Результат Тогда		
				
				Ошибки = "Ошибки:" + Ошибки;			
				
				Возврат Новый ХранилищеЗначения(Ошибки, Новый СжатиеДанных(9));	
				
			КонецЕсли;
			
			ДопПараметры.Вставить("ДополнительныеДанныеДляFBS", Истина);
			
		Иначе
			
			Результат = ОбменСТСД.ЗарегистрироватьЗаданиеНаНаборПоШК(УзелОбмена, ШтрихКод, Ошибки, СтруктураДопПараметров);	
			
			Если Не Результат Тогда		
				
				Ошибки = "Ошибки:" + Ошибки;			
				
				Возврат Новый ХранилищеЗначения(Ошибки, Новый СжатиеДанных(9));	
				
			КонецЕсли;
			
			ДопПараметры.ШтрихКодСпецификации = ШтрихКод;
			
		КонецЕсли;
		// Кельманов А.В. - SNL-120 - 2026.04.08 }
			
	КонецЕсли;
	
	
	// Кухарь А.Ю.  22.06.2025 начало 
	// HELP-5280
	если ВидКоманды = "ПолучитьЛистыЗНА" тогда    
		ДопПараметры.Вставить("Узел",УзелОбмена);   
		если СтруктураДопПараметров.Свойство("ШтрихКод") тогда
			ДопПараметры.Вставить("ШтрихКод",СтруктураДопПараметров.ШтрихКод); 
		иначе  
			ДопПараметры.Вставить("ШтрихКод",""); 
		КонецЕсли;
		
		если СтруктураДопПараметров.Свойство("УИД_ЗНА") тогда
			ДопПараметры.Вставить("УИД_ЗНА",СтруктураДопПараметров.УИД_ЗНА); 
		иначе  
			ДопПараметры.Вставить("УИД_ЗНА",""); 
		КонецЕсли;
		
		
		если СтруктураДопПараметров.Свойство("НужныТолькоЛП") тогда
			ДопПараметры.Вставить("НужныТолькоЛП",СтруктураДопПараметров.НужныТолькоЛП); 
		иначе  
			ДопПараметры.Вставить("НужныТолькоЛП",ложь); 
		КонецЕсли;			
		
		если СтруктураДопПараметров.Свойство("Сканировщик") тогда
			ДопПараметры.Вставить("Сканировщик",СтруктураДопПараметров.Сканировщик); 
		иначе  
			ДопПараметры.Вставить("Сканировщик",Справочники.ФизическиеЛица.ПустаяСсылка()); 
		КонецЕсли;			
		
		если СтруктураДопПараметров.Свойство("КоличествоКоробок") тогда
			ДопПараметры.Вставить("КоличествоКоробок",СтруктураДопПараметров.КоличествоКоробок); 
		иначе  
			ДопПараметры.Вставить("КоличествоКоробок",1); 
		КонецЕсли;		
		
		
		РезультатПолучения =  ОбменСТСД.ЗарегистрироватьДанныеЗНА(ДопПараметры);  
		если не РезультатПолучения.Успех тогда    
			Ошибки = "Ошибки:" + СтрСоединить(РезультатПолучения.Ошибки,", ");
			Возврат Новый ХранилищеЗначения(Ошибки, Новый СжатиеДанных(9));
		КонецЕсли;	
	КонецЕсли;
	// Кухарь А.Ю.  22.06.2025 конец
	
	// Кельманов А.В. - ASU-2104 - 2025.03.22 {
	Если ВидКоманды = "СоздатьПолучитьДанныеЛСК" Тогда
		
		Если СтруктураДопПараметров.Свойство("ДополнительныеДанные") Тогда
			
			// Кельманов А.В. - HELP-3850 - 2025.04.07 {
			//Результат = СоздатьПолучитьЛСК_ДляТСД(УзелОбмена, Ошибки, СтруктураДопПараметров.ДополнительныеДанные);
			Результат = СоздатьПолучитьЛСК_ДляТСД(УзелОбмена, Ошибки, СтруктураДопПараметров);
			// Кельманов А.В. - HELP-3850 - 2025.04.07 }
			
			Если Не Результат Тогда
				
				Ошибки = "Ошибки:" + Ошибки;
				
				Возврат Новый ХранилищеЗначения(Ошибки, Новый СжатиеДанных(9));
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	// Кельманов А.В. - ASU-2104 - 2025.03.22 }
	
	Если ВидКоманды = "ЗагрузитьНачальныеДанные" Тогда
		
		ОбменСТСД.ЗарегистрироватьНачальныеДанные(УзелОбмена);
		
		// Кельманов А.В. - ASU-1746 - 2025.02.11 {
	ИначеЕсли ВидКоманды = "ОбновитьПринтерыЭтикеток" Тогда
		
		ОбменСТСД.ЗарегистрироватьСправочникПринтерыЭтикеток(УзелОбмена);
		
		// Кельманов А.В. - ASU-1746 - 2025.02.11 }
		
		// Кухарь А.Ю. 07.04.2022 начало
	ИначеЕсли СтрНайти(ВидКоманды, "ЗагрузитьТипКоробаПоШК") > 0 Тогда
		
		ШК = СтрЗаменить(ВидКоманды, "ЗагрузитьТипКоробаПоШК", "");
		
		Результат = ОбменСТСД.ЗарегистрироватьТипКоробаПоШК(УзелОбмена, ШК, Ошибки);
		
		Если Не Результат Тогда
			
			Возврат Новый ХранилищеЗначения("Ошибки:" + Ошибки, Новый СжатиеДанных(9));
			
		КонецЕсли;		
		// Кухарь А.Ю. 07.04.2022 конец
		
	КонецЕсли;
	ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерФункции(ДанныеЗамера);  
	ОценкаПроизводительностиКлиентСервер.ЗаписатьКэшЛогов();
	
	Возврат ОбменСТСД.СформироватьПакетОбмена(УзелОбмена, ДопПараметры);	
	
КонецФункции

Функция ЗаписатьДанные(КодУзла, ДанныеМобильногоПриложения, ТаблицаПараметров)
	
    ДанныеЗамера = ОценкаПроизводительностиКлиентСервер.НачатьЗамерФункции("wsExchangeTSD.ЗаписатьДанные");	
	УзелОбмена = ПланыОбмена.МобильныеТСД.НайтиПоКоду(КодУзла);
	
	Если УзелОбмена.Пустая() Тогда
		ВызватьИсключение("Неизвестное устройство - " + КодУзла);
	КонецЕсли;
	
	Ошибки = "";
	
	Оповещения = ""; 

	ЧтениеJSON = Новый ЧтениеJSON;                                 
	ЧтениеJSON.УстановитьСтроку(ТаблицаПараметров);
	
	СтруктураДопПараметров = Новый Структура;
	
	Пока ЧтениеJSON.Прочитать() Цикл
		
		Если ЧтениеJSON.ТипТекущегоЗначения = ТипЗначенияJSON.ИмяСвойства Тогда
			ИмяСвойства = ЧтениеJSON.ТекущееЗначение;
			Продолжить;
		КонецЕсли;
		
		Если ИмяСвойства <> Неопределено И (ЧтениеJSON.ТипТекущегоЗначения = ТипЗначенияJSON.Строка Или ЧтениеJSON.ТипТекущегоЗначения = ТипЗначенияJSON.Число 
			Или ЧтениеJSON.ТипТекущегоЗначения = ТипЗначенияJSON.Булево) Тогда
			СтруктураДопПараметров.Вставить(ИмяСвойства, ЧтениеJSON.ТекущееЗначение);
		КонецЕсли;
		
	КонецЦикла;

	МассивОбъектовСОшибками = Неопределено;
	
	Результат = ОбменСТСД.ПринятьПакетОбмена(УзелОбмена, ДанныеМобильногоПриложения, СтруктураДопПараметров, Ошибки, Оповещения, МассивОбъектовСОшибками);
	
	ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерФункции(ДанныеЗамера);  
	ОценкаПроизводительностиКлиентСервер.ЗаписатьКэшЛогов();
	
	
	Если Ошибки = "" И Оповещения <> "" Тогда
		
		Оповещения = "Оповещение " + Оповещения;
		
		Возврат Оповещения;
	Иначе
		Если ТипЗнч(МассивОбъектовСОшибками) = Тип("Массив") Тогда
			
			МассивОбъектовСОшибками.Добавить(Ошибки);
			
			Возврат Сериализовать(Новый ХранилищеЗначения(Сериализовать(МассивОбъектовСОшибками), Новый СжатиеДанных(9)));
		Иначе
			Возврат Ошибки;
		КонецЕсли;
	КонецЕсли;
КонецФункции

Функция ЗаписатьЛоги(КодУзла,ТекстЛога)
	УзелОбмена = ПланыОбмена.МобильныеТСД.НайтиПоКоду(КодУзла);
	
	Если УзелОбмена.Пустая() Тогда
		ВызватьИсключение("Неизвестное устройство - " + КодУзла);
	КонецЕсли;
	Ошибки="";
	
	Результат= ОбменСТСД.ЗаписатьЛоги(УзелОбмена, ТекстЛога,,Ошибки);
	
	
	возврат Ошибки;
	
КонецФункции

Функция ПолучитьДанныеМарки(markName)
	
	Данные = ПолучитьДанныеКодаЧЗДляТСД(markName);
	
	Возврат Данные;
	
КонецФункции

// Кельманов А.В. - MARK-766 - 2025.01.31
Функция ПолучитьСвободныеКодыЧЗДляКомплектующих(ДанныеНоменклатуры)
    ДанныеЗамера = ОценкаПроизводительностиКлиентСервер.НачатьЗамерФункции("wsExchangeTSD.ПолучитьСвободныеКодыЧЗДляКомплектующих");	
	
	Данные = ПолучитьСвободныеКодыЧЗ(ДанныеНоменклатуры);
	
	ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерФункции(ДанныеЗамера);  
	ОценкаПроизводительностиКлиентСервер.ЗаписатьКэшЛогов();
	
	Возврат Данные;
	
КонецФункции

// Кельманов А.В. - MARK-766 - 2025.02.02
Функция ДобавлениеСпайкиВЛСКИЗаписьСвязкиСНомеромЗаказа(ДанныеСпайки)
    ДанныеЗамера = ОценкаПроизводительностиКлиентСервер.НачатьЗамерФункции("wsExchangeTSD.ДобавлениеСпайкиВЛСКИЗаписьСвязкиСНомеромЗаказа");	
	
	Ошибки = ДобавитьСпайкуВЛСКИЗаписатьСвязкуСНомеромЗаказа(ДанныеСпайки);
	
	ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерФункции(ДанныеЗамера);  
	ОценкаПроизводительностиКлиентСервер.ЗаписатьКэшЛогов();
	
	Возврат Ошибки;
	
КонецФункции

// Кельманов А.В. - ASU-2104 - 2025.03.22
Функция ДобавлениеСпайкиВВыбранныйЛСК_СУдалениемСтрокСПустымКодомКомплектующего(ДанныеСпайки)
    ДанныеЗамера = ОценкаПроизводительностиКлиентСервер.НачатьЗамерФункции("wsExchangeTSD.ДобавлениеСпайкиВВыбранныйЛСК_СУдалениемСтрокСПустымКодомКомплектующего");	
	
	Ошибки = ДобавитьСпайкуВВыбранныйЛСК_СУдалениемСтрокСПустымКодомКомплектующего(ДанныеСпайки);
	
	ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерФункции(ДанныеЗамера);  
	ОценкаПроизводительностиКлиентСервер.ЗаписатьКэшЛогов();
	
	Возврат Ошибки;
	
КонецФункции

// Кельманов А.В. - ASU-2104 - 2025.03.22
Функция УдалениеВЛСКСтрокСПустымиКодамиКомплектующих(ДанныеЛСК)
    ДанныеЗамера = ОценкаПроизводительностиКлиентСервер.НачатьЗамерФункции("wsExchangeTSD.УдалениеВЛСКСтрокСПустымиКодамиКомплектующих");	
	
	Ошибки = УдалитьВЛСКСтрокиСПустымиКодамиКомплектующих(ДанныеЛСК);
	
	ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерФункции(ДанныеЗамера);  
	ОценкаПроизводительностиКлиентСервер.ЗаписатьКэшЛогов();
	
	Возврат Ошибки;
	
КонецФункции

// Кельманов А.В. - ASU-2104 - 2025.03.22
Функция ПолучитьДанныеКомплектующихСпайки(ДанныеДляПолученияКомплектующих)
    ДанныеЗамера = ОценкаПроизводительностиКлиентСервер.НачатьЗамерФункции("wsExchangeTSD.ПолучитьДанныеКомплектующихСпайки");	
	
	Данные = ПолучитьДанныеКомплектующихСпайки_ДляТСД(ДанныеДляПолученияКомплектующих);
	
	ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерФункции(ДанныеЗамера);  
	ОценкаПроизводительностиКлиентСервер.ЗаписатьКэшЛогов();
	
	Возврат Данные;
	
КонецФункции

// Кельманов А.В. - HELP-4016 - 2025.04.22
Функция ЗаписьКодовЧЗВЛСК(ДанныеДляПередачи, ДанныеКодыСпаекИНомераЗаказов)
    ДанныеЗамера = ОценкаПроизводительностиКлиентСервер.НачатьЗамерФункции("wsExchangeTSD.ЗаписьКодовЧЗВЛСК");	
	
	Ошибки = ЗаписатьКодыЧЗВЛСК(ДанныеДляПередачи, ДанныеКодыСпаекИНомераЗаказов);
	
	ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерФункции(ДанныеЗамера);  
	ОценкаПроизводительностиКлиентСервер.ЗаписатьКэшЛогов();

	Возврат Ошибки;
	
КонецФункции

// Кельманов А.В. - HELP-4022 - 2025.04.29

// Кельманов А.В. - HELP-4758 - 2025.05.22 {
//Функция ЗавершениеСборкиСпаекПоЛСК(ДанныеЛСК)
//	
//	Ошибки = ЗавершитьСборкуСпаекПоЛСК(ДанныеЛСК);
//	
//	Возврат Ошибки;
//	
//КонецФункции

// Кельманов А.В. - SNL-88 - 2026.04.18 {
//Функция ЗавершениеСборкиСпаекПоЛСК(ДанныеЛСК, ДанныеНоменклатурыДляБронированияКодов)
Функция ЗавершениеСборкиСпаекПоЛСК(ДанныеЛСК, ДанныеНоменклатурыДляБронированияКодов, ДанныеТекущаяБригада)
// Кельманов А.В. - SNL-88 - 2026.04.18 }

	ДанныеЗамера = ОценкаПроизводительностиКлиентСервер.НачатьЗамерФункции("wsExchangeTSD.ЗавершениеСборкиСпаекПоЛСК");	
	
	// Кельманов А.В. - SNL-88 - 2026.04.18 {
	//Ошибки = ЗавершитьСборкуСпаекПоЛСК(ДанныеЛСК, ДанныеНоменклатурыДляБронированияКодов);
	Ошибки = ЗавершитьСборкуСпаекПоЛСК(ДанныеЛСК, ДанныеНоменклатурыДляБронированияКодов, ДанныеТекущаяБригада);
	// Кельманов А.В. - SNL-88 - 2026.04.18 }
	
	ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерФункции(ДанныеЗамера);  
	ОценкаПроизводительностиКлиентСервер.ЗаписатьКэшЛогов();

	Возврат Ошибки;
	
КонецФункции
// Кельманов А.В. - HELP-4758 - 2025.05.22 }

// Кельманов А.В. - HELP-4798 - 2025.05.20
Функция ПолучениеДанныхНоменклатурыПоВложеннымШК(КодАгрегации_Наименование)
    ДанныеЗамера = ОценкаПроизводительностиКлиентСервер.НачатьЗамерФункции("wsExchangeTSD.ПолучениеДанныхНоменклатурыПоВложеннымШК");	
	
	КодАгрегации = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоНаименованию(КодАгрегации_Наименование);
	
	Данные = ПолучитьДанныеНоменклатурыПоВложеннымШК(КодАгрегации);
	
	ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерФункции(ДанныеЗамера);  
	ОценкаПроизводительностиКлиентСервер.ЗаписатьКэшЛогов();

	Возврат Данные;
	
КонецФункции

// Кельманов А.В. - HELP-5298 - 2025.06.11
Функция ТекстZPLИзPDFПоНомеруЗаказа(НомерЗаказа)
	
	Данные = ПолучитьТекстZPLИзPDFПоНомеруЗаказа(НомерЗаказа);
	
	Возврат Данные;
	
КонецФункции

Функция ВыполнитьПроверкиTSD(Data,Info)
	
	СтруктураВозврата = новый Структура ("Успех,Ошибки,Данные",Ложь,Новый Массив,Неопределено);
	
    Данные = ДесериализоватьЛокальная(Data);	
    СтруктураДопПараметров = ДесериализоватьЛокальная(Info);

	Если  СтруктураДопПараметров.Свойство ("ИмяДействия")  тогда 
		если СтруктураДопПараметров.ИмяДействия = "ПроверитьЛистПереукладкиПередВыгрузкойИзТСД" тогда 
			СтруктураВозврата = ОбменСТСД.ПроверитьЛистПереукладкиПередВыгрузкойИзТСД(Данные);
		КонецЕсли;
	КонецЕсли;

	Возврат Сериализовать(Новый ХранилищеЗначения(Сериализовать(СтруктураВозврата), Новый СжатиеДанных(9)));

КонецФункции    

Функция ДесериализоватьЛокальная(XMLСтруктураСериализованногоОбъекта) 
	
	ЧтениеXMLДанных = Новый ЧтениеXML;
	ЧтениеXMLДанных.УстановитьСтроку(XMLСтруктураСериализованногоОбъекта);
	ТЗ = СериализаторXDTO.ПрочитатьXML(ЧтениеXMLДанных);
	ЧтениеXMLДанных.Закрыть();  
	Возврат ТЗ;
	
КонецФункции

// Кельманов А.В. - HELP-5158 - 2025.07.14
Функция ПроверитьКодыЧЗ_ДляЛН(ДанныеШКУпаковки, ДанныеШКНабора, ДанныеДокумента)
	
	Возврат ВыполнитьПроверкуКодовЧЗ_ДляЛН(ДанныеШКУпаковки, ДанныеШКНабора, ДанныеДокумента);
	
КонецФункции

// Кельманов А.В. - HELP-7030 - 2025.09.12
Функция ВыгрузитьЛН(ДанныеЛН)
	
	Ошибки = ОбработатьЗагруженныйСТСДЛистНабора(ДанныеЛН);
	
	Возврат Ошибки;
	
КонецФункции

// Кельманов А.В. - HELP-4834 - 2025.09.17
Функция ЗапроситьРеквизитыДляЭтикеткиОнлайн(ДанныеЛН)
	
	Данные = ПолучитьРеквизитыДляЭтикеткиОнлайн(ДанныеЛН);
	
	Возврат Данные;
	
КонецФункции

// Кельманов А.В. - HELP-5128 - 2025.10.01
Функция ОбработкаСканированияКоробаЧЗ(ДанныеКороба)
	
	Данные = ОбработкаСканированияКоробаЧЗДляТСД(ДанныеКороба);
	
	Возврат Данные;
	
КонецФункции

// Кельманов А.В. - ASU-2700 - 2026.01.28
Функция ДополнитьРеестрСканирования(ДанныеСканирования)
	
	Ошибки = ДополнитьРеестрСканированияДаннымиСТСД(ДанныеСканирования);
	
	Возврат Ошибки;
	
КонецФункции

// Кельманов А.В. - MARK-3462 - 2026.02.08
Функция ПроверитьВЧЗКодыДокумента(ДанныеДокумента)
	
	Ошибки = ПроверитьВЧЗКодыДокумента_ДляТСД(ДанныеДокумента);
	
	Возврат Ошибки;
	
КонецФункции

// Кельманов А.В. - Оптимизация работы - 2026.02.17
Функция ПроверитьДатуТСД(ТекущаяДатаТСД_Строка)
	
	Ошибки = "";
	
	ТекущаяДатаТСД = Дата(ТекущаяДатаТСД_Строка);
			
	Дельта = Модуль(ТекущаяДатаТСД - ТекущаяДата());
	
	Если Дельта > 300 Тогда
		
		Ошибки = "Неверная дата устройства. Настройте на ТСД правильные дату и время.";
		
	КонецЕсли;
			
	Возврат Ошибки;
	
КонецФункции

// Кельманов А.В. - SNL-122 - 2026.03.19
Функция ПроверитьИдКоробки(ШК)
	
	Ошибки = ПроверитьОтсканированныйИдКоробки(ШК);
	
	Возврат Ошибки;
	
КонецФункции

// Кельманов А.В. - SNL-120 - 2026.04.10
Функция ВыгрузитьЛПFBS(ДанныеЛП)
	
	Ошибки = ОбработатьЗагруженныйСТСДЛистПереукладкиFBS(ДанныеЛП);
	
	Возврат Ошибки;
	
КонецФункции

// Кельманов А.В. - SNL-235 - 2026.05.15
Функция ПроверитьТипКороба(КодТипаКороба)
	
	Ошибки = "";
	
	ТипКороба = Справочники.ТипыКоробов.НайтиПоКоду(КодТипаКороба);
	
	Если Не ЗначениеЗаполнено(ТипКороба.Объем) Тогда
		
		Ошибки = "Для типа короба """ + ТипКороба + """ (" + КодТипаКороба + ") не указан объём. Заполните объём типа короба в базе склада или отсканируйте другой ШК коробки.";
		
	КонецЕсли;
	
	Возврат Ошибки;
	
КонецФункции
