Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СостояниеДокументов.Документ КАК Документ,
	|	СостояниеДокументов.КодУзла,
	|	СостояниеДокументов.Состояние,
	//крохин начало 02.09.2013
	|	СостояниеДокументов.ДатаИзменения,
	//крохин конец 02.09.2013
	|	СостояниеДокументов.Автор,
	|	СостояниеДокументов.КодУзлаПолучателя
	|ИЗ
	|	РегистрСведений.СостояниеДокументов КАК СостояниеДокументов
	|ГДЕ
	|	СостояниеДокументов.КодУзлаПолучателя = &КодУзлаПолучателя
	|	И НЕ СостояниеДокументов.Отработана
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("КодУзлаПолучателя",ПараметрыСеанса.ЭтотУзел.Код);
	Выборка = Запрос.Выполнить().Выбрать();
	Н = 0;
	//крохин начало 11.08.2013
	ЗаписатьВЛог("ИзменениеСостоянияПервичныхДокументов","Количество документов: "+Выборка.Количество(),,,);
	//крохин конец 11.08.2013
	
	Пока Выборка.Следующий() Цикл
		Н = Н+1;
		Попытка    //на случай отсутствия объекта в базе
			Документ = Выборка.Документ.ПолучитьОбъект();
			//крохин начало 18.09.2013
			Если Документ = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			//крохин конец 18.09.2013
		Исключение
			Продолжить;
		КонецПопытки;
		
		Если Ложь Тогда 
			Документ = Документы.РасходнаяНакладная.НайтиПоНомеру("").ПолучитьОбъект();
		КонецЕсли;
		//крохин начало 11.08.2013
		//Документ.УстановитьСостояниеДокументов(Выборка.Состояние,Выборка.КодУзла);
		//крохин начало 02.09.2013
		//проверяем по журналу изменений
		//Если ПолучитьНомерСостояния(Документ.СостояниеДокументов) <= ПолучитьНомерСостояния(Выборка.Состояние) Тогда
		ТекстСсылки=Строка(Документ.Ссылка.УникальныйИдентификатор());
		ТаблицаСтатусов=ПолучениеСтатусов(ТекстСсылки,Документ.Ссылка,Выборка.ДатаИзменения);
		//крохин конец 02.09.2013	  

		Если Документ.СостояниеДокументов <> Выборка.Состояние Тогда
		//крохин начало 02.09.2013
		//Документ.УстановитьСостояниеДокументов(Выборка.Состояние,Выборка.КодУзла);
		Если ТаблицаСтатусов = Неопределено Тогда
		Документ.УстановитьСостояниеДокументов(Выборка.Состояние,Выборка.КодУзла);	
		КонецЕсли;
		//крохин конец 02.09.2013	
							   
		КонецЕсли;				   
	
	НЗ = РегистрыСведений.СостояниеДокументов.СоздатьНаборЗаписей();
	НЗ.Отбор.КодУзлаПолучателя.Установить(ПараметрыСеанса.ЭтотУзел.Код,Истина);
	НЗ.Отбор.КодУзла.Установить(Выборка.КодУзла,Истина);
	НЗ.Отбор.Документ.Установить(Документ.Ссылка,Истина);
	Запись = НЗ.Добавить();
	Запись.Регистратор = Документ.Ссылка;
	Запись.Состояние = Выборка.Состояние;
	Запись.Автор = Выборка.Автор;
	Запись.КодУзлаПолучателя = ПараметрыСеанса.ЭтотУзел.Код;
	Запись.Документ = Документ.Ссылка;
	запись.КодУзла =  Выборка.КодУзла;
	Запись.Отработана = Истина;
	//крохин начало 02.09.2013
	запись.ДатаИзменения = Выборка.ДатаИзменения;
	//крохин конец 02.09.2013
	НЗ.Записать();
	//крохин конец 11.08.2013
	#Если Клиент Тогда
		Сообщить(Н);
	#КонецЕсли
	//крохин начало 11.08.2013  
	Если Н > 1 И Цел((Н-1)/100) = (Н-1)/100 Тогда
		ЗаписатьВЛог("ИзменениеСостоянияПервичныхДокументов","Обработано документов: "+(Н-1),,,);
	КонецЕсли;
	//крохин конец 11.08.2013
КонецЦикла;
#Если Клиент Тогда
	Сообщить("обработка завершена");
#КонецЕсли
//крохин начало 11.08.2013
ЗаписатьВЛог("ИзменениеСостоянияПервичныхДокументов","Обработка завершена .Обработано документов: "+(Н-1),,,);
//крохин конец 11.08.2013
КонецПроцедуры

Функция ПолучитьНомерСостояния(Состояние)
Если Состояние = Перечисления.СостояниеДокументов.НеВыписаны Тогда
	Возврат 0;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.Выписаны Тогда
	возврат 1;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.ВыписаныПовторно Тогда
	возврат 4;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.Получены Тогда
	возврат 4;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.ПолученыСИзменениями Тогда
	возврат 4;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.ПодтвержденаСумма Тогда
	возврат 2;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.ПодтвержденаСуммаСИзменениями Тогда
	возврат 2;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.ОшибкиОформления Тогда
	возврат 2;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.ПолученоИзображение Тогда
	возврат 2;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.Проверены Тогда
	возврат 5;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.ГотовыКОтправкеВОФис Тогда
	возврат 5;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.ПолученДокументЗаместитель Тогда
	возврат 3;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.НаСкладе Тогда
	возврат 4;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.ОтправленВОфис Тогда
	возврат 6;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.ВозвращенВАрхив Тогда
	возврат 6;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.ОтправленВПРО Тогда
	возврат 6;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.ВнесеныИзменения Тогда
	возврат 4;
ИначеЕсли 
	Состояние = Перечисления.СостояниеДокументов.ПолученыВФилиале Тогда
	возврат 6;
КонецЕсли;
Возврат 0;

КонецФункции


функция ПолучениеСтатусов(ТекстСсылки,накладная,ДатаИзменения)
	
	отбор= новый Структура;
	отбор.Вставить("реквизит","СостояниеДокументов");
	
	запрос= Новый Запрос;
	запрос.Текст="ВЫБРАТЬ
	             |	ЖурналРегистрации.Изменения,
	             |	ЖурналРегистрации.Дата КАК Дата,
	             |	ЖурналРегистрации.Пользователь,
	             |	ЖурналРегистрации.НомерСообщения
	             |ИЗ
	             |	РегистрСведений.ЖурналРегистрации КАК ЖурналРегистрации
	             |ГДЕ
	             |	ЖурналРегистрации.ТекстСсылки = &ТекстСсылки
				 //крохин начало 02.09.2013
	             |	И ЖурналРегистрации.Дата > &ДатаИзменения
				 //крохин конец 02.09.2013
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Дата УБЫВ
	             |АВТОУПОРЯДОЧИВАНИЕ";
	запрос.УстановитьПараметр("ТекстСсылки",ТекстСсылки);
		 //крохин начало 02.09.2013
	             запрос.УстановитьПараметр("ДатаИзменения",ДатаИзменения);
				 //крохин конец 02.09.2013

	результат=запрос.Выполнить().Выгрузить();
	
	сч=0;
	
	
	для каждого СтрокаРезультата из результат цикл
		если СтрокаРезультата.изменения.получить()= Неопределено тогда
			продолжить;
		КонецЕсли;
		Если СтрокаРезультата.НомерСообщения <> 0 Тогда
			Продолжить;
		КонецЕсли;

		//Кухарь 22.02.19 начало
		//Изменения=ЗначениеИзСтрокиВнутр(СтрокаРезультата.изменения.получить()).Реквизиты;
		
		если  СтрокаРезультата.изменения.получить()="" тогда
			Продолжить;
		иначе
			Изменения=ЗначениеИзСтрокиВнутр(СтрокаРезультата.изменения.получить()).Реквизиты;
		КонецЕсли;
		//Кухарь 22.02.19 конец		 
 

		НаличиеСостояний=Изменения.найтистроки(отбор);
		
		если НаличиеСостояний.количество()=0 тогда
			продолжить;
			
		иначеесли НаличиеСостояний.количество()=1 тогда
			
			ТаблицаСтатусов = Новый Структура;
			ТаблицаСтатусов.Вставить("Документ",накладная.ссылка);
			ТаблицаСтатусов.Вставить("ДатаИзменения",СтрокаРезультата.дата);
			ТаблицаСтатусов.Вставить("Состояние",НаличиеСостояний.получить(0).получить(2));
			Возврат ТаблицаСтатусов;	
		иначе 
			//Сообщить("ошибка алгоритма, обратитесь в IT отдел");
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;			
	
КонецФункции

