Функция НайтиСоздатьЛистМаркировки (ДокОснование,ЛистНабора=Неопределено) экспорт
	// Кухарь А.Ю.  04.07.2024 начало
	возврат СоздатьЛистМаркировки(ДокОснование,ЛистНабора);	
	// Кухарь А.Ю.  04.07.2024 конец
	
	
	если ЛистНабора=Неопределено тогда
		ЛистНабора=документы.ЛистНабора.ПустаяСсылка();
	КонецЕсли;
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	             |	ЛистМаркировки.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ.ЛистМаркировки КАК ЛистМаркировки
	             |ГДЕ
	             |	ЛистМаркировки.ДокОснование = &ДокОснование
	             |	И ЛистМаркировки.Проведен
	             |	И ЛистМаркировки.ЛистНабора = &ЛистНабора";
	запрос.УстановитьПараметр("ДокОснование",ДокОснование);
	запрос.УстановитьПараметр("ЛистНабора",ЛистНабора);
	выборка=запрос.Выполнить().Выбрать();
	если выборка.Количество()=0 тогда
		 возврат СоздатьЛистМаркировки(ДокОснование,ЛистНабора);
	 КонецЕсли;
	 
	пока выборка.Следующий() цикл
		возврат выборка.ссылка;
	КонецЦикла;
	
КонецФункции

Функция СоздатьЛистМаркировки (ДокОснование,ЛистНабора)
	ЛистМаркировки=Документы.ЛистМаркировки.СоздатьДокумент();
	ЛистМаркировки.ДокОснование=ДокОснование;
	ЛистМаркировки.ОбработкаЗаполнения(ДокОснование,"",Истина);
	ЛистМаркировки.ЛистНабора=ЛистНабора;
	
	// Кухарь А.Ю.  04.07.2024 начало
	// //ЛистМаркировки.Дата=ПолучитьРеквизитШапки(ЛистНабора,"Дата","Документ")-1;
	ЛистМаркировки.Дата=ТекущаяДатаСеанса();	 
	// Кухарь А.Ю.  04.07.2024 конец
	
	ЛистМаркировки.Записать();
	Возврат ЛистМаркировки.Ссылка;
КонецФункции
