
&НаКлиенте
Процедура УдалитьМусор(Команда)	
	//СтруктураФЗ = УдалитьМусорНаСервере();
	//ИДЗадания 	= СтруктураФЗ.ИдентификаторЗадания;
	//
	//ПараметрыОжидания  = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	//ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	//ПараметрыОжидания.Интервал  = 2;
	//
	//ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФЗ, Новый ОписаниеОповещения("ОбработатьДанные", ЭтотОбъект), ПараметрыОжидания);
КонецПроцедуры


&НаСервере
Функция УдалитьМусорНаСервере()
	
	//ПараметрыПроцедуры	= Новый Структура;
	//ПараметрыВыполнения	= ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	//ПараметрыВыполнения.Вставить("АдресРезультата",ПоместитьВоВременноеХранилище(Неопределено,ЭтаФорма.УникальныйИдентификатор));
	//
	//Возврат ДлительныеОперации.ВыполнитьВФоне("Справочники.СтатистикаОбменов.УдалитьМусор",ПараметрыПроцедуры,ПараметрыВыполнения);		

КонецФункции


&НаСервере
Функция ПолучитьДанныеНаСервере(Ссылка)
	Результат  = "";
	Если Ссылка<>Неопределено Тогда
		Результат = Ссылка.ПолучитьОбъект().ДанныеСообщения.Получить();	
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции


&НаКлиенте
Процедура СохранитьДанныеВФайл(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);	
	
	Диалог.Заголовок				= "Выберите файл";
	Диалог.ПолноеИмяФайла			= "";
	Диалог.ПредварительныйПросмотр	= Истина;
	Диалог.Фильтр					= "Файл XML (*.xml)|*.xml"; 	

	Если Диалог.Выбрать() Тогда
		СтрокаСообщения	= ПолучитьДанныеНаСервере(Элементы.Список.ТекущаяСтрока);
		Пакет 			= ЗначениеИзСтрокиВнутр(СтрокаСообщения);
		
		ХЗ		= XMLЗначение(Тип("ХранилищеЗначения"),Пакет.Данные[0]);
		Строка	= ХЗ.Получить();
		
		Запись = Новый ЗаписьТекста(Диалог.ПолноеИмяФайла);
		Запись.Записать(Строка);
		Запись.Закрыть();
		
		Сообщить("Данные записаны в файл: "+Диалог.ПолноеИмяФайла);
	КонецЕсли;	
	
КонецПроцедуры
 