Функция ОтправитьЗапросВЧЗ(ИмяМетода,МетодHTTP,ТелоЗапроса,БезContentType = ложь) Экспорт

	Сертификаты = ОбменСЧЗЧерезОУКЭП.ПолучитьСписокСертификатовСИНН();
	ОтработаноПоСтанцииУспешно = Ложь; 
	Для Каждого Серт Из Сертификаты Цикл
		
		Если ОтработаноПоСтанцииУспешно Тогда
			
			прервать; 
			
		КонецЕсли;
		
		Токен_TrueApi_Данные = РегистрыСведений.ТокеныАвторизацииИСМП.ПолучитьТокен("TrueApi", Справочники.Организации.НайтиПоКоду("SS-001"), Серт.Значение);
		
		Если Токен_TrueApi_Данные.Успешно Тогда
			
			Токен_TrueApi = Токен_TrueApi_Данные.Данные.Токен; 	
			
			ОтработаноПоСтанцииУспешно = Истина;
		Иначе 
			ЗаписатьВЛог("Получение информации КМ","Не найден токен api","Ошибка");
			Продолжить; 
		КонецЕсли;
		
		ОбработкаАПИЧЗ = Обработки.АпиЧЗ.Создать();
		ОбработкаАПИЧЗ.Токен_TrueApi = Токен_TrueApi;  
		
		Результат 		= ОбработкаАПИЧЗ.СтруктураРезультата(Ложь);
		
		СоединениеХТТП	= ОбработкаАПИЧЗ.СоздатьСоединение_TrueApi();    		
		
		
		АдресРесурса	= ИмяМетода; //"api/v3/true-api/dispenser/tasks";
		
		
		ЗапросХТТП 		= СоздатьЗапрос_TrueApi(АдресРесурса, ТелоЗапроса,Токен_TrueApi,БезContentType);
		
		
		//
		ПолучитьФайл = БезContentType;
		
		Если ПолучитьФайл Тогда
			
			рЗапроса 		= ВыполнитьЗапрос_TrueApi(ЗапросХТТП, МетодHTTP, Токен_TrueApi,СоединениеХТТП,ПолучитьФайл);
			
		Иначе 
			
			рЗапроса 		= ОбработкаАПИЧЗ.ВыполнитьЗапрос_TrueApi(ЗапросХТТП, МетодHTTP, СоединениеХТТП);
		КонецЕсли;
		
		
		
		Возврат  рЗапроса; 	
		
		
	КонецЦикла;


КонецФункции 


Функция ВыполнитьЗапрос_TrueApi(Знач ЗапросХТТП, МетодХТТП = "GET", Токен_TrueApi, Знач СоединениеХТТП = Неопределено, ПолучитьФайл = Ложь) Экспорт
	
	ОбработкаАПИЧЗ = Обработки.АпиЧЗ.Создать();
	ОбработкаАПИЧЗ.Токен_TrueApi = Токен_TrueApi;
	
	Если СоединениеХТТП = Неопределено Тогда
		СоединениеХТТП 	= ОбработкаАПИЧЗ.СоздатьСоединение_TrueApi();	
	КонецЕсли;
	
	Если ТипЗнч(ЗапросХТТП) = Тип("Строка") Тогда	
		ЗапросХТТП = ОбработкаАПИЧЗ.СоздатьЗапрос_TrueApi(ЗапросХТТП);	
	КонецЕсли;
	
	Результат = Новый Структура("Успешно,Сообщения,Ошибки,КодСостояния,Ответ", Истина, Новый Массив, Новый Массив, "");
	
	Начало  = ТекущаяУниверсальнаяДатаВМиллисекундах(); 
		
	Ответ 	= СоединениеХТТП.ВызватьHTTPМетод(МетодХТТП, ЗапросХТТП);
	Если НЕ ПолучитьФайл Тогда
		
		Текст	= Ответ.ПолучитьТелоКакСтроку(); 
		Результат.Ответ			= Текст;
	Иначе 
		
		ДД =  Ответ.ПолучитьТелоКакДвоичныеДанные();
		
		АдресВременногоХранилища  = Новый УникальныйИдентификатор; 
		АдресВХ = ПоместитьВоВременноеХранилище(ДД,АдресВременногоХранилища); 
		
		Результат.Ответ = АдресВХ;
		
	КонецЕсли;
	
	
	Результат.КодСостояния	= Ответ.КодСостояния;
	
	
	Если Ответ.КодСостояния = 200 Тогда
	ИначеЕсли Ответ.КодСостояния = 201 Тогда		
	Иначе		
		Результат.Успешно	= Ложь;		
		Результат.Ошибки.Добавить(Текст);
		
		Сообщить("Код cостояния: "+Ответ.КодСостояния, СтатусСообщения.ОченьВажное);	
		Сообщить(Текст);	
	КонецЕсли;	
		
	Возврат Результат;
КонецФункции  

Функция СоздатьЗапрос_TrueApi(АдресРесурса, ТекстЗапроса = "", Токен_TrueApi, БезContentType = Ложь) Экспорт
	ЗаголовкиХТТП = Новый Соответствие;
	ЗаголовкиХТТП.Вставить("Accept",		"*"); 
	Если НЕ БезContentType  Тогда
	
		ЗаголовкиХТТП.Вставить("Content-type",	"application/json; charset=utf-8");	
	
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(Токен_TrueApi) Тогда			
		ЗаголовкиХТТП.Вставить("Authorization", СтрШаблон("Bearer %1", Токен_TrueApi));			
	КонецЕсли;	
	
	ЗапросХТТП 				= Новый HTTPЗапрос;
	ЗапросХТТП.Заголовки	= ЗаголовкиХТТП;
	ЗапросХТТП.АдресРесурса	= АдресРесурса;
	
	Если ЗначениеЗаполнено(ТекстЗапроса) Тогда	
		ЗапросХТТП.УстановитьТелоИзСтроки(ТекстЗапроса);			
	КонецЕсли;
	
	Возврат ЗапросХТТП;
КонецФункции



