
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДобавитьСтатусВСписок("APPLIED", 	"Нанесен");
	ДобавитьСтатусВСписок("INTRODUCED", "В обороте");
	ДобавитьСтатусВСписок("*", 			"!!! Не проверять !!!");
КонецПроцедуры

&НаСервере
Функция ДобавитьСтатусВСписок(Значение, Представление)
	Элемент = ДопустимыеСтатусы.Добавить(Значение, Представление);
	Если СтрНайти(Запись.ДопустимыеСтатусы, Значение) > 0 Тогда
		Элемент.Пометка = Истина;	
	КонецЕсли;
КонецФункции //ДобавитьСтатусВСписок(Значение, Представление)

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	мСтатусы = Новый Массив;
	Для каждого Элемент Из ДопустимыеСтатусы Цикл
		Если Элемент.Пометка Тогда
			мСтатусы.Добавить(Элемент.Значение);					
		КонецЕсли;		
	КонецЦикла;
	Запись.ДопустимыеСтатусы = СтрСоединить(мСтатусы, ",");
КонецПроцедуры
