Перем ПутиПапок Экспорт;
Перем ПутиФайлов Экспорт;
Перем ИмяПути Экспорт;
Перем Контрагент Экспорт;
Перем ТипШк Экспорт;
Перем КодМетро Экспорт; 
Перем Файлы Экспорт;
Перем Ошибки Экспорт;
Перем КритичОшибки Экспорт;
Перем КрОшибки Экспорт;
Перем ТЗПЕчать,ТЗШапка Экспорт;

//----------------------------
Перем Отказ Экспорт;  // отказ в сохранении переменной - об обтправке
//--------------------------
Перем КритичОшибкиСтолетов Экспорт;

//-----------------------------------------------------
// *****  РИГЛА , о3   (е-майл)
//-----------------------------------------------------

Процедура Отправить()  Экспорт
	
	НомЗак=ДокОбъект.номерЗаказа;
	Если СокрЛП(НомЗак)="" Тогда
		
		ГСЧ = Новый ГенераторСлучайныхЧисел(255);
		НомЗак=ГСЧ.СлучайноеЧисло(0, 10000);
		
	КонецЕсли;	
	
	ИмяФайлаОбмена=""+константы.КаталогВнешнихОтчетов.Получить() +"temp\"+ НомЗак+".xml";
	
	//Сообщить(ИмяФайлаОбмена);
	Файл=Новый Файл(ИмяФайлаОбмена);
	
	
	ЗаписьХМЛ=Новый ЗаписьXML;
	ЗаписьХМЛ.ОткрытьФайл(ИмяФайлаОбмена);   //(Путь+Имя+".xml");
	ДокументДом=Новый ДокументDom("http://v8.1c./8.1/sample91_DOM","Document-Order");
	КорневойЭлемент=ДокументДом.ЭлементДокумента;
	//-------- Order-Header ------------------------------------------
	ЭлементДом=ДокументДом.СоздатьЭлемент("Order");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	//----------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("OrderNumber");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(ДокОбъект.Номер);
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("OrderDate");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДокОбъект.Дата));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("Buyer");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДокОбъект.Контрагент.ПолноеНаименование));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("AdresDostavki");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДокОбъект.ПунктДоставки.ПочтовыйАдрес));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	
	
	//-------------------------
	//    заполнение строк
	//-------------------------
	ЭлементДом=ДокументДом.СоздатьЭлемент("Order-Lines");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	
	РР=1;
	Для Каждого ТекСтрока из ДокОбъект.Товары цикл
		//ТекСтрока.Номенклатура.Вес
		Если ТекСтрока.Количество<=0 Тогда
			
			Продолжить;
			
		КонецЕсли; 
		Элемент=ДокументДом.СоздатьЭлемент("Line");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент);
		//----------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("LineNumber");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(рр));                 
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		// ищем штрихкод номенклатуры  -----------------------------
		
		ШКО="";
		//-------------------
		Попытка
			
			ТипШк = Перечисления.ТипыШтрихКодов.Штука;
			
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	ШтрихКоды.Владелец КАК Номенклатура,
			|	ШтрихКоды.Наименование как номер,
			|	ШтрихКоды.Код
			|ИЗ
			|	Справочник.ШтрихКоды КАК ШтрихКоды
			|ГДЕ
			|	ШтрихКоды.ТипШК = &ТипШК
			|	И ШтрихКоды.Владелец = &ТекНом";
			
			Запрос.УстановитьПараметр("ТекНом",текСтрока.Номенклатура); 
			Запрос.УстановитьПараметр("ТипШК",ТипШк);
			
			Выборка1 = запрос.Выполнить().Выбрать();
			
			Пока выборка1.Следующий() Цикл
				ШКО=выборка1.Номер; //ШКО+"@"
			КонецЦикла;	
			
		Исключение
		КонецПопытки;
		
		//---------------------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("SK");  //штрихкод
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(ШКО);                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		//----------------------------------------------------------
		
		Элемент=ДокументДом.СоздатьЭлемент("Nomenklatura");  // наименование номенклатуры
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(ТекСтрока.Номенклатура.Наименование);                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		Элемент=ДокументДом.СоздатьЭлемент("Kol");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ТекСтрока.Количество));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		//
		//Элемент=ДокументДом.СоздатьЭлемент("EDU");
		//ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		//текстДом=ДокументДом.СоздатьТекстовыйУзел(ТекСтрока.Единица.Наименование);                      
		//ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		//  НДС
		Элемент=ДокументДом.СоздатьЭлемент("CENA");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ТекСтрока.Цена-(Окр(ТекСтрока.НДС/ТекСтрока.Количество,2,0))));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		
		//  НДС
		Элемент=ДокументДом.СоздатьЭлемент("NDS");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Окр(ТекСтрока.НДС/ТекСтрока.Количество,2,0)));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		// цена с НДС
		Элемент=ДокументДом.СоздатьЭлемент("CenaSNDS");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ТекСтрока.Цена));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		Элемент=ДокументДом.СоздатьЭлемент("StavkaNDS");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ТекСтрока.СтавкаНДС));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		Элемент=ДокументДом.СоздатьЭлемент("Summa");  //  сумма по строке
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ТекСтрока.Сумма));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		Элемент=ДокументДом.СоздатьЭлемент("SummaNDS");  //  сумма НДС
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ТекСтрока.НДС));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		Элемент=ДокументДом.СоздатьЭлемент("VsegoSummaS_NDS");  //Сумма с НДС
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ТекСтрока.Всего));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		
		РР=РР+1;
		
	КонецЦикла;
	
	//---------------------------------------------------------------
	ЗаписьДом=Новый ЗаписьDom;
	ЗаписьДом.Записать(ДокументДом,ЗаписьХМЛ);
	ЗаписьХМЛ.Закрыть();	
	
	
	//Сообщить("Сформирован файл обмена. "+ИмяФайлаОбмена);
	
	//----------------------------------------
	//             отправить письмо
	//----------------------------------------
	шапка="";
	
	СообщитьМенеджеру(ИмяФайлаОбмена);
	
	
	Если КритичОшибки.Количество() Тогда
		
		СообщитьКритОшибки();
		
	КонецЕсли;	
	
	
КонецПроцедуры

Процедура СообщитьМенеджеру(ПутьФайла) Экспорт
	
	Менеджер=ДокОбъект.контрагент.Менеджер;
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "87.236.190.180";
	//Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);	
	// Кухарь А.Ю.  08.09.2022 конец
	Профиль.ПортSMTP           = 25;
	
	//Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
	Профиль.АутентификацияPOP3=СпособPOP3Аутентификации.Обычная;
	Профиль.АутентификацияSMTP=СпособSMTPАутентификации.Login;
	
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	//Профиль.ПользовательSMTP="*%*%*%";
	//профиль.ПарольSMTP="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	Профиль.ПользовательSMTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.ПарольSMTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	//----------------------------------------------------------------
	Сообщение=новый интернетПочтовоеСообщение;
	
	
	Сообщение.Получатели.Добавить("ecode@collant.ru"); //+++
	//	Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	Сообщение.Получатели.Добавить("konstantinova@collant.ru");
	
	// Кухарь А.Ю. 26.03.2021 начало
	// 	Если СокрЛП(ДокОбъект.контрагент.код)="SSP-3572" Тогда
		Если СокрЛП(КодКонтрагента)="SSP-3572" Тогда 
	// Кухарь А.Ю. 26.03.2021 конец
	
        //++++
		// ригла
		Сообщение.Получатели.Добавить("RNKL@rigla.ru");
		
		// Кухарь А.Ю. 26.03.2021 начало
		// 	ИначеЕсли (СокрЛП(ДокОбъект.контрагент.код)="SSP-2874") ИЛИ (СокрЛП(ДокОбъект.контрагент.код)="SSP-2507") Тогда
	ИначеЕсли (СокрЛП(КодКонтрагента)="SSP-2874") ИЛИ (СокрЛП(КодКонтрагента)="SSP-2507") Тогда		 
		// Кухарь А.Ю. 26.03.2021 конец
		

		// оз
		Сообщение.Получатели.Добавить("NKL@rigla.ru");
		
	КонецЕсли;	
	
	
	Сообщение.Отправитель="ecode@collant.ru";
	
	ПунктДоставки=ДокОбъект.ПунктДоставки;
	
	Если ПунктДоставки=Неопределено тогда
		ПунктДоставки="";
	Конецесли;	
	
	
	Сообщение.Тема="Подтверждение заказа № "+ДокОбъект.номерЗаказа+" - "+ДокОбъект.контрагент+" - "+ПунктДоставки;
	Строка=Символ(13)+Символ(13)+"       Добрый день!"+Символ(13)+Символ(13)+Строка("Подтверждение заказа № "+ДокОбъект.НомерЗаказа+" . "+ДокОбъект.Ссылка);
	
	НомСтр=1;
	Строка=Строка+Символы.ПС+символы.ПС+"Фактический адрес, пунк доставки: "+ДокОбъект.ПунктДоставки;
	Строка=Строка+Символы.ПС;
	
	Строка=Строка+Символы.ПС+"________________________________________________________________";
	Строка=Строка+Символы.ПС+"ООО <<Единая Европа - Элит>>";
	
	Сообщение.Тексты.Добавить(Строка);
	
	//Сообщение.Вложения.Добавить(ПутьФайла);
	Попытка
		Сообщение.Вложения.Добавить(ПутьФайла);     //+++
	Исключение
		КритичОшибки.Добавить("Не возможно добавить файл выгрузки "+ДокОбъект.ссылка+". Контрагент - "+ДокОбъект.контрагент+".  "+ОписаниеОшибки() );
	КонецПопытки;
	
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
	исключение
		КритичОшибки.Добавить("Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки() );
	конецПопытки;
	Попытка
		Почта.Послать(Сообщение);
	исключение
		КритичОшибки.Добавить("Не возможно отправить сообщение!   "+ОписаниеОшибки() );
	конецПопытки;
	Почта.Отключиться();
	
	Если критичОшибки.Количество()=0 Тогда
		// Сообщить("Файл отправлен покупателю. ");
	конецЕсли;   
	
	//----------------------------------------
	//           удаляем файл отправки
	//----------------------------------------
	
	УдалитьФайлы(ПутьФайла);     //+++
	
КонецПроцедуры

Процедура СообщитьКритОшибки() Экспорт
	
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "87.236.190.180";
	//Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);	
	// Кухарь А.Ю.  08.09.2022 конец
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	//Профиль.ПользовательSMTP="*%*%*%";
	//профиль.ПарольSMTP="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	Профиль.ПользовательSMTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.ПарольSMTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	//------------------------------------------------
	// сообщение о критических ошибках
	//------------------------------------------------
	сообщениеКрит=новый интернетПочтовоеСообщение;
	СообщениеКрит.Получатели.Добавить("ecode@collant.ru"); //+++
	СообщениеКрит.Получатели.Добавить("nechaeva@collant.ru");
	
	сообщениеКрит.Отправитель="ecode@collant.ru";
	СообщениеКрит.Тема="Автообмен Ригла. Критические ошибки!";
	Строка="Добрый день!!!"+Символ(13);
	НомСтр=1;
	Если НЕ Ошибки=Неопределено и КритичОшибки.Количество()>0 Тогда
		Для рр=0 по КритичОшибки.Количество()-1 Цикл
			Строка=Строка+Символ(13)+НомСтр+". "+КритичОшибки[рр];
			Строка=Строка+Символ(13);
			НомСтр=НомСтр+1;
		КонецЦикла;
	КонецЕсли;
	
	Строка=Строка+Символ(13)+"________________________________________________________________";
	//-----------------------------------------
	СообщениеКрит.Тексты.Добавить(Строка);
	
	Почта= Новый ИнтернетПочта;
	Почта.Подключиться(Профиль);
	почта.Послать(СообщениеКрит);
	Почта.Отключиться();
	
КонецПроцедуры

//-----------------------------------------------------------------------
// ***** СТОЛЕТОВ  (ФТП)    - отправляем письмо подтверждение для столетова
//-----------------------------------------------------------------------

Функция НайтиШК(Ном)
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ШтрихКоды.Наименование КАК шк
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.ТипШК = &ТипШК
	|	И ШтрихКоды.Владелец = &номенклатура
	|	И ШтрихКоды.ВидШК = &ВидШК";
	
	Запрос.УстановитьПараметр("ТипШК",Перечисления.ТипыШтрихКодов.Штука);
	Запрос.УстановитьПараметр("ВидШК",Перечисления.ВидыШК.Основной);
	
	Запрос.УстановитьПараметр("номенклатура",Ном);
	выборка = запрос.Выполнить().Выбрать();
	Пока выборка.Следующий() Цикл
		
		возврат(выборка.шк);
		
	КонецЦикла; 
	
	
КонецФункции

Функция ПолучитьСвойстваМодели(Модель)
	Запрос=Новый Запрос;
	Запрос.Текст="     
	|ВЫБРАТЬ     
	|     ВЫБОР
	|          КОГДА Объект=&Брэнд ТОГДА 1
	|          КОГДА Объект=&Модель ТОГДА 2
	|          ИНАЧЕ 3
	|     КОНЕЦ КАК Уровень,
	|     Свойство,
	|     Значение
	|ИЗ
	|     РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|     Объект = &Модель ИЛИ Объект = &Брэнд
	|УПОРЯДОЧИТЬ ПО Уровень,Объект";     
	
	Свойства=Новый Структура;
	Свойства.Вставить("ОрганСертификации"," ");
	Свойства.Вставить("СертификатПолноеНаименование"," ");
	Свойства.Вставить("СрокСертификата"," ");
	
	
	Запрос.УстановитьПараметр("Модель",Модель);
	Запрос.УстановитьПараметр("Брэнд",Модель.Родитель);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			КодСвойства=СтрЗаменить(Выборка.Свойство,"""","");     
			КодСвойства=СтрЗаменить(Выборка.Свойство," ","");
			
			Свойства.Вставить(КодСвойства,Выборка.Значение);          
		Исключение
			// Сообщить("Ошибочное свойство: "+Выборка.Свойство);
		КонецПопытки;          
	КонецЦикла;     
	
	Возврат Свойства;
	
	
конецФункции

// из ПечатиПакетаДокументов  (правильный расчет)
Функция ПолучитьТаблицуНакладнойНов(Режим="Накладная",СФ=Неопределено,ДокОбъект)
	
	
	ВидШтрихКода="Внутренний";	
	Кратко=0;
	ПечататьШтрихКоды=Истина;
	ТипАртикула=Справочники.АртикулыКонтрагентов.ПустаяСсылка();
	
	ТН=Новый ТаблицаЗначений;
	
	ТН.Колонки.Добавить("Номенклатура");	
	ТН.Колонки.Добавить("Цена");
	ТН.Колонки.Добавить("Количество");
	ТН.Колонки.Добавить("НДС");
	ТН.Колонки.Добавить("НДС1шт");
	ТН.Колонки.Добавить("НДС2шт");
	ТН.Колонки.Добавить("Сумма");
	ТН.Колонки.Добавить("Всего");
	
	
	ИсходнаяТЧ=ДокОбъект.Товары.Выгрузить();		
	
	
	// сначала сворачиваем, потом считаем  -----------------------------------------------
	//
	Если Кратко Тогда
		
		Для Каждого СтрокаТЧ Из ИсходнаяТЧ Цикл                             //*****
			Если СтрокаТЧ.Количество=0 Тогда Продолжить КонецЕсли; 
			
			Номенклатура		=СтрокаТЧ.Номенклатура;
			Модель				=Номенклатура.Родитель;
			СтрокаТЧ.Номенклатура=?(Кратко=0,Номенклатура,Модель);
		КонецЦикла;
		
		ИсходнаяТЧ.Свернуть("Номенклатура,Цена","Количество,Сумма,НДС,Всего");
		
	КонецЕсли; 
	//-----------------------------------------------------------------------------------
	
	Для Каждого СтрокаТЧ Из ИсходнаяТЧ Цикл
		Если СтрокаТЧ.Количество=0 Тогда Продолжить КонецЕсли; 
		
		Если СтрокаТЧ.Сумма=0 Тогда
			СтавкаНДС=100*ПроцентНДСпоСтавке(ПолучитьРеквизитРодителя(СтрокаТЧ.Номенклатура,"СтавкаНДС"));
		Иначе			
			СтавкаНДС	=Окр(100*(СтрокаТЧ.НДС/СтрокаТЧ.Сумма),0,1);
		КонецЕсли;	
		
		СтрокаТН=ТН.Добавить();		
		
		//Количество	=СтрокаТЧ.Количество;
		//Ндс1шт      =Окр(СтрокаТЧ.Цена*СтавкаНДС/(100+СтавкаНДС),2,0);
		//Цена      	=Окр((СтрокаТЧ.Цена-НДС1шт),2,0);      // уже без  ндс
		//Ндс21шт 	=Окр(Цена*СтавкаНДС/100,2,0);
		//СуммаБезНДс = Цена*Количество;
		//НДС         = Окр(СуммаБезНДс*СтавкаНДС/100,2);
		//Всего       =СуммаБезНДС+НДС;
		
		
		Количество	=СтрокаТЧ.Количество;
		Ндс1шт      =Окр(СтрокаТЧ.Цена*СтавкаНДС/(100+СтавкаНДС),2,0);
		Цена      	=Окр((СтрокаТЧ.Цена-НДС1шт),2,0);      // уже без  ндс
		ЦенаОбщ     =Ндс1шт+цена;
		
		Всего = ЦенаОбщ*Количество;
		Сумма = Цена*Количество;
		НДС   = Всего-Сумма;
		
		//Ндс21шт 	=Окр(Цена*СтавкаНДС/100,2,0);
		//СуммаБезНДс = Цена*Количество;
		//НДС         = Окр(СуммаБезНДс*СтавкаНДС/100,2);
		//Всего       =СуммаБезНДС+НДС;
		
		СтрокаТН.Цена      	=Цена;
		СтрокаТН.Сумма		=Сумма;
		СтрокаТН.НДС1шт		=Ндс1шт;  
		
		//СтрокаТН.Сумма		=Сумма   //БезНДс;
		
		СтрокаТН.НДС		=НДС;  
		СтрокаТН.Всего		=Всего;  
		СтрокаТН.Количество	=Количество;  
		
		Номенклатура		=СтрокаТЧ.Номенклатура;
		Модель				=Номенклатура.Родитель;
		
		СтрокаТН.Номенклатура=?(Кратко=0,СтрокаТЧ.Номенклатура,Модель);     //****
	КонецЦикла;
	//
	//Если Кратко Тогда
	//	ТН.Свернуть("Номенклатура,Цена","Количество,Сумма,НДС,Всего");        //*****
	//КонецЕсли; 
	
	ТН.Колонки.Добавить("НоменклатураПредставление");
	ТН.Колонки.Добавить("Единица");	
	ТН.Колонки.Добавить("ОКЕИ");	
	ТН.Колонки.Добавить("Страна");
	ТН.Колонки.Добавить("НомерГТД");
	ТН.Колонки.Добавить("ШтрихКод");
	ТН.Колонки.Добавить("КодКонтрагента");
	ТН.Колонки.Добавить("КоличествоКоробок");
	ТН.Колонки.Добавить("ШтукВКоробке");
	ТН.Колонки.Добавить("СтавкаНДС");
	//ТН.Колонки.Добавить("Цена");
	
	
	Для Каждого СтрокаТН Из ТН Цикл
		Номенклатура = СтрокаТН.Номенклатура;
		Модель		=?(Кратко,СтрокаТН.Номенклатура,СтрокаТН.Номенклатура.Родитель);
		//Модель		 = Номенклатура;
		//Модель		=?(Кратко,СтрокаТН.Номенклатура,СтрокаТН.Номенклатура.Родитель);       //*****
		
		Если СтрокаТН.Сумма=0 Тогда
			СтрокаТН.СтавкаНДС=100*ПроцентНДСпоСтавке(ПолучитьРеквизитРодителя(СтрокаТН.Номенклатура,"СтавкаНДС"));
		Иначе			
			СтрокаТН.СтавкаНДС	=Окр(100*(СтрокаТН.НДС/СтрокаТН.Сумма),0,1);
		КонецЕсли;			
		
		СтрокаТН.Единица	="шт.";			
		СтрокаТН.ОКЕИ		="796";
		
		//ГТД
		ГТД=ПолучитьГрупповойПериодическийРеквизит(Модель,"НомерГТД",ДокОбъект.Дата);
		
		Страна	="Россия";
		НомерГТД="--------";
		
		Если ГТД<>Неопределено И Врег(""+ГТД.СтранаПроисхождения)<>"РОССИЯ" И НЕ ПустаяСтрока(""+ГТД.СтранаПроисхождения) Тогда
			Страна		=""+ГТД.СтранаПроисхождения;
			НомерГТД	=СокрЛП(""+ГТД.Наименование);
		КонецЕсли;
		
		Если Страна<>"Россия" И СтрДлина(НомерГТД)<25 Тогда			
			Если СтрДлина(НомерГТД)<23 Тогда
				Сообщить("Кривой ГТД !!! Товар: """+СтрокаТН.Номенклатура+""", ГТД: """+НомерГТД+""" !");		
			Иначе
				Сообщить("Отсутствует 4-ый сегмент ГТД !!! Товар: """+СтрокаТН.Номенклатура+""", ГТД: """+НомерГТД+""" !");
				
				НомерГТД=НомерГТД+"/3";
			КонецЕсли; 					
		КонецЕсли; 
		
		СтрокаТН.Страна		= Страна;
		СтрокаТН.НомерГТД	= НомерГТД;
		
		Если ПечататьШтрихКоды Тогда
			Если ВидШтрихКода="Внутренний" Тогда
				СтрокаТН.ШтрихКод=?(Кратко,СокрЛП(СтрокаТН.Номенклатура.Код77),Прав(ПолучитьШтрихКодТовара(СтрокаТН.Номенклатура),6));			
			ИначеЕсли ВидШтрихКода="Контрагент" Тогда
				СтрокаТН.ШтрихКод=ПолучитьАртикулКонтрагента(СтрокаТН.Номенклатура,ТипАртикула);				
			ИначеЕсли ВидШтрихКода="ШтрихКод" Тогда
				СтрокаТН.ШтрихКод=ПолучитьШтрихКодТовара(СтрокаТН.Номенклатура);
			КонецЕсли;			
		КонецЕсли;				
		СтрокаТН.ШтукВКоробке=0;
		Если Номенклатура.ШтукВКоробке<>Null Тогда
			СтрокаТН.ШтукВКоробке=Номенклатура.ШтукВКоробке;  //Модель.ШтукВКоробке;
		конецЕсли;   
		Если СтрокаТН.ШтукВКоробке>0 Тогда
			СтрокаТН.КоличествоКоробок=СтрокаТН.Количество/СтрокаТН.ШтукВКоробке; 			
		КонецЕсли;	
		
		СтрокаТН.НоменклатураПредставление=СокрЛП(Модель.ТипТовара)+" "+СокрЛП(Модель.Родитель.Брэнд)+" "+СокрЛП(Модель.КодПроизводителя)+" "+Номенклатура.Наименование;		
	КонецЦикла; 
	
	Возврат ТН;
КонецФункции // ПолучитьТаблицуНакладнойНов()

Функция ПолучитьАртикулКонтрагента(Номенклатура,ВыбТипАртикула)
	Если ВыбТипАртикула=Неопределено ИЛИ ВыбТипАртикула.Пустая() Тогда Возврат "" КонецЕсли; 
	
	Выборка = Справочники.АртикулыКонтрагентов.Выбрать(,Номенклатура,Новый Структура("ТипАртикула",ВыбТипАртикула));
	Пока Выборка.Следующий() Цикл
		Если Не ПустаяСтрока(Выборка.Наименование) Тогда
			Возврат СокрЛП(Выборка.Наименование);		
		КонецЕсли;		
	КонецЦикла;
	
	Если НЕ Номенклатура.ЭтоГруппа Тогда
		Возврат ПолучитьАртикулКонтрагента(Номенклатура.Родитель,ВыбТипАртикула);	
	Иначе
		Возврат "";
	КонецЕсли;	
КонецФункции //ПолучитьАртикулКонтрагента(Номенклатура,ТипАртикула) 

Процедура ВыгрузитьНакНов(НаклРНК)
	
	Если СтрДлина(НаклРНК.ПунктДоставки.НомерМагазина)=0 ТОгда
		Сообщить("Для накладной "+НаклРНК+" - "+НаклРНК.ПунктДоставки+ " в пункте доставки не проставлен номер магазина. Выгрузка отменена!");
		КритичОшибкиСтолетов.Добавить("Для накладной "+НаклРНК+" - "+НаклРНК.ПунктДоставки+ " в пункте доставки не проставлен номер магазина. Выгрузка отменена!" );
		ОтказСтолетов=Истина;
		возврат;
	КонецЕсли;	
	
	ТабДокСуммы=ПолучитьТаблицуНакладнойНов("Накладная",Неопределено,НаклРНК);
	ДатаДок=НаклРНК.Дата;
	НомерДок=НаклРНК.Номер;
	НомерМагазина=НаклРНК.ПунктДоставки.НомерМагазина;
	НомерЗаказа=НаклРНК.НомерЗаказа;
	ДатаЗаказа=НаклРНК.ДатаЗаказа;
	
	
	//          НаклРНК.Дата;
	////-------------------------------------------------------
	//// подсчитываем общие итоги
	Таб = Новый ТаблицаЗначений;
	Таб=ТабДокСуммы.Скопировать();
	
	ИтСумм=Таб.Итог("Всего");
	ИтОбщНДС=Таб.Итог("НДС");
	ИтОбщ=Таб.Итог("Сумма");
	Таб.Свернуть("СтавкаНДС","НДС,Сумма");
	Для каждого Ст Из Таб Цикл
		
		Если Ст.ставкаНДС=18 Тогда
			Ит18=Ст.Сумма;
			Ит18Ндс=Ст.НДС;
		КонецЕсли;
		
		Если Ст.ставкаНДС=10 Тогда
			Ит10=Ст.Сумма;
			Ит10Ндс=Ст.НДС;
		КонецЕсли;
		
		Если Ст.ставкаНДС=0 Тогда
			Ит0=Ст.Сумма;
			Ит0Ндс=Ст.НДС;
		КонецЕсли; 
		
	КонецЦикла;
	
	////-------------------------------------------------------
	//// дата и номер счет фактуры
	
	СФ=Неопределено;
	СФДата=" ";	
	СФНомер="0";
	
	СФ=СчетФактураНакладной(НаклРНК.Ссылка,НаклРНК.Организация);
	
	Если СФ.Пустая() Тогда
		//Сообщить("Для документа не заведена счет-фактура, параметры не проставлены! ");
	Иначе
		СФДата=СФ.Дата;	
		СФНомер=СФ.Номер;
	КонецЕсли;	
	
	
	//-------------------------------------------------------
	
	БД=Новый XBase;
	
	БД.Кодировка=КодировкаXBase.OEM;
	
	БД.поля.Добавить("NDOC","C",20);       //Ном.Док
	БД.поля.Добавить("DATEDOC","D",8);     //Дата.Док
	БД.поля.Добавить("CODEPST","C",12);    //КодТовараПоставщика
	БД.поля.Добавить("EAN13","C",13);      //ЗаводскойБарКод
	БД.поля.Добавить("PRICE1","N",9,2);    //Цена Производ c НДС
	БД.поля.Добавить("PRICE1N","N",9,2);    //Цена Производ без НДС
	БД.поля.Добавить("SUMNDS1","N",9,2);    //Сумма НДС производителя
	
	БД.поля.Добавить("PRICE2","N",9,2);    //Цена прайся с ндс
	БД.поля.Добавить("PRICE2N","N",9,2);   //Цена прайса без ндс
	БД.поля.Добавить("SUMNDS2","N",9,2);   //Сумма НДС прайса 
	
	БД.поля.Добавить("QNT","N",9,2);         //Количество
	БД.поля.Добавить("SER","C",20);        //Серия
	БД.поля.Добавить("GDATE","D",8);       //Срок годности
	БД.поля.Добавить("DATEMADE","D",8);    //Дата изготовления
	БД.поля.Добавить("NAME","C",80);       //Наименование
	БД.поля.Добавить("CNTR","C",15);       //страна изг
	БД.поля.Добавить("FIRM","C",40);       //фирма изгот
	БД.поля.Добавить("QNTPACK","N",8);    //кол в упак
	БД.поля.Добавить("NDS","N",9.2);         //ставка ндс
	БД.поля.Добавить("NSP","N",9.2);         //ставка нсп
	БД.поля.Добавить("GNVLS","N",9);         //признак ЖНВЛС
	БД.поля.Добавить("REGPRC","N",9,2);      //цена гос регистрац
	БД.поля.Добавить("DATEPRC","D",8);         //дата рег цены
	БД.поля.Добавить("NUMGTD","C",30);     //Номер ГТД
	БД.поля.Добавить("SERTIF","C",80);     //сертиф Пример "РОСС.IN.ФМ01.Д91123"
	БД.поля.Добавить("SERTDATE","D",8);    //Срок действия сертификата
	БД.поля.Добавить("SERTORG","C",80);    //Орган Сертификации
	БД.поля.Добавить("SUMPAY","N",9,2);    //Сумма отпускная с ндс по строчке
	БД.поля.Добавить("SUMNDS10","N",9,2);  //сумма ндс 10%
	БД.поля.Добавить("SUMNDS20","N",9,2);  //сумма ндс 18%
	БД.поля.Добавить("SUM10","N",9,2);     //сумма без ндс 10%
	БД.поля.Добавить("SUM20","N",9,2);     //сумма без ндс 18%
	БД.поля.Добавить("SUM0","N",9,2);      //сумма без ндс 0%
	
	БД.поля.Добавить("EXCHCODE","N",1);      //код валюты 0-руб 1-$ 2-EU
	БД.поля.Добавить("ERATE","N",9,2);      //курс на данную накладную
	БД.поля.Добавить("PODRCD","C",12);      //код аптеки получателя
	БД.поля.Добавить("NUMZ","C",12);        //Номер заказа
	БД.поля.Добавить("DATEZ","D",8);        //Дата заказа
	БД.поля.Добавить("SUMNDB","N",9,2);     //сумма надбывки поставщика
	БД.поля.Добавить("PROCNDB","N",9,2);    //процент надбывки поставщика
	БД.поля.Добавить("BILLNUM","C",20);     //Ном.Сч.фак.
	БД.поля.Добавить("BILLDT","D",8);       //Дата.сч. факт.
	
	ТекущееИмя = Прав(СокрЛП(НаклРНК.Номер),8)+".dbf";
	
	Каталог=""+константы.КаталогВнешнихОтчетов.Получить() +"temp\"+ Прав(СокрЛП(НаклРНК.Номер),8)+".dbf";
	
	Попытка	
		БД.СоздатьФайл(Каталог);
	Исключение
		//Сообщить("Проверьте работу сети! Файл не создан");
		КритичОшибки.Добавить("Проверьте работу сети! Файл не создан!   "+ОписаниеОшибки() );
		ОтказСтолетов=Истина;
	КонецПопытки;
	
	БД.АвтоСохранение=Истина;
	
	Для каждого ТекСтр из ТабДокСуммы Цикл
		
		Если ТекСтр.количество = 0 тогда продолжить конецесли;
		
		//--------------------------------------------------------------------
		Фабрика=" ";
		НомерГТД=ТЕкСтр.НомерГТД;
		Фабрика=ТекСтр.Номенклатура.Родитель.Родитель.Родитель.Фабрика;
		Ставка=ТекСтр.СтавкаНДС;
		
		// сертификаты---------------------------------------------------------
		Свойства=Новый Структура;
		Свойства.Вставить("ОрганСертификации"," ");
		Свойства.Вставить("СертификатПолноеНаименование"," ");
		Свойства.Вставить("СрокСертификата"," ");
		
		Свойства = ПолучитьСвойстваМодели(ТекСтр.Номенклатура);   //имя функции с текстом выше
		
		ОрганСертификации=" ";
		Сертификат=" ";
		СрокДействия=" ";
		
		ОрганСертификации = Свойства.ОрганСертификации;
		Сертификат = Свойства.СертификатПолноеНаименование;
		СрокДействия= Свойства.СрокСертификата;
		
		//---------------------------------------------------------------------
		
		
		
		БД.Добавить();
		
		БД.NDOC=номерДок;
		БД.DATEDOC=датаДок;
		БД.CODEPST=ТекСтр.Номенклатура.код;
		ШК =  НайтиШК(ТекСтр.Номенклатура) ;
		БД.EAN13=ШК;
		БД.PRICE1="0";
		БД.PRICE1N="0";
		БД.SUMNDS1="0";
		
		БД.PRICE2=ТекСтр.цена+ТекСтр.Ндс1шт;
		
		БД.PRICE2N=ТекСтр.Цена;
		БД.SUMNDS2=ТекСтр.Ндс1шт;
		БД.QNT=ТекСтр.количество;
		БД.SER=" ";
		БД.GDATE=" ";
		БД.DATEMADE=" ";
		БД.NAME=ТекСтр.НоменклатураПредставление;
		БД.CNTR=ТекСтр.Страна;
		БД.FIRM=Фабрика;
		БД.QNTPACK="0";
		БД.NDS=Ставка;  //ТекСтр.ставка;
		БД.NSP="0";
		БД.GNVLS="0";
		БД.REGPRC="0";
		БД.NUMGTD=ТекСтр.НомерГТД;
		БД.SERTIF=Сертификат;
		БД.SERTDATE=СрокДействия;
		БД.SERTORG=ОрганСертификации;
		БД.SUMPAY=ИтСумм;
		БД.SUMNDS10=Ит10НДС;
		БД.SUMNDS20=Ит18НДС;
		БД.SUM10=Ит10;
		БД.SUM20=Ит18;
		БД.SUM0=Ит0;
		БД.EXCHCODE="0";
		БД.ERATE="0";
		БД.PODRCD=НомерМагазина;
		БД.NUMZ=""+СокрЛП(НомерЗаказа);
		БД.DATEZ=ДатаЗаказа;
		БД.SUMNDB="0";
		БД.PROCNDB="0";
		БД.BILLNUM=СФномер ;       //Ном.Сч.фак.
		БД.BILLDT=СФДата;     //Дата.сч. факт.
		
	КонецЦикла;	
	
	
	Попытка	
		БД.Записать();
	Исключение
		//Сообщить("Проверьте работу сети! Файл не создан");
		КритичОшибки.Добавить("Не возможно сохранить файл на диске!   "+ОписаниеОшибки() );
		ОтказСтолетов=Истина;
	КонецПопытки;
	
	Бд.ЗакрытьФайл();
	
	
КонецПроцедуры	

// копируем файлы к ним  - прайс лист сбрасываем
Процедура ВыгрузкаНаФТП()
	
	//-----------------------------
	// формируем файл выгрузки
	//-----------------------------
	
	ТекИмяФайла="";
	//*******************
	ВыгрузитьНакНов(ДокОбъект);
	//*******************
	ТекИмяФайла=""+константы.КаталогВнешнихОтчетов.Получить() +"temp\"+ Прав(СокрЛП(ДокОбъект.Номер),8)+".dbf";
	
	ФайлВЫгр= Новый Файл(ТекИмяФайла);
	
	Если НЕ ФайлВЫгр.Существует() Тогда
		//Сообщить("Файл выгрузки в Столетов отсутствует. Данные не переданы!");
		КритичОшибкиСтолетов.Добавить("Не возможно отправить сообщение!   "+ОписаниеОшибки() );
	КонецЕсли;
	
	
	////-----------------------------
	//// отправляем на ФТП
	////-----------------------------
	//		
	Попытка             //++++
		Сервер=Новый FTPСоединение("ftp.stoletov.ru",,"europa-elit","eur735opa",15); 
	Исключение
		КритичОшибкиСтолетов.Добавить("Не возможно соединиться с ФТП!   "+ОписаниеОшибки() );
	КонецПопытки;
	
	Попытка
		Сервер.Записать(ТекИмяФайла,"/Эл_накл/"+Прав(СокрЛП(ДокОбъект.Номер),8)+".dbf");
	Исключение
		КритичОшибкиСтолетов.Добавить("Не возможно записать файл на ФТП!   "+ОписаниеОшибки() );
	КонецПопытки;
	
	СообщитьМенеджеруСтолетов(ТекИмяФайла);
	
	Если КритичОшибки.Количество() Тогда
		СообщитьКритОшибкиСтолетов();
	КонецЕсли;	
	
	Сервер=Неопределено;
	//Сообщить("Эл. накладная передана покупателю!");		
	
	
КонецПроцедуры

Процедура ОтправитьСтолетов()
	
	
	ВыгрузкаНаФТП();
	
	
КонецПроцедуры

Процедура СообщитьМенеджеруСтолетов(ПутьФайла) Экспорт
	
	// письмо пока отправляем только в е-код, что ушли накладные
	
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "87.236.190.180";
	//Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);	
	// Кухарь А.Ю.  08.09.2022 конец
	Профиль.ПортSMTP           = 25;
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	//Профиль.ПользовательSMTP="*%*%*%";
	//профиль.ПарольSMTP="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	Профиль.ПользовательSMTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.ПарольSMTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	//----------------------------------------------------------------
	Сообщение=новый интернетПочтовоеСообщение;
	
	
	Сообщение.Получатели.Добавить("ecode@collant.ru"); //+++
	//Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	Сообщение.Получатели.Добавить("konstantinova@collant.ru");
	Сообщение.Отправитель="ecode@collant.ru";
	
	ПунктДоставки=ДокОбъект.ПунктДоставки;
	
	Если ПунктДоставки=Неопределено тогда
		ПунктДоставки="";
	Конецесли;	
	
	
	Сообщение.Тема="Столетов.  Подтверждение заказа № "+ДокОбъект.номерЗаказа+" - "+ДокОбъект.контрагент+" - "+ПунктДоставки;
	Строка=Символ(13)+Символ(13)+"       Добрый день!"+Символ(13)+Символ(13)+Строка("Подтверждение заказа № "+ДокОбъект.НомерЗаказа+" . "+ДокОбъект.Ссылка);
	
	НомСтр=1;
	Строка=Строка+Символы.ПС+символы.ПС+"Фактический адрес, пунк доставки: "+ДокОбъект.ПунктДоставки;
	Строка=Строка+Символы.ПС;
	
	Строка=Строка+Символы.ПС+"________________________________________________________________";
	Строка=Строка+Символы.ПС+"ООО <<Единая Европа - Элит>>";
	
	Сообщение.Тексты.Добавить(Строка);
	
	//Сообщение.Вложения.Добавить(ПутьФайла);
	Попытка
		Сообщение.Вложения.Добавить(ПутьФайла);     //+++
	Исключение
		ОтказСтолетов=Истина;
		КритичОшибкиСтолетов.Добавить("Не возможно добавить файл выгрузки "+ДокОбъект.ссылка+". Контрагент - "+ДокОбъект.контрагент+".  "+ОписаниеОшибки() );
	КонецПопытки;
	
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
	исключение
		ОтказСтолетов=Истина;
		КритичОшибкиСтолетов.Добавить("Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки() );
	конецПопытки;
	Попытка
		Почта.Послать(Сообщение);
	исключение
		ОтказСтолетов=Истина;
		КритичОшибкиСтолетов.Добавить("Не возможно отправить сообщение!   "+ОписаниеОшибки() );
	конецПопытки;
	Почта.Отключиться();
	
	Если критичОшибкиСтолетов.Количество()=0 Тогда
		Сообщить("Файл отправлен покупателю. ");
	конецЕсли;   
	
	//----------------------------------------
	//           удаляем файл отправки
	//----------------------------------------
	
	УдалитьФайлы(ПутьФайла);     //+++
	
КонецПроцедуры

Процедура СообщитьКритОшибкиСтолетов() Экспорт
	
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "87.236.190.180";
	//Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);	
	// Кухарь А.Ю.  08.09.2022 конец
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	//Профиль.ПользовательSMTP="*%*%*%";
	//профиль.ПарольSMTP="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	Профиль.ПользовательSMTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.ПарольSMTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	//------------------------------------------------
	// сообщение о критических ошибках
	//------------------------------------------------
	сообщениеКрит=новый интернетПочтовоеСообщение;
	СообщениеКрит.Получатели.Добавить("ecode@collant.ru"); //+++
	СообщениеКрит.Получатели.Добавить("nechaeva@collant.ru");
	
	сообщениеКрит.Отправитель="ecode@collant.ru";
	СообщениеКрит.Тема="Автообмен Столетов. Критические ошибки!";
	Строка="Добрый день!!!"+Символ(13);
	НомСтр=1;
	Если НЕ Ошибки=Неопределено и КритичОшибкиСтолетов.Количество()>0 Тогда
		Для рр=0 по КритичОшибкиСтолетов.Количество()-1 Цикл
			Строка=Строка+Символ(13)+НомСтр+". "+КритичОшибки[рр];
			Строка=Строка+Символ(13);
			НомСтр=НомСтр+1;
		КонецЦикла;
	КонецЕсли;
	
	Строка=Строка+Символ(13)+"________________________________________________________________";
	//-----------------------------------------
	СообщениеКрит.Тексты.Добавить(Строка);
	
	Почта= Новый ИнтернетПочта;
	Почта.Подключиться(Профиль);
	почта.Послать(СообщениеКрит);
	Почта.Отключиться();
	
КонецПроцедуры

// *************************************
//-----  КАПРИЗ - М
//***************************************


Процедура ОтправитьКаприз()  Экспорт
	
	КрОшибки.Очистить();
	НомЗак=ДокОбъект.номерЗаказа;
	Если СокрЛП(НомЗак)="" Тогда
		
		возврат;
		// не отправляем письмо и не выгружаем эти документы.
		
		//ГСЧ = Новый ГенераторСлучайныхЧисел(255);
		//НомЗак=ГСЧ.СлучайноеЧисло(0, 10000);
		
	КонецЕсли;	
	
	ИмяФайлаОбмена=""+константы.КаталогВнешнихОтчетов.Получить() +"temp\"+ НомЗак+"-"+ДокОбъект.Номер+".xml";
	
	//Сообщить(ИмяФайлаОбмена);
	Файл=Новый Файл(ИмяФайлаОбмена);
	
	Если СтрДлина(СокрЛП(ДокОбъект.ПунктДоставки.НомерМагазина))=0 Тогда
		
		КрОшибки.Добавить("В пункте доставки не проставлен номер магазина (закладка доп.инфо)! Накладная "+ДокОбъект.Номер+" номер заказа -  "+ДокОбъект.номерЗаказа);
		КрОшибки.Добавить("Номер магазина должен быть равен реквизиту ""Код получателя"" из файла заказа покупателя!");
		КрОшибки.Добавить("Выгрузка отменена! Проверьте данные и перезапишите документ для автоотправки.");
		ОтказСтолетов=Истина;
		Возврат;
		
	КонецЕсли;	
	
	
	ЗаписьХМЛ=Новый ЗаписьXML;
	ЗаписьХМЛ.ОткрытьФайл(ИмяФайлаОбмена);   
	ДокументДом=Новый ДокументDom("","ExchangePackage");     //    http://v8.1c./8.1/sample91_DOM
	КорневойЭлемент=ДокументДом.ЭлементДокумента;
	// Order-Header ------------------------------------------
	ЭлементДом=ДокументДом.СоздатьЭлемент("MaterialMovement");
	
	Дата=""+Формат(ДокОбъект.ДатаОтгрузки,"ДЛФ=Д");
	НомерМагазина=""+ДокОбъект.ПунктДоставки.НомерМагазина;
	
	Колво0=4-СтрДлина(НомерМагазина);
	Для ст=1 по колво0 Цикл
		НомерМагазина="0"+НомерМагазина;
	КонецЦикла;
	
	ЭлементДом.УстановитьАтрибут("MCOD1","Единая Европа Элит");
	ЭлементДом.УстановитьАтрибут("DateMove",Строка(Дата));
	ЭлементДом.УстановитьАтрибут("NumOrd",Строка(ДокОбъект.НомерЗаказа));
	ЭлементДом.УстановитьАтрибут("RecPlant",Строка(НомерМагазина));
	ЭлементДом.УстановитьАтрибут("DocNum",Строка(ДокОбъект.Номер));
	
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	
	//---------------------------------------------------------
	
	Для Каждого ТекСтрока из ДокОбъект.Товары цикл
		
		Элемент2=ДокументДом.СоздатьЭлемент("Row");
		Если ТекСтрока.Количество=0 ТОгда
			продолжить;
		КонецЕсли;	
		
		//---------------------------------------------
		НомерСтроки=""+ТекСтрока.НомерСтроки+"0";
		Колво0=5-СтрДлина(НомерСтроки);
		Для ст=1 по колво0 Цикл
			НомерСтроки="0"+НомерСтроки;
		КонецЦикла;
		//-------------------
		ШКО="";
		Попытка
			
			ТипШкН = Перечисления.ТипыШтрихКодов.Штука;
			
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	ШтрихКоды.Владелец КАК Номенклатура,
			|	ШтрихКоды.Наименование как номер,
			|	ШтрихКоды.Код
			|ИЗ
			|	Справочник.ШтрихКоды КАК ШтрихКоды
			|ГДЕ
			|	ШтрихКоды.ТипШК = &ТипШК
			|	И ШтрихКоды.Владелец = &ТекНом";
			
			Запрос.УстановитьПараметр("ТекНом",текСтрока.Номенклатура); 
			Запрос.УстановитьПараметр("ТипШК",ТипШкН);
			
			Выборка1 = запрос.Выполнить().Выбрать();
			
			Пока выборка1.Следующий() Цикл
				ШКО=выборка1.Номер; 
			КонецЦикла;	
			
		Исключение
		КонецПопытки;
		
		Цена =(ТекСтрока.Всего-ТекСтрока.НДС)/ТекСтрока.Количество;
		Цена =Формат(Цена,"ЧДЦ=2");
		
		//ГТД ---------------------------------------
		ГТД=ПолучитьГрупповойПериодическийРеквизит(ТекСтрока.Номенклатура,"НомерГТД",ДокОбъект.Дата);
		
		Страна	="Россия";
		НомерГТД="--------";
		
		Если ГТД<>Неопределено И Врег(""+ГТД.СтранаПроисхождения)<>"РОССИЯ" И НЕ ПустаяСтрока(""+ГТД.СтранаПроисхождения) Тогда
			Страна		=""+ГТД.СтранаПроисхождения;
			НомерГТД	=СокрЛП(""+ГТД.Наименование);
		КонецЕсли;
		
		Если Страна<>"Россия" И СтрДлина(НомерГТД)<25 Тогда			
			Если СтрДлина(НомерГТД)<23 Тогда
				Сообщить("Кривой ГТД !!! Товар: """+ТекСтрока.Номенклатура+""", ГТД: """+НомерГТД+""" !");		
			Иначе
				Сообщить("Отсутствует 4-ый сегмент ГТД !!! Товар: """+ТекСтрока.Номенклатура+""", ГТД: """+НомерГТД+""" !");
				НомерГТД=НомерГТД+"/3";
			КонецЕсли; 					
		КонецЕсли; 
		
		//СтрокаТН.Страна		= Страна;
		//СтрокаТН.НомерГТД	= НомерГТД;
		//------------------------------------------------	
		
		Элемент2.УстановитьАтрибут("PosNumOrd",Строка(ДокОбъект.НомерЗаказа));
		Элемент2.УстановитьАтрибут("PosOrd",НомерСтроки);    // номер позиции в заказе   !!!
		Элемент2.УстановитьАтрибут("Article",Строка(ШКО));
		Элемент2.УстановитьАтрибут("MATKX",Строка(ТекСтрока.Номенклатура.Наименование));
		Элемент2.УстановитьАтрибут("Qty",Строка(ТекСтрока.Количество));
		Элемент2.УстановитьАтрибут("KWERT",Строка(Цена));  // цена без НДС
		Элемент2.УстановитьАтрибут("PRONU",Строка(НомерГТД));
		
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		
	КонецЦикла;
	
	//---------------------------------------------------------------
	ЗаписьДом=Новый ЗаписьDom;
	ЗаписьДом.Записать(ДокументДом,ЗаписьХМЛ);
	ЗаписьХМЛ.Закрыть();	
	
	//Сообщить("Сформирован файл обмена. "+ИмяФайлаОбмена);
	
	//----------------------------------------
	//             отправить письмо
	//----------------------------------------
	Шапка="";
	СообщитьМенеджеруКаприз(ИмяФайлаОбмена);
	
	Если КрОшибки.Количество() Тогда
		
		СообщитьКритОшибкиКаприз();
		
	КонецЕсли;	
	
	
КонецПроцедуры

Процедура СообщитьМенеджеруКаприз(ПутьФайла) Экспорт
	
	Менеджер=ДокОбъект.контрагент.Менеджер;
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "87.236.190.180";
	//Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);	
	// Кухарь А.Ю.  08.09.2022 конец
	Профиль.ПортSMTP           = 25;
	
	//Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
	Профиль.АутентификацияPOP3=СпособPOP3Аутентификации.Обычная;
	Профиль.АутентификацияSMTP=СпособSMTPАутентификации.Login;
	
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	//Профиль.ПользовательSMTP="*%*%*%";
	//профиль.ПарольSMTP="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	Профиль.ПользовательSMTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.ПарольSMTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	//----------------------------------------------------------------
	Сообщение=новый интернетПочтовоеСообщение;
	Сообщение.Получатели.Добавить("ecode@collant.ru"); //+++
	//Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	//Сообщение.Получатели.Добавить("bahlova@collant.ru");
	Сообщение.Получатели.Добавить("murashko@collant.ru");
	
	
	// каприз-м
	Сообщение.Получатели.Добавить("zakaz_sap@makdak.ru");
	Сообщение.Получатели.Добавить("burnina@makdak.ru");
	
	
	Сообщение.Отправитель="ecode@kbstil.ru";
	ПунктДоставки=ДокОбъект.ПунктДоставки;
	
	Если ПунктДоставки=Неопределено тогда
		ПунктДоставки="";
	Конецесли;	
	
	
	Сообщение.Тема="Подтверждение заказа № "+ДокОбъект.номерЗаказа+" - "+ДокОбъект.контрагент+" - "+ПунктДоставки;
	Строка=Символ(13)+Символ(13)+"       Добрый день!"+Символ(13)+Символ(13)+Строка("Подтверждение заказа № "+ДокОбъект.НомерЗаказа+" . "+ДокОбъект.Ссылка);
	
	НомСтр=1;
	Строка=Строка+Символы.ПС+символы.ПС+"Фактический адрес, пунк доставки: "+ДокОбъект.ПунктДоставки;
	Строка=Строка+Символы.ПС;
	
	Строка=Строка+Символы.ПС+"________________________________________________________________";
	Строка=Строка+Символы.ПС+"ООО <<Единая Европа - Элит>>";
	
	Сообщение.Тексты.Добавить(Строка);
	//Сообщение.Вложения.Добавить(ПутьФайла);
	Попытка
		Сообщение.Вложения.Добавить(ПутьФайла);     //+++
	Исключение
		КрОшибки.Добавить("Не возможно добавить файл выгрузки "+ДокОбъект.ссылка+". Контрагент - "+ДокОбъект.контрагент+".  "+ОписаниеОшибки() );
	КонецПопытки;
	
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
	исключение
		КрОшибки.Добавить("Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки() );
	конецПопытки;
	Попытка
		Почта.Послать(Сообщение);
	исключение
		КрОшибки.Добавить("Не возможно отправить сообщение!   "+ОписаниеОшибки() );
	конецПопытки;
	Почта.Отключиться();
	
	Если крОшибки.Количество()=0 Тогда
		
		// Сообщить("Файл отправлен покупателю. ");
		
	КонецЕсли;   
	
	//----------------------------------------
	//           удаляем файл отправки
	//----------------------------------------
	
	УдалитьФайлы(ПутьФайла);     //+++
	
КонецПроцедуры

Процедура СообщитьКритОшибкиКаприз() Экспорт
	
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "87.236.190.180";
	//Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);	
	// Кухарь А.Ю.  08.09.2022 конец
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	//Профиль.ПользовательSMTP="*%*%*%";
	//профиль.ПарольSMTP="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	Профиль.ПользовательSMTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.ПарольSMTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	//------------------------------------------------
	// сообщение о критических ошибках
	//------------------------------------------------
	сообщениеКрит=новый интернетПочтовоеСообщение;
	СообщениеКрит.Получатели.Добавить("ecode@collant.ru");    //+++
	СообщениеКрит.Получатели.Добавить("nechaeva@collant.ru");
	//СообщениеКрит.Получатели.Добавить("bahlova@collant.ru");
	СообщениеКрит.Получатели.Добавить("murashko@collant.ru");
	
	
	сообщениеКрит.Отправитель="ecode@collant.ru";
	СообщениеКрит.Тема="Автообмен Каприз-М. Критические ошибки!";
	Строка="Добрый день!!!"+Символ(13);
	НомСтр=1;
	Если НЕ Ошибки=Неопределено и КрОшибки.Количество()>0 Тогда
		Для рр=0 по КрОшибки.Количество()-1 Цикл
			Строка=Строка+Символ(13)+НомСтр+". "+КрОшибки[рр];
			Строка=Строка+Символ(13);
			НомСтр=НомСтр+1;
		КонецЦикла;
	КонецЕсли;
	
	Строка=Строка+Символ(13)+"________________________________________________________________";
	//-----------------------------------------
	СообщениеКрит.Тексты.Добавить(Строка);
	
	Почта= Новый ИнтернетПочта;
	Почта.Подключиться(Профиль);
	почта.Послать(СообщениеКрит);
	Почта.Отключиться();
	
КонецПроцедуры



// *************************************************************************************************************************************
//- ---- ГИПЕРГЛОБУС  "уведомление об отгрузке РНК"
//**************************************************************************************************************************************
 Процедура ОтправитьГлобус()  Экспорт
	Ошибка=0;
	КрОшибки.Очистить();
	НомЗак=ДокОбъект.номерЗаказа;
	Если СокрЛП(НомЗак)="" или 	НЕ (ДокОбъект.Дата>=Дата('20110302')) Тогда
		возврат;
	КонецЕсли;	
	
	каталог="\\E-cod\ediconnector2\ediECOD\globus\";
	
	ИмяФайлаОбмена="" + каталог + НомЗак+".xml";
	
	//Сообщить(ИмяФайлаОбмена);
	Файл=Новый Файл(ИмяФайлаОбмена);
	
	//Если СтрДлина(СокрЛП(ДокОбъект.ПунктДоставки.НомерМагазина))=0 Тогда
	//	
	//	КрОшибки.Добавить("В пункте доставки не проставлен номер магазина (закладка доп.инфо)! Накладная "+ДокОбъект.Номер+" номер заказа -  "+ДокОбъект.номерЗаказа);
	//	КрОшибки.Добавить("Номер магазина должен быть равен реквизиту ""Код получателя"" из файла заказа покупателя!");
	//	КрОшибки.Добавить("Выгрузка отменена! Проверьте данные и перезапишите документ для автоотправки.");
	//	ОтказСтолетов=Истина;
	//	Возврат;
	//	
	//КонецЕсли;	
	
	
	Ошибка=0;	
	
	ЗаписьХМЛ=Новый ЗаписьXML;
	ЗаписьХМЛ.ОткрытьФайл(ИмяФайлаОбмена);   //(Путь+Имя+".xml");
	ДокументДом=Новый ДокументDom("","Document-DespatchAdvice");   // "http://v8.1c./8.1/sample91_DOM","Document-Order"
	КорневойЭлемент=ДокументДом.ЭлементДокумента;
	//-------- Order-Header ------------------------------------------
	ЭлементДом=ДокументДом.СоздатьЭлемент("DespatchAdvice-Header");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	//----------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("DespatchAdviceNumber");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(ДокОбъект.Номер);
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("DespatchAdviceDate");  // дата
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	ДатаДок=Формат(ДокОбъект.Дата, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаДок));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("DespatchAdviceTime");     // время
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	ВремяДок=Формат(ДокОбъект.Дата, "ДФ=""ЧЧ:мм""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ВремяДок));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("EstimatedDeliveryDate");  // дата
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	ДатаДок2=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаДок2));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("EstimatedDeliveryTime");     // время
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	ВремяДок2=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""ЧЧ:мм""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ВремяДок2));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	
	//----------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("BuyerOrderNumber");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(ДокОбъект.НомерЗаказа);
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("BuyerOrderDate");  // дата
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	ДатаДок=Формат(ДокОбъект.ДатаЗаказа, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаДок));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("Currency");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	текстДом=ДокументДом.СоздатьТекстовыйУзел("RUR");
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	
	//**********************************************************
	//                второй блок данных
	//**********************************************************
	
	ЭлементДом=ДокументДом.СоздатьЭлемент("DespatchAdvice-Parties");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	//----------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("Buyer");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	
	СписокКодИЛН=ДокОбъект.ПунктДоставки.ИЛН;
	
	КодИЛН=ДокОбъект.ПунктДоставки.КодИЛН;
	
	Для каждого ТекНОм из СписокКодИЛН Цикл
		
		КодИЛН=ТекНом.КодИЛН;
		
	КонецЦикла;	
	
	Элемент3=ДокументДом.СоздатьЭлемент("ILN");
	ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(КодИЛН));
	ТекУзел3.ДобавитьДочерний(ТекстДом);
	//------------------------------------------------------------
	
	Элемент2=ДокументДом.СоздатьЭлемент("Seller");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	
	Элемент3=ДокументДом.СоздатьЭлемент("ILN");
	ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
	текстДом=ДокументДом.СоздатьТекстовыйУзел("4607182079990");
	ТекУзел3.ДобавитьДочерний(ТекстДом);
	
	Элемент3=ДокументДом.СоздатьЭлемент("CodeByBuyer");
	ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.КодПоставщика));
	ТекУзел3.ДобавитьДочерний(ТекстДом);
	
	//------------------------------------------------------------
	
	Элемент2=ДокументДом.СоздатьЭлемент("DeliveryPoint");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	
	Элемент3=ДокументДом.СоздатьЭлемент("ILN");
	ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(КодИЛН));
	ТекУзел3.ДобавитьДочерний(ТекстДом);
	
	
	//-------------------------
	//    заполнение строк
	//-------------------------
	ЭлементДом=ДокументДом.СоздатьЭлемент("DespatchAdvice-Lines");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	ОбщаяСумма=0;
	РР=1;
	Для Каждого ТекСтрока из ДокОбъект.Товары цикл
		//ТекСтрока.Номенклатура.Вес
		Если ТекСтрока.Количество<=0 Тогда
			Продолжить;
		КонецЕсли; 
		
		Элемент=ДокументДом.СоздатьЭлемент("Line");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент);
		//----------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("Line-Item");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		
		
		Элемент=ДокументДом.СоздатьЭлемент("LineNumber");
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(рр));                 
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		Элемент=ДокументДом.СоздатьЭлемент("OrderLineNumber");
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(рр));                 
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		
		// ищем штрихкод номенклатуры  -----------------------------
		// ищем по штрихкодам.
		
		ШКО="";
		Артикул="";
		
		Попытка
			
			ТипШк = Перечисления.ТипыШтрихКодов.Штука;
			
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	ШтрихКоды.Владелец КАК Номенклатура,
			|	ШтрихКоды.Наименование как номер,
			|	ШтрихКоды.Код
			|ИЗ
			|	Справочник.ШтрихКоды КАК ШтрихКоды
			|ГДЕ
			|	ШтрихКоды.ТипШК = &ТипШК
			|	И ШтрихКоды.Владелец = &ТекНом";
			
			Запрос.УстановитьПараметр("ТекНом",текСтрока.Номенклатура); 
			Запрос.УстановитьПараметр("ТипШК",ТипШк);
			
			Выборка1 = запрос.Выполнить().Выбрать();
			
			Пока выборка1.Следующий() Цикл
				ШКО=выборка1.Номер; //ШКО+"@"
			КонецЦикла;	
			
		Исключение
		КонецПопытки;
		
		// артикул контрагента ищем.
		
		//	Попытка
		//
		//		ТипШк = Перечисления.ТипыШтрихКодов.Штука;
		//		Запрос=Новый Запрос;
		//		Запрос.Текст="ВЫБРАТЬ
		//					 |	АртикулыКонтрагентов.Код КАК Номер,
		//					 |	АртикулыКонтрагентов.Наименование
		//					 |ИЗ
		//					 |	Справочник.АртикулыКонтрагентов КАК АртикулыКонтрагентов
		//					 |ГДЕ
		//					 |	АртикулыКонтрагентов.Владелец = &ТекНОм
		//					 |	И АртикулыКонтрагентов.ТипАртикула = &Артикул";
		//		
		//		Запрос.УстановитьПараметр("ТекНом",текСтрока.Номенклатура); 
		//		Запрос.УстановитьПараметр("Артикул",Справочники.ТипыАтрикуловКонтрагентов.НайтиПоКоду("SNL-0009"));
		//		
		//		Выборка21 = запрос.Выполнить().Выбрать();
		//		
		//		Пока выборка21.Следующий() Цикл
		//			Артикул=выборка21.Номер; //ШКО+"@"
		//		КонецЦикла;	
		//		
		//	Исключение
		//	КонецПопытки;
		
		
		//----------------------------------------------------------------------------------------------------------------------------
		//ищем по документу Матрица штрих кода и коды контрагента
		
		ШКПоМатрице=НЕопределено;
		АртикулПоМатрице=НЕопределено;
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура,
		|	МатрицаТовары.ШККонтрагента,
		|	МатрицаТовары.АртикулКонтрагента,
		|	МатрицаТовары.Цена,
		|	МатрицаТовары.Ссылка
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
		|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА
		|	И МатрицаТовары.Номенклатура = &ТекНом";
		
		Запрос.УстановитьПараметр("Контрагент",ДокОбъект.Контрагент);
		Запрос.УстановитьПараметр("ТекНом",ТекСтрока.Номенклатура);
		
		//Запрос.УстановитьПараметр("ТекАрт",Артикул);
		Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
		
		Рез=Запрос.Выполнить().Выбрать();
		пппп=Запрос.Выполнить().Выгрузить();
		
		
		Если Рез.Следующий() Тогда
			ШКПоМатрице= Рез.ШККонтрагента;
			АртикулПоМатрице= Рез.АртикулКонтрагента;
			АртикулПоМатрице= СтрЗаменить(АртикулПоМатрице , ".", "");
		КонецЕсли;
		
		Если ШКПоМатрице<>Неопределено Тогда
			ШКО=ШКПоМатрице;
		КонецЕсли;
		
		Если АртикулПоМатрице<>Неопределено Тогда
			Артикул=АртикулПоМатрице;
		КонецЕсли;
		
		
		///----------------------------------------------------------------------------------------------------------------------------
		
		Если Артикул="" Тогда
			КрОшибки.Добавить("Для номенклатуры - "+ТекСтрока.Номенклатура+" - не определен код покупателя, для выгрузки в Е-код!!! (Заполните Документ Матрица)");
			Ошибка=1;
		КонецЕсли;
		
		
		Если ШКО="" Тогда
			КрОшибки.Добавить("Для номенклатуры - "+ТекСтрока.Номенклатура+" - не определен штрихкод, для выгрузки в Е-код!!! (Заполните Документ Матрица)");
			Ошибка=1;
			//прервать;
		КонецЕсли;
		
		//---------------------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("EAN");  //штрихкод
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(ШКО);                      
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		//----------------------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("BuyerItemCode");  //штрихкод
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Артикул);                     
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		//----------------------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("DespatchedQuantity");  //коли отправ
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		
		Кол=ЗаменитьТочку(ТекСтрока.Количество,3);
		
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Кол));                     
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		//----------------------------------------------------------
		Заявка=ЗаменитьТочку(ТекСтрока.Заявка,3);
		
		Элемент=ДокументДом.СоздатьЭлемент("OrderedQuantity");  //штрихкод
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Заявка));                     
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		//----------------------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("UnitOfMeasure");  //штрихкод
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел("PCE");                     
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		//----------------------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("ItemDescription");  // наименование номенклатуры
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(ТекСтрока.Номенклатура.Наименование);                      
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		//  НДС
		Цена= ЗаменитьТочку(ТекСтрока.Цена-(Окр(ТекСтрока.НДС/ТекСтрока.Количество,2,0)),2);
		
		Элемент=ДокументДом.СоздатьЭлемент("UnitNetPrice");  // цена без ндс
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(цена));                      
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		
		//
		Сумма=(ТекСтрока.Цена-(Окр(ТекСтрока.НДС/ТекСтрока.Количество,2,0)))*ТекСтрока.Количество;
		Цена= ЗаменитьТочку(Сумма,2);
		
		Элемент=ДокументДом.СоздатьЭлемент("NetAmount");  // сумма цена без ндс
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		ОбщаяСумма=ОбщаяСумма+Сумма;
		
		//----------------------------------------------------------
		//ГТД
		
		ГТД=ПолучитьГрупповойПериодическийРеквизит(ТекСтрока.Номенклатура.Родитель,"НомерГТД",ТекущаяДата());
		
		Страна	="RU";
		НомерГТД="";
		Если ГТД<>Неопределено И Врег(""+ГТД.СтранаПроисхождения)<>"РОССИЯ" И НЕ ПустаяСтрока(""+ГТД.СтранаПроисхождения) Тогда
			Страна		=""+ГТД.СтранаПроисхождения;
			НомерГТД	=СокрЛП(""+ГТД.Наименование);
		КонецЕсли;
		
		
		Если НомерГТД="" Тогда
			КрОшибки.Добавить("Для номенклатуры - "+ТекСтрока.Номенклатура+" - не определен номер ГТД! ");
			Ошибка=1;
		КонецЕсли;	
		
		//--------------------------------------------------------------------------------
		// ищем номер страны для гтд
		//--------------------------------------------------------------------------------
		Макет=ЭтотОБъект.ПолучитьМакет("КлассификаторСтранМира");
		Искомое2 = СокрЛП(Страна);  //значение в макете есть, не находит
		Искомое = Макет.НайтиТекст(Искомое2); //,, ОбластьПоиска);
		Если Искомое<>Неопределено ТОгда
			Строка=Искомое.Низ;
			Колонка=Искомое.Лево+1; // для кода
		КонецЕсли;
		// получаем код
		
		Страна=Макет.Область(Строка,Колонка).Текст;
		
		//--------------------------------------------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("CountryOfOriginCode");
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Страна));                      
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		//----------------------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("CustomsDeclarationNumber");
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(НомерГТД));                      
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		РР=РР+1;
		
	КонецЦикла;
	
	Если НЕ Ошибка Тогда
		
		КорневойЭлемент=ДокументДом.ЭлементДокумента;
		//-------- Order-Header ------------------------------------------
		ЭлементДом=ДокументДом.СоздатьЭлемент("DespatchAdvice-Summary");
		ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
		//----------------------------------------------------------------
		Элемент2=ДокументДом.СоздатьЭлемент("TotalAmount");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		
		ОбщаяСумма=ЗаменитьТочку(ОбщаяСумма,2);
		
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ОбщаяСумма));
		ТекУзел2.ДобавитьДочерний(ТекстДом);
		//------------------------------------------------------------
		Элемент2=ДокументДом.СоздатьЭлемент("TotalQuantity");  // дата
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		
		КолДок = ЗаменитьТочку(ДокОбъект.КоличествоДокумента,2);
		
		текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(КолДок));
		ТекУзел2.ДобавитьДочерний(ТекстДом);
		
		
		//---------------------------------------------------------------
		ЗаписьДом=Новый ЗаписьDom;
		ЗаписьДом.Записать(ДокументДом,ЗаписьХМЛ);
		ЗаписьХМЛ.Закрыть();	
		//ОтказСтолетов=Истина;
		
		//Сообщить("Сформирован файл: "+ИмяФайлаОбмена);
		
	Иначе
		
		КрОшибки.Добавить("Обнаружены ошибки, файл не записан! Исправьте документ Матрица");
		
	КонецЕсли;
	
	
	
	//----------------------------------------
	//             отправить письмо
	//----------------------------------------
	Шапка="";
	СообщитьМенеджеруГлобус(ИмяФайлаОбмена);
	
	Если КрОшибки.Количество() Тогда
		
		СообщитьКритОшибкиГлобус();
		
	КонецЕсли;	
	
	
КонецПроцедуры

Функция ЗаменитьТочку(ИсхЧисло,КолПослеЗапятой)
	
	СтрокаЧ=Формат(ИсхЧисло,"ЧДЦ="+КолПослеЗапятой+"");
	СтрокаЧ=Строка(СтрокаЧ);
	СтрокаЧ= СтрЗаменить(СтрокаЧ,",",".");
	
	Возврат СтрокаЧ;
	
КонецФункции


Процедура СообщитьМенеджеруГлобус(ПутьФайла) Экспорт
	
	Менеджер=ДокОбъект.контрагент.Менеджер;
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "87.236.190.180";
	//Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);	
	// Кухарь А.Ю.  08.09.2022 конец
	Профиль.ПортSMTP           = 25;
	
	//Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
	Профиль.АутентификацияPOP3=СпособPOP3Аутентификации.Обычная;
	Профиль.АутентификацияSMTP=СпособSMTPАутентификации.Login;
	
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	//Профиль.ПользовательSMTP="*%*%*%";
	//профиль.ПарольSMTP="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	Профиль.ПользовательSMTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.ПарольSMTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	//----------------------------------------------------------------
	Сообщение=новый интернетПочтовоеСообщение;
	Сообщение.Получатели.Добавить("ecode@collant.ru"); //+++
	Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	
	//Сообщение.Получатели.Добавить("murashko@collant.ru");
	
	
	
	Сообщение.Отправитель="ecode@kbstil.ru";
	ПунктДоставки=ДокОбъект.ПунктДоставки;
	
	Если ПунктДоставки=Неопределено тогда
		ПунктДоставки="";
	Конецесли;	
	
	
	Сообщение.Тема="Уведомление об отгрузке заказа № "+ДокОбъект.номерЗаказа+" -  "+ДокОбъект.контрагент+" - "+ПунктДоставки;
	Строка=Символ(13)+Символ(13)+"       Добрый день!"+Символ(13)+Символ(13)+Строка("Подтверждение заказа покупателя № "+ДокОбъект.НомерЗаказа+" . "+ДокОбъект.Ссылка);
	
	НомСтр=1;
	Строка=Строка+Символы.ПС+символы.ПС+"Фактический адрес, пунк доставки: "+ДокОбъект.ПунктДоставки;
	Строка=Строка+Символы.ПС;
	
	Строка=Строка+Символы.ПС+"________________________________________________________________";
	Строка=Строка+Символы.ПС+"ООО <<Единая Европа - Элит>>";
	
	Сообщение.Тексты.Добавить(Строка);
	//Сообщение.Вложения.Добавить(ПутьФайла);
	Попытка
		Сообщение.Вложения.Добавить(ПутьФайла);     //+++
	Исключение
		КрОшибки.Добавить("Не возможно добавить файл выгрузки "+ДокОбъект.ссылка+". Контрагент - "+ДокОбъект.контрагент+".  "+ОписаниеОшибки() );
	КонецПопытки;
	
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
	исключение
		КрОшибки.Добавить("Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки() );
	конецПопытки;
	Попытка
		Почта.Послать(Сообщение);
	исключение
		КрОшибки.Добавить("Не возможно отправить сообщение!   "+ОписаниеОшибки() );
	конецПопытки;
	Почта.Отключиться();
	
	Если крОшибки.Количество()=0 Тогда
		
		// Сообщить("Файл отправлен покупателю. ");
		
	КонецЕсли;   
	
	//----------------------------------------
	//           удаляем файл отправки
	//----------------------------------------
	
	//	УдалитьФайлы(ПутьФайла);     //+++
	
	// файлы не удаляем, т.к. они удаляться самим Е-кодом.
	
КонецПроцедуры

Процедура СообщитьКритОшибкиГлобус() Экспорт
	
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "87.236.190.180";
	//Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);	
	// Кухарь А.Ю.  08.09.2022 конец
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	//Профиль.ПользовательSMTP="*%*%*%";
	//профиль.ПарольSMTP="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	Профиль.ПользовательSMTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.ПарольSMTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	//------------------------------------------------
	// сообщение о критических ошибках
	//------------------------------------------------
	сообщениеКрит=новый интернетПочтовоеСообщение;
	СообщениеКрит.Получатели.Добавить("ecode@collant.ru");    //+++
	СообщениеКрит.Получатели.Добавить("nechaeva@collant.ru");
	
	//СообщениеКрит.Получатели.Добавить("murashko@collant.ru");
	
	
	сообщениеКрит.Отправитель="ecode@collant.ru";
	СообщениеКрит.Тема="Автообмен с ГиперГлобусом. Критические ошибки!";
	Строка="Добрый день!!!"+Символ(13);
	НомСтр=1;
	Если НЕ Ошибки=Неопределено и КрОшибки.Количество()>0 Тогда
		Для рр=0 по КрОшибки.Количество()-1 Цикл
			Строка=Строка+Символ(13)+НомСтр+". "+КрОшибки[рр];
			Строка=Строка+Символ(13);
			НомСтр=НомСтр+1;
		КонецЦикла;
	КонецЕсли;
	
	Строка=Строка+Символ(13)+"________________________________________________________________";
	//-----------------------------------------
	СообщениеКрит.Тексты.Добавить(Строка);
	
	Почта= Новый ИнтернетПочта;
	Почта.Подключиться(Профиль);
	почта.Послать(СообщениеКрит);
	Почта.Отключиться();
	
КонецПроцедуры


// *************************************************************************************************************************************
//- ---- ДИКСИКА (ПАРИЖ) "уведомление об отгрузке РНК"
//**************************************************************************************************************************************
// нечаева 19,09,2014 +++


Функция ПолучитьТаблицуНакладнойДиксика(Режим="Накладная",СФ=Неопределено,СписокНакладных)
	
	НеУчитыватьРекламации=ложь;
	
	Кратко=истина;
	фСводнаяСФ=ложь;
	
	ТН=Новый ТаблицаЗначений;
	
	ТН.Колонки.Добавить("Номенклатура");	
	ТН.Колонки.Добавить("Количество");
	ТН.Колонки.Добавить("НДС");
	ТН.Колонки.Добавить("Сумма");
	ТН.Колонки.Добавить("Всего");	
	
	Если Режим="СФ" И фСводнаяСФ Тогда		
		Если СФ=Неопределено ИЛИ СФ.Пустая() Тогда
			//Катаев+ 22/09/14
			//Предупреждение("Невоможно определить сводную СФ для печати !");
			#Если Клиент Тогда
				Предупреждение("Невоможно определить сводную СФ для печати !");		
			#КонецЕсли
			//Катаев- 22/09/14
		Иначе
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ Накладная ИЗ Документ.СчетФактура.Накладные ГДЕ Ссылка=&СФ";
			Запрос.УстановитьПараметр("СФ",СФ);			
			СписокНакладных=Запрос.Выполнить().Выгрузить();
			
			Запрос=Новый Запрос;
			Запрос.Текст="
			|ВЫБРАТЬ
			|	Номенклатура,
			|	СУММА(Количество) КАК Количество,
			|	СУММА(НДС) КАК НДС,
			|	СУММА(Всего) КАК Всего,
			|	Номенклатура.Родитель КАК Модель
			|ИЗ
			|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
			|ГДЕ
			|	РасходнаяНакладнаяТовары.Ссылка.Ссылка В(&СписокНакладных)
			|СГРУППИРОВАТЬ ПО Номенклатура";		
			
			Запрос.УстановитьПараметр("СписокНакладных",СписокНакладных);
			ИсходнаяТЧ=Запрос.Выполнить().Выгрузить();	
			//крохин начало 15.02.2012
			//сделаем таблицей значений, без ограничения типа
			ИсходнаяТЧ = Новый ТаблицаЗначений;
			ИсходнаяТЧ.Колонки.Добавить("Номенклатура");	
			ИсходнаяТЧ.Колонки.Добавить("Количество");
			ИсходнаяТЧ.Колонки.Добавить("НДС");
			ИсходнаяТЧ.Колонки.Добавить("Сумма");
			ИсходнаяТЧ.Колонки.Добавить("Всего");
			ИсходнаяТЧ.Колонки.Добавить("Цена");
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Если  Выборка.Количество = 0 Тогда Продолжить КонецЕсли;
				СтрокаИсходнойТЧ = ИсходнаяТЧ.Добавить();
				СтрокаИсходнойТЧ.Номенклатура = Выборка.Номенклатура;
				СтрокаИсходнойТЧ.Количество = Выборка.Количество;
				СтрокаИсходнойТЧ.НДС = Выборка.НДС;
				СтрокаИсходнойТЧ.Сумма = Выборка.Всего - Выборка.НДС;
				СтрокаИсходнойТЧ.Всего = Выборка.Всего;
				СтрокаИсходнойТЧ.Цена = Выборка.Всего/Выборка.Количество;
			КонецЦикла;
			//крохин конец 15.02.2012
			
		КонецЕсли; 
	Иначе
		//крохин начало 29.11.2011
		//ИсходнаяТЧ=ДокОбъект.Товары;
		ИсходнаяТЧ=ДокОбъект.Товары.Выгрузить();
		//крохин конец 29.11.2011
		//крохин начало 15.02.2012
		//сделаем таблицей значений, без ограничения типа
		ИсходнаяТЧ = Новый ТаблицаЗначений;
		ИсходнаяТЧ.Колонки.Добавить("Номенклатура");	
		ИсходнаяТЧ.Колонки.Добавить("Количество");
		ИсходнаяТЧ.Колонки.Добавить("НДС");
		ИсходнаяТЧ.Колонки.Добавить("Сумма");
		ИсходнаяТЧ.Колонки.Добавить("Всего");
		ИсходнаяТЧ.Колонки.Добавить("Цена");
		
		Для Каждого СтрокаТЧ Из ДокОбъект.Товары Цикл
			Если  СтрокаТЧ.Количество = 0 Тогда Продолжить КонецЕсли;
			СтрокаИсходнойТЧ = ИсходнаяТЧ.Добавить();
			СтрокаИсходнойТЧ.Номенклатура = СтрокаТЧ.Номенклатура;
			СтрокаИсходнойТЧ.Количество = СтрокаТЧ.Количество;
			СтрокаИсходнойТЧ.НДС = СтрокаТЧ.НДС;
			СтрокаИсходнойТЧ.Сумма = СтрокаТЧ.Сумма;
			СтрокаИсходнойТЧ.Всего = СтрокаТЧ.Всего;
			СтрокаИсходнойТЧ.Цена = СтрокаТЧ.Всего/СтрокаТЧ.Количество;
		КонецЦикла;
		//крохин конец 15.02.2012
		
	КонецЕсли;
	//крохин начало 21.11.2011
	//рекламации
	
	Если НЕ НеУчитыватьРекламации Тогда
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	РекламационнаяНакладнаяТовары.Номенклатура,
		|	СУММА(РекламационнаяНакладнаяТовары.Количество) КАК Количество,
		|	СУММА(РекламационнаяНакладнаяТовары.НДС) КАК НДС,
		|	СУММА(РекламационнаяНакладнаяТовары.Всего) КАК Всего
		|ИЗ
		|	Документ.РекламационнаяНакладная.Товары КАК РекламационнаяНакладнаяТовары
		|ГДЕ
		|	РекламационнаяНакладнаяТовары.Ссылка.ДокОснование.Ссылка В(&СписокНакладных)
		|	И РекламационнаяНакладнаяТовары.Ссылка.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	РекламационнаяНакладнаяТовары.Номенклатура";		
		Если  СписокНакладных = Неопределено Тогда
			СписокНакладных = ДокОбъект.Ссылка;
		КонецЕсли;
		Запрос.УстановитьПараметр("СписокНакладных",СписокНакладных);
		РекламационнаяТЧ=Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаТЧ Из РекламационнаяТЧ Цикл
			СтрокаТН=ИсходнаяТЧ.Добавить();
			СтрокаТН.Номенклатура = СтрокаТЧ.Номенклатура;
			СтрокаТН.НДС = -СтрокаТЧ.НДС;
			СтрокаТН.Всего = -СтрокаТЧ.Всего;
			СтрокаТН.Количество = -СтрокаТЧ.Количество;
		КонецЦикла;
		ИсходнаяТЧ.Свернуть("Номенклатура","НДС,Количество,Всего");
		// нечаева 20,11,13  +++
		
		// рекламации по ценам
		// нечаева 05,08,14 +++++++++++
		
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	КорректировкаЦенВНакладнойТовары.Номенклатура,
		|	СУММА(КорректировкаЦенВНакладнойТовары.Количество) КАК Количество,
		|	СУММА(КорректировкаЦенВНакладнойТовары.НДС) КАК НДС,
		|	СУММА(КорректировкаЦенВНакладнойТовары.Всего) КАК Всего
		|ИЗ
		|	Документ.КорректировкаЦенВНакладной.Товары КАК КорректировкаЦенВНакладнойТовары
		|ГДЕ
		|	КорректировкаЦенВНакладнойТовары.Ссылка.ДокОснование.Ссылка В(&СписокНакладных)
		|	И КорректировкаЦенВНакладнойТовары.Ссылка.Проведен
		|	И КорректировкаЦенВНакладнойТовары.Ссылка.ВидРекламации = &Вычерк
		|
		|СГРУППИРОВАТЬ ПО
		|	КорректировкаЦенВНакладнойТовары.Номенклатура";		
		Если  СписокНакладных = Неопределено Тогда
			СписокНакладных = ДокОбъект.Ссылка;
		КонецЕсли;
		Запрос.УстановитьПараметр("СписокНакладных",СписокНакладных);
		Запрос.УстановитьПараметр("Вычерк",перечисления.ВидыРекламаций.Вычерк);
		
		РекламационнаяТЧ=Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаТЧ Из РекламационнаяТЧ Цикл
			СтрокаТН=ИсходнаяТЧ.Добавить();
			СтрокаТН.Номенклатура = СтрокаТЧ.Номенклатура;
			СтрокаТН.НДС = -СтрокаТЧ.НДС;
			СтрокаТН.Всего = -СтрокаТЧ.Всего;
			СтрокаТН.Количество =0;
		КонецЦикла;
		ИсходнаяТЧ.Свернуть("Номенклатура","НДС,Количество,Всего");
		
		
		
		
		// нечаева 05,08,14 -----------
		
	Иначе
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	КорректировкаЦенВНакладнойТовары.Номенклатура,
		|	СУММА(КорректировкаЦенВНакладнойТовары.Количество) как количество,
		|	СУММА(КорректировкаЦенВНакладнойТовары.НДС) как ндс,
		|	СУММА(КорректировкаЦенВНакладнойТовары.Всего)  как всего
		|ИЗ
		|	Документ.КорректировкаЦенВНакладной.Товары КАК КорректировкаЦенВНакладнойТовары
		|ГДЕ
		|	КорректировкаЦенВНакладнойТовары.Ссылка.ДокОснование.Ссылка В(&СписокНакладных)
		|	И (НЕ КорректировкаЦенВНакладнойТовары.Ссылка.Проведен)
		|	И КорректировкаЦенВНакладнойТовары.Ссылка.Отработано = Истина
		|
		|СГРУППИРОВАТЬ ПО
		|	КорректировкаЦенВНакладнойТовары.Номенклатура";		
		Если  СписокНакладных = Неопределено Тогда
			СписокНакладных = ДокОбъект.Ссылка;
		КонецЕсли;
		Запрос.УстановитьПараметр("СписокНакладных",СписокНакладных);
		РекламационнаяТЧ=Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаТЧ Из РекламационнаяТЧ Цикл
			СтрокаТН=ИсходнаяТЧ.Добавить();
			СтрокаТН.Номенклатура = СтрокаТЧ.Номенклатура;
			СтрокаТН.НДС = СтрокаТЧ.НДС;
			СтрокаТН.Всего = СтрокаТЧ.Всего;
			СтрокаТН.Количество = 0;
		КонецЦикла;
		ИсходнаяТЧ.Свернуть("Номенклатура","НДС,Количество,Всего");
		
		
		
		// рекламации по ценам
		// нечаева 05,02,14 +++++++++++
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	РекламационнаяНакладнаяТовары.Номенклатура,
		|	СУММА(РекламационнаяНакладнаяТовары.Количество) как количество,
		|	СУММА(РекламационнаяНакладнаяТовары.НДС) как ндс,
		|	СУММА(РекламационнаяНакладнаяТовары.Всего)  как всего
		|ИЗ
		|	Документ.РекламационнаяНакладная.Товары КАК РекламационнаяНакладнаяТовары
		|ГДЕ
		|	РекламационнаяНакладнаяТовары.Ссылка.ДокОснование.Ссылка В(&СписокНакладных)
		|	И (НЕ РекламационнаяНакладнаяТовары.Ссылка.Проведен)
		|	И РекламационнаяНакладнаяТовары.Ссылка.Отработано = Истина
		|
		|СГРУППИРОВАТЬ ПО
		|	РекламационнаяНакладнаяТовары.Номенклатура";		
		Если  СписокНакладных = Неопределено Тогда
			СписокНакладных = ДокОбъект.Ссылка;
		КонецЕсли;
		Запрос.УстановитьПараметр("СписокНакладных",СписокНакладных);
		РекламационнаяТЧ=Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаТЧ Из РекламационнаяТЧ Цикл
			СтрокаТН=ИсходнаяТЧ.Добавить();
			СтрокаТН.Номенклатура = СтрокаТЧ.Номенклатура;
			СтрокаТН.НДС = СтрокаТЧ.НДС;
			СтрокаТН.Всего = СтрокаТЧ.Всего;
			СтрокаТН.Количество = СтрокаТЧ.Количество;
		КонецЦикла;
		ИсходнаяТЧ.Свернуть("Номенклатура","НДС,Количество,Всего");
		
		
		// нечаева 20,11,13 ---- 
	КонецЕсли;
	
	//крохин конец 21.11.2011
	
	
	
	Для Каждого СтрокаТЧ Из ИсходнаяТЧ Цикл
		Если СтрокаТЧ.Количество=0 Тогда Продолжить КонецЕсли; 
		
		СтрокаТН=ТН.Добавить();		
		
		СтрокаТН.Количество	=СтрокаТЧ.Количество;		
		СтрокаТН.Всего		=СтрокаТЧ.Всего;
		СтрокаТН.НДС		=СтрокаТЧ.НДС;		
		СтрокаТН.Сумма		=СтрокаТЧ.Всего-СтрокаТЧ.НДС;
		
		Номенклатура		=СтрокаТЧ.Номенклатура;
		Модель				=Номенклатура.Родитель;
		
		СтрокаТН.Номенклатура=?(Кратко=0,СтрокаТЧ.Номенклатура,Модель);
	КонецЦикла;
	
	
	
	Если Кратко Тогда
		ТН.Свернуть("Номенклатура","Количество,Сумма,НДС,Всего");
	КонецЕсли; 
	
	ТН.Колонки.Добавить("Цена");
	ТН.Колонки.Добавить("СтавкаНДС");
	ТН.Колонки.Добавить("НоменклатураПредставление");
	ТН.Колонки.Добавить("Единица");	
	ТН.Колонки.Добавить("ОКЕИ");	
	ТН.Колонки.Добавить("Страна");
	//крохин начало 23.01.2012
	//новая форма
	ТН.Колонки.Добавить("СтранаКод");
	//крохин конец 23.01.2012
	ТН.Колонки.Добавить("НомерГТД");
	ТН.Колонки.Добавить("ШтрихКод");
	ТН.Колонки.Добавить("КодКонтрагента");
	ТН.Колонки.Добавить("КоличествоКоробок");
	ТН.Колонки.Добавить("ШтукВКоробке");
	//Лобан 260713 +++
	//новая форма е5
	ТН.Колонки.Добавить("ШКТовара");
	//Лобан 260713 +++
	
	Для Каждого СтрокаТН Из ТН Цикл
		Номенклатура=СтрокаТН.Номенклатура;
		Модель		=?(Кратко,СтрокаТН.Номенклатура,СтрокаТН.Номенклатура.Родитель);
		
		СтрокаТН.Цена		=?(СтрокаТН.Количество=0,0,СтрокаТН.Сумма/СтрокаТН.Количество);
		Если СтрокаТН.Сумма=0 Тогда
			СтрокаТН.СтавкаНДС=100*ПроцентНДСпоСтавке(ПолучитьРеквизитРодителя(СтрокаТН.Номенклатура,"СтавкаНДС"));
		Иначе			
			СтрокаТН.СтавкаНДС	=Окр(100*(СтрокаТН.НДС/СтрокаТН.Сумма),0,1);
		КонецЕсли;			
		
		СтрокаТН.Единица	="шт.";			
		СтрокаТН.ОКЕИ		="796";
		
		//ГТД
		ГТД=ПолучитьГрупповойПериодическийРеквизит(Модель,"НомерГТД",ДокОбъект.Дата);
		
		Страна	="Россия";
		НомерГТД="--------";
		//крохин начало 23.01.2012
		//новая форма
		СтранаКод = "643";
		//крохин конец 23.01.2012
		
		Если ГТД<>Неопределено И Врег(""+ГТД.СтранаПроисхождения)<>"РОССИЯ" И НЕ ПустаяСтрока(""+ГТД.СтранаПроисхождения) Тогда
			Страна		=""+ГТД.СтранаПроисхождения;
			НомерГТД	=СокрЛП(""+ГТД.Наименование);
			//крохин начало 23.01.2012
			//новая форма
			СтранаКод = ГТД.СтранаПроисхождения.Код;
			//крохин конец 23.01.2012
			
		КонецЕсли;
		
		Если Страна<>"Россия" И СтрДлина(НомерГТД)<25 Тогда			
			Если СтрДлина(НомерГТД)<23 Тогда
				//Катаев+ 22/09/14
				//Сообщить("Кривой ГТД !!! Товар: """+СтрокаТН.Номенклатура+""", ГТД: """+НомерГТД+""" !");
				#Если Клиент Тогда
					Сообщить("Кривой ГТД !!! Товар: """+СтрокаТН.Номенклатура+""", ГТД: """+НомерГТД+""" !");
				#Конецесли
				//Катаев- 22/09/14
			Иначе
				//Катаев+ 22/09/14
				//Сообщить("Отсутствует 4-ый сегмент ГТД !!! Товар: """+СтрокаТН.Номенклатура+""", ГТД: """+НомерГТД+""" !");
				#Если Клиент Тогда
					Сообщить("Отсутствует 4-ый сегмент ГТД !!! Товар: """+СтрокаТН.Номенклатура+""", ГТД: """+НомерГТД+""" !");
				#КонецЕсли
				
				НомерГТД=НомерГТД+"/3";
			КонецЕсли; 					
		КонецЕсли;
		//крохин начало 30.08.2012
		//новые правила заполнения СФ с 2012 года
		Если Страна="Россия" Тогда
			Страна	="--------";
		КонецЕсли;
		//крохин конец 30.08.2012
		
		
		СтрокаТН.Страна		= Страна;
		СтрокаТН.НомерГТД	= НомерГТД;
		//крохин начало 23.01.2012
		//новая форма
		СтрокаТН.СтранаКод = СтранаКод;
		//крохин конец 23.01.2012
		//Лобан +++ 260713
		//Новая форма е5
		СтрокаТН.ШКТовара=ПолучитьШтрихКодТовара(СтрокаТН.Номенклатура);
		//Лобан --- 260713
		СтрокаТН.ШтрихКод=?(Кратко,СокрЛП(СтрокаТН.Номенклатура.Код77),Прав(ПолучитьШтрихКодТовара(СтрокаТН.Номенклатура),6));			
		
		//Лобан 120314 +++
		//Печать наименование номенклатуры для контрагента из матрицы
		//СтрокаТН.НоменклатураПредставление=СокрЛП(Модель.ТипТовара)+" "+СокрЛП(Модель.Родитель.Брэнд)+" "+СокрЛП(Модель.КодПроизводителя)+" "+Номенклатура.Наименование;
		Запрос.Текст = "ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура,
		|	МатрицаТовары.НаименованиеКонтрагента КАК НаименованиеКонтрагента
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	МатрицаТовары.Ссылка.Проведен
		|	И МатрицаТовары.Ссылка.Дата <= &Дата
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент";
		Запрос.УстановитьПараметр("Контрагент",ДокОбъект.Контрагент);
		Запрос.УстановитьПараметр("Дата",ДокОбъект.Дата);
		ТЗ = Запрос.Выполнить().Выгрузить();	
		Отбор = Новый Структура();
		Отбор.Вставить("Номенклатура",СтрокаТН.номенклатура.Ссылка);
		НайденныеСтроки = ТЗ.НайтиСтроки(Отбор);
		для Каждого Строчка из НайденныеСтроки Цикл 
			НаименованиеКонтрагента = Строчка.НаименованиеКонтрагента;
		КонецЦикла;
		если Не ПустаяСтрока(НаименованиеКонтрагента) тогда
			СтрокаТН.НоменклатураПредставление = НаименованиеКонтрагента 
		иначе		
			СтрокаТН.НоменклатураПредставление=СокрЛП(Модель.ТипТовара)+" "+СокрЛП(Модель.Родитель.Брэнд)+" "+СокрЛП(Модель.КодПроизводителя)+" "+Номенклатура.Наименование;		
		КонецЕсли;	
		//Лобан 120314 ---
	КонецЦикла; 
	
	//Если УпорядочитьНоменклатуру Тогда
	//	ТН.Сортировать("Номенклатура");	
	//КонецЕсли;		
	//крохин конец 05.09.2012
	
	Возврат ТН;
КонецФункции // ПолучитьТаблицуНакладной()

Функция ПолучитьСтавку(СтавкаНДС)
	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС10 тогда
		Возврат 10;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
		Возврат 18;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
		Возврат 20;
	КонецЕсли;
	ВОзврат 0;
КонецФункции

Процедура ОтправитьДиксика()
	// Вставить содержимое обработчика.
	
	Ошибка=0;
	ЗаписьXML=Новый ЗаписьXML();
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ИмяФ");
	ТЗ.Колонки.Добавить("Номер");
	ТЗ.Колонки.Добавить("ЕстьОшибки");
	ТЗ.Колонки.Добавить("РНК");
	
	//!!!!!!!!!
	//ИмяФайлаОбмена=""+константы.КаталогВнешнихОтчетов.Получить() +"temp\"+ НомЗак+"-"+ДокОбъект.Номер+".xml";
	Попытка
		Каталог = Новый Файл("C:\Temp\Диксика");
		Если Не Каталог.Существует() тогда
			СоздатьКаталог("C:\Temp\Диксика\");
		КонецЕсли;
	исключение
		КрОшибки.Добавить("Не создан каталог для обмена C:\Temp\Диксика\" );
	конецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МатрицаТовары.АртикулКонтрагента,
	|	МатрицаТовары.ШККонтрагента
	|ИЗ
	|	Документ.Матрица.Товары КАК МатрицаТовары
	|ГДЕ
	|	МатрицаТовары.Номенклатура.родитель = &Номенклатура
	|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
	|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата";
	Запрос.УстановитьПараметр("Контрагент", ДокОбъект.Контрагент);
	
	
	ТЗТовары=ПолучитьТаблицуНакладнойДиксика(,,ДокОбъект);
	
	
	// Формируем файл
	Ошибка = Ложь;
	Док = ДокОбъект.ссылка;
	Запрос.УстановитьПараметр("Дата", Док.Дата);
	ЗаписьXML=Новый ЗаписьXML();
	Параметры = Новый ПараметрыЗаписиXML("UTF-8", "1.0", Истина, Истина);
	Номер = Прав(Док.Номер,5);
	ИмяФ = "C:\Temp\Диксика\"+Номер+".xml";
	ИмяФайлаОбмена=ИмяФ;
	//ИмяФ = "\\SRVECODE\EdiConnector2\ObmenEN\Диксика\"+Номер+".xml";
	
	//\\SRVECODE\EdiConnector2\ObmenEN
	стрТЗ=ТЗ.Добавить();
	стрТЗ.ИмяФ=ИмяФ;
	стрТЗ.Номер=Номер;
	стрТЗ.РНК=Док.Номер;
	
	ЗаписьXML.ОткрытьФайл(ИмяФ,Параметры);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("invoice");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("num");
	ЗаписьXML.ЗаписатьТекст(СокрЛП(Док.Номер));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("date");
	ЗаписьXML.ЗаписатьТекст(Формат(Док.Дата, "ДФ=гггг-ММ-дд"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("SupplierCode");
	ЗаписьXML.ЗаписатьТекст("00166");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("SupplierName");
	ЗаписьXML.ЗаписатьТекст(СокрЛП(Док.Организация.Наименование));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("SupplierINN");
	ЗаписьXML.ЗаписатьТекст(СокрЛП(Док.Организация.ИНН));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СustomerName");
	ЗаписьXML.ЗаписатьТекст(СокрЛП(Док.Контрагент.ПолноеНаименование));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СustomerINN");
	ЗаписьXML.ЗаписатьТекст(СокрЛП(Док.Контрагент.ИНН));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("shopNum");
	ЗаписьXML.ЗаписатьТекст(СокрЛП(Док.ПунктДоставки.НомерМагазина));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Если ПустаяСтрока(СокрЛП(Док.ПунктДоставки.НомерМагазина)) Тогда
		//нечаева 22,09,14 +++
		КрОшибки.Добавить("Для пункта доставки "+Док.ПунктДоставки+" не заполнен номер магазина");
		#Если Клиент Тогда
			Сообщить("Для пункта доставки "+Док.ПунктДоставки+" не заполнен номер магазина");
		#КонецЕсли
		//нечаева 22,09,14 ---
		Ошибка = Истина;
		
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("shopAdres");
	ЗаписьXML.ЗаписатьТекст(СокрЛП(Док.ПунктДоставки.АдресПолучателя));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	СуммасНДС = Док.Товары.Итог("Всего");
	НДС = Док.Товары.Итог("НДС");
	ЗаписьXML.ЗаписатьНачалоЭлемента("summa"); 
	ЗаписьXML.ЗаписатьТекст(Формат(СуммасНДС, "ЧДЦ=2; ЧРД=.; ЧГ=0"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("NDS"); 
	ЗаписьXML.ЗаписатьТекст(Формат(НДС, "ЧДЦ=2; ЧРД=.; ЧГ=0"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("currency");
	ЗаписьXML.ЗаписатьТекст("RUR");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("itemqty");
	ЗаписьXML.ЗаписатьТекст(Формат(Док.Товары.Количество(), "ЧДЦ=0; ЧРД=.; ЧГ=0"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("comments");
	ЗаписьXML.ЗаписатьТекст(СокрЛП(Док.Комментарий));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Для каждого стр из ТЗТовары Цикл
		
		Если стр.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		ШК=Стр.ШтрихКод;
		Запрос.УстановитьПараметр("Номенклатура", стр.Номенклатура);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			КодДиксика = "";
			//ШК = "";
			Если ПустаяСтрока(Выборка.АртикулКонтрагента) Тогда
				Ошибка = Истина;
				КрОшибки.Добавить("Номенклатуры "+стр.Номенклатура+"  не указан артикул контрагента");
				//Сообщить("Для номенклатуры "+стр.Номенклатура+" не указан артикул контрагента");
				//	ШК = Выборка.ШККонтрагента;
			Иначе
				КодДиксика = Выборка.АртикулКонтрагента;
				//	ШК = Выборка.ШККонтрагента;
			КонецЕсли;
		Иначе
			Ошибка = Истина;
			
			//нечаева 22,09,14 +++
			КрОшибки.Добавить("Номенклатуры "+стр.Номенклатура+" не внесена в номенклатурную матрицу");
			//нечаева 22,09,14 -
		КонецЕсли;
		
		Если Не Ошибка Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("invoiceItemSet");
			ЗаписьXML.ЗаписатьНачалоЭлемента("itemSupplierCode");
			ЗаписьXML.ЗаписатьТекст(СокрЛП(КодДиксика));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("BarCode");
			ЗаписьXML.ЗаписатьТекст(СокрЛП(ШК));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("description");
			ЗаписьXML.ЗаписатьТекст(СокрЛП(стр.Номенклатура.Наименование));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Quantity");
			ЗаписьXML.ЗаписатьТекст(Формат(стр.Количество, "ЧДЦ=2; ЧРД=.; ЧГ=0"));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			ЗаписьXML.ЗаписатьНачалоЭлемента("Сoefficient");
			ЗаписьXML.ЗаписатьТекст(Формат("1", "ЧДЦ=2; ЧРД=.; ЧГ=0"));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			Если стр.Количество>0 Тогда
				ЦенаБезНДС = стр.Сумма / стр.Количество;
			иначе
				ЦенаБезНДС = 0;
			КонецЕсли;
			СуммаБезНДС = стр.Сумма;
			СуммаНДС = стр.НДС;
			СуммаСНДС = стр.Всего;
			СтавкаНДС = ПолучитьСтавку(стр.СтавкаНДС);
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("PriceBase");
			ЗаписьXML.ЗаписатьТекст(Формат(ЦенаБезНДС, "ЧДЦ=2; ЧРД=.; ЧГ=0"));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("SumBase");
			ЗаписьXML.ЗаписатьТекст(Формат(СуммаБезНДС, "ЧДЦ=2; ЧРД=.; ЧГ=0"));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("SumOfNds");
			ЗаписьXML.ЗаписатьТекст(Формат(СуммаНДС, "ЧДЦ=2; ЧРД=.; ЧГ=0"));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("TotalSum");
			ЗаписьXML.ЗаписатьТекст(Формат(СуммаСНДС, "ЧДЦ=2; ЧРД=.; ЧГ=0"));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("RateOfNds");
			ЗаписьXML.ЗаписатьТекст(Формат(СтавкаНДС, "ЧДЦ=0; ЧРД=.; ЧГ=0"));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ГТД=ПолучитьГрупповойПериодическийРеквизит(стр.Номенклатура.Родитель,"НомерГТД",Док.Дата);
			Если ГТД = Неопределено или ГТД.СтранаПроисхождения.Наименование="РОССИЯ" Тогда
				СтранаКод="";
				Страна="";
				ГТД="";
			Иначе
				СтранаКод=""+ГТД.СтранаПроисхождения.Код;
				Страна=""+ГТД.СтранаПроисхождения;
				ГТД=""+ГТД.Наименование;
			КонецЕсли;
			// страна код
			ЗаписьXML.ЗаписатьНачалоЭлемента("CountryCode");
			ЗаписьXML.ЗаписатьТекст(СокрЛП(СтранаКод));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			// страна наименование
			ЗаписьXML.ЗаписатьНачалоЭлемента("Country");
			ЗаписьXML.ЗаписатьТекст(СокрЛП(Страна));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			// ГТД
			ЗаписьXML.ЗаписатьНачалоЭлемента("GTD");
			ЗаписьXML.ЗаписатьТекст(СокрЛП(ГТД));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьКонецЭлемента(); //invoiceItemSet
		КонецЕсли;
	КонецЦикла;
	стрТЗ.ЕстьОшибки=Ошибка;
	ЗаписьXML.ЗаписатьКонецЭлемента(); //invoice
	ЗаписьXML.Закрыть();
	
	Попытка
		ФТП = новый FTPСоединение("ftp.trade.dixika.com",21,"dds00166","4YtPRlgRLXSX",,Истина);
		ФТП.УстановитьТекущийКаталог("/DDS/dds00166/");
	Исключение
		КрОшибки.Добавить("Неудачная попытка подключиться к ftp серверу. ");
		Ошибка=1;
		
	КонецПопытки;
	
	Для каждого стр из ТЗ цикл
		Если стр.ЕстьОшибки Тогда
			КрОшибки.Добавить(""+"По РНК № "+стр.РНК+" обнаружены ошибки. После их исправления произведите повторную выгрузку РНК");
			Ошибка=1;
		Иначе
			ФТП.Записать(стр.ИмяФ, стр.Номер + ".xml");   //  !!!!!!!!
			КрОшибки.Добавить("Файл "+ стр.Номер + ".xml выгружен на сервер Диксики");
			//Сообщить("Файл "+ стр.Номер + ".xml выгружен на сервер Диксики");
			
		КонецЕсли;
	КонецЦикла;
	
	
	
	//----------------------------------------
	//             отправить письмо
	//----------------------------------------
	Шапка="";
	СообщитьМенеджеруДиксика(ИмяФайлаОбмена);
	
	Если КрОшибки.Количество() Тогда
		
		СообщитьКритОшибкиДиксика();
		
	КонецЕсли;	
	
	
	
КонецПроцедуры

Процедура СообщитьМенеджеруДиксика(ПутьФайла) Экспорт
	
	Менеджер=ДокОбъект.контрагент.Менеджер;
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "87.236.190.180";
	//Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);	
	// Кухарь А.Ю.  08.09.2022 конец
	Профиль.ПортSMTP           = 25;
	
	//Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
	Профиль.АутентификацияPOP3=СпособPOP3Аутентификации.Обычная;
	Профиль.АутентификацияSMTP=СпособSMTPАутентификации.Login;
	
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	//Профиль.ПользовательSMTP="*%*%*%";
	//профиль.ПарольSMTP="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	Профиль.ПользовательSMTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.ПарольSMTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	//----------------------------------------------------------------
	Сообщение=новый интернетПочтовоеСообщение;
	Сообщение.Получатели.Добавить("ecode@collant.ru"); //+++
	Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	
	Сообщение.Получатели.Добавить("martinova@collant.ru");
	
	
	
	Сообщение.Отправитель="ecode@kbstil.ru";
	ПунктДоставки=ДокОбъект.ПунктДоставки;
	
	Если ПунктДоставки=Неопределено тогда
		ПунктДоставки="";
	Конецесли;	
	
	
	Сообщение.Тема="Уведомление об отгрузке заказа "+ДокОбъект.номерЗаказа+" -  "+ДокОбъект.контрагент+" - "+ПунктДоставки;
	Строка=Символ(13)+Символ(13)+"       Добрый день!"+Символ(13)+Символ(13)+Строка("Подтверждение заказа покупателя № "+ДокОбъект.НомерЗаказа+" . "+ДокОбъект.Ссылка);
	
	НомСтр=1;
	Строка=Строка+Символы.ПС+символы.ПС+"Фактический адрес, пунк доставки: "+ДокОбъект.ПунктДоставки;
	Строка=Строка+Символы.ПС;
	
	Строка=Строка+Символы.ПС+"________________________________________________________________";
	Строка=Строка+Символы.ПС+"ООО <<Единая Европа - Элит>>";
	
	Сообщение.Тексты.Добавить(Строка);
	//Сообщение.Вложения.Добавить(ПутьФайла);
	Попытка
		Сообщение.Вложения.Добавить(ПутьФайла);     //+++
	Исключение
		КрОшибки.Добавить("Не возможно добавить файл выгрузки "+ДокОбъект.ссылка+". Контрагент - "+ДокОбъект.контрагент+".  "+ОписаниеОшибки() );
	КонецПопытки;
	
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
	исключение
		КрОшибки.Добавить("Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки() );
	конецПопытки;
	Попытка
		Почта.Послать(Сообщение);
	исключение
		КрОшибки.Добавить("Не возможно отправить сообщение!   "+ОписаниеОшибки() );
	конецПопытки;
	Почта.Отключиться();
	
	Если крОшибки.Количество()=0 Тогда
		
		// Сообщить("Файл отправлен покупателю. ");
		
	КонецЕсли;   
	
	//----------------------------------------
	//           удаляем файл отправки
	//----------------------------------------
	
	//	УдалитьФайлы(ПутьФайла);     //+++
	
	// файлы не удаляем, т.к. они удаляться самим Е-кодом.
	
КонецПроцедуры

Процедура СообщитьКритОшибкиДиксика() Экспорт
	
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "87.236.190.180";
	//Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);	
	// Кухарь А.Ю.  08.09.2022 конец
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	//Профиль.ПользовательSMTP="*%*%*%";
	//профиль.ПарольSMTP="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	Профиль.ПользовательSMTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.ПарольSMTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	//------------------------------------------------
	// сообщение о критических ошибках
	//------------------------------------------------
	сообщениеКрит=новый интернетПочтовоеСообщение;
	//СообщениеКрит.Получатели.Добавить("ecode@collant.ru");    //+++
	СообщениеКрит.Получатели.Добавить("nechaeva@collant.ru");
	СообщениеКрит.Получатели.Добавить("martinova@collant.ru");
		
	сообщениеКрит.Отправитель="ecode@collant.ru";
	СообщениеКрит.Тема="Автообмен с Диксикой. Критические ошибки!";
	Строка="Добрый день!!!"+Символ(13);
	НомСтр=1;
	Если НЕ Ошибки=Неопределено и КрОшибки.Количество()>0 Тогда
		Для рр=0 по КрОшибки.Количество()-1 Цикл
			Строка=Строка+Символ(13)+НомСтр+". "+КрОшибки[рр];
			Строка=Строка+Символ(13);
			НомСтр=НомСтр+1;
		КонецЦикла;
	КонецЕсли;
	
	Строка=Строка+Символ(13)+"________________________________________________________________";
	//-----------------------------------------
	СообщениеКрит.Тексты.Добавить(Строка);
	
	Почта= Новый ИнтернетПочта;
	Почта.Подключиться(Профиль);
	почта.Послать(СообщениеКрит);
	Почта.Отключиться();
	
КонецПроцедуры


Процедура СообщитьКритОшибкиАдмину() Экспорт
	
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "87.236.190.180";
	//Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);	
	// Кухарь А.Ю.  08.09.2022 конец
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	//Профиль.ПользовательSMTP="*%*%*%";
	//профиль.ПарольSMTP="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	Профиль.ПользовательSMTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.ПарольSMTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	//------------------------------------------------
	// сообщение о критических ошибках
	//------------------------------------------------
	сообщениеКрит=новый интернетПочтовоеСообщение;
	СообщениеКрит.Получатели.Добавить("nechaeva@collant.ru");
	
		
	сообщениеКрит.Отправитель="ecode@collant.ru";
	СообщениеКрит.Тема="Уведомление об отгрузке заказа "+ДокОбъект.номерЗаказа+" -  "+ДокОбъект.контрагент+" - "+докОбъект.ссылка;
	//СообщениеКрит.Тема="Автообмен с Диксикой. Критические ошибки!";
	Строка="Добрый день!!!"+Символ(13);
	НомСтр=1;
	Если НЕ Ошибки=Неопределено и КрОшибки.Количество()>0 Тогда
		Для рр=0 по КрОшибки.Количество()-1 Цикл
			Строка=Строка+Символ(13)+НомСтр+". "+КрОшибки[рр];
			Строка=Строка+Символ(13);
			НомСтр=НомСтр+1;
		КонецЦикла;
	КонецЕсли;
	
	Строка=Строка+Символ(13)+"________________________________________________________________";
	//-----------------------------------------
	СообщениеКрит.Тексты.Добавить(Строка);
	
	Почта= Новый ИнтернетПочта;
	Почта.Подключиться(Профиль);
	почта.Послать(СообщениеКрит);
	Почта.Отключиться();
	
КонецПроцедуры
// нечаева 19,09,2014 ---


// *************************************************************************************************************************************
//- ----Окей "уведомление об отгрузке РНК"
//**************************************************************************************************************************************
// нечаева 18,11,2014 +++


Процедура ОтправитьОкей() Экспорт
	// Вставить содержимое обработчика.
	
	Ошибка=0;
		
	//----------------------------------------
	//             отправить письмо
	//----------------------------------------
	Шапка="";
	
	Если ДокОбъект.ДатаПриемки <>Дата(1,1,1) и СокрЛП(ДокОбъект.пунктДоставки.Емэйл)<>"" Тогда
		    СообщитьМенеджеруОкей();
	иначе
		КрОшибки.Добавить("Не возможно отправить письмо о доставке "+ДокОбъект.ссылка+". Контрагент - "+ДокОбъект.контрагент+".  " );
		КрОшибки.Добавить("Нет даты авизации  или не заполнен Е-майл " );
		
	конецЕсли;	
	
	Если КрОшибки.Количество() Тогда
		СообщитьКритОшибкиОкей();
	КонецЕсли;	
		
КонецПроцедуры

Процедура СообщитьМенеджеруОкей() Экспорт
	
	Менеджер=ДокОбъект.контрагент.Менеджер;
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "87.236.190.180";
	//Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);	
	// Кухарь А.Ю.  08.09.2022 конец
	Профиль.ПортSMTP           = 25;
	
	//Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
	Профиль.АутентификацияPOP3=СпособPOP3Аутентификации.Обычная;
	Профиль.АутентификацияSMTP=СпособSMTPАутентификации.Login;
	
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	//Профиль.ПользовательSMTP="*%*%*%";
	//профиль.ПарольSMTP="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	Профиль.ПользовательSMTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.ПарольSMTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	//----------------------------------------------------------------
	Сообщение=новый интернетПочтовоеСообщение;
	
	//Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	Сообщение.Получатели.Добавить("bespalova@collant.ru");
	Сообщение.Получатели.Добавить(СокрЛП(ДокОбъект.пунктДоставки.Емэйл));
	
	Сообщение.Отправитель="ecode@collant.ru";
	ПунктДоставки=ДокОбъект.ПунктДоставки;
	
	Если ПунктДоставки=Неопределено тогда
		ПунктДоставки="";
	Конецесли;	
	
	
	Сообщение.Тема="Уведомление об отгрузке заказа "+ДокОбъект.номерЗаказа+" -  "+ДокОбъект.контрагент+" - "+ПунктДоставки;
	Строка=Символ(13)+Символ(13)+"       Добрый день!"+Символ(13)+Символ(13)+Строка("Дата поставки заказа "+ДокОбъект.номерЗаказа+ " в магазин -  "+Формат(ДокОбъект.датаПриемки, "ДЛФ=ДД")+" . ");
	
	НомСтр=1;
	//Строка=Строка+Символы.ПС+символы.ПС+"Фактический адрес, пунк доставки: "+ДокОбъект.ПунктДоставки;
	Строка=Строка+Символы.ПС;
	
	Строка=Строка+Символы.ПС+"________________________________________________________________";
	Строка=Строка+Символы.ПС+"ООО <<Единая Европа - Элит>>";
	
	Сообщение.Тексты.Добавить(Строка);
	
	//Сообщение.Вложения.Добавить(ПутьФайла);
		
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
	исключение
		КрОшибки.Добавить("Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки() );
	конецПопытки;
	Попытка
		Почта.Послать(Сообщение);
	исключение
		КрОшибки.Добавить("Не возможно отправить сообщение!   "+ОписаниеОшибки() );
	конецПопытки;
	Почта.Отключиться();
	
	Если крОшибки.Количество()=0 Тогда
		
		// Сообщить("Файл отправлен покупателю. ");
		
	КонецЕсли;   
	
	//----------------------------------------
	//           удаляем файл отправки
	//----------------------------------------
	
	//	УдалитьФайлы(ПутьФайла);     //+++
	
	// файлы не удаляем, т.к. они удаляться самим Е-кодом.
	
КонецПроцедуры

Процедура СообщитьКритОшибкиОкей() Экспорт
	
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "87.236.190.180";
	//Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);	
	// Кухарь А.Ю.  08.09.2022 конец
	Профиль.ВремяОжидания      = 60; 
	Профиль.Пользователь="ecode@collant.ru";
	Профиль.Пароль="749fg28";
	Профиль.ПользовательSMTP="Ecode@collant.ru";
	профиль.ПарольSMTP="749fg28";
	
	//------------------------------------------------
	// сообщение о критических ошибках
	//------------------------------------------------
	сообщениеКрит=новый интернетПочтовоеСообщение;
	//СообщениеКрит.Получатели.Добавить("ecode@collant.ru");    //+++
	//СообщениеКрит.Получатели.Добавить("nechaeva@collant.ru");
	СообщениеКрит.Получатели.Добавить("bespalova@collant.ru");
		
	сообщениеКрит.Отправитель="ecode@collant.ru";
	СообщениеКрит.Тема="Автообмен с Окей. Критические ошибки!";
	Строка="Добрый день!!!"+Символ(13);
	НомСтр=1;
	Если НЕ Ошибки=Неопределено и КрОшибки.Количество()>0 Тогда
		Для рр=0 по КрОшибки.Количество()-1 Цикл
			Строка=Строка+Символ(13)+НомСтр+". "+КрОшибки[рр];
			Строка=Строка+Символ(13);
			НомСтр=НомСтр+1;
		КонецЦикла;
	КонецЕсли;
	
	Строка=Строка+Символ(13)+"________________________________________________________________";
	//-----------------------------------------
	СообщениеКрит.Тексты.Добавить(Строка);
	
	Почта= Новый ИнтернетПочта;
	Почта.Подключиться(Профиль);
	почта.Послать(СообщениеКрит);
	Почта.Отключиться();
	
КонецПроцедуры
// нечаева 19,09,2014 ---


//-----------------------------------------------------

Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	
	ОтказСтолетов=Истина;
	
	Если ДокОбъект.состояниеНакладной=перечисления.СостоянияНакладной.Отгружена Тогда 
		
		// проверка на клиента, выход если не ригла или О3  , чудо доктор
		// Кухарь А.Ю. 26.03.2021 начало
		//
		//Если (СокрЛП(ДокОбъект.контрагент.код)="SSP-3572") ИЛИ (СокрЛП(ДокОбъект.контрагент.код)="SSP-2874") 
		//	ИЛИ (СокрЛП(ДокОбъект.контрагент.код)="SSP-2507")   // чудо доктор
			Если (СокрЛП(КодКонтрагента)="SSP-3572") ИЛИ (СокрЛП(КодКонтрагента)="SSP-2874") 
			ИЛИ (СокрЛП(КодКонтрагента)="SSP-2507")   // чудо доктор		 
		// Кухарь А.Ю. 26.03.2021 конец
		
			Тогда
			ОтказСтолетов=Ложь;
			Отправить();
		КонецЕсли;	
		
		// Столетов
		// Кухарь А.Ю. 26.03.2021 начало
		//  		Если (СокрЛП(ДокОбъект.контрагент.код)="SSP-4660") Тогда
		Если (СокрЛП(КодКонтрагента)="SSP-4660") Тогда
		// Кухарь А.Ю. 26.03.2021 конец
		
			ОтказСтолетов=Ложь;
			ОтправитьСтолетов();
		КонецЕсли;	
		
		// Каприз-М
		// Кухарь А.Ю. 26.03.2021 начало
		// 		Если (СокрЛП(ДокОбъект.контрагент.код)="SSP-4268") Тогда
		Если (СокрЛП(КодКонтрагента)="SSP-4268") Тогда		 
		// Кухарь А.Ю. 26.03.2021 конец
		

			ОтказСтолетов=Ложь;
			ОтправитьКаприз();
		КонецЕсли;
		
		
		// Гиперглобус
		// Кухарь А.Ю. 26.03.2021 начало
		// 		Если (СокрЛП(ДокОбъект.контрагент.код)="SSP-3180") Тогда
		Если (СокрЛП(КодКонтрагента)="SSP-3180") Тогда	 
		// Кухарь А.Ю. 26.03.2021 конец
			ОтказСтолетов=Ложь;
			ОтправитьГлобус();
		КонецЕсли;
		
		//диксика париж    //23.03.15+++ код поменяла и проверки отбивку поправила нечаева   продснаб
		// Кухарь А.Ю. 26.03.2021 начало
		//		Если (СокрЛП(ДокОбъект.контрагент.код)="SSR-4037") или (СокрЛП(ДокОбъект.контрагент.код)="SSR-5763") и ДокОбъект.СуммаДокумента>0   Тогда
		Если (СокрЛП(КодКонтрагента)="SSR-4037") или (СокрЛП(КодКонтрагента)="SSR-5763") и ДокОбъект.СуммаДокумента>0   Тогда	 
		// Кухарь А.Ю. 26.03.2021 конец
		

			ОтказСтолетов=Ложь;
			ОтправитьДиксика();
		//	СообщитьКритОшибкиДиксика(); 
			СообщитьКритОшибкиАдмину();
                       //23,03,15--
		КонецЕсли;

		
		
	КонецЕсли;
	
	
	
	// // нечаева 19,09,2014 +++
	//// Диксика (париж) 
	//Если ДокОбъект.состояниеНакладной=перечисления.СостоянияНакладной.отгружена и не ДокОбъект.ПереданПокупателюВЭлВиде  Тогда
	//	Если (СокрЛП(ДокОбъект.контрагент.код)="SSR-4037") Тогда
	//		СообщитьКритОшибкиАдмину();
	//		ОтказСтолетов=Ложь;
	//		ОтправитьДиксика();
	//	КонецЕсли;
	//КонецЕсли;	
	
	
	//
	// // нечаева 18.11.2014 +++
	//// о-кей
	//Если ДокОбъект.состояниеНакладной<>перечисления.СостоянияНакладной.ВРаботе и не ДокОбъект.ПереданПокупателюВЭлВиде	Тогда
	//	
	//	Если (СокрЛП(ДокОбъект.контрагент.код)="SSP-5862") Тогда
	//		ОтказСтолетов=Ложь;
	//		ОтправитьОкей();
	//	КонецЕсли;
	//	
	//КонецЕсли;	
	//// нечаева 18.11.2014 ---
	
	
	
	
	Отказ=ОтказСтолетов;
	//Возврат ОтказСтолетов;
	// нечаева 19,09,2014 ---
	
КонецПроцедуры


//--------------------------
КодМетро	="SSP-8643";
КритичОшибки= Новый массив;
КрОшибки= Новый массив;
КритичОшибкиСтолетов = Новый массив;
Ошибки=Новый Массив;
Файлы=Новый Массив;

ОтказСтолетов=Ложь;

ПризнакЗаписиДокумента=Истина;

ТЗПечать=Новый ТаблицаЗначений;
ТЗПечать.Колонки.Добавить("НомерСтроки",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("Найдена",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("Штрихкод",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("Название",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("КодПокуп",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("КодПрод",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("Колво",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("КолвоОтредактированное",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
ТЗПечать.Колонки.Добавить("Единица",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("КолУпак");
ТЗПечать.Колонки.Добавить("ВУпак");
ТЗПечать.Колонки.Добавить("Тип",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("ВозврУпак",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("ПромоЦена",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("ЦенаБезНДС",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("СуммаБезНДС",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("Склад",Новый ОписаниеТипов("СправочникСсылка.Склады"));
ТЗПечать.Колонки.Добавить("ПризнакГруппыНом",Новый ОписаниеТипов("Число"));


ТЗШапка=Новый ТаблицаЗначений;
ТЗШапка.Колонки.Добавить("НомЗаказа");
ТЗШапка.Колонки.Добавить("ДатаЗаказа");
ТЗШапка.Колонки.Добавить("ДатаДоставки");
ТЗШапка.Колонки.Добавить("ТипЗаказа");
ТЗШапка.Колонки.Добавить("КодВалюты");
ТЗШапка.Колонки.Добавить("ИЛНПокупателя");
ТЗШапка.Колонки.Добавить("НазваниеПокупателя");
ТЗШапка.Колонки.Добавить("ИЛНПлательщика");
ТЗШапка.Колонки.Добавить("НазваниеПлательщика");
ТЗШапка.Колонки.Добавить("ИЛНМестаДоставки");
ТЗШапка.Колонки.Добавить("НазваниеМестаДоставки");
ТЗШапка.Колонки.Добавить("АдресМестаДоставки");
ТЗШапка.Колонки.Добавить("ОбщСумма");
ТЗШапка.Колонки.Добавить("ОбщКолУпак");
ТЗШапка.Колонки.Добавить("ОбщКол");
ТЗШапка.Колонки.Добавить("КолСтрок");
ТЗШапка.Колонки.Добавить("Контрагент");
ТЗШапка.Колонки.Добавить("ТипILNКонтрагента");
ТЗШапка.Колонки.Добавить("ПунктДоставки");
ТЗШапка.Колонки.Добавить("ДатаОтгрузки");
ТЗШапка.Колонки.Добавить("Менеджер");
ТЗШапка.Колонки.Добавить("Организация");

