Функция СоздатьЗаказыКЗПС(ЗПС_Ссылка) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);	
	
	ТекСтатус = ПолучитьРеквизитШапки(ЗПС_Ссылка, "СтатусМаркировки", "Документ");
	
	Если ТекСтатус<>Перечисления.СтатусыДоков_Маркировка.ВРаботе Тогда
		ТекстОшибки = СтрШаблон("Недопустимый статус маркировки ЗПС: '%1', формирование КМ возможно только для статуса: 'В работе'.", ТекСтатус);
		Результат.Ошибки.Добавить(ТекстОшибки);
		Возврат Результат;	
	КонецЕсли; 
	//++Данилова Е.В. 27.03.2025 MARK-1288
	//Запрос = Новый Запрос;
	//Запрос.Текст = "
	//|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Части ИЗ &Части КАК Части
	//|;	
	//|ВЫБРАТЬ
	//|	Номенклатура.ГТИН КАК ГТИН,
	//|	*
	//|ИЗ
	//|	ВТ_Части
	//|ИТОГИ ПО
	//|	Часть
	//|";
	//
	
	//тТовары = МаркировкаВС.ПолучитьМаркируемыеТоварыДокумента(ЗПС_Ссылка);
	 
	//ЗапросТоваров = Новый Запрос;
	//ЗапросТоваров.Текст = "ВЫБРАТЬ
	//|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	//|	СУММА(ЗаказПоставщикуТовары.Количество) КАК Количество
	//|ИЗ
	//|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправочник
	//|		ПО ЗаказПоставщикуТовары.Номенклатура = НоменклатураСправочник.Ссылка
	//|			И (НоменклатураСправочник.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект))
	//|ГДЕ
	//|	ЗаказПоставщикуТовары.Ссылка = &ДокСсылка
	//|	И НЕ(ЗаказПоставщикуТовары.Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.ПустаяСсылка)
	//|				ИЛИ ЗаказПоставщикуТовары.Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.НеПодлежитМаркировке))
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЗаказПоставщикуТовары.Номенклатура
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ЗаказПоставщикуТовары.Номенклатура.Наименование";
	//
	//ЗапросТоваров.УстановитьПараметр("ДокСсылка", ЗПС_Ссылка);	
	//
	//тТоварыГН  = ЗапросТоваров.Выполнить().Выгрузить();
	
	//ЗапросТоваров = Новый Запрос;
	//ЗапросТоваров.Текст = "ВЫБРАТЬ
	//|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	//|	СУММА(ЗаказПоставщикуТовары.Количество) КАК Количество
	//|ИЗ
	//|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправочник
	//|		ПО ЗаказПоставщикуТовары.Номенклатура = НоменклатураСправочник.Ссылка
	//|			И (НоменклатураСправочник.ВидКомплекта <> ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект))
	//|ГДЕ
	//|	ЗаказПоставщикуТовары.Ссылка = &ДокСсылка
	//|	И НЕ(ЗаказПоставщикуТовары.Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.ПустаяСсылка)
	//|				ИЛИ ЗаказПоставщикуТовары.Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.НеПодлежитМаркировке))
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЗаказПоставщикуТовары.Номенклатура
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ЗаказПоставщикуТовары.Номенклатура.Наименование";
	//
	//ЗапросТоваров.УстановитьПараметр("ДокСсылка", ЗПС_Ссылка);	
	//
	//тТовары  = ЗапросТоваров.Выполнить().Выгрузить();
	//
	
	ЗапросТоваров = Новый Запрос;
	ЗапросТоваров.Текст = "ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ЗаказПоставщикуТовары.Количество) КАК Количество,
	|	НоменклатураСправочник.Родитель.ВидКомплекта КАК ВидКомплекта
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправочник
	|		ПО ЗаказПоставщикуТовары.Номенклатура = НоменклатураСправочник.Ссылка
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка = &ДокСсылка
	|	И НЕ(ЗаказПоставщикуТовары.Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.ПустаяСсылка)
	|				ИЛИ ЗаказПоставщикуТовары.Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.НеПодлежитМаркировке))
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПоставщикуТовары.Номенклатура,
	|	НоменклатураСправочник.Родитель.ВидКомплекта
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказПоставщикуТовары.Номенклатура.Наименование
	|ИТОГИ ПО
	|	ВидКомплекта";
	
	ЗапросТоваров.УстановитьПараметр("ДокСсылка", ЗПС_Ссылка);
	
	ИтогиПоВидамКомплектов = ЗапросТоваров.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	
	ОписаниеТиповЧисло = Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,0));
	
	МассивТаблицТоваров = Новый Массив; 
	Пока ИтогиПоВидамКомплектов.Следующий() Цикл
		
		ТЧТовары = Новый ТаблицаЗначений; 
		ТЧТовары.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура")); 
		ТЧТовары.Колонки.Добавить("Количество",ОписаниеТиповЧисло);
		
		Выборка  = ИтогиПоВидамКомплектов.Выбрать(); 
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = ТЧТовары.Добавить(); 
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка); 
			
		КонецЦикла;
		
		МассивТаблицТоваров.Добавить(ТЧТовары); 
		
	КонецЦикла;
	 
	МассивЧастей 	= Новый Массив; 
	Сч 				= 1;
	Часть 			= 0;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = ""; 
	
	Если МассивТаблицТоваров.Количество() = 0 Тогда
	
		Результат.Ошибки.Добавить("Не найдены товары для формирования Заказов КМ");
		
		Возврат Результат; 
	
	КонецЕсли;
	
	Для каждого ТЧМассива Из  МассивТаблицТоваров Цикл
		
		Части = МаркировкаВС.РазбитьТЧнаЧасти(ТЧМассива, 5, 5000,Часть);
		
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ
		|	* 
		|ПОМЕСТИТЬ ВТ_Части"+Строка(Сч)+"
		|ИЗ
		|	&Части"+Строка(Сч)+" КАК Части
		|;"; 
		
		Запрос.УстановитьПараметр("Части" + Строка(Сч),Части); 
		Сч = Сч + 1; 
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + 
	
	" ВЫБРАТЬ
	|	* 
	|ПОМЕСТИТЬ ВТ_Части  
	|ИЗ
	|	ВТ_Части1  "; 
	
	
	Для Кол = 2 По Сч-1 Цикл
		
		ТекстЗапроса = ТекстЗапроса + " 
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	*
		|ИЗ
		|	ВТ_Части"+Строка(Кол)+" 
		| ";  
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + " 	
	|; 
	| ВЫБРАТЬ
	|	Номенклатура.ГТИН КАК ГТИН,
	|	*
	|ИЗ
	|	ВТ_Части
	|ИТОГИ ПО
	|	Часть
	|"; 
	Запрос.Текст = ТекстЗапроса; 

	//Запрос.УстановитьПараметр("Части", МаркировкаВС.РазбитьТЧнаЧасти(тТовары, 10, 5000));
	//--Данилова Е.В. 27.03.2025

	рОчистки = ОчиститьПодчиненныеЗаказы(ЗПС_Ссылка);
	Если рОчистки.Успешно Тогда
		СуществующиеЗаказы = рОчистки.СуществующиеЗаказы;		
		
		рЗапроса 		= Запрос.Выполнить();	
		Выборка_Часть 	= рЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Часть");	
		
		Если рЗапроса.Пустой() Тогда
			Результат.Ошибки.Добавить("Не найдено данных для обработки !");		
		КонецЕсли;
		
		Пока Выборка_Часть.Следующий() Цикл
			ДокСсылка = СуществующиеЗаказы[Выборка_Часть.Часть];					
			Если ДокСсылка = Неопределено Тогда
				ДокОбъект = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.СоздатьДокумент();
				
				ДокОбъект.Дата	= ТекущаяДата();
				ДокОбъект.Заполнить(ЗПС_Ссылка);
			Иначе
				ДокОбъект = ДокСсылка.ПолучитьОбъект();
			КонецЕсли; 
			
			ДокОбъект.Товары.Очистить();
			
			Выборка = Выборка_Часть.Выбрать();
			Пока Выборка.Следующий() Цикл
				СтрокаТЧ = ДокОбъект.Товары.Добавить();			
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
			КонецЦикла; 
			
			ДокОбъект.ПометкаУдаления = Ложь;
			ДокОбъект.Записать();
			
			Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;
		КонецЦикла;  			
	Иначе
		Результат.Успешно = Ложь;
		
		Результат.Ошибки.Добавить("Не удалось очистить подчиненные заказы на КМ !");
		МаркировкаКС.ДобавитьОшибки(Результат, рОчистки);
	КонецЕсли;       
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0 И Результат.ОбработаноОбъектов>0);	
	
	Возврат Результат;
	
КонецФункции //СоздатьЗаказыКЗПС(ЗПС_Ссылка)

Функция СоздатьЗаказыДляКП(КП_Ссылка) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);	
	
	рПроверки = ПроверитьСостояниеКП(КП_Ссылка);	
	
	Если НЕ рПроверки.Успешно Тогда		
		Возврат рПроверки;		
	КонецЕсли;	

	рОчистки = ОчиститьПодчиненныеЗаказы(КП_Ссылка);
	Если рОчистки.Успешно Тогда
		СуществующиеЗаказы = рОчистки.СуществующиеЗаказы;		
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Номенклатура.Родитель.ВидКомплекта КАК ВидКомплекта,
		|	Номенклатура,
		|	СУММА(Количество) КАК Количество	
		|ИЗ
		|	Документ.КонтрактСПроизводителем.Товары	
		|ГДЕ
		|	Ссылка = &ДокСсылка
		|	И НЕ (
		|		Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.ПустаяСсылка)
		|		ИЛИ Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.НеПодлежитМаркировке)
		|	)	
		|СГРУППИРОВАТЬ ПО	
		|	Номенклатура		
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура.Наименование
		|ИТОГИ ПО
		|	ВидКомплекта
		|";
		
		Запрос.УстановитьПараметр("ДокСсылка", КП_Ссылка);
		
		ОбработаноЧастей = 0;	
		
		рЗапроса = Запрос.Выполнить();
		
		Если рЗапроса.Пустой() Тогда
			Результат.Ошибки.Добавить("Не найдено данных для обработки !");
		Иначе
			Выборка_ВидКомплекта = рЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ВидКомплекта"); 
			Пока Выборка_ВидКомплекта.Следующий() Цикл
				тТовары = Новый ТаблицаЗначений;
				
				тТовары.Колонки.Добавить("Номенклатура",	Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
				тТовары.Колонки.Добавить("Количество",		ПолучитьОписаниеТиповЧисла(10,0));
				
				Выборка = Выборка_ВидКомплекта.Выбрать();
				Пока Выборка.Следующий() Цикл
					СтрокаТЧ = тТовары.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
				КонецЦикла;			                            
				
				ОбработаноЧастей = ОбработаноЧастей + СоздатьЗаказыПоТоварам(КП_Ссылка, тТовары, СуществующиеЗаказы, ОбработаноЧастей);
			КонецЦикла;			
		КонецЕсли;	
	Иначе
		Результат.Успешно = Ложь;
		
		Результат.Ошибки.Добавить("Не удалось очистить подчиненные заказы на КМ !");
		МаркировкаКС.ДобавитьОшибки(Результат, рОчистки);
	КонецЕсли;       
	
	Результат.ОбработаноОбъектов = ОбработаноЧастей;
	Результат.Успешно = (Результат.Ошибки.Количество() = 0 И Результат.ОбработаноОбъектов > 0);	
	
	Возврат Результат;	
КонецФункции //СоздатьЗаказыКЗПС(ЗПС_Ссылка)

Функция ПроверитьСостояниеКП(КП_Ссылка)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	рШапки = ПолучитьРеквизитыШапки(КП_Ссылка, "Организация,Организация.ИНН,СостояниеЗаказа", "Документ");
	ТекСтатус = рШапки.СостояниеЗаказа;
	
	Если СокрЛП(рШапки.Организация_ИНН) = "7717115270" Тогда //По ЕЕЭ запрещено заказывать коды по КП
		ТекстОшибки = СтрШаблон("Запрещено создание заказов КМ по организации: '%1' !", рШапки.Организация);
		Результат.Ошибки.Добавить(ТекстОшибки);  
		//Валетов + 21,04,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3669
		Результат.Успешно = Ложь;
		Возврат Результат;   
		//Валетов -
	Иначе	
		ДопустимыеСтатусы = Новый Соответствие;
		ДопустимыеСтатусы[Перечисления.СостояниеЗаказаПоставщику.ПодтвержденныйЗаказ] 	= Истина;
		ДопустимыеСтатусы[Перечисления.СостояниеЗаказаПоставщику.ВПроизводстве] 		= Истина;	
		
		Если ДопустимыеСтатусы[ТекСтатус] = Неопределено Тогда
			СтрокиС = Новый Массив;
			Для каждого КиЗ Из ДопустимыеСтатусы Цикл
				СтрокиС.Добавить(КиЗ.Ключ);		
			КонецЦикла;
			
			ТекстОшибки = СтрШаблон("Недопустимый статус маркировки КП: '%1', формирование КМ возможно только для статусов: '%2'.", ТекСтатус, СтрСоединить(СтрокиС,"','"));		
			Результат.Ошибки.Добавить(ТекстОшибки);		
		КонецЕсли;	                               
		
	КонецЕсли;

	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;
КонецФункции //ПроверитьСостояниеКП(КП_Ссылка)


Функция СоздатьЗаказыПоТоварам(ДокОснование, тТовары, СуществующиеЗаказы, НачальнаяЧасть = 0)	
	Запрос = Новый Запрос;	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	* 
	|ПОМЕСТИТЬ ВТ_Части
	|ИЗ
	|	&Части КАК Части	
	|; 
	| ВЫБРАТЬ
	|	Номенклатура.ГТИН КАК ГТИН,
	|	*
	|ИЗ
	|	ВТ_Части
	|ИТОГИ ПО
	|	Часть
	|";
	Запрос.УстановитьПараметр("Части", МаркировкаВС.РазбитьТЧнаЧасти(тТовары, 10, 5000));
	
	рЗапроса 		= Запрос.Выполнить();	
	Выборка_Часть 	= рЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Часть");		
		
	ОбработаноЧастей = Выборка_Часть.Количество();
	
	Пока Выборка_Часть.Следующий() Цикл
		ДокСсылка = СуществующиеЗаказы[Выборка_Часть.Часть + НачальнаяЧасть];					
		Если ДокСсылка = Неопределено Тогда
			ДокОбъект = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.СоздатьДокумент();
			
			ДокОбъект.Дата	= ТекущаяДата();
			ДокОбъект.Заполнить(ДокОснование);
		Иначе
			ДокОбъект = ДокСсылка.ПолучитьОбъект();
		КонецЕсли; 
		
		ДокОбъект.Товары.Очистить();
		
		Выборка = Выборка_Часть.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаТЧ = ДокОбъект.Товары.Добавить();			
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
		КонецЦикла; 
		
		ДокОбъект.ПометкаУдаления = Ложь;
		ДокОбъект.Записать();		
	КонецЦикла;
	
	Возврат ОбработаноЧастей;
КонецФункции //СоздатьЗаказыПоТоварам(ДокОснование, тТовары, СуществующиеЗаказы, НачальнаяЧасть = 0)

Функция СоздатьЗаказы_Пополнение(ДанныеРасчета, Организация, ПодразделениеНанесения = Неопределено, ЧастьЧисло= Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);	
	//Валетов+ Добавил для правильного разбития автозаказов по готовым наборам
	//Разбитие заказов на части для готовых наборов должно быть 5
	ЕСли ЧастьЧисло = Неопределено Тогда 
		ЧастьЧисло = 10;
	КонецЕсли;	
	//Валетов-
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Результат.Ошибки.Добавить("Не указана организация !");
		Возврат Результат;	
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Части ИЗ &Части КАК Части
	|;	
	|ВЫБРАТЬ
	|	Номенклатура.ГТИН КАК ГТИН,
	|	*
	|ИЗ
	|	ВТ_Части
	|ИТОГИ ПО
	|	Часть
	|";
	
	//Валетов+ Добавил для правильного разбития автозаказов по готовым наборам
	//было
	//Запрос.УстановитьПараметр("Части", МаркировкаВС.РазбитьТЧнаЧасти(ДанныеРасчета, 10, 5000));
	//СТало
	Запрос.УстановитьПараметр("Части", МаркировкаВС.РазбитьТЧнаЧасти(ДанныеРасчета, ЧастьЧисло, 5000));
	//Валетов-
		
	рЗапроса 		= Запрос.Выполнить();	
	Выборка_Часть 	= рЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Часть");	
		
	Если рЗапроса.Пустой() Тогда
		Результат.Ошибки.Добавить("Не найдено данных для обработки !");		
	КонецЕсли;
		
	Пока Выборка_Часть.Следующий() Цикл
		
		ДокОбъект = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.СоздатьДокумент();
			
		ДокОбъект.Дата			= ТекущаяДата();
		ДокОбъект.Заполнить(Организация);		
		ДокОбъект.ПодразделениеНанесения = ПодразделениеНанесения;
		
		ДокОбъект.Комментарий	= "Пополнение запаса КМ.";
		
		ДокОбъект.Товары.Очистить();
		
		Выборка = Выборка_Часть.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаТЧ = ДокОбъект.Товары.Добавить();			
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
		КонецЦикла; 
		
		ДокОбъект.ПометкаУдаления = Ложь;
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;
		Результат.Данные.Добавить(ДокОбъект.Ссылка);
	КонецЦикла;
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0 И Результат.ОбработаноОбъектов>0);	
	
	Возврат Результат;
	
КонецФункции //СоздатьЗаказы_Пополнение(ДанныеРасчета, Организация) Экспорт

Функция ОчиститьПодчиненныеЗаказы(ЗПС_Ссылка)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка,
	|	Статус
	|ИЗ
	|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
	|ГДЕ
	|	ДокументОснование = &ЗПС_Ссылка
	|";
	
	Запрос.УстановитьПараметр("ЗПС_Ссылка", ЗПС_Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ (Выборка.Статус = Перечисления.СтатусыДокументовМаркировки.ВРаботе ИЛИ 
			Выборка.Статус = Перечисления.СтатусыДокументовМаркировки.КОбработке) Тогда
			
			ТекстОшибки = СтрШаблон("Недопустимый статус заказа на КМ: '%1', тек. статус: '%2', допустимые статусы: 'В работе' или 'К обработке'.", Выборка.Ссылка, Выборка.Статус);
			Результат.Ошибки.Добавить(ТекстОшибки);
		КонецЕсли; 	
	КонецЦикла;
	
	СуществующиеЗаказы = Новый Соответствие;
	
	Сч = 1;
	Если Результат.Ошибки.Количество() = 0 Тогда
		Выборка.Сбросить();
		
		НачатьТранзакцию();
		
		Пока Выборка.Следующий() Цикл
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			ДокОбъект.Статус = Перечисления.СтатусыДокументовМаркировки.ВРаботе;
			ДокОбъект.Товары.Очистить();
			ДокОбъект.Проведен			= Ложь;
			ДокОбъект.ПометкаУдаления 	= Истина;
		
			ДокОбъект.Записать();		
			
			СуществующиеЗаказы[Сч] = ДокОбъект.Ссылка;
			Сч	= Сч+1;
		КонецЦикла;		
		
		ЗафиксироватьТранзакцию();	
	Иначе
		Результат.Успешно = Ложь;
	КонецЕсли; 
	
	Результат.Вставить("СуществующиеЗаказы", СуществующиеЗаказы);

	Возврат Результат;
КонецФункции // ()
 
Функция ПроверитьДокументПередОтправкойВЧЗ(ДокСсылка) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Реквизиты = ПолучитьРеквизитыШапки(ДокСсылка, "Проведен,Статус,СпособВводаВОборот,ДокументОснование");
	Если Реквизиты.Проведен Тогда
		Если Реквизиты.Статус = Перечисления.СтатусыДокументовМаркировки.ВРаботе
			ИЛИ Реквизиты.Статус = Перечисления.СтатусыДокументовМаркировки.КОбработке Тогда			
			
			Если Реквизиты.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Импорт Тогда
				Если ЗначениеЗаполнено(Реквизиты.ДокументОснование) Тогда
					Результат.Успешно = Истина;
				Иначе
					ТекстОшибки = СтрШаблон("Не указан ЗПС док-та: %1.", ДокСсылка);					
					Результат.Ошибки.Добавить(ТекстОшибки);
				КонецЕсли; 			
			Иначе
				Результат.Успешно = Истина;			
			КонецЕсли; 			
		Иначе			
			ТекстОшибки = СтрШаблон("Не допустимый статус док-та: %1, статус: '%2', должен быть: 'В работе' или 'К обработке'.", ДокСсылка, Реквизиты.Статус);
			Результат.Ошибки.Добавить(ТекстОшибки);
		КонецЕсли; 	
	Иначе
		Результат.Ошибки.Добавить("Документ не проведен.");
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПроверитьДокументПередОтправкойВЧЗ()
 
Функция ПроверитьДокументПередПолучениемИзЧЗ(ДокСсылка) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Реквизиты = ПолучитьРеквизитыШапки(ДокСсылка, "Проведен,Статус");
	Если Реквизиты.Проведен Тогда
		Если Реквизиты.Статус = Перечисления.СтатусыДокументовМаркировки.Обрабатывается Тогда
			Результат.Успешно = Истина;
		Иначе			
			ТекстОшибки = СтрШаблон("Не допустимый статус док-та: %1, статус: '%2', должен быть: 'Обрабатывается'.", ДокСсылка, Реквизиты.Статус);
			Результат.Ошибки.Добавить(ТекстОшибки);
		КонецЕсли; 	
	Иначе
		Результат.Ошибки.Добавить("Документ не проведен.");
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПроверитьДокументПередПолучениемИзЧЗ(ДокСсылка) Экспорт

Функция ПроверитьДокументПередЗаписьюКМ(ДокСсылка) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Реквизиты = ПолучитьРеквизитыШапки(ДокСсылка, "Проведен,Статус");
	Если Реквизиты.Проведен Тогда
		Если Реквизиты.Статус = Перечисления.СтатусыДокументовМаркировки.ОбработанЧЗ Тогда
			Результат.Успешно = Истина;
		Иначе			
			ТекстОшибки = СтрШаблон("Не допустимый статус док-та: %1, статус: '%2', должен быть: 'Обработан ЧЗ'.", ДокСсылка, Реквизиты.Статус);
			Результат.Ошибки.Добавить(ТекстОшибки);
		КонецЕсли; 	
	Иначе
		Результат.Ошибки.Добавить("Документ не проведен.");
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПроверитьДокументПередЗаписьюКМ(ДокСсылка) Экспорт

Функция ПроверитьДокументПередВводомВОборот(ДокСсылка) Экспорт	
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Реквизиты = ПолучитьРеквизитыШапки(ДокСсылка, "Проведен,Статус,СтатусВводаВОборот");
	Если Реквизиты.СтатусВводаВОборот = Перечисления.СтатусыДокументовМаркировки.ПустаяСсылка()
		ИЛИ Реквизиты.СтатусВводаВОборот = Перечисления.СтатусыДокументовМаркировки.ВРаботе Тогда
		
		Если Реквизиты.Проведен Тогда
			Если Реквизиты.Статус = Перечисления.СтатусыДокументовМаркировки.Обработан Тогда
				Результат.Успешно = Истина;
			Иначе			
				ТекстОшибки = СтрШаблон("Не допустимый статус док-та: %1, статус: '%2', должен быть: 'Обработан'.", ДокСсылка, Реквизиты.Статус);
				Результат.Ошибки.Добавить(ТекстОшибки);
			КонецЕсли; 	
		Иначе
			Результат.Ошибки.Добавить("Документ не проведен.");
		КонецЕсли;		
	Иначе
		ТекстОшибки = СтрШаблон("К документу : %1, уже создан ввод в оборот в статусе: '%2'.", ДокСсылка, Реквизиты.СтатусВводаВОборот);
		Результат.Ошибки.Добавить(ТекстОшибки);		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПроверитьДокументПередВводомВОборот(ДокСсылка) Экспорт	 

Функция ПроверитьДокументПередЗакрытием(ДокСсылка) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Реквизиты = ПолучитьРеквизитыШапки(ДокСсылка, "Проведен,Статус,Закрыт");
	Если Реквизиты.Закрыт Тогда			
		ТекстОшибки = СтрШаблон("Заказ на эмиссию %1 уже закрыт.", ДокСсылка);
		Результат.Ошибки.Добавить(ТекстОшибки);
	Иначе		
		Если Реквизиты.Проведен Тогда
			Если Реквизиты.Статус = Перечисления.СтатусыДокументовМаркировки.Обработан Тогда		
				Результат.Успешно = Истина;
			Иначе			
				ТекстОшибки = СтрШаблон("Не допустимый статус док-та: %1, статус: '%2', должен быть: 'Обработан'.", ДокСсылка, Реквизиты.Статус);
				Результат.Ошибки.Добавить(ТекстОшибки);
			КонецЕсли; 	
		Иначе
			Результат.Ошибки.Добавить("Документ не проведен.");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ОбновитьКоличествоПолученныхКодов(ДокСсылка) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Если НЕ (ЗначениеЗаполнено(ДокСсылка) И ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ")) Тогда 
		Результат.Ошибки.Добавить("Не указан обрабатываемый документ !");
		Возврат Результат;	
	КонецЕсли;
	//++Данилова Е.В. 03.04.2025 ASU-2175 
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	СУММА(Сводный.КолЗаказано) КАК КолЗаказано,
	//               |	СУММА(Сводный.КолЗаписано) КАК КолЗаписано
	//               |ИЗ
	//               |	(ВЫБРАТЬ
	//               |		ЗаказНаЭмиссиюКодовМаркировкиСУЗ.КоличествоДокумента КАК КолЗаказано,
	//               |		0 КАК КолЗаписано
	//               |	ИЗ
	//               |		Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
	//               |	ГДЕ
	//               |		ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка = &ДокСсылка
	//               |	
	//               |	ОБЪЕДИНИТЬ ВСЕ
	//               |	
	//               |	ВЫБРАТЬ
	//               |		СправНоменклатураКомплектующие.Количество * ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Количество,
	//               |		0
	//               |	ИЗ
	//               |		Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Товары КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары
	//               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправНоменклатура
	//               |			ПО (СправНоменклатура.Ссылка = ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Номенклатура)
	//               |				И (СправНоменклатура.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект))
	//               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК СправНоменклатураКомплектующие
	//               |			ПО (СправНоменклатура.Ссылка = СправНоменклатураКомплектующие.Ссылка)
	//               |	ГДЕ
	//               |		ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Ссылка = &ДокСсылка
	//               |	
	//               |	ОБЪЕДИНИТЬ ВСЕ
	//               |	
	//               |	ВЫБРАТЬ
	//               |		0,
	//               |		СУММА(1)
	//               |	ИЗ
	//               |		Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	//               |	ГДЕ
	//               |		ШтрихкодыУпаковокТоваров.ЗаказКМ = &ДокСсылка) КАК Сводный";
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СУММА(Сводный.КолЗаказано) КАК КолЗаказано,
	|	СУММА(Сводный.КолЗаписано) КАК КолЗаписано
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказНаЭмиссиюКодовМаркировкиСУЗ.КоличествоДокумента КАК КолЗаказано,
	|		0 КАК КолЗаписано
	|	ИЗ
	|		Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
	|	ГДЕ
	|		ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка = &ДокСсылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		0,
	|		СУММА(1)
	|	ИЗ
	|		Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|	ГДЕ
	|		ШтрихкодыУпаковокТоваров.ЗаказКМ = &ДокСсылка) КАК Сводный";

	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПолученоКодов = Выборка.КолЗаписано;
		Если Выборка.КолЗаказано = ПолученоКодов Тогда
			рШапки = ПолучитьРеквизитыШапки(ДокСсылка, "Статус,ПолученоКодов,Проведен");
			Если рШапки.Статус <> Перечисления.СтатусыДокументовМаркировки.Обработан 
				ИЛИ рШапки.ПолученоКодов <> Выборка.КолЗаписано Тогда
				
				РежимЗаписи = ?(рШапки.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись);
				Реквизиты 	= Новый Структура("Статус,ПолученоКодов,ТекстОшибки", Перечисления.СтатусыДокументовМаркировки.Обработан, ПолученоКодов, "");
				
				УстановитьРеквизитыОбъекта(ДокСсылка, Реквизиты, РежимЗаписи);
				
				#ЕСЛИ Клиент ТОГДА
					ОповеститьОбИзменении(ДокСсылка);
				#КОНЕЦЕСЛИ
				
				//++Данилова Е.В. 30.01.2025
				ОбновлятьПолученоКомплектГН = ДокСсылка.ВидКомплекта = Перечисления.ВидыКомплектов.ГотовыйКомплект
				ИЛИ (ЗначениеЗаполнено(ДокСсылка.ДокументОснование)
				И ТипЗнч(ДокСсылка.ДокументОснование) = Тип("ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ") 
				И ДокСсылка.ДокументОснование.ВидКомплекта = Перечисления.ВидыКомплектов.ГотовыйКомплект); 
				//++Данилова Е.В. 03.06.2025 MARK-2355 
				ОбновлятьПолученоКомплектСпайка = КомплектСпайка_Импорт(ДокСсылка)
				ИЛИ (ЗначениеЗаполнено(ДокСсылка.ДокументОснование)
				И ТипЗнч(ДокСсылка.ДокументОснование) = Тип("ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ") 
				И КомплектСпайка_Импорт(ДокСсылка.ДокументОснование));
				//--Данилова Е.В. 03.06.2025
				//++Данилова Е.В. 29.05.2026 MARK-3615
				ОбновлятьПолученоСпайкиПеремарк = КомплектСпайка_ПоПеремаркировке(ДокСсылка) Или (ЗначениеЗаполнено(
					ДокСсылка.ДокументОснование) И ТипЗнч(ДокСсылка.ДокументОснование) = Тип(
					"ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ") И КомплектСпайка_ПоПеремаркировке(ДокСсылка.ДокументОснование)); 
				//--Данилова Е.В. 29.05.2026 
				Если ОбновлятьПолученоКомплектГН 
					ИЛИ ОбновлятьПолученоКомплектСпайка 
					//++Данилова Е.В. 29.05.2026 MARK-3615
					ИЛИ ОбновлятьПолученоСпайкиПеремарк Тогда 					 					
//					ДокументГН = ?(ДокСсылка.ВидКомплекта = Перечисления.ВидыКомплектов.ГотовыйКомплект 
//					ИЛИ КомплектСпайка_Импорт(ДокСсылка),ДокСсылка,ДокСсылка.ДокументОснование); //MARK-2355
					ДокументГН = ?(ДокСсылка.ВидКомплекта = Перечисления.ВидыКомплектов.ГотовыйКомплект
						Или КомплектСпайка_Импорт(ДокСсылка) Или КомплектСпайка_ПоПеремаркировке(ДокСсылка), ДокСсылка,
						ДокСсылка.ДокументОснование); 			
					//--Данилова Е.В. 29.05.2026
					ОбновитьПолученоКодовКомплектующихПоЗаказуКМГН(ДокументГН);//при записи формируем операции маркировки  
					
					ОперацияМаркировкиСтруктураДанных = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ОперацияМаркировкиПоГотовымНаборам(ДокументГН); 
					Если  ОперацияМаркировкиСтруктураДанных <> Неопределено Тогда
						Если ЗначениеЗаполнено(ОперацияМаркировкиСтруктураДанных.ДокВводВОборот) Тогда
							
							ТекстСообщения = "Оформлен/изменен документ ввода в оборот комплектующих: " + ОперацияМаркировкиСтруктураДанных.ДокВводВОборот; 
							Результат.Сообщения.Добавить(ТекстСообщения);
							
						КонецЕсли;
						
						
						Если ЗначениеЗаполнено(ОперацияМаркировкиСтруктураДанных.ДокФормированиеНабора) Тогда
							
							ТекстСообщения = "Оформлен/изменен документ формирования набора: " + ОперацияМаркировкиСтруктураДанных.ДокФормированиеНабора; 
							Результат.Сообщения.Добавить(ТекстСообщения);
							
							
						КонецЕсли;
						
					КонецЕсли;
					
					
				КонецЕсли;
				//--Данилова Е.В. 30.01.2025

			КонецЕсли; 
			ТекстСообщения = СтрШаблон("По документу: %1 загружены все коды маркировки ( %2 шт. ).", ДокСсылка, ПолученоКодов);
			Результат.Сообщения.Добавить(ТекстСообщения);
			Результат.Успешно = Истина;
			
		Иначе			
			УстановитьРеквизитыОбъекта(ДокСсылка, Новый Структура("ПолученоКодов", ПолученоКодов));			
			
			ТекстСообщения = СтрШаблон("По документу: %1 загружено %2 из %3 кодов маркировки.", ДокСсылка, ПолученоКодов, Выборка.КолЗаказано);
			Результат.Сообщения.Добавить(ТекстСообщения);
			Результат.Успешно = Истина;
		КонецЕсли;
	КонецЕсли;                                                                 
	
	Возврат Результат;
КонецФункции //ОбновитьКоличествоПолученныхКодов(ДокСсылка) Экспорт

Функция ОперацияМаркировкиПоГотовымНаборам(Знач ЗаказКМ, БезПроверкиСтатуса = Ложь)  Экспорт
	
	Если БезПроверкиСтатуса 
		//++Данилова Е.В. 26.03.2025
		//ИЛИ (ЗаказКМ.ВидНоменклатурыЧЗВДокументе = Перечисления.ВидыНоменклатурыЧЗ.Набор
		ИЛИ ((ЗаказКМ.ВидКомплекта = Перечисления.ВидыКомплектов.ГотовыйКомплект ИЛИ КомплектСпайка_Импорт(ЗаказКМ))
		//--Данилова Е.В. 26.03.2025
		И ЗаказКМ.статус = Перечисления.СтатусыДокументовМаркировки.Обработан)  Тогда
		
		 Запрос = Новый запрос;
		 Запрос.УстановитьПараметр("ДокументОснование",ЗаказКМ);
		 Запрос.Текст = 
		  "ВЫБРАТЬ РАЗЛИЧНЫЕ
		  |	ЕСТЬNULL(МаркировкаТоваровИСМПВводВОборот.Ссылка, ЗНАЧЕНИЕ(Документ.МаркировкаТоваровИСМП.ПустаяСсылка)) КАК ДокВводВОборот,
		  |	ЕСТЬNULL(МаркировкаТоваровИСМПФормированиеНабора.Ссылка, ЗНАЧЕНИЕ(Документ.МаркировкаТоваровИСМП.ПустаяСсылка)) КАК ДокФормированиеНабора
		  |ИЗ
		  |	Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
		  |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМПВводВОборот
		  |		ПО МаркировкаТоваровИСМП.Ссылка = МаркировкаТоваровИСМПВводВОборот.Ссылка
		  |			И (МаркировкаТоваровИСМПВводВОборот.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.ВводВОборот)  
		  //Валетов + 17,03,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3577 Перенесу в Хранилище как Женя отдаст объект. Андрей, не затирай!  
		  |				ИЛИ МаркировкаТоваровИСМПВводВОборот.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Перемаркировка)) 
		  //Валетов -
		  |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМПФормированиеНабора
		  |		ПО МаркировкаТоваровИСМП.Ссылка = МаркировкаТоваровИСМПФормированиеНабора.Ссылка
		  |			И (МаркировкаТоваровИСМПФормированиеНабора.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.ФормированиеНабора))
		  |ГДЕ
		  |	МаркировкаТоваровИСМП.ДокументОснование = &ДокументОснование
		  |	И МаркировкаТоваровИСМП.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.ВводВОборот), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.ФормированиеНабора))
		  |	И НЕ МаркировкаТоваровИСМП.ПометкаУдаления"; 
		
		Выборка = Запрос.Выполнить().Выбрать();
		СтруктураДокументы = Новый Структура("ДокВводВОборот,ДокФормированиеНабора",неопределено,Неопределено); 
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.ДокВводВОборот) Тогда
				
				СтруктураДокументы.ДокВводВОборот = Выборка.ДокВводВОборот; 
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.ДокФормированиеНабора) Тогда
				
				СтруктураДокументы.ДокФормированиеНабора = Выборка.ДокФормированиеНабора; 
				
			КонецЕсли;		
			
		КонецЦикла;
		
		Возврат  СтруктураДокументы; 
	КонецЕсли;
	
	Возврат Неопределено; 

КонецФункции

Функция ЗагрузитьКодыИзЛогов(ДокСсылка, ПерезаписыватьКМ, АдресВозврата = Неопределено) Экспорт
	ЗаписатьВЛог("Отладка", "Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ЗагрузитьКодыИзЛогов", "Информация");
	
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Начало			= ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ОбработкаАПИ 	= МаркировкаВС.СоздатьОбработкуАПИ();
	МассивИД 		= ОбработкаАПИ.ПолучитьМассивЗаписейЗагрузкиКМ(ДокСсылка);
	
	ИмяМетода   = "МаркировкаС.ЗагрузитьКодыИзТаблицы";
	ОтборФЗ 	= Новый Структура("Состояние,ИмяМетода", СостояниеФоновогоЗадания.Активно, ИмяМетода);
	
	ВсегоСтрок	= 0;
		
	Если МассивИД.Количество() > 0 Тогда		
		ТК 				= ОбработкаАПИ.ПрочитатьКодыИзЛогов(МассивИД);
		ВсегоСтрок 		= ТК.Количество();		
		РазмерПорции	= ОпределитьРазмерПорции(ВсегоСтрок);
		ВсегоПорций		= Цел(ВсегоСтрок/РазмерПорции)+?(ВсегоСтрок%РазмерПорции =0,0,1);
		НомерПорции		= 0;
		
		ТекПорция 		= ТК.СкопироватьКолонки();		
		
		мЗадания 			= Новый Массив;
		АдресаРезультатов   = Новый Соответствие;
		Для Каждого СтрокаТК Из ТК Цикл
			СтрокаПорции = ТекПорция.Добавить();		
			ЗаполнитьЗначенияСвойств(СтрокаПорции, СтрокаТК);
			
			Если ТекПорция.Количество() >= РазмерПорции ИЛИ ТК.Индекс(СтрокаТК) = (ВсегоСтрок - 1) Тогда
				СписокФЗ = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборФЗ);
				Пока СписокФЗ.Количество() > 10 Цикл
					ФоновыеЗадания.ОжидатьЗавершенияВыполнения(СписокФЗ, 5);
					СписокФЗ = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборФЗ);
				КонецЦикла;
				
				АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
				
				пЗадания = Новый Массив;
				пЗадания.Добавить(ТекПорция);
				пЗадания.Добавить(ПерезаписыватьКМ);
				пЗадания.Добавить(АдресРезультата);
				
				НомерПорции		= НомерПорции + 1;
				НаименованиеФЗ	= СтрШаблон("Загрузка КМ по заказу %1, порция %2 из %3. Размер порции: %4.", ДокСсылка, НомерПорции, ВсегоПорций, ТекПорция.Количество());
				ФЗ = ФоновыеЗадания.Выполнить(ИмяМетода, пЗадания, ""+ДокСсылка.УникальныйИдентификатор()+"_"+НомерПорции, НаименованиеФЗ);
				мЗадания.Добавить(ФЗ);
				
				АдресаРезультатов[ФЗ.УникальныйИдентификатор] = АдресРезультата;
				
				ТекПорция.Очистить();
			КонецЕсли; 
		КонецЦикла;
		
		Результаты = инт_ДлительныеОперации.ОжидатьЗавершенияЗаданий(мЗадания);
		Для Каждого ФЗ Из Результаты Цикл
			Если ФЗ.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
				рЗагрузки = ПолучитьИзВременногоХранилища(АдресаРезультатов[ФЗ.УникальныйИдентификатор]);
				ТекстСообщения = СтрШаблон(ФЗ.Наименование + " Загружено %2 КМ.", ДокСсылка, рЗагрузки.ОбработаноОбъектов);
				ЗаписатьВЛог("Загрузка КМ", ТекстСообщения, "Информация");
			Иначе
				Если ФЗ.Состояние  = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
					ЗаписатьВЛог("Загрузка КМ", "Ошибка ФЗ: " + инт_ДлительныеОперации.ОписаниеОшибкиФЗ(ФЗ), "Ошибка");
				Иначе					
					ЗаписатьВЛог("Загрузка КМ", "Недопустимое состояние ФЗ: " + ФЗ.Состояние, "Ошибка");
				КонецЕсли;				
			КонецЕсли;			
		КонецЦикла; 
		
		ОбновитьКоличествоПолученныхКодов(ДокСсылка);
		
		Результат.Успешно = Истина;
	Иначе
		ТекстСообщения = СтрШаблон("Не обнаружено полученных кодов по документу: '%1' !", ДокСсылка);
		Результат.Ошибки.Добавить(ТекстСообщения);								
	КонецЕсли;
	
	Результат.ОбработаноОбъектов	= ВсегоСтрок;
	Результат.ВремяВыполнения 		= (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000;

	Если ЭтоАдресВременногоХранилища(АдресВозврата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресВозврата);			
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ЗагрузитьКодыИзЛогов(ДокСсылка, ПерезаписыватьКМ, АдресВозврата = Неопределено) Экспорт

Функция ОпределитьВидКомплекта(мНоменклатура) Экспорт
	Результат = Перечисления.ВидыКомплектов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Родитель.ВидКомплекта КАК ВидКомплекта
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В (&мНоменклатура)
	|";
	
	Запрос.УстановитьПараметр("мНоменклатура", мНоменклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 И Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ВидКомплекта) Тогда
		Результат = Выборка.ВидКомплекта;	
	КонецЕсли; 
	
	Возврат Результат;	
КонецФункции //ОпределитьВидКомплекта(мНоменклатура) Экспорт

Функция ОпределитьВидНоменклатурыЧЗ(ВидКомплекта) Экспорт
	ВидНоменклатурыЧЗВДокументе = Перечисления.ВидыНоменклатурыЧЗ.ПустаяСсылка();
	
	Если ВидКомплекта = Перечисления.ВидыКомплектов.Товар Тогда
		ВидНоменклатурыЧЗВДокументе = Перечисления.ВидыНоменклатурыЧЗ.Единица;
	ИначеЕсли ВидКомплекта = Перечисления.ВидыКомплектов.ГотовыйКомплект Тогда
		ВидНоменклатурыЧЗВДокументе = Перечисления.ВидыНоменклатурыЧЗ.Набор;
	Иначе
		ВидНоменклатурыЧЗВДокументе = Перечисления.ВидыНоменклатурыЧЗ.Набор;
	КонецЕсли;
	
	Возврат ВидНоменклатурыЧЗВДокументе;
КонецФункции //ОпределитьВидКомплекта(ВидКомплекта) Экспорт 

Функция ОпределитьРазмерПорции(ВсегоСтрок, МаксЧислоПотоков = 5, МинРазмерПорции = 500) //В заказе макс. 50000 - грузим максимум в 5 потоков 	
	Потоков = 0;	
	РазмерПорции = 0;

	Если ВсегоСтрок = 0 Тогда
		Потоков = 0;
	ИначеЕсли ВсегоСтрок < МинРазмерПорции Тогда	
		Потоков = 1;	
	Иначе
		Потоков = Цел(ВсегоСтрок/МинРазмерПорции);
		Если ВсегоСтрок/(Потоков*МинРазмерПорции) > 1.3 Тогда
			Потоков = Потоков + 1;		
		КонецЕсли;	
	КонецЕсли;

	Потоков = Мин(МаксЧислоПотоков, Потоков);

	Если Потоков > 0 Тогда
		РазмерПорции = Цел(ВсегоСтрок/Потоков);
		Если Потоков*РазмерПорции < ВсегоСтрок Тогда
			РазмерПорции = РазмерПорции + 1;		
		КонецЕсли;	
	КонецЕсли;
	
	Возврат РазмерПорции;
КонецФункции //ОпределитьРазмерПорции()

//++Данилова Е.В. 03.04.2025 ASU-2175
Функция ПроверитьДокументПередСозданиемЗаказовКМКомплектующие(ДокСсылка) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Реквизиты = ПолучитьРеквизитыШапки(ДокСсылка, "Проведен,Статус,ВидКомплекта,СпособВводаВОборот");  //MARK-2355
	Если Реквизиты.Проведен Тогда
		Если Реквизиты.Статус = Перечисления.СтатусыДокументовМаркировки.ВРаботе Тогда
			Результат.Успешно = Истина;
		Иначе			
			ТекстОшибки = СтрШаблон("Не допустимый статус док-та: %1, статус: '%2', должен быть: 'В работе'.", ДокСсылка, Реквизиты.Статус);
			Результат.Ошибки.Добавить(ТекстОшибки);
		КонецЕсли;
		//++Данилова Е.В. 03.06.2025 MARK-2355 
		Если Реквизиты.ВидКомплекта = Перечисления.ВидыКомплектов.ГотовыйКомплект 
			ИЛИ КомплектСпайка_Импорт(ДокСсылка) Тогда
		//--Данилова Е.В. 03.06.2025
			Результат.Успешно = Истина;
		Иначе			
			ТекстОшибки = СтрШаблон("Не допустимый вид комплекта: %1, вид комплекта: '%2', должен быть: 'Готовый комплект'.", ДокСсылка, Реквизиты.ВидКомплекта);
			Результат.Ошибки.Добавить(ТекстОшибки);
		КонецЕсли;
	Иначе
		Результат.Ошибки.Добавить("Документ не проведен.");
	КонецЕсли;
	
	Возврат Результат;
КонецФункции
//Данилова Е.В. 19.05.2026 MARK-3615 добавление параметра
Функция СоздатьЗаказыКМКомплектующие(ЗаказКМ_Ссылка,ВидКомплекта = Неопределено,ТаблицаКомплектующие = неопределено,Статус = Неопределено) Экспорт //MARK-2355 
	
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);	
	//++Данилова Е.В. 03.06.2025 MARK-2355
	Если ВидКомплекта = Неопределено Тогда
		
		ВидКомплекта = 	Перечисления.ВидыКомплектов.ГотовыйКомплект; 
		
	КонецЕсли;
	//--Данилова Е.В. 03.06.2025
	
	//++Данилова Е.В. 19.05.2026 MARK-3615
	Если Статус = неопределено Тогда
	
		Статус = Перечисления.СтатусыДокументовМаркировки.ВРаботе; 
	
	КонецЕсли;

	Если ТаблицаКомплектующие <> Неопределено Тогда
		тТовары = ТаблицаКомплектующие;
	Иначе 
	//--Данилова Е.В. 19.05.2026

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НоменклатураКоплектующие.Номенклатура КАК Номенклатура,
		|	СУММА(НоменклатураКоплектующие.Количество * ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Количество) КАК Количество
		|ИЗ
		|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Товары КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
		|		ПО ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Номенклатура = НоменклатураСпр.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
		|		ПО (НоменклатураКоплектующие.Ссылка = НоменклатураСпр.Ссылка)
		|ГДЕ
		|	НоменклатураСпр.ВидКомплекта = &ВидКомплекта
		|	И ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Ссылка = &Ссылка
		|	И НоменклатураКоплектующие.Номенклатура.Родитель.ТНВЭД <> ЗНАЧЕНИЕ(Справочник.ТНВЭД.ПустаяСсылка)
		|	И НЕ(НоменклатураКоплектующие.Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.ПустаяСсылка)
		|				ИЛИ НоменклатураКоплектующие.Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.НеПодлежитМаркировке))
		|
		|СГРУППИРОВАТЬ ПО
		|	НоменклатураКоплектующие.Номенклатура";
		Запрос.УстановитьПараметр("Ссылка", ЗаказКМ_Ссылка); 
 	//++Данилова Е.В. 03.06.2025  MARK-2355
		Запрос.УстановитьПараметр("ВидКомплекта", ВидКомплекта);
	//--Данилова Е.В. 03.06.2025
		тТовары = Запрос.Выполнить().Выгрузить();
	//++Данилова Е.В. 19.05.2026 MARK-3615
	КонецЕсли;	
	//--Данилова Е.В. 19.05.2026
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Части ИЗ &Части КАК Части
	|;	
	|ВЫБРАТЬ
	|	Номенклатура.ГТИН КАК ГТИН,
	|	*
	|ИЗ
	|	ВТ_Части
	|ИТОГИ ПО
	|	Часть
	|";
	
	Запрос.УстановитьПараметр("Части", МаркировкаВС.РазбитьТЧнаЧасти(тТовары, 5, 5000)) ; 
	
	рОчистки = ОчиститьПодчиненныеЗаказы(ЗаказКМ_Ссылка);
	Если рОчистки.Успешно Тогда
		СуществующиеЗаказы = рОчистки.СуществующиеЗаказы;		
		
		рЗапроса 		= Запрос.Выполнить();	
		Выборка_Часть 	= рЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Часть");	
		
		Если рЗапроса.Пустой() Тогда
			Результат.Ошибки.Добавить("Не найдено данных для обработки !");		
		КонецЕсли;
		НачатьТранзакцию(); 
		Пока Выборка_Часть.Следующий() Цикл
			ДокСсылка = СуществующиеЗаказы[Выборка_Часть.Часть];					
			Если ДокСсылка = Неопределено Тогда
				ДокОбъект = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.СоздатьДокумент();
				//++Данилова Е.В. 16.05.2025  MARK-1675
				ДокОбъект.СозданАвтоматически = Истина;
				//--Данилова Е.В. 16.05.2025
				ДокОбъект.Дата	= ТекущаяДата();
				ДокОбъект.Заполнить(ЗаказКМ_Ссылка);
			Иначе
				ДокОбъект = ДокСсылка.ПолучитьОбъект();
			КонецЕсли; 
			
			ДокОбъект.Товары.Очистить();
			
			Выборка = Выборка_Часть.Выбрать();
			Пока Выборка.Следующий() Цикл
				СтрокаТЧ = ДокОбъект.Товары.Добавить();			
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
			КонецЦикла; 
			//++Данилова Е.В. 19.05.2026 MARK-3615
			ДокОбъект.Статус = Статус; 
			//--Данилова Е.В. 19.05.2026 
			ДокОбъект.ПометкаУдаления = Ложь;
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1; 
			//++Данилова Е.В. 09.04.2025 MARK-1946
			Результат.Данные.Добавить(ДокОбъект.ссылка); 
			//--Данилова Е.В. 09.04.2025
		КонецЦикла;
		Если ТранзакцияАктивна() Тогда
		
			ЗафиксироватьТранзакцию();
		
		КонецЕсли;
	Иначе
		Результат.Успешно = Ложь;
		
		Результат.Ошибки.Добавить("Не удалось очистить подчиненные заказы на КМ !");
		МаркировкаКС.ДобавитьОшибки(Результат, рОчистки);
	КонецЕсли;       
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0 И Результат.ОбработаноОбъектов>0);	
	
	Возврат Результат;
	
КонецФункции //СоздатьЗаказыКЗПС(ЗПС_Ссылка)

Процедура ОбновитьПолученоКодовКомплектующихПоЗаказуКМГН(Знач ДокСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ПолученоКодов) КАК ПолученоКодов
	|ИЗ
	|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
	|ГДЕ
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Проведен
	|	И ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокСсылка);
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	ПолученоКодовКомплект = 0; 
	
	Если Выборка.Следующий() Тогда
		
		ПолученоКодовКомплект = Выборка.ПолученоКодов; 
		
	КонецЕсли;
	
	РежимЗаписи = ?(ДокСсылка.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись);
	Реквизиты 	= Новый Структура("ПолученоКодовКомплект", ПолученоКодовКомплект);
	
	УстановитьРеквизитыОбъекта(ДокСсылка, Реквизиты, РежимЗаписи);
	
	#ЕСЛИ Клиент ТОГДА
		ОповеститьОбИзменении(ДокСсылка);
	#КОНЕЦЕСЛИ
	Если  ДокСсылка.ПолученоКодовКомплект  = ДокСсылка.КоличествоКомплект Тогда
		 //++Данилова Е.В. 06.10.2025 MARK-2834
		//СформироватьДокументыМаркировкиПоГН(ДокСсылка);
		//--Данилова Е.В. 06.10.2025
		
	КонецЕсли;

КонецПроцедуры

Процедура СформироватьДокументыМаркировкиПоГН(Знач ЗаказКМГН) Экспорт
    //++Данилова Е.В. 22.08.2025 MARK-2787 
	//ДокМаркировкиФормированиеНабора = неопределено;
	//ДокМаркировкиВводВОборот 		= Неопределено; 
	//
	//СоздатьДокументМаркировкаПоЗКГотовыйКомплект(ДокМаркировкиФормированиеНабора,ЗаказКМГН); 
	//ШтрихкодыУпаковокТЧ = ДокМаркировкиФормированиеНабора.ШтрихкодыУпаковок.Выгрузить();
	//
	//СоздатьДокументВводаВОборотКомплектующих(ДокМаркировкиВводВОборот,ШтрихкодыУпаковокТЧ,ЗаказКМГН);
	//
	//Если ДокМаркировкиВводВОборот <> неопределено Тогда
	//	ДокМаркировкиВводВОборот.Записать(РежимЗаписиДокумента.Проведение);
	//	Сообщить("Оформлен/изменен документ ввода в оборот комплектующих: " + ДокМаркировкиВводВОборот);
	//КонецЕсли; 
	//Если ДокМаркировкиФормированиеНабора <> Неопределено Тогда
	//	ДокМаркировкиФормированиеНабора.Записать(РежимЗаписиДокумента.Проведение);
	//	Сообщить("Оформлен/изменен документ формирования набора: " + ДокМаркировкиФормированиеНабора);
	//КонецЕсли;
	//++Данилова Е.В. 29.05.2026 MARK-3615
	Если КомплектСпайка_ПоПеремаркировке(ЗаказКМГН) Тогда
		СоздатьВводВОборотПоСпайкамПоПеремаркировке(ЗаказКМГН);
	Иначе
		СоздатьФормированиеНабораВводВОборотПоГН(ЗаказКМГН);
	КонецЕсли;
	//--Данилова Е.В. 29.05.2026 
	//--Данилова Е.В. 22.08.2025
КонецПроцедуры

Процедура СоздатьДокументМаркировкаПоЗКГотовыйКомплект(ДокОбъект,ЗаказКМГН) Экспорт
	
	ДокОбъект = неопределено;
	
	ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ФормированиеНабора;  	
	 
	СоздатьЗаполнитьШапкуДокМаркировкиГН(ДокОбъект,ВидОперацииИСМП,ЗаказКМГН);
	
	Если ДокОбъект = неопределено Тогда
	
		Возврат; 	
	
	КонецЕсли;

	
	ДокОбъект.ШтрихкодыУпаковок.Очистить(); 
	ЗаполнитьШтрихкодыУпаковокПоГотовымНаборамМКМ(ДокОбъект,ЗаказКМГН);
	
КонецПроцедуры

Процедура СоздатьДокументВводаВОборотКомплектующих(ДокОбъект,ШтрихкодыУпаковокТЧ,ЗаказКМГН) Экспорт
	
	
	ВидОперацииИСМП = ?(ЗаказКМГН.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Импорт, 
	Перечисления.ВидыОперацийИСМП.ВводВОборот_Импорт,
	//Валетов + 21,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3522
	//Перечисления.ВидыОперацийИСМП.ВводВОборот_МаркировкаОстатков 
	Перечисления.ВидыОперацийИСМП.Перемаркировка_ИспорченоЛибоУтеряно
	);
	
	
	ДокОбъект = неопределено;
	
	СоздатьЗаполнитьШапкуДокМаркировкиГН(ДокОбъект,ВидОперацииИСМП,ЗаказКМГН); 
	
	Если ДокОбъект = неопределено Тогда
	
		Возврат; 	
	
	КонецЕсли;

	ДокОбъект.ШтрихкодыУпаковок.Очистить(); 
	ЗаполнитьТоварыМаркировкиПоКомплектующим(ДокОбъект,ШтрихкодыУпаковокТЧ);
	//++Данилова Е.В. 04.06.2025 MARK-2355 
	Если ДокОбъект.ШтрихкодыУпаковок.Количество() = 0 Тогда
	
		ДокОбъект = неопределено
	
	КонецЕсли;
	//--Данилова Е.В. 04.06.2025

КонецПроцедуры

Процедура СоздатьЗаполнитьШапкуДокМаркировкиГН(ДокОбъект,ВидОперацииИСМП,ЗаказКМГН) Экспорт

	ПоляПоиска = Новый Структура("ДокументОснование,ВидОперацииИСМП,ПометкаУдаления", ЗаказКМГН, ВидОперацииИСМП,ЛОЖЬ);
	
	ДокМаркировка =  НайтиДокумент("МаркировкаТоваровИСМП", ПоляПоиска);
	
	Если ЗначениеЗаполнено(ДокМаркировка) Тогда
		Реквизиты = ПолучитьРеквизитыШапки(ДокМаркировка, "Статус");			
		Если Реквизиты.Статус<>Перечисления.СтатусыДокументовМаркировки.ВРаботе  
			И ВидОперацииИСМП <> Перечисления.ВидыОперацийИСМП.Агрегация Тогда 
			
			ТекстОшибки = СтрШаблон("Невозможно перезаполнить формирование набора: %1, недопустимый статус: '%2'.", ДокМаркировка, Реквизиты.Статус);
			Возврат ;
		ИначеЕсли  ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.Агрегация 
			И (Реквизиты.Статус<>Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки
			И Реквизиты.Статус<>Перечисления.СтатусыДокументовМаркировки.ВРаботе) Тогда 
			ТекстОшибки = СтрШаблон("Невозможно перезаполнить агрегеацию: %1, недопустимый статус: '%2'.", ДокМаркировка, Реквизиты.Статус);
			Возврат ;
		КонецЕсли; 
		ДокОбъект = ДокМаркировка.ПолучитьОбъект();
	Иначе
		ДокОбъект = Документы.МаркировкаТоваровИСМП.СоздатьДокумент(); 
		//++Данилова Е.В. 16.05.2025 MARK-1675
		ДокОбъект.СозданАвтоматически = Истина;
		//--Данилова Е.В. 16.05.2025
	КонецЕсли;
	
	ДокОбъект.ДокументОснование = ЗаказКМГН; 
	ДокОбъект.Дата =  ТекущаяДатаСеанса(); 
	ДокОбъект.Комментарий = ЗаказКМГН.Комментарий;
	Если ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ФормированиеНабора Тогда
		
		ВидОперации 			= Перечисления.ВидыОперацийМаркировки.ФормированиеНабора; 
		
	ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВводВОборот_МаркировкаОстатков 
		ИЛИ ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВводВОборот_Импорт Тогда
		
		ВидОперации 			= Перечисления.ВидыОперацийМаркировки.ВводВОборот;
		
	ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.Агрегация тогда
		
		ВидОперации 			= Перечисления.ВидыОперацийМаркировки.Агрегация;
	//Валетов + 21,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3522
	ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.Перемаркировка_ИспорченоЛибоУтеряно тогда
		
		ВидОперации 			= Перечисления.ВидыОперацийМаркировки.Перемаркировка;
	//Валетов-
	Иначе 
		Возврат ; 
	КонецЕсли;
	
	ДокОбъект.ВидОперации 			= ВидОперации; 
	ДокОбъект.ВидОперацииИСМП		= ВидОперацииИСМП; 
	
	ДокОбъект.Статус				= Перечисления.СтатусыДокументовМаркировки.ВРаботе;
	ДокОбъект.Автор 				= ПараметрыСеанса.Пользователь;		
	ДокОбъект.Организация 			= ЗаказКМГН.Организация; 
	ДокОбъект.ТипУпаковки 			= Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
	ДокОбъект.ТипШК					= Перечисления.ТипыШтрихКодов.Коробка; 	 
	ДокОбъект.ПодразделениеНанесения = ЗаказКМГН.ПодразделениеНанесения; 
	

КонецПроцедуры 

Процедура ЗаполнитьШтрихкодыУпаковокПоГотовымНаборамМКМ(ДокументМаркировки, ЗаказКМГН) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТКомплекты
	               |ИЗ
	               |	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Товары КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
	               |		ПО ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Ссылка = ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка
	               |ГДЕ
	               |	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка = &ЗаказНаЭмиссию
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НоменклатураСпр.Ссылка КАК ГотовыйКомплект,
	               |	НоменклатураСпр.Номенклатура КАК Номенклатура,
	               |	НоменклатураСпр.Количество КАК Количество
	               |ПОМЕСТИТЬ ВТСоответствиеГККомплектующие
	               |ИЗ
	               |	Справочник.Номенклатура.Коплектующие КАК НоменклатураСпр
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКомплекты КАК ВТКомплекты
	               |		ПО (ВТКомплекты.Номенклатура = НоменклатураСпр.Ссылка)
	               |ГДЕ
	               |	НЕ(НоменклатураСпр.Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.ПустаяСсылка)
	               |				ИЛИ НоменклатураСпр.Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.НеПодлежитМаркировке))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ШтрихкодыУпаковокТоваров.Ссылка КАК ШтрихкодУпаковки,
	               |	ШтрихкодыУпаковокТоваров.Владелец КАК Номенклатура
	               |ПОМЕСТИТЬ ВТШтрихКодыПоКомплектующим
	               |ИЗ
	               |	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	               |ГДЕ
	               |	ШтрихкодыУпаковокТоваров.ЗаказКМ.ДокументОснование = &ЗаказНаЭмиссию
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ШтрихкодыУпаковокТоваров.Ссылка КАК ШтрихкодУпаковки,
	               |	ШтрихкодыУпаковокТоваров.Владелец КАК Номенклатура
	               |ПОМЕСТИТЬ ВТШтрихКодыПоКомплектам
	               |ИЗ
	               |	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	               |ГДЕ
	               |	ШтрихкодыУпаковокТоваров.ЗаказКМ = &ЗаказНаЭмиссию
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТСоответствиеГККомплектующие.ГотовыйКомплект КАК ГотовыйКомплект,
	               |	ВТСоответствиеГККомплектующие.Номенклатура КАК Номенклатура,
	               |	ВТШтрихКодыПоКомплектам.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	               |	ВТСоответствиеГККомплектующие.Количество КАК Количество
	               |ИЗ
	               |	ВТСоответствиеГККомплектующие КАК ВТСоответствиеГККомплектующие
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТШтрихКодыПоКомплектам КАК ВТШтрихКодыПоКомплектам
	               |		ПО (ВТШтрихКодыПоКомплектам.Номенклатура = ВТСоответствиеГККомплектующие.ГотовыйКомплект)
	               |ИТОГИ
	               |	МАКСИМУМ(Количество)
	               |ПО
	               |	ГотовыйКомплект,
	               |	ШтрихкодУпаковки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТСоответствиеГККомплектующие.Номенклатура КАК Номенклатура,
	               |	ВТШтрихКодыПоКомплектующим.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	               |ИЗ
	               |	ВТСоответствиеГККомплектующие КАК ВТСоответствиеГККомплектующие
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТШтрихКодыПоКомплектующим КАК ВТШтрихКодыПоКомплектующим
	               |		ПО (ВТШтрихКодыПоКомплектующим.Номенклатура = ВТСоответствиеГККомплектующие.Номенклатура)";   
	               
	
	Запрос.УстановитьПараметр("ЗаказНаЭмиссию", ЗаказКМГН);
	
	МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц; 
	
	ПакетЗапросов = Запрос.ВыполнитьПакет(); 	
	
	ВыборкаКомплектыИтоги 		= ПакетЗапросов[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	//
	ТаблицаШККомплектующие = ПакетЗапросов[5].Выгрузить(); //                           Выбрать(); 
    ТаблицаШККомплектующие.Индексы.Добавить("Номенклатура");
		
	Пока ВыборкаКомплектыИтоги.Следующий() Цикл 
		
		ВыборкаШКУпаковки = ВыборкаКомплектыИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		
		Пока ВыборкаШКУпаковки.Следующий() Цикл   			 
			
			ВыборкаНоменклатураГК =  ВыборкаШКУпаковки.Выбрать(); 
			
			Пока ВыборкаНоменклатураГК.Следующий() Цикл 			
				
				Отбор = Новый Структура; 
				Отбор.Вставить("Номенклатура",ВыборкаНоменклатураГК.Номенклатура);
				//
				КоличествоНеобходимое = ВыборкаНоменклатураГК.количество;
				
				СтрокиШК = ТаблицаШККомплектующие.НайтиСтроки(Отбор);
				
				Для каждого СтрокаШК  Из СтрокиШК Цикл
					Если КоличествоНеобходимое = 0 Тогда
						
						Прервать; 	
						
					КонецЕсли;
					НоваяСтрокаТП = ДокументМаркировки.ШтрихкодыУпаковок.Добавить(); // ТаблицаПодготовка.Добавить();
					НоваяСтрокаТП.ШтрихкодНабора 	= ВыборкаШКУпаковки.ШтрихкодУпаковки;
					НоваяСтрокаТП.ШтрихкодУпаковки 	= СтрокаШК.ШтрихкодУпаковки;
					
					ТаблицаШККомплектующие.Удалить(СтрокаШК); 
					
					КоличествоНеобходимое = КоличествоНеобходимое - 1; 
				КонецЦикла;
			КонецЦикла;
			
		КонецЦикла;
		
		
	КонецЦикла;	 		
	 

КонецПроцедуры

Процедура ЗаполнитьТоварыМаркировкиПоКомплектующим(ДокументМаркировки,ШтрихкодыУпаковокТЧ)
	
	//++Данилова Е.В. 04.06.2025 MARK-2355
	ЭтоКомплектСпайка = Ложь; 
	ДокОснование = ДокументМаркировки.ДокументОснование; 
	Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ") 
		И ДокОснование.ВидКомплекта = Перечисления.ВидыКомплектов.Комплект Тогда
		
		ЭтоКомплектСпайка = истина; 	
		
	КонецЕсли;
	//--Данилова Е.В. 04.06.2025
	Для каждого СтрокаУпаковки Из ШтрихкодыУпаковокТЧ Цикл 
		//++Данилова Е.В. 04.06.2025 MARK-2355
		Если ЭтоКомплектСпайка Тогда
		    РазныеТНВЭДВКомплекте = ПолучитьРеквизитШапки(СтрокаУпаковки.ШтрихкодУпаковки.Владелец,"РазныеТНВЭДВКомплекте"); 
			Если НЕ РазныеТНВЭДВКомплекте Тогда 	
				Продолжить; 	
			КонецЕсли;
		КонецЕсли;
		//--Данилова Е.В. 04.06.2025
		НоваяСтрока = ДокументМаркировки.ШтрихкодыУпаковок.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаУпаковки,"ШтрихкодУпаковки"); 
	КонецЦикла;

КонецПроцедуры

//--Данилова Е.В. 03.04.2025 
//++Данилова Е.В. 29.05.2026 MARK-3615
Процедура СоздатьВводВОборотПоСпайкамПоПеремаркировке(Знач ЗаказКМГН)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ссылка КАК ЗаказКМ
				   |ПОМЕСТИТЬ ВТЗаказыКМ
				   |ИЗ
				   |	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
				   |ГДЕ
				   |	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование = &ЗаказНаЭмиссию
				   |	И ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Проведен
				   |	И ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан)
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	ШтрихкодыУпаковокТоваров.Ссылка КАК ШтрихкодУпаковки
				   |ИЗ
				   |	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗаказыКМ КАК ВТЗаказыКМ
				   |		ПО ВТЗаказыКМ.ЗаказКМ = ШтрихкодыУпаковокТоваров.ЗаказКМ";   
	               
	
	Запрос.УстановитьПараметр("ЗаказНаЭмиссию", ЗаказКМГН);
	РезультатЗапроса = Запрос.Выполнить(); 
	
	 			
	МассивДокументовСозданных = новый Массив();
	Если не РезультатЗапроса.Пустой() Тогда
		
		ВидОперацииИСМП = ?(ЗаказКМГН.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Импорт, 
		Перечисления.ВидыОперацийИСМП.ВводВОборот_Импорт, 		  
		Перечисления.ВидыОперацийИСМП.Перемаркировка_ИспорченоЛибоУтеряно
		);
		РезультатОчистки = Документы.МаркировкаТоваровИСМП.ОчиститьПодчиненныеДокументыМаркировки(ЗаказКМГН,ВидОперацииИСМП); 
		Если РезультатОчистки.Успешно Тогда
			
			ДокументМаркировки = СоздатьНовыйДокументМаркировкиШапка(ВидОперацииИСМП,ЗаказКМГН);
			МассивДокументовСозданных.Добавить(ДокументМаркировки); 
			
			КоличествоСтрокВодномДокументе =  30000; 
			
			СтрокаШК = РезультатЗапроса.Выбрать();
			Пока СтрокаШК.Следующий() Цикл

				Если КоличествоСтрокВодномДокументе = ДокументМаркировки.ШтрихкодыУпаковок.Количество() Тогда

					ДокументМаркировки = СоздатьНовыйДокументМаркировкиШапка(ВидОперацииИСМП, ЗаказКМГН);
					МассивДокументовСозданных.Добавить(ДокументМаркировки);

				КонецЕсли;
				НоваяСтрока = ДокументМаркировки.ШтрихкодыУпаковок.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаШК, "ШтрихкодУпаковки");

			КонецЦикла;
			
		КонецЕсли;
		
		Для Каждого ЭлементМассива Из МассивДокументовСозданных Цикл

			Попытка

				ЭлементМассива.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Сообщить(ОписаниеОшибки());
				ЗаписатьВЛог("МаркировкаГН", "Не удалось сформировать ввод в оборот (перемаркировка) по " + Строка(
					ЗаказКМГН), "Ошибка");
			КонецПопытки;

		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
//--Данилова Е.В. 29.05.2026 
//++Данилова Е.В. 22.08.2025 MARK-2787
Процедура СоздатьФормированиеНабораВводВОборотПоГН(Знач ЗаказКМГН)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТКомплекты
	               |ИЗ
	               |	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Товары КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
	               |		ПО ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Ссылка = ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка
	               |ГДЕ
	               |	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка = &ЗаказНаЭмиссию
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НоменклатураСпр.Ссылка КАК ГотовыйКомплект,
	               |	НоменклатураСпр.Номенклатура КАК Номенклатура,
	               |	НоменклатураСпр.Количество КАК Количество
	               |ПОМЕСТИТЬ ВТСоответствиеГККомплектующие
	               |ИЗ
	               |	Справочник.Номенклатура.Коплектующие КАК НоменклатураСпр
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКомплекты КАК ВТКомплекты
	               |		ПО (ВТКомплекты.Номенклатура = НоменклатураСпр.Ссылка)
	               |ГДЕ
	               |	НЕ(НоменклатураСпр.Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.ПустаяСсылка)
	               |				ИЛИ НоменклатураСпр.Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.НеПодлежитМаркировке))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ШтрихкодыУпаковокТоваров.Ссылка КАК ШтрихкодУпаковки,
	               |	ШтрихкодыУпаковокТоваров.Владелец КАК Номенклатура
	               |ПОМЕСТИТЬ ВТШтрихКодыПоКомплектующим
	               |ИЗ
	               |	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	               |ГДЕ
	               |	ШтрихкодыУпаковокТоваров.ЗаказКМ.ДокументОснование = &ЗаказНаЭмиссию
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ШтрихкодыУпаковокТоваров.Ссылка КАК ШтрихкодУпаковки,
	               |	ШтрихкодыУпаковокТоваров.Владелец КАК Номенклатура
	               |ПОМЕСТИТЬ ВТШтрихКодыПоКомплектам
	               |ИЗ
	               |	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	               |ГДЕ
	               |	ШтрихкодыУпаковокТоваров.ЗаказКМ = &ЗаказНаЭмиссию
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТСоответствиеГККомплектующие.ГотовыйКомплект КАК ГотовыйКомплект,
	               |	ВТСоответствиеГККомплектующие.Номенклатура КАК Номенклатура,
	               |	ВТШтрихКодыПоКомплектам.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	               |	ВТСоответствиеГККомплектующие.Количество КАК Количество
	               |ИЗ
	               |	ВТСоответствиеГККомплектующие КАК ВТСоответствиеГККомплектующие
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТШтрихКодыПоКомплектам КАК ВТШтрихКодыПоКомплектам
	               |		ПО (ВТШтрихКодыПоКомплектам.Номенклатура = ВТСоответствиеГККомплектующие.ГотовыйКомплект)
	               |ИТОГИ
	               |	МАКСИМУМ(Количество)
	               |ПО
	               |	ГотовыйКомплект,
	               |	ШтрихкодУпаковки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТСоответствиеГККомплектующие.Номенклатура КАК Номенклатура,
	               |	ВТШтрихКодыПоКомплектующим.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	               |ИЗ
	               |	ВТСоответствиеГККомплектующие КАК ВТСоответствиеГККомплектующие
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТШтрихКодыПоКомплектующим КАК ВТШтрихКодыПоКомплектующим
	               |		ПО (ВТШтрихКодыПоКомплектующим.Номенклатура = ВТСоответствиеГККомплектующие.Номенклатура)";   
	               
	
	Запрос.УстановитьПараметр("ЗаказНаЭмиссию", ЗаказКМГН);
	
	МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц; 
	
	ПакетЗапросов = Запрос.ВыполнитьПакет(); 	
	
	ВыборкаКомплектыИтоги 		= ПакетЗапросов[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	//
	ТаблицаШККомплектующие = ПакетЗапросов[5].Выгрузить(); //                           Выбрать(); 
    ТаблицаШККомплектующие.Индексы.Добавить("Номенклатура");
	
	НовыйДокументМаркировки = Документы.МаркировкаТоваровИСМП.СоздатьДокумент(); 
	ТаблицаШКУпаковок = НовыйДокументМаркировки.ШтрихкодыУпаковок.Выгрузить();
	//Данилова Е.В. 11.09.2025 без задачи, ограничение ЧЗ
	КоличествоСтрокВодномДокументе =  30000; //70000;
	
	МассивДокументовСозданных = Новый Массив; 
	
    РезультатОчистки = Документы.МаркировкаТоваровИСМП.ОчиститьПодчиненныеДокументыМаркировки(ЗаказКМГН,Перечисления.ВидыОперацийИСМП.ФормированиеНабора); 
	Если РезультатОчистки.Успешно Тогда 	
		
		ДокументМаркировки = СоздатьНовыйДокументМаркировкиШапка(Перечисления.ВидыОперацийИСМП.ФормированиеНабора,ЗаказКМГН);

      	МассивДокументовСозданных.Добавить(ДокументМаркировки); 
		
		Пока ВыборкаКомплектыИтоги.Следующий() Цикл 
			
			ВыборкаШКУпаковки = ВыборкаКомплектыИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
			
			Пока ВыборкаШКУпаковки.Следующий() Цикл   			 
				
				ВыборкаНоменклатураГК =  ВыборкаШКУпаковки.Выбрать(); 
				
				Пока ВыборкаНоменклатураГК.Следующий() Цикл 			
					
					Отбор = Новый Структура; 
					Отбор.Вставить("Номенклатура",ВыборкаНоменклатураГК.Номенклатура);
					//
					КоличествоНеобходимое = ВыборкаНоменклатураГК.количество;
					
					Если КоличествоНеобходимое + ДокументМаркировки.ШтрихкодыУпаковок.Количество() > КоличествоСтрокВодномДокументе Тогда
						
						ДокументМаркировки = СоздатьНовыйДокументМаркировкиШапка(Перечисления.ВидыОперацийИСМП.ФормированиеНабора,ЗаказКМГН);	
						
						МассивДокументовСозданных.Добавить(ДокументМаркировки);	
						
					КонецЕсли;
					
					СтрокиШК = ТаблицаШККомплектующие.НайтиСтроки(Отбор);
					
					Для каждого СтрокаШК  Из СтрокиШК Цикл
						Если КоличествоНеобходимое = 0 Тогда
							
							Прервать; 	
							
						КонецЕсли;
						
						Если КоличествоСтрокВодномДокументе = ДокументМаркировки.ШтрихкодыУпаковок.Количество() Тогда
						
							ДокументМаркировки = СоздатьНовыйДокументМаркировкиШапка(Перечисления.ВидыОперацийИСМП.ФормированиеНабора,ЗаказКМГН);	
							
							МассивДокументовСозданных.Добавить(ДокументМаркировки); 
						КонецЕсли; 
						
						НоваяСтрокаТП = ДокументМаркировки.ШтрихкодыУпаковок.Добавить(); // ТаблицаПодготовка.Добавить();
						НоваяСтрокаТП.ШтрихкодНабора 	= ВыборкаШКУпаковки.ШтрихкодУпаковки;
						НоваяСтрокаТП.ШтрихкодУпаковки 	= СтрокаШК.ШтрихкодУпаковки;
						
						СтрокаДобавленная = ТаблицаШКУпаковок.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаДобавленная,НоваяСтрокаТП); 
						
						ТаблицаШККомплектующие.Удалить(СтрокаШК); 
						
						КоличествоНеобходимое = КоличествоНеобходимое - 1; 
					КонецЦикла;
				КонецЦикла;
				
			КонецЦикла;
			
			
		КонецЦикла;	 	
	КонецЕсли; 
	
	
	/////////////////////////////
	//создание вводов в оборот 
	Если ТаблицаШКУпаковок.Количество() > 0 Тогда
		ВидОперацииИСМП = ?(ЗаказКМГН.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Импорт, 
		Перечисления.ВидыОперацийИСМП.ВводВОборот_Импорт, 
		//Валетов + 21,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3522
		//Перечисления.ВидыОперацийИСМП.ВводВОборот_МаркировкаОстатков  
		Перечисления.ВидыОперацийИСМП.Перемаркировка_ИспорченоЛибоУтеряно
		);
		РезультатОчистки = Документы.МаркировкаТоваровИСМП.ОчиститьПодчиненныеДокументыМаркировки(ЗаказКМГН,ВидОперацииИСМП); 
		Если РезультатОчистки.Успешно Тогда
			
			ДокументМаркировки = СоздатьНовыйДокументМаркировкиШапка(ВидОперацииИСМП,ЗаказКМГН);
			МассивДокументовСозданных.Добавить(ДокументМаркировки); 
			//Данилова Е.В. 11.09.2025 без задачи, ограничение ЧЗ
			КоличествоСтрокВодномДокументе =  30000; //70000;
			Для каждого СтрокаШК Из ТаблицаШКУпаковок Цикл
				
				Если КоличествоСтрокВодномДокументе = ДокументМаркировки.ШтрихкодыУпаковок.Количество() Тогда
					
					ДокументМаркировки = СоздатьНовыйДокументМаркировкиШапка(ВидОперацииИСМП,ЗаказКМГН);	
					МассивДокументовСозданных.Добавить(ДокументМаркировки); 
					
				КонецЕсли;
				НоваяСтрока = ДокументМаркировки.ШтрихкодыУпаковок.Добавить(); 
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаШК,"ШтрихкодУпаковки");	
				
			КонецЦикла;
			
		КонецЕсли;
		
		Для каждого ЭлементМассива  Из МассивДокументовСозданных Цикл
			
			Попытка
				
				ЭлементМассива.Записать(РежимЗаписиДокумента.Проведение);
				
				
			Исключение
				Сообщить(ОписаниеОшибки());
				ЗаписатьВЛог("МаркировкаГН","Не удалось сформировать формирование набора и ввод в оборот по " + Строка(ЗаказКМГН),"Ошибка"); 
			КонецПопытки;
			
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция СоздатьНовыйДокументМаркировкиШапка(Знач ВидОперацииИСМП,Знач ЗаказКМГН) 
		
	ДокОбъект = Документы.МаркировкаТоваровИСМП.СоздатьДокумент();  
	ДокОбъект.ДокументОснование = ЗаказКМГН; 
	ДокОбъект.Дата =  ТекущаяДатаСеанса(); 
	ДокОбъект.Комментарий = ЗаказКМГН.Комментарий;
	Если ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ФормированиеНабора Тогда
		
		ВидОперации 			= Перечисления.ВидыОперацийМаркировки.ФормированиеНабора; 
		
	ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВводВОборот_МаркировкаОстатков 
		ИЛИ ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВводВОборот_Импорт Тогда
		
		ВидОперации 			= Перечисления.ВидыОперацийМаркировки.ВводВОборот;
		
	ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.Агрегация тогда
		
		ВидОперации 			= Перечисления.ВидыОперацийМаркировки.Агрегация;
	//Валетов + 21,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3522
	ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.Перемаркировка_ИспорченоЛибоУтеряно тогда
		
		ВидОперации 			= Перечисления.ВидыОперацийМаркировки.Перемаркировка;
	//Валетов-	
	КонецЕсли;
	
	ДокОбъект.ВидОперации 			= ВидОперации; 
	ДокОбъект.ВидОперацииИСМП		= ВидОперацииИСМП; 
	
	ДокОбъект.Статус				= Перечисления.СтатусыДокументовМаркировки.ВРаботе;
	ДокОбъект.Автор 				= ПараметрыСеанса.Пользователь;		
	ДокОбъект.Организация 			= ЗаказКМГН.Организация; 
	ДокОбъект.ТипУпаковки 			= Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
	ДокОбъект.ТипШК					= Перечисления.ТипыШтрихКодов.Коробка; 	 
	ДокОбъект.ПодразделениеНанесения = ЗаказКМГН.ПодразделениеНанесения;
	
	Возврат ДокОбъект; 
	
КонецФункции



//--Данилова Е.В. 22.08.2025

//++Данилова Е.В. 09.04.2025 MARK-1946/MARK-1675
Функция ОтправитьНаОбработкуВСУЗ(ДокСсылка, ДопПараметры = неопределено,АдресВозврата = Неопределено) Экспорт
		
	ЗаписатьВЛог("Отладка", "Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ОтправитьНаОбработкуВСУЗ", "Информация");
	
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	//Валетов + 18,07,2025 ПУСТАЯ ЗАДАЧА 
	Если ЗначениеЗаполнено(ДокСсылка.ИД_ДокументаЧЗ) 
		И ДокСсылка.Статус =  Перечисления.СтатусыДокументовМаркировки.Обрабатывается Тогда  
		Возврат Результат;
	КонецЕсли;
	//Валетов -
	
	Начало			= ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ИмяМетода   = "МаркировкаВС.ОтправитьНаОбработку_ЗаказКМ";
	ОтборФЗ 	= Новый Структура("Состояние,ИмяМетода", СостояниеФоновогоЗадания.Активно, ИмяМетода);
	
	СписокФЗ = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборФЗ);
	Пока СписокФЗ.Количество() > 10 Цикл  //пока оставлю 10
		ФоновыеЗадания.ОжидатьЗавершенияВыполнения(СписокФЗ, 5);
		СписокФЗ = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборФЗ);
	КонецЦикла;
	
	АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	
	пЗадания = Новый Массив;
	пЗадания.Добавить(ДокСсылка);
	пЗадания.Добавить(ДопПараметры);
	пЗадания.Добавить(АдресРезультата);
	
	мЗадания 			= Новый Массив;
	АдресаРезультатов   = Новый Соответствие;	
	
	
	НаименованиеФЗ	= СтрШаблон("Отпр. на обр. в ЧЗ %1",ДокСсылка);
	ФЗ = ФоновыеЗадания.Выполнить(ИмяМетода, пЗадания, ""+ДокСсылка.УникальныйИдентификатор(), НаименованиеФЗ);
	мЗадания.Добавить(ФЗ);
	
	АдресаРезультатов[ФЗ.УникальныйИдентификатор] = АдресРезультата;
	Результаты = инт_ДлительныеОперации.ОжидатьЗавершенияЗаданий(мЗадания); //будет одно
	Для Каждого ФЗ Из Результаты Цикл
		Если ФЗ.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
			рЗагрузки = ПолучитьИзВременногоХранилища(АдресаРезультатов[ФЗ.УникальныйИдентификатор]);
			ТекстСообщения = СтрШаблон(ФЗ.Наименование + " Отработан в ЧЗ %1.", ДокСсылка);
			ЗаписатьВЛог("Отпр. на обр. в ЧЗ", ТекстСообщения, "Информация");
		Иначе
			Если ФЗ.Состояние  = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
				ЗаписатьВЛог("Отпр. на обр. в ЧЗ", "Ошибка ФЗ: " + инт_ДлительныеОперации.ОписаниеОшибкиФЗ(ФЗ), "Ошибка");
			Иначе					
				ЗаписатьВЛог("Отпр. на обр. в ЧЗ", "Недопустимое состояние ФЗ: " + ФЗ.Состояние, "Ошибка");
			КонецЕсли;				
		КонецЕсли;			
	КонецЦикла; 
	
	Результат.Успешно = Истина;
	//
	Результат.ВремяВыполнения 		= (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000;
	//
	Если ЭтоАдресВременногоХранилища(АдресВозврата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресВозврата);			
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ЗагрузитьКодыИзЛогов(ДокСсылка, ПерезаписыватьКМ, АдресВозврата = Неопределено) Экспорт

Функция ПолучитьКМ_Очереди(ДокСсылка, ДопПараметры = неопределено, АдресВозврата = Неопределено) Экспорт
	
	ЗаписатьВЛог("Отладка", "Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ПолучитьКМ_Очереди", "Информация");
	
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Начало			= ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ИмяМетода   = "МаркировкаВС.ПолучитьРезультаты_ЗаказКМ";
	ОтборФЗ 	= Новый Структура("Состояние,ИмяМетода", СостояниеФоновогоЗадания.Активно, ИмяМетода);
	
	СписокФЗ = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборФЗ);
	Пока СписокФЗ.Количество() > 10 Цикл  //пока оставлю 10
		ФоновыеЗадания.ОжидатьЗавершенияВыполнения(СписокФЗ, 5);
		СписокФЗ = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборФЗ);
	КонецЦикла;
	
	АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	
	пЗадания = Новый Массив;
	пЗадания.Добавить(ДокСсылка);
	пЗадания.Добавить(ДопПараметры); 
	пЗадания.Добавить(АдресРезультата);
	
	мЗадания 			= Новый Массив;
	АдресаРезультатов   = Новый Соответствие;	
	
	
	НаименованиеФЗ	= СтрШаблон("Получение КМ по Заказу КМ %1",ДокСсылка);
	ФЗ = ФоновыеЗадания.Выполнить(ИмяМетода, пЗадания, ""+ДокСсылка.УникальныйИдентификатор(), НаименованиеФЗ);
	мЗадания.Добавить(ФЗ);
	
	АдресаРезультатов[ФЗ.УникальныйИдентификатор] = АдресРезультата;
	Результаты = инт_ДлительныеОперации.ОжидатьЗавершенияЗаданий(мЗадания); //будет одно
	Для Каждого ФЗ Из Результаты Цикл
		Если ФЗ.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
			рЗагрузки = ПолучитьИзВременногоХранилища(АдресаРезультатов[ФЗ.УникальныйИдентификатор]);
			
			Если НЕ рЗагрузки.Успешно Тогда
				
				Если рЗагрузки.Ошибки.Количество()>0 Тогда
					ТекстОшибки = СтрСоединить(рЗагрузки.Ошибки, Символы.ПС);
				Иначе
					ТекстОшибки = Неопределено;				
				КонецЕсли; 
				УстановитьРеквизитыОбъекта(ДокСсылка, Новый Структура("Статус,ТекстОшибки", Перечисления.СтатусыДокументовМаркировки.ОшибкаОбработки, ТекстОшибки));
				
				ТемаПисьма = "Ошибка получения КМ из ЧЗ (Регламент обработки заказов КМ)";
				ТекстПисьма = СтрШаблон("ФЗ:%1. Ошибка в документе заказ КМ %2: %3",НаименованиеФЗ,ДокСсылка, ТекстОшибки); 
				
				СформироватьВнутреннееУведомлениеОбОшибке(ТекстПисьма,ТемаПисьма); 
			Иначе 
				ТекстСообщения = СтрШаблон(ФЗ.Наименование + " Получены КМ из ЧЗ %1.", ДокСсылка);
				ЗаписатьВЛог("Получить КМ из ЧЗ", ТекстСообщения, "Информация");
				
			КонецЕсли;
			
		Иначе
			Если ФЗ.Состояние  = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
				ЗаписатьВЛог("Получить КМ из ЧЗ", "Ошибка ФЗ: " + инт_ДлительныеОперации.ОписаниеОшибкиФЗ(ФЗ), "Ошибка");
			Иначе					
				ЗаписатьВЛог("Получить КМ из ЧЗ", "Недопустимое состояние ФЗ: " + ФЗ.Состояние, "Ошибка");
			КонецЕсли;				
		КонецЕсли;			
	КонецЦикла; 
	
	Результат.Успешно = Истина;
	//
	Результат.ВремяВыполнения 		= (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000;
	//
	Если ЭтоАдресВременногоХранилища(АдресВозврата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресВозврата);			
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // ()

Функция ОтправитьНаОбработкуВСУЗИСМП(ДокСсылка,ДопПараметры = неопределено, АдресВозврата = Неопределено) Экспорт 

	ЗаписатьВЛог("Отладка", "Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ОтправитьНаОбработкуВСУЗИСМП", "Информация");
	
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Начало			= ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ИмяМетода   = "МаркировкаВС.ОтправитьНаОбработку_ОперМаркировки";
	ОтборФЗ 	= Новый Структура("Состояние,ИмяМетода", СостояниеФоновогоЗадания.Активно, ИмяМетода);
	
	СписокФЗ = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборФЗ);
	Пока СписокФЗ.Количество() > 10 Цикл  //пока оставлю 10
		ФоновыеЗадания.ОжидатьЗавершенияВыполнения(СписокФЗ, 5);
		СписокФЗ = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборФЗ);
	КонецЦикла;
	
	АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	
	пЗадания = Новый Массив;
	пЗадания.Добавить(ДокСсылка);
	пЗадания.Добавить(ДопПараметры);
	пЗадания.Добавить(АдресРезультата);
	
	мЗадания 			= Новый Массив;
	АдресаРезультатов   = Новый Соответствие;	
	
	
	НаименованиеФЗ	= СтрШаблон("Отпр. на обр. в ЧЗ %1",ДокСсылка);
	ФЗ = ФоновыеЗадания.Выполнить(ИмяМетода, пЗадания, ""+ДокСсылка.УникальныйИдентификатор(), НаименованиеФЗ);
	мЗадания.Добавить(ФЗ);
	
	АдресаРезультатов[ФЗ.УникальныйИдентификатор] = АдресРезультата;
	Результаты = инт_ДлительныеОперации.ОжидатьЗавершенияЗаданий(мЗадания); //будет одно
	Для Каждого ФЗ Из Результаты Цикл
		Если ФЗ.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
			рЗагрузки = ПолучитьИзВременногоХранилища(АдресаРезультатов[ФЗ.УникальныйИдентификатор]);
			ТекстСообщения = СтрШаблон(ФЗ.Наименование + " Отправлен на отработку в ЧЗ %1.", ДокСсылка);
			ЗаписатьВЛог("Получить КМ из ЧЗ", ТекстСообщения, "Информация");
		Иначе
			Если ФЗ.Состояние  = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
				ЗаписатьВЛог("Отпр. на обр. в ЧЗ Опер. Маркировка", "Ошибка ФЗ: " + инт_ДлительныеОперации.ОписаниеОшибкиФЗ(ФЗ), "Ошибка");
			Иначе					
				ЗаписатьВЛог("Отпр. на обр. в ЧЗ Опер. Маркировка", "Недопустимое состояние ФЗ: " + ФЗ.Состояние, "Ошибка");
			КонецЕсли;				
		КонецЕсли;			
	КонецЦикла; 
	
	Результат.Успешно = Истина;
	//
	Результат.ВремяВыполнения 		= (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000;
	//
	Если ЭтоАдресВременногоХранилища(АдресВозврата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресВозврата);			
	КонецЕсли;
	
	Возврат Результат;
	

КонецФункции // () 

Функция ПолучитьРезультаты_ОперМаркировки(ДокСсылка,ДопПараметры = неопределено, АдресВозврата = Неопределено) Экспорт 

	ЗаписатьВЛог("Отладка", "Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ПолучитьРезультаты_ОперМаркировки", "Информация");
	
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Начало			= ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ИмяМетода   = "МаркировкаВС.ПолучитьРезультаты_ОперМаркировки";
	ОтборФЗ 	= Новый Структура("Состояние,ИмяМетода", СостояниеФоновогоЗадания.Активно, ИмяМетода);
	
	СписокФЗ = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборФЗ);
	Пока СписокФЗ.Количество() > 10 Цикл  //пока оставлю 10
		ФоновыеЗадания.ОжидатьЗавершенияВыполнения(СписокФЗ, 5);
		СписокФЗ = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборФЗ);
	КонецЦикла;
	
	АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	
	пЗадания = Новый Массив;
	пЗадания.Добавить(ДокСсылка);
	пЗадания.Добавить(ДопПараметры); 
	пЗадания.Добавить(АдресРезультата);
	
	мЗадания 			= Новый Массив;
	АдресаРезультатов   = Новый Соответствие;	
	
	
	НаименованиеФЗ	= СтрШаблон("Получение результатов по операции маркировки %1",ДокСсылка);
	ФЗ = ФоновыеЗадания.Выполнить(ИмяМетода, пЗадания, ""+ДокСсылка.УникальныйИдентификатор(), НаименованиеФЗ);
	мЗадания.Добавить(ФЗ);
	
	АдресаРезультатов[ФЗ.УникальныйИдентификатор] = АдресРезультата;
	Результаты = инт_ДлительныеОперации.ОжидатьЗавершенияЗаданий(мЗадания); //будет одно
	Для Каждого ФЗ Из Результаты Цикл
		Если ФЗ.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
			рЗагрузки = ПолучитьИзВременногоХранилища(АдресаРезультатов[ФЗ.УникальныйИдентификатор]);
			
			Если рЗагрузки.Успешно Тогда
				ТекстСообщения = СтрШаблон(ФЗ.Наименование + " Получен результат из ЧЗ по маркировке %1.", ДокСсылка);
				ЗаписатьВЛог("Получить результат из ЧЗ по маркировке", ТекстСообщения, "Информация");	
			Иначе
				ТекстОшибки = СтрСоединить(рЗагрузки.Ошибки, Символы.ПС);
				
				Если ТекстОшибки = "404" Тогда
					УстановитьРеквизитыОбъекта(ДокСсылка, Новый Структура("ТекстОшибки", ТекстОшибки));
				Иначе
					УстановитьРеквизитыОбъекта(ДокСсылка, Новый Структура("Статус,ТекстОшибки", Перечисления.СтатусыДокументовМаркировки.ОшибкаОбработки, ТекстОшибки));
				
					ТемаПисьма = "Ошибка получения рез. обработки из ЧЗ (Регламент обработки опер. маркировки)";
					ТекстПисьма = СтрШаблон("ФЗ:%1. Ошибка в документе ""Операция маркировка"" %2: %3",НаименованиеФЗ,ДокСсылка, ТекстОшибки); 
				
					СформироватьВнутреннееУведомлениеОбОшибке(ТекстПисьма,ТемаПисьма);				
				КонецЕсли;				
			КонецЕсли;
		Иначе
			Если ФЗ.Состояние  = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
				ЗаписатьВЛог("Получить результат из ЧЗ по маркировке", "Ошибка ФЗ: " + инт_ДлительныеОперации.ОписаниеОшибкиФЗ(ФЗ), "Ошибка");
			Иначе					
				ЗаписатьВЛог("Получить результат из ЧЗ по маркировке", "Недопустимое состояние ФЗ: " + ФЗ.Состояние, "Ошибка");
			КонецЕсли;				
		КонецЕсли;			
	КонецЦикла; 
	
	Результат.Успешно = Истина;
	//
	Результат.ВремяВыполнения 		= (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000;
	//
	Если ЭтоАдресВременногоХранилища(АдресВозврата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресВозврата);			
	КонецЕсли;
	
	Возврат Результат;


КонецФункции // ПолучитьРезультаты_ОперМаркировки()

Процедура СформироватьВнутреннееУведомлениеОбОшибке(ТекстПисьма,ТемаПисьма, Основание = "Регламент по обработке Заказов КМ") Экспорт

	СписокПолучателей = Новый СписокЗначений; 	
	СписокПолучателей.Добавить("mark@collant.ru");
		
	СформироватьВнутреннееУведомление(СписокПолучателей, ТекстПисьма, ТемаПисьма,Основание); 

КонецПроцедуры

//--Данилова Е.В. 09.04.2025 
//++Данилова Е.В. 29.05.2026 MARK-3615

Функция КомплектСпайка_ПоПеремаркировке(Знач ДокСсылка) Экспорт 
	
	ВидКомплекта = ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(ДокСсылка, "ВидКомплекта");
	ДокументОснование = ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(ДокСсылка, "ДокументОснование");
	Результат = ВидКомплекта = Перечисления.ВидыКомплектов.Комплект И Типзнч(ДокументОснование) = Тип(
		"ДокументСсылка.Перемаркировка");
	
	Возврат Результат; 

КонецФункции 
//--Данилова Е.В. 29.05.2026 
//++Данилова Е.В. 03.06.2025  MARK-2355
Функция КомплектСпайка_Импорт(Знач докСсылка) Экспорт 
	
	Реквизиты = ПолучитьРеквизитыШапки(ДокСсылка,"ВидКомплекта,СпособВводаВОборот"); 

	Возврат Реквизиты.ВидКомплекта = Перечисления.ВидыКомплектов.Комплект И Реквизиты.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Импорт; 

КонецФункции // КомплектСпайка_Импорт() 

Функция СпособВводаВОборотДляСпайкиПоВидуКомплекта(ПараметрыДокумента) Экспорт     
	//Валетов + 26,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3546
	//Если НЕ ПараметрыДокумента.ВидКомплекта = Перечисления.ВидыКомплектов.Комплект Тогда
	Если ПараметрыДокумента.ВидКомплекта = Перечисления.ВидыКомплектов.Комплект 
		ИЛИ ПараметрыДокумента.ВидКомплекта = Перечисления.ВидыКомплектов.ГотовыйКомплект Тогда  
	ИначеЕсли ПараметрыДокумента.ВидКомплекта = Перечисления.ВидыКомплектов.Товар
		И ТипЗнч(ПараметрыДокумента.ДокументОснование) = Тип("ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ") 
		И ПараметрыДокумента.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Производство Тогда
		Возврат Перечисления.СпособыВводаВОборотСУЗ.Перемаркировка;
	Иначе
	//Валетов -	
		Возврат ПараметрыДокумента.СпособВводаВОборот; 	
	
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	РеквизитыСправочников.Справочник КАК Справочник,
	               |	РеквизитыСправочников.ИмяРеквизита КАК ИмяРеквизита,
	               |	РеквизитыСправочников.ЗначениеРеквизита КАК ЗначениеРеквизита
	               |ИЗ
	               |	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
	               |ГДЕ
	               |	РеквизитыСправочников.ИмяРеквизита = &ИмяРеквизита
	               |	И РеквизитыСправочников.ЗначениеРеквизита = &ЗначениеРеквизита
	               |	И РеквизитыСправочников.Справочник = &Организация";
	Запрос.УстановитьПараметр("ЗначениеРеквизита",истина);
	Запрос.УстановитьПараметр("ИмяРеквизита","Организация_импорт_спаек");
	Запрос.УстановитьПараметр("Организация",ПараметрыДокумента.Организация); 
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	ОрганизацияИмпорт = НЕ РезультатЗапроса.Пустой();   
	
    ДокОснованиеИмпорт = ТипЗнч(ПараметрыДокумента.ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") 
	ИЛИ  ТипЗнч(ПараметрыДокумента.ДокументОснование) = Тип("ДокументСсылка.КонтрактСПроизводителем");
	
	Если ОрганизацияИмпорт 
		ИЛИ ДокОснованиеИмпорт Тогда
	
		Возврат Перечисления.СпособыВводаВОборотСУЗ.Импорт; 	
	Иначе 
		Возврат Перечисления.СпособыВводаВОборотСУЗ.Производство;
	КонецЕсли;
КонецФункции


//--Данилова Е.В. 03.06.2025 

#Область ОбменДанными

Функция ПолучитьПравилоВыгрузки(ДопПараметры = Неопределено) Экспорт	
	ОперИмпорта					= "Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ";
	ОперИмпорта_Представление   = "ЗаказКМ";
	
	ИмяТаблицы_Тек	= "Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ";	
	ИмяТаблицы_Ист	= "Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ";
	
	МетаОбъект 		= Метаданные.НайтиПоПолномуИмени(ИмяТаблицы_Тек);
	
	ЗапросыИст = ОбменДаннымиЧЗ.СоздатьТаблицуИменЗапросов();	
	
	#Область ВТ_Ссылки
	
	ТекстЗапросаИзменений = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка
	|ИЗ	
	|	" + ИмяТаблицы_Ист + ".Изменения
	|ГДЕ
	|	Узел = &УзелПолучатель	
	|";
	
	ТекстЗапроса = "
	|ВЫБРАТЬ 
	|	Ссылка	
	|ПОМЕСТИТЬ ВТ_Ссылки
	|ИЗ	
	|	" + ИмяТаблицы_Ист + "
	|ГДЕ
	|	Ссылка В (&МассивСсылок)
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|";	
	
	ОбменДаннымиЧЗ.ДобавитьИмяТаблицы(ЗапросыИст, "ВТ_Ссылки", ТекстЗапроса, Ложь);
	
	#КонецОбласти
	
	#Область Шапка
	
	Поля = Новый Массив;
	Поля.Добавить("Шапка.Ссылка,Шапка.Номер,Шапка.Дата,Шапка.Проведен,Шапка.ПометкаУдаления");
	Для Каждого МетаРекв Из МетаОбъект.Реквизиты Цикл
		Поля.Добавить("Шапка." + МетаРекв.Имя);			
	КонецЦикла; 
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	" + СтрСоединить(Поля, ",") + "
    |ИЗ	
	|	" + ИмяТаблицы_Ист + " КАК Шапка
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	ВТ_Ссылки ПО ВТ_Ссылки.Ссылка = Шапка.Ссылка
	|УПОРЯДОЧИТЬ ПО 
	|	Дата,Номер
	|";	                                      
	ОбменДаннымиЧЗ.ДобавитьИмяТаблицы(ЗапросыИст, "Шапка", ТекстЗапроса, Истина, Ложь);	
	
	#КонецОбласти
	
	#Область ТЧ_Товары		
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТЧ.*
	|ИЗ	
	|	" + ИмяТаблицы_Ист + ".Товары КАК ТЧ
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	ВТ_Ссылки ПО ВТ_Ссылки.Ссылка = ТЧ.Ссылка
	|";
	
    ОбменДаннымиЧЗ.ДобавитьИмяТаблицы(ЗапросыИст, "ТЧ_Товары", ТекстЗапроса, Истина, Истина);
	
	#КонецОбласти

	Возврат Новый Структура("РазмерПорции,ТекстЗапросаИзменений,ЗапросыИст,ОперИмпорта,ОперИмпорта_Представление", 1000, ТекстЗапросаИзменений, ЗапросыИст, ОперИмпорта, ОперИмпорта_Представление);
КонецФункции //Экспорт

Функция ЗагрузитьДанныеПакета(ДанныеПакета, Отправитель, ДопПараметры = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	фПерезаписывать = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "фПерезаписывать", Ложь);
	
	Таблицы	= МаркировкаКС.ПолучитьЗначениеПараметра(ДанныеПакета, "Таблицы");
	
	Шапка 		= Неопределено;
	ДанныеТЧ 	= Новый Соответствие;
	
	Для Каждого КиЗ Из Таблицы Цикл		
		Если СтрНачинаетсяС(КиЗ.Ключ,"ТЧ_") Тогда
			КиЗ.Значение.Индексы.Добавить("Ссылка");
			ДанныеТЧ[Сред(КиЗ.Ключ, 4)] = КиЗ.Значение;
		ИначеЕсли КиЗ.Ключ = "Шапка" Тогда
			Шапка = КиЗ.Значение;			
		КонецЕсли;		
	КонецЦикла;	  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Шапка ИЗ &Шапка КАК Шапка
	|;
	|ВЫБРАТЬ
	|	IsNULL(Ссылка.ВерсияДанных,"""") КАК ВерсияДанных,
	|	*
	|ИЗ
	|	ВТ_Шапка
	|ГДЕ
	|	Ссылка.ВерсияДанных ЕСТЬ NULL	
	|	ИЛИ &фПерезаписывать
	|";  
	
	Запрос.УстановитьПараметр("Шапка", 				Шапка);
	Запрос.УстановитьПараметр("фПерезаписывать",	фПерезаписывать);
	
	Менеджер = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ;
	
	Выборка 	= Запрос.Выполнить().Выбрать();
	
	ВсегоСтрок	= Выборка.Количество();
	Сч			= 0;
	ОшибокЗаписи = 0;
	
	Начало 		= ТекущаяУниверсальнаяДатаВМиллисекундах();
	СовсемНачало= Начало;
	
	Пока Выборка.Следующий() Цикл
		#ЕСЛИ КЛИЕНТ ТОГДА
		ОбработкаПрерыванияПользователя();
		#КОНЕЦЕСЛИ
		
		Если ЗначениеЗаполнено(Выборка.ВерсияДанных) Тогда
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();			
		Иначе			
			ДокОбъект = Менеджер.СоздатьДокумент();		
			ДокОбъект.УстановитьСсылкуНового(Выборка.Ссылка);
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ДокОбъект, Выборка, , "Ссылка");		
		
		Для Каждого КиЗ Из ДанныеТЧ Цикл
			СтрокиТЧ = КиЗ.Значение.НайтиСтроки(Новый Структура("Ссылка", Выборка.Ссылка));		
			
			ТЧ_Объекта = ДокОбъект[КиЗ.Ключ];
			
			ТЧ_Объекта.Очистить();			
			Для Каждого СтрокаТЧ_Ист Из КиЗ.Значение.НайтиСтроки(Новый Структура("Ссылка", Выборка.Ссылка)) Цикл
				СтрокаТЧ_Тек = ТЧ_Объекта.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЧ_Тек, СтрокаТЧ_Ист);			
			КонецЦикла; 
		КонецЦикла;
		
		ДокОбъект.ДополнительныеСвойства.Вставить("ОтключитьЖурнализациюЗаписи", Истина);
		ДокОбъект.ОбменДанными.Загрузка 	= Истина;
		ДокОбъект.ОбменДанными.Отправитель	= Отправитель;
		
		Попытка
			ДокОбъект.Записать();		
			Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;
		Исключение
			ОшибокЗаписи = ОшибокЗаписи + 1;
		КонецПопытки;		
		
		Сч = Сч + 1;
		Если Сч % 100 = 0 Тогда
			ТекстСообщения = СтрШаблон("Загрузка Заказов КМ. Загружено: %1 из %2 документов.", Сч, ВсегоСтрок);
			инт_ДлительныеОперации.СообщитьПрогресс(Формат(100*Сч/ВсегоСтрок, "ЧДЦ=2"), ТекстСообщения);		
		КонецЕсли;
		
		Если Сч % 1000 = 0 Тогда
			Время = (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000;
			ТекстСообщения = СтрШаблон("Записано 1000 Заказов КМ. Время выполнения: %1, скорость записи: %2 док/с.", Время, Формат(1000 / Время, "ЧДЦ=0"));			
			ЗаписатьВЛог("Загрузка Заказов КМ", ТекстСообщения, "Информация", , , Время);
			
			Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
		КонецЕсли;		
	КонецЦикла;
	
	Результат.ОбработаноОбъектов = Шапка.Количество();Результат.Вставить("ПрочитаноОбъектов", Шапка.Количество()); 
	Результат.Вставить("ОшибокЗаписи", 		ОшибокЗаписи);
	
	Время = (ТекущаяУниверсальнаяДатаВМиллисекундах() - СовсемНачало)/1000;
	ТекстСообщения = СтрШаблон("Окончание загрузки пакета. Прочитано: %1, записано: %2, ошибок записи: %3.",  Результат.ПрочитаноОбъектов, Результат.ОбработаноОбъектов, ОшибокЗаписи);
	ЗаписатьВЛог("Загрузка Заказов КМ", ТекстСообщения, "Информация", , , Время);
	
	Возврат Результат;	
КонецФункции //Функция ЗагрузитьДанныеПакета(ДанныеПакета, Отправитель, ДопПараметры = Неопределено) Экспорт

Функция ЗарегистрироватьКодыЗаказаКВыгрузке(ЗаказКМ, УзелПолучатель) Экспорт
	Если ЗначениеЗаполнено(УзелПолучатель) И ТипЗнч(УзелПолучатель) = Тип("ПланОбменаСсылка.ДанныеЧЗ") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Ссылка
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|ГДЕ
		|	ЗаказКМ = &ЗаказКМ
		|";
		
		Запрос.УстановитьПараметр("ЗаказКМ", ЗаказКМ);
		
		ОбменДаннымиЧЗ.УстановитьПолучателей(УзелПолучатель, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	КонецЕсли;
КонецФункции //ЗарегистрироватьКодыЗаказаКВыгрузке(ЗаказКМ, УзелПолучатель) Экспорт

#КонецОбласти