#Область СлужебныеПроцедурыИФункции
#Область Заполнение_объектов

Процедура ЗаполнениеОбъекта(ИмяКоманды, ЭтаФорма) Экспорт
	
	////Если Объект.Ссылка.Пустая() Тогда
	////	Возврат;
	////КонецЕсли;

	ОбработкаСсылка = ПодключаемыеКомандыВызовСервера.ПолучитьСсылкуНаОбработку(ИмяКоманды, "ЗаполнениеОбъекта_");

	ПараметрыОтбора = Новый Структура("Ссылка", ОбработкаСсылка);
	СтрокиТЧ = ЭтаФорма.ТабличныеЧастиДляЗаполнения.НайтиСтроки(ПараметрыОтбора);
	Если СтрокиТЧ.Количество() > 0 Тогда
		ИмяТабличнойЧасти = СтрокиТЧ[0].ИмяТабличнойЧасти;
	Иначе
		Возврат;
	КонецЕсли;

	ЗаполняемыйОбъект = Новый Структура;
	ЗаполняемыйОбъект.Вставить("Объект", ЭтаФорма.Объект);
	ЗаполняемыйОбъект.Вставить("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
	ЗаполняемыйОбъект.Вставить("ОбработкаСсылка", ОбработкаСсылка);
	ЗаполняемыйОбъект.Вставить("ЭтаФорма", ЭтаФорма);

	Оповещение = Новый ОписаниеОповещения("ЗаполнениеОбъекта_Окончание", ПодключаемыеКомандыКлиент, ЗаполняемыйОбъект);

	ТребуетсяОткрыватьФормуОбработки = ПодключаемыеКомандыВызовСервера.ТребуетсяОткрыватьФормуОбработкиЗаполнения(
		ОбработкаСсылка);

	Если ТребуетсяОткрыватьФормуОбработки Тогда
		//*******для управляемых  форм
		//ИмяОбработки = ПодключаемыеКомандыВызовСервера.ПодключитьДополнительнуюОбработку(ОбработкаСсылка);
		//  ИмяФормы = "ВнешняяОбработка.#ИмяОбработки#.Форма";
		//ИмяФормы = СтрЗаменить(ИмяФормы, "#ИмяОбработки#", ИмяОбработки);

		//ПараметрыФормы = Новый Структура;

		//ПараметрыЗаполнения = ПодключаемыеКомандыВызовСервера.ПолучитьПараметрыЗаполнения(ОбработкаСсылка,
		//	ЭтаФорма.Объект.Ссылка, ИмяТабличнойЧасти);
		//ПараметрыФормы.Вставить("ПараметрыЗаполнения", ПараметрыЗаполнения);

		//ПараметрыФормы.Вставить("НастройкиЗаполнения",
		//	ПодключаемыеКомандыВызовСервера.ПолучитьНастройкиОбработкиЗаполнения(ОбработкаСсылка));

		//ПараметрыФормы.Вставить("ОбработкаСсылка", ОбработкаСсылка);

		//ОткрытьФорму(ИмяФормы, ПараметрыФормы, ЭтаФорма, , , , Оповещение);
		
		//*******для обычных  форм для толстого клиента
		
		ИмяФайлаОбработки = ПодключаемыеКомандыВызовСервера.ВернутьПолныйПутьКОбработке(ОбработкаСсылка);
		ФайлОбработки		=Новый Файл(ИмяФайлаОбработки);
		Если ФайлОбработки.Существует() Тогда 
			ОбработкаОбъект = ВнешниеОбработки.Создать(ИмяФайлаОбработки); 
		Иначе
			Возврат; 
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(ОбработкаСсылка.ИмяФормы) Тогда
			ИмяФормы = ОбработкаСсылка.ИмяФормы; 
		Иначе 
			ИмяФормы = "Форма"; 
		КонецЕсли; 
		ФормаОбработки = ОбработкаОбъект.ПолучитьФорму(ИмяФормы);
		ФормаОбработки.ДокОбъект = ЗаполняемыйОбъект.Объект;  
		ФормаОбработки.Открыть(); 

	Иначе
		// получаем данные заполнения из модуля обработки
		ДанныеЗаполнения = ПодключаемыеКомандыВызовСервера.ЗаполнениеОбъекта(ОбработкаСсылка, ЭтаФорма.Объект.Ссылка,
			ИмяТабличнойЧасти);

		РезультатЗакрытия = Новый Структура;
		РезультатЗакрытия.Вставить("ДанныеЗаполнения", ДанныеЗаполнения);
		РезультатЗакрытия.Вставить("АдресНастроек", "");

		ВыполнитьОбработкуОповещения(Оповещение, РезультатЗакрытия);

	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнениеОбъекта_Окончание(РезультатЗакрытия, ЗаполняемыйОбъект) Экспорт

	Если РезультатЗакрытия = КодВозвратаДиалога.Отмена Или РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(РезультатЗакрытия) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	// заполним табличную часть объекта
	ЗаполняемыйОбъект.Объект[ЗаполняемыйОбъект.ИмяТабличнойЧасти].Очистить();

	Для Каждого СтрокаТаблицы Из РезультатЗакрытия.ДанныеЗаполнения Цикл
		НоваяСтр = ЗаполняемыйОбъект.Объект[ЗаполняемыйОбъект.ИмяТабличнойЧасти].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтр, СтрокаТаблицы);
	КонецЦикла;
	
	// признак модифицированности у формы
	ЗаполняемыйОбъект.ЭтаФорма.Модифицированность = Истина;
	
	// сохраним настройки, с которыми была заполнена ТЧ
	ПодключаемыеКомандыВызовСервера.ЗаписатьНастройкиОбработкиЗаполнения(ЗаполняемыйОбъект.ОбработкаСсылка,
		РезультатЗакрытия.АдресНастроек);	
	

КонецПроцедуры

// исполняет СКД и закрывает форму с параметром - данными для заполнения и адресом настроек в хранилище
Процедура ВыполнитьЗаполнениеОбъекта(ЭтаФорма) Экспорт

	ДанныеЗаполнения = ЭтаФорма.ЗаполнитьНаСервере();

	РезультатЗакрытия = Новый Структура;
	РезультатЗакрытия.Вставить("ДанныеЗаполнения", ДанныеЗаполнения);
	РезультатЗакрытия.Вставить("АдресНастроек", ЭтаФорма.АдресНастроек);

	ЭтаФорма.Закрыть(РезультатЗакрытия);

КонецПроцедуры

Процедура ОтменаЗаполнениеОбъекта(ЭтаФорма) Экспорт
	ЭтаФорма.Закрыть();
КонецПроцедуры

#КонецОбласти
#КонецОбласти
