Функция УстановитьДЗРпоДДСпоАвансам(Дата) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	БылаДата = Константы.ДатаЗапретаРедактированияДДСпоАвансовымДоговорам.Получить();
	Константы.ДатаЗапретаРедактированияДДСпоАвансовымДоговорам.Установить(Дата);
	
	ТекстЛога		= СтрШаблон("Изменена ДЗР по ДДС по авансам. Старая дата: %1, новая дата: %2.", Формат(БылаДата, "ДФ=dd.MM.yyyy"), Формат(Дата, "ДФ=dd.MM.yyyy"));
	ТипСообщения	= ТипСообщенияЖурнала(БылаДата, Дата);
	
	ЗаписатьВЛог("Авансы покупателей", ТекстЛога, ТипСообщения); 
КонецФункции //УстановитьДЗРпоДДСпоАвансам(Дата) Экспорт

Функция УстановитьДЗРпоРНКпоАвансам(Дата) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	БылаДата = Константы.ДатаЗапретаРедактированияРНКпоАвансовымДоговорам.Получить();
	Константы.ДатаЗапретаРедактированияРНКпоАвансовымДоговорам.Установить(Дата);
	
	ТекстЛога		= СтрШаблон("Изменена ДЗР по РНК по авансам. Старая дата: %1, новая дата: %2.", Формат(БылаДата, "ДФ=dd.MM.yyyy"), Формат(Дата, "ДФ=dd.MM.yyyy"));
	ТипСообщения	= ТипСообщенияЖурнала(БылаДата, Дата);
	
	ЗаписатьВЛог("Авансы покупателей", ТекстЛога, ТипСообщения); 
КонецФункции //УстановитьДЗРпоРНКпоАвансам(Дата) Экспорт

Функция ТипСообщенияЖурнала(СтараяДата, НоваяДата)
	Возврат ?(НоваяДата < СтараяДата, "Предупреждение", "Информация");
КонецФункции //ТипСообщенияЖурнала(СтараяДата, НоваяДата)

Функция ПолучитьАвансовыеДоговора(ДоговораСсылки) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ	
	|	Ссылка
	|ИЗ
	|	Справочник.Договоры
	|ГДЕ
	|	Ссылка В (&ДоговораСсылки)
	|	И УсловияОплаты = ЗНАЧЕНИЕ(Перечисление.УсловияОплаты.Предоплата)
	|	И ВидДоговора_Новый = ЗНАЧЕНИЕ(Справочник.ВидыДоговоров.Товары_Продажа)
	|";		
	
	Запрос.УстановитьПараметр("ДоговораСсылки", ДоговораСсылки);
	
	АвансовыеДоговора = Новый Соответствие;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		АвансовыеДоговора[Выборка.Ссылка] = Истина;
	КонецЦикла;
	
	Возврат АвансовыеДоговора;
КонецФункции //ПолучитьАвансовыеДоговора(мДоговора) Экспорт