
Процедура ПриСозданииНаСервере(ОбъектСсылка, ЭтаФорма) Экспорт
	
	ТипОбъекта = ТипЗнч(ОбъектСсылка);
	ВыборкаНазначенияСвойств = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Выбрать();
	Пока ВыборкаНазначенияСвойств.Следующий() Цикл
		Если ВыборкаНазначенияСвойств.ТипЗначения.СодержитТип(ТипОбъекта) Тогда
			НазначениеСвойства = ВыборкаНазначенияСвойств.Ссылка;
		КонецЕсли;
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СвойстваОбъектов.Ссылка 			КАК Ссылка,
	|	СвойстваОбъектов.Наименование	 	КАК Наименование,
	|	СвойстваОбъектов.ТипЗначения 		КАК ТипЗначения,
	|	ЗначенияСвойствОбъектов.Значение 	КАК Значение
	|ИЗ
	|	ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектов
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ПО 
	|	СвойстваОбъектов.Ссылка = ЗначенияСвойствОбъектов.Свойство
	|	И (ЗначенияСвойствОбъектов.Объект = &ОбъектСсылка)
	|ГДЕ
	|	СвойстваОбъектов.НазначениеСвойства = &НазначениеСвойства
	|	И НЕ СвойстваОбъектов.ПометкаУдаления
	|	И СвойстваОбъектов.Наименование ПОДОБНО ""%(ФР)""
	|";
	
	Запрос.УстановитьПараметр("НазначениеСвойства", НазначениеСвойства);
	Запрос.УстановитьПараметр("ОбъектСсылка",		ОбъектСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДобавляемыеРеквизиты	= Новый Массив;
	ЗначенияРеквизитов		= Новый Структура;
	
	Пока Выборка.Следующий() Цикл
		
		ИмяРеквизита = "ДополнительныйРеквизит_" + СтрЗаменить(Строка(Выборка.Ссылка.УникальныйИдентификатор()), "-", "_");
		РеквизитФормы = Новый РеквизитФормы(ИмяРеквизита, Выборка.ТипЗначения,, Выборка.Наименование);
		
		ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
		
		ЗначенияРеквизитов.Вставить(ИмяРеквизита, Выборка.Значение);
		
	КонецЦикла;
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Для Каждого ДополнительныйРеквизит Из ДобавляемыеРеквизиты Цикл
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить(ДополнительныйРеквизит.Имя, Тип("ПолеФормы"), ЭтаФорма.Элементы.ГруппаДополнительныеРеквизиты);
		НовыйЭлемент.ПутьКДанным			= ДополнительныйРеквизит.Имя;
		НовыйЭлемент.Вид					= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.АвтоМаксимальнаяШирина	= Ложь;
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ЗначенияРеквизитов);
	
КонецПроцедуры

Процедура ПослеЗаписиНаСервере(ОбъектСсылка, ЭтаФорма) Экспорт
	
	НаборЗаписей = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(ОбъектСсылка);
	
	Для Каждого РеквизитФормы Из ЭтаФорма.ПолучитьРеквизиты() Цикл
		Если СтрНайти(РеквизитФормы.Имя, "ДополнительныйРеквизит_") > 0 Тогда
			
			СвойствоГУИДСтрока = СтрЗаменить(РеквизитФормы.Имя, "ДополнительныйРеквизит_", "");
			СвойствоГУИДСтрока = СтрЗаменить(СвойствоГУИДСтрока, "_", "-");
			СвойствоГУИД = Новый УникальныйИдентификатор(СвойствоГУИДСтрока);
			
			Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ПолучитьСсылку(СвойствоГУИД);
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Объект		= ОбъектСсылка;
			НоваяЗапись.Свойство	= Свойство;
			НоваяЗапись.Значение	= ЭтаФорма[РеквизитФормы.Имя];
			
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры