Функция КодЧЗ(ВидОперации) Экспорт
	Результат = "";
	
	Если ВидОперации = Перечисления.ВидыОперацийИСМП.ВводВОборот_Импорт Тогда
		Результат = "LP_FTS_INTRODUCE";	
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийИСМП.ВводВОборот_МаркировкаОстатков Тогда
		Результат = "LP_INTRODUCE_OST";	
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ВозвратФизическомуЛицу Тогда
		Результат = "RETURN";			
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ДистанционнаяПродажа Тогда
		Результат = "DISTANCE";			
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ИспользованиеДляСобственныхНужд Тогда
		Результат = "OWN_USE";			
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_Конфискация Тогда
		Результат = "CONFISCATION";			
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ПродажаПоОбразцам Тогда
		Результат = "BY_SAMPLES";
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ПродажаПоГосударственномуКонтракту Тогда
		Результат = "STATE_CONTRACT";                                                              
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ПродажаПоСделкеСГосударственнойТайной Тогда
		Результат = "STATE_SECRET";
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_Прочее Тогда
		Результат = "OTHER";		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_РозничнаяПродажа Тогда		
		Результат = "RETAIL";					
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ТрансграничнаяПродажаВСтраныЕАЭС Тогда		
		Результат = "EAS_TRADE";					
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_Уничтожение Тогда		
		Результат = "DESTRUCTION";
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_Утилизация Тогда		
		Результат = "UTILIZATION";
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_Утрата Тогда		
		Результат = "LOSS";                                             
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ЭкспортЗаПределыСтранЕАЭС Тогда		
		Результат = "BEYOND_EEC_EXPORT";	
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_Утрата Тогда
		Результат = "KM_LOST";
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийИСМП.СписаниеНеНанесенных_Испорчен Тогда
		Результат = "KM_SPOILED";
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийИСМП.СписаниеНеНанесенных_Утерян Тогда
		Результат = "KM_LOST";	
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийИСМП.СписаниеНеНанесенных_Уничтожен Тогда
		Результат = "KM_DESTROYED";
	ИначеЕсли ВидОперации = ВозвратВОборот_Возврат_ДистанционнаяПродажа Тогда
		Результат = "REMOTE_SALE_RETURN";
	ИначеЕсли ВидОперации = ВозвратВОборот_Возврат_РозничнаяРеализация Тогда
		Результат = "RETAIL_RETURN";
	ИначеЕсли ВидОперации = ВозвратВОборот_Возврат_ИспользованиеДляСобственныхНужд Тогда
		Результат = "OWN_USE_RETURN";
	ИначеЕсли ВидОперации = ВозвратВОборот_Возврат_ИспользованиеДляПроизводственныхЦелей Тогда
		Результат = "PRODUCTION_USE_RETURN";
	ИначеЕсли ВидОперации = ВозвратВОборот_Возврат_ПриобретениеНеДляПерепродажи Тогда
		Результат = "NOT_FOR_SALE_RETURN";
	ИначеЕсли ВидОперации = ВозвратВОборот_Возврат_ПродажаЧерезВендинг Тогда
		Результат = "VENDING_RETURN";	
	ИначеЕсли ВидОперации = Перемаркировка_ВозвратБезКМ Тогда
		Результат = "RETAIL_RETURN";
	ИначеЕсли ВидОперации = Перемаркировка_ВозвратБезКМ_ДистПродажи Тогда
		Результат = "REMOTE_SALE_RETURN";
	ИначеЕсли ВидОперации = Перемаркировка_ВозвратОтКонечногоПокупателя Тогда
		Результат = "LEGAL_RETURN";
	ИначеЕсли ВидОперации = Перемаркировка_ВозвратРанееЭкспортированногоЕАЭС Тогда
		Результат = "EEC_EXPORT_RETURN";
	ИначеЕсли ВидОперации = Перемаркировка_ИспорченоЛибоУтеряно Тогда
		Результат = "KM_SPOILED";		
	ИначеЕсли ВидОперации = ТрансформацияУпаковки_Добавление Тогда
		Результат = "ADDING";
	ИначеЕсли ВидОперации = ТрансформацияУпаковки_Изъятие Тогда
		Результат = "REMOVING";
	ИначеЕсли ВидОперации = ФормированиеНабора Тогда
		Результат = "SETS_AGGREGATION";
	КонецЕсли; 	
	
	Возврат Результат;
КонецФункции //КодЧЗ(ВидОперации)

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ВидОперацииМаркировки = МаркировкаКС.ПолучитьЗначениеПараметра(Параметры, "ВидОперацииМаркировки");
	Если ВидОперацииМаркировки <> Неопределено Тогда
		СтандартнаяОбработка	= Ложь;		
		ДанныеВыбора			= Новый СписокЗначений;
		
		Строки = ТаблицаСоответствияВидовОпераций().НайтиСтроки(Новый Структура("ВидОперацииМаркировки", ВидОперацииМаркировки));
		Для Каждого Строка Из Строки Цикл		
			ДанныеВыбора.Добавить(Строка.ВидОперацииИСМП);
		КонецЦикла;		
	КонецЕсли;	
КонецПроцедуры

Функция ВидОперацииМаркировки(ВидОперацииИСМП) Экспорт
	Результат = Перечисления.ВидыОперацийМаркировки.ПустаяСсылка();
	
	Строка = ТаблицаСоответствияВидовОпераций().Найти(ВидОперацииИСМП, "ВидОперацииИСМП");
	Если Строка<>Неопределено Тогда
		Результат = Строка.ВидОперацииМаркировки; 	
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ВидОперацииМаркировки(ВидОперацииИСМП)

Функция ТаблицаСоответствияВидовОпераций()
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ВидОперацииИСМП");
	ТЗ.Колонки.Добавить("ВидОперацииМаркировки");	
	
	П2 = Перечисления.ВидыОперацийМаркировки;
	
	ДобавитьСтрокуСоответствия(Агрегация, 												П2.Агрегация, 		ТЗ);
	ДобавитьСтрокуСоответствия(АТК, 													П2.АТК, 			ТЗ);
	
	ДобавитьСтрокуСоответствия(ВводВОборот_Импорт, 										П2.ВводВОборот, 	ТЗ);
	ДобавитьСтрокуСоответствия(ВводВОборот_МаркировкаОстатков, 							П2.ВводВОборот, 	ТЗ);
	
	ДобавитьСтрокуСоответствия(ВыводИзОборота_ДистанционнаяПродажа,						П2.ВыводИзОборота, 	ТЗ);
	ДобавитьСтрокуСоответствия(ВыводИзОборота_РозничнаяПродажа, 						П2.ВыводИзОборота, 	ТЗ);	
	ДобавитьСтрокуСоответствия(ВыводИзОборота_Прочее, 									П2.ВыводИзОборота, 	ТЗ);	
	
	ДобавитьСтрокуСоответствия(ВыводИзОборота_Утрата, 									П2.ВыводИзОборота,	ТЗ);
	
	ДобавитьСтрокуСоответствия(ВыводИзОборота_БезвозмезднаяПередача, 					П2.ВыводИзОборота, 	ТЗ);
	ДобавитьСтрокуСоответствия(ВыводИзОборота_ВозвратФизическомуЛицу, 					П2.ВыводИзОборота, 	ТЗ);
	
	ДобавитьСтрокуСоответствия(ВыводИзОборота_ИспользованиеДляСобственныхНужд, 			П2.ВыводИзОборота,	ТЗ);
	ДобавитьСтрокуСоответствия(ВыводИзОборота_Конфискация, 								П2.ВыводИзОборота,	ТЗ);
	
	ДобавитьСтрокуСоответствия(ВыводИзОборота_ПродажаПоОбразцам, 						П2.ВыводИзОборота, 	ТЗ);
	ДобавитьСтрокуСоответствия(ВыводИзОборота_ПродажаПоГосударственномуКонтракту, 		П2.ВыводИзОборота, 	ТЗ);
	ДобавитьСтрокуСоответствия(ВыводИзОборота_ПродажаПоСделкеСГосударственнойТайной, 	П2.ВыводИзОборота, 	ТЗ);
	ДобавитьСтрокуСоответствия(ВыводИзОборота_ТрансграничнаяПродажаВСтраныЕАЭС, 		П2.ВыводИзОборота, 	ТЗ);
	
	ДобавитьСтрокуСоответствия(ВыводИзОборота_Уничтожение, 								П2.ВыводИзОборота,	ТЗ);
	ДобавитьСтрокуСоответствия(ВыводИзОборота_Утилизация, 								П2.ВыводИзОборота,	ТЗ);
	ДобавитьСтрокуСоответствия(ВыводИзОборота_ЭкспортЗаПределыСтранЕАЭС, 				П2.ВыводИзОборота, 	ТЗ);
	
	ДобавитьСтрокуСоответствия(СписаниеНеНанесенных_Испорчен, 							П2.Списание, 	ТЗ);
	ДобавитьСтрокуСоответствия(СписаниеНеНанесенных_Утерян,	 							П2.Списание, 	ТЗ);
	ДобавитьСтрокуСоответствия(СписаниеНеНанесенных_Уничтожен,							П2.Списание, 	ТЗ);	
	
	ДобавитьСтрокуСоответствия(ВозвратВОборот_Возврат_ДистанционнаяПродажа, 				П2.ВозвратВОборот, 	ТЗ);
	ДобавитьСтрокуСоответствия(ВозвратВОборот_Возврат_РозничнаяРеализация,					П2.ВозвратВОборот, 	ТЗ);
	ДобавитьСтрокуСоответствия(ВозвратВОборот_Возврат_ИспользованиеДляСобственныхНужд,		П2.ВозвратВОборот, 	ТЗ);
	ДобавитьСтрокуСоответствия(ВозвратВОборот_Возврат_ИспользованиеДляПроизводственныхЦелей,П2.ВозвратВОборот, 	ТЗ);
	ДобавитьСтрокуСоответствия(ВозвратВОборот_Возврат_ПриобретениеНеДляПерепродажи,			П2.ВозвратВОборот, 	ТЗ);
	ДобавитьСтрокуСоответствия(ВозвратВОборот_Возврат_ПродажаЧерезВендинг,					П2.ВозвратВОборот, 	ТЗ);
	
	ДобавитьСтрокуСоответствия(ОтгрузкаВЕАЭС,												П2.ОтгрузкаВЕАЭС, 		ТЗ);
	ДобавитьСтрокуСоответствия(ФормированиеНабора,											П2.ФормированиеНабора, 	ТЗ);
	
	ДобавитьСтрокуСоответствия(Перемаркировка_ВозвратБезКМ, 								П2.Перемаркировка, 	ТЗ);
	ДобавитьСтрокуСоответствия(Перемаркировка_ВозвратБезКМ_ДистПродажи, 					П2.Перемаркировка, 	ТЗ);
	ДобавитьСтрокуСоответствия(Перемаркировка_ВозвратОтКонечногоПокупателя, 				П2.Перемаркировка, 	ТЗ);
	ДобавитьСтрокуСоответствия(Перемаркировка_ВозвратРанееЭкспортированногоЕАЭС,			П2.Перемаркировка, 	ТЗ);
	ДобавитьСтрокуСоответствия(Перемаркировка_ИспорченоЛибоУтеряно,							П2.Перемаркировка, 	ТЗ);	
	
	ДобавитьСтрокуСоответствия(ТрансформацияУпаковки_Изъятие, 								П2.ТрансформацияУпаковки, 	ТЗ);
	ДобавитьСтрокуСоответствия(ТрансформацияУпаковки_Добавление,							П2.ТрансформацияУпаковки, 	ТЗ);	
	
	ДобавитьСтрокуСоответствия(ТрансформацияАТК_Изъятие, 									П2.ТрансформацияАТК, 	ТЗ);
	ДобавитьСтрокуСоответствия(ТрансформацияАТК_Добавление,									П2.ТрансформацияАТК, 	ТЗ);
	
	Возврат ТЗ;
КонецФункции //ТаблицаСоответствияВидовОпераций()

Функция ДобавитьСтрокуСоответствия(ВидОперацииИСМП, ВидОперацииМаркировки, ТЗ)
	СтрокаТЗ = ТЗ.Добавить();	
	
	СтрокаТЗ.ВидОперацииИСМП		= ВидОперацииИСМП;
	СтрокаТЗ.ВидОперацииМаркировки	= ВидОперацииМаркировки;
КонецФункции //ДобавитьСтрокуСоответствия(ВидОперацииИСМП, ВидОперацииМаркировки, ТЗ)

Функция ВидОперацииИСМП_СтатусКМ(ВидОперацииИСМП) Экспорт
	СтатусКМ = Неопределено;
	
	Если ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВводВОборот_Импорт Тогда
		СтатусКМ = Перечисления.СтатусыКодовМаркировкиИСМП.ВведенВОборот;			
	ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВводВОборот_МаркировкаОстатков Тогда
		СтатусКМ = Перечисления.СтатусыКодовМаркировкиИСМП.ВведенВОборот;
	ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ДистанционнаяПродажа Тогда
		СтатусКМ = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота_ДистанционнаяПродажа;				
	ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_РозничнаяПродажа Тогда
		СтатусКМ = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота_РозничнаяПродажа;				
	ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_Прочее Тогда
		СтатусКМ = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота_Списание;	
	ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_Утрата Тогда
		СтатусКМ = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота_УтратаИлиПовреждении
	ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_БезвозмезднаяПередача Тогда
		СтатусКМ = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота_БезвозмезднаяПередача;		
	ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ВозвратФизическомуЛицу Тогда                         
		СтатусКМ = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота_ВозвратФЛ;
	ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ИспользованиеДляСобственныхНужд Тогда
		СтатусКМ = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота_ИспользованиеДляСобственныхНужд;	
	ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_Конфискация Тогда
		СтатусКМ = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота_Конфискация;	
	ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ПродажаПоОбразцам Тогда
		
	ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ПродажаПоГосударственномуКонтракту Тогда
		СтатусКМ = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота_ПриобретениеГосПредприятием;			
	ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ПродажаПоСделкеСГосударственнойТайной Тогда                  
		СтатусКМ = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота_ПриобретениеГосПредприятием;		
	ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ТрансграничнаяПродажаВСтраныЕАЭС Тогда
		СтатусКМ = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота_ЭкспортВСтраныЕАЭС;	
	ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_Уничтожение Тогда
		СтатусКМ = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота_Уничтожен;
	ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_Утилизация Тогда                       
		СтатусКМ = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота_Уничтожен;		
	ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ЭкспортЗаПределыСтранЕАЭС Тогда	
		СтатусКМ = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота_ЭкспортЗаПределыСтранЕАЭС;	
	ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.СписаниеНеНанесенных_Испорчен 
		ИЛИ ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.СписаниеНеНанесенных_Утерян
		ИЛИ ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.СписаниеНеНанесенных_Уничтожен Тогда	
		СтатусКМ = Перечисления.СтатусыКодовМаркировкиИСМП.Списан;
	ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВозвратВОборот_Возврат_ДистанционнаяПродажа
		ИЛИ ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВозвратВОборот_Возврат_ИспользованиеДляПроизводственныхЦелей
		ИЛИ ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВозвратВОборот_Возврат_ИспользованиеДляСобственныхНужд
		ИЛИ ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВозвратВОборот_Возврат_ПриобретениеНеДляПерепродажи
		ИЛИ ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВозвратВОборот_Возврат_ПродажаЧерезВендинг
		ИЛИ ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВозвратВОборот_Возврат_РозничнаяРеализация Тогда
		СтатусКМ = Перечисления.СтатусыКодовМаркировкиИСМП.ВведенВОборот;
	ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.Перемаркировка_ВозвратБезКМ
		ИЛИ ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.Перемаркировка_ВозвратБезКМ_ДистПродажи
		ИЛИ ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.Перемаркировка_ВозвратОтКонечногоПокупателя
		ИЛИ ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.Перемаркировка_ВозвратРанееЭкспортированногоЕАЭС
		ИЛИ ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.Перемаркировка_ИспорченоЛибоУтеряно Тогда
		СтатусКМ = Перечисления.СтатусыКодовМаркировкиИСМП.ВведенВОборот;		
	КонецЕсли;

	//СтатусКМ = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота_ПоДоговоруРассрочки;
	//СтатусКМ = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота_Перемаркировка;
	//СтатусКМ = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота_Списание;
	
	Возврат СтатусКМ;
КонецФункции //ВидОперацииИСМП_СтатусКМ(ВидОперацииИСМП) Экспорт
