Процедура ПередЗаписью(Отказ, Замещение)
	ИсходныйНабор=РегистрыСведений.ПолномочияПользователей.СоздатьНаборЗаписей();
	Для Каждого ЭлементОтбора Из Отбор Цикл
		ЗаполнитьЗначенияСвойств(ИсходныйНабор.Отбор[ЭлементОтбора.Имя],ЭлементОтбора);
	КонецЦикла; 
	
	ИсходныйНабор.Прочитать();
	ТИН=ИсходныйНабор.Выгрузить();
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		СтрокаТИН=ТИН.Найти(Запись.Полномочие,"Полномочие");
		
		БылоЗначение=?(СтрокаТИН=Неопределено,Неопределено,СтрокаТИН.Значение);		
		Если БылоЗначение<>Запись.Значение Тогда
			//Функция ЗаписатьВЛог(ИмяЛога,Сообщение,ТипСообщения,ВыводитьСообщения=Ложь) Экспорт

			ЗаписатьВЛог("Полномочия","Изменено полномочие пользователя. Пользователь: "+СокрЛП(Запись.Пользователь)+",
										|полномочие: "+Запись.Полномочие+".
										|Старое значение:"+БылоЗначение+", новое значение: "+Запись.Значение,"Информация");	
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры
