
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ДанныеЗаполнения = Неопределено Тогда Возврат; КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		Запрос.УстановитьПараметр("ДанныеЗаполнения", ДанныеЗаполнения);
	Иначе
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
		ДокОснование = ДанныеЗаполнения;
		
		МассивДанныхЗаполнения = Новый Массив;
		МассивДанныхЗаполнения.Добавить(ДанныеЗаполнения);
		Запрос.УстановитьПараметр("ДанныеЗаполнения", МассивДанныхЗаполнения);
	КонецЕсли;
	
	УстановитьНовыйНомер();
	
	Возврат;
	//////////////////////////////////////////////////////////////////////////////////////////////////
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НомераГТД.ГТД КАК ГТД,
	|	НомераГТД.Модель.ТНВЭД КАК ТНВЭД,
	|	ЕСТЬNULL(НомераГТД.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(НомераГТД.Модель.ТНВЭД.НормативУтилизации, 0) КАК НормативУтилизации,
	|	ЕСТЬNULL(НомераГТД.Модель.ТНВЭД.СтавкаЭкологическогоСбора, 0) КАК СтавкаЭкологическогоСбора,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НомераГТД.Модель.ВесНетто, 0) <> 0
	|			ТОГДА ЕСТЬNULL(НомераГТД.Модель.ВесНетто, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВесНетто,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НомераГТД.Модель.ВесБрутто, 0) <> 0
	|			ТОГДА ЕСТЬNULL(НомераГТД.Модель.ВесБрутто, 0)
	|		ИНАЧЕ ЕСТЬNULL(НомераГТД.Модель.ВесБруттоШтуки, 0)
	|	КОНЕЦ КАК ВесБрутто,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НомераГТД.Модель.ВесНетто, 0) <> 0
	|			ТОГДА ЕСТЬNULL(НомераГТД.Модель.ВесНетто, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ * ЕСТЬNULL(НомераГТД.Модель.ТНВЭД.НормативУтилизации, 0) * ЕСТЬNULL(НомераГТД.Модель.ТНВЭД.СтавкаЭкологическогоСбора, 0) КАК Всего
	|ИЗ
	|	Документ.Машина.НомераГТД КАК НомераГТД
	|ГДЕ
	|	НомераГТД.Ссылка В(&ДанныеЗаполнения)";
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеГТД.Загрузить(Запрос.Выполнить().Выгрузить());
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ДокОснование = Неопределено;
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Если ЗначениеЗаполнено(ДокОснование) Тогда
		Префикс = ЗаполнениеДокументов.ПользовательскийПрефикс(СокрЛП(ДокОснование.Номер));
	КонецЕсли;
	
КонецПроцедуры
