// Кухарь А.Ю. 19.03.2021 начало
// Замер времени. В хранилище не ставить
Перем ТребуетсяЗамерВремени;
Перем ДатаНачалаЗамера;
// Кухарь А.Ю. 19.03.2021 конец


//нечаева 02,09,16+++
Перем НужноВыгружать;
//нечаева 02,09,16---

// Кухарь А.Ю. 05.03.2021 начало
Перем ТЗНеизменяемыхРеквизитов; 
// Кухарь А.Ю. 05.03.2021 конец


// Кухарь А.Ю. 03.05.2025 начало
// Кельманов А.В. - HELP-6313 - 2025.12.09 {
//Функция ДобавитьСтрокуВПаллету(Знач Данные, Знач ЛистНабора, Знач НомерКоробки)  Экспорт
Функция ДобавитьСтрокуВПаллету(Знач Данные, Знач ЛистНабора, Знач НомерКоробки, ЭтоВычитание = Ложь) Экспорт
// Кельманов А.В. - HELP-6313 - 2025.12.09 }
	
	//Перем Документ, ЕстьОшибки, НайденнаяСтрока, НастоящийПунктДоставки, СтрокаТЧ;
	СтруктураВозврата=новый Структура("Ошибки,Успех",Новый Массив,Ложь);
	
	Документ = ПолучитьРеквизитШапки(ЛистНабора,"ДокОснование","Документ");
	Если Документ.Метаданные().Имя = "РасходнаяНакладная" Тогда
		НастоящийПунктДоставки = ?(Документ.ПунктПерегруза.Пустая(),Документ.ПунктДоставки,Документ.ПунктПерегруза);
	Иначе
		Если Документ.ПунктДоставки.ПунктПерегруза.пустая() Тогда
			НастоящийПунктДоставки = Документ.ПунктДоставки;
		Иначе
			НастоящийПунктДоставки = Документ.ПунктДоставки.ПунктПерегруза;
		КонецЕсли;
	КонецЕсли;   
	
	Если НЕ ПунктДоставки.Пустая() И ПунктДоставки <> НастоящийПунктДоставки Тогда
		если документ.контрагент.код<>"SSP-3698" 
			и  документ.контрагент.Родитель.код<>"SSR-9551" тогда
			СтруктураВозврата.Ошибки.Добавить("Не совпадает пункт доставки паллеты и листа набора! ЛН: "+ЛистНабора+ " к документу "+Документ);
			Возврат СтруктураВозврата;	
		КонецЕсли;
	КонецЕсли;  
	
	Если ДатаОтгрузки <> '00010101' И ДатаОтгрузки <> Документ.ДатаОтгрузки Тогда
		СтруктураВозврата.Ошибки.Добавить("Не совпадает дата отгрузки паллеты и листа набора! ЛН: "+ЛистНабора+ " к документу "+Документ);
		Возврат СтруктураВозврата;
	КонецЕсли;
	Если НЕ ЛистНабора.Проведен Тогда
		СтруктураВозврата.Ошибки.Добавить("Лист набора не проведен! ЛН: "+ЛистНабора+ " к документу "+Документ);
		Возврат СтруктураВозврата;
	КонецЕсли;
	Если НЕ Документ.Проведен Тогда
		СтруктураВозврата.Ошибки.Добавить("Документ отгрузки не проведен! ЛН: "+ЛистНабора+ " к документу "+Документ);
		Возврат СтруктураВозврата;
	КонецЕсли;
	Если Документ.Склад.Подразделение <> Подразделение Тогда
		СтруктураВозврата.Ошибки.Добавить("Недопустимый склад :("+Документ.Склад+") документа отгрузки! ЛН: "+ЛистНабора+ " к документу "+Документ);	
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	ДатаОтгрузки = Документ.ДатаОтгрузки;
	ПунктДоставки = НастоящийПунктДоставки;
	НайденнаяСтрока = Неопределено;
	Для Каждого СтрокаТЧ Из ЛистыНабора Цикл
		Если СтрокаТЧ.ЛистНабора = ЛистНабора И СтрокаТЧ.Описание = ""+НомерКоробки Тогда
			НайденнаяСтрока = СтрокаТЧ;	
		КонецЕсли;
	КонецЦикла;
	
	Если Документ.СостояниеНакладной <> Перечисления.СостоянияНакладной.ОжиданиеПаллетирования
		И Документ.СостояниеНакладной <> Перечисления.СостоянияНакладной.Паллетирование
		И Документ.СостояниеНакладной <> Перечисления.СостоянияНакладной.ОжиданиеТермоусадки
		И Документ.СостояниеНакладной <> Перечисления.СостоянияНакладной.Термоусадка 
		И Документ.СостояниеНакладной <> Перечисления.СостоянияНакладной.ГотоваКОтгрузке Тогда
		СтруктураВозврата.Ошибки.Добавить("Паллеты создаются в состоянии Ожидание паллетирование\Паллетирование\Ожидание термоусадки\Термоусадка, Готова к отгрузке.");
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	если РеальноеПаллетирование и ЛистыНабора.Количество()>0 и ДокОснование<>Документ тогда
		СтруктураВозврата.Ошибки.Добавить("Паллета привязана к другой накладной - "+ДокОснование.Метаданные().Имя+" "+ДокОснование.Номер);
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Если НайденнаяСтрока = Неопределено Тогда
		// Кельманов А.В. - HELP-6313 - 2025.12.09 {
		Если ЭтоВычитание Тогда
			СтруктураВозврата.Ошибки.Добавить("Вычитаемая коробка не найдена!");	
			Возврат СтруктураВозврата;					
		КонецЕсли;
		// Кельманов А.В. - HELP-6313 - 2025.12.09 }
		НайденнаяСтрока = ЛистыНабора.Добавить();   
	Иначе
		// Кельманов А.В. - HELP-6313 - 2025.12.09 {
		Если ЭтоВычитание Тогда
			СтруктураВозврата.Успех = Истина;
			ЛистыНабора.Удалить(НайденнаяСтрока);
			Возврат СтруктураВозврата;					
		КонецЕсли;
		// Кельманов А.В. - HELP-6313 - 2025.12.09 }
		Если ЛистыНабора.Индекс(НайденнаяСтрока)+1=ЛистыНабора.Количество() Тогда
		Иначе
			СтруктураВозврата.Ошибки.Добавить("2й раз отсканировали ШК от коробки "+НомерКоробки+" .Нужно проверить что эту коробку не положили 2й раз.");	
			Возврат СтруктураВозврата;					
		КонецЕсли;	
	КонецЕсли;
	НайденнаяСтрока.ЛистНабора = ЛистНабора;
	НайденнаяСтрока.ШКЛистаНабора = Данные;
	НайденнаяСтрока.Получатель = Документ.ПунктДоставки.Владелец;
	НайденнаяСтрока.Документ = Документ;
	НайденнаяСтрока.ПунктДоставки = Документ.ПунктДоставки;
	НайденнаяСтрока.ВремяСканирования = ТекущаяДата();
	НайденнаяСтрока.Описание = НомерКоробки;
	СостояниеНакладной = Перечисления.СостоянияНакладной.Сканирование;
	СтруктураВозврата.успех = Истина;  
	
	возврат СтруктураВозврата;
КонецФункции
// Кухарь А.Ю. 03.05.2025 конец

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//+++Чирков 12.12.2025 - перенос начала замера в документ
	ДополнительныеСвойства.Вставить("Начало", ТекущаяУниверсальнаяДатаВМиллисекундах());	
	//---Чирков 12.12.2025 - перенос начала замера в документ
	
	// Кухарь А.Ю. 08.02.2025 начало
	если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	
	// Кухарь А.Ю.  16.03.2026 начало 
	//если не ЭтоНовый() и Модифицированность() и не РольДоступна("Администратор") тогда
	
	ПроверятьКодыАгрегации = Истина;	
	если  ДополнительныеСвойства.Свойство("НеКонтролироватьНаличиеКодовАгрегации") тогда
		ПроверятьКодыАгрегации= не ДополнительныеСвойства.НеКонтролироватьНаличиеКодовАгрегации;         
	КонецЕсли; 
	если не ЭтоНовый() и Модифицированность() и не РольДоступна("Администратор") и ПроверятьКодыАгрегации тогда	
		// Кухарь А.Ю.  16.03.2026 конец
		// Кухарь А.Ю.  10.04.2026 начало
		если не НеГабарит и ПроверитьНаличиеАгрегаций() Тогда 	
		// Кухарь А.Ю.  10.04.2026 конец
			
			ВызватьИсключение "Заполнены агрегации, редактирование запрещено";
		КонецЕсли;
	КонецЕсли;
	// Кухарь А.Ю. 08.02.2025 конец
	
	// Кухарь А.Ю. 19.03.2021 начало
	//// Замер времени. В хранилище не ставить
	ТребуетсяЗамерВремени=ложь;
	ДатаНачалаЗамера=ТекущаяДата();
	// Кухарь А.Ю. 19.03.2021 конец
	
	//Кухарь 02.02.17 начало
	//Автор будет заполняться из паллетировщика
	если ЗначениеЗаполнено(Паллетировщик) и ЭтоНовый() тогда
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
		|	Пользователи.Ссылка как Пользователь
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ФизЛицо = &ФизЛицо
		|	И (НЕ Пользователи.ПометкаУдаления)";
		запрос.УстановитьПараметр("ФизЛицо",Паллетировщик);
		результат=запрос.Выполнить().Выбрать();
		пока результат.Следующий() цикл
			Автор=результат.пользователь;
		КонецЦикла;
	КонецЕсли;
	//Кухарь 02.02.17  конец
	
	//кухарь 23.03.17 начало
	//почему то начало дня ставилось
	если ЭтоНовый() и не ОбменДанными.Загрузка тогда		
		Дата=ТекущаяДата();
		СписокНакл=ЛистыНабора.Выгрузить();
		СписокНакл.Свернуть("Документ");
		если СписокНакл.Количество()=1 тогда
			РеальноеПаллетирование=Истина;
			ДокОснование=СписокНакл.Получить(0).Документ;
		КонецЕсли;		
		//+++Чирков 08.07.2025
		Если РабочееМесто.Пустая() Тогда
			РабочееМесто = ПараметрыСеанса.РабочееМестоКлиента;		
		КонецЕсли;            
		//---Чирков 08.07.2025
	КонецЕсли;
	
	#Если Клиент Тогда
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Для Каждого СтрокаТЧ Из ЛистыНабора Цикл
				Документ = СтрокаТЧ.Документ;
				ЛистНабора = СтрокаТЧ.ЛистНабора;
				Если Документ.Метаданные().Имя = "РасходнаяНакладная" Тогда
					НастоящийПунктДоставки = ?(Документ.ПунктПерегруза.Пустая(),Документ.ПунктДоставки,Документ.ПунктПерегруза);
				Иначе
					Если Документ.ПунктДоставки.ПунктПерегруза.пустая() Тогда
						НастоящийПунктДоставки = Документ.ПунктДоставки;
					Иначе
						НастоящийПунктДоставки = Документ.ПунктДоставки.ПунктПерегруза;
					КонецЕсли;
				КонецЕсли;
				
				если Товары.Количество()=0 тогда
					Если НЕ ЛистНабора.Проведен Тогда
						СообщитьИзМодуля("Лист набора не проведен! ЛН: "+ЛистНабора+ " к документу "+Документ);
						Отказ = Истина;
					КонецЕсли;
					Если НЕ Документ.Проведен Тогда
						СообщитьИзМодуля("Документ отгрузки не проведен! ЛН: "+ЛистНабора+ " к документу "+Документ);
						Отказ = Истина;
					КонецЕсли;
					Если Документ.Склад.Подразделение <> Подразделение Тогда
						СообщитьИзМодуля("Недопустимый склад "+Документ.Склад+" документа отгрузки! ЛН: "+ЛистНабора+ " к документу "+Документ);	
						Отказ = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		СформироватьШКПаллеты();
	#КонецЕсли
	
	ЕстьИзменения	= Модифицированность();
	// Кухарь А.Ю.  10.06.2025 начало
	если ЕстьИзменения и РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения тогда
		запрос = новый запрос;
		запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ПаллетаЛистыНабора.Получатель КАК Получатель,
		               |	ПаллетаЛистыНабора.Документ КАК Документ
		               |ПОМЕСТИТЬ ТЧ
		               |ИЗ
		               |	Документ.Паллета.ЛистыНабора КАК ПаллетаЛистыНабора
		               |ГДЕ
		               |	ПаллетаЛистыНабора.Документ ССЫЛКА Документ.РасходнаяНакладная
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ТЧ.Получатель КАК Получатель,
		               |	ТЧ.Документ КАК Документ
		               |ИЗ
		               |	ТЧ КАК ТЧ";
		запрос.Текст=СтрЗаменить(запрос.Текст,"Документ.Паллета.ЛистыНабора КАК ПаллетаЛистыНабора","&ТЧ  КАК ПаллетаЛистыНабора");
		запрос.УстановитьПараметр("ТЧ",ЛистыНабора);
		
		Выборка = запрос.Выполнить().Выбрать();
		КоличествоНакладных = Выборка.Количество();
		пока выборка.Следующий() цикл  			 
			ПроверятьУникальностьАртикула = ОбщегоНазначения_ПИ.ПолучитьЗначениеРСРеквизитыСправочников(Выборка.Получатель,"ОдинАртикулНаПаллету",ложь); 
			//++Данилова Е.В. 19.01.2026 ASU-2089
			ПроверятьУникальностьАртикулаФизич = ОбщегоНазначения_ПИ.ПолучитьЗначениеРСРеквизитыСправочников(Выборка.Получатель,"ОдинАртикулНаПаллетуФизически",ложь);
			Если ПроверятьУникальностьАртикулаФизич тогда
				ПроверятьУникальностьАртикула = истина; 
			Иначе 
				ПравилаРаботыСАгрегациейЧЗ=МаркировкаКС.ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладной(Выборка.Документ);
				если ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияПаллет
					И ПравилаРаботыСАгрегациейЧЗ.ФормироватьНаборКодовАгрегацииНаПаллету Тогда
					
						ПроверятьУникальностьАртикула = Ложь; 				
				
				Конецесли; 
			КонецЕсли;
			//--Данилова Е.В. 19.01.2026
			// Кухарь А.Ю.  24.10.2025 начало
			// HELP-7562
			Экспозитор = ОбщегоНазначения_ПИ.ПрочитатьЗначениеРеквизитаПНКПРМРНК_ПИ("Экспозитор",выборка.Документ,Неопределено);
			если ЗначениеЗаполнено(Экспозитор) тогда       
				 ПроверятьУникальностьАртикула = ложь;
			КонецЕсли;
			// Кухарь А.Ю.  24.10.2025 конец  
			
			
			если ПроверятьУникальностьАртикула тогда
				
				БылоСтрок=0;
				если не ЭтоНовый() тогда
					Запрос=новый запрос;
					запрос.Текст="ВЫБРАТЬ
					|	КОЛИЧЕСТВО(ПаллетаЛистыНабора.Ссылка) КАК КоличествоСтрок
					|ИЗ
					|	Документ.Паллета.ЛистыНабора КАК ПаллетаЛистыНабора
					|ГДЕ
					|	ПаллетаЛистыНабора.Ссылка = &Ссылка";
					запрос.УстановитьПараметр("Ссылка",Ссылка);
					ВыборкаСтроки = запрос.Выполнить().Выбрать();
					пока ВыборкаСтроки.Следующий() цикл
						БылоСтрок=ВыборкаСтроки.КоличествоСтрок;
					КонецЦикла;
				КонецЕсли;
				
				СейчасСтрок = ЛистыНабора.Количество();
				
				если КоличествоНакладных=1 тогда
					если БылоСтрок<>СейчасСтрок тогда 
						//++Данилова Е.В. 24.03.2026 ASU-2089 
						//Документы.Паллета.ЗаполнитьНоменклатуру(ЭтотОбъект);
						Товары.Очистить();
						Документы.Паллета.ЗаполнитьНоменклатуру(ЭтотОбъект,ЛистыНабора[0].Документ);
						//--Данилова Е.В. 24.03.2026 
					КонецЕсли;
					ТаблицаАртикуловПаллеты = ПолучитьТаблицуАртикуловПаллеты(ЭтотОбъект,Выборка.Документ);
					если ТаблицаАртикуловПаллеты.количество()>1 тогда
						ВызватьИсключение "Обнаружено более 1го артикула на паллете. По этому контрагенту такое запрещено";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	// Кухарь А.Ю.  10.06.2025 конец
	
	
	// Кухарь А.Ю.  31.01.2025 начало
	//
	ОбработатьАгрегацииПаллет();
	//Кухарь А.Ю.  31.01.2025 конец  
	
	//Валетов + 15,07,2025 Добавил Сюда из Обработки проведения https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-2403
	//Изменение Записи в регистре СтатусГотовностиКОтгрузкеЧЗ, чтоб регламент ОУКЭП подхватил эту паллету.
	Если не Ссылка.Пустая() Тогда 
		НаборЗаписей = РегистрыСведений.СтатусГотовностиКОтгрузкеЧЗ.СоздатьНаборЗаписей();
		//Валетов + 15,10,2025  HELP-5404  Добавил обход ТЧ, чтоб всегда был ДокОснования
		Для Каждого СтрТовары ИЗ ЛистыНабора Цикл  			
			НаборЗаписей.Отбор.Документ.Установить(СтрТовары.Документ);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() > 0 Тогда
				НоваяЗапись = НаборЗаписей[0];
				Если НоваяЗапись.СтатусЧЗ = Перечисления.СтатусыГотовностиКОтгрузкеЧЗ.Обработано Тогда
					НоваяЗапись.СтатусЧЗ = Перечисления.СтатусыГотовностиКОтгрузкеЧЗ.ОжиданиеОбработкиЧЗ;
					НаборЗаписей.Записать();
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//Валетов -
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	ПрописатьИнформациюШКЛН();
	
	если не ПараметрыСеанса.ЗапущенаОбработка и ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.Склад  тогда
		
		//Кухарь 26.12.16 конце	
		если дата>=ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования() тогда
			РаботаСПланомНабораИНакладной();	
		КонецЕсли;
		//Кухарь 21.12.16 конец	
		
		//Кухарь 19.03.17 начало
		//Для подсчёта количества паллет	
		СписокШК= ЛистыНабора.ВыгрузитьКолонку("ШКЛистаНабора");
		Запрос=новый запрос; 
		Запрос.Текст="ВЫБРАТЬ
		|	ОстаткиЗХОстатки.ШККоробки КАК ШККоробки,
		|	ОстаткиЗХОстатки.ЗонаХранения КАК ЗонаХранения,
		|	ОстаткиЗХОстатки.КоличествоКоробокОстаток КАК Количество,
		|	ОстаткиЗХОстатки.ШКПаллеты
		|ИЗ
		|	РегистрНакопления.ОстаткиЗХ.Остатки(&Дата, ШККоробки В (&Шк)) КАК ОстаткиЗХОстатки
		|ГДЕ
		|	ОстаткиЗХОстатки.КоличествоКоробокОстаток > 0";				 
		Запрос.УстановитьПараметр("ШК",СписокШК);	
		Запрос.УстановитьПараметр("Дата",Дата);
		ЕстьНаОстатках=запрос.Выполнить().Выгрузить();
		
		Для каждого ТекСтрока из ЕстьНаОстатках цикл
			Движение = Движения.ОстаткиЗХ.Добавить();
			ЗаполнитьЗначенияСвойств(движение,ТекСтрока);
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.ЗонаХранения = ТекСтрока.ЗонаХранения;
			Движение.КоличествоКоробок = ТекСтрока.Количество;
		КонецЦикла;
	КонецЕсли;
	//Проводки по остаткам адресного хранения номенклатуры
	если ЗначениеЗаполнено(ДатаОкончанияХранения) тогда
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
		|	АдресноеХранениеОстаткиОстаткиИОбороты.ЗонаХранения КАК ЗонаХранения
		|ИЗ
		|	РегистрНакопления.АдресноеХранениеОстатки.ОстаткиИОбороты(&Дата1, &Дата2, Регистратор, , Номенклатура В (&Номенклатура)) КАК АдресноеХранениеОстаткиОстаткиИОбороты
		|ГДЕ
		|	АдресноеХранениеОстаткиОстаткиИОбороты.Регистратор.Паллета = &Паллета
		|	И АдресноеХранениеОстаткиОстаткиИОбороты.Регистратор.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	АдресноеХранениеОстаткиОстаткиИОбороты.Период УБЫВ";
		запрос.УстановитьПараметр("Номенклатура",Товары.ВыгрузитьКолонку("Номенклатура"));
		запрос.УстановитьПараметр("Дата1",НачалоПаллетирования);					 
		запрос.УстановитьПараметр("Дата2",ОкончаниеПаллетирования);		
		запрос.УстановитьПараметр("Паллета",Ссылка);				
		Результат=запрос.Выполнить().Выбрать();
		пока Результат.Следующий() цикл
			ЗонаХранения=Результат.ЗонаХранения;
			для каждого СтрТЧ из Товары цикл
				если СтрТЧ.Количество=0 тогда Продолжить;КонецЕсли;	
				Движение = Движения.АдресноеХранениеОстатки.Добавить();
				ЗаполнитьЗначенияСвойств(движение,СтрТЧ);	
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.ЗонаХранения = ЗонаХранения;
				//Движение.Паллета=Ссылка;
				Движение.КодОперации=Перечисления.КодыОперацийОстатки.Перемещение;		
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	если ТребуетсяЗамерВремени тогда
		ТЗ=ЛистыНабора.Выгрузить(,"Документ");
		ТЗ.Свернуть("Документ");
		ВсегоНакладных=ТЗ.Количество();
		Запись=РегистрыСведений.ЗамерПроизводительности.СоздатьМенеджерЗаписи();
		запись.ВидДокумента=Метаданные().Имя;
		запись.ДатаЗамера=ДатаНачалаЗамера;
		запись.НомерДокумента=Номер;
		запись.ИмяКомпьютера= ИмяКомпьютера();
		запись.ВремяПроведения =  ТекущаяДата()-ДатаНачалаЗамера;
		запись.Пользователь=ПараметрыСеанса.Пользователь; 	
		запись.КоличествоСтрок = ВсегоНакладных;
		запись.Записать();
	КонецЕсли;  

КонецПроцедуры

Процедура СформироватьШКПаллеты() Экспорт
	Если ПустаяСтрока(ШКПаллеты) Тогда
		//		Записать(РежимЗаписиДокумента.Запись);
		//Кухарь 26.08.16 начало
		//Регламентное задание эту функцию не видит
		//	ШКПаллеты = глСформироватьШКДокаРазвернуто(Метаданные().Имя,Номер,Дата);
		#Если Клиент тогда
			ШКПаллеты = глСформироватьШКДокаРазвернуто(Метаданные().Имя,Номер,Дата);
		#КонецЕсли
		//Кухарь 26.08.16 конец
		
	КонецЕсли;
КонецПроцедуры


Процедура  ПрописатьИнформациюШКЛН()
	НаборЗаписей = РегистрыСведений.ИнформацияШКПаллеты.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.НомерПаллеты.Значение = Номер;
	НаборЗаписей.Отбор.НомерПаллеты.Использование = Истина;
	НаборЗаписей.Отбор.ШКПаллеты.Значение = ШКПаллеты;
	НаборЗаписей.Отбор.ШКПаллеты.Использование = Истина;
	НаборЗаписей.Очистить();
	Запись = НаборЗаписей.Добавить();
	Запись.НомерПаллеты = Номер;
	запись.ШКПаллеты = ШКПаллеты;
	Запись.Подразделение = Подразделение;
	Запись.ПунктДоставки = ПунктДоставки;
	Запись.ДатаОтгрузки = ДатаОтгрузки;
	Запись.СостояниеНакладной = СостояниеНакладной;
	//Запись.СборнаяПаллета = СборнаяПаллета;
	//Запись.ПорядковыйНомер = ПорядковыйНомер;
	Запись.СписокШКЛистовНабора = ЗначениеВСтрокуВнутр(ЛистыНабора.ВыгрузитьКолонку("ШКЛистаНабора"));
	
	
	НаборЗаписей.Записать();
КонецПроцедуры

//нечаева 02,09,16+++
Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	// Кухарь А.Ю. 03.03.2020 начало
	//
	// Если НужноВыгружать Тогда
	//	ЗанестиФилиалыВРегистрПолучателей(ЭтотОбъект);
	//КонецЕсли;
	
	//  Кухарь А.Ю. 03.03.2020 конец
	
	
КонецПроцедуры

//Кухарь 08.11.16 начало
Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	ДокОснование=Основание;	
КонецПроцедуры
//Кухарь 08.11.16 конец
//нечаева 02,09,16---


//кухарь 21.12.16 начало
//Функция ПроверитьЧтоВсеКоробаВПаллетах ()  
Функция ПроверитьЧтоВсеКоробаВПаллетах (Накладная=Неопределено)  
	//кухарь 21.12.16 конец
	
	КоличествоКоробокВПаллетах=0;
	
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ПаллетаЛистыНабора.НомерСтроки) КАК КоличествоКоробок
	|ИЗ
	|	Документ.Паллета.ЛистыНабора КАК ПаллетаЛистыНабора
	|ГДЕ
	|	ПаллетаЛистыНабора.Ссылка.Проведен
	|	И ПаллетаЛистыНабора.Ссылка.ОкончаниеПаллетирования <> &ПустаяДата
	|	И ПаллетаЛистыНабора.Ссылка <> &Ссылка
	//Кухарь 11.01.17 начало
	|	И ПаллетаЛистыНабора.Документ = &ДокОснование";
	//|	И ПаллетаЛистыНабора.Ссылка.ДокОснование = &ДокОснование
	////Кухарь 26.12.17 начало
	////Оптимизация
	//|	И ПаллетаЛистыНабора.Ссылка.Дата >= &Дата1";
	////Кухарь 26.12.17 конец			
	//Кухарь 11.01.17 конец
	//кухарь 21.12.16 начало
	//запрос.УстановитьПараметр("ДокОснование",ДокОснование);
	если Накладная=Неопределено  тогда
		Накладная=ДокОснование
	КонецЕсли;
	запрос.УстановитьПараметр("ДокОснование",Накладная);
	//Кухарь 26.12.17 начало
	//Оптимизация
	//запрос.УстановитьПараметр("Дата1",Константы.ДатаЗапретаРедактирования.Получить()-30*24*3600);					
	//Кухарь 26.12.17 конец		
	//кухарь 21.12.16 конец
	запрос.УстановитьПараметр("ПустаяДата",ПустаяДата());
	запрос.УстановитьПараметр("Ссылка",Ссылка);
	результат=запрос.Выполнить().Выбрать();
	пока результат.Следующий() цикл
		КоличествоКоробокВПаллетах=КоличествоКоробокВПаллетах+результат.КоличествоКоробок;
	КонецЦикла;
	
	//Кухарь 11.01.17 начало
	// Забыл про кросс докинг
	//КоличествоКоробокВПаллетах=КоличествоКоробокВПаллетах+ЛистыНабора.Количество();
	отбор=новый Структура;
	отбор.Вставить("Документ",Накладная);
	СтрокиТекНакл=ЛистыНабора.НайтиСтроки(отбор);
	КоличествоКоробокВПаллетах=КоличествоКоробокВПаллетах+СтрокиТекНакл.Количество();
	//Кухарь 11.01.17 конец
	
	ОбИКол=ПолучитьКоличествоИОбъемКоробовИзРегистра(Накладная);
	КоличествоКоробокНакладной=ОбИКол.КоличествоКоробок;
	
	если КоличествоКоробокВПаллетах<>КоличествоКоробокНакладной тогда
		Возврат ложь;
	иначе
		Возврат Истина;
	КонецЕсли;
	
	
	
КонецФункции
//Кухарь 08.11.16 





// Кухарь А.Ю. 03.03.2021 начало
// Оптимизация  - старая процедура  ОбработатьТекущиеПланНабораИНакладнуюСтарая
//процедура ОбработатьТекущиеПланНабораИНакладную (Накладная=Неопределено)
процедура ОбработатьТекущиеПланНабораИНакладную (СтрокаТаблицыСНакладной=Неопределено)
	Накладная=СтрокаТаблицыСНакладной.Документ;
	СостояниеНакладной=СтрокаТаблицыСНакладной.СостояниеНакладной; 
	НужноПаллетирование=СтрокаТаблицыСНакладной.НужноПаллетирование;
	
	если СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаТаблицыСНакладной.КоличествоКоробокНакладной<>СтрокаТаблицыСНакладной.КоличествоКоробокНаПаллетах тогда
		ВсеВПаллетах=ложь;
		НовоеСостояние=Перечисления.СостоянияНакладной.Паллетирование;
	иначе
		ВсеВПаллетах=Истина;
		//Валетов + 17,09,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5404
		//НовоеСостояние=Перечисления.СостоянияНакладной.ГотоваКОтгрузке;       
		
		//Кухарь А.Ю. 31.10.2025 начало
		// HELP-5404    
		//Если ТипЗнч(Накладная) = Тип("ДокументСсылка.РасходнаяНакладная") И Накладная.ТребуетсяМаркировка Тогда
		
		ПереводитьВОжиданиеОбработкиЧЗ = ложь;
		если ТипЗнч(Накладная) =Тип("ДокументСсылка.РасходнаяНакладная") тогда 
			Контрагент=ПолучитьРеквизитШапки(Накладная,"Контрагент","Документ");
			ПереводитьВОжиданиеОбработкиЧЗ=ОбщегоНазначения_ПИ.ПолучитьЗначениеРСРеквизитыСправочников(Контрагент,"ПереводитьВОжиданиеОбработкиЧЗ",Ложь);
		КонецЕсли;	       
		Если ТипЗнч(Накладная) = Тип("ДокументСсылка.РасходнаяНакладная") И Накладная.ТребуетсяМаркировка и ПереводитьВОжиданиеОбработкиЧЗ Тогда
			//Кухарь А.Ю. 31.10.2025 конец
			
			НовоеСостояние=Перечисления.СостоянияНакладной.ОжиданиеОбработкиЧЗ;
		Иначе
			НовоеСостояние=Перечисления.СостоянияНакладной.ГотоваКОтгрузке;
		КонецЕсли;

	КонецЕсли;
	
	ПланНабора=СтрокаТаблицыСНакладной.ПланНабора;
	если ПланНабора.пустая() тогда
		Возврат;
	КонецЕсли;
	
	
	
	если СтрокаТаблицыСНакладной=Неопределено тогда
		Накладная=ДокОснование;
	КонецЕсли;
	
	
	//Кухарь А.Ю.  29.05.2025 начало
	ПисатьОтложенно = ложь;
	если ТипЗнч(Накладная) = Тип("ДокументСсылка.РасходнаяНакладная") тогда
		ПисатьОтложенно = ОбщегоНазначения_ПИ.ПолучитьЗначениеРСРеквизитыСправочников(Контрагент,"ОбрабатыватьПаллетыОтложенно",Ложь); 	
	КонецЕсли;
	//если ПисатьОтложенно тогда
	//	РегистрыСведений.ЗаданиеНаСменуСтатусовНакладной.СоздатьЗаданиеНаСменуСтатуса(Накладная,НовоеСостояние);   
	//	Возврат;
	//КонецЕсли;
	//Кухарь А.Ю.  29.05.2025 конец
	
	Если СостояниеНакладной=Перечисления.СостоянияНакладной.ОжиданиеПаллетирования тогда					
		если ВсеВПаллетах и ОкончаниеПаллетирования<>ПустаяДата() тогда
			ОбъемПаллет=0;
			КоличествоПаллет=0;
			РасчитатьОбъемИКоличествоПаллет (СтрокаТаблицыСНакладной,ОбъемПаллет,КоличествоПаллет);	
			НакладнаяОбъект=Накладная.ПолучитьОбъект();
			НакладнаяОбъект.КоличествоПаллет=КоличествоПаллет;
			НакладнаяОбъект.ОбъемПаллет=ОбъемПаллет;						
		иначе
			НакладнаяОбъект=Накладная.ПолучитьОбъект();
		КонецЕсли;
		
		НакладнаяОбъект.СостояниеНакладной=НовоеСостояние;
		
		// Шворобей ВЮ 19.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5152
		/////////////////////////////////////////////////////////////////////////////////////
		// Вот здесь Ожидание Паллетирования
		/////////////////////////////////////////////////////////////////////////////////////
		Попытка
			НакладнаяОбъект.ЗаписьБезКонтроляПолномочий(ТЗНеизменяемыхРеквизитов);
		Исключение
			МаркировкаКС.СообщитьПользователю("Не могу провести документ " + Строка(НакладнаяОбъект) + ": " + ОписаниеОшибки());
			Если НакладнаяОбъект.ДополнительныеСвойства.Свойство("ТекстОшибки") Тогда
				СообщитьИзМодуля(НакладнаяОбъект.ДополнительныеСвойства.ТекстОшибки);
			Иначе
				СообщитьИзМодуля("РНК не переводится в РГ при записи Паллеты!!!");
			КонецЕсли;
		КонецПопытки;
		// Шворобей ВЮ 19.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5152
		
		ПланНабора=ПланНабора.ПолучитьОбъект();
		для каждого СтрТБ из ПланНабора.тБрэндов цикл
			если не ЗначениеЗаполнено(СтрТБ.НачалоПаллетирования) тогда
				СтрТБ.НачалоПаллетирования=Дата;
			КонецЕсли;
			СтрТБ.Состояние=НовоеСостояние;
			если не ЗначениеЗаполнено(СтрТБ.Паллетировщик) тогда
				СтрТБ.Паллетировщик=Паллетировщик;
			КонецЕсли;
		КонецЦикла;	
		ПланНабора.ЗаписатьБезОбработки(РежимЗаписиДокумента.Запись);
		
		ТребуетсяЗамерВремени=Истина; 
		
		ОбновитьСостоянияЗНБ (НовоеСостояние,Накладная);
		
		
		// Кухарь А.Ю.  15.02.2023 начало
		// 	ИначеЕсли СостояниеНакладной=Перечисления.СостоянияНакладной.Паллетирование  тогда	//Для любой накладной в состоянии паллетирование
	ИначеЕсли СостояниеНакладной=Перечисления.СостоянияНакладной.Паллетирование или СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке или СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена 
		//Валетов + 17,09,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5404 
			или СостояниеНакладной=Перечисления.СостоянияНакладной.ОжиданиеОбработкиЧЗ
			//Валетов -
			тогда	//Для любой накладной в состоянии паллетирование
		
		
		// Кухарь А.Ю.  15.02.2023 конец
		// Кухарь А.Ю.  15.02.2023 начало
		если   СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке или СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена
			//Валетов + 17,09,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5404 
			или СостояниеНакладной=Перечисления.СостоянияНакладной.ОжиданиеОбработкиЧЗ
			//Валетов -
			тогда
			НовоеСостояние=СостояниеНакладной
		КонецЕсли;
		// Кухарь А.Ю.  15.02.2023 конец
		
		
		если не ВсеВПаллетах или ОкончаниеПаллетирования=ПустаяДата() тогда //Ничего не делаем до последней паллеты
			Возврат;
		КонецЕсли;
		ОбъемПаллет=0;
		КоличествоПаллет=0;
		РасчитатьОбъемИКоличествоПаллет (СтрокаТаблицыСНакладной,ОбъемПаллет,КоличествоПаллет);		
		
		НакладнаяОбъект=Накладная.ПолучитьОбъект();
		НакладнаяОбъект.КоличествоПаллет=КоличествоПаллет;
		НакладнаяОбъект.ОбъемПаллет=ОбъемПаллет;						
		НакладнаяОбъект.СостояниеНакладной=НовоеСостояние;
		
		// Шворобей ВЮ 19.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5152
		Попытка
			НакладнаяОбъект.ЗаписьБезКонтроляПолномочий(ТЗНеизменяемыхРеквизитов);
		Исключение
			МаркировкаКС.СообщитьПользователю("Не могу провести документ " + Строка(НакладнаяОбъект) + ": " + ОписаниеОшибки());
		КонецПопытки;
		// Шворобей ВЮ 19.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5152
		
		ПланНабора=ПланНабора.ПолучитьОбъект();		
		для каждого СтрТБ из ПланНабора.тБрэндов цикл
			СтрТБ.ОкончаниеПаллетирования=ТекущаяДата();
			СтрТБ.Состояние=НовоеСостояние;
		КонецЦикла;				
		ПланНабора.ЗаписатьБезОбработки(РежимЗаписиДокумента.Запись);
		ОбновитьСостоянияЗНБ (НовоеСостояние,Накладная);
		
		ТребуетсяЗамерВремени=Истина; 
		
	Иначе //Запись начала паллетирования накладных, которые сканировали раньше времени
		если РеальноеПаллетирование тогда
			ПланНабора=ПланНабора.ПолучитьОбъект();
			НужноЗаписать=ложь;
			для каждого СтрТБ из ПланНабора.тБрэндов цикл
				если не ЗначениеЗаполнено(СтрТБ.НачалоПаллетирования) тогда
					НужноЗаписать=Истина;
					СтрТБ.НачалоПаллетирования=Дата;
					СтрТБ.Паллетировщик=Паллетировщик;
				КонецЕсли;
			КонецЦикла;		
			если НужноЗаписать тогда
				ПланНабора.ЗаписатьБезОбработки(РежимЗаписиДокумента.Запись);	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	//
	
	// Кухарь А.Ю. 22.03.2021 конец
	
	
КонецПроцедуры
// Кухарь А.Ю. 03.03.2021 конец

// Кухарь А.Ю. 04.03.2021 начало
// РаботаСПланомНабораИНакладнойСтарая
процедура РаботаСПланомНабораИНакладной ()   экспорт
	// Кухарь А.Ю. 05.03.2021 начало
	// оптимизация. Не будем пересчитывать короба, т.к. они уже пересчитались в ожидании паллетирования
	ТЗНеизменяемыхРеквизитов=новый ТаблицаЗначений;
	ТЗНеизменяемыхРеквизитов.Колонки.Добавить("ИмяРеквизита");
	СтрТЗ=ТЗНеизменяемыхРеквизитов.Добавить();
	СтрТЗ.ИмяРеквизита="КоличествоКоробок";
	СтрТЗ=ТЗНеизменяемыхРеквизитов.Добавить();
	СтрТЗ.ИмяРеквизита="Трудозатраты";
	// Кухарь А.Ю. 05.03.2021 конец
	
	
	ТЗНакладных=ЗаполнитьТЗНакладныхДополнительнойИнформацией();
	//Валетов + 22,04,2026 ФЗП 
	ПисатьОтложенно = Ложь;
	ТабФоновойЗаписи = Новый ТаблицаЗначений;
	ТабФоновойЗаписи.Колонки.Добавить("Документ");
	ТабФоновойЗаписи.Колонки.Добавить("СтароеСостояние");
	ТабФоновойЗаписи.Колонки.Добавить("НовоеСостояние");

	для Каждого СтрТЗ из ТЗНакладных цикл
		Накладная=СтрТЗ.Документ;
		если Накладная.метаданные().имя="РасходнаяНакладная" или Накладная.метаданные().имя="Перемещение" тогда     
			
			ПисатьОтложенно=ОбщегоНазначения_ПИ.ПолучитьЗначениеРСРеквизитыСправочников(Накладная.Контрагент,"ОбрабатыватьПаллетыОтложенно",Ложь); 	
			Если ПисатьОтложенно И СтрТЗ.КоличествоКоробокНаПаллетах = СтрТЗ.КоличествоКоробокНакладной Тогда 
				НовСтрТабФоновойЗаписи = ТабФоновойЗаписи.Добавить();
				НовСтрТабФоновойЗаписи.Документ = Накладная;
				НовСтрТабФоновойЗаписи.СтароеСостояние = СтрТЗ.СостояниеНакладной;
				НовСтрТабФоновойЗаписи.НовоеСостояние = Перечисления.СостоянияНакладной.ГотоваКОтгрузке;  
				Продолжить;
			КонецЕсли;
	
			ОбработатьТекущиеПланНабораИНакладную(СтрТЗ);
		КонецЕсли;
	КонецЦикла;  
	Если ТабФоновойЗаписи.Количество() > 0 Тогда 
		ПараметрыФоновойФормы = Новый Структура;
		ПараметрыФоновойФормы.Вставить("ТипОперации","Смена состояний накладных");
		ПараметрыФоновойФормы.Вставить("ТекстСообщения","Выполняется смена состояний накладных. Чтобы не искать потом проблемные паллеты в заполненной машине, дождитесь окончания операции.");
		ПараметрыФоновойФормы.Вставить("ТаблицаДок",ТабФоновойЗаписи);
		ПараметрыФоновойФормы.Вставить("Результат",Неопределено);			
		
		ОткрытьФорму("ОбщаяФорма.ФоноваяЗаписьПаллет", ПараметрыФоновойФормы);  
	КонецЕсли;
	
КонецПроцедуры
// Кухарь А.Ю. 04.03.2021 конец


// Кухарь А.Ю. 03.03.2021 начало
//Оптимизация
Функция ЗаполнитьТЗНакладныхДополнительнойИнформацией()
	Запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ
	|	ПаллетаЛистыНабор.Документ КАК Документ
	|ПОМЕСТИТЬ ВремТЗ
	|ИЗ
	|	&ТЗПолная КАК ПаллетаЛистыНабор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т1.Документ КАК Документ,
	|	КОЛИЧЕСТВО(т1.КоличествоКоробок) КАК КоличествоКоробокНаПаллетах,
	|	т1.Документ.КоличествоКоробок КАК КоличествоКоробокНакладной
	|ПОМЕСТИТЬ ТЗКоробокНаПаллетах
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПаллетаЛистыНабора.Документ КАК Документ,
	|		ПаллетаЛистыНабора.Документ КАК КоличествоКоробок
	|	ИЗ
	|		Документ.Паллета.ЛистыНабора КАК ПаллетаЛистыНабора
	|	ГДЕ
	|		ПаллетаЛистыНабора.Ссылка.Проведен
	|		И ПаллетаЛистыНабора.Ссылка.ОкончаниеПаллетирования <> &ПустаяДата
	|		И ПаллетаЛистыНабора.Ссылка <> &Ссылка
	|		И ПаллетаЛистыНабора.Документ В(&СписокНакладных)
	|		И ПаллетаЛистыНабора.Ссылка.Дата >= &ДатаНачалаПоиска
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПаллетаЛистыНабора.Документ,
	|		ПаллетаЛистыНабора.Документ
	|	ИЗ
	|		ВремТЗ КАК ПаллетаЛистыНабора) КАК т1
	|
	|СГРУППИРОВАТЬ ПО
	|	т1.Документ,
	|	т1.Документ.КоличествоКоробок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ПланНабора.Ссылка, &ПустойПланНабора) КАК ПланНабора,
	|	ТЗКоробокНаПаллетах.Документ КАК Документ,
	|	ТЗКоробокНаПаллетах.КоличествоКоробокНаПаллетах КАК КоличествоКоробокНаПаллетах,
	|	ТЗКоробокНаПаллетах.КоличествоКоробокНакладной КАК КоличествоКоробокНакладной,
	|	ВЫБОР
	|		КОГДА ТЗКоробокНаПаллетах.Документ ССЫЛКА Документ.РасходнаяНакладная
	|			ТОГДА ВЫРАЗИТЬ(ТЗКоробокНаПаллетах.Документ КАК Документ.РасходнаяНакладная).СостояниеНакладной
	|		КОГДА ТЗКоробокНаПаллетах.Документ ССЫЛКА Документ.Перемещение
	|			ТОГДА ВЫРАЗИТЬ(ТЗКоробокНаПаллетах.Документ КАК Документ.Перемещение).СостояниеНакладной
	|	КОНЕЦ КАК СостояниеНакладной,
	|	ВЫБОР
	|		КОГДА ТЗКоробокНаПаллетах.Документ ССЫЛКА Документ.РасходнаяНакладная
	|			ТОГДА ВЫРАЗИТЬ(ТЗКоробокНаПаллетах.Документ КАК Документ.РасходнаяНакладная).НужноПаллетирование
	|		КОГДА ТЗКоробокНаПаллетах.Документ ССЫЛКА Документ.Перемещение
	|			ТОГДА ВЫРАЗИТЬ(ТЗКоробокНаПаллетах.Документ КАК Документ.Перемещение).НужноПаллетирование
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НужноПаллетирование
	|ИЗ
	|	ТЗКоробокНаПаллетах КАК ТЗКоробокНаПаллетах
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПланНабора КАК ПланНабора
	|		ПО ТЗКоробокНаПаллетах.Документ = ПланНабора.Накладная
	|			И (ПланНабора.Накладная.Проведен)
	|			И (ПланНабора.Накладная.Дата > &ДатаНачалаПоиска)
	|			И (ПланНабора.Проведен)";
	
	ТЗПолная=ЛистыНабора.Выгрузить(,"Документ");
	
	Запрос.УстановитьПараметр("СписокНакладных",ТЗПолная.ВыгрузитьКолонку("Документ"));
	Запрос.УстановитьПараметр("ТЗПолная",ТЗПолная);
	Запрос.УстановитьПараметр("ПустаяДата",ПустаяДата());
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	запрос.УстановитьПараметр("ПустойПланНабора",документы.ПланНабора.ПустаяСсылка());
	Запрос.УстановитьПараметр("ДатаНачалаПоиска",ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования()-30*24*3600);
	
	возврат запрос.Выполнить().Выгрузить();
	
КонецФункции 

Процедура РасчитатьОбъемИКоличествоПаллет (СтрокаТаблицыСНакладной,ОбъемПаллет,КоличествоПаллет)
	
	Накладная= СтрокаТаблицыСНакладной.Документ;	
	КоличествоКоробокНакладной= СтрокаТаблицыСНакладной.КоличествоКоробокНакладной;
	КоличествоКоробокТекушейНакладнойВТекущейПаллете=ЛистыНабора.НайтиСтроки(новый Структура("Документ",Накладная)).Количество();
	КоличествоКоробовТекущейПаллеты=ЛистыНабора.Количество();
	если КоличествоКоробовТекущейПаллеты=0 тогда Возврат;КонецЕсли;	
	ПропорцияПаллеты=КоличествоКоробокТекушейНакладнойВТекущейПаллете/КоличествоКоробовТекущейПаллеты;
	КоличествоПаллет=Окр(ПропорцияПаллеты,4);
	ОбъемПаллет=Окр(Объем*ПропорцияПаллеты,4);
	если КоличествоКоробокНакладной = КоличествоКоробокТекушейНакладнойВТекущейПаллете тогда
		Возврат;
	КонецЕсли;
	
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Паллета.Ссылка) КАК КоличествоПаллет,
	|	СУММА(Паллета.Объем) КАК ОбъемПаллет
	|ИЗ
	|	Документ.Паллета КАК Паллета
	|ГДЕ
	|	Паллета.Проведен
	|	И Паллета.РеальноеПаллетирование
	|	И Паллета.ДокОснование = &ДокОснование
	|	И Паллета.Ссылка <> &Ссылка"; 
	запрос.УстановитьПараметр("ДокОснование",Накладная);	
	запрос.УстановитьПараметр("Ссылка",Ссылка);		
	результат2=запрос.Выполнить().Выбрать();
	НакладнаяОбъект=Накладная.ПолучитьОбъект();
	пока результат2.Следующий() цикл		
		//Кухарь 24.03.2021 начало
		//Если паллет не было, то конфигураторная ошибка.
		если результат2.ОбъемПаллет=null тогда Продолжить;КонецЕсли;	
		//Кухарь 24.03.2021 конец
		
		КоличествоПаллет=КоличествоПаллет+результат2.КоличествоПаллет;
		ОбъемПаллет=ОбъемПаллет+результат2.ОбъемПаллет;
	КонецЦикла;
	
	КоличествоСборныхПаллет=0;
	ОбъемСборныхПаллет=0;
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Паллета.Ссылка КАК Паллета
	|ИЗ
	|	Документ.Паллета КАК Паллета
	|ГДЕ
	|	Паллета.Проведен
	|	И НЕ Паллета.РеальноеПаллетирование
	|	И Паллета.ОкончаниеПаллетирования <> &ПустаяДата
	|	И Паллета.ЛистыНабора.Документ = &ДокОснование
	|	И Паллета.Дата >= &Дата1
	|	И Паллета.Ссылка <> &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Паллета.Ссылка";
	запрос.УстановитьПараметр("ДокОснование",Накладная);
	запрос.УстановитьПараметр("ПустаяДата",ПустаяДата());
	запрос.УстановитьПараметр("Ссылка",Ссылка);	
	запрос.УстановитьПараметр("Дата1",ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования()-30*24*3600);										
	результат2=запрос.Выполнить().Выбрать();
	пока результат2.Следующий() цикл
		//если результат2.ОбъемПаллет=null тогда Продолжить;КонецЕсли;
		
		Отбор=новый Структура;
		Отбор.Вставить("Документ",Накладная);
		МассСтрок=результат2.паллета.ЛистыНабора.НайтиСтроки(Отбор);
		кусок=Окр(МассСтрок.количество()/результат2.паллета.ЛистыНабора.количество(),4);
		ОбъемСборныхПаллет=ОбъемСборныхПаллет+результат2.паллета.Объем*кусок;
		КоличествоСборныхПаллет=КоличествоСборныхПаллет+кусок;					
	КонецЦикла;
	КоличествоПаллет=КоличествоПаллет+КоличествоСборныхПаллет;
	ОбъемПаллет=ОбъемПаллет+ОбъемСборныхПаллет;
	
КонецПроцедуры
// Кухарь А.Ю. 03.03.2021 конец


// Кухарь А.Ю. 30.03.2021 начало
//
Процедура ОбновитьСостоянияЗНБ (НовоеСостояние,Накладная)
	Запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ
	|	ЗаданиеНабора.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаданиеНабора КАК ЗаданиеНабора
	|ГДЕ
	|	ЗаданиеНабора.Накладная = &Накладная
	|	И ЗаданиеНабора.Проведен
	|	И ЗаданиеНабора.СостояниеНакладной <> &СостояниеНакладной";
	запрос.УстановитьПараметр("Накладная",Накладная);
	запрос.УстановитьПараметр("СостояниеНакладной",НовоеСостояние);
	результат=запрос.Выполнить().Выбрать();
	пока результат.Следующий() цикл
		ЗНБ=результат.ссылка.получитьобъект();
		ЗНБ.СостояниеНакладной=НовоеСостояние;
		ЗНБ.ОбменДанными.Загрузка=Истина;
		знб.Записать();
	КонецЦикла;
КонецПроцедуры
// Кухарь А.Ю. 30.03.2021 конец


// Кухарь А.Ю.  31.01.2025 начало
//
Функция ЗаполнитьАгрегациюПаллетыПоНакладной (знач ПравилаРаботыСАгрегациейЧЗ,знач Накладная) 
	СтруктураВозврата=новый Структура("Успех,Ошибка",Истина,"");
	
	ПравилаРаботыСАгрегациейЧЗ=МаркировкаКС.ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладной(Накладная);
	ПерваяКоробка=ЛистыНабора[0].ЛистНабора;
	если ТипЗнч(ПерваяКоробка)=Тип("ДокументСсылка.ЛистНабора") тогда
		ТипДокумента="ЛистНабора";
	иначе
		ТипДокумента="ЛистПереукладки";
	КонецЕсли;
	
	запрос=новый запрос;
	если ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияКоробок тогда
		запрос.Текст="ВЫБРАТЬ
		|	ТЗ.ЛистНабора КАК Коробка
		|ПОМЕСТИТЬ Коробки
		|ИЗ
		|	&ЛистыНабора КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////             
		// Кухарь А.Ю.  06.11.2025 начало
		// HELP-7763
		//|ВЫБРАТЬ
		//|	Коробки.Коробка.КодАгрегации КАК ШтрихкодУпаковки,
		//|	Коробки.Коробка как Коробка
		//|ИЗ
		//|	Коробки КАК Коробки"		 	
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ЛистНабораШтрихкодыКоробокДляАгрегации.НовыйКодКоробки, Коробки.Коробка.КодАгрегации) КАК ШтрихкодУпаковки,
		|	Коробки.Коробка КАК Коробка
		|ИЗ
		|	Коробки КАК Коробки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ЛистНабораШтрихкодыКоробокДляАгрегации
		|		ПО Коробки.Коробка = ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка";   
		// Кухарь А.Ю.  06.11.2025 конец
		запрос.УстановитьПараметр("ЛистыНабора",ЛистыНабора);
		//++Данилова Е.В. 22.04.2026 MARK-3539
		запрос.Текст=СтрЗаменить(запрос.Текст,"Документ.ЛистНабора","Документ." + ТипДокумента);
		//--Данилова Е.В. 22.04.2026 
		
	Иначе
		запрос.Текст="ВЫБРАТЬ
		|	ТЧ.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
		|	ТЧ.Ссылка КАК Коробка
		|ИЗ
		|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ТЧ
		|ГДЕ
		|	ТЧ.Ссылка В(&СписокДокументов)";
		запрос.УстановитьПараметр("СписокДокументов",ЛистыНабора.ВыгрузитьКолонку("ЛистНабора"));
		если ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияБлочков тогда
			запрос.Текст=СтрЗаменить(запрос.Текст,"ТЧ.ШтрихкодУпаковки","ТЧ.ШтрихкодБлочка");
		КонецЕсли;
		запрос.Текст=СтрЗаменить(запрос.Текст,"ЛистНабора",ТипДокумента);
		
	КонецЕсли;
	
	ТаблицаКодов=запрос.Выполнить().Выгрузить();
	
	МассивПустыхКодов=ТаблицаКодов.НайтиСтроки(новый Структура("ШтрихкодУпаковки",Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка()));
	если МассивПустыхКодов.Количество()>0 тогда
		МассивОшибки=новый Массив;
		для каждого СтрМасс из МассивПустыхКодов цикл
			если МассивОшибки.Найти(Строка(СтрМасс.Коробка)) = Неопределено тогда
				МассивОшибки.Добавить(Строка(СтрМасс.коробка));
			КонецЕсли;
			СтруктураВозврата.успех=ложь;
			СтруктураВозврата.Ошибка="Обнаружены коробки с пустым кодом ЧЗ"+Символы.ПС+СтрСоединить(МассивОшибки,символы.ПС);
			возврат СтруктураВозврата;
		КонецЦикла;
	КонецЕсли;
	
	//// Кухарь А.Ю.  11.02.2025 начало
	//// MARK-1251
	//ЗНМ	= НайтиДокумент("ЗаданиеНаМаркировку", Новый Структура("ДокОснование", ДокОснование));
	//если не ЗначениеЗаполнено(ЗНМ) тогда
	//	ЗНМ=Документы.ЗаданиеНаМаркировку.Создать_ЗаданиеНаМаркировку(ДокОснование);
	//КонецЕсли;	 
	//// Кухарь А.Ю.  11.02.2025 конец
	
	
	
	Запрос.Текст="ВЫБРАТЬ
	|	ТЧ.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.ЛистНабора.Товары КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка В(&Коробки)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧ.Номенклатура";
	
	запрос.Текст=СтрЗаменить(запрос.Текст,"ЛистНабора",ТипДокумента);
	запрос.УстановитьПараметр("Коробки",ЛистыНабора.ВыгрузитьКолонку("ЛистНабора"));
	ТЗНоменклатура=запрос.Выполнить().Выгрузить();  
		
	//если не ПравилаРаботыСАгрегациейЧЗ.ПриАгрегацииСворачиватьПоНаименованиюКонтрагента тогда	
	
	
	если ТЗНоменклатура.Количество()>1 тогда 
		ТипУпаковки=Перечисления.ТипыУпаковок.МультитоварнаяУпаковка;
	иначе	
		ТипУпаковки=Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
	КонецЕсли;
	//++Данилова Е.В. 04.02.2026 OUT-191 
	//++Данилова Е.В. 14.01.2026 ASU-2089 
	//Если ПравилаРаботыСАгрегациейЧЗ.ФормироватьНаборКодовАгрегацииНаПаллету Тогда
	Если Документы.Паллета.ФормироватьНаборКодовАгрегацииНаПаллету(Накладная,ПравилаРаботыСАгрегациейЧЗ) Тогда 
	//--Данилова Е.В. 04.02.2026
		СтруктураВозврата = ЗаполнитьАгрегациюМультиПаллетыПоНакладной(Накладная,ТипУпаковки); 
		
		Возврат СтруктураВозврата; 
	
	КонецЕсли; 
	//--Данилова Е.В. 14.01.2026 
	
	//НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	рБронирования = Документы.МаркировкаТоваровИСМП.ПолучитьЗабронироватьКодАгрегацииДляПалеты(Ссылка, Накладная,ТипУпаковки);			
	Если рБронирования.Успешно тогда			
		КодАгрегации = рБронирования.Данные;		
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
		|	Паллета.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Паллета КАК Паллета
		|ГДЕ
		|	Паллета.Ссылка <> &Ссылка
		|	И Паллета.Проведен
		|	И Паллета.ЛистыНабора.ШтрихкодУпаковкиПаллеты = &КодАгрегации";
		запрос.УстановитьПараметр("КодАгрегации",КодАгрегации);
		запрос.УстановитьПараметр("Ссылка",Ссылка);
		Выборка=запрос.Выполнить().Выбрать();
		пока выборка.Следующий() Цикл 
			//ОтменитьТранзакцию();
			СтруктураВозврата.успех=ложь;
			СтруктураВозврата.Ошибка=СтрШаблон("Обнаружен дубль кода %1 в %2",КодАгрегации,выборка.ссылка);
			возврат СтруктураВозврата;
		КонецЦикла;	
		//ЗафиксироватьТранзакцию();
		
		
		Для каждого СтрТЧ из ЛистыНабора цикл
			СтрТЧ.ШтрихкодУпаковкиПаллеты=КодАгрегации;
		КонецЦикла;	
		
		ОбменДанными.Загрузка=Истина;
		Записать();	
	Иначе
		ТекстСообщения = СтрСоединить(рБронирования.Ошибки, Символы.ПС);
		СтруктураВозврата.успех=ложь;
		СтруктураВозврата.Ошибка=ТекстСообщения;
		возврат СтруктураВозврата;
	КонецЕсли;
	
	//Иначе
	//	СтруктураВозврата.успех=ложь;
	//	СтруктураВозврата.Ошибка="Свёртка по наименованию пока не реализована";
	//	возврат СтруктураВозврата;	
	//КонецЕсли;
	
	возврат СтруктураВозврата;
КонецФункции

Функция ОбработатьАгрегацииПаллет (ЗаполнятьАгрегации=ложь)  экспорт
	ТЗНакладных=ЛистыНабора.Выгрузить(,"Документ");
	ТЗНакладных.Свернуть("Документ");
	КоличествоДокументов=ТЗНакладных.Количество();
	для каждого ТекСтрока из ТЗНакладных цикл
		ТекНакладная=ТекСтрока.Документ;
		если ТипЗнч(ТекНакладная) <> тип("ДокументСсылка.РасходнаяНакладная") тогда
			Продолжить;
		КонецЕсли;
		ПравилаРаботыСАгрегациейЧЗ=МаркировкаКС.ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладной(ТекНакладная);
		если ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияПаллет тогда	
			если КоличествоДокументов>1 тогда
				ВызватьИсключение "Обнаружено требование агрегации в паллеты по "+ТекНакладная+". В паллете не должно быть других документов";
			КонецЕсли;
			            		 
			если ЗаполнятьАгрегации и не ПроверитьНаличиеАгрегаций() тогда 		 
				РезультатЗаполнения=ЗаполнитьАгрегациюПаллетыПоНакладной(ПравилаРаботыСАгрегациейЧЗ,ТекНакладная);
				
				если не РезультатЗаполнения.Успех тогда 
					ВызватьИсключение РезультатЗаполнения.Ошибка;
				иначе
					ОбменДанными.Загрузка=Истина;
					Записать();
					Возврат Истина;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 	 
	КонецЦикла;
	возврат Истина;
КонецФункции

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	// Кухарь А.Ю. 08.02.2025 начало
	если ПроверитьНаличиеАгрегаций() тогда
		ВызватьИсключение "Заполнены агрегации, отмена проведения запрещена";
	КонецЕсли;
	// Кухарь А.Ю. 08.02.2025 конец
	
КонецПроцедуры

// Кухарь А.Ю.  11.02.2025 начало
//MARK-1251
Функция ПроверитьНаличиеАгрегаций () Экспорт
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ТЧ.ШтрихкодУпаковкиПаллеты КАК ШтрихкодУпаковкиПаллеты
	|ПОМЕСТИТЬ ВремТЗ
	|ИЗ
	|	Документ.Паллета.ЛистыНабора КАК ТЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ первые 1
	|	ВремТЗ.ШтрихкодУпаковкиПаллеты КАК ШтрихкодУпаковкиПаллеты
	|ИЗ
	|	ВремТЗ КАК ВремТЗ
	|ГДЕ
	|	ВремТЗ.ШтрихкодУпаковкиПаллеты <> &ПустойШК";
	Запрос.Текст=СтрЗаменить(запрос.Текст,"Документ.Паллета.ЛистыНабора","&ТЧ");
	запрос.УстановитьПараметр("ТЧ",ЛистыНабора.Выгрузить(,"ШтрихкодУпаковкиПаллеты"));
	запрос.УстановитьПараметр("ПустойШК",Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка());
	
	Выборка=запрос.Выполнить().Выбрать();
	пока выборка.Следующий() цикл
		возврат Истина;
	КонецЦикла;
	
	возврат ложь;
	
КонецФункции

// Кухарь А.Ю.  11.02.2025 конец 

// Кухарь А.Ю.  10.06.2025 начало
Функция ПолучитьТаблицуАртикуловПаллеты (Паллета, Знач Накладная)
	если ложь тогда Паллета = документы.Паллета.СоздатьДокумент();КонецЕсли;
	СтруктураДанных = Новый Структура("Номенклатура, ПунктДоставки, Договор, Дата, Контрагент, ПостояннаяАкция");
	
	ЗаполнитьЗначенияСвойств(СтруктураДанных, Накладная);
	
	ЗапросНоменклатура = Новый Запрос;
	
	
	ТЗ_Номенклатура = Паллета.Товары.Выгрузить(); 
	//++Данилова Е.В. 24.03.2026 ASU-2089
	//ТЗ_Номенклатура.свернуть("Номенклатура");
	ТЗ_Номенклатура.свернуть("Продукция");
	//--Данилова Е.В. 24.03.2026 
	МассивНоменклатуры = ТЗ_Номенклатура.ВыгрузитьКолонку("Продукция");	
	СтруктураДанных.Номенклатура = МассивНоменклатуры;
	
	ТЗ_Матриц = ПолучитьТаблицуМатрицСрезПоследних(СтруктураДанных);
	
	ТЗ_Матриц.Свернуть("АртикулКонтрагента");
	возврат ТЗ_Матриц;
	
КонецФункции
// Кухарь А.Ю.  10.06.2025 конец

//++Данилова Е.В. 14.01.2026

Функция ЗаполнитьАгрегациюМультиПаллетыПоНакладной(Знач Накладная, Знач ТипУпаковки) Экспорт 
	
	СтруктураВозврата=новый Структура("Успех,Ошибка",Истина,"");
	
	Запрос = Новый Запрос;
	Если Накладная.ОтгрузкаКомплектов Тогда 		 
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяКомплектующие.Номенклатура КАК Номенклатура,
		|	РасходнаяНакладнаяКомплектующие.Продукция КАК Продукция,
		|	СУММА(РасходнаяНакладнаяКомплектующие.Количество) КАК Количество
		|ИЗ
		|	Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
		|ГДЕ
		|	РасходнаяНакладнаяКомплектующие.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяКомплектующие.Продукция,
		|	РасходнаяНакладнаяКомплектующие.Номенклатура";
		
		Запрос.УстановитьПараметр("Ссылка", Накладная); 	  	 	 
		
	Иначе 
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяКомплектующие.Номенклатура КАК Номенклатура,
		|	РасходнаяНакладнаяКомплектующие.Номенклатура КАК Продукция,
		|	СУММА(РасходнаяНакладнаяКомплектующие.Количество) КАК Количество
		|ИЗ
		|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяКомплектующие
		|ГДЕ
		|	РасходнаяНакладнаяКомплектующие.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяКомплектующие.Номенклатура,
		|	РасходнаяНакладнаяКомплектующие.Номенклатура";
		
		Запрос.УстановитьПараметр("Ссылка", Накладная); 		 
		
	КонецЕсли;
	
	ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
	ТаблицаТоваров.Колонки.Добавить("ЕстьВЛН",Новый ОписаниеТипов("Булево")); 
	 
	//++Данилова Е.В. 05.02.2026 OUT-191 	 
	//Документы.Паллета.ЗаполнитьНоменклатуру(ЭтотОбъект);
	ТЗТовары = документы.Паллета.ПолучитьТЗТоварыПоПаллете(ЭтотОбъект); 
	//ТЗТовары = Товары.Выгрузить(); 
	//--Данилова Е.В. 05.02.2026   
	Для каждого СтрокаТоваров  Из ТЗТовары Цикл
		Если СтрокаТоваров.Накладная <> Накладная  Тогда
		
			Продолжить; 	
		
		КонецЕсли;
		КоличествоТовараВПаллете = СтрокаТоваров.Количество;
		Отбор = Новый Структура("Номенклатура",СтрокаТоваров.Номенклатура);
		СтрокиНайденные = ТаблицаТоваров.НайтиСтроки(Отбор);
		
		Для каждого СтрокаНайденные Из СтрокиНайденные Цикл 
			
			Если КоличествоТовараВПаллете = 0 Тогда
				
				Прервать; 
				
				
			КонецЕсли;
			
			Кол = Мин(КоличествоТовараВПаллете,СтрокаНайденные.Количество);
			
			СтрокаНайденные.Количество = Кол; 
			СтрокаНайденные.ЕстьВЛН = Истина;
			КоличествоТовараВПаллете = КоличествоТовараВПаллете - Кол; 
			
		КонецЦикла;
		
	КонецЦикла;
	
	Отбор = Новый Структура("ЕстьВЛН",Ложь);
	СтрокиНайденные = ТаблицаТоваров.НайтиСтроки(Отбор);
	Для каждого СтрокаНайденная Из СтрокиНайденные Цикл
		
		ТаблицаТоваров.Удалить(СтрокаНайденная); 	
		
	КонецЦикла;
	///////////////////////////////////////////////////  
	
	СтруктураДанных = Новый Структура("Номенклатура, ПунктДоставки, Договор, Дата, Контрагент, ПостояннаяАкция");
	
	ЗаполнитьЗначенияСвойств(СтруктураДанных, Накладная);
	
	МассивНоменклатуры = ТаблицаТоваров.ВыгрузитьКолонку("Продукция");	
	СтруктураДанных.Номенклатура = МассивНоменклатуры;
	
	ТЗ_Матриц = ПолучитьТаблицуМатрицСрезПоследних(СтруктураДанных);
	
	ТЗ_Матриц.Свернуть("Номенклатура,АртикулКонтрагента");
	
	СоответствиеНоменклатураАртикул = Новый Соответствие; 
	Для каждого СтрокаТЧ Из ТЗ_Матриц Цикл
		
		СоответствиеНоменклатураАртикул.Вставить(СтрокаТЧ.Номенклатура,СтрокаТЧ.АртикулКонтрагента); 	
	КонецЦикла; 
	
	ТаблицаТоваров.Колонки.Добавить("АртикулКонтрагента",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50))); 
	Для каждого СтрокаТЗ Из ТаблицаТоваров Цикл
		
		АртикулМЦ = СоответствиеНоменклатураАртикул.Получить(СтрокаТЗ.Продукция);
		Если АртикулМЦ <> Неопределено Тогда
			
			СтрокаТЗ.АртикулКонтрагента = АртикулМЦ; 	
			
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗАртикулы.Номенклатура КАК Номенклатура,
	|	ТЗАртикулы.АртикулКонтрагента КАК АртикулКонтрагента
	|ПОМЕСТИТЬ ТЗАртикулы
	|ИЗ
	|	&ТЗАртикулы КАК ТЗАртикулы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗАртикулы.АртикулКонтрагента КАК АртикулКонтрагента,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТЗАртикулы.Номенклатура) КАК КоличествоТоваров
	|ИЗ
	|	ТЗАртикулы КАК ТЗАртикулы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЗАртикулы.АртикулКонтрагента
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТЗАртикулы.Номенклатура) = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗАртикулы.АртикулКонтрагента КАК АртикулКонтрагента,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТЗАртикулы.Номенклатура) КАК КоличествоТоваров
	|ИЗ
	|	ТЗАртикулы КАК ТЗАртикулы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЗАртикулы.АртикулКонтрагента
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТЗАртикулы.Номенклатура) > 1";
	//Запрос.УстановитьПараметр("ТЗАртикулы",ТЗ_Матриц);
	Запрос.УстановитьПараметр("ТЗАртикулы",ТаблицаТоваров);
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	МассивАртикуловМоно 	= ПакетЗапросов[1].Выгрузить().ВыгрузитьКолонку("АртикулКонтрагента"); 
	МассивАртикуловМульти 	= ПакетЗапросов[2].Выгрузить().ВыгрузитьКолонку("АртикулКонтрагента");	 
 
	КоличествоКодовДляБронирования = МассивАртикуловМоно.Количество() + МассивАртикуловМульти.Количество();
	
	Если КоличествоКодовДляБронирования = 0  Тогда
		
		
		СтруктураВозврата.Успех = Ложь;
		СтруктураВозврата.Ошибка = "Не найдены артикулы контрагентов по матрице!"; 
		
		Возврат СтруктураВозврата; 
		
	КонецЕсли;
		
	СоответствиеАртикулКМ = Новый Соответствие;
	Если МассивАртикуловМоно.Количество() > 0 Тогда 
		
		ТипУпаковки = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка; 
		резБронирования = БронированиеКодаЧЗПаллеты(МассивАртикуловМоно,Накладная,ТипУпаковки,СоответствиеАртикулКМ);
		
		Если резБронирования.Успех = Ложь Тогда
		
			Возврат резБронирования; 	
		
		КонецЕсли;

	КонецЕсли;
	
	Если МассивАртикуловМульти.Количество() > 0 Тогда 
		
		ТипУпаковки = Перечисления.ТипыУпаковок.МультитоварнаяУпаковка; 
		резБронирования = БронированиеКодаЧЗПаллеты(МассивАртикуловМульти,Накладная,ТипУпаковки,СоответствиеАртикулКМ); 
		
		Если резБронирования.Успех = Ложь Тогда
		
			Возврат резБронирования; 	
		
		КонецЕсли;
	КонецЕсли;
	
	МассивОшибок = Новый Массив; 
	
	//СоответствиеПродукцияКМ = Новый Соответствие; 
	//Для каждого ЭлементСоответствия Из СоответствиеАртикулКМ Цикл
	//	Для каждого ЭлСоот Из СоответствиеНоменклатураАртикул Цикл
	//		
	//		Если ЭлСоот.Значение = ЭлементСоответствия.Ключ Тогда
	//			
	//			СоответствиеПродукцияКМ.Вставить(ЭлСоот.Ключ,ЭлементСоответствия.Значение);	
	//			
	//		КонецЕсли;	
	//		
	//	КонецЦикла;		
	//КонецЦикла;
	
	ТаблицаТоваров.Колонки.Добавить("КМ", Новый ОписаниеТипов("СправочникСсылка.ШтрихкодыУпаковокТоваров")); 
	
	Для каждого СтрокаТЧ Из ТаблицаТоваров  Цикл
		
		//КМ = СоответствиеПродукцияКМ.Получить(СтрокаТЧ.Продукция); 
		КМ = СоответствиеАртикулКМ.Получить(СтрокаТЧ.АртикулКонтрагента);
		Если КМ <> Неопределено Тогда 
			СтрокаТЧ.КМ = КМ;
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого СтрокаЛН  Из ЛистыНабора Цикл 
		
		Если СтрокаЛН.Документ <> Накладная Тогда
			
			Продолжить;	
			
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
		Запрос.УстановитьПараметр("ТЧТовары",ТаблицаТоваров);
		Запрос.УстановитьПараметр("ссылка",СтрокаЛН.ЛистНабора);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧТовары.Номенклатура КАК Номенклатура,
		|	ТЧТовары.Количество КАК Количество,
		|	ТЧТовары.КМ КАК КМ
		|ПОМЕСТИТЬ ТЧКМ
		|ИЗ
		|	&ТЧТовары КАК ТЧТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧКМ.Номенклатура КАК Номенклатура,
		|	ТЧКМ.Количество КАК Количество,
		|	ТЧКМ.КМ КАК КМ
		|ПОМЕСТИТЬ ВТТКМ
		|ИЗ
		|	ТЧКМ КАК ТЧКМ
		|ГДЕ
		|	ТЧКМ.Количество > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛистНабораТовары.Номенклатура КАК Номенклатура,
		|	ВТТКМ.КМ КАК КМ
		|ПОМЕСТИТЬ ВТВариантыПоТоварам
		|ИЗ
		|	Документ.ЛистНабора.Товары КАК ЛистНабораТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТКМ КАК ВТТКМ
		|		ПО ЛистНабораТовары.Номенклатура = ВТТКМ.Номенклатура
		|			И (ВТТКМ.Количество >= ЛистНабораТовары.Количество)
		|ГДЕ
		|	ЛистНабораТовары.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛистНабораТовары.Номенклатура,
		|	ВТТКМ.КМ
		|ИЗ
		|	Документ.ЛистПереукладки.Товары КАК ЛистНабораТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТКМ КАК ВТТКМ
		|		ПО ЛистНабораТовары.Номенклатура = ВТТКМ.Номенклатура
		|			И (ВТТКМ.Количество >= ЛистНабораТовары.Количество)
		|ГДЕ
		|	ЛистНабораТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТВариантыПоТоварам.КМ КАК КМ
		|ПОМЕСТИТЬ ВТВариантыКМ
		|ИЗ
		|	ВТВариантыПоТоварам КАК ВТВариантыПоТоварам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛистНабораТовары.Номенклатура КАК Номенклатура,
		|	ВТВариантыКМ.КМ КАК КМ
		|ПОМЕСТИТЬ ВтТоварыЛН
		|ИЗ
		|	Документ.ЛистНабора.Товары КАК ЛистНабораТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВариантыКМ КАК ВТВариантыКМ
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ЛистНабораТовары.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛистНабораТовары.Номенклатура,
		|	ВТВариантыКМ.КМ
		|ИЗ
		|	Документ.ЛистПереукладки.Товары КАК ЛистНабораТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВариантыКМ КАК ВТВариантыКМ
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ЛистНабораТовары.Ссылка = &Ссылка
		|;
		|
		//Валетов + 15,04,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-9451
		//Если были ЛН с 2 товарами, исключались из паллет оба товара. Переделал ВТ Исключения ,чтоб исключать товар а не Коды 
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	ВтТоварыЛН.КМ КАК КМ
		//|ПОМЕСТИТЬ ВТКМИсключить
		//|ИЗ
		//|	ВтТоварыЛН КАК ВтТоварыЛН
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВариантыПоТоварам КАК ВТВариантыПоТоварам
		//|		ПО ВтТоварыЛН.Номенклатура = ВТВариантыПоТоварам.Номенклатура
		//|			И ВтТоварыЛН.КМ = ВТВариантыПоТоварам.КМ
		//|ГДЕ
		//|	ВТВариантыПоТоварам.КМ ЕСТЬ NULL
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ ПЕРВЫЕ 1
		//|	ВТВариантыПоТоварам.КМ КАК КМ
		//|ИЗ
		//|	ВТВариантыПоТоварам КАК ВТВариантыПоТоварам
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКМИсключить КАК ВТКМИсключить
		//|		ПО (ВТКМИсключить.КМ = ВТВариантыПоТоварам.КМ)
		//|ГДЕ
		//|	ВТКМИсключить.КМ ЕСТЬ NULL";     
		////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВтТоварыЛН.Номенклатура КАК Номенклатура
		|	ПОМЕСТИТЬ ВТКМИсключить
		|ИЗ
		|	ВтТоварыЛН КАК ВтТоварыЛН
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВариантыПоТоварам КАК ВТВариантыПоТоварам
		|		ПО ВтТоварыЛН.Номенклатура = ВТВариантыПоТоварам.Номенклатура
		|		И ВтТоварыЛН.КМ = ВТВариантыПоТоварам.КМ
		|ГДЕ
		|	ВТВариантыПоТоварам.КМ ЕСТЬ NULL
		|;
		|	
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТВариантыПоТоварам.КМ КАК КМ
		|ИЗ
		|	ВТВариантыПоТоварам КАК ВТВариантыПоТоварам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКМИсключить КАК ВТКМИсключить
		|		ПО (ВТКМИсключить.Номенклатура = ВТВариантыПоТоварам.Номенклатура)
		|ГДЕ
		|	ВТКМИсключить.Номенклатура ЕСТЬ NULL";
		//Валетов -
		
		//Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий(); 
		
		СтрокаЛН.ШтрихкодУпаковкиПаллеты =  ВыборкаДетальныеЗаписи.КМ; 
		
		Для каждого СтрокаТЧ Из СтрокаЛН.ЛистНабора.Товары Цикл
			
			СтрокиТЗ = ТаблицаТоваров.НайтиСтроки(Новый Структура("Номенклатура,КМ",СтрокаТЧ.Номенклатура,ВыборкаДетальныеЗаписи.КМ)); 	
			Для каждого СтрокаТЗ Из СтрокиТЗ Цикл
				
				СтрокаТЗ.Количество = СтрокаТЗ.Количество - СтрокаТЧ.Количество; 	
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	//проверка, что все распределено 
	КоличествоНеРаспределенное = ТаблицаТоваров.Итог("Количество");
	Если КоличествоНеРаспределенное > 0 Тогда
		
		СтруктураВозврата.успех=ложь;
		СтруктураВозврата.Ошибка="Не совпадает количество, необходимое к распределению, с количеством в ЛН";
		
		Возврат СтруктураВозврата; 
		
	КонецЕсли;
	ОбменДанными.Загрузка=Истина;
	Записать();	
	//Иначе
	//	ТекстСообщения = СтрСоединить(рБронирования.Ошибки, Символы.ПС);
	//	СтруктураВозврата.успех=ложь;
	//	СтруктураВозврата.Ошибка=ТекстСообщения;
	//	возврат СтруктураВозврата;
	//КонецЕсли;
	
	
	
	Возврат СтруктураВозврата; 
КонецФункции

Функция БронированиеКодаЧЗПаллеты( Знач МассивАртикулов, Накладная, Знач ТипУпаковки,СоответствиеАртикулКМ)
	
	КоличествоКодовДляБронирования = МассивАртикулов.Количество();
	СтруктураВозврата=новый Структура("Успех,Ошибка",Истина,"");	
	
	рБронирования = Документы.МаркировкаТоваровИСМП.ПолучитьЗабронироватьКодАгрегацииДляМультиПаллеты(Ссылка, Накладная,КоличествоКодовДляБронирования,ТипУпаковки);
	
	Если рБронирования.Успешно тогда			
		КодыАгрегации = рБронирования.Данные;		
		
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Паллета.Ссылка КАК Ссылка,
		|	ПаллетаЛистыНабора.ШтрихкодУпаковкиПаллеты КАК ШтрихкодУпаковкиПаллеты
		|ИЗ
		|	Документ.Паллета.ЛистыНабора КАК ПаллетаЛистыНабора
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Паллета КАК Паллета
		|		ПО ПаллетаЛистыНабора.Ссылка = Паллета.Ссылка
		|ГДЕ
		|	Паллета.Ссылка <> &Ссылка
		|	И Паллета.Проведен
		|	И ПаллетаЛистыНабора.ШтрихкодУпаковкиПаллеты В(&КодыАгрегации)";
		запрос.УстановитьПараметр("КодыАгрегации",КодыАгрегации);
		запрос.УстановитьПараметр("Ссылка",Ссылка);
		Выборка=запрос.Выполнить().Выбрать();
		МассивОшибок = Новый Массив; 
		пока выборка.Следующий() Цикл
			
			МассивОшибок.Добавить(СтрШаблон("Обнаружен дубль кода %1 в %2",выборка.ШтрихкодУпаковкиПаллеты,выборка.ссылка));
			
		КонецЦикла;
		
		Если МассивОшибок.Количество() > 0  Тогда
			СтруктураВозврата.успех=ложь;
			СтруктураВозврата.Ошибка = СтрСоединить(МассивОшибок,","); 	
			возврат СтруктураВозврата;
		КонецЕсли;
		
		Если КодыАгрегации.Количество() <> КоличествоКодовДляБронирования Тогда
			
			СтруктураВозврата.успех=ложь;
			СтруктураВозврата.Ошибка = "Не совпадает количество необходимых кодов ЧЗ и заброниваронное количество кодов!"; 
			Возврат СтруктураВозврата; 
			
		КонецЕсли; 	
		
		Сч = 0; 
		Для каждого АртикулИзМассива Из МассивАртикулов Цикл
			
			СоответствиеАртикулКМ.Вставить(АртикулИзМассива,КодыАгрегации[Сч]); 	
			
			Сч = Сч +1 ; 
		КонецЦикла;
	Иначе
		ТекстСообщения = СтрСоединить(рБронирования.Ошибки, Символы.ПС);
		СтруктураВозврата.успех=ложь;
		СтруктураВозврата.Ошибка=ТекстСообщения;
		возврат СтруктураВозврата;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции


//--Данилова Е.В. 14.01.2026 
