Перем НачСостНакладной;
Перем НеКонтролироватьЗапись;
Перем НеКонтролироватьТА;
Перем НеВыгружатьДокумент;
Перем НеконтролироватьНаличиеСФ;
Перем НужноВыгружать;
Перем КаталогЕкода, КаталогЕкодаФТП экспорт;
Перем ТЗНеизменяемыхРеквизитов;

Перем ПростоЗаписать;



Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	если Валюта=Справочники.Валюты.ПустаяСсылка() тогда
		Валюта=Справочники.Валюты.НайтиПоКоду("810");
	КонецЕсли;
	
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;	
	если  ПростоЗаписать=Истина тогда Возврат конецЕсли;

	КодКонтрагента="";
	КодРодителяКонтрагента="";
	
	ЕстьИзменения		=Модифицированность();
	ТипУзла=ПараметрыСеанса.ТипУзла;
	
	//Кухарь 10.12.15 начало
	//Запрет создание документов по виртуальным складам в ЦО
	Если Склад.ВидСклада=Перечисления.ВидСклада.ВиртуальныйДляСклада и ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
		#Если клиент тогда
			Сообщить("В ЦО запрещено создание документов по виртуальным складам");
		#КонецЕсли
		Отказ=Истина;
	КонецЕсли;
	//Кухарь 10.12.15 конец
	
	
	#Если КЛИЕНТ Тогда
		
		Если НЕ ОбменДанными.Загрузка Тогда		
			// упд только в офисе формируются
			Если  ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда			 
				
				// ищем упд, если еще нет, то генерируем.
				Если СостояниеНакладной = Перечисления.СостоянияПередачиМарокМП.ГотовКПодписанию Тогда
					
					УПД = Неопределено;
					УПД = УПДНакладной(Ссылка,Организация);
					//Если БелаяСФ Тогда
					попытка
						Если УПД.Пустая() Тогда
							
							УПД_Объект=Документы.УПД.СоздатьДокумент();				
							
							ЗаполнитьШапкуДокумента(УПД_Объект,ПараметрыСеанса.Пользователь,ПараметрыСеанса.ВалютаНац, "Продажа");				
							УПД_Объект.Заполнить(Ссылка);
							УПД_Объект.Организация=Организация;
							УПД_Объект.Дата=Дата;			
							
							УстановитьНомерДокумента(УПД_Объект);
							
							УПД_Объект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
							
							УПД=УПД_Объект.Ссылка;
							
						КонецЕсли;		
					исключение
						ЗаписатьВЛог("Маркировка"," Ошибка записи УПД для  - "+ссылка+ОписаниеОшибки(),"Важное");		
					конецПопытки;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
	#КонецЕсли	
	//Нечаева 10,06,24 ---

	
	    
	
	
	
	//-------------------------------------------------------------------------------------------------------------------------
	//-------------------------------------------------------------------------------------------------------------------------
	
	#Если КЛИЕНТ Тогда
					
		Если
			//крохин начало	21.02.2011
			//в филиалах тоже редактируем РНК только на текущую дату
			//	ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение 
			(ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение  ИЛИ ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение)
			//крохин конец 	21.02.2011
			И Отгружен=Перечисления.Отгружен.Резерв 
			И СостояниеНакладной=Перечисления.СостоянияПередачиМарокМП.ВРаботе 		
			И РежимЗаписи=РежимЗаписиДокумента.Проведение
			И Дата<ТекущаяДата()		
			И НеКонтролироватьТА=Ложь 
			И НЕ ПараметрыСеанса.ОтключитьКонтрольРезервов
			Тогда
			//кухарь 05.09.14 начало
			//убираем лишние вопросы при изменении РНК обработкой
			если не ПараметрыСеанса.ЗапущенаОбработка тогда
				 Дата					=ТекущаяДата();

				//Ответ=Вопрос("Резервные накладные корректируются только на текущую дату ! Изменить дату на текущую ?",РежимДиалогаВопрос.ОКОтмена,10);				
				////Кухарь 27.11.18 конец	
				//Если Ответ=КодВозвратаДиалога.ОК Тогда
				//					мТекущаяДатаДокумента = Дата;
				//	Дата					=ТекущаяДата();
				//	Если ПроверитьНомерДокумента(ЭтотОбъект, мТекущаяДатаДокумента) Тогда		
				//		мТекущаяДатаДокумента	=Дата;			
				//	Иначе		
				//		Дата					=мТекущаяДатаДокумента;
				//	КонецЕсли;
				//	//крохин конец 08.01.2019
				//Иначе
				//	//Кухарь 04.12.18 начало
				//	//Поставим через 10 сек. закрытие вопроса
				//	Сообщить("Истёк таймаут вопроса на смену даты.");
				//	//Кухарь 04.12.18 конец	
				//	
				//	Отказ=Истина;					
				//	Возврат;		
				//КонецЕсли; 
				//кухарь 05.09.14 начало
				//убираем лишние вопросы при изменении РНК обработкой	
			иначе
				Дата=ТекущаяДата();
			КонецЕсли;
			//кухарь 05.09.14 конец 
		КонецЕсли;
		
		//Кухарь 11.07.19 перенёс комментарии *1 		
		
		//крохин начало 31.03.2011
		//запретим проводить будущим числом из формы
		Если  НЕ ОбменДанными.Загрузка Тогда
			Если КонецДня(Дата) > КонецДня(ТекущаяДата()) И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				Сообщить("Невозможно проведение будущей датой");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		//крохин конец 31.03.2011
	#КОНЕЦЕСЛИ
	
	//Кухарь 11.07.19 перенёс комментарии *2	
	// Кухарь А.Ю. 26.03.2021 начало
	//  	НачСостНакладной	=ПолучитьРеквизитыШапки(Ссылка,Новый Структура("СостояниеНакладной"),"Документ").СостояниеНакладной;
	НачРеквизиты= ПолучитьРеквизитыШапки(Ссылка,Новый Структура("СостояниеНакладной,Дата"),"Документ");
	НачСостНакладной	=НачРеквизиты.СостояниеНакладной; 
	НачДата				=НачРеквизиты.дата;
	// Кухарь А.Ю. 26.03.2021 конец
	
	
	////Нечаева 220622+++
	//Если не ОбменДанными.Загрузка  тогда   
	//	если СостояниеНакладной<>Перечисления.СостоянияНакладной.Отгружена и СостояниеНакладной<>Перечисления.СостоянияНакладной.ВРаботе 
	//		и  этотОбъект.СостояниеДокументов <> перечисления.СостояниеДокументов.НеВыписаны
	//	тогда
	//			
	//			Если ЭтотОбъект.СуммаДокумента <> ссылка.СуммаДокумента или ЭтотОбъект.КоличествоДокумента <>ссылка.КоличествоДокумента 
	//				или  ЭтотОбъект.Контрагент <> ссылка.Контрагент  Тогда
	//				
	//			   этотОбъект.СостояниеДокументов = перечисления.СостояниеДокументов.НеВыписаны;
	//			  //#Если клиент тогда
	//			   //    Сообщить("Поменяли признак выписаны документы.");
	//			   //#КонецЕсли
	//						
	//			конецЕсли;
	//		КонецЕсли;
	//	если СостояниеНакладной<>Перечисления.СостоянияНакладной.ВРаботе и ПредварительныйЗаказ=Истина тогда 
	//	// Кухарь А.Ю. 07.01.2023 конец
	//		ПредварительныйЗаказ=Ложь;
	//	КонецЕсли;
	//	// Кухарь А.Ю.  28.12.2022 конец
	//			
	//	Если ЕстьИзменения Тогда 			
	//		ГруппыТоваров		= ГруппыТоваровДокумента(ЭтотОбъект);
	//	конецЕсли;	
	//		
	//КонецЕсли;	
	////Нечаева 220622 ---
	
	Если ЭтоНовый() И Организация.Пустая() И НЕ Склад.Пустая() И НЕ Склад.Организация.Пустая() Тогда
		Организация=Склад.Организация;	
	КонецЕсли;
	
	ЕстьИзменения		=Модифицированность();	
		
	
	НадоОтправлять = истина;
	КодДоговора =  ЭтотОбъект.Ссылка.договор.код;
	  		
	Если ЕстьИзменения Тогда 
		СуммаДокумента		= Товары.Итог("Всего");
		ОбъемДокумента		= Товары.Итог("Объем");
		КоличествоДокумента = Товары.Итог("Количество");

	КонецЕсли;
		
	Если НачСостНакладной<>СостояниеНакладной Тогда
		
		
		
	КонецЕсли;

	
		
КонецПроцедуры

Функция ЗаменитьТочку(ИсхЧисло,КолПослеЗапятой)
	
	//Катаев+ 19/12/14
	//СтрокаЧ=Формат(ИсхЧисло,"ЧДЦ="+КолПослеЗапятой+"");
	СтрокаЧ=Формат(ИсхЧисло,"ЧДЦ="+КолПослеЗапятой+"; ЧН=");
	//Катаев- 19/12/14
	СтрокаЧ=Строка(СтрокаЧ);
	СтрокаЧ= СтрЗаменить(СтрокаЧ,",",".");
	
	Возврат СтрокаЧ;
	
КонецФункции

Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,Записывать=Ложь,Очищать=Истина)
	// 2011-11-21 сезонные бонусы ***
	//Для Каждого НаборДвижений Из ДвиженияПоРегистрам Цикл
	//	ИмяРегистра		=НаборДвижений.Ключ;
	//	ТаблицаДвижения =НаборДвижений.Значение;
	//	
	//	Если Движения.Найти(ИмяРегистра)=Неопределено Тогда Продолжить  КонецЕсли; 
	//	
	//	НаборЗаписей=Движения[ИмяРегистра];
	//	// *** 2011-11-21 сезонные бонусы
	//	//НаборЗаписей.Очистить();
	//	// ---------- заменено на:
	//	Если Очищать Тогда
	//		НаборЗаписей.Очистить();
	//	КонецЕсли;
	//	// 2011-11-21 сезонные бонусы ***
	//	
	//	Для Каждого Движение Из ТаблицаДвижения Цикл
	//		Запись=НаборЗаписей.Добавить();	
	//		ЗаполнитьЗначенияСвойств(Запись,Движение);	
	//		
	//		Запись.Регистратор=Ссылка;
	//	КонецЦикла;	
	//	
	////	Если Записывать Тогда
	//		НаборЗаписей.Записать();		
	////	КонецЕсли;
	//КонецЦикла;	
КонецПроцедуры 

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт	
	
	ДвиженияПоРегистрам=Неопределено;
	

КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	
	
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;	
	
	ПростоЗаписать=ложь; 
			
	
	Если НачСостНакладной<>СостояниеНакладной Тогда
		ЗаписатьИзменениеСостоянияНакладной(Ссылка,СостояниеНакладной);
	КонецЕсли;

	
	
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)	
	Организация			=Неопределено;
	СостояниеНакладной	=Неопределено;
	//крохин начало 25.05.2015
	//состояние накладной "в работе", иначе неверно отрабатывает "управление видимостью"
	СостояниеНакладной  = Перечисления.СостоянияПередачиМарокМП.ВРаботе;
	//крохин конец 25.05.2015
	Отгружен			=Неопределено;
	СостояниеДокументов	=Неопределено;	
	
	ДатаОформления		=Неопределено;
	
	Автор				=Неопределено;
	
	//крохин начало 27.02.2013
	//если склад не соответствует подразделению - не копируем
	ЭтотУзел = ПараметрыСеанса.ЭтотУзел;
	Если ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		Если Склад.ТипСклада = Перечисления.ТипСклада.Филиал Тогда
			Склад = Справочники.Склады.ПустаяСсылка();
		КонецЕсли;
	ИначеЕсли ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
		Если Склад.Подразделение <> ЭтотУзел.Подразделение Тогда
			Склад = Справочники.Склады.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	//крохин конец 27.02.2013
	
	
	Если Менеджер.Пустая() Тогда
		Менеджер=Контрагент.Менеджер;
		
	КонецЕсли;
	//крохин начало	
	Подразделение = Менеджер.Подразделение;
	Если Подразделение = Справочники.Подразделения.ПустаяСсылка() Тогда
		Подразделение = Склад.Подразделение;
	КонецЕсли;
	//крохин конец
	
	Если Договор.Пустая() Или Договор.НеИспользовать Тогда
		Договор=Контрагент.ОсновнойДоговор;			
	КонецЕсли; 
	
	
	//крохин начало 17.09.2013
	ОтгружатьПоНулевымЦенам = Ложь;
	ОтгружатьСПревышениемЛимитаКредита = Ложь;
	ОтгружатьСПросроченнойЗадолженостью = Ложь;
	ОтгрузкуРазрешил = Ложь;
	//крохин конец 17.09.2013 
	
	//крохин начало 19.05.2015
	РедактированиеУпаковки = Ложь;
	//крохин конец 19.05.2015
	//Кухарь 09.03.17 начало
	КоличествоПаллет=0;
	//Кухарь 09.03.17 конец	
	//Кухарь 18.10.17 начало
	ОбъемПаллет=0;
	//Кухарь 18.10.17 к
	//ПунктыДоставки.Очистить();
	
		
КонецПроцедуры







НеКонтролироватьЗапись	=Ложь;
НеКонтролироватьТА		=Ложь;
//крохин начало 15.02.2013
НеВыгружатьДокумент = Ложь;
//крохин конец 15.02.2013
//крохин начало 15.04.2013
НеконтролироватьНаличиеСФ = Ложь;
//крохин конец 15.04.2013
// нечаева 130122 ++
КаталогЕкода = Константы.КаталогЕКОД.Получить(); //\\SRVECOD\SFERAConnector2\EDI\
КаталогЕкодаФТП = "\\SRVECOD-C\SFERAConnector\EDI\";  // для уведомлений филиала
// нечаева 130122---
