Перем НомерДок;

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ОчиститьДвиженияДокументаПоИстории(Ссылка);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//крохин начало 29.05.2014
	//записи формируем только в ЦО, и надо перенести в "перед записью"
	Если ПараметрыСеанса.ЭтотУзел.ТипУзла <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		Возврат;	
	КонецЕсли;
	//крохин конец 29.05.2014
	пн = 0;
	
	// Кухарь А.Ю.  21.11.2022 начало
	Если не ОбменДанными.Загрузка и не ПараметрыСеанса.СверткаБазы тогда
		МассПустыхТипов=Товары.НайтиСтроки(новый Структура("ФР_ТипТовара",Справочники.ФР_ТипыТовара.ПустаяСсылка()));
		если МассПустыхТипов.Количество()>0 тогда
			СообщитьИзМодуля("В строчках документа не заполнен тип товара.");
			Отказ=Истина;
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	// Кухарь А.Ю.  21.11.2022 конец
	
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

// Шворобей ВЮ 02.11.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2098
Процедура ПриЗаписи(Отказ)
	
	Если НЕ Отказ И НЕ Ссылка.Пустая()
		И ДополнительныеСвойства.Свойство("РежимЗаписи") 
		И ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		//Лобан +++ 180814 Очистка Истории
		НЗ = РегистрыСведений.История.СоздатьНаборЗаписей();
		НЗ.Отбор.Документ.Установить(Ссылка,Истина);
		НЗ.Отбор.Реквизит.Установить("Декларация",Истина);
		НЗ.Записать();
		//Лобан --- 180814	
		
		НЗ = РегистрыСведений.История.СоздатьНаборЗаписей();
		НЗ.Отбор.Период.Установить(Дата,Истина);
		НЗ.Отбор.Документ.Установить(Ссылка,Истина);
		НЗ.Отбор.Реквизит.Установить("Декларация",Истина);
		
		Для Каждого Строка Из Товары Цикл
			Если НЕ Строка.Номенклатура.Пустая() Тогда
				Если ЗаписьВИсторию = Истина тогда
					
					РД = РегистрыСведений.Декларация.СоздатьНаборЗаписей();
					РД.Отбор.Документ.Установить(Ссылка,Истина);
					РД.Отбор.Объект.Установить(Строка.Номенклатура,Истина);
					
					ЗаписьРД = РД.Добавить(); 
					ЗаписьРД.Объект = Строка.Номенклатура;
					ЗаписьРД.ДатаНачала = ДатаНачала;
					ЗаписьРД.ДатаОкончания = ДатаОкончания;
					ЗаписьРД.Сертификат = Сертификат;
					ЗаписьРД.Документ = Ссылка;
					ЗаписьРД.Значение = Ссылка.СправочникДекларации;
					
					РД.Записать();
				Иначе
					
					РД = РегистрыСведений.Декларация.СоздатьНаборЗаписей();
					РД.Отбор.Документ.Установить(Ссылка,Истина);
					РД.Отбор.Объект.Установить(Строка.Номенклатура,Истина);
					
					ЗаписьРД = РД.Добавить(); 
					ЗаписьРД.Объект = Строка.Номенклатура;
					ЗаписьРД.ДатаНачала = ДатаНачала;
					ЗаписьРД.ДатаОкончания = ДатаОкончания;
					ЗаписьРД.Сертификат = Сертификат;
					ЗаписьРД.Документ = Ссылка;
					ЗаписьРД.Значение = Ссылка.СправочникДекларации;
					
					Запись = НЗ.Добавить();
					Запись.Период	= Дата; 	
					Запись.Объект	= Строка.Номенклатура;
					Запись.Реквизит = "Декларация";
					Запись.Документ = Ссылка;
					
					ФилиалДанные = Строка.Филиал; 
					
					Если СправочникДекларации.Пустая()тогда
						СД = Справочники.Декларация.СоздатьЭлемент();
					иначе
						СД =  СправочникДекларации.Ссылка.ПолучитьФорму();
					КонецЕсли;
					
					СД.ДатаНачала = ДатаНачала;
					СД.ДатаОкончания = ДатаОкончания;
					СД.ВидДокумента = ВидДок;
					СД.Изготовитель = Изготовитель;
					СД.Орган = Орган; 
					СД.Филиал = ФилиалДанные;
					СД.Наименование = НомерДокумента; 	
					СД.СтранаПроисхождения = СтранаПроисхождения;
					СД.Организация = Организация;
					СД.Сертификат = Сертификат;
					СД.Записать(); 
					
					СправочникДекларации = СД.Ссылка;
					ЗаписьРД.Значение	= СД.Ссылка;
					ЗаписьРД.Регистратор	= Ссылка;
					Запись.Значение	= СД.Ссылка;
					Запись.Регистратор	= Ссылка;	
					
					РД.Записать();
				КонецЕсли;
			КонецЕсли;		
		КонецЦикла;
		
		НЗ.Записать();
		
		// Кухарь А.Ю.  21.11.2022 начало
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ДекларацияТовары.Номенклатура.ЭтоГруппа
		|			ТОГДА ДекларацияТовары.Номенклатура
		|		ИНАЧЕ ДекларацияТовары.Номенклатура.Родитель
		|	КОНЕЦ КАК Модель,
		|	МАКСИМУМ(ДекларацияТовары.ФР_ТипТовара) КАК ФР_ТипТовараИзДекларации
		|ПОМЕСТИТЬ ТЗТовары
		|ИЗ
		|	Документ.Декларация.Товары КАК ДекларацияТовары
		|ГДЕ
		|	ДекларацияТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ДекларацияТовары.Номенклатура.ЭтоГруппа
		|			ТОГДА ДекларацияТовары.Номенклатура
		|		ИНАЧЕ ДекларацияТовары.Номенклатура.Родитель
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ 
		|	ТЗТовары.Модель КАК Модель,
		|	ТЗТовары.ФР_ТипТовараИзДекларации КАК ФР_ТипТовараИзДекларации,
		|	ТЗТовары.Модель.ФР_ТипТовара КАК МодельФР_ТипТовара
		|ИЗ
		|	ТЗТовары КАК ТЗТовары
		|ГДЕ
		|	ТЗТовары.ФР_ТипТовараИзДекларации <> ТЗТовары.Модель.ФР_ТипТовара";
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Пока Результат.Следующий() цикл
			МодельОбъект = Результат.модель.ПолучитьОбъект();
			МодельОбъект.ФР_ТипТовара = Результат.ФР_ТипТовараИзДекларации;
			МодельОбъект.Записать();
		КонецЦикла;
		// Кухарь А.Ю.  21.11.2022 конец
		
	КонецЕсли;
	
КонецПроцедуры
// Шворобей ВЮ 02.11.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2098
