
&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	ТаблицаПараметров = Новый ТаблицаЗначений;
	ТаблицаПараметров.Колонки.Добавить("Имя");
	ТаблицаПараметров.Колонки.Добавить("Значение");
	
	СтрокаТП = ТаблицаПараметров.Добавить();
	СтрокаТП.Имя = "Получатель";
	СтрокаТП.Значение = "shvorobei@collant.ru";
	
	СформироватьНаСервере(ТаблицаПараметров);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере(ТаблицаПараметров)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.Сформировать(ТаблицаПараметров);
КонецПроцедуры

