Процедура Сформировать(ТаблицаПараметров=НЕОПРЕДЕЛЕНО) Экспорт
	Запрос = Новый запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Взаиморасчеты.Контрагент,
	|	Взаиморасчеты.Регистратор
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты КАК Взаиморасчеты
	|ГДЕ
	|	Взаиморасчеты.Период МЕЖДУ &Дата1 И &Дата2
	|	И Взаиморасчеты.Контрагент.Владелец = &КолготкиМосква
	|	И Взаиморасчеты.Контрагент.Ведущий <> &ПустаяСсылка";
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Константы.ДатаЗапретаРедактирования.Получить()+86400));
	Запрос.УстановитьПараметр("Дата2", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("КолготкиМосква",Справочники.ИБ.НайтиПоКоду("SSP"));
	Запрос.УстановитьПараметр("ПустаяСсылка", Справочники.Контрагенты.ПустаяСсылка());
	Выборка = запрос.Выполнить().Выбрать();
	рег = РегистрыНакопления.Взаиморасчеты;
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.Регистратор.ПолучитьОбъект();
		//Объект = Документы.РасходнаяНакладная.СоздатьДокумент();
		//Катаев+ 23/05/14
		//Объект.Записать(РежимЗаписиДокумента.Проведение);
		ЗаписатьВЛог("ПроверкаВзаиморасчетов","Производится перепроведение документа "+ Объект,"Информация");
		Если ТипЗнч(Объект) = Тип("ДокументОбъект.РасходнаяНакладная") Тогда
			Объект.ЗаписьПриПроверкиВзаиморасчетов();
		Иначе
			Объект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		//Катаев- 23/05/14
		//НаборЗаписей = рег.СоздатьНаборЗаписей();
		//НаборЗаписей.Отбор.Регистратор.Значение = Выборка.Регистратор;
		//НаборЗаписей.Прочитать();
		//Данные = НаборЗаписей.Выгрузить();
		//Для Каждого стр из Данные Цикл
		//	стр.Контрагент = Выборка.Контрагент.Ведущий;
		//КонецЦикла;
		//НаборЗаписей.Загрузить(Данные);
		//НаборЗаписей.Записать();
	КонецЦикла;
КонецПроцедуры