Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	НачПериода=НачалоМесяца(НачалоМесяца(ТекущаяДата())-1);
	КонПериода=КонецМесяца(НачПериода);
	
	СуммаФОТ=0;	
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	КорректировкаЗадолженности.Ссылка
	|ИЗ
	|	Документ.КорректировкаЗадолженности КАК КорректировкаЗадолженности
	|ГДЕ
	|	КорректировкаЗадолженности.Дата МЕЖДУ &Дата1 И &Дата2
	|	И КорректировкаЗадолженности.Комментарий ПОДОБНО ""%ФОТ по водителям-экспедиторам%""
	|	И КорректировкаЗадолженности.СуммаДокумента < 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	КорректировкаЗадолженности.Дата";
	//Кухарь 13.02.19 начало	
	//запрос.УстановитьПараметр("Дата1",КонецМесяца(КонПериода)+1);
	//запрос.УстановитьПараметр("Дата2",КонецМесяца(КонецМесяца(КонПериода)+1));
	запрос.УстановитьПараметр("Дата1",НачПериода);
	запрос.УстановитьПараметр("Дата2",КонПериода);	
	//Кухарь 13.02.19 конец


	Результат=запрос.Выполнить().Выбрать();
	пока Результат.Следующий() цикл
		СуммаФОТ=СуммаФОТ+результат.Ссылка.СуммаДокумента;
	КонецЦикла;
	
	СуммаОбслуживание=0;
	запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ
	|	СУММА(ЗатратыОбороты.СуммаУпрОборот) КАК Сумма
	|ИЗ
	|	РегистрНакопления.Затраты.Обороты(
	|			&Дата1,
	|			&Дата2,
	|			,
	|			Подразделение В ИЕРАРХИИ (&Подразделение)
	|				И СтатьяЗатрат = &СтатьяЗатрат) КАК ЗатратыОбороты";
	запрос.УстановитьПараметр("Дата1",НачалоДня(НачПериода));
	запрос.УстановитьПараметр("Дата2",КонецДня(КонПериода));
	запрос.УстановитьПараметр("Подразделение",Справочники.Подразделения.НайтиПоКоду("GRP-0002"));
	запрос.УстановитьПараметр("СтатьяЗатрат",Справочники.СтатьиЗатрат.НайтиПоКоду("320 910"));
	результат=запрос.Выполнить().Выбрать();
	пока Результат.Следующий() цикл
		СуммаОбслуживание=СуммаОбслуживание+результат.Сумма;
	КонецЦикла;
    СуммаФОТ=Макс(СуммаФОТ,-1*СуммаФОТ);
	
	
	КоличествоДнейОтгрузки=0;
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ЗаявкаНаОтгрузкуНакладные.Ссылка.ДатаОтгрузки КАК ДатаОтгрузки,
	             |	ЗаявкаНаОтгрузкуНакладные.Автомобиль
	             |ИЗ
	             |	Документ.ЗаявкаНаОтгрузку.Накладные КАК ЗаявкаНаОтгрузкуНакладные
	             |ГДЕ
	             |	ЗаявкаНаОтгрузкуНакладные.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	             |	И ЗаявкаНаОтгрузкуНакладные.Ссылка.Проведен = ИСТИНА
	             |	И ЗаявкаНаОтгрузкуНакладные.Автомобиль.Родитель = &Автомобиль
	             |	И ЗаявкаНаОтгрузкуНакладные.НеОтгружать = ЛОЖЬ
	             |	И ЗаявкаНаОтгрузкуНакладные.ТипДоставки <> &Самовывоз";
	запрос.УстановитьПараметр("Дата1",НачПериода);
	запрос.УстановитьПараметр("Дата2",КонПериода);
	Запрос.УстановитьПараметр("Автомобиль",Справочники.Автомобили.НайтиПоКоду(144));
	запрос.УстановитьПараметр("Самовывоз",Перечисления.ТипыДоставки.Самовывоз);
	КоличествоДоставок=запрос.Выполнить().Выгрузить().Количество();
	
	
	
	если КоличествоДоставок=0 тогда
		Возврат;
	КонецЕсли;	
	
	ФотДоставки=СуммаФОТ/КоличествоДоставок;	
	ОбслуживаниеДоставки=СуммаОбслуживание/КоличествоДоставок;	
	//Возврат;
	
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДоставкаСобственнымТранспортомУслуги.Ссылка
	|ИЗ
	|	Документ.ДоставкаСобственнымТранспортом.Услуги КАК ДоставкаСобственнымТранспортомУслуги
	|ГДЕ
	|	ДоставкаСобственнымТранспортомУслуги.ПериодРасходов = &ПериодРасходов
	|	И ДоставкаСобственнымТранспортомУслуги.Ссылка.Проведен";
	запрос.УстановитьПараметр("ПериодРасходов",НачалоДня(НачПериода));
	результат=запрос.Выполнить().Выбрать();
	пока результат.Следующий() цикл
		//Сообщить("На начало периода уже есть документы");
		//Возврат;
		Прервать;
	КонецЦикла;
	
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДоставкаСобственнымТранспортомУслуги.Ссылка
	|ИЗ
	|	Документ.ДоставкаСобственнымТранспортом.Услуги КАК ДоставкаСобственнымТранспортомУслуги
	|ГДЕ
	|	ДоставкаСобственнымТранспортомУслуги.ПериодРасходов = &ПериодРасходов
	|	И ДоставкаСобственнымТранспортомУслуги.Ссылка.Проведен";
	запрос.УстановитьПараметр("ПериодРасходов",НачалоДня(КонПериода));
	результат=запрос.Выполнить().Выбрать();
	пока результат.Следующий() цикл
		//Сообщить("На конец периода уже есть документы");
		//Возврат;
		Прервать;
	КонецЦикла;
	
	
	
	
	
	
	
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкаНаОтгрузкуНакладные.Автомобиль КАК Автомобиль,
	|	ЗаявкаНаОтгрузкуНакладные.Накладная КАК Накладная,
	|	ЗаявкаНаОтгрузкуНакладные.Ссылка.ДатаОтгрузки КАК Дата,
	|	ВЫБОР
	|		КОГДА ЗаявкаНаОтгрузкуНакладные.ВидНакладной = ""ПНК""
	|			ТОГДА ВЫБОР
	|					КОГДА ЗаявкаНаОтгрузкуНакладные.ПунктДоставкиОтправитель.ТипДоставки = ЗНАЧЕНИЕ(перечисление.типыдоставки.транспортнаякомпания)
	|						ТОГДА ЗаявкаНаОтгрузкуНакладные.ПунктДоставкиОтправитель.ПунктПерегруза
	|					ИНАЧЕ ЗаявкаНаОтгрузкуНакладные.ПунктДоставкиОтправитель
	|				КОНЕЦ
	|		КОГДА ЗаявкаНаОтгрузкуНакладные.ПунктДоставкиПолучатель.ТипДоставки = ЗНАЧЕНИЕ(перечисление.типыдоставки.транспортнаякомпания)
	|			ТОГДА ЗаявкаНаОтгрузкуНакладные.ПунктДоставкиПолучатель.ПунктПерегруза
	|		ИНАЧЕ ЗаявкаНаОтгрузкуНакладные.ПунктДоставкиПолучатель
	|	КОНЕЦ КАК ПД
	|ИЗ
	|	Документ.ЗаявкаНаОтгрузку.Накладные КАК ЗаявкаНаОтгрузкуНакладные
	|ГДЕ
	|	ЗаявкаНаОтгрузкуНакладные.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|	И ЗаявкаНаОтгрузкуНакладные.Ссылка.Проведен = ИСТИНА
	|	И ЗаявкаНаОтгрузкуНакладные.Автомобиль.Родитель = &Автомобиль
	|	И ЗаявкаНаОтгрузкуНакладные.НеОтгружать = ЛОЖЬ
	|	И ЗаявкаНаОтгрузкуНакладные.ТипДоставки <> &Самовывоз
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|ИТОГИ ПО
	|	Автомобиль,
	|	Дата,
	|	Накладная,
	|	ПД
	|АВТОУПОРЯДОЧИВАНИЕ";
	//крохин конец 26.07.2015
	
	
	запрос.УстановитьПараметр("Дата1",НачПериода);
	запрос.УстановитьПараметр("Дата2",КонПериода);
	Запрос.УстановитьПараметр("Автомобиль",Справочники.Автомобили.НайтиПоКоду(144));
	запрос.УстановитьПараметр("Самовывоз",Перечисления.ТипыДоставки.Самовывоз);
	результат=запрос.Выполнить();
	
	
	//ОбработкаПрерыванияПользователя();
	
	
	
	
	
	ВыборкаПоДатам=Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Дата");
	
	пока ВыборкаПоДатам.Следующий() цикл
		ВыборкаПоАвтомобилям=ВыборкаПоДатам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Автомобиль");
		
		пока ВыборкаПоАвтомобилям.Следующий() цикл
			
			//чтобы не было дублей
			запрос=новый запрос;
			запрос.Текст="ВЫБРАТЬ
			             |	ДоставкаСобственнымТранспортом.Ссылка КАК ДСТ
			             |ИЗ
			             |	Документ.ДоставкаСобственнымТранспортом КАК ДоставкаСобственнымТранспортом
			             |ГДЕ
			             |	ДоставкаСобственнымТранспортом.Автомобиль = &Автомобиль
			             |	И ДоставкаСобственнымТранспортом.Услуги.ПериодРасходов = &ПериодРасходов
			             |	И ДоставкаСобственнымТранспортом.Проведен";
			запрос.УстановитьПараметр("Автомобиль",ВыборкаПоАвтомобилям.автомобиль);
			запрос.УстановитьПараметр("ПериодРасходов",ВыборкаПоДатам.Дата);
			ПроверкаРезультат=запрос.Выполнить().Выгрузить();
			если ПроверкаРезультат.Количество()>0 тогда
				//Сообщить("На автомобиль "+ВыборкаПоАвтомобилям.автомобиль+", на дату отгрузки "+Строка(ВыборкаПоДатам.Дата)+" уже создана "+ПроверкаРезультат.Получить(0).ДСТ);
				Продолжить;
			КонецЕсли;
			

			
			ДНМ=Документы.ДоставкаСобственнымТранспортом.СоздатьДокумент();
			днм.Автор=ПараметрыСеанса.Пользователь.ФизЛицо;
			ДНМ.Автомобиль=ВыборкаПоАвтомобилям.автомобиль;
			днм.Дата=ТекущаяДата();
			днм.ДатаБух=ТекущаяДата();
            днм.Организация=Справочники.Организации.НайтиПоКоду("SS-001");
			//Протестить завтра в копии
			//УстановитьНомерДокумента(ДНМ);
			ДНМ.УстановитьНовыйНомер("SST-");
			//Протестить завтра в копии
			
			
			//ФОТ
			СтрокаУслуга=ДНМ.Услуги.Добавить();
			СтрокаУслуга.ПериодРасходов=ВыборкаПоДатам.Дата;
			СтрокаУслуга.Комментарий="ФОТ";			
			СтрокаУслуга.Всего=ФотДоставки;
			//крохин начало 27.02.2019
			//СтрокаУслуга.ВидУслуги=Справочники.ВидыУслуг.НайтиПоКоду("94");
			СтрокаУслуга.ВидУслуги=Справочники.ВидыУслуг.НайтиПоКоду("000038000");
			//крохин конец 27.02.2019
			
			//ФОТ
		
			//Обслуживание
			СтрокаУслуга=ДНМ.Услуги.Добавить();
			СтрокаУслуга.ПериодРасходов=ВыборкаПоДатам.Дата;			
			СтрокаУслуга.Комментарий="Бензин и обслуживание";			
			СтрокаУслуга.Всего=ОбслуживаниеДоставки;
			//крохин начало 27.02.2019
			//СтрокаУслуга.ВидУслуги=Справочники.ВидыУслуг.НайтиПоКоду("93");
			СтрокаУслуга.ВидУслуги=Справочники.ВидыУслуг.НайтиПоКоду("000039000");
			//крохин конец 27.02.2019
			//Обслуживание
			
			
			
			
			ДНМ.Комментарий=Сред(строка(ВыборкаПоДатам.Дата),1,10);

			
			
			ВыборкаПоНакладным=ВыборкаПоАвтомобилям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Накладная");
			
			пока ВыборкаПоНакладным.Следующий() цикл			
								
				
				если ВыборкаПоНакладным.накладная.Метаданные().Имя<> "ЗаявкаВТранспортныйОтдел" тогда
					ПервыйПД=ВыборкаПоНакладным.накладная.пунктдоставки;
				иначе
					ПервыйПД=ВыборкаПоНакладным.накладная.пунктдоставкиполучатель;
				КонецЕсли;
				
				
				СтрокаВУСО=ДНМ.ДокументыТранспортнойкомпании.Добавить();
				СтрокаВУСО.Документ=ВыборкаПоНакладным.накладная;						
				СтрокаВУСО.датадок=ВыборкаПоНакладным.накладная.дата;
				
				если ВыборкаПоНакладным.накладная.Метаданные().Имя<> "ЗаявкаВТранспортныйОтдел"  тогда
					СтрокаВУСО.Регион=ВыборкаПоНакладным.накладная.ПунктДоставки.Регион;
					СтрокаВУСО.ПунктДоставки=ВыборкаПоНакладным.накладная.ПунктДоставки;
				иначе
					СтрокаВУСО.Регион=ВыборкаПоНакладным.накладная.ПунктДоставкиПолучатель.Регион;
					СтрокаВУСО.ПунктДоставки=ВыборкаПоНакладным.накладная.ПунктДоставкиПолучатель;
				КонецЕсли;
				
				если СтрокаВУСО.ПунктДоставки.ТипДоставки=Перечисления.ТипыДоставки.ТранспортнаяКомпания тогда
					СтрокаВУСО.ПунктДоставки=СтрокаВУСО.ПунктДоставки.ПунктПерегруза;
					СтрокаВУСО.Регион=СтрокаВУСО.ПунктДоставки.Регион;					
				КонецЕсли;
				
				СтрокаВУСО.Номердок=ВыборкаПоНакладным.накладная.номер;
				СтрокаВУСО.Виддок=ВыборкаПоНакладным.накладная.Метаданные().Синоним;
				Если ВыборкаПоНакладным.накладная.Метаданные().Имя="РасходнаяНакладная" или ВыборкаПоНакладным.накладная.Метаданные().Имя="ПриходнаяНакладная" тогда
					СтрокаВУСО.Объем=ВыборкаПоНакладным.накладная.ОбъемДокумента;
					СтрокаВУСО.КоличествоМест=ВыборкаПоНакладным.накладная.КоличествоКоробок;
					Если ВыборкаПоНакладным.Накладная.КоличествоДокумента > 0 Тогда
						СтрокаВУСО.Количество = ВыборкаПоНакладным.Накладная.КоличествоДокумента;
					Иначе
						СтрокаВУСО.Количество = 1;
					КонецЕсли;
				иначе
					СтрокаВУСО.Объем=ВыборкаПоНакладным.накладная.ОбъемКоробов;
					СтрокаВУСО.КоличествоМест=ВыборкаПоНакладным.накладная.КоличествоКоробок;
					Если ВыборкаПоНакладным.Накладная.КоличествоДокумента > 0 Тогда
						СтрокаВУСО.Количество = ВыборкаПоНакладным.Накладная.КоличествоДокумента;
					Иначе
						СтрокаВУСО.Количество = 1;
					КонецЕсли;							
				Конецесли;			
			КонецЦикла; //выборка по накладным
			днм.Записать(РежимЗаписиДокумента.Проведение);
			//Сообщить(днм.Номер+" записан");
		КонецЦикла;//выборка по автомобилям
	КонецЦикла;//выборка по датам
	
	
	
	
	
	//Сообщить("Обработка завершена");		
КонецПроцедуры
