Процедура ОбработкаПроведения(Отказ, Режим) 
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	// регистр ОстаткиГСМ Приход
	Движения.ОстаткиГСМ.Записывать = Истина;
	
	Движение 				= Движения.ОстаткиГСМ.ДобавитьПриход();
	
	Движение.Период 		= Дата;
	Движение.Автомобиль 	= Автомобиль;
	Движение.Количество 	= Количество;
	
	Записать_ЗаправкаНаМаршруте();
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПутевойЛист") Тогда		
		Автомобиль 	= ДанныеЗаполнения.Автомобиль;		
		кДокументу 	= ДанныеЗаполнения.Ссылка;	
		Количество	= ДанныеЗаполнения.Расход;
		Дата		= ТекущаяДата();		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//Кухарь  18.05.2022 начало
	//
	если не ЗначениеЗаполнено(кДокументу) тогда
		Сообщить("Укажите путевой лист");
		отказ=Истина;
	КонецЕсли;
	
	//Кухарь  18.05.2022 конец
		

	
	Если ЭтоНовый() Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
       	|	Ссылка
		|ИЗ
		|	Документ.ПутевойЛист КАК ПутевойЛист
		|ГДЕ
		|	Дата > &Дата
		|	И Автомобиль = &Автомобиль
		|	И НЕ ПометкаУдаления";
		
		Запрос.УстановитьПараметр("Дата",		кДокументу.Дата);
	   	Запрос.УстановитьПараметр("Автомобиль",	кДокументу.Автомобиль);
		Результат=Запрос.Выполнить();
		Если НЕ Результат.Пустой() тогда
			Сообщить("Существуют путевые листы на более позднюю дату чем текущий, пометьте их на удаление либо прикрепите текущую заправку к ним.");
			Отказ=Истина;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Записать_ЗаправкаНаМаршруте();	
КонецПроцедуры

Процедура Записать_ЗаправкаНаМаршруте()
	Если ЗначениеЗаполнено(кДокументу) Тогда	
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|	СУММА(Количество) КАК ЗаправкаНаМаршруте
		|ИЗ
		|	Документ.ЗаправкаГСМ
		|ГДЕ
		|	кДокументу = &кДокументу
		|	И Проведен";
		
		ЗаправкаНаМаршруте=0;
		
		Запрос.УстановитьПараметр("кДокументу",кДокументу);
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаправкаНаМаршруте=Выборка.ЗаправкаНаМаршруте;								
		КонецЕсли;
		
		ОстатокТопливаВозврат 	= кДокументу.ОстатокТопливаВыезд-кДокументу.Расход+кДокументу.ЗаправкаНаМаршруте;
		УстановитьРеквизитыОбъекта(кДокументу,Новый Структура("ЗаправкаНаМаршруте,ОстатокТопливаВозврат",ЗаправкаНаМаршруте,ОстатокТопливаВозврат));				
	КонецЕсли;
КонецПроцедуры
 