Функция ПолучитьГраницыПериода(ДатаПериода,Периодичность) Экспорт
	Границы=Новый Структура("Дата1,Дата2",НачалоДня(ДатаПериода),КонецДня(ДатаПериода));
	Если Периодичность=Перечисления.ПериодичностьОтчетов.Месяц Тогда
		Границы.Дата1=НачалоМесяца(ДатаПериода);
		Границы.Дата2=КонецМесяца(ДатаПериода);		
	ИначеЕсли Периодичность=Перечисления.ПериодичностьОтчетов.Квартал Тогда
		Границы.Дата1=НачалоКвартала(ДатаПериода);
		Границы.Дата2=КонецКвартала(ДатаПериода);
	ИначеЕсли Периодичность=Перечисления.ПериодичностьОтчетов.Год Тогда
		Границы.Дата1=НачалоГода(ДатаПериода);
		Границы.Дата2=КонецГода(ДатаПериода);
	КонецЕсли;
	
	Возврат Границы;
КонецФункции // получитьПериодОтчета()

Функция ПолучитьФормальныеПараметры(Формула) Экспорт
	Результат=Новый Структура("Результат,ФормальныеПараметры,ИсполняемаяФормула",Ложь);
	
	ТекФормула=Формула;	
	ФормальныеПараметры=Новый Соответствие;
	
	Поз1=Найти(ТекФормула,"{");
	Пока Поз1<>0 Цикл
		Поз2=Найти(ТекФормула,"}");			
		Если Поз1<>0 И Поз2<>0 Тогда
			ФормальныеПараметры.Вставить(Сред(ТекФормула,Поз1+1,Поз2-Поз1-1),3);		
			
			ТекФормула=Сред(ТекФормула,Поз2+1);
		КонецЕсли;	
		Поз1=Найти(ТекФормула,"{");
	КонецЦикла; 
	
	ИсполняемаяФормула=Формула;
	Для Каждого ФП Из ФормальныеПараметры Цикл		
		ИсполняемаяФормула=СтрЗаменить(ИсполняемаяФормула,"{"+ФП.Ключ+"}","ФактическиеПараметры.Получить("""+ФП.Ключ+""")");
	КонецЦикла;	
	
	Результат.Вставить("Результат",Истина);
	Результат.Вставить("ФормальныеПараметры",ФормальныеПараметры);
	Результат.Вставить("ИсполняемаяФормула",ИсполняемаяФормула);
	
	Возврат Результат;
КонецФункции //ПолучитьФормальныеПараметры(Формула)

// Изменить код справочника на позицию вверх
Процедура СдвинутьЭлементВверх(Ссылка) Экспорт	
	Если Ссылка=Неопределено  ИЛИ Ссылка.Пустая() Тогда Возврат КонецЕсли; 
	
	ВидСправочника	= Ссылка.Метаданные().Имя;
	МетаСпр			= Метаданные.Справочники[ВидСправочника];
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ
	|	Справочник."+ВидСправочника+" КАК Справочник
	|ГДЕ
	|	Справочник.Код < &Код";
	Если МетаСпр.Иерархический Тогда
		Запрос.Текст=Запрос.Текст+"
		|	И Справочник.Родитель = &Родитель";		
		Запрос.УстановитьПараметр("Родитель",Ссылка.Родитель);	
	КонецЕсли; 
	Если МетаСпр.Владельцы.Количество()>0 Тогда
		Запрос.Текст=Запрос.Текст+"
		|	И Справочник.Владелец = &Владелец";	
		Запрос.УстановитьПараметр("Владелец",Ссылка.Владелец);
	КонецЕсли;	
	Запрос.Текст=Запрос.Текст+"
	|
	|УПОРЯДОЧИТЬ ПО
	|	Справочник.Код УБЫВ";
	
	Запрос.УстановитьПараметр("Код",Ссылка.Код);
	
	
	
	ВерхнийОбъект=Неопределено;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВерхнийОбъект=Выборка.Ссылка.ПолучитьОбъект();	
	КонецЦикла; 
	
	Если ВерхнийОбъект<>Неопределено Тогда
		НовыйЭлемент=Справочники[ВидСправочника].СоздатьЭлемент();	
		ВременныйКод=НовыйЭлемент.Код;
		НовыйЭлемент=Неопределено;
		
		ТекОбъект			=Ссылка.ПолучитьОбъект();
		ТекКод				=Ссылка.Код;
		
		ТекОбъект.Код		=ВерхнийОбъект.Код;
		ВерхнийОбъект.Код	=ВременныйКод;
		
		ВерхнийОбъект.Записать();
		ТекОбъект.Записать();
		ВерхнийОбъект.Код=ТекКод;
		ВерхнийОбъект.Записать();	
	КонецЕсли;
КонецПроцедуры

Процедура СдвинутьЭлементВниз(Ссылка) Экспорт
	Если Ссылка=Неопределено ИЛИ Ссылка.Пустая() Тогда Возврат КонецЕсли; 
	
	ВидСправочника=Ссылка.Метаданные().Имя;
	МетаСпр			= Метаданные.Справочники[ВидСправочника];
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ
	|	Справочник."+ВидСправочника+" КАК Справочник
	|ГДЕ
	|	Справочник.Код > &Код";
	Если МетаСпр.Иерархический Тогда
		Запрос.Текст=Запрос.Текст+"
		|	И Справочник.Родитель = &Родитель";		
		Запрос.УстановитьПараметр("Родитель",Ссылка.Родитель);	
	КонецЕсли; 
	Если МетаСпр.Владельцы.Количество()>0 Тогда
		Запрос.Текст=Запрос.Текст+"
		|	И Справочник.Владелец = &Владелец";	
		Запрос.УстановитьПараметр("Владелец",Ссылка.Владелец);
	КонецЕсли;	
	Запрос.Текст=Запрос.Текст+"	
	|
	|УПОРЯДОЧИТЬ ПО
	|	Справочник.Код";
	
	Запрос.УстановитьПараметр("Код",Ссылка.Код);
	Запрос.УстановитьПараметр("Владелец",Ссылка.Владелец);
	Запрос.УстановитьПараметр("Родитель",Ссылка.Родитель);
	
	ВерхнийОбъект=Неопределено;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВерхнийОбъект=Выборка.Ссылка.ПолучитьОбъект();	
	КонецЦикла; 
	
	Если ВерхнийОбъект<>Неопределено Тогда
		НовыйЭлемент=Справочники[ВидСправочника].СоздатьЭлемент();	
		ВременныйКод=НовыйЭлемент.Код;
		НовыйЭлемент=Неопределено;
		
		ТекОбъект			=Ссылка.ПолучитьОбъект();
		ТекКод				=Ссылка.Код;
		
		ТекОбъект.Код		=ВерхнийОбъект.Код;
		ВерхнийОбъект.Код	=ВременныйКод;
		
		ВерхнийОбъект.Записать();
		ТекОбъект.Записать();
		ВерхнийОбъект.Код=ТекКод;
		ВерхнийОбъект.Записать();	
	КонецЕсли;
КонецПроцедуры //СдвинутьЭлементВниз(Ссылка)

