Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс=ПолучитьПрефиксНомеров(ЭтотОбъект);
КонецПроцедуры

//Катаев+ 11/11/13 Добавил проверку на папку при перетаскивании элемента
Процедура ПередЗаписью(Отказ)
	// Вставить содержимое обработчика.
	// Катаев+ 20/11/13 При обмене права не проверять
	//Отказ = ПроверкаПравНаГруппу(ЭтотОбъект.Родитель);
	Если Не ОбменДанными.Загрузка Тогда
		Отказ = ПроверкаПравНаГруппу(ЭтотОбъект.Родитель);
	КонецЕсли;
	//Катаев- 20/11/13
КонецПроцедуры

Функция ПроверкаПравНаГруппу(Папка)
	Отказ = Ложь;
	Если ПланыОбмена.Основной.ЭтотУзел().Код = "SNL" Тогда
		Возврат Отказ;	
	ИначеЕсли Папка = Справочники.Регионы.ПустаяСсылка() Тогда
		Возврат Истина;
	КонецЕсли;
	Узлы = ПолучитьПравоприемник(Папка);
	Если Узлы.Количество() = 0 Тогда
		Если ПланыОбмена.Основной.ЭтотУзел().Код <> "SNL" Тогда
			Отказ = Истина;
		КонецЕсли;
	Иначе
		МожноДобавить = Ложь;
		Для Каждого узел из Узлы Цикл
			Если узел.Ключ = ПланыОбмена.Основной.ЭтотУзел().Код Тогда
				МожноДобавить = Истина;
			КонецЕсли;
		КонецЦикла;
		Если Не МожноДобавить Тогда
			отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Отказ;
КонецФункции

Функция ПолучитьПравоприемник(Папка)
	Узлы = Новый Структура;
	спр = Справочники.Контрагенты;
	ИБ = Справочники.ИБ.НайтиПоКоду("SSP");
	НайденаяПапка = спр.НайтиПоНаименованию(Папка, Истина,, ИБ);
	Пока НайденаяПапка = Справочники.Контрагенты.ПустаяСсылка() Цикл
		Если Папка.Уровень() = 0 Тогда
			Возврат Узлы;
		Иначе
			Папка = Папка.Родитель;
			НайденаяПапка = спр.НайтиПоНаименованию(Папка, Истина,,ИБ);
		КонецЕсли;
	КонецЦикла;
	Пока НайденаяПапка.РегиональныеУзлы.Количество() = 0 И НайденаяПапка.Уровень() > 0 Цикл;
		НайденаяПапка = НайденаяПапка.Родитель;
	КонецЦикла;
	Для Каждого узел из НайденаяПапка.РегиональныеУзлы Цикл
		Узлы.Вставить(узел.КодУзла);
	КонецЦикла;
	Возврат Узлы;
КонецФункции
//Катаев- 11/11/13