#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьНастройки();
	УстановитьУсловноеОформление();
	УправлениеВидимостью();
    //ТоварыПриИзмененииНаСервере(); 
	ПодключаемыеКомандыВызовСервера.ПриСозданииНаСервере(Объект.Ссылка, ЭтотОбъект,	);	 
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТоварыПриИзмененииНаКлиенте(); 
	//++Данилова Е.В. 18.06.2026 Изм.№0000000008
	ПересчитатьИтогиНаКлиенте();
	//--Данилова Е.В. 18.06.2026
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ТоварыПриИзмененииНаКлиенте();
	//++Данилова Е.В. 18.06.2026 Изм.№0000000008
	ПересчитатьИтогиНаКлиенте();
	//--Данилова Е.В. 18.06.2026
КонецПроцедуры


#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ДваСкладаПриИзменении(Элемент)
	ОбновитьОтображениеДанных();
	УправлениеВидимостью();
	//ТоварыПриИзмененииНаСервере(); 
	ТоварыПриИзмененииНаКлиенте();
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = неопределено Тогда
	
		Возврат; 	
	
	КонецЕсли; 
	
	ТоварыПриИзмененииНаКлиенте(ложь,ТекущиеДанные.ПолучитьИдентификатор());  
	//++Данилова Е.В. 18.06.2026 Изм.№0000000008
	ПересчитатьИтогиНаКлиенте();
	//--Данилова Е.В. 18.06.2026
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоробокНаПаллетеПриИзменении(Элемент)
	//ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТоварыКоробокНаПаллетеПриИзмененииНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКОтгрузкеПриИзменении(Элемент)
	Текущиеданные = Элементы.Товары.ТекущиеДанные; 
	СоответствиеРеквизитыТоваров = ПолучитьРеквизитыТоваров(Текущиеданные.Номенклатура); 
	ТоварыКОтгрузкеПриИзмененииНаКлиенте(Текущиеданные,СоответствиеРеквизитыТоваров);  
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоробокКОтгрузкеПриИзменении(Элемент) 
	Текущиеданные = Элементы.Товары.текущиеданные;
	СоответствиеРеквизитыТоваров = ПолучитьРеквизитыТоваров(Текущиеданные.Номенклатура);
	ТоварыКоробокКОтгрузкеПриИзмененииНаКлиенте(Текущиеданные,СоответствиеРеквизитыТоваров);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПаллетКОтгрузкеПриИзменении(Элемент)
	ТекСтрока=Элементы.Товары.текущиеданные;
	ТоварыПаллетКОтгрузкеПриИзмененииНаКлиенте(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатурнаяМатрицаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные; 
	ИдентификаторСтроки = ТекущиеДанные.ПолучитьИдентификатор(); 
	
	ПараметрыМатрицы = Новый Структура();
	ПараметрыМатрицы.Вставить("Номенклатура",ТекущиеДанные.Номенклатура);
	ПараметрыМатрицы.Вставить("Контрагент",Объект.Контрагент);
	ПараметрыМатрицы.Вставить("Договор",Объект.Договор);
	ПараметрыМатрицы.Вставить("ПунктДоставки",Объект.ПунктДоставки);
	ПараметрыМатрицы.Вставить("Дата",КонецДня(Объект.Дата)); 
	МассивМатриц = ПолучитьСписокМатрицПоТовару(ПараметрыМатрицы); 
	Если МассивМатриц.Количество() > 0 Тогда
		НастройкиКомпоновки = ПолучитьНастройкиКомпоновкиДляМатриц(МассивМатриц);
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("РежимВыбора", Истина);
		ПараметрыОткрытияФормы.Вставить("МножественныйВыбор", Ложь);
		ПараметрыОткрытияФормы.Вставить("ЗакрыватьПриВыборе", Истина);
		ПараметрыОткрытияФормы.Вставить("ФиксированныеНастройки", НастройкиКомпоновки);
		ОповещениеЗакрытия = Новый ОписаниеОповещения("ПослеВыбораМатрицыВСтроке", ЭтотОбъект,ИдентификаторСтроки);
		ОткрытьФорму("Документ.Матрица.Форма.ФормаВыбораУпр", ПараметрыОткрытияФормы, ЭтотОбъект, , , ,
			ОповещениеЗакрытия);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	//++Данилова Е.В. 18.06.2026 Изм.№0000000008
	ПересчитатьИтогиНаКлиенте();
	//--Данилова Е.В. 18.06.2026
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура РасчитатьДанныеПополнения(Команда)
	РасчитатьДанныеПополненияНаСервере();
	ТоварыПриИзмененииНаКлиенте(); 
	//++Данилова Е.В. 18.06.2026 Изм.№0000000008
	ПересчитатьИтогиНаКлиенте();
	//--Данилова Е.В. 18.06.2026
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРНК(Команда)
	Если Параметры.Ключ.Пустая() Или Модифицированность Тогда
		Сообщить("Необходимо записать документ!");
		Возврат;
	КонецЕсли;
	СозданныеРНК = Новый Массив; 
	СоздатьРНКНаСервере(СозданныеРНК);
	Если СозданныеРНК.Количество() > 0  Тогда
		
		Для каждого РНКСозданное Из СозданныеРНК Цикл
			
			ОткрытьЗначение(РНКСозданное); 
			
		КонецЦикла;	
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьТолькоКороба(Команда)
	РасчитатьТолькоКоробаНаСервере();
	ТоварыПриИзмененииНаКлиенте();
	//++Данилова Е.В. 18.06.2026 Изм.№0000000008
	ПересчитатьИтогиНаКлиенте();
	//--Данилова Е.В. 18.06.2026
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявкуНаПерепаковку(Команда)
	Если Параметры.Ключ.Пустая() Тогда Возврат; КонецЕсли;
	
	Если Модифицированность Тогда
		Записать(); 
	КонецЕсли;
	
	СоздатьЗаявкуНаПерепаковкуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРНКИзЗаявок(Команда)
	Если Параметры.Ключ.Пустая() Тогда Возврат; КонецЕсли;
	
	Если Модифицированность Тогда
		Записать(); 
	КонецЕсли;
	
	СоздатьРНКИзЗаявокНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УбратьПунктДоставкиИзТовары(Команда)
	Для Каждого СтрТЧ Из Объект.Товары Цикл
		СтрТЧ.ПунктДоставки=неопределено;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СообщитьДокументыПути(Команда) 
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные; 
	Если ТекущиеДанные = Неопределено Тогда
	
		Возврат; 	
	
	КонецЕсли;
	СообщитьДокументыПутиНаСервере(ТекущиеДанные.ПолучитьИдентификатор());
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказыFBO(Команда)
	Если Параметры.Ключ.Пустая() Тогда Возврат; КонецЕсли;
	
	Если Модифицированность Тогда
		Записать(); 
	КонецЕсли;
	
	Если  НЕ ПроверитьЦеныПоМатрицеПередСозданиемЗаказовFBO() Тогда
		
		Возврат; 
		
	КонецЕсли;
	
	СоздатьЗаказыFBOНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодборРНК(Команда)
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытияФормы.Вставить("МножественныйВыбор", Истина);
	//ПараметрыОткрытияФормы.Вставить("ЗакрыватьПриВыборе", ложь);

	НастройкиКомпоновки = ПолучитьНастройкиКомпоновкиДляРНКВПути();
	ПараметрыОткрытияФормы.Вставить("ФиксированныеНастройки", НастройкиКомпоновки);
	ОповещениеЗакрытия = Новый ОписаниеОповещения("ПослеВыбораРНКВпути", ЭтотОбъект);
	ОткрытьФорму("Документ.РасходнаяНакладная.Форма.ФормаВыбораУпр", ПараметрыОткрытияФормы, ЭтотОбъект, , , ,
		ОповещениеЗакрытия);

КонецПроцедуры

&НаКлиенте
Процедура ПодборКМП(Команда)
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытияФормы.Вставить("МножественныйВыбор", Истина);
	//ПараметрыОткрытияФормы.Вставить("ЗакрыватьПриВыборе", ложь);
	НастройкиКомпоновки = ПолучитьНастройкиКомпоновкиДляКомплектации();
	ПараметрыОткрытияФормы.Вставить("ФиксированныеНастройки", НастройкиКомпоновки);
	ОповещениеЗакрытия = Новый ОписаниеОповещения("ПослеВыбораРНКВпути", ЭтотОбъект);
	ОткрытьФорму("Документ.Комплектация.Форма.ФормаВыбораУпр", ПараметрыОткрытияФормы, ЭтотОбъект, , , ,
		ОповещениеЗакрытия);
КонецПроцедуры

&НаКлиенте
Процедура СортировкаПоНоменклатуре(Команда)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные; 
	Если ТекущиеДанные = неопределено Тогда
	
		Возврат; 	
	
	КонецЕсли;
	
	СортировкаПоНоменклатуреНаСервере(); 
	
	Элементы.Товары.ТекущаяСтрока = ТекущиеДанные.ПолучитьИдентификатор(); 
	
КонецПроцедуры


&НаКлиенте
Процедура ОтборПоКоллекции(Команда)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные; 
	Если ТекущиеДанные = неопределено Тогда
	
		Возврат; 	
	
	КонецЕсли; 
	
	Если УстановленОтборПоКоллекции Тогда 
		Элементы.Товары.ОтборСтрок = неопределено;
		УстановленОтборПоКоллекции = Ложь;
		//ЦветТекста = WebЦвета.Черный; 
	Иначе 
		Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура("Коллекция",ТекущиеДанные.Коллекция);
		УстановленОтборПоКоллекции = истина;
		//ЦветТекста = WebЦвета.Красный;
	КонецЕсли;
	Элементы.ТоварыОтборПоКоллекции.Пометка = УстановленОтборПоКоллекции; 
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоГТИН(Команда)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные; 
	Если ТекущиеДанные = неопределено Тогда
	
		Возврат; 	
	
	КонецЕсли;
	
	Если УстановленОтборПоГТИН Тогда 
		Элементы.Товары.ОтборСтрок = неопределено;
		УстановленОтборПоГТИН = Ложь;
		//ЦветТекста = WebЦвета.Черный; 
	Иначе 
		Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура("ГТИН",ТекущиеДанные.ГТИН);
		УстановленОтборПоГТИН = истина;
		//ЦветТекста = WebЦвета.Красный;
	КонецЕсли;
	Элементы.ТоварыОтборПоГТИН.Пометка = УстановленОтборПоГТИН;

КонецПроцедуры

&НаКлиенте
Процедура ОтборПоКатегорииМП(Команда)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные; 
	Если ТекущиеДанные = неопределено Тогда
	
		Возврат; 	
	
	КонецЕсли;
	
	Если УстановленОтборПоКатегорииМП Тогда 
		Элементы.Товары.ОтборСтрок = неопределено;
		УстановленОтборПоКатегорииМП = Ложь;
		//ЦветТекста = WebЦвета.Черный; 
	Иначе 
		Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура("КатегорияМП",ТекущиеДанные.КатегорияМП);
		УстановленОтборПоКатегорииМП = истина;
		//ЦветТекста = WebЦвета.Красный;
	КонецЕсли;
	Элементы.ТоварыОтборПоКатегорииМП.Пометка = УстановленОтборПоКатегорииМП;
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоЦвету(Команда)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные; 
	Если ТекущиеДанные = неопределено Тогда
	
		Возврат; 	
	
	КонецЕсли;
	
	Если УстановленОтборПоЦвету Тогда 
		Элементы.Товары.ОтборСтрок = неопределено;
		УстановленОтборПоЦвету = Ложь;
		//ЦветТекста = WebЦвета.Черный; 
	Иначе 
		Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура("Цвет",ТекущиеДанные.Цвет);
		УстановленОтборПоЦвету = истина;
		//ЦветТекста = WebЦвета.Красный;
	КонецЕсли;
	Элементы.ТоварыОтборПоЦвету.Пометка = УстановленОтборПоЦвету;

КонецПроцедуры
//++Данилова Е.В. 18.06.2026 Изм.№0000000008
&НаКлиенте
Процедура ОбновитьИтоги(Команда)
	ПересчитатьИтогиНаКлиенте(); 
КонецПроцедуры
//--Данилова Е.В. 18.06.2026

#Область Подключаемые_команды

&НаКлиенте
Процедура ЗаполнениеОбъекта(Команда)
	ПодключаемыеКомандыКлиент.ЗаполнениеОбъекта(Команда.Имя, ЭтотОбъект);	
КонецПроцедуры


#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 
//++Данилова Е.В. 18.06.2026 Изм.№0000000008
&НаКлиенте
Процедура ВыполнитьПересчетИтогов()    
   
    ПересчитатьИтогиНаКлиенте();
    
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтогиНаКлиенте()
    
    КоличествоИтог = 0;
    КоличествоКОтгрузкеИтог = 0;
    СуммаИтог = 0; 
    ОстатокКонтрагентаИтог = 0; 
    НедостающееКоличествоИтог = 0; 
    ВПутиИтог = 0; 
    КоличествоПланИтог = 0; 

	ТаблицаФормы 	= Элементы.Товары;
	ДанныеТаблицы 	= Объект.Товары;

	Для Каждого СтрокаТаблицы Из ДанныеТаблицы Цикл
        
        ИдентификаторСтроки = СтрокаТаблицы.ПолучитьИдентификатор();
        
        Если ТаблицаФормы.ПроверитьСтроку(ИдентификаторСтроки) = Истина Тогда
        	
			КоличествоИтог 				= КоличествоИтог + СтрокаТаблицы.Количество;
			КоличествоКОтгрузкеИтог 	= КоличествоКОтгрузкеИтог + СтрокаТаблицы.КОтгрузке; 
			СуммаИтог 					= СуммаИтог + СтрокаТаблицы.Сумма; 
			ОстатокКонтрагентаИтог 		= ОстатокКонтрагентаИтог + СтрокаТаблицы.ОстатокКонтрагента; 
			НедостающееКоличествоИтог 	= НедостающееКоличествоИтог + СтрокаТаблицы.НедостающееКоличество;
			ВПутиИтог					= ВПутиИтог + СтрокаТаблицы.ВПути;  
			КоличествоПланИтог 			= КоличествоПланИтог + СтрокаТаблицы.КоличествоПлан; 
        
        КонецЕсли;

	КонецЦикла;
    
    
	//Элементы.ТоварыКоличество.ТекстПодвала 	= Формат(КоличествоИтог, "ЧГ=3,0");
	//Элементы.ТоварыКОтгрузке.ТекстПодвала 	= Формат(КоличествоКОтгрузкеИтог, "ЧГ=3,0");
	//Элементы.ТоварыСумма.ТекстПодвала 	= Формат(СуммаИтог, "ЧГ=3,0");
	//Элементы.ТоварыОстатокКонтрагента.ТекстПодвала 	= Формат(ОстатокКонтрагентаИтог, "ЧГ=3,0");
	//Элементы.ТоварыНедостающееКоличество.ТекстПодвала 	= Формат(НедостающееКоличествоИтог, "ЧГ=3,0");
	//Элементы.ТоварыВПути.ТекстПодвала 	= Формат(ВПутиИтог, "ЧГ=3,0");
	//Элементы.ТоварыКоличествоПлан.ТекстПодвала 	= Формат(КоличествоПланИтог, "ЧГ=3,0");	
    
КонецПроцедуры

//--Данилова Е.В. 18.06.2026 

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура СортировкаПоНоменклатуреНаСервере()
	
	Запрос = новый запрос;
	запрос.Текст="Выбрать * поместить времТЗ из &ТЗ как ТЗ; выбрать * из времТЗ как ВремТЗ УПОРЯДОЧИТЬ ПО Номенклатура ИЕРАРХИЯ, Номенклатура.Наименование";
	запрос.УстановитьПараметр("ТЗ",Объект.Товары.Выгрузить());
	Объект.Товары.Загрузить(запрос.Выполнить().Выгрузить());	
	
КонецПроцедуры // СортировкаПоНоменклатуреНаСервере()

&НаКлиенте
Процедура ПослеВыбораМатрицыВСтроке(ВыбранноеЗначение,ДопПараметры) Экспорт
	Если ВыбранноеЗначение = неопределено  Тогда
		Возврат; 
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.Матрица") Тогда
	
		СтрокаПоИдентификатору = Объект.Товары.НайтиПоИдентификатору(ДопПараметры);
		СтрокаПоИдентификатору.НоменклатурнаяМатрица =  ВыбранноеЗначение; 
		
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокМатрицПоТовару(ПараметрыМатрицы)
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Номенклатура", ПараметрыМатрицы.Номенклатура);
	Запрос.УстановитьПараметр("Контрагент",ПараметрыМатрицы.Контрагент);
	Запрос.УстановитьПараметр("Договор",ПараметрыМатрицы.Договор);
	Запрос.УстановитьПараметр("ПунктДоставки",ПараметрыМатрицы.ПунктДоставки);
	Запрос.УстановитьПараметр("Дата",ПараметрыМатрицы.Дата);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МатрицаТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Матрица.Товары КАК МатрицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
	|ГДЕ
	|	МатрицаТовары.Номенклатура = &Номенклатура
	|	И МатрицаТовары.Ссылка.Проведен
	|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
	|	И МатрицаТовары.Ссылка.Дата <= &Дата
	|	И МатрицаТовары.Ссылка.Договор = &Договор
	|	И МатрицаПунктыДоставки.ПунктДоставки = &ПунктДоставки
	|
	|УПОРЯДОЧИТЬ ПО
	|	МатрицаТовары.Ссылка.Дата
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	СписокСсылок = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокСсылок.Добавить(Выборка.Ссылка);
	КонецЦикла;
	Возврат СписокСсылок; 
КонецФункции
&НаКлиенте
Функция ПолучитьНастройкиКомпоновкиДляРНКВПути()
	
	НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;
	Склад = ПолучитьСкладФБО(); 
    
	ГруппаОтбора = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Склад");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ПравоеЗначение = Склад;

	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Контрагент");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ПравоеЗначение = Объект.Контрагент;
	
	Возврат НастройкиКомпоновки; 
КонецФункции
&НаКлиенте
Функция ПолучитьНастройкиКомпоновкиДляМатриц(МассивСсылок)
	СписокСсылок = Новый СписокЗначений(); 
	СписокСсылок.ЗагрузитьЗначения(МассивСсылок);
	НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;
	    
	ГруппаОтбора = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ссылка");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ПравоеЗначение =  СписокСсылок; 

		
	Возврат НастройкиКомпоновки; 
КонецФункции
&НаКлиенте
Функция ПолучитьНастройкиКомпоновкиДляКомплектации()
	
	НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;
	Склад = ПолучитьСкладФБО(); 
    
	ГруппаОтбора = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Склад");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ПравоеЗначение = Склад;
	
	Возврат НастройкиКомпоновки; 
КонецФункции

&НаСервере
Функция ПолучитьСкладФБО()
	
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ первые 1
	|	ИнетМагазиныСкладыПодсортировкиFBO.Ссылка КАК Ссылка,
	|	ИнетМагазиныСкладыПодсортировкиFBO.Ссылка.СоздаватьПодсортировкиFBO КАК СоздаватьПодсортировкиFBO,
	|	ИнетМагазиныСкладыПодсортировкиFBO.Склад КАК Склад
	|ИЗ
	|	Справочник.ИнетМагазины.СкладыПодсортировкиFBO КАК ИнетМагазиныСкладыПодсортировкиFBO
	|ГДЕ
	|	ИнетМагазиныСкладыПодсортировкиFBO.Ссылка.Контрагент = &Контрагент";
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Результат=запрос.Выполнить().Выбрать();
	пока Результат.Следующий() цикл
		возврат Результат.склад;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ПослеВыбораРНКВпути(ВыбранноеЗначение,ДопПараметры) Экспорт
	Если ТипЗНЧ(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для Каждого Значение Из ВыбранноеЗначение Цикл
			Отбор = Новый структура("Накладная",Значение); 
			Если Объект.РНКПути.НайтиСтроки(Отбор).Количество() = 0 Тогда
				СтрокаТЧ = Объект.РНКПути.Добавить();			
				СтрокаТЧ.Накладная = Значение;
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
&НаСервере
Функция ПроверитьЦеныПоМатрицеПередСозданиемЗаказовFBO()
      
	Если ТЗМатриц = Неопределено 
		ИЛИ ТипЗНЧ(ТЗМатриц) <> Тип("ТаблицаЗначений") Тогда
		
		ЗаполнитьТаблицуПечатиПоМатрице(); 	
		
	КонецЕсли; 
	
	ЕстьНулевыеЦены  = Ложь; 
	
	Отбор = Новый Структура("Цена",0);
	СтрокиСНулевойЦеной = ТЗМатриц.НайтиСтроки(Отбор);
	
	МассивТоваровСНулЦенами = Новый Массив; 
	Для каждого СтрокаСНулевойЦеной  Из СтрокиСНулевойЦеной Цикл
	
		СтрокиТоваров = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура",СтрокаСНулевойЦеной.Номенклатура)); 	
		Для каждого СтрокаТоваров Из СтрокиТоваров Цикл
			
			Если СтрокаТоваров.КОтгрузке > 0  Тогда 				
				
				МассивТоваровСНулЦенами.Добавить(СтрокаСНулевойЦеной.Номенклатура);  	
				
			КонецЕсли;	
			
		КонецЦикла;
	КонецЦикла;
	
	Если МассивТоваровСНулЦенами.Количество() > 0 Тогда
	
		Запрос			= Новый Запрос;				
		Запрос.Текст 	= "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МатрицаТовары.Ссылка КАК Ссылка,
		|	МатрицаТовары.Номенклатура КАК Номенклатура,
		|	МатрицаТовары.ШККонтрагента КАК ШККонтрагента,
		|	ВЫРАЗИТЬ(МатрицаТовары.АртикулКонтрагента КАК СТРОКА(150)) КАК АртикулКонтрагента,
		|	МатрицаТовары.Цена КАК Цена,
		|	МатрицаТовары.Кратность КАК Кратность,
		|	МатрицаТовары.МинимальноеКоличество КАК МинимальноеКоличество,
		|	МатрицаТовары.ЦенаПосредника КАК ЦенаПосредника,
		|	МатрицаТовары.ШККонтрагентаБлочок КАК ШККонтрагентаБлочок,
		|	МатрицаТовары.ШККонтрагентаКоробка КАК ШККонтрагентаКоробка,
		|	МатрицаТовары.КратностьКоробки КАК КратностьКоробки,
		|	ВЫРАЗИТЬ(МатрицаТовары.НаименованиеКонтрагента КАК СТРОКА(150)) КАК НаименованиеКонтрагента,
		|	ВЫРАЗИТЬ(МатрицаТовары.КодПроизводителяКонтрагента КАК СТРОКА(150)) КАК КодПроизводителяКонтрагента,
		|	МатрицаТовары.ШКСпайки КАК ШКСпайки,
		|	МатрицаТовары.ШККонтрагентаДополнительный КАК ШККонтрагентаДополнительный,
		|	МатрицаТовары.Ссылка.Дата КАК ДатаМатрицы,
		|	ВЫРАЗИТЬ(МатрицаТовары.НаименованиеБрендаДляКонтрагента КАК СТРОКА(150)) КАК НаименованиеБрендаДляКонтрагента,
		|	ВЫРАЗИТЬ(МатрицаТовары.НаименованиеЦветаДляКонтрагента КАК СТРОКА(150)) КАК НаименованиеЦветаДляКонтрагента,
		|	ВЫРАЗИТЬ(МатрицаТовары.НаименованиеРазмераДляКонтрагента КАК СТРОКА(150)) КАК НаименованиеРазмераДляКонтрагента,
		|	ВЫРАЗИТЬ(МатрицаТовары.ТипТовараДляКонтрагента КАК СТРОКА(150)) КАК ТипТовараДляКонтрагента,
		|	МатрицаТовары.КратностьПаллеты КАК КратностьПаллеты,
		|	МатрицаТовары.ПорядокУчастияВАкции КАК ПорядокУчастияВАкции,
		|	МатрицаТовары.Номенклатура.Родитель.Коллекция КАК Коллекция
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
		|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
		|ГДЕ
		|	МатрицаТовары.Ссылка.Проведен
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.Договор = &Договор
		|	И МатрицаТовары.Ссылка.Дата <= &Дата1
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
		|	И МатрицаПунктыДоставки.ПунктДоставки = &ПунктДоставки
		|	И МатрицаТовары.Ссылка.ПостояннаяАкция = &ПостояннаяАкция
		|	И МатрицаТовары.Номенклатура В(&Номенклатура)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаМатрицы УБЫВ";
		
		Запрос.УстановитьПараметр("Дата2",			НачалоДня(Объект.Дата));
		Запрос.УстановитьПараметр("Дата1",			КонецДня(Объект.Дата));
		Запрос.УстановитьПараметр("Контрагент",		Объект.Контрагент);		
		Запрос.УстановитьПараметр("ПунктДоставки",	Справочники.ПунктыДоставки.ПустаяСсылка());				
		Запрос.УстановитьПараметр("Договор",		Объект.Договор);	
		Запрос.УстановитьПараметр("ПостояннаяАкция",		ложь);	
		Запрос.УстановитьПараметр("Номенклатура",	МассивТоваровСНулЦенами);	
		
		
		ТЗМатрицБезПунктовДоставки = Запрос.Выполнить().Выгрузить();
		
		Отбор = Новый Структура("Цена",0);
		СтрокиСНулевойЦеной = ТЗМатрицБезПунктовДоставки.НайтиСтроки(Отбор);
		
		МассивТоваровСНулЦенами = Новый Массив; 
		Для Каждого СтрокаСНулевойЦеной Из СтрокиСНулевойЦеной Цикл

			СтрокиТоваров = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", СтрокаСНулевойЦеной.Номенклатура));
			Для Каждого СтрокаТоваров Из СтрокиТоваров Цикл

				Если СтрокаТоваров.КОтгрузке > 0 Тогда

					Сообщить("По номенклатуре " + Строка(СтрокаСНулевойЦеной.Номенклатура)
						+ " не найдена цена по матрице,№ стр." + Строка(СтрокаТоваров.НомерСтроки));

					ЕстьНулевыеЦены = Истина;

				КонецЕсли;

			КонецЦикла;
		КонецЦикла;
		
	
	КонецЕсли;
	 
	Возврат НЕ ЕстьНулевыеЦены;  
	 
 
 КонецФункции // ПроверитьЦеныПоМатрицеПередСозданиемЗаказовFBO()
 

//&НаСервере
//Процедура ТоварыПриИзмененииНаСервере(ПерезаполнитьВсе = истина,СтрокаТоваров = неопределено)
//	Если ТипЗнч(ТЗМатриц) <> Тип("ТаблицаЗначений") и ВыводитьДанныеМатриц тогда
//		ЗаполнитьТаблицуПечатиПоМатрице();
//	КонецЕсли;
//	Если ПерезаполнитьВсе Тогда
//		
//		МассивТоваров = МассивТоваровДокумента(); 
//		СоответствиеРеквизитыТоваров = ПолучитьРеквизитыТоваров(МассивТоваров); 
//		Для Каждого СтрокаТовара Из Объект.Товары Цикл

//			Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура) Тогда

//				Продолжить;

//			КонецЕсли;
//			СтрокаТоваровПриИзмененииНаСервере(СтрокаТовара,СоответствиеРеквизитыТоваров);
//		КонецЦикла;
//	ИначеЕсли  СтрокаТоваров <> неопределено  Тогда 
//		ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(СтрокаТоваров);
//		Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
//			СоответствиеРеквизитыТоваров = ПолучитьРеквизитыТоваров(ТекущиеДанные.Номенклатура);
//			СтрокаТоваровПриИзмененииНаСервере(ТекущиеДанные,СоответствиеРеквизитыТоваров);
//		КонецЕсли;
//	КонецЕсли;
//	
//	ОформитьСтрокиДобавитьОстатки(СоответствиеРеквизитыТоваров,ДваСклада,ПерезаполнитьВсе,СтрокаТоваров); 
//КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзмененииНаКлиенте(ПерезаполнитьВсе = истина,СтрокаТоваров = неопределено)
	Если ТипЗнч(ТЗМатриц) <> Тип("ТаблицаЗначений") и ВыводитьДанныеМатриц тогда
		ЗаполнитьТаблицуПечатиПоМатрице();
	КонецЕсли;
	Если ПерезаполнитьВсе Тогда
		
		МассивТоваров = МассивТоваровДокумента(); 
		СоответствиеРеквизитыТоваров = ПолучитьРеквизитыТоваров(МассивТоваров); 
		Для Каждого СтрокаТовара Из Объект.Товары Цикл

			Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура) Тогда

				Продолжить;

			КонецЕсли;
			СтрокаТоваровПриИзмененииНаКлиенте(СтрокаТовара,СоответствиеРеквизитыТоваров);
		КонецЦикла;
	ИначеЕсли  СтрокаТоваров <> неопределено  Тогда 
		ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(СтрокаТоваров);
		Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
			СоответствиеРеквизитыТоваров = ПолучитьРеквизитыТоваров(ТекущиеДанные.Номенклатура);
			СтрокаТоваровПриИзмененииНаКлиенте(ТекущиеДанные,СоответствиеРеквизитыТоваров);
		КонецЕсли;
	КонецЕсли;
	
	ОформитьСтрокиДобавитьОстаткиНаКлиенте(СоответствиеРеквизитыТоваров,ДваСклада,ПерезаполнитьВсе,СтрокаТоваров); 
КонецПроцедуры

&НаКлиенте
Процедура СтрокаТоваровПриИзмененииНаКлиенте(СтрокаТовара,СоответствиеРеквизитыТоваров)
	
	//МодельНоменклатуры = ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(СтрокаТовара.Номенклатура, "Родитель");
	МодельНоменклатуры = СоответствиеРеквизитыТоваров.Получить(СтрокаТовара.Номенклатура).Модель; 
	ВремСтрока = СтрочкиИзменённыеРуками.НайтиСтроки(Новый Структура("Номенклатура", СтрокаТовара.Номенклатура));

	Если ВремСтрока.Количество() = 0 Или Не ЗначениеЗаполнено(ВремСтрока[0].КратностьПаллеты) Тогда
		КратностьПаллеты = СоответствиеРеквизитыТоваров.Получить(СтрокаТовара.Номенклатура).КолКоробовВПаллете;
	Иначе
		КратностьПаллеты = ВремСтрока[0].КратностьПаллеты;
	КонецЕсли;

	СтрокаТовара.КоробокНаПаллете = КратностьПаллеты;

	Отгружается = СтрокаТовара.КОтгрузке;
	//ШтукВКоробке = ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(МодельНоменклатуры, "ШтукВКоробке");
	//ШтукВКоробочке = ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(МодельНоменклатуры, "ШтукВКоробочке");
    ШтукВКоробке 	=  СоответствиеРеквизитыТоваров.Получить(СтрокаТовара.Номенклатура).ШтукВКоробке; 
	ШтукВКоробочке 	=  СоответствиеРеквизитыТоваров.Получить(СтрокаТовара.Номенклатура).ШтукВКоробочке; 
	
	КоличествоКоробок = Окр(?(ШтукВКоробке > 0, Отгружается / ШтукВКоробке, 0), 2);
	КоличествоБлочков = Окр(?(ШтукВКоробочке > 0, Отгружается / ШтукВКоробочке, 0), 2);

	СтрокаТовара.КратностьБлочка 	= ШтукВКоробочке;
	СтрокаТовара.КоличествоБлочков  = КоличествоБлочков;
	СтрокаТовара.ПаллетКОтгрузке 	= Окр(?(КратностьПаллеты > 0, КоличествоКоробок / КратностьПаллеты, 0), 2);

	Номенклатура = СтрокаТовара.Номенклатура;
	Если ВыводитьДанныеМатриц Тогда

		СтрокаМатрицы = ТЗМатриц.Найти(Номенклатура);
		Если СтрокаМатрицы <> Неопределено Тогда
			СтрокаТовара.КратностьПаллетыИзМатрицы  = СтрокаМатрицы.КратностьПаллеты;

			СтрокаТовара.ПаллетКОтгрузке = Окр(?(СтрокаМатрицы.КратностьПаллеты > 0, Отгружается
				/ СтрокаМатрицы.КратностьПаллеты, 0), 2);		
							
			//++Данилова Е.В. 17.06.2026 №0000000008
			СтрокаТовара.КодПроизводителя = СокрЛП(СтрокаМатрицы.КодПроизводителяКонтрагента); 
			//--Данилова Е.В. 17.06.2026 
			Если СтрокаТовара.СпособПоставки = ПредопределенноеЗначение("Перечисление.СпособПоставкиКонтрагенту.МоноПаллета") Тогда
				КратностьПаллеты = СтрокаМатрицы.КратностьПаллеты;
				Если КратностьПаллеты > 0 Тогда
					СтрокаТовара.ПаллетКОтгрузке = Окр(СтрокаТовара.КОтгрузке / КратностьПаллеты, 2);
				КонецЕсли;
			КонецЕсли;

			СтрокаТовара.ПорядокУчастияВАкции = СтрокаМатрицы.ПорядокУчастияВАкции;

			СтрокаТовара.НаименованиеКонтрагента = СокрЛП(СтрокаМатрицы.НаименованиеКонтрагента);
		КонецЕсли;
	КонецЕсли;
	Если СтрокаТовара.КоличествоПлан <> 0 Тогда 
		СтрокаТовара.КоличествоПланМакс =  СтрокаТовара.Количество/СтрокаТовара.КоличествоПлан;
	Конецесли;
	Если  СтрокаТовара.НедостающееКоличество <> 0 Тогда 
		СтрокаТовара.КОтгрузкеСоотношение = СтрокаТовара.КОтгрузке/СтрокаТовара.НедостающееКоличество;
	КонецЕсли;
	//СтрокаТовара.Коллекция = ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(МодельНоменклатуры, "Коллекция"); 
	СтрокаТовара.Коллекция 		=  СоответствиеРеквизитыТоваров.Получить(СтрокаТовара.Номенклатура).Коллекция;
	СтрокаТовара.ГТИН 			= СоответствиеРеквизитыТоваров.Получить(СтрокаТовара.Номенклатура).ГТИН; 
	СтрокаТовара.КатегорияМП 	=  СоответствиеРеквизитыТоваров.Получить(СтрокаТовара.Номенклатура).КатегорияМаркетПлейсы;
	///////////////////присвоение цвета
	
	УстановкаЦветаПоСтроке(СтрокаТовара);

КонецПроцедуры

&НаКлиенте
Процедура УстановкаЦветаПоСтроке(Знач СтрокаТовара)
	
	Если СтрокаТовара.НедостающееКоличество > 0 И СтрокаТовара.КОтгрузке > 0 И СтрокаТовара.КОтгрузкеСоотношение > 1.5 Тогда 
		СтрокаТовара.Цвет = "Светло-желтый"; 
	ИначеЕсли СтрокаТовара.ОстатокКонтрагента = 0 И СтрокаТовара.Количество = 0 Тогда 
		СтрокаТовара.Цвет = "Коралловый";
	ИначеЕсли  СтрокаТовара.КоличествоПланМакс > 1.2 И СтрокаТовара.КоличествоПлан > 0  Тогда 
		СтрокаТовара.Цвет = "Персиковый"; 
	//ИначеЕсли  СтрокаТовара.НеХватаетОстатка Тогда 
	//	СтрокаТовара.Цвет = "Желтый"; 
	ИначеЕсли СтрокаТовара.ВыделятьВДокументах Тогда 	
		СтрокаТовара.Цвет = "Хаки";  
	Иначе 
		СтрокаТовара.Цвет = "Без цвета"; 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОформитьСтрокиДобавитьОстаткиНаКлиенте(СоответствиеРеквизитыТоваров, ВДваСклада = Ложь,ПерезаполнитьВсе = Ложь,СтрокаТоваров = неопределено)
	
	Если НЕ ВДваСклада Тогда 
		Возврат; 
	КонецЕсли;
	
	//++Данилова Е.В. 17.06.2026 №0000000008
	Если КэшОстатковСДвухСкладов = неопределено Тогда 
		КэшОстатковСДвухСкладов = Новый Структура("КэшОстатков",Новый Соответствие);
	КонецЕсли;
	//--Данилова Е.В. 17.06.2026
	СписокНоменклатурыСДвухСкладов = Новый Массив;
	Если ПерезаполнитьВсе Тогда
		Для Каждого СтрокаТовара Из Объект.Товары Цикл
			Номенклатура = СтрокаТовара.Номенклатура;
            ЭтоГруппа = СоответствиеРеквизитыТоваров.Получить(Номенклатура).ЭтоГруппа; 
			Если ЭтоГруппа Тогда 
				Продолжить;
			КонецЕсли
			;

			Если КэшОстатковСДвухСкладов.КэшОстатков.Получить(Номенклатура) = Неопределено Тогда
				СписокНоменклатурыСДвухСкладов.Добавить(Номенклатура);
			КонецЕсли;
            
		КонецЦикла;
	ИначеЕсли СтрокаТоваров <> неопределено Тогда  
		ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(СтрокаТоваров);
		Если ТекущиеДанные = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
			Возврат; 
		КонецЕсли;
		
		Номенклатура = ТекущиеДанные.Номенклатура;
        ЭтоГруппа = СоответствиеРеквизитыТоваров.Получить(Номенклатура).ЭтоГруппа;
		//Если ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(Номенклатура,"ЭтоГруппа") Тогда
		Если ЭтоГруппа Тогда 
			Возврат; 
		КонецЕсли;

		Если КэшОстатковСДвухСкладов.КэшОстатков.Получить(Номенклатура) = Неопределено Тогда
			СписокНоменклатурыСДвухСкладов.Добавить(Номенклатура);
		КонецЕсли;
	КонецЕсли;
	
	#Область Склады
	//++Данилова Е.В. 17.06.2026 №0000000008
	Если СписокНоменклатурыСДвухСкладов.Количество() > 0 Тогда  	
		МассивСкладов = Неопределено;
		СкладДоп = Неопределено;
		МассивСкладовДляРасчетаОстатков(МассивСкладов, СкладДоп);
		//++Данилова Е.В. 17.06.2026 №0000000008
		//ПолучитьОстаткиНаСервере(СписокНоменклатурыСДвухСкладов, СкладДоп, Объект.ссылка, КэшОстатковСДвухСкладов, Ложь,
		//	МассивСкладов);
		ДанныеПоОстаткам = ПолучитьОстаткиНаСервере(СписокНоменклатурыСДвухСкладов, СкладДоп, Объект.ссылка, Ложь,
		МассивСкладов);
		Для каждого ЭлСоответствия  Из ДанныеПоОстаткам Цикл
			
			КэшОстатковСДвухСкладов.КэшОстатков.Вставить(ЭлСоответствия.Ключ,ЭлСоответствия.Значение); 		
			
		КонецЦикла;  
		
	КонецЕсли;
	//--Данилова Е.В. 17.06.2026
	#КонецОбласти	
	
	Если ПерезаполнитьВсе Тогда
		Для Каждого СтрокаТовара Из Объект.Товары Цикл
			
			СтрокаКэшаСДвухСкладов = КэшОстатковСДвухСкладов.КэшОстатков.Получить(СтрокаТовара.Номенклатура);

			СвободныйОстатокСДвухСкладов = ?(СтрокаКэшаСДвухСкладов <> Неопределено,
				СтрокаКэшаСДвухСкладов.СвободныйОстаток, 0);
			СтрокаТовара.ОстФизСкл = СвободныйОстатокСДвухСкладов;
			СтрокаТовара.НеХватаетОстатка = СвободныйОстатокСДвухСкладов < СтрокаТовара.Количество;

			УстановкаЦветаПоСтроке(СтрокаТовара);

		КонецЦикла;
	ИначеЕсли СтрокаТовара <> неопределено Тогда 
		ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(СтрокаТоваров);
		СтрокаКэшаСДвухСкладов = КэшОстатковСДвухСкладов.КэшОстатков.Получить(ТекущиеДанные.Номенклатура);

		СвободныйОстатокСДвухСкладов = ?(СтрокаКэшаСДвухСкладов <> Неопределено,
			СтрокаКэшаСДвухСкладов.СвободныйОстаток, 0);
		ТекущиеДанные.ОстФизСкл = СвободныйОстатокСДвухСкладов;
		ТекущиеДанные.НеХватаетОстатка = СвободныйОстатокСДвухСкладов < ТекущиеДанные.Количество;
		УстановкаЦветаПоСтроке(ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура МассивСкладовДляРасчетаОстатков(МассивСкладов, СкладДоп)
	
	Перем МаркировкаСкладЧасцыFBS, МаркировкаСкладЧасцыДИП, МаркировкаСкладЧасцыДОП, МаркировкаСкладЧасцыНекорректныеМарки, МаркировкаСкладЧасцыОсновной, СкладОсновной, СкладФБС;
	
	СкладДоп = Справочники.склады.НайтиПоКоду("STC-60");
	СкладФБС = Справочники.Склады.НайтиПоКоду("STD-13"); 
	СкладОсновной = Справочники.Склады.НайтиПоКоду("STA-48");
	
	
	МаркировкаСкладЧасцыFBS = Справочники.Склады.НайтиПоКоду("STЕ-03");
	МаркировкаСкладЧасцыДОП = Справочники.Склады.НайтиПоКоду("STD-99");
	
	МаркировкаСкладЧасцыДИП = Справочники.Склады.НайтиПоКоду("STЕ-49");
	
	МаркировкаСкладЧасцыНекорректныеМарки = Справочники.Склады.НайтиПоКоду("STЕ-15");
	МаркировкаСкладЧасцыОсновной = Справочники.Склады.НайтиПоКоду("STD-95"); 
	
	
	МассивСкладов = Новый Массив;
	
	МассивСкладов.Добавить(СкладДоп);
	МассивСкладов.Добавить(СкладОсновной);
	МассивСкладов.Добавить(СкладФБС);
	
	МассивСкладов.Добавить(МаркировкаСкладЧасцыFBS);
	МассивСкладов.Добавить(МаркировкаСкладЧасцыДОП);
	
	МассивСкладов.Добавить(МаркировкаСкладЧасцыДИП);
	
	МассивСкладов.Добавить(МаркировкаСкладЧасцыНекорректныеМарки);
	МассивСкладов.Добавить(МаркировкаСкладЧасцыОсновной);
	
КонецПроцедуры



// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервере
Функция МассивТоваровДокумента()

	Возврат Объект.Товары.Выгрузить(,"Номенклатура").ВыгрузитьКолонку("Номенклатура"); 

КонецФункции // МассивТоваровДокумента()


// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервереБезКонтекста
Функция ПолучитьРеквизитыТоваров(Знач МассивТоваров)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
		|	Номенклатура.Родитель КАК Модель,
		|	Номенклатура.Родитель.КолКоробовВПаллете КАК КолКоробовВПаллете,
		|	Номенклатура.Родитель.ШтукВКоробке КАК ШтукВКоробке,
		|	Номенклатура.Родитель.ШтукВКоробочке КАК ШтукВКоробочке,
		|	Номенклатура.Родитель.Коллекция КАК Коллекция,
		|	Номенклатура.ГТИН КАК ГТИН,
		|	Номенклатура.КатегорияМаркетПлейсы КАК КатегорияМаркетПлейсы
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&МассивТоваров)";
	
	Запрос.УстановитьПараметр("МассивТоваров", МассивТоваров);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СоответствиеТоварыРеквизиты = Новый Соответствие; 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Структура = ВернутьСтруктуруРеквизитыТоваров(); 
		ЗаполнитьЗначенияСвойств(Структура,ВыборкаДетальныеЗаписи); 
		СоответствиеТоварыРеквизиты.Вставить(ВыборкаДетальныеЗаписи.Номенклатура,Структура); 
		
	КонецЦикла; 
    Возврат СоответствиеТоварыРеквизиты; 
КонецФункции // ПолучитьРеквизитыТоваров() 

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервереБезКонтекста
Функция ВернутьСтруктуруРеквизитыТоваров()

	Структура = Новый Структура; 
	Структура.Вставить("ЭтоГруппа",ложь);
	Структура.Вставить("Модель");
	Структура.Вставить("КолКоробовВПаллете",0);
	Структура.Вставить("ШтукВКоробке",0);
	Структура.Вставить("ШтукВКоробочке",0);
	Структура.Вставить("Коллекция");
	Структура.Вставить("ГТИН");
	Структура.Вставить("КатегорияМаркетПлейсы");
	
	Возврат Структура; 

КонецФункции // ВернутьСтруктуруРеквизитыТоваров()



//&НаСервере
//Процедура СтрокаТоваровПриИзмененииНаСервере(СтрокаТовара,СоответствиеРеквизитыТоваров)
//	
//	//МодельНоменклатуры = ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(СтрокаТовара.Номенклатура, "Родитель");
//	МодельНоменклатуры = СоответствиеРеквизитыТоваров.Получить(СтрокаТовара.Номенклатура).Модель; 
//	ВремСтрока = СтрочкиИзменённыеРуками.НайтиСтроки(Новый Структура("Номенклатура", СтрокаТовара.Номенклатура));

//	Если ВремСтрока.Количество() = 0 Или Не ЗначениеЗаполнено(ВремСтрока[0].КратностьПаллеты) Тогда
//		КратностьПаллеты = СоответствиеРеквизитыТоваров.Получить(СтрокаТовара.Номенклатура).КолКоробовВПаллете;
//	Иначе
//		КратностьПаллеты = ВремСтрока[0].КратностьПаллеты;
//	КонецЕсли;

//	СтрокаТовара.КоробокНаПаллете = КратностьПаллеты;

//	Отгружается = СтрокаТовара.КОтгрузке;
//	//ШтукВКоробке = ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(МодельНоменклатуры, "ШтукВКоробке");
//	//ШтукВКоробочке = ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(МодельНоменклатуры, "ШтукВКоробочке");
//    ШтукВКоробке 	=  СоответствиеРеквизитыТоваров.Получить(СтрокаТовара.Номенклатура).ШтукВКоробке; 
//	ШтукВКоробочке 	=  СоответствиеРеквизитыТоваров.Получить(СтрокаТовара.Номенклатура).ШтукВКоробочке; 
//	
//	КоличествоКоробок = Окр(?(ШтукВКоробке > 0, Отгружается / ШтукВКоробке, 0), 2);
//	КоличествоБлочков = Окр(?(ШтукВКоробочке > 0, Отгружается / ШтукВКоробочке, 0), 2);

//	СтрокаТовара.КратностьБлочка 	= ШтукВКоробочке;
//	СтрокаТовара.КоличествоБлочков  = КоличествоБлочков;
//	СтрокаТовара.ПаллетКОтгрузке 	= Окр(?(КратностьПаллеты > 0, КоличествоКоробок / КратностьПаллеты, 0), 2);

//	Номенклатура = СтрокаТовара.Номенклатура;
//	Если ВыводитьДанныеМатриц Тогда

//		СтрокаМатрицы = ТЗМатриц.Найти(Номенклатура);
//		Если СтрокаМатрицы <> Неопределено Тогда
//			СтрокаТовара.КратностьПаллетыИзМатрицы  = СтрокаМатрицы.КратностьПаллеты;

//			СтрокаТовара.ПаллетКОтгрузке = Окр(?(СтрокаМатрицы.КратностьПаллеты > 0, Отгружается
//				/ СтрокаМатрицы.КратностьПаллеты, 0), 2);		
//							
//				//
//			Если СтрокаТовара.СпособПоставки = Перечисления.СпособПоставкиКонтрагенту.МоноПаллета Тогда
//				КратностьПаллеты = СтрокаМатрицы.КратностьПаллеты;
//				Если КратностьПаллеты > 0 Тогда
//					СтрокаТовара.ПаллетКОтгрузке = Окр(СтрокаТовара.КОтгрузке / КратностьПаллеты, 2);
//				КонецЕсли;
//			КонецЕсли;

//			СтрокаТовара.ПорядокУчастияВАкции = СтрокаМатрицы.ПорядокУчастияВАкции;

//			СтрокаТовара.НаименованиеКонтрагента = СокрЛП(СтрокаМатрицы.НаименованиеКонтрагента);
//		КонецЕсли;
//	КонецЕсли;
//	Если СтрокаТовара.КоличествоПлан <> 0 Тогда 
//		СтрокаТовара.КоличествоПланМакс =  СтрокаТовара.Количество/СтрокаТовара.КоличествоПлан;
//	Конецесли;
//	Если  СтрокаТовара.НедостающееКоличество <> 0 Тогда 
//		СтрокаТовара.КОтгрузкеСоотношение = СтрокаТовара.КОтгрузке/СтрокаТовара.НедостающееКоличество;
//	КонецЕсли;
//	//СтрокаТовара.Коллекция = ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(МодельНоменклатуры, "Коллекция"); 
//	СтрокаТовара.Коллекция 	=  СоответствиеРеквизитыТоваров.Получить(СтрокаТовара.Номенклатура).Коллекция;
//	///////////////////присвоение цвета
//	
//	Если СтрокаТовара.НедостающееКоличество > 0 И СтрокаТовара.КОтгрузке > 0 И СтрокаТовара.КОтгрузкеСоотношение > 1.5 Тогда 
//		СтрокаТовара.Цвет = "Светло-желтый"; 
//	ИначеЕсли СтрокаТовара.ОстатокКонтрагента = 0 И СтрокаТовара.Количество = 0 Тогда 
//	    СтрокаТовара.Цвет = "Коралловый";
//	ИначеЕсли  СтрокаТовара.КоличествоПланМакс > 1.2 И СтрокаТовара.КоличествоПлан > 0  Тогда 
//	    СтрокаТовара.Цвет = "Персиковый"; 
//	ИначеЕсли  СтрокаТовара.НеХватаетОстатка Тогда 
//		СтрокаТовара.Цвет = "Желтый"; 
//	ИначеЕсли СтрокаТовара.ВыделятьВДокументах Тогда 	
//		СтрокаТовара.Цвет = "Хаки";  
//	Иначе 
//		СтрокаТовара.Цвет = "Без цвета"; 
//	КонецЕсли;
//КонецПроцедуры

//&НаСервере
//Процедура ОформитьСтрокиДобавитьОстатки(СоответствиеРеквизитыТоваров, ВДваСклада = Ложь,ПерезаполнитьВсе = Ложь,СтрокаТоваров = неопределено)
//	
//	Если НЕ ВДваСклада Тогда 
//		Возврат; 
//	КонецЕсли;
//	
//	СписокНоменклатурыСДвухСкладов = Новый Массив;
//	Если ПерезаполнитьВсе Тогда
//		Для Каждого СтрокаТовара Из Объект.Товары Цикл
//			Номенклатура = СтрокаТовара.Номенклатура;
//            ЭтоГруппа = СоответствиеРеквизитыТоваров.Получить(Номенклатура).ЭтоГруппа; 
//			//Если ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(Номенклатура,"ЭтоГруппа") Тогда
//			Если ЭтоГруппа Тогда 
//				Продолжить;
//			КонецЕсли
//			;

//			Если КэшОстатковСДвухСкладов.КэшОстатков.Получить(Номенклатура) = Неопределено Тогда
//				СписокНоменклатурыСДвухСкладов.Добавить(Номенклатура);
//			КонецЕсли;

//		КонецЦикла;
//	ИначеЕсли СтрокаТоваров <> неопределено Тогда  
//		ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(СтрокаТоваров);
//		Если ТекущиеДанные = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
//			Возврат; 
//		КонецЕсли;
//		
//		Номенклатура = ТекущиеДанные.Номенклатура;
//        ЭтоГруппа = СоответствиеРеквизитыТоваров.Получить(Номенклатура).ЭтоГруппа;
//		//Если ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(Номенклатура,"ЭтоГруппа") Тогда
//		Если ЭтоГруппа Тогда 
//			Возврат; 
//		КонецЕсли;

//		Если КэшОстатковСДвухСкладов.КэшОстатков.Получить(Номенклатура) = Неопределено Тогда
//			СписокНоменклатурыСДвухСкладов.Добавить(Номенклатура);
//		КонецЕсли;
//	КонецЕсли;
//	
//	#Область Склады
//	
//	СкладДоп = Справочники.склады.НайтиПоКоду("STC-60");
//	СкладФБС = Справочники.Склады.НайтиПоКоду("STD-13"); 
//	СкладОсновной = Справочники.Склады.НайтиПоКоду("STA-48");
//	
//	
//	МаркировкаСкладЧасцыFBS = Справочники.Склады.НайтиПоКоду("STЕ-03");
//	МаркировкаСкладЧасцыДОП = Справочники.Склады.НайтиПоКоду("STD-99");
//	
//	МаркировкаСкладЧасцыДИП = Справочники.Склады.НайтиПоКоду("STЕ-49");
//	
//	МаркировкаСкладЧасцыНекорректныеМарки = Справочники.Склады.НайтиПоКоду("STЕ-15");
//	МаркировкаСкладЧасцыОсновной = Справочники.Склады.НайтиПоКоду("STD-95"); 
//	
//	
//	МассивСкладов = Новый Массив;

//	МассивСкладов.Добавить(СкладДоп);
//	МассивСкладов.Добавить(СкладОсновной);
//	МассивСкладов.Добавить(СкладФБС);

//	МассивСкладов.Добавить(МаркировкаСкладЧасцыFBS);
//	МассивСкладов.Добавить(МаркировкаСкладЧасцыДОП);

//	МассивСкладов.Добавить(МаркировкаСкладЧасцыДИП);

//	МассивСкладов.Добавить(МаркировкаСкладЧасцыНекорректныеМарки);
//	МассивСкладов.Добавить(МаркировкаСкладЧасцыОсновной);

//	ПолучитьОстаткиНаСервере(СписокНоменклатурыСДвухСкладов, СкладДоп, Объект.ссылка, КэшОстатковСДвухСкладов, Ложь,
//		МассивСкладов);
//	
//	
//	#КонецОбласти	
//	
//	Если ПерезаполнитьВсе Тогда
//		Для Каждого СтрокаТовара Из Объект.Товары Цикл
//			
//			СтрокаКэшаСДвухСкладов = КэшОстатковСДвухСкладов.КэшОстатков.Получить(СтрокаТовара.Номенклатура);

//			СвободныйОстатокСДвухСкладов = ?(СтрокаКэшаСДвухСкладов <> Неопределено,
//				СтрокаКэшаСДвухСкладов.СвободныйОстаток, 0);
//			СтрокаТовара.ОстФизСкл = СвободныйОстатокСДвухСкладов;
//			СтрокаТовара.НеХватаетОстатка = СвободныйОстатокСДвухСкладов < СтрокаТовара.Количество;

//			

//		КонецЦикла;
//	ИначеЕсли СтрокаТовара <> неопределено Тогда 
//		ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(СтрокаТоваров);
//		СтрокаКэшаСДвухСкладов = КэшОстатковСДвухСкладов.КэшОстатков.Получить(ТекущиеДанные.Номенклатура);

//		СвободныйОстатокСДвухСкладов = ?(СтрокаКэшаСДвухСкладов <> Неопределено,
//			СтрокаКэшаСДвухСкладов.СвободныйОстаток, 0);
//		ТекущиеДанные.ОстФизСкл = СвободныйОстатокСДвухСкладов;
//		ТекущиеДанные.НеХватаетОстатка = СвободныйОстатокСДвухСкладов < ТекущиеДанные.Количество;
//	КонецЕсли;
//КонецПроцедуры
//Данилова Е.В. 17.06.2026 0000000008 изм. процедуры на функцию
&НаСервере
//Процедура ПолучитьОстаткиНаСервере(СписокНоменклатуры,Склад,МасивНакладных,ФлагФизСклад = Ложь,МассивДополнительныхСкладов=Неопределено)
Функция ПолучитьОстаткиНаСервере(СписокНоменклатуры,Склад,МасивНакладных,ФлагФизСклад = Ложь,МассивДополнительныхСкладов=Неопределено)
	//++Данилова Е.В. 17.06.2026 №0000000008
	КэшОстатков = Новый Соответствие; 
	
	//Если СписокНоменклатуры.ВГраница()<0 Тогда Возврат КонецЕсли; 
	//Если НЕ ЗначениеЗаполнено(Склад) Тогда Возврат КонецЕсли; 
	
	Если СписокНоменклатуры.ВГраница()<0 Тогда
		Возврат КэшОстатков 
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Склад) Тогда 
		Возврат КэшОстатков 
	КонецЕсли;
	
	//--Данилова Е.В. 17.06.2026
	МассивСкладов = Новый Массив();
	 
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	Сводный.Номенклатура.Код77 КАК Код77,
	|	Сводный.Номенклатура КАК Номенклатура,
	|	СУММА(Сводный.Остаток) КАК Остаток,
	|	СУММА(Сводный.Резерв) КАК Резерв,
	|	СУММА(Сводный.ВиртуальныйРезерв) КАК ВиртуальныйРезерв
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЕСТЬNULL(Остатки.Номенклатура, Резервы.Номенклатура) КАК Номенклатура,
	|		ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК Остаток,
	|		ЕСТЬNULL(Резервы.КоличествоОстаток, 0) КАК Резерв,
	|		0 КАК ВиртуальныйРезерв
	|	ИЗ
	|		РегистрНакопления.ОстаткиТМЦ.Остатки(
	|				,
	|				Склад В (&МассивСкладов)
	|					И Номенклатура В (&СписокНоменклатуры)) КАК Остатки
	|			ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	|					,
	|					Склад В (&МассивСкладов)
	|						И Номенклатура В (&СписокНоменклатуры)) КАК Резервы
	|			ПО Остатки.Номенклатура = Резервы.Номенклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОстаткиТМЦ.Номенклатура,
	|		ОстаткиТМЦ.Количество,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ
	|	ГДЕ
	|		ОстаткиТМЦ.Регистратор в (&Регистратор)
	|		И ОстаткиТМЦ.Склад В(&МассивСкладов)
	|		И ОстаткиТМЦ.ВидДвижения = &Расход
	|		И ОстаткиТМЦ.Номенклатура В(&СписокНоменклатуры)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РезервыТМЦ.Номенклатура,
	|		0,
	|		-РезервыТМЦ.Количество,
	|		0
	|	ИЗ
	|		РегистрНакопления.РезервыТМЦ КАК РезервыТМЦ
	|	ГДЕ
	|		РезервыТМЦ.Регистратор В (&Регистратор)
	|		И РезервыТМЦ.Склад В(&МассивСкладов)
	|		И РезервыТМЦ.Номенклатура В(&СписокНоменклатуры)) КАК Сводный
	|
	|СГРУППИРОВАТЬ ПО
	|	Сводный.Номенклатура,
	|	Сводный.Номенклатура.Код77
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сводный.Номенклатура";
	
	Запрос.УстановитьПараметр("Расход",ВидДвиженияНакопления.Расход);	
	Запрос.УстановитьПараметр("Регистратор",МасивНакладных);
	Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
	
	
	Если НЕ Склад.ФизическийСклад.Пустая() И ПараметрыСеанса.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение и склад.ВидСклада<>Перечисления.ВидСклада.ВиртуальныйДляСклада Тогда
		
		МассивСкладов.Добавить(Склад.ФизическийСклад);				
	Иначе
		МассивСкладов.Добавить(Склад);				
	КонецЕсли;
	
	
	если МассивДополнительныхСкладов<>Неопределено тогда
		для каждого СтрМасс из МассивДополнительныхСкладов цикл
			МассивСкладов.Добавить(СтрМасс);
		КонецЦикла;
	КонецЕсли;	
	
	Если ФлагФизСклад И НЕ Склад.ФизическийСклад.Пустая() Тогда
		МассивСкладов.Добавить(Склад.ФизическийСклад);
	КонецЕсли;
	Запрос.УстановитьПараметр("МассивСкладов", МассивСкладов);
	//КэшОстатковСДвухСкладов.Вставить("КэшОстатков",Новый Соответствие); 
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл 
		//++Данилова Е.В. 17.06.2026  №0000000008 
		//КэшОстатковСДвухСкладов.КэшОстатков.Вставить(Выборка.Номенклатура, Новый Структура("Остаток,Резерв,СвободныйОстаток,Код77",
		//	Выборка.Остаток, Выборка.Резерв, Макс(0, Выборка.Остаток - Выборка.Резерв - Выборка.ВиртуальныйРезерв),
		//	Выборка.Код77)); 
		КэшОстатков.Вставить(Выборка.Номенклатура, Новый Структура("Остаток,Резерв,СвободныйОстаток,Код77",
		Выборка.Остаток, Выборка.Резерв, Макс(0, Выборка.Остаток - Выборка.Резерв - Выборка.ВиртуальныйРезерв),
		Выборка.Код77));
		//--Данилова Е.В. 17.06.2026
	КонецЦикла;
	//++Данилова Е.В. 17.06.2026  №0000000008
	Возврат КэшОстатков; 
	//--Данилова Е.В. 17.06.202
//КонецПроцедуры
КонецФункции


&НаСервере
Процедура ЗаполнитьТаблицуПечатиПоМатрице()

	Запрос			= Новый Запрос;
	Запрос.Текст 	= "ВЫБРАТЬ РАЗЛИЧНЫЕ
					   |	МатрицаТовары.Ссылка КАК Ссылка,
					   |	МатрицаТовары.Номенклатура КАК Номенклатура,
					   |	МатрицаТовары.ШККонтрагента КАК ШККонтрагента,
					   |	ВЫРАЗИТЬ(МатрицаТовары.АртикулКонтрагента КАК СТРОКА(150)) КАК АртикулКонтрагента,
					   |	МатрицаТовары.Цена КАК Цена,
					   |	МатрицаТовары.Кратность КАК Кратность,
					   |	МатрицаТовары.МинимальноеКоличество КАК МинимальноеКоличество,
					   |	МатрицаТовары.ЦенаПосредника КАК ЦенаПосредника,
					   |	МатрицаТовары.ШККонтрагентаБлочок КАК ШККонтрагентаБлочок,
					   |	МатрицаТовары.ШККонтрагентаКоробка КАК ШККонтрагентаКоробка,
					   |	МатрицаТовары.КратностьКоробки КАК КратностьКоробки,
					   |	ВЫРАЗИТЬ(МатрицаТовары.НаименованиеКонтрагента КАК СТРОКА(150)) КАК НаименованиеКонтрагента,
					   |	ВЫРАЗИТЬ(МатрицаТовары.КодПроизводителяКонтрагента КАК СТРОКА(150)) КАК КодПроизводителяКонтрагента,
					   |	МатрицаТовары.ШКСпайки КАК ШКСпайки,
					   |	МатрицаТовары.ШККонтрагентаДополнительный КАК ШККонтрагентаДополнительный,
					   |	МатрицаТовары.Ссылка.Дата КАК ДатаМатрицы,
					   |	ВЫРАЗИТЬ(МатрицаТовары.НаименованиеБрендаДляКонтрагента КАК СТРОКА(150)) КАК НаименованиеБрендаДляКонтрагента,
					   |	ВЫРАЗИТЬ(МатрицаТовары.НаименованиеЦветаДляКонтрагента КАК СТРОКА(150)) КАК НаименованиеЦветаДляКонтрагента,
					   |	ВЫРАЗИТЬ(МатрицаТовары.НаименованиеРазмераДляКонтрагента КАК СТРОКА(150)) КАК НаименованиеРазмераДляКонтрагента,
					   |	ВЫРАЗИТЬ(МатрицаТовары.ТипТовараДляКонтрагента КАК СТРОКА(150)) КАК ТипТовараДляКонтрагента,
					   |	МатрицаТовары.КратностьПаллеты КАК КратностьПаллеты,
					   |	МатрицаТовары.ПорядокУчастияВАкции КАК ПорядокУчастияВАкции,
					   |	МатрицаТовары.Номенклатура.Родитель.Коллекция КАК Коллекция
					   |ИЗ
					   |	Документ.Матрица.Товары КАК МатрицаТовары
					   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
					   |		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
					   |ГДЕ
					   |	МатрицаТовары.Ссылка.Проведен
					   |	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
					   |	И МатрицаТовары.Ссылка.Договор = &Договор
					   |	И МатрицаТовары.Ссылка.Дата <= &Дата1
					   |	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
					   |	И МатрицаПунктыДоставки.ПунктДоставки = &ПунктДоставки
					   |	И МатрицаТовары.Ссылка.ПостояннаяАкция = &ПостояннаяАкция
					   |	И МатрицаТовары.Номенклатура В(&Номенклатура)
					   |
					   |УПОРЯДОЧИТЬ ПО
					   |	ДатаМатрицы УБЫВ";

	Запрос.УстановитьПараметр("Дата2", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("Дата1", КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("ПунктДоставки", Объект.ПунктДоставки);
	Запрос.УстановитьПараметр("Договор", Объект.Договор);
	Запрос.УстановитьПараметр("ПостояннаяАкция", Ложь);
	Запрос.УстановитьПараметр("Номенклатура", Объект.Товары.выгрузить().выгрузитьколонку("Номенклатура"));
	
	ТЗМатриц = Запрос.Выполнить().Выгрузить();

КонецПроцедуры 


&НаСервере
Процедура УправлениеВидимостью()
	
	Элементы.ТоварыОстФизСкл.Видимость = ДваСклада; 	
	
КонецПроцедуры
&НаСервере
Процедура УстановитьНастройки()  	
	ВыводитьДанныеМатриц=Истина;
	//++Данилова Е.В. 17.06.2026 0000000008 
	//КэшОстатковСДвухСкладов = Новый Структура("КэшОстатков",Новый Соответствие);
	//--Данилова Е.В. 17.06.2026 
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
		УсловноеОформление.Элементы.Очистить();
	
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВыделятьВДокументах");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = истина;
		ЭлементОтбора.Использование = Истина;
			
		ЦветФона = Новый Цвет(204, 200, 153); //хаки 
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
		ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Товары");
		ПолеОформления.Использование = Истина;
		/////////////////////////////////////////////////////////////
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.НеХватаетОстатка");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = истина;
		ЭлементОтбора.Использование = Истина;
			
		ЦветФона = Новый Цвет(255, 255, 0);  //желтый 
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
		ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
		//++Данилова Е.В. 17.06.2026 №0000000008
		//ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Товары");  
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ТоварыОстФизСкл");
		//--Данилова Е.В. 17.06.2026 
		ПолеОформления.Использование = Истина;
		 ////////////////////////////////////////////////////////////
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ГруппаИ = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных")); 
		ГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ; 
		ГруппаИ.Использование = истина; 
		
		ЭлементОтбора = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.КоличествоПланМакс");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
		ЭлементОтбора.ПравоеЗначение = 1.2;
		ЭлементОтбора.Использование = Истина;
		
		ЭлементОтбора = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.КоличествоПлан");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
		ЭлементОтбора.ПравоеЗначение = 0;
		ЭлементОтбора.Использование = Истина;
		
		ЦветФона = Новый Цвет(255,204,153);  //оранжево-персиковый 
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
		ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Товары");
		ПолеОформления.Использование = Истина;
		////////////////////////////////////////////////////////////
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ГруппаИ = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных")); 
		ГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ; 
		ГруппаИ.Использование = истина;
		
		ЭлементОтбора = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ОстатокКонтрагента");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.равно;
		ЭлементОтбора.ПравоеЗначение = 0;
		ЭлементОтбора.Использование = Истина;
		
		ЭлементОтбора = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Количество");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.равно;
		ЭлементОтбора.ПравоеЗначение = 0;
		ЭлементОтбора.Использование = Истина;
		
		ЦветФона = Новый Цвет(204, 255, 153);//коралловый 
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
		ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Товары");
		ПолеОформления.Использование = Истина;
		
		////////////////////////////////////////////////////////////
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ГруппаИ = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных")); 
		ГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ; 
		ГруппаИ.Использование = истина;
		
		ЭлементОтбора = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.НедостающееКоличество");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
		ЭлементОтбора.ПравоеЗначение = 0;
		ЭлементОтбора.Использование = Истина;
		
		ЭлементОтбора = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.КОтгрузке");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
		ЭлементОтбора.ПравоеЗначение = 0;
		ЭлементОтбора.Использование = Истина;
		
		ЭлементОтбора = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.КОтгрузкеСоотношение");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
		ЭлементОтбора.ПравоеЗначение = 1.5;
		ЭлементОтбора.Использование = Истина;
		
		ЦветФона = Новый Цвет(255, 255, 153); //светложелтый 
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
		ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Товары");
		ПолеОформления.Использование = Истина; 
		////////////////////////////////////////////////
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Цвет");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = "Хаки";
		ЭлементОтбора.Использование = Истина;
			
		ЦветФона = Новый Цвет(204, 200, 153); //хаки 
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона); 
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "");
		ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ТоварыЦвет");
		ПолеОформления.Использование = Истина;
		///////////////////////////////////////////////
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Цвет");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = "Желтый";
		ЭлементОтбора.Использование = Истина;
			
		ЦветФона = Новый Цвет(255, 255, 0);  
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона); 
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "");
		ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ТоварыЦвет");
		ПолеОформления.Использование = Истина; 
        ////////////////////////////////////////////////
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Цвет");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = "Персиковый";
		ЭлементОтбора.Использование = Истина;
			
		ЦветФона = Новый Цвет(255,204,153);  
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона); 
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "");
		ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ТоварыЦвет");
		ПолеОформления.Использование = Истина;
		////////////////////////////////////////////////
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Цвет");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = "Коралловый";
		ЭлементОтбора.Использование = Истина;
			
		ЦветФона = Новый Цвет(204, 255, 153);  
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона); 
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "");
		ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ТоварыЦвет");
		ПолеОформления.Использование = Истина;
		////////////////////////////////////////////////
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Цвет");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = "Светло-желтый";
		ЭлементОтбора.Использование = Истина;
			
		ЦветФона = Новый Цвет(255, 255, 153);  
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона); 
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "");
		ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ТоварыЦвет");
		ПолеОформления.Использование = Истина;
		////////////////////////////////////////////////
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Цвет");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = "Без цвета";
		ЭлементОтбора.Использование = Истина;
			
		ЦветФона = Новый Цвет(255, 255, 255);  
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона); 
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "");
		ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ТоварыЦвет");
		ПолеОформления.Использование = Истина; 	
		
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоробокНаПаллетеПриИзмененииНаКлиенте()
	//Текущиеданные = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки); 
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные; 
	ВремСтрока = СтрочкиИзменённыеРуками.НайтиСтроки(Новый Структура("Номенклатура",ТекущиеДанные.Номенклатура));
	если ВремСтрока.Количество() = 0 тогда 
		НоваяСтрока = СтрочкиИзменённыеРуками.добавить();
		НоваяСтрока.Номенклатура = ТекущиеДанные.Номенклатура;
		новаяСтрока.КратностьПаллеты = ТекущиеДанные.КоробокНаПаллете; 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКОтгрузкеПриИзмененииНаКлиенте(Текущиеданные,СоответствиеРеквизитыТоваров)
	если Текущиеданные.КОтгрузке>0 тогда
		ШтукВКоробе = СоответствиеРеквизитыТоваров.Получить(Текущиеданные.Номенклатура).ШтукВКоробке;
		если ШтукВКоробе>0 тогда
			Текущиеданные.КоробокКОтгрузке = Текущиеданные.КОтгрузке/ШтукВКоробе;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоробокКОтгрузкеПриИзмененииНаКлиенте(Текущиеданные,СоответствиеРеквизитыТоваров)
	 
	КратностьКоробки = СоответствиеРеквизитыТоваров.Получить(Текущиеданные.номенклатура).ШтукВКоробке;
	если КратностьКоробки=0 тогда
		КратностьКоробки=1;
	КонецЕсли;
	Текущиеданные.КОтгрузке =   Текущиеданные.коробокКОтгрузке * КратностьКоробки;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПаллетКОтгрузкеПриИзмененииНаКлиенте(ТекСтрока)
	НовоеЗначениеПаллет=ТекСтрока.ПаллетКОтгрузке;
	если ВыводитьДанныеМатриц тогда
		СтрокаМатрицы=ТЗМатриц.найти(ТекСтрока.Номенклатура);
		если СтрокаМатрицы<>Неопределено тогда
			если ТекСтрока.СпособПоставки=ПредопределенноеЗначение("Перечисление.СпособПоставкиКонтрагенту.МоноПаллета") тогда
				КратностьПаллеты = СтрокаМатрицы.КратностьПаллеты;
				если КратностьПаллеты>0 тогда
					ТекСтрока.КОтгрузке=КратностьПаллеты*НовоеЗначениеПаллет; 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	

КонецПроцедуры

&НаСервере
Процедура РасчитатьДанныеПополненияНаСервере()
	ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
	ДокументОбъект.РасчитатьДанныеПополнения(ПерерасчитыватьТоварыВПути); 
	ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
КонецПроцедуры

&НаСервере
Процедура СоздатьРНКНаСервере(СозданныеРНК) 
	
	ДокОбъект = РеквизитФормыВЗначение("Объект"); 
	ДокОбъект.СоздатьНаборРНКНаНедостающееКоличество("РНК",СозданныеРНК);
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура РасчитатьТолькоКоробаНаСервере()
	ДокОбъект = РеквизитФормыВЗначение("Объект"); 
	ДокОбъект.РасчитатьТолькоКороба();
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаявкуНаПерепаковкуНаСервере()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект"); 
	ДокОбъект.СоздатьНаборРНКНаНедостающееКоличество("ЗаявкаНаПерепаковку");
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура СоздатьРНКИзЗаявокНаСервере()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокОснование", Объект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкаНаПерепаковку.Ссылка КАК ДокЗаявка
	|ИЗ
	|	Документ.ЗаявкаНаПерепаковку КАК ЗаявкаНаПерепаковку
	|ГДЕ
	|	ЗаявкаНаПерепаковку.ДокОснование = &ДокОснование
	|	И ЗаявкаНаПерепаковку.Проведен
	|	И ЗаявкаНаПерепаковку.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаПерепаковку.Закрыта)
	|	И ЕСТЬNULL(ЗаявкаНаПерепаковку.Комплектация, ЗНАЧЕНИЕ(Документ.Комплектация.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Документ.Комплектация.ПустаяСсылка)
	|	И ЕСТЬNULL(ЗаявкаНаПерепаковку.РасходнаяНакладная, ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)) = ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	Документ.ЗаявкаНаПерепаковку";

	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);

	Пока Выборка.Следующий() Цикл

		НачатьТранзакцию();

		ЗаявкаОбъект = Выборка.ДокЗаявка.ПолучитьОбъект();
		Если ЗаявкаОбъект <> Неопределено Тогда

			ЗаявкаОбъект.Статус = Перечисления.СтатусыЗаявокНаПерепаковку.Отработана;

			Попытка
				ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Пока ТранзакцияАктивна() Цикл
					ОтменитьТранзакцию();
				КонецЦикла;
				Сообщить("Во время транзакции произошла ошибка." + ОписаниеОшибки());
				Продолжить;
			КонецПопытки;

			ДополнительныеРеквизиты = Новый Структура("СостояниеНакладной", Перечисления.СостоянияНакладной.ВРаботе);

			Накладная = Документы.ЗаявкаНаПерепаковку.СоздатьРасходнуюНакладную(Выборка.ДокЗаявка,
				Выборка.ДокЗаявка.Товары.Выгрузить(), ДополнительныеРеквизиты, Истина);

			Если Накладная <> Неопределено Тогда

				ЗаявкаОбъект.РасходнаяНакладная = Накладная;

				Попытка
					ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					Пока ТранзакцияАктивна() Цикл
						ОтменитьТранзакцию();
					КонецЦикла;
					Сообщить("Во время транзакции произошла ошибка." + ОписаниеОшибки());
					Продолжить;
				КонецПопытки;

			КонецЕсли;

		КонецЕсли;

		ЗафиксироватьТранзакцию();

		Сообщить(Строка(Выборка.ДокЗаявка));
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СообщитьДокументыПутиНаСервере(ИдентификаторСтроки)
	СтрокаТовара = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки); 
	ТекНоменклатура = СтрокаТовара.Номенклатура;

	Если Объект.Общий Тогда
		ОтключитьКонтрольПунктовДоставки = Истина;
	Иначе
		ОтключитьКонтрольПунктовДоставки = Ложь;
	КонецЕсли;

	СписокПД = Новый СписокЗначений;
	СписокПД.Добавить(Объект.ПунктДоставки);
	Запрос = Новый запрос;
	запрос.Текст= "ВЫБРАТЬ РАЗЛИЧНЫЕ
				  |	РеквизитыСправочников.Справочник КАК ПД
				  |ИЗ
				  |	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
				  |ГДЕ
				  |	РеквизитыСправочников.ЗначениеРеквизита = &Справочник
				  |	И РеквизитыСправочников.ИмяРеквизита = ""Связанный адрес""";
	запрос.УстановитьПараметр("Справочник", Объект.ПунктДоставки);
	Результат=запрос.Выполнить().Выбрать();
	Пока результат.Следующий() Цикл
		СписокПД.Добавить(результат.ПД);
	КонецЦикла;

	запрос=Новый запрос;
	запрос.Текст= "ВЫБРАТЬ
				  |	СУММА(т1.Количество) КАК Количество,
				  |	т1.Номенклатура КАК Номенклатура,
				  |	т1.Ссылка КАК Ссылка
				  |ИЗ
				  |	(ВЫБРАТЬ
				  |		СУММА(РасходнаяНакладнаяТовары.Количество) КАК Количество,
				  |		РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
				  |		РасходнаяНакладнаяТовары.Ссылка КАК Ссылка
				  |	ИЗ
				  |		Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
				  |	ГДЕ
				  |		(РасходнаяНакладнаяТовары.Ссылка В (&списокРНК)
				  |				ИЛИ РасходнаяНакладнаяТовары.Ссылка.Проведен
				  |					И РасходнаяНакладнаяТовары.Ссылка.КодОперации = &КодОперации
				  |					И РасходнаяНакладнаяТовары.Ссылка.Контрагент = &Контрагент
				  |					И (РасходнаяНакладнаяТовары.Ссылка.ПунктДоставки В (&ПунктДоставки)
				  |						ИЛИ &ОтключитьКонтрольПунктовДоставки)
				  |					И РасходнаяНакладнаяТовары.Количество > 0
				  |					И (РасходнаяНакладнаяТовары.Ссылка.Отгружен = &Резерв
				  |						ИЛИ РасходнаяНакладнаяТовары.Ссылка.ДатаОтгрузки = НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)))
				  |		И РасходнаяНакладнаяТовары.Номенклатура В(&Номенклатура)
				  |		И РасходнаяНакладнаяТовары.Ссылка.Дата >= &Дата
				  |	
				  |	СГРУППИРОВАТЬ ПО
				  |		РасходнаяНакладнаяТовары.Номенклатура,
				  |		РасходнаяНакладнаяТовары.Ссылка
				  |	
				  |	ОБЪЕДИНИТЬ ВСЕ
				  |	
				  |	ВЫБРАТЬ
				  |		СУММА(Товары.Количество),
				  |		Товары.Номенклатура,
				  |		Товары.Ссылка
				  |	ИЗ
				  |		Документ.Комплектация.Товары КАК Товары
				  |	ГДЕ
				  |		Товары.Ссылка В(&списокРНК)
				  |		И Товары.Номенклатура В(&Номенклатура)
				  |		И Товары.Ссылка.Отгружен = &Резерв
				  |	
				  |	СГРУППИРОВАТЬ ПО
				  |		Товары.Номенклатура,
				  |		Товары.Ссылка) КАК т1
				  |
				  |СГРУППИРОВАТЬ ПО
				  |	т1.Номенклатура,
				  |	т1.Ссылка";
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	запрос.УстановитьПараметр("ПунктДоставки", СписокПД);
	запрос.УстановитьПараметр("Дата", Константы.ДатаЗапретаРедактирования.Получить() - 30 * 24 * 3600);
	запрос.УстановитьПараметр("Номенклатура", ТекНоменклатура);
	запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	запрос.УстановитьПараметр("Резерв", Перечисления.Отгружен.Резерв);
	запрос.УстановитьПараметр("списокРНК", Объект.РНКПути.Выгрузить().ВыгрузитьКолонку("Накладная"));
	Запрос.УстановитьПараметр("КодОперации", Перечисления.КодыОперацийОстатки.Комиссия);

	запрос.УстановитьПараметр("ОтключитьКонтрольПунктовДоставки", ОтключитьКонтрольПунктовДоставки);

	ТЗТоваровВпути = запрос.Выполнить().Выгрузить();
	Для Каждого СтрТЗ Из ТЗТоваровВпути Цикл
		Сообщить("" + СтрТЗ.Ссылка + " - " + Строка(СтрТЗ.Количество));
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура СоздатьЗаказыFBOНаСервере()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	РНКСозданные = ДокОбъект.СоздатьНаборРНКСОбъединением();

	Если РНКСозданные <> Неопределено Тогда
		ДокОбъект.СоздатьЗаказыFBO(РНКСозданные);
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ВыводитьДанныеМатрицПриИзменении(Элемент)
	//ТоварыПриИзмененииНаСервере();
	ТоварыПриИзмененииНаКлиенте(); 
КонецПроцедуры

#КонецОбласти


