Функция ВыполнитьВФоне(ИмяПроцедуры, пОбработки = Неопределено, КлючФЗ = "", Наименование = "") Экспорт	
	
	пМетода = Новый Массив;
	пМетода.Добавить(ИмяПроцедуры);
	пМетода.Добавить(пОбработки);
	
	ФЗ = ФоновыеЗадания.Выполнить("МаркировкаС.ФоноваяФункция", пМетода, КлючФЗ, Наименование);
	
	Возврат ФЗ.УникальныйИдентификатор;

КонецФункции

Функция ФоноваяФункция(ИмяПроцедуры, пОбработки) Экспорт
	Части = СтрРазделить(ИмяПроцедуры, ".");
	Если Части[0] = "Обработка" Тогда		
		Обработка = Обработки[Части[1]].Создать();
		Результат = Вычислить("Обработка."+Части[2]+"(пОбработки)");
		
		АдресРезультата = МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "АдресРезультата");
		Если ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
			ПоместитьВоВременноеХранилище(Результат, АдресРезультата);										
		КонецЕсли;		
	ИначеЕсли Части[0] = "ВнешняяОбработка" Тогда
		
		ИмяВФ = ПолучитьИмяВременногоФайла("epf");		
		пОбработки.ОбразОбработки.Записать(ИмяВФ);
		
		ОЗОД = Новый ОписаниеЗащитыОтОпасныхДействий;
		ОЗОД.ПредупреждатьОбОпасныхДействиях = Ложь;		
		
		Обработка = ВнешниеОбработки.Создать(ИмяВФ, Ложь, ОЗОД); 
		
		УдалитьФайлы(ИмяВФ,"*");
		
		Результат = Вычислить("Обработка."+Части[2]+"(пОбработки)");
		
		АдресРезультата = МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "АдресРезультата");
		Если ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
			ПоместитьВоВременноеХранилище(Результат, АдресРезультата);										
		КонецЕсли;		
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции //ФоноваяФункция(ИмяПроцедуры, пОбработки)
 

Процедура СообщитьПрогресс(Знач Процент = Неопределено, Знач Текст = Неопределено, Знач ДопПараметры = Неопределено) Экспорт
	
	Если ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание() = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Данные = Новый Структура("ТипСообщения,Прогресс", "Прогресс", ПрогрессДанные());
	Если Процент <> Неопределено Тогда
		Данные.Прогресс.Процент = Процент;
	КонецЕсли;	
	Если Текст <> Неопределено Тогда
		Данные.Прогресс.Текст	= Текст;
	КонецЕсли;
	
	Если ДопПараметры <> Неопределено Тогда
		Данные.Прогресс.Вставить("ДопПараметры", ДопПараметры);
	КонецЕсли;	
	
	МаркировкаКС.СообщитьПользователю(ЗначениеВСтрокуВнутр(Данные));
	
КонецПроцедуры

Функция ПрогрессДанные(Процент = 0, Текст = "")

	Возврат Новый Структура("Процент,Текст", Процент,Текст);

КонецФункции // ()
 

Функция ПрочитатьПрогрессИСообщения(Знач ИдентификаторЗадания, Знач Режим = "ПрогрессИСообщения") Экспорт
	
	Сообщения = Новый ФиксированныйМассив(Новый Массив);
	Результат = Новый Структура("Сообщения, Прогресс", Сообщения, Неопределено);
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	Если Задание = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	МассивСообщений = Задание.ПолучитьСообщенияПользователю(Истина);
	Если МассивСообщений = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Количество		= МассивСообщений.Количество();
	Сообщения		= Новый Массив;
	
	ЧитатьСообщения = (Режим = "ПрогрессИСообщения" Или Режим = "Сообщения"); 
	ЧитатьПрогресс  = (Режим = "ПрогрессИСообщения" Или Режим = "Прогресс"); 
	
	Если ЧитатьСообщения И Не ЧитатьПрогресс Тогда
		Результат.Сообщения = Новый ФиксированныйМассив(МассивСообщений);
		Возврат Результат;
	КонецЕсли;
	
	Для Номер = 0 По Количество - 1 Цикл
		Сообщение = МассивСообщений[Номер];
		
		Если СтрНачинаетсяС(Сообщение.Текст, "{") Тогда
			Данные = ЗначениеИзСтрокиВнутр(Сообщение.Текст); 					
			ТипСообщения = МаркировкаКС.ПолучитьЗначениеПараметра(Данные, "ТипСообщения");
			Если ТипСообщения = "Прогресс" Тогда
				Если ЧитатьПрогресс Тогда				
					Результат.Прогресс 	= Данные.Прогресс;
				КонецЕсли; 				
			Иначе
				Если ЧитатьСообщения Тогда
					Сообщения.Добавить(Сообщение);				
				КонецЕсли; 				
			КонецЕсли; 					
		КонецЕсли;		
	КонецЦикла;
	
	Результат.Сообщения = Новый ФиксированныйМассив(Сообщения);
	
	Возврат Результат;	
КонецФункции //ПрочитатьПрогрессИСообщения(Знач ИдентификаторЗадания, Знач Режим = "ПрогрессИСообщения")

Функция УстановитьОтборДинСписка(ДинСписок, Отбор) Экспорт
	мОтбор		= ДинСписок.Отбор;
	мОтбор.Элементы.Очистить();		
	
	Для Каждого КиЗ Из Отбор Цикл
		ЭлементОтбора = мОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных(КиЗ.Ключ);
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение	= Киз.Значение;
		ЭлементОтбора.Использование		= Истина;
	КонецЦикла; 	
КонецФункции //УстановитьОтборДинСписка(ДинСписок, Отбор) Экспорт

Функция ПолучитьНоменклатуруДокумента(ДокСсылка, ИмяТЧ = "Товары") Экспорт
	
	Запрос			= Новый Запрос;
	Запрос.Текст	= " 
	|ВЫБРАТЬ РАЗЛИЧНЫЕ					
	|	Номенклатура
	|ИЗ
	|	"+ДокСсылка.Метаданные().ПолноеИмя()+"."+ИмяТЧ+"
	|ГДЕ
	|	Ссылка = &ДокСсылка
	|";
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
	
КонецФункции // ()

Функция ДобавитьУзелВПолучателей(СписокПолучателей, УзелПолучатель, УзелОтправитель, Загрузка) Экспорт
	Если Загрузка И УзелПолучатель = УзелОтправитель Тогда //туда-сюда гонять не будем		
	Иначе
		Если ЗначениеЗаполнено(УзелПолучатель) Тогда
			СписокПолучателей.Добавить(УзелПолучатель);
		КонецЕсли;
	КонецЕсли;	
КонецФункции // Добавить()

Функция ОбъектСуществует(Ссылка, Знач ИмяТаблицы = "") Экспорт
	Если Ссылка = Неопределено Тогда
		Возврат Ложь;
	ИначеЕсли Ссылка=Null Тогда
		Возврат Ложь;
	ИначеЕсли НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Ложь;							
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяТаблицы) Тогда
		МетаОбъект = Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
	Иначе				
		МетаОбъект = Метаданные.НайтиПоТипу(ТипЗнч(Ссылка)); 
	КонецЕсли; 
	
	Если МетаОбъект = Неопределено Тогда
		Возврат Ложь;	
	КонецЕсли;	
	
	Запрос			= Новый Запрос;
	Запрос.Текст	= "ВЫБРАТЬ ВерсияДанных ИЗ " + МетаОбъект.ПолноеИмя() + " ГДЕ Ссылка=&Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();	
	
	Возврат (Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ВерсияДанных));
КонецФункции //ОбъектСуществует(Ссылка, Знач ИмяТаблицы = "") Экспорт

Функция ОбменДанными(ТаблицаПараметров = Неопределено) Экспорт
	ПланыОбмена.ДанныеЧЗ.ОбменДанными(ТаблицаПараметров);
КонецФункции //ОбменДанными(ТаблицаПараметров = Неопределено) Экспорт

Функция ИмяКаталогаСРазделителем(ИмяКаталога) Экспорт
	мКаталог = СокрЛП(ИмяКаталога);
	РП = ПолучитьРазделительПутиСервера();
	Если НЕ СтрЗаканчиваетсяНа(мКаталог, РП) Тогда
		мКаталог = мКаталог + РП;	
	КонецЕсли;
	Возврат мКаталог;
КонецФункции //ИмяКаталогаСРазделителем(ИмяКаталога) Экспорт
	
Функция ПолноеИмяФайла(ИмяКаталога, ИмяФайла) Экспорт	
	Возврат ИмяКаталогаСРазделителем(ИмяКаталога) + ИмяФайла;
КонецФункции //ПолноеИмяФайла(ИмяКаталога, ИмяФайла)

Функция ПолучитьСвободныеКодыШтук(Номенклатура, Количество, ПодразделениеНанесения) Экспорт	
	//+++Чирков 20230330 - перерход на унифицированные методы получения свободных кодов
	Возврат Справочники.ШтрихкодыУпаковокТоваров.ПолучитьСвободныеКодыШтук(Номенклатура, Количество, Новый Структура("Местонахождение", ПодразделениеНанесения));
	//---Чирков 20230330 - перерход на унифицированные методы получения свободных кодов

	Результат = МаркировкаКС.СтруктураРезультата();
	
	Если Количество = 0 Тогда
		Результат.Данные = Новый ТаблицаЗначений;
		Возврат Результат;
	КонецЕсли; 
		
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ " + МаркировкаКС.ЧислоБезДури(Количество) + "
	|	ШтрихКодУпаковки
	|ИЗ
	|	РегистрСведений.СтатусыКМ_Факт.СрезПоследних(,
	|		Номенклатура 							= &Номенклатура
	|		И ТипШК									= ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)  
	//Валетов + 24,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3522  Добавил Перемаркировку
	//|		И ШтрихКодУпаковки.СпособВводаВОборот	= ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.МаркировкаОстатков) 
	|		И ШтрихКодУпаковки.СпособВводаВОборот В (ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.МаркировкаОстатков), ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.Перемаркировка))
	|		И ШтрихКодУпаковки.ТипУпаковки			= ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МаркированныйТовар)
	|		И (
	|			ШтрихКодУпаковки.ТипКода			= ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Товар) ИЛИ		
	|			(
	|				ШтрихКодУпаковки.ТипКода			= ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор)
	|				И ШтрихКодУпаковки.Владелец.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект)
	|			)
	|		)	
	|	)
	|ГДЕ
	|	Местонахождение = &ПодразделениеНанесения	
	|	И НЕ ВПути
	|	И Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.ГотовКПечати)	
	|ДЛЯ ИЗМЕНЕНИЯ
	|	РегистрСведений.СтатусыКМ_Факт.СрезПоследних
	//Чирков Д.С. 05.03.2025 +++ Оптимизация производительности - а порядок кракозябл - не сильно важен
	//|УПОРЯДОЧИТЬ ПО
	//|	ШтрихКодУпаковки.Наименование	
	//Чирков Д.С. 05.03.2025 ---
	|";	
	
	Запрос.УстановитьПараметр("ПодразделениеНанесения", ПодразделениеНанесения);
	Запрос.УстановитьПараметр("Номенклатура",			Номенклатура);	
	
	Результат.Данные = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШтрихКодУпаковки");
		
	ПолученоКМ = Результат.Данные.Количество();
	Если ПолученоКМ <> Количество Тогда	
		ТекстОшибки = СтрШаблон("Найдено %1 свободных, из %2 требуемых кодов маркировки (%3), по подразделению: %4.",
			ПолученоКМ, Количество, Перечисления.ТипыШтрихКодов.Штука, ПодразделениеНанесения);		
		Результат.Ошибки.Добавить(ТекстОшибки);		
	КонецЕсли;
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;
КонецФункции //ПолучитьСвободныеКодыШтук(ВыбНоменклатура)

Функция ЗагрузитьКодыИзТаблицы(ТК, ПерезаписыватьКМ = Ложь, АдресВозврата = Неопределено) Экспорт
	Обработка = МаркировкаВС.СоздатьОбработкуАПИ();
	Возврат Обработка.ЗагрузитьКодыИзТаблицы(ТК, ПерезаписыватьКМ, АдресВозврата);
КонецФункции //ЗагрузитьКодыИзТаблицы(ТК, ПерезаписыватьКМ = Ложь, АдресВозврата = Неопределено) Экспорт 

Функция ПакетнаяПечатьЭтикетокЧЗ(пОбработки, АдресВозврата = Неопределено) Экспорт
	//Обработка = Обработки.ПечатьЭтикетокЧЗ.Создать();	                                                                 
	ОЗОД = Новый ОписаниеЗащитыОтОпасныхДействий;
	ОЗОД.ПредупреждатьОбОпасныхДействиях = Ложь;
	
	Обработка = ВнешниеОбработки.Создать(Константы.КаталогВнешнихОтчетов.Получить()+"PrnForms\ПечатьЭтикетокЧЗ.epf", Ложь, ОЗОД);
	
	рПечати = Обработка.ПакетнаяПечатьЭтикетокЧЗ(пОбработки, АдресВозврата);
	
	Возврат рПечати; 
КонецФункции //ПакетнаяПечатьЭтикетокЧЗ(пОбработки, АдресВозврата = Неопределено) Экспорт

Функция ТекущийСтатусКодаФакт(ШтрихКодУпаковки) Экспорт
	Результат = Перечисления.СтатусыКодовМаркировкиФакт.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Период,
	|	Статус
	|ИЗ
	|	РегистрСведений.СтатусыКМ_Факт
	|ГДЕ
	|	ШтрихКодУпаковки = &ШтрихКодУпаковки	
	|	И Активность
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ
	|";
	
	Запрос.УстановитьПараметр("ШтрихКодУпаковки", ШтрихКодУпаковки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Статус) Тогда
		Результат = Выборка.Статус;	
	КонецЕсли; 
	
	Возврат Результат;	
КонецФункции //ТекущийСтатусКодаФакт(ШтрихКодУпаковки) Экспорт

Функция ОбслужитьОчередиЗадач(пОбработки, АдресВозврата = Неопределено) Экспорт
	ЗаписатьВЛог("Регламент", "Обслуживание очереди задач. Запуск", "Информация");
	
	РегистрыСведений.ЗадачиОтложеннойОбработкиДокументов.ОбновитьСтатусыЗадач();
	//+++Чирков 31.08.2025 
	РегистрыСведений.ЗадачиОтложеннойОбработкиДокументов.ЗапланироватьВыполнениеЗадач();
	//---Чирков 31.08.2025                         
	
	//+++Чирков 02.06.2026 MARK-3589
	РегистрыСведений.ОчередьЗадач.ПерезапуститьУпавшиеЗадачи();	
	//+++Чирков 02.06.2026
	
	рОбслуживания = РегистрыСведений.ОчередьЗадач.ОбслужитьОчереди(АдресВозврата);
	
	Возврат рОбслуживания;
КонецФункции //ОбслужитьОчередиЗадач(пОбработки, АдресВозврата = Неопределено) Экспорт

Функция СериализоватьВJSON(Данные, ИмяФайла = Неопределено) Экспорт
	Запись = Новый ЗаписьJSON;
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
		Запись.ОткрытьФайл(ИмяФайла);	
	Иначе
		Запись.УстановитьСтроку();
	КонецЕсли;
	
	СериализаторXDTO.ЗаписатьJSON(Запись, Данные, НазначениеТипаXML.Явное);
	
	Возврат Запись.Закрыть();
КонецФункции //СериализоватьВJSON(Данные, ИмяФайла = Неопределено) Экспорт

Функция ПрочитатьИзФайлаJSON(ИмяФайла, Знач Тип = Неопределено) Экспорт
	Если Тип = Неопределено Тогда
		Тип = Тип("ТаблицаЗначений");	
	КонецЕсли; 
	Чтение = Новый ЧтениеJSON;
	Чтение.ОткрытьФайл(ИмяФайла);
	
	Данные = СериализаторXDTO.ПрочитатьJSON(Чтение, Тип);
	
	Чтение.Закрыть();
	
	Возврат Данные;
КонецФункции //ПрочитатьТаблицуИзФайлаЖСОН(ТЗ, ИмяФайла)

Функция ПрочитатьИзСтрокиJSON(СтрокаДанных, Знач Тип = Неопределено) Экспорт
	Если Тип = Неопределено Тогда
		Тип = Тип("ТаблицаЗначений");	
	КонецЕсли; 
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаДанных);
	
	Данные = СериализаторXDTO.ПрочитатьJSON(Чтение, Тип);
	
	Чтение.Закрыть();
	
	Возврат Данные;
КонецФункции //ПрочитатьТаблицуИзФайлаЖСОН(ТЗ, ИмяФайла)

Функция ВерсияПлатформы() Экспорт
	СисИнфо = Новый СистемнаяИнформация;
	
	Возврат НомерИзЧастей(СтрРазделить(СисИнфо.ВерсияПриложения, "."));
КонецФункции //ВерсияПлатформы()

Функция ВерсияПлатформыПоРежимуСовместимости() Экспорт
	РежимСовместимости = ВРег(""+Метаданные.РежимСовместимости);
	
	Если РежимСовместимости = ВРег("НеИспользовать") Тогда
		Результат = ВерсияПлатформы();
	Иначе	                  		
		РежимСовместимости = СтрЗаменить(РежимСовместимости, "ВЕРСИЯ", "");	
		Результат = НомерИзЧастей(СтрРазделить(РежимСовместимости, "_"));				
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ВерсияПлатформыПоРежимуСовместимости() Экспорт

Функция НомерИзЧастей(Части)
	Результат = Части[0];
	Если Части.Количество() > 1 Тогда
		Результат = Результат + "." + Прав("000" + Части[1], 3);
	КонецЕсли;
	Если Части.Количество() > 2 Тогда
		Результат = Результат + "." + Прав("000" + Части[2], 3);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //НомерИзЧастей(Части)

Функция ЗаписатьОтложенныеДвиженияДокументов(тПараметров = Неопределено) Экспорт
	Если ТипЗнч(тПараметров) = Тип("ТаблицаЗначений") Тогда
		пОбработки = Новый Соответствие;
		Для каждого СтрокаП Из тПараметров Цикл
			ТекЗнач = пОбработки[СтрокаП.Имя];	
			Если ТекЗнач = Неопределено Тогда
				ТекЗнач = СтрокаП.Значение;
			Иначе         
				ТекЗнач = ТекЗнач + "," + СтрокаП.Значение;
			КонецЕсли;                       
			пОбработки[СтрокаП.Имя] = ТекЗнач;
		КонецЦикла;
	Иначе
		пОбработки = тПараметров;	
	КонецЕсли;

	Возврат РегистрыСведений.ОтложенныеДвиженияДокументов.ЗаписатьОтложенныеДвиженияДокументов(пОбработки);	
КонецФункции //ЗаписатьОтложенныеДвиженияДокументов(тПараметров = Неопределено) Экспорт

Функция ЗаменитьСтатусыНакладных(тПараметров = Неопределено) Экспорт
	Если ТипЗнч(тПараметров) = Тип("ТаблицаЗначений") Тогда
		пОбработки = Новый Соответствие;
		Для каждого СтрокаП Из тПараметров Цикл
			ТекЗнач = пОбработки[СтрокаП.Имя];	
			Если ТекЗнач = Неопределено Тогда
				ТекЗнач = СтрокаП.Значение;
			Иначе         
				ТекЗнач = ТекЗнач + "," + СтрокаП.Значение;
			КонецЕсли;                       
			пОбработки[СтрокаП.Имя] = ТекЗнач;
		КонецЦикла;
	Иначе
		пОбработки = тПараметров;	
	КонецЕсли;

	Возврат РегистрыСведений.ЗаданиеНаСменуСтатусовНакладной.ЗаменитьСтатусыНакладных(пОбработки);
КонецФункции //ЗаменитьСтатусыНакладных(тПараметров = Неопределено) Экспорт

Функция НайтиСправочник(Вид, СтруктураПоиска) Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник."+Вид+"
	|ГДЕ
	|	Истина ";
	
	Для Каждого Элемент Из СтруктураПоиска Цикл
		Запрос.Текст=Запрос.Текст+"
		|	И "+Элемент.Ключ+"=&"+Элемент.Ключ;
		
		Запрос.УстановитьПараметр(Элемент.Ключ,Элемент.Значение);
	КонецЦикла;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
		Возврат Выборка.Ссылка;			
	КонецЕсли;	
	
	Возврат Справочники[Вид].ПустаяСсылка();
КонецФункции //НайтиСправочник(Вид,СтруктураПоиска) Экспорт

Функция ДобавитьКоды(Объект, мНаименованияКодов) Экспорт
	мКоды = НайтиКоды(мНаименованияКодов);
	Для Каждого ШтрихкодУпаковки Из мКоды Цикл
		СтрокаТЧ = Объект.ШтрихкодыУпаковок.Добавить();							
		СтрокаТЧ.ШтрихкодУпаковки = ШтрихкодУпаковки;			
	КонецЦикла;
КонецФункции //ДобавитьКоды(Объект, Коды) Экспорт

Процедура УдалитьКоды(Объект, Коды) Экспорт
	Для Каждого ШтрихкодУпаковки Из Коды Цикл
		Строки = Объект.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("ШтрихкодУпаковки", ШтрихкодУпаковки));
		Для Каждого Строка Из Строки Цикл
			Объект.ШтрихкодыУпаковок.Удалить(Строка);		
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Функция НайтиКоды(мКоды) Экспорт
	тКодов = Новый ТаблицаЗначений;
	тКодов.Колонки.Добавить("Наименование", ПолучитьОписаниеТиповСтроки(Метаданные.Справочники.ШтрихкодыУпаковокТоваров.ДлинаНаименования));
	Для каждого Наименование Из мКоды Цикл
		СтрокаТ = тКодов.Добавить();
		СтрокаТ.Наименование = Наименование;	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Наименования ИЗ &тКодов КАК тКодов
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СпрКМ.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_Наименования
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК СпрКМ
	|ПО
	|	СпрКМ.Наименование = ВТ_Наименования.Наименование
	|";
	
	Запрос.УстановитьПараметр("тКодов", тКодов);	
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции //НайтиКоды(мКоды) Экспорт

Функция ЗаписатьФактСканирования(ШтрихКод, ДокументСканирования, ДопПараметры = Неопределено) Экспорт
	ТипШК 			= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ТипШК", Перечисления.ТипыШтрихКодов.Штука);
	НазначениеШК	= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "НазначениеШК");
	КодировкаШК		= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "КодировкаШК", Перечисления.ТипыКодировокШК.EAN13);
	ДанныеПоШК	 	= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ДанныеПоШК");
	Накладная		= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Накладная");
	ТекстОшибки		= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ТекстОшибки");
	Знак			= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Знак", 1);	
	
	Если НазначениеШК = Неопределено Тогда
		НазначениеШК = Маркировка_ПИ.ПолучитьНазначениеПоШК(ШтрихКод);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Накладная) Тогда
		Накладная = НакладнаяПоДокументуСканирования(ДокументСканирования);	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НазначениеШК) Тогда
		НазначениеШК = ОпределитьНазначениеШКпоДанным(ДанныеПоШК);
	КонецЕсли;
	Если СтрДлина(ШтрихКод) >= 60 Тогда
		КодировкаШК = Перечисления.ТипыКодировокШК.DataMatrix;	
	КонецЕсли;
	
	РабочееМесто = ПараметрыСеанса.РабочееМестоКлиента;
	
	Запись = РегистрыСведений.РеестрСканирования.СоздатьМенеджерЗаписи();
	
	Запись.ИД_Записи 	= Новый УникальныйИдентификатор;
	
	Запись.Автор 		= ПараметрыСеанса.Пользователь;

	// Кельманов А.В. - Оптимизация работы - 2026.06.03 {
	//Запись.ФизЛицо = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ФизЛицо");
	ФизЛицо = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ФизЛицо");
	
	Если Не ЗначениеЗаполнено(ФизЛицо) И ЗначениеЗаполнено(Запись.Автор.ФизЛицо) Тогда
		
		ФизЛицо = Запись.Автор.ФизЛицо;
		
	КонецЕсли;
	
	Запись.ФизЛицо = ФизЛицо;
	// Кельманов А.В. - Оптимизация работы - 2026.06.03 }

	Запись.РабочееМесто = ПараметрыСеанса.РабочееМестоКлиента;
	Запись.Знак			= Знак;
	Запись.СостояниеСканера = ПараметрыСеанса.СостояниеСканераДляПланаНабора;
	Запись.ДокументСканирования = ДокументСканирования;
	Запись.Накладная	= Накладная;
	Запись.Дата			= ТекущаяДата();
	Запись.КодировкаШК	= КодировкаШК;
	Запись.ТипШК		= ТипШК;	
	Запись.НазначениеШК	= НазначениеШК;
	Запись.ДанныеПоШК	= ДанныеПоШК;
	Запись.ШтрихКод		= ШтрихКод;	
	Запись.ТекстОшибки	= ТекстОшибки; 
	
	//Тимофеев Ю.А. 15.04.2026 Задания в РС "реестр сканирования" без ТСД SNL-194   
	ЧтоЗаДокумент = ТипЗнч(ДокументСканирования); 	
	Если ЧтоЗаДокумент=Тип("ДокументСсылка.ЛистНабора") Тогда
		Запись.ДокументЗадание = ДокументСканирования.ЗаданиеНабора;
	ИначеЕсли  ЧтоЗаДокумент=Тип("ДокументСсылка.ЛистПереукладки") Тогда
		Запись.ДокументЗадание = ДокументСканирования.ЗаданиеНаАгрегацию;
	ИначеЕсли  ЧтоЗаДокумент=Тип("ДокументСсылка.ЛистСборкиКомплектовЧЗ") Тогда
		Запись.ДокументЗадание = ДокументСканирования.ДокОснование;
	КонецЕсли;	     
	//Тимофеев Ю.А. 15.04.2026 Задания в РС "реестр сканирования" без ТСД SNL-194
	
	Запись.Записать(Ложь);
КонецФункции //ЗаписатьФактСканирования(ШтрихКод, ДокументСканирования, ДопПараметры = Неопределено) Экспорт

Функция ЗаписатьФактыСканированияПачкой(тШтрихКоды, ДокументСканирования, ДопПараметры = Неопределено) Экспорт
	Накладная		= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Накладная");	
	ФизЛицо			= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ФизЛицо");
	РабочееМесто	= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "РабочееМесто", 		ПараметрыСеанса.РабочееМестоКлиента);
	СостояниеСканера= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "СостояниеСканера",	ПараметрыСеанса.СостояниеСканераДляПланаНабора);
		
	Если НЕ ЗначениеЗаполнено(Накладная) Тогда
		Накладная = НакладнаяПоДокументуСканирования(ДокументСканирования);	
	КонецЕсли;
	
	НЗ = РегистрыСведений.РеестрСканирования.СоздатьНаборЗаписей();
	НЗ.РасширенныеРежимыЗамещения = Истина;	
	
	Для каждого СтрокаШК Из тШтрихКоды Цикл
		Запись = НЗ.Добавить();
		
		ЗаполнитьЗначенияСвойств(Запись, СтрокаШК);		
		
		Запись.ИД_Записи 	= Новый УникальныйИдентификатор;
		
		Запись.Автор 				= ПараметрыСеанса.Пользователь;
		Запись.ДокументСканирования = ДокументСканирования;
		Запись.Накладная			= Накладная;   
		
		Если НЕ ЗначениеЗаполнено(Запись.НазначениеШК) Тогда
			Запись.НазначениеШК = Маркировка_ПИ.ПолучитьНазначениеПоШК(Запись.ШтрихКод);
		КонецЕсли;		
		
		Если НЕ ЗначениеЗаполнено(Запись.НазначениеШК) Тогда
			Запись.НазначениеШК = ОпределитьНазначениеШКпоДанным(Запись.ДанныеПоШК);
		КонецЕсли;		
		
		Если НЕ ЗначениеЗаполнено(Запись.КодировкаШК) Тогда
			Если СтрДлина(Запись.ШтрихКод) >= 60 Тогда
				Запись.КодировкаШК = Перечисления.ТипыКодировокШК.DataMatrix;	
				Запись.ШтрихКод = Лев(Запись.ШтрихКод, 31)
			КонецЕсли;		
		КонецЕсли;		
		
		Если НЕ ЗначениеЗаполнено(Запись.ФизЛицо) Тогда
			Запись.ФизЛицо	= ФизЛицо;		
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Запись.РабочееМесто) Тогда
			Запись.РабочееМесто = РабочееМесто;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Запись.СостояниеСканера) Тогда		
			Запись.СостояниеСканера = СостояниеСканера;
		КонецЕсли;		
	КонецЦикла;
	
	НЗ.Записать(РежимЗамещения.Добавление);
КонецФункции //ЗаписатьФактыСканированияПачкой(тШтрихКоды, ДокументСканирования, ДопПараметры = Неопределено) Экспорт

Функция ОпределитьНазначениеШКпоДанным(Данные)
	Результат = Неопределено;                              
	ТипДанных = ТипЗнч(Данные);
	
	Если ТипДанных = Тип("СправочникСсылка.Номенклатура") Тогда
		Результат = Справочники.НазначенияШК.Товар;
	ИначеЕсли ТипДанных = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Результат = Справочники.НазначенияШК.ФизЛицо;
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипДанных) Тогда
		Результат = Справочники.НазначенияШК.Документ;
	КонецЕсли;                                       
	
	Возврат Результат;
КонецФункции // ()

Функция НакладнаяПоДокументуСканирования(ДокументСканирования) Экспорт
	Результат 	= Неопределено;
	ТипДока		= ТипЗнч(ДокументСканирования);
	
	Если ТипДока = Тип("ДокументСсылка.ЗаданиеНабора") Тогда
		Результат = ПолучитьРеквизитШапки(ДокументСканирования, "Накладная");
	ИначеЕсли ТипДока = Тип("ДокументСсылка.ЗаданиеНаМаркировку") Тогда
		Результат = ПолучитьРеквизитШапки(ДокументСканирования, "ДокОснование");
	ИначеЕсли ТипДока = Тип("ДокументСсылка.ЛистНабора") Тогда
		Результат = ПолучитьРеквизитШапки(ДокументСканирования, "ДокОснование");		
	ИначеЕсли ТипДока = Тип("ДокументСсылка.ЛистПереукладки") Тогда
		Результат = ПолучитьРеквизитШапки(ДокументСканирования, "ДокОснование");			
	ИначеЕсли ТипДока = Тип("ДокументСсылка.ЛистСборкиКомплектовЧЗ") Тогда
		Результат = ПолучитьРеквизитШапки(ДокументСканирования, "ДокОснование.ДокОснование");	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //НакладнаяПоДокументуСканирования(ДокументСканирования)

Функция ЗафиксироватьОтвалЧЗ() Экспорт	
	Константы.ДатаОтвалаЧЗ.Установить(ТекущаяДата());
	ОбновитьПовторноИспользуемыеЗначения();	
	
	ЗаписатьВЛог("Работоспособность ЧЗ", "Не работает ЧЗ", "Ошибка");
КонецФункции //ЗафиксироватьРаботоспособностьЧЗ() Экспорт

Функция ВремяНеработоспособностиЧЗ() Экспорт
	Результат = 0;
	
	Если НЕ Маркировка_ПИ.ЧЗ_Живой() Тогда
		Результат = ТекущаяДата() - Маркировка_ПИ.ДатаОтвалаЧЗ();			
	КонецЕсли;	                                                 
	
	Возврат Результат;
КонецФункции //ВремяНеработоспособностиЧЗ()

Функция ПроверитьКМпоДокументу(ДокСсылка, ДопПараметры = Неопределено) Экспорт	
	Результат = МаркировкаКС.СтруктураРезультата();
	Результат.Вставить("ОшибкаЧЗ", Ложь);	
	
	ОтложеннаяПроверка	= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ОтложеннаяПроверка", Ложь);
	ВызовИзЗадачи		= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ВызовИзЗадачи", Ложь);
	СоздаватьЗадачу		= ОтложеннаяПроверка;
	ОшибкаВыполнения	= Ложь;
	
	СостояниеЧЗДопускаетВыполнениеПроверки = Истина;	
	Если МаркировкаС.ВремяНеработоспособностиЧЗ() < 60 Тогда 
		//Может был разовый сбой и надо попробовать еще разок
	ИначеЕсли МаркировкаС.ВремяНеработоспособностиЧЗ() > Маркировка_ПИ.ИнтервалПовторногоЗапросаЧЗ() Тогда
		МаркировкаС.ЗафиксироватьОтвалЧЗ();	//Перенос еще на полчаса
	Иначе
		СостояниеЧЗДопускаетВыполнениеПроверки = Ложь;
	КонецЕсли;
	
	//+++ Чирков 15.05.2026 - перенос блока - для проверок при отвале ЧЗ
	ПорцииКМ = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ПорцииКМ");
	Если ПорцииКМ = Неопределено Тогда
		ПорцииКМ = ПолучитьПорцииКМДляПроверки(ДокСсылка);
	КонецЕсли;
	//--- Чирков 15.05.2026
	
	ЕстьКМДляПроверки = ЕстьКМДляПроверки(ПорцииКМ);	
	
	Если ЕстьКМДляПроверки Тогда	
		ОшибкаЧЗ = Ложь;	
		Если ОтложеннаяПроверка = Ложь Тогда		
			Если СостояниеЧЗДопускаетВыполнениеПроверки Тогда		
				пОбработки = Новый Структура("Основание,ПорцииКМ", ДокСсылка, ПорцииКМ);
				пОбработки.Вставить("ОтпечатокСертификатаЭЦП", ОбменСЧЗЧерезОУКЭПСервер.ПолучитьСертификатЭЦП_ОУКЭП());
				
				Обработка = Обработки.АпиЧЗ.Создать();
				
				Попытка
					РегистрыСведений.СтатусыПроверкиКМвЧЗ.УстановитьРезультатПроверкиДокументаПоЧЗ(ДокСсылка, Перечисления.СтатусПроверкиКМвЧЗ.Проверяется);
					
					Результат = Обработка.ПроверитьКМвЧЗ(пОбработки);
					
					Если Результат.Успешно Тогда
						рРазбора = Обработка.ПолучитьРезультатыПроверкиКМпоДокументу(ДокСсылка, Результат.Данные, ДопПараметры);			
						Если ТипЗнч(рРазбора.Данные) = Тип("ТаблицаЗначений") И рРазбора.Данные.Количество() > 0 Тогда
							Результат.Успешно	= Ложь;
							Результат.Данные	= рРазбора.Данные;			
							
							РегистрыСведений.ОшибкиПроверкиКМвЧЗ.ЗаписатьОшибкиКМ(ДокСсылка, рРазбора.Данные);
							
							ТекстОшибки = СтрШаблон("Обнаружено %1 ошибок в КМ !", рРазбора.Данные.Количество());					
							РегистрыСведений.СтатусыПроверкиКМвЧЗ.УстановитьРезультатПроверкиДокументаПоЧЗ(ДокСсылка, Перечисления.СтатусПроверкиКМвЧЗ.Ошибка, Новый Структура("ДопИнфо", ТекстОшибки));
						Иначе
							РегистрыСведений.ОшибкиПроверкиКМвЧЗ.ОчиститьОшибкиКМ(ДокСсылка);
							РегистрыСведений.СтатусыПроверкиКМвЧЗ.УстановитьРезультатПроверкиДокументаПоЧЗ(ДокСсылка, Перечисления.СтатусПроверкиКМвЧЗ.Успешно);
						КонецЕсли;
					Иначе                                                                                                                            
						ТекстОшибки = СтрСоединить(Результат.Ошибки, Символы.ПС);
						ЗаписатьВЛог("Проверка КМ ЧЗ", "Ошибка выполнения: 'Обработка.АпиЧЗ.ПроверитьКМвЧЗ'. Ошибка " + ТекстОшибки, "Ошибка");				
						
						РегистрыСведений.СтатусыПроверкиКМвЧЗ.УстановитьРезультатПроверкиДокументаПоЧЗ(ДокСсылка, Перечисления.СтатусПроверкиКМвЧЗ.Ошибка, Новый Структура("ДопИнфо", ТекстОшибки));
						
						СоздаватьЗадачу 	= Истина;
						ОшибкаЧЗ 			= Истина;
						ОшибкаВыполнения	= Истина;
					КонецЕсли;
					
				Исключение            
					ТекстОшибки = ОписаниеОшибки();
					Результат.Ошибки.Добавить(ТекстОшибки);
					Результат.Успешно = Ложь;
					ЗаписатьВЛог("Проверка КМ ЧЗ", "Ошибка выполнения: 'МаркировкаС.ПроверитьКМпоДокументу'. Ошибка " + ТекстОшибки, "Ошибка");
					
					СоздаватьЗадачу 	= Истина;				
					ОшибкаВыполнения	= Истина;
				КонецПопытки;		
			Иначе         
				СоздаватьЗадачу = Истина;    
				ОшибкаЧЗ 		= Истина;			
			КонецЕсли;
		КонецЕсли;
		
		Результат.Вставить("ОшибкаЧЗ", ОшибкаЧЗ);
	Иначе
		СоздаватьЗадачу = Ложь;
		
		ТекстОшибки = "Ошибка данных: 'Обработка.АпиЧЗ.ПроверитьКМвЧЗ'. Отсутствуют КМ для проверки.";
		ЗаписатьВЛог("Проверка КМ ЧЗ", ТекстОшибки + " " + ДокСсылка, "Ошибка");
						
		РегистрыСведений.СтатусыПроверкиКМвЧЗ.УстановитьРезультатПроверкиДокументаПоЧЗ(ДокСсылка, Перечисления.СтатусПроверкиКМвЧЗ.Ошибка, Новый Структура("ДопИнфо", ТекстОшибки));
	КонецЕсли;
	
	Если СоздаватьЗадачу Тогда			
		Если ВызовИзЗадачи Тогда	
			Результат.Успешно = Ложь;			
			Результат.Ошибки.Добавить("Ошибка проверки ЧЗ при вызове из задачи. ОшибкаЧЗ: " + ОшибкаЧЗ);			
		Иначе                                                                                           
			СоздатьЗадачуПроверкиКМпоДокументу(ДокСсылка, ПорцииКМ);		
		КонецЕсли;			
	Иначе
		Результат.Вставить("ОшибкаВыполнения", ОшибкаВыполнения);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПроверитьКМпоДокументу(ДокСсылка, ДопПараметры = Неопределено) Экспорт

Функция ЕстьКМДляПроверки(ПорцииКМ)
	Результат = Ложь;
	Если ТипЗнч(ПорцииКМ) = Тип("Массив") Тогда
		Для каждого ПорцияКМ Из ПорцииКМ Цикл
			Если ТипЗнч(ПорцияКМ) = Тип("Массив") И ПорцияКМ.Количество() > 0 Тогда
				Результат = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	Возврат Результат;
КонецФункции //ЕстьКМДляПроверки(ПорцииКМ)

Функция ПолучитьПорцииКМДляПроверки(ДокСсылка) Экспорт
	Результат		= Новый Массив;
	ТипДокумента	= ТипЗнч(ДокСсылка);
	
	Если ТипДокумента = Тип("ДокументСсылка.ХранилищеКодовМаркировки") Тогда		
		//Результат = Документы.ХранилищеКодовМаркировки.ПолучитьКМДляПроверки(ДокОснование);
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЛистНабора") Тогда		
		Результат = Документы.ЛистНабора.ПолучитьПорцииКМДляПроверки(ДокСсылка);
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЛистПереукладки") Тогда		
		Результат = Документы.ЛистПереукладки.ПолучитьПорцииКМДляПроверки(ДокСсылка);
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЛистСборкиКомплектовЧЗ") Тогда		
		Результат = Документы.ЛистСборкиКомплектовЧЗ.ПолучитьПорцииКМДляПроверки(ДокСсылка);
	КонецЕсли;      
	
	Возврат Результат;
КонецФункции //ПолучитьПорцииКМДляПроверки(ДокСсылка)

Функция СоздатьЗадачуПроверкиКМпоДокументу(Основание, ПорцииКодов)
	Если ЗначениеЗаполнено(Основание) Тогда	
		пОбработки = Новый Структура("ПараметрыПорций, ПараллельноеВыполнение", ПорцииКодов, Истина);
		РегистрыСведений.ЗадачиОтложеннойОбработкиДокументов.СоздатьЗадачу(Основание, 
			Перечисления.ЗадачиОтложеннойОбработкиДокументов.ПроверитьКодыВЧЗ, Новый Структура("ПараметрыОбработки", пОбработки));
	КонецЕсли;	
КонецФункции //СоздатьЗадачуПроверкиКМпоДокументу(Основание, ПорцииКодов)

Функция МассивВТаблицу(МассивЗначений, ИмяКолонки, ИмяТипа = Неопределено) Экспорт
	ТЗ = Новый ТаблицаЗначений;
	Если МассивЗначений.Количество() > 0 Тогда
		МТ = Новый Массив;
		МТ.Добавить(ТипЗнч(МассивЗначений[0]));
		ТипКолонки = Новый ОписаниеТипов(МТ);
	Иначе		
		Если ЗначениеЗаполнено(ИмяТипа) Тогда
			ТипКолонки = Новый  ОписаниеТипов(ИмяТипа);
		Иначе
			ТипКолонки = Неопределено;		
		КонецЕсли;
	КонецЕсли;
	ТЗ.Колонки.Добавить(ИмяКолонки, ТипКолонки);
	
	Для Каждого ТекЗнач Из МассивЗначений Цикл
		Если ЗначениеЗаполнено(ТекЗнач) Тогда
			СтрокаТК = ТЗ.Добавить();	
			СтрокаТК[ИмяКолонки] = ТекЗнач;		
		КонецЕсли;	
	КонецЦикла; 
	
	Возврат ТЗ;
КонецФункции //МассивВТаблицу(МассивЗначений, ИмяКолонки) Экспорт

// Кухарь А.Ю. 30.08.2024 начало
//
Функция ПолучитьНовоеМестоположениеМаркировкиПоДокументу(знач ДокументСсылка) экспорт
	СтруктураВозврата=новый Структура("НовоеМестоположение,УзелПолучателя,Успешно,Ошибки",Неопределено,Неопределено,ложь,Неопределено);
	//Узел получателя = неопределено, значит движение будет без передачи между узлами
	//СкладМестоположения = неопределено, значит такое движение нельзя делать
	
	
	МассивОшибок=новый Массив;
	НуженТранзитныйСклад=ложь;
	СкладПереопределен=ложь;
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ХранилищеКодовМаркировки") Тогда
		РеквизитыХКМ=ПолучитьРеквизитыШапки(ДокументСсылка,"ДокОснование,Операция","Документ");
		ДокументСсылка=РеквизитыХКМ.ДокОснование;
		Операция=РеквизитыХКМ.Операция;
		если Операция = Перечисления.СкладскиеОперации.Отгрузка тогда
			НуженТранзитныйСклад=Истина;
		КонецЕсли;
		если не ЗначениеЗаполнено(ДокументСсылка) тогда
			МассивОшибок.Добавить("Обнаружен ХКМ без док. основания");
		КонецЕсли;
	КонецЕсли;	
	
	если МассивОшибок.Количество()=0 тогда
		ПараметрыТекущегоУзла=новый Структура("Узел,КодУзла,ТипУзла,Подразделение,ОсновнойСклад");
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ
		|	Основной.Ссылка КАК Узел,
		|	Основной.Код КАК КодУзла,
		|	Основной.ТипУзла КАК ТипУзла,
		|	Основной.Подразделение КАК Подразделение,
		|	Основной.Подразделение.ОсновнойСклад КАК ОсновнойСклад
		|ИЗ
		|	ПланОбмена.Основной КАК Основной
		|ГДЕ
		|	Основной.Ссылка = &Узел";
		запрос.УстановитьПараметр("Узел",ПараметрыСеанса.ЭтотУзел);
		выборка=запрос.Выполнить().Выбрать();
		если выборка.Количество()=0 тогда
			возврат Неопределено;
		КонецЕсли;
		Пока выборка.Следующий() цикл
			ЗаполнитьЗначенияСвойств(ПараметрыТекущегоУзла,выборка);
		КонецЦикла;
		
		//Тут живут данные часцов
		ПараметрыТранспортногоУзла=новый Структура("Узел,КодУзла,ТипУзла,Подразделение,ОсновнойСклад");
		запрос.УстановитьПараметр("Узел",Константы.УзелТранспортногоОтдела.Получить());
		выборка=запрос.Выполнить().Выбрать();
		если выборка.Количество()=0 тогда
			возврат Неопределено;
		КонецЕсли;
		Пока выборка.Следующий() цикл
			ЗаполнитьЗначенияСвойств(ПараметрыТранспортногоУзла,выборка);
		КонецЦикла;			
		
		
		Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаказПоставщику")   
			или ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КонтрактСПроизводителем")
			или ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Машина")
			Тогда  //Пока что всегда Склад часцы
			СтруктураВозврата.УзелПолучателя = ПараметрыТранспортногоУзла.Узел;
			СтруктураВозврата.НовоеМестоположение = ПараметрыТранспортногоУзла.ОсновнойСклад;
			
			
			НуженТранзитныйСклад=Истина;

		ИначеЕсли  ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
			РеквизитыШапки=ПолучитьРеквизитыШапки(ДокументСсылка,"КодОперации,Склад","Документ");
			если РеквизитыШапки.КодОперации=Перечисления.КодыОперацийОстатки.ЗакупкаР тогда  //Пока что всегда Склад часцы
				
				СтруктураВозврата.УзелПолучателя = ПараметрыТранспортногоУзла.Узел;
				СтруктураВозврата.НовоеМестоположение = ПараметрыТранспортногоУзла.ОсновнойСклад;
			иначе
				УзелПолучателя=ПолучитьУзелПоСкладу(РеквизитыШапки.Склад);
				
				СтруктураВозврата.НовоеМестоположение=РеквизитыШапки.Склад;
				СтруктураВозврата.УзелПолучателя=УзелПолучателя;
			КонецЕсли;
		ИначеЕсли  ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Перемещение") Тогда   
			РеквизитыШапки=ПолучитьРеквизитыШапки(ДокументСсылка,"СкладПолучатель","Документ");
			УзелПолучателя=ПолучитьУзелПоСкладу(РеквизитыШапки.СкладПолучатель);
			
			СтруктураВозврата.НовоеМестоположение=РеквизитыШапки.СкладПолучатель;
			СтруктураВозврата.УзелПолучателя=УзелПолучателя;
			
		ИначеЕсли  ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
			РеквизитыШапки=ПолучитьРеквизитыШапки(ДокументСсылка,"Контрагент","Документ");
			
			СтруктураВозврата.НовоеМестоположение=РеквизитыШапки.Контрагент;
		ИначеЕсли  ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.СписаниеТМЦ") или
			ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОприходованиеТМЦ")
			тогда
			РеквизитыШапки=ПолучитьРеквизитыШапки(ДокументСсылка,"Склад","Документ");
			УзелПолучателя=ПолучитьУзелПоСкладу(РеквизитыШапки.Склад);
			
			СтруктураВозврата.НовоеМестоположение=РеквизитыШапки.Склад;
			СтруктураВозврата.УзелПолучателя=УзелПолучателя;		
		ИначеЕсли   ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОтчетКассовойСмены") тогда
			РеквизитыШапки=ПолучитьРеквизитыШапки(ДокументСсылка,"Касса.ОсновнойПокупатель","Документ");
			
			СтруктураВозврата.НовоеМестоположение=РеквизитыШапки.Касса_ОсновнойПокупатель;
		ИначеЕсли   ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ") тогда
			РеквизитыШапки=ПолучитьРеквизитыШапки(ДокументСсылка,"ДокументОснование","Документ");
			ДокОснование=РеквизитыШапки.ДокументОснование;
			если ТипЗнч(ДокОснование)  = Тип("ДокументСсылка.ЗаказПоставщику") тогда
				РеквизитыШапкиДокОснования=ПолучитьРеквизитыШапки(ДокОснование,"Контрагент","Документ");
				СтруктураВозврата.НовоеМестоположение=РеквизитыШапкиДокОснования.Контрагент;
			КонецЕсли;
		ИначеЕсли   ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.МаркировкаТоваровИСМП") тогда
			РеквизитыШапки=ПолучитьРеквизитыШапки(ДокументСсылка,"ПодразделениеНанесения","Документ");
			СтруктураВозврата.НовоеМестоположение=РеквизитыШапки.ПодразделениеНанесения;			
		КонецЕсли;	
		
		если ТипЗнч(СтруктураВозврата.НовоеМестоположение)=Тип("СправочникСсылка.Склады") тогда
			РеквизитыСклада=ПолучитьРеквизитыШапки(СтруктураВозврата.НовоеМестоположение,"СкладБухгалтерии,КарантинЧЗ,СкладОтгрузкиТранзитом","Справочник");	
			если РеквизитыСклада.КарантинЧЗ <> Истина тогда //Карантин всегда оставляем как есть
				если ЗначениеЗаполнено(СтруктураВозврата.УзелПолучателя)тогда  //Сначала берём основной склад из узла, если там не пусто
					СкладПереопределяемый=ПолучитьСкладПоУзлу(СтруктураВозврата.УзелПолучателя);
					если ЗначениеЗаполнено(СкладПереопределяемый) и не СкладПереопределен тогда
						СкладПереопределен=Истина;
						СтруктураВозврата.НовоеМестоположение=СкладПереопределяемый;
					КонецЕсли;
					
					если ЗначениеЗаполнено(РеквизитыСклада.СкладБухгалтерии) и не СкладПереопределен тогда //Если не нашли, то пытаемся взять из реквизита склада
						СтруктураВозврата.НовоеМестоположение= РеквизитыСклада.СкладБухгалтерии;
					КонецЕсли;
				КонецЕсли;
				
				если НуженТранзитныйСклад и ЗначениеЗаполнено(РеквизитыСклада.СкладОтгрузкиТранзитом) тогда
					   СтруктураВозврата.НовоеМестоположение= РеквизитыСклада.СкладОтгрузкиТранзитом;
				КонецЕсли;

			КонецЕсли;
			
			
		КонецЕсли;
	КонецЕсли;	
	
	если не ЗначениеЗаполнено(СтруктураВозврата.НовоеМестоположение) тогда
		МассивОшибок.Добавить("Не удалось определить новое местоположение кода ЧЗ по документу");
	КонецЕсли;	
	если МассивОшибок.Количество()>0 Тогда
		СтруктураВозврата.Успешно=ложь;
	иначе
		СтруктураВозврата.Успешно=Истина;
	КонецЕсли;
	СтруктураВозврата.Ошибки=МассивОшибок;
	
	возврат СтруктураВозврата;	
КонецФункции

Функция ПолучитьУзелПоСкладу (Знач Склад)
	РеквизитыСклада=ПолучитьРеквизитыШапки(Склад,"КодФизическогоУзла,ТипСклада","Справочник");
	КодФизическогоУзла=РеквизитыСклада.КодФизическогоУзла;

	если не ЗначениеЗаполнено(КодФизическогоУзла) тогда 
		возврат Неопределено;
	КонецЕсли;
	
	если РеквизитыСклада.ТипСклада <> Перечисления.ТипСклада.РозничныйТЦ тогда		
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ первые 1
		|	Основной.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.Основной КАК Основной
		|ГДЕ
		|	Основной.Код = &КодФизическогоУзла
		|	И не Основной.ПометкаУдаления";
		запрос.УстановитьПараметр("КодФизическогоУзла",КодФизическогоУзла);
		выборка=запрос.Выполнить().Выбрать();
		пока выборка.следующий() цикл
			возврат выборка.ссылка;
		КонецЦикла;
	иначе
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ первые 1
		|	План.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.ФР_ОбменСФРК КАК План
		|ГДЕ
		|	План.Код = &КодФизическогоУзла
		|	И не План.ПометкаУдаления";
		запрос.УстановитьПараметр("КодФизическогоУзла","CO_FR");
		выборка=запрос.Выполнить().Выбрать();
		пока выборка.следующий() цикл
			возврат выборка.ссылка;
		КонецЦикла;
		
	КонецЕсли;
	
	
	возврат Неопределено;
КонецФункции
Функция ПолучитьСкладПоУзлу (Знач Узел)
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	Основной.Подразделение.ОсновнойСклад КАК ОсновнойСклад
	|ИЗ
	|	ПланОбмена.Основной КАК Основной
	|ГДЕ
	|	Основной.Ссылка = &Узел";
	запрос.УстановитьПараметр("Узел",Узел);
	выборка=запрос.Выполнить().Выбрать();
	пока выборка.следующий() цикл
		возврат выборка.ОсновнойСклад;
	КонецЦикла;
	
	возврат Неопределено;
КонецФункции

// Кухарь А.Ю. 30.08.2024 конец
//++Данилова Е.В. 14.02.2025 MARK-1429
Процедура ЗаписатьИсториюГТИН(Знач Номенклатура, ГТИН, Отказ) Экспорт
	//Данилова Е.В. 19.11.2025 MARK-2741
	//Если  Отказ
	//	ИЛИ НЕ ЗначениеЗаполнено(ГТИН) Тогда
	//	
	//	Возврат; 
	//	
	//	
	//КонецЕсли;
	//ДанныеГТИН = РегистрыСведений.ИсторияГТИННоменклатуры.СрезПоследних(,Новый Структура("Номенклатура",Номенклатура)); 
	//
	//Если ТипЗнч(ДанныеГТИН) <>  Тип("ТаблицаЗначений") 
	//	ИЛИ (ДанныеГТИН.Количество() > 0 
	//	И ДанныеГТИН[0].ГТИН = ГТИН) Тогда
	//	
	//	Возврат; 	
	//	
	//КонецЕсли; 
	////++Данилова Е.В. 18.11.2025  MARK-2741
	//ВидГТИН = Перечисления.ВидыГТИН.Основной;
	//Если ТипЗнч(ДанныеГТИН) =  Тип("ТаблицаЗначений") 
	//	И ДанныеГТИН.Количество() > 0 Тогда
	//	
	//	ВидГТИН = Перечисления.ВидыГТИН.Дополнительный; 	
	//	
	//КонецЕсли;
	////--Данилова Е.В. 18.11.2025
	//
	//НоваяЗапись = РегистрыСведений.ИсторияГТИННоменклатуры.СоздатьМенеджерЗаписи(); 
	//НоваяЗапись.ГТИН = ГТИН; 
	//НоваяЗапись.Номенклатура = Номенклатура; 
	//НоваяЗапись.Период = ТекущаяДатаСеанса();
	////++Данилова Е.В. 18.11.2025 MARK-2741
	//НоваяЗапись.ВидГТИН = ВидГТИН; 
	////--Данилова Е.В. 18.11.2025 
	//
	//Попытка
	//	
	//	НоваяЗапись.Записать(); 
	//	
	//Исключение
	//	Отказ = истина; 
	//КонецПопытки;

КонецПроцедуры

//--Данилова Е.В. 14.02.2025 MARK-1429
//++Данилова Е.В. 14.02.2025
//для Детского мира 
Функция ЗаписатьНовыйАгрегационныйКодКонтрагентаДМ(Знач ШКЧЗ, Знач Контрагент, Знач ТипШтрихКода, Знач ШКЧЗУпаковки)  Экспорт
	
	Если ТипШтрихКода = Перечисления.ТипыШтрихКодов.Блочок  Тогда
		
		//Наименование = 04 + ШКЧЗ.Наименование + 
		
		ЕАНБлочка =  ПолучитьЕАНБлочкаПоНоменклатуре(ШКЧЗ.Владелец,Контрагент);
		 
		Если ЕАНБлочка = неопределено Тогда
			
			Сообщить("Ошибка записи нового агрегационного кода",СтатусСообщения.Внимание); 
			
			Возврат  неопределено; 
			
		КонецЕсли;
		
		ПорядковыйНомер = ПолучитьПорядковыйНомерПоПрефиксу("02" + "0" + ЕАНБлочка + "21");
		ПорядковыйНомерСтрока = Формат(ПорядковыйНомер,"ЧЦ=6; ЧВН=; ЧГ=0"); 
		
		НаименованиеАгрегКода = "02" + "0" + ЕАНБлочка + "21" + ПорядковыйНомерСтрока; 
		НаименованиеАгрегКодаСоСкобками = "(02)" + "0" + ЕАНБлочка + "(21)" + ПорядковыйНомерСтрока;
		
		НовыйЭлемент = Справочники.АгрегационныеКодыКонтрагентов.СоздатьЭлемент(); 
		НовыйЭлемент.Наименование = НаименованиеАгрегКода; 
		НовыйЭлемент.ТипШК 		= ТипШтрихКода; 
		НовыйЭлемент.Контрагент = Контрагент; 
		НовыйЭлемент.ШКЧЗ 		= ШКЧЗУпаковки; 
		НовыйЭлемент.НаименованиеСоСкобками = НаименованиеАгрегКодаСоСкобками;
		//++Данилова Е.В. 23.04.2025 пока без задачи
		НовыйЭлемент.УстановитьНовыйКод();
		//--Данилова Е.В. 23.04.2025
		//++Данилова Е.В. 26.05.2025  ASU-2264
		НовыйЭлемент.Номенклатура = ШКЧЗ.Владелец; 
		//--Данилова Е.В. 26.05.2025 
		Попытка
			
			НовыйЭлемент.Записать();
			
			Возврат НовыйЭлемент.ссылка; 
			
		Исключение
			Возврат Неопределено; 
		КонецПопытки;
		
	ИначеЕсли ТипШтрихКода = Перечисления.ТипыШтрихКодов.Коробка  Тогда
		
		ЕАНКоробки =  ПолучитьЕАНКоробкиПоНоменклатуре(ШКЧЗ.Владелец,Контрагент);
		
		Если ЕАНКоробки = неопределено Тогда
			
			Сообщить("Ошибка записи нового агрегационного кода",СтатусСообщения.Внимание); 
			
			Возврат  неопределено; 
			
		КонецЕсли;
		
		ПорядковыйНомер = ПолучитьПорядковыйНомерПоПрефиксу("03" + "0" + ЕАНКоробки + "21");
		ПорядковыйНомерСтрока = Формат(ПорядковыйНомер,"ЧЦ=6; ЧВН=; ЧГ=0"); 
		
		НаименованиеАгрегКода = "03" + "0" + ЕАНКоробки + "21" + ПорядковыйНомерСтрока; 
		НаименованиеАгрегКодаСоСкобками = "(03)" + "0" + ЕАНКоробки + "(21)" + ПорядковыйНомерСтрока;
		
		НовыйЭлемент = Справочники.АгрегационныеКодыКонтрагентов.СоздатьЭлемент(); 
		НовыйЭлемент.Наименование = НаименованиеАгрегКода; 
		НовыйЭлемент.ТипШК 		= ТипШтрихКода; 
		НовыйЭлемент.Контрагент = Контрагент; 
		НовыйЭлемент.ШКЧЗ 		= ШКЧЗУпаковки; 
		НовыйЭлемент.НаименованиеСоСкобками = НаименованиеАгрегКодаСоСкобками;
		//++Данилова Е.В. 23.04.2025 пока без задачи
		НовыйЭлемент.УстановитьНовыйКод();
		//--Данилова Е.В. 23.04.2025
		//++Данилова Е.В. 26.05.2025  ASU-2264
		НовыйЭлемент.Номенклатура = ШКЧЗ.Владелец; 
		//--Данилова Е.В. 26.05.2025 
		Попытка
			
			НовыйЭлемент.Записать();
			
			Возврат НовыйЭлемент.ссылка; 
			
		Исключение
			Возврат Неопределено; 
		КонецПопытки;

		
	КонецЕсли;
	
КонецФункции // ЗаписатьНовыйАгрегационныйКодКонтрагента()

Функция ПолучитьЕАНБлочкаПоНоменклатуре(Номенклатура,Контрагент) экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура КАК Номенклатура,
		|	МатрицаТовары.ШККонтрагентаБлочок КАК ШККонтрагентаБлочок
		|ИЗ
		|	Документ.Матрица КАК МатрицаДок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матрица.Товары КАК МатрицаТовары
		|		ПО МатрицаДок.Ссылка = МатрицаТовары.Ссылка
		|ГДЕ
		|	МатрицаДок.Контрагент = &Контрагент
		|	И МатрицаТовары.ШККонтрагента <> """"
		|	И МатрицаДок.Проведен
		|	И (МатрицаДок.ДатаОкончания > &ТекущаяДата
		|			ИЛИ МатрицаДок.ДатаОкончания < ДАТАВРЕМЯ(2000, 1, 1))
		|	И МатрицаТовары.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Сообщить("По номенклатуре " + Строка(Номенклатура) + " не найдена действующая матрица"); 
		
		Возврат неопределено; 
		
	Иначе 
		
		Выборка = РезультатЗапроса.Выбрать(); 
		Выборка.Следующий() ; 
		
		Возврат Выборка.ШККонтрагентаБлочок;  
		
	КонецЕсли;
	
	  
КонецФункции // ПолучитьЕАНПоНоменклатуре()

Функция ПолучитьЕАНШтукиПоНоменклатуре(Номенклатура,Контрагент) экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура КАК Номенклатура,
		|	МатрицаТовары.ШККонтрагента КАК ШККонтрагента
		|ИЗ
		|	Документ.Матрица КАК МатрицаДок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матрица.Товары КАК МатрицаТовары
		|		ПО МатрицаДок.Ссылка = МатрицаТовары.Ссылка
		|ГДЕ
		|	МатрицаДок.Контрагент = &Контрагент
		|	И МатрицаТовары.ШККонтрагента <> """"
		|	И МатрицаДок.Проведен
		|	И (МатрицаДок.ДатаОкончания > &ТекущаяДата
		|			ИЛИ МатрицаДок.ДатаОкончания < ДАТАВРЕМЯ(2000, 1, 1))
		|	И МатрицаТовары.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Сообщить("По номенклатуре " + Строка(Номенклатура) + " не найдена действующая матрица"); 
		
		Возврат неопределено; 
		
	Иначе 
		
		Выборка = РезультатЗапроса.Выбрать(); 
		Выборка.Следующий() ; 
		
		Возврат Выборка.ШККонтрагента;  
		
	КонецЕсли;
	
	  
КонецФункции // ПолучитьЕАНПоНоменклатуре()

Функция ПроверитьЕАНБлочкаПоМассивуТоваровИзБлочка(МассивТоваров,Контрагент) экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МатрицаТовары.ШККонтрагентаБлочок КАК ШККонтрагентаБлочок
		|ИЗ
		|	Документ.Матрица КАК МатрицаДок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матрица.Товары КАК МатрицаТовары
		|		ПО МатрицаДок.Ссылка = МатрицаТовары.Ссылка
		|ГДЕ
		|	МатрицаДок.Контрагент = &Контрагент
		|	И МатрицаТовары.ШККонтрагента <> """"
		|	И МатрицаДок.Проведен
		|	И (МатрицаДок.ДатаОкончания > &ТекущаяДата
		|			ИЛИ МатрицаДок.ДатаОкончания < ДАТАВРЕМЯ(2000, 1, 1))
		|	И МатрицаТовары.Номенклатура В(&МассивТоваров)";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("МассивТоваров", МассивТоваров);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Сообщить("По контрагенту при проверке товаров " + Строка(Контрагент) + " не найдена действующая матрица"); 
		
		Возврат неопределено; 
		
	Иначе 
		
		МассивШК = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ШККонтрагентаБлочок");  		 
		
		Возврат МассивШК.Количество() = 1;  
		
	КонецЕсли;
	
	  
КонецФункции // ПолучитьЕАНПоНоменклатуре()

Функция ПолучитьЕАНКоробкиПоНоменклатуре(Номенклатура,Контрагент)  Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура КАК Номенклатура,
		|	МатрицаТовары.ШККонтрагентаКоробка КАК ШККонтрагентаКоробка
		|ИЗ
		|	Документ.Матрица КАК МатрицаДок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матрица.Товары КАК МатрицаТовары
		|		ПО МатрицаДок.Ссылка = МатрицаТовары.Ссылка
		|ГДЕ
		|	МатрицаДок.Контрагент = &Контрагент
		|	И МатрицаТовары.ШККонтрагента <> """"
		|	И МатрицаДок.Проведен
		|	И (МатрицаДок.ДатаОкончания > &ТекущаяДата
		|			ИЛИ МатрицаДок.ДатаОкончания < ДАТАВРЕМЯ(2000, 1, 1))
		|	И МатрицаТовары.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Сообщить("По номенклатуре " + Строка(Номенклатура) + " не найдена действующая матрица"); 
		
		Возврат неопределено; 
		
	Иначе 
		
		Выборка = РезультатЗапроса.Выбрать(); 
		Выборка.Следующий() ; 
		
		Возврат Выборка.ШККонтрагентаКоробка;  
		
	КонецЕсли;
	
	  
КонецФункции // ПолучитьЕАНПоНоменклатуре()

Функция ПроверитьЕАНКоробкиПоМассивуТоваровИзБлочка(МассивТоваров,Контрагент) экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МатрицаТовары.ШККонтрагентаКоробка КАК ШККонтрагентаКоробка
		|ИЗ
		|	Документ.Матрица КАК МатрицаДок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матрица.Товары КАК МатрицаТовары
		|		ПО МатрицаДок.Ссылка = МатрицаТовары.Ссылка
		|ГДЕ
		|	МатрицаДок.Контрагент = &Контрагент
		|	И МатрицаТовары.ШККонтрагента <> """"
		|	И МатрицаДок.Проведен
		|	И (МатрицаДок.ДатаОкончания > &ТекущаяДата
		|			ИЛИ МатрицаДок.ДатаОкончания < ДАТАВРЕМЯ(2000, 1, 1))
		|	И МатрицаТовары.Номенклатура В(&МассивТоваров)";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("МассивТоваров", МассивТоваров);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Сообщить("По контрагенту при проверке товаров " + Строка(Контрагент) + " не найдена действующая матрица"); 
		
		Возврат неопределено; 
		
	Иначе 
		
		МассивШК = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ШККонтрагентаКоробка");  		 
		
		Возврат МассивШК.Количество() = 1;  
		
	КонецЕсли;
	
	  
КонецФункции // ПолучитьЕАНПоНоменклатуре()

Функция ПолучитьДанныеПоНоменклатуреИзМатрицы(Номенклатура,Контрагент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура КАК Номенклатура,
		|	МатрицаТовары.АртикулКонтрагента КАК АртикулКонтрагента,
		|	МатрицаТовары.ТипТовараДляКонтрагента КАК ТипТовараДляКонтрагента,
		//Данилова Е.В. 26.02.2025 Изменения по задаче HELP-3038
		|	МатрицаТовары.КодПроизводителяКонтрагента КАК КодПроизводителяКонтрагента
		|ИЗ
		|	Документ.Матрица КАК МатрицаДок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матрица.Товары КАК МатрицаТовары
		|		ПО МатрицаДок.Ссылка = МатрицаТовары.Ссылка
		|ГДЕ
		|	МатрицаДок.Контрагент = &Контрагент
		|	И МатрицаТовары.ШККонтрагента <> """"
		|	И МатрицаДок.Проведен
		|	И (МатрицаДок.ДатаОкончания > &ТекущаяДата
		|			ИЛИ МатрицаДок.ДатаОкончания < ДАТАВРЕМЯ(2000, 1, 1))
		|	И МатрицаТовары.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Сообщить("По номенклатуре " + Строка(Номенклатура) + " не найдена действующая матрица"); 
		
		Возврат неопределено; 
		
	Иначе 
		
		Выборка = РезультатЗапроса.Выбрать(); 
		Выборка.Следующий() ; 
		//Данилова Е.В. 26.02.2025 Изменения по задаче HELP-3038
		Возврат Новый Структура("АртикулКонтрагента,ТипТовараДляКонтрагента,КодПроизводителяКонтрагента",Выборка.АртикулКонтрагента,Выборка.ТипТовараДляКонтрагента,выборка.КодПроизводителяКонтрагента); ;  
		
	КонецЕсли;
	
	  
КонецФункции //

Функция ПолучитьПорядковыйНомерПоПрефиксу(Префикс)

	Запрос = Новый Запрос;
	//++Данилова Е.В. 23.04.2025 без задачи
	//Запрос.Текст = "ВЫБРАТЬ
	//// Кельманов А.В. - Исправление ошибки - 2025.04.17 {
	////|	АгрегационныеКодыКонтрагентов.Наименование КАК Наименование
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АгрегационныеКодыКонтрагентов.Наименование) КАК Количество
	//// Кельманов А.В. - Исправление ошибки - 2025.04.17 }
	//|ИЗ
	//|	Справочник.АгрегационныеКодыКонтрагентов КАК АгрегационныеКодыКонтрагентов
	//|ГДЕ
	//|	НЕ АгрегационныеКодыКонтрагентов.ПометкаУдаления
	//|	И АгрегационныеКодыКонтрагентов.Наименование ПОДОБНО &Наименование"; 
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	АгрегационныеКодыКонтрагентов.Наименование КАК Наименование
	|ИЗ
	|	Справочник.АгрегационныеКодыКонтрагентов КАК АгрегационныеКодыКонтрагентов
	|ГДЕ
	|	НЕ АгрегационныеКодыКонтрагентов.ПометкаУдаления
	|	И АгрегационныеКодыКонтрагентов.Наименование ПОДОБНО &Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	АгрегационныеКодыКонтрагентов.Наименование УБЫВ";

	//--Данилова Е.В. 23.04.2025
	
	Запрос.УстановитьПараметр("Наименование", Префикс + "%");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат 1; 	
		
	Иначе 
		
		Выборка = РезультатЗапроса.Выбрать(); 
		Выборка.Следующий(); 
		//Данилова Е.В. 23.04.2025 вернула обратно 
		// Кельманов А.В. - Исправление ошибки - 2025.04.17 {
		ПорядковыйНомер = Прав(Выборка.Наименование,СтрДлина(Выборка.Наименование) - СтрДлина(Префикс)); 
		
		Попытка
			
			 Возврат Число(ПорядковыйНомер) + 1; 
			
		Исключение
			
			Возврат 1; 
			
		КонецПопытки;
		
		//Данилова Е.В. 23.04.2025 вернула обратно
		
		//ПорядковыйНомер = Выборка.Количество + 1;
		
		//Возврат ПорядковыйНомер;
		// Кельманов А.В. - Исправление ошибки - 2025.04.17 }
		
	КонецЕсли;

КонецФункции // ПолучитьПорядковыйНомерПоПрефиксу()

Процедура ПровестиНаСервере(ДокСсылка, Отказ, РежимПроведения) Экспорт
	
	ДокСсылка.ПолучитьОбъект().ОбработкаПроведения(Отказ, РежимПроведения, Истина);	
	
КонецПроцедуры

Функция ПолучитьДанныеКоробок(ДокСсылка, ИмяТЧ, КолонкаКоробки = "ШтрихкодКоробки") Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	" + КолонкаКоробки + "						КАК ШтрихкодКоробки,
	|	" + КолонкаКоробки + ".ТипУпаковки			КАК ТипУпаковки,
	|	" + КолонкаКоробки + ".ТипШК				КАК ТипШК,
	|	" + КолонкаКоробки + ".СпособВводаВОборот	КАК СпособВводаВОборот,
	|	" + КолонкаКоробки + ".ТипКода				КАК ТипКода
	|	" + ?(ИмяТЧ = "ШтрихкодыКоробок", ",ДатаДобавления", "") + "
	|ИЗ
	|	" + ДокСсылка.Метаданные().ПолноеИмя() + "." + ИмяТЧ + "
	|ГДЕ
	|	Ссылка = &Ссылка
	|	И НЕ " + КолонкаКоробки + " = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции //ПолучитьДанныеКоробок(ИмяТЧ)

Функция ЗаписатьДвиженияВРегистр_СтатусыКМ_Факт_А(ДокОбъект, ИмяФункции) Экспорт
	Замер = ОценкаПроизводительностиКлиентСервер.НачатьЗамерФункции(ИмяФункции);
	
	//РегистрыСведений.СтатусыКМ_Факт_А.ЗаблокироватьТаблицу(ДокОбъект.Движения.СтатусыКМ_Факт_А);
	
	ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерФункции(Замер, ДокОбъект.Движения.СтатусыКМ_Факт_А.Количество());	
	
	Если ДокОбъект.ОбменДанными.Загрузка Тогда		
		ДокОбъект.Движения.СтатусыКМ_Факт_А.Записать();
	КонецЕсли; 
КонецФункции

//--Данилова Е.В. 14.02.2025  

//++Данилова Е.В. 19.06.2025 HELP-5109
Функция КоличествоШКПоЗаранееСформированнымАгрегациям(Знач ДокументОснование) Экспорт
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ВложенныйЗапрос.КоличествоПоКоробкам) + СУММА(ВложенныйЗапрос.КоличествоПоБлочкам) КАК Количество
		|ИЗ
		|	(ВЫБРАТЬ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод) КАК КоличествоПоКоробкам,
		|		0 КАК КоличествоПоБлочкам
		|	ИЗ
		|		Документ.ЛистНабора КАК ЛистНабора
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		|			ПО ЛистНабора.Ссылка = ЛистНабораШтрихкодыУпаковок.Ссылка
		|				И (ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ЛистНабораШтрихкодыКоробокДляАгрегации
		|			ПО ЛистНабора.Ссылка = ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка
		|				И (ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ЛистНабораШтрихкодыКоробокДляАгрегации.НовыйКодКоробки)
		|				И (ЛистНабораШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки = ЛистНабораШтрихкодыКоробокДляАгрегации.НовыйКодКоробки)
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|			ПО (ЛистНабораШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка)
		|				И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|	ГДЕ
		|		ЛистНабора.Проведен
		|		И ЛистНабора.ДокОснование = &ДокОснование
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		0,
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод)
		|	ИЗ
		|		Документ.ЛистНабора КАК ЛистНабора
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		|			ПО ЛистНабора.Ссылка = ЛистНабораШтрихкодыУпаковок.Ссылка
		|				И (ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок))
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|			ПО (ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка)
		|				И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|	ГДЕ
		|		ЛистНабора.Проведен
		|		И ЛистНабора.ДокОснование = &ДокОснование) КАК ВложенныйЗапрос";
	
	Запрос.УстановитьПараметр("ДокОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	КоличествоВложенных = 0; 	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КоличествоВложенных = ВыборкаДетальныеЗаписи.Количество; 
	КонецЦикла;
	
	Возврат КоличествоВложенных; 

 
 КонецФункции // КоличествоШКПоЗаранееСформированнымАгрегациям()    

//--Данилова Е.В. 19.06.2025  

//++Данилова Е.В. 24.11.2025  ASU-2151 
Функция КонтрольЧЗПоРНКОжиданиеПаллетирования(Знач РНК) Экспорт
		
	Результат = МаркировкаКС.СтруктураРезультата(истина);
	 
	ИспользоватьПроверку = ОбщегоНазначения_ПИ.ПрочитатьРСРеквизитСправочника_ПИ("ИспользоватьПроверкуОжиданиеПаллетирования",неопределено);
	Если ИспользоватьПроверку <> истина Тогда
	    //всегда успешно
		Возврат Результат; 	
	
	КонецЕсли;	 
	
    КонтрольЧЗПоРНКОжиданиеПаллетированияПоПравиламЧЗ(Результат, РНК);

	//3. проверяем количество штук по ЛН и по ЛП + берем количество по отсканированным коробкам и блочкам
	
	КонтрольЧЗПоРНКОжиданиеПаллетированияПроверкаКоличестваШтук(Результат, РНК);

	
	КонтрольЧЗПоРНКОжиданиеПаллетированияПоЗСБ(Результат, РНК);

	//++Данилова Е.В. 20.03.2026
	КонтрольЧЗПоРНКОжиданиеОбработкиЧЗ(РНК,Результат); 
	//--Данилова Е.В. 20.03.2026 
	Возврат Результат; 
	
КонецФункции

Процедура КонтрольЧЗПоРНКОжиданиеПаллетированияПоЗСБ(Знач Результат, Знач РНК)	
	
	//ЗСБ
	ЗСБ = НайтиДокумент("ЗаданиеНаСборкуКомплектовЧЗ",новый Структура("ДокОснование,Проведен",РНК,Истина)); 
	//++Данилова Е.В. 27.03.2026 MARK-3552 
	Если ЗначениеЗаполнено(ЗСБ)
		И ЗСБ.Товары.Количество() > 0 Тогда
		//--Данилова Е.В. 27.03.2026 
		
		Запрос 		 = Новый Запрос; 
		Запрос.УстановитьПараметр("РНК",РНК);
		Запрос.УстановитьПараметр("ЗСБ",ЗСБ);
		Запрос.Текст = "ВЫБРАТЬ
		               |	СУММА(РасходнаяНакладнаяКомплектующие.Количество) КАК Количество,
		               |	СУММА(РасходнаяНакладнаяКомплектующие.КоличествоПродукции) КАК КоличествоПродукции
		               |ПОМЕСТИТЬ ВТКомплРНК
		               |ИЗ
		               |	Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
		               |ГДЕ
		               |	РасходнаяНакладнаяКомплектующие.Ссылка = &РНК
		               |	И РасходнаяНакладнаяКомплектующие.Количество > 0
		               |	И РасходнаяНакладнаяКомплектующие.ТребуетсяМаркировка
		               |	И РасходнаяНакладнаяКомплектующие.Продукция <> РасходнаяНакладнаяКомплектующие.Номенклатура
		               |	И РасходнаяНакладнаяКомплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(перечисление.видыноменклаутры.товар)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки) КАК Количество,
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта) КАК КоличествоПродукции
		               |ПОМЕСТИТЬ ВТКомплЛСК
		               |ИЗ
		               |	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
		               |ГДЕ
		               |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.ДокОснование = &ЗСБ
		               |	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.Проведен
		               |	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Комплектующее.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(перечисление.видыноменклаутры.товар)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЕСТЬNULL(ВТКомплРНК.Количество, 0) <> ЕСТЬNULL(ВТКомплЛСК.Количество, 0) КАК РасхождениеКомпл,
		               |	ЕСТЬNULL(ВТКомплРНК.КоличествоПродукции, 0) <> ЕСТЬNULL(ВТКомплЛСК.КоличествоПродукции, 0) КАК РасхождениеПродукции,
		               |	ЕСТЬNULL(ВТКомплРНК.Количество, 0) КАК КоличествоВРНК,
		               |	ЕСТЬNULL(ВТКомплЛСК.Количество, 0) КАК КоличествовЛСК,
		               |	ЕСТЬNULL(ВТКомплРНК.КоличествоПродукции, 0) КАК КоличествоПродукцииВРНК,
		               |	ЕСТЬNULL(ВТКомплЛСК.КоличествоПродукции, 0) КАК КоличествоПродукцииВЛСК
		               |ИЗ
		               |	ВТКомплРНК КАК ВТКомплРНК
		               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТКомплЛСК КАК ВТКомплЛСК
		               |		ПО (ИСТИНА)
		               |ГДЕ
		               |	(ЕСТЬNULL(ВТКомплРНК.Количество, 0) <> ЕСТЬNULL(ВТКомплЛСК.Количество, 0)
		               |			ИЛИ ЕСТЬNULL(ВТКомплРНК.КоличествоПродукции, 0) <> ЕСТЬNULL(ВТКомплЛСК.КоличествоПродукции, 0))";
		
		РезультатЗапроса = Запрос.Выполнить(); 
		
		Если НЕ РезультатЗапроса.Пустой() Тогда 
			Выборка = РезультатЗапроса.Выбрать(); 
			Если Выборка.Следующий() Тогда 
				Если Выборка.РасхождениеКомпл = Истина Тогда
					
					Результат.Успешно = Ложь; 
					
					ТекстОшибки = "Количество комплектующих к сборке %1 в %2 не соответствуют количеству отсканированных КМ штук в ЛСК %3"; 
					ТекстОшибки = СтрШаблон(ТекстОшибки,Выборка.КоличествоВРНК,РНК,Выборка.КоличествовЛСК); 
					//ТекстОшибки = "Количество комплектующих " + Строка(Выборка.КоличествоВРНК) + " в РНК не соответствуют количеству отсканированных КМ штук в ЛСК " + Строка(Выборка.КоличествовЛСК); 
					Результат.ошибки.Добавить(ТекстОшибки);	
					
				КонецЕсли;
				
				Если Выборка.РасхождениеПродукции = Истина Тогда
					
					Результат.Успешно = Ложь;
					ТекстОшибки = "Количество продукции к сборке %1 в %2 не соответствуют количеству отсканированных КМ комплектов в ЛСК %3"; 
					ТекстОшибки = СтрШаблон(ТекстОшибки,Выборка.КоличествоПродукцииВРНК,РНК,Выборка.КоличествоПродукцииВЛСК);
					//ТекстОшибки = "Количество продукции " + Строка(Выборка.КоличествоПродукцииВРНК) + " в РНК не соответствуют количеству отсканированных КМ комплектов в ЛСК " + Строка(Выборка.КоличествоПродукцииВЛСК); 
					Результат.ошибки.Добавить(ТекстОшибки);	
					
				КонецЕсли;

			КонецЕсли;
		КонецЕсли;

		// Кухарь А.Ю.  26.11.2025 начало
		// ИначеЕсли РНК.ОтгрузкаКомплектов И РНК.ТребуетсяМаркировка  Тогда  
	ИначеЕсли РНК.ОтгрузкаКомплектов И РНК.ТребуетсяМаркировка и не ОбщегоНазначения_ПИ.ВНакладнойНетСпаек(РНК) Тогда  
		// Кухарь А.Ю.  26.11.2025 конец
		
		Результат.Успешно = Ложь;
		ТекстОшибки = "Не найден ЗСБ по отгрузке комплектов %1 ";
		ТекстОшибки = СтрШаблон(ТекстОшибки,РНК); 
		Результат.ошибки.Добавить(ТекстОшибки);
	КонецЕсли;

КонецПроцедуры

Процедура КонтрольЧЗПоРНКОжиданиеПаллетированияПроверкаКоличестваШтук(Результат, Знач РНК)
	// Кухарь А.Ю.  26.11.2025 начало
	// тогда штуки можно и не проверять, проверка нужна только по ЗСБ
	если ОбщегоНазначения_ПИ.ВНакладнойТолькоСпайки(РНК) тогда
		Возврат;
	КонецЕсли;
	// Кухарь А.Ю.  26.11.2025 конец
	
	//++Данилова Е.В. 23.03.2026 MARK-3552
	ЕстьЛП = ЕстьЛПСКодамиЧЗ(РНК);
	//КолШКЗаранееАгрегированных = МаркировкаС.КоличествоШКПоЗаранееСформированнымАгрегациям(РНК); 
	КолШКЗаранееАгрегированных = КоличествоШКПоЗаранееСформированнымАгрегациямДоГотовоКОтгрузке(РНК,ЕстьЛП); 
	//--Данилова Е.В. 23.03.2026 
	Запрос = Новый Запрос;
	//++Данилова Е.В. 01.04.2026  MARK-3552 	
	Если ЕстьЛП Тогда 
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		|ПОМЕСТИТЬ ВтЛСК
		|ИЗ
		|	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистСборкиКомплектовЧЗ КАК ЛистСборкиКомплектовЧЗ
		|		ПО ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка = ЛистСборкиКомплектовЧЗ.Ссылка
		|ГДЕ
		|	ЛистСборкиКомплектовЧЗ.ДокОснование = &ДокОснование
		|	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(ВложенныйЗапрос.КОЛИЧЕСТВО, 0)) КАК Количество
		|ИЗ
		|	(ВЫБРАТЬ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВтЛСК.ШтрихкодУпаковки) КАК КОЛИЧЕСТВО
		|	ИЗ
		|		ВтЛСК КАК ВтЛСК
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки)
		|	ИЗ
		|		Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистПереукладкиШтрихкодыУпаковок
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладки
		|			ПО ЛистПереукладкиШтрихкодыУпаковок.Ссылка = ЛистПереукладки.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВтЛСК КАК ВтЛСК
		|			ПО (ВтЛСК.ШтрихкодУпаковки = ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки)
		|	ГДЕ
		|		ЛистПереукладки.Проведен
		|		И ЛистПереукладки.ДокОснование = &ДокОснование
		|		И ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
		|		И ВтЛСК.ШтрихкодУпаковки ЕСТЬ NULL) КАК ВложенныйЗапрос";
		
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		|ПОМЕСТИТЬ ВтЛСК
		|ИЗ
		|	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистСборкиКомплектовЧЗ КАК ЛистСборкиКомплектовЧЗ
		|		ПО ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка = ЛистСборкиКомплектовЧЗ.Ссылка
		|ГДЕ
		|	ЛистСборкиКомплектовЧЗ.ДокОснование = &ДокОснование
		|	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(ВложенныйЗапрос.КОЛИЧЕСТВО, 0)) КАК Количество
		|ИЗ
		|	(ВЫБРАТЬ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВтЛСК.ШтрихкодУпаковки) КАК КОЛИЧЕСТВО
		|	ИЗ
		|		ВтЛСК КАК ВтЛСК
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки)
		|	ИЗ
		|		Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
		|			ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВтЛСК КАК ВтЛСК
		|			ПО (ВтЛСК.ШтрихкодУпаковки = ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки)
		|	ГДЕ
		|		ЛистНабора.Проведен
		|		И ЛистНабора.ДокОснование = &ДокОснование
		|		И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
		|		И ВтЛСК.ШтрихкодУпаковки ЕСТЬ NULL) КАК ВложенныйЗапрос";
		
		
	КонецЕсли;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	//|ПОМЕСТИТЬ ВтЛСК
	//|ИЗ
	//|	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистСборкиКомплектовЧЗ КАК ЛистСборкиКомплектовЧЗ
	//|		ПО ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка = ЛистСборкиКомплектовЧЗ.Ссылка
	//|ГДЕ
	//|	ЛистСборкиКомплектовЧЗ.ДокОснование = &ДокОснование
	//|	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	СУММА(ЕСТЬNULL(ВложенныйЗапрос.КОЛИЧЕСТВО, 0)) КАК Количество
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВтЛСК.ШтрихкодУпаковки) КАК КОЛИЧЕСТВО
	//|	ИЗ
	//|		ВтЛСК КАК ВтЛСК
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки)
	//|	ИЗ
	//|		Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистПереукладкиШтрихкодыУпаковок
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладки
	//|			ПО ЛистПереукладкиШтрихкодыУпаковок.Ссылка = ЛистПереукладки.Ссылка
	//|			ЛЕВОЕ СОЕДИНЕНИЕ ВтЛСК КАК ВтЛСК
	//|			ПО (ВтЛСК.ШтрихкодУпаковки = ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки)
	//|	ГДЕ
	//|		ЛистПереукладки.Проведен
	//|		И ЛистПереукладки.ДокОснование = &ДокОснование
	//|		И ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	//|		И ВтЛСК.ШтрихкодУпаковки ЕСТЬ NULL
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки)
	//|	ИЗ
	//|		Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
	//|			ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
	//|			ЛЕВОЕ СОЕДИНЕНИЕ ВтЛСК КАК ВтЛСК
	//|			ПО (ВтЛСК.ШтрихкодУпаковки = ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки)
	//|	ГДЕ
	//|		ЛистНабора.Проведен
	//|		И ЛистНабора.ДокОснование = &ДокОснование
	//|		И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	//|		И ВтЛСК.ШтрихкодУпаковки ЕСТЬ NULL) КАК ВложенныйЗапрос";  
	//--Данилова Е.В. 01.04.2026 
	//
	Запрос.УстановитьПараметр("ДокОснование", РНК);		
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	КоличествоШтук = 0; 
	Если ВыборкаДетальныеЗаписи.Следующий()  Тогда
		
		КоличествоШтук = ВыборкаДетальныеЗаписи.Количество; 	
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(Вложенныйзапрос.Количество, 0)) КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		СУММА(РасходнаяНакладнаяТовары.Количество) КАК Количество
	|	ИЗ
	|		Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|			ПО РасходнаяНакладнаяТовары.Ссылка = РасходнаяНакладная.Ссылка
	|	ГДЕ
	|		РасходнаяНакладная.Ссылка = &Ссылка
	|		И РасходнаяНакладнаяТовары.Количество > 0
	|		И РасходнаяНакладнаяТовары.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|		И НЕ РасходнаяНакладная.ОтгрузкаКомплектов
	|		И РасходнаяНакладнаяТовары.ТребуетсяМаркировка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СУММА(РасходнаяНакладнаяТовары.Количество)
	|	ИЗ
	|		Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|			ПО РасходнаяНакладнаяТовары.Ссылка = РасходнаяНакладная.Ссылка
	|	ГДЕ
	|		РасходнаяНакладная.Ссылка = &Ссылка
	|		И РасходнаяНакладнаяТовары.Количество > 0
	|		И РасходнаяНакладнаяТовары.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|		И РасходнаяНакладная.ОтгрузкаКомплектов
	|		И РасходнаяНакладнаяТовары.ТребуетсяМаркировка) КАК Вложенныйзапрос";
	
	Запрос.УстановитьПараметр("Ссылка", РНК);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	КоличествоДокумента = РНК.КоличествоДокумента; 
	ВыборкаДетальныеЗаписи.Следующий(); 
	КоличествоДокумента = ВыборкаДетальныеЗаписи.Количество;
	Если КоличествоДокумента = NULL Тогда
		
		КоличествоДокумента = 0; 	
		
	КонецЕсли;
	
	Если КоличествоДокумента > (КоличествоШтук  + КолШКЗаранееАгрегированных) Тогда //или комплектующих?? 
		
		Результат.Успешно = Ложь;
		ТекстОшибки = "Количество товаров в документе %1 больше, чем товаров, остканированных в ЛН/ЛП %2, %3"; 
		ТекстОшибки = СтрШаблон(ТекстОшибки,КоличествоДокумента,КоличествоШтук  + КолШКЗаранееАгрегированных,РНК); 
		//ТекстОшибки = "Количество товаров в документе "  + Строка(КоличествоДокумента) +" больше, чем товаров, остканированных в ЛН/ЛП " + Строка(КоличествоШтук  + КолШКЗаранееАгрегированных); 
		Результат.ошибки.Добавить(ТекстОшибки);
		
	КонецЕсли;

КонецПроцедуры

Процедура КонтрольЧЗПоРНКОжиданиеПаллетированияПоПравиламЧЗ(Результат, Знач РНК)
	
	ПравилаРаботыСАгрегациейЧЗ=МаркировкаКС.ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладной(РНК);
	
	ТребуетсяАгрегацияБлочков = ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияБлочков;
	ТребуетсяАгрегацияКоробок = ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияКоробок;
	ТребуетсяАгрегацияПаллет = ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияПаллет;
	//++Данилова Е.В. 01.04.2026
	//ЕстьЛП = ЕстьЛПСАгрегацией(РНК);
	ЕстьЛП = ЕстьЛПСКодамиЧЗ(РНК); 
	//--Данилова Е.В. 01.04.2026 
	
	Если ПравилаРаботыСАгрегациейЧЗ.УстановленыПравилаРаботыСАгрегацией Тогда 		
		
		//1. проверяем, что есть все агрегации 
		
		Запрос = Новый запрос;
		Запрос.УстановитьПараметр("ДокументОснование",РНК);
		запрос.Текст =
		"ВЫБРАТЬ
		|	МаркировкаТоваровИСМП.Ссылка КАК ДокМаркировки
		|ИЗ
		|	Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
		|ГДЕ
		|	МаркировкаТоваровИСМП.Проведен
		|	И МаркировкаТоваровИСМП.ДокументОснование = &ДокументОснование
		|	И МаркировкаТоваровИСМП.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация)
		|	И МаркировкаТоваровИСМП.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаркировкаТоваровИСМП.Ссылка КАК ДокМаркировки
		|ИЗ
		|	Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
		|ГДЕ
		|	МаркировкаТоваровИСМП.Проведен
		|	И МаркировкаТоваровИСМП.ДокументОснование = &ДокументОснование
		|	И МаркировкаТоваровИСМП.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация)
		|	И МаркировкаТоваровИСМП.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)";
		
		ПакетРезультатов = Запрос.ВыполнитьПакет(); 
		
		ТекстОшибки = ""; 
		
		Если ТребуетсяАгрегацияКоробок 
			И ПакетРезультатов[0].Пустой() Тогда
			
			Результат.Успешно = Ложь; 
			ТекстОшибки = "Не найдена ОМ (агрегация) по коробкам, " + Строка(РНК); 	
			Результат.ошибки.Добавить(ТекстОшибки); 
			
		КонецЕсли; 
		
		Если ТребуетсяАгрегацияБлочков 
			И ПакетРезультатов[1].Пустой() Тогда
			
			Результат.Успешно = Ложь; 
			ТекстОшибки = "Не найдена ОМ (агрегация) по блочкам, " + Строка(РНК); 	
			Результат.ошибки.Добавить(ТекстОшибки); 
			
		КонецЕсли;////
		  	
			
		//2. проверяем, что все агрегации заполнены по ЛП/ЛН 
		
		Если ТребуетсяАгрегацияКоробок Тогда
			
			
			Запрос = Новый Запрос;
			Если ЕстьЛП Тогда 
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ЛистПереукладки.Ссылка КАК ЛП
				|ИЗ
				|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистПереукладкиШтрихкодыУпаковок
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладки
				|		ПО ЛистПереукладкиШтрихкодыУпаковок.Ссылка = ЛистПереукладки.Ссылка
				|ГДЕ
				|	ЛистПереукладки.ДокОснование = &ДокОснование
				|	И (ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
				|			ИЛИ ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок))
				|	И ЛистПереукладки.КодАгрегации = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяССылка)
				|	И ЛистПереукладки.Проведен";
			Иначе
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ЛистНабора.Ссылка КАК ЛП
				|ИЗ
				|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
				|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
				|ГДЕ
				|	ЛистНабора.ДокОснование = &ДокОснование
				|	И (ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
				|			ИЛИ ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок))
				|	И ЛистНабора.КодАгрегации = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяССылка)
				|	И ЛистНабора.Проведен";
			КонецЕсли;
			
			Запрос.УстановитьПараметр("ДокОснование", РНК);		
			РезультатЗапроса = Запрос.Выполнить();
			
			Если  НЕ РезультатЗапроса.Пустой() Тогда 
				Результат.Успешно = Ложь;
				Выборка = РезультатЗапроса.Выбрать(); 
				
				Пока Выборка.Следующий() Цикл  		
					ИмяДок = ?(ЕстьЛП,"ЛП","ЛН"); 
					ТекстОшибки = "По " + ИмяДок + " не заполнен код агрегации короба " + Строка(Выборка.ЛП) + " " + Строка(РНК);	
					Результат.ошибки.Добавить(ТекстОшибки);
					
				КонецЦикла;			
				
			КонецЕсли; 		
			
		КонецЕсли;  	 
		
		Если ТребуетсяАгрегацияБлочков  Тогда 
			
			Запрос = Новый Запрос;
			Если ЕстьЛП Тогда 
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ЛистПереукладки.Ссылка КАК ЛП
				|ИЗ
				|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистПереукладкиШтрихкодыУпаковок
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладки
				|		ПО ЛистПереукладкиШтрихкодыУпаковок.Ссылка = ЛистПереукладки.Ссылка
				|ГДЕ
				|	ЛистПереукладки.ДокОснование = &ДокОснование
				|	И ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
				|	И ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодБлочка = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяССылка)
				|	И ЛистПереукладки.Проведен";
			Иначе
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ЛистНабора.Ссылка КАК ЛП
				|ИЗ
				|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
				|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
				|ГДЕ
				|	ЛистНабора.ДокОснование = &ДокОснование
				|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
				|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодБлочка = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяССылка)
				|	И ЛистНабора.Проведен";
			КонецЕсли;
			
			Запрос.УстановитьПараметр("ДокОснование", РНК);		
			РезультатЗапроса = Запрос.Выполнить();
			
			Если  НЕ РезультатЗапроса.Пустой() Тогда 
				Результат.Успешно = Ложь;
				Выборка = РезультатЗапроса.Выбрать(); 
				
				Пока Выборка.Следующий() Цикл  		
					ИмяДок = ?(ЕстьЛП,"ЛП","ЛН");
					ТекстОшибки = "По "  + ИмяДок + " заполнены НЕ ВСЕ коды по блочкам " + Строка(Выборка.ЛП) + " " + Строка(РНК);	
					Результат.ошибки.Добавить(ТекстОшибки);
					
				КонецЦикла;			
				
			КонецЕсли; 	
			
		КонецЕсли; 
		
		
	КонецЕсли;
	
	
КонецПроцедуры
 

//--Данилова Е.В. 24.11.2025 

//++Данилова Е.В. 09.03.2026 MARK-3552

Функция КонтрольЧЗПоРНКОжиданиеОбработкиЧЗ(Знач РНК,Результат) Экспорт
		
	//ИспользоватьПроверку = ОбщегоНазначения_ПИ.ПрочитатьРСРеквизитСправочника_ПИ("ИспользоватьПроверкуОжиданиеОбработкиЧЗ",неопределено);
	//Если ИспользоватьПроверку <> истина Тогда
	//	
	//	Возврат Результат; 	
	//	
	//КонецЕсли;  
	
	//++Данилова Е.В. 21.04.2026 MARK-3552 
	//ПроверятьКратностьБлочков = ПолучитьРеквизитШапки(РНК,"Контрагент.ПроверятьКратностьБлочков");
	//ПроверятьКратностьКоробок = ПолучитьРеквизитШапки(РНК,"Контрагент.ПроверятьКратностьКоробок"); 
	//--Данилова Е.В. 21.04.2026 
	//++Данилова Е.В. 01.04.2026 MARK-3552
	ЕстьЛП = ЕстьЛПСКодамиЧЗ(РНК); 
	//--Данилова Е.В. 01.04.2026 
	
	ПравилаРаботыСАгрегациейЧЗ = МаркировкаКС.ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладной(РНК);
	//++Данилова Е.В. 21.04.2026 MARK-3552
	ПроверятьКратностьБлочков = ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияБлочков; 
	ПроверятьКратностьКоробок = ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияКоробок;	
	//--Данилова Е.В. 21.04.2026
	Если ПроверятьКратностьБлочков
		ИЛИ ПроверятьКратностьКоробок Тогда
		
		СтруктураДанныхНакладной=новый Структура("Номенклатура,ПунктДоставки,Договор,Дата,Контрагент,ПостояннаяАкция"); 
		ЗаполнитьЗначенияСвойств(СтруктураДанныхНакладной,РНК); 	
		
		СтруктураДанныхНакладной.Номенклатура = РНК.Товары.выгрузить().ВыгрузитьКолонку("Номенклатура");
		 		
		
		ТаблицаМатрицы = ПолучитьТаблицуМатрицСрезПоследних(СтруктураДанныхНакладной);
		 		
		Если ПроверятьКратностьБлочков Тогда 
			  
			КонтрольКоличестваБлочков(Результат,РНК,ТаблицаМатрицы,ПравилаРаботыСАгрегациейЧЗ,ПроверятьКратностьКоробок,ЕстьЛП); 
			
		ИначеЕсли ПроверятьКратностьКоробок Тогда 
			КонтрольКоличестваКоробов(Результат,РНК,ТаблицаМатрицы,ПравилаРаботыСАгрегациейЧЗ,ЕстьЛП);
		КонецЕсли; 
		
		
	КонецЕсли;  
	
	
	Результат.Успешно = Результат.Ошибки.Количество() = 0; 
	
	Возврат Результат; 
	
КонецФункции

Процедура КонтрольКоличестваБлочков(Результат, Знач РНК, ТаблицаМатрицы, ПравилаРаботыСАгрегациейЧЗ = Неопределено,ПроверятьКратностьКоробок = Ложь, ЕстьЛП = Неопределено) Экспорт
	//++Данилова Е.В. 21.04.2026 MARK-3552
	//ПроверятьКратностьБлочков = ПолучитьРеквизитШапки(РНК,"Контрагент.ПроверятьКратностьБлочков"); 
	//
	//Если НЕ ПроверятьКратностьБлочков Тогда
	//	
	//	Возврат; 	
	//	
	//КонецЕсли;  
	//--Данилова Е.В. 21.04.2026 
	Если ПравилаРаботыСАгрегациейЧЗ = Неопределено Тогда
		
		ПравилаРаботыСАгрегациейЧЗ=МаркировкаКС.ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладной(РНК);  	
		
	КонецЕсли;
	
	Если НЕ ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияБлочков Тогда
		
		Возврат;  	
		
	КонецЕсли; 
	//++Данилова Е.В. 21.04.2026 MARK-3552 
	Если ТаблицаМатрицы.Количество() = 0
		ИЛИ ТаблицаМатрицы.Итог("КратностьБлочка") = 0 Тогда
	
		Возврат;	
	
	КонецЕсли;
	//--Данилова Е.В. 21.04.2026 
	
	Запрос = Новый Запрос; 
	Запрос.Текст = 
	
	
	"ВЫБРАТЬ
	|	РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	|	СУММА(РасходнаяНакладнаяТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТТовары
	|ИЗ
	|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|		ПО РасходнаяНакладнаяТовары.Ссылка = РасходнаяНакладная.Ссылка
	|ГДЕ
	|	РасходнаяНакладная.Ссылка = &РНК
	|	И РасходнаяНакладнаяТовары.Количество > 0
	|	И РасходнаяНакладнаяТовары.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|	И РасходнаяНакладнаяТовары.ТребуетсяМаркировка
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходнаяНакладнаяТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТМатрица.Номенклатура КАК Номенклатура,
	|	ВТМатрица.АртикулКонтрагента КАК АртикулКонтрагента,
	|	ВТМатрица.КратностьБлочка КАК КратностьБлочка,
	|	ВТМатрица.КратностьКоробки КАК КратностьКоробки
	|ПОМЕСТИТЬ ВТМатрица
	|ИЗ
	|	&ТЧМатрица КАК ВТМатрица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТовары.Номенклатура КАК Номенклатура,
	|	ВТТовары.Количество КАК Количество,
	|	ВТМатрица.АртикулКонтрагента КАК АртикулКонтрагента,
	|	ВТМатрица.КратностьБлочка КАК КратностьБлочка,
	|	ВТМатрица.КратностьКоробки КАК КратностьКоробки,
	|	0 КАК НомерБлочка,
	|	0 КАК КоличествоБлочков
	|ИЗ
	|	ВТТовары КАК ВТТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМатрица КАК ВТМатрица
	|		ПО ВТТовары.Номенклатура = ВТМатрица.Номенклатура"; 
	Запрос.УстановитьПараметр("РНК",РНК);
	Запрос.УстановитьПараметр("ТЧМатрица",ТаблицаМатрицы);
	ТаблицаМатрицыПоРНК = Запрос.Выполнить().Выгрузить(); 
	
	ТаблицаМатрицыПоРНКПолная =  ТаблицаМатрицыПоРНК.Скопировать(); 
	
	ТаблицаМатрицыПоРНК.Свернуть("АртикулКонтрагента,КратностьКоробки,КратностьБлочка,НомерБлочка","Количество,КоличествоБлочков");
	
	ВсегоБлочков = Новый ТаблицаЗначений; 
	ВсегоБлочков.Колонки.Добавить("НомерБлочка", Новый ОписаниеТипов("Число"));
	ВсегоБлочков.Колонки.Добавить("НомерКоробки", Новый ОписаниеТипов("Число"));
	ВсегоБлочков.Колонки.Добавить("КоличествоБлочков",Новый ОписаниеТипов("Число"));
	
	НомерБлочка = 1; 
	Для каждого СтрокаОбщаяАртикул Из ТаблицаМатрицыПоРНК Цикл
		
		
		СтрокаВсегоБлочков = ВсегоБлочков.Добавить(); 
		СтрокаВсегоБлочков.НомерБлочка  =  НомерБлочка; 
		СтрокаВсегоБлочков.КоличествоБлочков = Цел(СтрокаОбщаяАртикул.КратностьКоробки/СтрокаОбщаяАртикул.КратностьБлочка);
		
		СтрокаОбщаяАртикул.НомерБлочка = НомерБлочка;
		СтрокаОбщаяАртикул.КоличествоБлочков = СтрокаВсегоБлочков.КоличествоБлочков;
		
		НомерБлочка = НомерБлочка + 1;
	КонецЦикла;
	
	ВсегоБлочковИтого = ВсегоБлочков.Итог("КоличествоБлочков"); 
	
	
	ЭтоFBS = Ложь; 
	
	
	Запрос = Новый Запрос; 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Вложенныйзапрос.Продукция КАК Продукция,
	|	Вложенныйзапрос.Номенклатура КАК Номенклатура,
	|	СУММА(ЕСТЬNULL(Вложенныйзапрос.Количество, 0)) КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасходнаяНакладнаяТовары.Номенклатура КАК Продукция,
	|		РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	|		СУММА(РасходнаяНакладнаяТовары.Количество) КАК Количество
	|	ИЗ
	|		Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|			ПО РасходнаяНакладнаяТовары.Ссылка = РасходнаяНакладная.Ссылка
	|	ГДЕ
	|		РасходнаяНакладная.Ссылка = &РНК
	|		И РасходнаяНакладнаяТовары.Количество > 0
	|		И РасходнаяНакладнаяТовары.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|		И (НЕ РасходнаяНакладная.ОтгрузкаКомплектов
	|				ИЛИ &ЭтоFBS)
	|		И РасходнаяНакладнаяТовары.ТребуетсяМаркировка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РасходнаяНакладнаяТовары.Номенклатура,
	|		РасходнаяНакладнаяТовары.Номенклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасходнаяНакладнаяТовары.Продукция,
	|		РасходнаяНакладнаяТовары.Номенклатура,
	|		СУММА(РасходнаяНакладнаяТовары.Количество)
	|	ИЗ
	|		Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|			ПО РасходнаяНакладнаяТовары.Ссылка = РасходнаяНакладная.Ссылка
	|	ГДЕ
	|		РасходнаяНакладная.Ссылка = &РНК
	|		И РасходнаяНакладнаяТовары.Количество > 0
	|		И РасходнаяНакладнаяТовары.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|		И РасходнаяНакладная.ОтгрузкаКомплектов
	|		И НЕ &ЭтоFBS
	|		И РасходнаяНакладнаяТовары.ТребуетсяМаркировка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РасходнаяНакладнаяТовары.Номенклатура,
	|		РасходнаяНакладнаяТовары.Продукция) КАК Вложенныйзапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	Вложенныйзапрос.Номенклатура,
	|	Вложенныйзапрос.Продукция"; 	
	Запрос.УстановитьПараметр("РНК",РНК);
	Запрос.УстановитьПараметр("ЭтоFBS",ЭтоFBS);
	ТЗТовары = Запрос.Выполнить().Выгрузить();
	
	СодержимоеБлочка = Новый ТаблицаЗначений; 
	СодержимоеБлочка.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	СодержимоеБлочка.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число"));
	СодержимоеБлочка.Колонки.Добавить("КоличествоВНакладной",Новый ОписаниеТипов("Число"));
	СодержимоеБлочка.Колонки.Добавить("НомерБлочка",Новый ОписаниеТипов("Число"));
	СодержимоеБлочка.Колонки.Добавить("НомерКоробки",Новый ОписаниеТипов("Число"));		
	
	Для каждого СтрокаТЧ Из ТЗТовары Цикл
		
		Отбор = Новый Структура("Номенклатура",СтрокаТЧ.Продукция);	
		СтрокиИзМатрицы = ТаблицаМатрицыПоРНКПолная.НайтиСтроки(Отбор); 	
		
		Если СтрокиИзМатрицы.Количество() > 0  Тогда
			
			КоличествоВРНК = СтрокиИзМатрицы[0].Количество;
			
			ОтборПоАртикулу = Новый Структура("АртикулКонтрагента",СтрокиИзМатрицы[0].АртикулКонтрагента); 
			
			СтрокиИзСвернТЧ = ТаблицаМатрицыПоРНК.НайтиСтроки(ОтборПоАртикулу); 
			
			НомерБлочка = 0;
			КратностьБлочкаРасч = 0;
			КоличествоБлочков = 0; 
			Если СтрокиИзСвернТЧ.Количество() > 0  Тогда
				
				НомерБлочка = СтрокиИзСвернТЧ[0].НомерБлочка;
				
				КоличествоКоробок = СтрокиИзСвернТЧ[0].Количество/СтрокиИзСвернТЧ[0].КратностьКоробки;
				
				КоличествоБлочков = СтрокиИзСвернТЧ[0].КоличествоБлочков;  			
				
				КратностьБлочкаРасч = Цел(КоличествоВРНК/КоличествоКоробок/КоличествоБлочков); 
			Иначе 
				
				Сообщить("Ошибка в определении количества блочков в коробке!!!" + Строка(СтрокаТЧ.Продукция)); 
				
				Продолжить; 
				
			КонецЕсли;
			
			
			ВидКомплекта= ПолучитьРеквизитОбъекта(СтрокаТЧ.Продукция,"ВидКомплекта");
			Если ВидКомплекта = Перечисления.ВидыКомплектов.Ассортито Тогда   				
				КоличествоВблочке = Цел(СтрокаТЧ.Количество/КоличествоКоробок/КоличествоБлочков);	 
				
			Иначе 
				КратностьКомплект = СтрокаТЧ.Количество/СтрокиИзМатрицы[0].Количество; 
				
				КоличествоВблочке = КратностьКомплект *  КратностьБлочкаРасч;	
				
			КонецЕсли;  			
			
			НоваяСтрокаСодер = СодержимоеБлочка.Добавить(); 
			НоваяСтрокаСодер.НомерБлочка = НомерБлочка;
			НоваяСтрокаСодер.НомерКоробки = НомерБлочка; 
			НоваяСтрокаСодер.Количество = КоличествоВблочке; 
			НоваяСтрокаСодер.КоличествоВНакладной = СтрокаТЧ.Количество; 
			НоваяСтрокаСодер.Номенклатура = СтрокаТЧ.Номенклатура; 
			
			
		Иначе 
			
			Сообщить("Не найдены данные в матрице по " + Строка(СтрокаТЧ.Продукция)); 
			Продолжить; 
		КонецЕсли;
		
	КонецЦикла; 
	
	Коробки = Новый ТаблицаЗначений; 
	Коробки.Колонки.Добавить("НомерКоробки",Новый ОписаниеТипов("Число"));
	Коробки.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число"));
	Коробки.Колонки.Добавить("КоличествоБлочков",Новый ОписаниеТипов("Число"));    
	
	СодержимоеБлочкаКопия = СодержимоеБлочка.Скопировать(,"НомерКоробки"); 
	СодержимоеБлочкаКопия.Свернуть("НомерКоробки");
	
	СодержимоеБлочкаКопия2 = СодержимоеБлочка.Скопировать(,"НомерКоробки,НомерБлочка");
	СодержимоеБлочкаКопия2.Свернуть("НомерКоробки,НомерБлочка");
	Для каждого СтрокаТЧ Из  СодержимоеБлочкаКопия Цикл
		
		НоваяСтрока = Коробки.Добавить(); 
		НоваяСтрока.НомерКоробки =  СтрокаТЧ.НомерКоробки;		
		
		СтрокиБлочков = СодержимоеБлочкаКопия2.НайтиСтроки(Новый Структура("НомерКоробки", СтрокаТЧ.НомерКоробки));
		ВсегоБлочковВКоробке = 0; 
		ВидыБлочков = ""; 
		Для каждого СтрокаБлочков Из СтрокиБлочков Цикл
			
			СтрокаВсегоБлочков = ВсегоБлочков.Найти(СтрокаБлочков.НомерБлочка,"НомерБлочка");
			Если СтрокаВсегоБлочков <> неопределено Тогда
				ВсегоБлочковВКоробке = ВсегоБлочковВКоробке + СтрокаВсегоБлочков.КоличествоБлочков; 
				СтрокаВсегоБлочков.НомерКоробки = СтрокаТЧ.НомерКоробки; 
			КонецЕсли; 				 
			
		КонецЦикла;
		
		НоваяСтрока.КоличествоБлочков = ВсегоБлочковВКоробке;  
		
	КонецЦикла;
	
	Если СодержимоеБлочка.Количество() = 0 Тогда 
		
		Сообщить("По матрице ничего не найдено"); 
		
		Возврат; 	
		
	КонецЕсли; 
	
	РассчитатьКоличествоКоробокПоВведеннымДанным(СодержимоеБлочка,ВсегоБлочков,Коробки,РНК,ЭтоFBS);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СодержимоеБлочка",СодержимоеБлочка);
	Запрос.УстановитьПараметр("ВсегоБлочков",ВсегоБлочков);
	Запрос.УстановитьПараметр("Коробки",Коробки);
	//++Данилова Е.В. 01.04.2026  MARK-3552
	Если ЕстьЛП = Неопределено Тогда 
		ЕстьЛП = ЕстьЛПСКодамиЧЗ(РНК); 
	КонецЕсли; 
	Если ЕстьЛП Тогда 
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТСодержимоеБлочков.Номенклатура КАК Номенклатура,
		|	ВТСодержимоеБлочков.НомерБлочка КАК НомерБлочка,
		|	ВТСодержимоеБлочков.Количество КАК КоличествоВБлочке
		|ПОМЕСТИТЬ ВТСодержимоеБлочков
		|ИЗ
		|	&СодержимоеБлочка КАК ВТСодержимоеБлочков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсегоБлочков.НомерБлочка КАК НомерБлочка,
		|	ВсегоБлочков.НомерКоробки КАК НомерКоробки,
		|	ВсегоБлочков.КоличествоБлочков КАК Количество
		|ПОМЕСТИТЬ ВТВсегоБлочков
		|ИЗ
		|	&ВсегоБлочков КАК ВсегоБлочков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтКоробки.НомерКоробки КАК НомерКоробки,
		|	ВтКоробки.Количество КАК КоличествоКоробок
		|ПОМЕСТИТЬ ВТКоробки
		|ИЗ
		|	&Коробки КАК ВтКоробки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСодержимоеБлочков.Номенклатура КАК Номенклатура,
		|	СУММА(ВТСодержимоеБлочков.КоличествоВБлочке * ВсегоБлочков.Количество * ВТКоробки.КоличествоКоробок) КАК КоличествоВБлочках
		|ПОМЕСТИТЬ ВТВсегоПоБлочкамШтук
		|ИЗ
		|	ВТСодержимоеБлочков КАК ВТСодержимоеБлочков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВсегоБлочков КАК ВсегоБлочков
		|		ПО ВТСодержимоеБлочков.НомерБлочка = ВсегоБлочков.НомерБлочка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоробки КАК ВТКоробки
		|		ПО (ВТКоробки.НомерКоробки = ВсегоБлочков.НомерКоробки)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСодержимоеБлочков.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСодержимоеБлочков.Номенклатура КАК Номенклатура,
		|	СУММА(ВсегоБлочков.Количество * ВТКоробки.КоличествоКоробок) КАК КоличествоБлочков
		|ПОМЕСТИТЬ ВТВсегоБлочковПоНоменклатуре
		|ИЗ
		|	ВТСодержимоеБлочков КАК ВТСодержимоеБлочков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВсегоБлочков КАК ВсегоБлочков
		|		ПО ВТСодержимоеБлочков.НомерБлочка = ВсегоБлочков.НомерБлочка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоробки КАК ВТКоробки
		|		ПО (ВТКоробки.НомерКоробки = ВсегоБлочков.НомерКоробки)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСодержимоеБлочков.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВсегоБлочков.Количество * ВТКоробки.КоличествоКоробок) КАК КоличествоБлочков
		|ПОМЕСТИТЬ ВТИтогиПоБлочкам
		|ИЗ
		|	ВТВсегоБлочков КАК ВсегоБлочков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоробки КАК ВТКоробки
		|		ПО (ВТКоробки.НомерКоробки = ВсегоБлочков.НомерКоробки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛистНабораШтрихкодыУпаковок.ШтрихкодБлочка КАК ШтрихкодБлочка,
		|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец КАК Номенклатура,
		|	ЛистПереукладки.Ссылка КАК Лист,
		|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки КАК КМШтуки
		|ПОМЕСТИТЬ ВТШКБлочков
		|ИЗ
		|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладки
		|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистПереукладки.Ссылка
		|ГДЕ
		|	ЛистНабораШтрихкодыУпаковок.ШтрихкодБлочка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
		|	И ЛистПереукладки.Проведен
		|	И ЛистПереукладки.ДокОснование = &РНК
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка.Владелец,
		|	ЛистПереукладки.Ссылка,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод
		|ИЗ
		|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладки
		|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистПереукладки.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|		ПО ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|ГДЕ
		|	ЛистПереукладки.Проведен
		|	И ЛистПереукладки.ДокОснование = &РНК
		|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод.Владелец,
		|	ЛистПереукладки.Ссылка,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод
		|ИЗ
		|	Документ.ЛистПереукладки КАК ЛистПереукладки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистПереукладкиШтрихкодыУпаковок
		|		ПО ЛистПереукладки.Ссылка = ЛистПереукладкиШтрихкодыУпаковок.Ссылка
		|			И (ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки.ШтрихкодыКоробокДляАгрегации КАК ЛистПереукладкиШтрихкодыКоробокДляАгрегации
		|		ПО ЛистПереукладки.Ссылка = ЛистПереукладкиШтрихкодыКоробокДляАгрегации.Ссылка
		|			И (ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки = ЛистПереукладкиШтрихкодыКоробокДляАгрегации.НовыйКодКоробки)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|		ПО (ЛистПереукладкиШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка)
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1
		|		ПО (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Ссылка = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод)
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|ГДЕ
		|	ЛистПереукладки.Проведен
		|	И ЛистПереукладки.ДокОснование = &РНК
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Лист
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТВсегоПоБлочкамШтук.Номенклатура КАК Номенклатура,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШКБлочков.КМШтуки) КАК КоличествоОтсканированное,
		|	МАКСИМУМ(ВТВсегоПоБлочкамШтук.КоличествоВБлочках) КАК КоличествоПоПлану
		|ИЗ
		|	ВТВсегоПоБлочкамШтук КАК ВТВсегоПоБлочкамШтук
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШКБлочков КАК ВТШКБлочков
		|		ПО (ВТШКБлочков.Номенклатура = ВТВсегоПоБлочкамШтук.Номенклатура)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТВсегоПоБлочкамШтук.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШКБлочков.КМШтуки) <> МАКСИМУМ(ВТВсегоПоБлочкамШтук.КоличествоВБлочках)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТВсегоБлочковПоНоменклатуре.Номенклатура КАК Номенклатура,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШКБлочков.ШтрихкодБлочка) КАК КоличествоОтсканированное,
		|	МАКСИМУМ(ВТВсегоБлочковПоНоменклатуре.КоличествоБлочков) КАК КоличествоПоПлану
		|ИЗ
		|	ВТВсегоБлочковПоНоменклатуре КАК ВТВсегоБлочковПоНоменклатуре
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШКБлочков КАК ВТШКБлочков
		|		ПО (ВТШКБлочков.Номенклатура = ВТВсегоБлочковПоНоменклатуре.Номенклатура)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТВсегоБлочковПоНоменклатуре.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШКБлочков.ШтрихкодБлочка) <> МАКСИМУМ(ВТВсегоБлочковПоНоменклатуре.КоличествоБлочков)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШКБлочков.ШтрихкодБлочка) КАК КоличествоОтсканированное,
		|	МАКСИМУМ(ВТИтогиПоБлочкам.КоличествоБлочков) КАК КоличествоПоПлану
		|ИЗ
		|	ВТИтогиПоБлочкам КАК ВТИтогиПоБлочкам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШКБлочков КАК ВТШКБлочков
		|		ПО (ИСТИНА)
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШКБлочков.ШтрихкодБлочка) <> МАКСИМУМ(ВТИтогиПоБлочкам.КоличествоБлочков)";
	Иначе 
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТСодержимоеБлочков.Номенклатура КАК Номенклатура,
		|	ВТСодержимоеБлочков.НомерБлочка КАК НомерБлочка,
		|	ВТСодержимоеБлочков.Количество КАК КоличествоВБлочке
		|ПОМЕСТИТЬ ВТСодержимоеБлочков
		|ИЗ
		|	&СодержимоеБлочка КАК ВТСодержимоеБлочков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсегоБлочков.НомерБлочка КАК НомерБлочка,
		|	ВсегоБлочков.НомерКоробки КАК НомерКоробки,
		|	ВсегоБлочков.КоличествоБлочков КАК Количество
		|ПОМЕСТИТЬ ВТВсегоБлочков
		|ИЗ
		|	&ВсегоБлочков КАК ВсегоБлочков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтКоробки.НомерКоробки КАК НомерКоробки,
		|	ВтКоробки.Количество КАК КоличествоКоробок
		|ПОМЕСТИТЬ ВТКоробки
		|ИЗ
		|	&Коробки КАК ВтКоробки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСодержимоеБлочков.Номенклатура КАК Номенклатура,
		|	СУММА(ВТСодержимоеБлочков.КоличествоВБлочке * ВсегоБлочков.Количество * ВТКоробки.КоличествоКоробок) КАК КоличествоВБлочках
		|ПОМЕСТИТЬ ВТВсегоПоБлочкамШтук
		|ИЗ
		|	ВТСодержимоеБлочков КАК ВТСодержимоеБлочков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВсегоБлочков КАК ВсегоБлочков
		|		ПО ВТСодержимоеБлочков.НомерБлочка = ВсегоБлочков.НомерБлочка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоробки КАК ВТКоробки
		|		ПО (ВТКоробки.НомерКоробки = ВсегоБлочков.НомерКоробки)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСодержимоеБлочков.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСодержимоеБлочков.Номенклатура КАК Номенклатура,
		|	СУММА(ВсегоБлочков.Количество * ВТКоробки.КоличествоКоробок) КАК КоличествоБлочков
		|ПОМЕСТИТЬ ВТВсегоБлочковПоНоменклатуре
		|ИЗ
		|	ВТСодержимоеБлочков КАК ВТСодержимоеБлочков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВсегоБлочков КАК ВсегоБлочков
		|		ПО ВТСодержимоеБлочков.НомерБлочка = ВсегоБлочков.НомерБлочка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоробки КАК ВТКоробки
		|		ПО (ВТКоробки.НомерКоробки = ВсегоБлочков.НомерКоробки)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСодержимоеБлочков.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВсегоБлочков.Количество * ВТКоробки.КоличествоКоробок) КАК КоличествоБлочков
		|ПОМЕСТИТЬ ВТИтогиПоБлочкам
		|ИЗ
		|	ВТВсегоБлочков КАК ВсегоБлочков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоробки КАК ВТКоробки
		|		ПО (ВТКоробки.НомерКоробки = ВсегоБлочков.НомерКоробки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛистНабораШтрихкодыУпаковок.ШтрихкодБлочка КАК ШтрихкодБлочка,
		|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец КАК Номенклатура,
		|	ЛистНабора.Ссылка КАК Лист,
		|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки КАК КМШтуки
		|ПОМЕСТИТЬ ВТШКБлочков
		|ИЗ
		|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
		|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
		|ГДЕ
		|	ЛистНабораШтрихкодыУпаковок.ШтрихкодБлочка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
		|	И ЛистНабора.Проведен
		|	И ЛистНабора.ДокОснование = &РНК
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка.Владелец,
		|	ЛистНабора.Ссылка,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод
		|ИЗ
		|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
		|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|		ПО ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|ГДЕ
		|	ЛистНабора.Проведен
		|	И ЛистНабора.ДокОснование = &РНК
		|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод.Владелец,
		|	ЛистНабора.Ссылка,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод
		|ИЗ
		|	Документ.ЛистНабора КАК ЛистНабора
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		|		ПО ЛистНабора.Ссылка = ЛистНабораШтрихкодыУпаковок.Ссылка
		|			И (ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ЛистНабораШтрихкодыКоробокДляАгрегации
		|		ПО ЛистНабора.Ссылка = ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка
		|			И (ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ЛистНабораШтрихкодыКоробокДляАгрегации.НовыйКодКоробки)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|		ПО (ЛистНабораШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка)
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1
		|		ПО (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Ссылка = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод)
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|ГДЕ
		|	ЛистНабора.Проведен
		|	И ЛистНабора.ДокОснование = &РНК
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Лист
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТВсегоПоБлочкамШтук.Номенклатура КАК Номенклатура,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШКБлочков.КМШтуки) КАК КоличествоОтсканированное,
		|	МАКСИМУМ(ВТВсегоПоБлочкамШтук.КоличествоВБлочках) КАК КоличествоПоПлану
		|ИЗ
		|	ВТВсегоПоБлочкамШтук КАК ВТВсегоПоБлочкамШтук
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШКБлочков КАК ВТШКБлочков
		|		ПО (ВТШКБлочков.Номенклатура = ВТВсегоПоБлочкамШтук.Номенклатура)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТВсегоПоБлочкамШтук.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШКБлочков.КМШтуки) <> МАКСИМУМ(ВТВсегоПоБлочкамШтук.КоличествоВБлочках)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТВсегоБлочковПоНоменклатуре.Номенклатура КАК Номенклатура,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШКБлочков.ШтрихкодБлочка) КАК КоличествоОтсканированное,
		|	МАКСИМУМ(ВТВсегоБлочковПоНоменклатуре.КоличествоБлочков) КАК КоличествоПоПлану
		|ИЗ
		|	ВТВсегоБлочковПоНоменклатуре КАК ВТВсегоБлочковПоНоменклатуре
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШКБлочков КАК ВТШКБлочков
		|		ПО (ВТШКБлочков.Номенклатура = ВТВсегоБлочковПоНоменклатуре.Номенклатура)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТВсегоБлочковПоНоменклатуре.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШКБлочков.ШтрихкодБлочка) <> МАКСИМУМ(ВТВсегоБлочковПоНоменклатуре.КоличествоБлочков)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШКБлочков.ШтрихкодБлочка) КАК КоличествоОтсканированное,
		|	МАКСИМУМ(ВТИтогиПоБлочкам.КоличествоБлочков) КАК КоличествоПоПлану
		|ИЗ
		|	ВТИтогиПоБлочкам КАК ВТИтогиПоБлочкам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШКБлочков КАК ВТШКБлочков
		|		ПО (ИСТИНА)
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШКБлочков.ШтрихкодБлочка) <> МАКСИМУМ(ВТИтогиПоБлочкам.КоличествоБлочков)";
	Конецесли; 
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ВТСодержимоеБлочков.Номенклатура КАК Номенклатура,
	//|	ВТСодержимоеБлочков.НомерБлочка КАК НомерБлочка,
	//|	ВТСодержимоеБлочков.Количество КАК КоличествоВБлочке
	//|ПОМЕСТИТЬ ВТСодержимоеБлочков
	//|ИЗ
	//|	&СодержимоеБлочка КАК ВТСодержимоеБлочков
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВсегоБлочков.НомерБлочка КАК НомерБлочка,
	//|	ВсегоБлочков.НомерКоробки КАК НомерКоробки,
	//|	ВсегоБлочков.КоличествоБлочков КАК Количество
	//|ПОМЕСТИТЬ ВТВсегоБлочков
	//|ИЗ
	//|	&ВсегоБлочков КАК ВсегоБлочков
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВтКоробки.НомерКоробки КАК НомерКоробки,
	//|	ВтКоробки.Количество КАК КоличествоКоробок
	//|ПОМЕСТИТЬ ВТКоробки
	//|ИЗ
	//|	&Коробки КАК ВтКоробки
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТСодержимоеБлочков.Номенклатура КАК Номенклатура,
	//|	СУММА(ВТСодержимоеБлочков.КоличествоВБлочке * ВсегоБлочков.Количество * ВТКоробки.КоличествоКоробок) КАК КоличествоВБлочках
	//|ПОМЕСТИТЬ ВТВсегоПоБлочкамШтук
	//|ИЗ
	//|	ВТСодержимоеБлочков КАК ВТСодержимоеБлочков
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВсегоБлочков КАК ВсегоБлочков
	//|		ПО ВТСодержимоеБлочков.НомерБлочка = ВсегоБлочков.НомерБлочка
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоробки КАК ВТКоробки
	//|		ПО (ВТКоробки.НомерКоробки = ВсегоБлочков.НомерКоробки)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТСодержимоеБлочков.Номенклатура
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТСодержимоеБлочков.Номенклатура КАК Номенклатура,
	//|	СУММА(ВсегоБлочков.Количество * ВТКоробки.КоличествоКоробок) КАК КоличествоБлочков
	//|ПОМЕСТИТЬ ВТВсегоБлочковПоНоменклатуре
	//|ИЗ
	//|	ВТСодержимоеБлочков КАК ВТСодержимоеБлочков
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВсегоБлочков КАК ВсегоБлочков
	//|		ПО ВТСодержимоеБлочков.НомерБлочка = ВсегоБлочков.НомерБлочка
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоробки КАК ВТКоробки
	//|		ПО (ВТКоробки.НомерКоробки = ВсегоБлочков.НомерКоробки)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТСодержимоеБлочков.Номенклатура
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	СУММА(ВсегоБлочков.Количество * ВТКоробки.КоличествоКоробок) КАК КоличествоБлочков
	//|ПОМЕСТИТЬ ВТИтогиПоБлочкам
	//|ИЗ
	//|	ВТВсегоБлочков КАК ВсегоБлочков
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоробки КАК ВТКоробки
	//|		ПО (ВТКоробки.НомерКоробки = ВсегоБлочков.НомерКоробки)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ЛистНабораШтрихкодыУпаковок.ШтрихкодБлочка КАК ШтрихкодБлочка,
	//|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец КАК Номенклатура,
	//|	ЛистНабора.Ссылка КАК Лист,
	//|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки КАК КМШтуки
	//|ПОМЕСТИТЬ ВТШКБлочков
	//|ИЗ
	//|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
	//|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
	//|ГДЕ
	//|	ЛистНабораШтрихкодыУпаковок.ШтрихкодБлочка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	//|	И ЛистНабора.Проведен
	//|	И ЛистНабора.ДокОснование = &РНК
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки,
	//|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка.Владелец,
	//|	ЛистНабора.Ссылка,
	//|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод
	//|ИЗ
	//|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
	//|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//|		ПО ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	//|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
	//|ГДЕ
	//|	ЛистНабора.Проведен
	//|	И ЛистНабора.ДокОснование = &РНК
	//|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ЛистНабораШтрихкодыУпаковок.ШтрихкодБлочка,
	//|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец,
	//|	ЛистПереукладки.Ссылка,
	//|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки
	//|ИЗ
	//|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладки
	//|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистПереукладки.Ссылка
	//|ГДЕ
	//|	ЛистНабораШтрихкодыУпаковок.ШтрихкодБлочка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	//|	И ЛистПереукладки.Проведен
	//|	И ЛистПереукладки.ДокОснование = &РНК
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки,
	//|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка.Владелец,
	//|	ЛистПереукладки.Ссылка,
	//|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод
	//|ИЗ
	//|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладки
	//|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистПереукладки.Ссылка
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//|		ПО ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	//|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
	//|ГДЕ
	//|	ЛистПереукладки.Проведен
	//|	И ЛистПереукладки.ДокОснование = &РНК
	//|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец,
	//|	ЛистНабора.Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТВсегоПоБлочкамШтук.Номенклатура КАК Номенклатура,
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШКБлочков.КМШтуки) КАК КоличествоОтсканированное,
	//|	МАКСИМУМ(ВТВсегоПоБлочкамШтук.КоличествоВБлочках) КАК КоличествоПоПлану
	//|ИЗ
	//|	ВТВсегоПоБлочкамШтук КАК ВТВсегоПоБлочкамШтук
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШКБлочков КАК ВТШКБлочков
	//|		ПО (ВТШКБлочков.Номенклатура = ВТВсегоПоБлочкамШтук.Номенклатура)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТВсегоПоБлочкамШтук.Номенклатура
	//|
	//|ИМЕЮЩИЕ
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШКБлочков.КМШтуки) <> МАКСИМУМ(ВТВсегоПоБлочкамШтук.КоличествоВБлочках)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТВсегоБлочковПоНоменклатуре.Номенклатура КАК Номенклатура,
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШКБлочков.ШтрихкодБлочка) КАК КоличествоОтсканированное,
	//|	МАКСИМУМ(ВТВсегоБлочковПоНоменклатуре.КоличествоБлочков) КАК КоличествоПоПлану
	//|ИЗ
	//|	ВТВсегоБлочковПоНоменклатуре КАК ВТВсегоБлочковПоНоменклатуре
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШКБлочков КАК ВТШКБлочков
	//|		ПО (ВТШКБлочков.Номенклатура = ВТВсегоБлочковПоНоменклатуре.Номенклатура)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТВсегоБлочковПоНоменклатуре.Номенклатура
	//|
	//|ИМЕЮЩИЕ
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШКБлочков.ШтрихкодБлочка) <> МАКСИМУМ(ВТВсегоБлочковПоНоменклатуре.КоличествоБлочков)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШКБлочков.ШтрихкодБлочка) КАК КоличествоОтсканированное,
	//|	МАКСИМУМ(ВТИтогиПоБлочкам.КоличествоБлочков) КАК КоличествоПоПлану
	//|ИЗ
	//|	ВТИтогиПоБлочкам КАК ВТИтогиПоБлочкам
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШКБлочков КАК ВТШКБлочков
	//|		ПО (ИСТИНА)
	//|
	//|ИМЕЮЩИЕ
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШКБлочков.ШтрихкодБлочка) <> МАКСИМУМ(ВТИтогиПоБлочкам.КоличествоБлочков)";
	//--Данилова Е.В. 01.04.2026	
	Запрос.УстановитьПараметр("ТоварыМатрицы", ТаблицаМатрицы);
	Запрос.УстановитьПараметр("РНК", РНК);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет(); 
	
	ВыборкаПоШтукам = ПакетЗапросов[7].Выбрать();
	ВыборкаПоБлочкам = ПакетЗапросов[8].Выбрать();
	ВыборкаПоБлочкамВсего = ПакетЗапросов[9].Выбрать();
	
	Пока ВыборкаПоШтукам.Следующий() Цикл  	
		
		ТекстОшибки = СтрШаблон("Количество отсканированных штук в блочки %1 по товару %2 не совпадает с запланированным %3",
		ВыборкаПоШтукам.КоличествоОтсканированное,ВыборкаПоШтукам.Номенклатура,ВыборкаПоШтукам.КоличествоПоПлану); 
		
		
		Результат.Ошибки.Добавить(ТекстОшибки); 		
		
	КонецЦикла;
	
	Пока ВыборкаПоБлочкам.Следующий() Цикл 		
		
		
		ТекстОшибки = СтрШаблон("Количество отсканированных блочков %1 по товару %2 не совпадает с запланированным %3",
		ВыборкаПоБлочкам.КоличествоОтсканированное,ВыборкаПоБлочкам.Номенклатура,ВыборкаПоБлочкам.КоличествоПоПлану); 
		
		
		Результат.Ошибки.Добавить(ТекстОшибки); 		
		
	КонецЦикла;
	
	Пока ВыборкаПоБлочкамВсего.Следующий() Цикл 		
		
		
		ТекстОшибки = СтрШаблон("Количество отсканированных блочков %1 ИТОГОВОЕ не совпадает с запланированным %2",
		ВыборкаПоБлочкамВсего.КоличествоОтсканированное,ВыборкаПоБлочкамВсего.КоличествоПоПлану); 
		
		
		Результат.Ошибки.Добавить(ТекстОшибки); 		
		
	КонецЦикла;
	
	Если НЕ ПроверятьКратностьКоробок 
		ИЛИ НЕ ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияКоробок Тогда
		
		Возврат; 
		
	КонецЕсли;  
	
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СодержимоеБлочка",СодержимоеБлочка);
	Запрос.УстановитьПараметр("ВсегоБлочков",ВсегоБлочков);
	Запрос.УстановитьПараметр("Коробки",Коробки);
	//++Данилова Е.В. 01.04.2026  MARK-3552 
	Если ЕстьЛП Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТКоробки.НомерКоробки КАК НомерКоробки,
		|	ВТКоробки.Количество КАК Количество,
		|	ВТКоробки.КоличествоБлочков КАК КоличествоБлочков
		|ПОМЕСТИТЬ ВТКоробки
		|ИЗ
		|	&Коробки КАК ВТКоробки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСодержимоеБлочков.Номенклатура КАК Номенклатура,
		|	ВТСодержимоеБлочков.НомерБлочка КАК НомерБлочка,
		|	ВТСодержимоеБлочков.НомерКоробки КАК НомерКоробки,
		|	ВТСодержимоеБлочков.Количество КАК КоличествоВБлочке
		|ПОМЕСТИТЬ ВТСодержимоеБлочков
		|ИЗ
		|	&СодержимоеБлочка КАК ВТСодержимоеБлочков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсегоБлочков.НомерБлочка КАК НомерБлочка,
		|	ВсегоБлочков.КоличествоБлочков КАК Количество
		|ПОМЕСТИТЬ ВТВсегоБлочков
		|ИЗ
		|	&ВсегоБлочков КАК ВсегоБлочков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСодержимоеБлочков.Номенклатура КАК Номенклатура,
		|	СУММА(ВТСодержимоеБлочков.КоличествоВБлочке * ВТВсегоБлочков.Количество * ВТКоробки.Количество) КАК ВсегоПоКоробкам
		|ПОМЕСТИТЬ ВТВсегоПоКоробкамТовараВШтуках
		|ИЗ
		|	ВТСодержимоеБлочков КАК ВТСодержимоеБлочков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВсегоБлочков КАК ВТВсегоБлочков
		|		ПО (ВТВсегоБлочков.НомерБлочка = ВТСодержимоеБлочков.НомерБлочка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоробки КАК ВТКоробки
		|		ПО (ВТКоробки.НомерКоробки = ВТСодержимоеБлочков.НомерКоробки)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСодержимоеБлочков.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСодержимоеБлочков.Номенклатура КАК Номенклатура,
		|	СУММА(ВТКоробки.Количество) КАК ВсегоПоКоробкам
		|ПОМЕСТИТЬ ВТВсегоПоКоробкамТовара
		|ИЗ
		|	ВТСодержимоеБлочков КАК ВТСодержимоеБлочков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоробки КАК ВТКоробки
		|		ПО (ВТКоробки.НомерКоробки = ВТСодержимоеБлочков.НомерКоробки)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСодержимоеБлочков.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТКоробки.Количество) КАК КоличествоКоробок
		|ПОМЕСТИТЬ ВТИтогиПоКоробкам
		|ИЗ
		|	ВТКоробки КАК ВТКоробки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛистПереукладки.КодАгрегации КАК КодАгрегацииКоробки,
		|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец КАК Номенклатура,
		|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки КАК КмШтуки
		|ПОМЕСТИТЬ ВТШККоробок
		|ИЗ
		|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладки
		|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистПереукладки.Ссылка
		|ГДЕ
		|	ЛистПереукладки.Проведен
		|	И ЛистПереукладки.ДокОснование = &РНК
		|	И ЛистПереукладки.КодАгрегации <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
		|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛистПереукладкиДок.КодАгрегации,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Владелец,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод
		|ИЗ
		|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладкиДок
		|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистПереукладкиДок.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|		ПО ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|ГДЕ
		|	ЛистПереукладкиДок.Проведен
		|	И ЛистПереукладкиДок.ДокОснование = &РНК
		|	И ЛистПереукладкиДок.КодАгрегации <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
		|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛистНабораШтрихкодыКоробокДляАгрегации.НовыйКодКоробки,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Владелец,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод
		|ИЗ
		|	Документ.ЛистПереукладки.ШтрихкодыКоробокДляАгрегации КАК ЛистНабораШтрихкодыКоробокДляАгрегации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладкиДок
		|		ПО ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка = ЛистПереукладкиДок.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|		ПО ЛистНабораШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|ГДЕ
		|	ЛистПереукладкиДок.Проведен
		|	И ЛистПереукладкиДок.ДокОснование = &РНК
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛистНабораШтрихкодыКоробокДляАгрегации.НовыйКодКоробки,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод.Владелец,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод
		|ИЗ
		|	Документ.ЛистПереукладки.ШтрихкодыКоробокДляАгрегации КАК ЛистНабораШтрихкодыКоробокДляАгрегации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладкиДок
		|		ПО ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка = ЛистПереукладкиДок.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|		ПО ЛистНабораШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1
		|		ПО (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Ссылка = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод)
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|ГДЕ
		|	ЛистПереукладкиДок.Проведен
		|	И ЛистПереукладкиДок.ДокОснование = &РНК
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТЧШтрихкодыУпаковок.ШтрихкодУпаковки,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод.Владелец,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод
		|ИЗ
		|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ТЧШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладкиДок
		|		ПО ТЧШтрихкодыУпаковок.Ссылка = ЛистПереукладкиДок.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|		ПО ТЧШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1
		|		ПО (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Ссылка)
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки.ШтрихкодыКоробокДляАгрегации КАК ШтрихкодыКоробокДляАгрегации1
		|		ПО (ШтрихкодыКоробокДляАгрегации1.Ссылка = ЛистПереукладкиДок.ЛистНабора.Ссылка)
		|ГДЕ
		|	ЛистПереукладкиДок.Проведен
		|	И ЛистПереукладкиДок.ДокОснование = &РНК
		|	И ТЧШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
		|	И ШтрихкодыКоробокДляАгрегации1.Ссылка ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТЧШтрихкодыУпаковок.ШтрихкодУпаковки,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Владелец,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод
		|ИЗ
		|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ТЧШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладкиДок
		|		ПО ТЧШтрихкодыУпаковок.Ссылка = ЛистПереукладкиДок.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|		ПО ТЧШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки.ШтрихкодыКоробокДляАгрегации КАК ШтрихкодыКоробокДляАгрегации1
		|		ПО (ШтрихкодыКоробокДляАгрегации1.Ссылка = ЛистПереукладкиДок.Ссылка)
		|ГДЕ
		|	ЛистПереукладкиДок.Проведен
		|	И ЛистПереукладкиДок.ДокОснование = &РНК
		|	И ТЧШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
		|	И ШтрихкодыКоробокДляАгрегации1.Ссылка ЕСТЬ NULL
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	КмШтуки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТВсегоПоКоробкамТовараВШтуках.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ВТВсегоПоКоробкамТовараВШтуках.ВсегоПоКоробкам) КАК КоличествоПоПлану,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КмШтуки) КАК КоличествоОтсканированное
		|ИЗ
		|	ВТВсегоПоКоробкамТовараВШтуках КАК ВТВсегоПоКоробкамТовараВШтуках
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШККоробок КАК ВТШККоробок
		|		ПО (ВТШККоробок.Номенклатура = ВТВсегоПоКоробкамТовараВШтуках.Номенклатура)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТВсегоПоКоробкамТовараВШтуках.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	МАКСИМУМ(ВТВсегоПоКоробкамТовараВШтуках.ВсегоПоКоробкам) <> КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КмШтуки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТВсегоПоКоробкамТовара.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ВТВсегоПоКоробкамТовара.ВсегоПоКоробкам) КАК КоличествоПоПлану,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КодАгрегацииКоробки) КАК КоличествоОтсканированное
		|ИЗ
		|	ВТВсегоПоКоробкамТовара КАК ВТВсегоПоКоробкамТовара
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШККоробок КАК ВТШККоробок
		|		ПО (ВТШККоробок.Номенклатура = ВТВсегоПоКоробкамТовара.Номенклатура)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТВсегоПоКоробкамТовара.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	МАКСИМУМ(ВТВсегоПоКоробкамТовара.ВсегоПоКоробкам) <> КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КодАгрегацииКоробки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТИтогиПоКоробкам.КоличествоКоробок) КАК КоличествоПоПлану,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КодАгрегацииКоробки) КАК КоличествоОтсканированное
		|ИЗ
		|	ВТИтогиПоКоробкам КАК ВТИтогиПоКоробкам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШККоробок КАК ВТШККоробок
		|		ПО (ИСТИНА)
		|
		|ИМЕЮЩИЕ
		|	МАКСИМУМ(ВТИтогиПоКоробкам.КоличествоКоробок) <> КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КодАгрегацииКоробки)";
		
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТКоробки.НомерКоробки КАК НомерКоробки,
		|	ВТКоробки.Количество КАК Количество,
		|	ВТКоробки.КоличествоБлочков КАК КоличествоБлочков
		|ПОМЕСТИТЬ ВТКоробки
		|ИЗ
		|	&Коробки КАК ВТКоробки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСодержимоеБлочков.Номенклатура КАК Номенклатура,
		|	ВТСодержимоеБлочков.НомерБлочка КАК НомерБлочка,
		|	ВТСодержимоеБлочков.НомерКоробки КАК НомерКоробки,
		|	ВТСодержимоеБлочков.Количество КАК КоличествоВБлочке
		|ПОМЕСТИТЬ ВТСодержимоеБлочков
		|ИЗ
		|	&СодержимоеБлочка КАК ВТСодержимоеБлочков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсегоБлочков.НомерБлочка КАК НомерБлочка,
		|	ВсегоБлочков.КоличествоБлочков КАК Количество
		|ПОМЕСТИТЬ ВТВсегоБлочков
		|ИЗ
		|	&ВсегоБлочков КАК ВсегоБлочков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСодержимоеБлочков.Номенклатура КАК Номенклатура,
		|	СУММА(ВТСодержимоеБлочков.КоличествоВБлочке * ВТВсегоБлочков.Количество * ВТКоробки.Количество) КАК ВсегоПоКоробкам
		|ПОМЕСТИТЬ ВТВсегоПоКоробкамТовараВШтуках
		|ИЗ
		|	ВТСодержимоеБлочков КАК ВТСодержимоеБлочков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВсегоБлочков КАК ВТВсегоБлочков
		|		ПО (ВТВсегоБлочков.НомерБлочка = ВТСодержимоеБлочков.НомерБлочка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоробки КАК ВТКоробки
		|		ПО (ВТКоробки.НомерКоробки = ВТСодержимоеБлочков.НомерКоробки)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСодержимоеБлочков.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСодержимоеБлочков.Номенклатура КАК Номенклатура,
		|	СУММА(ВТКоробки.Количество) КАК ВсегоПоКоробкам
		|ПОМЕСТИТЬ ВТВсегоПоКоробкамТовара
		|ИЗ
		|	ВТСодержимоеБлочков КАК ВТСодержимоеБлочков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоробки КАК ВТКоробки
		|		ПО (ВТКоробки.НомерКоробки = ВТСодержимоеБлочков.НомерКоробки)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСодержимоеБлочков.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТКоробки.Количество) КАК КоличествоКоробок
		|ПОМЕСТИТЬ ВТИтогиПоКоробкам
		|ИЗ
		|	ВТКоробки КАК ВТКоробки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛистНабора.КодАгрегации КАК КодАгрегацииКоробки,
		|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец КАК Номенклатура,
		|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки КАК КмШтуки
		|ПОМЕСТИТЬ ВТШККоробок
		|ИЗ
		|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
		|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
		|ГДЕ
		|	ЛистНабора.Проведен
		|	И ЛистНабора.ДокОснование = &РНК
		|	И ЛистНабора.КодАгрегации <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
		|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛистНабора.КодАгрегации,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Владелец,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод
		|ИЗ
		|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
		|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|		ПО ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|ГДЕ
		|	ЛистНабора.Проведен
		|	И ЛистНабора.ДокОснование = &РНК
		|	И ЛистНабора.КодАгрегации <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
		|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛистНабораШтрихкодыКоробокДляАгрегации.НовыйКодКоробки,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Владелец,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод
		|ИЗ
		|	Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ЛистНабораШтрихкодыКоробокДляАгрегации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
		|		ПО ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка = ЛистНабора.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|		ПО ЛистНабораШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|ГДЕ
		|	ЛистНабора.Проведен
		|	И ЛистНабора.ДокОснование = &РНК
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛистНабораШтрихкодыКоробокДляАгрегации.НовыйКодКоробки,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод.Владелец,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод
		|ИЗ
		|	Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ЛистНабораШтрихкодыКоробокДляАгрегации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистПереукладкиДок
		|		ПО ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка = ЛистПереукладкиДок.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|		ПО ЛистНабораШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1
		|		ПО (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Ссылка = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод)
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|ГДЕ
		|	ЛистПереукладкиДок.Проведен
		|	И ЛистПереукладкиДок.ДокОснование = &РНК
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТЧШтрихкодыУпаковок.ШтрихкодУпаковки,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод.Владелец,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод
		|ИЗ
		|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ТЧШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
		|		ПО ТЧШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|		ПО ТЧШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1
		|		ПО (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Ссылка)
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ШтрихкодыКоробокДляАгрегации1
		|		ПО (ШтрихкодыКоробокДляАгрегации1.Ссылка = ЛистНабора.Ссылка)
		|ГДЕ
		|	ЛистНабора.Проведен
		|	И ЛистНабора.ДокОснование = &РНК
		|	И ТЧШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
		|	И ШтрихкодыКоробокДляАгрегации1.Ссылка ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТЧШтрихкодыУпаковок.ШтрихкодУпаковки,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Владелец,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод
		|ИЗ
		|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ТЧШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
		|		ПО ТЧШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|		ПО ТЧШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ШтрихкодыКоробокДляАгрегации1
		|		ПО (ШтрихкодыКоробокДляАгрегации1.Ссылка = ЛистНабора.Ссылка)
		|ГДЕ
		|	ЛистНабора.Проведен
		|	И ЛистНабора.ДокОснование = &РНК
		|	И ТЧШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
		|	И ШтрихкодыКоробокДляАгрегации1.Ссылка ЕСТЬ NULL
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	КмШтуки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТВсегоПоКоробкамТовараВШтуках.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ВТВсегоПоКоробкамТовараВШтуках.ВсегоПоКоробкам) КАК КоличествоПоПлану,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КмШтуки) КАК КоличествоОтсканированное
		|ИЗ
		|	ВТВсегоПоКоробкамТовараВШтуках КАК ВТВсегоПоКоробкамТовараВШтуках
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШККоробок КАК ВТШККоробок
		|		ПО (ВТШККоробок.Номенклатура = ВТВсегоПоКоробкамТовараВШтуках.Номенклатура)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТВсегоПоКоробкамТовараВШтуках.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	МАКСИМУМ(ВТВсегоПоКоробкамТовараВШтуках.ВсегоПоКоробкам) <> КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КмШтуки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТВсегоПоКоробкамТовара.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ВТВсегоПоКоробкамТовара.ВсегоПоКоробкам) КАК КоличествоПоПлану,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КодАгрегацииКоробки) КАК КоличествоОтсканированное
		|ИЗ
		|	ВТВсегоПоКоробкамТовара КАК ВТВсегоПоКоробкамТовара
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШККоробок КАК ВТШККоробок
		|		ПО (ВТШККоробок.Номенклатура = ВТВсегоПоКоробкамТовара.Номенклатура)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТВсегоПоКоробкамТовара.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	МАКСИМУМ(ВТВсегоПоКоробкамТовара.ВсегоПоКоробкам) <> КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КодАгрегацииКоробки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТИтогиПоКоробкам.КоличествоКоробок) КАК КоличествоПоПлану,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КодАгрегацииКоробки) КАК КоличествоОтсканированное
		|ИЗ
		|	ВТИтогиПоКоробкам КАК ВТИтогиПоКоробкам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШККоробок КАК ВТШККоробок
		|		ПО (ИСТИНА)
		|
		|ИМЕЮЩИЕ
		|	МАКСИМУМ(ВТИтогиПоКоробкам.КоличествоКоробок) <> КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КодАгрегацииКоробки)";
		
	КонецЕсли;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ВТКоробки.НомерКоробки КАК НомерКоробки,
	//	|	ВТКоробки.Количество КАК Количество,
	//	|	ВТКоробки.КоличествоБлочков КАК КоличествоБлочков
	//	|ПОМЕСТИТЬ ВТКоробки
	//	|ИЗ
	//	|	&Коробки КАК ВТКоробки
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТСодержимоеБлочков.Номенклатура КАК Номенклатура,
	//	|	ВТСодержимоеБлочков.НомерБлочка КАК НомерБлочка,
	//	|	ВТСодержимоеБлочков.НомерКоробки КАК НомерКоробки,
	//	|	ВТСодержимоеБлочков.Количество КАК КоличествоВБлочке
	//	|ПОМЕСТИТЬ ВТСодержимоеБлочков
	//	|ИЗ
	//	|	&СодержимоеБлочка КАК ВТСодержимоеБлочков
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВсегоБлочков.НомерБлочка КАК НомерБлочка,
	//	|	ВсегоБлочков.КоличествоБлочков КАК Количество
	//	|ПОМЕСТИТЬ ВТВсегоБлочков
	//	|ИЗ
	//	|	&ВсегоБлочков КАК ВсегоБлочков
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТСодержимоеБлочков.Номенклатура КАК Номенклатура,
	//	|	СУММА(ВТСодержимоеБлочков.КоличествоВБлочке * ВТВсегоБлочков.Количество * ВТКоробки.Количество) КАК ВсегоПоКоробкам
	//	|ПОМЕСТИТЬ ВТВсегоПоКоробкамТовараВШтуках
	//	|ИЗ
	//	|	ВТСодержимоеБлочков КАК ВТСодержимоеБлочков
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВсегоБлочков КАК ВТВсегоБлочков
	//	|		ПО (ВТВсегоБлочков.НомерБлочка = ВТСодержимоеБлочков.НомерБлочка)
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоробки КАК ВТКоробки
	//	|		ПО (ВТКоробки.НомерКоробки = ВТСодержимоеБлочков.НомерКоробки)
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВТСодержимоеБлочков.Номенклатура
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТСодержимоеБлочков.Номенклатура КАК Номенклатура,
	//	|	СУММА(ВТКоробки.Количество) КАК ВсегоПоКоробкам
	//	|ПОМЕСТИТЬ ВТВсегоПоКоробкамТовара
	//	|ИЗ
	//	|	ВТСодержимоеБлочков КАК ВТСодержимоеБлочков
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоробки КАК ВТКоробки
	//	|		ПО (ВТКоробки.НомерКоробки = ВТСодержимоеБлочков.НомерКоробки)
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВТСодержимоеБлочков.Номенклатура
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	СУММА(ВТКоробки.Количество) КАК КоличествоКоробок
	//	|ПОМЕСТИТЬ ВТИтогиПоКоробкам
	//	|ИЗ
	//	|	ВТКоробки КАК ВТКоробки
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ЛистНабора.КодАгрегации КАК КодАгрегацииКоробки,
	//	|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец КАК Номенклатура,
	//	|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки КАК КмШтуки
	//	|ПОМЕСТИТЬ ВТШККоробок
	//	|ИЗ
	//	|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
	//	|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
	//	|ГДЕ
	//	|	ЛистНабора.Проведен
	//	|	И ЛистНабора.ДокОснование = &РНК
	//	|	И ЛистНабора.КодАгрегации <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	//	|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ЛистПереукладки.КодАгрегации,
	//	|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец,
	//	|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки
	//	|ИЗ
	//	|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладки
	//	|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистПереукладки.Ссылка
	//	|ГДЕ
	//	|	ЛистПереукладки.Проведен
	//	|	И ЛистПереукладки.ДокОснование = &РНК
	//	|	И ЛистПереукладки.КодАгрегации <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	//	|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ЛистНабора.КодАгрегации,
	//	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Владелец,
	//	|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки
	//	|ИЗ
	//	|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
	//	|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//	|		ПО ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	//	|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
	//	|ГДЕ
	//	|	ЛистНабора.Проведен
	//	|	И ЛистНабора.ДокОснование = &РНК
	//	|	И ЛистНабора.КодАгрегации <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	//	|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ЛистПереукладкиДок.КодАгрегации,
	//	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Владелец,
	//	|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки
	//	|ИЗ
	//	|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладкиДок
	//	|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистПереукладкиДок.Ссылка
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//	|		ПО ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	//	|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
	//	|ГДЕ
	//	|	ЛистПереукладкиДок.Проведен
	//	|	И ЛистПереукладкиДок.ДокОснование = &РНК
	//	|	И ЛистПереукладкиДок.КодАгрегации <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	//	|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ЛистНабораШтрихкодыКоробокДляАгрегации.НовыйКодКоробки,
	//	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Владелец,
	//	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод
	//	|ИЗ
	//	|	Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ЛистНабораШтрихкодыКоробокДляАгрегации
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
	//	|		ПО ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка = ЛистНабора.Ссылка
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//	|		ПО ЛистНабораШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	//	|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
	//	|ГДЕ
	//	|	ЛистНабора.Проведен
	//	|	И ЛистНабора.ДокОснование = &РНК
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ЛистНабораШтрихкодыКоробокДляАгрегации.НовыйКодКоробки,
	//	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Владелец,
	//	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод
	//	|ИЗ
	//	|	Документ.ЛистПереукладки.ШтрихкодыКоробокДляАгрегации КАК ЛистНабораШтрихкодыКоробокДляАгрегации
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладкиДок
	//	|		ПО ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка = ЛистПереукладкиДок.Ссылка
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//	|		ПО ЛистНабораШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	//	|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
	//	|ГДЕ
	//	|	ЛистПереукладкиДок.ЛистНабора.Проведен
	//	|	И ЛистПереукладкиДок.ЛистНабора.ДокОснование = &РНК
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ТЧШтрихкодыУпаковок.ШтрихкодУпаковки,
	//	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод.Владелец,
	//	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод
	//	|ИЗ
	//	|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ТЧШтрихкодыУпаковок
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
	//	|		ПО ТЧШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//	|		ПО ТЧШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	//	|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок))
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1
	//	|		ПО (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Ссылка)
	//	|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ШтрихкодыКоробокДляАгрегации1
	//	|		ПО (ШтрихкодыКоробокДляАгрегации1.Ссылка = ЛистНабора.Ссылка)
	//	|ГДЕ
	//	|	ЛистНабора.Проведен
	//	|	И ЛистНабора.ДокОснование = &РНК
	//	|	И ТЧШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
	//	|	И ШтрихкодыКоробокДляАгрегации1.Ссылка ЕСТЬ NULL
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ТЧШтрихкодыУпаковок.ШтрихкодУпаковки,
	//	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод.Владелец,
	//	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод
	//	|ИЗ
	//	|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ТЧШтрихкодыУпаковок
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладкиДок
	//	|		ПО ТЧШтрихкодыУпаковок.Ссылка = ЛистПереукладкиДок.Ссылка
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//	|		ПО ТЧШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	//	|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок))
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1
	//	|		ПО (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Ссылка)
	//	|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки.ШтрихкодыКоробокДляАгрегации КАК ШтрихкодыКоробокДляАгрегации1
	//	|		ПО (ШтрихкодыКоробокДляАгрегации1.Ссылка = ЛистПереукладкиДок.ЛистНабора.Ссылка)
	//	|ГДЕ
	//	|	ЛистПереукладкиДок.Проведен
	//	|	И ЛистПереукладкиДок.ДокОснование = &РНК
	//	|	И ТЧШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
	//	|	И ШтрихкодыКоробокДляАгрегации1.Ссылка ЕСТЬ NULL
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ТЧШтрихкодыУпаковок.ШтрихкодУпаковки,
	//	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Владелец,
	//	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод
	//	|ИЗ
	//	|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ТЧШтрихкодыУпаковок
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
	//	|		ПО ТЧШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//	|		ПО ТЧШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	//	|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ШтрихкодыКоробокДляАгрегации1
	//	|		ПО (ШтрихкодыКоробокДляАгрегации1.Ссылка = ЛистНабора.Ссылка)
	//	|ГДЕ
	//	|	ЛистНабора.Проведен
	//	|	И ЛистНабора.ДокОснование = &РНК
	//	|	И ТЧШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
	//	|	И ШтрихкодыКоробокДляАгрегации1.Ссылка ЕСТЬ NULL
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ТЧШтрихкодыУпаковок.ШтрихкодУпаковки,
	//	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Владелец,
	//	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод
	//	|ИЗ
	//	|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ТЧШтрихкодыУпаковок
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладкиДок
	//	|		ПО ТЧШтрихкодыУпаковок.Ссылка = ЛистПереукладкиДок.Ссылка
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//	|		ПО ТЧШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	//	|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки.ШтрихкодыКоробокДляАгрегации КАК ШтрихкодыКоробокДляАгрегации1
	//	|		ПО (ШтрихкодыКоробокДляАгрегации1.Ссылка = ЛистПереукладкиДок.ЛистНабора.Ссылка)
	//	|ГДЕ
	//	|	ЛистПереукладкиДок.Проведен
	//	|	И ЛистПереукладкиДок.ДокОснование = &РНК
	//	|	И ТЧШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
	//	|	И ШтрихкодыКоробокДляАгрегации1.Ссылка ЕСТЬ NULL
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТВсегоПоКоробкамТовараВШтуках.Номенклатура КАК Номенклатура,
	//	|	МАКСИМУМ(ВТВсегоПоКоробкамТовараВШтуках.ВсегоПоКоробкам) КАК КоличествоПоПлану,
	//	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КмШтуки) КАК КоличествоОтсканированное
	//	|ИЗ
	//	|	ВТВсегоПоКоробкамТовараВШтуках КАК ВТВсегоПоКоробкамТовараВШтуках
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШККоробок КАК ВТШККоробок
	//	|		ПО (ВТШККоробок.Номенклатура = ВТВсегоПоКоробкамТовараВШтуках.Номенклатура)
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВТВсегоПоКоробкамТовараВШтуках.Номенклатура
	//	|
	//	|ИМЕЮЩИЕ
	//	|	МАКСИМУМ(ВТВсегоПоКоробкамТовараВШтуках.ВсегоПоКоробкам) <> КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КмШтуки)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТВсегоПоКоробкамТовара.Номенклатура КАК Номенклатура,
	//	|	МАКСИМУМ(ВТВсегоПоКоробкамТовара.ВсегоПоКоробкам) КАК КоличествоПоПлану,
	//	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КодАгрегацииКоробки) КАК КоличествоОтсканированное
	//	|ИЗ
	//	|	ВТВсегоПоКоробкамТовара КАК ВТВсегоПоКоробкамТовара
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШККоробок КАК ВТШККоробок
	//	|		ПО (ВТШККоробок.Номенклатура = ВТВсегоПоКоробкамТовара.Номенклатура)
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВТВсегоПоКоробкамТовара.Номенклатура
	//	|
	//	|ИМЕЮЩИЕ
	//	|	МАКСИМУМ(ВТВсегоПоКоробкамТовара.ВсегоПоКоробкам) <> КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КодАгрегацииКоробки)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	МАКСИМУМ(ВТИтогиПоКоробкам.КоличествоКоробок) КАК КоличествоПоПлану,
	//	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КодАгрегацииКоробки) КАК КоличествоОтсканированное
	//	|ИЗ
	//	|	ВТИтогиПоКоробкам КАК ВТИтогиПоКоробкам
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШККоробок КАК ВТШККоробок
	//	|		ПО (ИСТИНА)
	//	|
	//	|ИМЕЮЩИЕ
	//	|	МАКСИМУМ(ВТИтогиПоКоробкам.КоличествоКоробок) <> КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КодАгрегацииКоробки)";
	//--Данилова Е.В. 01.04.2026
	Запрос.УстановитьПараметр("РНК", РНК);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет(); 
	
	ВыборкаПоШтукам = ПакетЗапросов[7].Выбрать();
	ВыборкаПоКоробкам = ПакетЗапросов[8].Выбрать();
	ВыборкаПоКоробкамВсего = ПакетЗапросов[9].Выбрать();
	
	Пока ВыборкаПоШтукам.Следующий() Цикл 		
		
		ТекстОшибки = СтрШаблон("Количество отсканированных штук в коробки %1 по товару %2 не совпадает с запланированным %3",
		ВыборкаПоШтукам.КоличествоОтсканированное,ВыборкаПоШтукам.Номенклатура,ВыборкаПоШтукам.КоличествоПоПлану); 
		
		
		Результат.Ошибки.Добавить(ТекстОшибки); 		
		
	КонецЦикла;
	
	Пока ВыборкаПоКоробкам.Следующий() Цикл 		
		
		
		ТекстОшибки = СтрШаблон("Количество отсканированных коробов %1 по товару %2 не совпадает с запланированным %3",
		ВыборкаПоКоробкам.КоличествоОтсканированное,ВыборкаПоКоробкам.Номенклатура,ВыборкаПоКоробкам.КоличествоПоПлану); 
		
		
		Результат.Ошибки.Добавить(ТекстОшибки); 		
		
	КонецЦикла;
	
	Пока ВыборкаПоКоробкамВсего.Следующий() Цикл 		
		
		ТекстОшибки = СтрШаблон("Количество отсканированных коробов %1 ИТОГОВОЕ не совпадает с запланированным %2",
		ВыборкаПоКоробкамВсего.КоличествоОтсканированное,ВыборкаПоКоробкамВсего.КоличествоПоПлану); 
		
		
		Результат.Ошибки.Добавить(ТекстОшибки); 		
		
	КонецЦикла;
	
	
	
КонецПроцедуры// () 

Процедура КонтрольКоличестваКоробов(Результат, Знач РНК,ТаблицаМатрицы,ПравилаРаботыСАгрегациейЧЗ = неопределено,ЕстьЛП = Неопределено) Экспорт
	
	//++Данилова Е.В. 21.04.2026 MARK-3552
	//ПроверятьКратностьКоробок = ПолучитьРеквизитШапки(РНК,"Контрагент.ПроверятьКратностьКоробок"); 
	//
	//Если НЕ ПроверятьКратностьКоробок Тогда
	//	
	//	Возврат; 	
	//	
	//КонецЕсли;
	//--Данилова Е.В. 21.04.2026
	Если ПравилаРаботыСАгрегациейЧЗ = Неопределено Тогда
		
		ПравилаРаботыСАгрегациейЧЗ=МаркировкаКС.ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладной(РНК);  	
		
	КонецЕсли;
	
	Если НЕ ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияКоробок Тогда
		
		Возврат;  	
		
	КонецЕсли;
	
	//++Данилова Е.В. 21.04.2026 MARK-3552 
	Если ТаблицаМатрицы.Количество() = 0
		ИЛИ ТаблицаМатрицы.Итог("КратностьКоробки") = 0 Тогда
	
		Возврат;	
	
	КонецЕсли;
	//--Данилова Е.В. 21.04.2026 
	
	Запрос = Новый Запрос; 
	Запрос.Текст = 
	
	
	"ВЫБРАТЬ
	|	РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	|	СУММА(РасходнаяНакладнаяТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТТовары
	|ИЗ
	|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|		ПО РасходнаяНакладнаяТовары.Ссылка = РасходнаяНакладная.Ссылка
	|ГДЕ
	|	РасходнаяНакладная.Ссылка = &РНК
	|	И РасходнаяНакладнаяТовары.Количество > 0
	|	И РасходнаяНакладнаяТовары.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|	И РасходнаяНакладнаяТовары.ТребуетсяМаркировка
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходнаяНакладнаяТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТМатрица.Номенклатура КАК Номенклатура,
	|	ВТМатрица.АртикулКонтрагента КАК АртикулКонтрагента,
	|	ВТМатрица.КратностьКоробки КАК КратностьКоробки
	|ПОМЕСТИТЬ ВТМатрица
	|ИЗ
	|	&ТЧМатрица КАК ВТМатрица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТовары.Номенклатура КАК Номенклатура,
	|	ВТТовары.Количество КАК Количество,
	|	ВТМатрица.АртикулКонтрагента КАК АртикулКонтрагента,
	|	ВТМатрица.КратностьКоробки КАК КратностьКоробки
	|ИЗ
	|	ВТТовары КАК ВТТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМатрица КАК ВТМатрица
	|		ПО ВТТовары.Номенклатура = ВТМатрица.Номенклатура"; 
	Запрос.УстановитьПараметр("РНК",РНК);
	Запрос.УстановитьПараметр("ТЧМатрица",ТаблицаМатрицы);
	ТаблицаМатрицыПоРНК = Запрос.Выполнить().Выгрузить(); 
	
	ТаблицаМатрицыПоРНКПолная =  ТаблицаМатрицыПоРНК.Скопировать(); 
	
	ТаблицаМатрицыПоРНК.Свернуть("АртикулКонтрагента,КратностьКоробки","Количество");
	
	ТЗСодержимоеКоробовТоваров =новый ТаблицаЗначений;
	ТЗСодержимоеКоробовТоваров.Колонки.Добавить("Номенклатура", новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗСодержимоеКоробовТоваров.Колонки.Добавить("Количество", новый ОписаниеТипов("Число"));
	ТЗСодержимоеКоробовТоваров.Колонки.Добавить("КоличествоКоробок", новый ОписаниеТипов("Число"));
	ТЗСодержимоеКоробовТоваров.Колонки.Добавить("КоличествоВРНК", новый ОписаниеТипов("Число"));
	
	ТЗСодержимоеКоробов =новый ТаблицаЗначений;
	ТЗСодержимоеКоробов.Колонки.Добавить("Номенклатура", новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗСодержимоеКоробов.Колонки.Добавить("Количество", новый ОписаниеТипов("Число"));
	ТЗСодержимоеКоробов.Колонки.Добавить("КоличествоКоробок", новый ОписаниеТипов("Число"));
	
	
	ВсегоКоличествоКоробок = 0; 
	для каждого СтрТЗСверн из ТаблицаМатрицыПоРНК цикл
		
		НомЛП = ТаблицаМатрицыПоРНКПолная.НайтиСтроки(новый Структура("АртикулКонтрагента",СтрТЗСверн.АртикулКонтрагента));
		КолКоробов = СтрТЗСверн.Количество/СтрТЗСверн.КратностьКоробки;
		
		ВсегоКоличествоКоробок = ВсегоКоличествоКоробок + КолКоробов; 
		если Цел(КолКоробов) <> КолКоробов тогда   
			КолКоробов = Цел(КолКоробов)+1;
		КонецЕсли;    
		
		для каждого СтрМасс из НомЛП цикл
			СтрТЗ 				= ТЗСодержимоеКоробовТоваров.Добавить();
			СтрТЗ.Номенклатура	= СтрМасс.Номенклатура;
			СтрТЗ.КоличествоКоробок	= СтрМасс.количество/СтрТЗСверн.КратностьКоробки;
			СтрТЗ.Количество	= СтрМасс.количество/СтрТЗ.КоличествоКоробок;  		
			СтрТз.КоличествоВРНК = СтрМасс.количество; 
		КонецЦикла;		
		
	КонецЦикла; 
	
	Если ТЗСодержимоеКоробовТоваров.Количество() = 0 Тогда 
		
		Сообщить("По матрице ничего не найдено"); 
		
		Возврат; 	
		
	КонецЕсли;
	
	
	ЭтоFBS = Ложь; 
	
	
	Запрос = Новый Запрос; 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Вложенныйзапрос.Продукция КАК Продукция,
	|	Вложенныйзапрос.Номенклатура КАК Номенклатура,
	|	СУММА(ЕСТЬNULL(Вложенныйзапрос.Количество, 0)) КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасходнаяНакладнаяТовары.Номенклатура КАК Продукция,
	|		РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	|		СУММА(РасходнаяНакладнаяТовары.Количество) КАК Количество
	|	ИЗ
	|		Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|			ПО РасходнаяНакладнаяТовары.Ссылка = РасходнаяНакладная.Ссылка
	|	ГДЕ
	|		РасходнаяНакладная.Ссылка = &РНК
	|		И РасходнаяНакладнаяТовары.Количество > 0
	|		И РасходнаяНакладнаяТовары.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|		И (НЕ РасходнаяНакладная.ОтгрузкаКомплектов
	|				ИЛИ &ЭтоFBS)
	|		И РасходнаяНакладнаяТовары.ТребуетсяМаркировка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РасходнаяНакладнаяТовары.Номенклатура,
	|		РасходнаяНакладнаяТовары.Номенклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасходнаяНакладнаяТовары.Продукция,
	|		РасходнаяНакладнаяТовары.Номенклатура,
	|		СУММА(РасходнаяНакладнаяТовары.Количество)
	|	ИЗ
	|		Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|			ПО РасходнаяНакладнаяТовары.Ссылка = РасходнаяНакладная.Ссылка
	|	ГДЕ
	|		РасходнаяНакладная.Ссылка = &РНК
	|		И РасходнаяНакладнаяТовары.Количество > 0
	|		И РасходнаяНакладнаяТовары.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|		И РасходнаяНакладная.ОтгрузкаКомплектов
	|		И НЕ &ЭтоFBS
	|		И РасходнаяНакладнаяТовары.ТребуетсяМаркировка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РасходнаяНакладнаяТовары.Номенклатура,
	|		РасходнаяНакладнаяТовары.Продукция) КАК Вложенныйзапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	Вложенныйзапрос.Номенклатура,
	|	Вложенныйзапрос.Продукция"; 	
	Запрос.УстановитьПараметр("РНК",РНК);
	Запрос.УстановитьПараметр("ЭтоFBS",ЭтоFBS);
	ТЗТовары = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаТЧ Из ТЗТовары Цикл
		
		Отбор = Новый Структура("Номенклатура",СтрокаТЧ.Продукция);	
		СтрокиНайденные = ТЗСодержимоеКоробовТоваров.НайтиСтроки(Отбор);
		
		Если СтрокиНайденные.Количество() > 0  Тогда
			
			КоличествоКоробок =  СтрокиНайденные[0].КоличествоКоробок; 
			КоличествоВРНКПродукции =  СтрокиНайденные[0].КоличествоВРНК; 
			КоличествоПродукцииВКоробке =  СтрокиНайденные[0].Количество; 
			
			
			ВидКомплекта= ПолучитьРеквизитОбъекта(СтрокаТЧ.Продукция,"ВидКомплекта");
			Если ВидКомплекта = Перечисления.ВидыКомплектов.Ассортито Тогда   				
				КоличествоВКоробке = Цел(СтрокаТЧ.Количество/КоличествоКоробок);	 
				
			Иначе  			
				
				КратностьКомплект = СтрокаТЧ.Количество/КоличествоВРНКПродукции; 
				
				КоличествоВКоробке = КоличествоПродукцииВКоробке * КратностьКомплект; 	
				
			КонецЕсли;  			
			
			НоваяСтрокаСодер = ТЗСодержимоеКоробов.Добавить(); 
			
			НоваяСтрокаСодер.Количество = КоличествоВКоробке; 
			НоваяСтрокаСодер.КоличествоКоробок = КоличествоКоробок; 
			НоваяСтрокаСодер.Номенклатура = СтрокаТЧ.Номенклатура;	
			
		КонецЕсли;
		
	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
	Запрос.УстановитьПараметр("ТЗСодержимоеКоробов",ТЗСодержимоеКоробов);
	Запрос.УстановитьПараметр("ТЗСодержимоеКоробовПродукции",ТЗСодержимоеКоробовТоваров); 
	//++Данилова Е.В. 01.04.2026  MARK-3552 
	Если ЕстьЛП = Неопределено Тогда 
		ЕстьЛП = ЕстьЛПСКодамиЧЗ(РНК); 
	КонецЕсли;
	Если ЕстьЛП  Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТКоробки.Номенклатура КАК Номенклатура,
		|	ВТКоробки.Количество КАК Количество,
		|	ВТКоробки.КоличествоКоробок КАК КоличествоКоробок
		|ПОМЕСТИТЬ ВТКоробки
		|ИЗ
		|	&ТЗСодержимоеКоробов КАК ВТКоробки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТКоробки.Номенклатура КАК Номенклатура,
		|	ВТКоробки.Количество КАК Количество,
		|	ВТКоробки.КоличествоКоробок КАК КоличествоКоробок
		|ПОМЕСТИТЬ ВТКоробкиПродукции
		|ИЗ
		|	&ТЗСодержимоеКоробовПродукции КАК ВТКоробки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТКоробки.Номенклатура КАК Номенклатура,
		|	СУММА(ВТКоробки.КоличествоКоробок * ВТКоробки.Количество) КАК ВсегоПоКоробкам
		|ПОМЕСТИТЬ ВТВсегоПоКоробкамТовараВШтуках
		|ИЗ
		|	ВТКоробки КАК ВТКоробки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТКоробки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТКоробки.Номенклатура КАК Номенклатура,
		|	СУММА(ВТКоробки.КоличествоКоробок) КАК ВсегоПоКоробкам
		|ПОМЕСТИТЬ ВТВсегоПоКоробкамТовара
		|ИЗ
		|	ВТКоробки КАК ВТКоробки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТКоробки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТКоробки.КоличествоКоробок) КАК КоличествоКоробок
		|ПОМЕСТИТЬ ВТИтогиПоКоробкам
		|ИЗ
		|	ВТКоробкиПродукции КАК ВТКоробки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛистПереукладки.КодАгрегации КАК КодАгрегацииКоробки,
		|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец КАК Номенклатура,
		|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки КАК КмШтуки
		|ПОМЕСТИТЬ ВТШККоробок
		|ИЗ
		|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладки
		|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистПереукладки.Ссылка
		|ГДЕ
		|	ЛистПереукладки.Проведен
		|	И ЛистПереукладки.ДокОснование = &РНК
		|	И ЛистПереукладки.КодАгрегации <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
		|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛистПереукладкиДок.КодАгрегации,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Владелец,
		|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки
		|ИЗ
		|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладкиДок
		|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистПереукладкиДок.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|		ПО ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|ГДЕ
		|	ЛистПереукладкиДок.Проведен
		|	И ЛистПереукладкиДок.ДокОснование = &РНК
		|	И ЛистПереукладкиДок.КодАгрегации <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
		|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛистНабораШтрихкодыКоробокДляАгрегации.НовыйКодКоробки,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Владелец,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод
		|ИЗ
		|	Документ.ЛистПереукладки.ШтрихкодыКоробокДляАгрегации КАК ЛистНабораШтрихкодыКоробокДляАгрегации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладкиДок
		|		ПО ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка = ЛистПереукладкиДок.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|		ПО ЛистНабораШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|ГДЕ
		|	ЛистПереукладкиДок.Проведен
		|	И ЛистПереукладкиДок.ДокОснование = &РНК
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТЧШтрихкодыУпаковок.ШтрихкодУпаковки,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод.Владелец,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод
		|ИЗ
		|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ТЧШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладкиДок
		|		ПО ТЧШтрихкодыУпаковок.Ссылка = ЛистПереукладкиДок.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|		ПО ТЧШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1
		|		ПО (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Ссылка)
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки.ШтрихкодыКоробокДляАгрегации КАК ШтрихкодыКоробокДляАгрегации1
		|		ПО (ШтрихкодыКоробокДляАгрегации1.Ссылка = ЛистПереукладкиДок.ЛистНабора.Ссылка)
		|ГДЕ
		|	ЛистПереукладкиДок.Проведен
		|	И ЛистПереукладкиДок.ДокОснование = &РНК
		|	И ТЧШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
		|	И ШтрихкодыКоробокДляАгрегации1.Ссылка ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТЧШтрихкодыУпаковок.ШтрихкодУпаковки,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Владелец,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод
		|ИЗ
		|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ТЧШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладкиДок
		|		ПО ТЧШтрихкодыУпаковок.Ссылка = ЛистПереукладкиДок.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|		ПО ТЧШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки.ШтрихкодыКоробокДляАгрегации КАК ШтрихкодыКоробокДляАгрегации1
		|		ПО (ШтрихкодыКоробокДляАгрегации1.Ссылка = ЛистПереукладкиДок.ЛистНабора.Ссылка)
		|ГДЕ
		|	ЛистПереукладкиДок.Проведен
		|	И ЛистПереукладкиДок.ДокОснование = &РНК
		|	И ТЧШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
		|	И ШтрихкодыКоробокДляАгрегации1.Ссылка ЕСТЬ NULL
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	КмШтуки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТВсегоПоКоробкамТовараВШтуках.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ВТВсегоПоКоробкамТовараВШтуках.ВсегоПоКоробкам) КАК КоличествоПоПлану,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КмШтуки) КАК КоличествоОтсканированное
		|ИЗ
		|	ВТВсегоПоКоробкамТовараВШтуках КАК ВТВсегоПоКоробкамТовараВШтуках
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШККоробок КАК ВТШККоробок
		|		ПО (ВТШККоробок.Номенклатура = ВТВсегоПоКоробкамТовараВШтуках.Номенклатура)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТВсегоПоКоробкамТовараВШтуках.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	МАКСИМУМ(ВТВсегоПоКоробкамТовараВШтуках.ВсегоПоКоробкам) <> КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КмШтуки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТВсегоПоКоробкамТовара.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ВТВсегоПоКоробкамТовара.ВсегоПоКоробкам) КАК КоличествоПоПлану,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КодАгрегацииКоробки) КАК КоличествоОтсканированное
		|ИЗ
		|	ВТВсегоПоКоробкамТовара КАК ВТВсегоПоКоробкамТовара
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШККоробок КАК ВТШККоробок
		|		ПО (ВТШККоробок.Номенклатура = ВТВсегоПоКоробкамТовара.Номенклатура)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТВсегоПоКоробкамТовара.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	МАКСИМУМ(ВТВсегоПоКоробкамТовара.ВсегоПоКоробкам) <> КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КодАгрегацииКоробки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТИтогиПоКоробкам.КоличествоКоробок) КАК КоличествоПоПлану,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КодАгрегацииКоробки) КАК КоличествоОтсканированное
		|ИЗ
		|	ВТИтогиПоКоробкам КАК ВТИтогиПоКоробкам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШККоробок КАК ВТШККоробок
		|		ПО (ИСТИНА)
		|
		|ИМЕЮЩИЕ
		|	МАКСИМУМ(ВТИтогиПоКоробкам.КоличествоКоробок) <> КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КодАгрегацииКоробки)";
		
	Иначе 
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТКоробки.Номенклатура КАК Номенклатура,
		|	ВТКоробки.Количество КАК Количество,
		|	ВТКоробки.КоличествоКоробок КАК КоличествоКоробок
		|ПОМЕСТИТЬ ВТКоробки
		|ИЗ
		|	&ТЗСодержимоеКоробов КАК ВТКоробки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТКоробки.Номенклатура КАК Номенклатура,
		|	ВТКоробки.Количество КАК Количество,
		|	ВТКоробки.КоличествоКоробок КАК КоличествоКоробок
		|ПОМЕСТИТЬ ВТКоробкиПродукции
		|ИЗ
		|	&ТЗСодержимоеКоробовПродукции КАК ВТКоробки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТКоробки.Номенклатура КАК Номенклатура,
		|	СУММА(ВТКоробки.КоличествоКоробок * ВТКоробки.Количество) КАК ВсегоПоКоробкам
		|ПОМЕСТИТЬ ВТВсегоПоКоробкамТовараВШтуках
		|ИЗ
		|	ВТКоробки КАК ВТКоробки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТКоробки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТКоробки.Номенклатура КАК Номенклатура,
		|	СУММА(ВТКоробки.КоличествоКоробок) КАК ВсегоПоКоробкам
		|ПОМЕСТИТЬ ВТВсегоПоКоробкамТовара
		|ИЗ
		|	ВТКоробки КАК ВТКоробки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТКоробки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТКоробки.КоличествоКоробок) КАК КоличествоКоробок
		|ПОМЕСТИТЬ ВТИтогиПоКоробкам
		|ИЗ
		|	ВТКоробкиПродукции КАК ВТКоробки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛистНабора.КодАгрегации КАК КодАгрегацииКоробки,
		|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец КАК Номенклатура,
		|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки КАК КмШтуки
		|ПОМЕСТИТЬ ВТШККоробок
		|ИЗ
		|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
		|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
		|ГДЕ
		|	ЛистНабора.Проведен
		|	И ЛистНабора.ДокОснование = &РНК
		|	И ЛистНабора.КодАгрегации <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
		|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛистНабора.КодАгрегации,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Владелец,
		|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки
		|ИЗ
		|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
		|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|		ПО ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|ГДЕ
		|	ЛистНабора.Проведен
		|	И ЛистНабора.ДокОснование = &РНК
		|	И ЛистНабора.КодАгрегации <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
		|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛистНабораШтрихкодыКоробокДляАгрегации.НовыйКодКоробки,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Владелец,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод
		|ИЗ
		|	Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ЛистНабораШтрихкодыКоробокДляАгрегации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
		|		ПО ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка = ЛистНабора.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|		ПО ЛистНабораШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|ГДЕ
		|	ЛистНабора.Проведен
		|	И ЛистНабора.ДокОснование = &РНК
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТЧШтрихкодыУпаковок.ШтрихкодУпаковки,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод.Владелец,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод
		|ИЗ
		|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ТЧШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
		|		ПО ТЧШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|		ПО ТЧШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1
		|		ПО (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Ссылка)
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ШтрихкодыКоробокДляАгрегации1
		|		ПО (ШтрихкодыКоробокДляАгрегации1.Ссылка = ЛистНабора.Ссылка)
		|ГДЕ
		|	ЛистНабора.Проведен
		|	И ЛистНабора.ДокОснование = &РНК
		|	И ТЧШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
		|	И ШтрихкодыКоробокДляАгрегации1.Ссылка ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТЧШтрихкодыУпаковок.ШтрихкодУпаковки,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Владелец,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод
		|ИЗ
		|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ТЧШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
		|		ПО ТЧШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|		ПО ТЧШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
		|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ШтрихкодыКоробокДляАгрегации1
		|		ПО (ШтрихкодыКоробокДляАгрегации1.Ссылка = ЛистНабора.Ссылка)
		|ГДЕ
		|	ЛистНабора.Проведен
		|	И ЛистНабора.ДокОснование = &РНК
		|	И ТЧШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
		|	И ШтрихкодыКоробокДляАгрегации1.Ссылка ЕСТЬ NULL
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	КмШтуки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТВсегоПоКоробкамТовараВШтуках.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ВТВсегоПоКоробкамТовараВШтуках.ВсегоПоКоробкам) КАК КоличествоПоПлану,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КмШтуки) КАК КоличествоОтсканированное
		|ИЗ
		|	ВТВсегоПоКоробкамТовараВШтуках КАК ВТВсегоПоКоробкамТовараВШтуках
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШККоробок КАК ВТШККоробок
		|		ПО (ВТШККоробок.Номенклатура = ВТВсегоПоКоробкамТовараВШтуках.Номенклатура)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТВсегоПоКоробкамТовараВШтуках.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	МАКСИМУМ(ВТВсегоПоКоробкамТовараВШтуках.ВсегоПоКоробкам) <> КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КмШтуки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТВсегоПоКоробкамТовара.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ВТВсегоПоКоробкамТовара.ВсегоПоКоробкам) КАК КоличествоПоПлану,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КодАгрегацииКоробки) КАК КоличествоОтсканированное
		|ИЗ
		|	ВТВсегоПоКоробкамТовара КАК ВТВсегоПоКоробкамТовара
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШККоробок КАК ВТШККоробок
		|		ПО (ВТШККоробок.Номенклатура = ВТВсегоПоКоробкамТовара.Номенклатура)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТВсегоПоКоробкамТовара.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	МАКСИМУМ(ВТВсегоПоКоробкамТовара.ВсегоПоКоробкам) <> КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КодАгрегацииКоробки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТИтогиПоКоробкам.КоличествоКоробок) КАК КоличествоПоПлану,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КодАгрегацииКоробки) КАК КоличествоОтсканированное
		|ИЗ
		|	ВТИтогиПоКоробкам КАК ВТИтогиПоКоробкам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШККоробок КАК ВТШККоробок
		|		ПО (ИСТИНА)
		|
		|ИМЕЮЩИЕ
		|	МАКСИМУМ(ВТИтогиПоКоробкам.КоличествоКоробок) <> КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КодАгрегацииКоробки)";
		
		
	КонецЕсли;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ВТКоробки.Номенклатура КАК Номенклатура,
	//	|	ВТКоробки.Количество КАК Количество,
	//	|	ВТКоробки.КоличествоКоробок КАК КоличествоКоробок
	//	|ПОМЕСТИТЬ ВТКоробки
	//	|ИЗ
	//	|	&ТЗСодержимоеКоробов КАК ВТКоробки
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТКоробки.Номенклатура КАК Номенклатура,
	//	|	ВТКоробки.Количество КАК Количество,
	//	|	ВТКоробки.КоличествоКоробок КАК КоличествоКоробок
	//	|ПОМЕСТИТЬ ВТКоробкиПродукции
	//	|ИЗ
	//	|	&ТЗСодержимоеКоробовПродукции КАК ВТКоробки
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТКоробки.Номенклатура КАК Номенклатура,
	//	|	СУММА(ВТКоробки.КоличествоКоробок * ВТКоробки.Количество) КАК ВсегоПоКоробкам
	//	|ПОМЕСТИТЬ ВТВсегоПоКоробкамТовараВШтуках
	//	|ИЗ
	//	|	ВТКоробки КАК ВТКоробки
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВТКоробки.Номенклатура
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТКоробки.Номенклатура КАК Номенклатура,
	//	|	СУММА(ВТКоробки.КоличествоКоробок) КАК ВсегоПоКоробкам
	//	|ПОМЕСТИТЬ ВТВсегоПоКоробкамТовара
	//	|ИЗ
	//	|	ВТКоробки КАК ВТКоробки
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВТКоробки.Номенклатура
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	СУММА(ВТКоробки.КоличествоКоробок) КАК КоличествоКоробок
	//	|ПОМЕСТИТЬ ВТИтогиПоКоробкам
	//	|ИЗ
	//	|	ВТКоробкиПродукции КАК ВТКоробки
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ЛистНабора.КодАгрегации КАК КодАгрегацииКоробки,
	//	|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец КАК Номенклатура,
	//	|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки КАК КмШтуки
	//	|ПОМЕСТИТЬ ВТШККоробок
	//	|ИЗ
	//	|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
	//	|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
	//	|ГДЕ
	//	|	ЛистНабора.Проведен
	//	|	И ЛистНабора.ДокОснование = &РНК
	//	|	И ЛистНабора.КодАгрегации <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	//	|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ЛистПереукладки.КодАгрегации,
	//	|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец,
	//	|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки
	//	|ИЗ
	//	|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладки
	//	|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистПереукладки.Ссылка
	//	|ГДЕ
	//	|	ЛистПереукладки.Проведен
	//	|	И ЛистПереукладки.ДокОснование = &РНК
	//	|	И ЛистПереукладки.КодАгрегации <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	//	|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ЛистНабора.КодАгрегации,
	//	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Владелец,
	//	|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки
	//	|ИЗ
	//	|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
	//	|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//	|		ПО ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	//	|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
	//	|ГДЕ
	//	|	ЛистНабора.Проведен
	//	|	И ЛистНабора.ДокОснование = &РНК
	//	|	И ЛистНабора.КодАгрегации <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	//	|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ЛистПереукладкиДок.КодАгрегации,
	//	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Владелец,
	//	|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки
	//	|ИЗ
	//	|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладкиДок
	//	|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистПереукладкиДок.Ссылка
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//	|		ПО ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	//	|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
	//	|ГДЕ
	//	|	ЛистПереукладкиДок.Проведен
	//	|	И ЛистПереукладкиДок.ДокОснование = &РНК
	//	|	И ЛистПереукладкиДок.КодАгрегации <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	//	|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ЛистНабораШтрихкодыКоробокДляАгрегации.НовыйКодКоробки,
	//	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Владелец,
	//	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод
	//	|ИЗ
	//	|	Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ЛистНабораШтрихкодыКоробокДляАгрегации
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
	//	|		ПО ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка = ЛистНабора.Ссылка
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//	|		ПО ЛистНабораШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	//	|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
	//	|ГДЕ
	//	|	ЛистНабора.Проведен
	//	|	И ЛистНабора.ДокОснование = &РНК
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ЛистНабораШтрихкодыКоробокДляАгрегации.НовыйКодКоробки,
	//	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Владелец,
	//	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод
	//	|ИЗ
	//	|	Документ.ЛистПереукладки.ШтрихкодыКоробокДляАгрегации КАК ЛистНабораШтрихкодыКоробокДляАгрегации
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладкиДок
	//	|		ПО ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка = ЛистПереукладкиДок.Ссылка
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//	|		ПО ЛистНабораШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	//	|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
	//	|ГДЕ
	//	|	ЛистПереукладкиДок.ЛистНабора.Проведен
	//	|	И ЛистПереукладкиДок.ЛистНабора.ДокОснование = &РНК
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ТЧШтрихкодыУпаковок.ШтрихкодУпаковки,
	//	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод.Владелец,
	//	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод
	//	|ИЗ
	//	|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ТЧШтрихкодыУпаковок
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
	//	|		ПО ТЧШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//	|		ПО ТЧШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	//	|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок))
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1
	//	|		ПО (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Ссылка)
	//	|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ШтрихкодыКоробокДляАгрегации1
	//	|		ПО (ШтрихкодыКоробокДляАгрегации1.Ссылка = ЛистНабора.Ссылка)
	//	|ГДЕ
	//	|	ЛистНабора.Проведен
	//	|	И ЛистНабора.ДокОснование = &РНК
	//	|	И ТЧШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
	//	|	И ШтрихкодыКоробокДляАгрегации1.Ссылка ЕСТЬ NULL
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ТЧШтрихкодыУпаковок.ШтрихкодУпаковки,
	//	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод.Владелец,
	//	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод
	//	|ИЗ
	//	|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ТЧШтрихкодыУпаковок
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладкиДок
	//	|		ПО ТЧШтрихкодыУпаковок.Ссылка = ЛистПереукладкиДок.Ссылка
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//	|		ПО ТЧШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	//	|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок))
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1
	//	|		ПО (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Ссылка)
	//	|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки.ШтрихкодыКоробокДляАгрегации КАК ШтрихкодыКоробокДляАгрегации1
	//	|		ПО (ШтрихкодыКоробокДляАгрегации1.Ссылка = ЛистПереукладкиДок.ЛистНабора.Ссылка)
	//	|ГДЕ
	//	|	ЛистПереукладкиДок.Проведен
	//	|	И ЛистПереукладкиДок.ДокОснование = &РНК
	//	|	И ТЧШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
	//	|	И ШтрихкодыКоробокДляАгрегации1.Ссылка ЕСТЬ NULL
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ТЧШтрихкодыУпаковок.ШтрихкодУпаковки,
	//	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Владелец,
	//	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод
	//	|ИЗ
	//	|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ТЧШтрихкодыУпаковок
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
	//	|		ПО ТЧШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//	|		ПО ТЧШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	//	|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ШтрихкодыКоробокДляАгрегации1
	//	|		ПО (ШтрихкодыКоробокДляАгрегации1.Ссылка = ЛистНабора.Ссылка)
	//	|ГДЕ
	//	|	ЛистНабора.Проведен
	//	|	И ЛистНабора.ДокОснование = &РНК
	//	|	И ТЧШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
	//	|	И ШтрихкодыКоробокДляАгрегации1.Ссылка ЕСТЬ NULL
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ТЧШтрихкодыУпаковок.ШтрихкодУпаковки,
	//	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Владелец,
	//	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод
	//	|ИЗ
	//	|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ТЧШтрихкодыУпаковок
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладкиДок
	//	|		ПО ТЧШтрихкодыУпаковок.Ссылка = ЛистПереукладкиДок.Ссылка
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//	|		ПО ТЧШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	//	|			И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки.ШтрихкодыКоробокДляАгрегации КАК ШтрихкодыКоробокДляАгрегации1
	//	|		ПО (ШтрихкодыКоробокДляАгрегации1.Ссылка = ЛистПереукладкиДок.ЛистНабора.Ссылка)
	//	|ГДЕ
	//	|	ЛистПереукладкиДок.Проведен
	//	|	И ЛистПереукладкиДок.ДокОснование = &РНК
	//	|	И ТЧШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
	//	|	И ШтрихкодыКоробокДляАгрегации1.Ссылка ЕСТЬ NULL
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТВсегоПоКоробкамТовараВШтуках.Номенклатура КАК Номенклатура,
	//	|	МАКСИМУМ(ВТВсегоПоКоробкамТовараВШтуках.ВсегоПоКоробкам) КАК КоличествоПоПлану,
	//	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КмШтуки) КАК КоличествоОтсканированное
	//	|ИЗ
	//	|	ВТВсегоПоКоробкамТовараВШтуках КАК ВТВсегоПоКоробкамТовараВШтуках
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШККоробок КАК ВТШККоробок
	//	|		ПО (ВТШККоробок.Номенклатура = ВТВсегоПоКоробкамТовараВШтуках.Номенклатура)
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВТВсегоПоКоробкамТовараВШтуках.Номенклатура
	//	|
	//	|ИМЕЮЩИЕ
	//	|	МАКСИМУМ(ВТВсегоПоКоробкамТовараВШтуках.ВсегоПоКоробкам) <> КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КмШтуки)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТВсегоПоКоробкамТовара.Номенклатура КАК Номенклатура,
	//	|	МАКСИМУМ(ВТВсегоПоКоробкамТовара.ВсегоПоКоробкам) КАК КоличествоПоПлану,
	//	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КодАгрегацииКоробки) КАК КоличествоОтсканированное
	//	|ИЗ
	//	|	ВТВсегоПоКоробкамТовара КАК ВТВсегоПоКоробкамТовара
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШККоробок КАК ВТШККоробок
	//	|		ПО (ВТШККоробок.Номенклатура = ВТВсегоПоКоробкамТовара.Номенклатура)
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВТВсегоПоКоробкамТовара.Номенклатура
	//	|
	//	|ИМЕЮЩИЕ
	//	|	МАКСИМУМ(ВТВсегоПоКоробкамТовара.ВсегоПоКоробкам) <> КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КодАгрегацииКоробки)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	МАКСИМУМ(ВТИтогиПоКоробкам.КоличествоКоробок) КАК КоличествоПоПлану,
	//	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КодАгрегацииКоробки) КАК КоличествоОтсканированное
	//	|ИЗ
	//	|	ВТИтогиПоКоробкам КАК ВТИтогиПоКоробкам
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШККоробок КАК ВТШККоробок
	//	|		ПО (ИСТИНА)
	//	|
	//	|ИМЕЮЩИЕ
	//	|	МАКСИМУМ(ВТИтогиПоКоробкам.КоличествоКоробок) <> КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТШККоробок.КодАгрегацииКоробки)
	//	|";
	//--Данилова Е.В. 01.04.2026
	Запрос.УстановитьПараметр("РНК", РНК);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет(); 
	
	ВыборкаПоШтукам = ПакетЗапросов[6].Выбрать();
	ВыборкаПоКоробкам = ПакетЗапросов[7].Выбрать();
	ВыборкаПоКоробкамВсего = ПакетЗапросов[8].Выбрать();
	
	Пока ВыборкаПоШтукам.Следующий() Цикл
		
		ТекстОшибки = СтрШаблон("Количество отсканированных штук в коробки %1 по товару %2 не совпадает с запланированным %3",
		ВыборкаПоШтукам.КоличествоОтсканированное,ВыборкаПоШтукам.Номенклатура,ВыборкаПоШтукам.КоличествоПоПлану); 
		
		
		Результат.Ошибки.Добавить(ТекстОшибки); 		
		
	КонецЦикла;
	
	Пока ВыборкаПоКоробкам.Следующий() Цикл 		
		
		
		ТекстОшибки = СтрШаблон("Количество отсканированных коробов %1 по товару %2 не совпадает с запланированным %3",
		ВыборкаПоКоробкам.КоличествоОтсканированное,ВыборкаПоКоробкам.Номенклатура,ВыборкаПоКоробкам.КоличествоПоПлану); 
		
		
		Результат.Ошибки.Добавить(ТекстОшибки); 		
		
	КонецЦикла;
	
	Пока ВыборкаПоКоробкамВсего.Следующий() Цикл 		
		
		
		ТекстОшибки = СтрШаблон("Количество отсканированных коробов %1 ИТОГОВОЕ не совпадает с запланированным %2",
		ВыборкаПоКоробкамВсего.КоличествоОтсканированное,ВыборкаПоКоробкамВсего.КоличествоПоПлану); 
		
		
		Результат.Ошибки.Добавить(ТекстОшибки); 		
		
	КонецЦикла;
	
КонецПроцедуры 

Процедура РассчитатьКоличествоКоробокПоВведеннымДанным(СодержимоеБлочка,ВсегоБлочков,Коробки, РНК,ЭтоFBS)
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВтСодержимое.НомерБлочка КАК НомерБлочка,
		|	ВтСодержимое.Номенклатура КАК Номенклатура,
		|	ВтСодержимое.Количество КАК Количество,
		|	ВтСодержимое.НомерКоробки КАК НомерКоробки
		|ПОМЕСТИТЬ ВтСодержимое
		|ИЗ
		|	&СодержимоеБлочка КАК ВтСодержимое
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТВсегоБлочков.НомерБлочка КАК НомерБлочка,
		|	ВТВсегоБлочков.КоличествоБлочков КАК Количество
		|ПОМЕСТИТЬ ВТВсегоБлочков
		|ИЗ
		|	&ВсегоБлочков КАК ВТВсегоБлочков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтСодержимое.Номенклатура КАК Номенклатура,
		|	СУММА(ВтСодержимое.Количество * ВТВсегоБлочков.Количество) КАК Количество,
		|	ВтСодержимое.НомерКоробки КАК НомерКоробки
		|ПОМЕСТИТЬ ВТВПравилах
		|ИЗ
		|	ВТВсегоБлочков КАК ВТВсегоБлочков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтСодержимое КАК ВтСодержимое
		|		ПО ВТВсегоБлочков.НомерБлочка = ВтСодержимое.НомерБлочка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВтСодержимое.Номенклатура,
		|	ВтСодержимое.НомерКоробки,
		|	ВтСодержимое.НомерБлочка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
		|	СУММА(РасходнаяНакладнаяТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ ВтТовары
		|ИЗ
		|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
		|ГДЕ
		|	РасходнаяНакладнаяТовары.Ссылка = &ДокОснование
		|	И РасходнаяНакладнаяТовары.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
		|	И РасходнаяНакладнаяТовары.ТребуетсяМаркировка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасходнаяНакладнаяКомплектующие.Номенклатура КАК Номенклатура,
		|	СУММА(РасходнаяНакладнаяКомплектующие.Количество) КАК Количество
		|ПОМЕСТИТЬ ВтКомплектующие
		|ИЗ
		|	Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
		|ГДЕ
		|	РасходнаяНакладнаяКомплектующие.Ссылка = &ДокОснование
		|	И РасходнаяНакладнаяКомплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
		|	И РасходнаяНакладнаяКомплектующие.ТребуетсяМаркировка
		|	И НЕ &ЭтоFBS
		|	И &ОтгрузкаКомплектов
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяКомплектующие.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтТовары.Номенклатура КАК Номенклатура,
		|	ВтТовары.Количество КАК Количество
		|ПОМЕСТИТЬ ВтТоварыРНК
		|ИЗ
		|	ВтТовары КАК ВтТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтКомплектующие КАК ВтКомплектующие
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВтКомплектующие.Номенклатура ЕСТЬ NULL
		|	И ВтТовары.Количество > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВтКомплектующие.Номенклатура,
		|	ВтКомплектующие.Количество
		|ИЗ
		|	ВтКомплектующие КАК ВтКомплектующие
		|ГДЕ
		|	ВтКомплектующие.Количество > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтТоварыРНК.Номенклатура КАК Номенклатура,
		|	ВтТоварыРНК.Количество КАК Количество
		|ИЗ
		|	ВтТоварыРНК КАК ВтТоварыРНК
		|ИТОГИ
		|	СУММА(Количество)
		|ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТВПравилах.Номенклатура КАК Номенклатура,
		|	ВТВПравилах.Количество КАК Количество,
		|	ВТВПравилах.НомерКоробки КАК НомерКоробки
		|ИЗ
		|	ВТВПравилах КАК ВТВПравилах
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура,
		|	НомерКоробки";
	
	Запрос.УстановитьПараметр("СодержимоеБлочка",СодержимоеБлочка);
	Запрос.УстановитьПараметр("ВсегоБлочков",ВсегоБлочков);

	Запрос.УстановитьПараметр("ДокОснование", РНК.Ссылка);
	Запрос.УстановитьПараметр("ЭтоFBS", ЭтоFBS);
	Запрос.УстановитьПараметр("ОтгрузкаКомплектов", РНК.ОтгрузкаКомплектов);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	ВыборкаТоварыИтоги = ПакетЗапросов[6].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	
	ТаблицаТоваровВПравилах = ПакетЗапросов[7].Выгрузить();
	
	ТаблицаТоваровВПравилахСвернутая = ТаблицаТоваровВПравилах.скопировать(); 
	
	ТаблицаТоваровВПравилахСвернутая.Свернуть("НомерКоробки","Количество"); 
	 
	ТаблицаТоваровВПравилахСвернутая.колонки.Добавить("КоличествоПроставленное",Новый ОписаниеТипов("Число"));
		 
	Пока ВыборкаТоварыИтоги.Следующий() Цикл
		
		КоличествоНеобходимое = ВыборкаТоварыИтоги.Количество;
		
		Пока КоличествоНеобходимое > 0  Цикл		
			
			ОтборПоТаблице = Новый Структура("Номенклатура",ВыборкаТоварыИтоги.Номенклатура); 
			СтрокиТЧ = ТаблицаТоваровВПравилах.НайтиСтроки(ОтборПоТаблице);  		
			КоличествоВСтрокеПравил = 0;  
			Для каждого СтрокаТЧ Из СтрокиТЧ Цикл 
				
				КоличествоВСтрокеПравил = СтрокаТЧ.Количество; 
				Если КоличествоНеобходимое = 0 Тогда 
					
					Прервать; 	
					
				КонецЕсли;
				
				Если КоличествоНеобходимое < СтрокаТЧ.Количество Тогда
					
					Продолжить; 	
					
				КонецЕсли;
				
				ОтборПоКоробам = Новый Структура("НомерКоробки",СтрокаТЧ.НомерКоробки);
				СтрокиПоКоробам =  ТаблицаТоваровВПравилахСвернутая.НайтиСтроки(ОтборПоКоробам);//должна быть одна
				Для каждого СтрокаПоКоробам Из СтрокиПоКоробам Цикл
					
					СтрокаПоКоробам.КоличествоПроставленное =  СтрокаПоКоробам.КоличествоПроставленное + СтрокаТЧ.Количество; 
				
				КонецЦикла;
				
				КоличествоНеобходимое = КоличествоНеобходимое - СтрокаТЧ.Количество;  
				
			КонецЦикла; 
			
			Если КоличествоНеобходимое < КоличествоВСтрокеПравил 
				ИЛИ КоличествоВСтрокеПравил = 0 Тогда
				КоличествоНеобходимое = 0; 
			Конецесли; 
		КонецЦикла;
	КонецЦикла; 	 
	
	Для каждого  СтрокаТЧ Из ТаблицаТоваровВПравилахСвернутая Цикл
	
		  СтрокаКороба = Коробки.Найти(СтрокаТЧ.НомерКоробки,"НомерКоробки");
		  Если СтрокаКороба <> Неопределено Тогда
			  
			  СтрокаКороба.Количество = Цел(СтрокаТЧ.КоличествоПроставленное/СтрокаТЧ.Количество);	
			  
		  КонецЕсли;
	
	КонецЦикла;
	 
 КонецПроцедуры

Функция КоличествоШКПоЗаранееСформированнымАгрегациямДоГотовоКОтгрузке(Знач ДокументОснование,ЕстьЛП = неопределено) Экспорт
	//++Данилова Е.В. 01.04.2026  MARK-3552 
	Если ЕстьЛП = Неопределено Тогда 
		ЕстьЛП = ЕстьЛПСКодамиЧЗ(ДокументОснование); 
	КонецЕсли;
	 
	Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	СУММА(ВложенныйЗапрос.КоличествоПоКоробкам) + СУММА(ВложенныйЗапрос.КоличествоПоБлочкам) КАК Количество
	//	|ИЗ
	//	|	(ВЫБРАТЬ
	//	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод) КАК КоличествоПоКоробкам,
	//	|		0 КАК КоличествоПоБлочкам
	//	|	ИЗ
	//	|		Документ.ЛистНабора КАК ЛистНабора
	//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	//	|			ПО ЛистНабора.Ссылка = ЛистНабораШтрихкодыУпаковок.Ссылка
	//	|				И (ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
	//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//	|			ПО (ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка)
	//	|				И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
	//	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ЛистНабораШтрихкодыКоробокДляАгрегации
	//	|			ПО ЛистНабора.Ссылка = ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка
	//	|	ГДЕ
	//	|		ЛистНабора.Проведен
	//	|		И ЛистНабора.ДокОснование = &ДокОснование
	//	|		И ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка ЕСТЬ NULL
	//	|	
	//	|	ОБЪЕДИНИТЬ ВСЕ
	//	|	
	//	|	ВЫБРАТЬ
	//	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод),
	//	|		0
	//	|	ИЗ
	//	|		Документ.ЛистНабора КАК ЛистНабора
	//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	//	|			ПО ЛистНабора.Ссылка = ЛистНабораШтрихкодыУпаковок.Ссылка
	//	|				И (ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
	//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ЛистНабораШтрихкодыКоробокДляАгрегации
	//	|			ПО ЛистНабора.Ссылка = ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка
	//	|				И (ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ЛистНабораШтрихкодыКоробокДляАгрегации.НовыйКодКоробки)
	//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//	|			ПО (ЛистНабораШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка)
	//	|				И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
	//	|	ГДЕ
	//	|		ЛистНабора.Проведен
	//	|		И ЛистНабора.ДокОснование = &ДокОснование
	//	|	
	//	|	ОБЪЕДИНИТЬ ВСЕ
	//	|	
	//	|	ВЫБРАТЬ
	//	|		0,
	//	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод)
	//	|	ИЗ
	//	|		Документ.ЛистНабора КАК ЛистНабора
	//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	//	|			ПО ЛистНабора.Ссылка = ЛистНабораШтрихкодыУпаковок.Ссылка
	//	|				И (ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок))
	//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//	|			ПО (ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка)
	//	|				И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
	//	|	ГДЕ
	//	|		ЛистНабора.Проведен
	//	|		И ЛистНабора.ДокОснование = &ДокОснование
	//	|	
	//	|	ОБЪЕДИНИТЬ ВСЕ
	//	|	
	//	|	ВЫБРАТЬ
	//	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод),
	//	|		0
	//	|	ИЗ
	//	|		Документ.ЛистПереукладки КАК ЛистПереукладки
	//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистПереукладкиШтрихкодыУпаковок
	//	|			ПО ЛистПереукладки.Ссылка = ЛистПереукладкиШтрихкодыУпаковок.Ссылка
	//	|				И (ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
	//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//	|			ПО (ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка)
	//	|				И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
	//	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ЛистНабораШтрихкодыКоробокДляАгрегации
	//	|			ПО ЛистПереукладки.ЛистНабора.Ссылка = ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка
	//	|	ГДЕ
	//	|		ЛистПереукладки.Проведен
	//	|		И ЛистПереукладки.ДокОснование = &ДокОснование
	//	|		И ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка ЕСТЬ NULL
	//	|	
	//	|	ОБЪЕДИНИТЬ ВСЕ
	//	|	
	//	|	ВЫБРАТЬ
	//	|		0,
	//	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод)
	//	|	ИЗ
	//	|		Документ.ЛистПереукладки КАК ЛистПереукладки
	//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистПереукладкиШтрихкодыУпаковок
	//	|			ПО ЛистПереукладки.Ссылка = ЛистПереукладкиШтрихкодыУпаковок.Ссылка
	//	|				И (ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок))
	//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//	|			ПО (ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка)
	//	|				И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
	//	|	ГДЕ
	//	|		ЛистПереукладки.Проведен
	//	|		И ЛистПереукладки.ДокОснование = &ДокОснование
	//	|	
	//	|	ОБЪЕДИНИТЬ ВСЕ
	//	|	
	//	|	ВЫБРАТЬ
	//	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод),
	//	|		0
	//	|	ИЗ
	//	|		Документ.ЛистПереукладки КАК ЛистПереукладки
	//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистПереукладкиШтрихкодыУпаковок
	//	|			ПО ЛистПереукладки.Ссылка = ЛистПереукладкиШтрихкодыУпаковок.Ссылка
	//	|				И (ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
	//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ЛистПереукладкиШтрихкодыКоробокДляАгрегации
	//	|			ПО ЛистПереукладки.Ссылка = ЛистПереукладкиШтрихкодыКоробокДляАгрегации.Ссылка
	//	|				И (ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки = ЛистПереукладкиШтрихкодыКоробокДляАгрегации.НовыйКодКоробки)
	//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//	|			ПО (ЛистПереукладкиШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка)
	//	|				И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
	//	|	ГДЕ
	//	|		ЛистПереукладки.Проведен
	//	|		И ЛистПереукладки.ДокОснование = &ДокОснование) КАК ВложенныйЗапрос";

	Если ЕстьЛП Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ВложенныйЗапрос.КоличествоПоКоробкам) + СУММА(ВложенныйЗапрос.КоличествоПоБлочкам) КАК Количество
		|ИЗ
		|	(ВЫБРАТЬ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод) КАК КоличествоПоКоробкам,
		|		0 КАК КоличествоПоБлочкам
		|	ИЗ
		|		Документ.ЛистПереукладки КАК ЛистПереукладки
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистПереукладкиШтрихкодыУпаковок
		|			ПО ЛистПереукладки.Ссылка = ЛистПереукладкиШтрихкодыУпаковок.Ссылка
		|				И (ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|			ПО (ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка)
		|				И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ЛистНабораШтрихкодыКоробокДляАгрегации
		|			ПО ЛистПереукладки.ЛистНабора.Ссылка = ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка
		|	ГДЕ
		|		ЛистПереукладки.Проведен
		|		И ЛистПереукладки.ДокОснование = &ДокОснование
		|		И ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка ЕСТЬ NULL
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		0,
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод)
		|	ИЗ
		|		Документ.ЛистПереукладки КАК ЛистПереукладки
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистПереукладкиШтрихкодыУпаковок
		|			ПО ЛистПереукладки.Ссылка = ЛистПереукладкиШтрихкодыУпаковок.Ссылка
		|				И (ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок))
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|			ПО (ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка)
		|				И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|	ГДЕ
		|		ЛистПереукладки.Проведен
		|		И ЛистПереукладки.ДокОснование = &ДокОснование
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод),
		|		0
		|	ИЗ
		|		Документ.ЛистПереукладки КАК ЛистПереукладки
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистПереукладкиШтрихкодыУпаковок
		|			ПО ЛистПереукладки.Ссылка = ЛистПереукладкиШтрихкодыУпаковок.Ссылка
		|				И (ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки.ШтрихкодыКоробокДляАгрегации КАК ЛистПереукладкиШтрихкодыКоробокДляАгрегации
		|			ПО ЛистПереукладки.Ссылка = ЛистПереукладкиШтрихкодыКоробокДляАгрегации.Ссылка
		|				И (ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки = ЛистПереукладкиШтрихкодыКоробокДляАгрегации.НовыйКодКоробки)
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|			ПО (ЛистПереукладкиШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка)
		|				И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|	ГДЕ
		|		ЛистПереукладки.Проведен
		|		И ЛистПереукладки.ДокОснование = &ДокОснование
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод),
		|		0
		|	ИЗ
		|		Документ.ЛистПереукладки КАК ЛистПереукладки
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистПереукладкиШтрихкодыУпаковок
		|			ПО ЛистПереукладки.Ссылка = ЛистПереукладкиШтрихкодыУпаковок.Ссылка
		|				И (ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки.ШтрихкодыКоробокДляАгрегации КАК ЛистПереукладкиШтрихкодыКоробокДляАгрегации
		|			ПО ЛистПереукладки.Ссылка = ЛистПереукладкиШтрихкодыКоробокДляАгрегации.Ссылка
		|				И (ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки = ЛистПереукладкиШтрихкодыКоробокДляАгрегации.НовыйКодКоробки)
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|			ПО (ЛистПереукладкиШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка)
		|				И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок))
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1
		|			ПО (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Ссылка = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод)
		|				И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|	ГДЕ
		|		ЛистПереукладки.Проведен
		|		И ЛистПереукладки.ДокОснование = &ДокОснование) КАК ВложенныйЗапрос";
		
	Иначе 
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ВложенныйЗапрос.КоличествоПоКоробкам) + СУММА(ВложенныйЗапрос.КоличествоПоБлочкам) КАК Количество
		|ИЗ
		|	(ВЫБРАТЬ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод) КАК КоличествоПоКоробкам,
		|		0 КАК КоличествоПоБлочкам
		|	ИЗ
		|		Документ.ЛистНабора КАК ЛистНабора
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		|			ПО ЛистНабора.Ссылка = ЛистНабораШтрихкодыУпаковок.Ссылка
		|				И (ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|			ПО (ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка)
		|				И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ЛистНабораШтрихкодыКоробокДляАгрегации
		|			ПО ЛистНабора.Ссылка = ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка
		|	ГДЕ
		|		ЛистНабора.Проведен
		|		И ЛистНабора.ДокОснование = &ДокОснование
		|		И ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка ЕСТЬ NULL
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод),
		|		0
		|	ИЗ
		|		Документ.ЛистНабора КАК ЛистНабора
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		|			ПО ЛистНабора.Ссылка = ЛистНабораШтрихкодыУпаковок.Ссылка
		|				И (ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ЛистНабораШтрихкодыКоробокДляАгрегации
		|			ПО ЛистНабора.Ссылка = ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка
		|				И (ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ЛистНабораШтрихкодыКоробокДляАгрегации.НовыйКодКоробки)
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|			ПО (ЛистНабораШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка)
		|				И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|	ГДЕ
		|		ЛистНабора.Проведен
		|		И ЛистНабора.ДокОснование = &ДокОснование
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		0,
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод)
		|	ИЗ
		|		Документ.ЛистНабора КАК ЛистНабора
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		|			ПО ЛистНабора.Ссылка = ЛистНабораШтрихкодыУпаковок.Ссылка
		|				И (ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок))
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|			ПО (ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка)
		|				И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|	ГДЕ
		|		ЛистНабора.Проведен
		|		И ЛистНабора.ДокОснование = &ДокОснование
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод),
		|		0
		|	ИЗ
		|		Документ.ЛистНабора КАК ЛистНабора
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		|			ПО ЛистНабора.Ссылка = ЛистНабораШтрихкодыУпаковок.Ссылка
		|				И (ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ЛистНабораШтрихкодыКоробокДляАгрегации
		|			ПО ЛистНабора.Ссылка = ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка
		|				И (ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ЛистНабораШтрихкодыКоробокДляАгрегации.НовыйКодКоробки)
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|			ПО (ЛистНабораШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка)
		|				И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок))
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1
		|			ПО (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Ссылка = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод)
		|				И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
		|	ГДЕ
		|		ЛистНабора.Проведен
		|		И ЛистНабора.ДокОснование = &ДокОснование) КАК ВложенныйЗапрос";
	КонецЕсли; 
	//--Данилова Е.В. 01.04.2026
	Запрос.УстановитьПараметр("ДокОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	КоличествоВложенных = 0; 	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КоличествоВложенных = ВыборкаДетальныеЗаписи.Количество; 
	КонецЦикла;
	
	Возврат КоличествоВложенных; 

 
 КонецФункции // КоличествоШКПоЗаранееСформированнымАгрегациям() 

//--Данилова Е.В. 09.03.2026 
//++Данилова Е.В. 01.04.2026 MARK-3552
Функция ЕстьЛПСКодамиЧЗ(Накладная) экспорт
	запрос=новый запрос;
	запрос.УстановитьПараметр("Накладная",Накладная);
	запрос.Текст= "ВЫБРАТЬ ПЕРВЫЕ 1
	              |	ЛП.Ссылка КАК Ссылка
	              |ИЗ
	              |	Документ.ЛистПереукладки КАК ЛП
	              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛПШК
	              |		ПО ЛП.Ссылка = ЛПШК.Ссылка
	              |ГДЕ
	              |	ЛП.Проведен
	              |	И ЛП.ДокОснование = &Накладная"; 
	выборка=запрос.Выполнить().Выбрать();
	пока выборка.Следующий() цикл
		возврат Истина;
	КонецЦикла;
	//++Данилова Е.В. 03.04.2026 MARK-3539 
	ИспользоватьЛНТолькоДляНабора = ИспользоватьЛНТолькоДляНабора(Накладная); 
	Возврат ИспользоватьЛНТолькоДляНабора;  
	//возврат Ложь;
	//--Данилова Е.В. 03.04.2026
КонецФункции
//--Данилова Е.В. 01.04.2026 

//++Данилова Е.В. 18.05.2026 MARK-3615
#Область Перемаркировка
Процедура ЗапуститьВФонеСозданиеЗаказовКодовМаркировки(Знач ДокРегистрации, Знач ИдентификаторФЗ) Экспорт
	МассивПараметров = Новый Массив; 
	МассивПараметров.Добавить(ДокРегистрации);

	ФЗ = ФоновыеЗадания.Выполнить("МаркировкаС.ЗаписатьВФонеЗаказКодовМаркировки", МассивПараметров, ИдентификаторФЗ,
		"ЗаписатьВФонеЗаказКодовМаркировки"); 
	
КонецПроцедуры

Процедура ЗаписатьВФонеЗаказКодовМаркировки(Знач ДокументРегистрации) Экспорт
	
	Документы.Перемаркировка.СоздатьЗаказыКодовМаркировки(ДокументРегистрации);  
	
КонецПроцедуры  

Процедура ИзменитьСтатусПеремаркировкиВФоне(Знач ДокРегистрации,Знач ВерсияДанных, Знач ИдентификаторФЗ, Статус = неопределено) Экспорт 

	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(ДокРегистрации); 
	МассивПараметров.Добавить(Статус);
	МассивПараметров.Добавить(ВерсияДанных);

	ФЗ = ФоновыеЗадания.Выполнить("МаркировкаС.ИзменитьСтатусПеремаркировки", МассивПараметров, ИдентификаторФЗ,
		"ИзменитьСтатусПеремаркировки");	

КонецПроцедуры

Процедура ИзменитьСтатусПеремаркировки(Знач ДокументРегистрации, Статус = Неопределено,ВерсияДанных = неопределено)  Экспорт 
	
	Если Статус = Неопределено Тогда
		
		Статус = Перечисления.СтатусыПеремаркировки.ОбработаноЧЗ; 	
		
	КонецЕсли;
	
	Если ВерсияДанных = Неопределено Тогда 
		Документы.Перемаркировка.УстановитьСтатусПеремаркировки(ДокументРегистрации,Статус);
	Иначе
		ДокЗаписан = Ложь; 
		ПроверкаВерсииДокументаПриЗаписи(ВерсияДанных,Документрегистрации,ДокЗаписан);
		
		Если ДокЗаписан Тогда
			
			Документы.Перемаркировка.УстановитьСтатусПеремаркировки(ДокументРегистрации,Статус); 
		Иначе 
			
			ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Ошибка выполнения в фоне изменения статуса по перемаркировке'"), 
			УровеньЖурналаРегистрации.Ошибка, 
			, 
			, 
			НСтр("ru = 'Ошибка в ""ИзменитьСтатусПеремаркировкиВФоне"".'"));
			
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

 Процедура ПроверкаВерсииДокументаПриЗаписи(Знач ВерсияНовая,Знач ДокументРегистрации,ДокЗаписан,СекундПауза = 0) Экспорт 
	
	Если СекундПауза >= 100 Тогда 
		
		ДокЗаписан = Ложь;	
		
	ИначеЕсли ВерсияНовая <> ДокументРегистрации.ссылка.ВерсияДанных Тогда 
		
		МаркировкаКС.Пауза(2); 
		
		СекундПауза = СекундПауза + 2; 
		
		ПроверкаВерсииДокументаПриЗаписи(ВерсияНовая,ДокументРегистрации,ДокЗаписан,СекундПауза); 
	Иначе 
		ДокЗаписан = истина;  
	КонецЕсли;

КонецПроцедуры



#КонецОбласти
//--Данилова Е.В. 18.05.2026 
