
#Область ПолучитьДопДанные

функция ПолучитьДопДанные(ДокументСсылка, Форма) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокОснование", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДопДанные.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ДопДанныеГТДкМашине КАК ДопДанные
	|ГДЕ
	|	ДопДанные.ДокОснование = &ДокОснование
	|	И НЕ ДопДанные.ПометкаУдаления";
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Результат.Количество() > 0 Тогда
		
		ДопДанные = Результат.Получить(0).Ссылка.ПолучитьОбъект();
		Возврат ДопДанные;
		
	ИначеЕсли Форма <> Неопределено Тогда
		
		ДопДанные = Документы.ДопДанныеГТДкМашине.СоздатьДокумент();
		ДопДанные.ДанныеГТД.Загрузить(Форма.ДанныеГТД);
		ДопДанные.ДокОснование = ДокументСсылка;
		ДопДанные.Дата = ДокументСсылка.Дата;
		ДопДанные.УстановитьНовыйНомер();
		Если ДопДанные.ДанныеГТД.Количество() > 0 Тогда
			Попытка
				ДопДанные.Записать();
			Исключение
				СообщитьИзМодуля(ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
		Возврат ДопДанные;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти