Перем БылКурс;
Перем БылПроцентРезерва;
//Кухарь 20.09.19 начало
//Теперь процент резервов иногда отдельно по каждой строчке
Перем ТаблицаРезервовСтарая;
Перем БылиИзмененияВТаблицеРезервов;
//Кухарь 20.09.19 конец


Процедура ПровестиПоГТД(Записывать=Ложь) Экспорт
	Если ГТД.Пустая() Тогда
		Движения.ОстаткиГТД.Очистить();
	Иначе
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Номенклатура.Родитель КАК Модель,
		|	СУММА(Количество) КАК Количество
		|ИЗ
		|	Документ.ПриходнаяНакладная.Товары КАК ПриходнаяНакладнаяТовары
		|ГДЕ
		|	Ссылка.ДокОснование.Машина = &Машина
		|	И Ссылка.Проведен
		|	И Ссылка.СостояниеНакладной = &СостояниеНакладной
		|СГРУППИРОВАТЬ ПО
		|	Номенклатура.Родитель";
		
		Запрос.УстановитьПараметр("Машина",Ссылка);
		Запрос.УстановитьПараметр("СостояниеНакладной",Перечисления.СостоянияНакладной.Принята);
		
		Выборка=Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.Количество<>0 Тогда
				Движение=Движения.ОстаткиГТД.Добавить();				
				
				Движение.Период			=НачалоДня(Дата);
				Движение.ВидДвижения	=ВидДвиженияНакопления.Приход;
				
				Движение.Номенклатура	=Выборка.Модель;
				Движение.ГТД			=ГТД;
				Движение.Количество		=Выборка.Количество;			
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли; 
	
	Если Записывать Тогда
		Движения.ОстаткиГТД.Записать();		
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////////////////////////////
	
	// Шворобей ВЮ 27.04.2022 +
	
	Запрос = Новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	МашинаНомераГТД.Модель КАК Модель,
	//|	СУММА(МашинаНомераГТД.Количество) КАК Количество,
	//|	МАКСИМУМ(МашинаНомераГТД.ГТД) КАК ГТД
	//|ИЗ
	//|	Документ.Машина.НомераГТД КАК МашинаНомераГТД
	//|ГДЕ
	//|	МашинаНомераГТД.Ссылка = &Ссылка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	МашинаНомераГТД.Модель
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Модель
	//|АВТОУПОРЯДОЧИВАНИЕ
	//|";
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МашинаНомераГТД.Модель, МашинаНомераГТД1.Модель) КАК Модель,
	|	ЕСТЬNULL(МашинаНомераГТД.Количество, МашинаНомераГТД1.Количество) КАК Количество,
	|	ЕСТЬNULL(МашинаНомераГТД.ГТД, МашинаНомераГТД1.ГТД) КАК ГТД
	|ПОМЕСТИТЬ ГТД
	|ИЗ
	|	Документ.Машина.НомераГТД КАК МашинаНомераГТД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Машина.НомераГТД КАК МашинаНомераГТД1
	|		ПО МашинаНомераГТД.Ссылка = МашинаНомераГТД1.Ссылка
	|			И МашинаНомераГТД.Модель = МашинаНомераГТД1.Модель
	|ГДЕ
	|	МашинаНомераГТД.Ссылка = &Ссылка
	|	И МашинаНомераГТД.Количество >= МашинаНомераГТД1.Количество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабГТД.Модель КАК Модель,
	|	СУММА(ТабГТД.Количество) КАК Количество,
	|	МАКСИМУМ(ТабГТД.ГТД) КАК ГТД
	|ИЗ
	|	ГТД КАК ТабГТД
	|ГДЕ
	|	ТабГТД.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабГТД.Модель
	|";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка); // <МАШ>[МАШ SSP-000019 от 14.01.2022 12:00:00]
	
	ТЗГТД = Запрос.Выполнить().Выгрузить();
	
	НЗ=РегистрыСведений.История.СоздатьНаборЗаписей();
	//крохин начало
	//ГТД записываем датой из ГТД, а не из документа 
	//НЗ.Отбор.Период.Установить(Дата,Истина);
	Год = "20"+Сред(ГТД.Наименование,14,2);
	Месяц =  Сред(ГТД.Наименование,12,2);
	День =  Сред(ГТД.Наименование,10,2);
	попытка
		ДатаНомераГТД = Дата(Год+месяц+день);
	исключение
		ДатаНомераГТД = Дата;
	Конецпопытки;
	НЗ.Отбор.Период.Установить(ДатаНомераГТД,Истина);
	
	//крохин конец
	НЗ.Отбор.Документ.Установить(Ссылка,Истина);
	
	Для Каждого СтрокаГТД Из ТЗГТД Цикл
		
		Если НЕ СтрокаГТД.ГТД.Пустая() И НЕ СтрокаГТД.Модель.Пустая() Тогда
			Запись=НЗ.Добавить();
			//крохин начало
			//ГТД записываем датой из ГТД, а не из документа 
			//	Запись.Период		=Дата;
			Запись.Период		=ДатаНомераГТД;
			//крохин конец
			Запись.Объект		=СтрокаГТД.Модель;
			Запись.Реквизит		="НомерГТД";
			Запись.Документ		=Ссылка;		
			
			Запись.Значение		=СтрокаГТД.ГТД;			
			
			Запись.Регистратор	=Ссылка;			
		КонецЕсли;	
	КонецЦикла;

	НЗ.Записать();
	
	// Шворобей ВЮ 27.04.2022 +
	
КонецПроцедуры


Функция ГруппыТоваровМашины(ДокОбъект,ИмяТЧ="Товары",ИмяКолонки="Номенклатура") Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР КОГДА Номенклатура.ЭтоГруппа ТОГДА Номенклатура.Родитель.Наименование ИНАЧЕ Номенклатура.Родитель.Родитель.Наименование КОНЕЦ КАК Наименование,
	|	ВЫБОР КОГДА Номенклатура.ЭтоГруппа ТОГДА Номенклатура.Родитель.Брэнд ИНАЧЕ Номенклатура.Родитель.Родитель.Брэнд КОНЕЦ КАК Брэнд
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В (
	|		ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Номенклатура
	|		ИЗ
	|			Документ.ЗаказПоставщику.Товары
	|		ГДЕ
	|			Ссылка В(&СписокЗаказов)
	|	)	
	|УПОРЯДОЧИТЬ ПО Наименование";	
	
	СписокЗаказов=Заказы.ВыгрузитьКолонку("Заказ");
	Запрос.УстановитьПараметр("СписокЗаказов",СписокЗаказов);
	
	ГруппыТоваров="";
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекБрэнд=?(ПустаяСтрока(Выборка.Брэнд),Выборка.Наименование,Выборка.Брэнд);
		ГруппыТоваров=ГруппыТоваров+ТекБрэнд+",";	
	КонецЦикла; 
	
	Если НЕ ПустаяСтрока(ГруппыТоваров) Тогда
		ГруппыТоваров=Лев(ГруппыТоваров,СтрДлина(ГруппыТоваров)-1)	
	КонецЕсли; 
	
	Возврат ГруппыТоваров;	
КонецФункции

Процедура ЗаполнитьСтрокуПоЗаказу(СтрокаТЧ) Экспорт
	Заказ=СтрокаТЧ.Заказ;
	
	СтрокаТЧ.Номерпоставщика= Заказ.НомерПоставщика;
	СтрокаТЧ.Количество		= Заказ.КоличествоДокумента;	
	СтрокаТЧ.Объем			= Заказ.ОбъемДокумента;
	СтрокаТЧ.Всего			= Заказ.СуммаДокумента;
	СтрокаТЧ.Валюта			= Заказ.Валюта;
	Если Заказ.Валюта=Валюта Тогда
		СтрокаТЧ.СуммаЗаказа=Заказ.СуммаДокумента;
	Иначе
		СтрокаТЧ.СуммаЗаказа=глПересчет(Заказ.СуммаДокумента,Заказ.Валюта,Заказ.Курс,Валюта,Курс)
	КонецЕсли; 
	
	СтрокаТЧ.ГруппыТоваров  = Заказ.ГруппыТоваров;
	//крохин начало
	СтрокаТЧ.КурсЗПС = Заказ.Курс;
	//крохин конец
КонецПроцедуры 

Процедура ОбновитьДанныеЗаказов(Принудительно=Ложь) Экспорт
	Для Каждого СтрокаЗП Из Заказы Цикл
		ЗаказОбъект=Неопределено;
		
		Если СтрокаЗП.Заказ.ДопРасходыПоМашине<>СтрокаЗП.ДопРасходы ИЛИ Принудительно Тогда
			ЗаказОбъект=СтрокаЗП.Заказ.ПолучитьОбъект();			
			ЗаказОбъект.ДопРасходыПоМашине=СтрокаЗП.ДопРасходы;
		КонецЕсли;	
		
		Если СтрокаЗП.Заказ.Машина<>Ссылка Тогда
			Если ЗаказОбъект=Неопределено Тогда
				ЗаказОбъект=СтрокаЗП.Заказ.ПолучитьОбъект();
			КонецЕсли;			
			ЗаказОбъект.Машина=Ссылка;
		КонецЕсли;	
		
		Если СтрокаЗП.Заказ.НомерМашины<>НомерМашины Тогда
			Если ЗаказОбъект=Неопределено Тогда
				ЗаказОбъект=СтрокаЗП.Заказ.ПолучитьОбъект();
			КонецЕсли;			
			ЗаказОбъект.НомерМашины=НомерМашины		
		КонецЕсли; 
		
		Если ЗаказОбъект<>Неопределено Тогда
			ЗаказОбъект.ОбновитьДанныеЗаказа();
			
			ЗаказОбъект.ПересчетДопРасходовПоИнвойсу();
			ЗаказОбъект.ПересчетДопРасходовПоМашине();
			
			ЗаказОбъект.ОбновитьДанныеЗаказа();
			
			ЗаказОбъект.РасчетРублевыхЦен();
			
			ЗаказОбъект.ОбновитьДанныеЗаказа();			
		КонецЕсли;		
	КонецЦикла; 	
КонецПроцедуры 

Процедура ЗаполнитьСтрокуКурса(Заказ,ЗаписыватьКурсыВЗаказ=Ложь) Экспорт
	СтрокаКурса=Курсы.Найти(Заказ.Валюта,"Валюта");
	Если СтрокаКурса=Неопределено Тогда
		СтрокаКурса			=Курсы.Добавить();		
		
		СтрокаКурса.Валюта	=Заказ.Валюта;				
		Если СтрокаКурса.Валюта<>Валюта Тогда			
			СтрокаКурса.Курс	=ПолучитьКурсВалюты(Заказ.Валюта,Дата).Курс;				
		КонецЕсли;	
	КонецЕсли;
	
	Если СтрокаКурса.Валюта=Валюта И СтрокаКурса.Курс<>Курс Тогда
		СтрокаКурса.Курс=Курс;
	КонецЕсли;	
	//крохин начало
	//по просьбе Сибилева
	//	Если Заказ.Курс<>СтрокаКурса.Курс И ЗаписыватьКурсыВЗаказ Тогда		
	//	ЗаказОбъект=Заказ.ПолучитьОбъект();
	//	ЗаказОбъект.Курс=СтрокаКурса.Курс;
	//	ЗаказОбъект.Записать();
	//	КонецЕсли; 
КонецПроцедуры 

Процедура РассчитатьРублевыеСуммы() Экспорт
	Рубли=ПараметрыСеанса.ВалютаНац;
	//Кухарь 24.09.09 начало	
	//ТДР=РаспределениеРасходов.Выгрузить(,"Заказ,ДопРасходы");
	//ТДР.Свернуть("Заказ","ДопРасходы");
	//
	//Для Каждого СтрокаЗаказа Из Заказы Цикл
	//	ТекЗаказ			= СтрокаЗаказа.Заказ;	
	//	Если ТекЗаказ.Валюта<>ПараметрыСеанса.ВалютаНац Тогда
	//		РасчетнаяСуммаПНК	= (ТекЗаказ.Товары.Итог("Всего")+ТекЗаказ.ДопРасходыПоИнвойсу)*ТекЗаказ.Курс;
	//		//РасчетнаяСуммаПНК	= (ТекЗаказ.Товары.Итог("Всего")+ТекЗаказ.ДопРасходыПоИнвойсу)*Курс			
	//	Иначе			
	//		РасчетнаяСуммаПНК	= (ТекЗаказ.Товары.Итог("Всего")+ТекЗаказ.ДопРасходыПоИнвойсу);		
	//	КонецЕсли;
	//	
	//	СтрокаДР=ТДР.Найти(СтрокаЗаказа.Заказ,"Заказ");
	//	Если СтрокаДР<>Неопределено Тогда
	//		РасчетнаяСуммаПНК=РасчетнаяСуммаПНК+глПересчет(СтрокаДР.ДопРасходы,Валюта,Курс,Рубли,Дата);
	//	КонецЕсли;
	//	
	//	//Кухарь 23.09.19 начало
	//	//Сумма резерва теперь считается в другом месте
	//	//СтрокаЗаказа.СуммаРезерва	= РасчетнаяСуммаПНК*ПроцентРезерва/100;
	//	//Кухарь 23.09.19 конец		
	//	
	//	РасчетнаяСуммаПНК			= РасчетнаяСуммаПНК+СтрокаЗаказа.СуммаРезерва;
	//	
	//	Если СтрокаЗаказа.РасчетнаяСуммаПНК<>РасчетнаяСуммаПНК Тогда
	//		СтрокаЗаказа.РасчетнаяСуммаПНК=РасчетнаяСуммаПНК;			
	//	КонецЕсли;	
	//КонецЦикла;	
	
			//крохин начало 06.03.2023
		//для машин без резервов расчетная сумма считается по старому
	//Если РаспределениеРасходов.Количество()=0 тогда
	Если РаспределениеРасходов.Количество()=0 ИЛИ РаспределениеРасходов.Итог("СуммаРезерва") = 0 Тогда
		//крохин конец 06.03.2023	
		ТДР=РаспределениеРасходов.Выгрузить(,"Заказ,ДопРасходы");
		ТДР.Свернуть("Заказ","ДопРасходы");
		
		Для Каждого СтрокаЗаказа Из Заказы Цикл
			ТекЗаказ			= СтрокаЗаказа.Заказ;	
			Если ТекЗаказ.Валюта<>ПараметрыСеанса.ВалютаНац Тогда
				РасчетнаяСуммаПНК	= (ТекЗаказ.Товары.Итог("Всего")+ТекЗаказ.ДопРасходыПоИнвойсу)*ТекЗаказ.Курс;
			Иначе			
				РасчетнаяСуммаПНК	= (ТекЗаказ.Товары.Итог("Всего")+ТекЗаказ.ДопРасходыПоИнвойсу);		
			КонецЕсли;
			
			СтрокаДР=ТДР.Найти(СтрокаЗаказа.Заказ,"Заказ");
			Если СтрокаДР<>Неопределено Тогда
				РасчетнаяСуммаПНК=РасчетнаяСуммаПНК+глПересчет(СтрокаДР.ДопРасходы,Валюта,Курс,Рубли,Дата);
			КонецЕсли;
			
			СтрокаЗаказа.СуммаРезерва	= РасчетнаяСуммаПНК*ПроцентРезерва/100;
			РасчетнаяСуммаПНК			= РасчетнаяСуммаПНК+СтрокаЗаказа.СуммаРезерва;
			
			Если СтрокаЗаказа.РасчетнаяСуммаПНК<>РасчетнаяСуммаПНК Тогда
				СтрокаЗаказа.РасчетнаяСуммаПНК=РасчетнаяСуммаПНК;			
			КонецЕсли;	
		КонецЦикла;	
		
	иначе
		ТДР=РаспределениеРасходов.Выгрузить(,"Заказ,ПроцентРезерва,СуммаРезерва");
		ТДР.Свернуть("Заказ,ПроцентРезерва","СуммаРезерва");
		
		Для Каждого СтрокаЗаказа Из Заказы Цикл
			РасчетнаяСуммаПНК=0;
			ТекЗаказ			= СтрокаЗаказа.Заказ;		
			МассСтрокДР=ТДР.НайтиСтроки(новый Структура("Заказ",СтрокаЗаказа.Заказ));			
			Для каждого СтрокаДР из МассСтрокДР цикл
				РасчетнаяСуммаПНК=РасчетнаяСуммаПНК+?(СтрокаДР.ПроцентРезерва=0,0,100*СтрокаДР.СуммаРезерва/СтрокаДР.ПроцентРезерва);
			КонецЦикла;
			РасчетнаяСуммаПНК= РасчетнаяСуммаПНК+СтрокаЗаказа.СуммаРезерва;
			
			Если СтрокаЗаказа.РасчетнаяСуммаПНК<>РасчетнаяСуммаПНК Тогда
				СтрокаЗаказа.РасчетнаяСуммаПНК=РасчетнаяСуммаПНК;			
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;
	//Кухарь 24.09.09 конец	
КонецПроцедуры 

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если НЕ Ссылка.Пустая() Тогда
		БылКурс				= Ссылка.Курс;
		БылПроцентРезерва	= Ссылка.ПроцентРезерва;
	Иначе
		БылКурс				= Курс;	
		БылПроцентРезерва	= ПроцентРезерва;	
		// Кухарь А.Ю.  15.03.2024 начало    
		//Валетов + 28,05,2026 Наряд 0000000351
		Если Не ЗначениеЗаполнено(Организация) Тогда
			Организация=ПолучитьРеквизитШапки(Договор,"Организация","Справочник");
		КонецЕсли;
		//Валетов-
		// Кухарь А.Ю.  15.03.2024 конец
				
	КонецЕсли;
	
	// Шворобей ВЮ 27.04.2022 +
	Если ЗначениеЗаполнено(ГТД) Тогда
		Для Каждого Стр ИЗ НомераГТД Цикл
			Если НЕ ЗначениеЗаполнено(Стр.ГТД) Тогда
				СообщитьИзМодуля("В строке " + Строка(Стр.НомерСтроки) + " не заполнен ГТД");
				Отказ = Истина; Возврат;	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// Шворобей ВЮ 27.04.2022 +
	
	//Кухарь 20.09.19 начало
	//Распределение резервов по таблице расходов
	Если НЕ Ссылка.Пустая() Тогда
		ТаблицаРезервовСтарая	= Ссылка.РаспределениеРасходов.Выгрузить();
		ПроцентРезерваСтарый	= Ссылка.ПроцентРезерва;
		ДоговорРезерваСтарый	= Ссылка.Договор_Резерв;
		для каждого СтрТЗ из ТаблицаРезервовСтарая цикл
			если СтрТЗ.ПроцентРезерва=0 тогда
				СтрТЗ.ПроцентРезерва=ПроцентРезерваСтарый;
			КонецЕсли;
			если СтрТЗ.Договор_Резерв=Справочники.Договоры.ПустаяСсылка() тогда
				СтрТЗ.Договор_Резерв=ДоговорРезерваСтарый;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
	МассСтрок=РаспределениеРасходов.НайтиСтроки(новый Структура("ПроцентРезерва,Договор_Резерв",ПроцентРезерва,Договор_Резерв));
	если МассСтрок.Количество()<>РаспределениеРасходов.Количество() тогда
		ИспользоватьТаблицуРезервов=Истина;
	иначе
		ИспользоватьТаблицуРезервов=ложь;	
	КонецЕсли;	
	
	если ИспользоватьТаблицуРезервов тогда
		для каждого СтрТЧ из РаспределениеРасходов цикл
			если СтрТЧ.ПроцентРезерва=0 тогда
				СтрТЧ.ПроцентРезерва=ПроцентРезерва;
			КонецЕсли;
			
			если СтрТЧ.Договор_Резерв=Справочники.Договоры.ПустаяСсылка() тогда
				СтрТЧ.Договор_Резерв=Договор_Резерв;
			КонецЕсли;	
			
			если не Ссылка.Пустая() тогда
				попытка
					СтрТЗ=ТаблицаРезервовСтарая.Получить(СтрТЧ.НомерСтроки-1);
					//крохин начало 27.01.2020
					//при изменении суммы доп.расходов по строкам тоже надо пересчитывать, так как меняется общая сумма резерва
					//если СтрТЗ.ПроцентРезерва<>СтрТЧ.ПроцентРезерва или СтрТЗ.Договор_Резерв<>СтрТЧ.Договор_Резерв  тогда
					если СтрТЗ.ПроцентРезерва<>СтрТЧ.ПроцентРезерва или СтрТЗ.Договор_Резерв<>СтрТЧ.Договор_Резерв  ИЛИ СтрТЗ.ДопРасходы <> СтрТЧ.ДопРасходы тогда
					//крохин конец 27.01.2020	
						БылиИзмененияВТаблицеРезервов=Истина;
						БылПроцентРезерва=БылПроцентРезерва+1;    //Чтобы был процент отличался от текущего
					КонецЕсли;			
				Исключение
					БылиИзмененияВТаблицеРезервов=Истина;
					БылПроцентРезерва=БылПроцентРезерва+1;    //Чтобы был процент отличался от текущего					
				КонецПопытки;
			КонецЕсли;	
			если БылиИзмененияВТаблицеРезервов=Истина тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//Кухарь 20.09.19 конец	
	
	Для Каждого СтрокаТЧ Из Заказы Цикл		
		Если СтрокаТЧ.НомерПоставщика<>СтрокаТЧ.Заказ.НомерПоставщика Тогда
			СтрокаТЧ.НомерПоставщика=СтрокаТЧ.Заказ.НомерПоставщика;		
		КонецЕсли; 		
		ЗаполнитьСтрокуКурса(СтрокаТЧ.Заказ,Истина);		
	КонецЦикла;  
	
	ЕстьИзменения		=Модифицированность();	
	Если НЕ ОбменДанными.Загрузка Тогда
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
		Если Отказ Тогда Возврат КонецЕсли;		
	КонецЕсли;
	
	Если ЕстьИзменения Тогда 
		РассчитатьРублевыеСуммы();
		
		СуммаДокумента			= Заказы.Итог("СуммаЗаказа");
		СуммаДокументаВсегоРуб  = Заказы.Итог("РасчетнаяСуммаПНК");
		ОбъемДокумента			= Заказы.Итог("Объем");
		КоличествоДокумента 	= Заказы.Итог("Количество");
		
		ГруппыТоваров   		= ГруппыТоваровМашины(ЭтотОбъект);
		//крохин начало 14.05.2019
		КоличествоКоробов = Заказы.Итог("КоличествоКоробов");
		//крохин конец 14.05.2019
	КонецЕсли;	
	
		//+++Чирков 2024.03.21
		Если ЕстьИзменения Тогда
			ПередЗаписью_Маркировка();		
		КонецЕсли; 
		//---Чирков 2024.03.21	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Принудительно=(БылКурс<>Курс ИЛИ ПроцентРезерва<>БылПроцентРезерва);
	ОбновитьДанныеЗаказов(Принудительно);
КонецПроцедуры

Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,Записывать=Ложь)
	Для Каждого НаборДвижений Из ДвиженияПоРегистрам Цикл
		ИмяРегистра		=НаборДвижений.Ключ;
		ТаблицаДвижения =НаборДвижений.Значение;
		
		Если Движения.Найти(ИмяРегистра)=Неопределено Тогда Возврат  КонецЕсли; 
		
		НаборЗаписей=Движения[ИмяРегистра];		
		НаборЗаписей.Очистить();
		
		Для Каждого Движение Из ТаблицаДвижения Цикл
			Запись=НаборЗаписей.Добавить();	
			ЗаполнитьЗначенияСвойств(Запись,Движение);	
			
			Запись.Регистратор=Ссылка;
		КонецЦикла;	
		
		Если Записывать Тогда
			НаборЗаписей.Записать();		
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры 

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	Рубли		=ПараметрыСеанса.ВалютаНац;
	ВалютаУпр   =?(Дата>='20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);
	КурсУпр		=ПолучитьКурсВалюты_ПоРусски(ВалютаУпр,Дата);
	
	Для Каждого СтрокаДР Из Расходы Цикл	
		Если СтрокаДР.Всего=0 Тогда Продолжить КонецЕсли; 
		
		Если НЕ СтрокаДР.СтатьяЗатрат.Пустая() Тогда
			Движение=Движения.Затраты.Добавить();		
			Движение.Период			=Дата;
			Движение.ВидДвижения	=ВидДвиженияНакопления.Приход;
			
			Движение.Подразделение	=Склад.Подразделение;
			Движение.СтатьяЗатрат	=СтрокаДР.СтатьяЗатрат;
			
			Движение.Сумма			=глПересчет(СтрокаДР.Всего,СтрокаДР.Валюта,СтрокаДР.Курс,Рубли,Дата);
			
			Движение.СуммаДокумента	=СтрокаДР.Всего;
			Движение.ВалютаДокумента=СтрокаДР.Валюта;	
			//крохин начало
			Движение.Комментарий     = "Доп. расходы по машине "+Номер;
			//крохин конец
			
		Иначе
			ВалютаРасчетов=ПолучитьВалютуРасчетов(СтрокаДР.Договор);
			
			Движение=Движения.Взаиморасчеты.Добавить();		
			
			Движение.Период=Дата;
			Движение.ВидДвижения	=ВидДвиженияНакопления.Расход;
			
			Движение.Контрагент		=?(СтрокаДР.Контрагент.Ведущий.Пустая(),СтрокаДР.Контрагент,СтрокаДР.Контрагент.Ведущий);
			Движение.Договор		=СтрокаДР.Договор;
			
			Движение.СуммаВал		=глПересчет(СтрокаДР.Всего,СтрокаДР.Валюта,СтрокаДР.Курс,ВалютаРасчетов,Дата);
			Движение.СуммаУпр		=глПересчет(СтрокаДР.Всего,СтрокаДР.Валюта,СтрокаДР.Курс,ВалютаУпр,Дата);
			
			Движение.СуммаДокумента	=СтрокаДР.Всего;
			Движение.ВалютаДокумента=СтрокаДР.Валюта;
		КонецЕсли; 	
	КонецЦикла;
	
	//Кухарь 20.09.19 начало
	//Процент резеров из ТЧ РаспределениеРасходов	
	если ИспользоватьТаблицуРезервов = Истина тогда
		ТЗРезервов=РаспределениеРасходов.Выгрузить(,"Договор_Резерв,СуммаРезерва");
		ТЗРезервов.Свернуть("Договор_Резерв","СуммаРезерва");
		Для каждого СтрТЗ из ТЗРезервов цикл
			если СтрТЗ.СуммаРезерва= 0 тогда Продолжить;КонецЕсли;
			СуммаРезерва=СтрТЗ.СуммаРезерва;
			ВалютаРасчетов=ПолучитьВалютуРасчетов(СтрТЗ.Договор_Резерв);		
			Движение=Движения.Взаиморасчеты.Добавить();			
			Движение.Период=Дата;
			Движение.ВидДвижения	=ВидДвиженияНакопления.Расход;		
			Движение.Контрагент		=?(Контрагент_Резерв.Ведущий.Пустая(),Контрагент_Резерв,Контрагент_Резерв.Ведущий);
			Движение.Договор		=СтрТЗ.Договор_Резерв;	
			Движение.СуммаВал		=глПересчет(СуммаРезерва,ПараметрыСеанса.ВалютаНац,Курс,ВалютаРасчетов,Дата);
			Движение.СуммаУпр		=глПересчет(СуммаРезерва,ПараметрыСеанса.ВалютаНац,Курс,ВалютаУпр,Дата);		
			Движение.СуммаДокумента	=СуммаРезерва;
			Движение.ВалютаДокумента=ПараметрыСеанса.ВалютаНац;			
		КонецЦикла;	
	иначе
		//Кухарь 20.09.19 конец	
		
		
		СуммаРезерва=Заказы.Итог("СуммаРезерва");
		Если СуммаРезерва<>0 Тогда
			ВалютаРасчетов=ПолучитьВалютуРасчетов(Договор_Резерв);
			
			Движение=Движения.Взаиморасчеты.Добавить();		
			
			Движение.Период=Дата;
			Движение.ВидДвижения	=ВидДвиженияНакопления.Расход;
			
			Движение.Контрагент		=?(Контрагент_Резерв.Ведущий.Пустая(),Контрагент_Резерв,Контрагент_Резерв.Ведущий);
			Движение.Договор		=Договор_Резерв;
			
			Движение.СуммаВал		=глПересчет(СуммаРезерва,ПараметрыСеанса.ВалютаНац,Курс,ВалютаРасчетов,Дата);
			Движение.СуммаУпр		=глПересчет(СуммаРезерва,ПараметрыСеанса.ВалютаНац,Курс,ВалютаУпр,Дата);
			
			Движение.СуммаДокумента	=СуммаРезерва;
			Движение.ВалютаДокумента=ПараметрыСеанса.ВалютаНац;		
		КонецЕсли; 
	КонецЕсли;
	Если Проведен И (ДопРасходы<>0 ИЛИ ПроцентРезерва<>0 или РаспределениеРасходов.Итог("ПроцентРезерва")<>0) Тогда	
		Для Каждого СтрокаТЗ Из Заказы Цикл
			Заказ		=СтрокаТЗ.Заказ;
			ВалютаЗаказа=Заказ.Валюта;
			КурсЗаказа	=Заказ.Курс;
			
			Заказ=СтрокаТЗ.Заказ;
			Для Каждого СтрокаТЧ Из Заказ.Товары Цикл
				СуммаДР=СтрокаТЧ.РасчетнаяСумма-глПересчет(СтрокаТЧ.ДопРасходыПоИнвойсу+СтрокаТЧ.Всего,ВалютаЗаказа,КурсЗаказа,ВалютаУпр,КурсУпр);
				Если СуммаДР<>0 Тогда
					Движение=Движения.ТоварыВПути.Добавить();
					Движение.Период			=Дата;
					Движение.ВидДвижения	=ВидДвиженияНакопления.Приход;
					Движение.Заказ			=Заказ;
					Движение.Номенклатура	=СтрокаТЧ.Номенклатура;
					Движение.Сумма			=СуммаДР;					
				КонецЕсли; 
			КонецЦикла; 
		КонецЦикла; 	
	КонецЕсли; 
	
	Если ДопРасходыПоГТД<>0 Тогда
		ВалютаРасчетов			= ПолучитьВалютуРасчетов(Договор_Таможня);
		
		Движение				= Движения.Взаиморасчеты.Добавить();		
		
		Движение.Период			= Дата;
		Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;
		
		Движение.Контрагент		= ?(Таможня.Ведущий.Пустая(),Таможня,Таможня.Ведущий);
		Движение.Договор		= Договор_Таможня;
		
		Движение.СуммаВал		= глПересчет(ДопРасходыПоГТД,ПараметрыСеанса.ВалютаНац,Курс,ВалютаРасчетов,Дата);
		Движение.СуммаУпр		= глПересчет(ДопРасходыПоГТД,ПараметрыСеанса.ВалютаНац,Курс,ВалютаУпр,Дата);
		
		Движение.СуммаДокумента	= ДопРасходыПоГТД;
		Движение.ВалютаДокумента= ПараметрыСеанса.ВалютаНац;	
	КонецЕсли; 
	
	ПровестиПоГТД();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)	
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	Если Основание=Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;
	
	// Кухарь А.Ю.  15.03.2024 начало
	если ЗначениеЗаполнено(Договор) тогда
		Организация=ПолучитьРеквизитШапки(Договор,"Организация","Справочник");
	КонецЕсли;
	// Кухарь А.Ю.  15.03.2024 конец
	
	ВидОснования	= Основание.Метаданные().Имя;
	
	ДокОснование	= Основание;
	
	ИБ				= Основание.ИБ;	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	СостояниеНакладной	=Неопределено;
	Автор				=Неопределено;
	
	Заказы.Очистить();
	//Кухарь 23.09.19 начало
	//Конфигураторная ошибка
	//Для Каждого СтрокаДР Из ДопРасходы Цикл
	Для Каждого СтрокаДР Из расходы Цикл	
		//Кухарь 23.09.19 конец	
		СтрокаДР.Всего=0;	
	КонецЦикла;  
	
	// Кухарь А.Ю.  15.03.2024 начало
	если ЗначениеЗаполнено(Договор) тогда
		Организация=ПолучитьРеквизитШапки(Договор,"Организация","Справочник");
	КонецЕсли;
	// Кухарь А.Ю.  15.03.2024 конец
	
	СуммаДопРасходов=0;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	ОчиститьДвиженияДокументаПоИстории(Ссылка);
КонецПроцедуры

#Область Маркировка


Процедура ПередЗаписью_Маркировка()
	ТребуетсяМаркировка = ТребуетсяМаркировка();
	Если ТребуетсяМаркировка Тогда
		Если СтатусМаркировки.Пустая() ИЛИ СтатусМаркировки = Перечисления.СтатусыДоков_Маркировка.НеТребуется Тогда
			СтатусМаркировки = Перечисления.СтатусыДоков_Маркировка.ВРаботе;	
		КонецЕсли;
	Иначе                                                                   
		СтатусМаркировки = Перечисления.СтатусыДоков_Маркировка.НеТребуется;
	КонецЕсли;	 
КонецПроцедуры

Функция ТребуетсяМаркировка()	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ
	|	Документ.Машина.Заказы
	|ГДЕ
	|	Ссылка = &Ссылка
	|	И Заказ.ТребуетсяМаркировка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат (Выборка.Количество()>0);
КонецФункции //ТребуетсяМаркировка()


#КонецОбласти 