Функция ЗаблокироватьТаблицу(Знач мНоменклатура = Неопределено, Знач ТипШК = Неопределено) Экспорт  
	Блокировка				= Новый БлокировкаДанных;					
					
	ЭлементБлокировки 		= Блокировка.Добавить("РегистрСведений.СтатусыКМ_Факт");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;					
	
	Если ЗначениеЗаполнено(мНоменклатура) Тогда
		тНоменклатура = Новый ТаблицаЗначений;
		тНоменклатура.Колонки.Добавить("Номенклатура",  Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		
		Если ТипЗнч(мНоменклатура) =  Тип("Массив") Тогда
			Для Каждого Номенклатура Из мНоменклатура Цикл
				СтрокаТЧ = тНоменклатура.Добавить();
				СтрокаТЧ.Номенклатура = Номенклатура;
			КонецЦикла;
		Иначе
			СтрокаТЧ = тНоменклатура.Добавить();
			СтрокаТЧ.Номенклатура = мНоменклатура;
		КонецЕсли;
		
		ЭлементБлокировки.ИсточникДанных = тНоменклатура; 
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипШК) Тогда
		ЭлементБлокировки.УстановитьЗначение("ТипШК", ТипШК); 		
	КонецЕсли;	
	
	Блокировка.Заблокировать();                         

КонецФункции //ЗаблокироватьТаблицу() Экспорт

Функция УстановитьСтатусКМ(МассивКМ, Статус, Регистратор, ДопПараметры = Неопределено) Экспорт
	Если НЕ ЗначениеЗаполнено(Регистратор) Тогда Возврат Ложь КонецЕсли; 
	
	Если ТипЗнч(МассивКМ) = Тип("Массив") Тогда
		Коды = МассивКМ;		
	Иначе
		Коды = Новый Массив;		
		Коды.Добавить(МассивКМ);
	КонецЕсли;
	
	Местонахождение = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Местонахождение", ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла());
	ВПути 			= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ВПути", 	Ложь);
	Добавлять		= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Добавлять", Ложь);
	
	НЗ = РегистрыСведений.СтатусыКМ_Факт.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(Регистратор, Истина);
	
	Период = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Период");
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		Период = ПолучитьРеквизитШапки(Регистратор, "Дата");	
	КонецЕсли; 
	
	Для каждого ДанныеШК Из ПолучитьДанныеКМ(Коды) Цикл
		Запись = НЗ.Добавить();
		
		Запись.Период 			= Период;
		
		Запись.ШтрихКодУпаковки = ДанныеШК.ШтрихКодУпаковки;
		Запись.Номенклатура		= ДанныеШК.Номенклатура;
		Запись.ТипШК			= ДанныеШК.ТипШК;
		
		Запись.Статус 			= Статус;
		Запись.Местонахождение 	= Местонахождение;
		Запись.ВПути			= ВПути;		
	КонецЦикла; 
	
	НачатьТранзакцию();
	
	Попытка
		УстановитьБлокировкуПоНаборуЗаписей(НЗ);	
	Исключение       
		ОтменитьТранзакцию();
		ЗаписатьВЛог("Отладка", "Ошибка блокировки таблицы статусов. Регистратор: " + Регистратор, "Ошибка");
		Возврат Ложь;
	КонецПопытки;		
	
	Попытка
		Если Добавлять Тогда
			НЗ.Записать(Ложь);
		Иначе		
			НЗ.Записать(Истина);
		КонецЕсли;
	Исключение
		ОтменитьТранзакцию();
		ЗаписатьВЛог("Отладка", "Ошибка записи статусов. Регистратор: " + Регистратор, "Ошибка");
		Возврат Ложь;
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();		
	
	Возврат Истина;
КонецФункции //УстановитьСтатусКМ(МассивКМ, Регистратор, ДопПараметры = Неопределено)

Функция ПолучитьДанныеКМ(МассивКМ)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ	
	|	Ссылка		КАК ШтрихКодУпаковки,
	|	ТипШК		КАК ТипШК,
	|	ВЫБОР 
	|		КОГДА ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука) ТОГДА Владелец	
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК Номенклатура		
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	Ссылка В (&МассивКМ)
	|";         
	
	Запрос.УстановитьПараметр("МассивКМ", МассивКМ);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции //ПолучитьДанныеКМ(МассивКМ)

Функция ОчиститьДвижения(ДокСсылка) Экспорт
	НЗ = РегистрыСведений.СтатусыКМ_Факт.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(ДокСсылка, Истина);
	
	Если ЗначениеЗаполнено(НЗ.Отбор.Регистратор.Значение) Тогда
		НЗ.Записать();			
	КонецЕсли;
КонецФункции //ОчиститьДвижения(ДокСсылка) Экспорт

Функция УстановитьБлокировкуПоНаборуЗаписей(НаборЗаписей) Экспорт
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки 		= Блокировка.Добавить("РегистрСведений.СтатусыКМ_Факт");
	ЭлементБлокировки.Режим 			= РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки.ИсточникДанных 	= НаборЗаписей.Выгрузить();
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ШтрихКодУпаковки", "ШтрихКодУпаковки");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", 	"Номенклатура");
	
	Блокировка.Заблокировать();	
КонецФункции //УстановитьБлокировкуПоНЗ(НаборЗаписей) Экспорт

#Область ОбменДанными

Функция ПолучитьПравилоВыгрузки() Экспорт
	ПравилоВыгрузки = ОбменДаннымиЧЗ.ПолучитьПравилоВыгрузкиРегистра_ПоРегистратору("РегистрСведений.СтатусыКМ_Факт", "СтатусыКМ_Факт");
	ПравилоВыгрузки.Вставить("РазмерПорции", 50000);
	
	ПравилоВыгрузки.ТекстЗапросаИзменений = "		
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Изменения.Регистратор КАК Ссылка,
	|	СУММА(ВЫБОР КОГДА Записи.Регистратор ЕСТЬ NULL ТОГДА 0 ИНАЧЕ 1 КОНЕЦ) КАК КолЗаписей
	|ИЗ	
	|	РегистрСведений.СтатусыКМ_Факт.Изменения КАК Изменения
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СтатусыКМ_Факт	КАК Записи            
	|ПО
	|	Изменения.Регистратор = Записи.Регистратор
	|ГДЕ
	|	Узел = &УзелПолучатель И
	|	ВЫБОР            
	|		КОГДА ТипЗначения(&УзелПолучатель) = Тип(ПланОбмена.Свертка) ТОГДА Истина
	|		КОГДА Изменения.Регистратор ССЫЛКА Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ ТОГДА
	|			ВЫБОР 
	|				КОГДА ВЫРАЗИТЬ(Изменения.Регистратор КАК Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ).СпособВводаВОборот = ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.Импорт) ТОГДА
	|					ВЫБОР 
	|						КОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ТекущаяДата,День),НАЧАЛОПЕРИОДА(&ТекущаяДата,Час),Час) МЕЖДУ 5 И 8 ТОГДА Истина //Можно все
	|						ИНАЧЕ Ложь
	|					КОНЕЦ
	|				ИНАЧЕ Истина 
	|			КОНЕЦ
	|		ИНАЧЕ Истина
	|	КОНЕЦ
	|СГРУППИРОВАТЬ ПО
	|	Изменения.Регистратор
	|";	
	
	Возврат ПравилоВыгрузки;	
КонецФункции //ПолучитьПравилоВыгрузки() Экспорт

#КонецОбласти