
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	рПроверки = ПроверитьДокументыКОбработке(ПараметрКоманды);
	
	Для Каждого ТекстОшибки Из рПроверки.ОшибкиДокументов Цикл
		Сообщить(ТекстОшибки, СтатусСообщения.Важное);	
	КонецЦикла;
	
	Для Каждого ДокСсылка Из рПроверки.ДокументыКОбработке Цикл
		рОбработки = МаркировкаВС.ЗакрытьЗаказКМ(ДокСсылка);
		
		Если рОбработки.Успешно Тогда
			ОповеститьОбИзменении(ДокСсылка);
			Оповестить("ИзмененСтатус", , ДокСсылка);
			
			ТекстСообщения = СтрШаблон("Закрыт заказ КМ: %1.", ДокСсылка);
			Сообщить(ТекстСообщения, СтатусСообщения.Информация);	
		Иначе
			Если рОбработки.Ошибки.Количество() = 0 Тогда			
				Сообщить("Документ в обработке...", СтатусСообщения.Обычное);	
			Иначе								
				Если рОбработки.Ошибки.Количество()>0 Тогда
					ТекстОшибки = СтрСоединить(рОбработки.Ошибки, Символы.ПС);
				Иначе
					ТекстОшибки = Неопределено;				
				КонецЕсли; 
				Сообщить(СтрСоединить(рОбработки.Ошибки, Символы.ПС), СтатусСообщения.Важное);
				МаркировкаК.УстановитьСтатусДокументаМаркировки(ДокСсылка, Перечисления.СтатусыДокументовМаркировки.ОшибкаОбработки, ТекстОшибки);
			КонецЕсли;			
		КонецЕсли;		
	КонецЦикла;	
	
	Если рПроверки.ДокументыКОбработке.Количество() = 0 Тогда
		Сообщить("Не найдено подходящих документов для обработки.", СтатусСообщения.Внимание);	
	КонецЕсли; 
КонецПроцедуры

 
&НаСервере
Функция ПроверитьДокументыКОбработке(мСсылки)
	Результат = Новый Структура("ОшибкиДокументов,ДокументыКОбработке", Новый Массив, Новый Массив, Новый Массив);
	
	Для Каждого ДокСсылка Из мСсылки Цикл			
		рПроверки = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ПроверитьДокументПередЗакрытием(ДокСсылка);
		Если рПроверки.Успешно Тогда
			Результат.ДокументыКОбработке.Добавить(ДокСсылка);
		Иначе
			МаркировкаКС.ДобавитьОшибки(Результат.ОшибкиДокументов, рПроверки);				
		КонецЕсли;
	КонецЦикла; 	
	
	Возврат Результат;
КонецФункции //ПроверитьДокументыКОбработке(мСсылки)

 
