
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ПланОбмена.ДанныеЧЗ.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	рВыгрузки = ВыгрузитьДанные(ПараметрКоманды);
КонецПроцедуры


&НаСервере
Функция ВыгрузитьДанные(УзелСсылка)
	Возврат УзелСсылка.ПолучитьОбъект().ЗаписатьСообщениеСИзменениями();
КонецФункции // ()
 
