
&НаКлиенте
Процедура Товары_Номенклатура_ПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТекСтрока.ГТИН = Прав("00000000000000" + ПолучитьРеквизитШапки(ТекСтрока.Номенклатура,"ГТИН"), 14);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеВидимостью();	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦветаЧЗ(СписокНоменклатуры)
	Значения = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Объект,
	|	Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	Объект В (&СписокНоменклатуры)
	|	И Свойство = &Свойство_ЦветЧЗ
	|";
	
	Запрос.УстановитьПараметр("Свойство_ЦветЧЗ", 	Маркировка_ПИ.Свойство_ЦветЧЗ());
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Значения[Выборка.Объект] = Выборка.Значение;			
	КонецЦикла;
	
	Возврат Значения;
КонецФункции // ()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗаполнитьЦветаЧЗ();	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦветаЧЗ()
	Цвета = ПолучитьЦветаЧЗ(Объект.Товары.Выгрузить(,"Номенклатура").ВыгрузитьКолонку("Номенклатура"));
	
	Для Каждого СтрокаТ Из Объект.Товары Цикл	
		СтрокаТ.ЦветЧЗ = Цвета[СтрокаТ.Номенклатура]	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ЗаполнитьЦветаЧЗ();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УправлениеВидимостью();
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью()
	мТолькоПросмор = (Объект.Статус <> Перечисления.СтатусыДокументовМаркировки.ВРаботе) ИЛИ ТолькоПросмотр;
	
	Для Каждого ИмяРеквизита ИЗ СтрРазделить("Номер,Дата,Организация,Товары",",") Цикл	
		Элементы[ИмяРеквизита].ТолькоПросмотр	= мТолькоПросмор;
	КонецЦикла;
	
	Элементы.Статус.ТолькоПросмотр = ТолькоПросмотр ИЛИ НЕ РольДоступна("Администратор");	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элемент.ТекущиеДанные;
	Если Поле.Имя = "ТоварыНоменклатураРодитель" Тогда
		ОткрытьЗначение(Модель(ТекДанные.Номенклатура));	
	ИначеЕсли СтрНачинаетсяС(Поле.Имя, "ТоварыНоменклатура") Тогда
		ОткрытьЗначение(ТекДанные.Номенклатура);			
	КонецЕсли;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция Модель(Номенклатура)
	Возврат ПолучитьРеквизитШапки(Номенклатура, "Родитель");
КонецФункции // ()

&НаКлиенте
Процедура Заполнить(Команда)
	Заполнить_НаСервере();
КонецПроцедуры

&НаСервере
Процедура Заполнить_НаСервере()
	
	Запрос			= Новый Запрос;
	Запрос.Текст	= "
	|ВЫБРАТЬ
	|	Ссылка	КАК Номенклатура,
	|	ГТИН	КАК ГТИН,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.НеСоздана) КАК Статус 	
	|ИЗ
	|	Справочник.Номенклатура 
	|ГДЕ
	|	НЕ ЭтоГруппа
	|	И НЕ ПометкаУдаления
	|	И Родитель.ТНВЭД.ДатаНачалаРаботыСМаркировкой МЕЖДУ ДАТАВРЕМЯ(2000,1,1) И &ДатаДок
	|";                                                                        
	
	Запрос.УстановитьПараметр("ДатаДок", КонецДня(Объект.Дата));
	
	Объект.Товары.Очистить();
	Объект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)	
КонецПроцедуры

&НаКлиенте
Процедура кнПроверитьДублиКарточек(Команда)
	Элементы.Товары.ВыделенныеСтроки.Очистить();
	Если Объект.Ссылка.Пустая() Тогда
		Если МаркировкаК.ЗаписатьНовыйОбъектВУпрФорме(ЭтаФорма) Тогда
			ПроверитьДублиКарточек();	 
		КонецЕсли;		
	Иначе
		Если МаркировкаК.ЗаписатьИзмененныйОбъектВУпрФорме(ЭтаФорма) Тогда			
			ПроверитьДублиКарточек();		
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьДублиКарточек()
	рПроверки = Документы.ЗаявкаНаПередачуКарточекНоменклатурыВЧЗ.ПроверитьДублиКарточек(Объект.Ссылка);
	Если НЕ рПроверки.Успешно Тогда
		Дубли  = рПроверки.Дубли;
		Для каждого СтрокаТЧ Из Объект.Товары Цикл			
			СтрокаТЧ.Дубль = (Дубли[СтрокаТЧ.Номенклатура] = Истина); 		
		КонецЦикла;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоКодамНоменклатуры(Команда)
	//Валетов + 15,01,25 Заполнение по кодам номенклатуры. https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1895
	СТрВвода = "";
	Если Объект.товары.Количество() > 0 Тогда
		Текст = "ТЧ товары будет очищена перед заполнением. Продолжить?";
		Ответ = Вопрос(Текст, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, );
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.Товары.Очистить();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ВвестиСтроку(СТрВвода,"Введите коды номенклатуры ",,Истина) Тогда
		Для Каждого Строка Из СтрРазделить(СТрВвода, Символы.ПС) Цикл
			
			Номэл = Справочники.Номенклатура.НайтиПоКоду(Строка);
			
			Если не Номэл = Неопределено Тогда
				Если НЕ Номэл.ЭтоГруппа Тогда
					СтрТовары = Объект.Товары.Добавить();
					СтрТовары.Номенклатура   = Номэл;
					СтрТовары.ГТИН           = Номэл.ГТИН;
					СтрТовары.Статус    	 = Номэл.СтатусКарточкиВЧЗ;
				КонецЕсли;
			КонецЕсли
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

//Валетов + 24,09,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3021
&НаКлиенте
Процедура ТоварыГТИНПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные; 
	НоменклатураОб = ТекСтрока.Номенклатура.ПолучитьОбъект();
	Если Не ЗначениеЗаполнено(НоменклатураОб.ГТИН) И ЗначениеЗаполнено(ТекСтрока.ГТИН) Тогда
		НоменклатураОб.ГТИН = СокрЛП(ТекСтрока.ГТИН); 
		НоменклатураОб.Записать();
	КонецЕсли;	
КонецПроцедуры 
//Валетов -
