
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	НаборЗаписей = РегистрыСведений.МинимальныеОстаткиНаСкладах.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	
	ТЗСостав = Состав.Выгрузить();
	ТЗСостав.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	ТЗСостав.Колонки.Добавить("Регистратор", Новый ОписаниеТипов("ДокументСсылка.МинимальныеОстаткиНаСкладах"));
	
	ТЗСостав.ЗаполнитьЗначения(Дата, "Период");
	ТЗСостав.ЗаполнитьЗначения(Ссылка, "Регистратор");
	
	ТЗСтроки = ТЗСостав.НайтиСтроки(Новый Структура("Номенклатура", Справочники.Номенклатура.ПустаяСсылка()));
	Для Каждого СтрокаУдаления Из ТЗСтроки Цикл
    	ТЗСостав.Удалить(СтрокаУдаления);
	КонецЦикла;
	
	НаборЗаписей.Загрузить(ТЗСостав);
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры
