
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.	
	
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли; 
	
	НадоПерезаписыватьСкидки	= Ложь;
	ЕстьИзменения				= Модифицированность();
	//
	//Если НЕ ОбменДанными.Загрузка Тогда
	//	КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
	//	МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
	//	
	//	Если Отказ Тогда Возврат КонецЕсли; 	
	//КонецЕсли;		
	//
	//УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	НаборЗаписей = РегистрыСведений.РезервированиеШКGS1.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.документРегистрации.Установить(ЭтотОбъект.ссылка); 
	
	Ошибка = 0;
	
	Для каждого Текстрока из РезервныеШК цикл
		
	
		УжеЕсть = ПроверкаШКGS1НаИспользование(ТЕкСтрока.ШК) ;
	
		
		Если УжеЕсть тогда
			//сообщить("Проведение отменено");
		Иначе
			НоваяЗапись = НаборЗаписей.Добавить(); 
			НоваяЗапись.ДокументРегистрации = ЭтотОбъект.ссылка; 
			НоваяЗапись.GS1 = ТЕкСтрока.ШК;
			             //GS1
		КонецЕсли;
		
	КонецЦикла; 
	Если НЕ ошибка Тогда
		НаборЗаписей.Записать(); 
	иначе
		Отказ=истина;
		#если клиент тогда
			сообщить("Проведение отменено");
		#конецесли
	конецЕсли;
	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	// сделать проверку, что ШК еще не использовали. иначе не распроводить????
	
	НаборЗаписей = РегистрыСведений.РезервированиеШКGS1.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.документРегистрации.Установить(ЭтотОбъект.ссылка); 
	Наборзаписей.Записать();
	Ошибка = 0;

	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	резервныеШк.Очистить();
	
КонецПроцедуры     
