#Область ПрограммныйИнтерфейс             


Процедура ОжидатьЗавершение(Знач ДлительнаяОперация, Знач ОповещениеОЗавершении = Неопределено, 
	Знач ПараметрыОжидания = Неопределено) Экспорт
	
	ПроверитьПараметрыОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
	РасширенныеПараметры = ПараметрыОжидания(Неопределено);
	Если ПараметрыОжидания <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(РасширенныеПараметры, ПараметрыОжидания);
	КонецЕсли;
	Если ДлительнаяОперация.Свойство("АдресРезультата") Тогда
		РасширенныеПараметры.Вставить("АдресРезультата", ДлительнаяОперация.АдресРезультата);
	КонецЕсли;
	Если ДлительнаяОперация.Свойство("АдресДополнительногоРезультата") Тогда
		РасширенныеПараметры.Вставить("АдресДополнительногоРезультата", ДлительнаяОперация.АдресДополнительногоРезультата);
	КонецЕсли;
	РасширенныеПараметры.Вставить("ИдентификаторЗадания", ДлительнаяОперация.ИдентификаторЗадания);
	
	Если ДлительнаяОперация.Статус <> "Выполняется" Тогда
		РасширенныеПараметры.Вставить("НакопленныеСообщения", Новый Массив);
		РасширенныеПараметры.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
		Если РасширенныеПараметры.ВыводитьОкноОжидания Тогда
			ОбработатьСообщенияПользователю(ДлительнаяОперация.Сообщения,
				РасширенныеПараметры.НакопленныеСообщения,
				РасширенныеПараметры.ВыводитьСообщения,
				РасширенныеПараметры.ФормаВладелец);
			ЗавершитьДлительнуюОперацию(РасширенныеПараметры, ДлительнаяОперация);
		Иначе
			ДлительнаяОперация.Вставить("Прогресс");
			ДлительнаяОперация.Вставить("ФоновоеЗаданиеЗавершено");
			ОбработатьРезультатАктивнойОперации(РасширенныеПараметры, ДлительнаяОперация);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если РасширенныеПараметры.ВыводитьОкноОжидания Тогда
		РасширенныеПараметры.Удалить("ФормаВладелец");
		
		Контекст = Новый Структура;
		Контекст.Вставить("Результат");
		Контекст.Вставить("ИдентификаторЗадания", РасширенныеПараметры.ИдентификаторЗадания);
		Контекст.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПриЗакрытииФормыДлительнаяОперация", инт_ДлительныеОперацииК, Контекст);
		
		ОткрытьФорму("ОбщаяФорма.инт_ДлительнаяОперация", РасширенныеПараметры, 
			?(ПараметрыОжидания <> Неопределено, ПараметрыОжидания.ФормаВладелец, Неопределено),
			,,,ОповещениеОЗакрытии, РасширенныеПараметры.РежимОткрытияОкнаОжидания);
	Иначе
		ТекущийИнтервал = ?(РасширенныеПараметры.Интервал <> 0, РасширенныеПараметры.Интервал, 1);
		
		РасширенныеПараметры.Вставить("НакопленныеСообщения",	Новый Массив);
		РасширенныеПараметры.Вставить("ОповещениеОЗавершении",	ОповещениеОЗавершении);
		РасширенныеПараметры.Вставить("ТекущийИнтервал",		ТекущийИнтервал);
		РасширенныеПараметры.Вставить("Контроль", 				ТекущаяДата() + ТекущийИнтервал);
		РасширенныеПараметры.Вставить("ВремяОтправкиПоследнегоПрогресса", 0);
		
		РасширенныеПараметры.Вставить("ВыводитьПрогрессВыполнения", Истина);
		
		Операции = АктивныеДлительныеОперации();
		Операции.Список.Вставить(РасширенныеПараметры.ИдентификаторЗадания, РасширенныеПараметры);
		
		СохранитьАктивныеДО(Операции);
		
		ПодключитьОбработчикОжидания("инт_КонтрольДлительныхОпераций", ТекущийИнтервал, Истина);
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыОжидания(ФормаВладелец) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ФормаВладелец", ФормаВладелец);
	Результат.Вставить("ТекстСообщения", "");
	Результат.Вставить("Заголовок", ""); 
	Результат.Вставить("НомерПопытки", 1);
	Результат.Вставить("ВыводитьОкноОжидания", Истина);
	Результат.Вставить("РежимОткрытияОкнаОжидания", Неопределено);
	Результат.Вставить("ВыводитьПрогрессВыполнения", Ложь);
	Результат.Вставить("ОповещениеОПрогрессеВыполнения", Неопределено);
	Результат.Вставить("ВыводитьСообщения", Ложь);
	Результат.Вставить("Интервал", 0);
	Результат.Вставить("ПолучатьРезультат", Ложь);
	Результат.Вставить("ОтменятьПриЗакрытииФормыВладельца",
		ТипЗнч(ФормаВладелец) = Тип("ФормаКлиентскогоПриложения") И ФормаВладелец.Открыта());
	
	ОповещениеПользователя = Новый Структура;
	ОповещениеПользователя.Вставить("Показать", Ложь);
	ОповещениеПользователя.Вставить("Текст", Неопределено);
	ОповещениеПользователя.Вставить("НавигационнаяСсылка", Неопределено);
	ОповещениеПользователя.Вставить("Пояснение", Неопределено);
	ОповещениеПользователя.Вставить("Картинка", Неопределено);
	ОповещениеПользователя.Вставить("Важное", Неопределено);
	Результат.Вставить("ОповещениеПользователя", ОповещениеПользователя);
	
	Возврат Результат;
	
КонецФункции


#КонецОбласти


#Область СлужебныеПроцедурыИФункции           


Функция ОбработатьРезультатАктивнойОперации(ДлительнаяОперация, Результат)
	
	Если Результат.Статус <> "Отменено" Тогда
		Если ДлительнаяОперация.ОповещениеОПрогрессеВыполнения <> Неопределено Тогда
			Прогресс = Новый Структура;
			Прогресс.Вставить("Статус", Результат.Статус);
			Прогресс.Вставить("ИдентификаторЗадания", ДлительнаяОперация.ИдентификаторЗадания);
			Прогресс.Вставить("Прогресс", Результат.Прогресс);
			Прогресс.Вставить("Сообщения", Результат.Сообщения);
			Попытка
				ВыполнитьОбработкуОповещения(ДлительнаяОперация.ОповещениеОПрогрессеВыполнения, Прогресс);
			Исключение
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				ТекстОшибки = СтрШаблон(
					НСтр("ru = 'При вызове оповещения о прогрессе длительной операции
					           |%1 возникла ошибка:
					           |%2'"),
					Строка(ДлительнаяОперация.ИдентификаторЗадания),
					ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
					
				инт_ДлительныеОперации.ЗаписьЖурналаРегистрации_("ДлительныеОперации", "Ошибка", , , ТекстОшибки);				
			КонецПопытки;
		ИначеЕсли Результат.Сообщения <> Неопределено Тогда
			Для Каждого Сообщение Из Результат.Сообщения Цикл
				ДлительнаяОперация.НакопленныеСообщения.Добавить(Сообщение);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если Результат.Статус <> "Выполняется" Тогда
		Если Результат.Статус <> "Выполнено"
		 Или Результат.Свойство("ФоновоеЗаданиеЗавершено")
		 Или Не (  ДлительнаяОперация.Свойство("АдресРезультата")
		         И ЗначениеЗаполнено(ДлительнаяОперация.АдресРезультата)
		       Или ДлительнаяОперация.Свойство("АдресДополнительногоРезультата")
		         И ЗначениеЗаполнено(ДлительнаяОперация.АдресДополнительногоРезультата))
		 // Требуется проверка, так как оповещение отправляется в конце фонового задания
		 // до его завершения и данные результата еще недоступны по адресу временного хранилища.
		 Или инт_ДлительныеОперации.ФоновоеЗаданиеЗавершено(ДлительнаяОперация.ИдентификаторЗадания) Тогда
		 
			ЗавершитьДлительнуюОперацию(ДлительнаяОперация, Результат);
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	ИнтервалОжидания = ДлительнаяОперация.ТекущийИнтервал;
	Если ДлительнаяОперация.Интервал = 0
	   И Результат.Свойство("КонтрольДлительныхОперацийБезСистемыВзаимодействия") Тогда
		ИнтервалОжидания = ИнтервалОжидания * 1.4;
		Если ИнтервалОжидания > 15 Тогда
			ИнтервалОжидания = 15;
		КонецЕсли;
		ДлительнаяОперация.ТекущийИнтервал = ИнтервалОжидания;
	КонецЕсли;
	ДлительнаяОперация.Контроль = ТекущаяДата() + ИнтервалОжидания; // АПК:143 Дата сеанса не используется для проверки интервалов
	Возврат Ложь;
	
КонецФункции

Процедура ЗавершитьДлительнуюОперацию(Знач ДлительнаяОперация, Знач Статус)
	
	Если Статус.Статус = "Выполнено" Тогда
		ПоказатьОповещение(ДлительнаяОперация.ОповещениеПользователя);
	КонецЕсли;
	
	Если ДлительнаяОперация.ОповещениеОЗавершении = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Статус.Статус = "Отменено" Тогда
		Результат = Неопределено;
	Иначе
		Результат = Новый Структура;
		Результат.Вставить("Статус",    Статус.Статус);
		Если ДлительнаяОперация.Свойство("АдресРезультата") Тогда
			Результат.Вставить("АдресРезультата", ДлительнаяОперация.АдресРезультата);
		КонецЕсли;
		Если ДлительнаяОперация.Свойство("АдресДополнительногоРезультата") Тогда
			Результат.Вставить("АдресДополнительногоРезультата", ДлительнаяОперация.АдресДополнительногоРезультата);
		КонецЕсли;
		Результат.Вставить("КраткоеПредставлениеОшибки", Статус.КраткоеПредставлениеОшибки);
		Результат.Вставить("ПодробноеПредставлениеОшибки", Статус.ПодробноеПредставлениеОшибки);
		Результат.Вставить("Сообщения", Новый ФиксированныйМассив(ДлительнаяОперация.НакопленныеСообщения));
	КонецЕсли;
	
	ОповеститьОЗавершенииДлительнойОперации(ДлительнаяОперация.ОповещениеОЗавершении,
		Результат, ДлительнаяОперация.ИдентификаторЗадания);
	
КонецПроцедуры

Процедура ОбработатьСообщенияПользователю(Сообщения, НакопленныеСообщения, ВыводитьСообщения, ВладелецФормы) Экспорт
	
	//ИдентификаторНазначения = ?(ВыводитьСообщения И ВладелецФормы <> Неопределено,
	//	ВладелецФормы.УникальныйИдентификатор, Неопределено);
	
	Для Каждого СообщениеПользователю Из Сообщения Цикл
		НакопленныеСообщения.Добавить(СообщениеПользователю);
		//Если ИдентификаторНазначения <> Неопределено Тогда
			НовоеСообщение = Новый СообщениеПользователю;
			ЗаполнитьЗначенияСвойств(НовоеСообщение, СообщениеПользователю);
			//НовоеСообщение.ИдентификаторНазначения = ИдентификаторНазначения;
			НовоеСообщение.Сообщить();
		//КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьПараметрыОжидатьЗавершение(Знач ДлительнаяОперация, Знач ОповещениеОЗавершении, Знач ПараметрыОжидания)
	
	//ОбщегоНазначенияКлиентСервер.ПроверитьПараметр("ДлительныеОперацииКлиент.ОжидатьЗавершение",
	//	"ДлительнаяОперация", ДлительнаяОперация, Тип("Структура"));
	
	Если ОповещениеОЗавершении <> Неопределено Тогда
		//ОбщегоНазначенияКлиентСервер.ПроверитьПараметр("ДлительныеОперацииКлиент.ОжидатьЗавершение",
		//	"ОповещениеОЗавершении", ОповещениеОЗавершении, Тип("ОписаниеОповещения"));
	КонецЕсли;
	
	Если ПараметрыОжидания <> Неопределено Тогда
		
		ТипыСвойств = Новый Структура;
		Если ПараметрыОжидания.ФормаВладелец <> Неопределено Тогда
			ТипыСвойств.Вставить("ФормаВладелец", Тип("ФормаКлиентскогоПриложения"));
		КонецЕсли;
		
		ТипыСвойств.Вставить("ТекстСообщения", 				Тип("Строка"));
		ТипыСвойств.Вставить("Заголовок",      				Тип("Строка"));
		ТипыСвойств.Вставить("ВыводитьОкноОжидания", 		Тип("Булево"));
		ТипыСвойств.Вставить("ВыводитьПрогрессВыполнения",	Тип("Булево"));
		ТипыСвойств.Вставить("ВыводитьСообщения", 			Тип("Булево"));
		ТипыСвойств.Вставить("Интервал", 					Тип("Число"));
		ТипыСвойств.Вставить("ОповещениеПользователя", 		Тип("Структура"));
		ТипыСвойств.Вставить("ПолучатьРезультат", 			Тип("Булево"));
		
		//ОбщегоНазначенияКлиентСервер.ПроверитьПараметр("ДлительныеОперацииКлиент.ОжидатьЗавершение",
		//	"ПараметрыОжидания", ПараметрыОжидания, Тип("Структура"), ТипыСвойств);
			
		СообщениеПроверки = СтрШаблон(
			НСтр("ru = 'Параметр %1 должен быть больше или равен 1'"), "ПараметрыОжидания.Интервал");
		
		//ОбщегоНазначенияКлиентСервер.Проверить(ПараметрыОжидания.Интервал = 0 Или ПараметрыОжидания.Интервал >= 1,
		//	СообщениеПроверки, "ДлительныеОперацииКлиент.ОжидатьЗавершение");
			
		СообщениеПроверки = СтрШаблон(
			НСтр("ru = 'Если параметр %1 установлен в %2, то параметр %3 не поддерживается'"),
			"ПараметрыОжидания.ВыводитьОкноОжидания",
			"Истина",
			"ПараметрыОжидания.ОповещениеОПрогрессеВыполнения");
			
		//ОбщегоНазначенияКлиентСервер.Проверить(Не (ПараметрыОжидания.ОповещениеОПрогрессеВыполнения <> Неопределено И ПараметрыОжидания.ВыводитьОкноОжидания), 
		//	СообщениеПроверки, "ДлительныеОперацииКлиент.ОжидатьЗавершение");
			
	КонецЕсли;

КонецПроцедуры

Процедура ОповеститьОЗавершенииДлительнойОперации(ОповещениеОЗавершении, Результат, ИдентификаторЗадания)
	
	Попытка
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, Результат);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'При вызове оповещения о завершении длительной операции
			           |%1 возникла ошибка:
			           |%2'"),
			Строка(ИдентификаторЗадания),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			
		
		инт_ДлительныеОперации.ЗаписьЖурналаРегистрации_("ДлительныеОперации", "Ошибка", , , ТекстОшибки);			
	КонецПопытки;
	
КонецПроцедуры

Процедура ПоказатьОповещение(ОповещениеПользователя, ВладелецФормы = Неопределено) Экспорт
	
	Оповещение = ОповещениеПользователя;
	Если Не Оповещение.Показать Тогда
		Возврат;
	КонецЕсли;
	
	НавигационнаяСсылкаОповещения = Оповещение.НавигационнаяСсылка;
	ПояснениеОповещения = Оповещение.Пояснение;
	
	Если ВладелецФормы <> Неопределено И ВладелецФормы.Окно <> Неопределено Тогда
		Если НавигационнаяСсылкаОповещения = Неопределено Тогда
			НавигационнаяСсылкаОповещения = ВладелецФормы.Окно.ПолучитьНавигационнуюСсылку();
		КонецЕсли;
		Если ПояснениеОповещения = Неопределено Тогда
			ПояснениеОповещения = ВладелецФормы.Окно.Заголовок;
		КонецЕсли;
	КонецЕсли;
	
	СтатусОповещения = Неопределено;
	Если ТипЗнч(Оповещение.Важное) = Тип("Булево") Тогда
		СтатусОповещения = ?(Оповещение.Важное, СтатусОповещенияПользователя.Важное, СтатусОповещенияПользователя.Информация);
	КонецЕсли;
	
	ПоказатьОповещениеПользователя(?(Оповещение.Текст <> Неопределено, Оповещение.Текст, НСтр("ru = 'Действие выполнено'")), 
		НавигационнаяСсылкаОповещения, ПояснениеОповещения, Оповещение.Картинка, СтатусОповещения);

КонецПроцедуры

Процедура ПриЗакрытииФормыДлительнаяОперация(Результат, Контекст) Экспорт
	
	Если Контекст.ОповещениеОЗавершении <> Неопределено Тогда
		ОповеститьОЗавершенииДлительнойОперации(Контекст.ОповещениеОЗавершении,
			Контекст.Результат, Контекст.ИдентификаторЗадания);
	КонецЕсли;
	
КонецПроцедуры

Функция АктивныеДлительныеОперации() Экспорт
	ИмяПараметра	= "СтандартныеПодсистемы_АктивныеДлительныеОперации";
	Операции		= МаркировкаКС.ПолучитьЗначениеПараметра(глОбщиеЗначения, ИмяПараметра);
	
	Если Операции = Неопределено Тогда
		Операции = Новый Структура;
		
		Операции.Вставить("Обработка", Ложь);
		Операции.Вставить("Список", Новый Соответствие);
		Операции.Вставить("КонтролируемыеОперации", Новый Соответствие);		
	КонецЕсли;	
	
	Возврат Операции;
КонецФункции //ПолучитьАктивныеДО() Экспорт
	
Функция СохранитьАктивныеДО(Операции) Экспорт
	ИмяПараметра	= "СтандартныеПодсистемы_АктивныеДлительныеОперации";	
	глОбщиеЗначения.Вставить(ИмяПараметра, Операции);
КонецФункции //СохранитьАктивныеДО(Операции) Экспорт


#КонецОбласти