
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	ЗаписьСервер  = РеквизитФормыВЗначение("Запись"); 
	Структураjson 	  = ЗаписьСервер.Запрос.Получить(); 
	Если ТипЗнч(Структураjson) = Тип("Структура")  Тогда
	
		ЗапросСтрока = b2b_ОбменЗаявками.ОтработатьЗаполненнуюСтруктуруОтвета(Структураjson);	
	
	КонецЕсли;
	
	Структураjson 	  = ЗаписьСервер.Ответ.Получить(); 
	Если ТипЗнч(Структураjson) = Тип("Структура")  Тогда
	
		ОтветСтрока = b2b_ОбменЗаявками.ОтработатьЗаполненнуюСтруктуруОтвета(Структураjson);	
	
	КонецЕсли; 

КонецПроцедуры
