
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)	           
	//+++Чирков 16.10.2025 - https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3054
	//Форма = ПолучитьФорму("РегистрСведений.ЗапросыЧЗ.ФормаСписка", Новый Структура);
	//
	////Валетов + 03,10,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3054 
	////ЭлОтбора = Форма.Отбор.Основание;
	////
	////ЭлОтбора.ВидСравнения	= ВидСравнения.Равно;
	////ЭлОтбора.Значение		= ПараметрКоманды;
	////ЭлОтбора.Использование	= Истина;
	//ЭлементОтбора = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Основание");
	//ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементОтбора.ПравоеЗначение 	= ПараметрКоманды;
	//ЭлементОтбора.Использование		= Истина;
	////Валетов -
	//
	//Форма.Открыть();       
	
	пФормы = Новый Структура("Отбор", Новый Структура("Основание", ПараметрКоманды));
	ОткрытьФорму("РегистрСведений.ЗапросыЧЗ.ФормаСписка", пФормы, , ПараметрКоманды);
	
	//---Чирков 16.10.2025 - https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3054
КонецПроцедуры
