#Область СобытияОбъекта

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено ИЛИ ДанныеЗаполнения.Пустая() Тогда Возврат; КонецЕсли;

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
	ДокОснование = ДанныеЗаполнения;
	Автор = ПараметрыСеанса.Пользователь;
	
	Дата = ТекущаяДатаСеанса();
	УстановитьНовыйНомер();
	
	ФлагЭтоСправочник = Ложь; ФлагЭтоДокумент = Ложь;
	
	ТипЗначения = ТипЗнч(ДанныеЗаполнения);
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
    		ФлагЭтоСправочник = Истина;
	ИначеЕсли Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
    		ИмяОснования = ДанныеЗаполнения.Метаданные().Имя;
		ФлагЭтоДокумент = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокОснование", ДанныеЗаполнения);
	Если ФлагЭтоДокумент Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(Товары.Количество, 0) КАК КоличествоИсх,
		|	ЕСТЬNULL(Товары.Количество, 0) КАК КоличествоФакт,
		|	ЕСТЬNULL(Товары.Цена, 0) КАК ЦенаИсх,
		|	ЕСТЬNULL(Товары.Цена, 0) КАК ЦенаФакт,
		|	Товары.Единица КАК Единица,
		|	ЕСТЬNULL(Товары.Коэффициент, 1) КАК Коэффициент,
		|	Товары.СтавкаНДС КАК СтавкаНДС
		|ИЗ
		|	Документ." + ИмяОснования + ".Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &ДокОснование";
		
		// " + ИмяОснования + "
		
		УстановитьПривилегированныйРежим(Истина);
		Выборка = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);
		
		Товары.Очистить();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Товары.Добавить(), Выборка);
		КонецЦикла;
	
	КонецЕсли;
	
	СуммаДокумента = Товары.Итог("Всего");

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	Н_ЗаказыПоставщикам = Движения.ЗаказыПоставщикам;
	
	Валюты_Курсы = ПолучитьСтруктуруВалютИКурсы(Валюта, Курс, Дата, Договор);
	
	Для Каждого Стр ИЗ Товары Цикл
		
		Если Стр.Количество <> 0 И Стр.ЦенаФакт <> 0 Тогда
			
			Движение = Н_ЗаказыПоставщикам.Добавить();
			
			Движение.Период = Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			
			Движение.Склад = Склад;
			Движение.Заказ = Ссылка;
			Движение.Контракт = Контракт;
			Движение.ВалютаДокумента = Валюта;
			Движение.Отправитель = Контрагент;
			
			Движение.Номенклатура = Стр.Номенклатура;
			Движение.Количество = Стр.Количество;
			Движение.СуммаРуб = глПересчет(Стр.ЦенаФакт * Стр.Количество, Валюта,Курс, Валюты_Курсы.ВалютаНац, 1);
			Движение.СуммаEUR = глПересчет(Стр.ЦенаФакт * Стр.Количество, Валюта,Курс, Валюты_Курсы.Евро, Валюты_Курсы.КурсЕвро);
			Движение.СуммаUSD = глПересчет(Стр.ЦенаФакт * Стр.Количество, Валюта,Курс, Валюты_Курсы.Доллары,	Валюты_Курсы.КурсДоллара);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Н_ЗаказыПоставщикам.Записать();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Автор = Неопределено;
	Контракт = Неопределено;
КонецПроцедуры

#КонецОбласти