///////////////////////////////////////////////////////////
//ЗАГРУЗКА ИЗ XML
Функция ТипУзла(Чтение)
	Если Чтение.КоличествоАтрибутов()>0 Тогда
		Возврат Чтение.ПолучитьАтрибут(0);			
	КонецЕсли;
	Возврат Неопределено;
КонецФункции // ТипУзла()


Функция СоздатьКолонкиТЗ(Чтение,Объект)
	Пока Чтение.Прочитать() И Чтение.Имя="Кол" И Чтение.ТипУзла=ТипУзлаXML.НачалоЭлемента Цикл		
		Чтение.Прочитать();
		Объект.Колонки.Добавить(Чтение.Значение);		
		Чтение.Прочитать(); //Конец элемента Кол
	КонецЦикла;		
	Чтение.Прочитать(); //Конец элемента Колонки	
КонецФункции // создатьКолонкиТЗ()

Процедура ЗаполнитьСтрокуТЗ(Чтение,СтрокаТЗ)	
	Пока Чтение.Прочитать() И Чтение.ТипУзла=ТипУзлаXML.НачалоЭлемента Цикл
		ИмяКолонки=Чтение.Имя;
		НомерКолонки=Число(СтрЗаменить(ИмяКолонки,"Кол",""));
		
		СтрокаТЗ[НомерКолонки-1]=ЗагрузитьОбъект(Чтение);
	КонецЦикла;
КонецПроцедуры 


Функция ЗагрузитьОбъект(Чтение)
	ТипОбъекта	=ТипУзла(Чтение);	
	ИмяУзла		=Чтение.Имя;
	
	Если ПустаяСтрока(ТипОбъекта) Тогда
		Чтение.Прочитать();		
		ТипОбъекта=ТипУзла(Чтение);	
	КонецЕсли;	
	
	Если ТипОбъекта="СписокЗначений" Тогда
		СЗ=Новый СписокЗначений;
		
		Пока Чтение.Прочитать() И Чтение.Имя="СтрокаСписка" И Чтение.ТипУзла=ТипУзлаXML.НачалоЭлемента Цикл			
			Значение		=ЗагрузитьОбъект(Чтение);			
			Представление   =ЗагрузитьОбъект(Чтение);			
			Пометка			=ЗагрузитьОбъект(Чтение);
			
			Чтение.Прочитать();//конец элемента "СтрокаСписка"
			
			Если НЕ ТипЗнч(Пометка)=Тип("Булево") Тогда
				Пометка=Ложь;			
			КонецЕсли; 
			
			СЗ.Добавить(Значение,Представление,Пометка);			
		КонецЦикла;			
		
		Если СЗ.Количество()=0 Тогда Возврат СЗ	КонецЕсли; //из-за пустого списка возникают какие-то глюки
		
		Значение=СЗ;		
	ИначеЕсли ТипОбъекта="ТаблицаЗначений" Тогда
		ТЗ=Новый ТаблицаЗначений;
		
		ИмяУзла=Чтение.Имя;
		
		Если Чтение.Прочитать() И Чтение.Имя="Колонки" И Чтение.ТипУзла=ТипУзлаXML.НачалоЭлемента Тогда				
			СоздатьКолонкиТЗ(Чтение,ТЗ);				
		КонецЕсли;			
			
		Если Чтение.Имя="Строки" И Чтение.ТипУзла=ТипУзлаXML.НачалоЭлемента Тогда
			Пока Чтение.Прочитать() И Чтение.Имя="СтрокаТЗ" И Чтение.ТипУзла=ТипУзлаXML.НачалоЭлемента Цикл
				СтрокаТЗ=ТЗ.Добавить();
				ЗаполнитьСтрокуТЗ(Чтение,СтрокаТЗ);				
			КонецЦикла;				
			
			Чтение.Прочитать(); //Конец узла "Строки"
		КонецЕсли;		
		Значение=ТЗ;
	ИначеЕсли ТипОбъекта="Число" Тогда		
		Чтение.Прочитать();		
		Значение=Число(Чтение.Значение);
	ИначеЕсли ТипОбъекта="Строка" Тогда
		Чтение.Прочитать();
		Значение=СокрЛП(""+Чтение.Значение);		
	ИначеЕсли ТипОбъекта="Дата" Тогда		
		Чтение.Прочитать();		
		
		ТекЗн=Чтение.Значение;
		Значение=?(ПустаяСтрока(ТекЗн),'00010101000000',Дата(Чтение.Значение));
	ИначеЕсли ТипОбъекта="Булево" Тогда
		Чтение.Прочитать();		
		Значение=?(Чтение.Значение="0",Ложь,Истина);		
	Иначе		
		Значение=Неопределено;
	КонецЕсли;
	
	Если Чтение.ТипУзла<>ТипУзлаXML.КонецЭлемента Тогда
		Чтение.Прочитать(); //конец элемента	
	КонецЕсли;
	
	Возврат Значение;
КонецФункции

Функция ЗагрузитьЗначениеИзФайлаXML(ИмяФайлаЗагрузки) Экспорт
	Объект=Неопределено;
	
	Чтение=Новый ЧтениеXML;
	Чтение.ОткрытьФайл(ИмяФайлаЗагрузки);
	Если Чтение.Прочитать() Тогда
		#Если Клиент Тогда
		ОбработкаПрерыванияПользователя();
		#КонецЕсли
				
		Объект=ЗагрузитьОбъект(Чтение);		
	Иначе
		Сообщить("Ошибка чтения файла !",СтатусСообщения.Важное);
	КонецЕсли; 
	
	Возврат Объект;
КонецФункции


///////////////////////////////////////////////////////////
//ВЫГРУЗКА В XML
Процедура ВыгрузитьОбъект(Запись,Объект,ИмяНовогоУзла="")
	//Запись=Новый ЗаписьXML;	
	ТипОбъекта=ТипОбъекта(Объект);
	
	Запись.ЗаписатьНачалоЭлемента(ИмяНовогоУзла);		
	Если ТипОбъекта="Неопределено" Тогда
		ТипУзла="Строка";		
	ИначеЕсли ТипОбъекта="Соответствие" Тогда
		ТипУзла="СписокЗначений";
	Иначе		
		ТипУзла=ТипОбъекта;	
	КонецЕсли; 
	
	Запись.ЗаписатьАтрибут("Тип",ТипУзла);	
	
	Если ТипОбъекта="Соответствие" Тогда
		
		Для Каждого Элемент Из Объект Цикл
			Запись.ЗаписатьНачалоЭлемента("СтрокаСписка");		
			
			ВыгрузитьОбъект(Запись,Элемент.Значение,"Значение");
			ВыгрузитьОбъект(Запись,Элемент.Ключ,"Представление");		
			ВыгрузитьОбъект(Запись,Ложь,"Пометка");		
			
			Запись.ЗаписатьКонецЭлемента();
		КонецЦикла;
	ИначеЕсли ТипОбъекта="СписокЗначений" Тогда
		Для Каждого Элемент Из Объект Цикл
			Запись.ЗаписатьНачалоЭлемента("СтрокаСписка");		
			
			ВыгрузитьОбъект(Запись,Элемент.Значение,"Значение");
			ВыгрузитьОбъект(Запись,Элемент.Представление,"Представление");		
			ВыгрузитьОбъект(Запись,Элемент.Пометка,"Пометка");		
			
			Запись.ЗаписатьКонецЭлемента();
		КонецЦикла;		
	ИначеЕсли ТипОбъекта="ТаблицаЗначений" Тогда		
		Запись.ЗаписатьНачалоЭлемента("Колонки");
		Для Каждого Колонка Из Объект.Колонки Цикл
			Запись.ЗаписатьНачалоЭлемента("Кол");			
			Запись.ЗаписатьТекст(Колонка.Имя);
			Запись.ЗаписатьКонецЭлемента();
		КонецЦикла; 
		Запись.ЗаписатьКонецЭлемента();
		
		КоличествоКолонок=Объект.Колонки.Количество();
		
		Запись.ЗаписатьНачалоЭлемента("Строки");
		Для Каждого Строка Из Объект Цикл
			Запись.ЗаписатьНачалоЭлемента("СтрокаТЗ");
			
			Для Сч=0 По КоличествоКолонок-1 Цикл
				ВыгрузитьОбъект(Запись,Строка[Сч],"Кол"+(Сч+1));			
			КонецЦикла; 
			
			Запись.ЗаписатьКонецЭлемента();		
		КонецЦикла; 
		Запись.ЗаписатьКонецЭлемента();
		
	ИначеЕсли ТипОбъекта="Строка" Тогда	
		Запись.ЗаписатьТекст(" "+Объект);	
	ИначеЕсли ТипОбъекта="Число" Тогда
		Запись.ЗаписатьТекст(Формат(Объект,"ЧРД=.;ЧН=0; ЧГ="));		
	ИначеЕсли ТипОбъекта="Дата" Тогда
		Запись.ЗаписатьТекст(Формат(Объект,"ДФ=yyyyMMdd"));		
	ИначеЕсли ТипОбъекта="Булево" Тогда
		Запись.ЗаписатьТекст(""+?(Объект,1,0));		
	Иначе
		Запись.ЗаписатьТекст(""+Объект);				
	КонецЕсли; 
	
	Запись.ЗаписатьКонецЭлемента();
КонецПроцедуры
 
Процедура ВыгрузитьЗначениеВФайлXML(Объект,ИмяФайлаВыгрузки) Экспорт
	Запись=Новый ЗаписьXML;
	Запись.ОткрытьФайл(ИмяФайлаВыгрузки);
	
	Запись.ЗаписатьНачалоЭлемента("Данные");
	
	ВыгрузитьОбъект(Запись,Объект,"СписокДокументов");
	
	Запись.ЗаписатьКонецЭлемента();
	
	Запись.Закрыть();
КонецПроцедуры



Функция ПреобразоватьСписокВСоответствие(Список) Экспорт	
	Соответствие=Новый Соответствие;
	
	Для Каждого Элемент Из Список Цикл
		Соответствие.Вставить(Элемент.Представление,Элемент.Значение);	
	КонецЦикла; 
	
	Возврат Соответствие;
КонецФункции // ПреобразоватьсписокВСоответствие()

Функция ПреобразоватьСоотвествиеВСписок(Соответствие) Экспорт
	Список=Новый СписокЗначений;
	Для Каждого Элемент Из Соответствие Цикл
		Список.Добавить(Элемент.Значение,Элемент.Ключ);		
	КонецЦикла;
	
	Возврат Список;
КонецФункции // ПреобразоватьСоотвествиеВСписок()

#Область ЗаменаНедопустимыхСимволов

// Заменяет недопустимые символы в XML-строке на заданные символы.
//
// Параметры:
//   Текст - Строка - строка, в которой требуется выполнить замену недопустимых символов.
//   СимволЗамены - Строка - строка, на которую требуется выполнить замену недопустимого символа в XML-строке.
// 
// Возвращаемое значение:
//    Строка - строка, полученная заменой недопустимых символов в XML-строке.
//
Функция ЗаменитьНедопустимыеСимволыXML(Знач Текст, СимволЗамены = " ") Экспорт
	
#Если Не ВебКлиент Тогда
	ПозицияНачала = 1;
	Позиция = НайтиНедопустимыеСимволыXML(Текст, ПозицияНачала);
	Пока Позиция > 0 Цикл
		НедопустимыйСимвол = Сред(Текст, Позиция, 1);
		Текст = СтрЗаменить(Текст, НедопустимыйСимвол, СимволЗамены);
		ПозицияНачала = Позиция + СтрДлина(СимволЗамены);
		Если ПозицияНачала > СтрДлина(Текст) Тогда
			Прервать;
		КонецЕсли;
		Позиция = НайтиНедопустимыеСимволыXML(Текст, ПозицияНачала);
	КонецЦикла;
	
	Возврат Текст;
#Иначе
	// Коды символов от 0 до 2^16-1, которые метод НайтиНедопустимыеСимволыXML
	// считает недопустимыми: 0-8, 11-12, 14-31, 55296-57343.
	Итог = "";
	ДлинаСтроки = СтрДлина(Текст);
	
	Для НомерСимвола = 1 По ДлинаСтроки Цикл
		Символ = Сред(Текст, НомерСимвола, 1);
		КодСимвола = КодСимвола(Символ);
		
		Если КодСимвола < 9
		 Или КодСимвола > 10    И КодСимвола < 13
		 Или КодСимвола > 13    И КодСимвола < 32
		 Или КодСимвола > 55295 И КодСимвола < 57344 Тогда
			
			Символ = СимволЗамены;
		КонецЕсли;
		Итог = Итог + Символ;
	КонецЦикла;
	
	Возврат Итог;
#КонецЕсли
	
КонецФункции

// Заменяет недопустимые символы в имени файла.
//
// Параметры:
//  ИмяФайла     - Строка - исходное имя файла.
//  НаЧтоМенять  - Строка - строка, на которую необходимо заменить недопустимые символы.
//
// Возвращаемое значение:
//   Строка - преобразованное имя файла.
//
Функция ЗаменитьНедопустимыеСимволыВИмениФайла(Знач ИмяФайла, НаЧтоМенять = " ") Экспорт

	Результат = ИмяФайла;
	МассивНайденныхНедопустимыхСимволов = НайтиНедопустимыеСимволыВИмениФайла(Результат);
	Для Каждого НедопустимыйСимвол Из МассивНайденныхНедопустимыхСимволов Цикл
		Результат = СтрЗаменить(Результат, НедопустимыйСимвол, НаЧтоМенять);
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

// Проверяет наличие недопустимых символов в имени файла.
//
// Параметры:
//  ИмяФайла  - Строка - имя файла.
//
// Возвращаемое значение:
//   Массив   - массив обнаруженных в имени файла недопустимых символов.
//              Если недопустимых символов не обнаружено - возвращается пустой массив.
Функция НайтиНедопустимыеСимволыВИмениФайла(ИмяФайла) Экспорт

	НедопустимыеСимволы = ПолучитьНедопустимыеСимволыВИмениФайла();
	
	МассивНайденныхНедопустимыхСимволов = Новый Массив;
	
	Для ПозицияСимвола = 1 По СтрДлина(НедопустимыеСимволы) Цикл
		ПроверяемыйСимвол = Сред(НедопустимыеСимволы,ПозицияСимвола,1);
		Если СтрНайти(ИмяФайла,ПроверяемыйСимвол) <> 0 Тогда
			МассивНайденныхНедопустимыхСимволов.Добавить(ПроверяемыйСимвол);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивНайденныхНедопустимыхСимволов;

КонецФункции

// Возвращает строку недопустимых символов.
// Согласно http://en.wikipedia.org/wiki/Filename - в разделе "Reserved characters and words".
// Возвращаемое значение:
//   Строка - строка недопустимых символов.
Функция ПолучитьНедопустимыеСимволыВИмениФайла() Экспорт

	НедопустимыеСимволы = """/\[]:;|=?*<>";
	НедопустимыеСимволы = НедопустимыеСимволы + Символы.Таб;
	Возврат НедопустимыеСимволы;

КонецФункции

#КонецОбласти

