#Область СобытияФормы
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		СсылкаДляОтбора = Документы.ЗаданиеНаМаркировку.ПолучитьСсылку(Новый УникальныйИдентификатор);
		Объект.фУпрощенныйРежим = Истина;
	Иначе                 
		СсылкаДляОтбора = Объект.Ссылка;		
	КонецЕсли;
	
	МаркировкаКС.УстановитьПараметрДинамическогоСписка(СписокЛМО, 			"ДокОснование", СсылкаДляОтбора);
	МаркировкаКС.УстановитьПараметрДинамическогоСписка(СписокЛистыМаркировки, 	"ДокОснование", СсылкаДляОтбора);
	МаркировкаКС.УстановитьПараметрДинамическогоСписка(СписокАгрегаций, 		"ДокОснование", СсылкаДляОтбора);
	
	УправлениеВидимостью();
	
	фПечататьЛентуСразуНаПринтер = НЕ Объект.фУпрощенныйРежим;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если ТолькоПросмотр Тогда Возврат КонецЕсли;	
	Если НЕ ВводДоступен() Тогда Возврат КонецЕсли;
	
	Если НЕ ЭтоСобытиеСканера(Событие) Тогда Возврат КонецЕсли;
	
	Данные = Лев(СтрЗаменить(Данные, Символы.ПС, ""), 31);
	
	глТорговоеОборудование.СканерПосылкаДанных(1);
	глСобытиеСканераОтработано = Истина;
	
	// Кухарь А.Ю. 06.05.2025 начало
	если Лев(Данные,3)="777" тогда 
		Объект.Исполнитель = НайтиФизЛицоПоШК(Данные); 
		Сообщить("Установлен сотрудник - "+Объект.Исполнитель);
		Возврат;
	КонецЕсли;
	// Кухарь А.Ю. 06.05.2025 конец
			
	
	Если Объект.фУпрощенныйРежим И Объект.СостояниеНакладной <> Перечисления.СостоянияНакладной.ВРаботе Тогда
		Возврат;	
	КонецЕсли; 
	
	Если СтрДлина(Данные)> 13 Тогда
		
		Сообщить("В данном документе разрешено сканировать только EAN 13 !", СтатусСообщения.Важное);
		
	Иначе
		
		ТекущаяНоменклатура = НайтиТоварПоШтрихКоду(Данные, Неопределено, 0, Неопределено, Ложь);
		
		Если Объект.фУпрощенныйРежим Тогда
			
			Объект.Номенклатура = ТекущаяНоменклатура;
			
			НоменклатураПриИзменении_НаСервере(); // Кельманов А.В. - HELP-6652 - 2025.08.19
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.фУпрощенныйРежим Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.Номенклатура;	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура УправлениеВидимостью()
	фКоробки = Истина;
	
	Если РольДоступна("Администратор") Тогда	
		Элементы.СостояниеНакладной.ТолькоПросмотр		= ТолькоПросмотр;	
		
		//Элементы.ШтрихкодыУпаковок.ТолькоПросмотр		= ТолькоПросмотр;
		//Элементы.ШтрихкодыУпаковок.ИзменятьСоставСтрок= Истина;
		
		Элементы.ШтрихкодыУпаковокРаспечатан.Доступность = Истина;
	КонецЕсли;
	
	Если Объект.СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена Тогда
		Если НЕ РольДоступна("Администратор") Тогда
			ТолькоПросмотр 								= Истина;
			Элементы.кнНапечататьКодыПоЛН.Доступность 	= Ложь;
		КонецЕсли;
		
		Элементы.кнЗавершитьМаркировку.Доступность = Ложь;
		Элементы.кмЗаменитьКодКоробки.Доступность = Ложь;
	КонецЕсли; 
	
	Если Объект.СостояниеНакладной <> Перечисления.СостоянияНакладной.ВРаботе Тогда		
		Элементы.кнЗаполнитьАгрегации.Доступность		= Ложь;
		Элементы.фУпрощенныйРежим.Доступность			= Ложь;
				
		Элементы.гМаркировкаУпрощенная.ТолькоПросмотр 	= Истина;
		Элементы.Номер.ТолькоПросмотр		= Истина;
		Элементы.Дата.ТолькоПросмотр		= Истина;
		Элементы.Комментарий.ТолькоПросмотр	= Истина;
		
		Элементы.ШтрихкодыУпаковок.ТолькоПросмотр = Истина;
		
		Элементы.Организация.ТолькоПросмотр 	= Истина;
		Элементы.Подразделение.ТолькоПросмотр	= Истина;
	КонецЕсли;	
	
	Элементы.кнНапечататьЛенту.Видимость		= НЕ Объект.фУпрощенныйРежим;
	Элементы.кнНапечататьПалеты.Видимость		= Объект.фУпрощенныйРежим;
	
	Элементы.кнЗаполнитьАгрегации.Видимость		= Объект.фУпрощенныйРежим;
	Элементы.гМаркировкаОбычная.Видимость		= НЕ Объект.фУпрощенныйРежим;
	Элементы.гМаркировкаУпрощенная.Видимость	= Объект.фУпрощенныйРежим;
	Элементы.КоличествоШтукВЛенте.Видимость		= НЕ Объект.фУпрощенныйРежим;
	
	Элементы.ШтукВБлочке.Доступность	= Объект.фАгрегироватьБлочки;
	Элементы.ШтукНаПалете.Доступность	= Объект.фАгрегироватьПалеты;
	Элементы.КоличествоПалет.Доступность= Объект.фАгрегироватьПалеты;
	
	Элементы.кмПалетныйРежим.Видимость	= Объект.фУпрощенныйРежим;
	Элементы.кмОбычныйРежим.Видимость	= НЕ Объект.фУпрощенныйРежим;      
	
	
	// Кухарь А.Ю. 06.05.2025 начало
	Элементы.ДатаНачалаСканирования.Видимость	 = ЗначениеЗаполнено(Объект.ДатаНачалаСканирования);
 	Элементы.ДатаОкончанияСканирования.Видимость = ЗначениеЗаполнено(Объект.ДатаОкончанияСканирования); 
	элементы.Исполнитель.Видимость 		 = ЗначениеЗаполнено(Объект.Исполнитель); 
	// Кухарь А.Ю. 06.05.2025 конец
	
	// Шворобей ВЮ 03.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4874
	Элементы.кнНапечататьПалеты.Доступность = Объект.фУпрощенныйРежим И Объект.ШтрихкодыУпаковок.Количество() > 0;
	// Шворобей ВЮ 03.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4874
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьЛенту(Команда)
	//Валетов + 30,01,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3473
	//Запрещаем маркировать в ЗНМ Спайки      
	рШапки = ПолучитьРеквизитыШапки(Объект.Номенклатура, "ВидКомплекта,Родитель.ВидНоменклатуры");
	Если (рШапки.ВидКомплекта = Перечисления.ВидыКомплектов.Комплект 
		ИЛИ рШапки.ВидКомплекта = Перечисления.ВидыКомплектов.АссортитоКомплектов 
		ИЛИ рШапки.ВидКомплекта = Перечисления.ВидыКомплектов.Ассортито)
		И рШапки.Родитель_ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Товар Тогда
		СообщитьИзМодуля("Комплекты (спайки) и Ассортито необходимо маркировать через ЗСБ+ЛСК.");
		Возврат;
	КонецЕсли;
	//Валетов -
	
	// Кухарь А.Ю. 06.05.2025 начало
	Если Объект.ДатаНачалаСканирования = ПустаяДата() Тогда
		Объект.ДатаНачалаСканирования = ТекущаяДата();
	КонецЕсли;
	// Кухарь А.Ю. 06.05.2025 конец
	
	Ошибки = "";
	Если ТекущаяНоменклатура.Пустая() Тогда
		Ошибки = "Не выбрана номенклатура !";
	Иначе
		Если КоличествоШтукВЛенте = 0  Тогда
			КоличествоШтукВЛенте = ПолучитьРеквизитШапки(ТекущаяНоменклатура, "Родитель.ШтукВКоробке");	
		КонецЕсли;
		Если КоличествоШтукВЛенте = 0 Тогда
			Ошибки = "Нулевое количество штук в ленте !";			
		КонецЕсли;		
	КонецЕсли;    
	
	Если НЕ ПустаяСтрока(Ошибки) Тогда
		ПоказатьПредупреждение(, Ошибки);
		Возврат;	
	КонецЕсли;
	
	// Шворобей ВЮ 01.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4874
	Если ЗначениеЗаполнено(Объект.ДокОснование) И ТипЗнч(Объект.ДокОснование) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		Если ПроверитьНоменклатуруЗНМ_НаОснованииРНК() = Истина Тогда Возврат; КонецЕсли;
	КонецЕсли;
	// Шворобей ВЮ 01.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4874
		
	Если Объект.Ссылка.Пустая() Тогда	
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	ИначеЕсли Модифицированность Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));	
	КонецЕсли;
	
	рЗаполнения = ЗаполнитьКодыНовойЛенты(ТекущаяНоменклатура, КоличествоШтукВЛенте);
	Если рЗаполнения.Успешно Тогда		
		Объект.СостояниеНакладной = Перечисления.СостоянияНакладной.Сканирование;  		
		Записать();		
		ТекущийЛистМаркировки = рЗаполнения.ЛистМаркировки;	
		
		рПечати = НапечататьКодыПоЛН_НаСервере(ТекущийЛистМаркировки);					
		Если рПечати.Успешно Тогда
			Если фПечататьЛентуСразуНаПинтер Тогда
				рПечати.Данные.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
			Иначе					
				рПечати.Данные.Показать("Этикетки по ЛМ: " + ТекущийЛистМаркировки);
			КонецЕсли; 				
		Иначе
			Сообщить(СтрСоединить(рПечати.Ошибки, Символы.ПС), СтатусСообщения.Важное); 
		КонецЕсли;
		
		ОткрытьФорму("Документ.ЛистМаркировкиОстатков.Форма.ФормаДокумента", Новый Структура("Ключ", ТекущийЛистМаркировки), ЭтаФорма, 1, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Сообщить(СтрСоединить(рЗаполнения.Ошибки, Символы.ПС), СтатусСообщения.Важное);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьПалеты(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(, "Документ не записан !");
		Возврат;
	КонецЕсли;
	
	Если Объект.ШтрихкодыУпаковок.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не заполнены коды маркировки !");		
		Возврат;			
	КонецЕсли;
	
	Если Модифицированность Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));	
	КонецЕсли;
	
	Объект.СостояниеНакладной = Перечисления.СостоянияНакладной.ДопОбработка;
	Записать();	
	
	рПечати = НапечататьКодыПоПалетам_НаСервере();		
	Если рПечати.Успешно Тогда
		Если фПечататьЛентуСразуНаПинтер Тогда
			рПечати.Данные.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
		Иначе					
			рПечати.Данные.Показать("Этикетки по ЗНМ: " + Объект.Номер);
		КонецЕсли; 				
	Иначе
		Сообщить(СтрСоединить(рПечати.Ошибки, Символы.ПС), СтатусСообщения.Важное); 
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьКодыНовойЛенты(ВыбНоменклатура, Знач КолШтук = 0)	
	Если КолШтук = 0 Тогда
		Результат = ЗаполнитьКодыНовойЛенты_Коробка(ВыбНоменклатура);
	Иначе
		Результат = ЗаполнитьКодыНовойЛенты_ПроизвольноеКоличество(ВыбНоменклатура, КолШтук);		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ЗаполнитьКодыНовойЛенты(ВыбНоменклатура)

&НаСервере
Функция ЗаполнитьКодыНовойЛенты_Коробка(ВыбНоменклатура)	
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Результат = МаркировкаКС.СтруктураРезультата();
	
	ШтукВКоробке	= ПолучитьРеквизитШапки(ВыбНоменклатура, "Родитель.ШтукВКоробке");	
	
	ЛистМаркировки	= СоздатьЛистМаркировки(ВыбНоменклатура);	
	
	рПолучения = ПолучитьЗабронироватьСвободныеКодыАгрегации(Перечисления.ТипыШтрихКодов.Коробка, 1);
	Если рПолучения.Успешно Тогда
		ШтрихкодКоробки = рПолучения.Данные[0];
		
		ТекстСообщения = СтрШаблон("Получение КМ коробки, получено: %2 кодов.", ВыбНоменклатура, ШтукВКоробке);
		ЗаписатьВЛог("Получение свободных КМ", ТекстСообщения, , , , (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000);
		
		рПолучения = ПолучитьЗабронироватьСвободныеКодыШтук(ВыбНоменклатура, ШтукВКоробке, Объект.Подразделение);
		Если рПолучения.Успешно Тогда
			КодыШтук = рПолучения.Данные;		
			
			Для Каждого КиЗ Из рПолучения.Данные Цикл
				Для Каждого ШтрихКодУпаковки Из КиЗ.Значение Цикл
					СтрокаТЧ = Объект.ШтрихкодыУпаковок.Добавить();
					
					СтрокаТЧ.ШтрихкодУпаковки	= ШтрихКодУпаковки;
					СтрокаТЧ.ШтрихкодКоробки	= ШтрихкодКоробки;
					СтрокаТЧ.ЛистМаркировки		= ЛистМаркировки;				
					СтрокаТЧ.ДатаБронированияКМ = ТекущаяДата();
				КонецЦикла;
			КонецЦикла;			
			
			ТекстСообщения = СтрШаблон("Получение КМ по ном. %1, получено: %2 кодов.", ВыбНоменклатура, ШтукВКоробке);
			ЗаписатьВЛог("Получение свободных КМ", ТекстСообщения, , , , (ТекущаяУниверсальнаяДатаВМиллисекундах()-Начало)/1000);
			
			Если Объект.СостояниеНакладной = Перечисления.СостоянияНакладной.ВРаботе Тогда
				Объект.СостояниеНакладной = Перечисления.СостоянияНакладной.Сканирование; 			
			КонецЕсли; 
			
			Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Проведение));
			
			Результат.Вставить("ЛистМаркировки", ЛистМаркировки);
		Иначе			
			МаркировкаКС.ДобавитьОшибки(Результат, рПолучения);
			ЗаписатьПроНехваткуКодов(ВыбНоменклатура, рПолучения);
		КонецЕсли;		
	Иначе
		МаркировкаКС.ДобавитьОшибки(Результат, рПолучения);
	КонецЕсли;	
	
	Если Результат.Ошибки.Количество() > 0 Тогда
		Результат.Успешно = Ложь;		
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции //ЗаполнитьКодыНовойЛенты(ВыбНоменклатура)

&НаСервере
Функция ЗаполнитьКодыНовойЛенты_ПроизвольноеКоличество(ВыбНоменклатура, КолШтук)
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Результат = МаркировкаКС.СтруктураРезультата();	
		
	рПолучения = ПолучитьЗабронироватьСвободныеКодыШтук(ВыбНоменклатура, КолШтук, Объект.Подразделение);
	Если рПолучения.Успешно Тогда		
		ЛМО_Ссылка	= СоздатьЛистМаркировки(ВыбНоменклатура, Новый Структура("НеПолный", (КолШтук < ШтукВКоробке(ВыбНоменклатура))));
		
		Для Каждого КиЗ Из рПолучения.Данные Цикл
			Для Каждого ШтрихКодУпаковки Из КиЗ.Значение Цикл
				СтрокаТЧ = Объект.ШтрихкодыУпаковок.Добавить();
				
				СтрокаТЧ.ШтрихкодУпаковки	= ШтрихКодУпаковки;			
				СтрокаТЧ.ЛистМаркировки		= ЛМО_Ссылка;
				СтрокаТЧ.ДатаБронированияКМ = ТекущаяДата();
			КонецЦикла;
		КонецЦикла;		
		
		Если Объект.СостояниеНакладной = Перечисления.СостоянияНакладной.ВРаботе Тогда
			Объект.СостояниеНакладной = Перечисления.СостоянияНакладной.Сканирование; 			
		КонецЕсли; 
		
		Записать();
		
		Результат.Вставить("ЛистМаркировки", ЛМО_Ссылка);
	Иначе
		МаркировкаКС.ДобавитьОшибки(Результат, рПолучения);
		ЗаписатьПроНехваткуКодов(ВыбНоменклатура, рПолучения);
	КонецЕсли;	
	
	Если Результат.Ошибки.Количество() > 0 Тогда
		Результат.Успешно = Ложь;		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ЗаполнитьКодыНовойЛенты_ПроизвольноеКоличество(ВыбНоменклатура, КолШтук)

&НаСервере
Процедура ЗаписатьПроНехваткуКодов(Номенклатура, рПолучения)
	ТекстСообщения = СтрШаблон(
		"Недостаточно кодов ЧЗ по ном.: %1 (%2). 
		|Док. бронирования: %3, основание: %4 !", 
		Номенклатура, ПолучитьРеквизитШапки(Номенклатура, "Код"), Объект.Ссылка, Объект.ДокОснование
	);
	
	ТекстСообщения = ТекстСообщения + "
	|" + СтрСоединить(рПолучения.Ошибки, Символы.ПС);
	
	ЗаписатьВЛог("Нехватка КМ", ТекстСообщения, "Ошибка");
КонецПроцедуры //ЗаписатьПроНехваткуКодов(Номенклатура, рПолучения) 

&НаСервере
Функция ПолучитьЗабронироватьСвободныеКодыАгрегации(ТипШК, Количество)                                                                                                         
	пБронирования = Новый Структура("Добавлять", Истина);
	Возврат Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыАгрегации(ТипШК, Перечисления.ТипыУпаковок.МонотоварнаяУпаковка, Количество, Объект.Ссылка, пБронирования);
КонецФункции //ПолучитьСвободныеКодыАгрегации(ТипШК, Количество)

&НаСервере
Функция ПолучитьЗабронироватьСвободныеКодыШтук(Номенклатура, Количество, ПодразделениеНанесения) Экспорт	 
	пБронирования = Новый Структура("Количество,Добавлять", Количество, Истина);
	Если Объект.фУпрощенныйРежим Тогда
		пБронирования.Вставить("НовыйСтатус", Перечисления.СтатусыКодовМаркировкиФакт.Нанесен);	
	КонецЕсли;
	Возврат Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыШтук(Номенклатура, Объект.Ссылка, пБронирования);
КонецФункции
	
&НаСервере
Функция ПолучитьЗабронироватьТаблицуАгрегации(КолШтук, КолКоробок, КолПалет = 0, КолБлочков = 0)	
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Если Объект.ШтукВКоробке = 0 Тогда
		Результат.Ошибки.Добавить("Не указано количество штук в коробке !");
		Результат.Успешно = Ложь;
		Возврат Результат;
	КонецЕсли;
	
	КодыПалет	= Новый Массив;
	КодыКоробок	= Новый Массив;
	КодыБлочков = Новый Массив;
	КодыШтук	= Новый Массив;
	
	ТР = Новый ТаблицаЗначений;
	ТР.Колонки.Добавить("ШтрихКодУпаковки");
	ТР.Колонки.Добавить("ШтрихКодКоробки");	
	ТР.Колонки.Добавить("НомерКоробки");
			
	Если КолБлочков > 0 Тогда
		рПолучения = ПолучитьЗабронироватьСвободныеКодыАгрегации(Перечисления.ТипыШтрихКодов.Блочок, КолБлочков);			
		Если рПолучения.Успешно Тогда
			КодыБлочков = рПолучения.Данные;
			ТР.Колонки.Добавить("ШтрихКодБлочка");
			ТР.Колонки.Добавить("НомерБлочка");
		Иначе
			МаркировкаКС.ДобавитьОшибки(Результат, рПолучения);
		КонецЕсли;
	КонецЕсли;			
	
	Если КолПалет > 0 Тогда
		рПолучения = ПолучитьЗабронироватьСвободныеКодыАгрегации(Перечисления.ТипыШтрихКодов.Палета, КолПалет);
		Если рПолучения.Успешно Тогда
			КодыПалет = рПолучения.Данные;
			
			ТР.Колонки.Добавить("ШтрихКодПалеты");
			ТР.Колонки.Добавить("НомерПалеты");
		Иначе
			МаркировкаКС.ДобавитьОшибки(Результат, рПолучения);
		КонецЕсли;	
	КонецЕсли; 
	
	Если КолКоробок > 0 И Объект.фАгрегироватьКоробки Тогда
		рПолучения = ПолучитьЗабронироватьСвободныеКодыАгрегации(Перечисления.ТипыШтрихКодов.Коробка, КолКоробок);
		Если рПолучения.Успешно Тогда
			КодыКоробок = рПолучения.Данные;
		Иначе
			МаркировкаКС.ДобавитьОшибки(Результат, рПолучения);
		КонецЕсли;	
	КонецЕсли;	
	
	рПолучения = ПолучитьЗабронироватьСвободныеКодыШтук(Объект.Номенклатура, КолШтук, Объект.Подразделение);
	Если рПолучения.Успешно Тогда
		КодыШтук = рПолучения.Данные[Объект.Номенклатура];
	Иначе
		МаркировкаКС.ДобавитьОшибки(Результат, рПолучения);		
	КонецЕсли;
	
	Если Результат.Ошибки.Количество() > 0 Тогда
		Результат.Успешно = Ложь;
		Возврат Результат;		
	КонецЕсли;	
	
	Сч = 0;
	Для Каждого ШтрихКодУпаковки Из КодыШтук Цикл
		СтрокаТР = ТР.Добавить();
		
		СтрокаТР.ШтрихКодУпаковки 	= ШтрихКодУпаковки;
		
		СтрокаТР.НомерКоробки		= Цел(Сч/Объект.ШтукВКоробке)+1;
		
		Если Объект.фАгрегироватьКоробки > 0 Тогда		
			СтрокаТР.ШтрихКодКоробки	= КодыКоробок[СтрокаТР.НомерКоробки-1];
		КонецЕсли;		
		
		Если КолБлочков > 0 Тогда			
			СтрокаТР.НомерБлочка	= Цел(Сч/Объект.ШтукВБлочке)+1;
			СтрокаТР.ШтрихКодБлочка = КодыБлочков[СтрокаТР.НомерБлочка-1];
		КонецЕсли; 
		
		Если КолПалет > 0 Тогда			
			СтрокаТР.НомерПалеты	= Цел(Сч/Объект.ШтукНаПалете)+1;
			СтрокаТР.ШтрихКодПалеты = КодыПалет[СтрокаТР.НомерПалеты-1];
		КонецЕсли;
		
		Сч = Сч + 1;
	КонецЦикла;
	
	Записать();
	
	Результат.Данные = ТР;
	
	Возврат Результат;
КонецФункции //ПолучитьКодыДляКоробки(ВыбНоменклатура)

&НаКлиенте
Функция ПроверитьКратность()
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Если Объект.Номенклатура.Пустая() Тогда
		Результат.Ошибки.Добавить("Не выбрана номенклатура !");	
	КонецЕсли; 
	
	Если Объект.фАгрегироватьКоробки Тогда
		Если Объект.ШтукВКоробке = 0 Тогда		
			Результат.Ошибки.Добавить("Не указано количество штук в коробке !");
		Иначе		
			мКолКоробок = Объект.КоличествоДокумента / Объект.ШтукВКоробке;
			Если мКолКоробок <> Цел(мКолКоробок) Тогда
				Результат.Ошибки.Добавить("Дробное количество коробок !");
			КонецЕсли;
		КонецЕсли; 	
	КонецЕсли;
	
	Если Объект.фАгрегироватьБлочки Тогда
		Если Объект.ШтукВБлочке = 0 Тогда		
			Результат.Ошибки.Добавить("Не указано количество штук в блочке !");
		Иначе
			мКолБлочков = Объект.КоличествоДокумента / Объект.ШтукВБлочке;
			Если мКолБлочков = Цел(мКолБлочков) Тогда
				мКолКоробок = мКолБлочков / Объект.КоличествоКоробок;
				Если мКолКоробок <> Цел(мКолКоробок) Тогда
					Результат.Ошибки.Добавить("Дробное количество коробок по блочкам !");									
				КонецЕсли; 
			Иначе				
				Результат.Ошибки.Добавить("Дробное количество штук на блочок !");
			КонецЕсли;			
		КонецЕсли;	
	КонецЕсли; 
	
	Если Объект.фАгрегироватьПалеты Тогда
		Если Объект.КоличествоПалет = 0  Тогда					
			Результат.Ошибки.Добавить("Не указано количество палет !");			
		Иначе
			Если Объект.ШтукНаПалете = 0 Тогда		
				Результат.Ошибки.Добавить("Не указано количество штук на палете !");
			Иначе
				мКолПалет = Объект.КоличествоДокумента / Объект.ШтукНаПалете;
				Если мКолПалет = Цел(мКолПалет) Тогда
					мКоробокНаПалету = Объект.КоличествоКоробок / Объект.КоличествоПалет;
					Если мКоробокНаПалету <> Цел(мКоробокНаПалету) Тогда
						Результат.Ошибки.Добавить("Дробное количество коробок на палете !");									
					КонецЕсли; 
				Иначе				
					Результат.Ошибки.Добавить("Дробное количество штук на палете !");
				КонецЕсли;			
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	
	Результат.Успешно = ( Результат.Ошибки.Количество() = 0 );
	
	Возврат Результат;
КонецФункции //ПроверитьКратность()

&НаСервере
Функция СоздатьЛистМаркировки(Номенклатура, ДопПараметры = Неопределено)
	ЛН_Объект = Документы.ЛистМаркировкиОстатков.СоздатьДокумент();	
	ЛН_Объект.Заполнить(Объект.Ссылка); 	
	
	ЛН_Объект.Дата			= ТекущаяДата();	
	//+++Чирков 30.09.2025 - иногда колотят пальцами по кнопкам так, что получаются одинаковые даты ЗНМ и ЛМО
	Если ЛН_Объект.Дата = Объект.Дата Тогда
		ЛН_Объект.Дата = ЛН_Объект.Дата + 1;
	КонецЕсли;
	//---Чирков 30.09.2025
	ЛН_Объект.Номенклатура	= Номенклатура;
	
	СсылкаНового = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "СсылкаНового");
	Если ЗначениеЗаполнено(СсылкаНового) Тогда
		ЛН_Объект.УстановитьСсылкуНового(СсылкаНового);			
	КонецЕсли;
	
	ЛН_Объект.НеПолный = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "НеПолный", Ложь);	
	
	ЛН_Объект.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат ЛН_Объект.Ссылка;	
КонецФункции //СоздатьЛистМаркировки() 

&НаСервере
Функция ВнешнееСобытиеНаСервере(Данные)
	
	Если Объект.Ссылка = Документы.ЛистМаркировки.ПустаяСсылка() тогда
		Записать();
	КонецЕсли;	
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиТоварПоШК(Данные)
	Номенклатура = НайтиТоварПоШтрихКоду(Данные, Неопределено, 0, Неопределено, Ложь);
КонецФункции

&НаКлиенте
Процедура НапечататьКодыПоЛМ(Команда)	
	ТекДанные = Элементы.ШтрихкодыУпаковок.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда	
		рПечати = НапечататьКодыПоЛН_НаСервере(ТекДанные.ЛистМаркировки);
		Если рПечати.Успешно Тогда
			рПечати.Данные.Показать("Этикетки по ЛМ: " + ТекДанные.ЛистМаркировки);
		Иначе
			Сообщить(СтрСоединить(рПечати.Ошибки, Символы.ПС));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПовторнаяПечать_Палета(Команда)	
	ТекДанные = Элементы.ШтрихкодыУпаковок.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если НЕ МаркировкаК.ЗаписатьИзмененныйОбъектВУпрФорме(ЭтаФорма, Истина) Тогда Возврат КонецЕсли; 
		
		рПечати = НапечататьКодыПоПалетам_НаСервере(ТекДанные.НомерПалеты, , ,Истина);
		Если рПечати.Успешно Тогда
			Если фПечататьЛентуСразуНаПинтер Тогда
				рПечати.Данные.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
			Иначе				
				рПечати.Данные.Показать("Этикетки по палете №: " + ТекДанные.НомерПалеты);
			КонецЕсли;			
		Иначе
			МаркировкаКС.ВывестиОшибки(рПечати.Ошибки);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПовторнаяПечать_Коробка(Команда)	
	ТекДанные = Элементы.ШтрихкодыУпаковок.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда	
		Если НЕ МаркировкаК.ЗаписатьИзмененныйОбъектВУпрФорме(ЭтаФорма, Истина) Тогда Возврат КонецЕсли; 
		
		рПечати = НапечататьКодыПоПалетам_НаСервере(0, ТекДанные.НомерКоробки, , Истина);
		Если рПечати.Успешно Тогда
			Если фПечататьЛентуСразуНаПинтер Тогда
				рПечати.Данные.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
			Иначе				
				рПечати.Данные.Показать("Этикетки по коробке №: " + ТекДанные.НомерКоробки);
			КонецЕсли;			
		Иначе
			МаркировкаКС.ВывестиОшибки(рПечати.Ошибки);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПовторнаяПечать_Блочок(Команда)
	ТекДанные = Элементы.ШтрихкодыУпаковок.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если НЕ МаркировкаК.ЗаписатьИзмененныйОбъектВУпрФорме(ЭтаФорма, Истина) Тогда Возврат КонецЕсли;
		
		рПечати = НапечататьКодыПоПалетам_НаСервере(0, 0, ТекДанные.НомерБлочка, Истина);
		Если рПечати.Успешно Тогда
			Если фПечататьЛентуСразуНаПинтер Тогда
				рПечати.Данные.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
			Иначе				
				рПечати.Данные.Показать("Этикетки по блочку №: " + ТекДанные.НомерКоробки);
			КонецЕсли;			
		Иначе
			МаркировкаКС.ВывестиОшибки(рПечати.Ошибки);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПовторнаяПечать_Штуки(Команда)
	сКодыМаркировки = Новый Соответствие;
	КодыМаркировки = Новый Массив;
	
	Для Каждого ИдСтроки Из Элементы.ШтрихкодыУпаковок.ВыделенныеСтроки Цикл
		СтрокаТЧ = Объект.ШтрихкодыУпаковок.НайтиПоИдентификатору(ИдСтроки);		
		
		сКодыМаркировки[СтрокаТЧ.ШтрихкодУпаковки] = Истина;	
		КодыМаркировки.Добавить(СтрокаТЧ.ШтрихкодУпаковки);
	КонецЦикла;
	
	Если КодыМаркировки.Количество() = 0 Тогда Возврат КонецЕсли;
	
	Если НЕ МаркировкаК.ЗаписатьИзмененныйОбъектВУпрФорме(ЭтаФорма, Истина) Тогда Возврат КонецЕсли;
	
	ОтменитьПечатьКодов(сКодыМаркировки);
	
	рПечати = НапечататьКМ_НаСервере(КодыМаркировки, ПредопределенноеЗначение("Документ.ЛистМаркировкиОстатков.ПустаяСсылка"));
	Если рПечати.Успешно Тогда
		Если фПечататьЛентуСразуНаПинтер Тогда
			рПечати.Данные.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);			
		Иначе			
			рПечати.Данные.Показать("Этикети по КМ: " + СтрСоединить(КодыМаркировки, ","));
		КонецЕсли; 	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция НапечататьКодыПоЛН_НаСервере(ЛистМаркировки, ИмяМакета = "Этикетка_25_25_Остатки", СразуНаПринтер = Ложь)	
	Результат		= МаркировкаКС.СтруктураРезультата(Ложь);
	
	Если ЗначениеЗаполнено(ЛистМаркировки) Тогда
		рПолучения		= ПолучитьКодыПоЛМ(ЛистМаркировки);
		ШтукВКоробке	= рПолучения.ШтукВКоробке;
	
		Если рПолучения.ШтрихКодыУпаковок.Количество() = 0 Тогда
			Результат.Ошибки.Добавить("Не найдено нераспечатанных КМ по листу маркировки: " + ЛистМаркировки);
		КонецЕсли;
	Иначе
		Результат.Ошибки.Добавить("Не выбран лист маркировки !");	
	КонецЕсли; 
	
	Если Результат.Ошибки.Количество() > 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	НомерЛН 		= ПолучитьРеквизитШапки(ЛистМаркировки, "Номер");
	НомерКоробки    = Число(СтрРазделить(НомерЛН,"/")[1]);
	
	ОбработкаПечати = Обработки.ПечатьЭтикетокЧЗ.Создать();
	Макет = ОбработкаПечати.ПолучитьМакет(ИмяМакета);
	
	ТД = Новый ТабличныйДокумент;
	ТД.ОтображатьСетку		= Ложь;
	ТД.ОтображатьЗаголовки	= Ложь;
	// Смирнов М.Ю. 29.05.2025 HELP-3868 начало
	//ТД.ИмяПараметровПечати	= "ПараметрыПечати_КМ_" + ИмяМакета;
	ТД.ИмяПараметровПечати	= "ПараметрыПечати_КМ_ЗНМ_ЛН" + ИмяМакета;
	// Смирнов М.Ю. 29.05.2025 HELP-3868 конец
	
	РаспечатанныеКМ = Новый Соответствие;
	
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ДанныеДляПечати	= Неопределено;
	ВсегоСтрок		= рПолучения.ШтрихКодыУпаковок.Количество();
	НомерШтуки  	= 1;
	Для Каждого ДанныеДляПечати Из рПолучения.ШтрихКодыУпаковок Цикл		
		НомерШтуки 		= ДанныеДляПечати.НомерСтроки - рПолучения.ПерваяСтрока + 1;
		
		ДопПараметры	= Новый Структура("НомерШтуки,НомерКоробки,ШтукВКоробке", НомерШтуки, НомерКоробки, ШтукВКоробке);
		Область 		= ОбработкаПечати.СформироватьЭтикету(Макет, ДанныеДляПечати, ДопПараметры);
		
		ТД.Вывести(Область);
		ТД.ВывестиГоризонтальныйРазделительСтраниц();
		
		Если фДублироватьКМ Тогда		
			ТД.Вывести(Область);
			ТД.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		
		РаспечатанныеКМ[ДанныеДляПечати.ШтрихКодУпаковки] = Истина; 
	КонецЦикла;
	
	Время = (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000;
	ЗаписатьВЛог("Печать КМ", СтрШаблон("Сформировано: %1 этикеток ЧЗ. Скорость: %2 этикеток/сек.", Формат(ВсегоСтрок/Время, "ЧДЦ=0; ЧРГ=' '; ЧГ=3,0")), , , , Время);
	
	ЗаписатьРаспечатанныеКоды(РаспечатанныеКМ);
	
	Если рПолучения.ШтрихКодыУпаковок.Количество() = рПолучения.ШтукВКоробке И НЕ рПолучения.НеПолный Тогда
		ДопПараметры = Новый Структура("Артикул", МаркировкаКС.ПолучитьЗначениеПараметра(ДанныеДляПечати,"Артикул", ""));
		// Кухарь А.Ю.  02.02.2025 начало
		Если СтрНайти(ИмяМакета,"25_25")>0 или СтрНайти(ИмяМакета,"25_50")>0 тогда
			ДопПараметры.Вставить("ОтображатьТекст",ложь);
		КонецЕсли;
		// Кухарь А.Ю.  02.02.2025 конец
		
		Область = ОбработкаПечати.СформироватьКА(Макет, рПолучения.ШтрихКодКоробки, НомерКоробки, ШтукВКоробке, ДопПараметры);	
		ТД.Вывести(Область);
	КонецЕсли;	
	
	Результат.Данные 	= ТД;
	Результат.Успешно 	= Истина;
	
	Возврат Результат;
КонецФункции //НапечататьКодыПоЛН_НаСервере(ЛистМаркировки, ИмяМакета	= "Этикетка_25_25_Остатки")

&НаСервере
Функция НапечататьКодыПоПалетам_НаСервере(НомерПалеты = 0, НомерКоробки = 0, НомерБлочка = 0, Повторно = Ложь, ИмяМакета = "Этикетка_25_25_Остатки")
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Данные = ПолучитьКодыПалеты(НомерПалеты, НомерКоробки, НомерБлочка, , Повторно);	
	
	ОбработкаПечати = Обработки.ПечатьЭтикетокЧЗ.Создать();
	Макет = ОбработкаПечати.ПолучитьМакет(ИмяМакета);
	
	ТД = Новый ТабличныйДокумент;
	ТД.ОтображатьСетку		= Ложь;
	ТД.ОтображатьЗаголовки	= Ложь;
	// Смирнов М.Ю. 29.05.2025 HELP-3868 начало
	ТД.ИмяПараметровПечати	= "ПараметрыПечати_КМ_ЗНМ_ПАЛЕТ" + ИмяМакета;
	// Смирнов М.Ю. 29.05.2025 HELP-3868 конец
	
	РаспечатанныеКМ = Новый Соответствие;
	НомерШтуки  	= 1;	
	
	ВсегоСтрок 	= 0;
	Сч			= 0;
	Для Каждого Строка_Палета Из Данные.Строки Цикл
		ВсегоСтрок = Строка_Палета.ШтрихКодУпаковки;
	КонецЦикла;
	
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Для Каждого Строка_Палета Из Данные.Строки Цикл
		Для Каждого Строка_Коробка Из Строка_Палета.Строки Цикл
			ПерваяСтрока = Строка_Коробка.НомерСтроки;
			Для Каждого Строка_Блочок Из Строка_Коробка.Строки Цикл
				Для Каждого Строка_КМ Из Строка_Блочок.Строки Цикл			
					НомерШтуки 		= Строка_КМ.НомерСтроки - ПерваяСтрока + 1;
					
					ДопПараметры	= Новый Структура(
					"НомерШтуки,НомерБлочка,НомерКоробки,НомерПалеты,ШтукВБлочке,ШтукВКоробке",
					НомерШтуки, Строка_КМ.НомерБлочка, Строка_КМ.НомерКоробки, Строка_КМ.НомерПалеты, Объект.ШтукВБлочке, Объект.ШтукВКоробке
					);
					Область 		= ОбработкаПечати.СформироватьЭтикету(Макет, Строка_КМ, ДопПараметры);
					
					ТД.Вывести(Область);
					ТД.ВывестиГоризонтальныйРазделительСтраниц();
					
					Если фДублироватьКМ Тогда		
						ТД.Вывести(Область);
						ТД.ВывестиГоризонтальныйРазделительСтраниц();
					КонецЕсли;
					
					РаспечатанныеКМ[Строка_КМ.ШтрихКодУпаковки] = Истина;
					Сч = Сч + 1;
					
					Если Сч % 10 = 0 Тогда						
						#ЕСЛИ ТолстыйКлиентОбычноеПриложение ТОГДА						
						Состояние(СтрШаблон("Выведено %1 из %2.", Сч, ВсегоСтрок));		
						#КОНЕЦЕСЛИ
					КонецЕсли; 
				КонецЦикла; 
				
				Если ЗначениеЗаполнено(Строка_Блочок.ШтрихКодБлочка) Тогда
					ДопПараметры = Новый Структура("ТипШК,НомерБлочка,Артикул,Цвет,Размер", Перечисления.ТипыШтрихКодов.Блочок); 
					ЗаполнитьЗначенияСвойств(ДопПараметры, Строка_Блочок);
					
					Область = ОбработкаПечати.СформироватьКА(Макет, Строка_Блочок.ШтрихкодБлочка, НомерКоробки, Объект.ШтукВКоробке, ДопПараметры);
					
					ТД.Вывести(Область);			
					ТД.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;		
			КонецЦикла; 
			
			//Валетов + 18,03,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8970
			// БЫЛО  Если НомерБлочка = 0 Тогда //Все блочки - нужно вывести код коробки  
			Если НомерБлочка = 0 И Объект.фАгрегироватьКоробки Тогда  //Для печати штук если нет коробов не выводим код коробки
			//Валетов -
				// Смирнов М.Ю. 21.07.2025 HELP-5941 начало
				//ДопПараметры 	= Новый Структура("ТипШК,Артикул,Цвет,Размер", Перечисления.ТипыШтрихКодов.Коробка);
				ДопПараметры 	= Новый Структура("ТипШК,Артикул,Цвет,Размер,ПечататьQR", Перечисления.ТипыШтрихКодов.Коробка); 
				ДопПараметры.ПечататьQR = Истина;
				// Смирнов М.Ю. 21.07.2025 HELP-5941 конец
				ЗаполнитьЗначенияСвойств(ДопПараметры, Строка_Коробка);
				
				// Кухарь А.Ю.  02.02.2025 начало
				//
				Если СтрНайти(ИмяМакета,"25_25")>0 или СтрНайти(ИмяМакета,"25_50")>0 тогда
					ДопПараметры.Вставить("ОтображатьТекст",ложь);
				КонецЕсли;
				// Кухарь А.Ю.  02.02.2025 конец
				
				Область 		= ОбработкаПечати.СформироватьКА(Макет, Строка_Коробка.ШтрихКодКоробки, Строка_Коробка.НомерКоробки, Объект.ШтукВКоробке, ДопПараметры);
				
				ТД.Вывести(Область);
				ТД.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла;
		
		Если (НомерБлочка = 0) И (НомерКоробки = 0) И ЗначениеЗаполнено(Строка_Палета.ШтрихКодПалеты) Тогда //Все коробки - нужно вывести код палеты
			ДопПараметры 	= Новый Структура("ТипШК,НомерПалеты,Артикул,Цвет,Размер", Перечисления.ТипыШтрихКодов.Палета);
			ЗаполнитьЗначенияСвойств(ДопПараметры, Строка_Палета);
			
			Область 		= ОбработкаПечати.СформироватьКА(Макет, Строка_Палета.ШтрихКодПалеты, Строка_Палета.НомерПалеты, Объект.ШтукВКоробке, ДопПараметры);
			
			ТД.Вывести(Область);					
			ТД.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли; 
	КонецЦикла;
	
	Время = (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000;
	Время = ?(Время = 0, 0.001, Время);
	ЗаписатьВЛог("Печать КМ", СтрШаблон("Сформировано: %1 этикеток ЧЗ. Скорость: %2 этикеток/сек.", ВсегоСтрок, Формат(ВсегоСтрок/Время, "ЧДЦ=0; ЧРГ=' '; ЧГ=3,0")), , , , Время);
	
	ЗаписатьРаспечатанныеКоды(РаспечатанныеКМ);	
	
	Результат.Данные 	= ТД;
	Результат.Успешно 	= Истина;
	
	Возврат Результат;
КонецФункции //НапечататьКодыПоЛН_НаСервере(ЛистМаркировки, ИмяМакета	= "Этикетка_25_25_Остатки")

&НаСервере
Функция НапечататьКМ_НаСервере(КодыМаркировки, ЛистМаркировки, ИмяМакета = "Этикетка_25_25_Остатки")	
	Результат		= МаркировкаКС.СтруктураРезультата(Ложь);
	
	Если ЗначениеЗаполнено(КодыМаркировки) Тогда		
		рПолучения		= ПолучитьКодыПоЛМ(ЛистМаркировки, КодыМаркировки);
		ШтукВКоробке	= рПолучения.ШтукВКоробке;
	
		Если рПолучения.ШтрихКодыУпаковок.Количество() = 0 Тогда
			Результат.Ошибки.Добавить("Не найдено нераспечатанных КМ по листу маркировки: " + ЛистМаркировки);
		КонецЕсли;
	Иначе		
		Результат.Ошибки.Добавить("Не выбраны коды маркировки для печати !");	
	КонецЕсли; 
	
	Если Результат.Ошибки.Количество() > 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЛистМаркировки) Тогда
		НомерЛН 		= ПолучитьРеквизитШапки(ЛистМаркировки, "Номер");
		НомерКоробки    = Число(СтрРазделить(НомерЛН,"/")[1]);	
		НачСтрокиКоробок= Неопределено;
	Иначе		
		НомерКоробки    = 0;
		НачСтрокиКоробок= НачСтрокиКоробок(КодыМаркировки);
	КонецЕсли;
	
	ОбработкаПечати = Обработки.ПечатьЭтикетокЧЗ.Создать();
	Макет = ОбработкаПечати.ПолучитьМакет(ИмяМакета);
	
	ТД = Новый ТабличныйДокумент;
	ТД.ОтображатьСетку		= Ложь;
	ТД.ОтображатьЗаголовки	= Ложь;	
	// Смирнов М.Ю. 29.05.2025 HELP-3868 начало
	ТД.ИмяПараметровПечати	= "ПараметрыПечати_КМ_ЗНМ_КМ"+ИмяМакета;
	// Смирнов М.Ю. 29.05.2025 HELP-3868 конец
	
	РаспечатанныеКМ = Новый Соответствие;
	
	ДанныеДляПечати	= Неопределено;	
	Для Каждого ДанныеДляПечати Из рПолучения.ШтрихКодыУпаковок Цикл
		НомерШтуки		= ДанныеДляПечати.НомерСтроки - рПолучения.ПерваяСтрока + 1;
		ДопПараметры	= Новый Структура("НомерШтуки,НомерКоробки,ШтукВКоробке", НомерШтуки, НомерКоробки, ШтукВКоробке);
		Если НомерКоробки = 0 Тогда		
			НачалоКоробки 	= МаркировкаКС.ПолучитьЗначениеПараметра(НачСтрокиКоробок, ДанныеДляПечати.ШтрихКодУпаковки, ДанныеДляПечати.НомерСтроки);
			
			ДопПараметры.Вставить("НомерШтуки", 	ДанныеДляПечати.НомерСтроки - НачалоКоробки + 1);
			ДопПараметры.Вставить("НомерКоробки",	ДанныеДляПечати.НомерКоробки);
		КонецЕсли; 
		Область 		= ОбработкаПечати.СформироватьЭтикету(Макет, ДанныеДляПечати, ДопПараметры);
		
		ТД.Вывести(Область);
		ТД.ВывестиГоризонтальныйРазделительСтраниц();
		
		Если фДублироватьКМ Тогда
			ТД.Вывести(Область);
			ТД.ВывестиГоризонтальныйРазделительСтраниц();					
		КонецЕсли; 
		
		НомерШтуки = НомерШтуки + 1;		
		
		РаспечатанныеКМ[ДанныеДляПечати.ШтрихКодУпаковки] = Истина; 
	КонецЦикла; 
	
	ЗаписатьРаспечатанныеКоды(РаспечатанныеКМ);
	
	Результат.Данные 	= ТД;
	Результат.Успешно 	= Истина;
	
	Возврат Результат;
КонецФункции //НапечататьКодыПоЛН_НаСервере(ЛистМаркировки, ИмяМакета	= "Этикетка_25_25_Остатки")

&НаСервере
Процедура ЗаписатьРаспечатанныеКоды(РаспечатанныеКМ)
	Изменили = Ложь;
	Для Каждого СтрокаТЧ Из Объект.ШтрихкодыУпаковок Цикл
		Если РаспечатанныеКМ[СтрокаТЧ.ШтрихкодУпаковки] = Истина И НЕ СтрокаТЧ.Распечатан Тогда
			СтрокаТЧ.Распечатан = Истина;		
			Изменили = Истина;
		КонецЕсли;	
	КонецЦикла;
	
	Если Изменили Тогда		
		Записать(Новый Структура("РежимЗаписиДокумента", ?(Объект.фУпрощенныйРежим, РежимЗаписиДокумента.Запись, РежимЗаписиДокумента.Проведение)));
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ШтукВКоробке(Номенклатура)
	Возврат ПолучитьРеквизитШапки(Номенклатура, "Родитель.ШтукВКоробке");
КонецФункции //ШтукВКоробке(Номенклатура)
 
&НаСервере
Функция ПолучитьКодыПоЛМ(ЛистМаркировки, КодыМаркировки = Неопределено)
	Результат = Новый Структура("Успешно,ШтрихКодКоробки,ШтрихКодыУпаковок,ШтукВКоробке,ПерваяСтрока,НеПолный", 
		Истина, Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка(), Новый Массив, 0, 1, Ложь);			
	
	Запрос = Новый Запрос;
	Запрос.Текст = "	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	НомерСтроки							КАК ПерваяСтрока,
	|	ШтрихкодКоробки.Наименование 		КАК ШтрихкодКоробки,
	|	ЛистМаркировки.КоличествоДокумента	КАК КоличествоШтукВЛМО,
	|	ЛистМаркировки.НеПолный				КАК НеПолный
	|ИЗ
	|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка			 = &Ссылка
	|	И ЛистМаркировки = &ЛистМаркировки
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|ВЫБРАТЬ
	|	НомерСтроки,
	|	ШтрихкодУпаковки.Владелец							КАК Номенклатура,
	|	ШтрихкодУпаковки.Владелец.Родитель.КодПроизводителя	КАК Артикул,
	|	ШтрихкодУпаковки.Владелец.Цвет						КАК Цвет,
	|	ШтрихкодУпаковки.Владелец.Размер					КАК Размер,
	|	ШтрихкодУпаковки,	
	|	ШтрихкодУпаковки.ЗначениеШтрихкода					КАК ЗначениеКМ,
	|	НомерКоробки,
	|	НомерБлочка,
	|	НомерПалеты
	|ИЗ
	|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка				= &Ссылка
	|	И ЛистМаркировки	= &ЛистМаркировки
	|	И НЕ Распечатан 
	|	И (ШтрихкодУпаковки В (&КодыМаркировки) ИЛИ &ВсеКодыПоЛМ)	
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|ИТОГИ 
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодУпаковки) 
	|ПО
	|	Номенклатура
	|";
	
	Запрос.УстановитьПараметр("Ссылка", 			Объект.Ссылка);
	Запрос.УстановитьПараметр("ЛистМаркировки", 	ЛистМаркировки);
	Запрос.УстановитьПараметр("КодыМаркировки",		КодыМаркировки);
	Запрос.УстановитьПараметр("ВсеКодыПоЛМ",		(КодыМаркировки = Неопределено));
	
	рЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = рЗапроса[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ШтрихКодКоробки) Тогда
			Результат.ШтрихкодКоробки 	= Выборка.ШтрихкодКоробки;			
		КонецЕсли;	
		Результат.ПерваяСтрока 	= Выборка.ПерваяСтрока;
		Результат.ШтукВКоробке	= Выборка.КоличествоШтукВЛМО;
		Результат.НеПолный		= Выборка.НеПолный;
	КонецЦикла; 	
	
	ШтукВКоробке 	= 0;	
	Выборка_Номенклатура	= рЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Номенклатура");
	Пока Выборка_Номенклатура.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Результат.ШтукВКоробке) Тогда		
			Результат.ШтукВКоробке = ПолучитьРеквизитШапки(Выборка_Номенклатура.Номенклатура, "Родитель.ШтукВКоробке");
		КонецЕсли;
		
		Выборка = Выборка_Номенклатура.Выбрать();
		Пока Выборка.Следующий() Цикл		
			ДанныеШК = Новый Структура("ШтрихКодУпаковки,ЗначениеКМ,Артикул,Цвет,Размер,НомерСтроки,НомерКоробки,НомерБлочка,НомерПалеты");
			ЗаполнитьЗначенияСвойств(ДанныеШК, Выборка);
			Результат.ШтрихКодыУпаковок.Добавить(ДанныеШК);
		КонецЦикла;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция НачСтрокиКоробок(КодыМаркировки)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	| 	ШтрихкодУпаковки,
	|	ШтрихкодКоробки
	|ПОМЕСТИТЬ ВТ_КодыКоробок
	|ИЗ
	|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка	= &Ссылка		
	|	И ШтрихкодУпаковки В (&КодыМаркировки)	
	|;
	|ВЫБРАТЬ
	|	ВТ_КодыКоробок.ШтрихкодУпаковки	КАК ШтрихкодУпаковки,
	|	ВТ_КодыКоробок.ШтрихкодКоробки	КАК ШтрихкодКоробки,
	|	МИНИМУМ(ТЧ.НомерСтроки)			КАК НачалоКоробки	
	|ИЗ
	|	ВТ_КодыКоробок
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок КАК ТЧ
	|ПО
	|	ТЧ.Ссылка	= &Ссылка
	|	И ТЧ.ШтрихкодКоробки = ВТ_КодыКоробок.ШтрихкодКоробки
	|СГРУППИРОВАТЬ ПО
	|	ВТ_КодыКоробок.ШтрихкодУпаковки,
	|	ВТ_КодыКоробок.ШтрихкодКоробки
	|";
	
	Запрос.УстановитьПараметр("Ссылка", 		Объект.Ссылка);
	Запрос.УстановитьПараметр("КодыМаркировки", КодыМаркировки);
	
	Результат = Новый Соответствие;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат[Выборка.ШтрихкодУпаковки] = Выборка.НачалоКоробки;			
	КонецЦикла;
	
	Возврат Результат;
КонецФункции //НачСтрокиКоробок(КодыМаркировки)
 

&НаСервере
Функция ПолучитьКодыПалеты(НомерПалеты = 0, НомерКоробки = 0, НомерБлочка = 0, КодыМаркировки = Неопределено, Повторно = Ложь)
	Запрос = Новый Запрос;
	Запрос.Текст = "	
	|ВЫБРАТЬ
	|	НомерСтроки,
	|	НомерБлочка,
	|   НомерКоробки,
	|	НомерПалеты,
	|
	|   ШтрихкодПалеты,
	|   ШтрихкодКоробки,
	|	ШтрихкодБлочка,
	|
	|	ШтрихкодУпаковки.Владелец							КАК Номенклатура,
	|	ШтрихкодУпаковки.Владелец.Родитель.КодПроизводителя	КАК Артикул,
	|	ШтрихкодУпаковки.Владелец.Цвет						КАК Цвет,
	|	ШтрихкодУпаковки.Владелец.Размер					КАК Размер,	
	|	ШтрихкодУпаковки,
	|	ШтрихкодУпаковки.ЗначениеШтрихкода					КАК ЗначениеКМ
	|ИЗ
	|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка			= &Ссылка
	|	И (НомерПалеты	= &НомерПалеты 	ИЛИ &НомерПалеты = 0)
	|	И (НомерКоробки	= &НомерКоробки ИЛИ &НомерКоробки = 0)
	|	И (НомерБлочка	= &НомерБлочка 	ИЛИ &НомерБлочка = 0)
	|	И (ШтрихкодУпаковки В (&КодыМаркировки) ИЛИ &ВсеКодыПоЛМ)	
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|ИТОГИ
	|	МАКСИМУМ(Артикул),
	|	МАКСИМУМ(Цвет),
	|	МАКСИМУМ(Размер),
	|
	|	МИНИМУМ(НомерСтроки),
	|	МИНИМУМ(НомерБлочка),
	|	МИНИМУМ(НомерКоробки),	
	|	МИНИМУМ(НомерПалеты),
	|
	|	МИНИМУМ(ШтрихкодБлочка),
	|	МИНИМУМ(ШтрихкодКоробки),
	|
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодУпаковки) 
	|ПО
	|	НомерПалеты,
	|	НомерКоробки,
	|	НомерБлочка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", 			Объект.Ссылка);
	
	Запрос.УстановитьПараметр("НомерПалеты",		НомерПалеты);	
	Запрос.УстановитьПараметр("НомерКоробки", 		НомерКоробки);
	Запрос.УстановитьПараметр("НомерБлочка", 		НомерБлочка);
	
	Запрос.УстановитьПараметр("КодыМаркировки",		КодыМаркировки);	
	Запрос.УстановитьПараметр("ВсеКодыПоЛМ",		НЕ ЗначениеЗаполнено(КодыМаркировки));	
		
	Возврат Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
КонецФункции //ПолучитьКодыКоробки(НомерКоробки, КодыМаркировки = Неопределено)

&НаКлиенте
Процедура ШтрихкодыУпаковок_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ВыбраннаяСтрока<>Неопределено И Поле <> Неопределено Тогда
		ДанныеСтроки = Объект.ШтрихкодыУпаковок.НайтиПоИдентификатору(ВыбраннаяСтрока);		
		
		Реквизит = Сред(Поле.Имя, СтрДлина(Элемент.Имя)+1);	
		
		Если СтрНачинаетсяС(Реквизит, "ШтрихкодУпаковкиВладелецРодитель") Тогда
			Значение = ПолучитьРеквизитШапки(ДанныеСтроки.ШтрихкодУпаковки, "Владелец.Родитель");
		ИначеЕсли СтрНачинаетсяС(Реквизит, "ШтрихкодУпаковкиВладелец") Тогда	
			Значение = ПолучитьРеквизитШапки(ДанныеСтроки.ШтрихкодУпаковки, "Владелец");
		ИначеЕсли СтрНачинаетсяС(Реквизит, "ШтрихкодУпаковки") Тогда			
			Значение = ДанныеСтроки.ШтрихкодУпаковки;
		Иначе
			Значение = ДанныеСтроки[Реквизит]; 
		КонецЕсли;	
		
		ПоказатьЗначение(, Значение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодыУпаковок_ПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные <> Неопределено Тогда	
		ТекущаяНоменклатура = ПолучитьРеквизитШапки(Элемент.ТекущиеДанные.ШтрихкодУпаковки, "Владелец");
	КонецЕсли; 	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ШтрихкодыУпаковокПриАктивизацииСтроки_НаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьМаркировку(Команда)
    // Кухарь А.Ю. 24.10.2025 начало
	// HELP-7623
	если не ЗначениеЗаполнено(Объект.ДатаНачалаСканирования) тогда   
		Сообщить("Не заполнена дата начала сканирования. Попробуйте перезаписать документ, и после этого ещё раз нажмите завершить маркировку.");
		Возврат;
	КонецЕсли;
	// Кухарь А.Ю. 24.10.2025 конец
	
	
	Если Объект.ШтрихкодыУпаковок.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Невозможно завершить маркировку ! Документ пустой !");
		Возврат;	
	КонецЕсли;
	
	Если Модифицированность ИЛИ НЕ Объект.Проведен Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));	
	КонецЕсли;
	
	рПроверки = ВсеЛистыМаркировкиЗавершены();
	Если рПроверки.Успешно Тогда     
		
		
		рЗавершения = ЗавершитьМаркировку_НаСервере();
		Если рЗавершения.Успешно Тогда	
			Сообщить("Маркировка завершена.", СтатусСообщения.Информация);
			Сообщить("Сформировано: "+ рЗавершения.ОбработаноОбъектов+" агрегаций.", СтатусСообщения.Информация);
			// Кухарь А.Ю. 06.05.2025 начало
			если не ЗначениеЗаполнено(объект.Исполнитель) тогда    
				Сообщить("Не указан исполнитель, ваши достижения не будут учтены при формировании отчётов по трудозатратам. Для установки исполнителя отсканируйте ШК сотрудника.");
			КонецЕсли;
			// Кухарь А.Ю. 06.05.2025 конец
			//++Данилова Е.В. 20.05.2026 MARK-3615 
			Если ТипЗнч(Объект.ДокОснование) = Тип("ДокументСсылка.Перемаркировка") Тогда
				Документы.Перемаркировка.ЗавершитьПеремаркировку(Объект.ДокОснование); 
			КонецЕсли;
			//--Данилова Е.В. 20.05.2026	
			Закрыть();
		Иначе		
			Сообщить(СтрСоединить(рЗавершения.Ошибки, Символы.ПС), СтатусСообщения.Важное);	
		КонецЕсли;
	Иначе
		Сообщить("Обнаружены ошибки ЛМО !", СтатусСообщения.Важное);
		Сообщить(СтрСоединить(рПроверки.Ошибки, Символы.ПС));
	КонецЕсли; 	
	 
КонецПроцедуры

&НаСервере
Функция ВсеЛистыМаркировкиЗавершены()
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка,Проведен,Завершен
	|ИЗ
	|	Документ.ЛистМаркировкиОстатков
	|ГДЕ
	|	ДокОснование = &ДокОснование	
	|	И НЕ (Завершен И Проведен)
	|	И НЕ Отменен
	|";
	
	Запрос.УстановитьПараметр("ДокОснование", Объект.Ссылка);	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.Проведен Тогда		
			Результат.Ошибки.Добавить("ЛМО не проведен: " + Выборка.Ссылка + " !");
		КонецЕсли; 					
		Если НЕ Выборка.Завершен Тогда		                                 
			Результат.Ошибки.Добавить("ЛМО не завершен: " + Выборка.Ссылка + " !");
		КонецЕсли;
	КонецЦикла;
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;
КонецФункции //ВсеЛистыМаркировкиЗавершены()
	
&НаСервере
Функция ЗавершитьМаркировку_НаСервере()
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Если НужноАгрегировать() Тогда			
		рАгрегации = Документы.ЗаданиеНаМаркировку.Создать_Агрегации(Объект.Ссылка, Новый Структура("Статус", Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки)); //+++Чирков 20.05.2025 - Петров просил ставить агрегации в ОжиданиеОтложеннойОбработки
		Если рАгрегации.Успешно Тогда
			Если Объект.фУпрощенныйРежим Тогда
				рОбработки = ДозаполнитьКодыАгрегатов();	
				Если НЕ рОбработки.Успешно Тогда				
					Возврат рОбработки;			
				КонецЕсли; 
			КонецЕсли;			
			
			Результат.ОбработаноОбъектов = рАгрегации.ОбработаноОбъектов;			
		Иначе
			МаркировкаКС.ДобавитьОшибки(Результат, рАгрегации);		
		КонецЕсли;		
	КонецЕсли;
	
	Если Результат.Ошибки.Количество() = 0 Тогда
	    Объект.СостояниеНакладной 		= Перечисления.СостоянияНакладной.Отгружена;
		Объект.СформированыАгрегации    = Истина;      
		
		// Кухарь А.Ю. 06.05.2025 начало
		если объект.ДатаОкончанияСканирования=ПустаяДата() тогда
			Объект.ДатаОкончанияСканирования=ТекущаяДата();
		КонецЕсли;
		// Кухарь А.Ю. 06.05.2025 конец
		
		
		Записать();
			
		рХКМ = Документы.ХранилищеКодовМаркировки.Создать_ХКМ_к_ЗМО(Объект.Ссылка);
		Если НЕ рХКМ.Успешно Тогда
			МаркировкаКС.ДобавитьОшибки(Результат, рХКМ);					
		КонецЕсли;
		 
	КонецЕсли; 
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;
КонецФункции //ЗавершитьМаркировку_НаСервере()

&НаСервере
Функция НужноАгрегировать()
	Результат = Ложь;
	Если Объект.фУпрощенныйРежим Тогда
		Результат = (Объект.фАгрегироватьБлочки ИЛИ Объект.фАгрегироватьКоробки ИЛИ Объект.фАгрегироватьПалеты);
	Иначе
		Результат = ЕстьЗавершенныеЛМО();
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //НужноАгрегировать()
 

&НаСервере
Функция ЕстьЗавершенныеЛМО()
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК КоличествоЛМ
	|ИЗ
	|	Документ.ЛистМаркировкиОстатков КАК ЛистМаркировкиОстатков
	|ГДЕ
	|	ДокОснование = &ДокОснование
	|	И Завершен
	|	И НеПолный = Ложь
	|";
	
	Запрос.УстановитьПараметр("ДокОснование", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.КоличествоЛМ) Тогда
		Результат = Истина;			
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ЕстьЗавершенныеЛМО()

&НаСервере
Функция ДозаполнитьКодыАгрегатов()
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Если Объект.фАгрегироватьБлочки Тогда
		рКолонки = ДозаполнитьКодыАгрегатов_ПоКолонке("ШтрихкодБлочка");
		Если НЕ рКолонки.Успешно Тогда
			МаркировкаКС.ДобавитьОшибки(Результат, рКолонки);		
		КонецЕсли; 
	КонецЕсли; 
	
	Если Объект.фАгрегироватьКоробки Тогда
		рКолонки = ДозаполнитьКодыАгрегатов_ПоКолонке("ШтрихкодКоробки");
		Если НЕ рКолонки.Успешно Тогда
			МаркировкаКС.ДобавитьОшибки(Результат, рКолонки);		
		КонецЕсли;
	КонецЕсли;	
	
	Если Объект.фАгрегироватьПалеты Тогда
		рКолонки = ДозаполнитьКодыАгрегатов_ПоКолонке("ШтрихкодПалеты");
		Если НЕ рКолонки.Успешно Тогда
			МаркировкаКС.ДобавитьОшибки(Результат, рКолонки);		
		КонецЕсли; 
	КонецЕсли;
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ДозаполнитьКодыАгрегатов_ПоКолонке(ИмяКолонки)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Запрос = Новый Запрос;	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИмяКолонки				КАК ШтрихКод,
	|	ИмяКолонки.Владелец 	КАК НоменклатураТек,
	|	ИмяКолонки.Владелец.Код КАК НоменклатураТек_Код
	|ИЗ
	|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка = &Ссылка
	|	И ИмяКолонки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|	И ИмяКолонки.Владелец <> &Номенклатура
	|";	
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяКолонки", ИмяКолонки);
	
	Запрос.УстановитьПараметр("Ссылка",		  Объект.Ссылка);
	Запрос.УстановитьПараметр("Номенклатура", Объект.Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.НоменклатураТек) Тогда
			ТекстОшибки = СтрШаблон("Код агрегата: %1 принадлежит другой номенклатуре (%2 (%3)) !", 
			// Кельманов А.В. - HELP-3081 - 2025.02.27 {
			//Выборка.ШтрихкодБлочка, Выборка.НоменклатураТек, Выборка.НоменклатураТек_Код);
			Выборка.ШтрихКод, Выборка.НоменклатураТек, Выборка.НоменклатураТек_Код);
			// Кельманов А.В. - HELP-3081 - 2025.02.27 }
			Результат.Ошибки.Добавить(ТекстОшибки);
		Иначе
			УстановитьРеквизитыОбъекта(Выборка.ШтрихКод, Новый Структура("Владелец", Объект.Номенклатура));		
		КонецЕсли; 			
	КонецЦикла;
	
	Возврат Результат;
КонецФункции //ДозаполнитьКодыАгрегатов_ПоКолонке(ИмяКолонки)
 
&НаКлиенте
Процедура ПовторнаяПечать_Коды(Команда)
	ПовторнаяПечать("Коды");
КонецПроцедуры

&НаКлиенте
Процедура ПовторнаяПечать_Лента(Команда)
	ПовторнаяПечать("Лента");
КонецПроцедуры

&НаКлиенте
Процедура ПовторнаяПечать(Режим = "Коды")
	КодыМаркировки  = Новый Соответствие;
	ЛистыУпаковки	= Новый Соответствие;
	
	Для Каждого ИдСтроки Из Элементы.ШтрихкодыУпаковок.ВыделенныеСтроки Цикл
		СтрокаТЧ = Объект.ШтрихкодыУпаковок.НайтиПоИдентификатору(ИдСтроки);
		
		КодыМаркировки[СтрокаТЧ.ШтрихкодУпаковки]	= Истина;		
		ЛистыУпаковки[СтрокаТЧ.ЛистМаркировки]		= Истина;
	КонецЦикла;
	
	Если ЛистыУпаковки.Количество() = 0 Тогда
		Сообщить("Не выбран лист маркировки для печати !", СтатусСообщения.Важное);
	ИначеЕсли ЛистыУпаковки.Количество() = 1 Тогда		
		Для Каждого КиЗ Из ЛистыУпаковки Цикл	
			ЛистУпаковки = КиЗ.Ключ;
			
			Если Режим = "Коды" Тогда
				ОтменитьПечатьКодов(КодыМаркировки);
			Иначе
				ОтменитьПечатьЛистаМаркировки(КиЗ.Ключ);
			КонецЕсли; 			
			
			Если Режим = "Коды" Тогда
				Для Каждого КиЗ Из КодыМаркировки Цикл				
					ЗаписатьВЛог("Повторная печать КМ", ""+КиЗ, "Предупреждение");
				КонецЦикла;
			Иначе
				ЗаписатьВЛог("Повторная печать КМ", "" + ЛистУпаковки, "Предупреждение");
			КонецЕсли; 
			
			рПечати = НапечататьКодыПоЛН_НаСервере(ЛистУпаковки);	
			Если рПечати.Успешно Тогда
				Если фПечататьЛентуСразуНаПинтер Тогда
					рПечати.Данные.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
				Иначе					
					рПечати.Данные.Показать("Этикетки по ЛМ: " + ТекущийЛистМаркировки);
				КонецЕсли; 				
			Иначе
				Сообщить(СтрСоединить(рПечати.Ошибки, Символы.ПС), СтатусСообщения.Важное); 
			КонецЕсли;
		КонецЦикла;		
	Иначе
		Сообщить("Выбраны КМ из нескольких листов маркировки ! Печать невозможна !", СтатусСообщения.Важное);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ОтменитьПечатьКодов(КодыМаркировки)
	Изменили = Ложь;
	Для Каждого СтрокаТЧ Из Объект.ШтрихкодыУпаковок Цикл
		Если КодыМаркировки[СтрокаТЧ.ШтрихкодУпаковки] = Истина И СтрокаТЧ.Распечатан Тогда
			СтрокаТЧ.Распечатан = Ложь;
			Изменили = Истина;
		КонецЕсли;	
	КонецЦикла;
	
	Если Изменили Тогда
		Записать(Новый Структура("РежимЗаписиДокумента", РежимЗаписиДокумента.Проведение));	
	КонецЕсли;
КонецФункции //ОтменитьПечатьКодов(КодыМаркировки)
 
&НаСервере
Функция ОтменитьПечатьЛистаМаркировки(ЛистМаркировки)
	Изменили = Ложь;
	Для Каждого СтрокаТЧ Из Объект.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("ЛистМаркировки", ЛистМаркировки)) Цикл		
		СтрокаТЧ.Распечатан = Ложь;
		Изменили = Истина;		
	КонецЦикла;
	
	Если Изменили Тогда
		Записать(Новый Структура("РежимЗаписиДокумента", РежимЗаписиДокумента.Проведение));	
	КонецЕсли;
КонецФункции //ОтменитьПечатьЛМ(ЛистМаркировки)

&НаКлиенте
Процедура Номенклатура_ПриИзменении(Элемент) 
	// Ихсанов Д. А. 04.01.2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8436
	// Закомментировал проверку, возникала ошибка при сканировании
	//Валетов + 02,12,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3315
	//Запрещаем маркировать в ЗНМ Спайки   ВЕРНУЛ ПРОВЕРКУ     
	рШапки = ПолучитьРеквизитыШапки(Объект.Номенклатура, "ВидКомплекта,Родитель.ВидНоменклатуры");
	Если (рШапки.ВидКомплекта = Перечисления.ВидыКомплектов.Комплект 
		ИЛИ рШапки.ВидКомплекта = Перечисления.ВидыКомплектов.АссортитоКомплектов 
		ИЛИ рШапки.ВидКомплекта = Перечисления.ВидыКомплектов.Ассортито)
		И рШапки.Родитель_ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Товар Тогда
		СообщитьИзМодуля("Комплекты (спайки) и Ассортито необходимо маркировать через ЗСБ+ЛСК.");
		Возврат;
	КонецЕсли;
	//Валетов -
	Если ТипЗнч(Объект.ДокОснование) = Тип("ДокументСсылка.Перемещение") Тогда 
		ТЧОснования = Объект.ДокОснование.Товары.ВыгрузитьКолонку("Номенклатура");
		Если ТЧОснования.Найти(Объект.Номенклатура) = Неопределено Тогда 
			СообщитьИзМодуля("Номенклатура не найдена в докумеенте основании! Выберите другую."); 
			Объект.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
			Возврат;
		КонецЕсли; 	
	КонецЕсли;	
	//Валетов -
	
	НоменклатураПриИзменении_НаСервере();
	ЭтаФорма.ТекущийЭлемент = Элементы.КоличествоДокумента;
КонецПроцедуры

&НаКлиенте
Функция ПересчетУпаковок()
	Объект.КоличествоБлочков = 0;
	Объект.КоличествоКоробок = 0;	
	
	Если Объект.фАгрегироватьБлочки Тогда		
		Если Объект.ШтукВБлочке > 0 Тогда		
			Объект.КоличествоБлочков = Объект.КоличествоДокумента / Объект.ШтукВБлочке;
		КонецЕсли; 
	Иначе
		Объект.КоличествоБлочков = 0;			
	КонецЕсли;
	
	Если Объект.ШтукВКоробке > 0 Тогда
		Объект.КоличествоКоробок = Объект.КоличествоДокумента / Объект.ШтукВКоробке;			
	КонецЕсли;
	
	Если Объект.фАгрегироватьПалеты Тогда
		Если Объект.ШтукНаПалете > 0 Тогда
			Объект.КоличествоПалет = Объект.КоличествоДокумента / Объект.ШтукНаПалете;
		КонецЕсли;
	Иначе
		Объект.КоличествоПалет = 0;		
	КонецЕсли;	
КонецФункции //ПересчетУпаковок()
 
&НаСервере
Процедура НоменклатураПриИзменении_НаСервере()
	рШапки = ПолучитьРеквизитыШапки(Объект.Номенклатура, "Родитель.ШтукВКоробке,Родитель.ШтукВКоробочке");
	
	Объект.ШтукВБлочке 	= рШапки.Родитель_ШтукВКоробочке;
	Объект.ШтукВКоробке = рШапки.Родитель_ШтукВКоробке;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоДокумента_ПриИзменении(Элемент)
	ПересчетУпаковок();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАгрегации(Команда)
	//Валетов + 30,01,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3473
	//Запрещаем маркировать в ЗНМ Спайки      
	рШапки = ПолучитьРеквизитыШапки(Объект.Номенклатура, "ВидКомплекта,Родитель.ВидНоменклатуры");
	Если (рШапки.ВидКомплекта = Перечисления.ВидыКомплектов.Комплект 
		ИЛИ рШапки.ВидКомплекта = Перечисления.ВидыКомплектов.АссортитоКомплектов 
		ИЛИ рШапки.ВидКомплекта = Перечисления.ВидыКомплектов.Ассортито)
		И рШапки.Родитель_ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Товар Тогда
		СообщитьИзМодуля("Комплекты (спайки) и Ассортито необходимо маркировать через ЗСБ+ЛСК.");
		Возврат;
	КонецЕсли;
	//Валетов -
	
	// Шворобей ВЮ 01.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4874
	Если ЗначениеЗаполнено(Объект.ДокОснование) И ТипЗнч(Объект.ДокОснование) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		Если ПроверитьНоменклатуруЗНМ_НаОснованииРНК() = Истина Тогда Возврат; КонецЕсли;
	КонецЕсли;
	// Шворобей ВЮ 01.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4874
	
	рПроверки = ПроверитьКратность();
	
	Если рПроверки.Успешно Тогда
		Ответ = Вопрос("Отменить операцию нельзя. Проверьте значения параметров - если все правильно - нажмите 'Да'.", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, "Подтверждение параметров");
		Если Ответ = КодВозвратаДиалога.Да Тогда
			рЗаполнения = ЗаполнитьАгрегации_НаСервере();
			Если рЗаполнения.Успешно Тогда
				Объект.СостояниеНакладной = Перечисления.СостоянияНакладной.ОжиданиеДопОбработки;
				УправлениеВидимостью();
			Иначе
				МаркировкаКС.ВывестиОшибки(рЗаполнения);
			КонецЕсли;
		КонецЕсли;	
	Иначе
		МаркировкаКС.ВывестиОшибки(рПроверки);		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьАгрегации_НаСервере()
	Результат = МаркировкаКС.СтруктураРезультата();	
	
	Объект.ШтрихкодыУпаковок.Очистить();		
	Объект.Дата = ТекущаяДата();
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	
	рРасчета = ПолучитьЗабронироватьТаблицуАгрегации(Объект.КоличествоДокумента, Объект.КоличествоКоробок, Объект.КоличествоПалет, Объект.КоличествоБлочков);
	Если рРасчета.Успешно Тогда
		ДокОбъект = РеквизитФормыВЗначение("Объект");
		
		ДокОбъект.ШтрихкодыУпаковок.Загрузить(рРасчета.Данные);		
		
		Объект.СостояниеНакладной = Перечисления.СостоянияНакладной.ДопОбработка;
		Объект.ШтрихкодыУпаковок.Загрузить(рРасчета.Данные);		
		
		Записать();		
	Иначе
		МаркировкаКС.ДобавитьОшибки(Результат, рРасчета);
		ЗаписатьПроНехваткуКодов(Объект.Номенклатура, рРасчета);
		
		РегистрыСведений.СтатусыКМ_Факт.ОчиститьДвижения(Объект.Ссылка);
	КонецЕсли;
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;	
КонецФункции //ЗаполнитьАгрегации_НаСервере()

&НаКлиенте
Процедура фПалета_ПриИзменении(Элемент)
	ПересчетУпаковок();
	УправлениеВидимостью();	
КонецПроцедуры

&НаКлиенте
Процедура фБлочок_ПриИзменении(Элемент)
	ПересчетУпаковок();
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПалет_ПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ШтукНаПалете) Тогда
		Объект.КоличествоДокумента = Объект.ШтукНаПалете * Объект.КоличествоПалет;
		ПересчетУпаковок();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура КоличествоКоробок_ПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ШтукВКоробке) Тогда
		Объект.КоличествоДокумента = Объект.ШтукВКоробке * Объект.КоличествоКоробок;
		ПересчетУпаковок();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШтукНаПалете_ПриИзменении(Элемент)
	ПересчетУпаковок();
КонецПроцедуры

&НаКлиенте
Процедура ШтукВКоробке_ПриИзменении(Элемент)
	ПересчетУпаковок();
КонецПроцедуры

&НаКлиенте
Процедура ШтукВБлочке_ПриИзменении(Элемент)
	ПересчетУпаковок();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьВсехКодов(Команда)              
	//Валетов + 30,01,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3473
	//Запрещаем маркировать в ЗНМ Спайки      
	рШапки = ПолучитьРеквизитыШапки(Объект.Номенклатура, "ВидКомплекта,Родитель.ВидНоменклатуры");
	Если (рШапки.ВидКомплекта = Перечисления.ВидыКомплектов.Комплект 
		ИЛИ рШапки.ВидКомплекта = Перечисления.ВидыКомплектов.АссортитоКомплектов 
		ИЛИ рШапки.ВидКомплекта = Перечисления.ВидыКомплектов.Ассортито)
		И рШапки.Родитель_ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Товар Тогда
		СообщитьИзМодуля("Комплекты (спайки) и Ассортито необходимо маркировать через ЗСБ+ЛСК.");
		Возврат;
	КонецЕсли;
	//Валетов -

	// Кухарь А.Ю. 06.05.2025 начало
	Если объект.ДатаНачалаСканирования = ПустаяДата() Тогда
		Объект.ДатаНачалаСканирования = ТекущаяДата();
	КонецЕсли;
	// Кухарь А.Ю. 06.05.2025 конец
	
	// Шворобей ВЮ 03.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4874
	Если Объект.ШтрихкодыУпаковок.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не заполнены коды маркировки !");		
		Возврат;			
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДокОснование) И ТипЗнч(Объект.ДокОснование) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		Если ПроверитьНоменклатуруЗНМ_НаОснованииРНК() = Истина Тогда Возврат; КонецЕсли;
	КонецЕсли;
	// Шворобей ВЮ 03.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4874
	
	Если НЕ МаркировкаК.ЗаписатьИзмененныйОбъектВУпрФорме(ЭтаФорма, Истина) Тогда Возврат; КонецЕсли;
	
	Номера = Новый Соответствие;
	Для Каждого Строка Из Объект.ШтрихкодыУпаковок Цикл
		Если Объект.фАгрегироватьПалеты Тогда
			Если ЗначениеЗаполнено(Строка.НомерПалеты) Тогда
				Номера[Строка.НомерПалеты] = Истина;
			КонецЕсли; 
		Иначе
			Если ЗначениеЗаполнено(Строка.НомерКоробки) Тогда
				Номера[Строка.НомерКоробки] = Истина;
			КонецЕсли;					
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого КиЗ Из Номера Цикл
		ТекНомер = КиЗ.Ключ;
		Если Объект.фАгрегироватьПалеты Тогда
			рПечати = НапечататьКодыПоПалетам_НаСервере(ТекНомер, , ,Истина);
		Иначе
			рПечати = НапечататьКодыПоПалетам_НаСервере(0, ТекНомер, ,Истина);
		КонецЕсли;
		
		Если рПечати.Успешно Тогда     			
			Если фПечататьЛентуСразуНаПинтер Тогда
				рПечати.Данные.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
			Иначе
				рПечати.Данные.Показать("Все этикетки по ЗНМ №: " + Объект.Номер);				
			КонецЕсли;			
		Иначе
			МаркировкаКС.ВывестиОшибки(рПечати.Ошибки);
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура фУпрощенныйРежим_ПриИзменении(Элемент)
	Если Объект.фУпрощенныйРежим Тогда	
		фПечататьЛентуСразуНаПринтер = Ложь;
	КонецЕсли;
	
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьБитыйЛН(Команда)
	ТекДанные = Элементы.ШтрихкодыУпаковок.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если ЗначениеЗаполнено(ТекДанные.ЛистМаркировки) И НЕ МаркировкаС.ОбъектСуществует(ТекДанные.ЛистМаркировки) Тогда
			Если ЗначениеЗаполнено(ТекДанные.ШтрихкодУпаковки) Тогда
				ЛМ = СоздатьЛистМаркировки(ТекДанные.ШтрихкодУпаковки.Владелец, Новый Структура("СсылкаНового", ТекДанные.ЛистМаркировки));
				Сообщить("Создан ЛМ: " + ЛМ, СтатусСообщения.Информация);
			КонецЕсли; 			
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьКодКоробки(Команда)
	Если Объект.Ссылка.Пустая()  Тогда
		ПоказатьПредупреждение(, "Документ не записан !");
		Возврат;	
	КонецЕсли;
	
	ТекДанные = Элементы.ШтрихкодыУпаковок.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.ШтрихкодКоробки) Тогда
		рЗамены = ЗаменитьКодКоробки_НаСервере(ТекДанные.ШтрихкодКоробки);				
		Если рЗамены.Успешно Тогда
		Иначе
			МаркировкаКС.ВывестиОшибки(рЗамены);
		КонецЕсли; 
	Иначе
		ПоказатьПредупреждение(, "Не указан код коробки в выбраной строке !");
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ЗаменитьКодКоробки_НаСервере(ШтрихкодКоробкиСтарый)
	Результат = МаркировкаКС.СтруктураРезультата();	
	
	рПолучения = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныйКодАгрегации(Перечисления.ТипыШтрихКодов.Коробка, Перечисления.ТипыУпаковок.МонотоварнаяУпаковка, Объект.Ссылка, Новый Структура("Добавлять", Истина));
	
	Если рПолучения.Успешно Тогда
		ШтрихкодКоробкиНовый = рПолучения.Данные;
		СтрокиТЧ = Объект.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("ШтрихкодКоробки", ШтрихкодКоробкиСтарый));	
		Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
			СтрокаТЧ.ШтрихкодКоробки = ШтрихкодКоробкиНовый;
		КонецЦикла; 
		
		Попытка
		    Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
		Исключение
			Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
			Результат.Ошибки.Добавить("Не удалось провести документ ! " + ОписаниеОшибки());		
		КонецПопытки;
		
		УстановитьРеквизитыОбъекта(ШтрихкодКоробкиНовый, Новый Структура("Владелец", ПолучитьРеквизитШапки(ШтрихкодКоробкиСтарый, "Владелец")));
	Иначе
		МаркировкаКС.ДобавитьОшибки(Результат, рПолучения);
	КонецЕсли; 
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;	
КонецФункции

&НаСервереБезКонтекста
Функция СоздатьАгрегацию_НаСервере(ЗНМ_Ссылка)
	Возврат Документы.ЗаданиеНаМаркировку.Создать_Агрегации(ЗНМ_Ссылка, Новый Структура("Статус", Перечисления.СтатусыДокументовМаркировки.КОбработке));	
КонецФункции

&НаКлиенте
Процедура СоздатьАгрегацию(Команда)
	Если МаркировкаК.ЗаписатьИзмененныйОбъектВУпрФорме(ЭтаФорма) Тогда
		рСоздания = СоздатьАгрегацию_НаСервере(Объект.Ссылка);
		Если рСоздания.Успешно Тогда
			Сообщить("Оформлена агрегация: " + рСоздания.Данные);
		Иначе
			МаркировкаКС.ВывестиОшибки(рСоздания);
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТекНоменклатура_ПриИзменении(Элемент)
	ЭтаФорма.ТекущийЭлемент = ?(Объект.фУпрощенныйРежим, Элементы.КоличествоДокумента, Элементы.КоличествоШтукВЛенте);
КонецПроцедуры

// Кухарь А.Ю. 06.05.2025 начало
&НаСервереБезКонтекста
Функция НайтиФизЛицоПоШК (Данные)
	Возврат Справочники.ФизическиеЛица.НайтиПоРеквизиту("ШтрихКод",Данные);
КонецФункции
// Кухарь А.Ю. 06.05.2025 конец
 
// Шворобей ВЮ 02.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4874 
&НаКлиенте
Функция ПроверитьНоменклатуруЗНМ_НаОснованииРНК()

	// Кухарь А.Ю.  16.09.2025 начало
	ДанныеЗамера	= ОценкаПроизводительностиКлиентСервер.НачатьЗамерФункции("Документ.ЗаданиеНаМаркировку.ПроверитьНоменклатуруЗНМ_НаОснованииРНК",новый Структура("Ссылка",Объект.Ссылка));
	// Кухарь А.Ю.  16.09.2025 конец
	
	
	ТекНоменклатура = ?(Объект.фУпрощенныйРежим, Объект.Номенклатура, ТекущаяНоменклатура);
	
	ТекКоличество = ?(Объект.фУпрощенныйРежим, Объект.КоличествоДокумента, КоличествоШтукВЛенте);
	
	СтруктураВозврата = Неопределено;
	
	Если Параметры.Ключ.Пустая() Тогда
		СтруктураВозврата = Документы.ЗаданиеНаМаркировку.КонтрольНоменклатурыПоЗНМ(Объект.ДокОснование, ТекНоменклатура, ТекКоличество);
	Иначе
		СтруктураВозврата = Документы.ЗаданиеНаМаркировку.КонтрольНоменклатурыПоЗНМ_ПоСсылке(Объект.Ссылка, ТекНоменклатура);	
	КонецЕсли;
	
	Если ТипЗнч(СтруктураВозврата.ТЗ_Разница) = Тип("ТаблицаЗначений") И СтруктураВозврата.ТЗ_Разница.Количество() > 0 Тогда
		
		МассивСообщений = Новый Массив;
		
		Для Каждого Стр ИЗ СтруктураВозврата.ТЗ_Разница Цикл
			
			МассивСообщений.Добавить("Номенклатура " + Строка(Стр.Номенклатура));
			МассивСообщений.Добавить("Кол-во в РНК = " + Строка(Стр.КоличествоРНК) + ", в этом ЗНМ " + Строка(Стр.КоличествоЗНМ));
			
			Если Стр.КоличествоВДругихЗНМ > 0 Тогда
				МассивСообщений.Добавить("Количество в других ЗНМ " + Строка(Стр.КоличествоВДругихЗНМ));
			КонецЕсли;
			
			Если Стр.КоличествоОМ > 0 Тогда
				МассивСообщений.Добавить("Количество в других ОМ " + Строка(Стр.КоличествоОМ));
			КонецЕсли;
			
		КонецЦикла;
		
		ТекстСообщение = СтрСоединить(МассивСообщений, Символы.ПС);
		Сообщить(ТекстСообщение);
		
		Отказ = Истина;
	Иначе
		Отказ = Ложь;
		
	КонецЕсли;
	// Кухарь А.Ю.  16.09.2025 начало
	ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерФункции(ДанныеЗамера);
	// Кухарь А.Ю.  16.09.2025 конец
	
	
	Возврат Отказ;
	
КонецФункции
// Шворобей ВЮ 02.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4874 

// Кухарь А.Ю.  07.07.2025 начало
&НаКлиенте
Процедура ПерезаполнитьТовары(Команда)
	ПерезаполнитьТоварыНаСервере();
КонецПроцедуры    

&НаСервере
Процедура ПерезаполнитьТоварыНаСервере()
	документы.ЗаданиеНаМаркировку.Создать_ЗаданиеНаМаркировку(Объект.ДокОснование);
КонецПроцедуры    
 
// Кухарь А.Ю.  07.07.2025 конец


