
&НаКлиенте
Процедура ПолучитьСписокФайлов(Команда)
	ТекДанные = Элементы.BucketObjects.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ТекДанные.IsFolder Тогда
		Префикс = СокрЛП(ТекДанные.key); 			
	Иначе
		Префикс = "";
	КонецЕсли; 
	
	ПолучитьСписокФайлов_НаСервере(Префикс);
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокФайлов_НаСервере(Префикс)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ОбработкаОбъект.ПолучитьСписокФайлов(Префикс);	
	
	Объект.BucketObjects.Загрузить(ОбработкаОбъект.BucketObjects.Выгрузить());	
КонецПроцедуры


&НаКлиенте
Процедура BucketObjects_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	ТекДанные = Элементы.BucketObjects.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		рЗапроса = ПрочитатьФайлИзКорзины(ТекДанные.Key);	
		
		Если рЗапроса.Успешно Тогда
			Время = (ТекущаяУниверсальнаяДатаВМиллисекундах()-рЗапроса.Начало);
			
			//рЗапроса.Сообщения.Добавить(СтрШаблон("Время передачи на клиент: '%1' c.", Время/1000));
			
			Терминал = СтрСоединить(рЗапроса.Сообщения, Символы.ПС);
		Иначе
			Сообщить(СтрСоединить(рЗапроса.Ошибки, Символы.ПС));
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПрочитатьФайлИзКорзины(ИмяФайла)
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	рЗапроса	= РеквизитФормыВЗначение("Объект").ПрочитатьФайлИзКорзины(ИмяФайла);	
	Время 		= (ТекущаяУниверсальнаяДатаВМиллисекундах()-Начало);
	
	рЗапроса.Сообщения.Добавить(СтрШаблон("Время получения из корзины S3: '%1' c.", Время/1000));
	
	Если рЗапроса.Успешно Тогда
		рОстатки = РеквизитФормыВЗначение("Объект").ПрочитатьОстатки(рЗапроса.Данные);
		Объект.Остатки.Очистить();
		Объект.Остатки.Загрузить(рОстатки.Данные);
		
		Для Каждого ТекстСообщения Из рОстатки.Сообщения Цикл
			рЗапроса.Сообщения.Добавить(ТекстСообщения);		
		КонецЦикла;		
	КонецЕсли;
	
	Время = (ТекущаяУниверсальнаяДатаВМиллисекундах()-Начало);
	рЗапроса.Сообщения.Добавить(СтрШаблон("Полное время загрузки остатков: '%1' c.", Время/1000));	
	//рЗапроса.Сообщения.Добавить("=============================================");	
	
	рЗапроса.Данные = Неопределено;
	рЗапроса.Вставить("Начало", ТекущаяУниверсальнаяДатаВМиллисекундах());
	
	Возврат рЗапроса;
КонецФункции

