#Область СобытияОбъекта

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЗаполнитьШапкуДокумента(ЭтотОбъект, ПараметрыСеанса.Пользователь);
	
	ДокОснование	= ДанныеЗаполнения;
	Если НЕ ЗначениеЗаполнено(ДокОснование) Тогда Возврат КонецЕсли;	
	
	ТипОснования = ТипЗнч(ДокОснование); 
	
	Если ТипОснования = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		//Валетов + 26,11,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-7985 
		ДокСМаркировкой = ПолучитьРеквизитШапки(ДокОснование,"ТребуетсяМаркировка","Документ");
		Если НЕ ДокСМаркировкой Тогда 
			СообщитьИзМодуля("РНК не требует маркирвоки, ЗНМ по ней сформирован не будет!");
			Возврат;
		КонецЕсли;
		//Валетов -			
		ЗаполнитьПоРНК();	
		//Валетов + 06,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-6363
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.Перемещение") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданиеНаМаркировкуТовары.Ссылка КАК Ссылка,
		|	СУММА(ЗаданиеНаМаркировкуТовары.Количество) КАК Количество
		|ИЗ
		|	Документ.ЗаданиеНаМаркировку.Товары КАК ЗаданиеНаМаркировкуТовары
		|ГДЕ
		|	ЗаданиеНаМаркировкуТовары.Ссылка.Проведен
		|	И ЗаданиеНаМаркировкуТовары.Ссылка.ДокОснование = &ДокОснование
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаданиеНаМаркировкуТовары.Ссылка";
		Запрос.УстановитьПараметр("ДокОснование",ДокОснование);
		Результат = запрос.Выполнить().Выгрузить();
		Если ДокОснование.КоличествоДокумента <= Результат.Итог("Количество") Тогда
			СообщитьИзМодуля("ЗНМ не создан! По данному ПРМ уже есть ЗНМ на общее количество: " +  Результат.Итог("Количество"));
			Возврат;
		КонецЕсли;
		//Валетов - 
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)          
	Если СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена 
		И ВсеКодыВСтатусеНанесен(Ссылка)	//Иногда перепроводят документы в промежуточных стадиях - тогда нужно переформировывать движения
		Тогда 
		Возврат;
	КонецЕсли;
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	СформироватьДвижения();	
КонецПроцедуры

Функция ПолучитьУникальныеЗначенияКолонки(ИмяКолонки)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	" + ИмяКолонки + "
	|ИЗ
	|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка = &Ссылка	
	|	И " + ИмяКолонки + " <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|УПОРЯДОЧИТЬ ПО
	|	" + ИмяКолонки + ".Наименование
	|";	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(ИмяКолонки);
КонецФункции //ПолучитьУникальныеЗначенияКолонки(ИмяКолонки)

Процедура ЗаписатьСтатусКодов(МассивКодов, НЗ, Статус)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка	КАК ШтрихКодУпаковки,
	|	ТипШК	КАК ТипШК
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	Ссылка В (&МассивКодов)
	|";
	
	Запрос.УстановитьПараметр("МассивКодов", МассивКодов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл	
		Движение = НЗ.Добавить();		
		
		Движение.Период				= Дата;
		
		Движение.ШтрихКодУпаковки	= Выборка.ШтрихКодУпаковки;		
		Движение.ТипШК				= Выборка.ТипШК;
		
		Движение.Местонахождение	= Подразделение;
		Движение.Статус				= Статус;
	КонецЦикла;
КонецПроцедуры //ЗаписатьСтатусКодов(МассивКодов, Статус)
 
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если ЗначениеЗаполнено(Организация) Тогда
		Префикс = СокрЛП(Организация.Префикс);	
	КонецЕсли; 
	Префикс = Префикс+Маркировка_ПИ.ЭтотУзел_Код("Основной")+"-";
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Автор 					= ПараметрыСеанса.Пользователь;
	Комментарий 			= "";
	СостояниеНакладной 		= Перечисления.СостоянияНакладной.ВРаботе;
	СформированыАгрегации   = Ложь;
	
	Товары.Очистить();
	ШтрихкодыУпаковок.Очистить();
	ШтрихкодыКоробок.Очистить();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
	
	ОбновитьСтатусыНанесения();
	
	Если Модифицированность() Тогда
		Если фУпрощенныйРежим Тогда
		Иначе
			КоличествоДокумента = ШтрихкодыУпаковок.Количество();	
			Если КоличествоДокумента > 0 тогда
				ЗаполнитьТоварыПоКМ(ЭтотОбъект);
			КонецЕсли;		
		КонецЕсли;
		
		// Кухарь А.Ю.  19.04.2025 начало
		// ОбновитьСоставКоробок();
		если  фАгрегироватьКоробки или фАгрегироватьБлочки или фАгрегироватьПалеты Тогда 
			ОбновитьСоставКоробок();
		КонецЕсли;	 
		// Кухарь А.Ю.  19.04.2025 конец     
		
		// Кухарь А.Ю. 24.10.2025 начало
		// HELP-7623
		если ДатаНачалаСканирования = ПустаяДата() и ШтрихкодыУпаковок.Количество()> 0 тогда  
			ДатаНачалаСканирования = ТекущаяДата();
		КонецЕсли;
		// Кухарь А.Ю. 24.10.2025 конец
		
	КонецЕсли;	

	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//Документы.ЗаданиеНаМаркировку.ЗарегистрироватьИспользованныеКоробки(Ссылка);
КонецПроцедуры

#КонецОбласти 

Функция ВсеКодыВСтатусеНанесен(Регистратор)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТипШК,
	|	Статус
	|ИЗ
	|	РегистрСведений.СтатусыКМ_Факт КАК СтатусыКМ_Факт
	|ГДЕ	
	|	Регистратор = &Регистратор	
	|	И Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.Нанесен)
	|";
	
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат НЕ (Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ТипШК));	
КонецФункции //ВсеКодыСтатусеНанесен(Регистратор) 

Функция СформироватьДвижения(ЗаписыватьДвижения = Ложь) Экспорт	
	СтатусКМ_Факт		= Перечисления.СтатусыКодовМаркировкиФакт.Распечатан;	
	Если фУпрощенныйРежим И СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена Тогда
		СтатусКМ_Факт	= Перечисления.СтатусыКодовМаркировкиФакт.Нанесен;			
	КонецЕсли; 
			
	Для Каждого СтрокаТЧ из ПолучитьТаблицуШК(Ссылка) Цикл		
		Движение = Движения.СтатусыКМ_Факт.Добавить();		
		
		Движение.Период				= ?(ЗначениеЗаполнено(СтрокаТЧ.ДатаБронированияКМ), СтрокаТЧ.ДатаБронированияКМ, Дата);
		
		Движение.Номенклатура		= СтрокаТЧ.Номенклатура;
		Движение.ТипШК				= СтрокаТЧ.ТипШК;
		Движение.ШтрихКодУпаковки	= СтрокаТЧ.ШтрихкодУпаковки;
		Движение.Местонахождение	= Подразделение;
		
		Движение.Статус				= Перечисления.СтатусыКодовМаркировкиФакт.Распечатан;				
		
		Если фУпрощенныйРежим Тогда //упрощенный режим			
			Движение.Статус	= СтатусКМ_Факт;			
		КонецЕсли;		
	КонецЦикла;	
	
	//Если фАгрегироватьКоробки Тогда
		ЗаписатьСтатусКодов(ПолучитьУникальныеЗначенияКолонки("ШтрихкодКоробки"), Движения.СтатусыКМ_Факт, СтатусКМ_Факт);	
	//КонецЕсли;	
	
	Если фАгрегироватьБлочки Тогда
		ЗаписатьСтатусКодов(ПолучитьУникальныеЗначенияКолонки("ШтрихкодБлочка"), Движения.СтатусыКМ_Факт, СтатусКМ_Факт);
	КонецЕсли; 
	
	Если фАгрегироватьПалеты Тогда
		ЗаписатьСтатусКодов(ПолучитьУникальныеЗначенияКолонки("ШтрихкодПалеты"), Движения.СтатусыКМ_Факт, СтатусКМ_Факт);
	КонецЕсли;
	
КонецФункции //СформироватьДвижения(ЗаписыватьДвижения = Ложь) Экспорт

Функция ПолучитьТаблицуШК(ДокСсылка)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки			КАК ШтрихкодУпаковки,
	|	ШтрихкодУпаковки.ТипШК		КАК ТипШК,
	|	ШтрихкодУпаковки.Владелец 	КАК Номенклатура,
	|	ДатаБронированияКМ			КАК ДатаБронированияКМ
	|ИЗ
	|	" +  ДокСсылка.Метаданные().ПолноеИмя() + ".ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка = &ДокСсылка
	|";                             
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции //ПолучитьТаблицуШК(ДокСсылка)

Функция ЗаполнитьПоРНК()
	Запрос = Новый ("Запрос");
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Номенклатура,
	|	СУММА(Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ТЧ
	|ИЗ
	|	Документ.РасходнаяНакладная.Товары
	|ГДЕ
	|	Ссылка = &Ссылка
	|	И Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.Опубликована)
	|	И ТребуетсяМаркировка
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура
	|";		
	
	Запрос.УстановитьПараметр("Ссылка", ДокОснование);	
КонецФункции //ЗаполнитьПоРНК()

Функция ЗаполнитьТоварыПоКМ(ДокОбъект) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "	
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_КМ ИЗ &ШтрихкодыУпаковок КАК ШтрихкодыУпаковок
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_КМ.ШтрихкодУпаковки.Владелец КАК Номенклатура,
	|	МАКСИМУМ(Ссылка)				КАК Единица,
	|	МАКСИМУМ(Коэффициент)			КАК Коэффициент
	|ПОМЕСТИТЬ ВТ_Единицы
	|ИЗ
	|	ВТ_КМ
	|ЛЕВОЕ СОЕДИНЕНИЕ	
	|	Справочник.Единицы КАК Единицы
	|ПО
	|	Единицы.Владелец = ВТ_КМ.ШтрихкодУпаковки.Владелец
	|	И Единицы.ОКЕИ = ВТ_КМ.ШтрихкодУпаковки.Владелец.БазоваяЕдиница	
	|	И НЕ Единицы.ПометкаУдаления
	|ГДЕ
	|	ВТ_КМ.ШтрихкодУпаковки.Владелец <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	ВТ_КМ.ШтрихкодУпаковки.Владелец
	|;	
	|ВЫБРАТЬ
	|	ВТ_КМ.ШтрихкодУпаковки.Владелец 	КАК Номенклатура,
	|	МАКСИМУМ(ВТ_Единицы.Единица)		КАК Единица,
	|	МАКСИМУМ(ВТ_Единицы.Коэффициент)	КАК Коэффициент,
	|	СУММА(1) 							КАК Количество
	|ИЗ
	|	ВТ_КМ	
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ВТ_Единицы
	|ПО
	|	ВТ_Единицы.Номенклатура = ШтрихкодУпаковки.Владелец
	|ГДЕ
	|	ШтрихкодУпаковки.Владелец <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	ШтрихкодУпаковки.Владелец
	|УПОРЯДОЧИТЬ ПО
	|	ШтрихкодУпаковки.Владелец.Наименование
	|";	
	
	Запрос.УстановитьПараметр("ШтрихкодыУпаковок", ДокОбъект.ШтрихкодыУпаковок);
	
	ДокОбъект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецФункции //ЗаполнитьТоварыПоКМ(ДокОбъект) Экспорт

Процедура ОбновитьСтатусыНанесения()
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_КМ ИЗ &ШтрихкодыУпаковок КАК ШтрихкодыУпаковок
	|;
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки
	|ПОМЕСТИТЬ ВТ_НанесенныеКМ
	|ИЗ
	|	Документ.ЛистМаркировкиОстатков.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка.ДокОснование = &ДокОснование
	|	И Ссылка.Завершен
	|	И Ссылка.Проведен
	|;
	|ВЫБРАТЬ
	|	ВТ_КМ.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|	ВТ_КМ.НомерСтроки
	|ИЗ
	|	ВТ_КМ
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ВТ_НанесенныеКМ
	|ПО
	|	ВТ_КМ.ШтрихкодУпаковки = ВТ_НанесенныеКМ.ШтрихкодУпаковки
	|ГДЕ
	|	НЕ ВТ_КМ.Нанесен
	|	И НЕ ВТ_НанесенныеКМ.ШтрихкодУпаковки ЕСТЬ NULL
	|";
	
	Запрос.УстановитьПараметр("ДокОснование",		Ссылка);
	Запрос.УстановитьПараметр("ШтрихкодыУпаковок",	ШтрихкодыУпаковок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТЧ = ШтрихкодыУпаковок[Выборка.НомерСтроки-1];
		Если СтрокаТЧ.ШтрихкодУпаковки = Выборка.ШтрихкодУпаковки Тогда
			СтрокаТЧ.Нанесен = Истина;					
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Отказ = Истина;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)	
	Если фУпрощенныйРежим Тогда
		мПроверяемыеРеквизиты = Новый Массив;
		Для Каждого Рекв Из ПроверяемыеРеквизиты Цикл
			Если Рекв <> "ШтрихкодыУпаковок.ЛистМаркировки" Тогда
				мПроверяемыеРеквизиты.Добавить(Рекв);							
			КонецЕсли;		
		КонецЦикла;		
		
		ПроверяемыеРеквизиты = мПроверяемыеРеквизиты;
	КонецЕсли; 
КонецПроцедуры

Процедура ОбновитьСоставКоробок()
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ШтрихкодКоробки ИЗ (
	|	ВЫБРАТЬ ШтрихкодКоробки ИЗ Документ.ЗаданиеНаМаркировку.ШтрихкодыКоробок ГДЕ Ссылка = &Ссылка
	|	ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ ШтрихкодБлочка ИЗ Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок ГДЕ Ссылка = &Ссылка
	|	ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ ШтрихкодКоробки ИЗ Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок ГДЕ Ссылка = &Ссылка
	|	ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ ШтрихкодПалеты ИЗ Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок ГДЕ Ссылка = &Ссылка
	|) КАК Сводный
	|ГДЕ
	|	 ШтрихкодКоробки<>ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|УПОРЯДОЧИТЬ ПО 
	|	ШтрихкодКоробки.Наименование
	|";	
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ШтрихкодыКоробок.Загрузить(Запрос.Выполнить().Выгрузить());	
КонецПроцедуры 

