&НаСервере
Функция В_JSON(Значение) Экспорт
	ЗначениеВнутр = ПривестиЗначение(Значение);
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON,ЗначениеВнутр);
	Возврат ЗаписьJSON.Закрыть();
КонецФункции
&НаСервере
Функция Из_JSON(Значение,ВСоответствие=Истина) Экспорт
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Значение);
	Возврат ПрочитатьJSON(ЧтениеJSON,ВСоответствие);
КонецФункции
&НаСервере
Функция ПривестиЗначение(Значение) Экспорт   
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		Возврат Значение;
	ИначеЕсли ТипЗнч(Значение) = Тип("Неопределено") Тогда	
		Возврат Значение;
	ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда	
		Возврат Значение;
	ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда	
		Возврат Значение;
	ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда	
		Возврат Значение;
	ИначеЕсли ТипЗнч(Значение) = Тип("Булево") Тогда	
		Возврат Значение;
	ИначеЕсли ТипЗнч(Значение) = Тип("Массив") Тогда	
		ЗначениеВнутр = Новый Массив;
		Для каждого СтрЗнач Из Значение Цикл
			ЗначениеВнутр.Добавить(ПривестиЗначение(СтрЗнач));
		КонецЦикла;	
		Возврат ЗначениеВнутр;
	ИначеЕсли ТипЗнч(Значение) = Тип("Структура") Тогда	
		ЗначениеВнутр = Новый Структура;
		Для каждого СтрЗнач Из Значение Цикл
			ЗначениеВнутр.Вставить(СтрЗнач.Ключ,ПривестиЗначение(СтрЗнач.Значение));
		КонецЦикла;	
		Возврат ЗначениеВнутр;
	ИначеЕсли ТипЗнч(Значение) = Тип("ТаблицаЗначений") Тогда	
		ЗначениеВнутр = Новый Массив;
		Для каждого СтрЗнач Из Значение Цикл
			СтрокаЗначения = Новый Структура();
			Для каждого Колонка Из Значение.Колонки Цикл
				СтрокаЗначения.Вставить(Колонка.Имя,ПривестиЗначение(СтрЗнач[Колонка.Имя]));	
			КонецЦикла;	
			ЗначениеВнутр.Добавить(СтрокаЗначения);
		КонецЦикла;	
		Возврат ЗначениеВнутр;
	ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) ИЛИ Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
		Если Значение.Пустая() Тогда
			Возврат Неопределено;
		КонецЕсли;	
		Возврат Строка(Значение.УникальныйИдентификатор());
	Иначе
		Возврат Строка(Значение);
	КонецЕсли;	
КонецФункции


Функция GetPData(RNK_Number, RNK_Date)
	ДатаПериодаРНК = Дата(RNK_Date);
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ДокПаллета_ЛистыНабора.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ Вт_Паллеты
	                      |ИЗ
	                      |	Документ.Паллета.ЛистыНабора КАК ДокПаллета_ЛистыНабора
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Паллета КАК ДокПаллета
	                      |		ПО (ДокПаллета.Ссылка = ДокПаллета_ЛистыНабора.Ссылка)
	                      |			И (ДокПаллета.Проведен)
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК ДокРНК
	                      |		ПО (ДокРНК.Ссылка = ДокПаллета_ЛистыНабора.Документ)
	                      |ГДЕ
	                      |	ДокРНК.Номер = &НомерРНК
	                      |	И ДокРНК.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаРНК, ГОД) И КОНЕЦПЕРИОДА(&ДатаРНК, ГОД)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ДокПаллета.Ссылка КАК ПаллетаСсылка,
	                      |	ДокПаллета_Товары.SSCCКод КАК SSCCКод,
	                      |	ДокПаллета_Товары.Номенклатура КАК Номенклатура,
	                      |	ДокПаллета_Товары.Количество КАК Количество
	                      |ИЗ
	                      |	Документ.Паллета КАК ДокПаллета
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Паллета.Товары КАК ДокПаллета_Товары
	                      |		ПО (ДокПаллета_Товары.Ссылка = ДокПаллета.Ссылка)
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Вт_Паллеты КАК Вт_Паллеты
	                      |		ПО ДокПаллета.Ссылка = Вт_Паллеты.Ссылка
	                      |ГДЕ
	                      |	ДокПаллета.Проведен
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПаллетаСсылка,
	                      |	Номенклатура,
	                      |	SSCCКод");
	Запрос.УстановитьПараметр("НомерРНК",RNK_Number);
	Запрос.УстановитьПараметр("ДатаРНК",ДатаПериодаРНК);
	Таб = Запрос.Выполнить().Выгрузить();
	Возврат В_JSON(Таб);
КонецФункции

//Нечаева 03,02,26  +++ SNL-118
Функция GetPDataOb(RNK_Number, RNK_Date)
	
	ДатаПериодаРНК = Дата(RNK_Date);

	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ПаллетаЛистыНабора.Ссылка КАК Паллета,
	|	ПаллетаЛистыНабора.Описание КАК НомерКоробки,
	|	ПаллетаЛистыНабора.Ссылка.ОкончаниеПаллетирования КАК ОкончаниеПаллетирования,
	|	ПаллетаЛистыНабора.ШКЛистаНабора,
	|	ПаллетаЛистыНабора.ЛистНабора,
	|	ПаллетаЛистыНабора.Ссылка.SSCCКод
	|ИЗ
	|	Документ.Паллета.ЛистыНабора КАК ПаллетаЛистыНабора
	|ГДЕ
	|	ПаллетаЛистыНабора.Ссылка.Проведен
	|	И ПаллетаЛистыНабора.Документ.Номер = &НомерРНК
 	|	И ПаллетаЛистыНабора.Документ.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаРНК, ГОД) И КОНЕЦПЕРИОДА(&ДатаРНК, ГОД)
    |	И ПаллетаЛистыНабора.ЛистНабора.ТипШК = &Коробка";
	
    Запрос.УстановитьПараметр("НомерРНК",RNK_Number);
	Запрос.УстановитьПараметр("ДатаРНК",ДатаПериодаРНК); 
	запрос.УстановитьПараметр("Коробка", перечисления.ТипыШтрихКодов.Коробка);
	
	СписокСтрокизПаллет=запрос.Выполнить().Выгрузить();
	СписокСтрокизПаллет.Колонки.Добавить("Количество");
	СписокСтрокизПаллет.Колонки.Добавить("Номенклатура");
	
	
	Для Каждого Строка из СписокСтрокизПаллет Цикл
		
		ШККоробок = Новый ТаблицаЗначений; 
		//++Данилова Е.В. 25.05.2026  HELP-9853
		//ШККоробок =  ПолучитьСписокШКкоробокЛистаНабора(Строка.ЛистНабора);
		ШККоробок =  ПолучитьСписокШКкоробокЛистаНабора(Строка.ЛистНабора,,,ложь);
		//--Данилова Е.В. 25.05.2026 
		// ищем По ШК и прописываем количество.
		ТекНомер = Строка.НомерКоробки;
		НайденнаяСтрока = ШККоробок.Найти(Число(ТекНомер), "НомерКоробки");
		Если НайденнаяСтрока = Неопределено Тогда
			//Предупреждение("Товар не найден!");
		Иначе
			Строка.Номенклатура = НайденнаяСтрока.Номенклатура;
			Строка.Количество = НайденнаяСтрока.Номенклатура.Родитель.ШтукВКоробке;
		КонецЕсли;
		
	КонецЦикла;
	
	// вторая часть по блочкам и штукам
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ПаллетаЛистыНабора.Ссылка КАК Паллета,
	             |	ПаллетаЛистыНабора.ЛистНабора КАК ЛистНабора,
	             |	ВЫРАЗИТЬ(ПаллетаЛистыНабора.Ссылка.SSCCКод КАК СТРОКА(50)) КАК SSCCКод
	             |ИЗ
	             |	Документ.Паллета.ЛистыНабора КАК ПаллетаЛистыНабора
	             |ГДЕ
	             |	ПаллетаЛистыНабора.Ссылка.Проведен
	             |	И ПаллетаЛистыНабора.Документ.Номер = &НомерРНК
	             |	И ПаллетаЛистыНабора.Документ.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаРНК, ГОД) И КОНЕЦПЕРИОДА(&ДатаРНК, ГОД)
	             |	И ПаллетаЛистыНабора.ЛистНабора.ТипШК <> &Коробка";
	
    Запрос.УстановитьПараметр("НомерРНК",RNK_Number);
	Запрос.УстановитьПараметр("ДатаРНК",ДатаПериодаРНК); 
	запрос.УстановитьПараметр("Коробка", перечисления.ТипыШтрихКодов.Коробка);

	СписокСтрокизПаллет2=запрос.Выполнить().Выгрузить();
	СписокСтрокизПаллет2.Колонки.Добавить("Количество");
	СписокСтрокизПаллет2.Колонки.Добавить("Номенклатура");
	
	Для Каждого Строка из СписокСтрокизПаллет2 Цикл
		
		// весь лист набора это 1 коробка, просто переносим данные из Листа набора целиком в таблицу по этой Паллете.
		ЛНТовары = Строка.ЛистНабора.Товары;
		Для каждого ТекСтрока Из ЛНТовары Цикл
			
			НовСтр = СписокСтрокизПаллет.Добавить();
			НовСтр.Номенклатура = ТекСтрока.Номенклатура;
			НовСтр.SSCCКод = СокрЛП(Строка.SSCCКод)     ;
			НовСтр.ЛистНабора = Строка.ЛистНабора;
			НовСтр.Паллета = Строка.Паллета;
			НовСтр.количество = ТекСТрока.Количество; // тут всегда кол-во штук.
			
		КонецЦикла;
		
	КонецЦикла;
	
	СписокСтрокИзПаллет.Свернуть("Номенклатура, SSCCКод","Количество");
	СписокСтрокИзПаллет.Сортировать("Номенклатура");
	// если есть внутренняя комплектация, то поменяем комплектующие в листах набора на товар.
	ТЗКомпл= новый таблицазначений;
 	тзкомпл.колонки.Добавить("компл");
	тзкомпл.колонки.Добавить("номенк");
	
	// третья часть - комплектующие
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасходнаяНакладнаяКомплектующие.Номенклатура КАК Номенклатура,
	|	РасходнаяНакладнаяКомплектующие.Продукция КАК Продукция
	|ИЗ
	|	Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
	|ГДЕ
	|	РасходнаяНакладнаяКомплектующие.Ссылка.Номер = &НомерРНК
	|	И РасходнаяНакладнаяКомплектующие.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаРНК, ГОД) И КОНЕЦПЕРИОДА(&ДатаРНК, ГОД)";
	
	
	Запрос.УстановитьПараметр("НомерРНК",RNK_Number);
	Запрос.УстановитьПараметр("ДатаРНК",ДатаПериодаРНК); 
	СписокКомплект=запрос.Выполнить().Выгрузить();

	Для каждого текстрока из СписокКомплект цикл
		
		Если Текстрока.номенклатура<> Текстрока.продукция ТОгда
			 Стр = тзкомпл.Добавить();
			 стр.номенк = Текстрока.продукция;
			 стр.компл = Текстрока.номенклатура;
		конецесли;	
 	конеццикла;
	
	Для каждого текстр из СписокСтрокИзПаллет цикл
	
		текном = текстр.номенклатура;
		для каждого текст2 из ТЗКомпл цикл
			 компл = текст2.компл;
			 Если Компл = текном тогда
				 текстр.номенклатура  = текст2.номенк;
			 конецесли;
		конеццикла;	
	конеццикла;
	СписокСтрокИзПаллет.Свернуть("Номенклатура, SSCCКод","Количество");
	СписокСтрокИзПаллет.Сортировать("Номенклатура");
  	
	// типизируем, чтобы можно было запросы по ней делать
	ТЗ2  = Новый ТаблицаЗначений;
	ТЗ2.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ2.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число"));
	ТЗ2.Колонки.Добавить("SSCCКод",Новый ОписаниеТипов("строка"));
	ТЗ2.Колонки.Добавить("Ном2",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));;
	ТЗ2.Очистить();
	Для каждого Текстрока из СписокСтрокИзПаллет цикл
		Нстр = ТЗ2.Добавить();
		Нстр.Номенклатура = Текстрока.Номенклатура;
		Нстр.Количество = Текстрока.Количество;
		Нстр.SSCCКод = Текстрока.SSCCКод;
	КонецЦикла;
	
	//	возврат  тз2;
 //Таб = Запрос.Выполнить().Выгрузить();
 
	Возврат В_JSON(ТЗ2); 
	
КонецФункции

// Нечаева 03,02,26 --- SNL-118