
Процедура ОтправкаОповещенийОбИзмененииПрайсЛиста(ДокументСсылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДокументСсылка.ТипЦен) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипЦен", ДокументСсылка.ТипЦен);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТипыЦенПользователи.Пользователь.ФизЛицо.ЕМэйл КАК ЕМэйл
	|ИЗ
	|	Справочник.ТипыЦен.Пользователи КАК ТипыЦенПользователи
	|ГДЕ
	|	ТипыЦенПользователи.Ссылка = &ТипЦен
	|	И (ВЫРАЗИТЬ(ТипыЦенПользователи.Пользователь.ФизЛицо.ЕМэйл КАК СТРОКА(100))) <> """"";
	
	МассивАдресов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЕМэйл");
	
	Если МассивАдресов.Количество() > 0 Тогда
		
		СписокПолучателей = Новый СписокЗначений;
		Для Каждого Адрес ИЗ МассивАдресов Цикл
			СписокПолучателей.Добавить(Адрес);	
		КонецЦикла;
		
		// Кухарь А.Ю. 21.03.2022 начало
		// 		ТемаПисьма = "Изменен " + Строка(ДокументСсылка);
		//ТекстПисьма = "Изменен " + Строка(ДокументСсылка);
		// Кухарь А.Ю.  28.11.2024 начало
		//ТекстПисьма = "Изменен прайс с типом цен " + ДокументСсылка.ТипЦен;
		//ТемаПисьма = "Изменен прайс с типом цен " + ДокументСсылка.ТипЦен; 
		ТекстПисьма = "Изменен прайс "+Строка(ДокументСсылка)+" с типом цен " + ДокументСсылка.ТипЦен;
		ТемаПисьма = "Изменен прайс "+Строка(ДокументСсылка)+" с типом цен " + ДокументСсылка.ТипЦен; 	
		// Кухарь А.Ю.  28.11.2024 конец
		
		// Кухарь А.Ю. 21.03.2022 конец

		СформироватьВнутреннееУведомление(СписокПолучателей, ТекстПисьма, ТемаПисьма, ДокументСсылка);
		
	КонецЕсли;
	
КонецПроцедуры

Функция СоздатьПерезаписатьПрайсЛист(ДокументПрайс = Неопределено, ТаблицаТоваров, ДополнительныеРеквизиты = Неопределено) Экспорт
	
	НовыйПрайс = ?(ДокументПрайс = Неопределено, Документы.ПрайсЛист.СоздатьДокумент(), ДокументПрайс.ПолучитьОбъект());
	
	НовыйПрайс.Организация = Справочники.Организации.НайтиПоКоду("SS-001");
	НовыйПрайс.ИБ = Справочники.ИБ.НайтиПоКоду("SSP");
	НовыйПрайс.Валюта = Справочники.Валюты.НайтиПоКоду("810");
	НовыйПрайс.Автор = ПараметрыСеанса.Пользователь;
	
	Если ТипЗнч(ДополнительныеРеквизиты) = Тип("Структура") Тогда
		Для Каждого Элемент из ДополнительныеРеквизиты Цикл
			УстановитьРеквизитШапки(НовыйПрайс, Элемент.Ключ, Элемент.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ ДополнительныеРеквизиты.Свойство("Дата") Тогда
		НовыйПрайс.Дата = ТекущаяДата();
	КонецЕсли;
	Если НЕ ДополнительныеРеквизиты.Свойство("Дата2") Тогда
		НовыйПрайс.Дата2 = ТекущаяДата() + 365*24*3600;
	КонецЕсли;
	
	УстановитьНомерДокументаКлиентСервер(НовыйПрайс);
	
	Попытка
		НовыйПрайс.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		НовыйПрайс.Записать(РежимЗаписиДокумента.Запись);
		Если НовыйПрайс.Ссылка = Документы.ПрайсЛист.ПустаяСсылка() Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецПопытки;
	
	Для Каждого СтрокаТЧ ИЗ ТаблицаТоваров Цикл
		
		Запись = РегистрыСведений.ЦеныНоменклатуры.СоздатьМенеджерЗаписи();
		
		Запись.Период = ТекущаяДата();                           
		Запись.ТипЦен = ДополнительныеРеквизиты.ТипЦен;
		
		Запись.Номенклатура = СтрокаТЧ.Номенклатура;
		Запись.Брэнд = СтрокаТЧ.Номенклатура.Родитель;
		Запись.Прайс = НовыйПрайс.Ссылка;
		Запись.Цена = СтрокаТЧ.Цена;
		
		Уровень = СтрокаТЧ.Номенклатура.Уровень();
		Если Уровень = 0 Тогда
			Запись.ТипТовара = СтрокаТЧ.Номенклатура;                                    
		ИначеЕсли Уровень = 1 Тогда
			Запись.ТипТовара = СтрокаТЧ.Номенклатура.Родитель;                                             
			Запись.Брэнд = СтрокаТЧ.Номенклатура;                                           
		ИначеЕсли Уровень = 2 Тогда
			Запись.ТипТовара = СтрокаТЧ.Номенклатура.Родитель.Родитель;
			Запись.Брэнд = СтрокаТЧ.Номенклатура.Родитель;
			Запись.Модель = СтрокаТЧ.Номенклатура;
		ИначеЕсли Уровень = 3 Тогда
			Запись.ТипТовара = СтрокаТЧ.Номенклатура.Родитель.Родитель.Родитель;
			Запись.Брэнд = СтрокаТЧ.Номенклатура.Родитель.Родитель;
			Запись.Модель = СтрокаТЧ.Номенклатура.Родитель;                      
		КонецЕсли;
		
		Запись.Записать();
		
	КонецЦикла;
	
	Возврат НовыйПрайс.Ссылка;
	
КонецФункции