#Область СобытияОбъекта


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) экспорт
	ЗаполнитьШапкуДокумента(ЭтотОбъект, ПараметрыСеанса.Пользователь);
	
	ДокОснование	= ДанныеЗаполнения;
	Если НЕ ЗначениеЗаполнено(ДокОснование) Тогда Возврат КонецЕсли;
	
	Дата = ТекущаяДата();
	
	ТипОснования = ТипЗнч(ДокОснование);
	
	рШапки 			= ПолучитьРеквизитыШапки(ДокОснование, "Организация"); 
	Организация		= рШапки.Организация;
	Подразделение	= ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла();
	
	Если ТипОснования= Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		ИспользоватьМаркированыеКомплектующие = ПолучитьРеквизитШапки(ДокОснование, "Склад.ЭтоСкладМаркированногоТовара");		
		ЗаполнитьТЧПоОснованию();			
	ИначеЕсли ТипОснования= Тип("ДокументСсылка.Комплектация") Тогда
		ЗаполнитьТЧПоОснованию();			
	КонецЕсли;   
	//Валетов + 13,01,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8380 Если организация НЕ ЕЕЭ, меняем на неё
	Если НЕ СокрЛП(Организация.Код) = "SS-001" Тогда
		Организация = Справочники.Организации.НайтиПоКоду("SS-001");
	КонецЕсли;
	//Валетов -	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	СтатусКМ_Факт		= Перечисления.СтатусыКодовМаркировкиФакт.Распечатан;
			
	Для Каждого СтрокаТЧ из ШтрихкодыУпаковок Цикл		
		Движение = Движения.СтатусыКМ_Факт.Добавить();		
		
		Движение.Период				= Дата;
		Движение.ШтрихКодУпаковки	= СтрокаТЧ.ШтрихкодУпаковки;		
		Движение.Местонахождение	= Подразделение;
		
		Движение.Статус				= Перечисления.СтатусыКодовМаркировкиФакт.Распечатан;			
		
		Если Маркировка_ПИ.ТипТекущегоУзла() = Перечисления.ТипУзлаИБ.УправляющееПодразделение И СтрокаТЧ.Нанесен Тогда			
			Движение.Статус			= Перечисления.СтатусыКодовМаркировкиФакт.Нанесен;
		КонецЕсли;
		
		
		// Кухарь А.Ю.  19.01.2025 начало
		// У забронированных под сборку своя логика статусов будет. Пока не знаю какая)
		Если СтрокаТЧ.ЗабронированПодСборку Тогда			
			если не СтрокаТЧ.Распечатан тогда
				Движение.Статус			= Перечисления.СтатусыКодовМаркировкиФакт.Зарезервирован;	 
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	КодыКоробок = ШтрихкодыУпаковок.Выгрузить(,"ШтрихКодКоробки");
	КодыКоробок.Свернуть("ШтрихКодКоробки");
	
	Для Каждого СтрТЧ из КодыКоробок Цикл		
		Если НЕ ЗначениеЗаполнено(СтрТЧ.ШтрихКодКоробки) Тогда Продолжить КонецЕсли;
		
		Движение = Движения.СтатусыКМ_Факт.Добавить();		
		Движение.Период				= Дата;
		Движение.ШтрихКодУпаковки	= СтрТЧ.ШтрихКодКоробки;		
		Движение.Местонахождение	= Подразделение;
		Движение.Статус				= СтатусКМ_Факт;
	КонецЦикла;
	
	ЗаписатьВЛог("Отладка", "Штатная.ОбработкаПроведения", "");
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если ЗначениеЗаполнено(Организация) Тогда
		Префикс = СокрЛП(Организация.Префикс);	
	КонецЕсли; 
	Префикс = Префикс+Маркировка_ПИ.ЭтотУзел_Код("Основной")+"-";
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Автор 					= ПараметрыСеанса.Пользователь;
	Комментарий 			= "";
	СостояниеНакладной 		= Перечисления.СостоянияНакладной.ВРаботе;
	СформированыАгрегации   = Ложь;
	
	Товары.Очистить();
	ШтрихкодыУпаковок.Очистить();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
	
	рПроверки = КонтрольДублейЗСБ();
	Если НЕ рПроверки.Успешно Тогда
		МаркировкаКС.ВывестиОшибки(рПроверки);
		Отказ = Истина;
		Возврат;	
	КонецЕсли; 
	
	Если Модифицированность() Тогда
		КоличествоДокумента 	= Товары.Итог("Количество");
		КоличествоКомплектующих = Комплектующие.Итог("Количество");
		ГруппыТоваров			= ГруппыТоваровДокумента(ЭтотОбъект);
		
		КоличествоШК 			= ШтрихкодыУпаковок.Количество();
	КонецЕсли;
	
	Если ЭтоНовый() Тогда          
		//Валетов + 13,01,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8380 Если организация НЕ ЕЕЭ, меняем на неё
		Если Организация <> Маркировка_ПИ.ОрганизацияЕЕЭ() Тогда
			Организация = Маркировка_ПИ.ОрганизацияЕЕЭ();			
		КонецЕсли;
		//Валетов -
		
		//+++Чирков 10.02.2026
		ДатаСоздания = ТекущаяДата();		
		//---Чирков 10.02.2026
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти 

Функция КонтрольДублейЗСБ()
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Если ЗначениеЗаполнено(ДокОснование) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Ссылка 
		|ИЗ
		|	Документ.ЗаданиеНаСборкуКомплектовЧЗ
		|ГДЕ
		|	ДокОснование = &ДокОснование
		|	И Ссылка <> &Ссылка
		// Кельманов А.В. - MARK-2511 - 2025.07.01 {
		//// Кельманов А.В. - HELP-4816 - 2025.05.06 {
		//|	И Проведен
		//// Кельманов А.В. - HELP-4816 - 2025.05.06 }
		// Кельманов А.В. - MARK-2511 - 2025.07.01 }
		|";
		
		// Кельманов А.В. - MARK-2511 - 2025.07.01 {
		Если ДокОснование.Дата < '20250702' Тогда
			
			Запрос.Текст = Запрос.Текст + "
			|	И Проведен";
			
		КонецЕсли;
		// Кельманов А.В. - MARK-2511 - 2025.07.01 }
		
		Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
		Запрос.УстановитьПараметр("ДокОснование", 	ДокОснование);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Результат.Ошибки.Добавить(СтрШаблон("Уже существует ЗСБ %1 к документу: %2 !", Выборка.Ссылка, ДокОснование));		
		КонецЦикла; 
	КонецЕсли;	
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;
КонецФункции //КонтрольДублейЗСБ()

// Кельманов А.В. - для возможности заполнить ТЧ по нажатию кнопки - 2025.04.01 {
//Функция ЗаполнитьТЧПоОснованию()
Функция ЗаполнитьТЧПоОснованию() Экспорт
// Кельманов А.В. - для возможности заполнить ТЧ по нажатию кнопки - 2025.04.01 }
	Запрос 		 = Новый ("Запрос");
	Запрос.Текст = "
	|ВЫБРАТЬ	
	|	Номенклатура,
	|	Количество КАК Количество,	
	|	Единица, 
	//Валетов + 09,12,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8085
	//|	Коэффициент
	|	1 КАК Коэффициент
	//Валетов -
	|ИЗ
	|	" + ДокОснование.Метаданные().ПолноеИмя() + ".Товары
	|ГДЕ
	|	Ссылка = &Ссылка
	|	И Номенклатура.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)
	|	И ТребуетсяМаркировка
	|	И Количество > 0	
	|;
	|ВЫБРАТЬ
	|	Продукция,
	|	Номенклатура,
	|	Количество КАК Количество,
	|	Единица,
	//Валетов + 09,12,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8085
	//|	Коэффициент
	|	1 КАК Коэффициент
	//Валетов -
	|ИЗ
	|	" + ДокОснование.Метаданные().ПолноеИмя() + ".Комплектующие
	|ГДЕ
	|	Ссылка = &Ссылка	
	|	И Продукция.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)
	|	И ТребуетсяМаркировка
	|	И Количество > 0
	|";		
	
	Запрос.УстановитьПараметр("Ссылка", ДокОснование);
	
	// Кельманов А.В. - HELP-4849 - 2026.04.28 {
	Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.Комплектация") Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТребуетсяМаркировка", "");
		
	КонецЕсли;
	// Кельманов А.В. - HELP-4849 - 2026.04.28 }
	
	рЗапроса = Запрос.ВыполнитьПакет();	
	
	Товары.Очистить();
	Комплектующие.Очистить();	
	
	Товары.Загрузить(рЗапроса[0].Выгрузить());
	Комплектующие.Загрузить(рЗапроса[1].Выгрузить());	
КонецФункции //ЗаполнитьТЧПоОснованию()

Процедура ОбработкаУдаленияПроведения(Отказ)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	Если ШтрихкодыУпаковок.Количество() > 0 Тогда
		Сообщить("Запрещено распроводить документ c заполненной ТЧ 'ШтрихкодыУпаковок' !");
		Отказ = Истина;	
	КонецЕсли;
КонецПроцедуры //ОбработкаУдаленияПроведения(Отказ)