Функция ИспользоватьПродуктовыйКонтурИСМП() Экспорт
	Возврат (Константы.ИспользоватьПродуктовыйКонтурИСМП.Получить() = Истина);
КонецФункции //ИспользоватьПродуктовыйКонтурИСМП
 
Функция ЭтоМаркируемаяПродукция(ТНВЭД) Экспорт
	Результат = Ложь;
	
	Если ТипЗнч(ТНВЭД) = Тип("СправочникСсылка.ТНВЭД") Тогда
		Результат = ЗначениеЗаполнено(ТНВЭД.ДатаНачалаРаботыСМаркировкой);	
	КонецЕсли; 
	
	Возврат Результат;	
КонецФункции //ЭтоМаркируемаяПродукция(ТНВЭД)

Функция Свойство_ЦветЧЗ() Экспорт
	Возврат ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоИмени("ЦветЧЗ", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
КонецФункции //Свойство_ЦветЧЗ()

Функция Свойство_РазмерныйРядЧЗ() Экспорт
	Возврат ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоИмени("РазмерныйРядЧЗ", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
КонецФункции //Свойство_РазмерныйРядЧЗ() 

Функция Свойство_МатериалЧЗ() Экспорт
	Возврат ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоИмени("Материал", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
КонецФункции //Свойство_МатериалЧЗ()

Функция Свойство_ЦелевойПолЧЗ() Экспорт
	Возврат ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоИмени("ЦелевойПол", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
КонецФункции //Свойство_ЦелевойПолЧЗ()

Функция КаталогВнешнихОтчетов(Клиент = Истина) Экспорт
	Каталог = СокрЛП(Константы.КаталогВнешнихОтчетов.Получить());
	
	РП = ПолучитьРазделительПути();
	Если НЕ СтрЗаканчиваетсяНа(Каталог, РП) Тогда
		Каталог = Каталог + РП;	
	КонецЕсли;
	
	Возврат Каталог;
КонецФункции //КаталогВнешнихОтчетов(Клиент = Истина)

Функция ОрганизацияБТК() Экспорт
	
	Возврат Справочники.Организации.НайтиПоКоду("SSP-99");	

КонецФункции //ОоганизацияЕЕЭ()

Функция ОрганизацияЕЕЭ() Экспорт
	
	Возврат Справочники.Организации.НайтиПоКоду("SS-001");	

КонецФункции //ОоганизацияЕЕЭ()

Функция ПолучитьОТ_Булево() Экспорт

	Возврат Новый ОписаниеТипов("Булево");

КонецФункции // ПолучитьОТ_Булево() 

Функция ПолучитьМенеджер(ИмяТаблицы) Экспорт
	Результат  = Неопределено;	
	
	МетаОбъект = Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);	
	Если МетаОбъект = Неопределено Тогда
		ВызватьИсключение "Не найден объект метаданных: " + ИмяТаблицы;	
	Иначе
		Если Метаданные.Документы.Содержит(МетаОбъект) Тогда
			Коллекция = Документы;
		ИначеЕсли Метаданные.Справочники.Содержит(МетаОбъект) Тогда
			Коллекция = Справочники;
		ИначеЕсли Метаданные.ПланыВидовХарактеристик.Содержит(МетаОбъект) Тогда
			Коллекция = ПланыВидовХарактеристик;
		ИначеЕсли Метаданные.РегистрыНакопления.Содержит(МетаОбъект) Тогда
			Коллекция = РегистрыНакопления;
		ИначеЕсли Метаданные.РегистрыСведений.Содержит(МетаОбъект) Тогда
			Коллекция = РегистрыСведений;
		ИначеЕсли Метаданные.РегистрыБухгалтерии.Содержит(МетаОбъект) Тогда
			Коллекция = РегистрыБухгалтерии;
		ИначеЕсли Метаданные.РегистрыРасчета.Содержит(МетаОбъект) Тогда
			Коллекция = РегистрыБухгалтерии;
		ИначеЕсли Метаданные.БизнесПроцессы.Содержит(МетаОбъект) Тогда
			Коллекция = БизнесПроцессы;
		ИначеЕсли Метаданные.Задачи.Содержит(МетаОбъект) Тогда
			Коллекция = Задачи;
		Иначе
			Коллекция = Неопределено;			
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Коллекция) Тогда
			Результат = Коллекция[МетаОбъект.Имя];							
		Иначе
			ВызватьИсключение "Не допустимый класс метаданных " + ИмяТаблицы;
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПолучитьМенеджер(ИмяТаблицы) Экспорт

Функция ФизическоеПодразделениеСклада(Склад) Экспорт
	Результат = Справочники.Подразделения.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(Склад) И ТипЗнч(Склад) = Тип("СправочникСсылка.Склады") Тогда
		Реквизиты =	 ПолучитьРеквизитыШапки(Склад, "Подразделение,КодФизическогоУзла");
		
		Если ЗначениеЗаполнено(Реквизиты.КодФизическогоУзла) Тогда
			УзелСклада = УзелПоКоду(Реквизиты.КодФизическогоУзла, "Основной");					
			Если ЗначениеЗаполнено(УзелСклада) Тогда
				Результат = ПолучитьРеквизитШапки(УзелСклада, "Подразделение");			
			КонецЕсли; 
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(Результат) И ЗначениеЗаполнено(Реквизиты.Подразделение) Тогда
			Результат = Реквизиты.Подразделение; 					
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ФизическоеПодразделениеСклада(Склад) Экспорт 

Функция ИспользоватьУпрБлокировкиСтатусовКМ() Экспорт
	Возврат (Метаданные.РегистрыСведений.СтатусыКМ_Факт.РежимУправленияБлокировкойДанных = Метаданные.СвойстваОбъектов.РежимУправленияБлокировкойДанныхПоУмолчанию.Управляемый);
КонецФункции //ИспользоватьУпрБлокировкиСтатусовКМ() Экспорт

Функция ИспользоватьЗаданияСменыСтатусовНакладной() Экспорт
	
	Возврат Ложь;	

КонецФункции //ИспользоватьЗаданияСменыСтатусовНакладной() Экспорт

Функция ПолучитьДЗРдляМаркировки() Экспорт
	Результат 		= КонецДня(ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования() - 7*27*60*60);	
	ПерсональнаяДЗР	= ПолучитьПолномочиеПользователя("ПерсональнаяДатаЗапретаРедактирования", ПараметрыСеанса.Пользователь);	
	Если ЗначениеЗаполнено(ПерсональнаяДЗР) Тогда
		Результат = Мин(ПерсональнаяДЗР, Результат);		
	КонецЕсли; 
	Возврат КонецДня(Результат);
КонецФункции //ПолучитьДЗРдляМаркировки() Экспорт

Функция ИспользоватьРегистрСтатусовКоробокДляБронирования() Экспорт
	Возврат Ложь;
КонецФункции //ИспользоватьРегистрСтатусовКоробокДляБронирования() Экспорт

Функция ЗаписыватьКаждыйЩелчокСканера() Экспорт 
	Возврат Константы.ЗаписыватьКаждыйЩелчокСканера.Получить();
КонецФункции //ЗаписыватьКаждыйЩелчокСканера()

Функция ПолучитьНазначениеПоШК(ДанныеШК) Экспорт
	Возврат Справочники.НазначенияШК.ПолучитьНазначениеПоШК(ДанныеШК);
КонецФункции //НайтиНазначениеКМ(ДанныеШК) Экспорт

Функция ПараметрыГенерацииШКпоУмолчанию() Экспорт
	
	ПараметрыШтрихкода = Новый Структура;
	
	ПараметрыШтрихкода.Вставить("Ширина", 						150);
	ПараметрыШтрихкода.Вставить("Высота", 						150);
	ПараметрыШтрихкода.Вставить("ТипКода", 						99);
	ПараметрыШтрихкода.Вставить("ОтображатьТекст",				Ложь);
	ПараметрыШтрихкода.Вставить("РазмерШрифта", 				12);
	ПараметрыШтрихкода.Вставить("УголПоворота", 				0);
	ПараметрыШтрихкода.Вставить("Штрихкод",				 		"");
	ПараметрыШтрихкода.Вставить("ПрозрачныйФон", 				Истина);
	ПараметрыШтрихкода.Вставить("УровеньКоррекцииQR",		 	1);
	ПараметрыШтрихкода.Вставить("Масштабировать", 				Ложь);
	ПараметрыШтрихкода.Вставить("СохранятьПропорции", 			Ложь);
	ПараметрыШтрихкода.Вставить("ВертикальноеВыравнивание" , 	1); 
	ПараметрыШтрихкода.Вставить("GS1DatabarКоличествоСтрок", 	2);
	ПараметрыШтрихкода.Вставить("ТипВходныхДанных", 			0);
	ПараметрыШтрихкода.Вставить("УбратьЛишнийФон",	 			Ложь); 
	ПараметрыШтрихкода.Вставить("ЛоготипКартинка");
	ПараметрыШтрихкода.Вставить("ЛоготипРазмерПроцентОтШК");
	
	Возврат ПараметрыШтрихкода;
	
КонецФункции

Функция ДатаОтвалаЧЗ() Экспорт
	Возврат Константы.ДатаОтвалаЧЗ.Получить();	
КонецФункции //ДатаОтвалаЧЗ() Экспорт

Функция ЧЗ_Живой() Экспорт
	Возврат НЕ ЗначениеЗаполнено(ДатаОтвалаЧЗ());
КонецФункции //ЧЗ_Живой() Экспорт

Функция ВыполнятьОнлайнПроверкиКМ() Экспорт
	Возврат Константы.ОнлайнПроверкаКМвЧЗ.Получить();
КонецФункции //ВыполнятьОнлайнПроверкиКМ()

Функция СтатусКМпоРусски(СтатусПоАнглийски) Экспорт
	Результат = СтатусПоАнглийски;
	
	Если ПустаяСтрока(СтатусПоАнглийски) Тогда
		Возврат Результат;	
	КонецЕсли;
	
	Для каждого МетаЗначение Из Метаданные.Перечисления.СтатусыКодовМаркировкиИСМП.ЗначенияПеречисления Цикл
		Если СокрЛП(ВРег(МетаЗначение.Комментарий)) = СокрЛП(ВРег(СтатусПоАнглийски))  Тогда
			Результат = МетаЗначение.Имя;
			Прервать;
		КонецЕсли;	
	КонецЦикла;      
	
	Возврат Результат;	
КонецФункции //СтатусКМпоРусски(СтатусПоАнглийски)

Функция ВремяОжиданияОтветаЧЗ() Экспорт
	Результат = Константы.ВремяОжиданияОтветаЧЗ.Получить();
	Если Результат = 0 Тогда
		Результат = 2;	
	КонецЕсли;
	Возврат Результат;	
КонецФункции //ВремяОжиданияОтветаЧЗ()

Функция ИнтервалПовторногоЗапросаЧЗ() Экспорт
	Результат =  Константы.ИнтервалПовторногоЗапросаЧЗ.Получить();
	Если Результат = 0 Тогда
		Результат = 30*60; //Полчаса по умолчанию	
	КонецЕсли;
	Возврат Результат;
КонецФункции //ИнтервалПовторногоЗапросаЧЗ() Экспорт

Функция ИнтервалМеждуПакетамиПроверки() Экспорт
	Результат =  Константы.ИнтервалМеждуПакетамиПроверки.Получить();
	Если Результат = 0 Тогда
		Результат = 0.2;
	КонецЕсли;
	Возврат Результат;
КонецФункции //ИнтервалПовторногоЗапросаЧЗ() Экспорт

#Область Обмены
//++Данилова Е.В. 04.06.2026 Наряд 0000000256
Функция ПодразделениеПоУзлу(Знач Узел) Экспорт
	
	Результат = Справочники.Подразделения.ПустаяСсылка();

	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Подразделение
	|ИЗ
	|	ПланОбмена.Основной	
	|ГДЕ
	|	ссылка=&Узел
	|УПОРЯДОЧИТЬ ПО 
	|	ПометкаУдаления
	|";

	Запрос.УстановитьПараметр("Узел", Узел);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Подразделение) Тогда
		Результат = Выборка.Подразделение;
	КонецЕсли;

	Возврат Результат;
КонецФункции
//--Данилова Е.В. 04.06.2026 	
Функция КодУзла(Узел) Экспорт	
	Возврат ПолучитьРеквизитШапки(Узел, "Код", "ПланОбмена");
КонецФункции // ()

Функция УзелПоКоду(Код, ИмяПланаОбмена) Экспорт	
	Результат = Неопределено;	
	Если Метаданные.ПланыОбмена.Найти(ИмяПланаОбмена)<>Неопределено Тогда
		Результат = ПланыОбмена[ИмяПланаОбмена].НайтиПокоду(СокрЛП(Код));	
	КонецЕсли; 
	Возврат Результат;
КонецФункции //УзелПоКоду(Код, ИмяПланаОбмена)

Функция ТипТекущегоУзла(Знач ИмяПланаОбмена = "") Экспорт
	Если ПустаяСтрока(ИмяПланаОбмена) Тогда
		ИмяПланаОбмена = ИмяПланаОбменаПоУмолчанию();	
	КонецЕсли;
	
	Возврат ЭтотУзел(ИмяПланаОбмена).ТипУзла;	
КонецФункции //ТипТекущегоУзла(ИмяПланаОбмена = "Основной") Экспорт

Функция ЭтотУзел(Знач ИмяПланаОбмена = "") Экспорт
	Если ПустаяСтрока(ИмяПланаОбмена) Тогда
		ИмяПланаОбмена = ИмяПланаОбменаПоУмолчанию();
	КонецЕсли;
	
	Возврат ПланыОбмена[ИмяПланаОбмена].ЭтотУзел();	
КонецФункции //ЭтотУзел(ИмяПланаОбмена="ОбменСТЦ")

Функция ЭтотУзел_Код(Знач ИмяПланаОбмена = "") Экспорт
	Если ПустаяСтрока(ИмяПланаОбмена) Тогда
		ИмяПланаОбмена = ИмяПланаОбменаПоУмолчанию();	
	КонецЕсли;
	
	Возврат СокрЛП(ПолучитьРеквизитШапки(ПланыОбмена[ИмяПланаОбмена].ЭтотУзел(),"Код","ПланОбмена"));
КонецФункции //ЭтотУзелКод(ИмяПланаОбмена="")

Функция УзелСклада(Склад, Знач ИмяПланаОбмена = "") Экспорт
	Если ПустаяСтрока(ИмяПланаОбмена) Тогда
		ИмяПланаОбмена = ИмяПланаОбменаПоУмолчанию();	
	КонецЕсли;
	
	Возврат ПланыОбмена[ИмяПланаОбмена].НайтиПоКоду(ПолучитьРеквизитШапки(Склад, "КодФизическогоУзла"));

КонецФункции //УзелСклада(Склад, ИмяПланаОбмена = "Основной")

Функция УзелПодразделения(Подразделение, Знач ИмяПланаОбмена = "") Экспорт
	Если ПустаяСтрока(ИмяПланаОбмена) Тогда
		ИмяПланаОбмена = ИмяПланаОбменаПоУмолчанию();	
	КонецЕсли;
	
	Результат = ПланыОбмена[ИмяПланаОбмена].ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ
	|	ПланОбмена."+ИмяПланаОбмена+"
	|ГДЕ
	|	Подразделение = &Подразделение
	|";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
		Результат = Выборка.Ссылка;	
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //УзелПодразделения(Подразделение, Знач ИмяПланаОбмена = "") Экспорт

Функция ИмяПланаОбменаПоУмолчанию()
	Возврат "Основной";
КонецФункции //ИмяПланаОбменаПоУмолчанию()

Функция УправляющийУзел(Знач ИмяПланаОбмена = "") Экспорт
	Если ПустаяСтрока(ИмяПланаОбмена) Тогда
		ИмяПланаОбмена = ИмяПланаОбменаПоУмолчанию();	
	КонецЕсли;
	
	Возврат ЭтотУзел(ИмяПланаОбмена).УправляющийУзел;
КонецФункции //УправляющийУзел(ИмяПланаОбмена = "Основной") Экспорт
 
Функция ПолучитьМассивУзловПоТипу(ТипУзла, Знач ИмяПланаОбмена = "") Экспорт
	Если ПустаяСтрока(ИмяПланаОбмена) Тогда
		ИмяПланаОбмена = "Основной";	
	КонецЕсли;
	
	Запрос = Новый Запрос;	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	ПланОбмена."+ИмяПланаОбмена+"
	|ГДЕ
	|	ТипУзла = &ТипУзла
	|	И НЕ ЭтотУзел
	|	И НЕ ПометкаУдаления
	|";                            
	
	Запрос.УстановитьПараметр("ТипУзла", ТипУзла);	
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции // ()

Функция ЭтоНовыйУзелСвертки() Экспорт
	Возврат (СтрНайти(ЭтотУзел_Код("Свертка"), "new") > 0);
КонецФункции //ЭтоНовыйУзелСвертки() Экспорт

#КонецОбласти                                    


// Кухарь А.Ю.  02.04.2025 начало
Функция ЕстьПредварительноСозданыйАгрегат (Накладная) экспорт
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	МаркировкаТоваровИСМП.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
	|ГДЕ
	|	МаркировкаТоваровИСМП.ШтрихкодыКоробок.ШтрихкодКоробки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|	И МаркировкаТоваровИСМП.Проведен
	|	И МаркировкаТоваровИСМП.ВидОперацииИСМП = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИСМП.Агрегация)
	|	И МаркировкаТоваровИСМП.ДокументОснование = &Накладная
	|	И МаркировкаТоваровИСМП.ШтрихкодыКоробок.ДокументОснование = НЕОПРЕДЕЛЕНО";
	запрос.УстановитьПараметр("Накладная",Накладная);	
	Выборка = запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл
		возврат Истина;
	КонецЦикла;
	
	Возврат ложь;
	
КонецФункции
Функция ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладнойПИ (Знач Накладная) экспорт
	МаркировкаКС.ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладной(Накладная);
КонецФункции
// Кухарь А.Ю.  03.04.2025 конец
