
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	рПроверки = ПроверитьДокументыКОбработке(ПараметрКоманды);
	
	Для Каждого ТекстОшибки Из рПроверки.ОшибкиДокументов Цикл
		Сообщить(ТекстОшибки, СтатусСообщения.Важное);	
	КонецЦикла; 
	
	Для Каждого ДокСсылка Из рПроверки.ДокументыКОбработке Цикл		
		рОбработки = МаркировкаВС.ПолучитьРезультаты_РегистрацияКарточекНоменклатурывНК(ДокСсылка);		
		
		Если рОбработки.Успешно Тогда
			ОбработаноКарточек = рОбработки.Данные.Количество();
			ОтправленоКарточек = ДокСсылка.Товары.Количество();
			Если ОбработаноКарточек = ОтправленоКарточек Тогда			
				
				ТекСтатус = ПолучитьРеквизитШапки(ДокСсылка, "Статус");
				Если ТекСтатус = Перечисления.СтатусыДокументовМаркировки.Обрабатывается Тогда
					//МаркировкаК.УстановитьСтатусДокументаМаркировки(ДокСсылка, Перечисления.СтатусыДокументовМаркировки.Обработан);
				КонецЕсли;
				
				ВывестиСтатусКарточек(рОбработки.Данные);
				
				Если ПолучитьРеквизитШапки(ДокСсылка, "Статус", "Документ") = Перечисления.СтатусыДокументовМаркировки.Обработан Тогда				
					ТекстСообщения = СтрШаблон("Документ: '%1' успешно обработан ЧЗ.", ДокСсылка);	
				Иначе
					ТекстСообщения = СтрШаблон("Документ: '%1' на обработке в ЧЗ.", ДокСсылка);
				КонецЕсли; 				
				Сообщить(ТекстСообщения);
			Иначе
				//ПолучитьСклоненияСтрокиПоЧислу(, ВсегоСтрок, "карточка", "ЧС=Количественное", "ПД=Именительный")[0]);
				Сообщить(СтрШаблон("Обработано %1 из %2 карточек", ОбработаноКарточек, ОтправленоКарточек), СтатусСообщения.Важное);
			КонецЕсли; 			
		Иначе
			Если рОбработки.Ошибки.Количество()>0 Тогда			
				Сообщить(СтрСоединить(рОбработки.Ошибки, Символы.ПС), СтатусСообщения.Важное);
			КонецЕсли; 
			
			Если рОбработки.Сообщения.Количество()>0 Тогда			
				Сообщить(СтрСоединить(рОбработки.Сообщения, Символы.ПС), СтатусСообщения.Информация);
			КонецЕсли;
			
			Если ВРег(рОбработки.Данные) = ВРег("Rejected") ИЛИ рОбработки.Ошибки.Количество()>0 Тогда
				Если рОбработки.Ошибки.Количество()>0 Тогда
					ТекстОшибки = СтрСоединить(рОбработки.Ошибки, Символы.ПС);
				Иначе
					ТекстОшибки = Неопределено;				
				КонецЕсли; 
				МаркировкаК.УстановитьСтатусДокументаМаркировки(ДокСсылка, Перечисления.СтатусыДокументовМаркировки.ОшибкаОбработки, ТекстОшибки);
			КонецЕсли; 
		КонецЕсли;		
	КонецЦикла;	
	
	Если рПроверки.ДокументыКОбработке.Количество() = 0 Тогда
		Сообщить("Не найдено подходящих документов для обработки.", СтатусСообщения.Внимание);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ВывестиСтатусКарточек(тСтатусы)
	Форма = Обработки.ПроверкаКарточекДляНК.ПолучитьФорму(,,1);
	Форма.Открыть();
	Форма.ВывестиСтатусыКарточек(тСтатусы);
КонецФункции //ВывестиСтатусКарточек(тСтатусы)

&НаСервере
Функция ПроверитьДокументыКОбработке(мСсылки)
	Результат = Новый Структура("ОшибкиДокументов,ДокументыКОбработке", Новый Массив, Новый Массив, Новый Массив);
	
	ОбработкаПроверки = Обработки.ПроверкаКарточекДляНК.Создать();
	
	Для Каждого ДокСсылка Из мСсылки Цикл			
		рПроверки = Документы.ЗаявкаНаПередачуКарточекНоменклатурыВЧЗ.ПроверитьДокументПередПолучениемИзЧЗ(ДокСсылка);
		Если рПроверки.Успешно Тогда
			Результат.ДокументыКОбработке.Добавить(ДокСсылка);
		Иначе
			МаркировкаКС.ДобавитьОшибки(Результат.ОшибкиДокументов, рПроверки);				
		КонецЕсли;
	КонецЦикла; 	
	
	Возврат Результат;
КонецФункции //ПроверитьДокументыКОбработке(мСсылки)

 
