
Функция ЗапросPOST(Запрос)
	Попытка
		РезОбработки = ОбработатьЗапрос(Запрос);
	Исключение
		РезОбработки = ОписаниеОшибки();
	КонецПопытки;	
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(РезОбработки);
	
	Возврат Ответ;
КонецФункции

Функция ОбработатьЗапрос(Запрос)
	
	Если Истина Тогда
		Обработка = Обработки.ОбменЧерезHTTPсервис.Создать();		
	Иначе			
		ИмяФайлаОбработки	= СокрЛП(Константы.КаталогВнешнихОтчетов.Получить());
		Если Прав(ИмяФайлаОбработки,1)<>"\" Тогда
			ИмяФайлаОбработки = ИмяФайлаОбработки+"\";			
		КонецЕсли; 
		ИмяФайлаОбработки	= ИмяФайлаОбработки+"ОбменЧерезHTTPсервис.epf";
		
		Обработка = ВнешниеОбработки.Создать(ИмяФайлаОбработки);		
	КонецЕсли;	
	
	Возврат Обработка.ОбработатьЗапрос(Запрос);
КонецФункции //ОбработатьЗапрос(Запрос)


Функция ПолучитьСтруктуру_GET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции
 