
Функция СоздатьОприходованиеТМЦ(ДокСсылка, ТаблицаТоваров = Неопределено, Комментарий = "", ДополнительныеРеквизиты = Неопределено, Проводить = Ложь) Экспорт
	
	ДокОприходование = Документы.ЗаявкаНаРекламацию.СоздатьИзменитьДокумент(ДокСсылка, "ОприходованиеТМЦ");
	
	ЗаполнитьЗначенияСвойств(ДокОприходование, ДокСсылка);
	
	ЗаполнитьШапкуДокумента(ДокОприходование, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Покупка");
	
	ДокОприходование.ДокОснование = ДокСсылка;
	ДокОприходование.КодОперации = Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя;
	ДокОприходование.СостояниеНакладной = Перечисления.СостоянияНакладной.Принята;
	
	УстановитьНомерДокументаКлиентСервер(ДокОприходование);
	
	Если СокрЛП(Комментарий) <> "" Тогда
		ДокОприходование.Комментарий = СокрЛП(Комментарий);
	Иначе
		ДокОприходование.Комментарий = "Создано документом " + Строка(ДокСсылка);
	КонецЕсли;
	
	// Шворобей ВЮ 16.01.2023 ++
	Если ЗначениеЗаполнено(ДокСсылка.ДокОснование) Тогда
		Если ЕстьРеквизитДокумента("Подразделение", ДокСсылка.ДокОснование.Метаданные()) Тогда
			ДокОприходование.Подразделение = ЗначениеРеквизитаОбъекта(ДокСсылка.ДокОснование, "Подразделение");		
		КонецЕсли;
	КонецЕсли;
	// Шворобей ВЮ 16.01.2023 ++
	
	Если ТипЗнч(ДополнительныеРеквизиты) = Тип("Структура") Тогда
		Для Каждого Элемент из ДополнительныеРеквизиты Цикл
			ДокОприходование[Элемент.Ключ] = Элемент.Значение;
		КонецЦикла;
	КонецЕсли;
	
	////////////////// ТОВАРЫ ///////////////////////////////////////////////////////////////////////////////
	
	Если ТаблицаТоваров <> Неопределено Тогда
		
		ДокОприходование.Товары.Очистить();
		
		Для Каждого СтрокаТоваров ИЗ ТаблицаТоваров Цикл
			
			НоваяСтрока = ДокОприходование.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
			
			НоваяСтрока.СтавкаНДС = ПолучитьРеквизитРодителя(НоваяСтрока.Номенклатура,"СтавкаНДС");
			НоваяСтрока.Коэффициент = 1;
			НоваяСтрока.Единица = НоваяСтрока.Номенклатура.ОсновнаяЕдиница;
			НоваяСтрока.Всего = НоваяСтрока.Количество;
			
			/////////////////////////////////////////////////////////////////////////////////////////////////////
			//    НУЖНО БУДЕТ УСТАНОВИТЬ ЦЕНУ
			/////////////////////////////////////////////////////////////////////////////////////////////////////
			
			НоваяСтрока.Цена = Документы.ЗаявкаНаПерепаковку.ПолучитьЦенуИзДокументаОснования(НоваяСтрока.Номенклатура, ДокСсылка);
			НоваяСтрока.ЦенаОприходования = НоваяСтрока.Цена;
			
			ПриИзмененииНоменклатурыТабЧасти(НоваяСтрока, ДокОприходование);
			РассчитатьСуммуТабЧасти(НоваяСтрока, ДокОприходование);
		КонецЦикла;
		
	КонецЕсли;
	
	// Шворобей ВЮ 08.02.2023 ++
	Если Проводить Тогда
		Попытка
			ДокОприходование.Записать(РежимЗаписиДокумента.Проведение);
			СообщитьИзМодуля("" + ДокОприходование);
			Возврат ДокОприходование.Ссылка;
		Исключение
			ДокОприходование.Записать();
			СообщитьИзМодуля("" + ДокОприходование);
			Возврат ДокОприходование.Ссылка;
		КонецПопытки;
	Иначе
		Попытка
			ДокОприходование.Записать();
			СообщитьИзМодуля("" + ДокОприходование);
			Возврат ДокОприходование.Ссылка;
		Исключение
			СообщитьИзМодуля("" + ОписаниеОшибки());
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;
	// Шворобей ВЮ 08.02.2023 ++
	
КонецФункции
