// Кухарь А.Ю.  24.03.2023 начало
//
Функция ПолучитьСоздатьПолныеДанныеЗаданияНабора (ЗНБСсылка,Перезаполнять=ложь) экспорт

	// Кельманов А.В. - Оптимизация работы - 2025.04.16 {
	ЗаказКлиентаFBS = ОбщегоНазначения_ПИ.ПолучитьЗаказКлиентаFBSПоНакладной(ЗНБСсылка.Накладная);
	
	Если ЗаказКлиентаFBS = Неопределено Тогда
		
		Сообщить("Отсутствует документ Заказ клиента FBS.");
		
		Возврат Неопределено;
		
	КонецЕсли;
	// Кельманов А.В. - Оптимизация работы - 2025.04.16 }
	
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ПолныеДанныеЗаданияНабора.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПолныеДанныеЗаданияНабора КАК ПолныеДанныеЗаданияНабора
	|ГДЕ
	|	ПолныеДанныеЗаданияНабора.Проведен
	|	И ПолныеДанныеЗаданияНабора.ДокОснование = &ДокОснование";
	
	запрос.УстановитьПараметр("ДокОснование",ЗНБСсылка);
	результат=запрос.Выполнить().Выбрать();
	ПолныеДанныеЗаданияНабораОбъект=Неопределено;
	пока результат.Следующий() цикл
		ПолныеДанныеЗаданияНабораОбъект=результат.ссылка.получитьобъект();
	КонецЦикла;
	
	
	если ПолныеДанныеЗаданияНабораОбъект = Неопределено тогда
		Перезаполнять=Истина;
		ПолныеДанныеЗаданияНабораОбъект=документы.ПолныеДанныеЗаданияНабора.СоздатьДокумент();
		УстановитьНомерДокументаКлиентСервер(ПолныеДанныеЗаданияНабораОбъект);
		ПолныеДанныеЗаданияНабораОбъект.ДокОснование=ЗНБСсылка;
	КонецЕсли;
	
	если Перезаполнять тогда
		ПолныеДанныеЗаданияНабораОбъект.ОбработкаЗаполнения(ЗНБСсылка,"",ложь);
	КонецЕсли;
	
	
	если ПолныеДанныеЗаданияНабораОбъект.ДокОснование=ЗНБСсылка тогда		
		возврат ПолныеДанныеЗаданияНабораОбъект.Ссылка;
	иначе
		возврат Неопределено;
	КонецЕсли;
	
КонецФункции
// Кухарь А.Ю.  24.03.2023 конец



Функция НайтиЭлементПечатнойФормы()
	Запрос=Новый ("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Ссылка
	|ИЗ	
	|	Справочник.ВнешниеОтчеты
	|ГДЕ
	|	ВидДокумента=""ЗаданиеНабора""
	|	И ВидОбработки=""Печать""
	|	И НЕ ПометкаУдаления 	
	|";
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.ВнешниеОтчеты.ПустаяСсылка();
	КонецЕсли;
КонецФункции //НайтиЭлементПечатнойФормы()

Функция Печать(Ссылка,ДопПараметры=Неопределено) Экспорт	
	ТД=Неопределено;	
	
	ЭлементОбработки	= НайтиЭлементПечатнойФормы();
	
	Если ЭлементОбработки.Пустая() Тогда Возврат ТД КонецЕсли;	
	
	ИмяОбработки=ЭлементОбработки.ИмяФайла;	
	Внешняя=Ложь;
	Если Лев(ИмяОбработки,3)="ВН_" Тогда
		ИмяОбработки=Сред(ИмяОбработки,4);	
		Внешняя=Истина;
	КонецЕсли; 
	
	ОбработкаПечати=Неопределено;
	Если Внешняя Тогда
		ДопКаталог="PrnForms\";
		ИмяФайлаОбработки	=Константы.КаталогВнешнихОтчетов.Получить()+ДопКаталог+ИмяОбработки+".epf";
		ФайлОбработки		=Новый Файл(ИмяФайлаОбработки);
		Если ФайлОбработки.Существует() Тогда
			ОбработкаПечати=ВнешниеОбработки.Создать(ИмяФайлаОбработки);	
		КонецЕсли;
	Иначе
		ОбработкаПечати=Обработки[ИмяОбработки];
	КонецЕсли;	
	
	ФормаПечати=ОбработкаПечати.ПолучитьФорму("ЗаданиеНабора");
	
	Возврат ФормаПечати.Печать(Ссылка,ДопПараметры);
КонецФункции // ()

//Тимофеев 150524
//для Екатеринбурга печать спецификации
Функция ПечатьСПЕЦ(Ссылка,ДопПараметры=Неопределено) Экспорт	
		ОбработкаПечати=Обработки.ПечатьЗаданиеНабора;
		ФормаПечати=ОбработкаПечати.ПолучитьФорму("ЗаданиеНабора");
	
	Возврат ФормаПечати.Печать(Ссылка,ДопПараметры);
КонецФункции // ()
//Тимофеев 150524



Функция СоздатьПеремещениеПодсортировки(ТЗдляПРМ,ФизСклад,ВиртСклад,РеквизитыШапки) Экспорт	
	
	ТЗдляПРМ.Свернуть("Номенклатура","Количество");
	
	НеПринятыеПРМ	= ПолучитьНепринятыеПРМ(ВиртСклад,ФизСклад);	
	
	Подсортировка								= Документы.Перемещение.СоздатьДокумент();
	
	ЗаполнитьЗначенияСвойств(Подсортировка,РеквизитыШапки);
	
	Подсортировка.Склад							= ВиртСклад;
	Подсортировка.СкладПолучатель				= ФизСклад;
	
	Подсортировка.Менеджер						= ПараметрыСеанса.Пользователь.ФизЛицо;
	Подсортировка.Автор							= ПараметрыСеанса.Пользователь;
	Подсортировка.ПунктДоставки					= ПолучитьПунктДоставки(ФизСклад);
	Подсортировка.Комментарий					= РеквизитыШапки.СтрокаКомментария;
	Подсортировка.СостояниеНакладной			= Перечисления.СостоянияНакладной.ВРаботе;
	
	Подсортировка.СостояниеНакладнойУПолучателя	= Перечисления.СостоянияНакладной.ВРаботе;
	Подсортировка.Отгружен						= Перечисления.Отгружен.Резерв;
	Подсортировка.Дата							= РеквизитыШапки.Дата;
	
	УстановитьНомер(Подсортировка);
	
	Для Каждого СтрТзПрм Из ТЗдляПРМ Цикл		
		СтруктураОтбора=Новый Структура;
		СтруктураОтбора.Вставить("Номенклатура",СтрТзПрм.номенклатура);			
		
		СтрокиИзПрм=НеПринятыеПРМ.НайтиСтроки(СтруктураОтбора);
		Если СтрокиИзПрм.Количество()=1 тогда
			СтрокаИзДругогоПРМ=СтрокиИзПрм[0];
			Если СтрокаИзДругогоПРМ.Количество>0 тогда
				СтрТзПрм.Количество=СтрТзПрм.Количество-СтрокаИзДругогоПРМ.Количество;
				Если СтрТзПрм.Количество<=0 Тогда Продолжить КонецЕсли;					
			КонецЕсли;
		КонецЕсли;			
		
		КоличествоВУпаковке=СтрТзПрм.Номенклатура.Родитель.ШтукВКоробке;
		Если КоличествоВУпаковке=0 Тогда
			КолКратноКоробу=СтрТзПрм.Количество;
		Иначе			
			КолКратноКоробу=Цел(СтрТзПрм.Количество/КоличествоВУпаковке)*КоличествоВУпаковке;
			Если КолКратноКоробу<СтрТзПрм.Количество Тогда
				КолКратноКоробу=КолКратноКоробу+КоличествоВУпаковке;
			КонецЕсли;
		КонецЕсли;
		
		СтрТЧ										=Подсортировка.Товары.Добавить();
		
		СтрТЧ.Номенклатура							= СтрТзПрм.Номенклатура;
		СтрТЧ.Заявка								= КолКратноКоробу;
		стртч.ПодтвержденнаяЗаявка					= КолКратноКоробу;
		СтрТЧ.ПодтвержденнаяЗаявкаПеремещения		= КолКратноКоробу;
		СтрТЧ.Количество							= КолКратноКоробу;		
		
		ПриИзмененииНоменклатурыТабЧасти(СтрТЧ, Подсортировка);
		РассчитатьСуммуТабЧасти(СтрТЧ, Подсортировка);		
	КонецЦикла;
	
	Если Подсортировка.Товары.Количество()=0 Тогда Возврат Документы.Перемещение.ПустаяСсылка() КонецЕсли; 
	
	Подсортировка.Записать(РежимЗаписиДокумента.Запись);	
	
	ТО	= ПолучитьОстаткиТМЦ(Подсортировка,Ложь,Подсортировка.Склад);
	Для Каждого СтрокаТЧ Из Подсортировка.Товары Цикл
		СтруктураОтбора=Новый Структура;
		СтруктураОтбора.Вставить("Номенклатура",СтрокаТЧ.Номенклатура);	
		
		СтрокиОстатков=ТО.НайтиСтроки(СтруктураОтбора);
		Если СтрокиОстатков.Количество()>0 тогда			
			СвободныйОстаток=СтрокиОстатков[0].Остаток-СтрокиОстатков[0].Резерв;
		Иначе
			СвободныйОстаток=0;
		КонецЕсли;
		
		Если СтрокаТЧ.Количество>СвободныйОстаток Тогда
			СтрокаТЧ.ПодтвержденнаяЗаявка	= СвободныйОстаток;
			СтрокаТЧ.Количество				= СвободныйОстаток;		
		КонецЕсли;	
	КонецЦикла;	
	
	ТекДата=ТекущаяДата();
	Пока ТекущаяДата()-ТекДата < 1 Цикл КонецЦикла; //Задержка записи - клинит регистр состояний
	
	// Кухарь А.Ю. 29.07.2020 начало
	// 	Подсортировка.СостояниеНакладной	= Перечисления.СостоянияНакладной.ПроверенаПоОстаткам;
	Подсортировка.СостояниеНакладной	= Перечисления.СостоянияНакладной.ОжиданиеНабора;	 
	// Кухарь А.Ю. 29.07.2020 конец
	
	Подсортировка.Записать();	
	
	Возврат Подсортировка.Ссылка;
КонецФункции

Функция ПолучитьНепринятыеПРМ(СкладОтправитель,СкладПолучатель)
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Номенклатура 		КАК Номенклатура,
	|	СУММА(Количество) 	КАК Количество
	|ИЗ
	|	Документ.Перемещение.Товары КАК ПеремещениеТовары
	|ГДЕ	
	|	Ссылка.Дата >= &Дата
	|	И Ссылка.Склад = &Склад
	|	И Ссылка.СкладПолучатель = &СкладПолучатель	
	|	И Ссылка.Отгружен = ЗНАЧЕНИЕ(Перечисление.Отгружен.Резерв)
	|	И Ссылка.Проведен
	|СГРУППИРОВАТЬ ПО 
	|	Номенклатура
	|";
	
	Запрос.УстановитьПараметр("Дата",			ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования());
	
	Запрос.УстановитьПараметр("Склад",			СкладОтправитель);	
	Запрос.УстановитьПараметр("СкладПолучатель",СкладПолучатель);
	
	Возврат	Запрос.Выполнить().Выгрузить();
КонецФункции //ПолучитьНепринятыеПРМ(СкладОтправитель,СкладПолучатель)

Функция ПолучитьПунктДоставки(мСклад)
	Результат=Справочники.ПунктыДоставки.ПустаяСсылка();	
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ
	|	Справочник.ПунктыДоставки
	|ГДЕ
	|	Владелец = &Владелец
	|	И НЕ ПометкаУдаления
	|";
	Запрос.УстановитьПараметр("Владелец",мСклад);	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
		Результат=Выборка.Ссылка;
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ПолучитьПунктДоставки(Склад)

Процедура УстановитьНомер(ДокументОбъект)
	КодИБ=ПараметрыСеанса.ЭтотУзел.Код;		
	ДокументОбъект.УстановитьНовыйНомер(КодИБ+"-");
КонецПроцедуры

Процедура ОбновитьСостоянияСтрокПН(ЗНБ_Ссылка) Экспорт
	Попытка
		
	Исключение
		
	КонецПопытки;	
КонецПроцедуры

Процедура УстановитьСостояниеЗадания(ПланНабора,Знач НомерЧасти=Неопределено,СостояниеНакладной) Экспорт
	Если НомерЧасти=Неопределено Тогда
		Запрос			= Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ НомерЧасти ИЗ Документ.ПланНабора.тБрэндов ГДЕ Ссылка=&ПланНабора");		
		//крохин начало 19.12.2019
		//МассивНомеров	= Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(НомерЧасти);
		Запрос.УстановитьПараметр("ПланНабора",ПланНабора);
		МассивНомеров	= Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерЧасти");
		//крохин конец 19.12.2019
	Иначе
		МассивНомеров	= Новый Массив;
		МассивНомеров.Добавить(НомерЧасти);		
	КонецЕсли; 
	Для Каждого НомерЧасти Из МассивНомеров Цикл
		
		// Кухарь А.Ю. 17.02.2022 начало
		// 		ЗаданиеНабора=НайтиДокумент("ЗаданиеНабора",Новый Структура("ДокументОснование,НомерЧасти",ПланНабора,НомерЧасти));
		ЗаданиеНабора=НайтиДокумент("ЗаданиеНабора",Новый Структура("ДокументОснование,НомерЧасти,Проведен",ПланНабора,НомерЧасти,Истина));
		
		// Кухарь А.Ю. 17.02.2022 конец
		
		Если ЗначениеЗаполнено(ЗаданиеНабора) Тогда					
			// Кухарь А.Ю. 11.11.2020 начало
			// В привелегированном режиме не выводится трассировка.
			//	УстановитьРеквизитыОбъекта(ЗаданиеНабора,Новый Структура("СостояниеНакладной",СостояниеНакладной));
			УстановитьРеквизитыОбъектаЛокальная(ЗаданиеНабора,Новый Структура("СостояниеНакладной",СостояниеНакладной));		 
			// Кухарь А.Ю. 11.11.2020 конец
		КонецЕсли;	
	КонецЦикла; 	
КонецПроцедуры


// Кухарь А.Ю. 11.11.2020 начало
// В привелегированном режиме не выводится трассировка.
Процедура УстановитьРеквизитыОбъектаЛокальная(СсылкаНаОбъект,Реквизиты,РежимЗаписи=Неопределено,РежимЗагрузки=Ложь,НеПроверятьДЗР=Ложь) Экспорт
	Если РежимЗаписи=Неопределено Тогда
		РежимЗаписи=РежимЗаписиДокумента.Запись;	
	КонецЕсли;
	
	Объект=СсылкаНаОбъект.ПолучитьОбъект();	
	
	Если Объект=Неопределено Тогда Возврат КонецЕсли; 
	
	Попытка
		Объект.мЗаписьБезКонтроля=Истина;		
	Исключение	
	КонецПопытки;
	Если НеПроверятьДЗР Тогда
		Объект.ДополнительныеСвойства.Вставить("НеПроверятьДЗР",Истина);		
	КонецЕсли; 
	
	Если РежимЗагрузки Тогда
		Объект.ОбменДанными.Загрузка=Истина;	
	КонецЕсли; 
	
	Для Каждого Элемент Из Реквизиты Цикл
		Если Объект[Элемент.Ключ]<>Элемент.Значение Тогда
			Объект[Элемент.Ключ]=Элемент.Значение;			
		КонецЕсли;		
	КонецЦикла; 
	
	Если Объект.Модифицированность() Тогда
		Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(СсылкаНаОбъект)) Тогда
			Объект.Записать(РежимЗаписи);
		Иначе
			Объект.Записать();		
		КонецЕсли;		
	КонецЕсли;	
КонецПроцедуры 
// Кухарь А.Ю. 11.11.2020 конец

// Кухарь А.Ю. 06.04.2020 начало
// Блокируем при отработке коррекции по товарам
Процедура УстановитьСостояниеБлокировки (ЗНБ_Ссылка,СостояниеНакладной)    экспорт
	если ложь тогда ЗНБ_Ссылка=документы.ЗаданиеНабора.ПустаяСсылка();КонецЕсли;
	если ЗНБ_Ссылка.СостояниеНакладной=СостояниеНакладной тогда
		СообщитьИзМодуля("ЗНБ уже переведены в состояние "+строка(СостояниеНакладной));
		Возврат;
	КонецЕсли;
	СтрТЧ=ЗНБ_Ссылка.ПланируемыеСостояния.Найти(ЗНБ_Ссылка.СостояниеНакладной);
	если СтрТЧ=Неопределено тогда
		СообщитьИзМодуля("В планируемых состояниях не найдено текущего состояния");
		возврат;
	КонецЕсли;
	Индекс=ЗНБ_Ссылка.ПланируемыеСостояния.Индекс(СтрТЧ);
	
	ЗНБ_Объект=ЗНБ_Ссылка.ПолучитьОбъект();
	СтрТЧ=ЗНБ_Объект.ПланируемыеСостояния.Вставить(Индекс+1); //Вставляем строчку так, чтобы была возможность понять какая была предыдущая
	СтрТЧ.Состояние=СостояниеНакладной;
	СтрТЧ.Пропустить=Истина;  //Пропустить мы ставим, чтобы после отката на предыдущее состояние, проскочить состояние блокировки
	ЗНБ_Объект.СостояниеНакладной=СостояниеНакладной;
	ЗНБ_Объект.Записать(РежимЗаписиДокумента.запись);
	
	
КонецПроцедуры

// Кухарь А.Ю. 02.11.2021 начало
// Процедура ВернутьПредыдущееСостояние (ЗНБ_Ссылка) экспорт
Процедура ВернутьПредыдущееСостояние (ЗНБ_Ссылка,ОтборПоТекущемуСостоянию=Неопределено) экспорт	 
	// Кухарь А.Ю. 02.11.2021 конец
	
	если ложь тогда ЗНБ_Ссылка=документы.ЗаданиеНабора.ПустаяСсылка();КонецЕсли;
	ТекущееСостояние=ЗНБ_Ссылка.СостояниеНакладной;
	// Кухарь А.Ю. 02.11.2021 начало
	// На случай если руками уже что-то изменили. Т
	если ОтборПоТекущемуСостоянию<>Неопределено и ТекущееСостояние<>ОтборПоТекущемуСостоянию тогда
		Возврат;
	КонецЕсли;
	// Кухарь А.Ю. 02.11.2021 конец
	
	МассСтрокЗНБ=ЗНБ_Ссылка.ПланируемыеСостояния.НайтиСтроки(Новый Структура("Состояние",ТекущееСостояние));
	Индекс=0;
	Для каждого СтрМасс из МассСтрокЗНБ цикл  //Блокировок могло быть несколько ищем последнюю строку
		Индекс=ЗНБ_Ссылка.ПланируемыеСостояния.Индекс(СтрМасс);
	КонецЦикла;
	если Индекс=0 тогда //Либо это 1 строка либо строк нет.
		СообщитьИзМодуля("Не найдено предыдущее состояние");
		Возврат;
	КонецЕсли;
	
	ЗНБ_Объект=ЗНБ_Ссылка.ПолучитьОбъект();
	// Кухарь А.Ю. 02.11.2021 начало
	//Иногда строчки нужно пропускать
	// НовоеСостояние=ЗНБ_Объект.ПланируемыеСостояния.Получить(Индекс-1).Состояние;//Состояние из предыдущей строчки
	МожноЗаписывать=ложь;
	пока Индекс>1 цикл
		Индекс=Индекс-1;
		ПредыдущаяСтрочка=ЗНБ_Объект.ПланируемыеСостояния.Получить(Индекс);
		если ПредыдущаяСтрочка.Пропустить тогда
			Продолжить;
		КонецЕсли;
		НовоеСостояние=ПредыдущаяСтрочка.Состояние;
		если НовоеСостояние=ТекущееСостояние тогда
			Продолжить;
		КонецЕсли;	
		МожноЗаписывать=Истина;
		Прервать;
	КонецЦикла;
	Если не МожноЗаписывать тогда Возврат;КонецЕсли;
	// Кухарь А.Ю. 02.11.2021 конец
	
	
	ЗНБ_Объект.СостояниеНакладной=НовоеСостояние;
	
	// Кельманов А.В. - HELP-9213 - 2026.03.19 {
	//ЗНБ_Объект.Записать(РежимЗаписиДокумента.запись);
	Если ЗНБ_Объект.Проведен Тогда
		ЗНБ_Объект.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		ЗНБ_Объект.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	// Кельманов А.В. - HELP-9213 - 2026.03.19 }
	
КонецПроцедуры
// Кухарь А.Ю. 06.04.2020 конец

// Кельманов А.В. - ASU-1695 - 2025.01.22
Функция ПроверитьСтатусыКодовЧЗВЛН(ЗНБ, ТекстОшибки = "", МассивОбъектовСОшибками = Неопределено) Экспорт
    ДанныеЗамера = ОценкаПроизводительностиКлиентСервер.НачатьЗамерФункции("Документ.ЗаданиеНабора.ПроверитьСтатусыКодовЧЗВЛН", Новый Структура("Ссылка", ЗНБ));	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛистНабора.Ссылка КАК ЛН,
	               |	ЛистНабора_ШК.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	               |	ЛистНабора_ШК.ШтрихкодУпаковки.СпособВводаВОборот КАК СпособВводаВОборот,
	               |	ЛистНабора_ШК.ШтрихкодУпаковки.ТипШК КАК ТипШК
	               |ПОМЕСТИТЬ ВТ_КодыЧЗ
	               |ИЗ
	               |	Документ.ЛистНабора КАК ЛистНабора
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ЗаданияНабора КАК ЛистНабора_ЗНБ
	               |		ПО ЛистНабора.Ссылка = ЛистНабора_ЗНБ.Ссылка
	               |			И (ЛистНабора_ЗНБ.ЗаданиеНабора = &ЗНБ)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабора_ШК
	               |		ПО ЛистНабора.Ссылка = ЛистНабора_ШК.Ссылка
	               |ГДЕ
	               |	ЛистНабора.Проведен
	               |	И ЛистНабора.Дата >= &Дата
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ШтрихкодУпаковки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_КодыЧЗ.ЛН КАК ЛН,
	               |	ВТ_КодыЧЗ.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	               |	ВТ_КодыЧЗ.СпособВводаВОборот КАК СпособВводаВОборот,
	               |	ЕСТЬNULL(СтатусыКМ_ФактСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.ПустаяСсылка)) КАК Статус
	               |ИЗ
	               |	ВТ_КодыЧЗ КАК ВТ_КодыЧЗ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыКМ_Факт.СрезПоследних КАК СтатусыКМ_ФактСрезПоследних
	               |		ПО ВТ_КодыЧЗ.ШтрихкодУпаковки = СтатусыКМ_ФактСрезПоследних.ШтрихКодУпаковки
	               |ГДЕ
	               |	НЕ ВЫБОР
	               |				КОГДА ВТ_КодыЧЗ.СпособВводаВОборот В (ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.Импорт), ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.ПокупкаВРФ), ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.Производство))
	               |					ТОГДА ЕСТЬNULL(СтатусыКМ_ФактСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.ПустаяСсылка)) В (ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.ВОбороте), ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.Расформирован))
	               |							ИЛИ ЕСТЬNULL(СтатусыКМ_ФактСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.Списан)
	               |								И ВТ_КодыЧЗ.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
	               |				КОГДА ВТ_КодыЧЗ.СпособВводаВОборот В (ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.МаркировкаОстатков), ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.Перемаркировка))
	               |					ТОГДА ЕСТЬNULL(СтатусыКМ_ФактСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.ПустаяСсылка)) В (ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.ВОбороте), ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.Нанесен), ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.Расформирован), ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.Распечатан))
	               |							ИЛИ ЕСТЬNULL(СтатусыКМ_ФактСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.Списан)
	               |								И ВТ_КодыЧЗ.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
	               |			КОНЕЦ
	               |	И НЕ(ЕСТЬNULL(СтатусыКМ_ФактСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.Вложен)
	               |				И ВТ_КодыЧЗ.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	               |				И &ОтгрузкаКомплектов)";
	
	Запрос.УстановитьПараметр("Дата", ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования() - 30 * 24 * 3600);
	Запрос.УстановитьПараметр("ЗНБ", ЗНБ);
	
	// Кельманов А.В. - Для накладных FBS со спайками статус Вложен - 2025.02.27 {
	ПолныеДанные = Документы.ПолныеДанныеЗаданияНабора.ПолучитьДокументПоЗНБ(ЗНБ);
	
	Если ЗначениеЗаполнено(ПолныеДанные) Тогда
		
		Запрос.УстановитьПараметр("ОтгрузкаКомплектов", ПолныеДанные.ОтгрузкаКомплектов);
		
	Иначе
		
		Запрос.УстановитьПараметр("ОтгрузкаКомплектов", Ложь);
		
	КонецЕсли;
	// Кельманов А.В. - Для накладных FBS со спайками статус Вложен - 2025.02.27 }
	
	Результат = Запрос.Выполнить();
	
	ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерФункции(ДанныеЗамера);
	
	Если Результат.Пустой() Тогда
		
		Возврат Истина;
		
	Иначе
		
		Если МассивОбъектовСОшибками = Неопределено Тогда
			
			МассивОбъектовСОшибками = Новый Массив;
			
		КонецЕсли;
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ТекстОшибки = ТекстОшибки + "Код: " + Выборка.ШтрихкодУпаковки + "; Статус: " + Выборка.Статус + Символы.ПС;
			
			НайденныйЛН = МассивОбъектовСОшибками.Найти(Выборка.ЛН);
			
			Если НайденныйЛН = Неопределено Тогда
				
				МассивОбъектовСОшибками.Добавить(Выборка.ЛН);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

// Кельманов А.В. - ASU-1695 - 2025.01.22
Функция ПроверитьДублиКодовЧЗВЛН_СУчетомВложенных(ЗНБ, ТекстОшибки = "", МассивОбъектовСОшибками = Неопределено) Экспорт
    ДанныеЗамера = ОценкаПроизводительностиКлиентСервер.НачатьЗамерФункции("Документ.ЗаданиеНабора.ПроверитьДублиКодовЧЗВЛН_СУчетомВложенных", Новый Структура("Ссылка", ЗНБ));	
	
	Запрос = Новый Запрос;
	
	//++Ратманов 01.07.2025 
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ЛистНабора.Ссылка КАК ЛН
	//               |ПОМЕСТИТЬ ВТ_ЛН
	//               |ИЗ
	//               |	Документ.ЛистНабора КАК ЛистНабора
	//               |ГДЕ
	//               |	ЛистНабора.Проведен
	//               |	И ЛистНабора.Дата >= &Дата
	//               |	И ЛистНабора.ЗаданияНабора.ЗаданиеНабора = &ЗНБ
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ВТ_ЛН.ЛН КАК ЛН,
	//               |	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	//               |ПОМЕСТИТЬ ВТ_КодыЧЗ
	//               |ИЗ
	//               |	ВТ_ЛН КАК ВТ_ЛН
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	//               |		ПО ВТ_ЛН.ЛН = ЛистНабораШтрихкодыУпаковок.Ссылка
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод КАК Штрихкод
	//               |ПОМЕСТИТЬ ВТ_ВложенныеПервыйУровень
	//               |ИЗ
	//               |	ВТ_КодыЧЗ КАК ВТ_КодыЧЗ
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//               |		ПО ВТ_КодыЧЗ.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод КАК Штрихкод
	//               |ПОМЕСТИТЬ ВТ_ВложенныеВторойУровень
	//               |ИЗ
	//               |	ВТ_ВложенныеПервыйУровень КАК ВТ_ВложенныеПервыйУровень
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//               |		ПО ВТ_ВложенныеПервыйУровень.Штрихкод = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод КАК Штрихкод
	//               |ПОМЕСТИТЬ ВТ_ВложенныеТретийУровень
	//               |ИЗ
	//               |	ВТ_ВложенныеВторойУровень КАК ВТ_ВложенныеВторойУровень
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//               |		ПО ВТ_ВложенныеВторойУровень.Штрихкод = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ВТ_ВложенныеПервыйУровень.Штрихкод КАК Штрихкод
	//               |ПОМЕСТИТЬ ВТ_Вложенные
	//               |ИЗ
	//               |	ВТ_ВложенныеПервыйУровень КАК ВТ_ВложенныеПервыйУровень
	//               |
	//               |ОБЪЕДИНИТЬ ВСЕ
	//               |
	//               |ВЫБРАТЬ
	//               |	ВТ_ВложенныеВторойУровень.Штрихкод
	//               |ИЗ
	//               |	ВТ_ВложенныеВторойУровень КАК ВТ_ВложенныеВторойУровень
	//               |
	//               |ОБЪЕДИНИТЬ ВСЕ
	//               |
	//               |ВЫБРАТЬ
	//               |	ВТ_ВложенныеТретийУровень.Штрихкод
	//               |ИЗ
	//               |	ВТ_ВложенныеТретийУровень КАК ВТ_ВложенныеТретийУровень
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ВТ_КодыЧЗ.ЛН КАК ЛН,
	//               |	ВТ_КодыЧЗ.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	//               |ИЗ
	//               |	ВТ_КодыЧЗ КАК ВТ_КодыЧЗ
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Вложенные КАК ВТ_Вложенные
	//               |		ПО ВТ_КодыЧЗ.ШтрихкодУпаковки = ВТ_Вложенные.Штрихкод";
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛН.Ссылка КАК ЛН
	               |ПОМЕСТИТЬ ВТ_ЛН
	               |ИЗ
	               |	Документ.ЛистНабора КАК ЛН
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ЗаданияНабора КАК ЛН_ЗН
	               |		ПО ЛН.Ссылка = ЛН_ЗН.Ссылка
	               |			И (ЛН_ЗН.ЗаданиеНабора = &ЗНБ)
	               |ГДЕ
	               |	ЛН.Проведен
	               |	И ЛН.Дата >= &Дата
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ЛН
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Данные.ШтрихКодУпаковки КАК ШтрихКодУпаковки
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ЛН_ШК.ШтрихкодУпаковки КАК ШтрихКодУпаковки
	               |	ИЗ
	               |		Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛН_ШК
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЛН КАК ВТ_ЛН
	               |			ПО (ВТ_ЛН.ЛН = ЛН_ШК.Ссылка)
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВложенныеШК_1.Штрихкод
	               |	ИЗ
	               |		Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛН_ШК
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЛН КАК ВТ_ЛН
	               |			ПО (ВТ_ЛН.ЛН = ЛН_ШК.Ссылка)
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_1
	               |			ПО ЛН_ШК.ШтрихкодУпаковки = ВложенныеШК_1.Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВложенныеШК_2.Штрихкод
	               |	ИЗ
	               |		Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛН_ШК
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЛН КАК ВТ_ЛН
	               |			ПО (ВТ_ЛН.ЛН = ЛН_ШК.Ссылка)
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_1
	               |			ПО ЛН_ШК.ШтрихкодУпаковки = ВложенныеШК_1.Ссылка
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_2
	               |			ПО (ВложенныеШК_1.Штрихкод = ВложенныеШК_2.Ссылка)
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВложенныеШК_3.Штрихкод
	               |	ИЗ
	               |		Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛН_ШК
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЛН КАК ВТ_ЛН
	               |			ПО (ВТ_ЛН.ЛН = ЛН_ШК.Ссылка)
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_1
	               |			ПО ЛН_ШК.ШтрихкодУпаковки = ВложенныеШК_1.Ссылка
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_2
	               |			ПО (ВложенныеШК_1.Штрихкод = ВложенныеШК_2.Ссылка)
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_3
	               |			ПО (ВложенныеШК_2.Штрихкод = ВложенныеШК_3.Ссылка)
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВложенныеШК_4.Штрихкод
	               |	ИЗ
	               |		Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛН_ШК
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЛН КАК ВТ_ЛН
	               |			ПО (ВТ_ЛН.ЛН = ЛН_ШК.Ссылка)
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_1
	               |			ПО ЛН_ШК.ШтрихкодУпаковки = ВложенныеШК_1.Ссылка
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_2
	               |			ПО (ВложенныеШК_1.Штрихкод = ВложенныеШК_2.Ссылка)
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_3
	               |			ПО (ВложенныеШК_2.Штрихкод = ВложенныеШК_3.Ссылка)
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_4
	               |			ПО (ВложенныеШК_3.Штрихкод = ВложенныеШК_4.Ссылка)
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВложенныеШК_5.Штрихкод
	               |	ИЗ
	               |		Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛН_ШК
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЛН КАК ВТ_ЛН
	               |			ПО (ВТ_ЛН.ЛН = ЛН_ШК.Ссылка)
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_1
	               |			ПО ЛН_ШК.ШтрихкодУпаковки = ВложенныеШК_1.Ссылка
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_2
	               |			ПО (ВложенныеШК_1.Штрихкод = ВложенныеШК_2.Ссылка)
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_3
	               |			ПО (ВложенныеШК_2.Штрихкод = ВложенныеШК_3.Ссылка)
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_4
	               |			ПО (ВложенныеШК_3.Штрихкод = ВложенныеШК_4.Ссылка)
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_5
	               |			ПО (ВложенныеШК_4.Штрихкод = ВложенныеШК_5.Ссылка)) КАК Данные
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Данные.ШтрихКодУпаковки
	               |
	               |ИМЕЮЩИЕ
	               |	КОЛИЧЕСТВО(*) > 1";   
	//--Ратманов
	
	Запрос.УстановитьПараметр("Дата", ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования() - 30 * 24 * 3600);
	Запрос.УстановитьПараметр("ЗНБ", ЗНБ);	
	
	Результат = Запрос.Выполнить();
	
	ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерФункции(ДанныеЗамера);  
	
	Если Результат.Пустой() Тогда
		
		Возврат Истина;
		
	Иначе
		
		Если МассивОбъектовСОшибками = Неопределено Тогда
			
			МассивОбъектовСОшибками = Новый Массив;
			
		КонецЕсли;
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ТекстОшибки = ТекстОшибки + "Был ошибочно отсканирован вложенный код ЧЗ: " + Выборка.ШтрихкодУпаковки + Символы.ПС;
			
			НайденныйЛН = МассивОбъектовСОшибками.Найти(Выборка.ЛН);
			
			Если НайденныйЛН = Неопределено Тогда
				
				МассивОбъектовСОшибками.Добавить(Выборка.ЛН);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

// Кельманов А.В. - ASU-1695 - 2025.01.22
Функция КонтрольКорректностиСканированияЧЗВЛЗ_ПоВсемЛН(ЗНБ, ТекстОшибки = "", МассивОбъектовСОшибками = Неопределено) Экспорт
    ДанныеЗамера = ОценкаПроизводительностиКлиентСервер.НачатьЗамерФункции("Документ.ЗаданиеНабора.КонтрольКорректностиСканированияЧЗВЛЗ_ПоВсемЛН", Новый Структура("Ссылка", ЗНБ));	
	
	РезультатПроверкиУспех = Истина;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛистНабора.Ссылка КАК ЛН
	               |ИЗ
	               |	Документ.ЛистНабора КАК ЛистНабора
	               |ГДЕ
	               |	ЛистНабора.Проведен
	               |	И ЛистНабора.Дата >= &Дата
	               |	И ЛистНабора.ЗаданияНабора.ЗаданиеНабора = &ЗНБ";
	
	Запрос.УстановитьПараметр("Дата", ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования() - 30 * 24 * 3600);
	Запрос.УстановитьПараметр("ЗНБ", ЗНБ);	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЛН = Выборка.ЛН;
		
		ШтрихкодыУпаковок = ЛН.ШтрихкодыУпаковок;
		
		Если ШтрихкодыУпаковок.Количество() > 0 Тогда
			
			ЛН_Объект = ЛН.ПолучитьОбъект();
			
			РезультатПРоверки = ЛН_Объект.КонтрольКорректностиСканированияЧЗВЛЗ();
			
			Если Не РезультатПроверки.Успех Тогда
				
				Если МассивОбъектовСОшибками = Неопределено Тогда
					
					МассивОбъектовСОшибками = Новый Массив;
					
				КонецЕсли;
				
				НайденныйЛН = МассивОбъектовСОшибками.Найти(Выборка.ЛН);
				
				Если НайденныйЛН = Неопределено Тогда
					
					МассивОбъектовСОшибками.Добавить(Выборка.ЛН);
					
				КонецЕсли;
				
				РезультатПроверкиУспех = Ложь;
				
				ТекстОшибки = ТекстОшибки + РезультатПРоверки.Ошибки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерФункции(ДанныеЗамера);  

	Возврат РезультатПроверкиУспех;
	
КонецФункции

// Кухарь А.Ю.  06.08.2022 начало
// Процедура ОбработатьОкончаниеЗагрузкиЛНизТСД (ЗНБ,Ошибки="") экспорт

// Кельманов А.В. - HELP-9378 - 2026.04.07 {
//Процедура ОбработатьОкончаниеЗагрузкиЛНизТСД (ЗНБ,Ошибки="",Оповещения="") экспорт
Процедура ОбработатьОкончаниеЗагрузкиЛНизТСД(ЗНБ, Ошибки = "", Оповещения = "", Наборщик = Неопределено) Экспорт
// Кельманов А.В. - HELP-9378 - 2026.04.07 }
	
	если ложь тогда ЗНБ=Документы.ЗаданиеНабора.ПустаяСсылка();КонецЕсли;
	если ЗНБ=Неопределено тогда возврат;КонецЕсли;
	
    ДанныеЗамера = ОценкаПроизводительностиКлиентСервер.НачатьЗамерФункции("Документ.ЗаданиеНабора.ОбработатьОкончаниеЗагрузкиЛНизТСД", Новый Структура("Ссылка", ЗНБ));	
	
	Запрос=новый запрос;
	запрос.УстановитьПараметр("Дата",ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования()-30*24*3600);
	запрос.УстановитьПараметр("ЗНБ",ЗНБ);	
	запрос.УстановитьПараметр("ДО",Перечисления.СостоянияНакладной.ДопОбработка);	
	
	запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаданиеНабора.Ссылка КАК ЗНБ,
	|	ЗаданиеНабора.ДокументОснование КАК ПланНабора,
	|	ЗаданиеНабора.Накладная КАК Накладная,
	|	ЗаданиеНабора.СостояниеНакладной КАК СостояниеЗНБ,
	|	ЗаданиеНабора.НомерЧасти КАК НомерЧасти,
	|	ЗаданиеНабора.ПроходнаяНакладная КАК ПроходнаяНакладная,
	|	ЗаданиеНабора.Сектор.Здание КАК Здание,
	|	ВЫБОР
	|		КОГДА ЗаданиеНабораПланируемыеСостояния.Состояние ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТребуетсяДО,
	|	ЗаданиеНабора.СозданоОбработкойПополнения КАК СозданоОбработкойПополнения,
	|	ЗаданиеНабора.ПоследовательныйНабор КАК ПоследовательныйНабор
	|ИЗ
	|	Документ.ЗаданиеНабора КАК ЗаданиеНабора
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНабора.ПланируемыеСостояния КАК ЗаданиеНабораПланируемыеСостояния
	|		ПО (ЗаданиеНабораПланируемыеСостояния.Ссылка = ЗаданиеНабора.Ссылка)
	|			И (ЗаданиеНабораПланируемыеСостояния.Состояние = &ДО)
	|ГДЕ
	|	ЗаданиеНабора.Ссылка = &ЗНБ";
	ДанныеШапка=запрос.Выполнить().выгрузить().Получить(0);
	
	
	// Кухарь А.Ю.  06.08.2022 начало
	ТипНакладной=ДанныеШапка.Накладная.метаданные().имя;
	МассивНомеровПереклейки=новый Массив;
	НужнаПереклейка=ложь;
	НужноЗаполнитьШКМатрицы=ложь;
	
	если ТипНакладной = "РасходнаяНакладная" тогда
		
		
		ЧастьНоменклатурыПоМатрице=ложь;
		запрос.Текст="ВЫБРАТЬ
		|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита как ЧастьНоменклатурыПоМатрице
		|ИЗ
		|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
		|ГДЕ
		|	РеквизитыРНКПНКПРМ.Документ = &Документ
		|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = ""ЧастьНоменклатурыПоМатрице"""; 
		запрос.УстановитьПараметр("Документ",ДанныеШапка.Накладная);
		результат=запрос.Выполнить().выбрать();
		пока результат.Следующий() цикл
			если результат.ЧастьНоменклатурыПоМатрице=истина тогда
				ЧастьНоменклатурыПоМатрице=истина;
			КонецЕсли;
		КонецЦикла;
		
		
		запрос.Текст="ВЫБРАТЬ
		|	РасходнаяНакладная.ОтгрузкаКомплектов КАК ОтгрузкаКомплектов,
		|	РасходнаяНакладная.Контрагент.ИспользоватьНоменклатурнуюМатрицу КАК ИспользоватьНоменклатурнуюМатрицу,
		|	РасходнаяНакладная.Контрагент.КонтрольШКпоМатрице КАК КонтрагентКонтрольШКпоМатрице
		
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.Ссылка = &Накладная";
		запрос.УстановитьПараметр("Накладная",ДанныеШапка.Накладная);
		ДанныеНакладной=запрос.Выполнить().выгрузить().Получить(0);
		если ДанныеНакладной.ОтгрузкаКомплектов или
			ДанныеНакладной.ИспользоватьНоменклатурнуюМатрицу или
			ЧастьНоменклатурыПоМатрице или
			ДанныеНакладной.КонтрагентКонтрольШКпоМатрице тогда
			
			если ОбщегоНазначения_ПИ.ПолучитьДопПараметрыНакладной(ДанныеШапка.Накладная)["ЗаполнятьПереклейку"] тогда
				НужнаПереклейка=Истина;
			КонецЕсли;			
			
			если ДанныеНакладной.ИспользоватьНоменклатурнуюМатрицу или 
				ЧастьНоменклатурыПоМатрице или
				ДанныеНакладной.КонтрагентКонтрольШКпоМатрице тогда
				НужноЗаполнитьШКМатрицы=Истина;
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;

	Запрос.Текст=  "ВЫБРАТЬ
	               |	ЛистНабора.Ссылка КАК Ссылка,
	               |	ЛистНабора.Дата КАК Дата,
	               |	ЛистНабора.ОкончаниеСканирования КАК ОкончаниеСканирования
	               |ИЗ
	               |	Документ.ЛистНабора КАК ЛистНабора
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ЗаданияНабора КАК ЛистНабора_ЗаданияНабора
	               |		ПО ЛистНабора.Ссылка = ЛистНабора_ЗаданияНабора.Ссылка
	               |ГДЕ
	               |	ЛистНабора.Проведен
	               |	И ЛистНабора.Дата >= &Дата
	               |	И ЛистНабора_ЗаданияНабора.ЗаданиеНабора = &ЗНБ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОкончаниеСканирования";
	ТЗ=запрос.Выполнить().Выгрузить();
	ТекДата=ТекущаяДата();

	// У проходных накладных в ЛН поставим все ЗНБ
	если ДанныеШапка.ПроходнаяНакладная тогда
		запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаданиеНабора.Ссылка КАК ЗНБ,
		|	ЗаданиеНабора.НомерЧасти КАК НомерЧасти
		|ИЗ
		|	Документ.ЗаданиеНабора КАК ЗаданиеНабора
		|ГДЕ
		|	ЗаданиеНабора.Проведен
		|	И ЗаданиеНабора.Дата >= &Дата
		|	И ЗаданиеНабора.Накладная = &Накладная
		|	И ЗаданиеНабора.ПроходнаяНакладная
		| И (ЗаданиеНабора.Сектор.Здание = &Здание или &ПоследовательныйНабор)";

		запрос.УстановитьПараметр("ПоследовательныйНабор",ДанныеШапка.ПоследовательныйНабор);
		запрос.УстановитьПараметр("Накладная",ДанныеШапка.Накладная);
		запрос.УстановитьПараметр("Здание",ДанныеШапка.Здание);	 

		ТЗЗНБ=запрос.Выполнить().Выгрузить();
		МассивЗНБ=ТЗЗНБ.ВыгрузитьКолонку("ЗНБ");	
	КонецЕсли;

	// Кельманов А.В. - Оптимизация работы - 2026.04.23 {
	//Для каждого результат из ТЗ цикл
	//	ОбЛн=результат.ссылка.получитьобъект();
	//	если ложь тогда ОбЛН=документы.ЛистНабора.СоздатьДокумент();КонецЕсли;        

	//	// Кельманов А.В. - Оптимизация работы - 2025.12.02 {
	//	//ТекДата=ТекДата+1;
	//	//ОбЛн.Дата=ТекДата;
	//	// Кельманов А.В. - Оптимизация работы - 2025.12.02 }
	//	
	//	ОбЛн.ОбменДанными.Загрузка=Истина;

	//	// У проходных накладных в ЛН поставим все ЗНБ
	//	если ДанныеШапка.ПроходнаяНакладная тогда
	//		Для каждого СтрМасс из МассивЗНБ цикл
	//			если ОбЛн.ЗаданияНабора.Найти(СтрМасс) = Неопределено тогда
	//				СтрЛНЗНБ=ОбЛн.ЗаданияНабора.Добавить();
	//				СтрЛНЗНБ.ЗаданиеНабора= СтрМасс;
	//			КонецЕсли;
	//		КонецЦикла;
	//	КонецЕсли; 

	//	если ОбЛн.Здание = Справочники.ЗданияСклада.ПустаяСсылка() тогда
	//		ОбЛн.Здание=ДанныеШапка.здание;
	//	КонецЕсли;
	//	
	//	если НужноЗаполнитьШКМатрицы тогда
	//		Отказ=ложь;
	//		СтруктураВозврата=ОбЛн.ПроверитьСоответствиеМатрицеИзМодуля();
	//		если СтруктураВозврата.ТекстПредупреждения<>"" тогда
	//			Оповещения=Оповещения+" "+СтруктураВозврата.ТекстПредупреждения;
	//		КонецЕсли;		
	//	КонецЕсли;
	//	
	//	если НужнаПереклейка тогда
	//		ОбЛн.Переклейка.Очистить();
	//		ОбЛн.ЗаполнитьТЧПереклейка();
	//	КонецЕсли;
	//	если ОбЛн.Переклейка.Количество()>0 тогда
	//		ОбЛн.ТребуетПроверки=Истина;
	//		МассивНомеровПереклейки.добавить(ОбЛн.Номер)
	//	КонецЕсли;
	//	
	//	ОбЛн.СформироватьШКЛистаНабора();

	//	ОбЛн.Записать();
	//КонецЦикла;
	Если ДанныеШапка.ПроходнаяНакладная Или НужноЗаполнитьШКМатрицы Или НужнаПереклейка Тогда
		
		Для Каждого Результат Из ТЗ Цикл
			
			ОбЛн = Результат.Ссылка.ПолучитьОбъект();
			
			Если Ложь Тогда ОбЛН = Документы.ЛистНабора.СоздатьДокумент(); КонецЕсли;        
			
			// У проходных накладных в ЛН поставим все ЗНБ
			Если ДанныеШапка.ПроходнаяНакладная Тогда
				
				Для Каждого СтрМасс Из МассивЗНБ Цикл
					
					Если ОбЛн.ЗаданияНабора.Найти(СтрМасс) = Неопределено Тогда
						
						СтрЛНЗНБ = ОбЛн.ЗаданияНабора.Добавить();
						СтрЛНЗНБ.ЗаданиеНабора = СтрМасс;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли; 
			
			Если НужноЗаполнитьШКМатрицы Тогда
				
				СтруктураВозврата = ОбЛн.ПроверитьСоответствиеМатрицеИзМодуля();
				
				Если СтруктураВозврата.ТекстПредупреждения <> "" Тогда
					
					Оповещения = Оповещения + " " + СтруктураВозврата.ТекстПредупреждения;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если НужнаПереклейка Тогда
				
				Если ОбЛн.Переклейка.Количество() > 0 Тогда 
					
					ОбЛн.Переклейка.Очистить();
					
				КонецЕсли;
				
				ОбЛн.ЗаполнитьТЧПереклейка();
				
			КонецЕсли;
			
			Если ОбЛн.Переклейка.Количество() > 0 Тогда
				
				ОбЛн.ТребуетПроверки = Истина;
				МассивНомеровПереклейки.Добавить(ОбЛн.Номер);
				
			КонецЕсли;
			
			Если ОбЛн.Модифицированность() Тогда
				
				ОбЛн.ОбменДанными.Загрузка = Истина;
			
				ОбЛн.ДополнительныеСвойства.Вставить("УпрощенныйРежим", Истина);
				
				ОбЛн.Записать();
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	// Кельманов А.В. - Оптимизация работы - 2026.04.23 }

	//  вывод оповещений на ТСД
	если МассивНомеровПереклейки.Количество()>0 тогда
		Оповещения=Оповещения+"Обработайте ЛН на компьютере. Требуется переклеить товар в ЛН: ";
		Для каждого СтрМассОповещений из МассивНомеровПереклейки цикл
			Оповещения=Оповещения+"  "+СтрМассОповещений;
		КонецЦикла;
	КонецЕсли; 

	// Кельманов А.В. - Исправление ошибки - 2026.06.04 {
	//запрос.Текст="ВЫБРАТЬ
	//             |	ЗНБ_Товары.Номенклатура КАК Номенклатура,
	//             |	СУММА(ЕСТЬNULL(ЗНБ_Товары.Количество, 0)) КАК Количество,
	//             |	ЗНБ.Ссылка КАК Ссылка
	//             |ПОМЕСТИТЬ тЗНБ
	//             |ИЗ
	//             |	Документ.ЗаданиеНабора.Товары КАК ЗНБ_Товары
	//             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНабора КАК ЗНБ
	//             |		ПО ЗНБ_Товары.Ссылка = ЗНБ.Ссылка
	//             |ГДЕ
	//             |	ЗНБ.Ссылка В(&СписокЗНБ)
	//             |	И ЗНБ.Дата >= &Дата
	//             |
	//             |СГРУППИРОВАТЬ ПО
	//             |	ЗНБ_Товары.Номенклатура,
	//             |	ЗНБ.Ссылка
	//             |
	//             |ИНДЕКСИРОВАТЬ ПО
	//             |	Номенклатура
	//             |;
	//             |
	//             |////////////////////////////////////////////////////////////////////////////////
	//             |ВЫБРАТЬ
	//             |	ЛистНабораТовары.Номенклатура КАК Номенклатура,
	//             |	СУММА(ЛистНабораТовары.Количество) КАК Количество
	//             |ПОМЕСТИТЬ тЛН
	//             |ИЗ
	//             |	Документ.ЛистНабора КАК ЛистНабора
	//             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ЗаданияНабора КАК ЛистНабора_ЗаданияНабора
	//             |		ПО (ЛистНабора_ЗаданияНабора.Ссылка = ЛистНабора.Ссылка)
	//             |			И (ЛистНабора_ЗаданияНабора.ЗаданиеНабора В (&СписокЗНБ))
	//             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.Товары КАК ЛистНабораТовары
	//             |		ПО (ЛистНабораТовары.Ссылка = ЛистНабора.Ссылка)
	//             |ГДЕ
	//             |	ЛистНабора.Дата >= &Дата
	//             |	И ЛистНабора.Проведен
	//             |	И НЕ ЛистНабора.ТребуетПроверки
	//             |
	//             |СГРУППИРОВАТЬ ПО
	//             |	ЛистНабораТовары.Номенклатура
	//             |
	//             |ИНДЕКСИРОВАТЬ ПО
	//             |	Номенклатура
	//             |;
	//             |
	//             |////////////////////////////////////////////////////////////////////////////////
	//             |ВЫБРАТЬ
	//             |	тЗНБ.Номенклатура КАК Номенклатура,
	//             |	СУММА(ЕСТЬNULL(тЗНБ.Количество, 0)) КАК План,
	//             |	СУММА(ЕСТЬNULL(тЛН.Количество, 0)) КАК Факт,
	//             |	тЗНБ.Ссылка КАК ЗНБ
	//             |ИЗ
	//             |	тЗНБ КАК тЗНБ
	//             |		ПОЛНОЕ СОЕДИНЕНИЕ тЛН КАК тЛН
	//             |		ПО тЗНБ.Номенклатура = тЛН.Номенклатура
	//             |
	//             |СГРУППИРОВАТЬ ПО
	//             |	тЗНБ.Номенклатура,
	//             |	тЗНБ.Ссылка
	//             |
	//             |ИМЕЮЩИЕ
	//             |	НЕ СУММА(ЕСТЬNULL(тЗНБ.Количество, 0)) = СУММА(ЕСТЬNULL(тЛН.Количество, 0))";
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗНБ_Товары.Номенклатура КАК Номенклатура,
	               |	СУММА(ЕСТЬNULL(ЗНБ_Товары.Количество, 0)) КАК Количество,
	               |	ЗНБ.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ тЗНБ
	               |ИЗ
	               |	Документ.ЗаданиеНабора.Товары КАК ЗНБ_Товары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНабора КАК ЗНБ
	               |		ПО ЗНБ_Товары.Ссылка = ЗНБ.Ссылка
	               |ГДЕ
	               |	ЗНБ.Ссылка В(&СписокЗНБ)
	               |	И ЗНБ.Дата >= &Дата
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗНБ_Товары.Номенклатура,
	               |	ЗНБ.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛистНабора.Ссылка КАК ЛистНабора
	               |ПОМЕСТИТЬ тЛисты
	               |ИЗ
	               |	Документ.ЛистНабора КАК ЛистНабора
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ЗаданияНабора КАК ЛистНабора_ЗаданияНабора
	               |		ПО (ЛистНабора_ЗаданияНабора.Ссылка = ЛистНабора.Ссылка)
	               |			И (ЛистНабора_ЗаданияНабора.ЗаданиеНабора В (&СписокЗНБ))
	               |ГДЕ
	               |	ЛистНабора.Дата >= &Дата
	               |	И ЛистНабора.Проведен
	               |	И НЕ ЛистНабора.ТребуетПроверки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЛистНабораТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(ЛистНабораТовары.Количество) КАК Количество
	               |ПОМЕСТИТЬ тЛН
	               |ИЗ
	               |	тЛисты КАК тЛисты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.Товары КАК ЛистНабораТовары
	               |		ПО (ЛистНабораТовары.Ссылка = тЛисты.ЛистНабора)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛистНабораТовары.Номенклатура
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	тЗНБ.Номенклатура КАК Номенклатура,
	               |	СУММА(ЕСТЬNULL(тЗНБ.Количество, 0)) КАК План,
	               |	СУММА(ЕСТЬNULL(тЛН.Количество, 0)) КАК Факт,
	               |	тЗНБ.Ссылка КАК ЗНБ
	               |ИЗ
	               |	тЗНБ КАК тЗНБ
	               |		ПОЛНОЕ СОЕДИНЕНИЕ тЛН КАК тЛН
	               |		ПО тЗНБ.Номенклатура = тЛН.Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	тЗНБ.Номенклатура,
	               |	тЗНБ.Ссылка
	               |
	               |ИМЕЮЩИЕ
	               |	НЕ СУММА(ЕСТЬNULL(тЗНБ.Количество, 0)) = СУММА(ЕСТЬNULL(тЛН.Количество, 0))";
	// Кельманов А.В. - Исправление ошибки - 2026.06.04 }	
	
	// У проходных накладных сканирование будет завершаться целиком по всем ЗНБ
	если ДанныеШапка.ПроходнаяНакладная тогда
		запрос.УстановитьПараметр("СписокЗНБ",МассивЗНБ);
	иначе
		запрос.УстановитьПараметр("СписокЗНБ",ЗНБ);
	КонецЕсли;
	
	ВыборкаРасхождений=запрос.Выполнить().Выбрать();
	ЕстьОшибки=ложь;
	
	пока ВыборкаРасхождений.Следующий() цикл
		ЕстьОшибки=Истина; 
		Прервать;//Потом нужно наверное будет куда-то расхождения писать	
	КонецЦикла;
	
	// Кельманов А.В. - HELP-7275 - 2025.10.23 {
	ТребуетсяВыполнитьАгрегацию = Ложь;
	
	ПравилаРаботыСАгрегациейЧЗ = МаркировкаКС.ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладной(ДанныеШапка.Накладная);
	
	Если ПравилаРаботыСАгрегациейЧЗ.УстановленыПравилаРаботыСАгрегацией Тогда
		
		Если ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияКоробок Тогда
			
			ЗапросАгрегацияКоробок = Новый Запрос;
			
			ЗапросАгрегацияКоробок.Текст = "ВЫБРАТЬ
			                               |	ЛистНабора.Ссылка КАК ЛН,
			                               |	ЛистНабора.КодАгрегации КАК ШтрихкодКоробки
			                               |ПОМЕСТИТЬ ВТ_КодыАгрегации
			                               |ИЗ
			                               |	Документ.ЛистНабора КАК ЛистНабора
			                               |ГДЕ
			                               |	ЛистНабора.Проведен
			                               |	И ЛистНабора.КодАгрегации <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
			                               |	И ЛистНабора.ДокОснование = &ДокОснование
			                               |
			                               |ОБЪЕДИНИТЬ ВСЕ
			                               |
			                               |ВЫБРАТЬ
			                               |	ЛистНабора.Ссылка,
			                               |	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки
			                               |ИЗ
			                               |	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
			                               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
			                               |		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
			                               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ЛистНабораШтрихкодыКоробокДляАгрегации
			                               |		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка
			                               |			И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ЛистНабораШтрихкодыКоробокДляАгрегации.НовыйКодКоробки
			                               |			И (ЛистНабораШтрихкодыКоробокДляАгрегации.НовыйКодКоробки <> ЛистНабораШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки)
			                               |ГДЕ
			                               |	ЛистНабора.ДокОснование = &ДокОснование
			                               |	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
			                               |	И ЛистНабора.Проведен
			                               |
			                               |ИНДЕКСИРОВАТЬ ПО
			                               |	ЛН
			                               |;
			                               |
			                               |////////////////////////////////////////////////////////////////////////////////
			                               |ВЫБРАТЬ
			                               |	ЛистНабора.Ссылка КАК ЛН
			                               |ИЗ
			                               |	Документ.ЛистНабора КАК ЛистНабора
			                               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КодыАгрегации КАК ВТ_КодыАгрегации
			                               |		ПО ЛистНабора.Ссылка = ВТ_КодыАгрегации.ЛН
			                               |ГДЕ
			                               |	ЛистНабора.Проведен
			                               |	И ЛистНабора.ДокОснование = &ДокОснование
			                               |	И ВТ_КодыАгрегации.ШтрихкодКоробки ЕСТЬ NULL";
			
			ЗапросАгрегацияКоробок.УстановитьПараметр("ДокОснование", ДанныеШапка.Накладная); 
			
			Результат = ЗапросАгрегацияКоробок.Выполнить();
			
			Если Не Результат.Пустой() Тогда
				
				ТребуетсяВыполнитьАгрегацию = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияБлочков Тогда
			
			ТребуетсяВыполнитьАгрегацию = Истина;
			
		КонецЕсли;
		
		Если ТребуетсяВыполнитьАгрегацию Тогда
			
			ЕстьОшибки = Истина;
			
			Ошибки = "Выгрузка завершена. Требуется выполнить агрегацию.";
			
		КонецЕсли;
		
	КонецЕсли;
	// Кельманов А.В. - HELP-7275 - 2025.10.23 }
	
	СтароеСостояние = ДанныеШапка.СостояниеЗНБ;
	если ЕстьОшибки тогда
		НовоеСостояние=Перечисления.СостоянияНакладной.Сканирование;
	иначе

		Если ДанныеШапка.ТребуетсяДО и ДанныеШапка.проходнаянакладная  тогда
			НовоеСостояние=ПолучитьНовоеСостояниеЗНБ(ЗНБ,Перечисления.СостоянияНакладной.ДопОбработка);
		иначе
			НовоеСостояние=ПолучитьНовоеСостояниеЗНБ(ЗНБ,Перечисления.СостоянияНакладной.Сканирование);
		КонецЕсли;			

		если ДанныеШапка.СозданоОбработкойПополнения тогда
			НовоеСостояние=Перечисления.СостоянияНакладной.Отгружена;		 
		КонецЕсли;
	КонецЕсли;
	
	если СтароеСостояние=НовоеСостояние тогда
		Возврат;
	КонецЕсли;
	
	ПН=ДанныеШапка.ПланНабора;
	
	если ложь тогда пн=Документы.ПланНабора.ПустаяСсылка();КонецЕсли;
	если  ПН.Пустая() тогда Возврат;КонецЕсли;
	ПНОбъект=ПН.ПолучитьОбъект();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	МИНИМУМ(ЛистНабора.НачалоСканирования) КАК НачалоСканирования,
	               |	МАКСИМУМ(ЛистНабора.ОкончаниеСканирования) КАК ОкончаниеСканирования,
	               |	МАКСИМУМ(ЛистНабора.Сканировщик) КАК Сканировщик
	               |ИЗ
	               |	Документ.ЛистНабора КАК ЛистНабора
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ЗаданияНабора КАК ЛистНабора_ЗаданияНабора
	               |		ПО (ЛистНабора_ЗаданияНабора.Ссылка = ЛистНабора.Ссылка)
	               |			И (ЛистНабора_ЗаданияНабора.ЗаданиеНабора = &ЗНБ)
	               |ГДЕ
	               |	ЛистНабора.Дата >= &Дата
	               |	И ЛистНабора.Проведен";	
	
	Результат = Запрос.Выполнить().Выбрать();
	
	НачалоСканирования = ПустаяДата();
	ОкончаниеСканирования = ПустаяДата();
	
	// Кельманов А.В. - HELP-9378 - 2026.04.08 {
	//Сканировщик=Справочники.ФизическиеЛица.ПустаяСсылка();
	Сканировщик = Наборщик;
	// Кельманов А.В. - HELP-9378 - 2026.04.08 }
	
	Пока Результат.Следующий() Цикл
		
		НачалоСканирования = Результат.НачалоСканирования;
		ОкончаниеСканирования = Результат.ОкончаниеСканирования;
		
		// Кельманов А.В. - HELP-9378 - 2026.04.08 {
		//Сканировщик = Результат.Сканировщик;
		Если Не ЗначениеЗаполнено(Сканировщик) Тогда
			
			Сканировщик = Результат.Сканировщик;
			
		КонецЕсли;
		// Кельманов А.В. - HELP-9378 - 2026.04.08 }
		
	КонецЦикла;
	
	если ДанныеШапка.проходнаянакладная тогда
		
		
		если ЕстьОшибки тогда  
			МассСтрок=ПНОбъект.тБрэндов.НайтиСтроки(новый Структура("НомерЧасти",ДанныеШапка.НомерЧасти));		
			для каждого СтрМасс из МассСтрок цикл
				СтрМасс.Состояние=НовоеСостояние;
				если ЗначениеЗаполнено(НачалоСканирования) и ЗначениеЗаполнено(ОкончаниеСканирования) тогда

					если ЗначениеЗаполнено(СтрМасс.НачалоНабора) тогда
						НачалоСканирования= СтрМасс.НачалоНабора;
					КонецЕсли;
					
					СтрМасс.НачалоНабора=НачалоСканирования;
					СтрМасс.ОкончаниеНабора=ОкончаниеСканирования;
					
					СтрМасс.Наборщик=Сканировщик;
					СтрМасс.Сканировщик=Сканировщик;
					СтрМасс.НаборЗакончен=Истина;
					
					СтрМасс.НачалоСканировки=НачалоСканирования;
					СтрМасс.ОкончаниеСканировки=ОкончаниеСканирования;
					СтрМасс.СканировкаЗакончена = Истина;		
					если ДанныеШапка.ТребуетсяДО тогда
						СтрМасс.НачалоДопОбработки=НачалоСканирования;
						СтрМасс.ОкончаниеДопОбработки=ОкончаниеСканирования;
						СтрМасс.ДопОбработкаЗакончена=Истина;
						если не ЗначениеЗаполнено(СтрМасс.ДопОбработчик) тогда
							СтрМасс.ДопОбработчик=Сканировщик;
						КонецЕсли;					
					КонецЕсли;
				КонецЕсли;		 
			КонецЦикла;
		иначе			
			для каждого СтрМасс из ПНОбъект.тБрэндов цикл 
				
				// Меняем только строчки из сборных ЗНБ
				если ТЗЗНБ.найти(СтрМасс.НомерЧасти) = Неопределено тогда Продолжить;КонецЕсли; 
				
				
				СтрМасс.Состояние=НовоеСостояние;		
				если СтрМасс.НомерЧасти = ДанныеШапка.НомерЧасти тогда

					если ЗначениеЗаполнено(СтрМасс.НачалоНабора) тогда
						НачалоСканирования= СтрМасс.НачалоНабора;
					КонецЕсли;
					
					СтрМасс.НачалоНабора=НачалоСканирования;
					СтрМасс.ОкончаниеНабора=ОкончаниеСканирования; 
					СтрМасс.Наборщик=Сканировщик;
					СтрМасс.Сканировщик=Сканировщик;
					СтрМасс.НачалоСканировки=НачалоСканирования;
					СтрМасс.ОкончаниеСканировки=ОкончаниеСканирования;
					СтрМасс.НаборЗакончен=Истина;			
					СтрМасс.СканировкаЗакончена = Истина;	
					
				КонецЕсли;	
				
				если ДанныеШапка.ТребуетсяДО тогда
					если не ЗначениеЗаполнено(СтрМасс.ДопОбработчик)   тогда
						СтрМасс.ДопОбработчик = Сканировщик; 
					КонецЕсли;
					если не ЗначениеЗаполнено(СтрМасс.НачалоДопОбработки) тогда
						СтрМасс.НачалоДопОбработки=НачалоСканирования;
					КонецЕсли;
					если не ЗначениеЗаполнено(СтрМасс.ОкончаниеДопОбработки) тогда
						СтрМасс.ОкончаниеДопОбработки=ОкончаниеСканирования;
					КонецЕсли;
					СтрМасс.ДопОбработкаЗакончена=Истина;
				КонецЕсли;			
			КонецЦикла;
		КонецЕсли;
		ПНОбъект.Записать();
		
		
		если ЕстьОшибки тогда     //Пишем сканирование в выгружаемый ЗНБ, остальные не трогаем
			ЗНБОбъект=знб.ПолучитьОбъект();
			ЗНБОбъект.ЗагруженИзТСД=Истина;
			ЗНБОбъект.ОбменДанными.Загрузка = Истина;
			ЗНБОбъект.Записать();
		иначе
			Для каждого СтрЗНБ из МассивЗНБ цикл    //Пишем готовность во все ЗНБ 
				ЗНБОбъект=СтрЗНБ.получитьобъект();
				ЗНБОбъект.ЗагруженИзТСД=Истина;
				ЗНБОбъект.ОбменДанными.Загрузка = Истина;
				ЗНБОбъект.Записать();
				
			КонецЦикла;
		КонецЕсли;		
	иначе	
		
		МассСтрок=ПНОбъект.тБрэндов.НайтиСтроки(новый Структура("НомерЧасти",ДанныеШапка.НомерЧасти));
		
		для каждого СтрМасс из МассСтрок цикл
			СтрМасс.Состояние=НовоеСостояние;

			если ЗначениеЗаполнено(НачалоСканирования) и ЗначениеЗаполнено(ОкончаниеСканирования) тогда
				СтрМасс.НачалоНабора=НачалоСканирования;
				СтрМасс.ОкончаниеНабора=ОкончаниеСканирования;
				СтрМасс.Наборщик=Сканировщик;
				СтрМасс.НаборЗакончен=Истина;
				
				СтрМасс.НачалоСканировки=НачалоСканирования;
				СтрМасс.ОкончаниеСканировки=ОкончаниеСканирования;
				СтрМасс.Сканировщик=Сканировщик;
				СтрМасс.СканировкаЗакончена = Истина;			
			КонецЕсли;		 
			
		КонецЦикла;
		
		если МассСтрок.Количество()>0 тогда
			ПНОбъект.Записать();
		КонецЕсли;
		
		ЗНБОбъект=знб.ПолучитьОбъект();
		ЗНБОбъект.ЗагруженИзТСД=Истина;
		ЗНБОбъект.ОбменДанными.Загрузка = Истина;
		ЗНБОбъект.Записать();
		
	КонецЕсли;

	если ДанныеШапка.СозданоОбработкойПополнения и не ЕстьОшибки тогда
		если ТипЗнч(ДанныеШапка.Накладная)=Тип("ДокументСсылка.Перемещение") тогда
			ПРМОбъект=ДанныеШапка.Накладная.ПолучитьОбъект();
			если ложь тогда ПРМОбъект=документы.Перемещение.СоздатьДокумент();КонецЕсли;
			если ПРМОбъект.СостояниеНакладной<>Перечисления.СостоянияНакладной.Отгружена тогда
				ПРМОбъект.СостояниеНакладной= Перечисления.СостоянияНакладной.Отгружена;
			КонецЕсли;
			
			если ПРМОбъект.СостояниеНакладнойУПолучателя<>Перечисления.СостоянияНакладной.Принята тогда
				ПРМОбъект.СостояниеНакладнойУПолучателя=Перечисления.СостоянияНакладной.Принята;
			КонецЕсли;
			
			если ПРМОбъект.Отгружен<>Перечисления.Отгружен.Отгружен тогда
				ПРМОбъект.Отгружен=Перечисления.Отгружен.Отгружен
			КонецЕсли;
			
			если ПРМОбъект.Модифицированность() тогда
				ПРМОбъект.Записать(?(ПРМОбъект.Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерФункции(ДанныеЗамера);  
	
КонецПроцедуры
// Кухарь А.Ю. 07.06.2021 конец

// Кухарь А.Ю. 14.03.2022 начало
//
Процедура СформироватьЭтикеткиПоЗНБ (ЗНБСсылка) экспорт
	//ТабДок=новый ТабличныйДокумент;
	МассивТД=новый Массив;
	Если не ТипЗнч(ЗНБСсылка) = тип("ДокументСсылка.ЗаданиеНабора") Тогда
		СообщитьИзМодуля("Перед печатью отсканируйте спецификацию.");
		Возврат;
	КонецЕсли;
	
	
	ДопПараметрыНакладной=ОбщегоНазначения_ПИ.ПолучитьДопПараметрыНакладной(ЗНБСсылка);
	если ДопПараметрыНакладной.имя<>Неопределено и ДопПараметрыНакладной.имя="WB_FBS" тогда
		СформироватьЭтикеткиВайлдбреррис(МассивТД,ЗНБСсылка,ДопПараметрыНакладной);
	КонецЕсли;
	
	Для каждого ТабДок из МассивТД цикл
		ТабДок.Показать();
	КонецЦикла;
КонецПроцедуры

Процедура СформироватьЭтикеткиВайлдбреррис (МассивТД,ЗНБСсылка,ДопПараметрыНакладной)
	
	
	Накладная=Неопределено;
	ТЗТоваров=ПолучитьТоварыФБСпоЗНБ(ЗНБСсылка,ДопПараметрыНакладной,Накладная);
	ТЗМатрицы=ЗаполнитьТаблицуДанныхМатрицы(Накладная,ТЗТоваров);
	
	ТабДок=новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати="АналогЗПЛВайлдберрис";
	Для каждого СтрокаТоваров из ТЗТоваров цикл
		СформироватьЭтикеткуFBS (ТабДок,СтрокаТоваров);	
		если СтрокаТоваров.ЭтоКомплект тогда
			НапечататьЭтикеткуСШКМатрицы(СтрокаТоваров.Номенклатура,СтрокаТоваров.ЭтоКомплект,ТЗМатрицы,ТабДок,СтрокаТоваров.количество);
		КонецЕсли;
		
	КонецЦикла;
	МассивТД.добавить(ТабДок);
	
	//
	//если ДопПараметрыНакладной.ОтгрузкаКомплектов тогда
	//	ТабДок=новый ТабличныйДокумент;
	//	ТабДок.ИмяПараметровПечати="УвеличенныйШКFBS";
	//	
	//	Для каждого СтрокаТоваров из ТЗТоваров цикл
	//		если СтрокаТоваров.ЭтоКомплект тогда
	//			НапечататьЭтикеткуСШКМатрицы(СтрокаТоваров.Номенклатура,СтрокаТоваров.ЭтоКомплект,ТЗМатрицы,ТабДок,СтрокаТоваров.количество);
	//		КонецЕсли;
	//	КонецЦикла;
	//	МассивТД.добавить(ТабДок);
	//КонецЕсли;
	
	
	
КонецПроцедуры



Процедура НапечататьЭтикеткуСШКМатрицы(Номенклатура,ЭтоКомплект,ТЗМатрицы,ТабДок,Количество)
	
	
	СтрокаМатрицы=ТЗМатрицы.Найти(Номенклатура,"Номенклатура");
	Если СтрокаМатрицы=Неопределено тогда
		СообщитьИзМодуля(""+Номенклатура+" нет в матрице. Этикетка не распечатана.");
		Возврат;
	КонецЕсли;
	
	
	
	НаборПолей=новый Структура("КодПроизводителя,Модель,ЦветБольшой,РазмерБольшой,РусскоеНаименованиеЦвета,РусскийПроизводитель,ДатаИзготовления,НаименованиеНоменклатуры,РазмерКомплекта");
	НаборПолей.ДатаИзготовления = НРег(Формат(ТекущаяДата() -90*24*60*60,"ДФ=MMMM")+ " "+Формат(НачалоМесяца(ТекущаяДата() -90*24*60*60),"ДФ=yyyy")+ " г.");
	ЗаполнитьЗначенияСвойств(НаборПолей,СтрокаМатрицы);
	НаборПолей.РазмерБольшой=ВРег(СтрокаМатрицы.Размер);
	НаборПолей.ЦветБольшой=ВРег(СтрокаМатрицы.Цвет);
	НаборПолей.РусскоеНаименованиеЦвета=ВРег(СтрокаМатрицы.РусскоеНаименованиеЦвета);
	
	ПолноеИмяФайла	=СокрЛП(Константы.КаталогВнешнихОтчетов.Получить()+"PrnForms\РаботаСЗаказомКлиента.epf");
	ОбработкаПечати=ВнешниеОбработки.Создать(ПолноеИмяФайла);
	если ЭтоКомплект тогда
		Макет=ОбработкаПечати.ПолучитьМакет("ЭтикеткаКомплект");
		НаборПолей.РазмерКомплекта=ПолучитьРеквизитШапки(Номенклатура,"Родитель.ШтукВКомплекте","Справочник"); 
	иначе
		Макет=ОбработкаПечати.ПолучитьМакет("Этикетка1_2х0_85_ЕАС");
	КонецЕсли;
	если ложь тогда
		ТД=новый ТабличныйДокумент;
		ОблЭтикетка=тд.Область("");
	КонецЕсли;
	ОблЭтикетка=макет.получитьобласть("Строка");
	ОблЭтикетка.параметры.заполнить(НаборПолей);
	Для Каждого Рисунок Из ОблЭтикетка.Рисунки Цикл	
		Если Лев(Рисунок.Имя,6)="Объект" Тогда
			ОбъектШК			=Рисунок.Объект;
			ОбъектШК.Сообщение	=СтрокаМатрицы.ШККонтрагента;
		КонецЕсли;
	КонецЦикла;
	для сч=1 по Количество цикл
		ТабДок.Вывести(ОблЭтикетка);
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
	
КонецПроцедуры

Функция ЗаполнитьТаблицуДанныхМатрицы (Накладная,ТЗТоваров)
	РеквизитыШапки=ПолучитьРеквизитыШапки(Накладная,"Контрагент,ПунктДоставки,Договор,Дата,ПостояннаяАкция","Документ");
	
	Запрос			= Новый Запрос;				
	Запрос.Текст 	= "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МатрицаТовары.Номенклатура КАК Номенклатура,
	|	МатрицаТовары.КратностьКоробки КАК КратностьКоробки,
	|	МатрицаТовары.ШККонтрагента КАК ШККонтрагента,
	|	МатрицаТовары.ШККонтрагентаДополнительный КАК ШККонтрагентаДополнительный,
	|	МатрицаТовары.Номенклатура.Родитель КАК Модель,
	|	МатрицаТовары.Номенклатура.КодПроизводителя КАК КодПроизводителя,
	|	МатрицаТовары.Номенклатура.Цвет.Наименование КАК Цвет,
	|	""Размер:"" + МатрицаТовары.Номенклатура.Размер.Наименование КАК Размер,
	|	ВЫРАЗИТЬ(МатрицаТовары.Номенклатура.Цвет.РусскоеНаименование КАК СТРОКА(30)) КАК РусскоеНаименованиеЦвета,
	|	МатрицаТовары.Номенклатура.Наименование КАК НаименованиеНоменклатуры,
	|	0 КАК РазмерКомплекта
	|ИЗ
	|	Документ.Матрица.Товары КАК МатрицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
	|ГДЕ
	|	МатрицаТовары.Ссылка.Проведен
	|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
	|	И МатрицаТовары.Ссылка.Договор = &Договор
	|	И МатрицаТовары.Ссылка.Дата <= &Дата1
	|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
	|	И МатрицаПунктыДоставки.ПунктДоставки = &ПунктДоставки
	|	И МатрицаТовары.Номенклатура В(&Номенклатура)
	|	И МатрицаТовары.Ссылка.ПостояннаяАкция = &ПостояннаяАкция";
	
	Запрос.УстановитьПараметр("Дата2",			НачалоДня(РеквизитыШапки.Дата));
	Запрос.УстановитьПараметр("Дата1",			КонецДня(РеквизитыШапки.Дата));
	Запрос.УстановитьПараметр("Контрагент",		РеквизитыШапки.Контрагент);		
	Запрос.УстановитьПараметр("ПунктДоставки",	РеквизитыШапки.ПунктДоставки);				
	Запрос.УстановитьПараметр("Договор",		РеквизитыШапки.Договор);		
	запрос.УстановитьПараметр("Номенклатура",ТЗТоваров.ВыгрузитьКолонку("Номенклатура"));
	запрос.УстановитьПараметр("ПостояннаяАкция",РеквизитыШапки.ПостояннаяАкция);
	
	возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции



Процедура СформироватьЭтикеткуFBS(ТабДок,СтрокаТЗ)
	
	
	ПолноеИмяФайла	=СокрЛП(Константы.КаталогВнешнихОтчетов.Получить()+"PrnForms\РаботаСЗаказомКлиента.epf");
	ОбработкаПечати=ВнешниеОбработки.Создать(ПолноеИмяФайла);
	Макет=ОбработкаПечати.ПолучитьМакет("ШКВайлдберисПакетная");
	
	
	ОблСтрока=макет.ПолучитьОбласть("Строка");
	ЗаполнитьЗначенияСвойств(ОблСтрока.Параметры,СтрокаТЗ);
	Для Каждого Рисунок Из ОблСтрока.Рисунки Цикл				
		ОбъектШК			=Рисунок.Объект;
		ОбъектШК.Сообщение	= СтрокаТЗ.ШтрихКод;
	КонецЦикла;
	ТабДок.Вывести(ОблСтрока);
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	
КонецПроцедуры


Функция ПолучитьТоварыФБСпоЗНБ(ЗНБСсылка,ДопПараметрыНакладной,Накладная)
	если ложь тогда ЗНБСсылка=документы.ЗаданиеНабора.ПустаяСсылка();КонецЕсли;
	МассивТоваров=ЗНБСсылка.товары.ВыгрузитьКолонку("Номенклатура");
	
	Накладная=ПолучитьРеквизитШапки(ЗНБСсылка,"Накладная","Документ");
	Запрос=новый запрос;
	Запрос.УстановитьПараметр("Накладная",Накладная);
	
	Если ДопПараметрыНакладной.ОтгрузкаКомплектов тогда
		Запрос.Текст="ВЫБРАТЬ различные
		|	РасходнаяНакладнаяКомплектующие.Продукция КАК Номенклатура
		|ИЗ
		|	Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
		|ГДЕ
		|	РасходнаяНакладнаяКомплектующие.Номенклатура В(&Номенклатура)
		|	И РасходнаяНакладнаяКомплектующие.Ссылка = &Накладная";
		запрос.УстановитьПараметр("Номенклатура",МассивТоваров);
		МассивТоваров=запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");		
	КонецЕсли;
	
	Запрос.Текст="ВЫБРАТЬ
	|	ЗаказКлиентаFBSТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ЗаказКлиентаFBSТовары.Количество) КАК Количество,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаFBSТовары.Номенклатура.ВидКомплекта = &ПустойКомплект
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоКомплект,
	|	ЗаказКлиентаFBSТовары.Номенклатура.Родитель.Наименование КАК ПолеСортировки4,
	|	ЗаказКлиентаFBSТовары.Номенклатура.Родитель.Родитель.Наименование КАК ПолеСортировки3,
	|	ЗаказКлиентаFBSТовары.Номенклатура.Родитель.Родитель.Родитель.Наименование КАК ПолеСортировки2,
	|	ЗаказКлиентаFBSТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель.Наименование КАК ПолеСортировки1,
	|	ЗаказКлиентаFBSТовары.ПрефиксЗаказа КАК ПрефиксЗаказа,
	|	ЗаказКлиентаFBSТовары.СуффиксЗаказа КАК СуффиксЗаказа,
	|	ЗаказКлиентаFBSТовары.ШтрихКод КАК ШтрихКод,
	|	ЗаказКлиентаFBSТовары.НомерЗаказа КАК НомерЗаказа
	|ИЗ
	|	Документ.ЗаказКлиентаFBS.Товары КАК ЗаказКлиентаFBSТовары
	|ГДЕ
	|	ЗаказКлиентаFBSТовары.Ссылка.ДокОснование = &Накладная
	|	И ЗаказКлиентаFBSТовары.Номенклатура В(&Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаFBSТовары.Номенклатура,
	|	ЗаказКлиентаFBSТовары.Номенклатура.Родитель.Наименование,
	|	ЗаказКлиентаFBSТовары.Номенклатура.Родитель.Родитель.Наименование,
	|	ЗаказКлиентаFBSТовары.Номенклатура.Родитель.Родитель.Родитель.Наименование,
	|	ЗаказКлиентаFBSТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель.Наименование,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаFBSТовары.Номенклатура.ВидКомплекта = &ПустойКомплект
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЗаказКлиентаFBSТовары.ПрефиксЗаказа,
	|	ЗаказКлиентаFBSТовары.СуффиксЗаказа,
	|	ЗаказКлиентаFBSТовары.ШтрихКод,
	|	ЗаказКлиентаFBSТовары.НомерЗаказа
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПолеСортировки1,
	|	ПолеСортировки2,
	|	ПолеСортировки3,
	|	ПолеСортировки4";
	запрос.УстановитьПараметр("Номенклатура",МассивТоваров);
	запрос.УстановитьПараметр("ПустойКомплект",Перечисления.ВидыКомплектов.ПустаяСсылка());
	
	возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции


Процедура ПропуститьСканированиеЗНБ (ЗНБ)  Экспорт 
	ЗаписыватьВЛог=Истина;
	если ЗаписыватьВЛог тогда
		ЗаписатьВЛог("Отладка","Начало пропуска сканирования -"+ЗНБ,"Информация");
	КонецЕсли;
	если Константы.РежимРаботыБезСканирования.Получить()=ложь тогда
		СообщитьИзМодуля("Пропускать сканирование запрещено. Обратитесь к администраторам склада");
		если ЗаписыватьВЛог тогда		
			ЗаписатьВЛог("Отладка","Константа РежимРаботыБезСканирования = ложь. "+ЗНБ,"Информация");
		КонецЕсли;
		
		
		Возврат;
	КонецЕсли;
	
	ЗНБОбъект=ЗНБ.получитьобъект();
	если ложь тогда  ЗНБОбъект=документы.ЗаданиеНабора.СоздатьДокумент();КонецЕсли;
	ТЗДопустимыхСостояний=ПолучитьТЗСостоянийДляПропускаСканирования();	
	СтрокаТекущегоСостояния=ТЗДопустимыхСостояний.найти(ЗНБОбъект.СостояниеНакладной);
	если СтрокаТекущегоСостояния=Неопределено тогда
		СообщитьИзМодуля("Пропускать сканирование можно в состоянии ожидание сканирования.");
		если ЗаписыватьВЛог тогда		
			ЗаписатьВЛог("Отладка","Неправильное состояние ЗНБ - "+ЗНБОбъект.СостояниеНакладной+", "+ЗНБ,"Информация");
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	СтрТЧ=ЗНБОбъект.ПланируемыеСостояния.Найти(Перечисления.СостоянияНакладной.ОжиданиеСканирования,"Состояние");
	если СтрТЧ<>Неопределено тогда
		СтрТЧ.Пропустить=Истина;
	КонецЕсли;
	
	СтрТЧ=ЗНБОбъект.ПланируемыеСостояния.Найти(Перечисления.СостоянияНакладной.Сканирование,"Состояние");
	если СтрТЧ<>Неопределено тогда
		СтрТЧ.Пропустить=Истина;
	КонецЕсли;
	
	НачатьТранзакцию();
	ЗНБОбъект.ЗаписатьЗНББезКонтроляСостояний(РежимЗаписиДокумента.Запись);
	ТекДата=ТекущаяДата();	
	если СтрокаТекущегоСостояния.ПереводитьДальше тогда	
		НовоеСостояние=ПолучитьНовоеСостояниеЗНБ(ЗНБ);
		ТекНомер=ПолучитьНомерСостоянияНакладной(НовоеСостояние);	
		ПН_Объект=ЗНБОбъект.ДокументОснование.ПолучитьОбъект();	
		МассивСтрокПН=ПН_Объект.тБрэндов.НайтиСтроки(новый Структура("НомерЧасти",ЗНБОбъект.НомерЧасти));
		Для Каждого СтрокаПН Из МассивСтрокПН Цикл
			Если  ТекНомер>ПолучитьНомерСостоянияНакладной(СтрокаПН.Состояние) Тогда
				СтрокаПН.Состояние=НовоеСостояние;	
				СтрокаПН.НачалоСканировки=ТекДата;
				СтрокаПН.ОкончаниеСканировки=ТекДата;
				СтрокаПН.СканировкаЗакончена=Истина;
				СтрокаПН.Сканировщик=СтрокаПН.Наборщик;		
			КонецЕсли; 	
		КонецЦикла; 	
		Если ПН_Объект.Модифицированность() Тогда
			ПН_Объект.Записать();	
		КонецЕсли; 
	КонецЕсли;
	ЗафиксироватьТранзакцию();
	
	если ЗаписыватьВЛог тогда		
		ЗаписатьВЛог("Отладка","Успешное окончание пропуска сканирования -"+ЗНБ,"Информация");
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТЗСостоянийДляПропускаСканирования ()
	ТЗДопустимыхСостояний = новый ТаблицаЗначений;
	ТЗДопустимыхСостояний.Колонки.Добавить("Состояние");
	ТЗДопустимыхСостояний.Колонки.Добавить("ПереводитьДальше");
	
	//СтрТЗ=ТЗДопустимыхСостояний.Добавить();
	//СтрТЗ.Состояние=Перечисления.СостоянияНакладной.ОжиданиеНабора;
	//СтрТЗ.ПереводитьДальше=ложь;
	
	//СтрТЗ=ТЗДопустимыхСостояний.Добавить();
	//СтрТЗ.Состояние=Перечисления.СостоянияНакладной.ВНаборе;
	//СтрТЗ.ПереводитьДальше=ложь;
	
	СтрТЗ=ТЗДопустимыхСостояний.Добавить();
	СтрТЗ.Состояние=Перечисления.СостоянияНакладной.ОжиданиеСканирования;
	СтрТЗ.ПереводитьДальше=Истина;
	
	СтрТЗ=ТЗДопустимыхСостояний.Добавить();
	СтрТЗ.Состояние=Перечисления.СостоянияНакладной.Сканирование;
	СтрТЗ.ПереводитьДальше=Истина;
	Возврат ТЗДопустимыхСостояний;
	
КонецФункции
// Кухарь А.Ю. 14.03.2022 конец


// Кухарь А.Ю.  11.11.2024 начало
//
Процедура КонтрольНачалаИЗавершенияКомплектацииНаборовЧЗЗНБ (ЗаданиеНаСборкуКомплектовЧЗ,ЛистСборкиКомплектовЧЗ) экспорт
	
	Накладная=ПолучитьРеквизитШапки(ЗаданиеНаСборкуКомплектовЧЗ,"ДокОснование","Документ");
	МассивСостоянийНакладной=новый Массив;
	МассивСостоянийНакладной.Добавить(Перечисления.СостоянияНакладной.ОжиданиеКомплектацииЧЗ);
	МассивСостоянийНакладной.Добавить(Перечисления.СостоянияНакладной.КомплектацияЧЗ);
	
	
	//Получим номенклатуру (комплектующую), в рамках которой всё сравниваем+++
	запрос=новый запрос;
	запрос.УстановитьПараметр("Накладная",Накладная);
	запрос.УстановитьПараметр("МассивСостоянийНакладной",МассивСостоянийНакладной);
	запрос.УстановитьПараметр("ЛистСборкиКомплектовЧЗ",ЛистСборкиКомплектовЧЗ);	
	запрос.УстановитьПараметр("ЗаданиеНаСборкуКомплектовЧЗ",ЗаданиеНаСборкуКомплектовЧЗ);	
	
	// Кухарь А.Ю. 20.11.2024 начало
	//
	если ЛистСборкиКомплектовЧЗ=Неопределено тогда
		Запрос.Текст= "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец КАК Номенклатура
		|ИЗ
		|	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
		|ГДЕ
		|	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.ДокОснование = &ЗаданиеНаСборкуКомплектовЧЗ
		|	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.Проведен";
		МассивНоменклатуры=запрос.Выполнить().Выгрузить().выгрузитьколонку("Номенклатура");
		запрос.УстановитьПараметр("МассивНоменклатуры",МассивНоменклатуры);	

	иначе
	Запрос.Текст= "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец КАК Номенклатура
	|ИЗ
	|	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
	|ГДЕ
	|	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка = &ЛистСборкиКомплектовЧЗ";
	МассивНоменклатуры=запрос.Выполнить().Выгрузить().выгрузитьколонку("Номенклатура");
	запрос.УстановитьПараметр("МассивНоменклатуры",МассивНоменклатуры);	
		
	КонецЕсли;
	// Кухарь А.Ю. 20.11.2024 конец
	
	//Получим номенклатуру (комплектующую), в рамках которой всё сравниваем--
	
	
	
	//Получим количество требуемое для наборов из всех ЗНБ +++
	//В 1ю очередь выберем ЗНБ, по которым уже всё завершено
	запрос.Текст="ВЫБРАТЬ
	             |	ЗНБ.Ссылка КАК Ссылка
	             |ПОМЕСТИТЬ ЗНБ
	             |ИЗ
	             |	Документ.ЗаданиеНабора КАК ЗНБ
	             |ГДЕ
	             |	ЗНБ.Накладная = &Накладная
	             |	И ЗНБ.Проведен
	             |	И ЗНБ.Товары.Номенклатура В(&МассивНоменклатуры)
	             |	И ЗНБ.Товары.КоличествоДляНаборов > 0
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ЗаданиеНабораТовары.Номенклатура КАК Номенклатура,
	             |	ЗаданиеНабораТовары.КоличествоДляНаборов КАК КоличествоДляНаборов,
	             |	ЗНБ.Ссылка КАК Ссылка,
	             |	ЗНБ.Ссылка.ФормированиеНаборовЧЗЗавершено КАК ФормированиеНаборовЧЗЗавершено,
	             |	ЗНБ.Ссылка.СостояниеНакладной КАК СостояниеНакладной
	             |ИЗ
	             |	ЗНБ КАК ЗНБ
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНабора.Товары КАК ЗаданиеНабораТовары
	             |		ПО ЗНБ.Ссылка = ЗаданиеНабораТовары.Ссылка
	             |			И (ЗаданиеНабораТовары.КоличествоДляНаборов > 0)
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ФормированиеНаборовЧЗЗавершено УБЫВ,
	             |	Ссылка";
	
	ТаблицаЗНБ=запрос.Выполнить().Выгрузить();
	запрос.УстановитьПараметр("МассивНоменклатуры",ТаблицаЗНБ.ВыгрузитьКолонку("Номенклатура"));	

	//Получим количество требуемое для наборов из всех ЗНБ---

	
	
	//Получим количество из всех листов ранее проведённых + переданный лист +++
	Запрос.Текст="ВЫБРАТЬ
	|	т1.Номенклатура КАК Номенклатура,
	|	СУММА(т1.Количество) КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		СУММА(1) КАК Количество,
	|		ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец КАК Номенклатура
	|	ИЗ
	|		Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
	|	ГДЕ
	|		ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.ДокОснование = &ЗаданиеНаСборкуКомплектовЧЗ
	|		И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.Проведен
	|		И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.Ссылка <> &ЛистСборкиКомплектовЧЗ
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СУММА(1),
	|		ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец
	|	ИЗ
	|		Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
	|	ГДЕ
	|		ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.Ссылка = &ЛистСборкиКомплектовЧЗ
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец) КАК т1
	|
	|СГРУППИРОВАТЬ ПО
	|	т1.Номенклатура";
	ТаблицаНоменклатурыЛистов=запрос.Выполнить().Выгрузить();	
	//Получим количество из всех листов ранее проведённых + переданный лист ---
	
	ТекущийЗНБ=Неопределено;
	ТекущееСостояние=Неопределено;
	НужноЗаписывать=ложь;
	ВсёСошлось=Истина;
	ТекущееФормированиеНаборовЧЗЗавершено=Неопределено;
	
	Для каждого СтрокаТЗ из ТаблицаЗНБ цикл
		если ТекущийЗНБ<> СтрокаТЗ.Ссылка тогда
			если ТекущийЗНБ<>Неопределено тогда
				УстановкаСтадийРаботыСНаборамиЧЗ(ВсёСошлось, ЛистСборкиКомплектовЧЗ, Накладная, ТекущееСостояние, ТекущееФормированиеНаборовЧЗЗавершено, ТекущийЗНБ);
			КонецЕсли;
			ТекущийЗНБ=СтрокаТЗ.Ссылка;
			ТекущееСостояние=СтрокаТЗ.СостояниеНакладной;
			ТекущееФормированиеНаборовЧЗЗавершено=СтрокаТЗ.ФормированиеНаборовЧЗЗавершено;
			ВсёСошлось=Истина;
			
		КонецЕсли;
		
		СтрокаЛиста=ТаблицаНоменклатурыЛистов.Найти(СтрокаТЗ.Номенклатура,"Номенклатура");
		если СтрокаЛиста=Неопределено тогда
			ВсёСошлось=Ложь;
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТЗ.КоличествоДляНаборов>СтрокаЛиста.Количество тогда
			ВсёСошлось=Ложь; 
		КонецЕсли;
		СтрокаЛиста.Количество=Макс(СтрокаЛиста.Количество-СтрокаТЗ.КоличествоДляНаборов,0);
	КонецЦикла;
	если ТекущийЗНБ<>Неопределено тогда
		УстановкаСтадийРаботыСНаборамиЧЗ(ВсёСошлось, ЛистСборкиКомплектовЧЗ, Накладная, ТекущееСостояние, ТекущееФормированиеНаборовЧЗЗавершено, ТекущийЗНБ);
	КонецЕсли;	
	
	
		
КонецПроцедуры

// Кухарь А.Ю.  26.02.2026 начало
// Оптимизация
Процедура КонтрольНачалаИЗавершенияКомплектацииНаборовЧЗЗНБПакетно (ЗаданиеНаСборкуКомплектовЧЗ) экспорт
	
	Накладная=ПолучитьРеквизитШапки(ЗаданиеНаСборкуКомплектовЧЗ,"ДокОснование","Документ");
	МассивСостоянийНакладной=новый Массив;
	МассивСостоянийНакладной.Добавить(Перечисления.СостоянияНакладной.ОжиданиеКомплектацииЧЗ);
	МассивСостоянийНакладной.Добавить(Перечисления.СостоянияНакладной.КомплектацияЧЗ);
	
	
	//Получим номенклатуру (комплектующую), в рамках которой всё сравниваем+++
	запрос=новый запрос;
	запрос.УстановитьПараметр("Накладная",Накладная);
	запрос.УстановитьПараметр("МассивСостоянийНакладной",МассивСостоянийНакладной);
	запрос.УстановитьПараметр("ЗаданиеНаСборкуКомплектовЧЗ",ЗаданиеНаСборкуКомплектовЧЗ);	        
	
	
	
	
	//Получим количество требуемое для наборов из всех ЗНБ +++
	//В 1ю очередь выберем ЗНБ, по которым уже всё завершено
	запрос.Текст="ВЫБРАТЬ
	|	ЗНБ.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ЗНБ
	|ИЗ
	|	Документ.ЗаданиеНабора КАК ЗНБ
	|ГДЕ
	|	ЗНБ.Накладная = &Накладная
	|	И ЗНБ.Проведен
	|	И ЗНБ.Товары.КоличествоДляНаборов > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаданиеНабораТовары.Номенклатура КАК Номенклатура,
	|	ЗаданиеНабораТовары.КоличествоДляНаборов КАК КоличествоДляНаборов,
	|	ЗНБ.Ссылка КАК Ссылка,
	|	ЗНБ.Ссылка.ФормированиеНаборовЧЗЗавершено КАК ФормированиеНаборовЧЗЗавершено,
	|	ЗНБ.Ссылка.СостояниеНакладной КАК СостояниеНакладной
	|ИЗ
	|	ЗНБ КАК ЗНБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНабора.Товары КАК ЗаданиеНабораТовары
	|		ПО ЗНБ.Ссылка = ЗаданиеНабораТовары.Ссылка
	|			И (ЗаданиеНабораТовары.КоличествоДляНаборов > 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФормированиеНаборовЧЗЗавершено УБЫВ,
	|	Ссылка";	
	ТаблицаЗНБ=запрос.Выполнить().Выгрузить();	
	//Получим количество требуемое для наборов из всех ЗНБ---

	
	
	//Получим количество из всех листов ранее проведённых + переданный лист +++
	Запрос.Текст="ВЫБРАТЬ
	|	СУММА(1) КАК Количество,
	|	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец КАК Номенклатура
	|ИЗ
	|	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
	|ГДЕ
	|	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.ДокОснование = &ЗаданиеНаСборкуКомплектовЧЗ
	|	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец";
	ТаблицаНоменклатурыЛистов=запрос.Выполнить().Выгрузить();	
	//Получим количество из всех листов ранее проведённых + переданный лист ---
	
	ТекущийЗНБ=Неопределено;
	ТекущееСостояние=Неопределено;
	НужноЗаписывать=ложь;
	ВсёСошлось=Истина;
	ТекущееФормированиеНаборовЧЗЗавершено=Неопределено;
	
	Для каждого СтрокаТЗ из ТаблицаЗНБ цикл
		если ТекущийЗНБ<> СтрокаТЗ.Ссылка тогда
			если ТекущийЗНБ<>Неопределено тогда
				УстановкаСтадийРаботыСНаборамиЧЗ(ВсёСошлось, Неопределено, Накладная, ТекущееСостояние, ТекущееФормированиеНаборовЧЗЗавершено, ТекущийЗНБ);
			КонецЕсли;
			ТекущийЗНБ=СтрокаТЗ.Ссылка;
			ТекущееСостояние=СтрокаТЗ.СостояниеНакладной;
			ТекущееФормированиеНаборовЧЗЗавершено=СтрокаТЗ.ФормированиеНаборовЧЗЗавершено;
			ВсёСошлось=Истина;
			
		КонецЕсли;
		
		СтрокаЛиста=ТаблицаНоменклатурыЛистов.Найти(СтрокаТЗ.Номенклатура,"Номенклатура");
		если СтрокаЛиста=Неопределено тогда
			ВсёСошлось=Ложь;
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТЗ.КоличествоДляНаборов>СтрокаЛиста.Количество тогда
			ВсёСошлось=Ложь; 
		КонецЕсли;
		СтрокаЛиста.Количество=Макс(СтрокаЛиста.Количество-СтрокаТЗ.КоличествоДляНаборов,0);
	КонецЦикла;
	если ТекущийЗНБ<>Неопределено тогда
		УстановкаСтадийРаботыСНаборамиЧЗ(ВсёСошлось, Неопределено, Накладная, ТекущееСостояние, ТекущееФормированиеНаборовЧЗЗавершено, ТекущийЗНБ);
	КонецЕсли;	
	
	
		
КонецПроцедуры



Процедура УстановкаСтадийРаботыСНаборамиЧЗ(Знач ВсёСошлось, Знач ЛистСборкиКомплектовЧЗ, Знач Накладная, Знач ТекущееСостояние, Знач ТекущееФормированиеНаборовЧЗЗавершено, Знач ТекущийЗНБ)
	
	//Перем ЗНБОбъект, Комплектовщик, НовоеСостояние, НужноЗаписывать, СтрокаТЧ;
	
	если ВсёСошлось и не ТекущееФормированиеНаборовЧЗЗавершено тогда
		НужноЗаписывать=Истина;
	ИначеЕсли ТекущееСостояние=Перечисления.СостоянияНакладной.ОжиданиеКомплектацииЧЗ тогда
		НужноЗаписывать=Истина;
	иначе
		НужноЗаписывать=Ложь;
	КонецЕсли;
	
	если не НужноЗаписывать тогда
		Возврат;
	КонецЕсли;
	
	НомерЧасти=ПолучитьРеквизитШапки(ТекущийЗНБ,"НомерЧасти","Документ");
	
	если НужноЗаписывать тогда
		если ЛистСборкиКомплектовЧЗ=Неопределено тогда
			Комплектовщик=Справочники.ФизическиеЛица.ПустаяСсылка();
		иначе
			Комплектовщик=ПолучитьРеквизитШапки(ЛистСборкиКомплектовЧЗ,"Автор.ФизЛицо","Документ");
		КонецЕсли;
		если ВсёСошлось тогда
			//Кухарь А.Ю. 27.02.2026 начало
			//если ТекущееСостояние=Перечисления.СостоянияНакладной.ОжиданиеКомплектацииЧЗ 
			//	или ТекущееСостояние=Перечисления.СостоянияНакладной.КомплектацияЧЗ тогда
			//	НовоеСостояние=ПолучитьНовоеСостояниеЗНБ(ТекущийЗНБ,Перечисления.СостоянияНакладной.КомплектацияЧЗ);				
			//иначе
			//	ВызватьИсключение "Не корректное состояние ЗНБ для проведения комплектации набора. Текущее состояние - "+ТекущееСостояние+ ". Корректное состояние ожидание комплектации или комплектация. "+Строка(ТекущийЗНБ) ;
			//КонецЕсли;
			//ЗаполнитьКомплектовщиковЧЗПН(Накладная,НомерЧасти,Комплектовщик,ложь,НовоеСостояние);	
			если ТекущееСостояние=Перечисления.СостоянияНакладной.ОжиданиеКомплектацииЧЗ 
				или ТекущееСостояние=Перечисления.СостоянияНакладной.КомплектацияЧЗ тогда
				НовоеСостояние=ПолучитьНовоеСостояниеЗНБ(ТекущийЗНБ,Перечисления.СостоянияНакладной.КомплектацияЧЗ);				
				ЗаполнитьКомплектовщиковЧЗПН(Накладная,НомерЧасти,Комплектовщик,ложь,НовоеСостояние);
			КонецЕсли; 
			//Кухарь А.Ю.  27.02.2026 конец
		иначе
			если ТекущееСостояние=Перечисления.СостоянияНакладной.ОжиданиеКомплектацииЧЗ тогда
				ЗаполнитьКомплектовщиковЧЗПН(Накладная,НомерЧасти,Комплектовщик,Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьКомплектовщиковЧЗПН(Накладная,НомерЧасти,Комплектовщик,ЭтоНачало,Состояние=Неопределено)
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ПланНабора.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПланНабора КАК ПланНабора
	|ГДЕ
	|	ПланНабора.Проведен
	|	И ПланНабора.Накладная = &Накладная";
	запрос.УстановитьПараметр("Накладная",Накладная);
	Выборка=запрос.Выполнить().Выбрать();
	ДатаОперации=ТекущаяДата();
	ПНОбъект=Неопределено;
	пока Выборка.Следующий() цикл
		ПНОбъект=Выборка.Ссылка.ПолучитьОбъект();
		МассСтрок=ПНОбъект.тБрэндов.НайтиСтроки(Новый Структура("НомерЧасти",НомерЧасти));
		Для каждого СтрМасс из МассСтрок цикл
			если ЭтоНачало тогда
				СтрМасс.НачалоКомплектации=ДатаОперации;
				СтрМасс.Состояние=Перечисления.СостоянияНакладной.КомплектацияЧЗ;
				СтрМасс.Комплектовщик=Комплектовщик;
			Иначе
				СтрМасс.ОкончаниеКомплектации=ДатаОперации;
				если Состояние<>Неопределено тогда
					СтрМасс.Состояние=Состояние;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	если ПНОбъект<>Неопределено тогда
		ПНОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
КонецПроцедуры 
// Кухарь А.Ю.  11.11.2024 конец

// Кельманов А.В. - ASU-2094 - 2025.03.13
Функция ПолучитьЛистМаркировкиДляЗНБ(ЗНБ) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаданиеНабора.ЗНМ КАК ЗНМ,
	               |	ЛистМаркировки.Ссылка КАК ЛМ
	               |ИЗ
	               |	Документ.ЗаданиеНабора КАК ЗаданиеНабора
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистМаркировки КАК ЛистМаркировки
	               |		ПО ЗаданиеНабора.ЗНМ = ЛистМаркировки.ДокОснование
	               |ГДЕ
	               |	ЗаданиеНабора.Ссылка = &ЗНБ
	               |	И НЕ ЗаданиеНабора.Склад.ЭтоСкладМаркированногоТовара
	               |	И ЗаданиеНабора.ЗНМ.Проведен
	               |	И ЛистМаркировки.Проведен";
	
	Запрос.УстановитьПараметр("ЗНБ", ЗНБ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.ЛМ;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Кельманов А.В. - ASU-2094 - 2025.03.13
Функция СоздатьЗНМ_И_ЛМ(ЗНБ, Накладная) Экспорт
	
	Ошибки = "";
	
	МассивОшибокНехваткиКодов = Новый Массив;
	
	// Кельманов А.В. - Исправление ошибки - 2025.12.25 {
	//Если ЗначениеЗаполнено(ЗНБ.ЗНМ) Тогда
	ЛМ = ПолучитьЛистМаркировкиДляЗНБ(ЗНБ);		

	Если ЗначениеЗаполнено(ЛМ) Тогда
		
		Возврат Ошибки;
		
	КонецЕсли;
	// Кельманов А.В. - Исправление ошибки - 2025.12.25 }
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаданиеНабораТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(ЗаданиеНабораТовары.Количество) КАК Количество,
	               |	ЗаданиеНабораТовары.Номенклатура.ОсновнаяЕдиница КАК Единица,
	               |	ЗаданиеНабораТовары.Номенклатура.Коэффициент КАК Коэффициент
	               |ИЗ
	               |	Документ.ЗаданиеНабора.Товары КАК ЗаданиеНабораТовары
	               |ГДЕ
	               |	ЗаданиеНабораТовары.ТребуетсяМаркировка
	               |	И ЗаданиеНабораТовары.Ссылка = &ЗНБ
	               |	И ЗаданиеНабораТовары.Ссылка.Проведен
	               |	И ЗаданиеНабораТовары.Ссылка.Дата >= &Дата
				   // Кельманов А.В. - Исправление ошибки - 2025.03.20 {
	               |	И НЕ ЗаданиеНабораТовары.Номенклатура.ОтгрузкаТолькоЧерезЧЗ
				   // Кельманов А.В. - Исправление ошибки - 2025.03.20 }
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаданиеНабораТовары.Номенклатура,
	               |	ЗаданиеНабораТовары.Номенклатура.ОсновнаяЕдиница,
				   // Кельманов А.В. - HELP-8430 - 2026.01.03 {
				   //|	ЗаданиеНабораТовары.Номенклатура.Коэффициент";
	               |	ЗаданиеНабораТовары.Номенклатура.Коэффициент
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(ЗаданиеНабораТовары.Количество) > 0";
				   // Кельманов А.В. - HELP-8430 - 2026.01.03 }
	
	Запрос.УстановитьПараметр("ЗНБ", ЗНБ);
	Запрос.УстановитьПараметр("Дата", Константы.ДатаЗапретаРедактирования.Получить());
	
	ТаблицаТовары = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаТовары.Количество() = 0 Тогда
		
		Возврат Ошибки;
		
	КонецЕсли;
	
	// Кельманов А.В. - оптимизация работы - 2025.04.02 {
	//НачатьТранзакцию();
	// Кельманов А.В. - оптимизация работы - 2025.04.02 }
	
	// Кельманов А.В. - Исправление ошибки - 2025.12.25 {
	//ЗНМОбъект = Документы.ЗаданиеНаМаркировку.СоздатьДокумент();
	ЗНМСсылка = ЗНБ.ЗНМ;
	
	Если ЗначениеЗаполнено(ЗНМСсылка) Тогда

		РегистрыСведений.СтатусыКМ_Факт.ОчиститьДвижения(ЗНМСсылка);
		
		ЗНМОбъект = ЗНМСсылка.ПолучитьОбъект();
		ЗНМОбъект.Товары.Очистить();
		ЗНМОбъект.ШтрихкодыУпаковок.Очистить();
		
	Иначе
		
		ЗНМОбъект = Документы.ЗаданиеНаМаркировку.СоздатьДокумент();
		
	КонецЕсли;
	// Кельманов А.В. - Исправление ошибки - 2025.12.25 }
		
	ЗаполнитьШапкуДокумента(ЗНМОбъект, ПараметрыСеанса.Пользователь);
	
	ЗНМОбъект.Автор = ПараметрыСеанса.Пользователь;
	ЗНМОбъект.Дата = ТекущаяДатаСеанса();
	ЗНМОбъект.ДокОснование = Накладная;
	ЗНМОбъект.Подразделение = ПараметрыСеанса.ЭтотУзел.Подразделение; // Кельманов А.В. - в некоторых случаях не получается создать документ, т.к. у пользователя не заполнено подразделение - 2025.03.26
		
	ЗНМОбъект.Товары.Загрузить(ТаблицаТовары);
	
	// Кельманов А.В. - оптимизация работы - 2025.04.02 {
	//Для Каждого СтрТовары Из ЗНМОбъект.Товары Цикл
	//	
	//	рПолучения = МаркировкаС.ПолучитьСвободныеКодыШтук(СтрТовары.Номенклатура, СтрТовары.Количество, ЗНМОбъект.Подразделение);
	//	
	//	Если рПолучения.Успешно Тогда
	//		
	//		Для Каждого ШтрихКодУпаковки Из рПолучения.Данные Цикл
	//			
	//			СтрШтрихкодыУпаковок = ЗНМОбъект.ШтрихкодыУпаковок.Добавить();
	//			
	//			СтрШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихКодУпаковки;

	//		КонецЦикла;		
	//		
	//	Иначе
	//		
	//		ОшибкиПолученияКодов = СтрСоединить(рПолучения.Ошибки, Символы.ПС);
	//		
	//		КодНоменклатуры = ПолучитьРеквизитШапки(СтрТовары.Номенклатура, "Код");
	//		
	//		Ошибки = Ошибки + "Номенклатура: " + СтрТовары.Номенклатура + " (" + КодНоменклатуры + ") " + ОшибкиПолученияКодов + Символы.ПС;
	//		
	//		ТекстСообщения = СтрШаблон(
	//		"Недостаточно кодов ЧЗ по ном.: %1 (%2). 
	//		|ЗНБ: %3, Накладная: %4 !", 
	//		СтрТовары.Номенклатура, КодНоменклатуры, ЗНБ, Накладная
	//		);
	//		
	//		ТекстСообщения = ТекстСообщения + "
	//		|" + ОшибкиПолученияКодов;
	//		
	//		МассивОшибокНехваткиКодов.Добавить(ТекстСообщения);
	//		
	//	КонецЕсли;	
	//	
	//КонецЦикла;
	ЗНМОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	// Кельманов А.В. - HELP-8430 - 2026.01.03 {
	//ДопПараметры = Новый Структура("Статус, ТипКода, Местонахождение, Добавлять",
	//Перечисления.СтатусыКодовМаркировкиФакт.ГотовКПечати, Перечисления.ТипыКодовМаркировки.Товар, ЗНМОбъект.Подразделение, Истина);
	ДопПараметры = Новый Структура("Статус, Местонахождение, Добавлять",
	Перечисления.СтатусыКодовМаркировкиФакт.ГотовКПечати, ЗНМОбъект.Подразделение, Истина);
	// Кельманов А.В. - HELP-8430 - 2026.01.03 }
	
	рПолучения = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыШтук(ТаблицаТовары, ЗНМОбъект.Ссылка, ДопПараметры);		
	
	Если рПолучения.Успешно Тогда
		
		// Кельманов А.В. - Исправление ошибки - 2025.05.08 {
		//Для Каждого ШтрихКодУпаковки Из рПолучения.Данные Цикл
		//	
		//	СтрШтрихкодыУпаковок = ЗНМОбъект.ШтрихкодыУпаковок.Добавить();
		//	
		//	СтрШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихКодУпаковки;
		//	
		//КонецЦикла;		
		Для Каждого СтрокаДанных Из рПолучения.Данные Цикл
			
			Для Каждого ШтрихкодУпаковки Из СтрокаДанных.Значение Цикл
				
				СтрШтрихкодыУпаковок = ЗНМОбъект.ШтрихкодыУпаковок.Добавить();
				
				СтрШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодУпаковки;
				
			КонецЦикла;		
			
		КонецЦикла;		
		// Кельманов А.В. - Исправление ошибки - 2025.05.08 }
		
		ЗНМОбъект.Записать(РежимЗаписиДокумента.Запись);
		
	Иначе
		
		РегистрыСведений.СтатусыКМ_Факт.ОчиститьДвижения(ЗНМОбъект.Ссылка); // Кельманов А.В. - Исправление ошибки - 2025.06.24
		
		ОшибкиПолученияКодов = СтрСоединить(рПолучения.Ошибки, Символы.ПС);
		
		Ошибки = Ошибки + ОшибкиПолученияКодов + Символы.ПС;
		
		ТекстСообщения = СтрШаблон(
		"Недостаточно кодов ЧЗ для ЗНБ: %1, Накладная: %2 !", ЗНБ, Накладная
		);
		
		ТекстСообщения = ТекстСообщения + "
		|" + ОшибкиПолученияКодов;
		
		МассивОшибокНехваткиКодов.Добавить(ТекстСообщения);
		
	КонецЕсли;	
	// Кельманов А.В. - оптимизация работы - 2025.04.02 }
	
	Если Не ЗначениеЗаполнено(Ошибки) Тогда
		
		// Кельманов А.В. - оптимизация работы - 2025.04.02 {
		//Попытка
		//	
		//	ЗНМОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//	
		//	ЗНБОбъект = ЗНБ.ПолучитьОбъект();		
		//	ЗНБОбъект.ЗНМ = ЗНМОбъект.Ссылка;		
		//	ЗНБОбъект.Записать();
		//	
		//	ЛМОбъект = Документы.ЛистМаркировки.СоздатьДокумент();
		//	
		//	ЗаполнитьШапкуДокумента(ЛМОбъект, ПараметрыСеанса.Пользователь);
		//	
		//	ЛМОбъект.Автор = ПараметрыСеанса.Пользователь;
		//	ЛМОбъект.Дата = ТекущаяДатаСеанса();
		//	ЛМОбъект.ДокОснование = ЗНМОбъект.Ссылка;
		//	ЛМОбъект.Подразделение = ПараметрыСеанса.ЭтотУзел.Подразделение; // Кельманов А.В. - в некоторых случаях не получается создать документ, т.к. у пользователя не заполнено подразделение - 2025.03.26
		//	
		//	Для Каждого Стр Из ЗНМОбъект.ШтрихкодыУпаковок Цикл
		//		
		//		СтрШтрихкодыУпаковок = ЛМОбъект.ШтрихкодыУпаковок.Добавить();
		//		
		//		СтрШтрихкодыУпаковок.ШтрихкодУпаковки = Стр.ШтрихКодУпаковки;

		//	КонецЦикла;
		//	
		//	ЛМОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//	
		//Исключение
		//	
		//	Ошибки = Ошибки + ОписаниеОшибки() + Символы.ПС;
		//	
		//КонецПопытки;
		ЗНБОбъект = ЗНБ.ПолучитьОбъект();		
		ЗНБОбъект.ЗНМ = ЗНМОбъект.Ссылка;		
		ЗНБОбъект.Записать();
		
		ЛМОбъект = Документы.ЛистМаркировки.СоздатьДокумент();
		
		ЗаполнитьШапкуДокумента(ЛМОбъект, ПараметрыСеанса.Пользователь);
		
		ЛМОбъект.Автор = ПараметрыСеанса.Пользователь;
		
		// Кельманов А.В. - Исправление ошибки - 2025.12.25 {
		//ЛМОбъект.Дата = ТекущаяДатаСеанса();
		ЛМОбъект.Дата = ТекущаяДатаСеанса() + 1;
		// Кельманов А.В. - Исправление ошибки - 2025.12.25 }
		
		ЛМОбъект.ДокОснование = ЗНМОбъект.Ссылка;
		ЛМОбъект.Подразделение = ПараметрыСеанса.ЭтотУзел.Подразделение; // Кельманов А.В. - в некоторых случаях не получается создать документ, т.к. у пользователя не заполнено подразделение - 2025.03.26
		
		Для Каждого Стр Из ЗНМОбъект.ШтрихкодыУпаковок Цикл
			
			СтрШтрихкодыУпаковок = ЛМОбъект.ШтрихкодыУпаковок.Добавить();
			
			СтрШтрихкодыУпаковок.ШтрихкодУпаковки = Стр.ШтрихКодУпаковки;
			
		КонецЦикла;
		
		ЛМОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	Иначе
				
		Для Каждого ТекстСообщения Из МассивОшибокНехваткиКодов Цикл
			
			ЗаписатьВЛог("Нехватка КМ", ТекстСообщения, "Ошибка");
			
		КонецЦикла;
		// Кельманов А.В. - оптимизация работы - 2025.04.02 }
		
	КонецЕсли;
	
	// Кельманов А.В. - оптимизация работы - 2025.04.02 {
	//Если ЗначениеЗаполнено(Ошибки) Тогда
	//	
	//	Если ТранзакцияАктивна() Тогда
	//		ОтменитьТранзакцию();		
	//	КонецЕсли;
	//	
	//	Для Каждого ТекстСообщения Из МассивОшибокНехваткиКодов Цикл
	//		
	//		ЗаписатьВЛог("Нехватка КМ", ТекстСообщения, "Ошибка");
	//		
	//	КонецЦикла;
	//	
	//Иначе
	//	
	//	ЗафиксироватьТранзакцию();
	//	
	//КонецЕсли;
	// Кельманов А.В. - оптимизация работы - 2025.04.02 }
	
	Возврат СокрЛП(Ошибки);
	
КонецФункции
