#Область СлужебныеПроцедурыИФункции
#Область МетодыHTTP 
Функция ОтветlistFactoriesGET(Знач Запрос) Экспорт 
	
	Ответ = Новый HTTPСервисОтвет(200); 	
	//Заголовки 
	ЗаголовкиСоответствие 	= Запрос.заголовки;  
	ПараметрыЗапроса 		= Запрос.ПараметрыЗапроса; //после знака ? 
	
	Лимит 				= неопределено; 
	НомерСтраницы 		= неопределено; 
	
	Если ПараметрыЗапроса.Получить("limit") <> неопределено Тогда
		
		Лимит = Число(ПараметрыЗапроса.Получить("limit"));  	
		
	КонецЕсли;
	
	Если ПараметрыЗапроса.Получить("page") <> неопределено Тогда
		
		номерСтраницы = Число(ПараметрыЗапроса.Получить("page"));  	
		
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура; 	
	ПараметрыОтбора.Вставить("Лимит",Лимит);
	ПараметрыОтбора.Вставить("номерСтраницы",номерСтраницы);
	ИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор);
	
	ЗаписатьВходящиеДанныеЗапросаИсторияЗапросовФабрики(ИдентификаторЗапроса,ПараметрыЗапроса,Новый Структура); 
	
	СтруктураОтвета = ПолучитьДанныеПоФабрикам(ИдентификаторЗапроса,ПараметрыОтбора); 	
	
	СтрокаJSON = b2b_ОбменЗаявками.ОтработатьЗаполненнуюСтруктуруОтвета(СтруктураОтвета);
	
	Ответ  = СформироватьОтветApplicationFactory(200,СтрокаJSON,""); 
	
	ЗаписатьИсходящиеДанныеИсторияЗапросаФабрики(ИдентификаторЗапроса,СтруктураОтвета,200); 
	
	Возврат Ответ;

	
КонецФункции // ОтветlistFactoriesGET()

Функция ОтветlistOrdersPOST(Знач Запрос) Экспорт 

	Ответ = Новый HTTPСервисОтвет(200);
	
	ЗаголовкиСоответствие 	= Запрос.заголовки;  
	ПараметрыЗапроса 		= Запрос.ПараметрыЗапроса; //после знака ? 
	ТекстТела 				= Запрос.ПолучитьТелоКакСтроку();
	Если ЗначениеЗаполнено(ТекстТела) Тогда 	
		СтруктураJSONЗапроса = ПрочитатьТелоЗапросаВСтруктуру(ТекстТела); 
	Иначе 
		СтруктураJSONЗапроса = Новый Структура; 
	КонецЕсли;	
	ОтборПоКонтрагенту 	= неопределено;
	Лимит 				= неопределено; 
	НомерСтраницы 		= неопределено;
	ТипДокумента 		= неопределено;
	//++Данилова Е.В. 13.03.2026 MARK-3512 
	ТипЗаказа 			= Неопределено; 
	//--Данилова Е.В. 13.03.2026 
	Если ТипЗнч(СтруктураJSONЗапроса) = Тип("Структура") 
		И СтруктураJSONЗапроса.Свойство("factoryId") Тогда
		
		ГУИД = Новый УникальныйИдентификатор(СтруктураJSONЗапроса.factoryId);
		
		УстановитьПривилегированныйРежим(Истина);
		ОтборПоКонтрагенту = Справочники.Контрагенты.ПолучитьСсылку(ГУИД); 
		
		Если ОтборПоКонтрагенту.ПолучитьОбъект() = неопределено Тогда
		
			ОтборПоКонтрагенту = неопределено; 	
		
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Если ТипЗнч(СтруктураJSONЗапроса) = Тип("Структура") 
		И СтруктураJSONЗапроса.Свойство("limit") Тогда
		
		Лимит = СтруктураJSONЗапроса.limit;  	
		
	КонецЕсли;
	
	Если ТипЗнч(СтруктураJSONЗапроса) = Тип("Структура") 
		И СтруктураJSONЗапроса.Свойство("page") Тогда
		
		номерСтраницы = СтруктураJSONЗапроса.page;  	
		
	КонецЕсли;
	
	Если ТипЗнч(СтруктураJSONЗапроса) = Тип("Структура") 
		И СтруктураJSONЗапроса.Свойство("typedoc") Тогда
		
		ТипДокумента = СтруктураJSONЗапроса.typedoc;  	
		
	КонецЕсли;
	
	//++Данилова Е.В. 13.03.2026 MARK-3512
	Если ТипЗнч(СтруктураJSONЗапроса) = Тип("Структура") 
		И СтруктураJSONЗапроса.Свойство("type_order") Тогда
		
		ТипЗаказа = СтруктураJSONЗапроса.type_order;  	
		
	КонецЕсли;
	//--Данилова Е.В. 13.03.2026 
	
	ПараметрыОтбора = Новый Структура; 
	ПараметрыОтбора.Вставить("ОтборПоКонтрагенту",ОтборПоКонтрагенту);
	ПараметрыОтбора.Вставить("Лимит",Лимит);
	ПараметрыОтбора.Вставить("номерСтраницы",номерСтраницы);
	ПараметрыОтбора.Вставить("ТипДокумента",ТипДокумента);
	//++Данилова Е.В. 13.03.2026 MARK-3512
	ПараметрыОтбора.Вставить("ТипЗаказа",ТипЗаказа);
	//--Данилова Е.В. 13.03.2026 
	//////////здесь проверка параметров , которые пришли 
	
	ИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор);
	
	ЗаписатьВходящиеДанныеЗапросаИсторияЗапросовФабрики(ИдентификаторЗапроса,ПараметрыЗапроса,СтруктураJSONЗапроса);
	
	СтруктураОтвета = ПолучитьСписокЗПС(ИдентификаторЗапроса,ПараметрыОтбора); 
	
	СтрокаJSON = b2b_ОбменЗаявками.ОтработатьЗаполненнуюСтруктуруОтвета(СтруктураОтвета);
	
	Ответ  = СформироватьОтветApplicationFactory(200,СтрокаJSON,""); 
	
	ЗаписатьИсходящиеДанныеИсторияЗапросаФабрики(ИдентификаторЗапроса,СтруктураОтвета,200);
			
	Возврат Ответ;
	

КонецФункции // ОтветlistOrdersPOST()

Функция ОтветlistProductsPOST(Знач Запрос) Экспорт 

	Ответ = Новый HTTPСервисОтвет(200);
	
	ЗаголовкиСоответствие 	= Запрос.заголовки;  
	ПараметрыЗапроса 		= Запрос.ПараметрыЗапроса; //после знака ? 
	ТекстТела 				= Запрос.ПолучитьТелоКакСтроку();
	
	
	СтруктураJSONЗапроса = ПрочитатьТелоЗапросаВСтруктуру(ТекстТела);
	  
	
	ИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор);
	ЗаписатьВходящиеДанныеЗапросаИсторияЗапросовФабрики(ИдентификаторЗапроса,ПараметрыЗапроса,СтруктураJSONЗапроса);
	
	РезультатОбработки = ОбработатьСтруктуруЗапросаПоIDЗПС(СтруктураJSONЗапроса,ИдентификаторЗапроса); 
	
	Если ТипЗнч(РезультатОбработки) = Тип("HTTPСервисОтвет") Тогда
		
		Возврат РезультатОбработки; 
		
	ИначеЕсли ТипЗнч(РезультатОбработки) = Тип("Массив") тогда 
		
		МассивЗПС = РезультатОбработки; 
		
	Иначе
		ОтветОшибка = Новый Структура; 
		ОтветОшибка.Вставить("error","Неизвестная ошибка обработки запроса!!!"); 
		
		ОтветОшибкаJSON = b2b_ОбменЗаявками.ОтработатьЗаполненнуюСтруктуруОтвета(ОтветОшибка);
		
		Возврат СформироватьОтветApplicationFactory(400,ОтветОшибкаJSON,"Unknown error!!!"); 
		
	КонецЕсли;
	
	 
	СтруктураОтвета = ПолучитьСписокТоваровПоЗПС(ИдентификаторЗапроса,МассивЗПС);
	
	СтрокаJSON = b2b_ОбменЗаявками.ОтработатьЗаполненнуюСтруктуруОтвета(СтруктураОтвета);
	
	Ответ  = СформироватьОтветApplicationFactory(200,СтрокаJSON,""); 
	
	ЗаписатьИсходящиеДанныеИсторияЗапросаФабрики(ИдентификаторЗапроса,СтруктураОтвета,200);
	
	///ПроставитьОтправкуМарокПоЗПСВФоне(МассивЗПС);  в какой момент непонятно... 
	
	Возврат Ответ;
	

КонецФункции // listProductsPOST()

Функция ОтветlistMarkesPOST(Знач Запрос) Экспорт

	Ответ = Новый HTTPСервисОтвет(200);
	
	ЗаголовкиСоответствие 	= Запрос.заголовки;  
	ПараметрыЗапроса 		= Запрос.ПараметрыЗапроса; //после знака ? 
	ТекстТела 				= Запрос.ПолучитьТелоКакСтроку();
	
	
	СтруктураJSONЗапроса = ПрочитатьТелоЗапросаВСтруктуру(ТекстТела);
	  
	
	ИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор);
	ЗаписатьВходящиеДанныеЗапросаИсторияЗапросовФабрики(ИдентификаторЗапроса,ПараметрыЗапроса,СтруктураJSONЗапроса);
	
	РезультатОбработки = ОбработатьСтруктуруЗапросаПоIDЗПС(СтруктураJSONЗапроса,ИдентификаторЗапроса); 
	
	МассивЗПС = Новый Массив; 
	
	Если ТипЗнч(РезультатОбработки) = Тип("HTTPСервисОтвет") Тогда
		
		Возврат РезультатОбработки; 
		
	ИначеЕсли ТипЗнч(РезультатОбработки) = Тип("Массив") тогда 
		
		МассивЗПС = РезультатОбработки; 
		
	Иначе
		ОтветОшибка = Новый Структура; 
		ОтветОшибка.Вставить("error","Неизвестная ошибка обработки запроса!!!"); 
		
		ОтветОшибкаJSON = b2b_ОбменЗаявками.ОтработатьЗаполненнуюСтруктуруОтвета(ОтветОшибка);
		
		Возврат СформироватьОтветApplicationFactory(400,ОтветОшибкаJSON,"Unknown error!!!"); 
		
	КонецЕсли;  
	
	Лимит 				= неопределено; 
	НомерСтраницы 		= неопределено;

	Если ТипЗнч(СтруктураJSONЗапроса) = Тип("Структура") 
		И СтруктураJSONЗапроса.Свойство("limit") Тогда
		
		Лимит = СтруктураJSONЗапроса.limit;  	
		
	КонецЕсли;
	
	Если ТипЗнч(СтруктураJSONЗапроса) = Тип("Структура") 
		И СтруктураJSONЗапроса.Свойство("page") Тогда
		
		номерСтраницы = СтруктураJSONЗапроса.page;  	
		
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура; 
	ПараметрыОтбора.Вставить("Лимит",Лимит);
	ПараметрыОтбора.Вставить("номерСтраницы",номерСтраницы);
	ПараметрыОтбора.Вставить("МассивЗПС",МассивЗПС);

    СтруктураОтвета = ПолучитьСписокМарокПоЗПС(ИдентификаторЗапроса,ПараметрыОтбора);
	
	СтрокаJSON = b2b_ОбменЗаявками.ОтработатьЗаполненнуюСтруктуруОтвета(СтруктураОтвета);
	
	Ответ  = СформироватьОтветApplicationFactory(200,СтрокаJSON,""); 
	
	ЗаписатьИсходящиеДанныеИсторияЗапросаФабрики(ИдентификаторЗапроса,СтруктураОтвета,200);
	
	//ПроставитьОтправкуМарокПоЗПСВФоне(МассивЗПС);  ???? 
	
	Возврат Ответ;

КонецФункции // ()

Функция ОтветlistBoxPOST(Знач Запрос) Экспорт

	Ответ = Новый HTTPСервисОтвет(200);
	
	ЗаголовкиСоответствие 	= Запрос.заголовки;  
	ПараметрыЗапроса 		= Запрос.ПараметрыЗапроса; //после знака ? 
	ТекстТела 				= Запрос.ПолучитьТелоКакСтроку();
	
	
	СтруктураJSONЗапроса = ПрочитатьТелоЗапросаВСтруктуру(ТекстТела);
	  
	
	ИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор);
	ЗаписатьВходящиеДанныеЗапросаИсторияЗапросовФабрики(ИдентификаторЗапроса,ПараметрыЗапроса,СтруктураJSONЗапроса);
	
	РезультатОбработки = ОбработатьСтруктуруЗапросаПоIDЗПС(СтруктураJSONЗапроса,ИдентификаторЗапроса); 
	
	МассивЗПС = Новый Массив; 
	
	Если ТипЗнч(РезультатОбработки) = Тип("HTTPСервисОтвет") Тогда
		
		Возврат РезультатОбработки; 
		
	ИначеЕсли ТипЗнч(РезультатОбработки) = Тип("Массив") тогда 
		
		МассивЗПС = РезультатОбработки; 
		
	Иначе
		ОтветОшибка = Новый Структура; 
		ОтветОшибка.Вставить("error","Неизвестная ошибка обработки запроса!!!"); 
		
		ОтветОшибкаJSON = b2b_ОбменЗаявками.ОтработатьЗаполненнуюСтруктуруОтвета(ОтветОшибка);
		
		Возврат СформироватьОтветApplicationFactory(400,ОтветОшибкаJSON,"Unknown error!!!"); 
		
	КонецЕсли;  
	
	Лимит 				= неопределено; 
	НомерСтраницы 		= неопределено;

	Если ТипЗнч(СтруктураJSONЗапроса) = Тип("Структура") 
		И СтруктураJSONЗапроса.Свойство("limit") Тогда
		
		Лимит = СтруктураJSONЗапроса.limit;  	
		
	КонецЕсли;
	
	Если ТипЗнч(СтруктураJSONЗапроса) = Тип("Структура") 
		И СтруктураJSONЗапроса.Свойство("page") Тогда
		
		номерСтраницы = СтруктураJSONЗапроса.page;  	
		
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура; 
	ПараметрыОтбора.Вставить("Лимит",Лимит);
	ПараметрыОтбора.Вставить("номерСтраницы",номерСтраницы);
	ПараметрыОтбора.Вставить("МассивЗПС",МассивЗПС);

    СтруктураОтвета = ПолучитьСписокКоробокПоЗПС(ИдентификаторЗапроса,ПараметрыОтбора);
	
	СтрокаJSON = b2b_ОбменЗаявками.ОтработатьЗаполненнуюСтруктуруОтвета(СтруктураОтвета);
	
	Ответ  = СформироватьОтветApplicationFactory(200,СтрокаJSON,""); 
	
	ЗаписатьИсходящиеДанныеИсторияЗапросаФабрики(ИдентификаторЗапроса,СтруктураОтвета,200);
	
	//ПроставитьОтправкуМарокПоЗПСВФоне(МассивЗПС); 
	
	Возврат Ответ;


КонецФункции 

Функция ОбработатьСтруктуруЗапросаПоIDЗПС(СтруктураJSONЗапроса,ИдентификаторЗапроса)

	МассивЗПС = Новый Массив;
	МассивОшибок = Новый Массив; 
	
	Если ТипЗнч(СтруктураJSONЗапроса) = Тип("Структура") 
		И СтруктураJSONЗапроса.Свойство("orderId") Тогда
		
		Если ТипЗнч(СтруктураJSONЗапроса.orderId) = Тип("Строка") Тогда
			
			ГУИД = Новый УникальныйИдентификатор(СтруктураJSONЗапроса.orderId);
			УстановитьПривилегированныйРежим(Истина); 	
			ЗаказПоставщику = Документы.ЗаказПоставщику.ПолучитьСсылку(ГУИД);		
			Если  ЗаказПоставщику.ПолучитьОбъект() = неопределено Тогда
				ЗаказПоставщику = Документы.КонтрактСПроизводителем.ПолучитьСсылку(ГУИД); 
				Если  ЗаказПоставщику.ПолучитьОбъект() = неопределено Тогда
					УстановитьПривилегированныйРежим(Ложь);
					ОтветОшибка = Новый Структура; 
					ОтветОшибка.Вставить("error","Не найден ЗПС по orderId (ID ЗПС)" + СтруктураJSONЗапроса.orderId);
					
					СтрокаJSON = b2b_ОбменЗаявками.ОтработатьЗаполненнуюСтруктуруОтвета(ОтветОшибка);
					
					Ответ400 =  СформироватьОтветApplicationFactory(400,СтрокаJSON,"No order found for orderId (ID order)" + СтруктураJSONЗапроса.orderId);					 
					
					ЗаписатьИсходящиеДанныеИсторияЗапросаФабрики(ИдентификаторЗапроса,ОтветОшибка,400);
					
					Возврат Ответ400;
				Иначе 
					МассивЗПС.Добавить(ЗаказПоставщику); 
					
					УстановитьПривилегированныйРежим(Ложь);
				КонецЕсли; 
			Иначе 
				
				МассивЗПС.Добавить(ЗаказПоставщику); 
				
				УстановитьПривилегированныйРежим(Ложь);

			КонецЕсли;
		ИначеЕсли ТипЗнч(СтруктураJSONЗапроса.orderId) = Тип("Массив") Тогда
			
			Для каждого ЭлементМассиваorderId Из СтруктураJSONЗапроса.orderId Цикл
				
				ГУИД = Новый УникальныйИдентификатор(ЭлементМассиваorderId);
				УстановитьПривилегированныйРежим(Истина);
				ЗаказПоставщику = Документы.ЗаказПоставщику.ПолучитьСсылку(ГУИД);	
				Если   ЗаказПоставщику.ПолучитьОбъект() = неопределено Тогда
					ЗаказПоставщику = Документы.КонтрактСПроизводителем.ПолучитьСсылку(ГУИД); 
					Если ЗаказПоставщику.ПолучитьОбъект() = неопределено Тогда
						МассивОшибок.Добавить("No order found for orderId orderId (ID order)" + СтруктураJSONЗапроса.orderId);
					Иначе 
						МассивЗПС.Добавить(ЗаказПоставщику);
					КонецЕсли;
				Иначе 
					МассивЗПС.Добавить(ЗаказПоставщику);
				КонецЕсли; 
				
				УстановитьПривилегированныйРежим(Ложь);
				
			КонецЦикла;
			
		Иначе
			
			ОтветОшибка = Новый Структура; 
			ОтветОшибка.Вставить("error","Неверные параметры запроса, неизвестного типа orderId (ID ЗПС)");
			
			СтрокаJSON = b2b_ОбменЗаявками.ОтработатьЗаполненнуюСтруктуруОтвета(ОтветОшибка);
			
			Ответ400 =  СформироватьОтветApplicationFactory(400,СтрокаJSON,"Invalid request parameter orderId (ID order)");			 
			
			ЗаписатьИсходящиеДанныеИсторияЗапросаФабрики(ИдентификаторЗапроса,ОтветОшибка,400);
			
			Возврат Ответ400;
		КонецЕсли;
		
	Иначе 
		
		ОтветОшибка = Новый Структура; 
		ОтветОшибка.Вставить("error","Неверные параметры запроса, не найден orderId (ID ЗПС)");
		
		СтрокаJSON = b2b_ОбменЗаявками.ОтработатьЗаполненнуюСтруктуруОтвета(ОтветОшибка);
		
		Ответ400 =  СформироватьОтветApplicationFactory(400,СтрокаJSON,"Invalid request parameters, not found orderId (ID order)");		 
		
		ЗаписатьИсходящиеДанныеИсторияЗапросаФабрики(ИдентификаторЗапроса,ОтветОшибка,400);
		
		Возврат Ответ400; 
	КонецЕсли;
	
	Если МассивЗПС.Количество() = 0  Тогда
		
		ОтветОшибка = Новый Структура; 
		ОтветОшибка.Вставить("error",СтрСоединить(МассивОшибок,",")); 	
		
		ОтветОшибкаJSON = b2b_ОбменЗаявками.ОтработатьЗаполненнуюСтруктуруОтвета(ОтветОшибка);
		
		Ответ400 =  СформироватьОтветApplicationFactory(400,ОтветОшибкаJSON,"Not found orders");
		
		ЗаписатьИсходящиеДанныеИсторияЗапросаФабрики(ИдентификаторЗапроса,ОтветОшибка,400);
		
		Возврат Ответ400; 
		
	КонецЕсли;
	
   Возврат МассивЗПС; 

КонецФункции // ОбработатьСтруктуруЗапросаПоIDЗПС()


#КонецОбласти

 #Область ОбменСПриложениемФабрики
 
Функция ПолучитьДанныеПоФабрикам(Знач Идентификатор,ПараметрыОтбора)  Экспорт
    УстановитьПривилегированныйРежим(Истина); 
	
	ДанныеОтвета =  СтруктураДанныеФабрик(Идентификатор); 
	ДанныеОтвета.id = Идентификатор; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК ссылка,
		|	Контрагенты.Код КАК Код,
		|	Контрагенты.Наименование КАК Наименование,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказПоставщику.Ссылка) КАК КоличествоЗПС, 
		//++Данилова Е.В. 13.03.2026 MARK-3512 
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КонтрактСПроизводителем.Ссылка) КАК КоличествоКП
		//--Данилова Е.В. 13.03.2026 
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|		ПО (ЗаказПоставщику.Контрагент = Контрагенты.Ссылка)
		|			И (ЗаказПоставщику.Проведен)
		|			И (ЗаказПоставщику.СостояниеПроверкиМарокНаТСД = ЗНАЧЕНИЕ(Перечисление.СостоянияПроверкиМарокНаТСД.ТребуетсяОтправитьМарки)
		//++Данилова Е.В. 21.04.2026 правка по письму 
		|				ИЛИ ЗаказПоставщику.ОтложенноеЗаполнениеТСД)
		//--Данилова Е.В. 21.04.2026 
		//++Данилова Е.В. 13.03.2026 MARK-3512
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтрактСПроизводителем КАК КонтрактСПроизводителем
		|		ПО (КонтрактСПроизводителем.Контрагент = Контрагенты.Ссылка)
		|			И (КонтрактСПроизводителем.Проведен)
		|			И (КонтрактСПроизводителем.СостояниеПроверкиМарокНаТСД = ЗНАЧЕНИЕ(Перечисление.СостоянияПроверкиМарокНаТСД.ТребуетсяОтправитьМарки)) 
	    //--Данилова Е.В. 13.03.2026 
		|ГДЕ
		|	Контрагенты.ВыгружатьМаркиЗПСДляТСД
		|
		|СГРУППИРОВАТЬ ПО
		|	Контрагенты.Ссылка,
		|	Контрагенты.Код,
		|	Контрагенты.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	
	Если ЗначениеЗаполнено(ПараметрыОтбора.Лимит)
		И НЕ ЗначениеЗаполнено(ПараметрыОтбора.номерСтраницы) Тогда
		              
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ %Лимит%
		|	Контрагенты.Ссылка КАК ссылка,
		|	Контрагенты.Код КАК Код,
		|	Контрагенты.Наименование КАК Наименование,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказПоставщику.Ссылка) КАК КоличествоЗПС,
		//++Данилова Е.В. 13.03.2026 MARK-3512 
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КонтрактСПроизводителем.Ссылка) КАК КоличествоКП
		//--Данилова Е.В. 13.03.2026
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|		ПО (ЗаказПоставщику.Контрагент = Контрагенты.Ссылка)
		|			И (ЗаказПоставщику.Проведен)
		|			И (ЗаказПоставщику.СостояниеПроверкиМарокНаТСД = ЗНАЧЕНИЕ(Перечисление.СостоянияПроверкиМарокНаТСД.ТребуетсяОтправитьМарки))
		//++Данилова Е.В. 13.03.2026 MARK-3512
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтрактСПроизводителем КАК КонтрактСПроизводителем
		|		ПО (КонтрактСПроизводителем.Контрагент = Контрагенты.Ссылка)
		|			И (КонтрактСПроизводителем.Проведен)
		|			И (КонтрактСПроизводителем.СостояниеПроверкиМарокНаТСД = ЗНАЧЕНИЕ(Перечисление.СостоянияПроверкиМарокНаТСД.ТребуетсяОтправитьМарки)) 
	    //--Данилова Е.В. 13.03.2026 

		|ГДЕ
		|	Контрагенты.ВыгружатьМаркиЗПСДляТСД
		|
		|СГРУППИРОВАТЬ ПО
		|	Контрагенты.Ссылка,
		|	Контрагенты.Код,
		|	Контрагенты.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование"; 		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Лимит%",ПараметрыОтбора.Лимит);	
		
	ИначеЕсли ЗначениеЗаполнено(ПараметрыОтбора.Лимит)
		И  ЗначениеЗаполнено(ПараметрыОтбора.номерСтраницы) Тогда         
		                    
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ %НеВключать%
		|	Контрагенты.Ссылка КАК ссылка,
		|	Контрагенты.Наименование КАК Наименование
		|ПОМЕСТИТЬ ВТИсключения
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ВыгружатьМаркиЗПСДляТСД
		|
		|СГРУППИРОВАТЬ ПО
		|	Контрагенты.Ссылка,
		|	Контрагенты.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ %Лимит%
		|	Контрагенты.Ссылка КАК ссылка,
		|	Контрагенты.Код КАК Код,
		|	Контрагенты.Наименование КАК Наименование,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказПоставщику.Ссылка) КАК КоличествоЗПС,
		//++Данилова Е.В. 13.03.2026 MARK-3512 
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КонтрактСПроизводителем.Ссылка) КАК КоличествоКП
		//--Данилова Е.В. 13.03.2026
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|		ПО (ЗаказПоставщику.Контрагент = Контрагенты.Ссылка)
		|			И (ЗаказПоставщику.Проведен)
		|			И (ЗаказПоставщику.СостояниеПроверкиМарокНаТСД = ЗНАЧЕНИЕ(Перечисление.СостоянияПроверкиМарокНаТСД.ТребуетсяОтправитьМарки)) 
		//++Данилова Е.В. 13.03.2026 MARK-3512
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтрактСПроизводителем КАК КонтрактСПроизводителем
		|		ПО (КонтрактСПроизводителем.Контрагент = Контрагенты.Ссылка)
		|			И (КонтрактСПроизводителем.Проведен)
		|			И (КонтрактСПроизводителем.СостояниеПроверкиМарокНаТСД = ЗНАЧЕНИЕ(Перечисление.СостоянияПроверкиМарокНаТСД.ТребуетсяОтправитьМарки)) 
	    //--Данилова Е.В. 13.03.2026 

		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсключения КАК ВТИсключения
		|		ПО (ВТИсключения.ссылка = Контрагенты.Ссылка)
		|ГДЕ
		|	Контрагенты.ВыгружатьМаркиЗПСДляТСД
		|	И ВТИсключения.ссылка ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	Контрагенты.Ссылка,
		|	Контрагенты.Код,
		|	Контрагенты.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Лимит%",ПараметрыОтбора.Лимит);
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%НеВключать%",ПараметрыОтбора.Лимит * (ПараметрыОтбора.НомерСтраницы - 1));

	КонецЕсли; 
	
	
	МассивСостояний = Новый Массив; 
	МассивСостояний.Добавить(Перечисления.СостояниеЗаказаПоставщику.Закрыт); 
	МассивСостояний.Добавить(Перечисления.СостояниеЗаказаПоставщику.Ликвидирован);
	МассивСостояний.Добавить(Перечисления.СостояниеЗаказаПоставщику.Получен);
	
	Запрос.УстановитьПараметр("МассивСостояний", МассивСостояний);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураЭлементаМассива = ДанныеМассиваФабрик();
		
		СтруктураЭлементаМассива.factoryId 		= XMLСтрока(ВыборкаДетальныеЗаписи.ссылка.УникальныйИдентификатор()); 
		СтруктураЭлементаМассива.factorycode	= ВыборкаДетальныеЗаписи.Код; 
		СтруктураЭлементаМассива.factoryName    = ВыборкаДетальныеЗаписи.Наименование; 
		СтруктураЭлементаМассива.ordersTotal    = ВыборкаДетальныеЗаписи.КоличествоЗПС;
		//++Данилова Е.В. 13.03.2026 MARK-3512 
		СтруктураЭлементаМассива.contractTotal	= ВыборкаДетальныеЗаписи.КоличествоКП;
		//--Данилова Е.В. 13.03.2026 
		
		ДанныеОтвета.data.Добавить(СтруктураЭлементаМассива); 
	КонецЦикла; 
	
	 УстановитьПривилегированныйРежим(Ложь);
	 
	Возврат ДанныеОтвета; 

КонецФункции // ПолучитьДанныеПоФабрикам()

Функция СтруктураДанныеФабрик(Знач Идентификатор)
	
	Основная = Новый Структура; 
	Основная.Вставить("data", Новый Массив);
	Основная.Вставить("id",Идентификатор); 
	
	Возврат Основная; 
	
КонецФункции // СтруктураДанныеФабрик()

Функция ДанныеМассиваФабрик()
	
	ДанныеМас = Новый Структура(); 
	ДанныеМас.Вставить("factoryId","");
	ДанныеМас.Вставить("factorycode","");
	ДанныеМас.Вставить("factoryName","");  
	ДанныеМас.Вставить("ordersTotal",0);
	//++Данилова Е.В. 13.03.2026 MARK-3512 
	ДанныеМас.Вставить("contractTotal",0);
	//--Данилова Е.В. 13.03.2026 
	Возврат ДанныеМас; 
	
КонецФункции // ДанныеМассиваФабрик()

Функция СформироватьОтветApplicationFactory(КодВозврата,ТелоОтвета,Причина) Экспорт 

	Ответ = Новый HTTPСервисОтвет(КодВозврата);
	Ответ.Причина = Причина;
	Ответ.Заголовки.Вставить("Content-type", "application/json");
	Ответ.Заголовки.Вставить("Charset", "utf-8"); 
	Если ЗначениеЗаполнено(ТелоОтвета) Тогда   
		
		Ответ.УстановитьТелоИзСтроки(ТелоОтвета); 
		
	КонецЕсли;
	
	
	Возврат Ответ; 
	
КонецФункции // СформироватьОтвет() 

Функция ПолучитьСписокЗПС(Знач Идентификатор,ПараметрыОтбора) Экспорт
	
	УстановитьПривилегированныйРежим(истина); 
	
	ДанныеОтвета = СтруктураДанныеСписокЗПС(Идентификатор); 
	ДанныеОтвета.id = Идентификатор;
	
	Запрос = Новый Запрос;
	
	ТекстЗапросаПоЗПСБезПагинации(Запрос); 	
	
	МассивСостояний = Новый Массив; 
	МассивСостояний.Добавить(Перечисления.СостояниеЗаказаПоставщику.Закрыт); 
	МассивСостояний.Добавить(Перечисления.СостояниеЗаказаПоставщику.Ликвидирован);
	МассивСостояний.Добавить(Перечисления.СостояниеЗаказаПоставщику.Получен);
	
	Запрос.УстановитьПараметр("МассивСостояний", МассивСостояний); 
	
	Запрос.УстановитьПараметр("ОтборПоКонтрагенту", ЛОЖЬ);   
	Запрос.УстановитьПараметр("Контрагент", неопределено);	
	
	Если ЗначениеЗаполнено(ПараметрыОтбора.ОтборПоКонтрагенту) Тогда
		
		Запрос.УстановитьПараметр("ОтборПоКонтрагенту", Истина);
		Запрос.УстановитьПараметр("Контрагент", ПараметрыОтбора.ОтборПоКонтрагенту);
		
	КонецЕсли; 
	//++Данилова Е.В. 09.03.2026 MARK-3512 
	//убираем это условие, будут передаваться и КП и ЗПС
	//Запрос.УстановитьПараметр("ОтборПоТипуДокумента", Истина);
	//Запрос.УстановитьПараметр("ТипДокумента", "order"); 
	Запрос.УстановитьПараметр("ОтборПоТипуДокумента", Ложь);
	Запрос.УстановитьПараметр("ОтборПоТипуЗаказа", Ложь);
	Запрос.УстановитьПараметр("ТипДокумента", "");
	Запрос.УстановитьПараметр("ТипЗаказа", "");
	//--Данилова Е.В. 09.03.2026 
	Если ЗначениеЗаполнено(ПараметрыОтбора.ТипДокумента)  Тогда 
		
	    Запрос.УстановитьПараметр("ОтборПоТипуДокумента", Истина);
		Запрос.УстановитьПараметр("ТипДокумента", ПараметрыОтбора.ТипДокумента);	
	
	КонецЕсли; 
	//++Данилова Е.В. 13.03.2026 MARK-3512
	Если ЗначениеЗаполнено(ПараметрыОтбора.ТипЗаказа)  Тогда 
		
	    Запрос.УстановитьПараметр("ОтборПоТипуЗаказа", Истина);
		Запрос.УстановитьПараметр("ТипЗаказа", ПараметрыОтбора.ТипЗаказа);	
	
	КонецЕсли;
	//--Данилова Е.В. 13.03.2026 
	
	Если ЗначениеЗаполнено(ПараметрыОтбора.Лимит)
		И НЕ ЗначениеЗаполнено(ПараметрыОтбора.номерСтраницы) Тогда
		          
		ТекстЗапросаПоЗПССПагинациейПоЛимиту(Запрос,ПараметрыОтбора.Лимит);
		
		
	ИначеЕсли ЗначениеЗаполнено(ПараметрыОтбора.Лимит)
		И  ЗначениеЗаполнено(ПараметрыОтбора.номерСтраницы) Тогда 
		                 
		ТекстЗапросаПоЗПССПагинацией(Запрос,ПараметрыОтбора.Лимит,ПараметрыОтбора.НомерСтраницы); 
		
	КонецЕсли; 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СоответствиеКодСтатус = СоответствиеСтатусКодСтатусаЗПС(); 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		
		ЭлементМассиваЗПС = ДанныеМассиваЗПС(); 
		
		ЭлементМассиваЗПС.id 			= XMLСтрока(ВыборкаДетальныеЗаписи.СсылкаЗПС.УникальныйИдентификатор());  
		ЭлементМассиваЗПС.code      	= ВыборкаДетальныеЗаписи.НомерЗПС; 
		ЭлементМассиваЗПС.factory   	= ВыборкаДетальныеЗаписи.Контрагент.Наименование;
		ЭлементМассиваЗПС.factoryId  	= XMLСтрока(ВыборкаДетальныеЗаписи.Контрагент.УникальныйИдентификатор());
		ЭлементМассиваЗПС.dateCreate    = ПреобразоватьДатуДляПередачиНаПортал(ВыборкаДетальныеЗаписи.ДатаЗПС); 
		//++Данилова Е.В. 16.03.2026 MARK-3512 
		//ЭлементМассиваЗПС.dateUpdate    = ПреобразоватьДатуДляПередачиНаПортал(ВыборкаДетальныеЗаписи.ДатаЗПС);
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СсылкаЗПС.ДатаИзменения) Тогда		
			ЭлементМассиваЗПС.dateUpdate    = ПреобразоватьДатуДляПередачиНаПортал(ВыборкаДетальныеЗаписи.СсылкаЗПС.ДатаИзменения);	
		Иначе 
			ЭлементМассиваЗПС.dateUpdate    = ПреобразоватьДатуДляПередачиНаПортал(ВыборкаДетальныеЗаписи.ДатаЗПС);
		КонецЕсли;
		//--Данилова Е.В. 16.03.2026 
		ЭлементМассиваЗПС.statusName    = XMLСтрока(ВыборкаДетальныеЗаписи.СтатусЗПС); 
		ЭлементМассиваЗПС.statusCode    = XMLСтрока(СоответствиеКодСтатус.Получить(ВыборкаДетальныеЗаписи.СтатусЗПС));
				
		Если ТипЗнч(ВыборкаДетальныеЗаписи.СсылкаЗПС) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			
			ЭлементМассиваЗПС.type_doc = "order";
			ЭлементМассиваЗПС.Invoice = ВыборкаДетальныеЗаписи.СсылкаЗПС.НомерПоставщика;
			
		ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.СсылкаЗПС) = Тип("ДокументСсылка.КонтрактСПроизводителем") Тогда
			
			ЭлементМассиваЗПС.type_doc = "contract";
			//++Данилова Е.В. 16.03.2026 MARK-3512
			ЭлементМассиваЗПС.number_order = ВыборкаДетальныеЗаписи.СсылкаЗПС.НомерЗаказа;
			//--Данилова Е.В. 16.03.2026 
		КонецЕсли;
		//++Данилова Е.В. 13.03.2026 MARK-3512 
		ЭлементМассиваЗПС.type_order = ?(ВыборкаДетальныеЗаписи.ОтложенноеЗаполнениеТСД,"null","full"); 
		//--Данилова Е.В. 13.03.2026 
		
		ДанныеОтвета.data.Добавить(ЭлементМассиваЗПС);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ДанныеОтвета; 
	
КонецФункции

Процедура ТекстЗапросаПоЗПСБезПагинации(Запрос)
			
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	Контрагенты.Код КАК КодКонтрагента,
	|	ЗаказПоставщику.Ссылка КАК СсылкаЗПС,
	|	ЗаказПоставщику.Номер КАК НомерЗПС,
	|	ЗаказПоставщику.Дата КАК ДатаЗПС,
	|	ЗаказПоставщику.СостояниеЗаказа КАК СтатусЗПС,
	//++Данилова Е.В. 13.03.2026  MARK-3512 
	|	ЗаказПоставщику.ОтложенноеЗаполнениеТСД КАК ОтложенноеЗаполнениеТСД  
	//--Данилова Е.В. 13.03.2026 
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ЗаказПоставщику.Контрагент = Контрагенты.Ссылка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтборПоТипуДокумента
	|				ТОГДА ВЫБОР
	|						КОГДА &ТипДокумента = ""order""
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ЗаказПоставщику.Проведен
	|	И (ЗаказПоставщику.СостояниеПроверкиМарокНаТСД = ЗНАЧЕНИЕ(Перечисление.СостоянияПроверкиМарокНаТСД.ТребуетсяОтправитьМарки)
	//++Данилова Е.В. 13.03.2026 MARK-3512
	|		ИЛИ ЗаказПоставщику.ОтложенноеЗаполнениеТСД)
	//--Данилова Е.В. 13.03.2026 
	|	И ВЫБОР
	|			КОГДА &ОтборПоКонтрагенту
	|				ТОГДА Контрагенты.Ссылка = &Контрагент
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	//++Данилова Е.В. 13.03.2026 MARK-3512 
	|	И ВЫБОР
	|			КОГДА &ОтборПоТипуЗаказа
	|				ТОГДА ВЫБОР
	|						КОГДА &ТипЗаказа = ""null""
	|							ТОГДА ЗаказПоставщику.ОтложенноеЗаполнениеТСД
	|						ИНАЧЕ НЕ ЗаказПоставщику.ОтложенноеЗаполнениеТСД
	|					КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	//--Данилова Е.В. 13.03.2026 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка,
	|	Контрагенты.Код,
	|	КонтрактСПроизводителем.Ссылка,
	|	КонтрактСПроизводителем.Номер,
	|	КонтрактСПроизводителем.Дата,
	|	КонтрактСПроизводителем.СостояниеЗаказа,
	//++Данилова Е.В. 13.03.2026 MARK-3512 
	|	ЛОЖЬ 
	//--Данилова Е.В. 13.03.2026 
	|ИЗ
	|	Документ.КонтрактСПроизводителем КАК КонтрактСПроизводителем
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО КонтрактСПроизводителем.Контрагент = Контрагенты.Ссылка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтборПоТипуДокумента
	|				ТОГДА ВЫБОР
	|						КОГДА &ТипДокумента = ""contract""
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ  
	//++Данилова Е.В. 13.03.2026 MARK-3512 
	|	И КонтрактСПроизводителем.СостояниеПроверкиМарокНаТСД = ЗНАЧЕНИЕ(Перечисление.СостоянияПроверкиМарокНаТСД.ТребуетсяОтправитьМарки)
//	|	И НЕ КонтрактСПроизводителем.СостояниеЗаказа В (&МассивСостояний) 
	//--Данилова Е.В. 13.03.2026 
	|	И КонтрактСПроизводителем.Проведен
	|	И ВЫБОР
	|			КОГДА &ОтборПоКонтрагенту
	|				ТОГДА Контрагенты.Ссылка = &Контрагент
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаЗПС";


КонецПроцедуры

Процедура ТекстЗапросаПоЗПССПагинациейПоЛимиту(Запрос, Лимит)
	//Данилова Е.В. 13.03.2026  MARK-3512 изменен запрос  
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ %Лимит%
	|	ВложенныйЗапрос.Контрагент КАК Контрагент,
	|	ВложенныйЗапрос.КодКонтрагента КАК КодКонтрагента,
	|	ВложенныйЗапрос.СсылкаЗПС КАК СсылкаЗПС,
	|	ВложенныйЗапрос.НомерЗПС КАК НомерЗПС,
	|	ВложенныйЗапрос.ДатаЗПС КАК ДатаЗПС,
	|	ВложенныйЗапрос.СтатусЗПС КАК СтатусЗПС,
	|	ВложенныйЗапрос.ОтложенноеЗаполнениеТСД КАК ОтложенноеЗаполнениеТСД
	|ИЗ
	|	(ВЫБРАТЬ
	|		Контрагенты.Ссылка КАК Контрагент,
	|		Контрагенты.Код КАК КодКонтрагента,
	|		ЗаказПоставщику.Ссылка КАК СсылкаЗПС,
	|		ЗаказПоставщику.Номер КАК НомерЗПС,
	|		ЗаказПоставщику.Дата КАК ДатаЗПС,
	|		ЗаказПоставщику.СостояниеЗаказа КАК СтатусЗПС,
	|		ЗаказПоставщику.ОтложенноеЗаполнениеТСД КАК ОтложенноеЗаполнениеТСД
	|	ИЗ
	|		Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ПО ЗаказПоставщику.Контрагент = Контрагенты.Ссылка
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА &ОтборПоТипуДокумента
	|					ТОГДА ВЫБОР
	|							КОГДА &ТипДокумента = ""order""
	|								ТОГДА ИСТИНА
	|							ИНАЧЕ ЛОЖЬ
	|						КОНЕЦ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|		И ЗаказПоставщику.Проведен
	|		И (ЗаказПоставщику.СостояниеПроверкиМарокНаТСД = ЗНАЧЕНИЕ(Перечисление.СостоянияПроверкиМарокНаТСД.ТребуетсяОтправитьМарки)
	|				ИЛИ ЗаказПоставщику.ОтложенноеЗаполнениеТСД)
	|		И ВЫБОР
	|				КОГДА &ОтборПоКонтрагенту
	|					ТОГДА Контрагенты.Ссылка = &Контрагент
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|		И ВЫБОР
	|				КОГДА &ОтборПоТипуЗаказа
	|					ТОГДА ВЫБОР
	|							КОГДА &ТипЗаказа = ""null""
	|								ТОГДА ЗаказПоставщику.ОтложенноеЗаполнениеТСД
	|							ИНАЧЕ НЕ ЗаказПоставщику.ОтложенноеЗаполнениеТСД
	|						КОНЕЦ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Контрагенты.Ссылка,
	|		Контрагенты.Код,
	|		КонтрактСПроизводителем.Ссылка,
	|		КонтрактСПроизводителем.Номер,
	|		КонтрактСПроизводителем.Дата,
	|		КонтрактСПроизводителем.СостояниеЗаказа,
	|		ЛОЖЬ
	|	ИЗ
	|		Документ.КонтрактСПроизводителем КАК КонтрактСПроизводителем
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ПО КонтрактСПроизводителем.Контрагент = Контрагенты.Ссылка
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА &ОтборПоТипуДокумента
	|					ТОГДА ВЫБОР
	|							КОГДА &ТипДокумента = ""contract""
	|								ТОГДА ИСТИНА
	|							ИНАЧЕ ЛОЖЬ
	|						КОНЕЦ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|		И КонтрактСПроизводителем.СостояниеПроверкиМарокНаТСД = ЗНАЧЕНИЕ(Перечисление.СостоянияПроверкиМарокНаТСД.ТребуетсяОтправитьМарки)
	|		И КонтрактСПроизводителем.Проведен
	|		И ВЫБОР
	|				КОГДА &ОтборПоКонтрагенту
	|					ТОГДА Контрагенты.Ссылка = &Контрагент
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.ДатаЗПС";

	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Лимит%",Лимит);

КонецПроцедуры

Процедура ТекстЗапросаПоЗПССПагинацией(Запрос, Лимит, НомерСтраницы)        
	//Данилова Е.В. 13.03.2026 MARK-3512 изменен запрос   
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ %НеВключать%
	|	ВложенныйЗапрос.СсылкаЗПС КАК СсылкаЗПС,
	|	ВложенныйЗапрос.ДатаЗПС КАК ДатаЗПС
	|ПОМЕСТИТЬ ВТИсключения
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказПоставщику.Ссылка КАК СсылкаЗПС,
	|		ЗаказПоставщику.Дата КАК ДатаЗПС
	|	ИЗ
	|		Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ПО ЗаказПоставщику.Контрагент = Контрагенты.Ссылка
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА &ОтборПоТипуДокумента
	|					ТОГДА ВЫБОР
	|							КОГДА &ТипДокумента = ""order""
	|								ТОГДА ИСТИНА
	|							ИНАЧЕ ЛОЖЬ
	|						КОНЕЦ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|		И ЗаказПоставщику.Проведен
	|		И (ЗаказПоставщику.СостояниеПроверкиМарокНаТСД = ЗНАЧЕНИЕ(Перечисление.СостоянияПроверкиМарокНаТСД.ТребуетсяОтправитьМарки)
	|				ИЛИ ЗаказПоставщику.ОтложенноеЗаполнениеТСД)
	|		И ВЫБОР
	|				КОГДА &ОтборПоКонтрагенту
	|					ТОГДА Контрагенты.Ссылка = &Контрагент
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|		И ВЫБОР
	|				КОГДА &ОтборПоТипуЗаказа
	|					ТОГДА ВЫБОР
	|							КОГДА &ТипЗаказа = ""null""
	|								ТОГДА ЗаказПоставщику.ОтложенноеЗаполнениеТСД
	|							ИНАЧЕ НЕ ЗаказПоставщику.ОтложенноеЗаполнениеТСД
	|						КОНЕЦ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КонтрактСПроизводителем.Ссылка,
	|		КонтрактСПроизводителем.Дата
	|	ИЗ
	|		Документ.КонтрактСПроизводителем КАК КонтрактСПроизводителем
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ПО КонтрактСПроизводителем.Контрагент = Контрагенты.Ссылка
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА &ОтборПоТипуДокумента
	|					ТОГДА ВЫБОР
	|							КОГДА &ТипДокумента = ""contract""
	|								ТОГДА ИСТИНА
	|							ИНАЧЕ ЛОЖЬ
	|						КОНЕЦ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|		И КонтрактСПроизводителем.СостояниеПроверкиМарокНаТСД = ЗНАЧЕНИЕ(Перечисление.СостоянияПроверкиМарокНаТСД.ТребуетсяОтправитьМарки)
	|		И КонтрактСПроизводителем.Проведен
	|		И ВЫБОР
	|				КОГДА &ОтборПоКонтрагенту
	|					ТОГДА Контрагенты.Ссылка = &Контрагент
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.ДатаЗПС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВложенныйЗапрос.СсылкаЗПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ %Лимит%
	|	ВложенныйЗапрос.Контрагент КАК Контрагент,
	|	ВложенныйЗапрос.КодКонтрагента КАК КодКонтрагента,
	|	ВложенныйЗапрос.СсылкаЗПС КАК СсылкаЗПС,
	|	ВложенныйЗапрос.НомерЗПС КАК НомерЗПС,
	|	ВложенныйЗапрос.ДатаЗПС КАК ДатаЗПС,
	|	ВложенныйЗапрос.СтатусЗПС КАК СтатусЗПС,
	|	ВложенныйЗапрос.ОтложенноеЗаполнениеТСД КАК ОтложенноеЗаполнениеТСД
	|ИЗ
	|	(ВЫБРАТЬ
	|		Контрагенты.Ссылка КАК Контрагент,
	|		Контрагенты.Код КАК КодКонтрагента,
	|		ЗаказПоставщику.Ссылка КАК СсылкаЗПС,
	|		ЗаказПоставщику.Номер КАК НомерЗПС,
	|		ЗаказПоставщику.Дата КАК ДатаЗПС,
	|		ЗаказПоставщику.СостояниеЗаказа КАК СтатусЗПС,
	|		ЗаказПоставщику.ОтложенноеЗаполнениеТСД КАК ОтложенноеЗаполнениеТСД
	|	ИЗ
	|		Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ПО ЗаказПоставщику.Контрагент = Контрагенты.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТИсключения КАК ВТИсключения
	|			ПО (ВТИсключения.СсылкаЗПС = ЗаказПоставщику.Ссылка)
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА &ОтборПоТипуДокумента
	|					ТОГДА ВЫБОР
	|							КОГДА &ТипДокумента = ""order""
	|								ТОГДА ИСТИНА
	|							ИНАЧЕ ЛОЖЬ
	|						КОНЕЦ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|		И ЗаказПоставщику.Проведен
	|		И (ЗаказПоставщику.СостояниеПроверкиМарокНаТСД = ЗНАЧЕНИЕ(Перечисление.СостоянияПроверкиМарокНаТСД.ТребуетсяОтправитьМарки)
	|				ИЛИ ЗаказПоставщику.ОтложенноеЗаполнениеТСД)
	|		И ВЫБОР
	|				КОГДА &ОтборПоКонтрагенту
	|					ТОГДА Контрагенты.Ссылка = &Контрагент
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|		И ВЫБОР
	|				КОГДА &ОтборПоТипуЗаказа
	|					ТОГДА ВЫБОР
	|							КОГДА &ТипЗаказа = ""null""
	|								ТОГДА ЗаказПоставщику.ОтложенноеЗаполнениеТСД
	|							ИНАЧЕ НЕ ЗаказПоставщику.ОтложенноеЗаполнениеТСД
	|						КОНЕЦ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|		И ВТИсключения.СсылкаЗПС ЕСТЬ NULL
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Контрагенты.Ссылка,
	|		Контрагенты.Код,
	|		КонтрактСПроизводителем.Ссылка,
	|		КонтрактСПроизводителем.Номер,
	|		КонтрактСПроизводителем.Дата,
	|		КонтрактСПроизводителем.СостояниеЗаказа,
	|		ЛОЖЬ
	|	ИЗ
	|		Документ.КонтрактСПроизводителем КАК КонтрактСПроизводителем
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ПО КонтрактСПроизводителем.Контрагент = Контрагенты.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТИсключения КАК ВТИсключения
	|			ПО (ВТИсключения.СсылкаЗПС = КонтрактСПроизводителем.Ссылка)
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА &ОтборПоТипуДокумента
	|					ТОГДА ВЫБОР
	|							КОГДА &ТипДокумента = ""contract""
	|								ТОГДА ИСТИНА
	|							ИНАЧЕ ЛОЖЬ
	|						КОНЕЦ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|		И КонтрактСПроизводителем.СостояниеПроверкиМарокНаТСД = ЗНАЧЕНИЕ(Перечисление.СостоянияПроверкиМарокНаТСД.ТребуетсяОтправитьМарки)
	|		И ВТИсключения.СсылкаЗПС ЕСТЬ NULL
	|		И КонтрактСПроизводителем.Проведен
	|		И ВЫБОР
	|				КОГДА &ОтборПоКонтрагенту
	|					ТОГДА Контрагенты.Ссылка = &Контрагент
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.ДатаЗПС";

	//
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Лимит%",Лимит);
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%НеВключать%",Лимит * (НомерСтраницы - 1));

КонецПроцедуры



Функция СтруктураДанныеСписокЗПС(Знач Идентификатор)
	
	Основная = Новый Структура; 
	Основная.Вставить("data", Новый Массив);
	Основная.Вставить("id",Идентификатор); 
	
	Возврат Основная; 
	
КонецФункции 

Функция ДанныеМассиваЗПС()
	
	ДанныеМас = Новый Структура(); 
	ДанныеМас.Вставить("id","");
	ДанныеМас.Вставить("code","");  
	ДанныеМас.Вставить("factory","");
	ДанныеМас.Вставить("dateCreate","");
	ДанныеМас.Вставить("dateUpdate","");
	ДанныеМас.Вставить("statusName","");
	ДанныеМас.Вставить("factoryId","");
	ДанныеМас.Вставить("statusCode","");
	ДанныеМас.Вставить("type_doc","");
	ДанныеМас.Вставить("Invoice","");
	//++Данилова Е.В. 09.03.2026 MARK-3512 
	ДанныеМас.Вставить("type_order","full");
	ДанныеМас.Вставить("number_order","");
	//--Данилова Е.В. 09.03.2026 
	//ДанныеМас.Вставить("boxTotal",0);
	//ДанныеМас.Вставить("MarkesTotal",0);
	
	Возврат ДанныеМас; 
	
КонецФункции 

Функция ПолучитьСписокТоваровПоЗПС1(Знач Идентификатор, МассивЗПС) Экспорт
	
	УстановитьПривилегированныйРежим(истина);
	
	ДанныеОтвета 	= СтруктураДанныеСписокТоваровЗПС(Идентификатор); 
	ДанныеОтвета.id = Идентификатор; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|	МаркировкаТоваровИСМП.ДокументОснование КАК ЗПС
	|ПОМЕСТИТЬ ВТКоробки
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
	|		ПО МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка = МаркировкаТоваровИСМП.Ссылка
	|ГДЕ
	|	МаркировкаТоваровИСМП.ДокументОснование В(&МассивЗПС)
	|	И МаркировкаТоваровИСМП.ВидОперации = &Агрегация
	|	И МаркировкаТоваровИСМП.Проведен
	|	И МаркировкаТоваровИСМП.ТипШК = &Коробка
	|	И МаркировкаТоваровИСМП.Статус = &Обработан
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТКоробки.ШтрихкодУпаковки) КАК Количество,
	|	ВТКоробки.ЗПС КАК ЗПС
	|ПОМЕСТИТЬ ВТКоличествоКоробок
	|ИЗ
	|	ВТКоробки КАК ВТКоробки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТКоробки.ЗПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка КАК ЗПС,
	|	ЗаказПоставщику.Номер КАК Номер,
	|	ЗаказПоставщику.Контрагент КАК Контрагент,
	|	ЗаказПоставщику.Контрагент.Наименование КАК КонтрагентНаименование,
	|	ЗаказПоставщику.Дата КАК Дата,
	|	ЗаказПоставщику.СостояниеЗаказа КАК СтатусЗПС,
	|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПоставщикуТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ЗаказПоставщикуТовары.Номенклатура.Размер.Наименование КАК НоменклатураРазмер,
	|	ЗаказПоставщикуТовары.Номенклатура.Цвет.Наименование КАК НоменклатураЦвет,
	|	"""" КАК Картинка,
	|	ЕСТЬNULL(ЗаказПоставщикуТовары.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(ВТКоличествоКоробок.Количество, 0) КАК КоличествоКоробок
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|		ПО (ЗаказПоставщикуТовары.Ссылка = ЗаказПоставщику.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоличествоКоробок КАК ВТКоличествоКоробок
	|		ПО (ВТКоличествоКоробок.ЗПС = ЗаказПоставщику.Ссылка)
	|ГДЕ
	|	ЗаказПоставщику.Ссылка В(&МассивЗПС)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка,
	|	ЗаказПоставщику.Номер,
	|	ЗаказПоставщику.Контрагент,
	|	ЗаказПоставщику.Контрагент.Наименование,
	|	ЗаказПоставщику.Дата,
	|	ЗаказПоставщику.СостояниеЗаказа,
	|	ЗаказПоставщикуТовары.Номенклатура,
	|	ЗаказПоставщикуТовары.Номенклатура.Наименование,
	|	ЗаказПоставщикуТовары.Номенклатура.Размер.Наименование,
	|	ЗаказПоставщикуТовары.Номенклатура.Цвет.Наименование,
	|	"""",
	|	ЕСТЬNULL(ЗаказПоставщикуТовары.Количество, 0),
	|	ЕСТЬNULL(ВТКоличествоКоробок.Количество, 0)
	|ИЗ
	|	Документ.КонтрактСПроизводителем КАК ЗаказПоставщику
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтрактСПроизводителем.Товары КАК ЗаказПоставщикуТовары
	|		ПО (ЗаказПоставщикуТовары.Ссылка = ЗаказПоставщику.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоличествоКоробок КАК ВТКоличествоКоробок
	|		ПО (ВТКоличествоКоробок.ЗПС = ЗаказПоставщику.Ссылка)
	|ГДЕ
	|	ЗаказПоставщику.Ссылка В(&МассивЗПС)
	|ИТОГИ
	|	СУММА(Количество),
	|	МАКСИМУМ(КоличествоКоробок)
	|ПО
	|	ЗПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТКоробки.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|	ВТКоробки.ЗПС КАК ЗПС
	|ИЗ
	|	ВТКоробки КАК ВТКоробки
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодУпаковки)
	|ПО
	|	ЗПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование КАК ЗПС,
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК КМ,
	|	ШтрихкодыУпаковокТоваров.Наименование КАК Наименование,
	|	ШтрихкодыУпаковокТоваров.ТипКода КАК ТипКода
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
	|		ПО ШтрихкодыУпаковокТоваров.ЗаказКМ = ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка
	|ГДЕ
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование В(&МассивЗПС)
	|	И НЕ ШтрихкодыУпаковокТоваров.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	КМ";
	
	Запрос.УстановитьПараметр("МассивЗПС", МассивЗПС);
	Запрос.УстановитьПараметр("Агрегация", перечисления.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов);
	Запрос.УстановитьПараметр("Коробка", Перечисления.ТипыШтрихКодов.Коробка);
	Запрос.УстановитьПараметр("Обработан", Перечисления.СтатусыДокументовМаркировки.Обработан);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	ВыборкаИтогиТовары = ПакетЗапросов[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаЗПСПоКоробкам = ПакетЗапросов[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаЗПСПоЭмиссиям = ПакетЗапросов[4].Выбрать(); 
	
	СоответствиеКодСтатус = СоответствиеСтатусКодСтатусаЗПС();
	Пока ВыборкаИтогиТовары.Следующий() Цикл
		
		ЗПС = ВыборкаИтогиТовары.ЗПС; 
		
		СтруктураЗПС = ДанныеМассиваЗПССТоварами(); 
		СтруктураЗПС.id   			= XMLСтрока(ЗПС.ссылка.УникальныйИдентификатор());
		СтруктураЗПС.code  		= ЗПС.Номер; 
		СтруктураЗПС.factory       = XMLСтрока(ЗПС.Контрагент.Наименование); 
		СтруктураЗПС.dateCreate    = ПреобразоватьДатуДляПередачиНаПортал(ЗПС.Дата);
		//++Данилова Е.В. 13.03.2026 MARK-3512 
		//СтруктураЗПС.dateUpdate    = ПреобразоватьДатуДляПередачиНаПортал(ЗПС.Дата);
		Если ЗначениеЗаполнено(ЗПС.ДатаИзменения) Тогда		
			СтруктураЗПС.dateUpdate    = ПреобразоватьДатуДляПередачиНаПортал(ЗПС.ДатаИзменения);	
		Иначе 
			СтруктураЗПС.dateUpdate    = ПреобразоватьДатуДляПередачиНаПортал(ЗПС.Дата);
		КонецЕсли;
		//--Данилова Е.В. 13.03.2026 
		СтруктураЗПС.statusName    = XMLСтрока(ЗПС.СостояниеЗаказа); 
		СтруктураЗПС.factoryId     = XMLСтрока(ЗПС.Контрагент.УникальныйИдентификатор()); 
		СтруктураЗПС.statusCode    = XMLСтрока(СоответствиеКодСтатус.Получить(ЗПС.СостояниеЗаказа));
		СтруктураЗПС.boxTotal      = ВыборкаИтогиТовары.КоличествоКоробок; 
		СтруктураЗПС.productTotal  = ВыборкаИтогиТовары.Количество;
		
		
		ВыборкаТовары = ВыборкаИтогиТовары.Выбрать(); 
		
		Пока ВыборкаТовары.Следующий() Цикл
			
			СтруктураТовара =  ДанныеМассиваТоварыЗПС(); 
			СтруктураТовара.id 			= XMLСтрока(ВыборкаТовары.Номенклатура.УникальныйИдентификатор());
			СтруктураТовара.name 		= ВыборкаТовары.Номенклатура.Родитель.Наименование; 
			СтруктураТовара.size 		= XMLСтрока(ВыборкаТовары.НоменклатураРазмер); 
			СтруктураТовара.color 		= XMLСтрока(ВыборкаТовары.НоменклатураЦвет);
			СтруктураТовара.multibox	= ВыборкаТовары.Номенклатура.Родитель.ШтукВКоробке; 
			СтруктураТовара.GTIN 		= ВыборкаТовары.Номенклатура.ГТИН;
			СтруктураТовара.count 		= ВыборкаТовары.Количество;
			 
			СтруктураЗПС.productList.Добавить(СтруктураТовара); 
		КонецЦикла;
		
		
		ОтборПоЗПС = Новый Структура("ЗПС",ЗПС); 
		Пока ВыборкаЗПСПоКоробкам.НайтиСледующий(ОтборПоЗПС) Цикл 			
			
			ВыборкаИтогиКоробки = ВыборкаЗПСПоКоробкам.ВЫбрать(); 
			
			Пока ВыборкаИтогиКоробки.Следующий() Цикл   
				
				СтруктураКоробки = ДанныеМассиваКоробкиЗПС(); 
				
				СтруктураКоробки.code = XMLСтрока(ВыборкаИтогиКоробки.ШтрихкодУпаковки.Наименование); 
				//СтруктураКоробки.productTotal =  ВыборкаИтогиКоробки.ШтрихкодУпаковки; 
				
				//ВыборкаТоварыКоробки = ВыборкаИтогиКоробки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
				
				//Пока ВыборкаТоварыКоробки.Следующий() Цикл
				//	
				//	СтруктураТоварыКоробки = Новый Структура("id,total");  
				//	СтруктураТоварыКоробки.id 		=  XMLСтрока(ВыборкаТоварыКоробки.Номенклатура.УникальныйИдентификатор()); 
				//	СтруктураТоварыКоробки.total 	=  ВыборкаТоварыКоробки.ШтрихкодУпаковки; 
				//	
				//	СтруктураКоробки.productList.Добавить(СтруктураТоварыКоробки); 	 
				//	
				//КонецЦикла;	 
				
				
				СтруктураЗПС.boxList.Добавить(СтруктураКоробки); 
			КонецЦикла;		 
		КонецЦикла;
		
		ВыборкаЗПСПоКоробкам.Сбросить();
		
		Пока ВыборкаЗПСПоЭмиссиям.НайтиСледующий(ОтборПоЗПС) Цикл
			
			СтруктураЭлМассиваКМ 		= Новый Структура("id,value,type"); 	
			СтруктураЭлМассиваКМ.id 	= XMLСтрока(ВыборкаЗПСПоЭмиссиям.КМ.УникальныйИдентификатор());
			СтруктураЭлМассиваКМ.value 	= ВыборкаЗПСПоЭмиссиям.Наименование; 
			СтруктураЭлМассиваКМ.type	= XMLСтрока(ВыборкаЗПСПоЭмиссиям.ТипКода);
			
			СтруктураЗПС.Markes.Добавить(СтруктураЭлМассиваКМ);
			
		КонецЦикла; 
		ВыборкаЗПСПоЭмиссиям.Сбросить();
		
		ДанныеОтвета.data.Добавить(СтруктураЗПС); 
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ДанныеОтвета; 
	
 КонецФункции 

Функция ПолучитьСписокТоваровПоЗПС(Знач Идентификатор, МассивЗПС) Экспорт
	
	УстановитьПривилегированныйРежим(истина);
	
	ДанныеОтвета 	= СтруктураДанныеСписокТоваровЗПС(Идентификатор); 
	ДанныеОтвета.id = Идентификатор; 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование КАК ЗПС,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодыУпаковокТоваров.Ссылка) КАК КМВсего
	|ПОМЕСТИТЬ ВТМаркиВсего
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
	|		ПО ШтрихкодыУпаковокТоваров.ЗаказКМ = ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка
	|			И (ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование В (&МассивЗПС))
	|			И (НЕ ШтрихкодыУпаковокТоваров.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки) КАК ВсегоКоробок,
	|	МаркировкаТоваровИСМП.ДокументОснование КАК ЗПС
	|ПОМЕСТИТЬ ВТВсегоКоробок
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
	|		ПО МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка = МаркировкаТоваровИСМП.Ссылка
	|			И (МаркировкаТоваровИСМП.ДокументОснование В (&МассивЗПС))
	|			И (МаркировкаТоваровИСМП.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов))
	|			И (МаркировкаТоваровИСМП.Проведен)
	|			И (МаркировкаТоваровИСМП.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
	|			И (МаркировкаТоваровИСМП.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан))
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(МаркировкаТоваровИСМП.ДокументОснование) = ТИП(Документ.ЗаказПоставщику)
	|
	|СГРУППИРОВАТЬ ПО
	|	МаркировкаТоваровИСМП.ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодКоробки),
	|	МаркировкаТоваровИСМП.ДокументОснование
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
	|		ПО МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка = МаркировкаТоваровИСМП.Ссылка
	|			И (МаркировкаТоваровИСМП.ДокументОснование В (&МассивЗПС))
	|			И (МаркировкаТоваровИСМП.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийМаркировки.Агрегация))
	|			И (МаркировкаТоваровИСМП.Проведен)
	|			И (МаркировкаТоваровИСМП.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
	//|			И (МаркировкаТоваровИСМП.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан))
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(МаркировкаТоваровИСМП.ДокументОснование) = ТИП(Документ.КонтрактСПроизводителем)
	|
	|СГРУППИРОВАТЬ ПО
	|	МаркировкаТоваровИСМП.ДокументОснование
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка КАК ЗПС,
	|	ЗаказПоставщику.Номер КАК Номер,
	|	ЗаказПоставщику.Контрагент КАК Контрагент,
	|	ЗаказПоставщику.Контрагент.Наименование КАК КонтрагентНаименование,
	|	ЗаказПоставщику.Дата КАК Дата,
	|	ЗаказПоставщику.СостояниеЗаказа КАК СтатусЗПС,
	|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПоставщикуТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ЗаказПоставщикуТовары.Номенклатура.Размер.Наименование КАК НоменклатураРазмер,
	|	ЗаказПоставщикуТовары.Номенклатура.Цвет.Наименование КАК НоменклатураЦвет,
	|	"""" КАК Картинка,
	|	ЕСТЬNULL(ЗаказПоставщикуТовары.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(ВТМаркиВсего.КМВсего, 0) КАК КМВсего,
	|	ЕСТЬNULL(ВТВсегоКоробок.ВсегоКоробок, 0) КАК КоробокВсего
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|		ПО (ЗаказПоставщикуТовары.Ссылка = ЗаказПоставщику.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМаркиВсего КАК ВТМаркиВсего
	|		ПО (ВТМаркиВсего.ЗПС = ЗаказПоставщику.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВсегоКоробок КАК ВТВсегоКоробок
	|		ПО (ВТВсегоКоробок.ЗПС = ЗаказПоставщику.Ссылка)
	|ГДЕ
	|	ЗаказПоставщику.Ссылка В(&МассивЗПС)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка,
	|	ЗаказПоставщику.Номер,
	|	ЗаказПоставщику.Контрагент,
	|	ЗаказПоставщику.Контрагент.Наименование,
	|	ЗаказПоставщику.Дата,
	|	ЗаказПоставщику.СостояниеЗаказа,
	|	ЗаказПоставщикуТовары.Номенклатура,
	|	ЗаказПоставщикуТовары.Номенклатура.Наименование,
	|	ЗаказПоставщикуТовары.Номенклатура.Размер.Наименование,
	|	ЗаказПоставщикуТовары.Номенклатура.Цвет.Наименование,
	|	"""",
	|	ЕСТЬNULL(ЗаказПоставщикуТовары.Количество, 0),
	|	ЕСТЬNULL(ВТМаркиВсего.КМВсего, 0),
	|	ЕСТЬNULL(ВТВсегоКоробок.ВсегоКоробок, 0)
	|ИЗ
	|	Документ.КонтрактСПроизводителем КАК ЗаказПоставщику
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтрактСПроизводителем.Товары КАК ЗаказПоставщикуТовары
	|		ПО (ЗаказПоставщикуТовары.Ссылка = ЗаказПоставщику.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМаркиВсего КАК ВТМаркиВсего
	|		ПО (ВТМаркиВсего.ЗПС = ЗаказПоставщику.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВсегоКоробок КАК ВТВсегоКоробок
	|		ПО (ВТВсегоКоробок.ЗПС = ЗаказПоставщику.Ссылка)
	|ГДЕ
	|	ЗаказПоставщику.Ссылка В(&МассивЗПС)
	|ИТОГИ
	|	СУММА(Количество),
	|	МАКСИМУМ(КМВсего),
	|	МАКСИМУМ(КоробокВсего)
	|ПО
	|	ЗПС";
	
	Запрос.УстановитьПараметр("МассивЗПС", МассивЗПС);
	
	ВыборкаИтогиТовары = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 	
	
	СоответствиеКодСтатус = СоответствиеСтатусКодСтатусаЗПС();
	Пока ВыборкаИтогиТовары.Следующий() Цикл
		
		ЗПС = ВыборкаИтогиТовары.ЗПС; 
		
		СтруктураЗПС = ДанныеМассиваЗПССТоварами(); 
		СтруктураЗПС.id   			= XMLСтрока(ЗПС.ссылка.УникальныйИдентификатор());
		СтруктураЗПС.code  		= ЗПС.Номер; 
		СтруктураЗПС.factory       = XMLСтрока(ЗПС.Контрагент.Наименование); 
		СтруктураЗПС.dateCreate    = ПреобразоватьДатуДляПередачиНаПортал(ЗПС.Дата);
		//++Данилова Е.В. 16.03.2026  MARK-3512 
		//СтруктураЗПС.dateUpdate    = ПреобразоватьДатуДляПередачиНаПортал(ЗПС.Дата);
		Если ЗначениеЗаполнено(ЗПС.ДатаИзменения) Тогда		
			СтруктураЗПС.dateUpdate    = ПреобразоватьДатуДляПередачиНаПортал(ЗПС.ДатаИзменения);	
		Иначе 
			СтруктураЗПС.dateUpdate    = ПреобразоватьДатуДляПередачиНаПортал(ЗПС.Дата);
		КонецЕсли;
		//--Данилова Е.В. 16.03.2026 
		СтруктураЗПС.statusName    = XMLСтрока(ЗПС.СостояниеЗаказа); 
		СтруктураЗПС.factoryId     = XMLСтрока(ЗПС.Контрагент.УникальныйИдентификатор()); 
		СтруктураЗПС.statusCode    = XMLСтрока(СоответствиеКодСтатус.Получить(ЗПС.СостояниеЗаказа));
		//++Данилова Е.В. 26.05.2026 без задачи		
		Если ТипЗнч(ЗПС) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			
			ОтложенноеЗаполнениеТСД = ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(ЗПС,"ОтложенноеЗаполнениеТСД");
			СтруктураЗПС.type_doc = "order";
			СтруктураЗПС.Invoice = ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(ЗПС,"НомерПоставщика");
			СтруктураЗПС.type_order = ?(ОтложенноеЗаполнениеТСД,"null","full");
			
		ИначеЕсли ТипЗнч(ЗПС) = Тип("ДокументСсылка.КонтрактСПроизводителем") Тогда
			
			СтруктураЗПС.type_doc = "contract";
			
			СтруктураЗПС.number_order = ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(ЗПС,"НомерЗаказа");
			СтруктураЗПС.type_order = "full"; 
		КонецЕсли; 
		 
		//--Данилова Е.В. 26.05.2026  

		СтруктураЗПС.boxTotal      = ВыборкаИтогиТовары.КоробокВсего;
		СтруктураЗПС.markesTotal   = ВыборкаИтогиТовары.КМВсего;
		СтруктураЗПС.productTotal  = ВыборкаИтогиТовары.Количество;
		
		
		ВыборкаТовары = ВыборкаИтогиТовары.Выбрать(); 
		//++Данилова Е.В. 16.03.2026 MARK-3512 
		Если ВыборкаИтогиТовары.Количество = 0 Тогда
			
			ДанныеОтвета.data.Добавить(СтруктураЗПС);
			
			Продолжить; 	
		
		КонецЕсли;
		//--Данилова Е.В. 16.03.2026 
		Пока ВыборкаТовары.Следующий() Цикл
			
			СтруктураТовара =  ДанныеМассиваТоварыЗПС(); 
			СтруктураТовара.id 			= XMLСтрока(ВыборкаТовары.Номенклатура.УникальныйИдентификатор());
			СтруктураТовара.name 		= ВыборкаТовары.Номенклатура.Родитель.Наименование; 
			СтруктураТовара.size 		= XMLСтрока(ВыборкаТовары.НоменклатураРазмер); 
			СтруктураТовара.color 		= XMLСтрока(ВыборкаТовары.НоменклатураЦвет);
			СтруктураТовара.multibox	= ВыборкаТовары.Номенклатура.Родитель.ШтукВКоробке; 
			СтруктураТовара.GTIN 		= ВыборкаТовары.Номенклатура.ГТИН;
			СтруктураТовара.count 		= ВыборкаТовары.Количество;
			//++Данилова Е.В. 09.03.2026 MARK-3512
			СтруктураТовара.id_parent 	= XMLСтрока(ВыборкаТовары.Номенклатура.родитель.УникальныйИдентификатор());
			//--Данилова Е.В. 09.03.2026 
			//++Данилова Е.В. 26.05.2026 без задачи
			СтруктураТовара.code 		= ВыборкаТовары.Номенклатура.Код;
			СтруктураТовара.code_parent = ВыборкаТовары.Номенклатура.Родитель.Код;
			СтруктураТовара.code_maker 	= ВыборкаТовары.Номенклатура.Родитель.КодПроизводителя;			
			//--Данилова Е.В. 26.05.2026 
			СтруктураЗПС.productList.Добавить(СтруктураТовара); 
		КонецЦикла;
		
		ДанныеОтвета.data.Добавить(СтруктураЗПС); 
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ДанныеОтвета; 
	
 КонецФункции 
 
 Функция ПолучитьСписокМарокПоЗПС(Знач Идентификатор, ПараметрыОтбора) Экспорт
	
	УстановитьПривилегированныйРежим(истина);
	
	МассивЗПС 		= ПараметрыОтбора.МассивЗПС; 
	Лимит 			= ПараметрыОтбора.Лимит;
	НомерСтраницы 	= ПараметрыОтбора.НомерСтраницы; 
	
	ДанныеОтвета 	= СтруктураДанныеСписокТоваровЗПС(Идентификатор); 
	ДанныеОтвета.id = Идентификатор; 
	
	Запрос = Новый Запрос;
	
	ТекстЗапросаСписокМарокБезПагинации(Запрос); 
	
	Если ЗначениеЗаполнено(Лимит) И 
		НЕ ЗначениеЗаполнено(НомерСтраницы) Тогда
	
		ТекстЗапросаСписокМарокСпагинациейПоЛимиту(Запрос,Лимит); 	
	ИначеЕсли ЗначениеЗаполнено(Лимит) И 
		 ЗначениеЗаполнено(НомерСтраницы) Тогда
		 
		ТекстЗапросаСписокМарокСпагинацией(Запрос,Лимит,НомерСтраницы);
		
	КонецЕсли;

	
	Запрос.УстановитьПараметр("МассивЗПС", МассивЗПС); 
	ВыборкаИтоги = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	
	Пока ВыборкаИтоги.Следующий() Цикл
		
		ЗПС = ВыборкаИтоги.ЗПС; 
		
		СтруктураЗПС = ДанныеМассиваЗПССМарками(); 
		СтруктураЗПС.id   			= XMLСтрока(ЗПС.ссылка.УникальныйИдентификатор());
		СтруктураЗПС.code  			= ЗПС.Номер; 
		СтруктураЗПС.MarkesCount  = ВыборкаИтоги.КМ;
		СтруктураЗПС.MarkesTotal  = ВыборкаИтоги.КМВсего;
		
		ВыборкаМарки = ВыборкаИтоги.Выбрать(); 
		
		Пока ВыборкаМарки.Следующий() Цикл
			
			СтруктураЭлМассиваКМ 		= Новый Структура("id,value,type"); 	
			СтруктураЭлМассиваКМ.id 	= XMLСтрока(ВыборкаМарки.КМ.УникальныйИдентификатор());
			СтруктураЭлМассиваКМ.value 	= ВыборкаМарки.Наименование; 
			СтруктураЭлМассиваКМ.type	= XMLСтрока(ВыборкаМарки.ТипКода);
			
			СтруктураЗПС.Markes.Добавить(СтруктураЭлМассиваКМ); 			
			 
		КонецЦикла;	
				
		ДанныеОтвета.data.Добавить(СтруктураЗПС); 
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ДанныеОтвета; 
	
КонецФункции

Процедура ТекстЗапросаСписокМарокБезПагинации(Запрос)
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование КАК ЗПС,
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК КМ,
	|	ШтрихкодыУпаковокТоваров.Наименование КАК Наименование,
	|	ШтрихкодыУпаковокТоваров.ТипКода КАК ТипКода,
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК КМВсего
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
	|		ПО ШтрихкодыУпаковокТоваров.ЗаказКМ = ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка
	|			И (ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование В (&МассивЗПС))
	|			И (НЕ ШтрихкодыУпаковокТоваров.ПометкаУдаления)
	|
	|УПОРЯДОЧИТЬ ПО
	|	КМ
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КМ),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КМВсего)
	|ПО
	|	ЗПС";

КонецПроцедуры

Процедура ТекстЗапросаСписокМарокСпагинациейПоЛимиту(Запрос,Лимит)
	            
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование КАК ЗПС,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодыУпаковокТоваров.Ссылка) КАК КМВсего
	|ПОМЕСТИТЬ ВТМаркиВсего
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
	|		ПО ШтрихкодыУпаковокТоваров.ЗаказКМ = ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка
	|			И (ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование В (&МассивЗПС))
	|			И (НЕ ШтрихкодыУпаковокТоваров.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ %Лимит%
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование КАК ЗПС,
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК КМ,
	|	ШтрихкодыУпаковокТоваров.Наименование КАК Наименование,
	|	ШтрихкодыУпаковокТоваров.ТипКода КАК ТипКода,
	|	ВТМаркиВсего.КМВсего КАК КМВсего
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
	|		ПО ШтрихкодыУпаковокТоваров.ЗаказКМ = ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка
	|			И (ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование В (&МассивЗПС))
	|			И (НЕ ШтрихкодыУпаковокТоваров.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМаркиВсего КАК ВТМаркиВсего
	|		ПО (ВТМаркиВсего.ЗПС = ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Дата,
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка,
	|	Наименование
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КМ),
	|	МАКСИМУМ(КМВсего)
	|ПО
	|	ЗПС";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Лимит%",Лимит);

КонецПроцедуры 

Процедура ТекстЗапросаСписокМарокСпагинацией(Запрос,Лимит,НомерСтраницы)
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование КАК ЗПС,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодыУпаковокТоваров.Ссылка) КАК КМВсего
	|ПОМЕСТИТЬ ВТМаркиВсего
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
	|		ПО ШтрихкодыУпаковокТоваров.ЗаказКМ = ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка
	|			И (ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование В (&МассивЗПС))
	|			И (НЕ ШтрихкодыУпаковокТоваров.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ %НеВключать%
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование КАК ЗПС,
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК КМ,
	|	ШтрихкодыУпаковокТоваров.Наименование КАК Наименование,
	|	ШтрихкодыУпаковокТоваров.ТипКода КАК ТипКода
	|ПОМЕСТИТЬ ВТИсключения
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
	|		ПО ШтрихкодыУпаковокТоваров.ЗаказКМ = ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка
	|			И (ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование В (&МассивЗПС))
	|			И (НЕ ШтрихкодыУпаковокТоваров.ПометкаУдаления)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Дата,
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка,
	|	Наименование
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗПС,
	|	КМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ %Лимит%
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование КАК ЗПС,
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК КМ,
	|	ШтрихкодыУпаковокТоваров.Наименование КАК Наименование,
	|	ШтрихкодыУпаковокТоваров.ТипКода КАК ТипКода,
	|	ВТМаркиВсего.КМВсего КАК КМВсего
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
	|		ПО ШтрихкодыУпаковокТоваров.ЗаказКМ = ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка
	|			И (ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование В (&МассивЗПС))
	|			И (НЕ ШтрихкодыУпаковокТоваров.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМаркиВсего КАК ВТМаркиВсего
	|		ПО (ВТМаркиВсего.ЗПС = ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсключения КАК ВТИсключения
	|		ПО ШтрихкодыУпаковокТоваров.Ссылка = ВТИсключения.КМ
	|			И (ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование = ВТИсключения.ЗПС)
	|ГДЕ
	|	ВТИсключения.КМ ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Дата,
	|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка,
	|	ШтрихкодыУпаковокТоваров.Наименование
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КМ),
	|	МАКСИМУМ(КМВсего)
	|ПО
	|	ЗПС";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Лимит%",Лимит);
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%НеВключать%",Лимит * (НомерСтраницы - 1));

КонецПроцедуры


Функция ПолучитьСписокКоробокПоЗПС(Знач Идентификатор, ПараметрыОтбора) Экспорт
	
	УстановитьПривилегированныйРежим(истина); 
	
	МассивЗПС 		= ПараметрыОтбора.МассивЗПС; 
	Лимит 			= ПараметрыОтбора.Лимит;
	НомерСтраницы 	= ПараметрыОтбора.НомерСтраницы;
	
	ДанныеОтвета 	= СтруктураДанныеСписокТоваровЗПС(Идентификатор); 
	ДанныеОтвета.id = Идентификатор; 
	
	Запрос = Новый Запрос;
	
	ТекстЗапросаСписокКоробокБезПагинации(Запрос);
	
	Если ЗначениеЗаполнено(Лимит) И 
		НЕ ЗначениеЗаполнено(НомерСтраницы) Тогда
		
		ТекстЗапросаСписокКоробокСПагинациейПоЛимиту(Запрос,Лимит); 
		
	ИначеЕсли ЗначениеЗаполнено(Лимит) И 
		ЗначениеЗаполнено(НомерСтраницы) Тогда
		
		ТекстЗапросаСписокКоробокСПагинацией(Запрос,Лимит,НомерСтраницы);
		
	КонецЕсли;

	
	Запрос.УстановитьПараметр("МассивЗПС", МассивЗПС);
		
	ВыборкаИтоги = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаИтоги.Следующий() Цикл
		
		ЗПС = ВыборкаИтоги.ЗПС; 
		
		СтруктураЗПС = ДанныеМассиваЗПССКоробками(); 
		СтруктураЗПС.id   		= XMLСтрока(ЗПС.ссылка.УникальныйИдентификатор());
		СтруктураЗПС.code  		= ЗПС.Номер;
		//++Данилова Е.В. 13.03.2026 MARK-3512 
		//СтруктураЗПС.boxTotal   = ВыборкаИтоги.ШтрихкодУпаковкиВсего;
		//СтруктураЗПС.boxcount   = ВыборкаИтоги.ШтрихкодУпаковки; 
		СтруктураЗПС.boxTotal   = ВыборкаИтоги.ШтрихкодКоробкиВсего;
		СтруктураЗПС.boxcount   = ВыборкаИтоги.ШтрихкодКоробкиКоличество;
		//--Данилова Е.В. 13.03.2026 
		
		ВыборкаКоробки = ВыборкаИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		
		Пока ВыборкаКоробки.Следующий() Цикл
			
			//++Данилова Е.В. 13.03.2026 MARK-3512
			//СтруктураКоробки.code = XMLСтрока(ВыборкаКоробки.ШтрихкодУпаковки.Наименование);
			Если ТипЗнч(ЗПС) = Тип("ДокументСсылка.КонтрактСПроизводителем") Тогда 			
				СтруктураКоробки = ДанныеМассиваКоробкиЗПС(истина);
				
				ВыборкаКоды = ВыборкаКоробки.Выбрать();
				МассивКодов = Новый Массив; 
				Пока ВыборкаКоды.Следующий() Цикл
					
					МассивКодов.Добавить(ВыборкаКоды.ШтрихкодУпаковки.Наименование);  				
					
				КонецЦикла;
				СтруктураКоробки.Markes = МассивКодов;
				СтруктураКоробки.MarkesTotal 	= ВыборкаКоробки.ШтрихкодУпаковки;
			Иначе 
				СтруктураКоробки = ДанныеМассиваКоробкиЗПС();
			КонецЕсли;
			СтруктураКоробки.code 			= XMLСтрока(ВыборкаКоробки.ШтрихкодКоробки.Наименование); 		 
			//--Данилова Е.В. 13.03.2026
			СтруктураЗПС.boxList.Добавить(СтруктураКоробки);
			
		КонецЦикла; 	
		
		ДанныеОтвета.data.Добавить(СтруктураЗПС); 
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ДанныеОтвета; 
	
 КонецФункции
 
 Процедура ТекстЗапросаСписокКоробокБезПагинации(Запрос)
	 //++Данилова Е.В. 13.03.2026 MARK-3512
	 //Запрос.Текст = 
	 //"ВЫБРАТЬ
	 //|	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	 //|	МаркировкаТоваровИСМП.ДокументОснование КАК ЗПС,
	 //|	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковкиВсего
	 //|ИЗ
	 //|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
	 //|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
	 //|		ПО МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка = МаркировкаТоваровИСМП.Ссылка
	 //|			И (МаркировкаТоваровИСМП.ДокументОснование В (&МассивЗПС))
	 //|			И (МаркировкаТоваровИСМП.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов))
	 //|			И (МаркировкаТоваровИСМП.Проведен)
	 //|			И (МаркировкаТоваровИСМП.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
	 //|			И (МаркировкаТоваровИСМП.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан))
	 //|ИТОГИ
	 //|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодУпаковки),
	 //|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодУпаковкиВсего)
	 //|ПО
	 //|	ЗПС";
	 
	 Запрос.текст = 
	"ВЫБРАТЬ
	|	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодКоробки,
	|	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодКоробкиКоличество,
	|	МаркировкаТоваровИСМП.ДокументОснование КАК ЗПС,
	|	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодКоробкиВсего,
	|	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
	|		ПО МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка = МаркировкаТоваровИСМП.Ссылка
	|			И (МаркировкаТоваровИСМП.ДокументОснование В (&МассивЗПС))
	|			И (ТИПЗНАЧЕНИЯ(МаркировкаТоваровИСМП.ДокументОснование) = ТИП(Документ.ЗаказПоставщику))
	|			И (МаркировкаТоваровИСМП.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов))
	|			И (МаркировкаТоваровИСМП.Проведен)
	|			И (МаркировкаТоваровИСМП.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
	|			И (МаркировкаТоваровИСМП.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодКоробки,
	|	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодКоробки,
	|	МаркировкаТоваровИСМП.ДокументОснование,
	|	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодКоробки,
	|	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
	|		ПО МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка = МаркировкаТоваровИСМП.Ссылка
	|			И (МаркировкаТоваровИСМП.ДокументОснование В (&МассивЗПС))
	|			И (ТИПЗНАЧЕНИЯ(МаркировкаТоваровИСМП.ДокументОснование) = ТИП(Документ.КонтрактСПроизводителем))
	|			И (МаркировкаТоваровИСМП.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийМаркировки.Агрегация))
	|			И (МаркировкаТоваровИСМП.Проведен)
	|			И (МаркировкаТоваровИСМП.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
//	|			И (МаркировкаТоваровИСМП.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан))
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодКоробкиКоличество),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодКоробкиВсего),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодУпаковки)
	|ПО
	|	ЗПС,
	|	ШтрихкодКоробки" 
	 
   	//--Данилова Е.В. 13.03.2026 
 КонецПроцедуры  
 
 Процедура ТекстЗапросаСписокКоробокСПагинациейПоЛимиту(Запрос,Лимит)
	 //++Данилова Е.В. 13.03.2026 MARK-3512
	 //Запрос.Текст = 
	 //"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 //|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки) КАК ШтрихкодУпаковки,
	 //|	МаркировкаТоваровИСМП.ДокументОснование КАК ЗПС
	 //|ПОМЕСТИТЬ ВТВсегоКоробок
	 //|ИЗ
	 //|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
	 //|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
	 //|		ПО МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка = МаркировкаТоваровИСМП.Ссылка
	 //|			И (МаркировкаТоваровИСМП.ДокументОснование В (&МассивЗПС))
	 //|			И (МаркировкаТоваровИСМП.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов)) 
	 //|			И (МаркировкаТоваровИСМП.Проведен)
	 //|			И (МаркировкаТоваровИСМП.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
	 //|			И (МаркировкаТоваровИСМП.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан))
	 //|
	 //|СГРУППИРОВАТЬ ПО
	 //|	МаркировкаТоваровИСМП.ДокументОснование
	 //|
	 //|ИНДЕКСИРОВАТЬ ПО
	 //|	ЗПС
	 //|;
	 //|
	 //|////////////////////////////////////////////////////////////////////////////////
	 //|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ %Лимит%
	 //|	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	 //|	МаркировкаТоваровИСМП.ДокументОснование КАК ЗПС,
	 //|	ВТВсегоКоробок.ШтрихкодУпаковки КАК ШтрихкодУпаковкиВсего
	 //|ИЗ
	 //|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
	 //|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
	 //|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВсегоКоробок КАК ВТВсегоКоробок
	 //|			ПО МаркировкаТоваровИСМП.ДокументОснование = ВТВсегоКоробок.ЗПС
	 //|		ПО МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка = МаркировкаТоваровИСМП.Ссылка
	 //|			И (МаркировкаТоваровИСМП.ДокументОснование В (&МассивЗПС))
	 //|			И (МаркировкаТоваровИСМП.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов)) 
	 //|			И (МаркировкаТоваровИСМП.Проведен)
	 //|			И (МаркировкаТоваровИСМП.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
	 //|			И (МаркировкаТоваровИСМП.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан))
	 //|
	 //|УПОРЯДОЧИТЬ ПО
	 //|	МаркировкаТоваровИСМП.ДокументОснование.Дата,
	 //|	МаркировкаТоваровИСМП.ДокументОснование,
	 //|	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки.Наименование
	 //|ИТОГИ
	 //|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодУпаковки),
	 //|	МАКСИМУМ(ШтрихкодУпаковкиВсего)
	 //|ПО
	 //|	ЗПС";     
	 
	 Запрос.Текст = 
	 "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки) КАК ВсегоКоробок,
	 |	МаркировкаТоваровИСМП.ДокументОснование КАК ЗПС
	 |ПОМЕСТИТЬ ВТВсегоКоробок
	 |ИЗ
	 |	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
	 |		ПО МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка = МаркировкаТоваровИСМП.Ссылка
	 |			И (МаркировкаТоваровИСМП.ДокументОснование В (&МассивЗПС))
	 |			И (ТИПЗНАЧЕНИЯ(МаркировкаТоваровИСМП.ДокументОснование) = ТИП(Документ.заказПоставщику))
	 |			И (МаркировкаТоваровИСМП.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов))
	 |			И (МаркировкаТоваровИСМП.Проведен)
	 |			И (МаркировкаТоваровИСМП.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
	 |			И (МаркировкаТоваровИСМП.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан))
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	МаркировкаТоваровИСМП.ДокументОснование
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодКоробки),
	 |	МаркировкаТоваровИСМП.ДокументОснование
	 |ИЗ
	 |	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
	 |		ПО МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка = МаркировкаТоваровИСМП.Ссылка
	 |			И (МаркировкаТоваровИСМП.ДокументОснование В (&МассивЗПС))
	 |			И (ТИПЗНАЧЕНИЯ(МаркировкаТоваровИСМП.ДокументОснование) = ТИП(Документ.КонтрактСПроизводителем))
	 |			И (МаркировкаТоваровИСМП.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийМаркировки.Агрегация))
	 |			И (МаркировкаТоваровИСМП.Проведен)
	 |			И (МаркировкаТоваровИСМП.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
	// |			И (МаркировкаТоваровИСМП.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан))
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	МаркировкаТоваровИСМП.ДокументОснование
	 |
	 |ИНДЕКСИРОВАТЬ ПО
	 |	ЗПС
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ %Лимит%
	 |	ВложенныйЗапрос.ШтрихкодКоробки КАК ШтрихкодКоробки,
	 |	ВложенныйЗапрос.ЗПС КАК ЗПС,
	 |	ВложенныйЗапрос.ШтрихкодКоробкиВсего КАК ШтрихкодКоробкиВсего,
	 |	ВложенныйЗапрос.ОМ КАК ОМ,
	 |	ВложенныйЗапрос.ДатаДок КАК ДатаДок,
	 |	ВложенныйЗапрос.НаименованиеКоробки КАК НаименованиеКоробки
	 |ПОМЕСТИТЬ ВТКоробки
	 |ИЗ
	 |	(ВЫБРАТЬ
	 |		МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодКоробки,
	 |		МаркировкаТоваровИСМП.ДокументОснование КАК ЗПС,
	 |		ВТВсегоКоробок.ВсегоКоробок КАК ШтрихкодКоробкиВсего,
	 |		МаркировкаТоваровИСМП.Ссылка КАК ОМ,
	 |		МаркировкаТоваровИСМП.ДокументОснование.Дата КАК ДатаДок,
	 |		МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки.Наименование КАК НаименованиеКоробки
	 |	ИЗ
	 |		Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
	 |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
	 |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВсегоКоробок КАК ВТВсегоКоробок
	 |				ПО МаркировкаТоваровИСМП.ДокументОснование = ВТВсегоКоробок.ЗПС
	 |			ПО МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка = МаркировкаТоваровИСМП.Ссылка
	 |				И (МаркировкаТоваровИСМП.ДокументОснование В (&МассивЗПС))
	 |				И (ТИПЗНАЧЕНИЯ(МаркировкаТоваровИСМП.ДокументОснование) = ТИП(Документ.заказПоставщику))
	 |				И (МаркировкаТоваровИСМП.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов))
	 |				И (МаркировкаТоваровИСМП.Проведен)
	 |				И (МаркировкаТоваровИСМП.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
	 |				И (МаркировкаТоваровИСМП.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан))
	 |	
	 |	ОБЪЕДИНИТЬ ВСЕ
	 |	
	 |	ВЫБРАТЬ
	 |		МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодКоробки,
	 |		МаркировкаТоваровИСМП.ДокументОснование,
	 |		ВТВсегоКоробок.ВсегоКоробок,
	 |		МаркировкаТоваровИСМП.Ссылка,
	 |		МаркировкаТоваровИСМП.ДокументОснование.Дата,
	 |		МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодКоробки.Наименование
	 |	ИЗ
	 |		Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
	 |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
	 |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВсегоКоробок КАК ВТВсегоКоробок
	 |				ПО МаркировкаТоваровИСМП.ДокументОснование = ВТВсегоКоробок.ЗПС
	 |			ПО МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка = МаркировкаТоваровИСМП.Ссылка
	 |				И (МаркировкаТоваровИСМП.ДокументОснование В (&МассивЗПС))
	 |				И (ТИПЗНАЧЕНИЯ(МаркировкаТоваровИСМП.ДокументОснование) = ТИП(Документ.КонтрактСПроизводителем))
	 |				И (МаркировкаТоваровИСМП.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийМаркировки.Агрегация))
	 |				И (МаркировкаТоваровИСМП.Проведен)
	 |				И (МаркировкаТоваровИСМП.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
	// |				И (МаркировкаТоваровИСМП.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан)
	 | 			) КАК ВложенныйЗапрос
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	ВложенныйЗапрос.ДатаДок,
	 |	ВложенныйЗапрос.ЗПС,
	 |	ВложенныйЗапрос.НаименованиеКоробки
	 |
	 |ИНДЕКСИРОВАТЬ ПО
	 |	ВложенныйЗапрос.ШтрихкодКоробки,
	 |	ВложенныйЗапрос.ЗПС,
	 |	ВложенныйЗапрос.ОМ
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВтКоробки.ШтрихкодКоробки КАК ШтрихкодКоробки,
	 |	ВтКоробки.ШтрихкодКоробки КАК ШтрихкодКоробкиКоличество,
	 |	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	 |	ВтКоробки.ЗПС КАК ЗПС,
	 |	ВтКоробки.ДатаДок КАК ДатаДок,
	 |	ВтКоробки.ШтрихкодКоробкиВсего КАК ШтрихкодКоробкиВсего,
	 |	ВтКоробки.НаименованиеКоробки КАК НаименованиеКоробки
	 |ИЗ
	 |	ВТКоробки КАК ВтКоробки
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
	 |		ПО ВтКоробки.ОМ = МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка
	 |			И ВтКоробки.ШтрихкодКоробки = МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки
	 |ГДЕ
	 |	ТИПЗНАЧЕНИЯ(ВтКоробки.ЗПС) = ТИП(Документ.заказПоставщику)
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	ВтКоробки.ШтрихкодКоробки, 
	 |	ВтКоробки.ШтрихкодКоробки,
	 |	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки,
	 |	ВтКоробки.ЗПС,
	 |	ВтКоробки.ДатаДок,
	 |	ВтКоробки.ШтрихкодКоробкиВсего,
	 |	ВтКоробки.НаименованиеКоробки
	 |ИЗ
	 |	ВТКоробки КАК ВтКоробки
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
	 |		ПО ВтКоробки.ОМ = МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка
	 |			И ВтКоробки.ШтрихкодКоробки = МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодКоробки
	 |ГДЕ
	 |	ТИПЗНАЧЕНИЯ(ВтКоробки.ЗПС) = ТИП(Документ.КонтрактСПроизводителем)
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	ВтКоробки.ДатаДок,
	 |	ЗПС,
	 |	НаименованиеКоробки
	 |ИТОГИ
	 |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодКоробкиКоличество),
	 |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодУпаковки),
	 |	МАКСИМУМ(ШтрихкодКоробкиВсего)
	 |ПО
	 |	ЗПС,
	 |	ШтрихкодКоробки";
	 
	 //--Данилова Е.В. 13.03.2026

	 Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Лимит%",Лимит);

КонецПроцедуры

Процедура ТекстЗапросаСписокКоробокСПагинацией(Запрос,Лимит,НомерСтраницы)
	 //++Данилова Е.В. 13.03.2026 MARK-3512 
	 //Запрос.Текст = 
	 // "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 // |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки) КАК ШтрихкодУпаковки,
	 // |	МаркировкаТоваровИСМП.ДокументОснование КАК ЗПС
	 // |ПОМЕСТИТЬ ВТВсегоКоробок
	 // |ИЗ
	 // |	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
	 // |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
	 // |		ПО МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка = МаркировкаТоваровИСМП.Ссылка
	 // |			И (МаркировкаТоваровИСМП.ДокументОснование В (&МассивЗПС)) 
	 // |			И (МаркировкаТоваровИСМП.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов)) 
	 // |			И (МаркировкаТоваровИСМП.Проведен)
	 // |			И (МаркировкаТоваровИСМП.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
	 // |			И (МаркировкаТоваровИСМП.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан))
	 // |
	 // |СГРУППИРОВАТЬ ПО
	 // |	МаркировкаТоваровИСМП.ДокументОснование
	 // |
	 // |ИНДЕКСИРОВАТЬ ПО
	 // |	ЗПС
	 // |;
	 // |
	 // |////////////////////////////////////////////////////////////////////////////////
	 // |ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ %НеВключать%
	 // |	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	 // |	МаркировкаТоваровИСМП.ДокументОснование КАК ЗПС
	 // |ПОМЕСТИТЬ ВтИсключения
	 // |ИЗ
	 // |	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
	 // |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
	 // |		ПО МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка = МаркировкаТоваровИСМП.Ссылка
	 // |			И (МаркировкаТоваровИСМП.ДокументОснование В (&МассивЗПС))
	 // |			И (МаркировкаТоваровИСМП.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов)) 
	 // |			И (МаркировкаТоваровИСМП.Проведен)
	 // |			И (МаркировкаТоваровИСМП.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
	 // |			И (МаркировкаТоваровИСМП.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан))
	 // |
	 // |УПОРЯДОЧИТЬ ПО
	 // |	МаркировкаТоваровИСМП.ДокументОснование.Дата,
	 // |	МаркировкаТоваровИСМП.ДокументОснование,
	 // |	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки.Наименование
	 // |
	 // |ИНДЕКСИРОВАТЬ ПО
	 // |	ЗПС,
	 // |	ШтрихкодУпаковки
	 // |;
	 // |
	 // |////////////////////////////////////////////////////////////////////////////////
	 // |ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ %Лимит%
	 // |	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	 // |	МаркировкаТоваровИСМП.ДокументОснование КАК ЗПС,
	 // |	ВТВсегоКоробок.ШтрихкодУпаковки КАК ШтрихкодУпаковкиВсего
	 // |ИЗ
	 // |	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
	 // |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
	 // |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВсегоКоробок КАК ВТВсегоКоробок
	 // |			ПО МаркировкаТоваровИСМП.ДокументОснование = ВТВсегоКоробок.ЗПС
	 // |		ПО МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка = МаркировкаТоваровИСМП.Ссылка
	 // |			И (МаркировкаТоваровИСМП.ДокументОснование В (&МассивЗПС))
	 // |			И (МаркировкаТоваровИСМП.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов)) 
	 // |			И (МаркировкаТоваровИСМП.Проведен)
	 // |			И (МаркировкаТоваровИСМП.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
	 // |			И (МаркировкаТоваровИСМП.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан))
	 // |		ЛЕВОЕ СОЕДИНЕНИЕ ВтИсключения КАК ВтИсключения
	 // |		ПО (ВтИсключения.ШтрихкодУпаковки = МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки)
	 // |			И (ВтИсключения.ЗПС = МаркировкаТоваровИСМП.ДокументОснование)
	 // |ГДЕ
	 // |	ВтИсключения.ШтрихкодУпаковки ЕСТЬ NULL
	 // |
	 // |УПОРЯДОЧИТЬ ПО
	 // |	МаркировкаТоваровИСМП.ДокументОснование.Дата,
	 // |	МаркировкаТоваровИСМП.ДокументОснование,
	 // |	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки.Наименование
	 // |ИТОГИ
	 // |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодУпаковки),
	 // |	МАКСИМУМ(ШтрихкодУпаковкиВсего)
	 // |ПО
	 // |	ЗПС";     %Лимит%
		 
		 Запрос.Текст = 
		 "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		 |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки) КАК ВсегоКоробок,
		 |	МаркировкаТоваровИСМП.ДокументОснование КАК ЗПС
		 |ПОМЕСТИТЬ ВТВсегоКоробок
		 |ИЗ
		 |	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
		 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
		 |		ПО МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка = МаркировкаТоваровИСМП.Ссылка
		 |			И (МаркировкаТоваровИСМП.ДокументОснование В (&МассивЗПС))
		 |			И (ТИПЗНАЧЕНИЯ(МаркировкаТоваровИСМП.ДокументОснование) = ТИП(Документ.заказПоставщику))
		 |			И (МаркировкаТоваровИСМП.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов))
		 |			И (МаркировкаТоваровИСМП.Проведен)
		 |			И (МаркировкаТоваровИСМП.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
		 |			И (МаркировкаТоваровИСМП.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан))
		 |
		 |СГРУППИРОВАТЬ ПО
		 |	МаркировкаТоваровИСМП.ДокументОснование
		 |
		 |ОБЪЕДИНИТЬ ВСЕ
		 |
		 |ВЫБРАТЬ
		 |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодКоробки),
		 |	МаркировкаТоваровИСМП.ДокументОснование
		 |ИЗ
		 |	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
		 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
		 |		ПО МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка = МаркировкаТоваровИСМП.Ссылка
		 |			И (МаркировкаТоваровИСМП.ДокументОснование В (&МассивЗПС))
		 |			И (ТИПЗНАЧЕНИЯ(МаркировкаТоваровИСМП.ДокументОснование) = ТИП(Документ.КонтрактСПроизводителем))
		 |			И (МаркировкаТоваровИСМП.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийМаркировки.Агрегация))
		 |			И (МаркировкаТоваровИСМП.Проведен)
		 |			И (МаркировкаТоваровИСМП.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
		 //|			И (МаркировкаТоваровИСМП.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан))
		 |
		 |СГРУППИРОВАТЬ ПО
		 |	МаркировкаТоваровИСМП.ДокументОснование
		 |
		 |ИНДЕКСИРОВАТЬ ПО
		 |	ЗПС
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ %НеВключать%
		 |	ВложенныйЗапрос.ШтрихкодКоробки КАК ШтрихкодКоробки,
		 |	ВложенныйЗапрос.ЗПС КАК ЗПС,
		 |	ВложенныйЗапрос.ОМ КАК ОМ,
		 |	ВложенныйЗапрос.ДатаДок КАК ДатаДок,
		 |	ВложенныйЗапрос.НаименованиеКоробки КАК НаименованиеКоробки
		 |ПОМЕСТИТЬ ВтИсключения
		 |ИЗ
		 |	(ВЫБРАТЬ
		 |		МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодКоробки,
		 |		МаркировкаТоваровИСМП.ДокументОснование КАК ЗПС,
		 |		МаркировкаТоваровИСМП.Ссылка КАК ОМ,
		 |		МаркировкаТоваровИСМП.ДокументОснование.Дата КАК ДатаДок,
		 |		МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки.Наименование КАК НаименованиеКоробки
		 |	ИЗ
		 |		Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
		 |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
		 |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВсегоКоробок КАК ВТВсегоКоробок
		 |				ПО МаркировкаТоваровИСМП.ДокументОснование = ВТВсегоКоробок.ЗПС
		 |			ПО МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка = МаркировкаТоваровИСМП.Ссылка
		 |				И (МаркировкаТоваровИСМП.ДокументОснование В (&МассивЗПС))
		 |				И (ТИПЗНАЧЕНИЯ(МаркировкаТоваровИСМП.ДокументОснование) = ТИП(Документ.заказПоставщику))
		 |				И (МаркировкаТоваровИСМП.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов))
		 |				И (МаркировкаТоваровИСМП.Проведен)
		 |				И (МаркировкаТоваровИСМП.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
		 |				И (МаркировкаТоваровИСМП.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан))
		 |	
		 |	ОБЪЕДИНИТЬ ВСЕ
		 |	
		 |	ВЫБРАТЬ
		 |		МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодКоробки,
		 |		МаркировкаТоваровИСМП.ДокументОснование,
		 |		МаркировкаТоваровИСМП.Ссылка,
		 |		МаркировкаТоваровИСМП.ДокументОснование.Дата,
		 |		МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодКоробки.Наименование
		 |	ИЗ
		 |		Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
		 |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
		 |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВсегоКоробок КАК ВТВсегоКоробок
		 |				ПО МаркировкаТоваровИСМП.ДокументОснование = ВТВсегоКоробок.ЗПС
		 |			ПО МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка = МаркировкаТоваровИСМП.Ссылка
		 |				И (МаркировкаТоваровИСМП.ДокументОснование В (&МассивЗПС))
		 |				И (ТИПЗНАЧЕНИЯ(МаркировкаТоваровИСМП.ДокументОснование) = ТИП(Документ.КонтрактСПроизводителем))
		 |				И (МаркировкаТоваровИСМП.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийМаркировки.Агрегация))
		 |				И (МаркировкаТоваровИСМП.Проведен)
		 |				И (МаркировкаТоваровИСМП.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
		// |				И (МаркировкаТоваровИСМП.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан))
		  |) КАК ВложенныйЗапрос
		 |
		 |УПОРЯДОЧИТЬ ПО
		 |	ВложенныйЗапрос.ДатаДок,
		 |	ВложенныйЗапрос.ЗПС,
		 |	ВложенныйЗапрос.НаименованиеКоробки
		 |
		 |ИНДЕКСИРОВАТЬ ПО
		 |	ВложенныйЗапрос.ШтрихкодКоробки,
		 |	ВложенныйЗапрос.ЗПС,
		 |	ВложенныйЗапрос.ОМ
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ %Лимит%
		 |	ВложенныйЗапрос.ШтрихкодКоробки КАК ШтрихкодКоробки,
		 |	ВложенныйЗапрос.ЗПС КАК ЗПС,
		 |	ВложенныйЗапрос.ШтрихкодКоробкиВсего КАК ШтрихкодКоробкиВсего,
		 |	ВложенныйЗапрос.ОМ КАК ОМ,
		 |	ВложенныйЗапрос.ДатаДок КАК ДатаДок,
		 |	ВложенныйЗапрос.НаименованиеКоробки КАК НаименованиеКоробки
		 |ПОМЕСТИТЬ ВТКоробки
		 |ИЗ
		 |	(ВЫБРАТЬ
		 |		МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодКоробки,
		 |		МаркировкаТоваровИСМП.ДокументОснование КАК ЗПС,
		 |		ВТВсегоКоробок.ВсегоКоробок КАК ШтрихкодКоробкиВсего,
		 |		МаркировкаТоваровИСМП.Ссылка КАК ОМ,
		 |		МаркировкаТоваровИСМП.ДокументОснование.Дата КАК ДатаДок,
		 |		МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки.Наименование КАК НаименованиеКоробки
		 |	ИЗ
		 |		Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
		 |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
		 |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВсегоКоробок КАК ВТВсегоКоробок
		 |				ПО МаркировкаТоваровИСМП.ДокументОснование = ВТВсегоКоробок.ЗПС
		 |			ПО МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка = МаркировкаТоваровИСМП.Ссылка
		 |				И (МаркировкаТоваровИСМП.ДокументОснование В (&МассивЗПС))
		 |				И (ТИПЗНАЧЕНИЯ(МаркировкаТоваровИСМП.ДокументОснование) = ТИП(Документ.заказПоставщику))
		 |				И (МаркировкаТоваровИСМП.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов))
		 |				И (МаркировкаТоваровИСМП.Проведен)
		 |				И (МаркировкаТоваровИСМП.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
		 |				И (МаркировкаТоваровИСМП.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан))
		 |			ЛЕВОЕ СОЕДИНЕНИЕ ВтИсключения КАК ВтИсключения
		 |			ПО (ВтИсключения.ШтрихкодКоробки = МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки)
		 |				И (ВтИсключения.ЗПС = МаркировкаТоваровИСМП.ДокументОснование)
		 |				И (ВтИсключения.ОМ = МаркировкаТоваровИСМП.Ссылка)
		 |	ГДЕ
		 |		ВтИсключения.ШтрихкодКоробки ЕСТЬ NULL
		 |	
		 |	ОБЪЕДИНИТЬ ВСЕ
		 |	
		 |	ВЫБРАТЬ
		 |		МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодКоробки,
		 |		МаркировкаТоваровИСМП.ДокументОснование,
		 |		ВТВсегоКоробок.ВсегоКоробок,
		 |		МаркировкаТоваровИСМП.Ссылка,
		 |		МаркировкаТоваровИСМП.ДокументОснование.Дата,
		 |		МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодКоробки.Наименование
		 |	ИЗ
		 |		Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
		 |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
		 |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВсегоКоробок КАК ВТВсегоКоробок
		 |				ПО МаркировкаТоваровИСМП.ДокументОснование = ВТВсегоКоробок.ЗПС
		 |			ПО МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка = МаркировкаТоваровИСМП.Ссылка
		 |				И (МаркировкаТоваровИСМП.ДокументОснование В (&МассивЗПС))
		 |				И (ТИПЗНАЧЕНИЯ(МаркировкаТоваровИСМП.ДокументОснование) = ТИП(Документ.КонтрактСПроизводителем))
		 |				И (МаркировкаТоваровИСМП.ВидОперации = ЗНАЧЕНИЕ(перечисление.ВидыОперацийМаркировки.Агрегация))
		 |				И (МаркировкаТоваровИСМП.Проведен)
		 |				И (МаркировкаТоваровИСМП.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
		// |				И (МаркировкаТоваровИСМП.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан))
		 |			ЛЕВОЕ СОЕДИНЕНИЕ ВтИсключения КАК ВтИсключения
		 |			ПО (ВтИсключения.ШтрихкодКоробки = МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодКоробки)
		 |				И (ВтИсключения.ЗПС = МаркировкаТоваровИСМП.ДокументОснование)
		 |				И (ВтИсключения.ОМ = МаркировкаТоваровИСМП.Ссылка)
		 |	ГДЕ
		 |		ВтИсключения.ШтрихкодКоробки ЕСТЬ NULL) КАК ВложенныйЗапрос
		 |
		 |УПОРЯДОЧИТЬ ПО
		 |	ВложенныйЗапрос.ДатаДок,
		 |	ВложенныйЗапрос.ЗПС,
		 |	ВложенныйЗапрос.НаименованиеКоробки
		 |
		 |ИНДЕКСИРОВАТЬ ПО
		 |	ВложенныйЗапрос.ШтрихкодКоробки,
		 |	ВложенныйЗапрос.ЗПС,
		 |	ВложенныйЗапрос.ОМ
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	ВтКоробки.ШтрихкодКоробки КАК ШтрихкодКоробки,
		 |	ВтКоробки.ШтрихкодКоробки КАК ШтрихкодКоробкиКоличество,
		 |	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
		 |	ВтКоробки.ЗПС КАК ЗПС,
		 |	ВтКоробки.ДатаДок КАК ДатаДок,
		 |	ВтКоробки.ШтрихкодКоробкиВсего КАК ШтрихкодКоробкиВсего,
		 |	ВтКоробки.НаименованиеКоробки КАК НаименованиеКоробки
		 |ИЗ
		 |	ВТКоробки КАК ВтКоробки
		 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
		 |		ПО ВтКоробки.ОМ = МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка
		 |			И ВтКоробки.ШтрихкодКоробки = МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки
		 |ГДЕ
		 |	ТИПЗНАЧЕНИЯ(ВтКоробки.ЗПС) = ТИП(Документ.заказПоставщику)
		 |
		 |ОБЪЕДИНИТЬ ВСЕ
		 |
		 |ВЫБРАТЬ
		 |	ВтКоробки.ШтрихкодКоробки,
		 |	ВтКоробки.ШтрихкодКоробки,
		 |	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки,
		 |	ВтКоробки.ЗПС,
		 |	ВтКоробки.ДатаДок,
		 |	ВтКоробки.ШтрихкодКоробкиВсего,
		 |	ВтКоробки.НаименованиеКоробки
		 |ИЗ
		 |	ВТКоробки КАК ВтКоробки
		 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
		 |		ПО ВтКоробки.ОМ = МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка
		 |			И ВтКоробки.ШтрихкодКоробки = МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодКоробки
		 |ГДЕ
		 |	ТИПЗНАЧЕНИЯ(ВтКоробки.ЗПС) = ТИП(Документ.КонтрактСПроизводителем)
		 |
		 |УПОРЯДОЧИТЬ ПО
		 |	ВтКоробки.ДатаДок,
		 |	ЗПС,
		 |	НаименованиеКоробки
		 |ИТОГИ
		 |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодКоробкиКоличество),
		 |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодУпаковки),
		 |	МАКСИМУМ(ШтрихкодКоробкиВсего)
		 |ПО
		 |	ЗПС,
		 |	ШтрихкодКоробки"; 
	  
	//--Данилова Е.В. 13.03.2026  
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Лимит%",Лимит);
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%НеВключать%",Лимит * (НомерСтраницы - 1));

КонецПроцедуры


 Функция СтруктураДанныеСписокТоваровЗПС(Знач Идентификатор)
	
	Основная = Новый Структура; 
	Основная.Вставить("data", Новый Массив);
	Основная.Вставить("id",Идентификатор); 
	
	Возврат Основная; 
	
КонецФункции

Функция ДанныеМассиваЗПССТоварами()
	
	ДанныеМас = Новый Структура(); 
	ДанныеМас.Вставить("id","");
	ДанныеМас.Вставить("code","");  
	ДанныеМас.Вставить("factory","");
	ДанныеМас.Вставить("dateCreate","");
	ДанныеМас.Вставить("dateUpdate","");
	ДанныеМас.Вставить("statusName","");
	ДанныеМас.Вставить("factoryId","");
	ДанныеМас.Вставить("statusCode","");
	//++Данилова Е.В. 26.05.2026 без задачи
	ДанныеМас.Вставить("type_doc","");
	ДанныеМас.Вставить("Invoice","");
	ДанныеМас.Вставить("type_order","full");
	ДанныеМас.Вставить("number_order","");
	//--Данилова Е.В. 26.05.2026 
	ДанныеМас.Вставить("boxTotal",0);
	ДанныеМас.Вставить("markesTotal",0);
	ДанныеМас.Вставить("productTotal",0);
	ДанныеМас.Вставить("productList",Новый Массив);
	//ДанныеМас.Вставить("boxList",Новый Массив);
	//ДанныеМас.Вставить("Markes",Новый Массив);
	
	Возврат ДанныеМас; 
	
КонецФункции

Функция ДанныеМассиваЗПССМарками()
	
	ДанныеМас = Новый Структура(); 
	ДанныеМас.Вставить("id","");
	ДанныеМас.Вставить("code","");  
	//ДанныеМас.Вставить("factory","");
	//ДанныеМас.Вставить("dateCreate","");
	//ДанныеМас.Вставить("dateUpdate","");
	//ДанныеМас.Вставить("statusName","");
	//ДанныеМас.Вставить("factoryId","");
	//ДанныеМас.Вставить("statusCode","");
	//ДанныеМас.Вставить("boxTotal",0);
	ДанныеМас.Вставить("markesTotal",0);
	ДанныеМас.Вставить("markesCount",0);
	//ДанныеМас.Вставить("productList",Новый Массив);
	//ДанныеМас.Вставить("boxList",Новый Массив);
	ДанныеМас.Вставить("markes",Новый Массив);
	
	Возврат ДанныеМас; 
	
КонецФункции

Функция ДанныеМассиваЗПССКоробками()
	
	ДанныеМас = Новый Структура(); 
	ДанныеМас.Вставить("id","");
	ДанныеМас.Вставить("code","");  
	//ДанныеМас.Вставить("factory","");
	//ДанныеМас.Вставить("dateCreate","");
	//ДанныеМас.Вставить("dateUpdate","");
	//ДанныеМас.Вставить("statusName","");
	//ДанныеМас.Вставить("factoryId","");
	//ДанныеМас.Вставить("statusCode","");
	ДанныеМас.Вставить("boxTotal",0);
	ДанныеМас.Вставить("boxcount",0);
	//ДанныеМас.Вставить("MarkesTotal",0);
	//ДанныеМас.Вставить("productList",Новый Массив);
	ДанныеМас.Вставить("boxList",Новый Массив);
	//ДанныеМас.Вставить("Markes",Новый Массив);
	
	Возврат ДанныеМас; 
	
КонецФункции

Функция ДанныеМассиваТоварыЗПС()
	
	
	ДанныеМас = Новый Структура(); 
	ДанныеМас.Вставить("id","");
	ДанныеМас.Вставить("name","");  
	ДанныеМас.Вставить("size","");
	ДанныеМас.Вставить("color","");
	ДанныеМас.Вставить("count",0);
	ДанныеМас.Вставить("picture","");
	ДанныеМас.Вставить("multibox",0); 
	ДанныеМас.Вставить("GTIN","");
	//++Данилова Е.В. 09.03.2026 MARK-3512
	ДанныеМас.Вставить("id_parent","");
	//--Данилова Е.В. 09.03.2026 
	//++Данилова Е.В. 26.05.2026 без задачи 
	ДанныеМас.Вставить("code","");
	ДанныеМас.Вставить("code_parent","");
	ДанныеМас.Вставить("code_maker","");
	//--Данилова Е.В. 26.05.2026 
	Возврат ДанныеМас;

КонецФункции // ДанныеМассиваТоварыЗПС()

Функция ДанныеМассиваКоробкиЗПС(СМарками = ложь)
	
	
	ДанныеМас = Новый Структура(); 
	ДанныеМас.Вставить("code","");
	//ДанныеМас.Вставить("productTotal",0);  
	//ДанныеМас.Вставить("productList",Новый Массив);
	//++Данилова Е.В. 13.03.2026 MARK-3512 
	Если СМарками Тогда 
		ДанныеМас.Вставить("Markes",Новый Массив);
		ДанныеМас.Вставить("MarkesTotal",0);
	КонецЕсли;
	//--Данилова Е.В. 13.03.2026 
	Возврат ДанныеМас;

КонецФункции

Процедура ЗаписатьВходящиеДанныеЗапросаИсторияЗапросовФабрики(Знач ИдентификаторЗапроса, ПараметрыЗапроса, СтруктураЗапроса) Экспорт
	
	УстановитьПривилегированныйРежим(истина);
	
	МенеджерЗаписи = Регистрысведений.ИсторияЗапросовПриложенияФабрик.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИД = ИдентификаторЗапроса; 
	МенеджерЗаписи.Запрос = Новый ХранилищеЗначения(СтруктураЗапроса,Новый СжатиеДанных(9));
	МенеджерЗаписи.ПараметрыЗапроса = ЗначениеВСтрокуВнутр(ПараметрыЗапроса); 
	МенеджерЗаписи.ДатаЗапроса = ТекущаяДатаСеанса(); 
	Если СтруктураЗапроса.Свойство("requestId") Тогда
		
		МенеджерЗаписи.ИДКлиента = СтруктураЗапроса.requestId; 	
		
	КонецЕсли;
	Попытка
		
		МенеджерЗаписи.Записать(); 
		
	Исключение 
		
		ЗаписьЖурналаРегистрации("ИсторияЗапросовПриложенияФабрик",УровеньЖурналаРегистрации.Ошибка,Метаданные.РегистрыСведений.ИсторияЗапросовПриложенияФабрик,,"Ошибка записи",); 
		
	КонецПопытки; 
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура ЗаписатьИсходящиеДанныеИсторияЗапросаФабрики(Знач ИдентификаторЗапроса,СтруктураОтвета, КодОтвета) Экспорт
	
	УстановитьПривилегированныйРежим(истина);
	
	Наборзаписей = РегистрыСведений.ИсторияЗапросовПриложенияФабрик.СоздатьНаборЗаписей(); 
	Наборзаписей.Отбор.ИД.Установить(ИдентификаторЗапроса);
	Наборзаписей.Прочитать();
	
	Если Наборзаписей.Количество() > 0  Тогда
		
		Для каждого ЗаписьНабора  Из Наборзаписей Цикл
			
			ЗаписьНабора.Ответ = Новый ХранилищеЗначения(СтруктураОтвета,Новый СжатиеДанных(9)); 
			ЗаписьНабора.КодОтвета = КодОтвета;
			
		КонецЦикла;	
		
	КонецЕсли;
	Попытка
	
		Наборзаписей.Записать(); 
	
	Исключение
		
		ЗаписьЖурналаРегистрации("ИсторияЗапросовПриложенияФабрик",УровеньЖурналаРегистрации.Ошибка,Метаданные.РегистрыСведений.ИсторияЗапросовПриложенияФабрик,,"Ошибка записи",);

	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Функция ПреобразоватьДатуДляПередачиНаПортал(Знач Дата)

	 Возврат Формат(Дата,"ДЛФ=DT"); 

КонецФункции

Функция СоответствиеСтатусКодСтатусаЗПС()

	Соответствие = новый Соответствие; 
	Соответствие.Вставить(Перечисления.СостояниеЗаказаПоставщику.ВРаботе,1); 
	Соответствие.Вставить(Перечисления.СостояниеЗаказаПоставщику.ПредварительныйЗаказ,2);
	Соответствие.Вставить(Перечисления.СостояниеЗаказаПоставщику.ПодтвержденныйЗаказ,3);
	Соответствие.Вставить(Перечисления.СостояниеЗаказаПоставщику.Ликвидирован,4);
	
	Соответствие.Вставить(Перечисления.СостояниеЗаказаПоставщику.ВПути,5); 
	Соответствие.Вставить(Перечисления.СостояниеЗаказаПоставщику.Таможня,6);
	Соответствие.Вставить(Перечисления.СостояниеЗаказаПоставщику.Получен,7);
	Соответствие.Вставить(Перечисления.СостояниеЗаказаПоставщику.ВПроизводстве,8);
	
	Соответствие.Вставить(Перечисления.СостояниеЗаказаПоставщику.Произведен,9);
	Соответствие.Вставить(Перечисления.СостояниеЗаказаПоставщику.Закрыт,10);
	Соответствие.Вставить(Перечисления.СостояниеЗаказаПоставщику.ВПутиВРФ,11);

    Возврат Соответствие; 
КонецФункции // СоответствиеСтатусКодСтатуса()


Функция ПрочитатьТелоЗапросаВСтруктуру(Знач ТелоЗапроса) Экспорт 

	ЧтениеJSON = Новый ЧтениеJSON;                          
	
	ЧтениеJSON.УстановитьСтроку(СтрЗаменить(ТелоЗапроса,"==","NevW"));
	
	Возврат ПрочитатьJSON(ЧтениеJSON,);
	
	
КонецФункции // ПрочитатьJSON()

Процедура ПроставитьОтправкуМарокПоЗПСВФоне(Знач МассивЗПС)

	Если МассивЗПС.Количество() > 0  Тогда
		
		ПараметрыФонЗадания = Новый Массив; 
		ПараметрыФонЗадания.Добавить(МассивЗПС); 
		
		ИдентификаторФЗ = Новый УникальныйИдентификатор; 
		ФЗадание = ФоновыеЗадания.Выполнить("ОбменДаннымиПоAPI_ТСД.ПроставитьОтправкуМарокПоЗПС",ПараметрыФонЗадания,ИдентификаторФЗ,"ПроставитьОтправкуМарокПоЗПС");  	
		
	КонецЕсли;

КонецПроцедуры

Процедура ПроставитьОтправкуМарокПоЗПС(Знач МассивЗПС) Экспорт
	УстановитьПривилегированныйРежим(истина); 
	МассивДляЗаписи = Новый Массив; 
	Для каждого ЗначениеЗПС Из МассивЗПС Цикл
		Если ЗначениеЗПС.СостояниеПроверкиМарокНаТСД <> Перечисления.СостоянияПроверкиМарокНаТСД.МаркиОтправлены Тогда
			
			ОбъектЗПС = ЗначениеЗПС.ПолучитьОбъект(); 	
			ОбъектЗПС.СостояниеПроверкиМарокНаТСД = Перечисления.СостоянияПроверкиМарокНаТСД.МаркиОтправлены;
			
			МассивДляЗаписи.Добавить(ОбъектЗПС); 
			
		КонецЕсли;
		
	КонецЦикла;
	
	НачатьТранзакцию(); 
	Для каждого ОбЗПС Из МассивДляЗаписи Цикл
		
		
		Попытка
			
			ОбЗПС.Записать(); 
			
		Исключение
			ЗаписатьВЛог("СостоянияПроверкиМарокНаТСД","Не удалось поменять состояние проверки марок на ТСД на ""Марки отправлены""" + Строка(ОбЗПС.ссылка),"Ошибка"); 
			Если ТранзакцияАктивна() Тогда
				
				ОтменитьТранзакцию();
				
				УстановитьПривилегированныйРежим(Ложь);
				
				Прервать; 
			КонецЕсли;
		КонецПопытки; 	
		
		
	КонецЦикла;
	Если ТранзакцияАктивна() Тогда
		
		ЗафиксироватьТранзакцию();	
		
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

 	
 #КонецОбласти  
 //++Данилова Е.В. 13.03.2026 MARK-3512 
 #Область РаботаСДокументами
 
 Функция ПолучитьСостояниеПроверкиМарокНаТСД(Знач Контрагент,СостояниеПроверкиМарокНаТСД) Экспорт
	 
	 //Кухарь А.Ю.  06.04.2026 начало
	 //Иногда КП создают с пустым контрагентом
	 если не ЗначениеЗаполнено(Контрагент) тогда    
		  СостояниеПроверкиМарокНаТСД = Перечисления.СостоянияПроверкиМарокНаТСД.НеТребуетсяОтправлять;   
		  Возврат Неопределено;
	 КонецЕсли;
	 //Кухарь А.Ю.  06.04.2026 конец
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	Контрагенты.ВыгружатьМаркиЗПСДляТСД КАК ВыгружатьМаркиЗПСДляТСД
	 |ИЗ
	 |	Справочник.Контрагенты КАК Контрагенты
	 |ГДЕ
	 |	Контрагенты.Ссылка = &Ссылка";
	 
	 Запрос.УстановитьПараметр("Ссылка", Контрагент);
	 
	 РезультатЗапроса = Запрос.Выполнить();
	 
	 ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	 ВыборкаДетальныеЗаписи.Следующий(); 
	 
	 Если ВыборкаДетальныеЗаписи.ВыгружатьМаркиЗПСДляТСД 
		 И СостояниеПроверкиМарокНаТСД = перечисления.СостоянияПроверкиМарокНаТСД.ПустаяСсылка() Тогда
		 
		 СостояниеПроверкиМарокНаТСД = Перечисления.СостоянияПроверкиМарокНаТСД.НеТребуетсяОтправлять; 
		 
	 КонецЕсли;
	 
	 Если НЕ ВыборкаДетальныеЗаписи.ВыгружатьМаркиЗПСДляТСД 
		 И СостояниеПроверкиМарокНаТСД = перечисления.СостоянияПроверкиМарокНаТСД.НеТребуетсяОтправлять Тогда
		 
		 СостояниеПроверкиМарокНаТСД = Перечисления.СостоянияПроверкиМарокНаТСД.ПустаяСсылка(); 
		 
	 КонецЕсли;
	 
	// Возврат СостояниеПроверкиМарокНаТСД; 
	 
 КонецФункции
 
 Процедура ЗапуститьВФонеИзменениеДатыДокументовЗаказа(Знач ДокРегистрации, Знач ИдентификаторФЗ) Экспорт
	 
	 МассивПараметров = Новый Массив; 
	 МассивПараметров.Добавить(ДокРегистрации);
	 
	 ФЗадание = ФоновыеЗадания.Выполнить("ОбменДаннымиПоAPI_ТСД.ЗаписатьВФонеДатуИзмененияЗаказовДляТСД",МассивПараметров,ИдентификаторФЗ,"ЗаписатьВФонеДатуИзмененияЗаказовДляТСД"); 
	 
 КонецПроцедуры
 
 Процедура ЗаписатьВФонеДатуИзмененияЗаказовДляТСД(Знач ДокументЗаказа) Экспорт
	 
	 ДокОбъект = ДокументЗаказа.ПолучитьОбъект(); 
	 ДокОбъект.ДатаИзменения = ТекущаяДатаСеанса(); 
	 Попытка
		 
		 ДокОбъект.Записать(); 
		 
	 Исключение
		 ЗаписатьВЛог("ФоновоеЗаданиеДляТСД","не удалось изменить дату изменения по заказу " + Строка(ДокументЗаказа),"Ошибка"); 
	 КонецПопытки;
 КонецПроцедуры

 	
 #КонецОбласти
 //--Данилова Е.В. 13.03.2026
#КонецОбласти 

