
&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	// Вставить содержимое обработчика.
	Если НЕ ЗначениеЗаполнено(Объект.Подразделение) Тогда
		ПоказатьПредупреждение(,"Сначала выберите подразделение");
		Возврат;
	КонецЕсли;	
	Объект.Комментарий = "";
	ДиалогФыбораФайла								=	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогФыбораФайла.Фильтр						=	"Файлы Excel (*.xls;*.xlsx)|*.xls;*.xlsx";
	ДиалогФыбораФайла.Заголовок						=	"Выберите файл";
	ДиалогФыбораФайла.ПредварительныйПросмотр		=	Ложь;
	ДиалогФыбораФайла.Расширение					=	"xlsx, xls";
	ДиалогФыбораФайла.ИндексФильтра					=	0;
	Прод=Ложь;
	Если ДиалогФыбораФайла.Выбрать() Тогда 
		
		Расшир = "";
		ИмяФайла = ДиалогФыбораФайла.ПолноеИмяФайла;
		ПослТочка = СтрНайти(ДиалогФыбораФайла.ПолноеИмяФайла, ".", НаправлениеПоиска.СКонца);
		Если ПослТочка > 0 Тогда
			Расшир = Сред(ДиалогФыбораФайла.ПолноеИмяФайла, ПослТочка + 1);
			ИмяФайла = Лев(ИмяФайла,  ПослТочка - 1);
			ПослСлэш = СтрНайти(ИмяФайла, "\", НаправлениеПоиска.СКонца);
			ИмяФайла = ?(ПослСлэш > 0, Сред(ИмяФайла, ПослСлэш + 1), ИмяФайла);  
		КонецЕсли;
		Объект.РасширениеИсходногоФайла = Расшир;
		Объект.ЗагруженВЦО = Истина;
		Объект.ИмяИсходногоФайла = ИмяФайла;
		ФайлС = Новый ДвоичныеДанные(ДиалогФыбораФайла.ПолноеИмяФайла);
    	АдресФ = ПоместитьВоВременноеХранилище(ФайлС, ЭтаФорма.УникальныйИдентификатор);
		ПрочитатьФайл(АдресФ, Расшир);  
		ОбработатьТД();
		//Попытка
		//	ТабличныйДокумент.Прочитать(ДиалогФыбораФайла.ПолноеИмяФайла);
		//Исключение
		//	Сообщить(ОписаниеОшибки());
		//	//Рез.Вставить("Ошибка","Ошибка при обработке икселя "+ОписаниеОшибки());
		//	//Возврат Рез;
		//КонецПопытки;
		
		//РезультатОбр=ПроверитьИкс(ДиалогФыбораФайла.ПолноеИмяФайла);
		Объект.Комментарий = Объект.Комментарий + "Загрузка файла " + Объект.ИмяИсходногоФайла + "." + Объект.РасширениеИсходногоФайла;
		МожноОбработать = ПровЗагружД(Объект.ИменаКолонок);	
		Если МожноОбработать Тогда
			ОбработатьНаСервере();
		Иначе
			Объект.Комментарий = Объект.Комментарий + " в загружаемом файле есть колонки без наименования - дальнейшая обработка невозможна";
		КонецЕсли;
		
		Элементы.ФормаОбработать.Доступность = МожноОбработать;
		Элементы.Группа5.ТекущаяСтраница = ?(МожноОбработать, Элементы.Группа8, Элементы.Группа6);
		Элементы.ФормаФормирДок.Доступность = МожноФормировать;
		Элементы.Статус.Картинка = ?(Объект.ИменаКолонок.Количество() = 0, БиблиотекаКартинок.ОформлениеКвадратыПустые, ?(МожноОбработать, БиблиотекаКартинок.ОформлениеКругЗелeный, БиблиотекаКартинок.ОформлениеКругКрасный));
		ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
		ЭтаФорма.Записать();
		ЭтаФорма.ОбновитьОтображениеДанных();
	Иначе
		ПоказатьПредупреждение(,НСтр("ru='Файл не выбран'"));
		Возврат;
	КонецЕсли;
	Если Объект.Товары.Количество() Тогда
		Элементы.Группа10.Заголовок = "Товары (" + Формат(Объект.Товары.Итог("Количество"), "ЧДЦ=0; ЧГ=3,0") + ")";
	Иначе
		Элементы.Группа10.Заголовок = "Товары";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФайл(АдресФ, Расшир) 
	ИсхТаблица.Очистить();
	ИмяПромежуточногоФайла = ПолучитьИмяВременногоФайла(Расшир);

	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресФ);
	Объект.ИсходныйФайлСтрока = Base64Строка(ДанныеФайла);
	//сообщить(" ДанныеФайла "+строка(ДанныеФайла));
	ДанныеФайла.Записать(ИмяПромежуточногоФайла);
	Объект.ЗагруженВЦО = Истина;
	
	Попытка
		ИсхТаблица.Прочитать(ИмяПромежуточногоФайла);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
    Попытка
		УдалитьФайлы(ИмяПромежуточногоФайла);
	
	Исключение
	КонецПопытки;
КонецПроцедуры   

&НаСервере
Процедура ОбработатьТД()
	Объект.ИменаКолонок.Очистить();
	Объект.ЗначенияКолонок.Очистить();
	Объект.Товары.Очистить();
	Объект.Брэнды.Очистить();
	Объект.ВидыНоменклатуры.Очистить();
	Объект.Цвета.Очистить();
	Объект.Размеры.Очистить();
	Объект.Коллекции.Очистить();
	нс = Объект.НомСтрКол;
	ПК = 100;
	Пока ПК >0 Цикл
		Если  НЕ СокрЛП(ИсхТаблица.Область(нс, ПК).Текст) = "" ИЛИ НЕ СокрЛП(ИсхТаблица.Область(нс + 1, ПК).Текст) = "" ИЛИ НЕ СокрЛП(ИсхТаблица.Область(нс + 2, ПК).Текст) = ""
			ИЛИ НЕ СокрЛП(ИсхТаблица.Область(нс + 3, ПК).Текст) = "" ИЛИ НЕ СокрЛП(ИсхТаблица.Область(нс + 4, ПК).Текст) = "" Тогда
			Прервать;
		КонецЕсли;	
		ПК = ПК - 1;
	КонецЦикла;
	нк = 1;
	кк = 0;
	Пока нк <= ПК Цикл
		НовСтр = Объект.ИменаКолонок.Добавить();
		НовСтр.НомерКолонки = нк;
		НовСтр.ИмяКолонки = ?(СокрЛП(ИсхТаблица.Область(нс, нк).Текст) = "", "<>", СокрЛП(ИсхТаблица.Область(нс, нк).Текст));
		нк = нк + 1;
		кк = кк + 1;
	КонецЦикла;
	
	нс = Объект.НомСтрКол + 1;
	нк = 1;
	Пока НЕ ПустаяСтрока(ИсхТаблица.Область(нс, 1).Текст) ИЛИ НЕ ПустаяСтрока(ИсхТаблица.Область(нс, 2).Текст) ИЛИ НЕ ПустаяСтрока(ИсхТаблица.Область(нс, 3).Текст) ИЛИ НЕ ПустаяСтрока(ИсхТаблица.Область(нс, 4).Текст) Цикл
		нк = 1;
		Пока нк <= кк Цикл
			НовСтр = Объект.ЗначенияКолонок.Добавить();
			НовСтр.НомерКолонки = нк;
			НовСтр.НомерСтрокиТаб = нс;
			НовСтр.СтрокаЗначение = СокрЛП(ИсхТаблица.Область(нс, нк).Текст);
			нк = нк + 1;
		КонецЦикла;
		нс = нс + 1;
	КонецЦикла;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	Если НЕ ЗначениеЗаполнено(Объект.Автор) Тогда
		Объект.Автор		= ПараметрыСеанса.Пользователь;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ДатаПоставки) Тогда
		Объект.ДатаПоставки		= НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.НомСтрКол) Тогда
		Объект.НомСтрКол = 1;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.НомКолКодПроизв) Тогда
		Объект.НомКолКодПроизв = 2;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.НомКолШК) Тогда
		Объект.НомКолШК = 5;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.НомКолТНВЭД) Тогда
		Объект.НомКолТНВЭД = 27;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.НомКолБр) Тогда
		Объект.НомКолБр = 8;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.НомКолВН) Тогда
		Объект.НомКолВН = 10;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.НомКолНДС) Тогда
		Объект.НомКолНДС = 9;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.НомКолЦв) Тогда
		Объект.НомКолЦв = 3;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.НомКолРз) Тогда
		Объект.НомКолРз = 4;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.СкладПРМ) Тогда
		Объект.СкладПРМ		= Справочники.Склады.НайтиПоКоду("SSX-66");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.КонтрагентПРМ) Тогда
		Объект.КонтрагентПРМ		= Справочники.Контрагенты.НайтиПоКоду("SSP-7012");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.СкладПолучПРМ) И ЗначениеЗаполнено(Объект.Подразделение) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Склады.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	Склады.Подразделение = &Подразделение";
		Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
		Выб = Запрос.Выполнить().Выбрать();
		Если Выб.Следующий() Тогда
			Объект.СкладПолучПРМ = Выб.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	Элементы.РодПапка.СписокВыбора.Очистить();
	РодП1 = Справочники.Номенклатура.НайтиПоКоду("SNL-511970");
	РодП2 = Справочники.Номенклатура.НайтиПоКоду("SNL-309252");
	Если НЕ ЗначениеЗаполнено(Объект.РодПапка) Тогда
		Если Объект.Брэнды.Количество() Тогда
			СтрБр = Объект.Брэнды.Получить(0);
			Если СтрБр.Брэнд.ВидБренда = Перечисления.ВидБренда.Агентский Тогда
				Объект.РодПапка		= РодП1;
			Иначе
				Объект.РодПапка		= РодП2;
			КонецЕсли;
		Иначе
			Объект.РодПапка		= РодП1;	
		КонецЕсли;
	КонецЕсли;
	Элементы.РодПапка.СписокВыбора.Добавить(РодП1);
	Элементы.РодПапка.СписокВыбора.Добавить(РодП2);
	Если Объект.Товары.Количество() Тогда
		Элементы.Группа10.Заголовок = "Товары (" + Формат(Объект.Товары.Итог("Количество"), "ЧДЦ=0; ЧГ=3,0") + ")";
	Иначе
		Элементы.Группа10.Заголовок = "Товары";
	КонецЕсли;
	ПерезапСВ();	
КонецПроцедуры

&НаСервере
Процедура ПерезапСВ()
	Если ЗначениеЗаполнено(Объект.РодПапка) Тогда
		Элементы.ПапНовМод.СписокВыбора.Очистить();
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Номенклатура.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Номенклатура КАК Номенклатура
		               |ГДЕ
		               |	Номенклатура.Родитель = &Род";
		Запрос.УстановитьПараметр("Род", Объект.РодПапка);
		Выб = Запрос.Выполнить().Выбрать();
		Пока Выб.Следующий() Цикл
			Элементы.ПапНовМод.СписокВыбора.Добавить(Выб.Ссылка);
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
	
	Для Каждого ТСтр Из Объект.ИменаКолонок Цикл
		ИсхТаблица.Область(1, ТСтр.НомерКолонки).Текст = ТСтр.ИмяКолонки;
	КонецЦикла;
	
	Для Каждого ТСтр Из Объект.ЗначенияКолонок Цикл
		ИсхТаблица.Область(ТСтр.НомерСтрокиТаб, ТСтр.НомерКолонки).Текст = ТСтр.СтрокаЗначение;
	КонецЦикла;
	Если Объект.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияЗаявкиНаСторонПост.Отменена") Тогда
		МожноОбработать = Ложь;
		Элементы.ФормаЗагрузитьИзФайла.Доступность =  Ложь;
	Иначе
		МожноОбработать = ПровЗагружД(Объект.ИменаКолонок);	
	КонецЕсли;
	Если Объект.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияЗаявкиНаСторонПост.Выполнена") Тогда
		Элементы.Статус.Картинка = БиблиотекаКартинок.ВыполненоУспешно32;
		Элементы.ФормаОбработать.Доступность = Ложь;
		Элементы.ФормаФормирДок.Доступность =  Ложь;
		Элементы.ФормаЗагрузитьИзФайла.Доступность =  Ложь;
	Иначе
		Элементы.Статус.Картинка = ?(Объект.ИменаКолонок.Количество() = 0, БиблиотекаКартинок.ОформлениеКвадратыПустые, ?(МожноОбработать, БиблиотекаКартинок.ОформлениеКругЗелeный, БиблиотекаКартинок.ОформлениеКругКрасный));
		Элементы.ФормаОбработать.Доступность = ?(Объект.ИменаКолонок.Количество() = 0, Ложь, ?(МожноОбработать, Истина, Ложь));
		Элементы.ФормаФормирДок.Доступность = ?(Объект.ИменаКолонок.Количество() = 0, Ложь, ?(МожноФормировать, Истина, Ложь));
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ПолучитьНомХар(МСШК, МСК, СтрЦвет, СтрРазмер, СтрНаим, тЦвет = Неопределено, тРазмер = Неопределено)
	
	//|ВЫБРАТЬ
	//|ВТТ.НК,
	//|ВТТ.НСТ,
	//|ВТТ.СтрЗн,
	//|	isnull(Штрихкоды.Владелец, """") КАК Ном,
	//|	isnull(ХН.Ссылка, """") КАК ХарНом
	Ном = Неопределено;
	ХарНом = Неопределено;
	Найдено = Ложь;
	нс = 0;
	Пока нс < МСШК.Количество() Цикл
		Если ЗначениеЗаполнено(МСШК[нс].Ном) Тогда
			Ном = МСШК[нс].Ном;
		КонецЕсли;
		Если ЗначениеЗаполнено(МСШК[нс].ХарНом) Тогда
			ХарНом = МСШК[нс].ХарНом;
			
		КонецЕсли;
		нс =нс + 1;
	КонецЦикла;
	Если Ном = Неопределено ИЛИ ХарНом = Неопределено Тогда
		Пока нс < МСК.Количество() Цикл
			Если ЗначениеЗаполнено(МСК[нс].НомАрт) Тогда
				Ном = МСК[нс].НомАрт;
			Иначе
				Если ЗначениеЗаполнено(МСК[нс].Ном) Тогда
					Ном = МСК[нс].Ном;
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(МСК[нс].ХарНом) Тогда		        
				ХарНом = МСК[нс].ХарНом;
				Если ЗначениеЗаполнено(тЦвет) И ЗначениеЗаполнено(тРазмер) Тогда
					Найдено = ?((ХарНом.Цвет = тЦвет И ХарНом.Размер = тРазмер), Истина, Ложь);
				Иначе	
					Найдено = СопоставитЦветРазмер(СокрЛП(ХарНом.Цвет.Наименование), СокрЛП(ХарНом.Цвет.РусскоеНаименование), СокрЛП(ХарНом.Размер.Наименование), СтрНаим, СтрЦвет, СтрРазмер);
				КонецЕсли;	
				//Если СокрЛП(ХарНом.Цвет.Наименование) = СтрЦвет И СокрЛП(ХарНом.Размер.Наименование) = СтрРазмер Тогда
				Если Найдено Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
			нс =нс + 1;
		КонецЦикла;
	Иначе
		Найдено = Истина;
	КонецЕсли;	
	Рез = Новый Структура("Ном, ХарНом, Найдено", Ном, ХарНом, Найдено);
	Возврат Рез;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПровЗагружД(ТЗКол)
	Рез = Истина;
	Для Каждого ТСтр Из ТЗКол Цикл
		Если ТСтр.ИмяКолонки = "<>" Тогда
			Если ТСтр.НомерКолонки < 6 ИЛИ ТСтр.НомерКолонки = 8 ИЛИ ТСтр.НомерКолонки = 10 Тогда
				Рез = Ложь;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	Возврат Рез;
КонецФункции


&НаКлиентеНаСервереБезКонтекста
Функция СопоставитЦветРазмер(Цвет, ЦветР, Размер, ВхСтрНаим, СтрЦвет, СтрРазмер)
	Рез = Ложь;
	Если ((СтрНайти(ВхСтрНаим, СтрЦвет) > 0) ИЛИ (СтрНайти(Цвет, СтрЦвет) > 0) ИЛИ (СтрНайти(ЦветР, СтрЦвет) > 0)) И СтрНайти(Размер, СтрРазмер) > 0 Тогда
		Рез = Истина;
	Иначе
		Если СтрНайти(Размер, СтрРазмер) > 0 Тогда
			Рез = Истина;
		КонецЕсли;
	КонецЕсли;	
	Возврат Рез;
КонецФункции

//Функция ВыделитьЧасть(ВхСтр, КлючП, ФинС)
//	Рез = "";
//	//Поз1 = СтрНайти(СтрНом, "Код:");
//	Поз1 = СтрНайти(ВхСтр, КлючП);
//	Если Поз1 >= 1 Тогда
//		ВхСтр1 = Сред(ВхСтр, Поз1 + СтрДлина(КлючП));
//		//Поз2 = СтрНайти(ВхСтр1, ";");
//		Поз2 = СтрНайти(ВхСтр1, ФинС);
//		Если Поз2 >= 1 Тогда
//			Рез = СокрЛП(Лев(ВхСтр1, Поз2 - СтрДлина(ФинС)));
//			
//		КонецЕсли;
//	КонецЕсли;
//	Возврат Рез;
//КонецФункции


&НаСервере
Процедура ОбработатьНаСервере()
	// Вставить содержимое обработчика.
	Объект.Товары.Очистить();
	Если Объект.ЗагруженВЦО Тогда
		Объект.Брэнды.Очистить();
		Объект.ВидыНоменклатуры.Очистить();
		Объект.Коллекции.Очистить();
		Объект.Цвета.Очистить();
		Объект.Размеры.Очистить();
	КонецЕсли;
	ТЗКол = Объект.ИменаКолонок.Выгрузить();
	ТЗСтроки = Объект.ЗначенияКолонок.Выгрузить();
	МБрэнд = Новый Массив;
	МВидНом = Новый Массив;
	МКолл = Новый Массив;
	МЦвет = Новый Массив;
	МРазмер = Новый Массив;
	МТНВЭД = Новый Массив;
	НомКолТНВЭД = Объект.НомКолТНВЭД;
	НомКолКодПроизв = Объект.НомКолКодПроизв;
	НомКолШК = Объект.НомКолШК;
	НомКолБр = Объект.НомКолБр;
	НомКолВН = Объект.НомКолВН;
	НомКолНДС = Объект.НомКолНДС;
	НомКолЦв = Объект.НомКолЦв;
	НомКолРз = Объект.НомКолРз;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 

	"ВЫБРАТЬ
	|ТЗСтр.НомерКолонки КАК НК,
	|ТЗСтр.НомерСтрокиТаб КАК НСТ, 
	|ТЗСтр.СтрокаЗначение КАК СтрЗн
	|ПОМЕСТИТЬ ВТ_КолЗнач
	|ИЗ
	|	&ТЗ КАК ТЗСтр
	| ;
	|ВЫБРАТЬ
	|ВТТ.НК,
	|ВТТ.НСТ,
	|ВТТ.СтрЗн,
	|	isnull(Штрихкоды.Владелец.Родитель, """") КАК Ном,
	|	isnull(Штрихкоды.Владелец, """") КАК ХарНом
	|ИЗ
	|	ВТ_КолЗнач КАК ВТТ
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Штрихкоды КАК Штрихкоды
	| ПО
	|	Штрихкоды.Наименование = ВТТ.СтрЗн
	|	И НЕ ВТТ.СтрЗн = ""9999999999999""
	|	И Штрихкоды.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	|	И (Штрихкоды.ВидШК = ЗНАЧЕНИЕ(Перечисление.ВидыШК.Основной) ИЛИ Штрихкоды.ВидШК = ЗНАЧЕНИЕ(Перечисление.ВидыШК.Дополнительный))
	|	И ТипЗначения(Штрихкоды.Владелец) = ТИП(Справочник.Номенклатура)
	|	ГДЕ ВТТ.НК = &НКШ
	//|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХН
	//| ПО
	//|	ХН.Владелец = Штрихкоды.Владелец.Ссылка
	//|	ОБЪЕДИНИТЬ
	//|ВЫБРАТЬ
	//|ВТТ.НК,
	//|ВТТ.НСТ,
	//|ВТТ.СтрЗн,
	//|	isnull(Штрихкоды.Владелец.Владелец, """"),
	//|	isnull(Штрихкоды.Владелец, """") 
	//|ИЗ
	//|	ВТ_КолЗнач КАК ВТТ
	//|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
	//| ПО
	//|	Штрихкоды.Штрихкод = ВТТ.СтрЗн
	//|	И ВТТ.НК = &НКШ
	//|	И Штрихкоды.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	//|	И ТипЗначения(Штрихкоды.Владелец) = ТИП(Справочник.ХарактеристикиНоменклатуры)

	
	|	";
	
	Запрос.УстановитьПараметр("ТЗ", ТЗСтроки);
	Запрос.УстановитьПараметр("НКШ", НомКолШК);
	ТЗШК = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = 

	"ВЫБРАТЬ
	|	ТЗСтр.НомерКолонки КАК НК,
	|	ТЗСтр.НомерСтрокиТаб КАК НСТ,
	|	ТЗСтр.СтрокаЗначение КАК СтрЗн
	|ПОМЕСТИТЬ ВТ_КолЗнач
	|ИЗ
	|	&ТЗ КАК ТЗСтр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТ.НК КАК НК,
	|	ВТТ.НСТ КАК НСТ,
	|	ВТТ.СтрЗн КАК СтрЗн,
	|	ЕСТЬNULL(Номенклатура.Ссылка, """") КАК Ном,
	|	ЕСТЬNULL(АртКонтр.Владелец, """") КАК НомАрт,
	|	ЕСТЬNULL(ХН.Ссылка, """") КАК ХарНом
	|ИЗ
	|	ВТ_КолЗнач КАК ВТТ
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО (ВТТ.СтрЗн = Номенклатура.КодПроизводителя)
	
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АртикулыКонтрагентов КАК АртКонтр
	|		ПО (ВТТ.СтрЗн = АртКонтр.Наименование)
	|       И АртКонтр.ТипАртикула = &ТипАрт
	|		И АртКонтр.Владелец.ЭтоГруппа
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ХН
	|		ПО ((ХН.Родитель = Номенклатура.Ссылка)
	|		ИЛИ (ХН.Родитель = АртКонтр.Владелец))
	|	ГДЕ (ВТТ.НК = &НКШ)
	|";
	
	//запрос.Текст="ВЫБРАТЬ
	//	 |	АртикулыКонтрагентов.Ссылка,
	//	 |	АртикулыКонтрагентов.Владелец.Наименование КАК наименование,
	//	 |	АртикулыКонтрагентов.Владелец.Ссылка КАК товар
	//	 |ИЗ
	//	 |	Справочник.АртикулыКонтрагентов КАК АртикулыКонтрагентов
	//	 |ГДЕ
	//	 |	АртикулыКонтрагентов.Наименование = &Наименование
	//	 |	И АртикулыКонтрагентов.ТипАртикула = &ТипАртикула
	//	 |	И АртикулыКонтрагентов.Владелец.ЭтоГруппа = Истина";
	//	 запрос.УстановитьПараметр("Наименование",СтрТЗ.код);
	//	 запрос.УстановитьПараметр("ТипАртикула", ДокОбъект.СкладПолучатель.Подразделение.ТипАртикулаКонтрагента);
	
	//АртКонтр = Справочники.АртикулыКонтрагентов.СоздатьЭлемент();
	//	АртКонтр.Владелец = Мод;
	//	АртКонтр.ТипАртикула = Объект.Подразделение.ТипАртикулаКонтрагента;
	//	АртКонтр.Наименование = СтрКодП;
	//	АртКонтр.Записать();
	//	Рез.Мод = Мод;
	//	Рез.Создан = Истина;
	
	Запрос.УстановитьПараметр("ТЗ", ТЗСтроки);
	Запрос.УстановитьПараметр("НКШ", НомКолКодПроизв);
	Запрос.УстановитьПараметр("ТипАрт", Объект.Подразделение.ТипАртикулаКонтрагента);
	ТЗКод = Запрос.Выполнить().Выгрузить();
	
	ТЗСтрокиСвод = ТЗСтроки.Скопировать();
	ТЗСтрокиСвод.Свернуть("НомерСтрокиТаб");
	ТЗСтрокиСвод.Сортировать("НомерСтрокиТаб");
	ОКол = 0;
	СчтР = 0;
	Для Каждого ТСтрСвод Из ТЗСтрокиСвод Цикл
		Найды = ТЗСтроки.НайтиСтроки(Новый Структура("НомерСтрокиТаб", ТСтрСвод.НомерСтрокиТаб));
		Найды1 = ТЗШК.НайтиСтроки(Новый Структура("НСТ", ТСтрСвод.НомерСтрокиТаб));
		Найды2 = ТЗКод.НайтиСтроки(Новый Структура("НСТ", ТСтрСвод.НомерСтрокиТаб));
		СтрНом = ТЗКол[0].ИмяКолонки + ":" + Найды[0].СтрокаЗначение + ";" + ТЗКол[1].ИмяКолонки + ":" + Найды[1].СтрокаЗначение +
		";" + ТЗКол[7].ИмяКолонки + ":" + Найды[7].СтрокаЗначение + ";" + ТЗКол[9].ИмяКолонки + ":" + Найды[9].СтрокаЗначение + ";" + ТЗКол[10].ИмяКолонки + ":" + Найды[10].СтрокаЗначение; 
		
		СтрХар = ТЗКол[НомКолШК - 1].ИмяКолонки + ":" + Найды[НомКолШК - 1].СтрокаЗначение +  ";" + ТЗКол[НомКолЦв - 1].ИмяКолонки + ":" + Найды[НомКолЦв - 1].СтрокаЗначение + ";" + ТЗКол[НомКолРз - 1].ИмяКолонки + ":" + Найды[НомКолРз - 1].СтрокаЗначение;
		СтрНаим = Найды[0].СтрокаЗначение;
		СтрНДС = Найды[НомКолНДС - 1].СтрокаЗначение;
		СтрБр = Найды[НомКолБр - 1].СтрокаЗначение;
		СтрБр = ВРег(Лев(СтрБр,1)) + НРег(Сред(СтрБр, 2));
		СтрВН = Найды[НомКолВН - 1].СтрокаЗначение;
		СтрЦвет = Найды[НомКолЦв - 1].СтрокаЗначение;
		СтрРазмер = Найды[НомКолРз - 1].СтрокаЗначение;
		СтрТНВЭД = Найды[НомКолТНВЭД - 1].СтрокаЗначение;
		СтрКл = СтрБр + ", " + СтрВН;
		//СтНДС = Перечисления.СтавкиНДС.БезНДС;
		//Если СтрНайти(СтрНДС, "10") > 0 Тогда
		//	СтНДС = Перечисления.СтавкиНДС.НДС10;
		//ИначеЕсли СтрНайти(СтрНДС, "20") > 0 Тогда
		//	СтНДС = Перечисления.СтавкиНДС.НДС20;
		//ИначеЕсли СтрНайти(СтрНДС, "5") > 0 Тогда
		//	СтНДС = Перечисления.СтавкиНДС.НДС5;
		//ИначеЕсли СтрНайти(СтрНДС, "7") > 0 Тогда
		//	СтНДС = Перечисления.СтавкиНДС.НДС7;	
		//КонецЕсли;	
		СтрПроизв = ТЗКол[13].ИмяКолонки + ":" + Найды[13].СтрокаЗначение + ";" + ТЗКол[14].ИмяКолонки + ":" + Найды[14].СтрокаЗначение;
		СтрИмпортер = ТЗКол[15].ИмяКолонки + ":" + Найды[15].СтрокаЗначение + ";" + ТЗКол[16].ИмяКолонки + ":" + УбратьСлСимвПроб1(Найды[16].СтрокаЗначение) + ";" + ТЗКол[17].ИмяКолонки + ":" + УбратьСлСимвПроб1(Найды[17].СтрокаЗначение);
		СтрСерт = ТЗКол[19].ИмяКолонки + ":" + Найды[19].СтрокаЗначение + ";" + ТЗКол[20].ИмяКолонки + ":" + Найды[20].СтрокаЗначение + ";" + ТЗКол[21].ИмяКолонки + ":" + Найды[21].СтрокаЗначение +
		 ";" + ТЗКол[22].ИмяКолонки + ":" + Найды[22].СтрокаЗначение + ";" + ТЗКол[23].ИмяКолонки + ":" + Найды[23].СтрокаЗначение;
		НовСтр = Объект.Товары.Добавить();
		ОтвСтр = ПолучитьНомХар(Найды1, Найды2, СтрЦвет, СтрРазмер, СтрНаим);
		НовСтр.Номенклатура = ?(ЗначениеЗаполнено(ОтвСтр.Ном), ОтвСтр.Ном, Справочники.Номенклатура.ПустаяСсылка());
		НовСтр.СтрНоменклатура = СтрНом;
		ТоварНайден = ОтвСтр.Найдено;
		//?(ЗначениеЗаполнено(ОтвСтр.Ном), Истина, Ложь);
		НовСтр.ТоварНайден = ТоварНайден;
		НовСтр.ХарактеристикаНоменклатуры = ?(НовСтр.ТоварНайден, ОтвСтр.ХарНом, Справочники.Номенклатура.ПустаяСсылка());
		НовСтр.СтрХарНом = СтрХар;
		НовСтр.Количество = КонвЧисло(Найды[6].СтрокаЗначение);
		
		НовСтр.СтрНаим = СтрНаим;
		НовСтр.СтрЦвет = СтрЦвет;
		НовСтр.СтрРазмер = СтрРазмер;
		НовСтр.СтрБренд = СтрБр;
		НовСтр.СтрКод = Найды[1].СтрокаЗначение;
		НовСтр.СтрШК = Найды[НомКолШК - 1].СтрокаЗначение;
		
		ОКол = ОКол + НовСтр.Количество;
		//НовСтр.ТНВЭД = Найды[26].СтрокаЗначение;
		НовСтр.СтранаПроисхождения = Найды[25].СтрокаЗначение;
		//НовСтр.Единица = Справочники.ОКЕИ.НайтиПоКоду("796");
		НовСтр.ТНВЭД = Найды[НомКолТНВЭД - 1].СтрокаЗначение;
		НовСтр.Коэффициент = 1;
		НовСтр.Производитель = СтрПроизв;
		НовСтр.Импортер  = СтрИмпортер;
		НовСтр.ДанныеСертификата  = СтрСерт;
		НовСтр.НомерГТД = Найды[24].СтрокаЗначение;
		НовСтр.СтавкаНДС = СтрНДС;
		НовСтр.Цена = КонвЧисло(Найды[5].СтрокаЗначение);
		НовСтр.ЦенаПоСебестоимости = КонвЧисло(Найды[12].СтрокаЗначение);
		Если НовСтр.СтрНаим = НовСтр.СтрКод Тогда
			СчтР = СчтР + 1;
			//МожноОбработать = Ложь;
			//Объект.Комментарий = Объект.Комментарий + " в загружаемом файле есть позиции где код совпадает с наименованием - дальнейшая обработка невозможна";
		КонецЕсли;	
		Если ЗначениеЗаполнено(НовСтр.Номенклатура) Тогда
			Если НЕ (НовСтр.Номенклатура.ТНВЭД.Код = НовСтр.ТНВЭД) Тогда
				НовСтр.НеСоотТНВЭД = Истина;
			КонецЕсли;
		КонецЕсли;	
		Если МБрэнд.Найти(СтрБр) = Неопределено Тогда
			МБрэнд.Добавить(СтрБр);
		КонецЕсли;
		Если МВидНом.Найти(СтрВН) = Неопределено Тогда
			МВидНом.Добавить(СтрВН);
		КонецЕсли;
		Если МКолл.Найти(СтрКл) = Неопределено Тогда
			МКолл.Добавить(СтрКл);
		КонецЕсли;
		Если МЦвет.Найти(СтрЦвет) = Неопределено Тогда
			МЦвет.Добавить(СтрЦвет);
		КонецЕсли;
		Если МРазмер.Найти(СтрРазмер) = Неопределено Тогда
			МРазмер.Добавить(СтрРазмер);
		КонецЕсли;
		Если МТНВЭД.Найти(СтрТНВЭД) = Неопределено Тогда
			МТНВЭД.Добавить(СтрТНВЭД);
		КонецЕсли;
	КонецЦикла;
	//+20251017 Снимаю контрольку по письму Утюговой
	//Если СчтР Тогда
	//	МожноОбработать = Ложь;
	//	Объект.Комментарий = Объект.Комментарий + " в загружаемом файле есть позиции где код совпадает с наименованием - дальнейшая обработка невозможна";
	//КонецЕсли;
	//-20251017 Снимаю контрольку по письму Утюговой
	Если Объект.ЗагруженВЦО Тогда
		Для Каждого ТЭл Из МБрэнд Цикл
			СтрБр = Объект.Брэнды.Добавить();
			СтрБр.Наименование = ТЭл;
			СтрБр.Брэнд = Справочники.ФР_Бренды.НайтиПоНаименованию(ТЭл);
			РодП1 = Справочники.Номенклатура.НайтиПоКоду("SNL-511970");
			РодП2 = Справочники.Номенклатура.НайтиПоКоду("SNL-309252");
	
			Если ЗначениеЗаполнено(СтрБр.Брэнд) Тогда
				Если СтрБр.Брэнд.ВидБренда = Перечисления.ВидБренда.Агентский Тогда
					Объект.РодПапка		= РодП1;
				Иначе
					Объект.РодПапка		= РодП2;
				КонецЕсли;
				СтрБр.УИД = СокрЛП(СтрБр.Брэнд.УникальныйИдентификатор());
			КонецЕсли;
			ПерезапСВ();
		КонецЦикла;
		Для Каждого ТЭл Из МВидНом Цикл
			СтрВН = Объект.ВидыНоменклатуры.Добавить();
			СтрВН.Наименование = ТЭл;
			СтрВН.ВидНоменклатуры = Справочники.ФР_ВидыНоменклатуры.НайтиПоНаименованию(ТЭл);
			Если ЗначениеЗаполнено(СтрВН.ВидНоменклатуры) Тогда
				СтрВН.УИД = СокрЛП(СтрВН.ВидНоменклатуры.УникальныйИдентификатор());
			КонецЕсли;
		КонецЦикла;
		Для Каждого ТЭл Из МКолл Цикл
			СтрТ = Объект.Коллекции.Добавить();
			СтрТ.Наименование = ТЭл;
			//СтрТ.Брэнд = Справочники.Бренды.НайтиПоНаименованию(ТЭл);
			//Если ЗначениеЗаполнено(СтрБр.Брэнд) Тогда
			//	СтрБр.УИД = СокрЛП(СтрБр.Брэнд.УникальныйИдентификатор());
			//КонецЕсли;	
		КонецЦикла;
		Для Каждого ТЭл Из МЦвет Цикл
			СтрТ = Объект.Цвета.Добавить();
			СтрТ.Наименование = ТЭл;
			СтрТ.Цвет = Справочники.Цвета.НайтиПоНаименованию(ТЭл);
			Если ЗначениеЗаполнено(СтрТ.Цвет) Тогда
				СтрТ.УИД = СокрЛП(СтрТ.Цвет.УникальныйИдентификатор());
			КонецЕсли;	
		КонецЦикла;
		Для Каждого ТЭл Из МРазмер Цикл
			СтрТ = Объект.Размеры.Добавить();
			СтрТ.Наименование = ТЭл;
			СтрТ.Размер = Справочники.Размеры.НайтиПоНаименованию(ТЭл);
			Если ЗначениеЗаполнено(СтрТ.Размер) Тогда
				СтрТ.УИД = СокрЛП(СтрТ.Размер.УникальныйИдентификатор());
			КонецЕсли;
		КонецЦикла; 
		
		Для Каждого ТЭл Из МТНВЭД Цикл
			СтрТ = Объект.ТНВЭДы.Добавить();
			СтрТ.Наименование = ТЭл;
			СтрТ.ТНВЭД = Справочники.ТНВЭД.НайтиПоКоду(ТЭл);
			Если ЗначениеЗаполнено(СтрТ.ТНВЭД) Тогда
				СтрТ.УИД = СокрЛП(СтрТ.ТНВЭД.УникальныйИдентификатор());
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	Элементы.Группа10.Заголовок = "Товары (" + Формат(ОКол, "ЧДЦ=0; ЧГ=3,0") + ")";
	Элементы.РодПапка.СписокВыбора.Очистить();
	РодП1 = Справочники.Номенклатура.НайтиПоКоду("SNL-511970");
	РодП2 = Справочники.Номенклатура.НайтиПоКоду("SNL-309252");
	Если Объект.Брэнды.Количество() Тогда
		СтрБр = Объект.Брэнды.Получить(0);
		Если СтрБр.Брэнд.ВидБренда = Перечисления.ВидБренда.Агентский Тогда
			Объект.РодПапка		= РодП1;
		Иначе
			Объект.РодПапка		= РодП2;
		КонецЕсли;
	Иначе
		Объект.РодПапка		= РодП1;	
	КонецЕсли;
	Элементы.РодПапка.СписокВыбора.Добавить(РодП1);
	Элементы.РодПапка.СписокВыбора.Добавить(РодП2);

	
КонецПроцедуры

&НаСервере
Процедура ОбработатьНаСервере1()
	// Вставить содержимое обработчика.
	Объект.Товары.Очистить();
	
	ТЗКол = Объект.ИменаКолонок.Выгрузить();
	ТЗСтроки = Объект.ЗначенияКолонок.Выгрузить();
	НомКолТНВЭД = Объект.НомКолТНВЭД;
	НомКолКодПроизв = Объект.НомКолКодПроизв;
	НомКолШК = Объект.НомКолШК;
	НомКолБр = Объект.НомКолБр;
	НомКолВН = Объект.НомКолВН;
	НомКолНДС = Объект.НомКолНДС;
	НомКолЦв = Объект.НомКолЦв;
	НомКолРз = Объект.НомКолРз;
	
	СоотЦвет = Новый Соответствие;
	СоотРазм = Новый Соответствие;
	Для Каждого ТСтр Из Объект.Цвета Цикл
		Если ЗначениеЗаполнено(ТСтр.Цвет) Тогда
			СоотЦвет.Вставить(ТСтр.Наименование, ТСтр.Цвет);
		КонецЕсли;	
	КонецЦикла;	
	
	Для Каждого ТСтр Из Объект.Размеры Цикл
		Если ЗначениеЗаполнено(ТСтр.Размер) Тогда
			СоотРазм.Вставить(ТСтр.Наименование, ТСтр.Размер);
		КонецЕсли;	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 

	"ВЫБРАТЬ
	|ТЗСтр.НомерКолонки КАК НК,
	|ТЗСтр.НомерСтрокиТаб КАК НСТ, 
	|ТЗСтр.СтрокаЗначение КАК СтрЗн
	|ПОМЕСТИТЬ ВТ_КолЗнач
	|ИЗ
	|	&ТЗ КАК ТЗСтр
	| ;
	|ВЫБРАТЬ
	|ВТТ.НК,
	|ВТТ.НСТ,
	|ВТТ.СтрЗн,
	|	isnull(Штрихкоды.Владелец.Родитель, """") КАК Ном,
	|	isnull(Штрихкоды.Владелец, """") КАК ХарНом
	|ИЗ
	|	ВТ_КолЗнач КАК ВТТ
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Штрихкоды КАК Штрихкоды
	| ПО
	|	Штрихкоды.Наименование = ВТТ.СтрЗн
	|	И НЕ ВТТ.СтрЗн = ""9999999999999""
	|	И Штрихкоды.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	|	И (Штрихкоды.ВидШК = ЗНАЧЕНИЕ(Перечисление.ВидыШК.Основной) ИЛИ Штрихкоды.ВидШК = ЗНАЧЕНИЕ(Перечисление.ВидыШК.Дополнительный)) 
	|	И ТипЗначения(Штрихкоды.Владелец) = ТИП(Справочник.Номенклатура)
	|	ГДЕ ВТТ.НК = &НКШ
	//|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХН
	//| ПО
	//|	ХН.Владелец = Штрихкоды.Владелец.Ссылка
	//|	ОБЪЕДИНИТЬ
	//|ВЫБРАТЬ
	//|ВТТ.НК,
	//|ВТТ.НСТ,
	//|ВТТ.СтрЗн,
	//|	isnull(Штрихкоды.Владелец.Владелец, """"),
	//|	isnull(Штрихкоды.Владелец, """") 
	//|ИЗ
	//|	ВТ_КолЗнач КАК ВТТ
	//|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
	//| ПО
	//|	Штрихкоды.Штрихкод = ВТТ.СтрЗн
	//|	И ВТТ.НК = &НКШ
	//|	И Штрихкоды.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	//|	И ТипЗначения(Штрихкоды.Владелец) = ТИП(Справочник.ХарактеристикиНоменклатуры)

	
	|	";
	
	Запрос.УстановитьПараметр("ТЗ", ТЗСтроки);
	Запрос.УстановитьПараметр("НКШ", НомКолШК);
	ТЗШК = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = 

	"ВЫБРАТЬ
	|	ТЗСтр.НомерКолонки КАК НК,
	|	ТЗСтр.НомерСтрокиТаб КАК НСТ,
	|	ТЗСтр.СтрокаЗначение КАК СтрЗн
	|ПОМЕСТИТЬ ВТ_КолЗнач
	|ИЗ
	|	&ТЗ КАК ТЗСтр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТ.НК КАК НК,
	|	ВТТ.НСТ КАК НСТ,
	|	ВТТ.СтрЗн КАК СтрЗн,
	|	ЕСТЬNULL(Номенклатура.Ссылка, """") КАК Ном,
	|	ЕСТЬNULL(АртКонтр.Владелец, """") КАК НомАрт,
	|	ЕСТЬNULL(ХН.Ссылка, """") КАК ХарНом
	|ИЗ
	|	ВТ_КолЗнач КАК ВТТ
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО (ВТТ.СтрЗн = Номенклатура.КодПроизводителя)
	
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АртикулыКонтрагентов КАК АртКонтр
	|		ПО (ВТТ.СтрЗн = АртКонтр.Наименование)
	|       И АртКонтр.ТипАртикула = &ТипАрт
	|		И АртКонтр.Владелец.ЭтоГруппа
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ХН
	|		ПО ((ХН.Родитель = Номенклатура.Ссылка)
	|		ИЛИ (ХН.Родитель = АртКонтр.Владелец))
	|	ГДЕ (ВТТ.НК = &НКШ)
	|";
	
	//запрос.Текст="ВЫБРАТЬ
	//	 |	АртикулыКонтрагентов.Ссылка,
	//	 |	АртикулыКонтрагентов.Владелец.Наименование КАК наименование,
	//	 |	АртикулыКонтрагентов.Владелец.Ссылка КАК товар
	//	 |ИЗ
	//	 |	Справочник.АртикулыКонтрагентов КАК АртикулыКонтрагентов
	//	 |ГДЕ
	//	 |	АртикулыКонтрагентов.Наименование = &Наименование
	//	 |	И АртикулыКонтрагентов.ТипАртикула = &ТипАртикула
	//	 |	И АртикулыКонтрагентов.Владелец.ЭтоГруппа = Истина";
	//	 запрос.УстановитьПараметр("Наименование",СтрТЗ.код);
	//	 запрос.УстановитьПараметр("ТипАртикула", ДокОбъект.СкладПолучатель.Подразделение.ТипАртикулаКонтрагента);
	
	//АртКонтр = Справочники.АртикулыКонтрагентов.СоздатьЭлемент();
	//	АртКонтр.Владелец = Мод;
	//	АртКонтр.ТипАртикула = Объект.Подразделение.ТипАртикулаКонтрагента;
	//	АртКонтр.Наименование = СтрКодП;
	//	АртКонтр.Записать();
	//	Рез.Мод = Мод;
	//	Рез.Создан = Истина;
	
	Запрос.УстановитьПараметр("ТЗ", ТЗСтроки);
	Запрос.УстановитьПараметр("НКШ", НомКолКодПроизв);
	Запрос.УстановитьПараметр("ТипАрт", Объект.Подразделение.ТипАртикулаКонтрагента);

	ТЗКод = Запрос.Выполнить().Выгрузить();
	
	ТЗСтрокиСвод = ТЗСтроки.Скопировать();
	ТЗСтрокиСвод.Свернуть("НомерСтрокиТаб");
	ТЗСтрокиСвод.Сортировать("НомерСтрокиТаб");
	ОКол = 0;	
	Для Каждого ТСтрСвод Из ТЗСтрокиСвод Цикл
		Найды = ТЗСтроки.НайтиСтроки(Новый Структура("НомерСтрокиТаб", ТСтрСвод.НомерСтрокиТаб));
		Найды1 = ТЗШК.НайтиСтроки(Новый Структура("НСТ", ТСтрСвод.НомерСтрокиТаб));
		Найды2 = ТЗКод.НайтиСтроки(Новый Структура("НСТ", ТСтрСвод.НомерСтрокиТаб));
		СтрНом = ТЗКол[0].ИмяКолонки + ":" + Найды[0].СтрокаЗначение + ";" + ТЗКол[1].ИмяКолонки + ":" + Найды[1].СтрокаЗначение +
		";" + ТЗКол[7].ИмяКолонки + ":" + Найды[7].СтрокаЗначение + ";" + ТЗКол[9].ИмяКолонки + ":" + Найды[9].СтрокаЗначение + ";" + ТЗКол[10].ИмяКолонки + ":" + Найды[10].СтрокаЗначение; 
		
		СтрХар = ТЗКол[НомКолШК - 1].ИмяКолонки + ":" + Найды[НомКолШК - 1].СтрокаЗначение +  ";" + ТЗКол[НомКолЦв - 1].ИмяКолонки + ":" + Найды[НомКолЦв - 1].СтрокаЗначение + ";" + ТЗКол[НомКолРз - 1].ИмяКолонки + ":" + Найды[НомКолРз - 1].СтрокаЗначение;
		СтрНаим = Найды[0].СтрокаЗначение;
		СтрНДС = Найды[НомКолНДС - 1].СтрокаЗначение;
		СтрБр = Найды[НомКолБр - 1].СтрокаЗначение;
		СтрБр = ВРег(Лев(СтрБр,1)) + НРег(Сред(СтрБр, 2));
		СтрВН = Найды[НомКолВН - 1].СтрокаЗначение;
		СтрЦвет = Найды[НомКолЦв - 1].СтрокаЗначение;
		СтрРазмер = Найды[НомКолРз - 1].СтрокаЗначение;
		СтрТНВЭД = Найды[НомКолТНВЭД - 1].СтрокаЗначение;
		СтрКл = СтрБр + ", " + СтрВН;
		//СтНДС = Перечисления.СтавкиНДС.БезНДС;
		//Если СтрНайти(СтрНДС, "10") > 0 Тогда
		//	СтНДС = Перечисления.СтавкиНДС.НДС10;
		//ИначеЕсли СтрНайти(СтрНДС, "20") > 0 Тогда
		//	СтНДС = Перечисления.СтавкиНДС.НДС20;
		//ИначеЕсли СтрНайти(СтрНДС, "5") > 0 Тогда
		//	СтНДС = Перечисления.СтавкиНДС.НДС5;
		//ИначеЕсли СтрНайти(СтрНДС, "7") > 0 Тогда
		//	СтНДС = Перечисления.СтавкиНДС.НДС7;	
		//КонецЕсли;	
		СтрПроизв = ТЗКол[13].ИмяКолонки + ":" + Найды[13].СтрокаЗначение + ";" + ТЗКол[14].ИмяКолонки + ":" + Найды[14].СтрокаЗначение;
		СтрИмпортер = ТЗКол[15].ИмяКолонки + ":" + Найды[15].СтрокаЗначение + ";" + ТЗКол[16].ИмяКолонки + ":" + УбратьСлСимвПроб1(Найды[16].СтрокаЗначение) + ";" + ТЗКол[17].ИмяКолонки + ":" + УбратьСлСимвПроб1(Найды[17].СтрокаЗначение);
		СтрСерт = ТЗКол[19].ИмяКолонки + ":" + Найды[19].СтрокаЗначение + ";" + ТЗКол[20].ИмяКолонки + ":" + Найды[20].СтрокаЗначение + ";" + ТЗКол[21].ИмяКолонки + ":" + Найды[21].СтрокаЗначение +
		 ";" + ТЗКол[22].ИмяКолонки + ":" + Найды[22].СтрокаЗначение + ";" + ТЗКол[23].ИмяКолонки + ":" + Найды[23].СтрокаЗначение;
		НовСтр = Объект.Товары.Добавить();
		ОтвСтр = ПолучитьНомХар(Найды1, Найды2, СтрЦвет, СтрРазмер, СтрНаим, СоотЦвет.Получить(СтрЦвет), СоотРазм.Получить(СтрРазмер));
		НовСтр.Номенклатура = ?(ЗначениеЗаполнено(ОтвСтр.Ном), ОтвСтр.Ном, Справочники.Номенклатура.ПустаяСсылка());
		НовСтр.СтрНоменклатура = СтрНом;
		ТоварНайден = ОтвСтр.Найдено;
		ТоварНайден = ОтвСтр.Найдено;
		//?(ЗначениеЗаполнено(ОтвСтр.Ном), Истина, Ложь);
		НовСтр.ТоварНайден = ТоварНайден;
		НовСтр.ХарактеристикаНоменклатуры = ?(НовСтр.ТоварНайден, ОтвСтр.ХарНом, Справочники.Номенклатура.ПустаяСсылка());
		
		НовСтр.СтрНаим = СтрНаим;
		НовСтр.СтрЦвет = СтрЦвет;
		НовСтр.СтрРазмер = СтрРазмер;
		НовСтр.СтрБренд = СтрБр;
		НовСтр.СтрКод = Найды[1].СтрокаЗначение;
		НовСтр.СтрШК = Найды[НомКолШК - 1].СтрокаЗначение;
		
		НовСтр.СтрХарНом = СтрХар;
		НовСтр.Количество = КонвЧисло(Найды[6].СтрокаЗначение);
		ОКол = ОКол + НовСтр.Количество;
		//НовСтр.ТНВЭД = Найды[26].СтрокаЗначение;
		НовСтр.СтранаПроисхождения = Найды[25].СтрокаЗначение;
		//НовСтр.Единица = Справочники.ОКЕИ.НайтиПоКоду("796");
		НовСтр.ТНВЭД = Найды[НомКолТНВЭД - 1].СтрокаЗначение;
		НовСтр.Коэффициент = 1;
		НовСтр.Производитель = СтрПроизв;
		НовСтр.Импортер  = СтрИмпортер;
		НовСтр.ДанныеСертификата  = СтрСерт;
		НовСтр.НомерГТД = Найды[24].СтрокаЗначение;
		НовСтр.СтавкаНДС = СтрНДС;
		НовСтр.Цена = КонвЧисло(Найды[5].СтрокаЗначение);
		НовСтр.ЦенаПоСебестоимости = КонвЧисло(Найды[12].СтрокаЗначение);
		Если ЗначениеЗаполнено(НовСтр.Номенклатура) Тогда
			Если НЕ (НовСтр.Номенклатура.ТНВЭД.Код = НовСтр.ТНВЭД) Тогда
				НовСтр.НеСоотТНВЭД = Истина;
			КонецЕсли;
		КонецЕсли;	
		
	КонецЦикла;
	РодП1 = Справочники.Номенклатура.НайтиПоКоду("SNL-511970");
	РодП2 = Справочники.Номенклатура.НайтиПоКоду("SNL-309252");
	Если Объект.Брэнды.Количество() Тогда
		СтрБр = Объект.Брэнды.Получить(0);
		Если СтрБр.Брэнд.ВидБренда = Перечисления.ВидБренда.Агентский Тогда
			Объект.РодПапка		= РодП1;
		Иначе
			Объект.РодПапка		= РодП2;
		КонецЕсли;
	Иначе
		Объект.РодПапка		= РодП1;	
	КонецЕсли;
	Элементы.Группа10.Заголовок = "Товары (" + Формат(ОКол, "ЧДЦ=0; ЧГ=3,0") + ")";
	Объект.Комментарий = Объект.Комментарий + " Обработано успешно ";
	МожноФормировать = Истина;
	Элементы.ФормаФормирДок.Доступность = МожноФормировать;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция УбратьСлСимвПроб1(ВхСтр)
	Рез = "";
	Поз = 1;
	ДлС = СтрДлина(ВхСтр);
	Пока Поз <= ДлС Цикл
		Если КодСимвола(Сред(ВхСтр, Поз, 1)) > 32 И КодСимвола(Сред(ВхСтр, Поз, 1)) <> 160 Тогда
			Рез = Рез + Сред(ВхСтр, Поз, 1);
		КонецЕсли;
		Поз = Поз + 1;
	КонецЦикла;
	Возврат Рез;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КонвЧисло(ВхСтр)
	Рез = 0;
	ЕстьРазд = Ложь;
	//ВхСтр = СтрЗаменить(ВхСтр, " ", "");
	ВхСтр = УбратьСлСимвПроб1(ВхСтр);
	ПР = 0;
	П1 = СтрНайти(ВхСтр, ",");
	П2 = СтрНайти(ВхСтр, ".");
	П3 = СтрНайти(ВхСтр, "-");
	Если П1 > 1 Тогда
		ПР = П1;
	ИначеЕсли П2 > 1 Тогда
		ПР = П2;
	ИначеЕсли П3 > 1 Тогда
		ПР = П3;	
	КонецЕсли;
	Если ПР > 1 Тогда
		Рез = Число(Лев(ВхСтр, ПР - 1));
		СтрДЧ = Сред(ВхСтр, ПР + 1);
		
		Если СтрДлина(СтрДЧ) = 3 Тогда
			Пока Лев(СтрДЧ, 1) = "0" Цикл
				СтрДЧ = Сред(СтрДЧ, 2);
			КонецЦикла;
			Если СтрДлина(СтрДЧ) >= 1 Тогда
				Рез = Рез + Число(СтрДЧ) * 0.001;
			КонецЕсли;
		ИначеЕсли СтрДлина(СтрДЧ) = 2 Тогда
			Пока Лев(СтрДЧ, 1) = "0" Цикл
				СтрДЧ = Сред(СтрДЧ, 2);
			КонецЦикла;
			Если СтрДлина(СтрДЧ) >= 1 Тогда
				Рез = Рез + Число(СтрДЧ) * 0.01;
			КонецЕсли;
		ИначеЕсли СтрДлина(СтрДЧ) = 1 Тогда
			Рез = Рез + Число(СтрДЧ) * 0.1;
		КонецЕсли;	
		
	Иначе
		Рез = Число(ВхСтр);
	КонецЕсли;	
	
	Возврат Рез;
КонецФункции

&НаСервере
Функция ПроверитьСоот()
	Рез = Новый Структура("Можно, Сооб", Истина, "");
	Для Каждого ТСтр Из Объект.Брэнды Цикл
		Если НЕ ЗначениеЗаполнено(ТСтр.Брэнд) Тогда
			Рез.Можно = Ложь;
			Рез.Сооб = "Проверьте соответствие брендов-есть незаполненные";
			Возврат Рез;
		КонецЕсли;	
	КонецЦикла;
	Для Каждого ТСтр Из Объект.ВидыНоменклатуры Цикл
		Если НЕ ЗначениеЗаполнено(ТСтр.ВидНоменклатуры) Тогда
			Рез.Можно = Ложь;
			Рез.Сооб = "Проверьте соответствие видов номенклатуры-есть незаполненные";
			Возврат Рез;
		КонецЕсли;	
	КонецЦикла;
	Для Каждого ТСтр Из Объект.Цвета Цикл
		Если НЕ ЗначениеЗаполнено(ТСтр.Цвет) Тогда
			Рез.Можно = Ложь;
			Рез.Сооб = "Проверьте соответствие цветов-есть незаполненные";
			Возврат Рез;
		КонецЕсли;	
	КонецЦикла;	
	
	Для Каждого ТСтр Из Объект.Размеры Цикл
		Если НЕ ЗначениеЗаполнено(ТСтр.Размер) Тогда
			Рез.Можно = Ложь;
			Рез.Сооб = "Проверьте соответствие размеров-есть незаполненные";
			Возврат Рез;
		КонецЕсли;	
	КонецЦикла; 
	Для Каждого ТСтр Из Объект.ТНВЭДы Цикл
		Если НЕ ЗначениеЗаполнено(ТСтр.ТНВЭД) Тогда
			Рез.Можно = Ложь;
			Рез.Сооб = "Проверьте соответствие ТНВЭД-есть незаполненные";
			Возврат Рез;
		КонецЕсли;	
	КонецЦикла;
	Возврат Рез;
КонецФункции

&НаКлиенте
Процедура Обработать(Команда)
	Если Объект.ЗначенияКолонок.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Данные не загружены");
		Возврат;
	КонецЕсли;	
	ОтвСтр = ПроверитьСоот();
	Если НЕ ОтвСтр.Можно Тогда
		ПоказатьПредупреждение(, ОтвСтр.Сооб);
		Возврат;
	КонецЕсли;
	ОбработатьНаСервере1();
	ФормирТЗПоиск();
	Если Объект.Товары.Количество() Тогда
		Элементы.Группа10.Заголовок = "Товары (" + Формат(Объект.Товары.Итог("Количество"), "ЧДЦ=0; ЧГ=3,0") + ")";
	Иначе
		Элементы.Группа10.Заголовок = "Товары";
	КонецЕсли;
	ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
	ЭтаФорма.Записать();
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры


&НаСервере
Процедура БрэндыОбработкаВыбораНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура БрэндыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	БрэндыОбработкаВыбораНаСервере();
КонецПроцедуры

&НаСервере
Процедура БрэндыПриИзмененииНаСервере(ТСтрока)
	// Вставить содержимое обработчика.
	ТСтрока = ?(ТСтрока = Неопределено, 0, ТСтрока);
	СтрБр = Объект.Брэнды.НайтиПоИдентификатору(ТСтрока);
	СтрБр.УИД = "";
	РодП1 = Справочники.Номенклатура.НайтиПоКоду("SNL-511970");
	РодП2 = Справочники.Номенклатура.НайтиПоКоду("SNL-309252");
	Если ЗначениеЗаполнено(СтрБр.Брэнд) Тогда
		Если СтрБр.Брэнд.ВидБренда = Перечисления.ВидБренда.Агентский Тогда
			Объект.РодПапка		= РодП1;
		Иначе
			Объект.РодПапка		= РодП2;
		КонецЕсли;	
		СтрБр.УИД = СокрЛП(СтрБр.Брэнд.УникальныйИдентификатор());
	КонецЕсли;
	ПерезапСВ();
КонецПроцедуры

&НаКлиенте
Процедура БрэндыПриИзменении(Элемент)
	БрэндыПриИзмененииНаСервере(Элементы.Брэнды.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура РазмерыПриИзмененииНаСервере(ТСтрока)
	// Вставить содержимое обработчика.
	ТСтрока = ?(ТСтрока = Неопределено, 0, ТСтрока);
	СтрТ = Объект.Размеры.НайтиПоИдентификатору(ТСтрока);
	СтрТ.УИД = "";
	Если ЗначениеЗаполнено(СтрТ.Размер) Тогда
		СтрТ.УИД = СокрЛП(СтрТ.Размер.УникальныйИдентификатор());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РазмерыПриИзменении(Элемент)
	РазмерыПриИзмененииНаСервере(Элементы.Размеры.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ВидыНоменклатурыПриИзмененииНаСервере(ТСтрока)
	// Вставить содержимое обработчика.
	ТСтрока = ?(ТСтрока = Неопределено, 0, ТСтрока);
	СтрТ = Объект.ВидыНоменклатуры.НайтиПоИдентификатору(ТСтрока);
	СтрТ.УИД = "";
	Если ЗначениеЗаполнено(СтрТ.ВидНоменклатуры) Тогда
		СтрТ.УИД = СокрЛП(СтрТ.ВидНоменклатуры.УникальныйИдентификатор());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидыНоменклатурыПриИзменении(Элемент)
	ВидыНоменклатурыПриИзмененииНаСервере(Элементы.ВидыНоменклатуры.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ЦветаПриИзмененииНаСервере(ТСтрока)
	// Вставить содержимое обработчика.
	ТСтрока = ?(ТСтрока = Неопределено, 0, ТСтрока);
	СтрТ = Объект.Цвета.НайтиПоИдентификатору(ТСтрока);
	СтрТ.УИД = "";
	Если ЗначениеЗаполнено(СтрТ.Цвет) Тогда
		СтрТ.УИД = СокрЛП(СтрТ.Цвет.УникальныйИдентификатор());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЦветаПриИзменении(Элемент)
	ЦветаПриИзмененииНаСервере(Элементы.Цвета.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВыделитьЧасть(ВхСтр, КлючП, ФинС)
	Рез = "";
	//Поз1 = СтрНайти(СтрНом, "Код:");
	Поз1 = СтрНайти(ВхСтр, КлючП);
	Если Поз1 >= 1 Тогда
		ВхСтр1 = Сред(ВхСтр, Поз1 + СтрДлина(КлючП));
		//Поз2 = СтрНайти(ВхСтр1, ";");
		Поз2 = СтрНайти(ВхСтр1, ФинС);
		Если Поз2 >= 1 Тогда
			Рез = СокрЛП(Лев(ВхСтр1, Поз2 - СтрДлина(ФинС)));
		Иначе
			Рез = СокрЛП(ВхСтр1);
		КонецЕсли;
	КонецЕсли;
	Возврат Рез;
КонецФункции

&НаСервере
Процедура ФормирТЗПоиск()
	// Вставить содержимое обработчика.
	ТЗПоискНом.Очистить();
	Если ЗначениеЗаполнено(Объект.ПНК) Тогда
		Сообщить("Документы уже сформированы");
		Возврат;
	КонецЕсли;
	МБренд = Новый Массив;
	МКП = Новый Массив;
	МНС = Новый Массив;
	Для Каждого ТСтр Из Объект.Брэнды Цикл
		МБренд.Добавить(ТСтр.Брэнд);
	КонецЦикла;	
	Для Каждого ТСтр Из Объект.Товары Цикл
		СтрНом = ТСтр.СтрНоменклатура;
		Если НЕ ТСтр.ТоварНайден И НЕ ТСтр.ТоварСоздан Тогда
			СтрКП = ВыделитьЧасть(СтрНом, "Код:", ";");
			Если НЕ ПустаяСтрока(СтрКП) Тогда
				МКП.Добавить(СтрКП);
				МНС.Добавить(ТСтр.НомерСтроки);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если МКП.Количество() Тогда
		Запрос = Новый Запрос;
		КП = МКП[0];
		НС = МНС[0];
		Б1 = Ложь;
		ДВ = "";
		Если МКП.Количество() > 1 Тогда
			 Б1 = Истина;
			 н = 1;
			 Пока н < МКП.Количество() Цикл
				ТКП = МКП.Получить(н);
				ТНС = МНС.Получить(н);
			 	Запрос.УстановитьПараметр("КП" + Формат(н, "ЧГ=0"), ТКП);
				Запрос.УстановитьПараметр("НС" + Формат(н, "ЧГ=0"), ТНС);
				ДВ = ДВ + " ОБЪЕДИНИТЬ ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ВЫБОР КОГДА 
				|	isnull(Номенклатура1.КодПроизводителя, """") = """" ТОГДА &КП" + Формат(н, "ЧГ=0") + "
				|	ИНАЧЕ Номенклатура1.КодПроизводителя КОНЕЦ,
				|	&НС" + Формат(н, "ЧГ=0") + ",
				|	isnull(Номенклатура1.Ссылка, Значение(Справочник.Номенклатура.ПустаяСсылка)),
				|	Номенклатура.Родитель.Ссылка,
				|	Номенклатура.Родитель.Родитель
				|ИЗ
				|	Справочник.Номенклатура КАК Номенклатура
				|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура1
				|	ПО Номенклатура.Родитель = Номенклатура1.Родитель
				|	И Номенклатура.ФР_Бренд = Номенклатура1.ФР_Бренд
				|	И Номенклатура.Родитель.Родитель = Номенклатура1.Родитель.Родитель
				|	И Номенклатура1.КодПроизводителя = &КП" + Формат(н, "ЧГ=0") + " 
				|ГДЕ
				|	Номенклатура.ФР_Бренд В(&Бренды)
				|	И Номенклатура1.ФР_Бренд В(&Бренды) 
				|	";
				н = н + 1;
			КонецЦикла;	
		КонецЕсли; 
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР КОГДА 
		|	isnull(Номенклатура1.КодПроизводителя, """") = """" ТОГДА &КП
		|	ИНАЧЕ Номенклатура1.КодПроизводителя КОНЕЦ КАК КодПроизводителя,
		|	&НС КАК НомСтр,
		|	isnull(Номенклатура1.Ссылка, Значение(Справочник.Номенклатура.ПустаяСсылка)) КАК Папка,
		|	Номенклатура.Родитель.Ссылка КАК Род,
		|	Номенклатура.Родитель.Родитель КАК Род1
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура1
		|	ПО Номенклатура.Родитель = Номенклатура1.Родитель
		|	И Номенклатура.ФР_Бренд = Номенклатура1.ФР_Бренд
		|	И Номенклатура.Родитель.Родитель = Номенклатура1.Родитель.Родитель
		|	И Номенклатура1.КодПроизводителя = &КП
		|ГДЕ
		|	Номенклатура.ФР_Бренд В(&Бренды)
		|	И Номенклатура1.ФР_Бренд В(&Бренды)
		| " + ДВ + "
		|";
		Запрос.УстановитьПараметр("КП", КП);
		Запрос.УстановитьПараметр("НС", НС);
		Запрос.УстановитьПараметр("Бренды", МБренд);
		ТЗПоискНом.Загрузить(Запрос.Выполнить().Выгрузить());
		
	КонецЕсли;
	Если ТЗПоискНом.Количество() = 0 И МКП.Количество() Тогда
		н = 0;
		Пока н < МКП.Количество() Цикл
			НовС = ТЗПоискНом.Добавить();
			НовС.КодПроизводителя = МКП[н];
			НовС.НомСтр = МНС[н];
			н = н + 1;
		КонецЦикла;
	КонецЕсли;
	//SSP-7012 код контра
	//формирование док-тов
	
КонецПроцедуры

&НаСервере
Процедура ФормирНом()
	// Вставить содержимое обработчика.
	Если ТЗПоискНом.Количество() Тогда
		
		//Создание ном и групп
		
		ТЗКод = ТЗПоискНом.Выгрузить();
		ТЗКодСв = ТЗКод.Скопировать();
		
		ТЗКодСв.Свернуть("КодПроизводителя, Род");
		Для Каждого ТекСтр Из ТЗКодСв Цикл
			НайдыТ = Объект.Товары.НайтиСтроки(Новый Структура("СтрКод", ТекСтр.КодПроизводителя));
			Если НайдыТ.Количество() Тогда
				НайдТ = НайдыТ[0];
				ОтвСтр = НайтиСоздатьМод(ТекСтр.Род, ПапНовМод, НайдТ);
				НайдыП = ТЗПоискНом.НайтиСтроки(Новый Структура("КодПроизводителя", ТекСтр.КодПроизводителя));
				Для Каждого НайдП Из НайдыП Цикл
					НайдП.Папка = ОтвСтр.Мод;
				КонецЦикла;	
			КонецЕсли;
		КонецЦикла;	
		
		Для Каждого ТекСтр Из ТЗПоискНом Цикл
			НайдыТ = Объект.Товары.НайтиСтроки(Новый Структура("НомерСтроки", ТекСтр.НомСтр));
			Если НайдыТ.Количество() Тогда
				НайдТ = НайдыТ[0];
				НайдТ.Номенклатура = ТекСтр.Папка;
				//ОтвСтр = НайтиСоздатьМод(ТекСтр.Род, ПапНовМод, ТекСтр.Папка, НайдТ);//, Объект.Брэнды, Объект.ВидыНоменклатуры, Объект.Цвета, Объект.Размеры);
				////НайдТ.ТоварСоздан = ОтвСтр.Создан;
				//НайдТ.Номенклатура = ОтвСтр.Мод;
				//ТекСтр.Папка = ОтвСтр.Мод;
				//НайдТ.ХарактеристикаНоменклатуры = ОтвСтр.Ном;
				//Если ЗначениеЗаполнено(ТекСтр.Родитель) Тогда
				//	Если ЗначениеЗаполнено(ТекСтр.Папка) Тогда
				//		//созд. только элем.
				//		
				//	Иначе
				//		//созд. мод. и элем.
				//	КонецЕсли;	
				//КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТекСтр Из ТЗПоискНом Цикл
			НайдыТ = Объект.Товары.НайтиСтроки(Новый Структура("НомерСтроки", ТекСтр.НомСтр));
			Если НайдыТ.Количество() Тогда
				НайдТ = НайдыТ[0];
				ОтвСтр = СоздатьНом(ТекСтр.Род, ПапНовМод, ТекСтр.Папка, НайдТ);//, Объект.Брэнды, Объект.ВидыНоменклатуры, Объект.Цвета, Объект.Размеры);
				НайдТ.ТоварСоздан = ОтвСтр.Создан;
				НайдТ.Номенклатура = ОтвСтр.Мод;
				НайдТ.ХарактеристикаНоменклатуры = ОтвСтр.Ном;
				//Если ЗначениеЗаполнено(ТекСтр.Родитель) Тогда
				//	Если ЗначениеЗаполнено(ТекСтр.Папка) Тогда
				//		//созд. только элем.
				//		
				//	Иначе
				//		//созд. мод. и элем.
				//	КонецЕсли;	
				//КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция НайтиСоздатьМод(Род, РодП, ТовСтр)
	//, ТЗБрэнды, ТЗВидыНоменклатуры, ТЗЦвета, ТЗРазмеры)
	Мод =  ТовСтр.Номенклатура;
	Рез = Новый Структура("Мод, Создан", Мод, Ложь);
	Если НЕ ЗначениеЗаполнено(Род) И НЕ ЗначениеЗаполнено(РодП) Тогда
		Возврат Рез;
	КонецЕсли;
	тРод = ?(ЗначениеЗаполнено(Род), Род, РодП);
	
	//Наименование:Трусы-бразилиана SNAKE 63147-18;Код:63147-18;Бренд:COQUETTE REVUE;Тип товара:Бразилиана;Состав:80% ПОЛИАМИД, 20% ЭЛАСТАН
	//Штрихкод:9999999999999;Цвет:черный с нюдом;Размер:40
	СтрНаиМ = ВыделитьЧасть(ТовСтр.СтрНоменклатура, "Наименование:", ";");
	СтрКодП = ВыделитьЧасть(ТовСтр.СтрНоменклатура, "Код:", ";");
	СтрБренд = ВыделитьЧасть(ТовСтр.СтрНоменклатура, "Бренд:", ";");
	СтрТипТ = ВыделитьЧасть(ТовСтр.СтрНоменклатура, "Тип товара:", ";");
	СтрСост = ВыделитьЧасть(ТовСтр.СтрНоменклатура, "Состав:", ";");
	СтрукСост = ПарситСостав(СтрСост);
	СтрШК = ВыделитьЧасть(ТовСтр.СтрХарНом, "Штрихкод:", ";");
	СтрЦвет = ВыделитьЧасть(ТовСтр.СтрХарНом, "Цвет:", ";");
	СтрРазм = ВыделитьЧасть(ТовСтр.СтрХарНом, "Размер:", ";");
	//ФР_Бренд = ТЗБрэнды.Найти(СтрБренд, "Наименование").Брэнд;
	//ФР_ВидН = ТЗВидыНоменклатуры.Найти(СтрТипТ, "Наименование").ВидНоменклатуры;
	//
	//тЦвет = ТЗЦвета.Найти(СтрЦвет, "Наименование").Цвет;
	//тРазм = ТЗРазмеры.Найти(СтрРазм, "Наименование").Размер;
	//ФР_ВидН = ТЗВидыНоменклатуры.Найти(СтрТипТ, "Наименование").ВидНоменклатуры;
	//ФР_Бренд = ПолучитьИзТЧ("Брэнды", "Наименование", СтрБренд, "Брэнд");
	ФР_Бренд = Справочники.ФР_Бренды.ПустаяСсылка();
	Если Объект.Брэнды.Количество() Тогда
		Для Каждого ТСтр Из Объект.Брэнды Цикл
			ФР_Бренд = ТСтр.Брэнд;
			Если НРег(СокрЛП(ТСтр.Наименование)) = НРег(СокрЛП(СтрБренд)) Тогда
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
		//СтрБр = Объект.Брэнды.Получить(0);
		//ФР_Бренд = СтрБр.Брэнд;
	КонецЕсли;

	ФР_ВидН = ПолучитьИзТЧ("ВидыНоменклатуры", "Наименование", СтрТипТ, "ВидНоменклатуры");
	//ТЗВидыНоменклатуры.Найти(СтрТипТ, "Наименование").ВидНоменклатуры;
	
	тЦвет = ПолучитьИзТЧ("Цвета", "Наименование", СтрЦвет, "Цвет");
	//ТЗЦвета.Найти(СтрЦвет, "Наименование").Цвет;
	//тРазм = ПолучитьИзТЧ("Размеры", "Наименование", СтрРазм, "Размер"); 
	//ТЗРазмеры.Найти(СтрРазм, "Наименование").Размер;
	//ФР_ВидН = ПолучитьИзТЧ(ТЗВидыНоменклатуры, "Наименование", СтрБренд, "Брэнд");
	//ТЗВидыНоменклатуры.Найти(СтрТипТ, "Наименование").ВидНоменклатуры;
    
	ФР_Коллекция = Справочники.ФР_Коллекции.НайтиПоНаименованию(Род.Наименование);
	
	//сообщить(Строка(тЦвет) + " " + строка(ФР_Коллекция));
	Прот = Прот + "Добавление цвет " + СокрЛП(тЦвет) + " Брэнд " + СокрЛП(ФР_Бренд) + Символы.ПС;
	Если НЕ ЗначениеЗаполнено(Мод) Тогда
		МодО=Справочники.Номенклатура.СоздатьГруппу();
		МодО.Родитель = тРод;
		МодО.КодПроизводителя = СтрКодП; 
		//+HELP-9202 202603
		//МодО.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
		МодО.СтавкаНДС = Перечисления.СтавкиНДС.НДС22;
		//-HELP-9202 202603
		МодО.ФР_Бренд = ФР_Бренд;
		МодО.ТипТовара = СтрТипТ;
				
		
		МодО.ФР_ВидНоменклатуры = ФР_ВидН;
		//+HELP-9202 202603 
		//МодО.Наименование = СтрНаиМ + " " + СтрЦвет;
		МодО.Наименование = СтрНаиМ;
		//-HELP-9202 202603
				
		МодО.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Товар;
		Если ФР_Коллекция.Владелец = ФР_Бренд Тогда
			МодО.ФР_Коллекция = ФР_Коллекция;
		КонецЕсли;
		
		//+Доп парсинг для этикеток
		НаимН = СокрЛП(МодО.Наименование);
		НаимН1 = НаимН;
		НаимН2 = НаимН;
		НаимН3 = "";
		ПозПН = СтрНайти(НаимН, " ", НаправлениеПоиска.СКонца);
		//сообщить(НаимН + " 7 " + строка(ПозПН) + " 8 " + НаимН1);
		Если ПозПН > 1 Тогда
			НаимН1 = Сред(НаимН, ПозПН + 1);
			НовП = Лев(НаимН, ПозПН - 1);
			ПозПН1 = СтрНайти(НовП, " ", НаправлениеПоиска.СКонца);
			Если ПозПН1 > 1 Тогда
				НаимН2 = Сред(НовП, ПозПН1 + 1) + " " + НаимН1;
			КонецЕсли;
			Если (НРег(Лев(НаимН2, 3)) = "муж" ИЛИ НРег(Лев(НаимН2, 3)) = "жен" ИЛИ НРег(Лев(НаимН2, 3)) = "дет") И (ПозПН1 > 1) Тогда
				
				НовП1 = Лев(НовП, ПозПН1 - 1);
				ПозПН2 = СтрНайти(НовП1, " ", НаправлениеПоиска.СКонца);
				Если ПозПН2 > 1 Тогда
					НаимН3 = Сред(НовП1, ПозПН2 + 1) + " " + НаимН2 + " " + НаимН1;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		НБренд = НРег(СокрЛП(МодО.ФР_Бренд));
		ДлБр = СтрДлина(НБренд);
		ПозБр1 = СтрНайти(НРег(НаимН), НБренд);
		КодПр = СокрЛП(МодО.КодПроизводителя); 
		ПозБр2 = СтрНайти(НРег(КодПр), НБренд);
		СтрКодПр = ?(ПозБр2 >= 1, Сред(КодПр, ПозБр2 + ДлБр + 1), КодПр);
		Если ПозБр1 >=1 Тогда
			НаименованиеДляЭтикетки1 = Сред(НаимН, ПозБр1 + ДлБр + 1);
		Иначе	
			НаименованиеДляЭтикетки1 = НаимН;
			//?(СтрДлина(НаимН) <= 32, НаимН, ?(ПустаяСтрока(НаимН3), ?(СтрДлина(НаимН2) <= 32, НаимН2, НаимН1), НаимН3));
		КонецЕсли;
		ПозКП = СтрНайти(НаименованиеДляЭтикетки1, СтрКодПр);
		//ПозКП = СтрНайти(НаименованиеДляЭтикетки1, СокрЛП(МодО.КодПроизводителя));
		//НаименованиеДляЭтикетки2 = ?(ПозКП > 1, НаименованиеДляЭтикетки1, ?(СтрДлина(МодО.КодПроизводителя) + СтрДлина(НаименованиеДляЭтикетки1) + 1 <= 32, 
		//МодО.КодПроизводителя + " " + НаименованиеДляЭтикетки1, Лев(МодО.КодПроизводителя, 9) + " " + Лев(НаименованиеДляЭтикетки1, 22)));
		//	
		НаименованиеДляЭтикетки2 = ?(СтрДлина(НаименованиеДляЭтикетки1) <= 32, НаименованиеДляЭтикетки1, ?(ПустаяСтрока(НаимН3), ?(СтрДлина(НаимН2) <= 32, НаимН2, НаимН1), НаимН3));
		
		НаименованиеДляЭтикетки3 = ?(ПозКП >= 1 И СтрДлина(НаименованиеДляЭтикетки2) <= 32, НаименованиеДляЭтикетки2, ?(СтрДлина(СтрКодПр) + СтрДлина(НаименованиеДляЭтикетки2) + 1 <= 32, СтрКодПр + " " + НаименованиеДляЭтикетки2, Лев(СтрКодПр, 12) + " " + Лев(НаименованиеДляЭтикетки2, 19)));
		МодО.РусскоеНаименование = НаименованиеДляЭтикетки3;
		//-Доп парсинг для этикеток
		МодО.Состав =  СтрСост;
		Для Каждого ТЭл Из СтрукСост Цикл
			Попытка
				Если ТЭл.Проц >= 1 Тогда 
					НовС = МодО.СоставНоменклатуры.Добавить();
					НовС.МатериалСостав = Справочники.МатериалыСостав.НайтиПоНаименованию(СокрЛП(ТЭл.Мат));
					НовС.Процент = ТЭл.Проц;
					Прот = Прот + "Добавление состава материал " + СокрЛП(НовС.МатериалСостав) + " % " + СокрЛП(НовС.Процент) + Символы.ПС;
				Иначе
					Прот = Прот + "Не добавленен состава материал " + СокрЛП(НовС.МатериалСостав) + " % " + СокрЛП(НовС.Процент) + Символы.ПС;
				КонецЕсли;	
			Исключение
				Прот = Прот + "Ошибка при добавлении состава материал " + ОписаниеОшибки() + Символы.ПС;
			КонецПопытки;
		КонецЦикла;
		Если ПапНовМод = Справочники.Номенклатура.НайтиПоКоду("SNL-309252") Тогда
			МодО.ФранчайзинговыйАссортимент = Истина;
		КонецЕсли;
		МодО.ТНВЭД = ПолучитьИзТЧ("ТНВЭДы", "Наименование", ТовСтр.ТНВЭД, "ТНВЭД");
		
		//Справочники.ТНВЭД.НайтиПоКоду(ТовСтр.ТНВЭД);
		МодО.Записать();
		Мод = МодО.Ссылка;
		АртКонтр = Справочники.АртикулыКонтрагентов.СоздатьЭлемент();
		АртКонтр.Владелец = Мод;
		АртКонтр.ТипАртикула = Объект.Подразделение.ТипАртикулаКонтрагента;
		АртКонтр.Наименование = СтрКодП;
		АртКонтр.Записать();
		Рез.Мод = Мод;
		Рез.Создан = Истина;
	КонецЕсли;	
	Возврат Рез;
КонецФункции	

&НаСервере
Функция СоздатьНом(Род, РодП,  Мод, ТовСтр)
	//, ТЗБрэнды, ТЗВидыНоменклатуры, ТЗЦвета, ТЗРазмеры)
	Рез = Новый Структура("Ном, Мод, Создан", Неопределено, Мод, Ложь);
	Если НЕ ЗначениеЗаполнено(Род) И НЕ ЗначениеЗаполнено(РодП) Тогда
		Возврат Рез;
	КонецЕсли;
	тРод = ?(ЗначениеЗаполнено(Род), Род, РодП);
	
	//Наименование:Трусы-бразилиана SNAKE 63147-18;Код:63147-18;Бренд:COQUETTE REVUE;Тип товара:Бразилиана;Состав:80% ПОЛИАМИД, 20% ЭЛАСТАН
	//Штрихкод:9999999999999;Цвет:черный с нюдом;Размер:40
	СтрНаиМ = ВыделитьЧасть(ТовСтр.СтрНоменклатура, "Наименование:", ";");
	СтрКодП = ВыделитьЧасть(ТовСтр.СтрНоменклатура, "Код:", ";");
	СтрБренд = ВыделитьЧасть(ТовСтр.СтрНоменклатура, "Бренд:", ";");
	СтрТипТ = ВыделитьЧасть(ТовСтр.СтрНоменклатура, "Тип товара:", ";");
	СтрСост = ВыделитьЧасть(ТовСтр.СтрНоменклатура, "Состав:", ";");
	СтрукСост = ПарситСостав(СтрСост);
	СтрШК = ВыделитьЧасть(ТовСтр.СтрХарНом, "Штрихкод:", ";");
	СтрЦвет = ВыделитьЧасть(ТовСтр.СтрХарНом, "Цвет:", ";");
	СтрРазм = ВыделитьЧасть(ТовСтр.СтрХарНом, "Размер:", ";");
	//ФР_Бренд = ТЗБрэнды.Найти(СтрБренд, "Наименование").Брэнд;
	//ФР_ВидН = ТЗВидыНоменклатуры.Найти(СтрТипТ, "Наименование").ВидНоменклатуры;
	//
	//тЦвет = ТЗЦвета.Найти(СтрЦвет, "Наименование").Цвет;
	//тРазм = ТЗРазмеры.Найти(СтрРазм, "Наименование").Размер;
	//ФР_ВидН = ТЗВидыНоменклатуры.Найти(СтрТипТ, "Наименование").ВидНоменклатуры;
	ФР_Бренд = ПолучитьИзТЧ("Брэнды", "Наименование", СтрБренд, "Брэнд");
	ФР_ВидН = ПолучитьИзТЧ("ВидыНоменклатуры", "Наименование", СтрТипТ, "ВидНоменклатуры");
	//ТЗВидыНоменклатуры.Найти(СтрТипТ, "Наименование").ВидНоменклатуры;
	
	тЦвет = ПолучитьИзТЧ("Цвета", "Наименование", СтрЦвет, "Цвет");
	//ТЗЦвета.Найти(СтрЦвет, "Наименование").Цвет;
	тРазм = ПолучитьИзТЧ("Размеры", "Наименование", СтрРазм, "Размер"); 
	//ТЗРазмеры.Найти(СтрРазм, "Наименование").Размер;
	//ФР_ВидН = ПолучитьИзТЧ(ТЗВидыНоменклатуры, "Наименование", СтрБренд, "Брэнд");
	//ТЗВидыНоменклатуры.Найти(СтрТипТ, "Наименование").ВидНоменклатуры;

	ФР_Коллекция = Справочники.ФР_Коллекции.НайтиПоНаименованию(Род.Наименование);
	
	//сообщить(Строка(тЦвет) + " " + строка(ФР_Коллекция));
	Если НЕ ЗначениеЗаполнено(Мод) Тогда
		Возврат Рез;
	КонецЕсли;	
	НомО = Справочники.Номенклатура.СоздатьЭлемент();
	НомО.Родитель = Мод;
	НомО.ПервичнаяГруппа = Мод;
	НомО.БазоваяЕдиница = Справочники.ОКЕИ.НайтиПоКоду("796");
	НомО.Наименование = СтрНаиМ + " " + СтрЦвет + " " + СтрРазм;
	НомО.Цвет = тЦвет;
	НомО.Размер = тРазм;
	НомО.ЖизненныйЦиклНоменклатуры = Перечисления.ЖизненныйЦиклНоменклатуры.Активна;
	НомО.Записать();
	Ном= НомО.Ссылка;
	
	ЕдиницаОбъект = Справочники.Единицы.СоздатьЭлемент();
	ЕдиницаОбъект.Владелец     = Ном;
	ЕдиницаОбъект.Наименование = Ном.БазоваяЕдиница.Наименование;
	ЕдиницаОбъект.ОКЕИ			= Ном.БазоваяЕдиница;
	ЕдиницаОбъект.Коэффициент  = 1;		
	Попытка
		ЕдиницаОбъект.Записать();
		Прот = Прот + "Запись ед. хран. " + СокрЛП(ЕдиницаОбъект) + Символы.ПС;
	Исключение
		Сообщить("Не удалось записать единицу хранения остатков: " + ОписаниеОшибки(), СтатусСообщения.Важное);
		Прот = Прот + "Запись ед. хран., ошибка " + ОписаниеОшибки() + Символы.ПС;
	КонецПопытки;
	Если СтрШК = "9999999999999" Тогда
		НомерШК=ПолучитьМаксимальныйНомерШК()+1;
		ШКШтуки="60"+Формат(НомерШК,"ЧЦ=10; ЧРГ=; ЧВН=; ЧГ=0");
		ШКШтуки=ШКШтуки + КонтрольныйСимволEAN(ШКШтуки,13);		
		ПрописатьШтрихКодаТовара(Ном, Перечисления.ТипыШтрихКодов.Штука, ШКШтуки);
	Иначе
		ПрописатьШтрихКодаТовара(Ном, Перечисления.ТипыШтрихКодов.Штука, СтрШК);
	КонецЕсли;	
	Рез.Ном = Ном;
	Рез.Создан = Истина;
	Возврат Рез;
КонецФункции	


&НаСервере
Процедура ФормирДокНаСервере()
	// Вставить содержимое обработчика.
	//формирование док-тов
	Прот = "";
	Сч = 0;
	Для Каждого ТСтр Из Объект.Товары Цикл
		Если ТСтр.ТоварНайден ИЛИ ТСтр.ТоварСоздан Тогда
			Сч = Сч + 1;
		КонецЕсли;	
	КонецЦикла;		
	Если НЕ Сч = Объект.Товары.Количество() Тогда
		//Сообщить("Не все товары найдены");
		Прот = Прот + "Не все товары найдены" + Символы.ПС;
		Сообщить("Не все товары найдены формирование документов отменено");
		Возврат;
	КонецЕсли;
	//ФормПРМ = Ложь;
	
	ПРМ = Документы.Перемещение.СоздатьДокумент();
	ПРМ.Склад = Объект.СкладПРМ;
	ПРМ.СкладПолучатель = Объект.СкладПолучПРМ;
	ПРМ.ИБ = Справочники.ИБ.НайтиПоКоду("SSP");
	ПРМ.Менеджер = ПараметрыСеанса.Пользователь.ФизЛицо;
	ПРМ.Автор = ПараметрыСеанса.Пользователь;
	ПРМ.Организация=Справочники.Организации.НайтиПоКоду("SS-001");
	ПРМ.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-7012");
	УстановитьПунктДоставкиД(ПРМ,"СкладПолучатель","ПунктДоставки");
	ПРМ.Комментарий="Создано обработкой. ПРМ Сторон. ассорт. загружено из файла " + Объект.ИмяИсходногоФайла + "." + Объект.РасширениеИсходногоФайла;
	ПРМ.СостояниеНакладной = Перечисления.СостоянияНакладной.ГотоваКОтгрузке;
	ПРМ.Отгружен = Перечисления.Отгружен.Резерв;
	ПРМ.СостояниеНакладнойУПолучателя = Перечисления.СостоянияНакладной.ВРаботе;
	ПРМ.Дата = Объект.ДатаПоставки;
	ПРМ.ДатаПриемки = Объект.ДатаПоставки;
	ПРМ.Валюта=Справочники.Валюты.НайтиПоКоду("810");
	ПРМ.Курс=1;
		
	УстановитьНомерДокументаКлиентСервер(ПРМ);
	
	ОСум = 0;
	Для Каждого ТСтр Из Объект.Товары Цикл
		Если ТСтр.ТоварНайден ИЛИ ТСтр.ТоварСоздан Тогда
			Если ТСтр.Количество > 0 Тогда
				НовС = ПРМ.Товары.Добавить();
				НовС.Номенклатура = ТСтр.ХарактеристикаНоменклатуры;
				НовС.Единица = Справочники.Единицы.НайтиПоНаименованию("шт.", , , ТСтр.ХарактеристикаНоменклатуры);
				НовС.Заявка = ТСтр.Количество;
				НовС.ПодтвержденнаяЗаявка = ТСтр.Количество;
				НовС.ПодтвержденнаяЗаявкаПеремещения = ТСтр.Количество;
				НовС.Количество = ТСтр.Количество;
				НовС.Коэффициент = ТСтр.Коэффициент;
				НовС.Цена = ТСтр.Цена;
				НовС.СтавкаНДС = ТСтр.Номенклатура.СтавкаНДС;
				НовС.Себестоимость = ТСтр.ЦенаПоСебестоимости;
				НовС.Всего = НовС.Цена * НовС.Количество;
				ПроцНДС = ПроцентНДСпоСтавке(НовС.СтавкаНДС);
				НовС.НДС	=НовС.Всего * ПроцНДС/(1+ПроцНДС);			
				НовС.Сумма  =НовС.Всего - НовС.НДС;
				ОСум = ОСум + НовС.Всего;
			КонецЕсли;
			
		КонецЕсли;	
	КонецЦикла;
	ПРМ.СуммаДокумента = ОСум;
	Попытка
		ПРМ.Записать(РежимЗаписиДокумента.Проведение);
		Прот = Прот + "Проведение ПРМ " + СокрЛП(ПРМ) + Символы.ПС;
	Исключение
		ПРМ.Записать(РежимЗаписиДокумента.Запись);
		Прот = Прот + "ПРМ записан " + СокрЛП(ПРМ) + " ошибка при проведении " + ОписаниеОшибки() + Символы.ПС;
	КонецПопытки;
	ПрмСсыл = ПРМ.Ссылка;
	ТЗНомПр = Объект.Товары.Выгрузить();
	ТЗНомПр.Свернуть("Номенклатура, Цена");
	ПрайсРозн = Документы.ПрайсЛист.СоздатьДокумент();
	ПрайсРозн.ИБ = Справочники.ИБ.НайтиПоКоду("SSP");
	ПрайсРозн.Курс = 1;
	ПрайсРозн.Автор = ПараметрыСеанса.Пользователь;
	ПрайсРозн.Организация=Справочники.Организации.НайтиПоКоду("SS-001");
	ПрайсРозн.Валюта=Справочники.Валюты.НайтиПоКоду("810");
	ПрайсРозн.ТипЦен = ПрмСсыл.СкладПолучатель.Подразделение.РозничныйТипЦен;
	ПрайсРозн.Дата = Объект.ДатаПоставки;
	ПрайсРозн.Дата2 = НачалоДня(КонецГода(КонецГода(ПрайсРозн.Дата) + 100));
	УстановитьНомерДокументаКлиентСервер(ПрайсРозн);
	ПрайсРозн.Записать();
	
	Для Каждого ТСтр Из ТЗНомПр Цикл
		МенЗап = РегистрыСведений.ЦеныНоменклатуры.СоздатьМенеджерЗаписи();
		//МенЗап.Номенклатура = ТСтр.ХарактеристикаНоменклатуры;
		МенЗап.Период = Объект.ДатаПоставки;
		МенЗап.Прайс = ПрайсРозн.Ссылка;
		МенЗап.ТипЦен = ПрайсРозн.ТипЦен;
		МенЗап.Номенклатура = ТСтр.Номенклатура;
		МенЗап.Цена = ТСтр.Цена;
		МенЗап.Записать();
		
	КонецЦикла;

	
	//Для Каждого ТСтр Из Объект.Товары Цикл
	//	Если ТСтр.ТоварНайден ИЛИ ТСтр.ТоварСоздан Тогда
	//		МенЗап = РегистрыСведений.ЦеныНоменклатуры.СоздатьМенеджерЗаписи();
	//		МенЗап.Номенклатура = ТСтр.ХарактеристикаНоменклатуры;
	//		МенЗап.Период = Объект.ДатаПоставки;
	//		МенЗап.Прайс = ПрайсРозн.Ссылка;
	//		МенЗап.ТипЦен = ПрайсРозн.ТипЦен;
	//		МенЗап.Модель = ТСтр.Номенклатура;
	//		МенЗап.Цена = ТСтр.Цена;
	//		МенЗап.Записать();
	//		
	//	КонецЕсли;	
	//КонецЦикла;
	
	
	//декларации, гтд
	
	Для Каждого ТСтр Из Объект.Товары Цикл
		Если ЗначениеЗаполнено(ТСтр.ХарактеристикаНоменклатуры) Тогда
			тНоменклатура = ТСтр.ХарактеристикаНоменклатуры;
			тМодель = ТСтр.Номенклатура;
			тСтранаПроисхождения = Справочники.КлассификаторСтранМира.НайтиПоНаименованию(ТСтр.СтранаПроисхождения);
			ТДанныеСертификата = ТСтр.ДанныеСертификата;
			тНомерСертификата = СокрЛП(СтрЗаменить(ВыделитьЧасть(ТДанныеСертификата, "Номер сертификата ЕАС:", ";"), "ЕАЭС", ""));
			СтрДатаД = СокрЛП(ВыделитьЧасть(ТДанныеСертификата, "Дата окончания сертификата ЕАС:", ";"));
			Если СтрДлина(СтрДатаД) < 9 Тогда
				//год 2 ц в герм.
				СтрДатаД = Лев(СтрДатаД, 6) + "20" + Прав(СтрДатаД, 2);
			КонецЕсли;	
				
			тДатаДекларации = ПолучитьДатуИзСтр(СтрДатаД);
			тОрган = СокрЛП(ВыделитьЧасть(ТДанныеСертификата, "Серцифицирующий орган:", ";"));
			тПроизводитель = ТСтр.Производитель;
			тИзготовитель = СокрЛП(ВыделитьЧасть(тПроизводитель, "Производитель:", ";")) + ", " + СокрЛП(ВыделитьЧасть(тПроизводитель, "Адрес производителя:", ";"));
			тОрган = СокрЛП(ВыделитьЧасть(ТДанныеСертификата, "Серцифицирующий орган:", ";"));
			тИмпортер = ПолучитьИмп(ТСтр.Импортер);
			тФилиал = СокрЛП(ВыделитьЧасть(ТДанныеСертификата, "Филиал:", ";"));
			//Номер сертификата ЕАС:RU C-IT.AB71.B.24669;Дата окончания сертификата ЕАС:31.12.25;Филиал:;Адрес Филиала:;Серцифицирующий орган:ООО "ОптимаТест"
			//
			//Номер сертификата ЕАС:ЕАЭС RU C-IT.BE02.B.01570/19;Дата окончания сертификата ЕАС:27.10.2025;Филиал:;Адрес Филиала:;Серцифицирующий орган:ООО "Глобальное Соответствие"
			//
			//Номер сертификата ЕАС:ЕАЭС RU C-IT.BE02.B.01570/19;Дата окончания сертификата ЕАС:27.10.2025;Филиал:;Адрес Филиала:;Серцифицирующий орган:ООО "Глобальное Соответствие"
			//Импортёр:ООО "Миа";ИНН импортёра:7723416980;КПП импортёра:772301001
			//
			//Производитель:I.T. ITAL TESSILE S.R.L.;Адрес производителя:Италия,Via Gordoni,31 Milano
			Попытка
				СтрБр = Объект.Брэнды.Получить(0);
				Если СтрБр.Брэнд.ВидБренда = Перечисления.ВидБренда.Агентский Тогда
					Агентский = Истина;
				Иначе
					Агентский = Ложь;
				КонецЕсли;
				тДекл = НайтиУстановитьДекларацию(тНомерСертификата, тДатаДекларации, тНоменклатура, тМодель, тФилиал, тИзготовитель, тОрган, тИмпортер, тСтранаПроисхождения, Агентский);
				//ПровГТДЗапИстор(ТСтр.НомерГТД, тСтранаПроисхождения, тИмпортер, тДекл, тНоменклатура, ПрмСсыл);
				//ПровГТДЗапИстор(ТСтр.НомерГТД, тСтранаПроисхождения, тИмпортер, тДекл, тМодель, ПрмСсыл);
				
				ПровДеклЗапИстор(тДекл, тМодель);
				ПровГТДЗапИстор(ТСтр.НомерГТД, тСтранаПроисхождения, тИмпортер, тМодель, ПрмСсыл);
				
				Прот = Прот + "Установка декларации " + СокрЛП(тНомерСертификата) + Символы.ПС;
			Исключение
				Прот = Прот + "Ошибка при установке декларации " + ОписаниеОшибки() + Символы.ПС;
			КонецПопытки;
		КонецЕсли;	
	КонецЦикла;
	Объект.ПНК = ПрмСсыл;
	Объект.Прайс = ПрайсРозн.Ссылка;
	Объект.Состояние = Перечисления.СостоянияЗаявкиНаСторонПост.Выполнена;
	Элементы.Статус.Картинка = БиблиотекаКартинок.ВыполненоУспешно32;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПровГТДЗапИстор(ГТД, Страна, Импортер, Товар, ДокС)
	Запрос = Новый Запрос;
	Запрос.Текст= "ВЫБРАТЬ
	|	ГТД.Ссылка КАК ссылка
	|ИЗ
	|	Справочник.ГТД КАК ГТД
	|ГДЕ
	|	ГТД.Импортер = &Импортер
	|	И ГТД.ПометкаУдаления = ЛОЖЬ
	|	И ГТД.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Импортер", Импортер);
	Запрос.УстановитьПараметр("Наименование", ГТД);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Количество() = 0 Тогда
		ГТД=Справочники.ГТД.СоздатьЭлемент();
		ГТД.Импортер = Импортер;
		ГТД.Владелец=Справочники.ИБ.НайтиПоКоду("SSP");
		ГТД.Родитель=Справочники.ГТД.НайтиПоКоду("TZ2-188");
		ГТД.СтранаПроисхождения = Страна;
		ГТД.Наименование=ГТД;
		Попытка
			ГТД.Записать();		 
		Исключение
			//сообщить(ОписаниеОшибки());
			//Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;    
	
	Запрос.Текст="ВЫБРАТЬ
	|	История.Значение КАК значение
	|ИЗ
	|	РегистрСведений.История КАК История
	|ГДЕ
	|	История.Значение = &Значение
	|	И История.Объект = &Объект";
	Запрос.УстановитьПараметр("Значение", ГТД);
	Запрос.УстановитьПараметр("Объект", Товар);
	
	Результат=запрос.Выполнить().Выбрать();
	Если результат.Количество()=0 тогда
		НоваяЗапись = РегистрыСведений.История.СоздатьМенеджерЗаписи();
		НоваяЗапись.Объект = Товар;			
		НоваяЗапись.Реквизит = "НомерГТД"; 
		НоваяЗапись.Значение = ГТД;
		НоваяЗапись.Период = НачалоДня(ТекущаяДата())-10;	
		НоваяЗапись.Документ = ДокС;
		НоваяЗапись.Записать(); 
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПровДеклЗапИстор(Декл, Товар)
	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	История.Значение КАК значение
	|ИЗ
	|	РегистрСведений.История КАК История
	|ГДЕ
	//|	История.Значение В(&Значение)
	|	История.Значение = &Значение
	|	И История.Объект = &Объект";
	Запрос.УстановитьПараметр("Значение", Декл);
	Запрос.УстановитьПараметр("Объект", Товар);
	
	Результат = Запрос.Выполнить().Выбрать(); 
	Если результат.Количество()=0 тогда
		НоваяЗапись = РегистрыСведений.История.СоздатьМенеджерЗаписи();
		НоваяЗапись.Объект = Товар;			
		НоваяЗапись.Реквизит = "Декларация"; 
		НоваяЗапись.Значение = Декл;
		НоваяЗапись.Период = Декл.ДатаНачала;	
		// НоваяЗапись.Документ=ДокС;
		НоваяЗапись.Записать();  
		
	КонецЕсли;
КонецПроцедуры



&НаСервере
Процедура ФормирДокНаСервере_1()
	// Вставить содержимое обработчика.
	ТЗПоискНом.Очистить();
	Если ЗначениеЗаполнено(Объект.ПНК) Тогда
		Сообщить("Документы уже сформированы");
		Возврат;
	КонецЕсли;
	МБренд = Новый Массив;
	МКП = Новый Массив;
	МНС = Новый Массив;
	Для Каждого ТСтр Из Объект.Брэнды Цикл
		МБренд.Добавить(ТСтр.Брэнд);
	КонецЦикла;	
	Для Каждого ТСтр Из Объект.Товары Цикл
		СтрНом = ТСтр.СтрНоменклатура;
		Если НЕ ТСтр.ТоварНайден И НЕ ТСтр.ТоварСоздан Тогда
			СтрКП = ВыделитьЧасть(СтрНом, "Код:", ";");
			Если НЕ ПустаяСтрока(СтрКП) Тогда
				МКП.Добавить(СтрКП);
				МНС.Добавить(ТСтр.НомерСтроки);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если МКП.Количество() Тогда
		Запрос = Новый Запрос;
		КП = МКП[0];
		НС = МНС[0];
		Б1 = Ложь;
		ДВ = "";
		Если МКП.Количество() > 1 Тогда
			 Б1 = Истина;
			 н = 1;
			 Пока н < МКП.Количество() Цикл
				ТКП = МКП.Получить(н);
				ТНС = МНС.Получить(н);
			 	Запрос.УстановитьПараметр("КП" + Формат(н, "ЧГ=0"), ТКП);
				Запрос.УстановитьПараметр("НС" + Формат(н, "ЧГ=0"), ТНС);
				ДВ = ДВ + " ОБЪЕДИНИТЬ ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ВЫБОР КОГДА 
				|	isnull(Номенклатура1.КодПроизводителя, """") = """" ТОГДА &КП" + Формат(н, "ЧГ=0") + "
				|	ИНАЧЕ Номенклатура1.КодПроизводителя КОНЕЦ,
				|	&НС" + Формат(н, "ЧГ=0") + ",
				|	isnull(Номенклатура1.Ссылка, Значение(Справочник.Номенклатура.ПустаяСсылка)),
				|	Номенклатура.Родитель.Ссылка,
				|	Номенклатура.Родитель.Родитель
				|ИЗ
				|	Справочник.Номенклатура КАК Номенклатура
				|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура1
				|	ПО Номенклатура.ФР_Бренд = Номенклатура1.ФР_Бренд
				|	И Номенклатура.Родитель = Номенклатура1.Родитель
				|	И Номенклатура.Родитель.Родитель = Номенклатура1.Родитель.Родитель
				|	И Номенклатура1.КодПроизводителя = &КП" + Формат(н, "ЧГ=0") + " 
				|ГДЕ
				|	Номенклатура.ФР_Бренд В(&Бренды)
				|	И Номенклатура1.ФР_Бренд В(&Бренды) 
				|	";
				н = н + 1;
			КонецЦикла;	
		КонецЕсли; 
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР КОГДА 
		|	isnull(Номенклатура1.КодПроизводителя, """") = """" ТОГДА &КП
		|	ИНАЧЕ Номенклатура1.КодПроизводителя КОНЕЦ КАК КодПроизводителя,
		|	&НС КАК НомСтр,
		|	isnull(Номенклатура1.Ссылка, Значение(Справочник.Номенклатура.ПустаяСсылка)) КАК Папка,
		|	Номенклатура.Родитель.Ссылка КАК Род,
		|	Номенклатура.Родитель.Родитель КАК Род1
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура1
		|	ПО Номенклатура.ФР_Бренд = Номенклатура1.ФР_Бренд
		|	И Номенклатура.Родитель = Номенклатура1.Родитель
		|	И Номенклатура.Родитель.Родитель = Номенклатура1.Родитель.Родитель
		|	И Номенклатура1.КодПроизводителя = &КП
		|ГДЕ
		|	Номенклатура.ФР_Бренд В(&Бренды)
		|	И Номенклатура1.ФР_Бренд В(&Бренды)
		| " + ДВ + "
		|";
		Запрос.УстановитьПараметр("КП", КП);
		Запрос.УстановитьПараметр("НС", НС);
		Запрос.УстановитьПараметр("Бренды", МБренд);
		ТЗПоискНом.Загрузить(Запрос.Выполнить().Выгрузить());
		//Создание ном и групп
		Для Каждого ТекСтр Из ТЗПоискНом Цикл
			НайдыТ = Объект.Товары.НайтиСтроки(Новый Структура("НомерСтроки", ТекСтр.НомСтр));
			Если НайдыТ.Количество() Тогда
				НайдТ = НайдыТ[0];
				ОтвСтр = СоздатьНом(ТекСтр.Род, ПапНовМод, ТекСтр.Папка, НайдТ);//, Объект.Брэнды, Объект.ВидыНоменклатуры, Объект.Цвета, Объект.Размеры);
				НайдТ.ТоварСоздан = ОтвСтр.Создан;
				НайдТ.Номенклатура = ОтвСтр.Мод;
				НайдТ.ХарактеристикаНоменклатуры = ОтвСтр.Ном;
				//Если ЗначениеЗаполнено(ТекСтр.Родитель) Тогда
				//	Если ЗначениеЗаполнено(ТекСтр.Папка) Тогда
				//		//созд. только элем.
				//		
				//	Иначе
				//		//созд. мод. и элем.
				//	КонецЕсли;	
				//КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//SSP-7012 код контра
	//формирование док-тов
		
	ФормПРМ = Ложь;
	
	ПРМ = Документы.Перемещение.СоздатьДокумент();
	ПРМ.Склад = Объект.СкладПРМ;
	ПРМ.СкладПолучатель = Объект.СкладПолучПРМ;
	ПРМ.ИБ = Справочники.ИБ.НайтиПоКоду("SSP");
	ПРМ.Менеджер = ПараметрыСеанса.Пользователь.ФизЛицо;
	ПРМ.Автор = ПараметрыСеанса.Пользователь;
	ПРМ.Организация=Справочники.Организации.НайтиПоКоду("SS-001");
	ПРМ.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-7012");
	УстановитьПунктДоставкиД(ПРМ,"СкладПолучатель","ПунктДоставки");
	ПРМ.Комментарий="Создано обработкой. ПРМ Сторон. ассорт.";
	ПРМ.СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена;
	ПРМ.СостояниеНакладнойУПолучателя = Перечисления.СостоянияНакладной.ГотоваКПриемке;
	ПРМ.Отгружен = Перечисления.Отгружен.Отгружен;
	ПРМ.Дата = Объект.ДатаПоставки;
	ПРМ.ДатаПриемки = Объект.ДатаПоставки;
	ПРМ.Валюта=Справочники.Валюты.НайтиПоКоду("810");
	ПРМ.Курс=1;
		
	УстановитьНомерДокументаКлиентСервер(ПРМ);
	
	ОСум = 0;
	Для Каждого ТСтр Из Объект.Товары Цикл
		Если ТСтр.ТоварНайден ИЛИ ТСтр.ТоварСоздан Тогда
			Если ТСтр.Количество > 0 Тогда
				НовС = ПРМ.Товары.Добавить();
				НовС.Номенклатура = ТСтр.ХарактеристикаНоменклатуры;
				НовС.Единица = Справочники.Единицы.НайтиПоНаименованию("шт.", , , ТСтр.ХарактеристикаНоменклатуры);
				НовС.Заявка = ТСтр.Количество;
				НовС.ПодтвержденнаяЗаявка = ТСтр.Количество;
				НовС.Количество = ТСтр.Количество;
				НовС.Коэффициент = ТСтр.Коэффициент;
				НовС.Цена = ТСтр.Цена;
				НовС.СтавкаНДС = ТСтр.Номенклатура.СтавкаНДС;
				НовС.Себестоимость = ТСтр.ЦенаПоСебестоимости;
				НовС.Всего = НовС.Цена * НовС.Количество;
				ПроцНДС = ПроцентНДСпоСтавке(НовС.СтавкаНДС);
				НовС.НДС	=НовС.Всего * ПроцНДС/(1+ПроцНДС);			
				НовС.Сумма  =НовС.Всего - НовС.НДС;
				ОСум = ОСум + НовС.Всего;
			КонецЕсли;
			
		КонецЕсли;	
	КонецЦикла;
	ПРМ.СуммаДокумента = ОСум;
	Попытка
		ПРМ.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ПРМ.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;
	ПрмСсыл = ПРМ.Ссылка;
	
	ПрайсРозн = Документы.ПрайсЛист.СоздатьДокумент();
	ПрайсРозн.ИБ = Справочники.ИБ.НайтиПоКоду("SSP");
	ПрайсРозн.Курс = 1;
	ПрайсРозн.Автор = ПараметрыСеанса.Пользователь;
	ПрайсРозн.Организация=Справочники.Организации.НайтиПоКоду("SS-001");
	ПрайсРозн.Валюта=Справочники.Валюты.НайтиПоКоду("810");
	ПрайсРозн.ТипЦен = ПрмСсыл.СкладПолучатель.Подразделение.РозничныйТипЦен;
	ПрайсРозн.Дата = Объект.ДатаПоставки;
	ПрайсРозн.Дата2 = НачалоДня(КонецГода(КонецГода(ПрайсРозн.Дата) + 100));
	УстановитьНомерДокументаКлиентСервер(ПрайсРозн);
	ПрайсРозн.Записать();
	Для Каждого ТСтр Из Объект.Товары Цикл
		Если ТСтр.ТоварНайден ИЛИ ТСтр.ТоварСоздан Тогда
			МенЗап = РегистрыСведений.ЦеныНоменклатуры.СоздатьМенеджерЗаписи();
			МенЗап.Номенклатура = ТСтр.ХарактеристикаНоменклатуры;
			МенЗап.Период = Объект.ДатаПоставки;
			МенЗап.Прайс = ПрайсРозн.Ссылка;
			МенЗап.ТипЦен = ПрайсРозн.ТипЦен;
			МенЗап.Модель = ТСтр.Номенклатура;
			МенЗап.Цена = ТСтр.Цена;
			МенЗап.Записать();
			
		КонецЕсли;	
	КонецЦикла;
	
	
	//декларации, гтд
	
	Для Каждого ТСтр Из Объект.Товары Цикл
		Если ЗначениеЗаполнено(ТСтр.ХарактеристикаНоменклатуры) Тогда
			тНоменклатура = ТСтр.ХарактеристикаНоменклатуры;
			тМодель = ТСтр.Номенклатура;
			тСтранаПроисхождения = Справочники.КлассификаторСтранМира.НайтиПоНаименованию(ТСтр.СтранаПроисхождения);
			ТДанныеСертификата = ТСтр.ДанныеСертификата;
			тНомерСертификата = СокрЛП(СтрЗаменить(ВыделитьЧасть(ТДанныеСертификата, "Номер сертификата ЕАС:", ";"), "ЕАЭС", ""));
			тДатаДекларации = ПолучитьДатуИзСтр(СокрЛП(ВыделитьЧасть(ТДанныеСертификата, "Дата окончания сертификата ЕАС:", ";")));
			тОрган = СокрЛП(ВыделитьЧасть(ТДанныеСертификата, "Серцифицирующий орган:", ";"));
			тПроизводитель = ТСтр.Производитель;
			тИзготовитель = СокрЛП(ВыделитьЧасть(тПроизводитель, "Производитель:", ";")) + ", " + СокрЛП(ВыделитьЧасть(тПроизводитель, "Адрес производителя:", ";"));
			тОрган = СокрЛП(ВыделитьЧасть(ТДанныеСертификата, "Серцифицирующий орган:", ";"));
			тИмпортер = ПолучитьИмп(ТСтр.Импортер);
			тФилиал = СокрЛП(ВыделитьЧасть(ТДанныеСертификата, "Филиал:", ";"));
			//Номер сертификата ЕАС:RU C-IT.AB71.B.24669;Дата окончания сертификата ЕАС:31.12.25;Филиал:;Адрес Филиала:;Серцифицирующий орган:ООО "ОптимаТест"
			//
			//Номер сертификата ЕАС:ЕАЭС RU C-IT.BE02.B.01570/19;Дата окончания сертификата ЕАС:27.10.2025;Филиал:;Адрес Филиала:;Серцифицирующий орган:ООО "Глобальное Соответствие"
			//
			//Номер сертификата ЕАС:ЕАЭС RU C-IT.BE02.B.01570/19;Дата окончания сертификата ЕАС:27.10.2025;Филиал:;Адрес Филиала:;Серцифицирующий орган:ООО "Глобальное Соответствие"
			//Импортёр:ООО "Миа";ИНН импортёра:7723416980;КПП импортёра:772301001
			//
			//Производитель:I.T. ITAL TESSILE S.R.L.;Адрес производителя:Италия,Via Gordoni,31 Milano
			Попытка
				СтрБр = Объект.Брэнды.Получить(0);
				Если СтрБр.Брэнд.ВидБренда = Перечисления.ВидБренда.Агентский Тогда
					Агентский = Истина;
				Иначе
					Агентский = Ложь;
				КонецЕсли;
				тДекл = НайтиУстановитьДекларацию(тНомерСертификата, тДатаДекларации, тНоменклатура, тМодель, тФилиал, тИзготовитель, тОрган, тИмпортер, тСтранаПроисхождения, Агентский);
				//ПровГТДЗапИстор(ТСтр.НомерГТД, тСтранаПроисхождения, тИмпортер, тДекл, тНоменклатура, ПрмСсыл);
			Исключение
			КонецПопытки;
		КонецЕсли;	
	КонецЦикла;
	Объект.ПНК = ПрмСсыл;
	Объект.Прайс = ПрайсРозн.Ссылка;
	Объект.Состояние = Перечисления.СостоянияЗаявкиНаСторонПост.Выполнена;
КонецПроцедуры


&НаСервере
Функция ПолучитьИзТЧ(ТЧ, ИмяРеквП, РеквП, ИмяРекв)
	Рез = Неопределено;
	Найды = Объект[ТЧ].НайтиСтроки(Новый Структура(ИмяРеквП, РеквП));
	Если Найды.Количество() Тогда
		Рез = Найды[0][ИмяРекв];
	КонецЕсли;	
	Возврат Рез;
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьПунктДоставкиД(ДокументОбъект,ИмяРеквизитаКонтрагент="Контрагент",ИмяРеквизитаПД="ПунктДоставки")	
	Контрагент		=ДокументОбъект[ИмяРеквизитаКонтрагент];
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Если ЕстьРеквизитДокумента("ОсновнойПунктДоставки",Контрагент.Метаданные()) И ЗначениеЗаполнено(Контрагент.ОсновнойПунктДоставки) Тогда
			ДокументОбъект[ИмяРеквизитаПД]=Контрагент.ОсновнойПунктДоставки;	
		ИначеЕсли КоличествоПД1(Контрагент)=1 Тогда		
			Выборка=Справочники.ПунктыДоставки.Выбрать(,Контрагент);
			Пока Выборка.Следующий() Цикл
				ДокументОбъект[ИмяРеквизитаПД]=Выборка.Ссылка;			
			КонецЦикла;
		ИначеЕсли ИмяРеквизитаКонтрагент = "СкладПолучатель" Тогда
			Выборка=Справочники.ПунктыДоставки.Выбрать(,Контрагент,,"Наименование Убыв");
			Пока Выборка.Следующий() Цикл
				ДокументОбъект[ИмяРеквизитаПД]=Выборка.Ссылка;			
			КонецЦикла;
		Иначе
			ДокументОбъект[ИмяРеквизитаПД]=Неопределено;		
		КонецЕсли;		
	Иначе
		ДокументОбъект[ИмяРеквизитаПД]=Неопределено;		
	КонецЕсли;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КоличествоПД1(Контрагент) Экспорт
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ссылка) КАК Количество
		|ИЗ
		|	Справочник.ПунктыДоставки КАК ПунктыДоставки
		|ГДЕ
		|	Владелец = &Владелец";
		
		Запрос.УстановитьПараметр("Владелец",Контрагент);
		
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Количество;			
		КонецЕсли;		
	КонецЕсли;
	
	Возврат 0;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИмп(СтрИмп)
	Рез = Неопределено;
	//Импортёр:ООО "Миа";ИНН импортёра:7723416980;КПП импортёра:772301001
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ИНН = &ИНН
	|	И Контрагенты.КПП = &КПП
	|";
	Запрос.УстановитьПараметр("ИНН", СокрЛП(ВыделитьЧасть(СтрИмп, "ИНН импортёра:", ";")));
	Запрос.УстановитьПараметр("КПП", СокрЛП(ВыделитьЧасть(СтрИмп, "КПП импортёра:", ";")));
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
		Рез = Выб.Ссылка;
	КонецЕсли;	
	Возврат Рез;
КонецФункции	

&НаСервереБезКонтекста
Функция НайтиУстановитьДекларацию(НомерСертификата, ДатаДекларации, Номенклатура, Модель, Филиал, Изготовитель, Орган, Импортер, Страна, Агентский)
	Рез = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	Декларация.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Декларация КАК Декларация
	|ГДЕ
	|	Декларация.ПометкаУдаления = ЛОЖЬ
	|	И Декларация.Наименование = &Наименование
	|	И Декларация.Объект = &Объект";
	Запрос.УстановитьПараметр("Наименование",НомерСертификата);
	Запрос.УстановитьПараметр("Объект", Модель);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Рез = Результат.Ссылка;
	Иначе	
		Декларация = Справочники.Декларация.СоздатьЭлемент();
		Декларация.ВидДокумента = Перечисления.ВидыДекларации.Сертификат;
		Декларация.Объект = Модель;
		Декларация.ДатаНачала = ДатаДекларации - 157680000; //~5 лет
		Декларация.ДатаОкончания = ДатаДекларации;
		Декларация.Наименование=НомерСертификата;
		Декларация.Организация = Импортер;	 
		Декларация.Изготовитель = Изготовитель;
		Декларация.СтранаПроисхождения = Страна;
		Декларация.Орган = Орган;
		Декларация.Сертификат = Перечисления.ОрганСертификации.ЕАС;
		Если Филиал <> "" Тогда
			Декларация.Филиал = Филиал;
		Иначе 
			Декларация.Филиал = Изготовитель;
		КонецЕсли;
		Декларация.Родитель = Справочники.Декларация.НайтиПоКоду("0009601");
		Декларация.Записать();
		Рез = Декларация.Ссылка;
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

&НаСервереБезКонтекста
Функция НайтиУстановитьДекларацию_Рез(НомерСертификата, ДатаДекларации, Номенклатура, Модель, Филиал, Изготовитель, Орган, Импортер, Страна, Агентский)
	Рез = Неопределено;
	Запрос = Новый Запрос;
	//Если Агентский Тогда
	СоотНДИст = Новый Соответствие;	
	СоотНД = Новый Соответствие;
	Запрос.Текст="ВЫБРАТЬ 
	//|История.Период КАК Период,
	//|История.Объект КАК Объект,
	////|История.Реквизит КАК Реквизит,
	//|История.Документ КК Документ,
	| 1 КАК Парт,        
	|История.Значение КАК Декларация,
	|История.Значение.ДатаОкончания КАК ДатаОкончания,
	|История.Объект КАК Объект
	|	ИЗ
	|РегистрСведений.История.СрезПоследних() КАК История
	|ГДЕ
	|История.Реквизит = ""Декларация""
	|И ТипЗначения(История.Объект )= тип(Справочник.Номенклатура)
	|И ТипЗначения(История.Значение )= тип(Справочник.Декларация)
	| И (История.Объект = &Модель
	|	ИЛИ История.Объект = &Номенклатура)
	|	ОБЪЕДИНИТЬ ВЫБРАТЬ
	|	2,
	|	Декларация.Ссылка ,
	|	Декларация.ДатаОкончания,
	|	Декларация.Объект 
	|ИЗ
	|	Справочник.Декларация КАК Декларация
	|ГДЕ
	|	Декларация.ПометкаУдаления = ЛОЖЬ
	|	И ТИПЗНАЧЕНИЯ(Декларация.Объект) = ТИП(Справочник.Номенклатура)
	|	И (Декларация.Объект = &Номенклатура
	|	ИЛИ Декларация.Объект = &Модель)
	|";
	//Запрос.УстановитьПараметр("Наименование",НомерСертификата);
	Запрос.УстановитьПараметр("Модель",Модель);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Выб = Запрос.Выполнить().Выбрать(); 
	Пока Выб.Следующий() Цикл
		Если Выб.ДатаОкончания > ТекущаяДатаСеанса() Тогда
			Если Выб.Парт = 1 Тогда
				СоотНДИст.Вставить(Выб.Объект, Выб.Декларация);
			Иначе
				СоотНД.Вставить(Выб.Объект, Выб.Декларация);
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	Если СоотНДИст.Количество() ИЛИ СоотНД.Количество() Тогда
		Если СоотНДИст.Количество() Тогда
			Для Каждого КлЗ Из СоотНДИст Цикл
				Если КлЗ.Ключ = Номенклатура ИЛИ СоотНДИст.Количество() = 1 Тогда
					Рез = КлЗ.Значение;
				КонецЕсли;	
			КонецЦикла;
			Если (Рез = Неопределено) Тогда
				Для Каждого КлЗ Из СоотНДИст Цикл
					Рез = КлЗ.Значение;
				КонецЦикла;
			КонецЕсли;
		Иначе
			Для Каждого КлЗ Из СоотНД Цикл
				Если КлЗ.Ключ = Номенклатура ИЛИ СоотНД.Количество() = 1 Тогда
					Рез = КлЗ.Значение;
				КонецЕсли;	
			КонецЦикла;
			Если (Рез = Неопределено) Тогда
				Для Каждого КлЗ Из СоотНД Цикл
					Рез = КлЗ.Значение;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		Если НЕ (Рез = Неопределено) Тогда
			Возврат Рез;
		КонецЕсли;	
	КонецЕсли;	
	
	
	//КонецЕсли;
		
	Запрос.Текст="ВЫБРАТЬ
	|	Декларация.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Декларация КАК Декларация
	|ГДЕ
	|	Декларация.ПометкаУдаления = ЛОЖЬ
	|	И Декларация.Наименование = &Наименование
	|	И Декларация.Объект = &Объект";
	Запрос.УстановитьПараметр("Наименование",НомерСертификата);
	Запрос.УстановитьПараметр("Объект",Номенклатура);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Рез = Результат.Ссылка;
	Иначе	
		Декларация = Справочники.Декларация.СоздатьЭлемент();
		Декларация.ВидДокумента = Перечисления.ВидыДекларации.Сертификат;
		Декларация.Объект = Номенклатура;
		Декларация.ДатаНачала = ДатаДекларации - 157680000; //~5 лет
		Декларация.ДатаОкончания = ДатаДекларации;
		Декларация.Наименование=НомерСертификата;
		Декларация.Организация = Импортер;	 
		Декларация.Изготовитель = Изготовитель;
		Декларация.СтранаПроисхождения = Страна;
		Декларация.Орган = Орган;
		Декларация.Сертификат = Перечисления.ОрганСертификации.ЕАС;
		Если Филиал <> "" Тогда
			Декларация.Филиал = Филиал;
		Иначе 
			Декларация.Филиал = Изготовитель;
		КонецЕсли;
		Декларация.Родитель = Справочники.Декларация.НайтиПоКоду("0009601");
		Декларация.Записать();
		Рез = Декларация.Ссылка;
	КонецЕсли;
	
	Возврат Рез;
КонецФункции


&НаСервереБезКонтекста
Процедура ПровГТДЗапИстор_рез(ГТД, Страна, Импортер,  Декл, Товар, ДокС)
	Запрос = Новый Запрос;
	Запрос.Текст= "ВЫБРАТЬ
	|	ГТД.Ссылка КАК ссылка
	|ИЗ
	|	Справочник.ГТД КАК ГТД
	|ГДЕ
	|	ГТД.Импортер = &Импортер
	|	И ГТД.ПометкаУдаления = ЛОЖЬ
	|	И ГТД.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Импортер", Импортер);
	Запрос.УстановитьПараметр("Наименование", ГТД);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Количество() = 0 Тогда
		ГТД=Справочники.ГТД.СоздатьЭлемент();
		ГТД.Импортер = Импортер;
		ГТД.Владелец=Справочники.ИБ.НайтиПоКоду("SSP");
		ГТД.Родитель=Справочники.ГТД.НайтиПоКоду("TZ2-188");
		ГТД.СтранаПроисхождения = Страна;
		ГТД.Наименование=ГТД;
		Попытка
			ГТД.Записать();		 
		Исключение
			//Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;
	Запрос.Текст="ВЫБРАТЬ
	|	История.Значение КАК значение
	|ИЗ
	|	РегистрСведений.История КАК История
	|ГДЕ
	|	История.Значение = &Значение
	|	И История.Объект = &Объект";
	Запрос.УстановитьПараметр("Значение", ГТД);
	Запрос.УстановитьПараметр("Объект", Товар);
	
	Результат=запрос.Выполнить().Выбрать();
	Если результат.Количество()=0 тогда
		НоваяЗапись = РегистрыСведений.История.СоздатьМенеджерЗаписи();
		НоваяЗапись.Объект = Товар;			
		НоваяЗапись.Реквизит = "НомерГТД"; 
		НоваяЗапись.Значение = ГТД;
		НоваяЗапись.Период = НачалоДня(ТекущаяДата())-10;	
		НоваяЗапись.Документ = ДокС;
		НоваяЗапись.Записать(); 
		
	КонецЕсли;
	
	
	Запрос.Текст="ВЫБРАТЬ
	|	История.Значение КАК значение
	|ИЗ
	|	РегистрСведений.История КАК История
	|ГДЕ
	//|	История.Значение В(&Значение)
	|	История.Значение = &Значение
	|	И История.Объект = &Объект";
	Запрос.УстановитьПараметр("Значение", Декл);
	Запрос.УстановитьПараметр("Объект", Товар);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если результат.Количество()=0 тогда
		НоваяЗапись = РегистрыСведений.История.СоздатьМенеджерЗаписи();
		НоваяЗапись.Объект = Товар;			
		НоваяЗапись.Реквизит = "Декларация"; 
		НоваяЗапись.Значение = Декл;
		НоваяЗапись.Период = Декл.ДатаНачала;	
		// НоваяЗапись.Документ=ДокС;
		НоваяЗапись.Записать(); 
	КонецЕсли;
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Функция ПарситСостав(ВхСтр, СимвПр = "%", СимволР = ",")
	Рез = Новый Массив;
	//л = 1
	ОстСтр = ВхСтр;
	ОстСтр = СтрЗаменить(ОстСтр, " ", СимволР);
	Поз = 1;
	РезОст = "";
	Пока Поз <= СтрДлина(ОстСтр) Цикл
		ТекС = Сред(ОстСтр, Поз, 1);
		Если НЕ ((ТекС = СимволР) И (Сред(ОстСтр, Поз - 1, 1) = СимвПр)) Тогда
			РезОст = РезОст + ТекС;
		КонецЕсли;	
		Поз = Поз + 1;
	КонецЦикла;	
	ОстСтр = РезОст;
	Пока НЕ ОстСтр = "" Цикл
		Поз1 = СтрНайти(ОстСтр, СимвПр);
		Если Поз1 >= 1 Тогда
			//ВхСтр1 = Сред(ВхСтр, Поз1 + СтрДлина(КлючП));
			//Поз2 = СтрНайти(ВхСтр1, ";");
			Проц = Число(СокрЛП(Лев(ОстСтр, Поз1 - СтрДлина(СимвПр))));
			Поз2 = СтрНайти(ОстСтр, СимволР);
			Если Поз2 >= 1 Тогда
				СтрМат =  СокрЛП(Сред(ОстСтр, Поз1 +  СтрДлина(СимвПр), Поз2 - Поз1 - СтрДлина(СимволР) +  СтрДлина(СимвПр) - 1));
				ОстСтр = СокрЛП(Сред(ОстСтр, Поз2 + СтрДлина(СимволР)));
			Иначе
				СтрМат = Сред(ОстСтр, Поз1 + СтрДлина(СимвПр));
				ОстСтр = "";
			КонецЕсли;
			Рез.Добавить(Новый Структура("Проц, Мат", Проц, СтрМат));
		Иначе
			ОстСтр = "";
		КонецЕсли;
	КонецЦикла;	
	
	
	Возврат Рез;
КонецФункции

&НаСервереБезКонтекста
Процедура ПрописатьШтрихКодаТовара(Номенклатура, ТипШК, ШтрихКод)
	 СсылкаНаШК=ПолучитьШтрихКодТовара(Номенклатура,ТипШК,Перечисления.ВидыШК.Основной,"Ссылка");
	 Если СсылкаНаШК=Неопределено Тогда
		 ШКОбъект=Справочники.ШтрихКоды.СоздатьЭлемент();			
		 ШКОбъект.Владелец	=Номенклатура;
		 ШКОбъект.ТипШК		=ТипШК;
		 ШКОбъект.ВидШК		=Перечисления.ВидыШК.Основной;
	 ИначеЕсли СсылкаНаШК.Наименование="9999999999999" Тогда
		 ШКОбъект=СсылкаНаШК.ПолучитьОбъект();
	 Иначе
		 // по идее нормальный штрих код		
		 Возврат;
	 КонецЕсли; 	
	 
	 ШКОбъект.Наименование	=ШтрихКод;
	 ШКОбъект.ПометкаУдаления=Ложь;
	 если СтрДлина(ШтрихКод)=13 тогда
		 КС=КонтрольныйСимволEAN(Лев(ШКОбъект.Наименование,12),13);
		 Если Прав(ШКОбъект.Наименование,1)<> КС тогда
			 Сообщить("ШК - не записан. Некорректный контрольный символ  в ШК-"+ШКОбъект.Наименование+".В Номенклатуре "+Номенклатура.наименование+". Допустимый ШК - "+Лев(ШКОбъект.Наименование,12)+КС);
	 
			 НомерШК=ПолучитьМаксимальныйНомерШК()+1;
			 
			 ШКШтуки="20"+Формат(НомерШК,"ЧЦ=10; ЧРГ=; ЧВН=; ЧГ=0");
			 ШКШтуки=ШКШтуки+КонтрольныйСимволEAN(ШКШтуки,13);
			 
			 ШКБлочка="21"+Формат(НомерШК,"ЧЦ=10; ЧРГ=; ЧВН=; ЧГ=0");
			 ШКБлочка=ШКБлочка+КонтрольныйСимволEAN(ШКБлочка,13);
			 
			 ШККоробки="22"+Формат(НомерШК,"ЧЦ=10; ЧРГ=; ЧВН=; ЧГ=0");
			 ШККоробки=ШККоробки+КонтрольныйСимволEAN(ШККоробки,13);
			 
			 ПрописатьШтрихКодаТовара(Номенклатура,Перечисления.ТипыШтрихКодов.Штука,ШКШтуки);
			 ПрописатьШтрихКодаТовара(Номенклатура,Перечисления.ТипыШтрихКодов.Блочок,ШКБлочка);
			 ПрописатьШтрихКодаТовара(Номенклатура,Перечисления.ТипыШтрихКодов.Коробка,ШККоробки);
		 
		 иначе
			 попытка
				 ШКОбъект.Записать();	
			 Исключение
				 Сообщить(ОписаниеОшибки());
			 КонецПопытки;		 		 
		 КонецЕсли;
	 иначе
		 попытка
			 ШКОбъект.Записать();	
		 Исключение
			 Сообщить(ОписаниеОшибки());
		 КонецПопытки;
	 КонецЕсли;
	 
КонецПроцедуры//ПрописатьШтрихКодаТовара 

&НаСервереБезКонтекста
Функция ПолучитьМаксимальныйНомерШК()
	 Запрос=Новый Запрос;
	 Запрос.Текст="
	 |ВЫБРАТЬ ПЕРВЫЕ 1
	 |	ПОДСТРОКА(ШтрихКоды.Наименование, 3, 10) КАК НомерШК
	 |ИЗ
	 |	Справочник.ШтрихКоды КАК ШтрихКоды
	 |ГДЕ 
	 |	ПОДСТРОКА(ШтрихКоды.Наименование, 1, 1)=""6""
	 //	|	И ПОДСТРОКА(ШтрихКоды.Наименование, 3, 5)=""00000""
	 |	И ПОДСТРОКА(ШтрихКоды.Наименование, 3, 4)=""0000""
	 |УПОРЯДОЧИТЬ ПО 
	 |	ПОДСТРОКА(ШтрихКоды.Наименование, 3, 10) УБЫВ";
	 
	 Выборка=Запрос.Выполнить().Выбрать();
	 Если Выборка.Следующий() Тогда
		 Возврат Число(Выборка.НомерШК);	
	 Иначе
		 Возврат 0;
	 КонецЕсли; 
	 
КонецФункции

&НаКлиенте
Процедура ФормирДок(Команда)
	Прот = "";
	ФормирНом();
	ФормирДокНаСервере();
	Если Объект.Товары.Количество() Тогда
		Элементы.Группа10.Заголовок = "Товары (" + Формат(Объект.Товары.Итог("Количество"), "ЧДЦ=0; ЧГ=3,0") + ")";
	Иначе
		Элементы.Группа10.Заголовок = "Товары";
	КонецЕсли;
	Если Объект.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияЗаявкиНаСторонПост.Выполнена") Тогда
		//ЭтаФорма.ТолькоПросмотр = Истина;
		Объект.Комментарий = Объект.Комментарий + " заявка на поставку сторон. ассортимента выполнена - созданы документы";
		Элементы.ФормаОбработать.Доступность = Ложь;
		Элементы.ФормаЗагрузитьИзФайла.Доступность = Ложь;
		Элементы.ФормаФормирДок.Доступность = Ложь;
		Элементы.Состояние.ТолькоПросмотр = Истина;
	КонецЕсли;
	//Элементы.ФормаЗагрузитьИзФайла.Доступность = Ложь;
	//Элементы.ФормаОбработать.Доступность = Ложь;
	//Элементы.ФормаФормирДок.Доступность = Ложь;
	ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
	ЭтаФорма.Записать();
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

&НаСервере
Процедура КоллекцииПриИзмененииНаСервере(ТСтрока)
	// Вставить содержимое обработчика.
	ТСтрока = ?(ТСтрока = Неопределено, 0, ТСтрока);
	СтрТ = Объект.Коллекции.НайтиПоИдентификатору(ТСтрока);
	СтрТ.УИД = "";
	Если ЗначениеЗаполнено(СтрТ.Коллекция) Тогда
		СтрТ.УИД = СокрЛП(СтрТ.Коллекция.УникальныйИдентификатор());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КоллекцииПриИзменении(Элемент)
	КоллекцииПриИзмененииНаСервере(Элементы.Коллекции.ТекущаяСтрока);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьДатуИзСтр(СтрДата)
	
	Рез = Неопределено;
	Попытка
		СтрДата = СокрЛП(СтрДата);
		СтрРез = "";
		РаздТ = Найти(СтрДата,".");
		РаздТр = Найти(СтрДата,"-");
		РаздЗ = Найти(СтрДата,",");
		РаздСП = Найти(СтрДата,"/");
		РаздСО = Найти(СтрДата,"\");
		РаздДТ = Найти(СтрДата,":");
		Если (РаздТ>0) И (РаздТр>0) Тогда
			Если (РаздТ>РаздТр) Тогда
				РаздТ = 0;
			КонецЕсли;
		КонецЕсли;
		
		Если (РаздТ > 0) ИЛИ (РаздЗ > 0) Тогда
			//сообщить("РаздСП "+строка(РаздСП));
			//предположим германский с разными разделителями
			Если (Сред(СтрДата,3,1) = ".") Тогда
				Попытка
					Если (РаздДТ > 0) Тогда
						СтрРез = Сред(СтрДата,7,4) + Сред(СтрДата,4,2) + Лев(СтрДата,2);
						СтрЧМ = СокрЛП(Сред(СтрДата,11));
						СтрЧМ = СтрЗаменить(СтрЧМ,":","");
						СтрЧМ = СтрЗаменить(СтрЧМ,"T","");
						Если СтрДлина(СтрЧМ) = 5 Тогда
							СтрЧМ = "0" + СтрЧМ;
						КонецЕсли;
						Если СтрДлина(СтрЧМ)>6 Тогда
							СтрЧМ = Лев(СтрЧМ,6);
						КонецЕсли;
						Если НЕ(СтрЧМ = "000000") Тогда
							СтрРез = СтрРез + СтрЧМ;
						КонецЕсли;
						Рез = Дата(СтрРез);
					Иначе	
						СтрРез = Сред(СтрДата,7,4) + Сред(СтрДата,4,2) + Лев(СтрДата,2);
						Рез = Дата(СтрРез);
					КонецЕсли;
				Исключение
				КонецПопытки;
			КонецЕсли;
			
		ИначеЕсли РаздТр>0 Тогда
			
			Если Сред(СтрДата,3,1) = "-" Тогда
				Попытка
					Если РаздДТ>0 Тогда
						СтрРез = Сред(СтрДата,7,4) + Сред(СтрДата,4,2) + Лев(СтрДата,2);
						СтрЧМ = СокрЛП(Сред(СтрДата,11));
						
						СтрЧМ = СтрЗаменить(СтрЧМ,":","");
						СтрЧМ = СтрЗаменить(СтрЧМ,"T","");
						Если СтрДлина(СтрЧМ) = 5 Тогда
							СтрЧМ = "0" + СтрЧМ;
						КонецЕсли;
						Если СтрДлина(СтрЧМ)>6 Тогда
							СтрЧМ = Лев(СтрЧМ,6);
						КонецЕсли;
						Если НЕ(СтрЧМ = "000000") Тогда
							СтрРез = СтрРез + СтрЧМ;
						КонецЕсли;
						Рез = Дата(СтрРез);
					Иначе	
						СтрРез = Сред(СтрДата,7,4) + Сред(СтрДата,4,2) + Лев(СтрДата,2);
						Рез = Дата(СтрРез);
					КонецЕсли;
				Исключение
				КонецПопытки;
			Иначе
				СтрЧМ = СокрЛП(Сред(СтрДата,11));
				СтрРез = СтрЗаменить(СокрЛП(Лев(СтрДата,10)),"-","");
				СтрЧМ = СтрЗаменить(СтрЧМ,":","");
				СтрЧМ = СтрЗаменить(СтрЧМ,"T","");
				Если СтрДлина(СтрЧМ) = 5 Тогда
					СтрЧМ = "0" + СтрЧМ;
				КонецЕсли;
				Если СтрДлина(СтрЧМ)>6 Тогда
					СтрЧМ = Лев(СтрЧМ,6);
				КонецЕсли;
				Если НЕ(СтрЧМ = "000000") Тогда
					СтрРез = СтрРез + СтрЧМ;
				КонецЕсли;
				Рез = Дата(СтрРез);
			КонецЕсли;
			
		ИначеЕсли РаздСП>0 Тогда
			ДлС = СтрДлина(СтрДата);
			сообщить(длс);
			СтрГод = "";
			СтрМес = "";
			СтрДень = "";
			Поз = 1;
			СчтСлаш = 0;
			Пока Поз<= ДлС Цикл
				Если Сред(СтрДата, Поз, 1) = "/" Тогда
					СчтСлаш = СчтСлаш + 1;
				Иначе
					Если СчтСлаш = 0 Тогда
						СтрМес = СтрМес + Сред(СтрДата, Поз, 1);
					ИначеЕсли СчтСлаш = 1 Тогда
						СтрДень = СтрДень + Сред(СтрДата, Поз, 1);
					Иначе
						СтрГод = СтрГод + Сред(СтрДата, Поз, 1);
					КонецЕсли;
				КонецЕсли;
				Поз  =  Поз  +  1;
			КонецЦикла;
			СтрГод = ?(СтрДлина(СтрГод)>4, Лев(СтрГод,4), СтрГод);
			Рез = Дата(Число(СтрГод),Число(СтрМес), Число(СтрДень));
		Иначе
			//анси формат
			Если СтрДлина(СтрДата)>= 8 Тогда
				Рез = Дата(Лев(СтрДата,8));
			КонецЕсли;
		КонецЕсли;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	Возврат Рез;
	
КонецФункции

&НаСервере
Процедура ПодразделениеПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
	Объект.СкладПолучПРМ = Объект.Подразделение.ОсновнойСклад;
	Если НЕ ЗначениеЗаполнено(Объект.СкладПолучПРМ) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Склады.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	Склады.Подразделение = &Подразделение";
		Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
		Выб = Запрос.Выполнить().Выбрать();
		Если Выб.Следующий() Тогда
			Объект.СкладПолучПРМ = Выб.Ссылка;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ПодразделениеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПапНовМодПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Для Каждого ТСтр Из ТЗПоискНом Цикл
		ТСтр.Род = ПапНовМод;
	КонецЦикла;	
КонецПроцедуры


&НаКлиенте
Процедура СостояниеПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Если Объект.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияЗаявкиНаСторонПост.Отменена") Тогда
		ПараметрыФормы = Новый Структура;
		//ПараметрыФормы.Вставить("Заголовок",	"Введите штрихкод товара вручную...");
		//ПараметрыФормы.Вставить("ВидШтрихкода",	"Товар");
		Оповещение = Новый ОписаниеОповещения("Отказ_Окончание", ЭтаФорма);
		//ЭтаФорма.НеОбрабатыватьШтрихкод = Истина;
		ОткрытьФорму("Документ.ЗаявкаНаПостСторонАссорт.Форма.ФормаОтказ", ПараметрыФормы,,,,, Оповещение);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте 
Процедура Отказ_Окончание(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если НЕ ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Объект.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияЗаявкиНаСторонПост.КСогласованию");
		// ничего не выбрали
		//ЭтаФорма.Элементы.ТоварыУстановитьПродавца.Пометка = Ложь;
		//Возврат;
		Элементы.ФормаОбработать.Доступность = МожноОбработать;
		Элементы.Группа5.ТекущаяСтраница = ?(МожноОбработать, Элементы.Группа8, Элементы.Группа6);
		Элементы.ФормаФормирДок.Доступность = МожноОбработать;
		Элементы.Статус.Картинка = ?(Объект.ИменаКолонок.Количество() = 0, БиблиотекаКартинок.ОформлениеКвадратыПустые, ?(МожноОбработать, БиблиотекаКартинок.ОформлениеКругЗелeный, БиблиотекаКартинок.ОформлениеКругКрасный));
		ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
		ЭтаФорма.Записать();
		ЭтаФорма.ОбновитьОтображениеДанных();
	Иначе
		Объект.Комментарий = Объект.Комментарий + " отказ от согласования - " + РезультатЗакрытия + "  - дальнейшая обработка невозможна";
		МожноОбработать = Ложь;
		Элементы.ФормаЗагрузитьИзФайла.Доступность = МожноОбработать;
		Элементы.ФормаОбработать.Доступность = МожноОбработать;
		Элементы.Группа5.ТекущаяСтраница = ?(МожноОбработать, Элементы.Группа8, Элементы.Группа6);
		Элементы.ФормаФормирДок.Доступность = МожноОбработать;
		Элементы.Статус.Картинка = ?(Объект.ИменаКолонок.Количество() = 0, БиблиотекаКартинок.ОформлениеКвадратыПустые, ?(МожноОбработать, БиблиотекаКартинок.ОформлениеКругЗелeный, БиблиотекаКартинок.ОформлениеКругКрасный));
		ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
		ЭтаФорма.Записать();
		ЭтаФорма.ОбновитьОтображениеДанных();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПровПарсСостНаСервере(СтрНом)
	// Вставить содержимое обработчика.
	СтрСост = ВыделитьЧасть(СтрНом, "Состав:", ";"); 
	сообщить(СтрСост);
	СтрукСост = ПарситСостав(СтрСост);
	Для Каждого ТЭл Из СтрукСост Цикл
		Попытка
			//НовС = МодО.СоставНоменклатуры.Добавить(); 
			Сообщить(ТЭл.Мат + " % " + строка(ТЭл.Проц));
			МатериалСостав = Справочники.МатериалыСостав.НайтиПоНаименованию(СокрЛП(ТЭл.Мат));
			Сообщить("МатериалСостав" + строка(МатериалСостав));
			Процент = ТЭл.Проц;
			Прот = Прот + "Добавление состава материал " + СокрЛП(МатериалСостав) + " % " + СокрЛП(Процент) + Символы.ПС;
		Исключение
			Прот = Прот + "Ошибка при добавлении состава материал " + ОписаниеОшибки() + Символы.ПС;
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПровПарсСост(Команда)
	ПровПарсСостНаСервере(Элементы.Товары.ТекущиеДанные.СтрНоменклатура);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьФайлСтр(Команда)
	// Вставить содержимое обработчика.
	
	ДиалогФыбораФайла								=	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогФыбораФайла.Фильтр						=	"Файлы Excel (*.xls;*.xlsx)|*.xls;*.xlsx";
	ДиалогФыбораФайла.Заголовок						=	"Введите имя файла";
	ДиалогФыбораФайла.ПредварительныйПросмотр		=	Ложь;
	ДиалогФыбораФайла.Расширение					=	"xlsx, xls";
	ДиалогФыбораФайла.ИндексФильтра					=	0;
	Прод=Ложь;
	Если ДиалогФыбораФайла.Выбрать() Тогда 
		ИмяФайла = ДиалогФыбораФайла.ПолноеИмяФайла;
		ДанныеФайла = Base64Значение(Объект.ИсходныйФайлСтрока);
		ДанныеФайла.Записать(ИмяФайла);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ТНВЭДыПриИзмененииНаСервере(ТСтрока)
	// Вставить содержимое обработчика.   
	ТСтрока = ?(ТСтрока = Неопределено, 0, ТСтрока);
	СтрТ = Объект.ТНВЭДы.НайтиПоИдентификатору(ТСтрока);
	СтрТ.УИД = "";
	Если ЗначениеЗаполнено(СтрТ.ТНВЭД) Тогда
		СтрТ.УИД = СокрЛП(СтрТ.ТНВЭД.УникальныйИдентификатор());
	КонецЕсли;
КонецПроцедуры

//&НаСервере
//Процедура ВидыНоменклатурыПриИзмененииНаСервере(ТСтрока)
//	// Вставить содержимое обработчика.
//	ТСтрока = ?(ТСтрока = Неопределено, 0, ТСтрока);
//	СтрТ = Объект.ВидыНоменклатуры.НайтиПоИдентификатору(ТСтрока);
//	СтрТ.УИД = "";
//	Если ЗначениеЗаполнено(СтрТ.ВидНоменклатуры) Тогда
//		СтрТ.УИД = СокрЛП(СтрТ.ВидНоменклатуры.УникальныйИдентификатор());
//	КонецЕсли;
//КонецПроцедуры
&НаКлиенте
Процедура ТНВЭДыПриИзменении(Элемент)
	ТНВЭДыПриИзмененииНаСервере(Элементы.ТНВЭДы.ТекущаяСтрока);
КонецПроцедуры
