
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если ТекущийОбъект.Операция=0 Тогда
		Операция	= "Прием";
		Элементы.Отправитель.Заголовок="Отправитель";
	Иначе
		Операция	= "Отправка";
		Элементы.Отправитель.Заголовок="Получатель";		
	КонецЕсли;
	
	Для Каждого СтрокаТО Из Объект.ОбработанныеОбъекты Цикл
		Менеджер	= ФР_ОбщегоНазначения_ПИ.ПолучитьМенеджер(СтрокаТО.ОбъектТип);
		Если Менеджер<>Неопределено Тогда
			Если ФР_ОбщегоНазначения_ПИ.ЭтоСсылочныйТип(СтрокаТО.ОбъектТип) Тогда
			    СтрокаТО.Ссылка=Менеджер.ПолучитьСсылку(СтрокаТО.ОбъектСсылкаУИД);
			КонецЕсли;			
		КонецЕсли; 		
	КонецЦикла; 
	
	Если ТекущийОбъект.ДанныеСообщения<>Неопределено Тогда
		СообщениеСтрокой=ТекущийОбъект.ДанныеСообщения.Получить();	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработанныеОбъектыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элемент.ТекущиеДанные<>Неопределено И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Ссылка) Тогда
		ОткрытьЗначение(Элемент.ТекущиеДанные.Ссылка);	
	КонецЕсли;	
КонецПроцедуры
