#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПолеВВодаКодаПриИзменении(Элемент)
	//ПолеВВодаПриИзмененииНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ВидПоискаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ПолеВВодаКода) Тогда 
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеИзмененияВидаПоиска",ЭтотОбъект); 
		ПоказатьВопрос(ОписаниеОповещения,"Выполнить поиск с выбранным значением вида поиска?",РежимДиалогаВопрос.ДаНет); 	
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Обновить(Команда)
	
	Если Не ЗначениеЗаполнено(ПолеВВодаКода) Тогда
		ПоказатьПредупреждение( , "Введите часть кода!");
		Возврат;
	КонецЕсли;
	
	ПолеВВодаПриИзмененииНаКлиенте(); 
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ПослеИзмененияВидаПоиска(ОтветНаВопрос,ДопПараметры) Экспорт

	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
	
		ПолеВВодаПриИзмененииНаКлиенте(); 	
	
	КонецЕсли;

КонецПроцедуры // ()

&НаКлиенте
Процедура ПолеВВодаПриИзмененииНаКлиенте()
	Перем СтрокаВар;
	Перем МассивКМ;
	Перем ЭлементМассива; 
	
	НачалоВыполнения  = ТекущаяДата();
		
	ВремяВыполненияВСек = 0; 	
	ВозможныеВарианты.Очистить();	
	Информация = ""; 
	
	МассивКМ = НайтиКодыМаркировкиПоЧастиКода(ПолеВВодаКода,Информация,ВидПоиска);
	
	ИнформацияОПоиске = Информация; 
	
	НомерСтроки = 1; 
	Для Каждого ЭлементМассива Из МассивКМ Цикл
		СтрокаВар = ВозможныеВарианты.Добавить();
		СтрокаВар.ШтрихкодУпаковки = ЭлементМассива;
		СтрокаВар.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1; 
	КонецЦикла;
	
	Если МассивКМ.Количество() = 0 Тогда
		ПоказатьПредупреждение( , "Коды маркировки по введенному текст не найдены!");
	КонецЕсли;
	
	ОкончаниеВыполнения  = ТекущаяДата();
	
	ВремяВыполненияВСек = ОкончаниеВыполнения - НачалоВыполнения; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиКодыМаркировкиПоЧастиКода(Знач ЧастьКода,Информация,ВидПоискаКода)
	
	МассивКМ = Новый Массив;

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДлинаСтроки", СтрДлина(ЧастьКода));
	Запрос.УстановитьПараметр("ПолеВвода", ЧастьКода);
	
	
	Если ВидПоискаКода = 0 Тогда
		
		Запрос.Текст = ТекстЗапросаПодстрока();
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%НачалоСтроки%", "1");

		РезультатЗапроса = Запрос.Выполнить();
		
		Информация = "Поиск по началу строки"; 
		
	ИначеЕсли ВидПоискаКода = 1 Тогда
		
		Запрос.Текст = ТекстЗапросаПодстрока();
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%НачалоСтроки%",
			"ДЛИНАСТРОКИ(ШтрихкодыУпаковокТоваров.Наименование) - &ДлинаСтроки +1");
			
		РезультатЗапроса = Запрос.Выполнить();
		
		Информация = "Поиск по окончанию строки";
				
	Иначе 
		
		Запрос.Текст = ТекстЗапросаПодобно();
		Запрос.УстановитьПараметр("ПолеВвода", "%" + ЧастьКода + "%");
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Информация = "Поиск по подобию строки";
		
	КонецЕсли;	
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Информация = "Коды не найдены";
		
	Иначе 
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			МассивКМ.Добавить(ВыборкаДетальныеЗаписи.ссылка);
		КонецЦикла;	
		
	КонецЕсли;	

	Возврат МассивКМ;

КонецФункции
&НаСервереБезКонтекста
Функция ТекстЗапросаПодстрока()
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	НЕ ШтрихкодыУпаковокТоваров.ПометкаУдаления
	|	И ПОДСТРОКА(ШтрихкодыУпаковокТоваров.Наименование, %НачалоСтроки%, &ДлинаСтроки) = &ПолеВвода";

	Возврат ТекстЗапроса;
КонецФункции

&НаСервереБезКонтекста
Функция ТекстЗапросаПодобно()
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	НЕ ШтрихкодыУпаковокТоваров.ПометкаУдаления
	|	И ШтрихкодыУпаковокТоваров.Наименование ПОДОБНО &ПолеВвода";

	Возврат ТекстЗапроса;
КонецФункции


#КонецОбласти