
Процедура ПередЗаписью(Отказ)
	
	//крохин начало 20.03.2013
	//крохин начало 28.03.2013
	//ошибка
	//Если НЕ ОбменДанными.Загрузка И ПараметрыСеанса.ЭтотУзел.Подразделение <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
	Если НЕ ОбменДанными.Загрузка И ПараметрыСеанса.ЭтотУзел.ТипУзла <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
	//крохин конец 28.03.2013
		СообщитьИзМодуля("Декларации вводятся только в ЦО");
		Отказ = Истина;
	КонецЕсли;
	
	//крохин конец 20.03.2013
	
	//крохин начало 31.05.2019
//вместо авторегистрации изменений
	УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
//крохин конец 31.05.2019
	
КонецПроцедуры
