 Перем СписокДоступныхСостояний;
 Перем ЗаписыватьТолькоЗаявку;
 перем ТЗНакладных; 
 //кухарь 15.03.15 начало
 перем ТЗЛистыНабора;
 //кухарь 15.03.15 конец
 
 
 // Кухарь А.Ю. 19.03.2021 начало
 // Замер времени. В хранилище не ставить
 Перем ТребуетсяЗамерВремени;
 Перем ДатаНачалаЗамера;
 // Кухарь А.Ю. 19.03.2021 конец
 
 Перем СписокФиксПрайс;
 
 //--------------------------------------------------------------
 //нечаева 29,03,24+++
 // бэст прайс.
 Процедура СообщитьМенеджеруБэст(ТемаПисьма) Экспорт
	 
	 Если ПараметрыСеанса.Отладка Тогда
		 Возврат;
	 КонецЕсли;
	 
	 
	 //	Менеджер=СтрШапка.контрагент.Менеджер;
	 Профиль= Новый ИнтернетПочтовыйПрофиль;
	 
	 ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	 ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);		 
	 // Кухарь А.Ю.  08.09.2022 конец
	 Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	 
	 
	 ////----------------------------------------------------------------
	 Сообщение=новый интернетПочтовоеСообщение;
	 Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	 //Сообщение.Получатели.Добавить("ovlto@collant.ru");
	 
	 Сообщение.Отправитель="ecode@collant.ru";
	 
	 Сообщение.Тема = ТемаПисьма;
	 Строка=Символ(13)+Символ(13)+"       Добрый день!"+Символ(13)+Символ(13);
	 //
	 //Для рр=0 по файлы.Количество()-1 Цикл
	 //	Строка=Строка+символы.ПС+Файлы[рр];
	 //КонецЦикла;
	 
	 
	 НомСтр=1;
	 
	 Строка=Строка+Символы.ПС;
	 Если СписокФиксПрайс.количество()>0 Тогда
		 Строка=Строка+Символы.ПС+"Заведите водителей, необходима переотправка уведомлений об отгрузке:";
	 КонецЕсли;	
	 
	 Если НЕ СписокФиксПрайс=Неопределено и СписокФиксПрайс.Количество()>0 Тогда
		 Для рр=0 по СписокФиксПрайс.Количество()-1 Цикл
			 Строка=Строка+Символы.ПС+НомСтр+". "+СписокФиксПрайс[рр];
			 Строка=Строка+Символы.ПС;
			 НомСтр=НомСтр+1;
		 КонецЦикла;
	 конецЕсли;
	 Строка=Строка+Символы.ПС+"________________________________________________________________";
	 
	 Сообщение.Тексты.Добавить(Строка);
	 
	 //Сообщение.Вложения.Добавить(ПутьФайла);
	 
	 Почта= Новый ИнтернетПочта;
	 попытка
		 Почта.Подключиться(Профиль);
	 исключение
		 //КритичОшибки.Добавить("Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки() );
	 конецПопытки;
	 Попытка
		 Почта.Послать(Сообщение);
		 ЗаписатьВЛог("Отправка писем Бест Прайс","Письмо отправлено","Информация");   
	 исключение
		 
	 конецПопытки;
	 Почта.Отключиться();
	 //УдалитьФайлы(ИмяФайлаПечати);     //+++
	 
 КонецПроцедуры
 
 функция ПолучитьРеквизитРНКПНКПРМ(Документ,ИмяРеквизита)
	 
	 ЗначениеРеквизита = неопределено;
	 
	 ПоискНомера=новый Запрос;
	 ПоискНомера.Текст="ВЫБРАТЬ
	 |	РеквизитыРНКПНКПРМ.ЗначениеРеквизита КАК ЗначениеРекв
	 |ИЗ
	 |	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
	 |ГДЕ
	 |	РеквизитыРНКПНКПРМ.Документ = &Документ
	 |	И РеквизитыРНКПНКПРМ.ИмяРеквизита = &ИмяРеквизита";
	 ПоискНомера.УстановитьПараметр("Документ", Документ);
	 ПоискНомера.УстановитьПараметр("ИмяРеквизита",ИмяРеквизита);
	 СписокНомеров=ПоискНомера.Выполнить().Выбрать();
	 
	 Пока СписокНомеров.Следующий() Цикл
		 
		 ЗначениеРеквизита = СписокНомеров.ЗначениеРекв;
		 
	 КонецЦикла;
	 возврат ЗначениеРеквизита; 
	 
 конецФункции
 // нечаева 29,03,24---
 
 Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	 //+++Чирков 25.05.2025	 
	 Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
	 
	 ДополнительныеСвойства.Вставить("Начало", ТекущаяУниверсальнаяДатаВМиллисекундах());
	 
	 Если Модифицированность() 
		 ИЛИ КоличествоЛН = 0 ИЛИ КоличествоНакладных = 0 Тогда
		 ОбновитьКоличестваРНКиЛН();				 
	 КонецЕсли;
	 //---Чирков 25.05.2025
	 
	 // Кухарь А.Ю. 20.03.2021 начало
	 // Замер времени. В хранилище не ставить
	 ТребуетсяЗамерВремени=ложь;
	 ДатаНачалаЗамера=ТекущаяДата();
	 // Кухарь А.Ю. 20.03.2021 конец
	 
	 //кухарь 15.03.15 начало
	 //УстановитьНомерДокумента(ЭтотОбъект);
	 если ЭтоНовый() тогда 
		 // +++ {Кузнецов [22.12.2022]
		 #Если Клиент Тогда
			 УстановитьНомерДокумента(ЭтотОбъект);
		 #КонецЕсли
		 // }Кузнецов +++ [22.12.2022]
		 ШтрихКод=УстановитьШКЛЗ();
	 КонецЕсли;
	 Дата=ТекущаяДата();
	 //кухарь 15.03.15  конец
	 ТЗНакладных=новый ТаблицаЗначений;
	 
	 ВсеПолные=ПроверкаЧтоВсеНакладныеПолностью();
	 если РежимЗаписи<>РежимЗаписиДокумента.ОтменаПроведения тогда   
		 
		 
		 
		 //Тимофеев Ю.А. 14.08.2023	 
		 Если СостояниеНакладной=Перечисления.СостоянияНакладной.ОжиданиеСканирования тогда
			 //проверка - нужно ли сдавать паллеты после здачи постаки  
			 Если Ссылка.СостояниеНакладной<>ЭтотОбъект.СостояниеНакладной Тогда
				 ЗаполнитьПаллетыКВозвратуПоНакладным();			 
			 КонецЕсли;
			 
		 КонецЕсли;
		 //Тимофеев Ю.А. 14.08.2023
		 
		 
		 если СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена тогда
			 
			 // Кухарь А.Ю. 20.03.2021 начало
			 // Замер времени. В хранилище не ставить
			 ТребуетсяЗамерВремени=Истина; 
			 // Кухарь А.Ю. 20.03.2021 конец
			 
			 // Кухарь А.Ю. 02.03.2021 начало
			 //Чтобы база не висела
			 ПараметрыСеанса.ОтключитьЖурнализациюЗаписи=Истина;
			 ПараметрыСеанса.ЗапущенаОбработка=Истина;
			 ПараметрыСеанса.ВыполнятьЗамерыПроизводительности=ложь;	 
			 // Кухарь А.Ю. 02.03.2021 конец
			 
			 ВсеВРГ=ПроверкаЧтоВсеНакладныеВРГ();
			 если не ВсеВРГ тогда
				 #Если Клиент Тогда
					 Сообщить("Не все накладные готовы к отгрузке");	
				 #КонецЕсли
				 Отказ=Истина;
			 иначе
				 
			 КонецЕсли;
			 
			 
			 
			 если не ОтгружатьНеполныеНакладные	тогда
				 если не ВсеПолные тогда
					 #Если Клиент Тогда
						 Сообщить("Не все накладные отсканированы полностью");	
					 #КонецЕсли
					 
					 отказ=Истина
				 КонецЕсли;			 
			 КонецЕсли;	
			 // Кухарь А.Ю. 02.03.2021 начало
			 // Оптимизация
			 если не ПроверитьОстаткиТоваров() тогда
				 отказ=Истина;
			 КонецЕсли;
			 Если не ПроверитьСФ() тогда
				 Отказ=Истина;
			 КонецЕсли;			 
			 // Кухарь А.Ю. 02.03.2021 конец
			 
			 
			 // Кухарь А.Ю. 19.03.2021 начало
			 //Оптимизация
			 //   ТЗНакладных.Свернуть("Накладная,ВидНакладной,НомерНакладной");
			 ТЗНакладных.Свернуть("СостояниеНакладной,ДатаОтгрузки,Накладная,ВидНакладной,НомерНакладной");
			 // Кухарь А.Ю. 19.03.2021 конец
			 
			 
			 для каждого ТНакладная из ТЗНакладных цикл	
				 // Кухарь А.Ю. 19.03.2021 начало
				 //оптимизация
				 // если ТНакладная.Накладная.ДатаОтгрузки<>ДатаОтгрузки тогда				 
				 если ТНакладная.ДатаОтгрузки<>ДатаОтгрузки тогда					 
					 // Кухарь А.Ю. 19.03.2021 конец
					 #Если Клиент Тогда
						 Сообщить("У "+ТНакладная.Накладная+" дата отгрузки изменена. Необходимо заново сформировать лист загрузки и отсканировать все короба.");	 
						 // Кухарь А.Ю.  16.07.2025 начало
						 если ПолучитьРеквизитШапки(ТНакладная.Накладная,"Номер","Документ") = Неопределено тогда
							 Сообщить("Обнаружена накладная, которую ОВЛ распределили, но она не выгрузилась в базу склада. Сообщите об этом менеджеру и тех. поддержке.");
							 Продолжить;
						 КонецЕсли;
						 // Кухарь А.Ю.  16.07.2025 конец

						 Отказ=Истина;
					 #КонецЕсли 
				 КонецЕсли;
			 КонецЦикла;		  
			 
			 
			 
			 // нечаева для фикс прайса 29,03,24+++ 
			 ДатаНачалаЭДОФиксПрайс = справочники.Контрагенты.НайтиПоКоду("SSR-6999").ДатаНачалаЭСФ;
			 Если ТекущаяДата()> ДатаНачалаЭДОФиксПрайс Тогда
				 
				 СписокФиксПрайс = новый Массив;
				 
				 для каждого ТНакладная из ТЗНакладных цикл	
					 // Кухарь А.Ю.  12.04.2024 начало
					 если ТипЗнч(ТНакладная.накладная)<>Тип("ДокументСсылка.РасходнаяНакладная") и  ТипЗнч(ТНакладная.накладная)<>Тип("ДокументСсылка.ПриходнаяНакладная")   тогда
						 Продолжить;
					 КонецЕсли;
					 // Кухарь А.Ю.  12.04.2024 конец
					 
					 контрагентТ = ТНакладная.Накладная.контрагент;
					 Накл = ТНакладная.Накладная.ссылка; 
					 Если  контрагентТ.код = "SSR-6999"  Тогда
						 
						 ФиоВодителяСфера1 = ПолучитьРеквизитРНКПНКПРМ(Накл,"ФиоВодителяСфера");
						 МаркаМашиныСфера1 = ПолучитьРеквизитРНКПНКПРМ(Накл,"МаркаМашиныСфера");
						 НомерМашиныСфера1 = ПолучитьРеквизитРНКПНКПРМ(Накл,"НомерМашиныСфера");
						 ТелефонВодителяСФера1 = ПолучитьРеквизитРНКПНКПРМ(Накл,"ТелефонВодителяСФера");
						 
						 Если НЕ( ФиоВодителяСфера1<>неопределено и МаркаМашиныСфера1<>неопределено 
							 и НомерМашиныСфера1<>неопределено и ТелефонВодителяСФера1<>неопределено) Тогда
							 
							 СписокФиксПрайс.добавить(ТНакладная.Накладная);
						 КонецЕсли;
						 
					 КонецЕсли; 
					 // Нечаева 19,01,26 - без задачи, ольше не нужно, обрабатывается в другом месте
					 //Попытка 					 
					 //    Если СписокФиксПрайс.количество()>0 Тогда
					 //   	 СообщитьМенеджеруБэст("Отсутствуют данные по водителям. Бэст Прайс");
					 //    КонецЕсли;
					 //исключение
					 //конецПопытки;
					 //
				 КонецЦикла;		 
			 КонецЕсли;
			 //нечаева 29,03,24-- 
			 
			 
			 
			 
			 для каждого ТНакладная из ТЗНакладных цикл	
				 // Кухарь А.Ю. 06.04.2021 начало
				 если ТНакладная.СостояниеНакладной= Перечисления.СостоянияНакладной.Отгружена тогда Продолжить;КонецЕсли;				 
				 // Кухарь А.Ю. 06.04.2021 конец
				 
				 // Кухарь А.Ю. 24.12.2021 начало
				 // ТНакладная.СостояниеНакладной= Перечисления.СостоянияНакладной.Отгружена
				 если ТНакладная.СостояниеНакладной<> Перечисления.СостоянияНакладной.ГотоваКОтгрузке и ОтгружатьНеполныеНакладные тогда
					 Продолжить;
				 КонецЕсли;
				 // Кухарь А.Ю. 24.12.2021 конец
				 
				 
				 ОбНакладная=ТНакладная.Накладная.ПолучитьОбъект();
				 //кухарь 24.03.15 начало     //ytxftdf нечаева 27,03
				 если ОбНакладная<>Неопределено и НЕ ОБНакладная.метаданные().Имя = "ЗаявкаВТранспортныйОтдел" и ОбНакладная.СостояниеНакладной<>Перечисления.СостоянияНакладной.Отгружена тогда
					 // Кухарь А.Ю. 02.03.2021 начало
					 // Переделал проверки в ПроверитьОстаткиТоваров() и  ПроверитьСФ()
					 ////Кухарь 02.04.17 начало
					 ////Скопируем проверки из формы РНК
					 //МожноОтгружать=ПроверитьЧтоМожноОтгружать(ТНакладная.Накладная);
					 //если не МожноОтгружать тогда
					 //    Сообщить("Накладная "+ТНакладная.Накладная.номер+ " не отгружена. Нужно её отгрузить отдельно.");
					 //КонецЕсли;
					 ////Кухарь 02.04.17 конец
					 
					 // Кухарь А.Ю. 02.03.2021 конец
					 
					 
					 
					 //Кухарь 21.11.18 начало
					 //исправление ошибки
					 //				 
					 //ОбНакладная.дата=ТекущаяДата();
					 
					 //+++Чирков 26.08.2025 - отложенное проведение РНК
					 РеквизитыНовые = Новый Структура("Отгружен",Перечисления.Отгружен.Отгружен);
					 //---Чирков 26.08.2025 - отложенное проведение РНК
					 
					 // Кухарь А.Ю. 27.01.2020 начало
					 
					 //Иногда на дату отгрузки нет остатков, а на дату накладной (+ пара часов от даты отгрузки) - есть.
					// ОбНакладная.дата=ОбНакладная.ДатаОтгрузки;	
					если НачалоДня(ОбНакладная.дата)<>НачалоДня(ОбНакладная.ДатаОтгрузки) тогда
						 ОбНакладная.дата=ОбНакладная.ДатаОтгрузки;	   
						 //+++Чирков 26.08.2025 - отложенное проведение РНК
						 РеквизитыНовые.Вставить("Дата", ОбНакладная.ДатаОтгрузки);
						 //---Чирков 26.08.2025 - отложенное проведение РНК
					КонецЕсли;
					// Кухарь А.Ю. 27.01.2020 конец
					 
					 //+++Чирков 26.08.2025 - отложенное проведение РНК
					 ПисатьОтложенно = Ложь;
					 Если ТипЗнч(ОбНакладная) = Тип("ДокументСсылка.РасходнаяНакладная") тогда						
						 ПисатьОтложенно	= ОбщегоНазначения_ПИ.ПолучитьЗначениеРСРеквизитыСправочников(ОбНакладная.Контрагент, "ОбрабатыватьПаллетыОтложенно", Ложь); 	
					 КонецЕсли;
					 Если ПисатьОтложенно тогда						 
						 ДопПараметры = Новый Структура("РеквизитыНовые", РеквизитыНовые);
						 РегистрыСведений.ЗаданиеНаСменуСтатусовНакладной.СоздатьЗаданиеНаСменуСтатуса(ОбНакладная.Ссылка, Перечисления.СостоянияНакладной.Отгружена, ДопПараметры);
					 Иначе                     
					//---Чирков 26.08.2025 - отложенное проведение РНК						 
						 
						 //Кухарь 21.11.18 конец
						 ОбНакладная.СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена;
						 
						 ОбНакладная.Отгружен=Перечисления.Отгружен.Отгружен;
						 
						 // Кухарь А.Ю. 02.03.2021 начало
						 //Оптимизация
						 //	ОбНакладная.записать(РежимЗаписиДокумента.Проведение);		
						 ОбНакладная.ОбменДанными.Загрузка=истина; 
						 ОбНакладная.проведен=Истина; 
						 ОбНакладная.Записать();   
						 ОбНакладная.ОбработкаПроведения(ложь,РежимПроведенияДокумента.Неоперативный); 			 
						 // Кухарь А.Ю. 02.03.2021 конец			
					//+++Чирков 26.08.2025 - отложенное проведение РНК
					 КонецЕсли;			                              
					 //---Чирков 26.08.2025 - отложенное проведение РНК
					 
				 КонецЕсли;
				 //кухарь 24.03.15 конец
			 КонецЦикла;
			 
			 // Кухарь А.Ю. 02.03.2021 начало
			 //Чтобы база не висела
			 ПараметрыСеанса.ЗапущенаОбработка=Ложь;		 
			 ПараметрыСеанса.ОтключитьЖурнализациюЗаписи=ложь;
			 ПараметрыСеанса.ВыполнятьЗамерыПроизводительности=Истина;		 
			 // Кухарь А.Ю. 02.03.2021 конец  	 
			 
		 иначе
			 если ВсеПолные и ЛистыНабора.Количество()<>0 тогда
				 СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке;
			 ИначеЕсли ЛистыНабора.Количество()>0 Тогда
				 СостояниеНакладной=Перечисления.СостоянияНакладной.Сканирование;
			 КонецЕсли;
		 КонецЕсли;	
	 КонецЕсли;
	 //Кухарь 26.12.16 начало
	 //Уже обновлено при печати
	 //ЗаписатьКоличествоКоробовЗаявку();
	 //Кухарь 26.12.16 конец
	 
	 
	 если РазрешитьИзменениеМаршурта или РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения  тогда
		 //Кухарь 24.09.17 начало
		 //Контроль количества паллет
		 КоличествоПаллет=0;
		 //Кухарь 24.09.17 конец
		 если не ПолучитьПолномочиеПользователя("РазблокироватьМаршрут") тогда
			 Сообщить("Недостаточно прав на разблокирование маршрута");
			 Отказ=Истина;
		 иначе		 
			 РазблокироватьМарщрут();
			 Заявка.Очистить();
			 ТЗЛистыНабора=ЛистыНабора.Выгрузить();
			 ЛистыНабора.Очистить();
			 
			 
			 //Тимофеев Ю.А. начало 08.08.2023
			 //пометим на удаление вы документы ПНК на паллеты
			 //очистим табличную часть
			 Для Каждого УдВозврПаллет из ВозвратПаллет Цикл
				 НужныйПНК = УдВозврПаллет.ПНК.ПолучитьОбъект();
				 НужныйПНК.УстановитьПометкуУдаления(Истина);				 
			 КонецЦикла;
			 ВозвратПаллет.Очистить();			 
			 //Тимофеев Ю.А. конец 08.08.2023
			 
		 КонецЕсли;
	 КонецЕсли;
	 
	 //кухарь 15.03.15 начало
	 //обработку разрешения маршрута нужно после проведения делать. ПЗХ не правильный получается
	 //если РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения тогда
	 //	если не ПолучитьПолномочиеПользователя("РазблокироватьМаршрут") тогда
	 //   	 Сообщить("Недостаточно прав на разблокирование маршрута");
	 //   	 Отказ=Истина;
	 //	КонецЕсли;
	 //	РазрешитьИзменениеМаршурта=Истина;
	 //ИначеЕсли РазрешитьИзменениеМаршурта тогда
	 //	ОбработкаРазрешенияИзмененияМаршрута();
	 //КонецЕсли;
	 //кухарь 15.03.15 конец   
	 
 КонецПроцедуры
 
 
 ////////////////////////// //Тимофеев Ю.А. 08.08.2023
 //Модуль "ВОЗВРАТ ПАЛЛЕТ после сдачи постаки
 //При записи ЛЗ в состоянии «ожидание сканирования», 
 //нужно смотреть нет ли в ТЧ Накладные от этого листа загрузки 
 //Расходных накладных (РНК) с пунктом доставки, 
 //имеющих признак «требуется забирать паллеты после сдачи поставки». 
 
 Процедура ЗаполнитьПаллетыКВозвратуПоНакладным()
	 
	 //Выгрузим данные по ПНК если уже не в первый раз заполняем
	 ВрТБВозвратПаллет=ВозвратПаллет.Выгрузить();
	 ВозвратПаллет.Очистить();
	 //Выгрузим данные по ПНК если уже не в первый раз заполняем
	 
	 
	 РезультатВыгрузкиРНК = ПолучимВсеНакладныеРНКПоДокументу();  
	 
	 Если РезультатВыгрузкиРНК.Количество()=0 Тогда
		 Возврат;
	 КонецЕсли;
	 
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	 |	НужныеПункты.ПунктДоставки КАК ПунктДоставки
	 |ПОМЕСТИТЬ ЗабиратьПаллеты
	 |ИЗ
	 |	(ВЫБРАТЬ
	 |		ЛистЗагрузкиЗаявка.ПунктДоставки КАК ПунктДоставки
	 |	ИЗ
	 |		Документ.ЛистЗагрузки.Заявка КАК ЛистЗагрузкиЗаявка
	 |	ГДЕ
	 |		ЛистЗагрузкиЗаявка.Ссылка = &Ссылка
	 |	
	 |	СГРУППИРОВАТЬ ПО
	 |		ЛистЗагрузкиЗаявка.ПунктДоставки) КАК НужныеПункты
	 |ГДЕ
	 |	НужныеПункты.ПунктДоставки.ТребуетсяЗабиратьПалетты
	 |
	 |ИНДЕКСИРОВАТЬ ПО
	 |	ПунктДоставки
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ЛистЗагрузкиЗаявка.ПунктДоставки КАК ПунктДоставки,
	 |	ЛистЗагрузкиЗаявка.НомерНакладной КАК НомерНакладной,
	 |	ЛистЗагрузкиЗаявка.ДатаНакладной КАК ДатаНакладной
	 |ИЗ
	 |	Документ.ЛистЗагрузки.Заявка КАК ЛистЗагрузкиЗаявка
	 |ГДЕ
	 |	ЛистЗагрузкиЗаявка.ВидНакладной = &ВидНакладной
	 |	И ЛистЗагрузкиЗаявка.ПунктДоставки В
	 |			(ВЫБРАТЬ
	 |				ЗабиратьПаллеты.ПунктДоставки КАК ПунктДоставки
	 |			ИЗ
	 |				ЗабиратьПаллеты КАК ЗабиратьПаллеты)
	 |	И ЛистЗагрузкиЗаявка.Ссылка = &Ссылка
	 |ИТОГИ ПО
	 |	ПунктДоставки";
	 //Параметры запроса
	 Запрос.УстановитьПараметр("ВидНакладной","РНК");// Строка
	 Запрос.УстановитьПараметр("Ссылка",Ссылка);// Лист загрузки
	 Результат = Запрос.Выполнить();
	 
	 
	 //Получаем выборку в разрезе Пункт доставки - Накладные 	
	 Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 	
	 //Найдем номенклатуру ПАЛЛЕТЫ по коду
	 ТоварПаллеты = Справочники.Номенклатура.НайтиПоКоду("ODB-000325");     
	 
	 Пока Выборка.Следующий() Цикл
		 
		 ТекПунктДоставки=Выборка.ПунктДоставки;
		 
		 ВыборкаНакладныхПоПункту = Выборка.Выбрать();
		 //счетчик паллет по каждому пункту доставки
		 КолвоПаллетПоПункту      = 0; 		
		 //сохраним одну из , что заполнить на основании ее параметры ПНК
		 ТекущаяРНК               = Документы.РасходнаяНакладная.ПустаяСсылка();
		 
		 Пока ВыборкаНакладныхПоПункту.Следующий() Цикл			
			 //вернем КоличествоПаллет по  накладной РНК по номеру и дате , так как прямой ссылки нет
			 
			 СтруктураРНК =РезультатВыгрузкиРНК.Найти(ВыборкаНакладныхПоПункту.НомерНакладной,"НомерНакладной");
			 
			 //неопределено или структрура 			
			 Если СтруктураРНК<>Неопределено Тогда 						
				 КолвоПаллетПоПункту = КолвоПаллетПоПункту+СтруктураРНК.КоличествоПаллет;
				 ТекущаяРНК          = СтруктураРНК.Накладная;
			 Иначе
				 //по идеи сюда не должно попасть  найдем отдельным запросом
				 СтруктураРНК=ВернутьКоличествоПаллетИСсылкуРНК(ВыборкаНакладныхПоПункту.НомерНакладной,ВыборкаНакладныхПоПункту.ДатаНакладной);
				 Если СтруктураРНК<>Неопределено Тогда 						
					 КолвоПаллетПоПункту = КолвоПаллетПоПункту+СтруктураРНК.КоличествоПаллет;
					 ТекущаяРНК          = СтруктураРНК.Накладная;
				 КонецЕсли; 				
			 КонецЕсли;    			
		 КонецЦикла;  
		 
		 
		 //поиск накладной
		 
		 УжеЕстьНакладная = ВрТБВозвратПаллет.Найти(ТекПунктДоставки,"ПунктДоставки");
		 
		 НовПНК=Неопределено;
		 
		 Если УжеЕстьНакладная<>Неопределено Тогда			
			 Если ЗначениеЗаполнено(УжеЕстьНакладная.ПНК) Тогда
				 НовПНК=	УжеЕстьНакладная.ПНК.ПолучитьОбъект();
				 
				 //снимем пометку удаления , если документ был помечен на удаление
				 Если НовПНК.ПометкаУдаления Тогда			
					 НовПНК.УстановитьПометкуУдаления(Ложь);
				 КонецЕсли;
				 //снимем пометку удаления   
			 КонецЕсли;
		 КонецЕсли;   		
		 
		 Если КолвоПаллетПоПункту>0 Тогда //тогда,нужно создать ПНК
			 
			 
			 Если НовПНК=Неопределено Тогда 						  				
				 НовПНК=Документы.ПриходнаяНакладная.СоздатьДокумент(); 								
				 НовПНК.Дата       = ТекущаяДата();
				 НовПНК.Комментарий= "Расчетное количество паллет: "+Формат(КолвоПаллетПоПункту,"ЧЦ=10; ЧДЦ=4; ЧГ=");				
				 
				 //стандартные процедуры создание документа
				 ЗаполнитьШапкуДокумента(НовПНК, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "");					
				 // +++ {Кузнецов Сергей Владимирович [10.01.2024]
				 //УстановитьНомерДокумента(НовПНК);  
				 #Если Клиент Тогда
					 УстановитьНомерДокумента(НовПНК);  
				 #Иначе
					 ПрефиксИБ=ПараметрыСеанса.ЭтотУзел.Код;
					 КодИБ=?(ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение,ПрефиксИБ,ПараметрыСеанса.ЭтотУзел.Код);			
					 Если ПрефиксИБ = "EKT" Тогда
						 КодИБ = ПрефиксИБ;	
						 ПрефиксИБ = "SST";
					 КонецЕсли; 
					 УстановитьНовыйНомер(КодИБ+"-");
				 #КонецЕсли
				 // }Кузнецов Сергей Владимирович +++ [10.01.2024]
				 //стандартные процедуры создание документа
				 
				 НовПНК.СостояниеНакладной      = Перечисления.СостоянияНакладной.Принята; 			
				 НовПНК.ПунктДоставки           = ТекПунктДоставки;
				 НовПНК.КодОперации             = Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя;
				 НовПНК.Склад                   = ТекущаяРНК.Склад;
				 НовПНК.Контрагент              = ТекущаяРНК.Контрагент;
				 НовПНК.ДатаОтгрузки            = ТекущаяРНК.ДатаОтгрузки;
				 НовПНК.Договор                 = ТекущаяРНК.Договор;
				 НовПНК.Менеджер                = ТекущаяРНК.Менеджер;
				 НовПНК.Подразделение           = ТекущаяРНК.Подразделение;
				 НовПНК.ТипДоставки             = ТекПунктДоставки.ТипДоставки;  
				 
			 КонецЕсли;  			 
			 
			 //очистим табличную часть
			 НовПНК.Товары.Очистить();
			 
			 НовСтрокаТовары                = НовПНК.Товары.Добавить();
			 НовСтрокаТовары.Номенклатура   = ТоварПаллеты;	
			 НовСтрокаТовары.Единица        = ТоварПаллеты.ОсновнаяЕдиница;
			 КолвоПаллет                    = Окр(КолвоПаллетПоПункту,0,РежимОкругления.Окр15как20);
			 КолвоПаллет                    = ?(КолвоПаллет=0,1,КолвоПаллет);  //лучше пусть будет больше
			 
			 НовСтрокаТовары.Количество               = КолвоПаллет; 
			 НовСтрокаТовары.Заявка                   = КолвоПаллет;
			 НовСтрокаТовары.ПодтвержденнаяЗаявка     = КолвоПаллет;
			 
			 //стандартные процедура заполнения строки табличной части
			 ПриИзмененииНоменклатурыТабЧасти(НовСтрокаТовары, НовПНК);
			 РассчитатьСуммуТабЧасти(НовСтрокаТовары,          НовПНК);
			 //стандартные процедура заполнения строки табличной части
			 
			 //по аналогии проведения			
			 НовПНК.ОбменДанными.Загрузка=истина;
			 НовПНК.Проведен=Истина; 
			 НовПНК.Записать();   
			 НовПНК.ОбработкаПроведения(ложь,РежимПроведенияДокумента.Неоперативный); 
			 //по аналогии проведения
			 
			 НовСтрПНК                  = ВозвратПаллет.Добавить();
			 НовСтрПНК.ПунктДоставки    = ТекПунктДоставки;
			 НовСтрПНК.ВидНакладной     = "ПНК";
			 НовСтрПНК.ПНК              = НовПНК.Ссылка;     //вопрос нужно ли добавлять ссылку, потом удалять будет обработкой
			 НовСтрПНК.НомерНакладной   = НовПНК.Номер;
			 НовСтрПНК.ДатаНакладной    = НовПНК.Дата;
			 НовСтрПНК.КоличествоПаллет = КолвоПаллет;
		 Иначе
			 Если НовПНК<>Неопределено Тогда
				 //пометим на удаление
				 НовПНК.УстановитьПометкуУдаления(Истина);
				 //удалим из временной таблицы
				 ВрТБВозвратПаллет.Удалить(УжеЕстьНакладная);
			 КонецЕсли;			
		 КонецЕсли;   		
		 
	 КонецЦикла;   	
	 
	 //пометим на удаление оставшиеся без присмотра ПНК  	
	 Для Каждого УдВозврПаллет из ВрТБВозвратПаллет Цикл
		 Если ЗначениеЗаполнено(УдВозврПаллет.ПНК) Тогда			
			 НовПНК=УдВозврПаллет.ПНК.ПолучитьОбъект();
			 НовПНК.УстановитьПометкуУдаления(Истина);
		 КонецЕсли;
	 КонецЦикла;
	 ВрТБВозвратПаллет=Неопределено;
	 
 КонецПроцедуры  
 
 Функция ПолучимВсеНакладныеРНКПоДокументу()
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	 |	ВложенныйЗапрос.Накладная КАК Накладная,
	 |	ВложенныйЗапрос.НомерНакладной КАК НомерНакладной,
	 |	ВложенныйЗапрос.Получатель КАК Получатель,
	 |	ВложенныйЗапрос.КоличествоПаллет КАК КоличествоПаллет
	 |ИЗ
	 |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |		ЗаявкаНаОтгрузкуНакладные.Накладная КАК Накладная,
	 |		ЗаявкаНаОтгрузкуНакладные.НомерНакладной КАК НомерНакладной,
	 |		ЗаявкаНаОтгрузкуНакладные.Получатель КАК Получатель,
	 |		ВЫБОР
	 |			КОГДА ЗаявкаНаОтгрузкуНакладные.Накладная ССЫЛКА Документ.РасходнаяНакладная
	 |				ТОГДА ЗаявкаНаОтгрузкуНакладные.Накладная.КоличествоПаллет
	 |			ИНАЧЕ 0
	 |		КОНЕЦ КАК КоличествоПаллет
	 |	ИЗ
	 |		Документ.ЗаявкаНаОтгрузку.Накладные КАК ЗаявкаНаОтгрузкуНакладные
	 |	ГДЕ
	 |		ЗаявкаНаОтгрузкуНакладные.Автомобиль = &Автомобиль
	 |		И ЗаявкаНаОтгрузкуНакладные.ВидНакладной = ""РНК""
	 |		И НЕ ЗаявкаНаОтгрузкуНакладные.НеОтгружать
	 |		И ЗаявкаНаОтгрузкуНакладные.Ссылка.ДатаОтгрузки = &ДатаОтгрузки
	 |		И ЗаявкаНаОтгрузкуНакладные.НомерХодки = &НомерХодки) КАК ВложенныйЗапрос
	 |ГДЕ
	 |	ВложенныйЗапрос.КоличествоПаллет > 0";
	 
	 //Параметры запроса
	 Запрос.УстановитьПараметр("Автомобиль"  ,Ссылка.Автомобиль);// Автомобили
	 Запрос.УстановитьПараметр("ДатаОтгрузки",Ссылка.ДатаОтгрузки);// Дата
	 Запрос.УстановитьПараметр("НомерХодки"  ,Ссылка.НомерХодки);// Число
	 РезультатВыгрузкиРНК = Запрос.Выполнить().Выгрузить();
	 
	 Возврат  РезультатВыгрузкиРНК;
	 
 КонецФункции
 
 
 //вернет ссылку по номеру и дате на РНК 
 Функция ВернутьКоличествоПаллетИСсылкуРНК(НОМЕРДОК,ДатаДок)
	 
	 
	 //НужныйРНК=Документы.РасходнаяНакладная.НайтиПоНомеру(НОМЕРДОК,ДатаДок);
	 //
	 //Если НужныйРНК=Неопределено Тогда
	 //	Возврат Неопределено;
	 //Иначе
	 //	СтрРНК          = Новый Структура;
	 //	СтрРНК.Вставить("Ссылка",          НужныйРНК.Ссылка) ;
	 //	СтрРНК.Вставить("КоличествоПаллет",НужныйРНК.КоличествоПаллет);
	 //	
	 //	Возврат СтрРНК;
	 
	 //КонецЕсли;
	 
	 //264 вызова 18,27 сек и 82%
	 
	 //08.08.2023 18:07:27
	 //08.08.2023 18:07:49
	 
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	 |	РасходнаяНакладная.Ссылка КАК Ссылка,
	 |	РасходнаяНакладная.КоличествоПаллет КАК КоличествоПаллет
	 |ИЗ
	 |	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	 |ГДЕ
	 |	РасходнаяНакладная.Номер = &Номер
	 |	И РасходнаяНакладная.Дата МЕЖДУ &НачДата И &КонДата
	 |	И РасходнаяНакладная.КоличествоПаллет > 0";
	 //Параметры запроса
	 Запрос.УстановитьПараметр("НачДата",НачалоДня(ДатаДок));// Дата
	 Запрос.УстановитьПараметр("КонДата",КонецДня(ДатаДок)); // Дата
	 
	 Запрос.УстановитьПараметр("Номер",НОМЕРДОК);// Строка
	 Результат = Запрос.Выполнить().Выбрать();  	
	 
	 Если Результат.Следующий() Тогда 
		 
		 СтрРНК          = Новый Структура;
		 СтрРНК.Вставить("Ссылка",          Результат.Ссылка) ;
		 СтрРНК.Вставить("КоличествоПаллет",Результат.КоличествоПаллет);
		 
		 Возврат СтрРНК;
	 Иначе
		 Возврат Неопределено;
	 КонецЕсли;	
	 
	 //264 вызова 2,79 сек и 52%
	 //08.08.2023 17:59:30
	 //08.08.2023 17:59:35   
	 
	 
	 
 КонецФункции 
 
 
 //Модуль "ВОЗВРАТ ПАЛЛЕТ после сдачи постаки 
 ///////////////////////// //Тимофеев Ю.А. 08.08.2023
 
 
 Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	 //++Ратманов управляемые блокировки
	 Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		 Отказ = Истина;
		 Возврат;
	 КонецЕсли;	
	 Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		 Отказ = Истина;
		 Возврат;
	 КонецЕсли;	
	 //--Ратманов управляемые блокировки
	 СписокШК=ЛистыНабора.ВыгрузитьКолонку("ШККоробки");
	 
	 Запрос=новый запрос; 
	 Запрос.Текст="ВЫБРАТЬ
	 |	ОстаткиЗХОстатки.ШККоробки КАК ШККоробки,
	 |	ОстаткиЗХОстатки.ЗонаХранения КАК ЗонаХранения,
	 |	ОстаткиЗХОстатки.КоличествоКоробокОстаток КАК Количество,
	 |	ОстаткиЗХОстатки.ШКПаллеты
	 |ИЗ
	 |	РегистрНакопления.ОстаткиЗХ.Остатки(&Дата, ШККоробки В (&Шк)) КАК ОстаткиЗХОстатки
	 |ГДЕ
	 |	ОстаткиЗХОстатки.КоличествоКоробокОстаток > 0";				 
	 Запрос.УстановитьПараметр("ШК",СписокШК);	
	 Запрос.УстановитьПараметр("Дата",Дата);
	 ЕстьНаОстатках=запрос.Выполнить().Выгрузить();
	 
	 Для каждого ТекСтрока из ЕстьНаОстатках цикл
		 Движение = Движения.ОстаткиЗХ.Добавить();
		 ЗаполнитьЗначенияСвойств(движение,ТекСтрока);
		 Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		 Движение.Период = Дата;
		 Движение.ЗонаХранения = ТекСтрока.ЗонаХранения;
		 Движение.КоличествоКоробок = ТекСтрока.Количество;
	 КонецЦикла;
	 если РазрешитьИзменениеМаршурта тогда
		 ОбработкаРазрешенияИзмененияМаршрута();
	 КонецЕсли;
	 если ТребуетсяЗамерВремени тогда
		 ВсегоНакладных=Заявка.Количество();
		 Запись=РегистрыСведений.ЗамерПроизводительности.СоздатьМенеджерЗаписи();
		 запись.ВидДокумента=Метаданные().Имя;
		 запись.ДатаЗамера=ДатаНачалаЗамера;
		 запись.НомерДокумента=Номер;
		 запись.ИмяКомпьютера= ИмяКомпьютера();
		 запись.ВремяПроведения =  ТекущаяДата()-ДатаНачалаЗамера;
		 запись.Пользователь=ПараметрыСеанса.Пользователь; 	
		 запись.КоличествоСтрок = ВсегоНакладных;
		 запись.Записать();
	 КонецЕсли;
 КонецПроцедуры
 
 Процедура ОбработкаУдаленияПроведения(Отказ)
	 ОбработкаРазрешенияИзмененияМаршрута();
 КонецПроцедуры
 
 
 
 функция ПроверкаЧтоВсеНакладныеВРГ() Экспорт 
	 запрос=новый запрос;	 
	 запрос.Текст= "ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |	ЗаявкаНаОтгрузкуНакладные.Накладная КАК Накладная,
	 |	ЗаявкаНаОтгрузкуНакладные.НомерНакладной КАК НомерНакладной,
	 // Кухарь А.Ю.  27.09.2022 начало
	 //Слишком долго в ЗОГе обновляется
	 // |	ЗаявкаНаОтгрузкуНакладные.СостояниеНакладной КАК СостояниеНакладной,
	 |	ЗаявкаНаОтгрузкуНакладные.Накладная.СостояниеНакладной КАК СостояниеНакладной,				   
	 // Кухарь А.Ю.  27.09.2022 конец
	 
	 |	ЗаявкаНаОтгрузкуНакладные.Ссылка.Склад КАК Склад
	 |ИЗ
	 |	Документ.ЗаявкаНаОтгрузку.Накладные КАК ЗаявкаНаОтгрузкуНакладные
	 |ГДЕ
	 |	ЗаявкаНаОтгрузкуНакладные.Автомобиль = &Автомобиль
	 |	И ЗаявкаНаОтгрузкуНакладные.ВидНакладной <> ""ПНК""
	 |	И ЗаявкаНаОтгрузкуНакладные.ВидНакладной <> ""ЗТО""
	 |	И ЗаявкаНаОтгрузкуНакладные.НеОтгружать = ЛОЖЬ
	 |	И ЗаявкаНаОтгрузкуНакладные.Ссылка.ДатаОтгрузки = &ДатаОтгрузки
	 // Кухарь А.Ю.  29.08.2022 начало
	 // всё перенёс в 1 параметр 
	 //|	И ЗаявкаНаОтгрузкуНакладные.Накладная.СостояниеНакладной <> &ГотоваКОтгрузке
	 //|	И ЗаявкаНаОтгрузкуНакладные.Накладная.СостояниеНакладной <> &Отгружена
	 // 
	 // Кухарь А.Ю.  27.09.2022 начало
	 //Слишком долго в ЗОГе обновляется
	 // |	И не ЗаявкаНаОтгрузкуНакладные.СостояниеНакладной В(&СписокНенужныхСостояний)
	 |	И не ЗаявкаНаОтгрузкуНакладные.Накладная.СостояниеНакладной В(&СписокНенужныхСостояний)
	 // Кухарь А.Ю.  27.09.2022 конец
	 
	 
	 // Кухарь А.Ю.  29.08.2022 конец
	 
	 |	И ЗаявкаНаОтгрузкуНакладные.НомерХодки = &НомерХодки";
	 запрос.УстановитьПараметр("Автомобиль",Автомобиль);
	 запрос.УстановитьПараметр("ДатаОтгрузки",ДатаОтгрузки);
	 
	 //Кухарь 18.04.16 начало 
	 
	 // Кухарь А.Ю.  29.08.2022 начало
	 // всё перенёс в 1 параметр + добавил состояние отменена    
	 //запрос.УстановитьПараметр("ГотоваКОтгрузке",Перечисления.СостоянияНакладной.ГотоваКОтгрузке);
	 //запрос.УстановитьПараметр("Отгружена",Перечисления.СостоянияНакладной.Отгружена);
	 //
	 СписокНенужныхСостояний=новый СписокЗначений;
	 СписокНенужныхСостояний.Добавить(Перечисления.СостоянияНакладной.ГотоваКОтгрузке);
	 СписокНенужныхСостояний.Добавить(Перечисления.СостоянияНакладной.Отгружена);
	 СписокНенужныхСостояний.Добавить(Перечисления.СостоянияНакладной.Отменена);
	 запрос.УстановитьПараметр("СписокНенужныхСостояний",СписокНенужныхСостояний);
	 
	 // Кухарь А.Ю.  29.08.2022 конец
	 
	 
	 //Несколько ходок
	 запрос.УстановитьПараметр("НомерХодки",НомерХодки);
	 //Кухарь 18.04.16 конец
	 
	 результат=запрос.Выполнить().Выбрать();
	 ВсеРГ=Истина;
	 // Кухарь А.Ю. 24.12.2021 начало
	 // В этом случае можно не проверять
	 если ОтгружатьНеполныеНакладные тогда
		 возврат Истина
	 КонецЕсли;
	 // Кухарь А.Ю. 24.12.2021 конец
	 
	 пока результат.Следующий() цикл
		 //Кухарь 29.03.15 начало
		 //если результат.накладная.склад=Справочники.Склады.ПустаяСсылка() тогда
		 // Кухарь А.Ю. 19.03.2021 начало
		 //Оптимизация
		 // если результат.накладная.склад=Справочники.Склады.ПустаяСсылка() или результат.СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена тогда
		 если результат.склад=Справочники.Склады.ПустаяСсылка() или результат.СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена тогда			  
			 // Кухарь А.Ю. 19.03.2021 конец
			 
			 //Кухарь 29.03.15 конец	
			 Продолжить; //накладные которых нет в базе считаем пока что они уже точно полностью собраны.
		 иначе
			 #Если Клиент Тогда
				 Сообщить("Накладная находится в состоянии отличном от Готова к отгрузке - "+результат.Накладная.номер);	
			 #КонецЕсли
		 КонецЕсли;
		 ВсеРГ=Ложь;
	 КонецЦикла;
	 Возврат ВсеРГ;
	 
 КонецФункции
 
 функция ПроверкаЧтоВсеНакладныеПолностью() экспорт
	 //Кухарь  18.11.2022 начало
	 ЭтотУзел=ПараметрыСеанса.ЭтотУзел.Код; 
	 //Кухарь  18.11.2022 конец
	 
	 запрос=новый запрос;	 
	 запрос.Текст= "ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |	ЗаявкаНаОтгрузкуНакладные.Накладная КАК Накладная,
	 |	ЗаявкаНаОтгрузкуНакладные.Накладная.КоличествоКоробок КАК КоробаИзНакладной,
	 |	ЗаявкаНаОтгрузкуНакладные.Накладная.СостояниеНакладной КАК СостояниеНакладной,
	 |	ЗаявкаНаОтгрузкуНакладные.НомерНакладной КАК НомерНакладной,
	 |	ЗаявкаНаОтгрузкуНакладные.КоличествоКоробок КАК КоробаИзЗог,
	 |	ЗаявкаНаОтгрузкуНакладные.ВидНакладной КАК ВидНакладной,
	 |	ВЫБОР
	 |		КОГДА ЗаявкаНаОтгрузкуНакладные.Накладная ССЫЛКА Документ.РасходнаяНакладная
	 |			ТОГДА ВЫРАЗИТЬ(ЗаявкаНаОтгрузкуНакладные.Накладная КАК Документ.РасходнаяНакладная).ДатаОтгрузки
	 |		ИНАЧЕ ЗаявкаНаОтгрузкуНакладные.Ссылка.ДатаОтгрузки
	 |	КОНЕЦ КАК ДатаОтгрузки,
	 |	ЗаявкаНаОтгрузкуНакладные.Получатель КАК Получатель
	 |ИЗ
	 |	Документ.ЗаявкаНаОтгрузку.Накладные КАК ЗаявкаНаОтгрузкуНакладные
	 |ГДЕ
	 |	ЗаявкаНаОтгрузкуНакладные.Автомобиль = &Автомобиль
	 |	И ЗаявкаНаОтгрузкуНакладные.ВидНакладной <> ""ПНК""
	 |	И ЗаявкаНаОтгрузкуНакладные.Распределена
	 |	И ЗаявкаНаОтгрузкуНакладные.НеОтгружать = ЛОЖЬ
	 |	И ЗаявкаНаОтгрузкуНакладные.Ссылка.ДатаОтгрузки = &ДатаОтгрузки
	 |	И ЗаявкаНаОтгрузкуНакладные.НомерХодки = &НомерХодки";
	 запрос.УстановитьПараметр("Автомобиль",Автомобиль);
	 запрос.УстановитьПараметр("ДатаОтгрузки",ДатаОтгрузки);
	 //Кухарь 18.04.16 начало 
	 //Несколько ходок
	 запрос.УстановитьПараметр("НомерХодки",НомерХодки);
	 //Кухарь 18.04.16 конец
	 ТЗНакладных=запрос.Выполнить().выгрузить();
	 
	 ВсеПолные=Истина;
	 для каждого результат из ТЗНакладных цикл
		 если результат.ВидНакладной="ЗТО" тогда Продолжить; КонецЕсли;
		 
		 // Кухарь А.Ю.  18.11.2022 начало
		 // нужно убрать входящие документы
		 если ТипЗнч(результат.получатель) = тип("СправочникСсылка.Склады") тогда
			 если результат.получатель.кодФизическогоУзла=ЭтотУзел тогда
				 // Кухарь А.Ю.  25.01.2024 начало
				 //
				 если результат.получатель.Типсклада <> Перечисления.ТипСклада.ПалетноеХранение тогда
					 // Кухарь А.Ю.  25.01.2024 конец
					 
					 Продолжить;;
					 // Кухарь А.Ю.  25.01.2024 начало
					 //
				 КонецЕсли; 
				 // Кухарь А.Ю.  25.01.2024 конец
				 
			 КонецЕсли;
		 КонецЕсли;
		 // Кухарь А.Ю.  18.11.2022 конец
		 
		 Отбор=новый Структура;
		 //Кухарь 21.06.16 начало
		 Отбор.Вставить("ВидНакладной",результат.ВидНакладной);
		 Отбор.Вставить("НомерНакладной",результат.НомерНакладной);
		 //отбор.Вставить("Накладная",результат.накладная);
		 //Кухарь 21.06.16 
		 СписокКоробок=ЛистыНабора.НайтиСтроки(Отбор);
		 если результат.накладная.склад=Справочники.Склады.ПустаяСсылка() тогда
			 Продолжить; //пока для накладных других складов, ничего не проверяем
			 //кухарь 25.03.15 начало
			 если результат.КоробаИзЗог= 0 и результат.КоробаИзНакладной=0 тогда
				 Продолжить;
			 КонецЕсли;
			 //кухарь 25.03.15 конеце
			 если СписокКоробок.Количество()<>результат.КоробаИзЗог тогда
				 //#Если Клиент Тогда
				 //	Сообщить("Накладная находится в листе загрузки не полностью - "+результат.НомерНакладной+ " В Листе загрузки не хватает "+Строка(результат.КоробаИзЗог-СписокКоробок.Количество())+" коробок");	
				 //#КонецЕсли
				 ВсеПолные=Ложь;
			 КонецЕсли; 
		 иначе 
			 если СписокКоробок.Количество()<>результат.КоробаИзНакладной и результат.КоробаИзНакладной>0 тогда
				 //#Если Клиент Тогда
				 //	Сообщить("Накладная находится в в листе загрузки не полностью - "+результат.Накладная.номер+ " В Листе загрузки не хватает "+Строка(результат.КоробаИзНакладной-СписокКоробок.Количество())+" коробок");	
				 //#КонецЕсли
				 ВсеПолные=Ложь;
			 КонецЕсли;
			 
			 
			 если результат.КоробаИзНакладной=0 тогда
				 если СписокКоробок.Количество()<>результат.КоробаИзЗог тогда
					 //#Если Клиент Тогда
					 //	Сообщить("Накладная находится в листе загрузки не полностью - "+результат.НомерНакладной+ " В Листе загрузки не хватает "+Строка(результат.КоробаИзЗог-СписокКоробок.Количество())+" коробок");	
					 //#КонецЕсли
					 ВсеПолные=Ложь;
				 КонецЕсли; 
				 
			 КонецЕсли;
		 КонецЕсли;
		 
	 КонецЦикла;
	 Возврат ВсеПолные;
	 
 КонецФункции
 
 
 Процедура ЗаписатьКоличествоКоробовЗаявку()
	 //кухарь 24.03.15 начало
	 //после РГ уже ничего перезаполнять не нужно
	 если СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена тогда
		 Возврат;
	 КонецЕсли;
	 //кухарь 24.03.15 конец
	 для каждого результат из ТЗНакладных цикл
		 Отбор=новый Структура;
		 //Кухарь 21.06.16 начало
		 Отбор.Вставить("ВидНакладной",результат.ВидНакладной);
		 Отбор.Вставить("НомерНакладной",результат.НомерНакладной);
		 //отбор.Вставить("Накладная",результат.накладная);
		 //Кухарь 21.06.16 
		 
		 СтрокаЗаявки=Заявка.НайтиСтроки(Отбор);
		 //кухарь 26.03.15 начало
		 если результат.ВидНакладной<>"ЗТО" тогда
			 //кухарь 26.03.15 конец	 
			 если результат.накладная.склад=Справочники.Склады.ПустаяСсылка() тогда
				 для каждого ТекЗаявка из СтрокаЗаявки цикл
					 ТекЗаявка.количествоКоробок=результат.КоробаИзЗОГ;	
				 КонецЦикла;
			 иначе 
				 для каждого ТекЗаявка из СтрокаЗаявки цикл
					 ТекЗаявка.количествоКоробок=результат.КоробаИзНакладной;	
				 КонецЦикла
			 КонецЕсли;
			 //кухарь 26.03.15 начало	 
		 иначе		 
			 для каждого ТекЗаявка из СтрокаЗаявки цикл
				 ТекЗаявка.количествоКоробок=результат.КоробаИзНакладной;	
			 КонецЦикла
		 КонецЕсли;
		 //кухарь 26.03.15 конец
	 КонецЦикла;
	 
	 
 КонецПроцедуры
 
 
 Процедура РазблокироватьМарщрут() 
	 запрос=новый запрос;
	 запрос.текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |	ЗаявкаНаОтгрузкуНакладные.Ссылка КАК ЗОГ,
	 // Кухарь А.Ю. 24.02.2021 начало
	 //
	 //|	ЗаявкаНаОтгрузкуНакладные.НомерНакладной КАК НомерНакладной,
	 //|	ЗаявкаНаОтгрузкуНакладные.ВидНакладной КАК ВидНакладной,
	 // Кухарь А.Ю. 24.02.2021 конец
	 |	ЗаявкаНаОтгрузкуНакладные.Автомобиль КАК Автомобиль,
	 |	ЗаявкаНаОтгрузкуНакладные.НомерХодки КАК НомерХодки
	 
	 
	 |ИЗ
	 |	Документ.ЗаявкаНаОтгрузку.Накладные КАК ЗаявкаНаОтгрузкуНакладные
	 |ГДЕ
	 |	ЗаявкаНаОтгрузкуНакладные.Ссылка.Проведен = ИСТИНА
	 |	И ЗаявкаНаОтгрузкуНакладные.Ссылка.ДатаОтгрузки = &ДатаОтгрузки
	 |	И ЗаявкаНаОтгрузкуНакладные.Автомобиль = &Автомобиль
	 |	И ЗаявкаНаОтгрузкуНакладные.НомерХодки = &НомерХодки
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	ЗОГ";
	 
	 запрос.УстановитьПараметр("ДатаОтгрузки",ДатаОтгрузки);
	 запрос.УстановитьПараметр("Автомобиль",Автомобиль);
	 //Кухарь 18.04.16 начало
	 //Разблокируем теперь не весь маршрут, а только эту ходку.
	 запрос.УстановитьПараметр("НомерХодки",НомерХодки);
	 //Кухарь 18.04.16 конец
	 результат=запрос.Выполнить().Выгрузить();
	 
	 //кухарь 13.04.15 начало 
	 //Для каждого СтрТЗ из ТЗНакладных цикл
	 
	 
	 Для каждого СтрТЗ из результат цикл
		 ЗОГОбъект=СтрТЗ.ЗОГ.получитьобъект();
		 МассСтрока=ЗОГОбъект.Накладные.НайтиСтроки(новый Структура("Автомобиль,НомерХодки",СтрТЗ.Автомобиль,СтрТЗ.НомерХодки));
		 для каждого СтрМасс из МассСтрока цикл
			 СтрМасс.Распределена=ложь; 
		 КонецЦикла; 
		 ЗОГобъект.Записать(РежимЗаписиДокумента.Проведение);
		 
		 // Кухарь А.Ю. 24.02.2021 начало
		 //
		 
		 //Отбор=новый Структура;
		 //Отбор.Вставить("ВидНакладной",СтрТЗ.ВидНакладной);
		 //Отбор.Вставить("НомерНакладной",СтрТЗ.НомерНакладной);
		 //СтрокиЗог=результат.НайтиСтроки(Отбор);
		 //для каждого ТекСтрокаЗог из СтрокиЗог цикл
		 //    ЗОГобъект=ТекСтрокаЗог.ЗОГ.получитьобъект();
		 //    если 1=2 тогда
		 //   	 ЗОГобъект=Документы.ЗаявкаНаОтгрузку.НайтиПоНомеру("").ПолучитьОбъект();
		 //    КонецЕсли;
		 //    ТекСтрокаТЧ=ЗОГобъект.Накладные.НайтиСтроки(Отбор);
		 //    для каждого СтрокаТЧ из ТекСтрокаТЧ цикл
		 //   	 СтрокаТЧ.Распределена=ложь; 
		 //    КонецЦикла;
		 //    ЗОГобъект.Записать(РежимЗаписиДокумента.Проведение);
		 //КонецЦикла;			 
		 
		 
		 // Кухарь А.Ю. 24.02.2021 конец
		 
		 
		 //кухарь 13.04.15 конец
		 
	 КонецЦикла
 КонецПроцедуры
 
 
 Процедура ОбработкаРазрешенияИзмененияМаршрута() экспорт
	 если ТЗЛистыНабора.Количество()>0 тогда
		 ПЗХ=Документы.ПоступлениеВЗонуХранения.СоздатьДокумент();
		 ПЗХ.ЗонаХранения=Справочники.ЗоныХранения.НайтиПоКоду("000000002");
		 пзх.Дата=ТекущаяДата();
		 для каждого СтрЛН из ТЗЛистыНабора цикл
			 если СтрЛН.ВидНакладной="ЗТО" тогда Продолжить;КонецЕсли;
			 СтрТЧ=ПЗХ.Короба.Добавить();
			 ЗаполнитьЗначенияСвойств(СтрТЧ,СтрЛН);
		 КонецЦикла;
		 ПЗХ.Записать(РежимЗаписиДокумента.Проведение);
		 Сообщить("Создано поступление номер "+ПЗХ.Номер+" в служебную зону хранения "+ПЗХ.ЗонаХранения);
		 ТЗЛистыНабора.Очистить();
	 КонецЕсли;
	 
	 
 КонецПроцедуры
 
 
 Функция ПолучитьТЗрасхождений(РазбиватьПоЗХ=ложь)Экспорт 
	 
	 
	 ТЗБезЗх=новый ТаблицаЗначений;
	 ТЗБезЗх.Колонки.Добавить("ВидНакладной");
	 ТЗБезЗх.Колонки.Добавить("НомерНакладной");
	 ТЗБезЗх.Колонки.Добавить("КоличествоКоробок");
	 //кухарь 24,03,15 начало
	 ТЗБезЗх.Колонки.Добавить("НомераКоробок");
	 //кухарь 24,03,15 конец
	 //кухарь 21.03.16 начало
	 ТЗБезЗх.Колонки.Добавить("Накладная");
	 //кухарь 21.03.16 конец
	 
	 
	 
	 
	 
	 запрос=новый запрос;	 
	 запрос.Текст= "ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |	ЗаявкаНаОтгрузкуНакладные.Накладная КАК Накладная,
	 |	ЗаявкаНаОтгрузкуНакладные.Накладная.КоличествоКоробок КАК КоробаИзНакладной,
	 |	ЗаявкаНаОтгрузкуНакладные.НомерНакладной КАК НомерНакладной,
	 |	ЗаявкаНаОтгрузкуНакладные.КоличествоКоробок КАК КоробаИзЗог,
	 |	ЗаявкаНаОтгрузкуНакладные.ВидНакладной
	 |ИЗ
	 |	Документ.ЗаявкаНаОтгрузку.Накладные КАК ЗаявкаНаОтгрузкуНакладные
	 |ГДЕ
	 |	ЗаявкаНаОтгрузкуНакладные.Автомобиль = &Автомобиль
	 |	И ЗаявкаНаОтгрузкуНакладные.ВидНакладной <> ""ПНК""
	 |	И ЗаявкаНаОтгрузкуНакладные.НеОтгружать = ЛОЖЬ
	 |	И ЗаявкаНаОтгрузкуНакладные.Ссылка.ДатаОтгрузки = &ДатаОтгрузки
	 |	И ЗаявкаНаОтгрузкуНакладные.НомерХодки = &НомерХодки";
	 запрос.УстановитьПараметр("Автомобиль",Автомобиль);
	 запрос.УстановитьПараметр("ДатаОтгрузки",ДатаОтгрузки);
	 //Кухарь 18.04.16 начало
	 //несколько ходок
	 запрос.УстановитьПараметр("НомерХодки",НомерХодки);
	 //Кухарь 18.04.16 конец
	 ТЗНакладных=запрос.Выполнить().выгрузить();
	 
	 
	 для каждого результат из ТЗНакладных цикл
		 если результат.ВидНакладной="ЗТО" тогда Продолжить; КонецЕсли;
		 
		 Отбор=новый Структура;
		 //Кухарь 21.06.16 начало
		 Отбор.Вставить("ВидНакладной",результат.ВидНакладной);
		 Отбор.Вставить("НомерНакладной",результат.НомерНакладной);
		 //отбор.Вставить("Накладная",результат.накладная);
		 //Кухарь 21.06.16 
		 
		 СписокКоробок=ЛистыНабора.НайтиСтроки(Отбор);
		 
		 если результат.накладная.склад=Справочники.Склады.ПустаяСсылка() тогда
			 Продолжить; //пока для накладных других складов, ничего не проверяем
			 если СписокКоробок.Количество()<>результат.КоробаИзЗог тогда
				 СтрТз=ТЗБезЗх.Добавить();
				 стртз.НомерНакладной=результат.НомерНакладной;
				 стртз.ВидНакладной=результат.ВидНакладной;
				 стртз.КоличествоКоробок=результат.КоробаИзЗог-СписокКоробок.Количество();	
				 //Кухарь 21.06.16 начало
				 СтрТз.накладная=результат.накладная;
				 //Кухарь 21.06.16 конец
			 КонецЕсли; 
		 иначе 
			 если СписокКоробок.Количество()<>результат.КоробаИзНакладной и результат.КоробаИзНакладной>0 тогда
				 СтрТз=ТЗБезЗх.Добавить();
				 стртз.НомерНакладной=результат.НомерНакладной;
				 стртз.ВидНакладной=результат.ВидНакладной;
				 стртз.КоличествоКоробок=результат.КоробаИзНакладной-СписокКоробок.Количество();
				 //Кухарь 21.06.16 начало
				 СтрТз.накладная=результат.накладная;
				 //Кухарь 21.06.16 конец
				 
			 ИначеЕсли  результат.КоробаИзНакладной=0 тогда
				 если СписокКоробок.Количество()<>результат.КоробаИзЗог тогда
					 //кухарь 25.03.15 начало
					 если результат.КоробаИзЗог=0 и результат.КоробаИзНакладной=0 тогда
						 Продолжить;
					 КонецЕсли;
					 //кухарь 25.03.15 конец
					 СтрТз=ТЗБезЗх.Добавить();
					 стртз.НомерНакладной=результат.НомерНакладной;
					 стртз.ВидНакладной=результат.ВидНакладной;
					 стртз.КоличествоКоробок=результат.КоробаИзЗог-СписокКоробок.Количество();	
					 //Кухарь 21.06.16 начало
					 СтрТз.накладная=результат.накладная;
					 //Кухарь 21.06.16 конец
					 
				 КонецЕсли; 
			 КонецЕсли;
		 КонецЕсли;		 
	 КонецЦикла;
	 
	 //кухарь 24.03.15 начало
	 //добавим список коробок которые осталось досканировать
	 Для каждого СтрТз из ТЗБезЗх цикл
		 отбор=новый Структура;
		 Отбор.Вставить("НомерНакладной",СтрТз.НомерНакладной);
		 Отбор.Вставить("ВидНакладной",СтрТз.ВидНакладной);
		 УжеЕстьЛН=ЛистыНабора.НайтиСтроки(Отбор);
		 УжеЕстьЗаявка=Заявка.НайтиСтроки(Отбор);
		 если УжеЕстьЛН.Количество()=0 или УжеЕстьЗаявка.Количество()<>1 тогда
			 //Валетов + 21,04,2026 БЕЗ ЗАДАЧИ Поменял ошибку на более понятную
			 //СтрТз.НомераКоробок="Сбой 1С";
			 СтрТз.НомераКоробок="Нет заявки!";
			 Продолжить;
		 иначе
			 СтрТз.НомераКоробок="";
			 МаксНомер=УжеЕстьЗаявка.Получить(0).КоличествоКоробок;
			 Для сч = 1 по МаксНомер цикл
				 ЕстьТекНомер=Ложь;
				 для Каждого СтрМасс из УжеЕстьЛН цикл
					 если СтрМасс.НомерКоробки=сч тогда
						 ЕстьТекНомер=Истина;
					 КонецЕсли;
				 КонецЦикла;
				 если не ЕстьТекНомер тогда
					 СтрТз.НомераКоробок=СтрТз.НомераКоробок+Строка(сч)+", ";
				 КонецЕсли;
			 КонецЦикла;
		 КонецЕсли; 
		 СтрТз.НомераКоробок=Лев(СтрТз.НомераКоробок,СтрДлина(СтрТз.НомераКоробок)-2);
	 КонецЦикла;
	 //кухарь 24.03.15 конец
	 //если РазбиватьПоЗХ тогда
	 ТЗ=новый ТаблицаЗначений;
	 ТЗ.Колонки.Добавить("ЗонаХранения");
	 Тз.Колонки.Добавить("ВидНакладной");
	 тз.Колонки.Добавить("НомерНакладной");
	 Тз.Колонки.Добавить("КоличествоКоробок");
	 //Кухарь 21.06.16 начало
	 Тз.Колонки.Добавить("Накладная");
	 //Кухарь 21.06.16 конец
	 
	 для каждого СтрТЗ из ТЗБезЗх цикл	 
		 Запрос=новый запрос;
		 //Кухарь 21.06.16 начало
		 //В ШК ЛН больше ничего нет
		 //Запрос.Текст="ВЫБРАТЬ
		 //|	ИнформацияШКЛН.ШК
		 //|ИЗ
		 //|	РегистрСведений.ИнформацияШКЛН КАК ИнформацияШКЛН
		 //|ГДЕ
		 //|	ИнформацияШКЛН.Год = &Год
		 //|	И ИнформацияШКЛН.ВидНакладной = &ВидНакладной
		 //|	И ИнформацияШКЛН.НомерНакладной = &НомерНакладной";
		 
		 Запрос.Текст="ВЫБРАТЬ
		 |	ОстаткиЗХ.ШККоробки КАК ШК
		 |ИЗ
		 |	РегистрНакопления.ОстаткиЗХ КАК ОстаткиЗХ
		 |ГДЕ
		 |	ОстаткиЗХ.Накладная В(&Накладная)
		 |
		 
		 //Кухарь 21.06.16 конец
		 
		 |ОБЪЕДИНИТЬ ВСЕ
		 |
		 |ВЫБРАТЬ
		 |	ИнформацияШКЛП.ШК
		 |ИЗ
		 |	РегистрСведений.ИнформацияШКЛП КАК ИнформацияШКЛП
		 |ГДЕ
		 |	ИнформацияШКЛП.Год = &Год
		 |	И ИнформацияШКЛП.ВидНакладной = &ВидНакладной
		 |	И ИнформацияШКЛП.НомерНакладной = &НомерНакладной";
		 запрос.УстановитьПараметр("Год",НачалоГода(ДатаОтгрузки));
		 запрос.УстановитьПараметр("ВидНакладной",СтрТЗ.ВидНакладной);
		 запрос.УстановитьПараметр("НомерНакладной",СтрТЗ.НомерНакладной);
		 запрос.УстановитьПараметр("Накладная",СтрТз.накладная);
		 СписокШК=запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШК");
		 
		 
		 
		 запрос=новый запрос;
		 запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
		 |	ОстаткиЗХОстатки.ЗонаХранения.Наименование КАК ЗонаХранения,
		 |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОстаткиЗХОстатки.ШККоробки) КАК КоличествоКоробок
		 |ИЗ
		 |	РегистрНакопления.ОстаткиЗХ.Остатки(&Дата, ) КАК ОстаткиЗХОстатки
		 |ГДЕ
		 |	ОстаткиЗХОстатки.ШККоробки В(&ШК)
		 |	И ОстаткиЗХОстатки.КоличествоКоробокОстаток > 0
		 |
		 |СГРУППИРОВАТЬ ПО
		 |	ОстаткиЗХОстатки.ЗонаХранения.Наименование";
		 запрос.УстановитьПараметр("ШК",СписокШК);
		 запрос.УстановитьПараметр("Дата",ТекущаяДата());
		 результат=запрос.Выполнить().выбрать();
		 СчКоробов=0;
		 пока результат.Следующий() цикл
			 СтрТЗХ=ТЗ.Добавить();
			 ЗаполнитьЗначенияСвойств(СтрТЗХ,результат);
			 ЗаполнитьЗначенияСвойств(СтрТЗХ,СтрТз);
			 СтрТЗХ.КоличествоКоробок=результат.КоличествоКоробок;
			 СчКоробов=СчКоробов+результат.КоличествоКоробок;
		 КонецЦикла;
		 
		 Если СчКоробов<>СтрТз.КоличествоКоробок тогда
			 СтрТЗХ=ТЗ.Добавить();
			 ЗаполнитьЗначенияСвойств(СтрТЗХ,СтрТз);
			 СтрТЗХ.ЗонаХранения="Нет в ЗХ";
			 стртзх.КоличествоКоробок=СтрТз.КоличествоКоробок-СчКоробов;
		 КонецЕсли;			 
	 КонецЦикла;
	 ТЗ.Сортировать("ЗонаХранения,ВидНакладной,НомерНакладной");
	 //КонецЕсли;
	 Масс=новый Массив;
	 Масс.Добавить(ТЗ);
	 Масс.Добавить(ТЗБезЗх);
	 возврат Масс; 
	 
 КонецФункции
 
 //кухарь 15.03.15 начало
 //перенёс в ЛЗ
 функция УстановитьШКЛЗ ()
	 Запрос=Новый Запрос;
	 Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	 |	ПОДСТРОКА(ЛистЗагрузки.ШтрихКод, 4, 9) КАК НомерШК
	 |ИЗ
	 |	Документ.ЛистЗагрузки КАК ЛистЗагрузки
	 |ГДЕ
	 |	ПОДСТРОКА(ЛистЗагрузки.ШтрихКод, 1, 3) = ""444""
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	НомерШК УБЫВ";
	 
	 Выборка=Запрос.Выполнить().Выбрать();
	 Если Выборка.Следующий() Тогда
		 НомерШК =  Число(Выборка.НомерШК);	
	 Иначе
		 НомерШК = "000000000";
	 КонецЕсли; 
	 
	 НомерШК=НомерШК+1;
	 ШтрихКод = "444" + Формат(НомерШК,"ЧЦ=9; ЧРГ=; ЧВН=; ЧГ=0");
	 ШтрихКод = ШтрихКод + КонтрольныйСимволEAN(Число(ШтрихКод),13);
	 Возврат ШтрихКод;
 КонецФункции
 //кухарь 15.03.15 конец
 
 
 //Кухарь 02.04.17 начало
 //Скопируем проверки из формы РНК
 Функция ПроверитьЧтоМожноОтгружать(Накладная)
	 МожноОтгружать=истина;
	 если Накладная.метаданные().имя<>"РасходнаяНакладная" тогда
		 Возврат Истина;
	 КонецЕсли;
	 
	 
	 Путь = Накладная.Подразделение.ПутьКФайлуЗадолженностей;
	 Если Не пустаяСтрока(Путь) Тогда
		 Результат=Истина;
		 Если Накладная.Склад.Подразделение.КонтролироватьЛимитИЗадолженность И ФайлСуществует(Путь)  Тогда
			 Отказ=Ложь;
			 ТекЗн=ПолучитьДанныеИзФайлаЗадолженности(Накладная.Контрагент,Путь);
			 Если ТекЗн=Неопределено Тогда
				 Сообщить("Файл данных отсутствует! Проверка задолженности не выполнена");
				 возврат ложь;
			 КонецЕсли;
			 
			 ДатаФайла=ТекЗн.ДатаФайла;
			 КодКонтр=ТекЗн.КодКонтр;
			 НаимКонтр=ТекЗн.НаимКонтр;
			 ТекущаяЗадолженность=ТекЗн.ТекущаяЗадолженность;
			 ОбщийДолг=ТекЗн.ОбщийДолг;
			 ЛимитКредитаПоДопСоглашению=ТекЗн.ЛимитКредитаПоДопСоглашению;
			 ЛимитКредита=ТекЗн.ЛимитКредита;
			 ДолгПоДопСоглашению=ТекЗн.ДолгПоДопСоглашению;
			 
			 ДеньФайла=День(ДатаФайла);
			 ДеньВч=День(ТекущаяДата()-60 * 60 * 24);
			 ТекЧас=Час(ТекущаяДата());
			 ТекМинута=Минута(ДатаФайла);
			 
			 Если (ТекЧас=12 И ТекМинута>30) ИЛИ (ТекЧас>12) Тогда
				 // берем сегодняшний файл  иначе пишем ошибку загрузки
				 Если НЕ ДеньФайла=День(ТекущаяДата()) Тогда
					 сообщить("Файл задолженности на текущую дату отсутствует. Задолженность не проверена.");
					 возврат ложь;
				 КонецЕсли;
				 
			 КонецЕсли;
			 
			 Если (ТекЧас=12 И ТекМинута<30) ИЛИ (ТекЧас<12) Тогда
				 Если НЕ ДеньФайла=ДеньВч Тогда
					 сообщить("Файл задолженности на вчерашний день отсутствует. Задолженность не проверена.");
					 возврат ложь;
				 КонецЕсли;			 
			 КонецЕсли;
			 
			 Результат=Истина;
			 ТекКонтрагент=?(НЕ Накладная.Контрагент.Ведущий.Пустая(),Накладная.Контрагент.Ведущий,Накладная.Контрагент);	
			 Если ТекКонтрагент.ОтгрузкаЗапрещена Тогда
				 // +++ {Кузнецов [22.12.2022]
				 #Если Клиент Тогда
					 Предупреждение("Отгрузка данному контрагенту запрещена ! Обратитесь к начальнику отдела !");
					 Результат=Ложь;	
				 #КонецЕсли
				 // }Кузнецов +++ [22.12.2022]
				 //крохин начало 05.09.2013
				 //новая галка
				 //крохин начало 11.11.2015
				 //галку "отгрузка запрещена можно ставить на ssp-контрагента
			 ИначеЕсли Накладная.Контрагент.ОтгрузкаЗапрещена Тогда
				 // +++ {Кузнецов [22.12.2022]
				 #Если Клиент Тогда
					 Предупреждение("Отгрузка данному контрагенту запрещена ! Обратитесь к начальнику отдела !");
					 возврат Ложь;
				 #КонецЕсли
				 // }Кузнецов +++ [22.12.2022]
				 //крохин конец 11.11.2015	
			 ИначеЕсли ТекКонтрагент.ДолгПоДокументам Тогда  
				 // +++ {Кузнецов [22.12.2022]
				 #Если Клиент Тогда
					 Предупреждение("Отгрузка данному контрагенту запрещена из-за задолженности по первичным документам!");
					 возврат Ложь;
				 #КонецЕсли
				 // }Кузнецов +++ [22.12.2022]
				 //крохин конец 05.09.2013
			 Иначе			
				 Результат=КонтрольПросроченнойЗадолженности(Накладная,ТекущаяЗадолженность);
				 Если Результат Тогда
					 Результат=КонтрольЛимитаКредита(Накладная,ЛимитКредита,ЛимитКредитаПоДопСоглашению,ОбщийДолг,ДолгПоДопСоглашению);
				 КонецЕсли; 
			 КонецЕсли;	
			 если Результат = ложь тогда
				 возврат ложь;
			 КонецЕсли;
		 КонецЕсли; 
		 
		 
		 Если Накладная.Склад.Подразделение.КонтролироватьЛимитИЗадолженность И НЕ ФайлСуществует(Путь)  Тогда
			 Сообщить("Файл задолженности отсутствует. Задолженность не проверена!",СтатусСообщения.Важное);			
		 КонецЕсли;
	 Иначе
		 Если Накладная.Склад.Подразделение.КонтролироватьЛимитИЗадолженность Тогда
			 Результат=КонтрольПросроченнойЗадолженностиНов(накладная.Ссылка);			
			 Если Результат Тогда
				 Результат=КонтрольЛимитаКредитаНов(накладная.Ссылка);
			 КонецЕсли;
		 Иначе 
			 Результат = Истина;	
		 КонецЕсли;
	 КонецЕсли;
	 
	 
	 Если НЕ Результат Тогда
		 Возврат ложь;			
	 КонецЕсли;	
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	 |	СчетФактураНакладные.Ссылка
	 |ИЗ
	 |	Документ.СчетФактура.Накладные КАК СчетФактураНакладные
	 |ГДЕ
	 |	СчетФактураНакладные.Ссылка.Проведен
	 |	И СчетФактураНакладные.Накладная = &Накладная";
	 Запрос.УстановитьПараметр("Накладная",накладная);
	 Выборка = запрос.Выполнить().Выбрать();
	 Пока Выборка.Следующий() Цикл
		 Если НачалоДня(накладная.ДатаОтгрузки) > НачалоДня(Выборка.Ссылка.Дата) Тогда
			 // +++ {Кузнецов [22.12.2022]
			 #Если Клиент Тогда
				 Предупреждение("Существует счет-фактура с датой, меньшей даты документа. Удалите счет-фактуру перед изменением даты отгрузки");			
				 Возврат ложь;
			 #КонецЕсли
			 // }Кузнецов +++ [22.12.2022]
		 КонецЕсли;		
	 КонецЦикла;
	 Если Накладная.Договор.УсловияОплаты <> Перечисления.УсловияОплаты.Комиссия И Выборка.Количество() = 0 И Накладная.ВидОплаты = Перечисления.ВидыОплаты.БН И Накладная.Товары.Итог("Всего") > 0 Тогда  
		 // +++ {Кузнецов [22.12.2022]
		 #Если Клиент Тогда
			 Предупреждение("Отсутствует счет-фактура! Выпишите счет-фактуру перед отгрузкой РНК");			
			 возврат ложь 
		 #КонецЕсли
		 // }Кузнецов +++ [22.12.2022]
	 КонецЕсли;	
	 Если НЕ КонтрольНулевыхЦенВНакладной(Накладная) Тогда
		 
		 Возврат ложь;	
	 КонецЕсли;		
	 
	 
	 
	 возврат МожноОтгружать;
 КонецФункции
 
 
 Функция ФайлСуществует(ИмяКаталога)
	 
	 КаталогНаДиске = Новый Файл(ИмяКаталога);
	 Если КаталогНаДиске.Существует() Тогда
		 Возврат Истина;
	 Иначе
		 Возврат Ложь;
	 КонецЕсли;
	 
 КонецФункции
 
 Функция ПолучитьДанныеИзФайлаЗадолженности(Контрагент,Имя)
	 
	 Тз=Новый ТаблицаЗначений;
	 ТЗ.Очистить();
	 
	 //Имя="\\E-cod\ediconnector2\Stoletov\Price\ProsrZadols.xml";
	 
	 //Путь для ФТП нашего  //"\\Srvmail1\FTPFolders\exch80\snl\"
	 Файл = Новый ЧтениеXML;
	 
	 Попытка
		 Файл.ОткрытьФайл(Имя);
	 исключение
		 
		 Возврат Неопределено;
		 
	 КонецПопытки;
	 
	 //--------------------------------------------------
	 КодКонтр=0;
	 ТекущаяЗадолженность=0;
	 ОбщийДолг=0;
	 ЛимитКредитаПоДопДоговора=0;
	 ЛимитКредита=0;
	 НаимКонтр="";
	 
	 Пока Файл.Прочитать() Цикл
		 
		 // сообщить("Локальное имя: " +Файл.ЛокальноеИмя +" Тип узла: "+Файл.ТипУзла+" Значение:"+Файл.Значение);
		 
		 Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Файл.ЛокальноеИмя = "OrderDate" тогда
			 файл.Прочитать(); 
			 ДатаФайла = Дата(Файл.Значение);
		 КонецЕсли; 
		 
		 Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Файл.ЛокальноеИмя = "KOD" тогда
			 файл.Прочитать(); 
			 КодКонтр = Файл.Значение;
			 //НаимКонтр="";
		 КонецЕсли; 
		 
		 Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Файл.ЛокальноеИмя = "NAIM" тогда
			 файл.Прочитать(); 
			 НаимКонтр = Файл.Значение;  // наименование номенклатуры
		 КонецЕсли; 
		 
		 Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Файл.ЛокальноеИмя = "LimitKredita" тогда
			 файл.Прочитать(); 
			 ЛимитКредита = Число(Файл.Значение);
		 КонецЕсли; 
		 
		 Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Файл.ЛокальноеИмя = "LimitPoDopDog" тогда
			 файл.Прочитать(); 
			 ЛимитКредитаПоДопДоговора = Число(Файл.Значение);
		 КонецЕсли;
		 
		 Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Файл.ЛокальноеИмя = "ObDolg" тогда
			 файл.Прочитать(); 
			 ОбщийДолг = Число(Файл.Значение);
		 КонецЕсли;
		 
		 Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Файл.ЛокальноеИмя = "DolgPoDopSog" тогда
			 файл.Прочитать(); 
			 ДолгПоДопСоглашению = Число(Файл.Значение);
		 КонецЕсли;
		 
		 Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Файл.ЛокальноеИмя = "TekZadol" тогда
			 
			 файл.Прочитать(); 
			 ТекущаяЗадолженность = Число(Файл.Значение);
			 Если СокрЛП(КодКонтр)=СокрЛП(Контрагент.код) Тогда
				 прервать;
			 КонецЕсли;	
			 
		 КонецЕсли;
		 
	 КонецЦикла; 
	 ТЗ.Колонки.Добавить("ЛимитКредита",Новый ОписаниеТипов("Число"));
	 ТЗ.Колонки.Добавить("ЛимитКредитаПоДопСоглашению",Новый ОписаниеТипов("Число"));
	 ТЗ.Колонки.Добавить("ОбщийДолг",Новый ОписаниеТипов("Число"));
	 ТЗ.Колонки.Добавить("ДолгПоДопСоглашению",Новый ОписаниеТипов("Число"));
	 ТЗ.Колонки.Добавить("ДатаФайла",Новый ОписаниеТипов("Дата"));
	 ТЗ.Колонки.Добавить("КодКонтр",Новый ОписаниеТипов("Строка"));
	 ТЗ.Колонки.Добавить("ТекущаяЗадолженность",Новый ОписаниеТипов("Число"));
	 ТЗ.Колонки.Добавить("НаимКонтр",Новый ОписаниеТипов("Строка"));
	 
	 Если СокрЛП(КодКонтр)=СокрЛП(Контрагент.код) Тогда
		 
		 НовСт=ТЗ.Добавить();
		 НовСт.ДатаФайла=ДатаФайла;
		 НовСт.КодКонтр=КодКонтр;
		 НовСт.ТекущаяЗадолженность=ТекущаяЗадолженность;
		 НовСт.ОбщийДолг=ОбщийДолг;
		 НовСт.ДолгПоДопСоглашению=ДолгПоДопСоглашению;
		 НовСт.ЛимитКредитаПоДопСоглашению=ЛимитКредитаПоДопДоговора;
		 НовСт.ЛимитКредита=ЛимитКредита;
		 НовСт.НаимКонтр=НаимКонтр;
	 Иначе
		 НовСт=ТЗ.Добавить();
		 НовСт.ДатаФайла=ДатаФайла;
		 НовСт.КодКонтр=Контрагент.код;
		 НовСт.ТекущаяЗадолженность=0;
		 НовСт.ОбщийДолг=0;
		 НовСт.ДолгПоДопСоглашению=0;
		 НовСт.ЛимитКредитаПоДопСоглашению=0;
		 НовСт.ЛимитКредита=0;
		 НовСт.НаимКонтр=Контрагент.Наименование;
		 
	 КонецЕсли;
	 
	 
	 
	 Файл.Закрыть();
	 
	 
	 Возврат НовСт;
	 
	 
 КонецФункции
 
 Функция КонтрольПросроченнойЗадолженности(Накладная,ПросроченнаяЗадолженность)
	 ВыбКонтрагент=?(ЗначениеЗаполнено(Накладная.Контрагент.Ведущий),Накладная.Контрагент.Ведущий,Накладная.Контрагент);
	 
	 ДатаКонтроля=КонецДня(ТекущаяДата())-24*60*60*Константы.ЛьготныхДнейКонтроляПросроченнойЗадолженноси.Получить();
	 ЕстьКонтроль=ПолучитьГрупповоеСвойствоОбъекта(ВыбКонтрагент,ПланыВидовХарактеристик.СвойстваОбъектов.КонтрольПросроченнойЗадолженности);
	 //крохин начало
	 //для бесплатной рекламы контроль не нужен
	 //Если ЕстьКонтроль=Неопределено ИЛИ ЕстьКонтроль=Ложь Тогда Возврат Истина КонецЕсли;
	 ТолькоРеклама = Истина;
	 Для Каждого СтрокаТЧ Из Накладная.Товары Цикл
		 Если СтрокаТЧ.Номенклатура.Родитель.ВидНоменклатуры <> Перечисления.ВидыНоменклаутры.РекламаБесплатная Тогда
			 ТолькоРеклама = Ложь;	
		 КонецЕсли;
	 КонецЦикла;
	 Если ЕстьКонтроль=Неопределено ИЛИ ЕстьКонтроль=Ложь ИЛИ ТолькоРеклама Тогда Возврат Истина КонецЕсли; 
	 //крохин конец
	 
	 Можно=Истина;
	 
	 Если ПросроченнаяЗадолженность>0 Тогда
		 Можно=Накладная.ОтгружатьСПросроченнойЗадолженостью;
		 
		 // +++ {Кузнецов [22.12.2022]
		 #Если Клиент Тогда
			 Предупреждение("На "+ДатаКонтроля+" просроченная задолженность 
			 |по контрагенту """+СокрЛП(Накладная.Контрагент)+""" ("+СокрЛП(Накладная.Контрагент.Код)+") 
			 |составляет: "+Формат(ПросроченнаяЗадолженность,"ЧДЦ=2; ЧРГ=' '; ЧГ=3,0")+".
			 |"+?(НЕ Можно,"Недостаточно полномочий для отгрузки накладной !",""));		
		 #КонецЕсли
		 // }Кузнецов +++ [22.12.2022] 
	 КонецЕсли; 
	 
	 Возврат Можно;
	 
 КонецФункции // КонтрольПросроченнойЗадолженности()
 
 Функция КонтрольЛимитаКредита(Накладная,ЛимитКредита,ЛимитКредитаПоДопСоглашению,ОбщийДолг,ДолгПоДопСоглашению)
	 
	 ВыбКонтрагент=?(ЗначениеЗаполнено(Накладная.Контрагент.Ведущий),Накладная.Контрагент.Ведущий,Накладная.Контрагент);
	 
	 ЕстьКонтроль=ПолучитьГрупповоеСвойствоОбъекта(ВыбКонтрагент,ПланыВидовХарактеристик.СвойстваОбъектов.КонтрольЛимитаЗадолженности);
	 //крохин начало
	 //для бесплатной рекламы контроль не нужен
	 //Если ЕстьКонтроль=Неопределено ИЛИ ЕстьКонтроль=Ложь Тогда Возврат Истина КонецЕсли; 
	 ТолькоРеклама = Истина;
	 Для Каждого СтрокаТЧ Из Накладная.Товары Цикл
		 Если СтрокаТЧ.Номенклатура.Родитель.ВидНоменклатуры <> Перечисления.ВидыНоменклаутры.РекламаБесплатная Тогда
			 ТолькоРеклама = Ложь;	
		 КонецЕсли;
	 КонецЦикла;
	 Если ЕстьКонтроль=Неопределено ИЛИ ЕстьКонтроль=Ложь ИЛИ ТолькоРеклама Тогда Возврат Истина КонецЕсли; 
	 //крохин конец
	 
	 
	 ДатаКонтроля=КонецДня(ТекущаяДата());
	 ВалютаИтогов=ПараметрыСеанса.ВалютаУпр_2009;
	 
	 Можно=Истина;
	 
	 Если ОбщийДолг + Накладная.Товары.Итог("Всего")>ЛимитКредита Тогда
		 Можно=Накладная.ОтгружатьСПревышениемЛимитаКредита;
		 
		 // +++ {Кузнецов [22.12.2022]
		 #Если Клиент Тогда
			 Предупреждение("На "+ДатаКонтроля+" задолженность 
			 |по контрагенту """+СокрЛП(Накладная.Контрагент)+""" ("+СокрЛП(Накладная.Контрагент.Код)+")
			 //крохин начало 21.11.2012
			 //с учетом РНК
			 //|составляет: "+Формат(ОбщийДолг,"ЧДЦ=2; ЧРГ=' '; ЧГ=3,0")+" "+ВалютаИтогов+".
			 |с учетом текущей отгрузки составляет: "+Формат(ОбщийДолг+Накладная.Товары.Итог("Всего"),"ЧДЦ=2; ЧРГ=' '; ЧГ=3,0")+" "+ВалютаИтогов+".
			 //крохин конец 21.11.2012
			 |Доступный лимит: "+Формат(ЛимитКредита,"ЧДЦ=2; ЧРГ=' '; ЧГ=3,0")+" "+ВалютаИтогов+".
			 //крохин начало 21.11.2012
			 //с учетом РНК
			 //|Лимит превышен на : "+Формат((ОбщийДолг-ЛимитКредита),"ЧДЦ=2; ЧРГ=' '; ЧГ=3,0")+" "+ВалютаИтогов+".
			 |Лимит превышен на : "+Формат((ОбщийДолг-ЛимитКредита+Накладная.Товары.Итог("Всего")),"ЧДЦ=2; ЧРГ=' '; ЧГ=3,0")+" "+ВалютаИтогов+".
			 //крохин конец 21.11.2012
			 |"+?(НЕ Можно,"
			 |Недостаточно полномочий для отгрузки накладной !",""));		
		 #КонецЕсли
		 // }Кузнецов +++ [22.12.2022]
		 
	 ИначеЕсли ДолгПоДопСоглашению>ЛимитКредитаПоДопСоглашению И Накладная.Договор.ДопСоглашение И Накладная.Дата>='20091001' Тогда
		 Можно=Накладная.ОтгружатьСПревышениемЛимитаКредита;
		 
		 // +++ {Кузнецов [22.12.2022]
		 #Если Клиент Тогда
			 Предупреждение("На "+ДатаКонтроля+" задолженность по доп. соглашению
			 |по контрагенту """+СокрЛП(Накладная.Контрагент)+""" ("+СокрЛП(Накладная.Контрагент.Код)+")
			 |составляет: "+Формат(ДолгПоДопСоглашению,"ЧДЦ=2; ЧРГ=' '; ЧГ=3,0")+" "+ВалютаИтогов+".
			 |Доступный лимит по доп. соглашению: "+Формат(ЛимитКредитаПоДопСоглашению,"ЧДЦ=2; ЧРГ=' '; ЧГ=3,0")+" "+ВалютаИтогов+".
			 |Лимит превышен на : "+Формат((ДолгПоДопСоглашению-ЛимитКредитаПоДопСоглашению),"ЧДЦ=2; ЧРГ=' '; ЧГ=3,0")+" "+ВалютаИтогов+".
			 |"+?(НЕ Можно,"
			 |Недостаточно полномочий для отгрузки накладной !",""));		
		 #КонецЕсли
		 // }Кузнецов +++ [22.12.2022]
		 
	 КонецЕсли; 
	 
	 Возврат Можно;
 КонецФункции
 Функция КонтрольПросроченнойЗадолженностиНов(Накладная)
	 ВыбКонтрагент=?(ЗначениеЗаполнено(Накладная.Контрагент.Ведущий),Накладная.Контрагент.Ведущий,Накладная.Контрагент);
	 
	 ЕстьКонтроль=ПолучитьГрупповоеСвойствоОбъекта(ВыбКонтрагент,ПланыВидовХарактеристик.СвойстваОбъектов.КонтрольПросроченнойЗадолженности);
	 //крохин начало
	 //для бесплатной рекламы контроль не нужен
	 //Если ЕстьКонтроль=Неопределено ИЛИ ЕстьКонтроль=Ложь Тогда Возврат Истина КонецЕсли;
	 ТолькоРеклама = Истина;
	 Для Каждого СтрокаТЧ Из Накладная.Товары Цикл
		 Если СтрокаТЧ.Номенклатура.Родитель.ВидНоменклатуры <> Перечисления.ВидыНоменклаутры.РекламаБесплатная Тогда
			 ТолькоРеклама = Ложь;	
		 КонецЕсли;
	 КонецЦикла;
	 Если ЕстьКонтроль=Неопределено ИЛИ ЕстьКонтроль=Ложь ИЛИ ТолькоРеклама Тогда Возврат Истина КонецЕсли; 
	 //крохин конец
	 
	 Запрос=Новый Запрос;	
	 Запрос.Текст="	
	 |ВЫБРАТЬ	
	 |	ВЫБОР КОГДА ВидДвижения=&Приход ТОГДА СуммаВал ИНАЧЕ -СуммаВал КОНЕЦ КАК НепрОтгр,
	 |	0 КАК ДолгКон
	 |ИЗ РегистрНакопления.Взаиморасчеты
	 |ГДЕ
	 |	Период<=&Дата2
	 //крохин начало 10.02.2016
	 //Дата оплаты в регистре "взаиморасчеты", документы закрытого периода в документе "ввод остатков взаиморасчетов"
	 //|	И КОНЕЦПЕРИОДА(Регистратор.ДатаОплаты,День) >= &Дата2
	 //|	И Регистратор Ссылка Документ.РасходнаяНакладная
	 //крохин начало 10.07.2016
	 //информация перенесена из измерения в реквизит
	 //|	И КОНЕЦПЕРИОДА(ДатаНачалаЗадолженности,День) >= &Дата2
	 // с обновлением в октябре 2016 вернуть (когда для всех неоплаченных РНК пропишутся данные во взаиморасчеты)  или прописать через "Выбор когда вид документа..."  |	И КОНЕЦПЕРИОДА(Дата_НачалаЗадолженности,День) >= &Дата2
	 |	И КОНЕЦПЕРИОДА(Регистратор.ДатаОплаты,День) >= &Дата2	
	 //крохин конец 10.07.2016
	 |	И (Регистратор Ссылка Документ.РасходнаяНакладная ИЛИ Регистратор Ссылка Документ.ВводОстатковВзаиморасчетов)
	 //крохин конец 10.02.2016
	 //крохин начало 30.01.2013
	 //только по договорам "продажа"
	 |	И Договор.ВидДоговора_Новый = &ВидДоговораПродажа
	 //крохин конец 30.01.2013
	 |	И Контрагент=&Контрагент	
	 |ОБЪЕДИНИТЬ ВСЕ
	 |ВЫБРАТЬ	
	 |	0 КАК НепрОтгр,	
	 |	IsNull(СуммаВалКонечныйОстаток,0) КАК ДолгКон
	 |ИЗ
	 //крохин начало 30.01.2013
	 //только по договорам "продажа"
	 //|	РегистрНакопления.Взаиморасчеты.ОстаткиИОбороты(, &Дата2,Период,,Контрагент=&Контрагент)
	 |	РегистрНакопления.Взаиморасчеты.ОстаткиИОбороты(, &Дата2,Период,,Контрагент=&Контрагент И Договор.ВидДоговора_Новый = &ВидДоговораПродажа)
	 //крохин конец 30.01.2013	
	 |ИТОГИ
	 |	СУММА(ДолгКон),СУММА(НепрОтгр) 		
	 |ПО ОБЩИЕ";	
	 
	 Запрос.УстановитьПараметр("Приход",ВидДвиженияНакопления.Приход);
	 
	 ДатаКонтроля=КонецДня(ТекущаяДата())-24*60*60*Константы.ЛьготныхДнейКонтроляПросроченнойЗадолженноси.Получить();
	 
	 Запрос.УстановитьПараметр("Дата2",ДатаКонтроля);
	 Запрос.УстановитьПараметр("Контрагент",ВыбКонтрагент);
	 //крохин начало 30.01.2013
	 //только по договорам "продажа"
	 запрос.УстановитьПараметр("ВидДоговораПродажа",Справочники.ВидыДоговоров.Товары_Продажа);
	 //крохин конец 30.01.2013
	 
	 ПросроченнаяЗадолженность=0;
	 
	 Выборка=Запрос.Выполнить().Выбрать();
	 Пока Выборка.Следующий() Цикл
		 Если Выборка.ТипЗаписи()=ТипЗаписиЗапроса.ОбщийИтог Тогда	
			 ПросроченнаяЗадолженность=Макс(0,Выборка.ДолгКон-Выборка.НепрОтгр);	
			 Прервать;
		 КонецЕсли;	
	 КонецЦикла;	
	 
	 Можно=Истина;
	 
	 Если ПросроченнаяЗадолженность>0 Тогда
		 Можно=Накладная.ОтгружатьСПросроченнойЗадолженостью;
		 
		 // +++ {Кузнецов [22.12.2022]
		 #Если Клиент Тогда
			 Предупреждение("На "+ДатаКонтроля+" просроченная задолженность 
			 |по контрагенту """+СокрЛП(ВыбКонтрагент)+""" ("+СокрЛП(ВыбКонтрагент.Код)+") 
			 |составляет: "+Формат(ПросроченнаяЗадолженность,"ЧДЦ=2; ЧРГ=' '; ЧГ=3,0")+".
			 |"+?(НЕ Можно,"Недостаточно полномочий для отправки накладной на склад !",""));		
		 #КонецЕсли
		 // }Кузнецов +++ [22.12.2022] 
	 КонецЕсли; 
	 
	 Возврат Можно;
 КонецФункции // КонтрольПросроченнойЗадолженности()
 
 Функция КонтрольЛимитаКредитаНов(Накладная)
	 ВыбКонтрагент=?(ЗначениеЗаполнено(Накладная.Контрагент.Ведущий),Накладная.Контрагент.Ведущий,Накладная.Контрагент);
	 
	 ЕстьКонтроль=ПолучитьГрупповоеСвойствоОбъекта(ВыбКонтрагент,ПланыВидовХарактеристик.СвойстваОбъектов.КонтрольЛимитаЗадолженности);
	 //крохин начало
	 //для бесплатной рекламы контроль не нужен
	 //Если ЕстьКонтроль=Неопределено ИЛИ ЕстьКонтроль=Ложь Тогда Возврат Истина КонецЕсли; 
	 ТолькоРеклама = Истина;
	 Для Каждого СтрокаТЧ Из Накладная.Товары Цикл
		 Если СтрокаТЧ.Номенклатура.Родитель.ВидНоменклатуры <> Перечисления.ВидыНоменклаутры.РекламаБесплатная Тогда
			 ТолькоРеклама = Ложь;	
		 КонецЕсли;
	 КонецЦикла;
	 Если ЕстьКонтроль=Неопределено ИЛИ ЕстьКонтроль=Ложь ИЛИ ТолькоРеклама Тогда Возврат Истина КонецЕсли; 
	 //крохин конец
	 
	 Запрос=Новый Запрос;	
	 Запрос.Текст="	
	 |ВЫБРАТЬ	
	 |	КодЦБ,
	 |	ВалютаКредита КАК ВалютаРасчетов,
	 |	СУММА(ЛимитКредита)	КАК ЛимитКредита,
	 |	СУММА(ВЫБОР КОГДА ДопСоглашение ТОГДА ЛимитКредита ИНАЧЕ 0 КОНЕЦ) КАК ЛимитКредитаПоДопСоглашению
	 |ИЗ 
	 |	Справочник.Договоры	
	 |ГДЕ
	 |	КодЦБ=&КодЦБ
	 //крохин начало 30.01.2013
	 //только по договорам "продажа"
	 |	И ВидДоговора_Новый = &ВидДоговораПродажа	
	 //крохин конец 30.01.2013
	 |	И НЕ ПометкаУдаления
	 |	И НЕ НеИспользовать	
	 |СГРУППИРОВАТЬ ПО 
	 |	КодЦБ,ВалютаКредита";	
	 
	 ДатаКонтроля=КонецДня(ТекущаяДата());
	 
	 Запрос.УстановитьПараметр("КодЦБ",ВыбКонтрагент.Код);
	 //крохин начало 30.01.2013
	 //только по договорам "продажа"
	 запрос.УстановитьПараметр("ВидДоговораПродажа",Справочники.ВидыДоговоров.Товары_Продажа);
	 //крохин конец 30.01.2013
	 
	 
	 ВалютаИтогов=ПараметрыСеанса.ВалютаУпр_2009;
	 
	 ЛимитКредита				= 0;
	 ЛимитКредитаПоДопСоглашению = 0;
	 
	 Выборка=Запрос.Выполнить().Выбрать();
	 Пока Выборка.Следующий() Цикл
		 ЛимитКредита				= ЛимитКредита					+глПересчет(Выборка.ЛимитКредита,					Выборка.ВалютаРасчетов,ДатаКонтроля,ВалютаИтогов,ДатаКонтроля);
		 ЛимитКредитаПоДопСоглашению = ЛимитКредитаПоДопСоглашению	+глПересчет(Выборка.ЛимитКредитаПоДопСоглашению,	Выборка.ВалютаРасчетов,ДатаКонтроля,ВалютаИтогов,ДатаКонтроля);		
	 КонецЦикла;	
	 
	 Запрос=Новый Запрос;
	 Запрос.Текст="
	 |ВЫБРАТЬ
	 |	Договор,
	 |	Договор.ВалютаКредита	КАК ВалютаРасчетов,
	 |	СуммаВалОстаток КАК ОбщийДолг,
	 |	ВЫБОР КОГДА Договор.ДопСоглашение ТОГДА 1 ИНАЧЕ 0 КОНЕЦ*СуммаВалОстаток КАК ДолгПоДопСоглашению 
	 |ИЗ
	 //крохин начало 30.01.2013
	 //только по договорам "продажа"
	 //|	РегистрНакопления.Взаиморасчеты.Остатки(&ДатаКонтроля, Контрагент = &Контрагент) КАК ВзаиморасчетыОстатки
	 |	РегистрНакопления.Взаиморасчеты.Остатки(&ДатаКонтроля, Контрагент = &Контрагент И Договор.ВидДоговора_Новый = &ВидДоговораПродажа) КАК ВзаиморасчетыОстатки
	 //крохин конец 30.01.2013
	 |ОБЪЕДИНИТЬ ВСЕ
	 |ВЫБРАТЬ
	 |	Договор,
	 |	Договор.ВалютаКредита	КАК ВалютаРасчетов,
	 |	СуммаДокумента 			КАК ОбщийДолг,
	 |	ВЫБОР КОГДА Договор.ДопСоглашение ТОГДА 1 ИНАЧЕ 0 КОНЕЦ*СуммаДокумента КАК ДолгПоДопСоглашению 
	 |ИЗ
	 |	Документ.РасходнаяНакладная
	 |ГДЕ
	 |	Проведен
	 |	И Отгружен=ЗНАЧЕНИЕ(Перечисление.Отгружен.Резерв)
	 //крохин начало 30.01.2013
	 //только по договорам "продажа"
	 |	И Договор.ВидДоговора_Новый = &ВидДоговораПродажа	
	 //крохин конец 30.01.2013
	 |	И (
	 |		СостояниеНакладной<>ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.ВРаботе)
	 |   	ИЛИ Ссылка=&Накладная
	 |	) 	
	 |	И (
	 |	Контрагент.Ведущий	=&Контрагент
	 |	ИЛИ Контрагент		=&Контрагент
	 |	)";
	 
	 Запрос.УстановитьПараметр("ДатаКонтроля",	ДатаКонтроля);
	 Запрос.УстановитьПараметр("Контрагент",		ВыбКонтрагент);	
	 Запрос.УстановитьПараметр("Накладная",		Накладная);		
	 //крохин начало 30.01.2013
	 //только по договорам "продажа"
	 запрос.УстановитьПараметр("ВидДоговораПродажа",Справочники.ВидыДоговоров.Товары_Продажа);
	 //крохин конец 30.01.2013
	 
	 
	 ОбщийДолг=0;
	 ДолгПоДопСоглашению=0;
	 Выборка=Запрос.Выполнить().Выбрать();
	 Пока Выборка.Следующий() Цикл
		 ОбщийДолг			=ОбщийДолг			+глПересчет(Выборка.ОбщийДолг,			Выборка.ВалютаРасчетов,ДатаКонтроля,ВалютаИтогов,ДатаКонтроля);			
		 ДолгПоДопСоглашению	=ДолгПоДопСоглашению+глПересчет(Выборка.ДолгПоДопСоглашению,Выборка.ВалютаРасчетов,ДатаКонтроля,ВалютаИтогов,ДатаКонтроля);
	 КонецЦикла; 
	 
	 Можно=Истина;
	 
	 Если ОбщийДолг>ЛимитКредита Тогда
		 Можно=Накладная.ОтгружатьСПревышениемЛимитаКредита;
		 
		 // +++ {Кузнецов [22.12.2022]
		 #Если Клиент Тогда
			 Предупреждение("На "+ДатаКонтроля+" задолженность 
			 |по контрагенту """+СокрЛП(ВыбКонтрагент)+""" ("+СокрЛП(ВыбКонтрагент.Код)+")
			 |составляет: "+Формат(ОбщийДолг,"ЧДЦ=2; ЧРГ=' '; ЧГ=3,0")+" "+ВалютаИтогов+".
			 |Доступный лимит: "+Формат(ЛимитКредита,"ЧДЦ=2; ЧРГ=' '; ЧГ=3,0")+" "+ВалютаИтогов+".
			 |Лимит превышен на : "+Формат((ОбщийДолг-ЛимитКредита),"ЧДЦ=2; ЧРГ=' '; ЧГ=3,0")+" "+ВалютаИтогов+".
			 |"+?(НЕ Можно,"
			 |Недостаточно полномочий для отправки накладной на склад !",""));		
		 #КонецЕсли
		 // }Кузнецов +++ [22.12.2022] 
		 
	 ИначеЕсли ДолгПоДопСоглашению>ЛимитКредитаПоДопСоглашению И Накладная.Договор.ДопСоглашение И Накладная.Дата>='20091001' Тогда
		 Можно=Накладная.ОтгружатьСПревышениемЛимитаКредита;
		 
		 // +++ {Кузнецов [22.12.2022]
		 #Если Клиент Тогда
			 Предупреждение("На "+ДатаКонтроля+" задолженность по доп. соглашению
			 |по контрагенту """+СокрЛП(ВыбКонтрагент)+""" ("+СокрЛП(ВыбКонтрагент.Код)+")
			 |составляет: "+Формат(ДолгПоДопСоглашению,"ЧДЦ=2; ЧРГ=' '; ЧГ=3,0")+" "+ВалютаИтогов+".
			 |Доступный лимит по доп. соглашению: "+Формат(ЛимитКредитаПоДопСоглашению,"ЧДЦ=2; ЧРГ=' '; ЧГ=3,0")+" "+ВалютаИтогов+".
			 |Лимит превышен на : "+Формат((ДолгПоДопСоглашению-ЛимитКредитаПоДопСоглашению),"ЧДЦ=2; ЧРГ=' '; ЧГ=3,0")+" "+ВалютаИтогов+".
			 |"+?(НЕ Можно,"
			 |Недостаточно полномочий для отправки накладной на склад !",""));		
		 #КонецЕсли
		 // }Кузнецов +++ [22.12.2022]
		 
	 КонецЕсли; 
	 
	 Возврат Можно;
 КонецФункции
 Функция КонтрольНулевыхЦенВНакладной(Накладная)
	 Можно=Истина;
	 
	 Если НЕ Накладная.ОтгружатьПоНулевымЦенам Тогда 		
		 
		 Стр="";
		 
		 Для Каждого СтрокаТЧ Из Накладная.Товары Цикл
			 //крохин начало 08.09.2017
			 //МБП тоже не проверяем
			 //Если СтрокаТЧ.Номенклатура.Родитель.ВидНоменклатуры<>Перечисления.ВидыНоменклаутры.РекламаБесплатная И СтрокаТЧ.Цена = 0  И СтрокаТЧ.Количество <> 0 Тогда	
			 Если (СтрокаТЧ.Номенклатура.Родитель.ВидНоменклатуры<>Перечисления.ВидыНоменклаутры.РекламаБесплатная И СтрокаТЧ.Номенклатура.Родитель.ВидНоменклатуры<>Перечисления.ВидыНоменклаутры.МБП)И СтрокаТЧ.Цена = 0  И СтрокаТЧ.Количество <> 0 Тогда
				 //крохин конец 08.09.2017	
				 Можно=Ложь;
				 
				 Стр=Стр+"Нулевые цены в накладной !";
				 
				 Стр=Стр+Символы.ПС+"Стр. №: "+СтрокаТЧ.НомерСтроки+", ном.: "+СтрокаТЧ.Номенклатура;		
			 КонецЕсли; 
		 КонецЦикла;
		 Если НЕ ПустаяСтрока(Стр) Тогда    
			 // +++ {Кузнецов [22.12.2022]
			 #Если Клиент Тогда
				 Предупреждение(Стр);	
			 #КонецЕсли
			 // }Кузнецов +++ [22.12.2022]
		 КонецЕсли;
	 КонецЕсли; 
	 
	 Возврат Можно;
 КонецФункции 
 //Кухарь 02.04.17 конец
 
 // Кухарь А.Ю. 02.03.2021 начало
 //
 
 // Кухарь А.Ю. 02.03.2021 начало
 Функция ПроверитьСФ ()
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	 |	СчетФактураНакладные.Ссылка КАК Ссылка
	 |ИЗ
	 |	Документ.СчетФактура.Накладные КАК СчетФактураНакладные
	 |ГДЕ
	 |	СчетФактураНакладные.Ссылка.Проведен
	 |	И СчетФактураНакладные.Накладная В(&Накладная)
	 |	И НАЧАЛОПЕРИОДА(СчетФактураНакладные.Ссылка.Дата, ДЕНЬ) < &ДатаОтгрузки";
	 Запрос.УстановитьПараметр("Накладная",ТЗНакладных.выгрузитьколонку("Накладная"));
	 запрос.УстановитьПараметр("ДатаОтгрузки",ДатаОтгрузки);
	 Выборка = запрос.Выполнить().Выбрать();
	 Пока Выборка.Следующий() Цикл
		 Сообщить("Существует счет-фактура с датой, меньшей даты документа. Удалите счет-фактуру перед изменением даты отгрузки");			
		 Возврат ложь;	
	 КонецЦикла;
	 возврат Истина;
 КонецФункции
 
 
 Функция ПроверитьОстаткиТоваров() 
	 // Кухарь А.Ю. 19.03.2021 начало
	 // пока что отключил для ускорения
	 возврат Истина;
	 // Кухарь А.Ю. 19.03.2021 конец
	 
	 
	 Запрос=новый запрос;
	 запрос.Текст="ВЫБРАТЬ
	 |	ТЗ.Накладная КАК Накладная
	 |ПОМЕСТИТЬ ТЗНоменклатуры
	 |ИЗ
	 |	&ТЗ КАК ТЗ
	 |ГДЕ
	 |	(ТЗ.Накладная ССЫЛКА Документ.РасходнаяНакладная
	 |			ИЛИ ТЗ.Накладная ССЫЛКА Документ.Перемещение)
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ЗаданиеНабораТовары.Номенклатура КАК Номенклатура,
	 |	СУММА(ЗаданиеНабораТовары.Количество) КАК Количество,
	 |	СУММА(ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток,
	 |	СУММА(ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток1
	 |ИЗ
	 |	ТЗНоменклатуры КАК ТЗНоменклатуры
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНабора.Товары КАК ЗаданиеНабораТовары
	 |		ПО ТЗНоменклатуры.Накладная = ЗаданиеНабораТовары.Ссылка.Накладная,
	 |	РегистрНакопления.ОстаткиТМЦ.Остатки(&ДатаОтгрузки, Склад = &Склад) КАК ОстаткиТМЦОстатки,
	 |	РегистрНакопления.РезервыТМЦ.Остатки КАК РезервыТМЦОстатки
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ЗаданиеНабораТовары.Номенклатура
	 |
	 |ИМЕЮЩИЕ
	 |	СУММА(ЗаданиеНабораТовары.Количество) > СУММА(ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0)) + СУММА(ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0))";
	 запрос.УстановитьПараметр("ТЗ",ТЗНакладных);
	 запрос.УстановитьПараметр("ДатаОтгрузки",ДатаОтгрузки);
	 запрос.УстановитьПараметр("Склад",ПараметрыСеанса.ЭтотУзел.Подразделение.ОсновнойСклад);
	 результат=запрос.Выполнить().выбрать();
	 ОстатковХватает=Истина;
	 пока результат.Следующий() цикл
		 Сообщить("Недостаточно товара на остатках "+результат.номенклатура);
		 ОстатковХватает=Ложь;
	 КонецЦикла;
	 возврат ОстатковХватает;
	 
	 
	 
	 
	 
 КонецФункции
 
 
 // Кухарь А.Ю. 03.05.2025 начало
 Функция ДобавитьКоробкуВЛЗ(Знач Лист, Знач НомерКоробки, Знач ШК, Знач ШКПаллеты) экспорт
	 СтруктураВозврата=новый Структура("Ошибки,Успех",Новый Массив,Ложь);
	 
	 КонецСтроки=СтрНайти(ШК,"}}}");
	 если КонецСтроки > 0 тогда
		 ШК = Сред(ШК,1,КонецСтроки+2);
	 КонецЕсли;
	 
	 Накладная=ПолучитьРеквизитШапки(Лист,"ДокОснование","Документ");
	 ВидНакладной=накладная.метаданные().синоним;
	 ОтборДляЗаявки=новый Структура;
	 ОтборДляЗаявки.Вставить("НомерНакладной",накладная.номер);
	 ОтборДляЗаявки.Вставить("ВидНакладной",ВидНакладной);
	 МассивСтрокЗаявки=Заявка.НайтиСтроки(ОтборДляЗаявки);
	 Если МассивСтрокЗаявки.Количество()=0 тогда
		 СтруктураВозврата.Ошибки.Добавить("Накладной нет в заявке");
		 Возврат СтруктураВозврата;	
	 ИначеЕсли МассивСтрокЗаявки.Получить(0).КоличествоКоробок = 0 тогда
		 СтруктураВозврата.Ошибки.Добавить("Эту накладную не надо сканировать!");
		 Возврат СтруктураВозврата		
	 КонецЕсли;
	 
	 если НомерКоробки > накладная.КоличествоКоробок тогда
		 СтруктураВозврата.Ошибки.Добавить("Ошибка считывания ШК, попробуйте ещё раз отсканировать ШК");
		 Возврат СтруктураВозврата;
	 КонецЕсли;
	 
	 // Кухарь А.Ю.  07.09.2025 начало
	 если ЛистыНабора.НайтиСтроки(новый Структура("НомерНакладной,НомерКоробки",накладная.номер,НомерКоробки)).Количество()> 0 тогда 
		 СтруктураВозврата.Ошибки.Добавить(СтрШаблон("Коробка %1 от накладной %2 уже сканировалась в этот документ",НомерКоробки,накладная.номер));
	 КонецЕсли;
	 // Кухарь А.Ю.  07.09.2025 конец
	 
	 //Валетов + 20,01,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8534 
	 ЕстьПовторяющиесяСтроки = ЛистыНабора.НайтиСтроки(Новый Структура("НомерНакладной, ШККоробки", Накладная.Номер, ШК));
	 Если ЕстьПовторяющиесяСтроки.Количество()> 0 Тогда 
		 СтруктураВозврата.Ошибки.Добавить(СтрШаблон("Коробка с ШК %1 уже отсканирована в этот документ",ШК));
		 Возврат СтруктураВозврата
	 КонецЕсли;
	 //Валетов -  
	 
	 СтрЛистаНабора=ЛистыНабора.Добавить();
	 СтрЛистаНабора.ШККоробки=ШК;
	 СтрЛистаНабора.НомерКоробки=НомерКоробки;
	 СтрЛистаНабора.ВидНакладной=ВидНакладной;
	 СтрЛистаНабора.НомерНакладной=накладная.номер;
	 СтрЛистаНабора.ВремяСканирования=ТекущаяДата();
	 СтрЛистаНабора.Получатель=МассивСтрокЗаявки.получить(0).Получатель;
	 
	 СтрЛистаНабора.ПунктДоставки=МассивСтрокЗаявки.получить(0).ПунктДоставки;
	 СтрЛистаНабора.ДатаНакладной=накладная.дата;
	 СтрЛистаНабора.ШКПаллеты=ШКПаллеты;
	 
	 СтруктураВозврата.Успех=Истина;
	 возврат СтруктураВозврата;
 КонецФункции
 
 // Кухарь А.Ю. 03.05.2025 конец

#Область Чирков

//+++Чирков 25.05.2025       
Функция ОбновитьКоличестваРНКиЛН() Экспорт	 
	Данные = ПолучитьКоличестваРНКиЛН();
	
	КоличествоЛН		= Данные.КоличествоЛН;	
	КоличествоНакладных = Данные.КоличествоНакладных;
КонецФункции
	
Функция ПолучитьКоличестваРНКиЛН()	 
	Результат = Новый Структура("КоличествоЛН,КоличествоНакладных", 0, 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_ЛистыНабора ИЗ &ЛистыНабора КАК ЛистыНабора
	|;
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШККоробки) КАК Количество
	|ИЗ
	|	ВТ_ЛистыНабора
	|ГДЕ
	|	ШККоробки <> """"	
	|;
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НомерНакладной) КАК Количество
	|ИЗ
	|	ВТ_ЛистыНабора
	|ГДЕ
	|	НомерНакладной <> """"	
	|";
	
	Запрос.УстановитьПараметр("ЛистыНабора", ЛистыНабора);
	рЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка 	= рЗапроса[рЗапроса.ВГраница()-1].Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Количество) Тогда
		Результат.КоличествоЛН = Выборка.Количество;	
	КонецЕсли;
	Выборка 	= рЗапроса[рЗапроса.ВГраница()-0].Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Количество) Тогда
		Результат.КоличествоНакладных = Выборка.Количество;	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПолучитьКоличестваРНКиЛН()
//--Чирков 25.05.2025
	
#КонецОбласти 

 
 
 СписокДоступныхСостояний = Новый СписокЗначений;
 СписокДоступныхСостояний.Добавить(Перечисления.СостоянияНакладной.ВРаботе);
 СписокДоступныхСостояний.Добавить(Перечисления.СостоянияНакладной.ГотоваКОтгрузке);
 СписокДоступныхСостояний.Добавить(Перечисления.СостоянияНакладной.ВМашине);
 СписокДоступныхСостояний.Добавить(Перечисления.СостоянияНакладной.Отгружена);
 //СписокДоступныхСостояний.Добавить(Перечисления.СостоянияНакладной.ОтгруженаНаТранзитныйСклад);
 
 ЗаписыватьТолькоЗаявку = Ложь;
