
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СтруктураПроверки = ПроверитьЗаполненныеСуммыПолучателейПредложения();
	Если Состояние = Перечисления.СостоянияЗаявокНаДоставку.ОтправленоВТК И СтруктураПроверки.ФлагЗаполнено Тогда
		Состояние = Перечисления.СостоянияЗаявокНаДоставку.ПолученОтветОтТК;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("ДатаОтгрузки") Тогда
			Если ЗначениеЗаполнено(ДанныеЗаполнения.ДатаОтгрузки) Тогда
				ДатаОтгрузки = ДанныеЗаполнения.ДатаОтгрузки;
			КонецЕсли;
		КонецЕсли;
			
		Если ДанныеЗаполнения.Свойство("Автомобиль") Тогда
			Если ЗначениеЗаполнено(ДанныеЗаполнения.Автомобиль) Тогда
				Автомобиль = ДанныеЗаполнения.Автомобиль;
			КонецЕсли;
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("НомерХодки") Тогда
			Если ТипЗнч(ДанныеЗаполнения.НомерХодки) = Тип("Число") Тогда
				НомерХодки = ?(ДанныеЗаполнения.НомерХодки = 0, 0, ДанныеЗаполнения.НомерХодки);
			Иначе
				НомерХодки = 0;
			КонецЕсли;
		КонецЕсли;
		
		Состояние = Перечисления.СостоянияЗаявокНаДоставку.ВРаботе;
		
		Если ДанныеЗаполнения.Свойство("Накладные") Тогда
			Если (ТипЗнч(ДанныеЗаполнения.Накладные) = Тип("Массив") ИЛИ ТипЗнч(ДанныеЗаполнения.Накладные) = Тип("ТаблицаЗначений")) И
				ДанныеЗаполнения.Накладные.Количество() > 0 Тогда
					Накладные.Очистить();
					Для Каждого Стр ИЗ ДанныеЗаполнения.Накладные Цикл
						ЗаполнитьЗначенияСвойств(Накладные.Добавить(), Стр);						
					КонецЦикла;
			КонецЕсли;
		Иначе
			ОбновитьДанныеДокумента(ДанныеЗаполнения);
		КонецЕсли;
		
		ЗаполнитьПолучателейПредложений();
	
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаОтгрузку") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
		Состояние = Перечисления.СостоянияЗаявокНаДоставку.ВРаботе;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Накладные.Автомобиль КАК Автомобиль,
		|	Накладные.НомерХодки КАК НомерХодки,
		|	Накладные.ПорядковыйНомерОтгрузки КАК ПорядковыйНомерОтгрузки,
		|	Накладные.Накладная КАК Накладная,
		|	Накладные.Получатель КАК Получатель,
		|	ВЫБОР
		|		КОГДА Накладные.ВидНакладной = ""ПНК""
		|			ТОГДА Накладные.ПунктДоставкиОтправитель
		|		КОГДА Накладные.ВидНакладной = ""ЗТО""
		|				И (Накладные.Отправитель ССЫЛКА Справочник.Контрагенты
		|					ИЛИ Накладные.Отправитель.КодФизическогоУзла <> ""OD7"")
		|			ТОГДА Накладные.ПунктДоставкиОтправитель
		|		ИНАЧЕ Накладные.ПунктДоставкиПолучатель
		|	КОНЕЦ КАК ПунктДоставки,
		|	ВЫБОР
		|		КОГДА Накладные.ВидНакладной = ""ПНК""
		|			ТОГДА Накладные.АдресОтправитель
		|		КОГДА Накладные.ВидНакладной = ""ЗТО""
		|				И (Накладные.Отправитель ССЫЛКА Справочник.Контрагенты
		|					ИЛИ Накладные.Отправитель.КодФизическогоУзла <> ""OD7"")
		|			ТОГДА Накладные.АдресОтправитель
		|		ИНАЧЕ Накладные.АдресПолучатель
		|	КОНЕЦ КАК АдресПолучателя,
		|	Накладные.ДатаПриемки КАК ДатаПриемки,
		|	Накладные.ВремяПриемки КАК ВремяПриемки,
		|	Накладные.Количество КАК КоличествоНакладной,
		|	Накладные.СуммаДокумента КАК СуммаНакладной,
		|	Накладные.Объем КАК ОбъёмНакладной,
		|	Накладные.ВидНакладной КАК ВидНакладной
		|ИЗ
		|	Документ.ЗаявкаНаОтгрузку.Накладные КАК Накладные
		|ГДЕ
		|	Накладные.Ссылка = &ДанныеЗаполнения
		|	И (Накладные.Накладная.Склад ЕСТЬ NULL
		|			ИЛИ Накладные.Накладная.Проведен)
		|	И НЕ Накладные.НеОтгружать
		|
		|УПОРЯДОЧИТЬ ПО
		|	Автомобиль,
		|	НомерХодки,
		|	ПорядковыйНомерОтгрузки
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ДанныеЗаполнения", ДанныеЗаполнения);
		
		УстановитьПривилегированныйРежим(Истина);
		Выборка = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);
	    Накладные.Очистить();	
		
		Если Выборка.Количество() > 0 Тогда 			
			//Тимофеев Ю.А. начало 03.08.2023
			//нужно изменить адрес получателя
			//было
			//Пока Выборка.Следующий() Цикл
			//	ЗаполнитьЗначенияСвойств(Накладные.Добавить(),Выборка);
			//КонецЦикла;
			
			//замена
			
			Пока Выборка.Следующий() Цикл
				НакладныеНоваяСтрока=Накладные.Добавить();
				ЗаполнитьЗначенияСвойств(НакладныеНоваяСтрока,Выборка);
				НакладныеНоваяСтрока.АдресПолучателя=ЗаполнениеДокументов.ВернутьАдресПолучателяАП(Выборка.АдресПолучателя);
				
				//Тимофеев Ю.А. 10.08.2023 Начало   				
				НакладныеНоваяСтрока.ВремяРазгрузки             =ВернутьВремяПриемкиПоДокументу(Выборка.Накладная) ;				
				НакладныеНоваяСтрока.КоличествоПаллет           =Выборка.Накладная.КоличествоПаллет;
				НакладныеНоваяСтрока.КоличествоПаллетАвтомобиль =Выборка.Автомобиль.КоличествоПаллет;
				//Тимофеев Ю.А. 10.08.2023 Конец   				
			КонецЦикла;
		КонецЕсли;
		//Тимофеев Ю.А. конец 03.08.2023

		
		ЗаполнитьПолучателейПредложений();
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	// НАДО ПРИДУМАТЬ АЛГОРИТМ ПРОВЕДЕНИЯ ПО РЕГИСТРУ РаспределениеНакладныхПоЗаявкеНаДоставку
	
	Если Состояние = Перечисления.СостоянияЗаявокНаДоставку.Отработана Тогда
		
		Для Каждого Стр ИЗ Накладные Цикл
			
			Движение = Движения.РаспределениеНакладныхПоЗаявкеНаДоставку.Добавить();	
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;		
			Движение.Период = Дата;
			
			ЗаполнитьЗначенияСвойств(Движение, Стр);
			
		КонецЦикла;
		
		Если Движения.Количество() > 0 Тогда
			Движения.РаспределениеНакладныхПоЗаявкеНаДоставку.Записать(Истина);	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////////

Процедура ЗаполнитьПолучателейПредложений() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПолучателиУведомлений.Контрагент КАК Получатель,
	|	ВЫБОР
	|		КОГДА ПолучателиУведомлений.EMail = """"
	|			ТОГДА ВЫБОР
	|					КОГДА (ВЫРАЗИТЬ(ПолучателиУведомлений.Контрагент.ЕМэйл1 КАК СТРОКА(150))) = """"
	|						ТОГДА ПолучателиУведомлений.Контрагент.ЕМэйл2
	|					ИНАЧЕ ПолучателиУведомлений.Контрагент.ЕМэйл1
	|				КОНЕЦ
	|		ИНАЧЕ ПолучателиУведомлений.EMail
	|	КОНЕЦ КАК ЕмейлПолучателя
	|ИЗ
	|	Справочник.РассылкиЭлПочта.ПолучателиУведомлений КАК ПолучателиУведомлений
	|ГДЕ
	|	ПолучателиУведомлений.Ссылка.ТипРассылки = &ТипРассылки
	|	И ПолучателиУведомлений.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ТипРассылки", Справочники.ТипыРассылок.ПредложениеВТКПоДоставке);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	ПолучателиПредложения.Очистить();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ПолучателиПредложения.Добавить(),Выборка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьДанныеДокумента(ДанныеЗаполнения = Неопределено) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		ДанныеЗаполнения = Новый Структура;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаОтгрузки", НачалоДня(?(ДанныеЗаполнения.Свойство("ДатаОтгрузки"), ДанныеЗаполнения.ДатаОтгрузки, ДатаОтгрузки)));
	
	СписокНедопустимыхСостояний = Новый СписокЗначений;
	СписокНедопустимыхСостояний.Добавить(Перечисления.СостоянияНакладной.Отменена);
	Запрос.УстановитьПараметр("СписокНедопустимыхСостояний",СписокНедопустимыхСостояний);
	
	Запрос.УстановитьПараметр("КодФизическогоУзла", ПараметрыСеанса.ЭтотУзел.Код);
	
	ТекстАвтомобиль = "";
	Если ДанныеЗаполнения.Свойство("Автомобиль") ИЛИ ЗначениеЗаполнено(Автомобиль) Тогда
		ТекстАвтомобиль = "И Накладные.Автомобиль = &Автомобиль";
		Запрос.УстановитьПараметр("Автомобиль", ?(ДанныеЗаполнения.Свойство("Автомобиль"), ДанныеЗаполнения.Автомобиль, Автомобиль));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НомерХодки", ?(ДанныеЗаполнения.Свойство("НомерХодки"), ДанныеЗаполнения.НомерХодки, НомерХодки));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Накладные.Автомобиль КАК Автомобиль,
	|	Накладные.НомерХодки КАК НомерХодки,
	|	Накладные.Накладная КАК Накладная,
	|	Накладные.Получатель КАК Получатель,
	|   ВЫБОР
	|   	КОГДА Накладные.ВидНакладной = ""ПНК""
	|       	ТОГДА Накладные.ПунктДоставкиОтправитель
	|       КОГДА Накладные.ВидНакладной = ""ЗТО""
	|       		И (Накладные.Отправитель ССЫЛКА Справочник.Контрагенты
	|           		ИЛИ Накладные.Отправитель.КодФизическогоУзла <> ""OD7"")
	|       	ТОГДА Накладные.ПунктДоставкиОтправитель
	|       ИНАЧЕ Накладные.ПунктДоставкиПолучатель
	|   КОНЕЦ КАК ПунктДоставки,
	|	ВЫБОР
	|		КОГДА Накладные.ВидНакладной = ""ПНК""
	|			ТОГДА Накладные.АдресОтправитель
	|		КОГДА Накладные.ВидНакладной = ""ЗТО""
	|				И (Накладные.Отправитель ССЫЛКА Справочник.Контрагенты
	|					ИЛИ Накладные.Отправитель.КодФизическогоУзла <> ""OD7"")
	|			ТОГДА Накладные.АдресОтправитель
	|		ИНАЧЕ Накладные.АдресПолучатель
	|	КОНЕЦ КАК АдресПолучателя,
	|	Накладные.ДатаПриемки КАК ДатаПриемки,
	|	Накладные.ВремяПриемки КАК ВремяПриемки,
	|	Накладные.Количество КАК КоличествоНакладной,
	|	Накладные.СуммаДокумента КАК СуммаНакладной,
	|	Накладные.Объем КАК ОбъёмНакладной,
	|	Накладные.ВидНакладной КАК ВидНакладной,
	|	Накладные.ПорядковыйНомерОтгрузки КАК ПорядковыйНомерОтгрузки
	|ИЗ
	|	Документ.ЗаявкаНаОтгрузку.Накладные КАК Накладные
	|ГДЕ
	|	Накладные.Ссылка.ДатаОтгрузки = &ДатаОтгрузки
	|	" + ТекстАвтомобиль + "
	|	И Накладные.НомерХодки = &НомерХодки
	|	И Накладные.ВидНакладной <> ""ПНК""
	|	И (Накладные.ВидНакладной <> ""ЗТО""
	|			ИЛИ Накладные.ВидНакладной = ""ЗТО""
	|				И Накладные.Отправитель.КодФизическогоУзла = &КодФизическогоУзла)
	|	И НЕ Накладные.НеОтгружать
	|	И НЕ ЕСТЬNULL(Накладные.Накладная.СостояниеНакладной, Накладные.СостояниеНакладной) В (&СписокНедопустимыхСостояний)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Автомобиль,
	|	НомерХодки,
	|	ПорядковыйНомерОтгрузки
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
		
	Если Выборка.Количество() > 0 Тогда
		Накладные.Очистить();
				
		//Тимофеев Ю.А. начало 03.08.2023
		//нужно изменить адрес получателя
		//было
		//Пока Выборка.Следующий() Цикл
		//	ЗаполнитьЗначенияСвойств(Накладные.Добавить(),Выборка);
		//КонецЦикла;
		
		//замена
		
		Пока Выборка.Следующий() Цикл
			НакладныеНоваяСтрока=Накладные.Добавить();
			ЗаполнитьЗначенияСвойств(НакладныеНоваяСтрока,Выборка);
			НакладныеНоваяСтрока.АдресПолучателя=ЗаполнениеДокументов.ВернутьАдресПолучателяАП(Выборка.АдресПолучателя);
			НакладныеНоваяСтрока.ВремяРазгрузки =ВернутьВремяПриемкиПоДокументу(Выборка.Накладная) ;
			
			//Тимофеев Ю.А. 10.08.2023 Начало   				
			НакладныеНоваяСтрока.ВремяРазгрузки             =ВернутьВремяПриемкиПоДокументу(Выборка.Накладная) ;				
			НакладныеНоваяСтрока.КоличествоПаллет           =Выборка.Накладная.КоличествоПаллет;
			НакладныеНоваяСтрока.КоличествоПаллетАвтомобиль =Выборка.Автомобиль.КоличествоПаллет;
			//Тимофеев Ю.А. 10.08.2023 Конец   

		КонецЦикла;
		
		//Тимофеев Ю.А. конец 03.08.2023 
		
		
	КонецЕсли;
	
КонецПроцедуры


//Тимофеев Ю.А. 09.08.2023
//так измерения у регистра ДатаЗаписи и Основание
//чтобы ДатаЗаписи не повторялась 
//вернем свободную секунду
Функция ВернутьВремяПриемкиПоДокументу(Ссылка) 
	МенеджерЗаписи = РегистрыСведений.РеквизитыДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Документ=Ссылка;
	МенеджерЗаписи.ИмяРеквизита="ВремяПриемкиДляЗОГ"; 
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		Возврат МенеджерЗаписи.ЗначениеРеквизита	
	Иначе
		Возврат Справочники.ВремяПриемки.ПустаяСсылка();
	КонецЕсли;    	
КонецФункции	
//Тимофеев Ю.А. 09.08.2023


Функция ПроверитьЗаполненныеСуммыПолучателейПредложения(ПроверятьПредложениеПринято = Ложь) Экспорт
	
	СтруктураПроверки = Новый Структура("ФлагЗаполнено, СтрокаТЧ", Ложь, Неопределено);
	
	Для Каждого Стр ИЗ ПолучателиПредложения Цикл
		Если ПроверятьПредложениеПринято Тогда
			Если Стр.ПредложеннаяПолучателемСумма <> 0 И Стр.ПредложениеПринято Тогда
				СтруктураПроверки.Вставить("ФлагЗаполнено", Истина);
				СтруктураПроверки.Вставить("СтрокаТЧ", Стр);
				Прервать;
			КонецЕсли;
		Иначе
			Если Стр.ПредложеннаяПолучателемСумма <> 0 Тогда
				СтруктураПроверки.Вставить("ФлагЗаполнено", Истина);
				СтруктураПроверки.Вставить("СтрокаТЧ", Стр);
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураПроверки;
	
КонецФункции

Процедура ОтработатьЗаявку() Экспорт
	
	СтруктураПроверки = ПроверитьЗаполненныеСуммыПолучателейПредложения(Истина);
	
	Если СтруктураПроверки.ФлагЗаполнено И СтруктураПроверки.СтрокаТЧ <> Неопределено Тогда
		
		СогласованнаяСуммаДоставки = СтруктураПроверки.СтрокаТЧ.ПредложеннаяПолучателемСумма;
		ТранспортнаяКомпания = СтруктураПроверки.СтрокаТЧ.Получатель;
		Состояние = Перечисления.СостоянияЗаявокНаДоставку.Отработана;
		
		Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЕсли;
	
КонецПроцедуры

