
Перем мЭтоНовыйЭлемент;
Перем мМонопольныйРежимПередЗаписью;

Процедура ПриЗаписи(Отказ)
	
	СтрокаСообщенияПользователю = СообщитьИнформациюПользователюПослеСозданияНовогоУзла();
	
	#Если Клиент Тогда
	Сообщить(СтрокаСообщенияПользователю);
	#КонецЕсли
	
КонецПроцедуры

Функция СообщитьИнформациюПользователюПослеСозданияНовогоУзла() Экспорт
	
	НужноПерезапуститьВсеПодключенияКИБ = Ложь;
	
	Если мЭтоНовыйЭлемент 
		И НЕ мМонопольныйРежимПередЗаписью Тогда
		
		НужноПерезапуститьВсеПодключенияКИБ = Истина;
		
	КонецЕсли;	
	
	Если НужноПерезапуститьВсеПодключенияКИБ Тогда
		
		Если мМонопольныйРежимПередЗаписью Тогда
			
			ОпределитьПараметрыСеансаДляОбменаДанными();
			Возврат "";
			
		Иначе	
			
			Возврат "Для корректной работы механизма обмена данными необходимо завершить работу всех пользователей и перезапустить текущий сеанс работы 1С:Предприятия.";	
			
		КонецЕсли;
		
	Иначе
		
		Если мЭтоНовыйЭлемент Тогда
			
			ОпределитьПараметрыСеансаДляОбменаДанными();	
			
		КонецЕсли;
		
		Возврат "";
		
	КонецЕсли;
	
КонецФункции


Процедура ОпределитьПараметрыСеансаДляОбменаДанными() Экспорт
	//
	//Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();

	//Запрос.Текст = "
	//|ВЫБРАТЬ
	//|	Полный.Ссылка КАК Ссылка
	//|ИЗ
	//|	ПланОбмена.Полный КАК Полный
	//|ГДЕ
	//|	Полный.Ссылка <> &ЭтотУзелПолный
	//|;
	//|ВЫБРАТЬ
	//|	ОбменУправлениеТорговлейБухгалтерия.Ссылка                       КАК Ссылка,
	//|	ОбменУправлениеТорговлейБухгалтерия.ДатаНачалаВыгрузкиДокументов КАК ДатаНачалаВыгрузкиДокументов
	//|ИЗ
	//|	ПланОбмена.ОбменУправлениеТорговлейБухгалтерия КАК ОбменУправлениеТорговлейБухгалтерия
	//|ГДЕ
	//|	ОбменУправлениеТорговлейБухгалтерия.Ссылка <> &ЭтотУзелПоОрганизации
	//|;
	//|ВЫБРАТЬ
	//|	ОбменУправлениеТорговлейБухгалтерия.Ссылка КАК Ссылка,
	//|	ОбменУправлениеТорговлейБухгалтерия.ДатаНачалаВыгрузкиДокументов КАК ДатаНачалаВыгрузкиДокументов
	//|ИЗ
	//|	ПланОбмена.ОбменУправлениеТорговлейБухгалтерияКОРП КАК ОбменУправлениеТорговлейБухгалтерия
	//|ГДЕ
	//|	ОбменУправлениеТорговлейБухгалтерия.Ссылка <> &ЭтотУзелПоОрганизацииКОРП
	//|;
	//|";

	//Запрос.УстановитьПараметр("ЭтотУзелПолный", ПланыОбмена.Полный.ЭтотУзел());
	//Запрос.УстановитьПараметр("ЭтотУзелПоОрганизации", ПланыОбмена.ОбменУправлениеТорговлейБухгалтерия.ЭтотУзел());
	//Запрос.УстановитьПараметр("ЭтотУзелПоОрганизацииКОРП", ПланыОбмена.ОбменУправлениеТорговлейБухгалтерияКОРП.ЭтотУзел());

	//МассивРезультатЗапроса = Запрос.ВыполнитьПакет();
	//РезультатЗапросаИспользованиеРИБ = МассивРезультатЗапроса[0];
	//РезультатЗапроса = МассивРезультатЗапроса[1];
	//РезультатЗапросаКОРП = МассивРезультатЗапроса[2];

	//ПараметрыСеанса.ИспользованиеРИБ = НЕ РезультатЗапросаИспользованиеРИБ.Пустой();
	//ПараметрыСеанса.НаличиеОбменаТорговляБухгалтерия = НЕ РезультатЗапроса.Пустой();
	//ПараметрыСеанса.НаличиеОбменаТорговляБухгалтерияКОРП = НЕ РезультатЗапросаКОРП.Пустой();

	//Если ПараметрыСеанса.НаличиеОбменаТорговляБухгалтерия
	//	ИЛИ ПараметрыСеанса.НаличиеОбменаТорговляБухгалтерияКОРП Тогда

	//	ТаблицаОбменовУТБП = РезультатЗапроса.Выгрузить();
	//	ТаблицаОбменовУТБП.Индексы.Добавить("Ссылка");

	//	ТаблицаОбменовУТБПКОРП = РезультатЗапросаКОРП.Выгрузить();
	//	ТаблицаОбменовУТБПКОРП.Индексы.Добавить("Ссылка");

	//	МассивВсехУзлов = ТаблицаОбменовУТБП.ВыгрузитьКолонку("Ссылка");
	//	МассивВсехУзловКОРП = ТаблицаОбменовУТБПКОРП.ВыгрузитьКолонку("Ссылка");

	//	Если ПараметрыСеанса.НаличиеОбменаТорговляБухгалтерия Тогда
	//		СоответствиеУзловИОрганизаций = Новый Соответствие();
	//		СоответствиеУзловИСкладов = Новый Соответствие();
	//		СоответствиеУзловИПодразделений = Новый Соответствие();
	//		МассивУзловБезФильтраПоБухУчету = Новый Массив();
	//		МассивУзловДлярегистрацииИзмененийДокументов = Новый Массив();

	//		ПараметрыСеанса.СоответствиеУзловИДатДляОбменаБухгалтерияТорговля = Новый ХранилищеЗначения(ТаблицаОбменовУТБП);
	//		ПараметрыСеанса.ВсеУзлыОбменаТорговляБухгалтерия = Новый ФиксированныйМассив(МассивВсехУзлов);
	//		ПолучитьСоответствиеУзлов(СоответствиеУзловИОрганизаций, СоответствиеУзловИСкладов, СоответствиеУзловИПодразделений, МассивУзловБезФильтраПоБухУчету, МассивУзловДлярегистрацииИзмененийДокументов, "");

	//		ПараметрыСеанса.СоответствиеОрганизацийИУзловОбменаТорговляБухгалтерия = Новый ХранилищеЗначения(СоответствиеУзловИОрганизаций);
	//		ПараметрыСеанса.СоответствиеСкладовИУзловОбменаТорговляБухгалтерия = Новый ХранилищеЗначения(СоответствиеУзловИСкладов);
	//		ПараметрыСеанса.СоответствиеПодразделенийИУзловОбменаТорговляБухгалтерия = Новый ХранилищеЗначения(СоответствиеУзловИПодразделений);
	//		ПараметрыСеанса.УзлыДляОбменаТорговляБухгалтерияБезОтбораПоОтражениюВБухУчете = Новый ФиксированныйМассив(МассивУзловБезФильтраПоБухУчету);
	//		ПараметрыСеанса.УзлыДляОбменаТорговляБухгалтерияРегистрацияДокументовПриДвиженииПартий = Новый ФиксированныйМассив(МассивУзловДлярегистрацииИзмененийДокументов);
	//	КонецЕсли;
	//	Если ПараметрыСеанса.НаличиеОбменаТорговляБухгалтерияКОРП Тогда
	//		СоответствиеУзловИОрганизаций = Новый Соответствие();
	//		СоответствиеУзловИСкладов = Новый Соответствие();
	//		СоответствиеУзловИПодразделений = Новый Соответствие();
	//		МассивУзловБезФильтраПоБухУчету = Новый Массив();
	//		МассивУзловДлярегистрацииИзмененийДокументов = Новый Массив();

	//		ПараметрыСеанса.СоответствиеУзловИДатДляОбменаБухгалтерияКОРПТорговля = Новый ХранилищеЗначения(ТаблицаОбменовУТБПКОРП);
	//		ПараметрыСеанса.ВсеУзлыОбменаТорговляБухгалтерияКОРП = Новый ФиксированныйМассив(МассивВсехУзловКОРП);
	//		ПолучитьСоответствиеУзлов(СоответствиеУзловИОрганизаций, СоответствиеУзловИСкладов, СоответствиеУзловИПодразделений, МассивУзловБезФильтраПоБухУчету, МассивУзловДлярегистрацииИзмененийДокументов, "КОРП");

	//		ПараметрыСеанса.СоответствиеОрганизацийИУзловОбменаТорговляБухгалтерияКОРП = Новый ХранилищеЗначения(СоответствиеУзловИОрганизаций);
	//		ПараметрыСеанса.СоответствиеСкладовИУзловОбменаТорговляБухгалтерияКОРП = Новый ХранилищеЗначения(СоответствиеУзловИСкладов);
	//		ПараметрыСеанса.СоответствиеПодразделенийИУзловОбменаТорговляБухгалтерияКОРП = Новый ХранилищеЗначения(СоответствиеУзловИПодразделений);
	//		ПараметрыСеанса.УзлыДляОбменаТорговляБухгалтерияБезОтбораПоОтражениюВБухУчетеКОРП = Новый ФиксированныйМассив(МассивУзловБезФильтраПоБухУчету);
	//		ПараметрыСеанса.УзлыДляОбменаТорговляБухгалтерияРегистрацияДокументовПриДвиженииПартийКОРП = Новый ФиксированныйМассив(МассивУзловДлярегистрацииИзмененийДокументов);
	//	КонецЕсли;

	//КонецЕсли;

	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	ОбменУправлениеПредприятиемУправлениеТорговлей.Ссылка,
	//			   |	ОбменУправлениеПредприятиемУправлениеТорговлей.ДатаНачалаВыгрузкиДокументов КАК ДатаНачалаВыгрузкиДокументов
	//			   |ИЗ
	//			   |	ПланОбмена.ОбменУправлениеПредприятиемУправлениеТорговлей КАК ОбменУправлениеПредприятиемУправлениеТорговлей
	//			   |ГДЕ
	//			   |	ОбменУправлениеПредприятиемУправлениеТорговлей.Ссылка <> &ОбменУправлениеПредприятиемУправлениеТорговлей";
	//			   
	//Запрос.УстановитьПараметр("ОбменУправлениеПредприятиемУправлениеТорговлей", ПланыОбмена.ОбменУправлениеПредприятиемУправлениеТорговлей.ЭтотУзел());
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ЕстьУзлыОбменаУТУПП = НЕ РезультатЗапроса.Пустой();
	//
	//ПараметрыСеанса.НаличиеОбменаУТУПП = ЕстьУзлыОбменаУТУПП;
	//
	//Если ЕстьУзлыОбменаУТУПП Тогда
	//	
	//	ТаблицаОбменовУТУПП = РезультатЗапроса.Выгрузить();
	//	ТаблицаОбменовУТУПП.Индексы.Добавить("Ссылка");
	//	
	//	ПараметрыСеанса.СоответствиеУзловИДатДляОбменаУТУПП = Новый ХранилищеЗначения(ТаблицаОбменовУТУПП);
	//	
	//	МассивВсехУзлов = ПроцедурыОбменаУТУПП.ПолучитьМассивВсехУзлов();
	//	ПараметрыСеанса.ВсеУзлыОбменаУТУПП = Новый ФиксированныйМассив(МассивВсехУзлов);	
	//	
	//	Запрос.Текст = "ВЫБРАТЬ
	//				   |	Организации.Ссылка КАК Ссылка
	//				   |ИЗ
	//				   |	Справочник.Организации КАК Организации";
	//	МассивОрганизаций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");			   
	//	МассивОрганизаций.Добавить(Справочники.Организации.ПустаяСсылка());
	//			
	//	СоответствиеУзловИОрганизаций = Новый Соответствие;			   
	//				   
	//	Для Каждого Организация ИЗ МассивОрганизаций Цикл
	//		
	//		МассивУзлов = ПроцедурыОбменаУТУПП.ПолучитьЗапросомМассивУзловПоОрганизации(Организация);
	//		СоответствиеУзловИОрганизаций.Вставить(Организация, МассивУзлов);
	//					
	//	КонецЦикла;		
	//			
	//	ПараметрыСеанса.СоответствиеОрганизацийИУзловОбменаУТУПП = Новый ХранилищеЗначения(СоответствиеУзловИОрганизаций);		
	//	
	//КонецЕсли;	
	//
	//ПараметрыСеанса.ПрефиксУзлаРаспределеннойИнформационнойБазы = Константы.ПрефиксУзлаРаспределеннойИнформационнойБазы.Получить();	
	
	
	// обмен с сайтом
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбменССайтомТоварами.Ссылка КАК Ссылка
	               |ИЗ
	               |	ПланОбмена.ОбменССайтомТоварами КАК ОбменССайтомТоварами
	               |ГДЕ
	               |	(ОбменССайтомТоварами.Ссылка <> &ЭтотУзел)	
				   |";
				   
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ОбменССайтомТоварами.ЭтотУзел());
	МассивУзловДляОбменаССайтомТоварами = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	ПараметрыСеанса.ВсеУзлыДляОбменаССайтомТоварами = Новый ФиксированныйМассив(МассивУзловДляОбменаССайтомТоварами);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбменССайтомЗаказами.Ссылка КАК Ссылка
	               |ИЗ
	               |	ПланОбмена.ОбменССайтомЗаказами КАК ОбменССайтомЗаказами
	               |ГДЕ
	               |	(ОбменССайтомЗаказами.Ссылка <> &ЭтотУзел)	
				   |";
				   
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ОбменССайтомЗаказами.ЭтотУзел());
	МассивУзловДляОбменаССайтомЗаказами = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	ПараметрыСеанса.ВсеУзлыДляОбменаССайтомЗаказами = Новый ФиксированныйМассив(МассивУзловДляОбменаССайтомЗаказами);	
	
	ПараметрыСеанса.НаличиеОбменаССайтом = (МассивУзловДляОбменаССайтомТоварами.Количество() + МассивУзловДляОбменаССайтомЗаказами.Количество() > 0);
	
	//обмен с розничной торговлей
	//УстановитьПараметрыСеансаДляОбменаСРозничнойТорговлей();
	
	//параметрыСеанса.СохранятьИнформациюОМестеСозданияОбъектов = Константы.СохранятьИнформациюОМестеСозданияОбъектов.Получить();	
	
КонецПроцедуры



Процедура ПередЗаписью(Отказ)
	
	мЭтоНовыйЭлемент = ЭтоНовый();
	
	мМонопольныйРежимПередЗаписью = Ложь; //ОбщегоНазначения.ОпределитьТекущийРежимРаботыМонопольный();  +++
	
КонецПроцедуры
