
Функция ПолучитьПараметры(Док)
	Запрос = Новый запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеквизитыДокументов.ЗначениеРеквизита,
	|	РеквизитыДокументов.ИмяРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыДокументов КАК РеквизитыДокументов
	|ГДЕ
	|	РеквизитыДокументов.Документ = &Документ";
	Запрос.УстановитьПараметр("Документ", Док);
	выборка = Запрос.Выполнить().Выбрать();
	ст = Новый Структура("КоличествоКоробок, ОбъемКоробов");
	Пока Выборка.Следующий() Цикл
		ст.Вставить(Выборка.ИмяРеквизита, Выборка.ЗначениеРеквизита);
	КонецЦикла;
	Возврат ст;
КонецФункции

Функция ПолучитьСтрокуМатрицыКонтрагента (Номенклатура,Док)     Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МатрицаТовары.Ссылка,
	               |	МатрицаТовары.НомерСтроки,
	               |	МатрицаТовары.Номенклатура,
	               |	МатрицаТовары.ШККонтрагента,
	               |	МатрицаТовары.АртикулКонтрагента,
	               |	МатрицаТовары.Цена,
	               |	МатрицаТовары.Кратность,
	               |	МатрицаТовары.МинимальноеКоличество,
	               |	МатрицаТовары.ЦенаПосредника,
	               |	МатрицаТовары.Этикетка1,
	               |	МатрицаТовары.Этикетка2,
	               |	МатрицаТовары.Этикетка3,
	               |	МатрицаТовары.Этикетка4,
	               |	МатрицаТовары.Этикетка5,
	               |	МатрицаТовары.ШККонтрагентаБлочок,
	               |	МатрицаТовары.ШККонтрагентаКоробка,
	               |	МатрицаТовары.КратностьКоробки,
	               |	МатрицаТовары.НаименованиеКонтрагента,
	               |	МатрицаТовары.КодПроизводителяКонтрагента,
	               |	МатрицаТовары.ЦенаБезНДС,
	               |	МатрицаТовары.ШКСпайки
	               |ИЗ
	               |	Документ.Матрица.Товары КАК МатрицаТовары
	               |ГДЕ
	               |	МатрицаТовары.Ссылка.Дата <= &Дата
	               |	И МатрицаТовары.Ссылка.Проведен
	               |	И МатрицаТовары.Ссылка.ДатаОкончания >= &ДатаОкончания
	               |	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
	               |	И МатрицаТовары.Номенклатура В ИЕРАРХИИ(&Номенклатура)
	               |АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("Дата",Док.Дата);
	Запрос.УстановитьПараметр("ДатаОкончания",Док.Дата);
	Запрос.УстановитьПараметр("Контрагент",Док.Контрагент);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	результат=запрос.Выполнить().Выгрузить();
	Возврат результат;
	
КонецФункции	
