Перем НачСостНакладной;
Перем НеКонтролироватьЗапись;
Перем НеКонтролироватьТА;
//Катаев+ 06/10/14
Перем НужноВыгружать;
//Катаев- 06/10/14



Процедура ПровестиПоВзаиморасчетам(Записывать=Ложь) Экспорт
	
	Если СостояниеНакладной=Перечисления.СостоянияНакладной.Доставлена Тогда
		ДвиженияПоВзаиморасчетам=Неопределено;
		РезультатПроведения=ПроведениеПоРегистрамВзаиморасчетов(Ссылка,ДвиженияПоВзаиморасчетам);
		ВыполнитьДвиженияПоРегистрам(ДвиженияПоВзаиморасчетам,Записывать);
	КонецЕсли;
	
КонецПроцедуры 

Процедура СформироватьДвиженияПоЗатратам(ТС) Экспорт
	
	//Списываем сертификаты-подарки и чудо ЕЕ из чека	
	ТС.Свернуть("Номенклатура","Количество,СписанаСтоимость");
	
	ВалютаУпр=Константы.ВалютаУпрУчета_2009.Получить();
	
	Для Каждого СтрокаТЧ Из ПодарочныеСертификаты Цикл
		Если СтрокаТЧ.Сертификат.Подарок Тогда						
			Движение=Движения.Затраты.Добавить();
			
			Движение.Период			= Дата;
			
			Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;
			
			Если ЗначениеЗаполнено(СтрокаТЧ.Сертификат.ПодразделениеЗатрат) Тогда
				Движение.Подразделение	= СтрокаТЧ.Сертификат.ПодразделениеЗатрат;
			ИначеЕсли ЗначениеЗаполнено(СтрокаТЧ.Сертификат.Акция.ПодразделениеЗатрат) Тогда
				Движение.Подразделение	= СтрокаТЧ.Сертификат.Акция.ПодразделениеЗатрат;
			Иначе
				Движение.Подразделение	= Подразделение;			
			КонецЕсли;
			//крохин начало
			Если Дата >= '20090901' Тогда
				Если ЗначениеЗаполнено(СтрокаТЧ.Сертификат.Акция) Тогда
					Движение.СтатьяЗатрат	= СтрокаТЧ.Сертификат.Акция.СтатьяЗатрат;
				Иначе
					//реклама и продвижение продаж в магазинах
					Движение.СтатьяЗатрат   = Справочники.СтатьиЗатрат.НайтиПоКоду("320 520");
				КонецЕсли;
			иначе
				Движение.СтатьяЗатрат	= Справочники.СтатьиЗатрат.ПустаяСсылка();
			КонецЕсли;
			Если Дата > '20100101' Тогда
				СуммаСписания = СтрокаТЧ.СуммаОплатыСертификатами;//РассчитатьСуммуСебестоимостиПоПродажеИМ(ТС,СтрокаТЧ);
				Движение.СуммаУпр		= СуммаСписания;//СтрокаТЧ.СуммаОплатыСертификатами;	
				
				Движение.СуммаДокумента	= СуммаСписания;//СтрокаТЧ.СуммаОплатыСертификатами;
			Иначе
				Движение.СуммаДокумента	= СтрокаТЧ.СуммаОплатыСертификатами;
				Движение.СуммаУпр		= СтрокаТЧ.СуммаОплатыСертификатами;
			КонецЕсли;
			Если Дата > '20100101' Тогда 
				Движение.СубЗатрата = Справочники.СубЗатраты.НайтиПоКоду("SNL-00011");
			КонецЕсли;
			//крохин конец
			Движение.ВалютаДокумента= ВалютаУпр;
			
			//крохин начало
			Движение.Комментарий        = "оплата бонусом интернет-магазина";
			//крохин конец
			
			
			Движение.ДатаЗаписи		= ТекущаяДата();			
		КонецЕсли;		
	КонецЦикла;
	
	
	
	
	Если КодОперации = Перечисления.КодыОперацийОстатки.ВозвратПоставщику Тогда
		//ТС.Свернуть("Номенклатура","Количество,СписанаСтоимость");
		//
		////списания по акциям
		//ТЗ=Новый ТаблицаЗначений;
		//ТЗ.Колонки.Добавить("Подразделение");
		//ТЗ.Колонки.Добавить("СтатьяЗатрат");
		//
		//ТЗ.Колонки.Добавить("СуммаУпр",ПолучитьОписаниеТиповЧисла(19,2));		
		//Для Каждого СтрокаТЧ Из Товары Цикл	
		//	СтрокаТС=ТС.Найти(СтрокаТЧ.Номенклатура,"Номенклатура");			
		//	
		//	Если СтрокаТС<>Неопределено И СтрокаТС.Количество<>0 Тогда				
		//		СтрокаТЗ=ТЗ.Добавить();							
		//		СтрокаТЗ.СуммаУпр		= Окр(СтрокаТЧ.Всего - СтрокаТЧ.Количество*СтрокаТС.СписанаСтоимость/СтрокаТС.Количество,2);
		//		СтрокаТЗ.СтатьяЗатрат	= Справочники.СтатьиЗатрат.Конвертация;//ошибки ценообразования
		//		СтрокаТЗ.Подразделение	= Подразделение;
		//		
		//	КонецЕсли;			
		//	
		//КонецЦикла;
		//
		//ТЗ.Свернуть("Подразделение,СтатьяЗатрат","СуммаУпр");
		//Для Каждого СтрокаТЗ Из ТЗ Цикл		
		//	Если СтрокаТЗ.СуммаУпр = 0 Тогда Продолжить КонецЕсли;
		//	Движение=Движения.Затраты.Добавить();
		//	
		//	Движение.Период			= Дата;
		//	
		//	Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;		
		//	
		//	Движение.Подразделение	= СтрокаТЗ.Подразделение;			
		//	Движение.СтатьяЗатрат	= СтрокаТЗ.СтатьяЗатрат;
		//	
		//	Движение.СуммаУпр		= СтрокаТЗ.СуммаУпр;	
		//	
		//	Движение.СуммаДокумента	= СтрокаТЗ.СуммаУпр;
		//	Движение.ВалютаДокумента= ВалютаУпр;
		//	
		//	//крохин начало
		//	Движение.Комментарий        = "возврат поставщику";
		//	//крохин конец
		//	
		//	Движение.ДатаЗаписи		= ТекущаяДата();
		//КонецЦикла; 
	Иначе	
		//услуги
		Для Каждого СтрокаТЧ Из Услуги Цикл	
			Если ПолучитьРеквизитРодителя(СтрокаТЧ.Номенклатура,"ВидНоменклатуры") =  Перечисления.ВидыНоменклаутры.Услуга Тогда
				Если СтрокаТЧ.Всего = 0 Тогда Продолжить КонецЕсли;
				Движение=Движения.Затраты.Добавить();
				
				Движение.Период			= Дата;
				
				Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;		
				
				Движение.Подразделение	= Подразделение;			
				Движение.СтатьяЗатрат	= Справочники.СтатьиЗатрат.НайтиПоКоду("212 000");
				
				Движение.СуммаУпр		= СтрокаТЧ.Всего;	
				
				Движение.СуммаДокумента	= СтрокаТЧ.Всего;
				Движение.ВалютаДокумента= ВалютаУпр;
				
				//крохин начало
				Движение.Комментарий        = СтрокаТЧ.Номенклатура.Наименование;
				//крохин конец
				
				Движение.ДатаЗаписи		= ТекущаяДата();
			КонецЕсли;
		КонецЦикла;
	Конецесли;	
	
	
	Если ОбменДанными.Загрузка Тогда
		Движения.Затраты.Записать();	
	КонецЕсли;
	
КонецПроцедуры



Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,Записывать=Ложь) Экспорт 
	Для Каждого НаборДвижений Из ДвиженияПоРегистрам Цикл
		ИмяРегистра		=НаборДвижений.Ключ;
		ТаблицаДвижения =НаборДвижений.Значение;
		
		Если Движения.Найти(ИмяРегистра)=Неопределено Тогда Возврат  КонецЕсли; 
		
		НаборЗаписей=Движения[ИмяРегистра];		
		НаборЗаписей.Очистить();
		
		Для Каждого Движение Из ТаблицаДвижения Цикл
			Запись=НаборЗаписей.Добавить();	
			ЗаполнитьЗначенияСвойств(Запись,Движение);	
			
			Запись.Регистратор=Ссылка;
		КонецЦикла;	
	КонецЦикла;	
КонецПроцедуры 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)  экспорт 
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	Отказ=Ложь;
	ДвиженияПоРегистрам=Неопределено;
	ТаблицаСписания=неопределено;
	
	РезультатПроведения=ПроведениеПоРегистрамОстатков(Ссылка,ДвиженияПоРегистрам,,ТаблицаСписания);	
	Результат=РезультатПроведения["Результат"];
	
	#Если Клиент Тогда
		Если Результат<0 Тогда		
			Отказ=Не(ПолучитьПолномочиеПользователя("СписыватьВМинус"));		
			ВывестиТрассировку(РезультатПроведения["ТОшибок"],?(Отказ,-2,Результат));			
		КонецЕсли; 
		
	#КонецЕсли
	
	//Если Результат<0 Тогда		
	//	Отказ=Истина;		
	//КонецЕсли; 
	
	Если НЕ Отказ Тогда
		ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,ОбменДанными.Загрузка);	
		
		Если СостояниеНакладной=Перечисления.СостоянияНакладной.Доставлена Тогда
			ДвиженияПоВзаиморасчетам=Неопределено;
			
			СформироватьДвиженияПоЗатратам(ТаблицаСписания);
			
			РезультатПроведения=ПроведениеПоРегистрамВзаиморасчетов(Ссылка,ДвиженияПоВзаиморасчетам);
			ВыполнитьДвиженияПоРегистрам(ДвиженияПоВзаиморасчетам,ОбменДанными.Загрузка);
		КонецЕсли;		
		
	КонецЕсли; 
	
	//Мессерле 05,05,12 - фиг его знает надо ли вообще
	для каждого стр из товары цикл
		Если стр.Номенклатура=справочники.Номенклатура.НайтиПоКоду("SNL-288462") тогда //Под.серт.ИМ 9999
			ДвижОстатки=Движения.ОстаткиТМЦ.ДобавитьРасход();
			движостатки.Количество=стр.Количество;
			движостатки.КодОперации=перечисления.КодыОперацийОстатки.Реализация;
			движостатки.Подразделение=Подразделение;
			движостатки.Склад=Склад;
			движостатки.Номенклатура=стр.Номенклатура;
			движостатки.Отправитель=контрагент;
			движостатки.Период=дата;
			движостатки.Регистратор=ссылка;
		Конецесли;
	Конеццикла;

   	
	
	 Если ОбменДанными.Загрузка Тогда
          Движения.Взаиморасчеты.Записать();
          Движения.Затраты.Записать();
		  Движения.ОстаткиТМЦ.Записать();
		  Движения.Профит.Записать();
		  Движения.РезервыТМЦ.Записать();
     КонецЕсли;
	
	
КонецПроцедуры





Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если ЭтоНовый() И Организация.Пустая() И НЕ Склад.Пустая() И НЕ Склад.Организация.Пустая() Тогда
		Организация=Склад.Организация;
	КонецЕсли;
	
	Если ЭтоНовый() или СтатьяЗатрат.Пустая() или ТранзитныйСклад.Пустая() Тогда
		СтатьяЗатрат=Справочники.СтатьиЗатрат.НайтиПоКоду("320 520");
		ТранзитныйСклад=Справочники.Склады.НайтиПоКоду("SSR-49");
		ВидОплаты=перечисления.ВидыОплаты.БН;
	КонецЕсли;
	
	Если видОплаты=перечисления.ВидыОплаты.НАЛ Тогда
		ВидОплаты=перечисления.ВидыОплаты.БН;
	КонецЕсли;
	
	
	ЕстьИзменения = Модифицированность();
	
	//Если НЕ ОбменДанными.Загрузка Тогда		
	//	  КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
	//	МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
	//	МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);
	//КонецЕсли;	
	
	Если Отказ Тогда Возврат КонецЕсли;	
	
	//Если НЕ ЕстьИзменения Тогда Возврат КонецЕсли;	
	//крохин начало 17.02.2012
	//СуммаДокумента				= Товары.Итог("Всего")+Услуги.Итог("Всего")-СуммаБонуса;	
	СуммаДокумента              =  Товары.Итог("Всего")+Услуги.Итог("Всего")-СуммаБонуса-СуммаОплатыСертификатом;
	//крохин конец 17.02.2012
	ОбъемДокумента				= Товары.Итог("Объем");
	КоличествоДокумента 		= Товары.Итог("Количество")+услуги.Итог("Количество");
	ГруппыТоваров				= ГруппыТоваровДокумента(ЭтотОбъект);	
	
	
	
	//ищем признак скидки на первый заказ при загрузке и перезаписываем цены. ставим скидку 10 %
	//
	Скидка10=Справочники.Номенклатура.НайтиПоКоду("SNL-232812");
	ПоискСкидки=Услуги.Найти(Скидка10,"Номенклатура");
	
	Если ПоискСкидки <> Неопределено Тогда
		// проставляем скидку удаляем строку
		Для каждого ТекСтрока из Товары Цикл
			
			Если ТекСтрока.Номенклатура.Код="SNL-096562" или (ТекСтрока.Номенклатура.Код="SNL-095774") или (ТекСтрока.Номенклатура.Код="SNL-096577") или (ТекСтрока.Номенклатура.Код="SNL-096561") 
				или (ТекСтрока.Номенклатура.Код="SNL-231090") Тогда
				ТекСтрока.Скидка=-1;
			Иначе
				ТекСтрока.Скидка=10;
			КонецЕсли;
			РассчитатьСуммуТабЧасти(ТекСтрока, ЭтотОбъект);
			
		КонецЦикла;	
		//удаляем строку
		НомерСтроки=ПоискСкидки.НомерСтроки;
		Услуги.Удалить(НомерСтроки-1);
		
	КонецЕсли;
	
	//крохин начало 17.02.2012
	//деактивация электронного сертификата
	Если СостояниеНакладной = Перечисления.СостоянияНакладной.Доставлена Тогда
	Если НЕ ЭлектронныйСертификат.Пустая() И НЕ ЭлектронныйСертификат.Использован Тогда
		ЭлектронныйСертификатОбъект = ЭлектронныйСертификат.ПолучитьОбъект();
		ЭлектронныйСертификатОбъект.ДатаПогашения = Дата;
		ЭлектронныйСертификатОбъект.ДокументПогашения = Ссылка;
		ЭлектронныйСертификатОбъект.Использован = Истина;
		ЭлектронныйСертификатОбъект.Записать();
	КонецЕсли;	
	КонецЕсли;
	//крохин конец 17.02.2012
	
	//крохин начало 30.05.2012
	//запретим записывать документ началом дня
	Если Дата >= '20120501' И Дата = НачалоДня(Дата) Тогда
	Дата = Дата + 1;	
	КонецЕсли;
	//крохин конец 30.05.2012

		
	//ЗаписатьВЛог("ОбменССайтом",""+РежимЗаписи+" "+СостояниеНакладной+" проведен - "+Проведен,"");
	ЕстьИзменения		=Модифицированность();	
	НужноВыгружать		=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	
	Если НЕ ОбменДанными.Загрузка Тогда		
		Если НеКонтролироватьЗапись Тогда
		Иначе
			КонтрольДатыЗапрета(ЭтотОбъект,Отказ);			
			МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
			МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		КонецЕсли;		
		
		Если Отказ Тогда Возврат КонецЕсли; 
		
	КонецЕсли;	
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
		//Катаев+ 08/10/14
		Если Не ЭтотОбъект.Ссылка.Пустая() Тогда
			НужноВыгружать = Ложь;
		КонецЕсли;
		//Катаев- 08/10/14
	КонецЕсли;
	
	
	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс) Экспорт
	
	//УстановитьНомерДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	
КонецПроцедуры

//Катаев+ 08/10/14
Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если НужноВыгружать Тогда
		ЗанестиФилиалыВРегистрПолучателей(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры
//Катаев- 08/10/14

НеКонтролироватьЗапись	=Ложь;
НеКонтролироватьТА		=Ложь;


