Функция ИнициализироватьКомпонентуОбмена(АдресСервера,Направление,Пользователь,Пароль,ИмяСобытияЖР,ДопПараметры = Неопределено) Экспорт
	Результат 			= Ложь;
	ОшибкиПодключения	= "";
	Ошибки				= Новый Массив;
	
	ВыводитьСообщения	= ФР_ОбщегоНазначения.ПолучитьЗначениеПараметра(ДопПараметры,"ВыводитьСообщения",Ложь);
	
	КомпонентаОбмена = ФР_ОбщегоНазначения_КС.ПодключитьКомпонентуОбмена(ОшибкиПодключения,Направление);
	Если КомпонентаОбмена=Неопределено Тогда
		ТекстСообщения	= "Ошибка загрузки компоненты обмена. "+ОшибкиПодключения;
		Ошибки.Добавить(ТекстСообщения);
		ЗаписатьВЛог("Обмен с ФР",ТекстСообщения,"Ошибка",Истина); 
		СообщитьПользователю(ТекстСообщения,ВыводитьСообщения);
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Ошибка,,,ТекстСообщения);	
	Иначе
		Попытка	
			ЕстьКонтакт	= КомпонентаОбмена.УстановитьСоединение(АдресСервера,Пользователь,Пароль);		
		Исключение
			Ошибки.Добавить(ОписаниеОшибки());		
		КонецПопытки;
		
		Если ЕстьКонтакт Тогда		
			ТекстСообщения	= "Установлено соединение с сервером: "+АдресСервера+".";
			ЗаписатьВЛог("Обмен с ФР",ТекстСообщения,"Информация",Истина); 
			СообщитьПользователю(ТекстСообщения,ВыводитьСообщения);
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Информация,,,ТекстСообщения);			
			Результат = Истина;			
		Иначе
			Ошибки	= "Невозможно установить соединение с сервером: "+АдресСервера+", пользователь: "+Пользователь+".";
			ЗаписатьВЛог("Обмен с ФР",Ошибки,"Ошибка",Истина); 
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Ошибка,,,Ошибки);		
		КонецЕсли;		
	КонецЕсли;	
	
	Возврат Новый Структура("Результат,КомпонентаОбмена,Ошибки",Результат,КомпонентаОбмена,Ошибки);
КонецФункции //ИнициализироватьКомпонентуОбмена(АдресОчереди,Пользователь,Пароль)
 
Функция ПолучитьСообщение(КомпонентаОбмена,ОбработкаКонвертации,ДопПараметры=Неопределено)
	Результат		= Новый Структура("Результат,РазмерСообщения,Ошибки,Протокол,НомерДоставки,Заглушка,НетСообщений",Ложь,0,Новый Массив,Неопределено,0,Ложь,Истина);
	
	ИмяПроцедуры	= "ЦиклОбменаДанными";
	НомерДоставки	= 0;
	Сообщение		= КомпонентаОбмена.ПрочитатьСообщение(НомерДоставки);
	
	ВыводитьСообщения	= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(ДопПараметры,"ВыводитьСообщения",Ложь);
	
	Начало	= ТекущаяДата();
	
	Если НомерДоставки < 0 Тогда
		Результат.Ошибки.Добавить(КомпонентаОбмена.ПолучитьОшибку());
	ИначеЕсли НомерДоставки = 0 Тогда
		Результат.НетСообщений=Истина;		
	ИначеЕсли НомерДоставки > 0 Тогда
		СообщениеСтрокой	= ПолучитьСтрокуИзДвоичныхДанных(Сообщение);
		
		Если СообщениеСтрокой<>"Заглушка" Тогда		
			ТекстЖР	= "Получено сообщение: "+НомерДоставки+" "+ТекущаяДата();
			ЗаписьЖурналаРегистрации(ИмяПроцедуры, УровеньЖурналаРегистрации.Информация,,,ТекстЖР);	
			
			Протокол	= ОбработкаКонвертации.ПрочитатьДанныеСообщения(СообщениеСтрокой,ДопПараметры);		
			Ошибки		= Протокол.Ошибки;
			
			Если Ошибки.Количество()>0 Тогда
				ТекстОшибок	= СтрСоединить(Ошибки,Символы.ПС);
				СообщитьПользователю("Возникли ошибки при загрузке данных: "+Символы.ПС+ТекстОшибок,ВыводитьСообщения);
				ЗаписьЖурналаРегистрации(ИмяПроцедуры, УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибок);
				
				Результат.Ошибки	= Ошибки;
			Иначе
				Результат.Результат	= Истина;			
			КонецЕсли; 
		Иначе
			СообщитьПользователю("Получена заглушка.",ВыводитьСообщения);
			
			Протокол			= Неопределено;
			Результат.Результат	= Истина;
			Результат.Заглушка	= Истина;			
		КонецЕсли;
		
		КомпонентаОбмена.ПодтвердитьЧтение(НомерДоставки);		
		
		Результат.РазмерСообщения	= Сообщение.Размер();
		Результат.Протокол			= Протокол;
		Результат.НомерДоставки     = НомерДоставки;	
		Результат.НетСообщений		= Ложь;
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции

Функция ПолучитьОбработкуОбмена() Экспорт
	ИмяФайла	= ФР_ОбщегоНазначения_ПИ.КаталогВнешнихОтчетов();
	ИмяФайла	= ИмяФайла	+ "ВыгрузкаВоФранчБазу.epf";
	
	Файл	= Новый Файл(ИмяФайла);
	Если Файл.Существует() Тогда
		ООЗДц		= Новый ОписаниеЗащитыОтОпасныхДействий;
		ООЗДц.ПредупреждатьОбОпасныхДействиях=Ложь;
		Обработка	= ВнешниеОбработки.Создать(ИмяФайла,Ложь,ООЗДц);		
	Иначе
		Обработка	= Обработки.ВыгрузкаВоФранчБазу.Создать();
	КонецЕсли;
	
	Возврат Обработка;
КонецФункции //ПолучитьОбработкуОбмена()

Функция ЗапуститьФЗ_Обмена(ИмяПланаОбмена,Направление,ДопПараметры=Неопределено) Экспорт
	Если ПустаяСтрока(Направление) Тогда Возврат Неопределено КонецЕсли;	
	
	КоличествоЦиклов	= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(ДопПараметры,"КоличествоЦиклов",0);	
	
	ЗаписатьВЛог("Регламент","Обмен с франч базой. Направление: "+Направление+", кол-во циклов: "+КоличествоЦиклов,"Информация");
	
	Задание_УИД			= Выполнить_Обмен(ИмяПланаОбмена,Направление,КоличествоЦиклов,ДопПараметры);	
	
	Возврат Задание_УИД;	
КонецФункции

Функция СодержаниеОбмена(Направление,Корреспондент)
	Результат	= "";
	Если Направление="Прием" Тогда
		Результат ="Прием из "+Корреспондент;
	ИначеЕсли Направление="Отправка" Тогда
		Результат ="Отправка в "+Корреспондент;
	ИначеЕсли НЕ ПустаяСтрока(Направление) Тогда
		Результат ="Прием из "+Корреспондент+", отправка в "+Корреспондент;		
	Иначе
		Результат ="Н/У";		
	КонецЕсли; 	
	
	Возврат Результат;
КонецФункции //СодержаниеОбмена(Направление,Корреспондент)


#Область ОбменСЦентральнойБазойФР
 

Функция Выполнить_Обмен(Знач ИмяПланаОбмена,Направление,КоличествоЦиклов=0,ДопПараметры=Неопределено) Экспорт	
	Если ТипЗнч(ИмяПланаОбмена)<>Тип("Строка") Тогда
		ИмяПланаОбмена=Метаданные.НайтиПоТипу(ТипЗнч(ИмяПланаОбмена)).Имя;	
	КонецЕсли; 
	СокрИмяПО	= СокращенноеИмяПланаОбмена(ИмяПланаОбмена);
	Если ДопПараметры=Неопределено Тогда
		ДопПараметры=Новый Структура;	
	КонецЕсли;
	ФР_ОбщегоНазначения_КС.УстановитьЗначениеПараметра(ДопПараметры,"ИД_Сеанса",Новый УникальныйИдентификатор(),Ложь);
	
	ВыполнятьВФоне	= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(ДопПараметры,"ВыполнятьВФоне",Истина);
	
	Если ВыполнятьВФоне Тогда
		
		ПараметрыФЗ 	= Новый Массив;
		
		ПараметрыФЗ.Добавить(ИмяПланаОбмена);
		ПараметрыФЗ.Добавить(Направление);
		ПараметрыФЗ.Добавить(КоличествоЦиклов);
		ПараметрыФЗ.Добавить(ДопПараметры);	
		
		Наименование= СодержаниеОбмена(Направление,"ЦО ФР");
		Ключ		= "ОбменСТЦ.ЦО."+Направление;
		ФЗ			= ФоновыеЗадания.Выполнить("ФР_Регламент.Обмен_в_Фоне", ПараметрыФЗ, Ключ ,Наименование);
		Результат	= ФЗ.УникальныйИдентификатор;
		
		ТекстСообщения	= "Запущено ФЗ. Метод: "+ФЗ.ИмяМетода+". "+Наименование+". УИД: "+ФЗ.УникальныйИдентификатор+", ключ: "+ФЗ.Ключ;
		ЗаписатьВЛог("Регламент",ТекстСообщения,"Информация",Истина);
	Иначе
		
		Результат	= Обмен_в_Фоне(ИмяПланаОбмена,Направление,КоличествоЦиклов,ДопПараметры);
		
	КонецЕсли;	
	
	Возврат Результат;	
КонецФункции

Функция Обмен_в_Фоне(ИмяПланаОбмена,Направление,КоличествоЦиклов=0,ДопПараметры=Неопределено) Экспорт
	СокрИмяПО	= СокращенноеИмяПланаОбмена(ИмяПланаОбмена);
	СокрТипУзла	= ?(ФР_ОбщегоНазначения_ПИ.ЭтоЦентальныйУзел(ИмяПланаОбмена),"ПБ","ЦО");
	
	ЗаписатьВЛог("Регламент","Обмен с "+СокрТипУзла+" "+СокрИмяПО,"Информация",Ложь);
	
	ИмяСобытияЖР		= "ОбменДанными_"+СокрТипУзла+"_"+СокрИмяПО;
	
	Если ДопПараметры=Неопределено Тогда
		ДопПараметры=Новый Структура;	
	КонецЕсли;
	ДопПараметры.Вставить("ВыгружатьЗаглушку",(КоличествоЦиклов<>0));
	
	ВыводитьСообщения	= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(ДопПараметры,"ВыводитьСообщения",Ложь);
	ИД_Сеанса			= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(ДопПараметры,"ИД_Сеанса",Новый УникальныйИдентификатор);
	
	УзелСПараметрами	= ФР_ОбщегоНазначения_ПИ.ЭтотУзел("ФР_ОбменСФРК");
	
	АдресОчереди	= УзелСПараметрами.АдресОчереди;
	Пользователь	= УзелСПараметрами.Пользователь;
	Пароль			= УзелСПараметрами.Пароль;	
	
	РезультатОбмена			= Новый Структура("Статистика,Ошибки",Новый Массив,Новый Массив,"");
	
	ТаймАутХХ = 1000;
	
	РезультатПодключения	= ИнициализироватьКомпонентуОбмена(АдресОчереди,"_Обмен",Пользователь,Пароль,ИмяСобытияЖР,ДопПараметры);
	Если РезультатПодключения.Результат Тогда 
		КомпонентаОбмена = РезультатПодключения.КомпонентаОбмена;
		Если КомпонентаОбмена.ВерсияКомпоненты()>="1.0.5" Тогда
			ДопПараметры.Вставить("ВыгружатьЗаглушку", Ложь);		
			ТаймАутХХ	= 0;
		КонецЕсли;
	Иначе	
		РезультатОбмена.Ошибки	= РезультатПодключения.Ошибки;		
		Возврат РезультатОбмена;
	КонецЕсли;	
	
	Сч			= КоличествоЦиклов;	
	//ТаймАутХХ	= ?(КоличествоЦиклов=0,5000,1000);
	ТаймАутХХ	= ?(КоличествоЦиклов=0,5000,ТаймАутХХ);
	
	Пульс			= Неопределено;		
	ИнтервалПульса	= 60;
	
	ВыполнятьПрием		= СтрНайти(Направление,"Прием");
	ВыполнятьОтправку	= СтрНайти(Направление,"Отправка");
	
	РезультатПрием  	= Неопределено;
	РезультатОтправка	= Неопределено;
	
	Если ВыполнятьПрием Тогда
		СообщитьПользователю("Начало приема данных....",ВыводитьСообщения);	
	КонецЕсли; 
	Если ВыполнятьОтправку Тогда
		СообщитьПользователю("Начало отправки данных....",ВыводитьСообщения);
	КонецЕсли;
	
	Пока Истина Цикл
		Если Пульс=Неопределено ИЛИ ТекущаяДата()-Пульс >= ИнтервалПульса Тогда
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Информация,,"Обмен с ЦО ЕЕ","Пульс.");		
			Пульс	= ТекущаяДата();			
		КонецЕсли;
		
		Если СтрНайти(Направление,"Прием")<>0 Тогда
			РезультатПрием		= Обмен_Прием(ИмяПланаОбмена,КомпонентаОбмена,ДопПараметры);
		КонецЕсли;
		Если СтрНайти(Направление,"Отправка")<>0 Тогда
			РезультатОтправка	= Обмен_Отправка(ИмяПланаОбмена,КомпонентаОбмена,ДопПараметры);	
		КонецЕсли;
		
		КомпонентаОбмена.Пауза(ТаймАутХХ);		
		
		Если КоличествоЦиклов<>0 Тогда
			Сч=Сч-1;
			Если Сч<=0 Тогда Прервать КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	
	Если ВыполнятьПрием Тогда
		СообщитьПользователю("Окончание приема данных....",ВыводитьСообщения);
	КонецЕсли;
	Если ВыполнятьОтправку Тогда	
		СообщитьПользователю("Окончание отправки данных....",ВыводитьСообщения);
	КонецЕсли;
	
	Результат 		= Новый Структура("РезультатПрием,РезультатОтправка,ИД_Сеанса",РезультатПрием,РезультатОтправка,ИД_Сеанса);
	АдресРезультата	= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(ДопПараметры,"АдресРезультата");
	Если ЗначениеЗаполнено(АдресРезультата) Тогда
		ПоместитьВоВременноеХранилище(Результат,АдресРезультата);
	КонецЕсли; 
	
	СообщитьПользователю("Завершение обмена.",ВыводитьСообщения);	
	Возврат Результат;
КонецФункции

Функция Обмен_Прием(ИмяПланаОбмена,КомпонентаОбмена,Знач ДопПараметры=Неопределено) Экспорт
	СокрИмяПО		= СокращенноеИмяПланаОбмена(ИмяПланаОбмена);	
	
	Если ДопПараметры=Неопределено Тогда
		ДопПараметры	= Новый Структура;	
	КонецЕсли; 
	ДопПараметры.Вставить("ИД_Сеанса",Новый УникальныйИдентификатор());	
	
	Ошибки			= Новый Массив;	
	Результат		= Новый Структура("Результат,Ошибки",Ложь,Ошибки,Неопределено);
	
	ВыводитьСообщения	= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(ДопПараметры,"ВыводитьСообщения",Ложь);	
	
	ИмяСобытияЖР	= "ОбменДанными_"+СокрИмяПО;
	
	Обработка		= ПолучитьОбработкуОбмена();	
	
	УзелПолучатель	= ФР_ОбщегоНазначения_ПИ.ЭтотУзел(ИмяПланаОбмена);	
	УзелОтправитель	= ФР_ОбщегоНазначения_ПИ.УзелЦБ(ИмяПланаОбмена);	
	
	Очередь			= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(ДопПараметры,"Очередь","to_"+УзелПолучатель.Код);	
	
	Если ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(ДопПараметры,"ВыгружатьЗаглушку",Ложь) Тогда
		ВыгрузитьЗаглушку(КомпонентаОбмена,Очередь);	
		СообщитьПользователю("Выгружена заглушка.",ВыводитьСообщения);
	КонецЕсли;
		
	Обработка.фПерезаписыватьРеквизитыСправочников	= Истина;
	Обработка.фПерезаписыватьДокументы				= Истина;
	
	Обработка.КомпонентаОбмена	= КомпонентаОбмена;
	Обработка.УзелОтправитель	= УзелОтправитель;
	Обработка.УзелПолучатель	= УзелПолучатель;
	Обработка.ТекУзелПолучатель	= УзелПолучатель; //Чтобы не реконектилась
	Обработка.ИД_Сеанса			= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(ДопПараметры,"ИД_Сеанса");
	
	КомпонентаОбмена.НачатьПриемСообщений(Очередь);	
	
	//КомпонентаОбмена.Пауза(500);
	
	ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Информация,,"Очередь: "+" "+Очередь+" "+ИмяПланаОбмена+".Прием","Пульс.Прием");
	Пока Истина Цикл
		
		Начало			= ТекущаяДата();
		ПротоколОбмена	= ПолучитьСообщение(КомпонентаОбмена,Обработка,ДопПараметры);	
		Если ПротоколОбмена.Результат Тогда			
			СообщитьПользователю("Получен пакет данных. "+ПротоколОбмена.РазмерСообщения,ВыводитьСообщения);		
		Иначе
			Если ПротоколОбмена.Ошибки.Количество()>0 Тогда				
				ТекстОшибок	= СтрСоединить(ПротоколОбмена.Ошибки,"	"+Символы.ПС);
				Ошибки.Добавить(ТекстОшибок);
				СообщитьПользователю("Ошибка получения сообщения обмена ! "+Символы.ПС+ТекстОшибок,ВыводитьСообщения);
			Иначе
				СообщитьПользователю("Нет сообщений.",ВыводитьСообщения);
			КонецЕсли;			
		КонецЕсли;			
		
		Если НЕ ПротоколОбмена.Результат Тогда Прервать КонецЕсли; 
	КонецЦикла;	
	
	ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Информация,,ИмяПланаОбмена+".Прием","Пульс.Отправка");	
	
	Результат.Результат	= (Ошибки.Количество()=0);
	Результат.Ошибки	= Ошибки;
	
	Возврат Результат;	
КонецФункции

Функция Обмен_Отправка(ИмяПланаОбмена,КомпонентаОбмена,ДопПараметры=Неопределено) Экспорт	
	Ошибки			= Новый Массив;	
	ИмяСобытияЖР	= "ОбменДанными_с_ЦО_ТЦ";
	
	Обработка		= ПолучитьОбработкуОбмена();	
	
	ЭтотУзел		= ФР_ОбщегоНазначения_ПИ.ЭтотУзел(ИмяПланаОбмена);
	
	УзелОтправитель	= ЭтотУзел;
	УзелПолучатель	= ФР_ОбщегоНазначения_ПИ.УзелПолучательФранчБаза();
	
	ПараметрыПодключения	= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(ДопПараметры,"ПараметрыПодключения");
	
	АдресОчереди	= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(ПараметрыПодключения,"АдресОчереди",	ЭтотУзел.АдресОчереди);
	Пользователь	= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(ПараметрыПодключения,"Пользователь",	ЭтотУзел.Пользователь);
	Пароль			= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(ПараметрыПодключения,"Пароль",		ЭтотУзел.Пароль);	
	Очередь			= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(ПараметрыПодключения,"Очередь","to_"+УзелПолучатель.Код);
	ТаймАутХХ		= ФР_ОбщегоНазначения_КС.ПолучитьЗначениеПараметра(ПараметрыПодключения,"ТаймАутХХ",	5000);	
	
	Обработка.КомпонентаОбмена	= КомпонентаОбмена;
	Обработка.УзелОтправитель	= УзелОтправитель;
	Обработка.УзелПолучатель	= УзелПолучатель;
	Обработка.ТекУзелПолучатель	= УзелПолучатель; //Чтобы не реконектилась
	
	
	ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Информация,,Очередь+".Отправка","Начало отправки");
	
	//ЗаписатьВЛог("Регламент","Обмен ФР. Отправка. Начало. Имя плана обмена:"+ИмяПланаОбмена+". Получатель: "+УзелПолучатель,"Информация",Ложь);
	
	РезультатОбмена = Обработка.ВыгрузитьПакетом("Очередь", ДопПараметры);	
	
	//ЗаписатьВЛог("Регламент","Обмен ФР. Отправка. Окончание. Имя плана обмена:"+ИмяПланаОбмена+". Получатель: "+УзелПолучатель,"Информация",Ложь);
	
	ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Информация,,Очередь+".Отправка","Конец отправки");
	
	Возврат РезультатОбмена;
КонецФункции

Процедура ВыгрузитьЗаглушку(КомпонентаОбмена,ИмяОчереди,ТекстЗаглушки="Заглушка") Экспорт	
	
	КомпонентаОбмена.ОтправитьСообщение("",ИмяОчереди,ПолучитьДвоичныеДанныеИзСтроки(ТекстЗаглушки));	
	КомпонентаОбмена.ОтправитьБуферСообщений();
	
КонецПроцедуры


#КонецОбласти

Функция СокращенноеИмяПланаОбмена(ИмяПланаОбмена)
	 Возврат Прав(ИмяПланаОбмена,2);
КонецФункции // ()

Функция СообщитьПользователю(ТекстСообщения,ВыводитьСообещния)
	Если ВыводитьСообещния Тогда
		ФР_ОбщегоНазначения_КС.СообщитьПользователю(ТекстСообщения);	
	КонецЕсли;
КонецФункции // ()

Функция ОперацииВыполнены(Знач ЗаданияДляПроверки, ЗаданияДляОтмены) Экспорт
	
	Результат = ДлительныеОперации.ОперацииВыполнены(ЗаданияДляПроверки);
	Для каждого ИдентификаторЗадания Из ЗаданияДляОтмены Цикл
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
		Результат.Вставить(ИдентификаторЗадания, Новый Структура("Статус", "Отменено"));
	КонецЦикла;
	Возврат Результат;
	
КонецФункции
