#Область ОписаниеПеременных
Перем СостояниеДоПерезаписи;
Перем ЕстьИзменения;
Перем РежимЗаписиДокНового; 
#КонецОбласти 

#Область ОбработчикиСобытий
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ОбщегоНазначенияС.ЗаполнитьШапкуДокументаСервер(ЭтотОбъект,ОбщегоНазначенияС.ТекущийПользователь()); 
	Статус = ПредопределенноеЗначение("Перечисление.СтатусыПеремаркировки.ВРаботе"); //
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		//++Данилова Е.В. 26.06.2026 Изм.№0000000222
		ЗарегистрироватьИзмененияПолученоСкладом();
		//--Данилова Е.В. 26.06.2026 
		Возврат; 
	КонецЕсли;
	ТипУзла	= Маркировка_ПИ.ТипТекущегоУзла();
	Если Не Отказ 
		И (Проведен 
		ИЛИ РежимЗаписиДокНового = РежимЗаписиДокумента.Проведение) Тогда
		 
		Если Статус = Перечисления.СтатусыПеремаркировки.КОтработкеЧЗ 
			Или Статус = Перечисления.СтатусыПеремаркировки.ОбработаноЧЗ
			//++Данилова Е.В. 26.06.2026 Изм.№0000000222 
			ИЛИ Статус = Перечисления.СтатусыПеремаркировки.ПолученоСкладом Тогда
			//--Данилова Е.В. 26.06.2026 
			//	
			//++Данилова Е.В. 26.06.2026 Изм.№0000000222
			//перенесено создание в офис по регламенту 
//			Если Статус = Перечисления.СтатусыПеремаркировки.КОтработкеЧЗ 
//				И СостояниеДоПерезаписи <> Статус
//				И ТипУзла = Перечисления.ТипУзлаИБ.Склад Тогда
//				ИдентификаторФЗ = Новый УникальныйИдентификатор;
//				МаркировкаС.ЗапуститьВФонеСозданиеЗаказовКодовМаркировки(ссылка, ИдентификаторФЗ);
//			КонецЕсли;
			//--Данилова Е.В. 26.06.2026 
			//++Данилова Е.В. 11.06.2026 исправление MARK-3615 
			//СтатусдляВыгрузки = Статус = Перечисления.СтатусыПеремаркировки.ОбработаноЧЗ ; 
			//НужноВыгружать	= Документы.Перемаркировка.НужноВыгружатьДокПеремаркировка(СтатусдляВыгрузки, Ссылка,
			//РежимЗаписиДокумента, ПометкаУдаления);
			//++Данилова Е.В. 26.06.2026 Изм.№0000000222
			ИзмененСтатус = СостояниеДоПерезаписи <> Статус;
			
			НужноВыгружать	= Документы.Перемаркировка.НужноВыгружатьДокПеремаркировка(ИзмененСтатус, Ссылка,
			РежимЗаписиДокумента, ПометкаУдаления); 
			
//			НужноВыгружать	= Документы.Перемаркировка.НужноВыгружатьДокПеремаркировка(истина, Ссылка,
//			РежимЗаписиДокумента, ПометкаУдаления); 
			//--Данилова Е.В. 11.06.2026 
			//--Данилова Е.В. 26.06.2026 
			ДополнительныеСвойства.Вставить("НужноВыгружать", НужноВыгружать);
			
			Если НужноВыгружать Тогда
				Документы.Перемаркировка.УстановитьПолучателейИзменений(ЭтотОбъект);
			КонецЕсли;
		КонецЕсли;
		
		Если Статус = Перечисления.СтатусыПеремаркировки.Обработано
			И СостояниеДоПерезаписи <> Статус Тогда
			ЗаданиеНаСборку = ОбщегоНазначенияС.НайтиДокументНаСервере("ЗаданиеНаСборкуКомплектовЧЗ",
			Новый Структура("ДокОснование,Проведен", Ссылка, Истина));///
			Если ЗначениеЗаполнено(ЗаданиеНаСборку) Тогда
				
				Если ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(ЗаданиеНаСборку, "КоличествоШК", "Документ") > 0 Тогда
					ДопПараметры = Новый Структура("Статус", Перечисления.СтатусыДокументовМаркировки.КОбработке);
				Иначе
					ДопПараметры = Неопределено;
				КонецЕсли;
				
				Документы.ЗаданиеНаСборкуКомплектовЧЗ.Создать_Агрегации(ЗаданиеНаСборку, ДопПараметры);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		//++Данилова Е.В. 26.06.2026 Изм.№0000000222
		УстановитьСтатусПолученоСкладом(); 
		//--Данилова Е.В. 26.06.2026 
		Возврат; 
	КонецЕсли;
	Если НЕ ЭтоНовый() Тогда
		СостояниеДоПерезаписи = ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(ссылка, "Статус");  
	Иначе
		 СостояниеДоПерезаписи = Перечисления.СтатусыПеремаркировки.ПустаяСсылка(); 
	 КонецЕсли;
	 
	 РежимЗаписиДокНового = РежимЗаписи; 
	
	ЕстьИзменения = Модифицированность(); 
	Если ЕстьИзменения И Не ПроверитьВведеннуюНоменклатуру() Тогда
		Отказ = Истина;
		Сообщить(
			"В документе могут быть указаны только спайки или только штуки (готовые комплекты). Разделите документ!");
	КонецЕсли
	; 
	Если ОтгрузкаКомплектов И Комплектующие.Количество() = 0 Тогда
		Отказ = Истина;
		Сообщить("Заполните комплектующие!");
		Возврат; 
	КонецЕсли;
	Если ОтгрузкаКомплектов Тогда
	
		КоличествоТоваров = Товары.Итог("Количество"); 	
	    КоличествоПродукции = Комплектующие.Итог("КоличествоПродукции");
		Если КоличествоТоваров <> КоличествоПродукции Тогда
			
			Отказ = Истина;
			Сообщить("Перезаполните комплектующие, несоответствие по количеству продукции!");	
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ОбщегоНазначенияС.ЗаполнитьШапкуДокументаСервер(ЭтотОбъект,ОбщегоНазначенияС.ТекущийПользователь()); //
	Статус = ПредопределенноеЗначение("Перечисление.СтатусыПеремаркировки.ВРаботе");
	ТоварыУдаленные.Очистить();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыиФункции

Функция ПроверитьВведеннуюНоменклатуру() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТЧТовары.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	&Товары КАК ТЧТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|		КОГДА НоменклатураСпр.родитель.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)
		|			ТОГДА НоменклатураСпр.родитель.ВидКомплекта
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Товар)
		|	КОНЕЦ) КАК ВидКомплекта
		|ИЗ
		|	ВТТовары КАК ТЧТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
		|		ПО ТЧТовары.Номенклатура = НоменклатураСпр.Ссылка
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|		КОГДА НоменклатураСпр.родитель.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)
		|			ТОГДА НоменклатураСпр.родитель.ВидКомплекта
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Товар)
		|	КОНЕЦ) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НоменклатураСпр.родитель.ВидКомплекта КАК ВидКомплекта
		|ИЗ
		|	ВТТовары КАК ТЧТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
		|		ПО ТЧТовары.Номенклатура = НоменклатураСпр.Ссылка";
	
	Запрос.УстановитьПараметр("Товары", Товары.Выгрузить());
		
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	РезультатПроверка = ПакетЗапросов[1];
	ВыборкаВид =  ПакетЗапросов[2].Выбрать();
	ВидыКомплектов.Очистить();	
	Пока ВыборкаВид.Следующий() Цикл
		НСтрока = ВидыКомплектов.Добавить(); 
		НСтрока.ВидКомплекта = ВыборкаВид.ВидКомплекта; 
	КонецЦикла;
	
	Возврат РезультатПроверка.Пустой(); 
	
КонецФункции

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если ЗначениеЗаполнено(Организация) Тогда
		Префикс = СокрЛП(Организация.Префикс)+"-";	
	КонецЕсли;
КонецПроцедуры

//++Данилова Е.В. 26.06.2026 Изм.№0000000222
Процедура УстановитьСтатусПолученоСкладом()
	Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.Склад И Статус
		= Перечисления.СтатусыПеремаркировки.КОтправкеНаСклад Тогда
			
		Статус = Перечисления.СтатусыПеремаркировки.ПолученоСкладом; 
			
	КонецЕсли;
КонецПроцедуры

Процедура ЗарегистрироватьИзмененияПолученоСкладом()

	Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.Склад
		И Статус = Перечисления.СтатусыПеремаркировки.ПолученоСкладом Тогда
		//++Данилова Е.В. 01.07.2026 №Изм.0000000222
		ОбменДанными.Отправитель = неопределено;
		//--Данилова Е.В. 01.07.2026 
		Документы.Перемаркировка.УстановитьПолучателейИзменений(ЭтотОбъект);
		
	КонецЕсли;

КонецПроцедуры

//--Данилова Е.В. 26.06.2026 
#КонецОбласти


