Процедура ПриЗаписи(Отказ)                                                         
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
					
	Если ПараметрыСеанса.ТипУзла <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда		
		ОбменДанными.Получатели.Добавить(ПараметрыСеанса.ЭтотУзел.УправляющийУзел);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт 
	// Вставить содержимое обработчика.
КонецПроцедуры
