Функция Строка_В_ДД(ИсходнаяСтрока)
	Поток = Новый ПотокВПамяти;
	
	ЗаписьТекста = Новый ЗаписьТекста(Поток) ;
	ЗаписьТекста.Записать(ИсходнаяСтрока);
	ЗаписьТекста.Закрыть();
	
	ДвоичныеДанные = Поток.ЗакрытьИПолучитьДвоичныеДанные();
	
	Возврат ДвоичныеДанные;
КонецФункции //Строка_В_ДД(ИсходнаяСтрока)

Функция ДД_В_Строка(ДД)
	Поток = ДД.ОткрытьПотокДляЧтения();	
	
	ЧтениеТекста=Новый ЧтениеТекста(Поток,"UTF-8");
	
	Строка=ЧтениеТекста.Прочитать();
	
	Возврат Строка;	
КонецФункции // ()

Функция ХэшСтрока(ВходСтрока) Экспорт
	ХэшированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
 	ХэшированиеДанных.Добавить(Строка_В_ДД(ВходСтрока));
	
	Хэш = НРег(СтрЗаменить(ХэшированиеДанных.ХешСумма, " ", ""));

 	Возврат Хэш;
КонецФункции //ХэшСтрока(ВходСтрока)

Функция Тип_ВсеСсылки() Экспорт
	Типы = Новый Массив();
	
	Типы.Добавить(Тип("ДокументСсылка.СверкаДанных"));
	
	оОписание = Новый ОписаниеТипов(Типы);
	оОписание = Новый ОписаниеТипов(оОписание, Справочники.ТипВсеСсылки().Типы());
	оОписание = Новый ОписаниеТипов(оОписание, Документы.ТипВсеСсылки().Типы());
	оОписание = Новый ОписаниеТипов(оОписание, Перечисления.ТипВсеСсылки().Типы());
	оОписание = Новый ОписаниеТипов(оОписание, ПланыСчетов.ТипВсеСсылки().Типы());
	оОписание = Новый ОписаниеТипов(оОписание, ПланыВидовХарактеристик.ТипВсеСсылки().Типы());
	оОписание = Новый ОписаниеТипов(оОписание, Задачи.ТипВсеСсылки().Типы());
	оОписание = Новый ОписаниеТипов(оОписание, ПланыВидовРасчета.ТипВсеСсылки().Типы());
	оОписание = Новый ОписаниеТипов(оОписание, ПланыОбмена.ТипВсеСсылки().Типы());
	
	Возврат оОписание;
КонецФункции // ()
 

// Выполнить экспортную процедуру объекта встроенного языка по имени.
// При включении профилей безопасности для вызова оператора Выполнить() используется
// переход в безопасный режим с профилем безопасности, используемом для информационной базы
// (если выше по стеку не был установлен другой безопасный режим).
//
// Параметры:
//  Объект    - Произвольный - объект встроенного языка 1С:Предприятия, содержащий методы (например, ОбработкаОбъект).
//  ИмяМетода - Строка       - имя экспортной процедуры модуля объекта обработки.
//  Параметры - Массив       - параметры передаются в процедуру <ИмяПроцедуры>
//                             в порядке расположения элементов массива.
//
Процедура ВыполнитьМетодОбъекта(Знач Объект, Знач ИмяМетода, Знач Параметры = Неопределено) Экспорт
	
	// Проверка имени метода на корректность.
	Попытка
		Тест = Новый Структура(ИмяМетода, ИмяМетода);
	Исключение
		ВызватьИсключение СтрШаблон(
			НСтр("ru='Некорректное значение параметра ИмяМетода (%1) в ОбщегоНазначения.ВыполнитьМетодОбъекта'"), ИмяМетода);
	КонецПопытки;
			
	ПараметрыСтрока = "";
	Если Параметры <> Неопределено И Параметры.Количество() > 0 Тогда
		Для Индекс = 0 По Параметры.ВГраница() Цикл 
			ПараметрыСтрока = ПараметрыСтрока + "Параметры[" + Индекс + "],";
		КонецЦикла;
		ПараметрыСтрока = Сред(ПараметрыСтрока, 1, СтрДлина(ПараметрыСтрока) - 1);
	КонецЕсли;
	
	Выполнить "Объект." + ИмяМетода + "(" + ПараметрыСтрока + ")";
	
КонецПроцедуры
