
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МаркировкаКС.УстановитьПараметрДинамическогоСписка(ОчередьЗадач, "ИД_ЗадачиВладельца", ЭтотОбъект.Запись.ИД_Задачи);
КонецПроцедуры

&НаКлиенте
Процедура ЗапланироватьВыполнениеЗадач(Команда)
	ЗапланироватьВыполнениеЗадач_НаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗапланироватьВыполнениеЗадач_НаСервере()
	РегистрыСведений.ЗадачиОтложеннойОбработкиДокументов.ЗапланироватьВыполнениеЗадач();
КонецПроцедуры