


процедура Сформировать(ТаблицаПараметров=Неопределено) Экспорт

	   ЗаписатьВЛог("Регламент","ОбработкаУволенных","Информация");
 
         СписокПользователейИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();

		Кол=СписокПользователейИБ.Количество();
		
		Для ИИ=0 По Кол-1 Цикл
			
		
			ТекПользИБ=СписокПользователейИБ.Получить(ИИ);
			иМЯпОЛЬз=ТекПользИБ.Имя;
			Если ИмяПольз="Администратор" Тогда 
				
				продолжить;
				
			Конецесли;	
			
			СпрПольз=Справочники.Пользователи.НайтиПоКоду(ИмяПольз);
			Если СпрПольз<>Неопределено Тогда
				
				Если НЕ СпрПольз.ФизЛицо.Пустая() Тогда
					Если СпрПольз.ФизЛицо.Штатный = ложь Тогда
						
						
						попытка
							ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ИмяПольз);
							Если НЕ ПользовательИБ =неопределено Тогда
								
									ПользовательИб.Удалить();
									Польз=СпрПольз.ПолучитьОбъект();
									Польз.Родитель=Справочники.Пользователи.НайтиПоНаименованию("Уволеные");
									Польз.Записать();
											
											
									ЗаписатьВЛог("Регламент","ОбработкаУволенных - удален пользовательИБ -  "+ИмяПольз,"Информация");
							КонецЕсли;
						исключение
						конецПопытки;
						
						////нечаева 14,03,14  +++
						//попытка
						//	Польз=СпрПольз.ПолучитьОбъект();
						//	Польз.Родитель=Справочники.Пользователи.НайтиПоНаименованию("Уволеные");
						//	Польз.Записать();
						//исключение
						//конецПопытки;
						////нечаева 14,03,14 ---
						//
						
						
					КонецЕсли;
					
				КонецЕсли;
				
				
			КонецЕсли;
			
        КонецЦикла;
        
		ЗаписатьВЛог("Регламент","ОбработкаУволенных /// конец","Информация");
	
	 	 	
конецПроцедуры
