
&НаКлиенте
Процедура МассивСкладовПриИзменении(Элемент)
	
	Модифицированность = Истина; 
	ВнесеныИзмененияВСклады = Истина; 
	
КонецПроцедуры


// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ВнестиИзмененияВСклады(ТекущийОбъект)

	 ТекущийОбъект.СкладыОстатков = Новый ХранилищеЗначения(МассивСкладов.ВыгрузитьЗначения()); 

 КонецПроцедуры // ()
 
 &НаСервере
Процедура ВнестиИзмененияВСкладыЦО(ТекущийОбъект)

	 ТекущийОбъект.СкладыОстатковЦО = Новый ХранилищеЗначения(МассивСкладовЦО.ВыгрузитьЗначения()); 

КонецПроцедуры 


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМассивСкладов(ТекущийОбъект)
		
	//ОбъектЗаписи = РеквизитФормыВЗначение("Запись"); 
	//Если ТипЗнч(ОбъектЗаписи.СкладыОстатков.Получить()) = Тип("Массив") Тогда
	//	
	//	МассивСкладов.ЗагрузитьЗначения(ОбъектЗаписи.СкладыОстатков.Получить()); 	
	//	
	//КонецЕсли;
	Если ТипЗнч(ТекущийОбъект.СкладыОстатков.Получить()) = Тип("Массив") Тогда
		МассивСкладов.ЗагрузитьЗначения(ТекущийОбъект.СкладыОстатков.Получить());
	КонецЕсли;
	
	Если ТипЗнч(ТекущийОбъект.СкладыОстатковЦО.Получить()) = Тип("Массив") Тогда
		МассивСкладовЦО.ЗагрузитьЗначения(ТекущийОбъект.СкладыОстатковЦО.Получить());
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ВнесеныИзмененияВСклады Тогда
	
		ВнестиИзмененияВСклады(ТекущийОбъект); 
	
	КонецЕсли;
	
	Если ВнесеныИзмененияВСкладыЦО Тогда
	
		ВнестиИзмененияВСкладыЦО(ТекущийОбъект); 
	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗаполнитьМассивСкладов(ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура МассивСкладовЦОПриИзменении(Элемент)
	Модифицированность = Истина; 
	ВнесеныИзмененияВСкладыЦО = Истина;
КонецПроцедуры


