&НаСервере
Процедура ПоказатьДвиженияДокументаНаСервере(ДокументСсылка)
	
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	
	ДобавляемыеРеквизиты = Новый Массив;
		
	Для Каждого Движение Из МетаданныеДокумента.Движения Цикл
		ИмяТаблицы = ПолучитьИмяТаблицы(Движение);
		ДобавитьРеквизитДинамическийСписок(ИмяТаблицы, Движение, ДобавляемыеРеквизиты);
	КонецЦикла;
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Для Каждого Движение Из МетаданныеДокумента.Движения Цикл
		ИмяТаблицы = ПолучитьИмяТаблицы(Движение);
		ЭтаФорма[ИмяТаблицы].ОсновнаяТаблица = ПолучитьТипРегистра(Движение) + "." + Движение.Имя;
	КонецЦикла;
	
	ДобавитьЭлементыФормы(МетаданныеДокумента);
	
	УстановитьОтборДинамическихСписков(ДокументСсылка, МетаданныеДокумента);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяТаблицы(Движение)
	Возврат ПолучитьТипРегистра(Движение) + "_" + Движение.Имя;
КонецФункции

&НаСервере
Функция ПолучитьТипРегистра(Движение)
	ТипРегистра = "";
	Если Метаданные.РегистрыНакопления.Содержит(Движение) Тогда
		ТипРегистра = "РегистрНакопления";
	ИначеЕсли Метаданные.РегистрыСведений.Содержит(Движение) Тогда
		ТипРегистра = "РегистрСведений";
	КонецЕсли;
	Возврат ТипРегистра;
КонецФункции

&НаСервере
Процедура ДобавитьРеквизитДинамическийСписок(ИмяТаблицы, Движение, ДобавляемыеРеквизиты)
	Реквизит = Новый РеквизитФормы(ИмяТаблицы, Новый ОписаниеТипов("ДинамическийСписок"));
	ДобавляемыеРеквизиты.Добавить(Реквизит);
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементыФормы(МетаданныеДокумента)
	
	// отсортируем движения по имени методом пузырька
	МассивДвижения = Новый Массив;
	Для Каждого Движение Из МетаданныеДокумента.Движения Цикл
		МассивДвижения.Добавить(Движение);
	КонецЦикла;
	
	МассивОтсортирован = Ложь;
	Пока Не МассивОтсортирован Цикл
		МассивОтсортирован = Истина;
		Для ТекИндекс = 0 По МассивДвижения.Количество() - 2 Цикл
			Если МассивДвижения[ТекИндекс].Имя > МассивДвижения[ТекИндекс + 1].Имя Тогда
				МассивОтсортирован = Ложь;
				ТекДвижение = МассивДвижения[ТекИндекс];
				МассивДвижения[ТекИндекс] = МассивДвижения[ТекИндекс + 1];
				МассивДвижения[ТекИндекс + 1] = ТекДвижение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	//Для Каждого Движение Из МетаданныеДокумента.Движения Цикл
	Для Каждого Движение Из МассивДвижения Цикл
		
		ИмяТаблицы = ПолучитьИмяТаблицы(Движение);
		
		ТипРегистра = ПолучитьТипРегистра(Движение);
		
		// создаем страницу для регистра
		ИмяСтраницы = "Страница_" + ТипРегистра + "_" + Движение.Имя;
		
		Страница = ЭтаФорма.Элементы.Добавить(ИмяСтраницы, Тип("ГруппаФормы"), ЭтаФорма.Элементы.Страницы);
		Страница.Вид		= ВидГруппыФормы.Страница;
		Страница.Заголовок	= Движение.Синоним;
		
		// создаем таблицу регистра
		ТаблицаРегистра = ЭтаФорма.Элементы.Добавить(ИмяТаблицы, Тип("ТаблицаФормы"), Страница);
		ТаблицаРегистра.ПутьКДанным = ИмяТаблицы;
		
		// стандартные реквизиты
		Если Метаданные.РегистрыНакопления.Содержит(Движение) Тогда
			// период
			КолонкаПериод = ЭтаФорма.Элементы.Добавить(ИмяТаблицы + "_Период", Тип("ПолеФормы"), ТаблицаРегистра);
			КолонкаПериод.Заголовок			= "Период";
			КолонкаПериод.Вид				= ВидПоляФормы.ПолеВвода;
			КолонкаПериод.ПутьКДанным		= ИмяТаблицы + ".Период";
			
			// номер строки
			КолонкаНомерСтроки = ЭтаФорма.Элементы.Добавить(ИмяТаблицы + "_НомерСтроки", Тип("ПолеФормы"), ТаблицаРегистра);
			КолонкаНомерСтроки.Заголовок	= "Номер строки";
			КолонкаНомерСтроки.Вид			= ВидПоляФормы.ПолеВвода;
			КолонкаНомерСтроки.ПутьКДанным	= ИмяТаблицы + ".НомерСтроки";
			
			// активность
			КолонкаАктивность = ЭтаФорма.Элементы.Добавить(ИмяТаблицы + "_Активность", Тип("ПолеФормы"), ТаблицаРегистра);
			КолонкаАктивность.Заголовок		= "Активность";
			КолонкаАктивность.Вид			= ВидПоляФормы.ПолеФлажка;
			КолонкаАктивность.ПутьКДанным	= ИмяТаблицы + ".Активность";
						
		ИначеЕсли Метаданные.РегистрыСведений.Содержит(Движение) Тогда
			Если Движение.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
				// период
				КолонкаПериод = ЭтаФорма.Элементы.Добавить(ИмяТаблицы + "_Период", Тип("ПолеФормы"), ТаблицаРегистра);
				КолонкаПериод.Заголовок			= "Период";
				КолонкаПериод.Вид				= ВидПоляФормы.ПолеВвода;
				КолонкаПериод.ПутьКДанным		= ИмяТаблицы + ".Период";
			КонецЕсли;
		КонецЕсли;
			
		Для Каждого Измерение Из Движение.Измерения Цикл
			//ПравоДоступа = ОбщегоНазначенияВызовСервераПИ.ПолучитьПравоДоступаРегистр("Просмотр", ТипРегистра, Движение.Имя, "Измерения", Измерение.Имя);
			//Если ПравоДоступа Тогда
				КолонкаТаблицы = ЭтаФорма.Элементы.Добавить(ИмяТаблицы + "_" + Измерение.Имя, Тип("ПолеФормы"), ТаблицаРегистра);
				КолонкаТаблицы.Заголовок	= Измерение.Синоним;
				КолонкаТаблицы.Вид			= ВидПоляФормы.ПолеВвода; 
				КолонкаТаблицы.ПутьКДанным	= ИмяТаблицы + "." + Измерение.Имя;
			//КонецЕсли;
		КонецЦикла;
		
		Для Каждого Ресурс Из Движение.Ресурсы Цикл
			//ПравоДоступа = ОбщегоНазначенияВызовСервераПИ.ПолучитьПравоДоступаРегистр("Просмотр", ТипРегистра, Движение.Имя, "Ресурсы", Ресурс.Имя);
			//Если ПравоДоступа Тогда
				КолонкаТаблицы = ЭтаФорма.Элементы.Добавить(ИмяТаблицы + "_" + Ресурс.Имя, Тип("ПолеФормы"), ТаблицаРегистра);
				КолонкаТаблицы.Заголовок	= Ресурс.Синоним;
				КолонкаТаблицы.Вид			= ВидПоляФормы.ПолеВвода; 
				КолонкаТаблицы.ПутьКДанным	= ИмяТаблицы + "." + Ресурс.Имя;
			//КонецЕсли;
		КонецЦикла;
		
		Для Каждого РеквизитРегистра Из Движение.Реквизиты Цикл
			//ПравоДоступа = ОбщегоНазначенияВызовСервераПИ.ПолучитьПравоДоступаРегистр("Просмотр", ТипРегистра, Движение.Имя, "Реквизиты", РеквизитРегистра.Имя);
			//Если ПравоДоступа Тогда
				КолонкаТаблицы = ЭтаФорма.Элементы.Добавить(ИмяТаблицы + "_" + РеквизитРегистра.Имя, Тип("ПолеФормы"), ТаблицаРегистра);
				КолонкаТаблицы.Заголовок	= РеквизитРегистра.Синоним;
				КолонкаТаблицы.Вид			= ВидПоляФормы.ПолеВвода; 
				КолонкаТаблицы.ПутьКДанным	= ИмяТаблицы + "." + РеквизитРегистра.Имя;
			//КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	Если МассивДвижения.Количество() = 0 Тогда
		НетДвижений = "По документу
		|" + СокрЛП(ДокументСсылка) + "
		|нет движений";
		Элементы.НетДвижений.Видимость = Истина;
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДинамическихСписков(ДокументСсылка, МетаданныеДокумента)
	
	Для Каждого Движение Из МетаданныеДокумента.Движения Цикл
		
		ДинамическийСписок = ЭтаФорма[ПолучитьИмяТаблицы(Движение)];
		
		ОтборПоРегистратору = ДинамическийСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоРегистратору.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Регистратор");
		ОтборПоРегистратору.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
		ОтборПоРегистратору.ПравоеЗначение	= ДокументСсылка;
		ОтборПоРегистратору.Использование	= Истина;
				
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.НетДвижений.Видимость = Ложь;	
	Если Параметры.ДокументСсылка.Пустая() Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Невозможно открыть форму! Не задан параметр ДокументСсылка";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ПометкаУдаления = ЗначениеРеквизитаОбъекта(Параметры.ДокументСсылка, "ПометкаУдаления");
	Если ПометкаУдаления Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Документ помечен на удаление ! Движения не созданы !";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ДокументСсылка	= Параметры.ДокументСсылка;
	ЭтаФорма.Заголовок		= "Движения документа " + Строка(ЭтаФорма.ДокументСсылка);
	
	ПоказатьДвиженияДокументаНаСервере(ЭтаФорма.ДокументСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРегистраВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекПоле = СтрЗаменить(Поле.Имя, Элемент.Имя + "_", ""); // РегистрНакопления_ОстаткиТМЦ_НомерСтроки
	ТекЗначение = Элемент.ТекущиеДанные[ТекПоле];
	ПоказатьЗначение(, ТекЗначение);
КонецПроцедуры

