
&НаКлиенте
Процедура ОбработатьДанные(Результат, ДопПараметры) Экспорт
	ПоказатьОповещениеПользователя("Обработка завершена.",,,,СтатусОповещенияПользователя.Информация);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МаркировкаКС.УстановитьПараметрДинамическогоСписка(Список, "КодТекущегоУзла", Маркировка_ПИ.ЭтотУзел_Код("ДанныеЧЗ"));	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПакетыИзФайлов(Команда)                           
	ТекПакет = Элементы.Список.ТекущаяСтрока;
	Если  ТекПакет <> Неопределено Тогда
		пФормы = Новый Структура("ПланОбмена", ПолучитьРеквизитШапки(ТекПакет, "ПланОбмена"));
		ОткрытьФорму("Справочник.ФР_ПакетыДанных.Форма.ФормаЗагрузкиПакетов", пФормы, ЭтаФорма);
	Иначе
		Сообщить("Не выбран пакет ! Невозможно определеить план обмена !", СтатусСообщения.Важное);
	КонецЕсли;	
КонецПроцедуры