Функция ЗаписатьОшибкиКМ(ДокСсылка, тОшибок) Экспорт
	НЗ = РегистрыСведений.ОшибкиПроверкиКМвЧЗ.СоздатьНаборЗаписей();
	НЗ.Отбор.ДокСсылка.Установить(ДокСсылка, Истина);	
	
	Если НЕ ЗначениеЗаполнено(НЗ.Отбор.ДокСсылка.Значение) Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	КэшНакладных = Новый Соответствие;
	
	Для каждого СтрокаО Из тОшибок Цикл
		Запись = НЗ.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, СтрокаО);
		
		Запись.ДокСсылка 		= ДокСсылка;	
		Запись.Автор 			= ПараметрыСеанса.Пользователь;
		Запись.ДатаПроверки 	= ТекущаяДата();
		Запись.Накладная 		= ПолучитьНакладную(ДокСсылка, КэшНакладных);	
	КонецЦикла;
	
	НЗ.Записать();
	
	Возврат Истина;
КонецФункции //ЗаписатьОшибкиКМ(ДокСсылка, тОшибок) Экспорт

Функция ПолучитьНакладную(ДокСсылка, Кэш)
	Накладная = Кэш[ДокСсылка];
	Если Накладная = Неопределено Тогда
		Накладная = МаркировкаС.НакладнаяПоДокументуСканирования(ДокСсылка);	
		Кэш[ДокСсылка] = Накладная;			
	КонецЕсли;	
	
	Возврат Накладная;
КонецФункции //ПолучитьНакладную(ДокСсылка, Кэш)

Функция ОчиститьОшибкиКМ(ДокСсылка) Экспорт
	НЗ = РегистрыСведений.ОшибкиПроверкиКМвЧЗ.СоздатьНаборЗаписей();
	НЗ.Отбор.ДокСсылка.Установить(ДокСсылка, Истина);	
	
	Если НЕ ЗначениеЗаполнено(НЗ.Отбор.ДокСсылка.Значение) Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	НЗ.Записать();
	
	Возврат Истина;
КонецФункции //ОчиститьОшибкиКМ(ДокСсылка, тОшибок) Экспорт
