Процедура УстановитьСтатус(Объект,Статус,Знач КодУзлаОтправителя="",Знач КодУзлаПолучателя="") Экспорт	
	МЗ			= РегистрыСведений.ФР_СтатусыОбмена.СоздатьМенеджерЗаписи();
	
	МЗ.Период		= ТекущаяДата();
	МЗ.Объект   	= Объект;
	
	Если Статус=Перечисления.СтатусыОбмена.КОтправке
		ИЛИ Статус=Перечисления.СтатусыОбмена.Отправлено  Тогда
		МЗ.Отправитель  = ОбщегоНазначения_ПИ.ЭтотУзелКод();
		МЗ.Получатель	= КодУзлаПолучателя;
	Иначе
		МЗ.Отправитель  = КодУзлаОтправителя;
		МЗ.Получатель	= ОбщегоНазначения_ПИ.ЭтотУзелКод();
	КонецЕсли;
	
	МЗ.Статус		= Статус;
	
	МЗ.Записать();
КонецПроцедуры