Функция ПолучитьСузПользователя(Организация, Знач Пользователь = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПараметрыСеанса.Пользователь;	
	КонецЕсли;
	
	СУЗ = МаркировкаС.НайтиСправочник("СтанцииУправленияЗаказамиИСМП", Новый Структура("Владелец,Пользователь", Организация, Пользователь));
	Если ЗначениеЗаполнено(СУЗ) Тогда
		Результат.Данные = СУЗ;
	Иначе                                    
		ТекстОшибки  = СтрШаблон("Не найдн СУЗ для пользователя: '%1' по организации: '%2' !", СокрЛП(Пользователь), Организация);
		
		Результат.Ошибки.Добавить(ТекстОшибки );			
		Результат.Успешно = Ложь;
	КонецЕсли;                   
	
	Возврат Результат;
КонецФункции //ПолучитьСузПользователя(Пользователь, Организация) Экспорт
