
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)	
	рПроверки = ПроверитьДокументыКОбработке(ПараметрКоманды);	
	
	Для Каждого ТекстОшибки Из рПроверки.ОшибкиДокументов Цикл
		Сообщить(ТекстОшибки, СтатусСообщения.Важное);	
	КонецЦикла; 
	
	Для Каждого ДокСсылка Из рПроверки.ДокументыКОбработке Цикл
		УстановитьРеквизитыОбъекта(ДокСсылка, Новый Структура("Статус", Перечисления.СтатусыДокументовМаркировки.КОбработке));
		
		рОтправки = МаркировкаВС.ОтправитьНаОбработку_ГенерацияГТИН(ДокСсылка);		
		
		Если рОтправки.Успешно Тогда
			рЗагрузки = Документы.ЗапросКодовМаркировки.ЗагрузитьГТИНизЛогов(ДокСсылка);
			
			Если рЗагрузки.Успешно Тогда
				ОповеститьОбИзменении(ДокСсылка);
				Оповестить("ИзмененСтатус", , ДокСсылка);	
			Иначе
				ТексОшибки = МаркировкаК.ВывестиОшибки(рЗагрузки);
				УстановитьРеквизитыОбъекта(ДокСсылка, Новый Структура("Статус,ТекстОшибки", Перечисления.СтатусыДокументовМаркировки.ОшибкаОбработки, ТексОшибки));
			КонецЕсли;
		Иначе
			ТексОшибки = МаркировкаК.ВывестиОшибки(рОтправки);
			УстановитьРеквизитыОбъекта(ДокСсылка, Новый Структура("Статус,ТекстОшибки", Перечисления.СтатусыДокументовМаркировки.ОшибкаОбработки, ТексОшибки));
			
			МаркировкаК.ВывестиОшибки(рОтправки);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ПроверитьДокументыКОбработке(мСсылки)
	Результат = Новый Структура("ОшибкиДокументов,ДокументыКОбработке", Новый Массив, Новый Массив);	
	
	Для Каждого ДокСсылка Из мСсылки Цикл
		
		рПроверки = Документы.ЗапросКодовМаркировки.ПроверитьДокументПередОтправкойВЧЗ(ДокСсылка);
		Если рПроверки.Успешно Тогда
			Результат.ДокументыКОбработке.Добавить(ДокСсылка);
		Иначе
			МаркировкаКС.ДобавитьОшибки(Результат.ОшибкиДокументов, рПроверки);				
		КонецЕсли;
		
	КонецЦикла; 	
	
	Возврат Результат;
КонецФункции // ()
 