Перем НачСостНакладной;

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)			
	ЕстьИзменения		=Модифицированность();
		
	Если НЕ ОбменДанными.Загрузка Тогда		
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
		Если Отказ Тогда Возврат КонецЕсли; 
	КонецЕсли;	
		
	Если НЕ ЕстьИзменения Тогда Возврат КонецЕсли;		
			
	ОбъемДокумента		= Товары.Итог("Объем");
	КоличествоДокумента = Товары.Итог("Количество");
	ГруппыТоваров		= ГруппыТоваровДокумента(ЭтотОбъект);	
КонецПроцедуры

Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам)
	Для Каждого НаборДвижений Из ДвиженияПоРегистрам Цикл
		ИмяРегистра		=НаборДвижений.Ключ;
		ТаблицаДвижения =НаборДвижений.Значение;
		
		Если Движения.Найти(ИмяРегистра)=Неопределено Тогда Возврат  КонецЕсли; 
		
		НаборЗаписей=Движения[ИмяРегистра];		
		НаборЗаписей.Очистить();
		
		Для Каждого Движение Из ТаблицаДвижения Цикл
			Запись=НаборЗаписей.Добавить();	
			ЗаполнитьЗначенияСвойств(Запись,Движение);	
			
			Запись.Регистратор=Ссылка;
		КонецЦикла;	
	КонецЦикла;	
КонецПроцедуры 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)	
	Для Каждого ТекСтрокаТовары Из Товары Цикл		
		Движение = Движения.РезервыТМЦ.Добавить();
		
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Заказ			= Ссылка;
		Движение.Склад			= Склад.ФизическийСклад;
		Движение.Получатель		= Склад;
		Движение.Номенклатура	= ТекСтрокаТовары.Номенклатура;
		Движение.Количество		= ТекСтрокаТовары.Количество;
	КонецЦикла;	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	Если Основание=Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;
		
	ВидОснования	= Основание.Метаданные().Имя;
	
	ВариантЗаполнения=Неопределено;
	#ЕСЛИ КЛИЕНТ ТОГДА
	ВариантЗаполнения=ВыбратьВариантЗаполнения();
	#КОНЕЦЕСЛИ
	Если ВариантЗаполнения=Неопределено Тогда
		ВариантЗаполнения="Целиком";
	КонецЕсли;	
	
	ДокОснование	= Основание;
	
	ИБ				= Основание.ИБ;
	
	Если ВидОснования="Перемещение" Тогда
		Склад		= ДокОснование.СкладПолучатель;	
	Иначе		
		Склад		= ПолучитьРеквизитОбъекта(ДокОснование,"Склад");	
	КонецЕсли;	
	ГруппыТоваров	= ПолучитьРеквизитОбъекта(ДокОснование,"ГруппыТоваров");
				
	Если ВариантЗаполнения="РазницаСНабором" Тогда
		Форма=Обработки.СравнениеЛистовНабора.ПолучитьФорму();		
		Форма.Документ		=ДокОснование;
	
		РезультатСравнения	=Форма.ПолучитьОшибкиНабора();	
		ТН					=РезультатСравнения.ТН;
		
		Дата				=ДокОснование.Дата;
		ДатаОтгрузки		=Дата;
		
		Комментарий		= "Недостача по ";
	Иначе
		Комментарий		= "";
	КонецЕсли;	
	
	Комментарий=Комментарий+ДокОснование.Метаданные()+" № " + ДокОснование.Номер + " от " + Формат(ДокОснование.Дата,"ДФ=dd.MM.yy");
	
	Для Каждого исхСтрокаТЧ Из ДокОснование.Товары Цикл
		СтрокаТЧ = Товары.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,исхСтрокаТЧ);	
		Если ВариантЗаполнения="НехватающиеЗаявка" Тогда
			СтрокаТЧ.ПодтвержденнаяЗаявка	=исхСтрокаТЧ.Заявка-исхСтрокаТЧ.Количество;
			СтрокаТЧ.Количество				=СтрокаТЧ.ПодтвержденнаяЗаявка;				
			СтрокаТЧ.Заявка					=СтрокаТЧ.ПодтвержденнаяЗаявка;
		ИначеЕсли ВариантЗаполнения="НехватающиеПодтверждение" Тогда
			СтрокаТЧ.ПодтвержденнаяЗаявка	=исхСтрокаТЧ.ПодтвержденнаяЗаявка-исхСтрокаТЧ.Количество;
			СтрокаТЧ.Количество				=СтрокаТЧ.ПодтвержденнаяЗаявка;				
			СтрокаТЧ.Заявка					=СтрокаТЧ.ПодтвержденнаяЗаявка;
		ИначеЕсли ВариантЗаполнения="Целиком" Тогда			
			Если СтрокаТЧ.Заявка=0 Тогда
				СтрокаТЧ.Заявка	=СтрокаТЧ.Количество;			
			КонецЕсли;
			Если СтрокаТЧ.ПодтвержденнаяЗаявка=0 Тогда
				СтрокаТЧ.ПодтвержденнаяЗаявка=СтрокаТЧ.Количество;
			КонецЕсли;
		ИначеЕсли ВариантЗаполнения="РазницаСНабором" Тогда
			СтрокаТН=ТН.Найти(СтрокаТЧ.Номенклатура,"Номенклатура");
			Если СтрокаТН=Неопределено Тогда
				СтрокаТЧ.Количество=0;	
			Иначе
				СтрокаТЧ.Количество				=СтрокаТН.Разница;
				СтрокаТЧ.Заявка					=СтрокаТН.Разница;
				СтрокаТЧ.ПодтвержденнаяЗаявка	=СтрокаТН.Разница;
			КонецЕсли;			
		КонецЕсли;		
						
		Если СтрокаТЧ.Количество=0 Тогда
			Товары.Удалить(СтрокаТЧ);	
		Иначе
			РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект);
		КонецЕсли; 
	КонецЦикла;	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)	
	Автор				=Неопределено;
КонецПроцедуры

ЗаписьБезКонтроля=Ложь;