
//&НаКлиенте
//Процедура ВнешнееСобытие(Источник, Событие, Данные)
//	// Вставить содержимое обработчика.
//	Если ВРег(Событие) = ВРег("Штрихкод") Тогда
//		глСобытиеСканераОбработано = Истина;
//		ОбработкаШтрихкода(Данные);
//	КонецЕсли;
//КонецПроцедуры

//&НаКлиенте
//Процедура ОбработкаШтрихкода(Данные)
//	
//	// получим данные по сосканированному штрихкоду
//	//Если ВводДоступен() Тогда
//	//	глСобытиеСканераОбработано = Истина;
//	//	Штрихкод = Данные; 
//	//	ПолучитьФЛ();
//	//	//QRCodeПриИзменении(Неопределено);
//	//КонецЕсли;
//	
//	ЭтоМаркаЧЗ = Ложь;
//	Марка = "";	
//	Если Найти(Данные, МаркировкаКлиентСервер.РазделительGS1()) > 0 Тогда  //Марка с GS
//		
//		Марка = СтрЗаменить(Данные, МаркировкаКлиентСервер.РазделительGS1(),"<GS>");
//		Марка = ?(Лев(Марка, 4) = "<GS>", Сред(Марка, 5), Марка);
//		ЭтоМаркаЧЗ = Истина;		
//	ИначеЕсли СтрДлина(СокрЛП(Данные)) > 30 и СтрНайти(Лев(СокрЛП(Данные),3),"01") > 0 Тогда //Отсканирована Марка
//		Марка = СокрЛП(Данные);
//		ЭтоМаркаЧЗ = Истина;
//	Иначе
//		ПоказатьПредупреждение(, "Требуется сканирование марки ЧЗ");
//		Возврат;
//	КонецЕсли;
//	Если ЭтоМаркаЧЗ Тогда
//		ШКПоиска = Лев(СтрЗаменить(Марка, "<GS>", ""), 31);
//		НайтиПоз(Неопределено);
//	КонецЕсли;	
//КонецПроцедуры

//&НаСервере
//Функция ПровВозврат()
//	Рез = "";
//	ТЗК = ТЗПоз.Выгрузить();
//	ТЗК1 = ТЗПоз.Выгрузить();
//	Если ТЗК.Количество() = 0 Тогда
//		Рез = "Не выбраны позиции к возврату - создание возврата невозможно!"; 
//		Возврат Рез;
//	КонецЕсли;
//	ТЗК.Свернуть("Заказ");
//	Если ТЗК.Количество() > 1 Тогда
//		Рез = "Более 1 заказа к возврату - создание возврата невозможно;"; 
//		Возврат Рез;
//	КонецЕсли;
//	ТЗК1.Свернуть("Вкл");
//	Пров = Ложь;
//	Для Каждого ТСтр Из ТЗК1 Цикл
//		Если ТСтр.Вкл = Истина Тогда
//			Пров = Истина;
//		КонецЕсли;	
//	КонецЦикла;	
//	Если НЕ Пров Тогда
//		Рез = "Нет выбранных позиций к возврату - создание возврата невозможно;"; 
//	КонецЕсли;
//	Возврат Рез;
//КонецФункции

//&НаСервере
//Функция СоздатьВозврат()
//	Рез = Новый Структура;
//	НовВидОпл = Неопределено;
//	//ЧекПрод = ТЗПоз.Получить(0).ЧекПродажи;
//	//Рез.Вставить("ЧекПрод", ЧекПрод);
//	//Запр = Новый Запрос;
//	//Запр.Текст = 
//	//"ВЫБРАТЬ
//	//|	ЧекКоррекцииОплата.ВидОплаты КАК ВидОплаты
//	//|ИЗ
//	//|	Документ.ЧекКоррекции.Оплата КАК ЧекКоррекцииОплата
//	//|ГДЕ
//	//|	ЧекКоррекцииОплата.Ссылка.ДокОснование = &ЧекПрод
//	//|	И ЧекКоррекцииОплата.Ссылка.ЧекПробитНаККМ";
//	//Запр.УстановитьПараметр("ЧекПрод", ЧекПрод);
//	//Выб = Запр.Выполнить().Выбрать();
//	//Если Выб.Следующий() Тогда
//	//	НовВидОпл = Выб.ВидОплаты;
//	//КонецЕсли;
//	
//	Взв = Документы.Возврат1ИМ.СоздатьДокумент();
//	//ЗаполнитьЗначенияСвойств(Чек, ЧекПрод);	
//	Взв.ДокОснование =  ЗаказИМ;
//	Взв.Дата = ТекущаяДатаСеанса();
//	Взв.Автор					= Пользователи.ТекущийПользователь();
//	Взв.Организация = ЗаказИМ.Организация;
//	Взв.Подразделение = ЗаказИМ.Подразделение;
//	Взв.Склад = ЗаказИм.Склад; 
//	Взв.Контрагент = ЗаказИМ.Контрагент;
//	Взв.НомерИнетЗаказа = ЗаказИМ.НомерИнетЗаказа;
//	Взв.НомерЛогистЗаказа = ЗаказИМ.НомерЛогистЗаказа;
//	Взв.УстановитьНовыйНомер(ПланыОбмена.ОбменСТЦ.ЭтотУзел().Код + "-");
//	//Чек.КодОперации = Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя;
//	Для Каждого ТекПоз Из ТЗПоз Цикл
//		Если ТекПоз.Вкл Тогда
//		//Если ТекСтрокаТовары.КоличествоВЧек > 0 Тогда
//			НайдыНом = ЗаказИМ.Товары.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", ТекПоз.Номенклатура, ТекПоз.ХарактеристикаНоменклатуры)); 
//			ТекСтрокаТовары = НайдыНом[0];
//			ТекСтр = Взв.Товары.Добавить();
//			ТекСтр.Единица = ТекСтрокаТовары.Единица;
//			ТекСтр.Количество = ТекПоз.Количество;
//			//ТекСтр.КоличествоПодтвержденное = ТекСтрокаТовары.Количество;
//			ТекСтр.Коэффициент = ТекСтрокаТовары.Коэффициент;
//			ТекСтр.Номенклатура = ТекСтрокаТовары.Номенклатура;
//			ТекСтр.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
//			
//			ТекСтр.Цена = ТекСтрокаТовары.Цена;
//			ТекСтр.ЦенаБезСкидки = ТекСтрокаТовары.ЦенаБезСкидки;
//			//ТекСтр.Скидка = ТекСтрокаТовары.Скидка;
//			//ТекСтр.НДС = ТекСтрокаТовары.НДС;
//			ТекСтр.Всего = ТекСтр.Цена * ТекСтр.Количество;
//			//ТекСтр.ВсегоОФД = ТекСтр.Цена * ТекСтр.Количество; 
//			//ТекСтр.СуммаСкидки = (ТекСтр.ЦенаБезСкидки * ТекСтр.Количество) - ТекСтр.ВсегоОФД; 
//			//ТекСтр.Менеджер = РСПСсылка.ПродавецДляЧека;
//			//ТекСтр.Менеджер = ТекСтрокаТовары.Менеджер;
//			//ТекСтр.СкидкаМаксма = ТекСтрокаТовары.СкидкаМаксма * (ТекСтр.Количество/ТекСтрокаТовары.Количество);
//			//ТекСтр.УчтенаСкидкаМаксма = ТекСтрокаТовары.УчтенаСкидкаМаксма;
//			ТекСтр.СтавкаНДС = ТекСтрокаТовары.СтавкаНДС; 
//			
//			ПроцНДС = Перечисления.СтавкиНДС.ПроцентНДС(ТекСтр.СтавкаНДС);
//			Всего = ТекСтр.Всего;
//			ТекСтр.НДС = Окр(ПроцНДС * Всего/(100 + ПроцНДС), 2);
//			ТекСтр.Сумма	= Всего - ТекСтр.НДС;
//		КонецЕсли;
//	КонецЦикла;

//	//Чек.СистемаНалогообложения = Справочники.Организации.ПолучитьСистемуНалогообложения(Чек.Дата, Чек.Организация);
//	//Чек.Комментарий = "Док. основание " + СокрЛП(РСПСсылка) + ", клиент " + СокрЛП(РСПСсылка.Контрагент);
//	
//	
//	Взв.СуммаДокумента			= Взв.Товары.Итог("Всего");
//	//ЭтотОбъект.СуммаОплатыСертификатами	= ЭтотОбъект.ОплатаПодарочнымиСертификатами.Итог("СуммаОплатыСертификатами");
//	//Взв.КоличествоДокумента		= Взв.Товары.Итог("Количество");
//	//Чек.ЧекПробитНаККМ = Ложь;
//	//Чек.БаллыБаланс = 0; 
//	//Чек.БаллыЧекНачислено = 0;
//	//Чек.БаллыЧекСписано = 0; 
//	//Чек.Архивный = Ложь;
//	Для Каждого ТекПоз Из ТЗПоз Цикл
//		Если ТекПоз.Вкл Тогда
//			НовСтр = Взв.ШтрихкодыУпаковок.Добавить();
//			НовСтр.Номенклатура = ТекПоз.Номенклатура;
//			НовСтр.ХарактеристикаНоменклатуры = ТекПоз.ХарактеристикаНоменклатуры;
//			НовСтр.ШтрихкодУпаковки = ТекПоз.КМ;
//			//НовСтр.ШтрихкодУпаковкиТовара = ТекПоз.КМ;
//			//НовСтр.Тэг_1265 =  ТекПоз.Тэг_1265;
//			//НовСтр.ОтветРазрешительногоРежима =  ТекСтрокаШК.ОтветРазрешительногоРежима;
//		КонецЕсли;
//	КонецЦикла; 
//	//Если НовВидОпл = Неопределено Тогда
//	//	НовО = Чек.Оплата.Добавить();
//	//	НовО.ВидОплаты = ЧекПрод.Оплата[0].ВидОплаты;
//	//	НовО.Сумма = Чек.СуммаДокумента;
//	//Иначе
//	//	НовО = Чек.Оплата.Добавить();
//	//	НовО.ВидОплаты = НовВидОпл;
//	//	НовО.Сумма = Чек.СуммаДокумента;	
//	//КонецЕсли;	
//	Взв.Записать(РежимЗаписиДокумента.Проведение);
//	//Рез = Чек.Ссылка;
//	Рез.Вставить("Ключ", Взв.Ссылка); 
//		
//	
//		
//	Возврат Рез;
//КонецФункции

//&НаКлиенте
//Процедура ОК(Команда)
//	// Вставить содержимое обработчика. 
//	ВС = ПровВозврат();
//	Если НЕ ПустаяСтрока(ВС) Тогда
//		ПоказатьПредупреждение(, ВС);
//		Возврат;
//	КонецЕсли;
//	
//	//Оповещение = Новый ОписаниеОповещения("ВопросПечатьКМ", ЭтотОбъект, ДополнительныеПараметры);
//	//ПоказатьВопрос(Оповещение, "Вывести на печать выбранные КМ?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
//	ДополнительныеПараметры = Новый Структура;	
//	Оповещение = Новый ОписаниеОповещения("ВопросПечатьКМ", ЭтотОбъект, ДополнительныеПараметры);
//	ПоказатьВопрос(Оповещение, "Вывести на печать выбранные КМ?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
//	
//	//ВС = СоздатьЧекВозврат();
//	////ТабД = ВС.ТабДок;
//	////ТабД.Показать("Печать КМ чеку возврата " + СокрЛП(ВС.Ключ));
//	//ПараметрыФормы = Новый Структура;
//	//ПараметрыФормы.Вставить("Ключ", ВС.Ключ);
//	//ПараметрыФормы.Вставить("Основание", ВС.ЧекПрод);
//	//ПараметрыФормы.Вставить("КодОперации", ПредопределенноеЗначение("Перечисление.КодыОперацийОстатки.ВозвратОтПокупателя"));
//	////Если Параметры.Свойство("КодОперации") Тогда
//	////	Объект.КодОперации = Параметры.КодОперации;
//	//ОткрытьФорму("Документ.ЧекККМ.Форма.ФормаРМК", ПараметрыФормы);
//	//ЭтаФорма.Закрыть();
//КонецПроцедуры

//&НаКлиенте
//Процедура ВопросПечатьКМ(Результат, Параметры) Экспорт
//	
//	Если Результат = КодВозвратаДиалога.Да Тогда
//		ПечатьКМ(Неопределено);
//	КонецЕсли;
//	ВС = СоздатьВозврат();
//	//ТабД = ВС.ТабДок;
//	//ТабД.Показать("Печать КМ чеку возврата " + СокрЛП(ВС.Ключ));
//	//ПараметрыФормы = Новый Структура;
//	//ПараметрыФормы.Вставить("Ключ", ВС.Ключ);
//	//ПараметрыФормы.Вставить("Основание", ВС.ЧекПрод);
//	//ПараметрыФормы.Вставить("КодОперации", ПредопределенноеЗначение("Перечисление.КодыОперацийОстатки.ВозвратОтПокупателя"));
//	////Если Параметры.Свойство("КодОперации") Тогда
//	////	Объект.КодОперации = Параметры.КодОперации;
//	//ОткрытьФорму("Документ.Возврат1ИМ.Форма.ФормаДокумента", ПараметрыФормы);
//	//ЭтаФорма.Закрыть();
//	
//	РезультатЗакрытия = Новый Структура;
//	РезультатЗакрытия.Вставить("ДокВозврат",	ВС.Ключ);
//    ЭтаФорма.Закрыть(РезультатЗакрытия);
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПеренестиНаСервере()
//	// Вставить содержимое обработчика.   
//	ТЗПоз.Очистить();
//	Запр = Новый Запрос;
//	Запр.Текст =
//	"ВЫБРАТЬ
//	|	ЗаказИМШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковкиТовара,
//	|	ЗаказИМШтрихкодыУпаковок.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
//	|	ЗаказИМШтрихкодыУпаковок.Номенклатура КАК Номенклатура,
//	|	ЗаказИМШтрихкодыУпаковок.Ссылка КАК Ссылка,
//	|	ЗаказИМШтрихкодыУпаковок.ШтрихкодУпаковки.ЗначениеШтрихкода КАК ШтрихкодУпаковки
//	|ИЗ
//	|	Документ.ЗаказИМ.ШтрихкодыУпаковок КАК ЗаказИМШтрихкодыУпаковок
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказИМ.ШтрихкодыУпаковокВозврат КАК ЗаказИМШтрихкодыУпаковокВозврат
//	|		ПО ЗаказИМШтрихкодыУпаковок.Ссылка = ЗаказИМШтрихкодыУпаковокВозврат.Ссылка
//	|			И ЗаказИМШтрихкодыУпаковок.ШтрихкодУпаковки = ЗаказИМШтрихкодыУпаковокВозврат.ШтрихкодУпаковки
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Возврат1ИМ.ШтрихкодыУпаковок КАК Возврат1ИМШтрихкодыУпаковок
//	|		ПО ЗаказИМШтрихкодыУпаковок.Ссылка = Возврат1ИМШтрихкодыУпаковок.Ссылка.ДокОснование
//	|			И ЗаказИМШтрихкодыУпаковок.ШтрихкодУпаковки = Возврат1ИМШтрихкодыУпаковок.ШтрихкодУпаковки
//	|			И Возврат1ИМШтрихкодыУпаковок.Ссылка.Проведен
//	|ГДЕ
//	|	ЗаказИМШтрихкодыУпаковок.Ссылка = &Заказ
//	|	И ЗаказИМШтрихкодыУпаковокВозврат.ШтрихкодУпаковки ЕСТЬ NULL
//	|	И Возврат1ИМШтрихкодыУпаковок.ШтрихкодУпаковки ЕСТЬ NULL";
//	
//	Запр.УстановитьПараметр("Заказ", ЗаказИМ);	
//	Выб = Запр.Выполнить().Выбрать();
//	//Для Каждого ТСтр Из ТЗШК Цикл
//	Пока Выб.Следующий() Цикл
//		НовС = ТЗПоз.Добавить();
//		НовС.Заказ = ЗаказИМ;
//		НовС.Номенклатура = Выб.Номенклатура;
//		НовС.ХарактеристикаНоменклатуры = Выб.ХарактеристикаНоменклатуры;
//		НовС.Количество = 1;
//		НовС.КМ = Выб.ШтрихкодУпаковкиТовара; 
//		НовС.ШККМ = Выб.ШтрихкодУпаковки;

//	КонецЦикла;	
//	
//КонецПроцедуры

//&НаСервере
//Функция НетКМ()
//	Возврат ?(ЗаказИМ.ШтрихкодыУпаковок.Количество() = 0, Истина, Ложь);
//КонецФункции	

//&НаКлиенте
//Процедура Перенести(Команда)
//	//Если НЕ ЗначениеЗаполнено(ЧекРеализации) Тогда
//	//	ПоказатьПредупреждение(, "Не выбран чек продажи");
//	//	Возврат;
//	//КонецЕсли;
//	//Если НетКМ() Тогда
//	//	ПоказатьПредупреждение(, "Нет КМ в чеке продажи для создания возврата используйте стандартный режим создания чека возврата");
//	//	Возврат;
//	//КонецЕсли;
//	ПеренестиНаСервере();
//КонецПроцедуры

//&НаСервере
//Функция НайтиНаСервере()
//	// Вставить содержимое обработчика.  
//	Рез = "Не найдено по КМ";
//		
//	ТЗПоз.Очистить();
//	Запр = Новый Запрос;
//	Запр.Текст =
//	"ВЫБРАТЬ
//	|	ЗаказИМШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковкиТовара,
//	|	ЗаказИМШтрихкодыУпаковок.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
//	|	ЗаказИМШтрихкодыУпаковок.Номенклатура КАК Номенклатура,
//	|	ЗаказИМШтрихкодыУпаковок.Ссылка КАК Ссылка,
//	|	ЗаказИМШтрихкодыУпаковок.ШтрихкодУпаковки.ЗначениеШтрихкода КАК ШтрихкодУпаковки
//	|ИЗ
//	|	Документ.ЗаказИМ.ШтрихкодыУпаковок КАК ЗаказИМШтрихкодыУпаковок
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказИМ.ШтрихкодыУпаковокВозврат КАК ЗаказИМШтрихкодыУпаковокВозврат
//	|		ПО ЗаказИМШтрихкодыУпаковок.Ссылка = ЗаказИМШтрихкодыУпаковокВозврат.Ссылка
//	|			И ЗаказИМШтрихкодыУпаковок.ШтрихкодУпаковки = ЗаказИМШтрихкодыУпаковокВозврат.ШтрихкодУпаковки
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Возврат1ИМ.ШтрихкодыУпаковок КАК Возврат1ИМШтрихкодыУпаковок
//	|		ПО ЗаказИМШтрихкодыУпаковок.Ссылка = Возврат1ИМШтрихкодыУпаковок.Ссылка.ДокОснование
//	|			И ЗаказИМШтрихкодыУпаковок.ШтрихкодУпаковки = Возврат1ИМШтрихкодыУпаковок.ШтрихкодУпаковки
//	|			И Возврат1ИМШтрихкодыУпаковок.Ссылка.Проведен
//	|ГДЕ
//	|	ЗаказИМШтрихкодыУпаковок.Ссылка = &Заказ
//	|	И ЗаказИМШтрихкодыУпаковок.ШтрихкодУпаковки.Наименование = &ШтрихкодУпаковки
//	|	И ЗаказИМШтрихкодыУпаковокВозврат.ШтрихкодУпаковки ЕСТЬ NULL
//	|	И Возврат1ИМШтрихкодыУпаковок.ШтрихкодУпаковки ЕСТЬ NULL";
//	
//	Запр.УстановитьПараметр("Заказ", ЗаказИМ);
//	Запр.УстановитьПараметр("ШтрихкодУпаковки", ШКПоиска);
//	Выб = Запр.Выполнить().Выбрать();
//	//Для Каждого ТСтр Из ТЗШК Цикл
//	Если Выб.Следующий() Тогда
//		НовС = ТЗПоз.Добавить(); 
//		НовС.Вкл = Истина;
//		НовС.Заказ = ЗаказИМ;
//		НовС.Номенклатура = Выб.Номенклатура;
//		НовС.ХарактеристикаНоменклатуры = Выб.ХарактеристикаНоменклатуры;
//		НовС.Количество = 1;
//		НовС.КМ = Выб.ШтрихкодУпаковкиТовара; 
//		НовС.ШККМ = Выб.ШтрихкодУпаковки;
//        Рез = "Найдено по КМ";
//	КонецЕсли;
//	
//	Возврат Рез;
//КонецФункции

//&НаКлиенте
//Процедура НайтиПоз(Команда)
//	НайдыШК = ТЗПоз.НайтиСтроки(Новый Структура("ШККМ", ШКПоиска));
//	Если НайдыШК.Количество() Тогда
//		ПоказатьПредупреждение(, "Сканированная марка уже в списке для возврата");
//		Возврат;
//	КонецЕсли;	
//	Отв = НайтиНаСервере();
//	ПоказатьПредупреждение(, Отв);
//КонецПроцедуры

//&НаКлиенте
//Процедура Очистить(Команда)
//	// Вставить содержимое обработчика.  
//	ТЗПоз.Очистить();
//КонецПроцедуры

//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	//Вставить содержимое обработчика
//	ТипШК = 24;
//	ЗаказИМ = Параметры.ЗаказИМ;
//КонецПроцедуры

//&НаСервере
//Процедура ПечатьКМНаСервере()
//	// Вставить содержимое обработчика.
//КонецПроцедуры

//&НаСервере
//Функция СоздатьТабДок()
//	СтрВозврат = Новый Структура;
//	ТабДок = Новый ТабличныйДокумент;
//	ВнешняяКомпонента = ОбщегоНазначенияВызовСервераПИ.ПодключитьКомпонентуГенерацииИзображенияШтрихкода();
//	Эталон = ПолучитьОбщийМакет("Эталон");
//	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
//	ПараметрыШтрихкода = Новый Структура;
//	ПараметрыШтрихкода.Вставить("Ширина", Окр(120 / КоличествоМиллиметровВПикселе));
//	ПараметрыШтрихкода.Вставить("Высота", Окр(120 / КоличествоМиллиметровВПикселе));
//	ПараметрыШтрихкода.Вставить("Штрихкод", "");
//	ПараметрыШтрихкода.Вставить("ТипКода", ТипШК);
//	ПараметрыШтрихкода.Вставить("ОтображатьТекст", Ложь);
//	ПараметрыШтрихкода.Вставить("РазмерШрифта", 8);
//	ВнешняяКомпонента.Ширина = ПараметрыШтрихкода.Ширина;
//	ВнешняяКомпонента.Высота = ПараметрыШтрихкода.Высота;
//	ВнешняяКомпонента.АвтоТип = Ложь;
//	//ВнешняяКомпонента.ТипКода = ТипШК;
//	ВнешняяКомпонента.ТипКода = 24;
//	ВнешняяКомпонента.ОтображатьТекст = ПараметрыШтрихкода.ОтображатьТекст;
//	Попытка
//		ВнешняяКомпонента.РазмерШрифта = ПараметрыШтрихкода.РазмерШрифта;
//	Исключение
//		
//	КонецПопытки;
//	ШрифтЗаголовок = Новый Шрифт(, 8, Истина); 
//	ТК = 1;
//	ТабДок.Область(1, 1).Шрифт = ШрифтЗаголовок;

//	ТабДок.Область(1, 1).ШиринаКолонки = 46;
//	ТабДок.Область(1, 2).ШиринаКолонки = 26;
//	ТабДок.Область(1, 1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
//	ТабДок.Область(1, 1).ВертикальноеПоложение = ВертикальноеПоложение.Центр; 
//	НП = 1;
//	КолП = 0;
//	Для Каждого ТекПоз Из ТЗПоз Цикл
//		Если ТекПоз.Вкл Тогда
//			ТабДок.Область(НП, 1).Шрифт = ШрифтЗаголовок;
//			ТабДок.Область(НП, 1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
//			ТабДок.Область(НП, 1).ВертикальноеПоложение = ВертикальноеПоложение.Центр; 
//			ТабДок.Область(НП, 2).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
//			ТабДок.Область(НП, 2).ВертикальноеПоложение = ВертикальноеПоложение.Центр;
//			ТабДок.Область(НП, 1).РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
//			ТабДок.Область(НП, 1).ВысотаСтроки = 116; 
//		
//			Марка1 = СокрЛП(ТекПоз.ШККМ);
//			Если НЕ Лев(Марка1, 2) = "01" И НЕ Сред(Марка1, 2, 2) = "01" Тогда
//				ТМарка1 = ПолучитьСтрокуИзДвоичныхДанных(Base64Значение(Марка1), КодировкаТекста.UTF8);
//				
//			Иначе
//				ТМарка1 = Марка1;
//			КонецЕсли; 
//			//+HELP-3942 20250408 Михайловский
//			//1-й символ chr(29) бывает и не берется в ЧЗ, вроде как
//			ТМарка1 = СтрЗаменить(ТМарка1, Символ(29), "<GS>");
//			ТМарка1 = ?(Лев(ТМарка1, 4) = "<GS>", Сред(ТМарка1, 5), ТМарка1);
//			ТМарка = СтрЗаменить(ТМарка1,"<GS>",Символ(29));
//			
//			//ТабДок.Область(НП, 1).Текст = СокрЛП(ТСтр.НомерСтроки);
//			ТабДок.Область(НП, 1).Текст = СокрЛП(ТекПоз.Номенклатура) + " " + СокрЛП(ТекПоз.ХарактеристикаНоменклатуры);

//			ПараметрыШтрихкода.Штрихкод = ТМарка;
//			
//			// Формируем картинку штрихкода
//			ВнешняяКомпонента.ЗначениеКода = ПараметрыШтрихкода.Штрихкод;
//			ДвоичныеДанныеКартинки = ВнешняяКомпонента.ПолучитьШтрихкод();
//			Карт = Новый Картинка(ДвоичныеДанныеКартинки);
//			//НовС.Картинка = Новый Картинка(ДвоичныеДанныеКартинки); 
//			ТабДок.Область(НП, 2).Картинка = Карт; 
//			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
//			//Новый Картинка(ДвоичныеДанныеКартинки);
//			//КонецЕсли; 
//			НП = НП + 1; 
//			
//		КонецЕсли;
//	КонецЦикла;
//	СтрВозврат.Вставить("ТабДок", ТабДок);
//	СтрВозврат.Вставить("НП", НП);	
//	
//	Возврат СтрВозврат;
//	//ТабДок;
//КонецФункции

//&НаКлиенте
//Процедура ПечатьКМ(Команда) 
//	НетВывод = Истина;
//	Для Каждого ТекПоз Из ТЗПоз Цикл
//		Если ТекПоз.Вкл Тогда
//			НетВывод = Ложь;
//			Прервать;
//		КонецЕсли;
//	КонецЦикла;
//	Если НетВывод Тогда
//		ПоказатьПредупреждение(, "Не выбраны позиции с КМ");
//		Возврат;
//	КонецЕсли;	
//	ВС = СоздатьТабДок();
//	
//	ТабД = ВС.ТабДок;
//	КПоз= ВС.НП - 1;
//	ТабД.ВысотаСтраницы = 38 * КПоз;
//	ТабД.ШиринаСтраницы = 56;
//	ТабД.ПолеСверху = 0;
//	ТабД.ПолеСнизу = 0;
//	ТабД.ПолеСлева = 0;
//	ТабД.ПолеСправа = 0;
//	ТабД.ИмяПараметровПечати			= "ПараметрыПечати_КМ";
//	ТабД.Показать("Печать КМ чеку возврата");
//КонецПроцедуры
