
&НаСервере
Перем ЕстьИзмененияПоБензину;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	 //Объект.Дата=ТекущаяДата();
ПриОткрытииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриОткрытииНаСервере ()
	 если Объект.Дата<=Объект.кДокументу.дата тогда
		Объект.Дата=Объект.кДокументу.дата-1;
	КонецЕсли;
	

КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ТекОстаток1=ПоказанияНачальныхОстатков(Объект.Автомобиль, НачалоДня(Объект.Дата));
	ТекОстаток2=ПоказанияНачальныхОстатков(Объект.Автомобиль, КонецДня(Объект.Дата));

	Запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ
	              |	ПутевойЛист.Ссылка КАК Ссылка,
	              |	ПутевойЛист.Дата КАК Дата
	              |ИЗ
	              |	Документ.ПутевойЛист КАК ПутевойЛист
	              |ГДЕ
	              |	ПутевойЛист.Дата >= &Дата
	              |	И ПутевойЛист.Автомобиль = &Автомобиль
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	Дата";

	запрос.УстановитьПараметр("Дата",НачалоДня(объект.Дата));	
	запрос.УстановитьПараметр("Автомобиль",Объект.Автомобиль);
	результат=запрос.Выполнить().Выбрать();
	ПараметрыСеанса.Ошибки="";
	пока результат.Следующий() цикл
		Путевка=результат.ссылка.получитьобъект();
		если ложь тогда Путевка =Документы.ПутевойЛист.СоздатьДокумент();КонецЕсли;
		РежимЗаписи=?(Путевка.Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись);
		СтарыйОстатокТопливаВыезд= Путевка.ОстатокТопливаВыезд;
		СтарыйОстатокТопливаВозврат=Путевка.ОстатокТопливаВозврат;
		
		
		Путевка.ЗаправкаНаМаршруте=ПолучитьЗаправку(результат.ссылка);
		Путевка.ОстатокТопливаВыезд=ПоказанияНачальныхОстатков(Путевка.Автомобиль, НачалоДня(Путевка.Дата));
		Путевка.ОстатокТопливаВозврат=Путевка.ОстатокТопливаВыезд+Путевка.ЗаправкаНаМаршруте-Путевка.Расход;


		если СтарыйОстатокТопливаВозврат<>Путевка.ОстатокТопливаВозврат или СтарыйОстатокТопливаВозврат<>Путевка.ОстатокТопливаВыезд тогда
			Путевка.Записать(РежимЗаписи);
			
			ПараметрыСеанса.Ошибки=ПараметрыСеанса.Ошибки+"Перерасчитаны данные "+Путевка+" выезд с " +СтарыйОстатокТопливаВыезд+" на "+Путевка.ОстатокТопливаВыезд +". возврат с "
			+СтарыйОстатокТопливаВозврат+" на "+Путевка.ОстатокТопливаВозврат+Символы.ПС;	
		КонецЕсли;

	КонецЦикла;
	
	
	
КонецПроцедуры



// Кухарь  18.05.2022 начало
//


Функция ПолучитьЗаправку(Путевка)
	Запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ
	              |	ЗаправкаГСМ.Ссылка КАК Ссылка,
	              |	ЗаправкаГСМ.Количество КАК Количество
	              |ИЗ
	              |	Документ.ЗаправкаГСМ КАК ЗаправкаГСМ
	              |ГДЕ
	              |	ЗаправкаГСМ.Проведен
	              |	И ЗаправкаГСМ.кДокументу = &Путевка";
	запрос.УстановитьПараметр("Путевка",Путевка);
	результат=запрос.Выполнить().выбрать();

	
	пока результат.Следующий() цикл
		возврат результат.Количество;
	КонецЦикла;
	
	возврат 0;
	
КонецФункции
	
	
	
Функция ЕстьИзмененияПоБензину()
	ЕстьИзменения=ложь;

	если Объект.Количество<>Объект.Ссылка.Количество или Объект.Автомобиль<>Объект.ссылка.Автомобиль или НачалоДня(объект.Дата)<>НачалоДня(Объект.ссылка.Дата)  тогда
		ЕстьИзменения=Истина;
	КонецЕсли;	
	
	Возврат ЕстьИзменения;
	
КонецФункции


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекОстаток1=ПоказанияНачальныхОстатков(Объект.Автомобиль, НачалоДня(Объект.Дата));
	ТекОстаток2=ПоказанияНачальныхОстатков(Объект.Автомобиль, КонецДня(Объект.Дата));
	
	
	Если ЕстьИзмененияПоБензину() тогда
		ЕстьИзмененияПоБензину=Истина
		//Объект.ОстатокТопливаВыезд = МодульПутевогоЛиста.ПоказанияНачальныхОстатков(Объект.Автомобиль, Объект.Дата);
	иначе
		ЕстьИзмененияПоБензину=Ложь;
	КонецЕсли;
	
	

КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Сообщение=ПолучитьОшибки();
	//Предупреждение(Сообщение);
	
КонецПроцедуры



&НаСервере
Функция ПолучитьОшибки()
	//Текст=ПараметрыСеанса.Ошибки;
	//ПараметрыСеанса.Ошибки="";
	возврат "";
КонецФункции
//Кухарь  18.05.2022 конец

&НаСервереБезКонтекста
Функция ПоказанияНачальныхОстатков(Автомобиль,Дата)
	Возврат Документы.ПутевойЛист.ПоказанияНачальныхОстатков(Автомобиль,Дата);
КонецФункции // ()
