Перем НомерДок;

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//крохин начало 29.05.2014
	//записи формируем только в ЦО, и надо перенести в "перед записью"
	//Если ПараметрыСеанса.ЭтотУзел.ТипУзла <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
	//	Возврат;	
	//КонецЕсли;
	////крохин конец 29.05.2014
	//пн = 0;
	
	
	
	
	//	Ответ = Вопрос("Доумент с данным номером сертификата существует, перезаписать", РежимВопроса, 0);
	//	Если Ответ = КодВозвратаДиалога.Нет Тогда
	//		возврат;
	//	иначе
	//		СД.Записать();
	//	КонецЕсли;
	
//	//Лобан +++ 180814
//	НЗ=РегистрыСведений.История.СоздатьНаборЗаписей();
//	НЗ.Отбор.Документ.Установить(Ссылка,Истина);
//	НЗ.Отбор.Реквизит.Установить("Декларация",Истина);
//	НЗ.Записать();
//	//Лобан --- 180814	
//		
//	НЗ=РегистрыСведений.История.СоздатьНаборЗаписей();
//	ДатаНомера = Дата;
//	НЗ.Отбор.Период.Установить(ДатаНомера,Истина);
//	НЗ.Отбор.Документ.Установить(Ссылка,Истина);
//	НЗ.Отбор.Реквизит.Установить("Декларация",Истина);
//	
//	
//	Для Каждого Строка Из Товары Цикл
//		Если НЕ Строка.Номенклатура.Пустая() Тогда
//			если ЗаписьВИсторию = истина тогда	
//			РД=РегистрыСведений.Декларация.СоздатьНаборЗаписей();
//			РД.Отбор.Документ.Установить(Ссылка,Истина);
//			РД.Отбор.Объект.Установить(Строка.Номенклатура,Истина);  
//			ЗаписьРД=РД.Добавить(); 
//			ЗаписьРД.Объект		=Строка.Номенклатура;
//			ЗаписьРД.ДатаНачала = ДатаНачала;
//			ЗаписьРД.ДатаОкончания = ДатаОкончания;
//			ЗаписьРД.Сертификат  = Сертификат;
//			ЗаписьРД.Документ		=Ссылка;
//			ЗаписьРД.Значение		=Ссылка.СправочникДекларации;
//			РД.Записать();
//			иначе
//	
//			РД=РегистрыСведений.Декларация.СоздатьНаборЗаписей();
//			РД.Отбор.Документ.Установить(Ссылка,Истина);
//			РД.Отбор.Объект.Установить(Строка.Номенклатура,Истина);  
//			ЗаписьРД=РД.Добавить(); 
//			ЗаписьРД.Объект		=Строка.Номенклатура;
//			ЗаписьРД.ДатаНачала = ДатаНачала;
//			ЗаписьРД.ДатаОкончания = ДатаОкончания;
//			ЗаписьРД.Сертификат  = Сертификат;
//			ЗаписьРД.Документ		=Ссылка;
//			ЗаписьРД.Значение		=Ссылка.СправочникДекларации;
//			
//			Запись=НЗ.Добавить();
//			Запись.Период		=ДатаНомера; 	
//			Запись.Объект		=Строка.Номенклатура;
//			Запись.Реквизит		="Декларация";
//			Запись.Документ		=Ссылка;
//			ФилиалДанные = Строка.Филиал; 
//			Если СправочникДекларации.Пустая()тогда
//				
//				СД = Справочники.Декларация.СоздатьЭлемент();
//			иначе
//				//Сообщить(СправочникДекларации);
//				СД =  СправочникДекларации.Ссылка.ПолучитьФорму();
//			КонецЕсли;	
//			СД.ДатаНачала = ДатаНачала;
//			СД.ДатаОкончания = ДатаОкончания;
//			СД.ВидДокумента = ВидДок;
//			СД.Изготовитель = Изготовитель;
//			СД.Орган = Орган; 
//			СД.Филиал = ФилиалДанные;
//			СД.Наименование = НомерДокумента; 	
//			СД.СтранаПроисхождения = СтранаПроисхождения;
//			СД.Организация = Организация;
//			СД.Сертификат = Сертификат;
//			СД.Записать(); 
//			
//			СправочникДекларации = СД.Ссылка;
//			ЗаписьРД.Значение		=СД.Ссылка;
//			ЗаписьРД.Регистратор	=Ссылка;
//			Запись.Значение		=СД.Ссылка;
//			Запись.Регистратор	=Ссылка;	
//			
//			РД.Записать();
//			КонецЕсли;
//		КонецЕсли;		
//	КонецЦикла;	
//	//если ЭтотОбъект.ПолучитьФорму().ЭлементыФормы.РегистрДекларации.Значение <> истина тогда	
//	НЗ.Записать();
//	//иначе КонецЕсли;
//КонецПроцедуры

////Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
////	пн = "0";
////	Для Каждого Строчка из Товары цикл
////			если НЕ ПустаяСтрока(Строчка.Филиал) тогда
////				ФилиалДанные = Строчка.Филиал;
////			иначе  
////				ФилиалДанные = Филиал;
////			КонецЕсли;  
////			Если СправочникДекларации.Пустая()Или Филиал<>Строчка.Филиал  тогда

////		СД = Справочники.Декларация.СоздатьЭлемент();
////иначе
////	 СД =  СправочникДекларации.Ссылка.ПолучитьФорму();
////КонецЕсли;	
////	СД.ДатаНачала = ДатаНачала;
////	СД.ДатаОкончания = ДатаОкончания;
////	СД.ВидДокумента = ВидДок;
////	СД.Изготовитель = Изготовитель;
////	СД.Орган = Орган; 
////	СД.Филиал = ФилиалДанные;
////	пн = пн+1;
////	СД.Объект = Строчка.Номенклатура;
////	СД.Наименование = НомерДокумента+"/"+пн; 	
////	СД.СтранаПроисхождения = СтранаПроисхождения;
////	//РежимВопроса = РежимДиалогаВопрос.ДаНет;
////		//Если НомерДокумента  <> Док.Наименование тогда 
////			СД.Записать(); 
////	//пн=пн+1;		
////		КонецЦикла;

////	СправочникДекларации = сд.Ссылка;
////	
//////Иначе             
////	НомерДок = Справочники.Декларация.НайтиПоНаименованию(НомерДокумента);

КонецПроцедуры
