
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Сканировщик = ПараметрыСеанса.Пользователь;
	
	РежимСканирования = Перечисления.РежимСканирования.Добавление;
	
	ПодтверждатьЭтикеткуОнлайнСканированием = Истина; // Кельманов А.В. - SNL-233 - 2026.05.15
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Функция ПроверкаРНК(ТекстОшибки = "")
		
	ОтгрузкаКомплектов = Ложь;
	
	ИспользоватьЛНТолькоДляНабора = ИспользоватьЛНТолькоДляНабора(РНК);
	
	Если Не ИспользоватьЛНТолькоДляНабора Тогда
		
		ТекстОшибки = "Для накладной не установлен признак ""Использовать ЛН только для набора""!";
		
		Возврат Ложь;
		
	КонецЕсли;

	ДопПараметрыНакладной = ОбщегоНазначения_ПИ.ПолучитьДопПараметрыНакладной(РНК);
	
	Если Не ДопПараметрыНакладной.ОтгрузкаFBS Тогда
		
		ТекстОшибки = "Это не накладная FBS!";
		
		Возврат Ложь;
		
	КонецЕсли;

	Если РНК.СостояниеНакладной <> Перечисления.СостоянияНакладной.ОжиданиеПереукладки И РНК.СостояниеНакладной <> Перечисления.СостоянияНакладной.Переукладка Тогда
		
		ТекстОшибки = "Состояние накладной: " + РНК.СостояниеНакладной + ". Допустимые состояния: ""Ожидание переукладки"" и ""Переукладка""";
		
		Возврат Ложь;
		
	КонецЕсли;
	
	ОтгрузкаКомплектов = РНК.ОтгрузкаКомплектов;
	
	Возврат Истина;
		
КонецФункции

&НаСервере
Процедура ЗаполнитьЛистыПереукладки()
	
	ЛистыПереукладки.Очистить();
	
	Если Не ЗначениеЗаполнено(РНК) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛистПереукладки.Ссылка КАК ЛП
	               |ИЗ
	               |	Документ.ЛистПереукладки КАК ЛистПереукладки
	               |ГДЕ
	               |	ЛистПереукладки.ДокОснование = &РНК
	               |	И НЕ ЛистПереукладки.Завершен
	               |	И НЕ ЛистПереукладки.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("РНК", РНК);
	
	ЛистыПереукладки.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

// Кельманов А.В. - ИЗМ-0000000063 - 2026.06.19
&НаСервере
Процедура ЗаполнитьТовары_ПланФакт()
	
	Товары_ПланФакт.Очистить();
	
	Элементы.Товары_ПланФакт.ПодчиненныеЭлементы.Товары_ПланФактКоличество.ТекстПодвала = Товары_ПланФакт.Итог("Количество");
	Элементы.Товары_ПланФакт.ПодчиненныеЭлементы.Товары_ПланФактОтсканировано.ТекстПодвала = Товары_ПланФакт.Итог("Отсканировано");
		
	Если Не ЗначениеЗаполнено(РНК) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(РасходнаяНакладнаяТовары.Количество) КАК Количество,
	               |	МИНИМУМ(РасходнаяНакладнаяТовары.НомерСтроки) КАК НомерСтроки
	               |ПОМЕСТИТЬ ВТ_РНК
	               |ИЗ
	               |	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	               |ГДЕ
	               |	РасходнаяНакладнаяТовары.Ссылка = &РНК
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасходнаяНакладнаяТовары.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЛистПереукладкиТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(ЛистПереукладкиТовары.Отсканировано) КАК Количество
	               |ПОМЕСТИТЬ ВТ_ЛП
	               |ИЗ
	               |	Документ.ЛистПереукладки.Товары КАК ЛистПереукладкиТовары
	               |ГДЕ
	               |	ЛистПереукладкиТовары.Ссылка.ДокОснование = &РНК
	               |	И ЛистПереукладкиТовары.Ссылка.Проведен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛистПереукладкиТовары.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_РНК.Номенклатура КАК Номенклатура,
	               |	ВТ_РНК.Количество КАК Количество,
	               |	ЕСТЬNULL(ВТ_ЛП.Количество, 0) КАК Отсканировано
	               |ИЗ
	               |	ВТ_РНК КАК ВТ_РНК
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЛП КАК ВТ_ЛП
	               |		ПО ВТ_РНК.Номенклатура = ВТ_ЛП.Номенклатура
	               |ГДЕ
	               |	ВТ_РНК.Количество > 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВТ_РНК.НомерСтроки";
	
	Запрос.УстановитьПараметр("РНК", РНК);
	
	Товары_ПланФакт.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Элементы.Товары_ПланФакт.ПодчиненныеЭлементы.Товары_ПланФактКоличество.ТекстПодвала = Товары_ПланФакт.Итог("Количество");
	Элементы.Товары_ПланФакт.ПодчиненныеЭлементы.Товары_ПланФактОтсканировано.ТекстПодвала = Товары_ПланФакт.Итог("Отсканировано");
	
	// Кельманов А.В. - Изменение 0000000063 - 2026.07.10 {
	Если ОтгрузкаКомплектов Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	РасходнаяНакладнаяКомплектующие.Номенклатура КАК Номенклатура,
		               |	СУММА(РасходнаяНакладнаяКомплектующие.Количество) КАК Количество,
		               |	МИНИМУМ(РасходнаяНакладнаяКомплектующие.НомерСтроки) КАК НомерСтроки
		               |ПОМЕСТИТЬ ВТ_РНК
		               |ИЗ
		               |	Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
		               |ГДЕ
		               |	РасходнаяНакладнаяКомплектующие.Ссылка = &РНК
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РасходнаяНакладнаяКомплектующие.Номенклатура
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РасходнаяНакладнаяКомплектующие.Продукция КАК Продукция,
		               |	РасходнаяНакладнаяКомплектующие.Номенклатура КАК Номенклатура,
		               |	РасходнаяНакладнаяКомплектующие.Количество КАК КоличествоКомплектующего
		               |ПОМЕСТИТЬ ВТ_Продукция
		               |ИЗ
		               |	Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
		               |ГДЕ
		               |	РасходнаяНакладнаяКомплектующие.Ссылка = &РНК
		               |;
		               |
		               |ВЫБРАТЬ
		               |	ВТ_Продукция.Продукция КАК Продукция,
		               |	ВТ_Продукция.Номенклатура КАК Номенклатура,
		               |	ВТ_Продукция.КоличествоКомплектующего КАК КоличествоКомплектующего,
		               |	СУММА(РасходнаяНакладнаяКомплектующие.КоличествоПродукции) КАК КоличествоПродукции
		               |ПОМЕСТИТЬ ВТ_КоличествоПродукции
		               |ИЗ
		               |	ВТ_Продукция КАК ВТ_Продукция
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
		               |		ПО ВТ_Продукция.Продукция = РасходнаяНакладнаяКомплектующие.Продукция
		               |ГДЕ
		               |	РасходнаяНакладнаяКомплектующие.Ссылка = &РНК
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ_Продукция.Продукция,
		               |	ВТ_Продукция.Номенклатура,
		               |	ВТ_Продукция.КоличествоКомплектующего
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_КоличествоПродукции.Номенклатура КАК Номенклатура,
		               |	СУММА(ВТ_КоличествоПродукции.КоличествоКомплектующего * ЛистПереукладкиТовары.Количество / ВТ_КоличествоПродукции.КоличествоПродукции) КАК Количество
		               |ПОМЕСТИТЬ ВТ_ЛП
		               |ИЗ
		               |	Документ.ЛистПереукладки.Товары КАК ЛистПереукладкиТовары
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КоличествоПродукции КАК ВТ_КоличествоПродукции
		               |		ПО ЛистПереукладкиТовары.Номенклатура = ВТ_КоличествоПродукции.Продукция
		               |ГДЕ
		               |	ЛистПереукладкиТовары.Ссылка.ДокОснование = &РНК
		               |	И ЛистПереукладкиТовары.Ссылка.Проведен
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ_КоличествоПродукции.Номенклатура
		               |;
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_РНК.Номенклатура КАК Номенклатура,
		               |	ВТ_РНК.Количество КАК Количество,
		               |	ЕСТЬNULL(ВТ_ЛП.Количество, 0) КАК Отсканировано
		               |ИЗ
		               |	ВТ_РНК КАК ВТ_РНК
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЛП КАК ВТ_ЛП
		               |		ПО ВТ_РНК.Номенклатура = ВТ_ЛП.Номенклатура
		               |ГДЕ
		               |	ВТ_РНК.Количество > 0
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ВТ_РНК.НомерСтроки";
				
		Запрос.УстановитьПараметр("РНК", РНК);
		
		Комплектующие_ПланФакт.Загрузить(Запрос.Выполнить().Выгрузить());
		
		Элементы.Комплектующие_ПланФакт.ПодчиненныеЭлементы.Комплектующие_ПланФактКоличество.ТекстПодвала = Комплектующие_ПланФакт.Итог("Количество");
		Элементы.Комплектующие_ПланФакт.ПодчиненныеЭлементы.Комплектующие_ПланФактОтсканировано.ТекстПодвала = Комплектующие_ПланФакт.Итог("Отсканировано");
		
	КонецЕсли;
	// Кельманов А.В. - Изменение 0000000063 - 2026.07.10 }
	
КонецПроцедуры

&НаКлиенте
Процедура РНКПриИзменении(Элемент)

	ОбработатьИзменениеРНК();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеРНК(ТекстОшибки = "")
	
	Если ЗначениеЗаполнено(РНК) И Не ПроверкаРНК(ТекстОшибки) Тогда
		
		РНК = Неопределено;
		
	КонецЕсли;
	
	// Кельманов А.В. - ИЗМ-0000000122 - 2026.06.26 {
	Если НужноОбновитьНакладнуюПоЗаказу(РНК) Тогда
		
		ОбновитьНакладнуюПоЗаказу(РНК);
		
	КонецЕсли;
	// Кельманов А.В. - ИЗМ-0000000122 - 2026.06.26 }

	ЗаполнитьЛистыПереукладки();	
	ЗаполнитьТовары_ПланФакт(); // Кельманов А.В. - ИЗМ-0000000063 - 2026.06.19
	
	Товары.Очистить();
	ШтрихкодыУпаковок.Очистить();
	
	ОжидаемыйДляСканированияКодЧЗ = Неопределено; 
	ОтсканированныйОжидаемыйКодЧЗ = Неопределено; 
	
	НомерЗаказаFBS = Неопределено; 
	ШтрихКодFBS = Неопределено; 
	ПрефиксЗаказа = Неопределено; 
	СуффиксЗаказа = Неопределено; 
	ТекШтукаСпайка = Неопределено; 
	
	ДатаНачалаСканирования = Неопределено;

	ТекущийЛП = Неопределено;
	ТекущийЛСК = Неопределено;
	ПоследнийЛП = Неопределено;
	ЗСБ = Неопределено;
	ТаблицаДанныхМатрицы = Неопределено;
	ТипКороба = Неопределено;
	
	Товары_ТекущийЛП.Очистить();
	ШтрихкодыУпаковок_ТекущийЛП.Очистить();
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
    ГруппаТестТолькоПросмотр = Не РольДоступна("Администратор");
	
	Элементы.РНК.ТолькоПросмотр = ГруппаТестТолькоПросмотр;
	Элементы.РежимСканирования.ТолькоПросмотр = ГруппаТестТолькоПросмотр;
	Элементы.ИмитацияСканирования.ТолькоПросмотр = ГруппаТестТолькоПросмотр;
	
	Если ЗначениеЗаполнено(РНК) Тогда
		
		Заголовок = "Формирование заказов FBS: " + РНК;
		
		Элементы.НадписьОтсканируйтеЗНБ.Видимость = Ложь;		
		Элементы.ГруппаСтраницы.Видимость = Истина;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСканирование;
		
		Элементы.ПланФактКомплектующие.Видимость = ОтгрузкаКомплектов; // Кельманов А.В. - Изменение 0000000063 - 2026.07.10
	
		Элементы.НадписьОтсканируйте.Видимость = Истина;
		
		Если (Не ЗначениеЗаполнено(ТекущийЛП) И Не ЗначениеЗаполнено(ТипКороба)) Или ИзменениеТипаКороба Тогда
			
			Элементы.НадписьОтсканируйте.Заголовок = "Укажите тип короба (отсканируйте ШК коробки)";
			
		ИначеЕсли ЗначениеЗаполнено(НадписьОтсканируйтеПоследнее) Тогда
			
			Элементы.НадписьОтсканируйте.Заголовок = НадписьОтсканируйтеПоследнее;
			
			НадписьОтсканируйтеПоследнее = "";
			
		ИначеЕсли ОтгрузкаКомплектов Тогда
			
			Элементы.НадписьОтсканируйте.Заголовок = "Отсканируйте код ЧЗ комплектующей или штрихкод упаковки";
			
		Иначе
			
			Элементы.НадписьОтсканируйте.Заголовок = "Отсканируйте код ЧЗ штуки товара";
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущийЛП) Тогда
			
			Элементы.НадписьЛП.Заголовок = ТекущийЛП;
			
		Иначе
			
			Элементы.НадписьЛП.Заголовок = "Лист переукладки: [Будет создан новый]";
			
		КонецЕсли;
		
		Если ЛистыПереукладки.Количество() > 0 Тогда
			
			Элементы.ГруппаНезавершённыеЛП.Видимость = Истина;
			
		Иначе
			
			Элементы.ГруппаНезавершённыеЛП.Видимость = Ложь;
			
		КонецЕсли;
	
		Если Товары_ТекущийЛП.Количество() > 0 Или ШтрихкодыУпаковок_ТекущийЛП.Количество() > 0 Тогда
			
			Элементы.ГруппаТекущийЛП.Видимость = Истина;
			
		Иначе
			
			Элементы.ГруппаТекущийЛП.Видимость = Ложь;
			
		КонецЕсли;
		
		Элементы.ИзменитьТипКороба.Доступность = ЗначениеЗаполнено(ТипКороба) И Не ИзменениеТипаКороба;
	
	Иначе
		
		Заголовок = "Формирование заказов FBS";
		
		Элементы.НадписьОтсканируйтеЗНБ.Видимость = Истина;		
		Элементы.ГруппаСтраницы.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмитацияСканированияПриИзменении(Элемент)
	
	ВнешнееСобытие(Неопределено, "BarCodeValue", ИмитацияСканирования); 
	
	ИмитацияСканирования = "";

КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если Не ВводДоступен() Тогда 
		Возврат; 
	КонецЕсли;
	
	Если Не ЭтоСобытиеСканера(Событие) Тогда 
		Возврат; 
	КонецЕсли;
	
	Данные = СтрЗаменить(Данные, Символы.ПС, "");
	
	// Кухарь А.Ю.  27.03.2026 начало
	// Пустая задача
	Данные = СтрЗаменить(Данные, Символ(29), "");
	// Кухарь А.Ю.  27.03.2026 конец	
	
	ТекстОшибки = "";
	
	// Кельманов А.В. - SNL-233 - 2026.05.15 {
	Если ЗначениеЗаполнено(ОжидаемыйДляСканированияКодЛП) Тогда 
		
		Если Данные = ОжидаемыйДляСканированияКодЛП Тогда
			
			ОжидаемыйДляСканированияКодЛП = Неопределено;
			
			Сообщить("Этикетка онлайн отсканирована");
			
			Если ЗавершитьРаботуПоНакладнойПослеСканированияЭтикеткиОнлайн Тогда
				
				ЗавершитьРаботуПоНакладнойПослеСканированияЭтикеткиОнлайн = Ложь;
				
				Сообщить("Формирование заказов FBS по " + РНК + " завершено");
				
				РНК = Неопределено;
				
				ОбработатьИзменениеРНК();
				
			Иначе
				
				УстановитьВидимость();
				
			КонецЕсли;
			
		Иначе
			
			ТекстОшибки = "Отсканируйте распечатанную этикетку онлайн (QR код: " + ОжидаемыйДляСканированияКодЛП + ")";
			
			Сообщить(ТекстОшибки);
			
		КонецЕсли;
		
		ДопИнфо = "ЛП FBS - Сканирование этикетки онлайн";
		
		ЗаписатьФактСканирования(Данные, ТекстОшибки, ДопИнфо);
		
		Возврат;
			
	КонецЕсли;
	// Кельманов А.В. - SNL-233 - 2026.05.15 }

	Если Не ЗначениеЗаполнено(РНК) Тогда
		
		ЗаданиеПоШК = глНайтиДокПоШК(Данные, ТекстОшибки);
		
		Если ТипЗнч(ЗаданиеПоШК) = Тип("ДокументСсылка.ЗаданиеНабора") Тогда
			
			РС_ДанныеПоШК = ЗаданиеПоШК;
			РС_НазначениеШК = ПредопределенноеЗначение("Справочник.НазначенияШК.Документ");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ЗаданиеПоШК) Или ТипЗнч(ЗаданиеПоШК) <> Тип("ДокументСсылка.ЗаданиеНабора") Тогда
			
			ТекстСообщения = "Не найдено задание по ШК";
			
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
				
				ТекстОшибки = ТекстОшибки + Символы.ПС + ТекстСообщения;
				
			Иначе
				
				ТекстОшибки = ТекстСообщения;
				
			КонецЕсли;

			Сообщить(ТекстСообщения);
			
		Иначе
			
			РНК = ЗаданиеПоШК.Накладная;
			
			ОбработатьИзменениеРНК(ТекстОшибки);
			
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
				
				Сообщить(ТекстОшибки);
				
			КонецЕсли;
			
		КонецЕсли;
		
		ДопИнфо = "ЛП FBS - Получение накладной по коду ЗНБ";
		
		ЗаписатьФактСканирования(Данные, ТекстОшибки, ДопИнфо);
		
		Возврат;
		
	КонецЕсли;
	
	Если (Не ЗначениеЗаполнено(ТекущийЛП) И Не ЗначениеЗаполнено(ТипКороба)) Или ИзменениеТипаКороба Тогда
		
		ОпределитьТипКороба(Данные, ТекстОшибки);
		
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			
			Сообщить(ТекстОшибки);
			
		Иначе
			
			ИзменениеТипаКороба = Ложь;
			
			УстановитьВидимость();
			
		КонецЕсли; 
		
		ДопИнфо = "ЛП FBS - Сканирование ШК коробки";
		
		ЗаписатьФактСканирования(Данные, ТекстОшибки, ДопИнфо);
		
		Возврат;
			
	КонецЕсли;
			
	Если Не ЗначениеЗаполнено(ДатаНачалаСканирования) Тогда
		
		ДатаНачалаСканирования = ТекущаяДата();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОжидаемыйДляСканированияКодЧЗ) Тогда
		
		Если ОтсканированОжидаемыйДляСканированияКодЧЗ(Данные, ТекстОшибки) Тогда
			
			ОтсканированныйОжидаемыйКодЧЗ = ОжидаемыйДляСканированияКодЧЗ;
			
			ОжидаемыйДляСканированияКодЧЗ = Неопределено;
			
			Элементы.НадписьОтсканируйте.Заголовок = "Отсканируйте код заказа FBS";
			
		Иначе
			
			ТекстСообщения = "Отсканируйте код ЧЗ спайки: " + ОжидаемыйДляСканированияКодЧЗ;
			
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
				
				ТекстОшибки = ТекстОшибки + Символы.ПС + ТекстСообщения;
				
			Иначе
				
				ТекстОшибки = ТекстСообщения;
				
			КонецЕсли;

			Сообщить(ТекстСообщения);
			
		КонецЕсли;
		
		ДопИнфо = "ЛП FBS - Сканирование кода ЧЗ спайки";
		
		ЗаписатьФактСканирования(Данные, ТекстОшибки, ДопИнфо);
		
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ШтрихКодFBS) Или ЗначениеЗаполнено(НомерЗаказаFBS) Тогда
		
		ДопИнфо = "ЛП FBS - Сканирование кода заказа FBS";
		
		Если Данные = ШтрихКодFBS Или Данные = НомерЗаказаFBS Тогда
			
			ЗаписатьОтсканированныеДанные(ТекстОшибки);
			
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
				
				Сообщить(ТекстОшибки);
				
			Иначе
				
				ОбновитьДанныеПоТоварамТекущегоЛП();			
				ОчиститьТекущиеДанныеСканирования(Неопределено);
				
				Если ПроверитьВсёОтсканировано() Тогда
					
					ЗаписатьФактСканирования(Данные, ТекстОшибки, ДопИнфо);
					
					ПечатьЭтикеткаОнлайн(Неопределено);
					
					// Кельманов А.В. - SNL-233 - 2026.05.15 {
					//Сообщить("Формирование заказов FBS по " + РНК + " завершено");
					//
					//РНК = Неопределено;
					//
					//ОбработатьИзменениеРНК();
					Если ЗначениеЗаполнено(ОжидаемыйДляСканированияКодЛП) Тогда
						
						ЗавершитьРаботуПоНакладнойПослеСканированияЭтикеткиОнлайн = Истина;
						
					Иначе
						
						Сообщить("Формирование заказов FBS по " + РНК + " завершено");
						
						РНК = Неопределено;
						
						ОбработатьИзменениеРНК();
						
					КонецЕсли;
					// Кельманов А.В. - SNL-233 - 2026.05.15 }
					
					Возврат;
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			ТекстОшибки = "Отсканируйте код заказа FBS";
			
			Сообщить(ТекстОшибки);
			
		КонецЕсли;
		
		ЗаписатьФактСканирования(Данные, ТекстОшибки, ДопИнфо);
		
		Возврат;
		
	КонецЕсли;
	
	ОбработатьСканированиеШтукиКомплектующей(Данные, ТекстОшибки);
	
	РаспечататьЭтикетки(ТекстОшибки);
	
	Если ОтгрузкаКомплектов Тогда
		
		Если Данные = "8888888890003" Тогда
			
			ДопИнфо = "ЛП FBS - Сканирование кода завершения спайки";
			
		Иначе
			
			ДопИнфо = "ЛП FBS - Сканирование кода комплектующей";
			
		КонецЕсли;
		
	Иначе
		
		ДопИнфо = "ЛП FBS - Сканирование кода ЧЗ товара";
		
	КонецЕсли;
		
	ЗаписатьФактСканирования(Данные, ТекстОшибки, ДопИнфо);	
		
КонецПроцедуры

&НаСервере
Процедура ОбработатьСканированиеШтукиКомплектующей(Данные, ТекстОшибки = "")
	
	Если Не ЗначениеЗаполнено(ТекущийЛП) Тогда
		
		ЛПОбъект = Документы.ЛистПереукладки.СоздатьДокумент();
		
		ЛПОбъект.Заполнить(РНК);
		ЛПОбъект.Дата = ТекущаяДата();
		ЛПОбъект.ДатаНачалаСканирования = ДатаНачалаСканирования;
		ЛПОбъект.Сканировщик = Сканировщик;
		ЛПОбъект.СканировщикФизЛицо = Сканировщик.ФизЛицо;
		ЛПОбъект.ТипКороба = ТипКороба;
		
		// Кельманов А.В. - SNL-234 - 2026.05.15 {
		РезультатПоиска = Документы.ЛистПереукладки.НайтиЕдиныйЗНАПоРНК(РНК);
		
		Если РезультатПоиска.Успех Тогда
			
			ЛПОбъект.ЗаданиеНаАгрегацию = РезультатПоиска.Данные;
			
		КонецЕсли; 
		// Кельманов А.В. - SNL-234 - 2026.05.15 }
	
		ЛПОбъект.Бригада.Загрузить(ТекущаяБригада()); // Кельманов А.В. - SNL-246 - 2026.05.26
		
		ЛПОбъект.ДополнительныеСвойства.Вставить("ЗаписьИзОбработкиFBS", Истина);		
		ЛПОбъект.Записать(РежимЗаписиДокумента.Запись);
		
		ТекущийЛП = ЛПОбъект.Ссылка;
		
		УстановитьВидимость();
			
	КонецЕсли;
	
	ДанныеМаркиЧЗ = Неопределено;
	
	Если ОтгрузкаКомплектов И Данные = "8888888890003" Тогда
		
		ДанныеЗаказаFBS = НайтиШКЗаказаПоЗапчастям(); 
		
		Если ДанныеЗаказаFBS <> Неопределено Тогда
			
			Если ТипЗнч(ДанныеЗаказаFBS) = Тип("Строка") Тогда
				
				ТекстОшибки = ДанныеЗаказаFBS;
				
				Сообщить(ТекстОшибки);
				
				Возврат;
				
			КонецЕсли;
			
			ШтрихКодFBS = ДанныеЗаказаFBS.ШтрихКодFBS;
			НомерЗаказаFBS = ДанныеЗаказаFBS.НомерЗаказаFBS;
			ПрефиксЗаказа = ДанныеЗаказаFBS.ПрефиксЗаказа;
			СуффиксЗаказа = ДанныеЗаказаFBS.СуффиксЗаказа;
			ТекШтукаСпайка = ДанныеЗаказаFBS.Продукция;
			
			ОжидаемыйДляСканированияКодЧЗ = ПолучитьКодЧЗСпайкиИзЗСБ(ТекШтукаСпайка, ТекстОшибки);
			
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
				
				Сообщить(ТекстОшибки);
				
				Возврат;
				
			КонецЕсли;
			
			Элементы.НадписьОтсканируйте.Заголовок = "Отсканируйте код ЧЗ спайки: " + ОжидаемыйДляСканированияКодЧЗ;
			
		Иначе
			
			ТекстОшибки = "Заказ FBS по отсканированным комплектующим не найден. Проверьте, что в накладной есть спайка с отсканированным составом.";
			
			Сообщить(ТекстОшибки);
			
			Возврат;
			
		КонецЕсли;
			
	Иначе
		
		Номенклатура = НайтиТоварПоШтрихКоду(Данные, Перечисления.ТипыШтрихКодов.Штука, , ДанныеМаркиЧЗ, , , ТекстОшибки);
		
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			
			Возврат;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Номенклатура) Тогда
			
			РС_ДанныеПоШК = Номенклатура;
			РС_НазначениеШК = ПредопределенноеЗначение("Справочник.НазначенияШК.Товар");
			РС_ТипШК = Перечисления.ТипыШтрихКодов.Штука;
			
		КонецЕсли;
		
		ЭтоТовар = (ЗначениеРеквизитаОбъекта(Номенклатура.Родитель, "ВидНоменклатуры") = Перечисления.ВидыНоменклаутры.Товар);
		
		Если ДанныеМаркиЧЗ.СканировалиКодЧЗ 
			Или (ОтгрузкаКомплектов И Не ЭтоТовар) Тогда
			
			Если ДанныеМаркиЧЗ.СканировалиКодЧЗ Тогда
				
				МассСтрокЧЗ = ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("ШтрихкодУпаковки", ДанныеМаркиЧЗ.МаркаЧЗ));
				
				Если МассСтрокЧЗ.Количество() = 0 Тогда
					
					Запрос = Новый Запрос; 
					
					Запрос.Текст = "ВЫБРАТЬ
					               |	ЛистПереукладки.Ссылка КАК Ссылка
					               |ИЗ
					               |	Документ.ЛистПереукладки КАК ЛистПереукладки
					               |ГДЕ
					               |	ЛистПереукладки.ДокОснование = &РНК
					               |	И ЛистПереукладки.ШтрихкодыУпаковок.ШтрихкодУпаковки = &ШтрихкодУпаковки
					               |	И ЛистПереукладки.Проведен";
					
					Запрос.УстановитьПараметр("РНК", РНК);
					Запрос.УстановитьПараметр("ШтрихкодУпаковки", ДанныеМаркиЧЗ.МаркаЧЗ);
					
					Выборка = Запрос.Выполнить().Выбрать();
					
					Если Выборка.Следующий() Тогда
						
						ТекстОшибки = "Код " + ДанныеМаркиЧЗ.МаркаЧЗ + " уже был ранее отсканирован в ЛП по данной накладной";
						
					КонецЕсли;
					
				Иначе
					
					ТекстОшибки = "Код " + ДанныеМаркиЧЗ.МаркаЧЗ + " уже был отсканирован ранее";
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ТекстОшибки) Тогда
					
					Сообщить(ТекстОшибки);
					
					Возврат;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ОтгрузкаКомплектов Тогда
				
				МассСтрокНоменклатура = РНК.Комплектующие.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура)); 
				
			Иначе
				
				МассСтрокНоменклатура = РНК.Товары.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура)); 
				
			КонецЕсли;
			
			Если МассСтрокНоменклатура.Количество() = 0 Тогда
				
				ТекстОшибки = "Номенклатуры " + Номенклатура + " нет в накладной";
				
				Сообщить(ТекстОшибки);
				
				Возврат;
				
			КонецЕсли;
			
			Запрос = Новый Запрос; 
			
			Запрос.Текст = "ВЫБРАТЬ
			               |	Товары.Номенклатура КАК Номенклатура,
			               |	Товары.Количество КАК Количество
			               |ПОМЕСТИТЬ ВТ_ТоварыТекущие
			               |ИЗ
			               |	&Товары КАК Товары
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	РасходнаяНакладнаяКомплектующие.Продукция КАК Продукция,
			               |	РасходнаяНакладнаяКомплектующие.Количество КАК КоличествоКомплектующего
			               |ПОМЕСТИТЬ ВТ_Продукция
			               |ИЗ
			               |	Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
			               |ГДЕ
			               |	РасходнаяНакладнаяКомплектующие.Ссылка = &РНК
			               |	И РасходнаяНакладнаяКомплектующие.Номенклатура = &Номенклатура
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТ_Продукция.Продукция КАК Продукция,
			               |	ВТ_Продукция.КоличествоКомплектующего КАК КоличествоКомплектующего,
			               |	СУММА(РасходнаяНакладнаяКомплектующие.КоличествоПродукции) КАК КоличествоПродукции
			               |ПОМЕСТИТЬ ВТ_КоличествоПродукции
			               |ИЗ
			               |	ВТ_Продукция КАК ВТ_Продукция
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
			               |		ПО ВТ_Продукция.Продукция = РасходнаяНакладнаяКомплектующие.Продукция
			               |ГДЕ
			               |	РасходнаяНакладнаяКомплектующие.Ссылка = &РНК
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ВТ_Продукция.Продукция,
			               |	ВТ_Продукция.КоличествоКомплектующего
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТ_ТоварыТекущие.Количество КАК Количество
			               |ПОМЕСТИТЬ ВТ_КоличествоОтсканировано
			               |ИЗ
			               |	ВТ_ТоварыТекущие КАК ВТ_ТоварыТекущие
			               |ГДЕ
			               |	ВТ_ТоварыТекущие.Номенклатура = &Номенклатура
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ
			               |	ЛистПереукладкиТовары.Количество
			               |ИЗ
			               |	Документ.ЛистПереукладки.Товары КАК ЛистПереукладкиТовары
			               |ГДЕ
			               |	ЛистПереукладкиТовары.Ссылка.ДокОснование = &РНК
			               |	И ЛистПереукладкиТовары.Номенклатура = &Номенклатура
			               |	И ЛистПереукладкиТовары.Ссылка.Проведен
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ
			               |	ВТ_КоличествоПродукции.КоличествоКомплектующего * ЛистПереукладкиТовары.Количество / ВТ_КоличествоПродукции.КоличествоПродукции
			               |ИЗ
			               |	Документ.ЛистПереукладки.Товары КАК ЛистПереукладкиТовары
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КоличествоПродукции КАК ВТ_КоличествоПродукции
			               |		ПО ЛистПереукладкиТовары.Номенклатура = ВТ_КоличествоПродукции.Продукция
			               |ГДЕ
			               |	ЛистПереукладкиТовары.Ссылка.ДокОснование = &РНК
			               |	И ЛистПереукладкиТовары.Ссылка.Проведен
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	СУММА(ВТ_КоличествоОтсканировано.Количество) КАК Количество
			               |ПОМЕСТИТЬ ВТ_КоличествоОтсканированоСумма
			               |ИЗ
			               |	ВТ_КоличествоОтсканировано КАК ВТ_КоличествоОтсканировано
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	РасходнаяНакладнаяТовары.Количество КАК Количество
			               |ПОМЕСТИТЬ ВТ_КоличествоНакладная
			               |ИЗ
			               |	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
			               |ГДЕ
			               |	РасходнаяНакладнаяТовары.Ссылка = &РНК
			               |	И РасходнаяНакладнаяТовары.Номенклатура = &Номенклатура
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ
			               |	РасходнаяНакладнаяКомплектующие.Количество
			               |ИЗ
			               |	Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
			               |ГДЕ
			               |	РасходнаяНакладнаяКомплектующие.Ссылка = &РНК
			               |	И РасходнаяНакладнаяКомплектующие.Номенклатура = &Номенклатура
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	СУММА(ВТ_КоличествоНакладная.Количество) КАК Количество
			               |ПОМЕСТИТЬ ВТ_КоличествоНакладнаяСумма
			               |ИЗ
			               |	ВТ_КоличествоНакладная КАК ВТ_КоличествоНакладная
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТ_КоличествоНакладнаяСумма.Количество КАК КоличествоНакладная,
			               |	ВТ_КоличествоОтсканированоСумма.Количество КАК КоличествоОтсканировано
			               |ИЗ
			               |	ВТ_КоличествоОтсканированоСумма КАК ВТ_КоличествоОтсканированоСумма
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КоличествоНакладнаяСумма КАК ВТ_КоличествоНакладнаяСумма
			               |		ПО (ВТ_КоличествоНакладнаяСумма.Количество = ВТ_КоличествоОтсканированоСумма.Количество)";
			
			Запрос.УстановитьПараметр("Товары", Товары.Выгрузить());
			Запрос.УстановитьПараметр("РНК", РНК);
			Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				
				ТекстОшибки = "Номенклатуры " + Номенклатура + " уже отсканировано достаточное количество. Положите отсканированную единицу обратно.";
				
				Сообщить(ТекстОшибки);
				
				Возврат;
				
			КонецЕсли;
			
			МассСтрокОтсканировано = Товары.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура));
			
			Если МассСтрокОтсканировано.Количество() = 0 Тогда
				
				НовСтрТовары = Товары.Добавить();
				
				НовСтрТовары.Номенклатура = Номенклатура;
				НовСтрТовары.Количество = 1;
				
			Иначе
				
				СтрТовары = МассСтрокОтсканировано[0];
				
				СтрТовары.Количество = СтрТовары.Количество + 1;
				
			КонецЕсли;
			
			Если ДанныеМаркиЧЗ.СканировалиКодЧЗ Тогда
				
				НовСтрЧЗ = ШтрихкодыУпаковок.Добавить();
				
				НовСтрЧЗ.ШтрихкодУпаковки = ДанныеМаркиЧЗ.МаркаЧЗ;
				
			КонецЕсли;
			
			// Кельманов А.В. - Изменение 0000000063 - 2026.07.09 {
			Если ОтгрузкаКомплектов И Не ЭтоТовар Тогда
				
				ДанныеЗаказаFBS = НайтиШКЗаказаПоЗапчастям(); 
				
				Если ДанныеЗаказаFBS <> Неопределено Тогда
					
					Если ТипЗнч(ДанныеЗаказаFBS) = Тип("Строка") Тогда
						
						ТекстОшибки = ДанныеЗаказаFBS;
						
						Сообщить(ТекстОшибки);
						
						Возврат;
						
					КонецЕсли;
					
					ШтрихКодFBS = ДанныеЗаказаFBS.ШтрихКодFBS;
					НомерЗаказаFBS = ДанныеЗаказаFBS.НомерЗаказаFBS;
					ПрефиксЗаказа = ДанныеЗаказаFBS.ПрефиксЗаказа;
					СуффиксЗаказа = ДанныеЗаказаFBS.СуффиксЗаказа;
					ТекШтукаСпайка = ДанныеЗаказаFBS.Продукция;
					
					ОжидаемыйДляСканированияКодЧЗ = ПолучитьКодЧЗСпайкиИзЗСБ(ТекШтукаСпайка, ТекстОшибки);
					
					Если ЗначениеЗаполнено(ТекстОшибки) Тогда
						
						Сообщить(ТекстОшибки);
						
						Возврат;
						
					КонецЕсли;
					
					Элементы.НадписьОтсканируйте.Заголовок = "Отсканируйте код ЧЗ спайки: " + ОжидаемыйДляСканированияКодЧЗ;
					
				Иначе
					
					//ТекстОшибки = "Заказ FBS по отсканированным комплектующим не найден. Проверьте, что в накладной есть спайка с отсканированным составом.";
					//
					//Сообщить(ТекстОшибки);
					//
					//Возврат;
					
				КонецЕсли;
				
			КонецЕсли;
			// Кельманов А.В. - Изменение 0000000063 - 2026.07.09 }
			
		Иначе
			
			Если ОтгрузкаКомплектов Тогда
				
				ТекстОшибки = "Отсканируйте код ЧЗ комплектующей или штрихкод упаковки";
				
			Иначе
				
				ТекстОшибки = "Отсканируйте код ЧЗ штуки товара";
				
			КонецЕсли;
			
			Сообщить(ТекстОшибки);
			
			Возврат;
			
		КонецЕсли;
		
		Если Не ОтгрузкаКомплектов Тогда
			
			ДанныеЗаказаFBS = НайтиШКЗаказаПоЗапчастям(); 
			
			Если ДанныеЗаказаFBS <> Неопределено Тогда
				
				Если ТипЗнч(ДанныеЗаказаFBS) = Тип("Строка") Тогда
					
					ТекстОшибки = ДанныеЗаказаFBS;
					
					Сообщить(ТекстОшибки);
					
					Возврат;
					
				КонецЕсли;
				
				ШтрихКодFBS = ДанныеЗаказаFBS.ШтрихКодFBS;
				НомерЗаказаFBS = ДанныеЗаказаFBS.НомерЗаказаFBS;
				ПрефиксЗаказа = ДанныеЗаказаFBS.ПрефиксЗаказа;
				СуффиксЗаказа = ДанныеЗаказаFBS.СуффиксЗаказа;
				ТекШтукаСпайка = ДанныеЗаказаFBS.Продукция;
				
				Элементы.НадписьОтсканируйте.Заголовок = "Отсканируйте код заказа FBS";
				
			Иначе
				
				ТекстОшибки = "Заказ FBS для отсканированного товара не найден";
				
				Сообщить(ТекстОшибки);
				
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
					
КонецПроцедуры

&НаСервере
Функция ОтсканированОжидаемыйДляСканированияКодЧЗ(Данные, ТекстОшибки = "")
	
	ДанныеМаркиЧЗ = Неопределено;
	
	Номенклатура = НайтиТоварПоШтрихКоду(Данные, Перечисления.ТипыШтрихКодов.Штука, , ДанныеМаркиЧЗ, , , ТекстОшибки);

	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		
		РС_ДанныеПоШК = Номенклатура;
		РС_НазначениеШК = ПредопределенноеЗначение("Справочник.НазначенияШК.Товар");
		РС_ТипШК = Перечисления.ТипыШтрихКодов.Штука;
		
	КонецЕсли;
			
	Если ДанныеМаркиЧЗ.СканировалиКодЧЗ И ДанныеМаркиЧЗ.МаркаЧЗ = ОжидаемыйДляСканированияКодЧЗ Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ОпределитьТипКороба(Данные, ТекстОшибки = "")
	
	ТипКороба = Справочники.ТипыКоробов.НайтиПоРеквизиту("ШтрихКод", Данные);			 
	
	Если ТипКороба.Пустая() Тогда
		
		ТекстОшибки = "Не найден тип короба с штрих-кодом: """ + Данные + """ !";
		
	Иначе
		
		РС_ДанныеПоШК = ТипКороба;
		РС_НазначениеШК = ПредопределенноеЗначение("Справочник.НазначенияШК.ТипКороба");
		
		Если ИзменениеТипаКороба И ЗначениеЗаполнено(ТекущийЛП) Тогда
						
			ЛПОбъект = ТекущийЛП.ПолучитьОбъект();			
			ЛПОбъект.ТипКороба = ТипКороба;
			ЛПОбъект.ДополнительныеСвойства.Вставить("ЗаписьИзОбработкиFBS", Истина);			
			ЛПОбъект.Записать(РежимЗаписиДокумента.Запись);
	
		КонецЕсли;
					
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьЛП(Команда)
	
	Если Товары.Количество() > 0 Или ШтрихкодыУпаковок.Количество() > 0 Тогда
		
		Сообщить("Сначала закончите работу с текущим ЛП."); 
		
		Возврат;
		
	КонецЕсли;
	
	Ошибки = "";
	
	АктивироватьЛПНаСервере(Ошибки);
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		
		Сообщить(Ошибки);
		
		Возврат;
		
	КонецЕсли;
	
	УстановитьВидимость();

КонецПроцедуры

&НаСервере
Процедура АктивироватьЛПНаСервере(Ошибки)

	МассСтрок = ЛистыПереукладки.НайтиСтроки(Новый Структура("Выбрать", Истина));	
	
	Если МассСтрок.Количество() <> 1 Тогда
		
		Ошибки = "Нужно выделить 1 ЛП";
		
		Возврат;
		
	КонецЕсли;
	
	ТекущийЛП = МассСтрок[0].ЛП;
	
	ТипКороба = ТекущийЛП.ТипКороба;
	
	МассСтрок[0].Выбрать = Ложь;
	
	ОбновитьДанныеПоТоварамТекущегоЛП();
	
	ТаблицаДанныхМатрицы = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПоТоварамТекущегоЛП()
	
	Товары_ТекущийЛП.Очистить();
	ШтрихкодыУпаковок_ТекущийЛП.Очистить();
	
	Товары_ТекущийЛП.Загрузить(ТекущийЛП.Товары.Выгрузить());
	ШтрихкодыУпаковок_ТекущийЛП.Загрузить(ТекущийЛП.ШтрихкодыУпаковок.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТекущиеДанныеСканирования(Команда)
	
	Товары.Очистить();
	ШтрихкодыУпаковок.Очистить();
	
	ОжидаемыйДляСканированияКодЧЗ = Неопределено; 
	ОтсканированныйОжидаемыйКодЧЗ = Неопределено; 
	
	ШтрихКодFBS = Неопределено;
	НомерЗаказаFBS = Неопределено;
	ПрефиксЗаказа = Неопределено;
	СуффиксЗаказа = Неопределено;
	ТекШтукаСпайка = Неопределено;
						
	Если Не ЗначениеЗаполнено(ТекущийЛП) И ЗначениеЗаполнено(ТипКороба) Тогда
		
		ТипКороба = Неопределено;
			
	КонецЕсли;
			
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Функция НайтиШКЗаказаПоЗапчастям()
	
	СтруктураВозврата = Новый Структура("ШтрихКодFBS, НомерЗаказаFBS, ПрефиксЗаказа, СуффиксЗаказа, Продукция");
	
	ТЗ = Товары.Выгрузить();

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛистПереукладкиШтрихкодыУпаковок.НомерЗаказа КАК НомерЗаказаFBS
	               |ИЗ
	               |	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистПереукладкиШтрихкодыУпаковок
	               |ГДЕ
	               |	ЛистПереукладкиШтрихкодыУпаковок.Ссылка.ДокОснование = &РНК
	               |	И ЛистПереукладкиШтрихкодыУпаковок.Ссылка.Проведен";

	Запрос.УстановитьПараметр("РНК", РНК);
	
	МассивНомеровЗаказаFBS = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерЗаказаFBS");	

	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПолныеДанныеЗаданияНабораКомплектующие.ШтрихКодFBS КАК ШтрихКодFBS,
	               |	ПолныеДанныеЗаданияНабораКомплектующие.НомерЗаказаFBS КАК НомерЗаказаFBS
	               |ПОМЕСТИТЬ ВТ_ШКFBSСОтсканированнойНоменклатурой
	               |ИЗ
	               |	Документ.ПолныеДанныеЗаданияНабора.Комплектующие КАК ПолныеДанныеЗаданияНабораКомплектующие
	               |ГДЕ
	               |	ПолныеДанныеЗаданияНабораКомплектующие.Ссылка.Накладная = &РНК
	               |	И ПолныеДанныеЗаданияНабораКомплектующие.Ссылка.Проведен
	               |	И НЕ ПолныеДанныеЗаданияНабораКомплектующие.НомерЗаказаFBS В (&МассивНомеровЗаказа)
	               |	И ПолныеДанныеЗаданияНабораКомплектующие.Номенклатура В(&Номенклатура)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПолныеДанныеЗаданияНабораКомплектующие.Номенклатура КАК Номенклатура,
	               |	ПолныеДанныеЗаданияНабораКомплектующие.Продукция КАК Продукция,
	               |	ПолныеДанныеЗаданияНабораКомплектующие.ШтрихКодFBS КАК ШтрихКодFBS,
	               |	ПолныеДанныеЗаданияНабораКомплектующие.НомерЗаказаFBS КАК НомерЗаказаFBS,
	               |	ПолныеДанныеЗаданияНабораКомплектующие.ПрефиксЗаказа КАК ПрефиксЗаказа,
	               |	ПолныеДанныеЗаданияНабораКомплектующие.СуффиксЗаказа КАК СуффиксЗаказа,
	               |	ПолныеДанныеЗаданияНабораКомплектующие.Количество КАК Количество
	               |ИЗ
	               |	Документ.ПолныеДанныеЗаданияНабора.Комплектующие КАК ПолныеДанныеЗаданияНабораКомплектующие
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ШКFBSСОтсканированнойНоменклатурой КАК ВТ_ШКFBSСОтсканированнойНоменклатурой
	               |		ПО ПолныеДанныеЗаданияНабораКомплектующие.ШтрихКодFBS = ВТ_ШКFBSСОтсканированнойНоменклатурой.ШтрихКодFBS
	               |			И ПолныеДанныеЗаданияНабораКомплектующие.НомерЗаказаFBS = ВТ_ШКFBSСОтсканированнойНоменклатурой.НомерЗаказаFBS
	               |ГДЕ
	               |	ПолныеДанныеЗаданияНабораКомплектующие.Ссылка.Накладная = &РНК
	               |	И ПолныеДанныеЗаданияНабораКомплектующие.Ссылка.Проведен
	               |ИТОГИ ПО
	               |	ШтрихКодFBS,
	               |	НомерЗаказаFBS";
	
	Запрос.УстановитьПараметр("МассивНомеровЗаказа", МассивНомеровЗаказаFBS); 
	Запрос.УстановитьПараметр("Номенклатура", ТЗ.ВыгрузитьКолонку("Номенклатура"));
	
	ВыборкаШтрихКодFBS = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ШтрихКодFBS");

	Пока ВыборкаШтрихКодFBS.Следующий() Цикл
		
		ВыборкаНомерЗаказаFBS = ВыборкаШтрихКодFBS.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НомерЗаказаFBS");
		
		Пока ВыборкаНомерЗаказаFBS.Следующий() Цикл
			
			Выборка = ВыборкаНомерЗаказаFBS.Выбрать();

			ОбщееКоличество = ТЗ.Итог("Количество");
			КоличествоВЗаказе = 0;
			Продукция = Неопределено;
			ТекПрефиксЗаказа = Неопределено;
			ТекСуффиксЗаказа = Неопределено;
			
			ЗаказНашёлся = Истина;
			
			Пока Выборка.Следующий() Цикл
				
				КоличествоВЗаказе = КоличествоВЗаказе + Выборка.Количество;
				Продукция = Выборка.Продукция;
				ТекПрефиксЗаказа = Выборка.ПрефиксЗаказа;
				ТекСуффиксЗаказа = Выборка.СуффиксЗаказа;
				
				СтрТЗ = ТЗ.Найти(Выборка.Номенклатура);
				
				Если СтрТЗ = Неопределено Тогда
					
					ЗаказНашёлся = Ложь;
					
					Прервать;
					
				КонецЕсли;
				
				Если СтрТЗ.Количество <> Выборка.Количество Тогда
					
					ЗаказНашёлся = Ложь;
					
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если ОбщееКоличество = КоличествоВЗаказе И ЗаказНашёлся Тогда

				ЗаполнитьЗначенияСвойств(СтруктураВозврата, ВыборкаНомерЗаказаFBS);
				СтруктураВозврата.Продукция = Продукция;
				СтруктураВозврата.ПрефиксЗаказа = ТекПрефиксЗаказа;
				СтруктураВозврата.СуффиксЗаказа = ТекСуффиксЗаказа;
				
				Возврат СтруктураВозврата;

			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;	
	
	РанееОтсканированныйНомер = ПроверитьСуществующиеЗаказы(МассивНомеровЗаказаFBS, ТЗ); 

	Если РанееОтсканированныйНомер <> Неопределено Тогда
		
		ТекстСообщения = "Все заказы FBS по данной номенклатуре уже отсканированы!";
		
		Если ОтгрузкаКомплектов Тогда
			
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "номенклатуре", "спайке");
			
		КонецЕсли;
		
		Возврат ТекстСообщения;
		
	КонецЕсли;
	 
	Возврат РанееОтсканированныйНомер;
	
КонецФункции

&НаСервере
Функция ПроверитьСуществующиеЗаказы(МассивНомеровЗаказаFBS, ТЗ); 
	
	СтруктураВозврата = Новый Структура("ШтрихКодFBS, НомерЗаказаFBS");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПолныеДанныеЗаданияНабораКомплектующие.ШтрихКодFBS КАК ШтрихКодFBS,
	               |	ПолныеДанныеЗаданияНабораКомплектующие.НомерЗаказаFBS КАК НомерЗаказаFBS
	               |ПОМЕСТИТЬ ВТ_ШКFBSСОтсканированнойНоменклатурой
	               |ИЗ
	               |	Документ.ПолныеДанныеЗаданияНабора.Комплектующие КАК ПолныеДанныеЗаданияНабораКомплектующие
	               |ГДЕ
	               |	ПолныеДанныеЗаданияНабораКомплектующие.Ссылка.Накладная = &РНК
	               |	И ПолныеДанныеЗаданияНабораКомплектующие.Ссылка.Проведен
	               |	И ПолныеДанныеЗаданияНабораКомплектующие.НомерЗаказаFBS В(&МассивНомеровЗаказа)
	               |	И ПолныеДанныеЗаданияНабораКомплектующие.Номенклатура В(&Номенклатура)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПолныеДанныеЗаданияНабораКомплектующие.Номенклатура КАК Номенклатура,
	               |	ПолныеДанныеЗаданияНабораКомплектующие.ШтрихКодFBS КАК ШтрихКодFBS,
	               |	ПолныеДанныеЗаданияНабораКомплектующие.НомерЗаказаFBS КАК НомерЗаказаFBS,
	               |	ПолныеДанныеЗаданияНабораКомплектующие.Количество КАК Количество
	               |ИЗ
	               |	Документ.ПолныеДанныеЗаданияНабора.Комплектующие КАК ПолныеДанныеЗаданияНабораКомплектующие
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ШКFBSСОтсканированнойНоменклатурой КАК ВТ_ШКFBSСОтсканированнойНоменклатурой
	               |		ПО ПолныеДанныеЗаданияНабораКомплектующие.ШтрихКодFBS = ВТ_ШКFBSСОтсканированнойНоменклатурой.ШтрихКодFBS
	               |			И ПолныеДанныеЗаданияНабораКомплектующие.НомерЗаказаFBS = ВТ_ШКFBSСОтсканированнойНоменклатурой.НомерЗаказаFBS
	               |ГДЕ
	               |	ПолныеДанныеЗаданияНабораКомплектующие.Ссылка.Накладная = &РНК
	               |	И ПолныеДанныеЗаданияНабораКомплектующие.Ссылка.Проведен
	               |ИТОГИ ПО
	               |	ШтрихКодFBS,
	               |	НомерЗаказаFBS";
	
	Запрос.УстановитьПараметр("РНК", РНК);
	Запрос.УстановитьПараметр("МассивНомеровЗаказа", МассивНомеровЗаказаFBS); 
	Запрос.УстановитьПараметр("Номенклатура", ТЗ.ВыгрузитьКолонку("Номенклатура"));	
	
	ВыборкаШтрихКодFBS = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ШтрихКодFBS");

	Пока ВыборкаШтрихКодFBS.Следующий() Цикл
		
		ВыборкаНомерЗаказаFBS = ВыборкаШтрихКодFBS.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НомерЗаказаFBS");
		
		Пока ВыборкаНомерЗаказаFBS.Следующий() Цикл
			
			Выборка = ВыборкаНомерЗаказаFBS.Выбрать();
			
			ОбщееКоличество = ТЗ.Итог("Количество");
			
			КоличествоВЗаказе = 0;
			
			ЗаказНашёлся = Истина; 
			
			Пока Выборка.Следующий() Цикл
				
				КоличествоВЗаказе = КоличествоВЗаказе + Выборка.Количество;
				
				СтрТЗ = ТЗ.Найти(Выборка.Номенклатура);
				
				Если СтрТЗ = Неопределено Тогда
					
					ЗаказНашёлся = Ложь;
					
					Прервать;
					
				КонецЕсли;
				
				Если СтрТЗ.Количество <> Выборка.Количество Тогда
					
					ЗаказНашёлся = Ложь;
					
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если ОбщееКоличество = КоличествоВЗаказе И ЗаказНашёлся Тогда

				ЗаполнитьЗначенияСвойств(СтруктураВозврата, ВыборкаНомерЗаказаFBS);
				
				Возврат СтруктураВозврата;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;	
	
	Возврат Неопределено;
	
КонецФункции 

&НаСервере
Функция ПолучитьКодЧЗСпайкиИзЗСБ(Продукция, ТекстОшибки = "")
	
	Если Не ЗначениеЗаполнено(ЗСБ) Тогда
		
		СтруктураОтвета = Документы.ЗаданиеНаСборкуКомплектовЧЗ.НайтиСоздатьДокНаРезервированиеКомплектовПодОтгрузку(РНК, Ложь);
		
		Если Не СтруктураОтвета.Успех Тогда
			
			ТекстОшибки = СтруктураОтвета.Ошибки;
			
			Возврат Неопределено;	
			
		Иначе
			
			ЗСБ = СтруктураОтвета.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	               |ИЗ
	               |	Документ.ЗаданиеНаСборкуКомплектовЧЗ.ШтрихкодыУпаковок КАК ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок
	               |ГДЕ
	               |	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.Ссылка = &ЗСБ";
	
	Запрос.УстановитьПараметр("ЗСБ", ЗСБ);
	
	МассивДоступныхКодовЗСБ = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШтрихкодУпаковки");
	
	Если МассивДоступныхКодовЗСБ.Количество() = 0 Тогда
		
		ТекстОшибки = "Не обнаружены зарезервированные коды ЧЗ спаек в ЗСБ!";
		
		Возврат Неопределено;	
		
	КонецЕсли;
	
	МассивПродукцииДляПолученияКодов = Новый Массив;
	МассивПродукцииДляПолученияКодов.Добавить(Продукция);
	
	// Кельманов А.В. - Оптимизация работы - 2026.05.20 {
	//ЛСК = Документы.ЛистСборкиКомплектовЧЗ.ПолучитьЛСКДляFBS(ЗСБ);
	Если ЗначениеЗаполнено(ТекущийЛП.ЛСК) Тогда
		
		ЛСК = ТекущийЛП.ЛСК;
		
	Иначе
		
		ЛСК = Документы.ЛистСборкиКомплектовЧЗ.ПолучитьЛСКДляFBS(ЗСБ, , , , Истина);
		
	КонецЕсли;
	// Кельманов А.В. - Оптимизация работы - 2026.05.20 }
	
	ЛСКОбъект = ЛСК.ПолучитьОбъект();
	ЛСКОбъект.Дата = ТекущаяДата();
	ЛСКОбъект.Записать(РежимЗаписиДокумента.Проведение);

	ДопПараметры = Новый Структура("Статус, МассивДоступныхКодов, ТипКода, Добавлять", Перечисления.СтатусыКодовМаркировкиФакт.Зарезервирован, МассивДоступныхКодовЗСБ, Перечисления.ТипыКодовМаркировки.Набор, Истина);
	
	РезультатПолученияКодов = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыШтук(МассивПродукцииДляПолученияКодов, ЛСК, ДопПараметры);		
	
	Если Не РезультатПолученияКодов.Успешно Тогда
		
		ТекстОшибки = СтрСоединить(РезультатПолученияКодов.Ошибки, Символы.ПС);
		
		Возврат Неопределено;	
		
	КонецЕсли;

	Для Каждого СтрокаДанных Из РезультатПолученияКодов.Данные.Получить(Продукция) цикл
		
		Возврат СтрокаДанных;
		
	КонецЦикла;
		
КонецФункции

&НаСервере
Процедура ЗаписатьОтсканированныеДанные(ТекстОшибки = "")
	
	Если Не ЗначениеЗаполнено(ТекущийЛП) Тогда
		
		ЛПОбъект = Документы.ЛистПереукладки.СоздатьДокумент();
		
		ЛПОбъект.Заполнить(РНК);
		ЛПОбъект.Дата = ТекущаяДата();
		ЛПОбъект.ДатаНачалаСканирования = ДатаНачалаСканирования;
		ЛПОбъект.Сканировщик = Сканировщик;
		ЛПОбъект.СканировщикФизЛицо = Сканировщик.ФизЛицо;
		ЛПОбъект.ТипКороба = ТипКороба;
		
		// Кельманов А.В. - SNL-234 - 2026.05.15 {
		РезультатПоиска = Документы.ЛистПереукладки.НайтиЕдиныйЗНАПоРНК(РНК);
		
		Если РезультатПоиска.Успех Тогда
			
			ЛПОбъект.ЗаданиеНаАгрегацию = РезультатПоиска.Данные;
			
		КонецЕсли; 
		// Кельманов А.В. - SNL-234 - 2026.05.15 }
	
		ЛПОбъект.Бригада.Загрузить(ТекущаяБригада()); // Кельманов А.В. - SNL-246 - 2026.05.26
		
	Иначе
		
		ЛПОбъект = ТекущийЛП.ПолучитьОбъект();
		
	КонецЕсли;
	
	Если ОтгрузкаКомплектов Тогда
		
		Если ШтрихкодыУпаковок.Количество() > 0 И ЗначениеЗаполнено(ОтсканированныйОжидаемыйКодЧЗ) Тогда
			
			ЗаписатьСпайкуВЛСК(ТекстОшибки);
			
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
				
				Возврат;
				
			КонецЕсли;
			
			// Кельманов А.В. - Оптимизация работы - 2026.04.16 {
			Если Не ЗначениеЗаполнено(ЛПОбъект.ЛСК) И ЗначениеЗаполнено(ТекущийЛСК) Тогда
				
				ЛПОбъект.ЛСК = ТекущийЛСК;
				
			КонецЕсли;
			// Кельманов А.В. - Оптимизация работы - 2026.04.16 }
			
		КонецЕсли;
		
	КонецЕсли;
	
	МассСтрокТовары = ЛПОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура", ТекШтукаСпайка));
	
	Если МассСтрокТовары.Количество() = 0 Тогда
		
		НовСтр = ЛПОбъект.Товары.Добавить();
		
		НовСтр.Номенклатура = ТекШтукаСпайка;
		НовСтр.Количество = 1;
		НовСтр.Отсканировано = 1;
		
	Иначе
		
		СтрТовары = МассСтрокТовары[0];
		
		СтрТовары.Количество = СтрТовары.Количество + 1;
		СтрТовары.Отсканировано = СтрТовары.Количество;
		
	КонецЕсли;
	
	НовСтрЧЗ = ЛПОбъект.ШтрихкодыУпаковок.Добавить();
	
	Если ОтгрузкаКомплектов Тогда
		
		НовСтрЧЗ.ШтрихкодУпаковки = ОтсканированныйОжидаемыйКодЧЗ;
		
	Иначе
		
		НовСтрЧЗ.ШтрихкодУпаковки = ШтрихкодыУпаковок[0].ШтрихкодУпаковки;
		
	КонецЕсли;
	
	НовСтрЧЗ.Количество = 1;
	НовСтрЧЗ.НомерЗаказа = НомерЗаказаFBS;
	
	ЛПОбъект.ДатаОкончанияСканирования = ТекущаяДата();
			
	ЛПОбъект.ДополнительныеСвойства.Вставить("ЗаписьИзОбработкиFBS", Истина);

	ЛПОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	ДатаНачалаСканирования = ТекущаяДата();
	
	Если Не ЗначениеЗаполнено(ТекущийЛП) Тогда
		
		ТекущийЛП = ЛПОбъект.Ссылка;
		
	КонецЕсли;
	
	Если РНК.СостояниеНакладной <> Перечисления.СостоянияНакладной.Переукладка Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗаданиеНабора.Ссылка КАК ЗНБ
		|ИЗ
		|	Документ.ЗаданиеНабора КАК ЗаданиеНабора
		|ГДЕ
		|	ЗаданиеНабора.Проведен
		|	И ЗаданиеНабора.Накладная = &РНК";
		
		Запрос.УстановитьПараметр("РНК", РНК);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ЗНБОбъект = Выборка.ЗНБ.ПолучитьОбъект();
			
			ЗНБОбъект.СостояниеНакладной = Перечисления.СостоянияНакладной.Переукладка;
			
			ЗНБОбъект.Записать();
			
		КонецЦикла;
		
		РНКОбъект = РНК.ПолучитьОбъект();
		
		РНКОбъект.СостояниеНакладной = Перечисления.СостоянияНакладной.Переукладка;
		
		РНКОбъект.Записать();
			
	КонецЕсли;
	
	ЗаполнитьЛистыПереукладки();
	ЗаполнитьТовары_ПланФакт(); // Кельманов А.В. - ИЗМ-0000000063 - 2026.06.19
		
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСпайкуВЛСК(ТекстОшибки = "")
	
	МассивОшибок = Новый Массив;
	
	// Кельманов А.В. - Оптимизация работы - 2026.04.14 {
	//ЛСК = Документы.ЛистСборкиКомплектовЧЗ.ПолучитьЛСКДляFBS(ЗСБ);
	Если ЗначениеЗаполнено(ТекущийЛП.ЛСК) Тогда
		
		ЛСК = ТекущийЛП.ЛСК;
		
	Иначе
		
		// Кельманов А.В. - Оптимизация работы - 2026.05.20 {
		//ЛСК = Документы.ЛистСборкиКомплектовЧЗ.ПолучитьЛСКДляFBS(ЗСБ, , , Истина);
		ЛСК = Документы.ЛистСборкиКомплектовЧЗ.ПолучитьЛСКДляFBS(ЗСБ, , , , Истина);
		// Кельманов А.В. - Оптимизация работы - 2026.05.20 }
		
	КонецЕсли;
	
	ТекущийЛСК = ЛСК;
	// Кельманов А.В. - Оптимизация работы - 2026.04.14 }
	
	ЛСКОбъект = ЛСК.ПолучитьОбъект();
	ЛСКОбъект.Дата = ТекущаяДата(); 

	Если Не ЗначениеЗаполнено(ЛСКОбъект.ДатаНачалаСканирования) Тогда
		ЛСКОбъект.ДатаНачалаСканирования = ДатаНачалаСканирования;  
	КонецЕсли;
	
	// Кельманов А.В. - ИЗМ-0000000124 - 2026.07.01 {
	Если Не ЗначениеЗаполнено(ЛСКОбъект.ЛистНабора) Тогда
		
		ЛСКОбъект.ЛистНабора = ТекущийЛП;
		
	КонецЕсли;
	// Кельманов А.В. - ИЗМ-0000000124 - 2026.07.01 }
			
	// Кельманов А.В. - SNL-246 - 2026.05.26 { 
	Если ЛСКОбъект.Бригада.Количество() = 0 Тогда
		ЛСКОбъект.Бригада.Загрузить(ТекущаяБригада());
	КонецЕсли;
	// Кельманов А.В. - SNL-246 - 2026.05.26 }
	
	Если ЛСКОбъект.ШтрихкодыУпаковок.Найти(ОтсканированныйОжидаемыйКодЧЗ, "ШтрихкодКомплекта") <> Неопределено Тогда
		
		МассивОшибок.Добавить("Обнаружен дубль набора в ЛСК " + ЛСКОбъект.Номер + " по коду " + ОтсканированныйОжидаемыйКодЧЗ);

	КонецЕсли;
	
	Для Каждого СтрШтрихкодыУпаковок Из ШтрихкодыУпаковок Цикл
		
		КодЧЗ = СтрШтрихкодыУпаковок.ШтрихкодУпаковки;
		
		Если ЛСКОбъект.ШтрихкодыУпаковок.Найти(КодЧЗ, "ШтрихкодУпаковки") <> Неопределено Тогда
			
			МассивОшибок.Добавить("Обнаружен дубль комплектующей в ЛСК " + ЛСКОбъект.Номер + " по коду " + КодЧЗ);
			
			Продолжить;
			
		КонецЕсли;		
		
		СтрТЧ = ЛСКОбъект.ШтрихкодыУпаковок.Добавить();
		СтрТЧ.ДатаФормированияКомплекта = ТекущаяДата();
		СтрТЧ.Комплектующее = КодЧЗ.Владелец;
		СтрТЧ.ШтрихкодКомплекта = ОтсканированныйОжидаемыйКодЧЗ;
		СтрТЧ.ШтрихкодУпаковки = КодЧЗ;
		СтрТЧ.КодКомплектаПодтвержденСканированием = Истина;
		
	КонецЦикла;
	
	ЛСКОбъект.ДатаОкончанияСканирования = ТекущаяДата();
	
	Если МассивОшибок.Количество() = 0 Тогда
		
		Попытка
			
			ЛСКОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		Исключение
			
			МассивОшибок.Добавить("Не удалось записать документ ЛСК по причине " + ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЕсли; 
	
	Если МассивОшибок.Количество() > 0 Тогда
		
		ТекстОшибки = "Не удалось записать коды ЧЗ в ЛСК" + Символы.ПС + СтрСоединить(МассивОшибок, Символы.ПС);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура РаспечататьЭтикетки(ТекстОшибки = "")
	
	// Кельманов А.В. - SNL-233 - 2026.05.15 {
	//Если ЗначениеЗаполнено(ТекШтукаСпайка) Тогда
	Если ОтгрузкаКомплектов И ЗначениеЗаполнено(ТекШтукаСпайка) Тогда
	// Кельманов А.В. - SNL-233 - 2026.05.15 }
		
		ТабДокЭтикеткаСШКМатрицы = ТабДокЭтикеткаСШКМатрицы(ТекстОшибки);
		
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			
			Сообщить(ТекстОшибки);
			
		Иначе
			
			Если ПараметрыСеанса.ВыводитьПечатныеФормыНаПредпросмотр Тогда
				
				ТабДокЭтикеткаСШКМатрицы.Показать();
				
			Иначе
				
				Попытка 
					ТабДокЭтикеткаСШКМатрицы.Напечатать()
				Исключение
					ТабДокЭтикеткаСШКМатрицы.Показать();
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ОжидаемыйДляСканированияКодЧЗ) Тогда
		
		ТабДокЭтикеткаЧЗ = ТабДокЭтикеткаЧЗ();
		
		Если ПараметрыСеанса.ВыводитьПечатныеФормыНаПредпросмотр Тогда
			
			ТабДокЭтикеткаЧЗ.Показать();
			
		Иначе
			
			Попытка 
				ТабДокЭтикеткаЧЗ.Напечатать()
			Исключение
				ТабДокЭтикеткаЧЗ.Показать();
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ШтрихКодFBS) Или ЗначениеЗаполнено(НомерЗаказаFBS) Тогда
		
		Если ДопПараметрыНакладной.Имя = "WB_FBS" Тогда
			
			ТабДокЭтикеткаWB = ТабДокЭтикеткаWB();
			
			Если ПараметрыСеанса.ВыводитьПечатныеФормыНаПредпросмотр Тогда
				
				ТабДокЭтикеткаWB.Показать();
				
			Иначе
				
				Попытка 
					ТабДокЭтикеткаWB.Напечатать()
				Исключение
					ТабДокЭтикеткаWB.Показать();
				КонецПопытки;
				
			КонецЕсли;
			
		ИначеЕсли ДопПараметрыНакладной.Имя = "OZON_FBS" Тогда
			
			РаспечататьЭтикеткуОзонДляСхемыВБ();
			
		ИначеЕсли ДопПараметрыНакладной.Имя = "YANDEX_FBS" Или ДопПараметрыНакладной.Имя = "MAGNIT_FBS" Тогда
			
			РаспечататьЭтикеткуЯндексМагнитДляСхемыВБ();

		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТабДокЭтикеткаЧЗ()
	
	ОбработкаПечатиЧЗ = Обработки.ПечатьЭтикетокЧЗ.Создать();
		
	ИмяМакета = "Этикетка_25_25";
	Макет = ОбработкаПечатиЧЗ.ПолучитьМакет(ИмяМакета);
	
	ТабДок = Новый ТабличныйДокумент;
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;	
	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_КМ_" + ИмяМакета;	
	
	ДопПараметры = Новый Структура("НомерШтуки, НомерКоробки, ШтукВКоробке", 1, 1, 1);
	
	ДанныеДляПечати	= МаркировкаКС.ПолучитьПоляКМДляПечати(ОжидаемыйДляСканированияКодЧЗ);
		
	Область = ОбработкаПечатиЧЗ.СформироватьЭтикету(Макет, ДанныеДляПечати, ДопПараметры);
	
	ТабДок.Вывести(Область);
	
	Возврат ТабДок; 
	
КонецФункции

&НаСервере
Функция ТабДокЭтикеткаWB()
	
	ТабДок = Новый ТабличныйДокумент;
	
	ТабДок.ИмяПараметровПечати = "АналогЗПЛВайлдберрис";
	
	ПолноеИмяФайла = СокрЛП(Константы.КаталогВнешнихОтчетов.Получить() + "PrnForms\РаботаСЗаказомКлиента.epf");
	ОбработкаПечати = ВнешниеОбработки.Создать(ПолноеИмяФайла);
	
	Макет = ОбработкаПечати.ПолучитьМакет("КРВайлдберис"); 

	ОблСтрока = Макет.ПолучитьОбласть("Строка");
	
	ОблСтрока.Параметры.ПрефиксЗаказа = ПрефиксЗаказа;
	ОблСтрока.Параметры.СуффиксЗаказа = СуффиксЗаказа;
	
	Размер = 144;
	
	ДвДанные = ФормированиеПечатныхФорм.ДанныеQRКода(ШтрихКодFBS, 0, Размер);
	
	Если ДвДанные <> Неопределено Тогда
		Карт = Новый Картинка(ДвДанные);				
		ОблСтрока.Область(1, 2).Картинка = Карт;
	КонецЕсли;
	
	ТабДок.РазмерСтраницы = "Custom";
	ТабДок.ВысотаСтраницы = 41;
	ТабДок.ШиринаСтраницы = 58;
	ТабДок.ПолеСправа = 0;
	ТабДок.ПолеСлева = 0;
	ТабДок.ПолеСверху = 0;
	ТабДок.ПолеСнизу = 0;
	ТабДок.Автомасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	ТабДок.Вывести(ОблСтрока);
	
	Возврат ТабДок; 
	
КонецФункции

&НаСервере
Функция ТабДокЭтикеткаСШКМатрицы(ТекстОшибки = "")
	
	Если ТаблицаДанныхМатрицы = Неопределено Тогда
		ЗаполнитьТаблицуДанныхМатрицы();
	КонецЕсли;
	
	СтрокаМатрицы = ТаблицаДанныхМатрицы.Найти(ТекШтукаСпайка, "Номенклатура");
	
	Если СтрокаМатрицы = Неопределено Тогда
		ТекстОшибки = "" + ТекШтукаСпайка + " нет в матрице. Этикетка не распечатана.";
		Возврат Неопределено;
	КонецЕсли;

	НаборПолей = Новый Структура("КодПроизводителя, Модель, ЦветБольшой, РазмерБольшой, РусскоеНаименованиеЦвета, РусскийПроизводитель, ДатаИзготовления, НаименованиеНоменклатуры, РазмерКомплекта");
	
	НаборПолей.ДатаИзготовления = НРег(Формат(ТекущаяДата() - 90 * 24 * 60 * 60, "ДФ=MMMM") + " " + Формат(НачалоМесяца(ТекущаяДата() - 90 * 24 * 60 * 60), "ДФ=yyyy") + " г.");
	
	ЗаполнитьЗначенияСвойств(НаборПолей, СтрокаМатрицы);
	
	НаборПолей.РазмерБольшой = ВРег(СтрокаМатрицы.Размер);
	НаборПолей.ЦветБольшой = ВРег(СтрокаМатрицы.Цвет);
	НаборПолей.РусскоеНаименованиеЦвета = ВРег(СтрокаМатрицы.РусскоеНаименованиеЦвета);
	
	// Кельманов А.В. - SNL-233 - 2026.05.15 {
	//Если ОтгрузкаКомплектов Тогда
	//	
	//	Макет = Обработки.АРМ_ФормированиеЗаказовFBS.ПолучитьМакет("ЭтикеткаКомплект");

	//	НаборПолей.РазмерКомплекта = ПолучитьРеквизитШапки(ТекШтукаСпайка, "Родитель.ШтукВКомплекте", "Справочник"); 

	//Иначе
	//	
	//	Макет = Обработки.АРМ_ФормированиеЗаказовFBS.ПолучитьМакет("Этикетка1_2х0_85_ЕАС");
	//	
	//КонецЕсли;
	Макет = Обработки.АРМ_ФормированиеЗаказовFBS.ПолучитьМакет("ЭтикеткаКомплект");

	НаборПолей.РазмерКомплекта = ПолучитьРеквизитШапки(ТекШтукаСпайка, "Родитель.ШтукВКомплекте", "Справочник"); 
	// Кельманов А.В. - SNL-233 - 2026.05.15 }
	
	ТабДок = Новый ТабличныйДокумент;
	
	ТабДок.ИмяПараметровПечати = "УвеличенныйШКFBS";
	
	ОблЭтикетка = Макет.ПолучитьОбласть("Строка");
	ОблЭтикетка.Параметры.Заполнить(НаборПолей);
	
	Компонента = ПодключитьКомпонентуИзМакета("Barcode", "ОбщийМакет.КомпонентаПечатиШтрихкодов");
	
	ПараметрыШК = Маркировка_ПИ.ПараметрыГенерацииШКпоУмолчанию();
	Рисунок = ОблЭтикетка.Рисунки.ШтрихКод;
	
	Эталон = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьМакет("Эталон");
	ММвВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;	
	
	ПараметрыШК.ТипКода	= 1;
	
	ПараметрыШК.Высота = Окр(Рисунок.Высота / ММвВПикселе);
	ПараметрыШК.Ширина = Окр(Рисунок.Ширина / ММвВПикселе);
	
	ПараметрыШК.Масштабировать = Ложь;	
	ПараметрыШК.СохранятьПропорции = Истина;	
	ПараметрыШК.ОтображатьТекст = Истина;
	ПараметрыШК.РазмерШрифта = 12;
	ПараметрыШК.ВертикальноеВыравнивание = 1;	
	
	ПараметрыШК.УголПоворота = 0;	
	ПараметрыШК.Штрихкод = СтрокаМатрицы.ШККонтрагента;	
	ПараметрыШК.УбратьЛишнийФон = Истина;
	
	рШтрихКод = ПодготовитьИзображениеШтрихкодаEAN13(Компонента, ПараметрыШК);	
	
	Рисунок.Картинка = рШтрихКод.Картинка;

	ТабДок.Вывести(ОблЭтикетка);
	
	Возврат ТабДок;

КонецФункции

&НаКлиенте
Процедура РаспечататьЭтикеткуОзонДляСхемыВБ()

	ЭтикеткаСформировалась = Ложь;
	
	ПутьЭтик = "\\srvfile-sk\FBS";
	
	ИмяФайлаЭтикеткиОзон = ПутьЭтик + "\" + НомерЗаказаFBS + ".pdf";
	
	ФайлЭтикетки = Новый Файл(ИмяФайлаЭтикеткиОзон);
	
	Если ФайлЭтикетки.Существует() Тогда    		
		
		Попытка				
			ЗапуститьПриложение(ИмяФайлаЭтикеткиОзон);
			ЭтикеткаСформировалась = Истина;
		Исключение
		КонецПопытки;
		
	КонецЕсли;	  
	
	Если Не ЭтикеткаСформировалась Тогда
		
		ТабДокВременнаяЭтикеткаFBS = ТабДокВременнаяЭтикеткаFBS();
		
		Если ПараметрыСеанса.ВыводитьПечатныеФормыНаПредпросмотр Тогда
			
			ТабДокВременнаяЭтикеткаFBS.Показать();
			
		Иначе
			
			Попытка 
				ТабДокВременнаяЭтикеткаFBS.Напечатать()
			Исключение
				ТабДокВременнаяЭтикеткаFBS.Показать();
			КонецПопытки;
			
		КонецЕсли;
					
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура РаспечататьЭтикеткуЯндексМагнитДляСхемыВБ()
	
	ЭтикеткаСформировалась = Ложь;
	
	ИмяФайлаЭтикеткиЯндексМагнит = ИмяФайлаЭтикеткиЯндексМагнит();
	
	ФайлЭтикетки = Новый Файл(ИмяФайлаЭтикеткиЯндексМагнит);
	
	Если ФайлЭтикетки.Существует() Тогда
		
		Попытка
			ЗапуститьПриложение(ИмяФайлаЭтикеткиЯндексМагнит);
			ЭтикеткаСформировалась = Истина;
		Исключение
			Сообщить(СтрШаблон("Этикетка по заказу %1 не готова!", НомерЗаказаFBS))
		КонецПопытки
		
	КонецЕсли;
	
	Если Не ЭтикеткаСформировалась Тогда
		
		ТабДокВременнаяЭтикеткаFBS = ТабДокВременнаяЭтикеткаFBS();
		
		Если ПараметрыСеанса.ВыводитьПечатныеФормыНаПредпросмотр Тогда
			
			ТабДокВременнаяЭтикеткаFBS.Показать();
			
		Иначе
			
			Попытка 
				ТабДокВременнаяЭтикеткаFBS.Напечатать()
			Исключение
				ТабДокВременнаяЭтикеткаFBS.Показать();
			КонецПопытки;
			
		КонецЕсли;
					
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Функция ИмяФайлаЭтикеткиЯндексМагнит()
	
	МаркетПлейс = Справочники.ИнетМагазины.НайтиПоКоду("00004");
	РеквизитыМаркетПлейс = ЗначенияРеквизитовОбъекта(МаркетПлейс, "КаталогДляЭтикеток");
	
	ПутьЭтикетки = РеквизитыМаркетПлейс.КаталогДляЭтикеток;
	
	Если ПустаяСтрока(ПутьЭтикетки) Тогда
		ПутьЭтикетки = "\\srvfiles\1C_Logs_MarketPlace\";
	КонецЕсли;
	
	ПолноеИмяФайлаЭтикетки = СтрШаблон("%1%2.pdf", ПутьЭтикетки, НомерЗаказаFBS);
	
	Возврат ПолноеИмяФайлаЭтикетки;
	
КонецФункции

&НаСервере
Функция ТабДокВременнаяЭтикеткаFBS()
	
	ТабДок = Новый ТабличныйДокумент;
	
	ТабДок.ИмяПараметровПечати = "ВременнаяЭтикеткаFBS";
	
	Макет = Обработки.АРМ_ФормированиеЗаказовFBS.ПолучитьМакет("ВременнаяЭтикеткаFBS");
	
	ОбластьЭтикетки = Макет.ПолучитьОбласть("Этикетка");

	ОбластьЭтикетки.Параметры.НомерЗаказа = НомерЗаказаFBS;

	//Для Каждого Рисунок Из ОбластьЭтикетки.Рисунки Цикл	
	//	
	//	ОбъектШК = Рисунок.Объект;
	//	
	//	Попытка
	//		ОбъектШК.Сообщение = НомерЗаказаFBS; 
	//	Исключение
	//	КонецПопытки;
	//	
	//КонецЦикла;
	
	Компонента = ПодключитьКомпонентуИзМакета("Barcode", "ОбщийМакет.КомпонентаПечатиШтрихкодов");
	
	ПараметрыШК = Маркировка_ПИ.ПараметрыГенерацииШКпоУмолчанию();
	Рисунок = ОбластьЭтикетки.Рисунки.ШтрихКод;
	
	Эталон = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьМакет("Эталон");
	ММвВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;	
	
	ПараметрыШК.ТипКода	= 99;
	
	ПараметрыШК.Высота = Окр(Рисунок.Высота / ММвВПикселе);
	ПараметрыШК.Ширина = Окр(Рисунок.Ширина / ММвВПикселе);
	
	ПараметрыШК.Масштабировать = Ложь;	
	ПараметрыШК.СохранятьПропорции = Истина;	
	ПараметрыШК.ОтображатьТекст = Истина;
	ПараметрыШК.РазмерШрифта = 12;
	ПараметрыШК.ВертикальноеВыравнивание = 1;	
	
	ПараметрыШК.УголПоворота = 0;	
	ПараметрыШК.Штрихкод = НомерЗаказаFBS;	
	ПараметрыШК.УбратьЛишнийФон = Истина;
	
	рШтрихКод = ПодготовитьИзображениеШтрихкодаEAN13(Компонента, ПараметрыШК);	
	
	Рисунок.Картинка = рШтрихКод.Картинка;
		
	ТабДок.Вывести(ОбластьЭтикетки);
	
	Возврат ТабДок; 
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуДанныхМатрицы()
	
	Запрос = Новый Запрос;				
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	МатрицаТовары.Номенклатура КАК Номенклатура,
	               |	МатрицаТовары.КратностьКоробки КАК КратностьКоробки,
	               |	МатрицаТовары.ШККонтрагента КАК ШККонтрагента,
	               |	МатрицаТовары.ШККонтрагентаДополнительный КАК ШККонтрагентаДополнительный,
	               |	МатрицаТовары.Номенклатура.Родитель КАК Модель,
	               |	МатрицаТовары.Номенклатура.КодПроизводителя КАК КодПроизводителя,
	               |	МатрицаТовары.Номенклатура.Цвет.Наименование КАК Цвет,
	               |	""Размер:"" + МатрицаТовары.Номенклатура.Размер.Наименование КАК Размер,
	               |	ВЫРАЗИТЬ(МатрицаТовары.Номенклатура.Цвет.РусскоеНаименование КАК СТРОКА(30)) КАК РусскоеНаименованиеЦвета,
	               |	МатрицаТовары.Номенклатура.Наименование КАК НаименованиеНоменклатуры,
	               |	0 КАК РазмерКомплекта,
	               |	МатрицаТовары.Кратность КАК КратностьБлочка,
	               |	МатрицаТовары.Ссылка.Акция КАК Акция,
	               |	МатрицаТовары.Ссылка.Дата КАК Дата
	               |ИЗ
	               |	Документ.Матрица.Товары КАК МатрицаТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	               |		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
	               |ГДЕ
	               |	МатрицаТовары.Ссылка.Проведен
	               |	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
	               |	И МатрицаТовары.Ссылка.Договор = &Договор
	               |	И МатрицаТовары.Ссылка.Дата <= &Дата1
	               |	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
	               |	И МатрицаПунктыДоставки.ПунктДоставки = &ПунктДоставки
	               |	И МатрицаТовары.Номенклатура В(&Номенклатура)
	               |	И МатрицаТовары.Ссылка.ПостояннаяАкция = &ПостояннаяАкция
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	МатрицаТовары.Ссылка.Акция УБЫВ,
	               |	МатрицаТовары.Ссылка.Дата УБЫВ";
	
	Если ЗначениеЗаполнено(ТекущийЛП) Тогда
		
		Дата = ТекущийЛП.Дата;
		
	Иначе
		
		Дата = ТекущаяДата();
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата2", НачалоДня(Дата));
	Запрос.УстановитьПараметр("Дата1", КонецДня(Дата));
	Запрос.УстановитьПараметр("Контрагент", РНК.Контрагент);		
	Запрос.УстановитьПараметр("ПунктДоставки", РНК.ПунктДоставки);				
	Запрос.УстановитьПараметр("Договор", РНК.Договор);		
	запрос.УстановитьПараметр("Номенклатура", РНК.Товары.ВыгрузитьКолонку("Номенклатура"));
	запрос.УстановитьПараметр("ПостояннаяАкция", РНК.ПостояннаяАкция);
	
	ТаблицаДанныхМатрицы = Запрос.Выполнить().Выгрузить();

КонецПроцедуры

&НаКлиенте
Процедура ПовторитьПечать(Команда)
	
	РаспечататьЭтикетки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЭтикеткаОнлайн(Команда)
	
	Если Не ЗначениеЗаполнено(ТекущийЛП) И ЗначениеЗаполнено(ПоследнийЛП) Тогда
		
		Результат = РезультатПечатиЭтикеткиОнлайн(); 
		
		Если Результат.Успех Тогда   	 
			
			Если Результат.ТабДокумент <> Неопределено Тогда
				
				Если ПараметрыСеанса.ВыводитьПечатныеФормыНаПредпросмотр Тогда
					Результат.ТабДокумент.Показать("Наклейки " + РНК.Номер);
				Иначе
					Попытка 
						Результат.ТабДокумент.Напечатать(); 
					Исключение
						Результат.ТабДокумент.Показать("Наклейки " + РНК.Номер);
					КонецПопытки;
				КонецЕсли;
				
			КонецЕсли;
			
			Если Результат.ТабДокументДоп <> Неопределено Тогда
				
				Если ПараметрыСеанса.ВыводитьПечатныеФормыНаПредпросмотр Тогда
					Результат.ТабДокументДоп.Показать("ДополнительнаяЭтикеткаНаКоробИзЛП" + СтрЗаменить(РНК.Контрагент.Код, "-", ""));
				Иначе
					Попытка 
						Результат.ТабДокументДоп.Напечатать(); 
					Исключение
						Результат.ТабДокументДоп.Показать("ДополнительнаяЭтикеткаНаКоробИзЛП" + СтрЗаменить(РНК.Контрагент.Код, "-", ""));
					КонецПопытки;
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе 
			
			МаркировкаКС.ВывестиОшибки(Результат);
			
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	Если Товары.Количество() > 0 Или ШтрихкодыУпаковок.Количество() > 0 Тогда
		
		Сообщить("Есть несохранённые данные. Сначала завершите работу."); 
		
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущийЛП) Тогда
		
		Сообщить("Нет активного листа переукладки."); 
		
		Возврат;
		
	КонецЕсли;
	
	ЗавершитьТекущийЛП();
	
	Сообщить(Строка(ТекущийЛП) + " завершен и доступен только для просмотра");		
	
	ЗаполнитьЛистыПереукладки();
	ЗаполнитьТовары_ПланФакт(); // Кельманов А.В. - ИЗМ-0000000063 - 2026.06.19
	
	ПоследнийЛП = ТекущийЛП;
	
	ТекущийЛП = Неопределено;
	ТекущийЛСК = Неопределено;
	ТипКороба = Неопределено;
	
	Товары_ТекущийЛП.Очистить();
	ШтрихкодыУпаковок_ТекущийЛП.Очистить();
	
	Результат = РезультатПечатиЭтикеткиОнлайн(); 
	
	Если Результат.Успех Тогда   	 
		
		Если Результат.ТабДокумент <> Неопределено Тогда

			Если ПараметрыСеанса.ВыводитьПечатныеФормыНаПредпросмотр Тогда
				Результат.ТабДокумент.Показать("Наклейки " + РНК.Номер);
			Иначе
				Попытка 
					Результат.ТабДокумент.Напечатать(); 
				Исключение
					Результат.ТабДокумент.Показать("Наклейки " + РНК.Номер);
				КонецПопытки;
			КонецЕсли;

		КонецЕсли;
		
		Если Результат.ТабДокументДоп <> Неопределено Тогда

			Если ПараметрыСеанса.ВыводитьПечатныеФормыНаПредпросмотр Тогда
				Результат.ТабДокументДоп.Показать("ДополнительнаяЭтикеткаНаКоробИзЛП" + СтрЗаменить(РНК.Контрагент.Код, "-", ""));
			Иначе
				Попытка 
					Результат.ТабДокументДоп.Напечатать(); 
				Исключение
					Результат.ТабДокументДоп.Показать("ДополнительнаяЭтикеткаНаКоробИзЛП" + СтрЗаменить(РНК.Контрагент.Код, "-", ""));
				КонецПопытки;
			КонецЕсли;

		КонецЕсли;
		
		// Кельманов А.В. - SNL-233 - 2026.05.19 {
		//УстановитьВидимость();
		Если Не ЗначениеЗаполнено(ОжидаемыйДляСканированияКодЛП) Тогда
			
			УстановитьВидимость();
			
		КонецЕсли;
		// Кельманов А.В. - SNL-233 - 2026.05.19 }
	
	Иначе 
		
		МаркировкаКС.ВывестиОшибки(Результат);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция РезультатПечатиЭтикеткиОнлайн()
	
	ЛНДляПечати = ТекущийЛП;
	
	Если Не ЗначениеЗаполнено(ТекущийЛП) И ЗначениеЗаполнено(ПоследнийЛП) Тогда
		
		ЛНДляПечати = ПоследнийЛП;
		
	КонецЕсли;
		
	ПравилаРаботыСАгрегациейЧЗ = МаркировкаКС.ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладной(РНК); 
	
	ДопПараметры = Обработки.ПечатьЛистаНабора.СтруктураПечатиЭтикеткиОнлайн(); 
	ДопПараметры.КодАгрегации = ЛНДляПечати.КодАгрегации; 
	ДопПараметры.ЭтоУзел_Склад = Истина; 
	ДопПараметры.ДопПараметрыНакладной = ДопПараметрыНакладной; 
	ДопПараметры.КоличествоЕдиниц = 0; 
	ДопПараметры.ПравилаРаботыСАгрегациейЧЗ = ПравилаРаботыСАгрегациейЧЗ;

	Результат = Обработки.ПечатьЛистаНабора.ПечатьЭтикеткиОнлайн(ЛНДляПечати.ПолучитьОбъект(), Неопределено, ДопПараметры, Неопределено, Неопределено);
	
	// Кельманов А.В. - SNL-233 - 2026.05.15 {
	Если Результат.Успех И ПодтверждатьЭтикеткуОнлайнСканированием Тогда
		
		МассивКодовQR = Результат.МассивКодовQR;
		
		Если МассивКодовQR.Количество() > 0 Тогда
			
			ОжидаемыйДляСканированияКодЛП = МассивКодовQR[0];
			
			Если ЗначениеЗаполнено(ОжидаемыйДляСканированияКодЛП) Тогда
				
				Элементы.НадписьОтсканируйте.Заголовок = "Отсканируйте распечатанную этикетку онлайн";
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	// Кельманов А.В. - SNL-233 - 2026.05.15 }
			
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПроверитьВсёОтсканировано()
	
	ВсёОтсканировано = Ложь;

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(РасходнаяНакладнаяТовары.Количество) КАК Количество
	               |ПОМЕСТИТЬ ВТ_РНК
	               |ИЗ
	               |	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	               |ГДЕ
	               |	РасходнаяНакладнаяТовары.Ссылка = &РНК
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасходнаяНакладнаяТовары.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЛистПереукладкиТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(ЛистПереукладкиТовары.Отсканировано) КАК Количество
	               |ПОМЕСТИТЬ ВТ_ЛП
	               |ИЗ
	               |	Документ.ЛистПереукладки.Товары КАК ЛистПереукладкиТовары
	               |ГДЕ
	               |	ЛистПереукладкиТовары.Ссылка.ДокОснование = &РНК
	               |	И ЛистПереукладкиТовары.Ссылка.Проведен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛистПереукладкиТовары.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_РНК.Номенклатура КАК Номенклатура,
	               |	ВТ_РНК.Количество КАК КоличествоРНК,
	               |	ЕСТЬNULL(ВТ_ЛП.Количество, 0) КАК КоличествоЛП
	               |ИЗ
	               |	ВТ_РНК КАК ВТ_РНК
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЛП КАК ВТ_ЛП
	               |		ПО ВТ_РНК.Номенклатура = ВТ_ЛП.Номенклатура
	               |ГДЕ
	               |	ВТ_РНК.Количество > ЕСТЬNULL(ВТ_ЛП.Количество, 0)";
	
	Запрос.УстановитьПараметр("РНК", РНК);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		ВсёОтсканировано = Истина;
		
	КонецЕсли;
	
	Возврат ВсёОтсканировано;
	
КонецФункции

&НаСервере
Процедура ЗавершитьТекущийЛП()
	
	ЛПОбъект = ТекущийЛП.ПолучитьОбъект();
	
	ЛПОбъект.Завершен = Истина;
	
	//ЛПОбъект.ДополнительныеСвойства.Вставить("ЗаписьИзОбработкиFBS", Истина);

	ЛПОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьФактСканирования(Данные, ТекстОшибки = "", ДопИнфо = "")
	
	ДопПараметрыДляРеестраСканирования = Новый Структура;
	
	ДопПараметрыДляРеестраСканирования.Вставить("Накладная", РНК);
	ДопПараметрыДляРеестраСканирования.Вставить("Дата", ТекущаяДата());
	ДопПараметрыДляРеестраСканирования.Вставить("ФизЛицо", Сканировщик.ФизЛицо);
	ДопПараметрыДляРеестраСканирования.Вставить("РабочееМесто", ПараметрыСеанса.РабочееМестоКлиента);
	ДопПараметрыДляРеестраСканирования.Вставить("ТекстОшибки", ТекстОшибки);
	ДопПараметрыДляРеестраСканирования.Вставить("ДопИнфо", ДопИнфо);
	ДопПараметрыДляРеестраСканирования.Вставить("СостояниеСканера", Перечисления.СостоянияСканераДляПланаНабора.НеОпределено);

	Знак = 1;
	
	Если РежимСканирования = Перечисления.РежимСканирования.Вычитание Тогда		
		Знак = -1;		
	КонецЕсли;
	
	ДопПараметрыДляРеестраСканирования.Вставить("Знак", Знак);
	
	ШК = Лев(Данные, 31);
	
	Если СтрДлина(ШК) = 13 Тогда
		КодировкаШК = Перечисления.ТипыКодировокШК.EAN13;	
	ИначеЕсли СтрДлина(ШК) = 31 Тогда
		КодировкаШК = Перечисления.ТипыКодировокШК.DataMatrix;
	Иначе
		КодировкаШК = Перечисления.ТипыКодировокШК.ПустаяСсылка();
	КонецЕсли;
	
	ДопПараметрыДляРеестраСканирования.Вставить("КодировкаШК", КодировкаШК);
	
	ДопПараметрыДляРеестраСканирования.Вставить("ДанныеПоШК", РС_ДанныеПоШК);
	ДопПараметрыДляРеестраСканирования.Вставить("НазначениеШК", РС_НазначениеШК);
	ДопПараметрыДляРеестраСканирования.Вставить("ТипШК", РС_ТипШК);
	
	Попытка
		ЗаписатьФактСканирования_Временная(ШК, ТекущийЛП, ДопПараметрыДляРеестраСканирования);
	Исключение                                   
		ТекстСообщения = СтрШаблон("Ошибка записи пика ! ШК: '%1', док-т: '%2', ошибка: '%3' !", ШК, ТекущийЛП, ОписаниеОшибки());
		ЗаписатьВЛог("Фиксация пиков", ТекстСообщения, "Ошибка"); 
	КонецПопытки;

	РС_ДанныеПоШК = Неопределено;
	РС_НазначениеШК = Неопределено;
	РС_ТипШК = Неопределено;	
		
КонецПроцедуры

&НаСервере
Функция ПодготовитьИзображениеШтрихкодаEAN13(ВнешняяКомпонента, ПараметрыШтрихкода)	
	// Результат 
	РезультатОперации = Новый Структура("Успешно,ДвоичныеДанные,Картинка", Ложь);	
	
	// Зададим размер формируемой картинки.
	ШиринаШтрихкода = Макс(Окр(ПараметрыШтрихкода.Ширина),1);
	ВысотаШтрихкода = Макс(Окр(ПараметрыШтрихкода.Высота),1);	
	
	ВнешняяКомпонента.Ширина = ШиринаШтрихкода;
	ВнешняяКомпонента.Высота = ВысотаШтрихкода;
	ВнешняяКомпонента.АвтоТип = Ложь;
	
	ШтрихкодВрем = Строка(ПараметрыШтрихкода.Штрихкод); // Преобразуем явно в строку.
	
	Если ПараметрыШтрихкода.ТипКода = 99 Тогда
		ВнешняяКомпонента.АвтоТип = Истина;
	Иначе
		ВнешняяКомпонента.АвтоТип = Ложь;
		ВнешняяКомпонента.ТипКода = ПараметрыШтрихкода.ТипКода;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("ПрозрачныйФон") Тогда
		ВнешняяКомпонента.ПрозрачныйФон = ПараметрыШтрихкода.ПрозрачныйФон;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("ТипВходныхДанных") Тогда
		ВнешняяКомпонента.ТипВходныхДанных = ПараметрыШтрихкода.ТипВходныхДанных;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("GS1DatabarКоличествоСтрок") Тогда
		ВнешняяКомпонента.GS1DatabarКоличествоСтрок = ПараметрыШтрихкода.GS1DatabarКоличествоСтрок;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("УбратьЛишнийФон") Тогда
		ВнешняяКомпонента.УбратьЛишнийФон = ПараметрыШтрихкода.УбратьЛишнийФон;
	КонецЕсли;
	
	ВнешняяКомпонента.ОтображатьТекст = ПараметрыШтрихкода.ОтображатьТекст;
	// Формируем картинку штрихкода.
	ВнешняяКомпонента.ЗначениеКода = ШтрихкодВрем;
	// Угол поворота штрихкода.
	ВнешняяКомпонента.УголПоворота = ?(ПараметрыШтрихкода.Свойство("УголПоворота"), ПараметрыШтрихкода.УголПоворота, 0);
	// Уровень коррекции QR кода (L=0, M=1, Q=2, H=3).
	ВнешняяКомпонента.УровеньКоррекцииQR = ?(ПараметрыШтрихкода.Свойство("УровеньКоррекцииQR"), ПараметрыШтрихкода.УровеньКоррекцииQR, 1);
	
	// Для обеспечения совместимости с предыдущими версиями БПО.
	Если Не ПараметрыШтрихкода.Свойство("Масштабировать")
		Или (ПараметрыШтрихкода.Свойство("Масштабировать") И ПараметрыШтрихкода.Масштабировать) Тогда
		
		Если Не ПараметрыШтрихкода.Свойство("СохранятьПропорции")
			Или (ПараметрыШтрихкода.Свойство("СохранятьПропорции") И Не ПараметрыШтрихкода.СохранятьПропорции) Тогда
			// Если установленная нами ширина меньше минимально допустимой для этого штрихкода.
			Если ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода Тогда
				ВнешняяКомпонента.Ширина = ВнешняяКомпонента.МинимальнаяШиринаКода;
			КонецЕсли;
			// Если установленная нами высота меньше минимально допустимой для этого штрихкода.
			Если ВнешняяКомпонента.Высота < ВнешняяКомпонента.МинимальнаяВысотаКода Тогда
				ВнешняяКомпонента.Высота = ВнешняяКомпонента.МинимальнаяВысотаКода;
			КонецЕсли;
		ИначеЕсли ПараметрыШтрихкода.Свойство("СохранятьПропорции") И ПараметрыШтрихкода.СохранятьПропорции Тогда
			Пока ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода 
				Или ВнешняяКомпонента.Высота < ВнешняяКомпонента.МинимальнаяВысотаКода Цикл
				// Если установленная нами ширина меньше минимально допустимой для этого штрихкода.
				Если ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода Тогда
					ВнешняяКомпонента.Ширина = ВнешняяКомпонента.МинимальнаяШиринаКода;
					ВнешняяКомпонента.Высота = Окр(ВнешняяКомпонента.МинимальнаяШиринаКода / ШиринаШтрихкода) * ВысотаШтрихкода;
				КонецЕсли;
				// Если установленная нами высота меньше минимально допустимой для этого штрихкода.
				Если ВнешняяКомпонента.Высота < ВнешняяКомпонента.МинимальнаяВысотаКода Тогда
					ВнешняяКомпонента.Высота = ВнешняяКомпонента.МинимальнаяВысотаКода;
					ВнешняяКомпонента.Ширина = Окр(ВнешняяКомпонента.МинимальнаяВысотаКода / ВысотаШтрихкода) * ШиринаШтрихкода;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// ВертикальноеВыравниваниеКода: 1 - по верхнему краю, 2 - по центру, 3 - по нижнему краю.
	Если ПараметрыШтрихкода.Свойство("ВертикальноеВыравнивание") И (ПараметрыШтрихкода.ВертикальноеВыравнивание > 0) Тогда
		ВнешняяКомпонента.ВертикальноеВыравниваниеКода = ПараметрыШтрихкода.ВертикальноеВыравнивание;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("РазмерШрифта") И (ПараметрыШтрихкода.РазмерШрифта > 0) 
		И (ПараметрыШтрихкода.ОтображатьТекст) И (ВнешняяКомпонента.РазмерШрифта <> ПараметрыШтрихкода.РазмерШрифта) Тогда
		ВнешняяКомпонента.РазмерШрифта = ПараметрыШтрихкода.РазмерШрифта;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("РазмерШрифта") И ПараметрыШтрихкода.РазмерШрифта > 0
		И ПараметрыШтрихкода.Свойство("МонохромныйШрифт") Тогда
		Если ПараметрыШтрихкода.МонохромныйШрифт Тогда
			ВнешняяКомпонента.МаксимальныйРазмерШрифтаДляПринтеровНизкогоРазрешения = ПараметрыШтрихкода.РазмерШрифта + 1;
		Иначе
			ВнешняяКомпонента.МаксимальныйРазмерШрифтаДляПринтеровНизкогоРазрешения = -1;
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.ТипКода = 16 Тогда // QR
		Если ПараметрыШтрихкода.Свойство("ЛоготипКартинка") И ЗначениеЗаполнено(ПараметрыШтрихкода.ЛоготипКартинка) Тогда 
			ВнешняяКомпонента.ЛоготипКартинка = ПараметрыШтрихкода.ЛоготипКартинка;    
		Иначе
			ВнешняяКомпонента.ЛоготипКартинка = "";
		КонецЕсли;
		Если ПараметрыШтрихкода.Свойство("ЛоготипРазмерПроцентОтШК") И Не ПустаяСтрока(ПараметрыШтрихкода.ЛоготипРазмерПроцентОтШК) Тогда 
			ВнешняяКомпонента.ЛоготипРазмерПроцентОтШК = ПараметрыШтрихкода.ЛоготипРазмерПроцентОтШК;
		КонецЕсли;
	КонецЕсли;
	
	// Сформируем картинку
	ДвоичныеДанныеКартинки 		= ВнешняяКомпонента.ПолучитьШтрихкод();
	РезультатОперации.Успешно 	= (ВнешняяКомпонента.Результат = 0);
	// Если картинка сформировалась.
	Если ДвоичныеДанныеКартинки <> Неопределено Тогда
		РезультатОперации.ДвоичныеДанные	= ДвоичныеДанныеКартинки;
		РезультатОперации.Картинка 			= Новый Картинка(ДвоичныеДанныеКартинки); // Формируем из двоичных данных.
	КонецЕсли;
	
	Возврат РезультатОперации;
	
КонецФункции

&НаКлиенте
Процедура ИзменитьТипКороба(Команда)
	
	НадписьОтсканируйтеПоследнее = Элементы.НадписьОтсканируйте.Заголовок;
	
	ИзменениеТипаКороба = Истина;
	
	УстановитьВидимость();
	
КонецПроцедуры

// Кельманов А.В. - SNL-233 - 2026.05.15
&НаКлиенте
Процедура ПодтверждатьЭтикеткуОнлайнСканированиемПриИзменении(Элемент)
	
	Если Не ПодтверждатьЭтикеткуОнлайнСканированием Тогда
		
		ЗаписатьВЛог("Сканирование этикетки онлайн ЛП FBS", "Отключено подтверждение этикетки онлайн сканированием в обработке ""Формирование заказов FBS"" пользователем " + Сканировщик, "Информация");
		
	КонецЕсли;
	
КонецПроцедуры
