
&НаКлиенте
Процедура РегистрацияИзмененийДляОбмена(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбменСУзлом(Команда)
	Узел = Элементы.Список.ТекущаяСтрока;
	Если ЗначениеЗаполнено(Узел) Тогда
		Если Узел = Маркировка_ПИ.ЭтотУзел("ДанныеЧЗ") Тогда
			Сообщить("Обмен сам с собой не возможен !");	
		Иначе
			Если ОбменДаннымиЧЗ.ЕстьЗапущенныеЗаданияОбмена() Тогда
				ПоказатьПредупреждение(, "В настоящий момент уже выполняется обмен данными ! Ждите завершения ....");
				ЗаписатьВЛог("ОбменДаннымиЧЗ", "Попытка запуска обмена.", "Информация");
				Возврат;			
			КонецЕсли;
			
			пПроцедуры = Новый Массив;
			пПроцедуры.Добавить(Новый Структура("КодыУзлов", Узел));
			
			пВыполненияФЗ = инт_ДлительныеОперации.ПараметрыВыполненияФункции(Новый УникальныйИдентификатор);
			пВыполненияФЗ.КлючФоновогоЗадания = "ОбменДаннымиЧЗ";			
			
			рЗапуска = ЗапуститьОбменНаСервере(пПроцедуры);
			
			Если рЗапуска.Статус = "Ошибка" Тогда
				Сообщить(рЗапуска.ПодробноеПредставлениеОшибки, СтатусСообщения.Важное);
				Возврат;
			КонецЕсли; 
		
			пОжидания = инт_ДлительныеОперацииК.ПараметрыОжидания(ЭтотОбъект);
			пОжидания.ВыводитьПрогрессВыполнения = Истина;
			пОжидания.Заголовок = "Обмен данными ЧЗ";
			
			ооЗавершение = Новый ОписаниеОповещения("ОжиданиеЗавершенияФЗ", ЭтотОбъект, Новый Структура("Узел", Узел));
			
			инт_ДлительныеОперацииК.ОжидатьЗавершение(рЗапуска, ооЗавершение, пОжидания);			
		КонецЕсли;	
	Иначе
		Сообщить("Не выбран узел для обмена !");
	КонецЕсли;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗапуститьОбменНаСервере(пПроцедуры)
	Результат = Новый Структура;
	Результат.Вставить("Статус", "Выполняется");
	Результат.Вставить("ИдентификаторЗадания", Неопределено);
	Результат.Вставить("КраткоеПредставлениеОшибки", "");
	Результат.Вставить("ПодробноеПредставлениеОшибки", "");
	Результат.Вставить("Сообщения", Новый ФиксированныйМассив(Новый Массив));
	
	ФЗ = ФоновыеЗадания.Выполнить("ОбменДаннымиЧЗ.ОбменДанными", пПроцедуры, "ОбменДаннымиЧЗ.ОбменДанными", "ОбменДаннымиЧЗ.ОбменДанными");
	
	Если ФЗ.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
		Результат.Статус = "Ошибка";		
		Результат.ПодробноеПредставлениеОшибки = "" + ФЗ.ИнформацияОбОшибке.Описание;		
	КонецЕсли;	
	
	Результат.Вставить("ИдентификаторЗадания", ФЗ.УникальныйИдентификатор);
	
	Возврат Результат;
КонецФункции //ЗапуститьОбменНаСервере(пПроцедуры)

&НаКлиенте
Процедура ОжиданиеЗавершенияФЗ(РезультатФЗ = Неопределено, ДопПараметры = Неопределено) Экспорт
	Если ТипЗнч(РезультатФЗ) = Тип("Структура") Тогда
		Если РезультатФЗ.Статус = "Выполнено" Тогда
			Если ЭтоАдресВременногоХранилища(РезультатФЗ.АдресРезультата) Тогда
				рОбмена = ПолучитьИзВременногоХранилища(РезультатФЗ.АдресРезультата);
			Иначе
				рОбмена = Неопределено;
			КонецЕсли; 
			Узел = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Узел");			
			Сообщить(СтрШаблон("Успешно завершен обмен с узлом: '%1'.", Узел));
			
			МаркировкаК.ВывестиСообщения(рОбмена, СтатусСообщения.Информация);
		ИначеЕсли РезультатФЗ.Статус = "Ошибка" Тогда
			Сообщить(РезультатФЗ.ПодробноеПредставлениеОшибки, СтатусСообщения.Важное);		
		КонецЕсли;	
	Иначе
		Сообщить("Некорректный тип результата фонового задания: " + ТипЗнч(РезультатФЗ)+" ! Ожидаемый тип: 'Структура' !", СтатусСообщения.Важное);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ВРег(СокрЛП(ПараметрыСеанса.Пользователь)) <> "АДМИНИСТРАТОР"  Тогда
		Элементы.ФормаВыполнитьОбменСУзлом.Доступность = Ложь;	
	КонецЕсли; 
КонецПроцедуры
 
