#Область ПрограммныйИнтерфейс    

#Область ПроцедурыИФункцииБазовые

&НаКлиенте
Функция ПередНачаломРаботыСистемы() Экспорт
	
	Если глПодключаемоеОборудование = Неопределено Тогда
		глПодключаемоеОборудование = Новый Структура();
		
		глПодключаемоеОборудование.Вставить("ЗагруженныеДрайверы",		Новый Соответствие());
		глПодключаемоеОборудование.Вставить("ПодключенноеОборудование",	Новый Соответствие());
		
		глПодключаемоеОборудование.Вставить("ПоследнийСлипЧек", 		"");
		глПодключаемоеОборудование.Вставить("ЗавершениеРаботыСистемы",	Ложь);
	КонецЕсли;	
	
	ПараметрыФункции = Новый Структура;
	//ОборудованиеНаРабочемМесте = ШлюзВызовСервера.ВызватьФункциюМенеджера("Справочники.РабочиеМеста", "ПолучитьОборудованиеНаРабочемМесте", ПараметрыФункции);
КонецФункции


// Поиск по идентификатору подключенного ранее устройства. 
//
//  Параметры:
// 	СписокПодключений - Массив из Структура - содержит:
// 	*Ссылка - СправочникСсылка.ПодключаемоеОборудование - .
// 	Идентификатор - СправочникСсылка.ПодключаемоеОборудование - .
// Возвращаемое значение:
// 	СправочникСсылка.ПодключаемоеОборудование - Описание.
Функция ПолучитьПодключенноеУстройство(СписокПодключений, Идентификатор) Экспорт
	
	ПодключенноеУстройство = Неопределено;
	
	Для Каждого Подключение Из СписокПодключений Цикл
		Если Подключение.Ссылка = Идентификатор Тогда
			ПодключенноеУстройство = Подключение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПодключенноеУстройство;
	
КонецФункции

// Поиск по типу подключенные ранее устройства.
//
// Параметры:
// 	СписокПодключений - Массив из Структура - где:
// 	*Ссылка - СправочникСсылка.ПодключаемоеОборудование - .
// 	ТипПО - ПеречислениеСсылка.ТипыПодключаемогоОборудования - Описание
// 	Идентификатор - Неопределено - Описание
// Возвращаемое значение:
// 	Массив Из Структура - где:
// 	*Ссылка - СправочникСсылка.ПодключаемоеОборудование - .
Функция ПолучитьПодключенныеУстройства(СписокПодключений, ТипПО, Идентификатор = Неопределено) Экспорт
	
	ПодключенныеУстройства = Новый Массив();
	
	Для Каждого Подключение Из СписокПодключений Цикл
		Если Подключение.ТипОборудования = ТипПО Тогда
			Если (Идентификатор <> Неопределено) Тогда
				Если (Подключение.Ссылка = Идентификатор) Тогда
					ПодключенныеУстройства.Добавить(Подключение);
					Прервать;
				КонецЕсли;
			Иначе
				ПодключенныеУстройства.Добавить(Подключение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПодключенныеУстройства;
	
КонецФункции

Процедура НастроитьОборудование(Оборудование) Экспорт	
	//ИмяФайлаОбработки	= Справочники.ТорговоеОборудование.ИмяФайлаОбработкиОбслуживания(Оборудование);	
	//
	//ИмяОбработки		= "Обработка.ОбработкаОбслуживания_УниверсальныйДрайвер.Форма";	
	//
	//Если ЗначениеЗаполнено(ИмяФайлаОбработки) Тогда		
	//	Файл				= Новый Файл(ИмяФайлаОбработки);
	//	Если Файл.Существует() Тогда
	//		АдресХранилища		= "";	
	//    	Результат			= ПоместитьФайл(АдресХранилища,ИмяФайлаОбработки, , Ложь);           
	//		
	//		ВремИмяОбработки	= ПодключитьВнешнююОбработку(АдресХранилища);
	//		Если НЕ ПустаяСтрока(ВремИмяОбработки) Тогда
	//			ИмяОбработки 		= "ВнешняяОбработка."+ВремИмяОбработки+".Форма";							
	//		Иначе
	//			Сообщить("Ошибка при загрузке внешней обработки ! Имя файла: "+ИмяФайлаОбработки);				
	//		КонецЕсли;			
	//	Иначе
	//		Сообщить("Не найдена обработка обслуживания ! Имя файла: "+ИмяФайлаОбработки);
	//	КонецЕсли;		
	//КонецЕсли; 
	//
	//	
	////ВнешниеОбработки.Создать(ИмяФайлаОбработки,истина,
	//ОЗООД=Новый ОписаниеЗащитыОтОпасныхДействий;
	//ОЗООД.ПредупреждатьОбОпасныхДействиях=Ложь;	
	//
	//ПараметрыОбработки		= Новый Структура("Оборудование",Оборудование);	
	//
	//НастроитьОборудование_Завершение = Новый ОписаниеОповещения("НастроитьОборудование_Завершение", МенеджерОборудованияКлиент, Новый Структура);
	//
	//ОткрытьФорму(ИмяОбработки,ПараметрыОбработки,,,,,НастроитьОборудование_Завершение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОборудование_Завершение(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		РезультатЗавершения = Ложь;
		Если Результат.Свойство("Оборудование") И Результат.Свойство("ПараметрыОборудования") Тогда
			РезультатЗавершения = СохранитьПараметрыУстройства(Результат.Оборудование, Результат.ПараметрыОборудования);
		КонецЕсли;
		
		Если РезультатЗавершения Тогда 
			ОбновитьПовторноИспользуемыеЗначения();
		Иначе
			СообщениеОбОшибке = НСтр("ru='Не удалось сохранить параметры устройства.'");
			Сообщить(СообщениеОбОшибке);
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры
 

// Сохраняет пользовательские настройки подключаемого оборудования.
//
Процедура СохранитьПользовательскиеНастройкиПодключаемогоОборудования(СписокНастроек) Экспорт
	
	//МенеджерОборудованияВызовСервера.СохранитьПользовательскиеНастройкиПодключаемогоОборудования(СписокНастроек);
	
КонецПроцедуры

#КонецОбласти

#Область РаспределеннаяФискализации

&НаКлиенте
Процедура ОбработкаОповещенияПодключенияСообщенийФискализации(ДополнительныеПараметры) Экспорт
	
	Оповестить("ПодключенияСообщенийФискализации");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещенияСообщенийФискализации(Сообщение, ДополнительныеПараметры) ЭКспорт
	
	Если СтрНачинаетсяС(Сообщение.Текст, НСтр("ru='Фискализация чека'")) Тогда
		Оповестить("ФискализацияЧека", Сообщение.Текст);
		//ФискализацияЧековВОчереди();
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДоступноеККТДляФискализации(РеквизитыЧека, СписокУстройств)
	
	ИдентификаторУстройстваККТ = Неопределено;
	
	Для Каждого Устройство Из СписокУстройств Цикл
		УстройствоОрганизацияИНН 		= Устройство.ПараметрыРегистрации.ОрганизацияИНН; 
		УстройствоКодыНалогообложения 	= СтрРазделить(Устройство.ПараметрыРегистрации.КодыСистемыНалогообложения, ",");
		ОрганизацияИНН 					= РеквизитыЧека.ОрганизацияИНН;
		
		СистемаНалогообложения			= КодСистемыНалогообложенияККТ(РеквизитыЧека.СистемаНалогообложения);
		
		Если УстройствоКодыНалогообложения.Найти(Строка(СистемаНалогообложения)) <> Неопределено 
			И УстройствоОрганизацияИНН = ОрганизацияИНН Тогда
				ИдентификаторУстройстваККТ = Устройство.Ссылка;
				Прервать; 
		КонецЕсли;
	КонецЦикла;	
	
	Возврат ИдентификаторУстройстваККТ;    
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции


//// Выполняет обновление имени компьютера в параметре сеанса "РабочееМестоКлиента".
////
//Функция ОбновитьРабочееМестоКлиента() Экспорт
//	
//	Результат = Истина;
//	
//	РабочееМесто = МенеджерОборудованияКлиентПовтИсп.ПолучитьРабочееМестоКлиента();
//	
//	Если Не ЗначениеЗаполнено(РабочееМесто) Тогда
//		СистемнаяИнформация = Новый СистемнаяИнформация();
//		
//		МассивРабочихМест = МенеджерОборудованияКлиентПовтИсп.НайтиРабочиеМестаПоИД(ВРег(СистемнаяИнформация.ИдентификаторКлиента));
//		Если МассивРабочихМест.Количество() = 0 Тогда
//			Параметры = Новый Структура;
//			Параметры.Вставить("ИмяКомпьютера");
//			Параметры.Вставить("ИдентификаторКлиента");
//			
//			#Если Не ВебКлиент Тогда
//				Параметры.ИмяКомпьютера = ИмяКомпьютера();
//			#КонецЕсли
//			
//			Параметры.ИдентификаторКлиента = ВРег(СистемнаяИнформация.ИдентификаторКлиента);
//			//РабочееМесто = МенеджерОборудованияВызовСервера.СоздатьРабочееМестоКлиента(Параметры);
//		Иначе
//			РабочееМесто = МассивРабочихМест[0];
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//	//Если Результат И РабочееМесто <> ОбщегоНазначенияКлиент.ПолучитьПараметрСеанса("РабочееМестоКлиента") Тогда
//	//	ШлюзВызовСервера.УстановитьРабочееМестоКлиента(РабочееМесто);
//	//	Оповестить("ИзмененоРабочееМестоТекущегоСеанса", РабочееМесто);
//	//КонецЕсли;
//	
//	Возврат Результат;
//	
//КонецФункции

// Заполняет структуру выполнения операции на Оборудовании.
// 
Функция ПараметрыВыполненияОперацииНаОборудовании(Результат = Ложь, ОписаниеОшибки = Неопределено, ИдентификаторУстройства = Неопределено) Экспорт; 
	
	РезультатВыполнения = Новый Структура();
	РезультатВыполнения.Вставить("Результат"              , Результат);
	РезультатВыполнения.Вставить("ОписаниеОшибки"         , ОписаниеОшибки);
	РезультатВыполнения.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	РезультатВыполнения.Вставить("ВыходныеПараметры"      , Неопределено);
	Возврат РезультатВыполнения;
	
КонецФункции

// Завершение выбора файла
//
Процедура НачатьВыборФайлаРасширенияЗавершение(Установлено, ДополнительныеПараметры) Экспорт
	
	//Если Установлено Тогда
	//	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла[ДополнительныеПараметры.РежимДиалогаВыбораФайла]);
	//	Диалог.МножественныйВыбор = Ложь;
	//	Диалог.ПолноеИмяФайла = ДополнительныеПараметры.ИмяФайла;
	//	Диалог.Показать(ДополнительныеПараметры.ОповещениеПриВыборе);
	//КонецЕсли;
	
КонецПроцедуры
 
// Функция начинает выбор файла.
//
Процедура НачатьВыборФайла(ОповещениеПриВыборе, Знач ИмяФайла, РежимДиалогаВыбораФайла = "Открытие") Экспорт
	
	//ПараметрыКоманды = Новый Структура("ОповещениеПриВыборе, ИмяФайла, РежимДиалогаВыбораФайла", ОповещениеПриВыборе, ИмяФайла, РежимДиалогаВыбораФайла);
	//Оповещение = Новый ОписаниеОповещения("НачатьВыборФайлаРасширенияЗавершение", ЭтотОбъект, ПараметрыКоманды);
	//ПроверитьДоступностьРасширенияРаботыСФайлами(Оповещение);
	//СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

// Процедура формирует задержку указанной длительности.
//
// Параметры:
//  Время - <Число>
//        - Длительность задержки в секундах.
//
Процедура Пауза(Время) Экспорт

	ВремяЗавершения = ТекущаяДата() + Время;
	Пока ТекущаяДата() < ВремяЗавершения Цикл
	КонецЦикла;

КонецПроцедуры

// Преобразовать список строкой в массив.
//
Функция ПреобразоватьСписокСтрокойВМассив(Источник) Экспорт
	
	ПромежуточнаяСтруктура = Новый Структура(Источник);
	Приемник = Новый Массив;
	
	Для Каждого КлючИЗначение Из ПромежуточнаяСтруктура Цикл
		Приемник.Добавить(КлючИЗначение.Ключ);
	КонецЦикла;
	
	Возврат Приемник;
	
КонецФункции

// Выводит текст в панель состояния.
//
Процедура СостояниеПроцесса(ТекстСообщения, Прогресс = Неопределено, Пояснение = Неопределено) Экспорт
	
#Если Клиент Тогда
	Состояние(ТекстСообщения, Прогресс);
#КонецЕсли 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииДляРаботыСПодключаемымОборудованием

// Выполняет дополнительную команду к драйверу, не требующую предварительного подключения устройства в системе.
// 
//  Параметры:
// 	Команда - Строка - наименование команды.
// 	ВходныеПараметры - Массив - массив входных параметров.
// 	ВыходныеПараметры - Массив - массив выходных параметров.
// 	Идентификатор - СправочникСсылка.ПодключаемоеОборудование - .
// 	Параметры - Структура - параметры выполнения операции.
// Возвращаемое значение:
// 	Булево - Описание
Функция ВыполнитьДополнительнуюКоманду(Команда, ВходныеПараметры, ВыходныеПараметры, Идентификатор, Параметры) Экспорт
	
	Результат = Ложь;
	//
	//// Поиск подключенного устройства.
	//ПодключенноеУстройство = ПолучитьПодключенноеУстройство(глПодключаемоеОборудование.ПараметрыПодключенияПО, Идентификатор);
	//
	//Если ПодключенноеУстройство = Неопределено Тогда
	//	
	//	ДанныеОборудования = МенеджерОборудованияВызовСервера.ПолучитьДанныеУстройства(Идентификатор);
	//	
	//	времПараметрыПодключения = Новый Структура();
	//	времПараметрыПодключения.Вставить("ТипОборудования", ДанныеОборудования.ТипОборудованияИмя);
	//	
	//	ОбъектДрайвера = ПолучитьОбъектДрайвера(ДанныеОборудования);
	//	Если ОбъектДрайвера = Неопределено Тогда
	//		// Сообщить об ошибке, что не удалось загрузить драйвер.
	//		ТекстСообщения = НСтр("ru='Не удалось загрузить драйвер устройства.
	//									|Проверьте, что драйвер корректно установлен и зарегистрирован в системе.'");
	//		ВыходныеПараметры = Новый Массив();
	//		ВыходныеПараметры.Добавить(999);
	//		ВыходныеПараметры.Добавить(ТекстСообщения);
	//		ВыходныеПараметры.Добавить(НСтр("ru='Не установлен'"));
	//		
	//	Иначе
	//		ОбработчикДрайвераМодуль = МенеджерОборудованияКлиентПовтИсп.ПолучитьОбработчикДрайвера(ДанныеОборудования.ОбработчикДрайвера, Не ДанныеОборудования.ВСоставеКонфигурации, ДанныеОборудования.ТипОборудованияИмя);
	//		Если ОбработчикДрайвераМодуль = Неопределено Тогда
	//			// Сообщить об ошибке, что не удалось загрузить драйвер.
	//			ТекстСообщения = НСтр("ru='Не удалось подключить обработчик драйвера.'");
	//			ВыходныеПараметры = Новый Массив();
	//			ВыходныеПараметры.Добавить(999);
	//			ВыходныеПараметры.Добавить(ТекстСообщения);
	//			ВыходныеПараметры.Добавить(НСтр("ru='Не установлен'"));
	//		Иначе
	//			#Если ВебКлиент Тогда
	//			// Принудительно заменяем асинхронный обработчик на синхронный, так как работам в синхронном режиме.
	//			Если ОбработчикДрайвераМодуль = ПодключаемоеОборудованиеУниверсальныйДрайверАсинхронноКлиент Тогда
	//				ОбработчикДрайвераМодуль = ПодключаемоеОборудованиеУниверсальныйДрайверКлиент;
	//			КонецЕсли;
	//			#КонецЕсли
	//			
	//			Результат = ОбработчикДрайвераМодуль.ВыполнитьКоманду(Команда, ВходныеПараметры, ВыходныеПараметры, ОбъектДрайвера, Параметры, времПараметрыПодключения);
	//			Если Не Результат Тогда
	//				ВыходныеПараметры = Новый Массив();
	//				ВыходныеПараметры.Добавить(НСтр("ru='Установлен'"));
	//			КонецЕсли;
	//		КонецЕсли
	//	КонецЕсли;
	//Иначе
	//	// Сообщить об ошибке, что устройство подключено.
	//	ТекстСообщения = НСтр("ru='Устройство подключено. Перед выполнением операции устройство должно быть отключено.'");
	//	ВыходныеПараметры = Новый Массив();
	//	ВыходныеПараметры.Добавить(999);
	//	ВыходныеПараметры.Добавить(ТекстСообщения);
	//	ВыходныеПараметры.Добавить(НСтр("ru='Установлен'"));
	//КонецЕсли;
	//
	Возврат Результат;
	
КонецФункции

// Выполняет команду обработчика драйвера, не требующую предварительного подключения устройства в системе.
//
Функция ВыполнитьКомандуОбработчикаДрайвера(Команда, ВходныеПараметры, ВыходныеПараметры, Идентификатор, Параметры, ПоддержкаАсинхронногоРежима) Экспорт
	
	Результат = Ложь;
	
	Если Идентификатор <> Неопределено Тогда
		//ДанныеОборудования = МенеджерОборудованияВызовСервера.ПолучитьДанныеУстройства(Идентификатор);
		//ОбработчикДрайвераМодуль = МенеджерОборудованияКлиентПовтИсп.ПолучитьОбработчикДрайвера(ДанныеОборудования.ОбработчикДрайвера, Не ДанныеОборудования.ВСоставеКонфигурации, ДанныеОборудования.ТипОборудованияИмя);
		//Если ОбработчикДрайвераМодуль <> Неопределено Тогда
		//	Результат = ОбработчикДрайвераМодуль.ВыполнитьКоманду(Команда, ВходныеПараметры, ВыходныеПараметры, Неопределено, Параметры, Неопределено);
		//	ПоддержкаАсинхронногоРежима = ОбработчикДрайвераМодуль.ПоддержкаАсинхронногоРежима();
		//КонецЕсли;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

#КонецОбласти  

#Область ПроцедурыИФункцииДляРаботыСДрайвером

// Проверяет установлен ли драйвер.
//
Функция ДрайверУстановлен(Идентификатор) Экспорт
	
	Возврат ДрайверУстановлен(Идентификатор);	
	
КонецФункции

#Если Не ВебКлиент Тогда

// Установить или переустановить драйверы помеченные флагами.
//
Процедура ПереустановитьПомеченныеДрайверы() Экспорт
	
	//СистемнаяИнформация = Новый СистемнаяИнформация();
	//МассивРабочихМест = МенеджерОборудованияКлиентПовтИсп.НайтиРабочиеМестаПоИД(ВРег(СистемнаяИнформация.ИдентификаторКлиента));
	//Если МассивРабочихМест.Количество() = 0 Тогда
	//	РабочееМесто = Неопределено
	//Иначе
	//	РабочееМесто = МассивРабочихМест[0];
	//КонецЕсли;
	//
	//// Переустановить драйверы помеченные флагом для переустановки.
	//Если ЗначениеЗаполнено(РабочееМесто) Тогда
	//	СписокОборудования = МенеджерОборудованияВызовСервера.ДрайвераДляПереустановки(РабочееМесто);
	//	Для Каждого Оборудование Из СписокОборудования Цикл
	//		Если Оборудование.ДанныеДрайвера.ВСоставеКонфигурации И НЕ Оборудование.ДанныеДрайвера.ПоставляетсяДистрибутивом Тогда
	//			НачатьУстановкуВнешнейКомпоненты(, "ОбщийМакет." + Оборудование.ДанныеДрайвера.ИмяМакетаДрайвера);
	//		КонецЕсли;
	//		МенеджерОборудованияВызовСервера.УстановитьПризнакПереустановкиДрайвера(РабочееМесто, Оборудование.ДрайверОборудования, Ложь); 
	//	КонецЦикла;
	//КонецЕсли;
	//
	//// Установить драйверы помеченные флагом для установки.
	//Если ЗначениеЗаполнено(РабочееМесто) Тогда
	//	СписокОборудования = МенеджерОборудованияВызовСервера.ДрайвераДляУстановки(РабочееМесто);
	//	Для Каждого Оборудование Из СписокОборудования Цикл
	//		Если Оборудование.ДанныеДрайвера.ВСоставеКонфигурации И НЕ Оборудование.ДанныеДрайвера.ПоставляетсяДистрибутивом Тогда
	//			ОбъектДрайвера = ПолучитьОбъектДрайвера(Оборудование.ДанныеДрайвера);
	//			Если ОбъектДрайвера = Неопределено Тогда
	//				НачатьУстановкуВнешнейКомпоненты(, "ОбщийМакет." + Оборудование.ДанныеДрайвера.ИмяМакетаДрайвера);
	//			Иначе
	//				ОтключитьОбъектДрайвера(Оборудование.ДанныеДрайвера);
	//			КонецЕсли;
	//		КонецЕсли;
	//		МенеджерОборудованияВызовСервера.УстановитьПризнакУстановкиДрайвера(РабочееМесто, Оборудование.ДрайверОборудования, Ложь); 
	//	КонецЦикла;
	//КонецЕсли;
	
КонецПроцедуры

#Иначе

Процедура НачатьУстановкуРасширенияРаботыСФайламиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		НачатьУстановкуРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьПодключениеРасширенияРаботыСФайламиЗавершение(Подключено, ДополнительныеПараметры) Экспорт
	
	//Если Не Подключено И ДополнительныеПараметры.ПредлагатьУстановку Тогда
	//	Оповещение = Новый ОписаниеОповещения("НачатьУстановкуРасширенияРаботыСФайламиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	//	ТекстСообщения = НСтр("ru='Для продолжении работы необходимо установить расширение для веб-клиента ""1С:Предприятие"". Установить?'");
	//	ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет); 
	//КонецЕсли;
	//
	//Если ДополнительныеПараметры.ОповещениеПриЗавершении <> Неопределено Тогда
	//	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПриЗавершении, Подключено);
	//КонецЕсли
	//
КонецПроцедуры

#КонецЕсли

// Проверить доступность расширения работы с Файлами.
// 
Процедура ПроверитьДоступностьРасширенияРаботыСФайлами(ОповещениеПриЗавершении, ПредлагатьУстановку = Истина) Экспорт
	
//#Если Не ВебКлиент Тогда
//	// В тонком и толстом клиентах расширение подключено всегда.
//	ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Истина);
//	Возврат;
//#Иначе
//	ДополнительныеПараметры = Новый Структура("ОповещениеПриЗавершении, ПредлагатьУстановку", ОповещениеПриЗавершении, ПредлагатьУстановку);
//	Оповещение = Новый ОписаниеОповещения("НачатьПодключениеРасширенияРаботыСФайламиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
//	НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);
//#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОбъектДрайвера(ДанныеДрайвера) Экспорт

	НомерСтрокиМассива = глПодключаемоеОборудование.ПараметрыПодключенияПО.Найти(ДанныеДрайвера.ДрайверОборудования);
	Если НомерСтрокиМассива <> Неопределено Тогда
		глПодключаемоеОборудование.ПараметрыПодключенияПО.Удалить(НомерСтрокиМассива);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеОбъектаДрайвераЗавершение(Подключено, ДополнительныеПараметры) Экспорт
	
	ОбъектДрайвера = Неопределено;
	
	Если Подключено Тогда 
		Попытка
			ОбъектДрайвера = Новый (ДополнительныеПараметры.ProgID);			
		Исключение			
		КонецПопытки;
	Иначе
		Попытка		
			ПодключитьВнешнююКомпоненту(ДополнительныеПараметры.ИдентификаторОбъекта);
			ОбъектДрайвера = Новый (ДополнительныеПараметры.ИдентификаторОбъекта);		
		Исключение		
		КонецПопытки;
	КонецЕсли;
	
	Если ОбъектДрайвера<>Неопределено Тогда
		глПодключаемоеОборудование.ДрайвераПодключаемогоОборудования.Вставить(ДополнительныеПараметры.ДрайверОборудования, ОбъектДрайвера);	
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПриЗавершении, Неопределено);
	
КонецПроцедуры

// Начать получение объекта драйвера.
//
Процедура НачатьПолучениеОбъектаДрайвера(ОповещениеПриЗавершении, ДанныеДрайвера) Экспорт
	
	//ОбъектДрайвера = Неопределено;
	//
	//Для Каждого ДрайверПО Из глПодключаемоеОборудование.ДрайвераПодключаемогоОборудования Цикл
	//	Если ДрайверПО.Ключ = ДанныеДрайвера.ДрайверОборудования  Тогда
	//		ОбъектДрайвера = ДрайверПО.Значение;
	//		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, ОбъектДрайвера);
	//		Возврат;
	//	КонецЕсли;
	//КонецЦикла;   
	//
	//Если ОбъектДрайвера = Неопределено Тогда
	//		ProgID = ДанныеДрайвера.ИдентификаторОбъекта;
	//		Если ПустаяСтрока(ProgID) Тогда
	//			ОбъектДрайвера = ""; // Драйвер не требуется
	//			ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, ОбъектДрайвера);
	//		Иначе
	//			ProgID1 = ?(Найти(ProgID, "|") > 0, Сред(ProgID, 1, Найти(ProgID, "|")-1), ProgID); 
	//			ProgID2 = ?(Найти(ProgID, "|") > 0, Сред(ProgID, Найти(ProgID, "|")+1), ProgID); 
	//			
	//			Если ДанныеДрайвера.ПоставляетсяДистрибутивом Тогда
	//				Параметры = Новый Структура("ProgID, ОповещениеПриЗавершении, ДрайверОборудования", ProgID2, ОповещениеПриЗавершении, ДанныеДрайвера.ДрайверОборудования);
	//				Оповещение = Новый ОписаниеОповещения("НачатьПолучениеОбъектаДрайвераЗавершение", ЭтотОбъект, Параметры);
	//				НачатьПодключениеВнешнейКомпоненты(Оповещение, ProgID1);
	//			Иначе
	//				ИмяОбъекта = Сред(ProgID1, Найти(ProgID1, ".") + 1); 
	//				Префикс = Сред(ProgID1, 1, Найти(ProgID1, ".")); 
	//				ProgID2 = Префикс + СтрЗаменить(ИмяОбъекта, ".", "_") + "." + ИмяОбъекта;
	//				
	//				Параметры = Новый Структура("ProgID, ОповещениеПриЗавершении, ДрайверОборудования, ИдентификаторОбъекта", ProgID2, ОповещениеПриЗавершении, ДанныеДрайвера.ДрайверОборудования,ДанныеДрайвера.ИдентификаторОбъекта);
	//				Оповещение = Новый ОписаниеОповещения("НачатьПолучениеОбъектаДрайвераЗавершение", ЭтотОбъект, Параметры);
	//				Если ДанныеДрайвера.ВСоставеКонфигурации Тогда
	//					НачатьПодключениеВнешнейКомпоненты(Оповещение, "ОбщийМакет." + ДанныеДрайвера.ИмяМакетаДрайвера, СтрЗаменить(ИмяОбъекта, ".", "_"));
	//				Иначе
	//					СсылкаНаДрайвер = ПолучитьНавигационнуюСсылку(ДанныеДрайвера.ДрайверОборудования, "ЗагруженныйДрайвер");
	//					НачатьПодключениеВнешнейКомпоненты(Оповещение, СсылкаНаДрайвер, СтрЗаменить(ИмяОбъекта, ".", "_"));
	//				КонецЕсли;
	//			КонецЕсли;
	//			
	//		КонецЕсли;
	//КонецЕсли;   
	
КонецПроцедуры

// Установить драйвер оборудования.

&НаКлиенте
Процедура УстановитьДрайвер(Идентификатор, ОповещениеИзДистрибутиваПриЗавершении = Неопределено, ОповещениеИзАрхиваПриЗавершении = Неопределено) Экспорт
	
	//+++++ Лепешкин А.В.
	ДанныеДрайвера = ВызватьФункциюМенеджера("Справочники.ДрайверыОборудования","ПолучитьДанныеДрайвера",Новый Структура("Ссылка",Идентификатор));
	//ДанныеДрайвера = ШлюзВызовСервера.ПолучитьДанныеУстройства(Идентификатор);
	//----- Лепешкин А.В.
	
	Попытка		
		СсылкаНаДрайвер = ПолучитьНавигационнуюСсылку(ДанныеДрайвера.Ссылка, "ЗагруженныйДрайвер");
		
		НачатьУстановкуВнешнейКомпоненты(ОповещениеИзАрхиваПриЗавершении, СсылкаНаДрайвер);
		
	Исключение
		Сообщить(НСтр("ru='Произошла ошибка при установке драйвера.'")); 
	КонецПопытки;  
		
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииРаботыСФискальнымиУстройствами


// Вспомогательная функция - осуществляет печать чека по шаблону.
//
//  Параметры:
// 	ОбщийМодульОборудования - Строка - .
// 	ОбъектДрайвера - СправочникСсылка.ДрайверыОборудования - .
// 	Параметры - Структура - .
// 	ПараметрыПодключения - Структура - .
// 	ВходныеПараметры - Структура - где:
// 	*ПозицииЧека - Массив из Структура - где: 
// 	**Наименование - Строка - .
// 	ВыходныеПараметры - Структура - .
// Возвращаемое значение:
// 	Булево - Описание
//
Функция ПечатьЧекаПоШаблону(ОбщийМодульОборудования, ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры) Экспорт
	
	Результат  = Истина;
	
	ПозицииЧека  = ВходныеПараметры.ПозицииЧека;
	ТаблицаОплат = ВходныеПараметры.ТаблицаОплат;
	
	Если ВходныеПараметры.Свойство("ПодписьЧека")  Тогда
		// Печать чека производиться в 2 этапа. Чека был открыт ранее.
		РасширенныеПараметры = ВходныеПараметры.ПодписьЧека; 
		// Заполнение выходных параметров.
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(РасширенныеПараметры.НомерСмены);
		ВыходныеПараметры.Добавить(РасширенныеПараметры.НомерЧека);
		ВыходныеПараметры.Добавить(0); // Номер документа
		ВыходныеПараметры.Добавить(ТекущаяДата());
		ВыходныеПараметры.Добавить(Неопределено);
		ВыходныеПараметры.Добавить(Неопределено);
		ВыходныеПараметры.Добавить(Неопределено);
		ВыходныеПараметры.Добавить(Неопределено);
		ВыходныеПараметры.Добавить(Неопределено);
	Иначе
		ТипРасчета = КодРасчетаДенежнымиСредствами(ВходныеПараметры.ТипРасчета);
		ТипЧека =  ?(ТипРасчета = 1, Ложь, Истина);
		// Открываем чек
		Результат = ОбщийМодульОборудования.ОткрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТипЧека, Истина, ВыходныеПараметры);
	КонецЕсли;
	
	// Печатаем строки чека   
	Если Результат Тогда
		
		ОшибкаПриПечати = Ложь;
		// Печатаем позиции чека
		Для ИндексМассива = 0 По ПозицииЧека.Количество() - 1 Цикл
			
			ПозицияЧека = ПозицииЧека[ИндексМассива];
			Если ПозицияЧека.Свойство("ФискальнаяСтрока") Тогда
				Наименование  = ?(ПозицияЧека.Свойство("Наименование") , ПозицияЧека.Наименование, "");
				Количество    = ?(ПозицияЧека.Свойство("Количество")   , ПозицияЧека.Количество  , 1);
				Цена          = ?(ПозицияЧека.Свойство("Цена")         , ПозицияЧека.Цена        , 0);
				Сумма         = ?(ПозицияЧека.Свойство("Сумма")        , ПозицияЧека.Сумма       , 0);
				НомерСекции   = ?(ПозицияЧека.Свойство("НомерСекции")  , ПозицияЧека.НомерСекции , 0);
				СтавкаНДС     = ?(ПозицияЧека.Свойство("СтавкаНДС")    , ПозицияЧека.СтавкаНДС   , 0);
				Если НЕ ОбщийМодульОборудования.НапечататьФискальнуюСтроку(ОбъектДрайвера, Параметры, ПараметрыПодключения,
									Наименование, Количество, Цена, Сумма, НомерСекции, СтавкаНДС, ВыходныеПараметры) Тогда
					ОшибкаПриПечати = Истина;   
					Прервать;
				КонецЕсли;
			ИначеЕсли ПозицияЧека.Свойство("ТекстоваяСтрока") Тогда
				Текст = ?(ПозицияЧека.Свойство("Текст"), ПозицияЧека.Текст, "");
				Если НЕ ОбщийМодульОборудования.НапечататьНефискальнуюСтроку(ОбъектДрайвера, Параметры, ПараметрыПодключения,
											Текст, ВыходныеПараметры) Тогда
					ОшибкаПриПечати = Истина;   
					Прервать;
				КонецЕсли;
			ИначеЕсли ПозицияЧека.Свойство("Штрихкод") Тогда
				ВремВыходныеПараметры = Новый Массив();
				ТипШтрихКодаЗнач = ?(ПозицияЧека.Свойство("ТипШтрихКода"), ПозицияЧека.ТипШтрихКода, "");
				ШтрихКод     = ?(ПозицияЧека.Свойство("ШтрихКод")    , ПозицияЧека.ШтрихКод    , "");
				Если НЕ ОбщийМодульОборудования.ПечатьШтрихкода(ОбъектДрайвера, Параметры, ПараметрыПодключения,
											ТипШтрихКодаЗнач, ШтрихКод, ВремВыходныеПараметры) Тогда
					Текст = НСтр("ru='<Штрихкод %ТипШтрихКода% не распечатан>'");
					Текст = СтрЗаменить(Текст, "%ТипШтрихКода%", ТипШтрихКодаЗнач);
					Если НЕ ОбщийМодульОборудования.НапечататьНефискальнуюСтроку(ОбъектДрайвера, Параметры, ПараметрыПодключения,
						Текст, ВремВыходныеПараметры) Тогда
						ОшибкаПриПечати = Истина;   
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;		
		КонецЦикла;
			
		Если НЕ ОшибкаПриПечати Тогда
		  	// Закрываем чек
			ТаблицаОплатЧека = Новый Массив();
			Если ТаблицаОплат <> Неопределено Тогда
				
				СуммаНаличными       = 0;
				СуммаЭлектронными    = 0;
				СуммаПостоплатой     = 0;
				СуммаПредоплатой     = 0;
				СуммаПредоставлением = 0;
				
				Для ИндексОплаты = 0 По ТаблицаОплат.Количество() - 1 Цикл
					Если ТаблицаОплат[ИндексОплаты].ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Электронно") Тогда
						СуммаЭлектронными = СуммаЭлектронными + ТаблицаОплат[ИндексОплаты].Сумма;
					ИначеЕсли ТаблицаОплат[ИндексОплаты].ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Предоплата") Тогда
						СуммаПредоплатой = СуммаПредоплатой + ТаблицаОплат[ИндексОплаты].Сумма;
					ИначеЕсли ТаблицаОплат[ИндексОплаты].ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Постоплата") Тогда
						СуммаПостоплатой = СуммаПостоплатой + ТаблицаОплат[ИндексОплаты].Сумма;
					ИначеЕсли ТаблицаОплат[ИндексОплаты].ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.ВстречноеПредоставление") Тогда
						СуммаПредоставлением = СуммаПредоставлением + ТаблицаОплат[ИндексОплаты].Сумма;
					Иначе
						СуммаНаличными = СуммаНаличными + ТаблицаОплат[ИндексОплаты].Сумма;
					КонецЕсли;
				КонецЦикла;
				
				СтрокаОплаты = Новый СписокЗначений();
				СтрокаОплаты.Добавить(0);
				СтрокаОплаты.Добавить(СуммаНаличными);
				ТаблицаОплатЧека.Добавить(СтрокаОплаты);
				
				СтрокаОплаты = Новый СписокЗначений();
				СтрокаОплаты.Добавить(1);
				СтрокаОплаты.Добавить(СуммаЭлектронными + СуммаПредоставлением);
				ТаблицаОплатЧека.Добавить(СтрокаОплаты);
				
				СтрокаОплаты = Новый СписокЗначений();
				СтрокаОплаты.Добавить(2);
				СтрокаОплаты.Добавить(СуммаПостоплатой);
				ТаблицаОплатЧека.Добавить(СтрокаОплаты);
				
				СтрокаОплаты = Новый СписокЗначений();
				СтрокаОплаты.Добавить(3);
				СтрокаОплаты.Добавить(СуммаПредоплатой);
				ТаблицаОплатЧека.Добавить(СтрокаОплаты);
				
			КонецЕсли;
			Результат = ОбщийМодульОборудования.ЗакрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаОплатЧека, ВыходныеПараметры);
		Иначе
			Результат = Ложь;
		КонецЕсли;
			
		КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Заполнить параметры операции подписи чека.
// 
Процедура ЗаполнитьПараметрыОперацииПодписиЧека(ПараметрыОперации, НомерСмены = Неопределено, 
	НомерЧека = Неопределено, ЗаводскойНомерФН = Неопределено) Экспорт; 
	
	ПараметрыОперации.Вставить("ИНН"       , Неопределено);
	ПараметрыОперации.Вставить("КПП"       , Неопределено);
	ПараметрыОперации.Вставить("НомерСмены", НомерСмены);
	ПараметрыОперации.Вставить("НомерЧека" , НомерЧека);
	ПараметрыОперации.Вставить("НомерКассы"      , Неопределено);
	ПараметрыОперации.Вставить("ЗаводскойНомерФН", ЗаводскойНомерФН);
	ПараметрыОперации.Вставить("НаименованиеОрганизации", Неопределено);
	
КонецПроцедуры

Функция СформироватьШаблонИнфоКвитанции(Параметры, ШиринаСтроки, ПечатьШтрихкода = Истина) Экспорт
	
	Текст = ВыстроитьПоля(Параметры.НаименованиеОрганизации, , ШиринаСтроки) + Символы.ПС;
	
	АдресЧека = ?(Параметры.Свойство("АдресЧека"), Параметры.АдресЧека, Неопределено);
	ПодписьЧека = ?(Параметры.Свойство("ПодписьЧека"), Параметры.ПодписьЧека, Неопределено);
	
	ОрганизацияИНН = ?(НЕ ПустаяСтрока(Параметры.ИНН), НСтр("ru='ИНН:'") + Параметры.ИНН, "");
	ОрганизацияКПП = ?(НЕ ПустаяСтрока(Параметры.КПП), НСтр("ru='КПП:'") + Параметры.КПП, "");
	Если Не ПустаяСтрока(ОрганизацияИНН) Или НЕ ПустаяСтрока(ОрганизацияКПП) Тогда
		Текст = Текст + ВыстроитьПоля(ОрганизацияИНН, ОрганизацияКПП, ШиринаСтроки) + Символы.ПС;
	КонецЕсли;  
	
	НомерКассы = ?(НЕ ПустаяСтрока(Параметры.НомерКассы), НСтр("ru='КАССА:'") + Параметры.НомерКассы, "");
	НомерСмены = ?(НЕ ПустаяСтрока(Параметры.НомерСмены), НСтр("ru='СМЕНА:'") + Формат(Параметры.НомерСмены, "ЧГ=0"), 0);
	
	Если Не ПустаяСтрока(НомерКассы) Или НЕ ПустаяСтрока(НомерСмены) Тогда
		Текст = Текст + ВыстроитьПоля(НомерКассы, НомерСмены, ШиринаСтроки) + Символы.ПС;
	КонецЕсли;
	
	НомерЧека = ?(НЕ ПустаяСтрока(Параметры.НомерЧека), НСтр("ru='ЧЕК:'") + Параметры.НомерЧека, "");
	ДатаВремя = НСтр("ru='ДАТА:'") + Формат(ТекущаяДата(), "ДФ=""дд.ММ.гггг ЧЧ:мм""");
	Если Не ПустаяСтрока(НомерЧека) Или НЕ ПустаяСтрока(ДатаВремя) Тогда
		Текст = Текст + ВыстроитьПоля(НомерЧека, ДатаВремя, ШиринаСтроки) + Символы.ПС;
	КонецЕсли;
	
	Текст = Текст + " " + Символы.ПС;
	
	Если ПечатьШтрихкода Тогда
		Текст = Текст + "|ШтрихКод|QR|" + АдресЧека + Символы.ПС;
	КонецЕсли;
	
	Текст = Текст + " " + Символы.ПС;
	
	СтрокаТекста = ПостроитьПолеПереносом(АдресЧека, ШиринаСтроки);
	Для НомерСтроки = 1 По СтрЧислоСтрок(СтрокаТекста) Цикл
		Текст = Текст + СтрПолучитьСтроку(СтрокаТекста, НомерСтроки) + Символы.ПС;
	КонецЦикла;
	
	Текст = Текст + " " + Символы.ПС;
	
	СтрокаТекста = ПостроитьПолеПереносом(ПодписьЧека, ШиринаСтроки);
	Для НомерСтроки = 1 По СтрЧислоСтрок(СтрокаТекста) Цикл
		Текст = Текст + СтрПолучитьСтроку(СтрокаТекста, НомерСтроки) + Символы.ПС;
	КонецЦикла;
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииРаботыСОборудованиемRFID

// Заполняет структуру параметров записи метки RFID.
// 
Функция ПараметрыЗаписиМеткиRFID() Экспорт; 
	
	Результат = Новый Структура();
	Результат.Вставить("TID"       , Неопределено);
	Результат.Вставить("EPC"       , Неопределено);
	Результат.Вставить("Данные"    , Неопределено);
	Результат.Вставить("БанкПамяти", "EPC");
	Возврат Результат;
	
КонецФункции


#КонецОбласти

#Область Прочее

Функция ПреобразоватьДанныеСоСканераВМассив(Параметр) Экспорт	
	
	
	Данные = Новый Массив;
	Данные.Добавить(ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
	
	Возврат Данные;
	
КонецФункции

Функция ПреобразоватьДанныеСоСканераВСтруктуру(Параметр) Экспорт	
	
	Если Параметр[1] = Неопределено Тогда
		Данные = Новый Структура("Штрихкод, Количество", Параметр[0], 1);    // Достаем штрихкод из основных данных
	Иначе
		Данные = Новый Структура("Штрихкод, Количество", Параметр[1][1], 1); // Достаем штрихкод из дополнительных данных
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

#КонецОбласти

#Область КодаВидаНоменклатурнойКлассификации

&НаКлиенте
Процедура НачатьВыборКодаВидаНоменклатурнойКлассификации(ОповещениеПриВыборе) Экспорт
	
	//ПараметрыКоманды = Новый Структура("ОповещениеПриВыборе", ОповещениеПриВыборе);
	//Обработчик = Новый ОписаниеОповещения("НачатьВыборКодаВидаНоменклатурнойКлассификации_Завершение", ЭтотОбъект, ПараметрыКоманды);
	//ОткрытьФорму("ОбщаяФорма.КодВидаНоменклатурнойКлассификации", ,,,  ,, Обработчик, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыборКодаВидаНоменклатурнойКлассификации_Завершение(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
			Если Параметры.ОповещениеПриВыборе <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриВыборе, Результат);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти


#Область ВспомогательныеПроцедурыИФункции

// Выстраивает строку по длине поля, если поле длинное - переносит на следующую строку.
//
Функция ПостроитьПолеПереносом(Знач Текст, Знач ДлинаПоля, ДобСимвол = "", ПоЦентру = Ложь) Экспорт
	
	ДобСимвол = ?(ПустаяСтрока(ДобСимвол), " ", ДобСимвол);
	
	Если СтрДлина(Текст) > ДлинаПоля Тогда 
		ТекстПолный = "";
		Пока СтрДлина(Текст) > ДлинаПоля Цикл
			ТекстПолный = ТекстПолный + ?(ПустаяСтрока(ТекстПолный), "", Символы.ПС) +  Лев(Текст, ДлинаПоля);
			Текст = Сред(Текст, ДлинаПоля + 1);
		КонецЦикла;
		ТекстПолный = ТекстПолный + ?(ПустаяСтрока(Текст), "", Символы.ПС + Текст);
	Иначе
		Если ПоЦентру Тогда
			ТекстПолный = Текст;
			ДобавлятьСправа = Истина; 
			Пока СтрДлина(ТекстПолный) < ДлинаПоля Цикл
				Если ДобавлятьСправа Тогда
					ТекстПолный = ТекстПолный + ДобСимвол;
				Иначе
					ТекстПолный = ДобСимвол + ТекстПолный;
				КонецЕсли;
				ДобавлятьСправа = Не ДобавлятьСправа;
			КонецЦикла;
		Иначе
			ТекстПолный = Текст;
		КонецЕсли;
	КонецЕсли;
		
	Возврат ТекстПолный;
	
КонецФункции

// Обрезает передаваемую строку по длине поля, если поле слишком короткое - дополняет символами.
//
Функция ПостроитьПоле(Знач Текст, Знач ДлинаПоля, ДобСимвол = "", ДобавлятьСправа = Истина) Экспорт
	
	ДобСимвол = ?(ПустаяСтрока(ДобСимвол), " ", ДобСимвол);
	
	ТекстПолный = Лев(Текст, ДлинаПоля);
	Пока СтрДлина(ТекстПолный) < ДлинаПоля Цикл
		Если ДобавлятьСправа Тогда
			ТекстПолный = ТекстПолный + ДобСимвол;
		Иначе
			ТекстПолный = ДобСимвол + ТекстПолный;
		КонецЕсли;
	КонецЦикла;
	          
	Возврат ТекстПолный;
	
КонецФункции

// Формирует строку из двух полей, если передается одно поле дополняет символами до нужного размера.
//
Функция ВыстроитьПоля(Знач Текст1, Знач Текст2 = "", Знач ДлинаПоля) Экспорт
	
	Если ПустаяСтрока(Текст2) Тогда
		ТекстПолный = ПостроитьПоле(Текст1, СтрДлина(Текст1) + Цел((ДлинаПоля - СтрДлина(Текст1))/2), , Ложь);
		ТекстПолный = ПостроитьПоле(ТекстПолный, ДлинаПоля);
	ИначеЕсли СтрДлина(Текст1) + СтрДлина(Текст2) < ДлинаПоля Тогда
		ТекстПолный = ПостроитьПоле(Текст1, ДлинаПоля - СтрДлина(Текст2)) + Текст2;
	Иначе
		ТекстПолный = ПостроитьПоле(Текст1, ДлинаПоля) + Символы.ПС + ПостроитьПоле(Текст2, ДлинаПоля, ,Ложь)
	КонецЕсли;
	
	Возврат ТекстПолный;
	
КонецФункции

//  Выравнить передаваемую строку по длине поля, если поле слишком короткое - дополняет символами.
//
Функция ВыравнитьПоле(Знач Текст, Знач ДлинаПоля = 32, Знач Выравнивание = "Лево", ДобСимвол = "") Экспорт
	
	ДобСимвол = ?(ПустаяСтрока(ДобСимвол), " ", ДобСимвол);
	НачПозиция = Истина;
	ТекстПолный = Лев(Текст, ДлинаПоля);
	Пока СтрДлина(ТекстПолный) < ДлинаПоля Цикл
		Если Выравнивание = "Лево" Тогда
			ТекстПолный = ТекстПолный + ДобСимвол;
		ИначеЕсли Выравнивание = "Право" Тогда
			ТекстПолный = ДобСимвол + ТекстПолный;
		Иначе
			Если НачПозиция Тогда
				ТекстПолный = ТекстПолный + ДобСимвол;
				НачПозиция = Ложь;
			Иначе
				ТекстПолный = ДобСимвол + ТекстПолный;
				НачПозиция = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	          
	Возврат ТекстПолный;
	
КонецФункции

Функция ДобавитьЛидирующиеНули(Знач Строка, Знач ДлиннаСтроки) 
	
	ТекстПолный = Строка;
	Пока СтрДлина(ТекстПолный) < ДлиннаСтроки Цикл
		ТекстПолный = "0" + ТекстПолный;
	КонецЦикла;
	          
	Возврат ТекстПолный;
	
КонецФункции

// Определяет необходимость выполнения серверного события ПослеВыполненияКомандыФискальнымУстройством.
//
Функция ТребуетсяВызовСобытияПослеВыполненияКомандыФискальнымУстройством(Контекст) Экспорт
	
	Если Не КомандыРаботыСоСменами().Найти(Контекст.ВыполняемаяКоманда) = Неопределено Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Возвращает массив команд работы с кассовой сменой.
//
Функция КомандыРаботыСоСменами()
	
	МассивРезультат = Новый Массив();
	//МассивРезультат.Добавить("ReportCurrentStatusOfSettlements");
	МассивРезультат.Добавить("OpenShift");
	МассивРезультат.Добавить("CloseShift");
	
	Возврат МассивРезультат;
	
КонецФункции

// Параметры счетчиков операций.
//
Функция ПараметрыСчетчиковОпераций() Экспорт
	
	СтруктураРезультат = Новый Структура();
	
	СтруктураРезультат.Вставить("КоличествоЧеков");
	СтруктураРезультат.Вставить("СуммаЧеков");
	СтруктураРезультат.Вставить("КоличествоЧековКоррекции");
	СтруктураРезультат.Вставить("СуммаЧековКоррекции");
	
	Возврат СтруктураРезультат;
	
КонецФункции

// Заполняет структуру параметров нормализуемых фискальных данных.
//
Функция ПараметрыНормализуемыхФискальныхДанных() Экспорт
	
	СтруктураРезультат = Новый Структура();
	
	СтруктураРезультат.Вставить("ДатаСменыККТ"     , 0); // Дата открытой/закрытой смены.
	СтруктураРезультат.Вставить("НомерСменыККТ"    , 0); // Номер открытой/закрытой смены.
	СтруктураРезультат.Вставить("НомерЧекаККТ"     , 0); // Номер последнего фискального чека.
	СтруктураРезультат.Вставить("НомерЧекаЗаСмену" , 0); // Номер последнего чека за смену.
	СтруктураРезультат.Вставить("СтатусСмены"      , Неопределено); // Состояние смены: 1-Закрыта, 2-Открыта, 3-Истекла.
	СтруктураРезультат.Вставить("СчетчикиОперацийПриход"        , ПараметрыСчетчиковОпераций()); // Счетчики операций по типу "приход".
	СтруктураРезультат.Вставить("СчетчикиОперацийВозвратПрихода", ПараметрыСчетчиковОпераций()); // Счетчики операций по типу "возврат прихода".
	СтруктураРезультат.Вставить("СчетчикиОперацийРасход"        , ПараметрыСчетчиковОпераций()); // Счетчики операций по типу "расход".
	СтруктураРезультат.Вставить("СчетчикиОперацийВозвратРасхода", ПараметрыСчетчиковОпераций()); // Счетчики операций по типу "возврат расхода".
	СтруктураРезультат.Вставить("КоличествоЧеков"); // Количество кассовых чеков за смену.
	СтруктураРезультат.Вставить("ОстатокНаличных"); // Остаток наличных денежных средств в кассе
	СтруктураРезультат.Вставить("ПревышеноВремяОжиданияОтветаОФД", Ложь);
	СтруктураРезультат.Вставить("КоличествоНепереданныхФД"   , Неопределено); // Количество непереданных документов.
	СтруктураРезультат.Вставить("НомерПервогоНепереданногоФД", Неопределено); // Номер первого непереданного документ. 
	СтруктураРезультат.Вставить("ДатаПервогоНепереданногоФД ", Неопределено); // Дата и время первого из непереданных документов.
	СтруктураРезультат.Вставить("НеобходимаСтрочнаяЗаменаФН" , Ложь); // Признак необходимости срочной замены ФН.
	СтруктураРезультат.Вставить("ПамятьФНПереполнена"        , Ложь); // Признак переполнения памяти ФН.
	СтруктураРезультат.Вставить("РесурсФНИсчерпан"           , Ложь); // Признак исчерпания ресурса ФН.
	
	Возврат СтруктураРезультат;
	
КонецФункции

Функция ТребуетсяЗакрытиеСмены(СтатусСмены) Экспорт
	
	Если СтатусСмены = 0 или СтатусСмены = 1 Тогда // неопределено или закрыта
		Возврат Ложь;
	ИначеЕсли СтатусСмены = 2 или СтатусСмены = 3 Тогда // открыта или истекла
		Возврат Истина;
	Иначе
		ТекстОшибки = НСтр("ru = 'Неизвестный статус смены'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
КонецФункции

#КонецОбласти


#Область НовыйИнтерфейс_ПрофиСофт

&НаКлиенте
Функция ЗапомнитьУстановленныйДрайвер(ДрайверСсылка, ДрайверОбъект) Экспорт
	глПодключаемоеОборудование.ЗагруженныеДрайверы[ДрайверСсылка]=ДрайверОбъект;
КонецФункции //ЗапомнитьУстановленныйДрайвер(ДрайверСсылка,ДрайверОбъект) Экспорт

&НаКлиенте
Функция ЗапомнитьПодключеннноеОборудование(Оборудование, Идентификатор) Экспорт
	глПодключаемоеОборудование.ПодключенноеОборудование.Вставить(Оборудование,Новый Структура("Оборудование,Идентификатор",Оборудование,Идентификатор));
КонецФункции //ЗапомнитьПодключеннноеОборудование(Оборудование,Идентификатор) Экспорт

&НаКлиенте
Функция ПодключитьДрайвер(ДрайверСсылка)	
	РезультатСтруктура	= Новый Структура("Успешно,ДрайверОбъект,Ошибки", Ложь, Неопределено);
	
	Если ДрайверЗагружен(ДрайверСсылка) Тогда
		РезультатСтруктура.Успешно			= Истина;		
		РезультатСтруктура.ДрайверОбъект	= ПолучитьЗагруженныйДрайвер(ДрайверСсылка);	
	Иначе
		Сведения			= ПолучитьРеквизитыШапки(ДрайверСсылка,"ИдентификаторОбъекта,ИмяФайлаДрайвера");		
		ДрайверНавСсылка 	= ПолучитьНавигационнуюСсылку(ДрайверСсылка, "ЗагруженныйДрайвер");
		
		ProgID			 	= Сведения.ИдентификаторОбъекта;
		Части				= СтрРазделить(ProgID,".");	
		ИмяОбъекта			= Части[1];	
		Части.Вставить(1,ИмяОбъекта);		
		
		ProgId_Native	= СтрСоединить(Части,"."); 
		ProgId_COM		= ProgId;
		
		
		Подключено = ПодключитьВнешнююКомпоненту(ДрайверНавСсылка, ИмяОбъекта);
		Если НЕ Подключено Тогда        
			//УстановитьВнешнююКомпоненту(ДрайверНавСсылка);        
			
			//+++++ Лепешкин А.В.
			//Подключено = ПодключитьВнешнююКомпоненту(ДрайверНавСсылка, ИмяОбъекта);
			//Подключено = Ждать ПодключитьВнешнююКомпонентуАсинх(ProgId_COM);
			//----- Лепешкин А.В.
		КонецЕсли;
		
		Если Подключено Тогда
			ДрайверОбъект	= Неопределено;			
			Попытка			
				РезультатСтруктура.ДрайверОбъект	= Новый(ProgId_Native);
				РезультатСтруктура.Успешно			= Истина;
				
				ЗапомнитьУстановленныйДрайвер(ДрайверСсылка, РезультатСтруктура.ДрайверОбъект);
			Исключение
				РезультатСтруктура.Ошибки	= "Не удалось создать объект драйвера: """+ProgId_Native+"""";			
			КонецПопытки;		
		Иначе //А может это дворник был......
			Подключено = ПодключитьВнешнююКомпоненту(ProgId_COM);
			Если Подключено Тогда
				Попытка			
					РезультатСтруктура.ДрайверОбъект	= Новый(ProgId_COM);
					РезультатСтруктура.Успешно			= Истина;
				
					ЗапомнитьУстановленныйДрайвер(ДрайверСсылка, РезультатСтруктура.ДрайверОбъект);
				Исключение
					РезультатСтруктура.Ошибки	= "Не удалось создать объект драйвера: """+ProgId_COM+"""";			
				КонецПопытки;			
			Иначе
				РезультатСтруктура.Ошибки	= "Не удалось подключить внешнюю компоненту: """+ДрайверСсылка+""" !";				
			КонецЕсли;		
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатСтруктура;	
КонецФункции //ПодключитьДрайверТО(ДрайверСсылка)

&НаКлиенте
Функция ДрайверЗагружен(ДрайверСсылка) Экспорт
	Возврат ПолучитьЗагруженныйДрайвер(ДрайверСсылка)<>Неопределено; 
КонецФункции //ДрайверЗагружен(ДрайверСсылка)

&НаКлиенте
Функция ОборудованиеПодключено(Оборудование) Экспорт
	Возврат ПолучитьПодключенноеОборудование(Оборудование)<>Неопределено; 
КонецФункции //ДрайверЗагружен(ДрайверСсылка)

&НаКлиенте
Функция ИдентификаторПодключенногоОборудования(Оборудование) Экспорт
	ПодключенноеОборудование=ПолучитьПодключенноеОборудование(Оборудование);
	
	Идентификатор="";
	Если ПодключенноеОборудование<>Неопределено Тогда
		Идентификатор=ПодключенноеОборудование.Идентификатор;	
	КонецЕсли;
	
	Возврат Идентификатор; 
КонецФункции //ИдентификаторПодключенногоОборудования(Оборудование) Экспорт

&НаКлиенте
Функция ПолучитьЗагруженныйДрайвер(ДрайверСсылка) Экспорт
	Если глПодключаемоеОборудование = Неопределено Тогда
		глПодключаемоеОборудование = Новый Структура;	
	КонецЕсли; 
	
	ЗагруженныеДрайверы = ПолучитьЗначениеПараметра(глПодключаемоеОборудование, "ЗагруженныеДрайверы");
	Если ЗагруженныеДрайверы = Неопределено Тогда
		глПодключаемоеОборудование.Вставить("ЗагруженныеДрайверы", Новый Соответствие);			
	КонецЕсли; 
	
	Возврат глПодключаемоеОборудование.ЗагруженныеДрайверы[ДрайверСсылка];
КонецФункции // () 

&НаКлиенте
Функция ПолучитьПодключенноеОборудование(Оборудование) Экспорт
	Если глПодключаемоеОборудование = Неопределено Тогда
		глПодключаемоеОборудование = Новый Структура;	
	КонецЕсли;
	
	ПодключенноеОборудование = МаркировкаКС.ПолучитьЗначениеПараметра(глПодключаемоеОборудование, "ПодключенноеОборудование");
	Если ПодключенноеОборудование = Неопределено Тогда	
		ПодключенноеОборудование = Новый Соответствие;
		глПодключаемоеОборудование.Вставить("ПодключенноеОборудование", ПодключенноеОборудование);		
	КонецЕсли;	
	
	Возврат глПодключаемоеОборудование.ПодключенноеОборудование[Оборудование];
КонецФункции //ПолучитьПодключенноеОборудование(Оборудование) Экспорт

&НаКлиенте
Функция ПолучитьОбъектДрайвера(Оборудование) Экспорт
	ДрайверСсылка	= ПолучитьРеквизитОбъекта(Оборудование, "ДрайверОборудования");
	Возврат  ПолучитьЗагруженныйДрайвер(ДрайверСсылка);
КонецФункции //ПолучитьОбъектДрайвера(Оборудование) Экспорт
 

Функция ОписаниеИзДрайвера(ДрайверОбъект) Экспорт
	РевизияИнтерфейса = 0;
	
	НомерВерсии		= "";
	НомерВерсииИнтеграционногоКомпонента = "";
	Наименование	= "";
	Описание		= "";
	ТипОборудования = "";
	РевизияИнтерфейса = 0;
	ИнтеграционныйКомпонент = Ложь;	
	ОсновнойДрайверУстановлен = Ложь;	
	URLCкачивания	= "";
	
	Попытка		
		//Версии 3003,3002,3001
		
		
		РевизияИнтерфейса = ДрайверОбъект.ПолучитьРевизиюИнтерфейса();			
		
		Если РевизияИнтерфейса=0 Тогда
			Описание = "";
			ДрайверОбъект.ПолучитьОписание(Описание);		
		КонецЕсли; 		

	Исключение			
		Ошибки="";
		ДрайверОбъект.ПолучитьОшибку(Ошибки);
	КонецПопытки;	
	
	Если НЕ ЗначениеЗаполнено(РевизияИнтерфейса) Тогда
		//Не получилось.....видимо версии 2005,2004,2003,2002		
		Попытка
			ДрайверОбъект.ПолучитьОписание(Наименование,Описание,ТипОборудования,РевизияИнтерфейса,ИнтеграционныйКомпонент,ОсновнойДрайверУстановлен,URLCкачивания);
			НомерВерсии	= ДрайверОбъект.ПолучитьНомерВерсии();
		Исключение
			Ошибки="";
			Сообщить(ДрайверОбъект.ПолучитьОшибку(Ошибки));
			Сообщить(Ошибки);
		КонецПопытки;	
	КонецЕсли;
	
	Результат=Новый Структура("РевизияИнтерфейса,НомерВерсии,НомерВерсииИнтеграционногоКомпонента,
		|Наименование,Описание,ТипОборудования,ИнтеграционныйКомпонент,ОсновнойДрайверУстановлен,URLCкачивания",
		РевизияИнтерфейса,НомерВерсии,НомерВерсииИнтеграционногоКомпонента,Наименование,Описание,ТипОборудования,ИнтеграционныйКомпонент,ОсновнойДрайверУстановлен,URLCкачивания);
		
	Если РевизияИнтерфейса>=3000 Тогда
		ОписаниеXML	= "";
		ДрайверОбъект.ПолучитьОписание(ОписаниеXML);					
		
		Поля		= ПолучитьОписаниеДрайвераИзXML(ОписаниеXML);
		ЗаполнитьЗначенияСвойств(Результат,Поля);		
	КонецЕсли;	
	
	ПараметрыДрайвера="";	
	ДрайверОбъект.ПолучитьПараметры(ПараметрыДрайвера);
	
	ДополнительныеДействия="";
	ДрайверОбъект.ПолучитьДополнительныеДействия(ДополнительныеДействия);
	
	Результат.Вставить("ПараметрыДрайвера",			ПараметрыДрайвера);
	Результат.Вставить("ДополнительныеДействия",	ДополнительныеДействия);
		
	Возврат Результат;	
КонецФункции // ()

// Получить описание драйвера из XML пакета.
//
Функция ПолучитьОписаниеДрайвераИзXML(ОписаниеXML) Экспорт
	
	Возврат Справочники.ДрайверыОборудования.ПолучитьОписаниеДрайвераИзXML(ОписаниеXML);
	
	
КонецФункции

Функция ПодключитьДрайверТО(ДрайверОборудования, ПолучитьОписание = Ложь) Экспорт
	
	РезультатПодключения = ПодключитьДрайвер(ДрайверОборудования);	
		
	Если РезультатПодключения.Успешно И ПолучитьОписание Тогда
		РезультатПодключения.Вставить("Описание",ОписаниеИзДрайвера(РезультатПодключения.ДрайверОбъект));	
	КонецЕсли;	
	
	Возврат РезультатПодключения;		
КонецФункции

Функция ТестУстройства(Оборудование) Экспорт	  
КонецФункции // ()

Функция ПодключитьОборудование(Оборудование) Экспорт	
	Результат				= Новый Структура("Успешно,Идентификатор,Ошибки",Ложь,"");
	
	Если ОборудованиеПодключено(Оборудование) Тогда
		Результат.Успешно	= Истина;
		Идентификатор		= ИдентификаторПодключенногоОборудования(Оборудование);		
	Иначе		
		ПараметрыОборудования	= ПолучитьПараметрыУстройства(Оборудование, ИмяКомпьютера());
		ДрайверОборудования		= ПолучитьРеквизитШапки(Оборудование, "ДрайверОборудования");	
		
		РезультатПодключения	= ПодключитьДрайверТО(ДрайверОборудования);
		Если РезультатПодключения.Успешно Тогда		
			ДрайверОбъект	= РезультатПодключения.ДрайверОбъект;		
			
			УстановитьПараметрыУстройства(ДрайверОбъект,ПараметрыОборудования);
			
			//ДрайверОбъект.УстановитьПараметр("EquipmentType", "СканерШтрихкода");		
			
			Идентификатор	= "";		// Acquiring_3001#1
			
			Если ДрайверОбъект.Подключить(Идентификатор) Тогда			
				ЗапомнитьПодключеннноеОборудование(Оборудование, Идентификатор);
				
				Результат.Успешно			= Истина;
				Результат.Идентификатор     = Идентификатор;
			Иначе			
				Ошибки				= "";
				ДрайверОбъект.ПолучитьОшибку(Ошибки);
				Результат.Ошибки	= Ошибки; 
			КонецЕсли;
		Иначе
			Результат.Ошибки	= "Не удалось загрузить драйвер ТО ! "+РезультатПодключения.Ошибки;			
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ПодключитьОборудование(Оборудование) Экспорт

Функция УстановитьПараметрыУстройства(ДрайверОбъект,Параметры) Экспорт
	Для Каждого Элемент Из Параметры Цикл
		ВремКлюч	= Элемент.Ключ; //
		ВремЗнач	= Элемент.Значение;
				
		ДрайверОбъект.УстановитьПараметр(ВремКлюч, ВремЗнач);
	КонецЦикла;
КонецФункции // ()
 
Функция РевизияИнтерфейса(Оборудование) Экспорт
	Результат	= 0;
	
	Если ОборудованиеПодключено(Оборудование) Тогда
		//ДрайверСсылка	= ПолучитьРеквизитШапки(Оборудование,	"ДрайверОборудования");		
		//Результат		= ПолучитьРеквизитШапки(ДрайверСсылка,	"РевизияИнтерфейса");
		
		Результат		= 3003;
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //РевизияИнтерфейса(Оборудование)
 
Функция ПроверитьПодключитьОборудование(Оборудование) Экспорт
	Результат	= Новый Структура("Успешно,Ошибки", Ложь, "");	
	
	Если ОборудованиеПодключено(Оборудование) Тогда 
		Результат.Успешно = Истина;		
	Иначе		
		рПодключения	= ПодключитьОборудование(Оборудование);
		Если НЕ рПодключения.Успешно Тогда
			Результат.Ошибки = "Ошибка при подключении ТО ! "+рПодключения.Ошибки;
		Иначе              
			Результат.Успешно = Истина;			
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПроверитьПодключитьОборудование(Оборудование) Экспорт

Функция ПолучитьПараметрыККТ(Оборудование) Экспорт
	Результат	= Новый Структура("Успешно,Ошибки",Ложь,"");	
	
	РезультатПодключения	= ПроверитьПодключитьОборудование(Оборудование);
	Если НЕ РезультатПодключения.Успешно Тогда
		Результат.Ошибки=РезультатПодключения.Ошибки;
		Возврат Результат;
	КонецЕсли;
	
	ВходныеПараметры = Новый Структура("Кассир,КассирИНН,АдресРасчетов,МестоРасчетов","Администратор");
	
	Кассир			= ВходныеПараметры.Кассир;
	КассирИНН		= ВходныеПараметры.КассирИНН;
	
	Если НЕ ПроверитьИННКассира(КассирИНН,Результат.Ошибки) Тогда
		Возврат Результат;	
	КонецЕсли; 
	
	НомерСмены     	= 0;
	НомерДокумента 	= 0;
	СтатусСмены		= 0;
	ПараметрыСмены	= Неопределено;	
	
		
	РевизияИнтерфейса	= РевизияИнтерфейса(Оборудование);
	ОбъектДрайвера		= ПолучитьОбъектДрайвера(Оборудование);		
	
	ПроверитьДемоРежим(ОбъектДрайвера);
	
	ИДУстройства		= ИдентификаторПодключенногоОборудования(Оборудование);
	
	// Получить параметры ККТ при открытии смены.
	ПараметрыККТ = "";
	Попытка		
		Если НЕ ОбъектДрайвера.ПолучитьПараметрыККТ(ИДУстройства, ПараметрыККТ) Тогда
			ОписаниеОшибки = "";
			ОбъектДрайвера.ПолучитьОшибку(ОписаниеОшибки); 
			Результат.Ошибки	= "Ошибка результата метода <ОбъектДрайвера.ПолучитьПараметрыККТ>. " + Символы.ПС + ОписаниеОшибки;
			Возврат Результат;
		КонецЕсли;
	Исключение		
		Результат.Ошибки	= НСтр("ru='Ошибка вызова метода <ОбъектДрайвера.ПолучитьПараметрыККТ>.'") + Символы.ПС + ОписаниеОшибки();
		Возврат Результат;
	КонецПопытки;
	
	ПараметрыККТ = ПараметрыККТИзXMLПакета(ПараметрыККТ, РевизияИнтерфейса);
	
	Вход 	= ВходныеПараметрыXML(ВходныеПараметры, РевизияИнтерфейса);
	Выход   = "";	
	
	Попытка
		
		Если РевизияИнтерфейса >= 3000 Тогда // Версия стандарта 3.0 (ОФД 1.1)
			РезультатДрайвера = ОбъектДрайвера.ПолучитьТекущееСостояние(ИДУстройства, Вход, Выход); 
			Если РезультатДрайвера Тогда
				ПараметрыСмены		= ПолучитьПараметрыСменыИзXMLПакета(Выход,РевизияИнтерфейса);				
				СтатусСмены			= ПараметрыСмены.СтатусСмены;
				Результат.Успешно   = Истина;
			Иначе
				Ошибка	= "";
				ОбъектДрайвера.ПолучитьОшибку(Ошибка);
			КонецЕсли;
		Иначе
			Если РевизияИнтерфейса >= 2002 Тогда // Версия стандарта 2.2 (ОФД 1.0.5)
				ОбъектДрайвера.ПолучитьТекущееСостояние(ИДУстройства,НомерДокумента,НомерСмены,СтатусСмены,Выход);
				ПараметрыСмены = ПолучитьПараметрыСменыИзXMLПакета(Выход, РевизияИнтерфейса);
			Иначе				
				Результат.Ошибки = "Недопустимая ревизия интерфейса: """+РевизияИнтерфейса+""" !";
			КонецЕсли;
		КонецЕсли;
		
	Исключение
		
		Результат.Ошибки=НСтр("ru='Ошибка вызова метода <ОбъектДрайвера.ОткрытьСмену>.'") + Символы.ПС + ОписаниеОшибки();			
		
	КонецПопытки;
	
	
	Если Результат.Успешно Тогда
		// Заполнение выходных параметров.
		ВыходныеПараметры=Новый Структура();
		
		
		ВыходныеПараметры.Вставить("НомерСмены",			НомерСмены);
		ВыходныеПараметры.Вставить("НомерДокумента",		НомерДокумента);
		ВыходныеПараметры.Вставить("СтатусСмены",			СтатусСмены); // 1- закрыта, 2 - Открыта, 3 - просрочена
		ВыходныеПараметры.Вставить("ДатаСеанса",			ТекущаяДата());
		
		ВыходныеПараметры.Вставить("ПараметрыСмены",		ПараметрыСмены);
		ВыходныеПараметры.Вставить("ПараметрыККТ",			ПараметрыККТ);
		ВыходныеПараметры.Вставить("ПараметрыСостояния",	Выход);		
		ВыходныеПараметры.Вставить("ОбъектДрайвера",		ОбъектДрайвера);
		
		Результат.Успешно	= Истина;
		Результат.Вставить("Данные",ВыходныеПараметры);
	Иначе		
		Ошибки	= "";
		ОбъектДрайвера.ПолучитьОшибку(Ошибки);
		
		Результат.Ошибки	= СокрЛП(Результат.Ошибки+" "+Ошибки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьДемоРежим(ОбъектДрайвера) Экспорт
	ОписаниеРезультата		= "";
	АктивированДемоРежим	= "";
	РезультатТеста = ОбъектДрайвера.ТестУстройства(ОписаниеРезультата, АктивированДемоРежим);
	Если РезультатТеста И Не ПустаяСтрока(АктивированДемоРежим) Тогда
		Сообщить(АктивированДемоРежим);
	КонецЕсли;
КонецФункции // ()

Функция ВходныеПараметрыXML(ОбщиеПараметры, РевизияИнтерфейса = 0) Экспорт
	ПараметрыПоУмолчанию	= Новый Структура("Кассир,КассирИНН","Администратор","");
	
	Кассир			= ПолучитьПараметр(ОбщиеПараметры,"Кассир",			ПараметрыПоУмолчанию);
	КассирИНН		= ПолучитьПараметр(ОбщиеПараметры,"КассирИНН",		ПараметрыПоУмолчанию);	
	АдресРасчетов   = ПолучитьПараметр(ОбщиеПараметры,"АдресРасчетов",	ПараметрыПоУмолчанию);
	МестоРасчетов   = ПолучитьПараметр(ОбщиеПараметры,"МестоРасчетов",	ПараметрыПоУмолчанию);
	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("InputParameters");
	ЗаписьXML.ЗаписатьНачалоЭлемента("Parameters");
	
	Если РевизияИнтерфейса >= 3000 Тогда  // Версия стандарта 3.0 (ОФД 1.1)
		ЗаписьXML.ЗаписатьАтрибут("CashierName", Кассир);
		ЗаписьXML.ЗаписатьАтрибут("CashierINN" , КассирИНН);
		Если ЗначениеЗаполнено(АдресРасчетов) Тогда   
			ЗаписьXML.ЗаписатьАтрибут("SaleAddress", АдресРасчетов);
		КонецЕсли;
		Если ЗначениеЗаполнено("МестоРасчетов") Тогда  
			ЗаписьXML.ЗаписатьАтрибут("SaleLocation", МестоРасчетов);
		КонецЕсли;
	Иначе
		ЗаписьXML.ЗаписатьАтрибут("CashierName" , Кассир);
		ЗаписьXML.ЗаписатьАтрибут("CashierVATIN", КассирИНН);
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

Функция ПолучитьПараметр(Параметры, Имя, ЗначенияПоУмолчанию)
	ТекЗнач	= Неопределено;
	Параметры.Свойство(Имя,ТекЗнач);
	Если НЕ ЗначениеЗаполнено(ТекЗнач) Тогда
		ЗначенияПоУмолчанию.Свойство(Имя,ТекЗнач);		
	КонецЕсли; 
	
	//Возврат XMLСтрока(ТекЗнач); ?????? TODO проверить зачем XMLСтрока 
	//пока заменил т.к. не работает в web клиенте
	Возврат Строка(ТекЗнач);
КонецФункции // ()


#КонецОбласти 


Функция ПараметрыККТИзXMLПакета(Данные, РевизияИнтерфейса = 0) Экспорт
	
	ЧтениеXML = Новый ЧтениеXML; 
	ЧтениеXML.УстановитьСтроку(Данные);
	ЧтениеXML.ПерейтиКСодержимому();
	
	ПараметрыККТ = ПараметрыРегистрацииККТ();
	ПараметрыККТ.Вставить("ТипОборудования", "ККТ");
	
	Если РевизияИнтерфейса >= 3000 Тогда  // Версия стандарта 3.0 (ОФД 1.1)
		
		Если (ЧтениеXML.Имя = "Parameters" Или ЧтениеXML.Имя = "TableParametersKKT") И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
			ПараметрыККТ.ВерсияФФДФН   = ЧтениеXML.ЗначениеАтрибута("FFDVersionFN");
			Если ПустаяСтрока(ПараметрыККТ.ВерсияФФДФН) Тогда
				ПараметрыККТ.ВерсияФФДФН = "1.0";
			КонецЕсли;
			ПараметрыККТ.ВерсияФФДККТ  = ЧтениеXML.ЗначениеАтрибута("FFDVersionKKT");
			Если ПустаяСтрока(ПараметрыККТ.ВерсияФФДККТ) Тогда
				ПараметрыККТ.ВерсияФФДККТ = "1.0";
			КонецЕсли;
			// ФФД 1.0
			ПараметрыККТ.РегистрационныйНомерККТ    = СокрЛП(ЧтениеXML.ЗначениеАтрибута("KKTNumber"));
			ПараметрыККТ.ЗаводскойНомерККТ          = СокрЛП(ЧтениеXML.ЗначениеАтрибута("KKTSerialNumber"));
			ПараметрыККТ.ЗаводскойНомерФН           = СокрЛП(ЧтениеXML.ЗначениеАтрибута("FNSerialNumber"));
			ПараметрыККТ.ОрганизацияНазвание        = ЧтениеXML.ЗначениеАтрибута("CompanyName");
			ПараметрыККТ.ОрганизацияИНН             = СокрЛП(ЧтениеXML.ЗначениеАтрибута("INN"));
			ПараметрыККТ.АдресПроведенияРасчетов    = ЧтениеXML.ЗначениеАтрибута("SaleAddress");
			ПараметрыККТ.МестоПроведенияРасчетов    = ЧтениеXML.ЗначениеАтрибута("SaleLocation");
			ПараметрыККТ.КодыСистемыНалогообложения = ЧтениеXML.ЗначениеАтрибута("TaxationSystems");
			ПараметрыККТ.ПризнакАвтономногоРежима   = ВРег(ЧтениеXML.ЗначениеАтрибута("IsOffline")) = "TRUE";
			ПараметрыККТ.ПризнакШифрованиеДанных    = ВРег(ЧтениеXML.ЗначениеАтрибута("IsEncrypted")) = "TRUE";
			ПараметрыККТ.ПризнакРасчетовЗаУслуги    = ВРег(ЧтениеXML.ЗначениеАтрибута("IsService")) = "TRUE";
			ПараметрыККТ.ПродажаПодакцизногоТовара  = ВРег(ЧтениеXML.ЗначениеАтрибута("IsExcisable")) = "TRUE";
			ПараметрыККТ.ПроведенияАзартныхИгр      = ВРег(ЧтениеXML.ЗначениеАтрибута("IsGambling")) = "TRUE";
			ПараметрыККТ.ПроведенияЛотерей          = ВРег(ЧтениеXML.ЗначениеАтрибута("IsLottery")) = "TRUE";
			ПараметрыККТ.ПризнакиАгента             = ЧтениеXML.ЗначениеАтрибута("AgentTypes");
			ПараметрыККТ.ПризнакФормированияБСО         = ВРег(ЧтениеXML.ЗначениеАтрибута("BSOSing")) = "TRUE";
			ПараметрыККТ.ПризнакРасчетовТолькоВИнтернет = ВРег(ЧтениеXML.ЗначениеАтрибута("IsOnlineOnly")) = "TRUE";
			ПараметрыККТ.УстановкаПринтераВАвтомате     = ВРег(ЧтениеXML.ЗначениеАтрибута("IsAutomaticPrinter")) = "TRUE";;
			ПараметрыККТ.ПризнакАвтоматическогоРежима   = ВРег(ЧтениеXML.ЗначениеАтрибута("IsAutomatic")) = "TRUE";
			ПараметрыККТ.НомерАвтоматаДляАвтоматическогоРежима = ЧтениеXML.ЗначениеАтрибута("AutomaticNumber");
			ПараметрыККТ.ОрганизацияОФДНазвание     = ЧтениеXML.ЗначениеАтрибута("OFDCompany");
			ПараметрыККТ.ОрганизацияОФДИНН          = СокрЛП(ЧтениеXML.ЗначениеАтрибута("OFDCompanyINN"));
			ПараметрыККТ.ПризнакФискализации        = ВРег(ЧтениеXML.ЗначениеАтрибута("Fiscal")) = "TRUE";
			ПараметрыККТ.НомерДокументаФискализации = ЧтениеXML.ЗначениеАтрибута("DocumentNumber");
			ПараметрыККТ.ДатаВремяФискализации      = ЧтениеXML.ЗначениеАтрибута("DateTime");
			ПараметрыККТ.ОтправительEmail           = ЧтениеXML.ЗначениеАтрибута("SenderEmail");
			ПараметрыККТ.АдресСайтаФНС              = ЧтениеXML.ЗначениеАтрибута("FNSURL");
		КонецЕсли;
		
	Иначе
		
		Если ЧтениеXML.Имя = "Parameters" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
			ПараметрыККТ.ВерсияФФДФН   = ЧтениеXML.ЗначениеАтрибута("FFDVersionFN");
			Если ПустаяСтрока(ПараметрыККТ.ВерсияФФДФН) Тогда
				ПараметрыККТ.ВерсияФФДФН = "1.0";
			КонецЕсли;
			ПараметрыККТ.ВерсияФФДККТ  = ЧтениеXML.ЗначениеАтрибута("FFDVersionKKT");
			Если ПустаяСтрока(ПараметрыККТ.ВерсияФФДККТ) Тогда
				ПараметрыККТ.ВерсияФФДККТ = "1.0";
			КонецЕсли;
			// ФФД 1.0
			ПараметрыККТ.РегистрационныйНомерККТ        = СокрЛП(ЧтениеXML.ЗначениеАтрибута("KKTNumber"));
			ПараметрыККТ.ОрганизацияНазвание            = ЧтениеXML.ЗначениеАтрибута("OrganizationName");
			ПараметрыККТ.ОрганизацияИНН                 = СокрЛП(ЧтениеXML.ЗначениеАтрибута("VATIN"));
			ПараметрыККТ.АдресПроведенияРасчетов        = ЧтениеXML.ЗначениеАтрибута("AddressSettle");
			ПараметрыККТ.МестоПроведенияРасчетов        = ЧтениеXML.ЗначениеАтрибута("PlaceSettle");
			ПараметрыККТ.КодыСистемыНалогообложения     = ЧтениеXML.ЗначениеАтрибута("TaxVariant");
			Если ПустаяСтрока(ПараметрыККТ.КодыСистемыНалогообложения) Тогда
				ПараметрыККТ.КодыСистемыНалогообложения = ЧтениеXML.ЗначениеАтрибута("TaxVarinat");
			КонецЕсли;
			ПараметрыККТ.ПризнакАвтономногоРежима	       		= ВРег(ЧтениеXML.ЗначениеАтрибута("OfflineMode")) = "TRUE";
			ПараметрыККТ.ПризнакАвтоматическогоРежима   		= ВРег(ЧтениеXML.ЗначениеАтрибута("AutomaticMode")) = "TRUE";
			ПараметрыККТ.НомерАвтоматаДляАвтоматическогоРежима = ЧтениеXML.ЗначениеАтрибута("AutomaticNumber");
			ПараметрыККТ.ПризнакФормированияБСО         		= ВРег(ЧтениеXML.ЗначениеАтрибута("BSOSing")) = "TRUE";
			ПараметрыККТ.ПризнакРасчетовТолькоВИнтернет 		= ВРег(ЧтениеXML.ЗначениеАтрибута("CalcOnlineSign")) = "TRUE";
			ПараметрыККТ.ПризнакШифрованиеДанных       		= ВРег(ЧтениеXML.ЗначениеАтрибута("DataEncryption")) = "TRUE";
			ПараметрыККТ.ОрганизацияОФДИНН          			= СокрЛП(ЧтениеXML.ЗначениеАтрибута("OFDVATIN"));
			ПараметрыККТ.ОрганизацияОФДНазвание     			= ЧтениеXML.ЗначениеАтрибута("OFDOrganizationName");
			ПараметрыККТ.ЗаводскойНомерККТ          			= СокрЛП(ЧтениеXML.ЗначениеАтрибута("KKTSerialNumber"));
			ПараметрыККТ.ПризнакФискализации        			= ВРег(ЧтениеXML.ЗначениеАтрибута("Fiscal")) = "TRUE";
			ПараметрыККТ.ЗаводскойНомерФН           			= СокрЛП(ЧтениеXML.ЗначениеАтрибута("FNSerialNumber"));
			ПараметрыККТ.НомерДокументаФискализации 			= ЧтениеXML.ЗначениеАтрибута("DocumentNumber");
			ПараметрыККТ.ДатаВремяФискализации      			= ЧтениеXML.ЗначениеАтрибута("DateTime");
			ПараметрыККТ.ПризнакРасчетовЗаУслуги		   		= ВРег(ЧтениеXML.ЗначениеАтрибута("ServiceSign")) = "TRUE";
			ПараметрыККТ.ПродажаПодакцизногоТовара  			= ВРег(ЧтениеXML.ЗначениеАтрибута("SaleExcisableGoods")) = "TRUE";
			ПараметрыККТ.ПроведенияАзартныхИгр		    		= ВРег(ЧтениеXML.ЗначениеАтрибута("SignOfGambling")) = "TRUE";
			ПараметрыККТ.ПроведенияЛотерей         			= ВРег(ЧтениеXML.ЗначениеАтрибута("SignOfLottery")) = "TRUE";
			ПараметрыККТ.ПризнакиАгента             			= ЧтениеXML.ЗначениеАтрибута("SignOfAgent");
			ПараметрыККТ.УстановкаПринтераВАвтомате 			= ВРег(ЧтениеXML.ЗначениеАтрибута("PrinterAutomatic")) = "TRUE";;
			ПараметрыККТ.ОтправительEmail           			= ЧтениеXML.ЗначениеАтрибута("SenderEmail");
			ПараметрыККТ.АдресСайтаФНС              			= ЧтениеXML.ЗначениеАтрибута("FNSWebSite");
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат ПараметрыККТ;
	
КонецФункции

Функция ИННСоответствуетТребованиям(Знач ИНН, ЭтоЮридическоеЛицо, ТекстСообщения) Экспорт
	
	СоответствуетТребованиям = Истина;
	ТекстСообщения = "";
	
	ИНН      = СокрЛП(ИНН);
	ДлинаИНН = СтрДлина(ИНН);
	
	Если ЭтоЮридическоеЛицо = Неопределено Тогда
		ТекстСообщения = ТекстСообщения + НСтр("ru = 'Не определен тип владельца ИНН'");
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ОценкаПроизводительности.ТолькоЦифрыВСтроке(ИНН) Тогда
		СоответствуетТребованиям = Ложь;
		ТекстСообщения = ТекстСообщения + НСтр("ru = 'ИНН должен состоять только из цифр'");
	КонецЕсли;
	
	Если  ЭтоЮридическоеЛицо И ДлинаИНН <> 10 Тогда
		СоответствуетТребованиям = Ложь;
		ТекстСообщения = ТекстСообщения + ?(ЗначениеЗаполнено(ТекстСообщения), Символы.ПС, "")
			+ НСтр("ru = 'ИНН юридического лица должен состоять из 10 цифр'");
	ИначеЕсли НЕ ЭтоЮридическоеЛицо И ДлинаИНН <> 12 Тогда
		СоответствуетТребованиям = Ложь;
		ТекстСообщения = ТекстСообщения + ?(ЗначениеЗаполнено(ТекстСообщения), Символы.ПС, "")
			+ НСтр("ru = 'ИНН физического лица должен состоять из 12 цифр'");
	КонецЕсли;
	
	Если СоответствуетТребованиям Тогда
		Если ЭтоЮридическоеЛицо Тогда
			КонтрольнаяСумма = 0;
			Для Индекс = 1 По 9 Цикл
				Если Индекс = 1 Тогда
					Множитель = 2;
				ИначеЕсли Индекс = 2 Тогда
					Множитель = 4;
				ИначеЕсли Индекс = 3 Тогда
					Множитель = 10;
				ИначеЕсли Индекс = 4 Тогда
					Множитель = 3;
				ИначеЕсли Индекс = 5 Тогда
					Множитель = 5;
				ИначеЕсли Индекс = 6 Тогда
					Множитель = 9;
				ИначеЕсли Индекс = 7 Тогда
					Множитель = 4;
				ИначеЕсли Индекс = 8 Тогда
					Множитель = 6;
				ИначеЕсли Индекс = 9 Тогда
					Множитель = 8;
				КонецЕсли;
				Цифра = Число(Сред(ИНН, Индекс, 1));
				КонтрольнаяСумма = КонтрольнаяСумма + Цифра * Множитель;
			КонецЦикла;
			
			КонтрольныйРазряд = (КонтрольнаяСумма %11) %10;
			Если КонтрольныйРазряд <> Число(Сред(ИНН, 10, 1)) Тогда
				СоответствуетТребованиям = Ложь;
				ТекстСообщения = ТекстСообщения + ?(ЗначениеЗаполнено(ТекстСообщения), Символы.ПС, "")
				               + НСтр("ru = 'Контрольное число для ИНН не совпадает с рассчитанным'");
			КонецЕсли;
		Иначе
			КонтрольнаяСумма11 = 0;
			КонтрольнаяСумма12 = 0;
			Для Индекс = 1 По 11 Цикл
				// Расчет множителя для 11-го и 12-го разрядов.
				Если Индекс = 1 Тогда
					Множитель11 = 7;
					Множитель12 = 3;
				ИначеЕсли Индекс = 2 Тогда
					Множитель11 = 2;
					Множитель12 = 7;
				ИначеЕсли Индекс = 3 Тогда
					Множитель11 = 4;
					Множитель12 = 2;
				ИначеЕсли Индекс = 4 Тогда
					Множитель11 = 10;
					Множитель12 = 4;
				ИначеЕсли Индекс = 5 Тогда
					Множитель11 = 3;
					Множитель12 = 10;
				ИначеЕсли Индекс = 6 Тогда
					Множитель11 = 5;
					Множитель12 = 3;
				ИначеЕсли Индекс = 7 Тогда
					Множитель11 = 9;
					Множитель12 = 5;
				ИначеЕсли Индекс = 8 Тогда
					Множитель11 = 4;
					Множитель12 = 9;
				ИначеЕсли Индекс = 9 Тогда
					Множитель11 = 6;
					Множитель12 = 4;
				ИначеЕсли Индекс = 10 Тогда
					Множитель11 = 8;
					Множитель12 = 6;
				ИначеЕсли Индекс = 11 Тогда
					Множитель11 = 0;
					Множитель12 = 8;
				КонецЕсли;
				
				Цифра = Число(Сред(ИНН, Индекс, 1));
				КонтрольнаяСумма11 = КонтрольнаяСумма11 + Цифра * Множитель11;
				КонтрольнаяСумма12 = КонтрольнаяСумма12 + Цифра * Множитель12;
				
			КонецЦикла;
			
			КонтрольныйРазряд11 = (КонтрольнаяСумма11 %11) %10;
			КонтрольныйРазряд12 = (КонтрольнаяСумма12 %11) %10;
			
			Если КонтрольныйРазряд11 <> Число(Сред(ИНН,11,1)) ИЛИ КонтрольныйРазряд12 <> Число(Сред(ИНН,12,1)) Тогда
				СоответствуетТребованиям = Ложь;
				ТекстСообщения = ТекстСообщения + ?(ЗначениеЗаполнено(ТекстСообщения), Символы.ПС, "")
				               + НСтр("ru = 'Контрольное число для ИНН не совпадает с рассчитанным'");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СоответствуетТребованиям;
	
КонецФункции 


#Область ШлюзВызовСервера

// Функция возвращает по идентификатору устройства его параметры.
//
Функция ПолучитьПараметрыУстройства(Оборудование, ИмяКомпьютера) Экспорт
	
	Возврат Справочники.ТорговоеОборудование.ПолучитьПараметрыУстройства(Оборудование, ИмяКомпьютера);
	
КонецФункции

// Функция возвращает из переменной сеанса имя компьютера клиента.
//
Функция ПолучитьРабочееМестоКлиента() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	Возврат ПараметрыСеанса.РабочееМестоКлиента;

КонецФункции

// Функция возвращает список рабочих мест, соответствующих указанному имени компьютера.
//
Функция НайтиРабочиеМестаПоИД(ИдентификаторКлиента) Экспорт	
	
	Возврат Справочники.РабочиеМеста.НайтиПоИД(ИдентификаторКлиента);	
	
КонецФункции

// Получает ревизию требований для драйверов подключаемого оборудования.
//
Функция РевизияИнтерфейсаДрайверов() Экспорт
	
	РевизияИнтерфейса = 3003;
	Возврат РевизияИнтерфейса;
	
КонецФункции

// Функция возвращает список подключенного в справочнике ПО
//
//  Параметры:
// 	ТипыПО - Неопределено - Описание
// 	Идентификатор - Неопределено - Описание
// 	РабочееМесто - Неопределено - Описание
// Возвращаемое значение:
// 	Массив из Структура - Описание:
// 	* Наименование - Строка - .
Функция ОборудованиеПоПараметрам(ТипыПО = Неопределено, Идентификатор = Неопределено,
	РабочееМесто = Неопределено, ТолькоАвтоматическаяФискализация = Ложь) Экспорт
	
	Возврат Справочники.ПодключаемоеОборудование.ОборудованиеПоПараметрам(ТипыПО, Идентификатор, РабочееМесто, ТолькоАвтоматическаяФискализация);
	
КонецФункции

// Функция возвращает структуру с данными устройства.
//
// Параметры:
// 	Идентификатор - СправочникСсылка.ПодключаемоеОборудование - экземпляр подключаемого оборудования.
// Возвращаемое значение:
// 	Структура - Описание:
// *ОбработчикДрайвераИмя - Строка - имя драйвера.
// *ОбработчикДрайвера - Строка - обработчик драйвера. 
// *ИмяКомпьютера - Строка - наименование компьютера. 
// *РабочееМесто - СправочникСсылка.РабочиеМеста - рабочее место.
// *Параметры - Структура - структура с полями:
// **ДатаНачала - Дата - .
// **ДатаОкончания - Дата - .
// **ПериодВыгрузки - Структура - структура с полями:
// ***ДатаНачала - Дата - дата начала загрузки.
// ***ДатаОкончания - Дата - дата окончания загрузки. 
// *ИдентификаторОбъекта - Строка - идентификатор объекта строкой.
// *ДрайверОборудования - СправочникСсылка.ДрайверОборудования - драйвер оборудования.
// *ТипОборудования - ПеречислениеСсылка.ТипыПодключаемогоОборудования - тип оборудования.
// *Наименование - Строка - наименование оборудования.
// *ИдентификаторУстройства - Строка - идентификатор устройства.
// *Ссылка - СправочникСсылка.ПодключаемоеОборудование - экземпляр подключаемого оборудования.
//
Функция ПолучитьДанныеУстройства(Идентификатор) Экспорт

	Возврат Справочники.ПодключаемоеОборудование.ПолучитьДанныеУстройства(Идентификатор);

КонецФункции

// Процедура предназначена для сохранения параметров устройства
// в реквизит Параметры типа хранилище значения в элементе справочника.
//
Функция СохранитьПараметрыУстройства(Идентификатор, Параметры) Экспорт
	
	Возврат Справочники.ПодключаемоеОборудование.СохранитьПараметрыУстройства(Идентификатор, Параметры);
	
КонецФункции

Функция ВызватьФункциюМенеджера(ИмяМенеджера,ИмяФункции,Параметры=Неопределено) Экспорт
	Результат	= Неопределено;	
	
	Если ТипЗнч(Параметры)=Тип("Структура") Тогда		
		ФормПараметры	= Новый Массив;
		ФактПараметры 	= Новый Массив;
		Для Каждого Элемент Из Параметры Цикл
			ФормПараметры.Добавить("ФактПараметры["+ФормПараметры.Количество()+"]");
			ФактПараметры.Добавить(Элемент.Значение);
		КонецЦикла; 
		
		ИсполняемаяФормула="Результат="+ИмяМенеджера+"."+ИмяФункции+"("+СтрСоединить(ФормПараметры,",")+")";
	ИначеЕсли Параметры<>Неопределено Тогда
		ИсполняемаяФормула="Результат="+ИмяМенеджера+"."+ИмяФункции+"(Параметры)";			
	Иначе
		ИсполняемаяФормула="Результат="+ИмяМенеджера+"."+ИмяФункции+"()";		
	КонецЕсли; 
	
	Выполнить(ИсполняемаяФормула);
	
	Возврат Результат;
КонецФункции // ()

Функция ПодключитьВнешнююОбработку(АдресХранилища) Экспорт

	ОЗООД=Новый ОписаниеЗащитыОтОпасныхДействий;
	ОЗООД.ПредупреждатьОбОпасныхДействиях=Ложь;
	
    Возврат ВнешниеОбработки.Подключить(АдресХранилища,,Ложь,ОЗООД);

КонецФункции

	
#КонецОбласти


Функция ПолучитьПараметрыСменыИзXMLПакета(ДанныеXML, РевизияИнтерфейса = 0) Экспорт
	
	ПараметрыККТ = ПараметрыНормализуемыхФискальныхДанных();
	
	Если Не ПустаяСтрока(ДанныеXML) Тогда
		
		ЧтениеXML = Новый ЧтениеXML; 
		ЧтениеXML.УстановитьСтроку(ДанныеXML);
		ЧтениеXML.ПерейтиКСодержимому();
		
		Если РевизияИнтерфейса >= 3000 Тогда  // Версия стандарта 3.0 (ОФД 1.1)
			
			Если ЧтениеXML.Имя = "OutputParameters" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				Если ЧтениеXML.Прочитать() И ЧтениеXML.Имя = "Parameters" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
					ПараметрыККТ.НомерСменыККТ = ЧтениеXML.ЗначениеАтрибута("ShiftNumber");
					ПараметрыККТ.НомерЧекаККТ  = ЧтениеXML.ЗначениеАтрибута("CheckNumber");
					ДатаСменыККТ = ЧтениеXML.ЗначениеАтрибута("DateTime");
					Если НЕ ПустаяСтрока(ДатаСменыККТ) Тогда
						ПараметрыККТ.ДатаСменыККТ = XMLЗначение(Тип("Дата"), ДатаСменыККТ);
					КонецЕсли;
					ПараметрыККТ.НомерЧекаЗаСмену = ЧтениеXML.ЗначениеАтрибута("ShiftClosingCheckNumber");
					ПараметрыККТ.СтатусСмены      = Число(ЧтениеXML.ЗначениеАтрибута("ShiftState"));
					ПараметрыККТ.ОстатокНаличных  = ЧтениеXML.ЗначениеАтрибута("CashBalance");
					ПараметрыККТ.НеобходимаСтрочнаяЗаменаФН = ВРег(ЧтениеXML.ЗначениеАтрибута("FNError")) = "TRUE";
					ПараметрыККТ.ПамятьФНПереполнена        = ВРег(ЧтениеXML.ЗначениеАтрибута("FNOverflow")) = "TRUE";
					ПараметрыККТ.РесурсФНИсчерпан           = ВРег(ЧтениеXML.ЗначениеАтрибута("FNFail")) = "TRUE";
					КоличествоНепереданныхФД = ЧтениеXML.ЗначениеАтрибута("BacklogDocumentsCounter");
					ПараметрыККТ.КоличествоНепереданныхФД    = ?(ПустаяСтрока(КоличествоНепереданныхФД), 0, Число(КоличествоНепереданныхФД));
					ПараметрыККТ.НомерПервогоНепереданногоФД = ЧтениеXML.ЗначениеАтрибута("BacklogDocumentFirstNumber");
					ДатаПервогоНепереданногоФД = ЧтениеXML.ЗначениеАтрибута("BacklogDocumentFirstDateTime");
					Если НЕ ПустаяСтрока(ДатаПервогоНепереданногоФД) Тогда
						ПараметрыККТ.ДатаПервогоНепереданногоФД = XMLЗначение(Тип("Дата"), ДатаПервогоНепереданногоФД);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			Если ЧтениеXML.Имя = "OutputParameters" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				Если ЧтениеXML.Прочитать() И ЧтениеXML.Имя = "Parameters" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
					
					ПараметрыККТ.ПревышеноВремяОжиданияОтветаОФД 	= ВРег(ЧтениеXML.ЗначениеАтрибута("OFDtimeout")) = "TRUE";
					ПараметрыККТ.НеобходимаСтрочнаяЗаменаФН 		= ВРег(ЧтениеXML.ЗначениеАтрибута("UrgentReplacementFN")) = "TRUE";
					ПараметрыККТ.ПамятьФНПереполнена        		= ВРег(ЧтениеXML.ЗначениеАтрибута("MemoryOverflowFN")) = "TRUE";
					ПараметрыККТ.РесурсФНИсчерпан           		= ВРег(ЧтениеXML.ЗначениеАтрибута("ResourcesExhaustionFN")) = "TRUE";
					
					КоличествоНепереданныхФД 						= ЧтениеXML.ЗначениеАтрибута("BacklogDocumentsCounter");
					ПараметрыККТ.КоличествоНепереданныхФД    		= ?(ПустаяСтрока(КоличествоНепереданныхФД), 0, Число(КоличествоНепереданныхФД));
					
					ПараметрыККТ.НомерПервогоНепереданногоФД 		= ЧтениеXML.ЗначениеАтрибута("BacklogDocumentFirstNumber");
					ДатаПервогоНепереданногоФД 						= ЧтениеXML.ЗначениеАтрибута("BacklogDocumentFirstDateTime");
					
					Если НЕ ПустаяСтрока(ДатаПервогоНепереданногоФД) Тогда
						ПараметрыККТ.ДатаПервогоНепереданногоФД = XMLЗначение(Тип("Дата"), ДатаПервогоНепереданногоФД);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПараметрыККТ;
	
КонецФункции

Функция КодСистемыНалогообложенияККТ(СистемаНалогообложенияККТ) Экспорт
	
	СистемыНалогообложения = Новый Соответствие();
	СистемыНалогообложения.Вставить(ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.ОСН")           , 0);
	СистемыНалогообложения.Вставить(ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.УСНДоход")      , 1);
	СистемыНалогообложения.Вставить(ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.УСНДоходРасход"), 2);
	СистемыНалогообложения.Вставить(ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.ЕНВД")          , 3);
	СистемыНалогообложения.Вставить(ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.ЕСН")           , 4);
	СистемыНалогообложения.Вставить(ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.Патент")        , 5);
	
	Возврат СистемыНалогообложения.Получить(СистемаНалогообложенияККТ);
	
КонецФункции

Функция КодРасчетаДенежнымиСредствами(ТипРасчета) Экспорт
	
	ТипыРасчета = Новый Соответствие();
	ТипыРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств")        , 1);
	ТипыРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств")       , 2);
	ТипыРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.РасходДенежныхСредств")        , 3);
	ТипыРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратРасходаДенежныхСредств"), 4);
	
	Возврат ТипыРасчета.Получить(ТипРасчета);
	
КонецФункции

Функция КодПризнакаАгента(КодПризнакаАгента) Экспорт
	
	ПризнакиАгента = Новый Соответствие(); 
	
	ПризнакиАгента.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиАгента.БанковскийПлатежныйАгент")   , 0);
	ПризнакиАгента.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиАгента.БанковскийПлатежныйСубагент"), 1);
	ПризнакиАгента.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиАгента.ПлатежныйАгент")             , 2);
	ПризнакиАгента.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиАгента.ПлатежныйСубагент")          , 3);
	ПризнакиАгента.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиАгента.Поверенный")                 , 4);
	ПризнакиАгента.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиАгента.Комиссионер")                , 5);
	ПризнакиАгента.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиАгента.Агент")                      , 6);
	
	Возврат ПризнакиАгента.Получить(КодПризнакаАгента);
	
КонецФункции

Функция КодПризнакаСпособаРасчета(ПризнакСпособаРасчета) Экспорт
	
	ПризнакиСпособаРасчета = Новый Соответствие();
	ПризнакиСпособаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиСпособаРасчета.ПредоплатаПолная")         , 1); 
	ПризнакиСпособаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиСпособаРасчета.ПредоплатаЧастичная")      , 2);
	ПризнакиСпособаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиСпособаРасчета.Аванс")                    , 3); 
	ПризнакиСпособаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой")   , 4); 
	ПризнакиСпособаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиСпособаРасчета.ПередачаСЧастичнойОплатой"), 5);  
	ПризнакиСпособаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиСпособаРасчета.ПередачаБезОплаты")        , 6);  
	ПризнакиСпособаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиСпособаРасчета.ОплатаКредита")            , 7);  
	
	Возврат ПризнакиСпособаРасчета.Получить(ПризнакСпособаРасчета);
	
КонецФункции

Функция КодПризнакаПредметаРасчета(ПризнакПредметаРасчета, РевизияИнтерфейса = 0) Экспорт
	
	ПризнакиПредметаРасчета = Новый Соответствие(); 
	
	ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.Товар")                  , 1);
	ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.ПодакцизныйТовар")       , 2);
	ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.Работа")                 , 3);
	ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.Услуга")                 , 4);
	ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.СтавкаАзартнойИгры")     , 5);
	ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.ВыигрышАзартнойИгры")    , 6);
	ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.ЛотерейныйБилет")        , 7);
	ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.ВыигрышЛотереи")         , 8);
	ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.ПредоставлениеРИД")      , 9);
	ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.Платеж")                 , 10);
	ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.АгентскоеВознаграждение"), 11);
	ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.Выплата")                , 12);
	ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.ИнойПредметРасчета")     , 13);
	ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.ИмущественноеПраво")     , 14);
	ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.ВнереализационныйДоход") , 15);
	ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.СтраховыеВзносы")        , 16);
	ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.ТорговыйСбор")           , 17);       
	ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.КурортныйСбор")          , 18);
	ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.Залог")                  , 19);
	
	Если РевизияИнтерфейса > 3001 Тогда
		ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.Расход")                 , 20);
		ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.ОбязательноеПенсионноеСтрахованиеИП") , 21);
		ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.ОбязательноеПенсионноеСтрахование")   , 22);
		ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.ОбязательноеМедицинскоеСтрахованиеИП"), 23);
		ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.ОбязательноеМедицинскоеСтрахование")  , 24);
		ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.ОбязательноеСоциальноеСтрахование")   , 25);
		ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.ПлатежКазино")                        , 26);
		// Оставлены для совместимости.
		ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.ПлатежВыплата")          , 10);
		ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.СоставнойПредметРасчета"), 10); 
	Иначе
		// Оставлены для совместимости.
		ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.ПлатежВыплата")          , 10);
		ПризнакиПредметаРасчета.Вставить(ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.СоставнойПредметРасчета"), 12);
	КонецЕсли;
	
	Возврат ПризнакиПредметаРасчета.Получить(ПризнакПредметаРасчета);
	
КонецФункции


Функция ПараметрыРегистрацииККТ() Экспорт
	
	Параметры = ПараметрыФискальногоНакопителяОбщие();
	Параметры.Вставить("ПризнакФискализации");        // Признак регистрации фискального накопителя.
	Параметры.Вставить("НомерДокументаФискализации"); // Номер документа регистрация фискального накопителя.
	Параметры.Вставить("ДатаВремяФискализации");      // Дата и время операции регистрации фискального накопителя.
	Возврат Параметры; 
	
КонецФункции

Функция ПараметрыФискальногоНакопителяОбщие() Экспорт
	
	Параметры = Новый Структура();
	// ФФД 1.0
	Параметры.Вставить("РегистрационныйНомерККТ"); // Регистрационный номер ККТ
	Параметры.Вставить("ЗаводскойНомерККТ");  // Заводской номер ККТ 
	Параметры.Вставить("ЗаводскойНомерФН");   // Заводской номер ФН
	Параметры.Вставить("ВерсияФФДФН");  // Версия ФФД ФН (одно из следующих значений "1.0","1.1")
	Параметры.Вставить("ВерсияФФДККТ"); // Версия ФФД ККТ (одно из следующих значений "1.0","1.0.5","1.1")
	
	Параметры.Вставить("ОрганизацияНазвание"); // Название организации
	Параметры.Вставить("ОрганизацияИНН");      // ИНН организация
	
	Параметры.Вставить("АдресПроведенияРасчетов"); // Адрес проведения расчетов
	Параметры.Вставить("МестоПроведенияРасчетов"); // Место проведения расчетов
	
	Параметры.Вставить("КодыСистемыНалогообложения"); // Коды системы налогообложения
	
	Параметры.Вставить("ПризнакАвтономногоРежима"  , Ложь); // Признак автономного режима
	Параметры.Вставить("ПризнакШифрованиеДанных"   , Ложь); // Признак шифрование данных
	Параметры.Вставить("ПризнакРасчетовЗаУслуги"   , Ложь); // Признак расчетов за услуги
	Параметры.Вставить("ПродажаПодакцизногоТовара" , Ложь); // Продажа подакцизного товара
	
	Параметры.Вставить("ПроведенияАзартныхИгр"     , Ложь); // Признак проведения азартных игр
	Параметры.Вставить("ПроведенияЛотерей"         , Ложь); // Признак проведения лотереи
	Параметры.Вставить("ПризнакиАгента");                   // Коды признаков агента
	Параметры.Вставить("ПризнакФормированияБСО"    , Ложь); // Признак формирования АС БСО
	
	Параметры.Вставить("ПризнакРасчетовТолькоВИнтернет", Ложь);  // Признак ККТ для расчетов только в Интернет
	Параметры.Вставить("УстановкаПринтераВАвтомате"    , Ложь);  // Признак установки принтера в автомате
	Параметры.Вставить("ПризнакАвтоматическогоРежима"  , Ложь);  // Признак автоматического режима
	Параметры.Вставить("НомерАвтоматаДляАвтоматическогоРежима"); // Номер автомата для автоматического режима
	Параметры.Вставить("ОрганизацияОФДИНН");      // Название организации ОФД
	Параметры.Вставить("ОрганизацияОФДНазвание"); // ИНН организации ОФД
	
	Параметры.Вставить("ОтправительEmail"); // Адрес электронной почты отправителя чека.
	Параметры.Вставить("АдресСайтаФНС");    // Адрес сайта уполномоченного органа (ФНС). 
	
	Возврат Параметры; 
	
КонецФункции


#Область Операции_с_ККМ

&НаКлиенте
Функция ВыполнитьКомандуККМ(Команда, ФискальноеУстройство, ЭквайринговыйТерминал, КассоваяСмена, СуммаОперации = Неопределено, ПоказыватьСообщения = Истина) Экспорт
				
	Если НЕ ЗначениеЗаполнено(ФискальноеУстройство) Тогда
		ПоказатьПредупреждение(, "Не указан фискальный регистратор! Невозможно выполнить операции с ККМ!");
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстСообщения	= "";
	рОперации		= Неопределено;
	
	Если Команда = "СнятьXОтчет" Тогда
		рОперации = СнятьХОтчет(ФискальноеУстройство);
		Если рОперации.Успешно Тогда
			ТекстСообщения = "Снят Х-отчет (без гашения)";
		Иначе
			ТекстСообщения = "Не удалось снять Х-отчет!" + Символы.ПС + рОперации.Ошибки;			
		КонецЕсли;
		
	ИначеЕсли Команда = "ОткрытьДенежныйЯщик" Тогда
		рОперации = ОткрытьДенежныйЯщик(ФискальноеУстройство);
		Если рОперации.Успешно Тогда
			ТекстСообщения = "Открыт денежный ящик";			
		Иначе
			ТекстСообщения = "Не открыть денежный ящик!" + Символы.ПС + рОперации.Ошибки;			
		КонецЕсли;		
	ИначеЕсли Команда = "ОткрытьСмену" Тогда
		// проверим, что предыдущая кассовая смена закрыта
		СтатусПоследнейСмены = СтатусПоследнейСмены(ФискальноеУстройство);
		Если СтатусПоследнейСмены.Открыта Тогда
			// не закрыли крайнюю смену в 1С
			ТекстСообщения = "Необходимо закрыть кассовую смену в 1С !";
			рОперации = Новый Структура("Успешно,Ошибки", Ложь, ТекстСообщения);
		Иначе
			// крайняя смена закрыта, пробуем открыть новую смену
			рОперации = ОткрытьСмену(ФискальноеУстройство);
			Если рОперации.Успешно Тогда				
				КассоваяСмена = СоздатДок_КассоваяСмена(рОперации, ФискальноеУстройство);
				ТекстСообщения = "На фискальном устройстве открыта кассовая смена"; 
			Иначе
				ТекстСообщения = "Не удалось открыть кассовую смену!" + Символы.ПС + рОперации.Ошибки;				
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Команда = "ЗакрытьСмену" Тогда
		
		// проверим, что в кассе не осталось наличных
		ОстатокФР = ПолучитьСуммуДенежныхСредствВКассе(ФискальноеУстройство);
		Если ОстатокФР > 0 Тогда
			РезультатФискализации = Новый Структура("Успешно,Ошибки", Ложь, "В кассе остались наличные, необходимо произвести выемку!");
		Иначе
			// закрываем смену на устройстве
			РезультатФискализации	= ЗакрытьСмену(ФискальноеУстройство);
		КонецЕсли;
		
		// печатаем отчет эквайринга, если подключен эквайринговый терминал
		Если ЗначениеЗаполнено(ЭквайринговыйТерминал) И РезультатФискализации.Успешно Тогда
			РезультатИтогиДня = ИтогиДня(ЭквайринговыйТерминал);
			Если РезультатИтогиДня.Успешно И Не ПустаяСтрока(РезультатИтогиДня.ТекстКвитанции) Тогда
				РезультатПечатиСлипЧеков = ПечатьСлипЧека(ФискальноеУстройство, РезультатИтогиДня.ТекстКвитанции, 1);
				РезультатФискализации.Вставить("ТекстСлипЧека", РезультатИтогиДня.ТекстКвитанции);
			Иначе
				РезультатФискализации.Вставить("ТекстСлипЧека", "");
			КонецЕсли;
		Иначе
			РезультатФискализации.Вставить("ТекстСлипЧека", "");
		КонецЕсли;
		
		Если Не РезультатФискализации.Успешно Тогда
			ТекстСообщения = "Не удалось закрыть кассовую смену!" + Символы.ПС + РезультатФискализации.Ошибки;
		Иначе
			// доступна смешанная оплата, создаем один ОКС
			//ОКС_Ссылка = Документы.ОтчетКассовойСмены.СоздатьОКС(РезультатФискализации, КассоваяСмена);	
			//Если ЗначениеЗаполнено(ОКС_Ссылка) Тогда
			//	ПараметрыФормы = Новый Структура("Ссылка", ОКС_Ссылка);
			//	ОткрытьФорму("Документ.ОтчетКассовойСмены.Форма.ФормаКонтрольныеПоказатели", ПараметрыФормы,,,,,, РежимОткрытияОкнаФормы.Независимый);
			//Иначе
			//	ТекстСообщения = "За кассовую смену не было пробито чеков. ОКС не создан!";
			//КонецЕсли;
		КонецЕсли;
		
		
		
	ИначеЕсли Команда = "ВыемкаНаличных" Тогда
		
		рФискализации = ВыемкаВнесениеДенежныхСредств(ФискальноеУстройство, "Выемка", СуммаОперации);
		Если рФискализации.Успешно Тогда
			////создать документ ПКО, из кассы в сейф
			//пФункции = Новый Структура;
			//пФункции.Вставить("ВидОперации",	ПредопределенноеЗначение("Перечисление.ВидыОперацийПереводДенежныхСредств.ПереводДенегВСейф"));
			//пФункции.Вставить("СуммаОперации",	РезультатФискализации.СуммаОперации);
			//
			//рСозданияДокумента = ШлюзВызовСервера.ВызватьФункциюМенеджера("Документы.ПеремещениеДенежныхСредств", "СоздатьДокументПеремещениеДС", ПараметрыФункции);
			//
			//Если рСозданияДокумента.Успешно Тогда
			//	ТекстСообщения = "Создан документ Перемещение денежных средств (выемка) на сумму #СуммаОперации# руб.";
			//	ТекстСообщения = СтрЗаменить(ТекстСообщения, "#СуммаОперации#", Формат(РезультатФискализации.СуммаОперации, "ЧДЦ=2; ЧН=0,00"));
			//Иначе				
			//	ТекстСообщения = "Ошибка при создании документа Перемещение денежных средств!";				
			//КонецЕсли;																						
		Иначе			
			ТекстСообщения = "Не удалось произвести выемку денежных средств!" + Символы.ПС + рФискализации.Ошибки;			
		КонецЕсли;		
	ИначеЕсли Команда.Имя = "ВнесениеНаличных" Тогда
		РезультатФискализации = ВыемкаВнесениеДенежныхСредств(ФискальноеУстройство, "Внесение", СуммаОперации);
		Если Не РезультатФискализации.Успешно Тогда
			ТекстСообщения = "Не удалось произвести внесение денежных средств!" + Символы.ПС + РезультатФискализации.Ошибки;
		Иначе
			//создать документ РКО, из сейфа в кассу
			ПараметрыФункции = Новый Структура;
			ПараметрыФункции.Вставить("ВидОперации",	ПредопределенноеЗначение("Перечисление.ВидыОперацийПереводДенежныхСредств.ВыдачаДенегИзСейфа"));
			ПараметрыФункции.Вставить("СуммаОперации",	РезультатФискализации.СуммаОперации);
			
			рСозданияДокумента = Документы.ПереводСредств.СоздатьДокументПеремещениеДС(ПараметрыФункции);
			
			Если рСозданияДокумента = Неопределено Тогда
				ТекстСообщения = "Ошибка при создании документа Перемещение денежных средств!";
			Иначе
				ТекстСообщения = "Создан документ Перемещение денежных средств (внесение) на сумму #СуммаОперации# руб.";
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "#СуммаОперации#", Формат(РезультатФискализации.СуммаОперации, "ЧДЦ=2; ЧН=0,00"));
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Команда = "ИтогиДняПоКартам" Тогда
		Если ЭквайринговыйТерминал.Пустая() Тогда
			ТекстСообщения = "Не подключен эквайринговый терминал!";
		Иначе
			РезультатИтогиДня = ИтогиДня(ЭквайринговыйТерминал);
			Если РезультатИтогиДня.Успешно И Не ПустаяСтрока(РезультатИтогиДня.ТекстКвитанции) Тогда
				РезультатПечатиСлипЧеков = ПечатьСлипЧека(ФискальноеУстройство, РезультатИтогиДня.ТекстКвитанции, 1);
				ТекстСообщения = "Сняты итоги дня по картам";
			ИначеЕсли Не РезультатИтогиДня.Успешно Тогда
				ТекстСообщения = РезультатИтогиДня.Ошибки;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Команда = "АварийнаяОтменаОперации" Тогда
		
		РезультатВопроса = Вопрос("Выполнить аварийную отмену последней операции по эквайринговому терминалу?", РежимДиалогаВопрос.ДаНет);
		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			Если ЭквайринговыйТерминал.Пустая() Тогда
				ТекстСообщения = "Не подключен эквайринговый терминал!";
			Иначе
				РезультатАварийнаяОтмена = АварийнаяОтменаОперации(ЭквайринговыйТерминал);
				Если РезультатАварийнаяОтмена.Успешно Тогда
					ТекстСообщения = "Выполнена аварийная отмена последней операции!";
				Иначе
					ТекстСообщения = РезультатАварийнаяОтмена.Ошибки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Команда = "КонтрольнаяЛента" Тогда
		Если ЭквайринговыйТерминал.Пустая() Тогда
			ТекстСообщения = "Не подключен эквайринговый терминал!";
		Иначе
			РезультатКонтрольнаяЛента = КонтрольнаяЛента();
			Если РезультатКонтрольнаяЛента.Успешно И Не ПустаяСтрока(РезультатКонтрольнаяЛента.ТекстКвитанции) Тогда
				РезультатПечатиСлипЧеков = ПечатьСлипЧека(ФискальноеУстройство, РезультатКонтрольнаяЛента.ТекстКвитанции, 1);
				ТекстСообщения = "Напечатана контрольная лента эквайрингового терминала";
			ИначеЕсли Не РезультатКонтрольнаяЛента.Успешно Тогда
				ТекстСообщения = РезультатКонтрольнаяЛента.Ошибки;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекстСообщения) Тогда
		Если ПоказыватьСообщения Тогда
			ПоказатьПредупреждение(, ТекстСообщения, 5);
		КонецЕсли;
	КонецЕсли;
	
	Если МаркировкаКС.ПолучитьЗначениеПараметра(РезультатФискализации, "Успешно", Ложь) = Истина Тогда
		//Оповестить(ОбщегоНазначенияКлиент.ИмяСобытияИзменениеСостоянияКассовойСмены(), РезультатФискализации);
		//Оповестить(ОбщегоНазначенияКлиент.ИмяСобытияОбновитьОстаткиДенежныхСредств(), РезультатФискализации);
	КонецЕсли;
	
	Возврат РезультатФискализации;
	
КонецФункции

#Область Открытие_смены

Функция ОткрытьСмену(ФискальноеУстройство)
	
	Результат = Новый Структура("Успешно,Ошибки", Ложь, "");	
	
	РезультатПодключения = ПроверитьПодключитьОборудование(ФискальноеУстройство);
	Если Не РезультатПодключения.Успешно Тогда
		Результат.Ошибки = РезультатПодключения.Ошибки;
		Возврат Результат;
	КонецЕсли;
	
	ВходныеПараметры = ПолучитьВходныеПараметры_ККМ();
	
	Кассир			= ВходныеПараметры.Кассир;
	КассирИНН		= ВходныеПараметры.КассирИНН;
	
	Если Не ПроверитьИННКассира(КассирИНН, Результат.Ошибки) Тогда
		Возврат Результат;	
	КонецЕсли; 
	
	НомерСмены     	= 0;
	НомерДокумента 	= 0;
	ПараметрыСмены	= Неопределено;	
		
	РевизияИнтерфейса	= РевизияИнтерфейса(ФискальноеУстройство);
	ОбъектДрайвера		= ПолучитьОбъектДрайвера(ФискальноеУстройство);		
	
	ПроверитьДемоРежим(ОбъектДрайвера);
	
	ИД_Устройства		= ИдентификаторПодключенногоОборудования(ФискальноеУстройство);
	
	// Получить параметры ККТ при открытии смены.
	ПараметрыККТ_XML = "";
	Попытка		
		Если НЕ ОбъектДрайвера.ПолучитьПараметрыККТ(ИД_Устройства, ПараметрыККТ_XML) Тогда
			ОписаниеОшибки = "";
			ОбъектДрайвера.ПолучитьОшибку(ОписаниеОшибки); 
			Результат.Ошибки = "Ошибка результата метода <ОбъектДрайвера.ПолучитьПараметрыККТ>. " + Символы.ПС + ОписаниеОшибки;
			Возврат Результат;
		КонецЕсли;
	Исключение		
		Результат.Ошибки	= НСтр("ru='Ошибка вызова метода <ОбъектДрайвера.ПолучитьПараметрыККТ>.'") + Символы.ПС + ОписаниеОшибки();
		Возврат Результат;
	КонецПопытки;
	
	ПараметрыККТ = ПараметрыККТИзXMLПакета(ПараметрыККТ_XML, РевизияИнтерфейса);
	
	Вход 	= ВходныеПараметрыXML(ВходныеПараметры, РевизияИнтерфейса);
	Выход   = "";
	
	Попытка
		
		Если РевизияИнтерфейса >= 3000 Тогда // Версия стандарта 3.0 (ОФД 1.1)
			РезультатДрайвера = ОбъектДрайвера.ПолучитьТекущееСостояние(ИД_Устройства, Вход, Выход); 
			Если РезультатДрайвера Тогда
				ПараметрыСмены	= ПолучитьПараметрыСменыИзXMLПакета(Выход, РевизияИнтерфейса);	
				
				//Состояние смены
				//1 - Закрыта
				//2 - Открыта
				//3 - Истекла
				
				Если ПараметрыСмены.СтатусСмены = 1 Тогда //Закрыта
					РезультатДрайвера = ОбъектДрайвера.ОткрытьСмену(ИД_Устройства, Вход, Выход);
					Если РезультатДрайвера Тогда
						ФискальныеДанныеСтруктура 	= ПолучитьПараметрыСменыИзXMLПакета(Выход, РевизияИнтерфейса);
						
						НомерСмены     				= ФискальныеДанныеСтруктура.НомерСменыККТ;
						НомерДокумента 				= ФискальныеДанныеСтруктура.НомерЧекаККТ;
						
						Результат.Успешно	 = Истина;			
					КонецЕсли;					
				Иначе
					Результат.Ошибки="Не допустимый текущий статус смены: "+ПараметрыСмены.СтатусСмены;										
				КонецЕсли;				
			КонецЕсли;
			
		Иначе
			
			Результат.Ошибки = "Ревизия интерфейса меньше 3000";
		
		КонецЕсли;
		
	Исключение
		
		Результат.Ошибки=НСтр("ru='Ошибка вызова метода <ОбъектДрайвера.ОткрытьСмену>.'") + Символы.ПС + ОписаниеОшибки();			
		
	КонецПопытки;
	
	
	Если Результат.Успешно Тогда
		рКасса = ПолучитьКассуПоОборудованию(ФискальноеУстройство);
		Если рКасса.Успешно Тогда
			КассаККМ = рКасса.КассаККМ;
			
			// Заполнение выходных параметров.
			ВыходныеПараметры = Новый Структура();		
			
			ВыходныеПараметры.Вставить("КассаККМ", 				ПолучитьКассуПоОборудованию(ФискальноеУстройство));
			
			ВыходныеПараметры.Вставить("НомерСмены",			НомерСмены);
			ВыходныеПараметры.Вставить("НомерДокумента",		НомерДокумента);
			ВыходныеПараметры.Вставить("Открыта",				Истина); // 2 - Открыта - Состояние смены  
			ВыходныеПараметры.Вставить("ДатаСеанса",			ТекущаяДата());
			
			ВыходныеПараметры.Вставить("ПараметрыСмены",		ПараметрыСмены);
			ВыходныеПараметры.Вставить("ПараметрыСостояния",	Выход);
			ВыходныеПараметры.Вставить("ПараметрыККТ",			ПараметрыККТ);
			
			Результат.Успешно = Истина;
			Результат.Вставить("Данные", ВыходныеПараметры);			
		Иначе	
			Результат.Ошибки = "Невозможно определить элемент спр. Кассы подключенной к текущему рабочему месту !";;	
		КонецЕсли; 		
	Иначе		
		Ошибки = "";
		ОбъектДрайвера.ПолучитьОшибку(Ошибки);
		
		Результат.Ошибки = СокрЛП(Результат.Ошибки + "; " + Ошибки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// обертка для вызова функции модуля менеджера
Функция СоздатДок_КассоваяСмена(ФискальноеУстройство, РезультатФискализации)
	
	пФункции = Новый Структура;
	пФункции.Вставить("ФискальноеУстройство",	ФискальноеУстройство);
	пФункции.Вставить("РезультатФискализации",	РезультатФискализации);
	
	//Возврат  Документы.КассоваяСмена.Создать(пФункции);
	
	Возврат Неопределено; //Нету тут такого документа
КонецФункции

#КонецОбласти

#Область Закрытие_смены

Функция ЗакрытьСмену(ФискальноеУстройство)
	
	Результат	= Новый Структура("Успешно,Ошибки", Ложь, "");	
	
	РезультатПодключения = ПроверитьПодключитьОборудование(ФискальноеУстройство);
	Если Не РезультатПодключения.Успешно Тогда
		Результат.Ошибки = РезультатПодключения.Ошибки;
		Возврат Результат;
	КонецЕсли;
	
	ВходныеПараметры = ПолучитьВходныеПараметры_ККМ();
	
	Кассир				= ВходныеПараметры.Кассир;
	КассирИНН			= ВходныеПараметры.КассирИНН;	
	
	Если Не ПроверитьИННКассира(КассирИНН, Результат.Ошибки) Тогда
		Возврат Результат;	
	КонецЕсли;
	
	НомерСмены     		= 0;
	НомерДокумента		= 0;
	ПараметрыСмены		= Неопределено;
	
	
	РевизияИнтерфейса	= РевизияИнтерфейса(ФискальноеУстройство);
	ОбъектДрайвера		= ПолучитьОбъектДрайвера(ФискальноеУстройство);
	
	ПроверитьДемоРежим(ОбъектДрайвера);
	
	ИД_Устройства		= ИдентификаторПодключенногоОборудования(ФискальноеУстройство);
	
	Вход 				= ВходныеПараметрыXML(ВходныеПараметры, РевизияИнтерфейса);
	Выход				= "";
	
	Попытка
		Если РевизияИнтерфейса >= 3000 Тогда // Версия стандарта 3.0 (ОФД 1.1)
			РезультатДрайвера = ОбъектДрайвера.ЗакрытьСмену(ИД_Устройства, Вход, Выход);
			Если РезультатДрайвера Тогда
				ПараметрыСмены = ПолучитьПараметрыСменыИзXMLПакета(Выход, РевизияИнтерфейса);
				
				НомерСмены     = ПараметрыСмены.НомерСменыККТ;
				НомерДокумента = ПараметрыСмены.НомерЧекаККТ;
				
				Результат.Успешно	= Истина;
			КонецЕсли;
		Иначе
			Результат.Ошибки = "Ревизия интерфейса меньше 3000";
		КонецЕсли;
	Исключение
		Результат.Ошибки = НСтр("ru='Ошибка вызова метода <ОбъектДрайвера.ЗакрытьСмену>.'") + Символы.ПС + ОписаниеОшибки();
		Возврат Результат;
	КонецПопытки;			
		
	Если Результат.Успешно Тогда
		ВыходныеПараметры	= Новый Структура;
		
		ВыходныеПараметры.Вставить("НомерСмены",		НомерСмены);
		ВыходныеПараметры.Вставить("НомерДокумента",	НомерДокумента);
		ВыходныеПараметры.Вставить("СостояниеСмены",	1); // 1 - Закрыта - Состояние смены  
		ВыходныеПараметры.Вставить("ДатаСеанса",		ТекущаяДата());
		ВыходныеПараметры.Вставить("ПараметрыСмены",	ПараметрыСмены);
		ВыходныеПараметры.Вставить("ПараметрыСостояния",Выход);
		
		Результат.Вставить("Данные", ВыходныеПараметры);
		Результат.Успешно = Истина;
	Иначе		
		ОбъектДрайвера.ПолучитьОшибку(Результат.Ошибки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ИтогиДня(ЭквайринговыйТерминал)
	
	Результат = Новый Структура("Успешно,Ошибки", Ложь, "");

	РезультатПодключения = ПроверитьПодключитьОборудование(ЭквайринговыйТерминал);
	
	Если Не РезультатПодключения.Успешно Тогда
		Результат.Ошибки = РезультатПодключения.Ошибки;
		Возврат Результат;
	КонецЕсли;
	
	РевизияИнтерфейса	= РевизияИнтерфейса(ЭквайринговыйТерминал);
	ОбъектДрайвера		= ПолучитьОбъектДрайвера(ЭквайринговыйТерминал);
	ИД_Устройства		= ИдентификаторПодключенногоОборудования(ЭквайринговыйТерминал);
	
	ТекстКвитанции = "";
	
	Попытка
		РезультатДрайвера = ОбъектДрайвера.ИтогиДняПоКартам(ИД_Устройства, ТекстКвитанции);
		Если Не РезультатДрайвера Тогда
			Результат.Ошибки = "Ошибка результата метода <ОбъектДрайвера.ИтогиДняПоКартам>.";
		Иначе
			Результат.Вставить("ТекстКвитанции", ТекстКвитанции);
			Результат.Успешно = Истина;
		КонецЕсли;
	Исключение
		Результат.Ошибки = "Ошибка результата метода <ОбъектДрайвера.ИтогиДняПоКартам>." + Символы.ПС + ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция АварийнаяОтменаОперации(ЭквайринговыйТерминал)
	
	Результат = Новый Структура("Успешно,Ошибки", Ложь, "");

	РезультатПодключения = ПроверитьПодключитьОборудование(ЭквайринговыйТерминал);
	
	Если Не РезультатПодключения.Успешно Тогда
		Результат.Ошибки = РезультатПодключения.Ошибки;
		Возврат Результат;
	КонецЕсли;
	
	РевизияИнтерфейса	= РевизияИнтерфейса(ЭквайринговыйТерминал);
	ОбъектДрайвера		= ПолучитьОбъектДрайвера(ЭквайринговыйТерминал);
	ИД_Устройства		= ИдентификаторПодключенногоОборудования(ЭквайринговыйТерминал);
	
	Попытка
		РезультатДрайвера = ОбъектДрайвера.АварийнаяОтменаОперации(ИД_Устройства);
		Если Не РезультатДрайвера Тогда
			Результат.Ошибки = "Ошибка результата метода <ОбъектДрайвера.АварийнаяОтменаОперации>.";
		Иначе
			Результат.Успешно = Истина;
		КонецЕсли;
	Исключение
		Результат.Ошибки = "Ошибка результата метода <ОбъектДрайвера.АварийнаяОтменаОперации>." + Символы.ПС + ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция СнятьХОтчет(ФискальноеУстройство)
	
	Результат = Новый Структура("Успешно,Ошибки", Ложь, "");
	
	РезультатПодключения = ПроверитьПодключитьОборудование(ФискальноеУстройство);
	
	Если Не РезультатПодключения.Успешно Тогда
		Результат.Ошибки	= РезультатПодключения.Ошибки;
		Результат.Успешно	= Ложь;	
		Возврат Результат;
	КонецЕсли;
	
	РевизияИнтерфейса	= РевизияИнтерфейса(ФискальноеУстройство);
	ОбъектДрайвера		= ПолучитьОбъектДрайвера(ФискальноеУстройство);
	ИД_Устройства		= ИдентификаторПодключенногоОборудования(ФискальноеУстройство);
	ВходныеПараметрыXML	= ВходныеПараметрыXML(Новый Структура, РевизияИнтерфейса);
	
	РезультатДрайвера	= ОбъектДрайвера.НапечататьОтчетБезГашения(ИД_Устройства, ВходныеПараметрыXML);
	
	Если РезультатДрайвера Тогда
		Результат.Успешно = Истина;
	Иначе
		ОбъектДрайвера.ПолучитьОшибку(Результат.Ошибки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КонтрольнаяЛента()
	
	Результат = Новый Структура("Успешно,Ошибки", Ложь, "");

	ТекстКвитанции = "";
	
	Попытка
		ОбъектДрайвера = Новый COMОбъект("SBRFSRV.Server");
	Исключение
		Результат.Ошибки = "Ошибка при подключении библиотеки sbrf.dll" + Символы.ПС + ОписаниеОшибки();
		Возврат Результат;
	КонецПопытки;
	
	РезультатОперации = ОбъектДрайвера.NFun(7000);
	
	Попытка
		Если РезультатОперации = 0 Тогда
			
			ТекстСлипЧека	= ОбъектДрайвера.GParamString("Cheque");
			ТекстСлипЧека2	= ОбъектДрайвера.GParamString("Cheque1251");
			
			СтрокаПоиска = ?(Найти(ТекстСлипЧека, "=" + Символы.ПС) > 0, "=" + Символы.ПС, "=" + Символы.ВК);
			ТекстСлипЧека = Лев(ТекстСлипЧека, Найти(ТекстСлипЧека, СтрокаПоиска));
			
			Результат.Вставить("ТекстКвитанции", ТекстСлипЧека);
			Результат.Успешно = Истина;
			
		Иначе
			Результат.Ошибки = "Ошибка при получении контрольной ленты, код ошибки " + Строка(РезультатОперации);
		КонецЕсли;
	Исключение
		Результат.Ошибки = "Ошибка при получении контрольной ленты." + Символы.ПС + ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ОткрытьДенежныйЯщик(ФискальноеУстройство)
	  
	Результат = Новый Структура("Успешно,Ошибки", Ложь, "");
	
	РезультатПодключения = ПроверитьПодключитьОборудование(ФискальноеУстройство);
	
	Если Не РезультатПодключения.Успешно Тогда
		Результат.Ошибки = РезультатПодключения.Ошибки;
	КонецЕсли;
	
	РевизияИнтерфейса	= РевизияИнтерфейса(ФискальноеУстройство);
	ОбъектДрайвера		= ПолучитьОбъектДрайвера(ФискальноеУстройство);
	ИД_Устройства		= ИдентификаторПодключенногоОборудования(ФискальноеУстройство);
	
	РезультатДрайвера	= ОбъектДрайвера.ОткрытьДенежныйЯщик(ИД_Устройства);
	
	Если РезультатДрайвера Тогда
		Результат.Успешно = Истина;
	Иначе
		ОбъектДрайвера.ПолучитьОшибку(Результат.Ошибки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ОткрытьДенежныйЯщикАсинх()

Функция ПроверитьИННКассира(КассирИНН, Ошибки)
	Результат = Истина;
	Если Не ПустаяСтрока(КассирИНН) Тогда
		ОписаниеОшибки = "";
		Если Не ИННСоответствуетТребованиям(КассирИНН, Ложь, ОписаниеОшибки) Тогда			
			Результат	= Ложь;
			Ошибки 		= НСтр("ru = 'ИНН кассира некорректен (" + ОписаниеОшибки + ")'");			
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции //ПроверитьИННКассира(КассирИНН)

Функция ПолучитьВходныеПараметры_ККМ()
	Результат = Новый Структура("Кассир,КассирИНН,АдресРасчетов,МестоРасчетов");
	
	рФЛ = ПолучитьРеквизитыШапки(ПараметрыСеанса.Пользователь, "ФизЛицо,ФизЛицо.ИНН");
	
	Результат.Кассир	= ""+рФЛ.ФизЛицо;
	Результат.КассирИНН	= ""+рФЛ.ФизЛицо.ИНН;	
	
	Возврат Результат;
КонецФункции //ПолучитьВходныеПараметры_ККМ()
 

Функция ПолучитьСуммуДенежныхСредствВКассе(ФискальноеУстройство) Экспорт
	СуммаВКассе = 0;
	
	ДанныеККТ	= ПолучитьПараметрыККТ(ФискальноеУстройство);
	
	Если ДанныеККТ.Успешно И ДанныеККТ.Свойство("Данные") Тогда
		СуммаВКассе	= XMLЗначение(Тип("Число"), СтрЗаменить(ДанныеККТ.Данные.ПараметрыСмены.ОстатокНаличных, ",", "."));
	КонецЕсли;
	
	Возврат СуммаВКассе;
КонецФункции


Функция ВыемкаВнесениеДенежныхСредств(ФискальноеУстройство, ВидОперации, СуммаОперации = Неопределено)
	Результат = Новый Структура("Успешно,Ошибки,СуммаОперации", Ложь, "", 0);
	
	СуммаВКассе = ПолучитьСуммуДенежныхСредствВКассе(ФискальноеУстройство);
	
	Если СуммаОперации = Неопределено Тогда
		СуммаОперации = СуммаВКассе;
		Если НЕ ВвестиЧисло(СуммаОперации, Строка(ВидОперации), 15, 2) Тогда
			Возврат Результат;		
		КонецЕсли;		
	КонецЕсли;
	
	Если СуммаОперации = Неопределено Или СуммаОперации <= 0 Тогда
		Результат.Ошибки = "Введите значение суммы операции!";
		Возврат Результат;
	КонецЕсли;
	
	Если ВидОперации = "Выемка" И СуммаОперации > СуммаВКассе Тогда
		Результат.Ошибки = "Сумма выемки не может быть больше остатка в кассе!";
		Возврат Результат;
	КонецЕсли;
	
	Если ВидОперации = "Выемка" Тогда
		РезультатОперации = ВыемкаДенежныхСредств(ФискальноеУстройство, СуммаОперации);
	ИначеЕсли ВидОперации = "Внесение" Тогда
		РезультатОперации = ВнесениеДенежныхСредств(ФискальноеУстройство, СуммаОперации);
	КонецЕсли;
	
	РезультатОперации.Вставить("СуммаОперации", СуммаОперации);
	
	Возврат РезультатОперации;
	
КонецФункции

Функция ВыемкаДенежныхСредств(ФискальноеУстройство, СуммаОперации)
	
	Результат = Новый Структура("Успешно, Ошибки", Ложь, "");
	
	РезультатПодключения = ПроверитьПодключитьОборудование(ФискальноеУстройство);
	
	Если Не РезультатПодключения.Успешно Тогда
		Результат.Ошибки = РезультатПодключения.Ошибки;
		Возврат Результат;
	КонецЕсли;
	
	РевизияИнтерфейса		= РевизияИнтерфейса(ФискальноеУстройство);
	ОбъектДрайвера			= ПолучитьОбъектДрайвера(ФискальноеУстройство);
	ИД_Устройства			= ИдентификаторПодключенногоОборудования(ФискальноеУстройство);
	ВходныеПараметрыXML		= ВходныеПараметрыXML(Новый Структура, РевизияИнтерфейса);

	Попытка
		РезультатДрайвера = ОбъектДрайвера.НапечататьЧекВнесенияВыемки(ИД_Устройства, ВходныеПараметрыXML, -СуммаОперации);
		Если РезультатДрайвера Тогда
			Результат.Успешно = Истина;
		Иначе
			ОбъектДрайвера.ПолучитьОшибку(Результат.Ошибки);
		КонецЕсли;
	Исключение
		Результат.Ошибки=НСтр("ru='Ошибка вызова метода <ОбъектДрайвера.НапечататьЧекВнесенияВыемки>.'") + Символы.ПС + ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ВнесениеДенежныхСредств(ФискальноеУстройство, СуммаОперации)
	Возврат ВыемкаДенежныхСредств(ФискальноеУстройство, -СуммаОперации);
КонецФункции

Функция ПечатьСлипЧека(ФискальноеУстройство, ТекстСлипЧека, КоличествоСлипЧеков)
	
	Результат = Новый Структура("Успешно,Ошибки", Ложь, "");	
	
	РезультатПодключения	= ПроверитьПодключитьОборудование(ФискальноеУстройство);
	Если НЕ РезультатПодключения.Успешно Тогда
		Результат.Ошибки=РезультатПодключения.Ошибки;
		Возврат Результат;
	КонецЕсли;
	
	ИДУстройства			= ИдентификаторПодключенногоОборудования(ФискальноеУстройство);
	РевизияИнтерфейса		= РевизияИнтерфейса(ФискальноеУстройство);
	ОбъектДрайвера			= ПолучитьОбъектДрайвера(ФискальноеУстройство);	
	
	ДанныеСлипЧекаXML		= ПолучитьXMLДляПечатиСлипЧеков(ТекстСлипЧека, РевизияИнтерфейса);
	
	Для НомерСлипЧека = 1 По КоличествоСлипЧеков Цикл
		Попытка
			Результат.Успешно = ОбъектДрайвера.НапечататьТекстовыйДокумент(ИДУстройства, ДанныеСлипЧекаXML);
			Если НЕ Результат.Успешно Тогда				
				ОбъектДрайвера.ПолучитьОшибку(Результат.Ошибки);
			КонецЕсли;
		Исключение		
			Результат.Ошибки=НСтр("ru='Ошибка вызова метода <ОбъектДрайвера.НапечататьТекстовыйДокумент>.'") + Символы.ПС + ОписаниеОшибки();
		КонецПопытки;
	КонецЦикла;
	
	Возврат Результат;	
	
КонецФункции

Функция ПолучитьXMLДляПечатиСлипЧеков(ТекстСлипЧека, РевизияИнтерфейса) Экспорт
	
	// формируем пакет для печати подарочных сертификатов
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("Document");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Positions");
	
	Для НомерСтроки = 1 По СтрЧислоСтрок(ТекстСлипЧека) Цикл
			
		ВыделеннаяСтрока = СтрПолучитьСтроку(ТекстСлипЧека, НомерСтроки);
			
		ЗаписьXML.ЗаписатьНачалоЭлемента("TextString");
		ЗаписьXML.ЗаписатьАтрибут("Text", XMLСтрока(ВыделеннаяСтрока));
		ЗаписьXML.ЗаписатьКонецЭлемента();
			
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Результат = ЗаписьXML.Закрыть();
	
	Возврат Результат;
	
КонецФункции

Функция СтатусПоследнейСмены(ФискальноеУстройство) Экспорт	
	
	//Результат = Документы.КассоваяСмена(СтатусПоследнейСмены, ФискальноеУстройство);
	Результат = Новый Структура("Открыта", Ложь);	
	
	Возврат Результат;
КонецФункции

#КонецОбласти 

Функция ПолучитьЗначениеПараметра(СтруктураПараметров,Имя,ЗначениеПоУмолчанию=Неопределено) Экспорт
	Результат	= ЗначениеПоУмолчанию;
	Если ТипЗнч(СтруктураПараметров)=Тип("Структура") ИЛИ ТипЗнч(СтруктураПараметров)=Тип("ФиксированнаяСтруктура") Тогда
		ВремЗнач=Неопределено;
		Если СтруктураПараметров.Свойство(Имя,ВремЗнач) Тогда
			Результат	= ВремЗнач;		
		КонецЕсли; 
	ИначеЕсли ТипЗнч(СтруктураПараметров)=Тип("ДанныеФормыСтруктура") Тогда
		ВремЗнач=Неопределено;
		Если СтруктураПараметров.Свойство(Имя,ВремЗнач) Тогда
			Результат	= ВремЗнач;		
		КонецЕсли; 
	ИначеЕсли ТипЗнч(СтруктураПараметров)=Тип("Соответствие") ИЛИ ТипЗнч(СтруктураПараметров)=Тип("ФиксированноеСоответствие") Тогда
		ВремЗнач=СтруктураПараметров.Получить(Имя);
		Если ВремЗнач<>Неопределено Тогда
			Результат=ВремЗнач;		
		КонецЕсли;				
	КонецЕсли;
	Возврат Результат;
КонецФункции //ПолучитьЗначениеПараметра(СтруктураПараметров,Имя,ЗначениеПоУмолчанию=Неопределено) Экспорт

Функция ПробитьЧек(ЧекСсылка, ФискальноеУстройство, ДопПараметры = Неопределено) Экспорт
	
	Результат = Новый Структура("Успешно,Ошибки", Ложь, "");
		
	КодОперации	= Перечисления.КодыОперацийОстатки.Реализация;	
	
	рПодключения = ПроверитьПодключитьОборудование(ФискальноеУстройство);
	Если НЕ рПодключения.Успешно Тогда
		Результат.Ошибки = рПодключения.Ошибки;
		ЗаписатьВЛог("Фискализация чека", Результат.Ошибки, "Ошибка");
		Возврат Результат;
	КонецЕсли;
	
	ДатаСеанса			= ТекущаяДата();
	
	ИД_Устройства		= ИдентификаторПодключенногоОборудования(ФискальноеУстройство);
	РевизияИнтерфейса	= РевизияИнтерфейса(ФискальноеУстройство);
	ОбъектДрайвера		= ПолучитьОбъектДрайвера(ФискальноеУстройство);
	ДанныеККТ			= ПолучитьПараметрыККТ(ФискальноеУстройство);
	
	Если НЕ ДанныеККТ.Успешно Тогда
		МаркировкаКС.ДобавитьОшибки(Результат, ДанныеККТ);
		ЗаписатьВЛог("Фискализация чека", СтрСоединить(Результат.Ошибки,Символы.ПС), "Ошибка");
		Возврат Результат;	
	КонецЕсли; 
	
	СтруктураПараметрыККТ = ДанныеККТ.Данные.ПараметрыККТ;
	
	СтруктураПараметрыККТ.Вставить("РевизияИнтерфейса", РевизияИнтерфейса);
	СтруктураПараметрыККТ.Вставить("ИД_Устройства",		ИД_Устройства);
	
	ОбщиеПараметры		= ПараметрыОперацииФискализацииЧека();
	
	ОбщиеПараметры.КассаККМ = ПолучитьРеквизитШапки(ЧекСсылка, "КассаККМ");
	
	// чек на возврат
	Если КодОперации = Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя
		//Или КодОперации = Перечисления.КодыОперацийОстатки.ВозвратСдачиСертификатов 
		Тогда
		ОбщиеПараметры.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств;
	КонецЕсли;
	
	//// запишем фискальный признак в дополнительный реквизит (для чека коррекции)
	//Если пЧека.Свойство("ФискальныйПризнак") Тогда		
	//	ОбщиеПараметры.ДополнительныйРеквизит = пЧека.ФискальныйПризнак;		
	//КонецЕсли;	
	//// новая таблица оплат (для чека коррекции)
	//Если пЧека.Свойство("ТаблицаОплат") Тогда		
	//	ОбщиеПараметры.ТаблицаОплат = пЧека.ТаблицаОплат;		
	//КонецЕсли;	
		
	ОбщиеПараметры.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ОСН;
		
	// электронная отправка чека
	Если ПолучитьЗначениеПараметра(ДопПараметры, "ЭлектроннаяОтправкаЧека", Ложь) = Истина Тогда
		ОбщиеПараметры.Электронно		= Истина;
		ОбщиеПараметры.ПокупательEmail	= ДопПараметры.ПокупательEmail;
		//ОбщиеПараметры.ПокупательНомер	= ОбработатьНомерТелефона(ЭлектроннаяОтправкаЧека.Телефон);
	КонецЕсли;
	
	ЗаполнитьДанныеЧека(ОбщиеПараметры, ЧекСсылка);	
	
	ПараметрыФискализации 	= ПодготовитьДанныеФискализацииЧека(ОбщиеПараметры, СтруктураПараметрыККТ, ЧекСсылка);
	
	ИД_Устройства			= СтруктураПараметрыККТ.ИД_Устройства;
	
	Если НЕ ПараметрыФискализации.Результат Тогда
		Результат.Ошибки = "Не удалось подготовить параметры фискализации.";
		ЗаписатьВЛог("Фискализация чека", Результат.Ошибки, "Ошибка");
		Возврат Результат;
	КонецЕсли;
	
	Попытка
		Результат.Успешно = ОбъектДрайвера.СформироватьЧек(ИД_Устройства, ПараметрыФискализации.Электронно, ПараметрыФискализации.ДанныеЧекаXML, ПараметрыФискализации.РезультатОперацииXML); 
		ПараметрыФискализации.ДатаВремяЧека = ДатаСеанса;
	Исключение			
		Результат.Ошибки=НСтр("ru='Ошибка вызова метода <ОбъектДрайвера.СформироватьЧек>.'") + Символы.ПС + ОписаниеОшибки();
	КонецПопытки;
	
	Если Результат.Успешно Тогда  
		ЗаполнитьРезультатыФискализацияЧекаИзXMLПакета(ПараметрыФискализации);
		Результат.Вставить("ПараметрыФискализации", ПараметрыФискализации);
	Иначе		
		ОбъектДрайвера.ПолучитьОшибку(Результат.Ошибки);
	КонецЕсли;
	
	Если Не Результат.Успешно Тогда		
		ЗаписатьВЛог("Ошибки чеков", Результат.Ошибки, "Ошибка");
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьРезультатыФискализацияЧекаИзXMLПакета(ПараметрыФискализации)
	
	Если Не ПустаяСтрока(ПараметрыФискализации.РезультатОперацииXML) Тогда
		
		ЧтениеXML = Новый ЧтениеXML; 
		ЧтениеXML.УстановитьСтроку(ПараметрыФискализации.РезультатОперацииXML);
		ЧтениеXML.ПерейтиКСодержимому();
		
		Если ЧтениеXML.Имя = "DocumentOutputParameters" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			Если ЧтениеXML.Прочитать() И ЧтениеXML.Имя = "Parameters" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
				
				ПараметрыФискализации.НомерСменыККТ			= ЧтениеXML.ЗначениеАтрибута("ShiftNumber");
				ПараметрыФискализации.НомерЧекаККТ			= ЧтениеXML.ЗначениеАтрибута("CheckNumber");
				ПараметрыФискализации.НомерЧекаЗаСмену		= ЧтениеXML.ЗначениеАтрибута("ShiftClosingCheckNumber");
				ПараметрыФискализации.ФискальныйПризнак		= ЧтениеXML.ЗначениеАтрибута("FiscalSign");
				ПараметрыФискализации.АдресСайтаПроверки	= ЧтениеXML.ЗначениеАтрибута("AddressSiteInspections");
				
				ДатаВремяЧека = ЧтениеXML.ЗначениеАтрибута("DateTime");
				Если НЕ ПустаяСтрока(ДатаВремяЧека) Тогда
					ПараметрыФискализации.ДатаВремяЧека		= XMLЗначение(Тип("Дата"), ДатаВремяЧека);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыОперацииФискализацииЧека()
	
	ПараметрыЧека = Новый  Структура;
	
	ДанныеКассира = ПолучитьДанныеТекущегоКассира();
	
	ПараметрыЧека.Вставить("Кассир",			ДанныеКассира.Кассир); // ФИО лица и должность, осуществившего операцию.		
	ПараметрыЧека.Вставить("КассирИНН",			ПолучитьЗначениеПараметра(ДанныеКассира, "ИНН")); // Идентификационный номер налогоплательщика кассира, при наличии.	
	
	// Общие реквизиты для всех типов оборудования.
	ПараметрыЧека.Вставить("ДокументОснование",	Неопределено); // Ссылка,Обязательно. Документ по которому пробивается чек.
	ПараметрыЧека.Вставить("ИдентификаторФискальнойЗаписи", Неопределено); // Строка,Необязательно. Идентификатор фискальной записи. 
	ПараметрыЧека.Вставить("Организация"       , Неопределено); // Ссылка,Обязательно. Организация по которому пробивается чек.
	ПараметрыЧека.Вставить("ТорговыйОбъект"    , Неопределено); // Ссылка,Необязательно. Объект по которому пробивается чек.
	ПараметрыЧека.Вставить("Электронно"        , Ложь); // Булево,Обязательно - Чек будет предоставлен в электронной форме, без печати. Ложь-Значение по умолчанию.
	ПараметрыЧека.Вставить("ТипРасчета"        , Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств); // Обязательно.
	ПараметрыЧека.Вставить("Отправляет1СSMS"   , Ложь); // Булево,Обязательно - SMS отправляет средствами 1C.   Ложь-Значение по умолчанию.
	ПараметрыЧека.Вставить("Отправляет1СEmail" , Ложь); // Булево,Обязательно - Email отправляет средствами 1C. Ложь-Значение по умолчанию.
	
	// Системы налогообложения - "Перечисление.ТипыСистемНалогообложенияККТ"
	ПараметрыЧека.Вставить("СистемаНалогообложения", Перечисления.ТипыСистемНалогообложенияККТ.ОСН); // Обязательно. Заполняется значением по умолчанию.  
	ПараметрыЧека.Вставить("АдресРасчетов"     ); // Строка,Необязательно - Адрес расчетов (Тег 1009).
	ПараметрыЧека.Вставить("МестоРасчетов"     ); // Строка,Необязательно - Место расчетов (Тег 1187).
	ПараметрыЧека.Вставить("ОтправительEmail"  ); // Строка,Необязательно - Адрес электронной почты отправителя чека (Тег 1117).
	ПараметрыЧека.Вставить("ПокупательEmail"   ); // Строка,Необязательно - Адрес электронной почты покупателя.
	ПараметрыЧека.Вставить("ПокупательНомер"   ); // Строка,Необязательно - Телефонный номер покупателя. В формате +{Ц}.
	
	// Признак агента - "Перечисление.ПризнакиАгента", (ФФД, Тег 1057, Расшифровка - таблица 10)
	ПараметрыЧека.Вставить("ПризнакАгента"     , Неопределено); // Перечисление - Признак агента (Тег 1057).
	ПараметрыЧека.Вставить("ДанныеАгента"      , ПараметрыДанныеАгента());     // Структура,Заполнение необязательно - Данные агента.
	ПараметрыЧека.Вставить("ДанныеПоставщика"  , ПараметрыДанныеПоставщика()); // Структура,Заполнение необязательно - Данные поставщика.
	
	// Реквизиты начиная с ФФД 1.1 (Введены приказом от 9 апреля 2018 г. N ММВ-7-20/207@)
	ПараметрыЧека.Вставить("Получатель"         );  // Строка,Необязательно - Получатель (покупатель)	
	ПараметрыЧека.Вставить("ПолучательИНН"      );  // Строка,Необязательно - ИНН получателя (ИНН покупателя)	
	
	// Параметры необходимые для ФР
	ПараметрыЧека.Вставить("СерийныйНомер"       ); // Строка,Необязательно - Заводской номер ККМ (совместимость с ФР).
	// Параметры необходимые для чека ЕНВД на принтере чеков
	ПараметрыЧека.Вставить("ОрганизацияНазвание" ); // Строка,Необязательно - Название организации (Для чека ЕНВД).
	ПараметрыЧека.Вставить("ОрганизацияИНН"      ); // Строка,Необязательно - ИНН организации (Для чека ЕНВД).
	ПараметрыЧека.Вставить("ОрганизацияКПП"      ); // Строка,Необязательно - КПП организации (Для чека ЕНВД).
	ПараметрыЧека.Вставить("АдресМагазина"       ); // Строка,Необязательно - Адрес магазина (Для чека ЕНВД).
	ПараметрыЧека.Вставить("НаименованиеМагазина"); // Строка,Необязательно - Наименование магазина (Для чека ЕНВД).
	ПараметрыЧека.Вставить("НомерКассы"          ); // Строка,Необязательно - Номер кассы (Для чека ЕНВД).
	ПараметрыЧека.Вставить("НомерЧека"           ); // Строка,Необязательно - Номер чека  (Для чека ЕНВД).
	ПараметрыЧека.Вставить("НомерСмены"          ); // Строка,Необязательно - Номер смены (Для чека ЕНВД).
	ПараметрыЧека.Вставить("ДатаВремя", 	ТекущаяДата()); // ДатаВремя, Необязательно - Дата время в чеке (Для чека ЕНВД).
	ПараметрыЧека.Вставить("ТекстШапки"   , НСтр("ru='ДОБРО ПОЖАЛОВАТЬ!'"));   // Строка - заполняется значением по умолчанию. 
	ПараметрыЧека.Вставить("ТекстПодвала" , НСтр("ru='СПАСИБО ЗА ПОКУПКУ!'")); // Строка - заполняется значением по умолчанию. 
	ПараметрыЧека.Вставить("КопийЧека"    , 1); // Число,Необязательно - Сколько печатать копий чеков ЕНВД на принтере чеков.
	
	// Позиции чека для фискализациию
	ПараметрыЧека.Вставить("ПозицииЧека"  , Новый Массив()); // Массив элементов "Структура". Обязательно.
	// Таблица оплаты чека
	ПараметрыЧека.Вставить("ТаблицаОплат" , Новый Массив()); // Массив элементов "Структура". Обязательно.
	// Пример заполнения строки оплаты:
	// СтрокаОплаты = Новый Структура();
	// СтрокаОплаты.Вставить("ТипОплаты", ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Наличные")); // Наличные
	// СтрокаОплаты.Вставить("Сумма", СуммаВидаОплаты);
	// ПараметрыЧека.ТаблицаОплат.Добавить(СтрокаОплаты);
	
	// Параметры для печати чека по шаблону.
	ПараметрыЧека.Вставить("ШаблонЧека"            ); // Ссылка,Необязательно - Пользовательский шаблон для формирования чека.
	ПараметрыЧека.Вставить("КассаККМ"              ); // Ссылка,Необязательно - Касса ККМ. 
	ПараметрыЧека.Вставить("НефискальныеДокументы" , Новый Массив()); // Массив нефискальных документов. Необязательно.
	
	// Строка,Необязательно - Дополнительный реквизит чека (Тег 1192).
	ПараметрыЧека.Вставить("ДополнительныйРеквизит"  , Неопределено); 
	// Структура,Заполнение необязательно - дополнительный реквизит пользователя (Тег 1084).
	ПараметрыЧека.Вставить("ДополнительныйРеквизитПользователя", ПараметрыДополнительногоРеквизитаПользователя());
	
	ПараметрыЧека.Вставить("СформироватьЧекКоррекции", Ложь); // Булево,Необязательно - сформировать чек коррекции, только для ФФД 1.1.
	
	// Форматно-логический контроль - "ПеречислениеСсылка.СпособыФорматноЛогическогоКонтроля"
	ПараметрыЧека.Вставить("СпособФорматноЛогическогоКонтроля", Неопределено);     // Перечисление,Необязательно - Способ форматно-логического контроля. 
	ПараметрыЧека.Вставить("ДопустимоеРасхождениеФорматноЛогическогоКонтроля", 0.01); // Число,Необязательно - устанавливается значение по умолчанию. 
	ПараметрыЧека.Вставить("ИндивидуальныйРежимПодготовкиДанныхКПередачеВОФД", Ложь); // Булево,Необязательно - устанавливается значение по умолчанию. 
	ПараметрыЧека.Вставить("ЕстьПерсональныеДанные", Ложь); // Булево,Необязательно - Параметры чека содержат персональные данные.
	ПараметрыЧека.Вставить("СубъектПерсональныхДанных"); // Необязательно  - Физическое лицо, которое прямо или косвенно определено или определяемо с помощью персональных данных.
	
	ПараметрыЧека.Вставить("ЕдиныйЧек", Ложь);  // Булево,Необязательно - Одна фискальная операция привязана к нескольким документам.
	
	Возврат ПараметрыЧека; 
	
КонецФункции

Функция ПараметрыДанныеАгента() Экспорт
	
	// ФФД - Значения реквизита «данные агента» (тег 1223) указаны в таблице 22.
	ПараметрыДА = Новый Структура();
	
	ПлатежныйАгент = Новый Структура();
	ПлатежныйАгент.Вставить("Операция", Неопределено);  // Строка - Операция платежного агента.
	ПлатежныйАгент.Вставить("Телефон" , Неопределено);  // Строка - Телефон платежного агента. В формате +{Ц}.
	
	ПараметрыДА.Вставить("ПлатежныйАгент", ПлатежныйАгент);
	
	ОператорПеревода = Новый Структура();
	ОператорПеревода.Вставить("Телефон"     , Неопределено); // Строка - Телефон оператора перевода. В формате +{Ц}.
	ОператорПеревода.Вставить("Наименование", Неопределено); // Строка - Наименование оператора перевода.
	ОператорПеревода.Вставить("Адрес"       , Неопределено); // Строка - Адрес оператора перевода.
	ОператорПеревода.Вставить("ИНН"         , Неопределено); // Строка - ИНН оператора перевода.
	
	ПараметрыДА.Вставить("ОператорПеревода", ОператорПеревода);
	
	ОператорПоПриемуПлатежей = Новый Структура();
	ОператорПоПриемуПлатежей.Вставить("Телефон", Неопределено); // Строка - Телефон оператора по приему платежей. В формате +{Ц}.
	
	ПараметрыДА.Вставить("ОператорПоПриемуПлатежей", ОператорПоПриемуПлатежей);
	
	Возврат ПараметрыДА; 
	
КонецФункции

Функция ПараметрыДанныеПоставщика() Экспорт
	
	ПараметрыДП = Новый Структура();
	ПараметрыДП.Вставить("Телефон");      // Строка - Телефон поставщика. В формате +{Ц}.
	ПараметрыДП.Вставить("Наименование"); // Строка - Наименование поставщика.
	ПараметрыДП.Вставить("ИНН");          // Строка - ИНН поставщика.
	
	Возврат ПараметрыДП; 
	
КонецФункции

Функция ПараметрыДополнительногоРеквизитаПользователя() Экспорт
	
	ПараметрыДР = Новый Структура();
	ПараметрыДР.Вставить("Наименование"); // Строка,Необязательно - Наименование дополнительного реквизита пользователя (Тег 1085).
	ПараметрыДР.Вставить("Значение");     // Строка,Необязательно - Значение дополнительного реквизита пользователя (Тег 1086).
	
	Возврат ПараметрыДР; 
	
КонецФункции

Функция ПолучитьДанныеТекущегоКассира()
	Данные = Новый Структура("Кассир,ИНН", "", Неопределено);
	
	РеквФизЛица = ПолучитьРеквизитыШапки(ПараметрыСеанса.Пользователь, "ФизЛицо,ФизЛицо.ИНН");	
	
	Данные.Кассир	= ""+РеквФизЛица.ФизЛицо;
	Данные.ИНН		= РеквФизЛица.ФизЛицо_ИНН;
	
	Возврат Данные;

КонецФункции // ()
 
Функция ПодготовитьДанныеФискализацииЧека(ОбщиеПараметры, ПараметрыККТ, Ссылка)	
	
	ВерсияФФДККТ11		= ?(ПараметрыККТ.Свойство("ВерсияФФДККТ"), ПараметрыККТ.ВерсияФФДККТ, "1.0.5");
	ВерсияФФДККТ11		= ВерсияФФДККТ11 = "1.1"; // Признак ФФД 1.1
	
	ПараметрыФискализации = ПараметрыФискализацииЧека();   
	
	ПараметрыФискализации.РегистрационныйНомерККТ 	= ПолучитьЗначениеПараметра(ПараметрыККТ, "РегистрационныйНомерККТ", "");
	ПараметрыФискализации.ЗаводскойНомерФН  		= ПолучитьЗначениеПараметра(ПараметрыККТ, "ЗаводскойНомерФН", "");
	ПараметрыФискализации.ШиринаСтроки      		= ПолучитьЗначениеПараметра(ПараметрыККТ, "ШиринаСтроки", 32);
	ПараметрыФискализации.АвтономныйРежим   		= ПолучитьЗначениеПараметра(ПараметрыККТ, "ПризнакАвтономногоРежима", Ложь);
	ПараметрыФискализации.РевизияИнтерфейса			= ПараметрыККТ.РевизияИнтерфейса;
	
	ПараметрыФискализации.ТорговыйОбъект			= ОбщиеПараметры.ТорговыйОбъект;
	ПараметрыФискализации.ДополнительныйРеквизит   	= ОбщиеПараметры.ДополнительныйРеквизит;  
	ПараметрыФискализации.СубъектПерсональныхДанных	= ОбщиеПараметры.СубъектПерсональныхДанных;
	
	Если ОбщиеПараметры.Свойство("КорректируемыйДокумент") Тогда 
		ПараметрыФискализации.КорректируемыйДокумент = ОбщиеПараметры.КорректируемыйДокумент;
	КонецЕсли;
	
	ПараметрыФискализации.Организация				= ПолучитьРеквизитШапки(Ссылка, "КассаККМ.Организация");
	
	ПараметрыФискализации.Электронно   				= ОбщиеПараметры.Электронно;
	ПараметрыФискализации.Отправляет1СSMS  			= ОбщиеПараметры.Отправляет1СSMS;
	ПараметрыФискализации.Отправляет1СEmail			= ОбщиеПараметры.Отправляет1СEmail;
	ПараметрыФискализации.ВерсияФФДККТ11  			= ВерсияФФДККТ11;
	ПараметрыФискализации.ЕдиныйЧек    				= ОбщиеПараметры.ЕдиныйЧек;	
	
	ПараметрыФискализации.ДокументОснование			= Ссылка;
	
	ПараметрыФискализации.ТипДокумента				= Перечисления.ТипыФискальныхДокументовККТ.КассовыйЧек;
	
	СформироватьXMLПакетДляФискализацияЧека(ОбщиеПараметры, ПараметрыФискализации);
	
	Возврат ПараметрыФискализации;
	
КонецФункции

Функция ЗаполнитьДанныеЧека(ОбщиеПараметры, ЧекККМ)
	СуммыОплаты = Новый Структура("СуммаЭлектронно,СуммаПредоплата,СуммаПостоплата,СуммаНаличные,СуммаПредоставление", 0, 0, 0, 0, 0);
	
	#Если ТребуетсяКонтекстнаяПодсказка Тогда
	ЧекККМ = Документы.ОплатаЧерезККМ.СоздатьДокумент();
	#КонецЕсли
	
	ТипОплаты = ?(ЧекККМ.ВидОплаты = Перечисления.ВидыОплаты.БН, Перечисления.ТипыОплатЧекаККМ.ПлатежнаяКарта, Перечисления.ТипыОплатЧекаККМ.Наличные);
	
	ОбщиеПараметры.Вставить("СуммыОплаты", СуммыОплаты);
	
	Товары = Новый ТаблицаЗначений;
	Если ЧекККМ.ТипОплаты = Перечисления.ТипыОплатыЧерезККМ.ПолучениеАванса Тогда
		Товары = ПолучитьТаблицуАвансов(ЧекККМ);		
	ИначеЕсли ЧекККМ.ТипОплаты = Перечисления.ТипыОплатыЧерезККМ.ЗачетАванса Тогда				
	ИначеЕсли ЧекККМ.ТипОплаты = Перечисления.ТипыОплатыЧерезККМ.ОплатаЗаОтгруженныйТовар Тогда
		Товары = ПолучитьТаблицуТоваров(ЧекККМ);		
	КонецЕсли;
	
	ОбщиеПараметры.Вставить("Товары", Товары);	
	
	ДобавитьОплату(ТипОплаты, Товары.Итог("Всего"), СуммыОплаты);
	
	реквКонтрагента = ПолучитьРеквизитыШапки(ЧекККМ, "Контрагент.Код,Контрагент.Наименование,Контрагент.ИНН");
	Если реквКонтрагента.Контрагент_Код<>"SSP-0019" Тогда
		ОбщиеПараметры.Вставить("Получатель",		реквКонтрагента.Контрагент_Наименование);	
		ОбщиеПараметры.Вставить("ПолучательИНН",	реквКонтрагента.Контрагент_ИНН);	
	КонецЕсли; 
КонецФункции //ЗаполнитьДанныеЧека(ОбщиеПараметры, ЧекККМ)

Функция ПолучитьТаблицуАвансов(ЧекККМ)
	рШапки = ПолучитьРеквизитыШапки(ЧекККМ, "Контрагент,Всего,Контрагент.НулеваяСтавкаНДС");
	
	ТЗ = ПолучитьТовары_ОплатаЧерезККМ(ЧекККМ);
	ТЗ.Очистить();

	СтрокаТ = ТЗ.Добавить();
		
	СтрокаТ.НаименованиеТовара = "Аванс за товар от: "+ЧекККМ.Контрагент;
		
	СтрокаТ.Количество	= 1;
	СтрокаТ.Цена		= рШапки.Всего;			
	СтрокаТ.Всего		= рШапки.Всего;	
	СтрокаТ.СуммаСкидки = 0;	
	//+HELP-9616 20260512 Михайловский
	//вместо
	//СтрокаТ.СтавкаНДС	= ?(рШапки.Контрагент_НулеваяСтавкаНДС, Перечисления.СтавкиНДС.НДС0, Перечисления.СтавкиНДС.НДС20);
	СтрокаТ.СтавкаНДС	= ?(рШапки.Контрагент_НулеваяСтавкаНДС, Перечисления.СтавкиНДС.НДС0, Перечисления.СтавкиНДС.НДС22);
	//-HELP-9616 20260512 Михайловский
	ПроцентНДС = ПроцентНДСпоСтавке(СтрокаТ.СтавкаНДС);
	СтрокаТ.СуммаНДС	= СтрокаТ.Всего * ПроцентНДС / (1+ПроцентНДС);
	
	СтрокаТ.ЦенаСоСкидками  = (СтрокаТ.Всего - СтрокаТ.СуммаСкидки) / СтрокаТ.Количество;
		
	СтрокаТ.Секция		= 1;
	
	СтрокаТ.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.ПодарочныйСертификат; //Аванс
	
	Возврат ТЗ;
КонецФункции // ()
 

Функция ПолучитьТаблицуТоваров(ЧекККМ)
	Если ТипЗнч(ЧекККМ) = Тип("ДокументСсылка.ОплатаЧерезККМ") Тогда
		Возврат ПолучитьТовары_ОплатаЧерезККМ(ЧекККМ); 	 
	Иначе
		Возврат Новый ТаблицаЗначений;		
	КонецЕсли; 
КонецФункции //ПолучитьТаблицуТоваров(ЧекККМ)

Функция ПолучитьТовары_ОплатаЧерезККМ(ДокСсылка)
	Запрос=Новый ("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Номенклатура.Наименование 				КАК НаименованиеТовара,	
	|	Номенклатура.Родитель.СтавкаНДС 		КАК СтавкаНДС,
	|	Номенклатура.Родитель.ВидНоменклатуры	КАК ВидНоменклатуры,
	|   Количество,
	|	Всего/Количество						КАК ЦенаСоСкидками,
	|	Всего/Количество						КАК Цена,
	|	0					            		КАК СуммаСкидки,
	|	Всего									КАК Всего,
	|	Всего*0									КАК СуммаНДС,
	|
	|	1										КАК Секция
	|ИЗ
	|  Документ.ОплатаЧерезККМ.Товары
	|ГДЕ
	|	Ссылка = &ДокСсылка
	|";
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	Товары = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТЧ Из Товары Цикл
		ПроцентНДС = ПроцентНДСпоСтавке(СтрокаТЧ.СтавкаНДС);
		СтрокаТЧ.СуммаНДС = СтрокаТЧ.Всего * ПроцентНДС / (1+ПроцентНДС)
	КонецЦикла; 
	
	Возврат Товары;
КонецФункции // () 

//+HELP-9616 20260512 Михайловский
Функция УчетАванса(Чек)
	ЭтоЕстьАванс = Ложь; 
	Попытка                                    
		Если Чек.ТипОплаты = Перечисления.ТипыОплатыЧерезККМ.ПолучениеАванса Тогда
			ЭтоЕстьАванс = Истина;
		КонецЕсли;	
	Исключение
		//ничего не сообщаем
	КонецПопытки;
	Возврат ЭтоЕстьАванс;
КонецФункции //-HELP-9616 20260512 Михайловский	


Функция СформироватьXMLПакетДляФискализацияЧека(ОбщиеПараметры, ПараметрыФискализации) Экспорт
	
	ПозицииЧека  = ОбщиеПараметры.ПозицииЧека;
	ТаблицаОплат = ОбщиеПараметры.ТаблицаОплат;
	Электронно   = ОбщиеПараметры.Электронно;
	
	//+HELP-9616 20260512 Михайловский
	ЭтоАванс = Ложь;
	//если в ПФ нет док. осн.
	Попытка
		ЭтоАванс = УчетАванса(ПараметрыФискализации.ДокументОснование);
	Исключение
	КонецПопытки;	
	//-HELP-9616 20260512 Михайловский
	
	СуммыОплаты = ОбщиеПараметры.СуммыОплаты;
	
	СуммаЧека 			= 0;
	
	СуммаНаличные       = СуммыОплаты.СуммаНаличные;
	СуммаЭлектронно     = СуммыОплаты.СуммаЭлектронно;
	СуммаПредоплата     = СуммыОплаты.СуммаПредоплата;
	СуммаПостоплата     = СуммыОплаты.СуммаПостоплата;
	СуммаПредоставление = СуммыОплаты.СуммаПредоставление;
	
	ТипРасчета				= КодРасчетаДенежнымиСредствами(ОбщиеПараметры.ТипРасчета);
	СистемаНалогообложения 	= КодСистемыНалогообложенияККТ(ОбщиеПараметры.СистемаНалогообложения);	
		
	РевизияИнтерфейса		= ПараметрыФискализации.РевизияИнтерфейса;
	ШиринаСтроки			= ПараметрыФискализации.ШиринаСтроки;
	
		
	// Пакетная печать чека. Подготовка пакета.
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CheckPackage");
	
	Если РевизияИнтерфейса >= 3000 Тогда  // Версия стандарта 3.0 (ОФД 1.1)
		ЗаписьXML.ЗаписатьНачалоЭлемента("Parameters");
		ЗаписьXML.ЗаписатьАтрибут("CashierName",  XMLСтрока(ОбщиеПараметры.Кассир));
		
		
		ЗаписатьАрибутХМЛ(ЗаписьXML, ОбщиеПараметры, "CashierINN", 	"КассирИНН");		
		
		ЗаписьXML.ЗаписатьАтрибут("OperationType",		XMLСтрока(ТипРасчета));
		ЗаписьXML.ЗаписатьАтрибут("TaxationSystem" , 	XMLСтрока(СистемаНалогообложения));		
		
		Если Не ПустаяСтрока(ОбщиеПараметры.ОтправительEmail) И Электронно Тогда // Отправитель Email указывается только для Электронно.
			ЗаписьXML.ЗаписатьАтрибут("SenderEmail", XMLСтрока(ОбщиеПараметры.ОтправительEmail));
		КонецЕсли;
		
		
		ЗаписатьАрибутХМЛ(ЗаписьXML, ОбщиеПараметры, "SaleAddress",		"АдресРасчетов");
		ЗаписатьАрибутХМЛ(ЗаписьXML, ОбщиеПараметры, "SaleLocation",	"МестоРасчетов");
		
		
		// Email отправляет средствами 1C
		Если ОбщиеПараметры.Свойство("Отправляет1СEmail") И НЕ ОбщиеПараметры.Отправляет1СEmail Тогда
			ЗаписьXML.ЗаписатьАтрибут("CustomerEmail", XMLСтрока(?(ОбщиеПараметры.Свойство("ПокупательEmail"), ОбщиеПараметры.ПокупательEmail, "")));
		КонецЕсли;
		// SMS отправляет средствами 1C
		Если ОбщиеПараметры.Свойство("Отправляет1СSMS") И НЕ ОбщиеПараметры.Отправляет1СSMS Тогда
			ПокупательНомер = ?(ОбщиеПараметры.Свойство("ПокупательНомер"), ОбщиеПараметры.ПокупательНомер, "");
			Если Не ПустаяСтрока(ПокупательНомер) И Лев(ПокупательНомер, 1) <> "+" Тогда
				ПокупательНомер = "+" + ПокупательНомер;
			КонецЕсли;
			ЗаписьXML.ЗаписатьАтрибут("CustomerPhone", XMLСтрока(ПокупательНомер));
		КонецЕсли;
		
		ЗаписатьАрибутХМЛ(ЗаписьXML, ОбщиеПараметры, "CustomerInfo",	"Получатель");		
		ЗаписатьАрибутХМЛ(ЗаписьXML, ОбщиеПараметры, "CustomerINN",		"ПолучательИНН");		
		
		Если ОбщиеПараметры.Свойство("ПризнакАгента") И НЕ ПустаяСтрока(ОбщиеПараметры.ПризнакАгента) Тогда
			ПризнакАгента = КодПризнакаАгента(ОбщиеПараметры.ПризнакАгента);
			ЗаписьXML.ЗаписатьАтрибут("AgentType", XMLСтрока(ПризнакАгента));
		КонецЕсли;
		
		ЗаписатьАрибутХМЛ(ЗаписьXML, ОбщиеПараметры, "AdditionalAttribute",		"ДополнительныйРеквизит");		
		
		Если ОбщиеПараметры.Свойство("ДанныеКоррекции") Тогда
			ЗаписатьДанныеКоррекции(ЗаписьXML, ОбщиеПараметры.ДанныеКоррекции);
		КонецЕсли;
		
		Если ОбщиеПараметры.Свойство("ДополнительныйРеквизитПользователя") Тогда
			ЗаписатьДополнительныйРеквизитПользователя(ЗаписьXML, ОбщиеПараметры.ДополнительныйРеквизитПользователя);
		КонецЕсли;
		
		ЗаписатьДанныеАгента(ЗаписьXML, 	ОбщиеПараметры.ДанныеАгента, 		РевизияИнтерфейса);
		ЗаписатьДанныеПоставщика(ЗаписьXML, ОбщиеПараметры.ДанныеПоставщика,	РевизияИнтерфейса);
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		// Табличная часть Товары
		Товары = ПолучитьЗначениеПараметра(ОбщиеПараметры, "Товары", Новый ТаблицаЗначений);
		Если Товары.Количество() > 0 Тогда		 
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Positions");
			Для Каждого СтрокаТЧ Из Товары Цикл
				ПризнакиФискСтроки = ПолучитьПризнакиФискальнойСтроки(СтрокаТЧ.ВидНоменклатуры);
				
				ДанныеСтроки = Новый Структура;
				ДанныеСтроки.Вставить("ПризнакСпособаРасчета",	КодПризнакаСпособаРасчета(ПризнакиФискСтроки.ПризнакСпособаРасчета));
				ДанныеСтроки.Вставить("ПризнакПредметаРасчета", КодПризнакаПредметаРасчета(ПризнакиФискСтроки.ПризнакПредметаРасчета, РевизияИнтерфейса));				
				
				СтавкаНДС = СтрокаТЧ.СтавкаНДС;
				
				Если СтрокаТЧ.Всего > 0 Тогда // Фискальная строка
					
					Если СтрокаТЧ.Цена = 0 И СтрокаТЧ.Сумма > 0 И СтрокаТЧ.Количество > 0 Тогда
						ЦенаСоСкидками = Окр(СтрокаТЧ.Сумма / СтрокаТЧ.Количество, 2); 
					Иначе
						ЦенаСоСкидками = СтрокаТЧ.Цена; 
					КонецЕсли;					
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("FiscalString");
					
					//Если СтрокаТЧ.ПодарочныйСертификат.Пустая() Тогда
						//НаименованиеТовара = ""+СтрокаТЧ.Номенклатура;
					//Иначе
					//	НаименованиеТовара = СтрокаТЧ.Номенклатура.Наименование + Символы.ПС + СтрокаТЧ.ПодарочныйСертификат.Наименование;
					//КонецЕсли;
					
					ЗаписьXML.ЗаписатьАтрибут("Name"              , XMLСтрока(СтрокаТЧ.НаименованиеТовара));// Наименование товара.
					ЗаписьXML.ЗаписатьАтрибут("Quantity"          , XMLСтрока(СтрокаТЧ.Количество)); 		// Количество товара.
					ЗаписьXML.ЗаписатьАтрибут("PriceWithDiscount" , XMLСтрока(СтрокаТЧ.ЦенаСоСкидками)); 	// Цена единицы товара с учетом скидок/наценок.
					ЗаписьXML.ЗаписатьАтрибут("AmountWithDiscount", XMLСтрока(СтрокаТЧ.Всего)); 			// Конечная сумма по позиции чека с учетом всех скидок/наценок.
					ЗаписьXML.ЗаписатьАтрибут("DiscountAmount"    , XMLСтрока(СтрокаТЧ.СуммаСкидки));		// Сумма скидок и наценок.
					ЗаписьXML.ЗаписатьАтрибут("Department"        , XMLСтрока(СтрокаТЧ.Секция));			// Отдел, по которому ведется продажа
					
					ЗначениеСтавкаНДС = "none";					
					Если ЗначениеЗаполнено(СтавкаНДС) И СтавкаНДС <> Перечисления.СтавкиНДС.БезНДС Тогда
						//+HELP-9616 20260512 Михайловский
						//вместо
						//ЗначениеСтавкаНДС = ""+100*ПроцентНДСпоСтавке(СтавкаНДС);
						Если (КодПризнакаСпособаРасчета(ПризнакиФискСтроки.ПризнакСпособаРасчета) = 3) ИЛИ ЭтоАванс Тогда
							//аванс
							ЗначениеСтавкаНДС = СокрЛП(100*ПроцентНДСпоСтавке(СтавкаНДС)) + "/" + СокрЛП(100 + (100*ПроцентНДСпоСтавке(СтавкаНДС)));
						Иначе
							ЗначениеСтавкаНДС = ""+100*ПроцентНДСпоСтавке(СтавкаНДС);
						КонецЕсли;	
						//-HELP-9616 20260512 Михайловский
					КонецЕсли;
					
					ЗаписьXML.ЗаписатьАтрибут("VATRate", XMLСтрока(ЗначениеСтавкаНДС)); // Ставка НДС
					
					Если ЗначениеЗаполнено(СтрокаТЧ.СуммаНДС) Тогда
						ЗаписьXML.ЗаписатьАтрибут("VATAmount", XMLСтрока(СтрокаТЧ.СуммаНДС));
					КонецЕсли;
					
					ЗаписатьАрибутХМЛ(ЗаписьXML, ДанныеСтроки, "PaymentMethod", 		"ПризнакСпособаРасчета");
					ЗаписатьАрибутХМЛ(ЗаписьXML, ДанныеСтроки, "CalculationSubject",	"ПризнакПредметаРасчета");
					
					ПризнакАгентаПоПредметуРасчета = ПолучитьЗначениеПараметра(ДанныеСтроки, "ПризнакАгентаПоПредметуРасчета");
					Если ЗначениеЗаполнено(ПризнакАгентаПоПредметуРасчета) Тогда
						Код = КодПризнакаАгента(ПризнакАгентаПоПредметуРасчета);
						ЗаписьXML.ЗаписатьАтрибут("CalculationAgent", XMLСтрока(Код));
					КонецЕсли;					
					
					ЗаписатьАрибутХМЛ(ЗаписьXML, ДанныеСтроки, "MeasurementUnit", 		"ЕдиницаИзмерения");					
					ЗаписатьАрибутХМЛ(ЗаписьXML, ДанныеСтроки, "CountryOfOrigin", 		"КодСтраныПроисхождения");
					ЗаписатьАрибутХМЛ(ЗаписьXML, ДанныеСтроки, "CustomsDeclaration",	"НомерТаможеннойДекларации");
					ЗаписатьАрибутХМЛ(ЗаписьXML, ДанныеСтроки, "ExciseAmount",		 	"СуммаАкциза");
					ЗаписатьАрибутХМЛ(ЗаписьXML, ДанныеСтроки, "AdditionalAttribute",	"ДополнительныйРеквизит");				
					
					
					//ЗаписатьДанныеКодаТоварнойНоменклатуры(ЗаписьXML, ТекущаяПозиция, ПараметрыФискализации);
					//ЗаписатьДанныеАгента(ЗаписьXML, ТекущаяПозиция.ДанныеАгента, РевизияИнтерфейса);
					//ЗаписатьДанныеПоставщика(ЗаписьXML, ТекущаяПозиция.ДанныеПоставщика, РевизияИнтерфейса);
					
					ЗаписьXML.ЗаписатьКонецЭлемента();
					
					СуммаЧека = СуммаЧека + СтрокаТЧ.Всего;					
				КонецЕсли;
				
			КонецЦикла;
			
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		// Таблица оплат
		Если ТаблицаОплат <> Неопределено Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Payments");
			ЗаписьXML.ЗаписатьАтрибут("Cash", 				XMLСтрока(СуммаНаличные));
			ЗаписьXML.ЗаписатьАтрибут("ElectronicPayment", 	XMLСтрока(СуммаЭлектронно));
			ЗаписьXML.ЗаписатьАтрибут("PrePayment", 		XMLСтрока(СуммаПредоплата));
			ЗаписьXML.ЗаписатьАтрибут("PostPayment", 		XMLСтрока(СуммаПостоплата));
			ЗаписьXML.ЗаписатьАтрибут("Barter", 			XMLСтрока(СуммаПредоставление));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
	КонецЕсли;
	
	ОплатаНеНаличными = СуммаЭлектронно + СуммаПостоплата + СуммаПредоплата + СуммаПредоставление; 
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ПараметрыФискализации.ДанныеЧекаXML = ЗаписьXML.Закрыть();
	
	ПараметрыФискализации.ТипРасчета 					= ОбщиеПараметры.ТипРасчета;
	
	ПараметрыФискализации.СуммаЧека 					= СуммаЧека;
	ПараметрыФискализации.ОплатаНаличные    			= ?(СуммаНаличные + ОплатаНеНаличными > СуммаЧека, СуммаЧека - ОплатаНеНаличными, СуммаНаличные); 
	ПараметрыФискализации.ОплатаЭлектронно  			= СуммаЭлектронно;
	ПараметрыФискализации.ОплатаПостоплата				= СуммаПостоплата;
	ПараметрыФискализации.ОплатаПредоплата  			= СуммаПредоплата;
	ПараметрыФискализации.ОплатаВстречноеПредоставление = СуммаПредоставление;
	
КонецФункции

Функция ЗаписатьАрибутХМЛ(ЗаписьXML, Данные, ИмяАтрибута, ИмяПоля)
	ТекЗнач = ПолучитьЗначениеПараметра(Данные, ИмяПоля);
	Если ЗначениеЗаполнено(ТекЗнач) Тогда
		ЗаписьXML.ЗаписатьАтрибут(ИмяАтрибута, XMLСтрока(ТекЗнач));
	КонецЕсли;
КонецФункции //ЗаписатьАрибутХМЛ(ЗаписьXML, Данные, ИмяПоля, ИмяАтрибута)
 

Функция ПараметрыФискализацииЧека() Экспорт
	
	ПараметрыФискализации = Новый Структура();

	ПараметрыФискализации.Вставить("Кассир");
	ПараметрыФискализации.Вставить("ДокументОснование");
	ПараметрыФискализации.Вставить("ИдентификаторФискальнойЗаписи");
	
	ПараметрыФискализации.Вставить("Организация");
	ПараметрыФискализации.Вставить("ТорговыйОбъект");
	ПараметрыФискализации.Вставить("КорректируемыйДокумент");
	ПараметрыФискализации.Вставить("СубъектПерсональныхДанных");
	
	ПараметрыФискализации.Вставить("ТипРасчета");
	ПараметрыФискализации.Вставить("ТипДокумента");
	ПараметрыФискализации.Вставить("ТипИнкассации");
	                                                
	ПараметрыФискализации.Вставить("РевизияИнтерфейса");
	ПараметрыФискализации.Вставить("ШиринаСтроки");
	ПараметрыФискализации.Вставить("РегистрационныйНомерККТ");
	ПараметрыФискализации.Вставить("ЗаводскойНомерФН"); 
	ПараметрыФискализации.Вставить("ДополнительныйРеквизит");
	
	ПараметрыФискализации.Вставить("НомерСменыККТ"   , 0); // Номер смены.
	ПараметрыФискализации.Вставить("НомерЧекаККТ"    , 0); // Номер фискального чека.
	ПараметрыФискализации.Вставить("НомерЧекаЗаСмену", 0); // Номер чека за смену.
	ПараметрыФискализации.Вставить("ДатаВремяЧека"); // Дата и время фискализации чека на ККТ.
	
	ПараметрыФискализации.Вставить("СуммаЧека", 0);
	ПараметрыФискализации.Вставить("ОплатаНаличные" , 0);                   
	ПараметрыФискализации.Вставить("ОплатаЭлектронно", 0);
	ПараметрыФискализации.Вставить("ОплатаПредоплата", 0);  
	ПараметрыФискализации.Вставить("ОплатаПостоплата", 0);
	ПараметрыФискализации.Вставить("ОплатаВстречноеПредоставление", 0);
	
	ПараметрыФискализации.Вставить("ФискальныйПризнак" , ""); // Фискальный признак документа.
	ПараметрыФискализации.Вставить("АдресСайтаПроверки", ""); // Адрес сайта проверки ФНС.
	
	ПараметрыФискализации.Вставить("Электронно"       , Ложь);
	ПараметрыФискализации.Вставить("Отправляет1СSMS"  , Ложь);
	ПараметрыФискализации.Вставить("Отправляет1СEmail", Ложь);
	ПараметрыФискализации.Вставить("АвтономныйРежим"  , Ложь);
	
	ПараметрыФискализации.Вставить("ДанныеЧекаXML");
	ПараметрыФискализации.Вставить("РезультатОперацииXML");
	ПараметрыФискализации.Вставить("ТекстСообщения");
	
	ПараметрыФискализации.Вставить("ЧекКоррекцииСторно");
	ПараметрыФискализации.Вставить("СформироватьЧекКоррекции", Ложь);
	
	ПараметрыФискализации.Вставить("НеприменениеККТ", Истина);
	ПараметрыФискализации.Вставить("ВерсияФФДККТ11" , Ложь);
	
	ПараметрыФискализации.Вставить("Результат", Истина);
	ПараметрыФискализации.Вставить("ОперацияЗаписана", Истина);
	ПараметрыФискализации.Вставить("ТекстОшибки");
	
	ПараметрыФискализации.Вставить("ЕдиныйЧек", Ложь);
	
	Возврат ПараметрыФискализации;
	
КонецФункции

Процедура ДобавитьОплату(ТипОплаты, Сумма, Суммы)	
	
	Если  ТипОплаты = Перечисления.ТипыОплатЧекаККМ.ПлатежнаяКарта 
		ИЛИ ТипОплаты = Перечисления.ТипыОплатЧекаККМ.ПлатежнаяСистема 
		ИЛИ ТипОплаты = Перечисления.ТипыОплатЧекаККМ.БанковскийПлатеж 
		Тогда
		
		Суммы.СуммаЭлектронно = Суммы.СуммаЭлектронно + Сумма;
		
	ИначеЕсли ТипОплаты = Перечисления.ТипыОплатЧекаККМ.ЗачетАванса
		Или ТипОплаты = Перечисления.ТипыОплатЧекаККМ.ПодарочныйСертификат
		Тогда
		
		Суммы.СуммаПредоплата = Суммы.СуммаПредоплата + Сумма;
		
	ИначеЕсли ТипОплаты = Перечисления.ТипыОплатЧекаККМ.ВРассрочку 
		ИЛИ ТипОплаты = Перечисления.ТипыОплатЧекаККМ.БанковскийКредит Тогда
		
		Суммы.СуммаПостоплата = Суммы.СуммаПостоплата + Сумма;			
		//ИначеЕсли ТипОплаты = Перечисления.ТипыОплатыККТ.ВстречноеПредоставление Тогда
		//СуммаПредоставление = СуммаПредоставление + ТаблицаОплат[ИндексОплаты].Сумма;
	Иначе
		Суммы.СуммаНаличные = Суммы.СуммаНаличные + Сумма;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПризнакиФискальнойСтроки(ВидНоменклатуры)
	
	Результат = Новый Структура("ПризнакСпособаРасчета,ПризнакПредметаРасчета");
	
	Если ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Товар Тогда
		Результат.ПризнакСпособаРасчета		= Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
		Результат.ПризнакПредметаРасчета	= Перечисления.ПризнакиПредметаРасчета.Товар;
		
	ИначеЕсли ВидНоменклатуры = Перечисления.ВидыНоменклаутры.ПодарочныйСертификат Тогда
		Результат.ПризнакСпособаРасчета		= Перечисления.ПризнакиСпособаРасчета.Аванс;
		Результат.ПризнакПредметаРасчета	= Перечисления.ПризнакиПредметаРасчета.Платеж;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьДанныеАгента(ЗаписьXML, ДанныеАгента, РевизияИнтерфейса = 0)
	
	Если РевизияИнтерфейса >= 3000 Тогда  // Версия стандарта 3.0 (ОФД 1.1)
		ЗаписьXML.ЗаписатьНачалоЭлемента("AgentData");
		Если Не ПустаяСтрока(ДанныеАгента.ПлатежныйАгент.Операция) Тогда // Операция платежного агента
			ЗаписьXML.ЗаписатьАтрибут("AgentOperation" , XMLСтрока(ДанныеАгента.ПлатежныйАгент.Операция));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеАгента.ПлатежныйАгент.Телефон) Тогда // Телефон платежного агента
			ЗаписьXML.ЗаписатьАтрибут("AgentPhone" , XMLСтрока(ДанныеАгента.ПлатежныйАгент.Телефон));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеАгента.ОператорПоПриемуПлатежей.Телефон) Тогда // Телефон оператора по приему платежей
			ЗаписьXML.ЗаписатьАтрибут("PaymentProcessorPhone", XMLСтрока(ДанныеАгента.ОператорПоПриемуПлатежей.Телефон));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеАгента.ОператорПеревода.Телефон) Тогда // Телефон оператора перевода
			ЗаписьXML.ЗаписатьАтрибут("AcquirerOperatorPhone" , XMLСтрока(ДанныеАгента.ОператорПеревода.Телефон));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеАгента.ОператорПеревода.Наименование) Тогда // Наименование оператора перевода
			ЗаписьXML.ЗаписатьАтрибут("AcquirerOperatorName" , XMLСтрока(ДанныеАгента.ОператорПеревода.Наименование));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеАгента.ОператорПеревода.Адрес) Тогда // Адрес оператора перевода
			ЗаписьXML.ЗаписатьАтрибут("AcquirerOperatorAddress" , XMLСтрока(ДанныеАгента.ОператорПеревода.Адрес));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеАгента.ОператорПеревода.ИНН) Тогда // ИНН оператора перевода
			ЗаписьXML.ЗаписатьАтрибут("AcquirerOperatorINN" , XMLСтрока(ДанныеАгента.ОператорПеревода.ИНН));
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	Иначе
		ЗаписьXML.ЗаписатьНачалоЭлемента("AgentData");
		Если Не ПустаяСтрока(ДанныеАгента.ПлатежныйАгент.Операция) Тогда
			ЗаписьXML.ЗаписатьАтрибут("PayingAgentOperation" , XMLСтрока(ДанныеАгента.ПлатежныйАгент.Операция));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеАгента.ПлатежныйАгент.Телефон) Тогда
			ЗаписьXML.ЗаписатьАтрибут("PayingAgentPhone" , XMLСтрока(ДанныеАгента.ПлатежныйАгент.Телефон));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеАгента.ОператорПоПриемуПлатежей.Телефон) Тогда
			ЗаписьXML.ЗаписатьАтрибут("ReceivePaymentsOperatorPhone" , XMLСтрока(ДанныеАгента.ОператорПоПриемуПлатежей.Телефон));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеАгента.ОператорПеревода.Телефон) Тогда
			ЗаписьXML.ЗаписатьАтрибут("MoneyTransferOperatorPhone" , XMLСтрока(ДанныеАгента.ОператорПеревода.Телефон));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеАгента.ОператорПеревода.Наименование) Тогда
			ЗаписьXML.ЗаписатьАтрибут("MoneyTransferOperatorName" , XMLСтрока(ДанныеАгента.ОператорПеревода.Наименование));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеАгента.ОператорПеревода.Адрес) Тогда
			ЗаписьXML.ЗаписатьАтрибут("MoneyTransferOperatorAddress" , XMLСтрока(ДанныеАгента.ОператорПеревода.Адрес));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеАгента.ОператорПеревода.ИНН) Тогда
			ЗаписьXML.ЗаписатьАтрибут("MoneyTransferOperatorVATIN" , XMLСтрока(ДанныеАгента.ОператорПеревода.ИНН));
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьДанныеКоррекции(ЗаписьXML, ДанныеКоррекции)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CorrectionData");
	ТипКоррекции = ?(ПустаяСтрока(ДанныеКоррекции.ТипКоррекции), 0, ДанныеКоррекции.ТипКоррекции);   
	ЗаписьXML.ЗаписатьАтрибут("Type",  XMLСтрока(ДанныеКоррекции.ТипКоррекции));
	Если Не ПустаяСтрока(ДанныеКоррекции.ДатаКоррекции) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Date",  XMLСтрока(НачалоДня(ДанныеКоррекции.ДатаКоррекции)));
	КонецЕсли;
	Если Не ПустаяСтрока(ДанныеКоррекции.НомерПредписания) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Number",  XMLСтрока(ДанныеКоррекции.НомерПредписания));
	КонецЕсли;
	Если Не ПустаяСтрока(ДанныеКоррекции.ОписаниеКоррекции) Тогда
		ЗаписьXML.ЗаписатьАтрибут("Description",  XMLСтрока(ДанныеКоррекции.ОписаниеКоррекции));
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ЗаписатьДанныеПоставщика(ЗаписьXML, ДанныеПоставщика, РевизияИнтерфейса = 0)
	
	Если РевизияИнтерфейса >= 3000 Тогда // Версия стандарта 3.0 (ОФД 1.1)
		ЗаписьXML.ЗаписатьНачалоЭлемента("VendorData");
		Если Не ПустаяСтрока(ДанныеПоставщика.Телефон) Тогда // Телефон поставщика
			ЗаписьXML.ЗаписатьАтрибут("VendorPhone" , XMLСтрока(ДанныеПоставщика.Телефон));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеПоставщика.Наименование) Тогда // Наименование поставщика
			ЗаписьXML.ЗаписатьАтрибут("VendorName" , XMLСтрока(ДанныеПоставщика.Наименование));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеПоставщика.ИНН) Тогда // ИНН поставщика
			ЗаписьXML.ЗаписатьАтрибут("VendorINN" , XMLСтрока(ДанныеПоставщика.ИНН));
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	Иначе
		ЗаписьXML.ЗаписатьНачалоЭлемента("PurveyorData");
		Если Не ПустаяСтрока(ДанныеПоставщика.Телефон) Тогда
			ЗаписьXML.ЗаписатьАтрибут("PurveyorPhone" , XMLСтрока(ДанныеПоставщика.Телефон));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеПоставщика.Наименование) Тогда
			ЗаписьXML.ЗаписатьАтрибут("PurveyorName" , XMLСтрока(ДанныеПоставщика.Наименование));
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеПоставщика.ИНН) Тогда
			ЗаписьXML.ЗаписатьАтрибут("PurveyorVATIN" , XMLСтрока(ДанныеПоставщика.ИНН));
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьДополнительныйРеквизитПользователя(ЗаписьXML, ДополнительныйРеквизитПользователя);
	
	Если ПустаяСтрока(ДополнительныйРеквизитПользователя.Наименование) 
		И ПустаяСтрока(ДополнительныйРеквизитПользователя.Значение) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("UserAttribute");
	Если Не ПустаяСтрока(ДополнительныйРеквизитПользователя.Наименование) Тогда // Наименование дополнительного реквизита пользователя.
		ЗаписьXML.ЗаписатьАтрибут("Name" , XMLСтрока(ДополнительныйРеквизитПользователя.Наименование));
	КонецЕсли;
	Если Не ПустаяСтрока(ДополнительныйРеквизитПользователя.Значение) Тогда // Значение дополнительного реквизита пользователя.
		ЗаписьXML.ЗаписатьАтрибут("Value", XMLСтрока(ДополнительныйРеквизитПользователя.Значение));
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Функция ПолучитьКассуПоОборудованию(ТорговоеОборудование)
	Результат = Новый Структура("Успешно,КассаККМ,Параметры", Ложь, Справочники.Кассы, Новый Структура);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КассаККМ,	
	|	Параметры
	|ИЗ
	|	РегистрСведений.ТорговоеОборудование
	|ГДЕ
	|	МодельТорговогоОборудования = &ТорговоеОборудование
	|	И Подключено
	|	И Компьютер = &Компьютер
	|";

	Запрос.УстановитьПараметр("Компьютер", ВРег(СокрЛП(ИмяКомпьютера())));
	Запрос.УстановитьПараметр("ТорговоеОборудование", ТорговоеОборудование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.КассаККМ) Тогда
		Результат.Успешно 	= Истина;
		Результат.КассаККМ	= Выборка.КассаККМ;
		Если ЗначениеЗаполнено(Выборка.Параметры) Тогда
			Результат.Параметры = ЗначениеИзСтрокиВнутр(Выборка.Параметры);		
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ПолучитьКассуПоОборудованию(ТорговоеОборудование)
 
