
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Ответ = Вопрос("Документы будут сформированы в ЧЗ заново. Все результаты по выбранным документам будут потеряны. Продолжить ?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);	
	Если Ответ <> КодВозвратаДиалога.Да Тогда Возврат КонецЕсли;
	
	рПроверки = ПроверитьДокументыКОбработке(ПараметрКоманды);
	
	МаркировкаКС.ВывестиОшибки(рПроверки);
		
	Для Каждого ДокСсылка Из рПроверки.ДокументыКОбработке Цикл
		рОбработки = МаркировкаВС.ОтправитьНаПовторнуюОбработку(ДокСсылка);		
		
		Если рОбработки.Успешно Тогда
			ОповеститьОбИзменении(ДокСсылка);
			Оповестить("ИзмененСтатус", , ДокСсылка);	
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьДокументыКОбработке(мСсылки)
	Результат = Новый Структура("Ошибки,ДокументыКОбработке", Новый Массив, Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка,
	|	Статус,
	|	Проведен
	|ИЗ
	|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ
	|ГДЕ
	|	Ссылка В (&мСсылки)
	|";
	Запрос.УстановитьПараметр("мСсылки", мСсылки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Проведен Тогда
			Если Выборка.Статус = Перечисления.СтатусыДокументовМаркировки.ОшибкаОбработки Тогда
				Результат.ДокументыКОбработке.Добавить(Выборка.Ссылка);
			Иначе
				ТекстОшибки = СтрШаблон("Недопустимый статус документа: '%1', требуется 'Ошибка обработки', фактический статус: '%2'", Выборка.Ссылка, Выборка.Статус);
				Результат.Ошибки.Добавить(ТекстОшибки);
			КонецЕсли;
		Иначе
			ТекстОшибки = СтрШаблон("Документ: '%1' не проведен !", Выборка.Ссылка);			
			Результат.Ошибки.Добавить(ТекстОшибки);
		КонецЕсли;		
	КонецЦикла; 	
	
	Возврат Результат;
КонецФункции //ПроверитьДокументыКОбработке(мСсылки)
 