
&НаСервере
Процедура АктивныеЗадачиНаСервере()          
	Если Список.Отбор.Элементы.Количество() = 0 Тогда
		НовыйЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Выполнена");
		НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементОтбора.ПравоеЗначение = Ложь;
		НовыйЭлементОтбора.Использование = Истина;
	Иначе 
		Список.Отбор.Элементы.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АктивныеЗадачи(Команда)
	АктивныеЗадачиНаСервере();
КонецПроцедуры
