
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	КэшОстатков = Новый Соответствие;
	
	СписокНоменклатуры = Объект.Товары.Выгрузить().ВыгрузитьКолонку("Номенклатура");
	
	Для каждого Комплектующее из Объект.Комплектующие.Выгрузить().ВыгрузитьКолонку("Номенклатура") Цикл
		СписокНоменклатуры.Добавить(Комплектующее);
	КонецЦикла;
	
	ПолучитьОстаткиСервер(СписокНоменклатуры, Объект.Склад, Объект.Ссылка, КэшОстатков);
	
	Для каждого СтрокаТабличнойЧастиТовары из Объект.Товары Цикл
		ДанныеОстатка = КэшОстатков[СтрокаТабличнойЧастиТовары.Номенклатура];
		Если ДанныеОстатка = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТабличнойЧастиТовары.Остаток = ДанныеОстатка.СвободныйОстаток;
	КонецЦикла;
	
	Для каждого СтрокаТабличнойЧастиКомплектующие из Объект.Комплектующие Цикл
		ДанныеОстатка = КэшОстатков[СтрокаТабличнойЧастиКомплектующие.Номенклатура];
		Если ДанныеОстатка = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТабличнойЧастиКомплектующие.Остаток = ДанныеОстатка.СвободныйОстаток;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказатьОстаткиПриИзменении(Элемент)
	
	Элементы.ТоварыОстаток.Видимость = ПоказатьОстатки;
	Элементы.КомплектующиеОстаток.Видимость = ПоказатьОстатки;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьПеремещениеТовары(Команда)
	
	ОткрытьФорму("Документ.Перемещение.Форма.ФормаДокумента",
		Новый Структура("Ключ", СформироватьПеремещениеНаСервере(СтрРазделить(Команда.Имя, "_")[0])));
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПеремещениеКомлектующие(Команда)
	
	ОткрытьФорму("Документ.Перемещение.Форма.ФормаДокумента",
		Новый Структура("Ключ", СформироватьПеремещениеНаСервере(СтрРазделить(Команда.Имя, "_")[0])));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Сформировать перемещение на сервере.
// 
// Параметры:
//  ИмяТаблицы - Строка - Имя таблицы
// 
// Возвращаемое значение:
//  ДокументСсылка.Перемещение - Сформировать перемещение на сервере
&НаСервере
Функция СформироватьПеремещениеНаСервере(ИмяТаблицы)
	
	// Легаси
	КэшОстатков = Новый Соответствие;
	
	СписокНоменклатуры = Объект[ИмяТаблицы].Выгрузить().ВыгрузитьКолонку("Номенклатура");
	
	ПолучитьОстаткиСервер(СписокНоменклатуры,Объект.Склад,Объект.Ссылка,КэшОстатков);
	
	Подсортировка = документы.Перемещение.СоздатьДокумент();
	Подсортировка.СкладПолучатель = Объект.Склад;
	
	РеквизитыСклада = ЗначенияРеквизитовОбъекта(Объект.Склад, "ФизическийСклад, Организация");
	РеквизитыПользователя = ЗначенияРеквизитовОбъекта(ПараметрыСеанса.Пользователь, "ФизЛицо");
	
	Если РеквизитыСклада.ФизическийСклад <> Объект.Склад И ЗначениеЗаполнено(РеквизитыСклада.ФизическийСклад) Тогда
		Подсортировка.Склад = РеквизитыСклада.ФизическийСклад;
	иначе
		Справочники.Склады.НайтиПоКоду("STA-48");
	КонецЕсли;
	
	Подсортировка.ИБ = Справочники.ИБ.НайтиПоКоду(ПолучитьПрефиксИБСервер(Объект.Склад));
	Подсортировка.Менеджер = РеквизитыПользователя.ФизЛицо;
	Подсортировка.Автор = ПараметрыСеанса.Пользователь;
	Подсортировка.Организация = РеквизитыСклада.Организация;
	Подсортировка.ПунктДоставки = Справочники.ПунктыДоставки.НайтиПоКоду("OD7-000002");
	
	Подсортировка.Комментарий = Объект.Номер;
	
	Подсортировка.СостояниеНакладной = Перечисления.СостоянияНакладной.ВРаботе;
	Подсортировка.СостояниеНакладнойУПолучателя = Перечисления.СостоянияНакладной.ВРаботе;
	Подсортировка.Отгружен = Перечисления.Отгружен.Резерв;
	Подсортировка.Дата = ТекущаяДатаСеанса();
	Подсортировка.Валюта = Справочники.Валюты.НайтиПоКоду("810");
	Подсортировка.Курс = 1;
	
	УстановитьНомерДокументаКлиентСервер(Подсортировка);
	
	Для Каждого СтрокаТЗДляПРМ Из Объект[ИмяТаблицы] Цикл
		СтрокаКэша=КэшОстатков.Получить(СтрокаТЗДляПРМ.Номенклатура);		
		СвободныйОстаток=?(СтрокаКэша<>Неопределено,СтрокаКэша.СвободныйОстаток,0);
		НеХватает = СтрокаТЗДляПРМ.Количество - СвободныйОстаток;
		Если НеХватает > 0 Тогда
			СтрТЧ = Подсортировка.Товары.Добавить();
			СтрТЧ.Номенклатура = СтрокаТЗДляПРМ.номенклатура;
			СтрТЧ.Заявка = НеХватает;
			стртч.ПодтвержденнаяЗаявка = НеХватает;
			стртч.ПодтвержденнаяЗаявкаПеремещения = НеХватает;
			СтрТЧ.Количество = НеХватает;
			
			ПриИзмененииНоменклатурыТабЧасти(СтрТЧ, Подсортировка);
			
			РассчитатьСуммуТабЧасти(СтрТЧ, Подсортировка);
		КонецЕсли;
	КонецЦикла;
	
	Если Подсортировка.Товары.Количество() > 0 тогда
		Подсортировка.Записать(РежимЗаписиДокумента.Запись);
		
		Возврат Подсортировка.Ссылка;
	КонецЕсли;
	
КонецФункции // СформироватьПеремещениеНаСервере()

#КонецОбласти
