
//	ищет Внешнюю обработку, если нет Внешней пытается найти встроенную, 
//	если и ее нет возвращает "Неопределено"
Функция ПолучитьВнешнююОбработкуНаСервере(ИмяФайла, ПодКаталог = "") Экспорт
	
	Обработка		= Неопределено;
	ФлагВнешняя 	= ?(Найти(ИмяФайла,"ВН_") > 0, Истина, Ложь);
	
	ИмяВстроеннойОбработки	= СтрЗаменить(ИмяФайла,"ВН_","");
	ПолноеИмяФайла  = Константы.КаталогВнешнихОтчетов.Получить() + ПодКаталог + ИмяВстроеннойОбработки + ".epf";
	
	Файл = Новый Файл(ПолноеИмяФайла);
	Если Файл.Существует() И ФлагВнешняя Тогда
		Обработка = ВнешниеОбработки.Создать(ПолноеИмяФайла);	
	ИначеЕсли Метаданные.Обработки.Найти(ИмяВстроеннойОбработки) <> Неопределено Тогда
		Обработка = Обработки[ИмяВстроеннойОбработки].Создать();
	ИначеЕсли Метаданные.Отчеты.Найти(ИмяВстроеннойОбработки) <> Неопределено Тогда
		Обработка = Отчеты[ИмяВстроеннойОбработки].Создать();	
	КонецЕсли; 
	
	Возврат Обработка;
	
КонецФункции // ПолучитьВнешнююОбработкуНаСервере(ИмяФайла,ПодКаталог="")
