
Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	////////// ПЕРЕДАЕМ ТАБЛИЦУ ПАРАМЕТРОВ /////////////////////////////////////////////////////
	
	Если ТаблицаПараметров <> Неопределено  Тогда
		
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл 
			
			Если СтрокаТП.Имя = "Контрагент" Тогда
				Запрос.УстановитьПараметр("Контрагент", СтрокаТП.Значение);
			КонецЕсли;
			Если СтрокаТП.Имя = "Дата1" Тогда
				Запрос.УстановитьПараметр("Дата1", СтрокаТП.Значение);
			КонецЕсли;
			Если СтрокаТП.Имя = "Дата2" Тогда
				Запрос.УстановитьПараметр("Дата2", СтрокаТП.Значение);
			КонецЕсли;
			Если СтрокаТП.Имя = "ДатаОтгрузки" Тогда
				Запрос.УстановитьПараметр("ДатаОтгрузки", СтрокаТП.Значение);
			КонецЕсли;
			
		КонецЦикла;   	
		
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////////////////
	//   ОПРЕДЕЛИМ КОНТРАГЕНТОВ И ВИД ДОКУМЕНТОВ ДЛЯ ЗАПРОСА                                  //
	//   СОБЕРЕМ ТАБЛИЦУ ПЕЧАТИ                                                               //
	////////////////////////////////////////////////////////////////////////////////////////////
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПечатныеФормы.Ссылка.Контрагент КАК Контрагент,
	|	ПечатныеФормы.Ссылка.Почта КАК Почта,
	|	ПечатныеФормы.ПечатнаяФорма КАК ПечатнаяФорма,
	|	ВЫРАЗИТЬ(ПечатныеФормы.ПечатнаяФорма.ТипОбъекта КАК СТРОКА(100)) КАК ТипОбъекта,
	|	ПечатныеФормы.ПечатнаяФорма.ВидДокумента КАК ВидДокумента,
	|	ВЫРАЗИТЬ(ПечатныеФормы.ПечатнаяФорма.ИмяФормы КАК СТРОКА(100)) КАК ИмяФормы,
	|	ВЫРАЗИТЬ(ПечатныеФормы.ПечатнаяФорма.ИмяФайла КАК СТРОКА(200)) КАК ИмяФайла
	|ИЗ
	|	Справочник.ПечатныеФормыДляРассылокПоКонтрагентам.ПечатныеФормы КАК ПечатныеФормы
	|ГДЕ
	|	(ВЫРАЗИТЬ(ПечатныеФормы.ПечатнаяФорма.ТипОбъекта КАК СТРОКА(200))) = ""Документ""
	|	И НЕ ПечатныеФормы.Ссылка.ПометкаУдаления
	|	" + ?(Запрос.Параметры.Свойство("Контрагент"), "И ПечатныеФормы.Ссылка.Контрагент = &Контрагент", "") + "
	|";
	
	// |	" + ?(Запрос.Параметры.Свойство("Контрагент"), "И ПечатныеФормы.Ссылка.Контрагент = &Контрагент", "") + "
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаПечати = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ТаблицаПечати.Количество() = 0 Тогда Возврат; КонецЕсли;
	
	МассивКонтрагентов = ЗаполнениеДокументов.УдалитьПовторяющиесяЭлементыМассива(ТаблицаПечати.ВыгрузитьКолонку("Контрагент"));
	МассивВидовДокументов = ЗаполнениеДокументов.УдалитьПовторяющиесяЭлементыМассива(ТаблицаПечати.ВыгрузитьКолонку("ВидДокумента"));	
	
	Запрос.УстановитьПараметр("МассивКонтрагентов", МассивКонтрагентов);
	
	Если НЕ Запрос.Параметры.Свойство("Дата1") Тогда
		Запрос.УстановитьПараметр("Дата1", НачалоДня(ТекущаяДатаСеанса()));
	КонецЕсли;
	Если НЕ Запрос.Параметры.Свойство("Дата2") Тогда
		Запрос.УстановитьПараметр("Дата2", КонецДня(ТекущаяДатаСеанса()));
	КонецЕсли;
	Если НЕ Запрос.Параметры.Свойство("ДатаОтгрузки") Тогда
		Запрос.УстановитьПараметр("ДатаОтгрузки", НачалоДня(ТекущаяДатаСеанса()));
	КонецЕсли;
	
	///////////// ПЕЧАТЬ ДЛЯ КАЖДОГО ВИДА ДОКУМЕНТА ////////////////////////////////////////////
	// СМОТРИМ, ОТПРАВЛЕН ЛИ УЖЕ ДОКУМЕНТ (ЗАПИСЬ В РЕГИСТРЕ СВЕДЕНИЙ ПисьмаНаОтправку)
	////////////////////////////////////////////////////////////////////////////////////////////
	
	Для Каждого ВидДокумента ИЗ МассивВидовДокументов Цикл
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Документ.Ссылка КАК Документ,
		|	Документ.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ ДокументыПечати
		|ИЗ
		|	Документ." + СокрЛП(ВидДокумента) + " КАК Документ
		|ГДЕ
		|	НЕ Документ.ПометкаУдаления
		|	И Документ.Дата МЕЖДУ &Дата1 И &Дата2
		// Кухарь А.Ю. 31.03.2024 начало
		// 		|	И Документ.Контрагент В(&МассивКонтрагентов)
		|	И (Документ.Контрагент В(&МассивКонтрагентов) или Документ.Контрагент.Ведущий В(&МассивКонтрагентов))		
		// Кухарь А.Ю. 31.03.2024 конец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(ДокументыПечати.Документ, ПисьмаНаОтправку.Основание) КАК Документ,
		|	ДокументыПечати.Контрагент КАК Контрагент
		|ИЗ
		|	ДокументыПечати КАК ДокументыПечати
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПисьмаНаОтправку КАК ПисьмаНаОтправку
		|		ПО ДокументыПечати.Документ = ПисьмаНаОтправку.Основание
		|";
		
		УстановитьПривилегированныйРежим(Истина);
		ТаблицаОтправленныхДокументов = Запрос.Выполнить().Выгрузить();
		УстановитьПривилегированныйРежим(Ложь);
		
		МассивОтправленныхДокументов = ЗаполнениеДокументов.УдалитьПовторяющиесяЭлементыМассива(ТаблицаОтправленныхДокументов.ВыгрузитьКолонку("Документ"));
		Запрос.УстановитьПараметр("МассивОтправленныхДокументов", МассивОтправленныхДокументов);
		
		//////////////////////////////////////////////////////////////////////////////////////////
		// ТОЛЬКО НЕОТПРАВЛЕННЫЕ ДОКУМЕНТЫ
		//////////////////////////////////////////////////////////////////////////////////////////
		
		МетаданныеДокумента = Документы[СокрЛП(ВидДокумента)].ПустаяСсылка().Метаданные();
		ЕстьДатаОтгрузки = ?(ЗаполнениеДокументов.ЕстьРеквизитДокументаСервер("ДатаОтгрузки", МетаданныеДокумента), Истина, Ложь);
		// Кухарь А.Ю.  31.03.2024 начало
		ЕстьСостояниеНакладной = ?(ЗаполнениеДокументов.ЕстьРеквизитДокументаСервер("СостояниеНакладной", МетаданныеДокумента), Истина, Ложь);
		// Кухарь А.Ю.  31.03.2024 конец
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Документ.Ссылка КАК Документ,
		|	Документ.Контрагент КАК Контрагент,
		// Кухарь А.Ю.  02.04.2024 начало
		|	Документ.Контрагент.Ведущий КАК Ведущий 
		// Кухарь А.Ю.  02.04.2024 конец
		
		|ИЗ
		|	Документ." + СокрЛП(ВидДокумента) + " КАК Документ
		|ГДЕ
		|	НЕ Документ.ПометкаУдаления
		|	И Документ.Дата МЕЖДУ &Дата1 И &Дата2
		// Кухарь А.Ю. 31.03.2024 начало
		// 		|	И Документ.Контрагент В(&МассивКонтрагентов)
		|	И (Документ.Контрагент В(&МассивКонтрагентов) или Документ.Контрагент.Ведущий В(&МассивКонтрагентов))		
		// Кухарь А.Ю. 31.03.2024 конец
		|	И НЕ Документ.Ссылка В (&МассивОтправленныхДокументов)
		|	" + ?(ЕстьДатаОтгрузки, "И Документ.ДатаОтгрузки = &ДатаОтгрузки", "") + "
		// Кухарь А.Ю.  31.03.2024 начало
		|	" + ?(ЕстьСостояниеНакладной, "И Документ.СостояниеНакладной = Значение(Перечисление.СостоянияНакладной.Отгружена)", "") + " 
		// Кухарь А.Ю.  31.03.2024 конец		
		|";
		
		// Документ." + СокрЛП(ВидДокумента) + "
		
		УстановитьПривилегированныйРежим(Истина);
		ТаблицаДокументовДляПечати = Запрос.Выполнить().Выгрузить();
		УстановитьПривилегированныйРежим(Ложь);
		
		Для Каждого Стр ИЗ ТаблицаДокументовДляПечати Цикл
			
			ДокОбъект = Стр.Документ.ПолучитьОбъект();   // Получаем объект 1 раз, печатных форм может быть несколько для одного документа
			Если ДокОбъект <> Неопределено Тогда
				
				НайденныеСтрокиПечатныхФорм = ТаблицаПечати.НайтиСтроки(Новый Структура("Контрагент, ВидДокумента", Стр.Контрагент, ВидДокумента));
				
				// Кухарь А.Ю.  02.04.2024 начало
				если НайденныеСтрокиПечатныхФорм.Количество()=0 тогда
					НайденныеСтрокиПечатныхФорм = ТаблицаПечати.НайтиСтроки(Новый Структура("Контрагент, ВидДокумента", Стр.Ведущий, ВидДокумента));
				КонецЕсли;				 
				// Кухарь А.Ю.  02.04.2024 конец
				
				Для Каждого СтрокаПечатныхФорм ИЗ НайденныеСтрокиПечатныхФорм Цикл
					
					Если ЗначениеЗаполнено(СтрокаПечатныхФорм.ИмяФайла) Тогда
						
						ОбработкаОбъект = Обработки.АвтоотправкаПечатныхФормКонтрагентам.ПолучитьВнешнююОбработкуНаСервере(СтрокаПечатныхФорм.ИмяФайла, "PrnForms\");
						
						ДопПараметры = Новый Структура;
						Если НЕ ПустаяСтрока(СокрЛП(СтрокаПечатныхФорм.ИмяФормы)) Тогда
							ДопПараметры.Вставить("ИмяФормы", СокрЛП(СтрокаПечатныхФорм.ИмяФормы));
						КонецЕсли;
						
						Если ОбработкаОбъект <> Неопределено Тогда
							Попытка
								ОбработкаОбъект.ДокОбъект = ДокОбъект;         						// Реквизит внешней обработки
								ТабличныйДокумент = ОбработкаОбъект.ПечатьПакетная(ДопПараметры);   // Помещаем функцию ПечатьПакетная() в Модуль внешней обработки (точка входа)
								
								ИмяФайла = СокрЛП(СтрокаПечатныхФорм.ИмяФайла) + ".xlsx";
								ТипФайла = ТипФайлаТабличногоДокумента.XLSX;
								ПолныйПутьКФайлу = КаталогВременныхФайлов() + ИмяФайла;
								
								ТабличныйДокумент.Записать(ПолныйПутьКФайлу, ТипФайла);
								Файл = Новый Файл(ПолныйПутьКФайлу);
		
								Если Файл.Существует() И ЗначениеЗаполнено(СтрокаПечатныхФорм.Почта) Тогда
									
									ТемаПисьма = "Отгрузочные документы " + Строка(Стр.Документ);
									
									ТекстПисьма = "
									|Добрый день!
									|
									|Во вложении отгрузочный документ по " + Строка(Стр.Документ) + " " + Строка(ДокОбъект.Контрагент) + "
									|
									|Данное письмо сформировано автоматически и отвечать на него не нужно.";

									СформироватьВнутреннееУведомление(СтрокаПечатныхФорм.Почта, ТекстПисьма,
										ТемаПисьма, Стр.Документ,,ПолныйПутьКФайлу, "robot@collant.ru");
								КонецЕсли;
							Исключение
								ЗаписатьВЛог("Регламент", "" + Строка(Стр.Документ) + ": Не удалось распечатать " + Строка(ОбработкаОбъект), "Информация");
							КонецПопытки;
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Попытка
		УдалитьФайлы(КаталогВременныхФайлов(), "*.xlsx");
	Исключение
		ЗаписатьВЛог("Регламент", "Не удалось удалить файлы!", "Информация");
	КонецПопытки;
	
КонецПроцедуры
