Функция ТекстЗапроса_ВсеКодыДокумента()
	Возврат "    
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки,ШтрихкодНабора,ШтрихкодБлочка
	|ПОМЕСТИТЬ ВТ_ШтрихкодыУпаковок
	|ИЗ
	|	Документ.ЛистНабора.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка = &ДокСсылка
	|;
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки
	|ПОМЕСТИТЬ ВТ_ВсеКМДокумента
	|ИЗ
	|	ВТ_ШтрихкодыУпаковок
	|ГДЕ	
	|	ШтрихкодУпаковки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ
	|	ШтрихкодНабора
	|ИЗ
	|	ВТ_ШтрихкодыУпаковок
	|ГДЕ	
	|	ШтрихкодНабора <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ
	|	ШтрихкодБлочка
	|ИЗ
	|	ВТ_ШтрихкодыУпаковок
	|ГДЕ	
	|	ШтрихкодБлочка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)	
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ
	|   НовыйКодКоробки
	|ИЗ
	|	Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации
	|ГДЕ
	|	Ссылка = &ДокСсылка
	|	И НовыйКодКоробки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|";
КонецФункции //ТекстЗапроса_ВсеКодыДокумента()

Функция ПолучитьПорцииКМДляПроверки(ДокСсылка, РазмерПорции = 1000) Экспорт
	Запрос = Новый Запрос;	
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	Запрос.Текст = ТекстЗапроса_ВсеКодыДокумента();
	Запрос.Текст = Запрос.Текст + "
	|;
	|ВЫБРАТЬ
	|	ВТ_ВсеКМДокумента.ШтрихкодУпаковки
	|ИЗ
	|	ВТ_ВсеКМДокумента          
	|ГДЕ
	|	ШтрихкодУпаковки.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.ЛогистическаяУпаковка)
	|	ИЛИ ШтрихкодУпаковки.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор)
	|";	
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
		
	тВложенныеКоды = Новый ТаблицаЗначений;
	тВложенныеКоды.Колонки.Добавить("ШтрихкодУпаковки", Новый ОписаниеТипов("СправочникСсылка.ШтрихкодыУпаковокТоваров"));
	
	тКодыКонтейнеры = Запрос.Выполнить().Выгрузить();
	Выборка 		= РегистрыСведений.ОтгружаемыеКодыМаркировки.ПолучитьВыборкуВложенныхКодов(тКодыКонтейнеры, Новый Структура("ВключатьКодыКомплектующих", Ложь));
	Пока Выборка.Следующий() Цикл
		СтрокаТЧ = тВложенныеКоды.Добавить();
		СтрокаТЧ.ШтрихКодУпаковки = Выборка.ШтрихКодУпаковки;		
	КонецЦикла;                                   
	
	Запрос.УстановитьПараметр("ВложенныеКоды", тВложенныеКоды);
	
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_ВложенныеКоды ИЗ &ВложенныеКоды КАК ВложенныеКоды
	|;	
	|ВЫБРАТЬ
	|	ВТ_ВложенныеКоды.ШтрихкодУпаковки.Наименование КАК ШтрихкодУпаковки
	|ИЗ
	|	ВТ_ВложенныеКоды
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.ИспользованныеКодыАгрегаций КАК ИспользованныеКА
	|ПО 	
	|	ИспользованныеКА.Регистратор ССЫЛКА Документ.МаркировкаТоваровИСМП
	|	И ИспользованныеКА.ШтрихКодУпаковки 		= ВТ_ВложенныеКоды.ШтрихКодУпаковки	
	|	И ИспользованныеКА.Регистратор.Статус 		= ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан)
	|	И ИспользованныеКА.Регистратор.ВидОперации	= ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация)
	|	И ИспользованныеКА.Регистратор.ДокументОснование ССЫЛКА Документ.РасходнаяНакладная
	|ГДЕ
	|	ВТ_ВложенныеКоды.ШтрихкодУпаковки.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.ЛогистическаяУпаковка)
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки.Наименование КАК ШтрихкодУпаковки
	|ИЗ
	|	ВТ_ВложенныеКоды
	|ГДЕ 
	|	ВТ_ВложенныеКоды.ШтрихкодУпаковки.ТипКода <> ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.ЛогистическаяУпаковка)	
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки.Наименование КАК ШтрихкодУпаковки
	|ИЗ
	|	ВТ_ВсеКМДокумента
	|ГДЕ 
	|	ВТ_ВсеКМДокумента.ШтрихкодУпаковки.ТипКода <> ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.ЛогистическаяУпаковка)
	|";	
	
	Выборка = Запрос.Выполнить().Выбрать();
	ВсегоСтрок 	= Выборка.Количество();
	Сч			= 0;
	
	Порции = Новый Массив;
	ТекПорция = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Сч = Сч + 1;
		
		ТекПорция.Добавить(Выборка.ШтрихкодУпаковки);
		Если ТекПорция.Количество() >= РазмерПорции ИЛИ Сч >= ВсегоСтрок Тогда
			Порции.Добавить(ТекПорция);
			ТекПорция = Новый Массив;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Порции;
КонецФункции //ПолучитьКМДляПроверки(ДокСсылка) Экспорт

Функция ПолучитьТаблицуКМДокумента(ДокСсылка, ДопПараметры = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_ВсеКодыДокумента() + "
	|;
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки
	|ИЗ
	|	ВТ_ВсеКМДокумента	
	|";
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции //ПолучитьТаблицуКМДокумента(ДокСсылка, ДопПараметры = Неопределено) Экспорт