Перем НужноВыгружать; //нечаева 02,09,16---
Перем ЭтоУзел_ODN_или_OD7_И_ЕстьСтрокиПН;
Перем ПланНабора;
// Кухарь А.Ю. 17.01.2020 начало
//Переход на ЗНБ
Перем ОтсканировалиНеТотЗНБ;
// Кухарь А.Ю. 17.01.2020 конец

Перем ЕстьЛистыПереукладки;

// Кухарь А.Ю.  25.02.2025 начало
Перем УпрощеннаяЗапись; 
// Кухарь А.Ю.  25.02.2025 конец

Перем ЭтоЗагрузкаСТСД; // Кельманов А.В. - HELP-7030 - 2025.09.18

//Кухарь 26.09.16 начало
//Процедура ОбработкаПроведения(Отказ, РежимПроведения)
Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;		
	
	Если УпрощеннаяЗапись = Истина Тогда
		Возврат;
	КонецЕсли; 
	
	// Кельманов А.В. - HELP-7030 - 2025.09.18 {
	Если ЭтоЗагрузкаСТСД = Истина Тогда
		Возврат;
	КонецЕсли; 
	// Кельманов А.В. - HELP-7030 - 2025.09.18 }
	
	Если ТипЗнч(ДокОснование)=Тип("ДокументСсылка.Инвентаризация") Тогда //по инвентаризациям не проверяем расхождения и перебор
		Возврат;	
	КонецЕсли; 	
	
	Если Склад.ТипСклада=Перечисления.ТипСклада.ВнешнийСклад тогда
		Если НЕ ЗначениеЗаполнено(им7) тогда
			Сообщить("Не задан ИМ7!");Отказ=Истина;Возврат;
		Конецесли;
	Конецесли;	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	ЭтоУзел_ODN_или_OD7_И_ЕстьСтрокиПН=ОбщегоНазначения_ПИ.ЭтоУзел_ODN_или_OD7() И ЗаданияНабора.Количество()>0; 
	
	ДокОснованиеОбъект		=ДокОснование.ПолучитьОбъект();
	ВидДокументаОснования	=ДокОснование.Метаданные().Имя;
	
	
	//нечаева 13,10,16+++
	#Если Клиент Тогда
		ОбработкаСравненияЛН			= Обработки.СравнениеЛистовНабора.Создать();	
		ОбработкаСравненияЛН.Документ	= ДокОснование;
		
		Ошибки							= ОбработкаСравненияЛН.ПолучитьОшибкиНабора();		
		ЕстьОшибки						= Ошибки.Ошибки;
		
		Если ЕстьОшибки И Ошибки.ТП.Количество()>0 Тогда
			ОбработкаСравненияЛН.ВывестиТаблицуОшибок(Ошибки.ТП,"Перебор");	
		КонецЕсли;	
		
		ВидДокументаОснования	= ДокОснование.Метаданные().Имя;
		Если ВидДокументаОснования="КонтрактСПроизводителем" ИЛИ ВидДокументаОснования="ЗаказПоставщику" Тогда //Мессерле
			Возврат;
		КонецЕсли;	
		
		ДокОснованиеОбъект		= ДокОснование.ПолучитьОбъект();	
		ЕстьЛистыПереукладки	= ЕстьЛистыПереукладки();	
		
		БылоСостояние			= ДокОснованиеОбъект.СостояниеНакладной;
		Если ВидДокументаОснования="Перемещение" Тогда
			Если ДокОснованиеОбъект.Склад.КодФизическогоУзла<>ПараметрыСеанса.ЭтотУзел.Код Тогда
				//+HELP-2709 20250207 Михайловский
				Если (Маркировка_ПИ.ТипТекущегоУзла() = Перечисления.ТипУзлаИБ.УправляющееПодразделение) И НЕ ЗначениеЗаполнено(ДокОснованиеОбъект.Склад.КодФизическогоУзла) Тогда
					БылоСостояние		=ДокОснованиеОбъект.СостояниеНакладной;
					//-HELP-2709 20250207 Михайловский
				Иначе	
					БылоСостояние		=ДокОснованиеОбъект.СостояниеНакладнойУПолучателя;
				КонецЕсли;
			КонецЕсли;
			
			ЗаписатьВРегистр_Реквизиты_ТЧ_Товары_РНКПРМ(); //Катаев+ 28/01/14 Заносим в регистр сведений данные о листе набора		
		КонецЕсли;
		
		Если НЕ СостояниеДопустимо(БылоСостояние,ВидДокументаОснования) Тогда			
			СообщитьОбОшибке("Недопустимое состояние документа основания ! Состояние: "+БылоСостояние,Отказ);
			Возврат;								
		КонецЕсли; 
		
		НовоеСостояние			= БылоСостояние;
		НадоЗаписатьВДокумент	= Ложь;
		
		Если ВидДокументаОснования="ПриходнаяНакладная" Тогда			
			Если ЕстьОшибки Тогда
				НовоеСостояние=Перечисления.СостоянияНакладной.Сканирование;				
			Иначе
				НовоеСостояние=Перечисления.СостоянияНакладной.ГотоваКПриемке;				
			КонецЕсли;
			
			//крохин начало 22.09.2014
			Если НЕ ЕстьОшибки ИЛИ (ЕстьОшибки И БылоСостояние  <> Перечисления.СостоянияНакладной.Сканирование) Тогда
				НадоЗаписатьВДокумент=Истина;
			КонецЕсли;
			
			ЗаписатьКоличествоИОбъемКоробовВРегистр(ДокОснованиеОбъект,Ошибки.КоличествоКоробок,Ошибки.ОбъемКоробов);
		ИначеЕсли ВидДокументаОснования="РасходнаяНакладная" Тогда			
			//крохин начало 11.12.2013
			//в ODN состояния меняем планом набора, если есть				
			Если НЕ ЭтоУзел_ODN_или_OD7_И_ЕстьСтрокиПН Тогда				
				Если ЕстьОшибки Тогда
					НовоеСостояние=Перечисления.СостоянияНакладной.Сканирование;
				Иначе
					Если ТребуетсяДопОбработка(ДокОснование) Тогда
						НовоеСостояние=Перечисления.СостоянияНакладной.ДопОбработка;
					Иначе
						НовоеСостояние=Перечисления.СостоянияНакладной.ГотоваКОтгрузке;							
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;				
			//крохин конец 11.12.2013				
			
			Если НЕ ЕстьЛистыПереукладки Тогда								
				Если НЕ ЕстьОшибки ИЛИ (ЕстьОшибки И БылоСостояние  <> Перечисления.СостоянияНакладной.Сканирование) Тогда					
					Если НЕ ЭтоУзел_ODN_или_OD7_И_ЕстьСтрокиПН Тогда
						НадоЗаписатьВДокумент=Истина;
					КонецЕсли;
				КонецЕсли;
				
				Если НЕ ЕстьОшибки И ЭтоУзел_ODN_или_OD7_И_ЕстьСтрокиПН Тогда					
					если НовоеСостояние<>БылоСостояние тогда
						НадоЗаписатьВДокумент=Истина;
					КонецЕсли; 
				КонецЕсли;
				//запись количества коробок и объёма коробок в регистр, чтобы уйти от реквизитов
				ЗаписатьКоличествоИОбъемКоробовВРегистр(ДокОснованиеОбъект,Ошибки.КоличествоКоробок,Ошибки.ОбъемКоробов);					
			КонецЕсли;
			
		ИначеЕсли ВидДокументаОснования="Перемещение" Тогда
			Если ДокОснованиеОбъект.Склад.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда				
				//в ODN состояния меняем планом набора, если есть				
				Если НЕ ЭтоУзел_ODN_или_OD7_И_ЕстьСтрокиПН Тогда									
					Если ЕстьОшибки Тогда
						НовоеСостояние	=Перечисления.СостоянияНакладной.Сканирование;							
					Иначе						
						НовоеСостояние=Перечисления.СостоянияНакладной.ГотоваКОтгрузке;
						Если ТребуетсяДопОбработка(ДокОснование) И НЕ ДокОснование.Склад.ТипСклада=Перечисления.ТипСклада.РозничныйТЦ Тогда
							НовоеСостояние=Перечисления.СостоянияНакладной.ДопОбработка;								
						КонецЕсли;
					КонецЕсли;					
				КонецЕсли;
				//крохин конец 11.12.2013				
				
				Если НЕ ЕстьОшибки ИЛИ (ЕстьОшибки И ДокОснованиеОбъект.Ссылка.СостояниеНакладной  <> Перечисления.СостоянияНакладной.Сканирование) Тогда					
					Если НЕ ЭтоУзел_ODN_или_OD7_И_ЕстьСтрокиПН Тогда	
						// Кухарь А.Ю. 24.03.2021 начало
						// НадоЗаписатьВДокумент=Истина;
						если НовоеСостояние<>БылоСостояние тогда
							НадоЗаписатьВДокумент=Истина;
						КонецЕсли; 
						// Кухарь А.Ю. 24.03.2021 конец					
					КонецЕсли;
				КонецЕсли;
				
				Если НЕ ЕстьОшибки И ЭтоУзел_ODN_или_OD7_И_ЕстьСтрокиПН Тогда					
					НадоЗаписатьВДокумент=Истина;
				КонецЕсли;				
				
				ЗаписатьКоличествоИОбъемКоробовВРегистр(ДокОснованиеОбъект,Ошибки.КоличествоКоробок,Ошибки.ОбъемКоробов);				
			Иначе
				Если ЕстьОшибки Тогда
					НовоеСостояние=Перечисления.СостоянияНакладной.Сканирование;
				Иначе
					НовоеСостояние=Перечисления.СостоянияНакладной.ГотоваКПриемке;
				КонецЕсли;				
				
				Если БылоСостояние<>НовоеСостояние Тогда
					НадоЗаписатьВДокумент=Истина;
				КонецЕсли;				
			КонецЕсли;			
		ИначеЕсли ВидДокументаОснования="ПродажаИМ" Тогда			
			НадоЗаписатьВДокумент=Истина;
			Если ЕстьОшибки Тогда
				НовоеСостояние=Перечисления.СостоянияНакладной.Сканирование;
			Иначе
				НовоеСостояние=Перечисления.СостоянияНакладной.ГотоваКОтгрузке;
			КонецЕсли;			
		КонецЕсли;	
		
		Если НадоЗаписатьВДокумент Тогда
			//Кухарь 16.12.19 начало
			//ДокОснованиеОбъект.СостояниеНакладной             =НовоеСостояние;
			если ВидДокументаОснования="Перемещение" и ДокОснованиеОбъект.Склад.КодФизическогоУзла<>ПараметрыСеанса.ЭтотУзел.Код тогда
				//+HELP-2709 20250207 Михайловский
				Если (Маркировка_ПИ.ТипТекущегоУзла() = Перечисления.ТипУзлаИБ.УправляющееПодразделение) И НЕ ЗначениеЗаполнено(ДокОснованиеОбъект.Склад.КодФизическогоУзла) Тогда
					ИмяРеквизитаСостояния="СостояниеНакладной";
					Если НовоеСостояние=Перечисления.СостоянияНакладной.ГотоваКПриемке Тогда
						НовоеСостояние = Перечисления.СостоянияНакладной.ГотоваКОтгрузке;
					КонецЕсли;	
				Иначе
					//-HELP-2709 20250207 Михайловский
					ИмяРеквизитаСостояния="СостояниеНакладнойУПолучателя";
				КонецЕсли;
			иначе
				ИмяРеквизитаСостояния="СостояниеНакладной";
			КонецЕсли;
			ДокОснованиеОбъект[ИмяРеквизитаСостояния]=НовоеСостояние;
			//Кухарь 16.12.19 конец                            
			
			ДокОснованиеОбъект.КоличествоКоробок    =Ошибки.КоличествоКоробок;
			ДокОснованиеОбъект.ОбъемКоробов                                             =Ошибки.ОбъемКоробов;
			
			ДокОснованиеОбъект.Записать();                                                       
		КонецЕсли;
		
	# КонецЕсли
	//нечаева 13,10,16---	
	
	//крохин начало 17.10.2013
	//контроль строк плана набора	
	Если ЭтоУзел_ODN_или_OD7_И_ЕстьСтрокиПН  Тогда
		ОбработатьПланНабора (ВидДокументаОснования);	 
	КонецЕсли;			
	//крохин конец 17.10.2013	
КонецПроцедуры //ОбработкаПроведения(Отказ, РежимПроведения) Экспорт


Процедура ЗаписатьВРегистр_Реквизиты_ТЧ_Товары_РНКПРМ()
	ОчиститьРегистр_РеквизитыТЧ_Товары_РНКПНКПРМ();	
	Если ДокОснование.СкладПолучатель.ТипСклада = Перечисления.ТипСклада.ПалетноеХранение Тогда
		НаборЗаписей = РегистрыСведений.РеквизитыТЧ_Товары_РНКПНКПРМ.СоздатьНаборЗаписей();
		// Кухарь А.Ю. 26.08.2021 начало
		//
		НаборЗаписей.Отбор.Документ.Установить(ДокОснование,Истина);			
		НаборЗаписей.Отбор.ИмяРеквизита.Установить("Номер ЛН "+Номер+" от "+Формат(Дата, "ДЛФ=Д"),Истина);			 
		// Кухарь А.Ю. 26.08.2021 конец
		
		НаборЗаписей.Прочитать();
		//Катаев+ 07/02/14 В одном ЛН может быть несколько одинаковых номенклатур с различными ШК
		//Для Каждого стрТовара из Товары Цикл
		тз = Товары.Выгрузить();
		тз.Свернуть("Номенклатура", "Количество");
		Для Каждого стрТовара из тз Цикл
			//Катаев- 07/02/14
			стр = НаборЗаписей.Добавить();
			
			стр.Активность 			= Истина;
			стр.Документ			= ДокОснование;
			стр.Номенклатура 		= стрТовара.Номенклатура;
			стр.ИмяРеквизита 		= "Номер ЛН "+Номер+" от "+Формат(Дата, "ДЛФ=Д");
			стр.ЗначениеРеквизита 	= стрТовара.Количество;
		КонецЦикла;
		НаборЗаписей.Записать();
		
		//Катаев+ 07/02/14 Регистрируем записи из набора записей в SNL
		// Кухарь А.Ю. 26.08.2021 начало
		//
		если ложь тогда
			
			// Кухарь А.Ю. 26.08.2021 конец
			
			УзелSNL=ПланыОбмена.Основной.НайтиПоКоду("SNL");
			тзНаборЗаписей = НаборЗаписей.Выгрузить();
			Для Каждого Выборка Из тзНаборЗаписей Цикл
				НаборЗаписей.Отбор.Документ.Установить(Выборка.Документ,Истина);			
				НаборЗаписей.Отбор.Номенклатура.Установить(Выборка.Номенклатура,Истина);			
				НаборЗаписей.Отбор.ИмяРеквизита.Установить(Выборка.ИмяРеквизита,Истина);			
				
				НаборЗаписей.Прочитать();
				
				НаборЗаписей.ОбменДанными.Получатели.Добавить(УзелSNL);			  
				ПланыОбмена.ЗарегистрироватьИзменения(УзелSNL,НаборЗаписей);			
			КонецЦикла;
			//Катаев- 07/04/14
			// Кухарь А.Ю. 26.08.2021 начало
			//
		КонецЕсли; 
		// Кухарь А.Ю. 26.08.2021 конец
		
	КонецЕсли;
	
КонецПроцедуры


//Кухарь 26.09.16 начало
//Процедура ОбработкаУдаленияПроведения(Отказ)
Процедура ОбработкаУдаленияПроведения(Отказ) экспорт
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;	
	
	ЕстьЛистыПереукладки=ЕстьЛистыПереукладки();
	
	ДокОснованиеМетаДок	= ДокОснование.Метаданные();
	ДокОснованиеОбъект	= ДокОснование.ПолучитьОбъект();
	ВидОснования		= ДокОснованиеМетаДок.Имя;
	
	//Кухарь 20.08.14 начало		
	Если НЕ ЕстьЛистыПереукладки Тогда	
		Если ЕстьРеквизитДокумента("ОбъемКоробов",ДокОснованиеМетаДок) Тогда
			ДокОснованиеОбъект.ОбъемКоробов		=ДокОснованиеОбъект.ОбъемКоробов	-ОбъемКоробов;	
		КонецЕсли;		
		Если ЕстьРеквизитДокумента("КоличествоКоробок",ДокОснованиеОбъект.Метаданные()) Тогда
			ДокОснованиеОбъект.КоличествоКоробок=ДокОснованиеОбъект.КоличествоКоробок-КоличествоКоробок;	
		КонецЕсли;		
	КонецЕсли;
	//Кухарь 20.08.14 конец
	
	Попытка
		ДокОснованиеОбъект.Записать(РежимЗаписиДокумента.Запись);	
		Если ЕстьРеквизитДокумента("КоличествоКоробок",ДокОснованиеМетаДок) Тогда
			ЗаписатьКоличествоИОбъемКоробовВРегистр(ДокОснованиеОбъект,ДокОснованиеОбъект.КоличествоКоробок,ДокОснованиеОбъект.ОбъемКоробов);
		КонецЕсли;	
	Исключение
		СообщитьОбОшибке("Ошибка при корректировке объема накладной ! "+ОписаниеОшибки(),Отказ);
	КонецПопытки;
	
	//Катаев+ 28/01/14 Удаляем записи из регистра сведений	
	Если ВидОснования="Перемещение" Тогда
		ОчиститьРегистр_РеквизитыТЧ_Товары_РНКПНКПРМ();	
	КонецЕсли;	
	//Катаев- 28/01/14	
	
	// Кухарь А.Ю.  12.12.2024 начало
	если ВидОснования="РасходнаяНакладная" тогда
		если КодАгрегации<>Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка() тогда
			СообщитьИзМодуля("У этого ЛН установлен код агрегации, распроведение запрещено.");
			отказ=Истина;
		КонецЕсли;
		
		// Кухарь А.Ю. 01.03.2025 начало
		// 
		МассивПустыхСтрок=ШтрихкодыУпаковок.НайтиСтроки(новый Структура("ШтрихкодБлочка",Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка()));
		Если МассивПустыхСтрок.количество()<>ШтрихкодыУпаковок.Количество() тогда
			Сообщить("Обнаружены отсканированые коды блочков. Помечать на удаление этот объект нельзя");
			отказ = Истина;
		КонецЕсли;
		
		// Кухарь А.Ю. 01.03.2025 конец
		
	КонецЕсли;
	// Кухарь А.Ю.  12.12.2024 конец
	// Кухарь А.Ю. 21.02.2025 начало
	// MARK-1254
	ЕстьСпайки=ложь;
	
	для каждого СТрТЧ из ШтрихкодыУпаковок цикл
		
		если СТрТЧ.ШтрихкодНабора<>Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка() тогда
			ЕстьСпайки=Истина;
		КонецЕсли;
	КонецЦикла;	 
	если ЕстьСпайки тогда
		СообщитьИзМодуля("Нельзя удалять спайки ЧЗ");
		отказ=Истина;
	КонецЕсли;
	//Кухарь А.Ю.  21.02.2025 конец
	
	
КонецПроцедуры

Процедура ОчиститьРегистр_РеквизитыТЧ_Товары_РНКПНКПРМ()
	Запрос=Новый ("Запрос");
	Запрос.Текст="ВЫБРАТЬ
	|	РеквизитыТЧ_Товары_РНКПНКПРМ.Документ КАК Документ,
	|	РеквизитыТЧ_Товары_РНКПНКПРМ.Номенклатура КАК Номенклатура,
	|	РеквизитыТЧ_Товары_РНКПНКПРМ.ИмяРеквизита КАК ИмяРеквизита,
	|	РеквизитыТЧ_Товары_РНКПНКПРМ.ЗначениеРеквизита КАК ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыТЧ_Товары_РНКПНКПРМ КАК РеквизитыТЧ_Товары_РНКПНКПРМ
	|ГДЕ
	|	РеквизитыТЧ_Товары_РНКПНКПРМ.Документ = &ДокОснование
	// Кухарь А.Ю. 26.08.2021 начало
	//|	И РеквизитыТЧ_Товары_РНКПНКПРМ.Номенклатура В(&СписокНоменклатуры)				  
	// Кухарь А.Ю. 26.08.2021 конец
	
	|	И РеквизитыТЧ_Товары_РНКПНКПРМ.ИмяРеквизита ПОДОБНО &ИмяРеквизита";
	
	Запрос.УстановитьПараметр("ДокОснование",		ДокОснование);
	// Кухарь А.Ю. 26.08.2021 начало
	// Запрос.УстановитьПараметр("СписокНоменклатуры",	Товары.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("ИмяРеквизита","%"+Номер+"%");
	// Кухарь А.Ю. 26.08.2021 конец
	
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МЗ=РегистрыСведений.РеквизитыТЧ_Товары_РНКПНКПРМ.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ,Выборка);
		
		МЗ.Удалить();
	КонецЦикла;
КонецПроцедуры


Процедура СформироватьШКЛистаНабора() Экспорт
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли; 	
	Если НЕ ПустаяСтрока(ШКЛистаНабора) Тогда Возврат КонецЕсли;

	// Кухарь А.Ю. 25.07.2025 начало  
	//HELP-4418
	//новой компонентой печатаем либо код из реквизита КодАгрегации, либо QR в который вшит УИД этого документа + номер коробки
	если ОбщегоНазначения_ПИ.ПечататьКоробныеЭтикеткиНовойКомпонентой(ДокОснование) тогда
		Возврат;
	КонецЕсли;
	// Кухарь А.Ю. 25.07.2025 конец
	
	Подразделение			= ПараметрыСеанса.ЭтотУзел.Подразделение;
	
	Если ОбщегоНазначения_ПИ.ЭтоУзел_Склад() ИЛИ (ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение И Подразделение.ЕстьВыделенныйСклад) Тогда
		
		Отбор	= Новый Структура("Подразделение,Год",Подразделение,НачалоГода(Дата));
		Запись	= РегистрыСведений.ШКЛистаНабора.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись,Отбор);	
		
		НомерШК = 0;
		
		Попытка
			НачатьТранзакцию();
			
			Запись.Прочитать();
			Если Запись.Подразделение.Пустая() Тогда				
				ЗаполнитьЗначенияСвойств(Запись,Отбор);
				Запись.НомерШК=1000;
			КонецЕсли;	
			Запись.НомерШК=(Формат(Запись.НомерШК+1,"ЧЦ=6; ЧДЦ=0; ЧВН=; ЧГ="));
			Запись.Записать();
			
			НомерШК = Число(Запись.НомерШК);
			
			ЗафиксироватьТранзакцию();
		Исключение		
			ЗаписатьВЛог("ошибка записи последнего номера ШК ЛН","ШК: "+НомерШК + " .ЛН : " +Номер+" Код поиска 6. ","Информация") ;
			ОтменитьТранзакцию();
		КонецПопытки;
		
		Если НомерШК<>0 Тогда
			ПрефиксШК		= Прав(Строка(Год(ТекущаяДата())),1);		
			если ПрефиксШК="0" тогда
				ПрефиксШК="5";
			КонецЕсли;
			ШКЛистаНабора 	= ПрефиксШК + (Формат(НомерШК,"ЧЦ=6; ЧДЦ=0; ЧВН=; ЧГ="));					
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры
////Кухарь 19.05.16 конец

Процедура ПрописатьНомераКоробокЛН()	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка,ТипШК,КоличествоКоробок
	|ИЗ
	|	Документ.ЛистНабора
	|ГДЕ
	|	ДокОснование = &ДокОснование  
	|	И Проведен
	|УПОРЯДОЧИТЬ ПО
	|	Номер
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("ДокОснование",ДокОснование);
	Выборка = Запрос.Выполнить().Выбрать();
	//крохин конец 15.11.2013
	Сч = 1;
	Пока Выборка.Следующий() Цикл
		ТекЛистНабора = Выборка.Ссылка;
		
		НаборЗаписей = РегистрыСведений.ИнформацияШКЛН.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ШКЛистаНабора.Установить(Выборка.ШКЛистаНабора,Истина);		
		НаборЗаписей.Прочитать();
		
		СписокШК = Новый Соответствие;
		Для Каждого Запись ИЗ НаборЗаписей Цикл
			СписокШК.Вставить(Запись.НомерКоробкиЛН,Запись.ШК);	 
		КонецЦикла;
		
		Если Выборка.ТипШК=Перечисления.ТипыШтрихКодов.Коробка Тогда
			
			Для Счетчик=1 По Выборка.КоличествоКоробок Цикл	
				ТекШКЛистаНабора = СписокШК.Получить(""+Счетчик);
				Если ТекШКЛистаНабора <> Неопределено Тогда
					НовыйНаборЗаписей = РегистрыСведений.ИнформацияШКЛН.СоздатьНаборЗаписей();
					НовыйНаборЗаписей.Отбор.ШКЛистаНабора.Установить(Выборка.ШКЛистаНабора,Истина);					
					НовыйНаборЗаписей.Отбор.ШК.Установить(ТекШКЛистаНабора,Истина);
					
					НовыйНаборЗаписей.Прочитать();
					Для Каждого Запись Из НовыйНаборЗаписей Цикл
						Запись.НомерКоробки = Сч;
					КонецЦикла;
					Сч = Сч + 1;
					НовыйНаборЗаписей.Записать();
					//крохин начало 09.12.2013
					//коробок больше, чем было
				Иначе	
					//крохин конец 09.12.2013
				КонецЕсли;
			КонецЦикла;
		Иначе
			ТекШКЛистаНабора 	= Выборка.ШКЛистаНабора;
			НовыйНаборЗаписей 	= РегистрыСведений.ИнформацияШКЛН.СоздатьНаборЗаписей();
			
			НовыйНаборЗаписей.Отбор.ШКЛистаНабора.Установить(Выборка.ШКЛистаНабора,Истина);			
			НовыйНаборЗаписей.Отбор.ШК.Установить(ТекШКЛистаНабора,Истина);			
			НовыйНаборЗаписей.Прочитать();
			Для Каждого Запись Из НовыйНаборЗаписей Цикл
				Запись.НомерКоробки = Сч;
			КонецЦикла;
			НовыйНаборЗаписей.Записать();
			Сч = Сч + 1;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьТаблицуСтрокПН()
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Ссылка.ДокОснование		КАК Накладная,
	|	0 						КАК НомерСтрокиПН_Число,
	|   НомерСтрокиПланаНабора	КАК НомерСтрокиПН_Строка
	|ИЗ
	|	Документ.ЛистНабора.СтрокиПлановНабора
	|ГДЕ
	|	Ссылка=&Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	НомераСтрок=Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТЧ Из НомераСтрок Цикл
		СтрокаТЧ.НомерСтрокиПН_Число=Число(СтрокаТЧ.НомерСтрокиПН_Строка);	
	КонецЦикла;	
	
	Возврат НомераСтрок;
КонецФункции //ПолучитьТаблицуСтрокПН()

Функция ПроверитьОшибкиПоПланамНабора()
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ * ПОМЕСТИТЬ НомераСтрок ИЗ &НомераСтрок КАК НомераСтрок
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеСтрокиЛН.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СписокЛН
	|ИЗ
	|	Документ.ЛистНабора.СтрокиПлановНабора КАК ВсеСтрокиЛН		
	|ПРАВОЕ СОЕДИНЕНИЕ
	|	НомераСтрок	
	|ПО
	|	ВсеСтрокиЛН.Ссылка.ДокОснование		=НомераСтрок.Накладная		
	|	И (ВсеСтрокиЛН.Ссылка.Проведен ИЛИ ВсеСтрокиЛН.Ссылка=&Ссылка)
	|	И ВсеСтрокиЛН.НомерСтрокиПланаНабора=НомераСтрок.НомерСтрокиПН_Строка
	|;
	|ВЫБРАТЬ
	|	Коллекция,
	|	СУММА(КоличествоПлан) 	КАК КоличествоПлан,
	|	СУММА(КоличествоФакт) 	КАК КоличествоФакт,
	|	СУММА(КоличествоПлан)-СУММА(КоличествоФакт) КАК Отклонение
	|ИЗ
	|(	
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА Коллекция.ЭтоГруппа ТОГДА Коллекция ИНАЧЕ Коллекция.Родитель.Родитель КОНЕЦ КАК Коллекция,	
	|	Количество	КАК КоличествоПлан,
	|	0			КАК КоличествоФакт	
	|ИЗ 
	|	Документ.ПланНабора.тБрэндов КАК тБрэндов
	|ПРАВОЕ СОЕДИНЕНИЕ
	|	НомераСтрок
	|ПО
	|	тБрэндов.Ссылка.ДокОснование	= НомераСтрок.Накладная	
	|	И тБрэндов.НомерСтроки			= НомераСтрок.НомерСтрокиПН_Число	
	|	И тБрэндов.Ссылка.Проведен
	|ОБЪЕДИНИТЬ ВСЕ 
	|ВЫБРАТЬ
	|	Номенклатура.Родитель.Родитель,	
	|	0			КАК КоличествоПлан,
	|	Количество	КАК КоличествоФакт	
	|ИЗ
	|	Документ.ЛистНабора.Товары КАК ТЧТовары
	|ПРАВОЕ СОЕДИНЕНИЕ
	|	СписокЛН 
	|ПО
	|	ТЧТовары.Ссылка=СписокЛН.Ссылка
	|) КАК Сводный
	|СГРУППИРОВАТЬ ПО 
	|	Коллекция
	|ИМЕЮЩИЕ 
	|	СУММА(КоличествоПлан)<>СУММА(КоличествоФакт) 
	|";	
	
	Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
	Запрос.УстановитьПараметр("НомераСтрок",	ПолучитьТаблицуСтрокПН());
	
	Результат	= Запрос.Выполнить();	
	Выборка		= Результат.Выбрать();
	
	Возврат	(Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Отклонение)); 	
КонецФункции
// Кухарь А.Ю. 20.01.2020 начало
//
Функция ПроверитьОшибкиПоЗНБ()
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ЗНБ.Номенклатура КАК Номенклатура,
	|	СУММА(ЕСТЬNULL(ЗНБ.Количество, 0)) КАК Количество,
	|	ЗНБ.Ссылка.Накладная КАК Накладная,
	|	ЗНБ.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ тЗНБ
	|ИЗ
	|	Документ.ЗаданиеНабора.Товары КАК ЗНБ
	|ГДЕ
	|	ЗНБ.Ссылка.Ссылка В(&СписокЗНБ)
	|	И ЗНБ.Ссылка.Дата >= &Дата
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗНБ.Номенклатура,
	|	ЗНБ.Ссылка.Накладная,
	|	ЗНБ.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛистНабораТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ЛистНабораТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ тЛН
	|ИЗ
	|	Документ.ЛистНабора КАК ЛистНабора
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистНабора.Товары КАК ЛистНабораТовары
	|		ПО (ЛистНабораТовары.Ссылка = ЛистНабора.Ссылка)
	|ГДЕ
	|	ЛистНабора.Дата >= &Дата
	|	И ЛистНабора.Проведен
	|	И ЛистНабора.ЗаданияНабора.ЗаданиеНабора В(&СписокЗНБ)
	|	И ЛистНабора.ДокОснование = &Накладная
	// Кухарь А.Ю. 09.06.2021 начало
	// Иногда ЛН грузятся с ТСД и их нужно проверить перед тем как с ними сравнивать
	|	И НЕ ЛистНабора.ТребуетПроверки
	// Кухарь А.Ю. 09.06.2021 конец
	
	|
	|СГРУППИРОВАТЬ ПО
	|	ЛистНабораТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тЗНБ.Номенклатура КАК Номенклатура,
	|	СУММА(ЕСТЬNULL(тЗНБ.Количество, 0)) КАК План,
	|	СУММА(ЕСТЬNULL(тЛН.Количество, 0)) КАК Факт,
	|	тЗНБ.Ссылка КАК ЗНБ
	|ИЗ
	|	тЗНБ КАК тЗНБ
	|		ПОЛНОЕ СОЕДИНЕНИЕ тЛН КАК тЛН
	|		ПО тЗНБ.Номенклатура = тЛН.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	тЗНБ.Номенклатура,
	|	тЗНБ.Ссылка
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЕСТЬNULL(тЗНБ.Количество, 0)) <> СУММА(ЕСТЬNULL(тЛН.Количество, 0))";
	запрос.УстановитьПараметр("Дата",ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования()-30*24*3600);
	запрос.УстановитьПараметр("СписокЗНБ",ЗаданияНабора.ВыгрузитьКолонку("ЗаданиеНабора"));
	запрос.УстановитьПараметр("Накладная",ДокОснование);
	ТЗОшибок=запрос.Выполнить().Выгрузить();
	если ТЗОшибок.НайтиСтроки(новый Структура("План",0)).Количество()>0 тогда
		ОтсканировалиНеТотЗНБ=Истина;
	иначе
		ОтсканировалиНеТотЗНБ=ложь;		
	КонецЕсли;
	ТЗОшибок.Свернуть("ЗНБ");
	возврат ТЗОшибок;
КонецФункции

// Кухарь А.Ю. 20.01.2020 конец


//Кухарь 26.09.16 начало
// Кухарь А.Ю. 09.09.2020 начало
//для вызова из обработок
//Процедура  ЗаполнитьТЧПереклейка()
Процедура  ЗаполнитьТЧПереклейка() экспорт 
	СтараяТЗПереклейки=Переклейка.Выгрузить();
	//Нужно учитывать что часть позиций переклеено уже в других ЛН
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ЛистНабораПереклейка.Номенклатура КАК Номенклатура,
	|	СУММА(ЛистНабораПереклейка.Заявка) КАК Заявка,
	|	ЛистНабораПереклейка.Продукция КАК Продукция
	|ИЗ
	|	Документ.ЛистНабора.Переклейка КАК ЛистНабораПереклейка
	|ГДЕ
	|	ЛистНабораПереклейка.Ссылка <> &Ссылка
	|	И ЛистНабораПереклейка.Ссылка.ДокОснование = &ДокОснование
	|	И ЛистНабораПереклейка.Ссылка.Проведен
	|	И ЛистНабораПереклейка.Ссылка.Дата >= &Дата
	|
	|СГРУППИРОВАТЬ ПО
	|	ЛистНабораПереклейка.Номенклатура,
	|	ЛистНабораПереклейка.Продукция";
	запрос.УстановитьПараметр("Ссылка",Ссылка);
	запрос.УстановитьПараметр("ДокОснование",ДокОснование);
	запрос.УстановитьПараметр("Дата",ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования()-30*24*3600);	
	
	ТЗУжеПереклеили=запрос.выполнить().выгрузить();
	
	НужноПереклеивать=истина;

	// Кельманов А.В. - Оптимизация работы - 2026.04.23 {
	//Переклейка.Очистить();
	Если Переклейка.Количество() > 0 Тогда
		
		Переклейка.Очистить(); 
		
	КонецЕсли;
	// Кельманов А.В. - Оптимизация работы - 2026.04.23 }

	ТЗПереклейки=Переклейка.Выгрузить();
	ТЗТоваров=Товары.Выгрузить();
	ТЗТоваров.Свернуть("Номенклатура","Количество");
	
	ТЗТоваров.Колонки.Добавить("КМП");

	ПереклейкаНеНужна=ложь;
	запрос=новый Запрос;
	запрос.Текст="ВЫБРАТЬ
	|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита как ФиктивнаяПереклейка
	|ИЗ
	|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
	|ГДЕ
	|	РеквизитыРНКПНКПРМ.Документ = &Документ
	|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = ""ФиктивнаяПереклейка"""; 
	запрос.УстановитьПараметр("Документ",ДокОснование);
	результат=запрос.Выполнить().выбрать();
	пока результат.Следующий() цикл
		если результат.ФиктивнаяПереклейка=истина тогда
			ПереклейкаНеНужна=истина;
		КонецЕсли;
	КонецЦикла;
	
	//Отгрузка части позиций по матрице	
	ЧастьНоменклатурыПоМатрице=ложь;
	запрос=новый Запрос;
	запрос.Текст="ВЫБРАТЬ
	|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита как ЧастьНоменклатурыПоМатрице
	|ИЗ
	|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
	|ГДЕ
	|	РеквизитыРНКПНКПРМ.Документ = &Документ
	|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = ""ЧастьНоменклатурыПоМатрице"""; 
	запрос.УстановитьПараметр("Документ",ДокОснование);
	результат=запрос.Выполнить().выбрать();
	пока результат.Следующий() цикл
		если результат.ЧастьНоменклатурыПоМатрице=истина тогда
			ЧастьНоменклатурыПоМатрице=истина;
		КонецЕсли;
	КонецЦикла;
	
	если ПереклейкаНеНужна тогда
		Возврат;
	КонецЕсли;

	если ДокОснование.ОтгрузкаКомплектов и ПереклейкаНеНужна=Ложь тогда
		
		ТЗКомплектующие=ДокОснование.Комплектующие.Выгрузить();
		
		ТЗКомплектующие.Колонки.Добавить("УжеПереклеено",новый ОписаниеТипов("Число")); 
		
		для каждого СтрТз из ТЗТоваров цикл
			СтруктураОтбора 	= Новый Структура;
			
			ТекНоменклатура = СтрТз.Номенклатура;
			СтруктураОтбора.Вставить("Номенклатура", ТекНоменклатура);

			НайденныеСтроки = ТЗКомплектующие.НайтиСтроки(СтруктураОтбора);
			
			//Иногда из 1й номенклатуры делается продукция + сама номенклатура. Удалим строчку с самой номенклатурой
			если НайденныеСтроки.Количество()>1 тогда
				Кол=НайденныеСтроки.Количество();
				Для сч = 0 по Кол-1 цикл
					СтрМасс=НайденныеСтроки.Получить(Кол-сч-1);
					если СтрМасс.Номенклатура=СтрМасс.продукция тогда
						НайденныеСтроки.Удалить(Кол-сч-1);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;

			//Выкинем строчки по  продукции которую завершили
			КоличествоУдалённогоТовара=0;			
			если НайденныеСтроки.Количество()>1 тогда
				ОсталосьПереклеить=0;
				МассУдаляемыхСтрок=новый Массив;
				Для Сч = 0 По НайденныеСтроки.Количество() - 1 Цикл	
					НайденнаяСтрока = НайденныеСтроки[Сч];
					МассСтрокПереклейки=ТЗУжеПереклеили.НайтиСтроки(новый Структура("Продукция",НайденнаяСтрока.Продукция));
					УжеПереклееноКМП=0;
					Для каждого СтрПереклейкиПоКМП из МассСтрокПереклейки цикл
						УжеПереклееноКМП=УжеПереклееноКМП+СтрПереклейкиПоКМП.Заявка;
					КонецЦикла;
					если УжеПереклееноКМП>=НайденнаяСтрока.Количество тогда
						МассУдаляемыхСтрок.Добавить(НайденнаяСтрока);
					иначе
						ОсталосьПереклеить= НайденнаяСтрока.Количество-УжеПереклееноКМП;
					КонецЕсли;	
					НайденнаяСтрока.УжеПереклеено=УжеПереклееноКМП 
				КонецЦикла;			
				
				для каждого СтрМассУдаления из МассУдаляемыхСтрок цикл
					КоличествоУдалённогоТовара=КоличествоУдалённогоТовара+СтрМассУдаления.Количество;
					Индекс=НайденныеСтроки.Найти(СтрМассУдаления);
					НайденныеСтроки.Удалить(Индекс);
				КонецЦикла;
			КонецЕсли;
			ТЗУжеПереклеили.Свернуть("Номенклатура,Продукция","Заявка");				
			НайденныеСтрокиПереклейки=ТЗУжеПереклеили.НайтиСтроки(СтруктураОтбора);
			УжеПереклеили=0;
			Для каждого СтрМассПер из НайденныеСтрокиПереклейки цикл
				УжеПереклеили=УжеПереклеили+СтрМассПер.Заявка;
			КонецЦикла;	

			УжеПереклеили=УжеПереклеили-КоличествоУдалённогоТовара;				

			если НайденныеСтроки.Количество()=0 тогда
				ОстатокТовара=0;
			иначе
				Если ДокОснование.Контрагент.Код = "SSP-5862" или ДокОснование.Контрагент.Код = "SSR-9059"  или ДокОснование.Контрагент.Код = "SST-1208"  тогда				 
					КоличествоПродукции=НайденныеСтроки.получить(0).КоличествоПродукции;
					если КоличествоПродукции=0 тогда
						КоличествоПродукции=НайденныеСтроки.получить(0).Количество;
					КонецЕсли;
					КоэффициентКомплектации=НайденныеСтроки.получить(0).Количество/КоличествоПродукции; 
					если НайденныеСтроки.Количество()=1 и КоэффициентКомплектации=1 тогда
						КоличествоЗапчастей=НайденныеСтроки.Получить(0).количество;
					иначе
						КоличествоЗапчастей=СтрТз.количество/КоэффициентКомплектации;
					КонецЕсли;
					
					ОстатокТоваров = КоличествоПродукции-УжеПереклеили;
					
					если НайденныеСтроки.Количество()>1 тогда
						ОстатокТоваров=0;
						для каждого СтрТЗНайденныхСтрок из НайденныеСтроки цикл
							КоличествоПродукции=СтрТЗНайденныхСтрок.КоличествоПродукции;
							если КоличествоПродукции=0 тогда
								КоличествоПродукции=СтрТЗНайденныхСтрок.Количество;
							КонецЕсли;
							
							КоэффициентКомплектации=СтрТЗНайденныхСтрок.Количество /КоличествоПродукции;
							КоличествоЗапчастей=СтрТз.количество/КоэффициентКомплектации;
							ОстатокТоваров=ОстатокТоваров+КоличествоПродукции;
							КоличествоПродукции=КоличествоПродукции-СтрТЗНайденныхСтрок.УжеПереклеено;	
						КонецЦикла;
						
					КонецЕсли;
				иначе
					
					ОстатокТоваров = СтрТЗ.Количество-УжеПереклеили;	
					если НайденныеСтроки.Количество()>1 и ОсталосьПереклеить>0  тогда
						ОстатокТоваров=ОсталосьПереклеить-УжеПереклеили;
					КонецЕсли;
				КонецЕсли;			
			КонецЕсли;

			ОсталосьРаспределить=СтрТз.Количество; 
			
			если НайденныеСтроки.Количество()=1 тогда
				если НайденныеСтроки.получить(0).Номенклатура= НайденныеСтроки.получить(0).Продукция   тогда
					Продолжить;
				иначе
					СтрокаПереклейки = ТЗПереклейки.Добавить();
					СтрокаПереклейки.Продукция = НайденныеСтроки.получить(0).Продукция;
					СтрокаПереклейки.Номенклатура=ТекНоменклатура;
					Если ДокОснование.Контрагент.Код = "SSP-5862" или ДокОснование.Контрагент.Код = "SSR-9059" или ДокОснование.Контрагент.Код = "SST-1208" тогда
						КоличествоПродукции=НайденныеСтроки.получить(0).КоличествоПродукции;
						если КоличествоПродукции=0 тогда
							КоличествоПродукции=НайденныеСтроки.получить(0).Количество;
						КонецЕсли;
						КоэффициентКомплектации=НайденныеСтроки.получить(0).Количество/КоличествоПродукции; 
						если НайденныеСтроки.Количество()=1 и КоэффициентКомплектации=1 тогда
							КоличествоЗапчастей=НайденныеСтроки.Получить(0).количество;
						иначе
							КоличествоЗапчастей=СтрТз.количество/КоэффициентКомплектации;
						КонецЕсли;

						СтрокаПереклейки.Заявка = мин(КоличествоПродукции-УжеПереклеили,КоличествоЗапчастей); 
						СтрокаПереклейки.Заявка = мин(СтрокаПереклейки.Заявка,СтрТз.количество);  
					иначе
						СтрокаПереклейки.Заявка = мин(НайденныеСтроки.получить(0).Количество-УжеПереклеили,СтрТз.количество);	
					КонецЕсли;
					
					ОстатокТоваров=ОстатокТоваров-СтрокаПереклейки.Заявка;
					СтрТз.КМП=истина;
					
					если СтрокаПереклейки.заявка=0 тогда
						Индекс=ТЗПереклейки.Индекс(СтрокаПереклейки);
						ТЗПереклейки.Удалить(Индекс);
					КонецЕсли;
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Для Сч = 0 По НайденныеСтроки.Количество() - 1 Цикл
				НайденнаяСтрока = НайденныеСтроки[Сч];	
				
				Если ОстатокТоваров > 0  Тогда
					
					если ОсталосьРаспределить=0 тогда Прервать;КонецЕсли; 

					если НайденнаяСтрока.номенклатура<>НайденнаяСтрока.Продукция тогда
						СтрокаПереклейки = ТЗПереклейки.Добавить();
						СтрокаПереклейки.Продукция = НайденнаяСтрока.Продукция;
						СтрокаПереклейки.Номенклатура=ТекНоменклатура;

						Если ДокОснование.Контрагент.Код = "SSP-5862" тогда
							КоличествоПродукции=НайденныеСтроки.получить(0).КоличествоПродукции;
							если КоличествоПродукции=0 тогда
								КоличествоПродукции=НайденныеСтроки.получить(0).Количество;
							КонецЕсли;
							КоэффициентКомплектации=НайденныеСтроки.получить(0).Количество/КоличествоПродукции; 
							
							СтрокаПереклейки.Заявка = мин(Мин(ОстатокТоваров,(НайденнаяСтрока.Количество-НайденнаяСтрока.УжеПереклеено)/КоэффициентКомплектации),СтрТз.количество);
						иначе
							СтрокаПереклейки.Заявка = мин(Мин(ОстатокТоваров,НайденнаяСтрока.Количество),СтрТз.количество);	
						КонецЕсли;
					КонецЕсли;

					Если СтрокаПереклейки <> Неопределено Тогда
						ОстатокТоваров = ОстатокТоваров - СтрокаПереклейки.Заявка;	
						ОсталосьРаспределить=ОсталосьРаспределить - СтрокаПереклейки.Заявка; 
					Иначе
						ОстатокТоваров = ОстатокТоваров - НайденнаяСтрока.Количество;
						ОсталосьРаспределить=ОсталосьРаспределить - СтрокаПереклейки.Заявка; 
					КонецЕсли;
					
					СтрТз.КМП=истина;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;		
	КонецЕсли;	

	ТЗПереклейки.Свернуть("Номенклатура,Продукция,ШтрихКод","Заявка");
	
	для каждого СтрТз из ТЗПереклейки цикл
		СтрТЗ.ШтрихКод=ПолучитьШтрихКодТовара(СтрТз.Продукция);
	КонецЦикла;

	если (ДокОснование.Контрагент.ИспользоватьНоменклатурнуюМатрицу или ЧастьНоменклатурыПоМатрице) и ТипШК<>Перечисления.ТипыШтрихКодов.Коробка и не ДокОснование.Договор.НеИспользоватьМатрицу   тогда		

		СтруктураОтбора=новый Структура;
		для каждого стрТЗ из ТЗПереклейки цикл

			если ПереклейкаНеНужна тогда
				СтрТз.ШтрихКод=ПолучитьШККонтрагентаИзМатрицы(СтрТз.Номенклатура);				
			иначе
				СтрТз.ШтрихКод=ПолучитьШККонтрагентаИзМатрицы(СтрТз.продукция);
			КонецЕсли;
		КонецЦикла;
		
		Для каждого СтрТч из Товары цикл
			ТекНоменклатура = СтрТЧ.Номенклатура;
			СтруктураОтбора.Вставить("Номенклатура", ТекНоменклатура);
			Масс=ТЗПереклейки.НайтиСтроки(СтруктураОтбора);
			если Масс.Количество()=1 тогда
				ОстКол=СтрТч.Количество-Масс.Получить(0).заявка;
			иначе
				ОстКол=СтрТч.Количество;
			КонецЕсли;
			
			если   СтрТч.ТипШК=Перечисления.ТипыШтрихКодов.Штука тогда
				если СтрТч.ШК<>СтрТч.ШКМатрицы и СтрТч.ШК<>СтрТч.ШККонтрагентаДополнительный и ОстКол>0 и СтрТч.ШКМатрицы<>""  тогда	 //Раскомментировать
					СтрокаПереклейки = ТЗПереклейки.Добавить();
					СтрокаПереклейки.Продукция = СтрТч.Номенклатура;
					СтрокаПереклейки.Номенклатура=СтрТч.Номенклатура;
					СтрокаПереклейки.заявка = ОстКол;
					СтрокаПереклейки.ШтрихКод=СтрТч.ШКМатрицы;
				КонецЕсли;
			иначе
				если  ОстКол>0 и СтрТч.ШКМатрицы<>"" тогда
					запрос=новый запрос;
					запрос.Текст="ВЫБРАТЬ
					|	ШтрихКоды.Ссылка
					|ИЗ
					|	Справочник.ШтрихКоды КАК ШтрихКоды
					|ГДЕ
					|	ШтрихКоды.Наименование в (&Наименование)
					|	И ШтрихКоды.Владелец = &Владелец
					|	И ШтрихКоды.ТипШК = &ТипШК";
					СписокШК=новый СписокЗначений;
					СписокШК.Добавить(СтрТч.ШКМатрицы);
					если СтрТч.ШККонтрагентаДополнительный<>"" тогда   //Раскомментировать
						СписокШК.Добавить(СтрТч.ШККонтрагентаДополнительный);              
					КонецЕсли;                                         //Раскомментировать
					запрос.УстановитьПараметр("Наименование",СписокШК);
					
					запрос.УстановитьПараметр("Владелец",СтрТч.Номенклатура);
					запрос.УстановитьПараметр("ТипШК",Перечисления.ТипыШтрихКодов.Штука);
					результат=запрос.Выполнить().Выгрузить();
					если результат.Количество()=0 тогда
						ЕстьТакойШК=ложь;
					иначе
						ЕстьТакойШК=Истина;
					КонецЕсли;
					если не ЕстьТакойШК тогда
						СтрокаПереклейки = ТЗПереклейки.Добавить();
						СтрокаПереклейки.Продукция = СтрТч.Номенклатура;
						СтрокаПереклейки.Номенклатура=СтрТч.Номенклатура;
						СтрокаПереклейки.заявка = ОстКол;
						СтрокаПереклейки.ШтрихКод=СтрТч.ШКМатрицы;
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ТЗПереклейки.Свернуть("Номенклатура,Продукция,ШтрихКод","Заявка");
	
	// Кельманов А.В. - Оптимизация работы - 2026.04.23 {
	//Переклейка.Загрузить(ТЗПереклейки);
	Если ТЗПереклейки.Количество() > 0 Тогда
		
		Переклейка.Загрузить(ТЗПереклейки);
		
	КонецЕсли;
	// Кельманов А.В. - Оптимизация работы - 2026.04.23 }
	
	//Чтобы не потерять то, что уже отсканировали
	для Каждого СтрПер из Переклейка цикл
		Отбор=новый Структура;
		Отбор.Вставить("ШтрихКод",СтрПер.ШтрихКод);
		Отбор.Вставить("ДобавленоВРучную",ложь);
		МассСтрок=СтараяТЗПереклейки.НайтиСтроки(отбор);
		КоличествоТЗПер=0;
		для каждого СтрМасс из МассСтрок цикл
			если СтрПер.заявка=СтрМасс.Количество тогда
				КоличествоТЗПер=СтрМасс.количество;
			иначе 
				Продолжить;
			КонецЕсли;
		КонецЦикла;
		СтрПер.Количество=КоличествоТЗПер;	
	КонецЦикла;
	отбор=новый Структура;
	Отбор.Вставить("ДобавленоВРучную",Истина);
	МассСтарыхСтрока=СтараяТЗПереклейки.НайтиСтроки(Отбор);
	для каждого СтрТЗ из МассСтарыхСтрока цикл
		СтрТЧ=Переклейка.Добавить();
		ЗаполнитьЗначенияСвойств(СтрТч,СтрТз);
	КонецЦикла;
	Отбор=новый Структура("Заявка",0);
	МассНулей=ТЗПереклейки.НайтиСтроки(Отбор);
	для каждого СтрНулей из МассНулей цикл
		Инд=ТЗПереклейки.Индекс(СтрНулей);
		ТЗПереклейки.Удалить(Инд);
	КонецЦикла;
КонецПроцедуры


Функция ПолучитьШККонтрагентаИзМатрицы(Номенклатура)
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "
	|ВЫБРАТЬ
	|	МатрицаТовары.ШККонтрагента
	|ИЗ
	|	Документ.Матрица.Товары КАК МатрицаТовары
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	|ПО 
	|	МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
	|ГДЕ
	|	МатрицаТовары.Ссылка.Проведен
	|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
	|	И МатрицаТовары.Ссылка.Договор = &Договор
	|	И МатрицаТовары.Ссылка.Дата <= &Дата
	|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ДатаОкончания
	|	И МатрицаПунктыДоставки.ПунктДоставки = &ПунктДоставки
	|	И МатрицаТовары.Номенклатура = &Номенклатура";
	запрос.УстановитьПараметр("ПунктДоставки",ДокОснование.ПунктДоставки);
	Запрос.УстановитьПараметр("Дата",ДокОснование.Дата);
	Запрос.УстановитьПараметр("ДатаОкончания",ДокОснование.Дата);
	Запрос.УстановитьПараметр("Договор",ДокОснование.договор);	
	Запрос.УстановитьПараметр("Контрагент",ДокОснование.Контрагент);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Попытка
		Если ДокОснование.Ссылка.ПостояннаяАкция Тогда
			Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
		Иначе
			Запрос.Текст = Запрос.Текст +" И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция";
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	результат=запрос.Выполнить().Выбрать();
	пока результат.Следующий() цикл
		если СокрЛП(результат.ШККонтрагента)<>"" тогда
			Возврат результат.ШККонтрагента;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ""
КонецФункции	

Процедура 	ЗаполнитьШКМатрицы ()
	запрос=новый запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МатрицаТовары.Номенклатура КАК Номенклатура,
	|	МатрицаТовары.КратностьКоробки КАК КратностьКоробки,
	|	МатрицаТовары.ШККонтрагента КАК ШККонтрагента
	|ИЗ
	|	Документ.Матрица.Товары КАК МатрицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
	|ГДЕ
	|	МатрицаТовары.Ссылка.Проведен
	|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
	|	И МатрицаТовары.Ссылка.Договор = &Договор
	|	И МатрицаТовары.Ссылка.Дата <= &Дата1
	|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
	|	И МатрицаПунктыДоставки.ПунктДоставки = &ПунктДоставки
	|	И МатрицаТовары.Номенклатура В(&Номенклатура)";
	
	
	Попытка
		Если ДокОснование.Ссылка.ПостояннаяАкция Тогда
			Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
		Иначе
			Запрос.Текст = Запрос.Текст +" И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция";
		КонецЕсли;
	Исключение
	КонецПопытки;	
	
	
	Запрос.УстановитьПараметр("Дата2",НачалоДня(Дата));
	Запрос.УстановитьПараметр("Дата1",КонецДня(Дата));
	Запрос.УстановитьПараметр("Контрагент",ДокОснование.Контрагент);
	Запрос.УстановитьПараметр("ПунктДоставки",ДокОснование.ПунктДоставки);
	Запрос.УстановитьПараметр("Договор",ДокОснование.Договор);
	Запрос.УстановитьПараметр("Номенклатура",Товары.ВыгрузитьКолонку("Номенклатура"));
	
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура");
	ТЗ.Колонки.Добавить("ШККонтрагента");
	ТЗ.Колонки.Добавить("КратностьКоробки");
	Пока Выборка.Следующий() Цикл
		СтрокаТЗ = ТЗ.Добавить();
		СтрокаТЗ.Номенклатура = Выборка.Номенклатура;
		СтрокаТЗ.ШККонтрагента = Выборка.ШККонтрагента;
		СтрокаТЗ.КратностьКоробки = Выборка.КратностьКоробки;			
	КонецЦикла;
	
	
	
	Для Каждого СтрокаТЧ Из Товары Цикл
		Если СтрокаТЧ.Количество = 0 Тогда Продолжить Конецесли;
		Если ДокОснование.ОтгрузкаКомплектов Тогда
			НадоКонтролировать = Ложь;
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Продукция", СтрокаТЧ.Номенклатура);
			НайденныеСтроки = ДокОснование.Комплектующие.НайтиСтроки(ПараметрыОтбора);
			Для СЧ = 0 По НайденныеСтроки.Количество()-1 Цикл
				НайденнаяСтрока = НайденныеСтроки.Получить(Сч);
				Если НайденнаяСтрока.Номенклатура = НайденнаяСтрока.продукция Тогда
					НадоКонтролировать = Истина;
				КонецЕсли;
			КонецЦикла;
			Если НЕ НадоКонтролировать Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Отбор = новый Структура;
		Отбор.Вставить("Номенклатура",СтрокаТЧ.Номенклатура);
		СтрокиМатриц = ТЗ.НайтиСтроки(Отбор); 
		Если СтрокиМатриц.Количество() = 0 Тогда
			ВсеХорошо = Ложь;			
		Иначе
			ШКСовпадают = Ложь;
			Если СтрокаТЧ.ТипШК = Перечисления.ТипыШтрихКодов.Штука ИЛИ СтрокаТЧ.ТипШК.Пустая() Тогда
				Для Каждого СтрокаМатриц Из СтрокиМатриц Цикл
					ТекШКМатрицы = СтрокаМатриц.ШККонтрагента;
					СтрокаТЧ.ШКМатрицы = ТекШКМатрицы;
					
				КонецЦикла;
			Иначе
				ТекШКШтуки = ПолучитьШтрихКодТовара(СтрокаТЧ.Номенклатура);
				КоличествоШКШтуки = 0;
				ЗапросКоличествоШКШтуки=Новый Запрос;
				ЗапросКоличествоШКШтуки.Текст="
				|ВЫБРАТЬ
				|    Ссылка,
				|	Наименование
				|ИЗ
				|	Справочник.ШтрихКоды КАК ШтрихКоды
				|ГДЕ
				|	Владелец = &Владелец
				|	И ТипШК = &ТипШК";
				
				ЗапросКоличествоШКШтуки.УстановитьПараметр("Владелец",СтрокаТЧ.Номенклатура);
				ЗапросКоличествоШКШтуки.УстановитьПараметр("ТипШК",Перечисления.ТипыШтрихКодов.Штука);
				ВыборкаКоличествоШКШтуки = ЗапросКоличествоШКШтуки.Выполнить().Выбрать();
				КоличествоШКШтуки = ВыборкаКоличествоШКШтуки.Количество();
				Если КоличествоШКШтуки = 1 Тогда
					Для Каждого СтрокаМатриц Из СтрокиМатриц Цикл
						ТекШКМатрицы = СтрокаМатриц.ШККонтрагента;
						СтрокаТЧ.ШКМатрицы = ТекШКМатрицы;
					КонецЦикла;
				Иначе
					Для Каждого СтрокаМатриц Из СтрокиМатриц Цикл
						ТекШКМатрицы = СтрокаМатриц.ШККонтрагента;
						СтрокаТЧ.ШКМатрицы = ТекШКМатрицы;
						Прервать;
					КонецЦикла;
					Сообщить("по номенклатуре "+СтрокаТЧ.Номенклатура+ "заведено "+КоличествоШКШтуки +" ШК штуки, проверьте штрихкод на соответствие матрице. Номер строки "+СтрокаТЧ.НомерСтроки);
				КонецЕсли;				
			Конецесли;
		КонецЕсли;		
	КонецЦикла;
КонецПроцедуры

Функция ЕстьЛистыПереукладки() Экспорт
	ЛП=ПолучитьЛистыПереукладки(ДокОснование);
	Возврат ЛП.Количество()>0;
КонецФункции //ЕстьЛистыПереукладки()

Функция СостояниеДопустимо(Состояние,ВидДокументаОснования)
	Результат=Истина;
	Если ВидДокументаОснования="ПриходнаяНакладная" Тогда
		Если Состояние=Перечисления.СостоянияНакладной.Принята Тогда
			Результат=Ложь;
		КонецЕсли;
	ИначеЕсли ВидДокументаОснования="РасходнаяНакладная" Тогда
		Если Состояние=Перечисления.СостоянияНакладной.Отгружена Тогда
			Результат=Ложь;
		КонецЕсли;
	ИначеЕсли ВидДокументаОснования="Перемещение" Тогда
		КодСкладаОтправителя=ПолучитьРеквизитШапки(ДокОснование,"Склад.КодФизическогоУзла","Документ");
		Если КодСкладаОтправителя=ПараметрыСеанса.ЭтотУзел.Код Тогда
			Если Состояние=Перечисления.СостоянияНакладной.Отгружена Тогда
				Результат=Истина;
			КонецЕсли;
		Иначе
			Если Состояние=Перечисления.СостоянияНакладной.Принята Тогда
				Результат=Истина;
			КонецЕсли;			
		КонецЕсли;		
	ИначеЕсли ВидДокументаОснования="ПродажаИМ" Тогда		
		Если Состояние=Перечисления.СостоянияНакладной.Отгружена Тогда
			Результат=Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции // ()


Функция ПолучитьЧисловыеКодыСтрокПН()
	МР=Новый Массив;	
	Для Каждого СтрокаТЧ Из СтрокиПлановНабора Цикл
		МР.Добавить(Число(СтрокаТЧ.НомерСтрокиПланаНабора));	
	КонецЦикла;	
	Возврат МР;
КонецФункции //ПолучитьЧисловыеКодыСтрокПН() 


Процедура ДозаполнитьШтВКоробе()	
	ОтборПоНулям=Новый Структура;
	ОтборПоНулям.Вставить("ШтВКоробе",0);
	ТЗНулей		=Товары.НайтиСтроки(ОтборПоНулям);
	Для Каждого СтрТЗ из ТЗНулей цикл
		СтрТЗ.ШтВКоробе=СтрТЗ.Номенклатура.Родитель.ШтукВКоробке;
	КонецЦикла;
КонецПроцедуры

Функция ЕстьПаузаВСканировании() Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка	
	|ИЗ
	|	Документ.ПланНабора.тБрэндов
	|ГДЕ
	|	Ссылка.ДокОснование = &ДокОснование
	|	И НомерСтроки В (&СписокНомеров)
	|	И НачалоОстановкиСканирования>ДАТАВРЕМЯ(1,1,1)
	|";
	
	Запрос.УстановитьПараметр("ДокОснование",	ДокОснование);
	Запрос.УстановитьПараметр("СписокНомеров",	ПолучитьЧисловыеКодыСтрокПН());	
	
	Результат=Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
КонецФункции //ЕстьПаузаВСканировании()

Процедура ОбработатьПланНабора (ВидДокументаОснования)
	
	Если СтрНайти("Перемещение,РасходнаяНакладная,Комплектация",ВидДокументаОснования)<>0 Тогда
		ПланНабора=НайтиДокумент("ПланНабора",Новый Структура("ДокОснование,Проведен",ДокОснование,Истина));	 
		
		ЗНБсОшибками = ПроверитьОшибкиПоЗНБ();	 			
		ВремяОкончания 		= ТекущаяДата();
		ПланНабораОбъект 	= ПланНабора.ПолучитьОбъект();
		
		для каждого СтрЗНБ из ЗаданияНабора цикл
			ЗНБ=СтрЗНБ.ЗаданиеНабора;		
			Если ОтсканировалиНеТотЗНБ=Истина Тогда
				Отказ 		= Истина;				
				#Если Клиент Тогда
					Сообщить("Не совпадает номенклатура в планах набора и листе набора! Пересканируйте планы набора!");						
				#КонецЕсли	
				Отказ = Истина;	
			КонецЕсли;		
			СтароеСостояние=ЗНБ.СостояниеНакладной;
			если СтароеСостояние=Перечисления.СостоянияНакладной.ОжиданиеНабора или СтароеСостояние=Перечисления.СостоянияНакладной.ВНаборе тогда
				#Если Клиент Тогда
					Сообщить("Не закончен набор! Завершение сканирования невозможно!");	
				#КонецЕсли
				Продолжить;
			КонецЕсли;		
			
			если ПолучитьНомерСостоянияНакладной(СтароеСостояние)>745 тогда
				Продолжить;
			КонецЕсли;	
			
			СтрТЗ=ЗНБсОшибками.найти(ЗНБ);	
			если СтрТЗ=Неопределено тогда
				НовоеСостояние=ПолучитьНовоеСостояниеЗНБ (ЗНБ,Перечисления.СостоянияНакладной.Сканирование);
				НужноЗаканчиватьСканирование=Истина;	
			иначе
				НовоеСостояние=Перечисления.СостоянияНакладной.Сканирование;
				НужноЗаканчиватьСканирование=ложь;
			КонецЕсли;		
			
			если НовоеСостояние<>СтароеСостояние тогда			
				МассСтрок=ПланНабораОбъект.тБрэндов.найтистроки(новый Структура("НомерЧасти",ЗНБ.НомерЧасти)); 
				
				//Тимофеев Ю.А. 21.04.2026
				//https://yougile.collant.ru/team/ab6bad3a05c0/#SNL-105
				ADRESS.СнятьЗанятостьСотрудника(МассСтрок,Ссылка,"Лист набора");
				//Тимофеев Ю.А. 21.04.2026 
				
				для каждого СтрокаПН из МассСтрок цикл
					СтрокаПН.Состояние 				= НовоеСостояние;
					если НужноЗаканчиватьСканирование=Истина тогда
						СтрокаПН.ОкончаниеСканировки	= ВремяОкончания;
						СтрокаПН.СканировкаЗакончена	= Истина;
						СтрокаПН.ВремяТекущегоСостояния = ВремяОкончания; 
						
						 
						
						если СтрокаПН.НачалоСканировки=ПустаяДата() тогда
							СтрокаПН.НачалоСканировки=ВремяОкончания-1;
						КонецЕсли;
					КонецЕсли;					
				КонецЦикла;		 
			КонецЕсли;
		КонецЦикла;
		
		если ПланНабораОбъект.Модифицированность() тогда
			ПланНабораОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	КонецЕсли;			
КонецПроцедуры


//СОБЫТИЯ ДОКУМЕНТА
Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Основание) Тогда Возврат КонецЕсли; 
	
	ДокОснование	= Основание.Ссылка;
	
	ВидОснования	= ДокОснование.Метаданные().Имя;
	Если НЕ (ВидОснования="КонтрактСПроизводителем" или  ВидОснования="ЗаказПоставщику") тогда
		ИБ			= Основание.ИБ;
	Конецесли;
	Склад			= ДокОснование.Склад;		
	
	Если ВидОснования="Перемещение" Тогда
		РеквизитыШапки=ПолучитьРеквизитыШапки(ДокОснование,"Склад,СкладПолучатель","Документ");
		Если ПараметрыСеанса.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			СкладПользователя=ПолучитьЗначениеПоУмолчанию("ОсновнойСклад");
			Если ЗначениеЗаполнено(СкладПользователя) Тогда
				Если РеквизитыШапки.Склад=СкладПользователя Тогда
					//оставляем как есть склад документа
				ИначеЕсли РеквизитыШапки.СкладПолучатель=СкладПользователя Тогда
					Склад = РеквизитыШапки.СкладПолучатель;
				КонецЕсли; 			
			Иначе				
				Если РеквизитыШапки.Склад.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда
					//если для полдьзователя не задан склад то считаем что лист набора на отгрузку 
					//оставляем как есть склад документа
				ИначеЕсли РеквизитыШапки.СкладПолучатель.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда
					Склад = РеквизитыШапки.СкладПолучатель;									
				КонецЕсли;
			КонецЕсли;			
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.

	//Чтобы ничего не происходило, когда я обработкой заполняю ошибки сотрудников
	Если  ПараметрыСеанса.ЗапущенаОбработка Тогда Возврат КонецЕсли;

	Если Модифицированность() Тогда	
		ЗаданиеНабора = ОпределитьЗаданиеНабора();
	КонецЕсли;	
	
	если ТипШК<>Перечисления.ТипыШтрихКодов.Коробка тогда
		КоличествоКоробок = 1;
	КонецЕсли;

	Если ДополнительныеСвойства.Свойство("ЗагрузкаСТСД") Тогда
		ЭтоЗагрузкаСТСД = ДополнительныеСвойства.ЗагрузкаСТСД;
	Иначе
		ЭтоЗагрузкаСТСД = Ложь;
	КонецЕсли;

	Если (СозданНаТСД И ОбменДанными.Загрузка) Или ЭтоЗагрузкаСТСД Тогда
		ЗаполнениеЛНПриЗагрузкеСТСД();	
	КонецЕсли; 

	Если ДополнительныеСвойства.Свойство("УпрощенныйРежим") Тогда
		УпрощеннаяЗапись = ДополнительныеСвойства.УпрощенныйРежим;
	Иначе
		УпрощеннаяЗапись = Ложь;
	КонецЕсли;
	
	
	
	Если РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Или (СозданНаТСД И ОбменДанными.Загрузка) Или ЭтоЗагрузкаСТСД Тогда

		НеобходимостьПроверки = новый Структура("Успех",Истина);
		если НеобходимостьПроверки.Успех  тогда		
			
			если ТипЗнч(ДокОснование)=Тип("ДокументСсылка.ПриходнаяНакладная")  
				или (ТипЗнч(ДокОснование)=Тип("ДокументСсылка.РасходнаяНакладная") и ПолучитьРеквизитШапки(ДокОснование,"ТребуетсяМаркировка","Документ"))
				тогда 			 
				если не ОтключитьКонтрольСканирования и не УпрощеннаяЗапись тогда

					РезультатПРоверки = КонтрольКорректностиСканированияЧЗВЛЗ();    
					
					Если Не РезультатПРоверки.Успех Тогда
						
						Отказ = Истина;
						
						ВызватьИсключение РезультатПРоверки.Ошибки;
						
					КонецЕсли;

				КонецЕсли;

			КонецЕсли; 

		КонецЕсли;
		
	КонецЕсли;

	// Кельманов А.В. - Оптимизация работы - 2026.04.23 {
	//Если ОбменДанными.Загрузка Или ЭтоЗагрузкаСТСД Тогда Возврат КонецЕсли;
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
	// Кельманов А.В. - Оптимизация работы - 2026.04.23 }

	КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
	МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
	МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
	ЕстьИзменения	= Модифицированность();

	Если Отказ Тогда Возврат КонецЕсли;
	ЭтоУзел_ODN_или_OD7_И_ЕстьСтрокиПН=ОбщегоНазначения_ПИ.ЭтоУзел_ODN_или_OD7() И ЗаданияНабора.Количество()>0;

	ВидДокументаОснования=ДокОснование.Метаданные().Имя;
	
	
	// Кухарь А.Ю.  11.04.2026 начало
	//HELP-9419
	Если ВидДокументаОснования = "РасходнаяНакладная" и РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения и Модифицированность() тогда 
		НачальноеКоличествоСтрокКоробок = 0;
		ТекущееКоличествоСтрокКоробок 	= 0;	  
		
		Если не ЭтоНовый() тогда 
			Запрос = новый запрос;
			запрос.Текст = "ВЫБРАТЬ
			|	КОЛИЧЕСТВО(ЛистНабораНомераКоробок.НомерСтроки) КАК КоличествоСтрок
			|ИЗ
			|	Документ.ЛистНабора.НомераКоробок КАК ЛистНабораНомераКоробок
			|ГДЕ
			|	ЛистНабораНомераКоробок.Ссылка = &Ссылка";
			запрос.УстановитьПараметр("Ссылка",Ссылка); 
			Выборка = запрос.Выполнить().Выбрать(); 
			пока Выборка.Следующий() цикл    
				НачальноеКоличествоСтрокКоробок = Выборка.КоличествоСтрок;
			КонецЦикла;	
			
			ТекущееКоличествоСтрокКоробок = НомераКоробок.Количество();			
		КонецЕсли;   
		если ТекущееКоличествоСтрокКоробок > НачальноеКоличествоСтрокКоробок тогда 
			Результат = КонтрольДублейСтрокКоробовЛиста(ЭтотОбъект);
			Если не Результат.Успех тогда  
				ТекстОшибки = "Не удалось записать ЛН "+Номер+" "+СтрСоединить(Результат.Ошибки,Символы.ПС);
                НомераКоробок.Очистить();
				#Если Клиент тогда
					Сообщить(ТекстОшибки);
					отказ = Истина;
				#Иначе
					ВызватьИсключение ТекстОшибки;
				#КонецЕсли
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	// Кухарь А.Ю.  11.04.2026 конец
	
	
	если ЕстьИзменения тогда 
		КоличествоДокумента =Товары.Итог("Количество");	
		ГруппыТоваров		=ГруппыТоваровДокумента(ЭтотОбъект);	 

		//На всякий проверим на нули в колонке шт. в коробе и перезаполним	
		ДозаполнитьШтВКоробе();	
		
		ОбъемДокумента	= Товары.Итог("Объем");	
		Если ТипШК=Перечисления.ТипыШтрихКодов.Коробка Тогда
			ОбъемКоробов		= ОбъемДокумента;	
			
			КоличествоКоробок	= 0;			
			Для Каждого СтрокаТз из Товары цикл
				Количествокоробок=Количествокоробок+?(СтрокаТЗ.ШтВКоробе=0,СтрокаТз.Количество,СтрокаТз.Количество/СтрокаТз.ШтВКоробе);
			КонецЦикла;
		Иначе		
			//возможно заведение объема вручную		
			Если ТипКороба <> Справочники.ТипыКоробов.ЗаведениеВручную Тогда	
				ОбъемКоробов =?(ТипКороба.Пустая(),ОбъемДокумента,ТипКороба.Объем);
			КонецЕсли;
			КоличествоКоробок=1;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(Им7) тогда
			Для Каждого стр из товары цикл
				Если НЕ ЗначениеЗаполнено(стр.ШтВКоробе) тогда
					Сообщить("Не заполнены шт. в коробке для "+стр.Номенклатура);
					Отказ=Истина;
					Возврат;
				Конецесли;	
			Конеццикла;	
		Конецесли;	
	КонецЕсли; 

	Если Не ЭтоНовый() Тогда
		ОбновитьШтрихкодыКоробокДляАгрегации();	
	КонецЕсли; 

	Если Не Отказ 
		И (ПометкаУдаления 
		ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) Тогда
		
		НомераКоробок.Очистить(); 
		
		//++Данилова Е.В. 28.04.2026 HELP-9565 
		РегистрыСведений.НомераКоробокПоЛистам.ОчиститьЗаписьПоЛисту(ссылка); 
		//--Данилова Е.В. 28.04.2026 
		//++Данилова Е.В. 19.05.2026 HELP-9825 перенесла в при записи 
		//++Данилова Е.В. 08.05.2026 HELP-9716 
	//Иначе 
	//	Если НЕ ЭтоНовый()
	//		И ЗначениеЗаполнено(ДокОснование) 
	//		И ТипЗнч(ДокОснование) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда 
	//		Обработки.ПечатьЛистаНабора.ПроверитьЗанятыеНомераБезЗаписиВЛист(ДокОснование,ссылка);
	//	КонецЕсли;
		//--Данилова Е.В. 08.05.2026 
		//--Данилова Е.В. 19.05.2026 
	КонецЕсли;
	
	// Кельманов А.В. - Оптимизация работы - 2026.04.23 {
	//если УпрощеннаяЗапись тогда
	Если УпрощеннаяЗапись Или ЭтоЗагрузкаСТСД Тогда
	// Кельманов А.В. - Оптимизация работы - 2026.04.23 }
		Возврат;
	КонецЕсли;

	СформироватьШКЛистаНабора();		
	
	Если ЭтоНовый() И ВидДокументаОснования<>"ПриходнаяНакладная"  тогда     	 

		Дата=ТекущаяДата();		

		если  не ОбщегоНазначения_ПИ.ПечататьКоробныеЭтикеткиНовойКомпонентой(ДокОснование) тогда
			Если ШКЛистаНабора="" И ОбщегоНазначения_ПИ.ЭтоУзел_Склад() тогда
				ЛН=Документы.ЛистНабора.НайтиПоРеквизиту("ШКЛистаНабора",ШКЛистаНабора);
				Если НЕ ЛН.Пустая() Тогда
					#Если клиент тогда
						Сообщить("Сбой формирования ШК, попробуйте записать ЛН ещё раз."); 
					#КонецЕсли
					ШКЛистаНабора="";
					Отказ=Истина;
				КонецЕсли;
			КонецЕсли;   
		КонецЕсли;
	КонецЕсли;

	ПереклейкаОтсканирована=Истина; 

	#Если клиент тогда
		
		Если ОбщегоНазначения_ПИ.ЭтоУзел_ODN_или_OD7() И ВидДокументаОснования <> "ПриходнаяНакладная" Тогда
			если ЗаданияНабора.Количество()>0 тогда
				//Иногда не заполняется ШК матрицы в перед записью на форме
				Если ВидДокументаОснования="РасходнаяНакладная" и ЭтотОбъект.ДокОснование.Контрагент.ИспользоватьНоменклатурнуюМатрицу Тогда
					Если Товары.Количество()>0 тогда
						Если Товары[0].ШКМатрицы="" тогда
							ЗаполнитьШКМатрицы();
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				Если ЕстьПаузаВСканировании() тогда
					Отказ=Истина;
					Сообщить("Для строк плана набора из этого ЛН сканирование приостановлено. Перед началом работы с этими строками плана набора, нужно отсканировать ШК снятия паузы и ШК плана набора.");
				КонецЕсли;
				
			КонецЕсли;

			Если ЕстьИзменения И ВидДокументаОснования = "РасходнаяНакладная" и РежимЗаписи<>РежимЗаписиДокумента.ОтменаПроведения Тогда			

				ДопПараметрыНакладной= ОбщегоНазначения_ПИ.ПолучитьДопПараметрыНакладной(ДокОснование);
				если ДопПараметрыНакладной.ЗаполнятьПереклейку тогда	
					ЗаполнитьТЧПереклейка();	
				КонецЕсли;
				
				//Валетов + 19,05,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-9821  
				Если ЗначениеЗаполнено(Ссылка.Завершен) И Ссылка.Завершен И НЕ Завершен Тогда 
					ПереклейкаОтсканирована = Истина;
				Иначе
					Для Каждого СтрТЧ из Переклейка цикл
						Если СтрТЧ.Заявка<>СтрТЧ.Количество тогда
							// Для ЛН с ТСД. Проверка что отсканировали переклейку						
							ПереклейкаОтсканирована=Ложь;					
							
							#если клиент тогда
								Сообщить("Не отсканировано "+СтрТЧ.Номенклатура.Наименование+" во вкладке переклейка.");
								Отказ=Истина;
							#КонецЕсли
						КонецЕсли;
					КонецЦикла;   
				КонецЕсли;

				если ПереклейкаОтсканирована  тогда
					ТребуетПроверки=Ложь;
				КонецЕсли;

				СостояниеНакладной=ПолучитьРеквизитШапки(ДокОснование,"СостояниеНакладной","Документ");
				если СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке или СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена тогда
					НужноЗапрещать=Истина;
					
					если не ЭтоНовый() и РежимЗаписи<>РежимЗаписиДокумента.ОтменаПроведения тогда
						НачРеквизиты= ПолучитьРеквизитыШапки(Ссылка,Новый Структура("КоличествоКоробок,КоличествоДокумента"),"Документ");
						НачКоличествоКоробок	=НачРеквизиты.КоличествоКоробок; 
						НачКоличествоДокумента			=НачРеквизиты.КоличествоДокумента;
						если КоличествоДокумента = НачКоличествоДокумента и КоличествоКоробок = НачКоличествоКоробок тогда
							НужноЗапрещать=Ложь;
						КонецЕсли;
						
					КонецЕсли;
					
					если НужноЗапрещать тогда
						Отказ=Истина;
						#если клиент тогда
							Сообщить("Запрещено менять ЛН в готовых накладных. Обратитесь к администратору.");
						#КонецЕсли
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;

	#КонецЕсли

	ПравилаРаботыСАгрегациейЧЗ=МаркировкаКС.ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладной(ДокОснование);	
	МассивСообщений=новый Массив;                 
	если РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения тогда
		
		если ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияБлочков тогда
			запрос=новый запрос;
			запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Лист.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
			|	Лист.Ссылка.Номер КАК Номер
			|ИЗ
			|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК Лист
			|ГДЕ
			|	Лист.Ссылка <> &Ссылка
			|	И Лист.Ссылка.Проведен
			|	И Лист.ШтрихкодБлочка В(&ШтрихкодБлочка)
			|	И Лист.ШтрихкодБлочка <> &ПустойШК		
			|	И Лист.Ссылка.Дата >= &Дата";
			запрос.УстановитьПараметр("Ссылка",Ссылка);
			запрос.УстановитьПараметр("ШтрихкодБлочка",ШтрихкодыУпаковок.Выгрузить().ВыгрузитьКолонку("ШтрихкодБлочка"));
			запрос.УстановитьПараметр("ПустойШК",Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка());
			запрос.УстановитьПараметр("Дата",Дата-5*86400);
			Выборка = запрос.Выполнить().Выбрать(); 
			пока Выборка.Следующий() цикл
				МассивСообщений.Добавить("Обнаружены дубли кодов блочка в других ЛН - "+Выборка.Номер+"______"+Выборка.ШтрихкодУпаковки);	
			КонецЦикла;	
		КонецЕсли;
		если ЗначениеЗаполнено(КодАгрегации) тогда
			Запрос=новый запрос;
			запрос.Текст=  "ВЫБРАТЬ
			|	Лист.Ссылка.Номер КАК Ссылка
			|ИЗ
			|	Документ.ЛистНабора КАК Лист
			|ГДЕ
			|	Лист.Ссылка <> &Ссылка
			|	И Лист.КодАгрегации = &КодАгрегации
			|	И Лист.Дата >= &Дата
			|	И Лист.Проведен";
			запрос.УстановитьПараметр("Ссылка",Ссылка);
			запрос.УстановитьПараметр("КодАгрегации",КодАгрегации);
			запрос.УстановитьПараметр("Дата",Дата-14*86400);
			Выборка = запрос.Выполнить().Выбрать(); 
			пока Выборка.Следующий() цикл
				МассивСообщений.Добавить("Обнаружены дубли агрегационных кодов в других ЛП - "+Выборка.Номер);
			КонецЦикла;		
		КонецЕсли; 
	КонецЕсли;

	Если ВидДокументаОснования = "Инвентаризация" Тогда
		МассивСкладов = новый Массив; 
		МассивСкладов.Добавить(ДокОснование.Склад); 
		МассивСкладов.Добавить(ДокОснование.Склад.ФизическийСклад);
		РезПроверки = Обработки.ПланИнвентаризации.ПроверитьВозможностьЗаполненияИНВ(ЭтотОбъект,Товары.Выгрузить(,"Номенклатура").ВыгрузитьКолонку("Номенклатура"),МассивСкладов); 	
		Если Не РезПроверки.Успех Тогда
			
			Для каждого СтрОшибка Из РезПроверки.Ошибки Цикл				
				МассивСообщений.Добавить(СтрОшибка); 					
			КонецЦикла;		
			
		КонецЕсли;
	КонецЕсли;
	
	если МассивСообщений.Количество()>0 тогда
		отказ=Истина;
		СообщитьИзМодуля(СтрСоединить(МассивСообщений,символы.ПС));           
		пВыполнения 		= инт_ДлительныеОперации.ПараметрыВыполненияВФоне();			
		КоличествоПотоков	= 1;			
		пПроцедуры = Новый Массив;
		пПроцедуры.Добавить("Отладка");	
		пПроцедуры.Добавить(СтрШаблон("Ошибка записи ЛН %1 по %2 по причине %3",Номер,ДокОснование,СтрСоединить(МассивСообщений,", ")));	
		пПроцедуры.Добавить("Информация");	
		рЗапуска = инт_ДлительныеОперации.ВыполнитьВФоне("РегистрыСведений.Логи.ЗаписатьВЛогФоново", пПроцедуры, пВыполнения);				

	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)	        
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если Завершен И Проведен Тогда                                         
		//+++Чирков 16.04.2026 - оказывается  есть проведенные ЛН к удаленным накладным 
		// которые еще и перезаписывают ..... их не надо регистрировать
		Если ПолучитьРеквизитШапки(ДокОснование, "Проведен") = Истина Тогда
		//---Чирков
			Если НЕ РегистрыСведений.ОтгружаемыеКодыМаркировки.ЕстьЗаписиПроверкиДокумента(Ссылка) Тогда
				РегистрыСведений.ОтгружаемыеКодыМаркировки.СоздатьЗадачуПроверкиДокумента(Ссылка);
			КонецЕсли;
			
			МаркировкаС.ПроверитьКМпоДокументу(Ссылка, Новый Структура("ОтложеннаяПроверка", Истина));
		КонецЕсли;	
	Иначе         
		Если РегистрыСведений.ОтгружаемыеКодыМаркировки.ЕстьЗаписиПроверкиДокумента(Ссылка) Тогда
			РегистрыСведений.ОтгружаемыеКодыМаркировки.УдалитьЗаписиПоДокументу(Ссылка);
		КонецЕсли;		
		РегистрыСведений.СтатусыПроверкиКМвЧЗ.УдалитьРезультатПроверкиДокументаПоЧЗ(Ссылка);
	КонецЕсли;
	//++Данилова Е.В. 19.05.2026 HELP-9825 
	Если НЕ ЭтоНовый()
		И ЗначениеЗаполнено(ДокОснование) 
		И ТипЗнч(ДокОснование) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда 
		Обработки.ПечатьЛистаНабора.ПроверитьЗанятыеНомераБезЗаписиВЛист(ДокОснование,ссылка);
	КонецЕсли;
	//--Данилова Е.В. 19.05.2026 
КонецПроцедуры

//+++Чирков 16.02.2026
Функция ОпределитьЗаданиеНабора()       
	Результат = Документы.ЗаданиеНабора.ПустаяСсылка();
	
	Если ЗаданияНабора.Количество() = 1 Тогда     
		Результат = ЗаданияНабора[0].ЗаданиеНабора;		
	ИначеЕсли ЗаданияНабора.Количество() > 1 Тогда		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Товары_ЛН ИЗ &Товары КАК Товары
		|;                                                      
		|ВЫБРАТЬ Ссылка, Номенклатура ПОМЕСТИТЬ ВТ_Товары_ЗНБ ИЗ Документ.ЗаданиеНабора.Товары ГДЕ Ссылка В (&мЗНБ) И Количество > 0
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ		
		|	ВТ_Товары_ЗНБ.Ссылка КАК ЗНБ,
		|	ВЫБОР 
		|		КОГДА ВТ_Товары_ЛН.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар) ТОГДА 0
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Приоритет
		|ИЗ
		|	ВТ_Товары_ЗНБ
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	ВТ_Товары_ЛН
		|ПО		
		|	ВТ_Товары_ЛН.Номенклатура = ВТ_Товары_ЗНБ.Номенклатура
		|	И ВТ_Товары_ЗНБ.Ссылка.Накладная = &ДокОснование
		|	И (
		|		(&ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка) И НЕ ВТ_Товары_ЗНБ.Ссылка.ЭтоБлочки)
		|		ИЛИ                                                                          
		|		(&ТипШК <> ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка) И ВТ_Товары_ЗНБ.Ссылка.ЭтоБлочки)
		|	)
		|УПОРЯДОЧИТЬ ПО 
		|	Приоритет
		|";
		
		Запрос.УстановитьПараметр("Товары", Товары);
		Запрос.УстановитьПараметр("ТипШК", 	ТипШК); 
		Запрос.УстановитьПараметр("мЗНБ", 	ЗаданияНабора.ВыгрузитьКолонку("ЗаданиеНабора"));
		Запрос.УстановитьПараметр("ДокОснование", ДокОснование);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ЗНБ) Тогда
			Результат = Выборка.ЗНБ;					
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ОпределитьЗаданиеНабора()

Процедура ЗаполнениеЛНПриЗагрузкеСТСД() Экспорт
	если ДокОснование.Метаданные().Имя="ЗаданиеНабора" тогда
		
		если дата<НачалоМесяца(ТекущаяДата()) тогда
			дата=НачалоМесяца(ТекущаяДата());
		КонецЕсли;
		
		ДокОснование=ДокОснование.Накладная;
		если ЭтоНовый() Тогда 
			УстановитьНовыйНомер(СокрЛП(ДокОснование.Номер)+"/");	
			Автор=ПараметрыСеанса.Пользователь; 
		КонецЕсли;
		
		Сканировщик=Наборщик;	
		ТребуетПроверки=ложь;
		КоличествоКоробок	= 0; 
		если ТипШК=Перечисления.ТипыШтрихКодов.Коробка тогда
			ЭтоКороба=Истина;
			// Для заполнения штук в коробе из ШК
			Запрос=новый запрос;
			запрос.Текст="ВЫБРАТЬ
			|	ШтрихКоды.Наименование КАК ШК,
			|	ШтрихКоды.ШтВКоробе КАК ШтВКоробе
			|ИЗ
			|	Справочник.ШтрихКоды КАК ШтрихКоды
			|ГДЕ
			|	ШтрихКоды.Владелец В(&Номенклатура)
			|	И ШтрихКоды.ШтВКоробе > 0
			|	И ШтрихКоды.ТипШК = &ТипШК";
			запрос.УстановитьПараметр("Номенклатура",товары.ВыгрузитьКолонку("Номенклатура"));
			запрос.УстановитьПараметр("ТипШК",Перечисления.ТипыШтрихКодов.Коробка);
			ТабШтукВКоробеШК=запрос.Выполнить().Выгрузить();
		иначе
			ЭтоКороба=ложь;
		КонецЕсли;

		// Заполнение стандартных реквизитов		
		Для каждого СтрТЧ из Товары цикл
			ПриИзмененииНоменклатурыТабЧасти(СтрТЧ,ЭтотОбъект);
			РассчитатьСуммуТабЧасти(СтрТЧ, ЭтотОбъект);
			если ЭтоКороба тогда
				// Для заполнения штук в коробе из ШК
				СтрокаТабШтукВКоробеШК=ТабШтукВКоробеШК.Найти(СтрТЧ.ШК,"ШК");
				если СтрокаТабШтукВКоробеШК<>Неопределено тогда
					СтрТЧ.ШтВКоробе= СтрокаТабШтукВКоробеШК.ШтВКоробе;
				КонецЕсли;			 

				Количествокоробок=КоличествоКоробок+?(СтрТЧ.ШтВКоробе=0,СтрТЧ.Количество,СтрТЧ.Количество/СтрТЧ.ШтВКоробе);
			КонецЕсли;
		КонецЦикла;

		если не ЭтоКороба тогда		
			Если ТипКороба <> Справочники.ТипыКоробов.ЗаведениеВручную Тогда	
				ОбъемКоробов =?(ТипКороба.Пустая(),ОбъемДокумента,ТипКороба.Объем);
			КонецЕсли;
			КоличествоКоробок=1;
		иначе 
			ОбъемКоробов=Товары.Итог("Объем");
		КонецЕсли;	 
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДокОснование,"ИБ,Склад");
		КоличествоДокумента=Товары.Итог("Количество");
		
	КонецЕсли;
КонецПроцедуры

Функция ПереклейкаНеНужна() экспорт
	ВидДокументаОснования=ОбщегоНазначения_ПИ.ПолучитьИмяДокумента(ДокОснование);
	ПереклейкаНеНужна=Ложь;
	Если ВидДокументаОснования="РасходнаяНакладная" И ПолучитьРеквизитШапки(ДокОснование,"ОтгрузкаКомплектов")=Истина Тогда		
		ОбщегоНазначения_ПИ.ПереклейкаНеНужна(ДокОснование);
	КонецЕсли;
	
	Возврат ПереклейкаНеНужна;	
КонецФункции // ()


Функция ПроверитьСоответствиеМатрицеИзМодуля(ЧастьНоменклатурыПоМатрице=ложь,ПереклейкаНенужна=ложь)	   экспорт
	ТекстПредупреждения="";
	ВсеХорошо 	= Истина;
	
	ВсеХорошоКратностьКороба = Истина; 
	СтруктураВозврата=новый Структура("ВсеХорошо,ВсеХорошоКратностьКороба,ТекстПредупреждения",Истина,Истина,"");
	
	ДопПараметрыНакладной=ОбщегоНазначения_ПИ.ПолучитьДопПараметрыНакладной(ДокОснование);
	если ДопПараметрыНакладной.ЗаполнятьПереклейку = ложь или ДопПараметрыНакладной.ОтгрузкаFBS тогда
		возврат СтруктураВозврата;
	КонецЕсли;

	если ТипШК<>Перечисления.ТипыШтрихКодов.Коробка тогда
		НужноПроверятьКратностьКоробаИзМатрицы=ложь;
	ИначеЕсли  ПрочитатьЗначениеРеквизитаПНКПРМРНК("НеПроверятьКратностьКороба",ДокОснование) = Истина тогда
		НужноПроверятьКратностьКоробаИзМатрицы=ложь;		
	иначе
		НужноПроверятьКратностьКоробаИзМатрицы=Истина;
	КонецЕсли;
	
	Запрос			= Новый Запрос;				
	Запрос.Текст 	= "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МатрицаТовары.Номенклатура КАК Номенклатура,
	|	МатрицаТовары.КратностьКоробки КАК КратностьКоробки,
	|	МатрицаТовары.ШККонтрагента КАК ШККонтрагента,
	|	МатрицаТовары.ШККонтрагентаДополнительный КАК ШККонтрагентаДополнительный,
	|	МатрицаТовары.Номенклатура.Родитель.ШтукВКоробке КАК КратностьКоробкиИзНоменклатуры,
	|	МатрицаТовары.Ссылка КАК Ссылка,
	|	МатрицаТовары.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.Матрица.Товары КАК МатрицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
	|ГДЕ
	|	МатрицаТовары.Ссылка.Проведен
	|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
	|	И МатрицаТовары.Ссылка.Договор = &Договор
	|	И МатрицаТовары.Ссылка.Дата <= &Дата1
	|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
	|	И МатрицаПунктыДоставки.ПунктДоставки = &ПунктДоставки
	|	И МатрицаТовары.Ссылка.ПостояннаяАкция = &ПостояннаяАкция
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";	
	
	Запрос.УстановитьПараметр("ПостояннаяАкция",		ДокОснование.ПостояннаяАкция);		 
	
	Запрос.УстановитьПараметр("Дата2",			НачалоДня(Дата));
	Запрос.УстановитьПараметр("Дата1",			КонецДня(Дата));
	Запрос.УстановитьПараметр("Контрагент",		ДокОснование.Контрагент);		
	Запрос.УстановитьПараметр("ПунктДоставки",	ДокОснование.ПунктДоставки);				
	Запрос.УстановитьПараметр("Договор",		ДокОснование.Договор);		
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	ПереклейкаНеНужна=ПереклейкаНеНужна();
	Для Каждого СтрокаТЧ Из Товары Цикл
		
		Если СтрокаТЧ.Количество = 0 Тогда Продолжить КонецЕсли;
		Если ДокОснование.ОтгрузкаКомплектов Тогда
			НадоКонтролировать = Ложь;
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Продукция", СтрокаТЧ.Номенклатура);
			НайденныеСтроки = ДокОснование.Комплектующие.НайтиСтроки(ПараметрыОтбора);
			Для СЧ = 0 По НайденныеСтроки.Количество()-1 Цикл
				НайденнаяСтрока = НайденныеСтроки.Получить(Сч);
				Если НайденнаяСтрока.Номенклатура = НайденнаяСтрока.продукция Тогда
					НадоКонтролировать = Истина;
				КонецЕсли;
			КонецЦикла;
			Если НЕ НадоКонтролировать Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Отбор = новый Структура;
		Отбор.Вставить("Номенклатура",СтрокаТЧ.Номенклатура);
		СтрокиМатриц = ТЗ.НайтиСтроки(Отбор); 
		Если СтрокиМатриц.Количество() = 0 Тогда
			если ЧастьНоменклатурыПоМатрице<>Истина тогда
				
				ВсеХорошо = Ложь;
				СообщитьИзМодуля("в матрице отсутствует номенклатура "+СтрокаТЧ.Номенклатура+ ". Номер строки: "+СтрокаТЧ.НомерСтроки);
				ТекстПредупреждения=ТекстПредупреждения+"в матрице отсутствует номенклатура "+СтрокаТЧ.Номенклатура+ ". Номер строки: "+СтрокаТЧ.НомерСтроки+Символы.ПС;
			КонецЕсли;	
		Иначе
			ШКСовпадают = Ложь;
			
			// Проверим, что не сканировали коробами товар, у которого кратность короба заполнена от заводской
			если ТипШК=Перечисления.ТипыШтрихКодов.Коробка тогда
				если НужноПроверятьКратностьКоробаИзМатрицы тогда				 
					ПерваяСтрокаМатрицы=СтрокиМатриц.Получить(0);
					если ПерваяСтрокаМатрицы.КратностьКоробки>0  и ПерваяСтрокаМатрицы.КратностьКоробки<>ПерваяСтрокаМатрицы.КратностьКоробкиИзНоменклатуры тогда	
						ВсеХорошоКратностьКороба=Ложь;
						ТекстСообщенияВрем="в матрице отличается кратность коробки от заводской. "+СтрокаТЧ.Номенклатура+ ". Номер строки: "+СтрокаТЧ.НомерСтроки;
						СообщитьИзМодуля(ТекстСообщенияВрем);
						ТекстПредупреждения=ТекстПредупреждения+ТекстСообщенияВрем+Символы.ПС;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если СтрокаТЧ.ТипШК = Перечисления.ТипыШтрихКодов.Штука ИЛИ СтрокаТЧ.ТипШК.Пустая() Тогда					
				Для Каждого СтрокаМатриц Из СтрокиМатриц Цикл
					ТекШКМатрицы = СтрокаМатриц.ШККонтрагента;
					СтрокаТЧ.ШКМатрицы = ТекШКМатрицы;	
					СтрокаТЧ.ШККонтрагентаДополнительный = СтрокаМатриц.ШККонтрагентаДополнительный;					
				КонецЦикла;
			Иначе
				ТекШКШтуки 				= ПолучитьШтрихКодТовара(СтрокаТЧ.Номенклатура);
				КоличествоШКШтуки 		= 0;
				ЗапросКоличествоШКШтуки	= Новый Запрос;
				ЗапросКоличествоШКШтуки.Текст="
				|ВЫБРАТЬ
				|    Ссылка,
				|	Наименование
				|ИЗ
				|	Справочник.ШтрихКоды КАК ШтрихКоды
				|ГДЕ
				|	Владелец = &Владелец
				|	И ТипШК = &ТипШК";
				
				ЗапросКоличествоШКШтуки.УстановитьПараметр("Владелец",СтрокаТЧ.Номенклатура);
				ЗапросКоличествоШКШтуки.УстановитьПараметр("ТипШК",Перечисления.ТипыШтрихКодов.Штука);
				ВыборкаКоличествоШКШтуки = ЗапросКоличествоШКШтуки.Выполнить().Выбрать();
				КоличествоШКШтуки = ВыборкаКоличествоШКШтуки.Количество();
				Если КоличествоШКШтуки = 1 Тогда						
					Для Каждого СтрокаМатриц Из СтрокиМатриц Цикл
						ТекШКМатрицы 		= СтрокаМатриц.ШККонтрагента;
						СтрокаТЧ.ШКМатрицы 	= ТекШКМатрицы;
						СтрокаТЧ.ШККонтрагентаДополнительный = СтрокаМатриц.ШККонтрагентаДополнительный;	
					КонецЦикла;
				Иначе						
					Для Каждого СтрокаМатриц Из СтрокиМатриц Цикл
						ТекШКМатрицы 		= СтрокаМатриц.ШККонтрагента;
						СтрокаТЧ.ШКМатрицы 	= ТекШКМатрицы;
						СтрокаТЧ.ШККонтрагентаДополнительный = СтрокаМатриц.ШККонтрагентаДополнительный;							
						Прервать;
					КонецЦикла;						
					СообщитьИзМодуля("по номенклатуре "+СтрокаТЧ.Номенклатура+ "заведено "+КоличествоШКШтуки +" ШК штуки, проверьте штрихкод на соответствие матрице. Номер строки "+СтрокаТЧ.НомерСтроки);
				КонецЕсли;					
			Конецесли;				
		КонецЕсли;			
	КонецЦикла;	
	
	СтруктураВозврата.ВсеХорошо=ВсеХорошо;
	СтруктураВозврата.ВсеХорошоКратностьКороба=ВсеХорошоКратностьКороба;
	СтруктураВозврата.ТекстПредупреждения=ТекстПредупреждения; 
	
	возврат СтруктураВозврата;
КонецФункции 


// Кухарь А.Ю.  16.03.2024 начало
// Общие проверки перед записью ЛН

Функция КонтрольКорректностиСканированияЧЗВЛЗ() Экспорт
	
    ДанныеЗамера = ОценкаПроизводительностиКлиентСервер.НачатьЗамерФункции("Документ.ЛистНабора.КонтрольКорректностиСканированияЧЗВЛЗ", Новый Структура("Ссылка", Ссылка));	
	
	Результат=Новый Структура("Успех,Ошибки",Истина,"");
	МассивОшибок=новый Массив;
	
	ВидНакладной=ДокОснование.метаданные().имя;
	
	ДатаОтгрузки=ПустаяДата();
	КонтрагентРаботаетСМаркировкой=ложь; 
	ТребуетсяМаркировкаПриоритетПНК = Ложь;
	если ВидНакладной = "РасходнаяНакладная" 
		или ВидНакладной="ПриходнаяНакладная" 
		или ВидНакладной = "Перемещение" 
		или ВидНакладной="СписаниеТМЦ" 
		тогда
		если ЕстьРеквизитДокумента("ДатаОтгрузки",ДокОснование.Метаданные()) тогда
			РеквизитыШапки=ПолучитьРеквизитыШапки(ДокОснование,"ДатаОтгрузки,Контрагент.РаботаСМаркированнымТоваромПодтверждена","Документ");
			ДатаОтгрузки=РеквизитыШапки.ДатаОтгрузки;
		иначе
			ДатаОтгрузки=Дата;
		КонецЕсли;
		если ТипЗнч(ДокОснование)<>Тип("ДокументСсылка.ПриходнаяНакладная") тогда 
			КонтрагентРаботаетСМаркировкой= ПолучитьРеквизитШапки(ДокОснование,"ТребуетсяМаркировка","Документ"); 
		иначе
			КонтрагентРаботаетСМаркировкой=РеквизитыШапки.Контрагент_РаботаСМаркированнымТоваромПодтверждена;
		КонецЕсли;	
		
		если  ТипЗнч(ДокОснование)=Тип("ДокументСсылка.ПриходнаяНакладная") тогда
			Если ПолучитьРеквизитШапки(ДокОснование,"КодОперации","Документ") = Перечисления.КодыОперацийОстатки.ЗакупкаР тогда
				КонтрагентРаботаетСМаркировкой=Истина;
			КонецЕсли;
			 
			Если ПолучитьРеквизитШапки(ДокОснование,"ТребуетсяМаркировкаПриоритет","Документ") = Истина Тогда
			
				КонтрагентРаботаетСМаркировкой=Истина;	
			    ТребуетсяМаркировкаПриоритетПНК = Истина; 
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	если ДатаОтгрузки=ПустаяДата() тогда
		ДатаОтгрузки=ТекущаяДата();
	КонецЕсли;

	ЕстьКМП=ложь;
	если ВидНакладной = "РасходнаяНакладная" или ВидНакладной = "Перемещение"   тогда
		если ВидНакладной = "РасходнаяНакладная"  тогда
			ЕстьКМП=ПолучитьРеквизитШапки(ДокОснование,"ОтгрузкаКомплектов","Документ");
			если ЕстьКМП тогда
				ИмяТоварнойТЧ="Комплектующие";
			иначе
				ИмяТоварнойТЧ="Товары";
			КонецЕсли;
		иначе
			ИмяТоварнойТЧ="Товары";
		КонецЕсли;    
		ТаблицаПереопределяемыхДат=МаркировкаКС.ПодготовитьТаблицуСПереопределяемойДатойНачалаРаботыСМаркировкой(ДокОснование,ИмяТоварнойТЧ, Товары);
	иначе
		ТаблицаПереопределяемыхДат = новый ТаблицаЗначений;
	КонецЕсли;
	
	Запрос=новый запрос;// Сверим что по количеству ТЧ марок сходится с товарами
	
	если ТаблицаПереопределяемыхДат = Неопределено или ТаблицаПереопределяемыхДат.Количество()=0 тогда 		
		запрос.Текст="ВЫБРАТЬ
		|	ЛН.Количество КАК Количество,
		|	ЛН.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ТоварыЛН
		|ИЗ
		|	Документ.ЛистНабора.Товары КАК ЛН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ТоварыЛН.Количество) КАК Количество,
		|	ТоварыЛН.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ТоварыЛН_ЧЗ
		|ИЗ
		|	ТоварыЛН КАК ТоварыЛН
		|ГДЕ
		|	ТоварыЛН.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой <> &ПустаяДата  
		|	И (ТоварыЛН.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой <= &ДатаОтгрузки  ИЛИ &ТребуетсяМаркировкаПриоритетПНК)
		|	И (&КонтрагентРаботаетСМаркировкой
		|			ИЛИ ТоварыЛН.Номенклатура.ОтгрузкаТолькоЧерезЧЗ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыЛН.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛНШтрихкодыКоробокДляАгрегации.НовыйКодКоробки КАК НовыйКодКоробки,
		|	ЛНШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки КАК ИсходныйКодКоробки
		|ПОМЕСТИТЬ ВТШтрихкодыКоробокДляАгрегации
		|ИЗ
		|	Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ЛНШтрихкодыКоробокДляАгрегации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛН.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
		|	ЛН.Количество КАК Количество
		|ПОМЕСТИТЬ МаркиБезГруппировкиПромежуточная
		|ИЗ
		|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки, ЛН.ШтрихкодУпаковки) КАК ШтрихкодУпаковки,
		|	ЛН.Количество КАК Количество
		|ПОМЕСТИТЬ МаркиБезГруппировки
		|ИЗ
		|	МаркиБезГруппировкиПромежуточная КАК ЛН
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШтрихкодыКоробокДляАгрегации КАК ВТШтрихкодыКоробокДляАгрегации
		|		ПО ЛН.ШтрихкодУпаковки = ВТШтрихкодыКоробокДляАгрегации.НовыйКодКоробки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаркиБезГруппировки.ШтрихкодУпаковки.Владелец КАК Номенклатура,
		|	СУММА(МаркиБезГруппировки.Количество) КАК Количество
		|ПОМЕСТИТЬ НоменклатураИзМарок
		|ИЗ
		|	МаркиБезГруппировки КАК МаркиБезГруппировки  
		|
		|СГРУППИРОВАТЬ ПО
		|	МаркиБезГруппировки.ШтрихкодУпаковки.Владелец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(НоменклатураИзМарок.Номенклатура, ТоварыЛН_ЧЗ.Номенклатура) КАК Номенклатура,
		|	ЕСТЬNULL(НоменклатураИзМарок.Количество, 0) - ЕСТЬNULL(ТоварыЛН_ЧЗ.Количество, 0) КАК Дельта
		|,
		|	ЕСТЬNULL(НоменклатураИзМарок.Количество, 0) КАК НоменклатураИзМарокКоличество,
		|	ЕСТЬNULL(ТоварыЛН_ЧЗ.Количество, 0) КАК ТоварыЛН_ЧЗКоличество
		|ИЗ
		|	НоменклатураИзМарок КАК НоменклатураИзМарок
		|		ПОЛНОЕ СОЕДИНЕНИЕ ТоварыЛН_ЧЗ КАК ТоварыЛН_ЧЗ
		|		ПО НоменклатураИзМарок.Номенклатура = ТоварыЛН_ЧЗ.Номенклатура
		|ГДЕ
		|	ЕСТЬNULL(НоменклатураИзМарок.Количество, 0) - ЕСТЬNULL(ТоварыЛН_ЧЗ.Количество, 0) <> 0";
	иначе
		Запрос.Текст 	= "ВЫБРАТЬ
		|	ТаблицаДат.Номенклатура КАК Номенклатура,
		|	ТаблицаДат.ДатаНачалаРаботыСМаркировкой КАК ДатаНачалаРаботыСМаркировкой
		|ПОМЕСТИТЬ ТаблицаСДатами
		|ИЗ
		|	&ТаблицаПереопределяемыхДат КАК ТаблицаДат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛН.Количество КАК Количество,
		|	ЛН.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ТоварыЛН
		|ИЗ
		|	Документ.ЛистНабора.Товары КАК ЛН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ТоварыЛН.Количество) КАК Количество,
		|	ТоварыЛН.Номенклатура КАК Номенклатура,
		|	ТаблицаСДатами.ДатаНачалаРаботыСМаркировкой КАК ДатаНачалаРаботыСМаркировкой
		|ПОМЕСТИТЬ ТоварыЛН_ЧЗ
		|ИЗ
		|	ТоварыЛН КАК ТоварыЛН
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСДатами КАК ТаблицаСДатами
		|		ПО ТоварыЛН.Номенклатура = ТаблицаСДатами.Номенклатура
		|ГДЕ
		|	ЕСТЬNULL(ТаблицаСДатами.ДатаНачалаРаботыСМаркировкой, ТоварыЛН.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой) <> &ПустаяДата
		|	И ЕСТЬNULL(ТаблицаСДатами.ДатаНачалаРаботыСМаркировкой, ТоварыЛН.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой) <= &ДатаОтгрузки
		|	И (&КонтрагентРаботаетСМаркировкой
		|			ИЛИ ТоварыЛН.Номенклатура.ОтгрузкаТолькоЧерезЧЗ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыЛН.Номенклатура,
		|	ТаблицаСДатами.ДатаНачалаРаботыСМаркировкой
		|;
		|
		|//////////////////////////////////////////////////////////////////////////////// 
		|ВЫБРАТЬ
		|	ЛНШтрихкодыКоробокДляАгрегации.НовыйКодКоробки КАК НовыйКодКоробки,
		|	ЛНШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки КАК ИсходныйКодКоробки
		|ПОМЕСТИТЬ ВТШтрихкодыКоробокДляАгрегации
		|ИЗ
		|	Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ЛНШтрихкодыКоробокДляАгрегации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛН.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
		|	ЛН.Количество КАК Количество
		|ПОМЕСТИТЬ МаркиБезГруппировкиПромежуточная
		|ИЗ
		|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки, ЛН.ШтрихкодУпаковки) КАК ШтрихкодУпаковки,
		|	ЛН.Количество КАК Количество
		|ПОМЕСТИТЬ МаркиБезГруппировки
		|ИЗ
		|	МаркиБезГруппировкиПромежуточная КАК ЛН
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТШтрихкодыКоробокДляАгрегации КАК ВТШтрихкодыКоробокДляАгрегации
		|		ПО ЛН.ШтрихкодУпаковки = ВТШтрихкодыКоробокДляАгрегации.НовыйКодКоробки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаркиБезГруппировки.ШтрихкодУпаковки.Владелец КАК Номенклатура,
		|	СУММА(МаркиБезГруппировки.Количество) КАК Количество
		|ПОМЕСТИТЬ НоменклатураИзМарок
		|ИЗ
		|	МаркиБезГруппировки КАК МаркиБезГруппировки
		|
		|СГРУППИРОВАТЬ ПО
		|	МаркиБезГруппировки.ШтрихкодУпаковки.Владелец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(НоменклатураИзМарок.Номенклатура, ТоварыЛН_ЧЗ.Номенклатура) КАК Номенклатура,
		|	ЕСТЬNULL(НоменклатураИзМарок.Количество, 0) - ЕСТЬNULL(ТоварыЛН_ЧЗ.Количество, 0) КАК Дельта
		|,
		|	ЕСТЬNULL(НоменклатураИзМарок.Количество, 0) КАК НоменклатураИзМарокКоличество,
		|	ЕСТЬNULL(ТоварыЛН_ЧЗ.Количество, 0) КАК ТоварыЛН_ЧЗКоличество
		|ИЗ
		|	НоменклатураИзМарок КАК НоменклатураИзМарок
		|		ПОЛНОЕ СОЕДИНЕНИЕ ТоварыЛН_ЧЗ КАК ТоварыЛН_ЧЗ
		|		ПО НоменклатураИзМарок.Номенклатура = ТоварыЛН_ЧЗ.Номенклатура
		|ГДЕ
		|	ЕСТЬNULL(НоменклатураИзМарок.Количество, 0) - ЕСТЬNULL(ТоварыЛН_ЧЗ.Количество, 0) <> 0";
		запрос.УстановитьПараметр("ТаблицаПереопределяемыхДат",ТаблицаПереопределяемыхДат)
		
	КонецЕсли;
	
	запрос.Текст=СтрЗаменить(запрос.Текст,"Документ.ЛистНабора.Товары КАК ЛН","&Товары КАК ЛН");
	запрос.Текст=СтрЗаменить(запрос.Текст,"Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛН","&ШтрихкодыУпаковок КАК ЛН");
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ЛНШтрихкодыКоробокДляАгрегации","&ШтрихкодыКоробокДляАгрегации КАК ЛНШтрихкодыКоробокДляАгрегации"); 
	запрос.УстановитьПараметр("ШтрихкодыКоробокДляАгрегации",ШтрихкодыКоробокДляАгрегации); 
	
	запрос.УстановитьПараметр("Товары",Товары);
	запрос.УстановитьПараметр("ШтрихкодыУпаковок",ШтрихкодыУпаковок);	 
	запрос.УстановитьПараметр("ПустаяДата",ПустаяДата());
	запрос.УстановитьПараметр("ДатаОтгрузки",ДатаОтгрузки);
	запрос.УстановитьПараметр("КонтрагентРаботаетСМаркировкой",КонтрагентРаботаетСМаркировкой);
	запрос.УстановитьПараметр("ТребуетсяМаркировкаПриоритетПНК",ТребуетсяМаркировкаПриоритетПНК);
	
	ДопПараметры=ОбщегоНазначения_ПИ.ПолучитьДопПараметрыНакладной(ДокОснование);
	
	ПропускатьПроверкуНаКоличествоМарок = (ТипШК <> Перечисления.ТипыШтрихКодов.Штука);  
	
	
	если не ДопПараметры.НанесениеКодовНеОбязательно и не (ДопПараметры.ПроверятьСодержимоеТарыЧЗ или ДопПараметры.ПроверятьВложениеЭкспозитораЧЗ)   
		И НЕ ПропускатьПроверкуНаКоличествоМарок тогда
		
		Выборка=запрос.Выполнить().Выбрать();
		
		пока Выборка.Следующий() цикл
			
			Если не Выборка.Номенклатура.ОтгрузкаТолькоЧерезЧЗ Тогда 

				МассивОшибок.Добавить(СтрШаблон("Обнаружены расхождения по кодам ЧЗ у номенклатуры %1 в размере %2 штук. Штрихкоды упаковок: %3 шт. Товары: %4 шт.",
				Выборка.Номенклатура, Выборка.Дельта, Выборка.НоменклатураИзМарокКоличество, Выборка.ТоварыЛН_ЧЗКоличество));
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ИмяДокумента=ОбщегоНазначения_ПИ.ПолучитьИмяДокумента(ДокОснование);
	
	если ИмяДокумента="РасходнаяНакладная"  тогда	
		если ШтрихкодыУпаковок.Количество()>0 Тогда
			
			Запрос.Текст =
			   "ВЫБРАТЬ
			 |	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШКУпаковки,
			 |	ЛистНабораШтрихкодыУпаковок.Ссылка.ДокОснование КАК ДокОснование,
			 |	ЛистНабораШтрихкодыУпаковок.Ссылка.Дата КАК Дата
			 |ИЗ
			 |	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
			 |ГДЕ
			 |	ЛистНабораШтрихкодыУпаковок.Ссылка.Дата >= &Дата
			 |	И ЛистНабораШтрихкодыУпаковок.Ссылка.ДокОснование ССЫЛКА Документ.РасходнаяНакладная
			 |	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки В(&ШтрихкодыУпаковки)
			 |	И ЛистНабораШтрихкодыУпаковок.Ссылка <> &Ссылка
			 |	И ЛистНабораШтрихкодыУпаковок.Ссылка.Проведен
			 |	И ВЫРАЗИТЬ(ЛистНабораШтрихкодыУпаковок.Ссылка.ДокОснование КАК Документ.РасходнаяНакладная).Проведен
			 |	И НЕ ВЫРАЗИТЬ(ЛистНабораШтрихкодыУпаковок.Ссылка.ДокОснование КАК Документ.РасходнаяНакладная).СостояниеНакладной В (&СостоянияОтгружены)";
			СостоянияОтгружены = Новый Массив;
			СостоянияОтгружены.Добавить(Перечисления.СостоянияНакладной.ГотоваКОтгрузке);
			СостоянияОтгружены.Добавить(Перечисления.СостоянияНакладной.Отгружена);
			ДатаПроверки = Константы.ДатаЗапретаРедактирования.Получить();
			Запрос.УстановитьПараметр("СостоянияОтгружены",СостоянияОтгружены); 
			Запрос.УстановитьПараметр("Дата", ДатаПроверки - 86400*30);
			запрос.УстановитьПараметр("ШтрихкодыУпаковки",ШтрихкодыУпаковок.ВыгрузитьКолонку("ШтрихкодУпаковки"));
			запрос.УстановитьПараметр("Ссылка",Ссылка);	
			
			выборка=запрос.Выполнить().Выбрать();			
			
			пока Выборка.Следующий() цикл
				МассивОшибок.Добавить(СтрШаблон("Марка %1 обнаружена в другом документе %2 требуется убрать эту марку либо из неё, либо из %3", Выборка.ШКУпаковки, Выборка.ДокОснование, ДокОснование));
			КонецЦикла;

			// Сверим коды наборов отдельно
			если ИмяДокумента="РасходнаяНакладная" и ЕстьКМП тогда 
				
				запрос.Текст="ВЫБРАТЬ
				|	ТЧ.ШтрихкодНабора КАК ШтрихкодНабора
				|ПОМЕСТИТЬ ВТ
				|ИЗ
				|	&ТЧ КАК ТЧ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ВТ.ШтрихкодНабора КАК ШтрихкодНабора
				|ИЗ
				|	ВТ КАК ВТ
				|ГДЕ
				|	НЕ ВТ.ШтрихкодНабора = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.пустаяссылка)";
				запрос.УстановитьПараметр("ТЧ",ШтрихкодыУпаковок.Выгрузить(,"ШтрихкодНабора"));
				МассивКодовНабора = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШтрихкодНабора");
				если МассивКодовНабора.Количество()>0 тогда
					запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	ЛистНабораШтрихкодыУпаковок.ШтрихкодНабора КАК ШКУпаковки,
					|	ЛистНабораШтрихкодыУпаковок.Ссылка.ДокОснование КАК ДокОснование,
					|	ЛистНабораШтрихкодыУпаковок.Ссылка.Дата КАК Дата
					|ИЗ
					|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
					|ГДЕ
					|	ЛистНабораШтрихкодыУпаковок.Ссылка.Дата >= &Дата
					|	И ЛистНабораШтрихкодыУпаковок.Ссылка.ДокОснование ССЫЛКА Документ.РасходнаяНакладная
					|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодНабора В(&ШтрихкодыУпаковки)
					|	И ЛистНабораШтрихкодыУпаковок.Ссылка <> &Ссылка
					|	И ЛистНабораШтрихкодыУпаковок.Ссылка.Проведен
					|	И ВЫРАЗИТЬ(ЛистНабораШтрихкодыУпаковок.Ссылка.ДокОснование КАК Документ.РасходнаяНакладная).Проведен
					|	И НЕ ВЫРАЗИТЬ(ЛистНабораШтрихкодыУпаковок.Ссылка.ДокОснование КАК Документ.РасходнаяНакладная).СостояниеНакладной В (&СостоянияОтгружены)";
					запрос.УстановитьПараметр("ШтрихкодыУпаковки",МассивКодовНабора);			
					
					Выборка = Запрос.Выполнить().Выбрать();
					
					Пока Выборка.Следующий() Цикл
						МассивОшибок.Добавить(СтрШаблон("Марка %1 обнаружена в другом документе %2 требуется убрать эту марку либо из неё, либо из %3", Выборка.ШКУпаковки, Выборка.ДокОснование, ДокОснование));
					КонецЦикла;
				КонецЕсли; 
			КонецЕсли;
			ПроверкаОтсканированныхЗаводскихКоробок(МассивОшибок); 
		КонецЕсли;

	КонецЕсли;

	//По остальным видам накладных просто пока будем следить, что нет в соседних ЛН от этой накладной
	если ШтрихкодыУпаковок.Количество()>0 Тогда              
		//++Ратманов 26.03.2026
		запрос.Текст="ВЫБРАТЬ
		             |	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
		             |	&Ссылка КАК Ссылка
		             |ПОМЕСТИТЬ ВремТЗ
		             |ИЗ
		             |	&ТЗ КАК ЛистНабораШтрихкодыУпаковок
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	ЕСТЬNULL(ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод, ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки) КАК ШКУпаковки,
		             |	ЛистНабораШтрихкодыУпаковок.Ссылка КАК ЛН
		             |ПОМЕСТИТЬ ШКТекЛН
		             |ИЗ
		             |	ВремТЗ КАК ЛистНабораШтрихкодыУпаковок
		             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		             |		ПО ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
		             |
		             |ИНДЕКСИРОВАТЬ ПО
		             |	ШКУпаковки
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
		             |	ЛистНабораШтрихкодыУпаковок.Ссылка КАК ЛН
		             |ПОМЕСТИТЬ ШКДругихЛННеРазвернуто
		             |ИЗ
		             |	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
		             |		ПО (ЛистНабора.Ссылка = ЛистНабораШтрихкодыУпаковок.Ссылка)
		             |ГДЕ
		             |	ЛистНабора.Проведен
		             |	И НЕ ЛистНабораШтрихкодыУпаковок.Ссылка = &Ссылка
		             |	И ЛистНабора.ДокОснование = &ДокОснование
		             |
		             |ИНДЕКСИРОВАТЬ ПО
		             |	ШтрихкодУпаковки
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	ЕСТЬNULL(ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод, ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки) КАК ШКУпаковки,
		             |	ЛистНабораШтрихкодыУпаковок.ЛН КАК ЛН
		             |ПОМЕСТИТЬ ШКДругихЛН
		             |ИЗ
		             |	ШКДругихЛННеРазвернуто КАК ЛистНабораШтрихкодыУпаковок
		             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		             |		ПО ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
		             |
		             |ИНДЕКСИРОВАТЬ ПО
		             |	ШКУпаковки
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	ШКДругихЛН.ШКУпаковки КАК ШКУпаковки,
		             |	ШКДругихЛН.ЛН КАК ЛН
		             |ИЗ
		             |	ШКДругихЛН КАК ШКДругихЛН
		             |		ЛЕВОЕ СОЕДИНЕНИЕ ШКТекЛН КАК ШКТекЛН
		             |		ПО ШКДругихЛН.ШКУпаковки = ШКТекЛН.ШКУпаковки
		             |ГДЕ
		             |	НЕ ШКТекЛН.ШКУпаковки ЕСТЬ NULL";
		запрос.УстановитьПараметр("Ссылка",Ссылка);
		запрос.УстановитьПараметр("ТЗ",ШтрихкодыУпаковок);
		запрос.УстановитьПараметр("ДокОснование",ДокОснование);
		
		выборка=запрос.Выполнить().Выбрать();
		пока Выборка.Следующий() цикл
			МассивОшибок.Добавить(СтрШаблон("Марка %1 обнаружена в другом ЛН %2 требуется убрать эту марку либо из него, либо из %3",Выборка.ШКУпаковки,Выборка.лн,Ссылка));
		КонецЦикла;	
	КонецЕсли;

	если МассивОшибок.Количество()>0 тогда
		Результат.Успех=ложь;
		Результат.Ошибки=СтрСоединить(МассивОшибок,Символы.ПС);
	КонецЕсли;   
	
	ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерФункции(ДанныеЗамера);  
	
	возврат Результат;

КонецФункции



Процедура ЗаполнитьДокументАгрегации () Экспорт 
	если КодАгрегации=Неопределено тогда
		возврат;
	КонецЕсли;
	
	ТЗТовары=товары.Выгрузить(,"Номенклатура");
	ТЗТовары.Свернуть("Номенклатура");
	если ТЗТовары.Количество()>1 тогда 
		ТипУпаковки=Перечисления.ТипыУпаковок.МультитоварнаяУпаковка;
	иначе	
		ТипУпаковки=Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
	КонецЕсли;	
	
	ДокМаркировки	= НайтиДокумент("МаркировкаТоваровИСМП", Новый Структура("ДокументОснование,ВидОперации,ТипУпаковки,Проведен", ДокОснование, Перечисления.ВидыОперацийМаркировки.Агрегация, ТипУпаковки,Истина));			
	если не ЗначениеЗаполнено(ДокМаркировки) тогда					
		ДокМаркировкиОбъект = Документы.МаркировкаТоваровИСМП.СоздатьДокумент();						
		ЗаполнитьШапкуДокумента(ДокМаркировкиОбъект, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац);					
		ДокМаркировкиОбъект.Дата						= ТекущаяДата();
		ДокМаркировкиОбъект.Статус					= Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки;				
		ДокМаркировкиОбъект.ДокументОснование 		= ДокОснование;
		ДокМаркировкиОбъект.ТипУпаковки				= ТипУпаковки;
		ДокМаркировкиОбъект.ВидОперации				= Перечисления.ВидыОперацийМаркировки.Агрегация;
		ДокМаркировкиОбъект.ВидОперацииИСМП			= Перечисления.ВидыОперацийИСМП.Агрегация;
		ДокМаркировкиОбъект.ПодразделениеНанесения	= ПолучитьРеквизитШапки(ДокОснование,"Склад.Подразделение","Документ");						
		ДокМаркировкиОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	иначе
		ДокМаркировкиОбъект=ДокМаркировки.получитьОбъект();
	КонецЕсли;
	
	если ложь тогда ДокМаркировкиОбъект=документы.МаркировкаТоваровИСМП.СоздатьДокумент();КонецЕсли;
	СтрокаТЧ=ДокМаркировкиОбъект.ШтрихкодыКоробок.Найти(КодАгрегации,"ШтрихкодКоробки");
	если СтрокаТЧ<>Неопределено тогда
		если СтрокаТЧ.ДокументОснование<>Ссылка тогда
			ВызватьИсключение "Кривые коды агрегации!!! обратитесь к разработчикам";
			
		КонецЕсли;
	иначе
		СтрТЧ=ДокМаркировкиОбъект.ШтрихкодыКоробок.Добавить();
		СтрТЧ.ШтрихкодКоробки=КодАгрегации;
		СтрТЧ.ДокументОснование=Ссылка;
		ДокМаркировкиОбъект.Записать();	
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбновитьШтрихкодыКоробокДляАгрегации()

	МассивДляУдаления = Новый Массив;
	МассивШК = ШтрихкодыУпаковок.ВыгрузитьКолонку("ШтрихкодУпаковки"); 
	
	Для каждого СтрокаШК  Из ШтрихкодыКоробокДляАгрегации Цикл
		
		Если МассивШК.Найти(СтрокаШК.НовыйКодКоробки) = неопределено Тогда
			
			МассивДляУдаления.Добавить(СтрокаШК); 
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Для каждого СтрокаДляУдаления  Из МассивДляУдаления Цикл
		
		ШтрихкодыКоробокДляАгрегации.Удалить(СтрокаДляУдаления); 
		
	КонецЦикла;
	
	ДополнительныеАгрегации = ШтрихкодыКоробокДляАгрегации.Количество() > 0; 

КонецПроцедуры 

Функция ПроверкаОтсканированныхЗаводскихКоробок(МассивОшибок)

	ОбновитьШтрихкодыКоробокДляАгрегации(); 
	
	ДатаПроверки = Константы.ДатаЗапретаРедактирования.Получить();
	
	Запрос = Новый Запрос; 
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛистНабораШтрихкодыУпаковок.ИсходныйКодКоробки КАК ШКУпаковки,
	|	ЛистНабораШтрихкодыУпаковок.Ссылка КАК ЛН,
	|	ЛистНабора.Дата КАК Дата
	|ИЗ
	|	Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ЛистНабораШтрихкодыУпаковок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
	|		ПО (ЛистНабора.Ссылка = ЛистНабораШтрихкодыУпаковок.Ссылка)
	|ГДЕ
	|	ЛистНабора.Дата >= &Дата
	|	И ЛистНабора.ДокОснование ССЫЛКА Документ.РасходнаяНакладная
	|	И ЛистНабораШтрихкодыУпаковок.ИсходныйКодКоробки В(&ШтрихкодыУпаковки)
	|	И ЛистНабораШтрихкодыУпаковок.Ссылка <> &Ссылка
	|	И ЛистНабора.Проведен"; 
	Запрос.УстановитьПараметр("ШтрихкодыУпаковки",ШтрихкодыКоробокДляАгрегации.ВыгрузитьКолонку("ИсходныйКодКоробки"));
	Запрос.УстановитьПараметр("Дата", ДатаПроверки - 86400*30);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);	
	
	Выборка =Запрос.Выполнить().Выбрать();  
	Пока Выборка.Следующий() Цикл
		МассивОшибок.Добавить(СтрШаблон("Старая коробка %1 обнаружена в другом ЛН %2 требуется убрать эту марку либо из него, либо из %3",Выборка.ШКУпаковки,Выборка.ЛН,Ссылка));
	КонецЦикла;
	
КонецФункции // ()


НужноВыгружать=Ложь;


