#Область СобытияОбъекта


Процедура ПередЗаписью(Отказ)
	ДополнительныеСвойства.Вставить("ОтключитьЖурнализациюЗаписи", Истина);
	
	Если ОбменДанными.Загрузка Тогда
		Если Маркировка_ПИ.ТипТекущегоУзла() = Перечисления.ТипУзлаИБ.Склад И ЗначениеЗаполнено(ОбменДанными.Отправитель) Тогда
			Если ТипКода = Перечисления.ТипыКодовМаркировки.ЛогистическаяУпаковка
				И СоставКоробкиЗаполнен(Ссылка) Тогда
				Отказ = Истина; //Коробку могли собрать уже - не надо от греха ее трогать 			
			КонецЕсли; 		
		КонецЕсли;
		
		ВидОперации = МаркировкаКС.ПолучитьЗначениеПараметра(ДополнительныеСвойства, "ВидОперации");
		Если ВидОперации <> Перечисления.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли; 
	
	Если ТипКода = Перечисления.ТипыКодовМаркировки.Товар Тогда
		Наименование 		= Справочники.ШтрихкодыУпаковокТоваров.СформироватьНаименованиеШкGS1(ЗначениеШтрихкода);
		
		Если КодировкаШтрихкода.Пустая() Тогда
			КодировкаШтрихкода = Перечисления.ТипыКодировокШК.GS1_DataMatrix;		
		КонецЕсли;
	Иначе
		Если КодировкаШтрихкода.Пустая() Тогда
			КодировкаШтрихкода = Перечисления.ТипыКодировокШК.GS1_128;
		КонецЕсли;		
	КонецЕсли;	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка И ЗначениеЗаполнено(ОбменДанными.Отправитель) Тогда Возврат КонецЕсли;
	
	Отказ = НЕ ШтрихКодУникален();
	
	Если НЕ Отказ Тогда
		Если СпособВводаВОборот <> Перечисления.СпособыВводаВОборотСУЗ.Импорт Тогда	//Импортные лучше с агрегацией отправить - от греха подальше
			локУстановитьСписокПолучателей();
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

Функция локУстановитьСписокПолучателей()	
	ИмяПланаОбмена	= "ДанныеЧЗ";
	Получатели		= Новый Массив;
	
	Если Маркировка_ПИ.ТипТекущегоУзла() = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		Для Каждого УзелПолучатель Из Маркировка_ПИ.ПолучитьМассивУзловПоТипу(Перечисления.ТипУзлаИБ.Склад, ИмяПланаОбмена) Цикл
			Получатели.Добавить(УзелПолучатель);
		КонецЦикла;
	Иначе
	//	рШапки = ПолучитьРеквизитыШапки(Ссылка, "ТипУпаковки,СпособВводаВОборот");
	//	Если (рШапки.ТипУпаковки = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка
	//		ИЛИ рШапки.ТипУпаковки = Перечисления.ТипыУпаковок.МультитоварнаяУпаковка) 
	//		И рШапки.СпособВводаВОборот <> Перечисления.СпособыВводаВОборотСУЗ.Импорт 
	//		И ВложенныеШтрихкоды.Количество() > 0 Тогда
	//		Для Каждого УзелПолучатель Из Маркировка_ПИ.ПолучитьМассивУзловПоТипу(Перечисления.ТипУзлаИБ.УправляющееПодразделение, ИмяПланаОбмена) Цикл
	//			Получатели.Добавить(УзелПолучатель);			
	//		КонецЦикла;										
	//	КонецЕсли;
	КонецЕсли;
	
	Для Каждого Получатель Из Получатели Цикл
		Если Получатель <> Маркировка_ПИ.ЭтотУзел(ИмяПланаОбмена) Тогда
			ОбменДанными.Получатели.Добавить(Получатель);				
		КонецЕсли;	
	КонецЦикла;
КонецФункции // ()

Функция ШтрихКодУникален()
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|ГДЕ	
	|	ЗначениеШтрихкода = &ЗначениеШтрихкода
	|	И Ссылка <> &Ссылка
	|";
	
	Запрос.УстановитьПараметр("ЗначениеШтрихкода", ЗначениеШтрихкода);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат НЕ (Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка));
КонецФункции //ШтрихКодУникален()

Функция СоставКоробкиЗаполнен(ШтрихкодКоробки)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1 
	|	Ссылка
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды
	|ГДЕ
	|	Ссылка = &ШтрихкодКоробки
	|";
	Запрос.УстановитьПараметр("ШтрихкодКоробки", ШтрихкодКоробки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат (Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка));
КонецФункции //СоставКоробкиЗаполнен(Коробка)