Процедура ЗаполнитьОтчетАгента() Экспорт 
	если ЗначениеЗаполнено(Период) тогда
		ПериодЗаполнения=Период;
	иначе
		ПериодЗаполнения=Дата;
	КонецЕсли;
	
	
	// Кухарь А.Ю. 02.09.2021 начало
	ДоговорВознаграждения=ПрочитатьРСРеквизитСправочника("ДоговорВознаграждения",Договор,Договор); 
	// Кухарь А.Ю. 02.09.2021 конец
	
	
	Запрос=новый запрос;
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("Договор",Договор);
	запрос.УстановитьПараметр("Дата1",НачалоМесяца(ПериодЗаполнения));
	запрос.УстановитьПараметр("Дата2",КонецМесяца(ПериодЗаполнения));
	
	запрос.УстановитьПараметр("Дата3",НачалоМесяца(ПериодЗаполнения-6*30*86400));
	запрос.УстановитьПараметр("Дата4",НачалоМесяца(ПериодЗаполнения+6*30*86400));
	запрос.УстановитьПараметр("КодОперации",Перечисления.КодыОперацийОстатки.АгентскийДоговор);
	
	запрос.УстановитьПараметр("Отгружен",Перечисления.СостоянияНакладной.Отгружена);
	запрос.УстановитьПараметр("Принята",Перечисления.СостоянияНакладной.Принята);
	
		
// Кухарь А.Ю. 03.08.2021 начало
//
	Запрос.Текст="ВЫБРАТЬ
	|	ПриходнаяНакладная.Ссылка КАК Ссылка,
	|	ВЫРАЗИТЬ(ПриходнаяНакладная.ДокОснование КАК Документ.ЗаказПоставщику) КАК ЗПС
	|ПОМЕСТИТЬ ЗПС
	|ИЗ
	|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	|ГДЕ
	|	ПриходнаяНакладная.КодОперации = &КодОперации
	|	И ПриходнаяНакладная.СостояниеНакладной = &Принята
	|	И ПриходнаяНакладная.Дата МЕЖДУ &Дата3 И &Дата4
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходнаяНакладная.Ссылка КАК Ссылка,
	|	ПриходнаяНакладная.ЗПС КАК ЗПС,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладная.ЗПС.ДокОснование ССЫЛКА Документ.КонтрактСПроизводителем
	|			ТОГДА ВЫРАЗИТЬ(ПриходнаяНакладная.ЗПС КАК Документ.ЗаказПоставщику).ДокОснование
	|	КОНЕЦ КАК КП
	|ПОМЕСТИТЬ КП
	|ИЗ
	|	ЗПС КАК ПриходнаяНакладная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходнаяНакладная.Ссылка КАК ПНК,
	|	ПриходнаяНакладная.ЗПС КАК ЗПС,
	|	ПриходнаяНакладная.КП КАК КП,
	|	ВЫБОР
	|		КОГДА ПриходнаяНакладная.КП.ДокОснование ССЫЛКА Документ.ЗаявкаНаПроизводство
	|			ТОГДА ВЫРАЗИТЬ(ПриходнаяНакладная.КП КАК Документ.КонтрактСПроизводителем).ДокОснование
	|	КОНЕЦ КАК ЗАП
	|ПОМЕСТИТЬ ЗАП
	|ИЗ
	|	КП КАК ПриходнаяНакладная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ.ПНК КАК ПНК,
	|	ТЗ.ЗПС КАК ЗПС,
	|	ТЗ.КП КАК КП,
	|	ТЗ.ЗАП КАК ЗАП,
	|	Заказ.Ссылка КАК Заказ
	|ПОМЕСТИТЬ Заказ
	|ИЗ
	|	ЗАП КАК ТЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заказ КАК Заказ
	|		ПО ТЗ.ЗАП = Заказ.ЗаявкаНаПроизводство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ.ПНК КАК ПНК,
	|	ТЗ.ЗПС КАК ЗПС,
	|	ТЗ.КП КАК КП,
	|	ТЗ.ЗАП КАК ЗАП,
	|	ТЗ.Заказ КАК Заказ,
	|	РасходнаяНакладная.Ссылка КАК РНК
	|ИЗ
	|	Заказ КАК ТЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|		ПО ТЗ.Заказ = РасходнаяНакладная.ДокОснование
	|			И (РасходнаяНакладная.Проведен)
	|			И (РасходнаяНакладная.СостояниеНакладной = &Отгружен)";
	ТЗВсехДокументов=запрос.Выполнить().Выгрузить();
 
// Кухарь А.Ю. 03.08.2021 конец
	
	
	
	РНК.Очистить();
	запрос.Текст="ВЫБРАТЬ
	|	Док.Ссылка КАК Накладная
	|ИЗ
	|	Документ.РасходнаяНакладная КАК Док
	|ГДЕ
	|	Док.Дата МЕЖДУ &Дата1 И &Дата2
	|	И Док.Проведен
	|	И Док.СостояниеНакладной = &Отгружен
	|	И Док.Договор = &Договор
	|	И Док.Контрагент = &Контрагент";
	Выборка = запрос.Выполнить().Выбрать();
	пока Выборка.Следующий() цикл
		СтрТЧ=РНК.Добавить();
		СтрТЧ.Накладная=Выборка.Накладная;
		ЗаполнитьСтрТЧПоНакладной(СтрТЧ);
	КонецЦикла;
	
	ПНК.Очистить();
	запрос.Текст="ВЫБРАТЬ
	|	Док.Ссылка КАК Накладная
	|ИЗ
	|	Документ.ПриходнаяНакладная КАК Док
	|ГДЕ
	|	Док.Дата МЕЖДУ &Дата1 И &Дата2
	|	И Док.Проведен
	|	И Док.СостояниеНакладной = &Принята
	|	И Док.Договор = &Договор
	|	И Док.Контрагент = &Контрагент";
	Выборка = запрос.Выполнить().Выбрать();
	пока Выборка.Следующий() цикл
		// Кухарь А.Ю. 03.08.2021 начало
		//
		СтрТЗОбщая=ТЗВсехДокументов.Найти(Выборка.Накладная,"ПНК");
		если СтрТЗОбщая<>Неопределено тогда                                                            
			ЗПС=СтрТЗОбщая.ЗПС;
			если зпс = Неопределено или зпс = null тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		// Кухарь А.Ю. 03.08.2021 конец

		СтрТЧ=ПНК.Добавить();
		СтрТЧ.Накладная=Выборка.Накладная;
		ЗаполнитьСтрТЧПоНакладной(СтрТЧ);		
	КонецЦикла;
	
	ддс.Очистить();
	запрос.Текст="ВЫБРАТЬ
	|	ДенежныеСредства.Регистратор КАК ДДС,
	|	ДенежныеСредства.НомерСтроки КАК НомерСтрокиДДС,
	|	ДенежныеСредства.СуммаУпр КАК Сумма,
	|	ДенежныеСредства.СтатьяДДС КАК СтатьяДДС_Бух,
	|	ДенежныеСредства.Комментарий КАК НазначениеПлатежа
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства КАК ДенежныеСредства
	|ГДЕ
	|	ДенежныеСредства.Период МЕЖДУ &Дата1 И &Дата2
	|	И ДенежныеСредства.Договор = &Договор
	|	И ДенежныеСредства.Регистратор ССЫЛКА Документ.ДвиженияДенежныхСредств";
	Выборка=запрос.Выполнить().Выбрать();
	пока Выборка.Следующий() цикл
		СтрТЧ=ДДС.Добавить();
		ЗаполнитьЗначенияСвойств(СтрТЧ,Выборка);
	КонецЦикла;
	
	
	//	
	
	
КонецПроцедуры


Процедура ЗаполнитьСтрТЧПоНакладной (СтрТЧ) экспорт
	Накладная=СтрТЧ.Накладная;  
	ВидНакладной=Накладная.Метаданные().Имя;
	если ложь тогда накладная=документы.РасходнаяНакладная.ПустаяСсылка();КонецЕсли;
	
	СтрТЧ.ТипТовара= ПолучитьТипТовараНакладной(Накладная);
	ЗаполнитьЗначенияСвойств(СтрТЧ,Накладная);
	СтрТЧ.НДС=Накладная.товары.Итог("НДС");
	СтрТЧ.СуммаБезНДС=Накладная.товары.Итог("Сумма");

	// Кухарь А.Ю. 12.08.2021 начало
	// 	если ВидНакладной = "РасходнаяНакладная"   тогда
	если ВидНакладной = "РасходнаяНакладная" или  ВидНакладной = "ПриходнаяНакладная"   тогда		 
		// Кухарь А.Ю. 12.08.2021 конец		
		СтрТЧ.Комиссия=ПрочитатьРСРеквизитСправочника("АгентскаяКомиссия",Договор,0);
		
		// Кухарь А.Ю. 04.08.2021 начало
		// 		СтрТЧ.ПроцентОтСуммы=(СтрТЧ.СуммаДокумента*СтрТЧ.Комиссия)/100;
		СтрТЧ.ПроцентОтСуммы=(Накладная.Товары.итог("Сумма")*СтрТЧ.Комиссия)/100;		 
		// Кухарь А.Ю. 04.08.2021 конец
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьТипТовараНакладной (Накладная)
	ТипТовара="";
	ВидНакладной=Накладная.Метаданные().Имя;

	запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ РАЗЛИЧНЫЕ
	              |	Док.Номенклатура.Родитель.Родитель.ТипТовара КАК ТипТовара
	              |ИЗ
	              |	Документ.РасходнаяНакладная.Товары КАК Док
	              |ГДЕ
	              |	Док.Ссылка = &Ссылка
	              |	И Док.Количество > 0";
	запрос.УстановитьПараметр("Ссылка",Накладная);
	
	если ВидНакладной<>"РасходнаяНакладная" тогда
		запрос.Текст=СтрЗаменить(запрос.Текст,"РасходнаяНакладная",ВидНакладной);		
	КонецЕсли;
	
	
	Выборка=запрос.Выполнить().Выбрать();
	
	пока Выборка.следующий() цикл
		ТипТовара=ТипТовара+Выборка.ТипТовара+",";
	КонецЦикла;
	СтрДл= СтрДлина(ТипТовара);
	если СтрДл>1 тогда
		ТипТовара=Лев(ТипТовара,СтрДл-1);
	КонецЕсли;
	возврат ТипТовара;
	
КонецФункции


Процедура ОбработкаПроведения(Отказ, Режим)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	СформироватьДвиженияЗатраты();
	СформироватьДвиженияВзаиморасчеты();
КонецПроцедуры

Процедура СформироватьДвиженияЗатраты ()
	Движения.Затраты.Записывать = Истина;
	Движения.Затраты.Очистить();
	Сумма=РНК.Итог("ПроцентОтСуммы");
	Рубли=Константы.ВалютаУпрУчета.Получить();
	
	// Кухарь А.Ю. 06.09.2021 начало
	//
	если ЗначениеЗаполнено(Контрагент.Ведущий) тогда
		КонтрагентДвижения=Контрагент.Ведущий;
	иначе
		КонтрагентДвижения=Контрагент;
	КонецЕсли;
	// Кухарь А.Ю. 06.09.2021 конец
	
	
	
	если Сумма>0 тогда
		Движение = Движения.Затраты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = КонтрагентДвижения;
		Движение.Подразделение=Контрагент.Менеджер.Подразделение;
		Движение.Договор = ДоговорВознаграждения;	
		Движение.СуммаДокумента = Сумма;
		Движение.СуммаУпр = Сумма;
		Движение.ВалютаДокумента=Рубли;   
		Движение.СтатьяЗатрат=Справочники.СтатьиЗатрат.НайтиПоКоду("212 000");
	КонецЕсли;
	
	
КонецПроцедуры


Процедура СформироватьДвиженияВзаиморасчеты ()
	Движения.Взаиморасчеты.Записывать = Истина;
	Движения.Взаиморасчеты.Очистить();
	Сумма=РНК.Итог("ПроцентОтСуммы");
	
	// Кухарь А.Ю.  09.11.2023 начало
	Сумма=Сумма-ПНК.Итог("ПроцентОтСуммы");
	// Кухарь А.Ю.  09.11.2023 конец
	
	Рубли=Константы.ВалютаУпрУчета.Получить();
	// Кухарь А.Ю. 06.09.2021 начало
	//
	если ЗначениеЗаполнено(Контрагент.Ведущий) тогда
		КонтрагентДвижения=Контрагент.Ведущий;
	иначе
		КонтрагентДвижения=Контрагент;
	КонецЕсли;
	// Кухарь А.Ю. 06.09.2021 конец
	
	
	если Сумма>0 тогда
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагент = КонтрагентДвижения;
		Движение.Договор = ДоговорВознаграждения;	
		Движение.СуммаВал = Сумма;
		Движение.СуммаУпр = Сумма;
		Движение.СуммаДокумента = Сумма;
		Движение.ВалютаДокумента=Рубли;
	КонецЕсли;
	


КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры
