
#Область ПрограммныйИнтерфейс

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Ихсанов Д. А. Начало 16.04.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-1102
// Функция - МП Получить оработчик для обмена с маркет плейсом
// 
// Параметры:
//  МаркетПлейс - СправочникСсылка.ИнетМагазины
// 
// Возвращаемое значение:
//  ОбработкиМенеджер - Модуль менеджера обработки по маркетплейс
Функция МП_ПолучитьОбработчикДляОбменаСМаркетПлейсом(МаркетПлейс) Экспорт 
	
	//РЕФАКТОРИНГ - ХАРДКОД!!!
	Если МаркетПлейс = НайтиПоКоду("00004") Тогда
		Возврат Обработки.МП_ММ_ЯндексМаркет;
	ИначеЕсли МаркетПлейс = НайтиПоКоду("00014") Тогда
		Возврат Обработки.МП_ММ_МагнитМаркет;
	ИначеЕсли МаркетПлейс = НайтиПоКоду("00002") Тогда
		Возврат Обработки.МП_ММ_Озон;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // МП_ПолучитьОбработчикДляОбменаСМаркетПлейсом()
// Ихсанов Д. А. Конец  16.04.2025

#КонецЕсли

#КонецОбласти
