#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокВыбора = Элементы.КодВидаОперации.СписокВыбора;
	Для каждого КиЗ Из ПолучитьКодыОпераций_СФВыданный() Цикл
		СписокВыбора.Добавить(КиЗ.Значение, КиЗ.Представление);	
	КонецЦикла;
	
	УправлениеВидимостью();
КонецПроцедуры
	
#КонецОбласти 

Функция УправлениеВидимостью()
	
	Элементы.НомерИсправления.Доступность 				= Объект.Исправление;	
	Элементы.НомерИсправления.АвтоОтметкаНезаполненного = НЕ Объект.Исправление;
	
	Элементы.НомерИсходногоДокумента.Доступность 		= Объект.Исправление;
	Элементы.НомерИсходногоДокумента.АвтоОтметкаНезаполненного = НЕ Объект.Исправление;
	
	Элементы.ДатаИсходногоДокумента.Доступность 		= Объект.Исправление;
	Элементы.ДатаИсходногоДокумента.АвтоОтметкаНезаполненного = НЕ Объект.Исправление;
	
КонецФункции //УправлениеВидимостью()


Функция ПолучитьКодыОпераций_СФВыданный()
	
	СписокКодовОпераций = Новый СписокЗначений;
	
	СписокКодовОпераций.Добавить("01", НСтр("ru = '01 - Реализация товаров, работ, услуг и операции, приравненные к ней'"));
	СписокКодовОпераций.Добавить("02", НСтр("ru = '02 - Авансы полученные'"));
	СписокКодовОпераций.Добавить("06", НСтр("ru = '06 - Налоговый агент, ст. 161 НК'"));
	СписокКодовОпераций.Добавить("10", НСтр("ru = '10 - Безвозмездная передача товаров, работ, услуг'"));
	СписокКодовОпераций.Добавить("13", НСтр("ru = '13 - Капитальное строительство, модернизация (реконструкция) объектов недвижимости'"));
	СписокКодовОпераций.Добавить("14", НСтр("ru = '14 - Реализация прав, пп.1-4 ст. 155 НК'"));
	СписокКодовОпераций.Добавить("15", НСтр("ru = '15 - Совместная реализация собственных и комиссионных товаров, работ, услуг'"));
	СписокКодовОпераций.Добавить("16", НСтр("ru = '16 - Возврат от покупателя-неплательщика НДС'"));
	СписокКодовОпераций.Добавить("17", НСтр("ru = '17 - Возврат от покупателя-физического лица'"));
	СписокКодовОпераций.Добавить("18", НСтр("ru = '18 - Изменение стоимости отгруженных товаров (работ, услуг) в сторону уменьшения'"));
	СписокКодовОпераций.Добавить("21", НСтр("ru = '21 - Восстановление НДС, п.8 ст. 145, п.3 ст. 170, ст. 171.1 НК, а также при операциях, облагаемых по ставке 0%'"));
	СписокКодовОпераций.Добавить("26", НСтр("ru = '26 - Реализация товаров, работ, услуг неплательщикам НДС, получение авансов'"));
	СписокКодовОпераций.Добавить("27", НСтр("ru = '27 - Сводный комиссионный счет-фактура, п.3.1 ст. 169 НК'"));
	СписокКодовОпераций.Добавить("28", НСтр("ru = '28 - Сводный комиссионный счет-фактура на аванс, п.3.1 ст. 169 НК'"));
	СписокКодовОпераций.Добавить("29", НСтр("ru = '29 - Корректировка по п.6 ст. 105.3 НК'"));
	СписокКодовОпераций.Добавить("30", НСтр("ru = '30 - Отгрузка товаров в ОЭЗ Калининградской обл., абз.1 пп.1.1 п.1 ст. 151 НК'"));
	СписокКодовОпераций.Добавить("31", НСтр("ru = '31 - Уплата НДС в ОЭЗ Калининградской обл., абз.2 пп.1.1 п.1 ст. 151 НК'"));
	
	// Коды, введенные в действие с 1 января 2018 года.
	СписокКодовОпераций.Добавить("33", НСтр("ru = '33 - Авансы полученные за товары п.8 ст. 161 НК'"));
	СписокКодовОпераций.Добавить("34", НСтр("ru = '34 - Реализация товаров п.8 ст. 161 НК'"));
	СписокКодовОпераций.Добавить("35", НСтр("ru = '35 - Оформление документа для компенсации НДС гражданину иностранного государства'"));
	СписокКодовОпераций.Добавить("37", НСтр("ru = '37 - Реализация сырьевых товаров на экспорт по ставке 18%, п.7 ст.164 НК'"));
	СписокКодовОпераций.Добавить("38", НСтр("ru = '38 - Реализация несырьевых товаров на экспорт по ставке 18%, п.7 ст.164 НК'"));
	СписокКодовОпераций.Добавить("39", НСтр("ru = '39 - Реализация несырьевых товаров на экспорт по ставке 10%, п.7 ст.164 НК'"));
	СписокКодовОпераций.Добавить("40", НСтр("ru = '40 - Реализация работ (услуг) в отношении экспортируемых товаров по ставке 18%, пп.2.1-2.5,2.7 и 2.8 п.1, п.7 ст.164 НК'"));
	
	// Код, введенный в действие с 1 апреля 2024 года.
	СписокКодовОпераций.Добавить("47", НСтр("ru = '47 - Перепродажа товаров физических лиц, п.5.1, п.5.2 ст.154 НК'"));
	
	Возврат СписокКодовОпераций;
КонецФункции

