
Процедура ОбработкаПроведения(Отказ, Режим) экспорт
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	получатель=Ложь;
	отправитель=Ложь;
	ЦО=Ложь;
	
	если склад.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код тогда
		получатель=Ложь;
		отправитель=Истина;
	ИначеЕсли СкладПолучатель.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код тогда
		получатель=Истина;
		отправитель=Ложь;
	ИначеЕсли ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда 
		ЦО=Истина;
	КонецЕсли;
	
	если СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена и (отправитель или ЦО) тогда
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			// регистр ТарныеОстатки Расход
			Движение = Движения.ТарныеОстатки.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Склад = Склад;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Количество = ТекСтрокаТовары.Количество;
			Движение.Сумма = ТекСтрокаТовары.Сумма;
			Движение.КодОперации = КодОперацииОстатки;
			Движение.ПунктДоставки = ПолучитьПДСклада(СкладПолучатель);
		КонецЦикла;
	КонецЕсли;
	
	если СостояниеНакладнойУПолучателя=Перечисления.СостоянияНакладной.Принята и (получатель или ЦО) тогда
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			// регистр ТарныеОстатки Приход
			Движение = Движения.ТарныеОстатки.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Склад = СкладПолучатель;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Количество = ТекСтрокаТовары.Принято;
			Движение.Сумма = ТекСтрокаТовары.Принято*ТекСтрокаТовары.Цена;
			Движение.КодОперации = КодОперацииОстатки;
			Движение.ПунктДоставки = ПолучитьПДСклада(Склад);
		КонецЦикла;
		//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	КонецЕсли;
	Если ОбменДанными.Загрузка тогда
		Движения.ТарныеОстатки.Записать();
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.РасходМатериаловИТары") Тогда
		// Заполнение шапки
		Автор = Основание.Автор;
		КодОперацииОстатки = Основание.КодОперацииОстатки;
		Комментарий = Основание.Комментарий;
		Контрагент = Основание.Контрагент;
		Организация = Основание.Организация;
		ПунктДоставки = Основание.ПунктДоставки;
		Склад = Основание.Склад;
		СостояниеНакладной = Основание.СостояниеНакладной;
		Для Каждого ТекСтрокаТовары Из Основание.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Всего = ТекСтрокаТовары.Всего;
			НоваяСтрока.Единица = ТекСтрокаТовары.Единица;
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Коэффициент = ТекСтрокаТовары.Коэффициент;
			НоваяСтрока.НДС = ТекСтрокаТовары.НДС;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Объем = ТекСтрокаТовары.Объем;
			НоваяСтрока.СтавкаНДС = ТекСтрокаТовары.СтавкаНДС;
			НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
			НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
			НоваяСтрока.ЦенаОприходования = ТекСтрокаТовары.ЦенаОприходования;
		КонецЦикла;
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПриходМатериаловИТары") Тогда
		// Заполнение шапки
		Автор = Основание.Автор;
		КодОперацииОстатки = Основание.КодОперацииОстатки;
		Комментарий = Основание.Комментарий;
		Контрагент = Основание.Контрагент;
		Организация = Основание.Организация;
		ПунктДоставки = Основание.ПунктДоставки;
		Склад = Основание.Склад;
		СостояниеНакладной = Основание.СостояниеНакладной;
		Для Каждого ТекСтрокаТовары Из Основание.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Всего = ТекСтрокаТовары.Всего;
			НоваяСтрока.Единица = ТекСтрокаТовары.Единица;
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Коэффициент = ТекСтрокаТовары.Коэффициент;
			НоваяСтрока.НДС = ТекСтрокаТовары.НДС;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Объем = ТекСтрокаТовары.Объем;
			НоваяСтрока.СтавкаНДС = ТекСтрокаТовары.СтавкаНДС;
			НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
			НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
			НоваяСтрока.ЦенаОприходования = ТекСтрокаТовары.ЦенаОприходования;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	НадоВыгружать = Ложь;
		
	ЕстьИзменения	=Модифицированность();	
	НадоВыгружать	=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	
 	Если не ОбменДанными.Загрузка Тогда
        НадоВыгружать = Истина;
	КонецЕсли;
	
	
	Если НадоВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры


Функция ПолучитьПДСклада(СкладРеквизит) Экспорт 
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПунктыДоставки.Ссылка как ПД
	|ИЗ
	|	Справочник.ПунктыДоставки КАК ПунктыДоставки
	|ГДЕ
	|	ПунктыДоставки.Владелец = &Владелец
	|	И ПунктыДоставки.ПометкаУдаления = ложь";
	запрос.УстановитьПараметр("Владелец",СкладРеквизит);			 
	результат=запрос.Выполнить().Выгрузить();
	
	если результат.Количество()>0 тогда
		Возврат результат.Получить(0).ПД;
	иначе
		Возврат Справочники.ПунктыДоставки.ПустаяСсылка();
	КонецЕсли;
	
	
	
КонецФункции