
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)	
	Направление	= ?(Объект.Направление = 1,"Прием","Отправка");		
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыПакетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ВыбраннаяСтрока <> Неопределено Тогда
		ТекДанные = Объект.ОбъектыПакета.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если ТекДанные <> Неопределено Тогда		
			ПоказатьЗначение( , ТекДанные.Основание);
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры
