Перем МассивСкладовПРМ;
Перем МассивСкладовОбПРМ;

Процедура Сформировать(ТПараметры = неопределено )  Экспорт
	
	Если ТипЗнч(ТПараметры) <> Тип("ТаблицаЗначений") Тогда
	
		Возврат; 	
	
	КонецЕсли;
	
	ПараметрыРегламента = Новый Соответствие;
	
	МассивСкладов = Новый Массив; 
	
	Для каждого СтрокаПараметров Из ТПараметры Цикл   
		
		ЗаписатьВЛог("РегламентСозданиеПРМ","Параметр: "+СтрокаПараметров.Имя+" - "+СтрокаПараметров.Значение,"Информация");		
		ПараметрыРегламента.Вставить(СтрокаПараметров.Имя,СтрокаПараметров.Значение);
		
		Если СтрНайти(СтрокаПараметров.Имя,"Склад",,1) > 0 Тогда
		
			МассивСкладов.Добавить(СтрокаПараметров.Значение); 	
		
		КонецЕсли;
		
	КонецЦикла; 
	
	Если МассивСкладов.Количество() = 0 Тогда
		
		ЗаписатьВЛог("РегламентСозданиеПРМ","Не задан склад для расчета остатков","Информация"); 
		
		//Возврат; 	
	
	КонецЕсли;
	
	ТЗРаспр.Очистить();
	ТЗНастр.Очистить();
	ТЗОст.Очистить();
	ТЗПРМ.Очистить();
	
	МассивСкладовПРМ = МассивСкладов;
	
	//Склады.ЗагрузитьЗначения(МассивСкладовПРМ); 
	
	ЗаполнитьНачальныеНастройки(ПараметрыРегламента); 
	
	МассивНоменклатуры = Новый Массив; 

	ТЗОсновныеОстаткиПоСкладам = ПолучитьТаблицуОстатковПоСкладамДляРаспределения(МассивСкладов,МассивНоменклатуры);
	
	ТЗРаспр.Очистить();
	ТЗОсновныеОстаткиПоСкладам1 = ТЗОсновныеОстаткиПоСкладам.Скопировать();
	ТЗОсновныеОстаткиПоСкладам1.Свернуть("Номенклатура","Остаток"); 
	
	ТЧДляРаспределения = ТЗРаспр.Выгрузить().Скопировать(); 
	Для каждого СтрокаОстатков  Из ТЗОсновныеОстаткиПоСкладам1 Цикл
	
		НСтрока = ТЧДляРаспределения.Добавить(); 
		ЗаполнитьЗначенияСвойств(НСтрока,СтрокаОстатков); 
	
	КонецЦикла;	
	//для проверки 
	//ТЗРаспр.Загрузить(ТЧДляРаспределения); 
	
	Если ТЧДляРаспределения.Количество() = 0  Тогда 	
		ЗаписатьВЛог("РегламентСозданиеПРМ","Не найдены товары для распределения","Информация");
		//Возврат; 		
	КонецЕсли;
	
	Если ТЧДляРаспределения.Итог("Остаток") = 0 Тогда
		ЗаписатьВЛог("РегламентСозданиеПРМ","Нет остатков товаров для распределения","Информация");
		//Возврат;
	КонецЕсли;
	
	//СписокПолучателей = СформСписокПолучат(Справочники.ТипыРассылок.НайтиПоКоду("000000008"));
	
	МСНО = Новый Массив;

	Соот1 = Новый Соответствие;
	Соот2 = Новый Соответствие;
	
	ТЗНастр1 = ТЗНастр.Выгрузить();
	ТЗНастр2 = ТЗНастр.Выгрузить();
	ТЗНастр3 = ТЗНастр.Выгрузить();
	ТЗНастр4 = ТЗНастр.Выгрузить();
	ТЗНастр5 = ТЗНастр.Выгрузить();
	
	МС1 = ТЗНастр3.ВыгрузитьКолонку("Склад");
	МС2 = ТЗНастр3.ВыгрузитьКолонку("СкладМаркировка");
	МС = Объединить2Массива_ВернутьНовый(МС1, МС2);
	
	
	ТЗНастр2.Свернуть("Направление, НачалоРасчета, ОкончаниеРасчета,УчитыватьОстаткиПланыСпаек,НачалоРасчетаКитай,ОкончаниеРасчетаКитай"); 
	ТЗНастр3.Свернуть("Склад, СкладМаркировка, Направление, РасчетОстатка");
	ТЗНастр4.Свернуть("Склад,СкладМаркировка,УчитыватьОстаткиПланыСпаек");
	ТЗНастр5.Свернуть("Склад,ФормПРМОбратные"); 

	Для Каждого ТСтр Из ТЗНастр3 Цикл
		
		Соот1.Вставить(ТСтр.Склад, ТСтр.Направление);
		Соот2.Вставить(ТСтр.СкладМаркировка, ТСтр.Направление);
		
		Если ТСтр.РасчетОстатка = "Факт+Резерв" Тогда
			МСНО.Добавить(ТСтр.Склад);
			МСНО.Добавить(ТСтр.СкладМаркировка);  		
		КонецЕсли;
		
	КонецЦикла;
	
	МНапр = Новый Массив;
	МДОП = Новый Массив;
	МДПС = Новый Массив;
	
	МДОП.Добавить(Справочники.Подразделения.НайтиПоКоду("SMN-0425")); 
	
	ПодрДИП = Новый Массив;
	ПодрДИП.Добавить(Справочники.Подразделения.НайтиПоКоду("SSP-0326"));
	
	
	МДПС.Добавить(Справочники.Подразделения.НайтиПоКоду("SSP-0062"));
	
	МКДОП = Новый Массив;
	МКДПС = Новый Массив;
	
	МКДОП.Добавить(Справочники.Контрагенты.НайтиПоКоду("SSR-4927"));
	МКДПС.Добавить(Справочники.Контрагенты.НайтиПоКоду("SSR-4937"));
	
	ДУИсклДОП = "";
	ДУИсклДПС = "";
	

	
	Если  МассивНоменклатуры.Количество() > 0 Тогда 
		
		ТЗОст1 = ПолучитьОстаткиПоСкладамПолучателям(МассивНоменклатуры, МС, ТЗНастр4);
		
		
		ТЗРНО = ПолучитьРезервыПоРНК(МассивНоменклатуры, МСНО, ТЗНастр4);  
		
		
				
		ТЗП = ПолучитьПланПродажПоНаправлениям(ДУИсклДОП, ДУИсклДПС, МассивНоменклатуры, МДОП, МДПС, МКДОП, МКДПС, МНапр, ПодрДИП, ТЗНастр2);
		
		ТЗПланПродажПоСпайкам = ПолучитьПланПродажПоСпайкам(МДОП, МДПС, МКДОП, МКДПС,ПодрДИП, МассивНоменклатуры,ТЗНастр2);
		
		ТЗОстПоСпайкам = ПолучитьОстаткиПоСпайкам(МС, Соот1, ТЗНастр4, ТЗПланПродажПоСпайкам);
		
		Для каждого СтрокаПродаж Из ТЗПланПродажПоСпайкам Цикл 
			
			Если СтрокаПродаж.Количество <= 0 Тогда
				
				Продолжить; 	
				
			КонецЕсли;
			
			СтрокиОстатков = ТЗОстПоСпайкам.НайтиСтроки(Новый Структура("Номенклатура, Направление", СтрокаПродаж.Номенклатура, ТСтр.Направление));
			Для каждого СтрокаОстатков Из СтрокиОстатков Цикл
				
				Если СтрокаОстатков.Ост <= 0  Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				СтрокаВычесть = Мин(СтрокаПродаж.Количество,СтрокаОстатков.Ост); 	
				СтрокаПродаж.Количество =   СтрокаПродаж.Количество -  СтрокаВычесть;
				
				СтрокаОстатков.Ост = СтрокаОстатков.Ост - СтрокаВычесть; 
				
			КонецЦикла;
			
		КонецЦикла;
		
		ОстаткиПланКомплПоСпайкам = Новый ТаблицаЗначений; 
		ОстаткиПланКомплПоСпайкам.Колонки.Добавить("Номенклатура");
		ОстаткиПланКомплПоСпайкам.Колонки.Добавить("Направление");
		ОстаткиПланКомплПоСпайкам.Колонки.Добавить("Количество");
		ОстаткиПланКомплПоСпайкам.Колонки.Добавить("ПППоСпайкам"); 
		
		Для каждого  СтрокаПродаж Из ТЗПланПродажПоСпайкам  Цикл
			
			Если СтрокаПродаж.Количество <= 0 Тогда
				
				Продолжить; 	
				
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	НоменклатураКоплектующие.Номенклатура КАК Номенклатура,
			|	НоменклатураКоплектующие.Количество КАК Количество
			|ИЗ
			|	Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
			|ГДЕ
			|	НоменклатураКоплектующие.Ссылка = &Ссылка
			|	И НоменклатураКоплектующие.Количество > 0";
			
			Запрос.УстановитьПараметр("Ссылка", СтрокаПродаж.Номенклатура);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				НСтрока = ОстаткиПланКомплПоСпайкам.Добавить(); 
				НСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
				НСтрока.Направление = СтрокаПродаж.Направление; 
				НСтрока.Количество = СтрокаПродаж.Количество * ВыборкаДетальныеЗаписи.Количество;
				НСтрока.ПППоСпайкам = СтрокаПродаж.Количество; 
			КонецЦикла; 
			
		КонецЦикла;   
		ОстаткиПланКомплПоСпайкам.Свернуть("Номенклатура,Направление","Количество,ПППоСпайкам");
		
		Для Каждого ТСтр Из ТЗОст1 Цикл
			
			ТСтр.Направление = Соот1.Получить(ТСтр.Склад);
			НайдыР = ТЗРНО.НайтиСтроки(Новый Структура("Номенклатура, Склад", ТСтр.Номенклатура, ТСтр.Склад));
			
			Если НайдыР.Количество() Тогда
				
				Для Каждого НайдР Из НайдыР Цикл
					ТСтр.Ост = ТСтр.Ост + НайдР.Количество;
				КонецЦикла;
				
			КонецЕсли;	
			
		КонецЦикла; 	 
		
		ТЗОст1.Свернуть("Номенклатура, Направление", "Ост, ПланПродаж"); 
		
		ОписаниеТиповЧисло = Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(14,3)); 
		ТЗОст1.Колонки.Добавить("ПППоСпайкам",ОписаниеТиповЧисло); 
		ТЗОст1.Колонки.Добавить("ПППоСпайкамКомпл",ОписаниеТиповЧисло);
		
		Для Каждого ТСтр Из ТЗОст1 Цикл
			
			НайдыП = ТЗП.НайтиСтроки(Новый Структура("Номенклатура, Направление", ТСтр.Номенклатура, ТСтр.Направление));
			
			Если НайдыП.Количество() Тогда
				
				Для Каждого НайдП Из НайдыП Цикл
					ТСтр.ПланПродаж = ТСтр.ПланПродаж + НайдП.Количество;
				КонецЦикла;
				
			КонецЕсли;
			СтрокиПоСпайкам = ОстаткиПланКомплПоСпайкам.НайтиСтроки(Новый Структура("Номенклатура, Направление", ТСтр.Номенклатура, ТСтр.Направление));
			Если СтрокиПоСпайкам.Количество() > 0  Тогда
				
				ТСтр.ПППоСпайкам = СтрокиПоСпайкам[0].ПППоСпайкам;
				ТСтр.ПППоСпайкамКомпл = СтрокиПоСпайкам[0].Количество;
				
			КонецЕсли;  	
			
		КонецЦикла;
		
		МФорм = Новый Массив;
		
		нн = 0;
		
		Пока нн < МНапр.Количество() Цикл
			
			МФорм.Добавить(Ложь);
			
			нн = нн + 1;
			
		КонецЦикла;
		//для проверки 
		ТЗОст.Загрузить(ТЗОст1); 
				
		ЗаполнитьТалицуКРаспределениюСоздатьПРМ(МНапр, МФорм, ОстаткиПланКомплПоСпайкам, ТЗНастр1, ТЗОст1, ТЧДляРаспределения,ТЗОсновныеОстаткиПоСкладам); 
		
	КонецЕсли;
	
	//СоздаватьПРМОбратные = Ложь; 
	
	Если СоздаватьПРМОбратные Тогда
		
		ТЗРаспр_1.Очистить();
		ТЗОст_1.Очистить();
				
		МассивНоменклатуры = Новый Массив; 
		МассивСкладовОбПРМ = МС;
		МНапр = Новый Массив; 
		
		ТЗОсновныеОстаткиПоСкладам = ПолучитьТаблицуОстатковПоСкладамДляРаспределения(МассивСкладовОбПРМ,МассивНоменклатуры);
		
		ТЗРаспр_1.Очистить();
		ТЗОсновныеОстаткиПоСкладам1 = ТЗОсновныеОстаткиПоСкладам.Скопировать();
		ТЗОсновныеОстаткиПоСкладам1.Свернуть("Номенклатура","Остаток"); 
		
		ТЧДляРаспределения = ТЗРаспр_1.Выгрузить().Скопировать(); 
		Для каждого СтрокаОстатков  Из ТЗОсновныеОстаткиПоСкладам1 Цикл
			
			НСтрока = ТЧДляРаспределения.Добавить(); 
			ЗаполнитьЗначенияСвойств(НСтрока,СтрокаОстатков); 
			
		КонецЦикла;	
		
	
		ТЗОст1 = ПолучитьОстаткиПоСкладамПолучателямОбратныеПРМ(МассивНоменклатуры, МС, ТЗНастр4);
		
		//ТЗРНО = ПолучитьРезервыПоРНК(МассивНоменклатуры, МСНО, ТЗНастр4);
		
		ТЗП = ПолучитьПланПродажПоНаправлениям(ДУИсклДОП, ДУИсклДПС, МассивНоменклатуры, МДОП, МДПС, МКДОП, МКДПС, МНапр, ПодрДИП, ТЗНастр2);
		
		ТЗПланПродажПоСпайкам = ПолучитьПланПродажПоСпайкам(МДОП, МДПС, МКДОП, МКДПС, ПодрДИП, МассивНоменклатуры, ТЗНастр2);
		
		ТЗОстПоСпайкам = ПолучитьОстаткиПоСпайкам(МС, Соот1, ТЗНастр4, ТЗПланПродажПоСпайкам);
		
		Для каждого СтрокаПродаж Из ТЗПланПродажПоСпайкам Цикл 
			
			Если СтрокаПродаж.Количество <= 0 Тогда
				
				Продолжить; 	
				
			КонецЕсли;
			
			СтрокиОстатков = ТЗОстПоСпайкам.НайтиСтроки(Новый Структура("Номенклатура, Направление", СтрокаПродаж.Номенклатура, ТСтр.Направление));
			Для каждого СтрокаОстатков Из СтрокиОстатков Цикл
				
				Если СтрокаОстатков.Ост <= 0  Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				СтрокаВычесть = Мин(СтрокаПродаж.Количество,СтрокаОстатков.Ост); 	
				СтрокаПродаж.Количество =   СтрокаПродаж.Количество -  СтрокаВычесть;
				
				СтрокаОстатков.Ост = СтрокаОстатков.Ост - СтрокаВычесть; 
				
			КонецЦикла;
			
		КонецЦикла;
		
		ОстаткиПланКомплПоСпайкам = Новый ТаблицаЗначений; 
		ОстаткиПланКомплПоСпайкам.Колонки.Добавить("Номенклатура");
		ОстаткиПланКомплПоСпайкам.Колонки.Добавить("Направление");
		ОстаткиПланКомплПоСпайкам.Колонки.Добавить("Количество");
		ОстаткиПланКомплПоСпайкам.Колонки.Добавить("ПППоСпайкам"); 
		
		Для каждого  СтрокаПродаж Из ТЗПланПродажПоСпайкам  Цикл
			
			Если СтрокаПродаж.Количество <= 0 Тогда
				
				Продолжить; 	
				
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	НоменклатураКоплектующие.Номенклатура КАК Номенклатура,
			|	НоменклатураКоплектующие.Количество КАК Количество
			|ИЗ
			|	Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
			|ГДЕ
			|	НоменклатураКоплектующие.Ссылка = &Ссылка
			|	И НоменклатураКоплектующие.Количество > 0";
			
			Запрос.УстановитьПараметр("Ссылка", СтрокаПродаж.Номенклатура);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				НСтрока = ОстаткиПланКомплПоСпайкам.Добавить(); 
				НСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
				НСтрока.Направление = СтрокаПродаж.Направление; 
				НСтрока.Количество = СтрокаПродаж.Количество * ВыборкаДетальныеЗаписи.Количество;
				НСтрока.ПППоСпайкам = СтрокаПродаж.Количество; 
			КонецЦикла; 
			
		КонецЦикла;   
		ОстаткиПланКомплПоСпайкам.Свернуть("Номенклатура,Направление","Количество,ПППоСпайкам");
		
		Для Каждого ТСтр Из ТЗОст1 Цикл
			
			ТСтр.Направление = Соот1.Получить(ТСтр.Склад);  
			Если Не ЗначениеЗаполнено(ТСтр.Направление) Тогда
				
				ТСтр.Направление = Соот2.Получить(ТСтр.Склад);	
				
			КонецЕсли;
			
			//НайдыР = ТЗРНО.НайтиСтроки(Новый Структура("Номенклатура, Склад", ТСтр.Номенклатура, ТСтр.Склад));
			//
			//Если НайдыР.Количество() Тогда
			//	
			//	Для Каждого НайдР Из НайдыР Цикл
			//		ТСтр.Ост = ТСтр.Ост + НайдР.Количество;
			//	КонецЦикла;
			//	
			//КонецЕсли;	
			
		КонецЦикла;	
		
		ТЗОстПоСкладам = ТЗОст1.Скопировать();
		
		ТЗОст1.Свернуть("Номенклатура, Направление", "Ост, ПланПродаж"); 
		
		ОписаниеТиповЧисло = Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(14,3)); 
		ТЗОст1.Колонки.Добавить("ПППоСпайкам",ОписаниеТиповЧисло); 
		ТЗОст1.Колонки.Добавить("ПППоСпайкамКомпл",ОписаниеТиповЧисло);
		
		ОстаткиПланКомплПоСпайкам.Свернуть("Номенклатура","Количество,ПППоСпайкам");	
		
		Для Каждого ТСтр Из ТЗОст1 Цикл
			
			НайдыП = ТЗП.НайтиСтроки(Новый Структура("Номенклатура, Направление", ТСтр.Номенклатура, ТСтр.Направление));
			
			Если НайдыП.Количество() Тогда
				
				Для Каждого НайдП Из НайдыП Цикл
					ТСтр.ПланПродаж = ТСтр.ПланПродаж + НайдП.Количество;
				КонецЦикла;
				
			КонецЕсли; 
			
			Если ТСтр.Направление = "ДИП" Тогда   			
				СтрокиПоСпайкам = ОстаткиПланКомплПоСпайкам.НайтиСтроки(Новый Структура("Номенклатура", ТСтр.Номенклатура));	
				Если СтрокиПоСпайкам.Количество() > 0  Тогда 
					Для Каждого СтрокаПоСпайкам Из СтрокиПоСпайкам Цикл
						ТСтр.ПланПродаж = ТСтр.ПланПродаж + СтрокаПоСпайкам.Количество;
					КонецЦикла;
					
					ТСтр.ПППоСпайкам = СтрокиПоСпайкам[0].ПППоСпайкам;
					ТСтр.ПППоСпайкамКомпл = СтрокиПоСпайкам[0].Количество;	
				КонецЕсли;
			КонецЕсли; 					
			
		КонецЦикла; 	
		  	
		МФорм = Новый Массив;
		
		нн = 0;
		
		Пока нн < МНапр.Количество() Цикл
			
			МФорм.Добавить(Ложь);
			
			нн = нн + 1;
			
		КонецЦикла;	
		
		ТЗОст_1.Загрузить(ТЗОст1); 
		
		Для Каждого ТекСтр Из ТЧДляРаспределения Цикл 
			
			Если ТекСтр.Номенклатура.ВидКомплекта = Перечисления.ВидыКомплектов.Комплект Тогда
				
				Продолжить; 	
				
			КонецЕсли;
			
			
			нн = 0;
			
			Пока  нн < МНапр.Количество() Цикл 
				
				ТекН = МНапр[нн];
				НайдыОст1 = ТЗОст1.НайтиСтроки(Новый Структура("Номенклатура, Направление", ТекСтр.Номенклатура, ТекН));
				Если нн = 0 Тогда
					
					Если НайдыОст1.Количество() > 0  Тогда
						
						Ост = НайдыОст1[0].Ост; 
						ПланПродаж = НайдыОст1[0].ПланПродаж;
						
						Если ПланПродаж > 0 
							И Ост > ПланПродаж Тогда
							
							ТекСтр.Количество1 = Ост - ПланПродаж; 
							
							МФорм[нн] = Истина;
							
						КонецЕсли;
						
					КонецЕсли;
				ИначеЕсли нн = 1 Тогда
					
					Если НайдыОст1.Количество() > 0  Тогда
						
						Ост = НайдыОст1[0].Ост; 
						ПланПродаж = НайдыОст1[0].ПланПродаж;
						
						Если ПланПродаж > 0
							И Ост > ПланПродаж Тогда
							
							ТекСтр.Количество2 = Ост - ПланПродаж; 
							МФорм[нн] = Истина;
							
						КонецЕсли;
						
					КонецЕсли;
				ИначеЕсли нн = 2 Тогда
					
					Если НайдыОст1.Количество() > 0  Тогда
						
						Ост = НайдыОст1[0].Ост; 
						ПланПродаж = НайдыОст1[0].ПланПродаж;
						
						Если ПланПродаж > 0
							И Ост > ПланПродаж Тогда
							
							ТекСтр.Количество3 = Ост - ПланПродаж; 	
							
							МФорм[нн] = Истина;
						КонецЕсли;
						
					КонецЕсли;  
					
				ИначеЕсли нн = 3 Тогда
					
					Если НайдыОст1.Количество() > 0  Тогда
						
						Ост = НайдыОст1[0].Ост; 
						ПланПродаж = НайдыОст1[0].ПланПродаж;
						
						Если ПланПродаж > 0
							И Ост > ПланПродаж Тогда
							
							ТекСтр.Количество4 = Ост - ПланПродаж; 	
							МФорм[нн] = Истина;
						КонецЕсли;
						
					КонецЕсли;  
					
				ИначеЕсли нн = 4 Тогда
					
					Если НайдыОст1.Количество() > 0  Тогда
						
						Ост = НайдыОст1[0].Ост; 
						ПланПродаж = НайдыОст1[0].ПланПродаж;
						
						Если ПланПродаж > 0
							И Ост > ПланПродаж Тогда
							
							ТекСтр.Количество5 = Ост - ПланПродаж; 	
							МФорм[нн] = Истина;
						КонецЕсли;
						
					КонецЕсли;
				КонецЕсли;
				нн = нн + 1;
			КонецЦикла;  
			
			
		КонецЦикла;
		
		ТЗРаспр_1.Загрузить(ТЧДляРаспределения); 
		
		тт = 0; 	
		Пока тт < МНапр.Количество() Цикл
			
			ТекН = МНапр[тт];
			СклПол = Неопределено; 
			
			Если МФорм[тт] Тогда 
				
				//прм создаем на склад получатель со склада или маркировки или обычного склада 
				
				Найды3 = ТЗНастр1.НайтиСтроки(Новый Структура("Направление", ТекН)); 
				
				СоответствиеСкладыПРМ = Новый Соответствие; 
				МассивПРМДляЗаписи = Новый Массив; 
				Для Каждого Найд3 Из Найды3 Цикл
					Если НЕ Найд3.ФормПРМОбратные Тогда
						Продолжить;
					КонецЕсли; 
					
					ДокПРМ = СоздатьПРМ(Найд3.Склад,СкладОбрПРМ);
					СоответствиеСкладыПРМ.Вставить(Найд3.Склад,ДокПРМ);
					МассивПРМДляЗаписи.Добавить(ДокПРМ); 
					
					ДокПРМ = СоздатьПРМ(Найд3.СкладМаркировка,СкладОбрПРММаркировка);
					СоответствиеСкладыПРМ.Вставить(Найд3.СкладМаркировка,ДокПРМ);
					МассивПРМДляЗаписи.Добавить(ДокПРМ);
				КонецЦикла;
				
				
				Для Каждого ТекСтр Из ТЧДляРаспределения Цикл
					
					КолКол = "Количество" + Строка(тт + 1);
					КолПрм = ТекСтр[КолКол];
					Если КолПрм > 0  Тогда
						
						ОтборПоОстаткам = Новый Структура("Номенклатура,Направление",ТекСтр.Номенклатура,ТекН); 	
						СтрокиОстаткиПоСкладам = ТЗОстПоСкладам.НайтиСтроки(ОтборПоОстаткам); 
						Для каждого СтрокаОстатковПоСкладам Из СтрокиОстаткиПоСкладам Цикл
							Если СтрокаОстатковПоСкладам.Ост = 0
								ИЛИ КолПрм = 0 Тогда
								
								Продолжить;	
								
							КонецЕсли;   
							
							Переместить = Мин(СтрокаОстатковПоСкладам.Ост,КолПрм);
							
							СтрокаОстатковПоСкладам.Ост = СтрокаОстатковПоСкладам.Ост - Переместить; 
							КолПРМ = КолПрм - Переместить;
							
							ДокПРМ =  СоответствиеСкладыПРМ.Получить(СтрокаОстатковПоСкладам.Склад);
							
							Если ДокПРМ = неопределено Тогда
							
								Продолжить; 	
							
							КонецЕсли;
							
							Если ДокПРМ.Товары.Количество() >= 10000 Тогда
							
								ДокПРМ = СоздатьПРМ(ДокПРМ.Склад, ДокПРМ.СкладПолучатель); 	
							    СоответствиеСкладыПРМ.Вставить(СтрокаОстатковПоСкладам.Склад,ДокПРМ);
								МассивПРМДляЗаписи.Добавить(ДокПРМ);
							КонецЕсли;
							
							СтрТЧ = ДокПРМ.Товары.Добавить();
							
							СтрТЧ.Номенклатура = ТекСтр.Номенклатура;
							СтрТЧ.Заявка = Переместить;
							СтрТЧ.ПодтвержденнаяЗаявка = Переместить;			
							СтрТЧ.ПодтвержденнаяЗаявкаПеремещения = Переместить;
							СтрТЧ.Количество = Переместить;				
							
							ПриИзмененииНоменклатурыТабЧасти(СтрТЧ, ДокПРМ);
							РассчитатьСуммуТабЧасти(СтрТЧ, ДокПРМ);  							
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
				
				//Для каждого ЭлСоответствия Из СоответствиеСкладыПРМ Цикл
				Для каждого ЭлементМассива Из МассивПРМДляЗаписи Цикл
					ДокПРМ = ЭлементМассива; //.Значение; 
					
					Если ДокПРМ.Товары.Количество() > 0  Тогда
					
						ДокПРМ.Записать(РежимЗаписиДокумента.Проведение);
						
						ЗаписатьВЛог("РегламентСозданиеПРМ","Записан ПРМ (обратное) " + Строка(ДокПРМ.ссылка),"Информация");
					
					КонецЕсли;
				
				КонецЦикла;
			КонецЕсли;	
							
			тт = тт + 1;
			
		КонецЦикла;	
		

		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьТалицуКРаспределениюСоздатьПРМ(Знач МНапр, 
	Знач МФорм, 
	Знач ОстаткиПланКомплПоСпайкам,
	Знач ТЗНастр1,
	Знач ТЗОст1, 
	Знач ТЧДляРаспределения,
	Знач ТЗОсновныеОстаткиПоСкладам) 
	
	ОстаткиПланКомплПоСпайкам.Свернуть("Номенклатура","Количество");
	
	ТЗОст1.Колонки.Добавить("ОстРасч"); 
	
	Для Каждого ТекСтр Из ТЧДляРаспределения Цикл
		
		Ост = ТекСтр.Остаток;
		
		ОстРасчетный =  ТекСтр.Остаток; 
		
		План = 0;
		КоэфПлан = 0;
		ТНом = ТекСтр.Номенклатура;
		Ост1 = 0;
		
		НайдыОст = ТЗОст1.НайтиСтроки(Новый Структура("Номенклатура", ТНом));
		
		Для Каждого НайдОст Из НайдыОст Цикл
			
			Ост1 = Ост1 + НайдОст.Ост;
			План = План + НайдОст.ПланПродаж;
			
			
			НайдОст.ОстРасч = НайдОст.Ост; 
			
			
		КонецЦикла;
		
		НайдыП = ОстаткиПланКомплПоСпайкам.НайтиСтроки(Новый Структура("Номенклатура", ТекСтр.Номенклатура));
		ПланНоменклатурыДляСпаек = 0; 
		Если НайдыП.Количество() Тогда   		
			Для Каждого НайдП Из НайдыП Цикл
				ПланНоменклатурыДляСпаек = ПланНоменклатурыДляСпаек + НайдП.Количество;
			КонецЦикла; 		
		КонецЕсли;  
		
		
		КРаспределениюН = 0;  
		ОбщийОстаток = Ост + Ост1;
		Ост1Был = Ост1; 
		Если ПланНоменклатурыДляСпаек > 0 Тогда 
			
			Если Ост1 >= ПланНоменклатурыДляСпаек  Тогда
				
				Ост1 = Ост1 - ПланНоменклатурыДляСпаек; 	
				КРаспределениюН = 0;
				
			ИначеЕсли Ост1 > 0 И Ост1 < ПланНоменклатурыДляСпаек Тогда 				
				
				Если Ост > (ПланНоменклатурыДляСпаек - ост1) Тогда
					Ост = Ост - (ПланНоменклатурыДляСпаек - ост1); 
					КРаспределениюН =  ПланНоменклатурыДляСпаек - ост1; 
				ИначеЕсли Ост <= (ПланНоменклатурыДляСпаек - ост1) Тогда 
					КРаспределениюН =  Ост; //ПланНоменклатурыДляСпаек - ост1 - Ост; 
					Ост = 0; 
				КонецЕсли;
				
				Ост1 = 0;
				
			КонецЕсли; 
			
			РазницаОст = Ост1Был - Ост1;
			
			
			Если Ост1Был > 0 Тогда 
				Для Каждого НайдОст Из НайдыОст Цикл
					Если РазницаОст = 0 Тогда
						
						Прервать; 	
						
					КонецЕсли; 
					
					Если  НайдОст.ОстРасч < 0  Тогда
					
						Продолжить; 	
					
					КонецЕсли;
					
					МинОст = Мин(НайдОст.ОстРасч,РазницаОст); 
					НайдОст.ОстРасч = НайдОст.ОстРасч - МинОст; 
					
					РазницаОст = РазницаОст - МинОст; 
					
				КонецЦикла; 
			КонецЕсли;
		Конецесли;  
		
		
		Рассчит = Истина;
		
		Если ТНом.ВидКомплекта = Перечисления.ВидыКомплектов.Комплект Тогда
			
			КоэфПлан = 1;			
			ТекСтр.КРаспред = Ост; 		
			КРаспределениюН = Ост;			
			Рассчит = Ложь;
			
		Иначе 	
			Если План = 0 Тогда
				Рассчит = Ложь;
			КонецЕсли;
			
			Если Рассчит Тогда
				
				КоэфПлан = (Ост + Ост1) / План; 
				
			КонецЕсли;	
			
			Если (Ост > (План - Ост1)) И ((План - Ост1) > 0) Тогда
				
				КоэфПлан = 1;
				
				ТекСтр.КРаспред = План - Ост1;
				
			Иначе
				
				Если ((План - Ост1) <= 0) Тогда
					
					//остатка хватает 
					Рассчит = Ложь;
					КоэфПлан = 0;
					ТекСтр.КРаспред = 0;
					
				Иначе
					
					ТекСтр.КРаспред = Ост;
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		///////////////
		
			
		ОстР = 0;
		
		нн = 0;
		
		Пока  нн < МНапр.Количество() Цикл
			
			ТекН = МНапр[нн]; 
			
			НайдНаправление = ТЗНастр1.НайтиСтроки(Новый Структура("Направление", ТекН));
			РаспределениеСпаек = НайдНаправление[0].РаспределениеСпаек; 
			
			НайдыОст1 = ТЗОст1.НайтиСтроки(Новый Структура("Номенклатура, Направление", ТНом, ТекН));
			
			ЕстьКол = Ложь;
			
			Если нн = 0 Тогда
				
				ТекСтр.Направление1 = ТекН;
				ТекО = 0;
				ТекП = 0;
				
				
				Если РаспределениеСпаек Тогда
					
					ТекСтр.КРаспред1 = КРаспределениюН;
					ОстР = ОстР + КРаспределениюН; 
					КРаспределениюН = 0; 				 
					
				КонецЕсли;
				
				
				Если НайдыОст1.Количество() Тогда	
					
					НайдОст1 = НайдыОст1[0];
					
					ТекО = НайдОст1.ОстРасч;
					
					ТекП = НайдОст1.ПланПродаж;
					
					Если Рассчит Тогда
						
						КолР = Окр((КоэфПлан * НайдОст1.ПланПродаж) - НайдОст1.ОстРасч); //НайдОст1.Ост);
						
						Если (ТекСтр.КРаспред > КолР) И Рассчит Тогда
							ТекСтр.Количество1 = ?(КолР > 0, КолР, 0);
						Иначе
							ТекСтр.Количество1 = ТекСтр.КРаспред;
						КонецЕсли;
						
					КонецЕсли;
					
				Иначе
					
					ТекСтр.Количество1 = 0;
					
				КонецЕсли; 		
				
				ОстР = ОстР + ТекСтр.Количество1;
				
				Если ТекСтр.Количество1 Тогда
					МФорм[нн] = Истина;
				КонецЕсли;
				
				
				Если ТекСтр.КРаспред1 <> 0 Тогда
					МФорм[нн] = Истина;
				КонецЕсли;
				
				
			ИначеЕсли нн = 1 Тогда
				
				ТекСтр.Направление2 = ТекН;
				ТекО = 0;
				ТекП = 0;
				
				
				Если РаспределениеСпаек Тогда
					
					ТекСтр.КРаспред2 = КРаспределениюН;
					ОстР = ОстР + КРаспределениюН;
					КРаспределениюН = 0; 
					
				КонецЕсли;
				
				
				Если НайдыОст1.Количество() Тогда
					
					НайдОст1 = НайдыОст1[0];
					
					
					ТекО = НайдОст1.ОстРасч;
					
					ТекП = НайдОст1.ПланПродаж;
					
					Если Рассчит Тогда
						
						КолР = Окр((КоэфПлан * НайдОст1.ПланПродаж) - НайдОст1.ОстРасч); //НайдОст1.Ост);
						
						Если (ТекСтр.КРаспред > КолР) И Рассчит Тогда
							ТекСтр.Количество2 = ?(КолР > 0, КолР, 0);
						Иначе
							ТекСтр.Количество2 = ТекСтр.КРаспред;
						КонецЕсли;
						
					КонецЕсли;
				Иначе
					
					ТекСтр.Количество2 = 0;
					
				КонецЕсли;
				
				Если ТекСтр.Количество2 > (ОстРасчетный - ОстР) Тогда
					ТекСтр.Количество2 = (ОстРасчетный - ОстР)
				КонецЕсли;
				
				ОстР = ОстР + ТекСтр.Количество2;
				
				
				Если ТекСтр.Количество2 Тогда
					МФорм[нн] = Истина;
				КонецЕсли;
				
				Если ТекСтр.КРаспред2 <> 0 Тогда
					МФорм[нн] = Истина;
				КонецЕсли;
				
				
			ИначеЕсли нн = 2 Тогда
				
				ТекСтр.Направление3 = ТекН;
				ТекО = 0;
				ТекП = 0;
				
				Если РаспределениеСпаек Тогда
					
					ТекСтр.КРаспред3 = КРаспределениюН;
					ОстР = ОстР + КРаспределениюН;
					КРаспределениюН = 0;
					
				КонецЕсли;
				
				
				Если НайдыОст1.Количество() Тогда
					
					НайдОст1 = НайдыОст1[0];
					
					ТекО = НайдОст1.ОстРасч; 
					
					ТекП = НайдОст1.ПланПродаж;
					
					Если Рассчит Тогда
						
						КолР = Окр((КоэфПлан * НайдОст1.ПланПродаж) - НайдОст1.ОстРасч); //НайдОст1.Ост);
						
						Если (ТекСтр.КРаспред > КолР) И Рассчит Тогда
							ТекСтр.Количество3 = ?(КолР > 0, КолР, 0);
						Иначе
							ТекСтр.Количество3 = ТекСтр.КРаспред;
						КонецЕсли;
						
					КонецЕсли;
					
				Иначе
					
					ТекСтр.Количество3 = 0;
					
				КонецЕсли;
				
				Если ТекСтр.Количество3 > (ОстРасчетный - ОстР) Тогда
					ТекСтр.Количество3 = (ОстРасчетный - ОстР)
				КонецЕсли;
				
				ОстР = ОстР + ТекСтр.Количество3;
				Если ТекСтр.Количество3 Тогда
					МФорм[нн] = Истина;
				КонецЕсли;
				
				
				Если ТекСтр.КРаспред3 <> 0 Тогда
					МФорм[нн] = Истина;
				КонецЕсли;
				
				
			ИначеЕсли нн = 3 Тогда
				
				ТекСтр.Направление4 = ТекН;
				ТекО = 0;
				ТекП = 0;
				
				Если РаспределениеСпаек Тогда
					
					ТекСтр.КРаспред4 = КРаспределениюН; 
					ОстР = ОстР + КРаспределениюН;
					КРаспределениюН = 0;
					
				КонецЕсли;
				
				
				Если НайдыОст1.Количество() Тогда
					
					НайдОст1 = НайдыОст1[0];
					
					ТекО = НайдОст1.ОстРасч; 
					
					ТекП = НайдОст1.ПланПродаж;
					
					Если Рассчит Тогда
						
						КолР = Окр((КоэфПлан * НайдОст1.ПланПродаж) - НайдОст1.ОстРасч); //НайдОст1.Ост);
						
						Если (ТекСтр.КРаспред > КолР) И Рассчит Тогда
							ТекСтр.Количество4 = ?(КолР > 0, КолР, 0);
						Иначе
							ТекСтр.Количество4 = ТекСтр.КРаспред;
						КонецЕсли;
						
					КонецЕсли;
					
				Иначе
					
					ТекСтр.Количество4 = 0;
					
				КонецЕсли;
				
				Если ТекСтр.Количество4 > (ОстРасчетный- ОстР) Тогда
					ТекСтр.Количество4 = (ОстРасчетный - ОстР)
				КонецЕсли;
				
				ОстР=ОстР+ТекСтр.Количество4;
			
				Если ТекСтр.Количество4 Тогда
					МФорм[нн] = Истина;
				КонецЕсли;
				
				
				Если ТекСтр.КРаспред4 <> 0 Тогда
					МФорм[нн] = Истина;
				КонецЕсли;
				
				
			Иначе
				
				ТекСтр.Направление5 = ТекН; 			
				ТекО = 0;
				ТекП = 0; 
				
				
				Если РаспределениеСпаек Тогда
					
					ТекСтр.КРаспред5 = КРаспределениюН;
					ОстР = ОстР + КРаспределениюН;
					КРаспределениюН = 0;
					
				КонецЕсли;
				
				
				
				Если НайдыОст1.Количество() Тогда
					
					НайдОст1 = НайдыОст1[0];
					
					ТекО = НайдОст1.ОстРасч; 
					
					ТекП = НайдОст1.ПланПродаж;
					
					Если Рассчит Тогда
						
						КолР = Окр((КоэфПлан * НайдОст1.ПланПродаж) - НайдОст1.ОстРасч); //НайдОст1.Ост);
						
						Если (ТекСтр.КРаспред > КолР) И Рассчит Тогда
							ТекСтр.Количество5 = ?(КолР > 0, КолР, 0);
						Иначе
							ТекСтр.Количество5 = ТекСтр.КРаспред;
						КонецЕсли;
						
					КонецЕсли;
					
				Иначе
					
					ТекСтр.Количество5 = 0;
					
				КонецЕсли;
				
				Если ТекСтр.Количество5 > (ОстРасчетный - ОстР) Тогда
					ТекСтр.Количество5 = (ОстРасчетный - ОстР)
				КонецЕсли;
				
				ОстР = ОстР + ТекСтр.Количество5; 		
								
				Если ТекСтр.Количество5 Тогда
					МФорм[нн] = Истина;
				КонецЕсли;
				
				
				Если ТекСтр.КРаспред5 <> 0 Тогда
					МФорм[нн] = Истина;
				КонецЕсли;
				
				
			КонецЕсли;
			
			нн = нн + 1;
			
		КонецЦикла;    	
		
				
	КонецЦикла;	 
	
	//для проверки 
	ТЗРаспр.Загрузить(ТЧДляРаспределения); 
	
		
	НетПРМ = Истина;
	
		
	ЭтоСкладМаркировка = Ложь; 
	
	Если СоздаватьПРМ  Тогда
		
		тт = 0; 
		
		
		ПеремещатьСпайки = Ложь;
		СкладМаркировки = Неопределено; 
		
		Пока тт < МНапр.Количество() Цикл
			
			ТекН = МНапр[тт];
			СклПол = Неопределено;
			
			Если МФорм[тт] Тогда
				
				Найды3 = ТЗНастр1.НайтиСтроки(Новый Структура("Направление", ТекН));
				
				Для Каждого Найд3 Из Найды3 Цикл
					
					Если Найд3.ФормироватьПРМ Тогда
						
						СклПол = Найд3.Склад;
						СкладМаркировки =  Найд3.СкладМаркировка;					
						//Прервать;
						
					КонецЕсли; 
					 
					Если Найд3.РаспределениеСпаек Тогда
						
						ПеремещатьСпайки = Истина; 
						СкладМаркировки =  Найд3.СкладМаркировка; 
						
					КонецЕсли;   				
					
				КонецЦикла;
				
			КонецЕсли; 		
			
			МассивПРМДляЗаписи = Новый Массив; 
			Если ЗначениеЗаполнено(СклПол) Тогда
				
				СоответствиеСклады = Новый Соответствие; 
				Для каждого СкладОтправитель Из МассивСкладовПРМ Цикл
					
					Если СкладОтправитель.ЭтоСкладМаркированногоТовара  Тогда
						
						Подсортировка = СоздатьПРМ(СкладОтправитель, СкладМаркировки);
					Иначе
						Подсортировка = СоздатьПРМ(СкладОтправитель, СклПол);
					КонецЕсли;
						
				    СоответствиеСклады.Вставить(СкладОтправитель,Подсортировка);
					
					МассивПРМДляЗаписи.Добавить(Подсортировка); 
					
				КонецЦикла; 			

				
				Для Каждого ТекСтр Из ТЧДляРаспределения Цикл
					
					КолКол = "Количество" + Строка(тт + 1);
					КолПрм = ТекСтр[КолКол];
					
					Если КолПрм > 0 Тогда
						
						ОтборПоСкладам = Новый Структура("Номенклатура",ТекСтр.Номенклатура); 
						
						СтрокиОстатков = ТЗОсновныеОстаткиПоСкладам.НайтиСтроки(ОтборПоСкладам);
						Для каждого СтрокаОстатков Из СтрокиОстатков Цикл
							
							Если СтрокаОстатков.Остаток = 0 
								ИЛИ КолПрм = 0 Тогда
							
								Продолжить;	
							
							КонецЕсли;
							
							КолОстаток = СтрокаОстатков.Остаток;
							
							Переместить = Мин(КолОстаток,КолПРМ); 
							
							СтрокаОстатков.Остаток = СтрокаОстатков.Остаток - Переместить; 
							
							КолПРМ = КолПРМ - Переместить; 
							
							ДокПРМ =  СоответствиеСклады.Получить(СтрокаОстатков.Склад); 
							
							Если ДокПРМ.Товары.Количество() >= 10000 Тогда
								
								ДокПРМ = СоздатьПРМ(ДокПРМ.Склад,ДокПРМ.СкладПолучатель); 	
								СоответствиеСклады.Вставить(СтрокаОстатков.Склад,ДокПРМ); 
								МассивПРМДляЗаписи.Добавить(ДокПРМ); 
							КонецЕсли;
							
							СтрТЧ = ДокПРМ.Товары.Добавить();
							
							СтрТЧ.Номенклатура = ТекСтр.Номенклатура;
							СтрТЧ.Заявка = Переместить;
							СтрТЧ.ПодтвержденнаяЗаявка = Переместить;			
							СтрТЧ.ПодтвержденнаяЗаявкаПеремещения = Переместить;
							СтрТЧ.Количество = Переместить;				
							
							ПриИзмененииНоменклатурыТабЧасти(СтрТЧ, ДокПРМ);
							РассчитатьСуммуТабЧасти(СтрТЧ, ДокПРМ);
							
						КонецЦикла;  				
						
					КонецЕсли;
					
				КонецЦикла;	
				
				//Для каждого ЭлементСоответствия  Из СоответствиеСклады Цикл
				Для каждого ЭлМассива  Из МассивПРМДляЗаписи Цикл
					ДокПРМ = ЭлМассива; //.Значение; 
					Если ДокПРМ.Товары.Количество() > 0  Тогда
					
						ДокПРМ.Записать(РежимЗаписиДокумента.Проведение);	
					
					КонецЕсли;
				
				КонецЦикла; 							
				
				Если ПеремещатьСпайки
					И НЕ ЭтоСкладМаркировка 
					И ЗначениеЗаполнено(СкладМаркировки) Тогда
					
					МассивПРМДляЗаписи = Новый Массив;
					СоответствиеСклады = Новый Соответствие;
					 
					Для каждого СкладОтправитель Из МассивСкладовПРМ Цикл
						
						Подсортировка = СоздатьПРМ(СкладОтправитель, СкладМаркировки);
						СоответствиеСклады.Вставить(СкладОтправитель,Подсортировка); 
						МассивПРМДляЗаписи.Добавить(Подсортировка); 
					КонецЦикла; 	
										
					Для Каждого ТекСтр Из ТЧДляРаспределения Цикл
						КолКРаспр = "КРаспред" + Строка(тт + 1);
						КолПрм = ТекСтр[КолКРаспр]; 	
						
						Если КолПрм > 0 Тогда
							
							ОтборПоСкладам = Новый Структура("Номенклатура",ТекСтр.Номенклатура); 
							
							СтрокиОстатков = ТЗОсновныеОстаткиПоСкладам.НайтиСтроки(ОтборПоСкладам);
							Для каждого СтрокаОстатков Из СтрокиОстатков Цикл
								
								Если СтрокаОстатков.Остаток = 0 
									ИЛИ КолПрм = 0 Тогда
									
									Продолжить;	
									
								КонецЕсли;
								
								КолОстаток = СтрокаОстатков.Остаток;
								
								Переместить = Мин(КолОстаток,КолПРМ); 
								
								СтрокаОстатков.Остаток = СтрокаОстатков.Остаток - Переместить; 
								
								КолПРМ = КолПРМ - Переместить; 
								
								ДокПРМ =  СоответствиеСклады.Получить(СтрокаОстатков.Склад); 
								
								Если ДокПРМ.Товары.Количество() >= 10000 Тогда
								
									ДокПРМ = СоздатьПРМ(ДокПРМ.Склад,ДокПРМ.СкладПолучатель); 	
								    СоответствиеСклады.Вставить(СтрокаОстатков.Склад,ДокПРМ); 
									МассивПРМДляЗаписи.Добавить(ДокПРМ); 
								КонецЕсли;
								
								СтрТЧ = ДокПРМ.Товары.Добавить();
								
								СтрТЧ.Номенклатура = ТекСтр.Номенклатура;
								СтрТЧ.Заявка = Переместить;
								СтрТЧ.ПодтвержденнаяЗаявка = Переместить;			
								СтрТЧ.ПодтвержденнаяЗаявкаПеремещения = Переместить;
								СтрТЧ.Количество = Переместить;				
								
								ПриИзмененииНоменклатурыТабЧасти(СтрТЧ, ДокПРМ);
								РассчитатьСуммуТабЧасти(СтрТЧ, ДокПРМ);
								
							КонецЦикла; 
							
						КонецЕсли;
						
					КонецЦикла;
					
					Для каждого ЭлМассива  Из МассивПРМДляЗаписи Цикл //СоответствиеСклады Цикл
						
						ДокПРМ = ЭлМассива; //.Значение; 
						Если ДокПРМ.Товары.Количество() > 0  Тогда
							
							ДокПРМ.Записать(РежимЗаписиДокумента.Проведение);
							
							ЗаписатьВЛог("РегламентСозданиеПРМ","Записан ПРМ " + Строка(ДокПРМ.ссылка),"Информация");
							
						КонецЕсли;
						
					КонецЦикла; 				
					
					
				КонецЕсли;
				
				
			КонецЕсли;	
			
			тт = тт + 1;
			
		КонецЦикла;	
			
	КонецЕсли;

КонецПроцедуры

Функция СоздатьПРМ(Знач СкладОтправитель, Знач СклПол)
	
	Перем Подсортировка;
	
	Подсортировка = Документы.Перемещение.СоздатьДокумент();
	Подсортировка.Склад = СкладОтправитель;
	Подсортировка.СкладПолучатель = СклПол;
	Подсортировка.ИБ = Справочники.ИБ.НайтиПоКоду("SSP");
	Подсортировка.Менеджер = ПараметрыСеанса.Пользователь.ФизЛицо;
	Подсортировка.Автор = ПараметрыСеанса.Пользователь;
	Подсортировка.Организация = Справочники.Организации.НайтиПоКоду("SS-001");
	
	УстановитьПунктДоставки1(Подсортировка, "СкладПолучатель", "ПунктДоставки");
	
	Подсортировка.Комментарий = "Создано обработкой распределение остатков по виртуальным складам";
	Подсортировка.СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена;
	Подсортировка.СостояниеНакладнойУПолучателя = Перечисления.СостоянияНакладной.Принята;
	Подсортировка.Отгружен = Перечисления.Отгружен.Отгружен;
	Подсортировка.Дата = ТекущаяДата();
	Подсортировка.ДатаПриемки = ТекущаяДата();
	Подсортировка.Валюта = Справочники.Валюты.НайтиПоКоду("810");
	Подсортировка.Курс = 1;
	
	
	УстановитьНомерДокументаКлиентСервер(Подсортировка);
	Возврат Подсортировка;

КонецФункции 

Процедура УстановитьПунктДоставки1(ДокументОбъект, ИмяРеквизитаКонтрагент = "Контрагент", ИмяРеквизитаПД = "ПунктДоставки") Экспорт	
	
	Контрагент = ДокументОбъект[ИмяРеквизитаКонтрагент];
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Если ЕстьРеквизитДокумента("ОсновнойПунктДоставки",Контрагент.Метаданные()) И ЗначениеЗаполнено(Контрагент.ОсновнойПунктДоставки) Тогда
			ДокументОбъект[ИмяРеквизитаПД]=Контрагент.ОсновнойПунктДоставки;	
		ИначеЕсли КоличествоПД1(Контрагент)=1 Тогда		
			Выборка=Справочники.ПунктыДоставки.Выбрать(,Контрагент);
			Пока Выборка.Следующий() Цикл
				ДокументОбъект[ИмяРеквизитаПД]=Выборка.Ссылка;			
			КонецЦикла;
			//крохин начало
			//для складов, если несколько ПД, выбираем первый
		ИначеЕсли ИмяРеквизитаКонтрагент = "СкладПолучатель" Тогда
			//крохин начало 28.07.2011
			//выбираем первый по наименованию
			//Выборка=Справочники.ПунктыДоставки.Выбрать(,Контрагент);
			Выборка=Справочники.ПунктыДоставки.Выбрать(,Контрагент,,"Наименование Убыв");
			//крохин конец 28.07.2011
			Пока Выборка.Следующий() Цикл
				ДокументОбъект[ИмяРеквизитаПД]=Выборка.Ссылка;			
			КонецЦикла;
			//крохин конец
		Иначе
			ДокументОбъект[ИмяРеквизитаПД]=Неопределено;		
		КонецЕсли;		
	Иначе
		ДокументОбъект[ИмяРеквизитаПД]=Неопределено;		
	КонецЕсли;
	
КонецПроцедуры

Функция КоличествоПД1(Контрагент)
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПунктыДоставки.Ссылка) КАК Количество
		               |ИЗ
		               |	Справочник.ПунктыДоставки КАК ПунктыДоставки
		               |ГДЕ
		               |	ПунктыДоставки.Владелец = &Владелец";
		
		Запрос.УстановитьПараметр("Владелец",Контрагент);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Количество;			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ПолучитьОстаткиПоСпайкам(МС, Знач Соот1, ТЗНастр4, ТЗПланПродажПоСпайкам)
	
	
	Запрос22 = Новый Запрос;
	
	Запрос22.Текст =
	"ВЫБРАТЬ
	|	ТЗНом.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_НомВрем_1
	|ИЗ
	|	&ТЗНом КАК ТЗНом
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_НомВрем_1.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_НомВрем
	|ИЗ
	|	ВТ_НомВрем_1 КАК ВТ_НомВрем_1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗСкладов.Склад КАК Склад,
	|	ТЗСкладов.СкладМаркировка КАК СкладМаркировка,
	|	ТЗСкладов.УчитыватьОстаткиПланыСпаек КАК УчитыватьОстаткиПланыСпаек
	|ПОМЕСТИТЬ ВТ_СкладВрем
	|ИЗ
	|	&ТЗНастр4 КАК ТЗСкладов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗНом.Номенклатура КАК Номенклатура,
	|	ТЗСклад.Склад КАК Склад,
	|	ТЗСклад.СкладМаркировка КАК СкладМаркировка
	|ПОМЕСТИТЬ ВТ_Ном
	|ИЗ
	|	ВТ_НомВрем КАК ТЗНом,
	|	ВТ_СкладВрем КАК ТЗСклад
	|ГДЕ
	|	ТЗСклад.УчитыватьОстаткиПланыСпаек
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(Остатки.КоличествоОстаток - ЕСТЬNULL(Резервы.КоличествоОстаток, 0)) КАК Ост,
	|	СУММА(ЕСТЬNULL(Резервы.КоличествоОстаток, 0)) КАК Резерв,
	|	""Направление"" КАК Направление,
	|	Остатки.Склад КАК Склад,
	|	Остатки.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_НомОст
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(
	|			&ТД,
	|			Склад В (&Склады)
	|				И Номенклатура В (&Ном)) КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	|				&ТД,
	|				Склад В (&Склады)
	|					И Номенклатура В (&Ном)) КАК Резервы
	|		ПО Остатки.Номенклатура = Резервы.Номенклатура
	|			И Остатки.Склад = Резервы.Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Номенклатура,
	|	Остатки.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(ВТ_НомОст.Ост, 0)) КАК Ост,
	|	СУММА(ЕСТЬNULL(ВТ_НомОст.Резерв, 0)) КАК Резерв,
	|	""Направление"" КАК Направление,
	|	0 КАК ПланПродаж,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_НомОст.Склад ЕСТЬ NULL
	|				И ВТ_НомОст.Склад = ВТ_Ном.СкладМаркировка
	|			ТОГДА ВТ_Ном.Склад
	|		ИНАЧЕ ЕСТЬNULL(ВТ_НомОст.Склад, ВТ_Ном.Склад)
	|	КОНЕЦ КАК Склад,
	|	ВТ_Ном.Номенклатура КАК Номенклатура
	|ИЗ
	|	ВТ_Ном КАК ВТ_Ном
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомОст КАК ВТ_НомОст
	|		ПО ВТ_Ном.Номенклатура = ВТ_НомОст.Номенклатура
	|			И (ВТ_Ном.Склад = ВТ_НомОст.Склад
	|				ИЛИ ВТ_Ном.СкладМаркировка = ВТ_НомОст.Склад)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА НЕ ВТ_НомОст.Склад ЕСТЬ NULL
	|				И ВТ_НомОст.Склад = ВТ_Ном.СкладМаркировка
	|			ТОГДА ВТ_Ном.Склад
	|		ИНАЧЕ ЕСТЬNULL(ВТ_НомОст.Склад, ВТ_Ном.Склад)
	|	КОНЕЦ,
	|	ВТ_Ном.Номенклатура";
	Запрос22.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
	Запрос22.УстановитьПараметр("ТЗНастр4", ТЗНастр4);
	Запрос22.УстановитьПараметр("Ном", ТЗПланПродажПоСпайкам.ВыгрузитьКолонку("Номенклатура"));
	Запрос22.УстановитьПараметр("ТД", ТекущаяДата());
	Запрос22.УстановитьПараметр("Склады", МС);  
	Запрос22.УстановитьПараметр("ТЗНом", ТЗПланПродажПоСпайкам);
	
	ТЗОстПоСпайкам = Запрос22.Выполнить().Выгрузить(); 
	
	Для Каждого ТСтр Из ТЗОстПоСпайкам Цикл
		
		ТСтр.Направление = Соот1.Получить(ТСтр.Склад);
		
	КонецЦикла;
	
	Возврат ТЗОстПоСпайкам; 

КонецФункции

Функция ПолучитьПланПродажПоСпайкам(МДОП, МДПС, МКДОП, МКДПС, ПодрДИП, МассивНоменклатуры,Знач ТЗНастр2)
	
		
	Запрос21 = Новый Запрос;
	Запрос21.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
	Запрос21.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СправочникНом.Ссылка КАК Спайка
	|ПОМЕСТИТЬ ВТСпайки
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК КоплектующиеНом
	|		ПО СправочникНом.Ссылка = КоплектующиеНом.Ссылка
	|ГДЕ
	|	КоплектующиеНом.Номенклатура В(&Ном)
	|	И СправочникНом.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)";
	Запрос21.УстановитьПараметр("Ном", МассивНоменклатуры);
	Запрос21.Выполнить(); 
	
	н = 0; 
	Пока н < ТЗНастр2.Количество() Цикл
		
		ТС = ТЗНастр2.Получить(н);
		
		Если НЕ ТС.УчитыватьОстаткиПланыСпаек Тогда
			
			н = н + 1;
			
			Продолжить; 	
		
		КонецЕсли;
		
		Если УчитыватьКромеД
			И (ТС.Направление = "ДОП" 
			ИЛИ ТС.Направление = "ДИП") Тогда
			ДУИсклДОП = " И НЕ ПланПродаж.Контрагент В(&Контр" + Строка(н + 1) + ")"; 
		Иначе 
			ДУИсклДОП = ""; 	
		КонецЕсли;
		
		Если УчитыватьКромеС 
			И НЕ(ТС.Направление = "ДОП" 
			ИЛИ ТС.Направление = "ДИП") Тогда
			ДУИсклДПС = " И НЕ ПланПродаж.Контрагент В(&Контр" + Строка(н + 1) + ")";
		Иначе 
			ДУИсклДПС = ""; 
		КонецЕсли;
		
		Если н = 0 Тогда  
			Запрос21.Текст = 
			"ВЫБРАТЬ
			|	ПланПродаж.Номенклатура КАК Номенклатура,
			|	&Направление" + Строка(н + 1) + " КАК Направление,
			|	ЕСТЬNULL(СУММА(ПланПродаж.Количество), 0) КАК Количество
			|ИЗ  ВТСпайки КАК ВложенныйЗапрос
			//|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
			//|		СправочникНом.Ссылка КАК Спайка
			//|	ИЗ
			//|		Справочник.Номенклатура КАК СправочникНом
			//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК КоплектующиеНом
			//|			ПО СправочникНом.Ссылка = КоплектующиеНом.Ссылка
			//|		ГДЕ 
			//|		КоплектующиеНом.Номенклатура В(&Ном)
			//|		И СправочникНом.ВидКомплекта = Значение(Перечисление.ВидыКомплектов.Комплект)) КАК ВложенныйЗапрос
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПланПродаж КАК ПланПродаж
			|		ПО (ПланПродаж.Номенклатура = ВложенныйЗапрос.Спайка)
			|ГДЕ
			|	ПланПродаж.Период >= &Дата1" + Строка(н + 1) + "
			|	И ПланПродаж.Период < &Дата2" + Строка(н + 1) + "
			|	И ПланПродаж.Подразделение В(&Подр" + Строка(н + 1) + ")
			|   " + ДУИсклДОП + "  " + ДУИсклДПС + "
			|СГРУППИРОВАТЬ ПО
			|	ПланПродаж.Номенклатура
			|
			|ИМЕЮЩИЕ
			|	ЕСТЬNULL(СУММА(ПланПродаж.Количество), 0) > 0";
		Иначе
			
			Запрос21.Текст = Запрос21.Текст + 
			" ОБЪЕДИНИТЬ ВСЕ 
			|ВЫБРАТЬ
			|	ПланПродаж.Номенклатура КАК Номенклатура,
			|	&Направление" + Строка(н + 1) + " КАК Направление,
			|	ЕСТЬNULL(СУММА(ПланПродаж.Количество), 0) КАК Количество
			|ИЗ  ВТСпайки КАК ВложенныйЗапрос
			//|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
			//|		СправочникНом.Ссылка КАК Спайка
			//|	ИЗ
			//|		Справочник.Номенклатура КАК СправочникНом
			//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК КоплектующиеНом
			//|			ПО СправочникНом.Ссылка = КоплектующиеНом.Ссылка
			//|	ГДЕ
			//|		КоплектующиеНом.Номенклатура В(&Ном)
			//|		И СправочникНом.ВидКомплекта = Значение(Перечисление.ВидыКомплектов.Комплект)) КАК ВложенныйЗапрос
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПланПродаж КАК ПланПродаж
			|		ПО (ПланПродаж.Номенклатура = ВложенныйЗапрос.Спайка)
			|ГДЕ
			|	ПланПродаж.Период >= &Дата1" + Строка(н + 1) + "
			|	И ПланПродаж.Период < &Дата2" + Строка(н + 1) + "
			|	И ПланПродаж.Подразделение В(&Подр" + Строка(н + 1) + ")
			|   " + ДУИсклДОП + "  " + ДУИсклДПС + "
			|СГРУППИРОВАТЬ ПО
			|	ПланПродаж.Номенклатура
			|
			|ИМЕЮЩИЕ
			|	ЕСТЬNULL(СУММА(ПланПродаж.Количество), 0) > 0 "; 
			
		КонецЕсли; 
		
		Запрос21.УстановитьПараметр("Ном", МассивНоменклатуры);
		Запрос21.УстановитьПараметр("Дата1" + Строка(н + 1), ТС.НачалоРасчета);
		Запрос21.УстановитьПараметр("Дата2" + Строка(н + 1), ТС.ОкончаниеРасчета);
		Запрос21.УстановитьПараметр("Направление" + Строка(н + 1), ТС.Направление);
		
		Если ТС.Направление = "ДОП" Тогда
			
			Запрос21.УстановитьПараметр("Подр" + Строка(н + 1), МДОП);
			
			Если УчитыватьКромеД Тогда
				Запрос21.УстановитьПараметр("Контр" + Строка(н + 1), МКДОП);
			КонецЕсли;	
			
		ИначеЕсли   ТС.Направление = "ДИП" Тогда
			Запрос21.УстановитьПараметр("Подр" + Строка(н + 1), ПодрДИП);
			Если УчитыватьКромеД Тогда
				Запрос21.УстановитьПараметр("Контр" + Строка(н + 1), МКДОП);
			КонецЕсли;
			
		Иначе
			
			Запрос21.УстановитьПараметр("Подр" + Строка(н + 1), МДПС);
			
			Если УчитыватьКромеС Тогда
				Запрос21.УстановитьПараметр("Контр" + Строка(н + 1), МКДПС);
			КонецЕсли;
			
		КонецЕсли;
		
		н = н + 1;
	КонецЦикла;
	
	ТЗПланПродажПоСпайкам = Запрос21.Выполнить().Выгрузить(); 
	
	Возврат ТЗПланПродажПоСпайкам; 

КонецФункции

Функция  ПолучитьПланПродажПоНаправлениям(Знач ДУИсклДОП, Знач ДУИсклДПС, МассивНоменклатуры, МДОП, МДПС, МКДОП, МКДПС, Знач МНапр, ПодрДИП, Знач ТЗНастр2)
	
	н = 0; 
	
	//МНапр = Новый Массив; 
	
	Запрос2 = Новый Запрос;
	
	Пока н < ТЗНастр2.Количество() Цикл
		
		ТС = ТЗНастр2.Получить(н); 
		
		УчитыватьОстаткиПланыСпаек = ТС.УчитыватьОстаткиПланыСпаек; 
		
		Если УчитыватьКромеД
			И (ТС.Направление = "ДОП" 
			ИЛИ ТС.Направление = "ДИП") Тогда
			ДУИсклДОП = " И НЕ ПланПродаж.Контрагент В(&Контр" + Строка(н + 1) + ")"; 
		Иначе 
			ДУИсклДОП = ""; 	
		КонецЕсли;
		
		Если УчитыватьКромеС 
			И НЕ(ТС.Направление = "ДОП" 
			ИЛИ ТС.Направление = "ДИП") Тогда
			ДУИсклДПС = " И НЕ ПланПродаж.Контрагент В(&Контр" + Строка(н + 1) + ")";
		Иначе 
			ДУИсклДПС = ""; 
		КонецЕсли; 
		
		Если УчитыватьОстаткиПланыСпаек Тогда
			
			РегистрНакопления = "РегистрНакопления.ПланПродаж"; 
		Иначе
			
			РегистрНакопления = "РегистрНакопления.ПланПродажШтуки";
		КонецЕсли;
		
		Если н = 0 Тогда
			Запрос2.Текст =
			"ВЫБРАТЬ
			|	ПланПродаж.Номенклатура КАК Номенклатура,
			|	&Направление" + Строка(н + 1) + " КАК Направление,
			|	ЕСТЬNULL(СУММА(ПланПродаж.Количество), 0) КАК Количество
			|ИЗ
			//|	РегистрНакопления.ПланПродаж КАК ПланПродаж
			|	"+РегистрНакопления+"  КАК ПланПродаж
			|ГДЕ
			|	ПланПродаж.Период >= &Дата1" + Строка(н + 1) + "
			|	И ПланПродаж.Период < &Дата2" + Строка(н + 1) + "
			|	И ПланПродаж.Номенклатура В(&Ном)
			|	И НЕ ПланПродаж.Номенклатура.Родитель.Страна.Наименование ПОДОБНО &Китай
			|	И ПланПродаж.Подразделение В(&Подр" + Строка(н + 1) + ")
			|   " + ДУИсклДОП + "   " + ДУИсклДПС + "
			|СГРУППИРОВАТЬ ПО
			|	ПланПродаж.Номенклатура
			|   
			| ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПланПродаж.Номенклатура,
			|	&Направление" + Строка(н + 1) + ",
			|	ЕСТЬNULL(СУММА(ПланПродаж.Количество), 0)
			|ИЗ
			|	"+РегистрНакопления+"  КАК ПланПродаж
			|ГДЕ
			|	ПланПродаж.Период >= &ДатаКитай1" + Строка(н + 1) + "
			|	И ПланПродаж.Период < &ДатаКитай2" + Строка(н + 1) + "
			|	И ПланПродаж.Номенклатура В(&Ном)
			|	И ПланПродаж.Номенклатура.Родитель.Страна.Наименование ПОДОБНО &Китай
			|	И ПланПродаж.Подразделение В(&Подр" + Строка(н + 1) + ")
			|   " + ДУИсклДОП + "   " + ДУИсклДПС + "
			|СГРУППИРОВАТЬ ПО
			|	ПланПродаж.Номенклатура";
			
			
		Иначе
			
			Запрос2.Текст = Запрос2.Текст + 
			" ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПланПродаж.Номенклатура КАК Номенклатура,
			|	&Направление" + Строка(н + 1) + " КАК Направление,
			|	ЕСТЬNULL(СУММА(ПланПродаж.Количество), 0) КАК Количество
			|ИЗ
			|	"+РегистрНакопления+"  КАК ПланПродаж
			|ГДЕ
			|	ПланПродаж.Период >= &Дата1" + Строка(н + 1) + "
			|	И ПланПродаж.Период < &Дата2" + Строка(н + 1) + "
			|	И ПланПродаж.Номенклатура В(&Ном)
			|	И НЕ ПланПродаж.Номенклатура.Родитель.Страна.Наименование ПОДОБНО &Китай
			|	И ПланПродаж.Подразделение В(&Подр" + Строка(н + 1) + ")
			|   " + ДУИсклДПС + "  " + ДУИсклДОП + "
			|СГРУППИРОВАТЬ ПО
			|	ПланПродаж.Номенклатура
			|   
			|  ОБЪЕДИНИТЬ ВСЕ
			|
			| ВЫБРАТЬ
			|	ПланПродаж.Номенклатура,
			|	&Направление" + Строка(н + 1) + ",
			|	ЕСТЬNULL(СУММА(ПланПродаж.Количество), 0)
			|ИЗ
			|	"+РегистрНакопления+"  КАК ПланПродаж
			|ГДЕ
			|	ПланПродаж.Период >= &ДатаКитай1" + Строка(н + 1) + "
			|	И ПланПродаж.Период < &ДатаКитай2" + Строка(н + 1) + "
			|	И ПланПродаж.Номенклатура В(&Ном)
			|	И ПланПродаж.Номенклатура.Родитель.Страна.Наименование ПОДОБНО &Китай
			|	И ПланПродаж.Подразделение В(&Подр" + Строка(н + 1) + ")
			|   " + ДУИсклДПС + "  " + ДУИсклДОП + "
			|СГРУППИРОВАТЬ ПО
			|	ПланПродаж.Номенклатура";
			
		КонецЕсли;
		
		Запрос2.УстановитьПараметр("Ном", МассивНоменклатуры);
		Запрос2.УстановитьПараметр("Китай", "КИТАЙ");
		Запрос2.УстановитьПараметр("Дата1" + Строка(н + 1), ТС.НачалоРасчета);
		Запрос2.УстановитьПараметр("Дата2" + Строка(н + 1), ТС.ОкончаниеРасчета);
		Запрос2.УстановитьПараметр("Направление" + Строка(н + 1), ТС.Направление);
		
		Запрос2.УстановитьПараметр("ДатаКитай1" + Строка(н + 1), ТС.НачалоРасчетаКитай);
		Запрос2.УстановитьПараметр("ДатаКитай2" + Строка(н + 1), ТС.ОкончаниеРасчетаКитай);
		
		Если ТС.Направление = "ДОП" Тогда
			
			Запрос2.УстановитьПараметр("Подр" + Строка(н + 1), МДОП);
			
			Если УчитыватьКромеД Тогда
				Запрос2.УстановитьПараметр("Контр" + Строка(н + 1), МКДОП);
			КонецЕсли;	
			
		ИначеЕсли   ТС.Направление = "ДИП" Тогда
			Запрос2.УстановитьПараметр("Подр" + Строка(н + 1), ПодрДИП);
			Если УчитыватьКромеД Тогда
				Запрос2.УстановитьПараметр("Контр" + Строка(н + 1), МКДОП);
			КонецЕсли;
			
		Иначе
			
			Запрос2.УстановитьПараметр("Подр" + Строка(н + 1), МДПС);
			
			Если УчитыватьКромеС Тогда
				Запрос2.УстановитьПараметр("Контр" + Строка(н + 1), МКДПС);
			КонецЕсли;
			
		КонецЕсли;
		
		МНапр.Добавить(ТС.Направление);
		
		н = н + 1;
		
	КонецЦикла;	
	
	ТЗП = Запрос2.Выполнить().Выгрузить(); 
	
	Возврат ТЗП; 

КонецФункции

Функция ПолучитьРезервыПоРНК(МассивНоменклатуры, МСНО, ТЗНастр4)	
	
	Запрос1 = Новый Запрос;
	
	Запрос1.Текст = 
	
	"ВЫБРАТЬ
	|	ТЗСкладов.Склад КАК Склад,
	|	ТЗСкладов.СкладМаркировка КАК СкладМаркировка
	|ПОМЕСТИТЬ ВТ_СкладВрем
	|ИЗ
	|	&ТЗНастр4 КАК ТЗСкладов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА РасходнаяНакладная.Склад = ВТ_СкладВрем.СкладМаркировка
	|			ТОГДА ВТ_СкладВрем.Склад
	|		ИНАЧЕ РасходнаяНакладная.Склад
	|	КОНЕЦ КАК Склад,
	|	РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(СУММА(РасходнаяНакладнаяТовары.Количество), 0) КАК Количество
	|ИЗ
	|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СкладВрем КАК ВТ_СкладВрем
	|			ПО (РасходнаяНакладная.Склад = ВТ_СкладВрем.Склад
	|					ИЛИ РасходнаяНакладная.Склад = ВТ_СкладВрем.СкладМаркировка)
	|		ПО РасходнаяНакладнаяТовары.Ссылка = РасходнаяНакладная.Ссылка
	|ГДЕ
	|	РасходнаяНакладнаяТовары.Ссылка.Контрагент = &Контрагент
	|	И РасходнаяНакладнаяТовары.Ссылка.Проведен
	|	И РасходнаяНакладнаяТовары.Ссылка.СостояниеНакладной = &СостояниеНакладной
	|	И РасходнаяНакладнаяТовары.Номенклатура В(&Ном)
	|	И РасходнаяНакладнаяТовары.Ссылка.Склад В(&Склады)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА РасходнаяНакладная.Склад = ВТ_СкладВрем.СкладМаркировка
	|			ТОГДА ВТ_СкладВрем.Склад
	|		ИНАЧЕ РасходнаяНакладная.Склад
	|	КОНЕЦ,
	|	РасходнаяНакладнаяТовары.Номенклатура"; 
	
	Запрос1.УстановитьПараметр("ТЗНастр4", ТЗНастр4);
	Запрос1.УстановитьПараметр("Ном", МассивНоменклатуры);
	Запрос1.УстановитьПараметр("Склады", МСНО); 
	Запрос1.УстановитьПараметр("СостояниеНакладной", Перечисления.СостоянияНакладной.ВРаботе);
	Запрос1.УстановитьПараметр("Контрагент", Справочники.Контрагенты.НайтиПоКоду("SSP-5148"));
	
	ТЗРНО = Запрос1.Выполнить().Выгрузить(); 
	
	Возврат ТЗРНО; 

КонецФункции

Функция ПолучитьОстаткиПоСкладамПолучателям(МассивНоменклатуры, МС, ТЗНастр4)   
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_НомВрем
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|ГДЕ
	|	СпрНоменклатура.Ссылка В(&Ном)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗСкладов.Склад КАК Склад,
	|	ТЗСкладов.СкладМаркировка КАК СкладМаркировка,
	|	ТЗСкладов.УчитыватьОстаткиПланыСпаек КАК УчитыватьОстаткиПланыСпаек
	|ПОМЕСТИТЬ ВТ_СкладВрем
	|ИЗ
	|	&ТЗНастр4 КАК ТЗСкладов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗНом.Номенклатура КАК Номенклатура,
	|	ТЗСклад.Склад КАК Склад,
	|	ТЗСклад.СкладМаркировка КАК СкладМаркировка
	|ПОМЕСТИТЬ ВТ_Ном
	|ИЗ
	|	ВТ_НомВрем КАК ТЗНом,
	|	ВТ_СкладВрем КАК ТЗСклад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВложенныйЗапрос.Ост) КАК Ост,
	|	СУММА(ВложенныйЗапрос.Резерв) КАК Резерв,
	|	ВложенныйЗапрос.Направление КАК Направление,
	|	ВложенныйЗапрос.Склад КАК Склад,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_НомОст
	|ИЗ
	|	(ВЫБРАТЬ
	|		СУММА(Остатки.КоличествоОстаток - ЕСТЬNULL(Резервы.КоличествоОстаток, 0)) КАК Ост,
	|		СУММА(ЕСТЬNULL(Резервы.КоличествоОстаток, 0)) КАК Резерв,
	|		""Направление"" КАК Направление,
	|		Остатки.Склад КАК Склад,
	|		Остатки.Номенклатура КАК Номенклатура
	|	ИЗ
	|		РегистрНакопления.ОстаткиТМЦ.Остатки(
	|				&ТД,
	|				Склад В (&Склады)
	|					И Номенклатура В (&Ном)) КАК Остатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	|					&ТД,
	|					Склад В (&Склады)
	|						И Номенклатура В (&Ном)) КАК Резервы
	|			ПО Остатки.Номенклатура = Резервы.Номенклатура
	|				И Остатки.Склад = Резервы.Склад
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Остатки.Номенклатура,
	|		Остатки.Склад
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СУММА((Остатки.КоличествоОстаток - ЕСТЬNULL(Резервы.КоличествоОстаток, 0)) * КомплектующиеСсылка.Количество),
	|		СУММА(ЕСТЬNULL(Резервы.КоличествоОстаток, 0)),
	|		""Направление"",
	|		Остатки.Склад,
	|		КомплектующиеСсылка.Номенклатура
	|	ИЗ
	|		Справочник.Номенклатура.Коплектующие КАК КомплектующиеСсылка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(&ТД, Склад В (&Склады)) КАК Остатки
	|			ПО КомплектующиеСсылка.Ссылка = Остатки.Номенклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(&ТД, Склад В (&Склады)) КАК Резервы
	|			ПО (Остатки.Номенклатура = Резервы.Номенклатура)
	|				И (Остатки.Склад = Резервы.Склад)
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СкладВрем КАК ВТ_СкладВрем
	|			ПО (ВТ_СкладВрем.Склад = Остатки.Склад
	|					ИЛИ ВТ_СкладВрем.СкладМаркировка = Остатки.Склад)
	|				И (НЕ ВТ_СкладВрем.УчитыватьОстаткиПланыСпаек)
	|	ГДЕ
	|		КомплектующиеСсылка.Номенклатура В(&Ном)
	|		И КомплектующиеСсылка.Ссылка.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		КомплектующиеСсылка.Номенклатура,
	|		Остатки.Склад) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Склад,
	|	ВложенныйЗапрос.Направление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(ВТ_НомОст.Ост, 0)) КАК Ост,
	|	СУММА(ЕСТЬNULL(ВТ_НомОст.Резерв, 0)) КАК Резерв,
	|	""Направление"" КАК Направление,
	|	0 КАК ПланПродаж,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_НомОст.Склад ЕСТЬ NULL
	|				И ВТ_НомОст.Склад = ВТ_Ном.СкладМаркировка
	|			ТОГДА ВТ_Ном.Склад
	|		ИНАЧЕ ЕСТЬNULL(ВТ_НомОст.Склад, ВТ_Ном.Склад)
	|	КОНЕЦ КАК Склад,
	|	ВТ_Ном.Номенклатура КАК Номенклатура
	|ИЗ
	|	ВТ_Ном КАК ВТ_Ном
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомОст КАК ВТ_НомОст
	|		ПО ВТ_Ном.Номенклатура = ВТ_НомОст.Номенклатура
	|			И (ВТ_Ном.Склад = ВТ_НомОст.Склад
	|				ИЛИ ВТ_Ном.СкладМаркировка = ВТ_НомОст.Склад)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА НЕ ВТ_НомОст.Склад ЕСТЬ NULL
	|				И ВТ_НомОст.Склад = ВТ_Ном.СкладМаркировка
	|			ТОГДА ВТ_Ном.Склад
	|		ИНАЧЕ ЕСТЬNULL(ВТ_НомОст.Склад, ВТ_Ном.Склад)
	|	КОНЕЦ,
	|	ВТ_Ном.Номенклатура";
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
	//Запрос.УстановитьПараметр("ФормирОбратныхПРМ", ФормирОбратныхПРМ);
	Запрос.УстановитьПараметр("ТЗНастр4", ТЗНастр4);
	//Запрос.УстановитьПараметр("ТЗНастр5", ТЗНастр5);
	Запрос.УстановитьПараметр("Ном", МассивНоменклатуры);
	Запрос.УстановитьПараметр("ТД", ТекущаяДата());
	Запрос.УстановитьПараметр("Склады", МС); 
	
	
	ТЗОст1 = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗОст1;

КонецФункции  

Функция ПолучитьОстаткиПоСкладамПолучателямОбратныеПРМ(МассивНоменклатуры, МС, ТЗНастр4)   
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_НомВрем
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|ГДЕ
	|	СпрНоменклатура.Ссылка В(&Ном)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗСкладов.Склад КАК Склад,
	|	ТЗСкладов.СкладМаркировка КАК СкладМаркировка,
	|	ТЗСкладов.УчитыватьОстаткиПланыСпаек КАК УчитыватьОстаткиПланыСпаек
	|ПОМЕСТИТЬ ВТ_СкладВрем
	|ИЗ
	|	&ТЗНастр4 КАК ТЗСкладов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗНом.Номенклатура КАК Номенклатура,
	|	ТЗСклад.Склад КАК Склад,
	|	ТЗСклад.СкладМаркировка КАК СкладМаркировка
	|ПОМЕСТИТЬ ВТ_Ном
	|ИЗ
	|	ВТ_НомВрем КАК ТЗНом,
	|	ВТ_СкладВрем КАК ТЗСклад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВложенныйЗапрос.Ост) КАК Ост,
	|	СУММА(ВложенныйЗапрос.Резерв) КАК Резерв,
	|	ВложенныйЗапрос.Направление КАК Направление,
	|	ВложенныйЗапрос.Склад КАК Склад,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_НомОст
	|ИЗ
	|	(ВЫБРАТЬ
	|		СУММА(Остатки.КоличествоОстаток - ЕСТЬNULL(Резервы.КоличествоОстаток, 0)) КАК Ост,
	|		СУММА(ЕСТЬNULL(Резервы.КоличествоОстаток, 0)) КАК Резерв,
	|		""Направление"" КАК Направление,
	|		Остатки.Склад КАК Склад,
	|		Остатки.Номенклатура КАК Номенклатура
	|	ИЗ
	|		РегистрНакопления.ОстаткиТМЦ.Остатки(
	|				&ТД,
	|				Склад В (&Склады)
	|					И Номенклатура В (&Ном)) КАК Остатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	|					&ТД,
	|					Склад В (&Склады)
	|						И Номенклатура В (&Ном)) КАК Резервы
	|			ПО Остатки.Номенклатура = Резервы.Номенклатура
	|				И Остатки.Склад = Резервы.Склад
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Остатки.Номенклатура,
	|		Остатки.Склад
	|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		СУММА((Остатки.КоличествоОстаток - ЕСТЬNULL(Резервы.КоличествоОстаток, 0)) * КомплектующиеСсылка.Количество),
	//|		СУММА(ЕСТЬNULL(Резервы.КоличествоОстаток, 0)),
	//|		""Направление"",
	//|		Остатки.Склад,
	//|		КомплектующиеСсылка.Номенклатура
	//|	ИЗ
	//|		Справочник.Номенклатура.Коплектующие КАК КомплектующиеСсылка
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(&ТД, Склад В (&Склады)) КАК Остатки
	//|			ПО КомплектующиеСсылка.Ссылка = Остатки.Номенклатура
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(&ТД, Склад В (&Склады)) КАК Резервы
	//|			ПО (Остатки.Номенклатура = Резервы.Номенклатура)
	//|				И (Остатки.Склад = Резервы.Склад)
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СкладВрем КАК ВТ_СкладВрем
	//|			ПО (ВТ_СкладВрем.Склад = Остатки.Склад
	//|					ИЛИ ВТ_СкладВрем.СкладМаркировка = Остатки.Склад)
	//|				И (НЕ ВТ_СкладВрем.УчитыватьОстаткиПланыСпаек)
	//|	ГДЕ
	//|		КомплектующиеСсылка.Номенклатура В(&Ном)
	//|		И КомплектующиеСсылка.Ссылка.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)
	//|	
	//|	СГРУППИРОВАТЬ ПО
	//|		КомплектующиеСсылка.Номенклатура,
	//|		Остатки.Склад  
	|       ) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Склад,
	|	ВложенныйЗапрос.Направление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(ВТ_НомОст.Ост, 0)) КАК Ост,
	|	СУММА(ЕСТЬNULL(ВТ_НомОст.Резерв, 0)) КАК Резерв,
	|	""Направление"" КАК Направление,
	|	0 КАК ПланПродаж,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_НомОст.Склад ЕСТЬ NULL
	|				И ВТ_НомОст.Склад = ВТ_Ном.СкладМаркировка
	|			ТОГДА ВТ_Ном.СкладМаркировка
	|		ИНАЧЕ ЕСТЬNULL(ВТ_НомОст.Склад, ВТ_Ном.Склад)
	|	КОНЕЦ КАК Склад,
	|	ВТ_Ном.Номенклатура КАК Номенклатура
	|ИЗ
	|	ВТ_Ном КАК ВТ_Ном
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомОст КАК ВТ_НомОст
	|		ПО ВТ_Ном.Номенклатура = ВТ_НомОст.Номенклатура
	|			И (ВТ_Ном.Склад = ВТ_НомОст.Склад
	|				ИЛИ ВТ_Ном.СкладМаркировка = ВТ_НомОст.Склад)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА НЕ ВТ_НомОст.Склад ЕСТЬ NULL
	|				И ВТ_НомОст.Склад = ВТ_Ном.СкладМаркировка
	|			ТОГДА ВТ_Ном.СкладМаркировка
	|		ИНАЧЕ ЕСТЬNULL(ВТ_НомОст.Склад, ВТ_Ном.Склад)
	|	КОНЕЦ,
	|	ВТ_Ном.Номенклатура";
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
	//Запрос.УстановитьПараметр("ФормирОбратныхПРМ", ФормирОбратныхПРМ);
	Запрос.УстановитьПараметр("ТЗНастр4", ТЗНастр4);
//	Запрос.УстановитьПараметр("ТЗНастр5", ТЗНастр5);
	Запрос.УстановитьПараметр("Ном", МассивНоменклатуры);
	Запрос.УстановитьПараметр("ТД", ТекущаяДата());
	Запрос.УстановитьПараметр("Склады", МС); 
	
	
	ТЗОст1 = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗОст1;

КонецФункции  


Процедура ЗаполнитьНачальныеНастройки(ПараметрыРегламента)

	УчитыватьКромеД 		= ?(ПараметрыРегламента.Получить("УчитыватьКромеДОП") <> неопределено,ПараметрыРегламента.Получить("УчитыватьКромеДОП"),истина);
	УчитыватьКромеС 		= ?(ПараметрыРегламента.Получить("УчитыватьКромеДСП")<> неопределено,ПараметрыРегламента.Получить("УчитыватьКромеДСП"),истина); 
	СоздаватьПРМ 			= ?(ПараметрыРегламента.Получить("СоздаватьПРМОбратные")<> неопределено,ПараметрыРегламента.Получить("СоздаватьПРМОбратные"),истина);
	СоздаватьПРМОбратные 	= ?(ПараметрыРегламента.Получить("СоздаватьПРМ")<> неопределено,ПараметрыРегламента.Получить("СоздаватьПРМ"),истина);
	РассылатьУведомления 	= Ложь; //?(ПараметрыРегламента.Свойство("РассылатьУведомления"),ПараметрыРегламента.РассылатьУведомления,истина);
	ПериодМес 				= ?(ПараметрыРегламента.Получить("ПериодМес")<> неопределено,ПараметрыРегламента.Получить("ПериодМес"),ложь);
	ПериодРасчета 			= ?(ПараметрыРегламента.Получить("ПериодРасчета")<> неопределено,ПараметрыРегламента.Получить("ПериодРасчета"),90); 
	ПериодРасчетаКитай 		= ?(ПараметрыРегламента.Получить("ПериодРасчетаКитай")<> неопределено,ПараметрыРегламента.Получить("ПериодРасчетаКитай"),180); 
	СкладОбрПРМ				= ?(ПараметрыРегламента.Получить("СкладОбрПРМ")<> неопределено,ПараметрыРегламента.Получить("СкладОбрПРМ"),Справочники.Склады.НайтиПоКоду("STA-48"));
	СкладОбрПРММаркировка	= ?(ПараметрыРегламента.Получить("СкладОбрПРММаркировка")<> неопределено,ПараметрыРегламента.Получить("СкладОбрПРММаркировка"),Справочники.Склады.НайтиПоКоду("STD-95"));
	
	ЭтоСкладМаркировка = Ложь;
	
	СкладыМаркировка = Новый Массив; 
	
	СкладыМаркировка.Добавить(Справочники.Склады.НайтиПоКоду("STЕ-12"));
	СкладыМаркировка.Добавить(Справочники.Склады.НайтиПоКоду("STD-95"));	
	СкладыМаркировка.Добавить(Справочники.Склады.НайтиПоКоду("STЕ-49")); 
	ТЗНастр.Очистить();
	
	НовСтр = ТЗНастр.Добавить();
	НовСтр.Направление = "ДИП";
	НовСтр.Склад = Справочники.Склады.НайтиПоКоду("STЕ-48");
	НовСтр.СкладМаркировка = Справочники.Склады.НайтиПоКоду("STЕ-49"); 
	НовСтр.НачалоРасчета = НачалоДня(ТекущаяДатаСеанса());
	Если ПериодМес Тогда
		км = Цел(ПериодРасчета / 30);
		НовСтр.ОкончаниеРасчета = ДобавитьМесяц(НовСтр.НачалоРасчета, км);
	Иначе	
		НовСтр.ОкончаниеРасчета = НовСтр.НачалоРасчета + (ПериодРасчета * 3600 * 24);
	КонецЕсли;
	НовСтр.НачалоРасчетаКитай = НачалоДня(ТекущаяДатаСеанса());
	Если ПериодМес Тогда
		км = Цел(ПериодРасчета / 30);
		НовСтр.ОкончаниеРасчетаКитай = ДобавитьМесяц(НовСтр.НачалоРасчетаКитай, км);
	Иначе	
		НовСтр.ОкончаниеРасчетаКитай = НовСтр.НачалоРасчетаКитай + (ПериодРасчетаКитай * 3600 * 24);
	КонецЕсли;
	НовСтр.РасчетОстатка = "Факт";
	НовСтр.ФормироватьПРМ	= Истина;
	НовСтр.РаспределениеСпаек 		= истина; 
	НовСтр.ФормПРМОбратные = Истина;
	НовСтр.УчитыватьОстаткиПланыСпаек = Истина;
	
	НовСтр = ТЗНастр.Добавить();
	НовСтр.Направление = "ДИП";
	НовСтр.Склад = Справочники.Склады.НайтиПоКоду("STD-13");
	НовСтр.СкладМаркировка = Справочники.Склады.НайтиПоКоду("STЕ-03"); 
	НовСтр.НачалоРасчета = НачалоДня(ТекущаяДатаСеанса());
	Если ПериодМес Тогда
		км = Цел(ПериодРасчета / 30);
		НовСтр.ОкончаниеРасчета = ДобавитьМесяц(НовСтр.НачалоРасчета, км);
	Иначе	
		НовСтр.ОкончаниеРасчета = НовСтр.НачалоРасчета + (ПериодРасчета * 3600 * 24);
	КонецЕсли;
	НовСтр.НачалоРасчетаКитай = НачалоДня(ТекущаяДатаСеанса());
	Если ПериодМес Тогда
		км = Цел(ПериодРасчета / 30);
		НовСтр.ОкончаниеРасчетаКитай = ДобавитьМесяц(НовСтр.НачалоРасчетаКитай, км);
	Иначе	
		НовСтр.ОкончаниеРасчетаКитай = НовСтр.НачалоРасчетаКитай + (ПериодРасчетаКитай * 3600 * 24);
	КонецЕсли;
	НовСтр.РасчетОстатка = "Факт";
	НовСтр.ФормироватьПРМ = Ложь; 
	НовСтр.УчитыватьОстаткиПланыСпаек = Истина; 
	
	НовСтр = ТЗНастр.Добавить();
	НовСтр.Направление = "ДОП";
	НовСтр.Склад = Справочники.Склады.НайтиПоКоду("STC-60");
	НовСтр.СкладМаркировка = Справочники.Склады.НайтиПоКоду("STD-99"); // Кельманов А.В. - HELP-2446 - 2024.12.27
	НовСтр.НачалоРасчета = НачалоДня(ТекущаяДатаСеанса());
	Если ПериодМес Тогда
		км = Цел(ПериодРасчета / 30);
		НовСтр.ОкончаниеРасчета = ДобавитьМесяц(НовСтр.НачалоРасчета, км);
	Иначе	
		НовСтр.ОкончаниеРасчета = НовСтр.НачалоРасчета + (ПериодРасчета * 3600 * 24);
	КонецЕсли;
	НовСтр.НачалоРасчетаКитай = НачалоДня(ТекущаяДатаСеанса());
	Если ПериодМес Тогда
		км = Цел(ПериодРасчета / 30);
		НовСтр.ОкончаниеРасчетаКитай = ДобавитьМесяц(НовСтр.НачалоРасчетаКитай, км);
	Иначе	
		НовСтр.ОкончаниеРасчетаКитай = НовСтр.НачалоРасчетаКитай + (ПериодРасчетаКитай * 3600 * 24);
	КонецЕсли;
	НовСтр.РасчетОстатка = "Факт";
	НовСтр.ФормироватьПРМ = Истина;
	НовСтр.ФормПРМОбратные = Истина;
	
	НовСтр = ТЗНастр.Добавить();
	НовСтр.Направление = "ДСП";
	НовСтр.Склад = Справочники.Склады.НайтиПоКоду("STA-61");
	НовСтр.СкладМаркировка = Справочники.Склады.НайтиПоКоду("STD-97"); // Кельманов А.В. - HELP-2446 - 2024.12.27
	НовСтр.НачалоРасчета = НачалоМесяца(ТекущаяДатаСеанса());
	Если ПериодМес Тогда
		км = Цел(ПериодРасчета / 30);
		НовСтр.ОкончаниеРасчета = ДобавитьМесяц(НовСтр.НачалоРасчета, км);
	Иначе	
		НовСтр.ОкончаниеРасчета = НовСтр.НачалоРасчета + (ПериодРасчета * 3600 * 24);
	КонецЕсли;
	НовСтр.НачалоРасчетаКитай = НачалоДня(ТекущаяДатаСеанса());
	Если ПериодМес Тогда
		км = Цел(ПериодРасчета / 30);
		НовСтр.ОкончаниеРасчетаКитай = ДобавитьМесяц(НовСтр.НачалоРасчетаКитай, км);
	Иначе	
		НовСтр.ОкончаниеРасчетаКитай = НовСтр.НачалоРасчетаКитай + (ПериодРасчетаКитай * 3600 * 24);
	КонецЕсли;
	НовСтр.РасчетОстатка = "Факт+Резерв";
	НовСтр.ФормироватьПРМ = Ложь;
	НовСтр.ФормПРМОбратные = Истина;
	
	НовСтр = ТЗНастр.Добавить();
	НовСтр.Направление = "ДСП";
	НовСтр.Склад = Справочники.Склады.НайтиПоКоду("STC-65");
	НовСтр.СкладМаркировка = Справочники.Склады.НайтиПоКоду("STЕ-11"); // Кельманов А.В. - HELP-2446 - 2024.12.27
	НовСтр.НачалоРасчета = НачалоМесяца(ТекущаяДатаСеанса());
	Если ПериодМес Тогда
		км = Цел(ПериодРасчета / 30);
		НовСтр.ОкончаниеРасчета = ДобавитьМесяц(НовСтр.НачалоРасчета, км);
	Иначе	
		НовСтр.ОкончаниеРасчета = НовСтр.НачалоРасчета + (ПериодРасчета * 3600 * 24);
	КонецЕсли;
	НовСтр.НачалоРасчетаКитай = НачалоДня(ТекущаяДатаСеанса());
	Если ПериодМес Тогда
		км = Цел(ПериодРасчета / 30);
		НовСтр.ОкончаниеРасчетаКитай = ДобавитьМесяц(НовСтр.НачалоРасчетаКитай, км);
	Иначе	
		НовСтр.ОкончаниеРасчетаКитай = НовСтр.НачалоРасчетаКитай + (ПериодРасчетаКитай * 3600 * 24);
	КонецЕсли;
	НовСтр.РасчетОстатка = "Факт+Резерв";
	
	НовСтр.ФормироватьПРМ = Истина;
	НовСтр.ФормПРМОбратные = Истина;


КонецПроцедуры

Функция ПолучитьТаблицуОстатковПоСкладамДляРаспределения(Знач МассивСкладов,МассивНоменклатуры)
	
	//ТЗРаспр.Очистить();
	//ТЧдляРаспределения = ТЗРаспр.Выгрузить().Скопировать(); 
	
	Запрос = Новый Запрос; 
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	СУММА(Остатки.КоличествоОстаток - ЕСТЬNULL(Резервы.КоличествоОстаток, 0)) КАК Остаток,
	|	СУММА(ЕСТЬNULL(Резервы.КоличествоОстаток, 0)) КАК Резерв,
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.Склад КАК Склад
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(
	|			,
	|			Склад В (&Склады)
	|				И Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|				И ВЫБОР
	|					КОГДА &ОтборПоГруппе
	|						ТОГДА Номенклатура В ИЕРАРХИИ (&ГруппаТоваров)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	|				,
	|				Склад В (&Склады)
	|					И Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|					И ВЫБОР
	|						КОГДА &ОтборПоГруппе
	|							ТОГДА Номенклатура В ИЕРАРХИИ (&ГруппаТоваров)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ) КАК Резервы
	|		ПО Остатки.Номенклатура = Резервы.Номенклатура
	|			И Остатки.Склад = Резервы.Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Номенклатура,
	|	Остатки.Склад
	|
	|ИМЕЮЩИЕ
	|	СУММА(Остатки.КоличествоОстаток - ЕСТЬNULL(Резервы.КоличествоОстаток, 0)) > 0";
	Запрос.УстановитьПараметр("Склады",МассивСкладов);
	Запрос.УстановитьПараметр("ГруппаТоваров",ГруппаТоваров);
	Запрос.УстановитьПараметр("ОтборПоГруппе",ЗначениеЗаполнено(ГруппаТоваров));
	//Выборка = Запрос.Выполнить().Выбрать(); 
	//
	//Пока Выборка.Следующий() Цикл
	//	
	//	НоваяСтрока = ТЧдляРаспределения.Добавить(); 	
	//	ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
	//	
	//	МассивНоменклатуры.Добавить(Выборка.Номенклатура); 
	//	
	//	
	//КонецЦикла;
	// 
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	МассивНоменклатуры = ТЗ.ВыгрузитьКолонку("Номенклатура");
	
	Возврат ТЗ; 

КонецФункции

Функция Объединить2Массива_ВернутьНовый(МассивИсточник, МассивПриемник)
	МассивВозврата = Новый Массив;
	Для Каждого Элемент ИЗ МассивИсточник Цикл
		Если МассивВозврата.Найти(Элемент) = Неопределено И ЗначениеЗаполнено(Элемент) Тогда
			МассивВозврата.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Элемент ИЗ МассивПриемник Цикл
		Если МассивВозврата.Найти(Элемент) = Неопределено И ЗначениеЗаполнено(Элемент) Тогда
			МассивВозврата.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Возврат МассивВозврата;
КонецФункции