Перем КоличествоИзготовленныхКарт;

Процедура ПриЗаписи(Отказ)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//Если Ссылка.КонечныйНомер = "" тогда
	//Дата=ТекущаяДата();	
	//Ссылка.КонечныйНомер = "0"
	//иначе КонецЕсли;
	//Если НадоПерезаписыватьЦены Тогда
	//Лобан +++ 180814
	Если 	ПометкаУдаления=Истина тогда 
		НаборЗаписейИстории=РегистрыСведений.НомераКарт.СоздатьНаборЗаписей();
		НаборЗаписейИстории.Отбор.Вид.Установить(Ссылка.Вид);
		НаборЗаписейИстории.Отбор.КонечныйНомер.Установить(Ссылка.КонечныйНомер);
		НаборЗаписейИстории.Отбор.ПервыйНомер.Установить(Ссылка.ПервыйНомер);
		НаборЗаписейИстории.Записать();
		
	иначе
		//Лобан --- 180814
		Набор=РегистрыСведений.НомераКарт.СоздатьНаборЗаписей();
		Набор.Отбор.Вид.Установить(Ссылка.Вид);
		Набор.Отбор.КонечныйНомер.Установить(Ссылка.КонечныйНомер);
		Набор.Отбор.ПервыйНомер.Установить(Ссылка.ПервыйНомер);
		
		НаборЗаписей = Набор.Добавить();
		НаборЗаписей.Вид = Ссылка.Вид;
		ПервыйНомер0 = Число(Ссылка.ПервыйНомер);
		ПервыйНомер1 = ПервыйНомер0;
		ПервыйНомер2 = Формат(ПервыйНомер1,"ЧЦ=12; ЧВН=");
		НаборЗаписей.ПервыйНомер = Строка(ПервыйНомер2);
		
		
		если НЕ Ссылка.ПоследнийНомер = "" тогда
			ПоследнийНомер0 = Число(Ссылка.ПоследнийНомер);
		иначе
			ПоследнийНомер0 = 0
		КонецЕсли;
		
		//ПоследнийНомер0 = Число(Ссылка.ПоследнийНомер);
		если Число(Ссылка.ПервыйНомер)-1 = Число(ПоследнийНомер) тогда
			
			ПоследнийНомер1 = ПоследнийНомер;
			ПоследнийНомер2 = Формат(ПоследнийНомер1,"ЧЦ=12; ЧВН=");
			НаборЗаписей.ПоследнийНомер = Строка(ПоследнийНомер2);
		иначе
			ПервыйНомер0 = Число(Ссылка.ПервыйНомер);
			ПервыйНомер1 = ПервыйНомер0;
			ПервыйНомер2 = Формат(ПервыйНомер1,"ЧЦ=12; ЧВН=");
			НаборЗаписей.ПоследнийНомер = Строка(ПервыйНомер2)
		КонецЕсли;
		
		если НЕ Ссылка.КонечныйНомер = "" тогда
			КонечныйНомер0 = Число(Ссылка.КонечныйНомер);
		иначе
			КонечныйНомер0 = 0
		КонецЕсли;
		//КонечныйНомер0 = КонечныйНомер;
		КонечныйНомер1 = Число(КонечныйНомер0);
		КонечныйНомер2 = Формат(КонечныйНомер1,"ЧЦ=12; ЧВН=");
		НаборЗаписей.КонечныйНомер = Строка(КонечныйНомер2);
		
		// НаборЗаписей.Изготовленно=ПоследнийНомер-КонечныйНомер;
		
		//НаборЗаписей.Изготовленно = КоличествоКартОбщее;
		НаборЗаписей.Изготовленно = КоличествоКарт;
		
		////НаборЗаписей.ПоследнииНомКарт = Строка(СтрокаНН);
		////КоличествоИзготовленныхКарт = 0;
		////КоличествоКарт();
		//////НПК = Ссылка.ПоследнииНомераКарт
		//////НПК1 = Ссылка.ПоследнииНомКарт
		////НПК = Число(СтрокаНН);
		////если Ссылка.ПоследнииНомКарт = "" тогда
		////	НПК1=0 
		////иначе
		////НПК1 = Число(Ссылка.ПоследнииНомКарт);
		////КонецЕсли;
		////НаборЗаписей.Изготовленно = НПК-НПК1;
		////
		////СтрокаПНК1 = НПК1+1;
		////форматПНК1 = Формат(СтрокаПНК1,"ЧЦ=12; ЧВН=");
		////НаборЗаписей.ПервыйНомер = Строка(форматПНК1);
		НаборЗаписей.Дата = Дата;//ТекущаяДата();
		//Ссылка.Дата = ТекущаяДата();
		
		Набор.Записать();
		//Лобан +++ 180814
	КонецЕсли;	
	//Лобан --- 180814
	
	//ЭтотОбъект.
	//КонецЕсли;	
КонецПроцедуры

Функция КоличествоКарт()
	
	запрос = новый запрос;
	
	запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	НомераКарт.ПоследнииНомераКарт КАК КоличествоИзготовленныхКарт
	               |ИЗ
	               |	РегистрСведений.НомераКарт КАК НомераКарт
	               |ГДЕ
	               |	НомераКарт.Дата <= &Дата
	               |	И НомераКарт.Вид = &Вид
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КоличествоИзготовленныхКарт УБЫВ";
				   
	запрос.УстановитьПараметр("Дата",ТекущаяДата());
	запрос.УстановитьПараметр("Вид",Ссылка.Вид);
	выборка = запрос.Выполнить().Выбрать();
	Пока выборка.Следующий() цикл
		КоличествоИзготовленныхКарт = выборка.КоличествоИзготовленныхКарт;
		КонецЦикла;
Возврат КоличествоИзготовленныхКарт;	
КонецФункции

//Лобан +++ 180814
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если РежимЗаписи <> РежимЗаписиДокумента.Проведение и не ПометкаУдаления тогда
		РежимЗаписи=РежимЗаписиДокумента.Проведение иначе
	КонецЕсли; 
КонецПроцедуры
//Лобан --- 180814
