Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Кухарь А.Ю. 31.03.2026 начало
	// Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом тогда
	Если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() тогда
		//Кухарь А.Ю. 31.03.2026 конец                        
		Возврат;
	КонецЕсли;
	ЗаписатьВЛог("Регламент1",ОписаниеОшибки(),"Информация");

	//Если Константы.ДатаЗапретаВидимости = '00010101' Тогда	
		ЗаписатьВЛог("Регламент2",ОписаниеОшибки(),"Информация");

    Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);	
	// Кухарь А.Ю.  08.09.2022 конец
//    Профиль.ПортSMTP           = 25;
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь       = "*%*%*%";
	//Профиль.Пароль             = "*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	Сообщение=новый интернетПочтовоеСообщение;
	Сообщение.Получатели.Добавить("krohin@collant.ru");
	Сообщение.Тема="Контроль интерфейса на складе";
	Сообщение.Отправитель = "helpdesk@collant.ru";
	Сообщение.Тексты.Добавить("123");
//	Сообщение.Тексты.Добавить(ТекстОшибки);
	Почта= Новый ИнтернетПочта;
    попытка
		Почта.Подключиться(Профиль);
	исключение	
		ЗаписатьВЛог("Регламент3",ОписаниеОшибки(),"Информация");

	конецПопытки;
    Попытка
		Почта.Послать(Сообщение);
	исключение
			ЗаписатьВЛог("Регламент4",ОписаниеОшибки(),"Информация");
	конецПопытки;
	Почта.Отключиться();
	//КонецЕсли; 

КонецПроцедуры
 
