Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если НЕ ОбменДанными.Загрузка Тогда
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
		Если Отказ Тогда Возврат КонецЕсли; 	
	КонецЕсли;
	
	СуммаДокумента=Товары.Итог("Всего");
	ОбъемДокумента=Товары.Итог("Объем");
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	Если ВводОстатков Тогда Возврат КонецЕсли; 
	
	Если Валюта<>ПараметрыСеанса.ВалютаУпр Тогда
		КоэффПересчета=Курс;
	Иначе
		КоэффПересчета=1;
	КонецЕсли; 
	
	ТекСклад	=?(Склад.ФизическийСклад.Пустая(),Склад,Склад.ФизическийСклад);
	
	ЗаписиЦПП=РегистрыСведений.История.СоздатьНаборЗаписей();
	ЗаписиЦПП.Отбор.Документ.Использование	=Истина;
	ЗаписиЦПП.Отбор.Документ.Значение		=Ссылка;
	
	ЗаписиЦПП.Отбор.Реквизит.Использование	=Истина;
	ЗаписиЦПП.Отбор.Реквизит.Значение		="ЦенаПоследнегоПрихода";
	
	Для Каждого СтрокаТоваров Из Товары Цикл
		Движение=Движения.ОстаткиТМЦ.Добавить();	
		Движение.Период			=Дата;
		Движение.ВидДвижения	=ВидДвиженияНакопления.Приход;
		
		Движение.Склад			=?(СтрокаТоваров.Склад.Пустая(),ТекСклад,СтрокаТоваров.Склад);
		Движение.Номенклатура	=СтрокаТоваров.Номенклатура;
		
		Движение.Количество		=СтрокаТоваров.Количество*СтрокаТоваров.Коэффициент;
		Движение.Сумма			=СтрокаТоваров.Всего*КоэффПересчета;
		
		Движение.КодОперации=Перечисления.КодыОперацийОстатки.ВводОстатков;
		
		
		ЦенаПрихода=?(Движение.Количество=0,0,Движение.Сумма/Движение.Количество);
		
		Если ЦенаПрихода>0 Тогда
			ЗаписьЦПП=ЗаписиЦПП.Добавить();
			ЗаписьЦПП.Период	=Дата;
			ЗаписьЦПП.Реквизит	="ЦенаПоследнегоПрихода";
			ЗаписьЦПП.Объект	=СтрокаТоваров.Номенклатура;
			ЗаписьЦПП.Документ	=Ссылка;
			ЗаписьЦПП.Значение	=ЦенаПрихода;		
		КонецЕсли;
		
		Если СтрокаТоваров.Амортизация<>0 Тогда
			Движение=Движения.Амортизация.Добавить();
			
			Движение.ВидДвижения=ВидДвиженияНакопления.Приход;
			
			Движение.Склад		=?(СтрокаТоваров.Склад.Пустая(),ТекСклад,СтрокаТоваров.Склад);
			Движение.Период		=Дата;
			Движение.ОС			=СтрокаТоваров.Номенклатура;
			Движение.Амортизация=СтрокаТоваров.Амортизация;		
		КонецЕсли; 
	КонецЦикла; 
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки

	ЗаписиЦПП.Записать();
	
	Если ОбменДанными.Загрузка Тогда
		Движения.ОстаткиТМЦ.Записать();	
		Движения.Амортизация.Записать();
	КонецЕсли; 
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ОчиститьДвиженияДокументаПоИстории(Ссылка);
КонецПроцедуры
