 Процедура ПередЗаписью(Отказ, Замещение)
	 
	 если НЕ обменданными.загрузка  тогда
		 Если ТИП("документссылка.КоррекцияРегистраПартии") =ТипЗнч(отбор.Регистратор.Значение) тогда
			 для каждого запись из этотобъект цикл
				 
				 если ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
					 Получатель=ПланыОбмена.Основной.НайтиПоКоду(запись.Склад.КодФизическогоУзла);
				 иначе
					 Получатель=ПланыОбмена.Основной.НайтиПоКоду(запись.Склад.КодФизическогоУзла).УправляющийУзел;
				 Конецесли;
				 
				 прервать;
			 Конеццикла;	
			 Если ЗначениеЗаполнено(Получатель) тогда
				 ОбменДанными.Получатели.Добавить(Получатель);
			 Конецесли;
		 Конецесли;
	 Конецесли;
КонецПроцедуры
