// Шворобей ВЮ 22.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-6079
#Область ПоискФизлицПоШтрихКодуГруппы

Функция ПоискФизлицПоШтрихКодуГруппы(ШтрихКод, ЧислоСотрудников = 1) Экспорт
	
	ЧислоСотрудников = ?(ЧислоСотрудников = 0, 1, ЧислоСотрудников);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШтрихКод", ШтрихКод);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ФизическиеЛица.Ссылка КАК Группа
	|ПОМЕСТИТЬ вр_Группа
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.ЭтоГруппа
	|	И НЕ ФизическиеЛица.ПометкаУдаления
	|	И ФизическиеЛица.ШтрихКод = &ШтрихКод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ " + Строка(Окр(ЧислоСотрудников,0)) + "
	|	ФизическиеЛица.Ссылка КАК ФизЛицо
	|ИЗ
	|	вр_Группа КАК вр_Группа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО вр_Группа.Группа = ФизическиеЛица.Родитель
	|ГДЕ
	|	НЕ ФизическиеЛица.ЭтоГруппа
	|	И НЕ ФизическиеЛица.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицо
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	УстановитьПривилегированныйРежим(Истина);
	МассивФизлиц = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизЛицо");
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат МассивФизлиц;

КонецФункции

#КонецОбласти
// Шворобей ВЮ 22.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-6079

// Шворобей ВЮ 22.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5976
#Область Интерфейс

Функция НайтиКоличествоКомплектующих(тзТовары) Экспорт
	
	Если тзТовары.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("тзТовары", тзТовары);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(тзТовары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(тзТовары.Количество КАК ЧИСЛО(10, 0)) КАК Количество
	|ПОМЕСТИТЬ вр_Товары
	|ИЗ
	|	&тзТовары КАК тзТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_Товары.Номенклатура КАК Номенклатура,
	|	вр_Товары.Номенклатура КАК Комплектующее,
	|	ЕСТЬNULL(вр_Товары.Количество, 0) КАК Количество
	|ПОМЕСТИТЬ вр_Таблица
	|ИЗ
	|	вр_Товары КАК вр_Товары
	|ГДЕ
	|	вр_Товары.Номенклатура.ВидКомплекта В (ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Товар), ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект), ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Комплектующие.Ссылка,
	|	Комплектующие.Номенклатура,
	|	ЕСТЬNULL(Комплектующие.Количество, 0) * ЕСТЬNULL(вр_Товары.Количество, 0)
	|ИЗ
	|	Справочник.Номенклатура.Коплектующие КАК Комплектующие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вр_Товары КАК вр_Товары
	|		ПО Комплектующие.Ссылка = вр_Товары.Номенклатура
	|ГДЕ
	|	Комплектующие.Ссылка.ВидКомплекта В (ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект))
	|	И Комплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(вр_Таблица.Количество) КАК Количество
	|ИЗ
	|	вр_Таблица КАК вр_Таблица";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Количество;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция ПреобразоватьШтрихкодыУпаковокВТовары(тзШтрихкодыУпаковок) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("тзШтрихкодыУпаковок", тзШтрихкодыУпаковок);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(тзШтрихкодыУпаковок.ШтрихкодУпаковки КАК Справочник.ШтрихкодыУпаковокТоваров) КАК Штрихкод
	|ПОМЕСТИТЬ вр_Штрихкоды
	|ИЗ
	|	&тзШтрихкодыУпаковок КАК тзШтрихкодыУпаковок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_Штрихкоды.Штрихкод.Владелец КАК Номенклатура,
	|	вр_Штрихкоды.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ т_Штрихкоды
	|ИЗ
	|	вр_Штрихкоды КАК вр_Штрихкоды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т_Штрихкоды.Номенклатура КАК Номенклатура,
	|	КОЛИЧЕСТВО(т_Штрихкоды.Штрихкод) КАК Количество
	|ИЗ
	|	т_Штрихкоды КАК т_Штрихкоды
	|
	|СГРУППИРОВАТЬ ПО
	|	т_Штрихкоды.Номенклатура";
	
	УстановитьПривилегированныйРежим(Истина);
	тзВыборка = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат тзВыборка;
	
КонецФункции

#КонецОбласти
// Шворобей ВЮ 22.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5976

// Шворобей ВЮ 29.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5976
#Область ПоискНезакрытыхКоллективныхРабот

Функция ПоискНезакрытыхКоллективныхРаботПоДокументуОснования(ДокОснование) Экспорт
	
	МассивКР = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокОснование", ДокОснование);
	Запрос.УстановитьПараметр("ДатаЗапретаРедактирование", ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования());	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КоллективныеРаботы.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КоллективныеРаботы КАК КоллективныеРаботы
	|ГДЕ
	|	КоллективныеРаботы.ДокОснование = &ДокОснование
	|	И КоллективныеРаботы.Проведен
	|	И НЕ КоллективныеРаботы.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.Отгружена), ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.Принята))
	|	И КоллективныеРаботы.Дата > &ДатаЗапретаРедактирование
	|	И КоллективныеРаботы.ДатаОкончанияРабот = ДАТАВРЕМЯ(1, 1, 1)";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		МассивКР.Добавить(Выборка.Ссылка);	
	КонецЦикла;
	
	Возврат МассивКР;
	
КонецФункции

#КонецОбласти
// Шворобей ВЮ 29.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5976
