
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекстJSON = b2b_ОбменЗаявками.ПолучитьТекстJSON(ЭтаФорма);
	ТекстJSONрезультат = b2b_ОбменЗаявками.ПолучитьТекстJSONРезультат(ЭтаФОрма);
	
	ВывестиСписокЗначений();

КонецПроцедуры

&НаСервере
Процедура ВывестиСписокЗначений()
	
		
	ЗаписьЗначение = РеквизитФормыВЗначение("Запись"); 
	ЗначениеМассивДанных = ЗаписьЗначение.МассивДанных.Получить();
	
	Если ТипЗнч(ЗначениеМассивДанных) = Тип("Массив") Тогда
		
		Если  ЗначениеМассивДанных.Количество() = 0 Тогда
		
			Возврат; 	
		
		КонецЕсли;
		
		СтруктураДанных = ЗначениеМассивДанных[0]; 
		
		Если  ТипЗнч(СтруктураДанных) = Тип("Структура") Тогда
			
			ТЧ = Новый ТаблицаЗначений;
			Для каждого ЭлементСтруктуры Из СтруктураДанных Цикл
				МассивТипов = Новый Массив; 
				МассивТипов.Добавить(ТипЗнч(ЭлементСтруктуры.Значение)); 
				
				ОписаниеТипов = Новый ОписаниеТипов(МассивТипов); 
				ТЧ.Колонки.Добавить(ЭлементСтруктуры.Ключ,ОписаниеТипов);  		
				
			КонецЦикла;
			
			
			МассивТипаВыбора = Новый Массив;
			
			МассивТипаВыбора.Добавить(Тип("ТаблицаЗначений"));
			
			
			ОписаниеТипаВыбора = Новый ОписаниеТипов(МассивТипаВыбора);
			
			МассивРеквизитов = Новый Массив;
			
			МассивРеквизитов.Добавить(Новый РеквизитФормы("ТаблицаДанных", ОписаниеТипаВыбора, "", "ТаблицаДанных"));
			
			Для каждого Колонка  Из ТЧ.Колонки Цикл
				
				МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения,"ТаблицаДанных"));
				
			КонецЦикла;
			
			ИзменитьРеквизиты(МассивРеквизитов); 
			
			ТаблицаПолейВыбора = Элементы.Добавить("ТаблицаДанных", Тип("ТаблицаФормы"));
			ТаблицаПолейВыбора.ПутьКДанным = "ТаблицаДанных";
			ТаблицаПолейВыбора.Отображение = ОтображениеТаблицы.Список;
			ТаблицаПолейВыбора.ИзменятьСоставСтрок = Ложь; 
			
			Для Каждого Колонка Из ТЧ.Колонки Цикл    			
				
				НовыйЭлемент = Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), ТаблицаПолейВыбора);       
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.ПутьКДанным = "ТаблицаДанных." + Колонка.Имя;
				
			КонецЦикла;
			
			
			Для каждого ЭлементМассива Из ЗначениеМассивДанных Цикл
				
				НоваяСтрока = ЭтаФорма.ТаблицаДанных.Добавить(); 
				ЗаполнитьЗначенияСвойств(НоваяСтрока,ЭлементМассива); 				
			
			КонецЦикла;
			
		КонецЕсли;  		
				
	КонецЕсли;
	
КонецПроцедуры

