Перем ЕстьИзменения;
Перем НадоПерезаписывать;

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	НадоПерезаписывать	=Ложь;
	ЕстьИзменения			=Модифицированность();	
	
	Если Организация.Пустая() Тогда
		Сообщить("Не заполено поле организация!");
		Отказ=истина;
	КонецЕсли;	
	
	Для каждого Сотр из Сотрудники цикл
		
		Если Сотр.сотрудник = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
			Сообщить("По строке "+Сотр.номерСтроки+" - не заполено поле сотрудник!");
			Отказ=истина;
        КонецЕсли;
		
			Если Сотр.ДатаДоверенности = дата(1,1,1) Тогда
			Сообщить("По строке "+Сотр.номерСтроки+" - не заполено поле дата доверенности!");
			Отказ=истина;
        КонецЕсли;

			Если Сотр.ДатаОкончанияДействияДоверенности = дата(1,1,1) Тогда
			Сообщить("По строке "+Сотр.номерСтроки+" - не заполено поле дата окончания доверенности!");
			Отказ=истина;
        КонецЕсли;
   	
	            
	КонецЦикла;
	
	Для каждого Сотр из МЧД цикл
		
		Если Сотр.сотрудник = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
			Сообщить("По строке МЧД"+Сотр.номерСтроки+" - не заполено поле сотрудник!");
			Отказ=истина;
        КонецЕсли;
		
			Если Сотр.ДатаНачала = дата(1,1,1) Тогда
			Сообщить("По строке МЧД "+Сотр.номерСтроки+" - не заполено поле дата доверенности!");
			Отказ=истина;
        КонецЕсли;

		Если Сотр.ДатаОкончания = дата(1,1,1) Тогда
			Сообщить("По строке МЧД "+Сотр.номерСтроки+" - не заполено поле дата окончания доверенности!");
			Отказ=истина;
        КонецЕсли;
   	
	    Если Сотр.ИнфСистема = "" Тогда
			Сообщить("По строке МЧД "+Сотр.номерСтроки+" - не заполено поле информационная система!");
			Отказ=истина;
        КонецЕсли;
		
		Если Сотр.MchdFileName = "" Тогда
			Сообщить("По строке МЧД "+Сотр.номерСтроки+" - не заполено имя файла МЧД!");
			Отказ=истина;
        КонецЕсли;
		
		Если Сотр.MchdFile.Получить() = неопределено Тогда
			Сообщить("По строке МЧД "+Сотр.номерСтроки+" - не заполен файл МЧД!");
			Отказ=истина;
        КонецЕсли;
		
		Если Сотр.MchdSignature.Получить() = неопределено Тогда
			Сообщить("По строке МЧД "+Сотр.номерСтроки+" - не заполен файл подписи МЧД!");
			Отказ=истина;
        КонецЕсли;

		
		
	КонецЦикла;

	
	Если НЕ ОбменДанными.Загрузка Тогда
		//КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ);	
		
		Если Отказ Тогда Возврат КонецЕсли;
		
	КонецЕсли;
	
	
	Если НЕ ЕстьИзменения Тогда Возврат КонецЕсли;
	
	
	КонецПроцедуры

Процедура ПриЗаписи(Отказ)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	Если Не Отказ Тогда
		
		Для Каждого Сотр из Сотрудники цикл
			
			Запись				=РегистрыСведений.ДоверенностиНаПодпись.СоздатьМенеджерЗаписи();
			Запись.Период		=Дата;
			Запись.ДатаДоверенности		=Сотр.ДатаДоверенности;
			Запись.ДатаОкончанияДействияДоверенности	=Сотр.ДатаОкончанияДействияДоверенности;
			Запись.Сотрудник		=сотр.Сотрудник;
			Запись.Организация		=организация;
			Запись.Документ		=Ссылка;
			Запись.НомерДоверенности =Сотр.НомерДоверенности;
			Запись.Регистратор	=ссылка;
			
			Запись.Записать();
			
		конецЦикла;	
		Для Каждого Сотр из МЧД  цикл
			
			Запись				=РегистрыСведений.НомераМЧД.СоздатьМенеджерЗаписи();
			Запись.Период		=Сотр.ДатаНачала;
			Запись.ДатаНачала		=Сотр.ДатаНачала;
			Запись.ДатаОкончания	=Сотр.ДатаОкончания;
			Запись.ФизЛицо		=сотр.Сотрудник;
			Запись.Организация		=организация;
			Запись.Документ		=Ссылка;
			Запись.НомерМЧД =Сотр.НомерМЧД;
			Запись.регистратор	=ссылка;
			запись.MchdFile = сотр.MchdFile;
			запись.MchdFileName = сотр.MchdFileName;
			запись.MchdSignature = сотр.MchdSignature;
			запись.ИнфСистема = сотр.ИнфСистема;
			запись.ПутьКфайлуМЧД = сотр.ПутьКфайлуМЧД;
						
			Запись.Записать();
			
		конецЦикла;	
	конецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	Набор=РегистрыСведений.ДоверенностиНаПодпись.СоздатьНаборЗаписей();
	Набор.Отбор.документ.Установить(Ссылка);
	Набор.Записать();
	
	Набор=РегистрыСведений.НомераМЧД.СоздатьНаборЗаписей();
	Набор.Отбор.документ.Установить(Ссылка);
	Набор.Записать();
 		
КонецПроцедуры
