
&НаСервере
Процедура СозданиеНовогоЗаданияНаВыгрузкуНаСервере() 
	
	ОбОбъект = РеквизитФормыВЗначение("Объект"); 
	
	МетодHTTP = "POST"; 
	
	АдресРесурса	= "api/v3/true-api/dispenser/tasks"; 
	
	ОбработкаАПИЧЗ = Обработки.АпиЧЗ.Создать();
	ТелоЗапроса = "" ; 	
	
	СтруктураЗапросаНовогоЗадания = Новый Структура; 
	СтруктураЗапросаНовогоЗадания.Вставить("name","Отчёт по ошибкам в УПД_" + Формат(ТекущаяДатаСеанса(),"ДФ=yyyy_MM_dd_чч_мм_сс")); 
	СтруктураЗапросаНовогоЗадания.Вставить("taskTypeShortName","REPORT");
	СтруктураЗапросаНовогоЗадания.Вставить("format","CSV");
	СтруктураЗапросаНовогоЗадания.Вставить("periodicity","SINGLE");
	СтруктураЗапросаНовогоЗадания.Вставить("reportId","upd-error");
	СтруктураЗапросаНовогоЗадания.Вставить("productGroupCode",1);
	
	
	//только обязательные 
	ПараметрыОтчета = Новый Соответствие; 
	ПараметрыОтчета.Вставить("0156_IC_Agg_120_upd_error","agg_statistics"); 
	ПараметрыОтчета.Вставить("0202_IC_Date_From",Формат(Период.ДатаНачала,"ДФ=yyyy-MM-dd")); 
	ПараметрыОтчета.Вставить("0203_IC_Date_To",Формат(Период.ДатаОкончания,"ДФ=yyyy-MM-dd"));
	
	ПараметрыОтчетаСтрока = ОбработкаАПИЧЗ.ЗаписатьЖСОН(ПараметрыОтчета); 
	
	СтруктураЗапросаНовогоЗадания.Вставить("params",ПараметрыОтчетаСтрока);
	
	ТелоЗапроса =  ОбработкаАПИЧЗ.ЗаписатьЖСОН(СтруктураЗапросаНовогоЗадания);
	
	рЗапроса = ОбОбъект.ОтправитьЗапросВЧЗ(АдресРесурса,МетодHTTP,ТелоЗапроса); 
	
	КодСостояния = рЗапроса.КодСостояния; 
	Ответ 		=  рЗапроса.Ответ; 
	
	ОтветСтрока1 = Строка(КодСостояния)   + Символы.ПС + ответ;  
	
	Если рЗапроса.Успешно Тогда		
		Данные	= ОбработкаАПИЧЗ.ПрочитатьЖСОН(рЗапроса.Ответ);
		IDЗадания =  Данные.id;
	Иначе 
		IDЗадания = ""; 
	КонецЕсли;

		
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеНовогоЗаданияНаВыгрузку(Команда)
	СозданиеНовогоЗаданияНаВыгрузкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверкаСтатусаЗаданияНаВыгрузкуНаСервере()
	
	Если НЕ ЗначениеЗаполнено(IDЗадания) Тогда
		
		Сообщить("Заполните ID Задания"); 
		
		Возврат; 	
		
	КонецЕсли;

	ОбОбъект = РеквизитФормыВЗначение("Объект");
	
	МетодHTTP = "GET"; 
	
	АдресРесурса	= "api/v3/true-api/dispenser/tasks/"+ Строка(IDЗадания) + "?page=0&size=4&pg=1"; 
	
	рЗапроса = ОбОбъект.ОтправитьЗапросВЧЗ(АдресРесурса,МетодHTTP,""); 
	
	КодСостояния 	= рЗапроса.КодСостояния; 
	Ответ 			=  рЗапроса.Ответ;
	
	ОтветСтрока2 = Строка(КодСостояния)   + Символы.ПС + ответ;
	
	ОбработкаАПИЧЗ = Обработки.АпиЧЗ.Создать(); 
	
	Если рЗапроса.Успешно Тогда		
		Данные	= ОбработкаАПИЧЗ.ПрочитатьЖСОН(рЗапроса.Ответ);
		Статус =  Данные.currentStatus;
	Иначе 
		Статус = ""; 
	КонецЕсли;

		

КонецПроцедуры

&НаКлиенте
Процедура ПроверкаСтатусаЗаданияНаВыгрузку(Команда)
	ПроверкаСтатусаЗаданияНаВыгрузкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьРезультирующееIDНаСервере()
	
	ОбОбъект = РеквизитФормыВЗначение("Объект");
	
	МетодHTTP = "GET"; 
	
	АдресРесурса	= "api/v3/true-api/dispenser/results?page=0&pg=1&size=1"; //&task_ids[0]="""+Строка(IDЗадания) + """"; //&task_ids=["+Строка(IDЗадания)+"]";
	
	//АдресРесурса	= "api/v3/true-api/dispenser/results?page=0&pg=1&size=1&task_ids[0]="+Строка(IDЗадания);                  //&task_ids=[" +Строка(IDЗадания)+"]";  
	
	//"; //&task_ids[0]="""+Строка(IDЗадания) + """"; //&task_ids=["+Строка(IDЗадания)+"]";
	
	рЗапроса = ОбОбъект.ОтправитьЗапросВЧЗ(АдресРесурса,МетодHTTP,""); 
	
	КодСостояния 	= рЗапроса.КодСостояния; 
	Ответ 			=  рЗапроса.Ответ;
	
	ОтветСтрока3 = Строка(КодСостояния)   + Символы.ПС + ответ; 
		
	//Сообщить(АдресРесурса);
	
	ОбработкаАПИЧЗ = Обработки.АпиЧЗ.Создать(); 
	Если рЗапроса.Успешно Тогда
		
		Если НЕ ЗначениеЗаполнено(IDЗадания) Тогда
			
			Сообщить("Заполните ID Задания"); 
			
			Возврат; 	
			
		КонецЕсли;

		Данные	= ОбработкаАПИЧЗ.ПрочитатьЖСОН(рЗапроса.Ответ);
				
		МассивДанные =  Данные.list;
		Для каждого СтрокаМассива Из МассивДанные Цикл
			
			Если СтрокаМассива.taskId = IDЗадания Тогда
				
				IDОсновной = СтрокаМассива.id; 	
				
			КонецЕсли;	
			
		КонецЦикла;
	Иначе 
		IDОсновной = ""; 
	КонецЕсли;

	  
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьРезультирующееID(Команда)
	ПолучитьРезультирующееIDНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьСамФайлНаСервере()  
	
	Если НЕ ЗначениеЗаполнено(IDОсновной) Тогда
		
		Сообщить("Заполните ID для загрузки файла"); 
		
		Возврат; 	
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПутьКФайлу) Тогда
		
		Сообщить("Заполните путь к файлу"); 
		
		Возврат; 	
		
	КонецЕсли;

	
	
	ОбОбъект = РеквизитФормыВЗначение("Объект");
	
	МетодHTTP = "GET"; 
	
	АдресРесурса	= "api/v3/true-api/dispenser/results/"+ IDОсновной + "/file?pg=1"; 
	
	 
	рЗапроса = ОбОбъект.ОтправитьЗапросВЧЗ(АдресРесурса,МетодHTTP,"",истина); 
	
	КодСостояния 	= рЗапроса.КодСостояния; 
	ОтветСервера 			=  рЗапроса.Ответ;
	
	ДД = ПолучитьИзВременногоХранилища(ОтветСервера); 
	
	ПутьКФайлу = СокрЛП(ПутьКФайлу); 
	Если Прав(ПутьКФайлу,1) <> "\" Тогда
		ПутьКФайлу = ПутьКФайлу + "\"; 	 
	КонецЕсли;
	
	ИмяФайла = "ОтчетПоошибкам_"+Год(ТекущаяДата())+"_"+месяц(ТекущаяДата())+"_"+День(ТекущаяДата())+"_"+Час(ТекущаяДата())+"_"+минута(ТекущаяДата());
	ПолноеИмя = ПутьКФайлу +ИмяФайла+".zip";	
	
	ДД.Записать(ПолноеИмя); 

	Сообщить("Файл записан");

КонецПроцедуры 

Функция РаспаковатьZIPАрхив(СтрокаZIP)
	
	СтрокаСодержимого = "ZIP_ERROR";
	
	ИмяФайла    = ПолучитьИмяВременногоФайла("zip");
	ИмяКаталога = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор);
	СоздатьКаталог(ИмяКаталога);
	
	СтрокаВФайл = Новый ТекстовыйДокумент;
	СтрокаВФайл.УстановитьТекст(СтрокаZIP);
	Попытка
		СтрокаВФайл.Записать(ИмяФайла);
	Исключение
	КонецПопытки;
	
	ЧтениеZIP = Новый ЧтениеZIPФайла(ИмяФайла);
	ЧтениеZIP.ИзвлечьВсе(ИмяКаталога);
	ЧтениеZIP.Закрыть();
	
	РаспакованныеФайлы = НайтиФайлы(ИмяКаталога, "*.xml");
	
	Если РаспакованныеФайлы.Количество() = 1 Тогда
		СтрокаИзФайла 	  = Новый ТекстовыйДокумент;
		СтрокаИзФайла.Прочитать(РаспакованныеФайлы[0].ПолноеИмя);
		СтрокаСодержимого = СтрокаИзФайла.ПолучитьТекст();
	КонецЕсли;
	
	Попытка
		УдалитьФайлы(ИмяФайла);
		УдалитьФайлы(ИмяКаталога);
	Исключение
	КонецПопытки;
	
	Возврат СтрокаСодержимого;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьСамФайл(Команда)
	ПолучитьРезультирующееIDНаСервере();
	ПолучитьСамФайлНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	РежимДиалога = РежимДиалогаВыбораФайла.ВыборКаталога;	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалога);		
	ДиалогВыбораФайла.Заголовок = НСтр("ru='Выберите каталог'");  
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ПутьКФайлу = ДиалогВыбораФайла.Каталог; 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСамФайлНаКлиентеНаСервере()
	ОбОбъект = РеквизитФормыВЗначение("Объект");
	
	МетодHTTP = "GET"; 
	
	АдресРесурса	= "api/v3/true-api/dispenser/results/"+ IDОсновной + "/file?pg=1"; 
	
	 
	рЗапроса = ОбОбъект.ОтправитьЗапросВЧЗ(АдресРесурса,МетодHTTP,"",истина); 
	
	КодСостояния 	= рЗапроса.КодСостояния; 
	ОтветСервера 			=  рЗапроса.Ответ;
	
	ДД = ПолучитьИзВременногоХранилища(ОтветСервера);
	
	Возврат ДД; 

КонецФункции

&НаКлиенте
Процедура ПолучитьСамФайлНаКлиенте(Команда)
	
	ПолучитьРезультирующееIDНаСервере();
	
	Если НЕ ЗначениеЗаполнено(IDОсновной) Тогда
		
		Сообщить("Заполните ID для загрузки файла"); 
		
		Возврат; 	
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПутьКФайлу) Тогда
		
		Сообщить("Заполните путь к файлу"); 
		
		Возврат; 	
		
	КонецЕсли;


	ДД = ПолучитьСамФайлНаКлиентеНаСервере();
	
	ПутьКФайлу = СокрЛП(ПутьКФайлу); 
	Если Прав(ПутьКФайлу,1) <> "\" Тогда
		ПутьКФайлу = ПутьКФайлу + "\"; 	 
	КонецЕсли;
	
	ИмяФайла = "ОтчетПоошибкам_"+Год(ТекущаяДата())+"_"+месяц(ТекущаяДата())+"_"+День(ТекущаяДата())+"_"+Час(ТекущаяДата())+"_"+минута(ТекущаяДата());
	ПолноеИмя = ПутьКФайлу +ИмяФайла+".zip";	
	
	ДД.Записать(ПолноеИмя);
	Сообщить("Файл записан"); 
КонецПроцедуры
