Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения		=Модифицированность();	
	НужноВыгружать		=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);

	Если Отказ Тогда Возврат КонецЕсли;	
	
	Если НЕ ОбменДанными.Загрузка Тогда
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
		Если Отказ Тогда Возврат КонецЕсли; 	
	КонецЕсли;
	
	Если ЕстьИзменения Тогда 
		СуммаДокумента=ДС.Итог("Сумма");	
	КонецЕсли;	
	
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);		
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт	
	Если ВводОстатков Тогда Возврат КонецЕсли; 
	
	Если Обнулять Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|	БанковскийСчет,
		|	Валюта,
		|	СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.ДенежныеСредства.Остатки(&Дата2,БанковскийСчет ССЫЛКА Справочник.Кассы И БанковскийСчет.Владелец=&Подразделение)";		
		
		СписокСчетов=ДС.ВыгрузитьКолонку("БанковскийСчет");
		СписокСчетов.Добавить(Справочники.БанковскиеСчета.ПустаяСсылка());
		СписокСчетов.Добавить(Справочники.Кассы.ПустаяСсылка());
		СписокСчетов.Добавить(Неопределено);
		
		Запрос.УстановитьПараметр("Дата2",МоментВремени());
		Запрос.УстановитьПараметр("СписокСчетов",СписокСчетов);
		Запрос.УстановитьПараметр("Подразделение",Подразделение);		
		
		Выборка=Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Движение=Движения.ДенежныеСредства.Добавить();		
			
			Движение.Период			=Дата;
			
			Движение.ВидДвижения	=ВидДвиженияНакопления.Приход;		
			
			Движение.БанковскийСчет	=Выборка.БанковскийСчет;
			Движение.Валюта			=Выборка.Валюта;
			
			Движение.Сумма			=-Выборка.Сумма;		
		КонецЦикла;		
	КонецЕсли; 
	
	Доллары				=Справочники.Валюты.НайтиПоКоду("840");
	Рубли				=Справочники.Валюты.НайтиПоКоду("810");
	Евро				=Справочники.Валюты.НайтиПоКоду("978");
	
	Для Каждого СтрокаТЧ Из ДС Цикл		
		Движение=Движения.ДенежныеСредства.Добавить();
		
		Движение.Период			=Дата;
		
		Движение.ВидДвижения	=ВидДвиженияНакопления.Приход;
		
		Движение.БанковскийСчет	=СтрокаТЧ.БанковскийСчет;
		Движение.Валюта			=СтрокаТЧ.Валюта;
		
		Если НЕ ТолькоУпрСуммы Тогда
			Движение.Сумма		=СтрокаТЧ.Сумма;
		КонецЕсли;		
		Движение.СуммаУпр		=СтрокаТЧ.СуммаУпр;
		
		Движение.СтатьяДДС		=Справочники.СтатьиЗатрат.ВводОстатков;
		Движение.Комментарий = "Ввод остатков ДС. "+Комментарий;
		
		Движение.СуммаДокумента	=СтрокаТЧ.Сумма;
		Движение.ВалютаДокумента=СтрокаТЧ.Валюта;
	КонецЦикла; 
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки

	Если ОбменДанными.Загрузка Тогда
		Движения.ДенежныеСредства.Записать();	
	КонецЕсли; 
КонецПроцедуры
