Процедура ЗаполнитьЗаявкуНаОтгрузку() Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	""РНК"" КАК Вид,
	|	Ссылка,
	|	СостояниеНакладной
	|ИЗ
	|	Документ.РасходнаяНакладная КАК Накладная
	|ГДЕ
	|	Дата Между &Дата1 И &Дата2
	|	И Проведен	
	|	И Отгружен 				В (&Отгружен)	
	|//УСЛОВИЕ_ПО_СОСТОЯНИЮ
	|	И Склад					= &Склад
	|	И ДатаОтгрузки			= &ДатаОтгрузки	
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	""ПРМ"" КАК Вид,
	|	Ссылка,
	|	СостояниеНакладной
	|ИЗ
	|	Документ.Перемещение КАК Перемещение
	|ГДЕ
	|	Дата Между &Дата1 И &Дата2
	|	И Проведен	
	|	И Отгружен 				В (&Отгружен)
	|//УСЛОВИЕ_ПО_СОСТОЯНИЮ
	|	И Склад					= &Склад
	|	И ДатаОтгрузки			= &ДатаОтгрузки
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	""ЗТО"" КАК Вид,
	|	Ссылка,
	|	СостояниеНакладной
	|ИЗ
	|	Документ.ЗаявкаВТранспортныйОтдел КАК ЗТО
	|ГДЕ
	|	Дата Между &Дата1 И &Дата2
	|	И Проведен
	|	И СостояниеНакладной		= ЗНАЧЕНИЕ(Перечисление.СостоянияЗаявокВТранспортныйОтдел.КОтгрузке)
	|	И 
	|		(
	|			(Отправитель ССЫЛКА Справочник.Склады И Получатель ССЫЛКА Справочник.Склады И Отправитель=&Склад)
	|			ИЛИ 
	|			((Отправитель ССЫЛКА Справочник.Контрагенты ИЛИ Получатель ССЫЛКА Справочник.Контрагенты) И (Отправитель=&Склад ИЛИ Получатель=&Склад))
	|		)
	|	И ДатаОтгрузки			= &ДатаОтгрузки	
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	""ПНК"" КАК Вид,
	|	Ссылка,
	|	СостояниеНакладной
	|ИЗ
	|	Документ.ПриходнаяНакладная КАК Накладная
	|ГДЕ
	|	Дата Между &Дата1 И &Дата2
	|	И Проведен
	|	И Склад						= &Склад
	|	И ДатаОтгрузки				= &ДатаОтгрузки	
	// Кухарь А.Ю.  04.10.2022 начало
	//
	////крохин начало 13.02.2013
	////ПНК "в работе" больше не добавляем в ЗОГ
	//|	И СостояниеНакладной		<>ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.ВРАБОТЕ)
	////крохин конец 13.02.2013
	//|	И СостояниеНакладной		<>ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.Принята)";
	|	И не СостояниеНакладной в (&СписокНедопустимыхСостояний)";
	// Кухарь А.Ю.  04.10.2022 конец
	
	
	
	// Кухарь А.Ю.  04.10.2022 начало
	// Запрос.УстановитьПараметр("ВРаботе",	Перечисления.СостоянияНакладной.ВРаботе);
	СписокНедопустимыхСостояний=новый СписокЗначений;
	СписокНедопустимыхСостояний.Добавить(Перечисления.СостоянияНакладной.ВРаботе);
	СписокНедопустимыхСостояний.Добавить(Перечисления.СостоянияНакладной.Отменена);
	СписокНедопустимыхСостояний.Добавить(Перечисления.СостоянияНакладной.Принята);
	
	Запрос.УстановитьПараметр("СписокНедопустимыхСостояний",	СписокНедопустимыхСостояний);
	// Кухарь А.Ю.  04.10.2022 конец
	
	Запрос.УстановитьПараметр("Дата1",			ДокОбъект.Дата-30*24*60*60);
	Запрос.УстановитьПараметр("Дата2",			КонецДня(ДокОбъект.Дата));
	Запрос.УстановитьПараметр("Склад",			ДокОбъект.Склад);
	Запрос.УстановитьПараметр("ДатаОтгрузки",	НачалоДня(ДокОбъект.Дата));
	
	Отгружен=Новый Массив;
	Отгружен.Добавить(Перечисления.Отгружен.Резерв);
	Отгружен.Добавить(Перечисления.Отгружен.ОтгруженТранзит);
	
	Запрос.УстановитьПараметр("Отгружен",		Отгружен);	
	
	Запрос.УстановитьПараметр("Состояние_ВРаботе",			Перечисления.СостоянияНакладной.ВРаботе);
	Запрос.УстановитьПараметр("Состояние_ГотоваКОтгрузке",	Перечисления.СостоянияНакладной.ГотоваКОтгрузке);	
	Если 1=2 Тогда
		ДокОбъект=Документы.ЗаявкаНаОтгрузку.СоздатьДокумент();	
	КонецЕсли; 
	
	//кухарь 28.05.14 начало
	//добавил попытку
	попытка
		//кухарь 13.05.14 начало
		//Если ДокОбъект.ВидЗаявки=Перечисления.ВидыЗавокНаОтргузку.Предварительная  Тогда
		Если ДокОбъект.ВидЗаявки=Перечисления.ВидыЗавокНаОтргузку.Предварительная и ДокОбъект.ссылка.получитьобъект().видзаявки<>Перечисления.ВидыЗавокНаОтргузку.Вспомогательная  Тогда
			ДокОбъект.Накладные.Очистить();		
		КонецЕсли;	
		//кухарь 13.05.14 конец
	Исключение
		Если ДокОбъект.ВидЗаявки=Перечисления.ВидыЗавокНаОтргузку.Предварительная  Тогда
			ДокОбъект.Накладные.Очистить();		
		КонецЕсли;	
	КонецПопытки;
	//кухарь 28.05.14 конец

	
	
	Для Каждого СтрокаТЧ Из ДокОбъект.Накладные Цикл
		//крохин начало
		//Если СтрокаТЧ.Накладная.ДатаОтгрузки<>НачалоДня(ДокОбъект.Дата) ИЛИ СтрокаТЧ.Накладная.ПометкаУдаления Тогда
		Если СтрокаТЧ.Накладная.ДатаОтгрузки<>НачалоДня(ДокОбъект.Дата) ИЛИ НЕ СтрокаТЧ.Накладная.Проведен Тогда
			//крохин конец
			СтрокаТЧ.НеОтгружать=Истина;
			ЗаписатьВЛог("Формирование ЗОГ","Снят с отгрузки документ. Неверная дата отгрузки "+СтрокаТЧ.Накладная,"Информация");
		КонецЕсли;	
	КонецЦикла;	
	
	Выборка=Запрос.Выполнить().Выбрать();
	//Катаев+ 09/10/14 Для РМТ
	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("Контрагент");
	тз.Колонки.Добавить("ПунктДоставки");
	тз.Колонки.Добавить("Склад");
	тз.Колонки.Добавить("РНК");
	//Катаев- 09/10/14
	Пока Выборка.Следующий() Цикл		
		СтрокаТЧ=ДокОбъект.Накладные.Найти(Выборка.Ссылка,"Накладная");
		Если СтрокаТЧ=Неопределено Тогда
			СтрокаТЧ=ДокОбъект.Накладные.Добавить();		
			Если ДокОбъект.ВидЗаявки=Перечисления.ВидыЗавокНаОтргузку.Окончательная Тогда
				СтрокаТЧ.НеОтгружать=Истина;
				//крохин начало 21.03.2011
				//запишем, какая накладная и в каком ЗОГе искалась
				//ЗаписатьВЛог("Формирование ЗОГ","Снят с отгрузки документ. Отсутствовал в предварительной заявке "+СтрокаТЧ.Накладная,"Информация");
				ЗаписатьВЛог("Формирование ЗОГ","Снят с отгрузки документ "+ Выборка.Ссылка +". Отсутствовал в предварительной заявке "+ДокОбъект,"Информация");
				//крохин конец 21.03.2011
			КонецЕсли;
			//кухарь 15.03.15 начало
			//будем галку снимать если зог был или стал вспомогательным. Их могут формировать логисты заранее. 
		ИначеЕсли ДокОбъект.ссылка <> Документы.ЗаявкаНаОтгрузку.ПустаяСсылка() тогда
			//Кухарь 25.05.17 начало
			//Опечатка
			//если ДокОбъект.Ссылка.ПолучитьОбъект().ВидЗаявки<>Перечисления.ВидыЗавокНаОтргузку.Вспомогательная или  ДокОбъект.ВидЗаявки<>Перечисления.ВидыЗавокНаОтргузку.Вспомогательная тогда
			если ДокОбъект.Ссылка.ПолучитьОбъект().ВидЗаявки=Перечисления.ВидыЗавокНаОтргузку.Вспомогательная или  ДокОбъект.ВидЗаявки=Перечисления.ВидыЗавокНаОтргузку.Вспомогательная тогда
				//Кухарь 25.05.17 начало

				если СтрокаТЧ.Накладная.СостояниеНакладной<>Перечисления.СостоянияНакладной.ВРаботе и СтрокаТЧ.Накладная.Проведен и СтрокаТЧ.Накладная.ДатаОтгрузки=ДокОбъект.ДатаОтгрузки тогда
					СтрокаТЧ.НеОтгружать=Ложь;
				КонецЕсли;
			КонецЕсли;		
			//кухарь 15.03.15 конец
		КонецЕсли;
		
		ДокОбъект.ЗаполнитьСтрокуПоНакладной(СтрокаТЧ,Выборка.Ссылка);
		Если (Выборка.Вид="РНК" ИЛИ Выборка.Вид="ПРМ") И Выборка.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе Тогда
			СтрокаТЧ.НеОтгружать=Истина;		
			ЗаписатьВЛог("Формирование ЗОГ","Снят с отгрузки документ. Состояние 'в работе' "+СтрокаТЧ.Накладная,"Информация");
		КонецЕсли; 
		//Катаев+ 09/10/14 Для РМТ
		Если Выборка.Вид = "РНК" Тогда
			стрТз = тз.Добавить();
			стрТз.Контрагент = СтрокаТЧ.Накладная.Контрагент;
			стрТз.ПунктДоставки = СтрокаТЧ.Накладная.ПунктДоставки;
			стрТз.Склад = СтрокаТЧ.Накладная.Склад;
			стрТз.РНК = СтрокаТЧ.Накладная.Ссылка;
		КонецЕсли;
		//Катаев- 09/10/14
	КонецЦикла;
	
	
	
	//Катаев+ 09/10/14 Заполняем строчки в ЗОГ в связке РМТ+РНК
	тз1 = тз.Скопировать();
	тз1.Свернуть("Контрагент, ПунктДоставки, Склад");
	ЗапросРМТ = Новый запрос;
	ЗапросРМТ.Текст =
	"ВЫБРАТЬ
	|	""РМТ"" КАК Вид,
	|	РасходМатериаловИТары.Ссылка,
	|	РасходМатериаловИТары.СостояниеНакладной
	|ИЗ
	|	Документ.РасходМатериаловИТары КАК РасходМатериаловИТары
	|ГДЕ
	|	РасходМатериаловИТары.Проведен
	|	И РасходМатериаловИТары.Склад = &Склад
	|	И РасходМатериаловИТары.ДатаОтгрузки = &ДатаОтгрузки
	|	И РасходМатериаловИТары.Контрагент = &Контрагент
	|	И РасходМатериаловИТары.ПунктДоставки = &ПунктДоставки"	;
	ЗапросРМТ.УстановитьПараметр("ДатаОтгрузки",	НачалоДня(ДокОбъект.Дата));
	Для Каждого стр из тз1 Цикл
		ЗапросРМТ.УстановитьПараметр("Склад", стр.Склад);
		ЗапросРМТ.УстановитьПараметр("Контрагент", стр.Контрагент);
		ЗапросРМТ.УстановитьПараметр("ПунктДоставки", стр.ПунктДоставки);
		ВыборкаРМТ = ЗапросРМТ.Выполнить().Выбрать();
		Пока ВыборкаРМТ.Следующий() Цикл
			СтрокаТЧ=ДокОбъект.Накладные.Добавить();
			Отбор = Новый Структура;
			Отбор.Вставить("Контрагент", стр.Контрагент);
			Отбор.Вставить("ПунктДоставки", стр.ПунктДоставки);
			Отбор.Вставить("Склад", стр.Склад);
			сзРНК = тз.НайтиСтроки(Отбор);
			РНК = сзРНК[0].РНК;
			ДокОбъект.ЗаполнитьСтрокуПоНакладной(СтрокаТЧ,ВыборкаРМТ.Ссылка, РНК);
		КонецЦикла;
	КонецЦИкла;
	//Катаев- 09/10/14
	
КонецПроцедуры
