Функция ТекущаяУниверсальнаяДатаВМиллисекундахНаСервере() Экспорт
	Возврат ТекущаяУниверсальнаяДатаВМиллисекундах()+ОценкаПроизводительностиВызовСервераПовтИсп.СмещениеОтСтандартногоВремени();	
КонецФункции //ТекущаяУниверсальнаяДатаВМиллисекундах() Экспорт

// Функция записи массива замеров 
//
// Параметры:
//  Замеры - Массив элементов типа Структура.
//
// Возвращаемое значение:
// 	Число - текущее значение периода записи замеров на сервере в секундах в случае записи замеров.
//
Функция ЗафиксироватьДлительностьКлючевыхОпераций(ЗамерыДляЗаписи) Экспорт
	
	ПериодЗаписи = ОценкаПроизводительности.ПериодЗаписи();
	
	Если МонопольныйРежим() Тогда
		Возврат ПериодЗаписи;
	КонецЕсли;
	
	
	// Кухарь А.Ю.  04.04.2025 начало
	// Если НЕ Константы.ВыполнятьЗамерыПроизводительности.Получить() Тогда
	Если ОбщегоНазначения_ПИ.ПолучитьЗначениеКонстанты("ВыполнятьЗамерыПроизводительности") Тогда 
		// Кухарь А.Ю.  04.04.2025 конец
		
		Возврат ПериодЗаписи;
	КонецЕсли;
		
	Замеры = ЗамерыДляЗаписи.ЗамерыЗавершенные;
	ИнформацияПрограммыПросмотра = ЗамерыДляЗаписи.ИнформацияПрограммыПросмотра;
	
	НаборЗаписей 				= РегистрыСведений.ЗамерыВремени.СоздатьНаборЗаписей();
	НаборЗаписейТехнологический = РегистрыСведений.ЗамерыВремениТехнологические.СоздатьНаборЗаписей();
	
	НомерСеанса				= НомерСоединенияИнформационнойБазы();	
	ДатаЗаписи 				= Дата(1,1,1) + ОценкаПроизводительностиКлиентСервер.ПолучитьТекущуюУниверсальнуюДатуВМиллисекундах()/1000;	
	ДатаЗаписиНачалоЧаса	= НачалоЧаса(ДатаЗаписи);
	Пользователь			= ПараметрыСеанса.Пользователь;
	
	ДатаЗаписиЛокальная 	= ТекущаяДата();
	
	КомментарийПоУмолчанию  = ЗначениеИзСтрокиВнутр(ПараметрыСеанса.КомментарийЗамераВремени);
	КомментарийПоУмолчанию.Вставить("ИнфКл", ИнформацияПрограммыПросмотра);	
	КомментарийПоУмолчаниюСтрока = ЗначениеВСтрокуВнутр(КомментарийПоУмолчанию);
		
	Для Каждого Замер Из Замеры Цикл
		ПараметрыЗамера = Замер.Значение;
		Длительность = (ПараметрыЗамера["ВремяОкончания"] - ПараметрыЗамера["ВремяНачала"])/1000;
		Длительность = ?(Длительность = 0, 0.001, Длительность);
		
		Если ПараметрыЗамера["Технологический"] Тогда
			НоваяЗапись = НаборЗаписейТехнологический.Добавить();
		Иначе
			НоваяЗапись = НаборЗаписей.Добавить();
		КонецЕсли;
		
		КлючеваяОперация = ПараметрыЗамера["КлючеваяОперация"];
		ВыполненаСОшибкой = ПараметрыЗамера["ВыполненаСОшибкой"];
		
		Если НЕ ЗначениеЗаполнено(КлючеваяОперация) Тогда
			Продолжить;
		КонецЕсли;
				
		Если ТипЗнч(КлючеваяОперация) = Тип("Строка") Тогда
			КлючеваяОперацияСсылка = ОценкаПроизводительностиПовтИсп.ПолучитьКлючевуюОперациюПоИмени(КлючеваяОперация, ВыполненаСОшибкой);
		Иначе
			КлючеваяОперацияСсылка = КлючеваяОперация;
		КонецЕсли;		
		
		Если ПараметрыЗамера["Комментарий"] <> Неопределено Тогда
			КомментарийПоУмолчанию.Вставить("ДопИнф", ПараметрыЗамера["Комментарий"]);			
			КомментарийПоУмолчаниюСтрока = ЗначениеВСтрокуВнутр(КомментарийПоУмолчанию);
		КонецЕсли;
				
		НоваяЗапись.КлючеваяОперация = КлючеваяОперацияСсылка;
		НоваяЗапись.ДатаНачалаЗамера = ПараметрыЗамера["ВремяНачала"];
		НоваяЗапись.НомерСеанса = НомерСеанса;
		НоваяЗапись.ВремяВыполнения = Длительность;
		НоваяЗапись.ВесЗамера = ПараметрыЗамера["ВесЗамера"];
		НоваяЗапись.ДатаЗаписи = ДатаЗаписи;
		НоваяЗапись.ДатаЗаписиНачалоЧаса = ДатаЗаписиНачалоЧаса;
		НоваяЗапись.ДатаОкончания = ПараметрыЗамера["ВремяОкончания"];
		
		НоваяЗапись.Пользователь = Пользователь;
		НоваяЗапись.ДатаЗаписиЛокальная = ДатаЗаписиЛокальная;
		НоваяЗапись.Комментарий = КомментарийПоУмолчаниюСтрока;
		
		// Запись вложенных замеров.
		ВложенныеЗамеры = Замер.Значение["ВложенныеЗамеры"];
		Если ВложенныеЗамеры = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		УдельноеВремяОбщее = 0;
	
		Для Каждого ВложенныйЗамер Из ВложенныеЗамеры Цикл
			ДанныеЗамера = ВложенныйЗамер.Значение;
			ВесВложенногоЗамера = ДанныеЗамера["ВесЗамера"];
			ДлительностьВложенногоЗамера = ДанныеЗамера["Длительность"];
			КомментарийВложенногоЗамера = ДанныеЗамера["Комментарий"];
			КлючеваяОперацияВложенногоШага = КлючеваяОперация + "." + ВложенныйЗамер.Ключ;
			КлючеваяОперацияВложенногоШагаСсылка = ОценкаПроизводительностиПовтИсп.ПолучитьКлючевуюОперациюПоИмени(КлючеваяОперацияВложенногоШага, ВыполненаСОшибкой, Истина);
			УдельноеВремя = ?(ВесВложенногоЗамера = 0, ДлительностьВложенногоЗамера, ДлительностьВложенногоЗамера / ВесВложенногоЗамера);
			УдельноеВремяОбщее = УдельноеВремяОбщее + УдельноеВремя;
			
			Если КомментарийВложенногоЗамера <> Неопределено Тогда
				КомментарийПоУмолчанию.Вставить("ДопИнф", КомментарийВложенногоЗамера);				
				КомментарийШагаСтрока = ЗначениеВСтрокуВнутр(КомментарийПоУмолчанию);
			КонецЕсли;
		
			НоваяЗапись = НаборЗаписей.Добавить();
			
			НоваяЗапись.КлючеваяОперация	 	= КлючеваяОперацияВложенногоШагаСсылка;
			НоваяЗапись.ДатаНачалаЗамера 		= ДанныеЗамера["ВремяНачала"];
			НоваяЗапись.НомерСеанса				= НомерСеанса;
			НоваяЗапись.ВремяВыполнения			= УдельноеВремя/1000;
			НоваяЗапись.ВесЗамера 				= ВесВложенногоЗамера;
			НоваяЗапись.ДатаОкончания			= ДанныеЗамера["ВремяОкончания"];		
			НоваяЗапись.ДатаЗаписи				= ДатаЗаписи;
			НоваяЗапись.ДатаЗаписиНачалоЧаса	= ДатаЗаписиНачалоЧаса;						
			НоваяЗапись.Пользователь			= Пользователь;
			НоваяЗапись.ДатаЗаписиЛокальная		= ДатаЗаписиЛокальная;
			НоваяЗапись.Комментарий				= КомментарийШагаСтрока;
		КонецЦикла;
		// Фиксация удельного времени ключевой операции.
		Если ВложенныеЗамеры.Количество() > 0 Тогда
			КлючеваяОперацияУдельная = КлючеваяОперация + ".Удельный";
			КлючеваяОперацияУдельнаяСсылка = ОценкаПроизводительностиПовтИсп.ПолучитьКлючевуюОперациюПоИмени(КлючеваяОперацияУдельная, ВыполненаСОшибкой, Истина);
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.КлючеваяОперация = КлючеваяОперацияУдельнаяСсылка;
			НоваяЗапись.ДатаНачалаЗамера = ПараметрыЗамера["ВремяНачала"];
			НоваяЗапись.НомерСеанса = НомерСеанса;
			НоваяЗапись.ВремяВыполнения = УдельноеВремяОбщее/1000;
			НоваяЗапись.ВесЗамера = ПараметрыЗамера["ВесЗамера"];
			НоваяЗапись.ДатаЗаписи = ДатаЗаписи;
			НоваяЗапись.ДатаЗаписиНачалоЧаса = ДатаЗаписиНачалоЧаса;
			НоваяЗапись.ДатаОкончания = ПараметрыЗамера["ВремяОкончания"];		
			НоваяЗапись.Пользователь = Пользователь;
			НоваяЗапись.ДатаЗаписиЛокальная = ДатаЗаписиЛокальная;
			НоваяЗапись.Комментарий = КомментарийПоУмолчаниюСтрока;
		КонецЕсли;
	КонецЦикла;
	
	Если НаборЗаписей.Количество() > 0 Тогда
		Попытка
			НаборЗаписей.Записать(Ложь);
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Не удалось сохранить замеры производительности'", Метаданные.ОсновнойЯзык.КодЯзыка),
				УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
	Если НаборЗаписейТехнологический.Количество() > 0 Тогда
		Попытка
			НаборЗаписейТехнологический.Записать(Ложь);
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Не удалось сохранить технологические замеры производительности'", Метаданные.ОсновнойЯзык.КодЯзыка),
				УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
    КонецЕсли;
	
	ПараметрыСеанса.ВыполнятьЗамерыПроизводительности=Константы.ВыполнятьЗамерыПроизводительности.Получить();
	
	Возврат ПериодЗаписи;
	
КонецФункции

// Параметры оценки производительности
//
// Возвращаемое значение:
// 	Структура - параметры, полученные на сервере.
Функция ПолучитьПараметрыНаСервере() Экспорт
	
	Параметры = Новый Структура("ДатаИВремяНаСервере, ПериодЗаписи");
	#ЕСЛИ СЕРВЕР ТОГДА
		Параметры.ДатаИВремяНаСервере = ТекущаяУниверсальнаяДатаВМиллисекундахНаСервере();	
	#ИНАЧЕ
		Параметры.ДатаИВремяНаСервере = ТекущаяУниверсальнаяДатаВМиллисекундах();
	#КОНЕЦЕСЛИ		
	
	ТекущийПериод = Константы.ОценкаПроизводительностиПериодЗаписи.Получить();
	Параметры.ПериодЗаписи = ?(ТекущийПериод >= 1, ТекущийПериод, 60);
	
	Возврат Параметры;
	
КонецФункции
