
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//++Данилова Е.В. 10.11.2025 HELP-7558  
	ЗарегистрироватьНоменклатуруКОбменуНаСайт(Отказ); 
	//--Данилова Е.В. 10.11.2025
КонецПроцедуры

Процедура ЗарегистрироватьНоменклатуруКОбменуНаСайт(Знач Отказ)  	
	КоллантИМ = Справочники.ИнетМагазины.НайтиПоКоду("00007");
	Если ИнетМагазины.Найти(КоллантИМ,"ИнетМагазин") = Неопределено Тогда
		
		Возврат; 	
		
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НовинкиНовинки.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТТоварыНовинок
	|ИЗ
	|	&Новинки КАК НовинкиНовинки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТТоварыНовинок.Номенклатура КАК Номенклатура
	|ИЗ
	|	ВТТоварыНовинок КАК ВТТоварыНовинок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправочник
	|		ПО ВТТоварыНовинок.Номенклатура = НоменклатураСправочник.Ссылка
	|			И (НЕ НоменклатураСправочник.ЭтоГруппа)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправочник1
	|		ПО ВТТоварыНовинок.Номенклатура = НоменклатураСправочник1.Ссылка
	|			И (НоменклатураСправочник1.ЭтоГруппа)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА НЕ НоменклатураСправочник.Ссылка ЕСТЬ NULL
	|				ТОГДА НоменклатураСправочник.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|			КОГДА НЕ НоменклатураСправочник1.Ссылка ЕСТЬ NULL
	|				ТОГДА НоменклатураСправочник1.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ";
	Запрос.УстановитьПараметр("Новинки",новинки.Выгрузить()); 
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПроцедурыОбменаССайтом.ПриЗаписиСправочникаОбменССайтомПриЗаписи(ВыборкаДетальныеЗаписи.Номенклатура,Отказ);
	КонецЦикла;
	
КонецПроцедуры



