
Функция СуществуютТипыДокументовВводимыеНаОсновании(ДокументСсылка) Экспорт
	
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	СписокДокументов = Новый СписокЗначений;
    
    Для каждого Метаданное Из Метаданные.Документы Цикл
        Если Метаданное.ВводитсяНаОсновании.Содержит(МетаданныеДокумента) Тогда
             СписокДокументов.Добавить(Метаданное.ПолноеИмя(), Метаданное.Представление());
        КонецЕсли;    
    КонецЦикла;
    
    Возврат СписокДокументов;
    
КонецФункции

// Процедура выводит на печать табличный документ.
// Открывает форму Печати документов, хаполняет печатный документ формы.
//
// Параметры:
//  ПечДокумент - ТабличныйДокумент
//  КоличествоЭкземпляров - число
//  НаПринтер - булево
//  Заголовок - строка, заголовок формы печати
//  Ссылка - Ссылка объекта печати
//  ИсточникМакета - не используется
//
Процедура НапечататьТабличныйДокумент(ПечДокумент, КоличествоЭкземпляров = 1, НаПринтер = Ложь, Заголовок = "", Ссылка = Неопределено, ИсточникМакета = Неопределено, АдресРасшифровки = "") Экспорт

	Если ПечДокумент = Неопределено тогда
		Возврат;
	КонецЕсли;

	// Получить необходимое количество копий
	Если КоличествоЭкземпляров > 0 Тогда
		ПечДокумент.КоличествоЭкземпляров = КоличествоЭкземпляров;
	КонецЕсли;

	Если НЕ ПечДокумент.АвтоМасштаб
	   И НЕ ЗначениеЗаполнено(ПечДокумент.ИмяПринтера) Тогда
		ПечДокумент.АвтоМасштаб = Истина;
	КонецЕсли;

	Если ТипЗнч(НаПринтер) = Тип("Булево") Тогда
		Если НаПринтер Тогда
			ПечДокумент.Вывод = ИспользованиеВывода.Разрешить;
			ПечДокумент.Напечатать();
		Иначе
			ФормаПечати = ПолучитьОбщуюФорму("ПечатьДокументов",, Новый УникальныйИдентификатор);
			ФормаПечати.ОбъектПечати     = Ссылка;
			ФормаПечати.ПечатныйДокумент = ПечДокумент;
			ФормаПечати.Заголовок        = Заголовок;
			ФормаПечати.Защита           = Истина;
			ФормаПечати.АдресРасшифровки = АдресРасшифровки;
			ФормаПечати.Открыть();
		КонецЕсли;
	ИначеЕсли ТипЗнч(НаПринтер) = Тип("Массив") Тогда
		ПечДокумент.Вывод = ИспользованиеВывода.Разрешить;
		ПечДокумент.Напечатать();

		НаПринтер.Добавить(ПечДокумент);
	КонецЕсли;

КонецПроцедуры // НапечататьТабличныйДокумент()

//Удаляет повторяющиеся элементы массива.
Функция УдалитьПовторяющиесяЭлементыМассива(Массив, НеИспользоватьНеопределено = Ложь) Экспорт
	
	ОписаниеТиповСправочники  = Справочники.ТипВсеСсылки(); 
	ОписаниеТиповДокументы    = Документы.ТипВсеСсылки(); 
	ОписаниеТиповПВХ          = ПланыВидовХарактеристик.ТипВсеСсылки(); 

	Если ТипЗнч(Массив) = Тип("Массив") Тогда 
		
		УжеВМасссиве = Новый Соответствие; 
		БылоНеопределено = Ложь;
		
		КолвоЭлементовВМассиве = Массив.Количество(); 
		
		Для ОбратныйИндекс = 1 По КолвоЭлементовВМассиве Цикл 
			ЭлементМассива = Массив[КолвоЭлементовВМассиве - ОбратныйИндекс]; 
			ТипЭлемента = ТипЗнч(ЭлементМассива); 
			Если ЭлементМассива = Неопределено Тогда
				Если БылоНеопределено или НеИспользоватьНеопределено Тогда
					Массив.Удалить(КолвоЭлементовВМассиве - ОбратныйИндекс); 
				Иначе
					БылоНеопределено = Истина;
				КонецЕсли;
				Продолжить;
			ИначеЕсли ОписаниеТиповСправочники.СодержитТип(ТипЭлемента) 
				ИЛИ ОписаниеТиповДокументы.СодержитТип(ТипЭлемента) 
				ИЛИ ОписаниеТиповПВХ.СодержитТип(ТипЭлемента) Тогда
				
				ИДЭлемента = Строка(ЭлементМассива.УникальныйИдентификатор()); 
				
			Иначе 
				
				ИДЭлемента = ЭлементМассива; 
				
			КонецЕсли; 
			
			Если УжеВМасссиве[ИДЭлемента] = Истина Тогда 
				Массив.Удалить(КолвоЭлементовВМассиве - ОбратныйИндекс); 
			Иначе 
				УжеВМасссиве[ИДЭлемента] = Истина; 
			КонецЕсли; 
		КонецЦикла;      
		
	КонецЕсли;
	
	Возврат Массив;
	
КонецФункции

// 	Получить табличный документ на основании таблицы значений
//
// 	Параметры:
//  Таблица     - ТаблицаЗначений 
// 
// 	Возвращаемое значение:
//  ТабличныйДокумент 
//
Функция ПолучитьТабличныйДокумент(Таблица) Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	// Выводим заголовок таблицы
	КолонкаИндекс = 0;
	Пока КолонкаИндекс < Таблица.Колонки.Количество() Цикл
		Колонка = Таблица.Колонки[КолонкаИндекс];
		КолонкаИмя = ?(ЗначениеЗаполнено(Колонка.Заголовок), Колонка.Заголовок, Колонка.Имя);
		ТабДокумент.Область(1, КолонкаИндекс + 1, 1, КолонкаИндекс + 1).Текст = КолонкаИмя;
		Если Колонка.Ширина > 0 Тогда
			ТабДокумент.Область("C" + Формат(КолонкаИндекс + 1, "ЧГ=")).ШиринаКолонки = Колонка.Ширина;
		КонецЕсли;		
		КолонкаИндекс = КолонкаИндекс + 1;
	КонецЦикла;
	
	// Выводим строки таблицы
	СтрокаИндекс = 0;
	Пока СтрокаИндекс < Таблица.Количество() Цикл
		Таблица_Строка = Таблица[СтрокаИндекс];
		КолонкаИндекс = 0;
		Пока КолонкаИндекс < Таблица.Колонки.Количество() Цикл
			Колонка = Таблица.Колонки[КолонкаИндекс];
			ТабДокумент.Область(СтрокаИндекс + 2, КолонкаИндекс + 1, СтрокаИндекс + 2, КолонкаИндекс + 1).Текст = Формат(Таблица_Строка[Колонка.Имя], "ЧГ=0");
			КолонкаИндекс = КолонкаИндекс + 1;
		КонецЦикла;        
		СтрокаИндекс = СтрокаИндекс + 1;
	КонецЦикла;
	
	Для Кол = 1 По ТабДокумент.ШиринаТаблицы Цикл
		ШиринаКолонки = 0;
		Для Стр = 1 По ТабДокумент.ВысотаТаблицы Цикл
			Область = ТабДокумент.Область("R" + Формат(Стр,"ЧГ=0") + "C"+Формат(Кол,"ЧГ=0"));
			ШиринаОбласти = Область.Отступ + СтрДлина(СокрЛП(Область.Текст));
			ШиринаКолонки = Макс(ШиринаКолонки, ШиринаОбласти + 3);
			Если ШиринаКолонки > 40 Тогда
				Область.ШиринаКолонки = 40;
			Иначе
				Область.ШиринаКолонки = ШиринаКолонки;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПреобразоватьНаименованиеДляКлючаКолонки(Наименование) Экспорт
	
	ДопустимыеСимволы = "абвгдеёжзийклмнопрстуфхцчшщъыьэюяАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯabcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789";
	
	МассивПодстрок = РазложитьСтрокуВМассивПодстрок(Наименование, " ");
	ИтоговаяСтрока = "";
	Для Каждого Элемент ИЗ МассивПодстрок Цикл
		ПервыйСимвол = ВРег(Лев(Элемент,1));
		ОстальныеСимволы = Сред(Элемент,2);
		ИтоговаяСтрока = ИтоговаяСтрока + ПервыйСимвол + ОстальныеСимволы;	
	КонецЦикла;
	
	НовСтрока = "";
	Для Сч = 1 по СтрДлина(ИтоговаяСтрока) Цикл
		ТекСимв = Сред(ИтоговаяСтрока, Сч, 1);
		Если Найти(ДопустимыеСимволы, ТекСимв) = 0 Тогда
			ТекСимв = "_";
		КонецЕсли;
		НовСтрока = НовСтрока + ТекСимв;
	КонецЦикла;
	
	Возврат НовСтрока;
	
КонецФункции

// Функция удаляет из строки нечитаемые символы
//
Функция УбратьНечитаемыеСимволы(Стр, ОставитьКавычки = Ложь) Экспорт
	
	НовСтрока = Стр;
	Если ТипЗнч(Стр) = Тип("Строка") Тогда
		НовСтрока = СтрЗаменить(Стр, 	   Символы.ПС, "");
		НовСтрока = СтрЗаменить(НовСтрока, Символы.ВК, "");
		НовСтрока = СтрЗаменить(НовСтрока, Символы.Таб, "");
		НовСтрока = СтрЗаменить(НовСтрока, Символы.ВТаб, "");
		НовСтрока = СтрЗаменить(НовСтрока, Символы.ПФ, "");
		НовСтрока = СтрЗаменить(НовСтрока, Символы.НПП, "");
		НовСтрока = СтрЗаменить(НовСтрока, "¶", "");
		Если НЕ ОставитьКавычки Тогда
			НовСтрока = СтрЗаменить(НовСтрока, """", "'");
		КонецЕсли;
	КонецЕсли;
	
	Возврат СокрЛП(НовСтрока);
	
КонецФункции // УбратьНечитаемыеСимволы()

// Шворобей В.Ю. 18.04.2023 ++
Функция ЦифрыСимволыЧисла(Знач ЗначениеСтр) Экспорт
	
	НовоеЗначение = "";
	СтруктураВозврата = Новый Структура("НовоеЗначение, ТекстОшибки", НовоеЗначение, ""); 
	Значение = СокрЛП(ЗначениеСтр);
	
	Для Сч = 1 По СтрДлина(Значение) Цикл
		Символ = Сред(Значение, Сч, 1);
		Если Найти("1234567890.,", Символ)>0 Тогда
			НовоеЗначение = НовоеЗначение + Символ;
		Иначе
			ТекстОшибки = "В строке есть не цифровые символы";
		КонецЕсли;
	КонецЦикла;
	
	СтруктураВозврата.Вставить("НовоеЗначение", НовоеЗначение);
	СтруктураВозврата.Вставить("ТекстОшибки", ТекстОшибки);
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция РазницаТаблицЗначений(Таблица0, Таблица1, Измерения) Экспорт
    
    Запрос = Новый Запрос(
    
    "ВЫБРАТЬ
    |    0 КАК Знак,
    |    Т.Поле
    |ПОМЕСТИТЬ Т0
    |ИЗ
    |    &Таблица0 КАК Т
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |    1 КАК Знак,
    |    Т.Поле
    |ПОМЕСТИТЬ Т1
    |ИЗ
    |    &Таблица1 КАК Т
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |    Т.Знак,
    |    Т.Поле
    |ПОМЕСТИТЬ Т
    |ИЗ
    |    Т0 КАК Т
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |    Т.Знак,
    |    Т.Поле
    |ИЗ
    |    Т1 КАК Т
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |    СУММА(Т.Знак) КАК Знак,
    |    Т.Поле
    |ИЗ
    |    Т КАК Т
    |
    |СГРУППИРОВАТЬ ПО
    |    Т.Поле
    |
    |ИМЕЮЩИЕ
    |    КОЛИЧЕСТВО(*) = 1
    |
    |УПОРЯДОЧИТЬ ПО
    |    Поле//"
    
    );
    
    ВсеКолонки = "";
    
    Для Каждого Колонка Из Таблица1.Колонки Цикл 
        ВсеКолонки = ВсеКолонки + ", Т." + Колонка.Имя
    КонецЦикла;
    
    Запрос.Текст = СтрЗаменить(Запрос.Текст, "Т.Поле", Сред(ВсеКолонки, 2)); 
    
    Запрос.Текст = СтрЗаменить(Запрос.Текст, "Поле//", Измерения);
    
    Запрос.УстановитьПараметр("Таблица0", Таблица0);
    Запрос.УстановитьПараметр("Таблица1", Таблица1);
    
    Возврат Запрос.Выполнить().Выгрузить()
    
КонецФункции

////////////////////////////////////////////////////////////////////////////////////////

// Функция производит поиск документа заданного вида, имеющего в реквизите "ДокОснование" значение,
// равное переданной ссылке.
//
// Параметры:
//  ДокСсылка  - ссылка на документ, для которого надо найти подчиненный документ,
//  ВидДокумента - строка, вид документа, по умолчанию "РекламационнаяНакладная"
//
// Возвращаемое значение:
//  Если нашли, то возвращаем ссылку, не нашли - Неопределено
//
Функция НайтиПодчиненныйДокумент(ДокументСсылка, ВидДокумента = "РекламационнаяНакладная", ФлагТолькоПроведенные = Ложь,
								ФлагБезПомеченныхНаУдаление = Ложь) Экспорт
								
	ТекстДокОснование = "ДокОснование";							
	Если ВидДокумента = "РекламационнаяНакладная" Тогда
		ТекстДокОснование = "ЗаявкаНаРекламацию";
	КонецЕсли;

	НайденныйДокумент = Неопределено;
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		
		ИмяДокументаСсылка = ДокументСсылка.Метаданные().Имя;

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);

		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Ссылка 
		|ИЗ
		|	Документ." + ВидДокумента + " Как Документ
		|
		|ГДЕ
		|	Документ." + ТекстДокОснование + " = &ДокументСсылка
		|   И ТИПЗНАЧЕНИЯ(Документ." + ТекстДокОснование + ") = ТИП(Документ." + ИмяДокументаСсылка + ")";
		
		Если ФлагТолькоПроведенные Тогда
			Запрос.Текст = Запрос.Текст + "
				|	И Документ.Ссылка.Проведен И НЕ Документ.Ссылка.ПометкаУдаления
				|";
		КонецЕсли;
			
		Если ФлагБезПомеченныхНаУдаление Тогда
			Запрос.Текст = Запрос.Текст + "
				|	И НЕ Документ.Ссылка.ПометкаУдаления
				|";
		КонецЕсли;

		УстановитьПривилегированныйРежим(Истина);
		ВыборкаИзЗапроса = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);

		Если ВыборкаИзЗапроса.Следующий() Тогда
			НайденныйДокумент = ВыборкаИзЗапроса.Ссылка;
		КонецЕсли;

	КонецЕсли;

	Возврат НайденныйДокумент;
	
КонецФункции // НайтиПодчиненныйДокумент()

// Функция производит поиск документов заданного вида, имеющего в реквизите "ДокОснование" значение,
// равное переданной ссылке.
//
// Параметры:
//  ДокСсылка  - ссылка на документ, для которого надо найти подчиненный документ,
//  ВидДокумента - строка, вид документа, по умолчанию "РекламационнаяНакладная"
//
// Возвращаемое значение:
//  Если нашли, то возвращаем Массив ссылок, не нашли - Пустой массив
//
Функция НайтиПодчиненныеДокументы(ДокументСсылка, ВидДокумента = "РекламационнаяНакладная", ФлагТолькоПроведенные = Ложь, ФлагБезПомеченныхНаУдаление = Ложь, Упорядочивание = "ВОЗР") Экспорт

	Если ЗначениеНеЗаполнено(ДокументСсылка) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	ТекстДокОснование = "ДокОснование";							
	Если ВидДокумента = "РекламационнаяНакладная" Тогда
		ТекстДокОснование = "ЗаявкаНаРекламацию";
	КонецЕсли;
		
	ИмяДокументаСсылка = ДокументСсылка.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка 
	|ИЗ
	|	Документ." + ВидДокумента + " Как Документ
	|
	|ГДЕ
	|	Документ." + ТекстДокОснование + " = &ДокументСсылка
	|   И ТИПЗНАЧЕНИЯ(Документ." + ТекстДокОснование + ") = ТИП(Документ." + ИмяДокументаСсылка + ")";
	
	Если ФлагТолькоПроведенные Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И Документ.Ссылка.Проведен И НЕ Документ.Ссылка.ПометкаУдаления
		|";
	КонецЕсли;
	
	Если ФлагБезПомеченныхНаУдаление Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И НЕ Документ.Ссылка.ПометкаУдаления
		|";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документ.Дата " + Упорядочивание + "
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		ТЗ = Запрос.Выполнить().Выгрузить();
	Исключение
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокОснование", "ДокументОснование");
		ТЗ = Запрос.Выполнить().Выгрузить();	
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ТЗ.Количество() Тогда
		Возврат ТЗ.ВыгрузитьКолонку("Ссылка");
	Иначе
		Возврат Новый Массив;
	КонецЕсли;
	
КонецФункции // НайтиПодчиненныеДокументы()

Функция ЗаполнитьТЧКомплектующие(ДокументОбъект, Продукция = Неопределено, ФлагЗаменятьНоменклатуру = Ложь, ИмяТЧ = "Товары", ТолькоТовар = ложь)  Экспорт
	//++Данилова Е.В. 28.07.2025 HELP-6187 
	Если  ИмяТЧ = неопределено Тогда
	
		ИмяТЧ = "Товары"; 	
	
	КонецЕсли;
	//--Данилова Е.В. 28.07.2025
	ТаблицаКомплектующих = Новый ТаблицаЗначений;
	ТаблицаКомплектующих.Колонки.Добавить("Продукция");
	ТаблицаКомплектующих.Колонки.Добавить("Номенклатура");
	ТаблицаКомплектующих.Колонки.Добавить("Количество");
	//++Данилова Е.В. 28.07.2025 HELP-6187
	//Для Каждого СтрокаТЧ Из ДокументОбъект.Товары Цикл
	Для Каждого СтрокаТЧ Из ДокументОбъект[ИмяТЧ] Цикл
	//--Данилова Е.В. 28.07.2025
		Если Продукция <> Неопределено И СтрокаТЧ.Номенклатура <> Продукция Тогда
			Продолжить;
		КонецЕсли;
		ВремТЗ = ПолучитьТаблицуКомплектующих(СтрокаТЧ.Номенклатура);
		Для Каждого СтрокаВремТЗ Из ВремТЗ Цикл
			//++Данилова Е.В. 28.07.2025
			Если ТолькоТовар
				И СтрокаВремТЗ.Номенклатура.Родитель.ВидНоменклатуры <> Перечисления.ВидыНоменклаутры.Товар Тогда
				
				Продолжить;	
			КонецЕсли;
			//--Данилова Е.В. 28.07.2025
			НоваяСтрока = ТаблицаКомплектующих.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВремТЗ);
			
		КонецЦикла;			
	КонецЦикла;
	
	ТР = Новый ТаблицаЗначений;	
	ТР.Колонки.Добавить("Продукция");
	ТР.Колонки.Добавить("Номенклатура");
	ТР.Колонки.Добавить("Количество");
	ТР.Колонки.Добавить("Всего");
	//++Данилова Е.В. 28.07.2025 HELP-6187
	ЭтоЗаказПоставщику = ТипЗнч(ДокументОбъект) = Тип("ДокументСсылка.ЗаказПоставщику") ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ЗаказПоставщику"); 
	//Для Каждого СтрокаТЧ Из ДокументОбъект.Товары Цикл
	Для Каждого СтрокаТЧ Из ДокументОбъект[ИмяТЧ] Цикл
	//--Данилова Е.В. 28.07.2025	
		Если Продукция <> Неопределено И СтрокаТЧ.Номенклатура <> Продукция Тогда
			Продолжить;
		КонецЕсли; 
		//++Данилова Е.В. 11.08.2025 HELP-6187 
		Если ЭтоЗаказПоставщику
			И СтрокаТЧ.Коэффициент = 0 Тогда
		
			СтрокаТЧКоэффициент = 1;  	
		Иначе 
			СтрокаТЧКоэффициент =  СтрокаТЧ.Коэффициент; 
		КонецЕсли;
		//--Данилова Е.В. 11.08.2025
				
		КолвоПродукции	= СтрокаТЧ.Количество * СтрокаТЧКоэффициент; //СтрокаТЧ.Коэффициент;   //Данилова Е.В. 11.08.2025 HELP-6187
		
		СтрокиТаблицыКомплектующих = ТаблицаКомплектующих.НайтиСтроки(Новый Структура("Продукция", СтрокаТЧ.Номенклатура));
		
		Для Каждого СтрокаТаблицыКомплектующих Из СтрокиТаблицыКомплектующих Цикл			
			
			ТекНоменклатура		= СтрокаТаблицыКомплектующих.Номенклатура;
			ТребуемоеКоличество	= КолвоПродукции * СтрокаТаблицыКомплектующих.Количество;
			
			Если ТребуемоеКоличество = 0 Тогда
				Продолжить;
			КонецЕсли;
			//++Данилова Е.В. 27.01.2025
			//Если ТекНоменклатура.Коплектующие.Количество() = 0 Тогда
			Если ТекНоменклатура.Коплектующие.Количество() = 0 
				ИЛИ ТекНоменклатура.ВидКомплекта = Перечисления.ВидыКомплектов.ГотовыйКомплект Тогда
			//--Данилова Е.В. 27.01.2025
				СтрокаТР = ТР.Добавить();
				СтрокаТР.Продукция		= СтрокаТЧ.Номенклатура;
				СтрокаТР.Номенклатура	= ТекНоменклатура;				
				СтрокаТР.Количество		= ТребуемоеКоличество; 
				//++Данилова Е.В. 18.05.2026 MARK-3615
				Если ЕстьРеквизитТабЧастиДокумента("Всего", ДокументОбъект.Метаданные(), ИмяТЧ)
					И  ЕстьРеквизитТабЧастиДокумента("Цена", ДокументОбъект.Метаданные(), ИмяТЧ)  Тогда
				//--Данилова Е.В. 18.05.2026 
					Если СтрокаТЧ.Номенклатура.ВидКомплекта <> Перечисления.ВидыКомплектов.Комплект Тогда // Если ЭтоПродукцияБезВложенныхКомплектов Тогда
						СтрокаТР.Всего = СтрокаТР.Количество * СтрокаТЧ.Цена;
					КонецЕсли;
				КонецЕсли; 			 
				// 1. ОБРАБОТКА "ПРОСТОГО ТОВАРА" }
				
			ИначеЕсли (ТекНоменклатура.ВидКомплекта = Перечисления.ВидыКомплектов.Ассортито)
				Или (НЕ ЗначениеЗаполнено(ТекНоменклатура.ВидКомплекта)) Тогда
				
				ТЗПропорций = Новый ТаблицаЗначений;
				ТЗПропорций.Колонки.Добавить("Номенклатура");
				ТЗПропорций.Колонки.Добавить("Количество");
				
				для каждого СтрТЧКМП из ТекНоменклатура.Коплектующие цикл
					СтрПроп=ТЗПропорций.Добавить();
					СтрПроп.Номенклатура=СтрТЧКМП.Номенклатура;
					СтрПроп.Количество=Окр(ТребуемоеКоличество*СтрТЧКМП.Количество/ТекНоменклатура.Коплектующие.Итог("Количество"),0);			
				КонецЦикла;
				если ТЗПропорций.Итог("Количество")<>ТребуемоеКоличество тогда
					СтрДоберём = ТЗПропорций.Получить(ТЗПропорций.Количество()-1);
					СтрДоберём.количество=СтрДоберём.количество+(ТребуемоеКоличество-ТЗПропорций.Итог("Количество"));
				КонецЕсли;
				
				
				ТЗПропорций.Свернуть("Номенклатура","Количество");
				Для каждого СтрТЗПроп из ТЗПропорций цикл
					СтрокаТР=ТР.Добавить();
					СтрокаТР.Продукция 		= СтрокаТЧ.Номенклатура;
					СтрокаТР.Номенклатура	= СтрТЗПроп.Номенклатура;				
					СтрокаТР.Количество		= + СтрТЗПроп.Количество;
					//++Данилова Е.В. 18.05.2026 MARK-3615
					Если ЕстьРеквизитТабЧастиДокумента("Всего", ДокументОбъект.Метаданные(), ИмяТЧ)
						И  ЕстьРеквизитТабЧастиДокумента("Цена", ДокументОбъект.Метаданные(), ИмяТЧ)  Тогда
						//--Данилова Е.В. 18.05.2026
						Если СтрокаТЧ.Номенклатура.ВидКомплекта <> Перечисления.ВидыКомплектов.Комплект Тогда // Если ЭтоПродукцияБезВложенныхКомплектов Тогда
							СтрокаТР.Всего = СтрТЗПроп.Количество * СтрокаТЧ.Цена;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;	
				// 2. ОБРАБОТКА "АССОРТИТО" }
				
			Иначе
				СообщитьИзМодуля("ВНУТРЕННЯЯ ОШИБКА! Комплекты с Вид комплекта = " + ТекНоменклатура.ВидКомплекта + " не поддерживаются!");					
			КонецЕсли;							
		КонецЦикла;			
	КонецЦикла;	
	
	ТР.Свернуть("Номенклатура, Продукция","Количество, Всего");
	
	Если Продукция <> Неопределено Тогда
		Если ФлагЗаменятьНоменклатуру Тогда
			//++Данилова Е.В. 28.07.2025
			//ТЗТовары = ДокументОбъект.Товары.Выгрузить(, "Номенклатура");
			ТЗТовары = ДокументОбъект[ИмяТЧ].Выгрузить(, "Номенклатура");
			//--Данилова Е.В. 28.07.2025
			ТЗКомплектующие = ДокументОбъект.Комплектующие.Выгрузить(, "Продукция");
			ТЗКомплектующие.Свернуть("Продукция");
			ТЗКомплектующие.Колонки.Найти("Продукция").Имя = "Номенклатура";
			
			ТЗРазница = ЗаполнениеДокументов.РазницаТаблицЗначений(ТЗТовары, ТЗКомплектующие, "Номенклатура");
			
			Для Каждого Стр ИЗ ТЗРазница Цикл
				СтрокиКУдалению = ДокументОбъект.Комплектующие.НайтиСтроки(Новый Структура("Продукция", Стр.Номенклатура));
				Если СтрокиКУдалению.Количество() > 0 Тогда
					Для каждого Строка Из СтрокиКУдалению Цикл 
						ДокументОбъект.Комплектующие.Удалить(Строка); 
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		Иначе
			СтрокиКУдалению = ДокументОбъект.Комплектующие.НайтиСтроки(Новый Структура("Продукция", Продукция));
			Если СтрокиКУдалению.Количество() > 0 Тогда
				Для каждого Строка Из СтрокиКУдалению Цикл 
					ДокументОбъект.Комплектующие.Удалить(Строка); 
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ДокументОбъект.Комплектующие.Очистить();
	КонецЕсли;
	
	Для Каждого СтрокаТР Из ТР Цикл
		Если СтрокаТР.Количество = 0 тогда
			Продолжить;
		КонецЕсли;
		СтрокаТЧ = ДокументОбъект.Комплектующие.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаТР);
		// Кухарь А.Ю.  28.09.2022 начало
		//Если ЕстьРеквизитТабЧастиДокумента("КоличествоПродукции", ДокументОбъект.Метаданные(), "Комплектующие") Тогда
		//	СтрокаТЧ.КоличествоПродукции = СтрокаТР.Количество;
		//КонецЕсли;		 
		// Кухарь А.Ю.  28.09.2022 конец

		ПриИзмененииНоменклатурыТабЧасти(СтрокаТЧ, ДокументОбъект);
		РассчитатьСуммуТабЧасти(СтрокаТЧ, ДокументОбъект, "ОтВсего");			
	КонецЦикла;	
	
	// Кухарь А.Ю.  13.01.2025 начало
	// https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2527
	если ДокументОбъект.метаданные().имя="РасходнаяНакладная" тогда
		ДокументОбъект.ЗаполнитьКоличествоПродукции();
	КонецЕсли;
	// Кухарь А.Ю.  13.01.2025 конец
	
КонецФункции
//++Данилова Е.В. 15.08.2025
Функция ЗаполнитьТЧКомплектующиеСоСверткой(ДокументОбъект, Продукция = Неопределено, ФлагЗаменятьНоменклатуру = Ложь, ИмяТЧ = "Товары", ТолькоТовар = ложь)  Экспорт
	//++Данилова Е.В. 28.07.2025 HELP-6187 
	Если  ИмяТЧ = неопределено Тогда
	
		ИмяТЧ = "Товары"; 	
	
	КонецЕсли;
	//--Данилова Е.В. 28.07.2025
	ТаблицаКомплектующих = Новый ТаблицаЗначений;
	ТаблицаКомплектующих.Колонки.Добавить("Продукция");
	ТаблицаКомплектующих.Колонки.Добавить("Номенклатура");
	ТаблицаКомплектующих.Колонки.Добавить("Количество");
	//++Данилова Е.В. 28.07.2025 HELP-6187
	//Для Каждого СтрокаТЧ Из ДокументОбъект.Товары Цикл
	ТаблицаТоваров = ДокументОбъект[ИмяТЧ].Выгрузить(); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧТовары.Номенклатура КАК Номенклатура,
		|	ТЧТовары.Количество КАК Количество,
		|	ТЧТовары.Единица КАК Единица,
		|	ТЧТовары.Коэффициент КАК Коэффициент,
		|	ТЧТовары.Цена КАК Цена
		|ПОМЕСТИТЬ ВтТовары
		|ИЗ
		|	&Товары КАК ТЧТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтТовары.Номенклатура КАК Номенклатура,
		|	СУММА(ВтТовары.Количество) КАК Количество,
		|	ВтТовары.Единица КАК Единица,
		|	МАКСИМУМ(ВтТовары.Коэффициент) КАК Коэффициент,
		|	МАКСИМУМ(ВтТовары.Цена) КАК Цена
		|ИЗ
		|	ВтТовары КАК ВтТовары
		|
		|СГРУППИРОВАТЬ ПО
		|	ВтТовары.Единица,
		|	ВтТовары.Номенклатура";
	
	Запрос.УстановитьПараметр("Товары",ТаблицаТоваров); 
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЧТовары =  РезультатЗапроса.Выгрузить(); 
 
	Для Каждого СтрокаТЧ Из ТЧТовары Цикл //ДокументОбъект[ИмяТЧ] Цикл
	//--Данилова Е.В. 28.07.2025
		Если Продукция <> Неопределено И СтрокаТЧ.Номенклатура <> Продукция Тогда
			Продолжить;
		КонецЕсли;
		ВремТЗ = ПолучитьТаблицуКомплектующих(СтрокаТЧ.Номенклатура);
		Для Каждого СтрокаВремТЗ Из ВремТЗ Цикл
			//++Данилова Е.В. 28.07.2025
			Если ТолькоТовар
				И СтрокаВремТЗ.Номенклатура.Родитель.ВидНоменклатуры <> Перечисления.ВидыНоменклаутры.Товар Тогда
				
				Продолжить;	
			КонецЕсли;
			//--Данилова Е.В. 28.07.2025
			НоваяСтрока = ТаблицаКомплектующих.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВремТЗ);
			
		КонецЦикла;			
	КонецЦикла;
	
	ТР = Новый ТаблицаЗначений;	
	ТР.Колонки.Добавить("Продукция");
	ТР.Колонки.Добавить("Номенклатура");
	ТР.Колонки.Добавить("Количество");
	ТР.Колонки.Добавить("Всего");
	//++Данилова Е.В. 28.07.2025 HELP-6187
	ЭтоЗаказПоставщику = ТипЗнч(ДокументОбъект) = Тип("ДокументСсылка.ЗаказПоставщику") ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ЗаказПоставщику"); 
	//Для Каждого СтрокаТЧ Из ДокументОбъект.Товары Цикл
	Для Каждого СтрокаТЧ Из ТЧТовары Цикл //ДокументОбъект[ИмяТЧ] Цикл
	//--Данилова Е.В. 28.07.2025	
		Если Продукция <> Неопределено И СтрокаТЧ.Номенклатура <> Продукция Тогда
			Продолжить;
		КонецЕсли; 
		//++Данилова Е.В. 11.08.2025 HELP-6187 
		Если ЭтоЗаказПоставщику
			И СтрокаТЧ.Коэффициент = 0 Тогда
		
			СтрокаТЧКоэффициент = 1;  	
		Иначе 
			СтрокаТЧКоэффициент =  СтрокаТЧ.Коэффициент; 
		КонецЕсли;
		//--Данилова Е.В. 11.08.2025
				
		КолвоПродукции	= СтрокаТЧ.Количество * СтрокаТЧКоэффициент; //СтрокаТЧ.Коэффициент;   //Данилова Е.В. 11.08.2025 HELP-6187
		
		СтрокиТаблицыКомплектующих = ТаблицаКомплектующих.НайтиСтроки(Новый Структура("Продукция", СтрокаТЧ.Номенклатура));
		
		Для Каждого СтрокаТаблицыКомплектующих Из СтрокиТаблицыКомплектующих Цикл			
			
			ТекНоменклатура		= СтрокаТаблицыКомплектующих.Номенклатура;
			ТребуемоеКоличество	= КолвоПродукции * СтрокаТаблицыКомплектующих.Количество;
			
			Если ТребуемоеКоличество = 0 Тогда
				Продолжить;
			КонецЕсли;
			//++Данилова Е.В. 27.01.2025
			//Если ТекНоменклатура.Коплектующие.Количество() = 0 Тогда
			Если ТекНоменклатура.Коплектующие.Количество() = 0 
				ИЛИ ТекНоменклатура.ВидКомплекта = Перечисления.ВидыКомплектов.ГотовыйКомплект Тогда
			//--Данилова Е.В. 27.01.2025
				СтрокаТР = ТР.Добавить();
				СтрокаТР.Продукция		= СтрокаТЧ.Номенклатура;
				СтрокаТР.Номенклатура	= ТекНоменклатура;				
				СтрокаТР.Количество		= ТребуемоеКоличество;
				Если СтрокаТЧ.Номенклатура.ВидКомплекта <> Перечисления.ВидыКомплектов.Комплект Тогда // Если ЭтоПродукцияБезВложенныхКомплектов Тогда
					СтрокаТР.Всего = СтрокаТР.Количество * СтрокаТЧ.Цена;
				КонецЕсли;				
				// 1. ОБРАБОТКА "ПРОСТОГО ТОВАРА" }
				
			ИначеЕсли (ТекНоменклатура.ВидКомплекта = Перечисления.ВидыКомплектов.Ассортито)
				Или (НЕ ЗначениеЗаполнено(ТекНоменклатура.ВидКомплекта)) Тогда
				
				ТЗПропорций = Новый ТаблицаЗначений;
				ТЗПропорций.Колонки.Добавить("Номенклатура");
				ТЗПропорций.Колонки.Добавить("Количество");
				
				для каждого СтрТЧКМП из ТекНоменклатура.Коплектующие цикл
					СтрПроп=ТЗПропорций.Добавить();
					СтрПроп.Номенклатура=СтрТЧКМП.Номенклатура;
					СтрПроп.Количество=Окр(ТребуемоеКоличество*СтрТЧКМП.Количество/ТекНоменклатура.Коплектующие.Итог("Количество"),0);			
				КонецЦикла;
				если ТЗПропорций.Итог("Количество")<>ТребуемоеКоличество тогда
					СтрДоберём = ТЗПропорций.Получить(ТЗПропорций.Количество()-1);
					СтрДоберём.количество=СтрДоберём.количество+(ТребуемоеКоличество-ТЗПропорций.Итог("Количество"));
				КонецЕсли;
				
				
				ТЗПропорций.Свернуть("Номенклатура","Количество");
				Для каждого СтрТЗПроп из ТЗПропорций цикл
					СтрокаТР=ТР.Добавить();
					СтрокаТР.Продукция 		= СтрокаТЧ.Номенклатура;
					СтрокаТР.Номенклатура	= СтрТЗПроп.Номенклатура;				
					СтрокаТР.Количество		= + СтрТЗПроп.Количество;
					Если СтрокаТЧ.Номенклатура.ВидКомплекта <> Перечисления.ВидыКомплектов.Комплект Тогда // Если ЭтоПродукцияБезВложенныхКомплектов Тогда
						СтрокаТР.Всего = СтрТЗПроп.Количество * СтрокаТЧ.Цена;
					КонецЕсли;
				КонецЦикла;	
				// 2. ОБРАБОТКА "АССОРТИТО" }
				
			Иначе
				СообщитьИзМодуля("ВНУТРЕННЯЯ ОШИБКА! Комплекты с Вид комплекта = " + ТекНоменклатура.ВидКомплекта + " не поддерживаются!");					
			КонецЕсли;							
		КонецЦикла;			
	КонецЦикла;	
	
	ТР.Свернуть("Номенклатура, Продукция","Количество, Всего");
	
	Если Продукция <> Неопределено Тогда
		Если ФлагЗаменятьНоменклатуру Тогда
			//++Данилова Е.В. 28.07.2025
			//ТЗТовары = ДокументОбъект.Товары.Выгрузить(, "Номенклатура");
			ТЗТовары = ТЧТовары; //ДокументОбъект[ИмяТЧ].Выгрузить(, "Номенклатура");
			//--Данилова Е.В. 28.07.2025
			ТЗКомплектующие = ДокументОбъект.Комплектующие.Выгрузить(, "Продукция");
			ТЗКомплектующие.Свернуть("Продукция");
			ТЗКомплектующие.Колонки.Найти("Продукция").Имя = "Номенклатура";
			
			ТЗРазница = ЗаполнениеДокументов.РазницаТаблицЗначений(ТЗТовары, ТЗКомплектующие, "Номенклатура");
			
			Для Каждого Стр ИЗ ТЗРазница Цикл
				СтрокиКУдалению = ДокументОбъект.Комплектующие.НайтиСтроки(Новый Структура("Продукция", Стр.Номенклатура));
				Если СтрокиКУдалению.Количество() > 0 Тогда
					Для каждого Строка Из СтрокиКУдалению Цикл 
						ДокументОбъект.Комплектующие.Удалить(Строка); 
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		Иначе
			СтрокиКУдалению = ДокументОбъект.Комплектующие.НайтиСтроки(Новый Структура("Продукция", Продукция));
			Если СтрокиКУдалению.Количество() > 0 Тогда
				Для каждого Строка Из СтрокиКУдалению Цикл 
					ДокументОбъект.Комплектующие.Удалить(Строка); 
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ДокументОбъект.Комплектующие.Очистить();
	КонецЕсли;
	
	Для Каждого СтрокаТР Из ТР Цикл
		Если СтрокаТР.Количество = 0 тогда
			Продолжить;
		КонецЕсли;
		СтрокаТЧ = ДокументОбъект.Комплектующие.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаТР);
		// Кухарь А.Ю.  28.09.2022 начало
		//Если ЕстьРеквизитТабЧастиДокумента("КоличествоПродукции", ДокументОбъект.Метаданные(), "Комплектующие") Тогда
		//	СтрокаТЧ.КоличествоПродукции = СтрокаТР.Количество;
		//КонецЕсли;		 
		// Кухарь А.Ю.  28.09.2022 конец

		ПриИзмененииНоменклатурыТабЧасти(СтрокаТЧ, ДокументОбъект);
		РассчитатьСуммуТабЧасти(СтрокаТЧ, ДокументОбъект, "ОтВсего");			
	КонецЦикла;	
	
	// Кухарь А.Ю.  13.01.2025 начало
	// https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2527
	если ДокументОбъект.метаданные().имя="РасходнаяНакладная" тогда
		ДокументОбъект.ЗаполнитьКоличествоПродукции();
	КонецЕсли;
	// Кухарь А.Ю.  13.01.2025 конец
	
КонецФункции

//--Данилова Е.В. 15.08.2025
Функция ПолучитьТаблицуКомплектующих(Продукция, МассивПродукцииВерхнегоУровня = Неопределено)
	
	ТаблицаКомплектующих = Новый ТаблицаЗначений;
	ТаблицаКомплектующих.Колонки.Добавить("Продукция");
	ТаблицаКомплектующих.Колонки.Добавить("Номенклатура");
	ТаблицаКомплектующих.Колонки.Добавить("Количество");
	
	// чтобы отслеживать ситуацию зацикливания комплектов
	МассивПВУ = Новый Массив;
	Если МассивПродукцииВерхнегоУровня <> Неопределено Тогда
		Для Каждого Элемент Из МассивПродукцииВерхнегоУровня Цикл 
			МассивПВУ.Добавить(Элемент);
		КонецЦикла;
	КонецЕсли;
	МассивПВУ.Добавить(Продукция);
	
	ОбщКолКомп=Продукция.Коплектующие.Итог("Количество");
	
	Запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НоменклатураКоплектующие.Номенклатура КАК Запчасть,
	|	НоменклатураКоплектующие.Номенклатура.НоменклатураЗамены КАК ЗаменаЗапчасти,
	|	НоменклатураКоплектующие.Ссылка КАК Продукция
	|ИЗ
	|	Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
	|ГДЕ
	|	НоменклатураКоплектующие.Ссылка = &Продукция";
	запрос.УстановитьПараметр("Продукция",Продукция);
	ТаблицаЗамен=запрос.Выполнить().Выгрузить();
	
	Если (Продукция.ВидКомплекта = Перечисления.ВидыКомплектов.Комплект)
		И (Продукция.Коплектующие.Количество() > 0) Тогда		
		Для Каждого СтрокаТЧ Из Продукция.Коплектующие Цикл
			Комплектующее = СтрокаТЧ.Номенклатура;
			
			СтрокаЗамены=ТаблицаЗамен.Найти(Комплектующее,"Запчасть");
			если СтрокаЗамены<>Неопределено и ЗначениеЗаполнено(СтрокаЗамены.ЗаменаЗапчасти) тогда
				Комплектующее	= СтрокаЗамены.ЗаменаЗапчасти;
			КонецЕсли;				
			Если МассивПВУ.Найти(Комплектующее) <> Неопределено Тогда
				СообщитьИзМодуля("ОШИБКА! Обнаружено зацикливание комплектующих у комплекта """ + МассивПВУ[0] + """!" + Символы.ПС
				+ " - зацикливание возникло на комплектующем """ + Комплектующее + """"
				+ " из вложенного комплекта """ + Продукция + """");
				Продолжить;
			КонецЕсли;
			
			КолвоКомплектующих	= СтрокаТЧ.Количество * СтрокаТЧ.Единица.Коэффициент;
			ВремТЗ				= ПолучитьТаблицуКомплектующих(Комплектующее, МассивПВУ);
			Для Каждого СтрокаВремТЗ Из ВремТЗ Цикл
				НоваяСтрока = ТаблицаКомплектующих.Добавить();
				НоваяСтрока.Продукция		= Продукция;
				НоваяСтрока.Номенклатура	= СтрокаВремТЗ.Номенклатура;			
				НоваяСтрока.Количество		= КолвоКомплектующих * СтрокаВремТЗ.Количество;				
			КонецЦикла;			
		КонецЦикла;				
	Иначе
		НоваяСтрока					= ТаблицаКомплектующих.Добавить();
		НоваяСтрока.Продукция		= Продукция; // МассивПВУ[0];
		НоваяСтрока.Номенклатура	= Продукция;
		НоваяСтрока.Количество		= 1;
	КонецЕсли;
	
	Возврат ТаблицаКомплектующих; 
	
КонецФункции
// Кухарь А.Ю.  05.09.2022 конец

// Шворобей ВЮ 04.10.2022 ++
Функция НайтиКомиссионныйСкладПоКонтрагенту(Контрагент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИнетМагазины.ПунктДоставки.СкладКомиссия КАК КомиссионныйСклад
	|ИЗ
	|	Справочник.ИнетМагазины КАК ИнетМагазины
	|ГДЕ
	|	ИнетМагазины.Контрагент = &Контрагент";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.КомиссионныйСклад) Тогда
			Возврат Выборка.КомиссионныйСклад;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ЕстьЭлементСправочникаИнетМагазины(Контрагент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИнетМагазины.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИнетМагазины КАК ИнетМагазины
	|ГДЕ
	|	ИнетМагазины.Контрагент = &Контрагент";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
// Шворобей ВЮ 04.10.2022 ++


// Кухарь А.Ю.  26.01.2023 начало
// 
Функция НайтиСоздатьПроизвольныйДокументОбъект (ВидДокумента,СтруктураРеквизитов=Неопределено,ИскатьСуществующийДокумент=ложь,СтруктураПоискаДокумента=Неопределено,ПерезаполнятьШапкуДокумента=ложь,ИскатьТолькоВОткрытомПериоде=Истина) экспорт
	НовыйДокумент=Неопределено;
	если СтруктураРеквизитов=Неопределено тогда
		СтруктураРеквизитов=новый Структура;
	КонецЕсли;
	
	если ИскатьСуществующийДокумент и СтруктураПоискаДокумента<>Неопределено тогда
		СтарыйДокумент=НайтиСуществуюшийДокументСсылку(ВидДокумента,СтруктураПоискаДокумента,ИскатьТолькоВОткрытомПериоде);
		если СтарыйДокумент<>Неопределено тогда
			НовыйДокумент=СтарыйДокумент.ПолучитьОбъект();
		КонецЕсли;
	КонецЕсли;
	
	если НовыйДокумент=Неопределено тогда
		
		ПерезаполнятьШапкуДокумента=Истина;
		НовыйДокумент=Документы[ВидДокумента].СоздатьДокумент();
		НовыйДокумент.Дата=ТекущаяДата();
		ЗаполнитьШапкуДокумента(НовыйДокумент,ПараметрыСеанса.Пользователь);	
		ЗаполнитьЗначенияСвойств(НовыйДокумент,СтруктураРеквизитов);
		УстановитьНомерДокументаКлиентСервер(НовыйДокумент);
	иначе		
		если ПерезаполнятьШапкуДокумента тогда
			ЗаполнитьЗначенияСвойств(НовыйДокумент,СтруктураРеквизитов);	
		КонецЕсли;		
	КонецЕсли;
	
	
	//////////////////////////////////////////////////////////////////////// 
	//Дальше будут всякие не универсальные куски для отдельных видов
	если ложь тогда НовыйДокумент=документы.РасходнаяНакладная.СоздатьДокумент();КонецЕсли;
	если ВидДокумента = "РасходнаяНакладная" или 
		ВидДокумента = "Перемещение"  или  
		ВидДокумента = "ПриходнаяНакладная"	
		тогда
		
		если ВидДокумента = "Перемещение" тогда 
			ИмяРеквизитаПолучателя="СкладПолучатель";
		иначе
			ИмяРеквизитаПолучателя="Контрагент";
		КонецЕсли;
		
		если не ЗначениеЗаполнено(НовыйДокумент.ПунктДоставки) и ЗначениеЗаполнено(НовыйДокумент.Контрагент)  тогда
			УстановитьПунктДоставкиКлиентСервер(НовыйДокумент,ИмяРеквизитаПолучателя,"ПунктДоставки");		
			если ЗначениеЗаполнено(НовыйДокумент.ПунктДоставки) тогда
				ПунктДоставки_ПриИзмененииКлиентСервер(НовыйДокумент);
			КонецЕсли;
		КонецЕсли;
		если ВидДокумента="РасходнаяНакладная" тогда
			если не ЗначениеЗаполнено(НовыйДокумент.Договор) тогда
				УстановитьДоговорКлиентСервер(НовыйДокумент);
			КонецЕсли;		
			если не ЗначениеЗаполнено(НовыйДокумент.ОтсрочкаПлатежа) тогда
				УстановитьОтсрочкуПлатежаКлиентСервер(НовыйДокумент);	
				
				//Валетов + 30.06.2026 Изменение 0000000060
				//#Если Клиент Тогда
				//	НовыйДокумент.ДатаОплаты =ПолучитьДатуОплаты(НовыйДокумент.ДатаОтгрузки,НовыйДокумент.ОтсрочкаПлатежа);
				//#КонецЕсли
				ПараметрыРасчетаДатыОплаты 	= ОбщегоНазначенияКС.ПолучитьЗаполнитьПараметрыРасчетаДатыОплатыПоДокументу(НовыйДокумент);
				НовыйДокумент.ДатаОплаты 	= ОбщегоНазначенияКС.ПолучитьДатуОплатыПоДокументуКлиентСервер(ПараметрыРасчетаДатыОплаты); 
				//Валетов-
				//Кухарь А.Ю.  21.04.2023 конец
				
				КонецЕсли;		
		КонецЕсли;
	КонецЕсли;	
	возврат НовыйДокумент;
КонецФункции

Функция НайтиСуществуюшийДокументСсылку (ВидДокумента,СтруктураПоискаДокумента,ИскатьТолькоВОткрытомПериоде)
	
	МетаданныеДокумента=Документы[ВидДокумента].ПустаяСсылка().метаданные();
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходнаяНакладная КАК Док
	|ГДЕ
	|	&ФильтрУсловие=истина";
	НаборноеУсловие="";
	Для Каждого Элемент из СтруктураПоискаДокумента Цикл 
		если ЕстьРеквизитДокумента(Элемент.Ключ,МетаданныеДокумента) тогда
			НаборноеУсловие=НаборноеУсловие+" и "+"Док."+Элемент.Ключ+" = "+"&"+Элемент.Ключ;
			Запрос.УстановитьПараметр(Элемент.Ключ,Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
	
	если ИскатьТолькоВОткрытомПериоде тогда
		НаборноеУсловие=НаборноеУсловие+" и Док.Дата>= &ДатаЗапретаРедактирования ";
					//++Ратманов Без задачи
		//запрос.УстановитьПараметр("ДатаЗапретаРедактирования",ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования());
		запрос.УстановитьПараметр("ДатаЗапретаРедактирования",ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования());
					//--Ратманов Без задачи
	КонецЕсли;
	
	запрос.Текст=СтрЗаменить(запрос.Текст,"Документ.РасходнаяНакладная КАК Док","Документ."+ВидДокумента+" КАК Док");
	запрос.Текст=СтрЗаменить(запрос.Текст,"&ФильтрУсловие=истина","истина" + НаборноеУсловие);
	выборка=запрос.выполнить().выбрать();
	пока выборка.следующий() цикл
		возврат выборка.Ссылка;
	КонецЦикла;
	
	возврат Неопределено;
КонецФункции
// Кухарь А.Ю.  26.01.2023 конец

#Область ШтрихКоды

// Шворобей В.Ю. 17.04.2023 ++
Функция ПроверкаШК_EAN13(Знач ШтрихКод) Экспорт
	Перем КонтрольнаяСумма,Четные,Нечетные,Общее,Результат,ПроверкаДесятка;
	
	КонтрольнаяСумма = 0; Четные = 0; Нечетные = 0;
	Общее = 0; Результат = 0; ПроверкаДесятка = 0; 
	
	Если СтрДлина(ШтрихКод)<>13 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КонтрольнаяСумма=Число(Сред(ШтрихКод,13,1));
	Для а=1 по 12 Цикл
		Если а%2>0  Тогда
			Нечетные=Нечетные+Число(Сред(ШтрихКод,а,1));
		Иначе
			Четные=Четные+Число(Сред(ШтрихКод,а,1));
		КонецЕсли;                                    
	КонецЦикла;
	
	Общее=Нечетные+(Четные*3);
	Для х=0 По 9 Цикл  
		ПроверкаДесятка=(Общее+х)/10;
		Если ПроверкаДесятка=Цел(ПроверкаДесятка) Тогда
			Результат=х;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если КонтрольнаяСумма = Результат Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

// Шворобей ВЮ 20.03.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2124
Функция ОпределитьТипШтрихКода(Знач текШтрихКод) Экспорт
	
	Тип_ШтрихКода = "";
	Длина_ШтрихКода = СтрДлина(текШтрихКод);
	СуммаШтрихКода = 0;
	
	Если Длина_ШтрихКода = 0 Тогда
		Возврат Тип_ШтрихКода;
	КонецЕсли;
	
	Если Длина_ШтрихКода = 14 Тогда // ITF14
		
		КоэффициентШК = 1;
		Для Сч = 1 По 13 Цикл
			ВремКодСимвола = КодСимвола(текШтрихКод, Сч);
			Если ВремКодСимвола < 48 Или ВремКодСимвола > 57 Тогда
				Прервать;
			КонецЕсли;
			СуммаШтрихКода = СуммаШтрихКода + КоэффициентШК * (ВремКодСимвола - 48);
			КоэффициентШК = 4 - КоэффициентШК;
		КонецЦикла;
		СуммаШтрихКода = (10 - СуммаШтрихКода % 10) % 10;
		Если КодСимвола(текШтрихКод, 14) = СуммаШтрихКода + 48 Тогда
			Тип_ШтрихКода = "ITF14";
		КонецЕсли;
		
	ИначеЕсли Длина_ШтрихКода = 13 Тогда // EAN13
		
		EAN13_Булево = Истина;
		КоэффициентШК = 1;
		Для Сч = 1 По 12 Цикл
			ВремКодСимвола = КодСимвола(текШтрихКод, Сч);
			Если ВремКодСимвола < 48 Или ВремКодСимвола > 57 Тогда
				EAN13_Булево = Ложь;
				Прервать;
			КонецЕсли;
			СуммаШтрихКода = СуммаШтрихКода + КоэффициентШК * (ВремКодСимвола - 48);
			КоэффициентШК = 4 - КоэффициентШК;
		КонецЦикла;
		СуммаШтрихКода = (10 - СуммаШтрихКода % 10) % 10;
		ПроверочныйСимвол = Символ(СуммаШтрихКода + 48);
		Если EAN13_Булево И ПроверочныйСимвол = Прав(текШтрихКод, 1) Тогда
			Тип_ШтрихКода = "EAN13";
		КонецЕсли;
		
	ИначеЕсли Длина_ШтрихКода = 8 Тогда // EAN8
		
		EAN8_Булево = Истина;
		КоэффициентШК = 3;
		Для Сч = 1 По 7 Цикл
			ВремКодСимвола = КодСимвола(текШтрихКод, Сч);
			Если ВремКодСимвола < 48 Или ВремКодСимвола > 57 Тогда
				EAN8_Булево = Ложь;
				Прервать;
			КонецЕсли;
			СуммаШтрихКода = СуммаШтрихКода + КоэффициентШК * (ВремКодСимвола - 48);
			КоэффициентШК = 4 - КоэффициентШК;
		КонецЦикла;
		СуммаШтрихКода = (10 - СуммаШтрихКода % 10) % 10;
		Если EAN8_Булево И (КодСимвола(текШтрихКод, 8) = СуммаШтрихКода + 48) Тогда
			Тип_ШтрихКода = "EAN8";
		КонецЕсли;
		
	КонецЕсли;
	
	Если Тип_ШтрихКода= "" Тогда // CODE39
		
		CODE39_Булево = Истина;
		Для Сч = 1 По Длина_ШтрихКода Цикл
			ВремКодСимвола = КодСимвола(текШтрихКод, Сч);
			Если (ВремКодСимвола <> 32)
				И (ВремКодСимвола < 36 Или ВремКодСимвола > 37)
				И (ВремКодСимвола <> 43)
				И (ВремКодСимвола < 45 Или ВремКодСимвола > 57)
				И (ВремКодСимвола < 65 Или ВремКодСимвола > 90) Тогда
				CODE39_Булево = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если CODE39_Булево Тогда
			Тип_ШтрихКода = "CODE39";
		КонецЕсли
		
	КонецЕсли;
	
	/////////////////// ЛЕГПРОМ ////////////////////////////////////////////////////
	// 2 символа - 01,
	// 14 символов — GTIN, международный код продукции,
	// 2 символа - 21,
	// 13 символов + 1 — Серийный номер + <GS>,
	// 2 символа — 91,
	// 4 символа + 1 - ИД ключа проверки + <GS>,
	// 2 символа — 92,
	// 88 символов - Код проверки.
	// ИТОГО ЗНАЧИМЫХ: 2 + 14 + 2 + 13 = 31 символ
	////////////////////////////////////////////////////////////////////////////////
	Если Тип_ШтрихКода= "" Тогда  // DataMatrix
		Если Длина_ШтрихКода > 31 Тогда
			Тип_ШтрихКода = "DataMatrix";
		КонецЕсли;
	КонецЕсли;
	
	Если Тип_ШтрихКода= "" Тогда // CODE128
		// CODE128 может содержать и цифровые, и буквенные обозначения
		// CODE128 символы ASCII от 0 до 127
		// (цифры от 0 до 9, буквы от A до Z и от a до z) и специальные символы
		CODE128_Булево = Истина;
		Для Сч = 1 По Длина_ШтрихКода Цикл
			ВремКодСимвола = КодСимвола(текШтрихКод, Сч);
			Если (ВремКодСимвола > 127) Тогда
				CODE128_Булево = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если CODE128_Булево Тогда
			Тип_ШтрихКода = "CODE128";
		КонецЕсли;
		
	КонецЕсли;
	
	Если Тип_ШтрихКода = "CODE128" Тогда // EAN128 может содержать ТОЛЬКО цифровые обозначения
		// В коде EAN128 регламентирован словарь CODE128
		
		EAN128_Булево = Истина;
		Для Сч = 1 По Длина_ШтрихКода Цикл
			ВремКодСимвола = Сред(текШтрихКод, Сч, 1);
			Если Найти("0123456789", ВремКодСимвола) = 0 Тогда
				EAN128_Булево = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если EAN128_Булево Тогда
			Тип_ШтрихКода = "EAN128";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Тип_ШтрихКода;
	
КонецФункции

#КонецОбласти
// Шворобей ВЮ 20.03.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2124

Функция ПроверкаГТД(Знач Наименование) Экспорт
	
	СтруктураВозврата = Новый Структура("Успех, ТекстОшибки", Ложь, "");
	
	Если СтрДлина(Наименование) = 23 тогда
		СтрДлинаЗначения = СтрДлина(Наименование);
		ПервоеЗначение = Найти(Наименование,"/");
		Если ПервоеЗначение <> 9 тогда
			СтруктураВозврата.Вставить("ТекстОшибки", "Проверьте правильность первого сегмента ГТД");
			Возврат СтруктураВозврата;
		КонецЕсли;
		ВтороеЗначение = Найти(Прав(Наименование,СтрДлинаЗначения-ПервоеЗначение),"/"); 
		Если ВтороеЗначение <> 7 тогда
			СтруктураВозврата.Вставить("ТекстОшибки", "Проверьте правильность второго сегмента ГТД");
			Возврат СтруктураВозврата;
		КонецЕсли;
		//Какие то странные ГТД, когда товар сделан в польше, но ввезён из Белорусии
	ИначеЕсли СтрДлина(Наименование) = 20  тогда
		СтрДлинаЗначения = СтрДлина(Наименование);
		ПервоеЗначение = Найти(Наименование,"/");
		Если ПервоеЗначение <> 6 тогда
			СтруктураВозврата.Вставить("ТекстОшибки", "Проверьте правильность первого сегмента ГТД");
			Возврат СтруктураВозврата;                              
		КонецЕсли;
		ВтороеЗначение = Найти(Прав(Наименование,СтрДлинаЗначения-ПервоеЗначение),"/"); 
		Если ВтороеЗначение <> 7 тогда
			СтруктураВозврата.Вставить("ТекстОшибки", "Проверьте правильность второго сегмента ГТД");
			Возврат СтруктураВозврата;
		КонецЕсли;      
	Иначе
		СтрДлинаЗначения = СтрДлина(Наименование);
		ПервоеЗначение = Найти(Наименование,"/");
		Если ПервоеЗначение <> 9 тогда
			СтруктураВозврата.Вставить("ТекстОшибки", "Проверьте правильность первого сегмента ГТД");
			Возврат СтруктураВозврата;
		КонецЕсли;
		ВтороеЗначение = Найти(Прав(Наименование,СтрДлинаЗначения-ПервоеЗначение),"/"); 
		Если ВтороеЗначение <> 7 тогда
			СтруктураВозврата.Вставить("ТекстОшибки", "Проверьте правильность второго сегмента ГТД");
			Возврат СтруктураВозврата;
		КонецЕсли;
		ТретиеЗначение = Найти(Прав(Наименование,СтрДлинаЗначения-ПервоеЗначение-ВтороеЗначение),"/");
		Если ТретиеЗначение <> 8 тогда
			СтруктураВозврата.Вставить("ТекстОшибки", "Проверьте правильность третьего сегмента ГТД");
			Возврат СтруктураВозврата;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураВозврата.Вставить("Успех", Истина);
	Возврат СтруктураВозврата;
	
КонецФункции

#Если Клиент Тогда
Процедура ШкалаВСтрокеСостояния(ТекЗапись, Записей = 1, ПоказыватьПроцент = Истина, ПоказыватьПозицию = Истина, СвойТекстВКонце = "") Экспорт
    Текст = СокрЛП(СвойТекстВКонце);
    Если НЕ Текст = "" Тогда Текст = " " + Текст; КонецЕсли;
    Точки = "....................................................................................................";
    Черточки = "!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!";
    Процент = ТекЗапись/Записей * 100;
    Если ПоказыватьПроцент = Истина Тогда
        ПроцентТекст = Формат(Процент, "ЧДЦ=1; ЧН=0,0");
    Иначе
        ПроцентТекст = "";
    КонецЕсли;
    Если ПоказыватьПозицию = Истина Тогда
        Позиция = Формат(ТекЗапись, "ЧН=0; ЧГ=") + "/" + Формат(Записей, "ЧН=0; ЧГ=");
    Иначе
        Позиция = "";
    КонецЕсли;
    Шкала = Лев(Лев(Черточки, Цел(Процент)) + Точки, 100);
    Если ПоказыватьПозицию И ПоказыватьПроцент Тогда
        Состояние(Шкала + " (" + ПроцентТекст + "% - " + Позиция + ")" + Текст);
    ИначеЕсли ПоказыватьПозицию Тогда
        Состояние(Шкала + " (" + Позиция + ")" + Текст);
    ИначеЕсли ПоказыватьПроцент Тогда
        Состояние(Шкала + " (" + ПроцентТекст + "%)" + Текст);
    Иначе
        Состояние(Шкала + Текст);
    КонецЕсли;
КонецПроцедуры
#КонецЕсли

//Тимофеев Ю.А. начало 03.08.2023
//нужно для заполнеия табличной части документа Заявка на доставку
//и вызов при формировании печатной формы докумета макет СКД

Функция ВернутьАдресПолучателяАП(ПолныйАдресПолучателя) Экспорт
	//ПолныйАдресПолучателя=
	//АД: Тандер, адрес: Интернациональный пос., 346473, Ростовская обл., Октябрьский р-н, Интернациональный пос., ул.Майская, дом 4А 
	//АП: Интернациональный пос., 346473, Ростовская обл., Октябрьский р-н, Интернациональный пос., ул.Майская, дом 4А 
	//нужно оставить только
	//АП: Интернациональный пос., 346473, Ростовская обл., Октябрьский р-н, Интернациональный пос., ул.Майская, дом 4А
	
	ПоискМеткиАП =  Найти(ПолныйАдресПолучателя,"АП:");
	
	Если ПоискМеткиАП>0 Тогда 		
		НовыйАдресПолучателя=СокрЛП(Сред(ПолныйАдресПолучателя,ПоискМеткиАП));
	Иначе
		//Оставим как было
		НовыйАдресПолучателя=ПолныйАдресПолучателя; 		
	КонецЕсли;
	
	Возврат НовыйАдресПолучателя;
	
КонецФункции
//Тимофеев Ю.А. конец 03.08.2023

// Шворобей ВЮ 20.09.2023 ++
Функция ПолучитьРеквизитыОбъектаСтрокой(Знач ИсточникСсылка) Экспорт
	
	МетаданныеОбъекта = ИсточникСсылка.Метаданные();
	
	ЭтоСправочник = Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(ИсточникСсылка));
	ЭтоПланОбмена = ПланыОбмена.ТипВсеСсылки().СодержитТип(ТипЗнч(ИсточникСсылка));
	ЭтоПланВидовХарактеристик = ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(ТипЗнч(ИсточникСсылка));
	ЭтоПланВидовРасчета = ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(ТипЗнч(ИсточникСсылка));
	ЭтоДокумент = (Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ИсточникСсылка)) ИЛИ БизнесПроцессы.ТипВсеСсылки().СодержитТип(ТипЗнч(ИсточникСсылка)));
	ЭтоЗадача = Задачи.ТипВсеСсылки().СодержитТип(ТипЗнч(ИсточникСсылка));
	
	СписокРеквизитов = "";
	
	Если ЭтоСправочник ИЛИ ЭтоПланОбмена ИЛИ ЭтоПланВидовХарактеристик ИЛИ ЭтоПланВидовРасчета Тогда
		Если МетаданныеОбъекта.ДлинаКода > 0 Тогда
			СписокРеквизитов = "Код,";
		КонецЕсли;
		Если МетаданныеОбъекта.ДлинаНаименования > 0 Тогда
			СписокРеквизитов = СписокРеквизитов + "Наименование,";
		КонецЕсли;
		Если ЭтоСправочник ИЛИ ЭтоПланВидовХарактеристик Тогда
			Если МетаданныеОбъекта.Иерархический Тогда
				СписокРеквизитов = СписокРеквизитов + "Родитель,";
			КонецЕсли;
			Если ЭтоСправочник И (МетаданныеОбъекта.Владельцы.Количество() <> 0) Тогда
				СписокРеквизитов = СписокРеквизитов + "Владелец,";
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ЭтоДокумент Тогда
		Если МетаданныеОбъекта.ДлинаНомера > 0 Тогда
			СписокРеквизитов = "Номер,";
		КонецЕсли;
		СписокРеквизитов =  СписокРеквизитов + "Дата,";
	ИначеЕсли ЭтоЗадача Тогда
		Если МетаданныеОбъекта.ДлинаНомера > 0 Тогда
			СписокРеквизитов = "Номер,";
		КонецЕсли;
		СписокРеквизитов =  СписокРеквизитов + "Дата,";
		Если МетаданныеОбъекта.ДлинаНаименования > 0 Тогда
			СписокРеквизитов = СписокРеквизитов + "Наименование,";
		КонецЕсли;
	КонецЕсли;
	
	СписокРеквизитов = СписокРеквизитов + "ПометкаУдаления,";
	
	Для каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл
		СписокРеквизитов = СписокРеквизитов + Реквизит.Имя + ",";
	КонецЦикла;

    //Отрезаем последнюю запятую
    СписокРеквизитов = Лев(СписокРеквизитов, СтрДлина(СписокРеквизитов) - 1);
	
	Возврат СписокРеквизитов;
	
КонецФункции
// Шворобей ВЮ 20.09.2023 ++

// Шворобей ВЮ 20.09.2023 ++
Функция СформироватьСтрокуРеквизитовПоШаблону(Знач ИсточникСсылка, ШаблонРеквизитов = "") Экспорт
	
	СписокРеквизитовИсточника = ПолучитьРеквизитыОбъектаСтрокой(ИсточникСсылка);
	
	СписокРеквизитов = "";
	
	Если НЕ ПустаяСтрока(СписокРеквизитовИсточника) И НЕ ПустаяСтрока(ШаблонРеквизитов) Тогда
		
		МассивШаблонаРеквизитов = РазложитьСтрокуВМассивПодстрок(ШаблонРеквизитов, ",");
		
		Для Каждого ИмяРеквизита ИЗ МассивШаблонаРеквизитов Цикл
			Позиция = Найти(СписокРеквизитовИсточника, ИмяРеквизита);
			Если Позиция <> 0 Тогда
				СписокРеквизитов = СписокРеквизитов + ИмяРеквизита + ",";	
			КонецЕсли;
		КонецЦикла;
		
		//Отрезаем последнюю запятую
    	СписокРеквизитов = Лев(СписокРеквизитов, СтрДлина(СписокРеквизитов) - 1);
		
	КонецЕсли;
	
	Возврат СписокРеквизитов;
	
КонецФункции
// Шворобей ВЮ 20.09.2023 ++

// Шворобей ВЮ 13.10.2023 ++
Функция RGB_HEX(Знач Red, Знач Green, Знач Blue) Экспорт
	
	Возврат "#" + Сред(DecToAny(ПобитовоеИли(ПобитовоеИли(ПобитовоеИли(Blue, ПобитовыйСдвигВлево(Green, 8)), ПобитовыйСдвигВлево(Red, 16)), ПобитовыйСдвигВлево(1, 24)), 16), 2);
	
КонецФункции

Функция DecToAny(Знач тЗначение, тОснование)
	
	тРезультат = "";
	
	Пока тЗначение > 0 Цикл
		тРезультат = Сред("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ", тЗначение%тОснование + 1, 1) + тРезультат;
		тЗначение = Цел(тЗначение/тОснование) ;
	КонецЦикла;
	
	Возврат тРезультат;
	
КонецФункции
// Шворобей ВЮ 13.10.2023 ++

//////////////////// РАБОТА С СКД (НЕ ГЛОБАЛЬНЫЕ ФУНКЦИИ) ///////////////////////////////////////////

Процедура УстановитьПараметрСКД(КомпоновщикНастроек, ИмяПараметра, Значение) Экспорт
	
	Перем ПараметрДанных;
	
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	
	Если ПараметрДанных <> Неопределено Тогда
		ПараметрДанных.Использование = Истина;
		ПараметрДанных.Значение = Значение;
	КонецЕсли;
	
КонецПроцедуры  //  УстановитьПараметрСКД

Процедура УстановитьОтборСКД(КомпоновщикНастроек, ИмяОтбора, Значение, ВидСравнения = Неопределено) Экспорт
	
	Перем Настройки, ПолеКД, Элем, ЭлементОтбора;
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	ПолеКД = Новый ПолеКомпоновкиДанных(ИмяОтбора);
	
	Для Каждого Элем Из Настройки.Отбор.Элементы Цикл
		Если Элем.ЛевоеЗначение = ПолеКД Тогда
			ЭлементОтбора = Элем;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЭлементОтбора = Неопределено Тогда
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = ПолеКД;
	КонецЕсли;		
	
	ЭлементОтбора.Использование = (Значение <> Неопределено);
	ЭлементОтбора.ВидСравнения = ?(ВидСравнения <> Неопределено, ВидСравнения, ВидСравненияКомпоновкиДанных.Равно); 
	ЭлементОтбора.ПравоеЗначение  = Значение;

КонецПроцедуры //  УстановитьОтборСКД

/////////// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ НА СЕРВЕРЕ ///////////////////////////////////

//вывод контрольной информации в печ. форму для сравнения спецификаций
Процедура ВывестиКонтрольнуюИнформациюВВыходнуюТаблицуСервер(ДокОбъект,Таб,Макет) Экспорт	
	Если Константы.НеВыводитьКонтрольнуюИнформациюПриПечати.Получить() Тогда Возврат КонецЕсли;
	
	МетаДок=ДокОбъект.Метаданные();
	
	ПараметрыШапки=Новый Структура;
	
	Вид80=ДокОбъект.Метаданные().Имя;
	Если Вид80="РасходнаяНакладная" Тогда
		Вид77=?(ДокОбъект.ВидОплаты=Перечисления.ВидыОплаты.НАЛ,"РасходнаяНАЛ","РасходнаяБН");
	Иначе
		Вид77=Вид80;			
	КонецЕсли; 
	
	ПараметрыШапки.Вставить("Вид77",Вид77);
	ПараметрыШапки.Вставить("Номер",ДокОбъект.Номер);
	ПараметрыШапки.Вставить("Дата",	ДокОбъект.Дата);
	
	Если ЕстьРеквизитДокументаСервер("ДатаОтгрузки",МетаДок) Тогда
		ПараметрыШапки.Вставить("ДатаОтгрузки",	ДокОбъект.ДатаОтгрузки);		
	КонецЕсли; 
	
	Если ЕстьРеквизитДокументаСервер("Контрагент",МетаДок) Тогда
		ПараметрыШапки.Вставить("КонтрагентНаименование",	ДокОбъект.Контрагент.Наименование);	
		ПараметрыШапки.Вставить("КонтрагентКод",			ДокОбъект.Контрагент.Код);
	КонецЕсли;
	
	ПараметрыШапки.Вставить("СкладНаименование",		ДокОбъект.Склад.Наименование);
	ПараметрыШапки.Вставить("СкладКод",					ДокОбъект.Склад.Код);	
	Если ЕстьРеквизитДокументаСервер("Организация",ДокОбъект.Метаданные()) Тогда
		Попытка
			ПараметрыШапки.Вставить("ОрганизацияНаименование",	ДокОбъект.Организация.Наименование);
		Исключение
			ПараметрыШапки.Вставить("ОрганизацияНаименование",	Справочники.Организации.НайтиПоКоду("SS-001"));
		КонецПопытки;
	КонецЕсли;	
	
	Обл_Шапка=Макет.ПолучитьОбласть("Контроль_Шапка");
	Обл_Шапка.Параметры.Заполнить(ПараметрыШапки);
	
	НачСтрока=Таб.ВысотаТаблицы+1;
	
	Таб.Вывести(Обл_Шапка);
	
	Для Каждого СтрокаТЧ Из ДокОбъект.Товары  Цикл
		ОблСтрока=Макет.ПолучитьОбласть("Контроль_Строка");
		
		ПараметрыСтроки=Новый Структура;
		
		ПараметрыСтроки.Вставить("Код77",		СтрокаТЧ.Номенклатура.Код77);
		ПараметрыСтроки.Вставить("Наименование",СтрокаТЧ.Номенклатура.Наименование);
		ПараметрыСтроки.Вставить("Количество",	СтрокаТЧ.Количество);
		
		Если Вид80<>"ЛистНабора" Тогда
			ПараметрыСтроки.Вставить("Цена",		СтрокаТЧ.Цена);
			ПараметрыСтроки.Вставить("НДС",			СтрокаТЧ.НДС);
			ПараметрыСтроки.Вставить("Всего",		СтрокаТЧ.Всего);		
		КонецЕсли; 
		
		ОблСтрока.Параметры.Заполнить(ПараметрыСтроки);		
		
		Таб.Вывести(ОблСтрока);
	КонецЦикла;
	
	Таб.Область(НачСтрока,,Таб.ВысотаТаблицы).Видимость=Ложь;
КонецПроцедуры

//ПРОВЕРКА НАЛИЧИЯ РЕКВИЗИТОВ ОБЪЕКТОВ
// Позволяет определить есть ли среди реквизитов шапки документа
// реквизит с переданным именем.
//
// Параметры: 
//  ИмяРеквизита - строковое имя искомого реквизита, 
//  МетаданныеДокумента - объект описания метаданных документа, среди реквизитов которого производится поиск.
//
// Возвращаемое значение:
//  Истина - нашли реквизит с таким именем, Ложь - не нашли.
//
Функция ЕстьРеквизитДокументаСервер(ИмяРеквизита, МетаданныеДокумента) Экспорт
	
	// Шворобей В.Ю. 18.05.2023 ++
	Для Каждого Элемент Из МетаданныеДокумента.СтандартныеРеквизиты Цикл
		Если Элемент.Имя = ИмяРеквизита Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	// Шворобей В.Ю. 18.05.2023 ++
	
	Если МетаданныеДокумента.Реквизиты.Найти(ИмяРеквизита) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли; 
	
КонецФункции // ЕстьРеквизитДокументаСервер()

Процедура УстановитьКолонтитулыСервер(ТД,ПопожениеКолонтитула="Верхний") Экспорт
	
	Если ПопожениеКолонтитула="Верхний" Тогда
		Колонтитул=ТД.ВерхнийКолонтитул;
	Иначе
		Колонтитул=ТД.НижнийКолонтитул;	
	КонецЕсли; 
	
	Колонтитул.Выводить=Истина;
	Колонтитул.ВертикальноеПоложение=ВертикальноеПоложение.Верх;
	
	Колонтитул.ТекстСлева="Сформирован: "+СокрЛП(ПараметрыСеанса.Пользователь)+", "+ТекущаяДата();	
	// Кухарь А.Ю. 08.02.2021 начало
	//Глюк платформы какой-то 8.3.15.1830. В этот колонтитул криво передаётся сочетание пробела с цифрами	
	Колонтитул.ТекстСлева=СтрЗаменить(Колонтитул.ТекстСлева," ",Символы.НПП);  
	// Кухарь А.Ю. 08.02.2021 конец

	
	
	Колонтитул.ТекстСправа="Стр. № [&НомерСтраницы]из [&СтраницВсего]";
	
КонецПроцедуры
 
Функция ЗаполнитьКодировки()
	
	КодировкаПрямая=Новый Соответствие;
	
	КодировкаПрямая.Вставить(" ",32);
	КодировкаПрямая.Вставить("!",33);
	КодировкаПрямая.Вставить("""",34);
	КодировкаПрямая.Вставить("#",35);
	КодировкаПрямая.Вставить("$",36);
	КодировкаПрямая.Вставить("%",37);
	КодировкаПрямая.Вставить("&",38);
	КодировкаПрямая.Вставить("'",39);
	КодировкаПрямая.Вставить("(",40);
	КодировкаПрямая.Вставить(")",41);
	КодировкаПрямая.Вставить("*",42);
	КодировкаПрямая.Вставить("+",43);
	КодировкаПрямая.Вставить(",",44);
	КодировкаПрямая.Вставить("-",45);
	КодировкаПрямая.Вставить(".",46);
	КодировкаПрямая.Вставить("/",47);
	КодировкаПрямая.Вставить("0",48);
	КодировкаПрямая.Вставить("1",49);
	КодировкаПрямая.Вставить("2",50);
	КодировкаПрямая.Вставить("3",51);
	КодировкаПрямая.Вставить("4",52);
	КодировкаПрямая.Вставить("5",53);
	КодировкаПрямая.Вставить("6",54);
	КодировкаПрямая.Вставить("7",55);
	КодировкаПрямая.Вставить("8",56);
	КодировкаПрямая.Вставить("9",57);
	КодировкаПрямая.Вставить(":",58);
	КодировкаПрямая.Вставить(";",59);
	КодировкаПрямая.Вставить("<",60);
	КодировкаПрямая.Вставить("=",61);
	КодировкаПрямая.Вставить(">",62);
	КодировкаПрямая.Вставить("?",63);
	КодировкаПрямая.Вставить("@",64);
	КодировкаПрямая.Вставить("A",65);
	КодировкаПрямая.Вставить("B",66);
	КодировкаПрямая.Вставить("C",67);
	КодировкаПрямая.Вставить("D",68);
	КодировкаПрямая.Вставить("E",69);
	КодировкаПрямая.Вставить("F",70);
	КодировкаПрямая.Вставить("G",71);
	КодировкаПрямая.Вставить("H",72);
	КодировкаПрямая.Вставить("I",73);
	КодировкаПрямая.Вставить("J",74);
	КодировкаПрямая.Вставить("K",75);
	КодировкаПрямая.Вставить("L",76);
	КодировкаПрямая.Вставить("M",77);
	КодировкаПрямая.Вставить("N",78);
	КодировкаПрямая.Вставить("O",79);
	КодировкаПрямая.Вставить("P",80);
	КодировкаПрямая.Вставить("Q",81);
	КодировкаПрямая.Вставить("R",82);
	КодировкаПрямая.Вставить("S",83);
	КодировкаПрямая.Вставить("T",84);
	КодировкаПрямая.Вставить("U",85);
	КодировкаПрямая.Вставить("V",86);
	КодировкаПрямая.Вставить("W",87);
	КодировкаПрямая.Вставить("X",88);
	КодировкаПрямая.Вставить("Y",89);
	КодировкаПрямая.Вставить("Z",90);
	КодировкаПрямая.Вставить("[",91);
	КодировкаПрямая.Вставить("\",92);
	КодировкаПрямая.Вставить("]",93);
	КодировкаПрямая.Вставить("^",94);
	КодировкаПрямая.Вставить("_",95);
	КодировкаПрямая.Вставить("`",96);
	КодировкаПрямая.Вставить("a",97);
	КодировкаПрямая.Вставить("b",98);
	КодировкаПрямая.Вставить("c",99);
	КодировкаПрямая.Вставить("d",100);
	КодировкаПрямая.Вставить("e",101);
	КодировкаПрямая.Вставить("f",102);
	КодировкаПрямая.Вставить("g",103);
	КодировкаПрямая.Вставить("h",104);
	КодировкаПрямая.Вставить("i",105);
	КодировкаПрямая.Вставить("j",106);
	КодировкаПрямая.Вставить("k",107);
	КодировкаПрямая.Вставить("l",108);
	КодировкаПрямая.Вставить("m",109);
	КодировкаПрямая.Вставить("n",110);
	КодировкаПрямая.Вставить("o",111);
	КодировкаПрямая.Вставить("p",112);
	КодировкаПрямая.Вставить("q",113);
	КодировкаПрямая.Вставить("r",114);
	КодировкаПрямая.Вставить("s",115);
	КодировкаПрямая.Вставить("t",116);
	КодировкаПрямая.Вставить("u",117);
	КодировкаПрямая.Вставить("v",118);
	КодировкаПрямая.Вставить("w",119);
	КодировкаПрямая.Вставить("x",120);
	КодировкаПрямая.Вставить("y",121);
	КодировкаПрямая.Вставить("z",122);
	КодировкаПрямая.Вставить("{",123);
	КодировкаПрямая.Вставить("|",124);
	КодировкаПрямая.Вставить("}",125);
	КодировкаПрямая.Вставить("~",126);
	КодировкаПрямая.Вставить("",127);
	КодировкаПрямая.Вставить("Ђ",128);
	КодировкаПрямая.Вставить("Ѓ",129);
	КодировкаПрямая.Вставить("‚",130);
	КодировкаПрямая.Вставить("ѓ",131);
	КодировкаПрямая.Вставить("„",132);
	КодировкаПрямая.Вставить("…",133);
	КодировкаПрямая.Вставить("†",134);
	КодировкаПрямая.Вставить("‡",135);
	КодировкаПрямая.Вставить("€",136);
	КодировкаПрямая.Вставить("‰",137);
	КодировкаПрямая.Вставить("Љ",138);
	КодировкаПрямая.Вставить("‹",139);
	КодировкаПрямая.Вставить("Њ",140);
	КодировкаПрямая.Вставить("Ќ",141);
	КодировкаПрямая.Вставить("Ћ",142);
	КодировкаПрямая.Вставить("Џ",143);
	КодировкаПрямая.Вставить("ђ",144);
	КодировкаПрямая.Вставить("‘",145);
	КодировкаПрямая.Вставить("’",146);
	КодировкаПрямая.Вставить("“",147);
	КодировкаПрямая.Вставить("”",148);
	КодировкаПрямая.Вставить("•",149);
	КодировкаПрямая.Вставить("–",150);
	КодировкаПрямая.Вставить("—",151);
	КодировкаПрямая.Вставить("",152);
	КодировкаПрямая.Вставить("™",153);
	КодировкаПрямая.Вставить("љ",154);
	КодировкаПрямая.Вставить("›",155);
	КодировкаПрямая.Вставить("њ",156);
	КодировкаПрямая.Вставить("ќ",157);
	КодировкаПрямая.Вставить("ћ",158);
	КодировкаПрямая.Вставить("џ",159);
	КодировкаПрямая.Вставить(" ",160);
	КодировкаПрямая.Вставить("Ў",161);
	КодировкаПрямая.Вставить("ў",162);
	КодировкаПрямая.Вставить("Ј",163);
	КодировкаПрямая.Вставить("¤",164);
	КодировкаПрямая.Вставить("Ґ",165);
	КодировкаПрямая.Вставить("¦",166);
	КодировкаПрямая.Вставить("§",167);
	КодировкаПрямая.Вставить("Ё",168);
	КодировкаПрямая.Вставить("©",169);
	КодировкаПрямая.Вставить("Є",170);
	КодировкаПрямая.Вставить("«",171);
	КодировкаПрямая.Вставить("¬",172);
	КодировкаПрямая.Вставить("",173);
	КодировкаПрямая.Вставить("®",174);
	КодировкаПрямая.Вставить("Ї",175);
	КодировкаПрямая.Вставить("°",176);
	КодировкаПрямая.Вставить("±",177);
	КодировкаПрямая.Вставить("І",178);
	КодировкаПрямая.Вставить("і",179);
	КодировкаПрямая.Вставить("ґ",180);
	КодировкаПрямая.Вставить("µ",181);
	КодировкаПрямая.Вставить("¶",182);
	КодировкаПрямая.Вставить("·",183);
	КодировкаПрямая.Вставить("ё",184);
	КодировкаПрямая.Вставить("№",185);
	КодировкаПрямая.Вставить("є",186);
	КодировкаПрямая.Вставить("»",187);
	КодировкаПрямая.Вставить("ј",188);
	КодировкаПрямая.Вставить("Ѕ",189);
	КодировкаПрямая.Вставить("ѕ",190);
	КодировкаПрямая.Вставить("ї",191);
	КодировкаПрямая.Вставить("А",192);
	КодировкаПрямая.Вставить("Б",193);
	КодировкаПрямая.Вставить("В",194);
	КодировкаПрямая.Вставить("Г",195);
	КодировкаПрямая.Вставить("Д",196);
	КодировкаПрямая.Вставить("Е",197);
	КодировкаПрямая.Вставить("Ж",198);
	КодировкаПрямая.Вставить("З",199);
	КодировкаПрямая.Вставить("И",200);
	КодировкаПрямая.Вставить("Й",201);
	КодировкаПрямая.Вставить("К",202);
	КодировкаПрямая.Вставить("Л",203);
	КодировкаПрямая.Вставить("М",204);
	КодировкаПрямая.Вставить("Н",205);
	КодировкаПрямая.Вставить("О",206);
	КодировкаПрямая.Вставить("П",207);
	КодировкаПрямая.Вставить("Р",208);
	КодировкаПрямая.Вставить("С",209);
	КодировкаПрямая.Вставить("Т",210);
	КодировкаПрямая.Вставить("У",211);
	КодировкаПрямая.Вставить("Ф",212);
	КодировкаПрямая.Вставить("Х",213);
	КодировкаПрямая.Вставить("Ц",214);
	КодировкаПрямая.Вставить("Ч",215);
	КодировкаПрямая.Вставить("Ш",216);
	КодировкаПрямая.Вставить("Щ",217);
	КодировкаПрямая.Вставить("Ъ",218);
	КодировкаПрямая.Вставить("Ы",219);
	КодировкаПрямая.Вставить("Ь",220);
	КодировкаПрямая.Вставить("Э",221);
	КодировкаПрямая.Вставить("Ю",222);
	КодировкаПрямая.Вставить("Я",223);
	КодировкаПрямая.Вставить("а",224);
	КодировкаПрямая.Вставить("б",225);
	КодировкаПрямая.Вставить("в",226);
	КодировкаПрямая.Вставить("г",227);
	КодировкаПрямая.Вставить("д",228);
	КодировкаПрямая.Вставить("е",229);
	КодировкаПрямая.Вставить("ж",230);
	КодировкаПрямая.Вставить("з",231);
	КодировкаПрямая.Вставить("и",232);
	КодировкаПрямая.Вставить("й",233);
	КодировкаПрямая.Вставить("к",234);
	КодировкаПрямая.Вставить("л",235);
	КодировкаПрямая.Вставить("м",236);
	КодировкаПрямая.Вставить("н",237);
	КодировкаПрямая.Вставить("о",238);
	КодировкаПрямая.Вставить("п",239);
	КодировкаПрямая.Вставить("р",240);
	КодировкаПрямая.Вставить("с",241);
	КодировкаПрямая.Вставить("т",242);
	КодировкаПрямая.Вставить("у",243);
	КодировкаПрямая.Вставить("ф",244);
	КодировкаПрямая.Вставить("х",245);
	КодировкаПрямая.Вставить("ц",246);
	КодировкаПрямая.Вставить("ч",247);
	КодировкаПрямая.Вставить("ш",248);
	КодировкаПрямая.Вставить("щ",249);
	КодировкаПрямая.Вставить("ъ",250);
	КодировкаПрямая.Вставить("ы",251);
	КодировкаПрямая.Вставить("ь",252);
	КодировкаПрямая.Вставить("э",253);
	КодировкаПрямая.Вставить("ю",254);
	КодировкаПрямая.Вставить("я",255);
	
	КодировкаОбратная=Новый Соответствие;
	
	КодировкаОбратная.Вставить(32," ");
	КодировкаОбратная.Вставить(33,"!");
	КодировкаОбратная.Вставить(34,"""");
	КодировкаОбратная.Вставить(35,"#");
	КодировкаОбратная.Вставить(36,"$");
	КодировкаОбратная.Вставить(37,"%");
	КодировкаОбратная.Вставить(38,"&");
	КодировкаОбратная.Вставить(39,"'");
	КодировкаОбратная.Вставить(40,"(");
	КодировкаОбратная.Вставить(41,")");
	КодировкаОбратная.Вставить(42,"*");
	КодировкаОбратная.Вставить(43,"+");
	КодировкаОбратная.Вставить(44,",");
	КодировкаОбратная.Вставить(45,"-");
	КодировкаОбратная.Вставить(46,".");
	КодировкаОбратная.Вставить(47,"/");
	КодировкаОбратная.Вставить(48,"0");
	КодировкаОбратная.Вставить(49,"1");
	КодировкаОбратная.Вставить(50,"2");
	КодировкаОбратная.Вставить(51,"3");
	КодировкаОбратная.Вставить(52,"4");
	КодировкаОбратная.Вставить(53,"5");
	КодировкаОбратная.Вставить(54,"6");
	КодировкаОбратная.Вставить(55,"7");
	КодировкаОбратная.Вставить(56,"8");
	КодировкаОбратная.Вставить(57,"9");
	КодировкаОбратная.Вставить(58,":");
	КодировкаОбратная.Вставить(59,";");
	КодировкаОбратная.Вставить(60,"<");
	КодировкаОбратная.Вставить(61,"=");
	КодировкаОбратная.Вставить(62,">");
	КодировкаОбратная.Вставить(63,"?");
	КодировкаОбратная.Вставить(64,"@");
	КодировкаОбратная.Вставить(65,"A");
	КодировкаОбратная.Вставить(66,"B");
	КодировкаОбратная.Вставить(67,"C");
	КодировкаОбратная.Вставить(68,"D");
	КодировкаОбратная.Вставить(69,"E");
	КодировкаОбратная.Вставить(70,"F");
	КодировкаОбратная.Вставить(71,"G");
	КодировкаОбратная.Вставить(72,"H");
	КодировкаОбратная.Вставить(73,"I");
	КодировкаОбратная.Вставить(74,"J");
	КодировкаОбратная.Вставить(75,"K");
	КодировкаОбратная.Вставить(76,"L");
	КодировкаОбратная.Вставить(77,"M");
	КодировкаОбратная.Вставить(78,"N");
	КодировкаОбратная.Вставить(79,"O");
	КодировкаОбратная.Вставить(80,"P");
	КодировкаОбратная.Вставить(81,"Q");
	КодировкаОбратная.Вставить(82,"R");
	КодировкаОбратная.Вставить(83,"S");
	КодировкаОбратная.Вставить(84,"T");
	КодировкаОбратная.Вставить(85,"U");
	КодировкаОбратная.Вставить(86,"V");
	КодировкаОбратная.Вставить(87,"W");
	КодировкаОбратная.Вставить(88,"X");
	КодировкаОбратная.Вставить(89,"Y");
	КодировкаОбратная.Вставить(90,"Z");
	КодировкаОбратная.Вставить(91,"[");
	КодировкаОбратная.Вставить(92,"\");
	КодировкаОбратная.Вставить(93,"]");
	КодировкаОбратная.Вставить(94,"^");
	КодировкаОбратная.Вставить(95,"_");
	КодировкаОбратная.Вставить(96,"`");
	КодировкаОбратная.Вставить(97,"a");
	КодировкаОбратная.Вставить(98,"b");
	КодировкаОбратная.Вставить(99,"c");
	КодировкаОбратная.Вставить(100,"d");
	КодировкаОбратная.Вставить(101,"e");
	КодировкаОбратная.Вставить(102,"f");
	КодировкаОбратная.Вставить(103,"g");
	КодировкаОбратная.Вставить(104,"h");
	КодировкаОбратная.Вставить(105,"i");
	КодировкаОбратная.Вставить(106,"j");
	КодировкаОбратная.Вставить(107,"k");
	КодировкаОбратная.Вставить(108,"l");
	КодировкаОбратная.Вставить(109,"m");
	КодировкаОбратная.Вставить(110,"n");
	КодировкаОбратная.Вставить(111,"o");
	КодировкаОбратная.Вставить(112,"p");
	КодировкаОбратная.Вставить(113,"q");
	КодировкаОбратная.Вставить(114,"r");
	КодировкаОбратная.Вставить(115,"s");
	КодировкаОбратная.Вставить(116,"t");
	КодировкаОбратная.Вставить(117,"u");
	КодировкаОбратная.Вставить(118,"v");
	КодировкаОбратная.Вставить(119,"w");
	КодировкаОбратная.Вставить(120,"x");
	КодировкаОбратная.Вставить(121,"y");
	КодировкаОбратная.Вставить(122,"z");
	КодировкаОбратная.Вставить(123,"{");
	КодировкаОбратная.Вставить(124,"|");
	КодировкаОбратная.Вставить(125,"}");
	КодировкаОбратная.Вставить(126,"~");
	КодировкаОбратная.Вставить(127,"");
	КодировкаОбратная.Вставить(128,"Ђ");
	КодировкаОбратная.Вставить(129,"Ѓ");
	КодировкаОбратная.Вставить(130,"‚");
	КодировкаОбратная.Вставить(131,"ѓ");
	КодировкаОбратная.Вставить(132,"„");
	КодировкаОбратная.Вставить(133,"…");
	КодировкаОбратная.Вставить(134,"†");
	КодировкаОбратная.Вставить(135,"‡");
	КодировкаОбратная.Вставить(136,"€");
	КодировкаОбратная.Вставить(137,"‰");
	КодировкаОбратная.Вставить(138,"Љ");
	КодировкаОбратная.Вставить(139,"‹");
	КодировкаОбратная.Вставить(140,"Њ");
	КодировкаОбратная.Вставить(141,"Ќ");
	КодировкаОбратная.Вставить(142,"Ћ");
	КодировкаОбратная.Вставить(143,"Џ");
	КодировкаОбратная.Вставить(144,"ђ");
	КодировкаОбратная.Вставить(145,"‘");
	КодировкаОбратная.Вставить(146,"’");
	КодировкаОбратная.Вставить(147,"“");
	КодировкаОбратная.Вставить(148,"”");
	КодировкаОбратная.Вставить(149,"•");
	КодировкаОбратная.Вставить(150,"–");
	КодировкаОбратная.Вставить(151,"—");
	КодировкаОбратная.Вставить(152,"");
	КодировкаОбратная.Вставить(153,"™");
	КодировкаОбратная.Вставить(154,"љ");
	КодировкаОбратная.Вставить(155,"›");
	КодировкаОбратная.Вставить(156,"њ");
	КодировкаОбратная.Вставить(157,"ќ");
	КодировкаОбратная.Вставить(158,"ћ");
	КодировкаОбратная.Вставить(159,"џ");
	КодировкаОбратная.Вставить(160," ");
	КодировкаОбратная.Вставить(161,"Ў");
	КодировкаОбратная.Вставить(162,"ў");
	КодировкаОбратная.Вставить(163,"Ј");
	КодировкаОбратная.Вставить(164,"¤");
	КодировкаОбратная.Вставить(165,"Ґ");
	КодировкаОбратная.Вставить(166,"¦");
	КодировкаОбратная.Вставить(167,"§");
	КодировкаОбратная.Вставить(168,"Ё");
	КодировкаОбратная.Вставить(169,"©");
	КодировкаОбратная.Вставить(170,"Є");
	КодировкаОбратная.Вставить(171,"«");
	КодировкаОбратная.Вставить(172,"¬");
	КодировкаОбратная.Вставить(173,"");
	КодировкаОбратная.Вставить(174,"®");
	КодировкаОбратная.Вставить(175,"Ї");
	КодировкаОбратная.Вставить(176,"°");
	КодировкаОбратная.Вставить(177,"±");
	КодировкаОбратная.Вставить(178,"І");
	КодировкаОбратная.Вставить(179,"і");
	КодировкаОбратная.Вставить(180,"ґ");
	КодировкаОбратная.Вставить(181,"µ");
	КодировкаОбратная.Вставить(182,"¶");
	КодировкаОбратная.Вставить(183,"·");
	КодировкаОбратная.Вставить(184,"ё");
	КодировкаОбратная.Вставить(185,"№");
	КодировкаОбратная.Вставить(186,"є");
	КодировкаОбратная.Вставить(187,"»");
	КодировкаОбратная.Вставить(188,"ј");
	КодировкаОбратная.Вставить(189,"Ѕ");
	КодировкаОбратная.Вставить(190,"ѕ");
	КодировкаОбратная.Вставить(191,"ї");
	КодировкаОбратная.Вставить(192,"А");
	КодировкаОбратная.Вставить(193,"Б");
	КодировкаОбратная.Вставить(194,"В");
	КодировкаОбратная.Вставить(195,"Г");
	КодировкаОбратная.Вставить(196,"Д");
	КодировкаОбратная.Вставить(197,"Е");
	КодировкаОбратная.Вставить(198,"Ж");
	КодировкаОбратная.Вставить(199,"З");
	КодировкаОбратная.Вставить(200,"И");
	КодировкаОбратная.Вставить(201,"Й");
	КодировкаОбратная.Вставить(202,"К");
	КодировкаОбратная.Вставить(203,"Л");
	КодировкаОбратная.Вставить(204,"М");
	КодировкаОбратная.Вставить(205,"Н");
	КодировкаОбратная.Вставить(206,"О");
	КодировкаОбратная.Вставить(207,"П");
	КодировкаОбратная.Вставить(208,"Р");
	КодировкаОбратная.Вставить(209,"С");
	КодировкаОбратная.Вставить(210,"Т");
	КодировкаОбратная.Вставить(211,"У");
	КодировкаОбратная.Вставить(212,"Ф");
	КодировкаОбратная.Вставить(213,"Х");
	КодировкаОбратная.Вставить(214,"Ц");
	КодировкаОбратная.Вставить(215,"Ч");
	КодировкаОбратная.Вставить(216,"Ш");
	КодировкаОбратная.Вставить(217,"Щ");
	КодировкаОбратная.Вставить(218,"Ъ");
	КодировкаОбратная.Вставить(219,"Ы");
	КодировкаОбратная.Вставить(220,"Ь");
	КодировкаОбратная.Вставить(221,"Э");
	КодировкаОбратная.Вставить(222,"Ю");
	КодировкаОбратная.Вставить(223,"Я");
	КодировкаОбратная.Вставить(224,"а");
	КодировкаОбратная.Вставить(225,"б");
	КодировкаОбратная.Вставить(226,"в");
	КодировкаОбратная.Вставить(227,"г");
	КодировкаОбратная.Вставить(228,"д");
	КодировкаОбратная.Вставить(229,"е");
	КодировкаОбратная.Вставить(230,"ж");
	КодировкаОбратная.Вставить(231,"з");
	КодировкаОбратная.Вставить(232,"и");
	КодировкаОбратная.Вставить(233,"й");
	КодировкаОбратная.Вставить(234,"к");
	КодировкаОбратная.Вставить(235,"л");
	КодировкаОбратная.Вставить(236,"м");
	КодировкаОбратная.Вставить(237,"н");
	КодировкаОбратная.Вставить(238,"о");
	КодировкаОбратная.Вставить(239,"п");
	КодировкаОбратная.Вставить(240,"р");
	КодировкаОбратная.Вставить(241,"с");
	КодировкаОбратная.Вставить(242,"т");
	КодировкаОбратная.Вставить(243,"у");
	КодировкаОбратная.Вставить(244,"ф");
	КодировкаОбратная.Вставить(245,"х");
	КодировкаОбратная.Вставить(246,"ц");
	КодировкаОбратная.Вставить(247,"ч");
	КодировкаОбратная.Вставить(248,"ш");
	КодировкаОбратная.Вставить(249,"щ");
	КодировкаОбратная.Вставить(250,"ъ");
	КодировкаОбратная.Вставить(251,"ы");
	КодировкаОбратная.Вставить(252,"ь");
	КодировкаОбратная.Вставить(253,"э");
	КодировкаОбратная.Вставить(254,"ю");
	КодировкаОбратная.Вставить(255,"я");
	
	СтруктураВозврата = Новый Структура("КодировкаПрямая, КодировкаОбратная", КодировкаПрямая, КодировкаОбратная); 
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция БайтовыйКодСимволаСервер(КодировкаПрямая, Символ)
	Возврат КодировкаПрямая[Символ];
КонецФункции // КодСимвола()

Функция СимволПоБайтовомуКодуСервер(КодировкаОбратная, Код)
	Возврат КодировкаОбратная[Код];
КонецФункции // ()

Функция Бинарное(НачЗн)
	Зн=НачЗн;	
	Стр="";	
	Для Сч=1 по 8 Цикл
		Бит=Зн%2;
		
		Стр=""+Бит+Стр;   
		Зн=(Зн-Бит)/2;		
	КонецЦикла;     
	
	Возврат Стр;
КонецФункции //

Функция Десятичное(НачЗн)
	Зн=0;
	База=128;
	
	ТекДлинна=Мин(СтрДлина(НачЗн),8);
	
	Для Сч=1 по ТекДлинна Цикл
		Зн=Зн+База*Число(Сред(НачЗн,Сч,1));					    
		База=База/2;
	КонецЦикла;
	
	Возврат Зн;
КонецФункции //Десятичное

Функция Закодировать64Сервер(НачСтр) Экспорт
	
	СтруктураВозврата = ЗаполнитьКодировки();
	
	База="ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";
	
	Стр=НачСтр;
	
	Остаток=СтрДлина(Стр) % 3;
	НеХватает=?(Остаток=0,0,3-Остаток); 
	
	Для Сч=1 по НеХватает Цикл
		Стр=Стр+" ";	    
	КонецЦикла;	
	    
	СтрокаБит="";
	
	Длина=СтрДлина(Стр);
	
	ПолнаяСтрока="";
	Для Сч=1 По Длина Цикл
		СтрокаБит=СтрокаБит+Бинарное(БайтовыйКодСимволаСервер(СтруктураВозврата.КодировкаПрямая, Сред(Стр,Сч,1)));		
	КонецЦикла;
	
	СтрокаКода="";
	Пока СтрДлина(СтрокаБит)>0 Цикл		
		БитовоеЗначение="00"+Лев(СтрокаБит,6);
		
		СтрокаКода	=СтрокаКода+Сред(База,Десятичное(БитовоеЗначение)+1,1);			    
		СтрокаБит	=Сред(СтрокаБит,7);
	КонецЦикла;                                                      
	
	Возврат СтрокаКода;	
КонецФункции // 

Функция Раскодировать64Сервер(НачСтр)
	
	СтруктураВозврата = ЗаполнитьКодировки();
	
	База="ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";
	
	Стр=СокрЛП(НачСтр);
	
	СтрокаБит="";
	
	Длина=СтрДлина(Стр);
	
	ПолнаяСтрока="";
	Для Сч=1 По Длина Цикл
		Символ=Сред(Стр,Сч,1);
		Десятичное=Найти(База,Символ)-1;		
		СтрокаБит=СтрокаБит+Сред(Бинарное(Десятичное),3);		
	КонецЦикла;
	              
	СтрокаИсходная="";
	Пока СтрДлина(СтрокаБит)>0 Цикл		
		БитовоеЗначение=Лев(СтрокаБит,8);
		
		СтрокаИсходная	=СтрокаИсходная+СимволПоБайтовомуКодуСервер(СтруктураВозврата.КодировкаОбратная, Десятичное(БитовоеЗначение));			    
		СтрокаБит		=Сред(СтрокаБит,9);
	КонецЦикла;                      
	
	Возврат СтрокаИсходная;	    
КонецФункции //Раскодировать

////////// СОЗДАТЬ И ЗАПОЛНИТЬ ДОКУМЕНТЫ /////////////////////////////////////////////////////////////
#Область СоздатьИЗаполнитьДокументы

Функция СоздатьПеремещение(ДокументСсылка = Неопределено, ТаблицаКЗагрузке, СкладИсточник = Неопределено, СкладПолучатель = Неопределено,
			Комментарий = "", ДополнительныеРеквизиты = Неопределено, Проводить = Истина, СоздаватьНовый = Ложь, ЗаписыватьБезПроверкиФизСкладов = ложь) Экспорт 
			//++Данилова Е.В. 09.10.2025 HELP-5978
	
	Если ТаблицаКЗагрузке.Количество() = 0 Тогда Возврат Неопределено; КонецЕсли;
	
	Перемещение = СоздатьИзменитьДокумент(ДокументСсылка, "Перемещение",,,СоздаватьНовый);
	Перемещение.Дата = ?(ДокументСсылка = Неопределено, НачалоДня(ТекущаяДата()), НачалоДня(ДокументСсылка.Дата));
	Перемещение.ДатаОтгрузки = ?(ДокументСсылка = Неопределено, НачалоДня(ТекущаяДата()), НачалоДня(ДокументСсылка.Дата));
	Перемещение.ДатаПриемки = ?(ДокументСсылка = Неопределено, НачалоДня(ТекущаяДата()), НачалоДня(ДокументСсылка.Дата));
	
	ЗаполнитьШапкуДокумента(Перемещение,ПараметрыСеанса.Пользователь);
	
	Перемещение.ДокОснование = ?(ДокументСсылка <> Неопределено, ДокументСсылка, Неопределено);
	Перемещение.ЗаявкаНаПерепаковку = ?(ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаявкаНаПерепаковку"), ДокументСсылка, Неопределено);
	
	Перемещение.СкладПолучатель = СкладПолучатель; // ДокументСсылка.Склад
	ОбменЭДО.УстановитьПунктДоставкиСб2б(Перемещение,"СкладПолучатель","ПунктДоставки");
	
	Перемещение.Валюта = Справочники.Валюты.НайтиПоКоду("810");
	Перемещение.Курс = 1;
		
	Перемещение.Склад = СкладИсточник;
	Перемещение.Комментарий = ?(СокрЛП(Комментарий) <> "", Комментарий, "Перемещение для Перепаковки" + Строка(ДокументСсылка));
	
	УстановитьНомерДокументаКлиентСервер(Перемещение);
	
	Если ТипЗнч(ДополнительныеРеквизиты) = Тип("Структура") Тогда
		Для Каждого Элемент из ДополнительныеРеквизиты Цикл
			УстановитьРеквизитШапки(Перемещение, Элемент.Ключ, Элемент.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Перемещение.Товары.Очистить();
	
	Для Каждого СтрокаТЧ ИЗ ТаблицаКЗагрузке Цикл
		
		НоваяСтрока = Перемещение.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		
		Если ТаблицаКЗагрузке.Колонки.Найти("Заявка") = Неопределено Тогда
			НоваяСтрока.Заявка = НоваяСтрока.Количество;
		КонецЕсли;
		Если ТаблицаКЗагрузке.Колонки.Найти("ПодтвержденнаяЗаявка") = Неопределено Тогда
			НоваяСтрока.ПодтвержденнаяЗаявка = НоваяСтрока.Количество;
		КонецЕсли;
		Если ТаблицаКЗагрузке.Колонки.Найти("ПодтвержденнаяЗаявкаПеремещения") = Неопределено Тогда
			НоваяСтрока.ПодтвержденнаяЗаявкаПеремещения = НоваяСтрока.Количество;
		КонецЕсли;
		Если ТаблицаКЗагрузке.Колонки.Найти("Коэффициент") = Неопределено Тогда
			НоваяСтрока.Коэффициент = 1;
		КонецЕсли;
		Если ТаблицаКЗагрузке.Колонки.Найти("Единица") = Неопределено Тогда
			НоваяСтрока.Единица = НоваяСтрока.Номенклатура.ОсновнаяЕдиница;
		КонецЕсли;
		
		ПриИзмененииНоменклатурыТабЧасти(НоваяСтрока, Перемещение);
		РассчитатьСуммуТабЧасти(НоваяСтрока, Перемещение);	
		
	КонецЦикла;
    //++Данилова Е.В. 17.10.2025  HELP-5978
	Если ТипЗНЧ(ДополнительныеРеквизиты) = Тип("Структура") 
		И ДополнительныеРеквизиты.Свойство("НеЗаписыватьДокумент") Тогда
	
		Возврат Перемещение; 	
	
	КонецЕсли;
	//--Данилова Е.В. 17.10.2025
	Попытка 
		//++Данилова Е.В. 09.10.2025 HELP-5978
		Если ЗаписыватьБезПроверкиФизСкладов Тогда
			
			Перемещение.ДополнительныеСвойства.Вставить("ЗаписыватьБезПроверкиФизСкладов",истина); 	
			
		КонецЕсли;
		//--Данилова Е.В. 09.10.2025 
		Перемещение.Записать(?(Проводить, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		СообщитьИзМодуля(""+Перемещение); 
		Возврат Перемещение.Ссылка;
	Исключение
		Перемещение.Записать();
		СообщитьИзМодуля(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция СоздатьКомплектацию(ДокСсылка, ТаблицаТоваров = Неопределено, ТаблицаКомплектующих = Неопределено, ДополнительныеРеквизиты = Неопределено) Экспорт
	
	Если ТаблицаТоваров.Количество() = 0 Тогда Возврат Неопределено; КонецЕсли;
	
	ДокКомпл = СоздатьИзменитьДокумент(ДокСсылка, "Комплектация");
	
	ЗаполнитьШапкуДокумента(ДокКомпл, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Покупка");
	
	УстановитьНезаполненныйРеквизитШапки(ДокКомпл,"КодОперации", Перечисления.КодыОперацийОстатки.ЗакупкаР);
	УстановитьНезаполненныйРеквизитШапки(ДокКомпл,"ВидОплаты",ПолучитьЗначениеПоУмолчанию("ОсновнойВидОплаты"));
	
	ДокКомпл.ДокОснование = ДокСсылка;
	ДокКомпл.Склад = ДокСсылка.Склад;
	Если ЗначениеЗаполнено(ДокСсылка.ВходящееПРМТовар) Тогда
		ДокКомпл.СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена;
	Иначе
		ДокКомпл.СостояниеНакладной = Перечисления.СостоянияНакладной.ПолученоСкладом;
	КонецЕсли;
	
	УстановитьНомерДокументаКлиентСервер(ДокКомпл);
	ДокКомпл.Комментарий = "Создано документом " + Строка(ДокСсылка);
	
	Если ТипЗнч(ДополнительныеРеквизиты) = Тип("Структура") Тогда
		Для Каждого Элемент из ДополнительныеРеквизиты Цикл
			ДокКомпл[Элемент.Ключ]=Элемент.Значение;
			//УстановитьНезаполненныйРеквизитШапки(ДокКомпл, Элемент.Ключ, Элемент.Значение);
		КонецЦикла;
	КонецЕсли;
	
	////////////////// ТОВАРЫ ///////////////////////////////////////////////////////////////////////////////
	
	ДокКомпл.Товары.Очистить();
	
	Для Каждого СтрокаТоваров ИЗ ТаблицаТоваров Цикл
		НоваяСтрока = ДокКомпл.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
		НоваяСтрока.СтавкаНДС = ПолучитьРеквизитРодителя(НоваяСтрока.Номенклатура,"СтавкаНДС");
		НоваяСтрока.Коэффициент = 1;
		НоваяСтрока.Единица = НоваяСтрока.Номенклатура.ОсновнаяЕдиница;
		НоваяСтрока.Всего = НоваяСтрока.Количество;
		ЗаполнитьКоличествоКомплектующихПоСтроке(НоваяСтрока);
		ПриИзмененииНоменклатурыТабЧасти(НоваяСтрока, ДокКомпл);
		РассчитатьСуммуТабЧасти(НоваяСтрока, ДокКомпл, "ОтВсего");
	КонецЦикла;
	
	////////////////// КОМПЛЕКТУЮЩИЕ /////////////////////////////////////////////////////////////////////////
	
	Если ТаблицаКомплектующих = Неопределено Тогда
		Для Каждого СтрокаТоваров ИЗ ТаблицаТоваров Цикл
			//++Данилова Е.В. 27.01.2025
			//Если СтрокаТоваров.Номенклатура.Коплектующие.Количество() > 0
			Если СтрокаТоваров.Номенклатура.Коплектующие.Количество() > 0
				И ЗначениеРеквизитаОбъекта(СтрокаТоваров.Номенклатура,"ВидКомплекта") <> Перечисления.ВидыКомплектов.ГотовыйКомплект Тогда
			//--Данилова Е.В. 27.01.2025
				// комплект
				Для Каждого СтрокаКомплекта Из СтрокаТоваров.Номенклатура.Коплектующие Цикл
					
					Если СтрокаКомплекта.Количество = 0 Тогда 
						Продолжить; 
					КонецЕсли; 
					
					НоваяСтрока = ДокКомпл.Комплектующие.Добавить();
					НоваяСтрока.Номенклатура = СтрокаКомплекта.Номенклатура;
					НоваяСтрока.Количество	 = СтрокаКомплекта.Количество * СтрокаТоваров.Количество;
					НоваяСтрока.Продукция = СтрокаТоваров.Номенклатура;
					НоваяСтрока.Всего = НоваяСтрока.Количество;
					
				КонецЦикла; 
			Иначе			
				// обычный товар
				НоваяСтрока = ДокКомпл.Комплектующие.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
				НоваяСтрока.Продукция = СтрокаТоваров.Номенклатура;
				НоваяСтрока.Всего = НоваяСтрока.Количество;
			КонецЕсли;
			
			НоваяСтрока.СтавкаНДС = ПолучитьРеквизитРодителя(НоваяСтрока.Номенклатура,"СтавкаНДС");
			НоваяСтрока.Коэффициент = 1;
			НоваяСтрока.Единица = НоваяСтрока.Номенклатура.ОсновнаяЕдиница;
			
		КонецЦикла;
	Иначе
		Для Каждого СтрокаТоваров ИЗ ТаблицаКомплектующих Цикл
			НоваяСтрока = ДокКомпл.Комплектующие.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
			НоваяСтрока.Всего = НоваяСтрока.Количество;
			НоваяСтрока.СтавкаНДС = ПолучитьРеквизитРодителя(НоваяСтрока.Номенклатура,"СтавкаНДС");
			НоваяСтрока.Коэффициент = 1;
			НоваяСтрока.Единица = НоваяСтрока.Номенклатура.ОсновнаяЕдиница;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого Стр ИЗ ДокКомпл.Комплектующие Цикл
		ЗаполнитьКоличествоКомплектующихПоСтроке(Стр);
		ПриИзмененииНоменклатурыТабЧасти(Стр, ДокКомпл);
		РассчитатьСуммуТабЧасти(Стр, ДокКомпл, "ОтВсего");
	КонецЦикла;
	
	Попытка
		ДокКомпл.Записать(РежимЗаписиДокумента.Проведение);
		СообщитьИзМодуля(""+ДокКомпл); 
		Возврат ДокКомпл.Ссылка;
	Исключение
		ДокКомпл.Записать();
		СообщитьИзМодуля(""+ДокКомпл); 
		Возврат ДокКомпл.Ссылка;
		//СообщитьИзМодуля(ОписаниеОшибки());
		//Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция СоздатьСписаниеТМЦ(ДокСсылка, ТаблицаТоваров = Неопределено, Комментарий = "", ДополнительныеРеквизиты = Неопределено, Проводить = Ложь) Экспорт
	
	ДокСписание = СоздатьИзменитьДокумент(ДокСсылка, "СписаниеТМЦ");
	
	ЗаполнитьЗначенияСвойств(ДокСписание, ДокСсылка);
	
	ЗаполнитьШапкуДокумента(ДокСписание, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Покупка");
	
	УстановитьНезаполненныйРеквизитШапки(ДокСписание,"ВидОплаты",	ПолучитьЗначениеПоУмолчанию("ОсновнойВидОплаты"));		
	
	ДокСписание.КодОперации = Перечисления.КодыОперацийОстатки.Списание;	
	ДокСписание.ДокОснование = ДокСсылка;
	
	УстановитьНомерДокументаКлиентСервер(ДокСписание);
	
	Если СокрЛП(Комментарий) <> "" Тогда
		ДокСписание.Комментарий = СокрЛП(Комментарий);
	Иначе
		ДокСписание.Комментарий = "Создано документом " + Строка(ДокСсылка);
	КонецЕсли;
	
	// Шворобей ВЮ 16.01.2023 ++
	Если ЗначениеЗаполнено(ДокСсылка.ДокОснование) Тогда
		Если ЕстьРеквизитДокумента("Подразделение", ДокСсылка.ДокОснование.Метаданные()) Тогда
			ДокСписание.Подразделение = ЗначениеРеквизитаОбъекта(ДокСсылка.ДокОснование, "Подразделение");		
		КонецЕсли;
	КонецЕсли;
	// Шворобей ВЮ 16.01.2023 ++
	
	Если ТипЗнч(ДополнительныеРеквизиты) = Тип("Структура") Тогда
		Для Каждого Элемент из ДополнительныеРеквизиты Цикл
			ДокСписание[Элемент.Ключ]=Элемент.Значение;
		КонецЦикла;
	КонецЕсли;
	
	////////////////// ТОВАРЫ ///////////////////////////////////////////////////////////////////////////////
	
	Если ТаблицаТоваров <> Неопределено Тогда
		
		ДокСписание.Товары.Очистить();
		
		Для Каждого СтрокаТоваров ИЗ ТаблицаТоваров Цикл
			
			НоваяСтрока = ДокСписание.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
			
			НоваяСтрока.СтавкаНДС = ПолучитьРеквизитРодителя(НоваяСтрока.Номенклатура,"СтавкаНДС");
			НоваяСтрока.Коэффициент = 1;
			НоваяСтрока.Единица = НоваяСтрока.Номенклатура.ОсновнаяЕдиница;
			НоваяСтрока.Всего = НоваяСтрока.Количество;
			
			/////////////////////////////////////////////////////////////////////////////////////////////////////
			//    НУЖНО БУДЕТ УСТАНОВИТЬ ЦЕНУ
			/////////////////////////////////////////////////////////////////////////////////////////////////////
			
			НоваяСтрока.Цена = ПолучитьЦенуИзДокументаОснования(НоваяСтрока.Номенклатура, ДокСсылка);
			
			ПриИзмененииНоменклатурыТабЧасти(НоваяСтрока, ДокСписание);
			РассчитатьСуммуТабЧасти(НоваяСтрока, ДокСписание);
		КонецЦикла;
		
	КонецЕсли;
	
	// Шворобей ВЮ 08.02.2023 ++
	Если Проводить Тогда
		Попытка
			ДокСписание.Записать(РежимЗаписиДокумента.Проведение);
			СообщитьИзМодуля("" + ДокСписание);
			Возврат ДокСписание.Ссылка;
		Исключение
			ДокСписание.Записать();
			СообщитьИзМодуля("" + ДокСписание);
			Возврат ДокСписание.Ссылка;
		КонецПопытки;
	Иначе
		Попытка
			ДокСписание.Записать();
			СообщитьИзМодуля("" + ДокСписание);
			Возврат ДокСписание.Ссылка;
		Исключение
			СообщитьИзМодуля("" + ОписаниеОшибки());
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;
	// Шворобей ВЮ 08.02.2023 ++
	
КонецФункции

Функция СоздатьРасходнуюНакладную(ДокСсылка = Неопределено, ТаблицаТоваров, ДополнительныеРеквизиты = Неопределено,
	//Добавился входящий параметр ИспользоватьДокОснование
	Проводить = Ложь, Комментарий = "", ОтгрузкаКомплектов = Ложь, СоздаватьНовый = Ложь, ЗаполнитьДопОбработки = Ложь,
	ИспользоватьДокОснование = Истина) Экспорт
	
	Если ТаблицаТоваров.Количество() = 0 Тогда Возврат Неопределено; КонецЕсли;
	
	ДокРасходнаяНакладная = СоздатьИзменитьДокумент(ДокСсылка, "РасходнаяНакладная", , , СоздаватьНовый);
	
	/////////////////////////////////////////////////////////////////////////////////////////////
	
	МетаданныеДокСсылка = Неопределено;
	МетаданныеДокСсылка = ?(ДокСсылка <> Неопределено, ДокСсылка.Метаданные(), Неопределено);
	
	ЕстьРеквизитОснование = Ложь; ЕстьРеквизитПунктДоставки = Ложь;
	Если МетаданныеДокСсылка <> Неопределено Тогда
		ЕстьРеквизитОснование = ЕстьРеквизитДокумента("ДокОснование", МетаданныеДокСсылка);
		ЕстьРеквизитПунктДоставки = ЕстьРеквизитДокумента("ПунктДоставки", МетаданныеДокСсылка);
	КонецЕсли;
	
	/////////////////////////////////////////////////////////////////////////////////////////////
	
	// Кухарь А.Ю.  04.09.2024 начало
	// 	Если ДокСсылка <> Неопределено И ЕстьРеквизитОснование И ЗначениеЗаполнено(ДокСсылка.ДокОснование) Тогда
	Если ДокСсылка <> Неопределено И ЕстьРеквизитОснование И ЗначениеЗаполнено(ДокСсылка.ДокОснование) и ИспользоватьДокОснование Тогда
		// Кухарь А.Ю.  04.09.2024 конец	
		ЗаполнитьЗначенияСвойств(ДокРасходнаяНакладная, ДокСсылка.ДокОснование);
	ИначеЕсли ДокСсылка <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ДокРасходнаяНакладная, ДокСсылка);
	КонецЕсли;
	
	/////////////////////////////////////////////////////////////////////////////////////////////
	
	ЗаполнитьШапкуДокумента(ДокРасходнаяНакладная, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
	
	ДокРасходнаяНакладная.ДокОснование =  ?(ДокСсылка = Неопределено, Неопределено, ДокСсылка);
	ДокРасходнаяНакладная.Комментарий = ?(СокрЛП(Комментарий) <> "", Комментарий, "Создано документом " + Строка(ДокСсылка));
	
	УстановитьНомерДокументаКлиентСервер(ДокРасходнаяНакладная);
	
	Если ТипЗнч(ДополнительныеРеквизиты) = Тип("Структура") Тогда
		Для Каждого Элемент из ДополнительныеРеквизиты Цикл
			УстановитьРеквизитШапки(ДокРасходнаяНакладная, Элемент.Ключ, Элемент.Значение);
		КонецЦикла;
	КонецЕсли;
	
	///////////// ОБЯЗАТЕЛЬНОЕ ЗАПОЛНЕНИЕ РЕКВИЗИТОВ ////////////////////////////////////////////////////////
	
	Если НЕ ЗначениеЗаполнено(ДокРасходнаяНакладная.СостояниеНакладной) Тогда
		ДокРасходнаяНакладная.СостояниеНакладной = Перечисления.СостоянияНакладной.ВРаботе;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокРасходнаяНакладная.ТипЦен) Тогда
		ДокРасходнаяНакладная.ТипЦен = ДокРасходнаяНакладная.Контрагент.ТипЦен;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДокРасходнаяНакладная.ТипЦенРаспродажа) Тогда
		ДокРасходнаяНакладная.ТипЦенРаспродажа = ДокРасходнаяНакладная.Контрагент.ТипЦенРаспродажа;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокРасходнаяНакладная.ПунктДоставки) Тогда
		Если ЕстьРеквизитПунктДоставки И ЗначениеЗаполнено(ДокСсылка.ПунктДоставки) Тогда
			ДокРасходнаяНакладная.ПунктДоставки = ДокСсылка.ПунктДоставки;
		Иначе
		     ДокРасходнаяНакладная.ПунктДоставки = УстановитьПунктДоставкиСервер(ДокРасходнаяНакладная);
			Если ДокРасходнаяНакладная.ПунктДоставки = Неопределено ИЛИ
				ДокРасходнаяНакладная.ПунктДоставки = Справочники.ПунктыДоставки.ПустаяСсылка() Тогда
				СообщитьИзМодуля("Не удалось заполнить Пункт Доставки");
				Возврат Неопределено;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокРасходнаяНакладная.ПунктДоставки) И ЗначениеЗаполнено(ДокРасходнаяНакладная.ПунктДоставки.ОтсрочкаПлатежа) Тогда
		ДокРасходнаяНакладная.ОтсрочкаПлатежа = ДокРасходнаяНакладная.ПунктДоставки.ОтсрочкаПлатежа;
	Иначе
		ДокРасходнаяНакладная.ОтсрочкаПлатежа = ДокРасходнаяНакладная.Договор.ОтсрочкаПлатежа;
	КонецЕсли;
	
	// Шворобей ВЮ 11.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5396
	// Передадим через ДополнительныеРеквизиты
	Если НЕ ЗначениеЗаполнено(ДокРасходнаяНакладная.ДатаОтгрузки) Тогда
		ДокРасходнаяНакладная.ДатаОтгрузки = ?(ТипЗнч(ДополнительныеРеквизиты) = Тип("Структура") И ДополнительныеРеквизиты.Свойство("ДатаОтгрузки"),
			ДополнительныеРеквизиты.ДатаОтгрузки,
			ДокРасходнаяНакладная.Дата);
	КонецЕсли;
	// Шворобей ВЮ 11.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5396
	
	Если НЕ ЗначениеЗаполнено(ДокРасходнаяНакладная.ДатаОплаты) Тогда
		Если ЗначениеЗаполнено(ДокРасходнаяНакладная.ДатаОтгрузки) И ЗначениеЗаполнено(ДокРасходнаяНакладная.ОтсрочкаПлатежа) Тогда
			//Валетов + 30.06.2026 Изменение 0000000060
				//ДокРасходнаяНакладная.ДатаОплаты = ПолучитьДатуОплатыСервер(ДокРасходнаяНакладная.ДатаОтгрузки, ДокРасходнаяНакладная.ОтсрочкаПлатежа);
				ПараметрыРасчетаДатыОплаты 			= ОбщегоНазначенияКС.ПолучитьЗаполнитьПараметрыРасчетаДатыОплатыПоДокументу(ДокРасходнаяНакладная);
				ДокРасходнаяНакладная.ДатаОплаты 	= ОбщегоНазначенияКС.ПолучитьДатуОплатыПоДокументуКлиентСервер(ПараметрыРасчетаДатыОплаты); 
			//Валетов-
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокРасходнаяНакладная.ПунктДоставки) Тогда
	
		Если ЗначениеЗаполнено(ДокРасходнаяНакладная.ПунктДоставки.РайонДоставки) Тогда
			ДокРасходнаяНакладная.РайонДоставки = ДокРасходнаяНакладная.ПунктДоставки.РайонДоставки;			
		КонецЕсли;	
		Если ЗначениеЗаполнено(ДокРасходнаяНакладная.ПунктДоставки.Регион) Тогда
			ДокРасходнаяНакладная.Регион = ДокРасходнаяНакладная.ПунктДоставки.Регион;			
		КонецЕсли;
		
		Если ДокРасходнаяНакладная.ПунктДоставки.ТипДоставки = Перечисления.ТипыДоставки.ТранспортнаяКомпания Тогда
			ДокРасходнаяНакладная.ТранспортнаяКомпания = ?(ЗначениеЗаполнено(ДокРасходнаяНакладная.ПунктДоставки.ТраспортнаяКомпания), ДокРасходнаяНакладная.ПунктДоставки.ТраспортнаяКомпания, Неопределено);
			ДокРасходнаяНакладная.ПунктПерегруза = ?(ЗначениеЗаполнено(ДокРасходнаяНакладная.ПунктДоставки.ПунктПерегруза), ДокРасходнаяНакладная.ПунктДоставки.ПунктПерегруза, Неопределено);
		Иначе
			ДокРасходнаяНакладная.ТранспортнаяКомпания = Неопределено;	
			ДокРасходнаяНакладная.ПунктПерегруза = Неопределено;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДокРасходнаяНакладная.ПунктДоставки.Грузополучатель) Тогда
			ДокРасходнаяНакладная.Грузополучатель = ДокРасходнаяНакладная.ПунктДоставки.Грузополучатель;		
		КонецЕсли;
		Если ЗначениеЗаполнено(ДокРасходнаяНакладная.ПунктДоставки.Получатель) Тогда
			ДокРасходнаяНакладная.Получатель = ДокРасходнаяНакладная.ПунктДоставки.Получатель;		
		КонецЕсли;
		
	КонецЕсли;
	
	///////////// ОБЯЗАТЕЛЬНОЕ ЗАПОЛНЕНИЕ РЕКВИЗИТОВ ////////////////////////////////////////////////////////
	
	////////////////// ТОВАРЫ ///////////////////////////////////////////////////////////////////////////////
	
	ДокРасходнаяНакладная.Товары.Очистить();
	
	Для Каждого СтрокаТоваров ИЗ ТаблицаТоваров Цикл
		
		НоваяСтрока = ДокРасходнаяНакладная.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
		
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.СтавкаНДС) Тогда
			НоваяСтрока.СтавкаНДС = ПолучитьРеквизитРодителя(НоваяСтрока.Номенклатура,"СтавкаНДС");
		КонецЕсли;
		
		Если ТаблицаТоваров.Колонки.Найти("Коэффициент") = Неопределено Тогда
			НоваяСтрока.Коэффициент = 1;
		КонецЕсли;
		Если ТаблицаТоваров.Колонки.Найти("Единица") = Неопределено Тогда
			НоваяСтрока.Единица = НоваяСтрока.Номенклатура.ОсновнаяЕдиница;
		КонецЕсли;
		Если ТаблицаТоваров.Колонки.Найти("Заявка") = Неопределено Тогда
			НоваяСтрока.Заявка = НоваяСтрока.Количество;
		КонецЕсли;
		Если ТаблицаТоваров.Колонки.Найти("ПодтвержденнаяЗаявка") = Неопределено Тогда
			НоваяСтрока.ПодтвержденнаяЗаявка = НоваяСтрока.Количество;
		КонецЕсли;
		
		/////////////////////////////////////////////////////////////////////////////////////////////////////
		//    НУЖНО БУДЕТ УСТАНОВИТЬ ЦЕНУ
		/////////////////////////////////////////////////////////////////////////////////////////////////////
		
		Если ДокСсылка <> Неопределено И ЕстьРеквизитОснование И ЗначениеЗаполнено(ДокСсылка.ДокОснование) Тогда
			НоваяСтрока.Цена = ПолучитьЦенуИзДокументаОснования(НоваяСтрока.Номенклатура, ДокСсылка);
		ИначеЕсли ДокСсылка <> Неопределено И НЕ ИспользоватьДокОснование Тогда
			НоваяСтрока.Цена = ПолучитьЦенуИзВходящегоДокумента(НоваяСтрока.Номенклатура, ДокСсылка);
		КонецЕсли;
		
		НоваяСтрока.Всего = НоваяСтрока.Количество * НоваяСтрока.Цена;
		
		ПриИзмененииНоменклатурыТабЧасти(НоваяСтрока, ДокРасходнаяНакладная);
		РассчитатьСуммуТабЧасти(НоваяСтрока, ДокРасходнаяНакладная);
		
	КонецЦикла;
	
	ДокРасходнаяНакладная.ОтгрузкаКомплектов = ОтгрузкаКомплектов;
	ДокРасходнаяНакладная.Комплектующие.Очистить();
	
	Если ОтгрузкаКомплектов Тогда
		ЗаполнениеДокументов.ЗаполнитьТЧКомплектующие(ДокРасходнаяНакладная);	
	КонецЕсли;
	
	ДокРасходнаяНакладная.ДопОбработки.Очистить();
	
	ЗаполнитьУпаковку = Ложь;
	
	Если ЗаполнитьДопОбработки Тогда
		Если ДокРасходнаяНакладная.ПунктДоставки.ВидыДопОбработок.Количество() = 0 Тогда
			Для Каждого СтрокаТЧ Из ДокРасходнаяНакладная.Контрагент.ВидыДопОбработок Цикл
				СтрокаДО = ДокРасходнаяНакладная.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки = СтрокаТЧ.ДопОбработка;
				//++Данилова Е.В. 15.01.2025
				//Если СтрокаДО.ВидДопОбработки.РассчитыватьУпаковку Тогда
				Если ТребуетсяУпаковкаПоДопОбработке(СтрокаТЧ.ДопОбработка) Тогда
					//--Данилова Е.В. 15.01.2025
					ЗаполнитьУпаковку = Истина;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для Каждого СтрокаТЧ Из ДокРасходнаяНакладная.ПунктДоставки.ВидыДопОбработок Цикл
				СтрокаДО = ДокРасходнаяНакладная.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки = СтрокаТЧ.ДопОбработка;
				//++Данилова Е.В. 15.01.2025
				//Если СтрокаДО.ВидДопОбработки.РассчитыватьУпаковку Тогда
				Если ТребуетсяУпаковкаПоДопОбработке(СтрокаТЧ.ДопОбработка) Тогда
				//--Данилова Е.В. 15.01.2025
					ЗаполнитьУпаковку = Истина;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	
	ДокРасходнаяНакладная.Упаковка.Очистить();
	
	Если ЗаполнитьУпаковку Тогда
		ТЗУпаковки = ПолучитьТЗУпаковки(ДокРасходнаяНакладная.Товары.Выгрузить(,"Номенклатура,Количество"), ДокРасходнаяНакладная.Контрагент);
		Для Каждого СтрокаТЗ ИЗ ТЗУпаковки Цикл
			Если СтрокаТЗ.ДопОбработка <> Справочники.ВидыДопОбработки.ПустаяСсылка() Тогда
				Если ДокРасходнаяНакладная.ДопОбработки.Найти(СтрокаТЗ.ДопОбработка)=Неопределено тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
					
			Если СтрокаТЗ.Количество = 0 Тогда Продолжить; КонецЕсли;
			
			НоваяСтрока = ДокРасходнаяНакладная.Упаковка.Добавить();
			НоваяСтрока.Номенклатура = СтрокаТЗ.Номенклатура;
			НоваяСтрока.Количество = СтрокаТЗ.Количество;
			НоваяСтрока.ПодтвержденнаяЗаявка = СтрокаТЗ.Количество;		
		КонецЦикла;
	КонецЕсли; 
	//++Данилова Е.В. 17.10.2025  HELP-5978
	Если ТипЗНЧ(ДополнительныеРеквизиты) = Тип("Структура") 
		И ДополнительныеРеквизиты.Свойство("НеЗаписыватьДокумент") Тогда
	
		Возврат ДокРасходнаяНакладная; 	
	
	КонецЕсли;
	//--Данилова Е.В. 17.10.2025
	
	Попытка
		// Шворобей ВЮ 29.11.2022 ++
		Если Проводить Тогда
			ДокРасходнаяНакладная.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ДокРасходнаяНакладная.ОбменДанными.Загрузка = Истина;
			ДокРасходнаяНакладная.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
		// Шворобей ВЮ 29.11.2022 ++
		СообщитьИзМодуля("" + ДокРасходнаяНакладная);
		Возврат ДокРасходнаяНакладная.Ссылка;
	Исключение
		СообщитьИзМодуля(ОписаниеОшибки());
		Возврат Неопределено;	
	КонецПопытки;
	
КонецФункции
//++Данилова Е.В. 15.01.2025
Функция ТребуетсяУпаковкаПоДопОбработке(ДопОбработка)  Экспорт
	
	Если ДопОбработка.Код = "OD7-00103" 
		ИЛИ  ДопОбработка.Код = "OD7-00126"
		ИЛИ ДопОбработка.Код = "OD7-00128"
		ИЛИ ДопОбработка.Код = "OD7-00127"
		ИЛИ ДопОбработка.Код = "OD7-00104"
		ИЛИ ДопОбработка.Код = "OD7-00113"
		ИЛИ ДопОбработка = Справочники.ВидыДопОбработки.ОтгрузкаУпаковкиОтдельно 
		ИЛИ ДопОбработка.РассчитыватьУпаковку  Тогда
		
		Возврат Истина;	 
		
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции
//--Данилова Е.В. 15.01.2025

Функция СоздатьДокументРекламационнаяНакладная(ДокСсылка, ДополнительныеРеквизиты = Неопределено, Проводить = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДокСсылка) Тогда Возврат Неопределено; КонецЕсли;
	
	ДокРекламация = СоздатьИзменитьДокумент(ДокСсылка, "РекламационнаяНакладная");
	Если ДокРекламация <> Неопределено Тогда
		
		ЗаполнитьШапкуДокумента(ДокРекламация, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Покупка");
		
		ДокРекламация.Заполнить(ДокСсылка);
		
		Если ТипЗнч(ДополнительныеРеквизиты) = Тип("Структура") Тогда
			Для Каждого Элемент из ДополнительныеРеквизиты Цикл
				//УстановитьНезаполненныйРеквизитШапки(ДокРекламация, Элемент.Ключ, Элемент.Значение);
				Если ЕстьРеквизитДокумента(Элемент.Ключ, ДокРекламация.Метаданные()) Тогда
					ДокРекламация[Элемент.Ключ] = Элемент.Значение;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Попытка
			Если Проводить Тогда
				ДокРекламация.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				ДокРекламация.ОбменДанными.Загрузка = Истина;
				ДокРекламация.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			СообщитьИзМодуля("" + Строка(ДокРекламация));
			Возврат ДокРекламация.Ссылка;		
		Исключение
			ДокРекламация.ОбменДанными.Загрузка = Истина;
			ДокРекламация.Записать(РежимЗаписиДокумента.Запись);
			СообщитьИзМодуля(ОписаниеОшибки());
			Возврат ДокРекламация.Ссылка;
		КонецПопытки;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция СоздатьИзменитьДокумент(ДокСсылка = Неопределено, ВидДокумента = "РекламационнаяНакладная", ФлагТолькоПроведенные = Ложь, ФлагБезПомеченныхНаУдаление = Истина, СоздаватьНовый = Ложь) Экспорт
	
	Если ДокСсылка = Неопределено ИЛИ СоздаватьНовый Тогда
		НовыйДок = Неопределено;
	Иначе
		НовыйДок = ЗаполнениеДокументов.НайтиПодчиненныйДокумент(ДокСсылка, ВидДокумента, ФлагТолькоПроведенные, ФлагБезПомеченныхНаУдаление);
	КонецЕсли;
	
	Если НовыйДок = Неопределено Тогда
		НовыйДокОбъект = Документы[ВидДокумента].СоздатьДокумент();
		НовыйДокОбъект.Дата = ТекущаяДатаСеанса();
		КодИБ = ПараметрыСеанса.ЭтотУзел.Код;
		НовыйДокОбъект.УстановитьНовыйНомер(КодИБ + "-");		
	Иначе
		НовыйДокОбъект = НовыйДок.ПолучитьОбъект();
	КонецЕсли;
	
	Возврат НовыйДокОбъект;
	
КонецФункции

Функция ПолучитьЦенуИзДокументаОснования(Номенклатура, ДокСсылка, ИмяТабличнойЧастиДокументаСсылка = "Товары", ИмяТабличнойЧастиДокументаОснования = "Товары") Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДокСсылка.ДокОснование) Тогда
		Возврат 0;
	КонецЕсли;
	
	ИмяДокументаСсылка = ДокСсылка.Метаданные().Имя;
	ИмяДокументаОснования = ДокСсылка.ДокОснование.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ЕСТЬNULL(ТЧ_Основание.Цена, 0)) КАК Цена
	|ИЗ
	|	Документ." + ИмяДокументаСсылка + "." + ИмяТабличнойЧастиДокументаСсылка + " КАК ТЧ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ." + ИмяДокументаОснования + "." + ИмяТабличнойЧастиДокументаОснования + " КАК ТЧ_Основание
	|		ПО ТЧ.Номенклатура = ТЧ_Основание.Номенклатура
	|ГДЕ
	|	ТЧ.Ссылка = &ДокСсылка
	|	И ТЧ.Номенклатура = &Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧ.Номенклатура";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Цена;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЦенуИзВходящегоДокумента(Номенклатура, ДокСсылка, ИмяТабличнойЧастиДокументаСсылка = "Товары") Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДокСсылка) Тогда
		Возврат 0;
	КонецЕсли;
	
	Если НЕ ЕстьРеквизитТабЧастиДокумента("Цена", ДокСсылка.Метаданные(), "Товары") Тогда
		Возврат 0;
	КонецЕсли;
	
	ИмяДокументаСсылка = ДокСсылка.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ЕСТЬNULL(ТЧ.Цена, 0)) КАК Цена
	|ИЗ
	|	Документ." + ИмяДокументаСсылка + "." + ИмяТабличнойЧастиДокументаСсылка + " КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &ДокСсылка
	|	И ТЧ.Номенклатура = &Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧ.Номенклатура";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Цена;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
//////////////////////////////////////////////////////////////////////////////////////////////////////

Функция УстановитьПунктДоставкиСервер(ДокументОбъект, ИмяРеквизитаКонтрагент = "Контрагент", ИмяРеквизитаПД = "ПунктДоставки") Экспорт
	
	Контрагент = ДокументОбъект[ИмяРеквизитаКонтрагент];
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Если ЕстьРеквизитДокумента("ОсновнойПунктДоставки",Контрагент.Метаданные()) И ЗначениеЗаполнено(Контрагент.ОсновнойПунктДоставки) Тогда
			ДокументОбъект[ИмяРеквизитаПД] = Контрагент.ОсновнойПунктДоставки;	
		ИначеЕсли КоличествоПДСервер(Контрагент) = 1 Тогда		
			Выборка = Справочники.ПунктыДоставки.Выбрать(,Контрагент);
			Пока Выборка.Следующий() Цикл
				ДокументОбъект[ИмяРеквизитаПД] = Выборка.Ссылка;			
			КонецЦикла;
		ИначеЕсли ИмяРеквизитаКонтрагент = "СкладПолучатель" Тогда
			Выборка = Справочники.ПунктыДоставки.Выбрать(,Контрагент,,"Наименование Убыв");
			Пока Выборка.Следующий() Цикл
				ДокументОбъект[ИмяРеквизитаПД] = Выборка.Ссылка;			
			КонецЦикла;
		Иначе
			ДокументОбъект[ИмяРеквизитаПД] = Неопределено;		
		КонецЕсли;		
	Иначе
		ДокументОбъект[ИмяРеквизитаПД] = Неопределено;		
	КонецЕсли;
	
	Возврат ДокументОбъект[ИмяРеквизитаПД];
	
КонецФункции//УстановитьПунктДоставкиСервер(ДокументОбъект,ИмяРеквизитаКонтрагент="Контрагент")

Функция КоличествоПДСервер(Контрагент) Экспорт
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Владелец",Контрагент);
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ссылка) КАК Количество
		|ИЗ
		|	Справочник.ПунктыДоставки КАК ПунктыДоставки
		|ГДЕ
		|	Владелец = &Владелец";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Количество;			
		КонецЕсли;		
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции // КоличествоПДСервер(Контрагент)

Функция ПолучитьДатуОплатыСервер(ДатаОтгрузки, ОтсрочкаПлатежа)  Экспорт
	
	Если   ДатаОтгрузки = '00010101000000' Тогда
		Возврат  '00010101000000'
	Иначе
		Если  ОтсрочкаПлатежа.ВидОтсрочки = Перечисления.ВидыОтсрочки.БанковскиеДни Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ДатаОтгрузки",ДатаОтгрузки);
			Запрос.Текст = "ВЫБРАТЬ
			|	КалендарьДни.Дата КАК Дата
			|ИЗ
			|	Справочник.Календарь.Дни КАК КалендарьДни
			|ГДЕ
			|	КалендарьДни.Дата >= &ДатаОтгрузки
			|	И КалендарьДни.Часы <> 0
			|	И (НЕ КалендарьДни.Ссылка.ПометкаУдаления)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата
			|АВТОУПОРЯДОЧИВАНИЕ";
			
			
			Выборка = Запрос.Выполнить().Выбрать();
			НПП = 0;
			Пока Выборка.Следующий() Цикл
				Если НПП = ОтсрочкаПлатежа.Отсрочка Тогда
					Возврат Выборка.Дата;	
				Конецесли;
				НПП = НПП + 1;
			КонецЦикла;
			
			Возврат ДатаОтгрузки + ОтсрочкаПлатежа.Отсрочка*24*60*60;		
		Иначе		
			Возврат ДатаОтгрузки + ОтсрочкаПлатежа.Отсрочка*24*60*60;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

#Область ДополнительныйФункционал

// Изменить раскладку текста EN в RU.
// 
// Параметры:
//  ИсходныйТекст - Строка - Исходная строка в латинской раскладке
// 
// Возвращаемое значение:
//  Строка - Измененная раскладка текста в русской раскладке
Функция ИзменитьРаскладкуТекстаEN_RU(Знач ИсходныйТекст, ИзENвRU = Истина) Экспорт
	
	СоответствиеEN_RU = Новый Соответствие;
	СоответствиеEN_RU.Вставить("f", "а");
	СоответствиеEN_RU.Вставить(",", "б");
	СоответствиеEN_RU.Вставить("d", "в");
	СоответствиеEN_RU.Вставить("u", "г");
	СоответствиеEN_RU.Вставить("l", "д");
	СоответствиеEN_RU.Вставить("t", "е");
	СоответствиеEN_RU.Вставить("`", "ё");
	СоответствиеEN_RU.Вставить(";", "ж");
	СоответствиеEN_RU.Вставить("p", "з");
	СоответствиеEN_RU.Вставить("b", "и");
	СоответствиеEN_RU.Вставить("q", "й");
	СоответствиеEN_RU.Вставить("r", "к");
	СоответствиеEN_RU.Вставить("k", "л");
	СоответствиеEN_RU.Вставить("v", "м");
	СоответствиеEN_RU.Вставить("y", "н");
	СоответствиеEN_RU.Вставить("j", "о");
	СоответствиеEN_RU.Вставить("g", "п");
	СоответствиеEN_RU.Вставить("h", "р");
	СоответствиеEN_RU.Вставить("c", "с");
	СоответствиеEN_RU.Вставить("n", "т");
	СоответствиеEN_RU.Вставить("e", "у");
	СоответствиеEN_RU.Вставить("a", "ф");
	СоответствиеEN_RU.Вставить("[", "х");
	СоответствиеEN_RU.Вставить("w", "ц");
	СоответствиеEN_RU.Вставить("x", "ч");
	СоответствиеEN_RU.Вставить("i", "ш");
	СоответствиеEN_RU.Вставить("o", "щ");
	СоответствиеEN_RU.Вставить("m", "ь");
	СоответствиеEN_RU.Вставить("s", "ы");
	СоответствиеEN_RU.Вставить("]", "ъ");
	СоответствиеEN_RU.Вставить("'", "э");
	СоответствиеEN_RU.Вставить(".", "ю");
	СоответствиеEN_RU.Вставить("z", "я");
	СоответствиеEN_RU.Вставить("F", "А");
	СоответствиеEN_RU.Вставить("<", "Б");
	СоответствиеEN_RU.Вставить("D", "В");
	СоответствиеEN_RU.Вставить("U", "Г");
	СоответствиеEN_RU.Вставить("L", "Д");
	СоответствиеEN_RU.Вставить("T", "Е");
	СоответствиеEN_RU.Вставить("~", "Ё");
	СоответствиеEN_RU.Вставить(":", "Ж");
	СоответствиеEN_RU.Вставить("P", "З");
	СоответствиеEN_RU.Вставить("B", "И");
	СоответствиеEN_RU.Вставить("Q", "Й");
	СоответствиеEN_RU.Вставить("R", "К");
	СоответствиеEN_RU.Вставить("K", "Л");
	СоответствиеEN_RU.Вставить("V", "М");
	СоответствиеEN_RU.Вставить("Y", "Н");
	СоответствиеEN_RU.Вставить("J", "О");
	СоответствиеEN_RU.Вставить("G", "П");
	СоответствиеEN_RU.Вставить("H", "Р");
	СоответствиеEN_RU.Вставить("C", "С");
	СоответствиеEN_RU.Вставить("N", "Т");
	СоответствиеEN_RU.Вставить("E", "У");
	СоответствиеEN_RU.Вставить("A", "Ф");
	СоответствиеEN_RU.Вставить("{", "Х");
	СоответствиеEN_RU.Вставить("W", "Ц");
	СоответствиеEN_RU.Вставить("X", "Ч");
	СоответствиеEN_RU.Вставить("I", "Ш");
	СоответствиеEN_RU.Вставить("O", "Щ");
	СоответствиеEN_RU.Вставить("M", "Ь");
	СоответствиеEN_RU.Вставить("S", "Ы");
	СоответствиеEN_RU.Вставить("}", "Ъ");
	СоответствиеEN_RU.Вставить("""", "Э");
	СоответствиеEN_RU.Вставить(">", "Ю");
	СоответствиеEN_RU.Вставить("Z", "Я");
	СоответствиеEN_RU.Вставить("@", """");
	СоответствиеEN_RU.Вставить("#", "№");
	СоответствиеEN_RU.Вставить("$", ";");
	СоответствиеEN_RU.Вставить("^", ":");
	СоответствиеEN_RU.Вставить("&", "?");
	СоответствиеEN_RU.Вставить("/", ".");
	СоответствиеEN_RU.Вставить("?", ",");
	
	СоответствиеRU_EN = Новый Соответствие;
	СоответствиеRU_EN.Вставить("й","q");
	СоответствиеRU_EN.Вставить("ц","w");
	СоответствиеRU_EN.Вставить("у","e");
	СоответствиеRU_EN.Вставить("к","r");
	СоответствиеRU_EN.Вставить("е","t");
	СоответствиеRU_EN.Вставить("ё","`");
	СоответствиеRU_EN.Вставить("н","y");
	СоответствиеRU_EN.Вставить("г","u");
	СоответствиеRU_EN.Вставить("ш","i");
	СоответствиеRU_EN.Вставить("щ","o");
	СоответствиеRU_EN.Вставить("з","p");
	СоответствиеRU_EN.Вставить("х","[");
	СоответствиеRU_EN.Вставить("ъ","]");
	СоответствиеRU_EN.Вставить("ф","a");
	СоответствиеRU_EN.Вставить("ы","s");
	СоответствиеRU_EN.Вставить("в","d");
	СоответствиеRU_EN.Вставить("а","f");
	СоответствиеRU_EN.Вставить("п","g");
	СоответствиеRU_EN.Вставить("р","h");
	СоответствиеRU_EN.Вставить("о","j");
	СоответствиеRU_EN.Вставить("л","k");
	СоответствиеRU_EN.Вставить("д","l");
	СоответствиеRU_EN.Вставить("ж",";");
	СоответствиеRU_EN.Вставить("э","'");
	СоответствиеRU_EN.Вставить("я","z");
	СоответствиеRU_EN.Вставить("ч","x");
	СоответствиеRU_EN.Вставить("с","c");
	СоответствиеRU_EN.Вставить("м","v");
	СоответствиеRU_EN.Вставить("и","b");
	СоответствиеRU_EN.Вставить("т","n");
	СоответствиеRU_EN.Вставить("ь","m");
	СоответствиеRU_EN.Вставить("б",",");
	СоответствиеRU_EN.Вставить("ю",".");
	
	СоответствиеRU_EN.Вставить("Й","Q");
	СоответствиеRU_EN.Вставить("Ц","W");
	СоответствиеRU_EN.Вставить("У","E");
	СоответствиеRU_EN.Вставить("К","R");
	СоответствиеRU_EN.Вставить("Е","T");
	СоответствиеRU_EN.Вставить("Ё", "~");
	СоответствиеRU_EN.Вставить("Н","Y");
	СоответствиеRU_EN.Вставить("Г","U");
	СоответствиеRU_EN.Вставить("Ш","I");
	СоответствиеRU_EN.Вставить("Щ","O");
	СоответствиеRU_EN.Вставить("З","P");
	СоответствиеRU_EN.Вставить("Х","{");
	СоответствиеRU_EN.Вставить("Ъ","}");
	СоответствиеRU_EN.Вставить("Ф","A");
	СоответствиеRU_EN.Вставить("Ы","S");
	СоответствиеRU_EN.Вставить("В","D");
	СоответствиеRU_EN.Вставить("А","F");
	СоответствиеRU_EN.Вставить("П","G");
	СоответствиеRU_EN.Вставить("Р","H");
	СоответствиеRU_EN.Вставить("О","J");
	СоответствиеRU_EN.Вставить("Л","K");
	СоответствиеRU_EN.Вставить("Д","L");
	СоответствиеRU_EN.Вставить("Ж",":");
	СоответствиеRU_EN.Вставить("Э","""");
	СоответствиеRU_EN.Вставить("Я","Z");
	СоответствиеRU_EN.Вставить("Ч","X");
	СоответствиеRU_EN.Вставить("С","C");
	СоответствиеRU_EN.Вставить("М","V");
	СоответствиеRU_EN.Вставить("И","B");
	СоответствиеRU_EN.Вставить("Т","N");
	СоответствиеRU_EN.Вставить("Ь","M");
	СоответствиеRU_EN.Вставить("Б","<");
	СоответствиеRU_EN.Вставить("Ю",">");
	
	//СоответствиеRU_EN.Вставить("""","@");
	//СоответствиеRU_EN.Вставить("№", "#");
	//СоответствиеRU_EN.Вставить(";", "$");
	//СоответствиеRU_EN.Вставить(":", "^");
	//СоответствиеRU_EN.Вставить("?", "&");
	//СоответствиеRU_EN.Вставить(".", "/");
	//СоответствиеRU_EN.Вставить(",", "?");
	
	ИсходныйТекст = СокрЛП(ИсходныйТекст);
	ГотовоеЗначение = "";
	ТекущийСимвол = "";
	ТекущийГотовыйСимвол = "";
	
	Для Индекс = 1 по СтрДлина(ИсходныйТекст) Цикл
		
		ТекущийСимвол = Сред(ИсходныйТекст, Индекс, 1);
		
		Если ИзENвRU Тогда
			ТекущийГотовыйСимвол = СоответствиеEN_RU.Получить(ТекущийСимвол);
		Иначе
			ТекущийГотовыйСимвол = СоответствиеRU_EN.Получить(ТекущийСимвол);
		КонецЕсли;
		
		Если ТекущийГотовыйСимвол = Неопределено Тогда
			ГотовоеЗначение = ГотовоеЗначение + ТекущийСимвол;
		Иначе
			ГотовоеЗначение = ГотовоеЗначение + ТекущийГотовыйСимвол;
		КонецЕсли;     
	КонецЦикла;
	
	Возврат ГотовоеЗначение;
	
КонецФункции

// Возврат Истина - нашли недопустимый символ, Ложь - всё хорошо!
Функция НайтиНедопустимыеСимволыКодаМаркировки(Знач ИсходныйТекст) Экспорт
	
	ДопустимыеСимволыСтрока = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789!%&’'()*+,-./_:;=<>?""";
	
	ИсходныйТекст = СокрЛП(ИсходныйТекст);
	
	Для Индекс = 1 по СтрДлина(ИсходныйТекст) Цикл
		
		ТекущийСимвол = Сред(ИсходныйТекст, Индекс, 1);
		
		Если Найти(ДопустимыеСимволыСтрока, ТекущийСимвол) = 0 Тогда
			Возврат Истина;	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область Префиксы

Функция ПользовательскийПрефикс(Знач НомерОбъекта) Экспорт
	
	// Возвращаемое значение функции (пользовательский префикс).
	Результат = "";
	
	Если НомерСодержитСтандартныйПрефикс(НомерОбъекта) Тогда
		
		Если НомерСодержитПятизначныйПрефикс(НомерОбъекта) Тогда
			НомерОбъекта = Сред(НомерОбъекта, 6);
		Иначе
			НомерОбъекта = Сред(НомерОбъекта, 4);
		КонецЕсли;
		
	КонецЕсли;
	
	СтрокаЦифровыхСимволов = "0123456789";
	
	Для Индекс = 1 По СтрДлина(НомерОбъекта) Цикл
		
		Символ = Сред(НомерОбъекта, Индекс, 1);
		
		Если СтрНайти(СтрокаЦифровыхСимволов, Символ) > 0 Тогда
			Прервать;
		КонецЕсли;
		
		Результат = Результат + Символ;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция НомерСодержитСтандартныйПрефикс(Знач НомерОбъекта)
	
	ПозицияРазделителя = СтрНайти(НомерОбъекта, "-");
	
	Возврат (ПозицияРазделителя = 3 Или ПозицияРазделителя = 5);
	
КонецФункции

Функция НомерСодержитПятизначныйПрефикс(Знач НомерОбъекта)
	
	Возврат СтрНайти(НомерОбъекта, "-") = 5;
	
КонецФункции

#КонецОбласти

#Область ОченьНужныеФункции

Функция ЭтоСсылка(ПроверяемыйТип) Экспорт
	
	Возврат ПроверяемыйТип <> Тип("Неопределено") И ОписаниеТипаВсеСсылки().СодержитТип(ПроверяемыйТип);
	
КонецФункции

Функция ОписаниеТипаВсеСсылки() Экспорт
	
	Возврат Новый ОписаниеТипов(Новый ОписаниеТипов(Новый ОписаниеТипов(Новый ОписаниеТипов(Новый ОписаниеТипов(
		Новый ОписаниеТипов(Новый ОписаниеТипов(Новый ОписаниеТипов(Новый ОписаниеТипов(
			Справочники.ТипВсеСсылки(),
			Документы.ТипВсеСсылки().Типы()),
			ПланыОбмена.ТипВсеСсылки().Типы()),
			Перечисления.ТипВсеСсылки().Типы()),
			ПланыВидовХарактеристик.ТипВсеСсылки().Типы()),
			ПланыСчетов.ТипВсеСсылки().Типы()),
			ПланыВидовРасчета.ТипВсеСсылки().Типы()),
			БизнесПроцессы.ТипВсеСсылки().Типы()),
			БизнесПроцессы.ТипВсеСсылкиТочекМаршрутаБизнесПроцессов().Типы()),
			Задачи.ТипВсеСсылки().Типы());
	
КонецФункции

#КонецОбласти

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//  Записывает объект формы. Возвращает признак успеха. 
//  Нужен для обхода недокументированного поведения платформы.
//  В СП описано, что метод формы Записать() возвращает признак успеха. 
//  Истина - успешно записан; Ложь - в противном случае.
//  Но это происходит не во всех случаях.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма, объект которой нужно записать
//  ПараметрыЗаписи  - Структура - ПараметрыЗаписи метода Записать() формы
//  СообщитьПриИсключении - булево - нужно ли сообщать ОписаниеОшибки() при возникновении исключения
//
// Возвращаемое значение:
//   Булево   - Истина - успешно записан; Ложь - в противном случае.
//
// Вызов:  ЗаполнениеДокументов.ЗаписатьФорму(ЭтаФорма, Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
Функция ЗаписатьФорму(Форма, ПараметрыЗаписи, СообщитьПриИсключении = Истина) Экспорт
	
	Попытка
		ЗаписанУспешно = Форма.Записать(ПараметрыЗаписи);
	Исключение
	    ЗаписанУспешно = Ложь;
		Если СообщитьПриИсключении Тогда
			Сообщить(ОписаниеОшибки());
		КонецЕсли;
	КонецПопытки;
	
	Возврат ЗаписанУспешно;
	
КонецФункции

// Возвращает структуру реквизитов объекта или ссылки, включая стандартные реквизиты и реквизиты табличной части.
// Можно использовать, если необходимо, например, эмулировать вызов метода, использующего объект формы.
//
// Параметры:
//  ВходящийОбъект - ЛюбаяСсылка или ЛюбойОбъект
//
// Возвращаемое значение:
//  Структура
//
Функция КонвертироватьОбъектВСтруктуру(ВходящийОбъект, ТолькоРеквизиты = Ложь, КонвертироватьСтандартныеРеквизиты = Ложь) Экспорт
	
	СтруктураОбъекта = Новый Структура;
	
	Если КонвертироватьСтандартныеРеквизиты Тогда
		СтандартныеРеквизитыОбъекта = ВходящийОбъект.Метаданные().СтандартныеРеквизиты;
		Для Каждого СтандартныйРеквизит Из СтандартныеРеквизитыОбъекта Цикл
			СтруктураОбъекта.Вставить(СтандартныйРеквизит.Имя, ВходящийОбъект[СтандартныйРеквизит.Имя]);
		КонецЦикла;
	КонецЕсли;
	
	РеквизитыОбъекта = ВходящийОбъект.Метаданные().Реквизиты;
	Для Каждого Реквизит Из РеквизитыОбъекта Цикл
		СтруктураОбъекта.Вставить(Реквизит.Имя, ВходящийОбъект[Реквизит.Имя]);
	КонецЦикла;
	
	Если НЕ ТолькоРеквизиты Тогда	
		ТЧ = ВходящийОбъект.Метаданные().ТабличныеЧасти;
		Для Каждого ТаблЧасть Из ТЧ Цикл
			ТЗ = ВходящийОбъект[ТаблЧасть.Имя].Выгрузить();
			Массив = ТаблицаЗначенийВМассив(ТЗ);
			СтруктураОбъекта.Вставить(ТаблЧасть.Имя, Массив);
		КонецЦикла;
	КонецЕсли;
	
	Возврат СтруктураОбъекта;
	
КонецФункции

Функция ТаблицаЗначенийВМассив(ТаблицаЗначений) Экспорт
	
	Массив = Новый Массив();
	СтруктураСтрокой = "";
	НужнаЗапятая = Ложь;
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		Если НужнаЗапятая Тогда
			СтруктураСтрокой = СтруктураСтрокой + ",";
		КонецЕсли;
		СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
		НужнаЗапятая = Истина;
	КонецЦикла;
	Для Каждого Строка Из ТаблицаЗначений Цикл
		НоваяСтрока = Новый Структура(СтруктураСтрокой);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		Массив.Добавить(НоваяСтрока);
	КонецЦикла;
	Возврат Массив;
	
КонецФункции

// Удаляет одно значение из массива.
//
// Параметры:
//  Массив - Массив - массив, из которого необходимо удалить значение;
//  Значение - Массив - удаляемое значение из массива.
// 
Процедура УдалитьЗначениеИзМассива(Массив, Значение) Экспорт
	
	Индекс = Массив.Найти(Значение);
	Если Индекс <> Неопределено Тогда
		Массив.Удалить(Индекс);
	КонецЕсли;
	
КонецПроцедуры

//++Данилова Е.В. 29.09.2025 HELP-7048 
Функция ПодразделениеПродажПоМенеджеру(Знач Менеджер) Экспорт 

	Если ТипЗнч(Менеджер) = Тип("СправочникСсылка.ФизическиеЛица")
		И ЗначениеЗаполнено(Менеджер) Тогда
		
		Если ЗначениеЗаполнено(Менеджер.ПодразделениеПродаж) Тогда
			
			Возврат Менеджер.ПодразделениеПродаж; 	
			
		КонецЕсли;
		
		Возврат Менеджер.Подразделение; 
		
	Иначе 
		Возврат Справочники.Подразделения.ПустаяСсылка(); 
	КонецЕсли;	

КонецФункции // ПодразделениеПродажПоМенеджеру()

//--Данилова Е.В. 29.09.2025
