Функция ПолучитьГТИН(Номенклатура) Экспорт
	ГТИН = "";
	
	
	//Кухарь А.Ю. 01.06.2026 начало
	//ШК = ПолучитьВсеШКТовара(Номенклатура, Перечисления.ТипыШтрихКодов.Штука, Перечисления.ВидыШК.Основной);
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ШК = ПолучитьВсеШКТовара(Номенклатура, Перечисления.ТипыШтрихКодов.Штука, Перечисления.ВидыШК.Основной);
	#Иначе
		ШК = ОбщегоНазначенияС.ПолучитьВсеШКТовараСервер(Номенклатура, Перечисления.ТипыШтрихКодов.Штука,
			Перечисления.ВидыШК.Основной);
	#КонецЕсли	
	//Кухарь А.Ю. 01.06.2026 конец
	
	Если ШК.Количество() = 1 Тогда
		ГТИН = Прав("00000000000000"+СокрЛП(ШК[0].Наименование),14);	
	КонецЕсли; 	
	
	Возврат ГТИН;
КонецФункции //ПолучитьГТИНТовара(Номенклатура) 

Функция ПолучитьЗначенияСвойствНК(Модель) Экспорт

	
	//Кухарь А.Ю. 01.06.2026 начало
	//ТНВЭД 		= ЗначениеРеквизитаОбъекта(Модель, "ТНВЭД");
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ТНВЭД 		= ЗначениеРеквизитаОбъекта(Модель, "ТНВЭД");
	#Иначе
		ТНВЭД 		= ОбщегоНазначенияС.ЗначениеРеквизитаОбъектаСервер(Модель, "ТНВЭД");
	#КонецЕсли	
	//Кухарь А.Ю. 01.06.2026 конец
	
	тСвойства	= Справочники.ТНВЭД.ПолучитьПараметрыНоменклатурыНК(ТНВЭД);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Свойства ИЗ &тСвойства КАК тСвойства
	|;
	|ВЫБРАТЬ
	|	ВТ_Свойства.*,
	|   ЗначенияСвойств.Значение КАК Значение
	|ИЗ
	|	ВТ_Свойства
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойств
	|ПО
	|	ЗначенияСвойств.Объект = &Номенклатура
	|	И ЗначенияСвойств.Свойство = ВТ_Свойства.Свойство
	|";	
	
	Запрос.УстановитьПараметр("тСвойства", 		тСвойства);
	Запрос.УстановитьПараметр("Номенклатура", 	Модель);
	
	тСвойства = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаС Из тСвойства Цикл
		СтрокаС.Значение = СтрокаС.Свойство.ТипЗначения.ПривестиЗначение(СтрокаС.Значение);		
	КонецЦикла;
	
	Возврат тСвойства;

КонецФункции //ПолучитьЗначенияСвойствНК(Модель) Экспорт  
//++Данилова Е.В. 18.11.2025  MARK-2741 
Функция ПолучитьТаблицуГТИНИзИстории(Знач Модель) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсторияГТИННоменклатуры.ГТИН КАК ГТИН,
		|	МАКСИМУМ(ИсторияГТИННоменклатуры.Период) КАК Период
		|ПОМЕСТИТЬ ВТГТИНПоследние
		|ИЗ
		|	РегистрСведений.ИсторияГТИННоменклатуры КАК ИсторияГТИННоменклатуры
		|ГДЕ
		|	ИсторияГТИННоменклатуры.Номенклатура = &Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсторияГТИННоменклатуры.ГТИН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсторияГТИННоменклатуры.ГТИН КАК ГТИН,
		|	ИсторияГТИННоменклатуры.ВидГТИН КАК ВидГТИН,
		|	ИсторияГТИННоменклатуры.СнятСПроизводства КАК СнятСПроизводства,
		|	ИсторияГТИННоменклатуры.Период КАК Период
		|ИЗ
		|	РегистрСведений.ИсторияГТИННоменклатуры КАК ИсторияГТИННоменклатуры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТГТИНПоследние КАК ВТГТИНПоследние
		|		ПО (ВТГТИНПоследние.ГТИН = ИсторияГТИННоменклатуры.ГТИН)
		|			И (ВТГТИНПоследние.Период = ИсторияГТИННоменклатуры.Период)
		|ГДЕ
		|	ИсторияГТИННоменклатуры.Номенклатура = &Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИсторияГТИННоменклатуры.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Номенклатура", Модель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить(); 


КонецФункции // ПолучитьТаблицуГТИНИзИстории()

//--Данилова Е.В. 18.11.2025
 