// +++ {Кузнецов Сергей Владимирович [19.07.2023]
Перем ПроверяемыеРеквизиты;
// }Кузнецов Сергей Владимирович +++ [19.07.2023]

Процедура ПередЗаписью(Отказ)
	//+++Чирков 01.04.2025
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков 01.04.2025
	
	// Шворобей ВЮ 11.01.2024 ++
	РазрешенныеСтавкиНДС = Новый Массив;
	РазрешенныеСтавкиНДС.Добавить(Перечисления.СтавкиНДС.НДС10);
	//Валетов + 19,01,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8475
	//РазрешенныеСтавкиНДС.Добавить(Перечисления.СтавкиНДС.НДС20);   
	РазрешенныеСтавкиНДС.Добавить(Перечисления.СтавкиНДС.НДС22);
	//Валетов -
	// Шворобей ВЮ 11.01.2024 ++
	
	// +++ {Кузнецов Сергей Владимирович [19.07.2023]
	ПроверяемыеРеквизиты = Новый Соответствие;       
	Если ЭтоНовый()  Тогда
		ПроверяемыеРеквизиты.Вставить("ЭтоНовый",Истина); 
	Иначе
		Если ЭтоГруппа Тогда
			ПроверяемыеРеквизиты.Вставить("ШтукВКоробке",Ссылка.ШтукВКоробке);
			ПроверяемыеРеквизиты.Вставить("ШтукВКоробочке",Ссылка.ШтукВКоробочке);
		Иначе		
			ПроверяемыеРеквизиты.Вставить("Наименование",Ссылка.Наименование);
			ПроверяемыеРеквизиты.Вставить("Родитель",Ссылка.Родитель);
		КонецЕсли;
	КонецЕсли;
	// }Кузнецов Сергей Владимирович +++ [19.07.2023]
	Если НЕ ОбменДанными.Загрузка Тогда
		Отказ=НЕ ПолучитьПолномочиеПользователя("РедактированиеНоменклатуры");	
		
		//Чирков - запрет переноса элементов между группами+++
		Если НЕ Ссылка.Пустая() И НЕ Ссылка.ЭтоГруппа И Ссылка.Родитель<>Родитель Тогда
			Полномочие=ПланыВидовХарактеристик.ПолномочияПользователей.НайтиПоНаименованию("Перенос номенклатуры между группами");
			Если Полномочие.Пустая() ИЛИ НЕ ПолучитьПолномочиеПользователя(Полномочие) Тогда
				Отказ=Истина;			
			КонецЕсли;
		КонецЕсли;		
		//Чирков - запрет переноса элементов между группами---
		
		//крохин начало 13.02.2013
		//запретим создавать группы и элементы с неправильной иерархией
		Если Не Родитель.Пустая() Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Номенклатура.ЭтоГруппа 
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.Родитель = &Родитель";
			Запрос.УстановитьПараметр("Родитель",Родитель);
			Выборка= Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Если Выборка.ЭтоГруппа <> ЭтоГруппа Тогда
					Сообщить("Неверная иерархия справочника номенклатура! Сохранение невозможно");
					Отказ = Истина;	
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		//крохин конец 13.02.2013
		
		//крохин начало 13.05.2022
		//штук в комплекте и вид комплекта, перезаписываем на группу при изменении элемента
		Если НЕ ЭтоГруппа И Родитель.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Товар Тогда
			//крохин начало 16.06.2022
			Если ЖизненныйЦиклНоменклатуры.Пустая() Тогда
				ЖизненныйЦиклНоменклатуры = Перечисления.ЖизненныйЦиклНоменклатуры.Активна;	
			КонецЕсли;
			//крохин конец 16.06.2022
			ТекШтукВКомплекте = 0;	
			
			Если ВидКомплекта <> Перечисления.ВидыКомплектов.Ассортито Тогда
				ТекШтукВКомплекте = 0;
				Для Каждого СтрокаТЧКМПЛ Из Коплектующие Цикл
					Если СтрокаТЧКМПЛ.Номенклатура.Родитель.ВидНоменклатуры =Перечисления.ВидыНоменклаутры.Товар Тогда
						ТекШтукВКомплекте = ТекШтукВКомплекте + СтрокаТЧКМПЛ.Количество;
					КонецЕсли;
				КонецЦикла;	
				Если ТекШтукВКомплекте = 0 Тогда
					ТекШтукВКомплекте = 1;
				КонецЕсли;
			Иначе 
				ТекШтукВКомплекте = 1;	
			КонецЕсли;
			
			Если ВидКомплекта.Пустая() Тогда
				Если Коплектующие.Количество() = 0 Тогда
					//крохин начало 23.05.2022
					//пока не заполняем вид комплекта = товар на элемент, в обработках ИМ сейчас прописано " любой заполненный комплект = комплект", "пустой" = "товар"
					//ВидКомплекта = Перечисления.ВидыКомплектов.Товар;
					//крохин конец 23.05.2022
				Иначе
					ВидКомплекта = Перечисления.ВидыКомплектов.Комплект; 
				КонецЕсли;
				
			КонецЕсли;
			
			// Кухарь А.Ю.  22.02.2024 начало
			// Если Родитель.ШтукВКомплекте  <>  ТекШтукВКомплекте ИЛИ Родитель.ВидКомплекта <> ВидКомплекта Тогда
			Если Родитель.ШтукВКомплекте  <>  ТекШтукВКомплекте ИЛИ Родитель.ВидКомплекта <> ?(ВидКомплекта.Пустая(),Перечисления.ВидыКомплектов.Товар,ВидКомплекта) Тогда	 
				// Кухарь А.Ю.  22.02.2024 конец
				НоменклатураРодитель = 	Родитель.ПолучитьОбъект();
				//крохин начало 23.05.2022
				//пока не заполняем вид комплекта = товар на элемент, в обработках ИМ сейчас прописано " любой заполненный комплект = комплект", "пустой" = "товар"
				//НоменклатураРодитель.ВидКомплекта = ВидКомплекта;
				НоменклатураРодитель.ВидКомплекта = ?(ВидКомплекта.Пустая(),Перечисления.ВидыКомплектов.Товар,ВидКомплекта);
				//крохин конец 23.05.2022
				НоменклатураРодитель.ШтукВКомплекте = ТекШтукВКомплекте;
				НоменклатураРодитель.Записать();
			КонецЕсли;
			
		КонецЕсли;
		
		//крохин конец 13.05.2022
		
		// Шворобей ВЮ 01.12.2022 ++
		Если ПолучитьРеквизитРодителя(Ссылка, "ВидНоменклатуры") = Перечисления.ВидыНоменклаутры.Товар Тогда
			Если ЗначениеЗаполнено(Цвет) И Цвет.НеИспользовать Тогда
				СообщитьИзМодуля("Выбран Цвет с признаком <НеИспользовать>!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
		// Шворобей ВЮ 01.12.2022 ++
		//++Данилова Е.В. 16.10.2025 MARK-3128 
		// Шворобей ВЮ 11.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5500
		//Если ЭтоГруппа И ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Товар И ЭтоМодель
		//	//Валетов + 08,07,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5922
		//	И НЕ Врег(СокрЛП(Коллекция.Наименование)) = Врег("В разработке")
		//	//Валетов -
		//	Тогда
		//	Если НЕ ЗначениеЗаполнено(ТНВЭД) Тогда
		//		СообщитьИзМодуля("Не заполнен <ТНВЭД>!");
		//		Отказ = Истина;
		//		Возврат;
		//	КонецЕсли;
		//КонецЕсли;
		// Шворобей ВЮ 11.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5500 
		Если НЕ ПометкаУдаления 
			И ЭтоГруппа 
			И НЕ ЗначениеЗаполнено(ТНВЭД) Тогда
			
			Если ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Товар 
				И ЭтоМодель 
				И НЕ Врег(СокрЛП(Коллекция.Наименование)) = Врег("В разработке") Тогда
				
				СообщитьИзМодуля("Не заполнен <ТНВЭД>!");
				Отказ = Истина;
				Возврат; 			
				
			КонецЕсли;	
		ИначеЕсли Не ПометкаУдаления 
			И Не ЭтоГруппа 
			И НЕ ЗначениеЗаполнено(Родитель.ТНВЭД) Тогда
			
			Если Родитель.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Товар
				И Родитель.ЭтоМодель 
				И НЕ Врег(СокрЛП(Родитель.Коллекция.Наименование)) = Врег("В разработке") Тогда
				
				СообщитьИзМодуля("Не заполнен <ТНВЭД> у модели!");
				Отказ = Истина;
				Возврат;	
				
			КонецЕсли;
			
		КонецЕсли;
		//--Данилова Е.В. 16.10.2025
		// Шворобей ВЮ 11.01.2024 ++
		Если ЭтоГруппа И (ПолучитьРеквизитРодителя(Ссылка, "ВидНоменклатуры") = Перечисления.ВидыНоменклаутры.Товар 
			ИЛИ ПолучитьРеквизитРодителя(Ссылка, "ВидНоменклатуры") = Перечисления.ВидыНоменклаутры.РекламаПлатная) Тогда
			Если РазрешенныеСтавкиНДС.Найти(СтавкаНДС) = Неопределено Тогда
				//крохин начало 16.01.2024
				//для каталога "франчазинг" пока оставим, и надо подумать, как его выделить.			
				//СообщитьИзМодуля("Выбрана запрещенная СтавкаНДС!");
				//Отказ = Истина;
				//Возврат;
				КаталогФранчайзинг = Справочники.Номенклатура.НайтиПоКоду("SNL-309252");
				Если НЕ Ссылка.ПринадлежитЭлементу(КаталогФранчайзинг) Тогда
					СообщитьИзМодуля("Выбрана запрещенная СтавкаНДС!");
					Отказ = Истина;
					Возврат;
				КонецЕсли;
				//крохин конец 16.01.2024
			КонецЕсли;
		КонецЕсли;
		// Шворобей ВЮ 11.01.2024 ++
		
		// Ратманов 28.01.2025 ++
		Если ЗначениеЗаполнено(Родитель) Тогда
		РодительОбъект = Родитель.ПолучитьОбъект();
		Если ЭтоГруппа = Ложь И РодительОбъект.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Товар И ЗначениеЗаполнено(ВидКомплекта) и Коплектующие.Количество()>0 Тогда
			Если НЕ ВидКомплекта = Перечисления.ВидыКомплектов.Товар Тогда
				Если НЕ ЗначениеЗаполнено(РодительОбъект.ФР_ВидНоменклатуры) ИЛИ НЕ ЗначениеЗаполнено(РодительОбъект.ФР_Бренд) Тогда
					Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
					                      |	СпрНоменклатура.Ссылка КАК Ссылка,
					                      |	СпрНоменклатура_Комплектующие.Номенклатура.Родитель КАК Родитель,
					                      |	СпрФР_Бренды_К.Ссылка КАК ФР_Бренд,
					                      |	СпрФР_ВидыНоменклатуры_К.Ссылка КАК ФР_ВидНоменклатуры
					                      |ИЗ
					                      |	Справочник.Номенклатура КАК СпрНоменклатура
					                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК СпрНоменклатура_Комплектующие
					                      |		ПО СпрНоменклатура.Ссылка = СпрНоменклатура_Комплектующие.Ссылка
					                      |			И (СпрНоменклатура_Комплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар))
					                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФР_Бренды КАК СпрФР_Бренды_К
					                      |		ПО (СпрФР_Бренды_К.Ссылка = СпрНоменклатура_Комплектующие.Номенклатура.Родитель.ФР_Бренд)
					                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФР_ВидыНоменклатуры КАК СпрФР_ВидыНоменклатуры_К
					                      |		ПО (СпрФР_ВидыНоменклатуры_К.Ссылка = СпрНоменклатура_Комплектующие.Номенклатура.Родитель.ФР_ВидНоменклатуры)
					                      |ГДЕ
					                      |	НЕ СпрНоменклатура.ЭтоГруппа
					                      |	И СпрНоменклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
					                      |	И НЕ СпрНоменклатура.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Товар)
					                      |	И СпрНоменклатура.Ссылка = &Ссылка");
					Запрос.УстановитьПараметр("Ссылка",Ссылка);
					Таб = Запрос.Выполнить().Выгрузить();
					Если Таб.Количество()>0 Тогда
						ИсточникОбъект = Таб[0].Родитель.ПолучитьОбъект();
						ЗаполнитьЗначенияСвойств(РодительОбъект,ИсточникОбъект,"ФР_ВидНоменклатуры,ФР_Бренд,ФР_Коллекция");
						РодительОбъект.Записать();
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	Иначе
		//Чирков - первичные группы в офисе при обмене не переписываем 10.02.12 +++
		Если ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			Если НЕ ЭтоНовый() И НЕ ЭтоГруппа И НЕ Ссылка.ПервичнаяГруппа.Пустая() И Ссылка.ПервичнаяГруппа<>ПервичнаяГруппа Тогда  
				ПервичнаяГруппа=Ссылка.ПервичнаяГруппа;
			КонецЕсли;				
		КонецЕсли;		
		//Чирков - первичные группы в офисе при обмене не переписываем 10.02.12 ---
	КонецЕсли; 	
	КонецЕсли; 	
	
	Если ПустаяСтрока(Код77) Тогда
		Код77=Код;	
	КонецЕсли;
	//Нечаева +++
	//для обмена с сайтом.
	
	//крохин начало 19.02.2023
	//установка галки "модель", для групп с элементами
	Если Не ЭтоГруппа Тогда
		//+++Чирков 17.10.2025 MARK-3149 - падает при обменах если битый родитель
		//Если НЕ Родитель.ЭтоМодель Тогда
		//	НоменклатураРодитель = 	Родитель.ПолучитьОбъект();
		//	НоменклатураРодитель.ЭтоМодель = Истина;
		//	НоменклатураРодитель.Записать();
		//КонецЕсли;
		
		гЭтоМодель = ПолучитьРеквизитШапки(Родитель, "ЭтоМодель");
		Если гЭтоМодель = Ложь Тогда
			УстановитьРеквизитыОбъекта(Родитель, Новый Структура("ЭтоМодель", Истина), , Истина);
		КонецЕсли;
		//---Чирков 17.10.2025 - падает при обменах если битый родитель
	КонецЕсли;                 	
	//крохин конец 19.02.2023
	//++Данилова Е.В. 04.06.2025 MARK-2355 
	Если НЕ ЭтоГруппа Тогда
	
		РазныеТНВЭДВКомплектеЗначение = РазныеТНВЭДВКомплектеСпайка(); 	
	    Если РазныеТНВЭДВКомплекте <> РазныеТНВЭДВКомплектеЗначение Тогда
		
			РазныеТНВЭДВКомплекте = РазныеТНВЭДВКомплектеЗначение; 	
		
		КонецЕсли;
	КонецЕсли;
	//--Данилова Е.В. 04.06.2025
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	// временно тест	!!!!!
	
	//Кухарь А.Ю. 31.03.2026 начало
	// Если ПланыОбмена.ОбменССайтомТоварами.ЭтотУзел().Код="SNL"  И  ТекСтрокаСоединения=СтрокаСоединенияСразрешеннымОбменом Тогда
	Если ПланыОбмена.ОбменССайтомТоварами.ЭтотУзел().Код="SNL"  И  ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза()  Тогда
		//Кухарь А.Ю. 31.03.2026 конец
		
		// нечаева 27,10,2022++
		//Если ПланыОбмена.ОбменССайтомТоварами.ЭтотУзел().Код="SNL"  Тогда
		
			
		//нечаева 15,05,23+++
		Если ЭтоНовый()  ТОгда  // новый цвет размер, у выгрузки, родителя поставим на перевыгрузку, ссылки еще нет.
			
			//нечаева 10,10,23++ 				
			//Для монобрендовых сайтов - если узлы у модели, то пишем в обмен , при новом цвете- размере..
			КолУзлов= ПроцедурыОбменаССайтом.ПолучитьСписокУзловМонобрендовыхСайтов(ЭтотОбъект.РОдитель.ссылка,Истина);
			Если КолУзлов.количество()>0  и ЭтотОбъект.ЭтоГруппа = ложь  Тогда
				ПроцедурыОбменаССайтом.ЗарегистрироватьИзмененияМонобрСайтов(ЭтотОбъект.Родитель);
			КонецЕсли;
			//нечаева 10,10,23 ---
			
			
			ВыгрРодитель = ПроцедурыОбменаССайтом.ВыгружатьНаСайт(ЭтотОбъект.Родитель,ложь); // тут и родители проверяются
			Если ВыгрРодитель = "Да"  и ЭтотОбъект.ЭтоГруппа = ложь  ТОгда // если цвет размер , родителя перевыгружаем.
				ПроцедурыОбменаССайтом.ПриЗаписиСправочникаОбменССайтомПриЗаписи(ЭтотОбъект.Родитель,Отказ,ложь);
			КонецЕсли;
			
			//для стильпарка тоже самое
			ВыгрРодитель = ПроцедурыОбменаССайтом.ВыгружатьНаСайт(ЭтотОбъект.Родитель,истина); // тут и родители проверяются
			Если ВыгрРодитель = "Да"  и ЭтотОбъект.ЭтоГруппа = ложь  ТОгда // если цвет размер , родителя перевыгружаем.
				ПроцедурыОбменаССайтом.ПриЗаписиСправочникаОбменССайтомПриЗаписи(ЭтотОбъект.Родитель,Отказ,истина);
			КонецЕсли;
		иначе
			
			// нечаева 10,10,23+++
			// для монобрендовых пишем тут 	
			// тут только изменение активности по ТЧ списка узлов для монобрендовых сайтов. активна-не активна.
			ВыгружатьМонобрУзлы = ПроцедурыОбменаССайтом.РегистрироватьИзмененияУзловДляМонобрендовыхСайтов(Ссылка,ЭтотОбъект); // если "да"-нет
			// вторая часть все остальные изменения по номенклатуре.
			ВыгружатьИзменения = ПроцедурыОбменаССайтом.РегистрироватьИзмененияНоменклатурыДляМонобрендовыхСайтов(Ссылка,ЭтотОбъект);   
			Если ВыгружатьИзменения Тогда
				ПроцедурыОбменаССайтом.ЗарегистрироватьИзмененияМонобрСайтов(ссылка);
			КонецЕсли;
			// нечаева 10,10,23 ---
			
			ОбменСтильпарк =ложь;
			// сначало для б2б проверим		   
			Выгружать=ПроцедурыОбменаССайтом.РегистрироватьИзмененияНоменклатурыДляСайта(Ссылка,ЭтотОбъект,ОбменСтильпарк);
			
			Если Выгружать Тогда
				ПроцедурыОбменаССайтом.ПриЗаписиСправочникаОбменССайтомПриЗаписи(Ссылка,Отказ,ОбменСтильпарк);
			КонецЕсли;
			
			// для стильпарка проверим.
			ОбменСтильпарк = истина;
			Выгружать=ПроцедурыОбменаССайтом.РегистрироватьИзмененияНоменклатурыДляСайта(Ссылка,ЭтотОбъект,ОбменСтильпарк);
			
			Если Выгружать Тогда
				ПроцедурыОбменаССайтом.ПриЗаписиСправочникаОбменССайтомПриЗаписи(Ссылка,Отказ,ОбменСтильпарк);
			КонецЕсли;

			
		КонецЕсли;	
		//нечаева 15,05,23---
		
	КонецЕсли;
	//нечаева 27,10,22--
	
	// Шворобей ВЮ 13.08.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-6378
	Если НЕ ЭтоНовый() И СнятСПроизводства <> Ссылка.СнятСПроизводства Тогда
		ДополнительныеСвойства.Вставить("ИзменилосьСнятСПроизводства", СнятСПроизводства);	
	КонецЕсли;
	// Шворобей ВЮ 13.08.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-6378
	
	//крохин начало 01.02.2024
	//реквизит устанавливается только после записи
	Если ЭтоНовый() И ЭтоГруппа Тогда
	ТоварнаяГруппаВерхнегоУровня = Ложь;	
	КонецЕсли;
	//крохин конец 01.02.2024
	
	//крохин начало 31.05.2019
	//вместо авторегистрации изменений
	УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	//крохин конец 31.05.2019
	
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)	
	Префикс=ПолучитьПрефиксНомеров(ЭтотОбъект);
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ ЭтоГруппа Тогда
		ОсновнаяЕдиница	= Неопределено;
		//крохин начало 06.06.2013
		ПервичнаяГруппа = Неопределено;
		//крохин конец 06.06.2013
		
		СтатусКарточкиВЧЗ = Неопределено;
		
		// Кухарь А.Ю.  15.10.2024 начало
		ГТИН=""; 
		// Кухарь А.Ю.  15.10.2024 конец
		
	КонецЕсли;	
	// нечаева ++
	Если  ЭтоГруппа Тогда
		БрендДляОтчета   =    Неопределено;
		//крохин начало 17.08.2011
		Коллекция = Неопределено;
		//крохин конец 17.08.2011		
	КонецЕсли;
	// нечаева --
	Код77				= Неопределено;
	
	//Валетв + 08,07,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5916
	Если НЕ ЭтоГруппа Тогда
		НаименованиеGS1 = "";
	КонецЕсли;
	//Валетов - 
	
КонецПроцедуры

//Катаев+ 17/06/14
Процедура ПриЗаписи(Отказ)
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли; 
	
	Если Не Отказ Тогда
		УстановитьПолучателейИзмененийОбъектаВнешние(ЭтотОбъект);
	КонецЕсли;
	
	//крохин начало 14.07.2020
	//только для ЦО
	//Если ЗначениеЗаполнено(ТипНоменклатуры) ИЛИ ЗначениеЗаполнено(БрендДляПлана) Тогда	
	//	ПрописатьБрендИТипДляПлана();				
	//КонецЕсли; 
	Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		Если ЗначениеЗаполнено(ТипНоменклатуры) ИЛИ ЗначениеЗаполнено(БрендДляПлана) Тогда	
			ПрописатьБрендИТипДляПлана();				
		КонецЕсли; 
	КонецЕсли;
	//крохин конец 14.07.2020
	// +++ {Кузнецов Сергей Владимирович [19.07.2023]
	
	// Кухарь А.Ю. 21.08.2023 начало
	//
	если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.Склад тогда
		// Кухарь А.Ю. 21.08.2023 конец
		
		Если  ПроверяемыеРеквизиты["ЭтоНовый"] = Неопределено Тогда
			Если НЕ ЭтоГруппа И (НЕ Наименование = ПроверяемыеРеквизиты["Наименование"] ИЛИ НЕ Родитель = ПроверяемыеРеквизиты["Родитель"])  Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(ПланыОбмена.СкладТСД.НайтиПоНаименованию("Все",Истина), Ссылка);
			ИначеЕсли ЭтоГруппа И (НЕ ШтукВКоробке = ПроверяемыеРеквизиты["ШтукВКоробке"] ИЛИ НЕ ШтукВКоробочке = ПроверяемыеРеквизиты["ШтукВКоробочке"])  Тогда   
				ПланыОбмена.ЗарегистрироватьИзменения(ПланыОбмена.СкладТСД.НайтиПоНаименованию("Все",Истина), Ссылка);
			КонецЕсли;
		Иначе
			ПланыОбмена.ЗарегистрироватьИзменения(ПланыОбмена.СкладТСД.НайтиПоНаименованию("Все",Истина), Ссылка);
		КонецЕсли;
		// }Кузнецов Сергей Владимирович +++ [19.07.2023]
		// Кухарь А.Ю. 21.08.2023 начало
		//
	КонецЕсли; 
	// Кухарь А.Ю. 21.08.2023 конец
	//++Данилова Е.В. 14.02.2025 MARK-1429 
	Если Не ЭтоГруппа Тогда 
		МаркировкаС.ЗаписатьИсториюГТИН(ссылка,ГТИН,Отказ);
	КонецЕсли; 
	//--Данилова Е.В. 14.02.2025
	//++ Ратманов ASU-1737
	Если ЭтоГруппа и ЗначениеЗаполнено(Ссылка) и не ПараметрыСеанса.ЗапущенаОбработка Тогда
		ПараметрыФЗ = Новый Массив;
		ПараметрыФЗ.Добавить(Ссылка);
		ПараметрыФЗ.Добавить(МинимальноеКоличествоДляЗаказаНаПроизводство);
		//ОбработчикиФоновыхЗаданий.ЗапуститьФЗ("ОбработчикиФоновыхЗаданий.Номенклатура_УстановитьМинКоличествоДляПроизводстваПоРодителю",ПараметрыФЗ,"Установка параметра МинимальноеКоличествоДляЗаказаНаПроизводство по "+Код);
	КонецЕсли;	
	//-- Ратманов ASU-1737
	
	// Шворобей ВЮ 13.08.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-6378
	Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение 
		И ДополнительныеСвойства.Свойство("ИзменилосьСнятСПроизводства") Тогда
		
		ТемаПисьма = "Рассылка об изменении признака <Снят с производства>";
		ТипРассылки = Справочники.ТипыРассылок.ИзменениеПризнакаСнятСПроизводства;
		ФлагРассылки = "РассылкиЭлПочта";
		
		ТелоПисьма = СокрЛП(Ссылка) + " признак <Снят с производства> стал " + Строка(ДополнительныеСвойства.ИзменилосьСнятСПроизводства);
		
		СписокПолучателей = СформСписокПолучат(ТипРассылки, , ФлагРассылки);
	
		Если НЕ ПустаяСтрока(ТелоПисьма) И СписокПолучателей.Количество() > 0 Тогда
			Ответ = СформироватьВнутреннееУведомление(СписокПолучателей, ТелоПисьма, ТемаПисьма,,,,"robot@collant.ru");
		КонецЕсли;
		
	КонецЕсли;
	// Шворобей ВЮ 13.08.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-6378
	
КонецПроцедуры //Катаев- 17/06/14

Процедура ПрописатьБрендИТипДляПлана()
	Запрос=Новый ("Запрос");
	Запрос.Текст="	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Родитель КАК Ссылка,
	|	ТипНоменклатуры,
	|	БрендДляПлана
	|ИЗ
	|	Справочник.Номенклатура
	|ГДЕ
	|	НЕ ЭтоГруппа
	|	И Ссылка В ИЕРАРХИИ(&Группа)	
	|	И (
	|		(Родитель.ТипНоменклатуры<>&ТипНоменклатуры И &ТипНоменклатуры<>ЗНАЧЕНИЕ(Справочник.ТипыТовара.ПустаяСсылка))
	|		ИЛИ (Родитель.БрендДляПлана<>&БрендДляПлана И &БрендДляПлана<>ЗНАЧЕНИЕ(Справочник.БрендыДляПлана.ПустаяСсылка))
	|	)		
	|	И Ссылка<>&Группа
	|";
	
	Запрос.УстановитьПараметр("Группа",			Ссылка);
	Запрос.УстановитьПараметр("БрендДляПлана",	БрендДляПлана);
	Запрос.УстановитьПараметр("ТипНоменклатуры",ТипНоменклатуры);
	
	Реквизиты=Новый Структура();
	Если ЗначениеЗаполнено(БрендДляПлана) Тогда
		Реквизиты.Вставить("БрендДляПлана",БрендДляПлана);	
	КонецЕсли;
	Если ЗначениеЗаполнено(ТипНоменклатуры) Тогда
		Реквизиты.Вставить("ТипНоменклатуры",ТипНоменклатуры);	
	КонецЕсли;	
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		УстановитьРеквизитыОбъекта(Выборка.Ссылка,Реквизиты);	
	КонецЦикла;
КонецПроцедуры 
//++Данилова Е.В. 04.06.2025  MARK-2355 
Функция РазныеТНВЭДВКомплектеСпайка()
	
	Если ВидКомплекта = Перечисления.ВидыКомплектов.Комплект
		И Коплектующие.Количество() > 1 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Комплектующие.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
		|ПОМЕСТИТЬ ВТКомплектующие
		|ИЗ
		|	&Комплектующие КАК Комплектующие
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НоменклатураКоплектующие.Номенклатура.Родитель.ТНВЭД) КАК КОЛИЧЕСТВО
		|ИЗ
		|	ВТКомплектующие КАК НоменклатураКоплектующие
		|ГДЕ
		|	НоменклатураКоплектующие.Номенклатура.Родитель.ТНВЭД <> ЗНАЧЕНИЕ(Справочник.ТНВЭД.ПустаяСсылка) 
		//++Данилова Е.В. 22.07.2025 MARK-2355
		|	И НоменклатураКоплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар) 
		//--Данилова Е.В. 22.07.2025
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НоменклатураКоплектующие.Номенклатура.Родитель.ТНВЭД) > 1";
		
		Запрос.УстановитьПараметр("Комплектующие",Коплектующие.Выгрузить()); 
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Возврат  НЕ РезультатЗапроса.Пустой(); 
	Иначе 
		
	    Возврат ложь;  
	КонецЕсли;

КонецФункции // РазныеТНВЭДВКомплектеСпайка()

//--Данилова Е.В. 04.06.2025
