#Область СоединениеHTTP	

//test1
// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Функция HTTPСоединение(ЗащищенноеСоединение = Истина) Экспорт

	НастройкиСоединения = ПолучитьПараметрыСоединения(); 	
	
	Ssl = Новый ЗащищенноеСоединениеOpenSSL();
	Прокси = Новый ИнтернетПрокси(Ложь); 
	//
	Если НастройкиСоединения.Порт = 80 Тогда 		
		ЗащищенноеСоединение = Ложь; 
	КонецЕсли;
	
	Попытка
		Если ЗащищенноеСоединение Тогда
			
			СоединениеHTTP = Новый HTTPСоединение(НастройкиСоединения.Сервер, НастройкиСоединения.Порт, НастройкиСоединения.Логин, НастройкиСоединения.Пароль,Прокси,,ssl);
		Иначе 
			
			СоединениеHTTP = Новый HTTPСоединение(НастройкиСоединения.Сервер, НастройкиСоединения.Порт, НастройкиСоединения.Логин, НастройкиСоединения.Пароль,Прокси);
		КонецЕсли;
		
		
		Возврат СоединениеHTTP; 
		
	Исключение
		Сообщить(ОписаниеОшибки()); 
		Возврат неопределено;
	КонецПопытки;
	
КонецФункции // СоединениеССервером()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьПараметрыМетодаЗагрузки(Знач Подразделение = неопределено)  Экспорт
	
	Если Подразделение = неопределено Тогда
		
		Подразделение = Справочники.Подразделения.НайтиПоКоду("SSP-0001"); 	
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕЭ_НастройкиОбменаСрезПоследних.КлючАвторизации КАК КлючАвторизации,
	|	ЕЭ_НастройкиОбменаСрезПоследних.СервисЗагрузки КАК СервисЗагрузки,
	|	ЕЭ_НастройкиОбменаСрезПоследних.ДатаНачалаРаботыВ1С КАК ДатаНачалаРаботыВ1С,
	|	ЕЭ_НастройкиОбменаСрезПоследних.ХранитьПодробностиЛогирования КАК ХранитьПодробностиЛогирования
	|ИЗ
	|	РегистрСведений.b2b_НастройкиОбменаЗаявками.СрезПоследних(, Подразделение = &Подразделение) КАК ЕЭ_НастройкиОбменаСрезПоследних";
	
	Запрос.УстановитьПараметр("Подразделение",Подразделение); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтруктураДанных = Новый Структура("КлючАвторизации,СервисЗагрузки,ДатаНачалаРаботыВ1С,ХранитьПодробностиЛогирования"); 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураДанных,ВыборкаДетальныеЗаписи); 
	КонецЦикла;
	
	Возврат СтруктураДанных; 


КонецФункции // ПараметрыМетодаЗагрузки()

Функция ПолучитьПараметрыМетодаВыгрузки(Знач Подразделение = неопределено)  Экспорт
	Если Подразделение = неопределено Тогда
		
		Подразделение = Справочники.Подразделения.НайтиПоКоду("SSP-0001"); 	
		
	КонецЕсли; 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕЭ_НастройкиОбменаСрезПоследних.КлючАвторизации КАК КлючАвторизации,
	|	ЕЭ_НастройкиОбменаСрезПоследних.СервисВыгрузки КАК СервисВыгрузки,
	|	ЕЭ_НастройкиОбменаСрезПоследних.СервисВыгрузкиОстатков КАК СервисВыгрузкиОстатков,
	|	ЕЭ_НастройкиОбменаСрезПоследних.СервисВыгрузкиОстатковОсновной КАК СервисВыгрузкиОстатковОсновной,
	|	ЕЭ_НастройкиОбменаСрезПоследних.СервисПолученияДанныхОчередиОстатки КАК СервисПолученияДанныхОчередиОстатки,
	|	ЕЭ_НастройкиОбменаСрезПоследних.ХранитьПодробностиЛогирования КАК ХранитьПодробностиЛогирования
	|ИЗ
	|	РегистрСведений.b2b_НастройкиОбменаЗаявками.СрезПоследних(, Подразделение = &Подразделение) КАК ЕЭ_НастройкиОбменаСрезПоследних";
	
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтруктураДанных = Новый Структура("КлючАвторизации,СервисВыгрузки,
	|СервисВыгрузкиОстатков,СервисВыгрузкиОстатковОсновной,
	|СервисПолученияДанныхОчередиОстатки,ХранитьПодробностиЛогирования"); 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураДанных,ВыборкаДетальныеЗаписи); 
	КонецЦикла;
	
	Возврат СтруктураДанных; 


КонецФункции //

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьПараметрыСоединения(Знач Подразделение = неопределено) Экспорт
	
	Если Подразделение = неопределено Тогда
		
		Подразделение = Справочники.Подразделения.НайтиПоКоду("SSP-0001"); 	
		
	КонецЕсли; 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕЭ_НастройкиОбменаСрезПоследних.Сервер КАК Сервер,
		|	ЕЭ_НастройкиОбменаСрезПоследних.Порт КАК Порт,
		|	ЕЭ_НастройкиОбменаСрезПоследних.Логин КАК Логин,
		|	ЕЭ_НастройкиОбменаСрезПоследних.Пароль КАК Пароль
		|ИЗ
		|	РегистрСведений.b2b_НастройкиОбменаЗаявками.СрезПоследних(, Подразделение = &Подразделение) КАК ЕЭ_НастройкиОбменаСрезПоследних";
	
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтруктураДанных = Новый Структура("Сервер,Порт, Логин,Пароль"); 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураДанных,ВыборкаДетальныеЗаписи); 
	КонецЦикла;
	
	Возврат СтруктураДанных; 

КонецФункции // ПолучитьПараметрыСоединения()

Функция ПолучитьПараметрыДистрибьютора(Знач Подразделение = неопределено) Экспорт
	
	Если Подразделение = неопределено Тогда
		
		Подразделение = Справочники.Подразделения.НайтиПоКоду("SSP-0001"); 	
		
	КонецЕсли; 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕЭ_НастройкиОбменаСрезПоследних.ИННКонтрагент КАК ИННКонтрагент
		|ИЗ
		|	РегистрСведений.b2b_НастройкиОбменаЗаявками.СрезПоследних(, Подразделение = &Подразделение) КАК ЕЭ_НастройкиОбменаСрезПоследних";
	
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Возврат СокрЛП(ВыборкаДетальныеЗаписи.ИННКонтрагент);  
	КонецЕсли; 
	
	Возврат "00"; 

КонецФункции //

Функция ПолучитьПараметрыМетодаЗагрузкиПунктовДоставки(Знач Подразделение = неопределено)  Экспорт
    Если Подразделение = неопределено Тогда
		
		Подразделение = Справочники.Подразделения.НайтиПоКоду("SSP-0001"); 	
		
	КонецЕсли; 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕЭ_НастройкиОбменаСрезПоследних.КлючАвторизации КАК КлючАвторизации,
	|	ЕЭ_НастройкиОбменаСрезПоследних.СервисЗагрузкиПунктовДоставки КАК СервисЗагрузкиПунктовДоставки,
	|	ЕЭ_НастройкиОбменаСрезПоследних.IDПользователяНаСайте КАК IDПользователяНаСайте,
	|	ЕЭ_НастройкиОбменаСрезПоследних.ПунктДоставкиПоУмолчанию КАК ПунктДоставкиПоУмолчанию,
	|	ЕЭ_НастройкиОбменаСрезПоследних.КонтрагентПоУмолчанию КАК КонтрагентПоУмолчанию,
	|	ЕЭ_НастройкиОбменаСрезПоследних.ХранитьПодробностиЛогирования КАК ХранитьПодробностиЛогирования
	|ИЗ
	|	РегистрСведений.b2b_НастройкиОбменаЗаявками.СрезПоследних(, Подразделение = &Подразделение) КАК ЕЭ_НастройкиОбменаСрезПоследних";
	
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтруктураДанных = Новый Структура("КлючАвторизации,СервисЗагрузкиПунктовДоставки,
	|IDПользователяНаСайте,ПунктДоставкиПоУмолчанию,
	|КонтрагентПоУмолчанию,ХранитьПодробностиЛогирования"); 
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураДанных,ВыборкаДетальныеЗаписи); 
	КонецЦикла;
	
	Возврат СтруктураДанных; 


КонецФункции //

Функция ПолучитьПараметрыМетодаВыгрузкиОстатковДистрибьютора(Знач Подразделение = неопределено)  Экспорт
	
	Если Подразделение = неопределено Тогда
		
		Подразделение = Справочники.Подразделения.НайтиПоКоду("SSP-0001"); 	
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕЭ_НастройкиОбменаСрезПоследних.КлючАвторизации КАК КлючАвторизации,
	|	ЕЭ_НастройкиОбменаСрезПоследних.IDПользователяНаСайте КАК IDПользователяНаСайте,
	|	ЕЭ_НастройкиОбменаСрезПоследних.СкладыОстатков КАК СкладыОстатков,
	|	ЕЭ_НастройкиОбменаСрезПоследних.СервисВыгрузкиОстатков КАК СервисВыгрузкиОстатков,
	|	ЕЭ_НастройкиОбменаСрезПоследних.ВыгружатьШтрихКодПоОстаткам КАК ВыгружатьШтрихКодПоОстаткам
	|ИЗ
	|	РегистрСведений.b2b_НастройкиОбменаЗаявками.СрезПоследних(, Подразделение = &Подразделение) КАК ЕЭ_НастройкиОбменаСрезПоследних";
	
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтруктураДанных = Новый Структура("КлючАвторизации,СервисВыгрузкиОстатков,IDПользователяНаСайте,СкладыОстатков,ВыгружатьШтрихКодПоОстаткам"); 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураДанных,ВыборкаДетальныеЗаписи);
		
		СтруктураДанных.СкладыОстатков = ВыборкаДетальныеЗаписи.СкладыОстатков.Получить(); 
		
	КонецЦикла;
	
	Возврат СтруктураДанных; 


КонецФункции //

Функция ПолучитьПараметрыМетодаВыгрузкиОстатковОсновного(Знач Подразделение = неопределено)  Экспорт
	
	Если Подразделение = неопределено Тогда
		
		Подразделение = Справочники.Подразделения.НайтиПоКоду("SSP-0001"); 	
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕЭ_НастройкиОбменаСрезПоследних.КлючАвторизации КАК КлючАвторизации,
	|	ЕЭ_НастройкиОбменаСрезПоследних.СервисВыгрузкиОстатковОсновной КАК СервисВыгрузкиОстатковОсновной,
	|	ЕЭ_НастройкиОбменаСрезПоследних.СкладыОстатковЦО КАК СкладыОстатковЦО
	|ИЗ
	|	РегистрСведений.b2b_НастройкиОбменаЗаявками.СрезПоследних(, Подразделение = &Подразделение) КАК ЕЭ_НастройкиОбменаСрезПоследних";
	
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтруктураДанных = Новый Структура("КлючАвторизации,СервисВыгрузкиОстатковОсновной,СкладыОстатковЦО"); 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураДанных,ВыборкаДетальныеЗаписи);
		
		СтруктураДанных.СкладыОстатковЦО = ВыборкаДетальныеЗаписи.СкладыОстатковЦО.Получить(); 
		
	КонецЦикла;
	
	Возврат СтруктураДанных; 


КонецФункции

#КонецОбласти

#Область КомандыДляОтправкиНаСайт
//здесь у нас будет запрос  с параметрами для загрузки : 
 
	// <Описание процедуры>
	//
	// Параметры:
	//  <Параметр1>  - <Тип.Вид> - <описание параметра>
	//                 <продолжение описания параметра>
	//  <Параметр2>  - <Тип.Вид> - <описание параметра>
	//                 <продолжение описания параметра>
	// в том числе новых, в том числе отработка ответа от клиента и от поставщика 
	
//ВходныеПараметры: СтатусыЗаказов,ДатаСозданияНачало,ДатаСозданияОкончание,
//ДатаОбновленияНачало,ДатаОбновленияОкончание,Пользователь ID клиента,номерЗаявки,ИД заявки 
Процедура ПолучениеДанныхПоЗаказам(Знач ВходныеПараметры,ОбновленныеЗаказы) Экспорт
	
	HTTPСоединение = HTTPСоединение(); 
	Если HTTPСоединение = неопределено Тогда
	
		ЗаписьЖурналаРегистрации("ОшибкаСоединенияОбменЕЭ_GET",УровеньЖурналаРегистрации.Ошибка,,,,); 
	
		Возврат; 
	
	КонецЕсли;
	Если ВходныеПараметры.Свойство("Подразделение") Тогда
		
		Подразделение = ВходныеПараметры.Подразделение; 	
	Иначе 
		Подразделение = Справочники.Подразделения.НайтиПоКоду("SSP-0001"); 
	КонецЕсли;	
	ДанныеДляОтправкиGetЗапроса = ПолучитьПараметрыМетодаЗагрузки(Подразделение); 
	
	Запрос_АПИ_POST 	= Новый HTTPЗапрос(ДанныеДляОтправкиGetЗапроса.СервисЗагрузки);
	Запрос_АПИ_POST.Заголовки.Вставить("Authorization", ДанныеДляОтправкиGetЗапроса.КлючАвторизации);
	
	СтруктураЗапроса = ЗаполнитьСтруктуруДляЗагрузкиЗаказов(ВходныеПараметры);
	
	СтрокаJSON 	= ОтработатьЗаполненнуюСтруктуруОтвета(СтруктураЗапроса);
	Запрос_АПИ_POST.УстановитьТелоИзСтроки(СтрокаJSON);
	
	ИдентификаторЗапроса = Новый УникальныйИдентификатор;
	
	ХранитьПодробностиЛогирования =  ДанныеДляОтправкиGetЗапроса.ХранитьПодробностиЛогирования; 
	
	Попытка
		
		Ответ_АПИ = HTTPСоединение.ОтправитьДляОбработки(Запрос_АПИ_POST);
		//в журнал запишем что отправили и когда, и потом уже ответ		 
		ЗаписатьВЖурналЗапросыНаПолучениеЗаказов(Строка(ИдентификаторЗапроса),СтрокаJSON,ХранитьПодробностиЛогирования); 
		
	Исключение
		
		//записать ошибку в журнал
		Комментарий = "Не удалось отправить get запрос. Ошибка!";
		РезультатДанные = СтруктураРезультат();
		ЗаписатьВЖурналЗапросыНаПолучениеЗаказовРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,Комментарий,истина,ХранитьПодробностиЛогирования);  
		ЗаписатьОшибкуВЖурнал(Строка(ИдентификаторЗапроса),Комментарий);
		
		Возврат; //не подключился 
		
	КонецПопытки; 
	
	//отработка ответа, пока непонятно как отрабатывать, в какой документ загружать данные 
	
	РезультатЧтенияJSON = СтруктураJSONЗапроса(Ответ_АПИ);                                                                                           
	Структура_JSON_Ответ =  РезультатЧтенияJSON.Структура_JSON;

	ТелоСообщения 	= Ответ_АПИ.ПолучитьТелоКакСтроку(); 
	СтрокаОтвета  	= Строка(Ответ_АПИ.КодСостояния) + " " + ТелоСообщения;
	СтрокаJSONОтвета= ТелоСообщения;
	
	ДатаНачалаРаботыВ1С = ДанныеДляОтправкиGetЗапроса.ДатаНачалаРаботыВ1С; 
	
	Если Ответ_АПИ.КодСостояния = 200 Тогда
		//запись в журнал 
		//записать можно id запроса, зарегистрированного на портале в журнал
		Если Структура_JSON_Ответ <> неопределено 
			И Структура_JSON_Ответ.Свойство("data")
			И ТипЗнч(Структура_JSON_Ответ.data) = Тип("Структура")
			И Структура_JSON_Ответ.data.Свойство("orders") 
			И Структура_JSON_Ответ.data.orders.Количество() > 0 Тогда
			
			///КонтрагентПокупатель = ВходныеПараметры.Контрагент;
			ЗаписатьБезЗаказа = Истина; 
			Для каждого СтруктураЗаказа Из Структура_JSON_Ответ.data.orders Цикл
				
				//сначала по ИД заказа , затем доделать и от вида поиска 
				
				ЗаказКлиента = НайтиЗаказКлиента(СтруктураЗаказа);
				ДатаСозданияЗаказа = НачалоДня(ПреобразоватьДату((СтруктураЗаказа.order.dateCreate)));
				
				
				СтатусЗаказа =  СтруктураЗаказа.order.statusId; 
				
				Если Не ЗначениеЗаполнено(ЗаказКлиента) Тогда
					Если ДатаНачалаРаботыВ1С > ДатаСозданияЗаказа
						И СтатусЗаказа <> "ZC" Тогда
												
						Продолжить; 	
					
					КонецЕсли;
					Если НЕ СтруктураЗаказа.order.Свойство("orderedProducts") Тогда
					
						Продолжить; 	
					
					КонецЕсли;
					ЗаказКлиента = СоздатьЗаказКлиента(СтруктураЗаказа);
					Если НЕ ЗначениеЗаполнено(ЗаказКлиента) Тогда
					
						ЗаписатьОшибкуВЖурнал(Строка(ИдентификаторЗапроса),"Не создан заказ по контрагенту " + СтруктураЗаказа.order.user);
						
						Продолжить; 	
					
					КонецЕсли;
					ОбновленныеЗаказы.Добавить(ЗаказКлиента.ссылка);
					ЗаписатьБезЗаказа = Ложь; 
				Иначе 
					 ДатаОбновления = ПреобразоватьДату(СтруктураЗаказа.order.dateUpdate);
					 
					 ДатаОбновленияДозаказа = неопределено; 
					 
					 Если СтруктураЗаказа.Свойство("additionalOrder") Тогда
					 
					 	ДатаОбновленияДозаказа = ПреобразоватьДату(СтруктураЗаказа.additionalOrder.dateUpdate); 
					 
					 КонецЕсли; 			 
					 
					 
					 ДатаОбновленияВ1С = ДатаОбновленияПоЗаказу(ЗаказКлиента);
					 ДатаОбновленияДозаказаВ1С = ДатаОбновленияПоДоЗаказу(ЗаказКлиента);
					 
					 ВернутьИсходноеСостояние = Ложь; 
					 Если ВходныеПараметры.Свойство("ВернутьИсходноеСостояние")
						 И ВходныеПараметры.ВернутьИсходноеСостояние Тогда
						 
						 ВернутьИсходноеСостояние = Истина;  	
						 
					 КонецЕсли;
					 Если ДатаОбновления > ДатаОбновленияВ1С
						  ИЛИ ?(ДатаОбновленияДозаказа = неопределено,Дата(1,1,1),ДатаОбновленияДозаказа) > ДатаОбновленияДозаказаВ1С 
						  ИЛИ ВернутьИсходноеСостояние Тогда
						  
						 НеДобавлятьВРСОбновленные = Ложь; 
						 Если ВходныеПараметры.Свойство("ИзЗаказа")
							 И ВходныеПараметры.ИзЗаказа Тогда
							 
							 НеДобавлятьВРСОбновленные = Истина;  	
							 
						 КонецЕсли;		 
						 ЗаписатьБезЗаказа = Ложь;
						 
						 ОбновитьЗаказКлиента(СтруктураЗаказа,ЗаказКлиента,ОбновленныеЗаказы,НеДобавлятьВРСОбновленные,ВернутьИсходноеСостояние,ИдентификаторЗапроса); 	
						 
					 КонецЕсли;
				 КонецЕсли;
				 
				  
				
				//и еще проверять дату последнего обновления при загрузке, если она совпадает, то не грузить 
				//а вот если есть,то меняем статус дозаказа и заказа   
				РезультатДанные = СтруктураРезультат();
				
				РезультатДанные.ИдентификаторКлиента = Структура_JSON_Ответ.requestId;
				РезультатДанные.Документ = ЗаказКлиента.ссылка;
				РезультатДанные.РезультатJson = Структура_JSON_Ответ;
				
			    ЗаписатьВЖурналЗапросыНаПолучениеЗаказовРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,"",,ХранитьПодробностиЛогирования);
			КонецЦикла;
			
			Если ЗаписатьБезЗаказа Тогда
				
				РезультатДанные = СтруктураРезультат();
				
				РезультатДанные.ИдентификаторКлиента = Структура_JSON_Ответ.requestId;
				РезультатДанные.Документ = неопределено;
				РезультатДанные.РезультатJson = Структура_JSON_Ответ;
				
				ЗаписатьВЖурналЗапросыНаПолучениеЗаказовРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,"",,ХранитьПодробностиЛогирования);	
				
			КонецЕсли;
			//Отправить запрос на обновление статуса
			Для каждого ЗаказОбновить Из ОбновленныеЗаказы  Цикл
				
				ПараметрыДляОтправки = ФормированиеСтруктурыОтветОбновленныеЗаказы(ЗаказОбновить,Подразделение); 
				
				b2b_ОбменЗаявками.ОтправкаСтатусаЗаказа(ПараметрыДляОтправки,ЛОЖЬ,Истина); 	
				
			КонецЦикла;
		Иначе
			РезультатДанные = СтруктураРезультат(); 
			РезультатДанные.РезультатJson = Структура_JSON_Ответ;
			ЗаписатьВЖурналЗапросыНаПолучениеЗаказовРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,"Не найдены заказы по запросу",,ХранитьПодробностиЛогирования);
		КонецЕсли;
	Иначе
		
		КодОшибки = Ответ_АПИ.КодСостояния;
		
		Если КодОшибки = 400 Тогда   		
			
			ИнформацияОбОшибке = Структура_JSON_Ответ.Message;
			
		ИначеЕсли КодОшибки = 401 Тогда
			
			ИнформацияОбОшибке = "Авторизация не пройдена"; 
		Иначе 
			
			ИнформацияОбОшибке = "Ошибка сервера";
		КонецЕсли;
		
		Комментарий = Строка(КодОшибки) + ":" + ИнформацияОбОшибке; 
		
		РезультатДанные = СтруктураРезультат(); 
		РезультатДанные.РезультатJson = ТелоСообщения; 
		
		ЗаписатьВЖурналЗапросыНаПолучениеЗаказовРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,Комментарий,истина,ХранитьПодробностиЛогирования);
		
	КонецЕсли; 
	
	
	
КонецПроцедуры

Функция ФормированиеСтруктурыОтветОбновленныеЗаказы(Знач ЗаказОбновить,Подразделение)
	
	//Перем МассивДанных, ПараметрыДляОтправки, СтруктураТовара, ТоварЗаказа;
	
	ПараметрыДляОтправки = Новый Структура; 
	ПараметрыДляОтправки.Вставить("НомерЗаявки",ЗаказОбновить.НомерЗаказа);
	ПараметрыДляОтправки.Вставить("IDЗаявки",ЗаказОбновить.ИдЗаказа);
	ПараметрыДляОтправки.Вставить("СтатусЗаказа","ZN");
	ПараметрыДляОтправки.Вставить("Заказ",ЗаказОбновить.ссылка);
	ПараметрыДляОтправки.Вставить("ТипЗапроса","ОтправкаСтатусаНаПортал");
	ПараметрыДляОтправки.Вставить("Подразделение",Подразделение);
	
	МассивДанных = Новый Массив; 
	Для каждого ТоварЗаказа  Из ЗаказОбновить.Товары Цикл
		
		СтруктураТовара = Новый Структура; 
		СтруктураТовара.Вставить("IDТовара",ПолучитьКодТовараДляПортала(ТоварЗаказа.Номенклатура));
		СтруктураТовара.Вставить("Количество",ТоварЗаказа.Количество);
		СтруктураТовара.Вставить("Цена",ТоварЗаказа.Цена);
		
		МассивДанных.Добавить(СтруктураТовара);	
		
	КонецЦикла;
	ПараметрыДляОтправки.Вставить("Товары",МассивДанных);
	Возврат ПараметрыДляОтправки;

КонецФункции


// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ДатаОбновленияПоЗаказу(Знач Заказ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	b2b_ЗаявкиКлиентовСрезПоследних.ДатаОбновления КАК ДатаОбновления
		|ИЗ
		|	РегистрСведений.b2b_ЗаявкиКлиентов КАК b2b_ЗаявкиКлиентовСрезПоследних
		|ГДЕ
		|	b2b_ЗаявкиКлиентовСрезПоследних.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	
		Возврат ВыборкаДетальныеЗаписи.ДатаОбновления; 	
	
	КонецЕсли;
	
	Возврат Заказ.Дата; 


КонецФункции // ДатаОбновленияПоЗаказу()

Функция ДатаОбновленияПоДоЗаказу(Знач Заказ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	b2b_ЗаявкиКлиентовСрезПоследних.ДатаОбновленияДозаказа КАК ДатаОбновления
		|ИЗ
		|	РегистрСведений.b2b_ЗаявкиКлиентов КАК b2b_ЗаявкиКлиентовСрезПоследних
		|ГДЕ
		|	b2b_ЗаявкиКлиентовСрезПоследних.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	
		Возврат ВыборкаДетальныеЗаписи.ДатаОбновления; 	
	
	КонецЕсли;
	
	Возврат Заказ.Дата; 


КонецФункции //


// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция СтруктураРезультат()

	Возврат Новый Структура("Документ,РезультатJson,ИдентификаторКлиента"); 

КонецФункции // СтруктураРезультат()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПреобразоватьДату(ДатаССайта)
	
	Если Не ЗначениеЗаполнено(ДатаССайта) Тогда
	
		Возврат Дата(1,1,1); 
	
	КонецЕсли;
	
	ДатаССайта = СтрЗаменить(ДатаССайта,".",""); 
	ДатаССайта = СтрЗаменить(ДатаССайта,",","");
	ДатаССайта = СтрЗаменить(ДатаССайта," ","");
	ДатаССайта = СтрЗаменить(ДатаССайта,":","");
	
	Год = Сред(ДатаССайта,5,4); 
	Число = Лев(ДатаССайта,2); 
	Месяц = Сред(ДатаССайта,3,2);
	
	Время = Сред(ДатаССайта,9,6); 
	
	
	Возврат Дата(Год + Месяц + Число + Время); 

КонецФункции // ПробразоватьДату()


Функция НайтиЗаказКлиента(Знач СтруктураЗаказа)
	
	ИДЗаказа 	= СтруктураЗаказа.order.bxId; 
	НомерЗаказа =  СтруктураЗаказа.order.accountNumber;
	ДатаЗаказа =  СтруктураЗаказа.order.dateCreate;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Заказ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Заказ КАК Заказ
	|ГДЕ
	|	НЕ Заказ.ПометкаУдаления
	|	И (Заказ.НомерЗаказа = &Номер
	|				И НАЧАЛОПЕРИОДА(Заказ.ДатаЗаказа, ДЕНЬ) = &ДатаСоздания
	|			ИЛИ Заказ.ИдЗаказа = &ИдЗаказа)
	|	И НЕ Заказ.b2b_Дозаказ"; 
		
	Запрос.УстановитьПараметр("ДатаСоздания", НачалоДня(ПреобразоватьДату((ДатаЗаказа))));
	Запрос.УстановитьПараметр("ИдЗаказа", ИдЗаказа);
	Запрос.УстановитьПараметр("Номер", НомерЗаказа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ссылка; 
	Иначе
		Возврат Неопределено; 
	КонецЕсли;

КонецФункции

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция СоздатьЗаказКлиента(ДанныеАпи)
	
	ЗаказКлиентаНовый = Документы.Заказ.СоздатьДокумент(); 
	ЗаказКлиентаНовый.Дата =  ТекущаяДатаСеанса();
	ЗаказКлиентаНовый.ИдЗаказа =  ДанныеАпи.order.bxId;
	ЗаказКлиентаНовый.НомерЗаказа =  ДанныеАпи.order.accountNumber;
	ЗаказКлиентаНовый.ДатаЗаказа =  ПреобразоватьДату(ДанныеАпи.order.dateCreate);
	ЗаказКлиентаНовый.ДатаОформления =  ТекущаяДатаСеанса();
	ЗаказКлиентаНовый.ИсточникЗаказа =  Перечисления.ИсточникЗаказа.Сайт; 
	 
	
	СтатусЗаказа_b2b = Перечисления.b2b_СтатусыЗаказов.ЖдетПодтвержденияДистрибьютором; //новый заказ формируется как ЖдетПодтвержденияДистрибьютором 
	//если  новый заказ, а его статус другой.. как ошибку возможно записать 
	МетодДоставки  =  ДанныеАпи.order.shipmentMethod;
	ДатаОбновления =  ПреобразоватьДату(ДанныеАпи.order.dateUpdate);
	
	ЗаказКлиентаНовый.Автор = ПараметрыСеанса.Пользователь; 
	 
	Контрагент = НайтиКонтрагентаПоСивольномуКоду(ДанныеАпи.order.user); 
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		
		ЗаписатьОшибкуВЖурнал(Строка(Новый УникальныйИдентификатор),"Не найден контрагент " + ДанныеАпи.order.user);
		Возврат неопределено; 	
	
	КонецЕсли;
	ЗаказКлиентаНовый.Контрагент = ?(ЗначениеЗаполнено(Контрагент),Контрагент,Справочники.Контрагенты.ПустаяСсылка());
	
	ЗаказКлиентаНовый.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.ВРаботе;
	ЗаказКлиентаНовый.СостояниеСогласования = Перечисления.СостоянияСогласования.НаСогласованииЦО; 	 
	
	ЗаказКлиентаНовый.ИБ=Справочники.ИБ.НайтиПоКоду("SMN");
	
	ЗаказКлиентаНовый.ВидОплаты=перечисления.ВидыОплаты.БН; //++-++
	ЗаказКлиентаНовый.КодОперации=перечисления.КодыОперацийОстатки.Реализация;
	// Смирнов М.Ю. 17.07.2025 начало
	ИмяИБ = НСтр(СтрокаСоединенияИнформационнойБазы(), "Ref"); 
	Если ИмяИБ = "ekf" Тогда
		//++Данилова Е.В. 14.08.2025 HELP-6540
		//ЗаказКлиентаНовый.Склад = Справочники.Склады.НайтиПоКоду("STЕ-18");
		ЗаказКлиентаНовый.Склад = Справочники.Склады.НайтиПоКоду("STD-99");
		//--Данилова Е.В. 14.08.2025
	Иначе
		//ЗаказКлиентаНовый.Склад = Справочники.Склады.НайтиПоКоду("SSW-53"); //ЗаказКлиентаНовый.Контрагент.ОсновнойСкладОтгрузки; // 
		ЗаказКлиентаНовый.Склад = Справочники.Склады.НайтиПоКоду("STC-60");
	КонецЕсли;
	// Смирнов М.Ю. 17.07.2025 конец 
	
	//++Данилова Е.В. 09.10.2025  HELP-7391 
	Если ЗаказКлиентаНовый.Контрагент.РаботаСМаркированнымТоваромПодтверждена Тогда
		
		ЗаказКлиентаНовый.СкладМаркировки = ОбщегоНазначения_ПИ.ПолучитьЗначениеРСРеквизитыСправочников(ПараметрыСеанса.ЭтотУзел.Подразделение,"ОсновнойСкладОтгрузкиДОПЧЗ"); 		
		
	КонецЕсли; 
	//--Данилова Е.В. 09.10.2025
	ЗаказКлиентаНовый.Валюта = Справочники.Валюты.НайтиПоКоду("810");
	ЗаказКлиентаНовый.Менеджер =  Контрагент.Менеджер;
	ЗаказКлиентаНовый.Договор = Контрагент.ОсновнойДоговор; 
	
	ЗаказКлиентаНовый.ПунктДоставки  = Контрагент.ОсновнойПунктДоставки; 
	
	ЗаказКлиентаНовый.ОтсрочкаПлатежа = ЗаказКлиентаНовый.Договор.ОтсрочкаПлатежа; 
	ЗаказКлиентаНовый.Курс = 1; 
	ЗаказКлиентаНовый.Организация =ЗаказКлиентаНовый.Договор.Организация;
	//++Данилова Е.В. 29.09.2025 HELP-7048
	//ЗаказКлиентаНовый.Подразделение = Контрагент.Менеджер.Подразделение;
	ЗаказКлиентаНовый.Подразделение = ЗаполнениеДокументов.ПодразделениеПродажПоМенеджеру(Контрагент.Менеджер);
	//--Данилова Е.В. 29.09.2025
	ЗаказКлиентаНовый.Отгружен = Перечисления.Отгружен.Резерв;
	
	ЗаказКлиентаНовый.ТипСкидок = Контрагент.ТипСкидок;
	ЗаказКлиентаНовый.ТипЦенРаспродажа = Контрагент.ТипЦенРаспродажа;
	ЗаказКлиентаНовый.ТипЦен = Контрагент.ТипЦен;
	
	ПунктДоставки = ЗаказКлиентаНовый.ПунктДоставки; 
	Если ЗначениеЗаполнено(ПунктДоставки.ТипЦен) Тогда
		
		ЗаказКлиентаНовый.ТипЦен = ПунктДоставки.ТипЦен;		
		
	КонецЕсли; 
	Если ЗначениеЗаполнено(ПунктДоставки.ТипСкидок) Тогда
		
		ЗаказКлиентаНовый.ТипСкидок = ПунктДоставки.ТипСкидок;		
		
	КонецЕсли;
	Если ПунктДоставки.Скидка <> 0 Тогда
		
		ЗаказКлиентаНовый.Скидка = ПунктДоставки.Скидка;		
		
	КонецЕсли;

	
	
	КомментарийПоОтгрузкеТовара = "Желаемая дата отгрузки:" + Формат(ПреобразоватьДату(ДанныеАпи.order.orderedShipmentDate),"ДЛФ=D"); 
	КомментарийПоОтгрузкеТовара = ДанныеАпи.order.comment + Символы.ПС + КомментарийПоОтгрузкеТовара;
	
	АдресДоставки =  ДанныеАпи.order.deliveryAddressStr;
	
	КомментарийПоОтгрузкеТовара = КомментарийПоОтгрузкеТовара + " Адрес доставки:" +  АдресДоставки; 
	                
	ЗаказКлиентаНовый.ДатаОтгрузки = ПреобразоватьДату(ДанныеАпи.order.orderedShipmentDate);
	//Валетов + 30.06.2026 Изменение 0000000060
	//ЗаказКлиентаНовый.ДатаОплаты = ПолучитьДатуОплаты_b2b(ЗаказКлиентаНовый.ДатаОтгрузки,ЗаказКлиентаНовый.ОтсрочкаПлатежа);
	ПараметрыРасчетаДатыОплаты 		= ОбщегоНазначенияКС.ПолучитьЗаполнитьПараметрыРасчетаДатыОплатыПоДокументу(ЗаказКлиентаНовый);
	ЗаказКлиентаНовый.ДатаОплаты 	= ОбщегоНазначенияКС.ПолучитьДатуОплатыПоДокументуКлиентСервер(ПараметрыРасчетаДатыОплаты); 
	//Валетов-
	
	Для каждого ДанныеПоТовару Из ДанныеАпи.order.orderedProducts Цикл
	
		 Номенклатура = НайтиТоварПоКодуТовара(ДанныеПоТовару.xmlId);
		 
		 Если  НЕ ЗначениеЗаполнено(Номенклатура) Тогда
			 
			 Продолжить; 
			 
		 КонецЕсли;
		 
		 НовыйТовар = ЗаказКлиентаНовый.Товары.Добавить(); 
		 НовыйТовар.Номенклатура 	= Номенклатура; 
		 НовыйТовар.Количество 		= ДанныеПоТовару.quantity; 
		 НовыйТовар.Единица 		= НайтиЕдиницуТовараПоБазовой(НовыйТовар.Номенклатура.БазоваяЕдиница,Номенклатура); 
		 НовыйТовар.Цена 			= ДанныеПоТовару.price; 
		 НовыйТовар.ЦенаИсточник	= ДанныеПоТовару.price;
		 НовыйТовар.ЦенаБезСкидки 	= ДанныеПоТовару.price;
		 НовыйТовар.СтавкаНДС       = ПолучитьСтавкуНДС_(Номенклатура); //.Родитель.СтавкаНДС; //Перечисления.СтавкиНДС.НДС20;
		 НовыйТовар.Заявка 		= ДанныеПоТовару.quantity;
		 НовыйТовар.ПодтвержденнаяЗаявка =  ДанныеПоТовару.quantity;
		 
		 ЗаполнитьЦенуНоменклатурыТабЧасти_(НовыйТовар,ЗаказКлиентаНовый); 
		 
		 РассчитатьСуммуТабЧасти_(НовыйТовар,ЗаказКлиентаНовый); 
		 
		 //НовыйТовар.Сумма = НовыйТовар.Цена * НовыйТовар.Количество;
		 //
		 //НовыйТовар.Всего = НовыйТовар.Сумма;
		 //НовыйТовар.ВсегоБезСкидки = НовыйТовар.Сумма;
		 
	 КонецЦикла;
	
   ЗаказКлиентаНовый.Комментарий = КомментарийПоОтгрузкеТовара;
   
   ПрефиксИБ = ЗаказКлиентаНовый.Склад.ПрефиксИБ;
   
   Если НЕ ЗначениеЗаполнено(ПрефиксИБ) Тогда
	   
	   ПрефиксИБ = ЗаказКлиентаНовый.ИБ.Код;			
	   
   КонецЕсли; 
   
   ЭтотУзел = ПараметрыСеанса.ЭтотУзел; 
   
   КодИБ = ?(ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение,ПрефиксИБ,ЭтотУзел.Код);
   
   ЗаказКлиентаНовый.УстановитьНовыйНомер(КодИБ+"-"); 
   
   Попытка
	   
	   ЗаказКлиентаНовый.ДополнительныеСвойства.Вставить("Этоb2bЗаказ", Истина);
	   ЗаказКлиентаНовый.Записать(РежимЗаписиДокумента.Проведение); 
	   
	   ЗаписатьДанныеВРСПриСозданииНовогоЗаказа(ДатаОбновления, ЗаказКлиентаНовый, МетодДоставки, СтатусЗаказа_b2b);
 
	   
	   Возврат ЗаказКлиентаНовый.Ссылка;
	   
   Исключение
	   ЗаказКлиентаНовый.Записать(РежимЗаписиДокумента.Запись); 
	   
	   //ПараметрыДлязаписи = Новый Структура; 
	   //ПараметрыДлязаписи.Вставить("СтатусЗаказа_b2b",СтатусЗаказа_b2b);
	   //ПараметрыДлязаписи.Вставить("МетодДоставки",МетодДоставки);
	   //ПараметрыДлязаписи.Вставить("ДатаОбновления",ДатаОбновления);
	   //
	   //ПараметрыДлязаписи.Вставить("ПлановаяДатаОтгрузки",ЗаказКлиентаНовый.ДатаОтгрузки);
	   //
	   //ЗаписатьДополнительныеДанныеВРегистрЗаказов(ЗаказКлиентаНовый.Ссылка,ПараметрыДлязаписи); 
	   //
	   //ЗаписатьВРегистрОбновленныеЗаказы(ЗаказКлиентаНовый.Ссылка,ТекущаяДатаСеанса());
	   ЗаписатьДанныеВРСПриСозданииНовогоЗаказа(ДатаОбновления, ЗаказКлиентаНовый, МетодДоставки, СтатусЗаказа_b2b);
	   
	   Возврат ЗаказКлиентаНовый.Ссылка;
	   
   КонецПопытки;
   
    
   
КонецФункции

Процедура ЗаписатьДанныеВРСПриСозданииНовогоЗаказа(Знач ДатаОбновления, Знач ЗаказКлиентаНовый, Знач МетодДоставки, Знач СтатусЗаказа_b2b)
	
	Перем ПараметрыДлязаписи;
	
	ПараметрыДлязаписи = Новый Структура; 
	ПараметрыДлязаписи.Вставить("СтатусЗаказа_b2b",СтатусЗаказа_b2b);
	ПараметрыДлязаписи.Вставить("МетодДоставки",МетодДоставки);
	ПараметрыДлязаписи.Вставить("ДатаОбновления",ДатаОбновления);
	ПараметрыДлязаписи.Вставить("ПлановаяДатаОтгрузки",ЗаказКлиентаНовый.ДатаОтгрузки);
	
	ЗаписатьДополнительныеДанныеВРегистрЗаказов(ЗаказКлиентаНовый.Ссылка,ПараметрыДлязаписи); 
	
	ЗаписатьВРегистрОбновленныеЗаказы(ЗаказКлиентаНовый.Ссылка,ТекущаяДатаСеанса());

КонецПроцедуры // СоздатьЗаказКлиента()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция НайтиКонтрагентаПоСивольномуКоду(Знач КодВторичногоКонтрагентаДляB2B) экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	НЕ Контрагенты.ПометкаУдаления
		|	И Контрагенты.КодВторичногоКонтрагентаДляB2B = &КодВторичногоКонтрагентаДляB2B";
	
	Запрос.УстановитьПараметр("КодВторичногоКонтрагентаДляB2B", КодВторичногоКонтрагентаДляB2B);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	
		Возврат ВыборкаДетальныеЗаписи.ссылка; 	
	
	КонецЕсли;
	
	Возврат Справочники.Контрагенты.ПустаяСсылка(); 

КонецФункции // НайтиКонтрагентаПоСивольномуКоду()


// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ЗаписатьДополнительныеДанныеВРегистрЗаказов(Заказ,ПараметрыДляЗаписи) Экспорт 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	b2b_ЗаявкиКлиентов.МетодДоставки КАК МетодДоставки,
	|	b2b_ЗаявкиКлиентов.ДатаОбновления КАК ДатаОбновления,
	|	b2b_ЗаявкиКлиентов.ПлановаяДатаОтгрузки КАК ПлановаяДатаОтгрузки,
	|	b2b_ЗаявкиКлиентов.СтатусЗаказа_b2b КАК СтатусЗаказа_b2b,
	|	b2b_ЗаявкиКлиентов.ПричинаОтменыЗаявки КАК ПричинаОтменыЗаявки,
	|	b2b_ЗаявкиКлиентов.ПричинаОтменыОтгрузкиЗаказа КАК ПричинаОтменыОтгрузкиЗаказа,
	|	b2b_ЗаявкиКлиентов.ПричинаОтменыОтгрузкиДозаказа КАК ПричинаОтменыОтгрузкиДозаказа,
	|	b2b_ЗаявкиКлиентов.ДатаОбновленияДозаказа КАК ДатаОбновленияДозаказа,
	|	b2b_ЗаявкиКлиентов.Отгружен КАК Отгружен
	|ИЗ
	|	РегистрСведений.b2b_ЗаявкиКлиентов КАК b2b_ЗаявкиКлиентов
	|ГДЕ
	|	b2b_ЗаявкиКлиентов.Заказ = &Заказ";
	
	Если ПараметрыДляЗаписи.Свойство("ОсновнойЗаказ") Тогда
		
		Запрос.УстановитьПараметр("Заказ", ПараметрыДляЗаписи.ОсновнойЗаказ);
	Иначе
		Запрос.УстановитьПараметр("Заказ", Заказ);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	ВыборкаДетальныеЗаписи.Следующий(); 
	
	
	Если ПараметрыДляЗаписи.Свойство("ВспомогательныеРеквизиты") 
		И ПараметрыДляЗаписи.ВспомогательныеРеквизиты Тогда
		
		
		НаборЗаписей = РегистрыСведений.b2b_ЗаявкиКлиентов.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Заказ.Установить(Заказ); 
		НаборЗаписей.Прочитать();
		
		Для каждого МенеджерЗаписи Из НаборЗаписей  Цикл
			
			Если ПараметрыДляЗаписи.Свойство("МетодДоставки")
				И ЗначениеЗаполнено(ПараметрыДляЗаписи.МетодДоставки) Тогда
				
				МенеджерЗаписи.МетодДоставки = ПараметрыДляЗаписи.МетодДоставки; 
				
			КонецЕсли;
			//
			Если ПараметрыДляЗаписи.Свойство("ПричинаОтменыЗаявки") Тогда
				
				МенеджерЗаписи.ПричинаОтменыЗаявки = ПараметрыДляЗаписи.ПричинаОтменыЗаявки;
				
			КонецЕсли;
			
			Если ПараметрыДляЗаписи.Свойство("ПричинаОтменыОтгрузкиЗаказа") Тогда
				
				МенеджерЗаписи.ПричинаОтменыОтгрузкиЗаказа = ПараметрыДляЗаписи.ПричинаОтменыОтгрузкиЗаказа;
				
			КонецЕсли;
			
			Если ПараметрыДляЗаписи.Свойство("ПричинаОтменыОтгрузкиДозаказа") Тогда
				
				МенеджерЗаписи.ПричинаОтменыОтгрузкиДозаказа = ПараметрыДляЗаписи.ПричинаОтменыОтгрузкиДозаказа;
				
			КонецЕсли;
			
			
			Если ПараметрыДляЗаписи.Свойство("ПлановаяДатаОтгрузки") Тогда
				
				МенеджерЗаписи.ПлановаяДатаОтгрузки = ПараметрыДляЗаписи.ПлановаяДатаОтгрузки; 
				
			КонецЕсли;
			
			Если 
				ПараметрыДляЗаписи.Свойство("СтатусЗаказа_b2b")
				И ЗначениеЗаполнено(ПараметрыДляЗаписи.СтатусЗаказа_b2b) Тогда
				МенеджерЗаписи.СтатусЗаказа_b2b = ПараметрыДляЗаписи.СтатусЗаказа_b2b;
			КонецЕсли;
			
			Если ПараметрыДляЗаписи.Свойство("ДатаОбновления")
				И ЗначениеЗаполнено(ПараметрыДляЗаписи.ДатаОбновления) Тогда
				МенеджерЗаписи.ДатаОбновления = ПараметрыДляЗаписи.ДатаОбновления;
			КонецЕсли;
			
			Если ПараметрыДляЗаписи.Свойство("Отгружен")
				И ЗначениеЗаполнено(ПараметрыДляЗаписи.Отгружен) Тогда
				МенеджерЗаписи.Отгружен = ПараметрыДляЗаписи.Отгружен;
			КонецЕсли;
			
			
			
		КонецЦикла;
		
		Попытка
			
			НаборЗаписей.Записать(); 
			
		Исключение
			Сообщить(ОписаниеОшибки()); 
		КонецПопытки;
		
		
		
	Иначе  
		
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	b2b_ЗаявкиКлиентов.МетодДоставки КАК МетодДоставки,
		//|	b2b_ЗаявкиКлиентов.ДатаОбновления КАК ДатаОбновления,
		//|	b2b_ЗаявкиКлиентов.ПлановаяДатаОтгрузки КАК ПлановаяДатаОтгрузки,
		//|	b2b_ЗаявкиКлиентов.СтатусЗаказа_b2b КАК СтатусЗаказа_b2b
		//|ИЗ
		//|	РегистрСведений.b2b_ЗаявкиКлиентов КАК b2b_ЗаявкиКлиентов
		//|ГДЕ
		//|	b2b_ЗаявкиКлиентов.Заказ = &Заказ";
		//
		//Если ПараметрыДляЗаписи.Свойство("ОсновнойЗаказ") Тогда
		//	
		//	Запрос.УстановитьПараметр("Заказ", ПараметрыДляЗаписи.ОсновнойЗаказ);
		//Иначе
		//	Запрос.УстановитьПараметр("Заказ", Заказ);
		//КонецЕсли;
		//
		//РезультатЗапроса = Запрос.Выполнить();
		//
		//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
		//ВыборкаДетальныеЗаписи.Следующий(); 
		
		//Если ПараметрыДляЗаписи.Свойство("ОсновнойЗаказ") Тогда
		//	
		//	ОсновнойЗаказ = ПараметрыДляЗаписи.ОсновнойЗаказ;
		//	//ТаблицаДанных = РегистрыСведений.b2b_ЗаявкиКлиентов.СрезПоследних(,Новый Структура("Заказ",ОсновнойЗаказ));
		//	ВыборкаДанныхПоЗаказу = РегистрыСведений.b2b_ЗаявкиКлиентов.Выбрать(Новый Структура("Заказ",ОсновнойЗаказ));
		//	//ОтборПоЗаказу = ОсновнойЗаказ; 
		//Иначе
		//	ВыборкаДанныхПоЗаказу = РегистрыСведений.b2b_ЗаявкиКлиентов.Выбрать(Новый Структура("Заказ",Заказ));
		//	//ОтборПоЗаказу = ОсновнойЗаказ;
		//КонецЕсли;
		
		Если ПараметрыДляЗаписи.Свойство("СоответствиеТоварКоличествоРезерв") Тогда
			
			СоответствиеТоварКоличествоРезерв = ПараметрыДляЗаписи.СоответствиеТоварКоличествоРезерв; 	
		Иначе 
			СоответствиеТоварКоличествоРезерв= Новый Соответствие; 
		КонецЕсли;
		
		Если ПараметрыДляЗаписи.Свойство("СоответствиеТоварЦенаСкидка") Тогда
		
			 СоответствиеТоварЦенаСкидка =  ПараметрыДляЗаписи.СоответствиеТоварЦенаСкидка; 
		 Иначе 
			 СоответствиеТоварЦенаСкидка = Новый Соответствие; 
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.b2b_ЗаявкиКлиентов.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Заказ.Установить(Заказ); 
		НаборЗаписей.Записать(); 
		
		Для каждого ТоварЗаказа Из Заказ.Товары  Цикл
			
			МенеджерЗаписи = РегистрыСведений.b2b_ЗаявкиКлиентов.СоздатьМенеджерЗаписи();
			
			//Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
			
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи,ВыборкаДетальныеЗаписи); 
			
			//КонецЕсли;
			
			МенеджерЗаписи.Заказ = Заказ;
			МенеджерЗаписи.Количество = ТоварЗаказа.Количество;
			
			КоличествоРезерв = СоответствиеТоварКоличествоРезерв.Получить( ТоварЗаказа.Номенклатура); 
			Если КоличествоРезерв = неопределено Тогда
				
				МенеджерЗаписи.КоличествоРезерв = ТоварЗаказа.Количество;	
			Иначе 
				МенеджерЗаписи.КоличествоРезерв = КоличествоРезерв;
			КонецЕсли;
			
			ЦенаСкидкаСтруктура = СоответствиеТоварЦенаСкидка.Получить(ТоварЗаказа.Номенклатура); 
			Если ЦенаСкидкаСтруктура = неопределено Тогда
				
				МенеджерЗаписи.Цена = ТоварЗаказа.Цена;
				МенеджерЗаписи.ЦенаБезСкидки = ТоварЗаказа.ЦенаБезСкидки;
				МенеджерЗаписи.Скидка = ТоварЗаказа.Скидка;
				МенеджерЗаписи.СкидкаНаНакладную = Заказ.Скидка;
				МенеджерЗаписи.ДопСкидкаНаНакладную = Заказ.ДопСкидкаНаНакладную;
			Иначе 
				МенеджерЗаписи.Цена = ЦенаСкидкаСтруктура.Цена;
				МенеджерЗаписи.ЦенаБезСкидки = ЦенаСкидкаСтруктура.ЦенаБезСкидки;
				МенеджерЗаписи.Скидка = ЦенаСкидкаСтруктура.Скидка;
				МенеджерЗаписи.СкидкаНаНакладную = ЦенаСкидкаСтруктура.СкидкаНаНакладную;
				МенеджерЗаписи.ДопСкидкаНаНакладную = ЦенаСкидкаСтруктура.ДопСкидкаНаНакладную;

			КонецЕсли;
			
			Если ПараметрыДляЗаписи.Свойство("МетодДоставки")
				И ЗначениеЗаполнено(ПараметрыДляЗаписи.МетодДоставки) Тогда
				
				МенеджерЗаписи.МетодДоставки = ПараметрыДляЗаписи.МетодДоставки; 
				
			КонецЕсли;                                                               
			//
			Если ПараметрыДляЗаписи.Свойство("ПричинаОтменыЗаявки") Тогда
				
				МенеджерЗаписи.ПричинаОтменыЗаявки = ПараметрыДляЗаписи.ПричинаОтменыЗаявки;
				
			КонецЕсли;
			
			Если ПараметрыДляЗаписи.Свойство("ПричинаОтменыОтгрузкиЗаказа") Тогда
				
				МенеджерЗаписи.ПричинаОтменыОтгрузкиЗаказа = ПараметрыДляЗаписи.ПричинаОтменыОтгрузкиЗаказа;
				
			КонецЕсли;
			
			Если ПараметрыДляЗаписи.Свойство("ПричинаОтменыОтгрузкиДозаказа") Тогда
				
				МенеджерЗаписи.ПричинаОтменыОтгрузкиДозаказа = ПараметрыДляЗаписи.ПричинаОтменыОтгрузкиДозаказа;
				
			КонецЕсли;
			
			
			Если ПараметрыДляЗаписи.Свойство("ПлановаяДатаОтгрузки") Тогда
				
				МенеджерЗаписи.ПлановаяДатаОтгрузки = ПараметрыДляЗаписи.ПлановаяДатаОтгрузки; 
				
			КонецЕсли;
			
			Если 
				ПараметрыДляЗаписи.Свойство("СтатусЗаказа_b2b")
				И ЗначениеЗаполнено(ПараметрыДляЗаписи.СтатусЗаказа_b2b) Тогда
				МенеджерЗаписи.СтатусЗаказа_b2b = ПараметрыДляЗаписи.СтатусЗаказа_b2b;
			КонецЕсли;
			
			Если ПараметрыДляЗаписи.Свойство("ДатаОбновления")
				И ЗначениеЗаполнено(ПараметрыДляЗаписи.ДатаОбновления) Тогда
				МенеджерЗаписи.ДатаОбновления = ПараметрыДляЗаписи.ДатаОбновления;
			КонецЕсли;
			
			Если ПараметрыДляЗаписи.Свойство("ДатаОбновленияДозаказа")
				И ЗначениеЗаполнено(ПараметрыДляЗаписи.ДатаОбновленияДозаказа) Тогда
				МенеджерЗаписи.ДатаОбновленияДозаказа = ПараметрыДляЗаписи.ДатаОбновленияДозаказа;
			КонецЕсли;
			
			Если ПараметрыДляЗаписи.Свойство("Отгружен")
				И ЗначениеЗаполнено(ПараметрыДляЗаписи.Отгружен) Тогда
				МенеджерЗаписи.Отгружен = ПараметрыДляЗаписи.Отгружен;
			КонецЕсли;

			
			МенеджерЗаписи.Номенклатура = ТоварЗаказа.Номенклатура; 
			
			Попытка
				
				МенеджерЗаписи.Записать(); 
				
			Исключение
				Сообщить(ОписаниеОшибки()); 
			КонецПопытки;
			
			
		КонецЦикла;
		
	Конецесли; 
	
	Если Заказ.Товары.Количество() = 0 Тогда //все в дозаказе
		
		МенеджерЗаписи = РегистрыСведений.b2b_ЗаявкиКлиентов.СоздатьМенеджерЗаписи();
		
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,ВыборкаДетальныеЗаписи); 
		МенеджерЗаписи.Заказ = Заказ;
		
		Если ПараметрыДляЗаписи.Свойство("МетодДоставки")
			И ЗначениеЗаполнено(ПараметрыДляЗаписи.МетодДоставки) Тогда
			
			МенеджерЗаписи.МетодДоставки = ПараметрыДляЗаписи.МетодДоставки; 
			
		КонецЕсли;
		//
		Если ПараметрыДляЗаписи.Свойство("ПричинаОтменыЗаявки") Тогда
			
			МенеджерЗаписи.ПричинаОтменыЗаявки = ПараметрыДляЗаписи.ПричинаОтменыЗаявки;
			
		КонецЕсли;
		
		Если ПараметрыДляЗаписи.Свойство("ПричинаОтменыОтгрузкиЗаказа") Тогда
			
			МенеджерЗаписи.ПричинаОтменыОтгрузкиЗаказа = ПараметрыДляЗаписи.ПричинаОтменыОтгрузкиЗаказа;
			
		КонецЕсли;
		
		Если ПараметрыДляЗаписи.Свойство("ПричинаОтменыОтгрузкиДозаказа") Тогда
			
			МенеджерЗаписи.ПричинаОтменыОтгрузкиДозаказа = ПараметрыДляЗаписи.ПричинаОтменыОтгрузкиДозаказа;
			
		КонецЕсли;
		
		
		Если ПараметрыДляЗаписи.Свойство("ПлановаяДатаОтгрузки") Тогда
			
			МенеджерЗаписи.ПлановаяДатаОтгрузки = ПараметрыДляЗаписи.ПлановаяДатаОтгрузки; 
			
		КонецЕсли;
		
		Если 
			ПараметрыДляЗаписи.Свойство("СтатусЗаказа_b2b")
			И ЗначениеЗаполнено(ПараметрыДляЗаписи.СтатусЗаказа_b2b) Тогда
			МенеджерЗаписи.СтатусЗаказа_b2b = ПараметрыДляЗаписи.СтатусЗаказа_b2b;
		КонецЕсли;
		
		Если ПараметрыДляЗаписи.Свойство("ДатаОбновления")
			И ЗначениеЗаполнено(ПараметрыДляЗаписи.ДатаОбновления) Тогда
			МенеджерЗаписи.ДатаОбновления = ПараметрыДляЗаписи.ДатаОбновления;
		КонецЕсли;
		
		Если ПараметрыДляЗаписи.Свойство("ДатаОбновленияДозаказа")
			И ЗначениеЗаполнено(ПараметрыДляЗаписи.ДатаОбновленияДозаказа) Тогда
			МенеджерЗаписи.ДатаОбновленияДозаказа = ПараметрыДляЗаписи.ДатаОбновленияДозаказа;
		КонецЕсли;
		
		Попытка
			
			МенеджерЗаписи.Записать(); 
			
		Исключение
			Сообщить(ОписаниеОшибки()); 
		КонецПопытки;
		
		
		
	КонецЕсли;
	
	ЗаписьСтатуса = ПараметрыДляЗаписи.Свойство("СтатусЗаказа_b2b")
	И ЗначениеЗаполнено(ПараметрыДляЗаписи.СтатусЗаказа_b2b);
	
	ЗаписьМетодаДоставки = ПараметрыДляЗаписи.Свойство("МетодДоставки")
	И ЗначениеЗаполнено(ПараметрыДляЗаписи.МетодДоставки);
	
	ЗаписьПричинаОтменыЗаявки = ПараметрыДляЗаписи.Свойство("ПричинаОтменыЗаявки")
	И ЗначениеЗаполнено(ПараметрыДляЗаписи.ПричинаОтменыЗаявки);
	
	ЗаписьПричинаОтменыОтгрузкиЗаказа = ПараметрыДляЗаписи.Свойство("ПричинаОтменыОтгрузкиЗаказа")
	И ЗначениеЗаполнено(ПараметрыДляЗаписи.ПричинаОтменыОтгрузкиЗаказа);
	
	
	ЗаписьПричинаОтменыОтгрузкиДозаказа = ПараметрыДляЗаписи.Свойство("ПричинаОтменыОтгрузкиДозаказа")
	И ЗначениеЗаполнено(ПараметрыДляЗаписи.ПричинаОтменыОтгрузкиДозаказа);
	
	
	Если  ЗаписьСтатуса 
		ИЛИ ЗаписьМетодаДоставки 
		ИЛИ ЗаписьПричинаОтменыЗаявки 
		ИЛИ ЗаписьПричинаОтменыОтгрузкиЗаказа 
		ИЛИ ЗаписьПричинаОтменыОтгрузкиДозаказа Тогда
		
		
		Дозаказ = НайтиДоЗаказпоОсновному(Заказ); 
		
		Если ЗначениеЗаполнено(Дозаказ)  Тогда
			
			НаборЗаписей = РегистрыСведений.b2b_ЗаявкиКлиентов.СоздатьНаборЗаписей(); 
			НаборЗаписей.Отбор.Заказ.Установить(Дозаказ);
			НаборЗаписей.Прочитать();
			Для каждого Записьнабора Из НаборЗаписей Цикл
				Если ЗаписьСтатуса Тогда
					
					Записьнабора.СтатусЗаказа_b2b = ПараметрыДляЗаписи.СтатусЗаказа_b2b;	
					
				КонецЕсли;
				
				Если  ЗаписьМетодаДоставки Тогда
					
					Записьнабора.МетодДоставки = ПараметрыДляЗаписи.МетодДоставки;	
					
				КонецЕсли;
				
				Если  ЗаписьПричинаОтменыЗаявки Тогда
					
					Записьнабора.ПричинаОтменыЗаявки = ПараметрыДляЗаписи.ПричинаОтменыЗаявки;	
					
				КонецЕсли;
				
				Если  ЗаписьПричинаОтменыОтгрузкиЗаказа Тогда
					
					Записьнабора.ПричинаОтменыОтгрузкиЗаказа = ПараметрыДляЗаписи.ПричинаОтменыОтгрузкиЗаказа;	
					
				КонецЕсли;
				
				
				Если  ЗаписьПричинаОтменыОтгрузкиДозаказа Тогда
					
					Записьнабора.ПричинаОтменыОтгрузкиДозаказа = ПараметрыДляЗаписи.ПричинаОтменыОтгрузкиДозаказа;	
					
				КонецЕсли;
				
				
				
				
			КонецЦикла;
			
			НаборЗаписей.Записать(); 
			
		КонецЕсли;
	КонецЕсли;
	
	
	
	
КонецПроцедуры // ()

Процедура ЗаписатьДополнительныеДанныеВРегистрДоЗаказов(Заказ,ПараметрыДляЗаписи,ОтправленЗапрос) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	b2b_Дозаказы.Комментарий КАК Комментарий,
	|	b2b_Дозаказы.ПРМ КАК ПРМ,
	|	b2b_Дозаказы.СрокПодтвержденияПоДозаказу КАК СрокПодтвержденияПоДозаказу,
	|	b2b_Дозаказы.СтатусДоЗаказа_b2b КАК СтатусДоЗаказа_b2b,
	|	b2b_Дозаказы.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
	|	b2b_Дозаказы.Заказ КАК Заказ,
	|	b2b_Дозаказы.ЗаказОсновной КАК ЗаказОсновной,
	|	b2b_Дозаказы.ПунктДоставки КАК ПунктДоставки,
	|	b2b_Дозаказы.Контрагент КАК Контрагент
	|ИЗ
	|	РегистрСведений.b2b_Дозаказы КАК b2b_Дозаказы
	|ГДЕ
	|	b2b_Дозаказы.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ПараметрыДляЗаписи.Свойство("Товары") Тогда //при записи заказа, первично, без отправки на сайт 
		
		ВыборкаДетальныеЗаписи.Следующий(); 
		Для каждого ДанныеПоТовару Из ПараметрыДляЗаписи.Товары Цикл
		
			МенеджерЗаписи = РегистрыСведений.b2b_Дозаказы.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи,ВыборкаДетальныеЗаписи); 
			
			МенеджерЗаписи.Заказ = Заказ;
			МенеджерЗаписи.Номенклатура = ДанныеПоТовару.Номенклатура;
			МенеджерЗаписи.Количество = ДанныеПоТовару.Количество;
			//МенеджерЗаписи.ЖелаемаяДатаОтгрузки = ДанныеПоТовару.ЖелаемаяДатаОтгрузки;
			//МенеджерЗаписи.Комментарий = ДанныеПоТовару.Комментарий; 			
			
			Если ПараметрыДляЗаписи.Свойство("ОсновнойЗаказ") Тогда
				
				МенеджерЗаписи.ЗаказОсновной = ПараметрыДляЗаписи.ОсновнойЗаказ;	
				
			КонецЕсли;
			
			Если  ПараметрыДляЗаписи.Свойство("Комментарий") Тогда
				
				МенеджерЗаписи.Комментарий = ПараметрыДляЗаписи.Комментарий;	
				
			КонецЕсли;
			
			Если  ПараметрыДляЗаписи.Свойство("ПунктДоставки") Тогда
				
				МенеджерЗаписи.ПунктДоставки = ПараметрыДляЗаписи.ПунктДоставки;	
				
			КонецЕсли;
			
			Если  ПараметрыДляЗаписи.Свойство("Контрагент") Тогда
				
				МенеджерЗаписи.Контрагент = ПараметрыДляЗаписи.Контрагент;	
				
			КонецЕсли;

			
			МенеджерЗаписи.Записать(); 
		КонецЦикла;
	Иначе  
		
		
		НаборЗаписей = РегистрыСведений.b2b_Дозаказы.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Заказ.Установить(Заказ); 
		НаборЗаписей.Записать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
			
			Для каждого ДанныеПоТовару Из Заказ.Товары Цикл
				
				МенеджерЗаписи = РегистрыСведений.b2b_Дозаказы.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МенеджерЗаписи,ДанныеПоТовару); 
				
				ЗаполнитьЗначенияСвойств(МенеджерЗаписи,ВыборкаДетальныеЗаписи);	
				
				Если  ПараметрыДляЗаписи.Свойство("СрокПодтвержденияПоДозаказу") Тогда
					
					МенеджерЗаписи.СрокПодтвержденияПоДозаказу = ПараметрыДляЗаписи.СрокПодтвержденияПоДозаказу;	
					
				КонецЕсли;
				
				Если  ПараметрыДляЗаписи.Свойство("СтатусДоЗаказа_b2b") Тогда
					
					МенеджерЗаписи.СтатусДоЗаказа_b2b = ПараметрыДляЗаписи.СтатусДоЗаказа_b2b;	
					
				КонецЕсли;
				
				Если  ПараметрыДляЗаписи.Свойство("ПРМ") Тогда
					
					МенеджерЗаписи.ПРМ = ПараметрыДляЗаписи.ПРМ;	
					
				КонецЕсли;
				
				Если  ПараметрыДляЗаписи.Свойство("Комментарий") Тогда
					
					МенеджерЗаписи.Комментарий = ПараметрыДляЗаписи.Комментарий;	
					
				КонецЕсли;
				
				Если  ПараметрыДляЗаписи.Свойство("ЖелаемаяДатаОтгрузки") Тогда
					
					МенеджерЗаписи.ЖелаемаяДатаОтгрузки = ПараметрыДляЗаписи.ЖелаемаяДатаОтгрузки;	
					
				КонецЕсли;
				
				Если  ПараметрыДляЗаписи.Свойство("ПунктДоставки") Тогда
					
					МенеджерЗаписи.ПунктДоставки = ПараметрыДляЗаписи.ПунктДоставки;	
					
				КонецЕсли;
				
				Если  ПараметрыДляЗаписи.Свойство("Контрагент") Тогда
					
					МенеджерЗаписи.Контрагент = ПараметрыДляЗаписи.Контрагент;	
					
				КонецЕсли;
				
				
				Попытка
					
					МенеджерЗаписи.Записать(); 
					
				Исключение
					
				КонецПопытки;
				
			КонецЦикла;
			
			
		КонецЕсли;
	КонецЕсли;
	
	
		 
	 

КонецПроцедуры // ()


// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Процедура ОбновитьЗаказКлиента(ДанныеАпи,ЗаказКлиента,
	ОбновленныеЗаказы,
	НеДобавлятьВРСОбновленные = Ложь,
	ВернутьИсходноеСостояние = Ложь,
	ИдентификаторЗапроса = неопределено)
	
	ЗаказКлиентаОбъект = ЗаказКлиента.ПолучитьОбъект();
	////////////////////////////////////////////////
	//блокировка
	//если вызов идет из формы открытой , то блокировку не проверяем 
	ПроверкаБлокировки = Истина; 
	ЗаблокироватьОбъектДляИзменений(ИдентификаторЗапроса, ЗаказКлиентаОбъект,НеДобавлятьВРСОбновленные,ПроверкаБлокировки);
	Если НЕ ПроверкаБлокировки Тогда
		
		Возврат; 	
		
	КонецЕсли;
	
	///////////////////////////////////////////////
	ДатаОбновления = ПреобразоватьДату(ДанныеАпи.order.dateUpdate);
	СрокПодтвержденияПоДозаказу  = ПреобразоватьДату(ДанныеАпи.order.cancellationTimeout2);
	 
	СтатусЗаказа =  ДанныеАпи.order.statusId;
	
	ПризнакКорректировки = ?(ДанныеАпи.order.Свойство("subStatusId"),ДанныеАпи.order.subStatusId = "ZCC",Ложь);  
	
	МетодДоставки = неопределено; 
	
	ПричинаОтменыЗаявки = Неопределено;      
	
	ДатаОбновленияДозаказа = неопределено; 
	
	Если ДанныеАпи.Свойство("additionalOrder") Тогда
		
		СтатусДоЗаказа_b2b = ПолучитьИзСоответствияСтатусДоЗаказа(ДанныеАпи.additionalOrder.statusId);
		НомерДоЗаказа = ДанныеАпи.additionalOrder.accountNumber;
		
		Если ДанныеАпи.additionalOrder.Свойство("confirmedProducts") Тогда
			ТоварыВДоЗаказе = ДанныеАпи.additionalOrder.confirmedProducts;
		Иначе 
			ТоварыВДоЗаказе = ДанныеАпи.additionalOrder.orderedProducts;
			
		КонецЕсли;
		
		ДатаОбновленияДозаказа = ПреобразоватьДату(ДанныеАпи.additionalOrder.dateUpdate);
		
	Иначе 
		СтатусДоЗаказа_b2b = Неопределено; 
		НомерДоЗаказа = Неопределено; 
		ТоварыВДоЗаказе = неопределено; 
	КонецЕсли;      
	
	ЗаказИзменен = Ложь;
	
	ВернутьИсходноеСостояниеПодтвержден = Ложь; 
	
	СостояниеНакладнойДо = ЗаказКлиентаОбъект.СостояниеНакладной; 
	СостояниеСогласованияДо = ЗаказКлиентаОбъект.СостояниеСогласования; 
	СтатусЗаявкиДо = СтатусЗаявкиПоЗаказу(ЗаказКлиентаОбъект.ссылка); 
	
	Если СтатусЗаказа = "ZN"
		ИЛИ СтатусЗаказа = "ZC" Тогда
		//ждет подтверждения дистрибьютором
		
		ВернутьИсходноеСостояниеПодтвержден = ВернутьИсходноеСостояние; 
		
		СтатусЗаказа_b2b = Перечисления.b2b_СтатусыЗаказов.ЖдетПодтвержденияДистрибьютором;	   
		
		ЗаказКлиентаОбъект.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.ВРаботе;
		ЗаказКлиентаОбъект.СостояниеСогласования = Перечисления.СостоянияСогласования.НаСогласованииЦО;
		//++Данилова Е.В. 21.07.2025 без задачи , изменения на портале	
		Если ДанныеАпи.order.Свойство("confirmedProducts")
			 И НЕ ВернутьИсходноеСостояниеПодтвержден Тогда
			//--Данилова Е.В. 21.07.2025
			
			ТоварыВОсновномЗаказе =  ДанныеАпи.order.confirmedProducts; 
		Иначе 
			
			ТоварыВОсновномЗаказе =  ДанныеАпи.order.orderedProducts ;
		КонецЕсли;
		
		Если СтатусЗаказа = "ZN"
			И НЕ ДанныеАпи.order.Свойство("confirmedProducts") Тогда 
			
			ТоварыВОсновномЗаказе = неопределено;
			
			Если ЗаказКлиентаОбъект.Товары.Количество() > 0  Тогда
			
				ЗаказИзменен = Истина; 
			
			КонецЕсли;
			
		Иначе 
			МассивТоваровССайта = Новый Массив; 
			Для каждого ДанныеПоТовару Из ТоварыВОсновномЗаказе Цикл
				
				Номенклатура = НайтиТоварПоКодуТовара(ДанныеПоТовару.xmlId);
				
				Если  НЕ ЗначениеЗаполнено(Номенклатура) Тогда
					
					Продолжить; 
					
				КонецЕсли;
				
				МассивТоваровССайта.Добавить(Номенклатура); 
				
				Отбор = Новый Структура("Номенклатура",Номенклатура);
				СтрокиТовара = ЗаказКлиентаОбъект.Товары.НайтиСтроки(Отбор);
				
				Дозаказ = НайтиДоЗаказпоОсновному(ЗаказКлиентаОбъект.ссылка);
				
				СтатусДозаказаДо = СтатусДозаказаПоЗаказу(Дозаказ);
				
				ИзменитьТоварВЗаказе = Истина; 
				Если ЗначениеЗаполнено(Дозаказ) 
					И НЕ ЗначениеЗаполнено(СтатусДозаказаДо) Тогда
					Если НЕ ВернутьИсходноеСостояние Тогда
						
						СтрокиДозаказа = Дозаказ.Товары.НайтиСтроки(Отбор); 
						Если СтрокиДозаказа.Количество() > 0  Тогда
							
							ИзменитьТоварВЗаказе = Ложь; 
							
						КонецЕсли;	
					КонецЕсли; 	
					
				КонецЕсли;
					
				Если СтрокиТовара.Количество() > 0  Тогда
					
					НовыйТовар =  СтрокиТовара[0];
					
					Если ВернутьИсходноеСостояние Тогда 						
						
						НовыйТовар.Номенклатура 	= Номенклатура;
						НовыйТовар.ПодтвержденнаяЗаявка =  ДанныеПоТовару.quantity;
						НовыйТовар.Цена = ДанныеПоТовару.price;
						НовыйТовар.ЦенаИсточник = ДанныеПоТовару.price;
						НовыйТовар.ЦенаБезСкидки = ДанныеПоТовару.price;
						НовыйТовар.Единица 		= НайтиЕдиницуТовараПоБазовой(НовыйТовар.Номенклатура.БазоваяЕдиница,Номенклатура);			    
						НовыйТовар.СтавкаНДС       = ПолучитьСтавкуНДС_(Номенклатура); //.Родитель.СтавкаНДС; //Перечисления.СтавкиНДС.НДС20;
						НовыйТовар.Заявка 		= ДанныеПоТовару.quantity;
						НовыйТовар.Количество 		= ДанныеПоТовару.quantity;
						
						ЗаполнитьЦенуНоменклатурыТабЧасти_(НовыйТовар,ЗаказКлиентаОбъект); 
						
						РассчитатьСуммуТабЧасти_(НовыйТовар,ЗаказКлиентаОбъект);
						
						ЗаказИзменен = Истина;
						
						
					ИначеЕсли НовыйТовар.ПодтвержденнаяЗаявка <>  Число(ДанныеПоТовару.quantity)
						И ИзменитьТоварВЗаказе Тогда
						
						НовыйТовар.Номенклатура 	= Номенклатура;
						НовыйТовар.ПодтвержденнаяЗаявка =  ДанныеПоТовару.quantity;  						
						
						ЗаказИзменен = Истина;	
						
					КонецЕсли;
					
					
				Иначе 
					//если есть дозаказ и он еще не отправлен на портал , то 
					//необходимо проверить сумму по кол-ву и прибавить только разницу 
					//а если была уже отправка дозаказа, то хоть и статус не заполнен, но товара этого или не будет 
					
					
					
					Если ИзменитьТоварВЗаказе Тогда 
						
						НовыйТовар = ЗаказКлиентаОбъект.Товары.Добавить();
						НовыйТовар.Цена = ДанныеПоТовару.price;
						НовыйТовар.ЦенаИсточник = ДанныеПоТовару.price;
						НовыйТовар.ЦенаБезСкидки = ДанныеПоТовару.price;
						НовыйТовар.Единица 		= НайтиЕдиницуТовараПоБазовой(НовыйТовар.Номенклатура.БазоваяЕдиница,Номенклатура);			    
						НовыйТовар.СтавкаНДС       = ПолучитьСтавкуНДС_(Номенклатура); //Номенклатура.Родитель.СтавкаНДС; //Перечисления.СтавкиНДС.НДС20;
						НовыйТовар.Заявка 		= ДанныеПоТовару.quantity;
						НовыйТовар.Количество 		= ДанныеПоТовару.quantity;
						//НовыйТовар.Сумма 		    = НовыйТовар.Количество * НовыйТовар.Цена;
						//НовыйТовар.ВсегоБезСкидки    = НовыйТовар.Количество * НовыйТовар.ЦенаБезСкидки;
						//НовыйТовар.Всего 		    = НовыйТовар.Количество * НовыйТовар.Цена;
						//
						ЗаполнитьЦенуНоменклатурыТабЧасти_(НовыйТовар,ЗаказКлиентаОбъект);
						
						РассчитатьСуммуТабЧасти_(НовыйТовар,ЗаказКлиентаОбъект); 
						
						НовыйТовар.Номенклатура 	= Номенклатура;
						НовыйТовар.ПодтвержденнаяЗаявка =  ДанныеПоТовару.quantity;
						
						ЗаказИзменен = Истина;	
					КонецЕсли;
					
					
				КонецЕсли;
				
				
				
				
			КонецЦикла;
			//также может быть так, что товар скорректирован и убран из заказа
			СтрокиДляУдаления = Новый Массив; 
			Для каждого ТоварЗаказа Из   ЗаказКлиентаОбъект.Товары  Цикл
				Если  МассивТоваровССайта.Найти(ТоварЗаказа.Номенклатура)  = неопределено Тогда
					
				СтрокиДляУдаления.Добавить(ТоварЗаказа); 	
					
				КонецЕсли;
				
			КонецЦикла;
			
			Для каждого СтрокаДляУдаления Из СтрокиДляУдаления Цикл
			
				ЗаказКлиентаОбъект.Товары.Удалить(СтрокаДляУдаления); 	
			
			КонецЦикла;
				
				
		КонецЕсли; 
	ИначеЕсли СтатусЗаказа = "ZF" Тогда
		
		СтатусЗаказа_b2b = Перечисления.b2b_СтатусыЗаказов.Выполнена;
		
		Если ЗаказКлиентаОбъект.СостояниеНакладной <> Перечисления.СостоянияЗаказаКонтрагента.Отменен Тогда
			
			ЗаказКлиентаОбъект.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.Выполнен;
			ЗаказКлиентаОбъект.СостояниеСогласования = Перечисления.СостоянияСогласования.Выполнен;	
			
			
		КонецЕсли;
		
		
		
	ИначеЕсли СтатусЗаказа = "ZO" Тогда
		
		СтатусЗаказа_b2b = Перечисления.b2b_СтатусыЗаказов.ЧастичноВыполнена;
		
		Если ЗаказКлиентаОбъект.СостояниеНакладной <> Перечисления.СостоянияЗаказаКонтрагента.Отменен Тогда
			РНКСущ = неопределено; 
			РезультатСвязиРНК = ПроверитьСвязьСРНК(ЗаказКлиентаОбъект.ссылка,РНКСущ);
			Если РезультатСвязиРНК И ЗначениеЗаполнено(РНКСущ)
				И РНКСущ.Отгружен = Перечисления.Отгружен.Отгружен Тогда
				
				ЗаказКлиентаОбъект.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.ВыполненЧастично;	
				
			КонецЕсли;
			
			ЗаказКлиентаОбъект.СостояниеСогласования = Перечисления.СостоянияСогласования.Согласован;
		КонецЕсли;
		
	ИначеЕсли СтатусЗаказа = "ZP" Тогда
		//согласована , меняем статус
		
		СтатусЗаказа_b2b = Перечисления.b2b_СтатусыЗаказов.Согласована;
		
		Если НЕ ДанныеАпи.order.Свойство("confirmedProducts") 
			 ИЛИ (ДанныеАпи.order.Свойство("distrShipmentStatus") И ДанныеАпи.order.distrShipmentStatus = "C") Тогда  		   
			
			ЗаказКлиентаОбъект.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.Отменен;
			
			Если СостояниеСогласованияДо <> Перечисления.СостоянияСогласования.ОтмененЦО Тогда
			
				ЗаказКлиентаОбъект.СостояниеСогласования = Перечисления.СостоянияСогласования.ОтмененКонтрагент;	
			   
			КонецЕсли;
			
			
		Иначе 
			
			Если ЗаказКлиентаОбъект.СостояниеНакладной <> Перечисления.СостоянияЗаказаКонтрагента.ПодтвержденныйЗаказ 
				 И ЗаказКлиентаОбъект.СостояниеНакладной <> Перечисления.СостоянияЗаказаКонтрагента.ВыполненЧастично
				  И ЗаказКлиентаОбъект.СостояниеНакладной <> Перечисления.СостоянияЗаказаКонтрагента.Выполнен Тогда
			
				ЗаказКлиентаОбъект.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.ВРаботе;	
			
			КонецЕсли;
			
			ЗаказКлиентаОбъект.СостояниеСогласования = Перечисления.СостоянияСогласования.Согласован;
			
			Для каждого СтрокаПоТовару Из ЗаказКлиентаОбъект.товары Цикл
				
				СтрокаПоТовару.ПодтвержденнаяЗаявка = СтрокаПоТовару.Количество; 
				
			КонецЦикла;
			
			МетодДоставки  =  ДанныеАпи.order.shipmentMethod;
			
		КонецЕсли;    
		
		
	ИначеЕсли СтатусЗаказа = "ZD" Тогда
		
		СтатусЗаказа_b2b = Перечисления.b2b_СтатусыЗаказов.Отменена;
		ЗаказКлиентаОбъект.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.Отменен;
		
		Если СостояниеСогласованияДо <> Перечисления.СостоянияСогласования.ОтмененЦО Тогда
			ЗаказКлиентаОбъект.СостояниеСогласования = Перечисления.СостоянияСогласования.ОтмененКонтрагент;
			
			 ПричинаОтменыЗаявки =  ДанныеАпи.order.cancelReasonText + ?(ЗначениеЗаполнено(ДанныеАпи.order.cancelComment)," " + ДанныеАпи.order.cancelComment,""); 
			
		КонецЕсли;
	ИначеЕсли СтатусЗаказа = "ZA" Тогда 
		
		СтатусЗаказа_b2b = Перечисления.b2b_СтатусыЗаказов.ЖдетПодтвержденияКлиентом;
		
	Иначе 
		Возврат; 
	КонецЕсли;
	
	Попытка
		
		Попытка
			ЗаказКлиентаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Если ЗаказКлиентаОбъект.Проведен Тогда 
				ЗаказКлиентаОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Иначе 
				ЗаказКлиентаОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		КонецПопытки; 
		ПараметрыДлязаписи = Новый Структура; 
		ПараметрыДлязаписи.Вставить("СтатусЗаказа_b2b",СтатусЗаказа_b2b);
		ПараметрыДлязаписи.Вставить("ДатаОбновления",ДатаОбновления);
		Если ЗначениеЗаполнено(ДатаОбновленияДозаказа) Тогда
			
			ПараметрыДлязаписи.Вставить("ДатаОбновленияДозаказа",ДатаОбновленияДозаказа);	
			
		КонецЕсли;
		Если ЗначениеЗаполнено(МетодДоставки) Тогда
			
			ПараметрыДлязаписи.Вставить("МетодДоставки",МетодДоставки);	
			
		КонецЕсли;
		ЗаписатьДополнительныеДанныеВРегистрЗаказов(ЗаказКлиентаОбъект.Ссылка,ПараметрыДлязаписи);
		
		Если ЗначениеЗаполнено(ПричинаОтменыЗаявки) Тогда
		
			ЗаписатьВДополнительныеРеквизитыПричинуОтмены(ЗаказКлиентаОбъект.ссылка,ПричинаОтменыЗаявки); 	
		
		КонецЕсли;
		
		Если СтатусЗаявкиДо <> ?(СтатусЗаказа_b2b = Неопределено,Перечисления.b2b_СтатусыЗаказов.ПустаяСсылка(),СтатусЗаказа_b2b)
			 ИЛИ СостояниеНакладнойДо <> ЗаказКлиентаОбъект.СостояниеНакладной
			  ИЛИ СостояниеСогласованияДо <> ЗаказКлиентаОбъект.СостояниеСогласования Тогда
		
			ЗаказИзменен = Истина; 
		
		КонецЕсли;
		
		Если ЗаказИзменен Тогда
		
			ЗаписатьВРегистрОбновленныеЗаказы(ЗаказКлиентаОбъект.ссылка,ТекущаяДатаСеанса()); 	
		
		КонецЕсли;
		
		Дозаказ = НайтиДоЗаказпоОсновному(ЗаказКлиентаОбъект.ссылка);
		
		СтатусДозаказаДо = СтатусДозаказаПоЗаказу(Дозаказ); 
		СостояниеНакладнойДозаказаДо =  Дозаказ.СостояниеНакладной; 
		СостояниеСогласованияДозаказаДо = Дозаказ.СостояниеСогласования; 
		
		ЗаказИзменен = Ложь;
		Если (СтатусЗаказа_b2b = Перечисления.b2b_СтатусыЗаказов.Согласована 
			ИЛИ СтатусЗаказа_b2b = Перечисления.b2b_СтатусыЗаказов.ЧастичноВыполнена
			ИЛИ СтатусЗаказа_b2b = Перечисления.b2b_СтатусыЗаказов.ЖдетПодтвержденияДистрибьютором
			ИЛИ ПризнакКорректировки
			ИЛИ ВернутьИсходноеСостояниеПодтвержден
			ИЛИ СтатусЗаказа_b2b = Перечисления.b2b_СтатусыЗаказов.Отменена)
			И ЗначениеЗаполнено(Дозаказ) 
			И НЕ ЗначениеЗаполнено(СтатусДоЗаказа_b2b)Тогда
			
			ОбъектДозаказ = Дозаказ.ПолучитьОбъект();
			////////////////////////////////////////////////
			//блокировка
			ПроверкаБлокировки = Истина; 
			ЗаблокироватьОбъектДляИзменений(ИдентификаторЗапроса, ОбъектДозаказ,НеДобавлятьВРСОбновленные,ПроверкаБлокировки);
			Если НЕ ПроверкаБлокировки Тогда
			
				Возврат; 	
			
			КонецЕсли;
			///////////////////////////////////////////////
			ОбъектДозаказ.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.Отменен;
			Если СостояниеСогласованияДозаказаДо <> Перечисления.СостоянияСогласования.ОтмененЦО Тогда
				ОбъектДозаказ.СостояниеСогласования = Перечисления.СостоянияСогласования.ОтмененКонтрагент;
			КонецЕсли;
			ОбъектДозаказ.Комментарий =   ОбъектДозаказ.Комментарий + "#Отменен"; 
			
			СтатусДоЗаказа_b2b = Перечисления.b2b_СтатусыДоЗаказов.Отменен;
			
			ПараметрыДлязаписи = Новый Структура; 
			ПараметрыДлязаписи.Вставить("СтатусДоЗаказа_b2b",СтатусДоЗаказа_b2b);
			ЗаписатьДополнительныеДанныеВРегистрДоЗаказов(ОбъектДозаказ.Ссылка,ПараметрыДлязаписи,ЛОЖЬ);
			
			ОбъектДозаказ.Записать(); 
			
			Если ПризнакКорректировки
				 ИЛИ ВернутьИсходноеСостояниеПодтвержден Тогда //отвяжем дозаказ
				
				ДозаказыНР = РегистрыСведений.b2b_Дозаказы.СоздатьНаборЗаписей(); 	
				ДозаказыНР.Отбор.Заказ.Установить(ОбъектДозаказ.ссылка); 
				ДозаказыНР.Записать(); 
				
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтатусДоЗаказа_b2b) 
			И ЗначениеЗаполнено(Дозаказ) Тогда
			
			ОбъектДозаказ = Дозаказ.ПолучитьОбъект();
			
			////////////////////////////////////////////////
			//блокировка
			ПроверкаБлокировки = Истина; 
			ЗаблокироватьОбъектДляИзменений(ИдентификаторЗапроса, ОбъектДозаказ,НеДобавлятьВРСОбновленные,ПроверкаБлокировки);
			Если НЕ ПроверкаБлокировки Тогда
			
				Возврат; 	
			
			КонецЕсли;
			///////////////////////////////////////////////
						
			Если СтатусДоЗаказа_b2b = Перечисления.b2b_СтатусыДоЗаказов.Отменен Тогда
				
				ОбъектДозаказ.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.Отменен;
				Если СостояниеСогласованияДозаказаДо <> Перечисления.СостоянияСогласования.ОтмененЦО Тогда 
					ОбъектДозаказ.СостояниеСогласования = Перечисления.СостоянияСогласования.ОтмененКонтрагент;
				КонецЕсли;
			ИначеЕсли СтатусЗаказа_b2b = Перечисления.b2b_СтатусыЗаказов.ЖдетПодтвержденияДистрибьютором Тогда 
				
				ОбъектДозаказ.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.ВРаботе;
				ОбъектДозаказ.СостояниеСогласования = Перечисления.СостоянияСогласования.НаСогласованииЦО; 
				
			ИначеЕсли СтатусЗаказа_b2b = Перечисления.b2b_СтатусыЗаказов.Выполнена Тогда 
				
				ОбъектДозаказ.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.Выполнен;
				ОбъектДозаказ.СостояниеСогласования = Перечисления.СостоянияСогласования.Выполнен;
				
			ИначеЕсли СтатусЗаказа_b2b = Перечисления.b2b_СтатусыЗаказов.ЧастичноВыполнена Тогда 
				РНКСущ = неопределено; 
				РезультатСвязиРНК = ПроверитьСвязьСРНК(ОбъектДозаказ.ссылка,РНКСущ);
				Если НЕ РезультатСвязиРНК И ЗначениеЗаполнено(РНКСущ)
					И РНКСущ.Отгружен = Перечисления.Отгружен.Отгружен Тогда
					ОбъектДозаказ.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.Выполнен;
				КонецЕсли;
				Если ЗаказКлиентаОбъект.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.Отменен Тогда
				
					ОбъектДозаказ.СостояниеСогласования = Перечисления.СостоянияСогласования.Выполнен;
				Иначе
					ОбъектДозаказ.СостояниеСогласования = Перечисления.СостоянияСогласования.Согласован;
				КонецЕсли;
				
				
			ИначеЕсли  СтатусЗаказа_b2b = Перечисления.b2b_СтатусыЗаказов.Согласована Тогда
				Если ОбъектДозаказ.СостояниеНакладной <> Перечисления.СостоянияЗаказаКонтрагента.ПодтвержденныйЗаказ
					И ОбъектДозаказ.СостояниеНакладной <> Перечисления.СостоянияЗаказаКонтрагента.ВыполненЧастично 
					И ОбъектДозаказ.СостояниеНакладной <> Перечисления.СостоянияЗаказаКонтрагента.Выполнен
					Тогда
					
					ОбъектДозаказ.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.ВРаботе;	
					
				КонецЕсли;
				
				ОбъектДозаказ.СостояниеСогласования = Перечисления.СостоянияСогласования.Согласован;
				
			ИначеЕсли  СтатусЗаказа_b2b = Перечисления.b2b_СтатусыЗаказов.Отменена Тогда 
				
				ОбъектДозаказ.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.Отменен;
				
				Если СостояниеСогласованияДозаказаДо <> Перечисления.СостоянияСогласования.ОтмененЦО Тогда
					ОбъектДозаказ.СостояниеСогласования = ЗаказКлиентаОбъект.СостояниеСогласования; 
				КонецЕсли;
			ИначеЕсли  СтатусЗаказа_b2b = Перечисления.b2b_СтатусыЗаказов.ЖдетПодтвержденияКлиентом Тогда 
				
				ОбъектДозаказ.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.ВРаботе;
				ОбъектДозаказ.СостояниеСогласования =  Перечисления.СостоянияСогласования.НаСогласованииКонтрагент; 
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТоварыВДоЗаказе) Тогда
				
				МассивТоваровССайта = Новый Массив; 
				Для каждого ДанныеПоТовару Из ТоварыВДоЗаказе Цикл
					
					Номенклатура = НайтиТоварПоКодуТовара(ДанныеПоТовару.xmlId);
					
					Если  НЕ ЗначениеЗаполнено(Номенклатура) Тогда
						
						Продолжить; 
						
					КонецЕсли;
					
					МассивТоваровССайта.Добавить(Номенклатура); 
					
					Отбор = Новый Структура("Номенклатура",Номенклатура);
					СтрокиТовара = ОбъектДозаказ.Товары.НайтиСтроки(Отбор);
					Если СтрокиТовара.Количество() > 0  Тогда
						
						Если СтрокиТовара[0].Количество <> Число(ДанныеПоТовару.quantity) тогда 
							 ЗаказИзменен = Истина; 
						КонецЕсли; 
						
						НовыйТовар =  СтрокиТовара[0]; 
						НовыйТовар.Номенклатура 	= Номенклатура; 
						НовыйТовар.ПодтвержденнаяЗаявка 		= ДанныеПоТовару.quantity; 
						НовыйТовар.Количество 					= ДанныеПоТовару.quantity;
						//НовыйТовар.Сумма 		    = НовыйТовар.Количество * НовыйТовар.Цена;
						//НовыйТовар.ВсегоБезСкидки  = НовыйТовар.Количество * НовыйТовар.ЦенаБезСкидки;
						//НовыйТовар.Всего 		    = НовыйТовар.Количество * НовыйТовар.Цена;
						РассчитатьСуммуТабЧасти_(НовыйТовар,ОбъектДозаказ);
					КонецЕсли;
					
					
					
				КонецЦикла;
				
				СтрокиДляУдаления = Новый Массив; 
				Для каждого ТоварЗаказа Из   ОбъектДозаказ.Товары  Цикл
					Если  МассивТоваровССайта.Найти(ТоварЗаказа.Номенклатура)  = неопределено Тогда
						
						СтрокиДляУдаления.Добавить(ТоварЗаказа); 	
						
					КонецЕсли;
					
				КонецЦикла;
				
				Для каждого СтрокаДляУдаления Из СтрокиДляУдаления Цикл
					
					ОбъектДозаказ.Товары.Удалить(СтрокаДляУдаления); 	
					
				КонецЦикла;
				
				
			КонецЕсли;
			
			ОбъектДозаказ.Записать();
			
			ПараметрыДлязаписи = Новый Структура; 
			ПараметрыДлязаписи.Вставить("СтатусДоЗаказа_b2b",СтатусДоЗаказа_b2b);
			ПараметрыДлязаписи.Вставить("СрокПодтвержденияПоДозаказу",СрокПодтвержденияПоДозаказу);
			
			ПРМ =  НайтиПеремещениеТоваровПоНомеру(НомерДоЗаказа); 
			
			Если ЗначениеЗаполнено(ПРМ) Тогда 	
				ПараметрыДлязаписи.Вставить("ПРМ",ПРМ);
			КонецЕсли;	
			
			ЗаписатьДополнительныеДанныеВРегистрДоЗаказов(ОбъектДозаказ.Ссылка,ПараметрыДлязаписи,ЛОЖЬ);
			Если СтатусДозаказаДо <> СтатусДоЗаказа_b2b 
				 ИЛИ СостояниеНакладнойДозаказаДо <> ОбъектДозаказ.СостояниеНакладной 
				  ИЛИ СостояниеСогласованияДозаказаДо <> ОбъектДозаказ.СостояниеСогласования Тогда
			
				  ЗаказИзменен = Истина; 
			
			  КонецЕсли;
			  
			  Если ЗаказИзменен 
				  И НЕ НеДобавлятьВРСОбновленные Тогда
				  
				  ЗаписатьВРегистрОбновленныеЗаказы(ОбъектДозаказ.ссылка,ТекущаяДатаСеанса()); 	
				  
			  КонецЕсли;
		КонецЕсли; 			 
		
		
		Если СтатусЗаказа = "ZC" Тогда
			
			ОбновленныеЗаказы.Добавить(ЗаказКлиентаОбъект.ссылка); 
			
		КонецЕсли;
		
	Исключение
		
		Сообщить(ОписаниеОшибки()); 
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаблокироватьОбъектДляИзменений(Знач ИдентификаторЗапроса, Знач ЗаказОбъект, ИзЗаказа = Ложь, ПроверкаБлокировки)
	
	Если ИзЗаказа Тогда
		
		ПроверкаБлокировки = Истина; 
		
		Возврат; 
		
		
	КонецЕсли;
	//Если ЗаказОбъект.Заблокирован() Тогда
	//	
	//	ЗаписатьОшибкуВЖурнал(ИдентификаторЗапроса,"Не удалось заблокировать документ заказа для обновления " + Строка(ЗаказОбъект.ссылка)); 
	//	
	//	ПроверкаБлокировки = Ложь; 
	//	
	//	Возврат; 
	//	
	//КонецЕсли;
	
	Попытка
		
		ЗаказОбъект.Заблокировать();
		
	Исключение
		
		ЗаписатьВРегистрРегистрацияБлокировок(ЗаказОбъект.ссылка); 
				
		ВремяОкончания = ТекущаяДата() + 1;
		Пока ТекущаяДата() <= ВремяОкончания Цикл	
		КонецЦикла;
		
		Попытка
			
			ЗаказОбъект.Заблокировать();
			
			ОчиститьРегистрРегистрацииБлокировокПоЗаказу(ЗаказОбъект.ссылка); 
			
		Исключение
			ПроверкаБлокировки = Ложь;
			
			ОчиститьРегистрРегистрацииБлокировокПоЗаказу(ЗаказОбъект.ссылка);
			
			ЗаписатьОшибкуВЖурнал(Строка(ИдентификаторЗапроса),"Не удалось заблокировать документ заказа для обновления " + Строка(ЗаказОбъект.ссылка));
		КонецПопытки;
		
	КонецПопытки;
	

КонецПроцедуры // ОбновитьЗаказКлиента()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ЗаписатьВРегистрРегистрацияБлокировок(Заказ)
	
	МенеджерЗаписи = РегистрыСведений.b2b_РегистрацияБлокировок.СоздатьМенеджерЗаписи(); 
	МенеджерЗаписи.Заказ = Заказ;
	Попытка
		
		МенеджерЗаписи.Записать();
		
	Исключение
		
	КонецПопытки;
	
	
КонецПроцедуры // ЗаписатьВРегистрРегистрацияБлокировок()
  
 // <Описание функции>
 //
 // Параметры:
 //  <Параметр1>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //  <Параметр2>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //
 // Возвращаемое значение:
 //   <Тип.Вид>   - <описание возвращаемого значения>
 //
 Функция ЗапросНаЗакрытиеФормы(Знач Заказ) Экспорт
	 
	 НаборЗаписей = РегистрыСведений.b2b_РегистрацияБлокировок.СоздатьНаборЗаписей(); 
	 НаборЗаписей.Отбор.Заказ.Установить(Заказ);
	 НаборЗаписей.Прочитать();
	 
	 Возврат НаборЗаписей.Количество() > 0; 
	 
 КонецФункции // ЗапросНаЗакрытиеФормы()
 
 // <Описание процедуры>
 //
 // Параметры:
 //  <Параметр1>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //  <Параметр2>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //
 Процедура ОчиститьРегистрРегистрацииБлокировокПоЗаказу(Знач Заказ)
	 
	 НаборЗаписей = РегистрыСведений.b2b_РегистрацияБлокировок.СоздатьНаборЗаписей(); 
	 НаборЗаписей.Отбор.Заказ.Установить(Заказ);
	 НаборЗаписей.Записать(); 
	 
	 
 КонецПроцедуры // ОчиститьРегистрРегистрацииБлокировокПоЗаказу()
 
 


   // <Описание функции>
   //
   // Параметры:
   //  <Параметр1>  - <Тип.Вид> - <описание параметра>
   //                 <продолжение описания параметра>
   //  <Параметр2>  - <Тип.Вид> - <описание параметра>
   //                 <продолжение описания параметра>
   //
   // Возвращаемое значение:
   //   <Тип.Вид>   - <описание возвращаемого значения>
   //
   Функция НайтиПеремещениеТоваровПоНомеру(НомерВторКонтрагента)
	   
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Перемещение.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Перемещение КАК Перемещение
		|ГДЕ
		|	Перемещение.Проведен
		|	И Перемещение.НомерЗаказаВторичногоКонтрагента = &НомерЗаказаВторичногоКонтрагента";
	
	Запрос.УстановитьПараметр("НомерЗаказаВторичногоКонтрагента", НомерВторКонтрагента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	
		Возврат ВыборкаДетальныеЗаписи.ссылка; 	
	
	КонецЕсли;
	
	Возврат неопределено; 

	   
   КонецФункции // НайтиПеремещениеТоваровПоНомеру()
   
   
   // <Описание функции>
   //
   // Параметры:
   //  <Параметр1>  - <Тип.Вид> - <описание параметра>
   //                 <продолжение описания параметра>
   //  <Параметр2>  - <Тип.Вид> - <описание параметра>
   //                 <продолжение описания параметра>
   //
   // Возвращаемое значение:
   //   <Тип.Вид>   - <описание возвращаемого значения>
   //
Функция ПолучитьИзСоответствияСтатусДоЗаказа(СтатусДоЗаказа)
	
	СоответствиеСтатусыДоЗаказы = Новый Соответствие; 
	СоответствиеСтатусыДоЗаказы.Вставить("N",Перечисления.b2b_СтатусыДоЗаказов.ВОбработке);
	СоответствиеСтатусыДоЗаказы.Вставить("A",Перечисления.b2b_СтатусыДоЗаказов.ТребуетПодтверждения);
	СоответствиеСтатусыДоЗаказы.Вставить("PP",Перечисления.b2b_СтатусыДоЗаказов.ПредварительноПодтвержден);
	СоответствиеСтатусыДоЗаказы.Вставить("P",Перечисления.b2b_СтатусыДоЗаказов.Оформлен);
	СоответствиеСтатусыДоЗаказы.Вставить("CO",Перечисления.b2b_СтатусыДоЗаказов.ЧастичноВыполнен);
	СоответствиеСтатусыДоЗаказы.Вставить("F",Перечисления.b2b_СтатусыДоЗаказов.Выполнен);
	СоответствиеСтатусыДоЗаказы.Вставить("D",Перечисления.b2b_СтатусыДоЗаказов.Отменен);
	
    Возврат СоответствиеСтатусыДоЗаказы.Получить(СтатусДоЗаказа); 
   
КонецФункции // ПолучитьИзСоответствияСтатусДоЗаказа()

Функция ПолучитьИзСоответствияСтатусЗаказа(СтатусДоЗаказа)
	
	СоответствиеСтатусыДоЗаказы = Новый Соответствие; 
	СоответствиеСтатусыДоЗаказы.Вставить("ZC",Перечисления.b2b_СтатусыЗаказов.ЖдетОбработки);
	СоответствиеСтатусыДоЗаказы.Вставить("ZN",Перечисления.b2b_СтатусыЗаказов.ЖдетПодтвержденияДистрибьютором);
	СоответствиеСтатусыДоЗаказы.Вставить("ZA",Перечисления.b2b_СтатусыЗаказов.ЖдетПодтвержденияКлиентом);
	СоответствиеСтатусыДоЗаказы.Вставить("ZP",Перечисления.b2b_СтатусыЗаказов.Согласована);
	СоответствиеСтатусыДоЗаказы.Вставить("ZO",Перечисления.b2b_СтатусыЗаказов.ЧастичноВыполнена);
	СоответствиеСтатусыДоЗаказы.Вставить("ZF",Перечисления.b2b_СтатусыЗаказов.Выполнена);
	СоответствиеСтатусыДоЗаказы.Вставить("ZD",Перечисления.b2b_СтатусыЗаказов.Отменена);
	
    Возврат СоответствиеСтатусыДоЗаказы.Получить(СтатусДоЗаказа); 
   
КонецФункции // ПолучитьИзСоответствияСтатус

Функция ПолучитьИзСоответствияСтатусЗаказаДляОтправкиНаПортал(СтатусДоЗаказа)
	
	СоответствиеСтатусыДоЗаказы = Новый Соответствие; 
	СоответствиеСтатусыДоЗаказы.Вставить(Перечисления.b2b_СтатусыЗаказов.ЖдетОбработки,"ZC");
	СоответствиеСтатусыДоЗаказы.Вставить(Перечисления.b2b_СтатусыЗаказов.ЖдетПодтвержденияДистрибьютором,"ZN");
	СоответствиеСтатусыДоЗаказы.Вставить(Перечисления.b2b_СтатусыЗаказов.ЖдетПодтвержденияКлиентом,"ZA");
	СоответствиеСтатусыДоЗаказы.Вставить(Перечисления.b2b_СтатусыЗаказов.Согласована,"ZP");
	СоответствиеСтатусыДоЗаказы.Вставить(Перечисления.b2b_СтатусыЗаказов.ЧастичноВыполнена,"ZO");
	СоответствиеСтатусыДоЗаказы.Вставить(Перечисления.b2b_СтатусыЗаказов.Выполнена,"ZF");
	СоответствиеСтатусыДоЗаказы.Вставить(Перечисления.b2b_СтатусыЗаказов.Отменена,"ZD");
	
    Возврат СоответствиеСтатусыДоЗаказы.Получить(СтатусДоЗаказа); 
   
КонецФункции

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция НайтиТоварПоКодуТовара(КодТовара)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ПометкаУдаления
		|	И Номенклатура.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", ПреобразоватьКодТовара(КодТовара));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	
		Возврат ВыборкаДетальныеЗаписи.ссылка; 	
	
	КонецЕсли;
	
	Возврат Неопределено; 

КонецФункции // НайтиТоварПоКодуТовара()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция НайтиЕдиницуТовараПоБазовой(БазоваяЕдиница,Номенклатура)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Единицы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Единицы КАК Единицы
		|ГДЕ
		|	Единицы.Владелец = &Владелец
		|	И НЕ Единицы.ПометкаУдаления
		|	И Единицы.ОКЕИ = &ОКЕИ";
	
	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	Запрос.УстановитьПараметр("ОКЕИ", БазоваяЕдиница);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ссылка; 
	КонецЕсли;

	Возврат Справочники.Единицы.ПустаяСсылка(); 
	
КонецФункции // НайтиЕдиницуТовараПоБазовой()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПреобразоватьКодТовара(КодТовара)

	НомерПозиции = СтрНайти(КодТовара,"#");
	Если НомерПозиции > 0  Тогда
	
		Возврат Сред(КодТовара,НомерПозиции +1,СтрДлина(КодТовара) - НомерПозиции); 	
	
	КонецЕсли;
	
	Возврат КодТовара; 

КонецФункции // ПреобразоватьКодТовара()


Функция ЗаполнитьСтруктуруДляЗагрузкиЗаказов(Знач ВходныеПараметры)
	                                                                  	
	СтруктураЗапроса = СформироватьСтруктуруGetЗапроса(); 
	
	СтруктураЗапроса.data.filter.orderType = "OT_REQUEST"; 
	
	ДатаЗапретаРедактирования = Константы.ДатаЗапретаРедактирования.Получить(); 
	
	ЕстьФильтр = Ложь; 
	Если ВходныеПараметры.Свойство("СтатусыЗаказов") 
		И ТипЗнч(ВходныеПараметры.СтатусыЗаказов) = Тип("Массив")
		И ВходныеПараметры.СтатусыЗаказов.Количество() > 0 Тогда
		
		Для каждого ЭлементМассива Из ВходныеПараметры.СтатусыЗаказов Цикл
			statusId = ПолучитьИзСоответствияСтатусЗаказаДляОтправкиНаПортал(ЭлементМассива); 
			СтруктураЗапроса.data.filter.Вставить("statusId",Новый Массив); 
			СтруктураЗапроса.data.filter.statusId.Добавить(statusId); 
			
		КонецЦикла;		
		
		ЕстьФильтр = Истина;
		
	КонецЕсли;
	Если ВходныеПараметры.Свойство("ДатаСозданияНачало")
		И ВходныеПараметры.Свойство("ДатаСозданияОкончание")
		И ЗначениеЗаполнено(ВходныеПараметры.ДатаСозданияНачало)
		И ЗначениеЗаполнено(ВходныеПараметры.ДатаСозданияОкончание) Тогда
		
		Если ЗначениеЗаполнено(ДатаЗапретаРедактирования) Тогда
		
			ДатаСозданияНачало = Макс(ДатаЗапретаРедактирования,ВходныеПараметры.ДатаСозданияНачало); 
			ДатаСозданияОкончание = Макс(ДатаЗапретаРедактирования,ВходныеПараметры.ДатаСозданияОкончание);
		Иначе 
			ДатаСозданияНачало = ВходныеПараметры.ДатаСозданияНачало;
			ДатаСозданияОкончание = ВходныеПараметры.ДатаСозданияОкончание;
		КонецЕсли;
		
		СтруктураЗапроса.data.filter.Вставить("dateCreateFrom");
		СтруктураЗапроса.data.filter.Вставить("dateCreateTo");
		СтруктураЗапроса.data.filter.dateCreateFrom = ПреобразоватьДатуДляПередачиНаПортал(ДатаСозданияНачало); 
		СтруктураЗапроса.data.filter.dateCreateTo = ПреобразоватьДатуДляПередачиНаПортал(ДатаСозданияОкончание);
		
		ЕстьФильтр = Истина;
	КонецЕсли;
	
	Если ВходныеПараметры.Свойство("ДатаОбновленияНачало")
		И ВходныеПараметры.Свойство("ДатаОбновленияОкончание")
		И ЗначениеЗаполнено(ВходныеПараметры.ДатаОбновленияНачало)
		И ЗначениеЗаполнено(ВходныеПараметры.ДатаОбновленияОкончание) Тогда
		
		СтруктураЗапроса.data.filter.Вставить("dateUpdateFrom");
		СтруктураЗапроса.data.filter.Вставить("dateUpdateTo");
		
		Если ЗначениеЗаполнено(ДатаЗапретаРедактирования) Тогда
			
			ДатаОбновленияНачало = Макс(ДатаЗапретаРедактирования,ВходныеПараметры.ДатаОбновленияНачало); 
			ДатаОбновленияОкончание = Макс(ДатаЗапретаРедактирования,ВходныеПараметры.ДатаОбновленияОкончание);
		Иначе 
			ДатаОбновленияНачало = ВходныеПараметры.ДатаОбновленияНачало;
			ДатаОбновленияОкончание = ВходныеПараметры.ДатаОбновленияОкончание;
		КонецЕсли;

		
		СтруктураЗапроса.data.filter.dateUpdateFrom = ПреобразоватьДатуДляПередачиНаПортал(ДатаОбновленияНачало); 
		СтруктураЗапроса.data.filter.dateUpdateTo = ПреобразоватьДатуДляПередачиНаПортал(ДатаОбновленияОкончание);
		
		ЕстьФильтр = Истина;
	КонецЕсли;
	
	Если ВходныеПараметры.Свойство("Пользователь")
		И ЗначениеЗаполнено(ВходныеПараметры.Пользователь) Тогда
		
		СтруктураЗапроса.data.filter.Вставить("user");
		СтруктураЗапроса.data.filter.user = ВходныеПараметры.Пользователь; 	
		
		ЕстьФильтр = Истина;
	КонецЕсли;
	
	Если ВходныеПараметры.Свойство("номерЗаявки")
		И ЗначениеЗаполнено(ВходныеПараметры.номерЗаявки) Тогда
		
		СтруктураЗапроса.data.filter.Вставить("accountNumber");
		СтруктураЗапроса.data.filter.accountNumber = ВходныеПараметры.номерЗаявки; 	
		
		ЕстьФильтр = Истина;
	КонецЕсли;
	
	Если НЕ ЕстьФильтр Тогда
		
		СтруктураЗапроса.data.filter.Вставить("dateUpdateFrom");
		СтруктураЗапроса.data.filter.Вставить("dateUpdateTo");
		
		Если ЗначениеЗаполнено(ДатаЗапретаРедактирования) Тогда
			//долго стало отрабатывать из-за закрытия формы (пауза), ограничение в 3 дня 
			ДатаОбновленияНачало = НачалоДня(КонецДня(ТекущаяДатаСеанса()) - 24*3600*3); // ДатаЗапретаРедактирования;  //Макс(ДатаЗапретаРедактирования,НачалоМесяца(ТекущаяДатаСеанса())); 
			ДатаОбновленияОкончание = КонецДня(ТекущаяДатаСеанса()); //Макс(ДатаЗапретаРедактирования,КонецМесяца(ТекущаяДатаСеанса()));

		Иначе 
			ДатаОбновленияНачало = НачалоДня(КонецДня(ТекущаяДатаСеанса()) - 24*3600*3); //НачалоМесяца(ТекущаяДатаСеанса());
			ДатаОбновленияОкончание = КонецМесяца(ТекущаяДатаСеанса());
		КонецЕсли;


		
		СтруктураЗапроса.data.filter.dateUpdateFrom = ПреобразоватьДатуДляПередачиНаПортал(ДатаОбновленияНачало); 
		СтруктураЗапроса.data.filter.dateUpdateTo = ПреобразоватьДатуДляПередачиНаПортал(ДатаОбновленияОкончание);	
		
	КонецЕсли;
	
	Возврат СтруктураЗапроса; 
	
КонецФункции // ПолучениеСпискаЗаказов()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПреобразоватьДатуДляПередачиНаПортал(Знач Дата)

	 Возврат Формат(Дата,"ДЛФ=DT"); 

КонецФункции // ПреобразоватьДатуДляПередачиНаПортал()


//методы Update 

Процедура ОтправкаНаСогласованиеТолькоОтгрузкиОтПоставщика(ВходныеПараметры,РезультатОтправки,ИдентификаторЗапроса = неопределено)Экспорт

	HTTPСоединение = HTTPСоединение(); 
	Если HTTPСоединение = неопределено Тогда
	
	//записать ошибку в журнал 
	    ЗаписьЖурналаРегистрации("ОшибкаСоединенияОбменЕЭ_POST",УровеньЖурналаРегистрации.Ошибка,,,,);
		
		Возврат; 
	
	КонецЕсли; 
	Если ВходныеПараметры.Свойство("Подразделение") Тогда
		
		Подразделение = ВходныеПараметры.Подразделение; 	
	Иначе 
		Подразделение = неопределено; 
	КонецЕсли;
	
	ДанныеДляОтправкиGetЗапроса = ПолучитьПараметрыМетодаВыгрузки(Подразделение); 
	
	Запрос_АПИ_POST 	= Новый HTTPЗапрос(ДанныеДляОтправкиGetЗапроса.СервисВыгрузки);
	Запрос_АПИ_POST.Заголовки.Вставить("Authorization", ДанныеДляОтправкиGetЗапроса.КлючАвторизации);
	
	СтруктураЗапроса = ЗаполнитьСтруктуруДляОтправкиПодтвержденияТолькоОтгрузкиПоставщика(ВходныеПараметры);
	
	СтрокаJSON 	= ОтработатьЗаполненнуюСтруктуруОтвета(СтруктураЗапроса);
	Запрос_АПИ_POST.УстановитьТелоИзСтроки(СтрокаJSON);
	
	ИдентификаторЗапроса = Новый УникальныйИдентификатор; 
	
	ХранитьПодробностиЛогирования = ДанныеДляОтправкиGetЗапроса.ХранитьПодробностиЛогирования; 
	
	Попытка
		
		Ответ_АПИ = HTTPСоединение.ОтправитьДляОбработки(Запрос_АПИ_POST);
		//в журнал запишем что отправили и когда, и потом уже ответ 
		ЗаписатьВЖурналЗапросыНаОбновлениеЗаказов(Строка(ИдентификаторЗапроса),СтрокаJSON,ВходныеПараметры,ХранитьПодробностиЛогирования);
	Исключение
		
		//записать ошибку в журнал
		Комментарий = "Не удалось отправить запрос на согласование заказа. Ошибка!";
		РезультатДанные = СтруктураРезультат();
		ЗаписатьВЖурналЗапросыНаОбновлениеРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,Комментарий,истина,ХранитьПодробностиЛогирования);  
		ЗаписатьОшибкуВЖурнал(Строка(ИдентификаторЗапроса),Комментарий);
		
		Возврат; //не подключился 
		
	КонецПопытки;
	
	РезультатЧтенияJSON = СтруктураJSONЗапроса(Ответ_АПИ); 
	Структура_JSON_Ответ =  РезультатЧтенияJSON.Структура_JSON;

	ТелоСообщения 	= Ответ_АПИ.ПолучитьТелоКакСтроку(); 
	СтрокаОтвета  	= Строка(Ответ_АПИ.КодСостояния) + " " + ТелоСообщения;
	СтрокаJSONОтвета= ТелоСообщения;
	
	Если Ответ_АПИ.КодСостояния = 200 Тогда
		//запись в журнал 
		 //записать состояние заказа  , оно изменяется на подтверждение от клиента 
		 Если Структура_JSON_Ответ.Свойство("data") Тогда
		 
		 	ОтработатьЗапросНаОбновление(Структура_JSON_Ответ,ВходныеПараметры.Заказ); 	
			
			РезультатДанные = СтруктураРезультат();
			
			РезультатДанные.ИдентификаторКлиента = Структура_JSON_Ответ.requestId;
			РезультатДанные.Документ = ВходныеПараметры.Заказ;
			РезультатДанные.РезультатJson = Структура_JSON_Ответ;
			
			ЗаписатьВЖурналЗапросыНаОбновлениеРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,"",,ХранитьПодробностиЛогирования);
			
			РезультатОтправки = Истина; 
		 КонецЕсли;
	Иначе 
		//запись в журнал
		
		КодОшибки = Ответ_АПИ.КодСостояния;
		
		Если КодОшибки = 400
			ИЛИ КодОшибки = 403 Тогда   		
			
			ИнформацияОбОшибке = Структура_JSON_Ответ.Message;
			
		ИначеЕсли КодОшибки = 401 Тогда
			
			ИнформацияОбОшибке = "Авторизация не пройдена"; 
		Иначе 
			
			ИнформацияОбОшибке = "Ошибка сервера";
		КонецЕсли;
		
		Комментарий = Строка(КодОшибки) + ":" + ИнформацияОбОшибке; 
		
		РезультатДанные = СтруктураРезультат(); 
		РезультатДанные.РезультатJson = ТелоСообщения;
		РезультатДанные.Документ = ВходныеПараметры.Заказ;
		
		ЗаписатьВЖурналЗапросыНаОбновлениеРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,Комментарий,истина,ХранитьПодробностиЛогирования);

	КонецЕсли; 


КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ОтработатьЗапросНаОбновление(ДанныеОтвет,Знач Заказ)
	
	//ЗаказОбъект = Заказ.ПолучитьОбъект(); 
	
	
	Если ДанныеОтвет.data.orders.Количество() > 0  Тогда
		
		СтатусЗаказа_b2b = ПолучитьИзСоответствияСтатусЗаказа(ДанныеОтвет.data.orders[0].order.statusId); 
		ДатаОбновления = ПреобразоватьДату(ДанныеОтвет.data.orders[0].order.dateUpdate);
		Если ДанныеОтвет.data.orders[0].Свойство("additionalOrder") Тогда 
			СтатусДоЗаказа_b2b = ПолучитьИзСоответствияСтатусДоЗаказа(ДанныеОтвет.data.orders[0].additionalOrder.statusId);
		Иначе 
			СтатусДоЗаказа_b2b = неопределено; 
		Конецесли; 
		СрокПодтвержденияДоЗаказа  = ПреобразоватьДату(ДанныеОтвет.data.orders[0].order.cancellationTimeout2);
		
		ПараметрыДлязаписи = Новый Структура; 
		ПараметрыДлязаписи.Вставить("СтатусЗаказа_b2b",СтатусЗаказа_b2b);
		ПараметрыДлязаписи.Вставить("ДатаОбновления",ДатаОбновления);
		
		ЗаписатьДополнительныеДанныеВРегистрЗаказов(Заказ.Ссылка,ПараметрыДлязаписи);
		
		Если ЗначениеЗаполнено(СтатусДоЗаказа_b2b) Тогда 
			ПараметрыДлязаписи = Новый Структура; 
			ПараметрыДлязаписи.Вставить("СтатусДоЗаказа_b2b",СтатусДоЗаказа_b2b);
			ПараметрыДлязаписи.Вставить("СрокПодтвержденияДоЗаказа",СрокПодтвержденияДоЗаказа);
			
			ЗаписатьДополнительныеДанныеВРегистрДоЗаказов(Заказ.Ссылка,ПараметрыДлязаписи,ЛОЖЬ); 
			
		КонецЕсли;
		
	КонецЕсли;
		
	//Попытка
	//
	//	ЗаказОбъект.Записать(); 
	//
	//Исключение
	//
	//КонецПопытки;
	

КонецПроцедуры // ОтработатьЗапросНаОбновление()


Процедура ОтправкаНаСозданиеДоЗаказа(ВходныеПараметры,ОтправленныеУспешно,ИдентификаторЗапроса = Неопределено) Экспорт

	HTTPСоединение = HTTPСоединение(); 
	Если HTTPСоединение = неопределено Тогда
	
	//записать ошибку в журнал 
	    ЗаписьЖурналаРегистрации("ОшибкаСоединенияОбменЕЭ_POST",УровеньЖурналаРегистрации.Ошибка,,,,);
		
		Возврат; 
	
	КонецЕсли;
	
	ДанныеДляОтправкиGetЗапроса = ПолучитьПараметрыМетодаВыгрузки(); 
	
	Запрос_АПИ_POST 	= Новый HTTPЗапрос(ДанныеДляОтправкиGetЗапроса.СервисВыгрузки);
	Запрос_АПИ_POST.Заголовки.Вставить("Authorization", ДанныеДляОтправкиGetЗапроса.КлючАвторизации);
	
	СтруктураЗапроса = ЗаполнитьСтруктуруДляСозданияДозаказа(ВходныеПараметры);
	
	СтрокаJSON 	= ОтработатьЗаполненнуюСтруктуруОтвета(СтруктураЗапроса);
	Запрос_АПИ_POST.УстановитьТелоИзСтроки(СтрокаJSON);
	
	ИдентификаторЗапроса = Новый УникальныйИдентификатор; 
	
	ХранитьПодробностиЛогирования = ДанныеДляОтправкиGetЗапроса.ХранитьПодробностиЛогирования; 
	
	Попытка
		
		Ответ_АПИ = HTTPСоединение.ОтправитьДляОбработки(Запрос_АПИ_POST);
		//в журнал запишем что отправили и когда, и потом уже ответ 
		ЗаписатьВЖурналЗапросыНаОбновлениеЗаказов(Строка(ИдентификаторЗапроса),СтрокаJSON,ВходныеПараметры,ХранитьПодробностиЛогирования);
		 
	Исключение
		
		//записать ошибку в журнал
		Комментарий = "Не удалось отправить запрос на согласование дозаказа. Ошибка!";
		РезультатДанные = СтруктураРезультат();
		РезультатДанные.Документ = ВходныеПараметры.Заказ;
		
		ЗаписатьВЖурналЗапросыНаОбновлениеРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,Комментарий,истина,ХранитьПодробностиЛогирования);  
		ЗаписатьОшибкуВЖурнал(Строка(ИдентификаторЗапроса),Комментарий);
		
		Возврат; //не подключился 
		
	КонецПопытки;
	
	РезультатЧтенияJSON = СтруктураJSONЗапроса(Ответ_АПИ); 
	Структура_JSON_Ответ =  РезультатЧтенияJSON.Структура_JSON;

	ТелоСообщения 	= Ответ_АПИ.ПолучитьТелоКакСтроку(); 
	СтрокаОтвета  	= Строка(Ответ_АПИ.КодСостояния) + " " + ТелоСообщения;
	СтрокаJSONОтвета= ТелоСообщения;
	
	Если Ответ_АПИ.КодСостояния = 200 Тогда
		//запись в журнал 
		 //записать состояние заказа  , оно изменяется на ждет подтверждение от клиента, если это не отмена 
		 Если Структура_JSON_Ответ.Свойство("data") Тогда
			 
			 ОтработатьЗапросНаОбновление(Структура_JSON_Ответ,ВходныеПараметры.Заказ); 	
			 
			 РезультатДанные = СтруктураРезультат();
			 
			 РезультатДанные.ИдентификаторКлиента = Структура_JSON_Ответ.requestId;
			 РезультатДанные.Документ = ВходныеПараметры.Заказ;
			 РезультатДанные.РезультатJson = Структура_JSON_Ответ;
			 
			 ЗаписатьВЖурналЗапросыНаОбновлениеРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,"",,ХранитьПодробностиЛогирования);
			 
			 ОтправленныеУспешно.Добавить(ВходныеПараметры.Заказ);
			 
			 УдалитьИзОчередиДляОтработкиДокумент(ВходныеПараметры.Заказ,"СоздатьДозаказ");
		 
		 КонецЕсли;
	Иначе 
		КодОшибки = Ответ_АПИ.КодСостояния;
		
		Если КодОшибки = 400
			ИЛИ КодОшибки = 403 Тогда   		
			
			ИнформацияОбОшибке = Структура_JSON_Ответ.Message;
			
		ИначеЕсли КодОшибки = 401 Тогда
			
			ИнформацияОбОшибке = "Авторизация не пройдена"; 
		Иначе 
			
			ИнформацияОбОшибке = "Ошибка сервера";
		КонецЕсли;
		
		Комментарий = Строка(КодОшибки) + ":" + ИнформацияОбОшибке; 
		
		РезультатДанные = СтруктураРезультат(); 
		РезультатДанные.РезультатJson = ТелоСообщения; 
		РезультатДанные.Документ = ВходныеПараметры.Заказ;
		
		ЗаписатьВЖурналЗапросыНаОбновлениеРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,Комментарий,истина,ХранитьПодробностиЛогирования);

	КонецЕсли; 


КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ОтправкаСтатусаЗаказа(ВходныеПараметры,РезультатОтправки,ДобавитьТовары = Ложь,ИдентификаторЗапроса = неопределено) Экспорт

	HTTPСоединение = HTTPСоединение(); 
	Если HTTPСоединение = неопределено Тогда
	
	//записать ошибку в журнал 
	    ЗаписьЖурналаРегистрации("ОшибкаСоединенияОбменЕЭ_POST",УровеньЖурналаРегистрации.Ошибка,,,,);
		
		Возврат; 
	
	КонецЕсли;
	
	Если ВходныеПараметры.Свойство("Подразделение") Тогда
		
		Подразделение = ВходныеПараметры.Подразделение; 	
	Иначе 
		Подразделение = неопределено; 
	КонецЕсли;

	ДанныеДляОтправкиGetЗапроса = ПолучитьПараметрыМетодаВыгрузки(Подразделение); 
	
	Запрос_АПИ_POST 	= Новый HTTPЗапрос(ДанныеДляОтправкиGetЗапроса.СервисВыгрузки);
	Запрос_АПИ_POST.Заголовки.Вставить("Authorization", ДанныеДляОтправкиGetЗапроса.КлючАвторизации);
	
	Если НЕ ВходныеПараметры.Свойство("ОтменаЗаказа") Тогда
	
		ВходныеПараметры.Вставить("ОтменаЗаказа",Ложь); 	
	
	КонецЕсли;
	СтруктураЗапроса = ЗаполнитьСтруктуруДляОтправкиСтатусаЗаказа(ВходныеПараметры,ДобавитьТовары);
	
	СтрокаJSON 	= ОтработатьЗаполненнуюСтруктуруОтвета(СтруктураЗапроса);
	Запрос_АПИ_POST.УстановитьТелоИзСтроки(СтрокаJSON);
	
	ИдентификаторЗапроса = Новый УникальныйИдентификатор;
	
	ХранитьПодробностиЛогирования = ДанныеДляОтправкиGetЗапроса.ХранитьПодробностиЛогирования;
	
	Попытка
		
		Ответ_АПИ = HTTPСоединение.ОтправитьДляОбработки(Запрос_АПИ_POST);
		//в журнал запишем что отправили и когда, и потом уже ответ 
		ЗаписатьВЖурналЗапросыНаОбновлениеЗаказов(Строка(ИдентификаторЗапроса),СтрокаJSON,ВходныеПараметры,ХранитьПодробностиЛогирования);
	Исключение
		
		Комментарий = "Не удалось отправить запрос на изменение статуса заказа. Ошибка!";
		РезультатДанные = СтруктураРезультат();
		ЗаписатьВЖурналЗапросыНаОбновлениеРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,Комментарий,истина,ХранитьПодробностиЛогирования);  
		ЗаписатьОшибкуВЖурнал(Строка(ИдентификаторЗапроса),Комментарий);
		
		Возврат; //не подключился 
		
	КонецПопытки;
	
	РезультатЧтенияJSON = СтруктураJSONЗапроса(Ответ_АПИ); 
	Структура_JSON_Ответ =  РезультатЧтенияJSON.Структура_JSON;

	ТелоСообщения 	= Ответ_АПИ.ПолучитьТелоКакСтроку(); 
	СтрокаОтвета  	= Строка(Ответ_АПИ.КодСостояния) + " " + ТелоСообщения;
	СтрокаJSONОтвета= ТелоСообщения;
	
	Если Ответ_АПИ.КодСостояния = 200 Тогда
		//запись в журнал 
		 //записать состояние заказа  , оно изменяется на подтверждение от клиента 
		 Если ТипЗнч(Структура_JSON_Ответ) = Тип("Структура") 
			 И Структура_JSON_Ответ.Свойство("data") Тогда  
			 
			 ОтработатьЗапросНаОбновление(Структура_JSON_Ответ,ВходныеПараметры.Заказ); 	
			 
			 РезультатДанные = СтруктураРезультат();
			 
			 РезультатДанные.ИдентификаторКлиента = Структура_JSON_Ответ.requestId;
			 РезультатДанные.Документ = ВходныеПараметры.Заказ;
			 РезультатДанные.РезультатJson = Структура_JSON_Ответ;
			 
			 ЗаписатьВЖурналЗапросыНаОбновлениеРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,"",,ХранитьПодробностиЛогирования);
			 
		     РезультатОтправки = Истина; 
		 КонецЕсли;
	Иначе 
		КодОшибки = Ответ_АПИ.КодСостояния;
		
		Если КодОшибки = 400
			ИЛИ КодОшибки = 403 Тогда   		
			
			ИнформацияОбОшибке = Структура_JSON_Ответ.Message;
			
		ИначеЕсли КодОшибки = 401 Тогда
			
			ИнформацияОбОшибке = "Авторизация не пройдена"; 
		Иначе 
			
			ИнформацияОбОшибке = "Ошибка сервера";
		КонецЕсли;
		
		Комментарий = Строка(КодОшибки) + ":" + ИнформацияОбОшибке; 
		
		РезультатДанные = СтруктураРезультат(); 
		РезультатДанные.РезультатJson = ТелоСообщения; 
		РезультатДанные.Документ = ВходныеПараметры.Заказ;
		ЗаписатьВЖурналЗапросыНаОбновлениеРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,Комментарий,истина,ХранитьПодробностиЛогирования);
	КонецЕсли; 


КонецПроцедуры // ОтправкаСтатусаЗаказа()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ОтправкаПодтвержденияОтменыДоЗаказа(ВходныеПараметры,РезультатОтправки,ИдентификаторЗапроса = неопределено) Экспорт
	
	HTTPСоединение = HTTPСоединение(); 
	Если HTTPСоединение = неопределено Тогда
	
	//записать ошибку в журнал 
	    ЗаписьЖурналаРегистрации("ОшибкаСоединенияОбменЕЭ_POST",УровеньЖурналаРегистрации.Ошибка,,,,);
		Возврат; 
	
	КонецЕсли;
	
	ДанныеДляОтправкиGetЗапроса = ПолучитьПараметрыМетодаВыгрузки(); 
	
	Запрос_АПИ_POST 	= Новый HTTPЗапрос(ДанныеДляОтправкиGetЗапроса.СервисВыгрузки);
	Запрос_АПИ_POST.Заголовки.Вставить("Authorization", ДанныеДляОтправкиGetЗапроса.КлючАвторизации);
	
	СтруктураЗапроса = ЗаполнитьСтруктуруДляПодтвержденияОтменыДоЗаказа(ВходныеПараметры);
	
	СтрокаJSON 	= ОтработатьЗаполненнуюСтруктуруОтвета(СтруктураЗапроса);
	Запрос_АПИ_POST.УстановитьТелоИзСтроки(СтрокаJSON);
	
	ИдентификаторЗапроса = Новый УникальныйИдентификатор; 
	
	ХранитьПодробностиЛогирования = ДанныеДляОтправкиGetЗапроса.ХранитьПодробностиЛогирования; 
	
	Попытка
		
		Ответ_АПИ = HTTPСоединение.ОтправитьДляОбработки(Запрос_АПИ_POST);
		//в журнал запишем что отправили и когда, и потом уже ответ 
		ЗаписатьВЖурналЗапросыНаОбновлениеЗаказов(Строка(ИдентификаторЗапроса),СтрокаJSON,ВходныеПараметры,ХранитьПодробностиЛогирования);
	Исключение
		
		//записать ошибку в журнал
		Комментарий = "Не удалось отправить запрос на подтверждение дозаказа. Ошибка!";
		РезультатДанные = СтруктураРезультат();
		ЗаписатьВЖурналЗапросыНаОбновлениеРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,Комментарий,истина,ХранитьПодробностиЛогирования);  
		ЗаписатьОшибкуВЖурнал(Строка(ИдентификаторЗапроса),Комментарий);
		
		Возврат; //не подключился 
		
	КонецПопытки;
	
	РезультатЧтенияJSON = СтруктураJSONЗапроса(Ответ_АПИ); 
	Структура_JSON_Ответ =  РезультатЧтенияJSON.Структура_JSON;

	ТелоСообщения 	= Ответ_АПИ.ПолучитьТелоКакСтроку(); 
	СтрокаОтвета  	= Строка(Ответ_АПИ.КодСостояния) + " " + ТелоСообщения;
	СтрокаJSONОтвета= ТелоСообщения;
	
	Если Ответ_АПИ.КодСостояния = 200 Тогда
		//запись в журнал 
		 //записать состояние заказа  , оно изменяется на подтверждение от клиента 
		 Если Структура_JSON_Ответ.Свойство("data") Тогда
		 
			 ОтработатьЗапросНаОбновление(Структура_JSON_Ответ,ВходныеПараметры.Заказ); 	
			 
			 РезультатДанные = СтруктураРезультат();
			 
			 РезультатДанные.ИдентификаторКлиента = Структура_JSON_Ответ.requestId;
			 РезультатДанные.Документ = ВходныеПараметры.Заказ;
			 РезультатДанные.РезультатJson = Структура_JSON_Ответ;
			 
			 ЗаписатьВЖурналЗапросыНаОбновлениеРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,"",,ХранитьПодробностиЛогирования);
			 
			 РезультатОтправки = Истина; 
		 
		 КонецЕсли;
	Иначе 
		//запись в журнал
		
		КодОшибки = Ответ_АПИ.КодСостояния;
		
		Если КодОшибки = 400
			ИЛИ КодОшибки = 403 Тогда   		
			
			ИнформацияОбОшибке = Структура_JSON_Ответ.Message;
			
		ИначеЕсли КодОшибки = 401 Тогда
			
			ИнформацияОбОшибке = "Авторизация не пройдена"; 
		Иначе 
			
			ИнформацияОбОшибке = "Ошибка сервера";
		КонецЕсли;
		
		Комментарий = Строка(КодОшибки) + ":" + ИнформацияОбОшибке; 
		
		РезультатДанные = СтруктураРезультат(); 
		РезультатДанные.РезультатJson = ТелоСообщения; 
		
		ЗаписатьВЖурналЗапросыНаОбновлениеРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,Комментарий,истина,ХранитьПодробностиЛогирования);

	КонецЕсли; 


КонецПроцедуры // ОтправкаПодтвержденияДоЗаказа()

Процедура ОтправкаДатыОтгрузки(ВходныеПараметры,РезультатОтправки,ИдентификаторЗапроса = неопределено) Экспорт

	HTTPСоединение = HTTPСоединение(); 
	Если HTTPСоединение = неопределено Тогда
	
	//записать ошибку в журнал 
	    ЗаписьЖурналаРегистрации("ОшибкаСоединенияОбменЕЭ_POST",УровеньЖурналаРегистрации.Ошибка,,,,);
		Возврат; 
	
	КонецЕсли;
	
	Если ВходныеПараметры.Свойство("Подразделение") Тогда
		
		Подразделение = ВходныеПараметры.Подразделение; 	
	Иначе 
		Подразделение = неопределено; 
	КонецЕсли;

	ДанныеДляОтправкиGetЗапроса = ПолучитьПараметрыМетодаВыгрузки(Подразделение); 
	
	Запрос_АПИ_POST 	= Новый HTTPЗапрос(ДанныеДляОтправкиGetЗапроса.СервисВыгрузки);
	Запрос_АПИ_POST.Заголовки.Вставить("Authorization", ДанныеДляОтправкиGetЗапроса.КлючАвторизации);
	
	СтруктураЗапроса = ЗаполнитьСтруктуруДляОтправкиДатыОтгрузки(ВходныеПараметры);
	
	СтрокаJSON 	= ОтработатьЗаполненнуюСтруктуруОтвета(СтруктураЗапроса);
	Запрос_АПИ_POST.УстановитьТелоИзСтроки(СтрокаJSON);
	
	ИдентификаторЗапроса = Новый УникальныйИдентификатор; 
	
	ХранитьПодробностиЛогирования =  ДанныеДляОтправкиGetЗапроса.ХранитьПодробностиЛогирования; 
	
	Попытка
		
		Ответ_АПИ = HTTPСоединение.ОтправитьДляОбработки(Запрос_АПИ_POST);
		//в журнал запишем что отправили и когда, и потом уже ответ 
		ЗаписатьВЖурналЗапросыНаОбновлениеЗаказов(Строка(ИдентификаторЗапроса),СтрокаJSON,ВходныеПараметры,ХранитьПодробностиЛогирования);
	Исключение
		
		//записать ошибку в журнал
		//записать ошибку в журнал
		Комментарий = "Не удалось отправить запрос на отгрузку. Ошибка!";
		РезультатДанные = СтруктураРезультат();
		ЗаписатьВЖурналЗапросыНаОбновлениеРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,Комментарий,истина,ХранитьПодробностиЛогирования);  
		ЗаписатьОшибкуВЖурнал(Строка(ИдентификаторЗапроса),Комментарий);

		
		Возврат; //не подключился 
		
	КонецПопытки;
	
	РезультатЧтенияJSON = СтруктураJSONЗапроса(Ответ_АПИ); 
	Структура_JSON_Ответ =  РезультатЧтенияJSON.Структура_JSON;

	ТелоСообщения 	= Ответ_АПИ.ПолучитьТелоКакСтроку(); 
	СтрокаОтвета  	= Строка(Ответ_АПИ.КодСостояния) + " " + ТелоСообщения;
	СтрокаJSONОтвета= ТелоСообщения;
	
	Если Ответ_АПИ.КодСостояния = 200 Тогда
		//запись в журнал 
		 //записать состояние заказа  , оно изменяется на подтверждение от клиента 
		 Если Структура_JSON_Ответ.Свойство("data") Тогда
		 
			 ОтработатьЗапросНаОбновление(Структура_JSON_Ответ,ВходныеПараметры.Заказ); 	
			 
			 РезультатДанные = СтруктураРезультат();
			 
			 РезультатДанные.ИдентификаторКлиента = Структура_JSON_Ответ.requestId;
			 РезультатДанные.Документ = ВходныеПараметры.Заказ;
			 РезультатДанные.РезультатJson = Структура_JSON_Ответ;
			 
			 ЗаписатьВЖурналЗапросыНаОбновлениеРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,"",,ХранитьПодробностиЛогирования);
			 
	         РезультатОтправки = Истина; 
		 
		 КонецЕсли;
	Иначе 
		//запись в журнал
		КодОшибки = Ответ_АПИ.КодСостояния;
		
		Если КодОшибки = 400
			ИЛИ КодОшибки = 403 Тогда   		
			
			ИнформацияОбОшибке = Структура_JSON_Ответ.Message;
			
		ИначеЕсли КодОшибки = 401 Тогда
			
			ИнформацияОбОшибке = "Авторизация не пройдена"; 
		Иначе 
			
			ИнформацияОбОшибке = "Ошибка сервера";
		КонецЕсли;
		
		Комментарий = Строка(КодОшибки) + ":" + ИнформацияОбОшибке; 
		
		РезультатДанные = СтруктураРезультат(); 
		РезультатДанные.РезультатJson = ТелоСообщения; 
		РезультатДанные.Документ = ВходныеПараметры.Заказ;
		ЗаписатьВЖурналЗапросыНаОбновлениеРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,Комментарий,истина,ХранитьПодробностиЛогирования);

	КонецЕсли; 


КонецПроцедуры // ОтправкаПодтвержденияДоЗаказа()

Процедура ОтправкаОтменыОтгрузкиЗаказа(ВходныеПараметры,РезультатОтправки,ИдентификаторЗапроса = неопределено) Экспорт

	HTTPСоединение = HTTPСоединение(); 
	Если HTTPСоединение = неопределено Тогда
	
	//записать ошибку в журнал 
	    ЗаписьЖурналаРегистрации("ОшибкаСоединенияОбменЕЭ_POST",УровеньЖурналаРегистрации.Ошибка,,,,);
		Возврат; 
	
	КонецЕсли;
	
	ДанныеДляОтправкиGetЗапроса = ПолучитьПараметрыМетодаВыгрузки(); 
	
	Запрос_АПИ_POST 	= Новый HTTPЗапрос(ДанныеДляОтправкиGetЗапроса.СервисВыгрузки);
	Запрос_АПИ_POST.Заголовки.Вставить("Authorization", ДанныеДляОтправкиGetЗапроса.КлючАвторизации);
	
	СтруктураЗапроса = ЗаполнитьСтруктуруДляОтправкиОтменыОтгрузки(ВходныеПараметры);
	
	СтрокаJSON 	= ОтработатьЗаполненнуюСтруктуруОтвета(СтруктураЗапроса);
	Запрос_АПИ_POST.УстановитьТелоИзСтроки(СтрокаJSON);
	
	ИдентификаторЗапроса = Новый УникальныйИдентификатор; 
	
	ХранитьПодробностиЛогирования  =  ДанныеДляОтправкиGetЗапроса.ХранитьПодробностиЛогирования; 
	
	Попытка
		
		Ответ_АПИ = HTTPСоединение.ОтправитьДляОбработки(Запрос_АПИ_POST);
		//в журнал запишем что отправили и когда, и потом уже ответ 
		ЗаписатьВЖурналЗапросыНаОбновлениеЗаказов(Строка(ИдентификаторЗапроса),СтрокаJSON,ВходныеПараметры,ХранитьПодробностиЛогирования);
	Исключение
		
		//записать ошибку в журнал
		Комментарий = "Не удалось отправить запрос на отгрузку. Ошибка!";
		РезультатДанные = СтруктураРезультат();
		ЗаписатьВЖурналЗапросыНаОбновлениеРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,Комментарий,истина,ХранитьПодробностиЛогирования);  
		ЗаписатьОшибкуВЖурнал(Строка(ИдентификаторЗапроса),Комментарий);
		Возврат; //не подключился 
		
	КонецПопытки;
	
	РезультатЧтенияJSON = СтруктураJSONЗапроса(Ответ_АПИ); 
	Структура_JSON_Ответ =  РезультатЧтенияJSON.Структура_JSON;

	ТелоСообщения 	= Ответ_АПИ.ПолучитьТелоКакСтроку(); 
	СтрокаОтвета  	= Строка(Ответ_АПИ.КодСостояния) + " " + ТелоСообщения;
	СтрокаJSONОтвета= ТелоСообщения;
	
	Если Ответ_АПИ.КодСостояния = 200 Тогда
		//запись в журнал 
		 //записать состояние заказа  , оно изменяется на подтверждение от клиента 
		 Если Структура_JSON_Ответ.Свойство("data") Тогда
		 
			 ОтработатьЗапросНаОбновление(Структура_JSON_Ответ,ВходныеПараметры.Заказ); 	
			 
			 РезультатДанные = СтруктураРезультат();
			 
			 РезультатДанные.ИдентификаторКлиента = Структура_JSON_Ответ.requestId;
			 РезультатДанные.Документ = ВходныеПараметры.Заказ;
			 РезультатДанные.РезультатJson = Структура_JSON_Ответ;
			 
			 ЗаписатьВЖурналЗапросыНаОбновлениеРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,"",,ХранитьПодробностиЛогирования);
			 
	         РезультатОтправки = Истина; 
		 
		 КонецЕсли;
	Иначе 
		//запись в журнал
		КодОшибки = Ответ_АПИ.КодСостояния;
		
		Если КодОшибки = 400
			ИЛИ КодОшибки = 403 Тогда   		
			
			ИнформацияОбОшибке = Структура_JSON_Ответ.Message;
			
		ИначеЕсли КодОшибки = 401 Тогда
			
			ИнформацияОбОшибке = "Авторизация не пройдена"; 
		Иначе 
			
			ИнформацияОбОшибке = "Ошибка сервера";
		КонецЕсли;
		
		Комментарий = Строка(КодОшибки) + ":" + ИнформацияОбОшибке; 
		
		РезультатДанные = СтруктураРезультат(); 
		РезультатДанные.РезультатJson = ТелоСообщения; 
		
		ЗаписатьВЖурналЗапросыНаОбновлениеРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,Комментарий,истина,ХранитьПодробностиЛогирования);

	КонецЕсли; 


КонецПроцедуры // ОтправкаПодтвержденияДоЗаказа()

Процедура ОтправкаПодтвержденияЗаКлиента(ВходныеПараметры,РезультатОтправки,ИдентификаторЗапроса = неопределено) Экспорт

	HTTPСоединение = HTTPСоединение(); 
	Если HTTPСоединение = неопределено Тогда
	
	//записать ошибку в журнал 
	    ЗаписьЖурналаРегистрации("ОшибкаСоединенияОбменЕЭ_POST",УровеньЖурналаРегистрации.Ошибка,,,,);
		Возврат; 
	
	КонецЕсли;
	
	Если ВходныеПараметры.Свойство("Подразделение") Тогда 	
		Подразделение = ВходныеПараметры.Подразделение; 	
	Иначе 
		Подразделение = неопределено; 
	КонецЕсли;

	
	ДанныеДляОтправкиGetЗапроса = ПолучитьПараметрыМетодаВыгрузки(Подразделение); 
	
	Запрос_АПИ_POST 	= Новый HTTPЗапрос(ДанныеДляОтправкиGetЗапроса.СервисВыгрузки);
	Запрос_АПИ_POST.Заголовки.Вставить("Authorization", ДанныеДляОтправкиGetЗапроса.КлючАвторизации);
	
	СтруктураЗапроса = ЗаполнитьСтруктуруДляПодтвержденияЗаКлиента(ВходныеПараметры);
	
	СтрокаJSON 	= ОтработатьЗаполненнуюСтруктуруОтвета(СтруктураЗапроса);
	Запрос_АПИ_POST.УстановитьТелоИзСтроки(СтрокаJSON,КодировкаТекста.UTF8,ИспользованиеByteOrderMark.НеИспользовать);
	
	ИдентификаторЗапроса = Новый УникальныйИдентификатор; 
	
	ХранитьПодробностиЛогирования  =  ДанныеДляОтправкиGetЗапроса.ХранитьПодробностиЛогирования; 
	
	Попытка
		
		Ответ_АПИ = HTTPСоединение.ОтправитьДляОбработки(Запрос_АПИ_POST);
		//в журнал запишем что отправили и когда, и потом уже ответ 
		ЗаписатьВЖурналЗапросыНаОбновлениеЗаказов(Строка(ИдентификаторЗапроса),СтрокаJSON,ВходныеПараметры,ХранитьПодробностиЛогирования);
	Исключение
		
		//записать ошибку в журнал
		Комментарий = "Не удалось отправить запрос на отгрузку. Ошибка!";
		РезультатДанные = СтруктураРезультат();
		ЗаписатьВЖурналЗапросыНаОбновлениеРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,Комментарий,истина,ХранитьПодробностиЛогирования);  
		ЗаписатьОшибкуВЖурнал(Строка(ИдентификаторЗапроса),Комментарий);
		Возврат; //не подключился 
		
	КонецПопытки;
	
	РезультатЧтенияJSON = СтруктураJSONЗапроса(Ответ_АПИ); 
	Структура_JSON_Ответ =  РезультатЧтенияJSON.Структура_JSON;

	ТелоСообщения 	= Ответ_АПИ.ПолучитьТелоКакСтроку(); 
	СтрокаОтвета  	= Строка(Ответ_АПИ.КодСостояния) + " " + ТелоСообщения;
	СтрокаJSONОтвета= ТелоСообщения;
	
	Если Ответ_АПИ.КодСостояния = 200 Тогда
		 
		 Если Структура_JSON_Ответ.Свойство("data") Тогда
		 
			 ОтработатьЗапросНаОбновление(Структура_JSON_Ответ,ВходныеПараметры.Заказ); 	
			 
			 РезультатДанные = СтруктураРезультат();
			 
			 РезультатДанные.ИдентификаторКлиента = Структура_JSON_Ответ.requestId;
			 РезультатДанные.Документ = ВходныеПараметры.Заказ;
			 РезультатДанные.РезультатJson = Структура_JSON_Ответ;
			 
			 ЗаписатьВЖурналЗапросыНаОбновлениеРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,"",,ХранитьПодробностиЛогирования);
			 
	         РезультатОтправки = Истина; 
		 
		 КонецЕсли;
	Иначе 
		//запись в журнал
		КодОшибки = Ответ_АПИ.КодСостояния;
		
		Если КодОшибки = 400
			ИЛИ КодОшибки = 403 Тогда   		
			
			ИнформацияОбОшибке = Структура_JSON_Ответ.Message;
			
		ИначеЕсли КодОшибки = 401 Тогда
			
			ИнформацияОбОшибке = "Авторизация не пройдена"; 
		Иначе 
			
			ИнформацияОбОшибке = "Ошибка сервера";
		КонецЕсли;
		
		Комментарий = Строка(КодОшибки) + ":" + ИнформацияОбОшибке; 
		
		РезультатДанные = СтруктураРезультат(); 
		РезультатДанные.РезультатJson = ТелоСообщения; 
		РезультатДанные.Документ = ВходныеПараметры.Заказ;
		ЗаписатьВЖурналЗапросыНаОбновлениеРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,Комментарий,истина,ХранитьПодробностиЛогирования);

	КонецЕсли; 


КонецПроцедуры // ОтправкаПодтвержденияДоЗаказа()
 
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ЗаполнитьСтруктуруДляОтправкиПодтвержденияТолькоОтгрузкиПоставщика(ВходныеПараметры)

	СтруктураЗапроса =  СформироватьСтруктуруPostЗапроса(Истина); 
	
	Если ВходныеПараметры.Свойство("НомерЗаявки")
		И ЗначениеЗаполнено(ВходныеПараметры.НомерЗаявки) Тогда
		
		СтруктураЗапроса.Data.accountNumber = ВходныеПараметры.НомерЗаявки; 	
		
	КонецЕсли;
	
	Если ВходныеПараметры.Свойство("IDЗаявки")
		И ЗначениеЗаполнено(ВходныеПараметры.IDЗаявки)
		 И НЕ ВходныеПараметры.Свойство("НомерЗаявки") Тогда
		
		СтруктураЗапроса.Data.bxId = ВходныеПараметры.IDЗаявки; 	
		
	КонецЕсли;

	
	Если ВходныеПараметры.Свойство("СтатусЗаказа")
		И ЗначениеЗаполнено(ВходныеПараметры.СтатусЗаказа) Тогда
		
		СтруктураЗапроса.Data.order.StatusId = ВходныеПараметры.СтатусЗаказа; 	
		
	КонецЕсли;
	
	Если ВходныеПараметры.Свойство("Товары")
		И ВходныеПараметры.Товары.Количество() > 0  Тогда
		
		МассивДанных = Новый Массив; 
		
		Для каждого ЭлементМассива Из  ВходныеПараметры.Товары Цикл
			
			СтруктураТовара = СтруктураТовара();
			ЗаполнитьЗначенияСвойств(СтруктураТовара,ЭлементМассива);
			
			СтруктураТовара.XmlId  = ЭлементМассива.IDТовара; 
			СтруктураТовара.quantity = ЭлементМассива.Количество; 
			
			//Если ВходныеПараметры.ФиксированнаяЦена Тогда
			
			СтруктураТовара.price    = ЭлементМассива.Цена;	
			
			//КонецЕсли;
			
			
			МассивДанных.Добавить(СтруктураТовара); 

			
		КонецЦикла;
		
		СтруктураЗапроса.Data.order.confirmedProducts = МассивДанных; 
		
	КонецЕсли;
	                
	Если ВходныеПараметры.Свойство("Дозаказ") 
		И ЗначениеЗаполнено(ВходныеПараметры.Дозаказ) Тогда
		
		СтруктураЗапроса.Data.Вставить("additionalOrder");	
		
	КонецЕсли;  	
	 
	
	Возврат СтруктураЗапроса; 


КонецФункции // ЗаполнитьСтруктуруДляОтправкиПодтвержденияТолькоОтгрузкиПоставщика()

Функция ЗаполнитьСтруктуруДляСозданияДозаказа(ВходныеПараметры)

	СтруктураЗапроса =  СформироватьСтруктуруPostЗапроса(Ложь,Истина); 
	
	Если ВходныеПараметры.Свойство("НомерЗаявки")
		И ЗначениеЗаполнено(ВходныеПараметры.НомерЗаявки) Тогда
		
		СтруктураЗапроса.Data.accountNumber = ВходныеПараметры.НомерЗаявки; 	
		
	КонецЕсли;
	
	Если ВходныеПараметры.Свойство("IDЗаявки")
		И ЗначениеЗаполнено(ВходныеПараметры.IDЗаявки)
		И НЕ ВходныеПараметры.Свойство("НомерЗаявки") Тогда
		
		СтруктураЗапроса.Data.bxId = ВходныеПараметры.IDЗаявки; 	
		
	КонецЕсли;

	
	Если ВходныеПараметры.Свойство("ЖелаемаяДатаОтгрузки")
		И ЗначениеЗаполнено(ВходныеПараметры.ЖелаемаяДатаОтгрузки) Тогда
		
		СтруктураЗапроса.Data.additionalOrder.orderedShipmentDate = ПреобразоватьДатуДляПередачиНаПортал(ВходныеПараметры.ЖелаемаяДатаОтгрузки); 	
		
	КонецЕсли;

	
	Если ВходныеПараметры.Свойство("Комментарий")
		И ЗначениеЗаполнено(ВходныеПараметры.Комментарий) Тогда
		
		СтруктураЗапроса.Data.additionalOrder.comment = ВходныеПараметры.Комментарий; 	
		
	КонецЕсли;
	
	Если ВходныеПараметры.Свойство("ИНН")
		И ЗначениеЗаполнено(ВходныеПараметры.ИНН) Тогда
		
		СтруктураЗапроса.Data.additionalOrder.inn = ВходныеПараметры.ИНН; 	
		
	КонецЕсли;
	
	Если ВходныеПараметры.Свойство("Контрагент")
		И ЗначениеЗаполнено(ВходныеПараметры.Контрагент) Тогда
		
		СтруктураЗапроса.Data.additionalOrder.inn = ВходныеПараметры.Контрагент.ИНН; 	
		
	КонецЕсли;
	
	Если ВходныеПараметры.Свойство("ПунктДоставки")
		И ЗначениеЗаполнено(ВходныеПараметры.ПунктДоставки) Тогда
		
		СтруктураЗапроса.Data.additionalOrder.deliveryAddress 	= ВходныеПараметры.ПунктДоставки.Код; 		
		
	КонецЕсли;


	
	Если ВходныеПараметры.Свойство("Товары")
		И ВходныеПараметры.Товары.Количество() > 0  Тогда
		
		МассивДанных = Новый Массив; 
		
		Для каждого ЭлементМассива Из  ВходныеПараметры.Товары Цикл
			
			СтруктураТовара = СтруктураТовара(истина);
			ЗаполнитьЗначенияСвойств(СтруктураТовара,ЭлементМассива);
			
			СтруктураТовара.XmlId  = ЭлементМассива.IDТовара; 
			СтруктураТовара.quantity = ЭлементМассива.Количество; 
						
			МассивДанных.Добавить(СтруктураТовара); 

			
		КонецЦикла;
		
		СтруктураЗапроса.Data.additionalOrder.orderedProducts = МассивДанных; 
		
	КонецЕсли;
	
	Если ВходныеПараметры.Свойство("ТоварыВНаличии")
		И ВходныеПараметры.ТоварыВНаличии.Количество() > 0  Тогда
		
		МассивДанных = Новый Массив; 
		
		Для каждого ЭлементМассива Из  ВходныеПараметры.ТоварыВНаличии Цикл
			
			СтруктураТовара = СтруктураТовара();
			ЗаполнитьЗначенияСвойств(СтруктураТовара,ЭлементМассива);
			
			СтруктураТовара.XmlId  		= ЭлементМассива.IDТовара; 
			СтруктураТовара.quantity 	= ЭлементМассива.Количество;
			СтруктураТовара.price 		= ЭлементМассива.Цена;
						
			МассивДанных.Добавить(СтруктураТовара); 

			
		КонецЦикла;
		
		СтруктураЗапроса.Data.order.confirmedProducts = МассивДанных; 
		
	КонецЕсли;
	
	Возврат СтруктураЗапроса; 


КонецФункции // ()

Функция ЗаполнитьСтруктуруДляОтправкиСтатусаЗаказа(ВходныеПараметры,ДобавитьТовары = Ложь)

	СтруктураЗапроса =  СформироватьСтруктуруPostЗапросаИзменениеСтатуса(ВходныеПараметры.ОтменаЗаказа,ДобавитьТовары);  
	
	Если ВходныеПараметры.Свойство("НомерЗаявки")
		И ЗначениеЗаполнено(ВходныеПараметры.НомерЗаявки) Тогда
		
		СтруктураЗапроса.Data.accountNumber = ВходныеПараметры.НомерЗаявки; 	
		
	КонецЕсли;
	
	Если ВходныеПараметры.Свойство("IDЗаявки")
		И ЗначениеЗаполнено(ВходныеПараметры.IDЗаявки)
		И НЕ ВходныеПараметры.Свойство("НомерЗаявки") Тогда
		
		СтруктураЗапроса.Data.bxId = ВходныеПараметры.IDЗаявки; 	
		
	КонецЕсли;

	
	Если ВходныеПараметры.Свойство("СтатусЗаказа")
		И ЗначениеЗаполнено(ВходныеПараметры.СтатусЗаказа) Тогда
		
		СтруктураЗапроса.Data.order.StatusId = ВходныеПараметры.СтатусЗаказа; 	
		
	КонецЕсли;
	
	Если ВходныеПараметры.Свойство("КомментарийОтмены")
		И ЗначениеЗаполнено(ВходныеПараметры.КомментарийОтмены) Тогда
		
		СтруктураЗапроса.Data.order.cancelReasonText = ВходныеПараметры.КомментарийОтмены; 	
		
	КонецЕсли;
	
	Если ВходныеПараметры.Свойство("Товары")
		И ВходныеПараметры.Товары.Количество() > 0 
		И СтруктураЗапроса.Data.order.Свойство("confirmedProducts") Тогда
		
		МассивДанных = Новый Массив; 
		
		Для каждого ЭлементМассива Из  ВходныеПараметры.Товары Цикл
			
			СтруктураТовара = СтруктураТовара();
			ЗаполнитьЗначенияСвойств(СтруктураТовара,ЭлементМассива);
			
			СтруктураТовара.XmlId  		= ЭлементМассива.IDТовара; 
			СтруктураТовара.quantity 	= ЭлементМассива.Количество;
			СтруктураТовара.price 		= ЭлементМассива.Цена;
			
			МассивДанных.Добавить(СтруктураТовара); 
			
			
		КонецЦикла;
		
		СтруктураЗапроса.Data.order.confirmedProducts = МассивДанных; 
		
	КонецЕсли;
	
	Если ВходныеПараметры.Свойство("ТоварыДозаказа")
		И ВходныеПараметры.ТоварыДозаказа.Количество() > 0  Тогда
		
		МассивДанных = Новый Массив; 
		
		Для каждого ЭлементМассива Из  ВходныеПараметры.ТоварыДозаказа Цикл
			
			СтруктураТовара = СтруктураТовара();
			ЗаполнитьЗначенияСвойств(СтруктураТовара,ЭлементМассива);
			
			СтруктураТовара.XmlId  = ЭлементМассива.IDТовара; 
			СтруктураТовара.quantity = ЭлементМассива.Количество; 
			
			//СтруктураТовара.price    = ЭлементМассива.Цена;	
				
			
			МассивДанных.Добавить(СтруктураТовара); 
			
			
		КонецЦикла;
		
		СтруктураЗапроса.Data.Вставить("additionalOrder",Новый Структура); 
		СтруктураЗапроса.Data.additionalOrder.Вставить("confirmedProducts",Новый Массив); 
		СтруктураЗапроса.Data.additionalOrder.confirmedProducts = МассивДанных; 
		
	КонецЕсли;



		
	Возврат СтруктураЗапроса; 


КонецФункции // ЗаполнитьСтруктуруДляОтправкиПодтвержденияТолькоОтгрузкиПоставщика()

Функция ЗаполнитьСтруктуруДляПодтвержденияОтменыДоЗаказа(ВходныеПараметры)

	СтруктураЗапроса =  СформироватьСтруктуруPostЗапросаПодтверждениеДоЗаказа();  
	
	Если ВходныеПараметры.Свойство("НомерЗаявки")
		И ЗначениеЗаполнено(ВходныеПараметры.НомерЗаявки) Тогда
		
		СтруктураЗапроса.Data.accountNumber = ВходныеПараметры.НомерЗаявки; 	
		
	КонецЕсли;
	
	Если ВходныеПараметры.Свойство("IDЗаявки")
		И ЗначениеЗаполнено(ВходныеПараметры.IDЗаявки)
		И НЕ ВходныеПараметры.Свойство("НомерЗаявки") Тогда
		
		СтруктураЗапроса.Data.bxId = ВходныеПараметры.IDЗаявки; 	
		
	КонецЕсли;

	
	Если ВходныеПараметры.Свойство("СтатусДоЗаказа")
		И ЗначениеЗаполнено(ВходныеПараметры.СтатусДоЗаказа) Тогда
		
		СтруктураЗапроса.Data.additionalOrder.StatusId = ВходныеПараметры.СтатусДоЗаказа; 	
		
	КонецЕсли;
	
		
	Возврат СтруктураЗапроса; 


КонецФункции // ЗаполнитьСтруктуруДляОтправкиПодтвержденияТолькоОтгрузкиПоставщика()

Функция ЗаполнитьСтруктуруДляОтправкиДатыОтгрузки(ВходныеПараметры)

	СтруктураЗапроса =  СформироватьСтруктуруPostЗапросаДатыОтгрузок(ВходныеПараметры.Свойство("ДатаОтгрузкиДозаказа"),ВходныеПараметры.Свойство("МетодДоставки"),ВходныеПараметры.Свойство("ДатаОтгрузкиЗаказа"));  
	
	Если ВходныеПараметры.Свойство("НомерЗаявки")
		И ЗначениеЗаполнено(ВходныеПараметры.НомерЗаявки) Тогда
		
		СтруктураЗапроса.Data.accountNumber = ВходныеПараметры.НомерЗаявки; 	
		
	КонецЕсли;
	
	Если ВходныеПараметры.Свойство("IDЗаявки")
		И ЗначениеЗаполнено(ВходныеПараметры.IDЗаявки)
		И НЕ ВходныеПараметры.Свойство("НомерЗаявки") Тогда
		
		СтруктураЗапроса.Data.bxId = ВходныеПараметры.IDЗаявки; 	
		
	КонецЕсли;

	
	Если ВходныеПараметры.Свойство("ДатаОтгрузкиЗаказа")
		И ЗначениеЗаполнено(ВходныеПараметры.ДатаОтгрузкиЗаказа) Тогда
		
		СтруктураЗапроса.Data.order.distrShipmentDate = ПреобразоватьДатуДляПередачиНаПортал(ВходныеПараметры.ДатаОтгрузкиЗаказа); 	
		
	КонецЕсли;
	
	Если ВходныеПараметры.Свойство("ДатаОтгрузкиДозаказа")
		И ЗначениеЗаполнено(ВходныеПараметры.ДатаОтгрузкиДозаказа) Тогда
		
		СтруктураЗапроса.Data.order.eeeShipmentDate = ПреобразоватьДатуДляПередачиНаПортал(ВходныеПараметры.ДатаОтгрузкиДозаказа); 	
		
	КонецЕсли;
	
	Если ВходныеПараметры.Свойство("МетодДоставки")
		И ЗначениеЗаполнено(ВходныеПараметры.МетодДоставки) Тогда
		
		СтруктураЗапроса.Data.order.shipmentMethod = ВходныеПараметры.МетодДоставки; 	
		
	КонецЕсли;


		
	Возврат СтруктураЗапроса; 


КонецФункции // ЗаполнитьСтруктуруДляОтправкиПодтвержденияТолькоОтгрузкиПоставщика()

Функция ЗаполнитьСтруктуруДляОтправкиОтменыОтгрузки(ВходныеПараметры)

	СтруктураЗапроса =  СформироватьСтруктуруPostЗапросаОтменыОтгрузки(ВходныеПараметры.Свойство("ОтменаЗаказа"),ВходныеПараметры.Свойство("ОтменаДоЗаказа"));  
	
	Если ВходныеПараметры.Свойство("НомерЗаявки")
		И ЗначениеЗаполнено(ВходныеПараметры.НомерЗаявки) Тогда
		
		СтруктураЗапроса.Data.accountNumber = ВходныеПараметры.НомерЗаявки; 	
		
	КонецЕсли;
	
	Если ВходныеПараметры.Свойство("IDЗаявки")
		И ЗначениеЗаполнено(ВходныеПараметры.IDЗаявки)
		 И НЕ ВходныеПараметры.Свойство("НомерЗаявки") Тогда
		
		СтруктураЗапроса.Data.bxId = ВходныеПараметры.IDЗаявки; 	
		
	КонецЕсли;

	
	Если ВходныеПараметры.Свойство("ОтменаЗаказа")
		//И ЗначениеЗаполнено(ВходныеПараметры.ОтменаЗаказа) 
		И ВходныеПараметры.ОтменаЗаказа Тогда
		
		СтруктураЗапроса.Data.order.distrShipmentStatus = "C"; 
		СтруктураЗапроса.Data.order.distrShipmentCancelText = ВходныеПараметры.КомментарийОтменаЗаказа;
		СтруктураЗапроса.Data.order.distrShipmentCancelComment = ВходныеПараметры.ПричинаОтменаЗаказа;
		
	КонецЕсли;
	
	Если ВходныеПараметры.Свойство("ОтменаДоЗаказа")
		И ВходныеПараметры.ОтменаДоЗаказа Тогда
		
		СтруктураЗапроса.Data.order.eeeShipmentStatus = "C"; 
		СтруктураЗапроса.Data.order.eeeShipmentCancelText = ВходныеПараметры.КомментарийОтменаДоЗаказа;
		СтруктураЗапроса.Data.order.eeeShipmentCancelComment = ВходныеПараметры.ПричинаОтменаДоЗаказа;	
		
	КонецЕсли;

		
	Возврат СтруктураЗапроса; 


КонецФункции // ЗаполнитьСтруктуруДляОтправкиПодтвержденияТолькоОтгрузкиПоставщика()


Процедура ОтправкаДанныхПоОстаткам(ВходныеПараметры,РезультатОтправки,ИдентификаторЗапроса = неопределено) Экспорт

	HTTPСоединение = HTTPСоединение(); 
	Если HTTPСоединение = неопределено Тогда
	
	//записать ошибку в журнал 
	    ЗаписьЖурналаРегистрации("ОшибкаСоединенияОбменОстатков_POST",УровеньЖурналаРегистрации.Ошибка,,,,);
		Возврат; 
	
	КонецЕсли;
	
	ДанныеДляОтправкиGetЗапроса = ПолучитьПараметрыМетодаВыгрузки(); 
	
	Запрос_АПИ_POST 	= Новый HTTPЗапрос(ДанныеДляОтправкиGetЗапроса.СервисВыгрузкиОстатков);
	Запрос_АПИ_POST.Заголовки.Вставить("Authorization", ДанныеДляОтправкиGetЗапроса.КлючАвторизации);
	
	СтруктураЗапроса = ЗаполнитьСтруктуруДляОтправкиОстатков(ВходныеПараметры);
	
	СтрокаJSON 	= ОтработатьЗаполненнуюСтруктуруОтвета(СтруктураЗапроса);
	Запрос_АПИ_POST.УстановитьТелоИзСтроки(СтрокаJSON);
	
	ИдентификаторЗапроса = Новый УникальныйИдентификатор;	
	
	ХранитьПодробностиЛогирования = ДанныеДляОтправкиGetЗапроса.ХранитьПодробностиЛогирования; 
	
	Попытка
		
		Ответ_АПИ = HTTPСоединение.ОтправитьДляОбработки(Запрос_АПИ_POST);
		//в журнал запишем что отправили и когда, и потом уже ответ 
		ЗаписатьВЖурналЗапросыНаОбновлениеЗаказов(Строка(ИдентификаторЗапроса),СтрокаJSON,ВходныеПараметры,ХранитьПодробностиЛогирования);
	Исключение
		
		//записать ошибку в журнал
		//записать ошибку в журнал
		Комментарий = "Не удалось отправить запрос на обновление остатков. Ошибка!";
		РезультатДанные = СтруктураРезультат();
		ЗаписатьВЖурналЗапросыНаОбновлениеРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,Комментарий,истина,ХранитьПодробностиЛогирования);  
		ЗаписатьОшибкуВЖурнал(Строка(ИдентификаторЗапроса),Комментарий);

		
		Возврат; //не подключился 
		
	КонецПопытки;
	
	РезультатЧтенияJSON = СтруктураJSONЗапроса(Ответ_АПИ); 
	Структура_JSON_Ответ =  РезультатЧтенияJSON.Структура_JSON;

	ТелоСообщения 	= Ответ_АПИ.ПолучитьТелоКакСтроку(); 
	СтрокаОтвета  	= Строка(Ответ_АПИ.КодСостояния) + " " + ТелоСообщения;
	СтрокаJSONОтвета= ТелоСообщения;
	
	Если Ответ_АПИ.КодСостояния = 200 Тогда
		//запись в журнал 
		 
		 Если Структура_JSON_Ответ.Свойство("data") Тогда   
			  	
			 
			 РезультатДанные = СтруктураРезультат();
			 
			 РезультатДанные.ИдентификаторКлиента = Структура_JSON_Ответ.requestId;
			 РезультатДанные.Документ = "";
			 РезультатДанные.РезультатJson = Структура_JSON_Ответ;
			 
			 ТекстОшибкиЗагрузки = ""; 
			 
			 Если Структура_JSON_Ответ.Свойство("result")
				 И Структура_JSON_Ответ.result = "warning" Тогда
			 
			 	ТекстОшибкиЗагрузки =  Структура_JSON_Ответ.message; 
				
			КонецЕсли;
			
			ЭтоОшибка = ?(ЗначениеЗаполнено(ТекстОшибкиЗагрузки),Истина,Ложь); 
			
			ЗаписатьВЖурналЗапросыНаОбновлениеРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,ТекстОшибкиЗагрузки,ЭтоОшибка,ХранитьПодробностиЛогирования);
			
			РезультатОтправки = Истина;
			
			Если ЭтоОшибка Тогда
			
				ЗаписатьОшибкуВЖурнал(Строка(ИдентификаторЗапроса),ТекстОшибкиЗагрузки,Структура_JSON_Ответ.requestId);	
			
			КонецЕсли;
			
			МассивНеПереданные = Новый Массив;  			
			
			Если ТипЗнч(Структура_JSON_Ответ.data) = Тип("Структура") 
				И Структура_JSON_Ответ.data.Свойство("notFound")
				И Структура_JSON_Ответ.data.notFound.Свойство("xmlId") Тогда
				
				Для каждого ЭлементМассива Из Структура_JSON_Ответ.data.notFound.xmlId Цикл
					
					Номенклатура = НайтиТоварПоКодуТовара(ЭлементМассива);
					
					Если  НЕ ЗначениеЗаполнено(Номенклатура) Тогда
						
						Продолжить; 
						
					КонецЕсли;
					
					МассивНеПереданные.Добавить(Номенклатура); 
					
				КонецЦикла; 				
				
			КонецЕсли;
			
			ЗаписатьДанныеВРегистрПереданныеОстатки(ВходныеПараметры,ИдентификаторЗапроса,МассивНеПереданные); 
		 
		 КонецЕсли;
	Иначе 
		//запись в журнал
		КодОшибки = Ответ_АПИ.КодСостояния;
		
		Если КодОшибки = 400
			ИЛИ КодОшибки = 403 Тогда   		
			
			ИнформацияОбОшибке = Структура_JSON_Ответ.Message;
			
		ИначеЕсли КодОшибки = 401 Тогда
			
			ИнформацияОбОшибке = "Авторизация не пройдена"; 
		Иначе 
			
			ИнформацияОбОшибке = "Ошибка сервера";
		КонецЕсли;
		
		Комментарий = Строка(КодОшибки) + ":" + ИнформацияОбОшибке; 
		
		РезультатДанные = СтруктураРезультат(); 
		РезультатДанные.РезультатJson = ТелоСообщения; 
		
		ЗаписатьВЖурналЗапросыНаОбновлениеРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,Комментарий,истина,ХранитьПодробностиЛогирования);

	КонецЕсли; 


КонецПроцедуры // ОтправкаПодтвержденияДоЗаказа()

Процедура ОтправкаДанныхПоОстаткамЦО(ВходныеПараметры,РезультатОтправки,ИдентификаторЗапроса = неопределено,МассивОшибок) Экспорт
	
	HTTPСоединение = HTTPСоединение(); 
	Если HTTPСоединение = неопределено Тогда
		
		//записать ошибку в журнал 
		ЗаписьЖурналаРегистрации("ОшибкаСоединенияОбменОстатков_POST",УровеньЖурналаРегистрации.Ошибка,,,,);
		Возврат; 
		
	КонецЕсли;
	Если ТипЗнч(МассивОшибок) <> Тип("Массив") Тогда
	
		МассивОшибок = Новый Массив;	
	
	КонецЕсли;
	 
	
	ДанныеДляОтправкиGetЗапроса = ПолучитьПараметрыМетодаВыгрузки(); 
	
	Запрос_АПИ_POST 	= Новый HTTPЗапрос(ДанныеДляОтправкиGetЗапроса.СервисВыгрузкиОстатковОсновной);
	Запрос_АПИ_POST.Заголовки.Вставить("Authorization", ДанныеДляОтправкиGetЗапроса.КлючАвторизации);
	
	СтруктураЗапроса = ЗаполнитьСтруктуруДляОтправкиОстатковЦО(ВходныеПараметры,ТекущаяДатаСеанса());
	
	СтрокаJSON 	= ОтработатьЗаполненнуюСтруктуруОтвета(СтруктураЗапроса);
	Запрос_АПИ_POST.УстановитьТелоИзСтроки(СтрокаJSON);
	
	ИдентификаторЗапроса = Строка(ВходныеПараметры.ИдентификаторЗапроса);  
	
	ХранитьПодробностиЛогирования = ДанныеДляОтправкиGetЗапроса.ХранитьПодробностиЛогирования; 
		
	Попытка
		
		Ответ_АПИ = HTTPСоединение.ОтправитьДляОбработки(Запрос_АПИ_POST);
		 
		
	Исключение
		
		//записать ошибку в журнал
		//записать ошибку в журнал
		Комментарий = "Не удалось отправить запрос на обновление остатков ЦО. Ошибка!";
		
		РезультатДанные = Новый Структура("РезультатJson,ИдентификаторОчереди");
		
		ЗаписатьВЖурналЗапросыНаОбновлениеВОчереди(Строка(ИдентификаторЗапроса),"",СтрокаJSON,ВходныеПараметры,ХранитьПодробностиЛогирования);
		ЗаписатьВЖурналЗапросыНаОбновлениеВОчередиРезультат(Строка(ИдентификаторЗапроса),"",РезультатДанные,Комментарий,истина,,ХранитьПодробностиЛогирования);  
		ЗаписатьОшибкуВЖурнал(Строка(ИдентификаторЗапроса),Комментарий);
		
		//ТемаПисьма = "Ошибка отправки остатков на портал из SNL"; 
		//ТекстПисьма = "Не удалось отправить запрос на обновление остатков ЦО. Ошибка подключения по http. Проверьте подключение! "; 
		//СформироватьВнутреннееУведомлениеОбОшибке(ТекстПисьма,ТемаПисьма,"Ошибка отправки остатков на портал из SNL");  
		
		МассивОшибок.Добавить("Не удалось отправить запрос на обновление остатков ЦО из SNL. Ошибка подключения по http. Проверьте подключение!"); 
		
		Возврат; //не подключился 
		
	КонецПопытки;
	
	РезультатЧтенияJSON = СтруктураJSONЗапроса(Ответ_АПИ); 
	Структура_JSON_Ответ =  РезультатЧтенияJSON.Структура_JSON;
	
	ТелоСообщения 	= Ответ_АПИ.ПолучитьТелоКакСтроку(); 
	СтрокаОтвета  	= Строка(Ответ_АПИ.КодСостояния) + " " + ТелоСообщения;
	СтрокаJSONОтвета= ТелоСообщения;
	
	Если Ответ_АПИ.КодСостояния = 200 Тогда
				
		Если Структура_JSON_Ответ.Свойство("result") Тогда 
				
			
			ТекстОшибкиЗагрузки = ""; 
			
			Если Структура_JSON_Ответ.Свойство("result")
				И Структура_JSON_Ответ.result = "error" Тогда
				
				ТекстОшибкиЗагрузки =  Структура_JSON_Ответ.message; 
				
			КонецЕсли;
			
			ЭтоОшибка = ?(ЗначениеЗаполнено(ТекстОшибкиЗагрузки),Истина,Ложь);
			
			РезультатДанные = Новый Структура("РезультатJson,ИдентификаторОчереди,МассивДанных",,""); 
			
			ИдентификаторКлиента = Структура_JSON_Ответ.requestId;			
			
			РезультатДанные.РезультатJson = Структура_JSON_Ответ;
			РезультатДанные.МассивДанных = ВходныеПараметры.Товары; 
			
			Если НЕ ЭтоОшибка  Тогда
				
				//РезультатДанные.ИдентификаторОчереди = Структура_JSON_Ответ.data.jobId;
				
			КонецЕсли;
			
			ЗаписатьВЖурналЗапросыНаОбновлениеВОчереди(Строка(ИдентификаторЗапроса),ИдентификаторКлиента,СтрокаJSON,ВходныеПараметры,ХранитьПодробностиЛогирования);
			
			ЗаписатьВЖурналЗапросыНаОбновлениеВОчередиРезультат(Строка(ИдентификаторЗапроса),ИдентификаторКлиента,РезультатДанные,ТекстОшибкиЗагрузки,ЭтоОшибка,,ХранитьПодробностиЛогирования);
			
						
			Если ЭтоОшибка Тогда
				
				ЗаписатьОшибкуВЖурнал(Строка(ИдентификаторЗапроса),ТекстОшибкиЗагрузки,Структура_JSON_Ответ.requestId);	
				
				//ТемаПисьма = "Ошибка отработки очереди по остаткам на портале"; 
				//ТекстПисьма = "Получена ошибка об обработке очереди на портале. Идентификатор клиента:" + ИдентификаторКлиента ; 
				//
				//СформироватьВнутреннееУведомлениеОбОшибке(ТекстПисьма,ТемаПисьма,"Ошибка отработки очереди по остаткам на портале");
				
				МассивОшибок.Добавить("Получена ошибка при отправке пакета по остаткам из SNL. Идентификатор клиента:" + ИдентификаторКлиента);
				
			КонецЕсли;
		Иначе 
			
			ЗаписатьВЖурналЗапросыНаОбновлениеВОчереди(Строка(ИдентификаторЗапроса),"",СтрокаJSON,ВходныеПараметры,ХранитьПодробностиЛогирования);
			
			РезультатДанные = Новый Структура("РезультатJson,ИдентификаторОчереди",,""); 			
					
			РезультатДанные.РезультатJson = Структура_JSON_Ответ;
			
			ЗаписатьВЖурналЗапросыНаОбновлениеВОчередиРезультат(Строка(ИдентификаторЗапроса),"",РезультатДанные,"Ответ по структуре не соответствует ожидаемой",Истина,,ХранитьПодробностиЛогирования);
		КонецЕсли;
		
		РезультатОтправки = Истина;
	Иначе 
		//запись в журнал
		
		ЗаписатьВЖурналЗапросыНаОбновлениеВОчереди(Строка(ИдентификаторЗапроса),"",СтрокаJSON,ВходныеПараметры,ХранитьПодробностиЛогирования);
		
		КодОшибки = Ответ_АПИ.КодСостояния;
		
		Если КодОшибки = 400
			ИЛИ КодОшибки = 403 Тогда   		
			
			ИнформацияОбОшибке = Структура_JSON_Ответ.Message;
			
		ИначеЕсли КодОшибки = 401 Тогда
			
			ИнформацияОбОшибке = "Авторизация не пройдена"; 
		Иначе 
			
			ИнформацияОбОшибке = "Ошибка сервера";
		КонецЕсли;
		
		Комментарий = Строка(КодОшибки) + ":" + ИнформацияОбОшибке; 
		
		РезультатДанные = Новый Структура("РезультатJson,ИдентификаторОчереди",,""); 
		РезультатДанные.РезультатJson = ТелоСообщения; 
		
		ЗаписатьВЖурналЗапросыНаОбновлениеВОчередиРезультат(Строка(ИдентификаторЗапроса),"",РезультатДанные,Комментарий,истина,,ХранитьПодробностиЛогирования);
		
		//ТемаПисьма = "Ошибка отправки остатков на портал из SNL"; 
		//ТекстПисьма = "Не удалось отправить запрос на обновление остатков ЦО.  Код ошибки " + Комментарий ; 
		//
		//СформироватьВнутреннееУведомлениеОбОшибке(ТекстПисьма,ТемаПисьма,"Ошибка отправки остатков на портал из SNL"); 
		МассивОшибок.Добавить("Не удалось отправить запрос на обновление остатков ЦО из SNL.  Код ошибки " + Комментарий);
	КонецЕсли; 
	
	
КонецПроцедуры // ОтправкаПодтвержденияДоЗаказа()

Процедура ОтработкаОтправленныхДанныхПоОстаткамЦО(ВходныеПараметры,РезультатОтправки,МассивОшибок) Экспорт
	
	HTTPСоединение = HTTPСоединение(); 
	Если HTTPСоединение = неопределено Тогда
		
		//записать ошибку в журнал 
		ЗаписьЖурналаРегистрации("ОшибкаСоединенияОбменОстатков_POST",УровеньЖурналаРегистрации.Ошибка,,,,);
		Возврат; 
		
	КонецЕсли;
	
	ДанныеДляОтправкиGetЗапроса = ПолучитьПараметрыМетодаВыгрузки(); 
	
	Запрос_АПИ_POST 	= Новый HTTPЗапрос(ДанныеДляОтправкиGetЗапроса.СервисПолученияДанныхОчередиОстатки);
	Запрос_АПИ_POST.Заголовки.Вставить("Authorization", ДанныеДляОтправкиGetЗапроса.КлючАвторизации);
	
	СтруктураЗапроса = ЗаполнитьСтруктуруДляПолученияДанныхОчереди(ВходныеПараметры);
	
	СтрокаJSON 	= ОтработатьЗаполненнуюСтруктуруОтвета(СтруктураЗапроса);
	Запрос_АПИ_POST.УстановитьТелоИзСтроки(СтрокаJSON);
	
	ИдентификаторЗапроса = Новый УникальныйИдентификатор;
	
	ХранитьПодробностиЛогирования = ДанныеДляОтправкиGetЗапроса.ХранитьПодробностиЛогирования; 
	
	Попытка
		
		Ответ_АПИ = HTTPСоединение.ОтправитьДляОбработки(Запрос_АПИ_POST);
				
	Исключение
		
		Комментарий = "Не удалось отправить запрос на получение данных по очереди (Остатки). Ошибка!";
		
		РезультатДанные = Новый Структура("РезультатJson,ИдентификаторОчереди",,""); 
		
		ЗаписатьВЖурналЗапросыНаОбновлениеВОчереди(Строка(ИдентификаторЗапроса),"",СтрокаJSON,ВходныеПараметры,ХранитьПодробностиЛогирования);
		ЗаписатьВЖурналЗапросыНаОбновлениеВОчередиРезультат(Строка(ИдентификаторЗапроса),"",РезультатДанные,Комментарий,истина,,ХранитьПодробностиЛогирования);  
		ЗаписатьОшибкуВЖурнал(Строка(ИдентификаторЗапроса),Комментарий);
		
		ТекстОшибки = "Не удалось отправить запрос на отработку очереди по остаткам ЦО из SNL. Ошибка подключения по http. Проверьте подключение! ";
		МассивОшибок.Добавить(ТекстОшибки); 
		
		Возврат; //не подключился 
		
	КонецПопытки;
	
	РезультатЧтенияJSON = СтруктураJSONЗапроса(Ответ_АПИ); 
	Структура_JSON_Ответ =  РезультатЧтенияJSON.Структура_JSON;
	
	ТелоСообщения 	= Ответ_АПИ.ПолучитьТелоКакСтроку(); 
	СтрокаОтвета  	= Строка(Ответ_АПИ.КодСостояния) + " " + ТелоСообщения;
	СтрокаJSONОтвета= ТелоСообщения;
	
	Если Ответ_АПИ.КодСостояния = 200 Тогда
				
		РезультатДанные = Новый Структура("РезультатJson,ИдентификаторОчереди",,""); 
		
		ИдентификаторКлиента = Структура_JSON_Ответ.requestId;			
		
		РезультатДанные.РезультатJson = Структура_JSON_Ответ;
		РезультатДанные.ИдентификаторОчереди =  ВходныеПараметры.ИдентификаторКлиента; 
		
		ЗаписатьВЖурналЗапросыНаОбновлениеВОчереди(Строка(ИдентификаторЗапроса),ИдентификаторКлиента,СтрокаJSON,ВходныеПараметры,ХранитьПодробностиЛогирования);

		Если Структура_JSON_Ответ.Свойство("data") Тогда 
			
			ЗаписатьВЖурналЗапросыНаОбновлениеВОчередиРезультат(Строка(ИдентификаторЗапроса),ИдентификаторКлиента,РезультатДанные,,,);
			//++Данилова Е.В. 20.05.2026 без задачи сбоорй в обмене 
			Если  Структура_JSON_Ответ.data.Свойство("result") Тогда  
				//--Данилова Е.В. 20.05.2026 
				Если Структура_JSON_Ответ.data.result = "queued" Тогда     //пока не отработано  
					
					РезультатДанныеОчереди = неопределено;  //не перезаписываем
					ЗаписатьВЖурналЗапросыНаОбновлениеВОчередиРезультат(ВходныеПараметры.ИдентификаторЗапроса,ВходныеПараметры.ИдентификаторКлиента,РезультатДанныеОчереди,"В обработке",,,ХранитьПодробностиЛогирования); 
					
				ИначеЕсли 	Структура_JSON_Ответ.data.result = "success" 
					ИЛИ Структура_JSON_Ответ.data.result = "warning" Тогда			 			
					
					
					РезультатДанныеОчереди = Неопределено; 
					ЗаписатьВЖурналЗапросыНаОбновлениеВОчередиРезультат(ВходныеПараметры.ИдентификаторЗапроса,ВходныеПараметры.ИдентификаторКлиента,РезультатДанныеОчереди,"",ЛОЖЬ,Истина,ХранитьПодробностиЛогирования);
					
					МассивНеПереданные = Новый Массив;
					
					Если Структура_JSON_Ответ.data.Свойство("data")
						И Структура_JSON_Ответ.data.data.Свойство("notFound")
						И Структура_JSON_Ответ.data.data.notFound.Свойство("xmlId") Тогда
						
						Для каждого ЭлементМассива Из Структура_JSON_Ответ.data.data.notFound.xmlId Цикл
							
							Номенклатура = НайтиТоварПоКодуТовара(ЭлементМассива);
							
							Если  НЕ ЗначениеЗаполнено(Номенклатура) Тогда
								
								Продолжить; 
								
							КонецЕсли;
							
							МассивНеПереданные.Добавить(Номенклатура); 
							
						КонецЦикла; 				
						
						ЭтоОшибка = МассивНеПереданные.Количество() > 0; 
						
						ТекстОшибкиЗагрузки = "Не найдены товары:"  + СтрСоединить(Структура_JSON_Ответ.data.data.notFound.xmlId,","); 
						Если ЭтоОшибка Тогда
							
							ЗаписатьОшибкуВЖурнал(Строка(ИдентификаторЗапроса),ТекстОшибкиЗагрузки,ВходныеПараметры.ИдентификаторКлиента);							
							
							ТекстОшибки = "При отправке данных по остаткам на портал возникли ошибки." + ТекстОшибкиЗагрузки;
							МассивОшибок.Добавить(ТекстОшибки);
							
						КонецЕсли;
						
						
					КонецЕсли;
					
					
					ЗаписатьДанныеВРегистрПереданныеОстаткиЦО(ВходныеПараметры,ВходныеПараметры.ИдентификаторЗапроса,МассивНеПереданные);
					
				ИначеЕсли 	Структура_JSON_Ответ.data.result = "error"  Тогда
					
					ТекстОшибкиЗагрузки =  Структура_JSON_Ответ.data.message;
					
					РезультатДанныеОчереди = неопределено; 
					
					ЗаписатьВЖурналЗапросыНаОбновлениеВОчередиРезультат(ВходныеПараметры.ИдентификаторЗапроса,ВходныеПараметры.ИдентификаторКлиента,РезультатДанныеОчереди,"Ошибка отработки очереди " + ТекстОшибкиЗагрузки,истина,,ХранитьПодробностиЛогирования);
					
					ЗаписатьОшибкуВЖурнал(Строка(ИдентификаторЗапроса),"Ошибка отработки очереди",Структура_JSON_Ответ.requestId);
				Иначе 
					
					РезультатДанныеОчереди = неопределено; 
					
					ЗаписатьВЖурналЗапросыНаОбновлениеВОчередиРезультат(ВходныеПараметры.ИдентификаторЗапроса,ВходныеПараметры.ИдентификаторКлиента,РезультатДанныеОчереди,"Нераспознанный результат",истина,,ХранитьПодробностиЛогирования);
					
					ЗаписатьОшибкуВЖурнал(Строка(ИдентификаторЗапроса),"Ошибка отработки очереди",Структура_JSON_Ответ.requestId);
					
					
				КонецЕсли;
				//++Данилова Е.В. 20.05.2026 без задачи сборй в обмене 
			Иначе 
				РезультатДанныеОчереди = неопределено; 
				
				ЗаписатьВЖурналЗапросыНаОбновлениеВОчередиРезультат(ВходныеПараметры.ИдентификаторЗапроса,ВходныеПараметры.ИдентификаторКлиента,РезультатДанныеОчереди,"Нераспознанный результат",истина,,ХранитьПодробностиЛогирования);
				
				ЗаписатьОшибкуВЖурнал(Строка(ИдентификаторЗапроса),"Ошибка отработки очереди",Структура_JSON_Ответ.requestId);
				
			КонецЕсли; 
			//--Данилова Е.В. 20.05.2026 
		Иначе 
						
			РезультатДанные = Новый Структура("РезультатJson,ИдентификаторОчереди",,""); 			
					
			РезультатДанные.РезультатJson = Структура_JSON_Ответ;
			
			ЗаписатьВЖурналЗапросыНаОбновлениеВОчередиРезультат(Строка(ИдентификаторЗапроса),ИдентификаторКлиента,РезультатДанные,"Ответ по структуре не соответствует ожидаемой",Истина,,ХранитьПодробностиЛогирования);

		КонецЕсли;
		
		РезультатОтправки = Истина;
	Иначе 
		//запись в журнал
		ЗаписатьВЖурналЗапросыНаОбновлениеВОчереди(Строка(ИдентификаторЗапроса),"",СтрокаJSON,ВходныеПараметры,ХранитьПодробностиЛогирования);
		
		КодОшибки = Ответ_АПИ.КодСостояния;
		
		Если КодОшибки = 400
			ИЛИ КодОшибки = 403 Тогда   		
			
			ИнформацияОбОшибке = СтрокаJSONОтвета;
			
		ИначеЕсли КодОшибки = 401 Тогда
			
			ИнформацияОбОшибке = "Авторизация не пройдена"; 
		Иначе 
			
			ИнформацияОбОшибке = "Ошибка сервера";
		КонецЕсли;
		
		Комментарий = Строка(КодОшибки) + ":" + ИнформацияОбОшибке; 
		
		РезультатДанные = Новый Структура("РезультатJson,ИдентификаторОчереди",,""); 
		РезультатДанные.РезультатJson = ТелоСообщения; 
		
		ЗаписатьВЖурналЗапросыНаОбновлениеВОчередиРезультат(Строка(ИдентификаторЗапроса),"",РезультатДанные,Комментарий,истина,,ХранитьПодробностиЛогирования);
		
		
		ТекстОшибки = "Не удалось отправить запрос на отработку очереди по остаткам ЦО из SNL." + ИнформацияОбОшибке;
		МассивОшибок.Добавить(ТекстОшибки);
		
	КонецЕсли; 
	
	
КонецПроцедуры // ОтправкаПодтвержденияДоЗаказа()

Функция ЗаполнитьСтруктуруДляОтправкиОстатков(ВходныеПараметры)

	СтруктураЗапроса =  СформироватьСтруктуруPostЗапросаОстаткиТоваров();   
	
	
	Если ВходныеПараметры.Свойство("IDПользователя")
		И ЗначениеЗаполнено(ВходныеПараметры.IDПользователя) Тогда 		
		
		СтруктураЗапроса.Data.user = ВходныеПараметры.IDПользователя; 	
		
	КонецЕсли;
	
	Если ВходныеПараметры.Свойство("Товары")
		И ВходныеПараметры.Товары.Количество() > 0 Тогда 		
		МассивТоваров = Новый Массив; 
		Для каждого ЭлементМассива Из ВходныеПараметры.Товары Цикл
			Если ВходныеПараметры.ЗаписыватьШтрихкод Тогда
				
				СтруктураДляПередачи = Новый Структура("barCode,stock");
				СтруктураДляПередачи.barCode = ЭлементМассива.ШтрихКод; 
				СтруктураДляПередачи.stock = ЭлементМассива.остаток;
				
			Иначе 
				СтруктураДляПередачи = Новый Структура("xmlId,stock");
				СтруктураДляПередачи.xmlId = ПолучитьКодТовараДляПортала(ЭлементМассива.Номенклатура); 
				СтруктураДляПередачи.stock = ЭлементМассива.остаток; 
			КонецЕсли; 
			
			МассивТоваров.Добавить(СтруктураДляПередачи); 
		КонецЦикла; 	
		СтруктураЗапроса.Data.products = МассивТоваров; 
	КонецЕсли;
	
	Возврат СтруктураЗапроса; 


КонецФункции // ЗаполнитьСтруктуруДляОтправкиПодтвержденияТолькоОтгрузкиПоставщика()

Функция ЗаполнитьСтруктуруДляОтправкиОстатковЦО(ВходныеПараметры,ДатаФормирования)

	СтруктураЗапроса =  СформироватьСтруктуруPostЗапросаОстаткиТоваровЦО();   
	
	
	СтруктураЗапроса.Data.time = ПреобразоватьДатуДляПередачиНаПортал(ДатаФормирования);  	
	
	
	Если ВходныеПараметры.Свойство("Товары")
		И ВходныеПараметры.Товары.Количество() > 0 Тогда 		
		МассивТоваров = Новый Массив; 
		Для каждого ЭлементМассива Из ВходныеПараметры.Товары Цикл
			СтруктураДляПередачи = Новый Структура("xmlId,stock");
			СтруктураДляПередачи.xmlId = ПолучитьКодТовараДляПортала(ЭлементМассива.Номенклатура); 
			СтруктураДляПередачи.stock = ЭлементМассива.остаток; 
			
			
			МассивТоваров.Добавить(СтруктураДляПередачи); 
		КонецЦикла; 	
		СтруктураЗапроса.Data.offers = МассивТоваров; 
	КонецЕсли;
	
	Возврат СтруктураЗапроса; 


КонецФункции // ЗаполнитьСтруктуруДляОтправкиПодтвержденияТолькоОтгрузкиПоставщика()

Функция ЗаполнитьСтруктуруДляПолученияДанныхОчереди(ВходныеПараметры) Экспорт

	СтруктураЗапроса =  СформироватьСтруктуруGetЗапросаДанныхПоОчереди();   
	
	
	СтруктураЗапроса.Data.requestId = ВходныеПараметры.ИдентификаторКлиента;  	
	
	Возврат СтруктураЗапроса; 


КонецФункции // ЗаполнитьСтруктуруДляОтправкиПодтвержденияТолькоОтгрузкиПоставщика()



Процедура ПолучениеДанныхПоПунктамДоставки(Знач ВходныеПараметры) Экспорт
	
	HTTPСоединение = HTTPСоединение(); 
	Если HTTPСоединение = неопределено Тогда
	
		ЗаписьЖурналаРегистрации("ОшибкаСоединенияОбменЕЭ_GET",УровеньЖурналаРегистрации.Ошибка,,,,); 
	
		Возврат; 
	
	КонецЕсли;
	
	ДанныеДляОтправкиGetЗапроса = ПолучитьПараметрыМетодаЗагрузкиПунктовДоставки(); 
	
	Запрос_АПИ_POST 	= Новый HTTPЗапрос(ДанныеДляОтправкиGetЗапроса.СервисЗагрузкиПунктовДоставки);
	Запрос_АПИ_POST.Заголовки.Вставить("Authorization", ДанныеДляОтправкиGetЗапроса.КлючАвторизации);
	
	СтруктураЗапроса = ЗаполнитьСтруктуруДляЗагрузкиПунктовДоставки(ВходныеПараметры);
	
	СтрокаJSON 	= ОтработатьЗаполненнуюСтруктуруОтвета(СтруктураЗапроса);
	Запрос_АПИ_POST.УстановитьТелоИзСтроки(СтрокаJSON);
	
	ИдентификаторЗапроса = Новый УникальныйИдентификатор;
	ХранитьПодробностиЛогирования = ДанныеДляОтправкиGetЗапроса.ХранитьПодробностиЛогирования; 
	
	Попытка
		
		Ответ_АПИ = HTTPСоединение.ОтправитьДляОбработки(Запрос_АПИ_POST);
		//в журнал запишем что отправили и когда, и потом уже ответ		 
		ЗаписатьВЖурналЗапросыНаПолучениеЗаказов(Строка(ИдентификаторЗапроса),СтрокаJSON,ХранитьПодробностиЛогирования); 
		
	Исключение
		
		//записать ошибку в журнал
		Комментарий = "Не удалось отправить get запрос. Ошибка!";
		РезультатДанные = СтруктураРезультат();
		ЗаписатьВЖурналЗапросыНаПолучениеЗаказовРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,Комментарий,истина,ХранитьПодробностиЛогирования);  
		ЗаписатьОшибкуВЖурнал(Строка(ИдентификаторЗапроса),Комментарий);
		
		Возврат; //не подключился 
		
	КонецПопытки; 
	
	//отработка ответа, пока непонятно как отрабатывать, в какой документ загружать данные 
	
	РезультатЧтенияJSON = СтруктураJSONЗапроса(Ответ_АПИ);                                                                                           
	Структура_JSON_Ответ =  РезультатЧтенияJSON.Структура_JSON;

	ТелоСообщения 	= Ответ_АПИ.ПолучитьТелоКакСтроку(); 
	СтрокаОтвета  	= Строка(Ответ_АПИ.КодСостояния) + " " + ТелоСообщения;
	СтрокаJSONОтвета= ТелоСообщения;
	
	
	Если Ответ_АПИ.КодСостояния = 200 Тогда
		//запись в журнал 
		//записать можно id запроса, зарегистрированного на портале в журнал
		Если Структура_JSON_Ответ <> неопределено 
			И Структура_JSON_Ответ.Свойство("data")
			И Структура_JSON_Ответ.data.Свойство("profiles")
			И ТипЗнч(Структура_JSON_Ответ.data.profiles) = Тип("Массив") Тогда 
			
			
			//таблица, так как возможно сохранение больших даных, сейчас только код ПД
			ТаблицаПунктыДоставки = Новый ТаблицаЗначений; 
			ТаблицаПунктыДоставки.Колонки.Добавить("КодЮридическогоЛица");
			ТаблицаПунктыДоставки.Колонки.Добавить("Код");
			ТаблицаПунктыДоставки.Колонки.Добавить("СтруктураДанных");
			ТаблицаПунктыДоставки.Колонки.Добавить("СтруктураДанныхПолная");
						
			Для каждого СтрокаПрофиля Из Структура_JSON_Ответ.data.profiles Цикл
				
				КодЮридическогоЛица =  СтрокаПрофиля.code; 
				
				Если СтрокаПрофиля.Свойство("addresses") Тогда
					
					Для каждого СтрокаАдреса Из СтрокаПрофиля.addresses Цикл
						
						СтрокаТаблицы = ТаблицаПунктыДоставки.Добавить(); 
						СтрокаТаблицы.Код = СтрокаАдреса.code ;
						СтрокаТаблицы.СтруктураДанных = СтрокаПрофиля;
						СтрокаТаблицы.СтруктураДанныхПолная = Структура_JSON_Ответ;
						СтрокаТаблицы.КодЮридическогоЛица = КодЮридическогоЛица ;						
					КонецЦикла;
					
				КонецЕсли;	
				
			КонецЦикла;
			
			ЗаписатьПунктыДоставки(ТаблицаПунктыДоставки,ИдентификаторЗапроса); 
			
			//Записать данные в РС по пунктам доставки 
			
			РезультатДанные = СтруктураРезультат();
			
			РезультатДанные.ИдентификаторКлиента = Структура_JSON_Ответ.requestId; //???? есть или нет 
			РезультатДанные.Документ = неопределено;
			РезультатДанные.РезультатJson = Структура_JSON_Ответ;
			
			ЗаписатьВЖурналЗапросыНаПолучениеЗаказовРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,"",,ХранитьПодробностиЛогирования);
		Иначе
			РезультатДанные = СтруктураРезультат(); 
			РезультатДанные.РезультатJson = Структура_JSON_Ответ;
			ЗаписатьВЖурналЗапросыНаПолучениеЗаказовРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,"Не найдены пункты доставки по запросу",,ХранитьПодробностиЛогирования);
		КонецЕсли;
	Иначе
		
		КодОшибки = Ответ_АПИ.КодСостояния;
		
		Если КодОшибки = 400 Тогда   		
			
			ИнформацияОбОшибке = Структура_JSON_Ответ.Message;  //должно быть 
			
		ИначеЕсли КодОшибки = 401 Тогда
			
			ИнформацияОбОшибке = "Авторизация не пройдена"; 
		Иначе 
			
			ИнформацияОбОшибке = "Ошибка сервера";
		КонецЕсли;
		
		Комментарий = Строка(КодОшибки) + ":" + ИнформацияОбОшибке; 
		
		РезультатДанные = СтруктураРезультат(); 
		РезультатДанные.РезультатJson = ТелоСообщения; 
		
		ЗаписатьВЖурналЗапросыНаПолучениеЗаказовРезультат(Строка(ИдентификаторЗапроса),РезультатДанные,Комментарий,истина,ХранитьПодробностиЛогирования);
		
	КонецЕсли; 
	
	
	
КонецПроцедуры

Функция ЗаполнитьСтруктуруДляЗагрузкиПунктовДоставки(Знач ВходныеПараметры)
	                                                                  	
	СтруктураЗапроса = СформироватьСтруктуруPostЗапросаПунктовДоставки(); 
	
	Если ВходныеПараметры.Свойство("IDПользователя")
		И ЗначениеЗаполнено(ВходныеПараметры.IDПользователя) Тогда 		
		
		СтруктураЗапроса.Data.login = ВходныеПараметры.IDПользователя; 	
		
	КонецЕсли;
		
	Возврат СтруктураЗапроса; 
	
КонецФункции // ПолучениеСпискаЗаказов()

Функция ЗаполнитьСтруктуруДляПодтвержденияЗаКлиента(ВходныеПараметры)

	СтруктураЗапроса =  СформироватьСтруктуруЗапросаПодтверждЗаКлиента(ВходныеПараметры.ТипЗапроса);
	
	Если ВходныеПараметры.Свойство("НомерЗаявки")
		И ЗначениеЗаполнено(ВходныеПараметры.НомерЗаявки) Тогда
		
		СтруктураЗапроса.Data.accountNumber = ВходныеПараметры.НомерЗаявки; 	
		
	КонецЕсли;
	
	Если ВходныеПараметры.ТипЗапроса = "ПодтвердитьЗаКлиентаПолностью" Тогда  		
		
		СтруктураЗапроса.Data.order.shipmentMethod = ВходныеПараметры.МетодДоставки; 
	
	КонецЕсли;
	
	Возврат СтруктураЗапроса;

КонецФункции 

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииЗапросовНаСайт

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция СформироватьСтруктуруGetЗапроса() Экспорт

	  СтруктураЗапроса = Новый Структура; 
	  СтруктураЗапроса.Вставить("data"); 
	  
	  СтруктураЗапросаData = Новый Структура; 
	  СтруктураЗапросаData.Вставить("filter");
	  СтруктураЗапросаData.Вставить("params",Новый Структура);
	  
	  CтруктураЗапросаFilter = Новый Структура;
	  CтруктураЗапросаFilter.Вставить("orderType");
	  
	  //CтруктураЗапросаFilter.Вставить("statusId", Новый Массив);
	  //CтруктураЗапросаFilter.Вставить("dateCreateFrom");
	  //CтруктураЗапросаFilter.Вставить("dateCreateTo");
	  //CтруктураЗапросаFilter.Вставить("dateUpdateFrom");
	  //CтруктураЗапросаFilter.Вставить("dateUpdateTo");
	  //CтруктураЗапросаFilter.Вставить("dateUpdateBxFrom");
	  //CтруктураЗапросаFilter.Вставить("dateUpdateBxTo");
	  //CтруктураЗапросаFilter.Вставить("user");
	  //CтруктураЗапросаFilter.Вставить("accountNumber");
	  //CтруктураЗапросаFilter.Вставить("bxId");
	  //CтруктураЗапросаFilter.Вставить("bxId");
	  
	  СтруктураЗапросаData.filter = CтруктураЗапросаFilter; 
	  СтруктураЗапросаData.params.Вставить("skipProducts",true); 
	  
	  СтруктураЗапроса.Data = СтруктураЗапросаData; 
	  
	  Возврат СтруктураЗапроса; 
	  

КонецФункции // СформироватьСтруктуруGetЗапроса()

Функция СформироватьСтруктуруPostЗапроса(ОтгрузкаСНаличия = Истина,	СозданиеДоЗаказа = Ложь	) Экспорт

	  СтруктураЗапроса = Новый Структура; 
	  СтруктураЗапроса.Вставить("data"); 
	  
	  СтруктураЗапросаData = Новый Структура; 
	  СтруктураЗапросаData.Вставить("accountNumber");
	  СтруктураЗапросаData.Вставить("bxId") ; 
	  
	  Если ОтгрузкаСНаличия Тогда
		  
		  СтруктураЗапросаData.Вставить("order"); 
		  
		  СтруктураЗапросаOrder = Новый Структура; 
		  СтруктураЗапросаOrder.Вставить("statusId");
		  
		  
		  СтруктураЗапросаOrder.Вставить("confirmedProducts",Новый Массив);
		  СтруктураЗапросаData.order = СтруктураЗапросаOrder;
		  
	  КонецЕсли;
	  
	  Если СозданиеДоЗаказа Тогда
		  
		  СтруктураЗапросаData.Вставить("additionalOrder");
		  
		  СтруктураЗапросаadditionalOrder = Новый Структура; 
		  СтруктураЗапросаadditionalOrder.Вставить("orderedShipmentDate");//желаемая дата отгрузки 
		  СтруктураЗапросаadditionalOrder.Вставить("comment");
		  СтруктураЗапросаadditionalOrder.Вставить("inn");
		  СтруктураЗапросаadditionalOrder.Вставить("orderedProducts", Новый Массив);
		  СтруктураЗапросаadditionalOrder.Вставить("deliveryAddress","");
		  
		  СтруктураЗапросаData.additionalOrder = СтруктураЗапросаadditionalOrder;
		  
		  СтруктураЗапросаData.Вставить("order");
		  
		  СтруктураЗапросаOrder = Новый Структура;
		  СтруктураЗапросаOrder.Вставить("statusId","ZN");  //пока сразу 
		  СтруктураЗапросаOrder.Вставить("confirmedProducts",Новый Массив);
		  СтруктураЗапросаData.order = СтруктураЗапросаOrder;
		  
	  КонецЕсли;   
	  
	  
	  СтруктураЗапроса.Data = СтруктураЗапросаData; 
	  
	 	  
	  Возврат СтруктураЗапроса; 
	  

  КонецФункции // СформироватьСтруктуруPostЗапроса()
  
  //здесь и отмена заказа и отмена дозаказа, приходит разный статус
  //отправка на согласование заявки полностью, но без комментария отмены
 Функция СформироватьСтруктуруPostЗапросаИзменениеСтатуса(ОтменаЗаказа = истина,ДобавитьТовары = Ложь) Экспорт

	 СтруктураЗапроса = Новый Структура; 
	 СтруктураЗапроса.Вставить("data"); 
	 
	 СтруктураЗапросаData = Новый Структура; 
	 СтруктураЗапросаData.Вставить("accountNumber");
	 СтруктураЗапросаData.Вставить("bxId") ; 
	 
	 СтруктураЗапросаData.Вставить("order"); 
	 
	 СтруктураЗапросаOrder = Новый Структура; 
	 СтруктураЗапросаOrder.Вставить("statusId");
	 
	 Если ОтменаЗаказа Тогда
	 
	 	СтруктураЗапросаOrder.Вставить("cancelReasonText");	
	 
	КонецЕсли;
	
	Если ДобавитьТовары Тогда
		
		СтруктураЗапросаOrder.Вставить("confirmedProducts",Новый Массив);	
		
	КонецЕсли;
	 
	 
	 СтруктураЗапросаData.order = СтруктураЗапросаOrder;    
	 
	 СтруктураЗапроса.Data = СтруктураЗапросаData; 
	 
	 
	 Возврат СтруктураЗапроса; 
	  

  КонецФункции // СформироватьСтруктуруPostЗапроса()
  
Функция СформироватьСтруктуруPostЗапросаПодтверждениеДоЗаказа() Экспорт

	 СтруктураЗапроса = Новый Структура; 
	 СтруктураЗапроса.Вставить("data"); 
	 
	 СтруктураЗапросаData = Новый Структура; 
	 СтруктураЗапросаData.Вставить("accountNumber");
	 СтруктураЗапросаData.Вставить("bxId") ; 
	 
	 СтруктураЗапросаData.Вставить("additionalOrder"); 
	 
	 СтруктураЗапросаOrder = Новый Структура; 
	 СтруктураЗапросаOrder.Вставить("statusId"); 
	 
	 СтруктураЗапросаData.additionalOrder = СтруктураЗапросаOrder;    
	 
	 СтруктураЗапроса.Data = СтруктураЗапросаData; 
	 
	 
	 Возврат СтруктураЗапроса; 
	  

  КонецФункции // СформироватьСтруктуруPostЗапроса()
  
 Функция СформироватьСтруктуруPostЗапросаДатыОтгрузок(ДатаОтгрузкиДоЗаказа = ЛОЖЬ,ДобавитьМетодДоставки = Ложь,ДатаОтгрузкиЗаказа = Истина) Экспорт

	 СтруктураЗапроса = Новый Структура; 
	 СтруктураЗапроса.Вставить("data"); 
	 
	 СтруктураЗапросаData = Новый Структура; 
	 СтруктураЗапросаData.Вставить("accountNumber");
	 СтруктураЗапросаData.Вставить("bxId") ; 
	 
	 СтруктураЗапросаData.Вставить("order"); 
	 
	 СтруктураЗапросаOrder = Новый Структура;
	 Если ДатаОтгрузкиЗаказа  Тогда
	 
	 	СтруктураЗапросаOrder.Вставить("distrShipmentDate");	
	 
	 КонецЕсли;
	 
	 
	 Если ДатаОтгрузкиДоЗаказа Тогда
	 
	 	СтруктураЗапросаOrder.Вставить("eeeShipmentDate");	
	 
	КонецЕсли;
	
	Если ДобавитьМетодДоставки Тогда
	
		СтруктураЗапросаOrder.Вставить("shipmentMethod");	
	
	КонецЕсли;  
	 
	 
	 
	 СтруктураЗапросаData.order = СтруктураЗапросаOrder;    
	 
	 СтруктураЗапроса.Data = СтруктураЗапросаData; 
	 
	 
	 Возврат СтруктураЗапроса; 
	  

  КонецФункции // СформироватьСтруктуруPostЗапросаДатыОтгрузок()
  
 Функция СформироватьСтруктуруPostЗапросаОтменыОтгрузки(ОтменаЗаказа = Истина, ОтменаДозаказа = ЛОЖЬ) Экспорт

	 СтруктураЗапроса = Новый Структура; 
	 СтруктураЗапроса.Вставить("data"); 
	 
	 СтруктураЗапросаData = Новый Структура; 
	 СтруктураЗапросаData.Вставить("accountNumber");
	 СтруктураЗапросаData.Вставить("bxId") ; 
	 
	 СтруктураЗапросаData.Вставить("order"); 
	 
	  СтруктураЗапросаOrder = Новый Структура;
	  
	 Если ОтменаЗаказа Тогда 	 
		 
		 СтруктураЗапросаOrder.Вставить("distrShipmentStatus");
		 СтруктураЗапросаOrder.Вставить("distrShipmentCancelText");
		 СтруктураЗапросаOrder.Вставить("distrShipmentCancelComment");
	 КонецЕсли;
	 
	 Если ОтменаДозаказа Тогда 	 
		  
		 СтруктураЗапросаOrder.Вставить("eeeShipmentStatus");
		 СтруктураЗапросаOrder.Вставить("eeeShipmentCancelText");
		 СтруктураЗапросаOrder.Вставить("eeeShipmentCancelComment");
		 
	 КонецЕсли;
	 
	 СтруктураЗапросаData.order = СтруктураЗапросаOrder;    
	 
	 СтруктураЗапроса.Data = СтруктураЗапросаData; 
	 
	 
	 Возврат СтруктураЗапроса; 
	  

  КонецФункции // СформироватьСтруктуруPostЗапросаДатыОтгрузок()
  
Функция СформироватьСтруктуруPostЗапросаОстаткиТоваров() Экспорт

	 СтруктураЗапроса = Новый Структура; 
	 СтруктураЗапроса.Вставить("data"); 
	 
	 СтруктураЗапросаData = Новый Структура; 
	 СтруктураЗапросаData.Вставить("user");
	 СтруктураЗапросаData.Вставить("products",Новый Массив) ; 
	 
	 СтруктураЗапроса.data = СтруктураЗапросаData; 
	 	 
	 Возврат СтруктураЗапроса; 
	  

  КонецФункции // СформироватьСтруктуруPostЗапроса()
  
Функция СформироватьСтруктуруPostЗапросаОстаткиТоваровЦО() Экспорт
  
  СтруктураЗапроса = Новый Структура; 
  СтруктураЗапроса.Вставить("data"); 
  
  СтруктураЗапросаData = Новый Структура; 
  СтруктураЗапросаData.Вставить("time");
  СтруктураЗапросаData.Вставить("offers",Новый Массив) ; 
  
  СтруктураЗапроса.data = СтруктураЗапросаData; 
  
  Возврат СтруктураЗапроса; 
  
  
КонецФункции

Функция СформироватьСтруктуруGetЗапросаДанныхПоОчереди() Экспорт
  
  СтруктураЗапроса = Новый Структура; 
  СтруктураЗапроса.Вставить("data"); 
  
  СтруктураЗапросаData = Новый Структура; 
  СтруктураЗапросаData.Вставить("requestId");    
  
  СтруктураЗапроса.data = СтруктураЗапросаData; 
  
  Возврат СтруктураЗапроса; 
  
  
КонецФункции

  
Функция СформироватьСтруктуруPostЗапросаПунктовДоставки() Экспорт

	 СтруктураЗапроса = Новый Структура; 
	 СтруктураЗапроса.Вставить("data"); 
	 
	 СтруктураЗапросаData = Новый Структура; 
	 СтруктураЗапросаData.Вставить("login");
	  
	 
	 СтруктураЗапроса.data = СтруктураЗапросаData; 
	 	 
	 Возврат СтруктураЗапроса; 
	  

 КонецФункции 
 
 Функция СформироватьСтруктуруЗапросаПодтверждЗаКлиента(ТипЗапроса)

	СтруктураЗапроса = Новый Структура; 
	СтруктураЗапроса.Вставить("data"); 
	
	СтруктураЗапросаData = Новый Структура; 
	СтруктураЗапросаData.Вставить("accountNumber");
	СтруктураЗапросаData.Вставить("order");

	СтруктураЗапросаOrder = Новый Структура; 
    СтруктураЗапросаOrder.Вставить("statusId","ZP");  
	Если ТипЗапроса = "ПодтвердитьЗаКлиентаПолностью" Тогда
		
		СтруктураЗапросаOrder.Вставить("shipmentMethod");
		
	КонецЕсли;
	
	Если ТипЗапроса = "ПодтвердитьЗаКлиентаТолькоДозаказ" Тогда
		
		СтруктураЗапросаOrder.Вставить("confirmedProducts");
		
	КонецЕсли;
	
	Если ТипЗапроса = "ПодтвердитьЗаКлиентаТолькоВНаличии" Тогда
		
		СтруктураЗапросаData.Вставить("additionalOrder");
		
	КонецЕсли;
	
	СтруктураЗапросаData.order = СтруктураЗапросаOrder; 
	
	СтруктураЗапроса.data = СтруктураЗапросаData; 
	
	Возврат СтруктураЗапроса; 


КонецФункции // СформироватьСтруктуруЗапросаПодтверждЗаКлиента()



  // <Описание функции>
  //
  // Параметры:
  //  <Параметр1>  - <Тип.Вид> - <описание параметра>
  //                 <продолжение описания параметра>
  //  <Параметр2>  - <Тип.Вид> - <описание параметра>
  //                 <продолжение описания параметра>
  //
  // Возвращаемое значение:
  //   <Тип.Вид>   - <описание возвращаемого значения>
  //
 Функция СтруктураТовара(БезЦены = Ложь)
	  
	  СтруктураТовары = Новый Структура;
	  
	  СтруктураТовары.Вставить("xmlId");
	  СтруктураТовары.Вставить("quantity",0);
	  Если Не БезЦены Тогда
		  
		  СтруктураТовары.Вставить("price",0);
		  
	  КонецЕсли;
	  
	  
	  Возврат СтруктураТовары; 
	  
  КонецФункции // СтруктураТовары()
 
Функция ОтработатьЗаполненнуюСтруктуруОтвета(ДанныеОтвета) Экспорт
	//
	ЗаписьJSON = Новый ЗаписьJSON; 
	ЗаписьJSON.УстановитьСтроку(); 
	
	НастройкаСериализации = Новый НастройкиСериализацииJSON; 
	НастройкаСериализации.ВариантЗаписиДаты 		= ВариантЗаписиДатыJSON.ЛокальнаяДата; 
	НастройкаСериализации.ФорматСериализацииДаты 	= ФорматДатыJSON.ISO; 
	
	ЗаписатьJSON(ЗаписьJSON,ДанныеОтвета,НастройкаСериализации);
	СтрJSON = ЗаписьJSON.Закрыть(); 
	
	Возврат СтрJSON; 
КонецФункции

Функция СтруктураJSONЗапроса(Знач Ответ_АПИ) Экспорт
	
	Перем Ответ_АПИ_JSON;
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;                          
		//-----
		Ответ_АПИ_JSON = Ответ_АПИ.ПолучитьТелоКакСтроку();
		
		ЧтениеJSON.УстановитьСтроку(СтрЗаменить(Ответ_АПИ_JSON,"==","NevW"));
		//
		//ЧтениеJSON.УстановитьСтроку(Ответ_АПИ_JSON);
		
		//-----
		ОтветСервераДанные = ПрочитатьJSON(ЧтениеJSON,);
	Исключение
		Ответ_АПИ_JSON = Неопределено;
		ОтветСервераДанные = Неопределено;
	КонецПопытки;
	
	
	Возврат Новый Структура("Ответ_JSON,Структура_JSON",Ответ_АПИ_JSON,ОтветСервераДанные); 
КонецФункции

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ЗаписатьПунктыДоставки(ТаблицаДанных,ИдентификаторЗапроса)

	 Для каждого СтрокаТаблицы Из ТаблицаДанных Цикл
	 
	 	ПунктДоставки = Справочники.ПунктыДоставки.НайтиПоКоду(СтрокаТаблицы.Код);
		Если Не ЗначениеЗаполнено(ПунктДоставки) Тогда
			
			ЗаписатьОшибкуВЖурнал(Строка(ИдентификаторЗапроса),"Пункт доставки по коду " + СтрокаТаблицы.Код + " не найден",,СтрокаТаблицы.Структураданных);
			
		КонецЕсли;
		ЮридическоеЛицо = Справочники.Контрагенты.НайтиПоКоду(СтрокаТаблицы.КодЮридическогоЛица);
		
		Если Не ЗначениеЗаполнено(ЮридическоеЛицо) Тогда
		
			ЗаписатьОшибкуВЖурнал(Строка(ИдентификаторЗапроса),"Юридическое лицо по коду " + СтрокаТаблицы.КодЮридическогоЛица + " не найден",,СтрокаТаблицы.СтруктураДанныхПолная);
		
		КонецЕсли;
				
		Если ЗначениеЗаполнено(ПунктДоставки)
			И ЗначениеЗаполнено(ЮридическоеЛицо) Тогда
		
			ЗаписатьВРегистрПунктыДоставки(СтрокаТаблицы,ИдентификаторЗапроса,ПунктДоставки,ЮридическоеЛицо); 	
		 
		КонецЕсли;
	 
	 КонецЦикла;

 КонецПроцедуры // ЗаписатьПунктыДоставки()
 
 // <Описание процедуры>
 //
 // Параметры:
 //  <Параметр1>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //  <Параметр2>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //
 Процедура ЗаписатьВРегистрПунктыДоставки(Знач СтрокаТаблицы,ИдентификаторЗапроса,ПунктДоставки, ЮрЛицо) Экспорт
 
	 МенеджерЗаписи = РегистрыСведений.b2b_ПунктыДоставкиДистрибьютора.СоздатьМенеджерЗаписи(); 
	 МенеджерЗаписи.ПунктДоставки = ПунктДоставки;
	 МенеджерЗаписи.Контрагент = ЮрЛицо;
	 МенеджерЗаписи.КодSNLПунктаДоставки = СтрокаТаблицы.Код;
	 МенеджерЗаписи.ДатаЗагрузки = ТекущаяДатаСеанса(); 
	 МенеджерЗаписи.Результат = Новый ХранилищеЗначения(СтрокаТаблицы.СтруктураДанных,Новый СжатиеДанных(9));
	 МенеджерЗаписи.РезультатОбщий = Новый ХранилищеЗначения(СтрокаТаблицы.СтруктураДанныхПолная,Новый СжатиеДанных(9));
	 
	 ПопыткаЗаписиВЖурнал( МенеджерЗаписи,"b2b_ПунктыДоставкиДистрибьютора",ИдентификаторЗапроса);
	
 КонецПроцедуры // ЗаписатьВРегистрПунктыДоставки()
 
 // <Описание процедуры>
 //
 // Параметры:
 //  <Параметр1>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //  <Параметр2>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //
 Процедура ЗаписатьДанныеВРегистрПереданныеОстатки(ПараметрыЗаписи,ИдентификаторЗапроса,МассивИсключение) Экспорт 
 
 	 IDПользователя = ПараметрыЗаписи.IDПользователя; 
	 ТоварыВПакете = ПараметрыЗаписи.Товары;
	 
	 ДатаЗаписиОстатков = ТекущаяДатаСеанса();
	 
	 Для каждого ЭлементМассива Из ТоварыВПакете Цикл
		 
		 Номенклатура =  ЭлементМассива.Номенклатура;
		 
		 Если МассивИсключение.Найти(Номенклатура) <> неопределено Тогда
			 
			 Продолжить; 	
			 
		 КонецЕсли;
		 
		 Остаток = ЭлементМассива.Остаток; 
		 
		 МенеджерЗаписи = РегистрыСведений.b2b_ПереданныеОстатки.СоздатьМенеджерЗаписи(); 
		 МенеджерЗаписи.IDПользователяНаСайте = IDПользователя; 
		 МенеджерЗаписи.Номенклатура = Номенклатура; 
		 МенеджерЗаписи.Остаток = Остаток; 
		 МенеджерЗаписи.ДатаОтправки = ДатаЗаписиОстатков;  
		 МенеджерЗаписи.ИдентификаторЗапроса = Строка(ИдентификаторЗапроса);
		 Попытка
			 
			 МенеджерЗаписи.Записать(); 
			 
		 Исключение
			 ЗаписатьОшибкуВЖурнал(ИдентификаторЗапроса,"Не удалось обновить переданные остатки по номенклатуре " + Строка(Номенклатура),,); 
		 КонецПопытки;
	 КонецЦикла;
	 
	 
 
 КонецПроцедуры // ЗаписатьДанныеВРегистрПереданныеОстатки()
 
 Процедура ЗаписатьДанныеВРегистрПереданныеОстаткиЦО(ПараметрыЗаписи,ИдентификаторЗапроса,МассивИсключение) Экспорт 
 
 	 
	 ТоварыВПакете = ПараметрыЗаписи.Товары;
	 
	 Если ТипЗнч(ТоварыВПакете) <> Тип("Массив") Тогда
	 
	 	Возврат; 	
	 
	 КонецЕсли;
	 
	 ДатаЗаписиОстатков = ТекущаяДатаСеанса();
	 
	 Для каждого ЭлементМассива Из ТоварыВПакете Цикл
		 
		 Номенклатура =  ЭлементМассива.Номенклатура;
		 
		 Если МассивИсключение.Найти(Номенклатура) <> неопределено Тогда
			 
			 Продолжить; 	
			 
		 КонецЕсли;
		 
		 Остаток = ЭлементМассива.Остаток; 
		 
		 МенеджерЗаписи = РегистрыСведений.b2b_ПереданныеОстаткиЦО.СоздатьМенеджерЗаписи(); 
		 МенеджерЗаписи.Номенклатура = Номенклатура; 
		 МенеджерЗаписи.Остаток = Остаток; 
		 МенеджерЗаписи.ДатаОтправки = ДатаЗаписиОстатков;  
		 МенеджерЗаписи.ИдентификаторЗапроса = Строка(ИдентификаторЗапроса);
		 Попытка
			 
			 МенеджерЗаписи.Записать(); 
			 
		 Исключение
			 ЗаписатьОшибкуВЖурнал(ИдентификаторЗапроса,"Не удалось обновить переданные остатки ЦО по номенклатуре " + Строка(Номенклатура),,); 
		 КонецПопытки;
	 КонецЦикла;
	 
	 
 
 КонецПроцедуры // ЗаписатьДанныеВРегистрПереданныеОстатки()
 
  
 

#КонецОбласти

#Область ЗаписьВЖурнал
// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ЗаписатьВЖурналЗапросыНаПолучениеЗаказов(ИдентификаторЗапроса,Запрос,ХранитьПодробностиЛогирования = Ложь)

	МенеджерЗаписи = РегистрыСведений.b2b_ЗапросыНаПолучениеЗаказовИстория.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса(); 
	МенеджерЗаписи.ИдентификаторЗапроса = ИдентификаторЗапроса;
	Если ХранитьПодробностиЛогирования Тогда
		
		МенеджерЗаписи.Запрос = Новый ХранилищеЗначения(Запрос,Новый СжатиеДанных(9));	
		
	КонецЕсли;
	 
	
	ПопыткаЗаписиВЖурнал( МенеджерЗаписи,"b2b_ЗапросыНаПолучениеЗаказовИстория",ИдентификаторЗапроса); 

КонецПроцедуры // ЗаписатьВЖурналЗапросыНаПолучениеЗаказов()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ЗаписатьВЖурналЗапросыНаПолучениеЗаказовРезультат(ИдентификаторЗапроса,Результат,Комментарий, ЭтоОшибка = Ложь,ХранитьПодробностиЛогирования = Ложь)

	Наборзаписей = РегистрыСведений.b2b_ЗапросыНаПолучениеЗаказовИстория.СоздатьНаборЗаписей(); 
	Наборзаписей.Отбор.ИдентификаторЗапроса.Установить(ИдентификаторЗапроса);
	Наборзаписей.Прочитать();
	
	Для каждого ЗаписьНабора Из Наборзаписей Цикл
	
		ЗаписьНабора.Комментарий = Комментарий;
		ЗаписьНабора.ТекстОшибки = ?(ЭтоОшибка,Комментарий,"");
		ЗаписьНабора.ИдентификаторКлиента = ?(Результат = Неопределено,"",Результат.ИдентификаторКлиента);		
		ЗаписьНабора.Документ = ?(Результат = Неопределено,"",Результат.Документ);
		Если ХранитьПодробностиЛогирования Тогда
			
			ЗаписьНабора.Результат = ?(Результат = Неопределено,"",Новый ХранилищеЗначения(Результат.РезультатJson,Новый СжатиеДанных(9)));	
			
		КонецЕсли;
	    
		
	КонецЦикла;
	
	Попытка
	
		Наборзаписей.Записать(); 
	
	Исключение
		
		ЗаписьЖурналаРегистрации("ОшибкаЗапросаОбменЕЭ_GET",УровеньЖурналаРегистрации.Ошибка,,,,);
	
	КонецПопытки;
	
КонецПроцедуры // ЗаписатьВЖурналЗапросыНаПолучениеЗаказовРезультат()


Процедура ПопыткаЗаписиВЖурнал(Знач МенеджерЗаписи,ИмяЖурнала,ИдентификаторТранзакции) Экспорт
	
	Попытка
		
		МенеджерЗаписи.Записать(); 
		
	Исключение
		
		ЗаписатьОшибкуВЖурнал(Строка(ИдентификаторТранзакции),"Ошибка записи в регистр " + ИмяЖурнала);  
		Сообщить(ОписаниеОшибки()); 
	КонецПопытки;
	
	
КонецПроцедуры

Процедура ЗаписатьОшибкуВЖурнал(ИдентификаторТранзакций, Ошибка,ИдентификаторКлиента = "", Результат = неопределено)  Экспорт
	
	МенеджерЗаписи = РегистрыСведений.b2b_ЖурналОшибок.СоздатьМенеджерЗаписи(); 
	МенеджерЗаписи.Период 					= ТекущаяДата(); 
	МенеджерЗаписи.ИдентификаторЗапроса 	= ИдентификаторТранзакций;  
	МенеджерЗаписи.ИдентификаторКлиента 	= ИдентификаторКлиента;
	Если ЗначениеЗаполнено(Результат) Тогда
	
		МенеджерЗаписи.Результат 	= Новый ХранилищеЗначения(Результат,Новый СжатиеДанных(9));	
	
	КонецЕсли;
	 
	МенеджерЗаписи.ИнформацияОбОшибке	= Ошибка; 
	
	Попытка
		
		МенеджерЗаписи.Записать(); 
		
	Исключение
		ЗаписьЖурналаРегистрации("ОшибкаЗаписиВЖурналОшибок",УровеньЖурналаРегистрации.Ошибка,Метаданные.РегистрыСведений.b2b_ЖурналОшибок,,,); 
	 КонецПопытки;
	
КонецПроцедуры 

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ЗаписатьВЖурналЗапросыНаОбновлениеЗаказов(ИдентификаторЗапроса,Запрос,ВходныеПараметры,ХранитьПодробностиЛогирования = Ложь)

	МенеджерЗаписи = РегистрыСведений.b2b_ЗапросыНаОбновлениеИстория.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса(); 
	МенеджерЗаписи.ИдентификаторЗапроса = ИдентификаторЗапроса;
	
	Если ХранитьПодробностиЛогирования Тогда
		
		МенеджерЗаписи.Запрос = Новый ХранилищеЗначения(Запрос,Новый СжатиеДанных(9));	
		
	КонецЕсли;
	
	
	Если ВходныеПараметры.Свойство("ИдентификаторОчереди") Тогда
	
		МенеджерЗаписи.ИдентификаторОчереди = ВходныеПараметры.ИдентификаторОчереди; 	
	
	КонецЕсли;
	
	Если ВходныеПараметры.Свойство("Заказ") Тогда
	
		МенеджерЗаписи.Документ = ВходныеПараметры.Заказ; 	
	
	КонецЕсли;
	
	Если ВходныеПараметры.Свойство("ТипЗапроса") Тогда
	
		МенеджерЗаписи.ТипЗапроса = ВходныеПараметры.ТипЗапроса; 	
	
	КонецЕсли;

	
	ПопыткаЗаписиВЖурнал( МенеджерЗаписи,"b2b_ЗапросыНаОбновлениеИстория",ИдентификаторЗапроса); 

КонецПроцедуры //	

Процедура ЗаписатьВЖурналЗапросыНаОбновлениеВОчереди(ИдентификаторЗапроса,ИдентификаторКлиента,Запрос,ВходныеПараметры,ХранитьПодробностиЛогирования = Ложь) Экспорт

	МенеджерЗаписи = РегистрыСведений.b2b_ЗапросыНаОбновлениеВОчереди.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса(); 
	МенеджерЗаписи.ИдентификаторЗапроса = ИдентификаторЗапроса; 
	МенеджерЗаписи.ИдентификаторКлиента = ИдентификаторКлиента;
	Если ХранитьПодробностиЛогирования Тогда
	
		МенеджерЗаписи.Запрос = Новый ХранилищеЗначения(Запрос,Новый СжатиеДанных(9));	
	
	КонецЕсли;
	
	Если ВходныеПараметры.Свойство("Данные") Тогда
		
		СериализованныйМассивКонтрагентов = ЗначениеВСтрокуВнутр(ВходныеПараметры.Данные);
		МенеджерЗаписи.МассивДанных = Новый ХранилищеЗначения(СериализованныйМассивКонтрагентов, Новый СжатиеДанных(9));
		
	КонецЕсли;
	
	Если ВходныеПараметры.Свойство("ИдентификаторОчереди") Тогда
	
		МенеджерЗаписи.ИдентификаторОчереди = ВходныеПараметры.ИдентификаторОчереди; 	
	
	КонецЕсли;       
		
	Если ВходныеПараметры.Свойство("ТипЗапроса") Тогда
	
		МенеджерЗаписи.ТипЗапроса = ВходныеПараметры.ТипЗапроса; 	
	
	КонецЕсли;

	
	ПопыткаЗаписиВЖурнал( МенеджерЗаписи,"b2b_ЗапросыНаОбновлениеИстория",ИдентификаторЗапроса); 

КонецПроцедуры //	

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ЗаписатьВЖурналЗапросыНаОбновлениеРезультат(ИдентификаторЗапроса,Результат,Комментарий, ЭтоОшибка = Ложь,ХранитьПодробностиЛогирования = Ложь)

	Наборзаписей = РегистрыСведений.b2b_ЗапросыНаОбновлениеИстория.СоздатьНаборЗаписей(); 
	Наборзаписей.Отбор.ИдентификаторЗапроса.Установить(ИдентификаторЗапроса);
	Наборзаписей.Прочитать();
	
	Для каждого ЗаписьНабора Из Наборзаписей Цикл
	
		ЗаписьНабора.Комментарий = Комментарий;
		ЗаписьНабора.ТекстОшибки = ?(ЭтоОшибка,Комментарий,"");
		ЗаписьНабора.ИдентификаторКлиента = ?(Результат = Неопределено,"",Результат.ИдентификаторКлиента);		
		ЗаписьНабора.Документ = ?(Результат = Неопределено,"",Результат.Документ);
		
		Если ХранитьПодробностиЛогирования Тогда
	    	ЗаписьНабора.Результат = ?(Результат = Неопределено,"",Новый ХранилищеЗначения(Результат.РезультатJson,Новый СжатиеДанных(9)));
		КонецЕсли;
	КонецЦикла;
	
	Попытка
	
		Наборзаписей.Записать(); 
	
	Исключение
		
		ЗаписьЖурналаРегистрации("ОшибкаЗапросаОбменЕЭ_GET",УровеньЖурналаРегистрации.Ошибка,,,,);
	
	КонецПопытки;
	
КонецПроцедуры // ЗаписатьВЖурналЗапросыНаПолучениеЗаказовРезультат()

Процедура ЗаписатьВЖурналЗапросыНаОбновлениеВОчередиРезультат(
		ИдентификаторЗапроса,
		ИдентификаторКлиента,
		Результат,
		Комментарий, 
		ЭтоОшибка = Ложь,
		Отработано = Ложь,
		ХранитьПодробностиЛогирования = Ложь
	) Экспорт

	Наборзаписей = РегистрыСведений.b2b_ЗапросыНаОбновлениеВОчереди.СоздатьНаборЗаписей(); 
	Наборзаписей.Отбор.ИдентификаторЗапроса.Установить(ИдентификаторЗапроса);
	Наборзаписей.Отбор.ИдентификаторКлиента.Установить(ИдентификаторКлиента);
	Наборзаписей.Прочитать();
	
	Для каждого ЗаписьНабора Из Наборзаписей Цикл
	
		ЗаписьНабора.Комментарий = Комментарий;
		ЗаписьНабора.ТекстОшибки = ?(ЭтоОшибка,Комментарий,"");
			
		//ЗаписьНабора.ИдентификаторОчереди = ?(Результат = Неопределено,"",Результат.ИдентификаторОчереди);
		Если Результат <> Неопределено  Тогда
			
			Если ХранитьПодробностиЛогирования тогда 
				ЗаписьНабора.Результат =Новый ХранилищеЗначения(Результат.РезультатJson,Новый СжатиеДанных(9));
			КонецЕсли; 
			
	    	ЗаписьНабора.ИдентификаторОчереди = Результат.ИдентификаторОчереди;
			
			//это нужно хранить всегда 
			Если Результат.Свойство("МассивДанных") Тогда
			
				ЗаписьНабора.МассивДанных = Новый ХранилищеЗначения(Результат.МассивДанных,Новый СжатиеДанных(9));  	
			
			КонецЕсли;
			
		КонецЕсли;
		//ЗаписьНабора.Результат = ?(Результат = Неопределено,"",Новый ХранилищеЗначения(Результат.РезультатJson));
		ЗаписьНабора.Отработано = Отработано;
		
		
	КонецЦикла;
	
	Попытка
	
		Наборзаписей.Записать(); 
	
	Исключение
		
		ЗаписьЖурналаРегистрации("ОшибкаЗапросаОбменЕЭ_ОстаткиЦО",УровеньЖурналаРегистрации.Ошибка,,,,);
	
	КонецПопытки;
	
КонецПроцедуры // ЗаписатьВЖурналЗапросыНаПолучениеЗаказовРезультат()


// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ЗаписатьВОчередьНаОтправку(Знач Заказ, ТипЗапроса,ПараметрыНаОтправку,МассивСообщений,МассивОшибок = неопределено) Экспорт 

	МенеджерЗаписи = РегистрыСведений.b2b_ЗапросыНаОбновление.СоздатьМенеджерЗаписи(); 
	МенеджерЗаписи.Документ = Заказ; 
	МенеджерЗаписи.ТипЗапроса = ТипЗапроса; 
	МенеджерЗаписи.ВходящиеПараметры = Новый ХранилищеЗначения(ПараметрыНаОтправку,Новый СжатиеДанных(9)); 
	МенеджерЗаписи.ДатаЗаписи = ТекущаяДатаСеанса(); 
	МенеджерЗаписи.ИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор); 
	Попытка
		
		МенеджерЗаписи.Записать(); 
		
	
	Исключение
	
	КонецПопытки;
	
	Сообщить("Записан в очередь на отправка запрос с типом " + ТипЗапроса);
	МассивСообщений.Добавить("Записан в очередь на отправка запрос с типом " + ТипЗапроса); 
	
	// сразу пока выполнение пока
	ТекстСообщения = ""; 
	ОтработатьЗапросыВОчереди(ТекстСообщения,МассивОшибок);
	
	МассивСообщений.Добавить(ТекстСообщения); 

КонецПроцедуры // ЗаписатьВОчередьНаОтправку()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура УдалитьИзОчередиДляОтработкиДокумент(Знач Документ,Знач типЗапроса) Экспорт 

	НаборЗаписей = РегистрыСведений.b2b_ЗапросыНаОбновление.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Документ); 
	НаборЗаписей.Отбор.ТипЗапроса.Установить(типЗапроса);
	НаборЗаписей.Записать(); 

КонецПроцедуры // УдалитьИзОчередиДляОтработкиДокумент()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьТекстJSON(Форма) Экспорт

	ЗаписьСервер  = Форма.РеквизитФормыВЗначение("Запись"); 
	ДанныеJSON 	  = ЗаписьСервер.Запрос.Получить(); 
	
	Возврат ДанныеJSON; 

КонецФункции // ПолучитьТекстJSON()

Функция ПолучитьТекстJSONРезультат(Форма,ИмяРесурса = "Результат") Экспорт

	ЗаписьСервер  = Форма.РеквизитФормыВЗначение("Запись"); 
	Структураjson 	  = ЗаписьСервер[ИмяРесурса].Получить(); 
	
	СтрокаJSON 	= ОтработатьЗаполненнуюСтруктуруОтвета(Структураjson);
	
	Возврат СтрокаJSON; 

КонецФункции //

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ЗаписатьВРегистрОбновленныеЗаказы(Знач Заказ, ДатаЗаписи) Экспорт 

	 МенеджерЗаписи = РегистрыСведений.b2b_ЗаказыОбновленные.СоздатьМенеджерЗаписи(); 
	 МенеджерЗаписи.Заказ = Заказ; 
	 МенеджерЗаписи.ДатаЗаписи = ДатаЗаписи; 
	 
	 Попытка
	 
	 	МенеджерЗаписи.Записать(); 
	 
	 Исключение
	 
	 КонецПопытки;

 КонецПроцедуры // ЗаписатьВРегистрОбновленныеЗаказа()
 
 Процедура ОчиститьРегистрОбновленныеЗаказыПоЗаказу(Знач Заказ, Знач ОчиститьВсе = Ложь) Экспорт 

	 НаборЗаписей = РегистрыСведений.b2b_ЗаказыОбновленные.СоздатьНаборЗаписей();
	 Если НЕ ОчиститьВсе Тогда 
		 НаборЗаписей.Отбор.Заказ.Установить(Заказ);
	 КонецЕсли;
	 НаборЗаписей.Записать();
	 
КонецПроцедуры

#КонецОбласти

#Область РегламентныеЗадания

Процедура b2b_ОбновитьЗаказы(ТаблицаПараметров = Неопределено) Экспорт 
	СоответствиеПараметров = Новый Соответствие; 
	Если ТаблицаПараметров <> Неопределено Тогда
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл 
			СоответствиеПараметров.Вставить(СтрокаТП.Имя,СтрокаТП.Значение); 
		КонецЦикла;
	КонецЕсли;
	
	ОбновленныеЗаказы = Новый Массив; 
	ПараметрыПолучения = Новый Структура;
		
	Если СоответствиеПараметров.Получить("Подразделение") <> неопределено Тогда
		
		ПараметрыПолучения.Вставить("Подразделение",СоответствиеПараметров.Получить("Подразделение")); 	
		
	КонецЕсли;

	b2b_ОбменЗаявками.ПолучениеДанныхПоЗаказам(ПараметрыПолучения,ОбновленныеЗаказы);
КонецПроцедуры

Процедура b2b_ОтработатьОтгруженныеЗаказы(ТаблицаПараметров = Неопределено) Экспорт
	СоответствиеПараметров = Новый Соответствие; 
	Если ТаблицаПараметров <> Неопределено Тогда
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл 
			СоответствиеПараметров.Вставить(СтрокаТП.Имя,СтрокаТП.Значение); 
		КонецЦикла;
	КонецЕсли;
	
	ПараметрыПолучения = Новый Структура;
	Если СоответствиеПараметров.Получить("Подразделение") <> неопределено Тогда
		
		ПараметрыПолучения.Вставить("Подразделение",СоответствиеПараметров.Получить("Подразделение")); 	
		
	КонецЕсли;
	ОтработатьОтгруженныеЗаказы(ПараметрыПолучения); 
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ОтработатьОтгруженныеЗаказы(ПараметрыПолучения)  Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		//"ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	b2b_СоответствиеРНКЗаказы.Заказ КАК Заказ,
		//|	b2b_СоответствиеРНКЗаказы.РНК.ДатаОтгрузки КАК ДатаОтгрузки,
		//|	b2b_СоответствиеРНКЗаказы.Заказ.НомерЗаказа КАК НомерЗаявки,
		//|	b2b_ЗаявкиКлиентов.СтатусЗаказа_b2b КАК СтатусЗаказа_b2b
		//|ПОМЕСТИТЬ ВТЗаказыДляОтработки
		//|ИЗ
		//|	РегистрСведений.b2b_СоответствиеРНКЗаказы КАК b2b_СоответствиеРНКЗаказы
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.b2b_ЗаявкиКлиентов КАК b2b_ЗаявкиКлиентов
		//|		ПО b2b_СоответствиеРНКЗаказы.Заказ = b2b_ЗаявкиКлиентов.Заказ
		//|ГДЕ
		//|	b2b_СоответствиеРНКЗаказы.РНК.СостояниеНакладной = &Отгружен
		//|	И НЕ b2b_ЗаявкиКлиентов.СтатусЗаказа_b2b В (&Выполнен)
		//|	И НЕ b2b_ЗаявкиКлиентов.Отгружен
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	b2b_ЗаявкиКлиентов.МетодДоставки КАК МетодДоставки,
		//|	ВТЗаказыДляОтработки.Заказ КАК Заказ
		//|ПОМЕСТИТЬ ВтМетодыДоставки
		//|ИЗ
		//|	ВТЗаказыДляОтработки КАК ВТЗаказыДляОтработки
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.b2b_ЗаявкиКлиентов КАК b2b_ЗаявкиКлиентов
		//|		ПО ВТЗаказыДляОтработки.Заказ = b2b_ЗаявкиКлиентов.Заказ
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	ВТЗаказыДляОтработки.Заказ КАК Заказ,
		//|	b2b_Дозаказы.ЗаказОсновной КАК ЗаказОсновной
		//|ПОМЕСТИТЬ ВТЗаказыСДозаказами
		//|ИЗ
		//|	ВТЗаказыДляОтработки КАК ВТЗаказыДляОтработки
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.b2b_Дозаказы КАК b2b_Дозаказы
		//|		ПО (b2b_Дозаказы.Заказ = ВТЗаказыДляОтработки.Заказ
		//|				ИЛИ b2b_Дозаказы.ЗаказОсновной = ВТЗаказыДляОтработки.Заказ)
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	ВТЗаказыСДозаказами.Заказ КАК Заказ
		//|ПОМЕСТИТЬ ВТДозаказы
		//|ИЗ
		//|	ВТЗаказыСДозаказами КАК ВТЗаказыСДозаказами
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.b2b_Дозаказы КАК b2b_Дозаказы
		//|		ПО (b2b_Дозаказы.Заказ = ВТЗаказыСДозаказами.Заказ)
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТЗаказыДляОтработки.Заказ КАК Заказ,
		//|	ВТЗаказыДляОтработки.ДатаОтгрузки КАК ДатаОтгрузки,
		//|	ВТЗаказыДляОтработки.НомерЗаявки КАК НомерЗаявки,
		//|	ВтМетодыДоставки.МетодДоставки КАК МетодДоставки,
		//|	ВЫБОР
		//|		КОГДА ВТЗаказыСДозаказами.Заказ ЕСТЬ NULL
		//|			ТОГДА ЛОЖЬ
		//|		ИНАЧЕ ИСТИНА
		//|	КОНЕЦ КАК ЕстьДозаказ,
		//|	ВЫБОР
		//|		КОГДА ВТДозаказы.Заказ ЕСТЬ NULL
		//|			ТОГДА ЛОЖЬ
		//|		ИНАЧЕ ИСТИНА
		//|	КОНЕЦ КАК ЭтоДозаказ,
		//|	ЕСТЬNULL(ВТЗаказыСДозаказамиОсн.Заказ, ЗНАЧЕНИЕ(Документ.Заказ.ПустаяСсылка)) КАК Дозаказ,
		//|	ЕСТЬNULL(ВТЗаказыСДозаказами.ЗаказОсновной, ЗНАЧЕНИЕ(Документ.Заказ.ПустаяСсылка)) КАК ЗаказОсновной,
		//|	ВТЗаказыДляОтработки.СтатусЗаказа_b2b КАК СтатусЗаказа_b2b
		//|ИЗ
		//|	ВТЗаказыДляОтработки КАК ВТЗаказыДляОтработки
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтМетодыДоставки КАК ВтМетодыДоставки
		//|		ПО ВТЗаказыДляОтработки.Заказ = ВтМетодыДоставки.Заказ
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаказыСДозаказами КАК ВТЗаказыСДозаказами
		//|		ПО ВТЗаказыДляОтработки.Заказ = ВТЗаказыСДозаказами.Заказ
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаказыСДозаказами КАК ВТЗаказыСДозаказамиОсн
		//|		ПО ВТЗаказыДляОтработки.Заказ = ВТЗаказыСДозаказамиОсн.ЗаказОсновной
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДозаказы КАК ВТДозаказы
		//|		ПО ВТЗаказыДляОтработки.Заказ = ВТДозаказы.Заказ";
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	b2b_СоответствиеРНКЗаказы.Ссылка КАК Заказ,
		|	b2b_СоответствиеРНКЗаказы.Документ КАК РНК
		|ПОМЕСТИТЬ ВтРНКНеОтгруженные
		|ИЗ
		|	Документ.Заказ.РасходныеНакладные КАК b2b_СоответствиеРНКЗаказы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.b2b_ЗаявкиКлиентов КАК b2b_ЗаявкиКлиентов
		|		ПО b2b_СоответствиеРНКЗаказы.Ссылка = b2b_ЗаявкиКлиентов.Заказ
		|			И (b2b_СоответствиеРНКЗаказы.Документ.Проведен)
		|			И (b2b_СоответствиеРНКЗаказы.Документ.СостояниеНакладной <> &Отгружен)
		|ГДЕ
		|	НЕ b2b_ЗаявкиКлиентов.СтатусЗаказа_b2b В (&Выполнен)
		|	И НЕ b2b_ЗаявкиКлиентов.Отгружен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	b2b_СоответствиеРНКЗаказы.Ссылка КАК Заказ,
		|	b2b_СоответствиеРНКЗаказы.Документ.ДатаОтгрузки КАК ДатаОтгрузки,
		|	b2b_СоответствиеРНКЗаказы.Ссылка.НомерЗаказа КАК НомерЗаявки,
		|	b2b_ЗаявкиКлиентов.СтатусЗаказа_b2b КАК СтатусЗаказа_b2b
		|ПОМЕСТИТЬ ВТЗаказыДляОтработки
		|ИЗ
		|	Документ.Заказ.РасходныеНакладные КАК b2b_СоответствиеРНКЗаказы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.b2b_ЗаявкиКлиентов КАК b2b_ЗаявкиКлиентов
		|		ПО b2b_СоответствиеРНКЗаказы.Ссылка = b2b_ЗаявкиКлиентов.Заказ
		|			И (b2b_СоответствиеРНКЗаказы.Документ.Проведен)
		|			И (b2b_СоответствиеРНКЗаказы.Документ.СостояниеНакладной = &Отгружен)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтРНКНеОтгруженные КАК ВтРНКНеОтгруженные
		|		ПО b2b_СоответствиеРНКЗаказы.Документ = ВтРНКНеОтгруженные.РНК
		|			И b2b_СоответствиеРНКЗаказы.Ссылка = ВтРНКНеОтгруженные.Заказ
		|ГДЕ
		|	НЕ b2b_ЗаявкиКлиентов.СтатусЗаказа_b2b В (&Выполнен)
		|	И НЕ b2b_ЗаявкиКлиентов.Отгружен
		|	И ВтРНКНеОтгруженные.РНК ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	b2b_ЗаявкиКлиентов.МетодДоставки КАК МетодДоставки,
		|	ВТЗаказыДляОтработки.Заказ КАК Заказ
		|ПОМЕСТИТЬ ВтМетодыДоставки
		|ИЗ
		|	ВТЗаказыДляОтработки КАК ВТЗаказыДляОтработки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.b2b_ЗаявкиКлиентов КАК b2b_ЗаявкиКлиентов
		|		ПО ВТЗаказыДляОтработки.Заказ = b2b_ЗаявкиКлиентов.Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТЗаказыДляОтработки.Заказ КАК Заказ,
		|	b2b_Дозаказы.ЗаказОсновной КАК ЗаказОсновной
		|ПОМЕСТИТЬ ВТЗаказыСДозаказами
		|ИЗ
		|	ВТЗаказыДляОтработки КАК ВТЗаказыДляОтработки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.b2b_Дозаказы КАК b2b_Дозаказы
		|		ПО (b2b_Дозаказы.Заказ = ВТЗаказыДляОтработки.Заказ
		|				ИЛИ b2b_Дозаказы.ЗаказОсновной = ВТЗаказыДляОтработки.Заказ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТЗаказыСДозаказами.Заказ КАК Заказ
		|ПОМЕСТИТЬ ВТДозаказы
		|ИЗ
		|	ВТЗаказыСДозаказами КАК ВТЗаказыСДозаказами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.b2b_Дозаказы КАК b2b_Дозаказы
		|		ПО (b2b_Дозаказы.Заказ = ВТЗаказыСДозаказами.Заказ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТЗаказыДляОтработки.Заказ КАК Заказ,
		|	ВТЗаказыДляОтработки.ДатаОтгрузки КАК ДатаОтгрузки,
		|	ВТЗаказыДляОтработки.НомерЗаявки КАК НомерЗаявки,
		|	ВтМетодыДоставки.МетодДоставки КАК МетодДоставки,
		|	ВЫБОР
		|		КОГДА ВТЗаказыСДозаказами.Заказ ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьДозаказ,
		|	ВЫБОР
		|		КОГДА ВТДозаказы.Заказ ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЭтоДозаказ,
		|	ЕСТЬNULL(ВТЗаказыСДозаказамиОсн.Заказ, ЗНАЧЕНИЕ(Документ.Заказ.ПустаяСсылка)) КАК Дозаказ,
		|	ЕСТЬNULL(ВТЗаказыСДозаказами.ЗаказОсновной, ЗНАЧЕНИЕ(Документ.Заказ.ПустаяСсылка)) КАК ЗаказОсновной,
		|	ВТЗаказыДляОтработки.СтатусЗаказа_b2b КАК СтатусЗаказа_b2b
		|ИЗ
		|	ВТЗаказыДляОтработки КАК ВТЗаказыДляОтработки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтМетодыДоставки КАК ВтМетодыДоставки
		|		ПО ВТЗаказыДляОтработки.Заказ = ВтМетодыДоставки.Заказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаказыСДозаказами КАК ВТЗаказыСДозаказами
		|		ПО ВТЗаказыДляОтработки.Заказ = ВТЗаказыСДозаказами.Заказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаказыСДозаказами КАК ВТЗаказыСДозаказамиОсн
		|		ПО ВТЗаказыДляОтработки.Заказ = ВТЗаказыСДозаказамиОсн.ЗаказОсновной
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДозаказы КАК ВТДозаказы
		|		ПО ВТЗаказыДляОтработки.Заказ = ВТДозаказы.Заказ";

	
	
	Выполненные = Новый Массив; 
	Выполненные.Добавить(Перечисления.b2b_СтатусыЗаказов.Выполнена); 
	Выполненные.Добавить(Перечисления.b2b_СтатусыЗаказов.Отменена);
	
	Запрос.УстановитьПараметр("Выполнен", Выполненные); //Перечисления.b2b_СтатусыЗаказов.Выполнена);
	Запрос.УстановитьПараметр("Отгружен", Перечисления.СостоянияНакладной.Отгружена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ОтправленныеЗапросыПоЗаказам = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ОтправленныеЗапросыПоЗаказам.Найти(ВыборкаДетальныеЗаписи.Заказ) <> неопределено  Тогда
			
			Продолжить; 	
			
		КонецЕсли;   
		
		ПараметрыНаОтправку = Новый Структура;
		ПараметрыНаОтправку.Вставить("НомерЗаявки",ВыборкаДетальныеЗаписи.НомерЗаявки);
		Если ПараметрыПолучения.Свойство("Подразделение") Тогда
		
			ПараметрыНаОтправку.Вставить("Подразделение",ПараметрыПолучения.Подразделение); 	
		Иначе 
			ПараметрыНаОтправку.Вставить("Подразделение",Справочники.Подразделения.НайтиПоКоду("SSP-0001"));
		КонецЕсли;
		ТипЗапроса = "ОтправитьДатуОтгрузкиВместе";
		ПараметрыНаОтправку.Вставить("ДатаОтгрузкиЗаказа",ВыборкаДетальныеЗаписи.ДатаОтгрузки);
		
		Если ВыборкаДетальныеЗаписи.МетодДоставки = "F"  Тогда
			
			Если ВыборкаДетальныеЗаписи.ЭтоДозаказ
				И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ЗаказОсновной) Тогда
				
				ТипЗапроса = "ОтправитьДатуОтгрузкиВместе";
				
				ПараметрыНаОтправку.Вставить("ДатаОтгрузкиЗаказа",ВыборкаДетальныеЗаписи.ДатаОтгрузки);
				
				ОтправленныеЗапросыПоЗаказам.Добавить(ВыборкаДетальныеЗаписи.Заказ);
				ОтправленныеЗапросыПоЗаказам.Добавить(ВыборкаДетальныеЗаписи.ЗаказОсновной);
				
			ИначеЕсли ВыборкаДетальныеЗаписи.ЭтоДозаказ
				И НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ЗаказОсновной) тогда 
				
				ТипЗапроса = "ОтправитьДатуОтгрузкиОтдельно";
				
				ПараметрыНаОтправку = Новый Структура;
				ПараметрыНаОтправку.Вставить("НомерЗаявки",ВыборкаДетальныеЗаписи.НомерЗаявки);
				ПараметрыНаОтправку.Вставить("ДатаОтгрузкиДозаказа",ВыборкаДетальныеЗаписи.ДатаОтгрузки);
				ПараметрыНаОтправку.Вставить("МетодДоставки","P");
				
				ОтправленныеЗапросыПоЗаказам.Добавить(ВыборкаДетальныеЗаписи.Заказ);
				
			ИначеЕсли 	НЕ ВыборкаДетальныеЗаписи.ЭтоДозаказ
				И   ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Дозаказ) Тогда
				
				ТипЗапроса = "ОтправитьДатуОтгрузкиВместе";
				
				ПараметрыНаОтправку.Вставить("ДатаОтгрузкиЗаказа",ВыборкаДетальныеЗаписи.ДатаОтгрузки);
				
				ОтправленныеЗапросыПоЗаказам.Добавить(ВыборкаДетальныеЗаписи.Заказ);
				ОтправленныеЗапросыПоЗаказам.Добавить(ВыборкаДетальныеЗаписи.Дозаказ); 
				
			ИначеЕсли 	НЕ ВыборкаДетальныеЗаписи.ЭтоДозаказ
				И   НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Дозаказ) Тогда
				
				ТипЗапроса = "ОтправитьДатуОтгрузкиОтдельно";
				
				ПараметрыНаОтправку = Новый Структура;
				ПараметрыНаОтправку.Вставить("НомерЗаявки",ВыборкаДетальныеЗаписи.НомерЗаявки);
				ПараметрыНаОтправку.Вставить("ДатаОтгрузкиЗаказа",ВыборкаДетальныеЗаписи.ДатаОтгрузки);
				ПараметрыНаОтправку.Вставить("МетодДоставки","P");
				
				ОтправленныеЗапросыПоЗаказам.Добавить(ВыборкаДетальныеЗаписи.Заказ);
				
			КонецЕсли;
			
			
			
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.МетодДоставки = "P"  Тогда
			
			ТипЗапроса = "ОтправитьДатуОтгрузкиОтдельно";
			
			ПараметрыНаОтправку = Новый Структура;
			ПараметрыНаОтправку.Вставить("НомерЗаявки",ВыборкаДетальныеЗаписи.НомерЗаявки);
		
			Если ВыборкаДетальныеЗаписи.ЭтоДозаказ   Тогда
				
				ПараметрыНаОтправку.Вставить("ДатаОтгрузкиДозаказа",ВыборкаДетальныеЗаписи.ДатаОтгрузки);
				
			Иначе
				ПараметрыНаОтправку.Вставить("ДатаОтгрузкиЗаказа",ВыборкаДетальныеЗаписи.ДатаОтгрузки); 			 
			
			КонецЕсли;
			
			ОтправленныеЗапросыПоЗаказам.Добавить(ВыборкаДетальныеЗаписи.Заказ);

			
		КонецЕсли; 
			
		МассивСообщений = Новый Массив; 
		b2b_ОбменЗаявками.ЗаписатьВОчередьНаОтправку(ВыборкаДетальныеЗаписи.Заказ,ТипЗапроса,ПараметрыНаОтправку,МассивСообщений);
		
		
	КонецЦикла;
	
	

КонецПроцедуры // ОтгработатьОтгруженныеЗаказы()

Процедура b2b_ЗагрузитьДанныеПоПунктамДоставки(Ключ) Экспорт
	ЗагрузитьДанныеПоПунктамДоставки(); 
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ЗагрузитьДанныеПоПунктамДоставки() Экспорт
	
		
	ДанныеДляОтправкиЗапроса = ПолучитьПараметрыМетодаЗагрузкиПунктовДоставки();
	Если НЕ ЗначениеЗаполнено(ДанныеДляОтправкиЗапроса.IDПользователяНаСайте) Тогда
		
		ЗаписатьОшибкуВЖурнал("","Не задан логин пользователя для отправки запроса на сайт ""Загрузить данные по пунктам доставки (b2b)"" "); 
		Возврат; 
	КонецЕсли;
	
	ВходныеПараметры = Новый Структура("IDПользователя",ДанныеДляОтправкиЗапроса.IDПользователяНаСайте);
	
	ПолучениеДанныхПоПунктамДоставки(ВходныеПараметры); 

КонецПроцедуры // ()

Процедура b2b_ОбновитьОстаткиДистрибьютораНаСайте(Ключ) Экспорт
	 ОбновитьОстаткиДистрибьютораНаСайте(); 
 КонецПроцедуры
 
 // <Описание процедуры>
 //
 // Параметры:
 //  <Параметр1>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //  <Параметр2>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //
 Процедура ОбновитьОстаткиДистрибьютораНаСайте(ТолькоИзменения = Истина) Экспорт
 
	 ПараметрыДляВыгрузкиОстатков = Новый Структура;
	 
	 НастройкиДляВыгрузкиОстатков = ПолучитьПараметрыМетодаВыгрузкиОстатковДистрибьютора(); 
	 
	 ПараметрыДляВыгрузкиОстатков.Вставить("IDПользователя",НастройкиДляВыгрузкиОстатков.IDПользователяНаСайте); 
	 ПараметрыДляВыгрузкиОстатков.Вставить("ЗаписыватьШтрихкод",НастройкиДляВыгрузкиОстатков.ВыгружатьШтрихКодПоОстаткам); 
	 
	 ПотокМассивовТоваров = ОстаткиДляОтправкиНаСайт(ТолькоИзменения); 
	 Сч = 1; 
	 Для каждого  МассивТоваров Из ПотокМассивовТоваров Цикл
		 
		 ПараметрыДляВыгрузкиОстатков.Вставить("Товары",МассивТоваров);
		 
		 МассивСообщений = Новый Массив; 
		 b2b_ОбменЗаявками.ЗаписатьВОчередьНаОтправку("Остатки","ВыгрузкаОстатков" + Формат(Сч,"ЧГ=0"),ПараметрыДляВыгрузкиОстатков,МассивСообщений);	
		 Сч = Сч + 1; 
	 КонецЦикла;
			

 
 КонецПроцедуры // ОбновитьОстаткиДистрибьютораНаСайте()
 
 Процедура b2b_ОбновитьОсновныеОстатки(Ключ) Экспорт
	 ПолучитьРезультатОбработкиОчередиНаСайте(); 
	 ОбновитьОсновныеОстаткиb2b(Истина); 
 КонецПроцедуры

Процедура b2b_ОбновитьОстаткиДистрибьютораНаСайтеПолная(Ключ) Экспорт
	ОбновитьОстаткиДистрибьютораНаСайте(ЛОЖЬ); 
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ПолучитьРезультатОбработкиОчередиНаСайте()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	b2b_ЗапросыНаОбновлениеВОчереди.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
		|	b2b_ЗапросыНаОбновлениеВОчереди.ИдентификаторКлиента КАК ИдентификаторКлиента,
		|	b2b_ЗапросыНаОбновлениеВОчереди.МассивДанных КАК МассивДанных
		|ИЗ
		|	РегистрСведений.b2b_ЗапросыНаОбновлениеВОчереди КАК b2b_ЗапросыНаОбновлениеВОчереди
		|ГДЕ
		|	b2b_ЗапросыНаОбновлениеВОчереди.ИдентификаторКлиента <> """"
		|	И НЕ b2b_ЗапросыНаОбновлениеВОчереди.Отработано
		|	И (ВЫРАЗИТЬ(b2b_ЗапросыНаОбновлениеВОчереди.ТекстОшибки КАК СТРОКА(500))) = """"
		|	И b2b_ЗапросыНаОбновлениеВОчереди.ТипЗапроса ПОДОБНО ""ВыгрузкаОстатковЦО%""
		|
		|УПОРЯДОЧИТЬ ПО
		|	b2b_ЗапросыНаОбновлениеВОчереди.Период";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	РезультатОтправки = Ложь; 
	
	МассивОшибок = Новый массив; 
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПараметрыДляОтправкиЗапроса = Новый Структура; 
		ПараметрыДляОтправкиЗапроса.Вставить("ИдентификаторКлиента",ВыборкаДетальныеЗаписи.ИдентификаторКлиента);
		ПараметрыДляОтправкиЗапроса.Вставить("ИдентификаторЗапроса",ВыборкаДетальныеЗаписи.ИдентификаторЗапроса);
		ПараметрыДляОтправкиЗапроса.Вставить("Товары",ВыборкаДетальныеЗаписи.МассивДанных.Получить()); 
		ПараметрыДляОтправкиЗапроса.Вставить("ТипЗапроса","Отработка очереди по остаткам ЦО"); 
		
		ОтработкаОтправленныхДанныхПоОстаткамЦО(ПараметрыДляОтправкиЗапроса,РезультатОтправки,МассивОшибок); 
		
	КонецЦикла;
	
	Если МассивОшибок.Количество() > 0 Тогда
		//вывв=едем в письме только одну
		ТемаПисьма = "Ошибка отработки очереди  по остаткам  из SNL на портале."; 
		ТекстПисьма = МассивОшибок[0] + Символы.ПС + ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));  
		СформироватьВнутреннееУведомлениеОбОшибке(ТекстПисьма,ТемаПисьма,"Ошибка отправки остатков на портал из SNL");	
		
	КонецЕсли;
	
	


КонецПроцедуры // ()



// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ОбновитьОсновныеОстаткиb2b(ТолькоИзменения = Ложь) Экспорт

	 ПараметрыДляВыгрузкиОстатков = Новый Структура;
	 
	 НастройкиДляВыгрузкиОстатков = ПолучитьПараметрыМетодаВыгрузкиОстатковОсновного(); 
	 
	 ПотокМассивовТоваров = ОстаткиДляОтправкиНаСайт(ТолькоИзменения,истина); 
	 Сч = 1;
	 ИдентификаторЗапроса = Новый УникальныйИдентификатор;
	 
	 ПараметрыДляВыгрузкиОстатков.Вставить("ИдентификаторЗапроса",Строка(ИдентификаторЗапроса)); 
	 
	 МассивСообщений = Новый Массив; 
	 МассивОшибок = Новый Массив; 
	 Для каждого  МассивТоваров Из ПотокМассивовТоваров Цикл
		 
		 ПараметрыДляВыгрузкиОстатков.Вставить("Товары",МассивТоваров);  	 
		 
		 b2b_ОбменЗаявками.ЗаписатьВОчередьНаОтправку("ОстаткиЦО","ВыгрузкаОстатковЦО" + Формат(Сч,"ЧГ=0"),ПараметрыДляВыгрузкиОстатков,МассивСообщений,МассивОшибок);	
		 Сч = Сч + 1; 
	 КонецЦикла;
	 
	 Если МассивОшибок.Количество() > 0 Тогда
		 //только одну выведем
		 ТемаПисьма = "Ошибка отправки остатков на портал из SNL."; 
		 ТекстПисьма = МассивОшибок[0] + Символы.ПС + ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы())); 
		 СформироватьВнутреннееУведомлениеОбОшибке(ТекстПисьма,ТемаПисьма,"Ошибка отправки остатков на портал из SNL");	
		 
	 КонецЕсли;
	 
	 
	
КонецПроцедуры // ()

Процедура b2b_ОбновитьОсновныеОстаткиПолная(Ключ) Экспорт
	ПолучитьРезультатОбработкиОчередиНаСайте(); 
	ОбновитьОсновныеОстаткиb2b(ЛОЖЬ);
КонецПроцедуры


	
#КонецОбласти

#Область ОбщиеПроцедурыФункциияРаботыСЗаявками

Процедура ПолучитьОстаткиПоЗаявкам(СписокНоменклатуры,Склад,МассивНакладных,КэшОстатков) Экспорт
	Если СписокНоменклатуры.ВГраница()<0 Тогда 
		Возврат 
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Возврат 
	КонецЕсли;
	
	МассивСкладов = Новый Массив();
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	Сводный.Номенклатура.Код77 КАК Код77,
	|	Сводный.Номенклатура КАК Номенклатура,
	|	СУММА(Сводный.Остаток) КАК Остаток,
	|	СУММА(Сводный.Резерв) КАК Резерв,
	|	СУММА(Сводный.ВиртуальныйРезерв) КАК ВиртуальныйРезерв
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЕСТЬNULL(Остатки.Номенклатура, Резервы.Номенклатура) КАК Номенклатура,
	|		ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК Остаток,
	|		ЕСТЬNULL(Резервы.КоличествоОстаток, 0) КАК Резерв,
	|		0 КАК ВиртуальныйРезерв
	|	ИЗ
	|		РегистрНакопления.ОстаткиТМЦ.Остатки(
	|				,
	|				Склад В (&МассивСкладов)
	|					И Номенклатура В (&СписокНоменклатуры)) КАК Остатки
	|			ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	|					,
	|					Склад В (&МассивСкладов)
	|						И Номенклатура В (&СписокНоменклатуры)) КАК Резервы
	|			ПО Остатки.Номенклатура = Резервы.Номенклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОстаткиТМЦ.Номенклатура,
	|		ОстаткиТМЦ.Количество,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ
	|	ГДЕ
	|		ОстаткиТМЦ.Регистратор в (&Регистратор)
	|		И ОстаткиТМЦ.Склад В(&МассивСкладов)
	|		И ОстаткиТМЦ.ВидДвижения = &Расход
	|		И ОстаткиТМЦ.Номенклатура В(&СписокНоменклатуры)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РезервыТМЦ.Номенклатура,
	|		0,
	|		-РезервыТМЦ.Количество,
	|		0
	|	ИЗ
	|		РегистрНакопления.РезервыТМЦ КАК РезервыТМЦ
	|	ГДЕ
	|		РезервыТМЦ.Регистратор В (&Регистратор)
	|		И РезервыТМЦ.Склад В(&МассивСкладов)
	|		И РезервыТМЦ.Номенклатура В(&СписокНоменклатуры)) КАК Сводный
	|
	|СГРУППИРОВАТЬ ПО
	|	Сводный.Номенклатура,
	|	Сводный.Номенклатура.Код77
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сводный.Номенклатура";
	
	Запрос.УстановитьПараметр("Расход",ВидДвиженияНакопления.Расход);	
	Запрос.УстановитьПараметр("Регистратор",МассивНакладных);
	Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
	
	МассивСкладов.Добавить(Склад);
	
	Если ТипЗнч(МассивНакладных) = Тип("Массив")  Тогда
	
		Для каждого НакладнаяЗаказ Из  МассивНакладных Цикл
			
			Если ТипЗнч(НакладнаяЗаказ) = Тип("ДокументСсылка.Заказ") Тогда
				
				Для каждого СкладСтрока Из НакладнаяЗаказ.ДополнительныеСклады Цикл
					
					МассивСкладов.Добавить(СкладСтрока.Склад);	
					
				КонецЦикла;	
				
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли  ТипЗнч(МассивНакладных) = Тип("ДокументСсылка.Заказ") Тогда
		
		Для каждого СкладСтрока Из МассивНакладных.ДополнительныеСклады Цикл
			
			МассивСкладов.Добавить(СкладСтрока.Склад);	
			
		КонецЦикла;
	КонецЕсли;
	
		
	Запрос.УстановитьПараметр("МассивСкладов", МассивСкладов);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл	
		КэшОстатков.Вставить(Выборка.Номенклатура,Новый Структура("Остаток,Резерв,СвободныйОстаток,Код77",Выборка.Остаток,Выборка.Резерв,Макс(0,Выборка.Остаток-Выборка.Резерв-Выборка.ВиртуальныйРезерв),Выборка.Код77));	
	КонецЦикла;
	
КонецПроцедуры 

Процедура ОтправитьЗапросДоЗаказНаСервере(ЗаказыНаДоЗаказ,РезультатОтработки,ИдентификаторОчереди,ИдентификаторЗапроса = Неопределено)  Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕЭ_ДозаказыСрезПоследних.Заказ КАК Заказ,
		|	ЕЭ_ДозаказыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЕЭ_ДозаказыСрезПоследних.Количество КАК Количество,
		|	ЗаказДок.НомерЗаказа КАК НомерЗаявки,
		|	ЗаказДок.ИдЗаказа КАК IDЗаявки,
		|	ЕЭ_ДозаказыСрезПоследних.Комментарий КАК Комментарий,
		|	ЕЭ_ДозаказыСрезПоследних.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
		|	ЕЭ_ДозаказыСрезПоследних.Номенклатура.Код КАК Код,
		|	ЕЭ_ДозаказыСрезПоследних.ЗаказОсновной КАК ЗаказОсновной,
		|	ЕЭ_ДозаказыСрезПоследних.ПунктДоставки КАК ПунктДоставки,
		|	ЕЭ_ДозаказыСрезПоследних.Контрагент КАК Контрагент
		|ИЗ
		|	РегистрСведений.b2b_Дозаказы КАК ЕЭ_ДозаказыСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заказ КАК ЗаказДок
		|		ПО ЕЭ_ДозаказыСрезПоследних.Заказ = ЗаказДок.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
		|		ПО ЕЭ_ДозаказыСрезПоследних.Номенклатура = НоменклатураСпр.Ссылка
		|ГДЕ
		|	ЕЭ_ДозаказыСрезПоследних.Заказ В(&МассивЗаказов)
		|ИТОГИ
		|	МАКСИМУМ(НомерЗаявки),
		|	МАКСИМУМ(IDЗаявки),
		|	МАКСИМУМ(ЖелаемаяДатаОтгрузки),
		|	МАКСИМУМ(ЗаказОсновной),
		|	МАКСИМУМ(ПунктДоставки),
		|	МАКСИМУМ(Контрагент)
		|ПО
		|	Заказ";
	
	Запрос.УстановитьПараметр("МассивЗаказов", ЗаказыНаДоЗаказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗаказ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОтправленныеУспешно = Новый Массив;
	
	Пока ВыборкаЗаказ.Следующий() Цикл
		
		ВходныеПараметры = СтруктураДоЗаказа(); 
		ЗаполнитьЗначенияСвойств(ВходныеПараметры,ВыборкаЗаказ); 
		ВходныеПараметры.Вставить("ТипЗапроса","СоздатьДозаказ"); 
		
		ВыборкаДетальныеЗаписи = ВыборкаЗаказ.Выбрать();
		
		//Комментарии = Новый Массив;
		Комментарий = ""; 
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			// Вставить обработку выборки ВыборкаДетальныеЗаписи
			//Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Комментарий) Тогда
			
			//Комментарии.Добавить(ВыборкаДетальныеЗаписи.Комментарий); 	
			Комментарий = ВыборкаДетальныеЗаписи.Комментарий; 
			//КонецЕсли;
			
			СтруктураТовара = Новый Структура("IDТовара,Количество"); 
			
			СтруктураТовара.IDТовара  = ПолучитьКодТовараДляПортала(ВыборкаДетальныеЗаписи.Номенклатура); 
			СтруктураТовара.Количество = ВыборкаДетальныеЗаписи.Количество;
			
			ВходныеПараметры.Товары.Добавить(СтруктураТовара); 
		КонецЦикла;
		
		ВходныеПараметры.Комментарий = Комментарий; //СтрСоединить(Комментарии,";"); 
		
		ЗаказОсновной = ВыборкаЗаказ.ЗаказОсновной;
		Количество0 = ЗаказОсновной = ВыборкаЗаказ.Заказ; 
		
		Для каждого ТоварЗаказа Из ЗаказОсновной.Товары Цикл
			
			СтруктураТовара = Новый Структура("IDТовара,Количество,Цена"); 
			
			СтруктураТовара.IDТовара  = ПолучитьКодТовараДляПортала(ТоварЗаказа.Номенклатура); 
			СтруктураТовара.Количество = ?(Количество0,0,ТоварЗаказа.Количество);
			СтруктураТовара.Цена = ТоварЗаказа.Цена; 
			
			ВходныеПараметры.ТоварыВНаличии.Добавить(СтруктураТовара);	
			
		КонецЦикла;
		
		ВходныеПараметры.Вставить("ИдентификаторОчереди",ИдентификаторОчереди); 
		 
		b2b_ОбменЗаявками.ОтправкаНаСозданиеДоЗаказа(ВходныеПараметры,ОтправленныеУспешно,ИдентификаторЗапроса); 
	КонецЦикла;
	
	РезультатОтработки = ОтправленныеУспешно.Количество() > 0 ; 
	
	//Для каждого ОтправленУспешно Из ОтправленныеУспешно Цикл
	//	
	//	//ПараметрыДляЗаписи = Новый Структура;  
	//	//b2b_ОбменЗаявками.ЗаписатьДополнительныеДанныеВРегистрДоЗаказов(ОтправленУспешно,ПараметрыДляЗаписи,Истина); 	
	//	УдалитьИзОчередиНаОтправку(); 
	//	
	//КонецЦикла;
	
		
КонецПроцедуры // ОтправитьЗапросДоЗаказНаСервере()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьКодТовараДляПортала(Знач Номенклатура) экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Код КАК ОсновнойКод,
		|	Номенклатура1.Код КАК КодРодителя
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура1
		|		ПО Номенклатура.Родитель = Номенклатура1.Ссылка
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	
		Возврат ВыборкаДетальныеЗаписи.КодРодителя + "#"+ ВыборкаДетальныеЗаписи.ОсновнойКод; 	
	
	КонецЕсли;
	
	Возврат Номенклатура.Код; 

	

КонецФункции // ПолучитьКодТовараДляДозаказа()


Функция СтруктураДоЗаказа()

	Структура = Новый Структура; 
	Структура.Вставить("Заказ","");
	Структура.Вставить("НомерЗаявки","");
	Структура.Вставить("IDЗаявки","");
	Структура.Вставить("ЖелаемаяДатаОтгрузки");
	Структура.Вставить("ПунктДоставки");
	Структура.Вставить("Контрагент");
	Структура.Вставить("Комментарий");
	Структура.Вставить("ИНН",ПолучитьПараметрыДистрибьютора());
	Структура.Вставить("Товары", Новый Массив);
	Структура.Вставить("ТоварыВНаличии", Новый Массив);
	
	Возврат Структура; 
	
КонецФункции // СтруктураДоЗаказа()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ЗаписатьСоответствиеРНКЗаказ(Знач Заказ,Знач РНК)Экспорт

	 МенеджерЗаписи = РегистрыСведений.b2b_СоответствиеРНКЗаказы.СоздатьМенеджерЗаписи(); 
	 МенеджерЗаписи.Заказ = Заказ;
	 МенеджерЗаписи.РНК = РНК;
	 МенеджерЗаписи.ДатаИзменения = ТекущаяДатаСеанса();
	 МенеджерЗаписи.Пользователь = ПараметрыСеанса.Пользователь; 
	 
	 Попытка
	 
	 	 МенеджерЗаписи.Записать(); 
	 
	 Исключение
	 
	 КонецПопытки;

 КонецПроцедуры // ЗаписатьСоответствиеРНКЗаказ()
 
 // <Описание функции>
 //
 // Параметры:
 //  <Параметр1>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //  <Параметр2>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //
 // Возвращаемое значение:
 //   <Тип.Вид>   - <описание возвращаемого значения>
 //
 Функция ПроверитьСвязьСРНК(Знач Заказ, РНК) Экспорт
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	b2b_СоответствиеРНКЗаказы.РНК КАК РНК
	 |ИЗ
	 |	РегистрСведений.b2b_СоответствиеРНКЗаказы КАК b2b_СоответствиеРНКЗаказы
	 |ГДЕ
	 |	b2b_СоответствиеРНКЗаказы.Заказ = &Заказ";  
	 
	 Запрос.УстановитьПараметр("Заказ", Заказ);
	 
	 РезультатЗапроса = Запрос.Выполнить();
	 
	 РезультатСвязи =  РезультатЗапроса.Пустой(); 

     Если НЕ РезультатСвязи Тогда
	 
	 	Выборка = РезультатЗапроса.Выбрать(); 
		
		Выборка.Следующий(); 
		
		РНК = Выборка.РНК; 
	 
	КонецЕсли;
	
	Возврат РезультатСвязи; 
	
КонецФункции // ПроверитьСвязьСРНК()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция МетодДоставкиПоЗаказу(Знач Заказ) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	b2b_ЗаявкиКлиентов.МетодДоставки КАК МетодДоставки
		|ИЗ
		|	РегистрСведений.b2b_ЗаявкиКлиентов КАК b2b_ЗаявкиКлиентов
		|ГДЕ
		|	b2b_ЗаявкиКлиентов.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.МетодДоставки;  
		
	КонецЕсли;
	
	Возврат ""; 
	
КонецФункции // МетодДоставкиПоЗакауз()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция СтатусЗаявкиПоЗаказу(Знач Заказ) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	b2b_ЗаявкиКлиентов.СтатусЗаказа_b2b КАК СтатусЗаказа_b2b
		|ИЗ
		|	РегистрСведений.b2b_ЗаявкиКлиентов КАК b2b_ЗаявкиКлиентов
		|ГДЕ
		|	b2b_ЗаявкиКлиентов.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.СтатусЗаказа_b2b;  
		
	КонецЕсли;
	
	Возврат Перечисления.b2b_СтатусыЗаказов.ПустаяСсылка(); 
	
КонецФункции // МетодДоставкиПоЗакауз()

Функция СтатусДозаказаПоЗаказу(Знач Заказ) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	b2b_Дозаказы.СтатусДоЗаказа_b2b КАК СтатусДоЗаказа_b2b
		|ИЗ
		|	РегистрСведений.b2b_Дозаказы КАК b2b_Дозаказы
		|ГДЕ
		|	b2b_Дозаказы.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.СтатусДоЗаказа_b2b;  
		
	КонецЕсли;
	
	Возврат Перечисления.b2b_СтатусыДоЗаказов.ПустаяСсылка(); 
	
КонецФункции 
 
 // <Описание процедуры>
 //
 // Параметры:
 //  <Параметр1>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //  <Параметр2>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //
 Процедура СоздатьРНКНаОснованииЗаказа(Знач Заказ) Экспорт
 
 	
 
 КонецПроцедуры // СоздатьРНКНаОснованииЗаказа()
 
 
 // <Описание процедуры>
 //
 // Параметры:
 //  <Параметр1>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //  <Параметр2>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //
 Процедура ПересчетЦены(Знач ДокументОбъект, Скидка) Экспорт
	 
	ДокументОбъект.Скидка = Скидка; 
 	ИмяРеквизитаЦены = "ЦенаБезСкидки";
	Контрагент = ДокументОбъект.Контрагент;
	
	Если ДокументОбъект.Договор.НеИспользоватьМатрицу  Тогда
		НеИспользоватьМатрицуПоДоговору=Истина;
	иначе
		НеИспользоватьМатрицуПоДоговору=ложь;
	КонецЕсли;	
	
	
	ИспользоватьНоменклатурнуюМатрицу = Ложь; 
	Если контрагент.ИспользоватьНоменклатурнуюМатрицу и не НеИспользоватьМатрицуПоДоговору Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Матрица.Ссылка КАК Ссылка1
		|ИЗ
		|	Документ.Матрица КАК Матрица
		|ГДЕ
		|	Матрица.Контрагент = &Контрагент
		|	И Матрица.Дата <= &Дата1
		|	И Матрица.ДатаОкончания >= &Дата2
		|	И Матрица.Договор = &Договор
		|	И Матрица.Проведен
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		
		Запрос.УстановитьПараметр("Дата2",НачалоДня(ДокументОбъект.дата));
		Запрос.УстановитьПараметр("Дата1",КонецДня(ДокументОбъект.дата));
		Запрос.УстановитьПараметр("Контрагент",Контрагент);  
		Запрос.УстановитьПараметр("Договор",ДокументОбъект.Договор);
		РезультатЗапроса = Запрос.Выполнить(); 
		
		ИспользоватьНоменклатурнуюМатрицу = Истина; 
	КонецЕсли; 
	
	Для Каждого СтрокаТЧ Из ДокументОбъект.Товары Цикл  		
		
		Если ИспользоватьНоменклатурнуюМатрицу И НЕ РезультатЗапроса.Пустой() Тогда
			ЗаполнитьЦенуНоменклатурыТабЧастиПоМатрице_(СтрокаТЧ,ДокументОбъект);
		иначеЕсли ИспользоватьНоменклатурнуюМатрицу И РезультатЗапроса.Пустой() Тогда
			Сообщить("!!! Не найдена матрица по договору документа, цены заполнены без учета договора!");
			ЗаполнитьЦенуНоменклатурыТабЧастиПоМатрицеБезУчетаДоговора_(СтрокаТЧ,ДокументОбъект);
		Иначе //не меняем 
			ЗаполнитьЦенуНоменклатурыТабЧасти_(СтрокаТЧ,ДокументОбъект);  
		КонецЕсли;

		РассчитатьСуммуТабЧасти_(СтрокаТЧ,ДокументОбъект); 

	КонецЦикла;
	
КонецПроцедуры // ПересчетЦены()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ЗаполнитьЦенуНоменклатурыТабЧасти_(СтрокаТЧ,ДокументОбъект)
	Распродажа = ложь; 
	
	ТекТипЦен			= ДокументОбъект.ТипЦен;
	Если ЗначениеЗаполнено(ДокументОбъект.ТипЦенРаспродажа) Тогда
		
		Цена = ПолучитьЦенуНоменклатуры_(СтрокаТЧ,ДокументОбъект,ДокументОбъект.ТипЦенРаспродажа);			
		Если ЗначениеЗаполнено(Цена) Тогда
			ТекТипЦен							= ДокументОбъект.ТипЦенРаспродажа;				
			
			СтрокаТЧ.ЦенаБезСкидки	= Цена;				
			Распродажа							= Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Контрагент = ДокументОбъект.Контрагент;
	
	Если Распродажа Тогда
		СтрокаТЧ.Скидка			= -1;
	Иначе 
		
		Если  ЗначениеЗаполнено(Контрагент) И ПроверитьНаличиеСкидокУКонтрагента_(Контрагент) Тогда //Контрагент.Скидки.Количество()>0 Тогда
			СтрокаТЧ.Скидка = ПолучитьСкидкуНоменклатуры_(СтрокаТЧ.Номенклатура,Контрагент,ДокументОбъект.Дата,ТекТипЦен);	
		//Иначе
			
			Наценка = ПолучитьНаценкуНоменклатуры_(СтрокаТЧ.Номенклатура,Контрагент,ДокументОбъект.Дата,ТекТипЦен); // нечаева 29,05,15++
			Если Наценка <> Неопределено И Наценка <> 0 Тогда
				Скидка = СтрокаТЧ.Скидка;
				СтрокаТЧ.Скидка = Скидка -Наценка + Скидка*Наценка/100;
			КонецЕсли;
			Если НЕ ДокументОбъект.ТипСкидок.пустая() Тогда
				
				ДопСкидкаОпт = ПолучитьСкидкуНоменклатуры_(СтрокаТЧ.Номенклатура,ДокументОбъект.ТипСкидок,ДокументОбъект.Дата,); 
				Если ДопСкидкаОпт = Неопределено Тогда ДопСкидкаОпт = 0; КонецЕсли;
				
				СтрокаТЧ.Скидка = СтрокаТЧ.Скидка+ДопСкидкаОпт;
				
			КонецЕсли;
		Иначе 
			
			СтрокаТЧ.Скидка=ПолучитьСкидкуНоменклатуры_(СтрокаТЧ.Номенклатура,ДокументОбъект.ТипСкидок,ДокументОбъект.Дата);
			Если ЗначениеЗаполнено(ДокументОбъект.Договор) И ДокументОбъект.Договор.ДопСкидка<>0 Тогда
				СтрокаТЧ.Скидка = СтрокаТЧ.Скидка + ДокументОбъект.Договор.ДопСкидка;
				Если СтрокаТЧ.Скидка=-1 Тогда				
					СтрокаТЧ.Скидка=0;									
				КонецЕсли;	
			КонецЕсли;
		Конецесли; 
	КонецЕсли;
	
	СтрокаТЧ.ЦенаБезСкидки = ПолучитьЦенуНоменклатуры_(СтрокаТЧ,ДокументОбъект,ТекТипЦен); //ДокументОбъект.ТипЦен);
	СтрокаТЧ.ТипЦен = ТекТипЦен;
	

КонецПроцедуры // ЗаполнитьЦенуНоменклатурыТабЧасти_()

Функция ПроверитьНаличиеСкидокУКонтрагента_(Знач Контрагент)  экспорт
	
	//
	Ведущий = Контрагент.Ведущий; 
	если ЗначениеЗаполнено(Ведущий) тогда
		Контрагент=Ведущий;
	КонецЕсли;
	
	
	Запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ первые 1
	|	СкидкиКонтрагентов.Скидка КАК Скидка
	|ИЗ
	|	РегистрСведений.СкидкиКонтрагентов КАК СкидкиКонтрагентов
	|ГДЕ
	|	СкидкиКонтрагентов.Контрагент = &Контрагент";
	запрос.УстановитьПараметр("Контрагент",Контрагент);
	выборка=запрос.Выполнить().Выбрать();
	пока выборка.Следующий() цикл
		Возврат Истина
	КонецЦикла;
	возврат ложь;
КонецФункции

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьСкидкуНоменклатуры_(Номенклатура,ТипСкидок_Контрагент,ДатаРасчета = неопределено,ТипЦенСкидок = неопределено,ФиксироватьАкцию = Ложь)  Экспорт
	
	Если ТипЗнч(ТипСкидок_Контрагент)=Тип("СправочникСсылка.ТипыСкидок") Тогда		//по типу скидок
		Если ДатаРасчета=Неопределено Тогда
			
			ТекДатаРасчета = ТекущаяДата();		
			
		Иначе
			ТекДатаРасчета = ДатаРасчета;	
		КонецЕсли;
		
		
		
		
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ ПЕРВЫЕ 1		
		|	Скидка,
		|	ВЫБОР 
		|		КОГДА Номенклатура	=&Номенклатура0 ТОГДА 0
		|		КОГДА Номенклатура	=&Номенклатура1 ТОГДА 1
		|		КОГДА Номенклатура	=&Номенклатура2 ТОГДА 2
		|		КОГДА Номенклатура	=&Номенклатура3 ТОГДА 3
		|		КОГДА Номенклатура	=&Номенклатура3 ТОГДА 4
		
		|		КОГДА Номенклатура	=&Номенклатура5 ТОГДА 5
		
		
		|	ИНАЧЕ 100 
		|	КОНЕЦ КАК Уровень
		|ИЗ
		|РегистрСведений.СкидкиНоменклатуры.СрезПоследних(КонецПериода(&Дата2,День),
		|	(ТипСкидок = &ТипСкидок)
		|	И Номенклатура В (&СписокПозиций)
		|	И Документ.Проведен
		|	И КОНЕЦПЕРИОДА(Документ.Дата2,День) >= &Дата2 и документ.Дата < &Дата2		
		|	) КАК ЦеныНоменклатурыСрезПоследних		
		|УПОРЯДОЧИТЬ ПО Документ.Дата Убыв,Уровень";
		
		Запрос.УстановитьПараметр("Дата2",			ТекДатаРасчета);
		Запрос.УстановитьПараметр("ТипСкидок",		ТипСкидок_Контрагент);
		Запрос.УстановитьПараметр("ТипСкидок_Базовый",		ТипСкидок_Контрагент.Базовый);
		
		
		СписокПозиций=Новый Массив;
		
		Уровень=0;		
		ТекРодитель=Номенклатура;
		Пока Уровень<6 Цикл
			
			СписокПозиций.Добавить(ТекРодитель);		
			Запрос.УстановитьПараметр("Номенклатура"+Уровень,ТекРодитель);
			
			Уровень=Уровень+1;
			ТекРодитель=ТекРодитель.Родитель;	
		КонецЦикла;
		
		Запрос.УстановитьПараметр("СписокПозиций",	СписокПозиций);
		
		Результат=Запрос.Выполнить();
		
		Выборка=Результат.Выбрать();
		// нечаева 12,09,14
		Пока Выборка.Следующий() Цикл
			Если Выборка.Скидка=-1 Тогда 
				прервать;
			иначе
				Возврат  Выборка.Скидка;
			конецЕсли;
		КонецЦикла;
		// нечаева 12,09,14+++
		
		//считается базовы тип скидок
		// если он есть то основной не смотрим и не сравниваем
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ ПЕРВЫЕ 1		
		|	Скидка,
		|	ВЫБОР 
		|		КОГДА Номенклатура	=&Номенклатура0 ТОГДА 0
		|		КОГДА Номенклатура	=&Номенклатура1 ТОГДА 1
		|		КОГДА Номенклатура	=&Номенклатура2 ТОГДА 2
		|		КОГДА Номенклатура	=&Номенклатура3 ТОГДА 3
		|		КОГДА Номенклатура	=&Номенклатура3 ТОГДА 4
		// Кухарь А.Ю. 13.10.2022 начало
		//+1 уровень иерархии
		|		КОГДА Номенклатура	=&Номенклатура5 ТОГДА 5
		// Кухарь А.Ю. 13.10.2022 конец
		
		|	ИНАЧЕ 100 
		|	КОНЕЦ КАК Уровень
		|ИЗ
		|РегистрСведений.СкидкиНоменклатуры.СрезПоследних(КонецПериода(&Дата2,День),
		|	(ТипСкидок = &ТипСкидок_Базовый)
		//|	(ТипСкидок = &ТипСкидок ИЛИ ТипСкидок = &ТипСкидок_Базовый)
		|	И Номенклатура В (&СписокПозиций)
		|	И Документ.Проведен
		|	И КОНЕЦПЕРИОДА(Документ.Дата2,День) >= &Дата2 и документ.Дата < &Дата2		
		|	) КАК ЦеныНоменклатурыСрезПоследних		
		|УПОРЯДОЧИТЬ ПО Документ.Дата Убыв,Уровень";
		
		Запрос.УстановитьПараметр("Дата2",			ТекДатаРасчета);
		Запрос.УстановитьПараметр("ТипСкидок",		ТипСкидок_Контрагент);
		//крохин начало
		//добавил базовый тип скидок, аналогично типу цен
		Запрос.УстановитьПараметр("ТипСкидок_Базовый",		ТипСкидок_Контрагент.Базовый);
		//крохин конец
		
		СписокПозиций=Новый Массив;
		
		Уровень=0;		
		ТекРодитель=Номенклатура;
		// Кухарь А.Ю. 13.10.2022 начало
		//+1 уровень иерархии
		//Пока Уровень<5 Цикл
		Пока Уровень<6 Цикл
			// Кухарь А.Ю. 13.10.2022 конец
			СписокПозиций.Добавить(ТекРодитель);		
			Запрос.УстановитьПараметр("Номенклатура"+Уровень,ТекРодитель);
			
			Уровень=Уровень+1;
			ТекРодитель=ТекРодитель.Родитель;	
		КонецЦикла;
		
		Запрос.УстановитьПараметр("СписокПозиций",	СписокПозиций);
		
		Результат=Запрос.Выполнить();
		
		Выборка=Результат.Выбрать();
		Пока Выборка.Следующий() Цикл			
			Возврат  Выборка.Скидка;
		КонецЦикла; 
		
		
		
		
	Иначе 	
		Если ДатаРасчета=Неопределено Тогда
			ТекДатаРасчета=ТекущаяДата();			
		Иначе
			ТекДатаРасчета=ДатаРасчета;	
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	СкидкиНоменклатурыКонтрагентов.ТипЦен КАК ТипЦен,
		|	СкидкиНоменклатурыКонтрагентов.Номенклатура КАК Номенклатура,
		|	СкидкиНоменклатурыКонтрагентов.Документ КАК Документ,
		|	СкидкиНоменклатурыКонтрагентов.Скидка КАК Скидка,
		|	СкидкиНоменклатурыКонтрагентов.Контрагент КАК Контрагент
		|ИЗ
		|	РегистрСведений.СкидкиНоменклатурыКонтрагентов КАК СкидкиНоменклатурыКонтрагентов
		|ГДЕ
		|	СкидкиНоменклатурыКонтрагентов.Документ.Дата <= &Дата
		|	И СкидкиНоменклатурыКонтрагентов.Документ.Дата2 >= &Дата2
		|	И СкидкиНоменклатурыКонтрагентов.Номенклатура = &Номенклатура
		|	И СкидкиНоменклатурыКонтрагентов.Контрагент = &Контрагент
		|
		|УПОРЯДОЧИТЬ ПО
		|	СкидкиНоменклатурыКонтрагентов.Документ.Дата УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("Дата",ДатаРасчета);
		Запрос.УстановитьПараметр("Дата2",ДатаРасчета);
		запрос.УстановитьПараметр("Номенклатура",?(Номенклатура.Этогруппа,Номенклатура,Номенклатура.Родитель));
		запрос.УстановитьПараметр("Контрагент",ТипСкидок_Контрагент);
		Выборка = запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ТипЦенСкидок=Выборка.ТипЦен;
			//крохин начало 12.01.2021
			//для РНК нужен флаг "акция"
			
			
			//нечаева 13,07,22  - заготовка
			// проверим, что акция действительна для контрагента.
			//ДействуетАк = АкцияДействуетДляКонтрагента(Выборка.Документ,ТипСкидок_Контрагент); 
			//Если  ДействуетАк  тогда ,,,, выполняем
			
			
			
			Если ФиксироватьАкцию Тогда
				СтруктураСкидки = Новый Структура;
				СтруктураСкидки.Вставить("Скидка",Выборка.Скидка);
				СтруктураСкидки.Вставить("Акция",Истина);
				Возврат СтруктураСкидки;
			Иначе
				Возврат  Выборка.Скидка;
			КонецЕсли;
			//крохин конец 12.01.2021
		КонецЕсли;
		//крохин конец 05.02.2020
		// Шворобей ВЮ 05.03.2024 ++
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СкидкиКонтрагентов.Скидка КАК Скидка,
		|	СкидкиКонтрагентов.ТипЦен КАК ТипЦен,
		|	ВЫБОР
		|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура0
		|			ТОГДА 0
		|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура1
		|			ТОГДА 1
		|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура2
		|			ТОГДА 2
		|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура3
		|			ТОГДА 3
		|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура4
		|			ТОГДА 4
		|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура5
		|			ТОГДА 5
		|		ИНАЧЕ 100
		|	КОНЕЦ КАК Уровень
		|ИЗ
		|	РегистрСведений.СкидкиКонтрагентов КАК СкидкиКонтрагентов
		|ГДЕ
		|	СкидкиКонтрагентов.Номенклатура В(&СписокПозиций)
		|	И СкидкиКонтрагентов.Контрагент = &Контрагент
		|
		|УПОРЯДОЧИТЬ ПО
		|	Уровень";
		// Шворобей ВЮ 05.03.2024 ++
		
		Запрос.УстановитьПараметр("Контрагент", ?(ЗначениеЗаполнено(ТипСкидок_Контрагент.Ведущий), ТипСкидок_Контрагент.Ведущий, ТипСкидок_Контрагент));		
		
		СписокПозиций=Новый Массив;
		
		Уровень=0;		
		ТекРодитель=Номенклатура;
		// Кухарь А.Ю. 13.10.2022 начало
		//+1 уровень иерархии
		//Пока Уровень<5 Цикл
		Пока Уровень<6 Цикл
			// Кухарь А.Ю. 13.10.2022 конец
			СписокПозиций.Добавить(ТекРодитель);		
			Запрос.УстановитьПараметр("Номенклатура"+Уровень,ТекРодитель);
			
			Уровень=Уровень+1;
			ТекРодитель=ТекРодитель.Родитель;			
		КонецЦикла;
		
		Запрос.УстановитьПараметр("СписокПозиций",	СписокПозиций);
		
		Результат=Запрос.Выполнить();
		
		Выборка=Результат.Выбрать();
		Пока Выборка.Следующий() Цикл			
			ТипЦенСкидок=Выборка.ТипЦен;
			Возврат  Выборка.Скидка;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Неопределено;
	
	
	
КонецФункции // ПолучитьСкидкуНоменклатуры_()

Функция ПолучитьНаценкуНоменклатуры_(Номенклатура,ТипСкидок_Контрагент,ДатаРасчета = Неопределено,ТипЦенСкидок = Неопределено)

	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1		
	|	Наценка,ТипЦен,
	|	ВЫБОР 
	|		КОГДА Номенклатура	=&Номенклатура0 ТОГДА 0
	|		КОГДА Номенклатура	=&Номенклатура1 ТОГДА 1
	|		КОГДА Номенклатура	=&Номенклатура2 ТОГДА 2
	|		КОГДА Номенклатура	=&Номенклатура3 ТОГДА 3
	|		КОГДА Номенклатура	=&Номенклатура4 ТОГДА 4
	// Кухарь А.Ю. 13.10.2022 начало
	//+1 уровень иерархии
	|		КОГДА Номенклатура	=&Номенклатура5 ТОГДА 5 
	// Кухарь А.Ю. 13.10.2022 конец
	
	|	ИНАЧЕ 100 
	|	КОНЕЦ КАК Уровень
	|ИЗ
	|	Справочник.Контрагенты.Скидки
	|ГДЕ
	|	Ссылка = &Контрагент		
	|	И Номенклатура В (&СписокПозиций)
	|УПОРЯДОЧИТЬ ПО Уровень";
	
	Запрос.УстановитьПараметр("Контрагент",		ТипСкидок_Контрагент);		
	
	СписокПозиций=Новый Массив;
	
	Уровень=0;		
	ТекРодитель=Номенклатура;
	// Кухарь А.Ю. 13.10.2022 начало
	//+1 уровень иерархии
	//Пока Уровень<5 Цикл
	Пока Уровень<6 Цикл
		// Кухарь А.Ю. 13.10.2022 конец
		СписокПозиций.Добавить(ТекРодитель);		
		Запрос.УстановитьПараметр("Номенклатура"+Уровень,ТекРодитель);
		
		Уровень=Уровень+1;
		ТекРодитель=ТекРодитель.Родитель;			
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СписокПозиций",	СписокПозиций);
	
	Результат=Запрос.Выполнить();
	
	Выборка=Результат.Выбрать();
	Пока Выборка.Следующий() Цикл			
		//		ТипЦенСкидок=Выборка.ТипЦен;
		Возврат  Выборка.Наценка;
	КонецЦикла;
	
	Возврат Неопределено;


КонецФункции //
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьЦенуНоменклатуры_(СтрокаТЧ,Знач ДокументОбъект, ТипЦен)
	//ТипЦен = ДокументОбъект.ТипЦен;
	ДатаРасчета = ДокументОбъект.Дата; 
	Номенклатура = СтрокаТЧ.Номенклатура;
	//Коэффициент = 
	Если ТипЦен<>Неопределено И НЕ ТипЦен.Пустая() Тогда		
		Запрос = Новый Запрос;
		
		Если ДатаРасчета=Неопределено Тогда
			
			ТекДатаРасчета = КонецДня(ТекущаяДата());		
			
		Иначе
			
			ТекДатаРасчета = ДатаРасчета;
		КонецЕсли;
		
		Запрос.Текст="
		|ВЫБРАТЬ ПЕРВЫЕ 1	
		|	Цена,
		|	ВЫБОР 
		|		КОГДА ТипЦен = &ТипЦен ТОГДА 0		
		|	ИНАЧЕ 100 КОНЕЦ КАК Уровень
		|ИЗ
		|РегистрСведений.ЦеныНоменклатуры.СрезПоследних(КонецПериода(&Дата2,День),
		|	(ТипЦен = &ТипЦен)
		|	И Номенклатура = &Номенклатура0
		|	И Прайс.Проведен
		|	И КОНЕЦПЕРИОДА(Прайс.Дата2,День) >= &Дата2 И Прайс.Дата < &Дата2
		|	) КАК ЦеныНоменклатурыСрезПоследних
		|ГДЕ Номенклатура.ЭтоГруппа
		|УПОРЯДОЧИТЬ ПО Уровень,Прайс.Дата Убыв"; 
		
		
		Запрос.УстановитьПараметр("Дата2",				ТекДатаРасчета);
		Запрос.УстановитьПараметр("ТипЦен",				ТипЦен);	
		Запрос.УстановитьПараметр("ТипЦен_Базовый",		ТипЦен.Базовый);		
		
		Запрос.УстановитьПараметр("Номенклатура0",	?(Номенклатура.ЭтоГруппа,Номенклатура,Номенклатура.Родитель));
		
		Результат=Запрос.Выполнить();
		//крохин начало 22.09.2011
		//единицу не используем больше
		//Коэффициент=?(Единица=Неопределено,1,Единица.Коэффициент);
		Коэффициент = 1;
		//крохин конец 22.09.2011;
		Выборка=Результат.Выбрать();
		
		
		
		Пока Выборка.Следующий() Цикл			
			//нечаева 08,09,2014 +++
			Если Выборка.цена <> -1 Тогда
				Возврат  Выборка.цена*Коэффициент; 
			иначе 
				// тогда берем цену по базовому прайс-листу. сделано для франчей - сброс цен
				прервать;
			КонецЕсли;
			//нечаева 08,09,2014 ----
		КонецЦикла;	
		
		
		// смотрим базовый тип цен
		Запрос.Текст="
		|ВЫБРАТЬ ПЕРВЫЕ 1	
		|	Цена,
		|	ВЫБОР 
		|		КОГДА ТипЦен = &ТипЦен ТОГДА 0		
		|	ИНАЧЕ 100 КОНЕЦ КАК Уровень
		|ИЗ
		|РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата2,
		|	(ТипЦен=&ТипЦен_Базовый)
		|	И Номенклатура = &Номенклатура0
		|	И Прайс.Проведен
		|	И КОНЕЦПЕРИОДА(Прайс.Дата2,День) >= &Дата2	И Прайс.Дата < &Дата2
		|	) КАК ЦеныНоменклатурыСрезПоследних
		|ГДЕ Номенклатура.ЭтоГруппа
		|УПОРЯДОЧИТЬ ПО Уровень,Прайс.Дата Убыв";
		
		Запрос.УстановитьПараметр("Дата2",				ТекДатаРасчета);
		Запрос.УстановитьПараметр("ТипЦен",				ТипЦен);	
		Запрос.УстановитьПараметр("ТипЦен_Базовый",		ТипЦен.Базовый);		
		
		Запрос.УстановитьПараметр("Номенклатура0",	?(Номенклатура.ЭтоГруппа,Номенклатура,Номенклатура.Родитель));
		
		Результат=Запрос.Выполнить();
		//крохин начало 22.09.2011
		//единицу не используем больше
		//Коэффициент=?(Единица=Неопределено,1,Единица.Коэффициент);
		Коэффициент = 1;
		//крохин конец 22.09.2011;
		Выборка=Результат.Выбрать();
		Пока Выборка.Следующий() Цикл			
			Возврат  Выборка.Цена*Коэффициент;
		КонецЦикла;        
	
	
	//////////////////////////////////////////////////////////////////////////////////////////	
	Возврат 0;
Иначе
	Возврат 0; 
КонецЕсли;

КонецФункции // ПолучитьЦенуНоменклатуры()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ПересчетПоВалюте_()

	

КонецПроцедуры // ПересчетПоВалюте()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ЗаполнитьЦенуНоменклатурыТабЧастиПоМатрице_(СтрокаТЧ,ДокументОбъект)
	
	НуженРасчетАкции = Ложь;	
	ЭтоАкция = Ложь;
	
	ТекТипЦен			= справочники.ТипыЦен.ПустаяСсылка();
	Цена				= 0;
	Распродажа			= Ложь;
	
	ДатаРасчетаЦены= ДокументОбъект.Дата;
	
	Контрагент = ДокументОбъект.Контрагент;
	Договор = ДокументОбъект.договор;
	ТекТовар = СтрокаТЧ.номенклатура;
	
	ТЗМартицПоФА=новый ТаблицаЗначений;
	//------------------------------------------
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Ссылка
	|ИЗ
	|	(ВЫБРАТЬ
	|		МатрицаПунктыДоставки.ПунктДоставки КАК ПунктДоставки,
	|		СУММА(1) КАК кол,
	|		Матрица.Ссылка КАК Ссылка
	|	ИЗ
	|		Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Матрица КАК Матрица
	|			ПО МатрицаПунктыДоставки.Ссылка = Матрица.Ссылка
	|	ГДЕ
	|		Матрица.Контрагент = &Контрагент
	|		И Матрица.Дата <= &Дата1
	|		И Матрица.ДатаОкончания >= &Дата2
	|		И МатрицаПунктыДоставки.ПунктДоставки <> &пустая
	|		И Матрица.Договор = &Договор
	|       И НЕ Матрица.ПостояннаяАкция 
	|	СГРУППИРОВАТЬ ПО
	|		МатрицаПунктыДоставки.ПунктДоставки,
	|		Матрица.Ссылка) КАК ВложенныйЗапрос
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
	Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("Договор",Договор);
	
	Запрос.УстановитьПараметр("пустая",справочники.ПунктыДоставки.ПустаяСсылка());
	// цена по акции
	ТЗМартицПоФА = Запрос.Выполнить().Выгрузить();
	
	
	//---------------------------------------------
	ЕстьМартицаПоФактАдресу=ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МатрицаПунктыДоставки.Ссылка
	|ИЗ
	|	Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	|ГДЕ
	|	МатрицаПунктыДоставки.Ссылка.Дата <= &Дата1
	|	И МатрицаПунктыДоставки.Ссылка.Проведен
	|	И МатрицаПунктыДоставки.Ссылка.Договор = &Договор
	|	И МатрицаПунктыДоставки.Ссылка.Контрагент = &Контрагент
	|	И МатрицаПунктыДоставки.Ссылка.ДатаОкончания >= &Дата2
	|	И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункДоставки
	//крохин начало 28.07.2017
	|	И НЕ МатрицаПунктыДоставки.Ссылка.ПостояннаяАкция
	//крохин конец 28.07.2017
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
	Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("Договор",Договор);
	Запрос.УстановитьПараметр("ТекПункДоставки",ДокументОбъект.пунктДоставки.ссылка);
	// цена по акции
	ТЗМК = Запрос.Выполнить().Выгрузить();
	
	Если ТЗМК.Количество()>0 Тогда
		ЕстьМартицаПоФактАдресу=истина;
	конецЕсли;
	// список значений матриц с пустыми значениями.
	
	
	
	
	ТекЦена=0;
	
	Если ЕстьМартицаПоФактАдресу Тогда
		
		//считаем по матрице. для конкретного факт. адреса
		//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	МатрицаТовары.Номенклатура,
		|	МатрицаТовары.Цена,
		|	МатрицаПунктыДоставки.Ссылка
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
		|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
		|ГДЕ
		|	МатрицаТовары.Ссылка.Дата <= &Дата1
		|	И МатрицаТовары.Ссылка.Проведен
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.Договор = &Договор
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
		|	И МатрицаТовары.Ссылка.Акция = ИСТИНА
		|	И МатрицаТовары.Номенклатура = &ТекНом
		|	И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункДоставки
		|   И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция
		|	УПОРЯДОЧИТЬ ПО
		|	МатрицаТовары.Ссылка.Дата УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ТекНом",ТекТовар);			   
		Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("Договор",Договор);
		
		Запрос.УстановитьПараметр("ТекПункДоставки",ДокументОбъект.пунктДоставки);
		// цена по акции
		ТЗ1 = Запрос.Выполнить().Выгрузить();
		
		//цена по основному способу расчета, без учета акции		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	МатрицаТовары.Номенклатура,
		|	МатрицаТовары.Цена,
		|	МатрицаПунктыДоставки.Ссылка
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
		|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
		|ГДЕ
		|	МатрицаТовары.Ссылка.Дата <= &Дата1
		|	И МатрицаТовары.Ссылка.Проведен
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.Договор = &Договор
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
		|	И МатрицаТовары.Номенклатура = &ТекНом
		|	И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункт
		|   И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция				
		|	УПОРЯДОЧИТЬ ПО
		|	МатрицаТовары.Ссылка.Дата УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		
		Запрос.УстановитьПараметр("ТекНом",ТекТовар);
		Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("Договор",Договор);
		
		Запрос.УстановитьПараметр("ТекПункт",ДокументОбъект.пунктДоставки);
		ТЗ2 = Запрос.Выполнить().Выгрузить();
		
		Отбор = новый Структура;
		Отбор.Вставить("Номенклатура",ТекТовар);
		СтрокиМатриц = ТЗ1.НайтиСтроки(Отбор); 
		СтрокиМатриц2 = ТЗ2.НайтиСтроки(Отбор); 
		ТекЦена=0;
		Если СтрокиМатриц.Количество() = 0 Тогда
			// смотрим по основной базе
			Если СтрокиМатриц2.Количество() = 0 Тогда
				ТекЦена=0;
			Иначе
				Для Каждого СтрокаМатриц Из СтрокиМатриц2 Цикл
					ТекЦена=СтрокаМатриц.Цена;
					
				КонецЦикла;
			КонецЕсли;
			
		Иначе
			
			Для Каждого СтрокаМатриц Из СтрокиМатриц Цикл
				ТекЦена=СтрокаМатриц.Цена;					
			КонецЦикла;
			
		КонецЕсли;
		
		
	иначе 
		// берем по матрицам без заполненных факт адресов.
		
		Контрагент=ДокументОбъект.Контрагент;
		ТекТовар = СтрокаТЧ.номенклатура;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура,
		|	МатрицаТовары.Цена,
		|	МатрицаТовары.Ссылка
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	МатрицаТовары.Ссылка.Дата <= &Дата1
		|	И МатрицаТовары.Ссылка.Проведен
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.Договор = &Договор
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
		|	И МатрицаТовары.Ссылка.Акция = ИСТИНА
		|	И МатрицаТовары.Номенклатура = &ТекНом
		|	И НЕ МатрицаТовары.Ссылка В(&ТЗМартицПоФА)
		|   И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция 
		|	УПОРЯДОЧИТЬ ПО
		|	МатрицаТовары.Ссылка.Дата УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
				
		Запрос.УстановитьПараметр("ТекНом",ТекТовар);			   
		Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("Договор",Договор);
		
		Запрос.УстановитьПараметр("ТЗМартицПоФА",ТЗМартицПоФА);
		
		// цена по акции
		ТЗ1 = Запрос.Выполнить().Выгрузить();
		
		//цена по основному способу расчета, без учета матрицы.		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура,
		|	МатрицаТовары.Цена,
		|	МатрицаТовары.Ссылка
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	МатрицаТовары.Ссылка.Дата <= &Дата1
		|	И МатрицаТовары.Ссылка.Проведен
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.Договор = &Договор
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
		|	И МатрицаТовары.Номенклатура = &ТекНом
		|	И (НЕ МатрицаТовары.Ссылка В (&ТЗМартицПоФА))
		|   И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция
		
		|	УПОРЯДОЧИТЬ ПО
		|	МатрицаТовары.Ссылка.Дата УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ТекНом",ТекТовар);
		Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("Договор",Договор);
		
		Запрос.УстановитьПараметр("ТЗМартицПоФА",ТЗМартицПоФА);
		
		ТЗ2 = Запрос.Выполнить().Выгрузить();
		
		
		Отбор = новый Структура;
		Отбор.Вставить("Номенклатура",ТекТовар);
		СтрокиМатриц = ТЗ1.НайтиСтроки(Отбор); 
		СтрокиМатриц2 = ТЗ2.НайтиСтроки(Отбор); 
		ТекЦена=0;
		Если СтрокиМатриц.Количество() = 0 Тогда
			// смотрим по основной базе
			Если СтрокиМатриц2.Количество() = 0 Тогда
				ТекЦена=0;
			Иначе
				Для Каждого СтрокаМатриц Из СтрокиМатриц2 Цикл
					Если СтрокаМатриц.ссылка.ПунктыДоставки.Количество()=0 Тогда
						ТекЦена=СтрокаМатриц.Цена;
						
						прервать;
					конецЕсли;	
				КонецЦикла;
			КонецЕсли;
			
		Иначе
			
			Для Каждого СтрокаМатриц Из СтрокиМатриц Цикл
				//ТекЦена=СтрокаМатриц.Цена;
				Если СтрокаМатриц.ссылка.ПунктыДоставки.Количество()=0 Тогда
					ТекЦена=СтрокаМатриц.Цена;
					
					
					прервать;
				конецЕсли;	
				
			КонецЦикла;
			
		КонецЕсли;
	конецЕсли;
	
	СтрокаТЧ.ЦенаБезСкидки = ТекЦена;
	
	
	СтрокаТЧ.ТипЦен = ТекТипЦен; 	
	
КонецПроцедуры // ЗаполнитьЦенуНоменклатурыТабЧастиПоМатрице()

Процедура ЗаполнитьЦенуНоменклатурыТабЧастиПоМатрицеБезУчетаДоговора_(СтрокаТЧ,ДокументОбъект)
	
	ТекТипЦен			= справочники.ТипыЦен.ПустаяСсылка();
	Цена				= 0;
	Распродажа			= Ложь;
	
	ДатаРасчетаЦены = ДокументОбъект.Дата;
	Контрагент = ДокументОбъект.Контрагент;
	
	ТекТовар = СтрокаТЧ.номенклатура;
	ТЗМартицПоФА = новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Ссылка
	|ИЗ
	|	(ВЫБРАТЬ
	|		МатрицаПунктыДоставки.ПунктДоставки КАК ПунктДоставки,
	|		СУММА(1) КАК кол,
	|		Матрица.Ссылка КАК Ссылка
	|	ИЗ
	|		Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Матрица КАК Матрица
	|			ПО МатрицаПунктыДоставки.Ссылка = Матрица.Ссылка
	|	ГДЕ
	|		Матрица.Контрагент = &Контрагент
	|		И Матрица.Дата <= &Дата1
	|		И Матрица.ДатаОкончания >= &Дата2
	|		И МатрицаПунктыДоставки.ПунктДоставки <> &пустая
	|        И НЕ Матрица.ПостояннаяАкция	
	|	СГРУППИРОВАТЬ ПО
	|		МатрицаПунктыДоставки.ПунктДоставки,
	|		Матрица.Ссылка) КАК ВложенныйЗапрос
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
	Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("пустая",справочники.ПунктДоставкиКонтрагента.ПустаяСсылка());
	// цена по акции
	ТЗМартицПоФА = Запрос.Выполнить().Выгрузить();
	
	ЕстьМартицаПоФактАдресу = ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МатрицаПунктыДоставки.Ссылка
	|ИЗ
	|	Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	|ГДЕ
	|	МатрицаПунктыДоставки.Ссылка.Дата <= &Дата1
	|	И МатрицаПунктыДоставки.Ссылка.Проведен
	|	И МатрицаПунктыДоставки.Ссылка.Контрагент = &Контрагент
	|	И МатрицаПунктыДоставки.Ссылка.ДатаОкончания >= &Дата2
	|		И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункДоставки
	|	И НЕ МатрицаПунктыДоставки.Ссылка.ПостояннаяАкция 
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
	Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("ТекПункДоставки",ДокументОбъект.пунктДоставки.ссылка);
	
	ТЗМК = Запрос.Выполнить().Выгрузить();
	
	Если ТЗМК.Количество()>0 Тогда
		ЕстьМартицаПоФактАдресу = истина;
	конецЕсли;
	
	Если ЕстьМартицаПоФактАдресу Тогда
		
		//считаем по матрице. для конкретного факт. адреса
		//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	МатрицаТовары.Номенклатура,
		|	МатрицаТовары.Цена,
		|	МатрицаПунктыДоставки.Ссылка
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
		|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
		|ГДЕ
		|	МатрицаТовары.Ссылка.Дата <= &Дата1
		|	И МатрицаТовары.Ссылка.Проведен
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
		|	И МатрицаТовары.Ссылка.Акция = ИСТИНА
		|	И МатрицаТовары.Номенклатура = &ТекНом
		|	И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункДоставки
		|	УПОРЯДОЧИТЬ ПО
		|	МатрицаТовары.Ссылка.Дата УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
		//нечаева 18,07,17---
		
		Запрос.УстановитьПараметр("ТекНом",ТекТовар);			   
		Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТекПункДоставки",ДокументОбъект.пунктДоставки);
		// цена по акции
		ТЗ1 = Запрос.Выполнить().Выгрузить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	МатрицаТовары.Номенклатура КАК Номенклатура,
		|	МатрицаТовары.Цена КАК Цена,
		|	МатрицаПунктыДоставки.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
		|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
		|ГДЕ
		|	МатрицаТовары.Ссылка.Дата <= &Дата1
		|	И МатрицаТовары.Ссылка.Проведен
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
		|	И МатрицаТовары.Номенклатура = &ТекНом
		|	И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункт
		|	И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция
		|
		|УПОРЯДОЧИТЬ ПО
		|	МатрицаТовары.Ссылка.Дата УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ТекНом",ТекТовар);
		Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТекПункт",ДокументОбъект.пунктДоставки);
		ТЗ2 = Запрос.Выполнить().Выгрузить();
		
		Отбор = новый Структура;
		Отбор.Вставить("Номенклатура",ТекТовар);
		СтрокиМатриц = ТЗ1.НайтиСтроки(Отбор); 
		СтрокиМатриц2 = ТЗ2.НайтиСтроки(Отбор); 
		ТекЦена=0;
		Если СтрокиМатриц.Количество() = 0 Тогда
			// смотрим по основной базе
			Если СтрокиМатриц2.Количество() = 0 Тогда
				ТекЦена=0;
			Иначе
				Для Каждого СтрокаМатриц Из СтрокиМатриц2 Цикл
					ТекЦена=СтрокаМатриц.Цена;
				КонецЦикла;
			КонецЕсли;
			
		Иначе
			
			Для Каждого СтрокаМатриц Из СтрокиМатриц Цикл
				ТекЦена=СтрокаМатриц.Цена;
			КонецЦикла;
			
		КонецЕсли;
		
	иначе 
		// берем по матрицам без заполненных факт адресов.
		
		Контрагент = ДокументОбъект.Контрагент;
		ТекТовар = СтрокаТЧ.номенклатура;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура,
		|	МатрицаТовары.Цена,
		|	МатрицаТовары.Ссылка
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	МатрицаТовары.Ссылка.Дата <= &Дата1
		|	И МатрицаТовары.Ссылка.Проведен
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
		|	И МатрицаТовары.Ссылка.Акция = ИСТИНА
		|	И МатрицаТовары.Номенклатура = &ТекНом
		|	И НЕ МатрицаТовары.Ссылка В(&ТЗМартицПоФА)
		|   И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция
		|	УПОРЯДОЧИТЬ ПО
		|	МатрицаТовары.Ссылка.Дата УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ТекНом",ТекТовар);			   
		Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТЗМартицПоФА",ТЗМартицПоФА);
		
		// цена по акции
		ТЗ1 = Запрос.Выполнить().Выгрузить();
		
		//цена по основному способу расчета, без учета матрицы.		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура,
		|	МатрицаТовары.Цена,
		|	МатрицаТовары.Ссылка
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	МатрицаТовары.Ссылка.Дата <= &Дата1
		|	И МатрицаТовары.Ссылка.Проведен
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
		|	И МатрицаТовары.Номенклатура = &ТекНом
		|	И НЕ МатрицаТовары.Ссылка В(&ТЗМартицПоФА) 
		|   И МатрицаТовары.Ссылка.ПостояннаяАкция = истина
		|	УПОРЯДОЧИТЬ ПО
		|	МатрицаТовары.Ссылка.Дата УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
		//нечаева 18,07,17---
		
		Запрос.УстановитьПараметр("ТекНом",ТекТовар);
		Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТЗМартицПоФА",ТЗМартицПоФА);
		
		ТЗ2 = Запрос.Выполнить().Выгрузить();
		Отбор = новый Структура;
		Отбор.Вставить("Номенклатура",ТекТовар);
		СтрокиМатриц = ТЗ1.НайтиСтроки(Отбор); 
		СтрокиМатриц2 = ТЗ2.НайтиСтроки(Отбор); 
		ТекЦена=0;
		Если СтрокиМатриц.Количество() = 0 Тогда
			// смотрим по основной базе
			Если СтрокиМатриц2.Количество() = 0 Тогда
				ТекЦена=0;
			Иначе
				Для Каждого СтрокаМатриц Из СтрокиМатриц2 Цикл
					Если СтрокаМатриц.ссылка.ПунктыДоставки.Количество()=0 Тогда
						ТекЦена=СтрокаМатриц.Цена;
						прервать;
					конецЕсли;	
				КонецЦикла;
			КонецЕсли;
			
		Иначе
			
			Для Каждого СтрокаМатриц Из СтрокиМатриц Цикл
				//ТекЦена=СтрокаМатриц.Цена;
				Если СтрокаМатриц.ссылка.ПунктыДоставки.Количество()=0 Тогда
					ТекЦена=СтрокаМатриц.Цена;
					прервать;
				конецЕсли;	
				
			КонецЦикла;
			
		КонецЕсли;
	конецЕсли;
	
	СтрокаТЧ.ЦенаБезСкидки = ТекЦена;
	
	СтрокаТЧ.ТипЦен = ТекТипЦен;
	
КонецПроцедуры //

Процедура РассчитатьСуммуТабЧасти_(СтрокаТЧ,ДокументОбъект)  Экспорт

	Скидка = ДокументОбъект.Скидка; 
	
	СкидкаТЧ = СтрокаТЧ.Скидка;
	Если СкидкаТЧ = 0 Тогда
		Скидка = ДокументОбъект.Скидка;
	Иначе
		Если СкидкаТЧ > 0 Тогда				
			Скидка = СкидкаТЧ;
			Если ДокументОбъект.ДопСкидкаНаНакладную Тогда
				Скидка = Скидка + ДокументОбъект.Скидка;
			КонецЕсли; 
		Иначе
			//крохин начало 23.04.2012
			//для Беларуси, скидки могут быть отрицательными
			//	Скидка=0;
			Если СкидкаТЧ = -1 Тогда
				Скидка = 0;
			Иначе
				Скидка = СкидкаТЧ;
				Если ДокументОбъект.ДопСкидкаНаНакладную Тогда
					Скидка = Скидка + ДокументОбъект.Скидка;
				КонецЕсли;
			КонецЕсли;
			//крохин конец 23.04.2012
		КонецЕсли;
	КонецЕсли;

	СтрокаТЧ.ВсегоБезСкидки	= СтрокаТЧ.ЦенаБезСкидки*СтрокаТЧ.Количество;
	
	СтрокаТЧ.Цена	= СтрокаТЧ.ЦенаБезСкидки*(1-Скидка/100); //округление под разрядность реквизита "Цена" документа
	Цена			= СтрокаТЧ.Цена;
		
	СтрокаТЧ.Сумма 		= Цена * СтрокаТЧ.Количество;
	
	
	СтавкаНДС=ПроцентНДСпоСтавке(СтрокаТЧ.СтавкаНДС);
	
	
	НДС_Сверху = ДокументОбъект.Контрагент.НДС_Сверху;
	
	контрагентТ = ДокументОбъект.контрагент;
	
	Если НДС_Сверху Тогда
		
		
		ВсегоДоИзменения  =  СтрокаТЧ.ЦенаИсх * СтрокаТЧ.Количество;
		СуммаДоИзменения  =  Окр(ВсегоДоИзменения/(1+СтавкаНДС),2);
		НДСДоИзменения    =  ВсегоДоИзменения - СуммаДоИзменения;
		
		
		ЦенаПослеИзменения = СтрокаТЧ.ЦенаФакт;
		ЦенаПослеИзменения = Окр(ЦенаПослеИзменения/(1+СтавкаНДС),4);
		СуммаПослеИзменения= Окр(ЦенаПослеИзменения * СтрокаТЧ.Количество,4);
		НДСПослеИзменения	= Окр(СуммаПослеИзменения*СтавкаНДС,4);
		ВсегоПослеИзменения	= Окр(СуммаПослеИзменения + НДСПослеИзменения,4);
		
		СтрокаТЧ.Сумма	= СуммаДоИзменения - СуммаПослеИзменения;
		СтрокаТЧ.НДС	= НДСДоИзменения - НДСПослеИзменения;
		СтрокаТЧ.Всего	= ВсегоДоИзменения - ВсегоПослеИзменения;
		СтрокаТЧ.ВсегоБезСкидки	= 100*СтрокаТЧ.Всего/(1 - Скидка);//СтрокаТЧ.ВсегоБезСкидки*(1-Скидка/100);
		Если Скидка=0 тогда
			СтрокаТЧ.ВсегоБезСкидки	= СтрокаТЧ.Всего;
		Конецесли;	
			
		
	Иначе
		
		Цена = Окр(Цена/(1+СтавкаНДС),2);
		СтрокаТЧ.Сумма	= Цена * СтрокаТЧ.Количество;
		СтрокаТЧ.НДС	= СтрокаТЧ.Сумма*СтавкаНДС;
		СтрокаТЧ.Всего	= СтрокаТЧ.Сумма + СтрокаТЧ.НДС;
		ЦенаБезСкидки = Окр(СтрокаТЧ.ЦенаБезСкидки/(1+СтавкаНДС),2);
		СтрокаТЧ.ВсегоБезСкидки	= ЦенаБезСкидки*СтрокаТЧ.Количество*(1+СтавкаНДС);
		
	КонецЕсли;  	



КонецПроцедуры

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ДоступностьРедактированияЗаказа(Знач заказ)  Экспорт
	
	ТолькоПросмотр = Ложь; 
	
	МассивСостояний = Новый массив; 
	МассивСостояний.Добавить(Перечисления.СостоянияСогласования.Выполнен);
	МассивСостояний.Добавить(Перечисления.СостоянияСогласования.Согласован);
	МассивСостояний.Добавить(Перечисления.СостоянияСогласования.НаСогласованииКонтрагент);
	МассивСостояний.Добавить(Перечисления.СостоянияСогласования.ОтмененКонтрагент);
	//1. 
	Если  МассивСостояний.Найти(Заказ.СостояниеСогласования) <>неопределено Тогда
		
		ТолькоПросмотр = Истина; 
		
	КонецЕсли;
	
	МассивСостояний = Новый массив; 
	МассивСостояний.Добавить(Перечисления.СостоянияЗаказаКонтрагента.Выполнен);
	//МассивСостояний.Добавить(Перечисления.СостоянияЗаказаКонтрагента.ПодтвержденныйЗаказ);
	МассивСостояний.Добавить(Перечисления.СостоянияЗаказаКонтрагента.Отменен);
	МассивСостояний.Добавить(Перечисления.СостоянияЗаказаКонтрагента.ВыполненЧастично);

	
	Если  МассивСостояний.Найти(Заказ.СостояниеНакладной) <>неопределено Тогда
		
		ТолькоПросмотр = Истина; 
		
	КонецЕсли;
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	b2b_СоответствиеРНКЗаказы.РНК КАК РНК
	//	|ИЗ
	//	|	РегистрСведений.b2b_СоответствиеРНКЗаказы КАК b2b_СоответствиеРНКЗаказы
	//	|ГДЕ
	//	|	b2b_СоответствиеРНКЗаказы.Заказ = &Заказ";
	//
	//Запрос.УстановитьПараметр("Заказ", Заказ);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Если НЕ РезультатЗапроса.Пустой() Тогда
	//
	//	ТолькоПросмотр = Истина; 	
	//
	//КонецЕсли;
	
	Возврат ТолькоПросмотр; 
	
КонецФункции // ДоступностьРедактированияЗаказа() 

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция НеотработанныеЗапросыНаСайт(Знач Заказ) экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	b2b_ЗапросыНаОбновление.ТипЗапроса КАК ТипЗапроса
		|ИЗ
		|	РегистрСведений.b2b_ЗапросыНаОбновление КАК b2b_ЗапросыНаОбновление
		|ГДЕ
		|	b2b_ЗапросыНаОбновление.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ТипЗапроса"); 
 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


КонецФункции // НеотработанныеЗапросыНаСайт ()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ОтработатьЗапросыВОчереди(ТекстСообщения = "",МассивОшибок = неопределено) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	b2b_ЗапросыНаОбновление.Документ КАК Документ,
		|	b2b_ЗапросыНаОбновление.ТипЗапроса КАК ТипЗапроса,
		|	b2b_ЗапросыНаОбновление.ВходящиеПараметры КАК ВходящиеПараметры,
		|	b2b_ЗапросыНаОбновление.ДатаЗаписи КАК ДатаЗаписи,
		|	b2b_ЗапросыНаОбновление.ИдентификаторЗапроса КАК ИдентификаторЗапроса
		|ИЗ
		|	РегистрСведений.b2b_ЗапросыНаОбновление КАК b2b_ЗапросыНаОбновление
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаЗаписи";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ТипЗапроса  = ВыборкаДетальныеЗаписи.ТипЗапроса;
		ИдентификаторОчереди = ВыборкаДетальныеЗаписи.ИдентификаторЗапроса; 
		ОтработатьОтправкуОтТипаЗапроса(ТипЗапроса,ВыборкаДетальныеЗаписи.Документ,ВыборкаДетальныеЗаписи.ВходящиеПараметры,ИдентификаторОчереди,ТекстСообщения,МассивОшибок); 
		
	КонецЦикла;
	


КонецПроцедуры // ОтработатьЗапросыВОчереди()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ОтработатьОтправкуОтТипаЗапроса(ТипЗапроса,Документ,ВхПараметры,ИдентификаторОчереди,ТекстСообщения = "",МассивОшибок = неопределено)
	
	ПараметрыПередачи = ВхПараметры.Получить(); 
	ПараметрыПередачи.Вставить("ИдентификаторОчереди",ИдентификаторОчереди); 
	ПараметрыПередачи.Вставить("Заказ",Документ);
	ПараметрыПередачи.Вставить("ТипЗапроса",ТипЗапроса);
	
	РезультаОтработки = Ложь;
	ИдентификаторЗапроса = ""; //для вывода ошибки пользователю 
	
	Если ТипЗапроса = "СоздатьДозаказ" Тогда
		
		ЗаказыНаОтправку = новый Массив; 
		ЗаказыНаОтправку.Добавить(Документ);
		
		ОтправитьЗапросДоЗаказНаСервере(ЗаказыНаОтправку,РезультаОтработки,ИдентификаторОчереди,ИдентификаторЗапроса);
		
	ИначеЕсли ТипЗапроса = "ПодтвердитьДозаказ" Тогда  		
		
		ОтправитьЗапросПодтвердитьДозаказНаСервере(Документ,ПараметрыПередачи,РезультаОтработки,ИдентификаторЗапроса); 		
		
		
	ИначеЕсли ТипЗапроса = "ОтправитьклиентуТолькоВНаличии" Тогда
		//Заказы переходят в состояния
		
		ОтработатьЗапросОтправитьТолькоВНаличии(Документ,ПараметрыПередачи,РезультаОтработки,ИдентификаторЗапроса);
		
	ИначеЕсли ТипЗапроса = "ОтправитьклиентуТолькоДозаказ" Тогда 
		
		ОтработатьЗапросОтправитьТолькоДозаказ(Документ,ПараметрыПередачи,РезультаОтработки,ИдентификаторЗапроса); 
		
	ИначеЕсли ТипЗапроса = "ОтменитьЗаявку" Тогда 
		
		ПараметрыПередачи.Вставить("ОтменаЗаказа",истина); 
		ПараметрыПередачи.Вставить("Заказ",Документ);
		
		ОтработатьОтменуЗавки(Документ,ПараметрыПередачи,РезультаОтработки,ИдентификаторЗапроса); 
		
	ИначеЕсли ТипЗапроса = "ОтправитьКлиентуПолностью" Тогда
		
		ОтработатьЗапросОтправитьПолностью(Документ,ПараметрыПередачи,РезультаОтработки,ИдентификаторЗапроса); 
		
	ИначеЕсли ТипЗапроса = "ИзменитьМетодДоставки" Тогда
		
		ОтработатьЗапросИзмененияМетодаДоставки(Документ,ПараметрыПередачи,РезультаОтработки,ИдентификаторЗапроса);
		
	ИначеЕсли ТипЗапроса = "ОтправитьДатуОтгрузкиВместе" Тогда
		
		ОтработатьЗапросОтправкиДатыОтгрузки(Документ,ПараметрыПередачи,РезультаОтработки,ИдентификаторЗапроса);
		
	ИначеЕсли ТипЗапроса = "ОтправитьДатуОтгрузкиОтдельно" Тогда
		
		ОтработатьЗапросОтправкиДатыОтгрузки(Документ,ПараметрыПередачи,РезультаОтработки,ИдентификаторЗапроса);
		
	ИначеЕсли ТипЗапроса = "ОтменитьотгрузкуВналичии"  Тогда 
		
		ОтработатьЗапросОтменитьОтгрузку(Документ,ПараметрыПередачи,РезультаОтработки,ИдентификаторЗапроса);
		
	ИначеЕсли ТипЗапроса = "ОтменитьОтгрузкуДозаказа" Тогда
		
		ОтработатьЗапросОтменитьОтгрузку(Документ,ПараметрыПередачи,РезультаОтработки,ИдентификаторЗапроса);
		
	ИначеЕсли ТипЗапроса = "ОтменитьОтгрузкуЕдиную"  Тогда 
		ПараметрыПередачи.Вставить("ЕдинаяОтгрузка",Истина); 		
		ОтработатьЗапросОтменитьОтгрузку(Документ,ПараметрыПередачи,РезультаОтработки,ИдентификаторЗапроса);
		
	ИначеЕсли СтрНайти(ТипЗапроса,"ВыгрузкаОстатковЦО") > 0 Тогда
		
		ОтправкаДанныхПоОстаткамЦО(ПараметрыПередачи,РезультаОтработки,ИдентификаторЗапроса,МассивОшибок);
		
		РезультаОтработки = Истина;  //чтобы не зависали
		
	ИначеЕсли  СтрНайти(ТипЗапроса,"ВыгрузкаОстатков") > 0 Тогда 
		
		ОтправкаДанныхПоОстаткам(ПараметрыПередачи,РезультаОтработки,ИдентификаторЗапроса);
		
		РезультаОтработки = Истина;
	
	ИначеЕсли ТипЗапроса = "ПодтвердитьЗаКлиентаПолностью"  Тогда
		
		ОтработатьЗапросПодтвердитьЗаКлиентаПолностью(Документ,ПараметрыПередачи,РезультаОтработки,ИдентификаторЗапроса);

	КонецЕсли;
	
	Если РезультаОтработки Тогда
		
		НаборНаОбновление = РегистрыСведений.b2b_ЗапросыНаОбновление.СоздатьНаборЗаписей(); 
		НаборНаОбновление.Отбор.ТипЗапроса.Установить(ТипЗапроса); 
		НаборНаОбновление.Отбор.Документ.Установить(Документ); 
		НаборНаОбновление.Записать();
		
		Сообщить("Успешно отработан запрос с типом " + ТипЗапроса);
		//ТекстСообщения = "Успешно отработан запрос с типом " + ТипЗапроса;
		
		ТекстСообщения = "Успешно отработан запрос"; 
		
		
		
		Если ТипЗапроса = "ОтправитьДатуОтгрузкиВместе" Тогда
			
			
			ЭтоДозаказ = Ложь;
			ОсновнойЗаказ = НайтиОсновнойЗаказпоДозаказу(Документ); 
			
			Если ЗначениеЗаполнено(ОсновнойЗаказ) Тогда
				
				ЭтоДозаказ = Истина;
				ДокументДозаказа = Документ; 
				
			КонецЕсли;
			
			Если Не ЭтоДозаказ Тогда
				
				ОсновнойЗаказ = Документ; 
				ДокументДозаказа = НайтиДоЗаказпоОсновному(Документ); 
				
			КонецЕсли;
			
			ПараметрыДлязаписи = Новый Структура; 
			ПараметрыДлязаписи.Вставить("Отгружен",Истина);
			
			РНКСуществующее = неопределено; 
			
			//РезультатПроверкиСвязи =  ПроверитьСвязьСРНК(ОсновнойЗаказ,РНКСуществующее);
			МассивРНК = СвязанныеРНКЗаказ(ОсновнойЗаказ); 
			//Если ЗначениеЗаполнено(РНКСуществующее)
			//	И РНКСуществующее.Отгружен = Перечисления.Отгружен.Отгружен Тогда
			//	
			//	ЗаписатьДополнительныеДанныеВРегистрЗаказов(ОсновнойЗаказ,ПараметрыДлязаписи);	
			//	
			//КонецЕсли; 
			Если МассивРНК.Количество() > 0  Тогда
				ОтгруженПолностью = истина; 
				Для каждого РНК Из МассивРНК  Цикл
					
					Если РНК.Отгружен <> Перечисления.Отгружен.Отгружен Тогда
						
						ОтгруженПолностью = Ложь; 
						
					КонецЕсли;	
					
				КонецЦикла;
				
				Если ОтгруженПолностью Тогда
				
					ЗаписатьДополнительныеДанныеВРегистрЗаказов(ОсновнойЗаказ,ПараметрыДлязаписи);	
				
				КонецЕсли;
			
			КонецЕсли;
			
			
			Если ЗначениеЗаполнено(ДокументДозаказа) Тогда
				
				РНКСуществующее = неопределено; 
				
				//РезультатПроверкиСвязи =  ПроверитьСвязьСРНК(ДокументДозаказа,РНКСуществующее);
				//Если ЗначениеЗаполнено(РНКСуществующее)
				//	И РНКСуществующее.Отгружен = Перечисления.Отгружен.Отгружен Тогда
				//	
				//	ЗаписатьДополнительныеДанныеВРегистрЗаказов(ДокументДозаказа,ПараметрыДлязаписи);	
				//	
				//КонецЕсли;
				МассивРНК = СвязанныеРНКЗаказ(ДокументДозаказа);
				Если МассивРНК.Количество() > 0  Тогда
					ОтгруженПолностью = истина; 
					Для каждого РНК Из МассивРНК  Цикл
						
						Если РНК.Отгружен <> Перечисления.Отгружен.Отгружен Тогда
							
							ОтгруженПолностью = Ложь; 
							
						КонецЕсли;	
						
					КонецЦикла;
					
					Если ОтгруженПолностью Тогда
						
						ЗаписатьДополнительныеДанныеВРегистрЗаказов(ДокументДозаказа,ПараметрыДлязаписи);	
						
					КонецЕсли;
					
				КонецЕсли;

				
			КонецЕсли;
			
		ИначеЕсли   ТипЗапроса = "ОтправитьДатуОтгрузкиОтдельно" тогда 
			
			ПараметрыДлязаписи = Новый Структура; 
			ПараметрыДлязаписи.Вставить("Отгружен",Истина);
			
			РНКСуществующее = неопределено; 
			
			//РезультатПроверкиСвязи =  ПроверитьСвязьСРНК(Документ,РНКСуществующее);
			//Если ЗначениеЗаполнено(РНКСуществующее)
			//	И РНКСуществующее.Отгружен = Перечисления.Отгружен.Отгружен Тогда
			//	
			//	ЗаписатьДополнительныеДанныеВРегистрЗаказов(Документ,ПараметрыДлязаписи);	
			//	
			//КонецЕсли; 
			МассивРНК = СвязанныеРНКЗаказ(Документ);
			
			Если МассивРНК.Количество() > 0  Тогда
				ОтгруженПолностью = истина; 
				Для каждого РНК Из МассивРНК  Цикл
					
					Если РНК.Отгружен <> Перечисления.Отгружен.Отгружен Тогда
						
						ОтгруженПолностью = Ложь; 
						
					КонецЕсли;	
					
				КонецЦикла;
				
				Если ОтгруженПолностью Тогда
					
					ЗаписатьДополнительныеДанныеВРегистрЗаказов(Документ,ПараметрыДлязаписи);	
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
	Иначе 
		//тоже очишаем 
		
		НаборНаОбновление = РегистрыСведений.b2b_ЗапросыНаОбновление.СоздатьНаборЗаписей(); 
		НаборНаОбновление.Отбор.ТипЗапроса.Установить(ТипЗапроса); 
		НаборНаОбновление.Отбор.Документ.Установить(Документ); 
		НаборНаОбновление.Записать();
 
		Сообщить("Ошибка!!! отработки запроса с типом " + ТипЗапроса);
		
		ТекстСообщения = "Ошибка!!! отработки запроса с типом " + ТипЗапроса;
		
		Если ЗначениеЗаполнено(ИдентификаторЗапроса)  Тогда
			
			ОшибкаТекст = ТекстОшибкиПоИдентификаторуЗапроса(ИдентификаторЗапроса);
			
			ТекстСообщения = ТекстСообщения + Символы.ПС + ОшибкаТекст; 
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ТекстОшибкиПоИдентификаторуЗапроса(ИдентификаторЗапроса)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	b2b_ЗапросыНаОбновлениеИсторияСрезПоследних.ТекстОшибки КАК ТекстОшибки
		|ИЗ
		|	РегистрСведений.b2b_ЗапросыНаОбновлениеИстория.СрезПоследних(, ИдентификаторЗапроса = &ИдентификаторЗапроса) КАК b2b_ЗапросыНаОбновлениеИсторияСрезПоследних";
	
	Запрос.УстановитьПараметр("ИдентификаторЗапроса", Строка(ИдентификаторЗапроса));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	
		Возврат ВыборкаДетальныеЗаписи.ТекстОшибки; 	
	
	КонецЕсли;
	
	Возврат ""; 


КонецФункции // ТекстОшибкиПоИдентификаторуЗапрроса()


// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ОтправитьЗапросПодтвердитьДозаказНаСервере(Документ,ВхПараметры,РезультатОтправки,ИдентификаторЗапроса = неопределено)

	РезультатОтправки = Ложь; 
	
	b2b_ОбменЗаявками.ОтправкаПодтвержденияОтменыДоЗаказа(ВхПараметры,РезультатОтправки,ИдентификаторЗапроса);

КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ОтработатьЗапросОтменитьОтгрузку(Документ,ВхПараметры,РезультатОтправки,ИдентификаторЗапроса = неопределено)

	РезультатОтправки = Ложь; 
	b2b_ОбменЗаявками.ОтправкаОтменыОтгрузкиЗаказа(ВхПараметры,РезультатОтправки,ИдентификаторЗапроса);
	
	Если РезультатОтправки Тогда
		
		ЗаказОбъект = Документ.ПолучитьОбъект(); 
		ЗаказОбъект.СостояниеСогласования = Перечисления.СостоянияСогласования.ОтмененЦО;
		ЗаказОбъект.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.Отменен; 
		Попытка
			
			ЗаказОбъект.Записать(); 
			
		Исключение
			
		КонецПопытки;
		
		Если ВхПараметры.Свойство("ЕдинаяОтгрузка") 
			И ВхПараметры.ЕдинаяОтгрузка Тогда
		
			Дозаказ = НайтиДоЗаказпоОсновному(ЗаказОбъект.ссылка);
			Если ЗначениеЗаполнено(Дозаказ)  Тогда
			
				ЗаказОбъект = Дозаказ.ПолучитьОбъект(); 
				ЗаказОбъект.СостояниеСогласования = Перечисления.СостоянияСогласования.ОтмененЦО;
				ЗаказОбъект.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.Отменен; 
				Попытка
					
					ЗаказОбъект.Записать(); 
					
				Исключение
					
				КонецПопытки;	
			
			КонецЕсли;
		
		КонецЕсли;
		
		ПометитьНаУдалениеРНК(Документ,Ложь);  	
	
	КонецЕсли;

КонецПроцедуры // ОтработатьЗапросИзмененияМетодаДоставки()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ОтработатьЗапросИзмененияМетодаДоставки(Документ,ВхПараметры,РезультатОтправки,ИдентификаторЗапроса = неопределено)

	РезультатОтправки = Ложь; 
	b2b_ОбменЗаявками.ОтправкаДатыОтгрузки(ВхПараметры,РезультатОтправки,ИдентификаторЗапроса);

КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ОтработатьЗапросОтправкиДатыОтгрузки(Документ,ВхПараметры,РезультатОтправки,ИдентификаторЗапроса = неопределено)

	РезультатОтправки = Ложь; 
	b2b_ОбменЗаявками.ОтправкаДатыОтгрузки(ВхПараметры,РезультатОтправки,ИдентификаторЗапроса);

КонецПроцедуры 

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ОтработатьЗапросОтправитьТолькоВНаличии(Документ,ВхПараметры,РезультатОтправки,ИдентификаторЗапроса = неопределено)
	
	РезультатОтправки = Ложь; 
	
	b2b_ОбменЗаявками.ОтправкаНаСогласованиеТолькоОтгрузкиОтПоставщика(ВхПараметры,РезультатОтправки,ИдентификаторЗапроса);
	
	ПерезаписыватьЗаказ = Истина; 
	Если ВхПараметры.Свойство("ИзФормыЗаказа")
		И ВхПараметры.ИзФормыЗаказа Тогда
		
		ПерезаписыватьЗаказ = Ложь; 	
		
	КонецЕсли;
	Если РезультатОтправки Тогда 
		
		
		Если ПерезаписыватьЗаказ Тогда 
			ЗаказОбъект = Документ.ПолучитьОбъект(); 
			ЗаказОбъект.СостояниеСогласования = Перечисления.СостоянияСогласования.НаСогласованииКонтрагент; 
			Попытка
				
				ЗаказОбъект.Записать(); 
				
			Исключение
				
			КонецПопытки;
		КонецЕсли;
		
		Дозаказ = ВхПараметры.Дозаказ;	
				
	КонецЕсли;
	
	Если РезультатОтправки И  
		ЗначениеЗаполнено(Дозаказ) Тогда 
		
		Если ПерезаписыватьЗаказ Тогда
			ДозаказОбъект = Дозаказ.ПолучитьОбъект(); 
			ДозаказОбъект.СостояниеСогласования = Перечисления.СостоянияСогласования.ОтмененЦО;
			ДозаказОбъект.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.Отменен; 
			Попытка
				
				ДозаказОбъект.Записать(); 
				
			Исключение
				
			КонецПопытки; 
		КонецЕсли;
		
	КонецЕсли;
	

КонецПроцедуры


// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
//&НаСервере
Процедура ОтработатьЗапросОтправитьТолькоДозаказ(Документ,ВхПараметры,РезультатОтправки,ИдентификаторЗапроса = неопределено)
	
	РезультатОтправки = Ложь; 
	b2b_ОбменЗаявками.ОтправкаНаСогласованиеТолькоОтгрузкиОтПоставщика(ВхПараметры,РезультатОтправки,ИдентификаторЗапроса);
	
	Если РезультатОтправки Тогда 
		ЗаказОбъект = Документ.ПолучитьОбъект(); 
		ЗаказОбъект.СостояниеСогласования = Перечисления.СостоянияСогласования.НаСогласованииКонтрагент; 
		Попытка
			
			ЗаказОбъект.Записать(); 
			
		Исключение
			
		КонецПопытки;
		
		ОсновнойЗаказ = ВхПараметры.ОсновнойЗаказ;
		
		ОсновнойЗаказОбъект = ОсновнойЗаказ.ПолучитьОбъект(); 
		ОсновнойЗаказОбъект.СостояниеСогласования = Перечисления.СостоянияСогласования.ОтмененЦО;
		ОсновнойЗаказОбъект.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.Отменен; 
		Попытка
			
			ОсновнойЗаказОбъект.Записать(); 
			
		Исключение
			
		КонецПопытки;  
	Конецесли; 

	
	
КонецПроцедуры // ОтработатьЗапросОтправитьТолькоВНаличии()

Процедура ОтработатьЗапросПодтвердитьЗаКлиентаПолностью(Документ,ВхПараметры,РезультатОтправки,ИдентификаторЗапроса = неопределено)

	РезультатОтправки = Ложь; 
	ОтправкаПодтвержденияЗаКлиента(ВхПараметры,РезультатОтправки,ИдентификаторЗапроса);
	
	
КонецПроцедуры


// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция НайтиОсновнойЗаказпоДозаказу(Знач Заказ) ЭКспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	b2b_ДозаказыСрезПоследних.ЗаказОсновной КАК ЗаказОсновной
	|ИЗ
	|	РегистрСведений.b2b_Дозаказы КАК b2b_ДозаказыСрезПоследних
	|ГДЕ
	|	b2b_ДозаказыСрезПоследних.Заказ = &Заказ
	|	И НЕ b2b_ДозаказыСрезПоследних.ЗаказОсновной.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.ЗаказОсновной; 	
		
	КонецЕсли;
	
	Возврат Документы.Заказ.ПустаяСсылка(); 

КонецФункции // НайтиОсновнойЗаказпоДозаказу()

Функция НайтиДоЗаказпоОсновному(Знач Заказ) ЭКспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	b2b_ДозаказыСрезПоследних.Заказ КАК Заказ
	|ИЗ
	|	РегистрСведений.b2b_Дозаказы КАК b2b_ДозаказыСрезПоследних
	|ГДЕ
	|	b2b_ДозаказыСрезПоследних.ЗаказОсновной = &Заказ
	|	И НЕ b2b_ДозаказыСрезПоследних.Заказ.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.Заказ; 	
		
	КонецЕсли;
	
	Возврат Документы.Заказ.ПустаяСсылка(); 

КонецФункции // НайтиОсновнойЗаказпоДозаказу()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ОтработатьОтменуЗавки(Документ,ВхПараметры,РезультатОтправки,ИдентификаторЗапроса = неопределено)
	
	РезультатОтправки = Ложь; 
	
	b2b_ОбменЗаявками.ОтправкаСтатусаЗаказа(ВхПараметры,РезультатОтправки,,ИдентификаторЗапроса);
	
	ПерезаписыватьЗаказ = Истина; 
	Если ВхПараметры.Свойство("ИзФормыЗаказа")
		И ВхПараметры.ИзФормыЗаказа Тогда
		
		ПерезаписыватьЗаказ = Ложь; 	
		
	КонецЕсли;
	
	Если РезультатОтправки Тогда 
		Если ПерезаписыватьЗаказ Тогда 
			ДокументОбъект = Документ.ПолучитьОбъект(); 
			ДокументОбъект.СостояниеСогласования = Перечисления.СостоянияСогласования.ОтмененЦО;
			ДокументОбъект.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.Отменен; 
			Попытка
				
				ДокументОбъект.Записать(); 
				
			Исключение
				
			КонецПопытки; 
			
		КонецЕсли;
		
		
		Дозаказ = ВхПараметры.Дозаказ; 
		
		Если ЗначениеЗаполнено(Дозаказ) Тогда
			Если ПерезаписыватьЗаказ Тогда 
				ДозаказОбъект = Дозаказ.ПолучитьОбъект(); 
				ДозаказОбъект.СостояниеСогласования = Перечисления.СостоянияСогласования.ОтмененЦО;
				ДозаказОбъект.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.Отменен; 
				Попытка
					
					ДозаказОбъект.Записать(); 
					
				Исключение
					
				КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;
		
	Конецесли; 

КонецПроцедуры // ОтработатьОтменуЗавки()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ОтработатьЗапросОтправитьПолностью(Документ,ВхПараметры,РезультатОтправки,ИдентификаторЗапроса = неопределено)

	ЗаказОбъект = Документ.ПолучитьОбъект(); 
	ЗаказОбъект.СостояниеСогласования = Перечисления.СостоянияСогласования.НаСогласованииКонтрагент; 
	Попытка
	
		 ЗаказОбъект.Записать(); 
	
	Исключение
	
	КонецПопытки;
	
	Дозаказ = ВхПараметры.Дозаказ;
	
	Если ЗначениеЗаполнено(Дозаказ) Тогда
		
		ДозаказОбъект = Дозаказ.ПолучитьОбъект(); 
		ДозаказОбъект.СостояниеСогласования = Перечисления.СостоянияСогласования.НаСогласованииКонтрагент;
		 
		Попытка
			
			ДозаказОбъект.Записать(); 
			
		Исключение
			
		КонецПопытки;
		
		
	КонецЕсли;
	
	РезультатОтправки = Ложь;
	
	ВхПараметры.Вставить("Заказ",Документ); 
	
	Если ЗначениеЗаполнено(Дозаказ) Тогда
	
		b2b_ОбменЗаявками.ОтправкаСтатусаЗаказа(ВхПараметры,РезультатОтправки,истина,ИдентификаторЗапроса);	
	Иначе
		
		b2b_ОбменЗаявками.ОтправкаНаСогласованиеТолькоОтгрузкиОтПоставщика(ВхПараметры,РезультатОтправки,ИдентификаторЗапроса);
		
	КонецЕсли;
	
	

КонецПроцедуры // ОтработатьЗапросОтправитьПолностью()

Функция ПроверитьСостояниеЗаказа(Знач ЗаказКлиента, СостояниеЗаказа, СостояниеСогласования) Экспорт

	Возврат ЗаказКлиента.СостояниеНакладной = СостояниеЗаказа И ЗаказКлиента.СостояниеСогласования = СостояниеСогласования; 
		
КонецФункции

Процедура ЗаполнитьКоличествоКомплектующихПоСтроке_(СтрокаТЧ) экспорт
	Родитель = СтрокаТЧ.Номенклатура.Родитель; 
	
	КратностьКомплектующих =  Родитель.ШтукВКомплекте; 
	ВидНоменклатуры = Родитель.ВидНоменклатуры; 
	
	
	Если ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Товар тогда
		Если КратностьКомплектующих=0 
			ИЛИ СтрокаТЧ.Номенклатура.ВидКомплекта = Перечисления.ВидыКомплектов.ГотовыйКомплект тогда 
			КратностьКомплектующих=1;
		КонецЕсли;
		СтрокаТЧ.КоличествоКомплектующих = СтрокаТЧ.Количество* КратностьКомплектующих;
	иначе
		СтрокаТЧ.КоличествоКомплектующих = 0;
	КонецЕсли;
КонецПроцедуры	
Функция СоздатьРНКНаСервере(Знач Заказ,
	ЭтоДозаказ, Сообщения, ПоОстаткам = Ложь) Экспорт
	
	//НовыйДокумент = Документы.РасходнаяНакладная.СоздатьДокумент();
	//НовыйДокумент.Договор = НовыйДокумент.Контрагент.ОсновнойДоговор; 
	//НовыйДокумент.Заполнить(Заказ);
	
	
	НовыйДокумент = ЗаполнитьНовыйДокументРНК(Заказ, Заказ.Товары,Сообщения,ПоОстаткам);


	
	Попытка
	
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		
		ЗаказОбъект = Заказ.ПолучитьОбъект(); 
		ЗаказОбъект.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.ПодтвержденныйЗаказ;
		
		СтрокаСНакладной = ЗаказОбъект.РасходныеНакладные.Найти(НовыйДокумент.Ссылка,"Документ");
		Если  СтрокаСНакладной = Неопределено Тогда
			НоваяСтрокаРНК = ЗаказОбъект.РасходныеНакладные.Добавить();
			НоваяСтрокаРНК.Документ = НовыйДокумент.Ссылка; 
		КонецЕсли;
		ЗаказОбъект.Записать();  
		
		b2b_ОбменЗаявками.ЗаписатьСоответствиеРНКЗаказ(Заказ,НовыйДокумент.Ссылка);
		
		МетодДоставки = b2b_ОбменЗаявками.МетодДоставкиПоЗаказу(Заказ);
		
		ПараметрыНаОтправку = Новый Структура;
		ПараметрыНаОтправку.Вставить("НомерЗаявки",Заказ.НомерЗаказа);
		
		ТипЗапроса = "ОтправитьДатуОтгрузкиВместе";
		//ПараметрыНаОтправку.Вставить("ДатаОтгрузкиЗаказа",Заказ.ДатаОтгрузки);
		
		Если МетодДоставки = "F"  и НЕ ЭтоДозаказ Тогда
		
			ТипЗапроса = "ОтправитьДатуОтгрузкиВместе";
			
			ПараметрыНаОтправку.Вставить("ДатаОтгрузкиЗаказа",Заказ.ДатаОтгрузки);
		
		КонецЕсли;
		
		Если МетодДоставки = "F"  и ЭтоДозаказ Тогда
		
			ТипЗапроса = "ОтправитьДатуОтгрузкиВместе";
			
			ОсновнойЗаказ = НайтиОсновнойЗаказпоДозаказу(Заказ); 
			
			ПараметрыНаОтправку.Вставить("ДатаОтгрузкиЗаказа",ОсновнойЗаказ.ДатаОтгрузки);
		
		КонецЕсли;
		
		Если МетодДоставки = "P"  Тогда
		
			ТипЗапроса = "ОтправитьДатуОтгрузкиОтдельно";
			
			Если ЭтоДозаказ  Тогда
			
				ПараметрыНаОтправку.Вставить("ДатаОтгрузкиДозаказа",Заказ.ДатаОтгрузки);
				
			Иначе 
				
				ПараметрыНаОтправку.Вставить("ДатаОтгрузкиЗаказа",Заказ.ДатаОтгрузки);
				
			КонецЕсли;
		
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(МетодДоставки) Тогда
		
			//подтвержден был или заказ или дозаказ 
			//или заявка без дозаказа 
			
			Если ЭтоДозаказ Тогда
			
				ПараметрыНаОтправку.Вставить("ДатаОтгрузкиДозаказа",Заказ.ДатаОтгрузки);	
			Иначе 
				ПараметрыНаОтправку.Вставить("ДатаОтгрузкиЗаказа",Заказ.ДатаОтгрузки);
			КонецЕсли;
		
		КонецЕсли;
		
		 
		
		b2b_ОбменЗаявками.ЗаписатьВОчередьНаОтправку(Заказ,ТипЗапроса,ПараметрыНаОтправку,Сообщения); 
		
		
		
		Возврат НовыйДокумент.Ссылка; 
		
	Исключение
		
		Сообщить(ОписаниеОшибки());
		
		Сообщения.Добавить(ОписаниеОшибки()); 
		
	КонецПопытки;
	
КонецФункции

Функция ЗаполнитьНовыйДокументРНК(Знач Заказ, Товары,Сообщения,ПоОстаткам = Ложь)
	
	ДополнительныеРеквизиты = Новый Структура("СостояниеНакладной, Отгружен, Склад, Дата",
	Перечисления.СостоянияНакладной.ВРаботе, Перечисления.Отгружен.Резерв, Заказ.Склад,ТекущаяДата());
	
	НовыйДокОбъект = Документы.РасходнаяНакладная.СоздатьДокумент();
	
	ЗаполнитьЗначенияСвойств(НовыйДокОбъект, Заказ,,"Номер,Дата,ДокОснование,ДатаОформления");
	
	НовыйДокОбъект.Дата = ТекущаяДатаСеанса();
	НовыйДокОбъект.ДатаОформления = ТекущаяДатаСеанса();
	КодИБ = ПараметрыСеанса.ЭтотУзел.Код + "б";
	НовыйДокОбъект.УстановитьНовыйНомер(КодИБ + "-");
	НовыйДокОбъект.ДокОснование = Заказ.ссылка; 
	НовыйДокОбъект.НомерЗаказаВторичногоКонтрагента = Заказ.НомерЗаказа; 
	
	ЗаполнитьШапкуДокументаРНК(НовыйДокОбъект,ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац); 
	
	Если ТипЗнч(ДополнительныеРеквизиты) = Тип("Структура") Тогда
		Для Каждого Элемент из ДополнительныеРеквизиты Цикл
			
			НовыйДокОбъект[Элемент.Ключ] = Элемент.Значение;  
			
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НовыйДокОбъект.ТипЦен) Тогда
		НовыйДокОбъект.ТипЦен = НовыйДокОбъект.Контрагент.ТипЦен;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(НовыйДокОбъект.ТипЦенРаспродажа) Тогда
		НовыйДокОбъект.ТипЦенРаспродажа = НовыйДокОбъект.Контрагент.ТипЦенРаспродажа;
	КонецЕсли;
	
	КэшОстатки = Новый Соответствие;
	
	Если ПоОстаткам Тогда
	
		МассивТоваровОстатки = Товары.Выгрузить().ВыгрузитьКолонку("Номенклатура"); 
		Склад = Заказ.Склад; 
		
		b2b_ОбменЗаявками.ПолучитьОстаткиПоЗаявкам(МассивТоваровОстатки,Склад,Заказ,КэшОстатки);	
	
	КонецЕсли;
	
	Для Каждого СтрокаТоваров ИЗ Товары Цикл
		
		НоваяСтрока = НовыйДокОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
		
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.СтавкаНДС) Тогда
			Родитель = НоваяСтрока.Номенклатура.Родитель; 
			НоваяСтрока.СтавкаНДС = ПолучитьСтавкуНДС_(НоваяСтрока.Номенклатура);// Родитель.СтавкаНДС; 
		КонецЕсли;
		
		НоваяСтрока.Коэффициент = 1;
		НоваяСтрока.Единица = НоваяСтрока.Номенклатура.ОсновнаяЕдиница;
		НоваяСтрока.Заявка = НоваяСтрока.Количество;
		
		НоваяСтрока.Цена = СтрокаТоваров.Цена; 
		Если ПоОстаткам Тогда
			Если КэшОстатки.Получить(НоваяСтрока.Номенклатура) <> неопределено Тогда
			    СвободныйОстаток = КэшОстатки.Получить(НоваяСтрока.Номенклатура).СвободныйОстаток;
			Иначе
				СвободныйОстаток = 0;
			КонецЕсли;
			КоличествоПроставить =  Мин(СвободныйОстаток,НоваяСтрока.Количество);	
			Если КоличествоПроставить <> НоваяСтрока.Количество Тогда
			
				Сообщения.Добавить("По строке №" + Строка(НоваяСтрока.НомерСтроки) + " было проставлено кол-во, отличное от заявки"); 
			
			КонецЕсли;
			НоваяСтрока.Количество =  КоличествоПроставить; 
		КонецЕсли;
		НоваяСтрока.ПодтвержденнаяЗаявка = НоваяСтрока.Количество;
		
		НоваяСтрока.Всего = НоваяСтрока.Количество * НоваяСтрока.Цена;
		
		ЗаполнитьКоличествоКомплектующихПоСтроке_(НоваяСтрока); 
		РассчитатьСуммуТабЧасти_(НоваяСтрока, НовыйДокОбъект);
		
	КонецЦикла;
	
	
	ЗаполнитьУпаковку = Ложь;
	
	
	УстановитьПунктДоставкиСервер_(НовыйДокОбъект);
	Если НовыйДокОбъект.ПунктДоставки.ВидыДопОбработок.Количество() = 0 Тогда
		Для Каждого СтрокаТЧ Из НовыйДокОбъект.Контрагент.ВидыДопОбработок Цикл
			СтрокаДО = НовыйДокОбъект.ДопОбработки.Добавить();	
			СтрокаДО.ВидДопОбработки = СтрокаТЧ.ДопОбработка;
			Если СтрокаДО.ВидДопОбработки.РассчитыватьУпаковку Тогда
				ЗаполнитьУпаковку = Истина;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого СтрокаТЧ Из НовыйДокОбъект.ПунктДоставки.ВидыДопОбработок Цикл
			СтрокаДО = НовыйДокОбъект.ДопОбработки.Добавить();	
			СтрокаДО.ВидДопОбработки = СтрокаТЧ.ДопОбработка;
			Если СтрокаДО.ВидДопОбработки.РассчитыватьУпаковку Тогда
				ЗаполнитьУпаковку = Истина;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
	
	НовыйДокОбъект.Упаковка.Очистить();
	
	Если ЗаполнитьУпаковку Тогда
		ТЗУпаковки = ПолучитьТЗУпаковки_(НовыйДокОбъект.Товары.Выгрузить(,"Номенклатура,Количество"), НовыйДокОбъект.Контрагент);
		
		Для Каждого СтрокаТЗ ИЗ ТЗУпаковки Цикл
			Если СтрокаТЗ.ДопОбработка <> Справочники.ВидыДопОбработки.ПустаяСсылка() Тогда
				Если НовыйДокОбъект.ДопОбработки.Найти(СтрокаТЗ.ДопОбработка)=Неопределено тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Если СтрокаТЗ.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = НовыйДокОбъект.Упаковка.Добавить();
			НоваяСтрока.Номенклатура = СтрокаТЗ.Номенклатура;
			НоваяСтрока.Количество = СтрокаТЗ.Количество;
			НоваяСтрока.ПодтвержденнаяЗаявка = СтрокаТЗ.Количество;		
		КонецЦикла;
	КонецЕсли;
	
	Возврат НовыйДокОбъект; 

КонецФункции // 
Процедура УстановитьПунктДоставкиСервер_(ДокументОбъект) Экспорт
	
	Контрагент = ДокументОбъект.Контрагент;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Если ЗначениеЗаполнено(Контрагент.ОсновнойПунктДоставки) Тогда
			ДокументОбъект.ПунктДоставки = Контрагент.ОсновнойПунктДоставки;	
		ИначеЕсли КоличествоПДСервер_(Контрагент) = 1 Тогда		
			Выборка = Справочники.ПунктыДоставки.Выбрать(,Контрагент);
			Пока Выборка.Следующий() Цикл
				ДокументОбъект.ПунктДоставки = Выборка.Ссылка;			
			КонецЦикла;
		Иначе
			ДокументОбъект.ПунктДоставки=Неопределено;		
		КонецЕсли;		
	Иначе
		ДокументОбъект.ПунктДоставки =Неопределено;		
	КонецЕсли;	
КонецПроцедуры

Функция КоличествоПДСервер_(Контрагент) Экспорт
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Владелец",Контрагент);
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ссылка) КАК Количество
		|ИЗ
		|	Справочник.ПунктыДоставки КАК ПунктыДоставки
		|ГДЕ
		|	Владелец = &Владелец";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Количество;			
		КонецЕсли;		
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ПолучитьТЗУпаковки_(ТЧ,Контрагент=Неопределено)   Экспорт	 
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура");
	ТЗ.Колонки.Добавить("Родитель");
	ТЗ.Колонки.Добавить("Количество");
	ТЗ.Колонки.Добавить("Номенклатура2");
	ТЗ.Колонки.Добавить("ДопОбработка");
	
	Для Каждого СтрокаТЧ ИЗ ТЧ Цикл
		ВыборкаУпаковки = Справочники.Упаковка.Выбрать(,СтрокаТЧ.Номенклатура);
		Пока ВыборкаУпаковки.Следующий() Цикл  
			
			Если ВыборкаУпаковки.НезаполнятьВНакладных тогда
				Продолжить;
			КонецЕсли;
			
			
			Для Каждого СтрокаУпаковки Из ВыборкаУпаковки.ЭлементыУпаковки Цикл
				
				Если  ЗначениеЗаполнено(СтрокаУпаковки.Контрагент) и СтрокаУпаковки.Контрагент<>Контрагент тогда 
					Продолжить;
				КонецЕсли; 			
				
				
				СтрокаТЗ = ТЗ.Добавить();
				СтрокаТЗ.ДопОбработка=СтрокаУпаковки.ВидДопОбработки;
				
				СтрокаТЗ.Номенклатура = СтрокаУпаковки.Номенклатура;
				СтрокаТЗ.Номенклатура2 = СтрокаТЧ.Номенклатура.родитель;
				СтрокаТЗ.Родитель = СтрокаТЧ.Номенклатура.Родитель.Родитель;
				СтрокаТЗ.Количество = СтрокаУпаковки.Количество*СтрокаТЧ.Количество;
							
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ТЗ.Свернуть("Номенклатура,ДопОбработка","Количество");
	
	Возврат ТЗ;
КонецФункции



Процедура УстановитьНезаполненныйРеквизитШапкиРНК(Объект, ИмяРеквизита,ЗначениеРеквизита) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Объект[ИмяРеквизита]) Тогда
		Объект[ИмяРеквизита]=ЗначениеРеквизита;
	КонецЕсли;
КонецПроцедуры 

Процедура ЗаполнитьШапкуДокументаРНК(ДокументОбъект, ТекПользователь, ВалютаРегламентированногоУчета = Неопределено) Экспорт
	
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	ВидДокумента		= МетаданныеДокумента.Имя;
	
	ОсновнойСклад		= ПолучитьЗначениеПоУмолчаниюПользователь_("ОсновнойСклад");	
			
	Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
		ТекИБ=Справочники.ИБ.НайтиПоКоду("SSP");
	Иначе			
		Если ЗначениеЗаполнено(ОсновнойСклад) И ЗначениеЗаполнено(ОсновнойСклад.ПрефиксИБ) Тогда
			ТекИБ=Справочники.ИБ.НайтиПоКоду(ОсновнойСклад.ПрефиксИБ);
		Иначе			
			ТекИБ=ПолучитьИБПоУмолчанию();			
		КонецЕсли;		
	КонецЕсли;
	
	ДокументОбъект.ИБ = ТекИБ; 
	
	
	
	ДокументОбъект.Автор   = ПараметрыСеанса.Пользователь;
	
	УстановитьНезаполненныйРеквизитШапкиРНК(ДокументОбъект,"Организация",ПолучитьЗначениеПоУмолчаниюПользователь_("ОсновнаяОрганизация")); 
	УстановитьНезаполненныйРеквизитШапкиРНК(ДокументОбъект,"Отгружен",Перечисления.Отгружен.Резерв);
	УстановитьНезаполненныйРеквизитШапкиРНК(ДокументОбъект,"СостояниеНакладной",Перечисления.СостоянияНакладной.ВРаботе);
	УстановитьНезаполненныйРеквизитШапкиРНК(ДокументОбъект,"ВидОплаты",ПолучитьЗначениеПоУмолчаниюПользователь_("ОсновнойВидОплаты"));
	УстановитьНезаполненныйРеквизитШапкиРНК(ДокументОбъект,"Подразделение",	ПолучитьЗначениеПоУмолчаниюПользователь_("ОсновноеПодразделение"));	
	
	УстановитьНезаполненныйРеквизитШапкиРНК(ДокументОбъект,"Склад",				ОсновнойСклад);
	
	УстановитьНезаполненныйРеквизитШапкиРНК(ДокументОбъект,"СостояниеДокументов",	Перечисления.СостояниеДокументов.НеВыписаны);
	УстановитьНезаполненныйРеквизитШапкиРНК(ДокументОбъект,"БанковскийСчет",		ДокументОбъект.Организация.ОсновнойБанковскийСчет);	
		
	
	УстановитьНезаполненныйРеквизитШапкиРНК(ДокументОбъект,"Валюта",		ПолучитьЗначениеПоУмолчаниюПользователь_("ОсновнаяВалютаПродажи"));	
	УстановитьНезаполненныйРеквизитШапкиРНК(ДокументОбъект,"Контрагент",	ПолучитьЗначениеПоУмолчаниюПользователь_("ОсновнойПокупатель"));		
	УстановитьНезаполненныйРеквизитШапкиРНК(ДокументОбъект,"ТипЦен",		ПолучитьЗначениеПоУмолчаниюПользователь_("ОсновнойТипЦенПродажи"));
	//УстановитьНезаполненныйРеквизитШапкиРНК(ДокументОбъект,"Отгружен",		Перечисления.Отгружен.Резерв 						,	МетаданныеДокумента);
	
	если ЗначениеЗаполнено(ДокументОбъект.Контрагент) и  ТипЗнч(ДокументОбъект.Контрагент) = Тип("СправочникСсылка.Контрагенты") тогда
		УстановитьНезаполненныйРеквизитШапкиРНК(ДокументОбъект,"Договор",	ДокументОбъект.Контрагент.ОсновнойДоговор); 
	КонецЕсли;
		
	
	УстановитьНезаполненныйРеквизитШапкиРНК(ДокументОбъект,"Валюта",			ПараметрыСеанса.ВалютаНац);
	 	 
	
	Если (НЕ ЗначениеЗаполнено(ДокументОбъект.Курс)) Тогда
		Доллары=Справочники.Валюты.НайтиПоКоду("840");
		
		ТекВалюта=?(ДокументОбъект.Валюта=ПараметрыСеанса.ВалютаНац,Доллары,ДокументОбъект.Валюта);//по исторически сложившейся традиции для рублей указывается курс доллара
		
		СтруктураКурсаДокумента      = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДокументОбъект.Дата, Новый Структура("Валюта", ТекВалюта));
		
		ДокументОбъект.Курс			 = СтруктураКурсаДокумента.Курс;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ДокументОбъект.Склад)  Тогда		
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.Организация)  Тогда
			ДокументОбъект.Организация=ДокументОбъект.Склад.Организация;		
		КонецЕсли;		
	КонецЕсли;	
	
		//крохин
КонецПроцедуры

Функция ПолучитьЗначениеПоУмолчаниюПользователь_(Настройка,Знач Пользователь=Неопределено,Рекурсивно=Истина) Экспорт

	Пользователь=?(Пользователь=Неопределено,ПараметрыСеанса.Пользователь,Пользователь); 
	
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Настройка"   , ПланыВидовХарактеристик.НастройкиПользователей[Настройка]);

	Запрос.Текст = "
		|ВЫБРАТЬ
		|	Значение
		|ИЗ
		|	РегистрСведений.НастройкиПользователей КАК РегистрЗначениеПрав
		|
		|ГДЕ
		|	Пользователь = &Пользователь
		| И Настройка    = &Настройка
		|";

	Выборка = Запрос.Выполнить().Выбрать();

	ПустоеЗначение = ПланыВидовХарактеристик.НастройкиПользователей[Настройка].ТипЗначения.ПривестиЗначение();
	
	Если Выборка.Следующий() И НЕ ЗначениеНеЗаполнено(Выборка.Значение) Тогда
		Возврат Выборка.Значение;	
	ИначеЕсли Пользователь<>Справочники.Пользователи.НастройкиПоУмолчанию И Рекурсивно Тогда
		Возврат ПолучитьЗначениеПоУмолчанию(Настройка,Справочники.Пользователи.НастройкиПоУмолчанию);
	Иначе
		Возврат ПустоеЗначение;		
	КонецЕсли;
КонецФункции
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция СоздатьРНКПоНесколькимЗаказам(МассивЗаказов,Сообщения) Экспорт

	//по заказу и дозаказу РНК 
	НовыйДокумент = Документы.РасходнаяНакладная.СоздатьДокумент();
	ТЧТовары = НовыйДокумент.Товары.Выгрузить().Скопировать(); 
	//НовыйДокумент.Заполнить(МассивЗаказов[0]);
	//НовыйДокумент.ДатаОтгрузки = МассивЗаказов[0].ДатаОтгрузки;  
	//
	////НомерЗаказа = 1; 
	//
	
	Для НомерЗаказа  = 0 по МассивЗаказов.Количество() - 1 Цикл 
		
		Для каждого СтрокаТовара Из МассивЗаказов[НомерЗаказа].Товары Цикл
			
			СтрокаТЧ = ТЧТовары.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаТовара); 	
			
		КонецЦикла;
	КонецЦикла;
	
	НовыйДокумент = ЗаполнитьНовыйДокументРНК(МассивЗаказов[0], ТЧТовары,Сообщения);
	
	Попытка
	
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение); 
		
		//метод доставки в этом случае вместе 
		
		Для каждого ЗаказИзМассива Из МассивЗаказов Цикл
			
			ЗаказОбъект = ЗаказИзМассива.ПолучитьОбъект(); 
			ЗаказОбъект.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.ПодтвержденныйЗаказ;
			
			СтрокаСНакладной = ЗаказОбъект.РасходныеНакладные.Найти(НовыйДокумент.Ссылка,"Документ");
			Если  СтрокаСНакладной = Неопределено Тогда
				НоваяСтрокаРНК = ЗаказОбъект.РасходныеНакладные.Добавить();
				НоваяСтрокаРНК.Документ = НовыйДокумент.Ссылка; 
			КонецЕсли;
			ЗаказОбъект.Записать();
			
		
			b2b_ОбменЗаявками.ЗаписатьСоответствиеРНКЗаказ(ЗаказИзМассива,НовыйДокумент.Ссылка);	
			
			
			МетодДоставки = b2b_ОбменЗаявками.МетодДоставкиПоЗаказу(ЗаказИзМассива);
			
			ПараметрыНаОтправку = Новый Структура;
			ПараметрыНаОтправку.Вставить("НомерЗаявки",ЗаказИзМассива.НомерЗаказа);
			
			ТипЗапроса = "ОтправитьДатуОтгрузкиВместе";
			ПараметрыНаОтправку.Вставить("ДатаОтгрузкиЗаказа",ЗаказИзМассива.ДатаОтгрузки);
			
			Если МетодДоставки = "F" Тогда
				
				ТипЗапроса = "ОтправитьДатуОтгрузкиВместе";
				
				ПараметрыНаОтправку.Вставить("ДатаОтгрузкиЗаказа",ЗаказИзМассива.ДатаОтгрузки);
				
			КонецЕсли;
			
			ЭтоДозаказ = Ложь;
			ОсновнойЗаказ = НайтиОсновнойЗаказпоДозаказу(ЗаказИзМассива); 
			Если ЗначениеЗаполнено(ОсновнойЗаказ) Тогда
				ЭтоДозаказ = Истина; 
			КонецЕсли;
			
			Если МетодДоставки = "F"  и ЭтоДозаказ Тогда
				
				ТипЗапроса = "ОтправитьДатуОтгрузкиВместе";
				
				//ОсновнойЗаказ = НайтиОсновнойЗаказпоДозаказу(Заказ); 
				
				ПараметрыНаОтправку.Вставить("ДатаОтгрузкиЗаказа",ОсновнойЗаказ.ДатаОтгрузки);
				
			КонецЕсли;
			
			
			
			Если МетодДоставки = "P"  Тогда
				
				ТипЗапроса = "ОтправитьДатуОтгрузкиОтдельно";				 
				
				Если ЭтоДозаказ  Тогда
					
					ПараметрыНаОтправку.Вставить("ДатаОтгрузкиДозаказа",ЗаказИзМассива.ДатаОтгрузки);
					
				Иначе 
					
					ПараметрыНаОтправку.Вставить("ДатаОтгрузкиЗаказа",ЗаказИзМассива.ДатаОтгрузки);
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(МетодДоставки) Тогда
				
				//подтвержден был или заказ или дозаказ 
				//или заявка без дозаказа 
				
				Если ЭтоДозаказ Тогда
					
					ПараметрыНаОтправку.Вставить("ДатаОтгрузкиДозаказа",ЗаказИзМассива.ДатаОтгрузки);	
					
				КонецЕсли;
				
			КонецЕсли; 	
			
			ПараметрыНаОтправку.Вставить("МетодДоставки",МетодДоставки); 
			
			b2b_ОбменЗаявками.ЗаписатьВОчередьНаОтправку(ЗаказИзМассива,ТипЗапроса,ПараметрыНаОтправку,Сообщения);
		КонецЦикла; 
		
		
		Возврат НовыйДокумент.Ссылка; 			
		
	Исключение
		
		Сообщить(ОписаниеОшибки());
		
		Сообщения.Добавить(ОписаниеОшибки()); 
		
	КонецПопытки;


КонецФункции // СоздатьРНКПоНесколькимЗаказам()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция Этоb2bЗаказКлиента(Знач Заказ) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	b2b_ЗаявкиКлиентов.Заказ КАК Заказ
		|ИЗ
		|	РегистрСведений.b2b_ЗаявкиКлиентов КАК b2b_ЗаявкиКлиентов
		|ГДЕ
		|	b2b_ЗаявкиКлиентов.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой(); 

КонецФункции // Этоb2bЗаказКлиента()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ВернутьЗаказВРаботу(Знач РНК)  Экспорт 
	//
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	b2b_СоответствиеРНКЗаказы.Заказ КАК Заказ
	|ИЗ
	|	РегистрСведений.b2b_СоответствиеРНКЗаказы КАК b2b_СоответствиеРНКЗаказы
	|ГДЕ
	|	b2b_СоответствиеРНКЗаказы.РНК = &РНК";
	
	Запрос.УстановитьПараметр("РНК", РНК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	РезультатСвязи =  РезультатЗапроса.Пустой(); 
	
	Если НЕ РезультатСвязи Тогда
		
		Выборка = РезультатЗапроса.Выбрать(); 
		
		Пока Выборка.Следующий() Цикл 
			
			Заказ = Выборка.Заказ;
			
			ЗаказОбъект = Заказ.ПолучитьОбъект(); 
			
			Если ЗаказОбъект.СостояниеНакладной <> Перечисления.СостоянияЗаказаКонтрагента.Отменен Тогда
				
				ЗаказОбъект.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.ВРаботе;	
				
			КонецЕсли;
			 
			СтрокаРНК = ЗаказОбъект.РасходныеНакладные.Найти(РНК.ссылка,"Документ"); 
			Если СтрокаРНК <> неопределено Тогда
			
				ЗаказОбъект.РасходныеНакладные.Удалить(СтрокаРНК); 
			
			КонецЕсли;
			
			Попытка
				
				ЗаказОбъект.Записать(); 
			
				НаборЗаписей = РегистрыСведений.b2b_СоответствиеРНКЗаказы.СоздатьНаборЗаписей(); 
			    НаборЗаписей.Отбор.Заказ.Установить(ЗаказОбъект.ссылка); 
				НаборЗаписей.Записать(); 
				
			Исключение
			     Сообщить(ОписаниеОшибки()); 
			КонецПопытки;
			
		КонецЦикла;
		
		
	КонецЕсли;
	
	 


КонецФункции // ВернутьЗаказВРаботу()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Процедура ПометитьНаУдалениеРНК(Знач Заказ, РезультатУдаления) Экспорт 
	
	РезультатУдаления = Ложь; 
	РНКСуществующее = неопределено; 
	СвязьПустая = ПроверитьСвязьСРНК(Заказ,РНКСуществующее);
	Если СвязьПустая Тогда
		
		Сообщить("РНК по заказу " + Строка(Заказ) + " не найден"); 
		Возврат; 	
		
	КонецЕсли;
	
	 РНКОбъект = РНКСуществующее.ПолучитьОбъект(); 
	 РНКОбъект.ПометкаУдаления = истина; 
	 
	 
	 Попытка
		 Если РНКОбъект.Проведен Тогда
			 
			 РНКОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);	
			 
		 КонецЕсли;
		 РНКОбъект.Записать(); 
		  
		 //
		 РезультатУдаления = Истина;
		 
		 //попробуем отправить пустую дату отгрузки 
		 
		 ПометитьНаУдалениеРНКОтправкаЗапросаНаПортал(Заказ);

		 
	 Исключение
		 Сообщить(ОписаниеОшибки()); 
	 КонецПопытки;  
	 

КонецПроцедуры

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ОстаткиДляОтправкиНаСайт(ТолькоИзменения = Истина,ОстаткиЦО = Ложь) Экспорт 
	
	Запрос=Новый Запрос;     
	
	запрос.Текст = "ВЫБРАТЬ
	|	Ном.Ссылка КАК Номенклатура,
	//++Данилова Е.В. 18.02.2025
	//|	ВЫБОР
	//|		КОГДА СУММА(ЕСТЬNULL(ВложенныйЗапрос.КолКонФакт, 0)) > 1000
	//|			ТОГДА 1000
	//|		КОГДА СУММА(ЕСТЬNULL(ВложенныйЗапрос.КолКонФакт, 0)) < 0
	//|			ТОГДА 0
	//|		ИНАЧЕ СУММА(ЕСТЬNULL(ВложенныйЗапрос.КолКонФакт, 0))
	//|	КОНЕЦ КАК Остаток,
	//|	ВЫБОР
	//|		КОГДА СУММА(ЕСТЬNULL(ВложенныйЗапрос.КолКонФакт, 0)) > 1000
	//|			ТОГДА 1000
	|	ВЫБОР КОГДА СУММА(ЕСТЬNULL(ВложенныйЗапрос.КолКонФакт, 0)) < 0
	|			ТОГДА 0
	|		ИНАЧЕ СУММА(ЕСТЬNULL(ВложенныйЗапрос.КолКонФакт, 0))
	|	КОНЕЦ КАК Остаток,
	//--Данилова Е.В. 18.02.2025
	|	ШтрихКодыНоменклатуры.Наименование КАК ШтрихКод
	|ПОМЕСТИТЬ ВТОстатки
	|ИЗ
	|	Справочник.Номенклатура КАК Ном
	//++Данилова Е.В. 24.11.2025 HELP-7957
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//--Данилова Е.В. 24.11.2025 
	|			СУММА(Остатки.КоличествоКонечныйОстаток) КАК КолКонБух,
	|			ВЫБОР
	|				КОГДА СУММА(Остатки.КоличествоКонечныйОстаток) = 0
	|					ТОГДА NULL
	|				ИНАЧЕ СУММА(Остатки.СуммаКонечныйОстаток) / СУММА(Остатки.КоличествоКонечныйОстаток)
	|			КОНЕЦ КАК ЦенаСеб,
	|			ВЫБОР
	|				КОГДА СУММА(Остатки.КоличествоКонечныйОстаток - ЕСТЬNULL(Резервы.КоличествоКонечныйОстаток, 0) - ЕСТЬNULL(МинимальныеОстаткиНаСкладахСрезПоследних.Количество, 0)) < 0
	|					ТОГДА 0
	|				ИНАЧЕ СУММА(Остатки.КоличествоКонечныйОстаток - ЕСТЬNULL(Резервы.КоличествоКонечныйОстаток, 0) - ЕСТЬNULL(МинимальныеОстаткиНаСкладахСрезПоследних.Количество, 0))
	|			КОНЕЦ КАК КолКонФакт,
	|			СУММА(ЕСТЬNULL(Резервы.КоличествоКонечныйОстаток, 0)) КАК Резерв,
	|			Остатки.Номенклатура.Ссылка КАК НоменклатураСсылка,
	|			Остатки.Склад КАК Склад
	|		ИЗ
	|			РегистрНакопления.ОстаткиТМЦ.ОстаткиИОбороты(&Дата1, &Дата2, Период, , Склад В ИЕРАРХИИ (&Склады)) КАК Остатки
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.ОстаткиИОбороты(&дата1, &дата2, Период, , Склад В ИЕРАРХИИ (&Склады)) КАК Резервы
	|				ПО Остатки.Номенклатура = Резервы.Номенклатура
	|					И Остатки.Склад = Резервы.Склад
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МинимальныеОстаткиНаСкладах.СрезПоследних(&Дата2, ) КАК МинимальныеОстаткиНаСкладахСрезПоследних
	|				ПО Остатки.Склад = МинимальныеОстаткиНаСкладахСрезПоследних.Склад
	|					И Остатки.Номенклатура = МинимальныеОстаткиНаСкладахСрезПоследних.Номенклатура
	|					И (МинимальныеОстаткиНаСкладахСрезПоследних.Регистратор.ТипОстатков = &ТипОстатков)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Остатки.Номенклатура.Ссылка,
	|			Остатки.Склад) КАК ВложенныйЗапрос
	|		ПО Ном.Ссылка = ВложенныйЗапрос.НоменклатураСсылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихКоды КАК ШтрихКодыНоменклатуры
	|		ПО (ШтрихКодыНоменклатуры.Владелец = Ном.Ссылка)
	|			И (ШтрихКодыНоменклатуры.ТипШК = ЗНАЧЕНИЕ(перечисление.ТипыШтрихКодов.Штука))
	|			И (ШтрихКодыНоменклатуры.ВидШК = ЗНАЧЕНИЕ(перечисление.ВидыШК.Основной))
	|			И (НЕ ШтрихКодыНоменклатуры.ПометкаУдаления)
	|ГДЕ
	|	НЕ Ном.ЭтоГруппа
	|	И ВЫБОР
	|			КОГДА Ном.Ссылка.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|				ТОГДА ""Да""
	|			КОГДА Ном.Ссылка.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	|				ТОГДА ""Нет""
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Ном.Ссылка.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|						ТОГДА ""Да""
	|					КОГДА Ном.Ссылка.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	|						ТОГДА ""Нет""
	|					ИНАЧЕ ВЫБОР
	|							КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|								ТОГДА ""Да""
	|							КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	|								ТОГДА ""Нет""
	|							ИНАЧЕ ВЫБОР
	|									КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|										ТОГДА ""Да""
	|									КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	|										ТОГДА ""Нет""
	|									ИНАЧЕ ""Нет""
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ = ""Да""
	|	И Ном.ЖизненныйЦиклНоменклатуры = ЗНАЧЕНИЕ(перечисление.ЖизненныйЦиклНоменклатуры.Активна)
	|	И ВЫБОР КОГДА &ОстаткиЦО Тогда ИСТИНА ИНАЧЕ Ном.Родитель.ВидНоменклатуры = &ВидНоменклатуры КОНЕЦ 
	|
	|СГРУППИРОВАТЬ ПО
	|	Ном.Ссылка,
	|	ВложенныйЗапрос.НоменклатураСсылка.Родитель.Код,
	|	ШтрихКодыНоменклатуры.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтОстатки.Номенклатура КАК Номенклатура,
	|	ВтОстатки.Остаток КАК Остаток,
	|	ВтОстатки.ШтрихКод КАК ШтрихКод
	|ИЗ
	|	ВТОстатки КАК ВтОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НомСправочник
	|		ПО ВтОстатки.Номенклатура = НомСправочник.Ссылка
	|		%РегистрПереданныеОстатки%
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.b2b_ПереданныеОстатки КАК b2b_ПереданныеОстатки
	//|		ПО ВтОстатки.Номенклатура = b2b_ПереданныеОстатки.Номенклатура
	//|			И (b2b_ПереданныеОстатки.IDПользователяНаСайте = &IDПользователяНаСайте)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ТолькоИзменения
	|				ТОГДА b2b_ПереданныеОстатки.Номенклатура ЕСТЬ NULL
	|						ИЛИ ВтОстатки.Остаток <> b2b_ПереданныеОстатки.Остаток
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомСправочник.Наименование";
	
	Если НЕ ОстаткиЦО Тогда  
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%РегистрПереданныеОстатки%",
		"		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.b2b_ПереданныеОстатки КАК b2b_ПереданныеОстатки
		|		ПО ВтОстатки.Номенклатура = b2b_ПереданныеОстатки.Номенклатура
		|			И (b2b_ПереданныеОстатки.IDПользователяНаСайте = &IDПользователяНаСайте)"); 
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%РегистрПереданныеОстатки%",
		"ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.b2b_ПереданныеОстаткиЦО КАК b2b_ПереданныеОстатки
		|		ПО ВтОстатки.Номенклатура = b2b_ПереданныеОстатки.Номенклатура ") ;  				
	КонецЕсли;
	
	Склады = новый Массив;
	
	Если НЕ ОстаткиЦО Тогда
		
		НастройкиОтправкиОстатков = ПолучитьПараметрыМетодаВыгрузкиОстатковДистрибьютора(); 
		
		Если ТипЗнч(НастройкиОтправкиОстатков.СкладыОстатков)= тип("Массив") 
			И НастройкиОтправкиОстатков.СкладыОстатков.Количество() > 0 Тогда
			
			Для каждого СкладОстатков Из НастройкиОтправкиОстатков.СкладыОстатков Цикл
				
				Склады.Добавить(СкладОстатков); 
				
			КонецЦикла;		
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("IDПользователяНаСайте", НастройкиОтправкиОстатков.IDПользователяНаСайте);
		
	Иначе
		
		НастройкиОтправкиОстатков = ПолучитьПараметрыМетодаВыгрузкиОстатковОсновного(); 
		
		Если ТипЗнч(НастройкиОтправкиОстатков.СкладыОстатковЦО)= тип("Массив") 
			И НастройкиОтправкиОстатков.СкладыОстатковЦО.Количество() > 0 Тогда
			
			Для каждого СкладОстатков Из НастройкиОтправкиОстатков.СкладыОстатковЦО Цикл
				
				Склады.Добавить(СкладОстатков); 
				
			КонецЦикла;		
			
		КонецЕсли;
		
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТипОстатков",Перечисления.ТипыМинимальныхОстатков.РасчетОстатковb2b); 
	Запрос.УстановитьПараметр("склады", Склады);
	Запрос.УстановитьПараметр("Дата2",ТекущаяДата());
	Запрос.УстановитьПараметр("Дата1",ТекущаяДата()); 	
	Запрос.УстановитьПараметр("ТолькоИзменения",ТолькоИзменения); 
	Запрос.УстановитьПараметр("ОстаткиЦО",ОстаткиЦО);
	Запрос.УстановитьПараметр("ВидНоменклатуры", перечисления.ВидыНоменклаутры.Товар);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПотокМассивовТоваров = Новый Массив; 
	МассивТоваров = Новый Массив;
	
	Счетчик = 0;
	
	РазмерПакета = 1000;
	//
	//Если ОстаткиЦО  Тогда
	//	
	//	РазмерПакета = 1000; 	
	//Иначе 
	//	РазмерПакета = 1000; 
	//КонецЕсли;
	
	Пока Выборка.Следующий() Цикл 		
		
		Если Счетчик = РазмерПакета Тогда
			ПотокМассивовТоваров.Добавить(МассивТоваров); 
			МассивТоваров = Новый Массив;
			Счетчик = 0; 
		КонецЕсли;
		
		
		СтруктураДанных = Новый Структура("Номенклатура,Остаток,ШтрихКод"); 	
		ЗаполнитьЗначенияСвойств(СтруктураДанных,выборка); 
		
		МассивТоваров.Добавить(СтруктураДанных);
		
		Счетчик = Счетчик + 1; 
	КонецЦикла;
	
	Если Счетчик > 0 Тогда
		
		ПотокМассивовТоваров.Добавить(МассивТоваров);	
		
	КонецЕсли;
	
	Возврат ПотокМассивовТоваров; 
	
КонецФункции // ОстаткиДляОтправкиНаСайт()

Процедура ЗаписатьВДополнительныеРеквизитыПричинуОтмены(Знач Документ, ЗначениеРеквизита)

	МенеджерЗаписи = РегистрыСведений.РеквизитыДокументов.СоздатьМенеджерЗаписи(); 
	МенеджерЗаписи.Документ = Документ.ссылка; 
	МенеджерЗаписи.ИмяРеквизита  = "ПричинаОтменыЗаявки";
	МенеджерЗаписи.ЗначениеРеквизита = ЗначениеРеквизита; 
	Попытка
	
		МенеджерЗаписи.Записать();
	
	Исключение
	
	КонецПопытки;
	 

КонецПроцедуры

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьЗначениеРеквизитаПоДокументу(Знач Документ, ИмяРеквизита)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеквизитыДокументов.ЗначениеРеквизита КАК ЗначениеРеквизита
		|ИЗ
		|	РегистрСведений.РеквизитыДокументов КАК РеквизитыДокументов
		|ГДЕ
		|	РеквизитыДокументов.Документ = &Документ
		|	И РеквизитыДокументов.ИмяРеквизита = &ИмяРеквизита";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("ИмяРеквизита", ИмяРеквизита);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	
		Возврат ВыборкаДетальныеЗаписи.ЗначениеРеквизита; 	
	
	КонецЕсли;
	
	Возврат ""; 

КонецФункции // ПолучитьЗначениеРеквзитаПоДокументу()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ОтработатьОтгрузкуРНК(Знач РНК) Экспорт
	//заказ подтвержд. заявка 
	//РНК отгружен 
	//++Данилова Е.В. 10.10.2025 HELP-7411 
	Если НЕ(ТипЗнч(РНК) = Тип("ДокументСсылка.РасходнаяНакладная")
		ИЛИ  ТипЗнч(РНК) = Тип("ДокументОбъект.РасходнаяНакладная")) Тогда
		
	      
		Возврат; 	
	
	КонецЕсли;
	//--Данилова Е.В. 10.10.2025
	
	ЗаказКлиента = РНК.ДокОснование;
	
	Если ЗаказКлиента.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.ПодтвержденныйЗаказ 
		И РНК.Отгружен = Перечисления.Отгружен.Отгружен Тогда 		
		
		ЗаказОбъект = ЗаказКлиента.ПолучитьОбъект();
		Если ЗаказОбъект <> Неопределено 
			И НЕ ЗаказОбъект.ПометкаУдаления Тогда
			
			//Попытка
			//	ЗаказОбъект.Заблокировать();
			//Исключение
			//	Сообщить("Не удалось перевести состояние заказа в ""Выполнен"", объект заблокирован"); 
			//	Возврат;
			//КонецПопытки;
			ЗаказДозаказ = НайтиДоЗаказпоОсновному(ЗаказКлиента.ссылка);
			ОсновнойЗаказ = НайтиОсновнойЗаказпоДозаказу(ЗаказКлиента.ссылка); 
			РНКСущ = неопределено;
			
			МассивРНКЗаказа = СвязанныеРНКЗаказ(ЗаказКлиента);
			Если ЗаказДозаказ <> ЗаказКлиента.ссылка
				И ЗначениеЗаполнено(ЗаказДозаказ) Тогда 				 
			   РезультатСвязи = ПроверитьСвязьСРНК(ЗаказДозаказ,РНКСущ);
			   МассивРНК = СвязанныеРНКЗаказ(ЗаказДозаказ);
			   Для каждого ЭлементМассива  Из МассивРНК Цикл
				   
				   МассивРНКЗаказа.Добавить(ЭлементМассива); 
				   
			   КонецЦикла;
			ИначеЕсли ОсновнойЗаказ <> ЗаказКлиента.ссылка
				И ЗначениеЗаполнено(ОсновнойЗаказ) Тогда	
			    РезультатСвязи = ПроверитьСвязьСРНК(ОсновнойЗаказ,РНКСущ);
				МассивРНК = СвязанныеРНКЗаказ(ОсновнойЗаказ);
				Для каждого ЭлементМассива  Из МассивРНК Цикл
					
					МассивРНКЗаказа.Добавить(ЭлементМассива); 
					
				КонецЦикла;
			КонецЕсли;
			СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.Выполнен; 
			//Если ЗначениеЗаполнено(РНКСущ)
			//	И РНКСущ.Отгружен <> Перечисления.Отгружен.Отгружен Тогда
			//
			//	СостояниеНакладной  = Перечисления.СостоянияЗаказаКонтрагента.ВыполненЧастично; 
			//
			//КонецЕсли;
			Если МассивРНКЗаказа.Количество() > 0  Тогда
				ВыполненПолностью = Истина; 
				
				Для каждого РНКИзМассива Из  МассивРНКЗаказа Цикл
					
					Если РНКИзМассива.Отгружен <> Перечисления.Отгружен.Отгружен Тогда
						
						ВыполненПолностью = Ложь; 
						
					КонецЕсли;
					
				КонецЦикла;
				Если НЕ ВыполненПолностью Тогда
				
					СостояниеНакладной  = Перечисления.СостоянияЗаказаКонтрагента.ВыполненЧастично;	
				
				КонецЕсли;
				
				
			КонецЕсли;
			
			ЗаказДляРедактирования = неопределено; 
			Если СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.Выполнен
				И ЗначениеЗаполнено(ЗаказДозаказ) 
				И (ЗаказДозаказ.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.ВыполненЧастично
				ИЛИ РНКСущ = РНК) Тогда
			
				ЗаказДляРедактирования = ЗаказДозаказ.ПолучитьОбъект();
				ЗаказДляРедактирования.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.Выполнен; 
			ИначеЕсли СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.Выполнен
				И ЗначениеЗаполнено(ОсновнойЗаказ) 
				И (ОсновнойЗаказ.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.ВыполненЧастично
				ИЛИ РНКСущ = РНК) Тогда
				ЗаказДляРедактирования = ОсновнойЗаказ.ПолучитьОбъект();
				ЗаказДляРедактирования.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.Выполнен;
			КонецЕсли;
			ЗаказОбъект.СостояниеНакладной = СостояниеНакладной; 
			
			УстановитьПривилегированныйРежим(Истина);
			Попытка
				ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
				//ЗаказОбъект.Разблокировать();
				
				Если ЗаказДляРедактирования <> неопределено Тогда
				
					ЗаказДляРедактирования.Записать(РежимЗаписиДокумента.Проведение); 	
				
				КонецЕсли;
			Исключение
				Сообщить("Не удалось перевести состояние заказа в ""Выполнен"", объект заблокирован ошибка записи"); 
				Сообщить(ОписаниеОшибки()); 
			КонецПопытки;
			УстановитьПривилегированныйРежим(Ложь);  			
			
		КонецЕсли;
		
		
	КонецЕсли;
	
	
	
КонецПроцедуры // ОтработатьОтгрузкуРНК()
// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Функция ВывестиТекстОшибкиПоследний(Знач Заказ) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(b2b_ЗапросыНаОбновлениеИсторияСрезПоследних.Период) КАК Период
		|ПОМЕСТИТЬ ВТМаксимальныйПериод
		|ИЗ
		|	РегистрСведений.b2b_ЗапросыНаОбновлениеИстория.СрезПоследних(, Документ = &Заказ) КАК b2b_ЗапросыНаОбновлениеИсторияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	b2b_ЗапросыНаОбновлениеИсторияСрезПоследних.ТекстОшибки КАК ТекстОшибки
		|ИЗ
		|	РегистрСведений.b2b_ЗапросыНаОбновлениеИстория.СрезПоследних(, Документ = &Заказ) КАК b2b_ЗапросыНаОбновлениеИсторияСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМаксимальныйПериод КАК ВТМаксимальныйПериод
		|		ПО b2b_ЗапросыНаОбновлениеИсторияСрезПоследних.Период = ВТМаксимальныйПериод.Период";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	
		Возврат ВыборкаДетальныеЗаписи.ТекстОшибки; 
	
	КонецЕсли;
	
	Возврат ""; 

КонецФункции // ВывестиТекстОшибкиПоследний()


Функция ПолучитьДатуОплаты_b2b(ДатаОтгрузки,ОтсрочкаПлатежа)  Экспорт
	Если   НЕ ЗначениеЗаполнено(ДатаОтгрузки) Тогда
		Возврат   Дата(1,1,1); 
	Иначе
		Если  ОтсрочкаПлатежа.ВидОтсрочки = Перечисления.ВидыОтсрочки.БанковскиеДни Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	КалендарьДни.Дата КАК Дата
			|ИЗ
			|	Справочник.Календарь.Дни КАК КалендарьДни
			|ГДЕ
			|	КалендарьДни.Дата >= &ДатаОтгрузки
			|	И КалендарьДни.Часы <> 0
			|	И (НЕ КалендарьДни.Ссылка.ПометкаУдаления)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата
			|АВТОУПОРЯДОЧИВАНИЕ";
			Запрос.УстановитьПараметр("ДатаОтгрузки",ДатаОтгрузки);
			Выборка = Запрос.Выполнить().Выбрать();
			НПП = 0;
			Пока Выборка.Следующий() Цикл
				
				Если НПП = ОтсрочкаПлатежа.Отсрочка Тогда
					Возврат Выборка.Дата;	
				Конецесли;
				НПП = НПП + 1;
			КонецЦикла;
			
			Возврат ДатаОтгрузки+ОтсрочкаПлатежа.Отсрочка*24*60*60;		
		Иначе		
			Возврат ДатаОтгрузки+ОтсрочкаПлатежа.Отсрочка*24*60*60;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Процедура ПометитьНаУдалениеРНКОтправкаЗапросаНаПортал(Знач Заказ)
	
	//Перем МетодДоставки, ОсновнойЗаказ, ПараметрыНаОтправку, Сообщения, ТипЗапроса, ЭтоДозаказ;
	
	МетодДоставки = b2b_ОбменЗаявками.МетодДоставкиПоЗаказу(Заказ);
	
	ЭтоДозаказ = Ложь;
	ОсновнойЗаказ = НайтиОсновнойЗаказпоДозаказу(Заказ); 
	Если ЗначениеЗаполнено(ОсновнойЗаказ) Тогда
		ЭтоДозаказ = Истина; 
	КонецЕсли;
	
	
	ПараметрыНаОтправку = Новый Структура;
	ПараметрыНаОтправку.Вставить("НомерЗаявки",Заказ.НомерЗаказа);
	
	Если МетодДоставки = "F"  и НЕ ЭтоДозаказ Тогда
		
		ТипЗапроса = "ОтправитьДатуОтгрузкиВместе";
		
		ПараметрыНаОтправку.Вставить("ДатаОтгрузкиЗаказа",Заказ.ДатаОтгрузки);
		
	КонецЕсли;
	
	Если МетодДоставки = "F"  и ЭтоДозаказ Тогда
		
		ТипЗапроса = "ОтправитьДатуОтгрузкиВместе";
		
		ОсновнойЗаказ = НайтиОсновнойЗаказпоДозаказу(Заказ); 
		
		ПараметрыНаОтправку.Вставить("ДатаОтгрузкиЗаказа","");
		
	КонецЕсли;
	
	Если МетодДоставки = "P"  Тогда
		
		ТипЗапроса = "ОтправитьДатуОтгрузкиОтдельно";
		
		Если ЭтоДозаказ  Тогда
			
			ПараметрыНаОтправку.Вставить("ДатаОтгрузкиДозаказа","");
			
		Иначе 
			
			ПараметрыНаОтправку.Вставить("ДатаОтгрузкиЗаказа","");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Сообщения = Новый Массив; 
	b2b_ОбменЗаявками.ЗаписатьВОчередьНаОтправку(Заказ,ТипЗапроса,ПараметрыНаОтправку,Сообщения);

КонецПроцедуры // ПометитьНаУдалениеРНК()

Процедура СформироватьВнутреннееУведомлениеОбОшибке(ТекстПисьма,ТемаПисьма,Основание)  Экспорт

	СписокПолучателей = Новый СписокЗначений; 	
	//СписокПолучателей.Добавить("okdesk@collant.ru");
	СписокПолучателей.Добавить("ratmanov@collant.ru");
	СписокПолучателей.Добавить("danilovaev@collant.ru"); 
	
	СформироватьВнутреннееУведомление(СписокПолучателей, ТекстПисьма, ТемаПисьма,Основание,,); 

КонецПроцедуры

Функция ПолучитьСтавкуНДС_(Номенклатура) Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ВЫБОР
	             |		КОГДА Номенклатура.СтавкаНДС <> &ПустаяСтавка
	             |			ТОГДА Номенклатура.СтавкаНДС
	             |		КОГДА Номенклатура.Родитель.СтавкаНДС <> &ПустаяСтавка
	             |			ТОГДА Номенклатура.Родитель.СтавкаНДС
	             |		КОГДА Номенклатура.Родитель.Родитель.СтавкаНДС <> &ПустаяСтавка
	             |			ТОГДА Номенклатура.Родитель.Родитель.СтавкаНДС
	             |		КОГДА Номенклатура.Родитель.Родитель.Родитель.СтавкаНДС <> &ПустаяСтавка
	             |			ТОГДА Номенклатура.Родитель.Родитель.Родитель.СтавкаНДС
	             |		КОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.СтавкаНДС <> &ПустаяСтавка
	             |			ТОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.СтавкаНДС
	             |		ИНАЧЕ &ПустаяСтавка
	             |	КОНЕЦ КАК СтавкаНДС
	             |ИЗ
	             |	Справочник.Номенклатура КАК Номенклатура
	             |ГДЕ
	             |	Номенклатура.Ссылка = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ПустаяСтавка",Перечисления.СтавкиНДС.ПустаяСсылка());
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СтавкаНДС		
	Иначе
		Возврат Перечисления.СтавкиНДС.ПустаяСсылка();		
	КонецЕсли;
КонецФункции


#КонецОбласти

#Область Скидки 
//++Данилова Е.В. 22.04.2025  WEB-3452

Функция ЗагрузитьУчастиеВСкидкахb2bПоКонтрагенту(Тело)  Экспорт 
	
	ЗаписатьВЛог("b2b skidki","Загрузка скидок. начало "+ТекущаяДата(),,,);
	
	
	ИмяФайла = ""+Год(ТекущаяДата())+"_"+месяц(ТекущаяДата())+"_"+День(ТекущаяДата())+"_"+Час(ТекущаяДата())+"_"+минута(ТекущаяДата());
	ИмяФайлаОбмена =  "\\srvfiles\b2b_files\sale-new_b2b\"+ИмяФайла+".txt";
	
	Дописывать    = Истина;
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайлаОбмена, КодировкаТекста.UTF8, , Дописывать);
	ТекстСообщений     = ""+Тело;
	ЗаписьТекста.ЗаписатьСтроку(ТекстСообщений);
	ЗаписьТекста.Закрыть();
	
	//--------------------------------------------------------
	СтрДата = Новый Структура;	
	
	СтруктураОтвета=новый Структура();
	СтруктураОтвета.Вставить("result","OK");
	СтруктураОтвета.Вставить("message","OK");
	
	СтруктураОтвета.Вставить("data",СтрДата);
	
	Если не ЗначениеЗаполнено(Тело) тогда      
		
		ЗаписатьВЛог("b2b skidki","Ошибка загрузка скидок. Не заполнено тело запроса"+Тело,,,);
		
		СтруктураОтвета.Вставить("result","ERROR");
		СтруктураОтвета.Вставить("message","Ошибка чтения данных с сайта");
		
		ОшибкаОбработки = Истина;
		
		записьJSON = ОтработатьЗаполненнуюСтруктуруОтвета(СтруктураОтвета); 
				
		возврат  записьJSON;   
		
		
	иначе  		
		
		ОшибкаОбработки = ложь;
		ЕстьИзменения = ложь;
		контрагентнайден = ложь; 	
				
		ЧтениеJSON0 = Новый ЧтениеJSON;
		ЧтениеJSON0.УстановитьСтроку(Тело);
		СодержаниеТ = ПрочитатьJSON(ЧтениеJSON0);
		
		СкидкаНомерДок = СтрЗаменить(СодержаниеТ.data.sale,"sk_","");
		Если СтрДЛина(СкидкаНомерДок) <> 9 Тогда
			
			СтруктураОтвета.Вставить("result","ERROR");
			СтруктураОтвета.Вставить("message","Не верный номер документа скидок.");
			
			записьJSON = ОтработатьЗаполненнуюСтруктуруОтвета(СтруктураОтвета);
			
			Возврат записьJSON; 
			
		конецЕсли;
		
				//
		СкидкаКодКонтрагента = СодержаниеТ.data.user;  // интегральный код
		//
		//++Данилова Е.В. 15.09.2025 HELP-7034 
		//Док = документы.УстановкаСкидокПоКонтрагентам.НайтиПоНомеру(СкидкаНомерДок,НачалоГода(ТекущаяДата()));
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаСкидокПоКонтрагентам.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.УстановкаСкидокПоКонтрагентам КАК УстановкаСкидокПоКонтрагентам
		|ГДЕ
		|	УстановкаСкидокПоКонтрагентам.Номер = &Номер
		|	И УстановкаСкидокПоКонтрагентам.Проведен
		|	//И УстановкаСкидокПоКонтрагентам.Дата >= &Дата";
		
		Запрос.УстановитьПараметр("Номер", СкидкаНомерДок);
		//Запрос.УстановитьПараметр("Дата", НачалоГода(ТекущаяДата()));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			Док = ВыборкаДетальныеЗаписи.ссылка; 
		Иначе 
			Док = Документы.УстановкаСкидокПоКонтрагентам.ПустаяСсылка(); 
			
		КонецЕсли;
		//--Данилова Е.В. 15.09.2025
		//
		Если НЕ док.Пустая() Тогда   		
			
			
			Запрос = новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |	УстановкаСкидокПоКонтрагентамКонтрагенты.Контрагент КАК Контрагент,
			               |	УстановкаСкидокПоКонтрагентамКонтрагенты.Согласован КАК Согласован
			               |ИЗ
			               |	Документ.УстановкаСкидокПоКонтрагентам.Контрагенты КАК УстановкаСкидокПоКонтрагентамКонтрагенты
			               |ГДЕ
			               |	УстановкаСкидокПоКонтрагентамКонтрагенты.Контрагент.Ведущий.Код = &Код
			               |	И УстановкаСкидокПоКонтрагентамКонтрагенты.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка",Док);
			Запрос.УстановитьПараметр("Код",СкидкаКодКонтрагента);
			
			ВыборкаКонтрагенты=запрос.Выполнить().Выбрать();
			
			Если ВыборкаКонтрагенты.Следующий() Тогда 				
				контрагентнайден = Истина;
				Если НЕ ВыборкаКонтрагенты.Согласован Тогда
				
					ЕстьИзменения = Истина; 	
				
				КонецЕсли;
			КонецЕсли;
			
			Если ЕстьИзменения Тогда
				
				РезультатЗаписи = ЗаписатьВРегистрУстановкаСкидок(СодержаниеТ);
				Если  Не РезультатЗаписи Тогда
					
					СтруктураОтвета.Вставить("result","ERROR");
					СтруктураОтвета.Вставить("message","Не удалось записать данные по скидкам для отработки");
					
					ЗаписьJSON = ОтработатьЗаполненнуюСтруктуруОтвета(СтруктураОтвета);
					Возврат записьJSON; 
					
				КонецЕсли;	
				
			КонецЕсли;
			
			

		иначе
			
			ЗаписатьВЛог("b2b skidki","Ошибка загрузка скидок.  Контрагент - "+СкидкаКодКонтрагента+" скидка -"+СкидкаНомерДок +ОписаниеОшибки(),,,);
			
			СтруктураОтвета.Вставить("result","ERROR");
			СтруктураОтвета.Вставить("message","В 1с не найден документ скидок.");
			
						
			#Если клиент  тогда
				сообщить("Ошибка загрузка скидок.  Контрагент - "+СкидкаКодКонтрагента+" скидка -"+СкидкаНомерДок +ОписаниеОшибки());
			#КонецЕсли 
			
			записьJSON = ОтработатьЗаполненнуюСтруктуруОтвета(СтруктураОтвета);
			Возврат записьJSON;
		КонецЕсли;	
		
		//КонецЕсли;  	
		
		Если НЕ ЕстьИзменения и  контрагентНайден ТОгда
			СтруктураОтвета.Вставить("result","OK");
			СтруктураОтвета.Вставить("message","В 1с скидка по этому контрагенту уже установлена");
			
		КонецЕсли;	
		//
		Если НЕ ЕстьИзменения и НЕ контрагентНайден Тогда
			
			ЗаписатьВЛог("b2b skidki","Ошибка загрузка скидок.  Контрагент - "+СкидкаКодКонтрагента+" скидка -"+СкидкаНомерДок +ОписаниеОшибки(),,,);
			
			#Если клиент  тогда
				сообщить("Ошибка загрузка скидок.  Контрагент - "+СкидкаКодКонтрагента+" скидка -"+СкидкаНомерДок +ОписаниеОшибки());
			#КонецЕсли     
			
			СтруктураОтвета.Вставить("result","ERROR");
			СтруктураОтвета.Вставить("message","Не найден контрагент в документе скидок. код контрагента - "+СкидкаКодКонтрагента);
			
			записьJSON = ОтработатьЗаполненнуюСтруктуруОтвета(СтруктураОтвета);
			Возврат записьJSON;
			
		конецЕсли;	
		
		
		//**************************************************************************
				
		ЗаписатьВЛог("b2b skidki","1Загрузка скидок конец. Контрагент - "+СкидкаКодКонтрагента+" скидка -"+СкидкаНомерДок+" "+ТекущаяДата(),,,);
		
			
		записьJSON = ОтработатьЗаполненнуюСтруктуруОтвета(СтруктураОтвета);
		Возврат записьJSON;
		
	КонецЕсли;
	
	ЗаписатьВЛог("b2b skidki","2Загрузка скидок конец. Контрагент - "+СкидкаКодКонтрагента+" скидка -"+СкидкаНомерДок+" "+ТекущаяДата(),,,);
	
	
	
КонецФункции

Функция ЗаписатьВРегистрУстановкаСкидок(СтруктураЗапроса)

	МенеджерЗаписи = РегистрыСведений.b2b_УстановкаСкидокЗапросы.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор);
	МенеджерЗаписи.Период = ТекущаяДатаСеанса(); 
	МенеджерЗаписи.Данные = Новый ХранилищеЗначения(СтруктураЗапроса,Новый СжатиеДанных(9));
	Попытка
		МенеджерЗаписи.Записать();
	Исключение
		Возврат ложь; 
	КонецПопытки;
	
	Возврат истина; 
КонецФункции // ЗаписатьВРегистрУстановкаСкидок()

Функция ЗаписатьВРегистрУстановкаСкидокРезультатОтработки(ИдентификаторЗапроса,Отработан = ложь, ТекстОшибки = "")

	НаборЗаписей = РегистрыСведений.b2b_УстановкаСкидокЗапросы.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.ИдентификаторЗапроса.Установить(ИдентификаторЗапроса);
	НаборЗаписей.Прочитать();
	
	Для каждого  ЗаписьНабора Из НаборЗаписей Цикл
		
		ЗаписьНабора.Отработан = Отработан;
		ЗаписьНабора.ТекстОшибки = ТекстОшибки; 	
		
	КонецЦикла;

	Попытка
		НаборЗаписей.Записать();
	Исключение
		Возврат ложь; 
	КонецПопытки;
	
	Возврат истина; 
КонецФункции

Функция ОтработатьЗагруженныеДанныеПоУстановкеСкидокКонтрагентов()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	b2b_УстановкаСкидокЗапросыСрезПоследних.Данные КАК Данные,
		|	b2b_УстановкаСкидокЗапросыСрезПоследних.ИдентификаторЗапроса КАК ИдентификаторЗапроса
		|ИЗ
		|	РегистрСведений.b2b_УстановкаСкидокЗапросы.СрезПоследних(, ) КАК b2b_УстановкаСкидокЗапросыСрезПоследних
		|ГДЕ
		|	НЕ b2b_УстановкаСкидокЗапросыСрезПоследних.Отработан";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураОтвета = ВыборкаДетальныеЗаписи.Данные.Получить(); 
		
		Если ТипЗнч(СтруктураОтвета) = Тип("Структура") Тогда
			
			ОтработатьСогласованПоУстановкеСкидок(СтруктураОтвета,ВыборкаДетальныеЗаписи.ИдентификаторЗапроса); 
		Иначе 
			ЗаписатьВРегистрУстановкаСкидокРезультатОтработки(ВыборкаДетальныеЗаписи.ИдентификаторЗапроса,ЛОЖЬ,"Неверная структура ответа!!!!");
		КонецЕсли;
	КонецЦикла;
	
	


КонецФункции // ОтработатьДанныеПоСкидкам() 

Функция ОтработатьСогласованПоУстановкеСкидок(СтруктураОтвета,ИдентификаторЗапроса) 		
	
	СкидкаНомерДок 			= СтрЗаменить(СтруктураОтвета.data.sale,"sk_","");
	СкидкаКодКонтрагента 	= СтруктураОтвета.data.user;  // интегральный код
	//
	Док = документы.УстановкаСкидокПоКонтрагентам.НайтиПоНомеру(СкидкаНомерДок,НачалоГода(ТекущаяДата()));
	
	Если Не ЗначениеЗаполнено(Док) Тогда
		
		ЗаписатьВРегистрУстановкаСкидокРезультатОтработки(ИдентификаторЗапроса,ЛОЖЬ,"Не найден документ по номеру документа" + СкидкаНомерДок); 
		
		Возврат ЛОЖЬ; 	
	
	КонецЕсли;
	
	ДокОб = Док.ПолучитьОбъект();
	
	ЕстьИзменения 		= ложь;
	Контрагентнайден 	= ложь;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УстановкаСкидокПоКонтрагентамКонтрагенты.Контрагент КАК Контрагент,
	|	УстановкаСкидокПоКонтрагентамКонтрагенты.НомерСтроки КАК НомерСтроки,
	|	УстановкаСкидокПоКонтрагентамКонтрагенты.Контрагент.Наименование КАК КонтрагентНаименование
	|ИЗ
	|	Документ.УстановкаСкидокПоКонтрагентам.Контрагенты КАК УстановкаСкидокПоКонтрагентамКонтрагенты
	|ГДЕ
	|	УстановкаСкидокПоКонтрагентамКонтрагенты.Контрагент.Ведущий.Код = &Код
	|	И УстановкаСкидокПоКонтрагентамКонтрагенты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Док);
	Запрос.УстановитьПараметр("Код",СкидкаКодКонтрагента);
	
	ВыборкаКонтрагенты=запрос.Выполнить().Выбрать();
	Пока ВыборкаКонтрагенты.Следующий() Цикл
		
		КонтрагентНайден = истина;
		
		ТекСтрока = ДокОб.Контрагенты.Получить(ВыборкаКонтрагенты.НомерСтроки-1);
		
		Если не ТекСтрока.Согласован Тогда
			ТекСтрока.Согласован = Истина;
		КонецЕсли;
		
		
		ТекСтрока.Согласован = Истина;
		ЕстьИзменения = истина;
		
		//ЗаписатьВЛог("b2b skidki","Загрузка скидок. Контрагент - "+ВыборкаКонтрагенты.КонтрагентНаименование+" Ведущий -"+СкидкаКодКонтрагента+" скидка -"+СкидкаНомерДок,,,);
					
	КонецЦикла;	
	
	ОшибкаОбработки = Ложь; 
	
	Если ЕстьИзменения Тогда
		попытка
			
			если ДокОб.модифицированность() тогда 
				
				Если  ДокОб.Проведен тогда
					ДокОб.Записать(РежимЗаписиДокумента.Проведение);
				иначе
					ДокОб.Записать(РежимЗаписиДокумента.запись);
				конецЕсли;
				
			КонецЕсли; 
			
			ЗаписатьВРегистрУстановкаСкидокРезультатОтработки(ИдентификаторЗапроса,Истина); 
			
		исключение 
			
			
			ЗаписатьВРегистрУстановкаСкидокРезультатОтработки(ИдентификаторЗапроса,Ложь,"Ошибка загрузка скидок.  Контрагент - "+СкидкаКодКонтрагента+" скидка -"+СкидкаНомерДок +ОписаниеОшибки());
							
			
			ОшибкаОбработки = Истина;
		конецпопытки;
		
		
	КонецЕсли;
	
	Возврат НЕ ОшибкаОбработки; 
	
	
КонецФункции // ()

Процедура b2b_ОтработатьДанныеПоУчастиюВСкидках(Ключ) Экспорт
	ОтработатьЗагруженныеДанныеПоУстановкеСкидокКонтрагентов(); 
КонецПроцедуры



//--Данилова Е.В. 22.04.2025

#КонецОбласти 
#Область Маркировка 

Функция ПолучитьСоответствиеТоварТребМаркировка(Знач Заказ, Товары)	Экспорт
	
	СтруктураДанныхНакладной = Новый  Структура("Номенклатура,ПунктДоставки,Договор,Дата,Контрагент,ПостояннаяАкция,Товары"); 
	ЗаполнитьЗначенияСвойств(СтруктураДанныхНакладной,Заказ); 
	СтруктураДанныхНакладной.ПостояннаяАкция 	= Ложь; 
	СтруктураДанныхНакладной.Номенклатура 		= Товары.ВыгрузитьКолонку("Номенклатура");
	СтруктураДанныхНакладной.Товары = Товары; 
	
	ДатаПроверки = ?(ЗначениеЗаполнено(Заказ.ДатаОтгрузки),Заказ.ДатаОтгрузки,Заказ.Дата);
	
	ТаблицаПереопределяемыхДат = МаркировкаКС.ПодготовитьТаблицуСПереопределяемойДатойНачалаРаботыСМаркировкой(СтруктураДанныхНакладной,"Товары");
	
	Если ТаблицаПереопределяемыхДат <> Неопределено 
		И  ТаблицаПереопределяемыхДат.количество()>0 тогда
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТЗ.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ТЗ.ДатаНачалаРаботыСМаркировкой КАК ДатаНачалаРаботыСМаркировкой
		|ПОМЕСТИТЬ ВремТЗ
		|ИЗ
		|	&ТаблицаПереопределяемыхДат КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗ.Номенклатура КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТЗ.ДатаНачалаРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
		|				И ЕСТЬNULL(ТЗ.ДатаНачалаРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1)) < &ДатаПроверки
		|			ТОГДА ИСТИНА
		|		КОГДА ТЗ.Номенклатура.ОтгрузкаТолькоЧерезЧЗ
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ТребуетсяМаркировка
		|ИЗ
		|	ВремТЗ КАК ТЗ";
		запрос.УстановитьПараметр("ДатаПроверки",ДатаПроверки);
		запрос.УстановитьПараметр("ТаблицаПереопределяемыхДат",ТаблицаПереопределяемыхДат); 
		
		
	иначе
		
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
		|				И ЕСТЬNULL(Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1)) < &ДатаПроверки
		|			ТОГДА ИСТИНА
		|		КОГДА Номенклатура.ОтгрузкаТолькоЧерезЧЗ
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ТребуетсяМаркировка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&СписокНоменклатуры)";
		запрос.УстановитьПараметр("ДатаПроверки",ДатаПроверки);
		Запрос.УстановитьПараметр("СписокНоменклатуры",СтруктураДанныхНакладной.Номенклатура);
		
	КонецЕсли; 
	
	КэшПризнакаМаркировки = Новый Соответствие; 
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		КэшПризнакаМаркировки.Вставить(Выборка.Ссылка,Выборка.ТребуетсяМаркировка);	
	КонецЦикла;
	
	Возврат КэшПризнакаМаркировки; 
КонецФункции


	
#КонецОбласти  

#Область ФоновыеЗаданияЗаказ

Процедура ОтправитьНаСогласованиеКлиентуВФоне(Знач Заказ, Знач ВерсияСтарая) Экспорт 
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Заказ);
	МассивПараметров.Добавить(ВерсияСтарая); 
	
	ИдентификаторФЗ = Новый УникальныйИдентификатор; 
	ФЗ = ФоновыеЗадания.Выполнить("b2b_ОбменЗаявками.ОтправитьНаСогласованиеКлиентуВФонеПослеПроверки",МассивПараметров,ИдентификаторФЗ,"ОтправитьНаСогласованиеКлиентуВФонеПослеПроверки"); 
	
КонецПроцедуры 

Процедура ОтправитьНаСогласованиеКлиентуВФонеПослеПроверки(Знач Заказ, Знач ВерсияСтарая) Экспорт 
   	
	ДокЗаписан = Ложь; 
	b2b_ОбменДаннымиПоAPI.ПроверкаВерсииДокументаПриЗаписи(ВерсияСтарая,Заказ,ДокЗаписан);
	
	Если НЕ ДокЗаписан Тогда
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Ошибка выполнения в фоне отправки по апи b2b согласования с клиентом заявки"), 
		УровеньЖурналаРегистрации.Ошибка, 
		, 
		, 
		НСтр("ru = 'Ошибка в ""ОтправитьНаСогласованиеКлиентуВФоне"".'"));
		
		Возврат; 	
	КонецЕсли;
	
	
	МассивТоваров = ДобавитьВМассивТоварыЗаказа(Заказ);
	
	Если МассивТоваров.Количество() = 0  Тогда
	
		ЗаписатьВЛог("b2b","Не найдены товары для отправки на согласование клиенту" + Строка(Заказ),"Информация"); 
		
		Возврат; 
	
	КонецЕсли; 	
	
	ПараметрыДляОтправки = Новый Структура; 
	ПараметрыДляОтправки.Вставить("НомерЗаявки",Заказ.НомерЗаказа);
	ПараметрыДляОтправки.Вставить("IDЗаявки",Заказ.ИдЗаказа);
	ПараметрыДляОтправки.Вставить("СтатусЗаказа","ZA");	
	ПараметрыДляОтправки.Вставить("Товары",МассивТоваров); 
	ПараметрыДляОтправки.Вставить("Дозаказ",Документы.Заказ.ПустаяСсылка()); 
	ПараметрыДляОтправки.Вставить("Подразделение",Справочники.Подразделения.НайтиПоКоду("SSP-0118"));
	ПараметрыДляОтправки.Вставить("ИзФормыЗаказа",истина); 
	
	МассивСообщений = Новый Массив; 
		
	МассивПараметров = Новый Массив; 
	МассивПараметров.Добавить(Заказ);
	МассивПараметров.Добавить("ОтправитьклиентуТолькоВНаличии"); 
	МассивПараметров.Добавить(ПараметрыДляОтправки); 
	МассивПараметров.Добавить(МассивСообщений); 
	
	ИдентификаторФЗ = Новый УникальныйИдентификатор; 
	ФЗ = ФоновыеЗадания.Выполнить("b2b_ОбменЗаявками.ЗаписатьВОчередьНаОтправку",МассивПараметров,ИдентификаторФЗ,"ЗаписатьВОчередьНаОтправкуОтправитьНАСогласованиеКлиенту"); 

КонецПроцедуры

Функция ДобавитьВМассивТоварыЗаказа(Знач Заказ)
	МассивДанных = Новый Массив; 
	Для каждого СтрокаДанных Из Заказ.Товары Цикл
		
		СтруктураТовара = Новый Структура; 
		СтруктураТовара.Вставить("IDТовара",ПолучитьКодТовараДляПортала(СтрокаДанных.Номенклатура));
		СтруктураТовара.Вставить("Количество",СтрокаДанных.Количество);
		СтруктураТовара.Вставить("Цена",СтрокаДанных.Цена);
		
		МассивДанных.Добавить(СтруктураТовара); 
		
	КонецЦикла;
	
	Возврат МассивДанных; 

КонецФункции

Процедура ПодтвердитьЗаКлиентаВФоне(Знач Заказ, Знач ВерсияСтарая) Экспорт  
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Заказ);
	МассивПараметров.Добавить(ВерсияСтарая);
	
	ИдентификаторФЗ = Новый УникальныйИдентификатор; 
	ФЗ = ФоновыеЗадания.Выполнить("b2b_ОбменЗаявками.ПодтвердитьЗаКлиентаВФонеПослеПроверки",МассивПараметров,ИдентификаторФЗ,"ПодтвердитьЗаКлиентаВФонеПослеПроверки"); 
	
КонецПроцедуры

Процедура ПодтвердитьЗаКлиентаВФонеПослеПроверки(Знач Заказ, Знач ВерсияСтарая) Экспорт  
	
	ДокЗаписан = Ложь; 
	b2b_ОбменДаннымиПоAPI.ПроверкаВерсииДокументаПриЗаписи(ВерсияСтарая,Заказ,ДокЗаписан);
	
	Если НЕ ДокЗаписан Тогда
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Ошибка выполнения в фоне отправки по апи b2b подтверждения за клиента заявки"), 
		УровеньЖурналаРегистрации.Ошибка, 
		, 
		, 
		НСтр("ru = 'Ошибка в ""ПодтвердитьЗаКлиентаВФоне"".'"));
		
		Возврат; 	
	КонецЕсли;
	
	ПараметрыДляОтправки = Новый Структура;
	ПараметрыДляОтправки.Вставить("НомерЗаявки",Заказ.НомерЗаказа);
	ПараметрыДляОтправки.Вставить("МетодДоставки","F");
	ПараметрыДляОтправки.Вставить("Подразделение",Справочники.Подразделения.НайтиПоКоду("SSP-0118"));
	ПараметрыДляОтправки.Вставить("ИзФормыЗаказа",истина);
			
	МассивСообщений = Новый Массив;
	
	МассивПараметров = Новый Массив; 
	МассивПараметров.Добавить(Заказ);
	МассивПараметров.Добавить("ПодтвердитьЗаКлиентаПолностью"); 
	МассивПараметров.Добавить(ПараметрыДляОтправки); 
	МассивПараметров.Добавить(МассивСообщений);
	
	
	ИдентификаторФЗ = Новый УникальныйИдентификатор; 
	ФЗ = ФоновыеЗадания.Выполнить("b2b_ОбменЗаявками.ЗаписатьВОчередьНаОтправку",МассивПараметров,ИдентификаторФЗ,"ЗаписатьВОчередьНаОтправкуПодтвердитьЗаКлиентаПолностью"); 
    
КонецПроцедуры


Функция ДополнительныйРеквизитЗаказа(Знач Заказ,ИмяРеквизита) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	b2b_ЗаявкиКлиентовСрезПоследних.%ИмяРеквизита% КАК %ИмяРеквизита%
		|ИЗ
		|	РегистрСведений.b2b_ЗаявкиКлиентов КАК b2b_ЗаявкиКлиентовСрезПоследних
		|ГДЕ
		|	b2b_ЗаявкиКлиентовСрезПоследних.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ИмяРеквизита%",ИмяРеквизита); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	
		Возврат ВыборкаДетальныеЗаписи[ИмяРеквизита]; 	
	
	КонецЕсли;
	
	Возврат неопределено; 


КонецФункции

//отмена заявки 
Процедура ОтменитьЗаявкуВФоне(Знач Заказ, Знач ПричинаОтмены, Знач ВерсияСтарая) экспорт
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Заказ);
	МассивПараметров.Добавить(ПричинаОтмены);
	МассивПараметров.Добавить(ВерсияСтарая);
	
	ИдентификаторФЗ = Новый УникальныйИдентификатор; 
	ФЗ = ФоновыеЗадания.Выполнить("b2b_ОбменЗаявками.ОтменитьЗаявкуВФонеПослеПроверки",МассивПараметров,ИдентификаторФЗ,"ОтменитьЗаявкуВФонеПослеПроверки"); 
	
КонецПроцедуры 

Процедура ОтменитьЗаявкуВФонеПослеПроверки(Знач Заказ, Знач ПричинаОтмены, Знач ВерсияСтарая) экспорт
	
	ДокЗаписан = Ложь; 
	b2b_ОбменДаннымиПоAPI.ПроверкаВерсииДокументаПриЗаписи(ВерсияСтарая,Заказ,ДокЗаписан);
	
	Если НЕ ДокЗаписан Тогда
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Ошибка выполнения в фоне отправки по апи b2b отмены заявки"), 
		УровеньЖурналаРегистрации.Ошибка, 
		, 
		, 
		НСтр("ru = 'Ошибка в ""ОтменитьЗаявкуВФоне"".'"));
		
		Возврат; 	
	КонецЕсли;

	
	ПараметрыДляОтправки = Новый Структура; 
	ПараметрыДляОтправки.Вставить("НомерЗаявки",Заказ.НомерЗаказа);
	ПараметрыДляОтправки.Вставить("IDЗаявки",заказ.ИдЗаказа);
	ПараметрыДляОтправки.Вставить("СтатусЗаказа","ZD");
	ПараметрыДляОтправки.Вставить("КомментарийОтмены",Строка(ПричинаОтмены));	
	ПараметрыДляОтправки.Вставить("Дозаказ",Документы.Заказ.ПустаяСсылка());
	ПараметрыДляОтправки.Вставить("Подразделение",Справочники.Подразделения.НайтиПоКоду("SSP-0118"));
	ПараметрыДляОтправки.Вставить("ИзФормыЗаказа",истина);
		
	МассивСообщений = Новый Массив;
	
	МассивПараметров = Новый Массив; 
	МассивПараметров.Добавить(Заказ);
	МассивПараметров.Добавить("ОтменитьЗаявку"); 
	МассивПараметров.Добавить(ПараметрыДляОтправки); 
	МассивПараметров.Добавить(МассивСообщений);
	
	
	ИдентификаторФЗ = Новый УникальныйИдентификатор; 
	ФЗ = ФоновыеЗадания.Выполнить("b2b_ОбменЗаявками.ЗаписатьВОчередьНаОтправку",МассивПараметров,ИдентификаторФЗ,"ЗаписатьВОчередьНаОтправкуОтменитьЗаявку");   	


КонецПроцедуры 


Процедура ОтправитьПлановуюДатуОтгрузкиВФоне(Знач Заказ, Знач ВерсияСтарая) Экспорт 
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Заказ);
	МассивПараметров.Добавить(ВерсияСтарая);
	
	ИдентификаторФЗ = Новый УникальныйИдентификатор; 
	ФЗ = ФоновыеЗадания.Выполнить("b2b_ОбменЗаявками.ОтправитьПлановуюДатуОтгрузкиВФонеПослеПроверки",МассивПараметров,ИдентификаторФЗ,"ОтправитьПлановуюДатуОтгрузкиВФонеПослеПроверки");
	

КонецПроцедуры

Процедура ОтправитьПлановуюДатуОтгрузкиВФонеПослеПроверки(Знач Заказ, Знач ВерсияСтарая) Экспорт 
	
	ДокЗаписан = Ложь; 
	b2b_ОбменДаннымиПоAPI.ПроверкаВерсииДокументаПриЗаписи(ВерсияСтарая,Заказ,ДокЗаписан);
	
	Если НЕ ДокЗаписан Тогда
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Ошибка выполнения в фоне отправки плановой даты отгрузки заявки b2b"), 
		УровеньЖурналаРегистрации.Ошибка, 
		, 
		, 
		НСтр("ru = 'Ошибка в ""ОтправитьПлановуюДатуОтгрузкиВФоне"".'"));
		
		Возврат; 	
	КонецЕсли;
	
	ПараметрыДляОтправки = Новый Структура;
	ПараметрыДляОтправки.Вставить("НомерЗаявки",Заказ.НомерЗаказа);  
	ПараметрыДляОтправки.Вставить("ДатаОтгрузкиЗаказа",Заказ.ДатаОтгрузки);	
	ПараметрыДляОтправки.Вставить("Подразделение",Справочники.Подразделения.НайтиПоКоду("SSP-0118"));
	ПараметрыДляОтправки.Вставить("ИзФормыЗаказа",истина);
	
	МассивСообщений = Новый Массив;
	
	МассивПараметров = Новый Массив; 
	МассивПараметров.Добавить(Заказ);
	МассивПараметров.Добавить("ОтправитьДатуОтгрузкиВместе"); 
	МассивПараметров.Добавить(ПараметрыДляОтправки); 
	МассивПараметров.Добавить(МассивСообщений);
	
	
	ИдентификаторФЗ = Новый УникальныйИдентификатор; 
	ФЗ = ФоновыеЗадания.Выполнить("b2b_ОбменЗаявками.ЗаписатьВОчередьНаОтправку",МассивПараметров,ИдентификаторФЗ,"ЗаписатьВОчередьНаОтправкуОтправитьДатуОтгрузкиПлановую");  
	

КонецПроцедуры


Функция СвязанныеРНКЗаказ(Знач Заказ) Экспорт
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ЗаказРасходныеНакладные.Документ КАК РНК
	 |ИЗ
	 |	Документ.Заказ.РасходныеНакладные КАК ЗаказРасходныеНакладные
	 |ГДЕ
	 |	ЗаказРасходныеНакладные.Ссылка = &Заказ
	 |	И ЗаказРасходныеНакладные.Документ.Проведен";  
	 
	 Запрос.УстановитьПараметр("Заказ", Заказ);
	 
	 РезультатЗапроса = Запрос.Выполнить();
	 
	 Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("РНК"); 
	
КонецФункции

#КонецОбласти

 