
Функция СоздатьДокументРекламационнаяНакладная(ДокСсылка, ДополнительныеРеквизиты = Неопределено, Проводить = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДокСсылка) Тогда Возврат Неопределено; КонецЕсли;
	
	ДокРекламация = СоздатьИзменитьДокумент(ДокСсылка, "РекламационнаяНакладная");
	Если ДокРекламация <> Неопределено Тогда
		
		ЗаполнитьШапкуДокумента(ДокРекламация, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Покупка");
		
		ДокРекламация.Заполнить(ДокСсылка);
		
		Если ТипЗнч(ДополнительныеРеквизиты) = Тип("Структура") Тогда
			Для Каждого Элемент из ДополнительныеРеквизиты Цикл
				//УстановитьНезаполненныйРеквизитШапки(ДокРекламация, Элемент.Ключ, Элемент.Значение);
				Если ЕстьРеквизитДокумента(Элемент.Ключ, ДокРекламация.Метаданные()) Тогда
					ДокРекламация[Элемент.Ключ] = Элемент.Значение;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Попытка
			Если Проводить Тогда
				ДокРекламация.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				ДокРекламация.ОбменДанными.Загрузка = Истина;
				ДокРекламация.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			СообщитьИзМодуля("" + Строка(ДокРекламация));
			Возврат ДокРекламация.Ссылка;		
		Исключение
			ДокРекламация.ОбменДанными.Загрузка = Истина;
			ДокРекламация.Записать(РежимЗаписиДокумента.Запись);
			СообщитьИзМодуля(ОписаниеОшибки());
			Возврат ДокРекламация.Ссылка;
		КонецПопытки;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция СоздатьИзменитьДокумент(ДокСсылка = Неопределено, ВидДокумента = "РекламационнаяНакладная", ФлагТолькоПроведенные = Ложь, ФлагБезПомеченныхНаУдаление = Истина, СоздаватьНовый = Ложь) Экспорт
	
	Если ДокСсылка = Неопределено ИЛИ СоздаватьНовый Тогда
		НовыйДок = Неопределено;
	Иначе
		НовыйДок = ЗаполнениеДокументов.НайтиПодчиненныйДокумент(ДокСсылка, ВидДокумента, ФлагТолькоПроведенные, ФлагБезПомеченныхНаУдаление);
	КонецЕсли;
	
	Если НовыйДок = Неопределено Тогда
		НовыйДокОбъект = Документы[ВидДокумента].СоздатьДокумент();
		НовыйДокОбъект.Дата = ТекущаяДатаСеанса();
		КодИБ = ПараметрыСеанса.ЭтотУзел.Код;
		НовыйДокОбъект.УстановитьНовыйНомер(КодИБ + "-");		
	Иначе
		НовыйДокОбъект = НовыйДок.ПолучитьОбъект();
	КонецЕсли;
	
	Возврат НовыйДокОбъект;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Процедура СформироватьОтбивку(ДокСсылка, ТекстОтбивки = "", Полномочие = "ДокументКоррекцияОбработка", Автор = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Если ТипЗнч(Полномочие)=Тип("Строка") Тогда
		Полномочие=ПланыВидовХарактеристик.ПолномочияПользователей[Полномочие];	
	КонецЕсли;	
	Запрос.УстановитьПараметр("Полномочие"   , Полномочие);
	Запрос.УстановитьПараметр("Автор" , Автор);
	Если Автор = Неопределено Тогда
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(ПолномочияПользователей.Пользователь.ФизЛицо.ЕМэйл КАК СТРОКА(100)) КАК ЕМэйл
		|ИЗ
		|	РегистрСведений.ПолномочияПользователей КАК ПолномочияПользователей
		|ГДЕ
		|	ПолномочияПользователей.Полномочие = &Полномочие
		|	И (ВЫРАЗИТЬ(ПолномочияПользователей.Пользователь.ФизЛицо.ЕМэйл КАК СТРОКА(100))) <> """"
		|	И ПолномочияПользователей.Значение = ИСТИНА
		|";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(Пользователи.ФизЛицо.ЕМэйл КАК СТРОКА(100)) КАК Емэйл
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &Автор
		|	И НЕ Пользователи.ПометкаУдаления
		|	И (ВЫРАЗИТЬ(Пользователи.ФизЛицо.ЕМэйл КАК СТРОКА(100))) <> """"
		|";
	КонецЕсли;
	
	Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЕМэйл");
	СписокПолучателей = Новый СписокЗначений;
	Для Каждого Элемент Из Массив Цикл
		СписокПолучателей.Добавить(Элемент);	
	КонецЦикла;
	
	Если СписокПолучателей.Количество() > 0 Тогда
		
		ТекстПисьма = "Документ " + Строка(ДокСсылка) + ". " + ТекстОтбивки;
		
		СформироватьВнутреннееУведомление(СписокПолучателей, ТекстПисьма, ТекстПисьма, ДокСсылка);
		
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Функция СоздатьДокументКорректировочнаяСФ(РекламацияСсылка) Экспорт
	
	КСФ = КСчетФактураНакладной(РекламацияСсылка);
	
	Если КСФ.Пустая() Тогда
		КСФ_Объект = Документы.КорректировочныйСчетФактура.СоздатьДокумент();
	Иначе
		КСФ_Объект = КСФ.Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьШапкуДокумента(КСФ_Объект, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
	
	КСФ_Объект.Дата = ТекущаяДатаСеанса();
	
	КСФ_Объект.Заполнить(РекламацияСсылка);
	
	УстановитьНомерДокументаКлиентСервер(КСФ_Объект);
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	Попытка
		КСФ_Объект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
		СообщитьИзМодуля("" + Строка(КСФ_Объект));
	Исключение
		КСФ_Объект.ОбменДанными.Загрузка = Истина;
		КСФ_Объект.Записать(РежимЗаписиДокумента.Запись);
		СообщитьИзМодуля(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат ?(КСФ_Объект = Неопределено, Неопределено, КСФ_Объект.Ссылка);
	
КонецФункции