
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если ОбменДанными.Загрузка  Тогда Возврат КонецЕсли;
	
	Если СостояниеЗаявки = Перечисления.СостоянияКоррекции.Утверждена Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Не известно, чем заполнить!!!!
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ДанныеЗаполнения = Неопределено ИЛИ ДанныеЗаполнения.Пустая() Тогда Возврат КонецЕсли;
	
	Если НЕ ДанныеЗаполнения.Проведен Тогда Возврат КонецЕсли;
	
	Если ЕстьРеквизитДокумента("СостояниеНакладной", ДанныеЗаполнения.Метаданные()) Тогда
		Если ДанныеЗаполнения.СостояниеНакладной <> Перечисления.СостоянияНакладной.Отгружена Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
	СостояниеЗаявки = Перечисления.СостоянияКоррекции.ВРаботе;
	
	ДокОснование = ДанныеЗаполнения.Ссылка;
	Если ЕстьРеквизитДокумента("Контрагент", ДанныеЗаполнения.Метаданные()) Тогда
		Корреспондент = ДанныеЗаполнения.Контрагент;
	КонецЕсли;
	
	НомерИсходногоДокумента = СокрЛП(ДокОснование.Номер);
	
	Для Каждого ИсхСтрокаТЧ ИЗ ДанныеЗаполнения.Товары Цикл
		
		Если ИсхСтрокаТЧ.ПодтвержденнаяЗаявка <> ИсхСтрокаТЧ.Количество Тогда
			СтрокаТЧ = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, ИсхСтрокаТЧ);
			
			СтрокаТЧ.КоличествоИсх	  = ИсхСтрокаТЧ.ПодтвержденнаяЗаявка;
			СтрокаТЧ.КоличествоФакт	  = ИсхСтрокаТЧ.Количество;
			
			СтрокаТЧ.КоличествоФактСогласовано      = СтрокаТЧ.КоличествоФакт;
			СтрокаТЧ.ВсегоСогласовано = СтрокаТЧ.КоличествоФактСогласовано * СтрокаТЧ.Цена;
			
			СтрокаТЧ.Количество		  = СтрокаТЧ.КоличествоИсх - СтрокаТЧ.КоличествоФактСогласовано;
			СтрокаТЧ.Всего			  = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПересчитатьСуммуИКоличествоДокумента();
	
КонецПроцедуры

Процедура ПересчитатьСуммуИКоличествоДокумента() Экспорт
	
	СуммаДокумента = Товары.Итог("ВсегоСогласовано");
	КоличествоДокумента = Товары.Итог("КоличествоФактСогласовано");
	
	СуммаРекламации = 0; КоличествоРекламации = 0;
	Для Каждого Стр ИЗ Товары Цикл
		Если Стр.ДельтаСогласовано <> 0 Тогда
			СуммаРекламации = СуммаРекламации + Стр.ВсегоСогласовано;
			КоличествоРекламации = КоличествоРекламации + Стр.КоличествоФактСогласовано;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Функция Отклонить() Экспорт
	
	Для Каждого СтрокаТЧ ИЗ Товары Цикл
		СтрокаТЧ.СостояниеЗаявки = Перечисления.СостоянияКоррекции.Отклонена;
		СтрокаТЧ.КоличествоФактСогласовано = 0;
		СтрокаТЧ.ВсегоСогласовано = 0;
	КонецЦикла;
	
	СостояниеЗаявки = Перечисления.СостоянияКоррекции.Отклонена;
	
	Менеджер = Справочники.ФизическиеЛица.ПустаяСсылка();
	Если ЗначениеЗаполнено(ДокОснование) Тогда
		Если ЕстьРеквизитДокумента("Менеджер", ДокОснование.Метаданные()) Тогда
			Менеджер = ДокОснование.Менеджер;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		Записать();
		Если ЗначениеЗаполнено(Автор) Тогда
			Документы.ЗаявкаНаРекламацию.СформироватьОтбивку(Ссылка, "Заявка отклонена!",, Автор);
		КонецЕсли;
		Если ЗначениеЗаполнено(Менеджер) И Менеджер <> Автор Тогда
			Документы.ЗаявкаНаРекламацию.СформироватьОтбивку(Ссылка, "Заявка отклонена!",, Менеджер);
		КонецЕсли;
	Исключение
		СообщитьОбОшибке(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Функция Утвердить() Экспорт
	
	Для Каждого СтрокаТЧ ИЗ Товары Цикл
		СтрокаТЧ.СостояниеЗаявки = Перечисления.СостоянияКоррекции.Утверждена;
	КонецЦикла;
	
	СостояниеЗаявки = Перечисления.СостоянияКоррекции.Утверждена;
	
	Попытка
		Записать();
		Документы.ЗаявкаНаРекламацию.СформироватьОтбивку(Ссылка, "Заявка утверждена!");
	Исключение
		СообщитьОбОшибке(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Функция Отработать() Экспорт
	
	/// п.17 ТЗ
	
	Если Товары.Итог("КоличествоФактСогласовано") = 0 Тогда
		Отклонить();
		Возврат Истина;
	КонецЕсли;
	
	Если Товары.Итог("КоличествоФактСогласовано") = Товары.Итог("КоличествоФакт") Тогда
		СостояниеЗаявки = Перечисления.СостоянияКоррекции.Принята;
	Иначе
		СостояниеЗаявки = Перечисления.СостоянияКоррекции.ПринятаЧастично;
	КонецЕсли;
	
	Попытка
		Записать();
	Исключение
		СообщитьОбОшибке(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	ДополнительныеРеквизиты = Новый Структура("Дата, ВидРекламации, Отработано, ВидОплаты, ПроводитьПоОстаткам",
		ТекущаяДатаСеанса(), Перечисления.ВидыРекламаций.Вычерк, Ложь, Перечисления.ВидыОплаты.БН, Истина);
	
	РекламацияСсылка = Документы.ЗаявкаНаРекламацию.СоздатьДокументРекламационнаяНакладная(Ссылка, ДополнительныеРеквизиты, Истина);
	
	Если РекламацияСсылка <> Неопределено Тогда
		
		КСФ = Документы.ЗаявкаНаРекламацию.СоздатьДокументКорректировочнаяСФ(РекламацияСсылка);
		
		Менеджер = Справочники.ФизическиеЛица.ПустаяСсылка();
		Если ЗначениеЗаполнено(ДокОснование) Тогда
			Если ЕстьРеквизитДокумента("Менеджер", ДокОснование.Метаданные()) Тогда
				Менеджер = ДокОснование.Менеджер;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПричинаРекламации) тогда
			ЗаписатьЗначениеВРеквизитыДокументов(ПричинаРекламации, РекламацияСсылка,"ПричинаРекламации");	
		КонецЕсли;

		Если ЗначениеЗаполнено(Автор) Тогда
			Документы.ЗаявкаНаРекламацию.СформироватьОтбивку(Ссылка, "Заявка отработана!",, Автор);
		КонецЕсли;
		Если ЗначениеЗаполнено(Менеджер) И Менеджер <> Автор Тогда
			Документы.ЗаявкаНаРекламацию.СформироватьОтбивку(Ссылка, "Заявка отработана!",, Менеджер);
		КонецЕсли;
		
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
