
Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//Мессерле 29,05,12
	//Если ЗначениеЗаполнено(ПредварительнаяДатаПоступления) тогда
	//	Д=Дата;
	//	Дата=ПредварительнаяДатаПоступления;
	//	ПредварительнаяДатаПоступления=Д;
	//иначе
	//	Сообщить("Заполните плановую дату поступления!");отказ=истина;Возврат;
	//Конецесли;	
	
	Если Сокрлп(НомерКонтейнера)<>"" тогда
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ
		|	Контейнер.Номер
		|ИЗ
		|	Документ.Контейнер КАК Контейнер
		|ГДЕ
		|	Контейнер.Номер ПОДОБНО &Ном";
		
		поз=найти(Номер,"\");
		Если поз=0 тогда
			
			ном=Сокрлп(НомерКонтейнера);
			
			Запрос.УстановитьПараметр("Ном",ном+"%");
			выб=запрос.Выполнить().Выбрать();
			макс=-1;
			пока выб.следующий() цикл
				попытка
					поз2=найти(выб.Номер,"\");
					чис=число(Сред(выб.номер,поз2+1,20));
				исключение
					Чис=0;
				Конецпопытки;
				
				Если Чис>Макс тогда
					Макс=Чис;
				Конецесли;
				
			Конеццикла;	 
			
			Макс=Макс+1;
			
			НовыйНомер=Сокрлп(НомерКонтейнера)+"\"+макс;
			Если СтрДлина(Сокрлп(НомерКонтейнера))>0 и Сокрлп(номер)<>НовыйНомер тогда
				номер=НовыйНомер;
				Сообщить("Контейнеру присвоен номер "+номер);
				//Сообщить("Если при записи документа возникнет ошибка, значит контейнер с таким номером уже есть в базе");
			Конецесли;
		Конецесли;
	Конецесли;
	
		//Мессерле 29,05,12
		
		
	 
	

	ЕстьИзменения		=Модифицированность();	
	НужноВыгружать		=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
     Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;

КонецПроцедуры
