#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодборКонтрагентов(Команда)    
	
	ОписаниеОповещенияВыбор = Новый ОписаниеОповещения("ПослеВыбораКонтрагента", ЭтотОбъект);
	ПараметрОткрытияФормы = Новый Структура("РежимВыбора,МножественныйВыбор", Истина, Истина);
	ПараметрОткрытияФормы.Вставить("Владелец", ОбщегоНазначения_ПИ.ПолучитьОсновнуюИБ());

	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораУпр", ПараметрОткрытияФормы, ЭтотОбъект, , , ,
		ОписаниеОповещенияВыбор);      
		
КонецПроцедуры

&НаКлиенте
Процедура ПодборСотрудников(Команда)      
	
	ОписаниеОповещенияВыбор = Новый ОписаниеОповещения("ПослеВыбораСотрудника", ЭтотОбъект);
	ПараметрОткрытияФормы = Новый Структура("РежимВыбора,МножественныйВыбор", Истина, Истина);
	ПараметрОткрытияФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);

	ОткрытьФорму("Справочник.ФизическиеЛица.Форма.ФормаВыбораУпр", ПараметрОткрытияФормы, ЭтотОбъект, , , ,
		ОписаниеОповещенияВыбор); 
		
КонецПроцедуры

&НаКлиенте
Процедура ПодборНоменклатуры(Команда)     
	
	ОписаниеОповещенияВыбор = Новый ОписаниеОповещения("ПослеВыбораНоменклатуры", ЭтотОбъект);
	ПараметрОткрытияФормы = Новый Структура("РежимВыбора,МножественныйВыбор", Истина, Истина);
	ПараметрОткрытияФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Группы);

	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбораУпр", ПараметрОткрытияФормы, ЭтотОбъект, , , ,
		ОписаниеОповещенияВыбор);     
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыбораНоменклатуры(ВыбранноеЗначение, ДопПараметры) Экспорт       
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для Каждого ВыбЭлемент Из ВыбранноеЗначение Цикл
			ДобавитьНовуюСтрокуТовары(ВыбЭлемент);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Номенклатура") Тогда
		ДобавитьНовуюСтрокуТовары(ВыбранноеЗначение);
	КонецЕсли;        
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовуюСтрокуТовары(Знач ВыбЭлемент)

	Перем Отбор;
	Отбор = Новый Структура("Номенклатура", ВыбЭлемент);
	СтрокиТоваров = Объект.Товары.НайтиСтроки(Отбор);
	Если СтрокиТоваров.Количество() = 0 Тогда
		СтрокаТовара = Объект.Товары.Добавить();
		СтрокаТовара.Номенклатура = ВыбЭлемент;
	Иначе
		СтрокаТовара = СтрокиТоваров[0];
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКонтрагента(ВыбранноеЗначение, ДопПараметры) Экспорт    
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для Каждого ВыбЭлемент Из ВыбранноеЗначение Цикл
			ДобавитьНовуюСтрокуКонтрагенты(ВыбЭлемент);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Контрагенты") Тогда
		ДобавитьНовуюСтрокуКонтрагенты(ВыбранноеЗначение);
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовуюСтрокуКонтрагенты(Знач ВыбЭлемент)

	Перем Отбор;
	Отбор = Новый Структура("Контрагент", ВыбЭлемент);
	СтрокиТоваров = Объект.Контрагенты.НайтиСтроки(Отбор);
	Если СтрокиТоваров.Количество() = 0 Тогда
		СтрокаТовара = Объект.Контрагенты.Добавить();
		СтрокаТовара.Контрагент = ВыбЭлемент;
	Иначе
		СтрокаТовара = СтрокиТоваров[0];
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСотрудника(ВыбранноеЗначение, ДопПараметры) Экспорт   
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для Каждого ВыбЭлемент Из ВыбранноеЗначение Цикл
			ДобавитьНовуюСтрокуСотрудники(ВыбЭлемент);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ДобавитьНовуюСтрокуКонтрагенты(ВыбранноеЗначение);
	КонецЕсли;                    
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовуюСтрокуСотрудники(Знач ВыбЭлемент)

	Перем Отбор;
	Отбор = Новый Структура("Сотрудник", ВыбЭлемент);
	СтрокиТоваров = Объект.Сотрудники.НайтиСтроки(Отбор);
	Если СтрокиТоваров.Количество() = 0 Тогда
		СтрокаТовара = Объект.Сотрудники.Добавить();
		СтрокаТовара.Сотрудник = ВыбЭлемент;
	Иначе
		СтрокаТовара = СтрокиТоваров[0];
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти