
&НаСервере
Процедура УстановитьТипМетаданныхНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Документ.СверкаДанных
	|ГДЕ
	|	ТипМетаданных = """"
	|";
	
	Реквизиты = Новый Структура("ТипМетаданных","РегистрыНакопления");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		УстановитьРеквизитыОбъекта(Выборка.Ссылка,Реквизиты,РежимЗаписиДокумента.Запись,Истина,Истина);	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТипМетаданных(Команда)
	УстановитьТипМетаданныхНаСервере();
КонецПроцедуры
