Процедура СформироватьДвиженияПоПрофиту() Экспорт
	Если ПараметрыСеанса.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда Возврат КонецЕсли;
	//крохин начало 10.04.2012
	//РНК-подарки формируют затраты, а не профит
	Если Отбор.Регистратор.Значение.Метаданные().Имя = "РасходнаяНакладная" И Отбор.Регистратор.Значение.Подарок Тогда
		Возврат;
	КонецЕсли; 
	//крохин конец 10.04.2012
	//крохин начало 08.12.2011
	//добавил рекламации (вычерки)
	//МТ=Новый ОписаниеТипов("ДокументСсылка.РасходнаяНакладная,ДокументСсылка.ПриходнаяНакладная,ДокументСсылка.ОтчетКассовойСмены,ДокументСсылка.ПродажаИМ");
	МТ=Новый ОписаниеТипов("ДокументСсылка.РасходнаяНакладная,ДокументСсылка.ПриходнаяНакладная,ДокументСсылка.ОтчетКассовойСмены,ДокументСсылка.ПродажаИМ,ДокументСсылка.РекламационнаяНакладная");
	//крохин конец 08.12.2011
	
	Если НЕ МТ.СодержитТип(ТипЗнч(Отбор.Регистратор.Значение)) Тогда Возврат КонецЕсли; 
	
	Если ЗначениеЗаполнено(Отбор.Регистратор.Значение) Тогда
		Запрос=Новый Запрос;
		//крохин начало
		//ВозвратПоставщику формирует движения по затратам, а не профиту. С 01.07.2010
        Если Отбор.Регистратор.Значение.дата >= '20100701' Тогда
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Период,
		|	Номенклатура.Родитель.ВидНоменклатуры КАК ВидНоменклатуры,
		|	Подразделение,
		|	КодОперации,
		|	Отправитель КАК Контрагент,
		|	СУММА(Оборот)-СУММА(ВЫБОР КОГДА ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА 1 ИНАЧЕ -1 КОНЕЦ*Сумма) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ		
		|ГДЕ
		|	ОстаткиТМЦ.Регистратор = &Регистратор
	//	|	И КодОперации В (ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.Реализация),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратОтПокупателя),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратПоставщику),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ПогашениеСертификата))
	    |	И КодОперации В (ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.Реализация),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратОтПокупателя),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ПогашениеСертификата))
		|СГРУППИРОВАТЬ ПО 
		|	Период,Номенклатура.Родитель.ВидНоменклатуры,Отправитель,Подразделение,КодОперации";
	Иначе
        		Запрос.Текст="
		|ВЫБРАТЬ
		|	Период,
		|	Номенклатура.Родитель.ВидНоменклатуры КАК ВидНоменклатуры,
		|	Подразделение,
		|	КодОперации,
		|	Отправитель КАК Контрагент,
		|	СУММА(Оборот)-СУММА(ВЫБОР КОГДА ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА 1 ИНАЧЕ -1 КОНЕЦ*Сумма) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ		
		|ГДЕ
		|	ОстаткиТМЦ.Регистратор = &Регистратор
		|	И КодОперации В (ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.Реализация),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратОтПокупателя),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратПоставщику),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ПогашениеСертификата))
		|СГРУППИРОВАТЬ ПО 
		|	Период,Номенклатура.Родитель.ВидНоменклатуры,Отправитель,Подразделение,КодОперации";

		КонецЕсли;
			    //крохин конец
		
		Запрос.УстановитьПараметр("Регистратор",Отбор.Регистратор.Значение);
		Выборка=Запрос.Выполнить().Выбрать();
		
		НЗ=РегистрыНакопления.Профит.СоздатьНаборЗаписей();
		НЗ.Отбор.Регистратор.Установить(Отбор.Регистратор.Значение);
		
		Пока Выборка.Следующий() Цикл
			Запись=НЗ.Добавить();
			
			Запись.ВидДвижения=ВидДвиженияНакопления.Приход;			
			ЗаполнитьЗначенияСвойств(Запись,Выборка);		
		КонецЦикла;		
		
		НЗ.Записать();
	КонецЕсли;
КонецПроцедуры
 
Процедура ПриЗаписи(Отказ, Замещение)
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	
	//СформироватьДвиженияПоПрофиту();	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	//Если НЕ ПараметрыСеанса.ОтключитьЖурнализациюЗаписи И Отбор.Регистратор.Значение.Дата < ТекущаяДата() И ПараметрыСеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
	//	
	//	Запрос=Новый запрос;
	//	запрос.Текст="ВЫБРАТЬ
	//				 |	ЛогиОстатковТМЦ.Документ,
	//				 |	ЛогиОстатковТМЦ.ДатаИзменения1
	//				 |ИЗ
	//				 |	РегистрСведений.ЛогиОстатковТМЦ КАК ЛогиОстатковТМЦ
	//				 |ГДЕ
	//				 |	ЛогиОстатковТМЦ.Документ = &Документ
	//				 |	И КОНЕЦПЕРИОДА(ЛогиОстатковТМЦ.ДатаИзменения1, ДЕНЬ) = КОНЕЦПЕРИОДА(&ДатаИзменения, ДЕНЬ)";
	//	
	//	Запрос.УстановитьПараметр("Документ", Отбор.Регистратор.Значение);
	//	Запрос.УстановитьПараметр("ДатаИзменения",ТекущаяДата());
	//		
	//	Выб=Запрос.Выполнить().Выбрать();
	//	Запись=РегистрыСведений.ЛогиОстатковТМЦ.СоздатьНаборЗаписей();
	//	Если выб.Следующий() тогда //Надо перезаписать
	//		Запись.Отбор.Документ.Установить(выб.документ.ссылка);
	//		Запись.Отбор.ДатаИзменения1.Установить(выб.ДатаИзменения1);
	//		Запись.Прочитать();
	//		Запись.Очистить();
	//		Запись.Записать();
	//	Конецесли;
	//	
	//	Запись=РегистрыСведений.ЛогиОстатковТМЦ.СоздатьМенеджерЗаписи();
	//  	
	//	Если ЭтотОбъект.Количество()=0 тогда
	//		Запись.ДопИнф="Нули";
	//	Конецесли;
	//	
	//	Запись.ДатаИзменения1 = ТекущаяДата();
	//	Запись.Документ     =Отбор.Регистратор.Значение;
	//	Запись.Записать();
	//	
	//КонецЕсли;
КонецПроцедуры

