Функция ОбработатьЗапрос(Запрос) Экспорт
	ЗаписатьВЛог("Обмен через HTTP","Начало.","Информация"); 
	Результат		= Новый Структура("Успешно,Ошибки,Данные,Начало,ВремяОбработки", Истина, Новый Массив, Неопределено, ТекущаяУниверсальнаяДатаВМиллисекундах());	
	
	Тело 			=  Запрос.ПолучитьТелоКакСтроку();
	
	ОписаниеЗапроса = ЗначениеИзХМЛСтроки(Тело);
	
	Пользователь_Ист = ПолучитьЗначениеПараметра(ОписаниеЗапроса, "Пользователь", "");
	Начало 			 = ПолучитьЗначениеПараметра(ОписаниеЗапроса, "Начало");	
	ТекстСообщения 	 = СтрШаблон("Разбор описания запроса. Пользователь: '%1'", Пользователь_Ист);
	Если Начало<>Неопределено Тогда
		ТекстСообщения = ТекстСообщения + Символы.ПС+СтрШаблон(" время с начала запроса: %1 мс.",(ТекущаяУниверсальнаяДатаВМиллисекундах()-Начало));	
	КонецЕсли; 
	
	ЗаписатьВЛог("Обмен через HTTP", ТекстСообщения, "Информация"); 
	
	резЗапроса 		= ВыполнитьЗапрос(ОписаниеЗапроса);	
	
	СтрокРезультата = 0;
		
	Если резЗапроса.Успешно Тогда		
		ДопПараметры	= ФР_ОбщегоНазначения.ПолучитьЗначениеПараметра(ОписаниеЗапроса,	"ДопПараметры");
		ВидОбхода		= ФР_ОбщегоНазначения.ПолучитьЗначениеПараметра(ДопПараметры, 		"ВидОбхода");
		//резИст = ВыполнитьЗапросКИсточнику(ТекстЗапроса,,Новый Структура("ВидОбхода", "ПоГруппировкамСИерархией"));	
		
		ЗаписьЖурналаРегистрации("Обмен через HTTP", УровеньЖурналаРегистрации.Информация,,,""+ДопПараметры);
		
		Если ВидОбхода = "ПоГруппировкамСИерархией" Тогда
			Обход = ОбходРезультатаЗапроса.ПоГруппировкамСИерархией;
		ИначеЕсли ВидОбхода = "ПоГруппировкам" Тогда
			Обход = ОбходРезультатаЗапроса.ПоГруппировкам;			
		Иначе
			Обход = ОбходРезультатаЗапроса.Прямой;		
		КонецЕсли; 
		
		Результат.Данные = резЗапроса.РезультатЗапроса.Выгрузить(Обход);	
		
		Если ВидОбхода = "ПоГруппировкамСИерархией"  Тогда
			//СтрокРезультата = Результат.Данные.Строки.Количество();
		Иначе
			//СтрокРезультата = Результат.Данные.Количество();
		КонецЕсли;		
	Иначе
		Для Каждого ТекстОшибки Из резЗапроса.Ошибки Цикл
			Результат.Ошибки.Добавить(ТекстОшибки);
		КонецЦикла;
	КонецЕсли;	
	
	Результат.Успешно 			= (Результат.Ошибки.Количество()=0);
	Результат.ВремяОбработки 	= (ТекущаяУниверсальнаяДатаВМиллисекундах()-Результат.Начало)/1000;
	Результат.Начало			= ТекущаяУниверсальнаяДатаВМиллисекундах();	
	
	ЗаписатьВЛог("Обмен через HTTP","Выполнение запроса. Строк результата: "+СтрокРезультата,"Информация",,,Результат.ВремяОбработки);
	
	Возврат ЗначениеВХМЛСтроку(Результат);
КонецФункции //ОбработатьЗапрос()

Функция ПолучитьСтруктуру(Запрос) Экспорт	
	Параметры = Новый Соответствие;
	Для Каждого Элемент Из Запрос.ПараметрыURL Цикл
		Параметры.Вставить(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	
	ИмяТаблицы	= ПолучитьЗначениеПараметра(Параметры, "table_name", "");
	Результат	= Новый Структура("Успешно,Ошибки,Данные", Истина, Новый Массив, ИмяТаблицы);	
	
	Части = СтрРазделить(ИмяТаблицы,".");
	МетаОбъект = Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
	Если МетаОбъект<>Неопределено Тогда
		Значения = Новый Массив;
		Если Метаданные.Перечисления.Содержит(МетаОбъект) Тогда
			Для Каждого Значение Из МетаОбъект.ЗначенияПеречисления Цикл
				Значения.Добавить(Новый Структура("Имя,Представление", Значение.Имя, ""+Значение));
			КонецЦикла;					
		КонецЕсли;
		Результат.Данные = Новый Структура("Значения", Значения);
	КонецЕсли; 
	
	Возврат ЗначениеВХМЛСтроку(Результат);
	//Возврат ЗначениеВХМЛСтроку(Результат);
КонецФункции //ОбработатьЗапрос()

Функция ВыполнитьЗапрос(ОписаниеЗапроса)
	Результат = Новый Структура("Успешно,РезультатЗапроса,Ошибки", Истина, Неопределено, Новый Массив);
	
	Запрос = Новый Запрос(ОписаниеЗапроса.Текст);
	
	Для Каждого КиЗ Из ОписаниеЗапроса.Параметры Цикл
		Запрос.УстановитьПараметр(КиЗ.Ключ, КиЗ.Значение);	
	КонецЦикла; 
	
	Попытка	
		Результат.РезультатЗапроса = Запрос.Выполнить();
	Исключение
		Результат.Ошибки.Добавить(ОписаниеОшибки());	
	КонецПопытки;	
	
	Результат.Успешно = (Результат.Ошибки.Количество()=0);
	
	Возврат Результат;
КонецФункции //ВыполнитьЗапрос(ОписаниеЗапроса)

Функция ЗначениеВХМЛСтроку(Значение)
	ЗаписьХМЛ = Новый ЗаписьXML;
	ЗаписьХМЛ.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьХМЛ, Значение, НазначениеТипаXML.Явное);	
	
	СтрокаХМЛ = ЗаписьХМЛ.Закрыть();	
	Возврат СтрокаХМЛ
КонецФункции //ЗначениеВХМЛСтроку(Значение)

Функция ЗначениеИзХМЛСтроки(СтрокаХМЛ)
	ЧтениеХМЛ = Новый ЧтениеXML;
	ЧтениеХМЛ.УстановитьСтроку(СтрокаХМЛ);	
	
	Значение = СериализаторXDTO.ПрочитатьXML(ЧтениеХМЛ);	
	
	ЧтениеХМЛ.Закрыть();
	
	Возврат Значение;
КонецФункции //ЗначениеИзХМЛСтроки(СтрокаХМЛ)

 
Функция ПолучитьЗначениеПараметра(Параметры, Имя, ЗначениеПоУмодчанию = Неопределено)
	Результат = ЗначениеПоУмодчанию;
	
	ТипПараметов	= ТипЗнч(Параметры);
	ТекЗнач 		= Неопределено;
	Если ТипПараметов = Тип("Соответствие") Тогда
		ТекЗнач = Параметры[Имя];
		Если ТекЗнач <> Неопределено Тогда
			Результат = ТекЗнач;		
		КонецЕсли;
	ИначеЕсли ТипПараметов = Тип("Структура") Тогда
		Если Параметры.Свойство(Имя, ТекЗнач) Тогда
			Результат = ТекЗнач;			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПолучитьЗначениеПараметра(Параметры, Имя, ЗначениеПоУмодчанию = Неопределено)