Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)	
	Префикс=ПолучитьПрефиксНомеров(ЭтотОбъект);
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	//Кухарь 29.03.17 начало
	если не ЭтоГруппа тогда
		//Кухарь 29.03.17 конец
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВидыНормРасходаМатериалов.Ссылка
		|ИЗ
		|	Справочник.ВидыНормРасходаМатериалов КАК ВидыНормРасходаМатериалов
		|ГДЕ
		|	ВидыНормРасходаМатериалов.ВладелецНормыРасхода = &ВладелецНормыРасхода
		|	И ВидыНормРасходаМатериалов.ИмяНормыРасхода = &ИмяНормыРасхода
		|	И ВидыНормРасходаМатериалов.Код <> &Код";
		запрос.УстановитьПараметр("ВладелецНормыРасхода",ВладелецНормыРасхода);
		запрос.УстановитьПараметр("ИмяНормыРасхода",ИмяНормыРасхода);
		запрос.УстановитьПараметр("Код",Код);
		результат=запрос.Выполнить().выбрать();
		пока результат.Следующий() цикл
			#Если клиент тогда
				Сообщить("Эта норма на эту позицию уже установлена. Отредактируйте уже существующую норма, а не создавайте новую. Код старой нормы - "+результат.ссылка.код);
			#КонецЕсли
		КонецЦикла;
		//Кухарь 29.03.17 начало
	КонецЕсли;
	//Кухарь 29.03.17 конец
	

				 
КонецПроцедуры
