//Процедура Сформировать() Экспорт
//	КаталогОшибок = 
//	СоздатьКаталог(КаталогОшибок+"\Дубль\");
//	СоздатьКаталог(КаталогОшибок+"\Ошибки\");
//	СоздатьКаталог(КаталогОшибок+"\Нет документа в базе\");
//	СоздатьКаталог(КаталогОшибок+"\Уже провереные\");

//	СписокОтработанныхКаталогов = Новый СписокЗначений;
//	НайденныеКаталоги = НайтиФайлы(КаталогВыгрузки,"*");
//	Индикатор1 = 0;
//	ЭлементыФормы.Индикатор1.МаксимальноеЗначение = НайденныеКаталоги.Количество();
//	Для Каждого ИскКаталог Из НайденныеКаталоги Цикл
//		Индикатор1 = Индикатор1 + 1;
//		ОбработкаПрерыванияПользователя();
//		Если ИскКаталог.Имя = ИскКаталог.ИмяБезРасширения Тогда //проверим, что это каталог
//			Если Найти(СокрЛП(ИскКаталог.Имя)," ") <> 0 Тогда	//дубли	
//				РасшифровкаИмениКаталога=Лев(СокрЛП(ИскКаталог.Имя),Найти(СокрЛП(ИскКаталог.Имя)," "));
//		РасшифровкаИмениКаталога=Раскодировать64(РасшифровкаИмениКаталога);
//	РасшифровкаИмениКаталога = СокрЛП(СтрЗаменить(РасшифровкаИмениКаталога,"*"," "));

//				НайденныеФайлы = НайтиФайлы(ИскКаталог.ПолноеИмя,"*.tif");
//				Для Каждого Файл Из НайденныеФайлы Цикл
//	ИмяДубля = СтрЗаменить(КаталогОшибок+"\Дубль\"+РасшифровкаИмениКаталога+" "+ТекущаяДата()+".tif",":","");
//	КопироватьФайл(Файл.ПолноеИмя, ИмяДубля);
//	КонецЦикла;
//	Продолжить;			
//	КонецЕсли;	
//		РасшифровкаИмениКаталога=СокрЛП(ИскКаталог.Имя);
//	
//	РасшифровкаИмениКаталога=Раскодировать64(РасшифровкаИмениКаталога);
//	РасшифровкаИмениКаталога = СокрЛП(СтрЗаменить(РасшифровкаИмениКаталога,"*"," "));
//	
//	НайденныеФайлы = НайтиФайлы(ИскКаталог.ПолноеИмя,"*.tif");
//	ТаблицаФайлов = Новый ТаблицаЗначений;
//	ТаблицаФайлов.Колонки.Добавить("ПутьКФайлу");
//	ТаблицаФайлов.Колонки.Добавить("НомерСтраницы");
//	Для Каждого Файл Из НайденныеФайлы Цикл
//		СтрокаТЗ = ТаблицаФайлов.Добавить();
//		СтрокаТЗ.ПутьКФайлу = Файл.ПолноеИмя;
//		СтрокаТЗ.НомерСтраницы = Число(СтрЗаменить(СтрЗаменить(Файл.Имя,"страница",""),".tif",""));
//	КонецЦикла;
//	КонецЕсли;
//	
//	ТаблицаФайлов.Сортировать("номерСтраницы");
//	ПервыйФайл = Истина;
//	Индикатор = 0;
//	ЭлементыФормы.Индикатор.МаксимальноеЗначение = ТаблицаФайлов.Количество();
//	Для Каждого СтрокаТЗ Из ТаблицаФайлов Цикл
//		Индикатор = Индикатор + 1;
//		Если ПервыйФайл Тогда
//				ВидДокумента = Лев(РасшифровкаИмениКаталога,Найти(РасшифровкаИмениКаталога," ")-1);
//	Остаток = СтрЗаменить(РасшифровкаИмениКаталога,ВидДокумента + " ","");
//	НомерДокумента = Лев(Остаток,Найти(Остаток," ")-1);
//	Остаток = СтрЗаменить(Остаток,НомерДокумента + " ","");
//	Год = Лев(Остаток,2);
//	Каталог = ВидДокумента + " "+НомерДокумента+" "+Год;
//	Остаток = Прав(Остаток,СтрДлина(Остаток)-3);
//	НомерСтраницы = Лев(Остаток,Найти(Остаток," ")-1);
//	Остаток = СтрЗаменить(Остаток,НомерСтраницы + " ","");
//	ВсегоСтраниц = СтрЗаменить(Остаток,".tif","");
//	Если ВидДокумента = "СФ" Тогда
//		НомерДокументаРНК = НайтиНомерРНКПоСФ(НомерДокумента,Год);
//		Если  НомерДокументаРНК <> "" Тогда
//	Каталог = "РНК" + " "+НомерДокументаРНК+" "+Год;	
//КонецЕсли;
//	КонецЕсли;
//   ПервыйФайл = Ложь;
//   ИмяКаталогаДокумента = КаталогЗагрузки + "\"+ ВидДокумента+" "+НомерДокумента + " год 20"+Год;
//	СоздатьКаталог(КаталогЗагрузки +Каталог);
//  ИмяФайла =  ВидДокумента+" "+НомерДокумента + " год 20"+Год+" стр "+Формат(Число(НомерСтраницы),"ЧЦ=3; ЧВН=")+" из "+Формат(Число(ВсегоСтраниц),"ЧЦ=3; ЧВН=");
//  //проверка документа
//	Если ВидДокумента = "СФ" Тогда
//	Документ =  Документы.РасходнаяНакладная.НайтиПоНомеру(НомерДокументаРНК,Дата(2000+Год,1,1));
//Иначе
//Документ =  Документы.РасходнаяНакладная.НайтиПоНомеру(НомерДокумента,Дата(2000+Год,1,1));	
//КонецЕсли;
//Если Документ = Документы.РасходнаяНакладная.ПустаяСсылка() Тогда
//КопироватьФайл(СтрокаТЗ.ПутьКФайлу, КаталогОшибок+"\Нет документа в базе\"+ИмяФайла+".tif");	
//Продолжить;	
//КонецЕсли;
//Если Документ.СостояниеДокументов = Перечисления.СостояниеДокументов.Проверены Тогда
//	КопироватьФайл(СтрокаТЗ.ПутьКФайлу, КаталогОшибок+"\Уже провереные\"+ИмяФайла+".tif");
//		Продолжить;
//	КонецЕсли;
//	КопироватьФайл(СтрокаТЗ.ПутьКФайлу, КаталогЗагрузки +Каталог+"\"+ИмяФайла+".tif");
//	Если Документ.СостояниеДокументов <> Перечисления.СостояниеДокументов.ПолученоИзображение Тогда
//		Документ.УстановитьСостояниеДокументов(Перечисления.СостояниеДокументов.ПолученоИзображение);
//	КонецЕсли;
//	

//Иначе
//  ИмяОшибки = СтрЗаменить(КаталогОшибок+"\Ошибки\"+ТекущаяДата()+".tif",":","");
//  
//	КопироватьФайл(СтрокаТЗ.ПутьКФайлу, ИмяОшибки);
//КонецЕсли;
//	КонецЦикла;


////	КонецЦикла;
//	//ТЗ.Сортировать("НПП");
//	//Н = 1;
//	//Для Каждого СтрокаТЗ Из ТЗ Цикл
//	//КопироватьФайл(СтрокаТЗ.ИмяФайла, ИмяКаталогаДокумента+"\страница"+Н+".tif");
//	//Н = Н + 1;
////	КонецЦикла;
////СписокОтработанныхКаталогов.Добавить(Каталог.ПолноеИмя);
////	КонецЕсли;
//КонецЦикла;
// #Если клиент Тогда
// Сообщить("Обработка завершена");
// #КонецЕсли

//	КонецПроцедуры