Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//кухарь 21.11.13 начало
	//кухарь 20.12.13 исправление косяка начало
	#если клиент тогда
		//кухарь 20.12.13 исправление косяка конец
		если ЭтоНовый() тогда
			УстановитьНомерДокумента(ЭтотОбъект);
			//кухарь 09.03.17 начало
			//чтобы ХПС на ПРМ из ТЦ в ТЦ грузились нормально
			если ДокОбъект.Метаданные().Имя="Перемещение" тогда
				Склад=ДокОбъект.Склад;
				СкладПолучатель=ДокОбъект.СкладПолучатель;
			КонецЕсли;
			//кухарь 09.03.17 конец
			
			
		КонецЕсли;
		//кухарь 20.12.13 исправление косяка начало	
	#конецесли
	//кухарь 20.12.13 исправление косяка конец
	//кухарь 21.11.13 конец	
	
	НужноВыгружать=ложь;
	ЕстьИзменения=Модифицированность();
	Если Ссылка.ПометкаУдаления<>ПометкаУдаления или ЕстьИзменения Тогда
		НужноВыгружать=истина;
	иначе
		НужноВыгружать=Ложь;
	КонецЕсли;
	
	
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;	
	
КонецПроцедуры
