
Перем ПутиПапок Экспорт;
Перем ПутиФайлов Экспорт;
Перем ИмяПути Экспорт;
Перем Контрагент Экспорт;
Перем ТипШк Экспорт;
Перем КодМетро Экспорт; 
Перем Файлы Экспорт;
Перем Ошибки,ОшибкиН Экспорт;
Перем КритичОшибки,КритичОшибкиЛента,КритическиеОшибкиОзон,КритическиеОшибкиОзон2 Экспорт;
Перем ТЗПЕчать,ТЗШапка,АктШапка,АктТаблица Экспорт;
Перем Ашан Экспорт;
Перем НомПП;
Перем Отказ;
Перем ОшибкиАртикул;
Перем SQLiteObject;
Перем ОбщееКолЗаказов, СчОЗаказов;
Перем Док1, Док2;
Перем МкПл, МПКонтрагент, МПСклад, МПДоговор, МППунктДоставки Экспорт ;


// сделать загрузку для заказов больше 50 штук.	 

// eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJhY2Nlc3NJRCI6IjAwMmRiM2RiLWQ5ZjQtNDg3MS1iNmZiLTg4NDNiNWRjMDYxOSJ9.VZkFemOFmBKpu1jV69GRMtCXjGftP-hruVLvNd1AZyY
//ДляЛенты


Функция МакетВТаблицуЗначений(Макет, _ТЗ=Неопределено, флДобавлятьКолонки=истина) Экспорт
	Перем ТЗ;
	
	Если _ТЗ=Неопределено Тогда
		ТЗ=Новый ТаблицаЗначений();
		флЗаполняем=ложь;
	Иначе
		ТЗ=_ТЗ;
		флЗаполняем=истина;
	КонецЕсли;
	
	//Считываем колонки
	КоличествоКолонок=0;
	ИменаКолонок=Новый Массив();
	Кол=1;
	Пока истина Цикл
		Адрес="R1C"+Формат(Кол,"ЧГ=");
		ИмяКол=Макет.Область(Адрес).Текст;
		Если ПустаяСтрока(ИмяКол) Тогда
			Прервать;
		КонецЕсли;
		КоличествоКолонок=КоличествоКолонок+1;
		Если НЕ флЗаполняем или (флЗаполняем И флДобавлятьКолонки) И ТЗ.Колонки.Найти(ИмяКол)=Неопределено Тогда
			ТЗ.Колонки.Добавить(ИмяКол);
		КонецЕсли;
		ИменаКолонок.Добавить(ИмяКол);
		Кол=Кол+1;
	КонецЦикла;
	
	//Считываем строки
	Стр=2; Кол=1;
	Пока истина Цикл
		Вставлено=ложь; Первая=истина;
		Для Инд=1 По КоличествоКолонок Цикл
			Адрес="R"+Формат(Стр,"ЧГ=")+"C"+Формат(Инд,"ЧГ=");
			Зн=СокрЛП(Макет.Область(Адрес).Текст);
			Если ПустаяСтрока(Зн) Тогда
				Продолжить;
			КонецЕсли;
			Если Первая Тогда
				ТСтр=ТЗ.Добавить();
				Первая=ложь;
				Вставлено=истина;
			КонецЕсли;
			ИмяКолонки=ИменаКолонок[Инд-1];
			Если ТЗ.Колонки.Найти(ИмяКолонки)<>Неопределено Тогда
				Если флЗаполняем Тогда
					//Проверяем тип - число, строка, булево
					ОписаниеТипаКолонки=ТЗ.Колонки[ИмяКолонки].ТипЗначения;
					Если ОписаниеТипаКолонки.СодержитТип(Тип("Число")) Тогда
						РезЗн=Число(Зн);
					ИначеЕсли ОписаниеТипаКолонки.СодержитТип(Тип("Строка")) Тогда
						РезЗн=Строка(Зн);
					ИначеЕсли ОписаниеТипаКолонки.СодержитТип(Тип("Булево")) Тогда
						РезЗн=Булево(Зн);
					ИначеЕсли ОписаниеТипаКолонки.СодержитТип(Тип("Дата")) Тогда
						РезЗн=Дата(Зн);
					Иначе
						РезЗн=Зн;
					КонецЕсли;
				Иначе
					РезЗн=Зн;
				КонецЕсли;
				ТСтр[ИмяКолонки]=РезЗн;
			КонецЕсли;
		КонецЦикла;
		Если Не вставлено Тогда
			Прервать;
		КонецЕсли;
		Стр=Стр+1;
		Кол=1;
	КонецЦикла;
	
	Возврат ТЗ;
	
КонецФункции

//нечаева 13,01,15+++
Функция ПолучитьСдвигДатыАвизации(Документ)
	если 1=2 тогда
		документ=Документы.РасходнаяНакладная.НайтиПоНомеру();
	КонецЕсли;
	
	ДатаПД= Документ.ДатаПриемки-Документ.ПунктДоставки.ДнейВпути*24*3600;
	
	Сдвиг=0;
	если ДеньНедели(ДатаПд-Сдвиг)=6 тогда
		Сдвиг=Сдвиг+24*60*60; // пятница
	ИначеЕсли ДеньНедели(ДатаПд-Сдвиг)=7 тогда
		Сдвиг=Сдвиг+2*24*60*60;         // пятница
	КонецЕсли;
	
	
	
	
	//запрос=новый запрос;
	//запрос.текст="ВЫБРАТЬ различные 
	//|	ДопРеквизитыСправочников.ЗначениеРеквизита КАК ДеньНедели
	//|ИЗ
	//|	РегистрСведений.ДопРеквизитыСправочников КАК ДопРеквизитыСправочников
	//|ГДЕ
	//|	ДопРеквизитыСправочников.ИмяРеквизита = ""ДеньОтгрузкиДляРНК""
	//|	И ДопРеквизитыСправочников.Справочник = &Справочник
	//|	И ДопРеквизитыСправочников.ВспомогательноеЗначениеРеквизита=истина";
	//запрос.УстановитьПараметр("Справочник",Документ.ПунктДоставки);	
	//результат=запрос.Выполнить().Выгрузить();
	//если результат.Количество()=0 тогда
	//	Сдвиг=0;
	//	если ДеньНедели(Документ.ДатаОтгрузки+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=6 тогда
	//		Сдвиг=Сдвиг+24*60*60;
	//	ИначеЕсли ДеньНедели(Документ.ДатаОтгрузки+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=7 тогда
	//		Сдвиг=Сдвиг+2*24*60*60;
	//	КонецЕсли;
	//	
	//	возврат Сдвиг;
	//иначе
	//	тз=новый СписокЗначений;
	//	для Каждого СтрРезультата из результат цикл
	//		если СтрРезультата.деньнедели="Понедельник" тогда
	//			текдень=1;
	//		иначеесли СтрРезультата.деньнедели="Вторник" тогда
	//			текдень=2;
	//		иначеесли СтрРезультата.деньнедели="Среда" тогда
	//			текдень=3;
	//		иначеесли СтрРезультата.деньнедели="Четверг" тогда
	//			текдень=4;
	//		иначеесли СтрРезультата.деньнедели="Пятница" тогда
	//			текдень=5;
	//		иначеесли СтрРезультата.деньнедели="Суббота" тогда
	//			текдень=6;			
	//		иначеесли СтрРезультата.деньнедели="Воскресенье" тогда
	//			текдень=7;
	//		КонецЕсли;		
	//		тз.Добавить(текдень);		
	//	КонецЦикла;
	//	тз.СортироватьПоЗначению();
	//	для Каждого СтрСписка из тз цикл
	//		если ДеньНедели(Документ.ДатаОтгрузки)<=СтрСписка.Значение тогда
	//			НашлиСдвиг=Истина;
	//			Сдвиг=(СтрСписка.Значение-ДеньНедели(Документ.ДатаОтгрузки))*24*60*60;
	//			если ДеньНедели(Документ.ДатаОтгрузки+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=6 тогда
	//				Сдвиг=Сдвиг+24*60*60;
	//			ИначеЕсли ДеньНедели(Документ.ДатаОтгрузки+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=7 тогда
	//				Сдвиг=Сдвиг+2*24*60*60;
	//			КонецЕсли;
	//			возврат Сдвиг;
	//		КонецЕсли;
	//	КонецЦикла;
	//	Сдвиг=(тз.Получить(0).Значение+7-ДеньНедели(Документ.ДатаАвизации))*24*60*60;
	//	если ДеньНедели(Документ.ДатаАвизации+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=6 тогда
	//		Сдвиг=Сдвиг+24*60*60;
	//	ИначеЕсли ДеньНедели(Документ.ДатаОтгрузки+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=7 тогда
	//		Сдвиг=Сдвиг+2*24*60*60;
	//	КонецЕсли;
	//	
	//	возврат Сдвиг;
	
	//КонецЕсли;
	
	
	возврат сдвиг;	
	
	
КонецФункции
//нечаева 13,01,15---



//крохин начало
Функция ПолучитьДатуОплаты1(ДатаОтгрузки,ОтсрочкаПлатежа)  Экспорт
	Если   ДатаОтгрузки = '00010101000000' Тогда
		Возврат  '00010101000000'
	Иначе
		Если  ОтсрочкаПлатежа.ВидОтсрочки = Перечисления.ВидыОтсрочки.БанковскиеДни Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	КалендарьДни.Дата КАК Дата
			|ИЗ
			|	Справочник.Календарь.Дни КАК КалендарьДни
			|ГДЕ
			|	КалендарьДни.Дата >= &ДатаОтгрузки
			|	И КалендарьДни.Часы <> 0
			|	И (НЕ КалендарьДни.Ссылка.ПометкаУдаления)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата
			|АВТОУПОРЯДОЧИВАНИЕ";
			Запрос.УстановитьПараметр("ДатаОтгрузки",ДатаОтгрузки);
			Выборка = Запрос.Выполнить().Выбрать();
			НПП = 0;
			Пока Выборка.Следующий() Цикл
				
				Если НПП = ОтсрочкаПлатежа.Отсрочка Тогда
					Возврат Выборка.Дата;	
				Конецесли;
				НПП = НПП + 1;
			КонецЦикла;
			
			Возврат ДатаОтгрузки+ОтсрочкаПлатежа.Отсрочка*24*60*60;		
		Иначе		
			Возврат ДатаОтгрузки+ОтсрочкаПлатежа.Отсрочка*24*60*60;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции
//крохин конец



Функция УбратьНули(Номер,Признак)
	// убираем лидирующие нули, если стоит признак в контрагенте
	Если Не Признак Тогда
		возврат Номер;
	КонецЕсли;
	
	Для НН=1 по СтрДлина(Номер) Цикл
		Проверка=Лев(Номер,1);
		Если Проверка="0" Тогда
			Номер=Прав(Номер,СтрДлина(Номер)-1);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Номер;
	
КонецФункции

//  Процедура определяет ситуацию, когда при изменении своей даты документ 
//  оказывается в другом периоде нумерации документов, и в это м случае
//  присваивает документу новый уникальный номер.
//
// Параметры:
//  ДокументОбъект         - контекст документа,из которого вызвана процедура 
//  НачальнаяДатаДокумента - начальная дата документа 
// 
Функция ПроверитьНомерДокумента2(ДокументОбъект, НачальнаяДатаДокумента,Предупреждать=Истина) Экспорт   // в разработке
	
	// Определяем назначенную для данного вида документов периодичность смены номера
	ПериодСменыНомера = ДокументОбъект.Метаданные().ПериодичностьНомера;
	
	//В зависимости от установленной периодичности смены номеров,
	//определяем разность старой и новой датами документа.
	РазностьДат=0;
	
	Если ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Год Тогда
		РазностьДат = НачалоГода(НачальнаяДатаДокумента) - НачалоГода(ДокументОбъект.Дата);
		
	ИначеЕсли ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Квартал Тогда
		РазностьДат = НачалоКвартала(НачальнаяДатаДокумента) - НачалоКвартала(ДокументОбъект.Дата);
		
	ИначеЕсли ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Месяц Тогда
		РазностьДат = НачалоМесяца(НачальнаяДатаДокумента) - НачалоМесяца(ДокументОбъект.Дата);
		
	ИначеЕсли ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.День Тогда
		РазностьДат = НачальнаяДатаДокумента - ДокументОбъект.Дата; 
	КонецЕсли;
	
	Если РазностьДат <> 0 Тогда
		Если Предупреждать Тогда
			//Ответ=Вопрос("Изменена дата документа ! Номер документа будет изменен ! Продолжать ?",РежимДиалогаВопрос.ДаНет);
			//Если Ответ<>КодВозвратаДиалога.Да Тогда
			//	Возврат Ложь;			
			//КонецЕсли;
		КонецЕсли;		
		УстановитьНомерДокумента2(ДокументОбъект);
	КонецЕсли;
	
	Возврат Истина;
КонецФункции// ПроверитьНомерДокумента()

Функция ПерваяСФ2(Префикс,Дата)Экспорт 
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ
	|	Документ.СчетФактура КАК СчетФактура
	|ГДЕ
	|	Дата МЕЖДУ &Дата1 И &Дата2
	|	И Номер ПОДОБНО &Номер
	|	И НЕ ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Дата));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата));
	Запрос.УстановитьПараметр("Номер",Префикс+"%");		
	
	Возврат Запрос.Выполнить().Пустой();
КонецФункции //ПерваяСФ(Префикс,Дата)

// Процедура устанавливает номер документа.
//
// Параметры:
//  ДокументОбъект  - ДокументОбъект. Экземпляр документа, которому 
//                    необходимо присвоить новый номер
//
Функция УстановитьНормальныйНовыйНомер2(ДокументОбъект,Префикс,КоличествоПропусков=0)Экспорт 
	МетаДок=ДокументОбъект.Метаданные();	
	Периодичность=МетаДок.ПериодичностьНомера;
	ДлинаЧисловойЧасти=МетаДок.ДлинаНомера-СтрДлина(СокрЛП(Префикс));;
	
	Если МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Год Тогда
		Дата1=НачалоГода(ДокументОбъект.Дата);	
		Дата2=КонецГода(ДокументОбъект.Дата);	
	ИначеЕсли МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Квартал Тогда
		Дата1=НачалоКвартала(ДокументОбъект.Дата);	
		Дата2=КонецКвартала(ДокументОбъект.Дата);					
	ИначеЕсли МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Месяц Тогда
		Дата1=НачалоМесяца(ДокументОбъект.Дата);	
		Дата2=КонецМесяца(ДокументОбъект.Дата);					
	ИначеЕсли МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.День Тогда
		Дата1=НачалоДня(ДокументОбъект.Дата);	
		Дата2=КонецДня(ДокументОбъект.Дата);
	Иначе
		Дата1=Неопределено;		
		Дата2=Неопределено;
	КонецЕсли;
	
	Шаблон=СокрЛП(Префикс);
	Для Сч=1 По ДлинаЧисловойЧасти Цикл
		Шаблон=Шаблон+"[0-9]";	
	КонецЦикла;
	Запрос=Новый Запрос;
	
	Запрос.Текст="
	|ВЫБРАТЬ
	|	МАКСИМУМ(Номер) КАК Номер
	|ИЗ
	|	Документ."+МетаДок.Имя+"
	|ГДЕ
	|	"+?(Дата1=Неопределено,"","Дата МЕЖДУ &Дата1 И &Дата2 И ")+"
	|	Номер ПОДОБНО &Шаблон";
	
	Запрос.УстановитьПараметр("Шаблон",Шаблон);
	
	Если Дата1<>Неопределено Тогда
		Запрос.УстановитьПараметр("Дата1",Дата1);
		Запрос.УстановитьПараметр("Дата2",Дата2);
	КонецЕсли;
	
	НомерДока		=Неопределено;
	ПоследнийНомер =0;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.Номер) Тогда
			НомерДока		=Выборка.Номер;
			ПоследнийНомер	=Число(СтрЗаменить(Выборка.Номер,СокрЛП(Префикс),""));
		КонецЕсли;		
	КонецЕсли;	
	
	Коэффициент=1;
	Если НомерДока<>Неопределено Тогда	
		ПоследнийДок=Документы[МетаДок.Имя].НайтиПоНомеру(НомерДока,ДокументОбъект.Дата);
		Если ПоследнийДок<>Неопределено Тогда
			Коэффициент=Цел(Макс(1,(КонецДня(ДокументОбъект.Дата)-КонецДня(ПоследнийДок.Дата))/(24*60*60)));
		КонецЕсли;
	КонецЕсли;
	
	ДокументОбъект.Номер=СокрЛП(Префикс)+Формат(ПоследнийНомер+1+КоличествоПропусков*Коэффициент,"ЧЦ="+ДлинаЧисловойЧасти+"; ЧВН=");
КонецФункции //УстановитьНормальныйНовыйНомер(ДокументОбъект,Префикс,КоличествоПропусков=0)

// Процедура устанавливает номер документа.
//
// Параметры:
//  ДокументОбъект  - ДокументОбъект. Экземпляр документа, которому 
//                    необходимо присвоить новый номер
//
Процедура УстановитьНомерДокумента2(ДокументОбъект) Экспорт
	// Если  нет реквизита "Организация" или для нее не задан префикс, то 
	// используем пустой префикс,
	// иначе используем префикс организации.
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	ДопБуква="";
	Если МетаданныеДокумента.Имя="РасходнаяНакладная" Тогда
		ДопБуква=?(ДокументОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН,"б","а");
	ИначеЕсли МетаданныеДокумента.Имя="ОтчетКассовойСмены" Тогда
		ДопБуква=?(ДокументОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН,"кб","кн");	
	КонецЕсли; 
	
	Вид=МетаданныеДокумента.Имя;
	Если Вид="ЛистНабора" Тогда
		ДокументОбъект.УстановитьНовыйНомер(СокрЛП(ДокументОбъект.ДокОснование.Номер)+"/");
	ИначеЕсли Вид="СчетФактура" Тогда 		
		Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
			Префикс=ПараметрыСеанса.ЭтотУзел.Код;
		Иначе
			ПрефиксКонтрагента="";
			
			Если ДокументОбъект.Накладные.Количество()>0 Тогда
				Накладная=ДокументОбъект.Накладные[0].Накладная;
				Если ЕстьРеквизитДокумента("ПунктДоставки",Накладная.Метаданные()) И ЗначениеЗаполнено(Накладная.ПунктДоставки.ПрефиксСФ) Тогда
					ПрефиксКонтрагента=СокрЛП(Накладная.ПунктДоставки.ПрефиксСФ);
				КонецЕсли;			
			КонецЕсли;			
			
			Если ПустаяСтрока(ПрефиксКонтрагента) Тогда
				ПрефиксКонтрагента=СокрЛП(ПолучитьРеквизитРодителя(ДокументОбъект.Контрагент,"ПрефиксСФ"));			
			КонецЕсли; 
			
			Если ПустаяСтрока(ПрефиксКонтрагента) Тогда
				ПрефиксСклада	=СокрЛП(ДокументОбъект.Склад.Префикс);
				ПрефиксИБ		=СокрЛП(ДокументОбъект.Склад.ПрефиксИБ);
				
				Если ПрефиксИБ="SNL" Тогда
					Префикс=ПрефиксИБ;
				Иначе
					Префикс=?(НЕ ПустаяСтрока(ДокументОбъект.Организация.Префикс),СокрЛП(ДокументОбъект.Организация.Префикс)+ПрефиксСклада,ДокументОбъект.ИБ.Код);				
				КонецЕсли;				
			Иначе				
				Префикс=?(НЕ ПустаяСтрока(ДокументОбъект.Организация.Префикс),СокрЛП(ДокументОбъект.Организация.Префикс)+ПрефиксКонтрагента,ДокументОбъект.ИБ.Код);			
			КонецЕсли;			
		КонецЕсли; 
		
		Если ПерваяСФ2(Префикс,ДокументОбъект.Дата) Тогда
			Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
				КоличествоПропусков=2;			
			ИначеЕсли Лев(Префикс,2)="КБ" Тогда
				КоличествоПропусков=4;
			Иначе	
				КоличествоПропусков=1;						
			КонецЕсли;			
		Иначе
			КоличествоПропусков=0;
		КонецЕсли;
		
		//Если Префикс = "SSP" тогда Префикс = "SST" КонецЕсли;
		
		УстановитьНормальныйНовыйНомер2(ДокументОбъект,Префикс+"-",КоличествоПропусков);
	ИначеЕсли ЕстьРеквизитДокумента("ИБ",МетаданныеДокумента) Тогда
		ЭтотУзел=ПараметрыСеанса.ЭтотУзел;
		
		Если МетаданныеДокумента.Имя="РасходнаяНакладная" И СокрЛП(ДокументОбъект.Контрагент.Код)="SSP-8643" Тогда		
			
			//КодИБ="SSP";
			
			КодИБ = "SSP";
			// нечаева 29,06,15+++
			ПрефиксИБ = "SSP";
			// нечаева 29,06,15-
			
			
			
			//Нечаева 03.12.19+
			Если ДокументОбъект.Дата>Дата(2019,12,01) и ДокументОбъект.Дата<Дата(2020,01,01) Тогда
				КодИБ = "SST";
				ПрефиксИБ="SST";
			иначе
				КодИБ = "SSP";
				// нечаева 29,06,15+++
				ПрефиксИБ = "SSP";
				// нечаева 29,06,15---
			КонецЕсли;
			//Нечаева 13,12,18--
			
		Иначе
			Если ЕстьРеквизитДокумента("Склад",МетаданныеДокумента) Тогда
				ПрефиксИБ=ДокументОбъект.Склад.ПрефиксИБ;
				
				ПрефиксИБ = "SSP";
				
				//
				//Если ДокументОбъект.Дата>Дата(2015,06,28) и ДокументОбъект.Дата<Дата(2016,01,01) Тогда
				//	
				//	ПрефиксИБ="SST";
				//иначе
				//	
				//	// нечаева 29,06,15+++
				//	ПрефиксИБ = "SSP";
				//	// нечаева 29,06,15---
				//КонецЕсли;
				//		
				
				
				//крохин начало 02.08.2021
				////Нечаева 13,12,18++
				//Если ДокументОбъект.Дата>Дата(2020,12,01) и ДокументОбъект.Дата<Дата(2021,01,01) Тогда
				//	КодИБ = "SST";
				//	ПрефиксИБ="SST";
				//иначе
				//	КодИБ = "SSP";
				//	// нечаева 29,06,15+++
				//	ПрефиксИБ = "SSP";
				//	// нечаева 29,06,15---
				//КонецЕсли;
				////Нечаева 13,12,18--
				Если ДеньГода(ДокументОбъект.Дата) > 334 Тогда
					КодИБ = "SST";
					ПрефиксИБ="SST";
				ИначеЕсли ДеньГода(ДокументОбъект.Дата) > 181 Тогда
					КодИБ = "SSV";
					ПрефиксИБ="SSV";	
				иначе
					КодИБ = "SSP";
					ПрефиксИБ = "SSP";
				КонецЕсли;

				//крохин конец 02.08.2021
				
				
				
				
			КонецЕсли;		
			Если ПустаяСтрока(ПрефиксИБ) Тогда
				ПрефиксИБ=ДокументОбъект.ИБ.Код;			
			КонецЕсли; 
			
			КодИБ=?(ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение,ПрефиксИБ,ЭтотУзел.Код);	
			//крохин начало 10.01.2015
			//пока не надо
			//Если КодИБ="SSP" Тогда КодИБ = "SST" КонецЕсли;
			//крохин конец 10.01.2015
			
			
		КонецЕсли;		
		
		Если МетаданныеДокумента.Имя="ПриходнаяНакладная" И КодИБ="SSP" Тогда
			ДокументОбъект.УстановитьНовыйНомер(КодИБ+"-0");
		Иначе
			ДокументОбъект.УстановитьНовыйНомер(КодИБ+ДопБуква+"-");
		КонецЕсли;		
	ИначеЕсли Вид="УслугиСтороннихОрганизаций" Тогда
		Префикс=ДокументОбъект.Организация.Префикс+"-";
		ДокументОбъект.УстановитьНовыйНомер(Префикс);
	Иначе
		попытка
			КодИБ=ПараметрыСеанса.ЭтотУзел.Код;
			
			ДокументОбъект.УстановитьНовыйНомер(КодИБ+"-");	
			
		исключение
		конецПопытки;
	КонецЕсли;	
КонецПроцедуры // УстановитьНомерДокумента()

Функция КоличествоПД2(Контрагент) Экспорт
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ссылка) КАК Количество
		|ИЗ
		|	Справочник.ПунктыДоставки КАК ПунктыДоставки
		|ГДЕ
		|	Владелец = &Владелец";
		
		Запрос.УстановитьПараметр("Владелец",Контрагент);
		
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Количество;			
		КонецЕсли;		
	КонецЕсли;
	
	Возврат 0;
КонецФункции //КоличествоПД(Контрагент)

Функция ПолучитьДоговорыКорагента(Контрагент,Организация=Неопределено)
	МассивДоговоров=Новый Массив;
	
	КодЦБ=?(ПустаяСтрока(Контрагент.КодЦБ),Контрагент.Код,Контрагент.КодЦБ);
	
	Выборка=Справочники.Договоры.Выбрать(,,Новый Структура("КодЦБ",КодЦБ));
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка.неиспользовать тогда
			продолжить;
		КонецЕсли;	
		МассивДоговоров.Добавить(Выборка.Ссылка);
	КонецЦикла; 
	
	Возврат МассивДоговоров;
КонецФункции // ПолучитьДОговорыКорагента()



Процедура Притормозить(Н)
	Если Н  = 1  Тогда
		ВремяНачала = ТекущаяДата();
		ВремяОкончания = ВремяНачала +Н;
		Пока ВремяОкончания >= ТекущаяДата() Цикл
			
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

//**************************************************************************************************************************************************


Процедура СообщитьМенеджеруОзон(Док) Экспорт
	
	//Если ПараметрыСеанса.Отладка Тогда
	//	Возврат;
	//КонецЕсли;
	
	//Менеджер=СтрШапка.контрагент.Менеджер;
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
	//	Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//	Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Иначе
	//	Профиль.АдресСервераPOP3   = "87.236.190.180";
	//	Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//КонецЕсли;
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);		 
	// Кухарь А.Ю.  08.09.2022 конец

	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	//---------------------------------------------------------------
	//Попытка
	//	ИмяФайлаПечати=ФормированиеПечати(ТЗПечать,ТЗШапка); //+++
	//Исключение
	//	КритичОшибки.Добавить("Не сформирован файл печати! "+Символ(13));
	//КонецПопытки;
	
	// и прикрепляем файл;
	
	//----------------------------------------------------------------
	Сообщение=новый интернетПочтовоеСообщение;
	//Если НЕ Сокрлп(Менеджер.ЕМэйл)=""  тогда
	//	Если Менеджер.Штатный Тогда
	//		Сообщение.Получатели.Добавить(Менеджер.ЕМэйл);
	//	КонецЕсли;
	//	
	//конецесли;
	//---------------------------------------------------
	// получаем заместителей, для отправки из справочника пользователи.
	//Запрос=Новый Запрос;
	//Запрос.Текст="ВЫБРАТЬ
	//|	ПользователиЗаместители.Заместитель,
	//|	ПользователиЗаместители.Заместитель.ЕМэйл  как ЗамЕМэйл
	//|ИЗ
	//|	Справочник.Пользователи.Заместители КАК ПользователиЗаместители
	//|ГДЕ
	//|	ПользователиЗаместители.Ссылка.ФизЛицо = &ТекМенеджер";
	//Запрос.УстановитьПараметр("ТекМенеджер",Менеджер);
	//Результат=Запрос.Выполнить().Выбрать();
	//Пока Результат.Следующий() Цикл
	//	Если СтрДлина(Результат.ЗамЕМэйл)>5 Тогда
	//		Если Результат.Заместитель.Штатный Тогда
	//			Сообщение.Получатели.Добавить(Результат.ЗамЕМэйл);
	//		КонецЕсли;
	//				Иначе
	//		КритичОшибки.Добавить("Для менеджера (зам)"+Результат.Заместитель.Наименование+" не определен ЕМэйл. "+Символ(13));
	//	КонецЕсли;
	//КонецЦикла;	
	
	//Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	Сообщение.Получатели.Добавить("egorova_k@collant.ru");
	Сообщение.Получатели.Добавить("kulagina@collant.ru");
	Сообщение.Получатели.Добавить("yamshikova@collant.ru");

	
	//Нечаева 11,03,19+++
	//-----------------------------------------------
	//// если есть ошибки какие-то то сообщать ассистентам.
	//Если Ошибки.Количество()>0 Тогда
	//
	//		Запрос=Новый Запрос;
	//		Запрос.Текст="ВЫБРАТЬ
	//		|	УведомленияПоЕкоду.Пользователь
	//		|ИЗ
	//		|	РегистрСведений.УведомленияПоЕкоду КАК УведомленияПоЕкоду
	//		|ГДЕ
	//		|	УведомленияПоЕкоду.Контрагент = &ТекКонтр
	//		|	И УведомленияПоЕкоду.ТипУведомления = &ТипУвед";
	//		Запрос.УстановитьПараметр("ТекКонтр",СтрШапка.контрагент);
	//		Запрос.УстановитьПараметр("ТипУвед","заказ");
	//		Результат=Запрос.Выполнить().Выбрать();
	//		Пока Результат.Следующий() Цикл
	//			Попытка	
	//				Если СтрДлина(Результат.Пользователь)>5 Тогда
	//					Сообщение.Получатели.Добавить(Результат.Пользователь.ЕМэйл);
	//				Иначе
	//					КритичОшибки.Добавить("Для менеджера (зам)"+Результат.Пользователь.Наименование+" не определен ЕМэйл. "+Символ(13));
	//				КонецЕсли;
	//			Исключение	
	//				ошибки.Добавить(" добавление адресов - ошибка "+ОписаниеОшибки());
	//				Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	//			КонецПопытки;	
	//			
	//		КонецЦикла;
	//		
	//		
	//КонецЕсли;
	
	//-----------------------------------------------
	//Нечаева 11,03,19---
	
	
	//Если Сообщение.Получатели.Количество() = 0 Тогда
	//	Если Менеджер = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
	//		КритичОшибки.Добавить("У Контрагента "+СтрШапка.контрагент+" не определен менеждер. "+Символ(13));
	//	Иначе
	//		КритичОшибки.Добавить("У менеджера "+Менеджер+" и его заместителей не определен ЕМэйл. "+Символ(13));
	//	КонецЕсли;
	//	Возврат
	//КонецЕсли;
	Сообщение.Отправитель="ecode@collant.ru";
	
	//ПунктДоставки=СтрШапка.ПунктДоставки;
	//
	//Если ПунктДоставки=Неопределено тогда
	//	ПунктДоставки="";
	//Конецесли;	
	
	Сообщение.Тема="Автообмен Ecode. Новый заказ из ИМ Вайлдберриз № "+Док.номерЗаказа;
	Строка=Символ(13)+Символ(13)+"       Добрый день!"; //+Символ(13)+Символ(13)+Строка("Новый заказ ИМ Озон № "+Док.номерЗаказа+".")+
	//+Символы.ПС+"Сформировано новое РНК № "+Док.номер+" "+Док.Дата+"."+Символ(13)+Символ(13);
	//Для рр=0 по файлы.Количество()-1 Цикл
	//	Строка=Строка+символы.ПС+Файлы[рр];
	//КонецЦикла;
	
	
	НомСтр=1;
	//Строка=Строка+Символы.ПС+символы.ПС+"Фактический адрес, пунк доставки: "+СтрШапка.ПунктДоставки;
	Строка=Строка+Символы.ПС;
	Если КритическиеОшибкиОзон.количество()>1 Тогда
		Строка=Строка+Символы.ПС+"Сообщения по загрузке данных:";
	КонецЕсли;	
	Если НЕ КритическиеОшибкиОзон=Неопределено и КритическиеОшибкиОзон.Количество()>0 Тогда
		Для рр=0 по КритическиеОшибкиОзон.Количество()-1 Цикл
			Строка=Строка+Символы.ПС+НомСтр+". "+КритическиеОшибкиОзон[рр];
			Строка=Строка+Символы.ПС;
			НомСтр=НомСтр+1;
		КонецЦикла;
	конецЕсли;
	Строка=Строка+Символы.ПС+"________________________________________________________________";
	
	Сообщение.Тексты.Добавить(Строка);
	
	//Сообщение.Вложения.Добавить(ПутьФайла);
	//Попытка
	//	Сообщение.Вложения.Добавить(ИмяФайлаПечати);     //+++
	//Исключение
	//	КритичОшибки.Добавить("Не возможно добавить файл печати для заказа "+СтрШапка.НомЗаказа+". Контрагент - "+СтрШапка.контрагент+".  "+ОписаниеОшибки() );
	//КонецПопытки;
	//
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
	исключение
		КритичОшибки.Добавить("Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки() );
		#Если клиент тогда
			сообщить("Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки());
		#КонецЕсли	

	конецПопытки;
	Попытка
		Почта.Послать(Сообщение);
	исключение
		
		//КритичОшибки.Добавить("Не возможно отправить сообщение!   "+ОписаниеОшибки() );
		////Катаев+ 27/02/14 Катаев+
		//КритичОшибки.Добавить("Узел - "+ПланыОбмена.Основной.ЭтотУзел());
		//КритичОшибки.Добавить("Менеджер - "+Менеджер);
		//КритичОшибки.Добавить("Заказ ЕКОД - "+СтрШапка.номЗаказа);
		////Катаев- 27/02/14
		//для каждого пол из сообщение.Получатели цикл
		//КритичОшибки.Добавить("Получатель="+пол+" "+пол.ОтображаемоеИмя);
		//конеццикла;
		
		КритичОшибки.Добавить("Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки() );
		#Если клиент тогда
			сообщить("ошибка при отправки сообщений ! "+ОписаниеОшибки());
		#КонецЕсли	

	конецПопытки;
	Почта.Отключиться();
	//	УдалитьФайлы(ИмяФайлаПечати);     //+++
	
КонецПроцедуры

Процедура СообщитьМенеджеру(Док) Экспорт
	
	//Если ПараметрыСеанса.Отладка Тогда
	//	Возврат;
	//КонецЕсли;
	
	//Менеджер=СтрШапка.контрагент.Менеджер;
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
	//	Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//	Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Иначе
	//	Профиль.АдресСервераPOP3   = "87.236.190.180";
	//	Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//КонецЕсли;
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);		 
	// Кухарь А.Ю.  08.09.2022 конец

	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	//---------------------------------------------------------------
	//Попытка
	//	ИмяФайлаПечати=ФормированиеПечати(ТЗПечать,ТЗШапка); //+++
	//Исключение
	//	КритичОшибки.Добавить("Не сформирован файл печати! "+Символ(13));
	//КонецПопытки;
	
	// и прикрепляем файл;
	
	//----------------------------------------------------------------
	Сообщение=новый интернетПочтовоеСообщение;
	//Если НЕ Сокрлп(Менеджер.ЕМэйл)=""  тогда
	//	Если Менеджер.Штатный Тогда
	//		Сообщение.Получатели.Добавить(Менеджер.ЕМэйл);
	//	КонецЕсли;
	//	
	//конецесли;
	//---------------------------------------------------
	// получаем заместителей, для отправки из справочника пользователи.
	//Запрос=Новый Запрос;
	//Запрос.Текст="ВЫБРАТЬ
	//|	ПользователиЗаместители.Заместитель,
	//|	ПользователиЗаместители.Заместитель.ЕМэйл  как ЗамЕМэйл
	//|ИЗ
	//|	Справочник.Пользователи.Заместители КАК ПользователиЗаместители
	//|ГДЕ
	//|	ПользователиЗаместители.Ссылка.ФизЛицо = &ТекМенеджер";
	//Запрос.УстановитьПараметр("ТекМенеджер",Менеджер);
	//Результат=Запрос.Выполнить().Выбрать();
	//Пока Результат.Следующий() Цикл
	//	Если СтрДлина(Результат.ЗамЕМэйл)>5 Тогда
	//		Если Результат.Заместитель.Штатный Тогда
	//			Сообщение.Получатели.Добавить(Результат.ЗамЕМэйл);
	//		КонецЕсли;
	//				Иначе
	//		КритичОшибки.Добавить("Для менеджера (зам)"+Результат.Заместитель.Наименование+" не определен ЕМэйл. "+Символ(13));
	//	КонецЕсли;
	//КонецЦикла;	
	
	//Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	//Сообщение.Получатели.Добавить("egorova@collant.ru");
	Сообщение.Получатели.Добавить("yamshikova@collant.ru");
	Сообщение.Получатели.Добавить("egorova_k@collant.ru");
	
	//Нечаева 11,03,19+++
	//-----------------------------------------------
	//// если есть ошибки какие-то то сообщать ассистентам.
	//Если Ошибки.Количество()>0 Тогда
	//
	//		Запрос=Новый Запрос;
	//		Запрос.Текст="ВЫБРАТЬ
	//		|	УведомленияПоЕкоду.Пользователь
	//		|ИЗ
	//		|	РегистрСведений.УведомленияПоЕкоду КАК УведомленияПоЕкоду
	//		|ГДЕ
	//		|	УведомленияПоЕкоду.Контрагент = &ТекКонтр
	//		|	И УведомленияПоЕкоду.ТипУведомления = &ТипУвед";
	//		Запрос.УстановитьПараметр("ТекКонтр",СтрШапка.контрагент);
	//		Запрос.УстановитьПараметр("ТипУвед","заказ");
	//		Результат=Запрос.Выполнить().Выбрать();
	//		Пока Результат.Следующий() Цикл
	//			Попытка	
	//				Если СтрДлина(Результат.Пользователь)>5 Тогда
	//					Сообщение.Получатели.Добавить(Результат.Пользователь.ЕМэйл);
	//				Иначе
	//					КритичОшибки.Добавить("Для менеджера (зам)"+Результат.Пользователь.Наименование+" не определен ЕМэйл. "+Символ(13));
	//				КонецЕсли;
	//			Исключение	
	//				ошибки.Добавить(" добавление адресов - ошибка "+ОписаниеОшибки());
	//				Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	//			КонецПопытки;	
	//			
	//		КонецЦикла;
	//		
	//		
	//КонецЕсли;
	
	//-----------------------------------------------
	//Нечаева 11,03,19---
	
	
	//Если Сообщение.Получатели.Количество() = 0 Тогда
	//	Если Менеджер = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
	//		КритичОшибки.Добавить("У Контрагента "+СтрШапка.контрагент+" не определен менеждер. "+Символ(13));
	//	Иначе
	//		КритичОшибки.Добавить("У менеджера "+Менеджер+" и его заместителей не определен ЕМэйл. "+Символ(13));
	//	КонецЕсли;
	//	Возврат
	//КонецЕсли;
	Сообщение.Отправитель="ecode@collant.ru";
	
	//ПунктДоставки=СтрШапка.ПунктДоставки;
	//
	//Если ПунктДоставки=Неопределено тогда
	//	ПунктДоставки="";
	//Конецесли;	
	
	Сообщение.Тема="Автообмен Ecode. Новый заказ из ИМ Вайлдберриз № "+Док.номерЗаказа;
	Строка=Символ(13)+Символ(13)+"       Добрый день!"+Символ(13)+Символ(13)+Строка("Новый заказ ИМ Вайлдберриз № "+Док.номерЗаказа+".")+
	+Символы.ПС+"Сформировано новое РНК № "+Док.номер+" "+Док.Дата+"."+Символ(13)+Символ(13);
	Для рр=0 по файлы.Количество()-1 Цикл
		Строка=Строка+символы.ПС+Файлы[рр];
	КонецЦикла;
	
	
	НомСтр=1;
	//Строка=Строка+Символы.ПС+символы.ПС+"Фактический адрес, пунк доставки: "+СтрШапка.ПунктДоставки;
	Строка=Строка+Символы.ПС;
	Если Ошибки.количество()>1 Тогда
		Строка=Строка+Символы.ПС+"Сообщения по загрузке данных:";
	КонецЕсли;	
	Если НЕ Ошибки=Неопределено и ошибки.Количество()>0 Тогда
		Для рр=0 по ошибки.Количество()-1 Цикл
			Строка=Строка+Символы.ПС+НомСтр+". "+Ошибки[рр];
			Строка=Строка+Символы.ПС;
			НомСтр=НомСтр+1;
		КонецЦикла;
	конецЕсли;
	Строка=Строка+Символы.ПС+"________________________________________________________________";
	
	Сообщение.Тексты.Добавить(Строка);
	
	//Сообщение.Вложения.Добавить(ПутьФайла);
	//Попытка
	//	Сообщение.Вложения.Добавить(ИмяФайлаПечати);     //+++
	//Исключение
	//	КритичОшибки.Добавить("Не возможно добавить файл печати для заказа "+СтрШапка.НомЗаказа+". Контрагент - "+СтрШапка.контрагент+".  "+ОписаниеОшибки() );
	//КонецПопытки;
	//
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
	исключение
		КритичОшибки.Добавить("Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки() );
		#Если клиент тогда
			сообщить("Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки());
		#КонецЕсли	
	конецПопытки;
	Попытка
		Почта.Послать(Сообщение);
	исключение
		
		//КритичОшибки.Добавить("Не возможно отправить сообщение!   "+ОписаниеОшибки() );
		////Катаев+ 27/02/14 Катаев+
		//КритичОшибки.Добавить("Узел - "+ПланыОбмена.Основной.ЭтотУзел());
		//КритичОшибки.Добавить("Менеджер - "+Менеджер);
		//КритичОшибки.Добавить("Заказ ЕКОД - "+СтрШапка.номЗаказа);
		////Катаев- 27/02/14
		//для каждого пол из сообщение.Получатели цикл
		//КритичОшибки.Добавить("Получатель="+пол+" "+пол.ОтображаемоеИмя);
		//конеццикла;
		#Если клиент тогда
			сообщить("ошибка при отправке сообщений ! "+ОписаниеОшибки());
		#КонецЕсли	

		
	конецПопытки;
	Почта.Отключиться();
	//	УдалитьФайлы(ИмяФайлаПечати);     //+++
	
КонецПроцедуры


//нечаева  28,08,19 добавлен ШКконтаргента дополнительный по GS1
Функция НайтиПОШКМатрица2(ШК,Артикул,Контрагент)Экспорт
	
	
	НайденнаяНоменклатура=Справочники.Номенклатура.ПустаяСсылка();
	//---------------------------------------------------------------------------
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Матрица.Ссылка КАК Ссылка1
	|ИЗ
	|	Документ.Матрица.ПунктыДоставки КАК Матрица
	|ГДЕ
	|	Матрица.Ссылка.Контрагент = &Контрагент
	|	И Матрица.Ссылка.Дата <= &Дата1
	|	И Матрица.Ссылка.ДатаОкончания >= &Дата2
	|	И Матрица.Ссылка.Договор = &Договор
	|	И Матрица.Ссылка.Проведен = ИСТИНА
	|	И Матрица.ПунктДоставки = &ПДИМ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	
	Запрос.УстановитьПараметр("Дата2",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Дата1",КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("Договор",МПДоговор);
	Запрос.УстановитьПараметр("ПДИМ",МППунктДоставки);  // фбс озон
	
	ТЗЕстьМатрицаПоДоговору = Запрос.Выполнить().Выгрузить();
	
	
	Если Артикул <> Неопределено Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура,
		|	МатрицаТовары.ШККонтрагента,
		|	МатрицаТовары.АртикулКонтрагента,
		|	МатрицаТовары.Цена
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
		|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА
		|	И МатрицаТовары.АртикулКонтрагента ПОДОБНО &ТекАрт
		|	И МатрицаТовары.Ссылка В ИЕРАРХИИ(&спМатриц)";
		
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТекАрт","%"+Строка(Артикул)+"%");
		Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
		Запрос.УстановитьПараметр("спМатриц",ТЗЕстьМатрицаПоДоговору);
		
		Рез=Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() Тогда
			Возврат Рез.Номенклатура;
		КонецЕсли;
	КонецЕсли;
	
	// ищем по ШК
	//Запрос=Новый Запрос;
	//Запрос.Текст="ВЫБРАТЬ
	//             |	МатрицаТовары.Номенклатура КАК Номенклатура,
	//             |	МатрицаТовары.ШККонтрагента КАК ШККонтрагента,
	//             |	МатрицаТовары.ШККонтрагентаДополнительный КАК ШККонтрагентаДополнительный,
	//             |	МатрицаТовары.АртикулКонтрагента КАК АртикулКонтрагента,
	//             |	МатрицаТовары.Цена КАК Цена
	//             |ИЗ
	//             |	Документ.Матрица.Товары КАК МатрицаТовары
	//             |ГДЕ
	//             |	(МатрицаТовары.ШККонтрагента = &ТекШК
	//             |			ИЛИ МатрицаТовары.ШККонтрагентаДополнительный = &ТекШК)
	//             |	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
	//             |	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
	//             |	И МатрицаТовары.Ссылка.Проведен = ИСТИНА";
	//
	//Запрос.УстановитьПараметр("Контрагент",Контрагент);
	//Запрос.УстановитьПараметр("ТекШк",ШК);
	//Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
	//
	//Рез=Запрос.Выполнить().Выбрать();
	//Если Рез.Следующий() Тогда
	//		Возврат Рез.Номенклатура;
	//КонецЕсли;
	//
	
	
	
	
	возврат НайденнаяНоменклатура;
	//----------------------------------------------------------------------------
КонецФункции // НайтиПОШК()


Функция ПолучитьАртикулыМатрицы(ДокОбъект)
	
	
	// для договоров не по матрице
	Попытка
		Если ДокОбъект.Договор.НеИспользоватьМатрицу Тогда
			НеИспользоватьМартицуПоДоговору=Истина;
		иначе
			НеИспользоватьМартицуПоДоговору=ложь;
		КонецЕсли;	
	Исключение
		НеИспользоватьМартицуПоДоговору=ложь;
	конецПопытки;
	ТЗ = новый ТаблицаЗначений;
	Тз.Очистить();
	
	Ссылка = ДокОбъект.ссылка;
	Попытка
		Если ДокОбъект.контрагент.ИспользоватьНоменклатурнуюМатрицу и не НеИспользоватьМартицуПоДоговору Тогда
			// проверяем по какому типу расчитывать цену - с учетом договора или нет(если по договору не найдено). 
			//Запрос = Новый Запрос;
			//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			//|	Матрица.Ссылка КАК Ссылка1
			//|ИЗ
			//|	Документ.Матрица КАК Матрица
			//|ГДЕ
			//|	Матрица.Контрагент = &Контрагент
			//|	И Матрица.Дата <= &Дата1
			//|	И Матрица.ДатаОкончания >= &Дата2
			//|	И Матрица.Договор = &Договор
			//|	И Матрица.Проведен = истина
			//|АВТОУПОРЯДОЧИВАНИЕ";
			
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Матрица.Ссылка КАК Ссылка1
			|ИЗ
			|	Документ.Матрица.ПунктыДоставки КАК Матрица
			|ГДЕ
			|	Матрица.Ссылка.Контрагент = &Контрагент
			|	И Матрица.Ссылка.Дата <= &Дата1
			|	И Матрица.Ссылка.ДатаОкончания >= &Дата2
			|	И Матрица.Ссылка.Договор = &Договор
			|	И Матрица.Ссылка.Проведен = ИСТИНА
			|	И Матрица.ПунктДоставки = &ПДИМ
			|АВТОУПОРЯДОЧИВАНИЕ";
			
			
			Запрос.УстановитьПараметр("Дата2",НачалоДня(ДокОбъект.дата));
			Запрос.УстановитьПараметр("Дата1",КонецДня(ДокОбъект.дата));
			Запрос.УстановитьПараметр("Контрагент",ДокОбъект.Контрагент);
			Запрос.УстановитьПараметр("Договор",ДокОбъект.Договор);
			Запрос.УстановитьПараметр("ПДИМ",МППунктДоставки);  // фбс озон
			
			ТЗЕстьМатрицаПоДоговору = Запрос.Выполнить().Выгрузить();
			
			
			//запрос на получение
			Запрос=Новый Запрос;
			Запрос.Текст=
			"ВЫБРАТЬ
			|	МатрицаТовары.Номенклатура КАК Номенклатура,
			|	МатрицаТовары.ШККонтрагента КАК ШККонтрагента,
			|	МатрицаТовары.АртикулКонтрагента КАК АртикулКонтрагента,
			|	МатрицаТовары.Ссылка КАК Ссылка,
			|	МатрицаТовары.НаименованиеКонтрагента КАК НаименованиеКонтрагента,
			|	МатрицаТовары.Кратность КАК Кратность,
			|	МатрицаТовары.ШККонтрагентаБлочок КАК ШККонтрагентаБлочок,
			|	МатрицаТовары.ШКСпайки КАК ШКСпайки,
			|	МатрицаТовары.МинимальныйОстатокКоличество КАК МинимальныйОстатокКоличество
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|ГДЕ
			|	МатрицаТовары.Ссылка.Дата <= &Дата1
			|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
			|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
			|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА
			|	И МатрицаТовары.Ссылка В ИЕРАРХИИ(&спМатриц)";
			
			
			Если ТЗЕстьМатрицаПоДоговору.Количество()>0 Тогда
				ЕстьМатрицаПоДоговору = истина;
				//с учетом договора
				Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.Договор = &Договор";
				
			иначе
				ЕстьМатрицаПоДоговору = ложь;
			КонецЕсли;
			
			Попытка
				Если Ссылка.ПостояннаяАкция Тогда
					Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
					//постоянные акции только под галку
				Иначе
					Запрос.Текст = Запрос.Текст +" И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция";
					
				КонецЕсли;
			Исключение
			КонецПопытки;	
			Запрос.Текст = Запрос.Текст +"	
			|УПОРЯДОЧИТЬ ПО
			|	МатрицаТовары.Ссылка.Дата УБЫВ
			|АВТОУПОРЯДОЧИВАНИЕ";
			
			Запрос.УстановитьПараметр("Контрагент",ДокОбъект.Контрагент);
			Запрос.УстановитьПараметр("Договор",ДокОбъект.Договор);
			Запрос.УстановитьПараметр("Дата1",КонецДня(ДокОбъект.Дата));
			Запрос.УстановитьПараметр("ТекДата",ДокОбъект.Дата);
			Запрос.УстановитьПараметр("спМатриц",ТЗЕстьМатрицаПоДоговору);
			
			
			тз1 = Запрос.Выполнить().Выгрузить();
			
			Возврат ТЗ1;
			
		КонецЕсли;
	исключение
		Возврат ТЗ;
	конецПопытки;	
	
	возврат ТЗ; //пустая таблица
	
КонецФункции


Процедура СообщитьКритОшибки() Экспорт
	
	//Катаев+ 28/03/13 походу лишняя проверка
	//// Катаев+ 15/03/13 В локальных базах вывод ошибок отключаем
	//Если СтрокаСоединенияИнформационнойБазы() <> Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить() Тогда
	//	Возврат;
	//КонецЕсли;
	//// Катаев- 15/03/13
	//Катаев- 28/03/13
	//Катаев+ 09/04/13 Если в режиме отладки то сообщения не отправляются
	Если ПараметрыСеанса.Отладка Тогда
		Возврат;
	КонецЕсли;
	//Катаев- 09/04/13
	
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
	//	Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//	Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Иначе
	//	Профиль.АдресСервераPOP3   = "87.236.190.180";
	//	Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//КонецЕсли;
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);		 
	// Кухарь А.Ю.  08.09.2022 конец

	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	//------------------------------------------------
	// сообщение о критических ошибках
	//------------------------------------------------
	сообщениеКрит=новый интернетПочтовоеСообщение;
	//Катаев+ 09/04/13 ошибочный одрес получателя
	//СообщениеКрит.Получатели.Добавить("ecode@collant.ru"); //+++
	//Катаев- 09/04/13
	
	//Катаев+ 07/05/13 получатели критических ошибок будем брать из Регистра сведений
	СообщениеКрит.Получатели.Добавить("nechaeva@collant.ru");
	СообщениеКрит.Получатели.Добавить("egorova_k@collant.ru");
	//Сообщение.Получатели.Добавить("kulagina@collant.ru");
	СообщениеКрит.Получатели.Добавить("yamshikova@collant.ru");

	//СообщениеКрит.Получатели.Добавить("grishakov@collant.ru");
	//СообщениеКрит.Получатели.Добавить("nikolaev@collant.ru");
	//СообщениеКрит.Получатели.Добавить("krohin@collant.ru");
	//СообщениеКрит.Получатели.Добавить("pokidyshev@collant.ru");
	//СообщениеКрит.Получатели.Добавить("gorbachenko@collant.ru");
	////крохин начало 21.06.2012
	//СообщениеКрит.Получатели.Добавить("loban@collant.ru");	
	////крохин конец 21.06.2012
	//
	////Катаев+ 22/03/13
	//СообщениеКрит.Получатели.Добавить("kataev@collant.ru");	
	////Катаев- 22/03/13
	//Выборка = регистрыСведений.Емайл_КритОшибки.Выбрать();
	//Пока  Выборка.Следующий() Цикл
	//	СообщениеКрит.Получатели.Добавить(Выборка.емайл);
	//КонецЦикла;
	//Если СообщениеКрит.Получатели.Количество() = 0 Тогда
	//	//СообщениеКрит.Получатели.Добавить("krohin@collant.ru");
	//	//Катаев+ 27/02/14
	//	//СообщениеКрит.Получатели.Добавить("kataev@collant.ru");
	//	//20.04.15+++
	//	//СообщениеКрит.Получатели.Добавить("nechaeva@collant.ru");
	//	СообщениеКрит.Получатели.Добавить("egorova_k@collant.ru");
	//	СообщениеКрит.Получатели.Добавить("kulagina@collant.ru");
	
	//	//20.04.15*--
	//	//Катаев- 27/02/14
	//КонецЕсли;
	//Катаев- 07/05/13
	//Катаев+ 14/07/14 Для филиалов в получатели добавляем менеджера и его замов
	//Если ПланыОбмена.Основной.ЭтотУзел() <> ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
	//	СтрШапка = ТЗШапка.Получить(0);
	//	Менеджер=СтрШапка.контрагент.Менеджер;
	//	Если НЕ Сокрлп(Менеджер.ЕМэйл)=""  тогда
	//		Если Менеджер.Штатный Тогда
	//			СообщениеКрит.Получатели.Добавить(Менеджер.ЕМэйл);
	//		КонецЕсли;
	//	конецесли;
	//	Запрос=Новый Запрос;
	//	Запрос.Текст="ВЫБРАТЬ
	//	|	ПользователиЗаместители.Заместитель,
	//	|	ПользователиЗаместители.Заместитель.ЕМэйл  как ЗамЕМэйл
	//	|ИЗ
	//	|	Справочник.Пользователи.Заместители КАК ПользователиЗаместители
	//	|ГДЕ
	//	|	ПользователиЗаместители.Ссылка.ФизЛицо = &ТекМенеджер";
	//	Запрос.УстановитьПараметр("ТекМенеджер",Менеджер);
	//	Результат=Запрос.Выполнить().Выбрать();
	//	Пока Результат.Следующий() Цикл
	//		Если СтрДлина(Результат.ЗамЕМэйл)>5 Тогда
	//			Если Результат.Заместитель.Штатный Тогда
	//				СообщениеКрит.Получатели.Добавить(Результат.ЗамЕМэйл);
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЦикла;
	//Конецесли;
	//Катаев- 14/07/14
	
	сообщениеКрит.Отправитель="ecode@collant.ru";
	СообщениеКрит.Тема="Автообмен Вайлдберриз. Критические ошибки!";
	Строка="Добрый день!!!"+Символ(13);
	НомСтр=1;
	Если НЕ Ошибки=Неопределено и КритичОшибки.Количество()>0 Тогда
		Для рр=0 по КритичОшибки.Количество()-1 Цикл
			Строка=Строка+Символ(13)+НомСтр+". "+КритичОшибки[рр];
			Строка=Строка+Символ(13);
			НомСтр=НомСтр+1;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ Ошибки=Неопределено и КритическиеОшибкиОзон2.Количество()>0 Тогда
		Для рр=0 по КритическиеОшибкиОзон2.Количество()-1 Цикл
			Строка=Строка+Символ(13)+НомСтр+". "+КритическиеОшибкиОзон2[рр];
			Строка=Строка+Символ(13);
			НомСтр=НомСтр+1;
		КонецЦикла;
	КонецЕсли;
	Строка=Строка+Символ(13)+"";
	//-----------------------------------------
	СообщениеКрит.Тексты.Добавить(Строка);
	
	Строка=Строка+Символ(13)+"________________________________________________________________";
	//-----------------------------------------
	СообщениеКрит.Тексты.Добавить(Строка);
	
	Почта= Новый ИнтернетПочта;
	Почта.Подключиться(Профиль);
	почта.Послать(СообщениеКрит);
	Почта.Отключиться();
	
КонецПроцедуры


функция  ПолучитьОстатокТовара(НоменклСп)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	""Остатки"" КАК Раздел,
	|	СУММА(Остатки.КоличествоКонечныйОстаток) КАК КолКонБух,
	|	ВЫБОР
	|		КОГДА СУММА(Остатки.КоличествоКонечныйОстаток) = 0
	|			ТОГДА NULL
	|		ИНАЧЕ СУММА(Остатки.СуммаКонечныйОстаток) / СУММА(Остатки.КоличествоКонечныйОстаток)
	|	КОНЕЦ КАК ЦенаСеб,
	|	СУММА(Остатки.СуммаКонечныйОстаток) КАК СебестоимостьБух,
	|	СУММА(Остатки.КоличествоКонечныйОстаток - ЕСТЬNULL(Резервы.КоличествоКонечныйОстаток, 0)) КАК КолКонФакт,
	|	СУММА(ЕСТЬNULL(Резервы.КоличествоКонечныйОстаток, 0)) КАК Резерв,
	|	Остатки.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.ОстаткиИОбороты(
	|			НАЧАЛОПЕРИОДА(&Дата1, ДЕНЬ),
	|			КОНЕЦПЕРИОДА(&дата1, ДЕНЬ),
	|			Период,
	|			,
	|			Склад В ИЕРАРХИИ (&Склады)
	|				И Номенклатура В ИЕРАРХИИ (&Ном)) КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.ОстаткиИОбороты(
	|				НАЧАЛОПЕРИОДА(&Дата1, ДЕНЬ),
	|				КОНЕЦПЕРИОДА(&дата1, ДЕНЬ),
	|				Период,
	|				,
	|				Склад В ИЕРАРХИИ (&Склады)
	|					И Номенклатура В ИЕРАРХИИ (&Ном)) КАК Резервы
	|		ПО Остатки.Номенклатура = Резервы.Номенклатура
	|			И Остатки.Склад = Резервы.Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Номенклатура";
	Склад = МПСклад;
	
	Запрос.УстановитьПараметр("Склады",склад);
	Запрос.УстановитьПараметр("Дата1",текущаядата());
	Запрос.УстановитьПараметр("Ном",НоменклСп);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	возврат РезультатЗапроса;
	
	
	
конецФункции	


// НайтиТОварПоматрице
//
Функция НайтиПОШКМатрица22(ШК)Экспорт
	
	
	контрагент = МПКонтрагент;
	
	НайденнаяНоменклатура=Справочники.Номенклатура.ПустаяСсылка();
	
	// ищем по ШК
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	МатрицаТовары.Номенклатура КАК Номенклатура,
	|	МатрицаТовары.ШККонтрагента КАК ШККонтрагента,
	|	МатрицаТовары.ШККонтрагентаДополнительный КАК ШККонтрагентаДополнительный,
	|	МатрицаТовары.АртикулКонтрагента КАК АртикулКонтрагента,
	|	МатрицаТовары.Цена КАК Цена
	|ИЗ
	|	Документ.Матрица.Товары КАК МатрицаТовары
	|ГДЕ
	|	(МатрицаТовары.ШККонтрагента = &ТекШК
	|			ИЛИ МатрицаТовары.ШККонтрагентаДополнительный = &ТекШК)
	|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
	|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
	|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("ТекШк",ШК);
	Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
	
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Рез.Номенклатура;
	КонецЕсли;
	
	
	
	возврат НайденнаяНоменклатура;
	//----------------------------------------------------------------------------
КонецФункции // НайтиПОШК()



Процедура ПунктДоставки_ПриИзменении(ПунктДоставки,РНК) экспорт
	//  19.08.2020 Кухарь конец
	
	
	
	//Кухарь 01.05.18 начало
	//Будем тип доставки фиксировать в документах
	ТипДоставки=ПунктДоставки.ТипДоставки;
	//Кухарь 01.05.18 конец
	
	
	Если НЕ ПунктДоставки.Пустая() Тогда
		
		
		НуженПересчетЦен=Ложь;
		
		Если ЗначениеЗаполнено(ПунктДоставки.Договор)  Тогда
			РНК.Договор=ПунктДоставки.Договор;
			//	РНК.Договор_ПриИзменении(Неопределено);
		КонецЕсли;
		
		//крохин конец 07.04.2011
		
		//доставка
		Если ЗначениеЗаполнено(ПунктДоставки.РайонДоставки) Тогда
			РНК.РайонДоставки=ПунктДоставки.РайонДоставки;			
		КонецЕсли;	
		Если ЗначениеЗаполнено(ПунктДоставки.Регион) Тогда
			рнк.Регион=ПунктДоставки.Регион;			
		КонецЕсли;	
		
		если РНК.ПунктДоставки.ТипДоставки=Перечисления.ТипыДоставки.ТранспортнаяКомпания тогда
			Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
				РНК.ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
			иначе
				РНК.ТранспортнаяКомпания=Справочники.Контрагенты.ПустаяСсылка();
			КонецЕсли;	
			Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
				РНК.ПунктПерегруза=ПунктДоставки.ПунктПерегруза;
			иначе
				РНК.ПунктПерегруза=Справочники.ПунктыДоставки.ПустаяСсылка();
			КонецЕсли;	
		иначе
			РНК.ТранспортнаяКомпания=Справочники.Контрагенты.ПустаяСсылка();	
			РНК.ПунктПерегруза=Справочники.ПунктыДоставки.ПустаяСсылка();
		КонецЕсли;
		//Кухарь 26.01.16 конец
		
		Если ЗначениеЗаполнено(ПунктДоставки.Грузополучатель) Тогда
			РНК.Грузополучатель=ПунктДоставки.Грузополучатель;		
		КонецЕсли;
		Если ЗначениеЗаполнено(ПунктДоставки.Получатель) Тогда
			РНК.Получатель=ПунктДоставки.Получатель;		
		КонецЕсли;
		Если ЗначениеЗаполнено(ПунктДоставки.ОтсрочкаПлатежа) Тогда
			РНК.ОтсрочкаПлатежа=ПунктДоставки.ОтсрочкаПлатежа;		
		КонецЕсли;
		
		//типы цен скидки
		Если ЗначениеЗаполнено(ПунктДоставки.ТипЦен) И РНК.ТипЦен<>ПунктДоставки.ТипЦен Тогда
			РНК.ТипЦен=ПунктДоставки.ТипЦен;		
			РНК.НуженПересчетЦен=Истина;
		КонецЕсли; 
		Если ЗначениеЗаполнено(ПунктДоставки.ТипСкидок) И РНК.ТипСкидок<>ПунктДоставки.ТипСкидок Тогда
			РНК.ТипСкидок=ПунктДоставки.ТипСкидок;		
			РНК.НуженПересчетЦен=Истина;
		КонецЕсли;
		Если ПунктДоставки.Скидка<>0 И ПунктДоставки.Скидка<>РНК.Скидка Тогда
			РНК.Скидка=ПунктДоставки.Скидка;		
			РНК.НуженПересчетЦен=Истина;
		КонецЕсли;
		Если НуженПересчетЦен Тогда
			ПересчетТЧ(РНК,"Товары",РНК.Валюта,РНК.Валюта,РНК.Курс,РНК.Курс,Истина);			
		КонецЕсли;	
		//крохин начало 29.03.2011
		//ставка НДС
		//Если ПунктДоставки.НулеваяСтавкаНДС или Контрагент.НулеваяСтавкаНДС Тогда
		//	РНК.НулеваяСтавкаНДС = Истина;	
		//	НулеваяСтавкаНДСПриИзменении(Неопределено);
		//	//крохин начало 03.10.2012
		//ИначеЕсли НулеваяСтавкаНДС Тогда
		//	НулеваяСтавкаНДС = Ложь;
		//	НулеваяСтавкаНДСПриИзменении(Неопределено);
		//	//крохин конец 03.10.2012
		//КонецЕсли;
		//крохин конец 29.03.2011
		//УстановитьЗаголовокКнопкиЦеныВалюта(ЭтаФорма);
	КонецЕсли; 
	//крохин начало 15.04.2011
	//Доп. обработки, заполняем из пункта доставки, если они там есть
	//Если ДопОбработки.Количество()>0 Тогда
	//	Предупреждение("Доп. обработки будут перезаполнены по умолчанию из карточки контрагента !");
	//КонецЕсли;	
	РНК.ДопОбработки.Очистить();
	Если ПунктДоставки.ВидыДопОбработок.Количество() = 0 Тогда
		Для Каждого СтрокаТЧ Из Контрагент.ВидыДопОбработок Цикл
			СтрокаДО=РНК.ДопОбработки.Добавить();	
			СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
		КонецЦикла;
	Иначе
		Для Каждого СтрокаТЧ Из ПунктДоставки.ВидыДопОбработок Цикл
			СтрокаДО=РНК.ДопОбработки.Добавить();	
			СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
		КонецЦикла;
		
	КонецЕсли;
	//крохин конец 15.04.2011
	//крохин начало 29.04.2011
	КодПоставщикаПунктаДоставки=ПунктДоставки.КодПоставщика;
	Если НЕ КодПоставщикаПунктаДоставки.Пустая() И РНК.КодПоставщика<>КодПоставщикаПунктаДоставки Тогда
		РНК.КодПоставщика=КодПоставщикаПунктаДоставки;
	КонецЕсли; 
	//крохин конец 29.04.2011
	
	//
	//РНК.ВремяДоставки=ПолучитьВремяПриемки(РНК.Ссылка);
	//если РНК.ВремяДоставки=Справочники.ВремяПриемки.ПустаяСсылка() или РНК.ВремяДоставки=Неопределено тогда
	//	пВремяДоставки=ПунктДоставки.ВремяДоставки;
	//иначе
	//	пВремяДоставки=РНК.ВремяДоставки;
	//КонецЕсли;
	
	РНК.ДатаПриемки=ОпределитьДатуАвизацииДокумента(РНК.Ссылка);	
	КодПоставщикаПунктаДоставки=ПунктДоставки.КодПоставщика;
	Если НЕ КодПоставщикаПунктаДоставки.Пустая() И РНК.КодПоставщика<>КодПоставщикаПунктаДоставки Тогда
		РНК.КодПоставщика=КодПоставщикаПунктаДоставки;
	КонецЕсли; 
	Если ЗначениеЗаполнено(ПунктДоставки.СкладКомиссия) Тогда
		РНК.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия;
		РНК.СкладКомиссия = ПунктДоставки.СкладКомиссия;
		//	ДоговорКомиссия = ПунктДоставки.ДоговорКомиссия;
	Иначе
		Если РНК.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия Тогда
			РНК.КодОперации = Перечисления.КодыОперацийОстатки.Реализация;
			РНК.СкладКомиссия = Справочники.Склады.ПустаяСсылка();
			//		ДоговорКомиссия = Справочники.Договоры.ПустаяСсылка();
			
		КонецЕсли;	
	КонецЕсли;
	
	
КонецПроцедуры


//******************************************************************************************************************************************************



//Формирование GET запроса по переданным параметрам
Функция GET_ЗапросЗаказы(Команда,ТелоДж) Экспорт
	
	
	///curl -X GET "https://marketplace-api.wildberries.ru/api/v2/orders?date_start=2021-09-10T00%3A00%3A00%2B02%3A00&status=1&take=10&skip=0" 
	//-H "accept: application/json" -H "Authorization: eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJhY2Nlc3NJRCI6Ijc2ODU0OGMyLTUyNTQtNDU3OC04YTMwLTRjZThlYTViOWM2YiJ9.my1etcdHKjFzr0ppJOfLY3kLvkMZCcOlRSppguS3HXk"
	
	
	
	
	// это продуктив пароли
	// тестовые пароли
	IdСклада= "1877";                                                   
	//НашКлючАдмин ="c03ca9dde50797fce128771b121d2c826b1418ef7d72df1f21109d44ac421813";
	
	//токен для работы c03ca9dde50797fce128771b121d2c826b1418ef7d72df1f21109d44ac421813
	//токен для тестов   ee2add01c9436f523932a3da4e5af0b9d890515a67af1aa18df22327d020f0f2
	
	//НашКлючАдмин = "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJhY2Nlc3NJRCI6IjAwMmRiM2RiLWQ5ZjQtNDg3MS1iNmZiLTg4NDNiNWRjMDYxOSJ9.VZkFemOFmBKpu1jV69GRMtCXjGftP-hruVLvNd1AZyY";
	
	//НашКлючАдмин ="eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJhY2Nlc3NJRCI6Ijc2ODU0OGMyLTUyNTQtNDU3OC04YTMwLTRjZThlYTViOWM2YiJ9.my1etcdHKjFzr0ppJOfLY3kLvkMZCcOlRSppguS3HXk" ;
	НашКлючАдмин ="eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJhY2Nlc3NJRCI6ImQ5NWZhNmVjLWU2YjQtNGFiMi1iNTJkLTdmYzA5MGM2YThlZCJ9.ZKhfpd-EWQylT4ogjWbjVqkP_4fnT962Lc2JAIRiZAc";
	Лимит = 1000;
	
	ИмяВыходногоФайла = ПолучитьИмяВременногоФайла(".xml");
	
	
	//АдресТ = "suppliers-orders.wildberries.ru"	; // тестовый сервер
	//  suppliers-orders-test.wildberries.ru
	// старый адрес АПИ
	//АдресТ = "suppliers-orders.wildberries.ru";
	
	АдресТ =  "marketplace-api.wildberries.ru" ;
	попытка                          
		Соединение = Новый HTTPСоединение(АдресТ,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);  
	исключение
		//Сообщить(ОписаниеОшибки());
	конецПопытки;
	
	HTTP_запрос = новый HTTPзапрос();
	
	HTTP_запрос.АдресРесурса = Команда;
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json");
	ЗаголовокHTTP.Вставить("Accept", "text/xml");
	ЗаголовокHTTP.Вставить("Accept-Language", "ru");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("Content-Language", "ru");
	ЗаголовокHTTP.Вставить("Content-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("Host", АдресТ); //"https://seller-api.sc.prod.s.o3.ru/v1/categories/tree?language=DEFAULT");
	ЗаголовокHTTP.Вставить("X-Auth-Token", НашКлючАдмин );
	ЗаголовокHTTP.Вставить("Token", НашКлючАдмин );
	ЗаголовокHTTP.Вставить("Authorization", НашКлючАдмин );
	
	HTTP_запрос.Заголовки = ЗаголовокHTTP;
	
	//HTTP_запрос.УстановитьТелоИзСтроки(ТелоДЖ,,ИспользованиеByteOrderMark.НеИспользовать);
	//HTTP_запрос.УстановитьИмяФайлаТела(ТелоДЖ);
	
	Попытка
		//Отправляем для обрааботки на наш сервер
		Ответ = Соединение.Получить(HTTP_запрос);  // ИмяВыходногоФайла
		
	Исключение
		#Если клиент Тогда
			Сообщить(ОписаниеОшибки());
		#КонецЕсли   
	КонецПопытки;
	//	ответ.ПолучитьИмяФайлаТела()
	//Соединение.ОтправитьДляОбработки(HTTP_запрос,ИмяВыходногоФайла);
	//Сообщить(ИмяВыходногоФайла);
	
	возврат Ответ;
	
	//--------------------------------------------------------------------------------------------------------------------------------
	
	
	
	
	
	//
	//
	//Если Сфера_Соединение=НеОпределено Тогда
	//	Сфера_Соединение = Соединение()
	//КонецЕсли;	
	//
	//ОбъектЗапроса = НовыйЗапрос(Метод, Тело, Сфера_AuthToken);
	//Ответ = Сфера_Соединение.Получить(ОбъектЗапроса);
	//Возврат Ответ;
	
КонецФункции

Функция PUT_Запрос(Команда,ТелоДж)  // get запрос
	Ответ=неопределено;
	// это продуктив пароли
	
	//	
	//	Токен для теста:
	//ee2add01c9436f523932a3da4e5af0b9d890515a67af1aa18df22327d020f0f2
	
	//Токен для работы:
	//c03ca9dde50797fce128771b121d2c826b1418ef7d72df1f21109d44ac421813
	//	
	//	
	
	// тестовые пароли
	КлиентИД = 836;                                                    
	//НашКлючАдмин ="ee2add01c9436f523932a3da4e5af0b9d890515a67af1aa18df22327d020f0f2"; //тест
	
	//рабочий
	//НашКлючАдмин = "c03ca9dde50797fce128771b121d2c826b1418ef7d72df1f21109d44ac421813";
	//НашКлючАдмин = "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJhY2Nlc3NJRCI6IjAwMmRiM2RiLWQ5ZjQtNDg3MS1iNmZiLTg4NDNiNWRjMDYxOSJ9.VZkFemOFmBKpu1jV69GRMtCXjGftP-hruVLvNd1AZyY";
	НашКлючАдмин ="eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJhY2Nlc3NJRCI6ImQ5NWZhNmVjLWU2YjQtNGFiMi1iNTJkLTdmYzA5MGM2YThlZCJ9.ZKhfpd-EWQylT4ogjWbjVqkP_4fnT962Lc2JAIRiZAc";
	Лимит = 10;
	
	ИмяВыходногоФайла = ПолучитьИмяВременногоФайла(".json");
	#если клиент тогда
		//сообщить(ИмяВыходногоФайла);
	# конецесли
	//ДатаНачала =Формат(НачалоДня(Дата1),"ДФ=""гггг-ММ-дд""");
	//ДатаКонца = Формат(КонецДня(Дата2),"ДФ=""гггг-ММ-дд""");
	
	//АдресТ = "suppliers-orders-test.wildberries.ru"	; // тестовый сервер   https://wbxgate.wildberries.ru/stocks
	//АдресТ = "wbxgate-test.wildberries.ru" ;       ///stocks
	//АдресТ = "suppliers-orders.wildberries.ru";   // https://wbxgate.wildberries.ru/stocks     suppliers-orders.wildberries.ru
	
	АдресТ =  "marketplace-api.wildberries.ru" ;

	попытка                          
		Соединение = Новый HTTPСоединение(АдресТ,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);  
	исключение
		
		//Сообщить(ОписаниеОшибки());
	конецПопытки;
	//"/api/v1/orders?date_start=2020-03-23T14:58:33.102-08:00"
	
	
	HTTP_запрос = новый HTTPзапрос();
	
	HTTP_запрос.АдресРесурса = "/api/v2/orders";//?date_start=2020-03-23T14:58:33.102-08:00";   //stocks  ???
	
	ЗаголовокHTTP = Новый Соответствие();               
	ЗаголовокHTTP.Вставить("Content-Type", "application/json");
	ЗаголовокHTTP.Вставить("Accept", "text/xml");
	ЗаголовокHTTP.Вставить("Accept-Language", "ru");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("Content-Language", "ru");
	ЗаголовокHTTP.Вставить("Content-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("Host", АдресТ);
	ЗаголовокHTTP.Вставить("Server", АдресТ);
	ЗаголовокHTTP.Вставить("X-Auth-Token", НашКлючАдмин );
	ЗаголовокHTTP.Вставить("Token", НашКлючАдмин );
	ЗаголовокHTTP.Вставить("Authorization", НашКлючАдмин );

	
	HTTP_запрос.Заголовки = ЗаголовокHTTP;
		
	HTTP_запрос.УстановитьИмяФайлаТела(ТелоДЖ);
	
	//Ответ2 = Соединение.ВызватьHTTPМетод("PUT",HTTP_запрос);
//	[
//  {
//    "orderId": "string",
//    "status": 2
//  }
//]
	
	Попытка
		//Отправляем для обрааботки на наш сервер
		Ответ = Соединение.Записать(HTTP_запрос); //,ИмяВыходногоФайла);// Соединение.Получить(HTTP_запрос);  // ИмяВыходногоФайла
		
	Исключение
		#Если клиент Тогда
			Сообщить(ОписаниеОшибки());
		#КонецЕсли   
	КонецПопытки;
	//	ответ.ПолучитьИмяФайлаТела()
	//Соединение.ОтправитьДляОбработки(HTTP_запрос,ИмяВыходногоФайла);
	//Сообщить(ИмяВыходногоФайла);
	//Если Ответ.КодСостояния<>200 тогда
	//	//КритическиеОшибкиОзон2.Добавить("Заказ "+телодж+" не проведен и не сброшен на склад!");
	//	//	КритическиеОшибкиОзон2.Добавить(""+ОписаниеОшибки());
	//	//ЗаписатьВЛог("ОшибкиЕкод","Заказ "+телодж+" не проведен и не сброшен на склад !2","Информация");
	//	//р2=ответ.ПолучитьТелоКакСтроку();
	//	//КритическиеОшибкиОзон2.Добавить(р2);

	//	//СообщитьКритОшибки();
	//	//КритическиеОшибкиОзон2.очистить();
	//	
	//КонецЕсли;	
	#если клиент тогда
		
		Если Ответ.КодСостояния = 200 Тогда
			//Сообщить("Переведен на сборку успешно.");
		иначе
			Сообщить(Ответ.КодСостояния);
	
		КонецЕсли;	
	# конецесли
	возврат Ответ;
	
	//--------------------------------------------------------------------------------------------------------------------------------
	
	
КонецФункции



//------------------------------------------------------------------------

//нечаева 12,10,21++++  новые этикетки для ВБ

//
Функция POST_Запрос(Команда,ТелоДж) Экспорт
	
	
	
	// это продуктив пароли
	// тестовые пароли
	IdСклада= "1877";                                                   
	
	//НашКлючАдмин ="eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJhY2Nlc3NJRCI6Ijc2ODU0OGMyLTUyNTQtNDU3OC04YTMwLTRjZThlYTViOWM2YiJ9.my1etcdHKjFzr0ppJOfLY3kLvkMZCcOlRSppguS3HXk" ;
	НашКлючАдмин ="eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJhY2Nlc3NJRCI6ImQ5NWZhNmVjLWU2YjQtNGFiMi1iNTJkLTdmYzA5MGM2YThlZCJ9.ZKhfpd-EWQylT4ogjWbjVqkP_4fnT962Lc2JAIRiZAc";
	Лимит = 1000;
	
	ИмяВыходногоФайла2 = ПолучитьИмяВременногоФайла(".xml");
	
	АдресТ =  "marketplace-api.wildberries.ru" ;
	попытка                          
		Соединение = Новый HTTPСоединение(АдресТ,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);  
	исключение
		//Сообщить(ОписаниеОшибки());
	конецПопытки;
	
	HTTP_запрос = новый HTTPзапрос();
	
	HTTP_запрос.АдресРесурса = Команда;
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json");
	ЗаголовокHTTP.Вставить("Accept", "text/xml");
	ЗаголовокHTTP.Вставить("Accept-Language", "ru");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("Content-Language", "ru");
	ЗаголовокHTTP.Вставить("Content-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("Host", АдресТ); 
	ЗаголовокHTTP.Вставить("X-Auth-Token", НашКлючАдмин );
	ЗаголовокHTTP.Вставить("Token", НашКлючАдмин );
	ЗаголовокHTTP.Вставить("Authorization", НашКлючАдмин );
	
	HTTP_запрос.Заголовки = ЗаголовокHTTP;
	 HTTP_запрос.УстановитьТелоИзСтроки(ТелоДЖ,,ИспользованиеByteOrderMark.НеИспользовать);
	HTTP_запрос.УстановитьИмяФайлаТела(ТелоДЖ);

	
	Попытка
		//Отправляем для обрааботки на наш сервер
		Ответ = Соединение.ОтправитьДляОбработки(HTTP_запрос);  // ИмяВыходногоФайла ????
		//HTTP.ОтправитьДляОбработки(ФайлТелаЗапроса, СсылкаНаРесурс, ФайлРезультат, ЗаголовокЗапросаHTTP);
	Исключение
		#Если клиент Тогда
			Сообщить(ОписаниеОшибки());
		#КонецЕсли   
	КонецПопытки;
	//	ответ.ПолучитьИмяФайлаТела()
	//Соединение.ОтправитьДляОбработки(HTTP_запрос,ИмяВыходногоФайла);
	//Сообщить(ИмяВыходногоФайла);
	
	возврат Ответ;

	
КонецФункции

Процедура ЗагрузитьШК () Экспорт
	
	//Док = документы.ЗаказКлиентаFBS.НайтиПоНомеру("000005779",Дата(2021,11,26));
	//ДокОб = док.ПолучитьОбъект();
	//ЗапросПоСтикерам(ДокОб);
	//
	//
	//Док = документы.ЗаказКлиентаFBS.НайтиПоНомеру("000005780",Дата(2021,11,26));
	//ДокОб = док.ПолучитьОбъект();
	//ЗапросПоСтикерам(ДокОб);

	
КонецПроцедуры	

Функция ЗапросПоСтикерам(Док)

	Результат = неопределено;
	
//  "orderIds": [
//    8423848,
//    6436344
//  ]
//}

	Команда =  "/api/v2/orders/stickers";
	ДокОб = док.ПолучитьОбъект();

	//ТелоДЖ = "";
	ИмяВыходногоФайлаДЖ = ПолучитьИмяВременногоФайла(".JSON");
	#если клиент тогда
		сообщить(ИмяВыходногоФайлаДж);
	# конецесли
	//
	ЕстьИзмененияВДокументе = ложь;
	
	ТЗ1 = Новый ТаблицаЗначений;
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказКлиентаFBSТовары.РИД КАК РИД,
	               |	ЗаказКлиентаFBSТовары.ШтрихКод КАК ШтрихКод,
	               |	ЗаказКлиентаFBSТовары.НомерЗаказа КАК НомерЗаказа,
	               |	ЗаказКлиентаFBSТовары.Количество КАК Количество,
	               |	ЗаказКлиентаFBSТовары.Номенклатура КАК Номенклатура,
	               |	ЗаказКлиентаFBSТовары.Ссылка КАК Ссылка,
	               |	ЗаказКлиентаFBSТовары.НомерСтроки КАК НомерСтроки
	               |ИЗ
	               |	Документ.ЗаказКлиентаFBS.Товары КАК ЗаказКлиентаFBSТовары
	               |ГДЕ
	               |	ЗаказКлиентаFBSТовары.Ссылка = &текдок";
				//   |	И ЗаказКлиентаFBSТовары.ШтрихКод = &Пусто";
	
	
	запрос.УстановитьПараметр("ТекДок",Док.ссылка);
	запрос.УстановитьПараметр("Пусто","");

	тз1 =Запрос.Выполнить().Выгрузить();
	
//	  ДОк тут уже обьект
	текстр=1;
	Для каждого Текстрока из  тз1 цикл
		
		
		Если ТекСтрока.штрихкод<>"" Тогда
			продолжить;
		КонецЕсли;
	
		//*********************************************************************************
		// формирование запроса
		Ордер = Число(Текстрока.НомерЗаказа);   		
		СтрПРо= Новый массив;
	   	стрпро.Добавить(ордер); 
			
		ИмяВыходногоФайлаДЖ = ПолучитьИмяВременногоФайла(".JSON");
		
		Запись = Новый ЗаписьJSON;
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( ,Символы.Таб);
		Запись.ОткрытьФайл(ИмяВыходногоФайлаДЖ,,,ПараметрыЗаписиJSON);
		
		НастройкиСериализации = Новый НастройкиСериализацииJSON;
		НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
		НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением; 
		
		Данные = Новый Структура;

		Данные.Вставить("orderIds",стрПро);

		
		Попытка
			ЗаписатьJSON(Запись, Данные, НастройкиСериализации);
			Запись.Закрыть();
		Исключение
			//сообщить(ОписаниеОшибки());
			
		КонецПопытки;;  
		//**************************************************************************************
		// выполнение пост запроса.
		//-------------------------------
		Результат = Post_Запрос(Команда,ИмяВыходногоФайлаДЖ) ; 
		// записываем результат
		Если    Результат.кодсостояния = 200 тогда
			
			// тут получаем этикетку и записываем
			Ответ=Результат.ПолучитьТелоКакСтроку();
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(Ответ);
			
			Данные = ПрочитатьJSON(ЧтениеJSON, Ложь);
			
			НовД = Данные.data;
			// нечаева  260122 ++
			попытка
				Если НовД.количество()>0 Тогда
					// нечаева 260122 --
					Для каждого текСтрока2 из НовД цикл
						// текстрока.order
						ШК = ТекСтрока2.sticker.wbStickerEncoded;
						ШК1= ТекСтрока2.sticker.wbstickerIdParts.A;
						ШК2= ТекСтрока2.sticker.wbstickerIdParts.B;
						
						#если клиент тогда
							состояние(" заказ - "+ордер+" -"+ШК);
						# конецесли
						
						попытка						
							докОб.товары[ТекСтрока.номерСтроки-1].Штрихкод = ШК;
							докОб.товары[ТекСтрока.номерСтроки-1].ПрефиксЗаказа = ШК1;
							докОб.товары[ТекСтрока.номерСтроки-1].СуффиксЗаказа = ШК2;
						исключение
							#если клиент тогда
								сообщить(" заказ - "+ордер+" "+ОписаниеОшибки());
							# конецесли
						конецПопытки;
						ЕстьИзмененияВДокументе = истина;
					КонецЦикла;
				Иначе
					#если клиент тогда
						сообщить(" заказ - "+ордер+" нет этикетки!!!");
					# конецесли
					КритическиеОшибкиОзон2.Добавить("Заказ "+ордер+"нет этикетки от контаргента ВБ");
				КонецЕсли;
			исключение
				#если клиент тогда
					сообщить(" заказ - "+ордер+" нет этикетки!!!");
				# конецесли
				КритическиеОшибкиОзон2.Добавить("Заказ "+ордер+"нет этикетки от контаргента ВБ");
				
				
			конецпопытки;
		иначе
			
			#если клиент тогда
				сообщить(" заказ - "+ордер+" - код состояния -"+Результат.кодсостояния);
			# конецесли
			
		конецЕсли;
		
		текстр=текстр+1;
	конецЦикла;
	
	Если ЕстьИзмененияВДокументе ТОгда
		попытка	
			ДокОб.записать();
		исключение
			
				#если клиент тогда
					состояние(ОписаниеОшибки());
				# конецесли

			
		конецПопытки;	
	КонецЕсли;	
	
	возврат неопределено;     

		
конецФункции



 
 // нечаева 06,12,21+++++
Процедура ДозагрузитьЗагрузитьШК() Экспорт
	
	ДатаОтгрузки = Началодня(ТекущаяДата());
	
	ДеньВСекундах=24*60*60;
		
	запрос = новый Запрос;
	запрос.Текст = "ВЫБРАТЬ  различные
	|             	ЗаказКлиентаFBS.Ссылка КАК Ссылка
	|   ИЗ
	|  	Документ.ЗаказКлиентаFBS.Товары КАК ЗаказКлиентаFBS
	| ГДЕ
	|	ЗаказКлиентаFBS.Ссылка.Проведен = ИСТИНА
	|   И ЗаказКлиентаFBS.Ссылка.контрагент = &Вайлдб
	| 	И ЗаказКлиентаFBS.ШтрихКод = """"
	|	И ЗаказКлиентаFBS.ССылка.ДокОснование.ДатаОтгрузки >= &датаотгрузки
	|	И ЗаказКлиентаFBS.ссылка.Дата >= &ДатаДок";
	запрос.УстановитьПараметр("Датадок",ТекущаяДата() - 7*ДеньВСекундах);
	запрос.УстановитьПараметр("Вайлдб", МПКонтрагент);
	запрос.УстановитьПараметр("датаотгрузки",НачалоДня(ТекущаяДата()));	
		
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока рез.Следующий() Цикл
		
		док=рез.ссылка;
		//ДокОб = док.ПолучитьОбъект();
		// проверим на пустые ШК
		ЗапросПоСтикерам(Док.ссылка);
		
	конецЦикла;
	
КонецПроцедуры	

Функция ЗапросПоСтикерам2ы(Док)

	Результат = неопределено;
	
//  "orderIds": [
//    8423848,
//    6436344
//  ]
//}

	Команда =  "/api/v2/orders/stickers";
	
	//ТелоДЖ = "";
	ИмяВыходногоФайлаДЖ = ПолучитьИмяВременногоФайла(".JSON");
	#если клиент тогда
		сообщить(ИмяВыходногоФайлаДж);
	# конецесли
	//
	ЕстьИзмененияВДокументе = ложь;
	
	ТЗ1 = Новый ТаблицаЗначений;
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказКлиентаFBSТовары.РИД КАК РИД,
	               |	ЗаказКлиентаFBSТовары.ШтрихКод КАК ШтрихКод,
	               |	ЗаказКлиентаFBSТовары.НомерЗаказа КАК НомерЗаказа,
	               |	ЗаказКлиентаFBSТовары.Количество КАК Количество,
	               |	ЗаказКлиентаFBSТовары.Номенклатура КАК Номенклатура,
	               |	ЗаказКлиентаFBSТовары.Ссылка КАК Ссылка,
	               |	ЗаказКлиентаFBSТовары.НомерСтроки КАК НомерСтроки
	               |ИЗ
	               |	Документ.ЗаказКлиентаFBS.Товары КАК ЗаказКлиентаFBSТовары
	               |ГДЕ
	               |	ЗаказКлиентаFBSТовары.Ссылка = &текдок";
				//   |	И ЗаказКлиентаFBSТовары.ШтрихКод = &Пусто";
	
	
	запрос.УстановитьПараметр("ТекДок",Док.ссылка);
	запрос.УстановитьПараметр("Пусто","");

	тз1 =Запрос.Выполнить().Выгрузить();
	
//	  ДОк тут уже обьект
	текстр=1;
	Для каждого Текстрока из  тз1 цикл
		
		
		Если ТекСтрока.штрихкод<>"" Тогда
			продолжить;
		КонецЕсли;
	    //***********
		// переведем на сборку если еще не переведен.
		
		РИд = Текстрока.РИд;
		Ордер = Текстрока.НомерЗаказа;
		
		СтрПРоСборка= Новый ТаблицаЗначений;
		СтрПРоСборка.Колонки.Добавить("orderId");
		СтрПРоСборка.Колонки.Добавить("status");
		
		НовСт = стрпроСборка.Добавить();
		НовСт.orderId= ордер;            //  артикул вайлдберриз   код производителя у нас
		НовСт.status= 1;          //  1 - значит на сборку переводим. 2- собран		
				
		ОтправитьСтрокуЗаказа(ТабЗначВМассив(СтрПроСборка));
		// выведем , если не переводится на сборку.
	
		
		
		//*********************************************************************************
		// формирование запроса
		Ордер = Число(Текстрока.НомерЗаказа);   		
		СтрПРо= Новый массив;
	   	стрпро.Добавить(ордер); 
			
		ИмяВыходногоФайлаДЖ = ПолучитьИмяВременногоФайла(".JSON");
		
		Запись = Новый ЗаписьJSON;
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( ,Символы.Таб);
		Запись.ОткрытьФайл(ИмяВыходногоФайлаДЖ,,,ПараметрыЗаписиJSON);
		
		НастройкиСериализации = Новый НастройкиСериализацииJSON;
		НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
		НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением; 
		
		Данные = Новый Структура;

		Данные.Вставить("orderIds",стрПро);

		
		Попытка
			ЗаписатьJSON(Запись, Данные, НастройкиСериализации);
			Запись.Закрыть();
		Исключение
			//сообщить(ОписаниеОшибки());
			
		КонецПопытки;;  
		//**************************************************************************************
		// выполнение пост запроса.
		//-------------------------------
		Результат = Post_Запрос(Команда,ИмяВыходногоФайлаДЖ) ; 
		// записываем результат
		Если    Результат.кодсостояния = 200 тогда
			
			// тут получаем этикетку и записываем
			Ответ=Результат.ПолучитьТелоКакСтроку();
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(Ответ);
			
			Данные = ПрочитатьJSON(ЧтениеJSON, Ложь);
			
			НовД = Данные.data;
			Для каждого текСтрока2 из НовД цикл
				// текстрока.order
				ШК = ТекСтрока2.sticker.wbStickerEncoded;
				ШК1= ТекСтрока2.sticker.wbstickerIdParts.A;
				ШК2= ТекСтрока2.sticker.wbstickerIdParts.B;

				#если клиент тогда
					состояние(" заказ - "+ордер+" -"+ШК);
				# конецесли

				попытка						
					док.товары[ТекСтрока.номерСтроки-1].Штрихкод = ШК;
					док.товары[ТекСтрока.номерСтроки-1].ПрефиксЗаказа = ШК1;
					док.товары[ТекСтрока.номерСтроки-1].СуффиксЗаказа = ШК2;
				исключение
					#если клиент тогда
						сообщить(" заказ - "+ордер+" "+ОписаниеОшибки());
					# конецесли
				конецПопытки;
				ЕстьИзмененияВДокументе = истина;
			КонецЦикла;	
			
		иначе
			
			#если клиент тогда
				сообщить(" заказ - "+ордер+" - код состояния -"+Результат.кодсостояния);
			# конецесли
			
		конецЕсли;
	
		текстр=текстр+1;
	конецЦикла;
		
	Если ЕстьИзмененияВДокументе ТОгда
		
		Док.записать();
		
	КонецЕсли;	
	
	возврат неопределено;     

		
конецФункции

//-------------------------------------------
//  нечаева 06,12,21----


// в одну РНК
Процедура ЗагрузитьвРНКст(СтруктураЗаказаОбщая)
	
	//	сообщить("начало загрузки");
	
	Организация=Неопределено;
	Менеджер=Неопределено;
	Регион=Неопределено;
	Договор=Неопределено;
	Подразделение=Неопределено;
	ОтсрочкаПлатежа=Неопределено;
	КодПоставщикаКонтрагента=Неопределено;
	ПунктДоставки=Неопределено;
	НомерЗаказа=Неопределено;
	ТипILNКонтрагента=Неопределено;
	ДатаЗаказа=Неопределено;
	ДатаОтгрузки=Неопределено;
	Склад=Неопределено;   //Спр
	ПРизКр=0;
	//-----------------------------------------------------------------------
	//      обрабатываем заказы.  пока в РНК грузим
	//-----------------------------------------------------------------------
	// выделяем отдельные заказы. и каждый в отдельную РНК пока.
	
	// ответ список отправлений
	//	{
	//  "result": [
	//    {
	//      "order_id": 128903259,
	//      "order_number": "29750371-0013",
	//      "posting_number": "29750371-0013-1",
	//      "status": "delivering",
	//      "cancel_reason_id": 0,
	//      "created_at": "2020-02-27T11:48:08Z",
	//      "in_process_at": "2020-02-27T12:52:11Z",
	//      "shipment_date": "2020-03-06T10:00:00Z",
	//      "products": [
	//        {
	//          "sku": 147755222,
	//          "name": "Гантель неопреновая Starfit DB-201 2.5 кг. фиолетовая",
	//          "quantity": 2,
	//          "offer_id": "УТ-00009071",
	//          "price": "529.0000"
	//        }
	//      ],
	//      "barcodes": {
	//        "upper_barcode": "%101%168789800",
	//        "lower_barcode": "17736565768000"
	//      }
	//    }
	//  ]
	//}
	
	
	
	// загрузим товары из заказа
	ТЗШК=Новый ТаблицаЗначений;
	ТЗШК.Колонки.Добавить("Номстр");
	ТЗШК.Колонки.Добавить("шк1");
	ТЗШК.Колонки.Добавить("шк2");
	ТЗШК.Колонки.Добавить("шк3");
	ТЗШК.Колонки.Добавить("рид"); 
	ТЗШК.Колонки.Добавить("номерЗаказа");
	ТЗШК.Колонки.Добавить("ДатаЗаказа");
	ТЗШК.Колонки.Добавить("номенклатура");
	тзшк.Очистить();
	
	
	
	НовРНК= документы.РасходнаяНакладная.СоздатьДокумент();
	ДокОбъект =НовРНК;
	
	ДатаЗаказа=Неопределено;
	ДатаОтгрузки=Неопределено;
	Склад=Неопределено;   //Справочники.Склады.НайтиПоКоду("STA-61");
	Контрагент=МПКонтрагент;
	Если Контрагент=Неопределено тогда
		Контрагент=Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;	
	ПунктДоставки=МППунктДоставки; // фбс
	
	ДатаДоставки=ДобавитьДату(ТекущаяДата(),24*60*60);  // прибавим день  - тут рабочии дни потом использовать!!!!!!
	
	
	//ВремяДоставки = СтрШапка.ВремяДоставки;
	Организация=Справочники.Организации.НайтиПоКоду("SS-001"); 
	
	
	ТипЦен=Контрагент.ТипЦен;
	Договор=МПДоговор;
	
	Если не (Договор=Неопределено) и не (Договор=справочники.Договоры.ПустаяСсылка()) Тогда
		//ТипЦен		=Договор.ТипЦен;
		ОтсрочкаПлатежа =Договор.ОтсрочкаПлатежа;
		Если ЗначениеЗаполнено(Договор.Организация) Тогда
			Организация=Договор.Организация;		
		КонецЕсли;
	КонецЕсли;
	
	ДокОбъект.ДопОбработки.Очистить();
	Для Каждого СтрокаТЧ Из Контрагент.ВидыДопОбработок Цикл
		СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
		СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
	КонецЦикла; 
	//нечаева 23,03,17+++
	// добавляем из пункта доставки доп. обработки.
	Попытка
		Для Каждого СтрокаТЧ Из ПунктДоставки.ВидыДопОбработок Цикл
			СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
			СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
		КонецЦикла;  
	Исключение
	КонецПопытки;
	
	ДокОбъект.Дата=ТекущаяДата();
	ЗаполнитьШапкуДокумента(ДокОбъект, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
	//УстановитьНомерДокумента2(ДокОбъект);
	ДокОбъект.Контрагент=Контрагент;
	ДокОбъект.Организация=Организация;
	ДокОбъект.Договор=Договор;
	ДокОбъект.ИБ=Справочники.ИБ.НайтиПоКоду("SSP");
	ДокОбъект.Менеджер= Контрагент.Менеджер;
	ДокОбъект.НомерЗаказа= "00000"; //НомерОтправления; //УбратьНули(НомЗаказа,Контрагент.УбиратьНулиПередНомеромЗаказа);
	ДокОбъект.комментарий = "Заказ из ИМ, со склада продавца";
	//ДокОбъект.КодПоставщика=КодПоставщикаКонтрагента;
	
	//ДокОбъект.Регион = Регион;
	ТипШК=перечисления.ТипыШтрихКодов.Штука;
	ДокОбъект.КодОперации =перечисления.КодыОперацийОстатки.Комиссия;
	
	
	Склад = МПСклад;  // ИМ
	
	ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;		
	ДокОбъект.ТипЦен=ТипЦен; //Контрагент.ТипЦен;
	ДокОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН; 
	//++Данилова Е.В. 30.09.2025  HELP-7048 
	//Подразделение = Контрагент.Менеджер.Подразделение;
	Подразделение = ЗаполнениеДокументов.ПодразделениеПродажПоМенеджеру(Контрагент.Менеджер);
	//--Данилова Е.В. 30.09.2025
	ДокОбъект.Подразделение = Подразделение;
	ДокОбъект.ЛевыйКонтрагент=Контрагент;
	ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
	ДокОбъект.Отгружен=перечисления.Отгружен.Резерв;
	ДокОбъект.ПунктДоставки=ПунктДоставки;
	ДокОбъект.Склад=Склад;		
	УстановитьНомерДокумента2(ДокОбъект);
	ДокОбъект.Валюта=Справочники.Валюты.НайтиПоКоду("810");
	
	Попытка
		ДокОбъект.ДатаЗаказа=Дата(СтрЗаменить(ДатаЗаказа, "-", ""));
		
		ДатаИзЗог = Дата(1,1,1);
		ДокОбъект.ДатаОтгрузки=Дата(СтрЗаменить(ДатаДоставки, "-", ""));
		
	Исключение
	КонецПопытки;
	
	
	//
	//Если СокрЛП(Контрагент.Код)=КодМетро И (Лев(ДокОбъект.Номер,3)<>"SSP" или Лев(ДокОбъект.Номер,3)<>"SST")  Тогда
	//	УстановитьНомерДокумента2(ДокОбъект);	
	//КонецЕсли;
	
	//ДокОбъект.КодОперации=Перечисления.КодыОперацийОстатки.Реализация;
	ДокОбъект.ДатаОформления	=ДокОбъект.Дата;
	СкидкаКонтрагента=ПолучитьРеквизитРодителя(Контрагент,"Скидка");
	ДокОбъект.Скидка=СкидкаКонтрагента;
	ПунктДоставки_ПриИзменении(ПунктДоставки,ДокОбъект);
	// нечаева 28,04,21+++
	датаотгрузки = ДобавитьДату(текущаяДата(),60*60*24*2);
	Если ЧАс(ТекущаяДата())>=13 тогда
		 датаотгрузки = ДобавитьДату(текущаяДата(),60*60*24*2);
	 Иначе
		 датаотгрузки = ДобавитьДату(текущаяДата(),60*60*24);
	КонецЕсли;	 
	// нечаева 28,04,21---
	
	ДокОбъект.ДатаОтгрузки = датаотгрузки;;  // алгоритм расписать
	
	
	номстр = 1;
	
	Для каждого СтруктураЗаказа из СтруктураЗаказаОбщая Цикл 
		
		НомерОтправления = СтруктураЗаказа.order_id;
		
		НомерЗаказа=СтруктураЗаказа.order_id;
		ДатаЗаказа=СтруктураЗаказа.date_created;
		ДТ = СтруктураЗаказа.date_created;
		ПДТ = Лев(ДТ,СтрНайти(ДТ,"T",,,1)-1);
		Год  = Лев(ПДТ,4);
		День = Прав(ПДТ,2);
		Месяц = Сред(ПДТ,6,2);
		Датазаказа = дата(год, месяц, день);
		//сообщить(датазаказа);
		Если ДатаЗаказа<НачалоМесяца(ТекущаяДата()) тогда
			продолжить;
		КонецЕсли;	
		
		
		// если = 0 , то проверим по регистру , что раньше не загружали еще.
		ТЗ1 = Новый ТаблицаЗначений;
		
		запрос = новый запрос;
		запрос.Текст="ВЫБРАТЬ
		|	ЗаказКлиентаFBSТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаFBSТовары.ШтрихКод КАК ШтрихКод,
		|	ЗаказКлиентаFBSТовары.НомерЗаказа КАК НомерЗаказа
		|ИЗ
		|	Документ.ЗаказКлиентаFBS.Товары КАК ЗаказКлиентаFBSТовары
		|ГДЕ
		|	ЗаказКлиентаFBSТовары.НомерЗаказа = &текДок
		|	И НЕ ЗаказКлиентаFBSТовары.Ссылка.ПометкаУдаления
		|	И ЗаказКлиентаFBSТовары.Ссылка.Дата >= &текдата ";
		
		
		запрос.УстановитьПараметр("ТекДок",Номерзаказа);
		запрос.УстановитьПараметр("ТекДата",НачалоДня(Датазаказа));
		
		тз1 =Запрос.Выполнить().Выгрузить();
		
		
		Если тз1.Количество()>0 тогда
			#если клиент тогда
				
				сообщить(""+номерзаказа+" уже загружен");
			# конецесли
			//
			продолжить; // заказ уже загружен    //!!!!!!!!!!
			
			// пока не проверяем
		конецЕсли;
		
		ДатаЗаказа=Дата(год,месяц,день);
		
		
		//ДТ = СтруктураЗаказа.shipment_date;
		//ПДТ = Лев(ДТ,СтрНайти(ДТ,"T",,,1)-1);
		//Год  = Лев(ПДТ,4);
		//День = Прав(ПДТ,2);
		//Месяц = Сред(ПДТ,6,2);
		Для каждого ТекСтр из СтруктураЗаказа.items Цикл
			
			//		
			Статус = ТекСтр.status;   ///!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
			#если клиент тогда
				
				сообщить(""+" "+НомерОтправления+"  - "+ТекСтр.status+" ");
			# конецесли
			Если статус <>0 тогда
				продолжить;
			КонецЕсли;
			//
			
			//----------------------------------------------------------------------------------
			Ном = Справочники.Номенклатура.ПустаяСсылка();
			
			Артикул = ТекСтр.chrt_id;   // или offer_id??? 
			ШК = "";
			Наименование = "";
			Ном = НайтиПОШКМатрица2(ШК,Артикул,Контрагент);
			Кол = 1;    // всегда 1 штука.
			Цена = ТекСтр.total_price/100; //в копейках
			Рид =  ТекСтр.rid;
			
			Если Ном = Справочники.Номенклатура.ПустаяСсылка() ТОгда
				//Ошибки.Добавить("Для РНК "+ДокОбъект.Номер+" не найдена номенклатура. "+наименование+" "+кол+" шт." );
				//КритическиеОшибкиОзон.Добавить("Для заказа "+номерзаказа+" Не найдена номенклатура "+Наименование+", артикул -" + артикул+ " количество - "+кол+ "   цена - "+цена );
				#если клиент тогда
					
					сообщить("Для заказа "+номерзаказа+" Не найдена номенклатура "+Наименование+", артикул -" + артикул+ " количество - "+кол+ "   цена - "+цена );
				# конецесли
				Ошибки.Добавить("Для заказа "+номерзаказа+" Не найдена номенклатура "+Наименование+", артикул -" + артикул+ " количество - "+кол+ "   цена - "+цена);
				продолжить;
			КонецЕсли;	
			
			Если кол >0 Тогда
				Нов = ДокОбъект.Товары.Добавить();
				Нов.Номенклатура = Ном;
				Нов.Количество = кол;
				Нов.Заявка = кол;
				Нов.ПодтвержденнаяЗаявка = кол;
				Нов.Цена = цена;
				
				ПриИзмененииНоменклатурыТабЧасти(Нов, ДокОбъект);
				РассчитатьСуммуТабЧасти(Нов, ДокОбъект);
			иначе
				продолжить;
			КонецЕсли;	
			
			Шк1 =  ТекСтр.sticker.wbsticker_id_parts.A;
			Шк2 =  ТекСтр.sticker.wbsticker_id_parts.B;
			Шк3 =  ТекСтр.sticker.wbsticker_encoded;
			
			СтрШК=тзшк.Добавить();
			Стршк.номстр =номстр;
			СтрШк.Шк1 =шк1;
			СтрШк.шк2=Шк2;
			СтрШк.шк3=Шк3;
			СтрШк.рид =рид;
			СтрШк.номенклатура =ном;
			стрШк.номерзаказа= НомерОтправления;
			
			номстр=номстр+1;
			
		КонецЦикла;
	конецЦикла;
	
	//---------------------------------------------------------------------------------------------------------------
	
	ПересчетТЧ(ДокОбъект,"Товары",ДокОбъект.Валюта,ДокОбъект.Валюта,ДокОбъект.Курс,ДокОбъект.Курс,Истина);
	//ДокОбъект.ПолучитьФорму("ФормаДокумента").Открыть();;
	
	Если ДокОбъект.Товары.Количество() = 0 тогда
		возврат;
	конецЕсли;	
	
	ПРКрОш = 0;
	
	//Полагаю, нужен будет новый регистр "РНК - номенклатура - порядковый номер - текст этикетки". Особенно если они этот текст передают сразу. 
	//	Но так как печать этикетки в случае отсутствия записи в регистре тоже нужна, то можно и сразу сделать. Если это не очень сложно. 
	//	//---------------------------------------------------------------------------------------
	
	
	НакладнаяСсылка		=ДокОбъект;
	ВидНакладной		=НакладнаяСсылка.Метаданные().Имя;
	ТипУзла=ПараметрыСеанса.ЭтотУзел.ТипУзла;
	
	попытка
		если ЗначениеЗаполнено(НакладнаяСсылка.ТипДоставки) тогда
			ТекТипДоставки=НакладнаяСсылка.ТипДоставки;
		иначе
			ТекТипДоставки=НакладнаяСсылка.ПунктДоставки.ТипДоставки;
		КонецЕсли;
	Исключение
		ТекТипДоставки=НакладнаяСсылка.ПунктДоставки.ТипДоставки;
	КонецПопытки;
	
	
	НакладнаяОбъект=ДокОбъект;
	
	//--------------------------------------------------------------------------------------
	//заполним комплектующие.
	
		
	КонтрольДублейСтрок(ДокОбъект) ;
	
	
	ЗаполнитьКомплектующие(ДокОбъект);
	
	//----------------------------------------------------------------------------------------
	//                     первичная запись документа!!!!!!!!
	//----------------------------------------------------------------------------------------
	Попытка
		ДокОбъект.Записать(режимЗаписиДокумента.Запись);
		//Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
		
	Исключение
		ЗаписатьВЛог("ОшибкиЕкод"," !ошибка первичной записи документа1 "+ ОписаниеОшибки(),"Информация"); 
		
		Инфо = ИнформацияОбОшибке();
		Если Найти(Инфо.Описание, "Не уникальный номер документа") > 0 Тогда
			ОбновитьНумерациюОбъектов();
			УстановитьНомерДокумента2(ЭтотОбъект);
			Попытка
				ДокОбъект.Записать(режимЗаписиДокумента.Запись);
				//Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
				//	СообщитьМенеджеру(ДокОбъект);  //+++
				
				
			Исключение
				ЗаписатьВЛог("ОшибкиЕкод"," !ошибка первичной записи документа2 "+ ОписаниеОшибки(),"Информация"); 
				КритическиеОшибкиОзон2.Добавить("Заказ "+ДокОбъект.Ссылка+"не записан первичный документ!"+ОписаниеОшибки());
				СообщитьКритОшибки();
				КритическиеОшибкиОзон2.очистить();
				
				возврат;
				
			КонецПопытки;
		Иначе	
			ЗаписатьВЛог("ОшибкиЕкод"," !ошибка первичной записи документа3 "+ ОписаниеОшибки(),"Информация"); 
			//КритическиеОшибкиОзон2.Добавить("Заказ "+ДокОбъект.Ссылка+"не	записан первичный документ!"+ОписаниеОшибки());
			
			СообщитьКритОшибки();
			
			КритическиеОшибкиОзон2.очистить();
			
			возврат;
			
		КонецЕсли;
		
		
	КонецПопытки;
	
	
	НовДок = документы.ЗаказКлиентаFBS.СоздатьДокумент();
	НовДок.ДокОснование = ДокОбъект.Ссылка;
	НовДок.контрагент = ДокОбъект.Контрагент;
	Новдок.Дата = ТекущаяДата();
	
	
	Для каждого текстр из тзшк цикл
		НовСтр =новдок.Товары.Добавить();
		попытка
			//ЗаписьВРег.НомерСтрокиРНК=текстр.Номстр;
			//	ЗаписьВРег.Период=ДокОбъект.Ссылка.Дата;
			НовСтр.ПрефиксЗаказа=текстр.ШК1;
			НовСтр.СуффиксЗаказа=текстр.ШК2;
			Новстр.ШтрихКод=текстр.ШК3;
			Новстр.Рид = текстр.рид;
			Новстр.номерЗаказа = текстр.номерЗаказа;
			//Новстр.Рид = текстр.номерзаказа;
			//Новстр.номерЗаказа = текстр.рид;
			
			Новстр.номенклатура = текстр.номенклатура;
			новстр.Количество = 1;
			новстр.отменен = ложь;
			
		исключение
			//сообщить(""+ОписаниеОшибки());
			//КритическиеОшибкиОзон2.Добавить("Заказ "+ДокОбъект.Ссылка+"нулевой ШК!");
			//СообщитьКритОшибки();
			//КритическиеОшибкиОзон2.очистить();
			ШкЗаписаны=ложь;
		конецПопытки;
	конеццикла;
	Новдок.Записать();
	новдок.Записать(РежимЗаписиДокумента.Проведение);
	//*************************************************************************************************************************
	// сразу же будем переводить на сборку, как записали.
	//**************************************************************************************************************************
	СобратьЗаказы(НакладнаяОбъект,1); // 1- на сборку, 2 - готово к отгрузке
	
	//***************************************************************************************************************************	
	Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
	// запишем все ШК
	
	#если клиент тогда	
		сообщить(ДокОбъект.Номер);
	#конецЕсли	
	
	//возврат;
	// здесь пробуем передать заказ на сборку
	
	//---------------------------------------------------------------------------------------
	// остатки пока тоже не будем перепроверять.
	
	//ТабОстатков = ПолучитьОстатокТовара(ДокОбъект.Комплектующие.Выгрузитьколонку("Номенклатура"));
	//// проверим по остаткам.
	//хватает = 1;
	//ДЛя  каждого ТекСтрока из  ДокОбъект.Комплектующие цикл
	//	
	//	колОст = 0;
	//	НайденнаяСтрока = ТабОстатков.Найти(ТекСтрока.Номенклатура,"Номенклатура");
	//	Если НайденнаяСтрока <> Неопределено ТОгда
	//		КолОст=НайденнаяСтрока.КолКонФакт; 
	//	Иначе
	//		колОст = 0;
	//	КонецЕсли;
	//	
	//	Если КолОст - Текстрока.Количество<0 ТОгда
	//		хватает =0;
	//		прервать;
	//	КонецЕсли;	
	//	
	//конецЦикла;
	//
	//Если ДокОбъект.Комплектующие.Количество() =0 Тогда
	//	ДЛя  каждого ТекСтрока из  ДокОбъект.товары цикл
	//		
	//		колОст = 0;
	//		НайденнаяСтрока = ТабОстатков.Найти(ТекСтрока.Номенклатура,"Номенклатура");
	//		Если НайденнаяСтрока <> Неопределено ТОгда
	//			КолОст=НайденнаяСтрока.КолКонФакт; 
	//		Иначе
	//			колОст = 0;
	//		КонецЕсли;
	//		
	//		Если КолОст - Текстрока.Количество<0 ТОгда
	//			хватает =0;
	//			прервать;
	//		КонецЕсли;	
	//		
	//	конецЦикла;
	//конецЕсли;
	//
	////сообщить(" хватает - "+хватает);
	//
	//// Если не хватает товара, то не проводим и не сбрасываем на склад. Будут сбрасывать вручную
	//Если Не Хватает Тогда
	//	
	//	Ошибки.Добавить("Для РНК "+ДокОбъект+" Не хватает номенклатуры на остатках. Документ не проведен и не сброшен на склад!");
	//	#если клиент тогда	
	//		Сообщить("Для РНК "+ДокОбъект+" Не хватает номенклатуры на остатках. Документ не проведен и не сброшен на склад!" );
	//		
	//	#конецЕсли	
	//	
	//	СообщитьМенеджеру(ДокОбъект);  //+++
	//	файлы.очистить();
	//	Ошибки.Очистить();
	//	
	//	//возврат;
	//	
	//конецЕсли;
	
	//-------------------------------------------------------------------------------------------------------------------
	// сбросим на склад, если все есть на остатках
	
	// !!!! на склад не сбрасываем !!!!
	//
	//Если ЗначениеНеЗаполнено(НакладнаяОбъект.ДатаВыгрузки) Тогда
	//	НакладнаяОбъект.ДатаВыгрузки=ТекущаяДата();			
	//КонецЕсли; 
	//НакладнаяОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.КОтправкеНаСклад; 		
	//
	//
	НакладнаяОбъект.дата=ТекущаяДата();
	//НакладнаяОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	попытка
		НакладнаяОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	исключение
		
		//пока не проверяем на проведение
		//КритическиеОшибкиОзон2.Добавить("Заказ "+ДокОбъект.НомерЗаказа+" не проведен и не сброшен на склад!");
		//КритическиеОшибкиОзон.Добавить("Заказ "+ДокОбъект.НомерЗаказа+" не проведен и не сброшен на склад!"+НакладнаяОбъект);
		//
		//КритическиеОшибкиОзон2.Добавить(""+ОписаниеОшибки());
		//
		//СообщитьКритОшибки();
		//КритическиеОшибкиОзон2.очистить();
		//ШкЗаписаны=ложь;
		//
		
		//СообщитьМенеджеру(ДокОбъект);  //+++
		//Если  КритическиеОшибкиОзон.количество()>0 Тогда
		//	СообщитьМенеджеруОзон(ДокОбъект);
		//	КритическиеОшибкиОзон.очистить();
		//КонецЕсли; 
		//Ошибки.Очистить();
		//
		//возврат;
		
	конецпопытки;
	//------------------------------------------------------------------------------------------------------------------
	
	// если не собрали - соберем.
	СобратьЗаказы(НакладнаяОбъект,1);
	
	//------------------------------------------------------------------------------------------------------------------
	
	СообщитьМенеджеру(ДокОбъект);  //+++
	Если  КритическиеОшибкиОзон.количество()>0 или ошибки.Количество()>0 Тогда
		СообщитьМенеджеруОзон(ДокОбъект);
		КритическиеОшибкиОзон.очистить();
	КонецЕсли; 
	Ошибки.Очистить();
	
	
	
КонецПРоцедуры	



// поделим на 2 рнк

Процедура ПроверкаКоличестваЗаказов(СтруктураЗаказаОбщая)
	
	 	//нечаева 05,06,21++
	попытка
		ВсегозаказовСделано = СтруктураЗаказаОбщая.Total;
		ОбщееКолЗаказов = ВсегозаказовСделано;
		#если клиент тогда
			
			сообщить(""+ВсегозаказовСделано+"  - всего заказов за период!");
		# конецесли
	исключение
	конецпопытки;
	
		

	
КонецПроцедуры	

Процедура ЗагрузитьвРНК(СтруктураЗаказаОбщая)
	
	
	//ПроверкаКоличестваЗаказов(СтруктураЗаказаОбщая);

	
	
	//возврат;
	
	
	Организация=Неопределено;
	Менеджер=Неопределено;
	Регион=Неопределено;
	Договор=Неопределено;
	Подразделение=Неопределено;
	ОтсрочкаПлатежа=Неопределено;
	КодПоставщикаКонтрагента=Неопределено;
	ПунктДоставки=Неопределено;
	НомерЗаказа=Неопределено;
	ТипILNКонтрагента=Неопределено;
	ДатаЗаказа=Неопределено;
	ДатаОтгрузки=Неопределено;
	Склад=Неопределено;   //Спр
	ПРизКр=0;
	
	
	
	
	ДатаЗаказа=Неопределено;
	ДатаОтгрузки=Неопределено;
	Склад=Неопределено;   //Справочники.Склады.НайтиПоКоду("STA-61");
	Контрагент=МПКонтрагент;
	Если Контрагент=Неопределено тогда
		Контрагент=Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;	
	ПунктДоставки=МППунктДоставки; // фбс
	
	ДатаДоставки=ДобавитьДату(ТекущаяДата(),24*60*60);  // прибавим день  - тут рабочии дни потом использовать!!!!!!
	
	
	//ВремяДоставки = СтрШапка.ВремяДоставки;
	Организация=Справочники.Организации.НайтиПоКоду("SS-001"); 
	
	
	ТипЦен=Контрагент.ТипЦен;
	Договор=МПДоговор;
	
		
	
	//-----------------------------------------------------------------------
	//      обрабатываем заказы.  пока в РНК грузим
	//-----------------------------------------------------------------------
	// выделяем отдельные заказы. и каждый в отдельную РНК пока.
	
		
	// загрузим товары из заказа
	ТЗШК=Новый ТаблицаЗначений;
	ТЗШК.Колонки.Добавить("Номстр");
	ТЗШК.Колонки.Добавить("шк1");
	ТЗШК.Колонки.Добавить("шк2");
	ТЗШК.Колонки.Добавить("шк3");
	ТЗШК.Колонки.Добавить("рид"); 
	ТЗШК.Колонки.Добавить("цена");
	ТЗШК.Колонки.Добавить("номерЗаказа");
	ТЗШК.Колонки.Добавить("ДатаЗаказа");
	ТЗШК.Колонки.Добавить("номенклатура");
	ТЗШК.Колонки.Добавить("Комплект");
	// Кухарь А.Ю. 14.12.2021 начало
	//Для определения времени доставки
	ТЗШК.Колонки.Добавить("ДатаВремяЗаказа");
	// Кухарь А.Ю. 14.12.2021 конец

	тзшк.Очистить();
	
	
	номстр = 1;
	
	Для каждого СтруктураЗаказа из СтруктураЗаказаОбщая.orders Цикл 
		
		НомерОтправления = СтруктураЗаказа.orderid;
		
		НомерЗаказа=СтруктураЗаказа.orderid;
		ДатаЗаказа=СтруктураЗаказа.dateCreated;
		ДТ = СтруктураЗаказа.dateCreated;
		ПДТ = Лев(ДТ,СтрНайти(ДТ,"T",,,1)-1);
		Год  = Лев(ПДТ,4);
		День = Прав(ПДТ,2);
		Месяц = Сред(ПДТ,6,2);
		
		// Кухарь А.Ю. 14.12.2021 начало
		// // Для определения даты и времени доставки
		Час = Сред(ДТ,СтрНайти(ДТ,"T",,,1)+1,2);
		попытка
			ДатаВремяЗаказа = дата(год, месяц, день,Час,0,0);
		Исключение
			ДатаВремяЗаказа=ТекущаяДата()-3*3600
		КонецПопытки;
		// Кухарь А.Ю. 14.12.2021 конец

		
		Датазаказа = дата(год, месяц, день);
		//сообщить(датазаказа);
		
		//Если ДатаЗаказа<НачалоМесяца(ТекущаяДата()) тогда
		//	продолжить;
		//КонецЕсли;	
		
		
		// если = 0 , то проверим по регистру , что раньше не загружали еще.
		ТЗ1 = Новый ТаблицаЗначений;
		
		запрос = новый запрос;
		запрос.Текст="ВЫБРАТЬ
		|	ЗаказКлиентаFBSТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаFBSТовары.ШтрихКод КАК ШтрихКод,
		|	ЗаказКлиентаFBSТовары.НомерЗаказа КАК НомерЗаказа
		|ИЗ
		|	Документ.ЗаказКлиентаFBS.Товары КАК ЗаказКлиентаFBSТовары
		|ГДЕ
		|	ЗаказКлиентаFBSТовары.НомерЗаказа = &текДок
		|	И НЕ ЗаказКлиентаFBSТовары.Ссылка.ПометкаУдаления
		|	И ЗаказКлиентаFBSТовары.Ссылка.Дата >= &текдата ";
		
		
		запрос.УстановитьПараметр("ТекДок",Номерзаказа);
		запрос.УстановитьПараметр("ТекДата",НачалоДня(Датазаказа));
		
		тз1 =Запрос.Выполнить().Выгрузить();
		
		
		Если тз1.Количество()>0 тогда
			#если клиент тогда
				
				сообщить(""+номерзаказа+" уже загружен");
			# конецесли
			//
			продолжить; // заказ уже загружен    //!!!!!!!!!!
					
		конецЕсли;
		
		ДатаЗаказа=Дата(год,месяц,день);
		
		
	//	Для каждого ТекСтр из СтруктураЗаказа.items Цикл
			
			//		
			Статус = СтруктураЗаказа.status;   ///!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
			#если клиент тогда
				
				сообщить(""+" "+НомерОтправления+"  - "+СтруктураЗаказа.status+"  -  "+ДатаЗаказа);
			# конецесли
			Если статус <>0 тогда
				продолжить;        //!!!!!!!!
			КонецЕсли;
			
			//#если клиент тогда
			//	
			//	сообщить(""+" "+НомерОтправления+"  - "+ТекСтр.status+" ");
			//# конецесли

			
			//----------------------------------------------------------------------------------
			Ном = Справочники.Номенклатура.ПустаяСсылка();
			
			Артикул = СтруктураЗаказа.chrtid;   
			ШК = "";
			Наименование = "";
			Ном = НайтиПОШКМатрица2(ШК,Артикул,Контрагент);
			Кол = 1;    // всегда 1 штука.
			Цена = СтруктураЗаказа.totalprice/100; //в копейках
			Рид =  СтруктураЗаказа.rid;
			
			Если Ном = Справочники.Номенклатура.ПустаяСсылка() ТОгда
				
				#если клиент тогда
					сообщить("Для заказа "+номерзаказа+" Не найдена номенклатура "+Наименование+", артикул -" + артикул+ " количество - "+кол+ "   цена - "+цена );
				# конецесли
				Ошибки.Добавить("Для заказа "+номерзаказа+" Не найдена номенклатура "+Наименование+", артикул -" + артикул+ " количество - "+кол+ "   цена - "+цена);
				
				продолжить;   //!!!!!
				
			КонецЕсли;	
			
					
			Шк1 = ""; //СтруктураЗаказа.sticker.wbstickerIdParts.A;
			Шк2 = ""; // СтруктураЗаказа.sticker.wbstickerIdParts.B;
			Шк3 = ""; //  СтруктураЗаказа.sticker.wbstickerEncoded;
			
			СтрШК=тзшк.Добавить();
			Стршк.номстр =номстр;
			СтрШк.Шк1 =шк1;
			СтрШк.шк2=Шк2;
			СтрШк.шк3=Шк3;
			СтрШк.рид =рид;
			СтрШк.номенклатура =ном;
			стрШк.номерзаказа= НомерОтправления;
			СтрШк.цена = цена ;
			СтрШк.комплект = 0;
			
			Если ном.коплектующие.количество()>0 тогда
				СтрШк.комплект = 1;
			КонецЕсли;	
							
			// Кухарь А.Ю. 14.12.2021 начало
			//Для определения времени доставки
			СтрШк.ДатаВремяЗаказа=ДатаВремяЗаказа;
			// Кухарь А.Ю. 14.12.2021 конец
			
			номстр=номстр+1;
			
	//	КонецЦикла;
		
	конецЦикла;
	
	СформироватьДокументы(СтруктураЗаказаОбщая,ТЗШК,1); //комплекты
	СформироватьДокументы(СтруктураЗаказаОбщая,ТЗШК,0); // не комплекты

	
	пп=1;
	
	
КонецПРоцедуры	

// в одну РНК
Процедура СформироватьДокументы(СтруктураЗаказаОбщая,ТЗШК,ПрКомплектов)
	
	//	сообщить("начало загрузки");
	
	Организация=Неопределено;
	Менеджер=Неопределено;
	Регион=Неопределено;
	Договор=Неопределено;
	Подразделение=Неопределено;
	ОтсрочкаПлатежа=Неопределено;
	КодПоставщикаКонтрагента=Неопределено;
	ПунктДоставки=Неопределено;
	НомерЗаказа=Неопределено;
	ТипILNКонтрагента=Неопределено;
	ДатаЗаказа=Неопределено;
	ДатаОтгрузки=Неопределено;
	Склад=Неопределено;   //Спр
	ПРизКр=0;
	//-----------------------------------------------------------------------
	//      обрабатываем заказы.  пока в РНК грузим
	//-----------------------------------------------------------------------
	// выделяем отдельные заказы. и каждый в отдельную РНК пока.
	
		
		
	
	НовРНК= документы.РасходнаяНакладная.СоздатьДокумент();
	ДокОбъект =НовРНК;
	
	ДатаЗаказа=Неопределено;
	ДатаОтгрузки=Неопределено;
	Склад=Неопределено;   //Справочники.Склады.НайтиПоКоду("STA-61");
	Контрагент=МПКонтрагент;
	Если Контрагент=Неопределено тогда
		Контрагент=Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;	
	ПунктДоставки=МППунктДоставки; // фбс
	
	ДатаДоставки=ДобавитьДату(ТекущаяДата(),24*60*60);  // прибавим день  - тут рабочии дни потом использовать!!!!!!
	
	
	//ВремяДоставки = СтрШапка.ВремяДоставки;
	Организация=Справочники.Организации.НайтиПоКоду("SS-001"); 
	
	
	ТипЦен=Контрагент.ТипЦен;
	Договор=МПДоговор;
	
	Если не (Договор=Неопределено) и не (Договор=справочники.Договоры.ПустаяСсылка()) Тогда
		//ТипЦен		=Договор.ТипЦен;
		ОтсрочкаПлатежа =Договор.ОтсрочкаПлатежа;
		Если ЗначениеЗаполнено(Договор.Организация) Тогда
			Организация=Договор.Организация;		
		КонецЕсли;
	КонецЕсли;
	
	ДокОбъект.ДопОбработки.Очистить();
	Для Каждого СтрокаТЧ Из Контрагент.ВидыДопОбработок Цикл
		СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
		СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
	КонецЦикла; 
	//нечаева 23,03,17+++
	// добавляем из пункта доставки доп. обработки.
	Попытка
		Для Каждого СтрокаТЧ Из ПунктДоставки.ВидыДопОбработок Цикл
			СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
			СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
		КонецЦикла;  
	Исключение
	КонецПопытки;
	
	ДокОбъект.Дата=ТекущаяДата();
	ЗаполнитьШапкуДокумента(ДокОбъект, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
	//УстановитьНомерДокумента2(ДокОбъект);
	ДокОбъект.Контрагент=Контрагент;
	ДокОбъект.Организация=Организация;
	ДокОбъект.Договор=Договор;
	ДокОбъект.ИБ=Справочники.ИБ.НайтиПоКоду("SSP");
	ДокОбъект.Менеджер= Контрагент.Менеджер;
	ДокОбъект.НомерЗаказа= "00000"; //НомерОтправления; //УбратьНули(НомЗаказа,Контрагент.УбиратьНулиПередНомеромЗаказа);
	ДокОбъект.комментарий = "Заказ из ИМ, со склада продавца";
	//ДокОбъект.КодПоставщика=КодПоставщикаКонтрагента;
	
	//ДокОбъект.Регион = Регион;
	ТипШК=перечисления.ТипыШтрихКодов.Штука;
	ДокОбъект.КодОперации =перечисления.КодыОперацийОстатки.Комиссия;
	
	
	Склад = МПСклад;  // ИМ
	
	ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;		
	ДокОбъект.ТипЦен=ТипЦен; //Контрагент.ТипЦен;
	ДокОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН; 
	//++Данилова Е.В. 30.09.2025  HELP-7048
	//Подразделение = Контрагент.Менеджер.Подразделение;
	Подразделение = ЗаполнениеДокументов.ПодразделениеПродажПоМенеджеру(Контрагент.Менеджер);
	//--Данилова Е.В. 30.09.2025
	ДокОбъект.Подразделение = Подразделение;
	ДокОбъект.ЛевыйКонтрагент=Контрагент;
	ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
	ДокОбъект.Отгружен=перечисления.Отгружен.Резерв;
	ДокОбъект.ПунктДоставки=ПунктДоставки;
	ДокОбъект.Склад=Склад;		
	УстановитьНомерДокумента2(ДокОбъект);
	ДокОбъект.Валюта=Справочники.Валюты.НайтиПоКоду("810");
	
	Попытка
		ДокОбъект.ДатаЗаказа=Дата(СтрЗаменить(ДатаЗаказа, "-", ""));
		
		ДатаИзЗог = Дата(1,1,1);
		ДокОбъект.ДатаОтгрузки=Дата(СтрЗаменить(ДатаДоставки, "-", ""));
		
	Исключение
	КонецПопытки;
	
	
	//
	//Если СокрЛП(Контрагент.Код)=КодМетро И (Лев(ДокОбъект.Номер,3)<>"SSP" или Лев(ДокОбъект.Номер,3)<>"SST")  Тогда
	//	УстановитьНомерДокумента2(ДокОбъект);	
	//КонецЕсли;
	
	//ДокОбъект.КодОперации=Перечисления.КодыОперацийОстатки.Реализация;
	ДокОбъект.ДатаОформления	=ДокОбъект.Дата;
	СкидкаКонтрагента=ПолучитьРеквизитРодителя(Контрагент,"Скидка");
	ДокОбъект.Скидка=СкидкаКонтрагента;
	ПунктДоставки_ПриИзменении(ПунктДоставки,ДокОбъект);
	// нечаева 28,04,21+++
	
	
	//Кухарь А.Ю.  07.02.2022 начало
	//Изменение правил определения даты отгрузки. Пока не стал включать.
	//датаотгрузки = ДобавитьДату(текущаяДата(),60*60*24*2);
	//Если ЧАс(ТекущаяДата())>=13 тогда
	//	 датаотгрузки = ДобавитьДату(текущаяДата(),60*60*24*2);
	// Иначе
	//	 датаотгрузки = ДобавитьДату(текущаяДата(),60*60*24);
	//КонецЕсли;	 

	если час(ДокОбъект.Дата)>=0 и  час(ДокОбъект.Дата)<8 тогда
		датаотгрузки=НачалоДня(ДокОбъект.Дата);
	иначе
		датаотгрузки=КонецДня(ДокОбъект.Дата)+1;
	КонецЕсли;	
	//Кухарь А.Ю.  07.02.2022 конец
	

	
	ДокОбъект.ДатаОтгрузки = датаотгрузки;;  // алгоритм расписать
	
	
	номстр = 1;
	
	Для каждого ТекСтр из ТЗШК Цикл 
		
		
		Если ТекСтр.Комплект = ПРКомплектов Тогда
			Нов = ДокОбъект.Товары.Добавить();
			Нов.Номенклатура = ТекСтр.Номенклатура;
			Нов.Количество = 1;
			Нов.Заявка = 1;
			Нов.ПодтвержденнаяЗаявка = 1;
			Нов.Цена = ТекСтр.цена;
			
			ПриИзмененииНоменклатурыТабЧасти(Нов, ДокОбъект);
			РассчитатьСуммуТабЧасти(Нов, ДокОбъект);
			
		КонецЕсли;
		
		номстр=номстр+1;
		
		
	конецЦикла;
	
	//---------------------------------------------------------------------------------------------------------------
	
	ПересчетТЧ(ДокОбъект,"Товары",ДокОбъект.Валюта,ДокОбъект.Валюта,ДокОбъект.Курс,ДокОбъект.Курс,Истина);
	//ДокОбъект.ПолучитьФорму("ФормаДокумента").Открыть();;
	
	Если ДокОбъект.Товары.Количество() = 0 тогда
		возврат;
	конецЕсли;	
	
	ПРКрОш = 0;
	
	//Полагаю, нужен будет новый регистр "РНК - номенклатура - порядковый номер - текст этикетки". Особенно если они этот текст передают сразу. 
	//	Но так как печать этикетки в случае отсутствия записи в регистре тоже нужна, то можно и сразу сделать. Если это не очень сложно. 
	//	//---------------------------------------------------------------------------------------
	
	
	НакладнаяСсылка		=ДокОбъект;
	ВидНакладной		=НакладнаяСсылка.Метаданные().Имя;
	ТипУзла=ПараметрыСеанса.ЭтотУзел.ТипУзла;
	
	попытка
		если ЗначениеЗаполнено(НакладнаяСсылка.ТипДоставки) тогда
			ТекТипДоставки=НакладнаяСсылка.ТипДоставки;
		иначе
			ТекТипДоставки=НакладнаяСсылка.ПунктДоставки.ТипДоставки;
		КонецЕсли;
	Исключение
		ТекТипДоставки=НакладнаяСсылка.ПунктДоставки.ТипДоставки;
	КонецПопытки;
	
	
	НакладнаяОбъект=ДокОбъект;
	// комплектующие заполним.
	
	//--------------------------------------------------------------------------------------
	//заполним комплектующие.
	
		
	КонтрольДублейСтрок(ДокОбъект) ;
	
	//Михайловский С. 20220214 -контроль 0 цен и преобразование +++
	Попытка
		КонтрольИМодифРНКЦен0(ДокОбъект,ТЗШК,ПРКомплектов);
		Если ДокОбъект.Товары.Количество() = 0 тогда
		//	СписокПолучателей=новый СписокЗначений;
		////	СписокПолучателей.Добавить("nechaeva@collant.ru");
		//	СписокПолучателей.Добавить("mikhailovskii@collant.ru");
		//	СписокПолучателей.Добавить("yamshikova@collant.ru");
		//	ТекстОповещения="Не осталось позиций к обработке ";
			ЗаписатьВЛог("ВБрз","Задача: Контроль нулевых цен первичный док-т ВБ.! Не осталось позиций к обработке ","Информация");
			//ЗаписатьВЛог("ВБрз","Окончание выполнения. Задача: Контроль нулевых цен первичный док-т! 2  ","Информация");
			//ОбменМаркетПлейс.ОтправитьПочтовоеСообщениеИзЕкода(СписокПолучателей,НСтр("ru='Контроль 0 цен Вбр '")+Формат(ТекущаяДатаСеанса(),"ДФ='dd.MM.yyyy чч:мм'"),ТекстОповещения);
			
			
			возврат;
		конецЕсли;
	Исключение
	КонецПопытки;
	
	//Михайловский С. 20220214 -контроль 0 цен и преобразование ---

	
	ЗаполнитьКомплектующие(ДокОбъект);
		
	//----------------------------------------------------------------------------------------
	//                     первичная запись документа!!!!!!!!
	//----------------------------------------------------------------------------------------
	Попытка
		ДокОбъект.Записать(режимЗаписиДокумента.Запись);
		//Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
		
	Исключение
		ЗаписатьВЛог("ОшибкиЕкод"," !ошибка первичной записи документа1 "+ ОписаниеОшибки(),"Информация"); 
		
		Инфо = ИнформацияОбОшибке();
		Если Найти(Инфо.Описание, "Не уникальный номер документа") > 0 Тогда
			ОбновитьНумерациюОбъектов();
			УстановитьНомерДокумента2(ЭтотОбъект);
			Попытка
				ДокОбъект.Записать(режимЗаписиДокумента.Запись);
				//Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
				//	СообщитьМенеджеру(ДокОбъект);  //+++
				
				
			Исключение
				ЗаписатьВЛог("ОшибкиЕкод"," !ошибка первичной записи документа2 "+ ОписаниеОшибки(),"Информация"); 
				КритическиеОшибкиОзон2.Добавить("Заказ "+ДокОбъект.Ссылка+"не записан первичный документ!"+ОписаниеОшибки());
				ПРоверкацен(ДокОбъект);

				СообщитьКритОшибки();
				КритическиеОшибкиОзон2.очистить();
				
				возврат;
				
			КонецПопытки;
		Иначе	
			ЗаписатьВЛог("ОшибкиЕкод"," !ошибка первичной записи документа3 "+ ОписаниеОшибки(),"Информация"); 
			//КритическиеОшибкиОзон2.Добавить("Заказ "+ДокОбъект.Ссылка+"не	записан первичный документ!"+ОписаниеОшибки());
			КритическиеОшибкиОзон2.Добавить("Заказ "+ДокОбъект.Ссылка.НомерЗаказа+"не записан первичный документ!"+ОписаниеОшибки());
			
			
			ПРоверкацен(ДокОбъект);
			
			СообщитьКритОшибки();
			
			КритическиеОшибкиОзон2.очистить();
			
			возврат;
			
		КонецЕсли;
		
		
	КонецПопытки;
	
	
	НовДок = документы.ЗаказКлиентаFBS.СоздатьДокумент();
	//нечаева 07,12,21+++
	НовДок.Контрагент = контрагент;
	//нечаева 07,12,21---
	НовДок.ДокОснование = ДокОбъект.Ссылка;
	Новдок.Дата = ТекущаяДата();
	
	
	Для каждого текстр из тзшк цикл
		
		Если ТекСтр.Комплект <> ПРКомплектов Тогда
			продолжить;
		КонецЕсли;	

		НовСтр =новдок.Товары.Добавить();
		попытка
			//ЗаписьВРег.НомерСтрокиРНК=текстр.Номстр;
			//	ЗаписьВРег.Период=ДокОбъект.Ссылка.Дата;
			НовСтр.ПрефиксЗаказа=текстр.ШК1;
			НовСтр.СуффиксЗаказа=текстр.ШК2;
			Новстр.ШтрихКод=текстр.ШК3;
			Новстр.Рид = текстр.рид;
			Новстр.номерЗаказа = текстр.номерЗаказа;
			//Новстр.Рид = текстр.номерзаказа;
			//Новстр.номерЗаказа = текстр.рид;
			
			Новстр.номенклатура = текстр.номенклатура;
			новстр.Количество = 1;
			новстр.отменен = ложь;
			
		исключение
			
			ШкЗаписаны=ложь;
		конецПопытки;
	конеццикла;
	Новдок.Записать();
	
	//нечаева 12,10,21++++
	// перепроверим этикетки
	//РезЭт=ЗапросПоСтикерам(НовДок);
	// нечаева 12,10,21---
	новдок.Записать(РежимЗаписиДокумента.Проведение);
	//*************************************************************************************************************************
	// сразу же будем переводить на сборку, как записали.
	//**************************************************************************************************************************
	СобратьЗаказы(НакладнаяОбъект,1);
	// перепроверим этикетки, до записи ШК не передаются со стороны ВБ, после смены статуса только
	РезЭт=ЗапросПоСтикерам(НовДок.Ссылка);
	// нечаева 12,10,21---

	//***************************************************************************************************************************	
	Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
	// запишем все ШК
	
	#если клиент тогда	
		сообщить(ДокОбъект.Номер);
	#конецЕсли	
	
		НакладнаяОбъект.дата=ТекущаяДата();
	
		
		
		
		
	попытка
		НакладнаяОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	исключение
		
		//пока не проверяем на проведение
		//КритическиеОшибкиОзон2.Добавить("Заказ "+ДокОбъект.НомерЗаказа+" не проведен и не сброшен на склад!");
		//КритическиеОшибкиОзон.Добавить("Заказ "+ДокОбъект.НомерЗаказа+" не проведен и не сброшен на склад!"+НакладнаяОбъект);
		//
		//КритическиеОшибкиОзон2.Добавить(""+ОписаниеОшибки());
		//
		//СообщитьКритОшибки();
		//КритическиеОшибкиОзон2.очистить();
		//ШкЗаписаны=ложь;
		//
		
		//СообщитьМенеджеру(ДокОбъект);  //+++
		//Если  КритическиеОшибкиОзон.количество()>0 Тогда
		//	СообщитьМенеджеруОзон(ДокОбъект);
		//	КритическиеОшибкиОзон.очистить();
		//КонецЕсли; 
		//Ошибки.Очистить();
		//
		//возврат;
		
	конецпопытки;
	//------------------------------------------------------------------------------------------------------------------
	
	// Кухарь А.Ю. 14.12.2021 начало
	// По просьбе Егоровой пишем дату и время доставки
	// Кухарь А.Ю. 27.12.2021 начало	
	//если ложь тогда ТЗШК=новый ТаблицаЗначений;КонецЕсли;
	//ТЗШК.Сортировать("ДатаВремяЗаказа");
	//
	//ТекДата=ТекущаяДата();
	//если ТЗШК.Количество()>0 тогда
	//	ТекДата=ТЗШК.Получить(0).ДатаВремяЗаказа;
	//КонецЕсли;
	
	
	//попытка 
	//	УстановитьДатуАвизацииДокумента(ДокОбъект.Ссылка,НачалоДня(ТекДата+2*86400),Истина);
	//исключение
	//	КритическиеОшибкиОзон.Добавить("РНК "+ДокОбъект.номер+" не установлена дата авизации. Чтобы накладная точно успела , установите её вручную.");		
	//КонецПопытки;
	// Кухарь А.Ю. 27.12.2021 конец
	
	
	// Кухарь А.Ю. 27.12.2021 начало
	//ЧасПриемки=Час(ТекДата)-1;
	//если ЧасПриемки<= 0 тогда
	//	ЧасПриемки=0;
	//КонецЕсли;	
	ЧасПриемки=Час(ДокОбъект.Дата);
	// Кухарь А.Ю. 27.12.2021 конец

	

	// Кухарь А.Ю. 04.02.2022 начало
	// Разбивка на 3 периода  Пока не стал включать    
	//если ЧасПриемки <= 13 тогда
	//	ТекВремяПриемки=Справочники.ВремяПриемки.НайтиПоКоду("000000401");
	//иначе
	//	ТекВремяПриемки=Справочники.ВремяПриемки.НайтиПоКоду("000000400");
	//КонецЕсли;

		если ЧасПриемки>=0 и ЧасПриемки<8 тогда	
			ТекВремяПриемки=Справочники.ВремяПриемки.НайтиПоКоду("000000135"); //21-21
		ИначеЕсли ЧасПриемки>=8 и ЧасПриемки<16 тогда	
			ТекВремяПриемки=Справочники.ВремяПриемки.НайтиПоКоду("000000082");//05-05
		иначе
			ТекВремяПриемки=Справочники.ВремяПриемки.НайтиПоКоду("000000060");//13-13
		КонецЕсли;
	// Кухарь А.Ю. 04.02.2022 конец

	если ложь тогда //Заглушка может потом вернём запрос
		// Кухарь А.Ю. 27.12.2021 конец
		
		
		ВремяПриемки=ПустаяДата()+ЧасПриемки*3600;
		запрос=новый запрос;
		запрос.Текст= "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВремяПриемки.Ссылка КАК Ссылка,
		|	ВремяПриемки.НачалоПериода1 КАК НачалоПериода1,
		|	ВремяПриемки.КонецПериода1 КАК КонецПериода1
		|ИЗ
		|	Справочник.ВремяПриемки КАК ВремяПриемки
		|ГДЕ
		|	ВремяПриемки.КонецПериода1 = &КонецПериода1
		|	И НЕ ВремяПриемки.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	НачалоПериода1";
		запрос.УстановитьПараметр("КонецПериода1",ВремяПриемки);
		ТекВремяПриемки=Неопределено;
		результат=запрос.Выполнить().Выбрать();
		пока результат.Следующий() цикл
			ТекВремяПриемки=результат.Ссылка;
		КонецЦикла;
		// Кухарь А.Ю. 27.12.2021 начало
		//
	КонецЕсли; 
	// Кухарь А.Ю. 27.12.2021 конец
	
	если ТекВремяПриемки=Неопределено тогда
		КритическиеОшибкиОзон.Добавить("РНК "+ДокОбъект.номер+" не найден элемент справочника время приемки.");
	иначе
		попытка
			ЗаписатьВремяПриемкиДляЗОГ(ДокОбъект.Ссылка,ТекВремяПриемки);
		Исключение
			КритическиеОшибкиОзон.Добавить("РНК "+ДокОбъект.номер+" не установлено время приемки. Чтобы накладная точно успела , установите его вручную.");	
		КонецПопытки;		
	КонецЕсли;
	// Кухарь А.Ю. 14.12.2021 конец
	

	
	СообщитьМенеджеру(ДокОбъект);  //+++
	Если  КритическиеОшибкиОзон.количество()>0 Тогда
		СообщитьМенеджеруОзон(ДокОбъект);
		КритическиеОшибкиОзон.очистить();
	КонецЕсли; 
	Ошибки.Очистить();
	Если ПрКомплектов Тогда
		Док1=ДокОбъект.Ссылка;
	Иначе
		Док2=ДокОбъект.Ссылка;
	КонецЕсли;	
	// перепроверим этикетки, до записи ШК не передаются со стороны ВБ, после смены статуса только
	// бывают не все передаются.
	РезЭт=ЗапросПоСтикерам(НовДок.ссылка);
	// нечаева 12,10,21---

	
КонецПРоцедуры	

//Михайловский С. 20220214 -контроль 0 цен и преобразование +++
Процедура КонтрольИМодифРНКЦен0(РНК,ТЗШ,Компл)
	Рез="";
	ТекстОповещения="";
	ЕстьЦены0=Ложь;
	МасНом=Новый Массив;
	н=РНК.Товары.Количество()-1;
	Пока н>=0 Цикл
		ТекСтр=РНК.Товары.Получить(н);
		Если НЕ ЗначениеЗаполнено(ТекСтр.Цена) Тогда
			ЕстьЦены0=Истина;
			Рез=Рез+СокрЛП(ТекСтр.Номенклатура)+" ";
			ТекстОповещения=ТекстОповещения+СокрЛП(ТекСтр.Номенклатура)+Символы.ПС;
			МасНом.Добавить(ТекСтр.Номенклатура);
			РНК.Товары.Удалить(н);
		КонецЕсли;	
		н=н-1;
	КонецЦикла;	
	к=ТЗШ.Количество()-1;
	Пока к>=0 Цикл
		ТекС=ТЗШ.Получить(к);
		Если ТекС.Комплект = Компл Тогда
			Если НЕ МасНом.Найти(ТекС.Номенклатура)=неопределено Тогда
				ТЗШ.Удалить(к);
			КонецЕсли;	
		КонецЕсли;
		к=к-1;
	КонецЦикла;	
	Если ЕстьЦены0 Тогда
		//СписокПолучателей.Добавить("mikhailovskii@collant.ru");
	//	СписокПолучателей=новый СписокЗначений;
	////	СписокПолучателей.Добавить("nechaeva@collant.ru");
	//	СписокПолучателей.Добавить("mikhailovskii@collant.ru");
	//	СписокПолучателей.Добавить("yamshikova@collant.ru");
		
		ЗаписатьВЛог("ВБрз","Задача: Контроль нулевых цен первичный док-т ВБ.! Обнаружены 0-цены позиции "+Рез,"Информация");
		//ЗаписатьВЛог("ВБрз","Окончание выполнения. Задача: Контроль нулевых цен первичный док-т! 2  ","Информация");
		//ОбменМаркетПлейс.ОтправитьПочтовоеСообщениеИзЕкода(СписокПолучателей,НСтр("ru='Контроль 0 цен Вбр '")+Формат(ТекущаяДатаСеанса(),"ДФ='dd.MM.yyyy чч:мм'"),ТекстОповещения);
	
	КонецЕсли;	
	//Возврат Рез;
КонецПроцедуры	
//Михайловский С. 20220214 -контроль 0 цен и преобразование ---

//Михайловский С. 20220201 -контроль остатков и преобразование +++

Процедура КонтрольИМодифМасРНК(СтруМас,Компл)
	ЗаписатьВЛог("ВБрз","Начало выполнения. Задача: Контроль остатка ВБ.!  ","Информация");
	ВбрМкПл=Справочники.ИнетМагазины.НайтиПоКоду("00001");
	Если ВбрМкПл.СохранятьДокументы Тогда
		//так отменяем контроль по ост. ничего не делаем
		ЗаписатьВЛог("ВБрз","Отмена выполнения. Задача: Контроль остатка ВБ.!  ","Информация");	
		Возврат;
	КонецЕсли;	
	МасЗак=СтруМас.МасЗак;
	МасРНК=СтруМас.МасРНК;
	
	Если НЕ МасРНК.Количество() Тогда
		//так отменяем контроль по ост. ничего не делаем
		ЗаписатьВЛог("ВБрз","Нет документов. Задача: Контроль остатка ВБ.!  ","Информация");	
		Возврат;
	КонецЕсли;
	
	//Рез.Вставить("МасЗак",МасЗак);
	//Рез.Вставить("МасРНК",МасРНК);
	//Возврат Рез;
	//СписокПолучателей=новый СписокЗначений;
	////	СписокПолучателей.Добавить("nechaeva@collant.ru");
	//СписокПолучателей.Добавить("yamshikova@collant.ru");
	маспоз=0;
	колдок=МасРНК.Количество();
	Пока маспоз<колдок Цикл
		РНКСсыл=МасРНК[маспоз];
		Попытка
			
			Если НЕ РНКСсыл.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе Тогда
				//ничего не делаем
				ЗаписатьВЛог("ВБрз","Отмена выполнения по состоянию документа. Задача: Контроль остатка ВБ.!   ","Информация");
				маспоз=маспоз+1;
				Продолжить;
			КонецЕсли;
		Исключение
			ЗаписатьВЛог("ВБрз","Отмена выполнения нет документа РНК. Задача: Контроль остатка ВБ.!   ","Информация");
			маспоз=маспоз+1;
			Продолжить;
		КонецПопытки;
		
		
		ЗаказКФ=МасЗак[маспоз];
		Если НЕ ЗначениеЗаполнено(ЗаказКФ) Тогда
			ЗаписатьВЛог("ВБрз","Отмена выполнения нет документа ЗаказКлиентаFBS. Задача: Контроль остатка ВБ.!   ","Информация");
			маспоз=маспоз+1;
			Продолжить;
		КонецЕсли;
		
		Если Компл Тогда
			ТЗНом=РНКСсыл.Комплектующие.Выгрузить();
		Иначе
			ТЗНом=РНКСсыл.Товары.Выгрузить();
			Для Каждого ТСтр Из ТЗНом Цикл
				ТСтр.Количество=ТСтр.Заявка;
			КонецЦикла;	
		КонецЕсли;	
		ТЗНом.Свернуть("Номенклатура","Количество");
		СпН = ТЗНом.ВыгрузитьКолонку("Номенклатура");
		Запрос=Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|ТЗНом.Номенклатура КАК Номенклатура,
		|ТЗНом.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_НомДок
		|ИЗ
		|	&ТЗНом КАК ТЗНом
		|;
		|ВЫБРАТЬ
		//|	СУММА(Остатки.СуммаОстаток) КАК СебестоимостьБух,
		|	СУММА(Остатки.КоличествоОстаток - ЕСТЬNULL(Резервы.КоличествоОстаток, 0)) КАК КолКонФакт,
		|	СУММА(ЕСТЬNULL(Резервы.КоличествоОстаток, 0)) КАК Резерв,
		|	Ложь КАК Комплект,
		|	Остатки.Номенклатура КАК Номенклатура
		|	ПОМЕСТИТЬ ВТ_ОстСкл
		|ИЗ
		|	РегистрНакопления.ОстаткиТМЦ.Остатки(
		|			,
		|			Склад В ИЕРАРХИИ (&Склады)
		|				И Номенклатура В ИЕРАРХИИ (&Ном)) КАК Остатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
		|				,
		|				Склад В ИЕРАРХИИ (&Склады)
		|					И Номенклатура В ИЕРАРХИИ (&Ном)) КАК Резервы
		|		ПО Остатки.Номенклатура = Резервы.Номенклатура
		|			И Остатки.Склад = Резервы.Склад
		|
		|СГРУППИРОВАТЬ ПО
		|	Остатки.Номенклатура
		|;
		|ВЫБРАТЬ 
		| НомДок.Номенклатура КАК Номенклатура,
		| isnull(КолКонФакт,0) КАК Доступно,
		| (НомДок.Количество-isnull(КолКонФакт,0)) КАК НеХват,
		| ВЫБОР КОГДА &Провод 
		| ТОГДА НомДок.Количество
		| ИНАЧЕ 0 КОНЕЦ КАК УжеРезерв
		| ИЗ ВТ_НомДок КАК НомДок
		| ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстСкл КАК ОстСкл
		| ПО НомДок.Номенклатура=ОстСкл.Номенклатура
		//возврат резерва
		| ГДЕ НомДок.Количество>(isnull(КолКонФакт,0)+ВЫБОР КОГДА &Провод 
		| ТОГДА НомДок.Количество
		| ИНАЧЕ 0 КОНЕЦ)
		|";
		
		Запрос.УстановитьПараметр("ном",СпН);
		Запрос.УстановитьПараметр("Склады",РНКСсыл.Склад);
		Запрос.УстановитьПараметр("Провод",РНКСсыл.Проведен);
		Запрос.УстановитьПараметр("ТЗНом",ТЗНом);
		ТЗКорр=Запрос.Выполнить().Выгрузить();
		Если НЕ ТЗКорр.Количество() Тогда
			ДокРНК1=РНКСсыл.ПолучитьОбъект();
			Если ДокРНК1.Товары.Количество() Тогда
				ДокРНК1.СостояниеНакладной=Перечисления.СостоянияНакладной.КОтправкеНаСклад;
			КонецЕсли;	
			ДокРНК1.Записать(РежимЗаписиДокумента.Проведение);
			ЗаписатьВЛог("ВБрз","Окончание выполнения. Задача: Контроль остатка ВБ Переведено в состояние КОтправкеНаСклад! 2  ","Информация");
			маспоз=маспоз+1;
			Продолжить;
		КонецЕсли;
		
		МасНСЗак=Новый Массив;
		МасНСРНК=Новый Массив;
		//для начала дропим строки с проблемными товарами
		ТЗЗак=ЗаказКФ.Товары.Выгрузить();
		Если Компл Тогда
			ТЗПрод=РНКСсыл.Товары.Выгрузить();
			ТЗКомпл=РНКСсыл.Комплектующие.Выгрузить();
			МПрод=Новый Массив;
			Для Каждого ТекСтр Из ТЗКорр Цикл
				Ном=ТекСтр.Номенклатура;
				Найды=ТЗКомпл.НайтиСтроки(Новый Структура("Номенклатура",Ном));
				Для Каждого Найд Из Найды Цикл
					Если МПрод.Найти(Найд.Продукция)=неопределено Тогда
						МПрод.Добавить(Найд.Продукция);
					КонецЕсли;	
				КонецЦикла;	 
			КонецЦикла;	
			Для Каждого Прод Из МПрод Цикл
				Найды1=ТЗПрод.НайтиСтроки(Новый Структура("Номенклатура",Прод));
				Для Каждого Найд1 Из Найды1 Цикл
					МасНСРНК.Добавить(Найд1.НомерСтроки);
					
				КонецЦикла;
				
				Найды2=ТЗЗак.НайтиСтроки(Новый Структура("Номенклатура",Прод));
				Для Каждого Найд2 Из Найды2 Цикл
					МасНСЗак.Добавить(Найд2.НомерСтроки);
					
				КонецЦикла;
				
			КонецЦикла;	
		Иначе
			ТЗТов=РНКСсыл.Товары.Выгрузить();
			
			Для Каждого ТекСтр Из ТЗКорр Цикл
				Ном=ТекСтр.Номенклатура;
				Найды1=ТЗТов.НайтиСтроки(Новый Структура("Номенклатура",Ном));
				Для Каждого Найд1 Из Найды1 Цикл
					МасНСРНК.Добавить(Найд1.НомерСтроки);
					
				КонецЦикла;
				
				Найды2=ТЗЗак.НайтиСтроки(Новый Структура("Номенклатура",Ном));
				Для Каждого Найд2 Из Найды2 Цикл
					МасНСЗак.Добавить(Найд2.НомерСтроки);
					
				КонецЦикла;	 
			КонецЦикла;	
			
		КонецЕсли;	
		
		НачатьТранзакцию();
		Попытка
			ДокРНК2=Документы.РасходнаяНакладная.СоздатьДокумент();
			ЗаполнитьЗначенияСвойств(ДокРНК2,РНКСсыл);
			
			
			л=РНКСсыл.Товары.Количество()-1;
			н=0;
			Пока н<л Цикл
				ТекСтр=РНКСсыл.Товары.Получить(н);
				ТекНС=ТекСтр.НомерСтроки;
				Если НЕ МасНСРНК.Найти(ТекНС)=неопределено Тогда
					НовСтр=ДокРНК2.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр,ТекСтр);
				КонецЕсли;
				
				н=н+1;
			КонецЦикла;
			Если Компл Тогда
				ЗаполнитьКомплектующие(ДокРНК2);
			КонецЕсли;
			ПунктДоставки_ПриИзменении(ДокРНК2.ПунктДоставки,ДокРНК2);
			ДокРНК2.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
			ДокРНК2.Проведен=Ложь;
			ДокРНК2.Дата=ТекущаяДатаСеанса();
			//ДокРНК2.УстановитьНовыйНомер();
			УстановитьНомерДокументаКлиентСервер(ДокРНК2);
			ДокРНК2.Записать(РежимЗаписиДокумента.Запись);
			
			
			// Кухарь А.Ю. 04.02.2022 начало
			//Потом переделаю на ТЧ справочника инет магазины
			ЧасПриемки=Час(ДокРНК2.Дата);
			если ЧасПриемки>=0 и ЧасПриемки<8 тогда	
				ТекВремяПриемки=Справочники.ВремяПриемки.НайтиПоКоду("000000135"); //21-21
			ИначеЕсли ЧасПриемки>=8 и ЧасПриемки<16 тогда	
				ТекВремяПриемки=Справочники.ВремяПриемки.НайтиПоКоду("000000082");//05-05
			иначе
				ТекВремяПриемки=Справочники.ВремяПриемки.НайтиПоКоду("000000060");//13-13
			КонецЕсли;
			
			попытка
				ЗаписатьВремяПриемкиДляЗОГ(ДокРНК2.Ссылка,ТекВремяПриемки);
			Исключение
			КонецПопытки;	
			
			// Кухарь А.Ю. 04.02.2022 конец
			
			ДокЗ2=Документы.ЗаказКлиентаFBS.СоздатьДокумент();
			ЗаполнитьЗначенияСвойств(ДокЗ2,ЗаказКФ);
			л=ЗаказКФ.Товары.Количество()-1;
			н=0;
			Пока н<л Цикл
				ТекСтр=ЗаказКФ.Товары.Получить(н);
				ТекНС=ТекСтр.НомерСтроки;
				Если НЕ МасНСЗак.Найти(ТекНС)=неопределено Тогда
					НовСтр=ДокЗ2.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр,ТекСтр);
				КонецЕсли;
				
				н=н+1;
			КонецЦикла;
			ДокЗ2.ДокОснование=ДокРНК2.Ссылка;
			ДокЗ2.Дата=ТекущаяДатаСеанса();
			
			
			
			ДокЗ2.УстановитьНовыйНомер();
			ДокЗ2.Записать(РежимЗаписиДокумента.Проведение);
			
			ДокРНК1=РНКСсыл.ПолучитьОбъект();
			ДокРНК1.Комплектующие.Очистить();
			н=ДокРНК1.Товары.Количество()-1;
			Пока н>=0 Цикл
				ТекСтр=ДокРНК1.Товары.Получить(н);
				ТекНС=ТекСтр.НомерСтроки;
				Если НЕ МасНСРНК.Найти(ТекНС)=неопределено Тогда
					ДокРНК1.Товары.Удалить(н);
				КонецЕсли;
				
				н=н-1;
			КонецЦикла;	
			
			Если Компл Тогда
				ЗаполнитьКомплектующие(ДокРНК1);
			КонецЕсли;	
			Если ДокРНК1.Товары.Количество() Тогда
				ДокРНК1.СостояниеНакладной=Перечисления.СостоянияНакладной.КОтправкеНаСклад;
				ДокРНК1.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			
			ДокЗ1=ЗаказКФ.ПолучитьОбъект();
			н=ДокЗ1.Товары.Количество()-1;
			Пока н>=0 Цикл
				ТекСтр=ДокЗ1.Товары.Получить(н);
				ТекНС=ТекСтр.НомерСтроки;
				Если НЕ МасНСЗак.Найти(ТекНС)=неопределено Тогда
					ДокЗ1.Товары.Удалить(н);
				КонецЕсли;
				
				н=н-1;
			КонецЦикла;	
			ДокЗ1.Записать(РежимЗаписиДокумента.Проведение);
			ЗафиксироватьТранзакцию();
			ТекстОповещения="Разделена по причине нехватки товаров РНК "+Строка(РНКСсыл)+" добавлена РНК "+Строка(ДокРНК2.Ссылка);
			
		Исключение
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли;
			ТекстОповещения=" !ошибка при формировании документов в ходе контроля остатков "+ ОписаниеОшибки();
			ЗаписатьВЛог("ВБрз"," !ошибка при формировании документов в ходе контроля остатков "+ ОписаниеОшибки(),"Информация");
		КонецПопытки;
		
		маспоз=маспоз+1;
	КонецЦикла;
	//Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	////Сообщение.Получатели.Добавить("egorova@collant.ru");
	//Сообщение.Получатели.Добавить("yamshikova@collant.ru");
	//ОбменМаркетПлейс.ОтправитьПочтовоеСообщениеИзЕкода(СписокПолучателей,НСтр("ru='Контроль загрузка заказов Вбр '")+Формат(ТекущаяДатаСеанса(),"ДФ='dd.MM.yyyy чч:мм'"),ТекстОповещения);
	ЗаписатьВЛог("ВБрз","Окончание выполнения. Задача: Контроль остатка ВБ.! 2  ","Информация");
КонецПроцедуры	

Функция КонтрольПоКолвоРНК(РНКСсыл,Компл)
	Рез=Новый Структура;
	МасЗак=Новый Массив;
	МасРНК=Новый Массив;
	ЗаписатьВЛог("ВБрз","Начало выполнения. Задача: Контроль колво ВБ.!  ","Информация");
	СостНакл=РНКСсыл.СостояниеНакладной;
	РЗ=РежимЗаписиДокумента.Запись;
	Если РНКСсыл.Проведен Тогда
		РЗ=РежимЗаписиДокумента.Проведение;
	КонецЕсли;	
	ВбрМкПл=Справочники.ИнетМагазины.НайтиПоКоду("00001");
	ЕстьДопСкл=ВбрМкПл.Склады.Количество();
		
	Если ЕстьДопСкл Тогда
		Если Компл Тогда
			ТЗНом=РНКСсыл.Комплектующие.Выгрузить();
		Иначе
			ТЗНом=РНКСсыл.Товары.Выгрузить();
			Для Каждого ТСтр Из ТЗНом Цикл
				ТСтр.Количество=ТСтр.Заявка;
			КонецЦикла;	
		КонецЕсли;	
		ТЗНом.Свернуть("Номенклатура","Количество");
		СпН = ТЗНом.ВыгрузитьКолонку("Номенклатура");
		
		Запрос=Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|ТЗНом.Номенклатура КАК Номенклатура,
		|ТЗНом.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_НомДок
		|ИЗ
		|	&ТЗНом КАК ТЗНом
		|;
		|ВЫБРАТЬ
		//|	СУММА(Остатки.СуммаОстаток) КАК СебестоимостьБух,
		|	СУММА(Остатки.КоличествоОстаток - ЕСТЬNULL(Резервы.КоличествоОстаток, 0)) КАК КолКонФакт,
		|	СУММА(ЕСТЬNULL(Резервы.КоличествоОстаток, 0)) КАК Резерв,
		|	Ложь КАК Комплект,
		|	Остатки.Номенклатура КАК Номенклатура
		|	ПОМЕСТИТЬ ВТ_ОстСкл
		|ИЗ
		|	РегистрНакопления.ОстаткиТМЦ.Остатки(
		|			,
		|			Склад В ИЕРАРХИИ (&Склады)
		|				И Номенклатура В ИЕРАРХИИ (&Ном)) КАК Остатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
		|				,
		|				Склад В ИЕРАРХИИ (&Склады)
		|					И Номенклатура В ИЕРАРХИИ (&Ном)) КАК Резервы
		|		ПО Остатки.Номенклатура = Резервы.Номенклатура
		|			И Остатки.Склад = Резервы.Склад
		|
		|СГРУППИРОВАТЬ ПО
		|	Остатки.Номенклатура
		|;
		|ВЫБРАТЬ 
		| НомДок.Номенклатура КАК Номенклатура,
		| isnull(КолКонФакт,0) КАК Доступно,
		| (НомДок.Количество-isnull(КолКонФакт,0)) КАК НеХват,
		| 0 КАК Добавка,
		| 0 КАК Добавка1,
		| ВЫБОР КОГДА &Провод 
		| ТОГДА НомДок.Количество
		| ИНАЧЕ 0 КОНЕЦ КАК УжеРезерв
		| ИЗ ВТ_НомДок КАК НомДок
		| ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстСкл КАК ОстСкл
		| ПО НомДок.Номенклатура=ОстСкл.Номенклатура
		//возврат резерва
		| ГДЕ НомДок.Количество>(isnull(КолКонФакт,0)+ВЫБОР КОГДА &Провод 
		| ТОГДА НомДок.Количество
		| ИНАЧЕ 0 КОНЕЦ)
		|";
		
		Запрос.УстановитьПараметр("ном",СпН);
		Запрос.УстановитьПараметр("Склады",РНКСсыл.Склад);
		Запрос.УстановитьПараметр("Провод",РНКСсыл.Проведен);
		Запрос.УстановитьПараметр("ТЗНом",ТЗНом);
		ТЗКорр=Запрос.Выполнить().Выгрузить();
		Если ТЗКорр.Количество() Тогда
			
			
			Запрос1=Новый Запрос;
			Запрос1.Текст =
			"ВЫБРАТЬ
			//|	СУММА(Остатки.СуммаОстаток) КАК СебестоимостьБух,
			|	СУММА(Остатки.КоличествоОстаток - ЕСТЬNULL(Резервы.КоличествоОстаток, 0)) КАК КолКонФакт,
			|	СУММА(ЕСТЬNULL(Резервы.КоличествоОстаток, 0)) КАК Резерв,
			|	Остатки.Склад КАК Склад,
			|	Остатки.Номенклатура КАК Номенклатура
			//|	ПОМЕСТИТЬ ВТ_ОстСкл
			|ИЗ
			|	РегистрНакопления.ОстаткиТМЦ.Остатки(
			|			,
			|			Склад В (&Склады)
			|				И Номенклатура В ИЕРАРХИИ (&Ном)) КАК Остатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
			|				,
			|				Склад В (&Склады)
			|					И Номенклатура В ИЕРАРХИИ (&Ном)) КАК Резервы
			|		ПО Остатки.Номенклатура = Резервы.Номенклатура
			|			И Остатки.Склад = Резервы.Склад
			|
			|СГРУППИРОВАТЬ ПО
			|	Остатки.Номенклатура,
			|	Остатки.Склад
			
			|";
			
			Запрос1.УстановитьПараметр("ном",СпН);
			Запрос1.УстановитьПараметр("Склады",ВбрМкПл.Склады.ВыгрузитьКолонку("Склад"));
			ТЗОстДоп=Запрос1.Выполнить().Выгрузить();
			СоздПРМ=Ложь;
			ТЗОстДоп1=ТЗОстДоп.Скопировать();
			ТЗОстДоп1.Свернуть("Номенклатура","КолКонФакт");
			Для Каждого ТекСтр Из ТЗКорр Цикл
				Найды=ТЗОстДоп1.НайтиСтроки(Новый Структура("Номенклатура",ТекСтр.Номенклатура));
				Если Найды.Количество() Тогда
					
					Если ТекСтр.НеХват>Найды[0].КолКонФакт Тогда
						ТекСтр.Добавка=Найды[0].КолКонФакт;
					Иначе
						ТекСтр.Добавка=ТекСтр.НеХват;
					КонецЕсли;	
					Если НЕ ТекСтр.Добавка=0 Тогда
						СоздПРМ=Истина;
					КонецЕсли;	
				КонецЕсли;	
			КонецЦикла;	
			Если СоздПРМ Тогда
				МасСклПост=Новый Массив;
				
				Для Каждого ТекСтр Из ТЗКорр Цикл
					Если ТекСтр.Добавка>0 Тогда
						Найды=ТЗОстДоп.НайтиСтроки(Новый Структура("Номенклатура",ТекСтр.Номенклатура));
						Для Каждого Найд Из Найды Цикл
							Если МасСклПост.Найти(Найд.Склад)=неопределено Тогда
								МасСклПост.Добавить(Найд.Склад);	
								
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
				Для Каждого Скл Из МасСклПост Цикл
					
					Подсортировка=документы.Перемещение.СоздатьДокумент();
					Подсортировка.СкладПолучатель=РНКСсыл.Склад;
					Подсортировка.Склад=Скл;
					Подсортировка.ИБ=РНКСсыл.иб;
					Подсортировка.Менеджер=ПараметрыСеанса.Пользователь.ФизЛицо;
					Подсортировка.Автор=ПараметрыСеанса.Пользователь;
					Подсортировка.Организация=РНКСсыл.организация;
					Подсортировка.ПунктДоставки=РНКСсыл.ПунктДоставки;
					Подсортировка.Комментарий="Создано обработкой при разбивке док-тов";
					Подсортировка.СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена;
					Подсортировка.СостояниеНакладнойУПолучателя=Перечисления.СостоянияНакладной.Принята;
					Подсортировка.Отгружен=Перечисления.Отгружен.Отгружен;
					Подсортировка.ДокОснование=РНКСсыл;
					Подсортировка.Дата=ТекущаяДата();
					Подсортировка.Валюта=Справочники.Валюты.НайтиПоКоду("810");
					Подсортировка.Курс=1;
					
					УстановитьНомерДокумента2(Подсортировка);
					
					Для Каждого ТекСтр Из ТЗКорр Цикл
						Если ТекСтр.Добавка>0 Тогда
							Найды=ТЗОстДоп.НайтиСтроки(Новый Структура("Номенклатура, Склад",ТекСтр.Номенклатура, Скл));
							Если Найды.Количество() Тогда
								СтрокаТЗДляПРМ=Найды[0];
								Ост1=ТекСтр.Добавка-ТекСтр.Добавка1;
								Если (Ост1)>0 Тогда
									Ост2=СтрокаТЗДляПРМ.КолКонФакт;
									Если Ост1>Ост2 Тогда
										ТКоличество=Ост2;
									Иначе
										ТКоличество=Ост1;
									КонецЕсли;	
									//Для Каждого СтрокаТЗДляПРМ Из Найды Цикл
									СтрТЧ=Подсортировка.Товары.Добавить();
									СтрТЧ.Номенклатура=СтрокаТЗДляПРМ.номенклатура;
									СтрТЧ.Заявка=ТКоличество;
									стртч.ПодтвержденнаяЗаявка=ТКоличество;			
									стртч.ПодтвержденнаяЗаявкаПеремещения=ТКоличество;
									СтрТЧ.Количество=ТКоличество;				
									ПриИзмененииНоменклатурыТабЧасти(СтрТЧ, Подсортировка);
									РассчитатьСуммуТабЧасти(СтрТЧ, Подсортировка);
									//КонецЦикла;
									ТекСтр.Добавка1=ТекСтр.Добавка1+ТКоличество;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					Если Подсортировка.Товары.Количество() Тогда
						Подсортировка.Записать(РежимЗаписиДокумента.Проведение);
					КонецЕсли;	
				КонецЦикла;
				
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	
	//Если ВбрМкПл.Тест Тогда
	//	//так отменяем контроль по ост. ничего не делаем
	//	ЗаписатьВЛог("ВБрз","Отмена выполнения. Задача: Контроль остатка ВБ.!  ","Информация");	
	//	Возврат;
	//КонецЕсли;	
	//Попытка
	//	Если НЕ РНКСсыл.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе Тогда
	//		//ничего не делаем
	//		ЗаписатьВЛог("ВБрз","Отмена выполнения по состоянию документа. Задача: Контроль остатка ВБ.!   ","Информация");
	//		Возврат;
	//	КонецЕсли;
	//Исключение
	//	ЗаписатьВЛог("ВБрз","Отмена выполнения нет документа РНК. Задача: Контроль остатка ВБ.!   ","Информация");
	//	Возврат;
	//КонецПопытки;
	ЗаказКФ=неопределено;
	Запрос1=Новый Запрос;
	Запрос1.Текст=
	"ВЫБРАТЬ
	|	ЗаказКлиентаFBS.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказКлиентаFBS КАК ЗаказКлиентаFBS
	|ГДЕ
	|	ЗаказКлиентаFBS.ДокОснование = &РНКСсыл";
	Запрос1.УстановитьПараметр("РНКСсыл",РНКСсыл);
	Выб=Запрос1.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
		ЗаказКФ=Выб.Ссылка;
	КонецЕсли;
	//Если НЕ ЗначениеЗаполнено(ЗаказКФ) Тогда
	//	ЗаписатьВЛог("ВБрз","Отмена выполнения нет документа ЗаказКлиентаFBS. Задача: Контроль колва ВБ.!   ","Информация");
	//	Возврат;
	//КонецЕсли;
	ЕстьРаздел=Ложь;
	ЛимПоз=0;
	Попытка
		ЕстьРаздел=ВбрМкПл.РазбиватьПоЛимитуКоличество;
		Если ЕстьРаздел Тогда
			ЛимПоз=ВбрМкПл.ЛимитПоКоличеству;
		КонецЕсли;	
	Исключение
	КонецПопытки;
	ДокРНК=РНКСсыл.ПолучитьОбъект();
	
	ЧасПриемки=Час(РНКСсыл.Дата);
	если ЧасПриемки>=0 и ЧасПриемки<8 тогда	
		ТекВремяПриемки=Справочники.ВремяПриемки.НайтиПоКоду("000000135"); //21-21
	ИначеЕсли ЧасПриемки>=8 и ЧасПриемки<16 тогда	
		ТекВремяПриемки=Справочники.ВремяПриемки.НайтиПоКоду("000000082");//05-05
	иначе
		ТекВремяПриемки=Справочники.ВремяПриемки.НайтиПоКоду("000000060");//13-13
	КонецЕсли;
	
	попытка
		ЗаписатьВремяПриемкиДляЗОГ(РНКСсыл,ТекВремяПриемки);
	Исключение
	КонецПопытки;

	
	ДокЗак=ЗаказКФ.ПолучитьОбъект();
	МасЗак.Добавить(ЗаказКФ);
	МасРНК.Добавить(РНКСсыл);
	
	Рез.Вставить("МасЗак",МасЗак);
	Рез.Вставить("МасРНК",МасРНК);
	
	Если ЕстьРаздел И ЗначениеЗаполнено(ЛимПоз) Тогда
		Если Компл Тогда
			ТЗНом1=РНКСсыл.Комплектующие.Выгрузить();
		Иначе
			ТЗНом1=РНКСсыл.Товары.Выгрузить();
		КонецЕсли;
		ТотКол=ТЗНом1.Итог("Количество");
		к=ТЗНом1.Количество()-1;
		Если ТотКол<=ЛимПоз Тогда
			
			//ДокРНК.СостояниеНакладной=СостНакл;
			//ДокРНК.Записать(РЗ);
			//ЗаписатьВЛог("ВБрз","Окончание выполнения. Задача: Контроль остатка ВБ Переведено в состояние КОтправкеНаСклад! 3 позиций менее предельного  ","Информация");
			Возврат Рез;
		КонецЕсли;	
		МасНом=Новый Массив;
		НачатьТранзакцию();
		Попытка
			//чтоб не цеплять остатки на др. доки
			ДокРНК.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КолИтер=Цел(ТотКол/ЛимПоз)+1;
			//ДокРНК=РНКСсыл.ПолучитьОбъект();
			н=КолИтер-1;
			ТекКол=ТотКол;
			ЛокКол=0;
			Пока н>0 Цикл
				ДокРНК21=Документы.РасходнаяНакладная.СоздатьДокумент();
				ЗаполнитьЗначенияСвойств(ДокРНК21,ДокРНК);
				ДокЗак2=Документы.ЗаказКлиентаFBS.СоздатьДокумент();
				ЗаполнитьЗначенияСвойств(ДокЗак2,ЗаказКФ);
				МасНом.Очистить();
				Пока Истина Цикл
					
					ТекСтр=ТЗНом1.Получить(к);
					ЛокКол=ЛокКол+ТекСтр.Количество;
					Если Компл Тогда
						Если МасНом.Найти(ТекСтр.Продукция)=неопределено Тогда
							МасНом.Добавить(ТекСтр.Продукция);
						КонецЕсли;
					Иначе	
						Если МасНом.Найти(ТекСтр.Номенклатура)=неопределено Тогда
							МасНом.Добавить(ТекСтр.Номенклатура);
						КонецЕсли;	
					КонецЕсли;	
					Если ((ТотКол-ЛокКол)<(ЛимПоз*н)) ИЛИ (к<=0) Тогда
						Прервать;
					КонецЕсли;
					к=к-1;
				КонецЦикла;
				ДокРНК21.Товары.Очистить();
				т=ДокРНК.Товары.Количество()-1;
				Пока т>=0 Цикл
					ТекСтр=ДокРНК.Товары.Получить(т);
					Ном=ТекСтр.Номенклатура;
					Если НЕ МасНом.Найти(Ном)=неопределено Тогда
						НовСтр=ДокРНК21.Товары.Добавить();
						ЗаполнитьЗначенияСвойств(НовСтр,ТекСтр);
						ДокРНК.Товары.Удалить(т);
					КонецЕсли;
					т=т-1;
				КонецЦикла;	
				
				ДокЗак2.Товары.Очистить();
				л=ДокЗак.Товары.Количество()-1;
				Пока л>=0 Цикл
					ТекСтр=ДокЗак.Товары.Получить(л);
					Ном=ТекСтр.Номенклатура;
					Если НЕ МасНом.Найти(Ном)=неопределено Тогда
						НовСтр=ДокЗак2.Товары.Добавить();
						ЗаполнитьЗначенияСвойств(НовСтр,ТекСтр);
						ДокЗак.Товары.Удалить(л);
					КонецЕсли;
					л=л-1;
				КонецЦикла;
				
				
				Если Компл Тогда
					ЗаполнитьКомплектующие(ДокРНК21);
				КонецЕсли;
				ДокРНК21.СостояниеНакладной=СостНакл;
				ДокРНК21.Дата=ТекущаяДатаСеанса();
				УстановитьНомерДокументаКлиентСервер(ДокРНК21);
				
				Попытка
					ПунктДоставки_ПриИзменении(ДокРНК21.ПунктДоставки,ДокРНК21);
					ДокРНК21.Комментарий=ДокРНК21.Комментарий+" исх. док-т "+Строка(РНКСсыл);
					ДокРНК21.Записать(РЗ);
				Исключение
					ДокРНК21.Проведен=Ложь;
					ДокРНК21.Записать(РежимЗаписиДокумента.Запись);
				КонецПопытки;
				
				ЧасПриемки=Час(ДокРНК21.Дата);
				если ЧасПриемки>=0 и ЧасПриемки<8 тогда	
					ТекВремяПриемки=Справочники.ВремяПриемки.НайтиПоКоду("000000135"); //21-21
				ИначеЕсли ЧасПриемки>=8 и ЧасПриемки<16 тогда	
					ТекВремяПриемки=Справочники.ВремяПриемки.НайтиПоКоду("000000082");//05-05
				иначе
					ТекВремяПриемки=Справочники.ВремяПриемки.НайтиПоКоду("000000060");//13-13
				КонецЕсли;
				
				попытка
					ЗаписатьВремяПриемкиДляЗОГ(ДокРНК21.Ссылка,ТекВремяПриемки);
				Исключение
				КонецПопытки;

				
				ДокЗак2.ДокОснование=ДокРНК21.Ссылка;
				ДокЗак2.УстановитьНовыйНомер();
				ДокЗак2.Записать(РежимЗаписиДокумента.Проведение);
				МасЗак.Добавить(ДокЗак2.Ссылка);
				МасРНК.Добавить(ДокРНК21.Ссылка);
				н=н-1;
			КонецЦикла;	
			
			Если Компл Тогда
				ЗаполнитьКомплектующие(ДокРНК);
			КонецЕсли;
			
			ДокЗак.Записать(РежимЗаписиДокумента.Проведение);
			
			ДокРНК.Дата=ТекущаяДата()+10;
			ДокРНК.СостояниеНакладной=СостНакл;
			//ДокРНК.Записать(РЗ);
			Попытка
				ПунктДоставки_ПриИзменении(ДокРНК.ПунктДоставки,ДокРНК);
				ДокРНК.Записать(РЗ);
			Исключение
				ДокРНК.Проведен=Ложь;
				ДокРНК.Записать(РежимЗаписиДокумента.Запись);
			КонецПопытки;
			ЧасПриемки=Час(ДокРНК21.Дата);
			если ЧасПриемки>=0 и ЧасПриемки<8 тогда	
				ТекВремяПриемки=Справочники.ВремяПриемки.НайтиПоКоду("000000135"); //21-21
			ИначеЕсли ЧасПриемки>=8 и ЧасПриемки<16 тогда	
				ТекВремяПриемки=Справочники.ВремяПриемки.НайтиПоКоду("000000082");//05-05
			иначе
				ТекВремяПриемки=Справочники.ВремяПриемки.НайтиПоКоду("000000060");//13-13
			КонецЕсли;
			
			попытка
				ЗаписатьВремяПриемкиДляЗОГ(ДокРНК.Ссылка,ТекВремяПриемки);
			Исключение
			КонецПопытки;
			ЗаписатьВЛог("ВБрз","Окончание выполнения. Задача: Контроль остатка ВБ Переведено в состояние КОтправкеНаСклад! 3 с коррекцией кол-ва  ","Информация");
			ЗафиксироватьТранзакцию();
		Исключение
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли;
			ЗаписатьВЛог("ВБрз"," !ошибка при формировании документов в ходе контроля кол-ва "+ ОписаниеОшибки(),"Информация");
		КонецПопытки;
		
	КонецЕсли;
	Рез.Вставить("МасЗак",МасЗак);
	Рез.Вставить("МасРНК",МасРНК);
	Возврат Рез;
КонецФункции	

//Михайловский С. 20220201 -контроль остатков и преобразование  ---

процедура проверкацен (Док)
	
	Для каждого ТекСтрока из Док.товары цикл
		
		
		Если ТекСТрока.цена = 0 тогда
			
			КритическиеОшибкиОзон2.Добавить("товар "+ТекСтрока.номенклатура+"нулевая цена!");
			Сообщить("товар "+ТекСтрока.номенклатура+"нулевая цена!");
			
		КонецЕсли;	
		
		
	конецЦикла;	
	
	
КонецПРоцедуры	

Процедура ЗаполнитьКомплектующие(РНК)
	
	РНК.Комплектующие.Очистить();
	
	Для Каждого СтрокаТоваров Из РНК.Товары Цикл	
		
		Если СтрокаТоваров.Количество = 0 Тогда 
			Продолжить 
		КонецЕсли; 
		
		Номенклатура = СтрокаТоваров.Номенклатура;
		
		Если Номенклатура.Коплектующие.Количество() > 0 Тогда
			// комплект
			Для Каждого СтрокаКомплекта Из Номенклатура.Коплектующие Цикл
				Если СтрокаКомплекта.Количество = 0 Тогда 
					Продолжить 
				КонецЕсли; 
				
				СтрокаТЧ = РНК.Комплектующие.Добавить();	
				
				СтрокаТЧ.Продукция		= Номенклатура;
				СтрокаТЧ.Номенклатура	= СтрокаКомплекта.Номенклатура;
				
				ПриИзмененииНоменклатурыТабЧасти(СтрокаТЧ, РНК);
				
				СтрокаТЧ.Единица		= СтрокаКомплекта.Единица;
				СтрокаТЧ.Коэффициент	= СтрокаКомплекта.Коэффициент;
				СтрокаТЧ.Количество		= СтрокаКомплекта.Количество * СтрокаТоваров.Количество * СтрокаТоваров.Коэффициент; // и разделить на СтрокаКомплекта.Коэффициент?
				//нечаева 06,03,18+++
				РассчитатьСуммуТабЧасти(СтрокаТЧ, РНК);
				//нечаева 06,03,18---
				
				ДокОбъект.ОтгрузкаКомплектов =истина;

			КонецЦикла; 
		Иначе			
			// обычный товар
			СтрокаТЧ = РНК.Комплектующие.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаТоваров);
			СтрокаТЧ.Продукция = Номенклатура;
		КонецЕсли;
		
	КонецЦикла;	
	
	//нечаева 02,02,21
	Если НЕ ДокОбъект.ОтгрузкаКомплектов =истина Тогда
		ДокОбъект.Комплектующие.Очистить();
	КонецЕсли;	
	// нечаева 02,02,21 ---

	

	
	
	
КонецПроцедуры


// НайтиТОварПоматрице
//
Функция НайтиПОШКМатрица(ШК)Экспорт
	
	
	контрагент = МПКонтрагент;
	
	НайденнаяНоменклатура=Справочники.Номенклатура.ПустаяСсылка();
	
	// ищем по ШК
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	МатрицаТовары.Номенклатура КАК Номенклатура,
	|	МатрицаТовары.ШККонтрагента КАК ШККонтрагента,
	|	МатрицаТовары.ШККонтрагентаДополнительный КАК ШККонтрагентаДополнительный,
	|	МатрицаТовары.АртикулКонтрагента КАК АртикулКонтрагента,
	|	МатрицаТовары.Цена КАК Цена
	|ИЗ
	|	Документ.Матрица.Товары КАК МатрицаТовары
	|ГДЕ
	|	(МатрицаТовары.ШККонтрагента = &ТекШК
	|			ИЛИ МатрицаТовары.ШККонтрагентаДополнительный = &ТекШК)
	|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
	|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
	|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("ТекШк",ШК);
	Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
	
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Рез.Номенклатура;
	КонецЕсли;
	
	
	
	возврат НайденнаяНоменклатура;
	//----------------------------------------------------------------------------
КонецФункции // НайтиПОШК()



Процедура ПроверкаАутотенфикацииНажатие(Элемент)
	
	//вариант пост запроса
	
	//HTTPСоединение = Новый HTTPСоединение("localhost",,"НовиковАВ","123123");
	////создаем запрос данных методом POST
	//запросPOST = Новый HTTPЗапрос("/jsonapi/node/article"); 
	//запросPOST.Заголовки.Вставить("Accept","application/vnd.api+json");
	//запросPOST.Заголовки.Вставить("Content-type","application/vnd.api+json");
	//запросPOST.Заголовки.Вставить("X-CSRF-Token","Hwz_Hvp4gg2xn9tqo5KVdjOfNPYJFrdZokHe0grop5Q");
	//СтрокаJS =     
	//"{
	//|  ""data"": {
	//|    ""type"": ""node--article"",
	//|    ""attributes"": {
	//|      ""title"": ""My custom title"",
	//|      ""body"": {
	//|        ""value"": ""Custom value"",
	//|        ""format"": ""plain_text""
	//|      }
	//|    }
	//|  }
	//|}";
	//Сообщить(СтрокаJS);
	//запросPOST.УстановитьТелоИзСтроки(СтрокаJS,"windows-1251",ИспользованиеByteOrderMark.НеИспользовать);
	//Попытка
	//    HTTPСоединение.ОтправитьДляОбработки(запросPOST, ФайлОтвета);
	//Исключение
	//    #Если клиент Тогда
	//       Сообщить(ОписаниеОшибки());
	//    #КонецЕсли   
	//КонецПопытки;
	//
	//
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
КонецПроцедуры


Функция ПолучитьЗапросGet2(АдресЗапроса)
	возврат "";
	
	// это продуктив пароли
	
	//НашКлючАдмин = "*#*#*#";
	//КлиентИД = 44219;
	
	// тестовые пароли
	КлиентИД = 836;
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//НашКлючАдмин ="0296d4f2-70a1-4c09-b507-904fd05567b9";
	НашКлючАдмин = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКHTTPОбмену).Токен;
	// Ихсанов Д. А. Конец  14.10.2025
	
	
	Лимит = 10;
	
	ИмяВыходногоФайла = ПолучитьИмяВременногоФайла(".txt");
	
	//ДатаНачала =Формат(НачалоДня(Дата1),"ДФ=""гггг-ММ-дд""");
	//ДатаКонца = Формат(КонецДня(Дата2),"ДФ=""гггг-ММ-дд""");
	//
	АдресТ = "cb-api.ozonru.me"	; // тестовый сервер
	//АдресТ = "api-seller.ozon.ru"	; // продуктив
	попытка                          
		Соединение = Новый HTTPСоединение(АдресТ,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);  
	исключение
		//Сообщить(ОписаниеОшибки());
	конецПопытки;
	
	HTTP_запрос = новый HTTPзапрос();
	HTTP_запрос.АдресРесурса=АдресЗапроса;
	
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json");
	ЗаголовокHTTP.Вставить("Accept", "text/xml");
	ЗаголовокHTTP.Вставить("Accept-Language", "ru");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("Content-Language", "ru");
	ЗаголовокHTTP.Вставить("Content-Charset", "utf-8");
	// потмо изменить
	ЗаголовокHTTP.Вставить("Host", АдресТ); //"https://seller-api.sc.prod.s.o3.ru/v1/categories/tree?language=DEFAULT");
	ЗаголовокHTTP.Вставить("Client-Id", КлиентИД);
	ЗаголовокHTTP.Вставить("Api-Key", НашКлючАдмин );	
	//Host: api-seller.ozon.ru
	
	
	HTTP_запрос.Заголовки = ЗаголовокHTTP;
	
	Ответ=Соединение.Получить(HTTP_запрос);
	Возврат Ответ;
	
	//ТТТ=Ответ.ПолучитьТелоКакСтроку(); //КодировкаТекста.UTF8);
	
	
	
КонецФункции


Функция ТабЗначВМассив(ТаблицаЗначений) Экспорт
	НашМассив = Новый Массив;
	Для Каждого СтрокаТаблицы из ТаблицаЗначений Цикл
		НашаСтруктура = Новый Структура;
		Счетчик = 0;
		Для Каждого СтрокаСтруктуры из СтрокаТаблицы Цикл
			Если НЕ ТипЗнч(СтрокаСтруктуры) = Тип(ТаблицаЗначений) тогда
				НашаСтруктура.Вставить(ТаблицаЗначений.Колонки[Счетчик].Имя,СтрокаТаблицы[Счетчик]);
			Иначе
				НашаСтруктура.Вставить(ТаблицаЗначений.Колонки[Счетчик].Имя,ТабЗначВМассив(СтрокаСтруктуры));
			КонецЕсли;
			Счетчик = Счетчик + 1;
		КонецЦикла;
		НашМассив.Добавить(НашаСтруктура);
	КонецЦикла;
	Возврат(НашМассив);
КонецФункции

//10,09,21+++
//юзер статус 1 - Отмена клиента 2 - Доставлен 3 - Возврат 4 - Ожидает 5 - Брак

//статус просто 
// 0 - Новый заказ 1 - Принял заказ 2 - Сборочное задание завершено 3 - Сборочное задание отклонено 5 - На доставке курьером 6 - Курьер довез и клиент принял товар 7 - Клиент не принял товар




Функция ЗапросПоЗаказам(ДатаЗаказаНачалоСтрокой,ДатаЗаказаКонецСтрокой,ВсегоЗаказов=1000,ПропуститьЗаказов=0)

	//новые статусы
	
	//	0 - Новый заказ 1 - Принял заказ 2 - Сборочное задание завершено 
	//	3 - Сборочное задание отклонено 5 - На доставке курьером 6 - Курьер довез и клиент принял товар 7 - Клиент не принял товар
	//	
	//	
	//  /api/v2/orders?date_start=2021-09-10T00%3A00%3A00%2B02%3A00&status=1&take=10&skip=0
	
	Результат = неопределено;
	
	// 10,09,21  +++ нечаева
	Команда =  "/api/v2/orders?date_start="+ДатаЗаказаНачалоСтрокой+"&date_end="+ДатаЗаказаКонецСтрокой+"&status=0&take="+ВСегоЗаказов+"&skip="+ПРопуститьЗаказов;
	//"/api/v1/orders?date_start=2020-03-23T14:58:33.102-08:00";  // считывает заказы с сайта   /api/v1/orders?date_start=2020-09-14T00:00:00+03:00
	ТелоДЖ = "";
	// 10,09,21  --- нечаева
	
	
	ИмяВыходногоФайлаДЖ = ПолучитьИмяВременногоФайла(".JSON");
	#если клиент тогда
		сообщить(ИмяВыходногоФайлаДж);
	# конецесли
	
	//
	Запись = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( ,Символы.Таб);
	Запись.ОткрытьФайл(ИмяВыходногоФайлаДЖ,,,ПараметрыЗаписиJSON);
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением; //ЛокальнаяДата;      "2020-10-31T21:00:00Z",
	
	                                                   
	Данные = Новый Структура;
	
	Попытка
		ЗаписатьJSON(Запись, Данные, НастройкиСериализации);
		Запись.Закрыть();
		// Возврат Истина;
	Исключение
		//сообщить(ОписаниеОшибки());
		// ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Ошибка,,,"Прайс не сформирован, произошла ошибка " + ОписаниеОшибки());
		//  Возврат Ложь;
	КонецПопытки;;  
	
	
	// выполнение пост запроса.
	//-------------------------------
	
	Результат = GET_ЗапросЗаказы(Команда,ИмяВыходногоФайлаДЖ) ;    // ИмяВыходногоФайла?
	// total - дает всего заказов эа период времени.
	
	
	Если Результат.кодсостояния = 204 или Результат.кодсостояния = 401  тогда
		#если клиент тогда
			сообщить("Нет заказов");
			
			р2=Результат.ПолучитьТелоКакСтроку();
			ИмяВыхОтвет=результат.ПолучитьИмяФайлаТела();
			Сообщить(" - "+ИмяВыхОтвет);
			
		# конецесли
		возврат Неопределено;
	иначе
				
	КонецЕсли;
	
	
	#если клиент тогда
		сообщить(Результат.кодсостояния);

	# конецесли

	
	возврат Результат;

конецФункции


// получение заказов
Процедура ПроверкаЗаказов()
	
	
	//новый токен 02,06,21
	// НашКлючАдмин Кулагина = "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJhY2Nlc3NJRCI6IjAwMmRiM2RiLWQ5ZjQtNDg3MS1iNmZiLTg4NDNiNWRjMDYxOSJ9.VZkFemOFmBKpu1jV69GRMtCXjGftP-hruVLvNd1AZyY";
    //Токен Егорова = "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJhY2Nlc3NJRCI6Ijc2ODU0OGMyLTUyNTQtNDU3OC04YTMwLTRjZThlYTViOWM2YiJ9.my1etcdHKjFzr0ppJOfLY3kLvkMZCcOlRSppguS3HXk"
	//ТокенОстатки Нечаева = "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJhY2Nlc3NJRCI6ImEyNWQwZGFmLWFlMDMtNGM3Yy04ODdjLWJmZTJhZDA5ODI3ZSJ9.carhxbpgtNWpHevwuLMkvGQO1xZogNfJwJrYKKFp0HE";
	
	// получение списка заказов
	команда = 1;
	
	//дата1 = Дата(2021,04,18);
	Дата2 = Дата(2021,04,11);
	
	Дата1 = НачалоДня(ТекущаяДата()-24*60*60*3); // 8 часов назад от текущей ? не сработало утром, пусть сутки назад
	ДатаЗаказаНачалоСтрокой = Формат(Дата1, "ДФ=yyyy-MM-ddT00:00:01.102-00:00"); // 08-00 было
	ДатаЗаказаКонецСтрокой = Формат(ТекущаяДата(), "ДФ=yyyy-MM-ddT23:59:59.000-00:00");
	
	
	Результат=ЗапросПоЗаказам(ДатаЗаказаНачалоСтрокой,ДатаЗаказаКонецСтрокой,1000,0);

	Если Результат = неопределено тогда
		возврат;
	КонецЕсли;	
	
	//// 2 вариант для обработки, так проще.
	р2=Результат.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(р2);
	
	Данные = ПрочитатьJSON(ЧтениеJSON, Ложь); // тут в структуру все выгружено
	
	ЗагрузитьвРНК(данные);  // это первую тысячу загружаем

	
	ОбщееКолЗаказов=0;
	СчОЗаказов = 0;

	
	ПроверкаКоличестваЗаказов(данные);
	
	
	Если ОбщееКолЗаказов >1000 тогда
		# если клиент тогда
		сообщить(ОБщееКолЗаказов);
		# конецесли
		СчОЗаказов=СчОЗаказов+1000;
		ОБщееКолЗаказов=ОБщееКолЗаказов-1000;

		Пока ОбщееколЗаказов>0 цикл
			
						
			Результат=ЗапросПоЗаказам(ДатаЗаказаНачалоСтрокой,ДатаЗаказаКонецСтрокой,1000,СчОЗаказов);
			
			Если Результат = неопределено тогда
				возврат;
			КонецЕсли;	
			
			//// 2 вариант для обработки, так проще.
			р2=Результат.ПолучитьТелоКакСтроку();
			
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(р2);
			
			Данные = ПрочитатьJSON(ЧтениеJSON, Ложь); // тут в структуру все выгружено
			ЗагрузитьвРНК(данные);
			
			# если клиент тогда
				сообщить(" - "+СчОЗаказов);
			# конецесли		
			
			СчОЗаказов=СчОЗаказов+1000;
			ОБщееКолЗаказов=ОБщееКолЗаказов-1000;

		
						
		КонецЦикла;
		
		
	
	КонецЕсли;
	
	
		
	
КонецПроцедуры

//нечаева 21,12,20---
//******************************************************************************

//нечаева 06,12+++++
// Для всех заказов без ШК еще раз будем делать проверку на сборку.


//нечаева 06,12 ----

Процедура ОтправитьСтатусыРНКНаОтгрузку()
	
	ДатаОтгрузки = Началодня(ТекущаяДата());
	
	ДеньВСекундах=24*60*60;
		
	запрос = новый Запрос;
	запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗаказКлиентаFBS.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЗаказКлиентаFBS.Товары КАК ЗаказКлиентаFBS
	               |ГДЕ
	               |	ЗаказКлиентаFBS.Ссылка.Проведен = ИСТИНА
	               |	И ЗаказКлиентаFBS.Ссылка.Контрагент = &Вайлдб
	               |	И ЗаказКлиентаFBS.Ссылка.ДокОснование.ДатаОтгрузки >= &датаотгрузки
	               |	И ЗаказКлиентаFBS.Ссылка.Дата >= &ДатаДок
	               |	И ЗаказКлиентаFBS.СостояниеУКлиента <> &Статус";
	запрос.УстановитьПараметр("Датадок",ТекущаяДата() - 7*ДеньВСекундах);
	запрос.УстановитьПараметр("Вайлдб", МПКонтрагент);
	запрос.УстановитьПараметр("датаотгрузки",НачалоДня(ТекущаяДата()));
	запрос.УстановитьПараметр("Статус",справочники.СостояниеНакладнойУКлиента.НайтиПоНаименованию("2"));
		
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока рез.Следующий() цикл
	
		РНК = Рез.ссылка.ДокОснование;
		СостояниеНакладной = РНК.состояниеНакладной;
		# если клиент тогда
		    сообщить(рез.ссылка);
		# конецЕсли
		
		Если (СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена  или СостояниеНакладной = Перечисления.СостоянияНакладной.ГотоваКОтгрузке или СостояниеНакладной = Перечисления.СостоянияНакладной.Паллетирование или СостояниеНакладной = Перечисления.СостоянияНакладной.ОжиданиеПаллетирования)
			//и НЕ РНК.ПереданПокупателюВЭлВиде         //    тогда
		тогда	
			
			СобратьЗаказы(РНК,2);
						
			//ПереданПокупателюВЭлВиде = Истина;
			// если все = 2, тогда ставим статус ПереданПокупателювЭлВиде
			
		конецЕсли;
	
			
	КонецЦикла;
	

		
	
КонецПроцедуры	


//нечаева 12,10,21----

//------------------------------------------------------------------
//нечаева 16,12,21+++
Функция ОтправитьСтрокуЗаказа(Данные)
	
	Стат=Ложь;
	ИмяВыходногоФайлаДЖ = ПолучитьИмяВременногоФайла(".JSON");
	
	команда=""; 	
	//
	Запись = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( ,Символы.Таб);
	Запись.ОткрытьФайл(ИмяВыходногоФайлаДЖ,,,ПараметрыЗаписиJSON);
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением; //ЛокальнаяДата;      "2020-10-31T21:00:00Z",
	
	
	Попытка
		ЗаписатьJSON(Запись, Данные, НастройкиСериализации);
		Запись.Закрыть();
	Исключение
		//сообщить(ОписаниеОшибки());
		
	КонецПопытки;;  
		
	
	// выполнение пост запроса.
	//-------------------------------
	
	//Михайловский часто возникают ошибки
	цнт=0;
	
	Пока Истина Цикл
		Результат = PUT_Запрос(Команда,ИмяВыходногоФайлаДЖ) ;    // ИмяВыходногоФайла?
		Если НЕ Результат=неопределено Тогда
			Если Результат.КодСостояния = 200 тогда
			
				Стат=Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;	
		Если цнт>10 Тогда
			Если НЕ Результат=неопределено Тогда
				Если Результат.КодСостояния = 200 тогда
					
					Стат=Истина;
				КонецЕсли;
				
			КонецЕсли;
			Прервать;	
		КонецЕсли;
		цнт=цнт+1;
	КонецЦикла;
	Возврат Стат;
	//Попытка
	//	Если Результат.КодСостояния = 200 тогда
	//		
	//		возврат истина;
	//	КонецЕсли;	
	//Исключение
	//	Результат = PUT_Запрос(Команда,ИмяВыходногоФайлаДЖ) ;
	//КонецПопытки;
	//
	//Если Результат.КодСостояния = 500 тогда
	//	
	//	Результат = PUT_Запрос(Команда,ИмяВыходногоФайлаДЖ) ; 
	//	
	//КонецЕсли;
	//
	/////--------------------------------------
	//Если Результат.КодСостояния = 500 тогда
	//	
	//	Результат = PUT_Запрос(Команда,ИмяВыходногоФайлаДЖ) ; 
	//	
	//КонецЕсли;
	//
	/////--------------------------------------
	//Если Результат.КодСостояния = 500 тогда
	//	
	//	Результат = PUT_Запрос(Команда,ИмяВыходногоФайлаДЖ) ; 
	//	
	//КонецЕсли;
	//
	//
	/////--------------------------------------
	//Если Результат.КодСостояния = 500 тогда
	//	
	//	Результат = PUT_Запрос(Команда,ИмяВыходногоФайлаДЖ) ; 
	//	
	//КонецЕсли;
	//
	/////--------------------------------------
	//Если Результат.КодСостояния = 500 тогда
	//	
	//	Результат = PUT_Запрос(Команда,ИмяВыходногоФайлаДЖ) ; 
	//	
	//КонецЕсли;
	//
	//
	/////--------------------------------------
	//Если Результат.КодСостояния = 500 тогда
	//	
	//	Результат = PUT_Запрос(Команда,ИмяВыходногоФайлаДЖ) ; 
	//	
	//КонецЕсли;

	//Если Результат.КодСостояния = 200 тогда
	//	
	//	возврат истина;
	//иначе
	//	возврат  ложь;
	//КонецЕсли;	
	

	//
	////-------------------------------
	//р2=Результат.ПолучитьТелоКакСтроку();
	//ИмяВыхОтвет=результат.ПолучитьИмяФайлаТела();
	////Сообщить(ИмяВыхОтвет);
	//
	//// можно отсюда обрабатывать
	//Текст = Новый ТекстовыйДокумент;
	//Текст.УстановитьТекст(Результат.ПолучитьТелоКакСтроку());
	//#если клиент тогда
	//	
	//	//сообщить(р2);
	//#конецЕсли
	
КонецФункции	

// переводим на сборку заказы
Процедура СобратьЗаказы(Накладная,Статус)
	
	//	возврат;

	// приняли заказ
	// смена статуса заказа  тут на 1 , на 2 при смене на рГ статуса заказа.
	// данные по товарам, пока временно 2 вида товаров только добавила для тестов
	
	ЕстьИзменения=ложь;
	
	ТЗ1 = Новый ТаблицаЗначений;
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказКлиентаFBSТовары.РИД КАК РИД,
	               |	ЗаказКлиентаFBSТовары.ШтрихКод КАК ШтрихКод,
	               |	ЗаказКлиентаFBSТовары.НомерЗаказа КАК НомерЗаказа,
	               |	ЗаказКлиентаFBSТовары.Количество КАК Количество,
	               |	ЗаказКлиентаFBSТовары.Номенклатура КАК Номенклатура,
	               |	ЗаказКлиентаFBSТовары.Ссылка КАК Ссылка,
	               |	ВЫБОР
	               |		КОГДА ЗаказКлиентаFBSТовары.СостояниеУКлиента.Наименование = ""1""
	               |			ТОГДА ""1""
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ЗаказКлиентаFBSТовары.СостояниеУКлиента.Наименование = ""2""
	               |					ТОГДА ""2""
	               |				ИНАЧЕ ""0""
	               |			КОНЕЦ
	               |	КОНЕЦ КАК СостояниеУКлиента,
	               |	ЗаказКлиентаFBSТовары.НомерСтроки КАК НомерСтроки
	               |ИЗ
	               |	Документ.ЗаказКлиентаFBS.Товары КАК ЗаказКлиентаFBSТовары
	               |ГДЕ
	               |	ЗаказКлиентаFBSТовары.Ссылка.ДокОснование = &текдок
	               |	И ЗаказКлиентаFBSТовары.СостояниеУКлиента <> &Статус
	               |	И ВЫБОР
	               |			КОГДА ЗаказКлиентаFBSТовары.СостояниеУКлиента.Наименование = ""1""
	               |				ТОГДА ""1""
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ЗаказКлиентаFBSТовары.СостояниеУКлиента.Наименование = ""2""
	               |						ТОГДА ""2""
	               |					ИНАЧЕ ""0""
	               |				КОНЕЦ
	               |		КОНЕЦ <= &Ст2";

	ЗначениеСтатуса =справочники.СостояниеНакладнойУКлиента.НайтиПоНаименованию(Строка(Статус));
	запрос.УстановитьПараметр("ТекДок",Накладная.ссылка);
	запрос.УстановитьПараметр("Статус",ЗначениеСтатуса);
	запрос.УстановитьПараметр("Ст2",Строка(Статус));

	тз1 =Запрос.Выполнить().Выгрузить();
	НачатьТранзакцию();
	ДокФБС= тз1[0].ссылка.получитьОбъект();
	
	текстр=1;
	Для каждого Текстрока из  тз1 цикл
		// нельзя отправить на отправку, если не переведен на сборку !
		// если уже на сборке -  на отправку 
		Если Число (Текстрока.СостояниеУКлиента) >= Статус Тогда
			продолжить;
		КонецЕсли;
		
		РИд = Текстрока.РИд;
		Ордер = Текстрока.НомерЗаказа;
		
		СтрПРо= Новый ТаблицаЗначений;
		СтрПРо.Колонки.Добавить("orderId");
		СтрПРо.Колонки.Добавить("status");
		
		НовСт = стрпро.Добавить();
		НовСт.orderId= ордер;            //  артикул вайлдберриз   код производителя у нас
		НовСт.status= Статус;          // массив с размерами цветами	   // 2 - в состоянии рг отправляем
		
			
		ОтправленоБезОшибок = ОтправитьСтрокуЗаказа(ТабЗначВМассив(СтрПро));
		
		Если ОтправленоБезОшибок Тогда
			// запишем в документ
			ДокФБС.товары[ТексТрока.НомерСтроки-1].СостояниеУКлиента = ЗначениеСтатуса;
			ЕстьИзменения = истина;
		КонецЕсли;	
				
		текстр=текстр+1;
	конецЦикла;
	
	Если ЕстьИзменения Тогда
		
		Попытка
			ДокФБС.записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			# если клиент тогда
				сообщить(ОписаниеОшибки());
			# конецЕсли
		КонецПопытки;
		
	КонецЕсли;	
		
	// Кухарь А.Ю. 10.02.2022 начало
	// Если ЕстьИзменения = ложь, то все следующие процедуры ничего в базу не напишут, потому что транзакция не завершится
	если ТранзакцияАктивна() тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	// Кухарь А.Ю. 10.02.2022 конец
	
	
	возврат;
	
	
КонецПроцедуры
//Нечаева 15,02,20 ---


// переводим на сборку заказы
Процедура Собрать(РНК) экспорт 
	
	//возврат;                                    
	Если РНК.пустая() ТОгда
		возврат;
	иначе
		накладная =   РНК;
	КонецЕсли;	
	
	// приняли заказ
	// смена статуса заказа  тут на 1 , на 2 при смене на рГ статуса заказа.
	// данные по товарам, пока временно 2 вида товаров только добавила для тестов
	
	ТЗ1 = Новый ТаблицаЗначений;
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказКлиентаFBSТовары.РИД КАК РИД,
	|	ЗаказКлиентаFBSТовары.ШтрихКод КАК ШтрихКод,
	|	ЗаказКлиентаFBSТовары.НомерЗаказа КАК НомерЗаказа,
	|	ЗаказКлиентаFBSТовары.Количество КАК Количество,
	|	ЗаказКлиентаFBSТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаFBSТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказКлиентаFBS.Товары КАК ЗаказКлиентаFBSТовары
	|ГДЕ
	|	ЗаказКлиентаFBSТовары.Ссылка.ДокОснование = &текдок";
	
	
	запрос.УстановитьПараметр("ТекДок",Накладная.ссылка);
	тз1 =Запрос.Выполнить().Выгрузить();
	
	
	
	Текстр=1;
	Для каждого Текстрока из  тз1 цикл
		// получим данные из регистра;
		
		РИд = Текстрока.РИд;
		Ордер = Текстрока.НомерЗаказа;
		
		СтрПРо= Новый ТаблицаЗначений;
		СтрПРо.Колонки.Добавить("orderId");
		СтрПРо.Колонки.Добавить("status");
		
		НовСт = стрпро.Добавить();
		НовСт.orderId= ордер;            //  артикул вайлдберриз   код производителя у нас
		НовСт.status= 1;          // массив с размерами цветами	   // 2 - в состоянии рг отправляем
		
		//
		//Данные1 = новый массив;
		//данные1.Добавить(СтрПРо);
		
		ОтправитьСтрокуЗаказа(ТабЗначВМассив(СтрПро));
		
		//данные.Очистить();
		текстр=текстр+1;
	конецЦикла;
	
	
	
	
//	новые
//	[
//  {
//    "orderId": "string",
//    "status": 2
//  }
//]
//	
//	

	
	
	
	возврат;
	
	
КонецПроцедуры
//Нечаева 161221 --

 //---------------------------------------------------




// нечаева 04,06,21+++ новый АПИ!!!!!
Процедура Сформировать(ТаблицаПараметров=НЕОПРЕДЕЛЕНО) Экспорт
	
	////+++
	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Кухарь А.Ю. 31.03.2026 начало
	// Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом тогда
	Если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() тогда
		//Кухарь А.Ю. 31.03.2026 конец       
		ЗаписатьВЛог("Регламент","Отмена выполнения. Задача: Загрузка заказов ВБ. Автообмен разрешен для базы: """+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
		Возврат;
	КонецЕсли;
	////
	
	Док1=неопределено;
	Док2=неопределено;
	ЗаписатьВЛог("Екод","Начало выполнения. Задача: Загрузка заказов с сайта ВБ!","Информация");                     
	
		
	ОбщееКолЗаказов=0;
	
	Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
		// получаем заказы за текущий день, минус день назад, на всякий случай.
		//временно
		ПроверкаЗаказов();
		//нечаева 07,12,21+++
		ДозагрузитьЗагрузитьШК ();
		//нечаева 07,12,21+--
		// нечаева 161221 +++ переводим на отгрузку сразу.
		ОтправитьСтатусыРНКНаОтгрузку();
		
		//КонтрольИМодифРНК(Док1,1);
		//КонтрольИМодифРНК(Док2,0);
		//
		//КонтрольКолвоРНК(Док1,1);
		//КонтрольКолвоРНК(Док2,0);
		Если ЗначениеЗаполнено(Док1) Тогда
			ВСтру1=КонтрольПоКолвоРНК(Док1,1);
		    КонтрольИМодифМасРНК(ВСтру1,1);
		КонецЕсли;	
		Если ЗначениеЗаполнено(Док2) Тогда
			ВСтру2=КонтрольПоКолвоРНК(Док2,0);
		    КонтрольИМодифМасРНК(ВСтру2,0);
		КонецЕсли;	
		
	КонецЕсли;
	
		
	// теперь пропишем у уже загруженных заказов кода
	ЗаписатьВЛог("Екод","Конец выполнения. Задача: Загрузка заказов из ВБ !","Информация");                     
	
	 	
КонецПроцедуры	

МкПл=Справочники.ИнетМагазины.НайтиПоКоду("00001");
МПКонтрагент=МкПл.Контрагент;
МПСклад =МкПл.Склад; 
МПДоговор=МкПл.Договор;
МППунктДоставки = МкПл.ПунктДоставки;




// Катаев- 21/03/13
//--------------------------
КодМетро	="SSP-8643";
КритичОшибки= Новый массив;

//нечаева 11,04,17+++
КритичОшибкиЛента = Новый массив; // для отправки многопаллетных документов
//нечаева 11,04,17---


Ошибки=Новый Массив;
ОшибкиН=Новый Массив;
Файлы=Новый Массив;

ПризнакЗаписиДокумента=Истина;


КритическиеОшибкиОзон=Новый Массив;
КритическиеОшибкиОзон2=Новый Массив;

//нечаева 19,03,15+++
ОшибкиАртикул=Новый Массив;
//нечаева 19,03,15---

ОбщееКолЗаказов=0;
СчОЗаказов = 0;

//Михайловский пока сюда снесу
//Процедура КонтрольКолвоРНК(РНКСсыл,Компл)
//	ЗаписатьВЛог("ВБрз","Начало выполнения. Задача: Контроль колво ВБ.!  ","Информация");
//	СостНакл=РНКСсыл.СостояниеНакладной;
//	РЗ=РежимЗаписиДокумента.Запись;
//	Если РНКСсыл.Проведен Тогда
//		РЗ=РежимЗаписиДокумента.Проведение;
//	КонецЕсли;	
//	ВбрМкПл=Справочники.ИнетМагазины.НайтиПоКоду("00001");
//	//Если ВбрМкПл.Тест Тогда
//	//	//так отменяем контроль по ост. ничего не делаем
//	//	ЗаписатьВЛог("ВБрз","Отмена выполнения. Задача: Контроль остатка ВБ.!  ","Информация");	
//	//	Возврат;
//	//КонецЕсли;	
//	//Попытка
//	//	Если НЕ РНКСсыл.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе Тогда
//	//		//ничего не делаем
//	//		ЗаписатьВЛог("ВБрз","Отмена выполнения по состоянию документа. Задача: Контроль остатка ВБ.!   ","Информация");
//	//		Возврат;
//	//	КонецЕсли;
//	//Исключение
//	//	ЗаписатьВЛог("ВБрз","Отмена выполнения нет документа РНК. Задача: Контроль остатка ВБ.!   ","Информация");
//	//	Возврат;
//	//КонецПопытки;
//	ЗаказКФ=неопределено;
//	Запрос1=Новый Запрос;
//	Запрос1.Текст=
//	"ВЫБРАТЬ
//	|	ЗаказКлиентаFBS.Ссылка КАК Ссылка
//	|ИЗ
//	|	Документ.ЗаказКлиентаFBS КАК ЗаказКлиентаFBS
//	|ГДЕ
//	|	ЗаказКлиентаFBS.ДокОснование = &РНКСсыл";
//	Запрос1.УстановитьПараметр("РНКСсыл",РНКСсыл);
//	Выб=Запрос1.Выполнить().Выбрать();
//	Если Выб.Следующий() Тогда
//		ЗаказКФ=Выб.Ссылка;
//	КонецЕсли;
//	Если НЕ ЗначениеЗаполнено(ЗаказКФ) Тогда
//		ЗаписатьВЛог("ВБрз","Отмена выполнения нет документа ЗаказКлиентаFBS. Задача: Контроль колва ВБ.!   ","Информация");
//		Возврат;
//	КонецЕсли;
//	ЕстьРаздел=Ложь;
//	ЛимПоз=0;
//	Попытка
//		ЕстьРаздел=ВбрМкПл.РазбиватьПоЛимитуКоличество;
//		Если ЕстьРаздел Тогда
//			ЛимПоз=ВбрМкПл.ЛимитПоКоличеству;
//		КонецЕсли;	
//	Исключение
//	КонецПопытки;
//	ДокРНК=РНКСсыл.ПолучитьОбъект();
//	ДокЗак=ЗаказКФ.ПолучитьОбъект();
//	Если ЕстьРаздел И ЗначениеЗаполнено(ЛимПоз) Тогда
//		Если Компл Тогда
//			ТЗНом1=РНКСсыл.Комплектующие.Выгрузить();
//		Иначе
//			ТЗНом1=РНКСсыл.Товары.Выгрузить();
//		КонецЕсли;
//		ТотКол=ТЗНом1.Итог("Количество");
//		к=ТЗНом1.Количество()-1;
//		Если ТотКол<=ЛимПоз Тогда
//			
//			//ДокРНК.СостояниеНакладной=СостНакл;
//			//ДокРНК.Записать(РЗ);
//			//ЗаписатьВЛог("ВБрз","Окончание выполнения. Задача: Контроль остатка ВБ Переведено в состояние КОтправкеНаСклад! 3 позиций менее предельного  ","Информация");
//			Возврат;
//		КонецЕсли;	
//		МасНом=Новый Массив;
//		НачатьТранзакцию();
//		Попытка
//			КолИтер=Цел(ТотКол/ЛимПоз)+1;
//			//ДокРНК=РНКСсыл.ПолучитьОбъект();
//			н=КолИтер-1;
//			ТекКол=ТотКол;
//			ЛокКол=0;
//			Пока н>0 Цикл
//				ДокРНК21=Документы.РасходнаяНакладная.СоздатьДокумент();
//				ЗаполнитьЗначенияСвойств(ДокРНК21,ДокРНК);
//				ДокЗак2=Документы.ЗаказКлиентаFBS.СоздатьДокумент();
//				ЗаполнитьЗначенияСвойств(ДокЗак2,ЗаказКФ);
//				МасНом.Очистить();
//				Пока Истина Цикл
//					
//					ТекСтр=ТЗНом1.Получить(к);
//					ЛокКол=ЛокКол+ТекСтр.Количество;
//					Если Компл Тогда
//						Если МасНом.Найти(ТекСтр.Продукция)=неопределено Тогда
//							МасНом.Добавить(ТекСтр.Продукция);
//						КонецЕсли;
//					Иначе	
//						Если МасНом.Найти(ТекСтр.Номенклатура)=неопределено Тогда
//							МасНом.Добавить(ТекСтр.Номенклатура);
//						КонецЕсли;	
//					КонецЕсли;	
//					Если ((ТотКол-ЛокКол)<(ЛимПоз*н)) ИЛИ (к<=0) Тогда
//						Прервать;
//					КонецЕсли;
//					к=к-1;
//				КонецЦикла;
//				ДокРНК21.Товары.Очистить();
//				т=ДокРНК.Товары.Количество()-1;
//				Пока т>=0 Цикл
//					ТекСтр=ДокРНК.Товары.Получить(т);
//					Ном=ТекСтр.Номенклатура;
//					Если НЕ МасНом.Найти(Ном)=неопределено Тогда
//						НовСтр=ДокРНК21.Товары.Добавить();
//						ЗаполнитьЗначенияСвойств(НовСтр,ТекСтр);
//						ДокРНК.Товары.Удалить(т);
//					КонецЕсли;
//					т=т-1;
//				КонецЦикла;	
//				
//				ДокЗак2.Товары.Очистить();
//				л=ДокЗак.Товары.Количество()-1;
//				Пока л>=0 Цикл
//					ТекСтр=ДокЗак.Товары.Получить(л);
//					Ном=ТекСтр.Номенклатура;
//					Если НЕ МасНом.Найти(Ном)=неопределено Тогда
//						НовСтр=ДокЗак2.Товары.Добавить();
//						ЗаполнитьЗначенияСвойств(НовСтр,ТекСтр);
//						ДокЗак.Товары.Удалить(л);
//					КонецЕсли;
//					л=л-1;
//				КонецЦикла;
//				
//				
//				Если Компл Тогда
//					ЗаполнитьКомплектующие(ДокРНК21);
//				КонецЕсли;
//				ДокРНК21.СостояниеНакладной=СостНакл;
//				ДокРНК21.Дата=ТекущаяДатаСеанса();
//				УстановитьНомерДокументаКлиентСервер(ДокРНК21);
//				ДокРНК21.Записать(РЗ);
//				//ДокРНК2.Проведен=Ложь;
//				
//				ДокЗак2.ДокОснование=ДокРНК21.Ссылка;
//				ДокЗак2.УстановитьНовыйНомер();
//				ДокЗак2.Записать(РежимЗаписиДокумента.Проведение);
//				н=н-1;
//			КонецЦикла;	
//			
//			Если Компл Тогда
//				ЗаполнитьКомплектующие(ДокРНК);
//			КонецЕсли;
//			ДокЗак.Записать(РежимЗаписиДокумента.Проведение);
//			ДокРНК.СостояниеНакладной=СостНакл;
//			ДокРНК.Записать(РЗ);
//			ЗаписатьВЛог("ВБрз","Окончание выполнения. Задача: Контроль остатка ВБ Переведено в состояние КОтправкеНаСклад! 3 с коррекцией кол-ва  ","Информация");
//			ЗафиксироватьТранзакцию();
//		Исключение
//			Если ТранзакцияАктивна() Тогда
//				ОтменитьТранзакцию();
//			КонецЕсли;
//			ЗаписатьВЛог("ВБрз"," !ошибка при формировании документов в ходе контроля кол-ва "+ ОписаниеОшибки(),"Информация");
//		КонецПопытки;
//		
//	КонецЕсли;
//КонецПроцедуры	
//Процедура КонтрольИМодифРНК(РНКСсыл,Компл)
//	ЗаписатьВЛог("ВБрз","Начало выполнения. Задача: Контроль остатка ВБ.!  ","Информация");
//	ВбрМкПл=Справочники.ИнетМагазины.НайтиПоКоду("00001");
//	Если ВбрМкПл.Тест Тогда
//		//так отменяем контроль по ост. ничего не делаем
//		ЗаписатьВЛог("ВБрз","Отмена выполнения. Задача: Контроль остатка ВБ.!  ","Информация");	
//		Возврат;
//	КонецЕсли;	
//	Попытка
//		Если НЕ РНКСсыл.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе Тогда
//			//ничего не делаем
//			ЗаписатьВЛог("ВБрз","Отмена выполнения по состоянию документа. Задача: Контроль остатка ВБ.!   ","Информация");
//			Возврат;
//		КонецЕсли;
//	Исключение
//		ЗаписатьВЛог("ВБрз","Отмена выполнения нет документа РНК. Задача: Контроль остатка ВБ.!   ","Информация");
//		Возврат;
//	КонецПопытки;
//	ЗаказКФ=неопределено;
//	Запрос1=Новый Запрос;
//	Запрос1.Текст=
//	"ВЫБРАТЬ
//	|	ЗаказКлиентаFBS.Ссылка КАК Ссылка
//	|ИЗ
//	|	Документ.ЗаказКлиентаFBS КАК ЗаказКлиентаFBS
//	|ГДЕ
//	|	ЗаказКлиентаFBS.ДокОснование = &РНКСсыл";
//	Запрос1.УстановитьПараметр("РНКСсыл",РНКСсыл);
//	Выб=Запрос1.Выполнить().Выбрать();
//	Если Выб.Следующий() Тогда
//		ЗаказКФ=Выб.Ссылка;
//	КонецЕсли;
//	Если НЕ ЗначениеЗаполнено(ЗаказКФ) Тогда
//		ЗаписатьВЛог("ВБрз","Отмена выполнения нет документа ЗаказКлиентаFBS. Задача: Контроль остатка ВБ.!   ","Информация");
//		Возврат;
//	КонецЕсли;
//	
//	Если Компл Тогда
//		ТЗНом=РНКСсыл.Комплектующие.Выгрузить();
//	Иначе
//		ТЗНом=РНКСсыл.Товары.Выгрузить();
//		Для Каждого ТСтр Из ТЗНом Цикл
//			ТСтр.Количество=ТСтр.Заявка;
//		КонецЦикла;	
//	КонецЕсли;	
//	ТЗНом.Свернуть("Номенклатура","Количество");
//	СпН = ТЗНом.ВыгрузитьКолонку("Номенклатура");
//	Запрос=Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|ТЗНом.Номенклатура КАК Номенклатура,
//	|ТЗНом.Количество КАК Количество
//	|ПОМЕСТИТЬ ВТ_НомДок
//	|ИЗ
//	|	&ТЗНом КАК ТЗНом
//	|;
//	|ВЫБРАТЬ
//	//|	СУММА(Остатки.СуммаОстаток) КАК СебестоимостьБух,
//	|	СУММА(Остатки.КоличествоОстаток - ЕСТЬNULL(Резервы.КоличествоОстаток, 0)) КАК КолКонФакт,
//	|	СУММА(ЕСТЬNULL(Резервы.КоличествоОстаток, 0)) КАК Резерв,
//	|	Ложь КАК Комплект,
//	|	Остатки.Номенклатура КАК Номенклатура
//	|	ПОМЕСТИТЬ ВТ_ОстСкл
//	|ИЗ
//	|	РегистрНакопления.ОстаткиТМЦ.Остатки(
//	|			,
//	|			Склад В ИЕРАРХИИ (&Склады)
//	|				И Номенклатура В ИЕРАРХИИ (&Ном)) КАК Остатки
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
//	|				,
//	|				Склад В ИЕРАРХИИ (&Склады)
//	|					И Номенклатура В ИЕРАРХИИ (&Ном)) КАК Резервы
//	|		ПО Остатки.Номенклатура = Резервы.Номенклатура
//	|			И Остатки.Склад = Резервы.Склад
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	Остатки.Номенклатура
//	|;
//	|ВЫБРАТЬ 
//	| НомДок.Номенклатура КАК Номенклатура,
//	| isnull(КолКонФакт,0) КАК Доступно,
//	| (НомДок.Количество-isnull(КолКонФакт,0)) КАК НеХват,
//	| ВЫБОР КОГДА &Провод 
//	| ТОГДА НомДок.Количество
//	| ИНАЧЕ 0 КОНЕЦ КАК УжеРезерв
//	| ИЗ ВТ_НомДок КАК НомДок
//	| ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстСкл КАК ОстСкл
//	| ПО НомДок.Номенклатура=ОстСкл.Номенклатура
//	//возврат резерва
//	| ГДЕ НомДок.Количество>(isnull(КолКонФакт,0)+ВЫБОР КОГДА &Провод 
//	| ТОГДА НомДок.Количество
//	| ИНАЧЕ 0 КОНЕЦ)
//	|";
//	
//	Запрос.УстановитьПараметр("ном",СпН);
//	Запрос.УстановитьПараметр("Склады",РНКСсыл.Склад);
//	Запрос.УстановитьПараметр("Провод",РНКСсыл.Проведен);
//	Запрос.УстановитьПараметр("ТЗНом",ТЗНом);
//	ТЗКорр=Запрос.Выполнить().Выгрузить();
//	Если НЕ ТЗКорр.Количество() Тогда
//		ДокРНК1=РНКСсыл.ПолучитьОбъект();
//		ДокРНК1.СостояниеНакладной=Перечисления.СостоянияНакладной.КОтправкеНаСклад;
//		ДокРНК1.Записать(РежимЗаписиДокумента.Проведение);
//		ЗаписатьВЛог("ВБрз","Окончание выполнения. Задача: Контроль остатка ВБ Переведено в состояние КОтправкеНаСклад! 2  ","Информация");
//		Возврат;
//	КонецЕсли;
//	
//	МасНСЗак=Новый Массив;
//	МасНСРНК=Новый Массив;
//	//для начала дропим строки с проблемными товарами
//	ТЗЗак=ЗаказКФ.Товары.Выгрузить();
//	Если Компл Тогда
//		ТЗПрод=РНКСсыл.Товары.Выгрузить();
//		ТЗКомпл=РНКСсыл.Комплектующие.Выгрузить();
//		МПрод=Новый Массив;
//		Для Каждого ТекСтр Из ТЗКорр Цикл
//			Ном=ТекСтр.Номенклатура;
//			Найды=ТЗКомпл.НайтиСтроки(Новый Структура("Номенклатура",Ном));
//			Для Каждого Найд Из Найды Цикл
//				Если МПрод.Найти(Найд.Продукция)=неопределено Тогда
//					МПрод.Добавить(Найд.Продукция);
//				КонецЕсли;	
//			КонецЦикла;	 
//		КонецЦикла;	
//		Для Каждого Прод Из МПрод Цикл
//			Найды1=ТЗПрод.НайтиСтроки(Новый Структура("Номенклатура",Прод));
//			Для Каждого Найд1 Из Найды1 Цикл
//				МасНСРНК.Добавить(Найд1.НомерСтроки);
//				
//			КонецЦикла;
//			
//			Найды2=ТЗЗак.НайтиСтроки(Новый Структура("Номенклатура",Прод));
//			Для Каждого Найд2 Из Найды2 Цикл
//				МасНСЗак.Добавить(Найд2.НомерСтроки);
//				
//			КонецЦикла;
//			
//		КонецЦикла;	
//	Иначе
//		ТЗТов=РНКСсыл.Товары.Выгрузить();
//		
//		Для Каждого ТекСтр Из ТЗКорр Цикл
//			Ном=ТекСтр.Номенклатура;
//			Найды1=ТЗТов.НайтиСтроки(Новый Структура("Номенклатура",Ном));
//			Для Каждого Найд1 Из Найды1 Цикл
//				МасНСРНК.Добавить(Найд1.НомерСтроки);
//				
//			КонецЦикла;
//			
//			Найды2=ТЗЗак.НайтиСтроки(Новый Структура("Номенклатура",Ном));
//			Для Каждого Найд2 Из Найды2 Цикл
//				МасНСЗак.Добавить(Найд2.НомерСтроки);
//				
//			КонецЦикла;	 
//		КонецЦикла;	
//		
//	КонецЕсли;	
//	СписокПолучателей=новый СписокЗначений;
////	СписокПолучателей.Добавить("nechaeva@collant.ru");
//	СписокПолучателей.Добавить("yamshikova@collant.ru");
//	НачатьТранзакцию();
//	Попытка
//		ДокРНК2=Документы.РасходнаяНакладная.СоздатьДокумент();
//		ЗаполнитьЗначенияСвойств(ДокРНК2,РНКСсыл);
//		

//		л=РНКСсыл.Товары.Количество()-1;
//		н=0;
//		Пока н<л Цикл
//			ТекСтр=РНКСсыл.Товары.Получить(н);
//			ТекНС=ТекСтр.НомерСтроки;
//			Если НЕ МасНСРНК.Найти(ТекНС)=неопределено Тогда
//				НовСтр=ДокРНК2.Товары.Добавить();
//				ЗаполнитьЗначенияСвойств(НовСтр,ТекСтр);
//			КонецЕсли;
//			
//			н=н+1;
//		КонецЦикла;
//		Если Компл Тогда
//			ЗаполнитьКомплектующие(ДокРНК2);
//		КонецЕсли;
//		ДокРНК2.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
//		ДокРНК2.Проведен=Ложь;
//		ДокРНК2.Дата=ТекущаяДатаСеанса();
//		//ДокРНК2.УстановитьНовыйНомер();
//		УстановитьНомерДокументаКлиентСервер(ДокРНК2);
//		ДокРНК2.Записать(РежимЗаписиДокумента.Запись);
//		
//		
//		// Кухарь А.Ю. 04.02.2022 начало
//		//Потом переделаю на ТЧ справочника инет магазины
//		ЧасПриемки=Час(ДокРНК2.Дата);
//		если ЧасПриемки>=0 и ЧасПриемки<8 тогда	
//			ТекВремяПриемки=Справочники.ВремяПриемки.НайтиПоКоду("000000135"); //21-21
//		ИначеЕсли ЧасПриемки>=8 и ЧасПриемки<16 тогда	
//			ТекВремяПриемки=Справочники.ВремяПриемки.НайтиПоКоду("000000082");//05-05
//		иначе
//			ТекВремяПриемки=Справочники.ВремяПриемки.НайтиПоКоду("000000060");//13-13
//		КонецЕсли;
//		
//		попытка
//			ЗаписатьВремяПриемкиДляЗОГ(ДокРНК2.Ссылка,ТекВремяПриемки);
//		Исключение
//		КонецПопытки;	
//		
//		// Кухарь А.Ю. 04.02.2022 конец
//		
//		ДокЗ2=Документы.ЗаказКлиентаFBS.СоздатьДокумент();
//		ЗаполнитьЗначенияСвойств(ДокЗ2,ЗаказКФ);
//		л=ЗаказКФ.Товары.Количество()-1;
//		н=0;
//		Пока н<л Цикл
//			ТекСтр=ЗаказКФ.Товары.Получить(н);
//			ТекНС=ТекСтр.НомерСтроки;
//			Если НЕ МасНСЗак.Найти(ТекНС)=неопределено Тогда
//				НовСтр=ДокЗ2.Товары.Добавить();
//				ЗаполнитьЗначенияСвойств(НовСтр,ТекСтр);
//			КонецЕсли;
//			
//			н=н+1;
//		КонецЦикла;
//		ДокЗ2.ДокОснование=ДокРНК2.Ссылка;
//		ДокЗ2.Дата=ТекущаяДатаСеанса();
//		
//		
//		
//		ДокЗ2.УстановитьНовыйНомер();
//		ДокЗ2.Записать(РежимЗаписиДокумента.Проведение);
//		
//		ДокРНК1=РНКСсыл.ПолучитьОбъект();
//		ДокРНК1.Комплектующие.Очистить();
//		н=ДокРНК1.Товары.Количество()-1;
//		Пока н>=0 Цикл
//			ТекСтр=ДокРНК1.Товары.Получить(н);
//			ТекНС=ТекСтр.НомерСтроки;
//			Если НЕ МасНСРНК.Найти(ТекНС)=неопределено Тогда
//				ДокРНК1.Товары.Удалить(н);
//			КонецЕсли;
//			
//			н=н-1;
//		КонецЦикла;	
//		
//		Если Компл Тогда
//			ЗаполнитьКомплектующие(ДокРНК1);
//		КонецЕсли;	
//		ДокРНК1.СостояниеНакладной=Перечисления.СостоянияНакладной.КОтправкеНаСклад;
//		ДокРНК1.Записать(РежимЗаписиДокумента.Проведение);
//		
//		
//		ДокЗ1=ЗаказКФ.ПолучитьОбъект();
//		н=ДокЗ1.Товары.Количество()-1;
//		Пока н>=0 Цикл
//			ТекСтр=ДокЗ1.Товары.Получить(н);
//			ТекНС=ТекСтр.НомерСтроки;
//			Если НЕ МасНСЗак.Найти(ТекНС)=неопределено Тогда
//				ДокЗ1.Товары.Удалить(н);
//			КонецЕсли;
//			
//			н=н-1;
//		КонецЦикла;	
//		ДокЗ1.Записать(РежимЗаписиДокумента.Проведение);
//		ЗафиксироватьТранзакцию();
//		ТекстОповещения="Разделена по причине нехватки товаров РНК "+Строка(РНКСсыл)+" добавлена РНК "+Строка(ДокРНК2.Ссылка);
//		
//	Исключение
//		Если ТранзакцияАктивна() Тогда
//			ОтменитьТранзакцию();
//		КонецЕсли;
//		ТекстОповещения=" !ошибка при формировании документов в ходе контроля остатков "+ ОписаниеОшибки();
//		ЗаписатьВЛог("ВБрз"," !ошибка при формировании документов в ходе контроля остатков "+ ОписаниеОшибки(),"Информация");
//	КонецПопытки;
//	//Сообщение.Получатели.Добавить("nechaeva@collant.ru");
//	////Сообщение.Получатели.Добавить("egorova@collant.ru");
//	//Сообщение.Получатели.Добавить("yamshikova@collant.ru");
//	ОбменМаркетПлейс.ОтправитьПочтовоеСообщениеИзЕкода(СписокПолучателей,НСтр("ru='Контроль загрузка заказов Вбр '")+Формат(ТекущаяДатаСеанса(),"ДФ='dd.MM.yyyy чч:мм'"),ТекстОповещения);
//	ЗаписатьВЛог("ВБрз","Окончание выполнения. Задача: Контроль остатка ВБ.! 2  ","Информация");
//КонецПроцедуры
