
Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт         
	
	запрос = новый запрос;
	запрос.Текст =  "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ХКМ.Ссылка КАК ХКМ,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА МаркировкаТоваровИСМП.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Статус
	|ИЗ
	|	Документ.ХранилищеКодовМаркировки КАК ХКМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыКМ_Факт КАК СтатусыКМ_Факт
	|		ПО (СтатусыКМ_Факт.Регистратор = ХКМ.Ссылка)
	|			И (СтатусыКМ_Факт.ТипШК = ЗНАЧЕНИЕ(перечисление.типыштрихкодов.штука))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
	|		ПО ХКМ.ДокОснование = МаркировкаТоваровИСМП.ДокументОснование
	|ГДЕ
	|	ХКМ.Дата >= &ДЗР
	|	И ХКМ.Проведен
	|	И СтатусыКМ_Факт.ШтрихКодУпаковки ЕСТЬ NULL
	|	И ХКМ.ДокОснование ССЫЛКА Документ.РасходнаяНакладная
	|	И (ЕСТЬNULL(ХКМ.ДокОснование.ПравилаАгрегацииЧестногоЗнака.ТребуетсяАгрегацияБлочков, ЛОЖЬ)
	|			ИЛИ ЕСТЬNULL(ХКМ.ДокОснование.ПравилаАгрегацииЧестногоЗнака.ТребуетсяАгрегацияКоробок, ЛОЖЬ)
	|			ИЛИ ЕСТЬNULL(ХКМ.ДокОснование.ПравилаАгрегацииЧестногоЗнака.ТребуетсяАгрегацияПаллет, ЛОЖЬ))
	|
	|СГРУППИРОВАТЬ ПО
	|	ХКМ.Ссылка,
	|	МаркировкаТоваровИСМП.Статус
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ВЫБОР
	|			КОГДА МаркировкаТоваровИСМП.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) = 1";
	запрос.УстановитьПараметр("ДЗР",ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования());
	Выборка = запрос.Выполнить().Выбрать();
	пока Выборка.Следующий() цикл
		ЗаписатьВЛог("Кривые ХКМ",""+Выборка.ХКМ,"Информация");
		ХКМ = Выборка.ХКМ.ПолучитьОбъект();
		ХКМ.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
КонецПроцедуры