
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если Параметры.Свойство("ДокСсылка") Тогда
		Объект.ДокСсылка = параметры.Докссылка;   	 
	КонецЕсли; 
	УправлениеВидимостью();
	УстановитьУсловноеОформление(); 
	//++Данилова Е.В. 01.06.2026 SNL-243
	ЗаполнитьНастройки(); 
	//--Данилова Е.В. 01.06.2026 
КонецПроцедуры

&НаКлиенте
Процедура КоробкиПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.Коробки.ТекущиеДанные; 
	Если ТекущиеДанные = Неопределено Тогда
		Возврат; 	
	КонецЕсли;
	IDКоробкиВыделить =  ТекущиеДанные.id_Короба;
	IDБлочкаВыделитьМ.Очистить();
	СтрокиПоБлочку = Объект.СодержимоеБлочка.НайтиСтроки(Новый Структура("id_Короба",IDКоробкиВыделить)); 
	Для Каждого СтрокиПоБлочку Из СтрокиПоБлочку Цикл
		Если IDБлочкаВыделитьМ.НайтиПоЗначению(СтрокиПоБлочку.id_Блочка) = Неопределено Тогда
			IDБлочкаВыделитьМ.Добавить(СтрокиПоБлочку.id_Блочка);
		КонецЕсли;
	КонецЦикла; 
	IDБлочкаВыделить = 0;
	IDКоробкиВыделитьПоБлочкам = 0; 
	УстановитьУсловноеОформление(); 
КонецПроцедуры


&НаКлиенте
Процедура ВсегоБлочковПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.ВсегоБлочков.ТекущиеДанные; 
	Если ТекущиеДанные = Неопределено Тогда
		Возврат; 	
	КонецЕсли;
	IDБлочкаВыделить =  ТекущиеДанные.id_Блочка; 
	СтрокиПоБлочку = Объект.СодержимоеБлочка.НайтиСтроки(Новый Структура("id_Блочка",IDБлочкаВыделить)); 
	Для Каждого СтрокиПоБлочку Из СтрокиПоБлочку Цикл
		IDКоробкиВыделитьПоБлочкам = СтрокиПоБлочку.id_Короба; 
	КонецЦикла;
	IDБлочкаВыделитьМ.Очистить();
	IDКоробкиВыделить = 0; 
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПоБлочкамПриИзменении(Элемент)
	Объект.ВсегоБлочков.Очистить();
	Объект.СодержимоеБлочка.Очистить();
	Объект.Товары.Очистить();
	Объект.Коробки.Очистить();
	//++Данилова Е.В. 01.06.2026 SNL-243  
	СборныйКороб.Очистить();
	//--Данилова Е.В. 01.06.2026 
	УправлениеВидимостью(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЛистовПереукладкиПриИзменении(Элемент)
		
	Для Каждого СтрокаТовара Из Объект.товары Цикл
		СтрокаТовара.КоличествоКоробов = КоличествоЛистовПереукладки; 
	КонецЦикла;
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные; 
	Если ТекущиеДанные  = неопределено Тогда
		Возврат; 
	КонецЕсли;
	//++Данилова Е.В. 01.06.2026 SNL-243
	КолВЛПСоответствие = ВернутьКоличествоЛППоМассиву(ТекущиеДанные.Номенклатура); 
	//--Данилова Е.В. 01.06.2026
	ТоварыНоменклатураПриИзмененииНаКлиенте(ТекущиеДанные,КолВЛПСоответствие);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные; 
	Если ТекущиеДанные  = неопределено Тогда
		Возврат; 
	КонецЕсли;
	Если ТекущиеДанные.Количество = 0 Тогда
		ТекущиеДанные.КоличествоКоробов = 0;
	ИначеЕсли ЗначениеЗаполнено(КоличествоЛистовПереукладки) Тогда
		 ТекущиеДанные.КоличествоКоробов = КоличествоЛистовПереукладки; 
	Иначе
		ТекущиеДанные.КоличествоКоробов = ТекущиеДанные.КоличествоВНакладной / ТекущиеДанные.Количество;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСодержимоеБлочка
&НаКлиенте
Процедура СодержимоеБлочкаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Отказ = Истина; 
КонецПроцедуры

&НаКлиенте
Процедура СодержимоеБлочкаПослеУдаления(Элемент)
	СверитьСтрокиВсегоБлочки();
КонецПроцедуры

&НаКлиенте
Процедура СодержимоеБлочкаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НоваяСтрока Тогда
		
		СтрокаРедактируемая = Элементы.СодержимоеБлочка.ТекущиеДанные;
		
		ЗаполнитьДопПоляПоНоменклатуреНаКлиенте(СтрокаРедактируемая); 	
		ЗаполнитьidБлочканаКлиенте(СтрокаРедактируемая);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СодержимоеБлочкаКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СодержимоеБлочка.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
	
		РассчитатьВсегоБлочковНаКлиенте(ТекущиеДанные);	
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СодержимоеБлочкаid_БлочкаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СодержимоеБлочка.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
	
		РассчитатьВсегоБлочковНаКлиенте(ТекущиеДанные,истина);	
	
	КонецЕсли;
КонецПроцедуры
#КонецОбласти



#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПодборПоБлочкам(Команда)
	МассивТоваров = ПодборПоБлочкамНаСервере(СсылкаПоДокОбъекту());
	
	Если МассивТоваров.Количество() = 0 Тогда
		Возврат; 
	КонецЕсли;	
	
	ОписаниеОповещенияВыбор = Новый ОписаниеОповещения("ПослеВыбораНоменклатурыПоБлочкам",ЭтотОбъект);
	ПараметрОткрытияФормы = Новый Структура("НоменклатураВыбора,РежимВыбора",МассивТоваров,истина ); 
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбораУпр",ПараметрОткрытияФормы,ЭтотОбъект,,,,ОписаниеОповещенияВыбор); 
		
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоКоробам(Команда)
	МассивТоваров = ПодборПоКоробамНаСервере();
	
	Если МассивТоваров.Количество() = 0 Тогда
		Возврат; 
	КонецЕсли;
	
	ОписаниеОповещенияВыбор = Новый ОписаниеОповещения("ПослеВыбораНоменклатурыПоКоробкам",ЭтотОбъект);
	ПараметрОткрытияФормы = Новый Структура("НоменклатураВыбора,РежимВыбора",МассивТоваров,истина ); 
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбораУпр",ПараметрОткрытияФормы,ЭтотОбъект,,,,ОписаниеОповещенияВыбор);
КонецПроцедуры


&НаКлиенте
Процедура РасчитатьИзМатрицыПоКоробкам(Команда)
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Идет обработка...";
	Сообщение.Сообщить();	
	 
	РасчитатьИзМатрицыПоКоробкамНаСервереСЗаполнением();
	//РасчитатьИзМатрицыПоКоробкамНаСервере(); 
	//++Данилова Е.В. 01.06.2026 SNL-243
	МассивТоваров = МассивТоваровПоТЧТовары(); 
	КолВЛПСоответствие = ВернутьКоличествоЛППоМассиву(МассивТоваров); 
	//--Данилова Е.В. 01.06.2026
	Для каждого СтрокаТоваров Из Объект.Товары Цикл
		
		//@skip-check query-in-loop
		//++Данилова Е.В. 01.06.2026 SNL-243
		ТоварыНоменклатураПриИзмененииНаКлиенте(СтрокаТоваров,КолВЛПСоответствие);
		//--Данилова Е.В. 01.06.2026 
	КонецЦикла;
	
	ЗаполнитьТЧКоробкиПоТоварам();
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Закончена обработка.";
	Сообщение.Сообщить();
КонецПроцедуры
&НаСервере
Функция МассивТоваровПоТЧТовары()
	Возврат Объект.Товары.Выгрузить().ВыгрузитьКолонку("Номенклатура"); 
КонецФункции

&НаКлиенте
Процедура СоздатьЛисты(Команда)
	СоздатьЛистыНаСервере();
	//++Данилова Е.В. 01.06.2026 SNL-243
	МассивТоваров = МассивТоваровПоТЧТовары(); 
	КолВЛПСоответствие = ВернутьКоличествоЛППоМассиву(МассивТоваров); 
	//--Данилова Е.В. 01.06.2026
	Для каждого СтрТЧ из Объект.Товары цикл
		//@skip-check query-in-loopэ
		//++Данилова Е.В. 01.06.2026 SNL-243
		ТоварыНоменклатураПриИзмененииНаКлиенте(СтрТЧ,КолВЛПСоответствие)
		//--Данилова Е.В. 01.06.2026 		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКороба(Команда)
	Если Не ЗначениеЗаполнено(ТипКороба) Тогда
		ПоказатьПредупреждение(,"Заполните тип короба в шапке!!!" );
		Возврат; 
	КонецЕсли;
	ЗаполнитьТЧКоробкиПоТоварам();
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьВыделенныеВКоробку(Команда)
	
	ОпределитьВыделенныеВКоробкуНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПоКоробам(Команда)
	РаспределитьПоКоробамНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьБлочки(Команда)
	ОбновитьБлочкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьКоличествоКоробок(Команда)
	РассчитатьКоличествоКоробокНаСервере();
	//++Данилова Е.В. 23.06.2026 Проб.№0000000089 
	Если ПоБлочкам Тогда 
		Для каждого СтрокаТЧ Из  Объект.Коробки Цикл
			
			ИдКоробки = СтрокаТЧ.id_Короба;		  
			ПерезаполнитьРасчПоляТЧКоробки(ИдКоробки);
			
		КонецЦикла;
	КонецЕсли;
	//--Данилова Е.В. 23.06.2026
КонецПроцедуры

&НаКлиенте
Процедура КонтрольРаспределенияТоваровРНК(Команда)
	КонтрольРаспределенияТоваровРНКНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЛистыПоБлочкам(Команда)
	СоздатьЛистыПоБлочкамНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьОбъемКоробок(Команда)
	ПересчитатьОбъемКоробокНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьКоробовКонтрагента(Команда)
	Естьошибки = Ложь; 
	ТЗКоробов = неопределено;
	ТЗНераспр = Неопределено;
	ТабДокумент = ПечатьКоробовКонтрагентаНаСервере(Естьошибки,ТЗКоробов,ТЗНераспр);
	 
	Если Не Естьошибки Тогда
		ТабДокумент.Показать();
		ДопПараметры = Новый Структура("ТЗКоробов,ТЗНераспр",ТЗКоробов,ТЗНераспр);
		ОповещениеВопрос = Новый ОписаниеОповещения("ПослеОтветаНаВопросСоздатьЛП", ЭтотОбъект,ДопПараметры);
		ПоказатьВопрос(ОповещениеВопрос, "Сформировать листы переукладки?", РежимДиалогаВопрос.ДаНет, ,
			КодВозвратаДиалога.Нет);

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьБлочкиПоМатрице(Команда)

Если Не ЗначениеЗаполнено(ТипКороба) Тогда
	 
	 ПоказатьПредупреждение(,"заполните в шапке тип короба!"); 
	 Возврат; 
	 
 КонецЕсли; 
 
 Объект.ВсегоБлочков.Очистить();
 Объект.СодержимоеБлочка.Очистить();
 Объект.Коробки.Очистить();
 
 ЗаполнитьБлочкиПоМатрицеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьОтметку(Команда)
	ПроставитьОтметкуТЧ(Истина); 
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметку(Команда)
	ПроставитьОтметкуТЧ(Ложь);
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыиФункции
//++Данилова Е.В. 01.06.2026 SNL-243
&НаКлиенте
Процедура ПроставитьОтметкуТЧ(Отметка,ИмяТЧ = "СборныйКороб")
	Для Каждого СтрокаТЧ Из ЭтотОбъект[ИмяТЧ] Цикл
		СтрокаТЧ.Отметка = Отметка; 
	КонецЦикла;
КонецПроцедуры
//--Данилова Е.В. 01.06.2026 
&НаСервере
Процедура ЗаполнитьНастройки()
	ТЗТовары = ВернутьТоварыРНК();
	ТоварыРНК = Новый Соответствие();
	Для Каждого СтрокаТовара Из ТЗТовары Цикл
		ТоварыРНК.Вставить(СтрокаТовара.Номенклатура,СтрокаТовара.Количество); 
	КонецЦикла;
	ТоварыРНКСтруктура = Новый Структура("ТоварыРНК",ТоварыРНК);
КонецПроцедуры
&НаСервере
Процедура УстановитьУсловноеОформление()
	/////////////////////////////////////////////////////////// 
	 УсловноеОформление.Элементы.Очистить();
	 Если ЗначениеЗаполнено(IDКоробкиВыделить) Тогда  
		 ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		 ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		 ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.id_Короба"); 
		 ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
		 ЭлементОтбора.ПравоеЗначение = IDКоробкиВыделить;
		 ЭлементОтбора.Использование = Истина;	
		 
		 ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЖелтыйЗолотистый);
		 ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		 ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Товары");
		 ПолеОформления.Использование = Истина;
		 ////////////////////////////////////////////////////////////
		 ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		 ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		 ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СодержимоеБлочка.id_Короба"); 
		 ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
		 ЭлементОтбора.ПравоеЗначение = IDКоробкиВыделить;
		 ЭлементОтбора.Использование = Истина;	
		 
		 ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЖелтыйЗолотистый);
		 ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		 ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СодержимоеБлочка");
		 ПолеОформления.Использование = Истина;
	 КонецЕсли;
	 Если ЗначениеЗаполнено(IDКоробкиВыделитьПоБлочкам) Тогда 
		 ////////////////////////////////////////////////////////////
		 ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		 ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		 ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Коробки.id_Короба"); 
		 ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
		 ЭлементОтбора.ПравоеЗначение = IDКоробкиВыделитьПоБлочкам;
		 ЭлементОтбора.Использование = Истина;	
		 
		 ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЖелтыйЗолотистый);
		 ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		 ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Коробки");
		 ПолеОформления.Использование = Истина; 
	 КонецЕсли;
 	/////////////////////////////////////////////////////////// 
	Если IDБлочкаВыделитьМ.Количество() > 0 Тогда 
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВсегоБлочков.id_Блочка"); 
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; 
		ЭлементОтбора.ПравоеЗначение = IDБлочкаВыделитьМ;
		ЭлементОтбора.Использование = Истина;
		
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЖелтыйЗолотистый);
		ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ВсегоБлочков");
		ПолеОформления.Использование = Истина;
	КонецЕсли;
	///////////////////////////////////////////////////////////
	Если ЗначениеЗаполнено(IDБлочкаВыделить) Тогда
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СодержимоеБлочка.id_Блочка"); 
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
		ЭлементОтбора.ПравоеЗначение = IDБлочкаВыделить;
		ЭлементОтбора.Использование = Истина;	
		
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЖелтыйЗолотистый);
		ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СодержимоеБлочка");
		ПолеОформления.Использование = Истина;
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьБлочкиПоМатрицеНаСервере()
	
	ТЗ = Новый ТаблицаЗначений; 
	
	ОписаниеТиповНоменклатура = Новый ОписаниеТипов("СправочникСсылка.Номенклатура"); 
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100)); 
	ОписаниеТиповЧисло = Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10)); 
	
	ТЗ.Колонки.Добавить("Номенклатура",ОписаниеТиповНоменклатура);		
	ТЗ.Колонки.Добавить("АртикулКонтрагента",ОписаниеТиповСтрока);   
	ТЗ.Колонки.Добавить("КратностьКоробки",ОписаниеТиповЧисло);            
	ТЗ.Колонки.Добавить("Кратность",ОписаниеТиповЧисло); //кратность блочка  
	ТЗ.Колонки.Добавить("Количество",ОписаниеТиповЧисло); //для расчета комплектующих 
	
	НельзяЗагружать = ложь;	
	ТоварыРНК = ВернутьТоварыРНК(); 
	Для Каждого СтрокаТЧ из ТоварыРНК Цикл
		если СтрокаТЧ.Количество=0 тогда Продолжить;КонецЕсли;
		
		РеквизитыНоменклатуры = ПолучитьРеквизитыНоменклатурыИзМатрицы(СтрокаТЧ.Номенклатура,СсылкаПоДокОбъекту());
		Если РеквизитыНоменклатуры.номенклатура= Справочники.Номенклатура.ПустаяСсылка()  тогда
			НельзяЗагружать=Истина;
			СообщитьПользователюСервер("по номенклатуре "+СтрокаТЧ.Номенклатура.Наименование+" нет данных в матрице, ЛП не будут созданы.");
			Продолжить;
		КонецЕсли;
		Если  РеквизитыНоменклатуры.КратностьКоробки=0 тогда
			НельзяЗагружать=Истина;
			СообщитьПользователюСервер("по номенклатуре "+СтрокаТЧ.Номенклатура.Наименование+" пустая кратность коробки, ЛП не будут созданы");
			Продолжить;
		КонецЕсли;
		
		Если  РеквизитыНоменклатуры.Кратность = 0 тогда
			НельзяЗагружать = Истина;
			СообщитьПользователюСервер("по номенклатуре "+СтрокаТЧ.Номенклатура.Наименование+" пустая кратность блочка, ЛП не будут созданы");
			Продолжить;
		КонецЕсли;
		
		СтрТЗ = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(СтрТЗ,РеквизитыНоменклатуры);
		СтрТЗ.Количество = СтрокаТЧ.Количество; 
	КонецЦикла;
	
	Если НельзяЗагружать тогда 
		Возврат;
	КонецЕсли;
	
	ТЗКопия = ТЗ.Скопировать(); 
	//++Данилова Е.В. 02.06.2026 SNL-243
	ТЗБезРазделБлочПоАртик = ТЗ.Скопировать();
	ТЗБезРазделБлочПоАртикКопия = ТЗ.Скопировать();
	ТЗБезРазделБлочПоАртик.Свернуть("АртикулКонтрагента,КратностьКоробки","Количество");
	ТЗБезРазделБлочПоАртикКопия.Свернуть("АртикулКонтрагента,Номенклатура,КратностьКоробки,Кратность","Количество");
	//--Данилова Е.В. 02.06.2026 
	
	ТЗ.Свернуть("АртикулКонтрагента,КратностьКоробки,Кратность","Количество");
	//проверка, что кратность блочка и кратность коробки  указана одна на артикул 
	//если РазделятьБлочкиПоНоменклатуре 
	//то сумма по кратности, и надо разделить в этом случае id блочка 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.АртикулКонтрагента КАК АртикулКонтрагента,
		|	ТЗ.КратностьКоробки КАК КратностьКоробки,
		|	ТЗ.Кратность КАК Кратность
		|ПОМЕСТИТЬ ВТТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТЗ.АртикулКонтрагента КАК АртикулКонтрагента,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТТЗ.КратностьКоробки) КАК КратностьКоробки,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТТЗ.Кратность) КАК Кратность
		|ИЗ
		|	ВТТЗ КАК ВТТЗ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТТЗ.АртикулКонтрагента
		|
		|ИМЕЮЩИЕ
		|	(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТТЗ.КратностьКоробки) > 1
		|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТТЗ.Кратность) > 1)";
	
	Запрос.УстановитьПараметр("ТЗ",ТЗ); 
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать(); 
		
		Пока Выборка.Следующий() Цикл			
			
			СообщитьПользователюСервер("По " + Выборка.АртикулКонтрагента + "неверно указана кратность коробки или кратность блочка"); 	
			
		КонецЦикла;
		
		Возврат; 
		
	КонецЕсли;  	
	
	ТЗ.Колонки.Добавить("id_Блочка",ОписаниеТиповЧисло);
	ТЗ.Колонки.Добавить("КоличествоБлочков",ОписаниеТиповЧисло); 
	
	//++Данилова Е.В. 02.06.2026 SNL-243
	ТЗ.Колонки.Добавить("id_Короба",ОписаниеТиповЧисло); 
	
	ТЗБезРазделБлочПоАртикКопия.Колонки.Добавить("id_Блочка",ОписаниеТиповЧисло);
	ТЗБезРазделБлочПоАртикКопия.Колонки.Добавить("id_Короба",ОписаниеТиповЧисло);
	ТЗБезРазделБлочПоАртикКопия.Колонки.Добавить("КоличествоБлочков",ОписаниеТиповЧисло);
	ТЗБезРазделБлочПоАртикКопия.Колонки.Добавить("КоличествоВсего",ОписаниеТиповЧисло);
	ТЗБезРазделБлочПоАртикКопия.Сортировать("АртикулКонтрагента"); 
	//--Данилова Е.В. 02.06.2026 
	///////////////////////////////////////////////////
	
	Id_Блочка = 1;
	//++Данилова Е.В. 02.06.2026 SNL-243
	Если РазделятьБлочкиПоНоменклатуре Тогда
		АртикулКонтрагента = неопределено;
		Id_Короба = 0; 
    	Для Каждого СтрокаПродукции Из ТЗБезРазделБлочПоАртикКопия Цикл
			СтрокаВсегоБлочков = Объект.ВсегоБлочков.Добавить();
			СтрокаВсегоБлочков.id_Блочка  =  Id_Блочка;
			Отбор = Новый Структура("АртикулКонтрагента", СтрокаПродукции.АртикулКонтрагента);
			СтрокиОбщиеАртикул = ТЗБезРазделБлочПоАртик.НайтиСтроки(Отбор);
			
			Если  АртикулКонтрагента <> СтрокаПродукции.АртикулКонтрагента Тогда
				Id_Короба = Id_Короба + 1; 
			КонецЕсли;
			Если СтрокиОбщиеАртикул.Количество() > 0 Тогда
                
				//кол-во блочков расчетное 
				СтрокаОбщаяАртикул = СтрокиОбщиеАртикул[0];
				КоличествоКоробок = СтрокаОбщаяАртикул.Количество/СтрокаОбщаяАртикул.КратностьКоробки;
				//СтрокаВсегоБлочков.Количество = Цел(СтрокаОбщаяАртикул.КратностьКоробки / СтрокаОбщаяАртикул.Кратность);
                СтрокаВсегоБлочков.Количество =  СтрокаПродукции.Количество/КоличествоКоробок/СтрокаПродукции.Кратность; 
				СтрокаПродукции.id_Блочка 	= Id_Блочка;
				
				СтрокаПродукции.КоличествоВсего = СтрокаОбщаяАртикул.Количество;  //кол-во всего по артикулу , для коробки  			 
				СтрокаПродукции.КоличествоБлочков = СтрокаВсегоБлочков.Количество;
                /////////////////////////////////////////////////////////////////
				СтрокаПродукции.Количество =  СтрокаПродукции.КоличествоВсего; 
				////////////////////////////////////////////////////////
				СтрокаПродукции.id_Короба 	= Id_Короба;
				 
				  
				id_Блочка = id_Блочка + 1;
			КонецЕсли;
            АртикулКонтрагента = СтрокаПродукции.АртикулКонтрагента; 
		КонецЦикла;
    Иначе
    //--Данилова Е.В. 02.06.2026 
		Для Каждого СтрокаОбщаяАртикул Из ТЗ Цикл
			СтрокаВсегоБлочков = Объект.ВсегоБлочков.Добавить();
			СтрокаВсегоБлочков.id_Блочка  =  Id_Блочка;
			СтрокаВсегоБлочков.Количество = Цел(СтрокаОбщаяАртикул.КратностьКоробки / СтрокаОбщаяАртикул.Кратность);

			СтрокаОбщаяАртикул.id_Блочка = Id_Блочка;
			СтрокаОбщаяАртикул.КоличествоБлочков = СтрокаВсегоБлочков.Количество;
            //++Данилова Е.В. 02.06.2026 SNL-243
			СтрокаОбщаяАртикул.id_Короба = Id_Блочка;
			//--Данилова Е.В. 02.06.2026 
			id_Блочка = id_Блочка + 1;
		КонецЦикла;
	КонецЕсли;
	
	////////////////////////////////
	//++Данилова Е.В. 02.06.2026 SNL-243
	ТЗБезРазделБлочПоАртикКопия.Сортировать("Id_Блочка");
	//--Данилова Е.В. 02.06.2026 
	ПоКомплектующим = ложь; 
	Если ПолучитьРеквизитРНК("ОтгрузкаКомплектов") И ВернутьКомплектующиеРНК().Количество() > 0 Тогда
		
		ТЧТовары = ВернутьКомплектующиеРНК(); //ДокОбъект.Комплектующие;
		
		ПоКомплектующим = истина; 
	Иначе 	
		ТЧТовары = ВернутьТоварыРНК(); //ДокОбъект.Товары;
	КонецЕсли;
	
	Запрос = Новый Запрос; 
	Запрос.текст =
	"ВЫБРАТЬ
	|	СУММА(ЛистНабораТовары.Количество) КАК Количество,
	|	ЛистНабораТовары.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.ЛистПереукладки.Товары КАК ЛистНабораТовары
	|ГДЕ
	|	ЛистНабораТовары.Ссылка.Проведен
	|	И ЛистНабораТовары.Ссылка.ДокОснование = &ДокОснование
	|СГРУППИРОВАТЬ ПО
	|	ЛистНабораТовары.Номенклатура" 
	; 
	Запрос.УстановитьПараметр("ДокОснование",СсылкаПоДокОбъекту());
	ТоварыЛПСозданные = Запрос.Выполнить().Выгрузить(); 
	
	Для каждого СтрокаТЧ Из ТЧТовары Цикл
		ВидНоменклатуры = ПолучитьРеквизитОбъекта(СтрокаТЧ.Номенклатура.Родитель,"ВидНоменклатуры");
		Если ВидНоменклатуры <> Перечисления.ВидыНоменклаутры.Товар Тогда
			
			Продолжить; 	
			
		КонецЕсли;
		
		если СтрокаТЧ.Количество=0 тогда Продолжить;КонецЕсли;
		
		Если ПоКомплектующим Тогда
			
			ОтборПоНоменклатуре = СтрокаТЧ.Продукция; 	
		Иначе 
			ОтборПоНоменклатуре = СтрокаТЧ.Номенклатура; 
		КонецЕсли;
		
		Отбор = Новый Структура("Номенклатура",ОтборПоНоменклатуре);
		
		СтрокиИзМатрицы = ТЗКопия.НайтиСтроки(Отбор); 	
		
		Если СтрокиИзМатрицы.Количество() > 0  Тогда
			
			КоличествоВРНК = СтрокиИзМатрицы[0].Количество;
			
			ОтборПоАртикулу = Новый Структура("АртикулКонтрагента",СтрокиИзМатрицы[0].АртикулКонтрагента); 
			
			СтрокиИзСвернТЧ = ТЗ.НайтиСтроки(ОтборПоАртикулу); 
			//++Данилова Е.В. 02.06.2026 SNL-243
			Если РазделятьБлочкиПоНоменклатуре Тогда
				
				ОтборПоАртикулу = Новый Структура("АртикулКонтрагента,Номенклатура",СтрокиИзМатрицы[0].АртикулКонтрагента,ОтборПоНоменклатуре);
				СтрокиИзСвернТЧ = ТЗБезРазделБлочПоАртикКопия.НайтиСтроки(ОтборПоАртикулу);
			КонецЕсли;	
			//--Данилова Е.В. 02.06.2026 
			id_Блочка = 0;
			КратностьБлочкаРасч = 0;
			КоличествоБлочков = 0;
			//++Данилова Е.В. 02.06.2026 SNL-243
			id_Короба = 0; 
			//--Данилова Е.В. 02.06.2026 
			Если СтрокиИзСвернТЧ.Количество() > 0  Тогда
				
				id_Блочка = СтрокиИзСвернТЧ[0].id_Блочка;
				
				//++Данилова Е.В. 02.06.2026 SNL-243
				id_Короба = СтрокиИзСвернТЧ[0].id_Короба;; 
				//--Данилова Е.В. 02.06.2026
				
				КоличествоКоробок = СтрокиИзСвернТЧ[0].Количество/СтрокиИзСвернТЧ[0].КратностьКоробки;
				
				КоличествоБлочков = СтрокиИзСвернТЧ[0].КоличествоБлочков; //Цел(СтрокиИзСвернТЧ[0].КратностьКоробки/СтрокиИзСвернТЧ[0].Кратность); 			
				
				КратностьБлочкаРасч = Цел(КоличествоВРНК/КоличествоКоробок/КоличествоБлочков);     
				// Кухарь А.Ю.  08.04.2026 начало
				// 
				//если РольДоступна("Администратор") тогда   
					КратностьБлочкаРасч = Окр(КоличествоВРНК/КоличествоКоробок/КоличествоБлочков,0); 
				//КонецЕсли;
				// Кухарь А.Ю.  08.04.2026 конец
				
			Иначе 
				
				СообщитьПользователюСервер("Ошибка в определении количества блочков в коробке!!!" + Строка(ОтборПоНоменклатуре)); 
				
				Продолжить; 
				
			КонецЕсли;
			
			
			ВидКомплекта= ПолучитьРеквизитОбъекта(ОтборПоНоменклатуре,"ВидКомплекта");
			Если ВидКомплекта = Перечисления.ВидыКомплектов.Ассортито Тогда
				//++Данилова Е.В. 04.03.2026 SNL-153 
				//КоличествоВблочке = Цел(СтрокаТЧ.Количество/КоличествоБлочков);
				КоличествоВблочке = Цел(СтрокаТЧ.Количество/КоличествоКоробок/КоличествоБлочков);
				//--Данилова Е.В. 04.03.2026 
				
			Иначе 
				КратностьКомплект = СтрокаТЧ.Количество/СтрокиИзМатрицы[0].Количество; 
				
				КоличествоВблочке = КратностьКомплект *  КратностьБлочкаРасч;	
				
			КонецЕсли;
			
			
			//заполняем содержимое 
			НоваяСтрокаСодер = Объект.СодержимоеБлочка.Добавить();
			НоваяСтрокаСодер.id_Блочка = id_Блочка;
			//++Данилова Е.В. 02.06.2026 SNL-243
			//НоваяСтрокаСодер.id_Короба = id_Блочка; 
			НоваяСтрокаСодер.id_Короба = Id_Короба;
			//--Данилова Е.В. 02.06.2026 
			НоваяСтрокаСодер.Количество = КоличествоВблочке;
			НоваяСтрокаСодер.КоличествоВНакладной = СтрокаТЧ.Количество;
			НоваяСтрокаСодер.Номенклатура = СтрокаТЧ.Номенклатура;
			НоваяСтрокаСодер.Отметка = Истина; 
			//Если ДобавлятьКСуществующим Тогда
			ОтборПоНоменклатуре = Новый Структура("Номенклатура", СтрокаТЧ.Номенклатура);
			СтрокиЛП = ТоварыЛПСозданные.НайтиСтроки(ОтборПоНоменклатуре);
			Если СтрокиЛП.Количество() > 0 Тогда
				НоваяСтрокаСодер.КоличествоВЛП =  СтрокиЛП[0].Количество;
			КонецЕсли;
			//КонецЕсли;
		Иначе 
			
			СообщитьПользователюСервер("Не найдены данные в матрице по " + Строка(ОтборПоНоменклатуре)); 
			Продолжить; 
		КонецЕсли;
		
	КонецЦикла;  
	
	//ОКОНЧАНИЕ 
	
	
	Объект.Коробки.Очистить();
	
	СодержимоеБлочкаКопия = Объект.СодержимоеБлочка.Выгрузить(,"id_Короба"); 
	СодержимоеБлочкаКопия.Свернуть("id_Короба");
	Для каждого СтрокаТЧ Из  СодержимоеБлочкаКопия Цикл
		
		ИдКоробки = СтрокаТЧ.id_Короба; 
		ДобавитьСтрокуВТЧКоробкиНаСервере(ИдКоробки,ТипКороба);  
		ПерезаполнитьРасчПоляТЧКоробки(ИдКоробки);
		
	КонецЦикла;
 
	РассчитатьКоличествоКоробокПоВведеннымДанным();
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросСоздатьЛП(ОтветНаВопрос,ДопПараметры) Экспорт
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда

		ТЗКоробов = ДопПараметры.ТЗКоробов;
		ТЗНераспр = ДопПараметры.ТЗНераспр;
		ДопПараметры = Новый Структура("ТЗКоробов,ТЗНераспр", ТЗКоробов, ТЗНераспр);
		Если ПроверитьСущЛисты() Тогда
			ОповещениеВопрос = Новый ОписаниеОповещения("ПослеОтветаНаВопросПометитьнаУдалениеЛП", ЭтотОбъект,
				ДопПараметры);
			ПоказатьВопрос(ОповещениеВопрос, "Пометить на удаление уже существующие листы переукладки?",
				РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);

		Иначе
			СформироватьЛистыПереукладки(ТЗКоробов, ТЗНераспр);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросПометитьнаУдалениеЛП(ОтветНаВопрос,ДопПараметры) Экспорт
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		ТЗКоробов = ДопПараметры.ТЗКоробов;
		ТЗНераспр = ДопПараметры.ТЗНераспр;
 		ПометитьнаУдалениеСущЛисты();  
 		СформироватьЛистыПереукладки(ТЗКоробов, ТЗНераспр);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПолучитьРеквизитРНК(ИмяПоля)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РасходнаяНакладная.%ИмяПоля% КАК %ИмяПоля%
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ДокСсылка);
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ИмяПоля%",ИмяПоля); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий(); 
	
	Возврат ВыборкаДетальныеЗаписи[ИмяПоля]; 	
	
КонецФункции
&НаСервере
Процедура ПометитьнаУдалениеСущЛисты()
	Запрос  = Новый Запрос;
	Запрос.Текст= "ВЫБРАТЬ
				  |	ЛистПереукладки.Ссылка как ЛП
				  |ИЗ
				  |	Документ.ЛистПереукладки КАК ЛистПереукладки
				  |ГДЕ
				  |	ЛистПереукладки.Проведен
				  |	И ЛистПереукладки.ДокОснование = &ДокОснование";
	Запрос.УстановитьПараметр("ДокОснование", СсылкаПоДокОбъекту());
	Результат = Запрос.Выполнить();
	ВЫборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекЛП=Выборка.ЛП.ПолучитьОбъект();
		ТекЛП.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПроверитьСущЛисты()
	
	Если ПолучитьРеквизитРНК("СостояниеНакладной") = Перечисления.СостоянияНакладной.ГотоваКОтгрузке
		Или ПолучитьРеквизитРНК("СостояниеНакладной") = Перечисления.СостоянияНакладной.Отгружена
		Или ПолучитьРеквизитРНК("СостояниеНакладной") = Перечисления.СостоянияНакладной.ОтгруженаНаТранзитныйСклад Тогда
		СообщитьПользователюСервер("Недопустимое состояние накладной");
		Возврат Ложь; 
	
	КонецЕсли;
	
	Запрос  = новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ЛистПереукладки.Ссылка как ЛП
	|ИЗ
	|	Документ.ЛистПереукладки КАК ЛистПереукладки
	|ГДЕ
	|	ЛистПереукладки.Проведен
	|	И ЛистПереукладки.ДокОснование = &ДокОснование";
	Запрос.УстановитьПараметр("ДокОснование",СсылкаПоДокОбъекту());
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой(); 
КонецФункции
&НаСервере
Функция СформироватьЛистыПереукладки (ТЗКоробовКонтрагента,ТЗЗаводскихКоробов);
	
	Если ПолучитьРеквизитРНК("СостояниеНакладной") = Перечисления.СостоянияНакладной.ГотоваКОтгрузке
		Или ПолучитьРеквизитРНК("СостояниеНакладной") = Перечисления.СостоянияНакладной.Отгружена
		Или ПолучитьРеквизитРНК("СостояниеНакладной") = Перечисления.СостоянияНакладной.ОтгруженаНаТранзитныйСклад Тогда
		СообщитьПользователюСервер("Недопустимое состояние накладной");
		Возврат 0;
	КонецЕсли;
	
	
	Запрос = новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ЗаданиеНабора.Ссылка КАК ЗНБ
	|ИЗ
	|	Документ.ЗаданиеНабора КАК ЗаданиеНабора
	|ГДЕ
	|	ЗаданиеНабора.Дата >= &Дата
	|	И ЗаданиеНабора.Проведен
	|	И ЗаданиеНабора.Накладная = &Накладная";
	запрос.УстановитьПараметр("Дата",Константы.ДатаЗапретаРедактирования.Получить()-30*24*3600);
	запрос.УстановитьПараметр("Накладная",СсылкаПоДокОбъекту());
	
	Результат = запрос.Выполнить().Выбрать();
	пока Результат.Следующий() цикл
		ЗНБОбъект = Результат.ЗНБ.ПолучитьОбъект();
		НужноЗаписывать=ложь;
		СтрТЧ =ЗНБОбъект.ПланируемыеСостояния.Найти(Перечисления.СостоянияНакладной.ОжиданиеПереукладки);
		если СтрТЧ=Неопределено тогда
			если СтрТЧ.Пропустить=Истина тогда
				СтрТЧ.Пропустить=ложь;
				НужноЗаписывать=Истина;
			КонецЕсли;
		КонецЕсли;
		СтрТЧ=ЗНБОбъект.ПланируемыеСостояния.Найти(Перечисления.СостоянияНакладной.Переукладка);
		если СтрТЧ=Неопределено тогда
			если СтрТЧ.Пропустить=Истина тогда
				СтрТЧ.Пропустить=ложь;
				НужноЗаписывать=Истина;
			КонецЕсли;
		КонецЕсли;
		если НужноЗаписывать тогда
			ЗНБОбъект.записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;	
	КонецЦикла;

	
	ОбщийОбъем=0;
	ОбщееКоличествоКоробов=0;	
	СчСост=0;
	для каждого СтрТЗ из ТЗКоробовКонтрагента цикл
		СчСост=СчСост+1;
		
		для сч=1 по СтрТЗ.количествоКоробов цикл		
			если сч=СтрТЗ.количествоКоробов и  СтрТЗ.КоличествоБлочковНеПолногоКороба>0 тогда
				если СтрТЗ.Короб.товары.количество()>1 тогда
					СообщитьПользователюСервер("Некорректный расчёт неполного короба. Обратитесь к Кухарю А.Ю.");
					Продолжить;
				КонецЕсли;
				НовДок=Документы.ЛистПереукладки.СоздатьДокумент();
				НовДок.Автор=ПараметрыСеанса.Пользователь;
				НовДок.КоличествоДокумента=СтрТЗ.КоличествоБлочковНеПолногоКороба;
				НовДок.ТипКороба=СтрТЗ.короб;
				НовДок.ОбъемДокумента=СтрТЗ.короб.ТипКороба.Объем;
				ОбщийОбъем=ОбщийОбъем+СтрТЗ.короб.ТипКороба.Объем;
				ТипШК=Перечисления.ТипыШтрихКодов.Штука;
				ОбщееКоличествоКоробов=ОбщееКоличествоКоробов+1;
				СтрТов=НовДок.Товары.Добавить();
				СтрТов.Номенклатура=СтрТЗ.короб.товары.получить(0).номенклатура;
				СтрТов.Количество=СтрТЗ.КоличествоБлочковНеПолногоКороба;   
				СтрТов.ТипШК = ТипШК;
				НовДок.Дата=ТекущаяДатаСеанса();
				НовДок.ДокОснование=СсылкаПоДокОбъекту();
				НовДок.Записать(РежимЗаписиДокумента.Проведение);
				Продолжить;
			КонецЕсли;
			
			НовДок=Документы.ЛистПереукладки.СоздатьДокумент();
			НовДок.Автор=ПараметрыСеанса.Пользователь;
			НовДок.КоличествоДокумента=СтрТЗ.короб.КоличествоДокумента;
			НовДок.ОбъемДокумента=СтрТЗ.короб.ТипКороба.Объем;
			ОбщийОбъем=ОбщийОбъем+СтрТЗ.короб.ТипКороба.Объем;
			НовДок.ТипКороба=СтрТЗ.короб;			
			ТипШК=Перечисления.ТипыШтрихКодов.Штука;
			ОбщееКоличествоКоробов=ОбщееКоличествоКоробов+1;
			НовДок.Товары.Загрузить(СтрТЗ.короб.товары.выгрузить());
			НовДок.Дата=ТекущаяДатаСеанса();
			НовДок.ДокОснование=СсылкаПоДокОбъекту();
			НовДок.Записать(РежимЗаписиДокумента.Проведение);		
		КонецЦикла;
	КонецЦикла;
	
	СтруктураВозврата=Новый  Структура;
	СтруктураВозврата.Вставить("Объём",ОбщийОбъем);
	СтруктураВозврата.Вставить("КоличествоКоробок",ОбщееКоличествоКоробов);
	ПрописатьНомераКоробокЛП();
	Возврат СтруктураВозврата;
КонецФункции

&НаСервере
процедура ПрописатьНомераКоробокЛП()
	СтруктураРНК = Новый Структура;
	СтруктураРНК.Вставить("ДокОснование",СсылкаПоДокОбъекту());
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛистПереукладки.Ссылка
	|ИЗ
	|	Документ.ЛистПереукладки КАК ЛистПереукладки
	|ГДЕ
	|	ЛистПереукладки.ДокОснование = &ДокОснование
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛистПереукладки.Номер
	|АВТОУПОРЯДОЧИВАНИЕ";
	запрос.УстановитьПараметр("ДокОснование",СсылкаПоДокОбъекту());
	Выборка = Запрос.Выполнить().Выбрать();
	//@skip-check bsl-variable-name-invalid
	Сч = 1;
	
	Пока Выборка.Следующий() Цикл
		ТекЛистПереукладки = Выборка.Ссылка;  
		Если ТекЛистПереукладки.Проведен = Ложь Тогда
			Продолжить;		
		КонецЕсли;
		НаборЗаписей = РегистрыСведений.ИнформацияШКЛП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ШКЛистаПереукладки.Значение = ТекЛистПереукладки.Штрихкод;
		НаборЗаписей.Отбор.ШКЛистаПереукладки.использование = Истина;
		НаборЗаписей.Прочитать();
		СписокШК = Новый Соответствие;
		Для Каждого Запись ИЗ НаборЗаписей Цикл
			СписокШК.Вставить(Запись.НомерКоробкиЛП,Запись.ШК);	 
		КонецЦикла;
		ТекШКЛистаПереукладки = ТекЛистПереукладки.Штрихкод;
		НовыйНаборЗаписей = РегистрыСведений.ИнформацияШКЛП.СоздатьНаборЗаписей();
		НовыйНаборЗаписей.Отбор.ШКЛистаПереукладки.Значение = ТекЛистПереукладки.Штрихкод;
		НовыйНаборЗаписей.Отбор.ШКЛистаПереукладки.использование = Истина;
		НовыйНаборЗаписей.Отбор.ШК.Значение = ТекШКЛистаПереукладки;
		НовыйНаборЗаписей.Отбор.ШК.использование = Истина;
		НовыйНаборЗаписей.Прочитать();
		Для Каждого Запись Из НовыйНаборЗаписей Цикл
			Запись.НомерКоробки = Сч;
			Запись.НомерЛП=ТекЛистПереукладки.номер;
		КонецЦикла;
		Сч = Сч + 1;
		НовыйНаборЗаписей.Записать();
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПечатьКоробовКонтрагентаНаСервере(Естьошибки,ТЗКоробов,ТЗНераспр)
	
	//ОбъектПечати = Объект.ДокОбъект;
    
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
	
	ТабДок	= Новый ТабличныйДокумент;
	ОбработкаОб = РеквизитФормыВЗначение("Объект"); 
	Макет = ОбработкаОб.ПолучитьМакет("Макет");
	
	ОблЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОблЗаголовок.параметры.НомерДокумента = ПолучитьРеквизитРНК("Номер");
	ТабДок.Вывести(ОблЗаголовок);
	ОбщКолКоробов=0;
	ТабДок.Вывести(макет.ПолучитьОбласть("Шапка"));	
	
	ТЗТоварыРНК = ВернутьТоварыРНК();	
	
	ТЗКоробов=Новый ТаблицаЗначений;
	ТЗКоробов.Колонки.Добавить("Короб");
	ТЗКоробов.Колонки.Добавить("КоличествоКоробов");
	ТЗКоробов.Колонки.Добавить("КоличествоБлочковНеПолногоКороба");
	
	
	Запрос = Новый запрос;
	Запрос.Текст= "ВЫБРАТЬ ПЕРВЫЕ 1
				  |	МатрицаКоробовКонтрагента.Ссылка как Матрица
				  |ИЗ
				  |	Документ.МатрицаКоробовКонтрагента КАК МатрицаКоробовКонтрагента
				  |ГДЕ
				  |	МатрицаКоробовКонтрагента.Контрагент = &Контрагент
				  |	И МатрицаКоробовКонтрагента.Дата >= &Дата
				  |
				  |УПОРЯДОЧИТЬ ПО
				  |	МатрицаКоробовКонтрагента.Дата УБЫВ";
	запрос.УстановитьПараметр("Контрагент", ПолучитьРеквизитРНК("Контрагент"));
	запрос.УстановитьПараметр("Дата",ПолучитьРеквизитРНК("Дата"));
	Результат = запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество()=0 тогда
		СообщитьПользователюСервер("Не обнаружена действующей матрицы коробов контрагента по текущей накладной.");
	иначе
		Матрица = результат.Получить(0).Матрица;
		
		Для Каждого СтрКор Из Матрица.КоробаКонтрагентов Цикл
			ТекКороб = СтрКор.Короб;
			//КоличествоКоробов = 0;
			НабралиКороб = Ложь;
			Пока Не НабралиКороб Цикл

				Для Каждого СтрНом Из ТекКороб.Товары Цикл
					ТекСтрока = ТЗТоварыРНК.Найти(СтрНом.Номенклатура);
					Если ТекСтрока = Неопределено Тогда
						НабралиКороб=Истина;
					КонецЕсли;
				КонецЦикла;
				СчВкоробе=0;
				СписокКоличеств  = Новый СписокЗначений;
				КолНеполного=0;
				Для Каждого СтрНом Из ТекКороб.Товары Цикл
					СчВкоробе=СчВкоробе + 1;
					ТекСтрока=ТЗТоварыРНК.Найти(СтрНом.Номенклатура);
					Если ТекСтрока = Неопределено Тогда
						НабралиКороб=Истина;
					Иначе
						Если ТекСтрока.количество >= СтрНом.Количество Тогда
							КолК=Цел(ТекСтрока.количество / СтрНом.Количество);
							ТекСтрока.количество=ТекСтрока.количество - КолК * СтрНом.Количество;

							Если ТекСтрока.количество > 0 Тогда
								ТекКолНеполного=ТекСтрока.количество;
								ТекСтрока.количество=0;
								КолНеполного=КолНеполного + ТекКолНеполного;
							КонецЕсли;
							СписокКоличеств.Добавить(КолК);
						ИначеЕсли СчВкоробе > 1 Тогда
							СообщитьПользователюСервер("Не корректное количество товара в заказе."
								+ СтрНом.Номенклатура.Наименование);
							Естьошибки = Истина; 
							Возврат ТабДок;
						Иначе
							НабралиКороб=Истина;
						КонецЕсли;
						Если НабралиКороб Тогда
							Прервать;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;

				Если СписокКоличеств.Количество() > 0 Тогда
					КолК=СписокКоличеств.Получить(0).Значение;
					Для Каждого СтрСп Из СписокКоличеств Цикл
						Если СтрСп.Значение <> КолК Тогда
							СообщитьПользователюСервер("Не корректное количество товара в коробе."
								+ ТекКороб.Наименование);
							Естьошибки = Истина; 
							Возврат ТабДок;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;

				Если Не НабралиКороб Тогда
					СтрКоробов=ТЗКоробов.Добавить();
					СтрКоробов.Короб=ТекКороб;
					СтрКоробов.количествоКоробов=КолК;
					ОбщКолКоробов=ОбщКолКоробов + КолК;
				КонецЕсли;
				Если КолНеполного > 0 Тогда
					СтрКоробов.количествоКоробов=СтрКоробов.количествоКоробов + 1;
					ОбщКолКоробов=ОбщКолКоробов + 1;
					СтрКоробов.КоличествоБлочковНеПолногоКороба=КолНеполного;
				КонецЕсли;

			КонецЦикла;
		КонецЦикла;

	КонецЕсли;
	
	ТЗНераспр=новый ТаблицаЗначений;
	ТЗНераспр.Колонки.Добавить("Номенклатура");
	ТЗНераспр.Колонки.Добавить("Количество");
	
	для каждого СтрТз из ТЗТоварыРНК Цикл
		если СтрТз.количество>0 тогда
			СтрН=ТЗНераспр.Добавить();
			ЗаполнитьЗначенияСвойств(СтрН,СтрТз);
		КонецЕсли;
	КонецЦикла;
	
	ТЗКоробов.Свернуть("Короб","количествоКоробов,КоличествоБлочковНеПолногоКороба");	
	
	для каждого СтрТз из ТЗКоробов цикл
		Высота=СтрТз.короб.товары.количество();
		для сч=1 по Высота цикл
			ОблСтрока=макет.ПолучитьОбласть("Строка");
			ОблСтрока.Параметры.СоставКороба=СтрТз.короб.товары.получить(сч-1).номенклатура;
			ОблСтрока.Параметры.КоличествоШтук=СтрТз.короб.товары.получить(сч-1).количество;
			ОблСтрока.Параметры.НаименованиеКороба=СтрТз.короб.наименование;
			ОблСтрока.Параметры.КоличествоКоробов=СтрТз.количествоКоробов;
			если СтрТз.КоличествоБлочковНеПолногоКороба=0 тогда
				ОблСтрока.Параметры.Короба=Строка(СтрТз.количествоКоробов)+"*("+Строка(СтрТз.короб.КоличествоДокумента)+" шт.) ";
			иначе
				ОблСтрока.Параметры.Короба=Строка(СтрТз.количествоКоробов-1)+"*("+Строка(СтрТз.короб.КоличествоДокумента)+" шт.) "+Символы.ПС+"1*("+Строка(СтрТз.КоличествоБлочковНеПолногоКороба)+" шт.)";
				
			КонецЕсли;	
			ТабДок.Вывести(ОблСтрока);
		КонецЦикла;
		
		ТекОбл=ТабДок.Область(ТабДок.ВысотаТаблицы-Высота+1,1,ТабДок.ВысотаТаблицы,ТабДок.ШиринаТаблицы);
		ТекОбл.Обвести(линия,линия,линия,линия);
		ТекОбл3=ТабДок.Область(ТабДок.ВысотаТаблицы-Высота+1,3,ТабДок.ВысотаТаблицы,3);
		ТекОбл4=ТабДок.Область(ТабДок.ВысотаТаблицы-Высота+1,4,ТабДок.ВысотаТаблицы,4);
		ТекОбл5=ТабДок.Область(ТабДок.ВысотаТаблицы-Высота+1,5,ТабДок.ВысотаТаблицы,5);
		текобл3.Объединить();
		текобл4.Объединить();
		ТекОбл5.Объединить();
	КонецЦикла;
	
	Для каждого СтрТз из ТЗНераспр цикл
		ОблСтрока=макет.ПолучитьОбласть("Строка");
		ОблСтрока.Параметры.СоставКороба=СтрТз.номенклатура;
		ОблСтрока.Параметры.КоличествоШтук=СтрТз.номенклатура.родитель.ШтукВКоробке;
		ОблСтрока.Параметры.НаименованиеКороба="Заводской короб "+СтрТз.номенклатура.наименование;
		ОблСтрока.Параметры.КоличествоКоробов=СтрТз.количество/СтрТз.номенклатура.родитель.ШтукВКоробке;
		ТабДок.Вывести(ОблСтрока);
		ОбщКолКоробов=ОбщКолКоробов+ОблСтрока.Параметры.КоличествоКоробов;
	КонецЦикла;
	ОблИтоги=Макет.ПолучитьОбласть("Итоги");
	ОблИтоги.Параметры.КоличествоКоробов=ОбщКолКоробов;
	ТабДок.Вывести(ОблИтоги);
	
	//ТабДок.Показать();
	
	
	запрос=новый Запрос;
	запрос.Текст="ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛистПереукладки.Ссылка) КАК КоличествоКоробок,
	|	СУММА(ЛистПереукладки.ОбъемДокумента) КАК ОбъемДокумента
	|ИЗ
	|	Документ.ЛистПереукладки КАК ЛистПереукладки
	|ГДЕ
	|	ЛистПереукладки.Проведен
	|	И ЛистПереукладки.ДокОснование = &ДокОснование";
	запрос.УстановитьПараметр("ДокОснование",СсылкаПоДокОбъекту());
	результат=запрос.Выполнить().Выгрузить();
	
	ДокОбъектРНК = Объект.ДокСсылка.ПолучитьОбъект();
	ДокОбъектРНК.КоличествоКоробок = результат.Получить(0).КоличествоКоробок;
	ДокОбъектРНК.ОбъемКоробов =  результат.Получить(0).ОбъемДокумента;
	ДокОбъектРНК.Записать();	
	
	Возврат ТабДок; 
КонецФункции

&НаСервере
Функция ВернутьТоварыРНК()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
		|ГДЕ
		|	РасходнаяНакладнаяТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаПоДокОбъекту());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();	
	 
КонецФункции

&НаСервере
Функция ВернутьКомплектующиеРНК()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяТовары
		|ГДЕ
		|	РасходнаяНакладнаяТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаПоДокОбъекту());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();	
	 
КонецФункции

&НаСервере
Процедура ПересчитатьОбъемКоробокНаСервере()
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст= "ВЫБРАТЬ
					  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛистПереукладки.Ссылка) КАК КоличествоКоробок,
					  |	СУММА(ЛистПереукладки.ОбъемДокумента) КАК ОбъемДокумента,
					  |	СУММА(ЛистПереукладки.ТипКороба.Объем) КАК ТипКоробаОбъем
					  |ИЗ
					  |	Документ.ЛистПереукладки КАК ЛистПереукладки
					  |ГДЕ
					  |	ЛистПереукладки.Проведен
					  |	И ЛистПереукладки.ДокОснование = &ДокОснование";
		Запрос.УстановитьПараметр("ДокОснование", СсылкаПоДокОбъекту());
		Результат = запрос.Выполнить().Выгрузить();
		ДокОбъектРНК = Объект.ДокСсылка.ПолучитьОбъект(); 
		ДокОбъектРНК.КоличествоКоробок=результат.Получить(0).КоличествоКоробок;
		ДокОбъектРНК.ОбъемКоробов=результат.Получить(0).ТипКоробаОбъем;
		ДокОбъектРНК.Записать();

		ЗаписатьКоличествоИОбъемКоробовВРегистр(СсылкаПоДокОбъекту(), результат.Получить(0).КоличествоКоробок,
			результат.Получить(0).ТипКоробаОбъем);
	Исключение
		СообщитьПользователюСервер("нет листов переукладки");
	КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура СоздатьЛистыПоБлочкамНаСервере()
	Если Не ПоБлочкам Тогда

		Возврат;

	КонецЕсли;

	Если Не СверитьКоличествоЗаполненноеСРНК() Тогда

		Возврат;

	КонецЕсли; 
	/////////с действ. алгоритма 
	ТекЗначениеКонстанты	=	Константы.ЗапускПереукладки.Получить();
	ТекПользователь			= 	ТекущийПользователь();
	Если ТекЗначениеКонстанты = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
		Константы.ЗапускПереукладки.Установить(ТекПользователь);
	ИначеЕсли ТекЗначениеКонстанты = ТекПользователь Тогда //Ничего не делаем

	Иначе
		СообщитьПользователюСервер("В данный момент переукладка запущена у " + ТекЗначениеКонстанты
			+ " дождитесь окончания.");
		ЗаписатьВЛог("ОчередьОбработки", "Попытка начать переукладку. Пытался " + ТекПользователь + " ,помещал "
			+ ТекЗначениеКонстанты, "Информация");
		Возврат;
	КонецЕсли;

	ТекЗначениеКонстанты	=	Константы.ЗапускПереукладки.Получить(); //На всякий проверим, что константа установилась
	Если ТекЗначениеКонстанты = ТекПользователь Тогда
	Иначе
		СообщитьПользователюСервер("Не удалось начать переукладку. Попробуйте ещё раз.");
		ЗаписатьВЛог("ОчередьОбработки", "Не удалось записать константу ЗапускПереукладки - " + ТекПользователь,
			"Информация");
		Возврат;
	КонецЕсли;
	
	//++Данилова Е.В. 12.05.2026 SNL-201
	Если Не ДобавлятьКСуществующим Тогда

		Запрос = Новый Запрос;
		запрос.Текст =
		"ВЫБРАТЬ
		|	ЛистПереукладки.Ссылка как ЛП
		|ИЗ
		|	Документ.ЛистПереукладки КАК ЛистПереукладки
		|ГДЕ
		|	ЛистПереукладки.Проведен
		|	И ЛистПереукладки.ДокОснование = &ДокОснование";
		Запрос.УстановитьПараметр("ДокОснование", СсылкаПоДокОбъекту());
		Результат	=	запрос.Выполнить().Выгрузить();

		Если Результат.Количество() > 0 Тогда

			Для Каждого СтрРез Из Результат Цикл
				ТекЛП = СтрРез.ЛП.ПолучитьОбъект();
				ТекЛП.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	//--Данилова Е.В. 12.05.2026 
	
	Если Объект.СоздаватьЗНА 
		//++Данилова Е.В. 12.05.2026 SNL-201
		И НЕ ДобавлятьКСуществующим тогда
		//--Данилова Е.В. 12.05.2026 
		 РезультатВыполнения = документы.ЗаданиеНаАгрегацию.РаспровестиЗНАПоНакладной(СсылкаПоДокОбъекту(),Истина);     
		 если не РезультатВыполнения.Успех тогда
			 СообщитьПользователюСервер(СтрСоединить(РезультатВыполнения.Ошибки,символы.ПС));
			 возврат;         
		 КонецЕсли;   	
	 КонецЕсли;
	///////////////////////////////
	 
	Если Объект.СоздаватьЗНА Тогда
		
		Для каждого СтрокаКоробок Из Объект.Коробки Цикл
			//ТипКоробаЗНА = СтрокаКоробок.ТипКороба; 
			КоличествоЛистовПереупаковки = СтрокаКоробок.Количество; 
			
			МенеджерВременныхТаблиц = Неопределено;
			//сразу комплектующие			
			
			//@skip-check query-in-loop
			ТЗТовары = ВыгрузитьТЧтоварыПоИдКоробки(СтрокаКоробок.id_Короба,МенеджерВременныхТаблиц);			
			
			//@skip-check query-in-loop
			СодержимоеБлочкаДляЗНА = ВыгрузитьСодержимоеБлочкаДляЗНА(СтрокаКоробок.id_Короба,МенеджерВременныхТаблиц); 
			
			//@skip-check query-in-loop
			БлочкиВсегоДляЗНА = ВыгрузитьСодержимоеВсегоБлочкиДляЗНА(СтрокаКоробок.id_Короба,МенеджерВременныхТаблиц); 
			
			

			СтруктураЗаполненияШапкиЗНА = новый Структура("ТипКороба,Товары,КоличествоКоробок,СодержимоеБлочка,БлочкиВсего,НеРазворачиватьКП"); 
			
			СтруктураЗаполненияШапкиЗНА.ТипКороба = СтрокаКоробок.ТипКороба;
			СтруктураЗаполненияШапкиЗНА.Товары = ТЗТовары;
			СтруктураЗаполненияШапкиЗНА.КоличествоКоробок = КоличествоЛистовПереупаковки;
			СтруктураЗаполненияШапкиЗНА.СодержимоеБлочка = СодержимоеБлочкаДляЗНА; 
			СтруктураЗаполненияШапкиЗНА.БлочкиВсего = БлочкиВсегоДляЗНА;
			СтруктураЗаполненияШапкиЗНА.НеРазворачиватьКП = истина; 			
						
			РезультатПолучения = Документы.ЗаданиеНаАгрегацию.НайтиСоздатьЗНАПоНакладнойИСтруктуреПараметров(СсылкаПоДокОбъекту(),СтруктураЗаполненияШапкиЗНА);
			если РезультатПолучения.Успех тогда
				ЗНА = РезультатПолучения.Данные;
				
				РезультатСоздания = Документы.ЗаданиеНаАгрегацию.ЗаполнитьЛистыПереукладкиПоЗНА(ЗНА,ДобавлятьКСуществующим); 
				
				если не РезультатСоздания.Успех тогда
					
					СообщитьПользователюСервер(СтрСоединить(РезультатСоздания.Ошибки,символы.ПС)); 					
					СообщитьПользователюСервер("Не удалось создать заполнить листы переукладки по ЗНА. Попробуйте ещё раз");  
					
				иначе 
					//Данилова Е.В. 12.05.2026 SNL-201
					//Документы.ЛистПереукладки.ПереномероватьВсеКоробкиНакладной(СсылкаПоДокОбъекту());
					СообщитьПользователюСервер("Создан документ "+ЗНА);
				КонецЕсли;         
			иначе
				СообщитьПользователюСервер(СтрСоединить(РезультатПолучения.Ошибки,символы.ПС));
			КонецЕсли;  
		КонецЦикла; 
	
	Иначе 
		Для каждого СтрокаКоробок Из Объект.Коробки Цикл 
			
			КоличествоЛистовПереупаковки = СтрокаКоробок.Количество; 
			
			для сч = 1 по КоличествоЛистовПереупаковки цикл
				НовДок	=	Документы.ЛистПереукладки.СоздатьДокумент();
				НовДок.Автор	=	ПараметрыСеанса.Пользователь;
				НовДок.КоличествоДокумента	=	0;
				НовДок.ТипКороба			=	СтрокаКоробок.ТипКороба;
				если СтрокаКоробок.ТипКороба	<>	Справочники.ТипыКоробов.НайтиПоКоду("0000000001") тогда 
					НовДок.ОбъемДокумента	=	СтрокаКоробок.ТипКороба.Объем;
				иначе
					НовДок.ОбъемДокумента =	Объем;
				КонецЕсли;
				
				//ТипШК			=	Перечисления.ТипыШтрихКодов.Штука;
				НовДок.Дата		=	ТекущаяДатаСеанса();
				НовДок.ДокОснование	=	СсылкаПоДокОбъекту();
				
				МенеджерВременныхТаблиц = Неопределено;
				//сразу комплектующие			
				//@skip-check query-in-loop
				ТЗТовары = ВыгрузитьТЧтоварыПоИдКоробки(СтрокаКоробок.id_Короба,МенеджерВременныхТаблиц);
				//@skip-check query-in-loop
				СодержимоеБлочкаДляЛП 	= ВыгрузитьСодержимоеБлочкаДляЗНА(СтрокаКоробок.id_Короба,МенеджерВременныхТаблиц); 
				//@skip-check query-in-loop
				БлочкиВсегоДляЛП 		= ВыгрузитьСодержимоеВсегоБлочкиДляЗНА(СтрокаКоробок.id_Короба,МенеджерВременныхТаблиц);
				
				для каждого СтрТЗ из ТЗТовары цикл
					
					СтрТЧ	=	НовДок.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(СтрТЧ,СтрТЗ); 
					СтрТЧ.ТипШК = Перечисления.ТипыШтрихКодов.Штука;
				КонецЦикла;
				НовДок.СодержимоеБлочка.Загрузить(СодержимоеБлочкаДляЛП);
				НовДок.БлочкиВсего.Загрузить(БлочкиВсегоДляЛП);
				
				НовДок.Записать(РежимЗаписиДокумента.Проведение);
				
				СообщитьПользователюСервер("Создан документ "+НовДок.Ссылка);
			КонецЦикла;
			
			
			
		КонецЦикла;
		
		запрос	=	Новый Запрос;
		запрос.Текст	= "ВЫБРАТЬ
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛистПереукладки.Ссылка) КАК КоличествоКоробок,
						  |	СУММА(ЛистПереукладки.ОбъемДокумента) КАК ОбъемДокумента
						  |ИЗ
						  |	Документ.ЛистПереукладки КАК ЛистПереукладки
						  |ГДЕ
						  |	ЛистПереукладки.Проведен
						  |	И ЛистПереукладки.ДокОснование = &ДокОснование";
		запрос.УстановитьПараметр("ДокОснование", СсылкаПоДокОбъекту());
		результат	=	запрос.Выполнить().Выгрузить();
		ДокОбъектРНК  = Объект.Докссылка.ПолучитьОбъект(); 
		ДокОбъектРНК.КоличествоКоробок	=	результат.Получить(0).КоличествоКоробок;
		ДокОбъектРНК.ОбъемКоробов		=	результат.Получить(0).ОбъемДокумента;
		ДокОбъектРНК.Записать();
		
		ЗаписатьКоличествоИОбъемКоробовВРегистр(СсылкаПоДокОбъекту(), результат.Получить(0).КоличествоКоробок,
			результат.Получить(0).ОбъемДокумента);	
		
	
	КонецЕсли;
	
	Для каждого СтрокаТЧ Из Объект.СодержимоеБлочка Цикл
		
			//@skip-check query-in-loop
			ЗаполнитьДопПоляПоНоменклатуре(СтрокаТЧ);
		
		КонецЦикла;
	
	Константы.ЗапускПереукладки.Установить(Справочники.ФизическиеЛица.ПустаяСсылка());

КонецПроцедуры

&НаСервере
Функция ВыгрузитьСодержимоеВсегоБлочкиДляЗНА(ИдКоробки, МенеджерВременныхТаблиц)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц; 
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТВсегоБлочков.id_Блочка КАК id_Блочка,
	|	ВТВсегоБлочков.Количество КАК Количество
	|ИЗ
	|	ВТВсегоБлочков КАК ВТВсегоБлочков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтСодержимое КАК ВтСодержимое
	|		ПО ВТВсегоБлочков.id_Блочка = ВтСодержимое.id_Блочка
	|			И (ВтСодержимое.id_Короба = &id_Короба)";
	
	
	Запрос.УстановитьПараметр("id_Короба", ИдКоробки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	


КонецФункции // ВыгрузитьСодержимоеБлочка()



&НаСервере
Функция ВыгрузитьСодержимоеБлочкаДляЗНА(ИдКоробки, МенеджерВременныхТаблиц)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц; 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВтСодержимое.id_Блочка КАК id_Блочка,
	|	ВтСодержимое.Номенклатура КАК Номенклатура,
	|	СУММА(ВтСодержимое.Количество) КАК Количество
	|ИЗ
	|	ВтСодержимое КАК ВтСодержимое
	|ГДЕ
	|	ВтСодержимое.id_Короба = &id_Короба
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтСодержимое.id_Блочка,
	|	ВтСодержимое.Номенклатура";
	
	
	Запрос.УстановитьПараметр("id_Короба", ИдКоробки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	


КонецФункции 

&НаСервере
Функция ВыгрузитьТЧтоварыПоИдКоробки(ИдКоробки, МенеджерВременныхТаблиц)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВтСодержимое.id_Блочка КАК id_Блочка,
		|	ВтСодержимое.Номенклатура КАК Номенклатура,
		|	ВтСодержимое.Количество КАК Количество,
		|	ВтСодержимое.id_Короба КАК id_Короба
		|ПОМЕСТИТЬ ВтСодержимое
		|ИЗ
		|	&СодержимоеБлочка КАК ВтСодержимое
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТВсегоБлочков.id_Блочка КАК id_Блочка,
		|	ВТВсегоБлочков.Количество КАК Количество
		|ПОМЕСТИТЬ ВТВсегоБлочков
		|ИЗ
		|	&ВсегоБлочков КАК ВТВсегоБлочков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтСодержимое.Номенклатура КАК Номенклатура,
		|	СУММА(ВтСодержимое.Количество * ВТВсегоБлочков.Количество) КАК Количество
		|ИЗ
		|	ВТВсегоБлочков КАК ВТВсегоБлочков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтСодержимое КАК ВтСодержимое
		|		ПО ВТВсегоБлочков.id_Блочка = ВтСодержимое.id_Блочка
		|			И (ВтСодержимое.id_Короба = &id_Короба)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВтСодержимое.Номенклатура";
	
	Запрос.УстановитьПараметр("СодержимоеБлочка",Объект.СодержимоеБлочка.Выгрузить());
	Запрос.УстановитьПараметр("ВсегоБлочков",Объект.ВсегоБлочков.Выгрузить());
	Запрос.УстановитьПараметр("id_Короба", ИдКоробки);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	МенеджерВременныхТаблиц = запрос.МенеджерВременныхТаблиц; 
	
	Возврат РезультатЗапроса.Выгрузить(); 	


КонецФункции // ВыгрузитьТЧтоварыПоИдКоробки() 


&НаКлиенте
Процедура КонтрольРаспределенияТоваровРНКНаКлиенте()
	Если СверитьКоличествоЗаполненноеСРНК() Тогда
		 
		 ПоказатьПредупреждение(,"Количество распределенное по блочкам и коробкам соответствует количеству в РНК");   	
	 Иначе 
		 ПоказатьПредупреждение(,"Количество распределенное по блочкам и коробкам НЕ соответствует количеству в РНК!!!");
	 КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СверитьКоличествоЗаполненноеСРНК()
	// Кухарь А.Ю.  08.04.2026 начало
	если НеСверятьКоличество тогда
		Возврат Истина;
	КонецЕсли;
	// Кухарь А.Ю.  08.04.2026 конец
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВтСодержимое.id_Блочка КАК id_Блочка,
		|	ВтСодержимое.Номенклатура КАК Номенклатура,
		|	ВтСодержимое.Количество КАК Количество,
		|	ВтСодержимое.id_Короба КАК id_Короба
		|ПОМЕСТИТЬ ВтСодержимое
		|ИЗ
		|	&СодержимоеБлочка КАК ВтСодержимое
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТВсегоБлочков.id_Блочка КАК id_Блочка,
		|	ВТВсегоБлочков.Количество КАК Количество
		|ПОМЕСТИТЬ ВТВсегоБлочков
		|ИЗ
		|	&ВсегоБлочков КАК ВТВсегоБлочков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтКоробки.id_Короба КАК id_Короба,
		|	ВтКоробки.Количество КАК Количество
		|ПОМЕСТИТЬ ВтКоробки
		|ИЗ
		|	&Коробки КАК ВтКоробки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтСодержимое.Номенклатура КАК Номенклатура,
		|	СУММА(ВтСодержимое.Количество * ВТВсегоБлочков.Количество * ВтКоробки.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТВПравилах
		|ИЗ
		|	ВТВсегоБлочков КАК ВТВсегоБлочков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтСодержимое КАК ВтСодержимое
		|		ПО ВТВсегоБлочков.id_Блочка = ВтСодержимое.id_Блочка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтКоробки КАК ВтКоробки
		|		ПО (ВтКоробки.id_Короба = ВтСодержимое.id_Короба)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВтСодержимое.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
		|	СУММА(РасходнаяНакладнаяТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ ВтТовары
		|ИЗ
		|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
		|ГДЕ
		|	РасходнаяНакладнаяТовары.Ссылка = &ДокОснование
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасходнаяНакладнаяКомплектующие.Номенклатура КАК Номенклатура,
		|	СУММА(РасходнаяНакладнаяКомплектующие.Количество) КАК Количество
		|ПОМЕСТИТЬ ВтКомплектующие
		|ИЗ
		|	Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
		|ГДЕ
		|	РасходнаяНакладнаяКомплектующие.Ссылка = &ДокОснование
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяКомплектующие.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтТовары.Номенклатура КАК Номенклатура,
		|	ВтТовары.Количество КАК Количество
		|ПОМЕСТИТЬ ВтТоварыРНК
		|ИЗ
		|	ВтТовары КАК ВтТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтКомплектующие КАК ВтКомплектующие
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВтКомплектующие.Номенклатура ЕСТЬ NULL
		|	И ВтТовары.Количество > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВтКомплектующие.Номенклатура,
		|	ВтКомплектующие.Количество
		|ИЗ
		|	ВтКомплектующие КАК ВтКомплектующие
		|ГДЕ
		|	ВтКомплектующие.Количество > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтТоварыРНК.Номенклатура КАК Номенклатура,
		|	ВтТоварыРНК.Количество КАК Количество,
		|	ЕСТЬNULL(ВТВПравилах.Количество, 0) КАК КоличествоВПравилахЗаполнения
		|ИЗ
		|	ВтТоварыРНК КАК ВтТоварыРНК
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВПравилах КАК ВТВПравилах
		|		ПО ВтТоварыРНК.Номенклатура = ВТВПравилах.Номенклатура
		|ГДЕ
		|	ВтТоварыРНК.Количество <> ЕСТЬNULL(ВТВПравилах.Количество, 0)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТВПравилах.Номенклатура,
		|	0,
		|	ВТВПравилах.Количество
		|ИЗ
		|	ВТВПравилах КАК ВТВПравилах
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыРНК КАК ВтТоварыРНК
		|		ПО ВТВПравилах.Номенклатура = ВтТоварыРНК.Номенклатура
		|ГДЕ
		|	ВтТоварыРНК.Номенклатура ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ДокОснование",СсылкаПоДокОбъекту());
	Запрос.УстановитьПараметр("СодержимоеБлочка",Объект.СодержимоеБлочка.Выгрузить()); 
	Запрос.УстановитьПараметр("ВсегоБлочков",Объект.ВсегоБлочков.Выгрузить());
	Запрос.УстановитьПараметр("Коробки",Объект.Коробки.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
	
		Возврат Истина;
	Иначе 
		
		Выборка = Запрос.Выполнить().Выбрать(); 
		
		Пока Выборка.Следующий() Цикл
		
			
			Текстошибки = СтрШаблон("Несоответствие по номенклатуре %1, количество в РНК %2, количество указанное %3",Выборка.Номенклатура,Выборка.Количество,Выборка.КоличествоВПравилахЗаполнения); 	
		    СообщитьПользователюСервер(Текстошибки); 
			
		КонецЦикла;
		
		Возврат Ложь; 
	
	КонецЕсли;


КонецФункции


&НаСервере
Процедура РассчитатьКоличествоКоробокНаСервере()
	РассчитатьКоличествоКоробокПоВведеннымДанным(); 
КонецПроцедуры

&НаСервере
Процедура РассчитатьКоличествоКоробокПоВведеннымДанным()
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВтСодержимое.id_Блочка КАК id_Блочка,
		|	ВтСодержимое.Номенклатура КАК Номенклатура,
		|	ВтСодержимое.Количество КАК Количество,
		|	ВтСодержимое.id_Короба КАК id_Короба
		|ПОМЕСТИТЬ ВтСодержимое
		|ИЗ
		|	&СодержимоеБлочка КАК ВтСодержимое
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТВсегоБлочков.id_Блочка КАК id_Блочка,
		|	ВТВсегоБлочков.Количество КАК Количество
		|ПОМЕСТИТЬ ВТВсегоБлочков
		|ИЗ
		|	&ВсегоБлочков КАК ВТВсегоБлочков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтСодержимое.Номенклатура КАК Номенклатура,
		|	СУММА(ВтСодержимое.Количество * ВТВсегоБлочков.Количество) КАК Количество,
		|	ВтСодержимое.id_Короба КАК id_Короба
		|ПОМЕСТИТЬ ВТВПравилах
		|ИЗ
		|	ВТВсегоБлочков КАК ВТВсегоБлочков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтСодержимое КАК ВтСодержимое
		|		ПО ВТВсегоБлочков.id_Блочка = ВтСодержимое.id_Блочка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВтСодержимое.Номенклатура,
		|	ВтСодержимое.id_Короба//,
		//|	ВтСодержимое.id_Блочка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
		|	СУММА(РасходнаяНакладнаяТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ ВтТовары
		|ИЗ
		|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
		|ГДЕ
		|	РасходнаяНакладнаяТовары.Ссылка = &ДокОснование
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасходнаяНакладнаяКомплектующие.Номенклатура КАК Номенклатура,
		|	СУММА(РасходнаяНакладнаяКомплектующие.Количество) КАК Количество
		|ПОМЕСТИТЬ ВтКомплектующие
		|ИЗ
		|	Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
		|ГДЕ
		|	РасходнаяНакладнаяКомплектующие.Ссылка = &ДокОснование
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяКомплектующие.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтТовары.Номенклатура КАК Номенклатура,
		|	ВтТовары.Количество КАК Количество
		|ПОМЕСТИТЬ ВтТоварыРНК
		|ИЗ
		|	ВтТовары КАК ВтТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтКомплектующие КАК ВтКомплектующие
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВтКомплектующие.Номенклатура ЕСТЬ NULL
		|	И ВтТовары.Количество > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВтКомплектующие.Номенклатура,
		|	ВтКомплектующие.Количество
		|ИЗ
		|	ВтКомплектующие КАК ВтКомплектующие
		|ГДЕ
		|	ВтКомплектующие.Количество > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтТоварыРНК.Номенклатура КАК Номенклатура,
		|	ВтТоварыРНК.Количество КАК Количество
		|ИЗ
		|	ВтТоварыРНК КАК ВтТоварыРНК
		|ИТОГИ
		|	СУММА(Количество)
		|ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТВПравилах.Номенклатура КАК Номенклатура,
		|	ВТВПравилах.Количество КАК Количество,
		|	ВТВПравилах.id_Короба КАК id_Короба
		|ИЗ
		|	ВТВПравилах КАК ВТВПравилах
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура,
		|	id_Короба";
	
	Запрос.УстановитьПараметр("СодержимоеБлочка",Объект.СодержимоеБлочка.Выгрузить());
	Запрос.УстановитьПараметр("ВсегоБлочков",Объект.ВсегоБлочков.Выгрузить());

	Запрос.УстановитьПараметр("ДокОснование", СсылкаПоДокОбъекту());
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	ВыборкаТоварыИтоги = ПакетЗапросов[6].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	
	ТаблицаТоваровВПравилах = ПакетЗапросов[7].Выгрузить();
	
	ТаблицаТоваровВПравилахСвернутая = ТаблицаТоваровВПравилах.скопировать(); 
	
	ТаблицаТоваровВПравилахСвернутая.Свернуть("id_Короба","Количество"); 
	//ТаблицаТоваровВПравилахСвернутая.колонки.Добавить("КоличествоКоробок",Новый ОписаниеТипов("Число")); 
	ТаблицаТоваровВПравилахСвернутая.колонки.Добавить("КоличествоПроставленное",Новый ОписаниеТипов("Число"));
		 
	Пока ВыборкаТоварыИтоги.Следующий() Цикл
		
		КоличествоНеобходимое = ВыборкаТоварыИтоги.Количество;
		
		Пока КоличествоНеобходимое > 0  Цикл		
			
			ОтборПоТаблице = Новый Структура("Номенклатура",ВыборкаТоварыИтоги.Номенклатура); 
			СтрокиТЧ = ТаблицаТоваровВПравилах.НайтиСтроки(ОтборПоТаблице);  		
			КоличествоВСтрокеПравил = 0;  
			Для каждого СтрокаТЧ Из СтрокиТЧ Цикл 
				
				КоличествоВСтрокеПравил = СтрокаТЧ.Количество; 
				Если КоличествоНеобходимое = 0 Тогда 
					
					Прервать; 	
					
				КонецЕсли;
				
				Если КоличествоНеобходимое < СтрокаТЧ.Количество Тогда
					
					Продолжить; 	
					
				КонецЕсли;
				
				ОтборПоКоробам = Новый Структура("id_Короба",СтрокаТЧ.id_Короба);
				СтрокиПоКоробам =  ТаблицаТоваровВПравилахСвернутая.НайтиСтроки(ОтборПоКоробам);//должна быть одна
				Для каждого СтрокаПоКоробам Из СтрокиПоКоробам Цикл
					
					СтрокаПоКоробам.КоличествоПроставленное =  СтрокаПоКоробам.КоличествоПроставленное + СтрокаТЧ.Количество; 
					
				КонецЦикла;
				
				КоличествоНеобходимое = КоличествоНеобходимое - СтрокаТЧ.Количество;  
				
			КонецЦикла; 
			
			Если КоличествоНеобходимое < КоличествоВСтрокеПравил 
				ИЛИ КоличествоВСтрокеПравил = 0 Тогда
				КоличествоНеобходимое = 0; 
			Конецесли; 
		КонецЦикла;
	КонецЦикла;
		 
	
	Для каждого  СтрокаТЧ Из ТаблицаТоваровВПравилахСвернутая Цикл
	      Отбор = Новый Структура("id_Короба",СтрокаТЧ.id_Короба); 
		  СтрокаКороба = Объект.Коробки.НайтиСтроки(Отбор);
		  Если СтрокаКороба.Количество() > 0  Тогда
			  
			  СтрокаКороба[0].Количество = Цел(СтрокаТЧ.КоличествоПроставленное/СтрокаТЧ.Количество); //               ; СтрокаТЧ.КоличествоКоробок; 	
			  
		  КонецЕсли;
	
	КонецЦикла;
	 
 КонецПроцедуры


&НаСервере
Процедура ОбновитьБлочкиНаСервере()
	
	//Объект.ВсегоБлочков.Очистить();
	Для каждого СтрокаТовара Из  Объект.СодержимоеБлочка Цикл
	
		РассчитатьВсегоБлочков(СтрокаТовара,истина,ложь);	
	
	КонецЦикла;
	
	МассивidБлочков = Объект.СодержимоеБлочка.Выгрузить().ВыгрузитьКолонку("id_Блочка"); 
	МассивidБлочковВсего = Объект.ВсегоБлочков.Выгрузить().ВыгрузитьКолонку("id_Блочка"); 
	Для Каждого ЭлМассива Из МассивidБлочковВсего Цикл
		НайдЭлМассива = МассивidБлочков.Найти(ЭлМассива); 
		Если НайдЭлМассива = Неопределено Тогда
			Отбор = Новый Структура("id_Блочка", ЭлМассива);
			СтрокиПоБлочку = Объект.ВсегоБлочков.НайтиСтроки(Отбор);
			Для Каждого СтрокаПоБлочку Из СтрокиПоБлочку Цикл
				Объект.ВсегоБлочков.Удалить(СтрокаПоБлочку);
			КонецЦикла; 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПоКоробамНаКлиенте()
	Перем ТипКоробаВыбранный;  
	Если ВвестиЗначение(ТипКоробаВыбранный,"Выберите тип короба",Тип("СправочникСсылка.ТипыКоробов")) Тогда
		
	ИначеЕсли ЗначениеЗаполнено(ТипКороба) Тогда 
		ТипКоробаВыбранный = ТипКороба;
	Иначе 
		ПоказатьПредупреждение(,"Необходимо выбрать тип короба"); 
		Возврат; 
	КонецЕсли;
	
	ЗаполнитьТЧКоробки(ТипКоробаВыбранный);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧКоробки(Знач ТипКоробаВыбранный) 	
	
	СверитьСтрокиВсегоБлочки(); 
	
	ТекстОшибки = ""; 
	МассивНеЗаполБлочков = Новый Массив; 
	Для каждого ВыделеннаяСтрока Из Элементы.СодержимоеБлочка.ВыделенныеСтроки Цикл
		ДанныеСтроки = Объект.СодержимоеБлочка.НайтиПоИдентификатору(ВыделеннаяСтрока); 
		Отбор = Новый Структура("id_Блочка",ДанныеСтроки.id_Блочка); 
		СтрокаВсегоБлочков = Объект.ВсегоБлочков.НайтиСтроки(Отбор);
		Если СтрокаВсегоБлочков.Количество() > 0 
			И НЕ ЗначениеЗаполнено(СтрокаВсегоБлочков[0].Количество) Тогда
			
			Если МассивНеЗаполБлочков.Найти(ДанныеСтроки.id_Блочка) = Неопределено Тогда
				МассивНеЗаполБлочков.Добавить(ДанныеСтроки.id_Блочка); 
			КонецЕсли; 		  
			
		КонецЕсли; 	
	КонецЦикла;
	
	Если МассивНеЗаполБлочков.Количество() > 0  Тогда
		
		ТекстОшибки = "Не заполнено всего количество блочков по:"  + СтрСоединить(МассивНеЗаполБлочков,",");	
		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		
		СообщитьПользователюСервер(ТекстОшибки);
		Возврат; 
		
	КонецЕсли; 
	
	Объект.Коробки.Очистить();
	
	СодержимоеБлочкаКопия = Объект.СодержимоеБлочка.Выгрузить(,"id_Короба"); 
	СодержимоеБлочкаКопия.Свернуть("id_Короба");
	Для каждого СтрокаТЧ Из  СодержимоеБлочкаКопия Цикл
		
		ИдКоробки = СтрокаТЧ.id_Короба; 
		ДобавитьСтрокуВТЧКоробкиНаСервере(ИдКоробки,ТипКоробаВыбранный);  
		ПерезаполнитьРасчПоляТЧКоробки(ИдКоробки);
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура СверитьСтрокиВсегоБлочки()

	СодержимоеБлочкаКопия =  Объект.СодержимоеБлочка.Выгрузить(,"id_Блочка"); 
    СодержимоеБлочкаКопия.Свернуть("id_Блочка");
	
	Для каждого СтрокаТЧ Из СодержимоеБлочкаКопия Цикл
		Отбор = Новый Структура("id_Блочка",СтрокаТЧ.id_Блочка);
		СтрокаВсегоБлочков = Объект.ВсегоБлочков.НайтиСтроки(Отбор);
		Если СтрокаВсегоБлочков.Количество() = 0 Тогда
			
			НоваяСтрока = Объект.ВсегоБлочков.Добавить(); 
			НоваяСтрока.id_Блочка = СтрокаТЧ.id_Блочка;	
			
		КонецЕсли;
		
	КонецЦикла;
	 
	УдалитьСтроки = новый Массив;  
	Для каждого СтрокаТЧ Из  Объект.ВсегоБлочков Цикл
		
		СтрокаБлочков = СодержимоеБлочкаКопия.Найти(СтрокаТЧ.id_Блочка,"id_Блочка"); 
		
		Если СтрокаБлочков = неопределено Тогда
			
			УдалитьСтроки.Добавить(СтрокаТЧ); 
			
		КонецЕсли;
		
	КонецЦикла;
	Для каждого СтрокаУд Из УдалитьСтроки Цикл
		
		
		Объект.ВсегоБлочков.Удалить(СтрокаУд); 
		
	КонецЦикла;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОпределитьВыделенныеВКоробкуНаКлиенте()
	
	Перем ТипКоробаВыбранный; 
	 
	Если ВвестиЗначение(ТипКоробаВыбранный,"Выберите тип короба",Тип("СправочникСсылка.ТипыКоробов")) Тогда
		
	ИначеЕсли ЗначениеЗаполнено(ТипКороба) Тогда 
		ТипКоробаВыбранный = ТипКороба;
	Иначе 
		ПоказатьПредупреждение(,"Необходимо выбрать тип короба"); 
		Возврат; 
	КонецЕсли;
	
	ТекстОшибки = ""; 
	МассивНеЗаполБлочков = Новый Массив; 
	Для каждого ВыделеннаяСтрока Из Элементы.СодержимоеБлочка.ВыделенныеСтроки Цикл
		ДанныеСтроки = Объект.СодержимоеБлочка.НайтиПоИдентификатору(ВыделеннаяСтрока);
		Отбор = Новый Структура("id_Блочка",ДанныеСтроки.id_Блочка); 
		СтрокаВсегоБлочков = Объект.ВсегоБлочков.НайтиСтроки(Отбор);
		Если СтрокаВсегоБлочков.Количество() > 0 
			И НЕ ЗначениеЗаполнено(СтрокаВсегоБлочков[0].Количество) Тогда
			
			Если МассивНеЗаполБлочков.Найти(ДанныеСтроки.id_Блочка) = Неопределено Тогда
				МассивНеЗаполБлочков.Добавить(ДанныеСтроки.id_Блочка); 
			КонецЕсли; 		  
			
		КонецЕсли; 	
	КонецЦикла;
	
	Если МассивНеЗаполБлочков.Количество() > 0  Тогда
	
		ТекстОшибки = "Не заполнено всего количество блочков по:"  + СтрСоединить(МассивНеЗаполБлочков,",");	
	
	КонецЕсли;	 
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		
		ПоказатьПредупреждение(,ТекстОшибки); 
		Возврат; 
		
	КонецЕсли;
	
	ИдКоробки = ВернутьСледующийIdКоробки(); 
	
	Если  ВвестиЗначение(ИдКоробки,"Ид Коробки",Тип("Число")) Тогда
		
		 
		Для каждого ВыделеннаяСтрока Из Элементы.СодержимоеБлочка.ВыделенныеСтроки Цикл
			ДанныеСтроки = Объект.СодержимоеБлочка.НайтиПоИдентификатору(ВыделеннаяСтрока);	
			Если ЗначениеЗаполнено(ДанныеСтроки.id_Короба) Тогда
			
				Продолжить; 	
			
			КонецЕсли;
			
			Если НЕ (ДанныеСтроки.Отметка) Тогда
			
				Продолжить; 	
			
			КонецЕсли; 		
				
			
			ДанныеСтроки.id_Короба = ИдКоробки; 
			
			ДобавитьСтрокуВТЧКоробки(ИдКоробки,ТипКоробаВыбранный);
					 
			
		КонецЦикла;	
		
		ПерезаполнитьРасчПоляТЧКоробки(ИдКоробки); 
		
	КонецЕсли;
	

КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьРасчПоляТЧКоробки(ИдКороба)
    Отбор = новый Структура("id_Короба",ИдКороба); 
	СтрокаКоробок = Объект.Коробки.НайтиСтроки(Отбор);
	Если СтрокаКоробок.Количество() > 0 Тогда
		
		СодержимоеБлочкаКопия = Объект.СодержимоеБлочка.Выгрузить(,"id_Короба,id_Блочка"); 
		СодержимоеБлочкаКопия.Свернуть("id_Короба,id_Блочка");
		СтрокиБлочков = СодержимоеБлочкаКопия.НайтиСтроки(Новый Структура("id_Короба",ИдКороба));
		ВсегоБлочковВКоробке = 0; 
		ВидыБлочков = ""; 
		Для каждого СтрокаБлочков Из СтрокиБлочков Цикл
			Отбор = новый Структура("id_Блочка",СтрокаБлочков.id_Блочка);
			СтрокаВсегоБлочков = Объект.ВсегоБлочков.НайтиСтроки(Отбор);
			Если СтрокаВсегоБлочков.Количество() > 0 Тогда
				ВсегоБлочковВКоробке = ВсегоБлочковВКоробке + СтрокаВсегоБлочков[0].Количество;  
			КонецЕсли;
			
			ВидыБлочков = ВидыБлочков + Строка(СтрокаБлочков.id_Блочка) + ";"; 
			
		КонецЦикла;
		
		СтрокаКоробок[0].КоличествоБлочков = ВсегоБлочковВКоробке; 
		СтрокаКоробок[0].ВидыБлочков = ВидыБлочков; 
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуВТЧКоробки(ИдКоробки,ТипКоробаВыбранный)
    Отбор = Новый Структура("id_Короба",ИдКоробки); 
	СтрокаКоробок = Объект.Коробки.НайтиСтроки(Отбор);
	Если СтрокаКоробок.Количество() = 0 Тогда
		
		НоваяСтрока = Объект.Коробки.Добавить();
		НоваяСтрока.id_Короба = ИдКоробки;
		НоваяСтрока.ТипКороба = ТипКоробаВыбранный; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуВТЧКоробкиНаСервере(ИдКоробки,ТипКоробаВыбранный)
    Отбор = Новый Структура("id_Короба",ИдКоробки);
	СтрокаКоробок = Объект.Коробки.НайтиСтроки(Отбор);
	Если СтрокаКоробок.Количество() = 0  Тогда
		
		НоваяСтрока = Объект.Коробки.Добавить();
		НоваяСтрока.id_Короба = ИдКоробки;
		НоваяСтрока.ТипКороба = ТипКоробаВыбранный; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВернутьСледующийIdКоробки()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТКоробки.id_Короба КАК id_Короба
	|ПОМЕСТИТЬ ВТКоробки
	|ИЗ
	|	&Коробки КАК ВТКоробки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТКоробки.id_Короба КАК id_Короба
	|ИЗ
	|	ВТКоробки КАК ВТКоробки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТКоробки.id_Короба УБЫВ";
	Запрос.УстановитьПараметр("Коробки",Объект.Коробки.Выгрузить(,"id_Короба")); 
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда  	 
		
		Возврат 1; 
		
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.id_Короба + 1;
	КонецЕсли;  	

КонецФункции // ВернутьIdКоробки()

&НаСервере
Процедура СоздатьЛистыНаСервере()
	Если Объект.Коробки.Количество() = 0 Тогда
		СообщитьПользователюСервер("Заполните таблицу коробок!!!");
		Возврат; 
	КонецЕсли;
	
	ТекЗначениеКонстанты=Константы.ЗапускПереукладки.Получить();
	ТекПользователь= ТекущийПользователь(); 
	
	если ТекЗначениеКонстанты=Справочники.ФизическиеЛица.ПустаяСсылка() тогда
		Константы.ЗапускПереукладки.Установить(ТекПользователь);
	ИначеЕсли  ТекЗначениеКонстанты	=  ТекПользователь тогда //Ничего не делаем
		
	иначе
		СообщитьПользователюСервер("В данный момент переукладка запущена у "+ТекЗначениеКонстанты+" дождитесь окончания.");
		ЗаписатьВЛог("ОчередьОбработки","Попытка начать переукладку. Пытался "+ТекПользователь+ " ,помещал "+ТекЗначениеКонстанты,"Информация");
		возврат;
	КонецЕсли;
	
	ТекЗначениеКонстанты=Константы.ЗапускПереукладки.Получить(); //На всякий проверим, что константа установилась
	если  ТекЗначениеКонстанты =   ТекПользователь тогда
	иначе
		СообщитьПользователюСервер("Не удалось начать переукладку. Попробуйте ещё раз.");
		ЗаписатьВЛог("ОчередьОбработки","Не удалось записать константу ЗапускПереукладки - "+ТекПользователь,"Информация");
		возврат;		
	КонецЕсли;
	Если Не ДобавлятьКСуществующим Тогда
		Запрос = Новый Запрос;
		Запрос.Текст= "ВЫБРАТЬ
					  |	ЛистПереукладки.Ссылка как ЛП
					  |ИЗ
					  |	Документ.ЛистПереукладки КАК ЛистПереукладки
					  |ГДЕ
					  |	ЛистПереукладки.Проведен
					  |	И ЛистПереукладки.ДокОснование = &ДокОснование";
		Запрос.УстановитьПараметр("ДокОснование", СсылкаПоДокОбъекту());
		Результат = Запрос.Выполнить().Выгрузить();
		Если результат.Количество() > 0 Тогда
			//Состояние("Удаление старых листов переукладки...");
			Для Каждого СтрРез Из результат Цикл
				ТекЛП=СтрРез.ЛП.ПолучитьОбъект();
				ТекЛП.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	ЕстьОшибки = Ложь; 
	Если Объект.СоздаватьЗНА Тогда
		
		Для Каждого СтрРез Из Объект.Коробки Цикл

			ТЗНомЛП=Новый ТаблицаЗначений;
			ТЗНомЛП.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
			ТЗНомЛП.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
			//++Данилова Е.В. 01.06.2026 SNL-243
			Если СтрРез.Сборный Тогда
				НомЛП = СборныйКороб.НайтиСтроки(Новый Структура("id_Короба,отметка", СтрРез.id_Короба, Истина));
				Для Каждого СтрМасс Из НомЛП Цикл
					СтрТЗ = ТЗНомЛП.Добавить();
					СтрТЗ.Номенклатура = СтрМасс.Номенклатура;
					СтрТЗ.Количество   = СтрМасс.Количество;
				КонецЦикла;
				//--Данилова Е.В. 01.06.2026 
			Иначе
				НомЛП = Объект.Товары.НайтиСтроки(Новый Структура("id_Короба,отметка", СтрРез.id_Короба, Истина));
				Для Каждого СтрМасс Из НомЛП Цикл
					СтрТЗ = ТЗНомЛП.Добавить();
					СтрТЗ.Номенклатура = СтрМасс.Номенклатура;
					СтрТЗ.Количество   = СтрМасс.Количество;
				КонецЦикла;
			//++Данилова Е.В. 01.06.2026 SNL-243
			КонецЕсли;
			//--Данилова Е.В. 01.06.2026 
			СтруктураЗаполненияШапкиЗНА = новый Структура("ТипКороба,Товары,КоличествоКоробок",СтрРез.ТипКороба,ТЗНомЛП,СтрРез.Количество);		
			РезультатПолучения = Документы.ЗаданиеНаАгрегацию.НайтиСоздатьЗНАПоНакладнойИСтруктуреПараметров(СсылкаПоДокОбъекту(),СтруктураЗаполненияШапкиЗНА);
			если РезультатПолучения.Успех тогда
				ЗНА = РезультатПолучения.Данные;
				РезультатСоздания = Документы.ЗаданиеНаАгрегацию.ЗаполнитьЛистыПереукладкиПоЗНА(ЗНА,ДобавлятьКСуществующим);			
			
				если не РезультатСоздания.Успех тогда
					
					СообщитьПользователюСервер(СтрСоединить(РезультатСоздания.Ошибки,символы.ПС)); 	 
					СообщитьПользователюСервер("Не удалось создать заполнить листы переукладки по ЗНА. Попробуйте ещё раз");  
					
					ЕстьОшибки = Истина;
									
				КонецЕсли;
				Продолжить;         
			иначе   
				ЕстьОшибки = Истина;
				СообщитьПользователюСервер(СтрСоединить(РезультатПолучения.Ошибки,символы.ПС));
				Прервать;
			КонецЕсли;   
		КонецЦикла; 		
		 
		Если Не ЕстьОшибки Тогда
			//Данилова Е.В. 12.05.2026 SNL-201
			//Документы.ЛистПереукладки.ПереномероватьВсеКоробкиНакладной(СсылкаПоДокОбъекту());

			СообщитьПользователюСервер("Готово");
		КонецЕсли;
	Иначе
		 //здесь необходимо преобразовать в комплектующие 
		 
		ОтгрузкаКомплектов = ПолучитьРеквизитШапки(СсылкаПоДокОбъекту(), "ОтгрузкаКомплектов", "Документ");
		Запрос = Новый запрос;
		запрос.Текст = "ВЫБРАТЬ
					   |	РасходнаяНакладнаяКомплектующие.Номенклатура КАК Номенклатура,
					   |	РасходнаяНакладнаяКомплектующие.Продукция КАК Продукция,
					   |	РасходнаяНакладнаяКомплектующие.Количество КАК Количество,
					   |	РасходнаяНакладнаяКомплектующие.КоличествоПродукции КАК КоличествоПродукции
					   |ИЗ
					   |	Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
					   |ГДЕ
					   |	РасходнаяНакладнаяКомплектующие.Ссылка = &Накладная
					   |	И РасходнаяНакладнаяКомплектующие.Количество > 0
					   |	И РасходнаяНакладнаяКомплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)";
		запрос.УстановитьПараметр("Накладная", СсылкаПоДокОбъекту());
		ТаблицаНакладнойКомплектующие = запрос.Выполнить().Выгрузить();
		
		Для Каждого СтрРез Из Объект.Коробки Цикл
			ТЗНомЛП=Новый ТаблицаЗначений;
			ТЗНомЛП.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
			ТЗНомЛП.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
			//++Данилова Е.В. 01.06.2026 SNL-243
			Если СтрРез.Сборный Тогда
				НомЛП = СборныйКороб.НайтиСтроки(Новый Структура("id_Короба,отметка", СтрРез.id_Короба, Истина));
				Для Каждого СтрМасс Из НомЛП Цикл
					СтрТЗ = ТЗНомЛП.Добавить();
					СтрТЗ.Номенклатура = СтрМасс.Номенклатура;
					СтрТЗ.Количество   = СтрМасс.Количество;
				КонецЦикла;
				//--Данилова Е.В. 01.06.2026 
			Иначе
				НомЛП = Объект.Товары.НайтиСтроки(Новый Структура("id_Короба,Отметка", СтрРез.id_Короба, Истина));
				Для Каждого СтрМасс Из НомЛП Цикл
					СтрТЗ = ТЗНомЛП.Добавить();
					СтрТЗ.Номенклатура = СтрМасс.Номенклатура;
					СтрТЗ.Количество   = СтрМасс.Количество;
				КонецЦикла;
			КонецЕсли;
			Для сч = 1 По СтрРез.Количество Цикл
				НовДок = Документы.ЛистПереукладки.СоздатьДокумент();
				НовДок.Автор = ПараметрыСеанса.Пользователь;
				НовДок.КоличествоДокумента = 0;
				НовДок.ТипКороба = СтрРез.ТипКороба;
				Если ТипКороба <> Справочники.ТипыКоробов.НайтиПоКоду("0000000001") Тогда
					НовДок.ОбъемДокумента = ТипКороба.Объем;
				Иначе
					НовДок.ОбъемДокумента=Объем;
				КонецЕсли;

				НовДок.Дата=ТекущаяДатаСеанса();
				НовДок.ДокОснование = СсылкаПоДокОбъекту();
				Если ОтгрузкаКомплектов Тогда
					ТоварыДляЛП = РазвернутьТоварыВКомплектующие(ТаблицаНакладнойКомплектующие, ТЗНомЛП);
				Иначе
					ТоварыДляЛП = ТЗНомЛП;
				КонецЕсли;
				Для Каждого СтрТЗ Из ТоварыДляЛП Цикл
					СтрТЧ = НовДок.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(СтрТЧ, СтрТЗ);
					СтрТЧ.ТипШК = Перечисления.ТипыШтрихКодов.Штука;
				КонецЦикла;

				НовДок.Записать(РежимЗаписиДокумента.Проведение);
			КонецЦикла;
		КонецЦикла;
		СообщитьПользователюСервер("Готово");
	КонецЕсли;  

	запрос=новый Запрос;
	запрос.Текст="ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛистПереукладки.Ссылка) КАК КоличествоКоробок,
	|	СУММА(ЛистПереукладки.ОбъемДокумента) КАК ОбъемДокумента
	|ИЗ
	|	Документ.ЛистПереукладки КАК ЛистПереукладки
	|ГДЕ
	|	ЛистПереукладки.Проведен
	|	И ЛистПереукладки.ДокОснование = &ДокОснование";
	запрос.УстановитьПараметр("ДокОснование",СсылкаПоДокОбъекту());
	Результат=запрос.Выполнить().Выгрузить();
	
	Если результат.Количество() > 0  Тогда 
		ДокОбъектРНК  = Объект.Докссылка.ПолучитьОбъект();
		ДокОбъектРНК.КоличествоКоробок = результат.Получить(0).КоличествоКоробок;
		ДокОбъектРНК.ОбъемКоробов = результат.Получить(0).ОбъемДокумента;
		ДокОбъектРНК.Записать();
		ЗаписатьКоличествоИОбъемКоробовВРегистр(СсылкаПоДокОбъекту(),результат.Получить(0).КоличествоКоробок,результат.Получить(0).ОбъемДокумента);
	КонецЕсли;
	 
	Константы.ЗапускПереукладки.Установить(Справочники.ФизическиеЛица.ПустаяСсылка());	
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью(ПроверятьПравила = Истина) 
	Если ПроверятьПравила Тогда 
		Запрос = Новый Запрос; 
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладная.ПравилаАгрегацииЧестногоЗнака.ТребуетсяАгрегацияБлочков КАК ТребуетсяАгрегацияБлочков
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.Ссылка = &Ссылка"; 
		Запрос.УстановитьПараметр("Ссылка", СсылкаПоДокОбъекту());
		Выборка = Запрос.Выполнить().Выбрать(); 
		Выборка.Следующий(); 
		
		ПоБлочкам = Выборка.ТребуетсяАгрегацияБлочков; 
	КонецЕсли;
	УстановитьВидимостьЗаполненияДанныхПоБлочкам();  
	если РольДоступна("Администратор") тогда 
		Элементы.НеСверятьКоличество.Доступность = Истина;
	КонецЕсли;
	 
	Объект.СоздаватьЗНА = Истина;
	Элементы.СоздаватьЗНА.Видимость 	= РольДоступна("Администратор");
	Элементы.СоздаватьЗНА.Доступность 	= РольДоступна("Администратор");
	
	Элементы.КоробкиРассчитатьКоличествоКоробок.Видимость = ПоБлочкам; 
	Элементы.КоробкиКонтрольРаспределенияТоваровРНК.Видимость = ПоБлочкам;
	Элементы.КоробкиКоличествоБлочков.Видимость = ПоБлочкам; 
	Элементы.КоробкиВидыБлочков.Видимость = ПоБлочкам; 
	//++Данилова Е.В. 01.06.2026 SNL-243
	Элементы.СборныйКороб.Видимость = Не ПоБлочкам И СборныйКороб.Количество() > 0; 
	//--Данилова Е.В. 01.06.2026 

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЗаполненияДанныхПоБлочкам() 
	
	Элементы.ГруппаДляБлочков.Видимость = ПоБлочкам; 
	Элементы.ГруппаДляКоробок.Видимость = не ПоБлочкам; 
	 	
	ДобавлятьКСуществующим = Ложь; //НЕ ПоБлочкам; 
	//Элементы.ДобавлятьКСуществующим.Доступность = НЕ ПоБлочкам; 
	Элементы.ФормаСоздатьЛисты.Видимость = Не ПоБлочкам;
	Элементы.ФормаСоздатьЛистыПоБлочкам.Видимость = ПоБлочкам;  
	//++Данилова Е.В. 02.06.2026 SNL-243
	Элементы.РазделятьБлочкиПоНоменклатуре.Доступность = ПоБлочкам;
	Если Не ПоБлочкам Тогда
		РазделятьБлочкиПоНоменклатуре = Ложь;  
	КонецЕсли;
	//--Данилова Е.В. 02.06.2026 
КонецПроцедуры

&НаСервере
Процедура СообщитьПользователюСервер(Текст)
//	Сообщение = Новый СообщениеПользователю;
//	Сообщение.Текст = Текст;
//	Сообщение.Сообщить();
	Сообщить(Текст); 
КонецПроцедуры
&НаСервере
Функция СсылкаПоДокОбъекту()
	Возврат Объект.ДокСсылка; 
КонецФункции

&НаСервереБезКонтекста
Функция РазвернутьТоварыВКомплектующие(ТаблицаНакладной,Товары)

	ТоварыВозвращаемые = Товары.Скопировать();
	ТоварыВозвращаемые.Очистить();
	
	Для каждого СтрТЗ из Товары цикл 
		МассивСтрок = ТаблицаНакладной.НайтиСтроки(Новый Структура("Продукция",СтрТЗ.Номенклатура));
		КоличествоПродукции = 0;       
		
		Для каждого СтрМасс из МассивСтрок цикл    
			КоличествоПродукции = КоличествоПродукции + СтрМасс.КоличествоПродукции; 
		КонецЦикла;  
		если КоличествоПродукции = 0 тогда Продолжить; КонецЕсли;
		
		Для каждого СтрМасс из МассивСтрок цикл    
			СтрТЗВозвращаемая = ТоварыВозвращаемые.Добавить();  
			СтрТЗВозвращаемая.Номенклатура = СтрМасс.Номенклатура;
			СтрТЗВозвращаемая.Количество = Окр(СтрТЗ.Количество*(СтрМасс.Количество/КоличествоПродукции),0); 
		КонецЦикла; 		
		
	КонецЦикла;
	
	возврат ТоварыВозвращаемые;


КонецФункции

&НаСервере
//Процедура РасчитатьИзМатрицыПоКоробкамНаСервере()
//	Если Объект.СоздаватьЗНА Тогда
//		РезультатВыполнения = документы.ЗаданиеНаАгрегацию.РаспровестиЗНАПоНакладной(СсылкаПоДокОбъекту(), Истина);
//		Если Не РезультатВыполнения.Успех Тогда
//			СообщитьПользователюСервер(СтрСоединить(РезультатВыполнения.Ошибки, символы.ПС)); 
//			Возврат;
//		КонецЕсли;
//	КонецЕсли;
//	ДокСсылкаНаОбъект = СсылкаПоДокОбъекту(); 
//	
//	ТекЗначениеКонстанты = Константы.ЗапускПереукладки.Получить();
//	ТекПользователь = ТекущийПользователь();
//
//	Если ТекЗначениеКонстанты = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
//		Константы.ЗапускПереукладки.Установить(ТекПользователь);
//	ИначеЕсли ТекЗначениеКонстанты = ТекПользователь Тогда //Ничего не делаем
//
//	Иначе		
//		СообщитьПользователюСервер("В данный момент переукладка запущена у " + ТекЗначениеКонстанты + " дождитесь окончания."); 		
//		ЗаписатьВЛог("ОчередьОбработки", "Попытка начать переукладку. Пытался " + ТекПользователь + " ,помещал "
//			+ ТекЗначениеКонстанты, "Информация");
//
//		Возврат;
//	КонецЕсли;
//
//	ТекЗначениеКонстанты=Константы.ЗапускПереукладки.Получить(); //На всякий проверим, что константа установилась
//	Если ТекЗначениеКонстанты <> ТекПользователь Тогда		
//		СообщитьПользователюСервер("Не удалось начать переукладку. Попробуйте ещё раз."); 
//		ЗаписатьВЛог("ОчередьОбработки", "Не удалось записать константу ЗапускПереукладки - " + ТекПользователь,
//			"Информация");
//		Возврат;
//	КонецЕсли;
//
//	Запрос = Новый Запрос;
//	Запрос.Текст= "ВЫБРАТЬ
//				  |	ЛистПереукладки.Ссылка как ЛП
//				  |ИЗ
//				  |	Документ.ЛистПереукладки КАК ЛистПереукладки
//				  |ГДЕ
//				  |	ЛистПереукладки.Проведен
//				  |	И ЛистПереукладки.ДокОснование = &ДокОснование";
//	запрос.УстановитьПараметр("ДокОснование", ДокСсылкаНаОбъект);
//	Результат = Запрос.Выполнить().Выгрузить();
//	Если результат.Количество() > 0 Тогда
//		//Состояние("Удаление старых листов переукладки...");
//		Для Каждого СтрРез Из результат Цикл
//			ТекЛП = СтрРез.ЛП.ПолучитьОбъект();
//			ТекЛП.Записать(РежимЗаписиДокумента.ОтменаПроведения);
//		КонецЦикла;
//	КонецЕсли;
//	
//	ТЗначений = Новый ТаблицаЗначений;
//	ТЗначений.Колонки.Добавить("Номенклатура");		//+
//	ТЗначений.Колонки.Добавить("АртикулКонтрагента");   //+
//	ТЗначений.Колонки.Добавить("КратностьКоробки");            //+
//	ТЗначений.Колонки.Добавить("Количество");  
//	//+
//	НельзяЗагружать = Ложь;
//
//	Для Каждого СтрокаТЧ Из Объект.ДокОбъект.Товары Цикл
//		Если СтрокаТЧ.Количество = 0 Тогда
//			Продолжить;
//		КонецЕсли;
//		//@skip-check query-in-loop
//		РеквизитыНоменклатуры = ПолучитьРеквизитыНоменклатурыИзМатрицы(СтрокаТЧ.Номенклатура, ДокСсылкаНаОбъект);
//		Если РеквизитыНоменклатуры.номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
//			НельзяЗагружать=Истина;
//			СообщитьПользователюСервер("по номенклатуре " + СтрокаТЧ.Номенклатура
//				+ " нет данных в матрице, ЛП не будут созданы."); 
//			Продолжить;
//		КонецЕсли;
//		Если РеквизитыНоменклатуры.КратностьКоробки = 0 Тогда
//			НельзяЗагружать=Истина;
//			СообщитьПользователюСервер("по номенклатуре " + СтрокаТЧ.Номенклатура
//				+ " пустая кратность коробки, ЛП не будут созданы"); 
//			Продолжить;
//		КонецЕсли;
//		СтрТЗ=ТЗначений.Добавить();
//		ЗаполнитьЗначенияСвойств(СтрТЗ, РеквизитыНоменклатуры);
//		СтрТЗ.Количество=СтрокаТЧ.Количество;
//	КонецЦикла;
//
//	Если НельзяЗагружать Тогда
//		Возврат;
//	КонецЕсли;
//
//	ТЗСверн = ТЗначений.Скопировать();
//	ТЗСверн.Свернуть("АртикулКонтрагента,КратностьКоробки", "Количество");
//	
//	
//	ЕстьОшибки = Ложь; 	
//	
//	 
//	ОтгрузкаКомплектов = ПолучитьРеквизитШапки(ДокСсылкаНаОбъект, "ОтгрузкаКомплектов", "Документ");
//	Запрос = Новый запрос;
//	запрос.Текст = "ВЫБРАТЬ
//				   |	РасходнаяНакладнаяКомплектующие.Номенклатура КАК Номенклатура,
//				   |	РасходнаяНакладнаяКомплектующие.Продукция КАК Продукция,
//				   |	РасходнаяНакладнаяКомплектующие.Количество КАК Количество,
//				   |	РасходнаяНакладнаяКомплектующие.КоличествоПродукции КАК КоличествоПродукции
//				   |ИЗ
//				   |	Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
//				   |ГДЕ
//				   |	РасходнаяНакладнаяКомплектующие.Ссылка = &Накладная
//				   |	И РасходнаяНакладнаяКомплектующие.Количество > 0
//				   |	И РасходнаяНакладнаяКомплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)";
//	запрос.УстановитьПараметр("Накладная", ДокСсылкаНаОбъект);
//	ТаблицаНакладнойКомплектующие = запрос.Выполнить().Выгрузить();
//	 
//	Для Каждого СтрТЗСверн Из ТЗСверн Цикл
//		НомЛП = ТЗначений.НайтиСтроки(Новый Структура("АртикулКонтрагента", СтрТЗСверн.АртикулКонтрагента));
//		ТЗНомЛП = Новый ТаблицаЗначений;
//		ТЗНомЛП.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
//		ТЗНомЛП.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
//		КолКор=СтрТЗСверн.Количество / СтрТЗСверн.КратностьКоробки;
//				
//		Если Объект.СоздаватьЗНА Тогда
//			
//			Если Цел(КолКор) <> КолКор Тогда
//				КолКор = Цел(КолКор) + 1;
//			КонецЕсли;
//
//			Для Каждого СтрМасс Из НомЛП Цикл
//				СтрТЗ=ТЗНомЛП.Добавить();
//				СтрТЗ.Номенклатура=СтрМасс.Номенклатура;
//				СтрТЗ.Количество=СтрМасс.количество / КолКор;
//			КонецЦикла;
//
//		Иначе
//			Для Каждого СтрМасс Из НомЛП Цикл
//				СтрТЗ=ТЗНомЛП.Добавить();
//				СтрТЗ.Номенклатура=СтрМасс.Номенклатура;
//				СтрТЗ.Количество=СтрМасс.количество / КолКор;
//			КонецЦикла;
//
//		КонецЕсли;
//		
//		Если Объект.СоздаватьЗНА Тогда
//			
//			СтрТЧТоваров= Объект.Товары.Найти(ТЗНомЛП.Получить(0).Номенклатура);
//			Если СтрТЧТоваров = Неопределено Или СтрТЧТоваров.ТипКороба = Справочники.ТипыКоробов.ПустаяСсылка() Тогда
//				ТекущийТипКороба=ТипКороба;
//			Иначе
//				ТекущийТипКороба=СтрТЧТоваров.ТипКороба;
//			КонецЕсли;
//			СтруктураЗаполненияШапкиЗНА = Новый Структура("ТипКороба,Товары,КоличествоКоробок", ТекущийТипКороба,
//				ТЗНомЛП, КолКор);
//			РезультатПолучения = Документы.ЗаданиеНаАгрегацию.НайтиСоздатьЗНАПоНакладнойИСтруктуреПараметров(
//				ДокСсылкаНаОбъект, СтруктураЗаполненияШапкиЗНА);
//			Если РезультатПолучения.Успех Тогда
//				ЗНА = РезультатПолучения.Данные;
//				Если Ложь Тогда
//					Документы.ЗаданиеНаАгрегацию.НайтиПоНомеру("");
//				КонецЕсли;
//				
//				РезультатСоздания = Документы.ЗаданиеНаАгрегацию.ЗаполнитьЛистыПереукладкиПоЗНА(ЗНА);
//				Если Не РезультатСоздания.Успех Тогда
//					СообщитьПользователюСервер(СтрСоединить(РезультатСоздания.Ошибки, символы.ПС));
//					СообщитьПользователюСервер(
//						"Не удалось создать заполнить листы переукладки по ЗНА. Попробуйте ещё раз");
//
//					ЕстьОшибки = Истина;
//
//				КонецЕсли;
//				Продолжить;
//			Иначе
//				ЕстьОшибки = Истина;
//				СообщитьПользователюСервер(СтрСоединить(РезультатПолучения.Ошибки, символы.ПС));
//				Прервать;
//			КонецЕсли;
//		КонецЕсли;
//		
//		Если Не Объект.СоздаватьЗНА Тогда
//			 
//			Для сч = 1 По КолКор Цикл
//				НовДок=Документы.ЛистПереукладки.СоздатьДокумент();
//				НовДок.Автор=ПараметрыСеанса.Пользователь;
//				НовДок.КоличествоДокумента=0;
//				//НовДок.ТипКороба=Справочники.ТипыКоробов.НайтиПоРеквизиту("Номенклатура",ТЗНомЛП.Получить(0).Номенклатура);
//				СтрТЧТоваров= Объект.Товары.Найти(ТЗНомЛП.Получить(0).Номенклатура);
//				Если СтрТЧТоваров = Неопределено Или СтрТЧТоваров.ТипКороба
//					= Справочники.ТипыКоробов.ПустаяСсылка() Тогда
//					НовДок.ТипКороба=ТипКороба;
//				Иначе
//					НовДок.ТипКороба=СтрТЧТоваров.ТипКороба;
//				КонецЕсли;
//
//				Если НовДок.ТипКороба <> Справочники.ТипыКоробов.НайтиПоКоду("0000000001") Тогда
//					НовДок.ОбъемДокумента = ТипКороба.Объем;
//				Иначе
//					НовДок.ОбъемДокумента = Объем;
//				КонецЕсли;
//
//				//ТипШК = Перечисления.ТипыШтрихКодов.Штука;
//				НовДок.Дата = ТекущаяДатаСеанса();
//				НовДок.ДокОснование = ДокСсылкаНаОбъект;
//				 
//				Если ОтгрузкаКомплектов Тогда
//					ТоварыДляЛП = РазвернутьТоварыВКомплектующие(ТаблицаНакладнойКомплектующие, ТЗНомЛП);
//				Иначе
//					ТоварыДляЛП = ТЗНомЛП;
//				КонецЕсли; 				 
//				//для каждого СтрТЗ из ТЗНомЛП цикл
//				Для Каждого СтрТЗ Из ТоварыДляЛП Цикл
//					
//					СтрТЧ=НовДок.Товары.Добавить();
//					СтрТЧ.Номенклатура=СтрТЗ.Номенклатура;
//					СтрТЧ.Количество=СтрТЗ.Количество;  
//					
//					
//					СтрТЧ.ТипШК = Перечисления.ТипыШтрихКодов.Штука;
//					
//
//				КонецЦикла;
//				НовДок.Записать(РежимЗаписиДокумента.Проведение);
//			КонецЦикла; 
//			
//		КонецЕсли;
//		 
//	КонецЦикла;        
//	
//	Если Не ЕстьОшибки И Объект.СоздаватьЗНА Тогда		 
//		Документы.ЛистПереукладки.ПереномероватьВсеКоробкиНакладной(ДокСсылкаНаОбъект);
//		СообщитьПользователюСервер("Готово");
//	КонецЕсли;
//
//	запрос=Новый Запрос;
//	запрос.Текст= "ВЫБРАТЬ
//				  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛистПереукладки.Ссылка) КАК КоличествоКоробок,
//				  |	СУММА(ЛистПереукладки.ОбъемДокумента) КАК ОбъемДокумента
//				  |ИЗ
//				  |	Документ.ЛистПереукладки КАК ЛистПереукладки
//				  |ГДЕ
//				  |	ЛистПереукладки.Проведен
//				  |	И ЛистПереукладки.ДокОснование = &ДокОснование";
//	запрос.УстановитьПараметр("ДокОснование", ДокСсылкаНаОбъект);
//	результат=запрос.Выполнить().Выгрузить();
//	 
//	Если результат.Количество() > 0 Тогда
//		Объект.ДокОбъект.КоличествоКоробок=результат.Получить(0).КоличествоКоробок;
//		Объект.ДокОбъект.ОбъемКоробов=результат.Получить(0).ОбъемДокумента;
//		Объект.ДокОбъект.Записать();
//		ЗаписатьКоличествоИОбъемКоробовВРегистр(ДокСсылкаНаОбъект, результат.Получить(0).КоличествоКоробок,
//			результат.Получить(0).ОбъемДокумента);
//	КонецЕсли;
//	 
//	Константы.ЗапускПереукладки.Установить(Справочники.ФизическиеЛица.ПустаяСсылка());
//
//КонецПроцедуры
&НаСервере
Процедура РасчитатьИзМатрицыПоКоробкамНаСервереСЗаполнением()

	ДокСсылкаНаОбъект = СсылкаПоДокОбъекту();
	Если Не ЗначениеЗаполнено(ТипКороба) Тогда
		СообщитьПользователюСервер("Заполните тип короба в шапке!");
		Возврат;
	КонецЕсли;
	Объект.товары.Очистить();
    //++Данилова Е.В. 01.06.2026 SNL-243 
	СборныйКороб.Очистить();
	//--Данилова Е.В. 01.06.2026
	ТЗначений = Новый ТаблицаЗначений;
	ТЗначений.Колонки.Добавить("Номенклатура");		//+
	ТЗначений.Колонки.Добавить("АртикулКонтрагента");   //+
	ТЗначений.Колонки.Добавить("КратностьКоробки");            //+
	ТЗначений.Колонки.Добавить("Количество");  
	//+
	НельзяЗагружать = Ложь;
    ТоварыПоДокОбРНК = ВернутьТоварыРНК(); 
	
	Для Каждого СтрокаТЧ Из ТоварыПоДокОбРНК Цикл
		Если СтрокаТЧ.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		//@skip-check query-in-loop
		РеквизитыНоменклатуры = ПолучитьРеквизитыНоменклатурыИзМатрицы(СтрокаТЧ.Номенклатура, ДокСсылкаНаОбъект);
		Если РеквизитыНоменклатуры.номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
			НельзяЗагружать=Истина;
			СообщитьПользователюСервер("по номенклатуре " + СтрокаТЧ.Номенклатура
				+ " нет данных в матрице, ЛП не будут созданы.");
			Продолжить;
		КонецЕсли;
		Если РеквизитыНоменклатуры.КратностьКоробки = 0 Тогда
			НельзяЗагружать=Истина;
			СообщитьПользователюСервер("по номенклатуре " + СтрокаТЧ.Номенклатура
				+ " пустая кратность коробки, ЛП не будут созданы");
			Продолжить;
		КонецЕсли;
		СтрТЗ=ТЗначений.Добавить();
		ЗаполнитьЗначенияСвойств(СтрТЗ, РеквизитыНоменклатуры);
		СтрТЗ.Количество=СтрокаТЧ.Количество;
	КонецЦикла;

	Если НельзяЗагружать Тогда
		Возврат;
	КонецЕсли;

	ТЗСверн = ТЗначений.Скопировать();
	ТЗСверн.Свернуть("АртикулКонтрагента,КратностьКоробки", "Количество");
	НомерВидаКоробки = 1;
	Для Каждого СтрТЗСверн Из ТЗСверн Цикл
		НомЛП = ТЗначений.НайтиСтроки(Новый Структура("АртикулКонтрагента", СтрТЗСверн.АртикулКонтрагента));

		КолКор=СтрТЗСверн.Количество / СтрТЗСверн.КратностьКоробки;

		Если Объект.СоздаватьЗНА Тогда
			//++Данилова Е.В. 01.06.2026 SNL-243

//			Если Цел(КолКор) <> КолКор Тогда
//				КолКор = Цел(КолКор) + 1;
//			КонецЕсли;
			ОставшеесяКоличество = 0; 
			Если Цел(КолКор) <> КолКор Тогда
				КолКор = Цел(КолКор); 
				ОставшеесяКоличество =  СтрТЗСверн.Количество - СтрТЗСверн.КратностьКоробки * КолКор; 
			КонецЕсли; 
			//--Данилова Е.В. 01.06.2026 
		КонецЕсли;
		//++Данилова Е.В. 01.06.2026 SNL-243
		ЧастьДляРаспределения = 0;
		Если ОставшеесяКоличество > 0 Тогда
			ЧастьДляРаспределения = Цел(СтрТЗСверн.Количество / ОставшеесяКоличество);
		КонецЕсли;
		//--Данилова Е.В. 01.06.2026 
		Для Каждого СтрМасс Из НомЛП Цикл
			Если КолКор > 0 Тогда
				СтрТЗ = Объект.товары.Добавить();
				СтрТЗ.Номенклатура=СтрМасс.Номенклатура;
				Если ЧастьДляРаспределения = 0 Тогда
					СтрТЗ.Количество=СтрМасс.количество / КолКор;
				Иначе
					СтрТЗ.Количество=(СтрМасс.количество - Цел(СтрМасс.количество / ЧастьДляРаспределения)) / КолКор;
				КонецЕсли;
				СтрТЗ.ТипКороба = ТипКороба;
				СтрТЗ.Отметка = Истина;
				СтрТЗ.КоличествоКоробов = КолКор;
				СтрТЗ.id_Короба = НомерВидаКоробки; 
				
				НомерВидаКоробки = НомерВидаКоробки + 1;
			КонецЕсли; 
			//++Данилова Е.В. 01.06.2026 SNL-243
			Если ОставшеесяКоличество > 0 Тогда
				СтрСборный = СборныйКороб.Добавить();
				СтрСборный.Номенклатура = СтрМасс.Номенклатура;
				СтрСборный.Количество = СтрМасс.количество - СтрТЗ.Количество * КолКор;
				СтрСборный.ОставшеесяКоличество =  СтрСборный.Количество;
				СтрСборный.id_Короба = 1;
				СтрСборный.ТипКороба = ТипКороба;
				СтрСборный.Отметка = истина;
				
				ОставшеесяКоличество = ОставшеесяКоличество -  СтрСборный.Количество;  
			КонецЕсли;
			//--Данилова Е.В. 01.06.2026 
		КонецЦикла;
		//++Данилова Е.В. 01.06.2026 SNL-243
		Если ОставшеесяКоличество > 0 И СтрСборный <> Неопределено Тогда
			СтрСборный.Количество = СтрСборный.Количество + ОставшеесяКоличество; 
		КонецЕсли;
		//--Данилова Е.В. 01.06.2026 
		//НомерВидаКоробки = НомерВидаКоробки + 1;
	КонецЦикла;	
    //++Данилова Е.В. 01.06.2026 SNL-243
	Элементы.СборныйКороб.Видимость = СборныйКороб.Количество() > 0; 
	//--Данилова Е.В. 01.06.2026
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧКоробкиПоТоварам()
	Объект.Коробки.очистить();   
	
	ТЧТоварыСвернутая = Объект.товары.Выгрузить();
	ТЧТоварыСвернутая.Свернуть("id_Короба,КоличествоКоробов,Отметка");
	
	Для Каждого СтрокаСверн Из ТЧТоварыСвернутая Цикл
		Если НЕ  СтрокаСверн.Отметка Тогда
			Продолжить; 
		КонецЕсли;	
		
		НоваяСтрокаКороба = Объект.Коробки.Добавить(); 
		НоваяСтрокаКороба.id_Короба = СтрокаСверн.id_Короба; 
		НоваяСтрокаКороба.Количество = СтрокаСверн.КоличествоКоробов; 
		Если НЕ ЗначениеЗаполнено(СтрокаСверн.КоличествоКоробов) Тогда
			НоваяСтрокаКороба.Количество = КоличествоЛистовПереукладки; 
		КонецЕсли;
		НоваяСтрокаКороба.ТипКороба = ТипКороба; 
		
	КонецЦикла;
	//++Данилова Е.В. 01.06.2026 SNL-243
	ТЧКоробСборный = СборныйКороб.Выгрузить(); 
	ТЧКоробСборный.Свернуть("id_Короба,Отметка");
	Для Каждого СтрокаСверн Из ТЧКоробСборный Цикл
		Если НЕ  СтрокаСверн.Отметка Тогда
			Продолжить; 
		КонецЕсли;
		НоваяСтрокаКороба = Объект.Коробки.Добавить(); 
		НоваяСтрокаКороба.id_Короба = СтрокаСверн.id_Короба;
		НоваяСтрокаКороба.Сборный = Истина; 
		//только один короб сборный одного вида 
		НоваяСтрокаКороба.Количество = 1;
		НоваяСтрокаКороба.ТипКороба = ТипКороба;
		//СтрокиСборн = СборныйКороб.НайтиСтроки(Новый Структура("id_Короба",СтрокаСверн.id_Короба));
		
		//КоличествоКоробок = Неопределено;  
//		Для Каждого СтрокаСборн Из СтрокиСборн Цикл
//			Если СтрокаСборн.Количество = 0 Тогда
//				Продолжить; 
//			КонецЕсли;
//			КоличествоКоробокВТЧ = ЦЕЛ(СтрокаСборн.ОставшеесяКоличество/СтрокаСборн.Количество);
//			Если КоличествоКоробок = неопределено Тогда
//				КоличествоКоробок = КоличествоКоробокВТЧ; 
//			Иначе 
//				КоличествоКоробок = Мин(КоличествоКоробок,КоличествоКоробокВТЧ); 
//			КонецЕсли;
//		КонецЦикла;
//		
//		НоваяСтрокаКороба.Количество = ?(КоличествоКоробок = Неопределено,0,КоличествоКоробок);
		
		 
	КонецЦикла; 
	//--Данилова Е.В. 01.06.2026  
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизитыНоменклатурыИзМатрицы(Номенклатура, Документ)
	Если Ложь Тогда
		Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		Документ = Документы.РасходнаяНакладная.ПустаяСсылка();
	КонецЕсли;
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
	СтруктураРезультата.Вставить("ШККонтрагента", "");
	СтруктураРезультата.Вставить("АртикулКонтрагента", "");
	СтруктураРезультата.Вставить("Цена", 0);
	СтруктураРезультата.Вставить("Кратность", 0);
	//СтруктураРезультата.Вставить("МинимальноеКоличество","");
	СтруктураРезультата.Вставить("ШККонтрагентаБлочок", "");
	СтруктураРезультата.Вставить("ШККонтрагентаКоробка", "");
	СтруктураРезультата.Вставить("КратностьКоробки", 0);
	СтруктураРезультата.Вставить("НаименованиеКонтрагента", "");
	СтруктураРезультата.Вставить("КодПроизводителяКонтрагента", "");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				   |	МатрицаТовары.Номенклатура,
				   |	МатрицаТовары.ШККонтрагента,
				   |	МатрицаТовары.АртикулКонтрагента,
				   |	МатрицаТовары.Цена,
				   |	МатрицаТовары.Кратность,
				   |	МатрицаТовары.МинимальноеКоличество,
				   |	МатрицаТовары.ШККонтрагентаБлочок,
				   |	МатрицаТовары.ШККонтрагентаКоробка,
				   |	МатрицаТовары.КратностьКоробки,
				   |	МатрицаТовары.НаименованиеКонтрагента,
				   |	МатрицаТовары.КодПроизводителяКонтрагента
				   |ИЗ
				   |	Документ.Матрица.Товары КАК МатрицаТовары
				   // |		ПОЛНОЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки

				   // |		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
				   |			
				   |ГДЕ
				   |	МатрицаТовары.Ссылка.Дата <= &Дата
				   |	И МатрицаТовары.Ссылка.Проведен
				   |	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
				   |	И МатрицаТовары.Ссылка.ДатаОкончания >= &ДатаОкончания
				   |	И МатрицаТовары.Номенклатура = &Номенклатура ";
	
	//   |	И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункт";
	
	
	//нечаева 18,07,17++
	//@skip-check empty-except-statement
	Попытка
		//@skip-check reading-attribute-from-database
		Если Документ.ПостояннаяАкция Тогда
			Запрос.Текст = Запрос.Текст + " И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
			//крохин начало 28.07.2017
			//постоянные акции только под галку
		Иначе
			Запрос.Текст = Запрос.Текст + " И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция";
			//крохин конец 28.07.2017

		КонецЕсли;
	Исключение

	КонецПопытки;
	//нечаева 18,07,17---
	Запрос.Текст =Запрос.Текст + "
								 |УПОРЯДОЧИТЬ ПО
								 |	МатрицаТовары.Ссылка.Дата УБЫВ
								 |АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Контрагент", Документ.Контрагент);
	Запрос.УстановитьПараметр("Дата", КонецДня(Документ.Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", конецДня(Документ.Дата));
	Запрос.УстановитьПараметр("текПункт", Документ.ПунктДоставки);

	Выборка = запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураРезультата, Выборка);
	КонецЦикла;
	Возврат СтруктураРезультата;
КонецФункции

&НаСервереБезКонтекста
Функция ТекущийПользователь()	
	Возврат ПараметрыСеанса.Пользователь.ФизЛицо;  
КонецФункции
&НаСервере
Функция ПодборПоКоробамНаСервере()
	
	СписокТоваров=новый Массив();
	
	
	Запрос = Новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	СУММА(ЛистНабораТовары.Количество) КАК Количество,
	|	ЛистНабораТовары.Номенклатура,
	|	ЛистНабораТовары.Номенклатура.Код КАК КодТовара
	|ИЗ
	|	Документ.ЛистПереукладки.Товары КАК ЛистНабораТовары
	|ГДЕ
	|	ЛистНабораТовары.Ссылка.Дата >= &Дата
	|	И ЛистНабораТовары.Ссылка.Проведен
	|	И ЛистНабораТовары.Ссылка.ДокОснование = &ДокОснование
	|
	|СГРУППИРОВАТЬ ПО
	|	ЛистНабораТовары.Номенклатура";
	запрос.УстановитьПараметр("Дата",Константы.ДатаЗапретаВидимости.Получить());
	запрос.УстановитьПараметр("ДокОснование",СсылкаПоДокОбъекту());
	ТЗЛП=запрос.Выполнить().выгрузить();
	
	ТоварыПоДокОбРНК = ВернутьТоварыРНК();
	Для каждого СтрТЧ из ТоварыПоДокОбРНК цикл
		СтрЛП=ТЗЛП.Найти(СтрТЧ.Номенклатура);
		если СтрЛП<>Неопределено тогда
			Если СтрЛП.Количество>=СтрТЧ.Количество тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		если СтрТЧ.Количество=0 тогда Продолжить;КонецЕсли;
		СписокТоваров.Добавить(СтрТЧ.Номенклатура);
	КонецЦикла;
	
	Возврат СписокТоваров; 

КонецФункции
&НаКлиенте
Процедура ПослеВыбораНоменклатурыПоБлочкам(ВыбранноеЗначение,ДопПараметры) экспорт
	Если ВыбранноеЗначение = неопределено Тогда
		Возврат; 
	КонецЕсли;
	ТипВыбранногоЗначения = ТипЗнч(ВыбранноеЗначение);
	Если  ТипВыбранногоЗначения=Тип("Массив") Тогда
		
		Для каждого СтрМасс из ВыбранноеЗначение цикл
			СтрокаТЧ				=	Объект.СодержимоеБлочка.Добавить(); 
			СтрокаТЧ.Номенклатура	=	СтрМасс;
			СтрокаТЧ.Количество		=	1;
			СтрокаТЧ.Отметка = истина; 
			//@skip-check query-in-loop
			ЗаполнитьДопПоляПоНоменклатуреНаКлиенте(СтрокаТЧ);			 
			//@skip-check query-in-loop
			//ЗаполнитьidБлочка(СтрокаТЧ);
			ЗаполнитьidБлочканаКлиенте(СтрокаТЧ); 
		КонецЦикла; 
		
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораНоменклатурыПоКоробкам(ВыбранноеЗначение,ДопПараметры) экспорт
	Если ВыбранноеЗначение = неопределено Тогда
		Возврат; 
	КонецЕсли;
	ТипВыбранногоЗначения = ТипЗнч(ВыбранноеЗначение);
	Если  ТипВыбранногоЗначения=Тип("Массив") Тогда	
		//++Данилова Е.В. 01.06.2026 SNL-243
		КолВЛПСоответствие = ВернутьКоличествоЛППоМассиву(ВыбранноеЗначение); 
		//--Данилова Е.В. 01.06.2026 
		Для Каждого СтрМасс Из ВыбранноеЗначение Цикл
			СтрокаТЧ = Объект.Товары.Добавить();
			СтрокаТЧ.Номенклатура=СтрМасс;
			СтрокаТЧ.Количество=1;
			//@skip-check query-in-loop
			ТоварыНоменклатураПриИзмененииНаКлиенте(СтрокаТЧ,КолВЛПСоответствие);
		КонецЦикла;	
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзмененииНаКлиенте(СтрТЧобр,КолВЛПСоответствие)
	//++Данилова Е.В. 01.06.2026 SNL-243
	//СтрТЧобр.КоличествоВНакладной = ВернутьКоличествоВНакладной(СтрТЧобр.Номенклатура);
	//СтрТЧобр.КоличествоВЛП = ВернутьКоличествоЛП(СтрТЧобр.Номенклатура);
	СтрТЧобр.КоличествоВНакладной = ВернутьКоличествоВНакладнойНаКлиенте(СтрТЧобр.Номенклатура);	
    СтрТЧобр.КоличествоВЛП = ВернутьКоличествоЛПНаКлиенте(СтрТЧобр.Номенклатура,КолВЛПСоответствие); 
    //--Данилова Е.В. 01.06.2026 
	Если СтрТЧобр.КоличествоВЛП >= СтрТЧобр.КоличествоВНакладной Тогда
		СтрТЧобр.Отметка = Ложь;
	Иначе 
		СтрТЧобр.Отметка = Истина;
	КонецЕсли;
КонецПроцедуры
//++Данилова Е.В. 01.06.2026 SNL-243
&НаКлиенте
Функция ВернутьКоличествоВНакладнойНаКлиенте(Номенклатура)
	
	КоличествоПоНоменклатуре = ТоварыРНКСтруктура.ТоварыРНК.Получить(Номенклатура);
	Если КоличествоПоНоменклатуре = Неопределено Тогда
		Возврат 0; 
	Иначе
		Возврат КоличествоПоНоменклатуре;
	КонецЕсли;
КонецФункции

//&НаСервере
//Функция ВернутьКоличествоВНакладной(Номенклатура)
//
//	ТоварыПоДокОбРНК = ВернутьТоварыРНК();
//	СтрТЧНакл = ТоварыПоДокОбРНК.Найти(Номенклатура);
//	Если СтрТЧНакл = Неопределено Тогда
//		Возврат 0; 
//	Иначе
//		Возврат СтрТЧНакл.Количество;
//	КонецЕсли;
//КонецФункции // АА()

&НаСервере
Функция ВернутьКоличествоЛППоМассиву(МассивТоваров)

	Запрос = Новый запрос;
	запрос.Текст= "ВЫБРАТЬ
	|	СУММА(ЛистНабораТовары.Количество) КАК Количество,
	|	ЛистНабораТовары.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.ЛистПереукладки.Товары КАК ЛистНабораТовары
	|ГДЕ
	|	ЛистНабораТовары.Ссылка.Дата >= &Дата
	|	И ЛистНабораТовары.Ссылка.Проведен
	|	И ЛистНабораТовары.Номенклатура В (&МассивТоваров)
	|	И ЛистНабораТовары.Ссылка.ДокОснование = &ДокОснование
	|СГРУППИРОВАТЬ ПО
	|	ЛистНабораТовары.Номенклатура";
	запрос.УстановитьПараметр("Дата", Константы.ДатаЗапретаВидимости.Получить());
	запрос.УстановитьПараметр("МассивТоваров", МассивТоваров);
	запрос.УстановитьПараметр("ДокОснование", СсылкаПоДокОбъекту());
	Выборка = запрос.Выполнить().Выбрать(); 
	ТЧТоварыСоответствие = Новый Соответствие();
	Пока Выборка.Следующий() Цикл
		ТЧТоварыСоответствие.Вставить(Выборка.Номенклатура,Выборка.Количество); 
	КонецЦикла;
	Возврат ТЧТоварыСоответствие; 
	
КонецФункции

&НаКлиенте
Функция ВернутьКоличествоЛПНаКлиенте(Номенклатура, ЛПСоответствие)
	Если ЛПСоответствие.Получить(Номенклатура) <> Неопределено Тогда
		Возврат ЛПСоответствие.Получить(Номенклатура); 
	Иначе 
		Возврат 0; 
	КонецЕсли;
КонецФункции
 
//&НаСервере
//Функция ВернутьКоличествоЛП(Номенклатура)
//
//	Запрос = Новый запрос;
//	запрос.Текст= "ВЫБРАТЬ
//				  |	СУММА(ЛистНабораТовары.Количество) КАК Количество
//				  |ИЗ
//				  |	Документ.ЛистПереукладки.Товары КАК ЛистНабораТовары
//				  |ГДЕ
//				  |	ЛистНабораТовары.Ссылка.Дата >= &Дата
//				  |	И ЛистНабораТовары.Ссылка.Проведен
//				  |	И ЛистНабораТовары.Номенклатура = &Номенклатура
//				  |	И ЛистНабораТовары.Ссылка.ДокОснование = &ДокОснование";
//	запрос.УстановитьПараметр("Дата", Константы.ДатаЗапретаВидимости.Получить());
//	запрос.УстановитьПараметр("Номенклатура", Номенклатура);
//	запрос.УстановитьПараметр("ДокОснование", СсылкаПоДокОбъекту());
//	Результат=запрос.Выполнить().Выбрать();
//	Пока Результат.Следующий() Цикл
//		Возврат Результат.Количество;
//	КонецЦикла;
//	
//	Возврат 0; 
//
//КонецФункции // АА()

//--Данилова Е.В. 01.06.2026
	
&НаКлиенте
Процедура ЗаполнитьДопПоляПоНоменклатуреНаКлиенте(СтрокаТЧ)
	СтруктураДанных = ДопПоляПоНоменклатуреНаСервере(СтрокаТЧ.Номенклатура);  
	ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтруктураДанных); 	
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьДопПоляПоНоменклатуре(СтрокаТЧ)
	СтруктураДанных = ДопПоляПоНоменклатуреНаСервере(СтрокаТЧ.Номенклатура);  
	ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтруктураДанных); 	
КонецПроцедуры

&НаСервере  
Функция ДопПоляПоНоменклатуреНаСервере(Номенклатура)
	Запрос = новый Запрос;
	Запрос.текст = ТекстЗапросаРНКЛП();
	Запрос.УстановитьПараметр("Дата",Константы.ДатаЗапретаВидимости.Получить());
	Запрос.УстановитьПараметр("ДокОснование",СсылкаПоДокОбъекту()); 
	Запрос.УстановитьПараметр("ОтборПоНоменклатуре",Истина);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура); 
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	СтруктураДанных = Новый Структура("КоличествоВНакладной,КоличествоВЛП",0,0); 
		
	Если Выборка.Следующий() Тогда	
		СтруктураДанных.КоличествоВНакладной  = Выборка.КоличествоРНК; 	
	    СтруктураДанных.КоличествоВЛП		  = Выборка.КоличествоЛП;
	КонецЕсли; 
	
	Возврат СтруктураДанных; 
	
КонецФункции

//&НаСервере
//Процедура ЗаполнитьidБлочка(СтрокаТЧ)
//
//	//всегда будет следующий, если необходимо можно поменять вручную  
//	//Запрос = Новый Запрос;
//	//Запрос.Текст = 
//	//	"ВЫБРАТЬ
//	//	|	ВТСодержимое.id_Блочка КАК id_Блочка
//	//	|ПОМЕСТИТЬ ВТБлочки
//	//	|ИЗ
//	//	|	&СодержимоеБлочка КАК ВТСодержимое
//	//	|;
//	//	|
//	//	|////////////////////////////////////////////////////////////////////////////////
//	//	|ВЫБРАТЬ ПЕРВЫЕ 1
//	//	|	ВТБлочки.id_Блочка КАК id_Блочка
//	//	|ИЗ
//	//	|	ВТБлочки КАК ВТБлочки
//	//	|
//	//	|УПОРЯДОЧИТЬ ПО
//	//	|	ВТБлочки.id_Блочка УБЫВ";
//	//Запрос.УстановитьПараметр("СодержимоеБлочка",Объект.СодержимоеБлочка.Выгрузить(,"id_Блочка")); 
//	//РезультатЗапроса = Запрос.Выполнить();
//	//
//	//Если РезультатЗапроса.Пустой() Тогда
//	//	
//	//	СтрокаТЧ.id_Блочка = 1; 
//	//	
//	//	Возврат; 
//	//	
//	//КонецЕсли;
//	//
//	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	//
//	//Если ВыборкаДетальныеЗаписи.Следующий() Тогда
//	//	СтрокаТЧ.id_Блочка = ВыборкаДетальныеЗаписи.id_Блочка + 1;
//	//КонецЕсли;
//	//
//	
//	СтрокаТЧ.id_Блочка = ПолучитьidБлочка();
//	Отбор = Новый Структура("id_Блочка",СтрокаТЧ.id_Блочка);
//	СтрокаВсегоБлочков = Объект.ВсегоБлочков.НайтиСтроки(Отбор);
//	Если СтрокаВсегоБлочков.Количество() = 0  Тогда
//	
//		НоваяСтрока = Объект.ВсегоБлочков.Добавить(); 
//	    НоваяСтрока.id_Блочка = СтрокаТЧ.id_Блочка;  
//		
//	КонецЕсли;
//	
//	РассчитатьВсегоБлочков(СтрокаТЧ);  
//	
//КонецПроцедуры

&НаКлиенте
Процедура РассчитатьВсегоБлочковНаКлиенте(СтрокаРасчета,ДобавитьНовуюСтроку = Ложь)
    Отбор = Новый Структура("id_Блочка",СтрокаРасчета.id_Блочка);
	СтрокаВсегоБл = Объект.ВсегоБлочков.НайтиСтроки(Отбор); 
	Если СтрокаВсегоБл.Количество() > 0 Тогда
		
		Если СтрокаРасчета.Количество = 0 Тогда
			СтрокаВсегоБл[0].Количество = 0;
		Иначе 
			СтрокаВсегоБл[0].Количество = Окр(СтрокаРасчета.КоличествоВНакладной/СтрокаРасчета.Количество);	
			
		КонецЕсли;
		 	
	ИначеЕсли ДобавитьНовуюСтроку Тогда 
		
		НоваяСтрока = Объект.ВсегоБлочков.Добавить();
		НоваяСтрока.id_Блочка = СтрокаРасчета.id_Блочка; 
		Если СтрокаРасчета.Количество = 0 Тогда
			НоваяСтрока.Количество = 0;
		Иначе 
			НоваяСтрока.Количество = Окр(СтрокаРасчета.КоличествоВНакладной/СтрокаРасчета.Количество);	
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьidБлочканаКлиенте(СтрокаТЧ)    		
	
	СтрокаТЧ.id_Блочка = ПолучитьidБлочка();
	Отбор = Новый Структура("id_Блочка",СтрокаТЧ.id_Блочка); 
	СтрокаВсегоБлочков = Объект.ВсегоБлочков.НайтиСтроки(Отбор);
	Если СтрокаВсегоБлочков.Количество() = 0 Тогда
	
		НоваяСтрока = Объект.ВсегоБлочков.Добавить(); 
	    НоваяСтрока.id_Блочка = СтрокаТЧ.id_Блочка;  
		
	КонецЕсли;
	
	РассчитатьВсегоБлочковНаКлиенте(СтрокаТЧ);  
	
КонецПроцедуры



&НаСервере
Функция ПолучитьidБлочка()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТСодержимое.id_Блочка КАК id_Блочка
		|ПОМЕСТИТЬ ВТБлочки
		|ИЗ
		|	&СодержимоеБлочка КАК ВТСодержимое
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТБлочки.id_Блочка КАК id_Блочка
		|ИЗ
		|	ВТБлочки КАК ВТБлочки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТБлочки.id_Блочка УБЫВ";
	Запрос.УстановитьПараметр("СодержимоеБлочка",Объект.СодержимоеБлочка.Выгрузить(,"id_Блочка")); 
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		//СтрокаТЧ.id_Блочка = 1; 
		
		Возврат 1; 
		
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.id_Блочка + 1;
	КонецЕсли;


КонецФункции // ПолучитьidБлочка()

&НаСервере
Процедура РассчитатьВсегоБлочков(СтрокаРасчета,ДобавитьНовуюСтроку = Ложь,ОбновлятьКоличество = Истина)
    Отбор = Новый Структура("id_Блочка",СтрокаРасчета.id_Блочка);
	СтрокаВсегоБл = Объект.ВсегоБлочков.НайтиСтроки(Отбор); 
	Если СтрокаВсегоБл.Количество() > 0  Тогда
		
		Если СтрокаРасчета.Количество = 0 Тогда
			СтрокаВсегоБл[0].Количество = 0;
		
		ИначеЕсли ОбновлятьКоличество Тогда  
			
			СтрокаВсегоБл[0].Количество = Окр(СтрокаРасчета.КоличествоВНакладной/СтрокаРасчета.Количество);	
			
		КонецЕсли;
		 	
	ИначеЕсли ДобавитьНовуюСтроку Тогда 
		
		НоваяСтрока = Объект.ВсегоБлочков.Добавить();
		НоваяСтрока.id_Блочка = СтрокаРасчета.id_Блочка; 
		Если СтрокаРасчета.Количество = 0 Тогда
			НоваяСтрока.Количество = 0;
		Иначе 
			НоваяСтрока.Количество = Окр(СтрокаРасчета.КоличествоВНакладной/СтрокаРасчета.Количество);	
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 


&НаСервере
Функция ПодборПоБлочкамНаСервере(Накладная)
	Запрос = Новый Запрос;
	Запрос.текст = ТекстЗапросаРНКЛП();

	Запрос.УстановитьПараметр("Дата", Константы.ДатаЗапретаВидимости.Получить());
	Запрос.УстановитьПараметр("ДокОснование", Накладная.Ссылка);
	Запрос.УстановитьПараметр("ОтборПоНоменклатуре", Ложь);
	Запрос.УстановитьПараметр("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();

	МассивТоваров = Новый Массив;
	Пока Выборка.Следующий() Цикл
		МассивТоваров.Добавить(Выборка.Номенклатура);
	КонецЦикла;
	
	//++Данилова Е.В. 06.03.2026 
	МассивТоваров = ИсключитьВидыКомплектовАссорти(МассивТоваров);
		//--Данилова Е.В. 06.03.2026 
	Возврат МассивТоваров; 
КонецФункции
&НаСервере
Функция ИсключитьВидыКомплектовАссорти(Знач СписокТоваров)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НоменклатураСпр.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК НоменклатураСпр
	|ГДЕ
	|	НоменклатураСпр.Ссылка В(&СписокТоваров)
	|	И НЕ НоменклатураСпр.Родитель.ВидКомплекта = &Ассортито";

	Запрос.УстановитьПараметр("Ассортито", Перечисления.ВидыКомплектов.Ассортито);
	Запрос.УстановитьПараметр("СписокТоваров", СписокТоваров);

	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Номенклатура");
КонецФункции
&НаСервере
Функция ТекстЗапросаРНКЛП()

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СУММА(ЛистНабораТовары.Количество) КАК Количество,
	|	ЛистНабораТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ЛистыПереукладкиСозданнные
	|ИЗ
	|	Документ.ЛистПереукладки.Товары КАК ЛистНабораТовары
	|ГДЕ
	|	ЛистНабораТовары.Ссылка.Дата >= &Дата
	|	И ЛистНабораТовары.Ссылка.Проведен
	|	И ЛистНабораТовары.Ссылка.ДокОснование = &ДокОснование
	|	И ВЫБОР
	|			КОГДА &ОтборПоНоменклатуре
	|				ТОГДА ЛистНабораТовары.Номенклатура = &Номенклатура
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЛистНабораТовары.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	|	СУММА(РасходнаяНакладнаяТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ВтТовары
	|ИЗ
	|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	|ГДЕ
	|	РасходнаяНакладнаяТовары.Ссылка = &ДокОснование
	|	И ВЫБОР
	|			КОГДА &ОтборПоНоменклатуре
	|				ТОГДА РасходнаяНакладнаяТовары.Номенклатура = &Номенклатура
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходнаяНакладнаяТовары.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходнаяНакладнаяКомплектующие.Номенклатура КАК Номенклатура,
	|	СУММА(РасходнаяНакладнаяКомплектующие.Количество) КАК Количество
	|ПОМЕСТИТЬ ВтКомплектующие
	|ИЗ
	|	Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
	|ГДЕ
	|	РасходнаяНакладнаяКомплектующие.Ссылка = &ДокОснование
	|	И ВЫБОР
	|			КОГДА &ОтборПоНоменклатуре
	|				ТОГДА РасходнаяНакладнаяКомплектующие.Номенклатура = &Номенклатура
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходнаяНакладнаяКомплектующие.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтТовары.Номенклатура КАК Номенклатура,
	|	ВтТовары.Количество КАК Количество
	|ПОМЕСТИТЬ ВтТоварыРНК
	|ИЗ
	|	ВтТовары КАК ВтТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтКомплектующие КАК ВтКомплектующие
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ВтКомплектующие.Номенклатура ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВтКомплектующие.Номенклатура,
	|	ВтКомплектующие.Количество
	|ИЗ
	|	ВтКомплектующие КАК ВтКомплектующие
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтТоварыРНК.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ЛистыПереукладкиСозданнные.Количество, 0) КАК КоличествоЛП,
	|	ВтТоварыРНК.Количество КАК КоличествоРНК
	|ИЗ
	|	ВтТоварыРНК КАК ВтТоварыРНК
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЛистыПереукладкиСозданнные КАК ЛистыПереукладкиСозданнные
	|		ПО ВтТоварыРНК.Номенклатура = ЛистыПереукладкиСозданнные.Номенклатура
	|ГДЕ
	|	ВтТоварыРНК.Количество > 0";

	Возврат ТекстЗапроса;
КонецФункции // ТекстЗапросаРНКЛП()
#КонецОбласти