
Функция КонтрольПоРегиструСпайкиВПути(ДокСсылка, ЗаявкаНаПерепаковку) Экспорт
	
	ИмяДокумента = ДокСсылка.Метаданные().Имя;
	
	СтруктураОстатков = Новый Структура("ТаблицаОстатков, ТаблицаНехватки");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	Запрос.УстановитьПараметр("Дата", Новый Граница(ДокСсылка.Дата, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Заявка", ЗаявкаНаПерепаковку);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СпайкиВПутиОстатки.Номенклатура, Товары.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(Товары.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(СпайкиВПутиОстатки.КоличествоОстаток, 0) КАК СвободныйОстаток,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СпайкиВПутиОстатки.КоличествоОстаток, 0) < ЕСТЬNULL(Товары.Количество, 0)
	|			ТОГДА ЕСТЬNULL(Товары.Количество, 0) - ЕСТЬNULL(СпайкиВПутиОстатки.КоличествоОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Нехватка
	|ИЗ
	|	Документ." + ИмяДокумента + ".Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СпайкиВПути.Остатки(&Дата, Заявка = &Заявка) КАК СпайкиВПутиОстатки
	|		ПО Товары.Номенклатура = СпайкиВПутиОстатки.Номенклатура
	|ГДЕ
	|	Товары.Ссылка = &ДокСсылка";
	
	// 	" + ИмяДокумента + "
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ТаблицаНехватки = ТаблицаЗапроса.СкопироватьКолонки();
	Для Каждого Стр ИЗ ТаблицаЗапроса Цикл
		Если Стр.Нехватка > 0 Тогда
			ЗаполнитьЗначенияСвойств(ТаблицаНехватки.Добавить(), Стр);
		КонецЕсли;
	КонецЦикла;
	
	СтруктураОстатков.Вставить("ТаблицаОстатков", ТаблицаЗапроса);
	СтруктураОстатков.Вставить("ТаблицаНехватки", ТаблицаНехватки);
	
	Возврат СтруктураОстатков;
	
КонецФункции

// Шворобей ВЮ 11.12.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1254 
//////////////////////////////////////////////////////////////////////////////////
// Истина - Виртуальное, Ложь - Нет
Функция ВиртуальноеПеремещение(Склад, СкладПолучатель) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Склад) ИЛИ НЕ ЗначениеЗаполнено(СкладПолучатель) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СкладПолучатель.ФизическийСклад) И Склад = СкладПолучатель.ФизическийСклад Тогда
		Возврат Истина;
	ИначеЕсли ЗначениеЗаполнено(Склад.ФизическийСклад) И Склад.ФизическийСклад = СкладПолучатель Тогда
		Возврат Истина;
	ИначеЕсли ЗначениеЗаполнено(Склад.ФизическийСклад) И ЗначениеЗаполнено(СкладПолучатель.ФизическийСклад)
		И Склад.ФизическийСклад = СкладПолучатель.ФизическийСклад Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
// Шворобей ВЮ 11.12.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1254


// Функция - ВидПеремещения
//
// Параметры:
//  ДокСсылка	 - 	 ДокументСсылка.Перемещение 
// 
// Возвращаемое значение:
//   Строка - "Входящее", "Исходящее", "Виртуальное", "Транзитное"
//
Функция ВидПеремещения(ДокСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ	
	//Кто-то дописал))  https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-9331
	|	Ссылка,   
	//Валетов -
	|	IsNull(Склад.ФизическийСклад.Подразделение, Склад.Подразделение)						КАК Подразделение_Отправитель, 
	|	IsNull(СкладПолучатель.ФизическийСклад.Подразделение, СкладПолучатель.Подразделение)	КАК Подразделение_Получатель	
	|ИЗ
	|	Документ.Перемещение
	|ГДЕ
	|	Ссылка = &ДокСсылка
	|";	
	
	Результат = "Битое";
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
		ПодразделениеТекущегоУзла = ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла();
		Если Выборка.Подразделение_Отправитель = Выборка.Подразделение_Получатель Тогда
			Результат = "Виртуальное";
		ИначеЕсли Выборка.Подразделение_Отправитель = ПодразделениеТекущегоУзла Тогда
			Результат = "Исходящее";					
		ИначеЕсли Выборка.Подразделение_Получатель = ПодразделениеТекущегоУзла Тогда
			Результат = "Входящее";
		Иначе
			Результат = "Транзитное";
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ВидПеремещения(ДокСсылка) Экспорт