Перем НеКонтролироватьТА;
Перем НачСостНакладной;
//Кухарь 25.01.17 начало
перем НеКонтролироватьЗапись;
//Кухарь 25.01.17 конец
//++Данилова Е.В. 21.05.2026 MARK-3718 
Перем начПроведен; 
//--Данилова Е.В. 21.05.2026 

//Кухарь 11.01.19 начало
//Для отработки коррекция
//Кухарь 17.01.19 начало
//Для того чтобы некоторые реквизиты не перезаписывались
//Процедура ЗаписьБезКонтроляПолномочий ()   экспорт
Перем ТЗНеизменяемыхРеквизитов;



Процедура ЗаписьБезКонтроляПолномочий (ТЗПараметров=Неопределено)   экспорт
	ТЗНеизменяемыхРеквизитов=ТЗПараметров;
	//Кухарь 17.01.19 конец
	
	если дата>ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования() тогда
		НеКонтролироватьЗапись = Истина;
	иначе
		НеКонтролироватьЗапись = ложь;
	КонецЕсли;	
	Записать(?(Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
	НеКонтролироватьЗапись = Ложь;	
КонецПроцедуры
//Кухарь 11.01.19 конец


Процедура ПеренестиРезерв() Экспорт
	НеКонтролироватьТА=Истина;
	Записать(?(Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
	НеКонтролироватьТА=Ложь;
КонецПроцедуры 

Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,Записывать=Ложь)
	Для Каждого НаборДвижений Из ДвиженияПоРегистрам Цикл
		ИмяРегистра		=НаборДвижений.Ключ;
		ТаблицаДвижения =НаборДвижений.Значение;
		
		Если Движения.Найти(ИмяРегистра)=Неопределено Тогда Возврат  КонецЕсли; 
		
		НаборЗаписей=Движения[ИмяРегистра];		
		НаборЗаписей.Очистить();
		
		Для Каждого Движение Из ТаблицаДвижения Цикл
			Запись=НаборЗаписей.Добавить();	
			ЗаполнитьЗначенияСвойств(Запись,Движение);	
			
			Запись.Регистратор=Ссылка;
		КонецЦикла;	
		
		Если Записывать Тогда
			НаборЗаписей.Записать();		
		КонецЕсли; 
	КонецЦикла;	
КонецПроцедуры 


//Нечаева 11,02,26 ++++  MARK-3466 
Функция ПроверитьТоварНаНаличиеГТИН() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст  = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЗ.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	&Товары КАК ТЗ
	|ГДЕ
	|	ТЗ.Количество > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ.Номенклатура КАК Номенклатура
	|ИЗ
	|	ТЗ КАК ТЗ
	|ГДЕ
	|	ТЗ.Номенклатура.ГТИН = """" 
	|	И ТЗ.Номенклатура.Родитель.ВидНоменклатуры = значение (Перечисление.ВидыНоменклаутры.Товар)";    
	запрос.УстановитьПараметр("Товары",Товары); 

	МассивНоменклатуры=Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");	
	Если МассивНоменклатуры.Количество()> 0 Тогда
		
		//Список номенклатуры сказали не нужен	
		//сообщить("Есть товары без GTIN!"+символы.ПС+СтрСоединить(МассивНоменклатуры,Символы.ПС)); 		 
		сообщить("Есть товары без GTIN!"); 
		
		возврат 1;
	КонецЕсли;	
	
	возврат 0;
	
КонецФункции
//Нечаева 11,02,26 ----   MARK-3466



//СОБЫТИЯ ОБЪЕКТА
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//+++Чирков 12.12.2025 - перенос начала замера в документ
	ДополнительныеСвойства.Вставить("Начало", ТекущаяУниверсальнаяДатаВМиллисекундах());	
	//---Чирков 12.12.2025 - перенос начала замера в документ
	
	//Кухарь 25.01.17 начало
	если НеКонтролироватьЗапись=Неопределено тогда
		НеКонтролироватьЗапись=ложь;
	КонецЕсли;
	//Кухарь 25.01.17 конец
	
	
	// Кухарь А.Ю.  12.08.2024 начало
	ТекущееПодразделение=ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла(); 
	// Кухарь А.Ю.  12.08.2024 конец
	
	#Если КЛИЕНТ Тогда
		//Кухарь 25.01.17 начало
		если не НеКонтролироватьЗапись тогда;
			//Кухарь 25.01.17 конец
			
			 // Кухарь А.Ю. 12.02.2020 начало
			 //Блокировку в ЗНБ перенесли
			 // СписокДоступныхСостояний = ПроверитьБлокировкуВыдачейВНабор(Ссылка);
			   СписокДоступныхСостояний=Неопределено;
			 // Кухарь А.Ю. 12.02.2020 конец

			если СписокДоступныхСостояний <> Неопределено тогда
				если СписокДоступныхСостояний.найти(ЭтотОбъект.Ссылка.получитьобъект().состояниенакладной) = Неопределено и ЭтотОбъект.Ссылка.получитьобъект().состояниенакладной<> Перечисления.СостоянияНакладной.Отгружена тогда
					Сообщить("Накладная заблокирована для изменений документом: Блокировка выдачи в набор");
					отказ=Истина;
				ИначеЕсли 	СписокДоступныхСостояний.найти(ЭтотОбъект.состояниенакладной) = Неопределено и ЭтотОбъект.состояниенакладной<> Перечисления.СостоянияНакладной.Отгружена тогда
					Сообщить("Накладную нельзя записать в текущем статусе. Данный статус накладной запрещён документом: Блокировка выдачи в набор");
					отказ=Истина;
				КонецЕсли;
			КонецЕсли;
			//кухарь 23.04.14 конец		
			Если
				//крохин начало	31.03.2011
				//в филиалах тоже редактируем ПРМ только на текущую дату
				//	ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение 
				(ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение 
				ИЛИ ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение)
				//крохин конец 	31.03.2011
				И Отгружен=Перечисления.Отгружен.Резерв 
				И СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе 
				И РежимЗаписи=РежимЗаписиДокумента.Проведение
				И Дата<ТекущаяДата()	
				И НеКонтролироватьТА=Ложь 
				И НЕ ПараметрыСеанса.ОтключитьКонтрольРезервов
				Тогда
				
				//Кухарь 27.11.18 начало
				//Поставим через 10 сек. закрытие вопроса
				//Ответ=Вопрос("Резервные накладные корректируются только на текущую дату ! Изменить дату на текущую ?",РежимДиалогаВопрос.ОКОтмена);
				Ответ=Вопрос("Резервные накладные корректируются только на текущую дату ! Изменить дату на текущую ?",РежимДиалогаВопрос.ОКОтмена,10);
				//Кухарь 27.11.18 конец	
				Если Ответ=КодВозвратаДиалога.ОК Тогда
					//крохин начало 08.01.2019
					//надо менять номер при смене года
					//Дата					=ТекущаяДата();
					мТекущаяДатаДокумента = Дата;
					Дата					=ТекущаяДата();
					Если ПроверитьНомерДокумента(ЭтотОбъект, мТекущаяДатаДокумента) Тогда		
						мТекущаяДатаДокумента	=Дата;			
					Иначе		
						Дата					=мТекущаяДатаДокумента;
					КонецЕсли;
					//крохин конец 08.01.2019
				Иначе
					//Кухарь 04.12.18 начало
					//Поставим через 10 сек. закрытие вопроса
					Сообщить("Истёк таймаут вопроса на смену даты.");
					//Кухарь 04.12.18 конец	
					
					Отказ=Истина;					
					Возврат;		
				КонецЕсли;		
			КонецЕсли;
			
			
			// Нечаева ++ 10.12.13
			Если НЕ ЭтоНовый() И НЕ ПолучитьПолномочиеПользователя("РедактированиеОтгруженныхНакладных") и  Отгружен = Перечисления.Отгружен.Отгружен
				//  филиалы и ТЦ
				и ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение
				// кроме виртуальных перемещений
				и НЕ (СкладПолучатель.ВидСклада=перечисления.ВидСклада.Виртуальный или Склад.ВидСклада=перечисления.ВидСклада.Виртуальный)
				// отмена проведения 
				и (режимЗаписи = РежимЗаписиДокумента.ОтменаПроведения 
				//пометка удаления
				или ПометкаУдаления=Истина)
				Тогда
				сообщить("У вас нет прав!");
				Отказ=Истина;
			Конецесли;
			// нечаева ---  10.12.13
			
			
			//Нечаева 11,02,26++++  MARK-3466
			// проверяем, что у всего товара в ПРМ есть ГТИН, если с немаркированного на маркированый.
			//Нечаева 02,04,26  поменяли проверку на только резервные MARK-3626
			Если  ссылка.Отгружен =Перечисления.Отгружен.Резерв
				и (НЕ Склад.ЭтоСкладМаркированногоТовара) и (СкладПолучатель.ЭтоСкладМаркированногоТовара)  Тогда
			  		
			    ПрЕстьВсеГтин = ПроверитьТоварНаНаличиеГТИН();
				 // Если ПрЕстьВсеГтин <>0 Тогда  не все ГТИН есть 
				 							//Нечаева 02,04,26  поменяли проверку на только резервные MARK-3626
                Если ПрЕстьВсеГтин <>0 и НЕ ( Отгружен = Перечисления.Отгружен.Резерв)Тогда
					Сообщить("Сохранение возможно только в состоянии - в работе."); 
					//Отгружен=Перечисления.Отгружен.Резерв;
					//СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
					Отказ = истина;
				КонецЕсли;
				
			КонецЕсли;
			//Нечаева 11,02,26 ----  MARK-3466

			
			// Шворобей ВЮ 27.11.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-1354
			////Кухарь А.Ю.  20.01.2025 начало
			////Пока удалил, чтобы каждый раз при сравнении не удалять в живых базах
			// 
			//
			//
			//Если Склад.ВидСклада = Перечисления.ВидСклада.Виртуальный
			//	ИЛИ СкладПолучатель.ВидСклада = Перечисления.ВидСклада.Виртуальный Тогда
			//	
			//	Запрос = Новый Запрос;
			//	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
			//	
			//	Если СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена И СостояниеНакладной <> Ссылка.СостояниеНакладной Тогда
			//		Запрос.Текст =
			//		"ВЫБРАТЬ РАЗЛИЧНЫЕ
			//		|	ДоступныеСклады.Склад КАК Склад
			//		|ИЗ
			//		|	Справочник.Пользователи.ДоступныеСклады КАК ДоступныеСклады
			//		|ГДЕ
			//		|	ДоступныеСклады.Ссылка = &Пользователь
			//		|	И НЕ ДоступныеСклады.Склад ЕСТЬ NULL
			//		|	И ДоступныеСклады.Склад.Наименование <> ""<Объект не найден> (""
			//		|	И ДоступныеСклады.ОтгрузкаСоСклада
			//		|	И ДоступныеСклады.Склад.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ВидСклада.Виртуальный)";
			//	
			//		УстановитьПривилегированныйРежим(Истина);
			//		МассивСкладовОтгрузки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Склад");;
			//		УстановитьПривилегированныйРежим(Ложь);
			//	
			//		Если МассивСкладовОтгрузки.Количество() > 0 Тогда
			//			//++Данилова Е.В. 14.01.2025
			//			//Если МассивСкладовОтгрузки.Найти(Склад) = Неопределено Тогда
			//			//	Сообщить("У вас нет прав отгружать со склада " + Строка(Склад) + "!");
			//			//	Отказ = Истина;
			//			//КонецЕсли;
			//			Если СкладПолучатель.ВидСклада = Перечисления.ВидСклада.Виртуальный
			//				И МассивСкладовОтгрузки.Найти(СкладПолучатель) = Неопределено Тогда
			//				Сообщить("У вас нет прав отгружать со склада " + Строка(СкладПолучатель) + "!");
			//				Отказ = Истина;
			//			КонецЕсли;
			//			
			//			Если Склад.ВидСклада = Перечисления.ВидСклада.Виртуальный
			//				И МассивСкладовОтгрузки.Найти(Склад) = Неопределено Тогда
			//				Сообщить("У вас нет прав отгружать со склада " + Строка(Склад) + "!");
			//				Отказ = Истина;
			//			КонецЕсли;
			//			//--Данилова Е.В. 14.01.2025
			//		КонецЕсли;
			//	
			//	ИначеЕсли СостояниеНакладной = Перечисления.СостоянияНакладной.Принята И СостояниеНакладной <> Ссылка.СостояниеНакладной Тогда
			//		Запрос.Текст =
			//		"ВЫБРАТЬ РАЗЛИЧНЫЕ
			//		|	ДоступныеСклады.Склад КАК Склад
			//		|ИЗ
			//		|	Справочник.Пользователи.ДоступныеСклады КАК ДоступныеСклады
			//		|ГДЕ
			//		|	ДоступныеСклады.Ссылка = &Пользователь
			//		|	И НЕ ДоступныеСклады.Склад ЕСТЬ NULL
			//		|	И ДоступныеСклады.Склад.Наименование <> ""<Объект не найден> (""
			//		|	И ДоступныеСклады.ПриемкаНаСклад
			//		|	И ДоступныеСклады.Склад.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ВидСклада.Виртуальный)";
			//		
			//		УстановитьПривилегированныйРежим(Истина);
			//		МассивСкладовПриемки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Склад");
			//		УстановитьПривилегированныйРежим(Ложь);
			//	
			//		Если МассивСкладовПриемки.Количество() > 0 Тогда
			//			Если МассивСкладовПриемки.Найти(СкладПолучатель) = Неопределено Тогда
			//				Сообщить("У вас нет прав отгружать со склада " + Строка(СкладПолучатель) + "!");
			//				Отказ = Истина;
			//			КонецЕсли;
			//		КонецЕсли;
			//		
			//	КонецЕсли;
			//	
			//КонецЕсли;
			////Кухарь А.Ю.  20.01.2025 конец

			// Шворобей ВЮ 27.11.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-1354
			
			//Кухарь 25.01.17 начало
		КонецЕсли;
		//Кухарь 25.01.17 конец
		
	#КОНЕЦЕСЛИ
	
	НачСостНакладной=Ссылка.СостояниеНакладной;	
	// Кухарь А.Ю.  01.08.2024 начало
	НачПроведен=ссылка.Проведен; 
	// Кухарь А.Ю.  01.08.2024 конец
	
	
	ЕстьИзменения	=Модифицированность();	
	НужноВыгружать	=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	
	Если НЕ ОбменДанными.Загрузка Тогда
		//Кухарь 25.01.17 начало
		если не НеКонтролироватьЗапись тогда
			//Кухарь 25.01.17 конец
			
			КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
			МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
			МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);
			
			// Кухарь А.Ю. 11.11.2021 начало
			//Запрет на запись без контрагента ПРМ на отв. хранение
			если (склад.ТипСклада=Перечисления.ТипСклада.ПалетноеХранение или СкладПолучатель.ТипСклада=Перечисления.ТипСклада.ПалетноеХранение) 
				и не ЗначениеЗаполнено(Контрагент) 
				тогда
				СообщитьИзМодуля("Заполните контрагента");
				отказ=Истина;
			КонецЕсли;
			// Кухарь А.Ю. 11.11.2021 конец
			
			//Кухарь 25.01.17 начало
		КонецЕсли;
		//Кухарь 25.01.17 конец
		
		Если Отказ Тогда Возврат КонецЕсли;		
		
		Если ЕстьИзменения Тогда //Чирков - 03.10.12 - не фига это все пересчитывать при загрузке		
			ГруппыТоваров	=ГруппыТоваровДокумента(ЭтотОбъект);
			//крохин начало
			Если Дата >= '20101001' Тогда
				СекторХранения = СекторХраненияДокумента(ЭтотОбъект);
			КонецЕсли;
			//крохин конец
			//Кухарь 29.03.17
			//Паллетирование будет ставится по галке в складе получателе
			если ЭтоНовый() тогда
				НужноПаллетирование=СкладПолучатель.НужноПаллетирование;
				//Кухарь 27.12.17 начало
				//Термоусадка
				НужнаТермоусадка=СкладПолучатель.НужнаТермоусадка;
				//Кухарь 27.12.17 конец				
			КонецЕсли;
			//Кухарь 29.03.17 конец
			
		КонецЕсли;
		// Кухарь А.Ю.  01.08.2024 начало
		//
		ПроверятьМарки = Ложь;
		
		Если Не ЭтоНовый() Тогда
			
			// Кельманов А.В. - HELP-2442 - 2024.12.26 {
			//ВозможнаРаботаСМаркировкой = ОпределитьНеобходимостьМаркировкиПоНакладной(Ссылка);
			//Если ВозможнаРаботаСМаркировкой Тогда
			//	ПроверятьМарки = ПолучитьРеквизитШапки(Ссылка, "СкладПолучатель.Организация.ОрганизацияНашейКомпании");
			//КонецЕсли;
			СтруктураПараметров = Новый Структура();
			
			СтруктураПараметров.Вставить("ВидНакладной", "Перемещение");
			СтруктураПараметров.Вставить("Склад", Склад);
			СтруктураПараметров.Вставить("СкладПолучатель", СкладПолучатель);
			СтруктураПараметров.Вставить("Склад_КодФизическогоУзла", Склад.КодФизическогоУзла);
			СтруктураПараметров.Вставить("СкладПолучатель_КодФизическогоУзла", СкладПолучатель.КодФизическогоУзла);
			
			ВозможнаРаботаСМаркировкой = ОпределитьНеобходимостьМаркировкиПоНакладной(СтруктураПараметров);
			
			Если ВозможнаРаботаСМаркировкой Тогда
				ПроверятьМарки = ПолучитьРеквизитШапки(СкладПолучатель, "Организация.ОрганизацияНашейКомпании");
			КонецЕсли;
			// Кельманов А.В. - HELP-2442 - 2024.12.26 }
			
		КонецЕсли;		
		

		
		//Кухарь А.Ю. начало  03.02.2025 начало
		//У отгруженных не зачем пересчитывать
		// ТребуетсяМаркировка=МаркировкаКС.ОпределитьЗначениеТребуетсяМаркировкаВДокументе(ЭтотОбъект,,,ПроверятьМарки);
		//++Данилова Е.В. 30.10.2025 HELP-7587 
		//Если Отгружен = Перечисления.Отгружен.Резерв  тогда 
		Если Отгружен = Перечисления.Отгружен.Резерв 
			ИЛИ ЭтоНовый()  тогда
			//--Данилова Е.В. 30.10.2025
			ТребуетсяМаркировка=МаркировкаКС.ОпределитьЗначениеТребуетсяМаркировкаВДокументе(ЭтотОбъект,,,ПроверятьМарки);			
		КонецЕсли;
		//Кухарь А.Ю. начало  03.02.2025 конец

		
		//++Данилова Е.В. 21.05.2026 MARK-3718 перенесено создание ХКМ 
		// при записи 
		
		// Кухарь А.Ю.  15.01.2025 начало
		// если ТребуетсяМаркировка тогда
		//	если ТребуетсяМаркировка и Дата>='20250101' тогда		 
		// Кухарь А.Ю.  15.01.2025 конец
		
		// Кухарь А.Ю.  06.08.2024 начало
			//
	//		если ЭтоУзелОтправителя() тогда   
	//			// Кухарь А.Ю.  06.08.2024 конец
	//			
	//			если (НачСостНакладной<>Перечисления.СостоянияНакладной.ГотоваКОтгрузке
	//				и НачСостНакладной<>Перечисления.СостоянияНакладной.Отгружена) или НачПроведен=Ложь
	//				// Кухарь А.Ю.  12.08.2024 начало
	//				 или не Документы.ХранилищеКодовМаркировки.ПроверитьНаличиеХКМ(Ссылка,Перечисления.ПланФакт.Факт,ТекущееПодразделение)
	//				 // Кухарь А.Ю.  12.08.2024 конец
	//				
	//				тогда
	//				
	//				если (СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке 
	//					или  СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена) 
	//					тогда
	//					//Валетов+ 14,01,25 Перемещения из Офиса на склад с непромаркированным товаром.
	//					Если (ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение  ИЛИ ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.Склад)
	//						И ОбщегоНазначения_ПИ.ЕстьЛН(Ссылка) 
	//						И НЕ ОбщегоНазначения_ПИ.ЕстьЛНСМаркировкой(Ссылка) Тогда
	//						СообщитьИзМодуля("Нет ЛН с отсканированным маркированным товаром. ХКМ Создан не будет!");
	//					//Валетов + 23,07,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-6141							
	//					ИначеЕсли (ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение  ИЛИ ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.Склад)
	//						И НЕ ОбщегоНазначения_ПИ.ЕстьЛН(Ссылка) 
	//						И НЕ ОбщегоНазначения_ПИ.ЕстьЛНСМаркировкой(Ссылка) Тогда
	//						//В ЦО нет никаких ЛН, ни с марками ни без марок. ХКМ создавать не из чего.
	//					//Валетов -
	//					Иначе
	//					//Валетов-
	//
	//					// Кухарь А.Ю.  23.07.2025 начало
	//					//HELP-6139
	//					//РеквизитыНакладной = ПолучитьРеквизитыШапки(Ссылка, "Склад,СкладПолучатель,Склад.КодФизическогоУзла,СкладПолучатель.КодФизическогоУзла", "Документ");		
	//					РеквизитыНакладной = ПолучитьРеквизитыШапки(Ссылка, "Склад,СкладПолучатель,Склад.КодФизическогоУзла,СкладПолучатель.КодФизическогоУзла
	//					|,Склад.КарантинЧЗ,СкладПолучатель.КарантинЧЗ", "Документ");	
	//					
	//					если РеквизитыНакладной.Склад_КарантинЧЗ = Истина или  РеквизитыНакладной.СкладПолучатель_КарантинЧЗ = Истина тогда
	//						РаботаСКарантином = Истина;
	//					иначе
	//						РаботаСКарантином = ложь;
	//					КонецЕсли;
	//					// Кухарь А.Ю.  23.07.2025 конец
	//					
	//					Если РеквизитыНакладной.СкладПолучатель_КодФизическогоУзла=""  тогда
	//						РеквизитыНакладной.СкладПолучатель_КодФизическогоУзла="SNL";
	//					КонецЕсли;
	//					Если РеквизитыНакладной.Склад_КодФизическогоУзла=""  тогда
	//						РеквизитыНакладной.Склад_КодФизическогоУзла="SNL";
	//					КонецЕсли;							
	//					// Кухарь А.Ю.  23.07.2025 начало
	//					//HELP-6139
	//					//Если РеквизитыНакладной.СкладПолучатель_КодФизическогоУзла <> РеквизитыНакладной.Склад_КодФизическогоУзла Тогда 
	//					Если РеквизитыНакладной.СкладПолучатель_КодФизическогоУзла <> РеквизитыНакладной.Склад_КодФизическогоУзла или РаботаСКарантином Тогда 
	//						// Кухарь А.Ю.  23.07.2025 конец
	//		
	//						РезультатРаботыСХКМ=Документы.ХранилищеКодовМаркировки.Создать_ХКМ_к_РНК(Ссылка);	
	//						если не РезультатРаботыСХКМ.Успешно тогда
	//							РезультатРаботыСХКМ.Ошибки.Добавить("Не удалось создать хранилище кодов маркировки");
	//							СообщитьИзМодуля(СтрСоединить(РезультатРаботыСХКМ.Ошибки,","));
	//							отказ=Истина;	
	//						КонецЕсли;							
	//					КонецЕсли;			
	//					// Кухарь А.Ю.  11.03.2025 конец

	//					КонецЕсли;
	//				КонецЕсли;				
	//			ИначеЕсли НачСостНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке
	//				или НачСостНакладной=Перечисления.СостоянияНакладной.Отгружена
	//				тогда
	//				
	//				если СостояниеНакладной<>Перечисления.СостоянияНакладной.ГотоваКОтгрузке 
	//					и  СостояниеНакладной<>Перечисления.СостоянияНакладной.Отгружена
	//					тогда
	//					РезультатРаботыСХКМ=Документы.ХранилищеКодовМаркировки.Отменить_ХКМ_к_НАК(Ссылка,Перечисления.ПланФакт.Факт);				 		
	//					если не РезультатРаботыСХКМ.Успешно тогда
	//						РезультатРаботыСХКМ.Ошибки.Добавить("Не удалось создать хранилище кодов маркировки");
	//						СообщитьИзМодуля(СтрСоединить(РезультатРаботыСХКМ.Ошибки,","));
	//						отказ=Истина;
	//					КонецЕсли;
	//					
	//				КонецЕсли;
	//				
	//			КонецЕсли;
	//		//Валетов + 10,04,2025 Формирование ХКМ в базе Еката При Приемке ПРМ 
	//		//https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4117	
	//		ИначеЕсли ЭтоУзелПолучателя() 
	//			И СостояниеНакладнойУПолучателя = Перечисления.СостоянияНакладной.Принята
	//			И ОбщегоНазначения_ПИ.ЕстьЛНСМаркировкой(Ссылка)
	//			И не Документы.ХранилищеКодовМаркировки.ПроверитьНаличиеХКМ(Ссылка,Перечисления.ПланФакт.Факт,ТекущееПодразделение)
	//			//Валетов+ 24,06,2025 Возвраты с ТЦ, маркированный товар
	//			//https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5488 
	//			//Было
	//			//И ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.ТорговоеПодразделение
	//			И НЕ ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение				
	//			//Валетов-
	//			Тогда
	//			
	//			РеквизитыНакладной = ПолучитьРеквизитыШапки(Ссылка, "Склад,СкладПолучатель,Склад.КодФизическогоУзла,СкладПолучатель.КодФизическогоУзла", "Документ");
	//			Если РеквизитыНакладной.СкладПолучатель_КодФизическогоУзла=""  тогда
	//				РеквизитыНакладной.СкладПолучатель_КодФизическогоУзла="SNL";
	//			КонецЕсли;
	//			Если РеквизитыНакладной.Склад_КодФизическогоУзла=""  тогда
	//				РеквизитыНакладной.Склад_КодФизическогоУзла="SNL";
	//			КонецЕсли;							
	//			Если РеквизитыНакладной.СкладПолучатель_КодФизическогоУзла <> РеквизитыНакладной.Склад_КодФизическогоУзла 
	//				//Валетов+ 24,06,2025 Возвраты с ТЦ, маркированный товар  https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5488	
	//				И РеквизитыНакладной.СкладПолучатель_КодФизическогоУзла = ПараметрыСеанса.ЭтотУзел.Код 
	//				//Валетов-
	//				Тогда 
	//			//Валетов +  15,04,2025 Добавил смену ХКМ на План, если узел создания не текущий.
	//			//https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4246
	//				Запрос = Новый Запрос;
	//				Запрос.Текст = "ВЫБРАТЬ
	//				               |	ХранилищеКодовМаркировки.Ссылка КАК Ссылка
	//				               |ИЗ
	//				               |	Документ.ХранилищеКодовМаркировки КАК ХранилищеКодовМаркировки
	//				               |ГДЕ
	//				               |	ХранилищеКодовМаркировки.ДокОснование = &ДокОснование
	//				               |	И ХранилищеКодовМаркировки.ПланФакт = &ПланФакт
	//				               |	И ХранилищеКодовМаркировки.КодУзлаСоздания <> &КодЭтогоУзла";	
	//				Запрос.УстановитьПараметр("ДокОснование",	Ссылка);
	//				Запрос.УстановитьПараметр("ПланФакт",		Перечисления.ПланФакт.Факт);
	//				Запрос.УстановитьПараметр("КодЭтогоУзла",	ПараметрыСеанса.ЭтотУзел.Код);
	//				
	//				Выборка = Запрос.Выполнить().Выбрать();	
	//				Пока Выборка.Следующий() Цикл
	//						ДокОбъектХКМ = Выборка.Ссылка.ПолучитьОбъект();
	//						ДокОбъектХКМ.ПланФакт = Перечисления.ПланФакт.План;
	//						ДокОбъектХКМ.ОбменДанными.Загрузка	= Истина;
	//						
	//						ДокОбъектХКМ.Записать();		
	//				КонецЦикла;
	//			//Валетов - 
	//				РезультатРаботыСХКМ=Документы.ХранилищеКодовМаркировки.Создать_ХКМ_к_ПНК_Факт(Ссылка);	
	//				если не РезультатРаботыСХКМ.Успешно тогда
	//					РезультатРаботыСХКМ.Ошибки.Добавить("Не удалось создать хранилище кодов маркировки");
	//					СообщитьИзМодуля(СтрСоединить(РезультатРаботыСХКМ.Ошибки,","));
	//					отказ=Истина;	
	//				КонецЕсли;							
	//			КонецЕсли;
	//		//Валетов -
	//		
	//			// Кухарь А.Ю.  06.08.2024 начало
	//			//
	//		КонецЕсли;
	//		// Кухарь А.Ю.  06.08.2024 конец
	//		
		//КонецЕсли;
		// Кухарь А.Ю.  01.08.2024 конец
		//--Данилова Е.В. 21.05.2026
		
	КонецЕсли; 
	 
	
	Если ЕстьИзменения Тогда //Чирков - 25.10.12 - не трогать
		СуммаДокумента		= Товары.Итог("Всего");
		ОбъемДокумента		= Товары.Итог("Объем");	
		КоличествоДокумента = Товары.Итог("Количество");
		
		ПроверитьСоответствиеЗаявке(ЭтотОбъект);
	КонецЕсли;
	//Кухарь 24.12.19 начало
	//Перенос ПН и ЗНБ только при переносе резервов либо при изменении даты накладной вручную
	// Кухарь А.Ю. 27.02.2022 начало
	//  если дата <> Ссылка.Дата и не ЭтоНовый() или отгружен=Перечисления.Отгружен.Отгружен  тогда
	если дата <> Ссылка.Дата и не ЭтоНовый() или отгружен=Перечисления.Отгружен.Отгружен   тогда
		
		
		// Кухарь А.Ю. 27.02.2022 конец
		
		//Кухарь 24.12.19 конец	 	
		
		//крохин начало 31.10.2013
		//корректируем дату плана набора
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПланНабора.Ссылка
		|ИЗ
		|	Документ.ПланНабора КАК ПланНабора
		
		|ГДЕ
		|	ПланНабора.ДокОснование = &ДокОснование
		|	И ПланНабора.Проведен";
		запрос.УстановитьПараметр("ДокОснование",Ссылка);
		
		Выборка = запрос.Выполнить().Выбрать();
		//крохин начало 17.12.2013
		//для новых не меняем, + переменная от двойной записи
		//Если Выборка.Следующий() Тогда
		Записывать = Ложь;
		Если Выборка.Следующий() И НЕ Ссылка.Пустая() Тогда	
			//крохин конец 17.12.2013	
			ПланНабора = Выборка.Ссылка;
			ДокОбъект = ПланНабора.ПолучитьОбъект();
			Если НачалоДня(Дата) <> НачалоДня(ДокОбъект.Дата) Тогда
				ДокОбъект.Дата = Дата;
				//крохин начало 17.12.2013
				//переменная от двойной записи
				//ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Записывать = Истина;
				//крохин конец 17.12.2013
			КонецЕсли;
			//крохин начало 17.12.2013
			//меняем состояния строк на "отгружен" при отгрузке
			//Кухарь 28.10.15 начало
			//Новый склад
			//Если ПараметрыСеанса.ЭтотУзел.код = "ODN" И Отгружен = Перечисления.Отгружен.Отгружен Тогда
			Если (ПараметрыСеанса.ЭтотУзел.код = "ODN" или ПараметрыСеанса.ЭтотУзел.код = "OD7") И Отгружен = Перечисления.Отгружен.Отгружен Тогда
				
				//Кухарь 28.10.15 конец	
				Для Каждого СтрокаТЧ Из ДокОбъект.тБрэндов Цикл
					Если СтрокаТЧ.состояние <> Перечисления.СостоянияНакладной.Отгружена Тогда
						СтрокаТЧ.состояние = Перечисления.СостоянияНакладной.Отгружена;
						Записывать = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Если Записывать Тогда
				// Кухарь А.Ю. 27.02.2022 начало
				// ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
				ДокОбъект.ЗаписатьБезОбработки(РежимЗаписиДокумента.Запись);		 
				// Кухарь А.Ю. 27.02.2022 конец			
			КонецЕсли;
			// Кухарь А.Ю. 24.12.2019 начало
			//Перенос ПН и ЗНБ только при переносе резервов либо при изменении даты накладной вручную
			Запрос=новый запрос;
			запрос.Текст=			"ВЫБРАТЬ
			|	ЗаданиеНабора.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ЗаданиеНабора КАК ЗаданиеНабора
			|ГДЕ
			|	ЗаданиеНабора.Проведен
			|	И ЗаданиеНабора.Дата >= &Дата
			|	И ЗаданиеНабора.Накладная = &Накладная";
			запрос.УстановитьПараметр("Накладная",Ссылка);
			запрос.УстановитьПараметр("Дата",НачалоДня(Ссылка.Дата));
			результат=запрос.Выполнить().Выбрать();
			пока результат.Следующий() цикл
				ЗНБОбъект=результат.ссылка.получитьобъект();
				ЗНБОбъект.дата=дата;
				если СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена и ЗНБОбъект.СостояниеНакладной<>СостояниеНакладной тогда
					ЗНБОбъект.СостояниеНакладной=СостояниеНакладной;
				КонецЕсли;				
				ЗНБОбъект.записать(РежимЗаписиДокумента.Проведение);			
			КонецЦикла;
		КонецЕсли;
		// Кухарь А.Ю. 24.12.2019 конец
		
		//крохин конец 17.12.2013
		
	КонецЕсли;
	//крохин конец 31.10.2013
	
	//Кухарь 25.12.19 начало
	если СостояниеНакладной<>Перечисления.СостоянияНакладной.Отгружена и ссылка.СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена тогда
		ВернутьИзОтгружено();		
	КонецЕсли;
	//Кухарь 25.12.19 конец	 	
	
	//крохин начало 21.12.2013
	//дату ХПС не корректируем в ЦО, пока не исправлена уникальность
	Если ПараметрыСеанса.ТипУзла <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		//крохин конец 21.12.2013
		//кухарь начало 31.11.13
		//корректируем дату ХПС
		запрос=новый запрос;
		запрос.Текст= "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ХранилищеПодарочныхСертификатов.Ссылка как ссылка
		|ИЗ
		|	Документ.ХранилищеПодарочныхСертификатов КАК ХранилищеПодарочныхСертификатов
		|ГДЕ
		|	ХранилищеПодарочныхСертификатов.ПометкаУдаления = ЛОЖЬ
		|	И ХранилищеПодарочныхСертификатов.ДокОбъект = &ДокОснование";
		Запрос.УстановитьПараметр("ДокОснование",Ссылка);
		Выборка = запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ХПС = Выборка.Ссылка;
			ДокОбъект=хпс.ПолучитьОбъект();
			Если НачалоДня(Дата) <> НачалоДня(ДокОбъект.Дата) Тогда
				ДокОбъект.Дата = Дата;
				ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		КонецЕсли;
		//кухарь конец 31.11.13
		//крохин начало 21.12.2013
		//дату ХПС не корректируем в ЦО, пока не исправлена уникальность
		//Кухарь 10.12.15 начало
		//Запрет создание документов по виртуальным складам в ЦО
	иначе
		если Склад.ВидСклада=Перечисления.ВидСклада.ВиртуальныйДляСклада или СкладПолучатель.ВидСклада=Перечисления.ВидСклада.ВиртуальныйДляСклада тогда
			#Если клиент тогда
				Сообщить("В ЦО запрещено создание документов по виртуальным складам");
			#КонецЕсли
			отказ=Истина;
		КонецЕсли;
		//Кухарь 10.12.15 конец
	КонецЕсли;
	//крохин конец 21.12.2013
	
	
	//Валетов + 04,03,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-3158
	Если НужноВыгружать 
		и ТребуетсяМаркировка 
		// Кухарь А.Ю. 06.03.2025 начало
		и не Склад.ЭтоСкладМаркированногоТовара
		и СкладПолучатель.ЭтоСкладМаркированногоТовара
		// Кухарь А.Ю. 06.03.2025 конец		
		// Кухарь А.Ю.  20.03.2025 начало
		// не грузили ПРМ со склада в ЦО
		и ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение 
		// Кухарь А.Ю.  20.03.2025 конец
		
		//Валетов+ 10,06,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5474
		И НЕ Склад.ТипСклада = Перечисления.ТипСклада.РозничныйТЦ
		//Валетов-
		Тогда
		НужноВыгружать = ПолучитьСтатусЗаказовКМПоНакланой(Ссылка); 
		Если не НужноВыгружать Тогда
			Если СостояниеНакладной = Перечисления.СостоянияНакладной.КОтправкеНаСклад и не ЭтоНовый() Тогда
				СостояниеНакладной = Перечисления.СостоянияНакладной.ЗаказКМЧЗ; 
			КонецЕсли;
		КонецЕсли;
	//Валетов + 18,06,2025 Заказ кодов для ЕКБ по ПРМ
		//https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-1947
	ИначеЕсли НужноВыгружать
		и ТребуетсяМаркировка
		и не ОбменДанными.Загрузка 
		и ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение
		И (СостояниеНакладной = Перечисления.СостоянияНакладной.КОтправкеНаСклад ИЛИ СостояниеНакладной = Перечисления.СостоянияНакладной.ПолученоСкладом) 
		И НачСостНакладной = Перечисления.СостоянияНакладной.ВРаботе Тогда  
		   //Когда перевели накладную в Екате из Вработе на склад, меняем на Заказ кодов маркировки
			СостояниеНакладной = Перечисления.СостоянияНакладной.ЗаказКМЧЗ; 
	ИначеЕсли НужноВыгружать
		и ТребуетсяМаркировка
		и ОбменДанными.Загрузка //!Перед Загрузкой выгружает Заново старый статус и не грузит новый
		и (ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение ИЛИ ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.Склад)
		И СостояниеНакладной = Перечисления.СостоянияНакладной.ЗаказКМЧЗ 
		 Тогда  
		    НужноВыгружать = Ложь;
			СостояниеНакладной = Перечисления.СостоянияНакладной.ПолученоСкладом;
	КонецЕсли;
	//Валетов -
	
	//Валетов +	30,07,2025 ПУСТАЯ ЗАДАЧА! КОНТРОЛЬ ЗАПОЛНЕНИЯ GTIN В ПРМ КАК В РНК.
	Если НужноВыгружать 
		и ТребуетсяМаркировка 
		И НЕ Склад.ЭтоСкладМаркированногоТовара 
		И СкладПолучатель.ЭтоСкладМаркированногоТовара
		И НачСостНакладной = Перечисления.СостоянияНакладной.ВРаботе 
		//Валетов + 03,03,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8567 На складе проверять нет смысла, проверим перед заказом в ЦО 
		и ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение
		//Валетов-
		И (СостояниеНакладной = Перечисления.СостоянияНакладной.КОтправкеНаСклад 
			ИЛИ СостояниеНакладной = Перечисления.СостоянияНакладной.ПолученоСкладом
			ИЛИ СостояниеНакладной = Перечисления.СостоянияНакладной.ЗаказКМЧЗ)  
		Тогда 
		ТекстСообщения = "";
		ЗапросПроверкиGTIN = Новый Запрос;
		ЗапросПроверкиGTIN.Текст =
		"ВЫБРАТЬ
		|	ТЧ.Номенклатура КАК Номенклатура,
		|	ТЧ.ТребуетсяМаркировка КАК ТребуетсяМаркировка,
		|	ТЧ.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_ТЧТовары
		|ИЗ
		|	&ТЧ КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТЧТовары.Номенклатура.Наименование КАК Номенклатура
		|ИЗ
		|	ВТ_ТЧТовары КАК ВТ_ТЧТовары
		|ГДЕ
		|	ВТ_ТЧТовары.ТребуетсяМаркировка
		|	И ВТ_ТЧТовары.Количество > 0
		|	И  ВТ_ТЧТовары.Номенклатура.ГТИН = """"";
		ЗапросПроверкиGTIN.УстановитьПараметр("ТЧ", Товары.Выгрузить());
		РезПРоверки = ЗапросПроверкиGTIN.Выполнить().Выгрузить(); 
		
		Для каждого Стр Из РезПРоверки Цикл 
			ТекстСообщения = ТекстСообщения + "В ПРМ: "+Ссылка+" не заполнен GTIN на "+Стр.Номенклатура+", требующую маркировки."+Символы.ПС; 
		КонецЦикла;
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			СообщитьИзМодуля(ТекстСообщения);  
			НужноВыгружать = Ложь;    
			СостояниеНакладной = Перечисления.СостоянияНакладной.ВРаботе;
			Отказ=Истина; 
		КонецЕсли;
	КонецЕсли;
    //Валетов +	30,07,2025 ПУСТАЯ ЗАДАЧА! КОНТРОЛЬ ЗАПОЛНЕНИЯ GTIN В ПРМ КАК В РНК.
	
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;	
	
	//кухарь 05.05.15 начало
	если ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.Склад и Склад.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код и не ЭтоНовый()  тогда 
		//Кухарь 26.03.17 начало
		//Короба пересчитываем и при паллетировании
		//если СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке тогда
		если СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке или СостояниеНакладной=Перечисления.СостоянияНакладной.ОжиданиеПаллетирования или СостояниеНакладной=Перечисления.СостоянияНакладной.Паллетирование тогда
			//Кухарь 26.03.17 конец
			//кухарь 10.06.15 начало
			//по ссылке не увидишь количество коробов которое поставили только что
			//СтрокаТЗ=ФинальныйПересчетКоробокИОбъемов(ЭтотОбъект.Ссылка);
			СтрокаТЗ=ФинальныйПересчетКоробокИОбъемов(ЭтотОбъект);
			//кухарь 10.06.15 конец
			
			
			КоличествоКоробок=СтрокаТЗ.КоличествоКоробок;
			ОбъемКоробов=СтрокаТЗ.ОбъемКоробов;
			ЗаписатьКоличествоИОбъемКоробовВРегистр (ЭтотОбъект.Ссылка,СтрокаТЗ.КоличествоКоробок,СтрокаТЗ.ОбъемКоробов);	
			
			//Кухарь 27.02.19 начало
			//Пришлось перенести коллективные работы сюда
			// ОЧЕНЬ ХОРОШО, ЧТО ПЕРЕНЕС СЮДА )))
			Если СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке тогда
				
				// Шворобей ВЮ 30.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5976
				// ТАКОЙ СПОРНЫЙ КУСОК, ИЗ ТЗ (АНДРЕЙ ПУСТЬ ПРОВЕРИТ)
				МассивКР = Документы.КоллективныеРаботы.ПоискНезакрытыхКоллективныхРаботПоДокументуОснования(Ссылка);	
				Если МассивКР.Количество() > 0 Тогда
					СообщитьИзМодуля("Существуют незакрытые Коллективные работы по этому документу!");
					Для Каждого КР Из МассивКР Цикл
						СообщитьИзМодуля(Строка(КР));	
					КонецЦикла;
					//Отказ = Истина;
				КонецЕсли;
				// Шворобей ВЮ 30.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5976	
				
				// Кухарь А.Ю. 07.09.2021 начало
					КоличествоПаллет=РасчитатьКоличествоПаллет(); 
				// Кухарь А.Ю. 07.09.2021 конец
				
				СписокВидовРабот=новый СписокЗначений;
				СписокВидовРабот.Добавить(Справочники.ВидыВыполняемыхРабот.ДопОбработка);
				НачалоПроверки=ТекущаяДата();
				запрос=новый запрос;
				запрос.Текст="ВЫБРАТЬ
				|	КоллективныеРаботы.Ссылка
				|ИЗ
				|	Документ.КоллективныеРаботы КАК КоллективныеРаботы
				|ГДЕ
				|	КоллективныеРаботы.Проведен
				|	И КоллективныеРаботы.Дата > &ДатаЗапретаРедактирование
				|	И КоллективныеРаботы.ВидРаботы в (&СписокВидовРабот) 
				|	И КоллективныеРаботы.ДокОснование = &ДокОснование";
				запрос.УстановитьПараметр("ДатаЗапретаРедактирование",ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования());
				запрос.УстановитьПараметр("ДопОбработка",Справочники.ВидыВыполняемыхРабот.ДопОбработка);
				запрос.УстановитьПараметр("СписокВидовРабот",СписокВидовРабот);
				запрос.УстановитьПараметр("ДокОснование",ссылка);
				результат=запрос.Выполнить().Выбрать();
				пока результат.Следующий() цикл
					КоллективнаяРабота=результат.ссылка.получитьобъект();
					если КоллективнаяРабота.Состояние=Перечисления.СостоянияНакладной.ВРаботе тогда
						Запрос=новый запрос;
						запрос.текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
						|	ПланНаборатБрэндов.ДопОбработчик,
						|	ПланНаборатБрэндов.ОкончаниеДопОбработки
						|ИЗ
						|	Документ.ПланНабора.тБрэндов КАК ПланНаборатБрэндов
						|ГДЕ
						|	ПланНаборатБрэндов.Ссылка.Накладная = &ДокОснование
						|	И ПланНаборатБрэндов.Ссылка.Проведен
						|	И ПланНаборатБрэндов.Ссылка.Дата >= &Дата
						|
						|СГРУППИРОВАТЬ ПО
						|	ПланНаборатБрэндов.ДопОбработчик,
						|	ПланНаборатБрэндов.ОкончаниеДопОбработки";
						запрос.УстановитьПараметр("ДокОснование",Ссылка);
						запрос.УстановитьПараметр("Дата",НачалоДня(Дата));				
						ТЗДО=запрос.Выполнить().Выгрузить();
						ТЗДО.Свернуть("ДопОбработчик,ОкончаниеДопОбработки");
						ТЗДОСверн=ТЗДО.Скопировать();				
						ТЗДОСверн.Свернуть("ДопОбработчик");
						ТЗДОСверн.Колонки.Добавить("ОкончаниеДопОбработки");
						
						Для каждого СтрДО из ТЗДОСверн цикл
							ДатаОкончания=ПустаяДата();
							МассСтрок=ТЗДО.НайтиСтроки(новый Структура("ДопОбработчик",СтрДО.ДопОбработчик));
							Для каждого СтрМасс из МассСтрок цикл
								ДатаОкончания=Макс(ДатаОкончания,СтрМасс.ОкончаниеДопОбработки)
							КонецЦикла;
							если ДатаОкончания=ПустаяДата() тогда 
								ДатаОкончания=НачалоПроверки;
							КонецЕсли;
							СтрДО.ОкончаниеДопОбработки=ДатаОкончания;
						КонецЦикла;							
						МассСтрок=КоллективнаяРабота.Данные.НайтиСтроки(новый Структура("ОкончаниеВыполнения",ПустаяДата()));
						Для каждого СтрМассива из МассСтрок цикл
							СтрТЗ=ТЗДОСверн.Найти(СтрМассива.ВедущийСотрудник);
							если СтрТЗ=Неопределено тогда
								СтрТЗ=ТЗДОСверн.Найти(СтрМассива.Сотрудник);
							КонецЕсли;
							если СтрТЗ=Неопределено тогда
								СтрМассива.ОкончаниеВыполнения=НачалоПроверки;
								Продолжить;
							КонецЕсли;
							СтрМассива.ОкончаниеВыполнения=СтрТЗ.ОкончаниеДопОбработки;
						КонецЦикла;	
						КоллективнаяРабота.Состояние=Перечисления.СостоянияНакладной.Отгружена;
						КоллективнаяРабота.Записать();	
					КонецЕсли;				
					ТрудоЗатратыНаДО=КоллективнаяРабота.КоличествоЧеловекоЧасов;
					ВремяНаДО=КоллективнаяРабота.ВремяРаботы/3600;		
				КонецЦикла;
				
			// Шворобей ВЮ 30.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5976	
			ИначеЕсли СостояниеНакладной = Перечисления.СостоянияНакладной.ОжиданиеПаллетирования Тогда
				МассивКР = Документы.КоллективныеРаботы.ПоискНезакрытыхКоллективныхРаботПоДокументуОснования(Ссылка);	
				Если МассивКР.Количество() > 0 Тогда
					СообщитьИзМодуля("Существуют незакрытые Коллективные работы по этому документу!");
					Для Каждого КР Из МассивКР Цикл
						СообщитьИзМодуля(Строка(КР));	
					КонецЦикла;
					//Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
			// Шворобей ВЮ 30.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5976	
			
		КонецЕсли;	
	КонецЕсли;	
	//кухарь 05.05.15 конец
	
	//Кухарь 26.03.17 начало
	//Заполнение расходных материалов
	если ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.Склад и СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке тогда
		попытка
			ЗаполнитьТЧРасходныхМатериалов(ЭтотОбъект);
		Исключение
		КонецПопытки;
	КонецЕсли;
	//Кухарь 26.03.17 конец
	
	//Кухарь 27.04.17 начало
	//Для ПРМ со склада РС франчайзинг количество мест будет браться из док основания
	//крохин начало 29.04.2017
	//бывает не на основании
	//если склад=Справочники.Склады.НайтиПоКоду("SSX-66") тогда
	если склад=Справочники.Склады.НайтиПоКоду("SSX-66") И ДокОснование <> Неопределено тогда
		//крохин конец 29.04.2017
		// Шворобей В.Ю. 19.05.2023 ++
		Если ЕстьРеквизитДокумента("СостояниеНакладной",ДокОснование.Метаданные()) Тогда
			Если ДокОснование.СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке или ДокОснование.СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена тогда
				КоличествоКоробок=ДокОснование.КоличествоКоробок;	
			КонецЕсли;
		КонецЕсли;
		// Шворобей В.Ю. 19.05.2023 ++
	КонецЕсли;
	//Кухарь 27.04.17 конец
	//Кухарь 02.07.18 начало
	//Избавимся от пустых значений
	если ТипДоставки = Перечисления.ТипыДоставки.ПустаяСсылка() тогда
		ТипДоставки=ПунктДоставки.ТипДоставки
	КонецЕсли;
	//Кухарь 02.07.18 конец
	
	// Шворобей ВЮ 11.12.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1254
	Если Дата >= Дата(2024,12,01) Тогда
		ФлагВиртуальное = Документы.Перемещение.ВиртуальноеПеремещение(Склад, СкладПолучатель);
		
		Если ФлагВиртуальное И СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена 
			И СостояниеНакладнойУПолучателя = Перечисления.СостоянияНакладной.Принята Тогда
			
			ДатаПриемки = Дата;
			
		КонецЕсли;
	КонецЕсли;
	// Шворобей ВЮ 11.12.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1254
	
	////Валетов + https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-3158  ПЕРЕНЕС В РЕГЛАМЕНТ Регламент.ЗаписатьДокументыВРегЗаказМарок()
	//Если ТребуетсяМаркировка и СостояниеНакладной = Перечисления.СостоянияНакладной.КОтправкеНаСклад
	//	и НачСостНакладной <> Перечисления.СостоянияНакладной.КОтправкеНаСклад 
	//	// Кухарь А.Ю. 06.03.2025 начало

	//	и не Склад.ЭтоСкладМаркированногоТовара
	//	и СкладПолучатель.ЭтоСкладМаркированногоТовара
	//	// Кухарь А.Ю. 06.03.2025 конец		
	//	// Кухарь А.Ю.  20.03.2025 начало
	//	// наверное статусы нужны только в ЦО
	//	и ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение 
	//	// Кухарь А.Ю.  20.03.2025 конец
	//	
	//	Тогда 
	//	
	//	НаборЗаписей = РегистрыСведений.СтатусыЗаказаМарокДляДокументов.СоздатьНаборЗаписей();
	//	НаборЗаписей.Отбор.Накладная.Установить(Ссылка);
	//	НаборЗаписей.Прочитать();
	//	Если НаборЗаписей.Количество() = 0 Тогда
	//		НоваяЗапись = НаборЗаписей.Добавить();
	//		НоваяЗапись.Накладная = Ссылка;
	//		НоваяЗапись.СтатусыЗаказаКодовМаркировки = Перечисления.СтатусыЗаказаКодовМаркировки.ТребуетсяЗаказМарок;
	//		НаборЗаписей.Записать();
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//Валетов + https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-3633
	Если (СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена ИЛИ СостояниеНакладной = Перечисления.СостоянияНакладной.ГотоваКОтгрузке)
		и (НачСостНакладной <> Перечисления.СостоянияНакладной.Отгружена ИЛИ НачСостНакладной <> Перечисления.СостоянияНакладной.ГотоваКОтгрузке)
		И НЕ ОбменДанными.Загрузка
		И ЕстьИзменения 
		// Кухарь А.Ю.  31.03.2025 начало
		// Опечатка
		и Маркировка_ПИ.ТипТекущегоУзла() = Перечисления.ТипУзлаИБ.УправляющееПодразделение 
		// Кухарь А.Ю.  31.03.2025 конец
		
		Тогда 
		
		ФизСклад 			= ?(Склад.ФизическийСклад.Пустая(), Склад, Склад.ФизическийСклад);
		ФизСкладПолучатель  = ?(СкладПолучатель.ФизическийСклад.Пустая(), СкладПолучатель, СкладПолучатель.ФизическийСклад);
		
		Если ФизСклад <> ФизСкладПолучатель
			//Валетов + 28,05,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5024
			И Не РольДоступна("Администратор")
			//Валетов- 
			//++Данилова Е.В. 09.10.2025 HELP-5978
			И НЕ (ДополнительныеСвойства.Свойство("ЗаписыватьБезПроверкиФизСкладов")
			И ДополнительныеСвойства.ЗаписыватьБезПроверкиФизСкладов = Истина)
			//--Данилова Е.В. 09.10.2025 
			и ЗначениеЗаполнено(Склад.КодФИзическогоУзла)
			И НЕ Склад.ЭтоСкладМаркированногоТовара
			И СкладПолучатель.ЭтоСкладМаркированногоТовара Тогда 
			СообщитьИзМодуля("Запрещена отгрузка перемещений на склады маркированного товара, с разными физическими складами!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// Кухарь А.Ю.  18.03.2025 начало
	// Затёр кто-то пришлось возвращать
	Если ЕстьИзменения и  
		(СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе или  СостояниеНакладной=Перечисления.СостоянияНакладной.КОтправкеНаСклад)
		тогда
		МаркировкаКС.ЗаполнитьТабличныеЧастиПризнакомМаркировки(ЭтотОбъект);
	КонецЕсли;
	// Кухарь А.Ю.  18.03.2025 конец
	
	// Шворобей ВЮ 16.04.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4204 
	Если ЗначениеЗаполнено(ДатаОтгрузки) И НЕ ЗначениеЗаполнено(ДатаГотовности) Тогда
		ДатаГотовности = ДатаОтгрузки;
	КонецЕсли;
	// Шворобей ВЮ 16.04.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4204
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если НачСостНакладной<>СостояниеНакладной Тогда
		ЗаписатьИзменениеСостоянияНакладной(Ссылка,СостояниеНакладной);
	КонецЕсли;
	//крохин начало 07.10.2021
	//в ПРМ по складу РС франчайзинг тоже надо заполнять, для агентской номенклатуры
	Если Отгружен = Перечисления.Отгружен.Отгружен И Склад = Справочники.Склады.НайтиПоКоду("SSX-66") Тогда
		ЗаполнитьПервичнуюГруппуНоменклатуры(Товары.ВыгрузитьКолонку("Номенклатура"));
	КонецЕсли;
	//крохин конец 07.10.2021
	
	//++Данилова Е.В. 21.05.2026 MARK-3718 
	Если Не ОбменДанными.Загрузка 
		И Не Отказ Тогда
	
		СоздатьХКМ_к_ПРМ_Призаписи(); 
	
	КонецЕсли;
	//--Данилова Е.В. 21.05.2026 
	//-----------------------------------------------------------------------------
	//Нечаева 19,09,23 ++
	// сделаем запись в регистр, что это по веб заказам. после выгрузки на сайт проставим, что отгружен
	ЗаказССайта = ложь;
	ПРМСсайта = ложь;
	
	попытка
		ЗаказССайта = ПроцедурыОбменаССайтом.ОпределитьПризнакЗаказаССайта(ДокОснование.Ссылка);
		ПРМССайта = ПроцедурыОбменаССайтом.ОпределитьПризнакПРМССайта(Ссылка);
	исключение
	
	конецПопытки;
	
	// проверим еще, по складу - только для ПРМ, в котором склад-ОТПРАВИТЕЛЬ совпадает со складом в заказе
	Если ЗаказССайта и Не ПРМССайта  и (СостояниеНакладной= перечисления.СостоянияНакладной.Отгружена) Тогда
		Если  докОснование.Склад = ЭтотОбъект.Склад Тогда
			Успешно = ПроцедурыОбменаССайтом.УстановитьКатегориюДокумента(ЭтотОбъект.Ссылка, Справочники.КатегорииОбъектов.ЗаказСWEBСайта, Истина);
		конецЕсли;
	КонецЕсли;
	//нечаева 19,09,23 --
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	СостояниеНакладной				=Неопределено;
	СостояниеНакладнойУПолучателя	=Неопределено;
	Отгружен						=Неопределено;
	Автор							=Неопределено;
	ДатаВыгрузки					=Неопределено;	
	ДатаОтгрузки					=Неопределено;
	ДатаПриемки						=Неопределено;
	//крохин начало
	Менеджер = ПунктДоставки.Менеджер;
	//крохин конец
	
	//кухарь 13.05.15 начало
	СостояниеДокументов	=Неопределено;	
	//кухарь 13.05.15 конец
	
	//крохин начало 09.09.2015
	Упаковка.Очистить();
	РедактированиеУпаковки = Ложь;
	//крохин конец 09.09.2015
	
	//крохин начало 10.02.2017
	СостояниеКоррекции = Неопределено;
	//крохин конец 10.02.2017
	
	
	//Кухарь 18.10.17 начало
	ОбъемПаллет=0;
	КоличествоПаллет=0;
	//Кухарь 18.10.17 конец
	
	//Кухарь 16.01.19 начало
	ТрудозатратыНаТермоусадку=0;
	ТрудозатратыНаДО=0;
	ТрудозатратыНаНабор=0;
	ТрудозатратыНаПаллетирование=0;
	ТрудозатратыНаСканирование=0;
	ВремяНаДО=0;
	ВремяНаНабор=0;
	ВремяНаПаллетирование=0;
	ВремяНаСканирование=0;
	ВремяНаТермоусадку=0;
	//Кухарь 16.01.19 конец
	
КонецПроцедуры

//Валетов + 04,03,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-3158
Функция ПолучитьСтатусЗаказовКМПоНакланой(Накладная)
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыЗаказаМарокДляДокументов.Накладная КАК Накладная
	|ИЗ
	|	РегистрСведений.СтатусыЗаказаМарокДляДокументов КАК СтатусыЗаказаМарокДляДокументов
	|ГДЕ
	|	СтатусыЗаказаМарокДляДокументов.СтатусыЗаказаКодовМаркировки = ЗНАЧЕНИЕ(перечисление.Статусызаказакодовмаркировки.Маркивведенывоборот)
	|	И СтатусыЗаказаМарокДляДокументов.Накладная = &Накладная";
	Запрос.УстановитьПараметр("Накладная", Накладная);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции
//Валетов-

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	Если ОбщегоНазначения_ПИ.ЭтоУзел_Склад() И (Отгружен=Перечисления.Отгружен.Резерв ИЛИ Отгружен=Перечисления.Отгружен.РезервТранзит) Тогда
		Возврат;	
	КонецЕсли;
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	ДвиженияПоРегистрам=Неопределено;
	РезультатПроведения=ПроведениеПоРегистрамОстатков(Ссылка,ДвиженияПоРегистрам,ОбменДанными.Загрузка);	
	Результат=РезультатПроведения["Результат"];
	
	Если Результат<0 И НЕ ОбменДанными.Загрузка Тогда		
		Отказ=Не(ПолучитьПолномочиеПользователя("СписыватьВМинус"));		
		ВывестиТрассировку(РезультатПроведения["ТОшибок"],?(Отказ,-2,Результат));			
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,ОбменДанными.Загрузка);	
	КонецЕсли; 
	
	СформироватьДвиженияПоЗабалансовымРегистрам();
	
	Если СкладПолучатель.ТипСклада=перечисления.ТипСклада.ПалетноеХранение  и НЕ обменДанными.Загрузка И СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена и ДатаПриемки <> дата(1,1,1) тогда //Добавил проверку на дату приемки.
		Партия=справочники.Партии.НайтиПоРеквизиту("ПНК",ССылка);
		Если Партия.Пустая() тогда
			Партия=Справочники.Партии.СоздатьЭлемент();
			партия.ПНК=ссылка;
			партия.Наименование=номер+"-"+Формат(дата,"ДФ=гг");
			партия.Записать();
			партия=партия.Ссылка;
		Конецесли;	                 
		
		для каждого ТекСтрокаТовары из товары  цикл
			
			Если ТекСтрокаТовары.Количество<>0 тогда
				ЛН = ПолучитьЛН(ТекСтрокаТовары.Номенклатура, ЭтотОбъект.Ссылка);
				Для Каждого текЛН Из ЛН Цикл
					Движение = Движения.Партии.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Партия = Партия;
					Движение.Период =ДатаПриемки ;
					Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
					Движение.Склад = СкладПолучатель;
					Движение.ШтВКоробе=0;
					Попытка
						Движение.Количество = Число(текЛН.Количество);
						Движение.Сумма = ТекСтрокаТовары.Всего*Число(текЛН.Количество)/ТекСтрокаТовары.Количество;
					Исключение
						Движение.Количество = 0;
						Движение.Сумма = 0;
					КонецПопытки;
					Движение.ЛН = текЛН.НомерЛН;
				КонецЦикла;
			Конецесли;
			
		Конеццикла;	
		Если ОбменДанными.Загрузка Тогда
			Движения.Партии.Записать();             
		КонецЕсли;
	Конецесли;
	
	Если Склад.ТипСклада=перечисления.ТипСклада.ПалетноеХранение тогда
		для каждого ТекСтрокаТовары из товары  цикл
			
			Если ТекСтрокаТовары.Количество<>0 тогда 
				ЛН = ПолучитьЛН_Возврат(ТекСтрокаТовары.Номенклатура, ДокОснование);
				Для Каждого текЛН Из ЛН Цикл
					Движение = Движения.Партии.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Партия = текЛН.Партия;
					Движение.Период =Дата ;
					Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
					Движение.Склад = Склад;
					Движение.ШтВКоробе=0;
					Попытка
						Движение.Количество = Число(текЛН.Количество);
						Движение.Сумма = ТекСтрокаТовары.Всего*Число(текЛН.Количество)/ТекСтрокаТовары.Количество;
					Исключение
						Движение.Количество = 0;
						Движение.Сумма = 0;
					КонецПопытки;
					Движение.ЛН = текЛН.НомерЛН;
				КонецЦикла;
			Конецесли;
		Конеццикла;	
		Если ОбменДанными.Загрузка Тогда
			Движения.Партии.Записать();             
		КонецЕсли;
	Конецесли;
	если не УчетСертификатов.ПровестиДокументПоСертификатнымОстаткам(ЭтотОбъект) тогда
		отказ=Истина;
	КонецЕсли;
	если ОбменДанными.Загрузка тогда
		Движения.СертификатныеОстатки.Записать();
	КонецЕсли;
	если ЭтоНовый() Тогда 
		ЗаписатьКоличествоИОбъемКоробовВРегистр (ЭтотОбъект.Ссылка,КоличествоКоробок,ОбъемКоробов);   
		//запись объёма коробов и количество коробок в регистр	
	иначе
		//входящие ПРМ пишем всегда
		если Склад.КодФизическогоУзла<>ПараметрыСеанса.ЭтотУзел.Код тогда
			если ПараметрыСеанса.ЭтотУзел.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
				ЗаписатьКоличествоИОбъемКоробовВРегистр (ЭтотОбъект.Ссылка,КоличествоКоробок,ОбъемКоробов);
			КонецЕсли;	
		Иначе 
			ЧСостояние=ПолучитьНомерСостоянияНакладной(СостояниеНакладной);
			если  ЧСостояние < 400 и ЧСостояние<>0 тогда
				если ПараметрыСеанса.ЭтотУзел.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
					ЗаписатьКоличествоИОбъемКоробовВРегистр (ЭтотОбъект.Ссылка,КоличествоКоробок,ОбъемКоробов);
				КонецЕсли;		
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Для контроля что запись накладной прошла успешно
	если СостояниеКоррекции=Перечисления.СостоянияКоррекции.Утверждена и ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение и не ОбменДанными.Загрузка тогда
		ЗаписатьЗначениеВРеквизитыРНКПНКПРМ("ДатаПоследнегоИзменения",ТекущаяДата(),Ссылка);
	КонецЕсли;

	Если ЗначениеЗаполнено(ЗаявкаНаПерепаковку) 
		И Склад.ТипСклада = Перечисления.ТипСклада.Перепаковка
		И СостояниеНакладнойУПолучателя = Перечисления.СостоянияНакладной.Принята Тогда 
		
		Если Товары.Количество() > 0 Тогда
			
			СтруктураОстатков = Документы.Перемещение.КонтрольПоРегиструСпайкиВПути(Ссылка, ЗаявкаНаПерепаковку);
			
			Если ТипЗнч(СтруктураОстатков.ТаблицаНехватки) = Тип("ТаблицаЗначений")
				И СтруктураОстатков.ТаблицаНехватки.Количество() = 0 Тогда
				
				Движения.СпайкиВПути.Записывать = Истина;
				Движения.СпайкиВПути.Очистить();
				Для Каждого ТекСтрокаТовары Из Товары Цикл
					Движение = Движения.СпайкиВПути.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Дата;
					Движение.Регистратор = Ссылка;
					Движение.Заявка = ДокОснование;
					Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
					Движение.Количество = ТекСтрокаТовары.Количество;
				КонецЦикла;
				Движения.СпайкиВПути.Записать(Истина);
				
			Иначе	
				 СообщитьИзМодуля("Остатков Спаек в пути не хватает!!!!");
				 Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;

	Если РезервироватьТовар И Отгружен = Перечисления.Отгружен.Отгружен
		И ПараметрыСеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		Если Товары.Количество() > 0 Тогда
			Движения.РезервыТМЦ.Записывать = Истина;
			Движения.РезервыТМЦ.Очистить();
			Для Каждого ТекСтрокаТовары Из Товары Цикл
				Если ТекСтрокаТовары.Количество > 0 Тогда
					Движение = Движения.РезервыТМЦ.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = Дата;
					Движение.Регистратор = Ссылка;
					// Кухарь А.Ю. 12.01.2026 начало
					// HELP-8448  
					//Движение.Заказ = ДокОснование;
					Движение.Заказ = Ссылка;				
					// Кухарь А.Ю. 12.01.2026 конец		
					Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
					Движение.Количество = ТекСтрокаТовары.Количество;
					Движение.Склад = СкладПолучатель;
					Движение.Получатель = СкладПолучатель;
				КонецЕсли;
			КонецЦикла;
			Движения.РезервыТМЦ.Записать(Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры       

//Катаев+ 29/01/14
Функция ПолучитьЛН(Номенклатура, Объект)
	Запрос = Новый Запрос;
	///Катаев+ 07/02/14 Запрос изменен в соответствии с новым занесение данных в регистр
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеквизитыТЧ_Товары_РНКПНКПРМ.ЗначениеРеквизита КАК Количество,
	|	РеквизитыТЧ_Товары_РНКПНКПРМ.ИмяРеквизита КАК НомерЛН
	|ИЗ
	|	РегистрСведений.РеквизитыТЧ_Товары_РНКПНКПРМ КАК РеквизитыТЧ_Товары_РНКПНКПРМ
	|ГДЕ
	|	РеквизитыТЧ_Товары_РНКПНКПРМ.Документ = &Документ
	|	И ПОДСТРОКА(РеквизитыТЧ_Товары_РНКПНКПРМ.ИмяРеквизита, 1, 9) = &ИмяРеквизита
	|	И РеквизитыТЧ_Товары_РНКПНКПРМ.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Документ", Объект);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ИмяРеквизита", "Номер ЛН");
	Выборка = Запрос.Выполнить().Выбрать();
	//Катаев+ 07/02/14 Палетов с одной номенклатурой может быть несколько
	//Выборка.Следующий();
	//НомерЛН = Выборка.НомерЛН;
	НомерЛН = Новый ТаблицаЗначений;
	НомерЛН.Колонки.Добавить("НомерЛН");
	НомерЛН.Колонки.Добавить("Количество");
	Пока Выборка.Следующий() Цикл
		стр = НомерЛН.Добавить();
		стр.НомерЛН = Выборка.НомерЛН;
		стр.Количество = Выборка.Количество;
	КонецЦикла;
	//Катаев- 07/02/14
	Возврат НомерЛН;
КонецФункции
//Катаев- 29/01/14

//Катаев+ 10/02/14
Функция ПолучитьЛН_Возврат(Номенклатура, ДокОснование)
	Если ДокОснование = Неопределено Тогда
		НомерЛН = ПолучитьЛН(Номенклатура, ЭтотОбъект.Ссылка);
		НомерЛН.Колонки.Добавить("Партия");
		Для Каждого стр из НомерЛН Цикл
			//Определяем документ основание для ЛН
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	РеквизитыТЧ_Товары_РНКПНКПРМ.Документ
			|ИЗ
			|	РегистрСведений.РеквизитыТЧ_Товары_РНКПНКПРМ КАК РеквизитыТЧ_Товары_РНКПНКПРМ
			|ГДЕ
			|	РеквизитыТЧ_Товары_РНКПНКПРМ.ИмяРеквизита = &ИмяРеквизита
			|	И РеквизитыТЧ_Товары_РНКПНКПРМ.Документ.СкладПолучатель.ТипСклада = &ТипСклада";
			Запрос.УстановитьПараметр("ТипСклада", Перечисления.ТипСклада.ПалетноеХранение);
			Запрос.УстановитьПараметр("ИмяРеквизита", стр.НомерЛН);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				стр.Партия = справочники.Партии.НайтиПоРеквизиту("ПНК",Выборка.Документ);
			КонецЕсли;
		КонецЦикла;
	Иначе
		НомерЛН = ПолучитьЛН(Номенклатура, ДокОснование);
		НомерЛН.Колонки.Добавить("Партия");
		Для Каждого стр из НомерЛН Цикл
			стр.Партия = справочники.Партии.НайтиПоРеквизиту("ПНК",ДокОснование);
		КонецЦикла;
	КонецЕсли;
	Возврат НомерЛН;
КонецФункции
//Катаев- 10/02/14

Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;	
	Если Основание=Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;
	
	ВидОснования	= Основание.Метаданные().Имя;
	
	////////////////////////////////////////////////////////////////////////
	//Кухарь А.Ю.  27.10.2024 начало
	//Временно закомментировал. Этот код 3 месяца провисел в хранилище и никому не понадобился	
	//Если ВидОснования = "Заказ" Тогда
	//	#Если Клиент Тогда
	//	ВызватьИсключение "Документ ПРМ на основании Заказа создать не получится!";
	//	#КонецЕсли
	//КонецЕсли;
	//Кухарь А.Ю.  27.10.2024 конец

	////////////////////////////////////////////////////////////////////////
	
	ВариантЗаполнения=Неопределено;
	#ЕСЛИ КЛИЕНТ ТОГДА
		ВариантЗаполнения=ВыбратьВариантЗаполнения();
	#КОНЕЦЕСЛИ
	Если ВариантЗаполнения=Неопределено Тогда
		ВариантЗаполнения="Целиком";
	КонецЕсли;	
	
	ДокОснование	= Основание;
	
	// Шворобей ВЮ 21.09.2023 ++
	ШаблонРеквизитов = "ИБ,СкладПолучатель,Менеджер,Организация,Склад,ТипЦен,ТипСкидок,Скидка";
	СписокРеквизитов = ЗаполнениеДокументов.СформироватьСтрокуРеквизитовПоШаблону(Основание, ШаблонРеквизитов);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание, СписокРеквизитов);
	
	//ИБ				= Основание.ИБ; // Отключил за ненадобностью
	
	//СкладПолучатель	= ПолучитьРеквизитОбъекта(ДокОснование,"СкладПолучатель");	
	//Менеджер 		= ПолучитьРеквизитОбъекта(ДокОснование,"Менеджер");
	//
	//Организация		= ПолучитьРеквизитОбъекта(ДокОснование,"Организация");		
	//Склад			= ПолучитьРеквизитОбъекта(ДокОснование,"Склад");
	//крохин начало
	//Группы товаров пересчитаем заново
	//ГруппыТоваров	= ПолучитьРеквизитОбъекта(ДокОснование,"ГруппыТоваров");
	//крохин конец
	
	//ТипЦен			= ПолучитьРеквизитОбъекта(ДокОснование,"ТипЦен");
	//ТипСкидок		= ПолучитьРеквизитОбъекта(ДокОснование,"ТипСкидок");
	//Скидка			= ПолучитьРеквизитОбъекта(ДокОснование,"Скидка");
	// Шворобей ВЮ 21.09.2023 ++
	
	Комментарий		= ""+ДокОснование.Метаданные()+" № " + ДокОснование.Номер + " от " + Формат(ДокОснование.Дата,"ДФ=dd.MM.yy");		
	
	Если ВидОснования="ПриходнаяНакладная" И НЕ ПолучитьПолномочиеПользователя("ВидимостьПриходныхЦен") Тогда
		ОбнулитьЦены=Истина;	
	Иначе
		ОбнулитьЦены=Ложь;	
	КонецЕсли;
	Для Каждого исхСтрокаТЧ Из ДокОснование.Товары Цикл
		СтрокаТЧ = Товары.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,исхСтрокаТЧ);	
		Если ВариантЗаполнения="НехватающиеЗаявка" Тогда
			СтрокаТЧ.ПодтвержденнаяЗаявка	=исхСтрокаТЧ.Заявка-исхСтрокаТЧ.Количество;
			СтрокаТЧ.Количество				=СтрокаТЧ.ПодтвержденнаяЗаявка;				
			СтрокаТЧ.Заявка					=СтрокаТЧ.ПодтвержденнаяЗаявка;
		ИначеЕсли ВариантЗаполнения="НехватающиеПодтверждение" Тогда
			СтрокаТЧ.ПодтвержденнаяЗаявка	=исхСтрокаТЧ.ПодтвержденнаяЗаявка-исхСтрокаТЧ.Количество;
			СтрокаТЧ.Количество				=СтрокаТЧ.ПодтвержденнаяЗаявка;				
			СтрокаТЧ.Заявка					=СтрокаТЧ.ПодтвержденнаяЗаявка;
		Иначе
			Если СтрокаТЧ.Заявка=0 Тогда
				СтрокаТЧ.Заявка	= СтрокаТЧ.Количество;			
			КонецЕсли;
			//Кухарь 26.12.17 начало
			//Не верно заполнялось
			//Если СтрокаТЧ.ПодтвержденнаяЗаявка=0 Тогда
			//	СтрокаТЧ.ПодтвержденнаяЗаявка=СтрокаТЧ.Количество;
			//КонецЕсли;
			СтрокаТЧ.ПодтвержденнаяЗаявка=СтрокаТЧ.Количество;			
			//Кухарь 26.12.17 конец
			
		КонецЕсли;
		//крохин начало 25.10.2011
		//новый реквизит
		СтрокаТЧ.ПодтвержденнаяЗаявкаПеремещения = СтрокаТЧ.Заявка;
		//крохин конец 25.10.2011
		
		Если ОбнулитьЦены Тогда
			СтрокаТЧ.Цена=0;		
			СтрокаТЧ.ЦенаБезСкидки=0;
		КонецЕсли;
		
		//Кухарь 16.11.18 начало
		//Расчёт себестоимости
		если ДокОснование.метаданные().имя="РасходнаяНакладная" тогда
			//Кухарь 16.11.18 конец	
			если ДокОснование.подразделение.код= "SSP-0150" тогда //Франчайзинг
				//Кухарь 05.12.18 начало
				//	СтрокаТЧ.Себестоимость=СтрокаТЧ.Цена;
				//Кухарь 24.12.18 начало
				//У сертификатов нет себестоимости
				//СтрокаТЧ.Себестоимость=СтрокаТЧ.Цена*СтрокаТЧ.Количество;		
				если СтрокаТЧ.Номенклатура.Родитель.ВидНоменклатуры<>Перечисления.ВидыНоменклаутры.ПодарочныйСертификат тогда
					СтрокаТЧ.Себестоимость=СтрокаТЧ.Цена*СтрокаТЧ.Количество;
				иначе
					СтрокаТЧ.Себестоимость=0;
				КонецЕсли;
				//Кухарь 24.12.18 конец
				
				//Кухарь 05.12.18 конец
				//крохин 03.12.2018
				//без даты цены не считаются
				ЭтотОбъект.Дата = ТекущаяДата();
				ЭтотОбъект.Валюта = ДокОснование.валюта;
				ЭтотОбъект.Курс = ДокОснование.курс;
				//крохин конец 03.12.2018
				//Кухарь 06.12.18 начало
				//По просьбе Поповой Е.М.
				//СтрокаТЧ.Цена=0;
				//СтрокаТЧ.ЦенаБезСкидки=0;				
				//ЗаполнитьЦенуНоменклатурыТабЧасти(СтрокаТЧ, ЭтотОбъект);
				СтрокаТЧ.Цена=1;
				//Кухарь 13.12.18 начало
				//Чтобы был таки рубль
				//СтрокаТЧ.ЦенаБезСкидки=1;		
				СтрокаТЧ.ЦенаБезСкидки=2;
				СтрокаТЧ.Скидка=50;
				//Кухарь 13.12.18 конец
				
				//Кухарь 06.12.18 конец
			КонецЕсли;
			//Кухарь 23.10.18 конец
			//Кухарь 16.11.18 начало
			//Расчёт себестоимости
		КонецЕсли;
		//Кухарь 16.11.18 конец	
		
		Если СтрокаТЧ.Количество=0 Тогда
			Товары.Удалить(СтрокаТЧ);	
		Иначе
			РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект);
		КонецЕсли; 
	КонецЦикла;
	//крохин начало
	ГруппыТоваров	=ГруппыТоваровДокумента(ЭтотОбъект);
	Если Дата >= '20101001' Тогда
		СекторХранения = СекторХраненияДокумента(ЭтотОбъект);
	КонецЕсли;
	//крохин конец
	
	//Мессерле Паллетное хранение
	Если ВидОснования = "Перемещение" тогда
		Если Основание.СкладПолучатель.ТипСклада=перечисления.ТипСклада.ПалетноеХранение тогда
			времсклад=Основание.складполучатель;
			складполучатель=Основание.склад;
			Склад=времсклад;
		Конецесли;
	ИначеЕсли ВидОснования = "Заказ" Тогда // Шворобей ВЮ 21.09.2023 ++
		ШаблонРеквизитов = "КодВторичногоКонтрагента,НаименованиеВторичногоКонтрагента,НомерЗаказаВторичногоКонтрагента";
		СписокРеквизитов = ЗаполнениеДокументов.СформироватьСтрокуРеквизитовПоШаблону(Основание, ШаблонРеквизитов);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание, СписокРеквизитов);
	КонецЕсли;
	// Шворобей ВЮ 21.09.2023 ++
	
	//крохин начало 09.09.2015
	Упаковка.Очистить();
	РедактированиеУпаковки = Ложь;
	//крохин конец 09.09.2015
	
	//крохин начало 10.02.2017
	СостояниеКоррекции = Неопределено;
	//крохин конец 10.02.2017
	//Кухарь 18.10.17 начало
	ОбъемПаллет=0;
	КоличествоПаллет=0;
	//Кухарь 18.10.17 конец
	
	//Кухарь 16.01.19 начало
	ТрудозатратыНаТермоусадку=0;
	ТрудозатратыНаДО=0;
	ТрудозатратыНаНабор=0;
	ТрудозатратыНаПаллетирование=0;
	ТрудозатратыНаСканирование=0;
	ВремяНаДО=0;
	ВремяНаНабор=0;
	ВремяНаПаллетирование=0;
	ВремяНаСканирование=0;
	ВремяНаТермоусадку=0;
	//Кухарь 16.01.19 конец
	
КонецПроцедуры

//крохин начало 13.05.2011
//упаковка
Процедура СформироватьДвиженияПоЗабалансовымРегистрам()
	//резервов нет
	//Если Отгружен = Перечисления.Отгружен.Отгружен И СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена Тогда
	//	//отгрузка
	//	Для Каждого СтрокаТЧ Из Товары Цикл
	//Если ПолучитьРеквизитРодителя(СтрокаТЧ.Номенклатура,"ВидНоменклатуры") =  Перечисления.ВидыНоменклаутры.Упаковка Тогда
	//	Движение = Движения.ОстаткиТМЦзабаланс.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//	Движение.Склад = Склад;
	//	Движение.Номенклатура = СтрокаТЧ.Номенклатура;
	//	Движение.Количество = СтрокаТЧ.Количество;
	//	Движение.Сумма = СтрокаТЧ.Сумма;
	//	Движение.Период = Дата;
	//	КонецЕсли;
	//	КонецЦикла;
	//	//приемка
	//	Если СостояниеНакладнойУПолучателя = Перечисления.СостоянияНакладной.Принята Тогда
	//		Для Каждого СтрокаТЧ Из Товары Цикл
	//	Если ПолучитьРеквизитРодителя(СтрокаТЧ.Номенклатура,"ВидНоменклатуры") =  Перечисления.ВидыНоменклаутры.Упаковка Тогда
	//	Движение = Движения.ОстаткиТМЦзабаланс.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//	Движение.Склад = СкладПолучатель;
	//	Движение.Номенклатура = СтрокаТЧ.Номенклатура;
	//	Движение.Количество = СтрокаТЧ.Количество;
	//	Движение.Сумма = СтрокаТЧ.Сумма;
	//	Движение.Период = ?(Дата >= ДатаПриемки,Дата,ДатаПриемки);
	//	КонецЕсли;
	//	КонецЦикла;
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры
//крохин конец 13.05.2011

//Катаев+ 28/07/14
Процедура УстановитьСостояниеКоррекции(НовоеСостояниеКоррекции) Экспорт
	Отказ = Ложь;
	Если ЭтотОбъект.Дата<=ПолучитьДатуЗапретаРедактирования(ЭтотОбъект) Тогда
		Отказ = Истина;
	КонецЕсли;
	Если Отказ Тогда
		Если	ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение  Тогда
			НеКонтролироватьЗапись=Истина;
			СостояниеКоррекции=НовоеСостояниеКоррекции;
			Записать();
			НеКонтролироватьЗапись=Ложь;	
		КонецЕсли;
	Иначе
		НеКонтролироватьЗапись=Истина;
		СостояниеКоррекции=НовоеСостояниеКоррекции;
		Записать();
		НеКонтролироватьЗапись=Ложь;
	КонецЕсли;
	
КонецПроцедуры
//Катаев- 28/07/14

//кухарь 13.05.15 начало
Процедура УстановитьСостояниеДокументов(НовоеСостояниеДокументов,КодУзла = Неопределено,НЕКонтрольСФ = Неопределено) Экспорт
	Если СостояниеДокументов <> НовоеСостояниеДокументов Тогда
		НеВыгружатьДокумент = Истина;
		НеКонтролироватьЗапись=Истина;
		СостояниеДокументов=НовоеСостояниеДокументов;
		Записать();
		Если КодУзла = Неопределено Тогда
			СписокПолучателей = Новый СписокЗначений;
			Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда		
				Если НЕ ПустаяСтрока(Склад.КодФизическогоУзла) Тогда
					СписокПолучателей.Добавить(Склад.КодФизическогоУзла);
				КонецЕсли;	
				
			Иначе
				
				Если Склад.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда
					СписокПолучателей.Добавить("SNL");					
				КонецЕсли;
			КонецЕсли;
			НЗ = РегистрыСведений.СостояниеДокументов.СоздатьНаборЗаписей();
			НЗ.Отбор.КодУзла.Установить(ПараметрыСеанса.ЭтотУзел.Код,Истина);
			НЗ.Отбор.Документ.Установить(Ссылка,Истина);
			Для Каждого УзелИзСписка Из СписокПолучателей Цикл
				Запись = НЗ.Добавить();
				Запись.Регистратор = Ссылка;
				Запись.Состояние = НовоеСостояниеДокументов;
				Запись.Автор = ПараметрыСеанса.Пользователь;
				Запись.КодУзлаПолучателя = УзелИзСписка;
				Запись.Документ = Ссылка;
				запись.КодУзла =  ПараметрыСеанса.ЭтотУзел.Код;
				Запись.Отработана = Ложь;
			КонецЦикла;
			НЗ.Записать();
		КонецЕсли;
		
		НеКонтролироватьЗапись=Ложь;
		НеВыгружатьДокумент = Ложь;
	КонецЕсли;
	
	Если КодУзла <> Неопределено Тогда
		НЗ = РегистрыСведений.СостояниеДокументов.СоздатьНаборЗаписей();
		НЗ.Отбор.КодУзла.Установить(КодУзла,Истина);
		НЗ.Отбор.КодУзлаПолучателя.Установить(ПараметрыСеанса.ЭтотУзел.Код,Истина);
		НЗ.Отбор.Документ.Установить(Ссылка,Истина);
		НЗ.Записать();
	КонецЕсли;		
КонецПроцедуры
//кухарь 13.05.15 конец 


//Кухарь 03.12.19 начало
//Удалим документы ЗНБ, которые делают проводки
Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	// Кухарь А.Ю.  16.06.2022 начало	
	если не ОбменДанными.Загрузка тогда
		если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.Склад тогда
			если не ПолучитьПолномочиеПользователя("РаспроводитьНакладные") тогда
				СообщитьИзМодуля("Недостаточно прав для распроведения ПРМ");
				отказ=Истина;
			КонецЕсли;
		КонецЕсли;
		
		
		// Кухарь А.Ю.  01.08.2024 начало
		Запрос=новый запрос;
		запрос.Текст=   "ВЫБРАТЬ
		|	ХранилищеКодовМаркировки.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ХранилищеКодовМаркировки КАК ХранилищеКодовМаркировки
		|ГДЕ
		|	ХранилищеКодовМаркировки.Проведен
		|	И ХранилищеКодовМаркировки.ПланФакт = &ПланФакт
		|	И ХранилищеКодовМаркировки.ДокОснование = &Ссылка";
		запрос.УстановитьПараметр("ПланФакт",Перечисления.ПланФакт.Факт);
		запрос.УстановитьПараметр("Ссылка",Ссылка);
		если запрос.Выполнить().Выбрать().Количество()>0 тогда
			Документы.ХранилищеКодовМаркировки.Отменить_ХКМ_к_НАК(Ссылка,Перечисления.ПланФакт.Факт);
		КонецЕсли;
		// Кухарь А.Ю.  01.08.2024 конец
		
	КонецЕсли;
	// Кухарь А.Ю.  16.06.2022 конец
	
	
	если ОбщегоНазначения_ПИ.ЭтоУзел_ODN_или_OD7() тогда 
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ
		|	ЗаданиеНабора.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаданиеНабора КАК ЗаданиеНабора
		|ГДЕ
		|	ЗаданиеНабора.Проведен
		|	И ЗаданиеНабора.Накладная = &Накладная";
		запрос.УстановитьПараметр("Накладная",ЭтотОбъект.Ссылка);
		результат=запрос.Выполнить().Выбрать();
		пока результат.Следующий() цикл
			ЗНБ=результат.Ссылка.получитьобъект();
			если ложь тогда ЗНБ=Документы.ЗаданиеНабора.ПустаяСсылка().ПолучитьОбъект();КонецЕсли;
			ЗНБ.УстановитьПометкуУдаления(Истина);	
		КонецЦикла;
	КонецЕсли;
	
	
	
КонецПроцедуры
//Кухарь 03.12.19 конец	

//Кухарь 25.12.19 начало
Процедура ВернутьИзОтгружено ()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ первые 1
	|	ПланНабора.Ссылка
	|ИЗ
	|	Документ.ПланНабора КАК ПланНабора
	
	|ГДЕ
	|	ПланНабора.ДокОснование = &ДокОснование
	|	И ПланНабора.Проведен";
	запрос.УстановитьПараметр("ДокОснование",Ссылка);			
	Выборка = запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Не Ссылка.Пустая() Тогда
		ПланНабора = Выборка.Ссылка.получитьобъект();
		если ложь тогда ПланНабора=документы.ПланНабора.ПустаяСсылка().ПолучитьОбъект();КонецЕсли;
		НужноЗаписывать=ложь;
		Для каждого СтрТЧ из ПланНабора.тБрэндов цикл
			если СтрТЧ.Состояние<>СостояниеНакладной тогда
				НужноЗаписывать=Истина;
				СтрТЧ.Состояние=СостояниеНакладной;
				
			КонецЕсли;
		КонецЦикла;
		если НужноЗаписывать тогда
			// Кухарь А.Ю.  29.08.2022 начало
			//			ПланНабора.Записать();
			ПланНабора.ЗаписатьБезОбработки(РежимЗаписиДокумента.Запись);			 
			// Кухарь А.Ю.  29.08.2022 конец

		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаданиеНабора.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаданиеНабора КАК ЗаданиеНабора
	|ГДЕ
	|	ЗаданиеНабора.Проведен
	|	И ЗаданиеНабора.Накладная = &Накладная
	|	И ЗаданиеНабора.Дата >= &Дата";
	запрос.УстановитьПараметр("Накладная",Ссылка);		
	запрос.УстановитьПараметр("Дата",ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования());		
	запрос.УстановитьПараметр("СостояниеНакладной",СостояниеНакладной);
	результат=запрос.Выполнить().Выбрать();
	пока результат.Следующий() цикл
		ЗНБ = результат.Ссылка.получитьобъект();
		// Кухарь А.Ю. 24.04.2020 начало
		// есть краткий момент времени когда у ЗНБ уже проводки по резервам вернулись, 
		//а у РНК проводки по остаткам ещё не убрались.Если дату ЗНБ сделать чуть меньше, то трассировки не будет
		ЗНБ.дата=Дата-1;	 
		// Кухарь А.Ю. 24.04.2020 конец    		
		ЗНБ.СостояниеНакладной=СостояниеНакладной;
		// Кухарь А.Ю. 03.06.2021 начало
		// ЗНБ.записать(РежимЗаписиДокумента.Проведение);
		ЗНБ.ЗаписатьЗНББезКонтроляСостояний(РежимЗаписиДокумента.Проведение);		 
		// Кухарь А.Ю. 03.06.2021 конец

	КонецЦикла;
	
КонецПроцедуры
//Кухарь 25.12.19 конец

// Кухарь А.Ю. 07.09.2021 начало
Функция РасчитатьКоличествоПаллет ()
	если склад.ТипСклада=Перечисления.ТипСклада.ПалетноеХранение или СкладПолучатель.ТипСклада=Перечисления.ТипСклада.ПалетноеХранение тогда
		Запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ
		             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Паллета.Ссылка) КАК КоличествоПаллет
		             |ИЗ
		             |	Документ.Паллета КАК Паллета
		             |ГДЕ
		             |	Паллета.Дата >= &Дата
		             |	И Паллета.ЛистыНабора.Документ = &Документ
		             |	И Паллета.Проведен";
		запрос.УстановитьПараметр("Дата",Дата-90*86400);
		запрос.УстановитьПараметр("Документ",ссылка);
		результат=запрос.Выполнить().Выбрать();
		пока результат.Следующий() цикл
			возврат Результат.КоличествоПаллет;
		КонецЦикла;
		
	иначе 
		возврат КоличествоПаллет;
	КонецЕсли;
	
	возврат 0;
КонецФункции
// Кухарь А.Ю. 07.09.2021 конец


// Кухарь А.Ю.  06.08.2024 начало
//
Функция ЭтоУзелОтправителя ()
	если ПолучитьРеквизитШапки(Склад,"КодФизическогоУзла","Справочник") = ПараметрыСеанса.ЭтотУзел.Код тогда
		Возврат Истина;
	КонецЕсли;
	
	//крохин начало 24.12.2024
	Если ПустаяСтрока(ПолучитьРеквизитШапки(Склад,"КодФизическогоУзла","Справочник")) И ПараметрыСеанса.ЭтотУзел.Код = "SNL" Тогда
	    Возврат Истина;
   	КонецЕсли;
	
	//крохин конец 24.12.2024
	
	возврат Ложь;
КонецФункции

Функция ЭтоУзелПолучателя ()
	если ПолучитьРеквизитШапки(СкладПолучатель,"КодФизическогоУзла","Справочник") = ПараметрыСеанса.ЭтотУзел.Код тогда
		Возврат Истина;
	КонецЕсли;
	
	возврат Ложь;
	
КонецФункции

// Кухарь А.Ю.  06.08.2024 конец
//++Данилова Е.В. 21.05.2026 MARK-3718 
Процедура СоздатьХКМ_к_ПРМ_Призаписи()
	
	ТекущееПодразделение=ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла();
	РеквизитыНакладной = ПолучитьРеквизитыШапки(Ссылка, "Склад,СкладПолучатель,Склад.КодФизическогоУзла,СкладПолучатель.КодФизическогоУзла
						|,Склад.КарантинЧЗ,СкладПолучатель.КарантинЧЗ", "Документ"); 
	
	Если РеквизитыНакладной.Склад_КарантинЧЗ = Истина 
		ИЛИ  РеквизитыНакладной.СкладПолучатель_КарантинЧЗ = Истина тогда
		РаботаСКарантином = Истина;
	иначе
		РаботаСКарантином = ложь;
	КонецЕсли; 
	
	ТребуетсяМаркировкаСДаты = ТребуетсяМаркировка и Дата>='20250101'; 
	 
	ЕстьХКМ = Документы.ХранилищеКодовМаркировки.ПроверитьНаличиеХКМ(Ссылка,Перечисления.ПланФакт.Факт,ТекущееПодразделение);
	Если  ТребуетсяМаркировкаСДаты
		И ЭтоУзелОтправителя() тогда 
		
		СостояниеРНКРГ = СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке 
		или  СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена;
		
		//НачСостояниеНеРГ = НачСостНакладной <> Перечисления.СостоянияНакладной.ГотоваКОтгрузке
		//и НачСостНакладной <> Перечисления.СостоянияНакладной.Отгружена; 
		
		НачСостояниеРГ = НачСостНакладной = Перечисления.СостоянияНакладной.ГотоваКОтгрузке
		ИЛИ НачСостНакладной = Перечисления.СостоянияНакладной.Отгружена;
		
		НеСовпадаетКодУзла = РеквизитыНакладной.СкладПолучатель_КодФизическогоУзла <> РеквизитыНакладной.Склад_КодФизическогоУзла;
		
		ЕстьЛН = ОбщегоНазначения_ПИ.ЕстьЛН(Ссылка);
		ЕстьЛНСмарками = ОбщегоНазначения_ПИ.ЕстьЛНСМаркировкой(Ссылка); 
		ТипУзлаСклад = ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.Склад;
		ТипУзлаОфис=  ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение; 
		
		ПРМСНепромаркирТоваром = (ТипУзлаОфис 
		ИЛИ ТипУзлаСклад)
		И ЕстьЛН 
		И НЕ  ЕстьЛНСмарками;
		
		НетЛНСМарками = (ТипУзлаОфис 
		ИЛИ ТипУзлаСклад)
		И НЕ ЕстьЛН 
		И НЕ ЕстьЛНСмарками; 
		
		
		Если  НЕ НачСостояниеРГ 
			ИЛИ НачПроведен = Ложь
			ИЛИ Не естьХКМ Тогда 
			
			Если СостояниеРНКРГ Тогда   			
				
				Если ПРМСНепромаркирТоваром Тогда
					
					СообщитьИзМодуля("Нет ЛН с отсканированным маркированным товаром. ХКМ Создан не будет!");
					
				ИначеЕсли НЕ НетЛНСМарками 
					И   (НеСовпадаетКодУзла
					ИЛИ РаботаСКарантином) Тогда 
					
					РезультатРаботыСХКМ=Документы.ХранилищеКодовМаркировки.Создать_ХКМ_к_РНК(Ссылка);	
					если не РезультатРаботыСХКМ.Успешно тогда
						РезультатРаботыСХКМ.Ошибки.Добавить("Не удалось создать хранилище кодов маркировки");
						СообщитьИзМодуля(СтрСоединить(РезультатРаботыСХКМ.Ошибки,","));
						отказ=Истина;	
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли; 
			
		ИначеЕсли НачСостояниеРГ 
			И НЕ СостояниеРНКРГ Тогда
			
			РезультатРаботыСХКМ=Документы.ХранилищеКодовМаркировки.Отменить_ХКМ_к_НАК(Ссылка,Перечисления.ПланФакт.Факт);				 		
			если не РезультатРаботыСХКМ.Успешно тогда
				РезультатРаботыСХКМ.Ошибки.Добавить("Не удалось создать хранилище кодов маркировки");
				СообщитьИзМодуля(СтрСоединить(РезультатРаботыСХКМ.Ошибки,","));
				отказ=Истина;
			КонецЕсли;
			
			
		КонецЕсли;
		
	ИначеЕсли ТребуетсяМаркировкаСДаты
		И ЭтоУзелПолучателя() Тогда  	
		
		Если РеквизитыНакладной.СкладПолучатель_КодФизическогоУзла=""  тогда
			РеквизитыНакладной.СкладПолучатель_КодФизическогоУзла="SNL";
		КонецЕсли;
		Если РеквизитыНакладной.Склад_КодФизическогоУзла=""  тогда
			РеквизитыНакладной.Склад_КодФизическогоУзла="SNL";
		КонецЕсли;
		ТипУзлаУправляющий = ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение;
		ЕстьЛНСМаркировкой = ОбщегоНазначения_ПИ.ЕстьЛНСМаркировкой(Ссылка);
		СостояниеПринята = СостояниеНакладнойУПолучателя = Перечисления.СостоянияНакладной.Принята; 
		КодПолучателяЭтогоУзла = РеквизитыНакладной.СкладПолучатель_КодФизическогоУзла <> РеквизитыНакладной.Склад_КодФизическогоУзла 		
		И РеквизитыНакладной.СкладПолучатель_КодФизическогоУзла = ПараметрыСеанса.ЭтотУзел.Код; 
		
		Если СостояниеПринята
			И ЕстьЛНСМаркировкой 
			И НЕ ЕстьХКМ 
			И НЕ ТипУзлаУправляющий
			И КодПолучателяЭтогоУзла Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ХранилищеКодовМаркировки.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ХранилищеКодовМаркировки КАК ХранилищеКодовМаркировки
			|ГДЕ
			|	ХранилищеКодовМаркировки.ДокОснование = &ДокОснование
			|	И ХранилищеКодовМаркировки.ПланФакт = &ПланФакт
			|	И ХранилищеКодовМаркировки.КодУзлаСоздания <> &КодЭтогоУзла";	
			Запрос.УстановитьПараметр("ДокОснование",	Ссылка);
			Запрос.УстановитьПараметр("ПланФакт",		Перечисления.ПланФакт.Факт);
			Запрос.УстановитьПараметр("КодЭтогоУзла",	ПараметрыСеанса.ЭтотУзел.Код);
			
			Выборка = Запрос.Выполнить().Выбрать();	
			Пока Выборка.Следующий() Цикл
				ДокОбъектХКМ = Выборка.Ссылка.ПолучитьОбъект();
				ДокОбъектХКМ.ПланФакт = Перечисления.ПланФакт.План;
				ДокОбъектХКМ.ОбменДанными.Загрузка	= Истина;
				
				ДокОбъектХКМ.Записать();		
			КонецЦикла;
			
			РезультатРаботыСХКМ=Документы.ХранилищеКодовМаркировки.Создать_ХКМ_к_ПНК_Факт(Ссылка);	
			если не РезультатРаботыСХКМ.Успешно тогда
				РезультатРаботыСХКМ.Ошибки.Добавить("Не удалось создать хранилище кодов маркировки");
				СообщитьИзМодуля(СтрСоединить(РезультатРаботыСХКМ.Ошибки,","));
				отказ=Истина;	
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//--Данилова Е.В. 21.05.2026 

НеКонтролироватьТА		=Ложь;
