
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)	
	СтандартнаяОбработка = Ложь;
	Если Данные.ВидОперации = Перечисления.ВидыОперацийМаркировки.Агрегация Тогда
		Представление = СтрШаблон("Операция маркировка (%1 (%4)) № %2 от %3", Данные.ВидОперации, Данные.Номер, Формат(Данные.Дата,"ДФ=dd.MM.yyyy"), Данные.ТипШК);
	Иначе
		Представление = СтрШаблон("Операция маркировка (%1) № %2 от %3", Данные.ВидОперации, Данные.Номер, Формат(Данные.Дата,"ДФ=dd.MM.yyyy"));	
	КонецЕсли; 	
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля = СтрРазделить("Дата,Номер,ВидОперации,ТипШК",",");
КонецПроцедуры

Функция ПроверитьДокументПередОтправкойВЧЗ(ДокСсылка) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Реквизиты = ПолучитьРеквизитыШапки(ДокСсылка, "Проведен,Статус,ВидОперации,ДокументОснование");
	Если Реквизиты.Проведен Тогда
		Если Реквизиты.ВидОперации = Перечисления.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов Тогда
			ТекстОшибки = СтрШаблон("Вид операции '%1' не обрабатывается ЧЗ.", Реквизиты.ВидОперации);
			Результат.Ошибки.Добавить(ТекстОшибки);			
		Иначе
			Если Реквизиты.Статус = Перечисления.СтатусыДокументовМаркировки.ВРаботе
				ИЛИ Реквизиты.Статус = Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки
				ИЛИ Реквизиты.Статус = Перечисления.СтатусыДокументовМаркировки.КОбработке Тогда
				//++Данилова Е.В. 03.02.2025
				ДокВводаВОборотГотНаб = ДокументВводаВОборотПередОтправкойВЧЗФормированиеНабора(Реквизиты.ДокументОснование,Реквизиты.ВидОперации); 
				Если НЕ ЗначениеЗаполнено(ДокВводаВОборотГотНаб) Тогда
					Результат.Успешно = Истина;
				Иначе  					
					ТекстОшибки = "Не введены в оборот комплектующие по готовым наборам, документ ""Операция маркировки"" " + ДокВводаВОборотГотНаб; 
					Результат.Ошибки.Добавить(ТекстОшибки);
				КонецЕсли;
				//
				//--Данилова Е.В. 03.02.2025
				
				//++Данилова Е.В. 19.02.2025 MARK-1454
				РезультатПроверки = ПроверитьДокументАТКНаНаличиеГотовыхНаборов(ДокСсылка,Реквизиты.ВидОперации);
				Если НЕ ЗначениеЗаполнено(РезультатПроверки) Тогда
					Результат.Успешно = Истина;
				Иначе  					
					ТекстОшибки = "Товары не могут входить в состав маркировки с типом ""АТК"" (готовые наборы и комплектующие): " + РезультатПроверки; 
					Результат.Ошибки.Добавить(ТекстОшибки);
				КонецЕсли;

				//--Данилова Е.В. 19.02.2025
			Иначе			
				ТекстОшибки = СтрШаблон("Не допустимый статус док-та: %1, статус: '%2', должен быть: 'В работе' или 'К обработке'.", ДокСсылка, Реквизиты.Статус);
				Результат.Ошибки.Добавить(ТекстОшибки);
			КонецЕсли;		
		КонецЕсли;		
		
		Если ТипЗнч(Реквизиты.ДокументОснование) = Тип("ДокументСсылка.МаркировкаТоваровИСМП") Тогда
			Если Реквизиты.ВидОперации = Перечисления.ВидыОперацийМаркировки.АТК Тогда
				ТекстОшибки = СтрШаблон("Не док-т: %1, является дополнением к '%2', обработан может только первичный документ.", ДокСсылка, Реквизиты.ДокументОснование);
				Результат.Ошибки.Добавить(ТекстОшибки);					
				Результат.Успешно = Ложь;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТекстОшибки = СтрШаблон("Документ  '%1' не проведен.", ДокСсылка);
		Результат.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПроверитьДокументПередОтправкойВЧЗ()

Функция ПроверитьДокументПередПолучениемИзЧЗ(ДокСсылка) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Реквизиты = ПолучитьРеквизитыШапки(ДокСсылка, "Проведен,Статус");
	Если Реквизиты.Проведен Тогда
		Если Реквизиты.Статус = Перечисления.СтатусыДокументовМаркировки.Обрабатывается Тогда
			Результат.Успешно = Истина;
		Иначе			
			ТекстОшибки = СтрШаблон("Не допустимый статус док-та: %1, статус: '%2', должен быть: 'Обрабатывается'.", ДокСсылка, Реквизиты.Статус);
			Результат.Ошибки.Добавить(ТекстОшибки);
		КонецЕсли; 	
	Иначе
		Результат.Ошибки.Добавить("Документ не проведен.");
	КонецЕсли;
	
	Возврат Результат;

КонецФункции //ПроверитьДокументПередПолучениемИзЧЗ(ДокСсылка) Экспорт

Функция СоздатьАгрегацииКЗПС(ЗПС_Ссылка) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПоставщикуТовары.Номенклатура.ГТИН КАК ГТИН,
	               |	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(ЗаказПоставщикуТовары.Количество) КАК Количество
	               |ПОМЕСТИТЬ ВТ_Товары
	               |ИЗ
	               |	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	               |ГДЕ
	               |	ЗаказПоставщикуТовары.Ссылка = &ЗПС_Ссылка
	               |	И НЕ(ЗаказПоставщикуТовары.Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.ПустаяСсылка)
	               |				ИЛИ ЗаказПоставщикуТовары.Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.НеПодлежитМаркировке))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказПоставщикуТовары.Номенклатура,
	               |	ЗаказПоставщикуТовары.Номенклатура.ГТИН
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Товары.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТКомплектующиеГН
	               |ИЗ
	               |	ВТ_Товары КАК ВТ_Товары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
	               |		ПО ВТ_Товары.Номенклатура = НоменклатураКоплектующие.Номенклатура
	               |			И (НоменклатураКоплектующие.Ссылка.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект)
	               |				ИЛИ НоменклатураКоплектующие.Ссылка.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)) 
				   //Валетов + 04,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3485
	               |ГДЕ
	               |	НоменклатураКоплектующие.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ВТ_товары.Номенклатура
	               |			ИЗ
	               |				ВТ_товары)  
				   //Валетов -
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ШтрихкодыУпаковокТоваров.Ссылка.Владелец КАК Номенклатура,
	               |	ШтрихкодыУпаковокТоваров.Ссылка КАК Ссылка,
	               |	ШтрихкодыУпаковокТоваров.Ссылка.Наименование КАК СГТИН
	               |ПОМЕСТИТЬ ВТ_КМ
	               |ИЗ
	               |	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	               |ГДЕ
	               |	ШтрихкодыУпаковокТоваров.ЗаказКМ В
	               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |				Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка
	               |			ИЗ
	               |				Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ
	               |			ГДЕ
	               |				Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование = &ЗПС_ссылка)
	               |	И (ШтрихкодыУпаковокТоваров.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Товар)
	               |			ИЛИ ШтрихкодыУпаковокТоваров.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор))
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Товары.Номенклатура КАК Номенклатура,
	               |	ВТ_Товары.Номенклатура.Код КАК Номенклатура_Код,
	               |	ВТ_Товары.Номенклатура.Родитель.ШтукВКоробке КАК ШтукВКоробке,
	               |	ВТ_Товары.Количество КАК Количество,
	               |	ВТ_КМ.Ссылка КАК ШтрихкодУпаковки
	               |ИЗ
	               |	ВТ_Товары КАК ВТ_Товары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КМ КАК ВТ_КМ
	               |		ПО (ВТ_КМ.Номенклатура = ВТ_Товары.Номенклатура)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТКомплектующиеГН КАК ВТКомплектующиеГН
	               |		ПО (ВТКомплектующиеГН.Номенклатура = ВТ_КМ.Номенклатура)
	               |ГДЕ
	               |	ВТКомплектующиеГН.Номенклатура ЕСТЬ NULL
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВТ_Товары.Номенклатура.Наименование,
	               |	ВТ_КМ.СГТИН
	               |ИТОГИ
	               |	МАКСИМУМ(ШтукВКоробке),
	               |	МАКСИМУМ(Количество),
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодУпаковки)
	               |ПО
	               |	Номенклатура";		
	
	Запрос.УстановитьПараметр("ЗПС_Ссылка", ЗПС_Ссылка);	
	
	рЗапроса 				= Запрос.Выполнить();	
	
	Выборка_Номенклатура 	= рЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Номенклатура");	
	
	ЧислоКодовВДокументе	= 50000;
	НомерДокумента			= 1;
	ДокОбъект 				= Неопределено;
	ВидОперацииИСМП			= Перечисления.ВидыОперацийИСМП.Агрегация;
	
	НомерКА 				= 1;
	
	ГЛН 					= Лев(Справочники.КодыGLN.ПолучитьДействующийГЛН(ЗПС_Ссылка.Организация),9);
	
	рОчистки 				= ОчиститьПодчиненныеДокументыМаркировки(ЗПС_Ссылка, Перечисления.ВидыОперацийИСМП.Агрегация);
	Если рОчистки.Успешно Тогда
		СуществующиеДокументы = рОчистки.СуществующиеДокументы;
		
		Пока Выборка_Номенклатура.Следующий() Цикл		
			Если Выборка_Номенклатура.ШтрихкодУпаковки <> Выборка_Номенклатура.Количество Тогда
				ТекстОшибки = СтрШаблон(
					"Не совпадает количество полученных КМ с количеством в ЗПС ! Кол-во кодов: %1, штук товара в ЗПС: %2, номенклатура: %3 (%4)",					
					 Выборка_Номенклатура.ШтрихкодУпаковки, Выборка_Номенклатура.Количество,
					 Выборка_Номенклатура.Номенклатура, Выборка_Номенклатура.Номенклатура_Код,
				);	
				Результат.Ошибки.Добавить(ТекстОшибки
				);				
				Продолжить;			
			КонецЕсли; 
			ШтукВКоробке	= Выборка_Номенклатура.ШтукВКоробке;
			
			//+++Чирков Д.С. 27.03.2026 MARK-3531 "необходимо при распределении кодов агрегации для импортных заказов выдавать также коды агрегации на неполные короба"
			//НадоСписать	= ШтукВКоробке*Цел(Выборка_Номенклатура.Количество/ШтукВКоробке);
			НадоСписать		= Выборка_Номенклатура.Количество;
			Сч				= 0;
			//---Чирков Д.С. 27.03.2026
			
			Выборка = Выборка_Номенклатура.Выбрать();
			
			Пока Выборка.Следующий() И НадоСписать > 0 Цикл
				Если ДокОбъект <> Неопределено И ДокОбъект.ШтрихКодыУпаковок.Количество() >= ЧислоКодовВДокументе И НадоСписать % Выборка_Номенклатура.ШтукВКоробке = 0 Тогда					
					ДокОбъект.ЗаполнитьТоварыПоКМ();
					
					ДокОбъект.Дата	= ТекущаяДата();
					ДокОбъект.ПометкаУдаления = Ложь;
					ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
					
					рЗаполнения = ЗаполнитьКодыКоробокДляИмпорта(ДокОбъект);
					Если рЗаполнения.Успешно Тогда
						ДокОбъект.Статус = Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки;
						ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
					Иначе
						МаркировкаКС.ДобавитьОшибки(Результат, рЗаполнения);
					КонецЕсли; 
					
					Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;
				
					НомерДокумента	= НомерДокумента + 1;					
					ДокОбъект		= Неопределено;
				КонецЕсли;							
				
				Если ДокОбъект = Неопределено Тогда
					ДокОбъект = Документы.МаркировкаТоваровИСМП.ПолучитьСоздатьДокМаркировки(ЗПС_Ссылка, СуществующиеДокументы, НомерДокумента, ВидОперацииИСМП);					
				КонецЕсли;				
				
				СтрокаТЧ = ДокОбъект.ШтрихкодыУпаковок.Добавить();
				СтрокаТЧ.ШтрихкодУпаковки	= Выборка.ШтрихкодУпаковки;
				СтрокаТЧ.КодАгрегации		= НомерКА;		
				
				//+++Чирков Д.С. 27.03.2026 MARK-3531
				Сч = Сч + 1;
				//---Чирков Д.С. 27.03.2026
				
				НадоСписать = НадоСписать - 1;
				//+++Чирков Д.С. 27.03.2026 MARK-3531
				//Если НадоСписать % ШтукВКоробке = 0 Тогда
				Если Сч % ШтукВКоробке = 0 Тогда
				//---Чирков Д.С. 27.03.2026					
					НомерКА = НомерКА + 1;
				КонецЕсли; 
			КонецЦикла;
			
			//+++Чирков Д.С. 27.03.2026 MARK-3531
			Если Сч % ШтукВКоробке <> 0 Тогда
				НомерКА = НомерКА + 1;			
			КонецЕсли;			           
			//---Чирков Д.С. 27.03.2026
		КонецЦикла;  			
	Иначе
		Результат.Успешно = Ложь;
		МаркировкаКС.ДобавитьОшибки(Результат, рОчистки);
	КонецЕсли; 
	
	Если ДокОбъект<>Неопределено И ДокОбъект.ШтрихкодыУпаковок.Количество() > 0 Тогда		
		ДокОбъект.ЗаполнитьТоварыПоКМ();
		
		ДокОбъект.Дата	= ТекущаяДата();
		ДокОбъект.ПометкаУдаления = Ложь; 
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);	
		
		рЗаполнения = ЗаполнитьКодыКоробокДляИмпорта(ДокОбъект);
		Если рЗаполнения.Успешно Тогда
			ДокОбъект.Статус = Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки;
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			МаркировкаКС.ДобавитьОшибки(Результат, рЗаполнения);
		КонецЕсли;
		
		Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;
	КонецЕсли; 
	
	Результат.Успешно = (Результат.Ошибки.Количество()=0 И Результат.ОбработаноОбъектов > 0);
	
	Возврат Результат;
	
КонецФункции //СоздатьАгрегацииКЗПС(ЗПС_Ссылка)

Функция СоздатьАгрегацииККП(КП_Ссылка) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Номенклатура.ГТИН 	КАК ГТИН,
	|	Номенклатура 		КАК Номенклатура,
	|	СУММА(Количество)	КАК Количество
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.КонтрактСПроизводителем.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	Ссылка = &КП_Ссылка
	|	И НЕ(
	|		Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.ПустаяСсылка)
	|		ИЛИ Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.НеПодлежитМаркировке)
	|	)	
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура
	|;	
	|ВЫБРАТЬ
	|	Ссылка.Владелец 	КАК Номенклатура,
	|	Ссылка 				КАК Ссылка,
	|	Ссылка.Наименование КАК СГТИН
	|ПОМЕСТИТЬ ВТ_КМ
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	ЗаказКМ В
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Ссылка
	|	ИЗ
	|		Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ
	|	ГДЕ
	|		Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование = &КП_Ссылка
	|	)
	|	И (
	|		ШтрихкодыУпаковокТоваров.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Товар)	
	|	    ИЛИ ШтрихкодыУпаковокТоваров.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор)
	|	)	
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура	
	|;	
	|ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура 							КАК Номенклатура,
	|	ВТ_Товары.Номенклатура.Код 						КАК Номенклатура_Код,
	|	ВТ_Товары.Номенклатура.Родитель.ШтукВКоробке 	КАК ШтукВКоробке,
	|	ВТ_Товары.Количество 							КАК Количество,
	|	ВТ_КМ.Ссылка									КАК ШтрихкодУпаковки
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	ВТ_КМ КАК ВТ_КМ
	|ПО 
	|	ВТ_КМ.Номенклатура = ВТ_Товары.Номенклатура	
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Товары.Номенклатура.Наименование,
	|	ВТ_КМ.СГТИН
	|ИТОГИ
	|	МАКСИМУМ(ШтукВКоробке),
	|	МАКСИМУМ(Количество),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодУпаковки)
	|ПО
	|	Номенклатура";		
	
	Запрос.УстановитьПараметр("КП_Ссылка", КП_Ссылка);	
	
	рЗапроса 				= Запрос.Выполнить();	
	
	Выборка_Номенклатура 	= рЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Номенклатура");	
	
	ЧислоКодовВДокументе	= 50000;
	НомерДокумента			= 1;
	ДокОбъект 				= Неопределено;
	ВидОперацииИСМП			= Перечисления.ВидыОперацийИСМП.Агрегация;
	
	НомерКА 				= 1;
	
	ГЛН 					= Лев(Справочники.КодыGLN.ПолучитьДействующийГЛН(КП_Ссылка.Организация), 9);
	
	рОчистки 				= ОчиститьПодчиненныеДокументыМаркировки(КП_Ссылка, Перечисления.ВидыОперацийИСМП.Агрегация);
	Если рОчистки.Успешно Тогда
		СуществующиеДокументы = рОчистки.СуществующиеДокументы;
		
		Пока Выборка_Номенклатура.Следующий() Цикл		
			Если Выборка_Номенклатура.ШтрихкодУпаковки <> Выборка_Номенклатура.Количество Тогда
				ТекстОшибки = СтрШаблон(
					"Не совпадает количество полученных КМ с количеством в КП ! Кол-во кодов: %1, штук товара в КП: %2, номенклатура: %3 (%4)",					
					 Выборка_Номенклатура.ШтрихкодУпаковки, Выборка_Номенклатура.Количество,
					 Выборка_Номенклатура.Номенклатура, Выборка_Номенклатура.Номенклатура_Код,
				);	
				Результат.Ошибки.Добавить(ТекстОшибки
				);				
				Продолжить;			
			КонецЕсли; 
			ШтукВКоробке	= Выборка_Номенклатура.ШтукВКоробке;
			
			// Кельманов А.В. - Проблема 0000000220 - 2026.07.15 {
			// По аналогии с функцией СоздатьАгрегацииКЗПС(ЗПС_Ссылка)
			// "необходимо при распределении кодов агрегации для импортных заказов выдавать также коды агрегации на неполные короба"
			//НадоСписать = ШтукВКоробке*Цел(Выборка_Номенклатура.Количество/ШтукВКоробке);
			НадоСписать = Выборка_Номенклатура.Количество;
			Сч = 0;
			// Кельманов А.В. - Проблема 0000000220 - 2026.07.15 }
			
			Выборка = Выборка_Номенклатура.Выбрать();
			
			Пока Выборка.Следующий() И НадоСписать > 0 Цикл
				Если ДокОбъект <> Неопределено И ДокОбъект.ШтрихКодыУпаковок.Количество() >= ЧислоКодовВДокументе И НадоСписать % Выборка_Номенклатура.ШтукВКоробке = 0 Тогда					
					ДокОбъект.ЗаполнитьТоварыПоКМ();
					
					ДокОбъект.Дата	= ТекущаяДата();
					ДокОбъект.ПометкаУдаления = Ложь;
					ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
					
					рЗаполнения = ЗаполнитьКодыКоробокДляИмпорта(ДокОбъект);
					Если рЗаполнения.Успешно Тогда
						ДокОбъект.Статус = Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки;
						ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
					Иначе
						МаркировкаКС.ДобавитьОшибки(Результат, рЗаполнения);
					КонецЕсли; 
					
					Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;
				
					НомерДокумента	= НомерДокумента + 1;					
					ДокОбъект		= Неопределено;
				КонецЕсли;							
				
				Если ДокОбъект = Неопределено Тогда
					ДокОбъект = Документы.МаркировкаТоваровИСМП.ПолучитьСоздатьДокМаркировки(КП_Ссылка, СуществующиеДокументы, НомерДокумента, ВидОперацииИСМП);					
				КонецЕсли;				
				
				СтрокаТЧ = ДокОбъект.ШтрихкодыУпаковок.Добавить();
				СтрокаТЧ.ШтрихкодУпаковки	= Выборка.ШтрихкодУпаковки;
				СтрокаТЧ.КодАгрегации		= НомерКА;		
				
				// Кельманов А.В. - Проблема 0000000220 - 2026.07.15 {
				// По аналогии с функцией СоздатьАгрегацииКЗПС(ЗПС_Ссылка)
				// "необходимо при распределении кодов агрегации для импортных заказов выдавать также коды агрегации на неполные короба"
				//НадоСписать = НадоСписать-1;
				//Если НадоСписать % ШтукВКоробке = 0 Тогда
				//	НомерКА = НомерКА + 1; 				
				//КонецЕсли; 
				Сч = Сч + 1;				
				НадоСписать = НадоСписать - 1;
				
				Если Сч % ШтукВКоробке = 0 Тогда
					НомерКА = НомерКА + 1;
				КонецЕсли;
				// Кельманов А.В. - Проблема 0000000220 - 2026.07.15 }
				
			КонецЦикла;

			// Кельманов А.В. - Проблема 0000000220 - 2026.07.15 {
			// По аналогии с функцией СоздатьАгрегацииКЗПС(ЗПС_Ссылка)
			// "необходимо при распределении кодов агрегации для импортных заказов выдавать также коды агрегации на неполные короба"
			Если Сч % ШтукВКоробке <> 0 Тогда
				НомерКА = НомерКА + 1;			
			КонецЕсли;			           
			// Кельманов А.В. - Проблема 0000000220 - 2026.07.15 }

		КонецЦикла;  			
	Иначе
		Результат.Успешно = Ложь;
		МаркировкаКС.ДобавитьОшибки(Результат, рОчистки);
	КонецЕсли; 
	
	Если ДокОбъект<>Неопределено И ДокОбъект.ШтрихкодыУпаковок.Количество() > 0 Тогда		
		ДокОбъект.ЗаполнитьТоварыПоКМ();
		
		ДокОбъект.Дата	= ТекущаяДата();
		ДокОбъект.ПометкаУдаления = Ложь; 
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);	
		
		рЗаполнения = ЗаполнитьКодыКоробокДляИмпорта(ДокОбъект);
		Если рЗаполнения.Успешно Тогда
			ДокОбъект.Статус = Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки;
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			МаркировкаКС.ДобавитьОшибки(Результат, рЗаполнения);
		КонецЕсли;
		
		Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;
	КонецЕсли; 
	
	Результат.Успешно = (Результат.Ошибки.Количество()=0 И Результат.ОбработаноОбъектов > 0);
	
	Возврат Результат;	
КонецФункции //СоздатьАгрегацииККП(КП_Ссылка)

Функция ЗаполнитьКодыКоробокДляИмпорта(ДокАгрегации)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Если 1 = 2 Тогда
		ДокАгрегации = Документы.МаркировкаТоваровИСМП.СоздатьДокумент();
	КонецЕсли;
	
	Коды = ДокАгрегации.ШтрихкодыУпаковок.Выгрузить(,"КодАгрегации");
	Коды.Свернуть("КодАгрегации");
	Коды = Коды.ВыгрузитьКолонку("КодАгрегации");	
	
	НачатьТранзакцию();
	//НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	//РегистрыСведений.СтатусыКМ_Факт.ЗаблокироватьТаблицу();
		
	ДопПараметры 	= Новый Структура("Статус,СпособВводаВОборот", Перечисления.СтатусыКодовМаркировкиФакт.Эмитирован, Перечисления.СпособыВводаВОборотСУЗ.Импорт);		
	рПолучения 		= Справочники.ШтрихкодыУпаковокТоваров.ПолучитьСвободныеКодыАгрегации(Перечисления.ТипыШтрихКодов.Коробка, Перечисления.ТипыУпаковок.МонотоварнаяУпаковка, Коды.Количество(), ДопПараметры);
		
	Если рПолучения.Успешно Тогда
		РегистрыСведений.СтатусыКМ_Факт.УстановитьСтатусКМ(рПолучения.Данные, Перечисления.СтатусыКодовМаркировкиФакт.ПереданПоставщику, ДокАгрегации.Ссылка, Новый Структура("ИспользоватьУправляемыеБлокировки", Истина));
		
		Если ТранзакцияАктивна() Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
		КодыКоробок = Новый Соответствие;
		Для Сч = 0 По Коды.Количество() - 1 Цикл
			КодыКоробок[Коды[Сч]] = рПолучения.Данные[Сч];			
		КонецЦикла; 
		
		Для Каждого СтрокаТЧ Из ДокАгрегации.ШтрихкодыУпаковок Цикл
			СтрокаТЧ.ШтрихкодКоробки = КодыКоробок[СтрокаТЧ.КодАгрегации];		
			СтрокаТЧ.КодАгрегации = СтрокаТЧ.ШтрихкодКоробки;
		КонецЦикла; 
	Иначе
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;		
		МаркировкаКС.ДобавитьОшибки(Результат, рПолучения);		
	КонецЕсли;
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;
КонецФункции //ЗаполнитьКодыКоробок(ДокАгрегации) 

Функция СоздатьАгрегацииКЗПСпоВыбраннымКодам(ЗПС_Ссылка, ТаблицаАгрегации, Очищать = Ложь) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_ТаблицаАгрегации_Нов ИЗ &ТаблицаАгрегации КАК ТаблицаАгрегации 
	|;
	|ВЫБРАТЬ
	|	КодАгрегации,
	|	ШтрихкодУпаковки
	|ПОМЕСТИТЬ ВТ_ТаблицаАгрегации
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка.ДокументОснование = &ЗПС_Ссылка
	|	И Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация)
	|	И НЕ Ссылка.ПометкаУдаления
	|	И НЕ &Очищать
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ
	|	КодАгрегации,
	|	ШтрихкодУпаковки	
	|ИЗ
	|	ВТ_ТаблицаАгрегации_Нов	
	|;	
	|ВЫБРАТЬ
	|	КодАгрегации									КАК КодАгрегации,
	|
	|	ШтрихкодУпаковки.Владелец						КАК Номенклатура,	
	|	ШтрихкодУпаковки.Владелец.Родитель.ШтукВКоробке	КАК ШтукВКоробке,
	|	ШтрихкодУпаковки								КАК ШтрихкодУпаковки
	|ИЗ
	|	ВТ_ТаблицаАгрегации	
	|УПОРЯДОЧИТЬ ПО
	|	ШтрихкодУпаковки.Владелец.Наименование,
	|	КодАгрегации,
	|	ШтрихкодУпаковки.Наименование
	|ИТОГИ ПО
	|	КодАгрегации
	|";
	
	Запрос.УстановитьПараметр("ЗПС_Ссылка", 		ЗПС_Ссылка);
	Запрос.УстановитьПараметр("ТаблицаАгрегации",	ТаблицаАгрегации);
	Запрос.УстановитьПараметр("Очищать",			Очищать);
	
	рЗапроса 				= Запрос.Выполнить();	
	
	Выборка_КодАгрегации 	= рЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "КодАгрегации");	
	
	ЧислоКодовВДокументе	= 50000;
	НомерДокумента			= 1;
	ДокОбъект 				= Неопределено;
	ВидОперацииИСМП			= Перечисления.ВидыОперацийИСМП.Агрегация;
	
	рОчистки 				= ОчиститьПодчиненныеДокументыМаркировки(ЗПС_Ссылка, Перечисления.ВидыОперацийИСМП.Агрегация);
	Если рОчистки.Успешно Тогда
		СуществующиеДокументы = рОчистки.СуществующиеДокументы;	
		
		Пока Выборка_КодАгрегации.Следующий() Цикл			
			Выборка = Выборка_КодАгрегации.Выбрать();
			
			Пока Выборка.Следующий() Цикл				
				Если ДокОбъект = Неопределено Тогда
					ДокОбъект	= Документы.МаркировкаТоваровИСМП.ПолучитьСоздатьДокМаркировки(ЗПС_Ссылка, СуществующиеДокументы, НомерДокумента, ВидОперацииИСМП);	
				КонецЕсли;				
				
				СтрокаТЧ = ДокОбъект.ШтрихкодыУпаковок.Добавить();
				СтрокаТЧ.ШтрихкодУпаковки	= Выборка.ШтрихкодУпаковки;
				СтрокаТЧ.КодАгрегации		= Выборка.КодАгрегации;				
			КонецЦикла;
			
			Если ДокОбъект <> Неопределено И ДокОбъект.ШтрихКодыУпаковок.Количество() >= ЧислоКодовВДокументе  Тогда
				ЗаписатьДокументМаркировки(ДокОбъект, РежимЗаписиДокумента.Проведение);					
				Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;
				
				НомерДокумента	= НомерДокумента + 1;					
				ДокОбъект		= Неопределено;
			КонецЕсли;							
		КонецЦикла;  			
	Иначе
		Результат.Успешно = Ложь;
		МаркировкаКС.ДобавитьОшибки(Результат, рОчистки);
	КонецЕсли; 
	
	Если ДокОбъект<>Неопределено И ДокОбъект.ШтрихкодыУпаковок.Количество() > 0 Тогда		
		ЗаписатьДокументМаркировки(ДокОбъект, РежимЗаписиДокумента.Проведение);	
		Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;
	КонецЕсли; 
	
	Результат.Успешно = (Результат.Ошибки.Количество()=0 И Результат.ОбработаноОбъектов > 0);
	
	Возврат Результат;	
КонецФункции //СоздатьАгрегацииКЗПСпоВыбраннымКодам(ЗПС_Ссылка, ТаблицаАгрегации) Экспорт

Функция СоздатьАгрегацииКЗПСпоСпискуКМ(ЗПС_Ссылка, КодыМаркировки) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "	
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_КМ ИЗ &КодыМаркировки КАК КодыМаркировки
	|;	
	|ВЫБРАТЬ
	|	ШтрихКодКоробки						                КАК ШтрихКодКоробки,
	|	ШтрихКодКоробки.Наименование						КАК КодАгрегации,
	|	ШтрихКодУпаковки.Владелец							КАК Номенклатура,
	|	ШтрихКодУпаковки.Владелец.Код						КАК Номенклатура_Код,
	|	ШтрихКодУпаковки.Владелец.Родитель.ШтукВКоробке		КАК ШтукВКоробке,
	|	1													КАК Количество,
	|
	|	ШтрихКодУпаковки									КАК ШтрихкодУпаковки
	|ИЗ
	|	ВТ_КМ	
	|УПОРЯДОЧИТЬ ПО
	|	ШтрихКодУпаковки.Владелец.Наименование,
	|	ШтрихКодУпаковки.Наименование
	|ИТОГИ 	
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодУпаковки)	
	|ПО
	|	Номенклатура,
	|	ШтрихКодКоробки	
	|";		
	
	Запрос.УстановитьПараметр("КодыМаркировки", КодыМаркировки);	
	
	рЗапроса 				= Запрос.Выполнить();	
	
	Выборка_Номенклатура 	= рЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Номенклатура");	
	
	МаксЧислоКодовВДокументе= 75000;
	НомерДокумента			= 1;
	ДокОбъект 				= Неопределено;
	ВидОперацииИСМП			= Перечисления.ВидыОперацийИСМП.Агрегация;	
	
	рОчистки 				= ОчиститьПодчиненныеДокументыМаркировки(ЗПС_Ссылка, Перечисления.ВидыОперацийИСМП.Агрегация);
	Если рОчистки.Успешно Тогда
		СуществующиеДокументы  = рОчистки.СуществующиеДокументы;		
		
		Пока Выборка_Номенклатура.Следующий() Цикл		
			Выборка_ШтрихКодКоробки = Выборка_Номенклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ШтрихКодКоробки");
			
			Пока Выборка_ШтрихКодКоробки.Следующий() Цикл			
				Выборка = Выборка_ШтрихКодКоробки.Выбрать();
				
				Если ДокОбъект <> Неопределено И (ДокОбъект.ШтрихкодыУпаковок.Количество() + Выборка.Количество()) > МаксЧислоКодовВДокументе Тогда
					ДокОбъект.Статус = Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки;
					
					ДокОбъект.ЗаполнитьТоварыПоКМ();                
					
					ДокОбъект.ПометкаУдаления	= Ложь;					
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);					
					
					//+++Чирков 15.10.2025 MARK-3130 - вынесено в отложенную обработку при проведении - тут не нужно
					//Документы.МаркировкаТоваровИСМП.ПроверитьЗаполнитьСоставАгрегационныхКодов(ДокОбъект.Ссылка);
					//---Чирков 15.10.2025
			
					ДокОбъект = Неопределено;
					
					НомерДокумента = НомерДокумента + 1;
					
					Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;
				КонецЕсли;				
				
				Если ДокОбъект = Неопределено Тогда
					ДокОбъект		= Документы.МаркировкаТоваровИСМП.ПолучитьСоздатьДокМаркировки(ЗПС_Ссылка, СуществующиеДокументы, НомерДокумента, ВидОперацииИСМП);	
				КонецЕсли;
				
				Пока Выборка.Следующий() Цикл
					СтрокаТЧ = ДокОбъект.ШтрихкодыУпаковок.Добавить();
					СтрокаТЧ.ШтрихкодУпаковки	= Выборка.ШтрихкодУпаковки;
					СтрокаТЧ.ШтрихкодКоробки	= Выборка.ШтрихкодКоробки;
					СтрокаТЧ.КодАгрегации		= Выборка.КодАгрегации;				
				КонецЦикла;								
			КонецЦикла;			
			
		КонецЦикла;  			
	Иначе
		Результат.Успешно = Ложь;
		МаркировкаКС.ДобавитьОшибки(Результат, рОчистки);
	КонецЕсли; 
	
	Если ДокОбъект<>Неопределено И ДокОбъект.ШтрихкодыУпаковок.Количество() > 0 Тогда		
		ДокОбъект.Статус = Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки;
		
		ДокОбъект.ЗаполнитьТоварыПоКМ();
		
		ДокОбъект.ПометкаУдаления = Ложь; 
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);	
		
		//+++Чирков 15.10.2025 MARK-3130 - вынесено в отложенную обработку при проведении - тут не нужно
		//Документы.МаркировкаТоваровИСМП.ПроверитьЗаполнитьСоставАгрегационныхКодов(ДокОбъект.Ссылка);
		//---Чирков 15.10.2025
		
		Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;
	КонецЕсли; 
	
	Результат.Успешно = (Результат.Ошибки.Количество()=0 И Результат.ОбработаноОбъектов > 0);
	
	Возврат Результат;
	
КонецФункции //СоздатьАгрегацииКЗПС(ЗПС_Ссылка)

Функция СоздатьБронированиеSSCCкЗПС(ЗПС_Ссылка) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);	
	
	ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ПустаяСсылка();
	ПодчДокументы = ПолучитьПодчиненныеДокументыМаркировки(ЗПС_Ссылка, ВидОперацииИСМП);
	
	Если ПодчДокументы.Количество() = 0  Тогда
		КоличествоКодовSSCC = КоличествоМоноКоробокЗПС(ЗПС_Ссылка);	
	
		Если КоличествоКодовSSCC > 0 Тогда
			ДокОбъект = ПолучитьСоздатьДокМаркировки(ЗПС_Ссылка, Новый Соответствие, 0, ВидОперацииИСМП);
			
			ДокОбъект.ВидОперацииИСМП		= Неопределено;
			ДокОбъект.ВидОперации 			= Перечисления.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов;
			ДокОбъект.КоличествоКодовSSCC   = КоличествоКодовSSCC;
			ДокОбъект.Статус				= Перечисления.СтатусыДокументовМаркировки.КОбработке; 								
			ДокОбъект.ПодразделениеНанесения= ПолучитьРеквизитШапки(ЗПС_Ссылка, "Контрагент");
			ДокОбъект.фКодыАгрегацийДляПоставщиков = Истина;
			
			Попытка
			    ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);			
				Результат.ОбработаноОбъектов = 1;
				Результат.Успешно = Истина;
			Исключение
				Результат.Ошибки.Добавить("Не удалось забронировать коды SSCC ! "+ОписаниеОшибки());			
			КонецПопытки;
		Иначе
			Результат.Ошибки.Добавить("В ЗПС "+ЗПС_Ссылка+" нулевое количество моно-коробов с маркируемым товаром !");			
		КонецЕсли;
	Иначе
		Результат.Ошибки.Добавить("К ЗПС "+ЗПС_Ссылка+" уже оформлены агрегации или бронирования !");
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции //СоздатьБронированиеSSCCкЗПС(ЗПС_Ссылка)

Функция КоличествоМоноКоробокЗПС(ЗПС_Ссылка)
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ	
	|	Номенклатура,
	|	Номенклатура.Родитель.ШтукВКоробке	КАК ШтукВКоробке,
	|	СУММА(Количество) 					КАК Количество	
	|ИЗ
	|	" + ЗПС_Ссылка.Метаданные().ПолноеИмя() + ".Товары
	|ГДЕ
	|	Ссылка = &ЗПС_Ссылка
	|	И НЕ (
	|		Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.ПустаяСсылка)
	|		ИЛИ Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.НеПодлежитМаркировке)
	|	)		
	|СГРУППИРОВАТЬ ПО	
	|	Номенклатура
	|";		
	
	Запрос.УстановитьПараметр("ЗПС_Ссылка", ЗПС_Ссылка);	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Результат + Цел(Выборка.Количество/Выборка.ШтукВКоробке);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции //КоличествоЦелыхКоробокЗПС(ЗПС_Ссылка) 

Функция ЗаписатьДокументМаркировки(ДокОбъект, Знач РежимЗаписи = Неопределено) Экспорт	
	Если РежимЗаписи = Неопределено Тогда
		Если ДокОбъект.Проведен Тогда			
		    РежимЗаписи = РежимЗаписиДокумента.Проведение;
		Иначе
			РежимЗаписи = РежимЗаписиДокумента.Запись;			
		КонецЕсли; 		
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ДокОбъект.ПометкаУдаления = Ложь;	
	КонецЕсли;
	
	ДокОбъект.ЗаполнитьТоварыПоКМ();
					
	ДокОбъект.ПометкаУдаления = Ложь;
	ДокОбъект.Записать(РежимЗаписи);
КонецФункции //ЗаписатьДокументМаркировки(ДокОбъект, Знач РежимЗаписи = Неопределено)	

Функция ПолучитьПоследнийКодАгрегации(Организация, ДокументОснование = Неопределено) Экспорт
	Запрос = Новый ("Запрос");
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КодАгрегации
	|ПОМЕСТИТЬ ВТ_1
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
	|ГДЕ
	|	(Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация)
	|				И Ссылка.ДокументОснование <> &ДокументОснование
	|			ИЛИ Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов))
	//|	И Ссылка.Организация = &Организация
	|	И ПОДСТРОКА(КодАгрегации, 2, 9) = &Префикс
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	Документ.МаркировкаТоваровИСМП
	|
	|УПОРЯДОЧИТЬ ПО
	|	МаркировкаТоваровИСМПШтрихкодыУпаковок.КодАгрегации УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Наименование КАК КодАгрегации
	|ПОМЕСТИТЬ ВТ_2
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.ЛогистическаяУпаковка)
	|	И НЕ Наименование ПОДОБНО ""%\_%"" СПЕЦСИМВОЛ ""\""
	//|	И ШтрихкодыУпаковокТоваров.ЗаказКМ.Организация = &Организация
	|	И ПОДСТРОКА(Наименование, 2, 9) = &Префикс
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	Справочник.ШтрихкодыУпаковокТоваров
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодАгрегации УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Сводный.КодАгрегации КАК КодАгрегации
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_1.КодАгрегации КАК КодАгрегации
	|	ИЗ
	|		ВТ_1 КАК ВТ_1
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_2.КодАгрегации
	|	ИЗ
	|		ВТ_2 КАК ВТ_2) КАК Сводный
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сводный.КодАгрегации УБЫВ";
	
	Запрос.УстановитьПараметр("Организация", 		Организация);	
	Запрос.УстановитьПараметр("ДокументОснование", 	ДокументОснование);	
	// Кухарь А.Ю.  01.10.2024 начало                                              
	GLN = Лев(Справочники.КодыGLN.ПолучитьДействующийГЛН(Организация), 9);
	Запрос.УстановитьПараметр("Префикс", GLN);		 
	// Кухарь А.Ю.  01.10.2024 конец
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.КодАгрегации) Тогда
		Результат = Число(Лев(Прав(СокрЛП(Выборка.КодАгрегации),8),7));
	Иначе
		Результат = 0;			
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПолучитьПоследнийКодАгрегации(Организация, ДокументОснование = Неопределено) Экспорт

Функция СформироватьSSCC(ПрефиксGLN, Номер, Расширение = 0) Экспорт
	Результат = ""+Расширение+ПрефиксGLN+Формат(Номер, "ЧЦ=7; ЧВН=; ЧГ=");
	
	Возврат Результат + МаркировкаКС.КонтрольныйСимволSSCC(Результат);
КонецФункции // ()

Функция Создать_ЗапросыНаАТК_МАШ(МАШ_Ссылка, Знач ДопПараметры = Неопределено) Экспорт
	Результат 			= МаркировкаКС.СтруктураРезультата(Ложь);
	
	ВидОперацииИСМП		= Перечисления.ВидыОперацийИСМП.АТК;     
	
	Если ТипЗнч(ДопПараметры) <> Тип("Структура") Тогда
		ДопПараметры = Новый Структура;	
	КонецЕсли;
	
	ЧислоКодовВПорции	= 90000;
	НомерДокумента		= 1;	
	
	рОчистки 			= ОчиститьПодчиненныеДокументыМаркировки(МАШ_Ссылка, Перечисления.ВидыОперацийИСМП.АТК);	
	
	Если рОчистки.Успешно Тогда
		СуществующиеДокументы	= рОчистки.СуществующиеДокументы;		
		
		ДопПараметры.Вставить("ДлиннаКодаТНВЭД", 10); // Кухарь А.Ю.  28.08.2024 - полный код ТНВЭД
		рЗапроса				= Получить_КодыМаркировкиМАШ_ДляАТК(МАШ_Ссылка, ДопПараметры); 
		
		Выборка_ПорядковыйНомерАТК = рЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ПорядковыйНомерАТК");
		Если Выборка_ПорядковыйНомерАТК.Количество() = 0 Тогда
			Результат.Ошибки.Добавить("Не найдены КМ к МАШ " + МАШ_Ссылка + " !");
		КонецЕсли;
		
		Пока Выборка_ПорядковыйНомерАТК.Следующий() Цикл			
			Выборка_ТНВЭД = Выборка_ПорядковыйНомерАТК.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ТНВЭД_Группа");		
			
			Пока Выборка_ТНВЭД.Следующий() Цикл
				ДокОбъект = Неопределено;			
				ОсновнойДокумент = Документы.МаркировкаТоваровИСМП.ПустаяСсылка();
				
				Выборка = Выборка_ТНВЭД.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если ДокОбъект = Неопределено Тогда
						ДокОбъект			= ПолучитьСоздатьДокМаркировки(МАШ_Ссылка, СуществующиеДокументы, НомерДокумента, ВидОперацииИСМП);
						ДокОбъект.ТНВЭД 	= Справочники.ТНВЭД.НайтиПоКоду(Выборка_ТНВЭД.ТНВЭД_Группа);
						
						ДокОбъект.Комментарий = "Порядковый № АТК: " + Выборка_ПорядковыйНомерАТК.ПорядковыйНомерАТК;
					КонецЕсли;
					
					Если Выборка.КМ_Штука_Наименование = Null Тогда Продолжить КонецЕсли;
					
					СтрокаТЧ = ДокОбъект.ШтрихкодыУпаковок.Добавить();
					СтрокаТЧ.ШтрихкодУпаковки	= Выборка.КМ_Штука;
					
					Если ДокОбъект.ШтрихкодыУпаковок.Количество() >= ЧислоКодовВПорции Тогда
						рПроведения = ПровестиДокумент(ДокОбъект);
						Если НЕ рПроведения.Успешно Тогда
							МаркировкаКС.ДобавитьОшибки(Результат, рПроведения);					
						КонецЕсли; 
						
						Если НЕ ЗначениеЗаполнено(ОсновнойДокумент) И ТипЗнч(ДокОбъект.ДокументОснование) <> Тип("ДокументСсылка.МаркировкаТоваровИСМП") Тогда
							ОсновнойДокумент = ДокОбъект.Ссылка;					
						КонецЕсли; 
						
						НомерДокумента	= НомерДокумента + 1;
						
						ДокОбъект		= ПолучитьСоздатьДокМаркировки(МАШ_Ссылка, СуществующиеДокументы, НомерДокумента, ВидОперацииИСМП);
						ДокОбъект.ТНВЭД	= Справочники.ТНВЭД.НайтиПоКоду(Выборка_ТНВЭД.ТНВЭД_Группа);
						ДокОбъект.Комментарий = "Порядковый № АТК: " + Выборка_ПорядковыйНомерАТК.ПорядковыйНомерАТК;
						
						ДокОбъект.ДокументОснование = ОсновнойДокумент; 				
					КонецЕсли; 
				КонецЦикла;			
				
				Если ДокОбъект<>Неопределено И ДокОбъект.ШтрихкодыУпаковок.Количество()>0 Тогда
					рПроведения = ПровестиДокумент(ДокОбъект);
					Если НЕ рПроведения.Успешно Тогда
						МаркировкаКС.ДобавитьОшибки(Результат, рПроведения);					
					КонецЕсли;									
					
					НомерДокумента	= НомерДокумента + 1;				
				КонецЕсли;				
			КонецЦикла;		
		КонецЦикла;	
	Иначе
		Результат.Успешно = Ложь;
		МаркировкаКС.ДобавитьОшибки(Результат, рОчистки);
		
		Возврат Результат;
	КонецЕсли;
	
	Результат.ОбработаноОбъектов = НомерДокумента - 1;
	Результат.Успешно = (Результат.Ошибки.Количество() = 0 И Результат.ОбработаноОбъектов>0);
	
	Возврат Результат;	
КонецФункции //СоздатьАгрегацииКЗПС(ЗПС_Ссылка)

Функция ПровестиДокумент(ДокОбъект)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	ДокОбъект.ПометкаУдаления = Ложь;				  
				
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение                                              
		ДокОбъект.Записать();
		
		ТекстОшибки = СтрШаблон("Не удалось провести документ: %1. Причина: %2.", ДокОбъект.Ссылка, ОписаниеОшибки());
		
		Результат.Успешно = Ложь;
		Результат.Ошибки.Добавить(ТекстОшибки);						
	КонецПопытки;
	
	Возврат Результат;
КонецФункции // ()
 

Функция Создать_ВводВОборот_МАШ(МАШ_Ссылка) Экспорт
	Результат 			= МаркировкаКС.СтруктураРезультата(Ложь);			
	
	ВидОперации			= Перечисления.ВидыОперацийИСМП.ВводВОборот_Импорт;
	
	ЧислоКодовВПорции	= 10000;
	НомерДокумента		= 1;	
	
	рОчистки 			= ОчиститьПодчиненныеДокументыМаркировки(МАШ_Ссылка, ВидОперации);
	Если рОчистки.Успешно Тогда
		СуществующиеДокументы	= рОчистки.СуществующиеДокументы;
		рЗапроса				= Получить_КодыМаркировкиМАШ_ДляАТК(МАШ_Ссылка);
		
		Выборка_ТНВЭД = рЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ТНВЭД_Группа");
		Если Выборка_ТНВЭД.Количество() = 0 Тогда
			Результат.Ошибки.Добавить("Не найдены КМ к МАШ: "+МАШ_Ссылка+" !");
		КонецЕсли;
		
		ДокОбъект = Неопределено;
		
		Пока Выборка_ТНВЭД.Следующий() Цикл
			Выборка_СтавкаНДС = Выборка_ТНВЭД.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СтавкаНДС"); 
			Пока Выборка_СтавкаНДС.Следующий() Цикл
				
				Выборка_Модель = Выборка_СтавкаНДС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Модель");
				Пока Выборка_Модель.Следующий() Цикл
					Выборка = Выборка_Модель.Выбрать();
					Пока Выборка.Следующий() Цикл
						Если ДокОбъект = Неопределено Тогда 
							ДокОбъект			= ПолучитьСоздатьДокМаркировки(МАШ_Ссылка, СуществующиеДокументы, НомерДокумента, ВидОперации);
							ДокОбъект.ТНВЭД 	= Справочники.ТНВЭД.НайтиПоКоду(Выборка_ТНВЭД.ТНВЭД_Группа);
							ДокОбъект.СтавкаНДС	= Выборка_СтавкаНДС.СтавкаНДС;
						ИначеЕсли ДокОбъект.ШтрихКодыУпаковок.Количество() >= ЧислоКодовВПорции Тогда							
							ДокОбъект.ПометкаУдаления = Ложь;						
							ДокОбъект.Записать();												
							
							НомерДокумента	= НомерДокумента + 1;
							
							ДокОбъект		= ПолучитьСоздатьДокМаркировки(МАШ_Ссылка, СуществующиеДокументы, НомерДокумента, ВидОперации);							
							ДокОбъект.ТНВЭД = Справочники.ТНВЭД.НайтиПоКоду(Выборка_ТНВЭД.ТНВЭД_Группа);
						КонецЕсли;					
						
						СтрокаТЧ = ДокОбъект.ШтрихкодыУпаковок.Добавить();
						СтрокаТЧ.ШтрихкодУпаковки	= Выборка.КМ_Штука;			
					КонецЦикла; 
				КонецЦикла;				
			КонецЦикла;
		КонецЦикла;		
		
		Если ДокОбъект<>Неопределено И ДокОбъект.ШтрихкодыУпаковок.Количество()>0 Тогда
			ДокОбъект.ПометкаУдаления = Ложь;				  
			
			Попытка
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение                                              
				ДокОбъект.Записать();
				
				ТекстОшибки = СтрШаблон("Не удалось провести документ: %1. Причина: %2.", ДокОбъект.Ссылка, ОписаниеОшибки());
				
				Результат.Успешно = Ложь;
				Результат.Ошибки.Добавить(ТекстОшибки);						
			КонецПопытки;					
			
			НомерДокумента	= НомерДокумента + 1;				
		КонецЕсли;
	Иначе
		Результат.Успешно = Ложь;
		МаркировкаКС.ДобавитьОшибки(Результат, рОчистки);
		
		Возврат Результат;
	КонецЕсли;
	
	Результат.ОбработаноОбъектов = НомерДокумента - 1;
	Результат.Успешно = (Результат.Ошибки.Количество()=0 И Результат.ОбработаноОбъектов>0);
	
	Возврат Результат;
	
КонецФункции //Создать_ВводВОборот_МАШ(МАШ_Ссылка)

Функция Создать_ВводВОборот_МАШ_АТК(МАШ_Ссылка) Экспорт
	Результат 			= МаркировкаКС.СтруктураРезультата(Ложь);			
	
	ВидОперации			= Перечисления.ВидыОперацийИСМП.ВводВОборот_Импорт;
	
	ЧислоКодовВПорции	= 10000;
	НомерДокумента		= 1;	
	
	рОчистки 			= ОчиститьПодчиненныеДокументыМаркировки(МАШ_Ссылка, ВидОперации);
	Если рОчистки.Успешно Тогда
		СуществующиеДокументы	= рОчистки.СуществующиеДокументы;
		КодыАТК					= ПолучитьКодыАТКпоМашине(МАШ_Ссылка);		
		
		Если КодыАТК.Количество() = 0 Тогда
			Результат.Ошибки.Добавить("Не найдены АТК к МАШ: "+МАШ_Ссылка+" !");
		КонецЕсли;
		
		ДокОбъект = Неопределено;
		
		ДокОбъект = ПолучитьСоздатьДокМаркировки(МАШ_Ссылка, СуществующиеДокументы, НомерДокумента, ВидОперации);
		
		Если 1 = 2 Тогда
			ДокОбъект = Документы.МаркировкаТоваровИСМП.СоздатьДокумент();		
		КонецЕсли;
		
		ДокОбъект.ШтрихкодыУпаковок.Очистить();
		Для Каждого КодАТК Из КодыАТК Цикл		
			СтрокаТЧ = ДокОбъект.ШтрихкодыУпаковок.Добавить();
			СтрокаТЧ.ШтрихкодУпаковки	= КодАТК;						
		КонецЦикла;
		
		ДокОбъект.ПометкаУдаления = Ложь;						
		
		ДокОбъект.Записать();		
			
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение                                              
			ДокОбъект.Записать();
			
			ТекстОшибки = СтрШаблон("Не удалось провести документ: %1. Причина: %2.", ДокОбъект.Ссылка, ОписаниеОшибки());
			
			Результат.Успешно = Ложь;
			Результат.Ошибки.Добавить(ТекстОшибки);						
		КонецПопытки;		
	Иначе
		Результат.Успешно = Ложь;
		МаркировкаКС.ДобавитьОшибки(Результат, рОчистки);
		
		Возврат Результат;
	КонецЕсли;
	
	Результат.ОбработаноОбъектов = НомерДокумента - 1;
	Результат.Успешно = (Результат.Ошибки.Количество()=0 И Результат.ОбработаноОбъектов>0);
	
	Возврат Результат;
	
КонецФункции //Создать_ВводВОборот_МАШ_АТК(МАШ_Ссылка)

Функция ОчиститьПодчиненныеДокументыМаркировки(ЗПС_Ссылка, ВидОперацииИСМП) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	ПодчДокументы = ПолучитьПодчиненныеДокументыМаркировки(ЗПС_Ссылка, ВидОперацииИСМП);
	
	Для Каждого СтрокаПД Из ПодчДокументы Цикл
		Если НЕ (
			СтрокаПД.Статус = Перечисления.СтатусыДокументовМаркировки.ВРаботе 
			ИЛИ СтрокаПД.Статус = Перечисления.СтатусыДокументовМаркировки.КОбработке ) Тогда
			
			ТекстОшибки = СтрШаблон("Недопустимый статус заказа на КМ: '%1', тек. статус: '%2', допустимые статусы: 'В работе' или 'К обработке'.", СтрокаПД.Ссылка, СтрокаПД.Статус);
			Результат.Ошибки.Добавить(ТекстОшибки);
		КонецЕсли; 	
	КонецЦикла;
	
	СуществующиеДокументы = Новый Соответствие;
	
	Сч = 1;
	Если Результат.Ошибки.Количество() = 0 Тогда
		
		
		НачатьТранзакцию();
		
		Для Каждого СтрокаПД Из ПодчДокументы Цикл
			ДокОбъект = СтрокаПД.Ссылка.ПолучитьОбъект();
			
			ДокОбъект.Статус 			= Перечисления.СтатусыДокументовМаркировки.ВРаботе;
			ДокОбъект.ИД_ДокументаЧЗ    = "";
			
			ДокОбъект.Товары.Очистить();
			ДокОбъект.ШтрихкодыУпаковок.Очистить();
			ДокОбъект.ШтрихкодыКоробок.Очистить();
			
			ДокОбъект.Проведен 			= Ложь;
			ДокОбъект.ПометкаУдаления 	= Истина;
		
			ДокОбъект.Записать();
			
			НЗ = РегистрыСведений.СтатусыКМ_Факт.СоздатьНаборЗаписей();
			НЗ.Отбор.Регистратор.Установить(ДокОбъект.Ссылка, Истина);
			НЗ.Записать();
			
			НЗ = РегистрыСведений.СтатусыКМ_Факт_А.СоздатьНаборЗаписей();
			НЗ.Отбор.Регистратор.Установить(ДокОбъект.Ссылка, Истина);
			НЗ.Записать();
			
			НЗ = РегистрыСведений.ИспользованныеКодыАгрегаций.СоздатьНаборЗаписей();
			НЗ.Отбор.Регистратор.Установить(ДокОбъект.Ссылка, Истина);
			НЗ.Записать();			
			
			СуществующиеДокументы[Сч] = ДокОбъект.Ссылка;
			Сч	= Сч+1;
		КонецЦикла;		
		
		ЗафиксироватьТранзакцию();	
	Иначе
		Результат.Успешно = Ложь;
	КонецЕсли; 
	
	Результат.Вставить("СуществующиеДокументы", СуществующиеДокументы);

	Возврат Результат;
КонецФункции //ОчиститьПодчиненныеДокументыМаркировки(ЗПС_Ссылка)

Функция ПолучитьПодчиненныеДокументыМаркировки(ДокументОснование, ВидОперацииИСМП)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка
	|ПОМЕСТИТЬ ВТ_Основные
	|ИЗ	
	|	Документ.МаркировкаТоваровИСМП
	|ГДЕ
	|	ДокументОснование	= &ДокументОснование
	|	И ВидОперацииИСМП	= &ВидОперацииИСМП
	|;
	|ВЫБРАТЬ
	|	Ссылка,
	|	Ссылка.Статус 	КАК Статус,
	|	1	 			КАК Порядок,
	|	Ссылка			КАК Основной
	|ИЗ
	|	ВТ_Основные
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ
	|	Дополнительные.Ссылка,
	|	Дополнительные.Ссылка.Статус 	КАК Статус,
	|	2					 			КАК Порядок,
	|	ВТ_Основные.Ссылка				КАК Основной
	|ИЗ	
	|	Документ.МаркировкаТоваровИСМП КАК Дополнительные
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ВТ_Основные
	|ПО
	|	Дополнительные.ДокументОснование = ВТ_Основные.Ссылка		
	|	И Дополнительные.ВидОперацииИСМП = &ВидОперацииИСМП	
	|УПОРЯДОЧИТЬ ПО
	|	Порядок
	|";
	
	Запрос.УстановитьПараметр("ДокументОснование",	ДокументОснование);
	Запрос.УстановитьПараметр("ВидОперацииИСМП",	ВидОперацииИСМП);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции //ПолучитьПодчиненныеДокументыМаркировки(ДокументОснование, ВидОперацииИСМП)
 
Функция Получить_КодыМаркировкиЗПС_ДляАТК(ЗПС_Ссылка)
	Запрос	= Новый ("Запрос");
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДокументОснование КАК ЗПС,
	|	Ссылка КАК Эмиссия
	|ПОМЕСТИТЬ ВТ_Эмиссии	
	|ИЗ
	|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ
	|ГДЕ
	|	ДокументОснование = &ЗПС_Ссылка
	|;			
	|ВЫБРАТЬ	
	|	ПОДСТРОКА(ШК_ЧЗ.Владелец.Родитель.ТНВЭД.Код,1,4)	КАК ТНВЭД_Группа,
	|	ШК_ЧЗ.Владелец.Родитель 							КАК Модель,
	|	ШК_ЧЗ.Владелец.Родитель.Код							КАК Модель_Код,
	
	|	ШК_ЧЗ.Владелец 								КАК Номенклатура,
	|	ШК_ЧЗ.Владелец.Родитель.СтавкаНДС			КАК СтавкаНДС,
	|	ШК_ЧЗ.Ссылка 								КАК КМ_Штука,	
	|	ШК_ЧЗ.Ссылка.Наименование 					КАК КМ_Штука_Наименование	
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШК_ЧЗ	
	|ПРАВОЕ СОЕДИНЕНИЕ
	|	ВТ_Эмиссии
	|ПО
	|	ШК_ЧЗ.ЗаказКМ = ВТ_Эмиссии.Эмиссия	
	|ГДЕ
	|	ШК_ЧЗ.ТипКода 	= ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Товар)
	|УПОРЯДОЧИТЬ ПО
	|	ШК_ЧЗ.Владелец,
	|	ШК_ЧЗ.Наименование
	|ИТОГИ 
	|	КОЛИЧЕСТВО(Различные КМ_Штука)	
	|ПО
	|	ТНВЭД_Группа,
	|	СтавкаНДС,
	|	Модель	
	|";
	
	Запрос.УстановитьПараметр("ЗПС_Ссылка", ЗПС_Ссылка);
	
	Возврат Запрос.Выполнить();
КонецФункции //()

Функция Получить_КодыМаркировкиМАШ_ДляАТК(МАШ_Ссылка, ДопПараметры = Неопределено)
	ДлиннаКодаТНВЭД = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ДлиннаКодаТНВЭД", 4);
	НомераАТК		= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "НомераАТК");
	
	Если НомераАТК = Неопределено Тогда
		НомераАТК = Новый ТаблицаЗначений;
		НомераАТК.Колонки.Добавить("Номенклатура", 			Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		НомераАТК.Колонки.Добавить("ПорядковыйНомерАТК",	ПолучитьОписаниеТиповЧисла(2));
	КонецЕсли;
	
	Запрос	= Новый ("Запрос");
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_НомераАТК ИЗ &НомераАТК КАК НомераАТК ИНДЕКСИРОВАТЬ ПО Номенклатура 
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	ТоварыЗПС.Номенклатура
	|ПОМЕСТИТЬ ВТ_НоменклатураЗПС	 
	|ИЗ 
	|	Документ.ЗаказПоставщику.Товары КАК ТоварыЗПС
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ	
	|	Документ.Машина.Заказы КАК ЗаказыМашины
	|ПО
	|	ЗаказыМашины.Заказ = ТоварыЗПС.Ссылка
	//++Данилова Е.В. 21.07.2025 MARK-2484 
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправ
	|		ПО ТоварыЗПС.Номенклатура = НоменклатураСправ.Ссылка
	|			И (НоменклатураСправ.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект)
	|				ИЛИ НоменклатураСправ.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
	|		ПО (НоменклатураКоплектующие.Номенклатура = ТоварыЗПС.Номенклатура)
	|			И (НоменклатураКоплектующие.Ссылка.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)
	|				ИЛИ НоменклатураКоплектующие.Ссылка.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект))
	//--Данилова Е.В. 21.07.2025
	|ГДЕ 
	|	ЗаказыМашины.Ссылка = &МАШ_Ссылка 
	//++Данилова Е.В. 21.07.2025 MARK-2484
	|	И ВЫБОР
	|			КОГДА НоменклатураСправ.РазныеТНВЭДВКомплекте
	|				ТОГДА НоменклатураСправ.Ссылка ЕСТЬ NULL
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НоменклатураКоплектующие.Ссылка ЕСТЬ NULL

	//--Данилова Е.В. 21.07.2025
	|;
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки				КАК Ссылка,
	|	ШтрихКодУпаковки.Владелец		КАК Владелец,
	|	ШтрихКодУпаковки.Наименование	КАК Наименование
	|ПОМЕСТИТЬ ВТ_ШК
	|ИЗ
	|	Документ.ХранилищеКодовМаркировки.ШтрихКодыУпаковок	
	|ГДЕ
	|	Ссылка.ДокОснование В (ВЫБРАТЬ РАЗЛИЧНЫЕ Заказ ИЗ Документ.Машина.Заказы ГДЕ Ссылка = &МАШ_Ссылка)
	|	И Ссылка.ПланФакт = ЗНАЧЕНИЕ(Перечисление.ПланФакт.Факт)
	|	И Ссылка.Проведен
	//++Данилова Е.В. 21.07.2025 MARK-2484
	//|	И ШтрихКодУпаковки.ТипКода 	= ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Товар)  
	|	И (ШтрихКодУпаковки.ТипКода 	= ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Товар)
	|		ИЛИ ШтрихКодУпаковки.ТипКода 	= ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор))
	//--Данилова Е.В. 21.07.2025
	|	И ШтрихКодУпаковки.Владелец В (ВЫБРАТЬ РАЗЛИЧНЫЕ Номенклатура ИЗ ВТ_НоменклатураЗПС) 
	//++Данилова Е.В. 25.06.2025 MARK-2484 
	//|	И НЕ ШтрихКодУпаковки.Владелец.Родитель.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект)
	//--Данилова Е.В. 25.06.2025
	|;
	|ВЫБРАТЬ	
	|	IsNULL(ВТ_НомераАТК.ПорядковыйНомерАТК,0)			КАК ПорядковыйНомерАТК,
	|	ПОДСТРОКА(ВТ_ШК.Владелец.Родитель.ТНВЭД.Код,
	|		1," + ДлиннаКодаТНВЭД + ")						КАК ТНВЭД_Группа,
	|	ВТ_ШК.Владелец.Родитель.ТНВЭД						КАК КодТНВЭД,
	|	ВТ_ШК.Владелец.Родитель 							КАК Модель,
	|	ВТ_ШК.Владелец.Родитель.Код							КАК Модель_Код,
	|
	|	ВТ_ШК.Владелец 										КАК Номенклатура,
	|	ВТ_ШК.Владелец.Родитель.СтавкаНДС					КАК СтавкаНДС,
	|	ВТ_ШК.Ссылка 										КАК КМ_Штука,	
	|	ВТ_ШК.Ссылка.Наименование 							КАК КМ_Штука_Наименование,
	|	
	|	СтатусыКМ_ЧЗ.Статус									КАК Статус			
	|ИЗ
	|	ВТ_ШК
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.СтатусыКМ_ЧЗ.СрезПоследних(&ДатаДок, ШтрихКодУпаковки В (ВЫБРАТЬ РАЗЛИЧНЫЕ Ссылка ИЗ ВТ_ШК)) КАК СтатусыКМ_ЧЗ	    
	|ПО
	|	ВТ_ШК.Ссылка = СтатусыКМ_ЧЗ.ШтрихКодУпаковки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ВТ_НомераАТК
	|ПО
	|	ВТ_НомераАТК.Номенклатура = ВТ_ШК.Владелец	
	|ГДЕ
	//Валетов+ 07,10,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3041 
	//|	СтатусыКМ_ЧЗ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиИСМП.Эмитирован)
	|	(СтатусыКМ_ЧЗ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиИСМП.Эмитирован) ИЛИ СтатусыКМ_ЧЗ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен)) 
	//Валетов -
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ШК.Владелец,
	|	ВТ_ШК.Наименование
	|ИТОГИ 
	|	КОЛИЧЕСТВО(Различные КМ_Штука)	
	|ПО
	|	ПорядковыйНомерАТК,
	|	ТНВЭД_Группа,	
	|	СтавкаНДС,
	|	Модель	
	|";
	
	Запрос.УстановитьПараметр("МАШ_Ссылка", МАШ_Ссылка);
	Запрос.УстановитьПараметр("ДатаДок", 	ПолучитьРеквизитШапки(МАШ_Ссылка, "Дата", "Документ"));
	Запрос.УстановитьПараметр("НомераАТК",  НомераАТК);	
	
	Возврат Запрос.Выполнить();
КонецФункции //Получить_КодыМаркировкиМАШ_ДляАТК(МАШ_Ссылка)

Функция ПолучитьКодыАТКпоМашине(МАШ_Ссылка)
	Запрос=Новый ("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ	
	|	Спр_ШК.Ссылка КАК ШтрихКод	
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП КАК ДокМаркировка
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК Спр_ШК	
	|ПО
	|	Спр_ШК.Наименование = ДокМаркировка.АТК 			
	|	И Спр_ШК.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.АТК)
	|ГДЕ
	|	ДокМаркировка.ДокументОснование 	= &МАШ_Ссылка
	|	И ДокМаркировка.ВидОперации 		= ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.АТК)
	|	И ДокМаркировка.Ссылка.Проведен	
	|";
	
	Запрос.УстановитьПараметр("МАШ_Ссылка", МАШ_Ссылка);	
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШтрихКод");
КонецФункции //ПолучитьКодыАТКпоМашине(МАШ_Ссылка)

Функция ПолучитьСоздатьДокМаркировки(ДокОснование, СуществующиеДокументы, Сч, ВидОперацииИСМП, Основной = Истина) Экспорт
	ДокСсылка = СуществующиеДокументы[Сч];					
	Если ДокСсылка = Неопределено Тогда
		ДокОбъект = Документы.МаркировкаТоваровИСМП.СоздатьДокумент();
			
		ДокОбъект.Дата	= ТекущаяДата();
		
		ДокОбъект.Организация	= ПолучитьРеквизитШапки(ДокОснование, "Организация");
		ДокОбъект.ДополнительныеСвойства.Вставить("ЗаполнятьТолькоШапку", Истина);
		ДокОбъект.Заполнить(ДокОснование);
	Иначе
		ДокОбъект = ДокСсылка.ПолучитьОбъект();
		ДокОбъект.Организация		= ПолучитьРеквизитШапки(ДокОснование, "Организация");
		ДокОбъект.ДокументОснование	= ДокОснование; //Хвосты иногда не видны если прицеплены не к тому основанию
	КонецЕсли;
	
	ДокОбъект.ВидОперации		= Перечисления.ВидыОперацийИСМП.ВидОперацииМаркировки(ВидОперацииИСМП);
	ДокОбъект.ВидОперацииИСМП 	= ВидОперацииИСМП;
	
	ДокОбъект.Товары.Очистить();
	ДокОбъект.ШтрихкодыУпаковок.Очистить();
	
	Возврат ДокОбъект;
КонецФункции //ПолучитьСоздатьАгрегацию(ДокОснование, СуществующиеДокументы, Сч)

Функция ПолучитьСоздатьДокАгрегации(ДокументОснование, Знач ТипШК = Неопределено, ТипУпаковки = Неопределено, ДопПараметры = Неопределено) Экспорт	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат Неопределено;
	КонецЕсли; 
	Если ТипШК = Перечисления.ТипыШтрихКодов.Штука Тогда
		Возврат Неопределено;	
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ТипШК) Тогда
		ТипШК = Перечисления.ТипыШтрихКодов.Коробка;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТипУпаковки) Тогда
		ТипУпаковки = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
	КонецЕсли;	
	
	ВидОперации = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ВидОперации", Перечисления.ВидыОперацийМаркировки.Агрегация);
	

	// Кухарь А.Ю.  18.03.2025 начало
	//СтруктураПоиска = Новый Структура("ДокументОснование,ВидОперации,ТипШК,ТипУпаковки", ДокументОснование, ВидОперации, ТипШК, ТипУпаковки);
	СтруктураПоиска = Новый Структура("ДокументОснование,ВидОперации,ТипШК", ДокументОснование, ВидОперации, ТипШК);
	// Кухарь А.Ю.  18.03.2025 конец
	
	ДокСсылка = НайтиДокумент("МаркировкаТоваровИСМП", СтруктураПоиска);	
	Если НЕ ЗначениеЗаполнено(ДокСсылка) Тогда
		ДокОбъект = Документы.МаркировкаТоваровИСМП.СоздатьДокумент();
		ДокОбъект.ДополнительныеСвойства.Вставить("ЗаполнятьТолькоШапку", Истина);
		
		ДокОбъект.Заполнить(ДокументОснование);		
		Если НЕ ЗначениеЗаполнено(ДокОбъект.ПодразделениеНанесения) Тогда
			ДокОбъект.ПодразделениеНанесения = ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла();			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ДокОбъект, СтруктураПоиска);
		
		ДокОбъект.Дата		= ТекущаяДата();	
		ДокОбъект.Статус	= Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки;		
		Если ДокОбъект.ВидОперации = Перечисления.ВидыОперацийМаркировки.Агрегация Тогда
			ДокОбъект.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.Агрегация;		
		КонецЕсли;		
		
		// Кельманов А.В. - HELP-7961 + HELP-9743 + HELP-9832 - 2026.05.21 {
		//ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		ДокОбъект.Проведен = Истина;
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		// Кельманов А.В. - HELP-7961 + HELP-9743 + HELP-9832 - 2026.05.21 }
		
		ДокСсылка = ДокОбъект.Ссылка;
	КонецЕсли;
	
	Возврат ДокСсылка;
КонецФункции //ПолучитьСоздатьДокАгрегации(ДокументОснование, Знач ТипШК = Неопределено, ТипУпаковки = Неопределено, ДопПараметры = Неопределено) Экспорт

Функция СоздатьЗапрос_АгрегационныеКодыПоОперации(ОперМаркировки_Ссылка) Экспорт
	Запрос	= Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТЧ_ШК.КодАгрегации							КАК КодАгрегации,		
	|	ТЧ_ШК.Ссылка								КАК ДокАгрегации,		
	|	ТЧ_ШК.ШтрихкодУпаковки.Владелец 			КАК Номенклатура,
	|	ТЧ_ШК.ШтрихкодУпаковки.Владелец 			КАК КоличествоНоменклатуры,
	|	ТЧ_ШК.ШтрихкодУпаковки						КАК КМ_Штука,
	|	ТЧ_ШК.ШтрихкодУпаковки.Наименование 		КАК КМ_Штука_Наименование,
	|	ТЧ_ШК.ШтрихкодУпаковки.СпособВводаВОборот	КАК СпособВводаВОборот,
	|	
	|	СпрШК_КодыАгрегации.Ссылка					КАК КМ_Коробка,	
	|	СпрШК_КодыАгрегации.Ссылка.Наименование		КАК КМ_Коробка_Наименование
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК ТЧ_ШК		
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК СпрШК_КодыАгрегации	
	|ПО
	|	ТЧ_ШК.КодАгрегации				= СпрШК_КодыАгрегации.Наименование
	|	И СпрШК_КодыАгрегации.ТипКода 	= ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.ЛогистическаяУпаковка)
	|ГДЕ
	|	ТЧ_ШК.Ссылка = &ОперМаркировки_Ссылка 
	|	И ТЧ_ШК.КодАгрегации<>""""	
	|	И ТЧ_ШК.ШтрихкодУпаковки.ТипКода 	= ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Товар)
	|	И СпрШК_КодыАгрегации.Ссылка ЕСТЬ NULL
	|УПОРЯДОЧИТЬ ПО		
	|	КодАгрегации,
	|	ТЧ_ШК.ШтрихкодУпаковки.Владелец,
	|	ТЧ_ШК.ШтрихкодУпаковки.Наименование
	|ИТОГИ 	
	|	КОЛИЧЕСТВО(Различные КоличествоНоменклатуры),
	|	КОЛИЧЕСТВО(Различные КМ_Штука),
	|	МАКСИМУМ(Номенклатура),
	|	МАКСИМУМ(СпособВводаВОборот),
	|	МАКСИМУМ(КМ_Коробка),
	|	МАКСИМУМ(КМ_Коробка_Наименование),
	|	МАКСИМУМ(ДокАгрегации)
	|ПО	
	|	КодАгрегации	
	|";                       
	
	Запрос.УстановитьПараметр("ОперМаркировки_Ссылка", ОперМаркировки_Ссылка);
	
	Возврат Запрос;
КонецФункции //СоздатьЗапрос_АгрегационныеКодыПоОперации() Экспорт

Функция ПолучитьОперацииПоОснованию(ДокументОснование, ВидОперации = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП
	|ГДЕ
	|	ДокументОснование = &ДокументОснование
	|	" + ?(ЗначениеЗаполнено(ВидОперации), "И ВидОперации = &ВидОперации", "") + "
	|";
	
	Запрос.УстановитьПараметр("ДокументОснование", 	ДокументОснование);
	Запрос.УстановитьПараметр("ВидОперации", 		ВидОперации);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");	
КонецФункции //ПолучитьОперацииПоОснованию(ДокументОснование, ВидОперации = Неопределено) Экспорт

Процедура ЗарегистрироватьИспользованныеКоробки(Ссылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШтрихкодКоробки
	|ИЗ
	|(
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ШтрихкодКоробки
	|	ИЗ
	|		Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок
	|	ГДЕ
	|		Ссылка = &Ссылка
	|		И Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация)	
	|	ОБЪЕДИНИТЬ 
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ШтрихкодКоробки
	|	ИЗ
	|		Документ.МаркировкаТоваровИСМП.ШтрихкодыКоробок
	|	ГДЕ
	|		Ссылка = &Ссылка
	|		И Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация)	
	|) КАК Сводный
	|ГДЕ
	|	ШтрихкодКоробки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	НЗ = РегистрыСведений.ИспользованныеКодыАгрегаций.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(Ссылка, Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = НЗ.Добавить();
		Запись.ШтрихКодУпаковки = Выборка.ШтрихкодКоробки;		
	КонецЦикла;
	
	Попытка
		НЗ.Записать();
	Исключение
		ВызватьИсключение "Не удалось забронировать агрегационный код ! " + ОписаниеОшибки(); 
	КонецПопытки;
	
КонецПроцедуры

Процедура ОчиститьИспользованныеКоробки(Ссылка) Экспорт	
	
	НЗ = РегистрыСведений.ИспользованныеКодыАгрегаций.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(Ссылка, Истина);
	
	Попытка
		НЗ.Записать();
	Исключение
		ВызватьИсключение "Не удалось очистить используемые коды ! " + ОписаниеОшибки(); 
	КонецПопытки;

КонецПроцедуры

Функция ПолучитьДанныеРазАгрегации(РНК_Ссылка, ДопПараметры = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШтрихкодКоробки,
	|	ШтрихкодУпаковки,
	|	Ссылка
	|ПОМЕСТИТЬ ВТ_Отгрузка
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок
	|ГДЕ
	|	ВЫРАЗИТЬ(Ссылка.ДокументОснование КАК Документ.РасходнаяНакладная) = &РНК_Ссылка
	|	И Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация)
	|	И НЕ ШтрихкодКоробки.ВерсияДанных ЕСТЬ NULL
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ	
	|	Агр.ШтрихкодКоробки						КАК ШтрихкодКоробки,
	|	Агр.ШтрихкодКоробки.СпособВводаВОборот	КАК СпособВводаВОборот
	|ПОМЕСТИТЬ ВТ_КоробкиНаРазбор	
	|ИЗ
	|	ВТ_Отгрузка
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК Агр
	|ПО
	|	Агр.ШтрихкодУпаковки = ВТ_Отгрузка.ШтрихкодУпаковки
	|	И Агр.Ссылка <> ВТ_Отгрузка.Ссылка
	|	И Агр.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация)
	|	И (
	|		Агр.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.ОбработанЧЗ)
	|		ИЛИ Агр.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан)
	|	)
	|ГДЕ
	|	НЕ Агр.ШтрихкодКоробки ЕСТЬ NULL		
	|	И НЕ Агр.ШтрихкодКоробки = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)		
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ
	|	КодыКоробок.Ссылка КАК ШтрихкодКоробки,
	|	КодыКоробок.Ссылка.СпособВводаВОборот
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК КодыКоробок
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ	
	|	ВТ_Отгрузка
	|ПО
	|	КодыКоробок.Штрихкод = ВТ_Отгрузка.ШтрихкодУпаковки
	|	И КодыКоробок.Ссылка.СпособВводаВОборот = ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.Импорт)
	|ГДЕ
	|	НЕ КодыКоробок.Ссылка.Наименование ПОДОБНО ""%\_%"" СПЕЦСИМВОЛ ""\""
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_КоробкиНаРазбор.ШтрихкодКоробки	
	|ИЗ
	|	ВТ_КоробкиНаРазбор		
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СтатусыКМ_Факт КАК Статусы	
	|ПО		
	|	ВТ_КоробкиНаРазбор.ШтрихкодКоробки = Статусы.ШтрихКодУпаковки	
	|	И (
	|		Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.Списан)
	|		ИЛИ Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.Выбыл)
	|		ИЛИ Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.Расформирован)
	|	)
	|ГДЕ
	|	Статусы.Статус ЕСТЬ NULL
	|";	
	
	Запрос.УстановитьПараметр("РНК_Ссылка", РНК_Ссылка);	
	
	рЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка_КоробкиРНК = рЗапроса[рЗапроса.ВГраница()-1].Выбрать();
	Если Выборка_КоробкиРНК.Количество() = 0 Тогда
		Результат.Ошибки.Добавить("Не найдено кодов агрегаций к накладной !");		
		Результат.Успешно = Ложь;
	Иначе
		Результат.Данные = рЗапроса[рЗапроса.ВГраница()].Выгрузить().ВыгрузитьКолонку("ШтрихкодКоробки");		
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции //ПолучитьДанныеРазАгрегации(РНК_Ссылка, ДопПараметры = Неопределено) Экспорт
 

//++Данилова Е.В. 03.02.2025
Функция ДокументВводаВОборотПередОтправкойВЧЗФормированиеНабора(Знач ДокументОснование, Знач ВидОперации)

	Если ВидОперации <> Перечисления.ВидыОперацийМаркировки.ФормированиеНабора 
		ИЛИ ТипЗнч(ДокументОснование) <> Тип("ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ") 
		//++Данилова Е.В. 26.03.2025
		//ИЛИ ДокументОснование.ВидНоменклатурыЧЗВДокументе <> Перечисления.ВидыНоменклатурыЧЗ.Набор Тогда
		ИЛИ (ДокументОснование.ВидКомплекта <> Перечисления.ВидыКомплектов.ГотовыйКомплект 
		//--Данилова Е.В. 26.03.2025 
		//++Данилова Е.В. 03.06.2025  MARK-2355 
		И НЕ документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.КомплектСпайка_Импорт(ДокументОснование)) Тогда 
		//--Данилова Е.В. 03.06.2025
		
		Возврат неопределено; 
		
	КонецЕсли;
	
	РезультатОперацииМаркировки = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ОперацияМаркировкиПоГотовымНаборам(ДокументОснование,истина); 
	
	Если ЗначениеЗаполнено(РезультатОперацииМаркировки.ДокВводВОборот) Тогда 
				
		Если  НЕ РезультатОперацииМаркировки.ДокВводВОборот.Проведен 
			ИЛИ НЕ РезультатОперацииМаркировки.ДокВводВОборот.Статус  = Перечисления.СтатусыДокументовМаркировки.Обработан Тогда  
			
			Возврат РезультатОперацииМаркировки.ДокВводВОборот; 
			
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат Неопределено; 
	
КонецФункции // ПроверитьВозможностьОтправкиВЧЗПоФормированиюНабора()

#Область АгрегацияПоЛистамНабораИПалетам

Функция ПолучитьЗабронироватьКодАгрегацииДляЛН(ЛистНабора, ТипШК, Знач ТипУпаковки = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);	
	
	рПроверки = МожноАгрегироватьЛистНабораИлиПереукладки(ЛистНабора);
	Если рПроверки.Успешно Тогда
		Накладная = рПроверки.Данные;
	Иначе		
		МаркировкаКС.ДобавитьОшибки(Результат, рПроверки);
	КонецЕсли;
	
	Если НЕ (ТипШК = Перечисления.ТипыШтрихКодов.Блочок	ИЛИ ТипШК = Перечисления.ТипыШтрихКодов.Коробка) Тогда
		ТекстОшибки = СтрШаблон("Недопустимое значение типа ШК: '%1' !", ТипШК);
		Результат.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
	Если Результат.Ошибки.Количество() > 0 Тогда
		Возврат Результат;	
	КонецЕсли;	
	
	Если ТипУпаковки = Неопределено Тогда
		ТипУпаковки = ОпределитьТипУпаковкиПоСоставуЛН(ЛистНабора);
	КонецЕсли;
	
	ОперАгрегации = Документы.МаркировкаТоваровИСМП.ПолучитьСоздатьДокАгрегации(Накладная, ТипШК);
	
	рБронирования = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныйКодАгрегации(ТипШК, ТипУпаковки, ОперАгрегации, Новый Структура("Добавлять", Истина));
	
	Если рБронирования.Успешно Тогда
		ШтрихКодАграгации = рБронирования.Данные;
		рДобавления = ДобавитьШККоробкиВАгрегацию(ОперАгрегации, ЛистНабора, ШтрихКодАграгации);
		Если рДобавления.Успешно Тогда
			Результат.Успешно 	= Истина;						
			Результат.Данные 	= ШтрихКодАграгации;
		Иначе						
			МаркировкаКС.ДобавитьОшибки(Результат, рДобавления);
		КонецЕсли;		
	Иначе
		МаркировкаКС.ДобавитьОшибки(Результат, рБронирования);
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции //ПолучитьЗабронироватьСвободныйКодАгрегацииДляЛН(ЛистНабора, ТипШК, Знач ТипУпаковки = Неопределено) Экспорт

Функция ПолучитьЗабронироватьКодАгрегацииДляПалеты(Палета, Накладная, Знач ТипУпаковки = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);	
		
	Если ЗначениеЗаполнено(Палета) Тогда
		Если НЕ ТипЗнч(Палета) = Тип("ДокументСсылка.Паллета") Тогда
			Результат.Ошибки.Добавить("Недопустимое основание для агрегации: " + ТипЗнч(Палета));
		КонецЕсли; 
	Иначе
		Результат.Ошибки.Добавить("Не указана палета !");	
	КонецЕсли;	
	
	Если Результат.Ошибки.Количество() > 0 Тогда
		Возврат Результат;	
	КонецЕсли;
	
	рПроверки = МожноАгрегироватьНакладную(Накладная); 
	
	Если НЕ рПроверки.Успешно Тогда
		Возврат рПроверки;		
	КонецЕсли;	
	
	ТипШК = Перечисления.ТипыШтрихКодов.Палета;
	Если ТипУпаковки = Неопределено Тогда
		ТипУпаковки = ОпределитьТипУпаковкиПоСоставуНакладной(Накладная);			
	КонецЕсли;
	
	ОперАгрегации = Документы.МаркировкаТоваровИСМП.ПолучитьСоздатьДокАгрегации(Накладная, ТипШК);
	
	рБронирования = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныйКодАгрегации(ТипШК, ТипУпаковки, ОперАгрегации, Новый Структура("Добавлять", Истина));
	
	Если рБронирования.Успешно Тогда
		ШтрихКодАграгации = рБронирования.Данные;
		рДобавления = ДобавитьШККоробкиВАгрегацию(ОперАгрегации, Накладная, ШтрихКодАграгации);
		Если рДобавления.Успешно Тогда
			Результат.Успешно 	= Истина;						
			Результат.Данные 	= ШтрихКодАграгации;
		Иначе						
			МаркировкаКС.ДобавитьОшибки(Результат, рДобавления);
		КонецЕсли;		
	Иначе
		МаркировкаКС.ДобавитьОшибки(Результат, рБронирования);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПолучитьЗабронироватьСвободныйКодАгрегацииДляЛН(ЛистНабора, ТипШК, Знач ТипУпаковки = Неопределено) Экспорт

Функция ВыдавалсяКодКоробки(ДокМаркировки, ЛистНабора)
	Результат = Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ШтрихкодКоробки	
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыКоробок КАК МаркировкаТоваровИСМПШтрихкодыКоробок
	|ГДЕ
	|	Ссылка = &ДокМаркировки
	|	И ДокументОснование = &ЛистНабора
	|";
	
	Запрос.УстановитьПараметр("ДокМаркировки",	ДокМаркировки);
	Запрос.УстановитьПараметр("ЛистНабора", 	ЛистНабора);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ШтрихкодКоробки) Тогда
		Результат = Выборка.ШтрихкодКоробки;	
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции //ВыдавалсяКодКобки(ДокМаркировки, ЛистНабора)

Функция ВыдавалсяКодАгрегации(ДокМаркировки, ЛистНабора, ШтрихКодКоробки)
	Результат = Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ШтрихкодКоробки	
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыКоробок КАК МаркировкаТоваровИСМПШтрихкодыКоробок
	|ГДЕ
	|	Ссылка				= &ДокМаркировки
	|	И ДокументОснование = &ЛистНабора
	|	И ШтрихКодКоробки	= &ШтрихКодКоробки
	|";
	
	Запрос.УстановитьПараметр("ДокМаркировки",		ДокМаркировки);
	Запрос.УстановитьПараметр("ЛистНабора", 		ЛистНабора);
	Запрос.УстановитьПараметр("ШтрихКодКоробки",	ШтрихКодКоробки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ШтрихкодКоробки) Тогда
		Результат = Выборка.ШтрихкодКоробки;	
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции //ВыдавалсяКодКобки(ДокМаркировки, ЛистНабора)

Функция МожноАгрегироватьЛистНабораИлиПереукладки(ДокСсылка)
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Если ЗначениеЗаполнено(ДокСсылка) Тогда
		ТипДокумента = ТипЗнч(ДокСсылка);
		Если ТипДокумента = Тип("ДокументСсылка.ЛистНабора")
			ИЛИ ТипДокумента = Тип("ДокументСсылка.ЛистПереукладки") Тогда
			
			Накладная	= ПолучитьРеквизитШапки(ДокСсылка, "ДокОснование");
			рНакладной	= ПолучитьРеквизитыШапки(Накладная, "Организация,Склад.Подразделение,СостояниеНакладной");
	
			Если СостояниеНакладнойДопускаетАгрегацию(рНакладной.СостояниеНакладной)
				//++Данилова Е.В. 10.02.2026 SNL-138
				ИЛИ ВидОснованияДокускаетАгрегацию(Накладная) Тогда
				//--Данилова Е.В. 10.02.2026
				Результат.Данные	= Накладная;
				Результат.Успешно	= Истина;
			Иначе
				Результат.Ошибки.Добавить(СтрШаблон("Недопустимый тип основания: '%1' !", ТипДокумента));
			КонецЕсли;
		КонецЕсли;
	Иначе
		Результат.Ошибки.Добавить("Не заполнен лист набора или переукладки !");		
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ЭтоДопустимыйЛистНабораИлиПереукладки(ДокСсылка)

Функция МожноАгрегироватьНакладную(Накладная)
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);	
	
	Если ЗначениеЗаполнено(Накладная) Тогда 
		ТипНакладной = ТипЗнч(Накладная);
		Если ТипНакладной = Тип("ДокументСсылка.РасходнаяНакладная")
			ИЛИ ТипНакладной = Тип("ДокументСсылка.Перемещение") Тогда
		
			СостояниеНакладной	= ПолучитьРеквизитШапки(Накладная, "СостояниеНакладной");		
			
				// Кухарь А.Ю. 12.02.2025 начало
				// Если СостояниеНакладнойДопускаетАгрегацию(СостояниеНакладной) Тогда
				Если СостояниеНакладнойДопускаетАгрегациюВПаллету(СостояниеНакладной) Тогда 
				// Кухарь А.Ю. 12.02.2025 конец
				
				Результат.Успешно = Истина;				
			Иначе
				Результат.Ошибки.Добавить(СтрШаблон("Недопустимое состояние накладной ( '%1' ) для агрегации палет !", СостояниеНакладной));
			КонецЕсли;			
		Иначе
			Результат.Ошибки.Добавить(СтрШаблон("Недопустимый тип накладной ( '%1' ) для агрегации палет !", ТипНакладной));					
		КонецЕсли;
	Иначе
		Результат.Ошибки.Добавить("Не указана накладная для агрегации палета !");		
	КонецЕсли;

	Возврат Результат;
КонецФункции //МожноАгрегироватьНакладную(Накладная) 

Функция СостояниеНакладнойДопускаетАгрегацию(СостояниеНакладной)
	Результат = Истина;
	Если СостояниеНакладной = Перечисления.СостоянияНакладной.ГотоваКОтгрузке
		ИЛИ СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена Тогда					
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //СостояниеНакладнойДопускаетАгрегацию(Состояние) 
//++Данилова Е.В. 10.02.2026 SNL-138 
Функция ВидОснованияДокускаетАгрегацию(Накладная)

	Результат = 
	ТипЗнч(Накладная) = Тип("ДокументСсылка.ПриходнаяНакладная") 
	И  ПолучитьРеквизитШапки(Накладная, "КодОперации") = Перечисления.КодыОперацийОстатки.ЗакупкаР; 
	
	Возврат  Результат; 
	
КонецФункции // ()

//--Данилова Е.В. 10.02.2026 

Функция ОпределитьТипУпаковкиПоСоставуЛН(ЛистНабора) Экспорт
	рПолучения	= Документы.ХранилищеКодовМаркировки.ПолучитьКМпоЛистуНабора(ЛистНабора);	
	
	ТипУпаковки	= Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
	
	Если рПолучения.КоличествоНоменклатуры > 1 Тогда	
		ТипУпаковки	= Перечисления.ТипыУпаковок.МультитоварнаяУпаковка;		
	КонецЕсли;
	
	Возврат ТипУпаковки;
КонецФункции

Функция ОпределитьТипУпаковкиПоСоставуНакладной(Накладная, ИмяТЧ = "Товары") Экспорт
	Результат = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Номенклатура) КАК КолПозицийНоменклатуры
	|ИЗ
	|	" + Накладная.Метаданные().ПолноеИмя() + "." + ИмяТЧ + " 
	|ГДЕ
	|	Ссылка = &Накладная
	|";
	Запрос.УстановитьПараметр("Накладная", Накладная);
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.КолПозицийНоменклатуры > 1 Тогда
		Результат = Перечисления.ТипыУпаковок.МультитоварнаяУпаковка;
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции //ОпределитьТипУпаковкиПоСоставуНакладной(Накладная, ИмяТЧ = "Товары") Экспорт
//Данилова Е.В. 12.01.2026 MARK-2540 добавлен параметр СтатусыОбработкиОМ 
Функция ЗаполнитьШтрихкодыУпаковокПоЛистамНабора(ДокМаркировки, НовыйСтатус = Неопределено, СтатусыОбработкиОМ = Неопределено)	Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	//++Данилова Е.В. 12.01.2026 MARK-2540 
	Если СтатусыОбработкиОМ = Неопределено Тогда
	
		СтатусыОбработкиОМ = Новый Массив; 	
	    СтатусыОбработкиОМ.Добавить(Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки); 
		
	КонецЕсли;
	//--Данилова Е.В. 12.01.2026
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ 
	|	*
	|ИЗ
	|(
	//Штуки в коробки по ЛН
	|	ВЫБРАТЬ
	|		ШтрихкодыКоробок.ШтрихкодКоробки 	КАК ШтрихкодКоробки,
	|		ШтрихкодКоробки.Наименование		КАК КодАгрегации,
	| 		ШтрихкодУпаковки                    КАК ШтрихкодУпаковки
	|	ИЗ	
	|		Документ.ЛистНабора.ШтрихкодыУпаковок КАК ШтрихкодыУпаковок
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 		
	|		Документ.МаркировкаТоваровИСМП.ШтрихкодыКоробок КАК ШтрихкодыКоробок
	|	ПО
	|		ШтрихкодыУпаковок.Ссылка = ШтрихкодыКоробок.ДокументОснование
	|	ГДЕ
	|		ШтрихкодыКоробок.Ссылка = &ДокМаркировки
	|		И ШтрихкодыУпаковок.ШтрихкодБлочка = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	//++Данилова Е.В. 29.05.2025  HELP-5130
	|       И ШтрихкодУпаковки.ТипШК  = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	//--Данилова Е.В. 29.05.2025
	//++Данилова Е.В. 02.04.2026 MARK-3539
	|		И НЕ &АгрегацииВЛП
	//--Данилова Е.В. 02.04.2026

	//Штуки в коробки
	|	ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ
	|		ШтрихкодыКоробок.ШтрихкодКоробки 				КАК ШтрихкодКоробки,
	|		ШтрихкодыКоробок.ШтрихкодКоробки.Наименование	КАК КодАгрегации,
	| 		ШтрихкодУпаковки                                КАК ШтрихкодУпаковки
	|	ИЗ	
	|		Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ШтрихкодыУпаковок
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 		
	|		Документ.МаркировкаТоваровИСМП.ШтрихкодыКоробок КАК ШтрихкодыКоробок
	|	ПО
	|		ШтрихкодыУпаковок.Ссылка = ШтрихкодыКоробок.ДокументОснование
	|	ГДЕ
	|		ШтрихкодыКоробок.Ссылка = &ДокМаркировки
	|		И ШтрихкодыУпаковок.ШтрихкодБлочка = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	//++Данилова Е.В. 29.05.2025  HELP-5130
	|       И ШтрихкодУпаковки.ТипШК  = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	//--Данилова Е.В. 29.05.2025
	//Блочки в коробки
	|	ОБЪЕДИНИТЬ	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ	
	|		ШтрихкодыУпаковок.Ссылка.КодАгрегации 				КАК ШтрихкодКоробки,
	|		ШтрихкодыУпаковок.Ссылка.КодАгрегации.Наименование	КАК КодАгрегации,
	|		ШтрихкодыУпаковок.ШтрихкодБлочка					КАК ШтрихкодУпаковки 
	|	ИЗ	
	|		Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ШтрихкодыУпаковок
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 		
	|		Документ.МаркировкаТоваровИСМП.ШтрихкодыКоробок КАК ШтрихкодыКоробок
	|	ПО
	|		ШтрихкодыУпаковок.Ссылка = ШтрихкодыКоробок.ДокументОснование
	|	ГДЕ
	|		ШтрихкодыКоробок.Ссылка = &ДокМаркировки
	|		И ШтрихкодыКоробок.Ссылка.ТипШК <> ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)
	|		И ШтрихкодыУпаковок.ШтрихкодБлочка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)	
	// Кухарь А.Ю.  07.03.2025 начало
	//Блочки в коробки
	|	ОБЪЕДИНИТЬ	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ	
	|		ШтрихкодыУпаковок.Ссылка.КодАгрегации 				КАК ШтрихкодКоробки,
	|		ШтрихкодыУпаковок.Ссылка.КодАгрегации.Наименование	КАК КодАгрегации,
	|		ШтрихкодыУпаковок.ШтрихкодБлочка					КАК ШтрихкодУпаковки 
	|	ИЗ	
	|		Документ.ЛистНабора.ШтрихкодыУпаковок КАК ШтрихкодыУпаковок
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 		
	|		Документ.МаркировкаТоваровИСМП.ШтрихкодыКоробок КАК ШтрихкодыКоробок
	|	ПО
	|		ШтрихкодыУпаковок.Ссылка = ШтрихкодыКоробок.ДокументОснование
	|	ГДЕ
	|		ШтрихкодыКоробок.Ссылка = &ДокМаркировки
	|		И ШтрихкодыКоробок.Ссылка.ТипШК <> ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)
	|		И ШтрихкодыУпаковок.ШтрихкодБлочка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	//++Данилова Е.В. 02.04.2026 MARK-3539
	|		И НЕ &АгрегацииВЛП
	//--Данилова Е.В. 02.04.2026
	
	// Кухарь А.Ю.  07.03.2025 конец
	//++Данилова Е.В. 02.06.2025  HELP-5109
	|	ОБЪЕДИНИТЬ	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ	
	|		ШтрихкодыУпаковок.Ссылка.КодАгрегации 				КАК ШтрихкодКоробки,
	|		ШтрихкодыУпаковок.Ссылка.КодАгрегации.Наименование	КАК КодАгрегации,
	|		ШтрихкодыУпаковок.ШтрихкодУпаковки					КАК ШтрихкодУпаковки 
	|	ИЗ	
	|		Документ.ЛистНабора.ШтрихкодыУпаковок КАК ШтрихкодыУпаковок
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 		
	|		Документ.МаркировкаТоваровИСМП.ШтрихкодыКоробок КАК ШтрихкодыКоробок
	|	ПО
	|		ШтрихкодыУпаковок.Ссылка = ШтрихкодыКоробок.ДокументОснование
	|	ГДЕ
	|		ШтрихкодыКоробок.Ссылка = &ДокМаркировки
	|		И ШтрихкодыКоробок.Ссылка.ТипШК <> ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)
	|		И ШтрихкодыУпаковок.ШтрихкодБлочка = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|		И ШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)
	//++Данилова Е.В. 02.04.2026 MARK-3539
	|		И НЕ &АгрегацииВЛП
	//--Данилова Е.В. 02.04.2026
	|
	|	ОБЪЕДИНИТЬ	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ	
	|		ШтрихкодыУпаковок.Ссылка.КодАгрегации 				КАК ШтрихкодКоробки,
	|		ШтрихкодыУпаковок.Ссылка.КодАгрегации.Наименование	КАК КодАгрегации,
	|		ШтрихкодыУпаковок.ШтрихкодУпаковки					КАК ШтрихкодУпаковки 
	|	ИЗ	
	|		Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ШтрихкодыУпаковок
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 		
	|		Документ.МаркировкаТоваровИСМП.ШтрихкодыКоробок КАК ШтрихкодыКоробок
	|	ПО
	|		ШтрихкодыУпаковок.Ссылка = ШтрихкодыКоробок.ДокументОснование
	|	ГДЕ
	|		ШтрихкодыКоробок.Ссылка = &ДокМаркировки
	|		И ШтрихкодыКоробок.Ссылка.ТипШК <> ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)
	|		И ШтрихкодыУпаковок.ШтрихкодБлочка = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка) 
	|		И ШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок) 
	//--Данилова Е.В. 02.06.2025
	
	// Кухарь А.Ю. 01.03.2025 начало
	//Штуки в блочки
	|	ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ	
	|		ШтрихкодыУпаковок.ШтрихкодБлочка 				КАК ШтрихкодКоробки,
	|		ШтрихкодыУпаковок.ШтрихкодБлочка.Наименование	КАК КодАгрегации,
	|		ШтрихкодыУпаковок.ШтрихкодУпаковки				КАК ШтрихкодУпаковки 
	|	ИЗ	
	|		Документ.ЛистНабора.ШтрихкодыУпаковок КАК ШтрихкодыУпаковок
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 		
	|		Документ.МаркировкаТоваровИСМП.ШтрихкодыКоробок КАК ШтрихкодыКоробок
	|	ПО
	|		ШтрихкодыУпаковок.Ссылка = ШтрихкодыКоробок.ДокументОснование
	|	ГДЕ
	|		ШтрихкодыКоробок.Ссылка = &ДокМаркировки
	|		И ШтрихкодыКоробок.Ссылка.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)
	|		И ШтрихкодыУпаковок.ШтрихкодБлочка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	//++Данилова Е.В. 02.04.2026 MARK-3539
	|		И НЕ &АгрегацииВЛП
	//--Данилова Е.В. 02.04.2026
	
	// Кухарь А.Ю. 01.03.2025 конец
	//++Данилова Е.В. 27.05.2025 HELP-5130 HELP-5109
	|	    И ШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	//  |	ОБЪЕДИНИТЬ
	//|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|		ШтрихкодыУпаковок.ШтрихкодБлочка КАК ШтрихкодКоробки,
	//|		ШтрихкодыУпаковок.ШтрихкодБлочка.Наименование КАК КодАгрегации,
	//|		ШтрихкодыУпаковокТоваров.Штрихкод КАК ШтрихкодУпаковки
	//|	ИЗ
	//|		Документ.ЛистНабора.ШтрихкодыУпаковок КАК ШтрихкодыУпаковок
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП.ШтрихкодыКоробок КАК ШтрихкодыКоробок
	//|			ПО ШтрихкодыУпаковок.Ссылка = ШтрихкодыКоробок.ДокументОснование
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваров
	//|			ПО ШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваров.Ссылка
	//|	ГДЕ
	//|		ШтрихкодыКоробок.Ссылка = &ДокМаркировки
	//|		И ШтрихкодыКоробок.Ссылка.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)
	//|		И ШтрихкодыУпаковок.ШтрихкодБлочка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	//|		И ШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)
	//|		И ШтрихкодыУпаковок.ШтрихкодУпаковки <> ШтрихкодыУпаковок.ШтрихкодБлочка 
	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ШтрихкодыКоробокДляАгрегации.НовыйКодКоробки,
	|		ШтрихкодыКоробокДляАгрегации.НовыйКодКоробки.Наименование,
	|		ВложенныеШтрихкодыСпр.Штрихкод
	|	ИЗ
	|		Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ШтрихкодыКоробокДляАгрегации
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШтрихкодыСпр
	|			ПО ШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки = ВложенныеШтрихкодыСпр.Ссылка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМПОснование
	|			ПО ШтрихкодыКоробокДляАгрегации.Ссылка.ДокОснование = МаркировкаТоваровИСМПОснование.ДокументОснование
	|	ГДЕ
	|		МаркировкаТоваровИСМПОснование.Ссылка = &ДокМаркировки
	|		И ШтрихкодыКоробокДляАгрегации.Ссылка.ДополнительныеАгрегации
	|       И ШтрихкодыКоробокДляАгрегации.НовыйКодКоробки <> ШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки 
	//++Данилова Е.В. 02.04.2026 MARK-3539
	|		И НЕ &АгрегацииВЛП
	//--Данилова Е.В. 02.04.2026
	|
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ШтрихкодыКоробокДляАгрегации.НовыйКодКоробки,
	|		ШтрихкодыКоробокДляАгрегации.НовыйКодКоробки.Наименование,
	|		ВложенныеШтрихкодыСпр.Штрихкод
	|	ИЗ
	|		Документ.ЛистПереукладки.ШтрихкодыКоробокДляАгрегации КАК ШтрихкодыКоробокДляАгрегации
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШтрихкодыСпр
	|			ПО ШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки = ВложенныеШтрихкодыСпр.Ссылка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМПОснование
	|			ПО ШтрихкодыКоробокДляАгрегации.Ссылка.ДокОснование = МаркировкаТоваровИСМПОснование.ДокументОснование
	|	ГДЕ
	|		МаркировкаТоваровИСМПОснование.Ссылка = &ДокМаркировки
	|		И ШтрихкодыКоробокДляАгрегации.Ссылка.ДополнительныеАгрегации 
	|       И ШтрихкодыКоробокДляАгрегации.НовыйКодКоробки <> ШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки
	|

	//--Данилова Е.В. 27.05.2025
	
	//Штуки в блочки
	|	ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ	
	|		ШтрихкодыУпаковок.ШтрихкодБлочка 				КАК ШтрихкодКоробки,
	|		ШтрихкодыУпаковок.ШтрихкодБлочка.Наименование	КАК КодАгрегации,
	|		ШтрихкодыУпаковок.ШтрихкодУпаковки				КАК ШтрихкодУпаковки 
	|	ИЗ	
	|		Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ШтрихкодыУпаковок
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 		
	|		Документ.МаркировкаТоваровИСМП.ШтрихкодыКоробок КАК ШтрихкодыКоробок
	|	ПО
	|		ШтрихкодыУпаковок.Ссылка = ШтрихкодыКоробок.ДокументОснование
	|	ГДЕ
	|		ШтрихкодыКоробок.Ссылка = &ДокМаркировки
	|		И ШтрихкодыКоробок.Ссылка.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)
	|		И ШтрихкодыУпаковок.ШтрихкодБлочка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	//++Данилова Е.В. 27.05.2025  HELP-5109
	|	    И ШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	//|	ОБЪЕДИНИТЬ
	//|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|		ШтрихкодыУпаковок.ШтрихкодБлочка КАК ШтрихкодКоробки,
	//|		ШтрихкодыУпаковок.ШтрихкодБлочка.Наименование КАК КодАгрегации,
	//|		ШтрихкодыУпаковокТоваров.Штрихкод КАК ШтрихкодУпаковки
	//|	ИЗ
	//|		Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ШтрихкодыУпаковок
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП.ШтрихкодыКоробок КАК ШтрихкодыКоробок
	//|			ПО ШтрихкодыУпаковок.Ссылка = ШтрихкодыКоробок.ДокументОснование
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваров
	//|			ПО ШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваров.Ссылка
	//|	ГДЕ
	//|		ШтрихкодыКоробок.Ссылка = &ДокМаркировки
	//|		И ШтрихкодыКоробок.Ссылка.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)
	//|		И ШтрихкодыУпаковок.ШтрихкодБлочка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	//|		И ШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)
	//|		И ШтрихкодыУпаковок.ШтрихкодУпаковки <> ШтрихкодыУпаковок.ШтрихкодБлочка
	
	//--Данилова Е.В. 27.05.2025  HELP-5109
	|) КАК Сводный
	|УПОРЯДОЧИТЬ ПО
	|	ШтрихкодКоробки.Наименование,
	|	ШтрихкодУпаковки.Наименование
	|";
	
	Запрос.УстановитьПараметр("ДокМаркировки", ДокМаркировки);
	//++Данилова Е.В. 02.04.2026 MARK-3539
	запрос.УстановитьПараметр("АгрегацииВЛП",МаркировкаС.ЕстьЛПСКодамиЧЗ(ДокМаркировки.ДокументОснование));
	//--Данилова Е.В. 02.04.2026
	
	рШапки		= ПолучитьРеквизитыШапки(ДокМаркировки, "Статус,Проведен");
	
	Если рШапки.Проведен Тогда 
		//++Данилова Е.В. 12.01.2026 MARK-2540 
		//Если рШапки.Статус = Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки Тогда
		Если СтатусыОбработкиОМ.Найти(рШапки.Статус) <> Неопределено Тогда 
		//--Данилова Е.В. 12.01.2026 
			ДокОбъект	= ДокМаркировки.ПолучитьОбъект();	
			ДокОбъект.ШтрихкодыУпаковок.Загрузить(Запрос.Выполнить().Выгрузить());
			
			Если ЗначениеЗаполнено(НовыйСтатус) Тогда			
				ДокОбъект.Статус = НовыйСтатус;
			КонецЕсли;
			
			Попытка			
				    
				//ДокОбъект.Записать(?(ДокОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));  
				РазбитьОМ(ДокОбъект);				
				Результат.Успешно = Истина;
			Исключение
				ТекстСообщения = СтрШаблон("Ошибка записи документа: '%1' ! %2.", ДокМаркировки, ОписаниеОшибки());
				Результат.Ошибки.Добавить(ТекстСообщения);				
			КонецПопытки;			
		Иначе
			//++Данилова Е.В. 12.01.2026 MARK-2540 
			//Результат.Ошибки.Добавить(СтрШаблон("Недопустимый статус документа Операция Маркироки: '%1' ! Ожидаемый статус: '%2'", рШапки.Статус, Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки));
			Результат.Ошибки.Добавить(СтрШаблон("Недопустимый статус документа Операция Маркироки: '%1' ! Ожидаемый статус: '%2'", рШапки.Статус, СтрСоединить(СтатусыОбработкиОМ," или ")));
			
			//--Данилова Е.В. 12.01.2026 
		КонецЕсли;
	Иначе		
		Результат.Ошибки.Добавить("Документ не проведен !");
	КонецЕсли; 
	
	Возврат Результат;	
КонецФункции

Функция ЗаполнитьШтрихкодыУпаковокПоПалетам(ДокМаркировки, НовыйСтатус = Неопределено)	Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);	
	
	Накладная = ПолучитьРеквизитШапки(ДокМаркировки, "ДокументОснование");	
	Если НЕ (ЗначениеЗаполнено(Накладная) И ТипЗнч(Накладная) = Тип("ДокументСсылка.РасходнаяНакладная")) Тогда
		ТекстОшибки = СтрШаблон("Недопустимое значение основания агрегации: %1, основание: %2 (%3) !", ДокМаркировки, Накладная, ТипЗнч(Накладная));
		Результат.Ошибки.Добавить(ТекстОшибки);
		Возврат Результат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;  
	// Кухарь А.Ю.  17.04.2025 начало
	
	ПравилаРаботыСАгрегациейЧЗ=МаркировкаКС.ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладной(Накладная);
	
	если  ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияКоробок
		тогда
		// Кухарь А.Ю.  17.04.2025 конец
		
         
		// Кухарь А.Ю.  06.11.2025 начало
		// HELP-7763
		//Запрос.Текст = "
		//|ВЫБРАТЬ 		
		//|	ШтрихкодУпаковкиПаллеты 				КАК ШтрихкодКоробки,
		//|	ШтрихкодУпаковкиПаллеты.Наименование	КАК КодАгрегации,
		//|	ЛистНабора.КодАгрегации					КАК ШтрихкодУпаковки
		//|ИЗ
		//|	Документ.Паллета.ЛистыНабора КАК ПаллетаЛистыНабора
		//|ГДЕ
		//|	Документ = &Накладная
		//|	И Ссылка.Проведен
		//|	И ВЫРАЗИТЬ(ЛистНабора.КодАгрегации КАК Справочник.ШтрихКодыУпаковокТоваров)<>ЗНАЧЕНИЕ(Справочник.ШтрихКодыУпаковокТоваров.ПустаяСсылка)
		//|	И ШтрихкодУпаковкиПаллеты<>ЗНАЧЕНИЕ(Справочник.ШтрихКодыУпаковокТоваров.ПустаяСсылка)
		//|УПОРЯДОЧИТЬ ПО
		//|	ШтрихкодУпаковкиПаллеты.Наименование,
		//|	ЛистНабора.КодАгрегации.Наименование
		//|";  
		Запрос.Текст = "ВЫБРАТЬ
		|	ТЗСводная.ШтрихкодКоробки КАК ШтрихкодКоробки,
		|	ТЗСводная.КодАгрегации КАК КодАгрегации,
		|	ТЗСводная.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПаллетаЛистыНабора.ШтрихкодУпаковкиПаллеты КАК ШтрихкодКоробки,
		|		ПаллетаЛистыНабора.ШтрихкодУпаковкиПаллеты.Наименование КАК КодАгрегации,
		|		ПаллетаЛистыНабора.ЛистНабора.КодАгрегации КАК ШтрихкодУпаковки
		|	ИЗ
		|		Документ.Паллета.ЛистыНабора КАК ПаллетаЛистыНабора
		|	ГДЕ
		|		ПаллетаЛистыНабора.Документ = &Накладная
		|		И ПаллетаЛистыНабора.Ссылка.Проведен
		|		И (ВЫРАЗИТЬ(ПаллетаЛистыНабора.ЛистНабора.КодАгрегации КАК Справочник.ШтрихкодыУпаковокТоваров)) <> ЗНАЧЕНИЕ(Справочник.ШтрихКодыУпаковокТоваров.ПустаяСсылка)
		|		И ПаллетаЛистыНабора.ШтрихкодУпаковкиПаллеты <> ЗНАЧЕНИЕ(Справочник.ШтрихКодыУпаковокТоваров.ПустаяСсылка)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПаллетаЛистыНабора.ШтрихкодУпаковкиПаллеты,
		|		ПаллетаЛистыНабора.ШтрихкодУпаковкиПаллеты.Наименование,
		|		ЛистНабораШтрихкодыКоробокДляАгрегации.НовыйКодКоробки
		|	ИЗ
		|		Документ.Паллета.ЛистыНабора КАК ПаллетаЛистыНабора
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ЛистНабораШтрихкодыКоробокДляАгрегации
		|			ПО ПаллетаЛистыНабора.ЛистНабора = ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка
		|	ГДЕ
		|		ПаллетаЛистыНабора.Документ = &Накладная
		|		И ПаллетаЛистыНабора.Ссылка.Проведен
		|		И (ВЫРАЗИТЬ(ПаллетаЛистыНабора.ЛистНабора.КодАгрегации КАК Справочник.ШтрихкодыУпаковокТоваров)) = ЗНАЧЕНИЕ(Справочник.ШтрихКодыУпаковокТоваров.ПустаяСсылка)
		|		И ЛистНабораШтрихкодыКоробокДляАгрегации.НовыйКодКоробки <> ЗНАЧЕНИЕ(Справочник.ШтрихКодыУпаковокТоваров.ПустаяСсылка)) КАК ТЗСводная
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТЗСводная.КодАгрегации";   	
		// Кухарь А.Ю.  06.11.2025 конец
		
		// Кухарь А.Ю.  17.04.2025 начало
		// 
	Иначе 
		
		Запрос.Текст = "ВЫБРАТЬ различные
		|	ЛистНабораШтрихкодыУпаковок.Ссылка КАК ЛистНабора,
		|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		|ПОМЕСТИТЬ КодыЛН
		|ИЗ
		|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		|ГДЕ
		|	ЛистНабораШтрихкодыУпаковок.Ссылка.Проведен
		|	И ЛистНабораШтрихкодыУпаковок.Ссылка.ДокОснование = &Накладная
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПаллетаЛистыНабора.ШтрихкодУпаковкиПаллеты КАК ШтрихкодКоробки,
		|	ПаллетаЛистыНабора.ШтрихкодУпаковкиПаллеты.Наименование КАК КодАгрегации,
		|	КодыЛН.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		|ИЗ
		|	Документ.Паллета.ЛистыНабора КАК ПаллетаЛистыНабора
		|		ЛЕВОЕ СОЕДИНЕНИЕ КодыЛН КАК КодыЛН
		|		ПО ПаллетаЛистыНабора.ЛистНабора = КодыЛН.ЛистНабора
		|ГДЕ
		|	ПаллетаЛистыНабора.Документ = &Накладная
		|	И ПаллетаЛистыНабора.Ссылка.Проведен
		|	И ПаллетаЛистыНабора.ШтрихкодУпаковкиПаллеты <> ЗНАЧЕНИЕ(Справочник.ШтрихКодыУпаковокТоваров.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПаллетаЛистыНабора.ШтрихкодУпаковкиПаллеты.Наименование,
		|	ПаллетаЛистыНабора.ЛистНабора.КодАгрегации.Наименование";
		Если  ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияБлочков тогда 
			запрос.Текст=СтрЗаменить(запрос.Текст,"ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки","ЛистНабораШтрихкодыУпаковок.ШтрихкодБлочка КАК ШтрихкодУпаковки");
		КонецЕсли;	
	КонецЕсли;
	// Кухарь А.Ю.  17.04.2025 конец
	
	
	
	Запрос.УстановитьПараметр("Накладная", Накладная);
	
	рШапки		= ПолучитьРеквизитыШапки(ДокМаркировки, "Статус,Проведен");
	
	Если рШапки.Проведен Тогда
		Если рШапки.Статус = Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки Тогда
			ДокОбъект	= ДокМаркировки.ПолучитьОбъект();	
			ДокОбъект.ШтрихкодыУпаковок.Загрузить(Запрос.Выполнить().Выгрузить());
			
			Если ЗначениеЗаполнено(НовыйСтатус) Тогда			
				ДокОбъект.Статус = НовыйСтатус;
			КонецЕсли;
			
			Попытка			
				ДокОбъект.Записать(?(ДокОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
				Результат.Успешно = Истина;
			Исключение
				ТекстСообщения = СтрШаблон("Ошибка записи документа: '%1' ! %2.", ДокМаркировки, ОписаниеОшибки());
				Результат.Ошибки.Добавить(ТекстСообщения);				
			КонецПопытки;			
		Иначе			
			Результат.Ошибки.Добавить(СтрШаблон("Недопустимый статус документа: '%1' !", рШапки.Статус));
		КонецЕсли;
	Иначе		
		Результат.Ошибки.Добавить("Документ не проведен !");
	КонецЕсли; 
	
	Возврат Результат;	
КонецФункции //ЗаполнитьШтрихкодыУпаковокПоПалетам(Накладная, НовыйСтатус = Неопределено)	Экспорт

Функция ПроверитьЗаполнитьСоставАгрегационныхКодов(ДокАгрегации) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();                     
	
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШтрихкодКоробки,
	|	ШтрихкодУпаковки,                         
	//+++Чирков 17.10.2025 MARK-3089
	//|	ШтрихкодУпаковки.Количество КАК Количество
	|	ВЫБОР 
	|		КОГДА ШтрихкодУпаковки.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.ЛогистическаяУпаковка) 
	|			ТОГДА ШтрихкодУпаковки.Количество 
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Количество	                
	//---Чирков 17.10.2025
	|ПОМЕСТИТЬ ВТ_ДанныеДокумента
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка = &ДокАгрегации
	|	И ШтрихкодКоробки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|	И ШтрихкодУпаковки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныеШтрихкоды.Ссылка	КАК ШтрихкодКоробки,
	|	ВложенныеШтрихкоды.Штрихкод	КАК ШтрихкодУпаковки
	|ПОМЕСТИТЬ ВТ_ДанныеСправочника
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШтрихкоды
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ ШтрихкодКоробки ИЗ ВТ_ДанныеДокумента) КАК КодыКоробок	
	|ПО
	|	ВложенныеШтрихкоды.Ссылка = КодыКоробок.ШтрихкодКоробки	
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ	
	|	ВТ_ДанныеДокумента.ШтрихкодКоробки КАК ШтрихкодКоробки	
	|ПОМЕСТИТЬ ВТ_КривыеКодыКоробок
	|ИЗ
	|	ВТ_ДанныеДокумента
	|ПОЛНОЕ СОЕДИНЕНИЕ	
	|	ВТ_ДанныеСправочника	
	|ПО
	|	ВТ_ДанныеДокумента.ШтрихкодКоробки = ВТ_ДанныеСправочника.ШтрихкодКоробки
	|	И ВТ_ДанныеДокумента.ШтрихкодУпаковки = ВТ_ДанныеСправочника.ШтрихкодУпаковки
	|ГДЕ	
	|	НЕ ВТ_ДанныеДокумента.ШтрихкодКоробки ЕСТЬ NULL
	|	И (
	|		IsNULL(ВТ_ДанныеДокумента.ШтрихкодУпаковки, ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)) 
	|			<> IsNULL(ВТ_ДанныеСправочника.ШтрихкодУпаковки, ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка))
	|		ИЛИ ВТ_ДанныеДокумента.ШтрихкодКоробки.Количество = 0
	|	)
	|;
	|ВЫБРАТЬ	
	|	ВТ_ДанныеДокумента.ШтрихкодКоробки				КАК ШтрихкодКоробки,
	|	ВТ_ДанныеДокумента.ШтрихкодУпаковки.Владелец 	КАК Номенклатура,
	|	ВТ_ДанныеДокумента.ШтрихкодУпаковки.Владелец 	КАК КолНоменклатуры,
	|	ВТ_ДанныеДокумента.ШтрихкодУпаковки 			КАК ШтрихкодУпаковки_Док,	
	|	ВТ_ДанныеДокумента.Количество					КАК Количество		
	|ИЗ
	|	ВТ_ДанныеДокумента
	|ПРАВОЕ СОЕДИНЕНИЕ	
	|	ВТ_КривыеКодыКоробок
	|ПО
	|	ВТ_ДанныеДокумента.ШтрихкодКоробки = ВТ_КривыеКодыКоробок.ШтрихкодКоробки	
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ДанныеДокумента.ШтрихкодУпаковки),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КолНоменклатуры),
	|	СУММА(Количество),
	|	МАКСИМУМ(Номенклатура)	
	|ПО
	|	ВТ_ДанныеДокумента.ШтрихкодКоробки	
	|";
	
	Запрос.УстановитьПараметр("ДокАгрегации", ДокАгрегации);
	
	ТипУпаковки = Неопределено;
	
	Выборка_ШтрихкодКоробки = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ШтрихкодКоробки");
	Пока Выборка_ШтрихкодКоробки.Следующий() Цикл
		СпрОбъект = Выборка_ШтрихкодКоробки.ШтрихкодКоробки.ПолучитьОбъект();
		
		Если 1=2 Тогда
			СпрОбъект = Справочники.ШтрихкодыУпаковокТоваров.СоздатьЭлемент();		
		КонецЕсли; 
		
		СпрОбъект.ВложенныеШтрихкоды.Очистить();
		Выборка = Выборка_ШтрихкодКоробки.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаТЧ = СпрОбъект.ВложенныеШтрихкоды.Добавить();		
			СтрокаТЧ.Штрихкод = Выборка.ШтрихкодУпаковки_Док;		
		КонецЦикла;
		
		Если Выборка_ШтрихкодКоробки.КолНоменклатуры = 1 Тогда
			СпрОбъект.ТипУпаковки	= Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
			СпрОбъект.Владелец		= Выборка_ШтрихкодКоробки.Номенклатура;
			Если ТипУпаковки = Неопределено Тогда
				ТипУпаковки = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;			
			КонецЕсли; 
		Иначе
			СпрОбъект.Владелец = Неопределено;		
			СпрОбъект.ТипУпаковки = Перечисления.ТипыУпаковок.МультитоварнаяУпаковка;
			
			ТипУпаковки = Перечисления.ТипыУпаковок.МультитоварнаяУпаковка;
		КонецЕсли; 
		
		СпрОбъект.Количество 			= Выборка_ШтрихкодКоробки.Количество;
		
		СпрОбъект.ОбменДанными.Загрузка = Истина;
		СпрОбъект.ДополнительныеСвойства.Вставить("ОтключитьПроверки", Истина);
		
		СпрОбъект.Записать();	
		
		Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТипУпаковки) Тогда
		ТипУпаковкиДокумента = ПолучитьРеквизитШапки(ДокАгрегации, "ТипУпаковки");
		Если ТипУпаковкиДокумента <> ТипУпаковки Тогда
			УстановитьРеквизитыОбъекта(ДокАгрегации, Новый Структура("ТипУпаковки", ТипУпаковки));
		КонецЕсли; 
	КонецЕсли;
	
	ВремяВыполнения = (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало) / 1000;
	ТекстСообщения = СтрШаблон("Обработка док-та: %1, записано: %2 агр. кодов.", ДокАгрегации, Результат.ОбработаноОбъектов);
	ЗаписатьВЛог("ЗаполнениеАгрегаций", ТекстСообщения, "Информация", , , ВремяВыполнения);
	
	Возврат Результат;
КонецФункции //ПроверитьЗаполнитьСоставАгрегационныхКодов(ДокАгрегации) Экспорт 

Функция ПроверитьЗаполнитьСоставКодовНабора(ДокФормированияНабора) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Если ЗначениеЗаполнено(ДокФормированияНабора) Тогда
		Если ТипЗнч(ДокФормированияНабора) = Тип("ДокументСсылка.МаркировкаТоваровИСМП") Тогда
			ВидОперации = ПолучитьРеквизитШапки(ДокФормированияНабора, "ВидОперации");
			Если ВидОперации <> Перечисления.ВидыОперацийМаркировки.ФормированиеНабора Тогда
				ТекстОшибки = СтрШаблон("Неподдерживаемый вид операции: '%1' !",  ВидОперации);
			КонецЕсли;
		Иначе                                                                         
			ТекстОшибки = СтрШаблон("Неподдерживаемый вид обрабатываемого документа: '%1' !",  ТипЗнч(ДокФормированияНабора));
			Результат.Ошибки.Добавить(ТекстОшибки);
		КонецЕсли;
	Иначе       
		Результат.Ошибки.Добавить("Не указан обрабатываемый документ !");		
	КонецЕсли;                                                           
	
	Если Результат.Ошибки.Количество() > 0 Тогда
		Возврат Результат;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШтрихкодНабора,
	|	ШтрихкодУпаковки,
	|	ШтрихкодУпаковки.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_ДанныеДокумента
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка = &ДокФормированияНабора
	|	И ШтрихкодНабора <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|	И ШтрихкодУпаковки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|ИНДЕКСИРОВАТЬ ПО
	|	ШтрихкодНабора,
	|	ШтрихкодУпаковки
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныеШтрихкоды.Ссылка	КАК ШтрихкодНабора,
	|	ВложенныеШтрихкоды.Штрихкод	КАК ШтрихкодУпаковки
	|ПОМЕСТИТЬ ВТ_ДанныеСправочника
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШтрихкоды
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ ШтрихкодНабора ИЗ ВТ_ДанныеДокумента) КАК КодыНаборов
	|ПО
	|	ВложенныеШтрихкоды.Ссылка = КодыНаборов.ШтрихкодНабора	
	|ИНДЕКСИРОВАТЬ ПО
	|	ШтрихкодНабора,
	|	ШтрихкодУпаковки
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ	
	|	ВТ_ДанныеДокумента.ШтрихкодНабора КАК ШтрихкодНабора	
	|ПОМЕСТИТЬ ВТ_КривыеКоды
	|ИЗ
	|	ВТ_ДанныеДокумента
	|ПОЛНОЕ СОЕДИНЕНИЕ	
	|	ВТ_ДанныеСправочника	
	|ПО
	|	ВТ_ДанныеДокумента.ШтрихкодНабора = ВТ_ДанныеСправочника.ШтрихкодНабора
	|	И ВТ_ДанныеДокумента.ШтрихкодУпаковки = ВТ_ДанныеСправочника.ШтрихкодУпаковки
	|ГДЕ	
	|	НЕ ВТ_ДанныеДокумента.ШтрихкодНабора ЕСТЬ NULL
	|	И (
	|		IsNULL(ВТ_ДанныеДокумента.ШтрихкодУпаковки, ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)) 
	|			<> IsNULL(ВТ_ДанныеСправочника.ШтрихкодУпаковки, ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка))
	|		ИЛИ ВТ_ДанныеДокумента.ШтрихкодНабора.Количество = 0
	|	)
	|;
	|ВЫБРАТЬ	
	|	ВТ_ДанныеДокумента.ШтрихкодНабора				КАК ШтрихкодНабора,
	|	ВТ_ДанныеДокумента.ШтрихкодУпаковки.Владелец 	КАК Номенклатура,
	|	ВТ_ДанныеДокумента.ШтрихкодУпаковки.Владелец 	КАК КолНоменклатуры,
	|	ВТ_ДанныеДокумента.ШтрихкодУпаковки 			КАК ШтрихкодУпаковки_Док,	
	|	ВТ_ДанныеДокумента.Количество					КАК Количество		
	|ИЗ
	|	ВТ_ДанныеДокумента
	|ПРАВОЕ СОЕДИНЕНИЕ	
	|	ВТ_КривыеКоды
	|ПО
	|	ВТ_ДанныеДокумента.ШтрихкодНабора = ВТ_КривыеКоды.ШтрихкодНабора	
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ДанныеДокумента.ШтрихкодУпаковки),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КолНоменклатуры),
	|	СУММА(Количество),
	|	МАКСИМУМ(Номенклатура)	
	|ПО
	|	ВТ_ДанныеДокумента.ШтрихкодНабора
	|";
	
	Запрос.УстановитьПараметр("ДокФормированияНабора", ДокФормированияНабора);
	
	ТипУпаковки = Неопределено;
	
	Выборка_ШтрихкодНабора = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ШтрихкодНабора");
	Пока Выборка_ШтрихкодНабора.Следующий() Цикл
		СпрОбъект = Выборка_ШтрихкодНабора.ШтрихкодНабора.ПолучитьОбъект();
		
		Если 1 = 2 Тогда
			СпрОбъект = Справочники.ШтрихкодыУпаковокТоваров.СоздатьЭлемент();		
		КонецЕсли; 
		
		СпрОбъект.ВложенныеШтрихкоды.Очистить();
		Выборка = Выборка_ШтрихкодНабора.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаТЧ = СпрОбъект.ВложенныеШтрихкоды.Добавить();		
			СтрокаТЧ.Штрихкод = Выборка.ШтрихкодУпаковки_Док;		
		КонецЦикла;
						
		СпрОбъект.Количество = Выборка_ШтрихкодНабора.Количество;
		
		СпрОбъект.ОбменДанными.Загрузка = Истина;
		СпрОбъект.ДополнительныеСвойства.Вставить("ОтключитьПроверки", Истина);
		
		СпрОбъект.Записать();	
		
		Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;
	КонецЦикла;	
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
КонецФункции //ПроверитьЗаполнитьСоставКодовНабора(ДокФормированияНабора) Экспорт 

Функция ДобавитьШККоробкиВАгрегацию(ДокМаркировки, ЛистНабора, ШтрихКодАгрегации) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	ТипШК_Код = ПолучитьРеквизитШапки(ШтрихКодАгрегации, 	"ТипШК");
	ТипШК_Док = ПолучитьРеквизитШапки(ДокМаркировки, 		"ТипШК");
	Если ТипШК_Код <> ТипШК_Док Тогда
		Результат.Ошибки.Добавить("Не совпадют типы ШК кода и документа !");
		Возврат Результат;	
	КонецЕсли; 	
	
	мШтрихКодАгрегации = ВыдавалсяКодАгрегации(ДокМаркировки, ЛистНабора, ШтрихКодАгрегации);
	Если ЗначениеЗаполнено(мШтрихКодАгрегации) Тогда
		ТекстСообщения = СтрШаблон("Для документа '%1' уже выдавался код агрегации '%2' !", ЛистНабора, мШтрихКодАгрегации);
		Результат.Ошибки.Добавить(ТекстСообщения);
	Иначе					
		ДокОбъект = ДокМаркировки.ПолучитьОбъект();
		Если ДокОбъект.Статус = Перечисления.СтатусыДокументовМаркировки.ВРаботе Тогда
			ДокОбъект.Статус = Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки;					
		КонецЕсли;
		Если НЕ ДокОбъект.Проведен Тогда
		    ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);		
		КонецЕсли;
		
		СтрокаК = ДокОбъект.ШтрихкодыКоробок.Добавить();											
			
		СтрокаК.ШтрихкодКоробки		= ШтрихКодАгрегации;
		СтрокаК.ДокументОснование   = ЛистНабора;
		СтрокаК.ДатаДобавления		= ТекущаяДата();
		
		Попытка
			ДокОбъект.Записать();
			
			Результат.Успешно 	= Истина;						
		Исключение
			ТекстОшибки = СтрШаблон("Не удалось провести документ агрегации: '%1' ! %2", ДокОбъект, ОписаниеОшибки());
			Результат.Ошибки.Добавить(ТекстОшибки);					
		КонецПопытки;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ДобавитьКодАгрегацииИзЛН(ДокументОснование) Экспорт

// Кухарь А.Ю. 12.02.2025 начало
// Временный кусочек
Функция СостояниеНакладнойДопускаетАгрегациюВПаллету(СостояниеНакладной)
	Результат = Истина;
	Если СостояниеНакладной <> Перечисления.СостоянияНакладной.ГотоваКОтгрузке тогда				
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции  
Процедура РазбитьОМ(ДокОбъект)         
	РазмерТЧ = 99500;
	Если ДокОбъект.ШтрихкодыУпаковок.Количество()>РазмерТЧ Тогда   
		ТЧ_ШК = ДокОбъект.ШтрихкодыУпаковок.Выгрузить();
		ДокОбъект.ШтрихкодыУпаковок.Очистить();
		ДокТЧ_Коробки = ДокОбъект.ШтрихкодыКоробок.Выгрузить();  
		ДокОбъект.ШтрихкодыКоробок.Очистить();
		
		ТЧ_Коробки = ТЧ_ШК.Скопировать(); 
		ТЧ_Коробки.Свернуть("ШтрихкодКоробки");
		ТЧ_Коробки.Сортировать("ШтрихкодКоробки");      
		
		Запрос = новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	Док_ШкКоробок.Ссылка КАК Ссылка
		                      |ИЗ
		                      |	Документ.МаркировкаТоваровИСМП.ШтрихкодыКоробок КАК Док_ШкКоробок
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК Док
		                      |		ПО (Док.Ссылка = Док_ШкКоробок.Ссылка)
		                      |			И (Док.ДокументОснование = &ДокументОснование)
		                      |			И (НЕ Док.Ссылка = &ТекОМ) и Док.Проведен
		                      |ГДЕ
		                      |	Док_ШкКоробок.ШтрихкодКоробки В(&ШтрихкодыКоробок)
		                      |
		                      |ОБЪЕДИНИТЬ
		                      |
		                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	ДокШкУпаковок.Ссылка
		                      |ИЗ
		                      |	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК ДокШкУпаковок
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК Док
		                      |		ПО (Док.Ссылка = ДокШкУпаковок.Ссылка)
		                      |			И (Док.ДокументОснование = &ДокументОснование)
		                      |			И (НЕ Док.Ссылка = &ТекОМ)  и Док.Проведен
		                      |ГДЕ
		                      |	ДокШкУпаковок.ШтрихкодУпаковки В(&ШтрихкодыУпаковок)");
		Запрос.УстановитьПараметр("ШтрихкодыКоробок",ТЧ_Коробки.ВыгрузитьКолонку("ШтрихкодКоробки"));
		Запрос.УстановитьПараметр("ШтрихкодыУпаковок",ТЧ_ШК.ВыгрузитьКолонку("ШтрихкодУпаковки"));
		Запрос.УстановитьПараметр("ТекОМ",ДокОбъект.Ссылка);    
		Запрос.УстановитьПараметр("ДокументОснование",ДокОбъект.ДокументОснование);    
		ВсеОМ = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		Для каждого ОМ Из ВсеОМ Цикл
			ОмОбъект = ОМ.ПолучитьОбъект();                
			ОмОбъект.Статус = Перечисления.СтатусыДокументовМаркировки.ВРаботе;
			ОмОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);   
			ОмОбъект.УстановитьПометкуУдаления(Истина);         
			НЗ = РегистрыСведений.ИспользованныеКодыАгрегаций.СоздатьНаборЗаписей();
			НЗ.Отбор.Регистратор.Установить(ОМ);         
			НЗ.Записать();
		КонецЦикла;	
		
		ТекДокОбъект = ДокОбъект;                 
		
		Для каждого Коробка Из ТЧ_Коробки.ВыгрузитьКолонку("ШтрихкодКоробки") Цикл 
			
			ТЧ_ШкКоробки = ТЧ_ШК.Скопировать(Новый Структура("ШтрихкодКоробки",Коробка));
			Если (ТекДокОбъект.ШтрихкодыУпаковок.Количество()+ТЧ_ШкКоробки.Количество())> РазмерТЧ Тогда  
				
				ТекДокОбъект.Записать(РежимЗаписиДокумента.Проведение);  
				ТекДокОбъект = Документы.МаркировкаТоваровИСМП.СоздатьДокумент();
				ЗаполнитьЗначенияСвойств(ТекДокОбъект,ДокОбъект,,"Номер");  
				ТекДокОбъект.ДокументыОснования.Загрузить(ДокОбъект.ДокументыОснования.Выгрузить());
 				ТекДокОбъект.Записать(РежимЗаписиДокумента.Запись);  
			КонецЕсли;	 
			
			СтрокиКоробок = ДокТЧ_Коробки.НайтиСтроки(Новый Структура("ШтрихкодКоробки",Коробка));    
			Для каждого СтрокаКоробок Из СтрокиКоробок Цикл
				СтрКоробки = ТекДокОбъект.ШтрихкодыКоробок.Добавить();	
				ЗаполнитьЗначенияСвойств(СтрКоробки,СтрокаКоробок);  
			КонецЦикла;	
			Для каждого СтрШкКоробки Из ТЧ_ШкКоробки Цикл 
				СтрТЧ = ТекДокОбъект.ШтрихкодыУпаковок.Добавить();
				ЗаполнитьЗначенияСвойств(СтрТЧ,СтрШкКоробки);
			КонецЦикла;	
		КонецЦикла;	
		
		ТекДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;	
КонецПроцедуры	

//++Данилова Е.В. 14.01.2026   ASU-2089 
Функция ПолучитьЗабронироватьКодАгрегацииДляМультиПаллеты(Паллета, Накладная,КоличествоКодов,Знач ТипУпаковки = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);	
		
	Если ЗначениеЗаполнено(Паллета) Тогда
		Если НЕ ТипЗнч(Паллета) = Тип("ДокументСсылка.Паллета") Тогда
			Результат.Ошибки.Добавить("Недопустимое основание для агрегации: " + ТипЗнч(Паллета));
		КонецЕсли; 
	Иначе
		Результат.Ошибки.Добавить("Не указана палета !");	
	КонецЕсли;	
	
	Если Результат.Ошибки.Количество() > 0 Тогда
		Возврат Результат;	
	КонецЕсли;
	
	рПроверки = МожноАгрегироватьНакладную(Накладная); 
	
	Если НЕ рПроверки.Успешно Тогда
		Возврат рПроверки;		
	КонецЕсли;	
	
	ТипШК = Перечисления.ТипыШтрихКодов.Палета;
	Если ТипУпаковки = Неопределено Тогда
		ТипУпаковки = ОпределитьТипУпаковкиПоСоставуНакладной(Накладная);			
	КонецЕсли;
	
	ОперАгрегации = Документы.МаркировкаТоваровИСМП.ПолучитьСоздатьДокАгрегации(Накладная, ТипШК);
	
	рБронирования = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыАгрегации(ТипШК,ТипУпаковки,КоличествоКодов,ОперАгрегации,Новый Структура("Добавлять", Истина)); 
	Если рБронирования.Успешно Тогда
		ШтрихкодыАгрегации = рБронирования.Данные;
		
		рДобавления = ДобавитьШККоробокВАгрегацию(ОперАгрегации, Накладная, ШтрихкодыАгрегации);
		Если рДобавления.Успешно Тогда
			Результат.Успешно 	= Истина;						
			Результат.Данные 	= ШтрихкодыАгрегации;
		Иначе						
			МаркировкаКС.ДобавитьОшибки(Результат, рДобавления);
		КонецЕсли;		
	Иначе
		МаркировкаКС.ДобавитьОшибки(Результат, рБронирования);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПолучитьЗабронироватьСвободныйКодАгрегацииДляЛН(ЛистНабора, ТипШК, Знач ТипУпаковки = Неопределено) Экспорт

Функция ДобавитьШККоробокВАгрегацию(ДокМаркировки, ЛистНабора, ШтрихКодыАгрегации) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь); 
	ТипШК_Док = ПолучитьРеквизитШапки(ДокМаркировки, 		"ТипШК");
	
	Для каждого ШтрихКодАгрегации Из ШтрихКодыАгрегации Цикл
		
		ТипШК_Код = ПолучитьРеквизитШапки(ШтрихКодАгрегации, 	"ТипШК");
		
		Если ТипШК_Код <> ТипШК_Док Тогда
			
			Результат.Ошибки.Добавить(СтрШаблон("Не совпадют типы ШК кода %1 и документа !",ТипШК_Код));
		Иначе 
			мШтрихКодАгрегации = ВыдавалсяКодАгрегации(ДокМаркировки, ЛистНабора, ШтрихКодАгрегации);
			
			Если ЗначениеЗаполнено(мШтрихКодАгрегации) Тогда
				ТекстСообщения = СтрШаблон("Для документа '%1' уже выдавался код агрегации '%2' !", ЛистНабора, мШтрихКодАгрегации);
				Результат.Ошибки.Добавить(ТекстСообщения);
			КонецЕсли;
		КонецЕсли;	
		
	КонецЦикла;
	
	Если Результат.Ошибки.Количество() > 0  Тогда 
		
		Возврат Результат;
	
	КонецЕсли;
	
	
	ДокОбъект = ДокМаркировки.ПолучитьОбъект();
	Если ДокОбъект.Статус = Перечисления.СтатусыДокументовМаркировки.ВРаботе Тогда
		ДокОбъект.Статус = Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки;					
	КонецЕсли;
	Если НЕ ДокОбъект.Проведен Тогда
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);		
	КонецЕсли;
	
	ТекДата =  ТекущаяДата();
	Для каждого ШтрихКодАгрегации Из ШтрихКодыАгрегации Цикл
		СтрокаК = ДокОбъект.ШтрихкодыКоробок.Добавить();											
		
		СтрокаК.ШтрихкодКоробки		= ШтрихКодАгрегации;
		СтрокаК.ДокументОснование   = ЛистНабора;
		СтрокаК.ДатаДобавления		= ТекДата; 
	КонецЦикла;
	
	Попытка
		ДокОбъект.Записать();
		
		Результат.Успешно 	= Истина;						
	Исключение
		ТекстОшибки = СтрШаблон("Не удалось провести документ агрегации: '%1' ! %2", ДокОбъект, ОписаниеОшибки());
		Результат.Ошибки.Добавить(ТекстОшибки);					
	КонецПопытки;
	
	
	Возврат Результат;
КонецФункции

//--Данилова Е.В. 14.01.2026 
#КонецОбласти 

 
#Область ОбменДанными
	

Процедура УстановитьПолучателейИзменений(ДокОбъект)	Экспорт
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли; 
	
	мПолучателей = СписокПолучателейИзменений(ДокОбъект);
	Для Каждого УзелПолучатель Из мПолучателей Цикл
		ДокОбъект.ОбменДанными.Получатели.Добавить(УзелПолучатель);
	КонецЦикла;	
	
	//Отправка подтверждений о приеме накладных складом или магазином
КонецПроцедуры

Функция СписокПолучателейИзменений(ДокОбъект, ДопИнфо = Неопределено)
	Если 1=2 Тогда
		ДокОбъект = Документы.ХранилищеКодовМаркировки.СоздатьДокумент();	
	КонецЕсли;
	
	СписокПолучателей	= Новый Массив;
	ЭтотУзел_Код		= Маркировка_ПИ.ЭтотУзел_Код();
	Если НЕ СокрЛП(ДокОбъект.КодУзлаСоздания) = СокрЛП(ЭтотУзел_Код) Тогда //"Чужие" документы никуда не отправляем
		Возврат СписокПолучателей
	КонецЕсли;	
	
	ЭтотУзел			= Маркировка_ПИ.ЭтотУзел();
	
	УправляющийУзел		= Маркировка_ПИ.УправляющийУзел();
	ТипУзла				= Маркировка_ПИ.ТипТекущегоУзла();
	
	ОбменДанными		= ДокОбъект.ОбменДанными;
	Отправитель			= ОбменДанными.Отправитель;
	Загрузка			= ОбменДанными.Загрузка;	
	
	ТипОснования		= ТипЗнч(ДокОбъект.ДокументОснование);
	
	Если ТипУзла = Перечисления.ТипУзлаИБ.Склад 
		ИЛИ ТипУзла = Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда //Склады, Филиалы, Магазины.....		
		МаркировкаС.ДобавитьУзелВПолучателей(СписокПолучателей, УправляющийУзел, Отправитель, Загрузка);
	Иначе //ЦО
		Если ТипОснования = Тип("ДокументСсылка.РасходнаяНакладная") 
			ИЛИ ТипОснования = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
			Склад		= ПолучитьРеквизитШапки(ДокОбъект.ДокументОснование, "Склад");
			УзелСклада	= Маркировка_ПИ.УзелСклада(Склад);
			МаркировкаС.ДобавитьУзелВПолучателей(СписокПолучателей, УзелСклада, Отправитель, Загрузка);			
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.Перемещение") Тогда
			СписокПолучателей = ПолучателиПеремещения(ДокОбъект);
		КонецЕсли;		
	КонецЕсли;
	
	Возврат ЗаполнениеДокументов.УдалитьПовторяющиесяЭлементыМассива(СписокПолучателей, Истина);	
КонецФункции

Функция ПолучитьПравилоВыгрузки(ДопПараметры = Неопределено) Экспорт	
	ОперИмпорта					= "Документ.МаркировкаТоваровИСМП";
	ОперИмпорта_Представление   = "ЗаказКМ";
	
	ИмяТаблицы_Тек	= "Документ.МаркировкаТоваровИСМП";	
	ИмяТаблицы_Ист	= "Документ.МаркировкаТоваровИСМП";
	
	МетаОбъект 		= Метаданные.НайтиПоПолномуИмени(ИмяТаблицы_Тек);
	
	ЗапросыИст = ОбменДаннымиЧЗ.СоздатьТаблицуИменЗапросов();	
	
	#Область ВТ_Ссылки
	
	ТекстЗапросаИзменений = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка
	|ИЗ	
	|	" + ИмяТаблицы_Ист + ".Изменения
	|ГДЕ
	|	Узел = &УзелПолучатель	
	|";
	
	ТекстЗапроса = "
	|ВЫБРАТЬ 
	|	Ссылка	
	|ПОМЕСТИТЬ ВТ_Ссылки
	|ИЗ	
	|	" + ИмяТаблицы_Ист + "
	|ГДЕ
	|	Ссылка В (&МассивСсылок)
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|";	
	
	ОбменДаннымиЧЗ.ДобавитьИмяТаблицы(ЗапросыИст, "ВТ_Ссылки", ТекстЗапроса, Ложь);
	
	#КонецОбласти
	
	#Область Шапка
	
	Поля = Новый Массив;
	Поля.Добавить("Шапка.Ссылка,Шапка.Номер,Шапка.Дата,Шапка.Проведен,Шапка.ПометкаУдаления");
	Для Каждого МетаРекв Из МетаОбъект.Реквизиты Цикл
		Поля.Добавить("Шапка." + МетаРекв.Имя);			
	КонецЦикла; 
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	" + СтрСоединить(Поля, ",") + "
    |ИЗ	
	|	" + ИмяТаблицы_Ист + " КАК Шапка
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	ВТ_Ссылки ПО ВТ_Ссылки.Ссылка = Шапка.Ссылка
	|УПОРЯДОЧИТЬ ПО 
	|	Дата,Номер
	|";	                                      
	ОбменДаннымиЧЗ.ДобавитьИмяТаблицы(ЗапросыИст, "Шапка", ТекстЗапроса, Истина, Ложь);	
	
	#КонецОбласти
	
	#Область ТЧ_Товары		
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТЧ.*
	|ИЗ	
	|	" + ИмяТаблицы_Ист + ".Товары КАК ТЧ
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	ВТ_Ссылки ПО ВТ_Ссылки.Ссылка = ТЧ.Ссылка
	|";
	
    ОбменДаннымиЧЗ.ДобавитьИмяТаблицы(ЗапросыИст, "ТЧ_Товары", ТекстЗапроса, Истина, Истина);
	
	#КонецОбласти
	
	#Область ТЧ_ШтрихкодыУпаковок	
	#КонецОбласти
	
	#Область ТЧ_ШтрихкодыКоробок
	#КонецОбласти
	
	#Область ТЧ_ДокументыОснования
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТЧ.*
	|ИЗ	
	|	" + ИмяТаблицы_Ист + ".ДокументыОснования КАК ТЧ
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	ВТ_Ссылки ПО ВТ_Ссылки.Ссылка = ТЧ.Ссылка
	|";
	
    ОбменДаннымиЧЗ.ДобавитьИмяТаблицы(ЗапросыИст, "ТЧ_ДокументыОснования", ТекстЗапроса, Истина, Истина);
	
	#КонецОбласти	

	Возврат Новый Структура("РазмерПорции,ТекстЗапросаИзменений,ЗапросыИст,ОперИмпорта,ОперИмпорта_Представление", 1000, ТекстЗапросаИзменений, ЗапросыИст, ОперИмпорта, ОперИмпорта_Представление);
КонецФункции //Экспорт

Функция ЗагрузитьДанныеПакета(ДанныеПакета, Отправитель, ДопПараметры = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	фПерезаписывать = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "фПерезаписывать", Ложь);
	
	Таблицы	= МаркировкаКС.ПолучитьЗначениеПараметра(ДанныеПакета, "Таблицы");
	
	Шапка 		= Неопределено;
	ДанныеТЧ 	= Новый Соответствие;
	
	Для Каждого КиЗ Из Таблицы Цикл		
		Если СтрНачинаетсяС(КиЗ.Ключ,"ТЧ_") Тогда
			КиЗ.Значение.Индексы.Добавить("Ссылка");
			ДанныеТЧ[Сред(КиЗ.Ключ, 4)] = КиЗ.Значение;
		ИначеЕсли КиЗ.Ключ = "Шапка" Тогда
			Шапка = КиЗ.Значение;			
		КонецЕсли;		
	КонецЦикла;	  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Шапка ИЗ &Шапка КАК Шапка
	|;
	|ВЫБРАТЬ
	|	IsNULL(Ссылка.ВерсияДанных,"""") КАК ВерсияДанных,
	|	*
	|ИЗ
	|	ВТ_Шапка
	|ГДЕ
	|	Ссылка.ВерсияДанных ЕСТЬ NULL	
	|	ИЛИ &фПерезаписывать
	|";  
	
	Запрос.УстановитьПараметр("Шапка", 				Шапка);
	Запрос.УстановитьПараметр("фПерезаписывать",	фПерезаписывать);
	
	Менеджер 		= Документы.МаркировкаТоваровИСМП;
	ВидДокумента	= "" + Метаданные.НайтиПоТипу(ТипЗнч(Менеджер.ПустаяСсылка()));
	
	Выборка 	= Запрос.Выполнить().Выбрать();
	
	ВсегоСтрок	= Выборка.Количество();
	Сч			= 0;
	ОшибокЗаписи = 0;
	
	Начало 		= ТекущаяУниверсальнаяДатаВМиллисекундах();
	СовсемНачало= Начало;
	
	ЗаписанныеОбъекты = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		#ЕСЛИ КЛИЕНТ ТОГДА
		ОбработкаПрерыванияПользователя();
		#КОНЕЦЕСЛИ
		
		Если ЗначениеЗаполнено(Выборка.ВерсияДанных) Тогда
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();			
		Иначе			
			ДокОбъект = Менеджер.СоздатьДокумент();		
			ДокОбъект.УстановитьСсылкуНового(Выборка.Ссылка);
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ДокОбъект, Выборка, , "Ссылка");		
		
		Для Каждого КиЗ Из ДанныеТЧ Цикл
			СтрокиТЧ = КиЗ.Значение.НайтиСтроки(Новый Структура("Ссылка", Выборка.Ссылка));		
			
			ТЧ_Объекта = ДокОбъект[КиЗ.Ключ];
			
			ТЧ_Объекта.Очистить();			
			Для Каждого СтрокаТЧ_Ист Из КиЗ.Значение.НайтиСтроки(Новый Структура("Ссылка", Выборка.Ссылка)) Цикл
				СтрокаТЧ_Тек = ТЧ_Объекта.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЧ_Тек, СтрокаТЧ_Ист);			
			КонецЦикла; 
		КонецЦикла;
		
		ДокОбъект.ДополнительныеСвойства.Вставить("ОтключитьЖурнализациюЗаписи", Истина);
		ДокОбъект.ОбменДанными.Загрузка 	= Истина;
		ДокОбъект.ОбменДанными.Отправитель	= Отправитель;
		
		Попытка
			ДокОбъект.Записать();		
			Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;
			
			ИмяТаблицы = ДокОбъект.Метаданные().ПолноеИмя();
			Записано = ЗаписанныеОбъекты[ИмяТаблицы];
			Если Записано = Неопределено Тогда
				Записано = 0;			
			КонецЕсли;                              
			ЗаписанныеОбъекты[ИмяТаблицы] = Записано + 1;
		Исключение
			ТекстОшибки = СтрШаблон("Ошибка записи документа: %1. %2 !", ДокОбъект, ОписаниеОшибки());
			Результат.Ошибки.Добавить(ТекстОшибки);
			
			ОшибокЗаписи = ОшибокЗаписи + 1;
		КонецПопытки;		
		
		Сч = Сч + 1;
		Если Сч % 10 = 0 Тогда
			ТекстСообщения = СтрШаблон("Загрузка " + ВидДокумента + ". Загружено: %1 из %2 документов.", Сч, ВсегоСтрок);
			инт_ДлительныеОперации.СообщитьПрогресс(Формат(100*Сч/ВсегоСтрок, "ЧДЦ=2"), ТекстСообщения);		
		
			Время = (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000;
			ТекстСообщения = СтрШаблон("Записано 10 " + ВидДокумента + ". Время выполнения: %1, скорость записи: %2 док/с.", Время, Формат(10 / Время, "ЧДЦ=0"));			
			ЗаписатьВЛог("Загрузка " + ВидДокумента, ТекстСообщения, "Информация", , , Время);
			
			Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
		КонецЕсли;		
	КонецЦикла;
	
	Результат.Вставить("ПрочитаноОбъектов", Шапка.Количество());
	Результат.Вставить("ОшибокЗаписи", 		ОшибокЗаписи);
	
	Время = (ТекущаяУниверсальнаяДатаВМиллисекундах() - СовсемНачало)/1000;
	ТекстСообщения = СтрШаблон("Окончание загрузки пакета. Прочитано: %1, записано: %2, ошибок записи: %3.",  Результат.ПрочитаноОбъектов, Результат.ОбработаноОбъектов, ОшибокЗаписи);
	ЗаписатьВЛог("Загрузка " + ВидДокумента, ТекстСообщения, "Информация", , , Время);
	
	Результат.Сообщения.Добавить(ТекстСообщения);	
	Для Каждого КиЗ Из ЗаписанныеОбъекты Цикл
		ТекстСообщения = СтрШаблон("Записано: %1 объектов: %2.",  КиЗ.Значение, КиЗ.Ключ);	
		Результат.Сообщения.Добавить();	
	КонецЦикла;
	
	Возврат Результат;	
КонецФункции //Функция ЗагрузитьДанныеПакета(ДанныеПакета, Отправитель, ДопПараметры = Неопределено) Экспорт

Функция ПолучателиПеремещения(ОП_Объект) Экспорт	
	СписокПолучателей	= Новый Массив;            
	
	ПРМ_Ссылка 	= ОП_Объект.ДокументОснование;
	ОбменДанными= ОП_Объект.ОбменДанными;	
	
	Отправитель = ОбменДанными.Отправитель;
	Загрузка	= ОбменДанными.Загрузка;
	
	ИмяПО 	= "ДанныеЧЗ";
	рШапки	= ПолучитьРеквизитыШапки(ПРМ_Ссылка, "Склад,СкладПолучатель,Склад.КодФизическогоУзла,СкладПолучатель.КодФизическогоУзла,Склад.ФизическийСклад,СкладПолучатель.ФизическийСклад");
	
	Склад						= рШапки.Склад;
	СкладПолучатель 			= рШапки.СкладПолучатель;
	
	ФизическийСклад				= рШапки.Склад_ФизическийСклад;
	ФизическийСкладПолучатель	= рШапки.СкладПолучатель_ФизическийСклад;
			
	УзелСклада					= Маркировка_ПИ.УзелПоКоду(рШапки.Склад_КодФизическогоУзла + "cz", ИмяПО);
	УзелСкладаПолучателя		= Маркировка_ПИ.УзелПоКоду(рШапки.СкладПолучатель_КодФизическогоУзла + "cz", ИмяПО);
	
	ТипУзла						= Маркировка_ПИ.ТипТекущегоУзла(ИмяПО);			
	
	Если ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда			
		ОбменДаннымиЧЗ.ДобавитьУзелВПолучателей(СписокПолучателей, УзелСклада, Отправитель, Загрузка);			
		ОбменДаннымиЧЗ.ДобавитьУзелВПолучателей(СписокПолучателей, УзелСкладаПолучателя, Отправитель, Загрузка);
	Иначе
		//Все агрегации по ПРМ будут делаться в ЦО			
	КонецЕсли;			
	
	Возврат ЗаполнениеДокументов.УдалитьПовторяющиесяЭлементыМассива(СписокПолучателей, Истина);
КонецФункции //ПолучателиПеремещения(ПРМ_Объект)


#КонецОбласти

//--Данилова Е.В. 19.02.2025

Функция ПолучитьВложенныеКоды(ШтрихКодыКоробок) Экспорт
	Результат = Новый Массив;
	
	Если ШтрихКодыКоробок = Неопределено ИЛИ ШтрихКодыКоробок.Количество() = 0 Тогда
		Возврат Результат;	
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ШтрихКодКоробки ПОМЕСТИТЬ ВТ_ШтрихКодыКоробок ИЗ &ШтрихКодыКоробок КАК ШтрихКодыКоробок
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныеКоды.Штрихкод КАК ШтрихКод 
	|ПОМЕСТИТЬ ВТ_ВложенныеКоды
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеКоды
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ	
	|	ВТ_ШтрихКодыКоробок
	|ПО
	|	ВТ_ШтрихКодыКоробок.ШтрихКодКоробки = ВложенныеКоды.Ссылка
	|;
	|ВЫБРАТЬ 
	|	ШтрихКод
	|ИЗ
	|	ВТ_ВложенныеКоды
	|;
	|ВЫБРАТЬ 
	|	ШтрихКод
	|ИЗ
	|	ВТ_ВложенныеКоды
	|ГДЕ
	|	ВТ_ВложенныеКоды.ШтрихКод.ТипКода В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.ЛогистическаяУпаковка),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор)
	|	)
	|";
	
	Запрос.УстановитьПараметр("ШтрихКодыКоробок", МассивВТаблицу(ШтрихКодыКоробок, "ШтрихКодКоробки"));
	рЗапроса = Запрос.ВыполнитьПакет();
	
	сШтрихКоды = Новый Соответствие;
	//Штрих коды 1 уровень
	Выборка = рЗапроса[рЗапроса.ВГраница()-1].Выбрать();
	Пока Выборка.Следующий() Цикл
		сШтрихКоды[Выборка.ШтрихКод] = Истина;
	КонецЦикла; 
	
	//Штрих коды коробки
	ШтрихКодыВложенныхКоробок = рЗапроса[рЗапроса.ВГраница()].Выгрузить().ВыгрузитьКолонку("ШтрихКод");
	Если ШтрихКодыВложенныхКоробок.Количество() > 0 Тогда
		СоставВложений = ПолучитьВложенныеКоды(ШтрихКодыВложенныхКоробок);
		Для Каждого ШтрихКод Из СоставВложений Цикл
			сШтрихКоды[ШтрихКод] = Истина;					
		КонецЦикла; 
	КонецЕсли;
	
	Для Каждого КиЗ Из сШтрихКоды Цикл
		Результат.Добавить(КиЗ.Ключ);	
	КонецЦикла; 
	
	Возврат Результат;
КонецФункции //ПолучитьВложенныеКоды(ШтрихКодыКоробок)

Функция МассивВТаблицу(МассивЗначений, ИмяКолонки)
	ТЗ = Новый ТаблицаЗначений;
	Если МассивЗначений.Количество() > 0 Тогда
		МТ = Новый Массив;
		МТ.Добавить(ТипЗнч(МассивЗначений[0]));
		ТипКолонки = Новый ОписаниеТипов(МТ);
	Иначе
		ТипКолонки = Неопределено;	
	КонецЕсли;
	ТЗ.Колонки.Добавить(ИмяКолонки, ТипКолонки);
	
	Для Каждого ТекЗнач Из МассивЗначений Цикл
		Если ЗначениеЗаполнено(ТекЗнач) Тогда
			СтрокаТК = ТЗ.Добавить();	
			СтрокаТК[ИмяКолонки] = ТекЗнач;		
		КонецЕсли;	
	КонецЦикла; 
	
	Возврат ТЗ;
КонецФункции //МассивВТаблицу(МассивЗначений, ИмяКолонки)

//--Данилова Е.В. 03.02.2025
//++Данилова Е.В. 19.02.2025
Функция ПроверитьДокументАТКНаНаличиеГотовыхНаборов(Знач ДокументМаркировки, Знач ВидОперации)

	Если ВидОперации = Перечисления.ВидыОперацийМаркировки.АТК Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МаркировкаТоваровИСМП.Номенклатура КАК Номенклатура
		|ИЗ
		|	Документ.МаркировкаТоваровИСМП.Товары КАК МаркировкаТоваровИСМП
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправ
		|		ПО МаркировкаТоваровИСМП.Номенклатура = НоменклатураСправ.Ссылка
		|			И (НоменклатураСправ.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
		|		ПО (НоменклатураКоплектующие.Номенклатура = МаркировкаТоваровИСМП.Номенклатура)
		|			И (НоменклатураКоплектующие.Ссылка.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект))
		|ГДЕ
		|	МаркировкаТоваровИСМП.Ссылка = &ДокументМаркировки  
		//Данилова Е.В. 25.06.2025 MARK-2484
		//|	И (НЕ НоменклатураСправ.Ссылка ЕСТЬ NULL ИЛИ
		|			 И (НЕ НоменклатураКоплектующие.Ссылка ЕСТЬ NULL)";
		
		Запрос.УстановитьПараметр("ДокументМаркировки", ДокументМаркировки);
		
		РезультатЗапроса = Запрос.Выполнить(); 
		
		Если РезультатЗапроса.Пустой()  Тогда
		
			Возврат Неопределено;
		Иначе 
			
			МассивТоваровОшибка = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Номенклатура");
			
			Возврат СтрСоединить(МассивТоваровОшибка,";"); 
		
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат неопределено; 

КонецФункции // ПроверитьДокументАТКПоГотовымНаборам()
//++Данилова Е.В. 18.08.2025 MARK-1756 
Функция РезультатПроверкиОбработкиРасформированияНабораГНпоЗСБ(Знач ДокументМаркировки)  экспорт 
    Результат = МаркировкаКС.СтруктураРезультата();
	
	Если ТипЗнч(ДокументМаркировки.ДокументОснование) = Тип("ДокументСсылка.ЗаданиеНаСборкуКомплектовЧЗ")
		И ДокументМаркировки.ВидОперации = перечисления.ВидыОперацийМаркировки.ФормированиеНабора Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаркировкаТоваровИСМП.Ссылка КАК Ссылка,
		|	МаркировкаТоваровИСМП.Статус КАК Статус
		|ИЗ
		|	Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
		|ГДЕ
		|	МаркировкаТоваровИСМП.ДокументОснование = &ДокументОснование
		|	И МаркировкаТоваровИСМП.ВидОперации = &ВидОперации
		|	И МаркировкаТоваровИСМП.Проведен";
		
		Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийМаркировки.РасформированиеУпаковки);
		Запрос.УстановитьПараметр("ДокументОснование", ДокументМаркировки.ДокументОснование);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
		
			Возврат Результат;	
		Иначе 
			Выборка = РезультатЗапроса.Выбрать(); 
			Выборка.Следующий(); 
			
			Результат.Успешно = Выборка.Статус = Перечисления.СтатусыДокументовМаркировки.Обработан ИЛИ  Выборка.Статус = Перечисления.СтатусыДокументовМаркировки.ОбработанЧЗ; 
			Возврат Результат; 
		КонецЕсли;
		
	Иначе 
		Возврат Результат; 
	КонецЕсли;

КонецФункции // ПроверкаОбработкиРасформированияНабораГНпоЗСБ()

//--Данилова Е.В. 18.08.2025

#Область ПакетнаяАгрегация

// Кухарь А.Ю.  02.04.2025 начало
Функция ПолучитьРанееЗабронированныйКодАгрегацииДляЛиста(Знач ЛистНабора,Знач Накладная, Знач ТипШК) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);		
	ОперАгрегации = Документы.МаркировкаТоваровИСМП.ПолучитьСоздатьДокАгрегации(Накладная, ТипШК);		
	рДобавления = ДобавитьЛистВПакетнуюАгрегацию(ОперАгрегации, ЛистНабора);
	Если рДобавления.Успешно Тогда
		Результат.Успешно 	= Истина;						
		Результат.Данные 	= рДобавления.Данные;
	Иначе						
		МаркировкаКС.ДобавитьОшибки(Результат, рДобавления);
	КонецЕсли;		
	

	Возврат Результат;
КонецФункции 


Функция ДобавитьЛистВПакетнуюАгрегацию(ДокМаркировки, ЛистНабора) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	ДокОбъект = ДокМаркировки.ПолучитьОбъект();
	
	Если ДокОбъект.Статус <> Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки
		и ДокОбъект.Статус <> Перечисления.СтатусыДокументовМаркировки.ВРаботе тогда
		ТекстОшибки = СтрШаблон("Недопустимый статус у документа агрегации: '%1' ! %2", ДокОбъект, ДокОбъект.Статус);
		Результат.Ошибки.Добавить(ТекстОшибки);					
	КонецЕсли; 
	
	Попытка
		ДокОбъект.Заблокировать();
	Исключение
		ТекстОшибки = СтрШаблон("Не удалось заблокировать документ агрегации: '%1' ! %2", ДокОбъект, ОписаниеОшибки());
		Результат.Ошибки.Добавить(ТекстОшибки);	
		// Кухарь А.Ю.  22.07.2025 начало
		возврат Результат; 
		// Кухарь А.Ю.  22.07.2025 конец
		
	КонецПопытки;
	
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	             |	ТЧ.НомерСтроки КАК НомерСтроки,
	             |	ТЧ.ДокументОснование КАК ДокументОснование
	             |ПОМЕСТИТЬ ВТ
	             |ИЗ
	             |	&ШтрихкодыКоробок КАК ТЧ
	             |ГДЕ
	             |	ТЧ.ДокументОснование = НЕОПРЕДЕЛЕНО
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ДокументОснование УБЫВ
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ВТ.НомерСтроки КАК НомерСтроки
	             |ИЗ
	             |	ВТ КАК ВТ";
	запрос.УстановитьПараметр("ШтрихкодыКоробок",ДокОбъект.ШтрихкодыКоробок.выгрузить());
	ТЗКоробов=запрос.Выполнить().Выгрузить();
	
	СтрокаНашласть=ложь;
	Для каждого СтрокаТЗ из ТЗКоробов цикл
		СтрокаТЧ=ДокОбъект.ШтрихкодыКоробок.получить(СтрокаТЗ.НомерСтроки-1);
		СтрокаТЧ.ДокументОснование=ЛистНабора;
		Результат.Данные.Добавить(СтрокаТЧ.ШтрихкодКоробки);	
		СтрокаНашласть=Истина;
	КонецЦикла;
	
	если не СтрокаНашласть тогда
		ТекстОшибки = СтрШаблон("Закончились предварительно зарезервированные коды в %1", ДокОбъект);
		Результат.Ошибки.Добавить(ТекстОшибки);	
	КонецЕсли;
	
	если Результат.Ошибки.Количество()=0 тогда
		Попытка
			// Кухарь А.Ю.  22.07.2025 начало
			ДокОбъект.ОбменДанными.Загрузка = Истина; 
			ДокОбъект.ДополнительныеСвойства.Вставить("ОтключитьЖурнализациюЗаписи",Истина);
			// Кухарь А.Ю.  22.07.2025 конец
			
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			ДокОбъект.Разблокировать();
			Результат.Успешно 	= Истина;					
		Исключение
			ТекстОшибки = СтрШаблон("Не удалось провести документ агрегации: '%1' ! %2", ДокОбъект, ОписаниеОшибки());
			Результат.Ошибки.Добавить(ТекстОшибки);					
		КонецПопытки;
	КонецЕсли;
	
	
	Возврат Результат;
КонецФункции //ДобавитьКодАгрегацииИзЛН(ДокументОснование) Экспорт

// Кухарь А.Ю.  02.04.2025 конец
//Данилова Е.В. 02.09.2025  HELP-6414  Добавлен параметр
Функция ПолучитьТаблицуРанееЗабронированныхКодовАгрегацииДляМассиваЛистов(Знач МассивЛистов,Знач Накладная, Знач ТипШК, Знач КоличествоКодовБронь = 0) Экспорт
	Результат = новый Структура ("Успех,Ошибки,Данные",ложь,новый Массив,Неопределено);	               		
	ОперАгрегации = Документы.МаркировкаТоваровИСМП.ПолучитьСоздатьДокАгрегации(Накладная, ТипШК);
	//Данилова Е.В. 02.09.2025  HELP-6414  Добавлен параметр
	рДобавления = ДобавитьМассивЛистовВПакетнуюАгрегацию(ОперАгрегации, МассивЛистов,КоличествоКодовБронь);
	Если рДобавления.Успех Тогда
		Результат.Успех 	= Истина;						
		Результат.Данные 	= рДобавления.Данные;
	Иначе						
		МаркировкаКС.ДобавитьОшибки(Результат, рДобавления);
	КонецЕсли;		
	

	Возврат Результат;
КонецФункции 
//Данилова Е.В. 02.09.2025  HELP-6414  Добавлен параметр
Функция ДобавитьМассивЛистовВПакетнуюАгрегацию(ДокМаркировки, МассивЛистов,КоличествоКодовБронь =0) Экспорт
	ТаблицаДанных	 = новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Лист",					новый ОписаниеТипов("ДокументСсылка.ЛистПереукладки"));  
	ТаблицаДанных.Колонки.Добавить("КодАгрегации",			Новый ОписаниеТипов("СправочникСсылка.ШтрихкодыУпаковокТоваров"));  
	
	
	Результат		 = новый Структура("Успех,Ошибки,Данные",ложь,новый Массив,ТаблицаДанных);
	если МассивЛистов.Количество() = 0 тогда 
		Результат.Успех = истина;
		возврат Результат;
	КонецЕсли;            
	
	
	ДокОбъект		 = ДокМаркировки.ПолучитьОбъект();
	КоличествоЛистов = МассивЛистов.Количество();       
	
	
	
	Если ДокОбъект.Статус <> Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки
		и ДокОбъект.Статус <> Перечисления.СтатусыДокументовМаркировки.ВРаботе тогда
		ТекстОшибки = СтрШаблон("Недопустимый статус у документа агрегации: '%1' ! %2", ДокОбъект, ДокОбъект.Статус);
		Результат.Ошибки.Добавить(ТекстОшибки);					
	КонецЕсли; 
	
	Попытка
		ДокОбъект.Заблокировать();
	Исключение
		ТекстОшибки = СтрШаблон("Не удалось заблокировать документ агрегации: '%1' ! %2", ДокОбъект, ОписаниеОшибки());
		Результат.Ошибки.Добавить(ТекстОшибки);	
		// Кухарь А.Ю.  22.07.2025 начало
		возврат Результат; 
		// Кухарь А.Ю.  22.07.2025 конец

	КонецПопытки;
	
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	             |	ТЧ.НомерСтроки КАК НомерСтроки,
	             |	ТЧ.ШтрихкодКоробки КАК ШтрихкодКоробки,
	             |	ТЧ.ДокументОснование КАК ДокументОснование
	             |ПОМЕСТИТЬ ВТ
	             |ИЗ
	             |	&ШтрихкодыКоробок КАК ТЧ
	             |ГДЕ
	             |	(ТЧ.ДокументОснование = НЕОПРЕДЕЛЕНО
	             |			ИЛИ ТЧ.ДокументОснование В (&МассивЛистов))
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ВТ.НомерСтроки КАК НомерСтроки,
	             |	ВТ.ДокументОснование КАК ДокументОснование,
	             |	ВТ.ШтрихкодКоробки КАК ШтрихкодКоробки
	             |ИЗ
	             |	ВТ КАК ВТ
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ДокументОснование,
	             |	НомерСтроки";
	запрос.УстановитьПараметр("ШтрихкодыКоробок",ДокОбъект.ШтрихкодыКоробок.выгрузить());  
	запрос.УстановитьПараметр("МассивЛистов",МассивЛистов);  
	//++Данилова Е.В. 02.09.2025  HELP-6414 
	Если КоличествоКодовБронь > 0 Тогда
		
		запрос.Текст = СтрЗаменить(запрос.Текст,"ПЕРВЫЕ 1","ПЕРВЫЕ "+КоличествоКодовБронь);
	Иначе 
		запрос.Текст = СтрЗаменить(запрос.Текст,"ПЕРВЫЕ 1","ПЕРВЫЕ "+КоличествоЛистов);
		
	КонецЕсли;
	//запрос.Текст = СтрЗаменить(запрос.Текст,"ПЕРВЫЕ 1","ПЕРВЫЕ "+КоличествоЛистов);
	//--Данилова Е.В. 02.09.2025
	ТЗКоробов				 = запрос.Выполнить().Выгрузить();                                      
	КоличествоСвободныхКодов = ТЗКоробов.Количество();
	//++Данилова Е.В. 02.09.2025  HELP-6414
	Если КоличествоКодовБронь > 0  Тогда
		//++Данилова Е.В. 07.11.2025 без задачи 
		КоличествоКодовБлочковНаЛист = КоличествоКодовБронь/КоличествоЛистов;
		//--Данилова Е.В. 07.11.2025
		если КоличествоСвободныхКодов<>КоличествоКодовБронь тогда
			ТекстОшибки = СтрШаблон("Недостаточно свободных кодов %1, нужно %2. Предварительно забронируйте недостающее количество.", КоличествоСвободныхКодов,КоличествоКодовБронь);
			Результат.Ошибки.Добавить(ТекстОшибки);			
		КонецЕсли; 	
		
	ИначеЕсли КоличествоСвободныхКодов<>КоличествоЛистов тогда
		ТекстОшибки = СтрШаблон("Недостаточно свободных кодов на короба %1, нужно %2. Предварительно забронируйте недостающее количество.", КоличествоСвободныхКодов,КоличествоЛистов);
		Результат.Ошибки.Добавить(ТекстОшибки);			
	КонецЕсли;
	//если КоличествоСвободныхКодов<>КоличествоЛистов тогда
	//	ТекстОшибки = СтрШаблон("Недостаточно свободных кодов на короба %1, нужно %2. Предварительно забронируйте недостающее количество.", КоличествоСвободныхКодов,КоличествоЛистов);
	//	Результат.Ошибки.Добавить(ТекстОшибки);			
	//КонецЕсли;             
	//--Данилова Е.В. 02.09.2025
	если Результат.Ошибки.Количество() > 0 тогда  
		Возврат Результат;
	КонецЕсли;
	
	
	Сч=1;        
	Для каждого ТекущийЛист из МассивЛистов цикл
		//++Данилова Е.В. 07.11.2025 без задачи
		
		Если КоличествоКодовБронь > 0
			И ДокОбъект.ТипШК = перечисления.ТипыШтрихКодов.Блочок Тогда 			 
			
			ОтборПоЛП = Новый Структура("ДокументОснование",ТекущийЛист); 
			СтрокиКоробов = ТЗКоробов.НайтиСтроки(ОтборПоЛП);
			КолКМ = 0; 
			Для каждого СтрокаКоробов Из СтрокиКоробов Цикл 
				Если КолКМ =  КоличествоКодовБлочковНаЛист Тогда
				
					Прервать; 	
				
				КонецЕсли;
				СтрокаДанных				= ТаблицаДанных.Добавить(); // пишем в таблицу которую вернём
				СтрокаДанных.Лист			= ТекущийЛист;        
				СтрокаДанных.КодАгрегации	= СтрокаКоробов.ШтрихкодКоробки;
				КолКМ = КолКМ + 1; 				
			КонецЦикла;
			
			Если КолКМ < КоличествоКодовБлочковНаЛист  Тогда
				
				ОтборПоЛП = Новый Структура("ДокументОснование",неопределено);
				СтрокиКоробов = ТЗКоробов.НайтиСтроки(ОтборПоЛП);
				Если СтрокиКоробов.Количество() = 0 Тогда
					
					ТекстОшибки = "Ошибка распределения кодов агрегации. Не найден свободный код агрегации";
					Результат.Ошибки.Добавить(ТекстОшибки);	
					Прервать;	
				Иначе 
					Для каждого СтрокаКоробов Из СтрокиКоробов Цикл 			
						Если КолКМ =  КоличествоКодовБлочковНаЛист Тогда
							
							Прервать; 	
							
						КонецЕсли;
						СтрокаДанных				= ТаблицаДанных.Добавить(); // пишем в таблицу которую вернём
						СтрокаДанных.Лист			= ТекущийЛист;        
						СтрокаДанных.КодАгрегации	= СтрокаКоробов.ШтрихкодКоробки;
						
						ОтборВОМ = Новый Структура("ШтрихкодКоробки",СтрокаКоробов.ШтрихкодКоробки); 
						СтрокиВДокументеОМ = ДокОбъект.ШтрихкодыКоробок.НайтиСтроки(ОтборВОМ);
						Если СтрокиВДокументеОМ.Количество() > 0  Тогда
							
							СтрокиВДокументеОМ[0].ДокументОснование = ТекущийЛист; 	
							
						КонецЕсли;
						//++Данилова Е.В. 21.11.2025 Ошибка 
						СтрокаКоробов.ДокументОснование = ТекущийЛист; 
						// 
						
						КолКМ = КолКМ + 1; 				
					КонецЦикла;
	
				КонецЕсли;
			
			КонецЕсли;
			
			Продолжить; 
		КонецЕсли;
		//--Данилова Е.В. 07.11.2025
		СтрокаСуществующейАгрегации = ТЗКоробов.Найти(ТекущийЛист,"ДокументОснование");
		если СтрокаСуществующейАгрегации <> Неопределено тогда  //Это когда ранее этим листом что-то забронировалось, но сам лист не был записан. Возьмём этот же код.			
			СтрокаДанных										= ТаблицаДанных.Добавить(); // пишем в таблицу которую вернём
			СтрокаДанных.Лист									= ТекущийЛист;        
			СтрокаДанных.КодАгрегации							= СтрокаСуществующейАгрегации.ШтрихкодКоробки;
			Продолжить;
		КонецЕсли;   
		СтрокаТЗВыборки											= ТЗКоробов.получить(Сч-1);	
		СтрокаТЧ												= ДокОбъект.ШтрихкодыКоробок.получить(СтрокаТЗВыборки.НомерСтроки-1);   //Пишем в эту строку документа агрегации
		если СтрокаТЧ.ДокументОснование	= Неопределено тогда
			СтрокаТЧ.ДокументОснование							= ТекущийЛист;
			СтрокаТаблицыДанных		 							= ТаблицаДанных.Добавить();
			СтрокаТаблицыДанных.Лист							= ТекущийЛист; 
			СтрокаТаблицыДанных.КодАгрегации					= СтрокаТЧ.ШтрихкодКоробки;           // пишем в таблицу которую вернём
		иначе
			ТекстОшибки = "Ошибка распределения кодов агрегации. Не найден свободный код агрегации";
			Результат.Ошибки.Добавить(ТекстОшибки);	
			Прервать;
		КонецЕсли;  	
		сч = сч+1; 
	КонецЦикла;  			
	
	если Результат.Ошибки.Количество()=0 тогда
		Попытка   
			если ДокОбъект.модифицированность() тогда	
				// Кухарь А.Ю.  22.07.2025 начало
				ДокОбъект.ОбменДанными.Загрузка = Истина; 
				ДокОбъект.ДополнительныеСвойства.Вставить("ОтключитьЖурнализациюЗаписи",Истина);
				// Кухарь А.Ю.  22.07.2025 конец

				ДокОбъект.Записать(РежимЗаписиДокумента.Запись);   
			КонецЕсли;
			ДокОбъект.Разблокировать();    
			
			Результат.Успех 	= Истина;					
		Исключение
			ТекстОшибки = СтрШаблон("Не удалось провести документ агрегации: '%1' ! %2", ДокОбъект, ОписаниеОшибки());
			Результат.Ошибки.Добавить(ТекстОшибки);					
		КонецПопытки;
	КонецЕсли;
	
	
	Возврат Результат;
КонецФункции //ДобавитьКодАгрегацииИзЛН(ДокументОснование) Экспорт

Функция УбратьМассивЛистовИзПакетнойАгрегации(ДокМаркировки, МассивЛистов) Экспорт  
	
	КоличествоЛистов = МассивЛистов.Количество(); 	
	Результат		 = новый Структура("Успех,Ошибки",ложь,новый Массив);
	если КоличествоЛистов = 0 тогда 
		Результат.Успех = истина;
		возврат Результат;
	КонецЕсли;            
	
	
	ДокОбъект		 = ДокМаркировки.ПолучитьОбъект();
      
	
	Если ДокОбъект.Статус <> Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки
		и ДокОбъект.Статус <> Перечисления.СтатусыДокументовМаркировки.ВРаботе тогда
		ТекстОшибки = СтрШаблон("Недопустимый статус у документа агрегации: '%1' ! %2", ДокОбъект, ДокОбъект.Статус);
		Результат.Ошибки.Добавить(ТекстОшибки);					
	КонецЕсли;  
	
	если Результат.Ошибки.Количество()>0 тогда
		возврат Результат;
	КонецЕсли;
	
	Попытка
		ДокОбъект.Заблокировать();
	Исключение
		ТекстОшибки = СтрШаблон("Не удалось заблокировать документ агрегации: '%1' ! %2", ДокОбъект, ОписаниеОшибки());
		Результат.Ошибки.Добавить(ТекстОшибки);	
	КонецПопытки;

	если Результат.Ошибки.Количество()>0 тогда
		возврат Результат;
	КонецЕсли;
	
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ 
	|	ТЧ.НомерСтроки КАК НомерСтроки,
	|	ТЧ.ШтрихкодКоробки КАК ШтрихкодКоробки,
	|	ТЧ.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ШтрихкодыКоробок КАК ТЧ
	|ГДЕ
	|ТЧ.ДокументОснование В (&МассивЛистов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ВТ КАК ВТ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументОснование,
	|	НомерСтроки"; 
	запрос.УстановитьПараметр("МассивЛистов",МассивЛистов); 
	запрос.УстановитьПараметр("ШтрихкодыКоробок",ДокОбъект.ШтрихкодыКоробок.выгрузить());  

	Выборка				 = запрос.Выполнить().выбрать();                                           
	пока выборка.Следующий() цикл
		СтрокаТЧ	= ДокОбъект.ШтрихкодыКоробок.получить(выборка.НомерСтроки-1);  
		СтрокаТЧ.ДокументОснование = Неопределено;
	КонецЦикла;  			
	
	Попытка   
		если ДокОбъект.модифицированность() тогда			
			// Кухарь А.Ю.  22.07.2025 начало
			ДокОбъект.ОбменДанными.Загрузка = Истина; 
			// Кухарь А.Ю.  22.07.2025 конец

			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);   
		КонецЕсли;
		ДокОбъект.Разблокировать();    
		
		Результат.Успех 	= Истина;					
	Исключение
		ТекстОшибки = СтрШаблон("Не удалось провести документ агрегации: '%1' ! %2", ДокОбъект, ОписаниеОшибки());
		Результат.Ошибки.Добавить(ТекстОшибки);					
	КонецПопытки;

Возврат Результат;

КонецФункции
#КонецОбласти





