#Область ОписаниеПеременных
//++Данилова Е.В. 25.05.2026 MARK-3615 
Перем ЕстьИзменения;  
//--Данилова Е.В. 25.05.2026 
#КонецОбласти

#Область СобытияОбъекта


Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если ЗначениеЗаполнено(Организация) Тогда
		Префикс = СокрЛП(Организация.Префикс);	
	КонецЕсли; 
	Префикс = Префикс+Маркировка_ПИ.ЭтотУзел_Код("Основной")+"-";
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)	
	ЗаполнитьШапкуДокумента(ЭтотОбъект, ПараметрыСеанса.Пользователь, ОбщегоНазначения_ПИ.ВалютаНац());
	
	Статус				= Перечисления.СтатусыДокументовМаркировки.ВРаботе;	 
	//Валетов + 21,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3522
	//СпособВводаВОборот 	= Перечисления.СпособыВводаВОборотСУЗ.МаркировкаОстатков; 
	СпособВводаВОборот 	= Перечисления.СпособыВводаВОборотСУЗ.Перемаркировка;
	//Валетов-
	ТипУпаковки 		= Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
	ТипШК				= Перечисления.ТипыШтрихКодов.Коробка;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ДокументОснование	= МаркировкаКС.ПолучитьЗначениеПараметра(ДанныеЗаполнения, "ДокументОснование");
		ДопПараметры		= ДанныеЗаполнения;
	Иначе		
		ДокументОснование	= ДанныеЗаполнения;
		ДопПараметры		= Неопределено;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда Возврат КонецЕсли;
	ТипОснования 		= ТипЗнч(ДокументОснование);
	
	ЗаполнятьТолькоШапку = МаркировкаКС.ПолучитьЗначениеПараметра(ДополнительныеСвойства, "ЗаполнятьТолькоШапку", Ложь);
	
	СтрокаРеквизитов = "Дата,Комментарий";
	Если ТипОснования	= Тип("ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ") Тогда
		СтрокаРеквизитов = СтрокаРеквизитов+",ПодразделениеНанесения,СпособВводаВОборот";
		//++Данилова Е.В. 26.05.2026  MARK-3615 
		ДокПеремаркировки = Документы.Перемаркировка.ОтработкаПоПеремаркировке(ДокументОснование);
		Если ДокПеремаркировки <> Неопределено Тогда
		
			СтрокаРеквизитов = СтрокаРеквизитов+",СпособВводаВОборот";	
		
		КонецЕсли; 
			
		//--Данилова Е.В. 26.05.2026 
	КонецЕсли;
	Если ЕстьРеквизитДокумента("Организация", ДокументОснование.Метаданные()) Тогда
		СтрокаРеквизитов = СтрокаРеквизитов+",Организация";	
	КонецЕсли;	
	РеквизитыОснования 	= ПолучитьРеквизитыШапки(ДокументОснование, СтрокаРеквизитов);
	
	Если ТипОснования = Тип("ДокументСсылка.ЛистНабора") Тогда
		РеквизитыОснования.Вставить("Организация", ПолучитьРеквизитШапки(ДокументОснование, "ДокОснование.Организация"));				
	КонецЕсли;
	
	Организация 		= РеквизитыОснования.Организация;	
	
	Если ТипОснования = Тип("ДокументСсылка.КонтрактСПроизводителем") Тогда
		Если ЗаполнятьТолькоШапку Тогда
		Иначе
			ЗаполнитьТоварыПо_ЗПС(ДанныеЗаполнения);
		КонецЕсли;
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Если ЗаполнятьТолькоШапку Тогда
		Иначе
			ЗаполнитьТоварыПо_ЗПС(ДанныеЗаполнения);
		КонецЕсли;		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЛистНабора") Тогда
		
		ЗаполнитьПоЛистуНабора(ДокументОснование);
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.Машина") Тогда
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.Перемещение") Тогда
		
		ЗаполнитьПоПРМ(ДокументОснование);
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаданиеНаСборкуКомплектовЧЗ") Тогда		
		//Данилова Е.В. 18.08.2025 MARK-1756 
		Если ЗаполнятьТолькоШапку Тогда 
		Иначе
			ЗаполнитьПоЗСБ(ДокументОснование);	
		КонецЕсли; 
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаданиеНаМаркировку") Тогда
		
		ЗаполнитьПоЗНМ(ДокументОснование, ДопПараметры);
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ") Тогда
		
		ВидОперации		= Перечисления.ВидыОперацийМаркировки.ВводВОборот;
		
		Если РеквизитыОснования.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.МаркировкаОстатков Тогда			
			ВидОперацииИСМП	= Перечисления.ВидыОперацийИСМП.ВводВОборот_МаркировкаОстатков;                      
			
			Дата = ДокументОснование.Дата;   
		//Валетов + 21,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3522
		ИначеЕсли РеквизитыОснования.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Перемаркировка тогда
		    ВидОперации		= Перечисления.ВидыОперацийМаркировки.Перемаркировка;
			ВидОперацииИСМП	= Перечисления.ВидыОперацийИСМП.Перемаркировка_ИспорченоЛибоУтеряно;                      
			Дата = ДокументОснование.Дата;
		//Валетов-
		Иначе                                                                              
			ВидОперацииИСМП	= Перечисления.ВидыОперацийИСМП.ВводВОборот_Импорт;
			Дата = ТекущаяДата();			
		КонецЕсли;
		
		ПодразделениеНанесения = РеквизитыОснования.ПодразделениеНанесения;
		Комментарий = РеквизитыОснования.Комментарий;
		
		ЗаполнитьШКпоЗаказуНаЭмиссию(ДокументОснование);		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		Комментарий = РеквизитыОснования.Комментарий;
		
		Если НЕ ЗаполнятьТолькоШапку Тогда		
			ЗаполнитьТоварыПоНакладной(ДокументОснование);
		КонецЕсли;		
		ЗаполнитьПоПНК(ДокументОснование);
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		Комментарий = РеквизитыОснования.Комментарий;
		
		ЗаполнитьПоРНК(ДокументОснование);
		
		Если НЕ ЗаполнятьТолькоШапку Тогда		
			ЗаполнитьТоварыПоНакладной(ДокументОснование);
			ЗаполнитьШКпоЛН(ДокументОснование);
		КонецЕсли;
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.РекламационнаяНакладная") Тогда
		Комментарий = РеквизитыОснования.Комментарий;
		
		ЗаполнитьПоРКМ(ДокументОснование);
		
		Если НЕ ЗаполнятьТолькоШапку Тогда		
			ЗаполнитьТоварыПоНакладной(ДокументОснование);
			ЗаполнитьШКпоХКМ(ДокументОснование);
		КонецЕсли;	
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.СписаниеТМЦ") Тогда
		НаименованиеПервичногоДокумента = "СПН";
		Комментарий = РеквизитыОснования.Комментарий;
		
		ЗаполнитьТоварыПоНакладной(ДокументОснование);
		ЗаполнитьПоСПН(ДокументОснование);		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.МаркировкаТоваровИСМП") Тогда		
		рШапки = ПолучитьРеквизитыШапки(ДокументОснование, "ВидОперации");
		Если рШапки.ВидОперации = Перечисления.ВидыОперацийМаркировки.Агрегация Тогда
			ВидОперации = Перечисления.ВидыОперацийМаркировки.ТрансформацияУпаковки;
		ИначеЕсли рШапки.ВидОперации = Перечисления.ВидыОперацийМаркировки.АТК Тогда
			ВидОперации = Перечисления.ВидыОперацийМаркировки.ТрансформацияАТК;
			АТК			= ПолучитьРеквизитШапки(ДокументОснование, "АТК");
		Иначе			
			ДокументОснование = Неопределено;
			Сообщить("В качестве основания можно использовать только документы с видом операции 'Агрегация' или 'АТК' !", СтатусСообщения.Важное);
		КонецЕсли;
	КонецЕсли;
	
	Дата = ТекущаяДата();
	
	ЗаписатьДокОснованиеВТЧ();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
	
	рПроверки = лМожноЗаписатьДокумент();
	Если Не рПроверки.Успешно Тогда
		ТекстОшибки = СтрСоединить(рПроверки.Ошибки, Символы.ПС);
		ЗаписатьВЛог("ОбменДанными", ТекстОшибки, "Ошибка");
		Отказ = Истина;                         
		ВызватьИсключение ТекстОшибки;
		Возврат;
	КонецЕсли;
	
	ЕстьИзменения	= Модифицированность();
	
	Если ЭтоНовый() Тогда
		БылСтатус = ПолучитьРеквизитШапки(Ссылка, "Статус");
	Иначе		
		БылСтатус = ПолучитьРеквизитШапки(Ссылка, "Статус");
		Если ЗначениеЗаполнено(БылСтатус) И БылСтатус = Перечисления.СтатусыДокументовМаркировки.Обработан И ЕстьИзменения Тогда
			Если НЕ РольДоступна("Администратор") Тогда			
				Отказ = Истина;
				ТекстСообщения = СтрШаблон("Документ %1 уже обработан, изменения документа запрещены !", Ссылка);
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;	
	ДополнительныеСвойства.Вставить("БылСтатус", БылСтатус);
	
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
	
	Если ЭтоНовый() ИЛИ НЕ ЗначениеЗаполнено(КодУзлаСоздания) Тогда
		КодУзлаСоздания = Маркировка_ПИ.ЭтотУзел_Код();		
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов Тогда
		Если Маркировка_ПИ.ТипТекущегоУзла() <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			ВызватьИсключение "Бронирование кодов маркировки разрешено только в ЦО !";	
		КонецЕсли;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийМаркировки.ВводВОборот Тогда
		Если ЗначениеЗаполнено(ТипШК) Тогда
			ТипШК = Неопределено;		
		КонецЕсли;
		//++Данилова Е.В. 19.02.2025 MARK-1454
		Если Статус = Перечисления.СтатусыДокументовМаркировки.ВРаботе 
			И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
			СтруктураДанныхПоТоварам = ПроверитьГотовыеКомплектыВДокументе(Товары.Выгрузить()); 
			Если СтруктураДанныхПоТоварам.ГотовыеКомплекты  
				И СтруктураДанныхПоТоварам.НеГотовыеКомплекты Тогда  			  
				
				ВызватьИсключение "Необходимо выделить готовые наборы в отдельный документ"; 
				
			КонецЕсли;
		КонецЕсли; 
		//--Данилова Е.В. 19.02.2025
	//++Данилова Е.В. 11.06.2026 №0000001162
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийМаркировки.ВыводИзОборота И РежимЗаписи
		= РежимЗаписиДокумента.Проведение Тогда
		Если ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ДистанционнаяПродажа Или ВидОперацииИСМП
			= Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ПродажаПоОбразцам Или ВидОперацииИСМП
			= Перечисления.ВидыОперацийИСМП.ВыводИзОборота_РозничнаяПродажа Тогда
			КПППодразделения  = ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(ПодразделениеНанесения,"КПП");
			ИдентификаторФИАС = ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(ПодразделениеНанесения,"ИдентификаторФИАС"); 
			ТекстОшибки = ""; 
			Если Не ЗначениеЗаполнено(КПППодразделения) Тогда
				ТекстОшибки = СтрШаблон(
					"Поле КПП у подразделения нанесения %1 не заполнено. Провести документ невозможно.",
					ПодразделениеНанесения) + Символы.ПС;
			КонецЕсли;

			Если Не ЗначениеЗаполнено(ИдентификаторФИАС) Тогда
				ТекстОшибки = ТекстОшибки + СтрШаблон(
					"Поле Идентификатор ФИАС у подразделения нанесения %1 не заполнено. Провести документ невозможно.",
					ПодразделениеНанесения) + Символы.ПС;
			КонецЕсли;
			 
		    Если ЗначениеЗаполнено(ТекстОшибки) Тогда 
		    	Отказ = Истина;
		    	Сообщить(ТекстОшибки);
				Возврат; 
		    КонецЕсли;		   
		КонецЕсли;
		//--Данилова Е.В. 11.06.2026 
	КонецЕсли; 
		
	НужноВыгружать	= НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления)
		И (
			Статус = Перечисления.СтатусыДокументовМаркировки.Обработан
			ИЛИ Статус = Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки
		);
	
	ДополнительныеСвойства.Вставить("НужноВыгружать", НужноВыгружать);
	
	Если ЕстьИзменения Тогда		
		ЗаполнитьТоварыПоКМ();
		
		ГруппыТоваров		= ГруппыТоваровДокумента(ЭтотОбъект);
		
		КоличествоДокумента = Товары.Итог("Количество");	
		Если ШтрихкодыУпаковок.Количество() > 0 Тогда
			КоличествоКодовSSCC	= ПолучитьКоличествоУникальныхКодовВКолонке("КодАгрегации");		
		КонецЕсли;
	КонецЕсли;        
	
	Если НужноВыгружать Тогда
		Документы.МаркировкаТоваровИСМП.УстановитьПолучателейИзменений(ЭтотОбъект);		
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
	
	ИмяПланаОбмена = "Основной";
	
	Если ВидОперации = Перечисления.ВидыОперацийМаркировки.ФормированиеНабора Тогда	
		ПроверитьОбновитьСтатусЗаданияНаСборку();
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийМаркировки.Агрегация Тогда
		Документы.МаркировкаТоваровИСМП.ЗарегистрироватьИспользованныеКоробки(Ссылка);
		
		Если КодУзлаСоздания = Маркировка_ПИ.ЭтотУзел_Код(ИмяПланаОбмена)
			И (ОбработанВпервые() ИЛИ СтатусВпервые(Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки)) Тогда
			УстановитьПолучателейКоробок();
		КонецЕсли; 	 
	Иначе
		Документы.МаркировкаТоваровИСМП.ОчиститьИспользованныеКоробки(Ссылка);		
	КонецЕсли; 	
	
	Если ВидОперации = Перечисления.ВидыОперацийМаркировки.ВводВОборот Тогда
		Если Маркировка_ПИ.ТипТекущегоУзла() = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			ОбновитьСтатусЗаказНаЭмиссию();
			Если ОбработанВпервые() Тогда        
				УзелПолучатель = ОпределитьПолучателяКодов();
				Если ЗначениеЗаполнено(УзелПолучатель) Тогда				
					ЗарегистрироватьКодыДляПолучателя(УзелПолучатель);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		//Валетов+10,06,2025 КТО-ТО ЗАТЕР)) ПУСТАЯ ЗАДАЧА
		//Регистрация Готовых Наборов для ЕКат    
		//Валетов + 09,12,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3361 Добавил перемаркировку
	ИначеЕсли (ВидОперации = Перечисления.ВидыОперацийМаркировки.ФормированиеНабора 
		ИЛИ ВидОперации = Перечисления.ВидыОперацийМаркировки.Перемаркировка)
		//Валетов - 
		И Маркировка_ПИ.ТипТекущегоУзла() = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		ОбновитьСтатусЗаказНаЭмиссию();
		Если ОбработанВпервые() Тогда        
			УзелПолучатель = ОпределитьПолучателяКодов();
			Если ЗначениеЗаполнено(УзелПолучатель) Тогда 
				//Валетов + 09,10,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3083
				//Если УзелПолучатель.ТипУзла = Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда	
				ЗарегистрироватьКодыДляПолучателяСНаборами(УзелПолучатель);
				//КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	//++Данилова Е.В. 25.05.2026 MARK-3615
	//++Данилова Е.В. 13.03.2026 MARK-3512 
	//Если Модифицированность() Тогда
	Если ЕстьИзменения Тогда
	//--Данилова Е.В. 25.05.2026 	
		Если ТипШК = Перечисления.ТипыШтрихКодов.Коробка 
			И (ВидОперации = Перечисления.ВидыОперацийМаркировки.Агрегация 
			И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.КонтрактСПроизводителем")) 
			ИЛИ (ВидОперации = Перечисления.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов 
			И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику")) тогда
			
			ОбменДаннымиПоAPI_ТСД.ЗаписатьВФонеДатуИзмененияЗаказовДляТСД(ДокументОснование); 
			
			
		КонецЕсли;	
		
	КонецЕсли;
	//--Данилова Е.В. 13.03.2026 
	//++Данилова Е.В. 25.05.2026 MARK-3615
	Если Проведен И ОбработанВпервые() Тогда
		ДокПеремаркировки = Документы.Перемаркировка.ОтработкаПоПеремаркировке(ДокументОснование);
		Если ДокПеремаркировки <> Неопределено Тогда
			РезультатПроверки = Документы.Перемаркировка.ВсеДокументыЧЗОтработаны(ДокПеремаркировки);
			
			Если РезультатПроверки.Успешно Тогда
				
				//ИдентификаторФЗ = Новый УникальныйИдентификатор;
				//МаркировкаС.ИзменитьСтатусПеремаркировкиВФоне(ДокПеремаркировки, ИдентификаторФЗ);
                документы.Перемаркировка.УстановитьСтатусПеремаркировки(ДокПеремаркировки,Перечисления.СтатусыПеремаркировки.ОбработаноЧЗ); 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//--Данилова Е.В. 25.05.2026 
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Статус			= Перечисления.СтатусыДокументовМаркировки.ВРаботе;
	Автор 			= ПараметрыСеанса.Пользователь;
	ИД_ДокументаЧЗ	= Неопределено;
	ТекстОшибки		= "";
	Комментарий		= "";
	КодУзлаСоздания = Маркировка_ПИ.ЭтотУзел_Код();
	
	Если ВидОперации = Перечисления.ВидыОперацийМаркировки.Агрегация
		ИЛИ ВидОперации = Перечисления.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов Тогда
		
		Товары.Очистить();	
		ШтрихкодыУпаковок.Очистить();	
	КонецЕсли; 
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт                     
	рПроверки = МожноПроводитьДокументВЭтомУзле();
	Если НЕ рПроверки.Успешно Тогда 
		Отказ = Истина;
		ВызватьИсключение СтрСоединить(рПроверки.Ошибки, Символы.ПС); 		 
	КонецЕсли;            
	
	Если ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.Агрегация Тогда		
		Если Статус = Перечисления.СтатусыДокументовМаркировки.Обработан 
			ИЛИ Статус = Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки Тогда
			
			Если КодУзлаСоздания = Маркировка_ПИ.ЭтотУзел_Код() Тогда
				Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
					Документы.МаркировкаТоваровИСМП.ПроверитьЗаполнитьСоставАгрегационныхКодов(Ссылка);
				ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаданиеНаМаркировку") Тогда  //MARK-2937 Заполнение состава агрегаций, сделанных на основании ЗНМ в статусе "ожидание отложенной обработки"
					РегистрыСведений.ЗадачиОтложеннойОбработкиДокументов.СоздатьЗадачу(Ссылка, Перечисления.ЗадачиОтложеннойОбработкиДокументов.ЗаполнитьСоставАгрегаций, Новый Структура("Порядок", -1));					
				ИначеЕсли  ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") //MARK-2520 Заполнить вложения пустых импортных коробов
					ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.КонтрактСПроизводителем") Тогда
					РегистрыСведений.ЗадачиОтложеннойОбработкиДокументов.СоздатьЗадачу(Ссылка, Перечисления.ЗадачиОтложеннойОбработкиДокументов.ЗаполнитьСоставАгрегаций, Новый Структура("Порядок", -1));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов Тогда
		Если Статус = Перечисления.СтатусыДокументовМаркировки.КОбработке Тогда
			рПроверки = ПроверитьЗабронироватьКодыАгрегации();
			Если НЕ рПроверки.Успешно Тогда
				Отказ = Истина;
				Сообщить(СтрСоединить(рПроверки.Ошибки, Символы.ПС), СтатусСообщения.Важное);
			КонецЕсли;		
		КонецЕсли;	
	КонецЕсли;	
	
	Движения_СтатусыКМ_Факт 	= Движения.СтатусыКМ_Факт;
	
	Если ВидОперации = Перечисления.ВидыОперацийМаркировки.РасформированиеУпаковки Тогда 
		//Валетов + https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3317   Было
		//Если Статус <> Перечисления.СтатусыДокументовМаркировки.ВРаботе Тогда
		Если Статус = Перечисления.СтатусыДокументовМаркировки.Обработан ИЛИ Статус = Перечисления.СтатусыДокументовМаркировки.ОбработанЧЗ Тогда
			СформироватьДвиженияРазАгрегации(Движения_СтатусыКМ_Факт);
		КонецЕсли;
	КонецЕсли;
	
	//Статус распечатан по коробкам //Чирков - на всякий пожарный - Леша и Яна любят играться со статусами документов	
	Для Каждого СтрокаТЧ Из МаркировкаС.ПолучитьДанныеКоробок(Ссылка, "ШтрихкодыКоробок") Цикл
		Если СтрокаТЧ.ДатаДобавления = Дата Тогда
			ДатаДобавления = Дата - 2;
		ИначеЕсли СтрокаТЧ.ДатаДобавления = Дата - 1 Тогда
			ДатаДобавления = Дата - 2;			
		Иначе
			ДатаДобавления = СтрокаТЧ.ДатаДобавления;
		КонецЕсли; 		
		
		//СтатусыКМ_Факт
		Движение = Движения_СтатусыКМ_Факт.Добавить();				
		
		Движение.Период 			= ?(ЗначениеЗаполнено(ДатаДобавления), ДатаДобавления, Дата-2);
		
		Движение.ШтрихКодУпаковки	= СтрокаТЧ.ШтрихкодКоробки;
		Движение.Статус				= Перечисления.СтатусыКодовМаркировкиФакт.Распечатан;
		Движение.Местонахождение	= ПодразделениеНанесения;				
		
		//СтатусыКМ_Факт_А
		Движение = Движения.СтатусыКМ_Факт_А.Добавить();				
		
		Движение.Период 			= ?(ЗначениеЗаполнено(ДатаДобавления), ДатаДобавления, Дата-2);
		
		Движение.ШтрихКодУпаковки	= СтрокаТЧ.ШтрихкодКоробки;
		Движение.СпособВводаВОборот = СтрокаТЧ.СпособВводаВОборот;
		//+++Чирков 01.12.2025 ТипУпаковки - убираем
		//Движение.ТипУпаковки		= СтрокаТЧ.ТипУпаковки;		
		//---Чирков 01.12.2025
		Движение.ТипШК				= СтрокаТЧ.ТипШК;
		
		Движение.Статус				= Перечисления.СтатусыКодовМаркировкиФакт.Распечатан;
		Движение.Местонахождение	= ПодразделениеНанесения;
	КонецЦикла;
	
	Если Статус <> Перечисления.СтатусыДокументовМаркировки.Обработан Тогда 
		Движения.СтатусыКМ_ЧЗ.Очистить();
		
		Если Статус = Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки Тогда			
			ЭтоОфис = (Маркировка_ПИ.ТипТекущегоУзла() = Перечисления.ТипУзлаИБ.УправляющееПодразделение);
			Если ЭтоОфис И ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
				Местонахождение = ОпределитьМестонахождениеПоОснованию();			
				
				тКоробок = МаркировкаС.ПолучитьДанныеКоробок(Ссылка, "ШтрихКодыУпаковок");
				Для Каждого СтрокаКоробки Из тКоробок Цикл
					//Движения_СтатусыКМ_Факт
					Движение					= Движения_СтатусыКМ_Факт.Добавить();
					
					Движение.Период				= Дата;
					
					Движение.ШтрихКодУпаковки	= СтрокаКоробки.ШтрихКодКоробки;
					
					Движение.Статус				= Перечисления.СтатусыКодовМаркировкиФакт.ПереданПоставщику;
					Движение.Местонахождение	= Местонахождение;				
					Движение.ВПути 				= Истина;
					
					
					//Движения.СтатусыКМ_Факт_А
					Движение					= Движения.СтатусыКМ_Факт_А.Добавить();
					
					Движение.Период				= Дата;
					
					Движение.ШтрихКодУпаковки	= СтрокаКоробки.ШтрихКодКоробки;
					Движение.ТипШК				= СтрокаКоробки.ТипШК;
					Движение.СпособВводаВОборот	= СтрокаКоробки.СпособВводаВОборот;
					//+++Чирков 01.12.2025 ТипУпаковки - убираем
					//Движение.ТипУпаковки		= СтрокаКоробки.ТипУпаковки;
					//---Чирков 01.12.2025
					
					Движение.Статус				= Перечисления.СтатусыКодовМаркировкиФакт.ПереданПоставщику;
					Движение.Местонахождение	= Местонахождение;				
					Движение.ВПути 				= Истина;					
				КонецЦикла;				
			КонецЕсли;
		КонецЕсли;
		
		//ЗаписатьДвиженияВРегистр_СтатусыКМ_Факт(Движения_СтатусыКМ_Факт);
		//МаркировкаС.ЗаписатьДвиженияВРегистр_СтатусыКМ_Факт_А(ЭтотОбъект, "МаркировкаТоваровИСМП.ЗаписатьДвиженияВРегистр_СтатусыКМ_Факт");
		МаркировкаКС.СохранитьОтложенныеДвижения(ЭтотОбъект, Отказ);
		
		Возврат;
	КонецЕсли;
		
	Если ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.Агрегация Тогда
		
		НЗ_ИСМП 		= Движения.СтатусыКМ_ЧЗ;
		
		Местонахождение = ОпределитьМестонахождениеПоОснованию();
		
		ЭтоОфис			= (Маркировка_ПИ.ТипТекущегоУзла() = Перечисления.ТипУзлаИБ.УправляющееПодразделение);	
		СтатусКМ_Факт 	= ?(ЭтоОфис, Перечисления.СтатусыКодовМаркировкиФакт.Эмитирован, Перечисления.СтатусыКодовМаркировкиФакт.ВОбороте);
		ВПути			= (ЭтоОфис И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику"));
		
		ЭтоМаркировкаОстатков = (ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаданиеНаМаркировку"));
		
		тКоробок = МаркировкаС.ПолучитьДанныеКоробок(Ссылка, "ШтрихкодыУпаковок");
		Для Каждого СтрокаКоробки Из тКоробок Цикл
			//Статусы ЧЗ
			Движение = НЗ_ИСМП.Добавить();
			
			Движение.Период 			= Дата;
			Движение.ШтрихКодУпаковки	= СтрокаКоробки.ШтрихКодКоробки;
			Движение.Статус				= Перечисления.СтатусыКодовМаркировкиИСМП.Эмитирован;
			
			//Статусы факт
			Если НЕ ЭтоМаркировкаОстатков Тогда     
				//Движения_СтатусыКМ_Факт
				Движение					= Движения_СтатусыКМ_Факт.Добавить();
					
				Движение.Период				= Дата;
				Движение.ШтрихКодУпаковки	= СтрокаКоробки.ШтрихКодКоробки;
				Движение.Статус				= СтатусКМ_Факт;
				Движение.Местонахождение	= Местонахождение;				
				
				Движение.ВПути 				= ВПути;				
				
				//Движения.СтатусыКМ_Факт_А
				Движение					= Движения.СтатусыКМ_Факт_А.Добавить();
				
				Движение.Период				= Дата;
				
				Движение.ШтрихКодУпаковки	= СтрокаКоробки.ШтрихКодКоробки;
				Движение.ТипШК				= СтрокаКоробки.ТипШК;
				Движение.СпособВводаВОборот	= СтрокаКоробки.СпособВводаВОборот;
				//+++Чирков 01.12.2025 ТипУпаковки - убираем
				//Движение.ТипУпаковки		= СтрокаКоробки.ТипУпаковки;
				//---Чирков 01.12.2025
				
				Движение.Статус				= СтатусКМ_Факт;
				Движение.Местонахождение	= Местонахождение;				
				
				Движение.ВПути 				= ВПути;
			КонецЕсли;			
		КонецЦикла;
		
	ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.РасформированиеУпаковки Тогда
		
		НЗ_ИСМП = Движения.СтатусыКМ_ЧЗ;
		
		Для Каждого ШтрихКодКоробки Из ПолучитьШтрихКодыКоробок() Цикл			
			Движение = НЗ_ИСМП.Добавить();
				
			Движение.Период 			= Дата;
			Движение.ШтрихКодУпаковки	= ШтрихКодКоробки;
			Движение.Статус				= Перечисления.СтатусыКодовМаркировкиИСМП.Расформирован;			
		КонецЦикла;
		
	ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ФормированиеНабора Тогда
		//+++Чирков 11.08.2025
		Если КодУзлаСоздания = Маркировка_ПИ.ЭтотУзел_Код() Тогда
			РегистрыСведений.ЗадачиОтложеннойОбработкиДокументов.СоздатьЗадачу(Ссылка,
				Перечисления.ЗадачиОтложеннойОбработкиДокументов.ЗаполнитьСоставНаборов, Новый Структура("Порядок", -1));
		КонецЕсли;
		//---Чирков 11.08.2025
		
		НЗ_ИСМП 			= Движения.СтатусыКМ_ЧЗ;
		НЗ_СтатусыКМ_Факт	= Движения_СтатусыКМ_Факт;
		//++Данилова Е.В. 26.03.2025
		НЗ_СтатусыКМ_Факт_Пропускать = Ложь; 
		//--Данилова Е.В. 26.03.2025
		Местонахождение = Неопределено;
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ") Тогда
			Местонахождение = ПолучитьРеквизитШапки(ДокументОснование, "ПодразделениеНанесения");
			//++Данилова Е.В. 26.03.2025
			Если ДокументОснование.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Импорт Тогда
				
				НЗ_СтатусыКМ_Факт_Пропускать = Истина; 	
				//Валетов + https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3032	
				Для каждого СтрТЧ Из ШтрихкодыУпаковок Цикл
					Движение = НЗ_СтатусыКМ_Факт.Добавить();
					
					Движение.Период 			= Дата;
					Движение.ШтрихКодУпаковки	= СтрТЧ.ШтрихкодУпаковки;				
					Движение.ТипШК				= СтрТЧ.ШтрихкодУпаковки.ТипШК;
					Движение.Номенклатура		= СтрТЧ.ШтрихкодУпаковки.Владелец;
					Движение.Статус				= Перечисления.СтатусыКодовМаркировкиФакт.НанесенВиртуально;				
					
					Движение.Местонахождение 	= Местонахождение;  
				КонецЦикла; 
				//Валетов -
			КонецЕсли;
			//--Данилова Е.В. 26.03.2025  
			
			//Валетов + https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3032 
			//Пропускаем запись по кодам наборов, делаем запись по кодам комплектующих в статусе "нанесен виртуально"
		ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.КонтрактСПроизводителем") Тогда
			Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.КонтрактСПроизводителем") Тогда
				Местонахождение = ПолучитьРеквизитШапки(ДокументОснование, "Подразделение");  
			Иначе 
				Местонахождение = Справочники.Подразделения.ПустаяСсылка();
			КонецЕсли;
			
			НЗ_СтатусыКМ_Факт_Пропускать = Истина;				
			
			Для каждого СтрТЧ Из ШтрихкодыУпаковок Цикл
				Движение = НЗ_СтатусыКМ_Факт.Добавить();
				
				Движение.Период 			= Дата;
				Движение.ШтрихКодУпаковки	= СтрТЧ.ШтрихкодУпаковки;				
				Движение.ТипШК				= СтрТЧ.ШтрихкодУпаковки.ТипШК;
				Движение.Номенклатура		= СтрТЧ.ШтрихкодУпаковки.Владелец;
				Движение.Статус				= Перечисления.СтатусыКодовМаркировкиФакт.НанесенВиртуально;				
				
				Движение.Местонахождение 	= Местонахождение;  
			КонецЦикла; 
			//Валетов -
		Иначе                                 
			УзелСоздания = Маркировка_ПИ.УзелПоКоду(КодУзлаСоздания, "Основной");			
			Если ЗначениеЗаполнено(УзелСоздания) Тогда
				Местонахождение = ПолучитьРеквизитШапки(УзелСоздания, "Подразделение");							
			КонецЕсли; 
		КонецЕсли;
		
		Для Каждого СтрокаДанных Из ПолучитьШтрихКодыНаборов() Цикл				
			Движение = НЗ_ИСМП.Добавить();
			
			Движение.Период 			= Дата;
			Движение.ШтрихКодУпаковки	= СтрокаДанных.ШтрихкодНабора;
			//Валетов + 06,10,2025  https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3041 Исправлено 08,10,2025
			//Если ДокументОснование.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Импорт Тогда 
			Движение.Статус				= Перечисления.СтатусыКодовМаркировкиИСМП.ВведенВОборот; 
			
			Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.КонтрактСПроизводителем") Тогда 
				Движение.Статус				= Перечисления.СтатусыКодовМаркировкиИСМП.Нанесен;  				
			ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ") Тогда
				Если ДокументОснование.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Импорт Тогда 
					Движение.Статус				= Перечисления.СтатусыКодовМаркировкиИСМП.Нанесен; 
				КонецЕсли;
			КонецЕсли;    
			//Валетов -
			
			//++Данилова Е.В. 26.03.2025
			Если НЗ_СтатусыКМ_Факт_Пропускать Тогда
			
				Продолжить; 	
			
			КонецЕсли; 				
			//--Данилова Е.В. 26.03.2025
			Движение = НЗ_СтатусыКМ_Факт.Добавить();
			
			Движение.Период 			= Дата;
			Движение.ШтрихКодУпаковки	= СтрокаДанных.ШтрихкодНабора;				
			Движение.ТипШК				= СтрокаДанных.ТипШК;
			Движение.Номенклатура		= СтрокаДанных.Номенклатура;
			
			Если СтрокаДанных.ВидКомплекта = Перечисления.ВидыКомплектов.ГотовыйКомплект Тогда
				Движение.Статус			= Перечисления.СтатусыКодовМаркировкиФакт.ГотовКПечати;				
			Иначе
				Движение.Статус			= Перечисления.СтатусыКодовМаркировкиФакт.ВОбороте;				
			КонецЕсли;
			
			Движение.Местонахождение 	= Местонахождение;
		КонецЦикла;	
	ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.АТК Тогда
		
		Если Статус = Перечисления.СтатусыДокументовМаркировки.Обработан Тогда
			КодАТК = НайтиСоздатьКодАТК();			
			Если ЗначениеЗаполнено(КодАТК) Тогда			
				НЗ_ИСМП = Движения.СтатусыКМ_ЧЗ;
				
				Движение = НЗ_ИСМП.Добавить();
						
				Движение.Период 			= Дата;
				Движение.ШтрихКодУпаковки	= КодАТК;				
				Движение.Статус				= Перечисления.СтатусыКодовМаркировкиИСМП.Эмитирован;
			КонецЕсли;			
		КонецЕсли;		
	Иначе		
		Если ВидОперации = Перечисления.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов Тогда					
			СтатусКМ_Факт = ?(фКодыАгрегацийДляПоставщиков, Перечисления.СтатусыКодовМаркировкиФакт.Эмитирован, Перечисления.СтатусыКодовМаркировкиФакт.ГотовКПечати);
			
			тКоробок = МаркировкаС.ПолучитьДанныеКоробок(Ссылка, "ШтрихкодыУпаковок", "ШтрихКодУпаковки");
			Для Каждого СтрокаКоробки Из тКоробок Цикл
				//Движения_СтатусыКМ_Факт
				Движение = Движения_СтатусыКМ_Факт.Добавить();
				
				Движение.Период 			= Дата;
				
				Движение.ШтрихКодУпаковки	= СтрокаКоробки.ШтрихКодКоробки;				
				
				Движение.Статус				= СтатусКМ_Факт;				
				Движение.Местонахождение	= ПодразделениеНанесения;
				
				//Движения.СтатусыКМ_Факт_А
				Движение = Движения.СтатусыКМ_Факт_А.Добавить();
				
				Движение.Период 			= Дата;
				
				Движение.ШтрихКодУпаковки	= СтрокаКоробки.ШтрихКодКоробки;				
				Движение.ТипШК				= СтрокаКоробки.ТипШК;
				Движение.СпособВводаВОборот	= СтрокаКоробки.СпособВводаВОборот;
				//+++Чирков 01.12.2025 ТипУпаковки - убираем
				//Движение.ТипУпаковки		= СтрокаКоробки.ТипУпаковки;
				//---Чирков 01.12.2025
				
				Движение.Статус				= СтатусКМ_Факт;				
				Движение.Местонахождение	= ПодразделениеНанесения;
			КонецЦикла;
			
			Получатели = ОпределитьПолучателей();
			ЗарегистрироватьИзменения_ШК(Получатели);			
		ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ТрансформацияУпаковки_Добавление Тогда
			
			СтатусКМ_Факт = Перечисления.СтатусыКодовМаркировкиФакт.Вложен;
			
		ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ТрансформацияУпаковки_Изъятие Тогда
			
			СтатусКМ_Факт = Перечисления.СтатусыКодовМаркировкиФакт.ВОбороте;
			
		КонецЕсли;

		СтатусКМ = Перечисления.ВидыОперацийИСМП.ВидОперацииИСМП_СтатусКМ(ВидОперацииИСМП);
		Если ЗначениеЗаполнено(СтатусКМ) Тогда
			НЗ_ИСМП = Движения.СтатусыКМ_ЧЗ;
			Для Каждого СтрокаШК Из ШтрихкодыУпаковок Цикл
				Движение = НЗ_ИСМП.Добавить();
				
				Движение.Период 			= Дата;
				Движение.ШтрихКодУпаковки	= СтрокаШК.ШтрихкодУпаковки;				
				Движение.Статус				= СтатусКМ;
			КонецЦикла;            
			
			Статус_Факт 		= Неопределено;			     
			Местонахождение     = Неопределено;
			//++Данилова Е.В. 03.03.2025 MARK-1623
			КомлектующиеГотовыхНаборов = Новый Соответствие; 
			//--Данилова Е.В. 03.03.2025
			
			Если СтатусКМ = Перечисления.СтатусыКодовМаркировкиИСМП.ВведенВОборот Тогда          
				//Валетов + 21,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3522 Добавил ИЛИ 
				Если ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВводВОборот_МаркировкаОстатков 
					ИЛИ ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.Перемаркировка_ИспорченоЛибоУтеряно Тогда
					//++Данилова Е.В. 03.03.2025 MARK-1623
					ПолучитьКомлектующиеГотовыхНаборов(КомлектующиеГотовыхНаборов); 
					//--Данилова Е.В. 03.03.2025
					Статус_Факт = Перечисления.СтатусыКодовМаркировкиФакт.ГотовКПечати;
				ИначеЕсли ВидОперации = Перечисления.ВидыОперацийМаркировки.ВозвратВОборот Тогда
					Статус_Факт = Перечисления.СтатусыКодовМаркировкиФакт.ВОбороте;
				ИначеЕсли ВидОперации = Перечисления.ВидыОперацийМаркировки.Перемаркировка Тогда
					Статус_Факт = Перечисления.СтатусыКодовМаркировкиФакт.ГотовКПечати;
				КонецЕсли;				
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийМаркировки.Списание Тогда
				Если ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
					Статус_Факт = Перечисления.СтатусыКодовМаркировкиФакт.Списан;
				Иначе					
					Статус_Факт 	= Перечисления.СтатусыКодовМаркировкиФакт.Списан;
					//+++Чирков MARK-3106 заполнять местонахождение у документов "списание"
					//	необходимо заполнять местонаждонием текущего узла где была проведена операция
					//
					//Местонахождение = ОпределитьМестонахождениеПоОснованию();
				КонецЕсли;           
				Местонахождение = ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла();
				//---Чирков MARK-3106
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийМаркировки.ВыводИзОборота Тогда
				Статус_Факт 	= Перечисления.СтатусыКодовМаркировкиФакт.Списан;				
				Местонахождение = ОпределитьМестонахождениеПоОснованию();
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Статус_Факт) Тогда				
				Если Статус_Факт = Перечисления.СтатусыКодовМаркировкиФакт.ГотовКПечати Тогда
					Если ЗначениеЗаполнено(ПодразделениеНанесения) Тогда						
						Местонахождение = ПодразделениеНанесения;
					Иначе						
						Отказ = Истина;
					КонецЕсли;
				Иначе
					Если НЕ ЗначениеЗаполнено(Местонахождение) Тогда
						Местонахождение = ПодразделениеНанесения;					
					КонецЕсли;
				КонецЕсли; 
				
				НЗ_Факт = Движения_СтатусыКМ_Факт;
				Для Каждого СтрокаШК Из ПолучитьТаблицуШК(Ссылка) Цикл
					Движение = НЗ_Факт.Добавить();
					
					Движение.Период 				= Дата;
					Движение.ШтрихКодУпаковки		= СтрокаШК.ШтрихкодУпаковки;				
					Движение.ТипШК					= СтрокаШК.ТипШК;
					Движение.Номенклатура			= СтрокаШК.Номенклатура;
					Движение.Статус					= Статус_Факт;
					Движение.Местонахождение		= Местонахождение;
					//++Данилова Е.В. 03.03.2025 MARK-1623
					Если КомлектующиеГотовыхНаборов.Получить(СтрокаШК.ШтрихкодУпаковки) <> неопределено Тогда
						//Валетов + 13,01,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3411 
						//Валетов + 21,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3522 Добавил ИЛИ 
						Если (ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВводВОборот_МаркировкаОстатков ИЛИ ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.Перемаркировка_ИспорченоЛибоУтеряно) 
							И ЗначениеЗаполнено(ПодразделениеНанесения) Тогда
							Движение.Статус				= Перечисления.СтатусыКодовМаркировкиФакт.ГотовКПечати;
						Иначе
							Движение.Статус				= Перечисления.СтатусыКодовМаркировкиФакт.НанесенВиртуально;
						КонецЕсли;
						//Валетов - 						
					КонецЕсли;
					//--Данилова Е.В. 03.03.2025
				КонецЦикла;
			КонецЕсли;
			
			Получатели = ОпределитьПолучателей();
			Если Статус_Факт = Перечисления.СтатусыКодовМаркировкиФакт.ГотовКПечати Тогда
				ЗарегистрироватьИзменения_ШК(Получатели);							
			КонецЕсли;
			ЗарегистрироватьИзменения_Статусы(Получатели);
		КонецЕсли;
		
	КонецЕсли; 
	
	Если ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ТрансформацияУпаковки_Добавление Тогда		
		ДобавитьКодыВАгрегат();		
		
		СтатусКМ_Факт = Перечисления.СтатусыКодовМаркировкиФакт.Вложен;			
	ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ТрансформацияУпаковки_Изъятие Тогда			
		УдалитьКодыИзАгрегата();
		
		СтатусКМ_Факт = Перечисления.СтатусыКодовМаркировкиФакт.ВОбороте;	
		
		//++Валетов 20260609 Наряд 0000000741 Будет наряд на новый механизм разбора кодов 
	//	//++Данилова Е.В. 21.05.2026 MARK-3717 
	//ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.РасформированиеУпаковки
	//	И Статус = Перечисления.СтатусыДокументовМаркировки.Обработан Тогда
	//	ОчиститьВложенныеКодыУпаковки(); 
	//	//--Данилова Е.В. 21.05.2026 
	КонецЕсли;
	
	МаркировкаКС.СохранитьОтложенныеДвижения(ЭтотОбъект, Отказ);	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	рПроверки = МожноПроводитьДокументВЭтомУзле();
	Если НЕ рПроверки.Успешно Тогда 
		Отказ = Истина;
		ВызватьИсключение СтрСоединить(рПроверки.Ошибки, Символы.ПС);
		Возврат; 
	КонецЕсли;
	
	Если Статус = Перечисления.СтатусыДокументовМаркировки.ОбработанЧЗ
		ИЛИ Статус = Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки
		ИЛИ Статус = Перечисления.СтатусыДокументовМаркировки.Обработан Тогда
		
		Отказ = Истина;		
	КонецЕсли; 
	
	Если НЕ Отказ Тогда	
		Получатели = ОпределитьПолучателей();
		ЗарегистрироватьИзменения_Статусы(Получатели);
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)	
	сПроверяемыеРеквизиты = Новый Соответствие;
	Для Каждого ИмяРеквизита Из ПроверяемыеРеквизиты Цикл
		сПроверяемыеРеквизиты[ИмяРеквизита] = Истина;			
	КонецЦикла;	
	
	Для Каждого КиЗ Из ОбязательныеРеквизитыДоп() Цикл
		сПроверяемыеРеквизиты[КиЗ.Ключ] = КиЗ.Значение;
	КонецЦикла; 
	
	Если ВидОперации = Перечисления.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов Тогда
		сПроверяемыеРеквизиты["Товары.Номенклатура"]	= Ложь;
		сПроверяемыеРеквизиты["Товары.Количество"]		= Ложь;
		сПроверяемыеРеквизиты["ВидОперацииИСМП"] 		= Ложь;
		сПроверяемыеРеквизиты["ДокументОснование"] 		= Ложь; 
		
		сПроверяемыеРеквизиты["КоличествоКодовSSCC"]	= Истина;
		сПроверяемыеРеквизиты["ТипШК"]					= Истина;
		сПроверяемыеРеквизиты["ПодразделениеНанесения"]	= Истина;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийМаркировки.РасформированиеУпаковки Тогда
		сПроверяемыеРеквизиты["ДокументОснование"] 		= Ложь;
		сПроверяемыеРеквизиты["ТипУпаковки"] 			= Ложь;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийМаркировки.ВыводИзОборота Тогда
		сПроверяемыеРеквизиты["ТипУпаковки"] 			= Ложь;		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийМаркировки.ТрансформацияУпаковки Тогда
		сПроверяемыеРеквизиты["ШтрихкодУпаковки"] 		= Истина;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийМаркировки.Перемаркировка Тогда
		сПроверяемыеРеквизиты["ДокументОснование"] 		= Ложь;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийМаркировки.ФормированиеНабора Тогда
		сПроверяемыеРеквизиты["ТипУпаковки"] 			= Ложь;
	КонецЕсли;	
	
	ПроверяемыеРеквизиты.Очистить();
	Для Каждого КиЗ Из сПроверяемыеРеквизиты Цикл
		Если КиЗ.Значение = Истина Тогда		
			ПроверяемыеРеквизиты.Добавить(КиЗ.Ключ);			
		КонецЕсли;		
	КонецЦикла;
КонецПроцедуры


#КонецОбласти

Функция лМожноЗаписатьДокумент()
	Результат = Новый Структура("Успешно,Ошибки", Истина, Новый Массив);
	
	Если ЭтоНовый() Тогда
		мКодУзлаСоздания = КодУзлаСоздания;
	Иначе 
		мКодУзлаСоздания = ПолучитьРеквизитШапки(Ссылка, "КодУзлаСоздания");
	КонецЕсли;		
		
	Если ОбменДанными.Загрузка Тогда
		УзелОтправитель = ОбменДанными.Отправитель;
		Если ЗначениеЗаполнено(УзелОтправитель) Тогда
			Если УзелОтправитель.Код <> мКодУзлаСоздания Тогда				
				Результат.Успешно = Ложь;							
				Результат.Ошибки.Добавить("Нельзя перезаписывать ОМ созданную в другом узле ! " + Ссылка + " создан: " + мКодУзлаСоздания);				
			ИначеЕсли мКодУзлаСоздания = Маркировка_ПИ.ЭтотУзел_Код() Тогда
				Результат.Успешно = Ложь;							
				Результат.Ошибки.Добавить("Можно загружать только ОМ созданные в других узлах ! "+ЭтотОбъект+" узел отправитель: "+УзелОтправитель.Код+", код узла создания: "+мКодУзлаСоздания);
			КонецЕсли; 			 
		КонецЕсли;
	Иначе
		Если НЕ ЭтоНовый() Тогда
			Если мКодУзлаСоздания <> Маркировка_ПИ.ЭтотУзел_Код() И Модифицированность() Тогда
				Результат.Успешно = Ложь;
				Результат.Ошибки.Добавить("Нельзя изменять ОМ созданную в другом узле ! "+Ссылка+" создан: "+мКодУзлаСоздания);
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ПараметрыСеанса.ОтключитьКонтрольДЗР Тогда    
			Отказ = Ложь;
			КонтрольДатыЗапрета(ЭтотОбъект, Отказ);
			Если Отказ Тогда
				Результат.Успешно = Ложь;
				Результат.Ошибки.Добавить("Нарушение ДЗР !");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //лМожноЗаписатьДокумент()

Функция ДобавитьКодыВАгрегат()
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|    Штрихкод
	|ПОМЕСТИТЬ ВТ_ВложенныеКоды
	|ИЗ	
	|	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШтрихкоды
	|ГДЕ
	|	ВложенныеШтрихкоды.Ссылка = &КодАгрегата
	|ИНДЕКСИРОВАТЬ ПО	
	|	Штрихкод	
	|;	
	|ВЫБРАТЬ
	|	ТЧ.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК ТЧ
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ВТ_ВложенныеКоды
	|ПО  	
	|	ТЧ.ШтрихкодУпаковки 		= ВТ_ВложенныеКоды.Штрихкод
	|ГДЕ
	|	ТЧ.Ссылка 					= &Ссылка	
	|	И ВТ_ВложенныеКоды.ШтрихКод ЕСТЬ NULL
	|";
	
	Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
	Запрос.УстановитьПараметр("КодАгрегата",	ШтрихкодУпаковки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 Тогда
		СпрОбъект = ШтрихкодУпаковки.ПолучитьОбъект();
		
		Пока Выборка.Следующий() Цикл
			СтрокаТЧ = СпрОбъект.ВложенныеШтрихкоды.Добавить();
			СтрокаТЧ.Штрихкод = Выборка.ШтрихкодУпаковки;
		КонецЦикла;
		
		СпрОбъект.Количество = ПолучитьКоличествоВложенныхКодов(СпрОбъект);
		СпрОбъект.ОбменДанными.Загрузка = Истина;
		
		СпрОбъект.Записать();
	КонецЕсли;	
КонецФункции //ДобавитьКодыВАгрегат()

Функция УдалитьКодыИзАгрегата()
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|    Штрихкод
	|ПОМЕСТИТЬ ВТ_ВложенныеКоды
	|ИЗ	
	|	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШтрихкоды
	|ГДЕ
	|	ВложенныеШтрихкоды.Ссылка = &КодАгрегата
	|ИНДЕКСИРОВАТЬ ПО	
	|	Штрихкод	
	|;	
	|ВЫБРАТЬ
	|	ТЧ.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК ТЧ
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ВТ_ВложенныеКоды
	|ПО  	
	|	ТЧ.ШтрихкодУпаковки 		= ВТ_ВложенныеКоды.Штрихкод
	|ГДЕ
	|	ТЧ.Ссылка 					= &Ссылка	
	|	И ВТ_ВложенныеКоды.ШтрихКод ЕСТЬ НЕ NULL
	|";
	
	Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
	Запрос.УстановитьПараметр("КодАгрегата",	ШтрихкодУпаковки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 Тогда
		КодыКУдалению = Новый Соответствие;		
		Пока Выборка.Следующий() Цикл
			КодыКУдалению[Выборка.ШтрихкодУпаковки] = Истина;
		КонецЦикла;
		
		СпрОбъект 	= ШтрихкодУпаковки.ПолучитьОбъект();
		Сч 			= СпрОбъект.ВложенныеШтрихкоды.Количество() - 1;
		Пока Сч >= 0 Цикл          
			ТекСтрока = СпрОбъект.ВложенныеШтрихкоды[Сч];
			Если КодыКУдалению[ТекСтрока.Штрихкод] <> Неопределено Тогда
				СпрОбъект.ВложенныеШтрихкоды.Удалить(ТекСтрока);							
			КонецЕсли;
			Сч = Сч - 1;			
		КонецЦикла;
		
		СпрОбъект.Количество = ПолучитьКоличествоВложенныхКодов(СпрОбъект);
		СпрОбъект.ОбменДанными.Загрузка = Истина;
		
		СпрОбъект.Записать();
	КонецЕсли;	
КонецФункции //ДобавитьКодыВАгрегат()

Функция ПолучитьКоличествоВложенныхКодов(КМ_Объект)
	Резуьтат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_ВложенныеШтрихкоды ИЗ &ВложенныеШтрихкоды КАК ВложенныеШтрихкоды 
	|;
	|ВЫБРАТЬ СУММА(Штрихкод.Количество) КАК Количество ИЗ ВТ_ВложенныеШтрихкоды
	|";
	
	Запрос.УстановитьПараметр("ВложенныеШтрихкоды", КМ_Объект.ВложенныеШтрихкоды);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Количество) Тогда
		Резуьтат = Выборка.Количество;
	КонецЕсли;                       
	
	Возврат Резуьтат;
КонецФункции //ПолучитьКоличествоВложенныхКодов(КМ_Объект)

Функция ПолучитьТаблицуШК(ДокСсылка)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки					КАК ШтрихкодУпаковки,
	|	ШтрихкодУпаковки.ТипШК				КАК ТипШК,
	//+++Чирков 29.09.2025 выравнивание движений по статусам в регистрах штук и коробок
	|	ШтрихкодУпаковки.ТипУпаковки 		КАК ТипУпаковки,
	|	ШтрихкодУпаковки.СпособВводаВОборот КАК СпособВводаВОборот,                    
	//---Чирков 29.09.2025 выравнивание движений по статусам в регистрах штук и коробок
	|	ШтрихкодУпаковки.Владелец 			КАК Номенклатура
	|ИЗ
	|	" +  ДокСсылка.Метаданные().ПолноеИмя() + ".ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка = &ДокСсылка
	|";                             
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции //ПолучитьТаблицуШК(ДокСсылка)

Функция МожноПроводитьДокументВЭтомУзле()
	Результат = МаркировкаКС.СтруктураРезультата();
	
	КодТекУзла = ВРег(СокрЛП(Маркировка_ПИ.ЭтотУзел_Код("Основной")));	
	Если КодТекУзла <> СокрЛП(СокрЛП(КодУзлаСоздания)) Тогда 
		ТекстСообщения = СтрШаблон("Документ создан в узле: %1, текущий узел: %2.
		|Нельзя изменять проводить (распроводить) операции маркировки полученные из других узлов !", КодУзлаСоздания, КодТекУзла);
		
		Результат.Успешно = Ложь;
		Результат.Ошибки.Добавить(ТекстСообщения);
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции // ()

Функция ОпределитьПолучателяКодов()
	ИмяПланаОбмена	= "ДанныеЧЗ";
	Результат		= ПланыОбмена[ИмяПланаОбмена].ПустаяСсылка();
	
	Если ЗначениеЗаполнено(ПодразделениеНанесения) И ТипЗнч(ПодразделениеНанесения) = Тип("СправочникСсылка.Подразделения") Тогда		
		УзелПолучатель	= Маркировка_ПИ.УзелПодразделения(ПодразделениеНанесения, ИмяПланаОбмена);		
		Если ЗначениеЗаполнено(УзелПолучатель) И УзелПолучатель <> Маркировка_ПИ.ЭтотУзел(ИмяПланаОбмена) Тогда
			Результат = УзелПолучатель;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ОпределитьПолучателяКодов()

Процедура ОбновитьСтатусЗаказНаЭмиссию()
	Если ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ") Тогда
		СтатусВЗаказеНаЭмиссию = ПолучитьРеквизитШапки(ДокументОснование, "СтатусВводаВОборот");	
		Если СтатусВЗаказеНаЭмиссию <> Статус Тогда
			//++Данилова Е.В. 25.03.2025
			//УстановитьРеквизитыОбъекта(ДокументОснование, Новый Структура("СтатусВводаВОборот", Статус));
			УстановитьРеквизитыОбъекта(ДокументОснование, Новый Структура("СтатусВводаВОборот", Статус),,,,Новый Структура("ИзменениеСтатусаВВО",истина));
			//--Данилова Е.В. 25.03.2025
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

Процедура ЗаписатьДокОснованиеВТЧ()
	Если ЗначениеЗаполнено(ДокументОснование)
		И ДокументыОснования.Найти(ДокументОснование, "ДокументОснование") = Неопределено Тогда
		СтрокаТЧ = ДокументыОснования.Добавить();
		СтрокаТЧ.ДокументОснование = ДокументОснование;
	КонецЕсли;
КонецПроцедуры
 
Функция УстановитьПолучателейКоробок() Экспорт
	ИмяПланаОбмена = "ДанныеЧЗ";
	ТипУзла = Маркировка_ПИ.ТипТекущегоУзла(ИмяПланаОбмена);
	
	Получатели = Новый Массив;
	Если ТипУзла = Перечисления.ТипУзлаИБ.Склад
		ИЛИ ТипУзла = Перечисления.ТипУзлаИБ.Филиал Тогда
		Получатели = Маркировка_ПИ.ПолучитьМассивУзловПоТипу(Перечисления.ТипУзлаИБ.УправляющееПодразделение, ИмяПланаОбмена);
	ИначеЕсли ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			Получатели = Маркировка_ПИ.ПолучитьМассивУзловПоТипу(Перечисления.ТипУзлаИБ.Склад, ИмяПланаОбмена);
		ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Перемещение") Тогда
			Получатели = Документы.МаркировкаТоваровИСМП.ПолучателиПеремещения(ЭтотОбъект);			
		КонецЕсли;
	КонецЕсли;
	     
	Если Получатели.Количество() > 0 Тогда		
		КодыКоробок = ПолучитьШтрихКодыКоробок();		
		Если КодыКоробок.Количество() > 0 Тогда
			ОбменДаннымиЧЗ.УстановитьПолучателей(Получатели, КодыКоробок);		
		КонецЕсли;		
	КонецЕсли; 
КонецФункции //УстановитьПолучателейКоробок() Экспорт


Функция ОбработанВпервые()
	Возврат СтатусВпервые(Перечисления.СтатусыДокументовМаркировки.Обработан);
КонецФункции //ОбработанВпервые()

Функция СтатусВпервые(ПроверяемыйСтатус)
	Результат = Ложь;
	БылСтатус = МаркировкаКС.ПолучитьЗначениеПараметра(ДополнительныеСвойства, "БылСтатус");
	Если Статус = ПроверяемыйСтатус И БылСтатус <> Статус Тогда
		Результат = Истина;		
	КонецЕсли;
	Возврат Результат;	
КонецФункции //СтатусВпервые()

Процедура ЗарегистрироватьКодыДляПолучателя(УзелПолучатель)			
	
	ТипУзлаПолучателя = ПолучитьРеквизитШапки(УзелПолучатель, "ТипУзла");
	Если ТипУзлаПолучателя <> Перечисления.ТипУзлаИБ.Склад Тогда				
		мКоды = Новый Массив;				
		Для каждого СтрокаТЧ Из ШтрихкодыУпаковок Цикл
			Если ЗначениеЗаполнено(СтрокаТЧ.ШтрихкодУпаковки) Тогда
				мКоды.Добавить(СтрокаТЧ.ШтрихкодУпаковки); 			
			КонецЕсли; 		
		КонецЦикла;                      
		ОбменДаннымиЧЗ.УстановитьПолучателей(УзелПолучатель, мКоды);
		
		НЗ = РегистрыСведений.СтатусыКМ_ЧЗ.СоздатьНаборЗаписей();
		НЗ.Отбор.Регистратор.Установить(Ссылка, Истина);
		
		ПланыОбмена.ЗарегистрироватьИзменения(УзелПолучатель, НЗ);				
		
		НЗ = РегистрыСведений.СтатусыКМ_Факт.СоздатьНаборЗаписей();
		НЗ.Отбор.Регистратор.Установить(Ссылка, Истина);
		
		ПланыОбмена.ЗарегистрироватьИзменения(УзелПолучатель, НЗ);				
	КонецЕсли;

	//Ввод в оборот тоже отправляем (чтобы можно было сверить реестры) 
	ПланыОбмена.ЗарегистрироватьИзменения(УзелПолучатель, Ссылка);	
КонецПроцедуры

Процедура ЗарегистрироватьКодыКоробокДляПолучателя()
	ИмяПланаОбмена = "ДанныеЧЗ";
	
	Если ЗначениеЗаполнено(ПодразделениеНанесения) И ТипЗнч(ПодразделениеНанесения) = Тип("СправочникСсылка.Подразделения") Тогда
		УзелПолучатель	= Маркировка_ПИ.УзелПодразделения(ПодразделениеНанесения, ИмяПланаОбмена);
		Если ЗначениеЗаполнено(УзелПолучатель) И УзелПолучатель <> Маркировка_ПИ.ЭтотУзел(ИмяПланаОбмена) Тогда
		    ТипУзла = ПолучитьРеквизитШапки(УзелПолучатель, "ТипУзла");
			Если ТипУзла <> Перечисления.ТипУзлаИБ.Склад Тогда			
				Для каждого СтрокаТЧ Из ШтрихкодыУпаковок Цикл
					Если ЗначениеЗаполнено(СтрокаТЧ.ШтрихкодУпаковки) Тогда
						ПланыОбмена.ЗарегистрироватьИзменения(УзелПолучатель, СтрокаТЧ.ШтрихкодУпаковки); 			
					КонецЕсли; 		
				КонецЦикла;
				
				НЗ = РегистрыСведений.СтатусыКМ_ЧЗ.СоздатьНаборЗаписей();
				НЗ.Отбор.Регистратор.Установить(Ссылка, Истина);
				
				ПланыОбмена.ЗарегистрироватьИзменения(УзелПолучатель, НЗ);
				
				
				НЗ = РегистрыСведений.СтатусыКМ_Факт.СоздатьНаборЗаписей();
				НЗ.Отбор.Регистратор.Установить(Ссылка, Истина);
				
				ПланыОбмена.ЗарегистрироватьИзменения(УзелПолучатель, НЗ);
			КонецЕсли;		
		КонецЕсли;		
	КонецЕсли;	
КонецПроцедуры

Процедура ПроверитьОбновитьСтатусЗаданияНаСборку()
	Если Проведен Тогда
		Если ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаданиеНаСборкуКомплектовЧЗ") Тогда
			СтатусЗаданияНаСборку = ПолучитьРеквизитШапки(ДокументОснование, "СтатусОбработкиЧЗ");
			Если СтатусЗаданияНаСборку <> Статус Тогда
				Задание = ДокументОснование.ПолучитьОбъект();
				
				Задание.СтатусОбработкиЧЗ		= Статус;
				Задание.ОбменДанными.Загрузка	= Истина;
				
				Задание.Записать(РежимЗаписиДокумента.Запись);
				#ЕСЛИ КЛИЕНТ ТОГДА
				ОповеститьОбИзменении(ДокументОснование);
				#КОНЕЦЕСЛИ
			КонецЕсли;					
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры  //ПроверитьОбновитьСтатусЗаданияНаСборку()

Функция ОпределитьМестонахождениеПоОснованию()
	Результат		= ПодразделениеНанесения;
	ТипОснования	= ТипЗнч(ДокументОснование); 
	
	Если ТипОснования = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Результат = ПолучитьРеквизитШапки(ДокументОснование, "Контрагент");
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		Результат = ПолучитьРеквизитШапки(ДокументОснование, "Склад.Подразделение");	
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.Перемещение") Тогда
		Результат = ПолучитьРеквизитШапки(ДокументОснование, "Склад.Подразделение");	
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции //ОпределитьПоследнееМестонахождение()
 
Процедура ЗарегистрироватьИзменения_ШК(Получатели)
	НужноВыгружать = Ложь;
	
	Если НЕ (ДополнительныеСвойства.Свойство("НужноВыгружать", НужноВыгружать) И НужноВыгружать) Тогда Возврат КонецЕсли; 
		
	Если Получатели.Количество()>0 Тогда
		Для Каждого СтрокаШК Из ШтрихкодыУпаковок Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(Получатели, СтрокаШК.ШтрихкодУпаковки); 
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры //ЗарегистрироватьИзменения()

Процедура ЗарегистрироватьИзменения_Статусы(Получатели)
	НужноВыгружать = Ложь;
	
	Если НЕ (ДополнительныеСвойства.Свойство("НужноВыгружать", НужноВыгружать) И НужноВыгружать) Тогда Возврат КонецЕсли; 
		
	Если Получатели.Количество()>0 Тогда					
		ПланыОбмена.ЗарегистрироватьИзменения(Получатели, Движения.СтатусыКМ_ЧЗ);
		ПланыОбмена.ЗарегистрироватьИзменения(Получатели, Движения.СтатусыКМ_Факт);		
	КонецЕсли;
КонецПроцедуры //ЗарегистрироватьИзменения_Статусы()
 
Функция ОпределитьПолучателей()
	ИмяПланаОбмена	= "ДанныеЧЗ";
	Получатели		= Новый Массив;
	
	Если Маркировка_ПИ.ТипТекущегоУзла() = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда	
		Если ЗначениеЗаполнено(ПодразделениеНанесения) Тогда
			Если ТипЗнч(ПодразделениеНанесения) = Тип("СправочникСсылка.Подразделения") Тогда
				УзелПодразделения = Маркировка_ПИ.УзелПодразделения(ПодразделениеНанесения, ИмяПланаОбмена);
				Если ЗначениеЗаполнено(УзелПодразделения) Тогда
					Получатели.Добавить(УзелПодразделения);
				КонецЕсли;
			КонецЕсли; 			
		КонецЕсли;
	Иначе
		Если СокрЛП(КодУзлаСоздания) = СокрЛП(Маркировка_ПИ.ЭтотУзел_Код()) Тогда
			Получатели = Маркировка_ПИ.ПолучитьМассивУзловПоТипу(Перечисления.ТипУзлаИБ.УправляющееПодразделение, ИмяПланаОбмена);
		КонецЕсли; 
	КонецЕсли;
	
	Получатели2 = Новый Массив;
	ЭтотУзел 	= Маркировка_ПИ.ЭтотУзел(ИмяПланаОбмена);
	
	Для Каждого Получатель Из Получатели Цикл
		Если Получатель <> ЭтотУзел Тогда
			Получатели2.Добавить(Получатель);					
		КонецЕсли;	
	КонецЦикла; 
	
	Возврат Получатели2;
КонецФункции //ОпределитьПолучателей()
 
Функция НайтиСоздатьКодАТК()       
	Результат = Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(АТК) И ШтрихкодыУпаковок.Количество()>0 Тогда	
		Менеджер = Справочники.ШтрихкодыУпаковокТоваров;
		Результат = Менеджер.НайтиПоНаименованию(АТК, Истина);
		Если Результат.Пустая() Тогда
			КодАТК 				= Менеджер.СоздатьЭлемент();					
			КодАТК.Наименование = СокрЛП(АТК);
		Иначе                                               
			КодАТК 				= Результат.ПолучитьОбъект();
		КонецЕсли;
		
		КодАТК.ЗначениеШтрихкода = АТК;
		КодАТК.ТипКода 		= Перечисления.ТипыКодовМаркировки.АТК;
		КодАТК.Владелец		= Товары[0].Номенклатура;
		
		КодАТК.СпособВводаВОборот	= Перечисления.СпособыВводаВОборотСУЗ.Импорт;		
		
		КодАТК.Партия		= ДокументОснование;
		КодАТК.Количество	= ШтрихкодыУпаковок.Количество();
		
		Попытка
			КодАТК.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
			
		Результат = КодАТК.Ссылка;		
	КонецЕсли;        
	
	Возврат Результат;
КонецФункции //НайтиСоздатьКодАТК()

Функция ПроверитьСоздатьКодыАгрегации()
	Запрос 		= Документы.МаркировкаТоваровИСМП.СоздатьЗапрос_АгрегационныеКодыПоОперации(Ссылка);	
	рЗапроса 	= Запрос.Выполнить();	
	
	Выборка_КодАгрегации = рЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "КодАгрегации");	
	
	Пока Выборка_КодАгрегации.Следующий() Цикл
		КодАгрегации = СокрЛП(Выборка_КодАгрегации.КодАгрегации);
		Если КодАгрегации = "9999" Тогда Продолжить КонецЕсли; 
		
		Если Выборка_КодАгрегации.КМ_Коробка = NULL Тогда				
			СпрОбъект = Справочники.ШтрихкодыУпаковокТоваров.СоздатьЭлемент();				
			
			СпрОбъект.Наименование		= КодАгрегации;
			СпрОбъект.ЗначениеШтрихкода	= КодАгрегации;
			
			СпрОбъект.Владелец		= Выборка_КодАгрегации.Номенклатура;
			СпрОбъект.ТипУпаковки	= ?(Выборка_КодАгрегации.КоличествоНоменклатуры>1, Перечисления.ТипыУпаковок.МультитоварнаяУпаковка, Перечисления.ТипыУпаковок.МонотоварнаяУпаковка);
			СпрОбъект.ТипКода 		= Перечисления.ТипыКодовМаркировки.ЛогистическаяУпаковка;
			СпрОбъект.ТипШК			= Перечисления.ТипыШтрихКодов.Коробка;				
			СпрОбъект.СпособВводаВОборот = Выборка_КодАгрегации.СпособВводаВОборот;
			
			СпрОбъект.Количество	= Выборка_КодАгрегации.КМ_Штука;             				
			
			СпрОбъект.ЗаказКМ		= Выборка_КодАгрегации.ДокАгрегации;
			СпрОбъект.Партия		= ДокументОснование;
			
			Выборка 				= Выборка_КодАгрегации.Выбрать();				
			Пока Выборка.Следующий() Цикл
				СтрокаПК = СпрОбъект.ВложенныеШтрихкоды.Добавить();				
				СтрокаПК.Штрихкод = Выборка.КМ_Штука;
			КонецЦикла; 
			
			СпрОбъект.Записать();
			
			ТекКодКоробки = СпрОбъект.Ссылка;				
		Иначе
			ТекКодКоробки = Выборка_КодАгрегации.КМ_Коробка;
		КонецЕсли;		 
	КонецЦикла;
	
	Если ЕстьНеЗаполненныеКодыКоробок() Тогда
		ПрописатьКодыКоробокВТЧ(); 	
	КонецЕсли;
КонецФункции //ПроверитьСоздатьКодыАгрегации()

Функция ЕстьНеЗаполненныеКодыКоробок()
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ	
	|	КодАгрегации,
	|	ШтрихкодКоробки
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка = &Ссылка
	|	И КодАгрегации <> """"
	|	И ШтрихкодКоробки = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат (Выборка.Количество() > 0);
КонецФункции //ЕстьНеЗаполненныеКодыКоробок() 

Процедура ПрописатьКодыКоробокВТЧ()
	КодыАгрегации = ПолучитьКодыАгрегации();
	
	сШтрихКодыКоробок = Новый Соответствие;	
	
	Для Каждого СтрокаКА Из КодыАгрегации Цикл
		Если ЗначениеЗаполнено(СтрокаКА.ШтрихкодУпаковки) Тогда				
			сШтрихКодыКоробок[СтрокаКА.КодАгрегации] = СтрокаКА.ШтрихкодУпаковки;
		КонецЕсли;				
	КонецЦикла;
	
	НадоЗаписать = Ложь;
	Для Каждого СтрокаТЧ Из ШтрихкодыУпаковок Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.КодАгрегации) И НЕ ЗначениеЗаполнено(СтрокаТЧ.ШтрихкодКоробки)  Тогда
			ШтрихкодКоробки = сШтрихКодыКоробок[СтрокаТЧ.КодАгрегации];
			Если ЗначениеЗаполнено(ШтрихкодКоробки) Тогда			
				СтрокаТЧ.ШтрихкодКоробки = ШтрихкодКоробки;
				НадоЗаписать = Истина;
			КонецЕсли;
		КонецЕсли; 			
	КонецЦикла;
	
	Если НадоЗаписать Тогда
		Записать(РежимЗаписиДокумента.Запись);	
	КонецЕсли; 
КонецПроцедуры //ПрописатьКодыКоробокВТЧ()
 

Функция ПроверитьЗабронироватьКодыАгрегации()
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Если ШтрихкодыУпаковок.Количество() = 0 Тогда //Бронируем номера
		НомерКА	= Документы.МаркировкаТоваровИСМП.ПолучитьПоследнийКодАгрегации(Организация);
		ГЛН		= Лев(Справочники.КодыGLN.ПолучитьДействующийГЛН(Организация), 9);
		
		Для Сч = 1 По КоличествоКодовSSCC Цикл
			СтрокаТЧ = ШтрихкодыУпаковок.Добавить();	
			СтрокаТЧ.КодАгрегации = Документы.МаркировкаТоваровИСМП.СформироватьSSCC(ГЛН, НомерКА + Сч); 
		КонецЦикла;
		
		Записать();
	КонецЕсли;
	
	//Записываем в справочник
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТЧ.НомерСтроки		КАК НомерСтроки,
	|	ТЧ.КодАгрегации		КАК КодАгрегации,
	|	Спр.Ссылка			КАК КМ_Ссылка
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК ТЧ
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	Справочник.ШтрихкодыУпаковокТоваров КАК Спр
	|ПО
	|	ТЧ.КодАгрегации		= Спр.Наименование
	|	И Спр.ЗаказКМ		= ТЧ.Ссылка		
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка	
	|";
	
	Успешно = Истина;
	
	НачатьТранзакцию();
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.КМ_Ссылка = Null Тогда
			Попытка
				КМ_Ссылка = СоздатьКодАгрегации(Выборка.КодАгрегации);
			Исключение
				Результат.Успешно = Ложь;
				Результат.Ошибки.Добавить(ОписаниеОшибки());
			КонецПопытки;			
		Иначе		
			КМ_Ссылка = Выборка.КМ_Ссылка;
		КонецЕсли; 		
		
		ТекСтрока = ШтрихкодыУпаковок[Выборка.НомерСтроки-1];
		Если ТекСтрока.ШтрихкодУпаковки.Пустая() Тогда
			ТекСтрока.ШтрихкодУпаковки = КМ_Ссылка;		
		КонецЕсли;
	КонецЦикла;
	
	Если Результат.Успешно Тогда
		Если Статус <> Перечисления.СтатусыДокументовМаркировки.Обработан Тогда
			Статус = Перечисления.СтатусыДокументовМаркировки.Обработан;		
		КонецЕсли; 
		Если Модифицированность() Тогда
			Записать();	
		КонецЕсли; 	
		ЗафиксироватьТранзакцию();	
	КонецЕсли;
	
	//Валетов + 03,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3468 
	Если Статус = Перечисления.СтатусыДокументовМаркировки.Обработан И ОбработанВпервые() Тогда
		УзелПолучатель = ОпределитьПолучателяКодов();
		
		ТипУзлаПолучателя = ПолучитьРеквизитШапки(УзелПолучатель, "ТипУзла");
		Если ТипУзлаПолучателя = Перечисления.ТипУзлаИБ.Склад Тогда
			
			ЗаписиСтатусовФакт = РегистрыСведений.СтатусыКМ_Факт.СоздатьНаборЗаписей();
			ЗаписиСтатусовФакт.Отбор.Регистратор.Установить(Ссылка, Истина);
			
			ПланыОбмена.ЗарегистрироватьИзменения(УзелПолучатель, ЗаписиСтатусовФакт);	
			ПланыОбмена.ЗарегистрироватьИзменения(УзелПолучатель, Ссылка);
		КонецЕсли;  
	КонецЕсли;
    //Валетов -
		
	Возврат Результат;	
КонецФункции //ПроверитьСоздатьКодыАгрегации()

Функция СоздатьКодАгрегации(КодАгрегации)
	СпрОбъект = Справочники.ШтрихкодыУпаковокТоваров.СоздатьЭлемент();				
				
	СпрОбъект.Наименование		= СокрЛП(КодАгрегации);
	СпрОбъект.ЗначениеШтрихкода	= СокрЛП(КодАгрегации);		
	
	СпрОбъект.ТипУпаковки			= ТипУпаковки;
	СпрОбъект.ТипКода 				= Перечисления.ТипыКодовМаркировки.ЛогистическаяУпаковка;
	СпрОбъект.ТипШК					= ТипШК;	
	//Валетов + 24,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3522
	СпрОбъект.СпособВводаВОборот	= ?(фКодыАгрегацийДляПоставщиков, Перечисления.СпособыВводаВОборотСУЗ.Импорт, Перечисления.СпособыВводаВОборотСУЗ.МаркировкаОстатков);
	//СпрОбъект.СпособВводаВОборот	= ?(фКодыАгрегацийДляПоставщиков, Перечисления.СпособыВводаВОборотСУЗ.Импорт, Перечисления.СпособыВводаВОборотСУЗ.Перемаркировка);
	//Валетов -
	
	СпрОбъект.ЗаказКМ				= Ссылка;
	
	СпрОбъект.ОбменДанными.Загрузка = Истина;
	СпрОбъект.ДополнительныеСвойства.Вставить("ВидОперации", ВидОперации);
	
	СпрОбъект.Записать();
	
	Возврат СпрОбъект.Ссылка;
КонецФункции //СоздатьКодАгрегации(КодАгрегации)

Функция ПолучитьКодыАгрегации()
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КодАгрегации
	|ПОМЕСТИТЬ ВТ_КодыАгрегации
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка = &Ссылка
	|;	
	|ВЫБРАТЬ
	|	ВТ_КодыАгрегации.КодАгрегации   КАК КодАгрегации,
	|	Спр_ШК.Ссылка 					КАК ШтрихкодУпаковки	
	|ИЗ
	|	ВТ_КодыАгрегации
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	Справочник.ШтрихкодыУпаковокТоваров КАК Спр_ШК
	|ПО 
	|	Спр_ШК.Наименование = ВТ_КодыАгрегации.КодАгрегации
	|	И Спр_ШК.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МонотоварнаяУпаковка)
	|";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции //ПолучитьКодыАгрегации()

Функция ПолучитьШтрихКодыКоробок()
	Запрос = Новый Запрос;
	Запрос.Текст = "	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ	
	|	ШтрихкодКоробки
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок	
	|ГДЕ
	|	Ссылка = &Ссылка
	|	И ШтрихкодКоробки<>ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|УПОРЯДОЧИТЬ ПО
	|	ШтрихкодКоробки.Наименование
	|";	
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШтрихкодКоробки");
КонецФункции //ПолучитьШтрихКодыКоробок()

Функция ПолучитьШтрихКодыНаборов()
	Запрос = Новый Запрос;
	Запрос.Текст = "	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ	
	|	ШтрихкодНабора,
	|	ШтрихкодНабора.ТипШК	КАК ТипШК,
	|	ШтрихкодНабора.Владелец КАК Номенклатура,
	|	ШтрихкодНабора.Владелец.Родитель.ВидКомплекта КАК ВидКомплекта		
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок	
	|ГДЕ
	|	Ссылка = &Ссылка	
	|	И ШтрихкодНабора.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор)
	|УПОРЯДОЧИТЬ ПО
	|	ШтрихкодНабора.Наименование
	|";
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции //ПолучитьШтрихКодыНаборов()

Функция ЗаполнитьТоварыПо_ЗПС(ЗПС_Ссылка)
	Товары.Очистить();
	//++Данилова Е.В. 19.02.2025  MARK-1454
	Если ВидОперации = Перечисления.ВидыОперацийМаркировки.АТК Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
		|	ЗаказПоставщикуТовары.Номенклатура.ГТИН КАК ГТИН,
		|	СУММА(ЗаказПоставщикуТовары.Заявка) КАК Количество
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправ
		|		ПО ЗаказПоставщикуТовары.Номенклатура = НоменклатураСправ.Ссылка
		|			И (НоменклатураСправ.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
		|		ПО (НоменклатураКоплектующие.Номенклатура = ЗаказПоставщикуТовары.Номенклатура)
		|			И (НоменклатураКоплектующие.Ссылка.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект)) 
		//++Данилова Е.В. 04.06.2025  MARK-2355 
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправКомплектыСпайки
		|		ПО ЗаказПоставщикуТовары.Номенклатура = НоменклатураСправКомплектыСпайки.Ссылка
		|			И (НоменклатураСправКомплектыСпайки.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующиеСпайки
		|		ПО (НоменклатураКоплектующиеСпайки.Номенклатура = ЗаказПоставщикуТовары.Номенклатура)
		|			И (НоменклатураКоплектующиеСпайки.Ссылка.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)) 
		//--Данилова Е.В. 04.06.2025
		|ГДЕ
		|	ЗаказПоставщикуТовары.Ссылка = &ЗПС_Ссылка
		//++Данилова Е.В. 25.06.2025 MARK-2484 
		//|	И НоменклатураСправ.Ссылка ЕСТЬ NULL 
		|	И ВЫБОР
		|			КОГДА НоменклатураСправ.РазныеТНВЭДВКомплекте
		|				ТОГДА НоменклатураСправ.Ссылка ЕСТЬ NULL
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ 
		//--Данилова Е.В. 25.06.2025
		|	И НоменклатураКоплектующие.Ссылка ЕСТЬ NULL  
		//++Данилова Е.В. 04.06.2025  MARK-2355
		|	И НоменклатураКоплектующиеСпайки.Ссылка ЕСТЬ NULL
		|	И ВЫБОР
		|			КОГДА НоменклатураСправКомплектыСпайки.РазныеТНВЭДВКомплекте
		|				ТОГДА НоменклатураСправКомплектыСпайки.Ссылка ЕСТЬ NULL
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ 
		//--Данилова Е.В. 04.06.2025
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПоставщикуТовары.Номенклатура,
		|	ЗаказПоставщикуТовары.Номенклатура.ГТИН
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказПоставщикуТовары.Номенклатура.Наименование";
	//--Данилова Е.В. 19.02.2025	
	Иначе 		
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
		|	ЗаказПоставщикуТовары.Номенклатура.ГТИН КАК ГТИН,
		|	СУММА(ЗаказПоставщикуТовары.Заявка) КАК Количество
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|ГДЕ
		|	ЗаказПоставщикуТовары.Ссылка = &ЗПС_Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПоставщикуТовары.Номенклатура,
		|	ЗаказПоставщикуТовары.Номенклатура.ГТИН
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказПоставщикуТовары.Номенклатура.Наименование";
	КонецЕсли;
	Запрос.УстановитьПараметр("ЗПС_Ссылка", ЗПС_Ссылка);
	
	Товары.Очистить();
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецФункции //ЗаполнитьТоварыПо_ЗПС(ЗПС_Ссылка)

Функция ЗаполнитьТоварыПоКМ() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "	
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_КМ ИЗ &ШтрихкодыУпаковок КАК ШтрихкодыУпаковок
	|;
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки.Владелец КАК Номенклатура,
	|	СУММА(1) КАК Количество
	|ИЗ
	|	ВТ_КМ	
	|ГДЕ
	|	ШтрихкодУпаковки.Владелец <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	ШтрихкодУпаковки.Владелец
	|УПОРЯДОЧИТЬ ПО
	|	ШтрихкодУпаковки.Владелец.Наименование
	|";	
	
	Запрос.УстановитьПараметр("ШтрихкодыУпаковок", ШтрихкодыУпаковок);
	
	Цены = Новый Соответствие;
	Для Каждого СтрокаТЧ Из Товары Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Цена) Тогда
			Цены[СтрокаТЧ.Номенклатура] = СтрокаТЧ.Цена;		
		КонецЕсли;	
	КонецЦикла;
	
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());	
	
	Для Каждого СтрокаТЧ Из Товары Цикл
		СтрокаТЧ.Цена = Цены[СтрокаТЧ.Номенклатура];	
	КонецЦикла; 
КонецФункции

Функция ЗаполнитьШКпоЗаказуНаЭмиссию(ЗаказНаЭмиссию) Экспорт	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	               |ПОМЕСТИТЬ ВТ_ОформленныеКМ
	               |ИЗ
	               |	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
	               |ГДЕ
	               |	(МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.ВводВОборот)
	               |			ИЛИ МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Перемаркировка))
	               |	И МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка.ДокументОснование = &ЗаказНаЭмиссию
	               |	И МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка <> &Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВсеКоды.Ссылка.Владелец КАК Номенклатура,
	               |	ВсеКоды.Ссылка КАК ШтрихкодУпаковки
	               |ИЗ
	               |	Справочник.ШтрихкодыУпаковокТоваров КАК ВсеКоды
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОформленныеКМ КАК ВТ_ОформленныеКМ
	               |		ПО (ВТ_ОформленныеКМ.ШтрихкодУпаковки = ВсеКоды.Ссылка)
	               |ГДЕ
	               |	ВсеКоды.ЗаказКМ = &ЗаказНаЭмиссию
	               |	И ВТ_ОформленныеКМ.ШтрихкодУпаковки ЕСТЬ NULL
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВсеКоды.Владелец.Наименование
	               |ИТОГИ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодУпаковки)
	               |ПО
	               |	Номенклатура";
	
	Запрос.УстановитьПараметр("ЗаказНаЭмиссию", ЗаказНаЭмиссию);
	Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
	
	ШтрихкодыУпаковок.Очистить();	
	
	МаксЧислоСтрок	= 95000;
	ОформленоСтрок	= 0;
	ВсегоСтрок 		= 0;
	
	Выборка_Номенклатура = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Номенклатура");
	Пока Выборка_Номенклатура.Следующий() Цикл
		ВсегоСтрок = ВсегоСтрок + Выборка_Номенклатура.ШтрихкодУпаковки;		
		Если ВсегоСтрок <= МаксЧислоСтрок Тогда			
			Выборка = Выборка_Номенклатура.Выбрать();			
			Пока Выборка.Следующий() Цикл
				СтрокаТЧ = ШтрихкодыУпаковок.Добавить();							
				СтрокаТЧ.ШтрихкодУпаковки = Выборка.ШтрихкодУпаковки;
			КонецЦикла;			
		КонецЕсли;
	КонецЦикла;
	
	Если ВсегоСтрок > МаксЧислоСтрок Тогда
		ТекстСообщения = СтрШаблон("Превышено максимально возможное число строк в документе ! 
		|К оформлению %1, максимум: %2.
		|Запишите документ и оформите еще один.", ВсегоСтрок, МаксЧислоСтрок);
		Сообщить(ТекстСообщения, СтатусСообщения.Важное);
	КонецЕсли;
КонецФункции //ЗаполнитьШКпоЗаказуНаЭмиссию(ЗаказНаЭмиссию) Экспорт

Функция ЗаполнитьПоЛистуНабора(ЛистНабора) Экспорт	        	
	ВидОперации 	= Перечисления.ВидыОперацийМаркировки.Агрегация;
	ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.Агрегация;
	ТипДокумента	= Перечисления.ТипыДокументовИСМП.ТоварнаяНакладная;
	
	рПолучения		= Документы.ХранилищеКодовМаркировки.ПолучитьКМпоЛистуНабора(ЛистНабора);	
	
	Если рПолучения.КоличествоНоменклатуры > 1 Тогда	
		ТипУпаковки	= Перечисления.ТипыУпаковок.МультитоварнаяУпаковка;		
	Иначе		
		ТипУпаковки	= Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
	КонецЕсли;	
	
	рШапки			= ПолучитьРеквизитыШапки(ЛистНабора, "ДокОснование,Склад.Подразделение");
	Местонахождение = рШапки.Склад_Подразделение;
	Накладная		= рШапки.ДокОснование;
	ЗаданиеНаМаркировку = НайтиДокумент("ЗаданиеНаМаркировку", Новый Структура("ДокОснование", Накладная));
	
	рПоискаКоробки	= Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныйКод_Коробка(ТипУпаковки, ЗаданиеНаМаркировку);	
	
	ШтрихкодыУпаковок.Очистить();
	Если рПоискаКоробки.Успешно Тогда		
		КодАгрегации = ПолучитьРеквизитШапки(рПоискаКоробки.Данные, "Наименование"); 
		Для Каждого ШтрихкодУпаковки Из рПолучения.КодыМаркировки Цикл
			СтрокаТЧ = ШтрихкодыУпаковок.Добавить();
			СтрокаТЧ.ШтрихкодУпаковки	= ШтрихкодУпаковки; 
			СтрокаТЧ.КодАгрегации		= КодАгрегации;
		КонецЦикла;		
	Иначе				
		Сообщить(СтрСоединить(рПоискаКоробки.Ошибки, Символы.ПС), СтатусСообщения.Важное);		
	КонецЕсли;
	
КонецФункции //ЗаполнитьПоЛистуНабора(ЛистНабора) Экспорт

Функция ЗаполнитьПоПНК(ПНК) Экспорт
	ТипДокумента	= Перечисления.ТипыДокументовИСМП.ТоварнаяНакладная;
	
	рШапки 			= ПолучитьРеквизитыШапки(ПНК, "Контрагент.СтранаРегистрации,Контрагент.ИННИностранногоКонтрагента,Контрагент.СтранаРегистрации.УчастникЕАЭС,КодОперации,Склад");
	
	ПодразделениеНанесения = Маркировка_ПИ.ФизическоеПодразделениеСклада(рШапки.Склад);
	Если рШапки.КодОперации = Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя Тогда
		ВидОперации = Перечисления.ВидыОперацийМаркировки.ВозвратВОборот;
	КонецЕсли; 
	
	Если ОбщегоНазначения_ПИ.ЭтоУзел_Склад() ИЛИ ОбщегоНазначения_ПИ.ЭтоУзел_СкладФилиала() Тогда
		ЗаполнитьШКпоЛН(ПНК);
	Иначе		
		ЗаполнитьШКпоХКМ(ПНК);		
	КонецЕсли; 
	
КонецФункции //ЗаполнитьПоПНК(ПНК) Экспорт

Функция ЗаполнитьПоПРМ(ПРМ) Экспорт	        	
	ВидОперации 	= Перечисления.ВидыОперацийМаркировки.ВыводИзОборота;
	ВидОперацииИСМП	= Перечисления.ВидыОперацийИСМП.ВыводИзОборота_Прочее;	
	
	ЗаполнитьШКпоЛН(ПРМ);	
КонецФункции //ЗаполнитьПоЗСБ(ЗаказНаЭмиссию) Экспорт

Функция ЗаполнитьПоРНК(РНК)
	ВидОперации 	= Перечисления.ВидыОперацийМаркировки.ВыводИзОборота;
	ТипДокумента	= Перечисления.ТипыДокументовИСМП.ТоварнаяНакладная;
	
	рШапки 			= ПолучитьРеквизитыШапки(РНК, "ДистанционнаяПродажа,Контрагент.СтранаРегистрации,Контрагент.ИННИностранногоКонтрагента,Контрагент.СтранаРегистрации.УчастникЕАЭС,Склад.Подразделение");
	ПодразделениеНанесения = ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла();
	
	ДистанционнаяПродажа = ПолучитьРеквизитШапки(РНК, "ДистанционнаяПродажа");
	Если ДистанционнаяПродажа Тогда
		ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ДистанционнаяПродажа;	
	Иначе
		Если рШапки.Контрагент_СтранаРегистрации = Справочники.КлассификаторСтранМира.Россия Тогда
			ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_Прочее;
		Иначе
			Если рШапки.Контрагент_СтранаРегистрации_УчастникЕАЭС = Истина Тогда
				ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ТрансграничнаяПродажаВСтраныЕАЭС;
				Страна			= рШапки.Контрагент_СтранаРегистрации;
				ИмпортерИД		= рШапки.Контрагент_ИННИностранногоКонтрагента;
			Иначе
				ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ЭкспортЗаПределыСтранЕАЭС;				
			КонецЕсли; 
		КонецЕсли;		
	КонецЕсли;
	
	// Кухарь А.Ю.  08.04.2025 начало
	Если Организация = Маркировка_ПИ.ОрганизацияБТК() Тогда	
		Организация = Маркировка_ПИ.ОрганизацияЕЕЭ();
	КонецЕсли;	
	// Кухарь А.Ю.  08.04.2025 конец	
КонецФункции //ЗаполнитьПоРНК(ЗаказНаЭмиссию) Экспорт

Функция ЗаполнитьПоСПН(СПН) Экспорт	        	
	ВидОперации 	= Перечисления.ВидыОперацийМаркировки.ВыводИзОборота;
	ВидОперацииИСМП	= Перечисления.ВидыОперацийИСМП.ВыводИзОборота_Утрата;
	
	ТипДокумента	= Перечисления.ТипыДокументовИСМП.Прочее;
	
	//+++Чирков 17.10.2025 MARK-3106
	ПодразделениеНанесения = ПолучитьРеквизитШапки(СПН, "Склад.Подразделение");
	//---Чирков 17.10.2025
	
	ЗаполнитьШКпоЛН(СПН);	
КонецФункции //ЗаполнитьШКпоСПН(ЗаказНаЭмиссию) Экспорт

Функция ЗаполнитьПоЗНМ(ЗНМ, ДопПараметры = Неопределено) Экспорт	        	
	ВидОперации 	= Перечисления.ВидыОперацийМаркировки.Агрегация;
	ВидОперацииИСМП	= Перечисления.ВидыОперацийИСМП.Агрегация;	
	ПодразделениеНанесения = ПолучитьРеквизитШапки(ЗНМ, "Подразделение");
	
	ТипШК = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ТипШК", ТипШК);
	
	ЗаполнитьШКпоЗНМ(ЗНМ, ДопПараметры);	
КонецФункции //ЗаполнитьШКпоСПН(ЗаказНаЭмиссию) Экспорт

Функция ЗаполнитьПоЗСБ(ЗаданиеНаСборку) Экспорт	        	
	ВидОперации 	= Перечисления.ВидыОперацийМаркировки.ФормированиеНабора;
	ВидОперацииИСМП	= Перечисления.ВидыОперацийИСМП.ФормированиеНабора;	
	
	Если Организация = Маркировка_ПИ.ОрганизацияБТК() Тогда
		Организация = Маркировка_ПИ.ОрганизацияЕЕЭ();	
	КонецЕсли;
	
	ЗаполнитьШКпоЗСБ(ЗаданиеНаСборку);	
КонецФункции //ЗаполнитьПоЗСБ(ЗаказНаЭмиссию) Экспорт

Функция ЗаполнитьПоРКМ(РКМ) Экспорт
	ВидОперации 	= Перечисления.ВидыОперацийМаркировки.ВозвратВОборот;
	ТипДокумента	= Перечисления.ТипыДокументовИСМП.ТоварнаяНакладная;
	
	ДокОснование 	= ПолучитьРеквизитШапки(РКМ, "ДокОснование");
	
	Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		рШапки 			= ПолучитьРеквизитыШапки(ДокОснование, "ДистанционнаяПродажа,Контрагент.СтранаРегистрации,Контрагент.ИННИностранногоКонтрагента,Контрагент.СтранаРегистрации.УчастникЕАЭС,Склад.Подразделение");
		ПодразделениеНанесения = ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла();	
		
		ДистанционнаяПродажа = рШапки.ДистанционнаяПродажа;
		Если ДистанционнаяПродажа Тогда
			ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВозвратВОборот_Возврат_ДистанционнаяПродажа;
		КонецЕсли;	
	КонецЕсли;	
КонецФункции //ЗаполнитьПоРКМ(РКМ) Экспорт

Процедура ЗаполнитьШКпоЛН(ДокСсылка)
	ШтрихкодыУпаковок.Очистить();
	
	мШК = Документы.ХранилищеКодовМаркировки.ПолучитьКМпоЛистамНабора(ДокСсылка, 0);
	
	Для Каждого ШтрихКодУпаковки Из мШК Цикл
		СтрокаТЧ = ШтрихкодыУпаковок.Добавить();
		СтрокаТЧ.ШтрихкодУпаковки = ШтрихКодУпаковки;	
	КонецЦикла;	
КонецПроцедуры

Процедура ЗаполнитьШКпоХКМ(ДокСсылка)
	ШтрихкодыУпаковок.Очистить();
	
	мШК = Документы.ХранилищеКодовМаркировки.ПолучитьКМпоХКМ(ДокСсылка, 0);
	
	Для Каждого ШтрихКодУпаковки Из мШК Цикл
		СтрокаТЧ = ШтрихкодыУпаковок.Добавить();
		СтрокаТЧ.ШтрихкодУпаковки = ШтрихКодУпаковки;	
	КонецЦикла;	
КонецПроцедуры

Процедура ЗаполнитьШКпоЗНМ(ДокСсылка, ДопПараметры)
	УпрощенныйРежим = ПолучитьРеквизитШапки(ДокСсылка, "фУпрощенныйРежим");
	Если УпрощенныйРежим Тогда
		ЗаполнитьШКпоЗНМ_Упр(ДокСсылка, ДопПараметры);
	Иначе
		ЗаполнитьШКпоЗНМ_Обычный(ДокСсылка);
	КонецЕсли;
КонецПроцедуры
	
Процедура ЗаполнитьШКпоЗНМ_Обычный(ДокСсылка)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки					КАК ШтрихкодУпаковки,
	|	Ссылка.ШтрихкодКоробки.Наименование КАК КодАгрегации
	|ИЗ
	|	Документ.ЛистМаркировкиОстатков.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка.ДокОснование = &ДокСсылка
	|	И НЕ Ссылка.ЕстьОшибки
	|	И Ссылка.Завершен
	|	И Ссылка.Проведен
	|	И НЕ Ссылка.НеПолный
	|	И Ссылка.ШтрихкодКоробки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|УПОРЯДОЧИТЬ ПО
	|	КодАгрегации,
	|	ШтрихкодУпаковки.Наименование	
	|";
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	ШтрихкодыУпаковок.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаКМ = ШтрихкодыУпаковок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКМ, Выборка);
	КонецЦикла;
КонецПроцедуры //ЗаполнитьШКпоЗНМ(ДокСсылка)  

Процедура ЗаполнитьШКпоЗНМ_Упр(ДокСсылка, ДопПараметры = Неопределено)	
	Запрос = Новый Запрос;
	
	Если ТипШК = Перечисления.ТипыШтрихКодов.Блочок Тогда
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ШтрихкодУпаковки				КАК ШтрихкодУпаковки,
		|	ШтрихкодБлочка.Наименование 	КАК КодАгрегации,
		|	ШтрихкодБлочка					КАК ШтрихкодКоробки
		|ИЗ
		|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок
		|ГДЕ
		|	Ссылка = &ДокСсылка
		|	И Ссылка.Проведен	
		|	И ШтрихкодБлочка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
		|УПОРЯДОЧИТЬ ПО
		|	КодАгрегации,
		|	ШтрихкодУпаковки.Наименование	
		|";			
	ИначеЕсли ТипШК = Перечисления.ТипыШтрихКодов.Коробка Тогда
		фАгрегироватьБлочки = ПолучитьРеквизитШапки(ДокСсылка, "фАгрегироватьБлочки");
		
		ПолеШК = ?(фАгрегироватьБлочки, "ШтрихкодБлочка", "ШтрихкодУпаковки");
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	" + ПолеШК + "					КАК ШтрихкодУпаковки,
		|	ШтрихкодКоробки.Наименование 	КАК КодАгрегации,
		|	ШтрихкодКоробки					КАК ШтрихкодКоробки
		|ИЗ
		|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок
		|ГДЕ
		|	Ссылка = &ДокСсылка
		|	И Ссылка.Проведен	
		|	И ШтрихкодКоробки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
		|УПОРЯДОЧИТЬ ПО
		|	КодАгрегации,
		|	" + ПолеШК + ".Наименование	
		|";		
	ИначеЕсли ТипШК = Перечисления.ТипыШтрихКодов.Палета Тогда
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШтрихкодКоробки					КАК ШтрихкодУпаковки,
		|	ШтрихкодПалеты.Наименование 	КАК КодАгрегации,
		|	ШтрихкодПалеты					КАК ШтрихкодКоробки
		|ИЗ
		|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок
		|ГДЕ
		|	Ссылка = &ДокСсылка
		|	И Ссылка.Проведен	
		|	И ШтрихкодПалеты <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
		|УПОРЯДОЧИТЬ ПО
		|	КодАгрегации,
		|	ШтрихкодКоробки.Наименование	
		|";	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	ШтрихкодыУпаковок.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаКМ = ШтрихкодыУпаковок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКМ, Выборка);
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьШКпоЗСБ(ЗаданиеНаСборку)
	Запрос = Новый Запрос;
	Запрос.Текст =
	//++Данилова Е.В. 15.08.2025 MARK-1756 
	//"
	//|ВЫБРАТЬ
	//|	ШтрихкодУпаковки	КАК ШтрихкодУпаковки,
	//|	ШтрихкодКомплекта   КАК ШтрихкодНабора	
	//|ИЗ
	//|	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок
	//|ГДЕ
	//|	Ссылка.ДокОснование = &ЗаданиеНаСборку
	//|	И Ссылка.Завершен И Ссылка.Проведен	
	//|	И ШтрихкодУпаковки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	//|УПОРЯДОЧИТЬ ПО
	//|	ШтрихкодКомплекта.Владелец.Наименование,
	//|	ШтрихкодУпаковки.Наименование	
	//|";  
	"ВЫБРАТЬ
	|	ВложенныеШтрихкодыШК.Штрихкод КАК ШтрихкодУпаковки,
	|	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта КАК ШтрихкодНабора,
	//++Данилова Е.В. 24.11.2025  HELP-7949 
	|	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШКГН  
	//--Данилова Е.В. 24.11.2025 
	|ПОМЕСТИТЬ ВтГотовыеНаборы
	|ИЗ
	|	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО (СпрНоменклатура.Ссылка = ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец)
	|			И (СпрНоменклатура.Родитель.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШтрихкодыШК
	|		ПО (ВложенныеШтрихкодыШК.Ссылка = ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки)
	|ГДЕ
	|	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.ДокОснование = &ЗаданиеНаСборку
	|	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.Завершен
	|	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.Проведен
	|	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|	ВложенныйЗапрос.ШтрихкодНабора КАК ШтрихкодНабора
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|		ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта КАК ШтрихкодНабора
	|	ИЗ
	|		Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ПО (СпрНоменклатура.Ссылка = ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец)
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВтГотовыеНаборы КАК ВтГотовыеНаборы
	|			ПО (ВтГотовыеНаборы.ШтрихкодНабора = ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта) 
	//++Данилова Е.В. 24.11.2025  HELP-7949
	|			И ВтГотовыеНаборы.ШКГН = ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки 
	//--Данилова Е.В. 24.11.2025
	|	ГДЕ
	|		ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.ДокОснование = &ЗаданиеНаСборку
	|		И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.Завершен
	|		И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.Проведен
	|		И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|		И ВтГотовыеНаборы.ШтрихкодУпаковки ЕСТЬ NULL
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	//Данилова Е.В. 24.11.2025  HELP-7949
	|	ВЫБРАТЬ  РАЗЛИЧНЫЕ  
	|		ВтГотовыеНаборы.ШтрихкодУпаковки,
	|		ВтГотовыеНаборы.ШтрихкодНабора
	|	ИЗ
	|		ВтГотовыеНаборы КАК ВтГотовыеНаборы) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.ШтрихкодНабора.Владелец.Наименование,
	|	ВложенныйЗапрос.ШтрихкодУпаковки.Наименование"; 
	 //--Данилова Е.В. 15.08.2025
	Запрос.УстановитьПараметр("ЗаданиеНаСборку", ЗаданиеНаСборку);
	
	ШтрихкодыУпаковок.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаКМ = ШтрихкодыУпаковок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКМ, Выборка);
	КонецЦикла;
КонецПроцедуры //ЗаполнитьШКпоЗНМ(ДокСсылка)  

Функция ЗаполнитьТоварыПоНакладной(ДокСсылка, ИмяТЧ = "Товары")
	МетаДок     = ДокСсылка.Метаданные();
	МетаТЧ 		= МетаДок.ТабличныеЧасти[ИмяТЧ];
	КолВсего    = ?(МетаТЧ.Реквизиты.Найти("Всего")<>Неопределено, "Всего", "0");
	
	Товары.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Номенклатура,
	|	СУММА(Количество) КАК Количество,	
	|	ВЫБОР 
	|		КОГДА СУММА(Количество) <> 0 ТОГДА СУММА("+КолВсего+")/СУММА(Количество)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цена
	|ИЗ
	|	" + МетаДок.ПолноеИмя() + "." + ИмяТЧ + "
	|ГДЕ
	|	Ссылка = &ДокСсылка
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура
	|ИМЕЮЩИЕ
	|	СУММА(Количество) > 0
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура.Наименование
	|";
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецФункции //ЗаполнитьТоварыПоНакладной(ДокСсылка)

Функция ОбязательныеРеквизитыДоп()
	Результат = Новый Соответствие;	
	
	Если ВидОперации = Перечисления.ВидыОперацийМаркировки.ВводВОборот Тогда
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			МетаДок = Метаданные.НайтиПоТипу(ТипЗнч(ДокументОснование));
			Если МетаДок.Реквизиты.Найти("СпособВводаВОборот") <> Неопределено Тогда
				СпособВводаВОборот = ПолучитьРеквизитШапки(ДокументОснование, "СпособВводаВОборот", "Документ"); 
				//Валетов + 21,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3522 Добавил ИЛИ
				Если СпособВводаВОборот 	= Перечисления.СпособыВводаВОборотСУЗ.МаркировкаОстатков ИЛИ СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Перемаркировка Тогда			
					Результат["ПодразделениеНанесения"]	= Истина;				
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийМаркировки.ВыводИзОборота Тогда
		
		Результат["ТипДокумента"]		= Истина;
		Результат["ДокументОснование"]	= Истина;	
		
		Если ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_БезвозмезднаяПередача Тогда
			Если ТипДокумента = Перечисления.ТипыДокументовИСМП.Прочее Тогда
				Результат["НаименованиеПервичногоДокумента"] = Истина;
			КонецЕсли; 					
		ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ВозвратФизическомуЛицу Тогда
			Результат["НаименованиеПервичногоДокумента"] = Истина;
		ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ДистанционнаяПродажа Тогда
			Если ТипДокумента = Перечисления.ТипыДокументовИСМП.Прочее Тогда
				Результат["НаименованиеПервичногоДокумента"] = Истина;
			КонецЕсли;
			//++Данилова Е.В. 11.06.2026 №0000001162
			Результат["ПодразделениеНанесения"]	= Истина;
			//--Данилова Е.В. 11.06.2026 	
		ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ТрансграничнаяПродажаВСтраныЕАЭС Тогда
			Результат["ТипДокумента"]	= Ложь;
			Результат["Страна"]			= Истина;
			Результат["ИмпортерИД"]		= Истина;			
		ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ИспользованиеДляСобственныхНужд Тогда
			Результат["НаименованиеПервичногоДокумента"] = Истина;
		ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_Конфискация Тогда
			Если ТипДокумента = Перечисления.ТипыДокументовИСМП.Прочее Тогда
				Результат["НаименованиеПервичногоДокумента"] = Истина;
			КонецЕсли;
		ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ПродажаПоОбразцам Тогда
			Если ТипДокумента = Перечисления.ТипыДокументовИСМП.Прочее Тогда
				Результат["НаименованиеПервичногоДокумента"] = Истина;
			КонецЕсли;
			//++Данилова Е.В. 11.06.2026 №0000001162
			Результат["ПодразделениеНанесения"]	= Истина;
			//--Данилова Е.В. 11.06.2026 
		ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ПродажаПоГосударственномуКонтракту Тогда
			Результат["ТипДокумента"]				= Ложь;
			Результат["ИдентификаторГосКонтракта"]	= Истина;	
		ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ПродажаПоСделкеСГосударственнойТайной Тогда	
			Результат["ТипДокумента"]				= Ложь;
			Результат["ИдентификаторГосКонтракта"]	= Истина;
		ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_Уничтожение Тогда
			Если ТипДокумента = Перечисления.ТипыДокументовИСМП.Прочее Тогда
				Результат["НаименованиеПервичногоДокумента"] = Истина;
			КонецЕсли;
		ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_Утилизация Тогда
			Результат["НаименованиеПервичногоДокумента"] = Истина;
		ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_Утрата Тогда
			Результат["НаименованиеПервичногоДокумента"] = Истина;
		ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ЭкспортЗаПределыСтранЕАЭС Тогда
			Если ТипДокумента = Перечисления.ТипыДокументовИСМП.Прочее Тогда
				Результат["НаименованиеПервичногоДокумента"] = Истина;
			КонецЕсли;
		//++Данилова Е.В. 11.06.2026 №0000001162	
		ИначеЕсли ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_РозничнаяПродажа Тогда
			Результат["ПодразделениеНанесения"]	= Истина;
			//--Данилова Е.В. 11.06.2026 
		КонецЕсли;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийМаркировки.Списание Тогда 
		
		Результат["ТипДокумента"]		= Ложь;
		Результат["ДокументОснование"]	= Истина;	
		
		Результат["ВидОперацииИСМП"]	= Истина;	
		
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции // ()

Функция СформироватьДвиженияРазАгрегации(Движения_СтатусыКМ_Факт)
	Если Статус = Перечисления.СтатусыДокументовМаркировки.Обработан Тогда
		Для Каждого СтрокаТЧ Из ШтрихкодыУпаковок Цикл		
			Движение = Движения.СтатусыКМ_ЧЗ.Добавить();				
						
			Движение.Период 			= Дата;
			
			Движение.ШтрихКодУпаковки	= СтрокаТЧ.ШтрихкодУпаковки;
			Движение.Статус				= Перечисления.СтатусыКодовМаркировкиИСМП.Расформирован;			
		КонецЦикла; 	
	КонецЕсли; 
	
	//+++Чирков 29.09.2025 выравнивание движений по статусам в регистрах штук и коробок
	Для Каждого СтрокаШК Из ПолучитьТаблицуШК(Ссылка) Цикл		
		Движение = Движения_СтатусыКМ_Факт.Добавить();				
					
		Движение.Период 			= Дата;
		
		Движение.ТипШК				= СтрокаШК.ТипШК;
		Движение.ШтрихКодУпаковки	= СтрокаШК.ШтрихкодУпаковки;
		
		Движение.Статус				= Перечисления.СтатусыКодовМаркировкиФакт.Расформирован;
		Движение.Местонахождение	= ПодразделениеНанесения;
		
		Движение_Кор = Движения.СтатусыКМ_Факт_А.Добавить();
		ЗаполнитьЗначенияСвойств(Движение_Кор, Движение);
			
		Движение_Кор.СпособВводаВОборот = СтрокаШК.СпособВводаВОборот;
		//+++Чирков 01.12.2025 ТипУпаковки - убираем
		//Движение_Кор.ТипУпаковки 		= СтрокаШК.ТипУпаковки;
		//---Чирков 01.12.2025
	КонецЦикла;                                                
	//---Чирков 29.09.2025 выравнивание движений по статусам в регистрах штук и коробок
	
	//++Данилова Е.В. 16.12.2025  MARK-3379 		
	ВложенныеКодыНаборов = ПолучитьВложенныеКодыПоНаборам();
	Для каждого СтрокаКодов Из ВложенныеКодыНаборов Цикл
		
		Если СтрокаКодов.Статус = Перечисления.СтатусыКодовМаркировкиФакт.Вложен Тогда
			
			//Валетов + 25,12,2025 ПУСТАЯ ЗАДАЧА Делаем наоборот по требованию маркировки.
			//	СтатусКМВложенного = Перечисления.СтатусыКодовМаркировкиФакт.ГотовКПечати; 	
			//	
			//ИначеЕсли СтрокаКодов.Статус = Перечисления.СтатусыКодовМаркировкиФакт.НанесенВиртуально Тогда
			//	
			//	СтатусКМВложенного = Перечисления.СтатусыКодовМаркировкиФакт.ВОбороте;     
			СтатусКМВложенного = Перечисления.СтатусыКодовМаркировкиФакт.ВОбороте;	
		ИначеЕсли СтрокаКодов.Статус = Перечисления.СтатусыКодовМаркировкиФакт.НанесенВиртуально Тогда
			СтатусКМВложенного = Перечисления.СтатусыКодовМаркировкиФакт.ГотовКПечати;   
			//Валетов -
		Иначе 
			СтатусКМВложенного = СтрокаКодов.Статус; 
		КонецЕсли;
		
		Движение = Движения_СтатусыКМ_Факт.Добавить();				
		
		Движение.Период 			= Дата;
		
		Движение.ТипШК				= СтрокаКодов.ТипШК;
		Движение.ШтрихКодУпаковки	= СтрокаКодов.ШтрихкодУпаковки;
		
		Движение.Статус				= СтатусКМВложенного;
		Движение.Местонахождение	= ПодразделениеНанесения; 		
		
	КонецЦикла;
	//--Данилова Е.В. 16.12.2025 	 
КонецФункции //СформироватьДвиженияРазАгрегации()

Функция ПолучитьКоличествоУникальныхКодовВКолонке(ИмяКолонки)
	Результат = 0;
	КодыКоробок = ШтрихкодыУпаковок.Выгрузить( , ИмяКолонки);
	КодыКоробок.Свернуть(ИмяКолонки);
	КодыКоробок = КодыКоробок.ВыгрузитьКолонку(ИмяКолонки);
	Для каждого мШтрихкодКоробки Из КодыКоробок Цикл
		Если ЗначениеЗаполнено(мШтрихкодКоробки) Тогда
			Результат = Результат + 1;					
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Результат;	
КонецФункции //ПолучитьКоличествоУникальныхКодовВКолонке(ИмяКолонки)

Функция ЗаписатьДвиженияВРегистр_СтатусыКМ_Факт(Движения_СтатусыКМ_Факт)	
	Для Каждого СтрокаТ Из Движения_СтатусыКМ_Факт Цикл
		СтрокаТ.Активность = Истина;	
	КонецЦикла;
	Движения.СтатусыКМ_Факт.Загрузить(Движения_СтатусыКМ_Факт);
	
	Если ОбменДанными.Загрузка Тогда		
		Движения.Записать();
	КонецЕсли; 
КонецФункции

//++Данилова Е.В. 19.02.2025 MARK-1454
Функция ПроверитьГотовыеКомплектыВДокументе(ТаблицаТоваров)  Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыТЧ.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВтТовары
		|ИЗ
		|	&Товары КАК ТоварыТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтТовары.Номенклатура КАК Номенклатура
		|ИЗ
		|	ВтТовары КАК ВтТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
		|		ПО ВтТовары.Номенклатура = НоменклатураСпр.Ссылка
		|			И (НоменклатураСпр.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтТовары.Номенклатура КАК Номенклатура
		|ИЗ
		|	ВтТовары КАК ВтТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
		|		ПО ВтТовары.Номенклатура = НоменклатураСпр.Ссылка
		|			И (НоменклатураСпр.ВидКомплекта <> ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект))";
	
	Запрос.УстановитьПараметр("Товары",ТаблицаТоваров);
	
	РезультатЗапросаПакеты = Запрос.ВыполнитьПакет();
	
	ГотовыеКомплекты =  НЕ РезультатЗапросаПакеты[1].Пустой();  
	
    НеГотовыеКомплекты = НЕ РезультатЗапросаПакеты[2].Пустой();
	
	Возврат Новый Структура("ГотовыеКомплекты, НеГотовыеКомплекты",ГотовыеКомплекты,НеГотовыеКомплекты); 
	
КонецФункции // ПроверитьГотовыеКомплектыВДокументе()

Функция СоздатьНовыйДокументМаркировкиПоГотовымКомплектам(Знач ТоварыТЧ, Знач ТЧШтрихкоды, Знач ПараметрыЗаполнения) Экспорт
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ВЫРАЗИТЬ(ВТТовары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	 |	ВТТовары.ЦЕНА КАК Цена,
	 |	ВТТовары.Количество КАК Количество
	 |ПОМЕСТИТЬ ВТТовары
	 |ИЗ
	 |	&Товары КАК ВТТовары
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВЫРАЗИТЬ(ШтрихкодыУпаковок.ШтрихкодУпаковки КАК Справочник.ШтрихкодыУпаковокТоваров) КАК ШтрихкодУпаковки,
	 |	ШтрихкодыУпаковок.ШтрихкодНабора КАК ШтрихкодНабора
	 |ПОМЕСТИТЬ ВтШКУпаковки
	 |ИЗ
	 |	&ШтрихкодыУпаковок КАК ШтрихкодыУпаковок
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВТТовары.Номенклатура КАК Номенклатура,
	 |	ВТТовары.Цена КАК Цена,
	 |	ВТТовары.Количество КАК Количество
	 |ИЗ
	 |	ВТТовары КАК ВТТовары
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
	 |		ПО ВТТовары.Номенклатура = НоменклатураСпр.Ссылка
	 |			И (НоменклатураСпр.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект))
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВтШКУпаковки.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	 |	ВтШКУпаковки.ШтрихкодНабора КАК ШтрихкодНабора
	 |ИЗ
	 |	ВтШКУпаковки КАК ВтШКУпаковки
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТовары КАК ВТТовары
	 |		ПО ВтШКУпаковки.ШтрихкодУпаковки.Владелец = ВТТовары.Номенклатура
	 |			И (ВТТовары.Номенклатура.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект))";
	 
	 Запрос.УстановитьПараметр("Товары",ТоварыТЧ);
	 Запрос.УстановитьПараметр("ШтрихкодыУпаковок",ШтрихкодыУпаковок);
	 
	 ПакетЗапросов = Запрос.ВыполнитьПакет(); 
	 
	 ВыборкаТовары 	= ПакетЗапросов[2].Выбрать();
	 ВыборкаШК		= ПакетЗапросов[3].Выбрать();
	 
	 НовыйДокумент = Документы.МаркировкаТоваровИСМП.СоздатьДокумент();
	 
	 ЗаполнитьЗначенияСвойств(НовыйДокумент,ПараметрыЗаполнения,"ПодразделениеНанесения,Организация,ДокументОснование,ВидОперации,ВидОперацииИСМП"); 
		 
	 НовыйДокумент.Дата 				= ТекущаяДатаСеанса();	 
	 НовыйДокумент.Статус				= Перечисления.СтатусыДокументовМаркировки.ВРаботе;
	 НовыйДокумент.Автор 				= ПараметрыСеанса.Пользователь;	  
	 НовыйДокумент.ТипУпаковки 			= Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
	  
	 Пока ВыборкаТовары.Следующий() Цикл
		 
		 НоваяСтрока = НовыйДокумент.Товары.Добавить(); 
		 ЗаполнитьЗначенияСвойств(Новаястрока,ВыборкаТовары); 
		 
	 КонецЦикла;
	 
	 Пока ВыборкаШК.Следующий() Цикл
		 
		 НоваяСтрока = НовыйДокумент.ШтрихкодыУпаковок.Добавить(); 
		 ЗаполнитьЗначенияСвойств(Новаястрока,ВыборкаШК);	 
		 
	 КонецЦикла;
	 
	 Попытка
	 
	 	НовыйДокумент.Записать(); 
		
		Возврат НовыйДокумент.Ссылка; 
	 
	 Исключение
	    Сообщить(ОписаниеОшибки()); 
	 КонецПопытки;
	 
	 Возврат Неопределено; 
 
 КонецФункции // НовыйДокумент()
  

//--Данилова Е.В. 19.02.2025

//++Данилова Е.В. 03.03.2025 MARK-1623
Процедура ПолучитьКомлектующиеГотовыхНаборов(КомлектующиеГотовыхНаборов)
	
	Если ТипЗнч(КомлектующиеГотовыхНаборов) <> Тип("Соответствие")  Тогда
		
		КомлектующиеГотовыхНаборов = Новый Соответствие; 
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		|ИЗ
		|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправочник
		|			ПО НоменклатураКоплектующие.Ссылка = НоменклатураСправочник.Ссылка
		|				И (НоменклатураСправочник.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект))
		|		ПО МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец = НоменклатураКоплектующие.Номенклатура
		|ГДЕ
		|	МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КомлектующиеГотовыхНаборов.Вставить(ВыборкаДетальныеЗаписи.ШтрихкодУпаковки,истина); 
	КонецЦикла;
	

КонецПроцедуры

//--Данилова Е.В. 03.03.2025

//Валетов+ 10,06,2025 КТО-ТО ЗАТЕР)) ПУСТАЯ ЗАДАЧА
//Регистрация Готовых Наборов для ЕКат
Процедура ЗарегистрироватьКодыДляПолучателяСНаборами(УзелПолучатель)			
	
	ТипУзлаПолучателя = ПолучитьРеквизитШапки(УзелПолучатель, "ТипУзла");
	//Валетов + 09,12,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3361 
	//Было для Филиала, поменял на склад
	//Если ТипУзлаПолучателя <> Перечисления.ТипУзлаИБ.Склад Тогда
	Если ТипУзлаПолучателя = Перечисления.ТипУзлаИБ.Склад Тогда
		мКоды = Новый Массив;				
		Для каждого СтрокаТЧ Из ШтрихкодыУпаковок Цикл
			Если ЗначениеЗаполнено(СтрокаТЧ.ШтрихкодУпаковки) Тогда
				мКоды.Добавить(СтрокаТЧ.ШтрихкодУпаковки); 			
			КонецЕсли; 
			Если ЗначениеЗаполнено(СтрокаТЧ.ШтрихкодНабора) Тогда 
				Если мКоды.Найти(СтрокаТЧ.ШтрихкодНабора) = Неопределено Тогда 
					мКоды.Добавить(СтрокаТЧ.ШтрихкодНабора);
				КонецЕсли;
			КонецЕсли; 
		КонецЦикла;                      
		ОбменДаннымиЧЗ.УстановитьПолучателей(УзелПолучатель, мКоды);
		
		НЗ = РегистрыСведений.СтатусыКМ_ЧЗ.СоздатьНаборЗаписей();
		НЗ.Отбор.Регистратор.Установить(Ссылка, Истина);
		
		ПланыОбмена.ЗарегистрироватьИзменения(УзелПолучатель, НЗ);				
		
		НЗ = РегистрыСведений.СтатусыКМ_Факт.СоздатьНаборЗаписей();
		НЗ.Отбор.Регистратор.Установить(Ссылка, Истина);
		
		ПланыОбмена.ЗарегистрироватьИзменения(УзелПолучатель, НЗ);				
	КонецЕсли;

	//Ввод в оборот тоже отправляем (чтобы можно было сверить реестры) 
	ПланыОбмена.ЗарегистрироватьИзменения(УзелПолучатель, Ссылка);	
КонецПроцедуры 
//++Данилова Е.В. 16.12.2025  MARK-3379 
Функция ПолучитьВложенныеКодыПоНаборам()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		|ПОМЕСТИТЬ ВтНаборы
		|ИЗ
		|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|		ПО МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваров.Ссылка
		|ГДЕ
		|	ШтрихкодыУпаковокТоваров.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор)
		|	И МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка = &Ссылка
		|	И ШтрихкодыУпаковокТоваров.Владелец.Родитель.ВидКомплекта = &Комплект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод КАК Штрихкод
		|ПОМЕСТИТЬ ВтВложенныеШК
		|ИЗ
		|	ВтНаборы КАК ВтНаборы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|		ПО ВтНаборы.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтатусыКМ_ФактСрезПоследних.ШтрихКодУпаковки КАК ШтрихКодУпаковки,
		|	СтатусыКМ_ФактСрезПоследних.Статус КАК Статус,
		|	СтатусыКМ_ФактСрезПоследних.ШтрихКодУпаковки.ТипШК КАК ТипШК
		|ИЗ
		|	РегистрСведений.СтатусыКМ_Факт.СрезПоследних(
		|			,
		|			ШтрихКодУпаковки В
		|				(ВЫБРАТЬ
		|					ВТВложенныеШК.Штрихкод
		|				ИЗ
		|					ВТВложенныеШК)) КАК СтатусыКМ_ФактСрезПоследних";
	
	Запрос.УстановитьПараметр("ссылка", Ссылка);
	Запрос.УстановитьПараметр("Комплект", Перечисления.ВидыКомплектов.Комплект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить(); 

КонецФункции

//--Данилова Е.В. 16.12.2025 
//++Данилова Е.В. 21.05.2026  MARK-3717  
Процедура ОчиститьВложенныеКодыУпаковки()

	Для Каждого СтрокаТЧ Из ШтрихкодыУпаковок Цикл		
		ШтрихкодУпаковки =  СтрокаТЧ.ШтрихкодУпаковки;
		Если ШтрихкодУпаковки.ВложенныеШтрихкоды.Количество() > 0  Тогда
			
			ШтрихкодУпаковкиОбъект = ШтрихкодУпаковки.ПолучитьОбъект(); 
			ШтрихкодУпаковкиОбъект.ВложенныеШтрихкоды.Очистить();
			ШтрихкодУпаковкиОбъект.Количество = 0; 
			ШтрихкодУпаковкиОбъект.ОбменДанными.Загрузка = Истина; 
			ШтрихкодУпаковкиОбъект.Записать();
			
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

//--Данилова Е.В. 21.05.2026 
