Перем НадоПерезаписыватьСкидки;

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	НадоПерезаписыватьСкидки	= Ложь;
	ЕстьИзменения				= Модифицированность();
	
	Если НЕ ОбменДанными.Загрузка Тогда
		//КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		
		Если Отказ Тогда Возврат КонецЕсли; 	
	КонецЕсли;	
	
	Если НЕ ЕстьИзменения Тогда Возврат КонецЕсли;
	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	
	Если проведен=Истина тогда
		НаборЗаписей		=РегистрыСведений.ЗаместителиРуководителей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(ссылка);
		
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		
		нов=наборзаписей.Добавить();
		нов.руководитель=руководитель;
		нов.Дата1=дата1;
		нов.Дата2=дата2;
		нов.документ=ссылка;
		нов.Заместитель=заместитель;
		Нов.ОтгружатьСПревышениемЛимита=ОтгружатьСПревышениемЛимита;
		нов.ОтгружатьСПросроченнойЗадолженностью=ОтгружатьСПросроченнойЗадолженностью;
		нов.Автор =автор;
		
		НаборЗаписей.записать();
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.	
	
	НаборЗаписей		=РегистрыСведений.ЗаместителиРуководителей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(ссылка);
	
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	наборзаписей.Записать();	
	
КонецПроцедуры

