Функция ПолучитьГосНомер() Экспорт
	Возврат Документы.ПутевойЛист.ПрочитатьЗначениеГосНомера(Автомобиль,Дата);	
КонецФункции

Функция ПолучитьРасходНа100км() Экспорт
	Возврат Документы.ПутевойЛист.ПрочитатьНормуРасходаНа100км(Автомобиль,Дата);
КонецФункции

Функция ПолучитьРасходНаОперацию() Экспорт
	Возврат Документы.ПутевойЛист.ПрочитатьНормуНаОперацию(Автомобиль,Дата);
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Документы.ПутевойЛист.ПроверкаПроведенныхДокументов(Автомобиль, Дата);
	
	Остатки=РегистрыНакопления.ОстаткиГСМ.Остатки(МоментВремени(),Новый Структура("Автомобиль",Автомобиль));
	Остаток=Остатки.Итог("Количество");
	
	Если Расход>Остаток Тогда
		Сообщение		= Новый СообщениеПользователю;
		
		Сообщение.Текст = "Не хватает топлива""" +Автомобиль +""", из необходимых "+ Формат(Расход,"ЧДЦ=2") + "л. в наличии осталось только " + Формат(Остаток,"ЧДЦ=2")+" л.";
		Сообщение.Поле	= "Расход";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
		Движения.ОстаткиГСМ.Записывать = Ложь;
		
		Возврат;
	КонецЕсли;	
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	// регистр ОстаткиГСМ Расход
	Движения.ОстаткиГСМ.Записывать = Истина;
		
	Движение 			= Движения.ОстаткиГСМ.ДобавитьРасход();
		
	Движение.Период 	= Дата;
	Движение.Автомобиль = Автомобиль;
	Движение.Количество = Расход;	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)	
	Организация		= ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Автомобили") Тогда		
		Водитель 	= ДанныеЗаполнения.Водитель;
		Автомобиль	= ДанныеЗаполнения.Ссылка;
		ТипПутевого = ДанныеЗаполнения.ТипПутевогоЛиста;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПутевойЛист") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения,"
			|ТипПутевого,Организация,
			|Автомобиль,Прицеп,Прицеп1,
			|ВидРаботы,ВидРаботы1,		
			|ВыездИзГаража,ВозвращениеВГараж,		
			|Водитель,Диспетчер,Медик,Механик,
			|Заказчик,Заказчик1,Заказчик2,Заказчик3,Заказчик4,		
			|ЗаказчикПредставитель,Заказчик1Представитель"
		);	
		
		Если Не ЭтоВтораяХодка тогда
			Дата=НачалоДня(ТекущаяДата()+24*60*60)+60*60*7;			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если ЭтоНовый() Тогда
		УстановитьНовыйНомер();
	КонецЕсли;
	Если Модифицированность() тогда
		 ЭтотОбъект.ПробегЗаПутевку=ЭтотОбъект.КонечныйСпидометр - ЭтотОбъект.НачальныйСпидометр;
	КонецЕсли;
КонецПроцедуры
