
#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ) 
	
	//Тимофеев Ю.А. 20.01.2026
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
                
	Если ЭтоНовый() Тогда
		Отказ = Истина;
		
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьНаНаличиеДублейТиповКлючей(Отказ);
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Процедура - Проверить на наличие дублей типов ключей
//
// Параметры:
//  Отказ	 - Булево - Флаг разрешения на окончание записи элемента
//
Процедура ПроверитьНаНаличиеДублейТиповКлючей(Отказ)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	КлючиБезопасногоХранилищаДанныхИспользуемыеТипыКлючей.ТипКлюча КАК ТипКлюча,
	|	КОЛИЧЕСТВО(КлючиБезопасногоХранилищаДанныхИспользуемыеТипыКлючей1.ТипКлюча) КАК ТипКлюча1
	|ИЗ
	|	Справочник.КлючиБезопасногоХранилищаДанных.ИспользуемыеТипыКлючей КАК КлючиБезопасногоХранилищаДанныхИспользуемыеТипыКлючей
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиБезопасногоХранилищаДанных.ИспользуемыеТипыКлючей КАК КлючиБезопасногоХранилищаДанныхИспользуемыеТипыКлючей1
	|		ПО КлючиБезопасногоХранилищаДанныхИспользуемыеТипыКлючей.Ссылка = КлючиБезопасногоХранилищаДанныхИспользуемыеТипыКлючей1.Ссылка
	|			И КлючиБезопасногоХранилищаДанныхИспользуемыеТипыКлючей.ТипКлюча = КлючиБезопасногоХранилищаДанныхИспользуемыеТипыКлючей1.ТипКлюча
	|ГДЕ
	|	КлючиБезопасногоХранилищаДанныхИспользуемыеТипыКлючей.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	КлючиБезопасногоХранилищаДанныхИспользуемыеТипыКлючей.ТипКлюча
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(КлючиБезопасногоХранилищаДанныхИспользуемыеТипыКлючей1.ТипКлюча) > 1");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		СообщитьИзМодуля("Обнаружены дубли типа ключа по элементу ключа безопасности данных");
		
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры // ПроверитьНаНаличиеДублейТиповКлючей()

#КонецЕсли

#КонецОбласти
