
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Если Маркировка_ПИ.ТипТекущегоУзла() <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;		
		Для Каждого МетаЗнач Из Метаданные.Перечисления.ВидыОперацийМаркировки.ЗначенияПеречисления Цикл
			ТекЗнач = Перечисления.ВидыОперацийМаркировки[МетаЗнач.имя];
			Если ТекЗнач = Перечисления.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов Тогда Продолжить КонецЕсли; 
					
			ДанныеВыбора.Добавить(ТекЗнач, ""+ТекЗнач);			
		КонецЦикла; 
		ДанныеВыбора.СортироватьПоПредставлению();		
	КонецЕсли; 
КонецПроцедуры
