Функция РазрядностьПлатформы()
	СисИнфо	= Новый СистемнаяИнформация;
	Если  СтрНайти(СисИнфо.ТипПлатформы,64)<>0 Тогда
		Результат	= 64;
	Иначе 
		Результат	= 32;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //РазрядностьСистемы()
 
Функция ПодключитьКомпонентуОбмена(Ответ,Направление) Экспорт	
	Разрядность = РазрядностьПлатформы();
	
	ОбъектКомпоненты	= Неопределено;
	ИмяДляПодключения	= "AddIn"+Направление;
	Если ПодключитьВнешнююКомпоненту(ПоместитьВоВременноеХранилище(ПолучитьОбщийМакет("КомпонентаОбмена"+Разрядность)), ИмяДляПодключения, ТипВнешнейКомпоненты.Native, ТипПодключенияВнешнейКомпоненты.НеИзолированно) Тогда
		Попытка
			ИмяОбъекта			= "AddIn."+ИмяДляПодключения+".AMQPToNative";
			
			ОбъектКомпоненты	= Новый(ИмяОбъекта);			
			
			Ответ="Разрядность: "+Разрядность+". Версия: "+ОбъектКомпоненты.ВерсияКомпоненты();
		Исключение
			Ответ="Ошибка создания объекта из компоненты. "+ОписаниеОшибки();
		КонецПопытки;		
	Иначе
		Ответ="Не удалось подключить компоненту обмена.";	
	КонецЕсли; 
	
	Возврат ОбъектКомпоненты;
КонецФункции //ПодключитьКомпонентуОбмена(Ошибки)

Функция ПривестиКЧислу(Зн) Экспорт
	Рез=0;
	Попытка	
		Рез=Число(Зн);	
	Исключение	
	КонецПопытки;	
	Возврат Рез;
КонецФункции //ПривестиКЧислу()

Функция ПолучитьЗначениеПараметра(мПараметры,Имя,ЗначениеПоУмолчанию=Неопределено) Экспорт
	Результат	= ЗначениеПоУмолчанию;
	ТекЗнач		= Неопределено;
	
	ТипПараметров	= ТипЗнч(мПараметры);
	
	Если ТипПараметров=Тип("Структура") ИЛИ ТипПараметров=Тип("ДанныеФормыСтруктура") Тогда
		ТекЗнач=Неопределено;
		мПараметры.Свойство(Имя,ТекЗнач);
	ИначеЕсли ТипПараметров=Тип("Соответствие") Тогда
		ТекЗнач=мПараметры[Имя];
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекЗнач) Тогда		
		Результат=ТекЗнач;					
	КонецЕсли; 		
	
	Возврат Результат;	
КонецФункции //ПолучитьПараметр(мПараметры,Имя,ЗначениеПоУмолчанию=Неопределено)

Функция УстановитьЗначениеПараметра(СтруктураПараметров,Имя,Значение,Перезаписывать=Истина) Экспорт	
	Результат = Ложь;
	Если ТипЗнч(СтруктураПараметров)=Тип("Структура") ИЛИ 
		ТипЗнч(СтруктураПараметров)=Тип("Соответствие") Тогда
		ТекЗнач=ПолучитьЗначениеПараметра(СтруктураПараметров,Имя);
		Если ТекЗнач<>Значение И Перезаписывать Тогда
			СтруктураПараметров.Вставить(Имя,Значение);		
			Результат = Истина;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //УстановитьЗначениеПараметра(СтруктураПараметров,Имя,Значение,Перезаписывать=Истина) Экспорт

Функция СтрокуВСтруктуру(Строка,СтрПоля,Разделитель=",") Экспорт
	Части	= СтрРазделить(Строка,Разделитель);
	Поля	= СтрРазделить(СтрПоля,",");
	
	Результат	= Новый Структура;
	
	Для Сч=1 По Поля.Количество()  Цикл
		Инд=Сч-1;
		Если Сч<=Части.Количество() Тогда
			Результат.Вставить(Поля[Инд],Части[Инд]);
		Иначе
			Результат.Вставить(Поля[Инд],"");			
		КонецЕсли; 	
	КонецЦикла; 
	
	Возврат Результат;
КонецФункции // ()

Функция СлепитьЗаполненныеПараметры(Разделитель,П1="",П2="",П3="",П4="",П5="",П6="",П7="",П8="",П9="",П10="") Экспорт
	МП=Новый Массив;
	Для Сч=1 По 10 Цикл
		ЗначПараметра=Вычислить("П"+Сч);
		Если ЗначениеЗаполнено(ЗначПараметра) Тогда
			МП.Добавить(ЗначПараметра);		
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат	СтрСоединить(МП,Разделитель);	
КонецФункции //СлепитьЗаполненныеПараметры(Разделитель,П1="",П2="",П3="",П4="",П5="",П6="",П7="",П8="",П9="",П10="")

Функция МТ_ВСоответствие(МТ,Значение=Истина) Экспорт
	Результат = Новый Соответствие;
	Для Каждого Менеджер Из МТ Цикл
		Результат.Вставить(ФР_ОбщегоНазначения_ПИ.ИмяТипаПоМенеджеру(ЗначениеВстрокувнутр(Менеджер)),Значение);	
	КонецЦикла; 
	
	Возврат Результат;
КонецФункции //МТ_ВСоответствие(МТ)

Процедура СообщитьПользователю(
		Знач ТекстСообщенияПользователю,
		Знач КлючДанных = Неопределено,
		Знач Поле = "",
		Знач ПутьКДанным = "",
		Отказ = Ложь) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияПользователю;
	Сообщение.Поле = Поле;
	
	ЭтоОбъект = Ложь;
	
#Если НЕ ТонкийКлиент И НЕ ВебКлиент Тогда
	Если КлючДанных <> Неопределено
	   И XMLТипЗнч(КлючДанных) <> Неопределено Тогда
		ТипЗначенияСтрокой = XMLТипЗнч(КлючДанных).ИмяТипа;
		ЭтоОбъект = Найти(ТипЗначенияСтрокой, "Object.") > 0;
	КонецЕсли;
#КонецЕсли
	
	Если ЭтоОбъект Тогда
		Сообщение.УстановитьДанные(КлючДанных);
	Иначе
		Сообщение.КлючДанных = КлючДанных;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПутьКДанным) Тогда
		Сообщение.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
		
	Сообщение.Сообщить();
	
	Отказ = Истина;
	
КонецПроцедуры

Функция ПолучитьМенеджер(ПолноеИмяТипа,КэшМенеджеров=Неопределено) Экспорт
	Если КэшМенеджеров=Неопределено Тогда
		Менеджер	= Неопределено;
	Иначе		
		Менеджер	= КэшМенеджеров.Получить(ПолноеИмяТипа);		
	КонецЕсли;	
	
	Если Менеджер=Неопределено Тогда		
		ОписаниеТипа    	= ФР_ОбщегоНазначения_ПИ.ОписаниеТипа(ПолноеИмяТипа);
		
		Попытка
			Менеджер 		= Вычислить(ОписаниеТипа.КлассМЧ+"["""+ОписаниеТипа.Вид+"""]");					
		Исключение
		КонецПопытки;		
		
		Если КэшМенеджеров<>Неопределено Тогда
			КэшМенеджеров.Вставить(ПолноеИмяТипа,Менеджер);		
		КонецЕсли;		
	КонецЕсли;
	
	Возврат Менеджер;
КонецФункции //ПолучитьМенеджер(ПолноеИмяТипа,КэшМенеджеров=Неопределено) Экспорт

Функция РассортироватьПоТипам(МассивСсылок) Экспорт
	Типы	= Новый Соответствие;
	
	Для Каждого Ссылка Из МассивСсылок Цикл		
		ОТ	= ФР_ОбщегоНазначения_ПИ.ОписаниеТипа(ЗначениеВСтрокуВнутр(ТипЗнч(Ссылка)));
		Тип	= ОТ.ПолноеИмя;
		
		ТекМассив	= Типы.Получить(Тип);
		Если ТекМассив=Неопределено Тогда
			ТекМассив=Новый Массив;		
		КонецЕсли; 
		ТекМассив.Добавить(Ссылка);
		
		Типы.Вставить(Тип,ТекМассив);
	КонецЦикла;
	
	Возврат Типы;
КонецФункции //РассортироватьПоТипам()
