
Процедура ОбработкаПроведения(Отказ, Режим)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	// регистр УчетПроизводстМощности
	Движения.УчетПроизводстМощности.Записывать = Истина;
	
	Движения.УчетПроизводстМощности.Очистить();
	Если Товары.Количество() Тогда
		СумКоэф=Товары.Итог("Коэффициент");
		Если СумКоэф=0 Тогда
			СумКоэф=Товары.Количество();
		КонецЕсли;
		ТЗНоменклатура=Товары.Выгрузить();
		ТЗНоменклатура.Свернуть("Номенклатура","Коэффициент");
		Для Каждого СтрокаТЧ Из ТЗНоменклатура Цикл
			Движение = Движения.УчетПроизводстМощности.Добавить();
			Движение.Контрагент=Контрагент;
			Движение.Станок=Станок;
			Движение.ДатаОкончания=ДатаОкончания;
			Движение.Номенклатура=СтрокаТЧ.Номенклатура;
			Движение.Мощность = МощностьВСутки;
		КонецЦикла;
	Иначе
		Движение = Движения.УчетПроизводстМощности.Добавить();
		Движение.Контрагент=Контрагент;
		Движение.Станок=Станок;
		Движение.ДатаОкончания=ДатаОкончания;
		Движение.Мощность = МощностьВСутки;

	КонецЕсли;
	Движения.УчетПроизводстМощности.Записать();
КонецПроцедуры
