
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаСервере
Процедура КонтрольЗаполнения(Отказ, ПараметрыЗаписи) 
	СтруктураВозврата = новый Структура("Успех,Ошибки",Истина,новый Массив);
	Отбор = новый Структура("ПризнакГруппыРегиона",0);	
	МассивПустыхСтрок = Объект.Регионы.НайтиСтроки(Отбор);   
	
	
	
	
	если МассивПустыхСтрок.количество() > 0  тогда 
		Объект.ГруппироватьРегионы = Истина;       
		если МассивПустыхСтрок.количество()<> Объект.Регионы.Количество() тогда   
			СтруктураВозврата.Ошибки.Добавить("Не везде заполнен признак группы региона");
		КонецЕсли;  
	иначе
		Объект.ГруппироватьРегионы = Ложь;    
	КонецЕсли;


	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРегионыПоРНК(Команда) 
	//ДатаАнализа = ПустаяДата();
	//Обещание = ВвестиДатуАсинх(ДатаАнализа,"Укажите дату, начиная с которой будут анализироваться РНК");     
	//
	////Результат = Ждать Обещание;
	////
	//если ЗначениеЗаполнено(ДатаАнализа) тогда
	//	ЗаполнитьПунктыДоставкиПоРНКНаСервере(ДатаАнализа);   
	//	Сообщить("Готово");
	//КонецЕсли;   
	ЗаполнитьРегионыПоРНКАсинхронно();
КонецПроцедуры

 &НаКлиенте
Асинх Процедура ЗаполнитьРегионыПоРНКАсинхронно() 
	Обещание = ВвестиДатуАсинх(,"Укажите дату, начиная с которой будут анализироваться РНК");     	
	ДатаАнализа = Ждать Обещание;
	//
	если ЗначениеЗаполнено(ДатаАнализа) тогда
		ЗаполнитьРегионыПоРНКНаСервере(ДатаАнализа);   
		Сообщить("Готово");
	КонецЕсли;   
	
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьРегионыПоРНКНаСервере(ДатаАнализа)  
	
	запрос = новый запрос;
	запрос.Текст =   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасходнаяНакладная.ПунктДоставки.Регион КАК Регион
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.Дата > &ДатаАнализа
	|	И РасходнаяНакладная.Контрагент = &Контрагент
	|	И НЕ РасходнаяНакладная.Склад.ЭтоСкладFBS
	|	И НЕ РасходнаяНакладная.Проведен
	|	И РасходнаяНакладная.КодОперации = ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.Комиссия)";     
	запрос.УстановитьПараметр("Контрагент",объект.Контрагент);
	запрос.УстановитьПараметр("ДатаАнализа",ДатаАнализа);
	Объект.Регионы.Загрузить(запрос.Выполнить().Выгрузить());	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	СформироватьНаименованиеИзФормы();
КонецПроцедуры           

&НаКлиенте
Процедура СформироватьНаименованиеИзФормы ()  
	объект.Наименование = СокрЛП(СтрШаблон("%1 Категория %2 %3",объект.Контрагент,объект.КатегорияМаркетПлейсы,КратноеНаименованиеОрганизации(объект.Организация)));	
КонецПроцедуры


&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	СформироватьНаименованиеИзФормы();
КонецПроцедуры


&НаКлиенте
Процедура КатегорияМаркетПлейсыПриИзменении(Элемент)
	СформироватьНаименованиеИзФормы();
КонецПроцедуры    

&НаСервереБезКонтекста
Функция КратноеНаименованиеОрганизации (Организация)    
	КодОрганизации = ПолучитьРеквизитШапки(Организация,"Код","Справочник");
	если КодОрганизации = "SS-001" тогда 
		Возврат "ЕЕЭ";
	ИначеЕсли КодОрганизации = "SSP-99" тогда 
		Возврат "БТК";
	ИначеЕсли КодОрганизации = "SSR-03" тогда 
		Возврат "МПС";
	Иначе
		Возврат Организация.Наименование;
	КонецЕсли; 
КонецФункции

&НаСервере
Процедура ЗаписатьРегионыПоВсемКатегориямНаСервере()
	ТЗРегионов = Объект.Регионы.Выгрузить();
	запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	|	ПравилаПополненияСкладовМаркетплейсов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПравилаПополненияСкладовМаркетплейсов КАК ПравилаПополненияСкладовМаркетплейсов
	|ГДЕ
	|	ПравилаПополненияСкладовМаркетплейсов.Ссылка <> &Ссылка
	|	И НЕ ПравилаПополненияСкладовМаркетплейсов.ПометкаУдаления
	|	И ПравилаПополненияСкладовМаркетплейсов.Контрагент = &Контрагент";
	запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);    
	запрос.УстановитьПараметр("Контрагент",Объект.Контрагент); 
	выборка = запрос.Выполнить().Выбрать();
	пока выборка.Следующий() цикл 
		ТекОбъект = выборка.ссылка.ПолучитьОбъект();
		ТекОбъект.Регионы.Загрузить(ТЗРегионов);  
		ТекОбъект.записать();
	КонецЦикла;


КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьРегионыПоВсемКатегориям(Команда)
	ЗаписатьРегионыПоВсемКатегориямНаСервере();
КонецПроцедуры



