
#Область ПрограммныйИнтерфейс

// Выбор каталога.
// 
// Параметры: Элемент - ПолеФормы -  Элемент
//  Путь - Строка - Путь
//  ПроверятьСуществование - Булево - Проверять существование
// 
// Возвращаемое значение:
//  Строка - Выбор каталога клиент
Функция ВыборКаталогаКлиент(Путь, ПроверятьСуществование=Ложь) Экспорт
	
	ДиалогФыбораФайла								=	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	ДиалогФыбораФайла.Заголовок						=	"Выберите каталог";		
	//ДиалогФыбораФайла.ПолноеИмяФайла				=	Элемент.Значение;
	ДиалогФыбораФайла.ПроверятьСуществованиеФайла	=	ПроверятьСуществование;
	ДиалогФыбораФайла.Каталог						=	Путь;
	
	Если ДиалогФыбораФайла.Выбрать() Тогда
		Возврат ДиалогФыбораФайла.Каталог+"\";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

#КонецОбласти
