//Кухарь 05.10.19 начало
//Теперь ходит не везде
Процедура ПередЗаписью(Отказ)
	
	НадоВыгружать = Ложь;
	Если ОбменДанными.Загрузка Тогда
		НадоВыгружать = Ложь;
	Иначе 
		НадоВыгружать = Истина;
	КонецЕсли;
	
	// нечаева 23,08,24++++
	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	// временно тест	!!!!!
	//Если ПланыОбмена.ОбменССайтомТоварами.ЭтотУзел().Код="SNL"  И  ТекСтрокаСоединения=СтрокаСоединенияСразрешеннымОбменом Тогда
	Если ПланыОбмена.ОбменССайтомТоварами.ЭтотУзел().Код="SNL"  Тогда
					
		Если ЭтоНовый()  ТОгда  
			// будем считать, что пока не надо, т.к. ном. такой нет.
		иначе
			// нужно перевыгрузить всю номенклатуру на б2б с этим кодом
			СписокНоменклатуры = ПроцедурыОбменаССайтом.ПолучитьСписокНомТНВЭД(Ссылка,ложь,ЭтотОбъект);   
			Если СписокНоменклатуры.количество()>0 Тогда
				ПроцедурыОбменаССайтом.ЗарегистрироватьИзмененияТНВЭДСайтов(СписокНоменклатуры);
			КонецЕсли;
		КонецЕсли;	
	  		
	КонецЕсли;
	// нечаева 23,08,24----
	
	Если НадоВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	КонецЕсли;
	
	// Шворобей ВЮ 16.01.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2554
	Если ЭтоНовый() Тогда
		Если НормативУтилизации <> 0 Тогда
			ДополнительныеСвойства.Вставить("НормативУтилизацииСтарый", 0);
		КонецЕсли;
		Если СтавкаЭкологическогоСбора <> 0 Тогда
			ДополнительныеСвойства.Вставить("СтавкаЭкологическогоСбораСтарая", 0);
		КонецЕсли;
	Иначе
		ДополнительныеСвойства.Вставить("НормативУтилизацииСтарый", Ссылка.НормативУтилизации);
		ДополнительныеСвойства.Вставить("СтавкаЭкологическогоСбораСтарая", Ссылка.СтавкаЭкологическогоСбора);
	КонецЕсли;
	// Шворобей ВЮ 16.01.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2554
	
КонецПроцедуры
//Кухарь 05.10.19 конец

// Шворобей ВЮ 16.01.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2554
Процедура ПриЗаписи(Отказ)
	
	Если ДополнительныеСвойства.Свойство("НормативУтилизацииСтарый") И ДополнительныеСвойства.НормативУтилизацииСтарый <> НормативУтилизации Тогда
		УстановитьПериодическийРеквизит(Ссылка, "НормативУтилизации", НормативУтилизации,
		?(ДополнительныеСвойства.Свойство("ДатаЭкосбора"), ДополнительныеСвойства.ДатаЭкосбора, ТекущаяДатаСеанса()));
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("СтавкаЭкологическогоСбораСтарая") И ДополнительныеСвойства.СтавкаЭкологическогоСбораСтарая <> СтавкаЭкологическогоСбора Тогда
		УстановитьПериодическийРеквизит(Ссылка, "СтавкаЭкологическогоСбора", СтавкаЭкологическогоСбора,
		?(ДополнительныеСвойства.Свойство("ДатаЭкосбора"), ДополнительныеСвойства.ДатаЭкосбора, ТекущаяДатаСеанса()));
	КонецЕсли;

КонецПроцедуры
// Шворобей ВЮ 16.01.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2554

