
&НаСервере
Процедура ПечатьШКНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПечатьШК(Команда)                         
	Коды = Новый Массив;
	Для каждого Ссылка Из Элементы.Список.ВыделенныеСтроки Цикл
		Коды.Добавить(Ссылка);	
	КонецЦикла;
	
	ТД = ПечатьШК_НаСервере(Коды);
	ТД.Показать("Служебные коды");
КонецПроцедуры

Функция ПечатьШК_НаСервере(пСсылки)
	Если ТипЗнч(пСсылки) = Тип("Массив") Тогда
		Ссылки = пСсылки;	
	Иначе                   
		Ссылки = Новый Массив;	
		Ссылки.Добавить(пСсылки);
	КонецЕсли;	
	
	Компонента = ПодключитьКомпонентуИзМакета("Barcode", "ОбщийМакет.КомпонентаПечатиШтрихкодов");
	
	ТД = Новый ТабличныйДокумент;
	ТД.ИмяПараметровПечати = "СлужебныеШтрихКоды";
	ТД.ОтображатьСетку = Ложь;
	ТД.ОтображатьЗаголовки = Ложь;
	
	КолКолонок = 3;
	Сч = 0;
	Для каждого Ссылка Из Ссылки Цикл		
		Если НЕ ЗначениеЗаполнено(Ссылка.ШтрихКод) Тогда Продолжить КонецЕсли;
		
		Этикетка = СформироватьЭтикетку(Ссылка, Компонента);
		Если Сч % КолКолонок = 0 Тогда
			ТД.Вывести(Этикетка);
		Иначе                    			
			ТД.Присоединить(Этикетка);					
		КонецЕсли;		             
		
		Сч = Сч + 1;
	КонецЦикла;	
	
	Возврат ТД;
КонецФункции //ПечатьШК_НаСервере(пСсылки)

Функция СформироватьЭтикетку(Ссылка, Компонента)
	Макет 	= Справочники.НазначенияШК.ПолучитьМакет("Макет");
	
	ОблЭтикета = Макет.ПолучитьОбласть("ШК|Этикетка");
	ОблЭтикета .Параметры.Заполнить(Новый Структура("Наименование", Ссылка.Наименование));
	
	ПараметрыШК = Маркировка_ПИ.ПараметрыГенерацииШКпоУмолчанию();
	Рисунок 	= ОблЭтикета.Рисунки.ШтрихКод;
	
	Эталон 		= Справочники.ШтрихкодыУпаковокТоваров.ПолучитьМакет("Эталон");
	ММвВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;	
	
	ПараметрыШК.ТипКода	= 1;
	
	ПараметрыШК.Высота = Окр(Рисунок.Высота / ММвВПикселе);
	ПараметрыШК.Ширина = Окр(Рисунок.Ширина / ММвВПикселе);
	
	ПараметрыШК.Масштабировать 				= Ложь;	
	ПараметрыШК.СохранятьПропорции 			= Истина;	
	ПараметрыШК.ОтображатьТекст				= Истина;
	ПараметрыШК.РазмерШрифта				= 12;
	ПараметрыШК.ВертикальноеВыравнивание 	= 1;	
	
	ПараметрыШК.УголПоворота 	= 0;	
	ПараметрыШК.Штрихкод 		= Ссылка.ШтрихКод;	
	ПараметрыШК.УбратьЛишнийФон	= Истина;
	
	рШтрихКод = ПодготовитьИзображениеШтрихкодаEAN13(Компонента, ПараметрыШК);	
	
	Рисунок.Картинка = рШтрихКод.Картинка;
	
	Возврат ОблЭтикета ;
КонецФункции //СформироватьЭтикетку(Ссылка, Компонента)

Функция ПодготовитьИзображениеШтрихкодаEAN13(ВнешняяКомпонента, ПараметрыШтрихкода)	
	// Результат 
	РезультатОперации = Новый Структура("Успешно,ДвоичныеДанные,Картинка", Ложь);	
	
	// Зададим размер формируемой картинки.
	ШиринаШтрихкода = Макс(Окр(ПараметрыШтрихкода.Ширина),1);
	ВысотаШтрихкода = Макс(Окр(ПараметрыШтрихкода.Высота),1);	
	
	ВнешняяКомпонента.Ширина = ШиринаШтрихкода;
	ВнешняяКомпонента.Высота = ВысотаШтрихкода;
	ВнешняяКомпонента.АвтоТип = Ложь;
	
	ШтрихкодВрем = Строка(ПараметрыШтрихкода.Штрихкод); // Преобразуем явно в строку.
	
	Если ПараметрыШтрихкода.ТипКода = 99 Тогда
		ВнешняяКомпонента.АвтоТип = Истина;
	Иначе
		ВнешняяКомпонента.АвтоТип = Ложь;
		ВнешняяКомпонента.ТипКода = ПараметрыШтрихкода.ТипКода;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("ПрозрачныйФон") Тогда
		ВнешняяКомпонента.ПрозрачныйФон = ПараметрыШтрихкода.ПрозрачныйФон;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("ТипВходныхДанных") Тогда
		ВнешняяКомпонента.ТипВходныхДанных = ПараметрыШтрихкода.ТипВходныхДанных;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("GS1DatabarКоличествоСтрок") Тогда
		ВнешняяКомпонента.GS1DatabarКоличествоСтрок = ПараметрыШтрихкода.GS1DatabarКоличествоСтрок;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("УбратьЛишнийФон") Тогда
		ВнешняяКомпонента.УбратьЛишнийФон = ПараметрыШтрихкода.УбратьЛишнийФон;
	КонецЕсли;
	
	ВнешняяКомпонента.ОтображатьТекст = ПараметрыШтрихкода.ОтображатьТекст;
	// Формируем картинку штрихкода.
	ВнешняяКомпонента.ЗначениеКода = ШтрихкодВрем;
	// Угол поворота штрихкода.
	ВнешняяКомпонента.УголПоворота = ?(ПараметрыШтрихкода.Свойство("УголПоворота"), ПараметрыШтрихкода.УголПоворота, 0);
	// Уровень коррекции QR кода (L=0, M=1, Q=2, H=3).
	ВнешняяКомпонента.УровеньКоррекцииQR = ?(ПараметрыШтрихкода.Свойство("УровеньКоррекцииQR"), ПараметрыШтрихкода.УровеньКоррекцииQR, 1);
	
	// Для обеспечения совместимости с предыдущими версиями БПО.
	Если Не ПараметрыШтрихкода.Свойство("Масштабировать")
		Или (ПараметрыШтрихкода.Свойство("Масштабировать") И ПараметрыШтрихкода.Масштабировать) Тогда
		
		Если Не ПараметрыШтрихкода.Свойство("СохранятьПропорции")
			Или (ПараметрыШтрихкода.Свойство("СохранятьПропорции") И Не ПараметрыШтрихкода.СохранятьПропорции) Тогда
			// Если установленная нами ширина меньше минимально допустимой для этого штрихкода.
			Если ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода Тогда
				ВнешняяКомпонента.Ширина = ВнешняяКомпонента.МинимальнаяШиринаКода;
			КонецЕсли;
			// Если установленная нами высота меньше минимально допустимой для этого штрихкода.
			Если ВнешняяКомпонента.Высота < ВнешняяКомпонента.МинимальнаяВысотаКода Тогда
				ВнешняяКомпонента.Высота = ВнешняяКомпонента.МинимальнаяВысотаКода;
			КонецЕсли;
		ИначеЕсли ПараметрыШтрихкода.Свойство("СохранятьПропорции") И ПараметрыШтрихкода.СохранятьПропорции Тогда
			Пока ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода 
				Или ВнешняяКомпонента.Высота < ВнешняяКомпонента.МинимальнаяВысотаКода Цикл
				// Если установленная нами ширина меньше минимально допустимой для этого штрихкода.
				Если ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода Тогда
					ВнешняяКомпонента.Ширина = ВнешняяКомпонента.МинимальнаяШиринаКода;
					ВнешняяКомпонента.Высота = Окр(ВнешняяКомпонента.МинимальнаяШиринаКода / ШиринаШтрихкода) * ВысотаШтрихкода;
				КонецЕсли;
				// Если установленная нами высота меньше минимально допустимой для этого штрихкода.
				Если ВнешняяКомпонента.Высота < ВнешняяКомпонента.МинимальнаяВысотаКода Тогда
					ВнешняяКомпонента.Высота = ВнешняяКомпонента.МинимальнаяВысотаКода;
					ВнешняяКомпонента.Ширина = Окр(ВнешняяКомпонента.МинимальнаяВысотаКода / ВысотаШтрихкода) * ШиринаШтрихкода;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// ВертикальноеВыравниваниеКода: 1 - по верхнему краю, 2 - по центру, 3 - по нижнему краю.
	Если ПараметрыШтрихкода.Свойство("ВертикальноеВыравнивание") И (ПараметрыШтрихкода.ВертикальноеВыравнивание > 0) Тогда
		ВнешняяКомпонента.ВертикальноеВыравниваниеКода = ПараметрыШтрихкода.ВертикальноеВыравнивание;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("РазмерШрифта") И (ПараметрыШтрихкода.РазмерШрифта > 0) 
		И (ПараметрыШтрихкода.ОтображатьТекст) И (ВнешняяКомпонента.РазмерШрифта <> ПараметрыШтрихкода.РазмерШрифта) Тогда
		ВнешняяКомпонента.РазмерШрифта = ПараметрыШтрихкода.РазмерШрифта;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("РазмерШрифта") И ПараметрыШтрихкода.РазмерШрифта > 0
		И ПараметрыШтрихкода.Свойство("МонохромныйШрифт") Тогда
		Если ПараметрыШтрихкода.МонохромныйШрифт Тогда
			ВнешняяКомпонента.МаксимальныйРазмерШрифтаДляПринтеровНизкогоРазрешения = ПараметрыШтрихкода.РазмерШрифта + 1;
		Иначе
			ВнешняяКомпонента.МаксимальныйРазмерШрифтаДляПринтеровНизкогоРазрешения = -1;
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.ТипКода = 16 Тогда // QR
		Если ПараметрыШтрихкода.Свойство("ЛоготипКартинка") И ЗначениеЗаполнено(ПараметрыШтрихкода.ЛоготипКартинка) Тогда 
			ВнешняяКомпонента.ЛоготипКартинка = ПараметрыШтрихкода.ЛоготипКартинка;    
		Иначе
			ВнешняяКомпонента.ЛоготипКартинка = "";
		КонецЕсли;
		Если ПараметрыШтрихкода.Свойство("ЛоготипРазмерПроцентОтШК") И Не ПустаяСтрока(ПараметрыШтрихкода.ЛоготипРазмерПроцентОтШК) Тогда 
			ВнешняяКомпонента.ЛоготипРазмерПроцентОтШК = ПараметрыШтрихкода.ЛоготипРазмерПроцентОтШК;
		КонецЕсли;
	КонецЕсли;
	
	// Сформируем картинку
	ДвоичныеДанныеКартинки 		= ВнешняяКомпонента.ПолучитьШтрихкод();
	РезультатОперации.Успешно 	= (ВнешняяКомпонента.Результат = 0);
	// Если картинка сформировалась.
	Если ДвоичныеДанныеКартинки <> Неопределено Тогда
		РезультатОперации.ДвоичныеДанные	= ДвоичныеДанныеКартинки;
		РезультатОперации.Картинка 			= Новый Картинка(ДвоичныеДанныеКартинки); // Формируем из двоичных данных.
	КонецЕсли;
	
	Возврат РезультатОперации;
	
КонецФункции