
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если Маркировка_ПИ.ТипТекущегоУзла() = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда	
		рРегистрации = ЗарегистрироватьКодыНаСклад_НаСервере(ПараметрКоманды);		
		Если рРегистрации.Успешно Тогда
			ТекстСообщения = СтрШаблон("Зарегистрировано: %1 кодов маркировки для выгрузки в узел %2.", рРегистрации.ОбработаноОбъектов, рРегистрации.Данные);
			Сообщить(ТекстСообщения, СтатусСообщения.Информация);
		Иначе
			Сообщить(СтрСоединить(рРегистрации.Ошибки, Символы.ПС), СтатусСообщения.Важное);
		КонецЕсли; 
	Иначе
		Сообщить("Команда доступна только в офисе !", СтатусСообщения.Важное);	
	КонецЕсли; 	
КонецПроцедуры

&НаСервере
Функция ЗарегистрироватьКодыНаСклад_НаСервере(ХКМ_Ссылка)	
	Возврат Документы.ХранилищеКодовМаркировки.ЗарегистрироватьКодыНаСклад(ХКМ_Ссылка);
КонецФункции
 
