Перем ПодразделениеЦО Экспорт;
Перем ТекПодразделение Экспорт;

Функция ПолучитьПодразделениеЦО()
	Результат	= Справочники.Подразделения.ПустаяСсылка();
	
	ТекПО		= ПланыОбмена.Основной;
	ЭтотУзел	= ТекПО.ЭтотУзел();
	
	Выборка	= ТекПО.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.ПометкаУдаления И Выборка.Ссылка<>ЭтотУзел Тогда
			Результат=Выборка.Подразделение;		
			Прервать;
		КонецЕсли;	
	КонецЦикла; 
	
	Возврат Результат;
КонецФункции

ПодразделениеЦО				= ПолучитьПодразделениеЦО();
ТекПодразделение			= ПланыОбмена.Основной.ЭтотУзел().Подразделение;