#Область СлужебныеПроцедурыИФункции
//Данилова Е.В. 13.05.2026 ASU-2790 добавление параметра
Функция ПрочитатьКоды(ИмяФайла, фЗагружатьИзФайла,НаполнениеЗПС = Ложь) Экспорт
	Если фЗагружатьИзФайла = 0 Тогда
		//++Данилова Е.В. 13.05.2026 ASU-2790
		//Возврат	ПрочитатьКодыИзФайла(ИмяФайла);
		Возврат	ПрочитатьКодыИзФайла(ИмяФайла,НаполнениеЗПС);
		//--Данилова Е.В. 13.05.2026 
	Иначе
		Файл = Новый Файл(ИмяФайла);					
		Если Файл.ЭтоКаталог() Тогда            
			КаталогЗагрузки = Файл.ПолноеИмя; 
		Иначе
			КаталогЗагрузки = Файл.Путь;			
		КонецЕсли;
		Если НЕ СтрЗаканчиваетсяНа(КаталогЗагрузки, ПолучитьРазделительПути()) Тогда
			КаталогЗагрузки = КаталогЗагрузки + ПолучитьРазделительПути();		
		КонецЕсли;
		//++Данилова Е.В. 13.05.2026 ASU-2790
		//Возврат ПрочитатьКодыИзКаталога(КаталогЗагрузки);
		Возврат ПрочитатьКодыИзКаталога(КаталогЗагрузки,НаполнениеЗПС);
		//--Данилова Е.В. 13.05.2026
	КонецЕсли;
КонецФункции //ПрочитатьКоды()
//
//Данилова Е.В. 13.05.2026 ASU-2790
Функция ПрочитатьКодыИзФайла(ИмяФайла,НаполнениеЗПС = Ложь)
	Результат = МаркировкаКС.СтруктураРезультата(Истина);
	
	ДД = Новый ДвоичныеДанные(ИмяФайла);
	СтрокаДанных = ПолучитьСтрокуИзДвоичныхДанных(ДД);
	//++Данилова Е.В. 13.05.2026 ASU-2790
	//рЧтения = ПрочитатьТаблицуКодовИзСтроки(СтрокаДанных);
	Если НаполнениеЗПС Тогда
		рЧтения = ПрочитатьТаблицуКодовИзСтроки_НаполнениеЗПС(СтрокаДанных);
	Иначе 
		рЧтения = ПрочитатьТаблицуКодовИзСтроки(СтрокаДанных);	
	КонецЕсли;
	 
	//Возврат СопоставитьКоды(рЧтения.Коды);
	Возврат СопоставитьКоды(рЧтения.Коды,НаполнениеЗПС);
	//--Данилова Е.В. 13.05.2026	
КонецФункции // ПрочитатьКодыИзФайла(ИмяФайла)
//
//Данилова Е.В. 13.05.2026 ASU-2790
Функция ПрочитатьКодыИзКаталога(ИмяКаталога,НаполнениеЗПС = Ложь)
	Файлы = НайтиФайлы(ИмяКаталога,"*.json");	
	//++Данилова Е.В. 13.05.2026 ASU-2790
	//тКоды = СоздатьТаблицуКодов();
	Если НаполнениеЗПС Тогда
		ТКоды = СоздатьТаблицуКодов_2(); 
	Иначе 
		ТКоды = СоздатьТаблицуКодов();	
	КонецЕсли;
	//--Данилова Е.В. 13.05.2026 
	Для каждого Файл Из Файлы Цикл        
		мИмяФайла = Файл.ПолноеИмя;
		
		ДД = Новый ДвоичныеДанные(мИмяФайла);
		СтрокаДанных	= ПолучитьСтрокуИзДвоичныхДанных(ДД);
		//++Данилова Е.В. 13.05.2026 ASU-2790
		//рЧтения 		= ПрочитатьТаблицуКодовИзСтроки(СтрокаДанных);
		Если НаполнениеЗПС Тогда
			рЧтения 		= ПрочитатьТаблицуКодовИзСтроки_НаполнениеЗПС(СтрокаДанных);
		Иначе
			рЧтения 		= ПрочитатьТаблицуКодовИзСтроки(СтрокаДанных);
		КонецЕсли;
		//--Данилова Е.В. 13.05.2026 
		Если тКоды = Неопределено Тогда
			тКоды = рЧтения.Коды;		
		Иначе
			Для Каждого СтрокаИст Из рЧтения.Коды Цикл
				СтрокаПол = тКоды.Добавить();			
				ЗаполнитьЗначенияСвойств(СтрокаПол, СтрокаИст);		
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;
	//++Данилова Е.В. 13.05.2026 ASU-2790
	//Возврат СопоставитьКоды(тКоды);
	Возврат СопоставитьКоды(тКоды,НаполнениеЗПС);
	//--Данилова Е.В. 13.05.2026 	
КонецФункции // ПрочитатьКодыИзФайла(ИмяФайла)

Функция СоздатьТаблицуКодов() Экспорт
	ТаблицаКоды = Новый ТаблицаЗначений;
	ТаблицаКоды.Колонки.Добавить("КодКоробки",	ПолучитьОписаниеТиповСтроки_(150));
	ТаблицаКоды.Колонки.Добавить("КодУпаковки", 	ПолучитьОписаниеТиповСтроки_(150));
	
	Возврат ТаблицаКоды;
КонецФункции
//++Данилова Е.В. 13.05.2026 ASU-2790
Функция СоздатьТаблицуКодов_2() Экспорт
	
	ТаблицаКоды = Новый ТаблицаЗначений;
	ТаблицаКоды.Колонки.Добавить("КодКоробки",	ПолучитьОписаниеТиповСтроки_(150));
	ТаблицаКоды.Колонки.Добавить("КодУпаковки", ПолучитьОписаниеТиповСтроки_(150));
	ТаблицаКоды.Колонки.Добавить("ЗПС_Строка",ПолучитьОписаниеТиповСтроки_(150)); 
	ТаблицаКоды.Колонки.Добавить("КП_Строка",ПолучитьОписаниеТиповСтроки_(150)); 
	ТаблицаКоды.Колонки.Добавить("ЗПС_Ссылка", Новый ОписаниеТипов("ДокументСсылка.ЗаказПоставщику", , , , , , )); 
	ТаблицаКоды.Колонки.Добавить("КП_Ссылка", Новый ОписаниеТипов("ДокументСсылка.КонтрактСПроизводителем", , , , , , ));
	
	Возврат ТаблицаКоды;
КонецФункции
Функция ПолучитьОписаниеТиповСтроки_(ДлинаСтроки) Экспорт
	
	Массив = Новый Массив; 
	Массив.Добавить(Тип("Строка"));
	КвалификаторСтроки = Новый КвалификаторыСтроки(ДлинаСтроки, ДопустимаяДлина.Переменная);
	Возврат Новый ОписаниеТипов(Массив, , КвалификаторСтроки);
	
КонецФункции

Функция ПолучитьОписаниеТиповЧисла_(Разрядность,РазрядностьДробнойЧасти=0) Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	КвалификаторЧисла = Новый КвалификаторыЧисла(Разрядность,РазрядностьДробнойЧасти);
	Возврат Новый ОписаниеТипов(Массив, КвалификаторЧисла);
	
КонецФункции

Функция ПрочитатьТаблицуКодовИзСтроки_НаполнениеЗПС(СтрокаДанных) Экспорт
	Результат = Новый Структура("ДатаЗаказа,НомерЗаказа");
	
	ТКоды = СоздатьТаблицуКодов_2();   		
	
	Данные = МаркировкаКС.ПрочитатьЖСОН(СтрокаДанных, Истина);		
	Идентификаторзпс = Данные["id"]; 
	Контракты = Данные["contractList"];
	Для Каждого ДанныеКонтракта Из Контракты Цикл
		ИдентификаторКП = ДанныеКонтракта["id"];
		ДанныеПоКоробкам = ДанныеКонтракта["boxList"];
		Для Каждого Коробка Из ДанныеПоКоробкам Цикл
			КодКоробки = Прав(СокрЛП(Коробка["code"]), 18);

			Для Каждого КодУпаковки Из Коробка["Markes"] Цикл
				
				СтрокаТ = тКоды.Добавить();
				СтрокаТ.КодКоробки 	= КодКоробки;
				СтрокаТ.КодУпаковки	= Лев(КодУпаковки, 31);
				СтрокаТ.ЗПС_Строка = Идентификаторзпс; 
				СтрокаТ.КП_Строка = ИдентификаторКП; 
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	
	//Если Данные["number_order"] <> Неопределено  Тогда
	//	Результат.ДатаЗаказа	= Дата(СтрЗаменить(Лев(Данные["dateCreate"],10),"-",""));
	//	Результат.НомерЗаказа	= СокрЛП(Данные["number_order"]);
	//	
	//	Сообщить(СтрШаблон("Заказ № %1 от %2.",  Результат.НомерЗаказа, Формат(Результат.ДатаЗаказа, "ДФ=dd.MM.yyyy")));
	//		 
	//КонецЕсли;	
	Результат.Вставить("Коды", тКоды);
	Возврат Результат;
КонецФункции
//--Данилова Е.В. 13.05.2026 

Функция ПрочитатьТаблицуКодовИзСтроки(СтрокаДанных) Экспорт
	Результат = Новый Структура("ДатаЗаказа,НомерЗаказа");
	
	тКоды = СоздатьТаблицуКодов();   	
	
	МаркировкаКС.Состояние_("Чтение данных отчета....");
	
	Данные = МаркировкаКС.ПрочитатьЖСОН(СтрокаДанных, Истина);	
	
	МаркировкаКС.Состояние_("Заполнение входных данных....");
	Для Каждого Коробка Из Данные["aggregationUnits"] Цикл
		КодКоробки = Прав(СокрЛП(Коробка["unitSerialNumber"]),18);
		
		Для Каждого КодУпаковки Из Коробка["sntins"] Цикл
			СтрокаТ = тКоды.Добавить();
			СтрокаТ.КодКоробки 	= КодКоробки;
			СтрокаТ.КодУпаковки	= Лев(КодУпаковки,31);		 
		КонецЦикла;
	КонецЦикла;
	
	Если Данные["orderDate"] <> Неопределено  Тогда
		Результат.ДатаЗаказа	= Дата(СтрЗаменить(Лев(Данные["orderDate"],10),"-",""));
		Результат.НомерЗаказа	= СокрЛП(Данные["orderNumber"]);
		
		Сообщить(СтрШаблон("Заказ № %1 от %2.",  Результат.НомерЗаказа, Формат(Результат.ДатаЗаказа, "ДФ=dd.MM.yyyy")));
		 
	КонецЕсли;
	
	Результат.Вставить("Коды", тКоды);
	Возврат Результат;
КонецФункции //ПолучитьТаблицуКодовИзСтроки(СтрокаДанных)
//Данилова Е.В. 13.05.2026 ASU-2790 добавление параметра 
Функция СопоставитьКоды(ДанныеФайла,НаполнениеЗПС = Ложь) Экспорт
	//++Данилова Е.В. 13.05.2026 ASU-2790
	Если НаполнениеЗПС Тогда
		Возврат СопоставитьКоды_2(ДанныеФайла); 
	КонецЕсли;
	Результат = МаркировкаКС.СтруктураРезультата(Истина);

	Результат.Данные = Новый Структура("МВТ,КолКодовШтук,КолКодовКоробок", Новый МенеджерВременныхТаблиц, 0, 0);

	мЗаказПоставщику = Документы.ЗаказПоставщику.ПустаяСсылка();

	Запрос 		= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Результат.Данные.МВТ;
	Запрос.Текст 	= "      
					   |ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_ДанныеФайла ИЗ &ДанныеФайла КАК ДанныеФайла
	|;
	|ВЫБРАТЬ
	|	ВТ_ДанныеФайла.КодКоробки	КАК КодКоробки,
	|	Спр_Коробки.Ссылка			КАК ШтрихКодКоробки,	
	|
	|	ВТ_ДанныеФайла.КодУпаковки	КАК КодУпаковки,
	|	Спр_Упаковки.Ссылка 		КАК ШтрихКодУпаковки,
	|
	|	1							КАК Количество
	|ПОМЕСТИТЬ ВТ_РезультатыПоиска
	|ИЗ
	|	ВТ_ДанныеФайла
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК Спр_Коробки
	|ПО
	|	Спр_Коробки.Наименование = 	ВТ_ДанныеФайла.КодКоробки 
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК Спр_Упаковки
	|ПО
	|	Спр_Упаковки.Наименование = ВТ_ДанныеФайла.КодУпаковки
	|;
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КодУпаковки) 	КАК КолКодовШтук,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КодКоробки)	КАК КолКодовКоробок
	|ИЗ
	|	ВТ_РезультатыПоиска
	|";	 	 
	
	МаркировкаКС.Состояние_("Чтение кодов из базы ....");
	
	Запрос.УстановитьПараметр("ДанныеФайла", ДанныеФайла);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат.Данные, Выборка);	
	КонецЕсли;
	
	МаркировкаКС.Состояние_("");
	
	Возврат Результат;	
КонецФункции // ПрочитатьКодыИзСтроки(ИмяФайла)

Функция СопоставитьКоды_2(ДанныеФайла) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Истина);	
	
	Результат.Данные = Новый Структура("МВТ,КолКодовШтук,КолКодовКоробок", Новый МенеджерВременныхТаблиц, 0, 0);	
	Для Каждого СтрокаТЗ  Из ДанныеФайла Цикл
		ИдентификаторСсылки = Новый УникальныйИдентификатор(СтрокаТЗ.ЗПС_Строка);
		СсылкаНаОбъект = Документы.ЗаказПоставщику.ПолучитьСсылку(ИдентификаторСсылки); 
		Если СсылкаНаОбъект.ПолучитьОбъект() = Неопределено Тогда
			СтрокаТЗ.ЗПС_ссылка = Документы.ЗаказПоставщику.ПустаяСсылка(); 
		Иначе 
			СтрокаТЗ.ЗПС_ссылка =	СсылкаНаОбъект; 
		КонецЕсли;
		
		ИдентификаторСсылки = Новый УникальныйИдентификатор(СтрокаТЗ.КП_Строка);
		СсылкаНаОбъект = Документы.КонтрактСПроизводителем.ПолучитьСсылку(ИдентификаторСсылки); 
		Если СсылкаНаОбъект.ПолучитьОбъект() = Неопределено Тогда
			СтрокаТЗ.КП_ссылка = Документы.КонтрактСПроизводителем.ПустаяСсылка(); 
		Иначе 
			СтрокаТЗ.КП_ссылка =	СсылкаНаОбъект; 
		КонецЕсли;		
	КонецЦикла;	
	Запрос 		= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Результат.Данные.МВТ;
	Запрос.Текст 	= "      
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_ДанныеФайла ИЗ &ДанныеФайла КАК ДанныеФайла
	|;
	|ВЫБРАТЬ
	|	ВТ_ДанныеФайла.ЗПС_ссылка	КАК ЗПС_ссылка,
	|	ВТ_ДанныеФайла.КП_ссылка	КАК КП_ссылка,
	|	ВТ_ДанныеФайла.ЗПС_Строка	КАК ЗПС_строка,
	|	ВТ_ДанныеФайла.КП_Строка	КАК КП_строка,
	|	ВТ_ДанныеФайла.КодКоробки	КАК КодКоробки,
	|	Спр_Коробки.Ссылка			КАК ШтрихКодКоробки,	
	|
	|	ВТ_ДанныеФайла.КодУпаковки	КАК КодУпаковки,
	|	Спр_Упаковки.Ссылка 		КАК ШтрихКодУпаковки,
	|
	|	1							КАК Количество
	|ПОМЕСТИТЬ ВТ_РезультатыПоиска
	|ИЗ
	|	ВТ_ДанныеФайла
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК Спр_Коробки
	|ПО
	|	Спр_Коробки.Наименование = 	ВТ_ДанныеФайла.КодКоробки 
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК Спр_Упаковки
	|ПО
	|	Спр_Упаковки.Наименование = ВТ_ДанныеФайла.КодУпаковки
	|;
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КодУпаковки) 	КАК КолКодовШтук,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КодКоробки)	КАК КолКодовКоробок
	|ИЗ
	|	ВТ_РезультатыПоиска
	|";	 	
	
	
	Запрос.УстановитьПараметр("ДанныеФайла", ДанныеФайла);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат.Данные, Выборка);	
	КонецЕсли;	
	
	Возврат Результат;	
КонецФункции
#КонецОбласти
