
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьМинимальныеКоличества(); 
КонецПроцедуры 
&НаСервере
Процедура ЗаполнитьМинимальныеКоличества()
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеквизитыСправочников.Справочник КАК ВидНоменклатуры,
		|	РеквизитыСправочников.ЗначениеРеквизита КАК Количество
		|ИЗ
		|	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
		|ГДЕ
		|	РеквизитыСправочников.ИмяРеквизита = &ИмяРеквизита";
	
	Запрос.УстановитьПараметр("ИмяРеквизита", "МинКоличествоЗаказFBO");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДанныеМинимальныеКоличества.Загрузить(РезультатЗапроса.Выгрузить()); 	

КонецПроцедуры


&НаСервере
Процедура СохранитьИзмененияНаСервере()
	Если Не Модифицированность Тогда
		
		Сообщить("Изменений нет"); 
	Иначе 
		
		НаборЗаписей = РегистрыСведений.РеквизитыСправочников.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.ИмяРеквизита.Установить("МинКоличествоЗаказFBO");
		НаборЗаписей.Записать(); 
		
		Для каждого СтрокаМинКолво Из ДанныеМинимальныеКоличества Цикл
			
			МенеджерЗаписи = РегистрыСведений.РеквизитыСправочников.СоздатьМенеджерЗаписи(); 
			МенеджерЗаписи.Справочник = СтрокаМинКолво.ВидНоменклатуры; 
			МенеджерЗаписи.ИмяРеквизита = "МинКоличествоЗаказFBO"; 
			МенеджерЗаписи.ЗначениеРеквизита =  СтрокаМинКолво.Количество; 
			МенеджерЗаписи.Записать(); 
		КонецЦикла; 
		
		Модифицированность = Ложь; 
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СохранитьИзменения(Команда)
	СохранитьИзмененияНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ДанныеМинимальныеКоличестваПриИзменении(Элемент)
	Модифицированность = Истина; 
КонецПроцедуры

