
Процедура ОбработкаПроведения(Отказ, Режим) Экспорт
	рег = РегистрыСведений.КомпьютерноеОборудование;
	Для Каждого стр из  Оборудование Цикл
		Выборка = рег.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ИнвентарныйНомер = стр.Номенклатура.Код и Выборка.СерийныйНомер = стр.СерийныйНомер и Выборка.Категория = стр.Категория Тогда
				Выборка.ПолучитьМенеджерЗаписи().Удалить();
				Прервать;
			КонецЕсли;
		КонецЦикла;
        Элемент = Рег.СоздатьМенеджерЗаписи();
        Элемент.ИнвентарныйНомер = стр.Номенклатура.Код;
        Элемент.СерийныйНомер = стр.СерийныйНомер;
        Элемент.Категория = стр.Категория;
        Элемент.СрокГарантии = стр.СрокГарантии;
        Элемент.НачальнаяЦена = стр.НачальнаяЦена;
        Элемент.ДатаВводаВЭксплуатацию = ДатаВводаВЭксплуатацию;
        Элемент.Записать();
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КомпьютерноеОборудование.ИнвентарныйНомер
		|ИЗ
		|	РегистрСведений.КомпьютерноеОборудование КАК КомпьютерноеОборудование
		|ГДЕ
		|	КомпьютерноеОборудование.ИнвентарныйНомер = &ИнвентарныйНомер";
		ДокОснование = Основание;
		ДатаВводаВЭксплуатацию = Основание.Дата;
		Для Каждого ТекСтрокаТовары Из Основание.Товары Цикл
			Если ТекСтрокаТовары.Номенклатура.Родитель.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.КомпьютернаяТехника Тогда
				Если ТекСтрокаТовары.Количество = 1 Тогда
					Запрос.УстановитьПараметр("ИнвентарныйНомер", ТекСтрокаТовары.Номенклатура.Код);
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Количество() = 0 ТОгда
						НоваяСтрока = Оборудование.Добавить();
						НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
						НоваяСтрока.НачальнаяЦена = ТекСтрокаТовары.Цена;
					КонецЕсли;
				Иначе
					Сообщить("По номенклатуре "+ТекСтрокаТовары.Номенклатура+" количество отлично от 1");
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	рег = РегистрыСведений.КомпьютерноеОборудование;
	Для Каждого стр из  Оборудование Цикл
		Выборка = рег.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ИнвентарныйНомер = стр.Номенклатура.Код и Выборка.СерийныйНомер = стр.СерийныйНомер и Выборка.Категория = стр.Категория Тогда
				Выборка.ПолучитьМенеджерЗаписи().Удалить();
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
