
Функция ОткрытьСоздатьПланНабора(Накладная) Экспорт
	Если НЕ ЗначениеЗаполнено(Накладная) Тогда Возврат Ложь КонецЕсли;	
	
	
	
	// Кухарь А.Ю. 23.06.2020 начало
	// ПланНабораСсылка=Документы.ПланНабора.НайтиПоРеквизиту("ДокОснование",Накладная);
	ПланНабораСсылка=Документы.ПланНабора.ПустаяСсылка();	
	Запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ ПЕРВЫЕ 1
	              |	ПланНабора.Ссылка КАК Ссылка
	              |ИЗ
	              |	Документ.ПланНабора КАК ПланНабора
	              |ГДЕ
	              |	ПланНабора.ДокОснование = &ДокОснование
	              |	И НЕ ПланНабора.ПометкаУдаления
	              |	И ПланНабора.Дата > &Дата";
	запрос.УстановитьПараметр("ДокОснование",Накладная); 
	// Кухарь А.Ю. 11.08.2021 начало
	//Иногда дата накладной чуть больше даты плана набора
	//	запрос.УстановитьПараметр("Дата",Мин(Константы.ДатаЗапретаРедактирования.Получить(),накладная.дата));
	запрос.УстановитьПараметр("Дата",Мин(ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования(),НачалоМесяца(накладная.дата))); 
	// Кухарь А.Ю. 11.08.2021 конец

	результат=запрос.Выполнить().Выбрать();
	пока результат.Следующий() цикл
		ПланНабораСсылка=результат.ссылка;
	КонецЦикла;
	// Кухарь А.Ю. 23.06.2020 конец
	
	
	ТолькоПросмотр=Ложь;
	Если ЕстьБлокировкаНоменклатуры(Накладная) Тогда
		Если ПланНабораСсылка.Пустая() Тогда
			Сообщить("В документе присутствует заблокированная для инвентаризации номенклатура! Создание плана набора запрещено !");
			Возврат Ложь;		
		Иначе
			ТолькоПросмотр=Истина;
			Сообщить("В документе присутствует заблокированная для инвентаризации номенклатура! Возможен только просмотр документа !");
		КонецЕсли;		
	КонецЕсли;		
	
	Если ПланНабораСсылка.Пустая() Тогда
		Если ПараметрыСеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.Склад Тогда
			// Кухарь А.Ю. 19.02.2020 начало
			//  			Если Накладная.СостояниеНакладной <> Перечисления.СостоянияНакладной.ПолученоСкладом Тогда
			Если Накладная.СостояниеНакладной <> Перечисления.СостоянияНакладной.ПолученоСкладом и Накладная.склад.видсклада<>Перечисления.ВидСклада.ВиртуальныйДляСклада  Тогда			 
				// Кухарь А.Ю. 19.02.2020 конец
				
				Сообщить("Планы набора можно создавать только в состоянии ""Получено складом"" !");
				Возврат Ложь;		
			КонецЕсли;		
		КонецЕсли;
		
		ПланНабораОбъект=Документы.ПланНабора.СоздатьДокумент();			
		ПланНабораОбъект.Заполнить(Накладная);
		
		// Кухарь А.Ю.  21.12.2022 начало
		// ПРМ сверху вниз, теперь требуются планы набора и ЗНБ
		если ТипЗнч(Накладная) =Тип("ДокументСсылка.Перемещение") тогда
			если Накладная.склад.видсклада=Перечисления.ВидСклада.ВиртуальныйДляСклада или   Накладная.СкладПолучатель.видсклада=Перечисления.ВидСклада.ВиртуальныйДляСклада  тогда
				ПланНабораОбъект.СозданоОбработкойПополнения=Истина;
			КонецЕсли;
		КонецЕсли;
		// Кухарь А.Ю.  21.12.2022 конец
		
		
		
	Иначе
		ПланНабораОбъект=ПланНабораСсылка.ПолучитьОбъект();
	КонецЕсли;		
	
	Форма=ПланНабораОбъект.ПолучитьФорму();
	Форма.ТолькоПросмотр=ТолькоПросмотр;
	Форма.Открыть();	
	
	Возврат Истина;
КонецФункции //ОткрытьСоздатьПланНабора(Накладная)

Функция СоздатьПланНабораАвтоРаспределение(Накладная) Экспорт
	Если НЕ ЗначениеЗаполнено(Накладная) Тогда Возврат Ложь КонецЕсли;	
	Запрос=новый запрос;
	запрос.Текст=  "ВЫБРАТЬ
	|	ПланНабора.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПланНабора КАК ПланНабора
	|ГДЕ
	|	ПланНабора.ДокОснование = &ДокОснование
	|	И ПланНабора.Проведен
	|	И ПланНабора.Дата >= &Дата";	
	запрос.УстановитьПараметр("Дата",Накладная.дата-30*24*3600);	
	запрос.УстановитьПараметр("ДокОснование",Накладная);
	Результат=запрос.Выполнить().Выбрать();
	пока Результат.Следующий() цикл
		СообщитьИзМодуля("План набора уже есть");
		возврат Ложь;
	КонецЦикла;
	
	ТолькоПросмотр=Ложь;
	Если ЕстьБлокировкаНоменклатуры(Накладная) Тогда
		Сообщить("В документе присутствует заблокированная для инвентаризации номенклатура! Создание плана набора запрещено !");
		Возврат Ложь;			
	КонецЕсли;		
	
	
	Если ПараметрыСеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.Склад Тогда
		Если Накладная.СостояниеНакладной <> Перечисления.СостоянияНакладной.ПолученоСкладом и Накладная.склад.видсклада<>Перечисления.ВидСклада.ВиртуальныйДляСклада  Тогда			 
			Сообщить("Планы набора можно создавать только в состоянии ""Получено складом"" !");
			Возврат Ложь;		
		КонецЕсли;		
	КонецЕсли;
	
	ПланНабораОбъект=Документы.ПланНабора.СоздатьДокумент();			
	ПланНабораОбъект.Заполнить(Накладная);
	
	ПланНабораОбъект.АвтоматическиРазбитьПН_СформироватьЗНБ();
	
	Возврат Истина;
КонецФункции //ОткрытьСоздатьПланНабора(Накладная)

#Область СлужебныйНаборщик
Функция ЗаполнитьСлужебногоНаборщикаFBS(ТЗ_Брэндов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ_Брэндов", ТЗ_Брэндов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТЗ_Брэндов.СекторХранения КАК СТРОКА(10)) КАК Сектор,
	|	ВЫРАЗИТЬ(ТЗ_Брэндов.Брэнд КАК Справочник.Номенклатура) КАК Брэнд,
	|	ВЫРАЗИТЬ(ТЗ_Брэндов.Коллекция КАК Справочник.Номенклатура) КАК Коллекция,
	|	ВЫРАЗИТЬ(ТЗ_Брэндов.Наборщик КАК Справочник.ФизическиеЛица) КАК Наборщик
	|ПОМЕСТИТЬ вр_Брэнды
	|ИЗ
	|	&ТЗ_Брэндов КАК ТЗ_Брэндов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_Брэнды.Сектор КАК Сектор,
	|	РеквизитыСправочников.ЗначениеРеквизита КАК СекторХранения,
	|	вр_Брэнды.Брэнд КАК Брэнд,
	|	вр_Брэнды.Коллекция КАК Коллекция,
	|	вр_Брэнды.Наборщик КАК НаборщикИзДокумента
	|ПОМЕСТИТЬ тз_Сектора
	|ИЗ
	|	вр_Брэнды КАК вр_Брэнды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
	|		ПО (вр_Брэнды.Брэнд = РеквизитыСправочников.Справочник
	|				ИЛИ вр_Брэнды.Коллекция = РеквизитыСправочников.Справочник)
	|ГДЕ
	|	РеквизитыСправочников.ИмяРеквизита = ""СекторНоменклатуры""
	|	И ТИПЗНАЧЕНИЯ(РеквизитыСправочников.Справочник) = ТИП(Справочник.Номенклатура)
	|	И ТИПЗНАЧЕНИЯ(РеквизитыСправочников.ЗначениеРеквизита) = ТИП(Справочник.СектораХранения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тз_Сектора.Сектор КАК Сектор,
	|	тз_Сектора.СекторХранения КАК СекторХранения,
	|	тз_Сектора.Брэнд КАК Брэнд,
	|	тз_Сектора.Коллекция КАК Коллекция,
	|	тз_Сектора.НаборщикИзДокумента КАК НаборщикИзДокумента,
	|	РеквизитыСправочников.ЗначениеРеквизита КАК СлужебныйНаборщик
	|ИЗ
	|	тз_Сектора КАК тз_Сектора
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
	|		ПО тз_Сектора.СекторХранения = РеквизитыСправочников.Справочник
	|ГДЕ
	|	РеквизитыСправочников.ИмяРеквизита = ""СлужебныйНаборщик""
	|	И ТИПЗНАЧЕНИЯ(РеквизитыСправочников.Справочник) = ТИП(Справочник.СектораХранения)
	|	И ТИПЗНАЧЕНИЯ(РеквизитыСправочников.ЗначениеРеквизита) = ТИП(Справочник.ФизическиеЛица)";
	
	УстановитьПривилегированныйРежим(Истина);
	ТЗ_Наборщики = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТЗ_Наборщики;
	
КонецФункции
#КонецОбласти 

//++Ратманов 24.03.2026
Процедура ЗаписатьВремяСканирования(ПараметрыВыполнения) Экспорт
КонецПроцедуры