Перем ИмяСекцииКонца;
Перем пВыходнаяФорма Экспорт;
// Кухарь А.Ю. 23.03.2021 начало
//
Перем ПростоЗаписать;
// Кухарь А.Ю. 23.03.2021 конец

// Кухарь А.Ю. 23.03.2021 начало
Процедура ЗаписатьБезОбработки(РежимЗаписи) экспорт
	ПростоЗаписать=Истина;
	//ОбменДанными.Загрузка=Истина;
	если РежимЗаписи=РежимЗаписиДокумента.Проведение тогда
		Проведен=Истина;
		ПометкаУдаления=Ложь;
	КонецЕсли;
	Записать();
КонецПроцедуры
// Кухарь А.Ю. 23.03.2021 конец


Функция ПолучитьСекторХранения(Брэнд)
	Если ПараметрыСеанса.ЭтотУзел.Код = "ODM" Тогда		
		Возврат ПолучитьРеквизитРодителя(Брэнд, "СекторХраненияОдинцово4");
	Иначе
		Возврат ПолучитьРеквизитРодителя(Брэнд, "СекторХранения");
	КонецЕсли;
КонецФункции // ПолучитьСекторХранения(Брэнд)

Функция ПолучитьСекторНабора(Коллекция)
	Возврат ПолучитьРеквизитРодителя(Коллекция,"СекторХраненияОдинцово4")
КонецФункции // ПолучитьСекторНабора(Коллекция) 

Функция РассчитатьОбъемКоробки(Количество,ОбъемКоробки,ШтукВКоробке)
	Если ТипЗнч(ШтукВКоробке)=Тип("Число") И ШтукВКоробке>0 Тогда
		Возврат Количество*ОбъемКоробки/ШтукВКоробке;
	Иначе
		Возврат ОбъемКоробки;
	КонецЕсли;
КонецФункции //РассчитатьОбъектКоробки(Количество,ОбъемКоробки,ШтукВКоробке)

// Кухарь А.Ю.  13.11.2024 начало
// Процедура ЗаполнитьТаблицуБрэндов() Экспорт
//Данилова Е.В. 24.02.2026 HELP-8893 добавлен параметр
Процедура ЗаполнитьТаблицуБрэндов(ВыкидыватьРасходники=ложь,ДанныеДляРазделения = неопределено) Экспорт
	// Кухарь А.Ю.  13.11.2024 конец
	
	Если НЕ ЗначениеЗаполнено(Накладная) Тогда Возврат КонецЕсли;	
	
	// Кухарь А.Ю. 19.02.2020 начало
	// Для пополнения по остаткам не проверяем
	если Склад.ВидСклада=Перечисления.ВидСклада.ВиртуальныйДляСклада тогда
		ЭтоПополнение=Истина;
	иначе
		ЭтоПополнение=Ложь;
	КонецЕсли;	
	// Кухарь А.Ю. 19.02.2020 конец
	
	
	
	ВидНакладной		= Накладная.Метаданные().Имя;
	
	ОтделятьМаркированныйТовар=ОпределитьНеобходимостьМаркировкиПоНакладной(Накладная);
	
	// Кухарь А.Ю.  31.03.2024 начало
	если ВидНакладной="РасходнаяНакладная" или ВидНакладной="Перемещение" тогда
		ДатаОтгрузки=ПолучитьРеквизитШапки(Накладная,"ДатаОтгрузки","Документ");				
	иначе
		ДатаОтгрузки=ТекущаяДата();	
	КонецЕсли;
	
	если ДатаОтгрузки=ПустаяДата() тогда
		ДатаОтгрузки=ТекущаяДата();
	КонецЕсли;
	// Кухарь А.Ю.  31.03.2024 конец
	
	
	
	
	
	ЭтоРНКсКМПЛ			= ВидНакладной = "Комплектация" ИЛИ (ВидНакладной = "РасходнаяНакладная" И Накладная.ОтгрузкаКомплектов);	
	ИмяТабЧасти			= ?(ЭтоРНКсКМПЛ,"Комплектующие","Товары");	  
	
	
	
	// Кухарь А.Ю.  19.11.2024 начало
	//
	Если (ВидНакладной = "РасходнаяНакладная" или ВидНакладной = "Перемещение")  и ОтделятьМаркированныйТовар тогда
		ТаблицаПереопределяемыхДат=МаркировкаКС.ПодготовитьТаблицуСПереопределяемойДатойНачалаРаботыСМаркировкой(Накладная,ИмяТабЧасти);			
	КонецЕсли;
	// Кухарь А.Ю.  19.11.2024 конец
	
	Запрос			= Новый Запрос;	  
	
	
	
	// Кухарь А.Ю.  30.01.2026 начало 
	ТаблицаСПризнакомАдресногоХранения = ПолучитьТаблицуТоваровКАдресногоХранения(Накладная,ИмяТабЧасти); 
	запрос.УстановитьПараметр("ТаблицаСПризнакомАдресногоХранения",ТаблицаСПризнакомАдресногоХранения);
	// Кухарь А.Ю.  30.01.2026 конец
	
	// Кухарь А.Ю.  19.11.2024 начало
	//
	если ТаблицаПереопределяемыхДат = Неопределено или ТаблицаПереопределяемыхДат.Количество()=0 тогда 
		// Кухарь А.Ю.  19.11.2024 конец
		//|	Документ." + ВидНакладной + "." + ИмяТабЧасти + " КАК НакладнаяТовары	
		
		Запрос.Текст 	= "ВЫБРАТЬ
		|	ТаблицаСПризнакомАдресногоХранения.Номенклатура КАК Номенклатура,
		|	ТаблицаСПризнакомАдресногоХранения.АдресноеХранение КАК АдресноеХранение
		|ПОМЕСТИТЬ ВТАдресов
		|ИЗ
		|	&ТаблицаСПризнакомАдресногоХранения КАК ТаблицаСПризнакомАдресногоХранения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НакладнаяТовары.Номенклатура.Родитель.Родитель.Родитель КАК Брэнд,
		|	НакладнаяТовары.Номенклатура.Родитель.Родитель КАК Коллекция,
		|	НакладнаяТовары.Номенклатура.Родитель.ОбъемКоробки КАК ОбъемКоробки,
		|	НакладнаяТовары.Номенклатура.Родитель.ШтукВКоробке КАК ШтукВКоробке,
		|	ВЫБОР
		|		КОГДА НакладнаяТовары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой <> &ПустаяДата
		|				И НакладнаяТовары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой <= &ДатаОтгрузки
		|				И &ОтделятьМаркированныйТовар
		|			ТОГДА ИСТИНА
		|		КОГДА НакладнаяТовары.Номенклатура.ОтгрузкаТолькоЧерезЧЗ
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ТребуетсяМаркировка,
		|	1 КАК КоличествоСтрок,
		|	НакладнаяТовары.Количество КАК Количество,
		|	0 КАК КоличествоДляНаборов,
		|	ЛОЖЬ КАК ТребуетсяФормированиеНабораЧЗ,
		|	НакладнаяТовары.Объем КАК Объем,
		|	ЕСТЬNULL(ВТАдресов.АдресноеХранение, ЛОЖЬ) КАК АдресноеХранение
		|ПОМЕСТИТЬ ИсходныеДанные
		|ИЗ
		|	Документ." + ВидНакладной + "." + ИмяТабЧасти + " КАК НакладнаяТовары			
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАдресов КАК ВТАдресов
		|		ПО НакладнаяТовары.Номенклатура = ВТАдресов.Номенклатура
		|ГДЕ
		|	НакладнаяТовары.Ссылка = &Ссылка
		|	И НакладнаяТовары.Номенклатура.Родитель.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Услуга)
		|	И НакладнаяТовары.Количество > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсходныеДанные.Брэнд КАК Брэнд,
		|	ИсходныеДанные.Коллекция КАК Коллекция,
		|	ИсходныеДанные.ТребуетсяМаркировка КАК ТребуетсяМаркировка,
		|	СУММА(ИсходныеДанные.КоличествоСтрок) КАК КоличествоСтрок,
		|	СУММА(ИсходныеДанные.Количество) КАК Количество,
		|	СУММА(ИсходныеДанные.Объем) КАК Объем,
		|	СУММА(ВЫБОР
		|			КОГДА ИсходныеДанные.ТребуетсяМаркировка
		|				ТОГДА ИсходныеДанные.КоличествоДляНаборов
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоДляНаборов,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ИсходныеДанные.ТребуетсяМаркировка
		|				ТОГДА ИсходныеДанные.ТребуетсяФормированиеНабораЧЗ
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК ТребуетсяФормированиеНабораЧЗ,
		|	СУММА(ИсходныеДанные.ОбъемКоробки * ИсходныеДанные.Количество / ВЫБОР
		|			КОГДА ИсходныеДанные.ШтукВКоробке = 0
		|				ТОГДА 1
		|			ИНАЧЕ ИсходныеДанные.ШтукВКоробке
		|		КОНЕЦ) КАК ОбъемКоробов,
		|	ИсходныеДанные.АдресноеХранение КАК АдресноеХранение
		|ИЗ
		|	ИсходныеДанные КАК ИсходныеДанные
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсходныеДанные.Брэнд,
		|	ИсходныеДанные.Коллекция,
		|	ИсходныеДанные.ТребуетсяМаркировка,
		|	ИсходныеДанные.АдресноеХранение
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИсходныеДанные.Брэнд,
		|	ИсходныеДанные.Коллекция";	
		// Кухарь А.Ю.  19.11.2024 начало
		//
	иначе	
		Запрос.Текст 	= "ВЫБРАТЬ
		|	ТаблицаСПризнакомАдресногоХранения.Номенклатура КАК Номенклатура,
		|	ТаблицаСПризнакомАдресногоХранения.АдресноеХранение КАК АдресноеХранение
		|ПОМЕСТИТЬ ВТАдресов
		|ИЗ
		|	&ТаблицаСПризнакомАдресногоХранения КАК ТаблицаСПризнакомАдресногоХранения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДат.Номенклатура КАК Номенклатура,
		|	ТаблицаДат.ДатаНачалаРаботыСМаркировкой КАК ДатаНачалаРаботыСМаркировкой
		|ПОМЕСТИТЬ ТаблицаСДатами
		|ИЗ
		|	&ТаблицаПереопределяемыхДат КАК ТаблицаДат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НакладнаяТовары.Номенклатура.Родитель.Родитель.Родитель КАК Брэнд,
		|	НакладнаяТовары.Номенклатура.Родитель.Родитель КАК Коллекция,
		|	НакладнаяТовары.Номенклатура.Родитель.ОбъемКоробки КАК ОбъемКоробки,
		|	НакладнаяТовары.Номенклатура.Родитель.ШтукВКоробке КАК ШтукВКоробке,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТаблицаСДатами.ДатаНачалаРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
		|				И ЕСТЬNULL(ТаблицаСДатами.ДатаНачалаРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1)) <= &ДатаОтгрузки
		|				И &ОтделятьМаркированныйТовар
		|			ТОГДА ИСТИНА
		|		КОГДА НакладнаяТовары.Номенклатура.ОтгрузкаТолькоЧерезЧЗ
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ТребуетсяМаркировка,
		|	1 КАК КоличествоСтрок,
		|	НакладнаяТовары.Количество КАК Количество,
		|	0 КАК КоличествоДляНаборов,
		|	ЛОЖЬ КАК ТребуетсяФормированиеНабораЧЗ,
		|	НакладнаяТовары.Объем КАК Объем,
		|	ТаблицаСДатами.ДатаНачалаРаботыСМаркировкой КАК ДатаНачалаРаботыСМаркировкой,
		|	ЕСТЬNULL(ВТАдресов.АдресноеХранение, ЛОЖЬ) КАК АдресноеХранение
		|ПОМЕСТИТЬ ИсходныеДанные
		|ИЗ
		|	Документ." + ВидНакладной + "." + ИмяТабЧасти + " КАК НакладнаяТовары 
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСДатами КАК ТаблицаСДатами
		|		ПО НакладнаяТовары.Номенклатура = ТаблицаСДатами.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАдресов КАК ВТАдресов
		|		ПО НакладнаяТовары.Номенклатура = ВТАдресов.Номенклатура
		|ГДЕ
		|	НакладнаяТовары.Ссылка = &Ссылка
		|	И НакладнаяТовары.Номенклатура.Родитель.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Услуга)
		|	И НакладнаяТовары.Количество > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсходныеДанные.Брэнд КАК Брэнд,
		|	ИсходныеДанные.Коллекция КАК Коллекция,
		|	ИсходныеДанные.ТребуетсяМаркировка КАК ТребуетсяМаркировка,
		|	СУММА(ИсходныеДанные.КоличествоСтрок) КАК КоличествоСтрок,
		|	СУММА(ИсходныеДанные.Количество) КАК Количество,
		|	СУММА(ИсходныеДанные.Объем) КАК Объем,
		|	СУММА(ВЫБОР
		|			КОГДА ИсходныеДанные.ТребуетсяМаркировка
		|				ТОГДА ИсходныеДанные.КоличествоДляНаборов
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоДляНаборов,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ИсходныеДанные.ТребуетсяМаркировка
		|				ТОГДА ИсходныеДанные.ТребуетсяФормированиеНабораЧЗ
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК ТребуетсяФормированиеНабораЧЗ,
		|	СУММА(ИсходныеДанные.ОбъемКоробки * ИсходныеДанные.Количество / ВЫБОР
		|			КОГДА ИсходныеДанные.ШтукВКоробке = 0
		|				ТОГДА 1
		|			ИНАЧЕ ИсходныеДанные.ШтукВКоробке
		|		КОНЕЦ) КАК ОбъемКоробов,
		|	ИсходныеДанные.АдресноеХранение КАК АдресноеХранение
		|ИЗ
		|	ИсходныеДанные КАК ИсходныеДанные
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсходныеДанные.Брэнд,
		|	ИсходныеДанные.Коллекция,
		|	ИсходныеДанные.ТребуетсяМаркировка,
		|	ИсходныеДанные.АдресноеХранение
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИсходныеДанные.Брэнд,
		|	ИсходныеДанные.Коллекция";	
		
		запрос.УстановитьПараметр("ТаблицаПереопределяемыхДат",ТаблицаПереопределяемыхДат);	
	КонецЕсли;
	// Кухарь А.Ю.  19.11.2024 конец
	
	
	
	Запрос.УстановитьПараметр("Ссылка", Накладная);	
	// Кухарь А.Ю.  31.03.2024 начало
	Запрос.УстановитьПараметр("ОтделятьМаркированныйТовар", ОтделятьМаркированныйТовар); 
	// Кухарь А.Ю.  31.03.2024 конец
	// Кухарь А.Ю.  21.05.2024 начало
	//
	Запрос.УстановитьПараметр("ПустаяДата", ПустаяДата());
	Запрос.УстановитьПараметр("ДатаОтгрузки",ДатаОтгрузки );
	// Кухарь А.Ю.  21.05.2024 конец
	
	
	// Кухарь А.Ю.  06.11.2024 начало
	//
	если ИмяТабЧасти="Комплектующие" тогда
		ПолеКоличествоДляНаборов="ВЫБОР
		// Кухарь А.Ю.  28.03.2026 начало 
		//HELP-9255
		//|КОГДА НакладнаяТовары.Номенклатура = НакладнаяТовары.Продукция          
		|КОГДА НакладнаяТовары.Номенклатура = НакладнаяТовары.Продукция или НакладнаяТовары.Продукция.Родитель.ВидКомплекта <> значение(Перечисление.ВидыКомплектов.Комплект)
		// Кухарь А.Ю.  28.03.2026 конец	
		|	ТОГДА 0
		|ИНАЧЕ НакладнаяТовары.Количество
		|КОНЕЦ КАК КоличествоДляНаборов";
		
		ПолеТребуетсяФормированиеНабораЧЗ="ВЫБОР		     
		// Кухарь А.Ю.  28.03.2026 начало   
		//HELP-9255
		//|КОГДА НакладнаяТовары.Номенклатура = НакладнаяТовары.Продукция          
		|КОГДА НакладнаяТовары.Номенклатура = НакладнаяТовары.Продукция или НакладнаяТовары.Продукция.Родитель.ВидКомплекта <> значение(Перечисление.ВидыКомплектов.Комплект)
		// Кухарь А.Ю.  28.03.2026 конец			
		|	ТОГДА ЛОЖЬ
		|ИНАЧЕ ИСТИНА
		|КОНЕЦ КАК ТребуетсяФормированиеНабораЧЗ";
		
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"0 КАК КоличествоДляНаборов",ПолеКоличествоДляНаборов);
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"ЛОЖЬ КАК ТребуетсяФормированиеНабораЧЗ",ПолеТребуетсяФормированиеНабораЧЗ);		
	КонецЕсли;
	// Кухарь А.Ю.  06.11.2024 конец
	
	
	// Кухарь А.Ю.  13.11.2024 начало
	если ВыкидыватьРасходники тогда
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"И НакладнаяТовары.Номенклатура.Родитель.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Услуга)","И НакладнаяТовары.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)");	
	КонецЕсли;
	// Кухарь А.Ю.  13.11.2024 конец
	
	Выборка = Запрос.Выполнить().Выбрать();	
	//++Данилова Е.В. 24.02.2026 HELP-8893
	ПерезаполнитьСтрокиПоБрендам = Ложь; 
	Если ДанныеДляРазделения <> Неопределено Тогда
	
		ПерезаполнитьСтрокиПоБрендам = истина; 
		ТБрендовКопия = ДанныеДляРазделения.тБрэндов; 
		ТоварыДляПереноса = ДанныеДляРазделения.ТоварыДляПереноса; 
	КонецЕсли;
	//--Данилова Е.В. 24.02.2026
	
	тБрэндов.Очистить();
	
	ВремяРаспределения = ТекущаяДата();	
	
	Пока Выборка.Следующий() Цикл		
		СтрокаТБ = тБрэндов.Добавить();			
		
		ЗаполнитьЗначенияСвойств(СтрокаТБ, Выборка);
		
		СтрокаТБ.СекторХранения 		= ПолучитьСекторХранения(Выборка.Брэнд);
		СтрокаТБ.СекторНабора			= ПолучитьСекторНабора(Выборка.Коллекция);		
		// Кухарь А.Ю. 19.02.2020 начало
		
		// Кухарь А.Ю. 15.03.2021 начало
		// 		СтрокаТБ.Состояние 				= Перечисления.СостоянияНакладной.ОжиданиеНабора;
		
		// Кухарь А.Ю. 17.03.2021 начало
		// СтрокаТБ.Состояние 				= Перечисления.СостоянияНакладной.ПолученоСкладом;
		СтрокаТБ.Состояние 				= Перечисления.СостоянияНакладной.СформированыЗаданияНабора; 
		// Кухарь А.Ю. 17.03.2021 конец
		
		// Кухарь А.Ю. 15.03.2021 конец
		
		//если ЭтоПополнение тогда
		//	СтрокаТБ.Состояние 				= Перечисления.СостоянияНакладной.ПроверенаПоОстаткам;
		//иначе		
		//	СтрокаТБ.Состояние 				= Перечисления.СостоянияНакладной.ПолученоСкладом;
		//КонецЕсли;				
		// Кухарь А.Ю. 19.02.2020 конец
		
		СтрокаТБ.ВремяРаспределения 	= ВремяРаспределения;
		СтрокаТБ.ВремяТекущегоСостояния = ВремяРаспределения;
		//++Данилова Е.В. 24.02.2026 HELP-8893 
		Если ПерезаполнитьСтрокиПоБрендам Тогда
			отбор = Новый Структура("Коллекция",СтрокаТБ.Коллекция); 
			СтрокиСохраненные = ТБрендовКопия.НайтиСтроки(отбор); 	
			Если СтрокиСохраненные.Количество() > 0  Тогда 
				
				Если НЕ СтрокиСохраненные[0].Разделять Тогда
					ЗаполнитьЗначенияСвойств(СтрокаТБ,СтрокиСохраненные[0]); 
					//СтрокаТБ.ВремяРаспределения 	= ВремяРаспределения;
					//СтрокаТБ.ВремяТекущегоСостояния = ВремяРаспределения;
				Иначе 
					ЗаполнитьЗначенияСвойств(СтрокаТБ,СтрокиСохраненные[0]);
					СтрокаТБ.Состояние = Перечисления.СостоянияНакладной.СформированыЗаданияНабора;
					СтрокаТБ.ВремяРаспределения 	= ВремяРаспределения;
					СтрокаТБ.ВремяТекущегоСостояния = ВремяРаспределения;
					СтрокаТБ.Разделенная = Истина; 
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		//--Данилова Е.В. 24.02.2026 
	КонецЦикла;
	//++Данилова Е.В. 24.02.2026 HELP-8893 
	//добавим в конце строки по брендам
	Отбор = Новый Структура("Разделенная",истина); 
	СтрокиРазделить = тБрэндов.НайтиСтроки(Отбор);
	Для каждого СтрокаРазделить  Из СтрокиРазделить Цикл
		ОтборПоКоллекции = Новый Структура("Коллекция",СтрокаРазделить.Коллекция);
		СтрокиТовПереноса = ТоварыДляПереноса.НайтиСтроки(ОтборПоКоллекции); 
		Если СтрокиТовПереноса.Количество() > 0 Тогда
			
			СтрокаТБ = тБрэндов.Добавить();		
			ЗаполнитьЗначенияСвойств(СтрокаТБ, СтрокаРазделить,,"НомерСтроки");	
			СтрокаТБ.Разделенная = Ложь;	
			СтрокаТБ.ВремяРаспределения 	= ВремяРаспределения;
			СтрокаТБ.ВремяТекущегоСостояния = ВремяРаспределения;
		КонецЕсли;
		
		//номер части оставим как есть, чтобы потом по ней соединять?? возможно 
	КонецЦикла;
	//--Данилова Е.В. 24.02.2026 
	
КонецПроцедуры

//крохин начало 14.09.2012  
//Данилова Е.В. 24.02.2026 HELP-8893
Процедура ЗаполнитьТаблицуБрэндовШарапово(ДанныеДляРазделения = неопределено) Экспорт 
	Если НЕ ЗначениеЗаполнено(Накладная) Тогда  Возврат КонецЕсли;	
	
	ВидНакладной		= Накладная.Метаданные().Имя;		
	
	
	ОтделятьМаркированныйТовар=ОпределитьНеобходимостьМаркировкиПоНакладной(Накладная);
	
	// Кухарь А.Ю.  31.03.2024 начало
	если ВидНакладной="РасходнаяНакладная" или ВидНакладной="Перемещение" тогда
		ДатаОтгрузки=ПолучитьРеквизитШапки(Накладная,"ДатаОтгрузки","Документ");				
	иначе
		ДатаОтгрузки=ТекущаяДата();	
	КонецЕсли;
	
	если ДатаОтгрузки=ПустаяДата() тогда
		ДатаОтгрузки=ТекущаяДата();
	КонецЕсли;
	// Кухарь А.Ю.  31.03.2024 конец
	
	
	
	ЭтоРНКсКМПЛ			= ВидНакладной = "Комплектация" ИЛИ (ВидНакладной = "РасходнаяНакладная" И Накладная.ОтгрузкаКомплектов);	
	
	ИмяТабЧасти			= ?(ЭтоРНКсКМПЛ,"Комплектующие","Товары");	
	
	// Кухарь А.Ю.  19.11.2024 начало
	//
	Если ВидНакладной = "РасходнаяНакладная" и ОтделятьМаркированныйТовар тогда
		ТаблицаПереопределяемыхДат=МаркировкаКС.ПодготовитьТаблицуСПереопределяемойДатойНачалаРаботыСМаркировкой(Накладная,ИмяТабЧасти);			
	КонецЕсли;
	// Кухарь А.Ю.  19.11.2024 конец
	
	Запрос			= Новый Запрос;	
	
	
		
	// Кухарь А.Ю.  30.01.2026 начало 
	ТаблицаСПризнакомАдресногоХранения = ПолучитьТаблицуТоваровКАдресногоХранения(Накладная,ИмяТабЧасти); 
	запрос.УстановитьПараметр("ТаблицаСПризнакомАдресногоХранения",ТаблицаСПризнакомАдресногоХранения);
	//|	Документ.РасходнаяНакладная.Товары КАК НакладнаяТовары
	
	// Кухарь А.Ю.  30.01.2026 конец
	
	
	// Кухарь А.Ю.  19.11.2024 начало
	//
	если ТаблицаПереопределяемыхДат = Неопределено или ТаблицаПереопределяемыхДат.Количество()=0 тогда 
		
		// Кухарь А.Ю.  19.11.2024 конец
		//|	Документ." + ВидНакладной + "." + ИмяТабЧасти + "
		
		Запрос.Текст 	= "ВЫБРАТЬ
		             	  |	ТаблицаСПризнакомАдресногоХранения.Номенклатура КАК Номенклатура,
		             	  |	ТаблицаСПризнакомАдресногоХранения.АдресноеХранение КАК АдресноеХранение
		             	  |ПОМЕСТИТЬ ВТАдресов
		             	  |ИЗ
		             	  |	&ТаблицаСПризнакомАдресногоХранения КАК ТаблицаСПризнакомАдресногоХранения
		             	  |;
		             	  |
		             	  |////////////////////////////////////////////////////////////////////////////////
		             	  |ВЫБРАТЬ
		             	  |	РасходнаяНакладнаяТовары.Номенклатура.Родитель.Родитель.Родитель КАК Брэнд,
		             	  |	РасходнаяНакладнаяТовары.Номенклатура КАК Коллекция,
		             	  |	ВЫБОР
		             	  |		КОГДА РасходнаяНакладнаяТовары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой <> &ПустаяДата
		             	  |				И РасходнаяНакладнаяТовары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой <= &ДатаОтгрузки
		             	  |				И &ОтделятьМаркированныйТовар
		             	  |			ТОГДА ИСТИНА
		             	  |		КОГДА РасходнаяНакладнаяТовары.Номенклатура.ОтгрузкаТолькоЧерезЧЗ
		             	  |			ТОГДА ИСТИНА
		             	  |		ИНАЧЕ ЛОЖЬ
		             	  |	КОНЕЦ КАК ТребуетсяМаркировка,
		             	  |	РасходнаяНакладнаяТовары.Номенклатура.Родитель.ОбъемКоробки КАК ОбъемКоробки,
		             	  |	РасходнаяНакладнаяТовары.Номенклатура.Родитель.ШтукВКоробке КАК ШтукВКоробке,
		             	  |	СУММА(РасходнаяНакладнаяТовары.Количество) КАК Количество,
		             	  |	0 КАК КоличествоДляНаборов,
		             	  |	СУММА(РасходнаяНакладнаяТовары.Объем) КАК Объем,
		             	  |	МАКСИМУМ(ЕСТЬNULL(ВТАдресов.АдресноеХранение, ЛОЖЬ)) КАК АдресноеХранение
		             	  |ИЗ
		             	  |		Документ." + ВидНакладной + "." + ИмяТабЧасти + " КАК РасходнаяНакладнаяТовары
		             	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВТАдресов КАК ВТАдресов
		             	  |		ПО РасходнаяНакладнаяТовары.Номенклатура = ВТАдресов.Номенклатура
		             	  |ГДЕ
		             	  |	РасходнаяНакладнаяТовары.Ссылка = &Ссылка
		             	  |	И РасходнаяНакладнаяТовары.Номенклатура.Родитель.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Услуга)
		             	  |
		             	  |СГРУППИРОВАТЬ ПО
		             	  |	РасходнаяНакладнаяТовары.Номенклатура,
		             	  |	ВЫБОР
		             	  |		КОГДА РасходнаяНакладнаяТовары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой <> &ПустаяДата
		             	  |				И РасходнаяНакладнаяТовары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой <= &ДатаОтгрузки
		             	  |				И &ОтделятьМаркированныйТовар
		             	  |			ТОГДА ИСТИНА
		             	  |		КОГДА РасходнаяНакладнаяТовары.Номенклатура.ОтгрузкаТолькоЧерезЧЗ
		             	  |			ТОГДА ИСТИНА
		             	  |		ИНАЧЕ ЛОЖЬ
		             	  |	КОНЕЦ,
		             	  |	РасходнаяНакладнаяТовары.Номенклатура.Родитель.Родитель.Родитель,
		             	  |	РасходнаяНакладнаяТовары.Номенклатура.Родитель.ОбъемКоробки,
		             	  |	РасходнаяНакладнаяТовары.Номенклатура.Родитель.ШтукВКоробке
		             	  |
		             	  |ИМЕЮЩИЕ
		             	  |	СУММА(РасходнаяНакладнаяТовары.Количество) > 0
		             	  |
		             	  |УПОРЯДОЧИТЬ ПО
		             	  |	Брэнд,
		             	  |	Коллекция";	
		
		// Кухарь А.Ю.  06.11.2024 начало
		//
		если ИмяТабЧасти="Комплектующие" тогда
			ПолеКоличествоДляНаборов="Сумма(ВЫБОР
			|КОГДА Номенклатура = Продукция
			|	ТОГДА 0
			|ИНАЧЕ Количество
			|КОНЕЦ) КАК КоличествоДляНаборов";
			
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"0 как КоличествоДляНаборов",ПолеКоличествоДляНаборов);	
		КонецЕсли;
		// Кухарь А.Ю.  06.11.2024 конец
		
		// Кухарь А.Ю.  20.11.2024 начало
		//
	иначе
		
		
		//|	Документ." + ВидНакладной + "." + ИмяТабЧасти + " как ТЧ
		
		Запрос.Текст 	= "ВЫБРАТЬ
		|	ТаблицаСПризнакомАдресногоХранения.Номенклатура КАК Номенклатура,
		|	ТаблицаСПризнакомАдресногоХранения.АдресноеХранение КАК АдресноеХранение
		|ПОМЕСТИТЬ ВТАдресов
		|ИЗ
		|	&ТаблицаСПризнакомАдресногоХранения КАК ТаблицаСПризнакомАдресногоХранения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДат.Номенклатура КАК Номенклатура,
		|	ТаблицаДат.ДатаНачалаРаботыСМаркировкой КАК ДатаНачалаРаботыСМаркировкой
		|ПОМЕСТИТЬ ТаблицаСДатами
		|ИЗ
		|	&ТаблицаПереопределяемыхДат КАК ТаблицаДат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧ.Номенклатура.Родитель.Родитель.Родитель КАК Брэнд,
		|	ТЧ.Номенклатура КАК Коллекция,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТаблицаСДатами.ДатаНачалаРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
		|				И ЕСТЬNULL(ТаблицаСДатами.ДатаНачалаРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1)) <= &ДатаОтгрузки
		|				И &ОтделятьМаркированныйТовар
		|			ТОГДА ИСТИНА
		|		КОГДА ТЧ.Номенклатура.ОтгрузкаТолькоЧерезЧЗ
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ТребуетсяМаркировка,
		|	ТЧ.Номенклатура.Родитель.ОбъемКоробки КАК ОбъемКоробки,
		|	ТЧ.Номенклатура.Родитель.ШтукВКоробке КАК ШтукВКоробке,
		|	СУММА(ТЧ.Количество) КАК Количество,
		|	0 КАК КоличествоДляНаборов,
		|	СУММА(ТЧ.Объем) КАК Объем,
		|	ВТАдресов.АдресноеХранение КАК АдресноеХранение
		|ИЗ
		|		Документ." + ВидНакладной + "." + ИмяТабЧасти + " КАК ТЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСДатами КАК ТаблицаСДатами
		|		ПО ТЧ.Номенклатура = ТаблицаСДатами.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАдресов КАК ВТАдресов
		|		ПО ТЧ.Номенклатура = ВТАдресов.Номенклатура
		|ГДЕ
		|	ТЧ.Ссылка = &Ссылка
		|	И ТЧ.Номенклатура.Родитель.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Услуга)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТЧ.Номенклатура,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТаблицаСДатами.ДатаНачалаРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
		|				И ЕСТЬNULL(ТаблицаСДатами.ДатаНачалаРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1)) <= &ДатаОтгрузки
		|				И &ОтделятьМаркированныйТовар
		|			ТОГДА ИСТИНА
		|		КОГДА ТЧ.Номенклатура.ОтгрузкаТолькоЧерезЧЗ
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ТЧ.Номенклатура.Родитель.Родитель.Родитель,
		|	ТЧ.Номенклатура.Родитель.ОбъемКоробки,
		|	ТЧ.Номенклатура.Родитель.ШтукВКоробке,
		|	ВТАдресов.АдресноеХранение
		|
		|ИМЕЮЩИЕ
		|	СУММА(ТЧ.Количество) > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Брэнд,
		|	Коллекция";	
		// Кухарь А.Ю.  06.11.2024 начало
		//
		если ИмяТабЧасти="Комплектующие" тогда
			ПолеКоличествоДляНаборов="Сумма(ВЫБОР  
			// Кухарь А.Ю.  28.03.2026 начало
			//HELP-9255
			//|КОГДА ТЧ.Номенклатура = ТЧ.Продукция          
			|КОГДА ТЧ.Номенклатура = ТЧ.Продукция или ТЧ.Продукция.Родитель.ВидКомплекта <> значение(Перечисление.ВидыКомплектов.Комплект)
			// Кухарь А.Ю.  28.03.2026 конец				
			|	ТОГДА 0
			|ИНАЧЕ Количество
			|КОНЕЦ) КАК КоличествоДляНаборов";
			
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"0 как КоличествоДляНаборов",ПолеКоличествоДляНаборов);	
		КонецЕсли;
		// Кухарь А.Ю.  06.11.2024 конец
		
		запрос.УстановитьПараметр("ТаблицаПереопределяемыхДат",ТаблицаПереопределяемыхДат);
	КонецЕсли;
	
	// Кухарь А.Ю.  20.11.2024 конец
	
	
	Запрос.УстановитьПараметр("Ссылка",Накладная);
	// Кухарь А.Ю.  31.03.2024 начало
	Запрос.УстановитьПараметр("ОтделятьМаркированныйТовар",ОтделятьМаркированныйТовар); 
	// Кухарь А.Ю.  31.03.2024 конец
	
	// Кухарь А.Ю.  21.05.2024 начало
	//
	Запрос.УстановитьПараметр("ПустаяДата", ПустаяДата());
	Запрос.УстановитьПараметр("ДатаОтгрузки",ДатаОтгрузки );
	// Кухарь А.Ю.  21.05.2024 конец
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	//++Данилова Е.В. 24.02.2026 HELP-8893
	 
	Если ДанныеДляРазделения <> Неопределено Тогда
	
		ТБрендовКопия = ДанныеДляРазделения.тБрэндов; 
		ТоварыДляПереноса = ДанныеДляРазделения.ТоварыДляПереноса;
	
	КонецЕсли;
	//--Данилова Е.В. 24.02.2026
	тБрэндов.Очистить();
	
	Объемы=Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл	
		//++Данилова Е.В. 24.02.2026 HELP-8893 
		Если  ДанныеДляРазделения <> Неопределено 
			И ТоварыДляПереноса.Найти(Выборка.Коллекция) <> неопределено Тогда
		
			Продолжить; 	
		
		КонецЕсли;
		//--Данилова Е.В. 24.02.2026 
		СтрокаТБ = тБрэндов.Добавить();			
		ЗаполнитьЗначенияСвойств(СтрокаТБ, Выборка);
		
		// Кухарь А.Ю.  06.11.2024 начало
		если не СтрокаТБ.ТребуетсяМаркировка тогда
			СтрокаТБ.КоличествоДляНаборов=0;
		КонецЕсли;		 
		
		если СтрокаТБ.КоличествоДляНаборов>0 тогда
			СтрокаТБ.ТребуетсяФормированиеНабораЧЗ=Истина;
		иначе
			СтрокаТБ.ТребуетсяФормированиеНабораЧЗ=Ложь;
		КонецЕсли;		
		// Кухарь А.Ю.  06.11.2024 конец
		
		ШтукВКоробке	= Выборка.ШтукВКоробке;
		ОбъемКоробки	= Выборка.ОбъемКоробки;		
		
		СтрокаТБ.СекторХранения = ПолучитьСекторХранения(Выборка.Брэнд);		
		СтрокаТБ.СекторНабора	= ПолучитьРеквизитРодителя(СтрокаТБ.Коллекция,"СекторХраненияОдинцово4");
		
		// Кухарь А.Ю. 15.03.2021 начало
		// 		СтрокаТБ.Состояние 				= Перечисления.СостоянияНакладной.ОжиданиеНабора;
		СтрокаТБ.Состояние 				= Перечисления.СостоянияНакладной.СформированыЗаданияНабора;
		// Кухарь А.Ю. 15.03.2021 конец
		
		СтрокаТБ.ВремяРаспределения 	= ТекущаяДата();
		СтрокаТБ.ВремяТекущегоСостояния = ТекущаяДата();		
		СтрокаТБ.КоличествоСтрок		= 1;		
		СтрокаТБ.ОбъемКоробов			= РассчитатьОбъемКоробки(Выборка.Количество,Выборка.ОбъемКоробки,Выборка.ШтукВКоробке);		
		
		Если ШтукВКоробке <> 0 Тогда			
			КоличествоВКоробках=Цел(СтрокаТБ.Количество/ШтукВКоробке)*ШтукВКоробке;
			
			// Кухарь А.Ю.  06.11.2024 начало
			КоличествоДляНаборовОбщее=СтрокаТБ.КоличествоДляНаборов;
			КоличествоДляНаборовКороба=0;
			КоличествоДляНаборовШтуки=0;
			
			если КоличествоДляНаборовОбщее>0 тогда
				если КоличествоВКоробках>КоличествоДляНаборовОбщее Тогда
					КоличествоДляНаборовКороба=КоличествоДляНаборовОбщее;
				иначе
					КоличествоДляНаборовКороба=КоличествоВКоробках;
				КонецЕсли;
				КоличествоДляНаборовШтуки=КоличествоДляНаборовОбщее-КоличествоДляНаборовКороба;
			КонецЕсли;
			// Кухарь А.Ю.  06.11.2024 конец
			
			Если СтрокаТБ.Количество<>КоличествоВКоробках Тогда
				Если СтрокаТБ.Количество>ШтукВКоробке Тогда
					НоваяСтрокаТЧ 					= тБрэндов.Добавить();
					//++Данилова Е.В. 14.03.2026 HELP-8893
					//ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ,СтрокаТБ);
					ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ,СтрокаТБ,,"НомерСтроки");
					//--Данилова Е.В. 14.03.2026 
					
					НоваяСтрокаТЧ.Количество 		= СтрокаТБ.Количество - КоличествоВКоробках;
					НоваяСтрокаТЧ.СекторХранения 	= СтрЗаменить(НоваяСтрокаТЧ.СекторХранения,"_блочки","") + "_блочки";
					НоваяСтрокаТЧ.ЭтоБлочки 		= Истина;				
					НоваяСтрокаТЧ.ОбъемКоробов		= РассчитатьОбъемКоробки(НоваяСтрокаТЧ.Количество,ОбъемКоробки,ШтукВКоробке);
					
					СтрокаТБ.Количество			 	= КоличествоВКоробках;
					СтрокаТБ.ОбъемКоробов			= РассчитатьОбъемКоробки(СтрокаТБ.Количество,ОбъемКоробки,ШтукВКоробке);
					
					// Кухарь А.Ю.  06.11.2024 начало
					СтрокаТБ.КоличествоДляНаборов   = КоличествоДляНаборовКороба;
					если СтрокаТБ.КоличествоДляНаборов>0 тогда
						СтрокаТБ.ТребуетсяФормированиеНабораЧЗ=Истина;
					иначе
						СтрокаТБ.ТребуетсяФормированиеНабораЧЗ=Ложь;
					КонецЕсли;			
					
					НоваяСтрокаТЧ.КоличествоДляНаборов   = КоличествоДляНаборовШтуки;
					если НоваяСтрокаТЧ.КоличествоДляНаборов>0 тогда
						НоваяСтрокаТЧ.ТребуетсяФормированиеНабораЧЗ=Истина;
					иначе
						НоваяСтрокаТЧ.ТребуетсяФормированиеНабораЧЗ=Ложь;
					КонецЕсли;									
					// Кухарь А.Ю.  06.11.2024 конец
					//++Данилова Е.В. 13.03.2026 HELP-8893 
					Если ДанныеДляРазделения <> неопределено Тогда  		
						
						//++Данилова Е.В. 19.03.2026 без задачи
						//отбор = Новый Структура("Коллекция",НоваяСтрокаТЧ.Коллекция);
						отбор = Новый Структура("Коллекция,ЭтоБлочки",НоваяСтрокаТЧ.Коллекция,НоваяСтрокаТЧ.ЭтоБлочки);
						//--Данилова Е.В. 19.03.2026 
						СтрокиСохраненные = ТБрендовКопия.НайтиСтроки(отбор); 	
						Если СтрокиСохраненные.Количество() > 0  Тогда 				
							Если НЕ СтрокиСохраненные[0].Разделять Тогда
								ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ,СтрокиСохраненные[0],,"НомерСтроки"); 
								
							Иначе 
								ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ,СтрокиСохраненные[0],,"НомерСтроки");
								НоваяСтрокаТЧ.Состояние = Перечисления.СостоянияНакладной.СформированыЗаданияНабора;
								НоваяСтрокаТЧ.Разделенная = Истина;
								НоваяСтрокаТЧ.ВремяРаспределения 	= ТекущаяДата();
								НоваяСтрокаТЧ.ВремяТекущегоСостояния = ТекущаяДата();
							КонецЕсли;
							
						КонецЕсли;	
					КонецЕсли;
					//--Данилова Е.В. 13.03.2026
				Иначе
					СтрокаТБ.СекторХранения 		= СтрЗаменить(СтрокаТБ.СекторХранения,"_блочки","") + "_блочки";
					СтрокаТБ.ЭтоБлочки 				= Истина;
				КонецЕсли;
			КонецЕсли;		
		КонецЕсли;
		//++Данилова Е.В. 24.02.2026 HELP-8893 
		Если ДанныеДляРазделения <> неопределено Тогда  		
		
			//++Данилова Е.В. 19.03.2026 без задачи
			//отбор = Новый Структура("Коллекция",СтрокаТБ.Коллекция);
			отбор = Новый Структура("Коллекция,ЭтоБлочки",СтрокаТБ.Коллекция,СтрокаТБ.ЭтоБлочки);
			//--Данилова Е.В. 19.03.2026 
			СтрокиСохраненные = ТБрендовКопия.НайтиСтроки(отбор); 	
			Если СтрокиСохраненные.Количество() > 0  Тогда 				
				Если НЕ СтрокиСохраненные[0].Разделять Тогда
					ЗаполнитьЗначенияСвойств(СтрокаТБ,СтрокиСохраненные[0],,"НомерСтроки"); 
					
				Иначе 
					ЗаполнитьЗначенияСвойств(СтрокаТБ,СтрокиСохраненные[0],,"НомерСтроки");
					СтрокаТБ.Состояние = Перечисления.СостоянияНакладной.СформированыЗаданияНабора;
					СтрокаТБ.Разделенная = Истина;
					СтрокаТБ.ВремяРаспределения 	= ТекущаяДата();
					СтрокаТБ.ВремяТекущегоСостояния = ТекущаяДата();
				КонецЕсли;
				
			КонецЕсли;	
		КонецЕсли;
		//--Данилова Е.В. 24.02.2026 
	КонецЦикла;
	//++Данилова Е.В. 24.02.2026  HELP-8893
	Если ДанныеДляРазделения <> неопределено Тогда 
		тБрэндов.Сортировать("ЭтоБлочки,Брэнд",Новый СравнениеЗначений);
		Для каждого ТоварДляПереноса Из  ТоварыДляПереноса Цикл
			
			отбор = Новый Структура("Коллекция",ТоварДляПереноса); 
			СтрокиСохраненные = ТБрендовКопия.НайтиСтроки(отбор); 
			
			Если СтрокиСохраненные.Количество() > 0  Тогда 
				
				СтрокаТБ = тБрэндов.Добавить();			
				ЗаполнитьЗначенияСвойств(СтрокаТБ, СтрокиСохраненные[0],,"НомерСтроки");
				
				СтрокаТБ.Состояние = Перечисления.СостоянияНакладной.СформированыЗаданияНабора;
				СтрокаТБ.Разделенная = Ложь;
				СтрокаТБ.ВремяРаспределения 	= ТекущаяДата();
				СтрокаТБ.ВремяТекущегоСостояния = ТекущаяДата();
			КонецЕсли;	
			
			
		КонецЦикла;
	КонецЕсли;
	//--Данилова Е.В. 24.02.2026 
КонецПроцедуры
//крохин конец 14.09.2012

Функция ПроверитьКорректностьНаборщиковСканировщиков(Отказ)
	
	СписокНаборщиков 		= тБрэндов.Выгрузить(,"Наборщик");
	СписокСканировщиков 	= тБрэндов.Выгрузить(,"Сканировщик");
	СписокДопОбработчиков 	= тБрэндов.Выгрузить(,"ДопОбработчик");
	
	СписокНаборщиков.Свернуть("Наборщик");
	СписокСканировщиков.Свернуть("Сканировщик");
	СписокДопОбработчиков.Свернуть("ДопОбработчик");
	
	Результат=Истина;
	
	Сторонние = Справочники.ФизическиеЛица.НайтиПоКоду("SNL-01032");
	Для Каждого СтрокаНаборщик Из СписокНаборщиков Цикл
		ТекНаборщик = СтрокаНаборщик.Наборщик;
		Если ТекНаборщик.Пустая() ИЛИ ТекНаборщик.Штатный ИЛИ ТекНаборщик.ПринадлежитЭлементу(Сторонние) Тогда
		Иначе	
			Сообщить("По "+Накладная + " выбран некорректный наборщик! "+ ТекНаборщик);
			Результат = Ложь;
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаСканировщик Из СписокСканировщиков Цикл
		ТекСканировщик = СтрокаСканировщик.Сканировщик;
		Если ТекСканировщик.Пустая() ИЛИ ТекСканировщик.Штатный ИЛИ ТекСканировщик.ПринадлежитЭлементу(Сторонние) Тогда
		Иначе	
			Сообщить("По "+Накладная + " выбран некорректный сканировщик! "+ ТекСканировщик);
			Результат = Ложь;
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаДопОбработчик Из СписокДопОбработчиков Цикл
		ТекДопОбработчик = СтрокаДопОбработчик.ДопОбработчик;
		Если ТекДопОбработчик.Пустая() ИЛИ ТекДопОбработчик.Штатный ИЛИ ТекДопОбработчик.ПринадлежитЭлементу(Сторонние) Тогда
		Иначе	
			Сообщить("По "+Накладная + " выбран некорректный допобработчик! "+ ТекДопОбработчик);
			Результат = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ Результат Тогда
		Отказ	= Истина;	
	КонецЕсли; 
	
	Возврат Результат;	
КонецФункции //ПроверитьКорректностьНаборщиковСканировщиков()

Функция ПолучитьМоноСостояние() Экспорт
	Результат=Неопределено;
	
	ВремТаб=тБрэндов.Выгрузить(,"Состояние,Количество");
	ВремТаб.Свернуть("Состояние","Количество");
	Если ВремТаб.Количество()=1 Тогда
		Результат=ВремТаб[0].Состояние;	
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции //ПолучитьМоноСостояние()

Функция ПроверкаДублейПланаНабора(Отказ)
	Результат=Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Номер
	|ИЗ
	|	Документ.ПланНабора КАК ПланНабора
	|ГДЕ
	|	Накладная = &Накладная
	|	И НЕ ПометкаУдаления	
	|";
	Запрос.УстановитьПараметр("Накладная",	Накладная);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		#Если Клиент Тогда
			Сообщить("По "+Накладная + " уже существует план набора! Сохранение невозможно!");
		#КонецЕсли
		Результат=Ложь;			
	КонецЕсли;
	
	Если НЕ Результат Тогда
		Отказ = Истина;	
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции // ()

Функция ИмяТчНакладной()
	
	// Кухарь А.Ю. 18.01.2021 начало
	//добавил документ КМП
	// Возврат ?(ДокОснование.Метаданные().Имя="РасходнаяНакладная" и ДокОснование.ОтгрузкаКомплектов,"Комплектующие","Товары");
	Возврат ?(ДокОснование.Метаданные().Имя="РасходнаяНакладная" и ДокОснование.ОтгрузкаКомплектов или ДокОснование.Метаданные().Имя="Комплектация","Комплектующие","Товары");	 
	// Кухарь А.Ю. 18.01.2021 конец
	
КонецФункции //ИмяТчНакладной()

Функция ЕстьОшибкиНабора()
	Запрос=Новый запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Номенклатура,
	|	СУММА(КоличествоВНакладной) КАК КоличествоВНакладной,
	|	СУММА(КоличествоВЛН) 		КАК КоличествоВЛН
	|ИЗ
	|(
	|ВЫБРАТЬ
	|	Номенклатура,
	|	0					КАК КоличествоВНакладной, 
	//++Данилова Е.В. 02.03.2026  SNL-153 
	//|	Количество			КАК КоличествоВЛН 
	|	%Количество%			КАК КоличествоВЛН
	//--Данилова Е.В. 02.03.2026 
	|ИЗ
	|	Документ.ЛистНабора.Товары
	|ГДЕ
	|	Ссылка.ДокОснование = &ДокОснование
	|	И Ссылка.Проведен
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Номенклатура,
	|	Количество			КАК КоличествоВНакладной,
	|	0					КАК КоличествоВЛН
	|ИЗ
	|	Документ."+Накладная.Метаданные().Имя+"."+ИмяТчНакладной()+"
	|ГДЕ
	|	Ссылка=&ДокОснование
	|) КАК Сводный	
	|СГРУППИРОВАТЬ ПО 
	|	Номенклатура
	|ИТОГИ 
	|	СУММА(КоличествоВНакладной),СУММА(КоличествоВЛН)
	|ПО ОБЩИЕ
	|";
	
	Запрос.УстановитьПараметр("ДокОснование",ДокОснование.Ссылка);
	//++Данилова Е.В. 02.03.2026 SNL-153 
	ИспользоватьЛНТолькоДляНабора = ИспользоватьЛНТолькоДляНабора(Накладная);
	Если ИспользоватьЛНТолькоДляНабора Тогда 	
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Документ.ЛистНабора","Документ.ЛистПереукладки"); 	
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Количество%","Отсканировано");
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Количество%","Количество");
	КонецЕсли;
	//--Данилова Е.В. 02.03.2026 
	Ошибки		=Новый Массив;
	Результат	=Новый Структура("ЕстьОшибки,КоличествоВНакладной,КоличествоВЛН",Ложь,0,0);
	
	Выборка=Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ТипЗаписи()=ТипЗаписиЗапроса.ОбщийИтог Тогда
			ЗаполнитьЗначенияСвойств(Результат,Выборка);
			Если Выборка.КоличествоВНакладной<>Выборка.КоличествоВЛН Тогда
				Результат.ЕстьОшибки=Истина;								
			КонецЕсли; 
		Иначе
			Если Выборка.КоличествоВНакладной<>Выборка.КоличествоВЛН Тогда
				Ошибка=Новый Структура("Номенклатура,КоличествоВНакладной,КоличествоВЛН",Неопределено,0,0);			
				ЗаполнитьЗначенияСвойств(Ошибка,Выборка);
				Ошибки.Добавить(Ошибка);
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла;
	
	Результат.Вставить("Ошибки",Ошибки);
	//++Данилова Е.В. 05.03.2026 SNL-153 
	Результат.Вставить("ИспользоватьЛНТолькоДляНабора",ИспользоватьЛНТолькоДляНабора);
	//--Данилова Е.В. 05.03.2026 
	Возврат Результат;	
КонецФункции //ЕстьОшибкиНабора()

Функция ЕстьЛистыПереукладки()
	ЛП=ПолучитьЛистыПереукладки(ДокОснование);
	Возврат (ЛП.Количество()>0);
КонецФункции //ЕстьЛистыПерукладки()

Функция ПолучитьКоробкиОбъемыПоПереукладке()
	Запрос=новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ссылка) 	КАК КоличествоКоробок,
	|	СУММА(ОбъемДокумента) 			КАК ОбъемДокумента
	|ИЗ
	|	Документ.ЛистПереукладки
	|ГДЕ
	|	ДокОснование = &ДокОснование
	|	И Проведен					
	|";
	
	Запрос.УстановитьПараметр("ДокОснование",ДокОснование);
	
	Результат=Новый Структура("КоличествоКоробок,ОбъемДокумента",0,0);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат,Выборка);				
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПолучитьКоробкиОбъекмыПоПереукладке()  

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если ОбменДанными.Загрузка  Тогда Возврат КонецЕсли;	 
	
	//// Кухарь А.Ю. 29.03.2021 начало
	//// перенёс выше
	Если ЭтоНовый() Тогда
		ПроверкаДублейПланаНабора(Отказ);				
	КонецЕсли;
	
	если  ПростоЗаписать=Истина тогда Возврат конецЕсли;
	//// Кухарь А.Ю. 29.03.2021 конец
	
	КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
	МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
	МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);	
	
	//крохин начало 07.12.2017
	//запрет на выбор уволенных сотрудников
	#Если Клиент Тогда
		// Кухарь А.Ю. 16.03.2020 начало
		//В поздних состояниях нет смысла проверять, что сотрудник не уволен
		// 		Если НЕ ПроверитьКорректностьНаборщиковСканировщиков(Отказ) Тогда Возврат КонецЕсли;	
		ЧисловоеСостояние=ПолучитьНомерСостоянияНакладной(Накладная.СостояниеНакладной);
		если ЧисловоеСостояние<=400 тогда //Ожидание набора
			Если НЕ ПроверитьКорректностьНаборщиковСканировщиков(Отказ) Тогда Возврат КонецЕсли;	
		КонецЕсли;		 
		// Кухарь А.Ю. 16.03.2020 конец
		
	#КонецЕсли	
	//крохин конец 07.12.2017	
	
	//запретим создавать два плана к одному листу
	//Кухарь 13.07.17 начало
	//Пока сделаю не только для новых, если будет висеть верну как было
	//// Кухарь А.Ю. 29.03.2021 начало
	//// перенёс выше
	//Если ЭтоНовый() Тогда
	//	ПроверкаДублейПланаНабора(Отказ);
	//КонецЕсли;	 
	//// Кухарь А.Ю. 29.03.2021 конец
	
	Если Отказ Тогда Возврат КонецЕсли;	
	
	КоличествоДокумента = тБрэндов.Итог("Количество");	
	ОбъемДокумента		= тБрэндов.Итог("Объемкоробов");	
	ДокОснование		= Накладная;
	//крохин начало 11.12.2013
	//перезаписываем состояние документа-основания в зависимости от состояний строк плана, для ODN
	//Кухарь 28.10.15 начало
	//Новый склад	
	//Если ПараметрыСеанса.ЭтотУзел.Код = "ODN" Тогда
	Если ПараметрыСеанса.ЭтотУзел.Код = "ODN" или ПараметрыСеанса.ЭтотУзел.Код = "OD7"  Тогда
		//Кухарь 28.10.15 конец
		
		//крохин начало 29.01.2014
		Если НачалоОбработки = '00010101' Тогда
			ДатаФормирования = ТекущаяДата();
			НачалоОбработки = ТекущаяДата();
		КонецЕсли;
		
		ВсеГотовы					= Ложь;		
		
		// Кухарь А.Ю. 24.12.2021 начало
		//Изменение схемы состояний на "по последней строчке"
		// ТекНомерСостояния = 0;
		ТекНомерСостояния = 999999;	
		// Кухарь А.Ю. 24.12.2021 конец
		
		//Кухарь 22.11.17 начало
		//У белья доп обработка до сканирования		
		ЕстьКолготки	= ложь;
		//Кухарь 22.11.17 конец	
		
		МоноСостояние=ПолучитьМоноСостояние();
		
		// Кухарь А.Ю. 15.04.2022 начало
		//Исключение из бельевой Схемы по ВБ
		ДопПараметрыНакладной=ОбщегоНазначения_ПИ.ПолучитьДопПараметрыНакладной(Накладная);
		если ДопПараметрыНакладной<>Неопределено и ДопПараметрыНакладной.имя="WB_FBS" тогда
			ЕстьБельёПоНакладной=ложь;
		иначе
			ЕстьБельёПоНакладной=Неопределено;	
		КонецЕсли;	  
		// Кухарь А.Ю. 15.04.2022 конец
		
		
		Для Каждого СтрокаТЧ из тБрэндов Цикл
			Если (СтрокаТЧ.Состояние=Перечисления.СостоянияНакладной.ОжиданиеТермоусадки				
				// Кухарь А.Ю. 27.12.2021 начало
				//Изменение схемы состояний на "по последней строчке"
				// ИЛИ СтрокаТЧ.Состояние=Перечисления.СостоянияНакладной.ОжиданиеНабора			 
				// Кухарь А.Ю. 27.12.2021 конец		 			
				ИЛИ СтрокаТЧ.Состояние=Перечисления.СостоянияНакладной.ОжиданиеПаллетирования
				ИЛИ СтрокаТЧ.Состояние=Перечисления.СостоянияНакладной.ГотоваКОтгрузке) Тогда
				Продолжить;
			КонецЕсли;
			
			//Кухарь 22.11.17 начало
			//У белья доп обработка до сканирования	
			//НомерСостоянияСтроки = ПолучитьНомерСостоянияНакладной(строкаТЧ.Состояние);		
			
			// Кухарь А.Ю. 15.04.2022 начало
			//Исключение из бельевой схемы ряда клиентов.
			// Если Лев(СтрокаТЧ.СекторХранения,1)="2" тогда	
			Если Лев(СтрокаТЧ.СекторХранения,1)="2" и ЕстьБельёПоНакладной=Неопределено тогда	 
				// Кухарь А.Ю. 15.04.2022 конец	
				ТекСтрокаЭтоБельё	= Истина;
			Иначе
				ЕстьКолготки		= Истина;
				ТекСтрокаЭтоБельё	= Ложь;				
			КонецЕсли;
			
			
			
			НомерСостоянияСтроки = ПолучитьНомерСостоянияНакладной(СтрокаТЧ.Состояние,ТекСтрокаЭтоБельё);			
			//Кухарь 22.11.17 конец			
			
			// Кухарь А.Ю. 24.12.2021 начало
			////Изменение схемы состояний на "по последней строчке"
			//Если НомерСостоянияСтроки > ТекНомерСостояния Тогда
			Если НомерСостоянияСтроки < ТекНомерСостояния Тогда
				// Кухарь А.Ю. 24.12.2021 конец
				
				//Кухарь 09.10.16 конец			
				ТекНомерСостояния =  НомерСостоянияСтроки;
			КонецЕсли;
			
			
		КонецЦикла;		
		
		
		Если МоноСостояние=Перечисления.СостоянияНакладной.ГотоваКОтгрузке Тогда
			ВсеГотовы=Истина;
		КонецЕсли;		
		
		Если ВсеГотовы=Истина ИЛИ Накладная.СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке тогда
			ТекНомерСостояния=ПолучитьНомерСостоянияНакладной(Перечисления.СостоянияНакладной.ГотоваКОтгрузке);			
			// Кухарь А.Ю.  06.02.2023 начало
			// Иногда записывают с флагом "простозаписать" = истина. Тогда сюда не приходит
			//Если ВсеГотовы=Истина тогда
			//	ЗаполнитьКоличестваПоТипамШК();
			//КонецЕсли;			 
			// Кухарь А.Ю.  06.02.2023 конец		
		КонецЕсли;
		
		
		// Кухарь А.Ю.  06.02.2023 начало
		Если ВсеГотовы=Истина 
			или МоноСостояние=Перечисления.СостоянияНакладной.ГотоваКОтгрузке
			или  МоноСостояние=Перечисления.СостоянияНакладной.ОжиданиеТермоусадки
			или  МоноСостояние=Перечисления.СостоянияНакладной.Термоусадка
			или  МоноСостояние=Перечисления.СостоянияНакладной.ОжиданиеПаллетирования
			или  МоноСостояние=Перечисления.СостоянияНакладной.Паллетирование 
			тогда
			если тБрэндов.Итог("КоличествоШтук")=0 и тБрэндов.Итог("КоличествоКоробок")=0 и тБрэндов.Итог("КоличествоБлочков")=0 тогда
				ЗаполнитьКоличестваПоТипамШК();
			КонецЕсли;	
		КонецЕсли;
		// Кухарь А.Ю.  06.02.2023 конец
		
		//Кухарь 08.11.16 начало
		//Аналогично РГ
		Если МоноСостояние=Перечисления.СостоянияНакладной.ОжиданиеПаллетирования 
			// Кухарь А.Ю. 15.03.2021 начало
			//
			ИЛИ  МоноСостояние=Перечисления.СостоянияНакладной.ОжиданиеНабора		 
			// Кухарь А.Ю. 15.03.2021 конец			
			ИЛИ  МоноСостояние=Перечисления.СостоянияНакладной.ОжиданиеТермоусадки Тогда
			ТекНомерСостояния=ПолучитьНомерСостоянияНакладной(МоноСостояние);		
		КонецЕсли;		
		//Кухарь 27.12.17 конец		
		
		//Кухарь 22.11.17 начало
		//У белья доп обработка до сканирования
		//НомерСостоянияНакладной =  ПолучитьНомерСостоянияНакладной(ДокОснование.СостояниеНакладной);
		НомерСостоянияНакладной =  ПолучитьНомерСостоянияНакладной(ДокОснование.СостояниеНакладной, НЕ ЕстьКолготки);		
		//Кухарь 22.11.17 конец			
		
		Если ТекНомерСостояния > НомерСостоянияНакладной И ТекНомерСостояния <> 10000 Тогда
			ТекСостояние 		= ПолучитьСостояниеНакладнойПоНомеру(ТекНомерСостояния);		
			
			РеквизитыОснования	= Новый Структура("СостояниеНакладной",ТекСостояние);			
			
			//кухарь 02.09.14 начало
			Если ТекСостояние = Перечисления.СостоянияНакладной.ГотоваКОтгрузке  тогда			
				//Кухарь 16.12.19 начало
				//Уже не нужно т.к. отказались от регистра
				//
				//Если ЕстьЛистыПереукладки() тогда
				//	КоробкиОбъемы=ПолучитьКоробкиОбъемыПоПереукладке();					
				//	
				//	РеквизитыОснования.Вставить("КоличествоКоробок",	КоробкиОбъемы.КоличествоКоробок);
				//	РеквизитыОснования.Вставить("ОбъемКоробов",			КоробкиОбъемы.ОбъемДокумента);
				//	//кухарь 08.09.14 начало
				//	//запись количества коробок и объёма коробок в регистр, чтобы уйти от реквизитов
				//	
				//	ЗаписатьКоличествоИОбъемКоробовВРегистр(ДокОснование,КоробкиОбъемы.КоличествоКоробок,КоробкиОбъемы.ОбъемКоробов);
				//	
				//	//кухарь 08.09.14 конец					
				//КонецЕсли;
				//Кухарь 16.12.19 конец
				
				// Кухарь А.Ю. 24.08.2020 начало
				// Товар не сканируют
				если не СозданоОбработкойПополнения тогда 
					// Кухарь А.Ю. 24.08.2020 конец
					
					РезультатПроверки=ЕстьОшибкиНабора();
					Если РезультатПроверки.ЕстьОшибки тогда
						//++Данилова Е.В. 05.03.2026 SNL-153
						ВидЛиста = ?(РезультатПроверки.ИспользоватьЛНТолькоДляНабора,"ЛП","ЛН"); 
						ТекстСообщения = СтрШаблон("Не совпадает количество из накладной и из %1. В накладной - %2,в %1 - %3",ВидЛиста,РезультатПроверки.КоличествоВНакладной,РезультатПроверки.КоличествоВЛН); 
						Сообщить (ТекстСообщения,СтатусСообщения.Важное);
						//Сообщить ("Не совпадает количество из накладной и из ЛН. В накладной - "+РезультатПроверки.КоличествоВНакладной+", в ЛН - "+РезультатПроверки.КоличествоВЛН,СтатусСообщения.Важное);
						//--Данилова Е.В. 05.03.2026 
						Возврат;
					КонецЕсли;	
					// Кухарь А.Ю. 24.08.2020 начало
					//
				КонецЕсли; 
				// Кухарь А.Ю. 24.08.2020 конец
				
			КонецЕсли;
			//кухарь 02.09.14 конец			
			
			//Кухарь 08.11.17 начало
			//заполнение плана набора ошибками набора
			ЗаполнитьОшибкамиНабора();	
			
			УстановитьРеквизитыОбъекта(ДокОснование,РеквизитыОснования,,Истина); 
			// Кухарь А.Ю. 03.05.2024 начало
			//
			// Кухарь А.Ю.  25.04.2024 начало
			//
			если ТипЗнч(ДокОснование)=Тип("ДокументСсылка.РасходнаяНакладная") и ДокОснование.ТребуетсяМаркировка и ВсеГотовы тогда
				// Кухарь А.Ю.  24.02.2025 начало
				//РезультатРаботыСХКМ=Документы.ХранилищеКодовМаркировки.Создать_ХКМ_к_РНК(ДокОснование);
				//если не РезультатРаботыСХКМ.Успешно тогда
				//	РезультатРаботыСХКМ.Ошибки.Добавить("Не удалось создать хранилище кодов маркировки");
				//	СообщитьИзМодуля(СтрСоединить(РезультатРаботыСХКМ.Ошибки,","));
				//	отказ=Истина;	
				//КонецЕсли;
				ДокОснованиеОбъект=ДокОснование.ПолучитьОбъект();
				Результат=ДокОснованиеОбъект.СозданиеДокументовЧЗ();
				если не Результат тогда
					отказ=Истина;
				КонецЕсли;
				// Кухарь А.Ю.  24.02.2025 конец
				
			КонецЕсли;
			// Кухарь А.Ю.  25.04.2024 конец
			
			// Кухарь А.Ю. 03.05.2024 конец
			
		КонецЕсли;
		
		Если МоноСостояние=Перечисления.СостоянияНакладной.Отгружена И НЕ Отказ Тогда
			НомераЧастей=тБрэндов.Выгрузить(,"НомерЧасти");
			НомераЧастей.Свернуть("НомерЧасти");	
			
			Для Каждого СтрокаТЗ Из НомераЧастей Цикл
				ЗаданиеНабора=НайтиДокумент("ЗаданиеНабора",Новый Структура("ДокументОснование,НомерЧасти,Проведен",Ссылка,СтрокаТЗ.НомерЧасти,Истина));
				Если ЗначениеЗаполнено(ЗаданиеНабора) Тогда
					ЗаданиеНабора_Объект=ЗаданиеНабора.ПолучитьОбъект();				
					ЗаданиеНабора_Объект.СостояниеНакладной=МоноСостояние;
					ЗаданиеНабора_Объект.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;				
			КонецЦикла; 					
		КонецЕсли; 
	КонецЕсли;
	
	//крохин конец 11.12.2013
	//Кухарь 13.09.16 начало	
	Если НЕ Отказ Тогда
		Отбор=Новый Структура("Состояние",Перечисления.СостоянияНакладной.ОжиданиеНабора);
		ОсталосьНабратьСтрок=тБрэндов.НайтиСтроки(Отбор).Количество();
		
		Отбор.Состояние=Перечисления.СостоянияНакладной.ОжиданиеСканирования;
		ОсталосьОтсканироватьСтрок=тБрэндов.НайтиСтроки(Отбор).Количество();
		
		Отбор.Состояние=Перечисления.СостоянияНакладной.ОжиданиеДопОбработки;		
		ОсталосьДопОбработатьСтрок=тБрэндов.НайтиСтроки(Отбор).Количество();
	КонецЕсли;
	//Кухарь 13.09.16 конец	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	Если НЕ ЗначениеЗаполнено(Основание) Тогда Возврат КонецЕсли;
	
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	
	ДокОснование	= Основание;
	Накладная 		= ДокОснование;
	
	ВидОснования	= ДокОснование.Метаданные().Имя;
	
	ИБ			 	= ДокОснование.ИБ;
	Склад			= ДокОснование.Склад;
	
	СобиратьНаТСД = Истина; // Кельманов А.В. - HELP-6542 - 2025.08.13
	
	// Кухарь А.Ю.  21.04.2025 начало
	ДопПараметрыНакладной=ОбщегоНазначения_ПИ.ПолучитьДопПараметрыНакладной(Накладная);
	РаспределятьРасходныеМатериалы=ложь;
	если ДопПараметрыНакладной.НаборыЧЗбезОклейкиКомплектующих или ДопПараметрыНакладной.ОтгрузкаFBS тогда
		РаспределятьРасходныеМатериалы=Истина;
	КонецЕсли;
	ЗаполнитьТаблицуБрэндов(РаспределятьРасходныеМатериалы);	
	// Кухарь А.Ю.  21.04.2025 конец
	
	// Кельманов А.В. - HELP-6558 - 2025.08.19 {
	//// Шворобей ВЮ 05.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5266
	//ТЗ_Брэндов = Документы.ПланНабора.ЗаполнитьСлужебногоНаборщикаFBS(тБрэндов.Выгрузить());
	//тБрэндов.Загрузить(ТЗ_Брэндов);	
	//// Шворобей ВЮ 05.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5266
	ТЗ_Наборщики = Документы.ПланНабора.ЗаполнитьСлужебногоНаборщикаFBS(тБрэндов.Выгрузить());
	Для Каждого Стр ИЗ ТЗ_Наборщики Цикл
		НайденныеСтроки = тБрэндов.НайтиСтроки(Новый Структура("Брэнд, Коллекция", Стр.Брэнд, Стр.Коллекция));
		Для Каждого НСтр ИЗ НайденныеСтроки Цикл
			Если НЕ ЗначениеЗаполнено(НСтр.Наборщик) Тогда
				НСтр.Наборщик = Стр.СлужебныйНаборщик;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	// Кельманов А.В. - HELP-6558 - 2025.08.19 }
	
	Если ВидОснования = "Перемещение" Тогда
		Если ПараметрыСеанса.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			СкладПользователя=ПолучитьЗначениеПоУмолчанию("ОсновнойСклад");
			Если СкладПользователя<>Неопределено И НЕ СкладПользователя.Пустая() Тогда
				Если ДокОснование.Склад=СкладПользователя Тогда
					//оставляем как есть склад документа
				ИначеЕсли ДокОснование.СкладПолучатель=СкладПользователя Тогда
					Склад = ДокОснование.СкладПолучатель;
				КонецЕсли; 			
			Иначе				
				Если ДокОснование.Склад.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда
					//если для полдьзователя не задан склад то считаем что лист набора на отгрузку 
					//оставляем как есть склад документа
				ИначеЕсли ДокОснование.СкладПолучатель.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда
					Склад = ДокОснование.СкладПолучатель;									
				КонецЕсли;
			КонецЕсли;			
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)	
КонецПроцедуры

Функция ВсеНаборщикиЗаполнены() Экспорт
	Для Каждого ТекСтрока из тБрэндов Цикл		
		Если ТекСтрока.Наборщик.Пустая() Тогда
			Возврат Ложь;
		КонецЕсли;		
	КонецЦикла;
	Возврат Истина;
КонецФункции // ()


//Кухарь 05.10.17 начало
//Заполнение количества коробок, блочков и штучек в плане набора
Процедура ЗаполнитьКоличестваПоТипамШК()  экспорт
	ЕстьРазбивка=(тБрэндов.Количество()>0 И НЕ тБрэндов[0].Коллекция.ЭтоГруппа);
	
	Для Каждого СтрТЧ Из тБрэндов Цикл
		СтрТЧ.КоличествоКоробок	= 0;
		СтрТЧ.КоличествоБлочков	= 0;
		СтрТЧ.КоличествоШтук	= 0;	
	КонецЦикла;
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ТипШК,
	|	Номенклатура.Родитель.Родитель КАК Номенклатура,
	|	СУММА(ВЫБОР КОГДА ТипШК=ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка) 	ТОГДА Количество ИНАЧЕ 0 КОНЕЦ)		КАК КоличествоКоробок,
	|	СУММА(ВЫБОР КОГДА ТипШК=ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок) 	ТОГДА Количество ИНАЧЕ 0 КОНЕЦ) 	КАК КоличествоБлочков,
	|	СУММА(ВЫБОР КОГДА ТипШК=ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука) 	ТОГДА Количество ИНАЧЕ 0 КОНЕЦ) 	КАК КоличествоШтук,
	|	СУММА(Количество) КАК Количество	
	|ИЗ
	|	Документ.ЛистНабора.Товары
	|ГДЕ
	|	Ссылка.ДокОснование = &ДокОснование	
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура.Родитель.Родитель,
	|	ТипШК";
	
	Запрос.УстановитьПараметр("ДокОснование",ДокОснование);	
	
	Если ЕстьРазбивка Тогда
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"Номенклатура.Родитель.Родитель","Номенклатура");
	КонецЕсли;
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		Отбор		= Новый Структура("Коллекция",Результат.Номенклатура);
		МассСтрокТЧ	= тБрэндов.НайтиСтроки(Отбор);
		
		Если МассСтрокТЧ.Количество()=1 Тогда
			ТекСтрока=МассСтрокТЧ.Получить(0);
			
			ТекСтрока.КоличествоКоробок	=ТекСтрока.КоличествоКоробок+Результат.КоличествоКоробок;
			ТекСтрока.КоличествоБлочков	=ТекСтрока.КоличествоБлочков+Результат.КоличествоБлочков;
			ТекСтрока.КоличествоШтук	=ТекСтрока.КоличествоШтук	+Результат.КоличествоШтук;			
		Иначе			
			Для Каждого ТекСтрока из МассСтрокТЧ Цикл
				Если ТекСтрока.ЭтоБлочки Тогда
					Если Результат.ТипШК=Перечисления.ТипыШтрихКодов.Блочок Тогда
						ТекСтрока.КоличествоБлочков=ТекСтрока.КоличествоБлочков+Результат.Количество;
					ИначеЕсли Результат.ТипШК=Перечисления.ТипыШтрихКодов.Штука Тогда
						ТекСтрока.КоличествоШтук=ТекСтрока.КоличествоШтук+Результат.Количество;					
					КонецЕсли;
				Иначе
					Если Результат.ТипШК=Перечисления.ТипыШтрихКодов.Коробка Тогда
						ТекСтрока.КоличествоКоробок=ТекСтрока.КоличествоКоробок+Результат.Количество;
					КонецЕсли;					
				КонецЕсли;
			КонецЦикла;			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
//Кухарь 05.10.17 конец

//Кухарь 08.11.17 начало
//заполнение плана набора ошибками набора
Процедура ЗаполнитьОшибкамиНабора()	
	ЕстьРазбивка=(тБрэндов.Количество()>0 И тБрэндов[0].Коллекция.ЭтоГруппа);
	
	Запрос=новый запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	//Кухарь 16.12.19 начало
	//При замене текста запроса в  СтрЗаменить(Запрос.Текст,"Номенклатура","Номенклатура.Родитель.Родитель");
	//Меняется псевдоним поля и вываливается с конфигураторной ошибкой
	//|	Номенклатура,
	|	Номенклатура как НОменклатура,	
	//Кухарь 16.12.19 конец	
	|	СУММА(Количество) 				КАК КоличествоНеверноНабранногоТовара,
	|	Ссылка.Наборщик 				КАК Наборщик,
	|	//ЭтоБлочкиПоле			 
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ссылка) 	КАК КоличествоОшибок
	|ИЗ
	|	Документ.ЛистНабора.ОшибкиСотрудников
	|ГДЕ
	|	Ссылка.ДокОснование = &ДокОснование
	|	И Ссылка.Проведен
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура,
	|	//ЭтоБлочкиГруппировка
	|	Ссылка.Наборщик";
	Запрос.УстановитьПараметр("ДокОснование",ДокОснование);
	
	Если ЕстьРазбивка тогда
		ТекстПоля	="(Ссылка.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))";
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"//ЭтоБлочкиПоле",		ТекстПоля+" КАК ЭтоБлочки,");		
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"//ЭтоБлочкиГруппировка",	ТекстПоля+",");		
	Иначе		
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"Номенклатура","Номенклатура.Родитель.Родитель");		
	КонецЕсли;
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() цикл
		Отбор=новый Структура("Коллекция,Наборщик",Результат.Номенклатура,Результат.Наборщик);
		Если ЕстьРазбивка Тогда
			Отбор.Вставить("ЭтоБлочки",Результат.ЭтоБлочки);			
		КонецЕсли; 
		МассСтрокТЧ=тБрэндов.НайтиСтроки(Отбор);
		Для Каждого СтрокаТЧ из МассСтрокТЧ цикл				
			СтрокаТЧ.КоличествоНеверноНабранногоТовара=Результат.КоличествоНеверноНабранногоТовара;
			СтрокаТЧ.КоличествоОшибок=Результат.КоличествоОшибок;				
		КонецЦикла;
	КонецЦикла;	
КонецПроцедуры
//Кухарь 08.11.17 конец

Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	// Кухарь А.Ю. 26.03.2021 начало
	//ОбновитьСостоянияЗаявокНабора();
	// Снимем флаг, если он был установлен
	если не ПростоЗаписать = Истина тогда
		ОбновитьСостоянияЗаявокНабора();
	КонецЕсли;
	ПростоЗаписать=ложь; 
	// Кухарь А.Ю. 26.03.2021 конец
КонецПроцедуры

// Кельманов А.В. - ИЗМ-0000000122 - 2026.06.26 {
//Процедура ОбновитьСостоянияЗаявокНабора()
Процедура ОбновитьСостоянияЗаявокНабора(ОграничиватьПоСостоянию = Истина) Экспорт
// Кельманов А.В. - ИЗМ-0000000122 - 2026.06.26 }
	Запрос=Новый ("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ * ПОМЕСТИТЬ тБрэндов ИЗ &тБрэндов КАК тБрэндов
	|;
	|ВЫБРАТЬ 
	|	НомерЧасти,
	|	МАКСИМУМ(Состояние) КАК Состояние 
	|ИЗ 
	|	тБрэндов 
	|СГРУППИРОВАТЬ ПО 
	|	НомерЧасти 	
	|";	
	Запрос.УстановитьПараметр("тБрэндов",тБрэндов);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл	
		
		// Кухарь А.Ю. 29.01.2020 начало
		// 		Если ПолучитьНомерСостоянияНакладной(Выборка.Состояние)>400 Тогда //После Ожидания набора	
		
		// Кельманов А.В. - ИЗМ-0000000122 - 2026.06.26 {
		//Если ПолучитьНомерСостоянияНакладной(Выборка.Состояние)>=400 Тогда //иногда ошибочно отдают в набор и хотят вернуть		 
		Если Не ОграничиватьПоСостоянию Или ПолучитьНомерСостоянияНакладной(Выборка.Состояние) >= 400 Тогда 		 
			// Кельманов А.В. - ИЗМ-0000000122 - 2026.06.26 }
			
			// Кухарь А.Ю. 29.01.2020 конец
			
			//Кухарь 18.12.19 начало
			//Если хоть 1 строчка отгружена, значит отгружена вся накладная
			//Документы.ЗаданиеНабора.УстановитьСостояниеЗадания(Ссылка,Выборка.НомерЧасти,Выборка.Состояние);		
			если Выборка.Состояние=Перечисления.СостоянияНакладной.Отгружена тогда
				Документы.ЗаданиеНабора.УстановитьСостояниеЗадания(Ссылка,Неопределено,Выборка.Состояние);
				Прервать;
			иначе
				Документы.ЗаданиеНабора.УстановитьСостояниеЗадания(Ссылка,Выборка.НомерЧасти,Выборка.Состояние);		
			КонецЕсли;
			//Кухарь 18.12.19 конец
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Кухарь А.Ю. 15.01.2020 начало
// для обработки смены состояния путём сканирования ЗНБ
Процедура СменитьСостоянияСтрокПоЗНБ (НовоеСостояние,ЗНБ,ЭтоНачалоПаузы=Неопределено,ЭтоОкончаниеПаузы=Неопределено,ВидПаузы=Неопределено) Экспорт 
	
	если НачалоДня(дата)<>НачалоДня(Накладная.Дата) тогда
		дата=Накладная.Дата;
	КонецЕсли;
	
	Если ЗНБ=Неопределено тогда
		МассСтрок=тБрэндов;
	иначе
		МассСтрок=тБрэндов.НайтиСтроки(новый Структура("НомерЧасти",ЗНБ.НомерЧасти));
	КонецЕсли;
	
	если МассСтрок.Количество()=0 тогда
		Возврат;
	Иначе
		СтрокаПН=МассСтрок.Получить(0);
	КонецЕсли;
	
	НоваяДата=ТекущаяДата();
	СтароеСостояние=СтрокаПН.Состояние;
	
	если ВидПаузы=Неопределено тогда
	ИначеЕсли ВидПаузы=Перечисления.СостоянияНакладной.ВНаборе тогда
		ВидПаузы="Набора";
	ИначеЕсли ВидПаузы=Перечисления.СостоянияНакладной.Сканирование тогда
		ВидПаузы="Сканирования";
	ИначеЕсли ВидПаузы=Перечисления.СостоянияНакладной.ДопОбработка тогда
		ВидПаузы="ДопОбработки";	
	КонецЕсли;
	
	если ЭтоНачалоПаузы=Истина тогда      
		ИмяКолонкиНачалаПаузы="НачалоОстановки"+ВидПаузы;
		для каждого СтрТЧ из МассСтрок цикл
			если СтрТЧ[ИмяКолонкиНачалаПаузы]=ПустаяДата() тогда			
				СтрТЧ[ИмяКолонкиНачалаПаузы]=НоваяДата;
			иначе
				Сообщить("Пауза по выбранному виду работ уже была начата ранее.");
				Возврат;
			КонецЕсли;
		КонецЦикла;
		Сообщить("Работа приостановлена.");
		
	ИначеЕсли ЭтоОкончаниеПаузы тогда
		ИмяКолонкиНачалаПаузы="НачалоОстановки"+ВидПаузы;
		ИмяКолонкиОкончанияПаузы="Остановка"+ВидПаузы;
		для каждого СтрТЧ из МассСтрок цикл
			НачалоПаузы=СтрТЧ[ИмяКолонкиНачалаПаузы];
			ПродолжительностьПаузы=СтрТЧ[ИмяКолонкиОкончанияПаузы];			
			Если НачалоПаузы=ПустаяДата() тогда 
				Сообщить("Пауза по выбранному виду работ не была начата ранее, а значит завершать нечего.");
				Возврат;
			КонецЕсли;				
			СтрТЧ[ИмяКолонкиОкончанияПаузы]=НоваяДата-НачалоПаузы+ПродолжительностьПаузы;
			СтрТЧ[ИмяКолонкиНачалаПаузы]=ПустаяДата();
		КонецЦикла;	
		Сообщить("Работа возобновлена.");
		
	иначе
		ЭтоБельё=ложь;
		если СтароеСостояние=Перечисления.СостоянияНакладной.ДопОбработка  тогда
			СтрСканировка=ЗНБ.ПланируемыеСостояния.Найти(Перечисления.СостоянияНакладной.Сканирование);
			СтрДО=ЗНБ.ПланируемыеСостояния.Найти(Перечисления.СостоянияНакладной.ДопОбработка);
			если СтрДО<>Неопределено и СтрСканировка<>Неопределено тогда
				если ЗНБ.ПланируемыеСостояния.индекс(СтрСканировка)> ЗНБ.ПланируемыеСостояния.индекс(СтрДО) тогда
					ЭтоБельё=Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		если  ПолучитьНомерСостоянияНакладной(СтароеСостояние,ЭтоБельё)< ПолучитьНомерСостоянияНакладной(НовоеСостояние,ЭтоБельё)тогда	
			СтруктураИзменений=новый Структура;
			если СтароеСостояние=Перечисления.СостоянияНакладной.ВНаборе тогда		
				если ЗначениеЗаполнено(СтрокаПН.НачалоОстановкиНабора) тогда
					Сообщить("Сначала завершите паузу набора.");
					Возврат;
				КонецЕсли;			
				СтруктураИзменений.Вставить("НаборЗакончен",Истина);
				СтруктураИзменений.Вставить("ОкончаниеНабора",НоваяДата);
				Сообщение="Набор по сотруднику "+СтрокаПН.наборщик+" закончен.";
				УстановитьТекущиеЗаданияСотрудников(СтрокаПН.наборщик);
				
			иначеесли СтароеСостояние=Перечисления.СостоянияНакладной.ДопОбработка тогда				
				если ЗначениеЗаполнено(СтрокаПН.НачалоОстановкиДопОбработки) тогда
					Сообщить("Сначала завершите паузу доп. обработки");
					Возврат;
				КонецЕсли;				
				СтруктураИзменений.Вставить("ДопОбработкаЗакончена",Истина);
				СтруктураИзменений.Вставить("ОкончаниеДопОбработки",НоваяДата);
				Сообщение="ДО по сотруднику "+СтрокаПН.ДопОбработчик+" закончена.";	
				
			иначеесли СтароеСостояние=Перечисления.СостоянияНакладной.Термоусадка тогда
				СтруктураИзменений.Вставить("ТермоусадкаЗакончена",Истина);
				СтруктураИзменений.Вставить("ОкончаниеТермоусадки",НоваяДата);
				Сообщение="Термоусадка по сотруднику "+СтрокаПН.Термоусадчик+" закончена.";	
				УстановитьТекущиеЗаданияСотрудников(СтрокаПН.Термоусадчик);
				
			иначеесли СтароеСостояние=Перечисления.СостоянияНакладной.Переукладка тогда
				СтруктураИзменений.Вставить("ОкончаниеПереукладки",НоваяДата);
				Сообщение="Переукладка по сотруднику "+СтрокаПН.Переукладчик+" закончена.";		
			КонецЕсли;
			
			
			
			для каждого СтрТЧ из МассСтрок цикл			
				ЗаполнитьЗначенияСвойств(СтрТЧ,СтруктураИзменений);
				СтрТЧ.Состояние=НовоеСостояние;		
			КонецЦикла;
			
			СообщитьИзМодуля(Сообщение);
		КонецЕсли;	
	КонецЕсли;
	
	Записать(РежимЗаписиДокумента.Запись);	
КонецПроцедуры
// Кухарь А.Ю. 15.01.2020 конец

// Кухарь А.Ю. 27.03.2020 начало
//
Функция АвтоматическиРазбитьПН_СформироватьЗНБ()   Экспорт
	Если ПолучитьРеквизитШапки(Накладная,"СостояниеНакладной")<>Перечисления.СостоянияНакладной.ПолученоСкладом Тогда
		СообщитьИзМодуля("Создавать ПН с распределением можно только в получено складом");
		возврат Ложь;
	КонецЕсли;	
	
	если Склад.ВидСклада=Перечисления.ВидСклада.ВиртуальныйДляСклада тогда
		СообщитьИзМодуля("Создавать ПН с распределением для пополнений нельзя");		
		возврат Ложь;
	КонецЕсли;		
	ЗаполнитьТаблицуБрэндовШарапово();	
	ВидРаспределения=0;	
	тБрэндов.Сортировать("ЭтоБлочки,Брэнд",новый СравнениеЗначений);
	дата=Накладная.дата;
	
	Для Каждого СтрокаТЧ Из тБрэндов Цикл
		// Кухарь А.Ю. 29.07.2020 начало
		// Теперь начальное состояние Ожидание набора
		// СтрокаТЧ.Состояние=Перечисления.СостоянияНакладной.СформированыЗаданияНабора;
		СтрокаТЧ.Состояние=Перечисления.СостоянияНакладной.ОжиданиеНабора; 
		// Кухарь А.Ю. 29.07.2020 конец
		
		
	КонецЦикла; 	
	
	НаборщикиУстановлены=УстановитьНаборщиков();
	если не НаборщикиУстановлены тогда
		СообщитьИзМодуля("План набора не записан");
		возврат ложь;
	КонецЕсли;
	
	НачатьТранзакцию();
	Записать(РежимЗаписиДокумента.Проведение);
	СоздатьЗаданияНабораДляАвторазбивки();	
	// Кухарь А.Ю. 29.07.2020 начало
	//УстановитьРеквизитыОбъекта(Накладная,Новый Структура("СостояниеНакладной",Перечисления.СостоянияНакладной.СформированыЗаданияНабора));
	УстановитьРеквизитыОбъекта(Накладная,Новый Структура("СостояниеНакладной",Перечисления.СостоянияНакладной.ОжиданиеНабора)); 
	// Кухарь А.Ю. 29.07.2020 конец
	
	
	ЗафиксироватьТранзакцию();
	
КонецФункции

Функция СоздатьЗаданияНабораДляАвторазбивки()	
	ВидНакладной=Накладная.Метаданные().Имя;
	ЭтоКомплектация=(ВидНакладной="РасходнаяНакладная" И ПолучитьРеквизитШапки(Накладная,"ОтгрузкаКомплектов","Документ")=Истина) или ВидНакладной="Комплектация"; 
	ИмяТЧНакладной=?(ЭтоКомплектация,"Комплектующие","Товары");
	
	Запрос=Новый ("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ ТЧ.Номенклатура, ТЧ.Единица, ТЧ.Коэффициент, СУММА(ТЧ.Количество) ПОМЕСТИТЬ ТЧ_Накладной ИЗ Документ."+ВидНакладной+"."+ИмяТЧНакладной+" как ТЧ ГДЕ Ссылка=&Накладная	
	|СГРУППИРОВАТЬ ПО
	|	ТЧ.Номенклатура,
	|ТЧ.Коэффициент,
	|	ТЧ.Единица
	|;
	|ВЫБРАТЬ 
	|	*
	|ПОМЕСТИТЬ ТЧ_ПН
	|ИЗ	
	|	Документ.ПланНабора.тБрэндов 
	|ГДЕ
	|	Ссылка=&Ссылка	
	|;	
	|ВЫБРАТЬ
	|	МИНИМУМ(НомерСтроки) КАК ИД_Строки,
	|	Наборщик,
	|	ЭтоКомплектующие,
	|	ЭтоБлочки
	|ПОМЕСТИТЬ Части_ПН	
	|ИЗ
	|	ТЧ_ПН
	|СГРУППИРОВАТЬ ПО
	|	Наборщик,
	|	ЭтоКомплектующие,
	|	ЭтоБлочки 	
	|;
	|ВЫБРАТЬ
	|	Части_ПН.ИД_Строки,
	|	Части_ПН.Наборщик,	
	|	Части_ПН.ЭтоКомплектующие,
	|	Части_ПН.ЭтоБлочки,
	|
	|	ТЧ_ПН.НомерСтроки 			КАК НомерСтрокиПН,
	|
	|	ТЧ_Накладной.Номенклатура 	КАК Номенклатура,	
	|	ТЧ_Накладной.Единица		КАК Единица,
	|	ВЫБОР 
	|		КОГДА ТЧ_ПН.Коллекция.ЭтоГруппа ТОГДА ТЧ_Накладной.Количество		
	|		ИНАЧЕ ТЧ_ПН.Количество
	|	КОНЕЦ КАК Количество,
	|	ТЧ_Накладной.Коэффициент	КАК Коэффициент
	|ИЗ 
	|	Части_ПН
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ТЧ_ПН  
	|ПО
	|	Части_ПН.Наборщик			= ТЧ_ПН.Наборщик
	|	И Части_ПН.ЭтоКомплектующие	= ТЧ_ПН.ЭтоКомплектующие
	|	И Части_ПН.ЭтоБлочки		= ТЧ_ПН.ЭтоБлочки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ТЧ_Накладной
	|ПО
	|	ВЫБОР 
	|		КОГДА ТЧ_ПН.Коллекция.ЭтоГруппа ТОГДА ТЧ_Накладной.Номенклатура.Родитель.Родитель 
	|		ИНАЧЕ ТЧ_Накладной.Номенклатура
	|	КОНЕЦ = ТЧ_ПН.Коллекция
	|ГДЕ
	|	ТЧ_Накладной.Количество>0
	|УПОРЯДОЧИТЬ ПО 
	|	Части_ПН.ИД_Строки,
	|	ТЧ_ПН.НомерСтроки
	|ИТОГИ 
	|	МАКСИМУМ(Части_ПН.Наборщик),
	|	МАКСИМУМ(Части_ПН.ЭтоКомплектующие),
	|	МАКСИМУМ(Части_ПН.ЭтоБлочки) 
	|ПО 
	|	Части_ПН.ИД_Строки	
	|";
	
	Запрос.УстановитьПараметр("Ссылка",		Ссылка);
	Запрос.УстановитьПараметр("Накладная",	Накладная);
	
	Если ВидНакладной="Перемещение" Тогда
		Получатель=ПолучитьРеквизитШапки(Накладная,"СкладПолучатель","Документ");
	Иначе
		Получатель=ПолучитьРеквизитШапки(Накладная,"Контрагент","Документ");
	КонецЕсли;	
	
	Сч=0;
	ВыборкаПоЧастям=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ИД_Строки");
	Пока ВыборкаПоЧастям.Следующий() Цикл
		Сч=Сч+1;	
		Задание						= НайтиСоздатьЗаданиеИзМодуля(Сч);	
		Задание.Накладная			= Накладная;
		// Кухарь А.Ю. 29.07.2020 начало
		// Задание.СостояниеНакладной	= Перечисления.СостоянияНакладной.СформированыЗаданияНабора;	
		Задание.СостояниеНакладной	= Перечисления.СостоянияНакладной.ОжиданиеНабора;	 
		// Кухарь А.Ю. 29.07.2020 конец
		
		Задание.Дата				= ТекущаяДата();
		Задание.Склад				= Склад;
		Задание.Получатель			= Получатель;
		Задание.ПометкаУдаления		= Ложь;
		Задание.Автор				= ПараметрыСеанса.Пользователь;			
		Задание.ЭтоКомплектующие	= ВыборкаПоЧастям.ЭтоКомплектующие;
		Задание.ЭтоБлочки			= ВыборкаПоЧастям.ЭтоБлочки;		
		Задание.Товары.Очистить();	
		Выборка=ВыборкаПоЧастям.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СтрокаТЧ=Задание.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,Выборка);				
			тБрэндов[Выборка.НомерСтрокиПН-1].НомерЧасти=Сч;
		КонецЦикла;		
		
		Задание.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;	
	
КонецФункции // ()

Функция НайтиСоздатьЗаданиеИзМодуля(НомерЧасти)
	СтруктураПоиска	= Новый Структура("ДокументОснование,НомерЧасти",Ссылка,НомерЧасти);
	Задание			= НайтиДокумент("ЗаданиеНабора",СтруктураПоиска);
	Если Задание.Пустая() Тогда
		ДокОбъект=Документы.ЗаданиеНабора.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(ДокОбъект,СтруктураПоиска);
	Иначе
		ДокОбъект=Задание.ПолучитьОбъект();
	КонецЕсли;	
	
	Возврат ДокОбъект;
КонецФункции //НайтиСоздатьЗадание(НомерЧасти)

///////////////////////////////////////////////////////////////////////////////////////////////
// ЕЩЁ ОДНА фУНКЦИЯ ПО УСТАНОВКЕ НАБОРЩИКОВ (подумаю, что с ней делать впоследствии)
///////////////////////////////////////////////////////////////////////////////////////////////
Функция УстановитьНаборщиков ()
	Запрос=новый запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	РеквизитыСправочников.Справочник КАК Сотрудник,
	|	РеквизитыСправочников.ЗначениеРеквизита КАК Сектор
	|ИЗ
	|	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
	|ГДЕ
	|	РеквизитыСправочников.ИмяРеквизита = ""СекторСотрудников""
	|	И РеквизитыСправочников.Справочник В иерархии(&Справочник)";
	
	запрос.УстановитьПараметр("Справочник",Справочники.ФизическиеЛица.НайтиПоКоду("SNL-02040"));
	ТЗСотрудников=запрос.Выполнить().Выгрузить();
	
	ТЗБрендовСверн=тБрэндов.Выгрузить(,"Брэнд,ЭтоБлочки");
	ТЗБрендовСверн.Свернуть("Брэнд,ЭтоБлочки");
	
	НаборщикиНайдены=Истина;
	Для каждого СтрТЧ из ТЗБрендовСверн цикл
		Сектор=СтрТЧ.Брэнд.СекторХраненияОдинцово4;
		если СтрДлина(Сектор)<3 тогда
			СообщитьИзМодуля("У номенклатуры "+СтрТЧ.Брэнд.Наименование+" не заполнен сектор");
			НаборщикиНайдены=Ложь;
			Продолжить;
		КонецЕсли;
		
		МассНаборщиков=ТЗСотрудников.НайтиСтроки(новый Структура("Сектор",Сектор));
		если МассНаборщиков.Количество()<2 тогда
			СообщитьИзМодуля("У сектора "+Сектор+" должно быть хотя бы 2 наборщика. ");
			НаборщикиНайдены=Ложь;
			Продолжить;		
		КонецЕсли;
		
		если СтрТЧ.этоблочки тогда
			Наборщик=МассНаборщиков[0].Сотрудник;
		иначе
			Наборщик=МассНаборщиков[1].Сотрудник;
		КонецЕсли;
		
		МассТЧ=тБрэндов.НайтиСтроки(Новый Структура("Брэнд,ЭтоБлочки",СтрТЧ.Брэнд,СтрТЧ.ЭтоБлочки));
		Для каждого СтрМасс из МассТЧ цикл
			СтрМасс.Наборщик=Наборщик;
		КонецЦикла;
		
	КонецЦикла;
	
	возврат НаборщикиНайдены;
	
	
КонецФункции
// Кухарь А.Ю. 27.03.2020 конец

//++Данилова Е.В. 24.02.2026

Функция СоздатьЗаданияНабораПоПлануНабора(РаспределятьРасходныеМатериалы,ДанныеДляРазделения = неопределено,НужноСоздаватьЗНМ_И_ЛМ_ПоЗНБ = неопределено) Экспорт	
	
	// Кухарь А.Ю. 19.02.2020 начало
	// Для пополнения по остаткам не проверяем
	если Склад.ВидСклада=Перечисления.ВидСклада.ВиртуальныйДляСклада тогда
		ЭтоПополнение=Истина;
	иначе
		ЭтоПополнение=Ложь;
	КонецЕсли;	
	// Кухарь А.Ю. 19.02.2020 конец
	
	Если ДанныеДляРазделения = неопределено 
		И НЕ ВсеНаборщикиЗаполнены() Тогда
		Сообщить("Не все наборщики заполнены !");
		Возврат Ложь;
	КонецЕсли;
	
	// Кухарь А.Ю. 15.03.2021 начало
	// 
	//++Данилова Е.В. 24.02.2026 HELP-8893 
	ДопПараметрыНакладной=ОбщегоНазначения_ПИ.ПолучитьДопПараметрыНакладной(Накладная);
	//--Данилова Е.В. 24.02.2026 
	//++Данилова Е.В. 12.03.2026 HELP-8893 
	//Если не ПроверитьСектораНаборщиковПоНабору(ДопПараметрыНакладной)  тогда
	Если ДанныеДляРазделения = неопределено
		И не ПроверитьСектораНаборщиковПоНабору(ДопПараметрыНакладной)  тогда
		возврат ложь;
	КонецЕсли;
	//--Данилова Е.В. 12.03.2026 
	
	НужноПересоздатьЗНБ=ложь;
	//++Данилова Е.В. 24.02.2026  HELP-8893 
	если ЭтоНовый() 
		ИЛИ Модифицированность() тогда
		ЗаписатьБезОбработки(РежимЗаписиДокумента.Проведение);
		//иначе
		//	Если Модифицированность() Тогда 
		//		НужноПересоздатьЗНБ=Истина;
		//		Возврат Ложь; 
		//	КонецЕсли;
	КонецЕсли;
	ВидНакладной=ОбщегоНазначения_ПИ.ПолучитьИмяДокумента(Накладная);
	ЭтоКомплектация = (ВидНакладной="РасходнаяНакладная" И ПолучитьРеквизитШапки(Накладная,"ОтгрузкаКомплектов","Документ")=Истина) или ВидНакладной="Комплектация";  
	
	//--Данилова Е.В. 24.02.2026 
	
	ИмяТЧНакладной=?(ЭтоКомплектация,"Комплектующие","Товары");	
	ОтделятьМаркированныйТовар=ОпределитьНеобходимостьМаркировкиПоНакладной(Накладная);
	
	// Кухарь А.Ю.  31.03.2024 начало
	если ВидНакладной="РасходнаяНакладная" или ВидНакладной="Перемещение" тогда
		ДатаОтгрузки=ПолучитьРеквизитШапки(Накладная,"ДатаОтгрузки","Документ");				
	иначе
		ДатаОтгрузки=ТекущаяДата();	
	КонецЕсли;
	
	если ДатаОтгрузки=ПустаяДата() тогда
		ДатаОтгрузки=ТекущаяДата();
	КонецЕсли;
	// Кухарь А.Ю.  31.03.2024 конец
	
	// Кельманов А.В. - ASU-2094 - 2025.03.13 {
	НужноСоздаватьЗНМ_И_ЛМ_ПоЗНБ = Ложь;
	//ДопПараметрыНакладной=ОбщегоНазначения_ПИ.ПолучитьДопПараметрыНакладной(Накладная);
	
	Если ВидНакладной = "РасходнаяНакладная" 
		И Не Склад.ЭтоСкладМаркированногоТовара 
		// Кухарь А.Ю.  20.03.2025 начало
		и СобиратьНаТСД 
		и ДопПараметрыНакладной.ОтгрузкаFBS = Истина
		// Кухарь А.Ю.  20.03.2025 конец
		
		И Не Накладная.ОтгрузкаКомплектов Тогда
		
		НужноСоздаватьЗНМ_И_ЛМ_ПоЗНБ = Истина;
		
	КонецЕсли;
	
	
	
	// Кухарь А.Ю.  02.04.2025 начало
	если ВидНакладной = "РасходнаяНакладная" и ПолучитьРеквизитШапки(Накладная,"ТребуетсяМаркировка","Документ") тогда
		Результат=Документы.РасходнаяНакладная.СоздатьПредварительныеАгрегатыНаНакладную(Накладная);
		если не Результат.Успех тогда
			Сообщить(СтрСоединить(Результат.ошибки,символы.ПС));    
			// Кухарь А.Ю. 06.04.2025 начало
			Сообщить("ЗНБ не были созданы. При необходимости, обратитесь к менеджеру и попробуйте создать ЗНБ позже.");
			Возврат ложь; 
			// Кухарь А.Ю. 06.04.2025 конец
			
		КонецЕсли;
	КонецЕсли;
	// Кухарь А.Ю.  02.04.2025 конец
	
	
	
	Если Не НужноСоздаватьЗНМ_И_ЛМ_ПоЗНБ Тогда
	// Кельманов А.В. - ASU-2094 - 2025.03.13 }
		
		// Кухарь А.Ю.  10.07.2024 начало
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗаданиеНаМаркировку.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаданиеНаМаркировку КАК ЗаданиеНаМаркировку
		|ГДЕ
		|	ЗаданиеНаМаркировку.Проведен
		|	И ЗаданиеНаМаркировку.ДокОснование = &ДокОснование";
		
		Запрос.УстановитьПараметр("ДокОснование", Накладная);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ЗНМОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			Если Ложь Тогда ЗНМОбъект = Документы.ЗаданиеНаМаркировку.СоздатьДокумент(); КонецЕсли;
			
			// Кухарь А.Ю. 17.01.2025 начало
			//Стоит запрет на распроведение
			//ЗНМОбъект.УстановитьПометкуУдаления(Истина);
			// Кухарь А.Ю. 17.01.2025 конец
			
		КонецЦикла;
		// Кухарь А.Ю.  10.07.2024 конец
		
		// Кухарь А.Ю.  19.11.2024 начало
		
	// Кельманов А.В. - ASU-2094 - 2025.03.13 {
	КонецЕсли;
	// Кельманов А.В. - ASU-2094 - 2025.03.13 }
	
	// Кухарь А.Ю.  10.03.2025 начало
	//Если ВидНакладной = "РасходнаяНакладная"  и  ОтделятьМаркированныйТовар тогда
	Если (ВидНакладной = "РасходнаяНакладная" или ВидНакладной = "Перемещение") и  ОтделятьМаркированныйТовар тогда 
	// Кухарь А.Ю.  10.03.2025 конец		
		ТаблицаПереопределяемыхДат=МаркировкаКС.ПодготовитьТаблицуСПереопределяемойДатойНачалаРаботыСМаркировкой(Накладная,ИмяТЧНакладной);			
	КонецЕсли;
	Запрос=Новый ("Запрос");      
	
	// Кухарь А.Ю.  30.01.2026 начало       
	ТаблицаСПризнакомАдресногоХранения = ПолучитьТаблицуТоваровКАдресногоХранения(Накладная,ИмяТЧНакладной); 
	запрос.УстановитьПараметр("ТаблицаСПризнакомАдресногоХранения",ТаблицаСПризнакомАдресногоХранения);	
	// Кухарь А.Ю.  30.01.2026 конец
	//++Данилова Е.В. 24.02.2026  HELP-8893
	ЧастиДляРазделения = Новый Массив;
	
	ТоварыДляПереноса = Новый ТаблицаЗначений;	
	ТоварыДляПереноса.Колонки.Добавить("номенклатура", Новый ОписаниеТипов("СправочникСсылка.номенклатура"));
	ТоварыДляПереноса.Колонки.Добавить("Коллекция",Новый ОписаниеТипов("СправочникСсылка.номенклатура")); 	
	Если ДанныеДляРазделения <> неопределено Тогда
		ЧастиДляРазделения 	= ДанныеДляРазделения.НомераЧастей; 
		ТоварыДляПереноса 	= ДанныеДляРазделения.ТоварыДляПереноса; 
	КонецЕсли;
	//--Данилова Е.В. 24.02.2026 
	
	если ТаблицаПереопределяемыхДат = Неопределено или ТаблицаПереопределяемыхДат.Количество()=0 тогда 
		
		// Кухарь А.Ю.  19.11.2024 конец
		
		
		
		Запрос.Текст 	= "ВЫБРАТЬ
		|	ТаблицаСПризнакомАдресногоХранения.Номенклатура КАК Номенклатура,
		|	ТаблицаСПризнакомАдресногоХранения.АдресноеХранение КАК АдресноеХранение
		|ПОМЕСТИТЬ ВТАдресов
		|ИЗ
		|	&ТаблицаСПризнакомАдресногоХранения КАК ТаблицаСПризнакомАдресногоХранения
		|;
		//++Данилова Е.В. 24.02.2026 HELP-8893 
		| ВЫБРАТЬ
		|	ТоварыДляПереноса.Номенклатура КАК Номенклатура,
		|	ТоварыДляПереноса.Коллекция КАК Коллекция
		|ПОМЕСТИТЬ ВТТоварыДляПереноса
		|ИЗ
		|	&ТоварыДляПереноса КАК ТоварыДляПереноса
		|;
        | ВЫБРАТЬ Различные
		|	ВТТоварыДляПереноса.Коллекция КАК Коллекция
		|ПОМЕСТИТЬ ВТТоварыДляПереносаСвернутая
		|ИЗ
		|	ВТТоварыДляПереноса КАК ВТТоварыДляПереноса
		|;

		//--Данилова Е.В. 24.02.2026 
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧ.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой КАК ДатаНачалаРаботыСМаркировкой,
		|	ТЧ.Номенклатура КАК Номенклатура,
		|	0 КАК КоличествоДляНаборов,
		|	МАКСИМУМ(ТЧ.Единица) КАК Единица,
		|	МАКСИМУМ(ТЧ.Коэффициент) КАК Коэффициент,
		|	СУММА(ТЧ.Количество) КАК Количество,
		|	ЕСТЬNULL(ВТАдресов.АдресноеХранение, ЛОЖЬ) КАК АдресноеХранение
		|ПОМЕСТИТЬ ТЧ_Накладной
		|ИЗ
		|	Документ.РасходнаяНакладная.Товары КАК ТЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАдресов КАК ВТАдресов
		|		ПО ТЧ.Номенклатура = ВТАдресов.Номенклатура
		|ГДЕ
		|	ТЧ.Ссылка = &Накладная
		|
		|СГРУППИРОВАТЬ ПО
		|	ТЧ.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой,
		|	ТЧ.Номенклатура,
		|	ЕСТЬNULL(ВТАдресов.АдресноеХранение, ЛОЖЬ)
		|;
		|ВЫБРАТЬ 
		|	*
		|ПОМЕСТИТЬ ТЧ_ПН
		|ИЗ	
		|	Документ.ПланНабора.тБрэндов 
		|ГДЕ
		|	Ссылка=&Ссылка	
		|;	
		|ВЫБРАТЬ
		|	МИНИМУМ(НомерСтроки) КАК ИД_Строки,
		|	Наборщик,
		|	ЭтоКомплектующие,
		|СУММА(ТЧ_ПН.КоличествоДляНаборов) КАК КоличествоДляНаборов,	
		|	ТребуетсяМаркировка,  
		// Кухарь А.Ю.  30.01.2026 начало
		| АдресноеХранение,	
		// Кухарь А.Ю.  30.01.2026 конец
		
		
		|	ЭтоБлочки,
		//++Данилова Е.В. 24.02.2026 HELP-8893 
		|  Разделенная
		//--Данилова Е.В. 24.02.2026
		|ПОМЕСТИТЬ Части_ПН	
		|ИЗ
		|	ТЧ_ПН
		|СГРУППИРОВАТЬ ПО
		|	Наборщик,
		|	ЭтоКомплектующие,
		|	ТребуетсяМаркировка,	
		// Кухарь А.Ю.  30.01.2026 начало
		| АдресноеХранение,	
		// Кухарь А.Ю.  30.01.2026 конец
		
		|	ЭтоБлочки,
		//++Данилова Е.В. 24.02.2026 HELP-8893 
		|  Разделенная
		//--Данилова Е.В. 24.02.2026 
		|;
		|ВЫБРАТЬ
		|	Части_ПН.ИД_Строки,
		|	Части_ПН.Наборщик,	
		|	Части_ПН.ЭтоКомплектующие,
		|	Части_ПН.ЭтоБлочки,   
		// Кухарь А.Ю.  30.01.2026 начало
		|	Части_ПН.АдресноеХранение,  
		
		// Кухарь А.Ю.  30.01.2026 конец
		
		|	Части_ПН.ТребуетсяМаркировка,	
		|
		|	ТЧ_ПН.НомерСтроки 			КАК НомерСтрокиПН,
		|
		|	ТЧ_Накладной.Номенклатура 	КАК Номенклатура,	
		|	ТЧ_Накладной.Единица		КАК Единица,
		|	ВЫБОР 
		|		КОГДА ТЧ_ПН.Коллекция.ЭтоГруппа ТОГДА ТЧ_Накладной.Количество		
		|		ИНАЧЕ ТЧ_ПН.Количество
		|	КОНЕЦ КАК Количество,
		|ВЫБОР
		|	КОГДА ТЧ_ПН.Коллекция.ЭтоГруппа
		|			И ТЧ_ПН.ТребуетсяМаркировка
		|		ТОГДА ТЧ_Накладной.КоличествоДляНаборов
		|	КОГДА ТЧ_ПН.ТребуетсяМаркировка
		|		ТОГДА ТЧ_ПН.КоличествоДляНаборов
		|	ИНАЧЕ 0
		|КОНЕЦ КАК КоличествоДляНаборов,
		|	ТЧ_Накладной.Коэффициент	КАК Коэффициент,
		//++Данилова Е.В. 24.02.2026 HELP-8893 
		|  Части_ПН.Разделенная
		//--Данилова Е.В. 24.02.2026
		|ИЗ 
		|	Части_ПН
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ТЧ_ПН  
		|ПО
		|	Части_ПН.Наборщик			= ТЧ_ПН.Наборщик
		|	И Части_ПН.ЭтоКомплектующие	= ТЧ_ПН.ЭтоКомплектующие
		|	И Части_ПН.ТребуетсяМаркировка	= ТЧ_ПН.ТребуетсяМаркировка
		|	И Части_ПН.ЭтоБлочки		= ТЧ_ПН.ЭтоБлочки	
		// Кухарь А.Ю.  30.01.2026 начало
		|	И Части_ПН.АдресноеХранение		= ТЧ_ПН.АдресноеХранение		
		// Кухарь А.Ю.  30.01.2026 конец
		 
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ТЧ_Накладной
		|ПО
		|	ВЫБОР 
		|		КОГДА ТЧ_ПН.Коллекция.ЭтоГруппа ТОГДА ТЧ_Накладной.Номенклатура.Родитель.Родитель  		 
		|		ИНАЧЕ ТЧ_Накладной.Номенклатура
		|	КОНЕЦ = ТЧ_ПН.Коллекция
		|  // Кухарь А.Ю.  30.01.2026 начало
		// Пустая задача
		|  И ТЧ_ПН.АдресноеХранение = ТЧ_Накладной.АдресноеХранение 
		// Кухарь А.Ю.  30.01.2026 конец
		
		|  И ВЫБОР 
		|		КОГДА 
		|			ТЧ_Накладной.ДатаНачалаРаботыСМаркировкой <> &ПустаяДата и ТЧ_Накладной.ДатаНачалаРаботыСМаркировкой <= &ДатаОтгрузки И &ОтделятьМаркированныйТовар 
		|		ТОГДА Истина
		//Валетов + 20,02,25 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2841
		|		КОГДА ТЧ_Накладной.Номенклатура.ОтгрузкаТолькоЧерезЧЗ
		|			ТОГДА ИСТИНА
		//Валетов -
		|		ИНАЧЕ Ложь 
		|	КОНЕЦ = ТЧ_ПН.ТребуетсяМаркировка
		//++Данилова Е.В. 24.02.2026 HELP-8893 
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ВТТоварыДляПереносаСвернутая КАК  ВТТоварыДляПереносаСвернутая
		|   ПО ВТТоварыДляПереносаСвернутая.Коллекция = ТЧ_ПН.Коллекция
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ВТТоварыДляПереноса КАК  ВТТоварыДляПереноса
		|   ПО ВТТоварыДляПереноса.Коллекция = ТЧ_ПН.Коллекция
		|   	И ВТТоварыДляПереноса.Номенклатура = ТЧ_Накладной.Номенклатура
		//--Данилова Е.В. 24.02.2026
		|ГДЕ
		|	ТЧ_Накладной.Количество>0 
		//++Данилова Е.В. 24.02.2026  HELP-8893
		|	И ВЫБОР 
		|		КОГДА  НЕ ВТТоварыДляПереносаСвернутая.Коллекция ЕСТЬ NULL 
		|			И ТЧ_ПН.Разделенная 
		|		ТОГДА ВТТоварыДляПереноса.Номенклатура ЕСТЬ NULL 
		|		КОГДА  НЕ ВТТоварыДляПереносаСвернутая.Коллекция ЕСТЬ NULL 
		|				И НЕ ТЧ_ПН.Разделенная
		|		ТОГДА НЕ ВТТоварыДляПереноса.Номенклатура ЕСТЬ NULL
		|			ИНАЧЕ   Истина 
		|		КОНЕЦ
		//--Данилова Е.В. 24.02.2026 
		|УПОРЯДОЧИТЬ ПО 
		|	Части_ПН.ИД_Строки,
		|	ТЧ_ПН.НомерСтроки
		|ИТОГИ     
		// Кухарь А.Ю.  30.01.2026 начало
		|	МАКСИМУМ(Части_ПН.АдресноеХранение),  
		// Кухарь А.Ю.  30.01.2026 конец		
		|	МАКСИМУМ(Части_ПН.Наборщик),
		|	МАКСИМУМ(Части_ПН.ЭтоКомплектующие),
		|	МАКСИМУМ(Части_ПН.ТребуетсяМаркировка),
		|	МАКСИМУМ(Части_ПН.ЭтоБлочки),
		//++Данилова Е.В. 24.02.2026 HELP-8893 
		|  МАКСИМУМ(Части_ПН.Разделенная)
		//--Данилова Е.В. 24.02.2026
		|ПО 
		|	Части_ПН.ИД_Строки	
		|";
	иначе
		// Кухарь А.Ю.  19.11.2024 конец
		
		Запрос.Текст 	= "ВЫБРАТЬ
		|	ТаблицаСПризнакомАдресногоХранения.Номенклатура КАК Номенклатура,
		|	ТаблицаСПризнакомАдресногоХранения.АдресноеХранение КАК АдресноеХранение
		|ПОМЕСТИТЬ ВТАдресов
		|ИЗ
		|	&ТаблицаСПризнакомАдресногоХранения КАК ТаблицаСПризнакомАдресногоХранения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДат.Номенклатура КАК Номенклатура,
		|	ТаблицаДат.ДатаНачалаРаботыСМаркировкой КАК ДатаНачалаРаботыСМаркировкой
		|ПОМЕСТИТЬ ТаблицаСДатами
		|ИЗ
		|	&ТаблицаПереопределяемыхДат КАК ТаблицаДат
		|;
		|
		//++Данилова Е.В. 24.02.2026 HELP-8893 
		| ВЫБРАТЬ
		|	ТоварыДляПереноса.Номенклатура КАК Номенклатура,
		|	ТоварыДляПереноса.Коллекция КАК Коллекция
		|ПОМЕСТИТЬ ВТТоварыДляПереноса
		|ИЗ
		|	&ТоварыДляПереноса КАК ТоварыДляПереноса
		|;
        | ВЫБРАТЬ Различные
		|	ВТТоварыДляПереноса.Коллекция КАК Коллекция
		|ПОМЕСТИТЬ ВТТоварыДляПереносаСвернутая
		|ИЗ
		|	ВТТоварыДляПереноса КАК ВТТоварыДляПереноса
		|;

		//--Данилова Е.В. 24.02.2026
		|////////////////////////////////////////////////////////////////////////////////
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧ.Номенклатура КАК Номенклатура,
		|	0 КАК КоличествоДляНаборов,
		|	МАКСИМУМ(ТЧ.Единица) КАК Единица,
		|	МАКСИМУМ(ТЧ.Коэффициент) КАК Коэффициент,
		|	СУММА(ТЧ.Количество) КАК Количество,
		|	ЕСТЬNULL(ТаблицаСДатами.ДатаНачалаРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачалаРаботыСМаркировкой,
		|	ЕСТЬNULL(ВТАдресов.АдресноеХранение, ЛОЖЬ) КАК АдресноеХранение
		|ПОМЕСТИТЬ ТЧ_Накладной
		|ИЗ
		|	Документ.РасходнаяНакладная.Товары КАК ТЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСДатами КАК ТаблицаСДатами
		|		ПО ТЧ.Номенклатура = ТаблицаСДатами.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАдресов КАК ВТАдресов
		|		ПО ТЧ.Номенклатура = ВТАдресов.Номенклатура
		|ГДЕ
		|	ТЧ.Ссылка = &Накладная
		|
		|СГРУППИРОВАТЬ ПО
		|	ТЧ.Номенклатура,
		|	ЕСТЬNULL(ТаблицаСДатами.ДатаНачалаРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1)),
		|	ЕСТЬNULL(ВТАдресов.АдресноеХранение, ЛОЖЬ)
		|;
		|ВЫБРАТЬ 
		|	*
		|ПОМЕСТИТЬ ТЧ_ПН
		|ИЗ	
		|	Документ.ПланНабора.тБрэндов 
		|ГДЕ
		|	Ссылка=&Ссылка	
		|;	
		|ВЫБРАТЬ
		|	МИНИМУМ(НомерСтроки) КАК ИД_Строки,
		|	Наборщик,
		|	ЭтоКомплектующие,
		|СУММА(ТЧ_ПН.КоличествоДляНаборов) КАК КоличествоДляНаборов,	
		|	ТребуетсяМаркировка, 
		// Кухарь А.Ю.  30.01.2026 начало
		| АдресноеХранение,		 
		// Кухарь А.Ю.  30.01.2026 конец
		
		|	ЭтоБлочки,
		//++Данилова Е.В. 24.02.2026 HELP-8893 
		|  Разделенная
		//--Данилова Е.В. 24.02.2026
		|ПОМЕСТИТЬ Части_ПН	
		|ИЗ
		|	ТЧ_ПН
		|СГРУППИРОВАТЬ ПО
		|	Наборщик,
		|	ЭтоКомплектующие,
		|	ТребуетсяМаркировка,
		// Кухарь А.Ю.  30.01.2026 начало
		| АдресноеХранение,		 
		// Кухарь А.Ю.  30.01.2026 конец
		
		|	ЭтоБлочки,
		//++Данилова Е.В. 24.02.2026 HELP-8893 
		|  Разделенная
		//--Данилова Е.В. 24.02.2026
		|;
		|ВЫБРАТЬ
		|	Части_ПН.ИД_Строки,
		|	Части_ПН.Наборщик,	
		|	Части_ПН.ЭтоКомплектующие,   
		// Кухарь А.Ю.  30.01.2026 начало
		| Части_ПН.АдресноеХранение,
		// Кухарь А.Ю.  30.01.2026 конец
		//++Данилова Е.В. 24.02.2026 HELP-8893 
		|  Части_ПН.Разделенная,
		//--Данилова Е.В. 24.02.2026
		|	Части_ПН.ЭтоБлочки,
		|	Части_ПН.ТребуетсяМаркировка,	
		|
		|	ТЧ_ПН.НомерСтроки 			КАК НомерСтрокиПН,
		|
		|	ТЧ_Накладной.Номенклатура 	КАК Номенклатура,	
		|	ТЧ_Накладной.Единица		КАК Единица,
		|	ВЫБОР 
		|		КОГДА ТЧ_ПН.Коллекция.ЭтоГруппа ТОГДА ТЧ_Накладной.Количество		
		|		ИНАЧЕ ТЧ_ПН.Количество
		|	КОНЕЦ КАК Количество,
		|ВЫБОР
		|	КОГДА ТЧ_ПН.Коллекция.ЭтоГруппа
		|			И ТЧ_ПН.ТребуетсяМаркировка
		|		ТОГДА ТЧ_Накладной.КоличествоДляНаборов
		|	КОГДА ТЧ_ПН.ТребуетсяМаркировка
		|		ТОГДА ТЧ_ПН.КоличествоДляНаборов
		|	ИНАЧЕ 0
		|КОНЕЦ КАК КоличествоДляНаборов,
		|	ТЧ_Накладной.Коэффициент	КАК Коэффициент
		|ИЗ 
		|	Части_ПН
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ТЧ_ПН  
		|ПО
		|	Части_ПН.Наборщик			= ТЧ_ПН.Наборщик
		|	И Части_ПН.ЭтоКомплектующие	= ТЧ_ПН.ЭтоКомплектующие
		|	И Части_ПН.ТребуетсяМаркировка	= ТЧ_ПН.ТребуетсяМаркировка
		|	И Части_ПН.ЭтоБлочки		= ТЧ_ПН.ЭтоБлочки
		// Кухарь А.Ю.  30.01.2026 начало
		|	И Части_ПН.АдресноеХранение		= ТЧ_ПН.АдресноеХранение
		// Кухарь А.Ю.  30.01.2026 конец
		//++Данилова Е.В. 25.02.2026 HELP-8893 
		|	И Части_ПН.Разделенная		= ТЧ_ПН.Разделенная
		//--Данилова Е.В. 25.02.2026 
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ТЧ_Накладной
		|ПО
		|	ВЫБОР 
		|		КОГДА ТЧ_ПН.Коллекция.ЭтоГруппа ТОГДА ТЧ_Накладной.Номенклатура.Родитель.Родитель 
		|		ИНАЧЕ ТЧ_Накладной.Номенклатура
		|	КОНЕЦ = ТЧ_ПН.Коллекция         
		// Пустая задача
		|  И ТЧ_ПН.АдресноеХранение = ТЧ_Накладной.АдресноеХранение 
		// Кухарь А.Ю.  30.01.2026 конец
		
		|
		|  И ВЫБОР 
		|		КОГДА 
		|			ТЧ_Накладной.ДатаНачалаРаботыСМаркировкой <> &ПустаяДата и ТЧ_Накладной.ДатаНачалаРаботыСМаркировкой <= &ДатаОтгрузки И &ОтделятьМаркированныйТовар 
		|		ТОГДА Истина 
		//Валетов + 20,02,25 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2841
		|		КОГДА ТЧ_Накладной.Номенклатура.ОтгрузкаТолькоЧерезЧЗ
		|			ТОГДА ИСТИНА
		//Валетов -
		|		ИНАЧЕ Ложь 
		|	КОНЕЦ = ТЧ_ПН.ТребуетсяМаркировка
		//++Данилова Е.В. 24.02.2026 HELP-8893 
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ВТТоварыДляПереносаСвернутая КАК  ВТТоварыДляПереносаСвернутая
		|   ПО ВТТоварыДляПереносаСвернутая.Коллекция = ТЧ_ПН.Коллекция
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ВТТоварыДляПереноса КАК  ВТТоварыДляПереноса
		|   ПО ВТТоварыДляПереноса.Коллекция = ТЧ_ПН.Коллекция
		|   	И ВТТоварыДляПереноса.Номенклатура = ТЧ_Накладной.Номенклатура
		//--Данилова Е.В. 24.02.2026

		|ГДЕ
		|	ТЧ_Накладной.Количество>0
		//++Данилова Е.В. 24.02.2026  HELP-8893
		|	И ВЫБОР 
		|		КОГДА  НЕ ВТТоварыДляПереносаСвернутая.Коллекция ЕСТЬ NULL 
		|			И ТЧ_ПН.Разделенная 
		|		ТОГДА ВТТоварыДляПереноса.Номенклатура ЕСТЬ NULL 
		|		КОГДА  НЕ ВТТоварыДляПереносаСвернутая.Коллекция ЕСТЬ NULL 
		|				И НЕ ТЧ_ПН.Разделенная
		|		ТОГДА НЕ ВТТоварыДляПереноса.Номенклатура ЕСТЬ NULL
		|			ИНАЧЕ   Истина 
		|		КОНЕЦ
		//--Данилова Е.В. 24.02.2026
		|УПОРЯДОЧИТЬ ПО 
		|	Части_ПН.ИД_Строки,
		|	ТЧ_ПН.НомерСтроки
		|ИТОГИ 
		|	МАКСИМУМ(Части_ПН.Наборщик),
		|	МАКСИМУМ(Части_ПН.ЭтоКомплектующие),
		|	МАКСИМУМ(Части_ПН.ТребуетсяМаркировка), 
		// Кухарь А.Ю.  30.01.2026 начало
		|	МАКСИМУМ(Части_ПН.АдресноеХранение), 
		// Кухарь А.Ю.  30.01.2026 конец
		
		|	МАКСИМУМ(Части_ПН.ЭтоБлочки),
		//++Данилова Е.В. 24.02.2026 HELP-8893 
		|  МАКСИМУМ(Части_ПН.Разделенная)
		//--Данилова Е.В. 24.02.2026
		|ПО 
		|	Части_ПН.ИД_Строки	
		|";	
		запрос.УстановитьПараметр("ТаблицаПереопределяемыхДат",ТаблицаПереопределяемыхДат); 
	КонецЕсли;
	Запрос.Текст=СтрЗаменить(запрос.Текст,"Документ.РасходнаяНакладная.Товары КАК ТЧ","Документ."+ВидНакладной+"."+ИмяТЧНакладной+" КАК ТЧ"); 
	
	Запрос.УстановитьПараметр("Ссылка",		Ссылка);
	Запрос.УстановитьПараметр("Накладная",	Накладная);
	запрос.УстановитьПараметр("ОтделятьМаркированныйТовар",ОтделятьМаркированныйТовар);	 
	запрос.УстановитьПараметр("ПустаяДата",ПустаяДата());	 
	запрос.УстановитьПараметр("ДатаОтгрузки",ДатаОтгрузки);	
	если ИмяТЧНакладной="Комплектующие" тогда
		ПолеКоличествоДляНаборов="СУММА(ВЫБОР
		|КОГДА ТЧ.Номенклатура = ТЧ.Продукция
		|	ТОГДА 0
		|ИНАЧЕ ТЧ.Количество
		|КОНЕЦ) КАК КоличествоДляНаборов";
		запрос.Текст=СтрЗаменить(запрос.Текст,"0 КАК КоличествоДляНаборов",ПолеКоличествоДляНаборов);
		
	КонецЕсли;
	//++Данилова Е.В. 24.02.2026  HELP-8893 
	запрос.УстановитьПараметр("ТоварыДляПереноса",ТоварыДляПереноса);
	если ДанныеДляРазделения = Неопределено Тогда 
		//УдалитьПодчиненныеЗадания();
		УдалитьПодчиненныеЗаданияНабора();
	КонецЕсли;
	//--Данилова Е.В. 24.02.2026 
	
	Если ТипЗнч(Накладная)=Тип("ДокументСсылка.РасходнаяНакладная")  Тогда			
		ИмяРеквизита="Контрагент";			
	Иначе
		ИмяРеквизита="СкладПолучатель";			
	КонецЕсли; 	
	
	СписокРеквизитов=Новый Соответствие;
	
	если ТипЗнч(Накладная)=Тип("ДокументСсылка.Комплектация") тогда
		СписокРеквизитов.Вставить("Контрагент","Получатель");	
		Реквизиты=ПолучитьРеквизитыШапки(Накладная,СписокРеквизитов,"Документ");
		Получатель=Реквизиты.получатель;
		ДатаОтгрузки=ТекущаяДата();				
	иначе
		СписокРеквизитов.Вставить(ИмяРеквизита,"Получатель");
		СписокРеквизитов.Вставить("ДатаОтгрузки","ДатаОтгрузки");		
		Реквизиты=ПолучитьРеквизитыШапки(Накладная,СписокРеквизитов,"Документ");
		Получатель=Реквизиты.получатель;
		ДатаОтгрузки=Реквизиты.ДатаОтгрузки;			
	КонецЕсли;	 
	
	Если РаспределятьРасходныеМатериалы и ИмяТЧНакладной="Комплектующие" тогда
		ТаблицаРасходниковСРаспределением=ПолучитьТаблицуРасходныхМатериаловСРаспределениемНабора();
		ТаблицаРасходниковСвёрнутая=ПолучитьТаблицуРасходныхМатериаловСвернутуюНабора();
		ТаблицаРасходниковТекущейЗНБ=ТаблицаРасходниковСРаспределением.скопировать();
		ТаблицаРасходниковТекущейЗНБ.очистить();
	иначе 
		ТаблицаРасходниковСРаспределением= Неопределено;
		ТаблицаРасходниковТекущейЗНБ = Неопределено;
	КонецЕсли;
	
	Сч=0;
	ВыборкаПоЧастям = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ИД_Строки");
	Пока ВыборкаПоЧастям.Следующий() Цикл
		Сч=Сч+1;
		//++Данилова Е.В. 24.02.2026 HELP-8893  	 
		Если ДанныеДляРазделения <> неопределено
			И ЧастиДляРазделения.Найти(Сч) = неопределено Тогда
			
			СтруктураПоиска	= Новый Структура("ДокументОснование,НомерЧасти,ПометкаУдаления",Ссылка,Сч,ложь);
			Задание			= НайтиДокумент("ЗаданиеНабора",СтруктураПоиска);
			Если ЗначениеЗаполнено(Задание) Тогда 
				Продолжить; 
			КонецЕсли;
		КонецЕсли;
		//Задание						= НайтиСоздатьЗадание(Сч);
		Задание = НайтиСоздатьЗаданиеНабора(Сч);
		Если ДанныеДляРазделения <> неопределено Тогда
			Задание.Товары.Очистить(); 
		КонецЕсли;
		//--Данилова Е.В. 24.02.2026 
		если ложь тогда задание=документы.ЗаданиеНабора.СоздатьДокумент();КонецЕсли;
		
		Задание.Накладная			= Накладная;
		Задание.ПланируемыеСостояния.Очистить();
		задание.СобиратьНаТСД=СобиратьНаТСД;
		Задание.СобиратьВПервуюОчередь=СобиратьВПервуюОчередь;
		Задание.ПроходнаяНакладная=ПроходнаяНакладная;
		задание.НаборМиксами=НаборМиксами;
		задание.ПоследовательныйНабор=ПоследовательныйНабор;
		Задание.Получатель=Получатель;
		Задание.ДатаОтгрузки=ДатаОтгрузки;	
		Задание.СостояниеНакладной	= Перечисления.СостоянияНакладной.ОжиданиеНабора;
		Задание.Дата				= ТекущаяДата();
		Задание.Склад				= Склад;
		Задание.Получатель			= Получатель;
		Задание.ПометкаУдаления		= Ложь;
		Задание.Автор				= ПараметрыСеанса.Пользователь;		
		
		Задание.ЭтоКомплектующие	= ВыборкаПоЧастям.ЭтоКомплектующие;
		Задание.ЭтоБлочки			= ВыборкаПоЧастям.ЭтоБлочки;  
		// Кухарь А.Ю.  30.01.2026 начало
		Задание.АдресноеХранение			= ВыборкаПоЧастям.АдресноеХранение; 	
		// Кухарь А.Ю.  30.01.2026 конец  
		//++Данилова Е.В. 24.02.2026  HELP-8893
		Задание.Разделенная			= ВыборкаПоЧастям.Разделенная;
		//--Данилова Е.В. 24.02.2026 
		
		Задание.ТребуетсяМаркировка=ВыборкаПоЧастям.ТребуетсяМаркировка; 
		Задание.Товары.Очистить();
		
		Выборка=ВыборкаПоЧастям.Выбрать();
		
		
		ТребуетсяФормированиеНабораЧЗ=ложь;
		если ТаблицаРасходниковСРаспределением<>Неопределено тогда
			ТаблицаРасходниковТекущейЗНБ.Очистить();
		КонецЕсли;

		Пока Выборка.Следующий() Цикл

			// Кухарь А.Ю. 15.03.2021 начало
			//			тБрэндов[Выборка.НомерСтрокиПН-1].НомерЧасти=Сч;			
			СтрокаПН=тБрэндов[Выборка.НомерСтрокиПН-1];		
			СтрокаПН.НомерЧасти=Сч;
			// Кухарь А.Ю. 15.03.2021 конец
			
			СтрокаТЧ=Задание.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,Выборка);	
			// Кухарь А.Ю.  06.11.2024 начало
			//
			если СтрокаТЧ.КоличествоДляНаборов>0 тогда
				ТребуетсяФормированиеНабораЧЗ=Истина;
			КонецЕсли;
			
			если ТаблицаРасходниковСРаспределением<>Неопределено тогда
				МассСтрок=ТаблицаРасходниковСРаспределением.НайтиСтроки(Новый Структура("НормальныйТовар",СтрокаТЧ.Номенклатура));
				Для каждого СтрМасс из МассСтрок цикл
					СтрокаТекущегоЗНБ=ТаблицаРасходниковТекущейЗНБ.добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТекущегоЗНБ,СтрМасс);
					СтрокаТекущегоЗНБ.Количество=СтрМасс.РасходниковНаШтукуТовара*СтрокаТЧ.Количество;
				КонецЦикла;
			КонецЕсли;
			// Кухарь А.Ю.  13.11.2024 конец

		КонецЦикла;		
		
		если ТаблицаРасходниковСРаспределением<>Неопределено тогда
			ТаблицаРасходниковТекущейЗНБ.Свернуть("Номенклатура,Единица","Количество");
			Для каждого СтрТЗРасходников из ТаблицаРасходниковТекущейЗНБ цикл
				СтрокаСвернутая=ТаблицаРасходниковТекущейЗНБ.Найти(СтрТЗРасходников.Номенклатура,"Номенклатура");
				если СтрокаСвернутая=Неопределено тогда
					Сообщить("Не удалось распределить "+СтрТЗРасходников.Номенклатура+". Попробуйте распределить обычным способом.");
					Продолжить;
				КонецЕсли;
				
				РаспределяемоеКоличество=Мин(Окр(СтрТЗРасходников.Количество,0),СтрокаСвернутая.Количество);
				СтрокаСвернутая.Количество=СтрокаСвернутая.Количество-РаспределяемоеКоличество;
				СтрокаТЧ=Задание.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрТЗРасходников);
				СтрокаТЧ.Количество=РаспределяемоеКоличество;

			КонецЦикла;
		КонецЕсли;
		
		Задание.ТребуетсяФормированиеНабораЧЗ= ТребуетсяФормированиеНабораЧЗ;
		//++Данилова Е.В. 03.02.2026  SNL-109
		//Данилова Е.В. 11.03.2026 SNL-159 
		//ЕстьБлокировкаПоТоварам = Обработки.ПланИнвентаризации.ЕстьблокировкаПоТоварамСклада(Склад,Задание.Товары.Выгрузить(,"Номенклатура").ВыгрузитьКолонку("Номенклатура"));
		ЕстьБлокировкаПоТоварам = Обработки.ПланИнвентаризации.ЕстьблокировкаПоТоварамСклада(Склад,Задание.Товары.Выгрузить(,"Номенклатура").ВыгрузитьКолонку("Номенклатура"),ссылка);
		//++Данилова Е.В. 24.02.2026 HELP-8893
		Если ЕстьБлокировкаПоТоварам
			ИЛИ ДанныеДляРазделения <> неопределено Тогда
			//--Данилова Е.В. 24.02.2026 
			// Кельманов А.В. - HELP-8841 + HELP-8891 - 2026.02.19 {
			//Данилова Е.В. 25.02.2026 HELP-8893  
			СтрокаПН.ВыводитьНаПечать = Ложь;
			СтрокиНомерЧасти = тБрэндов.НайтиСтроки(Новый Структура("НомерЧасти", Сч));
			
			Для Каждого СтрНомерЧасти Из СтрокиНомерЧасти Цикл 
				СтрНомерЧасти.ВыводитьНаПечать = Ложь; 	              
			КонецЦикла;
			// Кельманов А.В. - HELP-8841 + HELP-8891 - 2026.02.19 }
		
		КонецЕсли;
		//--Данилова Е.В. 03.02.2026
		если не СтрокаПН.ВыводитьНаПечать тогда
			Задание.СостояниеНакладной	= Перечисления.СостоянияНакладной.СформированыЗаданияНабора;		 
		КонецЕсли;
		Задание.Сектор=СтрокаПН.Наборщик.Сектор;
		// Кухарь А.Ю. 17.03.2025 начало
		// ASU-2105
		Задание.НеконтролироватьСканированиеЧЗ=НеконтролироватьСканированиеЧЗ; 
		МенялосьНеконтролироватьСканированиеЧЗ=ложь;
		// Кухарь А.Ю. 17.03.2025 конец
		
		//++Данилова Е.В. 25.02.2026 HELP-8893 
		Если ДанныеДляРазделения <> неопределено Тогда
			
			Задание.ДополнительныеСвойства.Вставить("РазделениеЗНБ",истина); 	
			
		КонецЕсли;
		//--Данилова Е.В. 25.02.2026 
		Задание.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из тБрэндов Цикл 
		//++Данилова Е.В. 24.02.2026 
		Если ДанныеДляРазделения <> неопределено Тогда 
			Если ЧастиДляРазделения.Найти(СтрокаТЧ.НомерЧасти) <> неопределено Тогда
				СтрокаТЧ.Состояние = Перечисления.СостоянияНакладной.СформированыЗаданияНабора;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		//--Данилова Е.В. 24.02.2026 
		если СтрокаТЧ.ВыводитьНаПечать тогда
			СтрокаТЧ.Состояние=Перечисления.СостоянияНакладной.ОжиданиеНабора;
		иначе
			// Кельманов А.В. - HELP-8841 + HELP-8891 - 2026.02.19 {
			//если СтрокаТЧ.Состояние<>Перечисления.СостоянияНакладной.ОжиданиеНабора тогда  //Строчки у которых состояние уже изменили
			//	СтрокаТЧ.Состояние=Перечисления.СостоянияНакладной.СформированыЗаданияНабора;				 
			//КонецЕсли;
			СтрокаТЧ.Состояние = Перечисления.СостоянияНакладной.СформированыЗаданияНабора;				 
			// Кельманов А.В. - HELP-8841 + HELP-8891 - 2026.02.19 }
		КонецЕсли;
		
	КонецЦикла; 
	
	Записать();
	
	Если ПолучитьРеквизитШапки(Накладная,"СостояниеНакладной")=Перечисления.СостоянияНакладной.СформированыЗаданияНабора Тогда		
		если тБрэндов.НайтиСтроки(новый Структура("Состояние",Перечисления.СостоянияНакладной.СформированыЗаданияНабора)).Количество()=0 тогда
			УстановитьРеквизитыОбъекта(Накладная,Новый Структура("СостояниеНакладной",Перечисления.СостоянияНакладной.ОжиданиеНабора));
		КонецЕсли; 
	КонецЕсли;	
	
	// Кельманов А.В. - ASU-2094 - 2025.03.13 {
	//++Данилова Е.В. 25.02.2026 HELP-8893 при разделении вынесено в модуль обработки
	Если НужноСоздаватьЗНМ_И_ЛМ_ПоЗНБ 
		И ДанныеДляРазделения  = неопределено Тогда   
	//--Данилова Е.В. 25.02.2026 
		//++Данилова Е.В. 24.02.2026 HELP-8893 
		//СоздатьЗНМ_И_ЛМ_ПоЗНБ();
		СоздатьЗНМ_И_ЛМ_ПоЗНБ_Набора();
		//--Данилова Е.В. 24.02.2026 
	КонецЕсли;
	// Кельманов А.В. - ASU-2094 - 2025.03.13 }
	
	// Кельманов А.В. - HELP-4794 - 2025.09.09 {
	//// Кухарь А.Ю.  25.03.2025 начало
	//если ВидНакладной = "РасходнаяНакладная" тогда
	//	запрос=новый запрос;
	//	запрос.Текст="ВЫБРАТЬ первые 1
	//	|	ПолныеДанныеЗаданияНабора.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Документ.ПолныеДанныеЗаданияНабора КАК ПолныеДанныеЗаданияНабора
	//	|ГДЕ
	//	|	ПолныеДанныеЗаданияНабора.Накладная = &Накладная
	//	|	И ПолныеДанныеЗаданияНабора.Проведен";
	//	запрос.УстановитьПараметр("Накладная",Накладная);
	//	выборка = запрос.Выполнить().Выбрать();
	//	пока Выборка.Следующий() цикл
	//	ДействияФормыПодготовитьКРаботеНаТСД(Неопределено); 
	//	КонецЦикла;
	//КонецЕсли;
	//// Кухарь А.Ю.  25.03.2025 конец
	// Кельманов А.В. - HELP-4794 - 2025.09.09 }
    //++Данилова Е.В. 24.02.2026 HELP-8893 
	Возврат Истина; 
	//--Данилова Е.В. 24.02.2026 
КонецФункции // ()

Функция ПроверитьСектораНаборщиковПоНабору(ДопПараметрыНакладной)
	ТЗНаборщиков=тБрэндов.Выгрузить(,"Наборщик");
	ТЗНаборщиков.Свернуть("Наборщик");
	// Кухарь А.Ю. 24.11.2021 начало
	// Для озона
	ТЗНаборщиков.Колонки.Добавить("Сектор");
	// Кухарь А.Ю. 24.11.2021 конец
	
	МожноСоздавать=Истина;
	для каждого СтрТЗ из ТЗНаборщиков цикл
		если не ЗначениеЗаполнено(СтрТЗ.Наборщик.сектор) тогда
			МожноСоздавать=ложь;
			Сообщить("Заполните сектор у наборщика "+СтрТЗ.Наборщик);
			// Кухарь А.Ю. 24.11.2021 начало
			Продолжить;; 
			// Кухарь А.Ю. 24.11.2021 конец			
		КонецЕсли;
		
		// Кухарь А.Ю. 24.11.2021 начало
		// По озону сборные ЗНБ нельзя
		
		// Кухарь А.Ю. 11.01.2022 начало
		//+ Аллиэкспресс
		// 		если ДопПараметрыНакладной<>Неопределено и ДопПараметрыНакладной.имя="OZON_FBS" тогда
		если ДопПараметрыНакладной<>Неопределено и (ДопПараметрыНакладной.имя="OZON_FBS" 
			или ДопПараметрыНакладной.имя="AlIEXPRESS_FBS"
			// Кухарь А.Ю. 23.03.2022 начало
			или ДопПараметрыНакладной.имя="YANDEX_FBS"		 
			// Кухарь А.Ю. 23.03.2022 конец	
			// Ихсанов Д. А. Начало 02.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-1102
			Или ДопПараметрыНакладной.Имя = "MAGNIT_FBS"
			// Ихсанов Д. А. Конец  02.06.2025
			
			// Кухарь А.Ю.  28.06.2022 начало
			// + сбер
			или ДопПараметрыНакладной.имя="SBRF_FBS"	 
			// Кухарь А.Ю.  28.06.2022 конец
			
			) тогда	 
			// Кухарь А.Ю. 11.01.2022 конец
			
			
			//Запреты:
			//Пустой сектор наборщика, сборный сектор наборщика, несколько наборщиков с 1 сектором.
			Сектор=СтрТЗ.Наборщик.сектор;
			СтрТЗ.Сектор=Сектор;
			
			если Сектор.Сборный тогда
				МожноСоздавать=ложь;
				Сообщить("У наборщика "+СтрТЗ.Наборщик+" сборный сектор. В данной накладной сборные сектора запрещены.");
				Продолжить;
			КонецЕсли;
			
			
			МассСтрок=ТЗНаборщиков.НайтиСтроки(новый Структура("Сектор",Сектор));
			если МассСтрок.Количество()>1 тогда
				Сотрудники="";
				Для каждого СтрМасс из МассСтрок цикл
					Сотрудники=Сотрудники+СтрМасс.Наборщик+"   ";			 
				КонецЦикла;
				
				Сообщить("Обнаружено несколько наборщиков по 1 сектору "+Сотрудники+" . В данной накладной это запрещено.");
				МожноСоздавать=ложь;
				Продолжить;
				
			КонецЕсли;
		КонецЕсли;		  
		// Кухарь А.Ю. 24.11.2021 конец
		
	КонецЦикла;
	
	
	
	возврат МожноСоздавать;
КонецФункции 

Процедура УдалитьПодчиненныеЗаданияНабора()
	мОтбор	= Новый Структура("ДокументОснование",Ссылка);
	Выборка	= Документы.ЗаданиеНабора.Выбрать(,,мОтбор);
	Пока Выборка.Следующий() Цикл
		Выборка.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);					
	КонецЦикла; 
КонецПроцедуры

Функция НайтиСоздатьЗаданиеНабора(НомерЧасти)
	СтруктураПоиска	= Новый Структура("ДокументОснование,НомерЧасти",Ссылка,НомерЧасти);
	Задание			= НайтиДокумент("ЗаданиеНабора",СтруктураПоиска);
	Если Задание.Пустая() Тогда
		ДокОбъект=Документы.ЗаданиеНабора.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(ДокОбъект,СтруктураПоиска);
	Иначе
		ДокОбъект=Задание.ПолучитьОбъект();
	КонецЕсли;	
	
	Возврат ДокОбъект;
КонецФункции 

Функция ПолучитьТаблицуРасходныхМатериаловСРаспределениемНабора()     
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	РасходнаяНакладнаяКомплектующие.Продукция КАК Продукция,
	|	РасходнаяНакладнаяКомплектующие.Номенклатура КАК Номенклатура,
	|	СУММА(РасходнаяНакладнаяКомплектующие.Количество) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА РасходнаяНакладнаяКомплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоТоваров,
	|	СУММА(ВЫБОР
	|			КОГДА РасходнаяНакладнаяКомплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК КоличествоРасходников,
	|	РасходнаяНакладнаяКомплектующие.Номенклатура.Родитель.ВидНоменклатуры КАК НоменклатураРодительВидНоменклатуры
	|ПОМЕСТИТЬ ТЧКомплектующие
	|ИЗ
	|	Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
	|ГДЕ
	|	РасходнаяНакладнаяКомплектующие.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходнаяНакладнаяКомплектующие.Продукция,
	|	РасходнаяНакладнаяКомплектующие.Номенклатура,
	|	РасходнаяНакладнаяКомплектующие.Номенклатура.Родитель.ВидНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧКомплектующие.Номенклатура КАК Номенклатура,
	|	СУММА(ТЧКомплектующие.Количество) КАК Количество,
	|	ТЧКомплектующие.Продукция КАК Продукция
	|ПОМЕСТИТЬ ТолькоТовар
	|ИЗ
	|	ТЧКомплектующие КАК ТЧКомплектующие
	|ГДЕ
	|	ТЧКомплектующие.НоменклатураРодительВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧКомплектующие.Номенклатура,
	|	ТЧКомплектующие.Продукция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТолькоТовар.Продукция КАК Продукция,
	|	СУММА(ТолькоТовар.Количество) КАК Количество
	|ПОМЕСТИТЬ ТоварыСвернутыеПоПродукции
	|ИЗ
	|	ТолькоТовар КАК ТолькоТовар
	|
	|СГРУППИРОВАТЬ ПО
	|	ТолькоТовар.Продукция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧКомплектующие.Номенклатура КАК Номенклатура,
	|	СУММА(ТЧКомплектующие.Количество) КАК Количество,
	|	ТЧКомплектующие.Продукция КАК Продукция
	|ПОМЕСТИТЬ ТолькоРасходники
	|ИЗ
	|	ТЧКомплектующие КАК ТЧКомплектующие
	|ГДЕ
	|	ТЧКомплектующие.НоменклатураРодительВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧКомплектующие.Номенклатура,
	|	ТЧКомплектующие.Продукция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТолькоТовар.Номенклатура КАК Товар,
	|	СУММА(ТолькоТовар.Количество) КАК КоличествоТовара,
	|	ТолькоТовар.Продукция КАК Продукция,
	|	СУММА(ТолькоРасходники.Количество) КАК КоличествоРасходника,
	|	ТолькоРасходники.Номенклатура КАК Расходник,
	|	ТоварыСвернутыеПоПродукции.Количество КАК КоличествоТовараВСпайке
	|ПОМЕСТИТЬ Сводная
	|ИЗ
	|	ТолькоТовар КАК ТолькоТовар
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТолькоРасходники КАК ТолькоРасходники
	|		ПО ТолькоТовар.Продукция = ТолькоРасходники.Продукция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСвернутыеПоПродукции КАК ТоварыСвернутыеПоПродукции
	|		ПО ТолькоТовар.Продукция = ТоварыСвернутыеПоПродукции.Продукция
	|ГДЕ
	|	НЕ ТолькоРасходники.Номенклатура ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ТолькоТовар.Номенклатура,
	|	ТолькоТовар.Продукция,
	|	ТолькоРасходники.Номенклатура,
	|	ТоварыСвернутыеПоПродукции.Количество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Кельманов А.В. - Проблема 0000000195 - 2026.07.08 {
	//|ВЫБРАТЬ
	//|	Сводная.Товар КАК НормальныйТовар,
	//|	Сводная.Расходник КАК Номенклатура,
	//|	СУММА(Сводная.КоличествоРасходника) / СУММА(Сводная.КоличествоТовараВСпайке) КАК РасходниковНаШтукуТовара,
	//|	Сводная.Расходник.ОсновнаяЕдиница КАК Единица,
	//|	0 КАК Количество,
	//|	СУММА(Сводная.КоличествоРасходника) КАК КоличествоРасходника,
	//|	СУММА(Сводная.КоличествоТовараВСпайке) КАК КоличествоТовараВСпайке,
	//|	СУММА(Сводная.КоличествоТовара) КАК КоличествоТовара
	//|ИЗ
	//|	Сводная КАК Сводная
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Сводная.Товар,
	//|	Сводная.Расходник,
	//|	Сводная.Расходник.ОсновнаяЕдиница
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Сводная.Расходник";
	|ВЫБРАТЬ
	|	Сводная.Товар КАК НормальныйТовар,
	|	Сводная.Расходник КАК Номенклатура,
	|	Сводная.Расходник.ОсновнаяЕдиница КАК Единица,
	// Кельманов А.В. - Проблема 0000000223 - 2026.07.15 {
	//|	СУММА(Сводная.КоличествоРасходника) КАК КоличествоРасходника,
	|	СУММА(Сводная.КоличествоРасходника) * СУММА(Сводная.КоличествоТовара) / СУММА(Сводная.КоличествоТовараВСпайке) КАК КоличествоРасходника,
	// Кельманов А.В. - Проблема 0000000223 - 2026.07.15 }
	|	СУММА(Сводная.КоличествоТовараВСпайке) КАК КоличествоТовараВСпайке,
	|	СУММА(Сводная.КоличествоТовара) КАК КоличествоТовара
	|ПОМЕСТИТЬ ВТ_Общая
	|ИЗ
	|	Сводная КАК Сводная
	|
	|СГРУППИРОВАТЬ ПО
	|	Сводная.Товар,
	|	Сводная.Расходник,
	|	Сводная.Расходник.ОсновнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сводная.Товар КАК НормальныйТовар,
	|	СУММА(Сводная.КоличествоТовара) КАК КоличествоТовараОбщее
	|ПОМЕСТИТЬ ВТ_СуммаТовара
	|ИЗ
	|	Сводная КАК Сводная
	|
	|СГРУППИРОВАТЬ ПО
	|	Сводная.Товар
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Общая.НормальныйТовар КАК НормальныйТовар,
	|	ВТ_Общая.Номенклатура КАК Номенклатура,
	|	ВТ_Общая.Единица КАК Единица,
	|	0 КАК Количество,
	|	ВТ_Общая.КоличествоРасходника КАК КоличествоРасходника,
	|	ВТ_Общая.КоличествоТовараВСпайке КАК КоличествоТовараВСпайке,
	|	ВТ_Общая.КоличествоТовара КАК КоличествоТовара,
	|	ВТ_Общая.КоличествоРасходника / ВТ_СуммаТовара.КоличествоТовараОбщее КАК РасходниковНаШтукуТовара,
	|	ВТ_СуммаТовара.КоличествоТовараОбщее КАК КоличествоТовараОбщее
	|ИЗ
	|	ВТ_Общая КАК ВТ_Общая
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаТовара КАК ВТ_СуммаТовара
	|		ПО ВТ_Общая.НормальныйТовар = ВТ_СуммаТовара.НормальныйТовар
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Общая.Номенклатура";
	// Кельманов А.В. - Проблема 0000000195 - 2026.07.08 }
	
	Запрос.УстановитьПараметр("Ссылка", Накладная);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьТаблицуРасходныхМатериаловСвернутуюНабора()
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	РасходнаяНакладнаяКомплектующие.Номенклатура КАК Номенклатура,
	|	СУММА(РасходнаяНакладнаяКомплектующие.Количество) КАК Количество
	|ИЗ
	|	Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
	|ГДЕ
	|	РасходнаяНакладнаяКомплектующие.Ссылка = &Ссылка
	|	И РасходнаяНакладнаяКомплектующие.Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходнаяНакладнаяКомплектующие.Номенклатура";
	запрос.УстановитьПараметр("Ссылка",Накладная);
	возврат запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура СоздатьЗНМ_И_ЛМ_ПоЗНБ_Набора()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаданиеНабора.Ссылка КАК ЗНБ
	               |ИЗ
	               |	Документ.ЗаданиеНабора КАК ЗаданиеНабора
	               |ГДЕ
	               |	ЗаданиеНабора.ДокументОснование = &ДокументОснование
	               |	И ЗаданиеНабора.Проведен
	               |	И ЗаданиеНабора.ТребуетсяМаркировка
	               |	И ЗаданиеНабора.Дата >= &Дата
	               |	И ЗаданиеНабора.ЗНМ = ЗНАЧЕНИЕ(Документ.ЗаданиеНаМаркировку.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	Запрос.УстановитьПараметр("Дата", Константы.ДатаЗапретаРедактирования.Получить());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Ошибки = Документы.ЗаданиеНабора.СоздатьЗНМ_И_ЛМ(Выборка.ЗНБ, Накладная);
		
		Если ЗначениеЗаполнено(Ошибки) Тогда
			
			Сообщить(Ошибки);
			
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры


//--Данилова Е.В. 24.02.2026 


пВыходнаяФорма="Спецификация";
