
Процедура ПередЗаписью(Отказ, Замещение)
	
	
	КоличествоЗаписей = ЭтотОбъект.Количество();

	Если КоличествоЗаписей > 0 Тогда
		Для Сч = 0 По КоличествоЗаписей -1  Цикл
			Если (ЭтотОбъект[Сч].КоличествоПосетителей =0) Тогда
				СообщитьОбОшибке("Количество посетителей не может быть нулевым!");
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
    	
	УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	
//Кухарь 11.05.18 начало
//логирование изменений по количеству посетителей
	Для Каждого Запись Из ЭтотОбъект Цикл
			ЗаписатьВЛог("Watcom","Изменено количество посетителей. Пользователем: "+СокрЛП(ПараметрыСеанса.Пользователь)+". Количество посетителей: "+Запись.КоличествоПосетителей,"Информация");			
	КонецЦикла;	
 //Кухарь 11.05.18 конец
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	// Вставить содержимое обработчика.
КонецПроцедуры
