#Область ОбработчикиСобытийЭлементовШапкиФормы    

&НаКлиенте
Процедура ВидНачисленияПриИзменении(Элемент)    
	
	ВидНачисленияПриИзмененииНаСервере();   
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы    

&НаКлиенте
Процедура РассчитатьВсе(Команда) 
	
	РассчитатьВсеНаСервере();    
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции     

&НаСервере
Процедура ВидНачисленияПриИзмененииНаСервере()  
	
	Если ЗначениеЗаполнено(объект.ВидНачисления) Тогда
		ТекОбъект = РеквизитФормыВЗначение("Объект");
		ТекОбъект.ЗаполнитьКритерииПоНаправлению();
		ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьВсеНаСервере() 
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.РассчитатьВсеДанные();
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");  
	
КонецПроцедуры

#КонецОбласти
