Перем ПараметрыЗагрузки;

Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,Записывать=Ложь)
	Для Каждого НаборДвижений Из ДвиженияПоРегистрам Цикл
		ИмяРегистра		=НаборДвижений.Ключ;
		ТаблицаДвижения =НаборДвижений.Значение;
		
		Если Движения.Найти(ИмяРегистра)=Неопределено Тогда Возврат  КонецЕсли; 
		
		НаборЗаписей=Движения[ИмяРегистра];		
		НаборЗаписей.Очистить();
		
		Для Каждого Движение Из ТаблицаДвижения Цикл
			Запись=НаборЗаписей.Добавить();	
			ЗаполнитьЗначенияСвойств(Запись,Движение);	
			
			Запись.Регистратор=Ссылка;
		КонецЦикла;	
		
		Если Записывать Тогда
			НаборЗаписей.Записать();		
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры 

Функция ПолучитьОстаткиДляПереоценки()
	Запрос=Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=Новый МенеджерВременныхТаблиц;
	Запрос.Текст="
	|ВЫБРАТЬ	
	|	Номенклатура,
	|	Цена КАК Цена
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	&Данные КАК Данные";
	Запрос.УстановитьПараметр("Данные",Товары);
	Запрос.Выполнить();
	
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Номенклатура,
	|	СУММА(1) КАК КоличествоЦен,	
	|	СУММА(Цена) КАК Цена
	|ПОМЕСТИТЬ 
	|	Цены	
	|ИЗ
	|	Данные
	|СГРУППИРОВАТЬ ПО Номенклатура";
	Запрос.Выполнить();
	
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Склад,
	|   Остатки.Номенклатура.Родитель КАК Модель,
	|	Остатки.Номенклатура	КАК Номенклатура,
	|	КоличествоОстаток 		КАК Остаток,
	|	СуммаОстаток 			КАК СтоимостьСтарая,
	|	IsNULL(КоличествоЦен,0) КАК КоличествоЦен,
	|	IsNULL(Цена,0) 			КАК Цена
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(&Дата1,"+?(Включать_Исключать_Склады="В"," ","НЕ ")+"Склад В (&Склады)"+?(ПереоценкаКДолларам,""," И Номенклатура В ИЕРАРХИИ (&Номенклатура)")+") КАК Остатки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Цены
	|ПО 
	|	Остатки.Номенклатура.Родитель = Цены.Номенклатура
	|ГДЕ 
	|	КоличествоОстаток<>0";
	
	Запрос.УстановитьПараметр("Дата1",МоментВремени());
	Запрос.УстановитьПараметр("Склады",			Склады.ВыгрузитьКолонку("Склад"));
	Запрос.УстановитьПараметр("Номенклатура",	Товары.ВыгрузитьКолонку("Номенклатура"));
	
	ТО=Запрос.Выполнить().Выгрузить();
	ТО.Колонки.Добавить("СтоимостьНовая",ПолучитьОписаниеТиповЧисла(19,2));
	
	Возврат ТО;	
КонецФункции //

// Шворобей ВЮ 03.12.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1211
Процедура УстановитьБрэндТипТовара(СтрокаТЧ) Экспорт
	
	Номенклатура = СтрокаТЧ.Номенклатура;
	Если Номенклатура.Пустая() Тогда Возврат КонецЕсли; 
	
	Уровень = Номенклатура.Уровень();
	Если Уровень = 0 Тогда //ТипТовара
		СтрокаТЧ.ТипТовара	= Номенклатура;
		СтрокаТЧ.Брэнд	= Неопределено;
	ИначеЕсли Уровень = 1 Тогда //Брэнд
		СтрокаТЧ.ТипТовара	= Номенклатура.Родитель;
		СтрокаТЧ.Брэнд	= Номенклатура;
	ИначеЕсли Уровень = 2 Тогда //Модель		
		СтрокаТЧ.ТипТовара	= Номенклатура.Родитель.Родитель;
		СтрокаТЧ.Брэнд	= Номенклатура.Родитель;		
	ИначеЕсли Уровень = 3 Тогда //Позиция
		СтрокаТЧ.ТипТовара	= Номенклатура.Родитель.Родитель.Родитель;
		СтрокаТЧ.Брэнд	= Номенклатура.Родитель.Родитель;
	ИначеЕсли Уровень = 4 Тогда
		СтрокаТЧ.ТипТовара	= Номенклатура.Родитель.Родитель.Родитель.Родитель;
		СтрокаТЧ.Брэнд	= Номенклатура.Родитель.Родитель.Родитель;
	ИначеЕсли Уровень = 5 Тогда
		СтрокаТЧ.ТипТовара	= Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель;
		СтрокаТЧ.Брэнд	= Номенклатура.Родитель.Родитель.Родитель.Родитель;
	Иначе //ХЗ
		СтрокаТЧ.ТипТовара	= Неопределено;
		СтрокаТЧ.Брэнд	= Неопределено;
	КонецЕсли;
	
КонецПроцедуры
// Шворобей ВЮ 03.12.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1211

//СОБЫТИЯ ОБЪЕКТА
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения	=Модифицированность();	
	
	КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
	МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
	МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
	Если Отказ Тогда Возврат КонецЕсли;
	
	Если ЕстьИзменения Тогда
		ГруппыТоваров   	= ГруппыТоваровДокумента(ЭтотОбъект);
	КонецЕсли;	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	СостояниеНакладной	=Неопределено;
	Автор				=Неопределено;
	
	ДатаВыгрузки		=Неопределено;
КонецПроцедуры

// Шворобей ВЮ 03.12.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1211
Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	
	Если Основание = Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;
	
	ВидОснования	= Основание.Метаданные().Имя;		
	ДокОснование	= Основание;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание);
	
	///////////////////////////////////////////////////////////////////////////////////
	// Требуется возможность ввода ПРЦ на основании ПНК, заполняться номенклатурой
	// с видом номенклатуры, отличным от "товар", и суммой из ПНК по такой номенклатуре.
	///////////////////////////////////////////////////////////////////////////////////
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Количество КАК Количество,
	|	Товары.Цена КАК Цена,
	|	Товары.Сумма КАК Сумма,
	|	Товары.Всего КАК Всего,
	|	Товары.Цена КАК ЦенаСтарая,
	|	Товары.Сумма КАК СтоимостьСтарая
	|ИЗ
	|	Документ." + ВидОснования + ".Товары КАК Товары
	|ГДЕ
	|	(Товары.Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|	И Товары.Номенклатура.Родитель.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар))
	|	И Товары.Ссылка = &Основание
	|";
	
	//|	Документ." + ВидОснования + ".Товары КАК Товары";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Товары.Очистить();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		УстановитьБрэндТипТовара(НоваяСтрока);
	КонецЦикла;
	
КонецПроцедуры
// Шворобей ВЮ 03.12.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1211

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	ТО=ПолучитьОстаткиДляПереоценки();
	//крохин начало 15.05.2018
		//контроль остатков.
		Если ТО.количество() = 0 Тогда
			
		#Если Клиент Тогда
				Сообщить("ПРЦ: " +ЭтотОбъект.Номер + ". Нулевое количество переоцениваемого товара на остатках! Проведение документа невозможно!");
			Если Не(ПолучитьПолномочиеПользователя("СписыватьВМинус")) Тогда
               	Возврат;		   
			КонецЕсли;
		#КонецЕсли	
		КонецЕсли;
	//крохин конец 15.05.2018	
		//
	ВалютаУпр		=?(Дата>='20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);	
	КурсПереоценки	=ПолучитьКурсВалюты_ПоРусски(ПараметрыСеанса.ВалютаУпр_2009,Дата);
	
	Если ПереоценкаКДолларам Тогда
		Для Каждого СтрокаТЧ Из ТО Цикл
			СтрокаТЧ.СтоимостьНовая=СтрокаТЧ.СтоимостьСтарая/КурсПереоценки;
		КонецЦикла;		
	ИначеЕсли ВидПереоценки="Сумма" Тогда
		СтоимостьНач=ТО.Итог("СтоимостьСтарая");
		//крохин начало 21.06.2011
		//случай нулевой стоимости
		КоличествоНач = ТО.Итог("Остаток");
		//крохин конец 21.06.2011
		
		СуммаКРаспределению=Окр(глПересчет(СуммаДокумента,Валюта,Курс,ВалютаУпр,Дата),2,1);	
		МаксСумма=0;
		МаксСтрока=Неопределено;
		
		Для Каждого СтрокаТЧ Из ТО Цикл
			Если СтрокаТЧ.СтоимостьСтарая>МаксСумма Тогда
				МаксСумма	=СтрокаТЧ.СтоимостьСтарая;		
				МаксСтрока	=СтрокаТЧ;
			КонецЕсли;
			//крохин начало 03.05.2011
			//деление на 0
			//СтрокаТЧ.СтоимостьНовая=СтрокаТЧ.СтоимостьСтарая+СуммаКРаспределению*СтрокаТЧ.СтоимостьСтарая/СтоимостьНач;
			СтрокаТЧ.СтоимостьНовая=СтрокаТЧ.СтоимостьСтарая+?(СтоимостьНач =0,0,СуммаКРаспределению*СтрокаТЧ.СтоимостьСтарая/СтоимостьНач);
			//крохин конец 03.05.2011
			//крохин начало 21.06.2011
			//случай нулевой стоимости всего товара
			Если Дата >= '20110701' И СтоимостьНач = 0 Тогда
			СтрокаТЧ.СтоимостьНовая=СтрокаТЧ.СтоимостьСтарая+?(КоличествоНач =0,0,СуммаКРаспределению*СтрокаТЧ.Остаток/КоличествоНач);	
			КонецЕсли;
			//крохин конец 21.06.2011
			
		КонецЦикла; 
		
		Дельта=СтоимостьНач+СуммаКРаспределению-ТО.Итог("СтоимостьНовая");
		Если Дельта<>0 Тогда
			Если МаксСтрока<>Неопределено Тогда
				МаксСтрока.СтоимостьНовая=МаксСтрока.СтоимостьНовая+Дельта;		
			КонецЕсли; 					
		КонецЕсли;	
	ИначеЕсли ВидПереоценки="Цены" Тогда
		ВалютаУпр	=?(Дата>='20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);
		Курс		=глПересчет(1,Валюта,Дата,ВалютаУпр,Дата,Ложь);
		
		Для Каждого СтрокаТЧ Из ТО Цикл
			Если СтрокаТЧ.КоличествоЦен<>0 Тогда
				СтрокаТЧ.СтоимостьНовая=Курс*СтрокаТЧ.Остаток*(СтрокаТЧ.Цена/СтрокаТЧ.КоличествоЦен);
			Иначе
				СтрокаТЧ.СтоимостьНовая=0;			
			КонецЕсли;		
		КонецЦикла;				
		СуммаДокумента=ТО.Итог("СтоимостьНовая")-ТО.Итог("СтоимостьСтарая");
		СуммаДокумента=глПересчет(СуммаДокумента,ПараметрыСеанса.ВалютаНац,Дата,Валюта,Курс);		
	КонецЕсли;	
	
	Для Каждого СтрокаТЧ Из ТО Цикл		
		Отклонение=СтрокаТЧ.СтоимостьНовая-СтрокаТЧ.СтоимостьСтарая;
		Если Отклонение=0 Тогда Продолжить КонецЕсли; 
		
		Движение=Движения.ОстаткиТМЦ.Добавить();	
		
		Движение.Период			= Дата;
		Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;	
		
		Движение.Количество		= СтрокаТЧ.Остаток;
		
		Движение.Склад			= СтрокаТЧ.Склад;
		Движение.Номенклатура   = СтрокаТЧ.Номенклатура;
		
		Движение.Сумма			= СтрокаТЧ.СтоимостьСтарая;
		
		Движение.КодОперации	= Перечисления.КодыОперацийОстатки.Переоценка;
		Движение.Отправитель	= СтрокаТЧ.Склад;
		
		
		Движение=Движения.ОстаткиТМЦ.Добавить();	
		
		Движение.Период			= Дата;
		Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;	
		
		Движение.Количество		= СтрокаТЧ.Остаток;
		
		Движение.Склад			= СтрокаТЧ.Склад;
		Движение.Номенклатура   = СтрокаТЧ.Номенклатура;
		
		Движение.Сумма			= СтрокаТЧ.СтоимостьНовая;
		
		Движение.КодОперации	= Перечисления.КодыОперацийОстатки.Переоценка;
		Движение.Отправитель	= СтрокаТЧ.Склад;
	КонецЦикла;
	
	
	ТО.Свернуть("Модель","Остаток,СтоимостьСтарая,СтоимостьНовая");
	Для Каждого СтрокаТО Из ТО Цикл
		СтрокаТЧ=Товары.Найти(СтрокаТО.Модель,"Номенклатура");
		Если СтрокаТЧ<>Неопределено Тогда
			СтрокаТЧ.Количество=СтрокаТО.Остаток;			
			СтрокаТЧ.ЦенаСтарая		=?(СтрокаТО.Остаток<>0,СтрокаТО.СтоимостьСтарая/СтрокаТО.Остаток,0);
			СтрокаТЧ.СтоимостьСтарая=СтрокаТО.СтоимостьСтарая;
			СтрокаТЧ.Всего			=СтрокаТО.СтоимостьНовая;
		КонецЕсли;	
	КонецЦикла; 
	Записать();
	
	Доллары				=Справочники.Валюты.НайтиПоКоду("840");
	Рубли				=Справочники.Валюты.НайтиПоКоду("810");
	Евро				=Справочники.Валюты.НайтиПоКоду("978");
	
	СуммаРуб=глПересчет(СуммаДокумента,Валюта,Курс,Рубли,Дата);
	СуммаUSD=глПересчет(СуммаДокумента,Валюта,Курс,Доллары,Дата);	
	СуммаEUR=глПересчет(СуммаДокумента,Валюта,Курс,Евро,Дата); 	
	
	//ЗАТРАТЫ
	Движение=Движения.Затраты.Добавить();
	
	Движение.Период		=Дата;
	Движение.ВидДвижения=?(СуммаДокумента>0,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);
	Движение.Подразделение=Подразделение;
	Движение.СтатьяЗатрат=СтатьяЗатрат;
	//крохин начало
	Движение.СубЗатрата = СубЗатрата;
	//крохин конец
	Движение.СуммаУпр		=Модуль(СуммаРуб);		
	Движение.СуммаДокумента	=СуммаДокумента;
	Движение.ВалютаДокумента=Валюта;
	
	//крохин начало
	Движение.Комментарий        = Комментарий;
	//крохин конец
	
	//крохин начало 26.09.2013
	//проект
	Движение.Проект = Проект;
	//крохин конец 26.09.2013

	
	Если ТО.Итог("Остаток")<>КоличествоДокумента Тогда
		КоличествоДокумента=ТО.Итог("Остаток");	
		Записать();
	КонецЕсли;
	//крохин начало 13.04.2011
	//запишем ЦПП

	ЗаписиЦПП=РегистрыСведений.История.СоздатьНаборЗаписей();
	ЗаписиЦПП.Отбор.Документ.Использование	=Истина;
	ЗаписиЦПП.Отбор.Документ.Значение		=Ссылка;
	
	ЗаписиЦПП.Отбор.Реквизит.Использование	=Истина;
	ЗаписиЦПП.Отбор.Реквизит.Значение		="ЦенаПоследнегоПрихода";
	
	
	

	Для Каждого СтрокаТоваров Из Товары Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В ИЕРАРХИИ(&Номенклатура)
		|	И НЕ Номенклатура.ЭтоГруппа";
		Запрос.УстановитьПараметр("Номенклатура",СтрокаТоваров.Номенклатура);
		ТаблицаНоменклатуры = Новый ТаблицаЗначений;
		ТаблицаНоменклатуры = Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаТаблицыНоменклатуры ИЗ ТаблицаНоменклатуры Цикл
			
			ЗаписьЦПП=ЗаписиЦПП.Добавить();
			ЗаписьЦПП.Период	=Дата;
			ЗаписьЦПП.Реквизит	="ЦенаПоследнегоПрихода";
			ЗаписьЦПП.Объект	=СтрокаТаблицыНоменклатуры.Номенклатура;
			ЗаписьЦПП.Документ	=Ссылка;
			ЗаписьЦПП.Значение	=СтрокаТоваров.Цена;		
		КонецЦикла;
		
	КонецЦикла;
	ЗаписиЦПП.Записать();
	//крохин конец  13.04.2011
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры
