Перем  Рубли,Доллары;
//Катаев+ 06/10/14
Перем НужноВыгружать;
//Катаев- 06/10/14

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	Доллары				=Справочники.Валюты.НайтиПоКоду("840");
	Рубли				=Справочники.Валюты.НайтиПоКоду("810");
	Евро				=Справочники.Валюты.НайтиПоКоду("978");
	
	ВалютаУпр			=?(Дата>='20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);
	КурсУпр				=ПолучитьКурсВалюты_ПоРусски(ВалютаУпр,Дата);
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	//На регистре
	//СуммаВАЛ - сумма в валюте расчетов
	//СуммаУПР - сумма в упр валюте
	
	Для Каждого СтрокаТЧ Из Расчеты Цикл
		ВалютаРасчетов=ПолучитьВалютуРасчетов(СтрокаТЧ.Договор);		
						
		СуммаВал					= глПересчет(СтрокаТЧ.Сумма,СтрокаТЧ.Валюта,СтрокаТЧ.Курс,ВалютаРасчетов,Дата);		
		СуммаУпр					= глПересчет(СтрокаТЧ.Сумма,СтрокаТЧ.Валюта,Дата,ВалютаУпр,КурсУпр);		
		
		//Взаиморасчеты
		Движение 					= Движения.Взаиморасчеты.Добавить();
		
		Движение.ВидДвижения		= ?(СуммаВАЛ>0,ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход);		
		
		Движение.Период				= Дата;
		Движение.Контрагент			= СтрокаТЧ.Контрагент;
		Движение.Договор 			= СтрокаТЧ.Договор;			
		
		Движение.СуммаВал			= Модуль(СуммаВАЛ);
		Движение.СуммаУпр			= Модуль(СуммаУпр);
		
		Движение.СуммаДокумента		= СтрокаТЧ.Сумма;
		Движение.ВалютаДокумента	= СтрокаТЧ.Валюта;	
		
		//ЗАТРАТЫ
		Движение 					= Движения.Затраты.Добавить();		
		
		Движение.ВидДвижения		= ?(СуммаВАЛ>0,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);				
		
		Движение.Период				= Дата;
		Движение.Подразделение		= СтрокаТЧ.Подразделение;
		Движение.СтатьяЗатрат		= СтрокаТЧ.СтатьяЗатрат;
		//++Данилова Е.В. 24.04.2026 HELP-9467 
		Если Дата >= Дата(2026,04,01) Тогда
			Движение.КаналСбыта 		= СтрокаТЧ.КаналСбыта; 
		КонецЕсли;
		//--Данилова Е.В. 24.04.2026 
		Движение.СубЗатрата			= СтрокаТЧ.СубЗатрата;
		
		Движение.СуммаУпр			= Модуль(СуммаУпр);		
		
		Движение.Контрагент			= СтрокаТЧ.Контрагент;
		Движение.Договор			= СтрокаТЧ.Договор;
		
		Движение.СуммаДокумента		= Модуль(СтрокаТЧ.Сумма);
		Движение.ВалютаДокумента	= СтрокаТЧ.Валюта;	
		
		
		Движение.КапитальныеЗатраты	= СтрокаТЧ.КапитальныеЗатраты;
		Движение.Проект				= СтрокаТЧ.Проект;
		Движение.ПериодРасходов		= ?(ЗначениеЗаполнено(СтрокаТЧ.ПериодРасходов),НачалоМесяца(СтрокаТЧ.ПериодРасходов),НачалоМесяца(Дата));
		
	    //крохин начало
		Движение.Комментарий        = Комментарий;
		//крохин конец

		
		Движение.ДатаЗаписи			= ТекущаяДата();		
	КонецЦикла; 
	
	Если ОбменДанными.Загрузка Тогда
		Движения.Взаиморасчеты.Записать();	
	КонецЕсли; 
КонецПроцедуры

//СОБЫТИЯ ОБЪЕКТА
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения		=Модифицированность();
	НужноВыгружать		=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	
	Если НЕ ОбменДанными.Загрузка Тогда		
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		
		Если Отказ Тогда Возврат КонецЕсли; 		
	КонецЕсли;	
	
	Если Отказ Тогда Возврат КонецЕсли;	
	
	Если ЕстьИзменения Тогда
		СуммаДокумента=Расчеты.Итог("Сумма");		
	КонецЕсли;
	
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
		//Катаев+ 08/10/14
		Если Не ЭтотОбъект.Ссылка.Пустая() Тогда
			НужноВыгружать = Ложь;
		КонецЕсли;
		//Катаев- 08/10/14
	КонецЕсли;	
КонецПроцедуры

//крохин начало 24.05.2012
Процедура ПриКопировании(ОбъектКопирования)
	Если ДокОснование = Неопределено Тогда
	Возврат;	
КонецЕсли;
//крохин начало 03.08.2018
//во избежание конфигураторных ошибок
	МетаданныеДокумента = ДокОснование.Метаданные();	
	Если НЕ ЕстьРеквизитДокумента("ДатаОплаты",МетаданныеДокумента) Тогда 
		Возврат; 
	КонецЕсли; 
	//крохин конец 03.08.2018
ДатаОплаты = ДокОснование.ДатаОплаты;
КонецПроцедуры


//крохин конец 24.05.2012

Процедура ОбработкаЗаполнения(Основание)
	//крохин начало 10.07.2019
	Если ТипЗнч(Основание)=Тип("Структура") ИЛИ Основание = Неопределено Тогда Возврат КонецЕсли;
	//крохин конец 10.07.2019
	
	Если Основание.Метаданные().Имя = "Претензия" Тогда
		ВидОплаты = Перечисления.ВидыОплаты.БН;
		ДокОснование = Основание;
		Комментарий = "ПРТ "+ДокОснование.Номер + " от " + Формат(ДокОснование.Дата,"ДЛФ=DD")+ ". "+ДокОснование.Комментарий;
		СтрокаТЧ = Расчеты.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,ДокОснование);
		//крохин начало 27.06.2012
		СтрокаТЧ.Контрагент = ?(ДокОснование.контрагент.ведущий.пустая(),ДокОснование.контрагент,ДокОснование.контрагент.ведущий);
		//крохин конец 27.06.2012
		СтрокаТЧ.СтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоКоду("223 230"); //Недостача ТМЦ по заказу клиента
		Если НЕ ДокОснование.ПризнакВозврата Тогда
			СтрокаТЧ.Сумма = ДокОснование.СуммаДокумента;
		Иначе
			СтрокаТЧ.Сумма = -ДокОснование.СуммаДокумента;
		КонецЕсли;
		СтрокаТЧ.ПериодРасходов = ДокОснование.ДокОснование.Дата;
		
		// +++ spk, 2013-01-31, "Подотчет на карты"
	ИначеЕсли Основание.Метаданные().Имя = "ЗаявкаНаОплату" Тогда
		
		Если Основание.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеПодотчетномуЛицу Тогда			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Ссылка", Основание);
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаявкаНаОплату.Организация,
			|	ЗаявкаНаОплату.Валюта,
			|	ЗаявкаНаОплату.Курс,
			|	ЗаявкаНаОплату.Подразделение,
			|	ЗаявкаНаОплату.СтатьяЗатрат,
			|	ЗаявкаНаОплату.СубЗатрата,
			|	ЗаявкаНаОплату.КапитальныеЗатраты,
			|	ЗаявкаНаОплату.Проект,
			|	ЗаявкаНаОплату.ПериодРасходов
			|ИЗ
			|	Документ.ЗаявкаНаОплату КАК ЗаявкаНаОплату
			|ГДЕ
			|	ЗаявкаНаОплату.Ссылка = &Ссылка";
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда
				Шапка = РезультатЗапроса.Выбрать();
				Шапка.Следующий();
			Иначе
				Шапка = Новый Структура("Организация", Справочники.Организации.ПустаяСсылка());
			КонецЕсли; 
			
			// заполняем шапку документа
			Организация		= Шапка.Организация;
			ДокОснование	= Основание;
			ВидОплаты		= Перечисления.ВидыОплаты.БН;
			
			ТаблицаДоговоров	= Неопределено;
			ВидДоговораПодОтчет	= Справочники.ВидыДоговоров.НайтиПоНаименованию("Под отчёт", Истина);
			Если ЗначениеЗаполнено(ВидДоговораПодОтчет) Тогда
				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("Ссылка"		, Основание);
				Запрос.УстановитьПараметр("ВидДоговора"	, ВидДоговораПодОтчет);
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЗаявкаНаОплатуПодотчет.Сотрудник,
				|	МАКСИМУМ(Договоры.Ссылка) КАК Договор
				|ИЗ
				|	Справочник.Договоры КАК Договоры
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаОплату.Подотчет КАК ЗаявкаНаОплатуПодотчет
				|		ПО Договоры.Владелец = ЗаявкаНаОплатуПодотчет.Сотрудник
				|			И (ЗаявкаНаОплатуПодотчет.Ссылка = &Ссылка)
				|			И (Договоры.ВидДоговора_Новый = &ВидДоговора)
				|			И ((НЕ Договоры.ПометкаУдаления))
				|
				|СГРУППИРОВАТЬ ПО
				|	ЗаявкаНаОплатуПодотчет.Сотрудник";
				ТаблицаДоговоров = Запрос.Выполнить().Выгрузить();
				ТаблицаДоговоров.Индексы.Добавить("Сотрудник");
			КонецЕсли; 
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Ссылка", Основание);
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаявкаНаОплатуПодотчет.Сотрудник,
			|	ЗаявкаНаОплатуПодотчет.Сумма
			|ИЗ
			|	Документ.ЗаявкаНаОплату.Подотчет КАК ЗаявкаНаОплатуПодотчет
			|ГДЕ
			|	ЗаявкаНаОплатуПодотчет.Ссылка = &Ссылка";
			Выборка = Запрос.Выполнить().Выбрать();
			// заполняем таб.часть Расчеты
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = Расчеты.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Шапка);
				НоваяСтрока.Контрагент	= Выборка.Сотрудник;
				НоваяСтрока.Сумма		= Выборка.Сумма;
				Если ТаблицаДоговоров <> Неопределено Тогда
					СтрокаТабДог = ТаблицаДоговоров.Найти(Выборка.Сотрудник, "Сотрудник");
					Если СтрокаТабДог <> Неопределено Тогда
						НоваяСтрока.Договор = СтрокаТабДог.Договор;
					КонецЕсли; 
				КонецЕсли;
				//Валетов + 15,04,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-9445
				Если НоваяСтрока.Проект.ПометкаУдаления Тогда
					НоваяСтрока.Проект ="";
				КонецЕсли;
				//валетов -
			КонецЦикла;
			
			СуммаДокумента = Расчеты.Итог("Сумма");
			
		КонецЕсли; 
		// "Подотчет на карты", 2013-01-31, spk +++
	КонецЕсли;
	
КонецПроцедуры

//Катаев+ 08/10/14
Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если НужноВыгружать Тогда
		ЗанестиФилиалыВРегистрПолучателей(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры
//Катаев- 08/10/14