
Процедура ПередЗаписью(Отказ, Замещение)
	//Если ЗначениеЗаполнено(ЭтотОбъект) Тогда
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	СкладТСД.Ссылка КАК Узел,
	//	|	СкладТСД.ТСД КАК ТСД
	//	|ИЗ
	//	|	ПланОбмена.СкладТСД КАК СкладТСД
	//	|ГДЕ
	//	|	НЕ СкладТСД.ТСД = ЗНАЧЕНИЕ(Справочник.Оборудование.ПустаяСсылка)";
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//	
	//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//		Если ЗначениеЗаполнено(ЭтотОбъект) Тогда
	//			ПланыОбмена.ЗарегистрироватьИзменения(ВыборкаДетальныеЗаписи.Узел, ЭтотОбъект);
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
КонецПроцедуры
