
// Процедура - Выполнить контроль запроса
//
// Параметры:
//  АдресЗапроса - Строка	 - Базовый адрес запроса к сервису
//
Функция ВыполнитьКонтрольЗапроса(АдресЗапроса) Экспорт
	
	Возврат Неопределено;
	
	//МиллисекундВСекунде			   = 1000;
	//КоличествоЗапросовВМинуту	   = 0;
	//ВремяНачалаМинуты			   = Неопределено;
	//ВремяКонецМинуты			   = Неопределено;
	//ИсполненоЗапросов			   = 0;
	//ДатаЗапросаВМиллисекундах	   = 0;
	//ИнтервалЗапросовВМиллисекундах = 0;
	//
	//НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	//
	//БлокировкаДанных = Новый БлокировкаДанных;
	//ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.МП_ЯМ_КонтрольОграниченийПоРаботеССервисами");
	//ЭлементБлокировкиДанных.УстановитьЗначение("Адрес", АдресЗапроса);
	//ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
	//БлокировкаДанных.Заблокировать();
	//
	//МенеджерЗаписи = РегистрыСведений.МП_ЯМ_КонтрольОграниченийПоРаботеССервисами.СоздатьМенеджерЗаписи();
	//МенеджерЗаписи.Адрес = АдресЗапроса;
	//МенеджерЗаписи.Прочитать();
	//
	//Если МенеджерЗаписи.Выбран() Тогда
	//	КоличествоЗапросовВМинуту	   = МенеджерЗаписи.КоличествоЗапросовВМинуту;
	//	ВремяНачалаМинуты			   = МенеджерЗаписи.ВремяНачалаМинуты;
	//	ВремяКонецМинуты			   = МенеджерЗаписи.ВремяКонецМинуты;
	//	ИсполненоЗапросов			   = МенеджерЗаписи.ИсполненоЗапросов;
	//	ДатаЗапросаВМиллисекундах	   = МенеджерЗаписи.ДатаЗапросаВМиллисекундах;
	//	ИнтервалЗапросовВМиллисекундах = МенеджерЗаписи.ИнтервалЗапросовВМиллисекундах;
	//КонецЕсли;
	//
	//Если КоличествоЗапросовВМинуту <> 0 Тогда
	//	ТекущееВремя = ТекущаяДатаСеанса();
	//	Если ИсполненоЗапросов >= КоличествоЗапросовВМинуту Тогда
	//		РазницаВремени = ВремяКонецМинуты - ТекущаяДатаСеанса();
	//		Если РазницаВремени > 0 Тогда
	//			ОтменитьТранзакцию();
	//			
	//			ОбменМаркетПлейс.ВыполнитьПаузуВМиллисекундах(РазницаВремени * МиллисекундВСекунде);
	//			
	//			Возврат ВыполнитьКонтрольЗапроса(АдресЗапроса);
	//		КонецЕсли;
	//		ТекущееВремя = ТекущаяДатаСеанса()
	//	КонецЕсли;
	//	
	//	ТекущаяДатаВМиллисекундах = ТекущаяУниверсальнаяДатаВМиллисекундах();
	//	Если ИнтервалЗапросовВМиллисекундах > 0
	//		И ДатаЗапросаВМиллисекундах + ИнтервалЗапросовВМиллисекундах > ТекущаяДатаВМиллисекундах Тогда
	//		ОбменМаркетПлейс.ВыполнитьПаузуВМиллисекундах(ДатаЗапросаВМиллисекундах + ИнтервалЗапросовВМиллисекундах - ТекущаяДатаВМиллисекундах);
	//	КонецЕсли;
	//	
	//	Если ВремяНачалаМинуты = Неопределено
	//		Или ТекущееВремя > КонецМинуты(ВремяНачалаМинуты) Тогда
	//		ВремяНачалаМинуты			   = НачалоМинуты(ТекущееВремя);
	//		ВремяКонецМинуты			   = КонецМинуты(ТекущееВремя) + 1;
	//		ИсполненоЗапросов			   = 0;
	//		ДатаЗапросаВМиллисекундах	   = ТекущаяУниверсальнаяДатаВМиллисекундах();
	//	КонецЕсли;
	//	
	//	ИсполненоЗапросов = ИсполненоЗапросов + 1;
	//КонецЕсли;
	//
	//МенеджерЗаписи.Адрес						  = АдресЗапроса;
	//МенеджерЗаписи.КоличествоЗапросовВМинуту	  = КоличествоЗапросовВМинуту;
	//МенеджерЗаписи.ВремяНачалаМинуты			  = ВремяНачалаМинуты;
	//МенеджерЗаписи.ВремяКонецМинуты				  = ВремяКонецМинуты;
	//МенеджерЗаписи.ИсполненоЗапросов			  = ИсполненоЗапросов;
	//МенеджерЗаписи.ДатаЗапросаВМиллисекундах	  = ДатаЗапросаВМиллисекундах;
	//МенеджерЗаписи.ИнтервалЗапросовВМиллисекундах = ИнтервалЗапросовВМиллисекундах;
	//
	//Попытка
	//	МенеджерЗаписи.Записать();
	//	
	//	ЗафиксироватьТранзакцию()
	//Исключение
	//	ОтменитьТранзакцию()
	//КонецПопытки
	
КонецФункции // ВыполнитьКонтрольЗапроса()
