
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ВыбДок.ОграничениеТипа = Метаданные.РегистрыСведений.ОтгружаемыеКодыМаркировки.Реквизиты.ДокОснование.Тип;
КонецПроцедуры

&НаКлиенте
Процедура кнУдалитьКодыИзРеестра(Команда)
	Если ЗначениеЗаполнено(ВыбДок) Тогда
		рСоздания = РегистрыСведений.ОтгружаемыеКодыМаркировки.СоздатьЗадачуОчисткиОтгружаемыхКМДокумента(ВыбДок);		
		Если рСоздания.Успешно Тогда                        
			ТекстСообщения = СтрШаблон("Создана задача очистки КМ в реестре, по документу: %1. Задача: %2.", ВыбДок, рСоздания.Данные);
			Сообщить(ТекстСообщения);
			ЗаписатьВЛог("Реестр отгружаемых КМ", ТекстСообщения, "Информация");
			
			Закрыть();
		Иначе                        
			МаркировкаКС.ВывестиОшибки(рСоздания);						
		КонецЕсли;
	Иначе
		ПоказатьПредупреждение(, "Не выбран документ ! Очистка невозможна.");
	КонецЕсли;
КонецПроцедуры

