Процедура ПередЗаписью(Отказ)
	Если Ссылка.Наименование<>Наименование Тогда
		ДатаМодификации=ТекущаяДата();		
	КонецЕсли; 
	
	//Кухарь 14.02.18 начало
	//Запретим менять кому попало
	если не ОбменДанными.Загрузка тогда
		если не ПолучитьПолномочиеПользователя("РедактированиеПричинРекламации") тогда
			#Если клиент тогда
				Предупреждение("Недостаточно полномочий для изменений. Обратитесь к сотрудникам ПРО.");
			#КонецЕсли
			отказ=Истина;
		КонецЕсли;
	КонецЕсли;
	//Кухарь 14.02.18 конец
КонецПроцедуры


Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)	
	Префикс=ПолучитьПрефиксНомеров(ЭтотОбъект);
КонецПроцедуры

