Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)			
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения		=Модифицированность();
	НужноВыгружать		=Ложь;
		
	Если НЕ ОбменДанными.Загрузка Тогда		
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
		Если Отказ Тогда Возврат КонецЕсли; 	
	КонецЕсли;		

	Если Отказ Тогда Возврат КонецЕсли;
		
	Если ЕстьИзменения Тогда 
		ТипТовара			= Брэнд.Родитель;		
		КоличествоДокумента = Состав.Итог("Количество");
		//СуммаДокумента		= Состав.Итог("Всего");
		ГруппыТоваров		= ГруппыТоваровДокумента(ЭтотОбъект,"Состав",?(Детальный,"Номенклатура","Модель"));
		
		Состав.Сортировать("ТипТовара,Брэнд,Модель,Номенклатура");
		
		НужноВыгружать		= Истина;
	Иначе
		Если (НЕ Ссылка.Проведен И РежимЗаписи=РежимЗаписиДокумента.Проведение) ИЛИ Ссылка.ПометкаУдаления<>ПометкаУдаления Тогда
			НужноВыгружать=Истина;			
		КонецЕсли;		
	КонецЕсли;	
	
	Если НужноВыгружать Тогда
		//УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если проведен Тогда
		возврат;
	КонецЕсли;	
	
	Для Каждого СтрокаТЧ Из Состав Цикл
		 СтрокаТЧ.Количество = СтрокаТч.КоличествоИсх - строкатч.КоличествоФакт;
	КонецЦикла;	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание) экспорт
	
	// если передается обьект, то не отрабатывало..
	// нечаева 19,01,26 ++  https://yougile.collant.ru/team/ab6bad3a05c0/Служба-АСУ#OUT-179
	Если Основание.метаданные().Имя = "ПланПродаж"   Тогда

	//Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПланПродаж") Тогда  // было
		
		Валюта 	= Основание.Валюта;
		ИБ 		= Основание.ИБ;
		Склад 	= Основание.Склад;
		Курс= Основание.курс;
		//	ТипЦен 	= Основание.ТипЦен;
		Подразделение = основание.подразделение;
		ДокОснование = Основание;
		Контрагент =  Основание.контрагент;
		Примечание = основание.примечание;
		детальный = основание.детальный;
		Брэнд = основание.брэнд;
				
		// Нечаева 15,01,26 ++ OUT-179 просто план продаж - учитываем дату запрета.
		//Если Найти("Матрица,ПланПродажПоКлиентам",МетаДок.Имя)<>0  Тогда 
		//Валетов + 28,01,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8677 Было: 
		//ДатаПланаПродаж = Основание.ДатаПланаПродаж; 
		ДатаПланаПродаж = Основание.ДатаРасчетаЦенПоМатрице;
		// Нечаева 15,01,26 -- OUT-179


		Для Каждого СтрокаИст Из Основание.состав  Цикл
			Если СтрокаИст.Количество=0 Тогда Продолжить КонецЕсли;
			
			СтрокаТЧ=Состав.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаИст);
			СтрокаТЧ.КоличествоИсх = строкаИст.количество;
			//крохин начало 18.02.2021	
			//СтрокаТЧ.Количество=0;
			СтрокаТЧ.КоличествоФакт=СтрокаТЧ.КоличествоИсх;
			СтрокаТЧ.Количество = 0;
			//крохин конец 18.02.2021	
		КонецЦикла; 
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если утвержден = истина тогда
		сообщить("Отработанный документ нельзя удалять.");
		отказ = истина;	
	конецЕсли;
	
КонецПроцедуры





