#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьТекущееРабочееМесто(Знач ИмяКомпьютера) Экспорт
	Результат = Справочники.РабочиеМеста.ПустаяСсылка();	
	
	ИмяКомпьютера = НРег(ИмяКомпьютера);
	
	Если ЗначениеЗаполнено(ИмяКомпьютера) Тогда	
		
		РабочееМесто = Справочники.РабочиеМеста.НайтиПоКоду(ИмяКомпьютера);
		
		Если ЗначениеЗаполнено(РабочееМесто)  Тогда
			Результат = РабочееМесто;
		Иначе
			СпрОбъект = Справочники.РабочиеМеста.СоздатьЭлемент();	
			
			СпрОбъект.Код 			= ИмяКомпьютера;
			СпрОбъект.Наименование	= ИмяКомпьютера;
			
			СпрОбъект.Записать();
			
			Результат = СпрОбъект.Ссылка;
		КонецЕсли;	
	КонецЕсли;                           
	
	Возврат Результат;
КонецФункции //ПолучитьТекущееРабочееМесто() Экспорт

Функция ПолучитьРабочееМестоПоУзлу(УзелТерминала) Экспорт
	Результат = Справочники.РабочиеМеста.ПустаяСсылка();	
	
	Если ЗначениеЗаполнено(УзелТерминала) Тогда	
		ИмяКомпьютера = СокрЛП(ПолучитьРеквизитШапки(УзелТерминала, "Код"));
		
		РабочееМесто = Справочники.РабочиеМеста.НайтиПоКоду(ИмяКомпьютера);
		
		Если ЗначениеЗаполнено(РабочееМесто)  Тогда
			Результат = РабочееМесто;
		Иначе
			СпрОбъект = Справочники.РабочиеМеста.СоздатьЭлемент();	
			
			СпрОбъект.Код 			= ИмяКомпьютера;
			СпрОбъект.Наименование	= ИмяКомпьютера;
			
			СпрОбъект.ЭтоТСД 		= Истина;
			СпрОбъект.ИмяПланаОбмена= УзелТерминала.Метаданные().Имя;
			
			СпрОбъект.Записать();
			
			Результат = СпрОбъект.Ссылка;
		КонецЕсли;	
	КонецЕсли;                           
	
	Возврат Результат;
КонецФункции //ПолучитьТекущееРабочееМесто() Экспорт


#КонецЕсли
