#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)	
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
	
	ТипЧисло = Новый ОписаниеТипов("Число");
	Если НомерТСД = 0 Тогда
		Если СтрНачинаетсяС(Наименование, "tsd_") Тогда
			НомерТСД = ТипЧисло.ПривестиЗначение(СтрРазделить(Наименование,"_")[1]); 								
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)	
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли