
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПланОбмена = МаркировкаКС.ПолучитьЗначениеПараметра(ЭтотОбъект.Параметры, "ПланОбмена");
	Если ЗначениеЗаполнено(ПланОбмена) Тогда		
		ВыбУзелОбмена = Маркировка_ПИ.ЭтотУзел(ПланОбмена);
	Иначе
		ВыбУзелОбмена = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогПакетов_НачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	мКаталогЗагрузки = ВыборКаталога_(КаталогЗагрузки);
	Если ЗначениеЗаполнено(мКаталогЗагрузки) Тогда   
		КаталогЗагрузки = мКаталогЗагрузки;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ВыборКаталога_(Каталог, ПроверятьСуществование = Истина)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	
	ДиалогВФ = Новый ДиалогВыбораФайла(Режим);
	
	ДиалогВФ.Заголовок						=	"Выберите каталог содержащий пакеты обмена";
	ДиалогВФ.ПроверятьСуществованиеФайла	=	ПроверятьСуществование;
	ДиалогВФ.Каталог						= 	Каталог;
	
	Результат = "";  
	Если ДиалогВФ.Выбрать() Тогда
		Результат = ДиалогВФ.Каталог;	
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции //ВыборКаталога_(Каталог, ПроверятьСуществование = Истина)

&НаКлиенте
Процедура ЗагрузитьПакеты(Команда)
	Если ЗначениеЗаполнено(КаталогЗагрузки) Тогда     
		МаскаФайлов = СтрШаблон("Msg_*_%1_*.dd", СокрЛП(ПолучитьРеквизитШапки(ВыбУзелОбмена, "Код")));
		
		Файлы = НайтиФайлы(КаталогЗагрузки, МаскаФайлов);
		Если Файлы.Количество() > 0 Тогда
			Для Каждого Файл Из Файлы Цикл
				рЗагрузки = Справочники.ФР_ПакетыДанных.ПрочитатьПакет(Новый ДвоичныеДанные(Файл.ПолноеИмя));	
				Если рЗагрузки.Успешно Тогда				
					Сообщить("Загружен пакет: " + рЗагрузки.Данные, СтатусСообщения.Важное);				
				Иначе
					МаркировкаКС.ВывестиОшибки(рЗагрузки);
				КонецЕсли;
			КонецЦикла;
		Иначе      
			Сообщить(СтрШаблон("В каталоге: '%1' не найдено файлов по маске: '%2' !", КаталогЗагрузки, МаскаФайлов), СтатусСообщения.Важное);
		КонецЕсли;				
	Иначе
		Сообщить("Не указан каталог загрузки !", СтатусСообщения.Важное);
	КонецЕсли;
КонецПроцедуры
