&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	пВыполнения	= инт_ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);	
	пВыполнения.НаименованиеФоновогоЗадания = "Загрузка данных пакета обмена";
	
	ДопПараметры = Новый Соответствие;
	ДопПараметры["фВыполнятьВФоне"] = Истина;
	
	пПроцедуры = Новый Массив;
	
	пПроцедуры.Добавить(ПараметрКоманды);
	пПроцедуры.Добавить(ДопПараметры);
	
	рЗапуска   = инт_ДлительныеОперации.ВыполнитьВФоне("Справочники.ФР_ПакетыДанных.ЗагрузитьПакеты", пПроцедуры, пВыполнения);

	пОжидания = инт_ДлительныеОперацииК.ПараметрыОжидания(ЭтотОбъект);
	пОжидания.ВыводитьПрогрессВыполнения = Истина;
	пОжидания.Заголовок = "Загрузка пакетов данных";
	
	ооЗавершение = Новый ОписаниеОповещения("ОжиданиеЗавершенияФЗ", ЭтотОбъект);
	
	инт_ДлительныеОперацииК.ОжидатьЗавершение(рЗапуска, ооЗавершение, пОжидания);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОжиданиеЗавершенияФЗ(Результат = Неопределено, ДопПараметры = Неопределено) Экспорт
	Если ТипЗнч(Результат) = Тип("Структура") Тогда		
		Если Результат.Статус = "Выполнено" Тогда			
			рОбмена = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
			Если ТипЗнч(рОбмена) = Тип("Структура") Тогда
				Если рОбмена.Успешно Тогда       
					Сообщить("Успешно завершена загрузка данных пакетов.", СтатусСообщения.Информация);
				Иначе					
					Сообщить("Ошибка загрузки данных пакетов !", СтатусСообщения.Важное);
					МаркировкаКС.ВывестиОшибки(рОбмена);					
				КонецЕсли;
				МаркировкаКС.ВывестиСообщения(рОбмена);
			Иначе                                   
				Сообщить("Неожиданный тип результата ФЗ: " + ТипЗнч(рОбмена));			
			КонецЕсли;
		ИначеЕсли Результат.Статус = "Ошибка" Тогда
			Сообщить(Результат.ПодробноеПредставлениеОшибки, СтатусСообщения.Важное);
		КонецЕсли;
	Иначе
		Сообщить("Некорректный тип результата фонового задания: " + ТипЗнч(Результат)+" ! Ожидаемый тип: 'Структура' !", СтатусСообщения.Важное);
	КонецЕсли;
КонецПроцедуры
