
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	рПроверки = ПроверитьДокументыКОбработке(ПараметрКоманды);
	
	Для Каждого ТекстОшибки Из рПроверки.ОшибкиДокументов Цикл
		Сообщить(ТекстОшибки, СтатусСообщения.Важное);	
	КонецЦикла; 
	
	Для Каждого ДокСсылка Из рПроверки.ДокументыКОбработке Цикл		
		рОбработки = МаркировкаВС.ПолучитьРезультаты_ОперМаркировки(ДокСсылка);		
		
		Если рОбработки.Успешно Тогда
			ОповеститьОбИзменении(ДокСсылка);
			Оповестить("ИзмененСтатус", , ДокСсылка);	
		Иначе     
			ЕстьОшибки = рОбработки.Ошибки.Количество()>0 И НЕ МаркировкаКС.ЕстьОшибка404(рОбработки);			
			Если ЕстьОшибки Тогда				
				ТекстОшибки = СтрСоединить(рОбработки.Ошибки, Символы.ПС);
				
				Реквизиты = Новый Структура("ТекстОшибки", ТекстОшибки);
				
				Если НЕ МаркировкаКС.ЕстьОшибка404(рОбработки) Тогда
					Реквизиты.Вставить("Статус", Перечисления.СтатусыДокументовМаркировки.ОшибкаОбработки);			
				КонецЕсли;			
				
				УстановитьРеквизитыОбъекта(ДокСсылка, Реквизиты);
				
				Сообщить(ТекстОшибки, СтатусСообщения.Важное);
			Иначе                 
				ТекстСообщения = СтрШаблон("Докуумент: '%1' обрабатывается ЧЗ.", ДокСсылка);
				Сообщить(ТекстСообщения, СтатусСообщения.Информация);
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;	
	
	Если рПроверки.ДокументыКОбработке.Количество() = 0 Тогда
		Сообщить("Не найдено подходящих документов для обработки.", СтатусСообщения.Внимание);	
	КонецЕсли; 
КонецПроцедуры

 
&НаСервере
Функция ПроверитьДокументыКОбработке(мСсылки)
	Результат = Новый Структура("ОшибкиДокументов,ДокументыКОбработке", Новый Массив, Новый Массив, Новый Массив);
	
	ОбработкаПроверки = Обработки.ПроверкаКарточекДляНК.Создать();
	
	Для Каждого ДокСсылка Из мСсылки Цикл			
		рПроверки = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ПроверитьДокументПередПолучениемИзЧЗ(ДокСсылка);
		Если рПроверки.Успешно Тогда
			Результат.ДокументыКОбработке.Добавить(ДокСсылка);
		Иначе
			МаркировкаКС.ДобавитьОшибки(Результат.ОшибкиДокументов, рПроверки);				
		КонецЕсли;
	КонецЦикла; 	
	
	Возврат Результат;
КонецФункции //ПроверитьДокументыКОбработке(мСсылки)

 
