//крохин начало 11.10.2012
//скидкаДК
Функция ПолучитьСкидкуДК(СуммаНакоплений) Экспорт
	//крохин начало 03.10.2013
	//ДК 20% и 25% больше не выдаются
	//Если СуммаНакоплений >= 100000 Тогда
	//	Возврат 25;
	//ИначеЕсли СуммаНакоплений >= 75000 Тогда
	//	Возврат 20;
	//ИначеЕсли СуммаНакоплений >= 45000 Тогда
	//	Возврат 15;
	//ИначеЕсли СуммаНакоплений >= 30000 Тогда
	//	Возврат 10;
	//Иначе
	//	Возврат 5;
	//КонецЕсли;
	
	//нечаева 29,10,15+++ нет больше скидки 15%
	Если СуммаНакоплений >= 45000 и ТекущаяДата()<дата(2015,11,3) Тогда
		//нечаева 29,10,15--
		Возврат 15;
	ИначеЕсли СуммаНакоплений >= 30000 Тогда
		Возврат 10;
	Иначе
		Возврат 5;
	КонецЕсли;
	
	//крохин конец 03.10.2013
	
КонецФункции
//крохин конец 11.10.2012

//функция выполняет приведение строки к числу
// Параметры:
//  ЧислоСтрокой           - Строка - Строка приводимая к числу
//  ВозвращатьНеопределено - Булево - Если Истина и строка содержит некорректное значение, то возвращать Неопределено
//
// Возвращаемое значение:
//  Число
//
Функция ПривестиСтрокуКЧислу(ЧислоСтрокой, ВозвращатьНеопределено = Ложь) Экспорт
	
	ОписаниеТипаЧисла = Новый ОписаниеТипов("Число");
	ЗначениеЧисла = ОписаниеТипаЧисла.ПривестиЗначение(ЧислоСтрокой);
	
	Если ВозвращатьНеопределено И (ЗначениеЧисла = 0) Тогда
		
		Стр = Строка(ЧислоСтрокой);
		Если Стр = "" Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Стр = СтрЗаменить(СокрЛП(Стр), "0", "");
		Если (Стр <> "") И (Стр <> ".") И (Стр <> ",") Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначениеЧисла;	
	
КонецФункции

// Функция выполняет приведение строки к дате
Функция ПривестиСтрокуКДате(ДатаСтрокой) Экспорт
	
	ОписаниеТипаДаты = Новый ОписаниеТипов("Дата");
	ЗначениеДаты = ОписаниеТипаДаты.ПривестиЗначение(ДатаСтрокой);
	
	Возврат ЗначениеДаты;
	
КонецФункции

// Функция выполняет приведение строки к булево
Функция ПривестиСтрокуКБулево(БулевоСтрокой) Экспорт
	
	ОписаниеТипаБулево = Новый ОписаниеТипов("Булево");
	ЗначениеБулево = ОписаниеТипаБулево.ПривестиЗначение(БулевоСтрокой);
	
	Возврат ЗначениеБулево;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ДРУГИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

//  Функция формирует сведения об указанном ЮрФизЛице. К сведениям относятся -
// наименование, адрес, номер телефона, банковские реквизиты.
//
// Параметры: 
//  ЮрФизЛицо   - организация или физическое лицо, о котором собираются сведения.
//  ДатаПериода - дата, на которую выбираются сведения о ЮрФизЛице.
//  ДляФизЛицаТолькоИнициалы - Для физ. лица выводить только инициалы имени и отчества.
//
// Возвращаемое значение:
//  Сведения - собранные сведения.
//
Функция СведенияОЮрФизЛице(ЮрФизЛицо, ДатаПериода = '00010101', ДляФизЛицаТолькоИнициалы = Истина, БанковскийСчет = Неопределено) Экспорт
	
	Сведения = Новый Структура("Представление, ПолноеНаименование, СокращенноеНаименование, НаименованиеДляПечатныхФорм, КодПоОКПО, ИНН, КПП, Телефоны, ЮридическийАдрес, Банк, БИК, КоррСчет, НомерСчета, АдресБанка");
	Запрос   = Новый Запрос;
	Данные   = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(ЮрФизЛицо) Тогда
		Возврат Сведения;
	КонецЕсли;
	
	Если БанковскийСчет = Неопределено ИЛИ БанковскийСчет.Пустая() Тогда
		ТекБанковскийСчет = ЮрФизЛицо.ОсновнойБанковскийСчет;
	Иначе
		ТекБанковскийСчет = БанковскийСчет;
	КонецЕсли;
	
	// Выберем основные сведения о контрагентеЮрФизЛицо.ОсновнойБанковскийСчет.БанкДляРасчетов.Пустая
	Если ТекБанковскийСчет.БанкДляРасчетов.Пустая() Тогда
		ИмяРеквизитаБанка = "Банк";
	Иначе
		ИмяРеквизитаБанка = "БанкДляРасчетов";
	КонецЕсли;
	
	Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Организации") Тогда
		ИмяСправочника = "Организации";
	ИначеЕсли ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Контрагенты") Тогда
		ИмяСправочника = "Контрагенты";
	Иначе
		Возврат Сведения;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПарЮрФизЛицо",      ЮрФизЛицо);
	Запрос.УстановитьПараметр("ПарБанковскийСчет", ТекБанковскийСчет);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Представление КАК Наименование,
	|	Организации.ИНН,
	|	Организации.КПП,"; // Катаев+ 24/12/13 Убрал строку по коду ОКПО и перенес в формирование текста запроса ниже
	
	Если ИмяСправочника = "Организации" Тогда
		Запрос.Текст = Запрос.Текст + "
		//Катаев+ 24/12/13 У организации и контрагента обзываются по разному. Перенес из текста запроса выше
		|	Организации.КодПоОКПО КАК КодПоОКПО,
		//Катаев- 24/12/13
		|	Организации.НаименованиеПолное КАК ПолноеНаименование,
		|	Организации.Наименование КАК СокращенноеНаименование,
		|	Организации.НаименованиеПолное КАК НаименованиеДляПечатныхФорм,";
		//	|	Организации.СвидетельствоСерияНомер,
		//	|	Организации.СвидетельствоДатаВыдачи,";
	ИначеЕсли ИмяСправочника = "Контрагенты" Тогда
		Запрос.Текст = Запрос.Текст + "
		//Катаев+ 24/12/13 У организации и контрагента обзываются по разному. Перенес из текста запроса выше
		|	Организации.ОКПО КАК КодПоОКПО, 
		//Катаев- 24/12/13
		|	Организации.ПолноеНаименование КАК ПолноеНаименование,
		|	Организации.Представление КАК СокращенноеНаименование,
		|	Организации.ПолноеНаименование КАК НаименованиеДляПечатныхФорм,";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекБанковскийСчет) Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	""""                           КАК НомерСчета,
		|	""""                           КАК Банк,
		|	""""                           КАК БИК,
		|	""""                           КАК КоррСчет,
		|	""""                           КАК АдресБанка
		|ИЗ
		|	Справочник."+ИмяСправочника+" КАК Организации
		|
		|ГДЕ
		|	Организации.Ссылка = &ПарЮрФизЛицо";
		
	Иначе
		
		Запрос.Текст = Запрос.Текст + "
		|	БанковскиеСчета.НомерСчета                     КАК НомерСчета,
		|	БанковскиеСчета."+ИмяРеквизитаБанка+"          КАК Банк,
		|	БанковскиеСчета."+ИмяРеквизитаБанка+".Код      КАК БИК,
		|	БанковскиеСчета."+ИмяРеквизитаБанка+".КоррСчет КАК КоррСчет,
		|	БанковскиеСчета."+ИмяРеквизитаБанка+".Адрес    КАК АдресБанка
		|ИЗ
		|	Справочник."+ИмяСправочника+" КАК Организации,
		|	Справочник.БанковскиеСчета    КАК БанковскиеСчета
		|
		|ГДЕ
		|	Организации.Ссылка       = &ПарЮрФизЛицо
		|	И БанковскиеСчета.Ссылка = &ПарБанковскийСчет";
		
	КонецЕсли;
	
	Данные = Запрос.Выполнить().Выбрать();
	Данные.Следующий();
	
	Сведения.Вставить("КодПоОКПО", 		"");
	Сведения.Вставить("КПП",       		"");
	Сведения.Вставить("Свидетельство",	"");
	
	Если НЕ (ЮрФизЛицо.Метаданные().Реквизиты.Найти("ЮрФизЛицо") = Неопределено) Тогда
		
		Сведения.КодПоОКПО = Данные.КодПоОКПО;
		
		Если ЮрФизЛицо.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			
			Сведения.КПП = Данные.КПП;
			
		ИначеЕсли ИмяСправочника = "Организации" Тогда
			
			//			Сведения.Свидетельство = "свидетельство " + Данные.СвидетельствоСерияНомер + " от " + Формат(Данные.СвидетельствоДатаВыдачи, "ДФ=dd.MM.yyyy");
			
		КонецЕсли;
		
	ИначеЕсли ИмяСправочника = "Организации" Тогда
		
		Сведения.КодПоОКПО = Данные.КодПоОКПО;
		Сведения.КПП       = Данные.КПП;
		
	КонецЕсли;
	
	Сведения.Вставить("ПолноеНаименование", СокрЛП(Данные.ПолноеНаименование));
	Сведения.Вставить("СокращенноеНаименование", СокрЛП(Данные.СокращенноеНаименование));
	Сведения.Вставить("НаименованиеДляПечатныхФорм", СокрЛП(Данные.НаименованиеДляПечатныхФорм));
	Сведения.Вставить("Представление",    СокрЛП(Данные.Наименование));
	Сведения.Вставить("ИНН",              Данные.ИНН);
	Сведения.Вставить("Телефоны",         УправлениеКонтактнойИнформацией.ПолучитьТелефонИзКонтактнойИнформации(ЮрФизЛицо));
	Сведения.Вставить("НомерСчета",       Данные.НомерСчета);
	Сведения.Вставить("Банк",             Данные.Банк);
	Сведения.Вставить("БИК",              Данные.БИК);
	Сведения.Вставить("АдресБанка",       Данные.АдресБанка);
	Сведения.Вставить("КоррСчет",         Данные.КоррСчет);
	Сведения.Вставить("ЮридическийАдрес", УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(ЮрФизЛицо, "Юридический"));
	Сведения.Вставить("ФактическийАдрес", УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(ЮрФизЛицо, "Фактический"));
	
	Если НЕ ЗначениеЗаполнено(Сведения.ПолноеНаименование) Тогда
		Сведения.ПолноеНаименование = Сведения.Представление;
	КонецЕсли;
	
	Возврат Сведения;
	
КонецФункции // СведенияОЮрФизЛице()

// Устанавливает банковский счет по умолчанию. Возвращает состояние установлен/не установлен
//
// Параметры
//  Счет				-	Текущее значение счета
//  ВладелецСчета  		–	<СправочникСсылка.Контрагенты (.Организации)> 
//							Контрагент (организация), счет которого нужно получить
//  Валюта  			–	<СправочникСсылка.Валюты>
//							Валюта регламентированного учета
//  СовпадениеВалюты	–	<Булево>
//                          признак совпадения нужной вылюты с указанной, либо исключения ее из поиска
//							По умолчанию ищем счет с указанной валютой.
//
// Возвращаемое значение:
//   <СправочникСсылка.БанковскиеСчета> – найденный счет или пустая ссылка
//
Функция УстановитьБанковскийСчет(Счет,ВладелецСчета, Валюта, СовпадениеВалюты = Истина) Экспорт
	
	НовыйСчет = Справочники.БанковскиеСчета.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	БанковскиеСчета.Ссылка,
	|	ВЫБОР
	|		КОГДА СправочникВладелец.Ссылка ЕСТЬ НЕ NULL 
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК СправочникВладелец
	|		ПО БанковскиеСчета.Владелец = СправочникВладелец.Ссылка
	|			И БанковскиеСчета.Ссылка = СправочникВладелец.ОсновнойБанковскийСчет
	|ГДЕ
	|	БанковскиеСчета.Владелец = &ВладелецСчета
	|	И БанковскиеСчета.ПометкаУдаления = ЛОЖЬ
	|	И (БанковскиеСчета.ВалютаДенежныхСредств = &Валюта
	|				И &СовпадениеВалюты = ИСТИНА
	|			ИЛИ (НЕ БанковскиеСчета.ВалютаДенежныхСредств = &Валюта)
	|				И &СовпадениеВалюты = ЛОЖЬ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	Запрос.УстановитьПараметр("ВладелецСчета",   ВладелецСчета);
	Запрос.УстановитьПараметр("Валюта", 		 Валюта);
	Запрос.УстановитьПараметр("СовпадениеВалюты",СовпадениеВалюты);
	
	Если ТипЗнч(ВладелецСчета) = Тип("СправочникСсылка.Контрагенты") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Справочник.Организации", "Справочник.Контрагенты");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Результат    = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		НайденОсновнойСчет = Выборка.Приоритет = 1;
		НайденОдинСчет     = Выборка.Количество() = 1;
		
		Если НайденОсновнойСчет ИЛИ НайденОдинСчет Тогда
			НовыйСчет = Выборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Счет <> НовыйСчет 
		И ((НЕ ЗначениеЗаполнено(Счет))
		ИЛИ (ТипЗнч(Счет) = Тип("СправочникСсылка.БанковскиеСчета") 
		И Счет.Владелец <> ВладелецСчета)) Тогда
		
		Счет = НовыйСчет;
		Возврат Истина;
		
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // ПолучитьБанковскийСчет()

// нечаева  ---

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ПЕРЕЧИСЛЕНИЯМИ

// Функция формирует список элементов перечисления
//
// Параметры
//  ИмяПеречисления - имя перечисления, как оно задано в конфигураторе
//
// Возвращаемое значение:
//   СписокЗначений - список элементов перечисления
//
Функция ПолучитьСписокЭлементовПеречисления(ИмяПеречисления) Экспорт
	
	СписокЭлементовПеречисления = Новый СписокЗначений;
	
	Попытка
		КоллекцияЭлементовПеречисления = Перечисления[ИмяПеречисления];
	Исключение
		Возврат СписокЭлементовПеречисления;
	КонецПопытки;
	
	Для каждого ЭлементПеречисления Из КоллекцияЭлементовПеречисления Цикл
		СписокЭлементовПеречисления.Добавить(ЭлементПеречисления, Строка(ЭлементПеречисления));
	КонецЦикла;
	
	Возврат СписокЭлементовПеречисления;
	
КонецФункции // ПолучитьСписокЭлементовПеречисления()

// Предназначена для получения имени элемента перечисления по значению.
//
// Параметры:
//  Элемент перечисления.
//
// Возвращаемое значение:
//  Строка - имя элемента перечисления в метаданных.
//
Функция ПолучитьИмяЭлементаПеречисленияПоЗначению(ЗначениеПеречисления) Экспорт
	
	ИмяЭлемента = Строка(ЗначениеПеречисления);
	Для каждого ЭлементПеречисления Из Метаданные.Перечисления[ЗначениеПеречисления.Метаданные().Имя].ЗначенияПеречисления Цикл
		Если ЭлементПеречисления.Синоним = Строка(ЗначениеПеречисления) Тогда
			ИмяЭлемента = ЭлементПеречисления.Имя;
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	
	Возврат ИмяЭлемента;
	
КонецФункции // ПолучитьПериодичностьДляЗапросаПоЗначениюПеречисления()

// функция из исходной строки формирует строку для поиска данных в запросе
Функция СформироватьСтрокуДляПоискаВЗапросе(Знач СтрокаПоиска) Экспорт
	
	ИтоговаяСтрокаДляПоиска = СтрокаПоиска;
	ИтоговаяСтрокаДляПоиска = СтрЗаменить(ИтоговаяСтрокаДляПоиска, "~", "~~");
	ИтоговаяСтрокаДляПоиска = СтрЗаменить(ИтоговаяСтрокаДляПоиска, "%", "~%");
	ИтоговаяСтрокаДляПоиска = СтрЗаменить(ИтоговаяСтрокаДляПоиска, "_", "~_");
	ИтоговаяСтрокаДляПоиска = СтрЗаменить(ИтоговаяСтрокаДляПоиска, "[", "~[");
	ИтоговаяСтрокаДляПоиска = СтрЗаменить(ИтоговаяСтрокаДляПоиска, "-", "~-");
	
	Возврат ИтоговаяСтрокаДляПоиска;
	
КонецФункции

Функция РазложитьАдрес(Знач СтрокаАдрес) Экспорт
	
	Страна = "";
	Индекс = "";
	Регион = "";
	Район = "";
	Город = "";
	НаселенныйПункт = "";
	Улица ="";
	Дом ="";
	Корпус ="";
	Квартира ="";
	
	МассивАдрес	=	РазложитьСтрокуВМассивПодстрок(СтрокаАдрес);
	ЭлементовВМассиве = МассивАдрес.Количество();   
	
	Если ЭлементовВМассиве	>	0	тогда
		Страна	=	СокрЛП(МассивАдрес[0]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	1	тогда
		Индекс	=	СокрЛП(МассивАдрес[1]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	2	тогда
		Регион	=	СокрЛП(МассивАдрес[2]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	3	тогда
		Район	=	СокрЛП(МассивАдрес[3]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	4	тогда
		Город	=	СокрЛП(МассивАдрес[4]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	5	тогда
		НаселенныйПункт	=	СокрЛП(МассивАдрес[5]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	6	тогда
		Улица	=	СокрЛП(МассивАдрес[6]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	7	тогда
		Дом	=	СокрЛП(МассивАдрес[7]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	8	тогда
		Корпус	=	СокрЛП(МассивАдрес[8]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	9	тогда
		Квартира	=	СокрЛП(МассивАдрес[9]);
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Страна",Страна);
	СтруктураВозврата.Вставить("Индекс",Индекс);
	СтруктураВозврата.Вставить("Регион",Регион);
	СтруктураВозврата.Вставить("Район",Район);
	СтруктураВозврата.Вставить("Город",Город);
	СтруктураВозврата.Вставить("НаселенныйПункт",НаселенныйПункт);
	СтруктураВозврата.Вставить("Улица",Улица);
	СтруктураВозврата.Вставить("Дом",Дом);
	СтруктураВозврата.Вставить("Корпус",Корпус);
	СтруктураВозврата.Вставить("Квартира",Квартира);
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Выполняет движение по регистру.
//
// Параметры:
//  НаборДвижений               - набор движений регистра,
//  ПустыеКолонкиСоставногоТипа - структура, содержащая имена измерений,ресурсов и
//  реквизитов составного типа, которые могут содержать пустые ссылки.
//
Процедура ВыполнитьДвижениеПоРегистру(НаборДвижений, ВидДвижения = Неопределено,
	ПустыеКолонкиСоставногоТипа = Неопределено, ЗаполнитьПериод = истина) Экспорт
	
	ТаблицаДвижений = НаборДвижений.мТаблицаДвижений;
	Если ТаблицаДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустыеКолонкиСоставногоТипа = Неопределено Тогда
		ПустыеКолонкиСоставногоТипа = Новый Структура;
	КонецЕсли;
	
	МетаРег = НаборДвижений.Метаданные();
	ИзмеренияСостТипа = Новый Структура;
	Для Каждого МетаИзм Из МетаРег.Измерения Цикл
		Если (МетаИзм.Тип.Типы().Количество() > 1)
			И НЕ (ПустыеКолонкиСоставногоТипа.Свойство(МетаИзм.Имя)) Тогда
			ИзмеренияСостТипа.Вставить(МетаИзм.Имя);
		КонецЕсли;
	КонецЦикла;
	Для Каждого МетаРек Из МетаРег.Реквизиты Цикл
		Если (МетаРек.Тип.Типы().Количество() > 1)
			И НЕ (ПустыеКолонкиСоставногоТипа.Свойство(МетаРек.Имя)) Тогда
			ИзмеренияСостТипа.Вставить(МетаРек.Имя);
		КонецЕсли;
	КонецЦикла;
	Для Каждого МетаРес Из МетаРег.Ресурсы Цикл
		Если (МетаРес.Тип.Типы().Количество() > 1)
			И НЕ (ПустыеКолонкиСоставногоТипа.Свойство(МетаРес.Имя)) Тогда
			ИзмеренияСостТипа.Вставить(МетаРес.Имя);
		КонецЕсли;
	КонецЦикла;
	
	// Откопируем остальные колонки (структура таблиц совпадает).
	ПерваяКолонка = Истина;
	МассивСтрок   = Новый Массив(ТаблицаДвижений.Количество());
	ЕстьПериод    = НЕ ТаблицаДвижений.Колонки.Найти("Период") = Неопределено;
	Для каждого Колонка Из ТаблицаДвижений.Колонки Цикл
		
		ИмяКолонки = Колонка.Имя;
		Если ИмяКолонки <> "Период"
			И ИмяКолонки <> "Активность"
			И ИмяКолонки <> "НомерСтроки"
			И ИмяКолонки <> ""
			И ?(ИмяКолонки = "ВидДвижения", ВидДвижения = Неопределено, Истина)
			И ИмяКолонки <> "МоментВремени" Тогда
			
			Если ИзмеренияСостТипа.Свойство(ИмяКолонки) Тогда
				ФлагКолонкиСостТипа = Истина;
			Иначе
				ФлагКолонкиСостТипа = Ложь;
			КонецЕсли;
			
			Индекс = 0;
			Для каждого СтрокаТаблицы Из ТаблицаДвижений Цикл
				
				Если ПерваяКолонка Тогда
					
					Если ВидДвижения = ВидДвиженияНакопления.Приход Тогда
						СтрокаДвижения = НаборДвижений.ДобавитьПриход();
					ИначеЕсли ВидДвижения = ВидДвиженияНакопления.Расход Тогда
						СтрокаДвижения = НаборДвижений.ДобавитьРасход();
					Иначе
						СтрокаДвижения = НаборДвижений.Добавить(); // Для оборотных регистров
					КонецЕсли;
					
					МассивСтрок[Индекс] = СтрокаДвижения;
					СтрокаДвижения.Период = НаборДвижений.мПериод;
					Если не ЗаполнитьПериод и ЕстьПериод И НЕ СтрокаТаблицы.Период = '00010101' Тогда
						СтрокаДвижения.Период = СтрокаТаблицы.Период;
					Иначе
						СтрокаДвижения.Период = НаборДвижений.мПериод;
					КонецЕсли; 
					
				Иначе
					
					СтрокаДвижения = МассивСтрок[Индекс];
					
				КонецЕсли;
				
				Индекс = Индекс + 1;
				
				ЗначКолонки = СтрокаТаблицы[ИмяКолонки];
				Если ФлагКолонкиСостТипа Тогда
					
					Очистить = Ложь;
					Если ТипЗнч(ЗначКолонки) = Тип("Число")Тогда
						Если ЗначКолонки = 0 Тогда
							Очистить = Истина;
						КонецЕсли;
					ИначеЕсли ТипЗнч(ЗначКолонки) = Тип("Строка") Тогда
						Если ЗначКолонки = "" Тогда
							Очистить = Истина;
						КонецЕсли;
					ИначеЕсли ТипЗнч(ЗначКолонки) = Тип("Дата") Тогда
						Если ЗначКолонки = '00010101000000' Тогда
							Очистить = Истина;
						КонецЕсли;
					ИначеЕсли ЗначКолонки = Неопределено Или ЗначКолонки.Пустая() Тогда
						Очистить = Истина;
					КонецЕсли;
					
					Если Очистить Тогда
						СтрокаДвижения[ИмяКолонки] = Неопределено;
					Иначе
						СтрокаДвижения[ИмяКолонки] = ЗначКолонки;
					КонецЕсли;
				Иначе
					СтрокаДвижения[ИмяКолонки] = ЗначКолонки;
				КонецЕсли;
				
			КонецЦикла;
			
			ПерваяКолонка = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ВыполнитьДвижениеПоРегистру()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С МАССИВАМИ

// Сравнивает два массива однотипных значений (кроме коллекций значений)
//
// Параметры: 
//  ПервыйМассив,ВторойМассив - сравниваемые массивы
//
// Возвращаемое значение:
//  булево.
//
Функция МассивыИдентичны(ПервыйМассив,ВторойМассив) Экспорт
	
	ЭлементовМассива = ПервыйМассив.Количество();
	МассивыСовпадают = (ЭлементовМассива = ВторойМассив.Количество()); 
	
	Если МассивыСовпадают Тогда
		
		Для Сч = 1 По ЭлементовМассива Цикл
			
			Если ПервыйМассив[Сч-1] <> ВторойМассив[Сч-1] Тогда
				Возврат Ложь
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат МассивыСовпадают
	
КонецФункции // МассивыИдентичны()

// функция ищет элемент в массиве. Если находит - возвращает его индекс, иначе -1
Функция ВернутьИндексВМассиве(МассивДанные, Элемент) Экспорт 
	
	Если МассивДанные = Неопределено Тогда
		Возврат -1;
	КонецЕсли;
	
	Для ИндексЭлемента = 0 По МассивДанные.ВГраница() Цикл
		
		Если  (МассивДанные[ИндексЭлемента] = Элемент) Тогда
			Возврат ИндексЭлемента;
		КонецЕсли;	
		
	КонецЦикла;
	
	// не нашли элемент
	Возврат -1;
	
КонецФункции

// Удаление из массива пустых элементов
//
// Параметры:
//   МассивЭлементов - Массив
//
Процедура УдалитьНеЗаполненныеЭлементыМассива(МассивЭлементов) Экспорт
	
	Колво = МассивЭлементов.Количество();
	Для н=1 По Колво Цикл
		Если НЕ ЗначениеЗаполнено(МассивЭлементов[Колво-н]) Тогда
			МассивЭлементов.Удалить(Колво-н);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


// Функция возвращает реквизит группы справочника либо ее родителя пока не найдет заполненный
Функция ПолучитьРеквизитРодителя(Данные,ИмяРеквизита) Экспорт
	//крохин начало 16.12.2019
	//Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(Данные)) Тогда //Ссылка		
	//	Реквизиты=ПолучитьРеквизитыШапки(Данные,"Родитель,"+ИмяРеквизита);
	//Иначе
	//	Реквизиты=Новый Структура("Родитель,"+ИмяРеквизита);		
	//	ЗаполнитьЗначенияСвойств(Реквизиты,Данные);
	//КонецЕсли; 
	//ТекЗнач=Реквизиты[ИмяРеквизита];	
	//Если ЗначениеНеЗаполнено(Реквизиты[ИмяРеквизита]) И ЗначениеЗаполнено(Реквизиты["Родитель"]) Тогда
	//	ТекЗнач = ПолучитьРеквизитРодителя(Реквизиты["Родитель"],ИмяРеквизита);	
	//КонецЕсли;	
	//Возврат ТекЗнач;
	
	ТекЗнач=Неопределено;
	
	Если НЕ (Данные=Неопределено ИЛИ Данные=NULL) Тогда
		ТипДанных=ТипЗнч(Данные); 
		Если Справочники.ТипВсеСсылки().СодержитТип(ТипДанных) Тогда //Ссылка                           
			Реквизиты=ПолучитьРеквизитыШапки(Данные,"Родитель,"+ИмяРеквизита);
		Иначе //Объект
			Реквизиты=Новый Структура("Родитель,"+ИмяРеквизита);                   
			ЗаполнитьЗначенияСвойств(Реквизиты,Данные);
		КонецЕсли; 
		ТекЗнач=Реквизиты[ИмяРеквизита];  
		Если ЗначениеНеЗаполнено(Реквизиты[ИмяРеквизита]) И ЗначениеЗаполнено(Реквизиты["Родитель"]) Тогда
			ТекЗнач = ПолучитьРеквизитРодителя(Реквизиты["Родитель"],ИмяРеквизита);         
		КонецЕсли;
		
		Если ТекЗнач=Неопределено Тогда
			МетаОбъект=Метаданные.НайтиПоТипу(ТипДанных);
			Если МетаОбъект<>Неопределено Тогда
				МетаРеквизит=МетаОбъект.Реквизиты.Найти(ИмяРеквизита);
				Если МетаРеквизит<>Неопределено Тогда
					ТекЗнач=МетаРеквизит.Тип.ПривестиЗначение();                                                                                                     
				КонецЕсли; 
			КонецЕсли;                                       
		КонецЕсли;       
	КонецЕсли;       
	
	Возврат ТекЗнач;
	
	
	//крохин конец 16.12.2019
КонецФункции // ПолучитьРеквизитРодителя()

Функция ПолучитьВидПоПредставлению(Представление) Экспорт
	Если Представление="РНК" Тогда
		Возврат  "РасходнаяНакладная"
	ИначеЕсли Представление="ПНК" Тогда
		Возврат  "ПриходнаяНакладная"
	ИначеЕсли Представление="ПРМ" Тогда
		Возврат  "Перемещение"
	ИначеЕсли Представление="СФ" Тогда
		Возврат  "СфетФактура"
	Иначе
		Возврат Неопределено;	
	КонецЕсли; 
КонецФункции // ПолучитьВидПоПредставлению()

// Функция собирает сведения о 
//
// Параметры:
//  Организация - организация, для которой нужно определить руководящих лиц.
//  Это: Организация или Контрагент
Функция ОтветственныеЛица(Организация, ДатаСреза) Экспорт
	
	Результат = Новый Структура("РуководительДолжность, РуководительФИО, 
	|ГлавныйБухгалтерФИО, 
	|КассирФИО");
	
	Если Организация <> Неопределено Тогда
		
		// Шворобей ВЮ 25.12.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2412
		Если ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
			ИмяРегистра = "ОтветственныеЛицаОрганизации";
		ИначеЕсли ТипЗнч(Организация) = Тип("СправочникСсылка.Контрагенты") Тогда
			ИмяРегистра = "ОтветственныеЛицаКонтрагентов";
		КонецЕсли;
		
		ЗапросПоЛицам = Новый Запрос();
		ЗапросПоЛицам.УстановитьПараметр("ДатаСреза",   ДатаСреза);
		ЗапросПоЛицам.УстановитьПараметр("Организация", Организация);
		ЗапросПоЛицам.Текст = 
		"ВЫБРАТЬ
		|	ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность
		|ИЗ
		|	РегистрСведений." + ИмяРегистра + ".СрезПоследних(&ДатаСреза, СтруктурнаяЕдиница = &Организация) КАК ОтветственныеЛицаОрганизацийСрезПоследних";
		// Шворобей ВЮ 25.12.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2412
		
		Руководители = ЗапросПоЛицам.Выполнить().Выбрать();
		
		Пока Руководители.Следующий() Цикл
			Если Руководители.ОтветственноеЛицо      = Перечисления.ОтветственныеЛицаОрганизации.Руководитель Тогда
				Результат.РуководительДолжность      = Руководители.Должность;
				Результат.РуководительФИО            = Руководители.ФизическоеЛицо.Наименование;
				
				//+++Чирков 21.03.2026
				Результат.Вставить("Руководитель", Руководители.ФизическоеЛицо);
				//--Чирков 21.03.2026
			ИначеЕсли Руководители.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизации.ГлавныйБухгалтер Тогда
				Результат.ГлавныйБухгалтерФИО        = Руководители.ФизическоеЛицо.Наименование;
				//+++Чирков 21.03.2026
				Результат.Вставить("ГлавныйБухгалтер", Руководители.ФизическоеЛицо);
				//--Чирков 21.03.2026
			ИначеЕсли Руководители.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизации.Кассир Тогда
				Результат.КассирФИО            		 = Руководители.ФизическоеЛицо.Наименование;
				//+++Чирков 21.03.2026
				Результат.Вставить("Кассир", Руководители.ФизическоеЛицо);
				//--Чирков 21.03.2026
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//ПРОВЕРКА НАЛИЧИЯ РЕКВИЗИТОВ ОБЪЕКТОВ
// Позволяет определить есть ли среди реквизитов шапки документа
// реквизит с переданным именем.
//
// Параметры: 
//  ИмяРеквизита - строковое имя искомого реквизита, 
//  МетаданныеДокумента - объект описания метаданных документа, среди реквизитов которого производится поиск.
//
// Возвращаемое значение:
//  Истина - нашли реквизит с таким именем, Ложь - не нашли.
//
Функция ЕстьРеквизитДокумента(ИмяРеквизита, МетаданныеДокумента) Экспорт
	
	// Шворобей В.Ю. 18.05.2023 ++
	Для Каждого Элемент Из МетаданныеДокумента.СтандартныеРеквизиты Цикл
		Если Элемент.Имя = ИмяРеквизита Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	// Шворобей В.Ю. 18.05.2023 ++
	
	Если МетаданныеДокумента.Реквизиты.Найти(ИмяРеквизита) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли; 
	
КонецФункции // ЕстьРеквизитДокумента()

// Позволяет определить есть ли табличная часть документа с переданным именем.
//
// Параметры: 
//  ИмяТабЧасти - строковое имя искомой табличной части,
//  МетаданныеДокумента - объект описания метаданных документа, среди реквизитов которого производится поиск.
//
// Возвращаемое значение:
//  Истина - нашли реквизит с таким именем, Ложь - не нашли.
//
Функция ЕстьТабЧастьДокумента(ИмяТабЧасти, МетаданныеДокумента) Экспорт
	
	Если МетаданныеДокумента.ТабличныеЧасти.Найти(ИмяТабЧасти) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли; 
	
КонецФункции // ЕстьТабЧастьДокумента()

// Позволяет определить есть ли среди реквизитов шапки отчета
// реквизит с переданным именем.
//
// Параметры: 
//  ИмяРеквизита     - строковое имя искомого реквизита, 
//  МетаданныеОтчета - метаданные отчета, среди реквизитов которого производится поиск.
//
// Возвращаемое значение:
//  Истина - нашли реквизит с таким именем, Ложь - не нашли.
//
Функция ЕстьРеквизитОтчета(ИмяРеквизита, МетаданныеОтчета) Экспорт
	
	Если МетаданныеОтчета.Реквизиты.Найти(ИмяРеквизита) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли; 
	
КонецФункции // ЕстьРеквизитОтчета()

// Позволяет определить есть ли среди реквизитов табличной части документа
// реквизит с переданным именем.
//
// Параметры: 
//  ИмяРеквизита - строковое имя искомого реквизита, 
//  МетаданныеДокумента - объект описания метаданных документа, среди реквизитов которого производится поиск.
//  ИмяТабЧасти  - строковое имя табличной части документа, среди реквизитов которого производится поиск
//
// Возвращаемое значение:
//  Истина - нашли реквизит с таким именем, Ложь - не нашли.
//
Функция ЕстьРеквизитТабЧастиДокумента(ИмяРеквизита, МетаданныеДокумента, ИмяТабЧасти) Экспорт
	
	ТабЧасть = МетаданныеДокумента.ТабличныеЧасти.Найти(ИмяТабЧасти);
	Если ТабЧасть = Неопределено Тогда // Нет такой таб. части в документе
		Возврат Ложь;
	Иначе
		Если ТабЧасть.Реквизиты.Найти(ИмяРеквизита) = Неопределено Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции // ЕстьРеквизитТабЧастиДокумента()

Функция ПолучитьРеквизитОбъекта(Объект,ИмяРеквизита) Экспорт
	Если Объект=Неопределено Тогда Возврат Неопределено КонецЕсли; 
	Возврат ?(ЕстьРеквизитДокумента(ИмяРеквизита,Объект.Метаданные()),Объект[ИмяРеквизита],Неопределено);
КонецФункции // ПолучитьРеквизитОбъекта()

Функция ПолучитьКурсВалюты(Валюта, ДатаКурса) Экспорт
	
	Структура = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаКурса, Новый Структура("Валюта", Валюта));
	Возврат Структура;
	
КонецФункции // ПолучитьКурсВалюты()

Функция ПолучитьКурсВалюты_ПоРусски(Валюта, ДатаКурса) Экспорт
	Если Валюта=ПараметрыСеанса.ВалютаНац Тогда
		ТекВалюта=ПараметрыСеанса.ВалютаУпр_2009;	
	Иначе
		ТекВалюта=Валюта;		
	КонецЕсли;	
	Возврат ПолучитьКурсВалюты(ТекВалюта,ДатаКурса).Курс;
КонецФункции // ПолучитьКурсВалюты_ПоРусски()

// Выводит сообщение об ошибке и выставляет параметр Отказ в "Истина". 
// В случае работы на клиенте или на сервере выводит в окно сообщений,
// в случае внешнего соединения вызывает исключение.
//
// Параметры:
//  ТекстСообщения - строка, текст сообщения.
//  Отказ          - булево, признак отказа (необязательный).
//
Процедура СообщитьОбОшибке(ТекстСообщения, Отказ = Ложь, Заголовок = "") Экспорт
	
	ОкончаниеСлужебногоСообщения = Найти(ТекстСообщения, "}:");
	Если ОкончаниеСлужебногоСообщения > 0 И Лев(ТекстСообщения, 1) = "{" Тогда
		ТекстСообщения = СокрЛП(Сред(ТекстСообщения, (ОкончаниеСлужебногоСообщения + 2)));
	КонецЕсли;
	
	Отказ = Истина;
	
	#Если ВнешнееСоединение Тогда
		
		Если НЕ ЗначениеНеЗаполнено(Заголовок) Тогда
			ТекстСообщения = Заголовок + Символы.ПС + ТекстСообщения;
			Заголовок = "";
		КонецЕсли;
		
		ВызватьИсключение (ТекстСообщения);
		
	#Иначе
		
		Если НЕ ЗначениеНеЗаполнено(Заголовок) Тогда
			Сообщить(Заголовок);
			Заголовок = "";
		КонецЕсли;
		
		Сообщить(ТекстСообщения, СтатусСообщения.Важное);
		
	#КонецЕсли
	
КонецПроцедуры // СообщитьОбОшибке()

Процедура СообщениеОтладки(Сообщение) Экспорт
	#Если Клиент Тогда
		Если ПараметрыСеанса.Отладка Тогда
			Сообщить(Сообщение,СтатусСообщения.Информация);	
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

Процедура УстановитьРеквизитШапки(Объект,ИмяРеквизита,ЗначениеРеквизита,МетаданныеОбъекта=Неопределено) Экспорт
	Если МетаданныеОбъекта=Неопределено Тогда
		МетаданныеОбъекта = Объект.Метаданные();	
	КонецЕсли; 
	
	Если ЕстьРеквизитДокумента(ИмяРеквизита,МетаданныеОбъекта) Тогда
		Объект[ИмяРеквизита]=ЗначениеРеквизита;
	КонецЕсли;
КонецПроцедуры 

Процедура УстановитьНезаполненныйРеквизитШапки(Объект,ИмяРеквизита,ЗначениеРеквизита,МетаданныеОбъекта=Неопределено) Экспорт
	Если МетаданныеОбъекта=Неопределено Тогда
		МетаданныеОбъекта = Объект.Метаданные();	
	КонецЕсли; 
	
	Если ЕстьРеквизитДокумента(ИмяРеквизита,МетаданныеОбъекта) И ЗначениеНеЗаполнено(Объект[ИмяРеквизита]) Тогда
		Объект[ИмяРеквизита]=ЗначениеРеквизита;
	КонецЕсли;
КонецПроцедуры 

Функция ПолучитьИБПоУмолчанию() Экспорт
	ТекИБ=ПолучитьЗначениеПоУмолчанию("ОсновнаяИБ");
	Если ТекИБ.Пустая() Тогда
		ТекИБ=ПланыОбмена.Основной.ЭтотУзел().ИБ;	
	КонецЕсли;	
	Возврат ТекИБ;
КонецФункции // ()

Процедура ЗаполнитьШапкуДокумента(ДокументОбъект, ТекПользователь, ВалютаРегламентированногоУчета = Неопределено, ТипОперации = "") Экспорт
	Перем ТипЦен;
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	ВидДокумента		= МетаданныеДокумента.Имя;
	
	ОсновнойСклад		= ПолучитьЗначениеПоУмолчанию("ОсновнойСклад");	
	Если ЕстьРеквизитДокумента("ИБ",МетаданныеДокумента) И ДокументОбъект.ИБ.Пустая() Тогда		
		Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
			ТекИБ=Справочники.ИБ.НайтиПоКоду("SSP");
		Иначе			
			Если ЗначениеЗаполнено(ОсновнойСклад) И ЗначениеЗаполнено(ОсновнойСклад.ПрефиксИБ) Тогда
				ТекИБ=Справочники.ИБ.НайтиПоКоду(ОсновнойСклад.ПрефиксИБ);
			Иначе			
				ТекИБ=ПолучитьИБПоУмолчанию();			
			КонецЕсли;		
		КонецЕсли;		
		УстановитьРеквизитШапки(ДокументОбъект,"ИБ",							ТекИБ,													МетаданныеДокумента);
	КонецЕсли;	
	
	УстановитьРеквизитШапки(ДокументОбъект,"Автор",								ПараметрыСеанса.Пользователь,							МетаданныеДокумента);
	УстановитьНезаполненныйРеквизитШапки(ДокументОбъект,"Организация",			ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация"),		МетаданныеДокумента);
	УстановитьНезаполненныйРеквизитШапки(ДокументОбъект,"Отгружен",				Перечисления.Отгружен.Резерв,							МетаданныеДокумента);
	УстановитьНезаполненныйРеквизитШапки(ДокументОбъект,"СостояниеНакладной",	Перечисления.СостоянияНакладной.ВРаботе,				МетаданныеДокумента);
	
	Если ВидДокумента="Чек" Тогда
		УстановитьНезаполненныйРеквизитШапки(ДокументОбъект,"ВидОплаты",		ПолучитьЗначениеПоУмолчанию("ОсновнойВидОплатыДляЧеков"),	МетаданныеДокумента);
		Если ДокументОбъект.ВидОплаты.Пустая() Тогда
			ДокументОбъект.ВидОплаты=Перечисления.ВидыОплаты.НАЛ;		
		КонецЕсли; 
	Иначе
		УстановитьНезаполненныйРеквизитШапки(ДокументОбъект,"ВидОплаты",		ПолучитьЗначениеПоУмолчанию("ОсновнойВидОплаты"),			МетаданныеДокумента);	
	КонецЕсли;	
	
	//+++Чирков 2025.04.04
	//УстановитьНезаполненныйРеквизитШапки(ДокументОбъект,"Подразделение",		ПолучитьЗначениеПоУмолчанию("ОсновноеПодразделение"),	МетаданныеДокумента);
	УстановитьНезаполненныйРеквизитШапки(ДокументОбъект,"Подразделение",		ПодразделениеПоУмолчанию(),				МетаданныеДокумента);	
	//---Чирков 2025.04.04
	//+++Чирков 2025.05.10
	УстановитьНезаполненныйРеквизитШапки(ДокументОбъект,"РабочееМесто",			ПараметрыСеанса.РабочееМестоКлиента,	МетаданныеДокумента);
	//---Чирков 2025.05.10	
	
	УстановитьНезаполненныйРеквизитШапки(ДокументОбъект,"Склад",				ОсновнойСклад,											МетаданныеДокумента);
	УстановитьНезаполненныйРеквизитШапки(ДокументОбъект,"СкладОтправитель",		ПолучитьЗначениеПоУмолчанию("ОсновнойСклад"),			МетаданныеДокумента);
	УстановитьНезаполненныйРеквизитШапки(ДокументОбъект,"Касса",				ПолучитьЗначениеПоУмолчанию("ОсновнаяКасса"),			МетаданныеДокумента);
	УстановитьНезаполненныйРеквизитШапки(ДокументОбъект,"СтавкаНДС",			ПолучитьЗначениеПоУмолчанию("ОсновнаяСтавкаНДС"),		МетаданныеДокумента);
	УстановитьНезаполненныйРеквизитШапки(ДокументОбъект,"СостояниеДокументов",	Перечисления.СостояниеДокументов.НеВыписаны,			МетаданныеДокумента);
	
	Если ЕстьРеквизитДокумента("БанковскийСчет",МетаданныеДокумента) Тогда
		УстановитьНезаполненныйРеквизитШапки(ДокументОбъект,"БанковскийСчет",		ДокументОбъект.Организация.ОсновнойБанковскийСчет,		МетаданныеДокумента);	
	КонецЕсли;	
	
	Если ТипОперации = "Покупка" Тогда
		УстановитьНезаполненныйРеквизитШапки(ДокументОбъект,"Валюта",		ПолучитьЗначениеПоУмолчанию("ОсновнаяВалютаПокупки"),	МетаданныеДокумента);
		УстановитьНезаполненныйРеквизитШапки(ДокументОбъект,"Контрагент",	ПолучитьЗначениеПоУмолчанию("ОсновнойПоставщик"),		МетаданныеДокумента);		
		УстановитьНезаполненныйРеквизитШапки(ДокументОбъект,"ТипЦен",		ПолучитьЗначениеПоУмолчанию("ОсновнойТипЦенПокупки"),	МетаданныеДокумента);				
	ИначеЕсли ТипОперации = "Продажа" Тогда
		УстановитьНезаполненныйРеквизитШапки(ДокументОбъект,"Валюта",		ПолучитьЗначениеПоУмолчанию("ОсновнаяВалютаПродажи"),	МетаданныеДокумента);	
		УстановитьНезаполненныйРеквизитШапки(ДокументОбъект,"Контрагент",	ПолучитьЗначениеПоУмолчанию("ОсновнойПокупатель"),		МетаданныеДокумента);		
		УстановитьНезаполненныйРеквизитШапки(ДокументОбъект,"ТипЦен",		ПолучитьЗначениеПоУмолчанию("ОсновнойТипЦенПродажи"),	МетаданныеДокумента);
		УстановитьНезаполненныйРеквизитШапки(ДокументОбъект,"Отгружен",		Перечисления.Отгружен.Резерв 						,	МетаданныеДокумента);
	КонецЕсли;
	//кухарь 28.01.15 начало
	//поставим договор из основного договора контрагента
	Если ЕстьРеквизитДокумента("Контрагент",МетаданныеДокумента) Тогда
		если ЗначениеЗаполнено(ДокументОбъект.Контрагент) и  ТипЗнч(ДокументОбъект.Контрагент) = Тип("СправочникСсылка.Контрагенты") тогда
			УстановитьНезаполненныйРеквизитШапки(ДокументОбъект,"Договор",	ДокументОбъект.Контрагент.ОсновнойДоговор,	         	МетаданныеДокумента)
		КонецЕсли;
	КонецЕсли;
	
	//кухарь 28.01.15 конец
	
	
	УстановитьНезаполненныйРеквизитШапки(ДокументОбъект,"Валюта",			ПараметрыСеанса.ВалютаНац,								МетаданныеДокумента);
	
	Если ВидДокумента="ПереводСредств" Тогда		
		УстановитьНезаполненныйРеквизитШапки(ДокументОбъект,"Источник_Контрагент",	Справочники.ФизическиеЛица.ПустаяСсылка(),		МетаданныеДокумента);			
		УстановитьНезаполненныйРеквизитШапки(ДокументОбъект,"Получатель_Контрагент",Справочники.ФизическиеЛица.ПустаяСсылка(),		МетаданныеДокумента);
	КонецЕсли; 
	
	Если ЕстьРеквизитДокумента("Курс", МетаданныеДокумента) И ЕстьРеквизитДокумента("Валюта", МетаданныеДокумента) И (ЗначениеНеЗаполнено(ДокументОбъект.Курс)) Тогда
		Доллары=Справочники.Валюты.НайтиПоКоду("840");
		
		ТекВалюта=?(ДокументОбъект.Валюта=ПараметрыСеанса.ВалютаНац,Доллары,ДокументОбъект.Валюта);//по исторически сложившейся традиции для рублей указывается курс доллара
		
		СтруктураКурсаДокумента      = ПолучитьКурсВалюты(ТекВалюта, ДокументОбъект.Дата);
		ДокументОбъект.Курс			 = СтруктураКурсаДокумента.Курс;
	КонецЕсли;	
	
	Если ЕстьРеквизитДокумента("Склад",МетаданныеДокумента) И НЕ ДокументОбъект.Склад.Пустая() Тогда		
		Если ЕстьРеквизитДокумента("Организация",МетаданныеДокумента) И ДокументОбъект.Организация.Пустая() Тогда
			ДокументОбъект.Организация=ДокументОбъект.Склад.Организация;		
		КонецЕсли;		
	КонецЕсли;	
	
	//крохин
	Если ВидДокумента="РасходныйКассовыйОрдер" ИЛИ ВидДокумента = "ПриходныйКассовыйОрдер" Тогда		
		УстановитьРеквизитШапки(ДокументОбъект,"Кассир",ПараметрыСеанса.Пользователь.ФизЛицо,МетаданныеДокумента);
	КонецЕсли; 
	Если ВидДокумента="ПереводСредств" Тогда		
		УстановитьРеквизитШапки(ДокументОбъект,"Источник_Контрагент",ПараметрыСеанса.Пользователь.ФизЛицо,МетаданныеДокумента);
	КонецЕсли; 
	Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		Если ВидДокумента="РасходныйКассовыйОрдер"  Тогда	
			УстановитьРеквизитШапки(ДокументОбъект,"ВидОперации",Перечисления.ВидыОперацийРКО.РасходДенежныхСредствПрочее,МетаданныеДокумента);	
		ИначеЕсли ВидДокумента = "ПриходныйКассовыйОрдер" Тогда
			УстановитьРеквизитШапки(ДокументОбъект,"ВидОперации",Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствПрочее,МетаданныеДокумента);
		Иначеесли ВидДокумента="ПереводСредств" Тогда
			УстановитьРеквизитШапки(ДокументОбъект,"ВидОперации",Перечисления.ВидыОперацийПС.ПрочийПеревод,МетаданныеДокумента);
		КонецЕсли;
	КонецЕсли;
	
	//крохин
КонецПроцедуры

Функция ПодразделениеПоУмолчанию()
	Результат = ПолучитьЗначениеПоУмолчанию("ОсновноеПодразделение");
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла();					
	КонецЕсли;                                                              
	Возврат Результат;
КонецФункции //ПодразделениеПоУмолчанию()


// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  ДокументОбъект             - объект проводимого документа, 
//  СтруктураОбязательныхПолей - структура, содержащая имена полей, которые собственно и надо проверить.
//  Отказ                      - флаг отказа в проведении.
//  Заголовок                  - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапкиДокумента(ДокументОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок) Экспорт
	МетаданныеРеквизиты = ДокументОбъект.Метаданные().Реквизиты;
	
	Для каждого КлючЗначение Из СтруктураОбязательныхПолей Цикл
		
		Значение = ДокументОбъект[КлючЗначение.Ключ];
		Если ЗначениеНеЗаполнено(Значение) Тогда // надо ругаться
			
			Если ЗначениеНеЗаполнено(КлючЗначение.Значение) Тогда //стандартное ругательство
				Если КлючЗначение.Ключ="Код" ИЛИ КлючЗначение.Ключ="Наименование" ИЛИ КлючЗначение.Ключ="Номер" ИЛИ КлючЗначение.Ключ="Дата" Тогда
					ПредставлениеРеквизита = КлючЗначение.Ключ;
				Иначе
					ПредставлениеРеквизита = МетаданныеРеквизиты[КлючЗначение.Ключ].Представление();				
				КонецЕсли; 				
				СтрокаСообщения = "Не заполнено значение реквизита """ + СокрЛП(ПредставлениеРеквизита) + """!";
			Иначе
				СтрокаСообщения = КлючЗначение.Значение;
			КонецЕсли;
			СообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПроверитьЗаполнениеШапкиДокумента()

// Проверяет правильность заполнения строк табличной части документа.
// Если какой-то из реквизтов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
//
// Параметры:
//  ДокументОбъект             - объект проводимого документа, 
//  ИмяТабличнойЧасти          - табличная часть документа,
//  СтруктураОбязательныхПолей - структура, содержащая имена полей, которые собственно и надо проверить.
//  Отказ                      - флаг отказа в проведении.
//  Заголовок                  - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧасти(ДокументОбъект, ИмяТабличнойЧасти, СтруктураОбязательныхПолей,Отказ, Заголовок) Экспорт
	
	Если ТипЗнч(СтруктураОбязательныхПолей)=Тип("Строка") Тогда
		СтруктураОбязательныхПолей=Новый Структура(СтруктураОбязательныхПолей);
	КонецЕсли;
	
	ПредставлениеТабличнойЧасти = ДокументОбъект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Представление();
	ТабличнаяЧасть 				= ДокументОбъект[ИмяТабличнойЧасти];
	МетаданныеРеквизиты 		= ДокументОбъект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Реквизиты;
	
	// Цмкл по строкам табличной части.
	Для каждого СтрокаТаблицы Из ТабличнаяЧасть Цикл
		
		СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТаблицы.НомерСтроки) +
		""" табличной части """ + ПредставлениеТабличнойЧасти + """: ";
		
		// Цмкл по проверяемым полям
		Для каждого КлючЗначение Из СтруктураОбязательныхПолей Цикл
			
			Значение = СтрокаТаблицы[КлючЗначение.Ключ];
			Если ЗначениеНеЗаполнено(Значение) Тогда // надо ругаться
				
				Если ЗначениеНеЗаполнено(КлючЗначение.Значение) Тогда //стандартное ругательство
					ПредставлениеРеквизита = МетаданныеРеквизиты[КлючЗначение.Ключ].Представление();
					СтрокаСообщения = "Не заполнено значение реквизита """ + СокрЛП(ПредставлениеРеквизита) + """!";
				Иначе
					СтрокаСообщения = КлючЗначение.Значение;
				КонецЕсли;
				СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Проверяет соответствие склада и организации
Процедура ПроверитьСоответствиеСклада(Организация,Склад,Отказ,Заголовок="") Экспорт
	Если Склад.Организация<>Организация Тогда		
		СообщитьОбОшибке("Склад: """+Склад+""" не относится к организации: """+Организация+""" !",Отказ,Заголовок);		
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПРОВЕРКИ НАЛИЧИЯ И ЗАПОЛНЕНИЯ РЕВИЗИТОВ

// Определяет заполнено ли переданное значение
//
// Параметры: 
//  Значение - значение, заполенение которого надо проверить
//
// Возвращаемое значение:
//  Истина - значение не заполнено, ложь - иначе.
//
Функция ЗначениеНеЗаполнено(Значение) Экспорт
	
	Результат = Ложь;
	ТипЗначения = ТипЗнч(Значение);
	
	// Сначала примитивные типы
	Если Значение = Неопределено Тогда
		Результат = Истина;
	ИначеЕсли Значение = NULL Тогда
		Результат = Истина;
	ИначеЕсли ТипЗначения = Тип("Строка") Тогда
		Если СокрЛП(Значение) = "" Тогда
			Результат = Истина;
		КонецЕсли; 
	ИначеЕсли ТипЗначения = Тип("Число") Тогда
		Если Значение = 0 Тогда
			Результат = Истина;
		КонецЕсли; 
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		Если Значение = Дата('00010101') Тогда
			Результат = Истина;
		КонецЕсли; 
	ИначеЕсли ТипЗначения = Тип("Булево") Тогда
		Результат = Ложь; // Булево будем считать не пустым
		
		//Отдельное определение, так как конструкторов данного типа не существует	
	ИначеЕсли ТипЗначения = Тип("РежимПроведенияДокумента") Тогда
		Если Значение = РежимПроведенияДокумента.Неоперативный или Значение = РежимПроведенияДокумента.Оперативный тогда
			Результат = Ложь;
		КонецЕсли;
	ИначеЕсли ТипЗначения=Тип("ОбъектМетаданных") Тогда
		Возврат Ложь;		
	ИначеЕсли ТипЗначения=Тип("СтрокаТаблицыЗначений") Тогда
		Возврат Ложь;
		// Для остальных будем считать значение пустым, если оно равно
		// дефолтному значению своего типа
	Иначе
		Если Значение = Новый(ТипЗначения) Тогда
			Результат = Истина;
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции // ЗначениеНеЗаполнено()

// Предназначена для получения пустого значения заданного типа:
//	примитивного, или ссылочного. Используется
//
// Параметры:
//	ЗаданныйТип   - тип, пустое значение которого нужно получить
//
Функция ПустоеЗначениеТипа(ЗаданныйТип) Экспорт
	
	Если ЗаданныйТип = Тип("Число") Тогда
		Возврат 0;
	ИначеЕсли ЗаданныйТип = Тип("Строка") Тогда
		Возврат "";
	ИначеЕсли ЗаданныйТип = Тип("Дата") Тогда
		Возврат '00010101000000';
	ИначеЕсли ЗаданныйТип = Тип("Булево") Тогда
		Возврат Ложь;
	Иначе
		Возврат Новый (ЗаданныйТип);
	КонецЕсли;
	
КонецФункции // ПустоеЗначениеТипа();


// Функция проверяет наличие в строке только цифр
//
// Параметры
//  СтрокаПроверки - Строка для проверки только цифр
//
// Возвращаемое значение:
//   Булево
//
Функция ЕстьНеЦифры(Знач СтрокаПроверки) Экспорт
	
	СписокКодовЧисел = Новый СписокЗначений;
	Для а = 48 По 57 Цикл
		СписокКодовЧисел.Добавить(а);
	КонецЦикла; 
	
	СтрокаПроверки = СокрЛП(СтрокаПроверки);
	
	Если ТипЗнч(СтрокаПроверки) <> Тип("Строка") Тогда
		
		Возврат Истина;
		
	Иначе
		
		Для а = 1 По СтрДлина(СтрокаПроверки) Цикл
			Если СписокКодовЧисел.НайтиПоЗначению(КодСимвола(Сред(СтрокаПроверки, а, 1))) = Неопределено Тогда
				Возврат Истина;
			КонецЕсли; 
		КонецЦикла; 
		
	КонецЕсли; 
	
	Возврат Ложь;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С МЕТАДАННЫМИ

// Функция возвращает имя табличной части, к которой принадлежит переданная строка
//
// Параметры
//  СтрокаТабличнойЧасти - ссылка на строку табличной части
//
// Возвращаемое значение:
//   Строка - имя табличной части, как оно задано в конфигураторе
//
Функция ПолучитьИмяТабличнойЧастиПоСсылкеНаСтроку(СтрокаТабличнойЧасти) Экспорт
	
	ИмяТабличнойЧасти = Метаданные.НайтиПоТипу(ТипЗнч(СтрокаТабличнойЧасти)).Имя;
	Возврат ИмяТабличнойЧасти;
	
КонецФункции // ПолучитьИмяТабличнойЧастиПоСсылкеНаСтроку()

// Функция возвращает метаданные документа, которому принадлежит переданная строка
//
// Параметры
//  СтрокаТабличнойЧасти - ссылка на строку табличной части
//
// Возвращаемое значение:
//   Метаданные - метаданные документа, как оно задано в конфигураторе
//
Функция ПолучитьМетаданныеДокументаПоСсылкеНаСтроку(СтрокаТабличнойЧасти) Экспорт
	
	МетаданныеДокумента = Метаданные.НайтиПоТипу(ТипЗнч(СтрокаТабличнойЧасти)).Родитель();
	Возврат МетаданныеДокумента;
	
КонецФункции // ПолучитьМетаданныеДокументаПоСсылкеНаСтроку()

Функция УстановитьСправочник(Вид,Код="",Наименование="",Поиск="Код",ЭтоГруппа=Ложь,Родитель=Неопределено,Владелец=Неопределено,Реквизиты="",ПерезаписыватьРеквизиты=Ложь) Экспорт
	СпрМен=Справочники[Вид];
	
	Если Поиск="Код" Тогда // поиск по коду
		Если Не(ПустаяСтрока(""+Код)) Тогда
			Если Метаданные.Справочники[Вид].СерииКодов=Метаданные.СвойстваОбъектов.СерииКодовСправочника.ВоВсемСправочнике Тогда
				СпрПол=СпрМен.НайтиПоКоду(Код,Ложь);
			Иначе
				СпрПол=СпрМен.НайтиПоКоду(Код,Ложь,Родитель,Владелец);			
			КонецЕсли;			
		Иначе
			Возврат СпрМен.ПустаяСсылка();
		КонецЕсли;		
	ИначеЕсли Поиск="Наименование" Тогда   
		Если Не(ПустаяСтрока(""+Наименование)) Тогда
			СпрПол=СпрМен.НайтиПоНаименованию(Наименование,Истина,Родитель,Владелец);
		Иначе
			Возврат СпрМен.ПустаяСсылка();			
		КонецЕсли;		
	Иначе
		РеквизитПоиска	=Реквизиты[Поиск];
		СпрПол			=СпрМен.НайтиПоРеквизиту(Поиск,РеквизитПоиска,Родитель,Владелец);		
	КонецЕсли;
	
	Если СпрПол.Пустая() Тогда 
		Если ЭтоГруппа Тогда
			СпрПол=СпрМен.СоздатьГруппу();			
		Иначе
			СпрПол=СпрМен.СоздатьЭлемент();	
		КонецЕсли; 	
	Иначе
		Если Не(ПерезаписыватьРеквизиты) Тогда			
			Возврат СпрПол.Ссылка 
		Иначе
			СпрПол=СпрПол.ПолучитьОбъект();			
		КонецЕсли;
	КонецЕсли;	
	
	Если Не(ПустаяСтрока(Код)) Тогда		
		СпрПол.Код=Код;
	КонецЕсли;
	Если Не(ПустаяСтрока(Наименование)) Тогда
		СпрПол.Наименование	=Наименование;
	КонецЕсли;	
	
	Если Родитель<>Неопределено Тогда
		СпрПол.Родитель=Родитель;	
	КонецЕсли;
	Если Владелец<>Неопределено Тогда
		СпрПол.Владелец=Владелец;	
	КонецЕсли;
	
	Если ПустаяСтрока(Реквизиты)=0 Тогда	
		Для Каждого Реквизит Из Реквизиты Цикл
			Попытка
				СпрПол[Реквизит.Ключ]=Реквизит.Значение;
			Исключение
			КонецПопытки;			
		КонецЦикла; 		
	КонецЕсли; 
	
	Попытка
		СпрПол.Записать();
	Исключение
		Сообщить("Ошибка записи эл-та справочника """+Вид+""" ! Код: "+Код+", наименование: "+Наименование);
		Сообщить("                 "+ОписаниеОшибки());
		Возврат "";
	КонецПопытки;
	Возврат СпрПол.Ссылка;
КонецФункции 


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ТИПАМИ

// Служебная функция, предназначенная для получения описания типов строки, заданной длины.
// 
// Параметры:
//  ДлинаСтроки - число, длина строки.
//
// Возвращаемое значение:
//  Объект "ОписаниеТипов" для строки указанной длины.
//
Функция ПолучитьОписаниеТиповСтроки(ДлинаСтроки) Экспорт
	
	Массив = Новый Массив; 
	Массив.Добавить(Тип("Строка"));
	КвалификаторСтроки = Новый КвалификаторыСтроки(ДлинаСтроки, ДопустимаяДлина.Переменная);
	Возврат Новый ОписаниеТипов(Массив, , КвалификаторСтроки);
	
КонецФункции // ПолучитьОписаниеТиповСтроки()	 

// Служебная функция, предназначенная для получения описания типов числа, заданной разрядности.
// 
// Параметры:
//  Разрядность 			- число, разряд числа.
//  РазрядностьДробнойЧасти - число, разряд дробной части.
//
// Возвращаемое значение:
//  Объект "ОписаниеТипов" для числа указанной разрядности.
//
Функция ПолучитьОписаниеТиповЧисла(Разрядность,РазрядностьДробнойЧасти=0) Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	КвалификаторЧисла = Новый КвалификаторыЧисла(Разрядность,РазрядностьДробнойЧасти);
	Возврат Новый ОписаниеТипов(Массив, КвалификаторЧисла);
	
КонецФункции	// ПолучитьОписаниеТиповЧисла() 

// Служебная функция, предназначенная для получения описания типов даты
// 
// Параметры:
//  ЧастиДаты - системное перечисление ЧастиДаты.
// 
Функция ПолучитьОписаниеТиповДаты(ЧастиДаты) Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Дата"));
	КвалификаторДаты = Новый КвалификаторыДаты(ЧастиДаты);
	Возврат Новый ОписаниеТипов(Массив, , , КвалификаторДаты);
	
КонецФункции	// ПолучитьОписаниеТиповДаты() 

// Служебная функция - возвращает принадлежность объекта метаданных определенному классу
// 
// Параметры:
//	Класс  - класс
//	Объект - объект метаданных
// 
Функция ПринадлежностьКлассуМетаданных(Класс, Объект) Экспорт
	Для Каждого МДОбъект Из Метаданные[Класс] Цикл
		Если МДОбъект = Объект Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции // ПринадлежностьКлассуМетаданных()

// Служебная функция, предназначенная для получения описания типов набора записей по объекту метаданных
// Параметры:
//	Объект - объект метаданных
//
// Возвращаемое значение:
// Описание типов с единственным типом набора записей
//
Функция ПолучитьОписаниеТиповНабораЗаписей(Объект) Экспорт
	
	Массив = Новый Массив;
	Если ПринадлежностьКлассуМетаданных("РегистрыРасчета", Объект) Тогда
		Массив.Добавить(Тип("РегистрРасчетаНаборЗаписей."+Объект.Имя));
	ИначеЕсли ПринадлежностьКлассуМетаданных("РегистрыБухгалтерии", Объект) Тогда
		Массив.Добавить(Тип("РегистрБухгалтерииНаборЗаписей."+Объект.Имя));
	ИначеЕсли ПринадлежностьКлассуМетаданных("РегистрыНакопления", Объект) Тогда
		Массив.Добавить(Тип("РегистрНакопленияНаборЗаписей."+Объект.Имя));
	ИначеЕсли ПринадлежностьКлассуМетаданных("РегистрыСведений", Объект) Тогда
		Массив.Добавить(Тип("РегистрСведенийНаборЗаписей."+Объект.Имя));
	КонецЕсли;
	Возврат Новый ОписаниеТипов(Массив);
	
КонецФункции  // ПолучитьОписаниеТиповНабораЗаписей()

Функция ТипОбъекта(Объект,МетаОбъект="") Экспорт
	ТипОбъекта = ТипЗнч(Объект);
	
	Если ТипОбъекта=Тип("Строка") ИЛИ ТипОбъекта=Тип("Дата") ИЛИ ТипОбъекта=Тип("Число") ИЛИ ТипОбъекта=Тип("Булево") Тогда
		Возврат ""+ТипОбъекта;	
	КонецЕсли; 
	
	Если ТипОбъекта=Тип("ОбъектМетаданных") Тогда
		МетаОбъект=Объект;
	ИначеЕсли ТипОбъекта=Тип("Тип") Тогда
		МетаОбъект=Метаданные.НайтиПоТипу(Объект);
	Иначе
		МетаОбъект=Метаданные.НайтиПоТипу(ТипОбъекта);	
	КонецЕсли;	
	
	Если МетаОбъект<>Неопределено Тогда
		ПолноеИмя=МетаОбъект.ПолноеИмя();
		Поз=Найти(ПолноеИмя,".");
		Если Поз<>0 Тогда
			Возврат Лев(ПолноеИмя,Поз-1);		
		Иначе
			Возврат "ПокаНеопределенный";		
		КонецЕсли;		
	Иначе
		Если ТипОбъекта=Тип("УдалениеОбъекта") Тогда
			Возврат "Удаление";
		ИначеЕсли ТипОбъекта=Тип("Структура")  Тогда
			Возврат "Структура";		
		ИначеЕсли ТипОбъекта=Тип("Соответствие")  Тогда
			Возврат "Соответствие";		
		ИначеЕсли ТипОбъекта=Тип("СписокЗначений")  Тогда
			Возврат "СписокЗначений";		
		ИначеЕсли ТипОбъекта=Тип("ТаблицаЗначений") Тогда
			Возврат "ТаблицаЗначений";
		ИначеЕсли ТипОбъекта=Тип("Тип") Тогда
			Возврат ""+Объект;
		Иначе			
			Возврат ""+ТипОбъекта;
		КонецЕсли;	
	КонецЕсли;
	
КонецФункции // ТипОбъекта()

Функция МетаЗначениеПеречисления(Значение) Экспорт
	ИмяПеречисления				=Значение.Метаданные().Имя;
	ИндексЗначенияПеречисления	=Перечисления[ИмяПеречисления].Индекс(Значение);
	
	Возврат Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначенияПеречисления];
КонецФункции // ИмяЗначенияПеречисления()

//СФ

//нечаева 29,08,16+++
//КСФ может быть к РКМ КЦН РНК
Функция КСчетФактураНакладной(РНК,Организация=Неопределено) Экспорт	
	
	КСФ= документы.КорректировочныйСчетФактура.ПустаяСсылка();
	
	//для кцн и РКМ
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	СчетФактура.Ссылка
	|ИЗ
	|	Документ.КорректировочныйСчетФактура КАК СчетФактура
	|ГДЕ
	//|	Организация = &Организация
	//Кухарь 10.12.19 начало
	//Опечатка
	//крохин начало 16.12.2019
	//| не СчетФактура.ПометкаУдаления и
	| СчетФактура.проведен и
	//крохин конец 16.12.2019
	//Кухарь 10.12.19 конец	
	|	Накладные.Накладная = &РНК";	
	
	//Зрос.УстановитьПараметр("Организация",?(Организация=Неопределено,РНК.Организация,Организация));
	Запрос.УстановитьПараметр("РНК",РНК);
	
	Если РНК.метаданные().ИМя = "РасходнаяНакладная" Тогда
		//для РНК
		Запрос.Текст="ВЫБРАТЬ
		|	СчетФактура.Ссылка
		|ИЗ
		|	Документ.КорректировочныйСчетФактура КАК СчетФактура
		//крохин начало 16.12.2019
		////Кухарь 10.12.19 начало
		////Опечатка
		//| не СчетФактура.ПометкаУдаления и
		////Кухарь 10.12.19 конец	
		//
		//|ГДЕ
		|ГДЕ
		| СчетФактура.Проведен и
		//крохин конец 16.12.2019
		|	СчетФактура.Накладные.Накладная.ДокОснование = &РНК";		
	КонецЕсли;	
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла; 
	
	Возврат КСФ;
	
КонецФункции // СчетФактураНакладной()
//крохин конец 26.08.2019


Функция СчетФактураНакладной(РНК,Организация=Неопределено) Экспорт	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	СчетФактура.Ссылка
	|ИЗ
	|	Документ.СчетФактура КАК СчетФактура
	|ГДЕ
	|	НЕ Ссылка.ПометкаУдаления
	|	И Организация = &Организация
	|	И Накладные.Накладная = &РНК";	
	
	Запрос.УстановитьПараметр("Организация",?(Организация=Неопределено,РНК.Организация,Организация));
	Запрос.УстановитьПараметр("РНК",РНК);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла; 
	
	Возврат Документы.СчетФактура.ПустаяСсылка();
КонецФункции // СчетФактураНакладной()


// Нечаева 10,06,24+++
Функция УПДНакладной(РНК,Организация=Неопределено) Экспорт	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	УПД.Ссылка
	|ИЗ
	|	Документ.УПД КАК УПД
	|ГДЕ
	|	НЕ Ссылка.ПометкаУдаления
	|	И Организация = &Организация
	|	И ДокОснование = &РНК";	
	
	Запрос.УстановитьПараметр("Организация",?(Организация=Неопределено,РНК.Организация,Организация));
	Запрос.УстановитьПараметр("РНК",РНК);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла; 
	
	Возврат Документы.УПД.ПустаяСсылка();
КонецФункции // УПДНакладной()
// Нечаева 10,06,24---


Функция ДублиНакладныхВСФ(СФ)Экспорт
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ТекущаяСФ.Ссылка КАК ТекущаяСФ,	
	|	ТекущаяСФ.РасходнаяНакладная КАК РНК,	
	|	1 КАК КоличествоРНК,
	|	ОстальныеСФ.Ссылка КАК ДругаяСФ 
	|ИЗ
	|	Документ.СчетФактура.Накладные КАК ТекущаяСФ
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.СчетФактура.Накладные КАК ОстальныеСФ
	|ПО
	|	ТекущаяСФ.РасходнаяНакладная = ОстальныеСФ.РасходнаяНакладная И
	|	ТекущаяСФ.Ссылка<>ОстальныеСФ.Ссылка	
	|ГДЕ
	|	ТекущаяСФ.Ссылка=&СФ
	|УПОРЯДОЧИТЬ ПО РНК"
	;
	
	Запрос.УстановитьПараметр("СФ",СФ);	
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // ДругиеСчетаФактурыНакладной()

Функция НомерБезПрефикса(Номер) Экспорт
	Поз=Найти(Номер,"-");
	Если Поз<>0 Тогда
		Возврат Сред(Номер,Поз+1); 	
	КонецЕсли; 
	Возврат Номер;
КонецФункции // НомерБезПрефикса()


Функция СложитьТаблицы(ТП,ТИ) Экспорт
	Для Каждого СтрокаТИ Из ТИ Цикл
		СтрокаТП=ТП.Добавить();
		Для Каждого Колонка Из ТИ.Колонки Цикл
			СтрокаТП[Колонка.Имя]=СтрокаТИ[Колонка.Имя];		
		КонецЦикла; 
	КонецЦикла;
	
	Возврат ТП;
КонецФункции // СложитьТаблицы()

Функция ПолучитьПериодРедактированияПоПользователю(Пользрватель,ВидДокумента,ПериодРедактирования)
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ	
	|	ПериодРедактирования
	|ИЗ
	|	Справочник.Пользователи.ДатыЗапрета
	|ГДЕ
	|	Ссылка = &Пользрватель
	|	И ВидДокумента = &ВидДокумента
	|";
	
	Запрос.УстановитьПараметр("Пользрватель",Пользрватель);
	Запрос.УстановитьПараметр("ВидДокумента",ВидДокумента);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПериодРедактирования;	
	Иначе
		Возврат ПериодРедактирования;
	КонецЕсли;
КонецФункции // ()


Функция ПолучитьДатуЗапретаРедактирования(Ссылка,Знач Пользователь=Неопределено) Экспорт
	Пользователь=?(Пользователь=Неопределено,ПараметрыСеанса.Пользователь,Пользователь);	
	
	ПериодРедактирования					=ПолучитьПолномочиеПользователя("ПериодРедактированияДокументов",Пользователь);	
	ПерсональнаяДатаЗапретаРедактирования	=ПолучитьПолномочиеПользователя("ПерсональнаяДатаЗапретаРедактирования",Пользователь);	
	
	МетаДок=Ссылка.Метаданные();
	
	ВидДокумента=МетаДок.Имя;
	
	ПериодРедактирования=ПолучитьПериодРедактированияПоПользователю(Пользователь,ВидДокумента,ПериодРедактирования);	 	
	
	Если ЕстьРеквизитДокумента("Склад",МетаДок) Тогда
		КонстантаЗапрета=Макс(Ссылка.Склад.ДатаЗапретаРедактирования,Константы.ДатаЗапретаРедактирования.Получить());
	Иначе
		КонстантаЗапрета=Константы.ДатаЗапретаРедактирования.Получить();	
	КонецЕсли;	
	
	ДатаЗапрета=Макс(?(ПериодРедактирования=0,КонстантаЗапрета,ТекущаяДата()-ПериодРедактирования*24*60*60),КонстантаЗапрета);
	
	Если НЕ ЗначениеНеЗаполнено(ПерсональнаяДатаЗапретаРедактирования) Тогда
		ДатаЗапрета=Мин(ПерсональнаяДатаЗапретаРедактирования,ДатаЗапрета);	
	КонецЕсли;
	
	//	Если МетаДок.Имя="ЗаказПоставщику" ИЛИ МетаДок.Имя="Машина" Тогда
	
	// Нечаева 15,01,26 ++ OUT-179 просто план продаж - учитываем дату запрета.
	//Если Найти("Матрица,ПланПродажПоКлиентам",МетаДок.Имя)<>0  Тогда 
	Если Найти("Матрица,ПланПродажПоКлиентам",МетаДок.Имя)<>0 и не ВидДокумента = "ПланПродаж" Тогда 
	// Нечаева 15,01,26 -- OUT-179
	
		ДатаЗапрета='00010101';	
	КонецЕсли; 
	
	//крохин начало 19.02.2020
	//для КП открытый период больше стандартного на 90 дней
	//крохин начало 17.03.2020
	//для установки скидок такая же ДЗР
	//Если МетаДок.Имя = "КонтрактСПроизводителем" Тогда
	//крохин начало 11.05.2021
	//для заказов такая же ДЗР
	//Если МетаДок.Имя = "КонтрактСПроизводителем" ИЛИ МетаДок.Имя = "УстановкаСкидокПоКонтрагентам" Тогда
	ИмяМетаданныхДокумента = МетаДок.Имя;
	Если ИмяМетаданныхДокумента = "КонтрактСПроизводителем" ИЛИ ИмяМетаданныхДокумента = "УстановкаСкидокПоКонтрагентам" Тогда //ИЛИ ИмяМетаданныхДокумента = "Заказ" Тогда	
		//крохин конец 	11.05.2021
		//крохин конец 17.03.2020
		//крохин начало 28.12.2021
		//ДатаЗапрета = ДатаЗапрета - 90*24*60*60;
		//крохин начало 23.05.2023
		//ДатаЗапрета = ДатаЗапрета - 120*24*60*60;
		ДатаЗапрета = ДатаЗапрета - 365*24*60*60;
		//крохин конец 23.05.2023
		//крохин конец 28.12.2021
		//+++Чирков 16.10.2025 - унификация ДЗР по маркировке	
	ИначеЕсли ИмяМетаданныхДокумента = "МаркировкаТоваровИСМП" 
		ИЛИ ИмяМетаданныхДокумента = "УстановкаСтатусаКМ"
		ИЛИ ИмяМетаданныхДокумента = "ХранилищеКодовМаркировки" Тогда
		ДатаЗапрета = ДатаЗапрета - 14*24*60*60;
		//---Чирков 16.10.2025 - унификация ДЗР по маркировке
	//+++Чирков 30.03.2026 - ДЗР по авансовым РНК
	//+++Чирков 14.04.2026 - по просьбе Александра Крохина контроль переделан на проверку даты запрета
	//ИначеЕсли ИмяМетаданныхДокумента = "РасходнаяНакладная" Тогда	
	//	Если НЕ ЗначениеЗаполнено(ПерсональнаяДатаЗапретаРедактирования) Тогда			
	//		Если ТипЗнч(Ссылка) = Тип("ДокументОбъект.РасходнаяНакладная") Тогда
	//			Договор = Ссылка.Договор;
	//		Иначе
	//			Договор = ПолучитьРеквизитШапки(Ссылка, "Договор");
	//		КонецЕсли;
	//		
	//		Если Справочники.Договоры.ЭтоДоговорПродажиСПредоплатой(Ссылка.Договор) Тогда
	//			ДЗР_Авансы = Константы.ДатаЗапретаРедактированияРНКпоАвансовымДоговорам.Получить();
	//			Если ДатаЗапрета < ДЗР_Авансы Тогда
	//				ДатаЗапрета = ДЗР_Авансы;							
	//			КонецЕсли;			
	//		КонецЕсли;			
	//	КонецЕсли;
	//---Чирков 14.04.2026 - по просьбе Александра Крохина контроль переделан на проверку даты запрета
	//---Чирков 30.03.2026 - ДЗР по авансовым РНК 	
	КонецЕсли;
	//крохин конец 19.02.2020
	//++Данилова Е.В. 12.12.2024
	Если ИмяМетаданныхДокумента = "Заказ" 
		И Ссылка.КодОперации = Перечисления.КодыОперацийОстатки.АгентскийДоговор Тогда
		
		ДатаЗапрета = ДатаЗапрета - 365*24*60*60;
		
	КонецЕсли;
	//--Данилова Е.В. 12.12.2024
	
	Возврат КонецДня(ДатаЗапрета);
КонецФункции // ПолучитьДатуЗапретаРедактирования(Пользователь)

Функция КонтрольИзмененийПриЗаписи(Документ,ДопПараметры=Неопределено)
	
	Возврат Истина;
КонецФункции // КонтрольИзмененийПриЗаписи()

Функция КонтрольДатыЗапрета(Документ,Отказ=Ложь,ВывестиСообщение=Истина) Экспорт
	Если Отказ Тогда Возврат Ложь КонецЕсли; //И так уже нельзя
	Если ПараметрыСеанса.ОтключитьКонтрольДЗР Тогда Возврат Истина КонецЕсли; 
	
	ВидДокумента=Документ.Метаданные().Имя;
	Если ВидДокумента="УстановкаСкидок" или ВидДокумента="Контейнер" Тогда 
		Возврат Истина; //по просьбе Крохина не проверяем
	ИначеЕсли ВидДокумента="ПрайсЛист" Тогда 
		Возврат Истина;
	ИначеЕсли ВидДокумента = "РасходнаяНакладная" Тогда
		Если ТипЗнч(Документ) = Тип("ДокументОбъект.РасходнаяНакладная") Тогда
			РНК_Ссылка = Документ.Ссылка;
		Иначе
			РНК_Ссылка = Документ;			
		КонецЕсли;
		Если НЕ МожноРедактироватьРНКсАвансами(РНК_Ссылка) Тогда
			Отказ = Истина;
			#Если Клиент Тогда
			Если ВывестиСообщение Тогда                                          				
				Сообщить("Дата документа меньше ДЗР по предоплатным договорам ! Документ не записан !", СтатусСообщения.Важное);
			КонецЕсли;			
			#КонецЕсли
			Возврат Ложь;					
		КонецЕсли;
	КонецЕсли;
	
	Если Документ.Дата<=ПолучитьДатуЗапретаРедактирования(Документ) Тогда
		Отказ=Истина;
		#Если Клиент Тогда
			Если ВывестиСообщение Тогда
				Сообщить("Дата документа меньше даты запрета редактирования ! Документ не записан !",СтатусСообщения.Важное);			
			КонецЕсли;			
		#КонецЕсли
		Возврат Ложь;		
	КонецЕсли;
	Возврат Истина; //Можно записывать
КонецФункции// КонтрольДатыЗапрета() 


Функция ПолучитьПараметрыДоступаКДокументамПоСкладу(Склад) Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	РедактированиеДокументов КАК Редактирование,
	|	ПросмотрДокументов КАК Просмотр,
	|	ОтгрузкаСоСклада КАК Отгрузка,
	|	ПриемкаНаСклад КАК Приемка
	|ИЗ
	|	Справочник.Пользователи.ДоступныеСклады КАК ПользователиДоступныеСклады
	|ГДЕ
	|	Ссылка = &Пользователь И Склад=&Склад";
	
	Запрос.УстановитьПараметр("Пользователь",	ПараметрыСеанса.Пользователь);
	Запрос.УстановитьПараметр("Склад",			Склад);
	
	
	Доступ=Новый Структура("Определены,Просмотр,Редактирование",Ложь,Ложь,Ложь);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Доступ.Вставить("Определены",Истина);
		Доступ.Вставить("Просмотр",			Выборка.Просмотр);
		Доступ.Вставить("Редактирование",	Выборка.Редактирование);	
		Доступ.Вставить("Отгрузка",			Выборка.Отгрузка);	
		Доступ.Вставить("Приемка",			Выборка.Приемка);	
	КонецЦикла; 
	
	Если НЕ Доступ.Определены Тогда
		ЕстьДоступ=(ПланыОбмена.Основной.ЭтотУзел().ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение);
		
		Доступ.Вставить("Просмотр",			ЕстьДоступ);
		Доступ.Вставить("Редактирование",	ЕстьДоступ);
		Доступ.Вставить("Отгрузка",			ЕстьДоступ);
		Доступ.Вставить("Приемка",			ЕстьДоступ);
	КонецЕсли; 
	
	Возврат Доступ;
КонецФункции // ПолучитьпараметрыДоступаКСкладу()


Функция МожноЗаписатьДокумент(Документ,Отказ,РежимЗаписи=Неопределено,ВывестиСообщение=Ложь) Экспорт
	Если Отказ Тогда Возврат Ложь КонецЕсли; //И так уже нельзя
	Если ПараметрыСеанса.ОтключитьКонтрольДЗР Тогда Возврат Истина КонецЕсли; 
	
	МетаДок=Документ.Метаданные();
	
	Вид=МетаДок.Имя;
	
	Если ЕстьРеквизитДокумента("Склад",МетаДок) Тогда
		Можно=Ложь;
		
		
		ПараметрыДоступаКДокументам=ПолучитьПараметрыДоступаКДокументамПоСкладу(Документ.Склад);
		Редактирование=ПараметрыДоступаКДокументам.Редактирование;
		
		
		//нечаева 19,01,16+++ 
		// для работников склада разрешаем работу со всеми документами или семеновский.
		Если параметрыСеанса.ТипУзла = перечисления.ТипУзлаИБ.Склад или  параметрыСеанса.ЭтотУзел.Код = "SEM"  Тогда
			редактирование = истина;
		КонецЕсли;	
		//нечаева 19,01,16---
		
		
		//для всех тц тоже не проверяем
		//нечаева 01,02,16 ++++
		Если    параметрысеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.ТорговоеПодразделение И   НЕ  параметрысеанса.ЭтотУзел.Подразделение.ЕстьВыделенныйСклад  Тогда
			редактирование = истина;
		КонецЕсли;
		//нечаева 01,02,16 ----
		
		Если НЕ Редактирование И ЕстьРеквизитДокумента("СкладПолучатель",МетаДок) Тогда
			ПараметрыДоступаКДокументам=ПолучитьПараметрыДоступаКДокументамПоСкладу(Документ.СкладПолучатель);						
			Редактирование=Макс(Редактирование,ПараметрыДоступаКДокументам.Редактирование);			
		КонецЕсли;
		
		Если НЕ Редактирование Тогда			
			Отказ=Истина;
			Сообщить("Недостаточно прав для изменения документа по складу: """+Документ.Склад+""" !",СтатусСообщения.Важное);		
		КонецЕсли;		
	КонецЕсли; 
	
	Если Отказ Тогда Возврат Ложь КонецЕсли;
	
	Если НЕ Документ.Ссылка.Пустая() Тогда //контроль изменения состояния проведения документа
		Если РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
			БудетПроведен=Истина;
		ИначеЕсли РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения Тогда
			БудетПроведен=Ложь;
		Иначе
			БудетПроведен=ПолучитьРеквизитыШапки(Документ.Ссылка,Новый Структура("Проведен"),"Документ").Проведен;
		КонецЕсли;
		
		Если Вид="РасходнаяНакладная" ИЛИ Вид="Перемещение" Тогда				
			РеквизитыШапки=ПолучитьРеквизитыШапки(Документ.Ссылка,Новый Структура("Проведен,СостояниеНакладной"),"Документ");
			
			ВРаботе=Ложь;
			Если Вид="РасходнаяНакладная" И РеквизитыШапки.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе Тогда
				ВРаботе=Истина;
			ИначеЕсли Вид="Перемещение" И РеквизитыШапки.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе Тогда				
				ВРаботе=Истина;
			КонецЕсли; 
			
			Если РеквизитыШапки.Проведен<>БудетПроведен И НЕ ВРаботе Тогда		
				Отказ=НЕ ПолучитьПолномочиеПользователя("ИзменениеПроведенияОтгруженныхНакладных");			
				Если Отказ И ВывестиСообщение Тогда
					Сообщить("Недостаточно полномочий для изменения признака проведения накладной !",СтатусСообщения.Важное);			
				КонецЕсли; 
			КонецЕсли;		
		ИначеЕсли Вид="Чек" Тогда
			Если Документ.Ссылка.ЧекПробитНаККМ И Документ.Ссылка.Проведен<>БудетПроведен Тогда
				Отказ=НЕ ПолучитьПолномочиеПользователя("ИзменениеПробитыхЧеков");		
				Если Отказ И ВывестиСообщение Тогда
					Сообщить("Недостаточно полномочий для изменения признака проведения пробитого чека !",СтатусСообщения.Важное);			
				КонецЕсли; 
			КонецЕсли;
			//крохин начало 11.11.2019
			//новый документ
		ИначеЕсли Вид="ОплатаЧерезККМ" Тогда
			Если Документ.Ссылка.ЧекПробитНаККМ И Документ.Ссылка.Проведен<>БудетПроведен Тогда
				Отказ=НЕ ПолучитьПолномочиеПользователя("ИзменениеПробитыхЧеков");		
				Если Отказ И ВывестиСообщение Тогда
					Сообщить("Недостаточно полномочий для изменения признака проведения пробитого чека !",СтатусСообщения.Важное);			
				КонецЕсли; 
			КонецЕсли;	
			//крохин конец 11.11.2019	
		КонецЕсли;	
	КонецЕсли;
	
	Возврат НЕ Отказ;
КонецФункции 

//пересчет сумм из одной валюты в другую
//крохин начало 07.02.2012
//доработка Родионова, для июней, исправление кратности
Функция глПересчет(Знач Сумма1,Знач Валюта1,Знач КурсВалюты1=Неопределено,Знач Валюта2,Знач КурсВалюты2=Неопределено,Знач Округлять=Истина) Экспорт	
	Если Валюта1 = Валюта2 Тогда
		Возврат Сумма1;
	Иначе		
		ВалютаНац 	= ПараметрыСеанса.ВалютаНац;
		ВалютаУпр	= ПараметрыСеанса.ВалютаУпр_2009;
		
		КурсВалюты1=?(КурсВалюты1=Неопределено,ТекущаяДата(),КурсВалюты1);	
		КурсВалюты2=?(КурсВалюты2=Неопределено,ТекущаяДата(),КурсВалюты2);	
		
		Если ТипЗнч(КурсВалюты1)=Тип("Дата") Тогда
			// *** 2011-11-22 курс/кратность (для CNY)
			//КурсВалюты1=ПолучитьКурсВалюты_ПоРусски(Валюта1,КурсВалюты1);
			// ---------- заменено на:
			СтруктураКурсаВалюты1	= ПолучитьКурсВалюты(Валюта1, КурсВалюты1);
			КурсВалюты1				= СтруктураКурсаВалюты1.Курс;
			КратностьВалюты1		= СтруктураКурсаВалюты1.Кратность;
		Иначе
			КратностьВалюты1 = ПолучитьКурсВалюты(Валюта1, ТекущаяДата()).Кратность;
			// курс/кратность (для CNY) 2011-11-22 ***
		КонецЕсли; 
		
		Если ТипЗнч(КурсВалюты2)=Тип("Дата") Тогда
			// *** 2011-11-22 курс/кратность (для CNY)
			//КурсВалюты2=ПолучитьКурсВалюты(Валюта2,КурсВалюты2).Курс;
			// ---------- заменено на:
			СтруктураКурсаВалюты2	= ПолучитьКурсВалюты(Валюта2, КурсВалюты2);
			КурсВалюты2				= СтруктураКурсаВалюты2.Курс;
			КратностьВалюты2		= СтруктураКурсаВалюты2.Кратность;			
		Иначе
			КратностьВалюты2 = ПолучитьКурсВалюты(Валюта2, ТекущаяДата()).Кратность;
			// курс/кратность (для CNY) 2011-11-22 ***
		КонецЕсли;		
		
		// +++ 2011-11-22 курс/кратность (для CNY)
		Если (КратностьВалюты1 <> 1) И (КратностьВалюты1 <> 0) Тогда
			КурсВалюты1 = КурсВалюты1 / КратностьВалюты1;
		КонецЕсли;
		Если (КратностьВалюты2 <> 1) И (КратностьВалюты2 <> 0) Тогда
			КурсВалюты2 = КурсВалюты2 / КратностьВалюты2;
		КонецЕсли;		
		// курс/кратность (для CNY) 2011-11-22 +++
		
		
		Если Валюта1 <> Валюта2 Тогда
			// если валюта товара не совпадает с валютой накладной
			Если  Валюта1=ВалютаНац Тогда //рубли
				
				//Тимофеев Ю.А. 29.11.2023
				//ОШИБКА деление на 0
				//Сумма2=Сумма1/?(Валюта2=ВалютаУпр,КурсВалюты1,КурсВалюты2);	
				
				Если Валюта2=ВалютаУпр Тогда
					делитель = КурсВалюты1;
				Иначе
					делитель = КурсВалюты2;
				КонецЕсли;
				
				Если делитель =0 тогда
					Сумма2=0; //не указан курс валюты 					
					#ЕСЛИ КЛИЕНТ ТОГДА
						Сообщить("Не указан курс валюты, для пересчета");	
					#КОНЕЦЕСЛИ   					
				Иначе
					Сумма2=Сумма1/Делитель;
				КонецЕсли;
				//Тимофеев Ю.А. 29.11.2023
				
				
				Сумма2=?(Округлять,Окр(Сумма2,2,1),Сумма2);			
			ИначеЕсли  Валюта2=ВалютаНац  Тогда
				//Сумма2=Сумма1*?(Валюта1=ВалютаУпр,КурсВалюты2,КурсВалюты1);
				Сумма2=Сумма1*КурсВалюты1;
				Сумма2=?(Округлять,Окр(Сумма2,2,1),Сумма2);
			Иначе
				// если валюта товара не совпадает с валютой накладной, и не рубли
				
				//Тимофеев Ю.А. Начало   25-12-2024
				//
				// было
				//Сумма2=(Сумма1*КурсВалюты1)/КурсВалюты2;
				
				//Стало
				Если КурсВалюты2=0 Тогда
					
					Сумма2=(Сумма1*КурсВалюты1);	
					
					#ЕСЛИ КЛИЕНТ ТОГДА
						Сообщить("Не указан курс валюты 2, для пересчета- без перерасчета.Проверьте");	
					#КОНЕЦЕСЛИ 
				Иначе	
					Сумма2=(Сумма1*КурсВалюты1)/КурсВалюты2; 					
				КонецЕсли;
				
				//Тимофеев Ю.А. Конец    25-12-2024
				
			КонецЕсли;    
		КонецЕсли;
	КонецЕсли;
	
	Возврат Сумма2;
КонецФункции
//крохин конец 07.02.2012

//Катаев+ 06/11/14
Функция ПолучитьСуммуПоЗПС(ДокОснование, ЗаказыПоставщикам, Номенклатура) Экспорт
	сзЗПС = Новый СписокЗначений;
	Если ДокОснование = Неопределено Тогда
		для Каждого стр из ЗаказыПоставщикам Цикл
			сзЗПС.Добавить(стр.ЗПС);
		КонецЦикла;
	Иначе
		сзЗПС.Добавить(ДокОснование);
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Цена КАК Цена
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка В(&ЗПС)
	|	И ЗаказПоставщикуТовары.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("ЗПС", сзЗПС);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	тз = Запрос.Выполнить().Выгрузить();
	Если тз.Количество() = 0 Тогда
		Сообщить("В ЗПС "+ДокОснование+" не обнаружена номенклатура "+Номенклатура);
		Возврат 0;
	Иначе
		Возврат тз[0].Цена;
	КонецЕсли;
КонецФункции

Функция ПолучитьВалютуПНК(ИМ7) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Партии.Валюта
	|ИЗ
	|	РегистрНакопления.Партии КАК Партии
	|ГДЕ
	|	Партии.Партия = &ИМ7";
	Запрос.УстановитьПараметр("ИМ7", ИМ7);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Валюта;
	КонецЕсли;
КонецФункции

Функция ПолучитьСуммуПоПоступлению(ИМ7, Номенклатура, Количество) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Партии.Сумма,
	|	Партии.Количество
	|ИЗ
	|	РегистрНакопления.Партии КАК Партии
	|ГДЕ
	|	Партии.Партия = &ИМ7
	|	И Партии.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ИМ7", ИМ7);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сумма*Количество/Выборка.Количество;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

Функция ПолучитьСуммуОстатка(Номенклатура, Количество, Дата, Склад) экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОстаткиТМЦОстатки.КоличествоОстаток,
	|	ОстаткиТМЦОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(
	|			&Дата1,
	|			Номенклатура = &Номенклатура
	|				И Склад = &Склад) КАК ОстаткиТМЦОстатки";;
	Запрос.УстановитьПараметр("Дата1", Новый Граница(Дата, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Остаток = Выборка.КоличествоОстаток;
		Сумма = Выборка.СуммаОстаток;
		// нечаева 16,01,15 ++
		//Возврат Сумма*Количество/Остаток;
		попытка
			Если Остаток<>0 Тогда
				Возврат Сумма*Количество/Остаток;
			иначе Возврат 0;
			конецЕсли;
		исключение
			сообщить(ОписаниеОшибки());
			ЗаписатьВЛог("ОшибкиЗаказов"," "+Номенклатура +" - "+ Количество+" - "+ Дата+" - "+ Склад+"  сумма - "+сумма+" - количество - "+количество+" - остаток - "+остаток,"Информация");
		конецПопытки;
		// нечаева 16,01,15 ---
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

Функция ПолучитьСуммуКП(Номенклатура, КП, Количество) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Партии.Сумма,
	|	Партии.Количество
	|ИЗ
	|	РегистрНакопления.Партии КАК Партии
	|ГДЕ
	|	Партии.Регистратор = &КП
	|	И Партии.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("КП", КП);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сумма*Количество/Выборка.Количество;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции
//Катаев- 06/11/14


//Катаев+ 04/12/14
Функция ПолучитьВесаПоОстаткамПартии(Им7, Номенклатура, Количество, Контракт, Дата) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПартииОстатки.ВесОстаток КАК Брутто,
	|	ПартииОстатки.ВесНеттоОстаток КАК Нетто,
	|	ПартииОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.Партии.Остатки(
	|			&Дата1,
	|			Партия = &ИМ7
	|				И Номенклатура = &Номенклатура
	|				И Контракт = &Контракт) КАК ПартииОстатки";
	Запрос.УстановитьПараметр("Дата1", Новый Граница(Дата, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ИМ7", ИМ7);
	Запрос.УстановитьПараметр("Контракт", Контракт);
	Выборка = Запрос.Выполнить().Выбрать();
	Веса = Новый Структура;
	Выборка.Следующий();
	Если Выборка.Количество <> 0 Тогда
		Веса.Вставить("Брутто", Количество*Выборка.Брутто/Выборка.Количество);
		Веса.Вставить("Нетто", Количество*Выборка.Нетто/Выборка.Количество);
	Иначе
		Веса.Вставить("Брутто", 0);
		Веса.Вставить("Нетто", 0);
	КонецЕсли;
	Возврат Веса;
КонецФункции
//Катаев- 04/12/14

//крохин начало 29.01.2015
Функция ПолучитьОстаткиПартий(ТаблицаПартий,ДатаОстатов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПартииОстатки.ВесОстаток КАК Брутто,
	|	ПартииОстатки.ВесНеттоОстаток КАК Нетто,
	|	ПартииОстатки.КоличествоОстаток КАК Количество,
	|	ПартииОстатки.СуммаОстаток КАК Сумма,
	|	ПартииОстатки.Партия КАК Им7,
	|	ПартииОстатки.Номенклатура
	|ИЗ
	|	РегистрНакопления.Партии.Остатки(
	|			&Дата1,
	|			Партия В (&ИМ7)
	|				И Номенклатура В (&Номенклатура)
	|				И Контракт = &Контракт) КАК ПартииОстатки";
	
	Запрос.УстановитьПараметр("Дата1", Новый Граница(ДатаОстатов, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Номенклатура", ТаблицаПартий.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("ИМ7", ТаблицаПартий.ВыгрузитьКолонку("ИМ7"));
	Запрос.УстановитьПараметр("Контракт", Справочники.КонтрактыСПроизводителем.ПустаяСсылка()); //исключаем склад-заказ,там контракт заполнен
	Выборка = Запрос.Выполнить().Выбрать();
	ТаблицаОстатов = Новый ТаблицаЗначений;
	ТаблицаОстатов.Колонки.Добавить("Им7");
	ТаблицаОстатов.Колонки.Добавить("Номенклатура");
	ТаблицаОстатов.Колонки.Добавить("Брутто");
	ТаблицаОстатов.Колонки.Добавить("Нетто");
	ТаблицаОстатов.Колонки.Добавить("Количество");
	ТаблицаОстатов.Колонки.Добавить("Сумма");
	Пока Выборка.Следующий() Цикл
		СтрокаТО = ТаблицаОстатов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТО,Выборка);
		Если Выборка.Количество = 0 Тогда
			СтрокаТО.Брутто = 0;
			СтрокаТО.Нетто = 0;
			СтрокаТО.Сумма = 0;
		КонецЕсли;
	КонецЦикла;
	Возврат ТаблицаОстатов;
	
КонецФункции

Функция ПолучитьВалютыПартий(СписокИм7) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Партии.Валюта,
	|	Партии.Партия КАК Им7
	|ИЗ
	|	РегистрНакопления.Партии КАК Партии
	|ГДЕ
	|	Партии.Партия В(&ИМ7)";
	Запрос.УстановитьПараметр("ИМ7", СписокИм7);
	Выборка = Запрос.Выполнить().Выбрать();
	СписокВалютИм7 = новый Соответствие;
	Пока Выборка.Следующий() Цикл
		СписокВалютИм7.Вставить(Выборка.Им7,Выборка.Валюта);
	КонецЦикла;
	Возврат СписокВалютИм7;
КонецФункции

//крохин конец 29.01.2015

Функция ПолучитьСтруктуруВалютИКурсы(ВалютаДокумента,КурсДокумента,ДатаДокумента,Договор=Неопределено) Экспорт
	Результат			=Новый Структура;
	
	Результат.Вставить("ВалютаДокумента",		ВалютаДокумента);
	Результат.Вставить("КурсДокумента",			КурсДокумента);
	Результат.Вставить("КурсВалютыДокумента",	ПолучитьКурсВалюты(ВалютаДокумента,ДатаДокумента).Курс);
	
	ВалютаРасчетов=ПолучитьВалютуРасчетов(Договор);
	Результат.Вставить("ВалютаРасчетов",		ВалютаРасчетов);
	Результат.Вставить("КурсВалютыРасчетов",	ПолучитьКурсВалюты(ВалютаРасчетов,ДатаДокумента).Курс);
	
	Результат.Вставить("ВалютаНац",				ПараметрыСеанса.ВалютаНац);
	
	Доллары		= Справочники.Валюты.НайтиПоКоду("840");
	Результат.Вставить("Доллары",				Доллары);
	Результат.Вставить("КурсДоллара",			ПолучитьКурсВалюты(Доллары,ДатаДокумента).Курс);
	
	Евро		= Справочники.Валюты.НайтиПоКоду("978");
	Результат.Вставить("Евро",					Евро);
	Результат.Вставить("КурсЕвро",				ПолучитьКурсВалюты(Евро,ДатаДокумента).Курс);
	
	ВалютаУпр	= ?(ДатаДокумента>='20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);
	Результат.Вставить("ВалютаУпр",				ВалютаУпр);
	Результат.Вставить("КурсВалютаУпр",			ПолучитьКурсВалюты(ВалютаУпр,ДатаДокумента).Курс);
	
	Возврат Результат;
КонецФункции

//Возвращает строку с первой прописной буквы "ручка"-"Ручка"
Функция Прег(НачСтрока) Экспорт
	Возврат ВРег(Лев(НачСтрока,1))+НРег(Сред(НачСтрока,2));
КонецФункции // Прег()

// возвращает префикс нумерации объектов
Функция ПолучитьПрефиксНомеров(Объект=Неопределено) Экспорт
	Возврат СокрЛП(ПланыОбмена.Основной.ЭтотУзел().Код)+"-";
КонецФункции // ПолучитьПрефиксНомеров()


/////////////////////////////////////////////////////////////////////////////////////
// ШТРИХ КОДЫ
Функция ПолучитьМассивСсылокНаШК(ШК,ТипШК=Неопределено)	
	ТекШК=СокрЛП(ШК);
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Ссылка 		КАК Ссылка,
	|	Владелец 	КАК Номенклатура,	
	|	ШтВКоробе 	КАК ШтВКоробе,	
	|	ВидШК 		КАК ВидШК
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	Ложь
	|";
	
	Если СтрДлина(ТекШК)<12 и СтрДлина(ТекШК)<>8 Тогда
		Сообщить("Неопознанный ШК: "+ТекШК,СтатусСообщения.ОченьВажное);
		Возврат Запрос.Выполнить().Выгрузить();	
	КонецЕсли;	
	
	ТекШК=Прав(ТекШК,13);	
	
	Если ТипШК=Неопределено Тогда
		ТипШК=Перечисления.ТипыШтрихКодов.Штука;	
	КонецЕсли;	
	
	Запрос.Текст=Запрос.Текст+"	
	|	ИЛИ (
	|		Наименование 	= &ШК	
	|		И ТипШК 		= &ТипШК
	|	)
	|";	
	
	Запрос.УстановитьПараметр("ШК",		ТекШК);
	Запрос.УстановитьПараметр("ТипШК",	ТипШК);	
	
	Результат=Запрос.Выполнить().Выгрузить();
	Если результат.Количество()>0 тогда
		Возврат результат;
	Иначе		
		Запрос.УстановитьПараметр("ШК",СокрЛП(ШК));		
		
		Результат=запрос.Выполнить().Выгрузить();		
	КонецЕсли;	
	
	Возврат Результат;	
КонецФункции //ПолучитьМассивСсылокНаШК(ШК,ТипШК=Неопределено)


// Кухарь А.Ю.  25.06.2024 начало
// Функция НайтиТоварПоШтрихКоду(ШК,ТипШК=Неопределено,КоличествоИзШК=0,ДанныеМаркиЧЗ=Неопределено) Экспорт 
//Данилова Е.В. 02.03.2026 SNL-153 добавлен параметр ВыводитьСоообщения

// Кельманов А.В. - SNL-119 - 2026.03.10 {
//Функция НайтиТоварПоШтрихКоду(ШК, ТипШК = Неопределено, КоличествоИзШК = 0, ДанныеМаркиЧЗ = Неопределено, ЭтоОтгрузка = Истина, ВыводитьСоообщенияЧЗ = Истина) Экспорт 
Функция НайтиТоварПоШтрихКоду(ШК, ТипШК = Неопределено, КоличествоИзШК = 0, ДанныеМаркиЧЗ = Неопределено, ЭтоОтгрузка = Истина, ВыводитьСоообщенияЧЗ = Истина, ТекстОшибки = "") Экспорт 
	// Кельманов А.В. - SNL-119 - 2026.03.10 }

	// Кухарь А.Ю.  25.06.2024 конец
	
	Номенклатура=Справочники.Номенклатура.ПустаяСсылка();
	
	// Кухарь А.Ю.  06.03.2024 начало
	//83 - qr штуки, 20 - код агрегации(Коробка).
	//Кухарь 27.12.2024 начало
	//если (СтрДлина(ШК)>=83 и Лев(ШК,2)="01") или СтрДлина(ШК) = 20 тогда
	//НаименованиеМарки=Лев(ШК,31);
	если (СтрДлина(ШК)>=83 и (Лев(ШК,2)="01" или Лев(ШК,2)=символ(29)+"0")) или СтрДлина(ШК) = 20 тогда
		ШК=СтрЗаменить(ШК,Символ(29),"");
		НаименованиеМарки=Лев(ШК,31);
		//Кухарь 27.12.2024 конец
		
		// Кухарь А.Ю.  25.06.2024 начало
		//ДанныеМаркиЧЗ=ПолучитьСтруктуруДанныхМаркиЧЗПоНаименованию(НаименованиеМарки);	
		ДанныеМаркиЧЗ=ПолучитьСтруктуруДанныхМаркиЧЗПоНаименованию(НаименованиеМарки,ЭтоОтгрузка);			
		// Кухарь А.Ю.  25.06.2024 конец
		
		// Кухарь А.Ю.  13.05.2024 начало
		ДанныеМаркиЧЗ.СканировалиКодЧЗ = Истина;		 
		// Кухарь А.Ю.  13.05.2024 конец 
		//++Данилова Е.В. 18.06.2025 HELP-5142
		ДанныеМаркиЧЗ.Вставить("МультиАгрегат",Ложь); 
		//++Данилова Е.В. 03.02.2026 SNL-114 
		//Если ЭтоОтгрузка
		//	И Не ЗначениеЗаполнено(ДанныеМаркиЧЗ.Номенклатура)
		//	И ЗначениеЗаполнено(ДанныеМаркиЧЗ.МаркаЧЗ) Тогда
		//	ДанныеМаркиЧЗ.Вставить("ДанныеПоВложеннымШК",ПолучитьДанныеПоВложеннымШКПоМаркеЧЗ(ДанныеМаркиЧЗ.МаркаЧЗ)); 		 
		//	ДанныеМаркиЧЗ.МультиАгрегат = ДанныеМаркиЧЗ.ДанныеПоВложеннымШК.МассивТоваров.Количество() > 0; 
		//	Если  ДанныеМаркиЧЗ.МультиАгрегат  Тогда
		//		
		//		ДанныеМаркиЧЗ.Номенклатура = ДанныеМаркиЧЗ.ДанныеПоВложеннымШК.МассивТоваров[0];	
		//		
		//	КонецЕсли;
		//	
		//	
		//КонецЕсли;
		Если ЭтоОтгрузка
			И ТипШК <> перечисления.ТипыШтрихКодов.Штука  
			И ЗначениеЗаполнено(ДанныеМаркиЧЗ.МаркаЧЗ) Тогда
			
			НоменклатураПоВладельцу = ДанныеМаркиЧЗ.Номенклатура; 
			ДанныеМаркиЧЗ.Вставить("ДанныеПоВложеннымШК",ПолучитьДанныеПоВложеннымШКПоМаркеЧЗ(ДанныеМаркиЧЗ.МаркаЧЗ));
			МассивТоваровШК = ДанныеМаркиЧЗ.ДанныеПоВложеннымШК.МассивТоваров; 
			ДанныеМаркиЧЗ.МультиАгрегат = МассивТоваровШК.Количество() > 1; 	
						
			Если  ДанныеМаркиЧЗ.МультиАгрегат
				 ИЛИ МассивТоваровШК.Количество() > 0 Тогда
				
				ДанныеМаркиЧЗ.Номенклатура = МассивТоваровШК[0];	
			Иначе 
				ДанныеМаркиЧЗ.Номенклатура = НоменклатураПоВладельцу; 
			КонецЕсли;
			
		КонецЕсли; 
		//--Данилова Е.В. 03.02.2026 
		//--Данилова Е.В. 18.06.2025
		//++Данилова Е.В. 02.12.2025  MARK-1869 
		//++Данилова Е.В. 02.03.2026 SNL-153 
		Если ЗначениеЗаполнено(ДанныеМаркиЧЗ.КомментарийКОшибке) 
			И ВыводитьСоообщенияЧЗ Тогда
			//--Данилова Е.В. 02.03.2026 

			// Кельманов А.В. - SNL-119 - 2026.03.10 {
			//Сообщить(ДанныеМаркиЧЗ.КомментарийКОшибке,СтатусСообщения.Важное);
			ТекстОшибки = ДанныеМаркиЧЗ.КомментарийКОшибке;
			
			Сообщить(ТекстОшибки, СтатусСообщения.Важное); 	
			// Кельманов А.В. - SNL-119 - 2026.03.10 }
			
		КонецЕсли;
		//--Данилова Е.В. 02.12.2025 
		
		// Кельманов А.В. - HELP-2877 - 2025.02.14 {
		//если ДанныеМаркиЧЗ=Неопределено тогда
		Если Не ЗначениеЗаполнено(ДанныеМаркиЧЗ.Номенклатура) Тогда
			// Кельманов А.В. - HELP-2877 - 2025.02.14 }
			
			//++Данилова Е.В. 02.03.2026 SNL-153
			//Сообщить("Не найден товар по коду ЧЗ " + ": " + ШК, СтатусСообщения.Важное);
			Если ВыводитьСоообщенияЧЗ Тогда
				
				// Кельманов А.В. - SNL-119 - 2026.03.10 {
				//Сообщить("Не найден товар по коду ЧЗ " + ": " + ШК, СтатусСообщения.Важное);
				ТекстОшибки = "Не найден товар по коду ЧЗ " + ": " + ШК;
			
				Сообщить(ТекстОшибки, СтатусСообщения.Важное);
				// Кельманов А.В. - SNL-119 - 2026.03.10 }
				
			Конецесли; 
			//--Данилова Е.В. 02.03.2026
			
			Возврат Номенклатура;
			
		Иначе
			
			Возврат ДанныеМаркиЧЗ.Номенклатура;
			
		КонецЕсли;
		
	иначе
		ДанныеМаркиЧЗ=новый Структура("СканировалиКодЧЗ",ложь);
	КонецЕсли; 
	// Кухарь А.Ю.  06.03.2024 конец
	
	ТШК = ПолучитьМассивСсылокНаШК(ШК, ТипШК);	
	ТШК.Свернуть("Номенклатура,ШтВКоробе");	
	
	// Кельманов А.В. - SNL-119 - 2026.03.10 {
	//Если ТШК.Количество()=0 Тогда
	//	Сообщить("Не найден товар с типом ШК "+ТипШК+": "+ШК,СтатусСообщения.Важное);
	//ИначеЕсли ТШК.Количество()=1 Тогда
	//	Номенклатура	=ТШК[0].Номенклатура;		
	//	КоличествоИзШК	=ТШК[0].ШтВКоробе;		
	//Иначе	
	//	Сообщить("Дубли штрих кодов с типом ШК"+ТипШК+": "+ШК,СтатусСообщения.Важное);				
	//	Для Каждого СтрокаТШК Из ТШК Цикл			
	//		Сообщить("	"+СтрокаТШК.Номенклатура+", ("+СтрокаТШК.Номенклатура.Код+")",СтатусСообщения.Важное);		
	//	КонецЦикла;
	//КонецЕсли; 
	Если ТШК.Количество() = 0 Тогда
		
		ТекстОшибки = "Не найден товар с типом ШК " + ТипШК + ": " + ШК;
		
	ИначеЕсли ТШК.Количество() = 1 Тогда
		
		Номенклатура = ТШК[0].Номенклатура;		
		КоличествоИзШК = ТШК[0].ШтВКоробе;
		
	Иначе	
		
		ТекстОшибки = "Дубли штрих кодов с типом ШК" + ТипШК + ": " + ШК;				
		
		Для Каждого СтрокаТШК Из ТШК Цикл			
			ТекстОшибки = ТекстОшибки + Символы.ПС + СтрокаТШК.Номенклатура + ", (" + СтрокаТШК.Номенклатура.Код + ")";		
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		
		Сообщить(ТекстОшибки, СтатусСообщения.Важное);
		
	КонецЕсли;
	// Кельманов А.В. - SNL-119 - 2026.03.10 }
	
	Возврат Номенклатура;
	
КонецФункции //НайтиТоварПоШтрихКоду(ШК,ТипШК=Неопределено,КоличествоИзШК=0) Экспорт




//ШК-штрих-код
//ссылка-ссылка на текущий элемент ШК (чтобы сам на себя не ругался)
Функция КонтрольДублейШК(ШК) Экспорт
	
	ТипШК	=ШК.ТипШК;
	ВидШК	=ШК.ВидШК;
	ШтрихКод=ШК.Наименование;
	Ссылка	=ШК.Ссылка;
	
	//контроль основных ШК
	Если ВидШК=Перечисления.ВидыШК.Основной Тогда	
		ТШК=ПолучитьВсеШКТовара(ШК.Владелец,ТипШК,ВидШК);
		Если ТШК.Количество()>1 Тогда
			Сообщить("Дублирован основной ШК !",СтатусСообщения.Важное);
			
			Возврат Ложь;					
		КонецЕсли; 
	КонецЕсли;
	
	//контроль дублей
	//служебный ШК для забоя
	Если СокрЛП(ШтрихКод)="9999999999999" Тогда Возврат Истина КонецЕсли; 
	
	СписокДублей		=Новый Массив;
	СписокДублейВидов	=Новый Массив;
	
	ТШК=ПолучитьМассивСсылокНаШК(ШтрихКод,ТипШК);	
	
	Для Каждого СтрокаТШК Из ТШК Цикл	
		Если СтрокаТШК.Ссылка<>Ссылка Тогда
			СписокДублей.Добавить(СтрокаТШК.Номенклатура);
		КонецЕсли; 
	КонецЦикла;		
	
	Если СписокДублей.ВГраница()>=0 Тогда		
		Сообщить("ШК дублирован ! Тип ШК: "+ШК.ТипШК+", ШК: """+ШК+"""",СтатусСообщения.Важное);		
		Для Каждого Номенклатура ИЗ СписокДублей Цикл			
			Сообщить("	Брэнд: "+Номенклатура.Родитель.Родитель+", модель: "+Номенклатура.Родитель+", позиция: "+Номенклатура+" ("+Номенклатура.Код+")",СтатусСообщения.Важное);
		КонецЦикла;
		
		Возврат Ложь;		
	КонецЕсли;
	
	Возврат Истина;	
КонецФункции //КонтрольДублейШК(ШК,ТипШК,Ссылка) Экспорт

Функция ПолучитьВсеШКТовара(Номенклатура,ТипШК=Неопределено,ВидШК=Неопределено) Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Ссылка,
	|	ПометкаУдаления,
	|	Предопределенный,
	|	Владелец,
	|	Код,
	|	Наименование,
	|	ТипШК,
	|	ВидШК,
	|	ДатаМодификации,
	|	ПричинаМодификации,
	|	Описание
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	Владелец = &Номенклатура
	//крохин начало 26.02.2013
	//все 9 - служебный ШК, не для печати
	|	И Наименование<>""9999999999999""		
	//крохин конец 26.02.2013	
	|	И ТипШК = &ТипШК
	|	И ВидШК = &ВидШК";
	
	Запрос.УстановитьПараметр("Номенклатура",	Номенклатура);
	Запрос.УстановитьПараметр("ТипШК",			ТипШК);
	Запрос.УстановитьПараметр("ВидШК",			ВидШК);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // ПОлучитьВсеШКТовара()

// Кухарь А.Ю. 29.11.2024 начало
// Функция ПолучитьШтрихКодТовара(Товар,ТипШК=Неопределено,ВидШК=Неопределено,ЧтоВозвращать="Код",ДопОтбор="") Экспорт
Функция ПолучитьШтрихКодТовара(Товар,ТипШК=Неопределено,ВидШК=Неопределено,ЧтоВозвращать="Код",ДопОтбор="",ОтключитьФильтрПоВиду = ложь) Экспорт 
	// Кухарь А.Ю. 29.11.2024 конец
	
	
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|    Ссылка,
	|	Наименование
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	Владелец = &Владелец
	//крохин начало 26.02.2013
	//все 9 - служебный ШК, не для печати
	|	И Наименование<>""9999999999999""		
	//крохин конец 26.02.2013
	|	И ТипШК = &ТипШК
	|	И ВидШК = &ВидШК
	//кухарь 01.09.14 начало
	|	И ШтрихКоды.ПометкаУдаления = ложь";
	//кухарь 01.09.14 конец
	
	Запрос.УстановитьПараметр("Владелец",Товар);
	Запрос.УстановитьПараметр("ТипШК",?(ТипШК=Неопределено,Перечисления.ТипыШтрихКодов.Штука,ТипШК));
	Запрос.УстановитьПараметр("ВидШК",?(ВидШК=Неопределено,Перечисления.ВидыШК.Основной,ВидШК));
	
	// Кухарь А.Ю. 29.11.2024 начало
	// По просьбе закупщиков иногда они хотят получать хоть какой-нибудь ШК, не выбирая его вид
	если ОтключитьФильтрПоВиду тогда
		запрос.Текст=СтрЗаменить(запрос.Текст,"И ВидШК = &ВидШК","И Истина");
	КонецЕсли;
	// Кухарь А.Ю. 29.11.2024 конец
	
	
	//Кухарь 11.07.19 начало
	//Передаваемый дополнительный отбор
	если ДопОтбор<>"" тогда
		запрос.Текст=запрос.Текст+ДопОтбор;
	КонецЕсли;
	//Кухарь 11.07.19 конец
	
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Возврат ?(ЧтоВозвращать="Код",Выборка.Наименование,Выборка.Ссылка);
	КонецЦикла; 
	
	Возврат Неопределено;
КонецФункции // ПолучитьШтрихКодТовара()


// Функция вычисляет контрольный символ кода EAN
//
// Параметры:
//  ШтрихКод     - штрих-код (без контрольной цифры)
//  Тип          - тип штрих-кода: 13 - EAN13, 8 - EAN8
//
// Возвращаемое значение:
//  Контрольный символ штрих-кода
//
Функция КонтрольныйСимволEAN(ШтрихКод, Тип) Экспорт
	
	Четн   = 0;
	Нечетн = 0;
	
	КоличествоИтераций = ?(Тип = 13, 6, 4);
	
	Для Индекс = 1 По КоличествоИтераций Цикл
		Если (Тип = 8) и (Индекс = КоличествоИтераций) Тогда
		Иначе
			Четн   = Четн   + Число(Сред(ШтрихКод, 2 * Индекс, 1));
		КонецЕсли;
		Нечетн = Нечетн + Число(Сред(ШтрихКод, 2 * Индекс - 1, 1));
	КонецЦикла;
	
	Если Тип = 13 Тогда
		Четн = Четн * 3;
	Иначе
		Нечетн = Нечетн * 3;
	КонецЕсли;
	
	КонтЦифра = 10 - (Четн + Нечетн) % 10;
	
	Возврат ?(КонтЦифра = 10, "0", Строка(КонтЦифра));
	
КонецФункции // КонтрольныйСимволEAN()



Функция Модуль(Зн) Экспорт
	Возврат ?(Зн<0,-Зн,Зн);
КонецФункции // Модуль()

//Выводит форму трассировки
//РезультатОперации: 0 номальное завершение
//РезультатОперации: -1 предупреждение
//РезультатОперации: -2 ошибка выполнения

Процедура ВывестиТрассировку(ТОшибок,РезультатОперации=0) Экспорт
	#ЕСЛИ КЛИЕНТ ТОГДА
		Трассировка=Обработки.Трассировка.ПолучитьФорму(,,"Ключ");
		Трассировка.ДобавитьОшибки(ТОшибок,РезультатОперации);
		
		Трассировка.Открыть();	
	#КОНЕЦЕСЛИ
КонецПроцедуры


Функция ГруппыТоваровДокумента(ДокОбъект,ИмяТЧ="Товары",ИмяКолонки="Номенклатура") Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР КОГДА Родитель.Родитель.Брэнд=&ПустаяСтрока ТОГДА Родитель.Родитель.Наименование ИНАЧЕ Родитель.Родитель.Брэнд КОНЕЦ КАК Брэнд
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ (&СписокТоваров)	
	|	И НЕ Номенклатура.ЭтоГруппа
	|УПОРЯДОЧИТЬ ПО 
	|	ВЫБОР КОГДА Родитель.Родитель.Брэнд=&ПустаяСтрока ТОГДА Родитель.Родитель.Наименование ИНАЧЕ Родитель.Родитель.Брэнд КОНЕЦ";
	
	СписокТоваров=ДокОбъект[ИмяТЧ].ВыгрузитьКолонку(ИмяКолонки);
	
	Запрос.УстановитьПараметр("СписокТоваров",СписокТоваров);
	Запрос.УстановитьПараметр("ПустаяСтрока","");
	
	ГруппыТоваров="";
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//ТекБрэнд=?(ПустаяСтрока(Выборка.Брэнд),Выборка.Наименование,Выборка.Брэнд);
		ГруппыТоваров=ГруппыТоваров+Выборка.Брэнд+",";	
	КонецЦикла; 
	
	Если НЕ ПустаяСтрока(ГруппыТоваров) Тогда
		ГруппыТоваров=Лев(ГруппыТоваров,СтрДлина(ГруппыТоваров)-1)	
	КонецЕсли; 
	
	Возврат ГруппыТоваров;	
КонецФункции // ГруппыТоваров()

//крохин начало 18.10.2013
Функция ГруппыТоваровНоменклатуры(МассивНоменклатуры) Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР КОГДА Родитель.Родитель.Брэнд=&ПустаяСтрока ТОГДА Родитель.Родитель.Наименование ИНАЧЕ Родитель.Родитель.Брэнд КОНЕЦ КАК Брэнд
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ (&СписокТоваров)	
	|	И НЕ Номенклатура.ЭтоГруппа
	|УПОРЯДОЧИТЬ ПО 
	|	ВЫБОР КОГДА Родитель.Родитель.Брэнд=&ПустаяСтрока ТОГДА Родитель.Родитель.Наименование ИНАЧЕ Родитель.Родитель.Брэнд КОНЕЦ";
	
	//СписокТоваров=ДокОбъект[ИмяТЧ].ВыгрузитьКолонку(ИмяКолонки);
	
	СписокТоваров = Новый СписокЗначений;
	ВсегоЭлементов=МассивНоменклатуры.ВГраница();
	
	Для Сч=0 По ВсегоЭлементов Цикл
		СписокТоваров.Добавить(МассивНоменклатуры.получить(СЧ));
	КонецЦикла; 
	
	
	Запрос.УстановитьПараметр("СписокТоваров",СписокТоваров);
	Запрос.УстановитьПараметр("ПустаяСтрока","");
	
	ГруппыТоваров="";
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//ТекБрэнд=?(ПустаяСтрока(Выборка.Брэнд),Выборка.Наименование,Выборка.Брэнд);
		ГруппыТоваров=ГруппыТоваров+Выборка.Брэнд+",";	
	КонецЦикла; 
	
	Если НЕ ПустаяСтрока(ГруппыТоваров) Тогда
		ГруппыТоваров=Лев(ГруппыТоваров,СтрДлина(ГруппыТоваров)-1)	
	КонецЕсли; 
	
	Возврат ГруппыТоваров;	
КонецФункции // ГруппыТоваров()
//крохин конец 18.10.2013

Функция СекторХраненияДокумента(ДокОбъект,ИмяТЧ="Товары",ИмяКолонки="Номенклатура") Экспорт
	СписокТоваров=ДокОбъект[ИмяТЧ].ВыгрузитьКолонку(ИмяКолонки);
	
	
	СекторХранения="";
	//Кухарь 13.03.18 начало
	//оптимизация
	//ТЗ = Новый ТаблицаЗначений;
	//ТЗ.Колонки.Добавить("СекторХранения");
	//Для Каждого СтрокаСписка Из СписокТоваров Цикл
	//	строкаТЗ = ТЗ.Добавить();
	//	//крохин начало 05.09.2012
	//	//для Одинцово 4 свой сектор хранения
	//	//строкаТЗ.СекторХранения = ПолучитьРеквизитРодителя(СтрокаСписка,"СекторХранения");
	//	Если ДокОбъект.Склад.Подразделение.КодФизическогоУзла77 = "ODS" Тогда
	//		строкаТЗ.СекторХранения = ПолучитьРеквизитРодителя(СтрокаСписка,"СекторХраненияОдинцово4");	
	//	Иначе
	//		строкаТЗ.СекторХранения = ПолучитьРеквизитРодителя(СтрокаСписка,"СекторХранения");
	//	КонецЕсли;
	//	//крохин конец 05.09.2012
	//КонецЦикла;
	//Тз.Свернуть("СекторХранения");
	
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ различные
	|	ВЫБОР
	|		КОГДА Номенклатура.Родитель.СекторХранения <> """"
	|			ТОГДА Номенклатура.Родитель.СекторХранения
	|		КОГДА Номенклатура.Родитель.Родитель.СекторХранения <> """"
	|			ТОГДА Номенклатура.Родитель.Родитель.СекторХранения
	|		КОГДА Номенклатура.Родитель.Родитель.Родитель.СекторХранения <> """"
	|			ТОГДА Номенклатура.Родитель.Родитель.Родитель.СекторХранения
	|		КОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.СекторХранения <> """"
	|			ТОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.СекторХранения
	|	КОНЕЦ КАК СекторХранения
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&СписокТоваров)";
	запрос.УстановитьПараметр("СписокТоваров",СписокТоваров);  
	ТЗ=запрос.Выполнить().Выгрузить();
	//Кухарь 13.03.18 конец	
	
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		//ТекБрэнд=?(ПустаяСтрока(Выборка.Брэнд),Выборка.Наименование,Выборка.Брэнд);
		СекторХранения=СекторХранения+СтрокаТЗ.СекторХранения+",";	
	КонецЦикла; 
	
	Если НЕ ПустаяСтрока(СекторХранения) Тогда
		СекторХранения=Лев(СекторХранения,СтрДлина(СекторХранения)-1);	
	КонецЕсли; 
	
	Возврат СекторХранения;	
	
КонецФункции // СекторХраненияДокумента()

//крохин начало  05.09.2012
//новый алгоритм расчета сектора хранения, пока не требуется
//Функция СекторХраненияНоменклатуры(Подразделение,ТекНоменклатура) Экспорт
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//				   |	НоменклатураСектораХранения.СекторХранения
//				   |ИЗ
//				   |	Справочник.Номенклатура.СектораХранения КАК НоменклатураСектораХранения
//				   |ГДЕ
//				   |	НоменклатураСектораХранения.Ссылка = &Номенклатура
//				   |	И НоменклатураСектораХранения.Подразделение = &Подразделение";
//				 Запрос.УстановитьПараметр("Номенклатура",ТекНоменклатура);
//				 Запрос.УстановитьПараметр("Подразделение",Подразделение);
//				 Выборка = запрос.Выполнить().Выбрать();
//			Если  Выборка.Следующий() Тогда
//				ТекЗнач = Выборка.СекторХранения;
//			Иначе
//				Если ТекНоменклатура.Родитель.Пустая() Тогда
//				ТекЗнач =  "";
//			Иначе
//				ТекЗнач = СекторХраненияНоменклатуры(Подразделение,ТекНоменклатура.Родитель);
//				КонецЕсли;
//			КонецЕсли;
//		   Возврат ТекЗнач;
//КонецФункции
//крохин конец 05.09.2012

//РАБОТА С ТЗ
Функция ПолучитьСтрокуЗначенийТЗ(ТЗ,Колонка) Экспорт
	СтрРез="";
	Для каждого СтрокаТЗ Из ТЗ Цикл
		СтрРез=СтрРез+СтрокаТЗ[Колонка]+?(ТЗ.Индекс(СтрокаТЗ)=ТЗ.Количество()-1,"",",");
	КонецЦикла; 
	Возврат СтрРез;
КонецФункции // ПолучитьСтрокуЗначенийТЗ() 


//РАБОТА С ФАЙЛАМИ
Функция ЗаархивироватьФайл(ИмяФайла,ИмяАрхива) Экспорт
	ИсходныйФайл=Новый Файл(ИмяФайла);
	Если ИсходныйФайл.Существует() Тогда		
		ИмяАрхива=ИсходныйФайл.Путь+ИсходныйФайл.ИмяБезРасширения+".zip";
		
		Архив=Новый ЗаписьZipФайла(ИмяАрхива,,,МетодСжатияZIP.Сжатие,УровеньСжатияZIP.Оптимальный);
		Архив.Добавить(ИсходныйФайл.ПолноеИмя,РежимСохраненияПутейZIP.НеСохранятьПути,РежимОбработкиПодкаталоговZIP.НеОбрабатывать);		
		Архив.Записать();
		
		ФайлАрхива=Новый Файл(ИмяАрхива);
		Если Не ФайлАрхива.Существует() Тогда
			ЗаписатьВЛог("ОбменДаннымиОсновной","Ошибка архивации файла: """+ИсходныйФайл.ПолноеИмя+""" !",Перечисления.ТипыСообщенийЛога.Ошибка);
		Иначе
			УдалитьФайлы(ИсходныйФайл.Путь,ИсходныйФайл.Имя);
			Возврат Истина;
		КонецЕсли;
	Иначе
		ЗаписатьВЛог("ОбменДаннымиОсновной","Ошибка архивации файла: """+ИсходныйФайл.ПолноеИмя+""" ! Данный файл не найден !",Перечисления.ТипыСообщенийЛога.Ошибка);		
	КонецЕсли; 
	
	Возврат Ложь;	
КонецФункции // ЗаархивироватьФайл()

//УРБД 77
Функция _IDtoStr(Значение) Экспорт
	ТекЗнач=Значение;
	Если ТипЗнч(ТекЗнач)=Тип("Строка") Тогда
		ТекЗнач=Число(СокрЛП(ТекЗнач));	
	КонецЕсли; 
	
	Стр="";
	
	СтрБазы="0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	
	Пока 1=1 Цикл
		Поз=ТекЗнач % 36+1;		
		
		Стр=""+Сред(СтрБазы,Поз,1)+Стр;
		ТекЗнач=Цел(ТекЗнач/36);			
		Если ТекЗнач=0 Тогда Прервать КонецЕсли; 
	КонецЦикла; 
	
	Возврат Стр;
КонецФункции // ПриветстиКБазе()

Функция _StrToID(Значение) Экспорт
	ТекЗнач=СокрЛП(Значение);
	
	СтрБазы="0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	
	Рез=0;
	
	ДлинаСтроки=СтрДлина(ТекЗнач);
	База=1;
	
	Для Сч=0 По ДлинаСтроки-1 Цикл
		ТекСимвол=Сред(ТекЗнач,ДлинаСтроки-Сч,1);
		
		Поз=Найти(СтрБазы,ТекСимвол)-1;
		
		Рез=Рез+База*Поз;
		
		База=База*36;	
	КонецЦикла; 
	
	Возврат Рез;
КонецФункции // _StrToID() 


Функция СжатьПробелы(Стр) Экспорт
	ИсхСтрока=СокрЛП(Стр);
	
	НовСтрока=СтрЗаменить(ИсхСтрока,"  "," ");
	Пока НовСтрока<>ИсхСтрока Цикл
		ИсхСтрока=НовСтрока;
		НовСтрока=СтрЗаменить(ИсхСтрока,"  "," ");	
	КонецЦикла; 
	
	Возврат НовСтрока;
КонецФункции // сжатьПробелы()


Функция ПолучитьПолноеНаименование(Контрагент) Экспорт
	Возврат Лев(Контрагент.ПолноеНаименование,1000);
КонецФункции // Подстрока()


// Функция "расщепляет" строку на подстроки, используя заданный 
//		разделитель. Разделитель может иметь любую длину. 
//		Если в качестве разделителя задан пробел, рядом стоящие пробелы 
//		считаются одним разделителем, а ведущие и хвостовые пробелы параметра Стр
//		игнорируются.
//		Например, 
//		РазложитьСтрокуВМассивПодстрок(",ку,,,му", ",") возвратит массив значений из пяти элементов, 
//		три из которых - пустые строки, а 
//		РазложитьСтрокуВМассивПодстрок(" ку   му", " ") возвратит массив значений из двух элементов
//
//	Параметры: 
//		Стр - 			строка, которую необходимо разложить на подстроки. 
//						Параметр передается по значению.
//		Разделитель - 	строка-разделитель, по умолчанию - запятая.
//
//
//	Возвращаемое значение:
//		массив значений, элементы которого - подстроки
//
Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",") Экспорт
	
	МассивСтрок = Новый Массив();
	
	Если Разделитель = " " Тогда
		
		Стр = СокрЛП(Стр);
		
		Пока 1 = 1 Цикл
			
			Поз = Найти(Стр,Разделитель);
			
			Если Поз = 0 Тогда
				
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
				
			КонецЕсли;
			
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
			
		КонецЦикла;
		
	Иначе
		
		ДлинаРазделителя = СтрДлина(Разделитель);
		
		Пока 1 = 1 Цикл
			
			Поз = Найти(Стр,Разделитель);
			Если Поз = 0 Тогда
				
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
				
			КонецЕсли;
			
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			
			Стр = Сред(Стр,Поз + ДлинаРазделителя);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции // глРазложить

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБНОВЛЕНИЯ КОНФИГУРАЦИИ

Функция ВопросДаНет(ТекстВопроса) Экспорт
	
	#Если Клиент Тогда
		
		КодВозврата = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
		
		Возврат (КодВозврата = КодВозвратаДиалога.Да);
		
	#Иначе
		
		Возврат Истина;
		
	#КонецЕсли
	
КонецФункции // ВопросДаНет()

Процедура ПредупреждениеОбОшибке(ТекстСообщения) Экспорт
	
	#Если Клиент Тогда
		
		Предупреждение(ТекстСообщения);
		
	#Иначе
		
		ВызватьИсключение(ТекстСообщения);
		
	#КонецЕсли
	
КонецПроцедуры // ПредупреждениеОбОшибке()

Процедура ЗапуститьПрограмму(ПутьКПрограмме, РабочийКаталог = Неопределено) Экспорт
	
	#Если Клиент Тогда
		
		ЗапуститьПриложение(ПутьКПрограмме, РабочийКаталог);
		
	#КонецЕсли
	
КонецПроцедуры // ЗапуститьПрограмму()

Функция ПолучитьСвойствоОбъекта(Объект,Свойство) Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов
	|ГДЕ
	|	Объект = &Объект
	|	И Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Объект",Объект);
	Запрос.УстановитьПараметр("Свойство",Свойство);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Значение;	
	КонецЦикла; 
	
	Возврат Неопределено
КонецФункции //ПолучитьСвойствоОбъекта()

Функция ПолучитьГрупповоеСвойствоОбъекта(Объект,Свойство) Экспорт
	ТекЗнач=ПолучитьСвойствоОбъекта(Объект,Свойство);
	Если ТекЗнач=Неопределено И НЕ Объект.Родитель.Пустая() Тогда
		ТекЗнач=ПолучитьГрупповоеСвойствоОбъекта(Объект.Родитель,Свойство);		
	КонецЕсли; 	
	Возврат ТекЗнач;
КонецФункции //ПолучитьГрупповоеСвойствоОбъекта(Объект,Свойство)

Функция глНайтиВТаблице(ТЗ,Значение,Колонка,Добавлять=Ложь) Экспорт
	СтрокаТЗ=ТЗ.Найти(Значение,Колонка);
	Если СтрокаТЗ=Неопределено Тогда
		Если Добавлять Тогда		
			СтрокаТЗ=ТЗ.Добавить();			
			СтрокаТЗ[Колонка]=Значение;	
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтрокаТЗ;
КонецФункции

// <Описание функции>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьСсылкуПоИдентификатору(Тип,Вид,ТекстСсылки) Экспорт
	Если Тип="Справочник" Тогда		
		Возврат Справочники[Вид].ПолучитьСсылку(Новый УникальныйИдентификатор(ТекстСсылки));
	ИначеЕсли Тип="Документ" Тогда
		//крохин начало 06.02.2013
		//херь какая-то
		//Возврат Справочники[Вид].ПолучитьСсылку(Новый УникальныйИдентификатор(ТекстСсылки));
		Возврат Документы[Вид].ПолучитьСсылку(Новый УникальныйИдентификатор(ТекстСсылки));
		//крохин конец 06.20.2013
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции // ()


Процедура ПереключитьДату(ПереключатьИнтерфейс=Ложь) Экспорт
	ДатаЗапретаВидимости=Константы.ДатаЗапретаВидимости.Получить();
	
	Если ЗначениеЗаполнено(ДатаЗапретаВидимости) Тогда
		ДатаЗапретаВидимости=КонецДня(ДатаЗапретаВидимости)+1;
		
		Если ПереключатьИнтерфейс ИЛИ ПараметрыСеанса.ДатаЗапретаВидимости<>ДатаЗапретаВидимости Тогда			
			#Если Клиент ТОГДА
				ГлавныйИнтерфейс.ПереключитьИнтерфейс("Основной");		
			#КонецЕсли		
			ПараметрыСеанса.ДатаЗапретаВидимости	=ДатаЗапретаВидимости;		
		КонецЕсли;		
		ПараметрыСеанса.КонтрольДатыВидимости	=Истина;
	Иначе				
		#Если Клиент ТОГДА
			Если ПараметрыСеанса.КонтрольДатыВидимости И ЗначениеЗаполнено(ПараметрыСеанса.Пользователь.Интерфейс) Тогда
				ГлавныйИнтерфейс.ПереключитьИнтерфейс(ПараметрыСеанса.Пользователь.Интерфейс);			
			КонецЕсли;			
		#КонецЕсли
		
		ПараметрыСеанса.КонтрольДатыВидимости	=Ложь;
		ПараметрыСеанса.ДатаЗапретаВидимости	='00010101';
	КонецЕсли;	
КонецПроцедуры

//крохин начало 22.11.2013
Функция ПервыеБуквы(Слово,КоличествоБукв = Неопределено) Экспорт
	Если КоличествоБукв = Неопределено Тогда
		КоличествоБукв = 1;
	КонецЕсли;
	Для Сч = 1 По КоличествоБукв Цикл
		ТекСимвол = Сред(Слово,Сч,1);
		
		Если ТекСимвол = "0" Или ТекСимвол = "1" ИЛИ ТекСимвол = "2" ИЛИ ТекСимвол = "3" Или ТекСимвол = "4" ИЛИ ТекСимвол = "5" ИЛИ ТекСимвол = "6" Или ТекСимвол = "7" ИЛИ ТекСимвол = "8" ИЛИ ТекСимвол = "9" Тогда 
			Возврат Ложь;			
		КонецЕсли;
		
	КонецЦикла;
	Возврат Истина;
КонецФункции	
//крохин конец 22.11.2013

//крохин начало 11.12.2013

// Кельманов А.В. - HELP-9754 + HELP-9805 - 2026.05.18 {
//Функция ПолучитьНомерСостоянияНакладной(ТекСостояние, БельевойАлгоритм = Ложь) Экспорт
Функция ПолучитьНомерСостоянияНакладной(ТекСостояние, Знач БельевойАлгоритм = Ложь) Экспорт
	
	БельевойАлгоритм = Ложь;
	// Кельманов А.В. - HELP-9754 + HELP-9805 - 2026.05.18 }
	
	Если ТекСостояние = Перечисления.СостоянияНакладной.ВРаботе Тогда
		Возврат 100;
	ИначеЕсли ТекСостояние = Перечисления.СостоянияНакладной.КОтправкеНаСклад Тогда
		Возврат 200;
	ИначеЕсли ТекСостояние = Перечисления.СостоянияНакладной.ПолученоСкладом Тогда
		Возврат 300;				
		// Кухарь А.Ю. 06.04.2020 начало
		//
	ИначеЕсли ТекСостояние = Перечисления.СостоянияНакладной.ОжиданиеКорректировки Тогда
		Возврат 315;	 
		//ие Кухарь А.Ю. 06.04.2020 конец
		
	ИначеЕсли ТекСостояние=Перечисления.СостоянияНакладной.СформированыЗаданияНабора тогда
		Возврат 325;
	ИначеЕсли ТекСостояние=Перечисления.СостоянияНакладной.ПроверенаПоОстаткам тогда		
		Возврат 350;		
	ИначеЕсли ТекСостояние = Перечисления.СостоянияНакладной.ОжиданиеНабора Тогда
		Возврат 400;
	ИначеЕсли ТекСостояние = Перечисления.СостоянияНакладной.ВНаборе Тогда
		Возврат 500;
	ИначеЕсли ТекСостояние = Перечисления.СостоянияНакладной.ОжиданиеСканирования Тогда
		Возврат 600;
	ИначеЕсли ТекСостояние = Перечисления.СостоянияНакладной.Сканирование Тогда
		Возврат 700;
		// Кухарь А.Ю.  11.11.2024 начало
		//
	ИначеЕсли ТекСостояние = Перечисления.СостоянияНакладной.ОжиданиеКомплектацииЧЗ Тогда
		Возврат 745;
	ИначеЕсли ТекСостояние = Перечисления.СостоянияНакладной.КомплектацияЧЗ Тогда
		Возврат 755;
		
		// Кухарь А.Ю.  11.11.2024 конец
		
	ИначеЕсли ТекСостояние = Перечисления.СостоянияНакладной.ОжиданиеДопОбработки Тогда
		//Кухарь 22.11.17 начало
		//У белья доп обработка до сканирования
		//Возврат 800;
		если БельевойАлгоритм тогда
			возврат 550;
		иначе
			возврат 800;
		КонецЕсли;
		//Кухарь 22.11.17 конец		
	ИначеЕсли ТекСостояние = Перечисления.СостоянияНакладной.ДопОбработка Тогда
		//Кухарь 22.11.17 начало
		//У белья доп обработка до сканирования
		//Возврат 900;
		если БельевойАлгоритм тогда
			возврат 560;
		иначе
			возврат 900;
		КонецЕсли;
		//Кухарь 22.11.17 конец		
		//Кухарь 18.08.14 начало	
		//ИначеЕсли ТекСостояние = Перечисления.СостоянияНакладной.ГотоваКОтгрузке Тогда
		//	Возврат 1000;
		//ИначеЕсли ТекСостояние = Перечисления.СостоянияНакладной.ВМашине Тогда
		//	Возврат 1100;
	ИначеЕсли ТекСостояние = Перечисления.СостоянияНакладной.ОжиданиеПереукладки Тогда
		Возврат 1000;	
	ИначеЕсли ТекСостояние = Перечисления.СостоянияНакладной.Переукладка Тогда
		Возврат 1100;
		//Кухарь 27.12.17 начало
		//Термоусадка
	ИначеЕсли ТекСостояние = Перечисления.СостоянияНакладной.ОжиданиеТермоусадки Тогда
		Возврат 1130;	
	ИначеЕсли ТекСостояние = Перечисления.СостоянияНакладной.Термоусадка Тогда
		Возврат 1135	
		//Кухарь 27.12.17 конец		
		
		//Кухарь 16.06.16 начало
	ИначеЕсли ТекСостояние = Перечисления.СостоянияНакладной.ОжиданиеПаллетирования Тогда
		Возврат 1150;	
	ИначеЕсли ТекСостояние = Перечисления.СостоянияНакладной.Паллетирование Тогда
		Возврат 1160	
		//Кухарь 16.06.16 конец
		// Кухарь А.Ю.  15.10.2025 начало
		// HELP-5404 Кухарь
	ИначеЕсли ТекСостояние = Перечисления.СостоянияНакладной.ОжиданиеОбработкиЧЗ Тогда
		Возврат 1180		 
		// Кухарь А.Ю.  15.10.2025 конец
		
	ИначеЕсли ТекСостояние = Перечисления.СостоянияНакладной.ГотоваКОтгрузке Тогда
		Возврат 1200;
	ИначеЕсли ТекСостояние = Перечисления.СостоянияНакладной.ВМашине Тогда
		Возврат 1300;	
		//Кухарь 18.08.14 конец	
	ИначеЕсли ТекСостояние = Перечисления.СостоянияНакладной.Отгружена Тогда
		Возврат 10000;		
	Иначе
		Возврат 0;
	КонецЕсли;
	
	
КонецФункции

Функция ПолучитьСостояниеНакладнойПоНомеру(НомерСостояния) Экспорт
	Если НомерСостояния = 100 Тогда
		Возврат Перечисления.СостоянияНакладной.ВРаботе;
	ИначеЕсли НомерСостояния = 200 Тогда
		Возврат Перечисления.СостоянияНакладной.КОтправкеНаСклад;
	ИначеЕсли НомерСостояния = 300 Тогда
		Возврат Перечисления.СостоянияНакладной.ПолученоСкладом;
		
		// Кухарь А.Ю. 06.04.2020 начало
	ИначеЕсли НомерСостояния = 315 Тогда
		Возврат Перечисления.СостоянияНакладной.ОжиданиеКорректировки;
		// Кухарь А.Ю. 06.04.2020 конец
		
	ИначеЕсли НомерСостояния = 325 Тогда
		Возврат Перечисления.СостоянияНакладной.СформированыЗаданияНабора;
		//Кухарь 10.12.15 начало
	ИначеЕсли НомерСостояния = 350   тогда
		//Кухарь 12.01.16 начало
		//возврат Перечисления.СостоянияНакладной.ГотоваКНабору;
		возврат Перечисления.СостоянияНакладной.ПроверенаПоОстаткам;
		//Кухарь 12.01.16 конец
		//Кухарь 10.12.15 конец
		
	ИначеЕсли НомерСостояния = 400 Тогда
		Возврат Перечисления.СостоянияНакладной.ОжиданиеНабора;
	ИначеЕсли НомерСостояния = 500 Тогда
		Возврат Перечисления.СостоянияНакладной.ВНаборе;
		//Кухарь 22.11.17 начало
		//У белья доп обработка до сканирования
	ИначеЕсли НомерСостояния = 550 Тогда
		Возврат Перечисления.СостоянияНакладной.ОжиданиеДопОбработки;
	ИначеЕсли НомерСостояния = 560 Тогда
		Возврат Перечисления.СостоянияНакладной.ДопОбработка;
		//Кухарь 22.11.17 конец		
	ИначеЕсли НомерСостояния = 600 Тогда
		Возврат Перечисления.СостоянияНакладной.ОжиданиеСканирования;
	ИначеЕсли НомерСостояния = 700 Тогда		
		Возврат Перечисления.СостоянияНакладной.Сканирование;
		// Кухарь А.Ю.  11.11.2024 начало
	ИначеЕсли НомерСостояния = 745 Тогда
		Возврат Перечисления.СостоянияНакладной.ОжиданиеКомплектацииЧЗ;
	ИначеЕсли НомерСостояния = 755 Тогда		
		Возврат Перечисления.СостоянияНакладной.КомплектацияЧЗ;
		// Кухарь А.Ю.  11.11.2024 конец
		
	ИначеЕсли НомерСостояния = 800 Тогда
		Возврат Перечисления.СостоянияНакладной.ОжиданиеДопОбработки;
	ИначеЕсли НомерСостояния = 900 Тогда
		Возврат Перечисления.СостоянияНакладной.ДопОбработка;
		//Кухарь 18.08.14 начало
		//ИначеЕсли НомерСостояния = 1000 Тогда
		//	Возврат Перечисления.СостоянияНакладной.ГотоваКОтгрузке;
		//ИначеЕсли НомерСостояния = 1100 Тогда
		//	Возврат Перечисления.СостоянияНакладной.ВМашине;
	ИначеЕсли НомерСостояния = 1000 Тогда
		Возврат Перечисления.СостоянияНакладной.ОжиданиеПереукладки;	
	ИначеЕсли НомерСостояния = 1100 Тогда
		Возврат Перечисления.СостоянияНакладной.Переукладка;
		//Кухарь 09.11.16 начало
		//Кухарь 27.12.17 начало
		//Термоусадка
	ИначеЕсли НомерСостояния = 1130 Тогда
		Возврат Перечисления.СостоянияНакладной.ОжиданиеТермоусадки;
		
	ИначеЕсли НомерСостояния = 1135 Тогда
		Возврат Перечисления.СостоянияНакладной.Термоусадка;
		
		//Кухарь 27.12.17 конец		
		
	ИначеЕсли НомерСостояния = 1150 Тогда
		Возврат Перечисления.СостоянияНакладной.ОжиданиеПаллетирования;
		
	ИначеЕсли НомерСостояния = 1160 Тогда
		Возврат Перечисления.СостоянияНакладной.Паллетирование;
		
		//Кухарь  09.11.16 конец
		// Кухарь А.Ю.  15.10.2025 начало
		// HELP-5404 Кухарь
	ИначеЕсли НомерСостояния = 1180 Тогда
		Возврат Перечисления.СостоянияНакладной.ОжиданиеОбработкиЧЗ;		 
		// Кухарь А.Ю.  15.10.2025 конец
		
	ИначеЕсли НомерСостояния = 1200 Тогда
		Возврат Перечисления.СостоянияНакладной.ГотоваКОтгрузке;
	ИначеЕсли НомерСостояния = 1300 Тогда
		Возврат Перечисления.СостоянияНакладной.ВМашине;	
		//Кухарь 18.08.14 конец
	ИначеЕсли НомерСостояния = 10000 Тогда
		Возврат Перечисления.СостоянияНакладной.Отгружена;		
	Иначе
		Возврат Перечисления.СостоянияНакладной.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции
//крохин конец 11.12.2013

//кухарь 04.07.14 начало
Функция КонтрольРасписанияОтгрузки(ДатаОтгрузки,ПунктДоставки) Экспорт
	Запрос=новый запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	КалендарьДни.Ссылка
	|ИЗ
	|	Справочник.Календарь.Дни КАК КалендарьДни
	|ГДЕ
	|	КалендарьДни.ПраздничныйДень
	|	И КалендарьДни.Дата = &ДатаОтгрузки
	|	И КалендарьДни.Ссылка.ПометкаУдаления = ложь";
	запрос.УстановитьПараметр("ДатаОтгрузки",ДатаОтгрузки);
	результат=запрос.Выполнить().Выгрузить();
	если результат.Количество()>0 тогда   //праздничный день. отгрузки идут без контроля расписания
		Возврат Истина;
	КонецЕсли;
	
	
	Запрос=новый Запрос;
	Запрос.Текст="ВЫБРАТЬ различные
	|	ДопРеквизитыСправочников.ЗначениеРеквизита как ДеньНедели,
	|	ДопРеквизитыСправочников.ВспомогательноеЗначениеРеквизита как МожноОтгружать
	|ИЗ
	|	РегистрСведений.ДопРеквизитыСправочников КАК ДопРеквизитыСправочников
	|ГДЕ
	|	ДопРеквизитыСправочников.ИмяРеквизита = ""ДеньОтгрузки""
	|	И ДопРеквизитыСправочников.Справочник = &ПунктДоставки";
	запрос.УстановитьПараметр("ПунктДоставки",ПунктДоставки);
	результат=запрос.Выполнить().Выгрузить();
	если результат.Количество()=0 тогда    //расписание для этого пункта доставки ни кем не было установлено
		возврат Истина;
	иначе
		ДеньНеделиОтгрузки=ДеньНедели(ДатаОтгрузки);
		
		Если ДеньНеделиОтгрузки = 1 Тогда 
			ДеньНеделиПрописью = "Понедельник";
		ИначеЕсли ДеньНеделиОтгрузки = 2 Тогда
			ДеньНеделиПрописью = "Вторник";
		ИначеЕсли ДеньНеделиОтгрузки = 3 Тогда 
			ДеньНеделиПрописью = "Среда";
		ИначеЕсли ДеньНеделиОтгрузки = 4 Тогда
			ДеньНеделиПрописью = "Четверг";
		ИначеЕсли ДеньНеделиОтгрузки = 5 Тогда 
			ДеньНеделиПрописью = "Пятница";
		ИначеЕсли ДеньНеделиОтгрузки = 6 Тогда
			ДеньНеделиПрописью = "Суббота";
		ИначеЕсли ДеньНеделиОтгрузки = 7 Тогда
			ДеньНеделиПрописью = "Воскресенье";
		иначе
			#ЕСЛИ КЛИЕНТ ТОГДА
				Сообщить("Отгрузка запрещена, обратитесь в отдел АСУ (Программисты 1С)");
			#КонецЕсли
			возврат ложь;
		КонецЕсли;
		
		СписокРазрешенныхДней=новый СписокЗначений;	
		
		
		
		
		для каждого СтрокаРезультат из результат цикл
			Если ДеньНеделиПрописью=СтрокаРезультат.ДеньНедели и СтрокаРезультат.МожноОтгружать  тогда
				возврат Истина;
			иначе
				если СтрокаРезультат.МожноОтгружать=истина тогда
					СписокРазрешенныхДней.Добавить(СтрокаРезультат.ДеньНедели);
				КонецЕсли;
			КонецЕсли;		
		КонецЦикла;
		
		
		#ЕСЛИ КЛИЕНТ ТОГДА
			если СписокРазрешенныхДней.Количество()>0 тогда
				Сообщить("Отгрузка разрешена в следующие дни недели:");
				для Каждого СтрСписка из СписокРазрешенныхДней цикл
					Сообщить(Строка(СтрСписка.Значение));
				КонецЦикла;
			иначе
				Сообщить("Отгрузка запрещена, обратитесь в отдел АСУ (Программисты 1С)");
			КонецЕсли;
		#КонецЕсли
		возврат ложь;
	КонецЕсли;	
	
КонецФункции
//кухарь 04.07.14 конец


//кухарь 11.04.14 начало
Функция ОпределитьДатуАвизацииДокумента (Документ) экспорт
	если 1=2 тогда
		документ=Документы.РасходнаяНакладная.НайтиПоНомеру();
	КонецЕсли;	
	
	//Кухарь 09.08.15 начало
	//Таки потребовалось ставить дату авизации меньше расчётной
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита как ДатаАвизации
	|ИЗ
	|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
	|ГДЕ
	|	РеквизитыРНКПНКПРМ.Документ = &Документ
	|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = ""ДатаАвизацииДокументаЗаРасчетной"""; 
	запрос.УстановитьПараметр("Документ",Документ.Ссылка);
	результат=запрос.Выполнить().Выгрузить();
	если результат.Количество()>0 тогда
		//Кухарь 04.10.15 начало
		//косяк с типом данных
		//Возврат результат.Получить(0).ДатаАвизации;
		Возврат Дата(результат.Получить(0).ДатаАвизации);
		//Кухарь 04.10.15 конец
	КонецЕсли;	
	//Кухарь 09.08.15 конец	
	
	
	запрос=новый Запрос;
	запрос.Текст="ВЫБРАТЬ
	|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита как ДатаАвизации
	|ИЗ
	|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
	|ГДЕ
	|	РеквизитыРНКПНКПРМ.Документ = &Документ
	|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = ""ДатаАвизацииДокумента"""; 
	//кухарь 28.08.14 начало
	//запрос.УстановитьПараметр("Документ",Документ);
	запрос.УстановитьПараметр("Документ",Документ.Ссылка);
	//кухарь 28.08.14 конец
	результат=запрос.Выполнить().Выгрузить();
	если результат.Количество()>0 тогда
		ДатаИзРег=результат.Получить(0).ДатаАвизации;
	иначе
		ДатаИзРег='00010101';
	КонецЕсли;
	
	//Кухарь 25.05.16 начало
	//Теперь тут ещё и ЗТО у него нет реквизита ПунктДоставки
	//если Документ.ПунктДоставки.ДнейВпути>0 и ЗначениеЗаполнено(Документ.ДатаОтгрузки) тогда 		
	//	ДатаИзЗог= Документ.ДатаОтгрузки+Документ.ПунктДоставки.ДнейВпути*24*3600;
	Если Документ.Метаданные().Имя="ЗаявкаВТранспортныйОтдел" тогда
		ПунктДоставки=Документ.ПунктДоставкиПолучатель;
	иначе
		ПунктДоставки=Документ.ПунктДоставки;
	КонецЕсли;       
	если ложь тогда
		документ=Документы.Перемещение.НайтиПоНомеру("");
	КонецЕсли;
	
	//Кухарь 27.10.16 начало
	//Для ПНК новая странная схема
	если Документ.Ссылка.Метаданные().Имя="ПриходнаяНакладная" тогда
		//Кухарь 04.05.18 начало
		//Тип доставки теперь есть в документе
		//если ПунктДоставки.ТипДоставки=Перечисления.ТипыДоставки.ТранспортнаяКомпания тогда		
		попытка
			если ЗначениеЗаполнено(документ.ТипДоставки) тогда
				ТипДоставки=Документ.ТипДоставки;
			иначе
				ТипДоставки=ПунктДоставки.ТипДоставки;
			КонецЕсли;
		Исключение
			ТипДоставки=ПунктДоставки.ТипДоставки;
		КонецПопытки;
		если ТипДоставки =Перечисления.ТипыДоставки.ТранспортнаяКомпания тогда
			//Кухарь 04.05.18 конец
			ДатаИзЗог= Документ.ДатаОтгрузки+24*3600;
			если ДеньНедели(ДатаИзЗог)=6 тогда
				Сдвиг=2*24*3600;
			ИначеЕсли ДеньНедели(ДатаИзЗог)=7 тогда
				сдвиг=24*3600;
			иначе 
				Сдвиг=0;
			КонецЕсли;
			ДатаИзЗог=ДатаИзЗог+сдвиг;
			
		иначе
			ДатаИзЗог= ПустаяДата();
		КонецЕсли;
		//Кухарь 13.07.17 начало
		//Почти такая же для некоторых ПРМ
	ИначеЕсли Документ.Ссылка.Метаданные().Имя="Перемещение"
		и (документ.Ссылка.Склад.ТипСклада=Перечисления.ТипСклада.ОптовыйТЦ
		или документ.Ссылка.Склад.ТипСклада=Перечисления.ТипСклада.РозничныйТЦ 
		или документ.Ссылка.Склад.ТипСклада=Перечисления.ТипСклада.Филиал) и документ.Ссылка.СкладПолучатель.ТипСклада=Перечисления.ТипСклада.Склад  тогда
		ДатаИзЗог= Документ.ДатаОтгрузки;
		если ДеньНедели(ДатаИзЗог)=6 тогда
			Сдвиг=2*24*3600;
		ИначеЕсли ДеньНедели(ДатаИзЗог)=7 тогда
			сдвиг=24*3600;
		иначе 
			Сдвиг=0;
		КонецЕсли;
		ДатаИзЗог=ДатаИзЗог+сдвиг;
		
		//Кухарь 13.07.17 конец	
	иначе	
		//Кухарь 27.10.16 конец
		
		
		если ПунктДоставки.ДнейВпути>0 и ЗначениеЗаполнено(Документ.ДатаОтгрузки) тогда 		
			ДатаИзЗог= Документ.ДатаОтгрузки+ПунктДоставки.ДнейВпути*24*3600;
			//Кухарь 25.05.16 конец	
			//кухарь 06.08.14 начало
			//если Документ.Метаданные().Имя="РасходнаяНакладная" тогда
			//Кухарь 27.10.16 начало
			//Таки для ПНК будет по другому
			//если Документ.Метаданные().Имя="РасходнаяНакладная" или  Документ.Метаданные().Имя="ПриходнаяНакладная"  тогда
			если Документ.Метаданные().Имя="РасходнаяНакладная"  тогда
				//Кухарь 27.10.16 конец
				
				//кухарь 28.11.14 конец
				
				
				
				Сдвиг=ПолучитьСдвигДатыАвизации(Документ);
				ДатаИзЗог=ДатаИзЗог+сдвиг;
			КонецЕсли;
			//кухарь 06.08.14 конец
		иначе
			//Кухарь 25.07.18 начало
			//Если истина, то дата авизации будет ставиться днём отгрузки
			//ДатаИзЗог='00010101';
			ДоставкаВДеньОтгрузки=ложь;
			если ПунктДоставки.ТипДоставки<>Перечисления.ТипыДоставки.ТранспортнаяКомпания тогда
				ЗапВРег=РегистрыСведений.РеквизитыСправочников.СоздатьНаборЗаписей();	
				ЗапВРег.Отбор.ИмяРеквизита.значение="ДоставкаВДеньОтгрузки";
				ЗапВРег.Отбор.Справочник.значение=ПунктДоставки;
				ЗапВРег.Отбор.ИмяРеквизита.использование=Истина;
				ЗапВРег.Отбор.Справочник.использование=Истина;
				
				ЗапВРег.Прочитать();
				для каждого СтрЗР из ЗапВРег цикл
					ДоставкаВДеньОтгрузки=СтрЗР.ЗначениеРеквизита;
				КонецЦикла;
			КонецЕсли;
			если ДоставкаВДеньОтгрузки=Истина тогда
				ДатаИзЗог=Документ.Ссылка.ДатаОтгрузки;
			иначе
				ДатаИзЗог='00010101';
			КонецЕсли;
			//Кухарь 25.07.18 конец
			
		КонецЕсли;
		//Кухарь 27.10.16 начало 	
	КонецЕсли;	
	//Кухарь 27.10.16 конец
	
	Возврат Макс(Дата(ДатаИзРег),Дата(ДатаИзЗог));	
	
КонецФункции


//Кухарь 13.02.19 начало
//Иногда нужно устанавливать меньше расчётной человеку без полномочий (отработка коррекций)
//Процедура УстановитьДатуАвизацииДокумента (Документ,ДатаАвизации) экспорт
Процедура УстановитьДатуАвизацииДокумента (Документ,ДатаАвизации,НеПроверятьПолномочия=Неопределено) экспорт
	
	//Кухарь 13.02.19 конец	
	
	//Кухарь 25.05.16 начало
	//Теперь тут ещё и ЗТО у него нет реквизита ПунктДоставки
	//если Документ.ПунктДоставки.ДнейВпути>0 и ЗначениеЗаполнено(Документ.ДатаОтгрузки) тогда 		
	//	ДатаИзЗог= Документ.ДатаОтгрузки+Документ.ПунктДоставки.ДнейВпути*24*3600;
	Если Документ.Метаданные().Имя="ЗаявкаВТранспортныйОтдел" тогда
		ПунктДоставки=Документ.ПунктДоставкиПолучатель;
	иначе
		ПунктДоставки=Документ.ПунктДоставки;
	КонецЕсли;       
	
	если ПунктДоставки.ДнейВпути>0 и ЗначениеЗаполнено(Документ.ДатаОтгрузки) тогда 		
		ДатаИзЗог= Документ.ДатаОтгрузки+ПунктДоставки.ДнейВпути*24*3600;
		//Кухарь 25.05.16 конец	
		
		//при определении расчётной даты нужно учитывать график отгрузки ТК
		//если Документ.Метаданные().Имя="РасходнаяНакладная" тогда
		если Документ.Метаданные().Имя="РасходнаяНакладная" или  Документ.Метаданные().Имя="ПриходнаяНакладная"  тогда
			//кухарь 28.11.14 конец
			Сдвиг=ПолучитьСдвигДатыАвизации(Документ);
			ДатаИзЗог=ДатаИзЗог+сдвиг;
		КонецЕсли;
		//кухарь 23.10.14 конец
		
		
	иначе 
		ДатаИзЗог='00010101';
	КонецЕсли;
	//кухарь 30.07.14 конец
	//кухарь 03.09.14 начало
	//запретим делать записи для не записанных накладных
	если Документ.дата<>'00010101' тогда	
		//кухарь 03.09.14 конец
		если ДатаАвизации>=ДатаИзЗог тогда	
			ЗаписьВРег=РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьМенеджерЗаписи();
			ЗаписьВРег.Документ=Документ;
			//Кухарь 09.08.15 начало
			//Таки потребовалось ставить дату авизации меньше расчётной
			//ЗаписьВРег.ИмяРеквизита="ДатаАвизацииДокумента";
			//Кухарь 13.02.19 начало
			//Иногда нужно устанавливать меньше расчётной человеку без полномочий (отработка коррекций)			
			//если ПолучитьПолномочиеПользователя("УстановкаДатыАвизацииМеньшеРасчетной")  тогда
			если ПолучитьПолномочиеПользователя("УстановкаДатыАвизацииМеньшеРасчетной")  или НеПроверятьПолномочия=истина тогда
				//Кухарь 13.02.19 конец	
				ЗаписьВРег.ИмяРеквизита="ДатаАвизацииДокументаЗаРасчетной";
			Иначе 
				ЗаписьВРег.ИмяРеквизита="ДатаАвизацииДокумента";
			КонецЕсли;
			//Кухарь 09.08.15 конец
			ЗаписьВРег.Период=Документ.Дата;
			ЗаписьВРег.ЗначениеРеквизита=ДатаАвизации;
			ЗаписьВРег.Записать();
			//Кухарь 04.10.15 начало
			#ЕСЛИ КЛИЕНТ ТОГДА
				//Кухарь 04.10.15 конец
				Сообщить("Дата авизации изменена");
				//Кухарь 04.10.15 Начало
			#КонецЕсли
			//Кухарь 04.10.15 конец
		иначе
			//Кухарь 09.08.15 начало
			//Таки потребовалось ставить дату авизации меньше расчётной
			//Сообщить("Нельзя ставить дату авизации, меньше чем расчётная.");
			//Кухарь 13.02.19 начало
			//Иногда нужно устанавливать меньше расчётной человеку без полномочий (отработка коррекций)			
			//если ПолучитьПолномочиеПользователя("УстановкаДатыАвизацииМеньшеРасчетной")  тогда
			если ПолучитьПолномочиеПользователя("УстановкаДатыАвизацииМеньшеРасчетной")  или НеПроверятьПолномочия=истина тогда
				//Кухарь 13.02.19 конец	
				
				ЗаписьВРег=РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьМенеджерЗаписи();
				ЗаписьВРег.Документ=Документ;
				ЗаписьВРег.ИмяРеквизита="ДатаАвизацииДокументаЗаРасчетной";
				ЗаписьВРег.Период=Документ.Дата;
				ЗаписьВРег.ЗначениеРеквизита=ДатаАвизации;
				ЗаписьВРег.Записать();
				//Кухарь 04.10.15 начало
				#ЕСЛИ КЛИЕНТ ТОГДА
					//Кухарь 04.10.15 конец
					Сообщить("Дата авизации изменена");	
					//Кухарь 04.10.15 начало
				#КонецЕсли
				//Кухарь 04.10.15 конец
			иначе
				//Кухарь 04.10.15 начало
				#ЕСЛИ КЛИЕНТ ТОГДА
					//Кухарь 04.10.15 конец
					Сообщить("Нельзя ставить дату авизации, меньше чем расчётная.");
					//Кухарь 04.10.15 начало
				#КонецЕсли
				//Кухарь 04.10.15 конец
			КонецЕсли;
			//Кухарь 09.08.15 конец
			
		КонецЕсли;
		//кухарь 03.09.14 начало
	иначе
		#если Клиент тогда
			Сообщить("Нельзя ставить дату авизации в незаписанных накладных.");
		#КонецЕсли
	КонецЕсли;	
	//кухарь 03.09.14 конец
	
КонецПроцедуры
//кухарь 11.04.14 конец

//Кухарь 06.08.14 начало
Функция ПолучитьСдвигДатыАвизации(Документ)
	если 1=2 тогда
		документ=Документы.РасходнаяНакладная.НайтиПоНомеру();
	КонецЕсли;
	
	
	//Кухарь 10.06.16 начало
	//У некоторых в субботу принимают, им на будние дни не перекидываем
	запрос=новый запрос;
	запрос.текст="ВЫБРАТЬ различные 
	|	ДопРеквизитыСправочников.ЗначениеРеквизита КАК ДеньНедели
	|ИЗ
	|	РегистрСведений.ДопРеквизитыСправочников КАК ДопРеквизитыСправочников
	|ГДЕ
	|	ДопРеквизитыСправочников.ИмяРеквизита = ""ДеньПриемки""
	|	И ДопРеквизитыСправочников.Справочник = &Справочник
	|	И ДопРеквизитыСправочников.ВспомогательноеЗначениеРеквизита=истина";
	запрос.УстановитьПараметр("Справочник",Документ.ПунктДоставки);	
	результат=запрос.Выполнить().Выбрать();
	ГрузимВСубботу=ложь;
	ГрузимВВоскресенье=ложь;
	пока результат.Следующий() цикл
		если результат.ДеньНедели="Суббота" тогда
			ГрузимВСубботу=Истина;
		ИначеЕсли результат.ДеньНедели="Воскресенье" тогда
			ГрузимВВоскресенье=Истина;
		КонецЕсли;
	КонецЦикла;
	//Кухарь 10.06.16 конец
	
	
	запрос=новый запрос;
	запрос.текст="ВЫБРАТЬ различные 
	|	ДопРеквизитыСправочников.ЗначениеРеквизита КАК ДеньНедели
	|ИЗ
	|	РегистрСведений.ДопРеквизитыСправочников КАК ДопРеквизитыСправочников
	|ГДЕ
	|	ДопРеквизитыСправочников.ИмяРеквизита = ""ДеньОтгрузкиДляРНК""
	|	И ДопРеквизитыСправочников.Справочник = &Справочник
	|	И ДопРеквизитыСправочников.ВспомогательноеЗначениеРеквизита=истина";
	запрос.УстановитьПараметр("Справочник",Документ.ПунктДоставки);	
	результат=запрос.Выполнить().Выгрузить();
	если результат.Количество()=0 тогда
		Сдвиг=0;
		
		//Кухарь 10.06.16 начало
		//У некоторых в субботу принимают, им на будние дни не перекидываем
		//если ДеньНедели(Документ.ДатаОтгрузки+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=6 тогда
		//	Сдвиг=Сдвиг+2*24*60*60;
		//ИначеЕсли ДеньНедели(Документ.ДатаОтгрузки+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=7 тогда
		//	Сдвиг=Сдвиг+24*60*60;
		если ДеньНедели(Документ.ДатаОтгрузки+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=6 и не ГрузимВСубботу тогда
			Сдвиг=Сдвиг+2*24*60*60;
		ИначеЕсли ДеньНедели(Документ.ДатаОтгрузки+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=7 и не ГрузимВВоскресенье тогда
			Сдвиг=Сдвиг+24*60*60;	
			//Кухарь 10.06.16 конец			
		КонецЕсли;
		
		возврат Сдвиг;
	иначе
		тз=новый СписокЗначений;
		для Каждого СтрРезультата из результат цикл
			если СтрРезультата.деньнедели="Понедельник" тогда
				текдень=1;
			иначеесли СтрРезультата.деньнедели="Вторник" тогда
				текдень=2;
			иначеесли СтрРезультата.деньнедели="Среда" тогда
				текдень=3;
			иначеесли СтрРезультата.деньнедели="Четверг" тогда
				текдень=4;
			иначеесли СтрРезультата.деньнедели="Пятница" тогда
				текдень=5;
			иначеесли СтрРезультата.деньнедели="Суббота" тогда
				текдень=6;			
			иначеесли СтрРезультата.деньнедели="Воскресенье" тогда
				текдень=7;
			КонецЕсли;		
			тз.Добавить(текдень);		
		КонецЦикла;
		тз.СортироватьПоЗначению();
		для Каждого СтрСписка из тз цикл
			если ДеньНедели(Документ.ДатаОтгрузки)<=СтрСписка.Значение тогда
				НашлиСдвиг=Истина;
				Сдвиг=(СтрСписка.Значение-ДеньНедели(Документ.ДатаОтгрузки))*24*60*60;
				//Кухарь 10.06.16 начало
				//У некоторых в субботу принимают, им на будние дни не перекидываем
				//если ДеньНедели(Документ.ДатаОтгрузки+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=6 тогда
				//	Сдвиг=Сдвиг+2*24*60*60;
				//ИначеЕсли ДеньНедели(Документ.ДатаОтгрузки+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=7 тогда
				//	Сдвиг=Сдвиг+24*60*60;
				если ДеньНедели(Документ.ДатаОтгрузки+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=6 и не ГрузимВСубботу тогда
					Сдвиг=Сдвиг+2*24*60*60;
				ИначеЕсли ДеньНедели(Документ.ДатаОтгрузки+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=7 и не ГрузимВВоскресенье тогда
					Сдвиг=Сдвиг+24*60*60;
					
					//Кухарь 10.06.16 	
				КонецЕсли;
				возврат Сдвиг;
			КонецЕсли;
		КонецЦикла;
		Сдвиг=(тз.Получить(0).Значение+7-ДеньНедели(Документ.ДатаОтгрузки))*24*60*60;
		//Кухарь 10.06.16 начало
		//У некоторых в субботу принимают, им на будние дни не перекидываем
		//если ДеньНедели(Документ.ДатаОтгрузки+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=6 тогда
		//	Сдвиг=Сдвиг+2*24*60*60;
		//ИначеЕсли ДеньНедели(Документ.ДатаОтгрузки+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=7 тогда
		//	Сдвиг=Сдвиг+24*60*60;
		если ДеньНедели(Документ.ДатаОтгрузки+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=6 и не ГрузимВСубботу тогда
			Сдвиг=Сдвиг+2*24*60*60;
		ИначеЕсли ДеньНедели(Документ.ДатаОтгрузки+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=7 и не ГрузимВВоскресенье тогда
			Сдвиг=Сдвиг+24*60*60;
			
			//Кухарь 10.06.16 	
		КонецЕсли;
		
		возврат Сдвиг;
		
		
	КонецЕсли;
	
	
	
	
	
КонецФункции
//кухарь 06.08.14 конец

//Кухарь 18.08.14 начало
//Кухарь  29.10.2021 начало
// Функция ПолучитьЛистыПереукладки(ДокОснование,) экспорт
Функция ПолучитьЛистыПереукладки(ДокОснование,НеУчитыватьПриОпределенииКоличестваМест=ложь) экспорт
	//Кухарь  29.10.2021 конец
	
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ЛистПереукладки.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЛистПереукладки КАК ЛистПереукладки
	|ГДЕ
	|	ЛистПереукладки.ДокОснование = &ДокОснование
	|	И ЛистПереукладки.Проведен
	|	И ЛистПереукладки.НеУчитыватьПриОпределенииКоличестваМест = &НеУчитыватьПриОпределенииКоличестваМест";
	//Кухарь  29.10.2021 начало
	Запрос.УстановитьПараметр("НеУчитыватьПриОпределенииКоличестваМест",НеУчитыватьПриОпределенииКоличестваМест);
	//Кухарь  29.10.2021 конец
	
	
	Запрос.УстановитьПараметр("ДокОснование",ДокОснование);
	
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции
//Кухарь 18.08.14 конец

//кухарь 08.09.14 начало
//запись количества коробок и объёма коробок в регистр, чтобы уйти от реквизитов
Процедура ЗаписатьКоличествоИОбъемКоробовВРегистр(ДокОбъект,КоличествоКоробок,ОбъемКоробов) экспорт
	//Кухарь 27.09.19 начало
	//Пока что больше не пишем в РС
	возврат ;
	//Кухарь 27.09.19 конец
	
	
	Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ДокОбъект)) Тогда //ДокОбъект это ссылка
		ДокСсылка	= ДокОбъект;	
		ДокДата	    = ПолучитьРеквизитШапки(ДокСсылка,"Дата");
	Иначе
		ДокСсылка	= ДокОбъект.Ссылка;
		ДокДата	    = ДокОбъект.Дата; 		
	КонецЕсли;
	
	ЗаписьВРег=РегистрыСведений.РеквизитыДокументов.СоздатьМенеджерЗаписи();
	
	ЗаписьВРег.Документ			= ДокСсылка;
	ЗаписьВРег.ИмяРеквизита		= "КоличествоКоробок";
	ЗаписьВРег.Период			= ДокДата;
	ЗаписьВРег.ЗначениеРеквизита= КоличествоКоробок;
	ЗаписьВРег.Записать();
	
	ЗаписьВРег=РегистрыСведений.РеквизитыДокументов.СоздатьМенеджерЗаписи();
	
	ЗаписьВРег.Документ			= ДокСсылка;
	ЗаписьВРег.ИмяРеквизита		= "ОбъемКоробов";
	ЗаписьВРег.Период			= ДокДата;
	ЗаписьВРег.ЗначениеРеквизита= ОбъемКоробов;
	
	ЗаписьВРег.Записать();	
КонецПроцедуры
//кухарь 08.09.14 конец

//кухарь 08.09.14 начало
//запись количества коробок и объёма коробок в регистр, чтобы уйти от реквизитов
Функция ПолучитьКоличествоИОбъемКоробовИзРегистра(ДокОбъект) экспорт
	//Кухарь 27.09.19 начало
	//Пока что не читаем из РС
	возврат новый Структура("КоличествоКоробок,ОбъемКоробов",ДокОбъект.КоличествоКоробок,ДокОбъект.ОбъемКоробов);
	//Кухарь 27.09.19 конец
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ	
	|	СУММА(ВЫБОР КОГДА ИмяРеквизита=""ОбъемКоробов"" 		ТОГДА ВЫРАЗИТЬ(ЗначениеРеквизита КАК Число(10,4))	ИНАЧЕ 0 КОНЕЦ) КАК ОбъемКоробов,
	|	СУММА(ВЫБОР КОГДА ИмяРеквизита=""КоличествоКоробок"" 	ТОГДА ВЫРАЗИТЬ(ЗначениеРеквизита КАК Число(10,0))	ИНАЧЕ 0 КОНЕЦ) КАК КоличествоКоробок
	|ИЗ
	|	РегистрСведений.РеквизитыДокументов
	|ГДЕ
	|	Документ 			= &ДокументСсылка
	|	И (ИмяРеквизита 	= ""ОбъемКоробов"" ИЛИ ИмяРеквизита 	= ""КоличествоКоробок"")	
	|";
	
	Запрос.УстановитьПараметр("ДокументСсылка",	Докобъект.Ссылка);
	
	РезКоличествоКоробок=Запрос.Выполнить().Выгрузить();
	
	Результат=Новый Структура("КоличествоКоробок,ОбъемКоробов",0,0);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.КоличествоКоробок<>NULL  Тогда
		ЗаполнитьЗначенияСвойств(Результат,Выборка);	
	КонецЕсли; 
	
	Возврат Результат;	
КонецФункции
//кухарь 08.09.14 конец

//кухарь 05.05.15 начало
Функция ФинальныйПересчетКоробокИОбъемов(Докобъект)  экспорт
	ТЗ=новый ТаблицаЗначений;
	тз.Колонки.Добавить("КоличествоКоробок");
	тз.Колонки.Добавить("ОбъемКоробов");
	
	СтрТз=тз.Добавить();
	стртз.КоличествоКоробок=0;
	стртз.ОбъемКоробов=0;
	/////////////Листы переукладки
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛистПереукладки.Ссылка) КАК КоличествоКоробок,
	|	СУММА(ЛистПереукладки.ОбъемДокумента) КАК ОбъемКоробов
	|ИЗ
	|	Документ.ЛистПереукладки КАК ЛистПереукладки
	|ГДЕ
	|	ЛистПереукладки.Проведен
	|	И ЛистПереукладки.ДокОснование = &ДокОснование
	|	И НЕ ЛистПереукладки.НеУчитыватьПриОпределенииКоличестваМест";
	запрос.УстановитьПараметр("ДокОснование",Докобъект.ссылка);
	результат=запрос.Выполнить().Выбрать();
	пока результат.Следующий() цикл
		если результат.КоличествоКоробок<>Null тогда
			если результат.КоличествоКоробок>0 Тогда
				ЗаполнитьЗначенияСвойств(СтрТз,результат);
				возврат СтрТз;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	/////////////Листы набора
	запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ
	|	СУММА(ЛистНабора.ОбъемКоробов) КАК ОбъемКоробов,
	|	СУММА(ЛистНабора.КоличествоКоробок) КАК КоличествоКоробок
	|ИЗ
	|	Документ.ЛистНабора КАК ЛистНабора
	|ГДЕ
	|	ЛистНабора.Проведен
	// Кухарь А.Ю.  07.08.2022 начало
	// Загруженные с ТСД ЛН
	| и не	ЛистНабора.ТребуетПроверки
	// Кухарь А.Ю.  07.08.2022 конец	
	|	И ЛистНабора.ДокОснование = &ДокОснование";
	запрос.УстановитьПараметр("ДокОснование",Докобъект.ссылка);
	результат=запрос.Выполнить().Выбрать();
	пока результат.Следующий() цикл
		если результат.КоличествоКоробок<>Null тогда
			если результат.КоличествоКоробок>0 Тогда
				ЗаполнитьЗначенияСвойств(СтрТз,результат);
				возврат СтрТз;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	////////////
	
	
	ЗаполнитьЗначенияСвойств(СтрТз,Докобъект);
	возврат СтрТз;
	
	
КонецФункции
//кухарь 05.05.15 конец


Функция ЗаписатьЗначениеВРеквизитыРНКПНКПРМ(ИмяРеквизита,ЗначениеРеквизита,ДокОбъектСсылка) экспорт
	// Кухарь А.Ю.  12.12.2024 начало
	если ЗначениеРеквизита<>Неопределено тогда 
		// Кухарь А.Ю.  12.12.2024 конец
		
		
		ЗаписьВРег=РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьМенеджерЗаписи();
		ЗаписьВРег.Документ=ДокОбъектСсылка;
		ЗаписьВРег.ИмяРеквизита=ИмяРеквизита;
		ЗаписьВРег.Период=ДокОбъектСсылка.Дата;
		ЗаписьВРег.ЗначениеРеквизита=ЗначениеРеквизита;
		ЗаписьВРег.Записать();
		// Кухарь А.Ю.  12.12.2024 начало
	иначе
		ЗапВРег=РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();	
		ЗапВРег.Отбор.ИмяРеквизита.значение=ИмяРеквизита;
		ЗапВРег.Отбор.Документ.значение=ДокОбъектСсылка;
		ЗапВРег.Отбор.ИмяРеквизита.использование=Истина;
		ЗапВРег.Отбор.Документ.использование=Истина;	
		ЗапВРег.Прочитать();
		ЗапВРег.Очистить();
		ЗапВРег.Записать();		
	КонецЕсли;
	// Кухарь А.Ю.  12.12.2024 конец
	
	
	
КонецФункции

//Кухарь 10.02.16 начало
//Работа со временем приёмки
Функция ПолучитьВремяПриемки (Документ) Экспорт
	если ложь тогда 
		Документ=Документы.РасходнаяНакладная.НайтиПоНомеру("");
	КонецЕсли;
	
	ВремяПриемки=Справочники.ВремяПриемки.ПустаяСсылка();
	
	если Документ.Ссылка=Документы.РасходнаяНакладная.ПустаяСсылка() тогда
		возврат ВремяПриемки;
	КонецЕсли;
	
	
	
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	РеквизитыДокументов.ЗначениеРеквизита КАК ВремяПриемки
	|ИЗ
	|	РегистрСведений.РеквизитыДокументов КАК РеквизитыДокументов
	|ГДЕ
	|	РеквизитыДокументов.Документ = &Документ
	|	И РеквизитыДокументов.ИмяРеквизита = ""ВремяПриемкиДляЗОГ""";
	
	запрос.УстановитьПараметр("Документ",Документ.Ссылка);
	результат=запрос.Выполнить().выбрать();
	пока результат.Следующий() цикл
		ВремяПриемки=результат.ВремяПриемки;
	КонецЦикла;
	
	Возврат ВремяПриемки;
	
	
	
КонецФункции


Процедура ЗаписатьВремяПриемкиДляЗОГ (Документ,ВремяПриемки) Экспорт 
	
	если ложь тогда 
		Документ=Документы.РасходнаяНакладная.НайтиПоНомеру("");
		ВремяПриемки=Справочники.ВремяПриемки.НайтиПоКоду("");
	КонецЕсли;
	
	если Документ.Ссылка=Документы.РасходнаяНакладная.ПустаяСсылка() тогда
		#Если Клиент Тогда
			Сообщить("Перед установкой времени приемки нужно записать документ.");
		#КонецЕсли	
		Возврат;
	КонецЕсли;
	
	если ВремяПриемки=Справочники.ВремяПриемки.ПустаяСсылка() тогда
		#Если Клиент Тогда
			Сообщить("Нельзя записывать пустое время приемки.");
		#КонецЕсли	
		Возврат;
	КонецЕсли;
	
	
	ЗаписьВРег=РегистрыСведений.РеквизитыДокументов.СоздатьМенеджерЗаписи();
	ЗаписьВРег.Документ=Документ.Ссылка;
	ЗаписьВРег.ИмяРеквизита="ВремяПриемкиДляЗОГ";
	ЗаписьВРег.Период=Документ.Ссылка.Дата;
	ЗаписьВРег.ЗначениеРеквизита=ВремяПриемки;
	ЗаписьВРег.Записать();
	
	
КонецПроцедуры
//Кухарь 10.02.16 конец

//Кухарь 19.05.16 начало
//Данилова Е.В. 17.03.2026 SNL-27 добавлен параметр
Функция ПолучитьСписокШКкоробокЛистаНабора (ЛН,ПечатьПоНовому = ложь,ДанныеДляПерезаписиНомеров = неопределено,ЗаписыватьВРС = Истина) экспорт 
	//++Данилова Е.В. 17.03.2026 SNL-27  
	//Данилова Е.В. 13.05.2026 HELP-9756 добавлен параметр
	Возврат Обработки.ПечатьЛистаНабора.ПолучитьСписокШКкоробокЛистаНабораИПереукладки(ЛН,ПечатьПоНовому,ДанныеДляПерезаписиНомеров,ЗаписыватьВРС); 
	//--Данилова Е.В. 17.03.2026 
	ТЗ=новый таблицазначений;
	тз.Колонки.Добавить("НомерКоробкиЛН");	
	тз.Колонки.Добавить("НомерКоробки");
	тз.Колонки.Добавить("ШК");		
	тз.Колонки.Добавить("Номенклатура");
	тз.Колонки.Добавить("ШтукВКоробке");  
	
	Запрос = Новый Запрос; 
	//++Данилова Е.В. 13.02.2026  SNL-139
	//Запрос.Текст = "ВЫБРАТЬ
	//|	СУММА(ЛистНабора.КоличествоКоробок) КАК КоличествоКоробок
	//|ИЗ
	//|	Документ.ЛистНабора КАК ЛистНабора
	//|ГДЕ
	//|	ЛистНабора.Проведен
	//|	И ЛистНабора.Дата < &Дата
	//|	И ЛистНабора.Дата >= &ДатаНач
	//|	И ЛистНабора.ДокОснование = &ДокОснование
	//|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.Текст = "ВЫБРАТЬ
	|	СУММА(ЛистНабораДок.КоличествоКоробок) КАК КоличествоКоробок
	|ИЗ
	|	Документ.ЛистНабора КАК ЛистНабораДок
	|ГДЕ
	|	ЛистНабораДок.Проведен
	|	И ЛистНабораДок.Дата < &Дата
	|	И ЛистНабораДок.Дата >= &ДатаНач
	|	И ЛистНабораДок.ДокОснование = &ДокОснование
	|АВТОУПОРЯДОЧИВАНИЕ";
    //--Данилова Е.В. 13.02.2026 
	запрос.УстановитьПараметр("ДокОснование",ЛН.докоснование);
	запрос.УстановитьПараметр("Дата",ЛН.дата);
	
	запрос.УстановитьПараметр("ДатаНач",ЛН.дата-30*24*3600);
	НомерНачКоробки=1;
	//++Данилова Е.В. 13.02.2026 SNL-139 
	если ТипЗнч(ЛН) = Тип("ДокументСсылка.ЛистПереукладки") или ТипЗнч(ЛН) = Тип("ДокументОбъект.ЛистПереукладки") тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Документ.ЛистНабора","Документ.ЛистПереукладки"); 
	КонецЕсли;
	//--Данилова Е.В. 13.02.2026 
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	пока РезультатЗапроса.Следующий() цикл
		если результатЗапроса.КоличествоКоробок=Null тогда Продолжить;КонецЕсли; 
		НомерНачКоробки=НомерНачКоробки+РезультатЗапроса.КоличествоКоробок;
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	//++Данилова Е.В. 13.02.2026 
	//Запрос.Текст = "ВЫБРАТЬ
	//|	ЛистНабора.Номер,
	//|	ЛистНабора.КоличествоКоробок
	//|ИЗ
	//|	Документ.ЛистНабора КАК ЛистНабора
	//|ГДЕ
	//|	ЛистНабора.Проведен
	//|	И ЛистНабора.Дата = &Дата
	//|	И ЛистНабора.ДокОснование = &ДокОснование
	//|	И ЛистНабора.Ссылка <> &Ссылка
	//|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛистНабораДок.Номер,
	|	ЛистНабораДок.КоличествоКоробок
	|ИЗ
	|	Документ.ЛистНабора КАК ЛистНабораДок
	|ГДЕ
	|	ЛистНабораДок.Проведен
	|	И ЛистНабораДок.Дата = &Дата
	|	И ЛистНабораДок.ДокОснование = &ДокОснование
	|	И ЛистНабораДок.Ссылка <> &Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";
	//--Данилова Е.В. 13.02.2026 
	запрос.УстановитьПараметр("ДокОснование",ЛН.докоснование);
	запрос.УстановитьПараметр("Дата",ЛН.дата);
	запрос.УстановитьПараметр("Ссылка",ЛН.ссылка);
	//++Данилова Е.В. 13.02.2026 SNL-139 
	если ТипЗнч(ЛН) = Тип("ДокументСсылка.ЛистПереукладки") или ТипЗнч(ЛН) = Тип("ДокументОбъект.ЛистПереукладки") тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Документ.ЛистНабора","Документ.ЛистПереукладки"); 
	КонецЕсли;
	//--Данилова Е.В. 13.02.2026
	Рез=запрос.Выполнить().выбрать();
	Пока рез.Следующий() цикл
		Если Число(Прав(Рез.Номер,5))<Число(Прав(ЛН.Номер,5)) тогда
			НомерНачКоробки=НомерНачКоробки+Рез.КоличествоКоробок;
		КонецЕсли;
	КонецЦикла;
	
	
	если лн.ТипШК=Перечисления.ТипыШтрихКодов.Коробка тогда
		ТабНоменклатурыПоКоробам=новый ТаблицаЗначений;
		ТабНоменклатурыПоКоробам.Колонки.Добавить("Номенклатура");
		ТабНоменклатурыПоКоробам.Колонки.Добавить("ШтукВКоробке"); 
		Для Каждого СтрокаТЧ Из ЛН.Товары Цикл
			КоличествоКоробов=?(СтрокаТЧ.ШтВКоробе=0,СтрокаТЧ.количество,СтрокаТЧ.количество/СтрокаТЧ.ШтВКоробе);
			Для СчКоробов=1 по КоличествоКоробов цикл
				СтрТабНом=ТабНоменклатурыПоКоробам.Добавить();
				СтрТабНом.Номенклатура=СтрокаТЧ.Номенклатура;
				СтрТабНом.ШтукВКоробке=СтрокаТЧ.ШтВКоробе; 
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	если ТипЗнч(ЛН) = Тип("ДокументСсылка.ЛистНабора") или ТипЗнч(ЛН) = Тип("ДокументОбъект.ЛистНабора") тогда
		ЭтоЛН=Истина;
	иначе
		ЭтоЛН=Ложь;
	КонецЕсли;
	
	Для Сч=1 по ЛН.КоличествоКоробок Цикл 
		СтрТЗ=тз.Добавить();
		СтрТЗ.НомерКоробкиЛН=сч;
		
		// Кухарь А.Ю. 01.05.2025 начало
		если не ПечатьПоНовому тогда		
			// Кухарь А.Ю. 01.05.2025 конец
			//++Данилова Е.В. 10.02.2026  SNL-138 для ПНК
			Если ЭтоЛН
				И Не ЗначениеЗаполнено(ЛН.ШКЛистаНабора) Тогда  
				ТекШК = ""; 	
			Иначеесли ЭтоЛН тогда
				//--Данилова Е.В. 10.02.2026
				ТекШК=ЛН.ШКЛистаНабора+формат(Сч,"ЧЦ=5; ЧВН=");
				ТекШК=ТекШК+КонтрольныйСимволEAN(ТекШК,13);
			иначе
				ТекШК=ЛН.ШтрихКод;		
			КонецЕсли;
			// Кухарь А.Ю. 01.05.2025 начало
		Иначе
			
		КонецЕсли;		
		// Кухарь А.Ю. 01.05.2025 конец
		
		СтрТЗ.НомерКоробки=НомерНачКоробки+сч-1;
		СтрТЗ.ШК=ТекШК;
		
		если лн.ТипШК=Перечисления.ТипыШтрихКодов.Коробка и ТабНоменклатурыПоКоробам.Количество()>0 тогда
			ТекСтрокаНоменклатурыПоКоробам= ТабНоменклатурыПоКоробам.Получить(Сч-1);
			ТекНоменклатура=ТекСтрокаНоменклатурыПоКоробам.номенклатура;
			ТекШтукВКоробке=ТекСтрокаНоменклатурыПоКоробам.ШтукВКоробке;			 
		иначе
			ТекШтукВКоробке=ЛН.КоличествоДокумента; 
			если ЛН.товары.количество()>1 тогда
				ТекНоменклатура = ЛН.ГруппыТоваров+" mix";
			ИначеЕсли ЛН.товары.количество()=0 тогда
				ТекНоменклатура = "Номенклатура: Сборная ("+ ЛН.ГруппыТоваров+")";
			иначе
				ТекНоменклатура = "АРТ: "+ ЛН.товары.получить(0).Номенклатура;
			КонецЕсли;
		КонецЕсли;
		СтрТЗ.ШтукВКоробке=ТекШтукВКоробке; 
		СтрТЗ.номенклатура=ТекНоменклатура;
	КонецЦикла;
	Возврат ТЗ;	
	
	
КонецФункции


// Кельманов А.В. - HELP-7944 - 2026.01.20 {
//Функция ПолучитьНомерКоробкиПоШК (ШК, ЛН=Неопределено) экспорт
Функция ПолучитьНомерКоробкиПоШК (ШК, ЛН = Неопределено, СообщатьВМодуле = Истина, ТекстОшибки = "") Экспорт
// Кельманов А.В. - HELP-7944 - 2026.01.20 }    

СтруктураВозврата=новый Структура;
//Кухарь 31.01.17 начало
Если Сред(ШК,8,5)="00000" и СтрДлина(ШК)=13 Тогда
	Возврат Неопределено;
КонецЕсли;
//Кухарь 31.01.17 конец	

Если ЛН=Неопределено или ЛН=Документы.ЛистНабора.ПустаяСсылка() и СтрДлина(ШК)=13 тогда
	//Кухарь 03.10.2023 начало
	//ЛН=Документы.ЛистНабора.НайтиПоРеквизиту("ШКЛистаНабора",Лев(ШК,7));
	ДатаПоиска=Константы.ДатаЗапретаРедактирования.Получить()-3*30*24*3600;
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ первые 1
	|	ЛистНабора.Ссылка КАК ЛН,
	|	ЛистНабора.Дата КАК Дата
	|ИЗ
	|	Документ.ЛистНабора КАК ЛистНабора
	|ГДЕ
	|	ЛистНабора.Дата >= &Дата
	|	И ЛистНабора.Проведен
	|	И ЛистНабора.ШКЛистаНабора = &ШКЛистаНабора
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	запрос.УстановитьПараметр("ШКЛистаНабора",Лев(ШК,7));
	запрос.УстановитьПараметр("Дата",ДатаПоиска);
	ЛН=Документы.ЛистНабора.ПустаяСсылка();
	результат=запрос.Выполнить().Выбрать();
	пока результат.Следующий() цикл
		ЛН=результат.ЛН;   
		
		// Кухарь А.Ю.  10.04.2026 начало
		//Добавили новую ТЧ НомераКоробок теперь брать нужно из неё
		Попытка
			НомерКоробкиЛН = число(прав(лев(шк,12),5));
		Исключение 
			НомерКоробкиЛН = 0;
		КонецПопытки;   
		если НомерКоробкиЛН > 0 тогда
			запрос.Текст = "ВЫБРАТЬ
			|	ЛистНабораНомераКоробок.Ссылка КАК Ссылка,
			|	ЛистНабораНомераКоробок.НомерСтроки КАК НомерСтроки,
			|	ЛистНабораНомераКоробок.НомерКоробки КАК НомерКоробки,
			|	ЛистНабораНомераКоробок.Номенклатура КАК Номенклатура
			|ИЗ
			|	Документ.ЛистНабора.НомераКоробок КАК ЛистНабораНомераКоробок
			|ГДЕ
			|	ЛистНабораНомераКоробок.Ссылка = &ЛН
			|	И ЛистНабораНомераКоробок.НомерСтроки = &НомерКоробкиЛН";  
			запрос.УстановитьПараметр("ЛН",ЛН);  
			запрос.УстановитьПараметр("НомерКоробкиЛН",НомерКоробкиЛН); 
			ВыборкаНомераКоробок = запрос.Выполнить().Выбрать();
			пока ВыборкаНомераКоробок.Следующий() цикл                  
				СтруктураВозврата.Вставить("ЛистНабора",ЛН);
				СтруктураВозврата.Вставить("НомерКоробкиЛН",НомерКоробкиЛН);
				СтруктураВозврата.Вставить("НомерКоробки",ВыборкаНомераКоробок.НомерКоробки);
				Возврат СтруктураВозврата
			КонецЦикла;
			
		КонецЕсли;
		// Кухарь А.Ю.  10.04.2026 конец
		
	КонецЦикла;
	//Кухарь 03.10.2023 конец      
	
		
		
	ИначеЕсли СтрДлина(шк) <> 13 тогда
		
		#Если Клиент Тогда
			// Кельманов А.В. - HELP-7944 - 2026.01.20 {
			//Сообщить("ШК должен быть 13 значным. Не корректная  длинна ШК - "+ШК);
			Если СообщатьВМодуле Тогда 
				Сообщить("ШК должен быть 13 значным. Не корректная  длинна ШК - " + ШК);
			Иначе
				ТекстОшибки = "ШК должен быть 13 значным. Не корректная  длинна ШК - " + ШК;
			КонецЕсли;
			// Кельманов А.В. - HELP-7944 - 2026.01.20 }
		#КонецЕсли
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Если ЛН = Документы.ЛистНабора.ПустаяСсылка() Тогда
		
		#Если Клиент Тогда
			// Кельманов А.В. - HELP-7944 - 2026.01.20 {
			//Сообщить("Не найден лист набора по ШК - "+ШК);
			Если СообщатьВМодуле Тогда
				Сообщить("Не найден лист набора по ШК - " + ШК);
			Иначе
				ТекстОшибки = "Не найден лист набора по ШК - " + ШК;
			КонецЕсли;
			// Кельманов А.В. - HELP-7944 - 2026.01.20 }
		#КонецЕсли
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	СтруктураВозврата.Вставить("ЛистНабора",ЛН);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СУММА(ЛистНабора.КоличествоКоробок) КАК КоличествоКоробок
	|ИЗ
	|	Документ.ЛистНабора КАК ЛистНабора
	|ГДЕ
	|	ЛистНабора.Проведен
	|	И ЛистНабора.Дата < &Дата
	|	И ЛистНабора.ДокОснование = &ДокОснование
	//Кухарь 12.04.18 начаор
	|	И ЛистНабора.Дата >= &ДатаНач
	//Кухарь 12.04.18 конец
	|АВТОУПОРЯДОЧИВАНИЕ";
	запрос.УстановитьПараметр("ДокОснование",ЛН.докоснование);
	запрос.УстановитьПараметр("Дата",ЛН.дата);
	//Кухарь 12.04.18 начало	
	запрос.УстановитьПараметр("ДатаНач",ЛН.дата-30*24*3600);
	//Кухарь 12.04.18 конец	
	
	НомерНачКоробки=1;
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	пока РезультатЗапроса.Следующий() цикл
		если результатЗапроса.КоличествоКоробок=Null тогда Продолжить;КонецЕсли; 
		НомерНачКоробки=НомерНачКоробки+РезультатЗапроса.КоличествоКоробок;
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛистНабора.Номер,
	|	ЛистНабора.КоличествоКоробок
	|ИЗ
	|	Документ.ЛистНабора КАК ЛистНабора
	|ГДЕ
	|	ЛистНабора.Проведен
	|	И ЛистНабора.Дата = &Дата
	|	И ЛистНабора.ДокОснование = &ДокОснование
	|	И ЛистНабора.Ссылка <> &Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";
	запрос.УстановитьПараметр("ДокОснование",ЛН.докоснование);
	запрос.УстановитьПараметр("Дата",ЛН.дата);
	запрос.УстановитьПараметр("Ссылка",ЛН.ссылка);
	Рез=запрос.Выполнить().выбрать();
	Пока рез.Следующий() цикл
		Если Число(Прав(Рез.Номер,5))<Число(Прав(ЛН.Номер,5)) тогда
			НомерНачКоробки=НомерНачКоробки+Рез.КоличествоКоробок;
		КонецЕсли;
	КонецЦикла;
	
	
	// Кухарь А.Ю.  08.06.2025 начало
	//НомерКоробкиЛН=Число(Сред(ШК,8,СтрДлина(ШК)-8));
	попытка	
		НомерКоробкиЛН=Число(Сред(ШК,8,СтрДлина(ШК)-8));
	Исключение
		возврат Неопределено;
	КонецПопытки;
	// Кухарь А.Ю.  08.06.2025 конец
	НомерКоробки=НомерНачКоробки+НомерКоробкиЛН-1;
	
	
	
	
	
	
	СтруктураВозврата.Вставить("НомерКоробкиЛН",НомерКоробкиЛН);
	СтруктураВозврата.Вставить("НомерКоробки",НомерКоробки);
	
	
	
	
	
	
	возврат СтруктураВозврата;	
КонецФункции


Функция ПолучитьВсеШкПоНакладной(Накладная, ЕстьЛП = Ложь, ПечатьПоНовому = Ложь) Экспорт
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("НомерКоробки");	
	ТЗ.Колонки.Добавить("ШК");		
	ТЗ.Колонки.Добавить("Номенклатура");
	ТЗ.Колонки.Добавить("ЛистНабора");
	ТЗ.Колонки.Добавить("Сканировщик");
	ТЗ.Колонки.Добавить("КоличествоДокумента");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Лист.Ссылка КАК ЛН,
	|	Лист.Сканировщик КАК Сканировщик,
	|	Лист.КоличествоДокумента КАК КоличествоДокумента,
	|	Лист.ШКЛистаНабора КАК ШКЛистаНабора
	|ИЗ
	|	Документ.ЛистНабора КАК Лист
	|ГДЕ
	|	Лист.ДокОснование = &Накладная
	|	И Лист.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Лист.Дата";
	
	Запрос.УстановитьПараметр("Накладная", Накладная);   
	
	// Кухарь А.Ю. 01.05.2025 начало
	Если ЕстьЛП Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ЛистНабора КАК Лист", "Документ.ЛистПереукладки КАК Лист");   
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Лист.ШКЛистаНабора", "123456789012");
	КонецЕсли;
	// Кухарь А.Ю. 01.05.2025 конец
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Сч = 0;
	
	Пока Результат.Следующий() Цикл	
		
		ЛН = Результат.ЛН;
		
		// Кухарь А.Ю.  04.04.2025 начало
		Если Результат.ШКЛистаНабора = "" И Не ПечатьПоНовому Тогда
			
			ЛНОбъект = ЛН.ПолучитьОбъект();
			ЛНОбъект.СформироватьШКЛистаНабора();
			ЛНОбъект.Записать();
			ЛН = ЛНОбъект.Ссылка;
			
		КонецЕсли;
		// Кухарь А.Ю.  04.04.2025 конец
		
		Сканировщик = Результат.Сканировщик;
		КоличествоДокумента = Результат.КоличествоДокумента; 
		
		// Кухарь А.Ю. 01.05.2025 начало
		Если Не ПечатьПоНовому Тогда 
			// Кухарь А.Ю. 01.05.2025 конец
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ЛистНабора.ШКЛистаНабора
			|ИЗ
			|	Документ.ЛистНабора КАК ЛистНабора
			|ГДЕ
			|	ЛистНабора.Дата >= &Дата
			|	И ЛистНабора.ШКЛистаНабора = &ШКЛистаНабора
			|
			|СГРУППИРОВАТЬ ПО
			|	ЛистНабора.ШКЛистаНабора";
			
			Запрос.УстановитьПараметр("Дата", НачалоДня(ЛН.Дата));
			Запрос.УстановитьПараметр("ШКЛистаНабора", ЛН.ШКЛистаНабора); 
			
			// Кухарь А.Ю. 01.05.2025 начало
			Если ЕстьЛП Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ЛистНабора КАК ЛистНабора", "Документ.ЛистПереукладки КАК ЛистНабора");
			КонецЕсли;
			// Кухарь А.Ю. 01.05.2025 конец
			
			РезультатТЗ = Запрос.Выполнить().Выгрузить();
			
			Если РезультатТЗ.Количество() > 1 Тогда
				
				ШКЛистаНабора = "";
				
				лнОб = ЛН.получитьобъект();
				лнОб.Записать(РежимЗаписиДокумента.Проведение);
				
				#Если Клиент Тогда
					Предупреждение("Неудачная попытка распечатать этикетку, попробуйте ещё раз.");
				#КонецЕсли
				
				Прервать;
				
			КонецЕсли;
			//Кухарь 15.06.16 конец
			
		КонецЕсли;
		
		Если ЛН.ТипШК = Перечисления.ТипыШтрихКодов.Коробка Тогда
			
			ТабНоменклатурыПоКоробам = Новый ТаблицаЗначений;
			ТабНоменклатурыПоКоробам.Колонки.Добавить("Номенклатура");
			
			Для Каждого СтрокаТЧ Из ЛН.Товары Цикл
				
				//крохин начало 25.05.2017
				//при СтрокаТЧ.ШтВКоробе=0 считаем, что СтрокаТЧ.ШтВКоробе=1
				//КоличествоКоробов=?(СтрокаТЧ.ШтВКоробе=0,КоличествоКоробов,СтрокаТЧ.количество/СтрокаТЧ.ШтВКоробе);
				КоличествоКоробов = ?(СтрокаТЧ.ШтВКоробе = 0, СтрокаТЧ.Количество, СтрокаТЧ.Количество / СтрокаТЧ.ШтВКоробе);
				//крохин конец 25.05.2017
				
				Для СчКоробов=1 По КоличествоКоробов Цикл
					
					СтрТабНом = ТабНоменклатурыПоКоробам.Добавить();
					СтрТабНом.Номенклатура = СтрокаТЧ.Номенклатура;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Для СчЛн = 1 По Результат.ЛН.КоличествоКоробок Цикл
			
			Если ЛН.ТипШК = Перечисления.ТипыШтрихКодов.Коробка И ТабНоменклатурыПоКоробам.Количество() > 0 Тогда
				
				ТекНоменклатура = ТабНоменклатурыПоКоробам.Получить(СчЛн - 1).Номенклатура;
				КоличествоДокумента = ТекНоменклатура.Родитель.ШтукВКоробке;
				
			Иначе
				
				Если ЛН.Товары.Количество() > 1 Тогда
					
					ТекНоменклатура = ЛН.ГруппыТоваров + " mix";
					
				ИначеЕсли ЛН.Товары.Количество() = 0 Тогда
					
					// Кельманов А.В. - HELP-6996 - 2025.11.13 {
					//ТекНоменклатура = "Номенклатура: Сборная ("+ ЛН.ГруппыТоваров+")";
					ТекНоменклатура = "Номенклатура: " + ЛН.ГруппыТоваров;
					// Кельманов А.В. - HELP-6996 - 2025.11.13 }
					
				Иначе
					
					ТекНоменклатура = "АРТ: " + ЛН.Товары.получить(0).Номенклатура;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Сч = Сч + 1;
			
			СтрТЗ = ТЗ.Добавить();
			СтрТЗ.НомерКоробки = Сч;
			СтрТЗ.Номенклатура = ТекНоменклатура; 
			
			Если Не ПечатьПоНовому Тогда
				ТекШК = Результат.ЛН.ШКЛистаНабора + Формат(СчЛн, "ЧЦ=5; ЧВН="); 
			Иначе
				ТекШК = "123456789012";
			КонецЕсли;
			
			ТекШК = ТекШК + КонтрольныйСимволEAN(ТекШК, 13);
			
			СтрТЗ.ШК = ТекШК;
			СтрТЗ.ЛистНабора = ЛН;
			СтрТЗ.Сканировщик = Сканировщик;
			СтрТЗ.КоличествоДокумента = КоличествоДокумента;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТЗ;	
	
КонецФункции
//Кухарь 26.09.16 начало
//Кухарь 24.01.18 начало
//Иногда нужна только 1 позиция
//Функция ПолучитьСтрокиМатрицы (Документ)  экспорт
//	СписокНоменлатуры=Документ.товары.выгрузитьКолонку("Номенклатура");
Функция ПолучитьСтрокиМатрицы (Документ,СписокНоменлатуры=Неопределено)  экспорт
	если СписокНоменлатуры=Неопределено тогда	
		СписокНоменлатуры=Документ.товары.выгрузитьКолонку("Номенклатура");
	КонецЕсли;
	//Кухарь 24.01.18 конец
	//Кухарь 06.02.18 начало
	//опечатка
	//СписокНоменлатуры=Документ.товары.выгрузитьКолонку("Номенклатура");
	//Кухарь 06.02.18 конец	
	если Документ.метаданные().имя="ЛистНабора" тогда
		Документ=Документ.докоснование;
	иначе
		Документ=Документ.ссылка;
	КонецЕсли;
	запрос=новый запрос;	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	МатрицаТовары.Ссылка,
	|	МатрицаТовары.НомерСтроки,
	|	МатрицаТовары.Номенклатура,
	|	МатрицаТовары.ШККонтрагента,
	// Кухарь А.Ю. 19.02.2020 начало
	//
	|	МатрицаТовары.ШККонтрагентаДополнительный, 
	// Кухарь А.Ю. 19.02.2020 конец
	
	|	МатрицаТовары.АртикулКонтрагента,
	|	МатрицаТовары.Цена,
	|	МатрицаТовары.Кратность,
	|	МатрицаТовары.МинимальноеКоличество,
	|	МатрицаТовары.ЦенаПосредника,
	|	МатрицаТовары.Этикетка1,
	|	МатрицаТовары.Этикетка2,
	|	МатрицаТовары.Этикетка3,
	|	МатрицаТовары.Этикетка4,
	|	МатрицаТовары.Этикетка5,
	|	МатрицаТовары.ШККонтрагентаБлочок,
	|	МатрицаТовары.ШККонтрагентаКоробка,
	|	МатрицаТовары.КратностьКоробки,
	|	МатрицаТовары.НаименованиеКонтрагента,
	|	МатрицаТовары.КодПроизводителяКонтрагента,
	|	МатрицаТовары.ЦенаБезНДС,
	// Кухарь А.Ю.  11.11.2022 начало
	//
	|	МатрицаТовары.НаименованиеБрендаДляКонтрагента,
	// Кухарь А.Ю.  11.11.2022 конец	
	|	МатрицаТовары.ШКСпайки,
	//Кухарь 16.10.18 начало
	//Новые поля
	|	МатрицаТовары.ТипУпаковки,
	|	МатрицаТовары.КолКоробовВСлое,
	|	МатрицаТовары.ВысотаПаллета
	//Кухарь 16.10.18 конец
	
	|ИЗ
	|	Документ.Матрица.Товары КАК МатрицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
	|ГДЕ
	|	МатрицаТовары.Номенклатура в (&Номенклатура)
	|	И МатрицаТовары.Ссылка.Проведен
	|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
	|	И МатрицаТовары.Ссылка.Договор.Организация = &Организация
	|	И МатрицаТовары.Ссылка.Дата <= &Дата
	|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ДатаОкончания
	|	И МатрицаПунктыДоставки.ПунктДоставки = &ПунктДоставки";
	//нечаева 18,07,17+++
	Попытка
		Если Документ.ПостояннаяАкция Тогда
			Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
			
			//крохин начало 28.07.2017
			//постоянные акции только под галку
		Иначе
			Запрос.Текст = Запрос.Текст +" И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция";
			//крохин конец 28.07.2017
			
		КонецЕсли;
	Исключение
		
	КонецПопытки;
	
	Запрос.Текст = Запрос.Текст +"
	|УПОРЯДОЧИТЬ ПО
	|	МатрицаТовары.Ссылка.Дата УБЫВ";
	//нечаева 18,07,17---
	
	Запрос.УстановитьПараметр("ПунктДоставки",Документ.ПунктДоставки);
	Запрос.УстановитьПараметр("Номенклатура",СписокНоменлатуры);
	Запрос.УстановитьПараметр("Контрагент",Документ.Контрагент);
	Запрос.УстановитьПараметр("Организация",Документ.Договор.Организация);
	запрос.УстановитьПараметр("Дата",КонецДня(Документ.Дата));
	Запрос.УстановитьПараметр("ДатаОкончания",НачалоДня(Документ.Дата));
	результат=запрос.Выполнить().Выгрузить();
	возврат результат;
	//Кухарь 26.09.16 конец	
	
КонецФункции

//Кухарь 19.05.16 конец


Функция ПолучитьДанныеКоробкиПоКодуАгрегации (КодАгрегацииСтрокой) экспорт                 
	СтруктураВозврата	=	Новый Структура("Успех,Ошибки,НомерКоробки,Лист",ложь,новый Массив,0,Неопределено);
	КА					=	Справочники.ШтрихкодыУпаковокТоваров.НайтиПоНаименованию(Прав(КодАгрегацииСтрокой,18),Истина);
	если КА=Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка() тогда  
		СтруктураВозврата.Ошибки.Добавить("Не найден код агрегации");
		возврат СтруктураВозврата;
	КонецЕсли;
	
	запрос=новый запрос;  
	запрос.Текст= "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Лист.Ссылка КАК Лист,
	|	Лист.Дата КАК Дата,
	|	Лист.ДокОснование КАК ДокОснование,      
	// Кухарь А.Ю.  11.12.2025 начало
	// OUT-175
	|	выразить(Лист.ДокОснование как документ.расходнаянакладная).ВиртуальнаяНакладная КАК Виртуальная,
	|	выразить(Лист.ДокОснование как документ.расходнаянакладная).Проведен КАК ДокОснованиеПроведено
	
	// Кухарь А.Ю.  11.12.2025 конец			  
	|ИЗ
	|	Документ.ЛистНабора КАК Лист
	|ГДЕ
	|	Лист.ДокОснование ССЫЛКА Документ.РасходнаяНакладная
	|	И Лист.Проведен
	|	И Лист.КодАгрегации = &КодАгрегации
	|	И Лист.Дата >= &Дата1
	| 	
	|ОБЪЕДИНИТЬ ВСЕ     
	// Кухарь А.Ю.  25.02.2026 начало
	// Не находило код агрегации полученный из переклейки импортного кода через ЛН
	|ВЫБРАТЬ первые 1
	|Лист.Ссылка КАК Ссылка,
	|Лист.Ссылка.Дата КАК Дата,
	|Лист.Ссылка.ДокОснование КАК ДокОснование,
	|ВЫРАЗИТЬ(Лист.Ссылка.ДокОснование КАК Документ.РасходнаяНакладная).ВиртуальнаяНакладная КАК Виртуальная,
	|ВЫРАЗИТЬ(Лист.Ссылка.ДокОснование КАК Документ.РасходнаяНакладная).Проведен КАК ДокОснованиеПроведено
	|ИЗ
	|Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК Лист
	|ГДЕ
	|Лист.НовыйКодКоробки = &КодАгрегации
	|И Лист.Ссылка.Проведен       
	|И Лист.ссылка.Дата >= &Дата1
	|ОБЪЕДИНИТЬ ВСЕ  
	// Кухарь А.Ю.  25.02.2026 конец	
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Лист.Ссылка,
	|	Лист.Дата,
	|	Лист.ДокОснование,
	|	выразить(Лист.ДокОснование как документ.расходнаянакладная).ВиртуальнаяНакладная,
	|	выразить(Лист.ДокОснование как документ.расходнаянакладная).Проведен
	|ИЗ
	|	Документ.ЛистПереукладки КАК Лист
	|ГДЕ
	|	Лист.ДокОснование ССЫЛКА Документ.РасходнаяНакладная
	|	И Лист.Проведен
	|	И Лист.КодАгрегации = &КодАгрегации
	|	И Лист.Дата >= &Дата1";
	запрос.УстановитьПараметр("КодАгрегации",КА);  
	запрос.УстановитьПараметр("Дата1",ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования()-6*30*86400);
	Выборка=запрос.Выполнить().Выбрать();   
	
	
	если Выборка.Количество() = 0 тогда
		СтруктураВозврата.Ошибки.Добавить("Не найден лист с отсканированным кодом агрегации");
		возврат СтруктураВозврата;		
	КонецЕсли;   
	
	
	пока Выборка.Следующий() цикл 
		// Кухарь А.Ю.  11.12.2025 начало
		// OUT-175
		// Если это код виртуальной РНК, то наверное его куда-то сканировали.     
		//		Лист=Выборка.Лист;  
		//ДатаЛиста=Выборка.Дата;
		//ДокОснование=выборка.ДокОснование;
		
		ПереопределяемДанныеЛиста = ложь;
		если выборка.Виртуальная и не выборка.ДокОснованиеПроведено тогда
			запрос.Текст= "ВЫБРАТЬ
			              |	т1.Лист КАК Лист,
			              |	т1.Дата КАК Дата,
			              |	т1.ДокОснование КАК ДокОснование
			              |ИЗ
			              |	(ВЫБРАТЬ ПЕРВЫЕ 1
			              |		Лист.Ссылка КАК Лист,
			              |		Лист.Ссылка.Дата КАК Дата,
			              |		Лист.Ссылка.ДокОснование КАК ДокОснование
			              |	ИЗ
			              |		Документ.ЛистНабора.ШтрихкодыУпаковок КАК Лист
			              |	ГДЕ
			              |		Лист.ШтрихкодУпаковки = &КодАгрегации
			              |		И Лист.Ссылка.Проведен
			              |		И Лист.Ссылка.Дата >= &Дата1
			              |		И ВЫРАЗИТЬ(Лист.Ссылка.ДокОснование КАК Документ.РасходнаяНакладная).Проведен
			              |		И Лист.Ссылка.ДокОснование ССЫЛКА Документ.РасходнаяНакладная           
						  // Кухарь А.Ю.  11.04.2026 начало
						  // HELP-9421
			              |	ОБЪЕДИНИТЬ ВСЕ
			              |	
			              |	ВЫБРАТЬ ПЕРВЫЕ 1
			              |		Лист.Ссылка,
			              |		Лист.Ссылка.Дата,
			              |		Лист.Ссылка.ДокОснование
			              |	ИЗ
			              |		Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК Лист
			              |	ГДЕ
			              |		Лист.ШтрихкодУпаковки = &КодАгрегации
			              |		И Лист.Ссылка.Проведен
			              |		И Лист.Ссылка.Дата >= &Дата1
			              |		И ВЫРАЗИТЬ(Лист.Ссылка.ДокОснование КАК Документ.РасходнаяНакладная).Проведен
			              |		И Лист.Ссылка.ДокОснование ССЫЛКА Документ.РасходнаяНакладная) КАК т1   
						  // Кухарь А.Ю.  11.04.2026 конец
						  
			              |УПОРЯДОЧИТЬ ПО
			              |	Дата УБЫВ";
			ВыборкаДополнительная = запрос.Выполнить().Выбрать();
			пока ВыборкаДополнительная.Следующий() цикл  
				Лист=ВыборкаДополнительная.Лист;  
				ДатаЛиста=ВыборкаДополнительная.Дата;
				ДокОснование=ВыборкаДополнительная.ДокОснование;
				ПереопределяемДанныеЛиста = Истина;
			КонецЦикла;
		КонецЕсли;            
		
		если не ПереопределяемДанныеЛиста тогда   
			Лист=Выборка.Лист;  
			ДатаЛиста=Выборка.Дата;
			ДокОснование=выборка.ДокОснование;		
		КонецЕсли;
		// Кухарь А.Ю.  11.12.2025 конец
		
		
	КонецЦикла;   

	//++Данилова Е.В. 20.04.2026 SNL-205 по листам переукладки тоже самое
	// Кухарь А.Ю.  10.04.2026 начало
	// Добавили новую ТЧ с коробами в ЛН 	 
	//если ТипЗнч(лист) = Тип("ДокументСсылка.ЛистНабора") тогда 
	ДанныеДляПерезаполнения = Неопределено;	
	//++Данилова Е.В. 13.05.2026 HELP-9756 
	//СтруктураКоробок=ПолучитьСписокШКкоробокЛистаНабора(Лист,Истина,ДанныеДляПерезаполнения);
	СтруктураКоробок=ПолучитьСписокШКкоробокЛистаНабора(Лист,Истина,ДанныеДляПерезаполнения,Ложь);
	//--Данилова Е.В. 13.05.2026 
	если СтруктураКоробок.количество() = 1 тогда     
		СтруктураВозврата.Успех				= Истина;
		СтруктураВозврата.НомерКоробки 		= СтруктураКоробок[0].НомерКоробки;
		СтруктураВозврата.Лист 				= Лист;		
		возврат СтруктураВозврата;
	КонецЕсли;		                                  
	//КонецЕсли;	
	// Кухарь А.Ю.  10.04.2026 конец 
	//--Данилова Е.В. 20.04.2026 
	
	
	запрос.Текст="ВЫБРАТЬ
	|	Лист.Ссылка КАК Ссылка,
	|	Лист.Номер КАК Номер,
	|	Лист.Дата КАК Дата
	|ИЗ
	|	Документ.ЛистНабора КАК Лист
	|ГДЕ
	|	Лист.Проведен
	|	И Лист.ДокОснование = &ДокОснование
	|	И Лист.Дата <= &Дата2
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер";  
	запрос.УстановитьПараметр("Дата2",ДатаЛиста);
	запрос.УстановитьПараметр("ДокОснование",ДокОснование);	
	если ТипЗнч(лист) = Тип("ДокументСсылка.ЛистПереукладки") тогда 
		запрос.Текст=СтрЗаменить(запрос.Текст,"Документ.ЛистНабора КАК Лист","Документ.ЛистПереукладки КАК Лист");
	КонецЕсли;
	ТЗ=запрос.Выполнить().Выгрузить();
	НомерКоробки=тз.Индекс(тз.Найти(Лист,"Ссылка"))+1;
	
	СтруктураВозврата.Успех				= Истина;
	СтруктураВозврата.НомерКоробки 		= НомерКоробки;
	СтруктураВозврата.Лист 				= Лист;
	
	возврат СтруктураВозврата;
	
КонецФункции

////кухарь 07.10.14 начало
////новая константа в регистре для работы с информацией ШК ЛН
//Функция ПолучитьКонстантуБлокировкиИнформацииШКЛН() экспорт
//	запрос=новый запрос;
//	запрос.Текст= "ВЫБРАТЬ
//				  |	Константы.ЗначениеРеквизита как знач
//				  |ИЗ
//				  |	РегистрСведений.Константы КАК Константы
//				  |ГДЕ
//				  |	Константы.ИмяКонстанты = &ИмяКонстанты";
//	запрос.УстановитьПараметр("ИмяКонстанты","БлокироватьРегистрШКЛН");
//	результат=запрос.Выполнить().Выгрузить();
//	если результат.количество()=0 Тогда 
//		возврат Неопределено;
//	иначе
//		Возврат результат.Получить(0).знач;
//	КонецЕсли;	
//КонецФункции

//Процедура УстановитьКонстантуБлокировкиИнформацииШКЛН(значение) экспорт
//	если значение=Истина или значение=ложь тогда
//		ЗаписьВРег=РегистрыСведений.Константы.СоздатьМенеджерЗаписи();
//		ЗаписьВРег.ИмяКонстанты="БлокироватьРегистрШКЛН";
//		ЗаписьВРег.Период=ТекущаяДата();
//		ЗаписьВРег.ЗначениеРеквизита=значение;
//		ЗаписьВРег.Записать();
//	КонецЕсли;
//КонецПроцедуры
////кухарь 07.10.14  конец

//крохин начало 24.03.2017
//в ЦО проверяем отсутствие проводок и перепроводим
Процедура ПроверитьДокументы()   Экспорт
	
	
	СЗ = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПриходнаяНакладная.Ссылка,
	|	КоличествоЗаписей.Колво,
	|	ЕСТЬNULL(КоличествоЗаписей.Колво, 0) КАК Колво1
	|ИЗ
	|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОстаткиТМЦ.Регистратор КАК Регистратор,
	|			СУММА(1) КАК Колво
	|		ИЗ
	|			РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ
	|		ГДЕ
	|			ОстаткиТМЦ.Период МЕЖДУ &Дата1 И &Дата2
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОстаткиТМЦ.Регистратор
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			РезервыТМЦ.Регистратор,
	|			СУММА(1)
	|		ИЗ
	|			РегистрНакопления.РезервыТМЦ КАК РезервыТМЦ
	|		ГДЕ
	|			РезервыТМЦ.Период МЕЖДУ &Дата1 И &Дата2
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РезервыТМЦ.Регистратор) КАК КоличествоЗаписей
	|		ПО ПриходнаяНакладная.Ссылка = КоличествоЗаписей.Регистратор
	|ГДЕ
	|	ЕСТЬNULL(КоличествоЗаписей.Колво, 0) = 0
	|	И ПриходнаяНакладная.Дата МЕЖДУ &Дата1 И &Дата2
	|	И ПриходнаяНакладная.Проведен
	|	И ПриходнаяНакладная.КоличествоДокумента > 0 
	//крохин начало 07.04.2026                                        
	//https://yougile.collant.ru/team/ab6bad3a05c0/#SNL-193
	//|	И ПриходнаяНакладная.СостояниеНакладной <> &СостояниеНакладной 
	|	И ПриходнаяНакладная.СостояниеНакладной В(&СписокСостоянийНакладной)
	//крохин конец 07.04.2026
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПриходнаяНакладная.Ссылка.Дата";
	
	Запрос.УстановитьПараметр("Дата1",КонецДня(Константы.ДатаЗапретаРедактирования.Получить())+1);
	Запрос.УстановитьПараметр("Дата2",КонецМесяца(ТекущаяДата()));
	//крохин начало 07.04.2026                                        
	//https://yougile.collant.ru/team/ab6bad3a05c0/#SNL-193
	//Запрос.УстановитьПараметр("СостояниеНакладной",Перечисления.СостоянияНакладной.ВРаботе);
	СписокСостоянийНакладной = Новый СписокЗначений;
	СписокСостоянийНакладной.Добавить(Перечисления.СостоянияНакладной.ГотоваКПриемке);
	СписокСостоянийНакладной.Добавить(Перечисления.СостоянияНакладной.Принята);
Запрос.УстановитьПараметр("СписокСостоянийНакладной",СписокСостоянийНакладной);	
	//крохин конец 07.04.2026
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписатьВЛог("Исправление ошибки записи при обмене","Перепроведение "+Выборка.Ссылка,"Информация");
		СЗ.Добавить(Выборка.Ссылка);
	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Перемещение.Ссылка,
	|	КоличествоЗаписей.Колво,
	|	ЕСТЬNULL(КоличествоЗаписей.Колво, 0) КАК Колво1
	|ИЗ
	|	Документ.Перемещение КАК Перемещение
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОстаткиТМЦ.Регистратор КАК Регистратор,
	|			СУММА(1) КАК Колво
	|		ИЗ
	|			РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ
	|		ГДЕ
	|			ОстаткиТМЦ.Период МЕЖДУ &Дата1 И &Дата2
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОстаткиТМЦ.Регистратор
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			РезервыТМЦ.Регистратор,
	|			СУММА(1)
	|		ИЗ
	|			РегистрНакопления.РезервыТМЦ КАК РезервыТМЦ
	|		ГДЕ
	|			РезервыТМЦ.Период МЕЖДУ &Дата1 И &Дата2
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РезервыТМЦ.Регистратор) КАК КоличествоЗаписей
	|		ПО Перемещение.Ссылка = КоличествоЗаписей.Регистратор
	|ГДЕ
	|	ЕСТЬNULL(КоличествоЗаписей.Колво, 0) = 0
	|	И Перемещение.Дата МЕЖДУ &Дата1 И &Дата2
	|	И Перемещение.Проведен
	|	И Перемещение.КоличествоДокумента > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Перемещение.Ссылка.Дата";
	
	Запрос.УстановитьПараметр("Дата1",КонецДня(Константы.ДатаЗапретаРедактирования.Получить())+1);
	Запрос.УстановитьПараметр("Дата2",КонецМесяца(ТекущаяДата()));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//крохин начало 16.03.2017
		//не проверяем ПРМ с РС франчайзинг
		Если Выборка.Ссылка.Склад.Код = "SSX-66" Тогда Продолжить; КонецЕсли;
		//крохин конец 16.03.2017
		ЗаписатьВЛог("Исправление ошибки записи при обмене","Перепроведение "+Выборка.Ссылка,"Информация");	
		СЗ.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РасходнаяНакладная.Ссылка,
	|	КоличествоЗаписей.Колво,
	|	ЕСТЬNULL(КоличествоЗаписей.Колво, 0) КАК Колво1
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОстаткиТМЦ.Регистратор КАК Регистратор,
	|			СУММА(1) КАК Колво
	|		ИЗ
	|			РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ
	|		ГДЕ
	|			ОстаткиТМЦ.Период МЕЖДУ &Дата1 И &Дата2
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОстаткиТМЦ.Регистратор
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			РезервыТМЦ.Регистратор,
	|			СУММА(1)
	|		ИЗ
	|			РегистрНакопления.РезервыТМЦ КАК РезервыТМЦ
	|		ГДЕ
	|			РезервыТМЦ.Период МЕЖДУ &Дата1 И &Дата2
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РезервыТМЦ.Регистратор) КАК КоличествоЗаписей
	|		ПО РасходнаяНакладная.Ссылка = КоличествоЗаписей.Регистратор
	|ГДЕ
	|	ЕСТЬNULL(КоличествоЗаписей.Колво, 0) = 0
	|	И РасходнаяНакладная.Дата МЕЖДУ &Дата1 И &Дата2
	|	И РасходнаяНакладная.Проведен
	|	И РасходнаяНакладная.КоличествоДокумента > 0
	//крохин начало 04.10.2022
	|	И РасходнаяНакладная.СостояниеНакладной <> Значение(Перечисление.СостоянияНакладной.Отменена)
	//крохин конец 04.10.2022
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасходнаяНакладная.Ссылка.Дата";
	
	Запрос.УстановитьПараметр("Дата1",КонецДня(Константы.ДатаЗапретаРедактирования.Получить())+1);
	Запрос.УстановитьПараметр("Дата2",КонецМесяца(ТекущаяДата()));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписатьВЛог("Исправление ошибки при обмене","Перепроведение "+Выборка.Ссылка,"Информация");	
		СЗ.Добавить(Выборка.Ссылка);
	КонецЦикла;	
	
	
	Если СЗ.Количество() > 0 Тогда
		Текст = "Список перепроведенных документов: "+ Символы.ВК;
		
		Для Н = 1 По СЗ.Количество() Цикл
			Текст = Текст + СЗ.Получить(Н-1) + Символы.ВК;
			ДокОбъект = СЗ.Получить(Н-1).Значение.ПолучитьОбъект();
			//Кухарь 14.05.20 начало
			//Иногда не удаётся записать. И обмен встаёт.
			//ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			попытка
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ЗаписатьВЛог("Исправление ошибки при обмене","Не удалось перепровести "+ДокОбъект.Ссылка,"Ошибки записи при обмене");
			КонецПопытки;
			//Кухарь 14.05.20 конец
			
		КонецЦикла;
		ПослатьПисьмоОПерепроведении(Текст);
	Иначе
	КонецЕсли;
	
	//крохин начало 24.03.2017
	//ИНВ
	//СПН
	//ОПР
	//крохин конец 24.03.2017
	
	
	
КонецПроцедуры

//Кухарь 14.01.20 начало
//Иногда появляются ЗНБ без движений
Процедура ПроверитьДокументыСклад()   Экспорт
	
	
	СЗ = Новый СписокЗначений;
	
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка,
	|	КоличествоЗаписей.Колво КАК Колво,
	|	ЕСТЬNULL(КоличествоЗаписей.Колво, 0) КАК Колво1
	|ИЗ
	|	Документ.ЗаданиеНабора КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РезервыТМЦ.Регистратор КАК Регистратор,
	|			СУММА(1) КАК Колво
	|		ИЗ
	|			РегистрНакопления.РезервыТМЦ КАК РезервыТМЦ
	|		ГДЕ
	|			РезервыТМЦ.Период МЕЖДУ &Дата1 И &Дата2
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РезервыТМЦ.Регистратор) КАК КоличествоЗаписей
	|		ПО Док.Ссылка = КоличествоЗаписей.Регистратор
	|ГДЕ
	|	ЕСТЬNULL(КоличествоЗаписей.Колво, 0) = 0
	|	И Док.Дата МЕЖДУ &Дата1 И &Дата2
	|	И Док.Проведен
	|	И Док.КоличествоДокумента > 0
	|	И НЕ Док.СостояниеНакладной В (&СписокСостояний)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Док.Ссылка.Дата";
	// Кухарь А.Ю. 01.07.2021 начало
	// 	запрос.УстановитьПараметр("Дата1",НачалоДня(ТекущаяДата()-20*60));
	запрос.УстановитьПараметр("Дата1",НачалоДня(ТекущаяДата()-12*3600));
	// Кухарь А.Ю. 01.07.2021 конец
	
	запрос.УстановитьПараметр("Дата2",КонецДня(ТекущаяДата()));
	
	СписокСостояний=новый СписокЗначений;
	СписокСостояний.Добавить(Перечисления.СостоянияНакладной.СформированыЗаданияНабора);
	СписокСостояний.Добавить(Перечисления.СостоянияНакладной.Отгружена);
	// Кухарь А.Ю. 11.11.2020 начало
	//В этом состоянии проводок тоже нет
	СписокСостояний.Добавить(Перечисления.СостоянияНакладной.ОжиданиеНабора);
	// Кухарь А.Ю. 11.11.2020 конец
	
	//крохин начало 04.10.2022
	СписокСостояний.Добавить(Перечисления.СостоянияНакладной.Отменена);
	///крохин конец 04.10.2022
	
	запрос.УстановитьПараметр("СписокСостояний",СписокСостояний);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписатьВЛог("Исправление ошибки при обмене","Перепроведение "+Выборка.Ссылка,"Информация");	
		СЗ.Добавить(Выборка.Ссылка);
	КонецЦикла;		
	
	
	Если СЗ.Количество() > 0 Тогда
		Текст = "Список перепроведенных документов: "+ Символы.ВК;
		
		Для Н = 1 По СЗ.Количество() Цикл
			Текст = Текст + СЗ.Получить(Н-1) + Символы.ВК;
			ДокОбъект = СЗ.Получить(Н-1).Значение.ПолучитьОбъект();
			попытка
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
			КонецПопытки;
		КонецЦикла;
	Иначе
	КонецЕсли;
	
	
	
КонецПроцедуры
//Кухарь 14.01.20 конец


Процедура ПослатьПисьмоОПерепроведении(Текст)  Экспорт
	
	попытка
		ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
		ЗаписатьВЛог("КонтрольОбъема","Отправление почты """+параметрыСеанса.Пользователь+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
	исключение
	конецпопытки;
	
	ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль; 
	
	// Кухарь А.Ю.  08.09.2022 начало
	//ПочтовыйПрофиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//ПочтовыйПрофиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//ПочтовыйПрофиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(ПочтовыйПрофиль,ПараметрыПочты);	
	// Кухарь А.Ю.  08.09.2022 конец
	
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//ПочтовыйПрофиль.Пользователь="*%*%*%";
	//ПочтовыйПрофиль.Пароль="*$*$*$";
	ПочтовыйПрофиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
	Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Логин;
	ПочтовыйПрофиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
	Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	ПочтовыйПрофиль.ВремяОжидания      = 60; 
	
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	
	
	
	Сообщение.Получатели.Добавить("krohin@collant.ru");
	
	
	Сообщение.Отправитель = "helpdesk@collant.ru";
	Сообщение.Тема = "Контроль обмена данными";
	Сообщение.Тексты.Добавить(Текст);
	
	Почта = Новый ИнтернетПочта(); 
	Попытка 
		Почта.Подключиться(ПочтовыйПрофиль); 
	Исключение 
		//Сообщить(ОписаниеОшибки()); 
		Возврат; 
	КонецПопытки; 
	
	Почта.Подключиться(ПочтовыйПрофиль);
	Почта.Послать(Сообщение);
	Почта.Отключиться();
	
	
КонецПроцедуры	

//Кухарь 01.10.17 начало
//Поиск Номенклатура по ШК, не из справочника ШК, а из номенклатурных матриц
Функция НайтиТоварПоШКИзМатрицы (ШК,Документ,ТипШК=Неопределено) экспорт
	если ТипШК=Неопределено тогда
		ТипШК=Перечисления.ТипыШтрихКодов.Штука;
	КонецЕсли;
	//Кухарь 13.10.17 начало
	//Одинаковые ШК в матрицах на разные позиции
	//Номенклатура=Справочники.Номенклатура.ПустаяСсылка();	
	СписокНоменклатуры=новый СписокЗначений;
	//Кухарь 13.10.17 конец	
	запрос=новый запрос;	
	Запрос.Текст = "ВЫБРАТЬ
	|	МатрицаТовары.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.Матрица.Товары КАК МатрицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
	|ГДЕ
	|	МатрицаТовары.Ссылка.Проведен
	|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
	|	И МатрицаТовары.Ссылка.Договор.Организация = &Организация
	|	И МатрицаТовары.Ссылка.Дата <= &Дата
	|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ДатаОкончания
	|	И МатрицаПунктыДоставки.ПунктДоставки = &ПунктДоставки
	|	И (МатрицаТовары.ШККонтрагента = &ШККонтрагента или МатрицаТовары.ШККонтрагентаДополнительный = &ШККонтрагента) 
	|	И МатрицаТовары.Ссылка.ПостояннаяАкция = &ПостояннаяАкция";
	
	
	если ТипШК=Перечисления.ТипыШтрихКодов.Блочок тогда
		запрос.Текст=СтрЗаменить(запрос.Текст,"И МатрицаТовары.ШККонтрагента = ","И МатрицаТовары.ШККонтрагентаБлочок = ");
	ИначеЕсли ТипШК=Перечисления.ТипыШтрихКодов.Коробка тогда	
		запрос.Текст=СтрЗаменить(запрос.Текст,"И МатрицаТовары.ШККонтрагента = ","И МатрицаТовары.ШККонтрагентаКоробка = ");
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст +"
	|УПОРЯДОЧИТЬ ПО
	|	МатрицаТовары.Ссылка.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ПостояннаяАкция",Документ.ПостояннаяАкция);	
	Запрос.УстановитьПараметр("ПунктДоставки",Документ.ПунктДоставки);
	Запрос.УстановитьПараметр("Контрагент",Документ.Контрагент);
	Запрос.УстановитьПараметр("Организация",Документ.Договор.Организация);
	запрос.УстановитьПараметр("Дата",КонецДня(Документ.Дата));
	Запрос.УстановитьПараметр("ДатаОкончания",НачалоДня(Документ.Дата));
	запрос.УстановитьПараметр("ШККонтрагента",ШК);
	результат=запрос.Выполнить().выбрать();
	
	//Кухарь 13.10.17 начало
	//Одинаковые ШК в матрицах на разные позиции
	//пока результат.Следующий() цикл
	//	возврат результат.номенклатура;
	//КонецЦикла;
	//возврат Номенклатура;
	пока результат.Следующий() цикл
		СписокНоменклатуры.Добавить(результат.номенклатура);
	КонецЦикла;
	возврат СписокНоменклатуры;
	//Кухарь 13.10.17 конец	
	
КонецФункции
//Кухарь 01.10.17 конец

// Кухарь А.Ю. 26.09.17 Начало
//Тут не выводится всяких сообщений
Функция НайтиТоварПоШтрихКодуНаСканере(ШК,ТипШК=Неопределено,КоличествоИзШК=0) Экспорт
	Номенклатура=Справочники.Номенклатура.ПустаяСсылка();
	ТШК=ПолучитьМассивСсылокНаШК(ШК,ТипШК);
	ТШК.Свернуть("Номенклатура,ШтВКоробе");
	
	Если ТШК.Количество()=0 Тогда
	ИначеЕсли ТШК.Количество()=1 Тогда
		Номенклатура=ТШК[0].Номенклатура;
		КоличествоИзШК=ТШК[0].ШтВКоробе;
	КонецЕсли; 
	
	Возврат Номенклатура;	
КонецФункции

// 
//крохин конец 24.03.2017


//Кухарь 08.11.17 начало
//Зафиксируем что сотрудник начал или окончил набор
Функция УстановитьТекущиеЗаданияСотрудников (Сотрудник,Текст="") Экспорт 
	СотрудникНаименование=Сотрудник.Наименование;	
	
	если Текст="" тогда
		//ЗаписьВРег=РегистрыСведений.ТекущиеЗаданияСотрудников.СоздатьНаборЗаписей();
		//ЗаписьВРег.Отбор.Сотрудник.Установить(Сотрудник);
		//попытка
		//	ЗаписьВРег.Записать();
		//Исключение
		//	Возврат ложь;
		//КонецПопытки;
		ВремТекст=ПараметрыСеанса.АктивныеНаборщики;		
		НачСимвол=Найти(ВремТекст,СотрудникНаименование);
		Кусок=Прав(ВремТекст,СтрДлина(ВремТекст)-НачСимвол+1);
		КонСимвол=найти(Кусок,";");
		Кусок=Лев(Кусок,КонСимвол);
		
		ПараметрыСеанса.АктивныеНаборщики=СтрЗаменить(ПараметрыСеанса.АктивныеНаборщики,Кусок,"");
		
	иначе
		
		//ЗаписьВРег=РегистрыСведений.ТекущиеЗаданияСотрудников.СоздатьМенеджерЗаписи();
		//ЗаписьВРег.Сотрудник=Сотрудник;
		//ЗаписьВРег.Комментарий=Текст;
		//ЗаписьВРег.Период=ТекущаяДата();
		//попытка
		//	ЗаписьВРег.Записать();
		//Исключение
		//	возврат Ложь;
		//КонецПопытки;
		
		ПараметрыСеанса.АктивныеНаборщики=ПараметрыСеанса.АктивныеНаборщики+СотрудникНаименование+" "+Текст+";";
		
	КонецЕсли;
	Возврат Истина;
КонецФункции
//Кухарь 08.11.17 конец

//Кухарь 29.01.18 начало
//Дополнительный РС для периодических реквизитов
Функция ПолучитьПоследнееЗначениеИзПериодическиеРеквизитыДокументовИСправочников(ИмяРевизита,ВладелецРеквизита,ДатаЗначения)  экспорт
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПериодическиеРеквизитыДокументовИСправочниковСрезПоследних.ЗначениеРеквизита  как ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.ПериодическиеРеквизитыДокументовИСправочников.СрезПоследних(
	|			&Дата2,
	|			ИмяРеквизита = &ИмяРевизита
	|				И ВладелецРеквизита = &ВладелецРеквизита) КАК ПериодическиеРеквизитыДокументовИСправочниковСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодическиеРеквизитыДокументовИСправочниковСрезПоследних.Период УБЫВ";
	запрос.УстановитьПараметр("Дата2",ДатаЗначения);	
	запрос.УстановитьПараметр("ВладелецРеквизита",ВладелецРеквизита);	
	запрос.УстановитьПараметр("ИмяРевизита",ИмяРевизита);	
	Результат=запрос.Выполнить().Выбрать();
	пока Результат.Следующий() цикл
		Возврат Результат.ЗначениеРеквизита;
	КонецЦикла;	
	Возврат Неопределено
КонецФункции
//Кухарь 29.01.18 конец


//Кухарь 22.01.19 начало
//Перенос ДО в коллективные работы
// Шворобей ВЮ 28.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5976

// Кельманов А.В. - SNL-189 - 2026.04.24 {
//Функция ПолучитьКоллективныеРаботы (Накладная, ВидРаботы = Неопределено) экспорт
Функция ПолучитьКоллективныеРаботы (Накладная, ВидРаботы = Неопределено, Состояние = Неопределено, ВернутьМассив = Ложь) Экспорт
// Кельманов А.В. - SNL-189 - 2026.04.24 }
	
	КоллективнаяРабота = Документы.КоллективныеРаботы.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	КоллективныеРаботыНакладные.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КоллективныеРаботы.Накладные КАК КоллективныеРаботыНакладные
	|ГДЕ
	// Кельманов А.В. - HELP-9611 - 2026.04.29 {
	//|	" + ?(ВидРаботы = Неопределено, """", "КоллективныеРаботыНакладные.Ссылка.ВидРаботы = &ВидРаботы") + "
	|	" + ?(ВидРаботы = Неопределено, "", "КоллективныеРаботыНакладные.Ссылка.ВидРаботы = &ВидРаботы") + "
	// Кельманов А.В. - HELP-9611 - 2026.04.29 }
	|	И КоллективныеРаботыНакладные.Накладная = &Накладная
	|	И КоллективныеРаботыНакладные.Ссылка.Проведен
	|	И КоллективныеРаботыНакладные.Ссылка.Дата >= &Константа
	// Кельманов А.В. - SNL-189 - 2026.04.24 {
	// Кельманов А.В. - HELP-9611 - 2026.04.29 {
	//|	" + ?(Состояние = Неопределено, """", "И КоллективныеРаботыНакладные.Ссылка.Состояние = &Состояние") + "
	|	" + ?(Состояние = Неопределено, "", "И КоллективныеРаботыНакладные.Ссылка.Состояние = &Состояние") + "
	// Кельманов А.В. - HELP-9611 - 2026.04.29 }
	// Кельманов А.В. - SNL-189 - 2026.04.24 }
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоллективныеРаботыНакладные.Ссылка.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Накладная", Накладная);
	Запрос.УстановитьПараметр("Константа", Константы.ДатаЗапретаРедактирования.Получить());
	Запрос.УстановитьПараметр("ВидРаботы", ВидРаботы);
	
	// Кельманов А.В. - SNL-189 - 2026.04.24 {
	//Результат = Запрос.Выполнить().Выбрать();
	//
	//Пока Результат.Следующий() Цикл
	//	КоллективнаяРабота = Результат.Ссылка;
	//КонецЦикла;
	//
	//Возврат КоллективнаяРабота;
	Запрос.УстановитьПараметр("Состояние", Состояние);
	
	Если ВернутьМассив Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1", "");
		
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	Иначе
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Пока Результат.Следующий() Цикл
			КоллективнаяРабота = Результат.Ссылка;
		КонецЦикла;
		
		Возврат КоллективнаяРабота;
		
	КонецЕсли;
	// Кельманов А.В. - SNL-189 - 2026.04.24 }	
	
КонецФункции
// Шворобей ВЮ 28.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5976

//Кухарь 12.02.19 начало
//Общая функция для чтения и записи этого рС
Функция ЗаписатьЗначениеВРеквизитыДокументов(ЗначениеРеквизита,ДокОбъектСсылка,ИмяРеквизита) экспорт
	ЗаписьВРег=РегистрыСведений.РеквизитыДокументов.СоздатьМенеджерЗаписи();
	ЗаписьВРег.Документ=ДокОбъектСсылка;
	ЗаписьВРег.ИмяРеквизита=ИмяРеквизита;
	ЗаписьВРег.Период=ДокОбъектСсылка.Дата;
	ЗаписьВРег.ЗначениеРеквизита=ЗначениеРеквизита;
	ЗаписьВРег.Записать();
КонецФункции

Функция ПолучитьЗначениеРеквизитовДокументов (ДокОбъектСсылка,ИмяРеквизита=Неопределено) Экспорт
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	РеквизитыДокументов.ЗначениеРеквизита КАК ЗначениеРеквизита,
	|	РеквизитыДокументов.ИмяРеквизита КАК ИмяРевизита
	|ИЗ
	|	РегистрСведений.РеквизитыДокументов КАК РеквизитыДокументов
	|ГДЕ
	|	РеквизитыДокументов.Документ = &Документ
	|	И РеквизитыДокументов.ИмяРеквизита = &ИмяРеквизита";
	
	запрос.УстановитьПараметр("Документ",ДокОбъектСсылка.Ссылка);
	если ИмяРеквизита=Неопределено тогда
		запрос.Текст=СтрЗаменить(запрос.Текст,"И РеквизитыДокументов.ИмяРеквизита = &ИмяРеквизита","");
	иначе
		Запрос.УстановитьПараметр("ИмяРеквизита",ИмяРеквизита);
	КонецЕсли;	
	возврат запрос.Выполнить().Выгрузить();
КонецФункции
//Кухарь 12.02.19 конец

Функция ПолучитьРеквизитШапки(Ссылка,ИмяРеквизита,ТипОбъекта=Неопределено) Экспорт
	ПредставлениеРеквизита=СтрЗаменить(ИмяРеквизита,".","_");	
	
	СписокРеквизитов=Новый Соответствие;
	СписокРеквизитов.Вставить(ИмяРеквизита,ПредставлениеРеквизита);
	
	Реквизиты=ПолучитьРеквизитыШапки(Ссылка,СписокРеквизитов,ТипОбъекта);
	Возврат Реквизиты[ПредставлениеРеквизита];
КонецФункции //ПолучитьРеквизитШапки(Ссылка,ИмяРеквизита,ТипОбъекта=Неопределено) Экспорт

Функция ПолучитьРеквизитыШапки(ОбъектСсылка,Знач СписокРеквизитов,ТипОбъекта=Неопределено) Экспорт
	Если ТипЗнч(СписокРеквизитов)=Тип("Строка") Тогда
		СписокЭлементов	=СтрРазделить(СписокРеквизитов,",");
		СписокРеквизитов=Новый Соответствие;
		Для Каждого Элемент Из СписокЭлементов Цикл
			СписокРеквизитов.Вставить(Элемент,СтрЗаменить(Элемент,".","_"));		
		КонецЦикла;
	КонецЕсли;
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка";
	Для Каждого Элемент Из СписокРеквизитов Цикл
		Запрос.Текст=Запрос.Текст+",
		|	"+Элемент.Ключ+" "+?(ПустаяСтрока(Элемент.Значение),"","КАК "+Элемент.Значение);
	КонецЦикла;
	
	Если ТипОбъекта=Неопределено Тогда
		ТипОбъекта=ТипОбъекта(ОбъектСсылка);	
	КонецЕсли;
	
	Результат=Новый Структура;
	Для Каждого Элемент Из СписокРеквизитов Цикл
		Результат.Вставить(?(ПустаяСтрока(Элемент.Значение),Элемент.Ключ,Элемент.Значение),Неопределено);	
	КонецЦикла; 
	Если ПустаяСтрока(ТипОбъекта) Тогда
		Возврат Результат;	
	КонецЕсли; 
	Запрос.Текст=Запрос.Текст+"
	|ИЗ
	|	"+ТипОбъекта+"."+ОбъектСсылка.Метаданные().Имя+"
	|ГДЕ
	|	Ссылка=&ОбъектСсылка";
	Запрос.УстановитьПараметр("ОбъектСсылка",ОбъектСсылка);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат,Выборка);
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции //ПолучитьРеквизитыШапки(ОбъектСсылка,СписокРеквизитов) Экспорт

Функция ЭтоСобытиеСканера(Событие) Экспорт
	Возврат Найти(ВРег("ПолученШтрихКод,BarCodeValue,MagneticStripeCardValue"),ВРег(Событие))<>0 ;
КонецФункции // ()

Функция НайтиДокумент(Вид,СтруктураПоиска) Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Документ."+Вид+"
	|ГДЕ
	|	Истина ";
	
	Для Каждого Элемент Из СтруктураПоиска Цикл
		Если Элемент.Ключ="Дата" Тогда
			Запрос.Текст=Запрос.Текст+"
			|	И НАЧАЛОПЕРИОДА("+Элемент.Ключ+",ГОД)=НАЧАЛОПЕРИОДА(&"+Элемент.Ключ+",ГОД)";
		Иначе
			Запрос.Текст=Запрос.Текст+"
			|	И "+Элемент.Ключ+"=&"+Элемент.Ключ;		
		КонецЕсли;		
		
		Запрос.УстановитьПараметр(Элемент.Ключ,Элемент.Значение);
	КонецЦикла;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;			
	КонецЦикла;	
	
	Возврат Документы[Вид].ПустаяСсылка();
КонецФункции //НайтиДокумент(Вид,СтруктураПоиска)

Функция ТребуетсяДопОбработка(ДокСсылка) Экспорт
	Если НЕ ЗначениеЗаполнено(ДокСсылка) Тогда Возврат Ложь КонецЕсли;
	
	ВидДокумента=ДокСсылка.Метаданные().Имя;
	Если ВидДокумента="Перемещение" Тогда
		ИмяТаблицы	=	"Справочник.ПунктыДоставки.ВидыДопОбработок";
		ИмяПоля		=	"ДопОбработка";
		
		ТекСсылка	=	ПолучитьРеквизитШапки(ДокСсылка,"ПунктДоставки","Документ");		
	ИначеЕсли ВидДокумента<>"Перемещение" и ВидДокумента<>"Комплектация" Тогда	
		ИмяТаблицы="Документ."+ВидДокумента+".ДопОбработки";
		ИмяПоля		=	"ВидДопОбработки";
		ТекСсылка	=	ДокСсылка;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Запрос=Новый Запрос;	
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1 "+ИмяПоля+" 
	|ИЗ "+ИмяТаблицы+" 
	|ГДЕ Ссылка=&Ссылка И "+ИмяПоля+"<>ЗНАЧЕНИЕ(Справочник.ВидыДопОбработки.БезОбработки)
	|";
	Запрос.УстановитьПараметр("Ссылка",ТекСсылка);
	Выборка=Запрос.Выполнить().Выбрать();
	
	Возврат (Выборка.Следующий() И ЗначениеЗаполнено(Выборка[ИмяПоля]));	
КонецФункции //ТребуетсяДопОбработка(ДокСсылка)


// Кухарь А.Ю. 15.01.2020 начало
//Теперь почти всё по ЗНБ, а не по плану набора
//Функция ЭтоБельё(ПланНабора,НомераСтрокПН) Экспорт
Функция ЭтоБельё(ПланНабора,НомераСтрокПН,ВидРасчета=Неопределено) Экспорт
	если ВидРасчета=Неопределено тогда
		// Кухарь А.Ю. 15.01.2020 конец
		
		
		Если ТипЗнч(НомераСтрокПН)<>Тип("Массив") ИЛИ НомераСтрокПН.Количество()=0 Тогда
			Возврат Ложь;	
		КонецЕсли;	
		
		Запрос=Новый ("Запрос");
		Запрос.Текст="
		|ВЫБРАТЬ	
		|	Брэнд.СекторХранения КАК СекторХранения
		|ИЗ
		|	Документ.ПланНабора.тБрэндов КАК ПланНаборатБрэндов
		|ГДЕ
		|	Ссылка = &Ссылка
		|	И НомерСтроки = &НомерСтроки
		|	И Брэнд.СекторХранения=""2""	
		|";
		
		НомерСтроки=НомераСтрокПН[0];
		Если ТипЗнч(НомерСтроки)<>Тип("Число") Тогда
			НомерСтроки=Число(НомерСтроки);	
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Ссылка",		ПланНабора);
		Запрос.УстановитьПараметр("НомерСтроки",НомерСтроки);
		// Кухарь А.Ю. 15.01.2020 начало
		// //Теперь почти всё по ЗНБ, а не по плану набора
	ИначеЕсли ВидРасчета="ЗНБ" тогда
		Запрос=Новый ("Запрос");
		Запрос.Текст="
		|ВЫБРАТЬ первые 1	
		|	Брэнд.СекторХранения КАК СекторХранения
		|ИЗ
		|	Документ.ПланНабора.тБрэндов КАК ПланНаборатБрэндов
		|ГДЕ
		|	Ссылка = &Ссылка
		|	И НомерЧасти = &НомерСтроки
		|	И Брэнд.СекторХранения=""2""	
		|";	
		Запрос.УстановитьПараметр("Ссылка",		ПланНабора);
		Запрос.УстановитьПараметр("НомерСтроки",НомераСтрокПН);
	КонецЕсли;	 
	// Кухарь А.Ю. 15.01.2020 конец
	
	Возврат НЕ Запрос.Выполнить().Пустой();	 
КонецФункции //ЭтоБельё(ПланНабора,НомераСтрокПН) Экспорт
//нечаева 29,08,16 --

//крохин начало 26.08.2019
Функция КСчетФактураРекламации(РКМКЦН,Организация=Неопределено) Экспорт	
	
	КСФ= документы.КорректировочныйСчетФактура.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	
	Если РКМКЦН.ДокОснование.метаданные().ИМя = "РасходнаяНакладная" Тогда
		//для РНК
		Запрос.Текст="ВЫБРАТЬ
		|	СчетФактура.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.КорректировочныйСчетФактура КАК СчетФактура
		|ГДЕ
		|	СчетФактура.Накладные.Накладная = &РКМКЦН
		|	И СчетФактура.Проведен ";		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("РКМКЦН",РКМКЦН);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла; 
	
	Возврат КСФ;
	
КонецФункции // СчетФактураНакладной()

//Кухарь 04.09.19 начало
Функция ПолучитьСостояниеПоследнегоПланаНабора(Накладная) экспорт
	если ложь тогда накладная=документы.РасходнаяНакладная.ПустаяСсылка();КонецЕсли;
	////Чтобы не выполнять лишний запрос
	//В эти состояния накладная переводится только если все куски плана набора в нём же.
	СписокЗначенийСразуВозвращаем=новый СписокЗначений;
	СписокЗначенийСразуВозвращаем.Добавить(Перечисления.СостоянияНакладной.ОжиданиеПаллетирования);
	СписокЗначенийСразуВозвращаем.Добавить(Перечисления.СостоянияНакладной.Паллетирование);
	//Валетов + 17,09,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5404 	
	СписокЗначенийСразуВозвращаем.Добавить(Перечисления.СостоянияНакладной.ОжиданиеОбработкиЧЗ);
	//Валетов -
	СписокЗначенийСразуВозвращаем.Добавить(Перечисления.СостоянияНакладной.ГотоваКОтгрузке);
	СписокЗначенийСразуВозвращаем.Добавить(Перечисления.СостоянияНакладной.Отгружена);
	если СписокЗначенийСразуВозвращаем.НайтиПоЗначению(накладная.СостояниеНакладной)<>Неопределено тогда
		возврат накладная.СостояниеНакладной;
	КонецЕсли;
	////Чтобы не выполнять лишний запрос
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПланНаборатБрэндов.Состояние КАК Состояние
	|ИЗ
	|	Документ.ПланНабора.тБрэндов КАК ПланНаборатБрэндов
	|ГДЕ
	|	ПланНаборатБрэндов.Ссылка.Дата >= &Дата
	|	И ПланНаборатБрэндов.Ссылка.Проведен
	|	И ПланНаборатБрэндов.Ссылка.ДокОснование = &Накладная";
	запрос.УстановитьПараметр("Дата",НачалоДня(накладная.дата));
	запрос.УстановитьПараметр("Накладная",Накладная);
	ТЗ=запрос.Выполнить().Выгрузить();
	если тз.Количество()=0 тогда
		возврат накладная.СостояниеНакладной;
	КонецЕсли;
	
	тз.Колонки.Добавить("ЧисловоеЗначение");
	для каждого СтрТЗ из ТЗ цикл
		СтрТЗ.ЧисловоеЗначение=ПолучитьНомерСостоянияНакладной(СтрТЗ.Состояние)
	КонецЦикла;
	
	ТЗ.Сортировать("ЧисловоеЗначение");
	возврат тз.Получить(0).Состояние;
	
КонецФункции
//Кухарь 04.09.19 конец


// Кухарь А.Ю. 16.01.2020 начало
Функция ПолучитьНовоеСостояниеЗНБ (ЗНБ,Состояние = Неопределено) экспорт
	ОжидаемоеНовоеСостояние=Неопределено;
	если Состояние = Неопределено тогда
		СтароеСостояние=ЗНБ.СостояниеНакладной;
	Иначе
		СтароеСостояние=Состояние;
	КонецЕсли;
	СтараяСтрока=знб.ПланируемыеСостояния.Найти(СтароеСостояние);
	если СтараяСтрока=Неопределено тогда      //Что-то наменяли руками с состояниями в ЗНБ
		// Кухарь А.Ю.  02.12.2022 начало
		//возврат Неопределено;
		возврат СтароеСостояние; 
		// Кухарь А.Ю.  02.12.2022 конец
	КонецЕсли;
	Сч=0;
	//Кухарь 27.10.2022 начало
	если ЗНБ.ПланируемыеСостояния.Индекс(СтараяСтрока)+1 = ЗНБ.ПланируемыеСостояния.количество() тогда
		возврат СтароеСостояние;
	КонецЕсли;
	//Кухарь 27.10.2022 конец
	
	
	Пока сч<ЗНБ.ПланируемыеСостояния.Количество() цикл 
		сч=сч+1;
		НоваяСтрока=ЗНБ.ПланируемыеСостояния.Получить(ЗНБ.ПланируемыеСостояния.Индекс(СтараяСтрока)+1);
		если НоваяСтрока.Пропустить тогда
			СтараяСтрока=НоваяСтрока;
		иначе
			ОжидаемоеНовоеСостояние=НоваяСтрока.Состояние;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	возврат  ОжидаемоеНовоеСостояние;
КонецФункции

// Кухарь А.Ю. 16.01.2020 конец



//Кухарь 17.01.20 начало
Функция ПолучитьЛогистическиеРеквизитыНоменклатуры(Номенклатура) экспорт
	если ложь тогда номенклатура=Справочники.Номенклатура.ПустаяСсылка();КонецЕсли;
	//Если ТипЗнч(Номенклатура)<>Тип("Массив")  Тогда
	СписокРеквизитов="ОбъемКоробки,Родитель.ОбъемКоробки,Родитель.ШтукВКоробке";
	Реквизиты=ПолучитьРеквизитыШапки(Номенклатура,СписокРеквизитов,"Справочник");
	если реквизиты.ОбъемКоробки=0 тогда
		реквизиты.ОбъемКоробки=Реквизиты.Родитель_ОбъемКоробки;
	КонецЕсли;
	возврат Реквизиты;	
КонецФункции
//Кухарь 17.01.20 конец

//крохин начало 20.01.2020
Функция ПолучитьДоговорДС(Контрагент)    Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Договоры.Ссылка КАК Договор
	|ИЗ
	|	Справочник.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.ДопСоглашение
	//крохин начало 02.12.2020
	|   И НЕ Договоры.ПометкаУдаления
	//крохин конец 02.12.2020
	|	И Договоры.КодЦБ = &КодЦБ";
	Запрос.УстановитьПараметр("КодЦБ",Контрагент.КодЦБ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	КоличествоДоговоровДС = Выборка.Количество();
	Если КоличествоДоговоровДС = 0 Тогда
		СообщитьОбОшибке("Отсутствует договор ДС!");
		Возврат Справочники.Договоры.ПустаяСсылка();
	КонецЕсли;
	Если КоличествоДоговоровДС > 1 Тогда
		СообщитьОбОшибке("Обнаружено несколько договоров ДС!");
		Возврат Справочники.Договоры.ПустаяСсылка();
	КонецЕсли;
	Если КоличествоДоговоровДС = 1 Тогда
		Выборка.Следующий();	
		Возврат Выборка.Договор;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьНачислениеПоДС(Контрагент,ДоговорСкидкиДС)  Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВзаиморасчетыОстатки.СуммаУпрОстаток КАК СуммаУпрОстаток
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.Остатки(
	|			&Дата1,
	|			Контрагент = &Контрагент
	|				И Договор = &Договор) КАК ВзаиморасчетыОстатки";
	
	Запрос.УстановитьПараметр("Контрагент",Контрагент.ведущий);
	Запрос.УстановитьПараметр("Договор",ДоговорСкидкиДС);
	Запрос.УстановитьПараметр("Дата1",ТекущаяДата());
	Выборка = запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат - Выборка.СуммаУпрОстаток; 
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСуммуСкидкиПоДСПоНеотгруженнымРНК(ДоговорСкидкиДС,ИсключатьРНК = Неопределено)   Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РасходнаяНакладная.СуммаСкидкиДС КАК СуммаСкидкиДС
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.Проведен
	//крохин начало 01.06.2020
	//|	И РасходнаяНакладная.Договор = &Договор
	|	И РасходнаяНакладная.ДоговорСкидкиДС = &Договор
	//крохин конец 01.06.2020
	|	И РасходнаяНакладная.Отгружен <> &Отгружен";
	Запрос.УстановитьПараметр("Договор",ДоговорСкидкиДС);
	Запрос.УстановитьПараметр("Отгружен",Перечисления.Отгружен.Отгружен);
	ТЗРезультат = Запрос.Выполнить().Выгрузить();
	Если ТЗРезультат.Количество() > 0 Тогда
		СуммаСкидкиДСПоВсемРНК = ТЗРезультат.Итог("СуммаСкидкиДС");
		Если ИсключатьРНК = Неопределено Тогда
			Возврат СуммаСкидкиДСПоВсемРНК;
		Иначе
			Возврат (СуммаСкидкиДСПоВсемРНК - ИсключатьРНК.СуммаСкидкиДС);
		КонецЕсли;
	Иначе
		Возврат 0; 
	КонецЕсли;
КонецФункции

//крохин конец 20.01.2020

// 	Кухарь А.Ю. 28.01.2020 начало
// 	Процедура создающая записи в РС из которых регл. заданием отправляются письма
//	СписокПолучателей - строка или список значений со строками. Если в строчке несколько адресатов, то их нужно разделить ##
//	ТекстПисьма и ТемаПисьма - строка
//	Основание - ссылка на документ, по которому уведомление
//  Вложение - двоичные данные
//	ИмяФайла - строка
//	УчетнаяЗаписьОтправителя - строка почтового адреса или ссылка на справочник УчетныеЗаписиЭлектроннойПочты
Функция СформироватьВнутреннееУведомление(СписокПолучателей, ТекстПисьма, ТемаПисьма, Основание = Неопределено, Вложение = Неопределено, ИмяФайла = "", УчетнаяЗаписьОтправителя = "",СписокВКопию="",Счетчик=0) экспорт
	
	если типзнч(СписокПолучателей)=тип("Строка") тогда
		СписокАдресов=СписокПолучателей
	ИначеЕсли типзнч(СписокПолучателей)=тип("СписокЗначений") тогда
		СписокАдресов="";
		для каждого Стр из СписокПолучателей цикл
			если Найти(СписокАдресов,Стр.Значение)=0 тогда
				СписокАдресов=СписокАдресов+Стр.Значение+"##";
			КонецЕсли;
		КонецЦикла;
		СписокАдресов=лев(СписокАдресов,СтрДлина(СписокАдресов)-2);
	иначе 
		Возврат "Неправильный список получателей. Разрешены строка и список значений.";
	КонецЕсли;
	
	///Тимофеев Ю.А. Начдало 03.08.2023 
	//список получателей копии
	если типзнч(СписокВКопию)=тип("Строка") тогда
		СписокПолучателейКопии=СписокВКопию;
	ИначеЕсли типзнч(СписокВКопию)=тип("СписокЗначений") тогда
		СписокПолучателейКопии="";
		для каждого Стр из СписокВКопию цикл
			если Найти(СписокПолучателейКопии,Стр.Значение)=0 тогда
				СписокПолучателейКопии=СписокПолучателейКопии+Стр.Значение+"##";
			КонецЕсли;
		КонецЦикла;
		СписокПолучателейКопии=лев(СписокПолучателейКопии,СтрДлина(СписокПолучателейКопии)-2);
	КонецЕсли;
	///Тимофеев Ю.А. конец 03.08.2023 
	
	
	
	
	
	
	если СписокАдресов="" или найти(СписокАдресов,"@")=0 или найти(СписокАдресов,".")=0  тогда
		Возврат "Пустой список получателей";
	КонецЕсли;
	
	Если ТекстПисьма= "" тогда
		Возврат "Пустой текст письма";
	КонецЕсли;
	
	ПереносСтроки="<br>";
	
	ТекстПисьма=СтрЗаменить(ТекстПисьма,символы.ПС,ПереносСтроки);
	ТекстПисьма=СтрЗаменить(ТекстПисьма,символы.НПП,ПереносСтроки);
	ТекстПисьма=СтрЗаменить(ТекстПисьма,символы.ВК,ПереносСтроки);
	
	ЗаписьВРег = РегистрыСведений.ПисьмаНаОтправку.СоздатьМенеджерЗаписи();
	
	//Тимофеев Ю.А. Начало 09.08.2023
	//ЗаписьВРег.ДатаСозданияПисьма = ТекущаяДата(); 	
	//ДатаСозданияПисьма = ВернутьСвободнуюДатуЗаписи(ТекущаяДата(),Основание);
	
	//Тимофеев Ю.А. Начало 17.08.2023
	ДатаСозданияПисьма = ТекущаяДата()+Счетчик; //разница на 1 секунду позволит создать несколько записей
	//Тимофеев Ю.А. Начало 17.08.2023
	
	ЗаписьВРег.ДатаСозданияПисьма = ДатаСозданияПисьма;
	//Тимофеев Ю.А. конец 09.08.2023  	
	
	ЗаписьВРег.период = ЗаписьВРег.ДатаСозданияПисьма;
	ЗаписьВРег.Основание = Основание;
	ЗаписьВРег.ТекстПисьма = ТекстПисьма;
	ЗаписьВРег.ТемаПисьма = ТемаПисьма;
	ЗаписьВРег.СписокПолучателей = СписокАдресов; 
	///Тимофеев Ю.А. Начдало 03.08.2023
	ЗаписьВРег.СписокПолучателейКопии = СписокПолучателейКопии;
	///Тимофеев Ю.А. конец 03.08.2023
	
	// Шворобей ВЮ 22.09.2022 ++
	Если ТипЗнч(УчетнаяЗаписьОтправителя) = Тип("Строка") И СокрЛП(УчетнаяЗаписьОтправителя) <> "" Тогда
		ЗаписьВРег.УчетнаяЗаписьОтправителя = СокрЛП(УчетнаяЗаписьОтправителя);
	ИначеЕсли ТипЗнч(УчетнаяЗаписьОтправителя) = Тип("СправочникСсылка.УчетныеЗаписиЭлектроннойПочты") Тогда
		ЗаписьВРег.УчетнаяЗаписьОтправителя = СокрЛП(УчетнаяЗаписьОтправителя.АдресЭлектроннойПочты);
	КонецЕсли;
	// Шворобей ВЮ 22.09.2022 ++
	
	Если Вложение = Неопределено И СокрЛП(ИмяФайла) <> "" Тогда
		ЗаписьВРег.ИмяФайлаВложения = ПолучитьЧастьИмениФайла(Имяфайла,"Имя");
		ЗаписьВРег.Вложение = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ИмяФайла), Новый СжатиеДанных(9));
	КонецЕсли;
	Если Вложение <> Неопределено И СокрЛП(ИмяФайла) <> "" Тогда
		ЗаписьВРег.ИмяФайлаВложения = ИмяФайла;
		ЗаписьВРег.Вложение = Новый ХранилищеЗначения(Вложение, Новый СжатиеДанных(9));
	КонецЕсли;
	
	Попытка
		ЗаписьВРег.Записать();
	Исключение
		Возврат ОписаниеОшибки();
	КонецПопытки;
	
	Возврат "";
	
КонецФункции
// Кухарь А.Ю. 28.01.2020 конец


//Тимофеев Ю.А. 09.08.2023
//так измерения у регистра ДатаЗаписи и Основание
//чтобы ДатаЗаписи не повторялась 
//вернем свободную секунду
Функция ВернутьСвободнуюДатуЗаписи(ДатаЗап,Основание) 
	МенеджерЗаписи = РегистрыСведений.ПисьмаНаОтправку.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ДатаСозданияПисьма  = ДатаЗап;
	МенеджерЗаписи.Основание           = Основание;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		//если есть уже запись -увеличим на секунду
		ДатаЗап=МенеджерЗаписи.ДатаСозданияПисьма+1;
		ВернутьСвободнуюДатуЗаписи(ДатаЗап,Основание);		
	Иначе
		Возврат ДатаЗап;
	КонецЕсли;    	
КонецФункции	
//Тимофеев Ю.А. 09.08.2023




// Кухарь А.Ю.  01.08.2023 начало
//Функция ПолучитьТаблицуМатриц (Накладная) экспорт
Функция ПолучитьТаблицуМатриц (Накладная,ДополнительнаяНоменклатура=Неопределено) экспорт 
	// Кухарь А.Ю.  01.08.2023 конец
	
	
	// Кухарь А.Ю. 19.02.2021 начало
	// Иногда будем сюда ЗНБ передавать
	Номенклатура= Накладная.товары.выгрузитьколонку("Номенклатура");	
	// Кухарь А.Ю.  01.08.2023 начало
	//
	если ТипЗнч(ДополнительнаяНоменклатура)=Тип("Массив") тогда
		для каждого СтрМасс из ДополнительнаяНоменклатура цикл
			Номенклатура.Добавить(СтрМасс);
		КонецЦикла;
	КонецЕсли;
	// Кухарь А.Ю.  01.08.2023 конец
	
	
	если накладная.метаданные().имя="ЗаданиеНабора" тогда
		Накладная=накладная.Накладная;
	КонецЕсли;
	// Кухарь А.Ю. 19.02.2021 конец
	
	
	Запрос			= Новый Запрос;				
	Запрос.Текст 	= "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МатрицаТовары.Ссылка КАК Ссылка,
	|	МатрицаТовары.Номенклатура КАК Номенклатура,
	|	МатрицаТовары.ШККонтрагента КАК ШККонтрагента,
	|	ВЫРАЗИТЬ(МатрицаТовары.АртикулКонтрагента КАК СТРОКА(150)) КАК АртикулКонтрагента,
	|	МатрицаТовары.Цена КАК Цена,
	|	МатрицаТовары.Кратность КАК Кратность,
	|	МатрицаТовары.МинимальноеКоличество КАК МинимальноеКоличество,
	|	МатрицаТовары.ЦенаПосредника КАК ЦенаПосредника,
	|	МатрицаТовары.ШККонтрагентаБлочок КАК ШККонтрагентаБлочок,
	|	МатрицаТовары.ШККонтрагентаКоробка КАК ШККонтрагентаКоробка,
	|	МатрицаТовары.КратностьКоробки КАК КратностьКоробки,
	|	ВЫРАЗИТЬ(МатрицаТовары.НаименованиеКонтрагента КАК СТРОКА(150)) КАК НаименованиеКонтрагента,
	|	ВЫРАЗИТЬ(МатрицаТовары.КодПроизводителяКонтрагента КАК СТРОКА(150)) КАК КодПроизводителяКонтрагента,
	|	МатрицаТовары.ШКСпайки КАК ШКСпайки,
	|	МатрицаТовары.ШККонтрагентаДополнительный КАК ШККонтрагентаДополнительный,
	|	МатрицаТовары.Ссылка.Дата КАК ДатаМатрицы,
	|	ВЫРАЗИТЬ(МатрицаТовары.НаименованиеБрендаДляКонтрагента КАК СТРОКА(150)) КАК НаименованиеБрендаДляКонтрагента,
	|	ВЫРАЗИТЬ(МатрицаТовары.НаименованиеЦветаДляКонтрагента КАК СТРОКА(150)) КАК НаименованиеЦветаДляКонтрагента,
	|	ВЫРАЗИТЬ(МатрицаТовары.НаименованиеРазмераДляКонтрагента КАК СТРОКА(150)) КАК НаименованиеРазмераДляКонтрагента,
	|	ВЫРАЗИТЬ(МатрицаТовары.ТипТовараДляКонтрагента КАК СТРОКА(150)) КАК ТипТовараДляКонтрагента,
	|	МатрицаТовары.Номенклатура.Код КАК КодНоменклатуры
	|ИЗ
	|	Документ.Матрица.Товары КАК МатрицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
	|ГДЕ
	|	МатрицаТовары.Ссылка.Проведен
	|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
	|	И МатрицаТовары.Ссылка.Договор = &Договор
	|	И МатрицаТовары.Ссылка.Дата <= &Дата1
	|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
	|	И МатрицаПунктыДоставки.ПунктДоставки = &ПунктДоставки
	|	И МатрицаТовары.Ссылка.ПостояннаяАкция = &ПостояннаяАкция
	|	И МатрицаТовары.Номенклатура В(&Номенклатура)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаМатрицы УБЫВ";
	
	Запрос.УстановитьПараметр("Дата2",			НачалоДня(Накладная.Дата));
	Запрос.УстановитьПараметр("Дата1",			КонецДня(Накладная.Дата));
	Запрос.УстановитьПараметр("Контрагент",		Накладная.Контрагент);		
	Запрос.УстановитьПараметр("ПунктДоставки",	Накладная.ПунктДоставки);				
	Запрос.УстановитьПараметр("Договор",		Накладная.Договор);	
	Запрос.УстановитьПараметр("ПостояннаяАкция",		Накладная.ПостояннаяАкция);	
	
	
	// Кухарь А.Ю. 19.02.2021 начало
	//  	Запрос.УстановитьПараметр("Номенклатура",		Накладная.товары.выгрузитьколонку("Номенклатура"));	
	Запрос.УстановитьПараметр("Номенклатура",		Номенклатура);	
	// Кухарь А.Ю. 19.02.2021 конец
	
	
	
	возврат Запрос.Выполнить().Выгрузить();
	
	
	
	
	
КонецФункции
//Кухарь 29.04.20 конец

//крохин начало 14.06.2020

// Кухарь А.Ю. 18.11.2024 начало
//
// Кухарь А.Ю.  18.12.2025 начало
//Функция ПолучитьТаблицуМатрицСрезПоследних (СтруктураДанныхНакладной,ДополнительнаяНоменклатура=Неопределено,ФильтрПоНоменклатуре=Неопределено) экспорт  
Функция ПолучитьТаблицуМатрицСрезПоследних (СтруктураДанныхНакладной,ДополнительнаяНоменклатура=Неопределено,ФильтрПоНоменклатуре=Неопределено,СтруктураОтключаемыхФильров = Неопределено) экспорт  
 
// Кухарь А.Ю.  18.12.2025 конец
	
	
	/////////////////////Ожидаемая структура данных такого вида
	//СтруктураДанныхНакладной=новый Структура("Номенклатура,ПунктДоставки,Договор,Дата,Контрагент,ПостояннаяАкция"); 
	//ЗаполнитьЗначенияСвойств(СтруктураДанныхНакладной,ДокОбъект,,"Номенклатура");
	//СтруктураДанныхНакладной.Номенклатура=ДокОбъект[ИмяТоварнойТЧ].выгрузить();
	
	//ДополнительнаяНоменклатура - массив, который прибавится к номенклатуре из структуры данных
	//ФильтрПоНоменклатуре - если установлен, то с отбором только по нему	
	
	если ФильтрПоНоменклатуре = Неопределено тогда
		Номенклатура= СтруктураДанныхНакладной.Номенклатура;	
		если ТипЗнч(ДополнительнаяНоменклатура)=Тип("Массив") тогда
			для каждого СтрМасс из ДополнительнаяНоменклатура цикл
				Номенклатура.Добавить(СтрМасс);
			КонецЦикла;
		КонецЕсли;
	иначе
		Номенклатура=ФильтрПоНоменклатуре;
	КонецЕсли;
	
	
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ 
	|	МатрицаТовары.Ссылка КАК ссылка,
	|	МатрицаТовары.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА МатрицаТовары.Ссылка.Акция
	|			ТОГДА ДОБАВИТЬКДАТЕ(МатрицаТовары.Ссылка.Дата, ГОД, 1)
	|		ИНАЧЕ МатрицаТовары.Ссылка.Дата
	|	КОНЕЦ КАК Дата,
	
	// Кухарь А.Ю.  28.01.2025 начало
	//
	|	МатрицаТовары.КолКоробовВСлое КАК КоробовВСлое,
	|	МатрицаТовары.ВысотаПаллета КАК ВысотаПаллета,
	|	МатрицаТовары.КратностьКоробки КАК КратностьКоробки,
	
	// Кухарь А.Ю.  28.01.2025 конец
	
	|	МатрицаТовары.ДатаНачалаРаботыСМаркировкой КАК ДатаНачалаРаботыСМаркировкой,
	
	// Кельманов А.В. - HELP-2579 - 2025.01.16 {
	|	ВЫРАЗИТЬ(МатрицаТовары.АртикулКонтрагента КАК СТРОКА(150)) КАК АртикулКонтрагента,
	// Кельманов А.В. - HELP-2579 - 2025.01.16 }
	// Кельманов А.В. - HELP-3209 - 2025.03.06 {
	|	МатрицаТовары.ШККонтрагента КАК ШККонтрагента,
	// Кельманов А.В. - HELP-3209 - 2025.03.06 }
	// Кельманов А.В. - HELP-7662 - 2025.11.18 {
	|	МатрицаТовары.ШККонтрагентаКоробка КАК ШККонтрагентаКоробка,
	// Кельманов А.В. - HELP-7662 - 2025.11.18 }   
	// Кухарь А.Ю.  04.05.2026 начало
	// HELP-9489 
	|	МатрицаТовары.ШККонтрагентаБлочок КАК ШККонтрагентаБлочок,
	// Кухарь А.Ю.  04.05.2026 конец
	
	// Кухарь А.Ю.  25.01.2025 начало
	// https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-1251
	|	МатрицаТовары.Кратность КАК КратностьБлочка,
	|	ВЫРАЗИТЬ(МатрицаТовары.НаименованиеКонтрагента КАК СТРОКА(150)) КАК НаименованиеКонтрагента,
	// Кухарь А.Ю.  25.01.2025 конец	
	// Кухарь А.Ю.  18.12.2025 начало
	// HELP-8209 
	|	МатрицаТовары.Цена КАК Цена, 
	// Кухарь А.Ю.  18.12.2025 конец
	
	|	МатрицаТовары.Ссылка.Акция КАК Акция
	|ПОМЕСТИТЬ ПолныеДанные
	|ИЗ
	|	Документ.Матрица.Товары КАК МатрицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
	|ГДЕ
	|	МатрицаТовары.Номенклатура в (&Номенклатура)
	|	И МатрицаТовары.Ссылка.Проведен
	|	И МатрицаТовары.Ссылка.Дата <= &Дата
	|	И МатрицаТовары.Ссылка.Договор = &Договор
	|	И МатрицаПунктыДоставки.ПунктДоставки = &ПунктДоставки
	|	И МатрицаТовары.Ссылка.ПостояннаяАкция = &ПостояннаяАкция   
	|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ДатаОкончания	
	|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПолныеДанные.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ПолныеДанные.Дата) КАК Дата
	|ПОМЕСТИТЬ ПоследниеДаты
	|ИЗ
	|	ПолныеДанные КАК ПолныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ПолныеДанные.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоследниеДаты.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ПолныеДанные.ссылка) КАК ссылка,
	// Кухарь А.Ю.  28.01.2025 начало
	//     
	|	МАКСИМУМ(ПолныеДанные.КоробовВСлое) КАК КоробовВСлое,
	|	МАКСИМУМ(ПолныеДанные.ВысотаПаллета) КАК ВысотаПаллета,
	|	МАКСИМУМ(ПолныеДанные.КратностьКоробки) КАК КратностьКоробки,
	
	// Кухарь А.Ю.  28.01.2025 конец
	
	// Кухарь А.Ю.  25.01.2025 начало
	// https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-1251
	|	МАКСИМУМ(ПолныеДанные.КратностьБлочка) КАК КратностьБлочка,		
	|	МАКСИМУМ(ПолныеДанные.НаименованиеКонтрагента) КАК НаименованиеКонтрагента,	
	// Кухарь А.Ю.  25.01.2025 конец	
	|	МАКСИМУМ(ПолныеДанные.ДатаНачалаРаботыСМаркировкой) КАК ДатаНачалаРаботыСМаркировкой
	// Кельманов А.В. - HELP-2579 - 2025.01.16 {
	|	,
	|	МАКСИМУМ(ПолныеДанные.АртикулКонтрагента) КАК АртикулКонтрагента
	// Кельманов А.В. - HELP-2579 - 2025.01.16 }
	// Кельманов А.В. - HELP-3209 - 2025.03.06 {
	|	,
	|	МАКСИМУМ(ПолныеДанные.ШККонтрагента) КАК ШККонтрагента
	// Кельманов А.В. - HELP-3209 - 2025.03.06 }   
	// Кухарь А.Ю.  18.12.2025 начало
	// HELP-8209       
	|	,
	|	МАКСИМУМ(ПолныеДанные.Цена) КАК Цена,
	|	ПоследниеДаты.Номенклатура.Родитель как Модель
	// Кухарь А.Ю.  18.12.2025 конец
	// Кухарь А.Ю.  04.05.2026 начало
	// HELP-9489 
	|	,МАКСИМУМ(ПолныеДанные.ШККонтрагентаБлочок) КАК ШККонтрагентаБлочок

	// Кухарь А.Ю.  04.05.2026 конец
	
	// Кельманов А.В. - HELP-7662 - 2025.11.18 {
	|	,
	|	МАКСИМУМ(ПолныеДанные.ШККонтрагентаКоробка) КАК ШККонтрагентаКоробка
	// Кельманов А.В. - HELP-7662 - 2025.11.18 }
	|ИЗ
	|	ПоследниеДаты КАК ПоследниеДаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПолныеДанные КАК ПолныеДанные
	|		ПО ПоследниеДаты.Номенклатура = ПолныеДанные.Номенклатура
	|			И ПоследниеДаты.Дата = ПолныеДанные.Дата
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоследниеДаты.Номенклатура
	// Кухарь А.Ю.  18.12.2025 начало
	// HELP-8209 
		|,	ПоследниеДаты.Номенклатура.Родитель"; 
	// Кухарь А.Ю.  18.12.2025 конец;
	
	Запрос.УстановитьПараметр("ПунктДоставки",СтруктураДанныхНакладной.ПунктДоставки);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Контрагент",СтруктураДанныхНакладной.Контрагент);
	запрос.УстановитьПараметр("Дата",КонецДня(СтруктураДанныхНакладной.Дата));
	Запрос.УстановитьПараметр("ДатаОкончания",НачалоДня(СтруктураДанныхНакладной.Дата));
	Запрос.УстановитьПараметр("Договор",СтруктураДанныхНакладной.Договор);	
	Запрос.УстановитьПараметр("ПостояннаяАкция", СтруктураДанныхНакладной.ПостояннаяАкция);       

	// Кухарь А.Ю.  18.12.2025 начало      
	// HELP-8209 	
	если СтруктураОтключаемыхФильров<>Неопределено тогда   
		если СтруктураОтключаемыхФильров.Свойство("ПунктДоставки") и СтруктураОтключаемыхФильров.ПунктДоставки тогда   
			Запрос.Текст = СтрЗаменить(запрос.Текст,"МатрицаПунктыДоставки.ПунктДоставки = &ПунктДоставки","Истина");
		КонецЕсли;
		если СтруктураОтключаемыхФильров.Свойство("Договор") и СтруктураОтключаемыхФильров.Договор тогда   
			Запрос.Текст = СтрЗаменить(запрос.Текст,"МатрицаТовары.Ссылка.Договор = &Договор","Истина");
		КонецЕсли;    
		если СтруктураОтключаемыхФильров.Свойство("ПостояннаяАкция") и СтруктураОтключаемыхФильров.ПостояннаяАкция тогда   
			Запрос.Текст = СтрЗаменить(запрос.Текст,"МатрицаТовары.Ссылка.ПостояннаяАкция = &ПостояннаяАкция ","Истина");
		КонецЕсли;
	КонецЕсли;
	// Кухарь А.Ю.  18.12.2025 конец
	
	
	возврат Запрос.Выполнить().Выгрузить();
КонецФункции
// Кухарь А.Ю. 18.11.2024 конец


Процедура ПослатьПисьмоОТестировании(Тема,Текст,Получатель = "")  Экспорт
	
	попытка
		ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
		ЗаписатьВЛог("КонтрольОбъема","Отправление почты """+параметрыСеанса.Пользователь+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
	исключение
	конецпопытки;
	
	ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль; 
	
	// Кухарь А.Ю.  08.09.2022 начало
	//ПочтовыйПрофиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//ПочтовыйПрофиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//ПочтовыйПрофиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(ПочтовыйПрофиль,ПараметрыПочты);	
	// Кухарь А.Ю.  08.09.2022 конец
	
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//ПочтовыйПрофиль.Пользователь="*%*%*%";
	//ПочтовыйПрофиль.Пароль="*$*$*$";
	ПочтовыйПрофиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
	Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Логин;
	ПочтовыйПрофиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
	Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	ПочтовыйПрофиль.ВремяОжидания      = 60; 
	
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	
	
	
	Сообщение.Получатели.Добавить("krohin@collant.ru");
	Если Получатель <> "" Тогда
		Сообщение.Получатели.Добавить(Получатель);
	КонецЕсли;
	
	Сообщение.Отправитель = "helpdesk@collant.ru";
	Сообщение.Тема = Тема;
	Сообщение.Тексты.Добавить(Текст);
	
	Почта = Новый ИнтернетПочта(); 
	Попытка 
		Почта.Подключиться(ПочтовыйПрофиль); 
	Исключение 
		//Сообщить(ОписаниеОшибки()); 
		Возврат; 
	КонецПопытки; 
	
	Почта.Подключиться(ПочтовыйПрофиль);
	Почта.Послать(Сообщение);
	Почта.Отключиться();
	
	
КонецПроцедуры	


//крохин конец 14.06.2020

//крохин начало 29.12.2020
Функция ОпределитьПараметрыСкладаКомиссионера(СкладКомиссионера) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПунктыДоставки.Ссылка КАК ПунктДоставки,
	|	ПунктыДоставки.Владелец КАК Контрагент
	|ИЗ
	|	Справочник.ПунктыДоставки КАК ПунктыДоставки
	|ГДЕ
	|	ПунктыДоставки.СкладКомиссия = &СкладКомиссия
	|	И НЕ ПунктыДоставки.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("СкладКомиссия",СкладКомиссионера);
	ПараметрыСкладаКомиссионера  = Новый Структура;
	
	Выборка = запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПараметрыСкладаКомиссионера.Вставить("Контрагент",Выборка.Контрагент);
		ПараметрыСкладаКомиссионера.Вставить("ПунктДоставки",Выборка.ПунктДоставки);
	Иначе
		ПараметрыСкладаКомиссионера.Вставить("Контрагент",Справочники.Контрагенты.ПустаяСсылка());
		ПараметрыСкладаКомиссионера.Вставить("ПунктДоставки",Справочники.ПунктыДоставки.ПустаяСсылка());
	КонецЕсли;
	Возврат ПараметрыСкладаКомиссионера;
КонецФункции

//крохин конец 29.12.2020


//крохин конец 29.12.2020

//крохин начало 16.01.2021
Функция ПолучитьДоговорСертификатыФранчайзи(Справочник)  Экспорт
	Запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	|	РеквизитыСправочников.Справочник КАК Справочник,
	|	РеквизитыСправочников.ИмяРеквизита КАК ИмяРеквизита,
	|	РеквизитыСправочников.ЗначениеРеквизита КАК ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
	|ГДЕ
	|	РеквизитыСправочников.ИмяРеквизита = &ИмяРеквизита
	|	И РеквизитыСправочников.Справочник = &Справочник";
	Запрос.УстановитьПараметр("Справочник",Справочник);
	Если ТипЗнч(Справочник) = ТипЗнч(Справочники.Контрагенты.ПустаяСсылка()) Тогда
		Запрос.УстановитьПараметр("ИмяРеквизита","ДоговорСертификатыКонтрагент");
	Иначе
		Запрос.УстановитьПараметр("ИмяРеквизита","ДоговорСертификатыТЦ");
	КонецЕсли;
	Выборка = запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЗначениеРеквизита;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
//крохин конец 16.01.2021


// Кухарь А.Ю. 30.06.2021 начало
//
Функция ПрочитатьРСРеквизитСправочника(ИмяРеквизита,СправочникСсылка,ПустоеЗначение=Неопределено) экспорт
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	РеквизитыСправочников.ЗначениеРеквизита КАК ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
	|ГДЕ
	|	РеквизитыСправочников.Справочник = &СправочникСсылка
	|	И РеквизитыСправочников.ИмяРеквизита = &ИмяРеквизита";
	запрос.УстановитьПараметр("ИмяРеквизита",ИмяРеквизита);
	запрос.УстановитьПараметр("СправочникСсылка",СправочникСсылка);
	Выборка=запрос.Выполнить().Выбрать();
	
	пока выборка.Следующий() цикл
		возврат Выборка.ЗначениеРеквизита;
	КонецЦикла;
	
	возврат ПустоеЗначение;
КонецФункции

Процедура ЗаписатьРСРеквизитСправочника(ИмяРеквизита,ЗначениеРеквизита,СправочникСсылка) экспорт
	если ЗначениеРеквизита<>Неопределено тогда
		ЗаписьВРег=РегистрыСведений.РеквизитыСправочников.СоздатьМенеджерЗаписи();
		ЗаписьВРег.Справочник=СправочникСсылка;
		ЗаписьВРег.ИмяРеквизита=ИмяРеквизита;
		ЗаписьВРег.Период=ТекущаяДата();
		ЗаписьВРег.ЗначениеРеквизита=ЗначениеРеквизита;
		ЗаписьВРег.Записать();
	иначе
		//Удаление записи
		ЗапВРег=РегистрыСведений.РеквизитыСправочников.СоздатьНаборЗаписей();	
		ЗапВРег.Отбор.ИмяРеквизита.значение=ИмяРеквизита;
		ЗапВРег.Отбор.Справочник.значение=СправочникСсылка;
		ЗапВРег.Отбор.ИмяРеквизита.использование=Истина;
		ЗапВРег.Отбор.Справочник.использование=Истина;	
		ЗапВРег.Прочитать();
		ЗапВРег.Очистить();
		ЗапВРег.Записать();
	КонецЕсли;
	
КонецПроцедуры
// Кухарь А.Ю. 30.06.2021 конец


// Кухарь А.Ю. 12.08.2021 начало
// Запрет отгрузки ПРМ сброс на склад РНК с номенклатурой без состава
Функция ПроверитьНаличиеТоваровБезСоставаПоНакладной (Накладная) Экспорт
	
	Получатель=Справочники.Контрагенты.ПустаяСсылка();
	ВидДокумента=Накладная.метаданные().имя;
	если ВидДокумента="РасходнаяНакладная" тогда
		Получатель=ПолучитьРеквизитШапки(Накладная,"Контрагент","Документ");
	ИначеЕсли ВидДокумента="Перемещение" тогда
		Получатель=ПолучитьРеквизитШапки(Накладная,"СкладПолучатель","Документ");
	иначе
		возврат Истина;
	КонецЕсли;
	НужноПроверять=ПрочитатьРСРеквизитСправочника("НоваяБазаТЦ",Получатель,ложь);
	
	если не НужноПроверять тогда
		возврат Истина;
	КонецЕсли;
	
	Результат=Истина;
	Запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЧДокумента.Номенклатура.Родитель КАК Модель
	|ПОМЕСТИТЬ ТЧТовары
	|ИЗ
	|	Документ."+ВидДокумента+".Товары КАК ТЧДокумента
	|ГДЕ
	|	ТЧДокумента.Ссылка = &Накладная
	|	И ТЧДокумента.Номенклатура.Родитель.ВидНоменклатуры = &ВидНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НоменклатураСоставНоменклатуры.Ссылка КАК НоменклатураСостава,
	|	ТЧТовары.Модель.Наименование КАК Наименование,
	|	ТЧТовары.Модель КАК Модель
	|ИЗ
	|	ТЧТовары КАК ТЧТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.СоставНоменклатуры КАК НоменклатураСоставНоменклатуры
	|		ПО ТЧТовары.Модель = НоменклатураСоставНоменклатуры.Ссылка
	|ГДЕ
	|	НоменклатураСоставНоменклатуры.Ссылка ЕСТЬ NULL";
	запрос.УстановитьПараметр("Накладная",Накладная);
	запрос.УстановитьПараметр("ВидНоменклатуры",Перечисления.ВидыНоменклаутры.Товар);
	Выборка=запрос.Выполнить().Выбрать();
	пока Выборка.Следующий() цикл
		Результат=ложь;
		СообщитьИзМодуля("Не заполнен состав у "+Выборка.Наименование);
	КонецЦикла;
	Возврат Результат;
КонецФункции
// Кухарь А.Ю. 30.06.2021 конец


// Кухарь А.Ю. 24.08.2021 начало
Функция ПолучитьРазбивкуНоменклатурыПоУпаковкеДокумента (Номенклатура,МассивДопОбработок,Контрагент=Неопределено) экспорт
	
	если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") тогда
		МассивНоменклатуры=новый Массив;
		МассивНоменклатуры.Добавить(Номенклатура);
	иначе
		МассивНоменклатуры=Номенклатура;
	КонецЕсли;
	
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	УпаковкаЭлементыУпаковки.Ссылка.Владелец КАК Владелец,
	|	УпаковкаЭлементыУпаковки.Номенклатура КАК Упаковка,
	|	УпаковкаЭлементыУпаковки.Количество КАК Количество
	|ИЗ
	|	Справочник.Упаковка.ЭлементыУпаковки КАК УпаковкаЭлементыУпаковки
	|ГДЕ
	|	УпаковкаЭлементыУпаковки.ВидДопОбработки В(&МассивДопОбработок)
	|	И УпаковкаЭлементыУпаковки.Ссылка.Владелец В(&МассивНоменклатуры)
	|	И НЕ УпаковкаЭлементыУпаковки.Ссылка.ПометкаУдаления
	// Кухарь А.Ю. 08.09.2021 начало
	|	И УпаковкаЭлементыУпаковки.Контрагент В(&СписокКонтрагентов)";	
	СписокКонтрагентов=новый СписокЗначений;
	СписокКонтрагентов.Добавить(Справочники.Контрагенты.ПустаяСсылка());
	если Контрагент<>Неопределено тогда
		СписокКонтрагентов.Добавить(Контрагент);
	КонецЕсли;
	запрос.УстановитьПараметр("СписокКонтрагентов",СписокКонтрагентов);			 
	// Кухарь А.Ю. 08.09.2021 конец
	
	
	
	запрос.УстановитьПараметр("МассивНоменклатуры",МассивНоменклатуры);
	запрос.УстановитьПараметр("МассивДопОбработок",МассивДопОбработок);
	
	Возврат запрос.Выполнить().Выгрузить();	
	
КонецФункции
// Кухарь А.Ю. 24.08.2021 конец


// Кухарь А.Ю. 20.10.2021 начало
// 
функция  ПолучитьСвободныйОстатокНаКонецДня(МассивНоменклатуры,Склад,Дата) экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(ОстаткиТМЦОстатки.КоличествоОстаток - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0)) КАК СвободныйОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(
	|			&Дата,
	|			Номенклатура В (&МассивНоменклатуры)
	|				И Склад = &Склад) КАК ОстаткиТМЦОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	|				&Дата,
	|				Номенклатура В (&МассивНоменклатуры)
	|					И Склад = &Склад) КАК РезервыТМЦОстатки
	|		ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиТМЦОстатки.Номенклатура";
	
	Запрос.УстановитьПараметр("Склад",Склад);
	Запрос.УстановитьПараметр("Дата",КонецДня(Дата));
	Запрос.УстановитьПараметр("МассивНоменклатуры",МассивНоменклатуры);
	возврат Запрос.Выполнить().Выгрузить();
	
	
конецФункции	
// Кухарь А.Ю. 20.10.2021 конец



// Кухарь А.Ю. 20.10.2021 конец

// Кухарь А.Ю. 15.12.2021 начало
Процедура УстановитьНомерДокументаКлиентСервер(ДокументОбъект) Экспорт
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	ДопБуква = "";
	
	Если МетаданныеДокумента.Имя = "РасходнаяНакладная" Тогда
		
		// Кельманов А.В. - ASU-496 - 2024.12.19 {
		//Если ДокументОбъект.Дата >= '20200101' Тогда
		Если ДокументОбъект.Дата >= '20250101' Тогда
			ДопБуква = "";
		ИначеЕсли ДокументОбъект.Дата >= '20200101' Тогда
			// Кельманов А.В. - ASU-496 - 2024.12.19 }
			ДопБуква = "б";
		Иначе
			ДопБуква = ?(ДокументОбъект.ВидОплаты = Перечисления.ВидыОплаты.БН, "б", "а");
		КонецЕсли;
		
	ИначеЕсли МетаданныеДокумента.Имя = "ОтчетКассовойСмены" Тогда
		
		ДопБуква = ?(ДокументОбъект.ВидОплаты = Перечисления.ВидыОплаты.БН, "кб", "кн");
		
	КонецЕсли; 
	
	Вид=МетаданныеДокумента.Имя;
	Если Вид="ЛистНабора" или Вид="ЛистПереукладки" Тогда
		ИмяДокумента=СокрЛП(ДокументОбъект.ДокОснование.Номер);
		ТипДокОсн= ДокументОбъект.ДокОснование.Метаданные().Имя;
		Если ТипДокОсн="Инвентаризация" Тогда			
			ИмяДокумента=""+ИмяДокумента+"i";
			ИмяДокумента=Лев(ИмяДокумента,4)+Сред(ИмяДокумента,6,СтрДлина(ИмяДокумента))+"/";
			ДокументОбъект.УстановитьНовыйНомер(СокрЛП(ИмяДокумента));
		Иначе
			ДокументОбъект.УстановитьНовыйНомер(СокрЛП(ДокументОбъект.ДокОснование.Номер)+"/");
		КонецЕсли;
	ИначеЕсли  Вид="КорректировочныйСчетФактура" Тогда
		попытка			
			ДокРНк=ДокументОбъект.накладные[0].накладная.докоснование.ссылка; 			
		исключение
			СообщитьИзМодуля("Сначала сохраните документ!");
		конецПопытки;
		
		Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
			Префикс=ПараметрыСеанса.ЭтотУзел.Код;
			ПрефиксСклада	=СокрЛП(ДокументОбъект.Склад.Префикс);
			Префикс = Префикс + ПрефиксСклада;
			Если ДокументОбъект.Организация <> Справочники.Организации.НайтиПоКоду("SS-001") И не ПустаяСтрока(ДокументОбъект.Организация.Префикс) Тогда
				Префикс = Лев(ДокументОбъект.Организация.Префикс,1)+ Прав(Префикс,СтрДлина(Префикс)-1);	
			КонецЕсли;
		Иначе
			ПрефиксКонтрагента="";			
			Если ДокументОбъект.Накладные.Количество()>0 Тогда
				Накладная=ДокументОбъект.Накладные[0].Накладная;
				Если ЕстьРеквизитДокумента("ПунктДоставки",Накладная.Метаданные()) И ЗначениеЗаполнено(Накладная.ПунктДоставки.ПрефиксСФ) Тогда
					ПрефиксКонтрагента=СокрЛП(Накладная.ПунктДоставки.ПрефиксСФ);
				КонецЕсли;			
			КонецЕсли;			
			
			Если ПустаяСтрока(ПрефиксКонтрагента) Тогда
				ПрефиксКонтрагента=СокрЛП(ПолучитьРеквизитРодителя(ДокументОбъект.Контрагент,"ПрефиксСФ"));			
			КонецЕсли; 
			
			Если ПустаяСтрока(ПрефиксКонтрагента) Тогда
				ПрефиксСклада	=СокрЛП(ДокументОбъект.Склад.Префикс);
				Попытка
					ДокРКМ =  ДокументОбъект.накладные[0].накладная;
					Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение И ДокРКМ.Метаданные().Имя = "РекламационнаяНакладная" И НЕ (ДокРКМ.ДокументВозврата.Пустая()) Тогда
						ПрефиксСклада = "v";	
					КонецЕсли;
				Исключение						
				КонецПопытки;
				ПрефиксИБ		=СокрЛП(ДокументОбъект.Склад.ПрефиксИБ);
				
				Если ПрефиксИБ="SNL" Тогда
					Префикс=ПрефиксИБ;
				Иначе
					Префикс=?(НЕ ПустаяСтрока(ДокументОбъект.Организация.Префикс),СокрЛП(ДокументОбъект.Организация.Префикс)+ПрефиксСклада,ДокументОбъект.ИБ.Код);				
				КонецЕсли;				
			Иначе				
				Префикс=?(НЕ ПустаяСтрока(ДокументОбъект.Организация.Префикс),СокрЛП(ДокументОбъект.Организация.Префикс)+ПрефиксКонтрагента,ДокументОбъект.ИБ.Код);			
			КонецЕсли;			
		КонецЕсли; 
		
		Если ПерваяСФ(Префикс,ДокументОбъект.Дата) Тогда
			КоличествоПропусков = 1; 
		Иначе
			КоличествоПропусков=0;
		КонецЕсли;
		
		УстановитьНормальныйНовыйНомер(ДокументОбъект,Префикс+"-",КоличествоПропусков);
		
	ИначеЕсли Вид="СчетФактура" Тогда 		
		Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
			Префикс=ПараметрыСеанса.ЭтотУзел.Код;
			ПрефиксСклада	=СокрЛП(ДокументОбъект.Склад.Префикс);
			Префикс = Префикс + ПрефиксСклада;
			Если ДокументОбъект.Организация <> Справочники.Организации.НайтиПоКоду("SS-001") И не ПустаяСтрока(ДокументОбъект.Организация.Префикс) Тогда
				Префикс = Лев(ДокументОбъект.Организация.Префикс,1)+ Прав(Префикс,СтрДлина(Префикс)-1);	
			КонецЕсли;
		Иначе
			ПрефиксКонтрагента="";		
			Если ДокументОбъект.Накладные.Количество()>0 Тогда
				Накладная=ДокументОбъект.Накладные[0].Накладная;
				Если ЕстьРеквизитДокумента("ПунктДоставки",Накладная.Метаданные()) И ЗначениеЗаполнено(Накладная.ПунктДоставки.ПрефиксСФ) Тогда
					ПрефиксКонтрагента=СокрЛП(Накладная.ПунктДоставки.ПрефиксСФ);
				КонецЕсли;			
			КонецЕсли;			
			
			Если ПустаяСтрока(ПрефиксКонтрагента) Тогда
				ПрефиксКонтрагента=СокрЛП(ПолучитьРеквизитРодителя(ДокументОбъект.Контрагент,"ПрефиксСФ"));			
			КонецЕсли; 
			
			Если ПустаяСтрока(ПрефиксКонтрагента) Тогда
				ПрефиксСклада	=СокрЛП(ДокументОбъект.Склад.Префикс);
				ПрефиксИБ		=СокрЛП(ДокументОбъект.Склад.ПрефиксИБ);
				
				Если ПрефиксИБ="SNL" Тогда
					Префикс=ПрефиксИБ;
				Иначе
					Префикс=?(НЕ ПустаяСтрока(ДокументОбъект.Организация.Префикс),СокрЛП(ДокументОбъект.Организация.Префикс)+ПрефиксСклада,ДокументОбъект.ИБ.Код);				
				КонецЕсли;				
			Иначе				
				Префикс=?(НЕ ПустаяСтрока(ДокументОбъект.Организация.Префикс),СокрЛП(ДокументОбъект.Организация.Префикс)+ПрефиксКонтрагента,ДокументОбъект.ИБ.Код);			
			КонецЕсли;			
		КонецЕсли; 
		
		Если ПерваяСФ(Префикс,ДокументОбъект.Дата) Тогда
			КоличествоПропусков = 1; 
		Иначе
			КоличествоПропусков=0;
		КонецЕсли;
		
		УстановитьНормальныйНовыйНомер(ДокументОбъект,Префикс+"-",КоличествоПропусков);
	ИначеЕсли ЕстьРеквизитДокумента("ИБ",МетаданныеДокумента) Тогда
		ЭтотУзел=ПараметрыСеанса.ЭтотУзел;
		
		
		Если ЕстьРеквизитДокумента("Склад",МетаданныеДокумента) Тогда
			ПрефиксИБ=ДокументОбъект.Склад.ПрефиксИБ;

		КонецЕсли;					 
		
		// Кухарь А.Ю. 22.12.2025 начало
		//SNL-73
		//Если ПустаяСтрока(ПрефиксИБ) Тогда
		//	ПрефиксИБ=ДокументОбъект.ИБ.Код;	
		//КодИБ=?(ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение,ПрефиксИБ,ЭтотУзел.Код);	
		ПрефиксИБ = ОбщегоНазначения_ПИ.ПолучитьПрефиксПоДатеИУзлу(НачалоГода(ДокументОбъект.Дата),ЭтотУзел);
		КодИБ=ПрефиксИБ;	
		// Кухарь А.Ю. 22.12.2025 конец
		
		
		
		
		
		Если МетаданныеДокумента.Имя="Заказ"  Тогда		
			Если ЕстьРеквизитДокумента("Склад",МетаданныеДокумента) Тогда
				ПрефиксИБ=ДокументОбъект.Склад.ПрефиксИБ;
			КонецЕсли;		
			Если ПустаяСтрока(ПрефиксИБ) Тогда
				ПрефиксИБ=ДокументОбъект.ИБ.Код;			
			КонецЕсли; 
			
			КодИБ=?(ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение,ПрефиксИБ,ЭтотУзел.Код);			
		КонецЕсли;		
		
		Если МетаданныеДокумента.Имя="РекомендованныйОстаток"  Тогда		
			ПрефиксИБ="";			
			КодИБ=ПараметрыСеанса.ЭтотУзел.Код;			
		КонецЕсли;	
		Если МетаданныеДокумента.Имя="ПриходнаяНакладная" И (КодИБ="SSP" ИЛИ КодИБ="SST" ИЛИ КодИБ="SSV") Тогда
			ДокументОбъект.УстановитьНовыйНомер(КодИБ+"-0");
			// Кухарь А.Ю.  09.01.2023 начало
			//Номера начали заканчиваться
		ИначеЕсли МетаданныеДокумента.Имя="ПланНабора" тогда
			//Валетов + 29,08,2025 Закончилась номерация для Плана набора. Пока правим префикс. 
			Если  КодИБ = "OD7" И ДеньГода(ТекущаяДата()) > 180 Тогда 
				КодИБ = "OD8";
			КонецЕсли;
			//Валетов -
			ДокументОбъект.УстановитьНовыйНомер(КодИБ+"_");
			// Кухарь А.Ю.  09.01.2023 конец			
		Иначе
			ДокументОбъект.УстановитьНовыйНомер(КодИБ+ДопБуква+"-");
		КонецЕсли;
	ИначеЕсли Вид="УслугиСтороннихОрганизаций" или Вид="СчетЗаДоставку" или Вид="НоменклатурноеПриложениеКПаллете"  Тогда
		если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
			Префикс=ДокументОбъект.Организация.Префикс+"-";
		иначе
			Префикс=ПараметрыСеанса.ЭтотУзел.Код+"-";
		КонецЕсли;
		ДокументОбъект.УстановитьНовыйНомер(Префикс);
	ИначеЕсли Вид="АвансовыйОтчет" Тогда
		Если ДокументОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН Тогда
			Префикс=ДокументОбъект.Организация.Префикс+"-";
		Иначе
			Префикс=ПараметрыСеанса.ЭтотУзел.Код;			
		КонецЕсли;
		
		ДокументОбъект.УстановитьНовыйНомер(Префикс);
	Иначе		
		КодИБ=ПараметрыСеанса.ЭтотУзел.Код;
		
		ДокументОбъект.УстановитьНовыйНомер(КодИБ+"-");		
	КонецЕсли;
	
КонецПроцедуры // УстановитьНомерДокумента()

Функция ПерваяСФ(Префикс,Дата)
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ
	|	Документ.СчетФактура КАК СчетФактура
	|ГДЕ
	|	Дата МЕЖДУ &Дата1 И &Дата2
	|	И Номер ПОДОБНО &Номер
	|	И НЕ ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Дата));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата));
	Запрос.УстановитьПараметр("Номер",Префикс+"%");		
	
	Возврат Запрос.Выполнить().Пустой();
КонецФункции 

Функция УстановитьНормальныйНовыйНомер(ДокументОбъект,Префикс,КоличествоПропусков=0)
	МетаДок=ДокументОбъект.Метаданные();	
	Периодичность=МетаДок.ПериодичностьНомера;
	ДлинаЧисловойЧасти=МетаДок.ДлинаНомера-СтрДлина(СокрЛП(Префикс));;
	
	Если МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Год Тогда
		Дата1=НачалоГода(ДокументОбъект.Дата);	
		Дата2=КонецГода(ДокументОбъект.Дата);	
	ИначеЕсли МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Квартал Тогда
		Дата1=НачалоКвартала(ДокументОбъект.Дата);	
		Дата2=КонецКвартала(ДокументОбъект.Дата);					
	ИначеЕсли МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Месяц Тогда
		Дата1=НачалоМесяца(ДокументОбъект.Дата);	
		Дата2=КонецМесяца(ДокументОбъект.Дата);					
	ИначеЕсли МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.День Тогда
		Дата1=НачалоДня(ДокументОбъект.Дата);	
		Дата2=КонецДня(ДокументОбъект.Дата);
	Иначе
		Дата1=Неопределено;		
		Дата2=Неопределено;
	КонецЕсли;
	
	Шаблон=СокрЛП(Префикс);
	Для Сч=1 По ДлинаЧисловойЧасти Цикл
		Шаблон=Шаблон+"[0-9]";	
	КонецЦикла;
	
	//Валетов + 29,08,2025
	Если  МетаДок.Имя = "ПланНабора" И ДеньГода(ТекущаяДата()) > 180 Тогда 
		Префикс = "OD8";
	КонецЕсли;
	//Валетов -
	
	Запрос=Новый Запрос;
	Если  МетаДок.Имя = "СчетФактура" или МетаДок.Имя = "КорректировочныйСчетФактура"  Тогда
		
		Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(СчетФактура.Номер) КАК Номер
		|ИЗ
		|	Документ.СчетФактура КАК СчетФактура
		|ГДЕ
		// |	СчетФактура.Дата МЕЖДУ &Дата1 И &Дата2
		|	"+?(Дата1=Неопределено,"","Дата МЕЖДУ &Дата1 И &Дата2 И ")+"
		|	СчетФактура.Номер ПОДОБНО &Шаблон
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МАКСИМУМ(КорректировочныйСчетФактура.Номер)
		|ИЗ
		|	Документ.КорректировочныйСчетФактура КАК КорректировочныйСчетФактура
		|ГДЕ
		|	"+?(Дата1=Неопределено,"","Дата МЕЖДУ &Дата1 И &Дата2 И ")+"
		|	КорректировочныйСчетФактура.Номер ПОДОБНО &Шаблон
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер УБЫВ";
		
	иначе
		Запрос.Текст="
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(Номер) КАК Номер
		|ИЗ
		|	Документ."+МетаДок.Имя+"
		|ГДЕ
		|	"+?(Дата1=Неопределено,"","Дата МЕЖДУ &Дата1 И &Дата2 И ")+"
		|	Номер ПОДОБНО &Шаблон";
		
	КонецЕсли;
	//нечаева 02,12,16---
	
	Запрос.УстановитьПараметр("Шаблон",Шаблон);
	
	Если Дата1<>Неопределено Тогда
		Запрос.УстановитьПараметр("Дата1",Дата1);
		Запрос.УстановитьПараметр("Дата2",Дата2);
	КонецЕсли;
	
	НомерДока		=Неопределено;
	ПоследнийНомер =0;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.Номер) Тогда
			НомерДока		=Выборка.Номер;
			ПоследнийНомер	=Число(СтрЗаменить(Выборка.Номер,СокрЛП(Префикс),""));
		КонецЕсли;		
	КонецЕсли;	
	
	Коэффициент=1;
	
	Если КоличествоПропусков = 1 Тогда
		КоличествоПропусков = 0;
		ПоследнийДок=Документы[МетаДок.Имя].НайтиПоНомеру(НомерДока,ДокументОбъект.Дата);
		Запрос = Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	ПропускСФ.КоличествоПропусков,
		|	ПропускСФ.Дата,
		|	ПропускСФ.ТипСклада
		|ИЗ
		|	Справочник.ПропускСФ КАК ПропускСФ
		|ГДЕ
		|	(НЕ ПропускСФ.ПометкаУдаления)
		|	И ПропускСФ.ТипСклада = &ТипСклада
		|	И ПропускСФ.Дата МЕЖДУ &Дата1 И &Дата2";
		
		Если Дата1<>Неопределено Тогда
			Если ПоследнийДок <> Документы[МетаДок.Имя].ПустаяСсылка() Тогда
				Запрос.УстановитьПараметр("Дата1",КонецДня(ПоследнийДок.Дата)+1);
			Иначе
				Запрос.УстановитьПараметр("Дата1",КонецДня(НачалоГода(ДокументОбъект.Дата)));
			Конецесли;
			Запрос.УстановитьПараметр("Дата2",КонецДня(ДокументОбъект.Дата));
		КонецЕсли;
		Если Лев(Префикс,2)="КБ" Тогда
			Запрос.УстановитьПараметр("ТипСклада",Перечисления.ТипСклада.КБСтиль);	
		Иначе
			Запрос.УстановитьПараметр("ТипСклада",ДокументОбъект.Склад.ТипСклада);	
		КонецЕсли;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			КоличествоПропусков = Выборка.КоличествоПропусков + КоличествоПропусков ;
		КонецЦикла;
	КонецЕсли;
	
	ДокументОбъект.Номер=СокрЛП(Префикс)+Формат(ПоследнийНомер+1+КоличествоПропусков*Коэффициент,"ЧЦ="+ДлинаЧисловойЧасти+"; ЧВН=");
КонецФункции //УстановитьНормальныйНовыйНомер(ДокументОбъект,Префикс,КоличествоПропусков=0)
// Кухарь А.Ю. 15.12.2021 конец

// ++ Шворобей ВЮ 09.02.2022

// Возвращает структуру, содержащую значения реквизитов прочитанные из информационной базы
// по ссылке на объект.
// 
//  Если доступа к одному из реквизитов нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  Ссылка    - Ссылка на объект - элемент справочника, документ, ...
//
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую, в формате
//              требований к свойствам структуры.
//              Например, "Код, Наименование, Родитель".
//            - Структура, ФиксированнаяСтруктура - в качестве ключа передается
//              псевдоним поля для возвращаемой структуры с результатом, а в качестве
//              значения (опционально) фактическое имя поля в таблице.
//              Если значение не определено, то имя поля берется из ключа.
//            - Массив, ФиксированныйМассив - имена реквизитов в формате требований
//              к свойствам структуры.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
//              Если строка затребованных реквизитов пуста, то возвращается пустая структура
//
Функция ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты) Экспорт
	
	Если ТипЗнч(Реквизиты) = Тип("Строка") Тогда
		Если ПустаяСтрока(Реквизиты) Тогда
			Возврат Новый Структура;
		КонецЕсли;
		
		СтруктураРеквизитов = Новый Структура(Реквизиты);
		
	ИначеЕсли ТипЗнч(Реквизиты) = Тип("Структура")
		ИЛИ ТипЗнч(Реквизиты) = Тип("ФиксированнаяСтруктура") Тогда
		
		СтруктураРеквизитов = Реквизиты;
		
	ИначеЕсли ТипЗнч(Реквизиты) = Тип("Массив")
		ИЛИ ТипЗнч(Реквизиты) = Тип("ФиксированныйМассив") Тогда
		
		СтруктураРеквизитов = Новый Структура;
		Для каждого Реквизит Из Реквизиты Цикл
			СтруктураРеквизитов.Вставить(Реквизит);
		КонецЦикла;
	Иначе
		ВызватьИсключение ОценкаПроизводительностиКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Неверный тип второго параметра Реквизиты: %1'"),
		Строка(ТипЗнч(Реквизиты)));
	КонецЕсли;
	
	ТекстПолей = "";
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		
		ИмяПоля   = ?(ЗначениеЗаполнено(КлючИЗначение.Значение),
		СокрЛП(КлючИЗначение.Значение),
		СокрЛП(КлючИЗначение.Ключ));
		
		Псевдоним = СокрЛП(КлючИЗначение.Ключ);
		
		ТекстПолей  = ТекстПолей + ?(ПустаяСтрока(ТекстПолей), "", ",") + "
		|	" + ИмяПоля + " КАК " + Псевдоним;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|" + ТекстПолей + "
	|ИЗ
	|	" + Ссылка.Метаданные().ПолноеИмя() + " КАК ПсевдонимЗаданнойТаблицы
	|ГДЕ
	|	ПсевдонимЗаданнойТаблицы.Ссылка = &Ссылка
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Результат = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		Результат.Вставить(КлючИЗначение.Ключ);
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение реквизита, прочитанного из информационной базы по ссылке на объект.
// 
//  Если доступа к реквизиту нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  Ссылка       - ссылка на объект, - элемент справочника, документ, ...
//  ИмяРеквизита - Строка, например, "Код".
// 
// Возвращаемое значение:
//  Произвольный    - зависит от типа значения прочитанного реквизита.
// 
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита) Экспорт
	
	Результат = ЗначенияРеквизитовОбъекта(Ссылка, ИмяРеквизита);
	Возврат Результат[ИмяРеквизита];
	
КонецФункции 

// Возвращает структуру, содержащую значения реквизитов, прочитанные из информационной базы
// для нескольких объектов.
// 
//  Если доступа к одному из реквизитов нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  МассивСсылок - массив ссылок на объекты одного типа
//				ВАЖНО! значения массива должны быть ссылками на 
//				объекты одного типа!
//  ИменаРеквизитов - Строка, имена реквизитов перечисленные через запятую,
//				в формате требований к свойствам структуры.
//				Например, "Код, Наименование, Родитель".
// 
// Возвращаемое значение:
//  Соответствие, где ключ - ссылка на объект, а Значение - структура, которая 
//				содержит список свойств, как список имен в строке
//				ИменаРеквизитов, со значениям реквизитов, прочитанными
//				из информационной базы.
// 
Функция ЗначенияРеквизитовОбъектов(МассивСсылок, ИменаРеквизитов) Экспорт
	
	ЗначенияРеквизитов = Новый Соответствие;
	Если ТипЗнч(МассивСсылок) = Тип("Массив") ИЛИ ТипЗнч(МассивСсылок) = Тип("ФиксированныйМассив") Тогда
		Если МассивСсылок.Количество() = 0 Тогда
			Возврат ЗначенияРеквизитов;
		КонецЕсли;
	Иначе
		СообщитьОбОшибке("Неверный тип параметра ""МассивСсылок""");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ссылка КАК Ссылка, " + ИменаРеквизитов + "
	|ИЗ
	|	" + МассивСсылок[0].Метаданные().ПолноеИмя() + " КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка В (&МассивСсылок)";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Новый Структура(ИменаРеквизитов);
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		ЗначенияРеквизитов[Выборка.Ссылка] = Результат;
	КонецЦикла;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

// Возвращает значения реквизита, прочитанного из информационной базы для нескольких объектов.
// 
//  Если доступа к реквизиту нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  МассивСсылок - массив ссылок на объекты одного типа
//				ВАЖНО! значения массива должны быть ссылками на 
//				объекты одного типа!
//  ИмяРеквизита - Строка, например, "Код".
// 
// Возвращаемое значение:
//  Соответствие, где ключ - ссылка на объект, Значение - значение прочитанного реквизита
// 
Функция ЗначениеРеквизитаОбъектов(МассивСсылок, ИмяРеквизита) Экспорт
	
	ЗначенияРеквизитов = ЗначенияРеквизитовОбъектов(МассивСсылок, ИмяРеквизита);
	Для Каждого Элемент Из ЗначенияРеквизитов Цикл
		ЗначенияРеквизитов[Элемент.Ключ] = Элемент.Значение[ИмяРеквизита];
	КонецЦикла;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

// ++ Шворобей ВЮ 09.02.2022

/////////////////// Работа со Свойствами объекта ///////////////////////////////

Функция ПолучитьЗначениеСвойствОбъекта(Объект, НазваниеСвойства) Экспорт
	
	Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию(НазваниеСвойства).Ссылка;
	Если Свойство = Неопределено ИЛИ Свойство.Пустая() Тогда
		Сообщить("Не найдено свойство объекта "+ СокрЛП(НазваниеСвойства));
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект = &Объект
	|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Свойство", Свойство);
	Рез = Запрос.Выполнить();
	Если НЕ Рез.Пустой() Тогда
		Выборка = Рез.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Значение;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ЗаписатьЗначениеСвойстваОбъекта(Объект, НазваниеСвойства, Значение) Экспорт
	
	Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию(НазваниеСвойства).Ссылка;
	Если Свойство = Неопределено ИЛИ Свойство.Пустая() Тогда
		Сообщить("Не найдено свойство объекта "+ СокрЛП(НазваниеСвойства));
		Возврат Ложь;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Объект.Установить(Объект); 
	НаборЗаписей.Отбор.Свойство.Установить(Свойство);	
	
	Если ЗначениеЗаполнено(Значение) Тогда
		
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.Объект = Объект; 
		НоваяЗапись.Свойство = Свойство; 
		НоваяЗапись.Значение = Значение;
		
	Иначе
		
		НаборЗаписей.Прочитать();
		Для Каждого Запись из НаборЗаписей Цикл
			НаборЗаписей.Удалить(Запись);
		КонецЦикла;
		
	КонецЕсли;
	
	Попытка
		НаборЗаписей.Записать();
		Возврат Истина;
	Исключение
		Сообщить("Не могу записать значение свойства: " + ОписаниеОшибки(), СтатусСообщения.Важное);
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Процедура ЗапуститьВнешнююОбработку(ИмяОбработки) Экспорт
	
	Попытка 
		СпрВнешняяОбработка = Справочники.ВнешниеОбработки.НайтиПоНаименованию(ИмяОбработки, Истина);
		Если СпрВнешняяОбработка.Пустая() Тогда
			Сообщить("Не найдена форма " + ИмяОбработки + ".", СтатусСообщения.Внимание);
		Иначе   
			ИмяФайла = ПолучитьИмяВременногоФайла();
			ДвоичныеДанные = СпрВнешняяОбработка.ХранилищеВнешнейОбработки.Получить();
			ДвоичныеДанные.Записать(ИмяФайла);
			Если СпрВнешняяОбработка.ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.Обработка Тогда
				ФормаСпрВнешняяОбработка = ВнешниеОбработки.ПолучитьФорму(ИмяФайла);
			ИначеЕсли СпрВнешняяОбработка.ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.Отчет Тогда
				ФормаСпрВнешняяОбработка = ВнешниеОтчеты.ПолучитьФорму(ИмяФайла);
			КонецЕсли;   
			Если Не ФормаСпрВнешняяОбработка = Неопределено Тогда
				ФормаСпрВнешняяОбработка.Открыть();
			Иначе
				Если СпрВнешняяОбработка.ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.Обработка Тогда
					ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяФайла);
				ИначеЕсли СпрВнешняяОбработка.ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.Отчет Тогда
					ВнешняяОбработка = ВнешниеОтчеты.Создать(ИмяФайла);
				КонецЕсли;   
			КонецЕсли;
			УдалитьФайлы(ИмяФайла);
		КонецЕсли;
	Исключение
		Сообщить("Ошибка открытия формы " + ИмяОбработки + ".", СтатусСообщения.Внимание);
	КонецПопытки;
	
КонецПроцедуры

Функция НайтиОбъектПоЗначениюСвойства(НазваниеСвойства, Значение) Экспорт
	
	Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию(НазваниеСвойства).Ссылка;
	Если Свойство = Неопределено ИЛИ Свойство.Пустая() Тогда
		#Если Клиент Тогда
			Сообщить("Не найдено свойство объекта "+ СокрЛП(НазваниеСвойства));
		#КонецЕсли
		#Если Сервер Тогда
			ЗаписьЖурналаРегистрации("Свойства объектов.", УровеньЖурналаРегистрации.Информация, , , "Не найдено свойство объекта "+ СокрЛП(НазваниеСвойства));
		#КонецЕсли
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗначенияСвойствОбъектов.Объект КАК Объект
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = &Свойство
	|	И ЗначенияСвойствОбъектов.Значение = &Значение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Объект";
	
	Запрос.УстановитьПараметр("Значение", Значение);
	Запрос.УстановитьПараметр("Свойство", Свойство);
	
	Рез = Запрос.Выполнить();
	Если НЕ Рез.Пустой() Тогда
		Выборка = Рез.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Объект;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

/////////////////////////////////////////////////////////////////////////////////

Функция ПолучитьСписокСвойствОбъекта(Объект) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
		Запрос.УстановитьПараметр("НазначениеСвойства", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты);
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.Номенклатура") Тогда
		Запрос.УстановитьПараметр("НазначениеСвойства", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.Организации") Тогда
		Запрос.УстановитьПараметр("НазначениеСвойства", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Организации);
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.Договоры") Тогда
		Запрос.УстановитьПараметр("НазначениеСвойства", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Договоры);
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.Склады") Тогда
		Запрос.УстановитьПараметр("НазначениеСвойства", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Склады);
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.ПунктыДоставки") Тогда
		Запрос.УстановитьПараметр("НазначениеСвойства", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ПунктыДоставки);
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Запрос.УстановитьПараметр("НазначениеСвойства", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ФизическиеЛица);
	Иначе
		СообщитьОбОшибке("Не найдено Назначение Свойства!!!");
		Возврат Ложь;
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СвойстваОбъектов.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектов
	|ГДЕ
	|	НЕ СвойстваОбъектов.ПометкаУдаления
	|	И СвойстваОбъектов.НазначениеСвойства.Ссылка = &НазначениеСвойства
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьСписокКатегорийОбъекта(Объект) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
		Запрос.УстановитьПараметр("НазначениеКатегории", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты);
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.Номенклатура") Тогда
		Запрос.УстановитьПараметр("НазначениеКатегории", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.Организации") Тогда
		Запрос.УстановитьПараметр("НазначениеКатегории", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Организации);
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.Договоры") Тогда
		Запрос.УстановитьПараметр("НазначениеКатегории", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Договоры);
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.Склады") Тогда
		Запрос.УстановитьПараметр("НазначениеКатегории", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Склады);
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.ПунктыДоставки") Тогда
		Запрос.УстановитьПараметр("НазначениеСвойства", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ПунктыДоставки);
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Запрос.УстановитьПараметр("НазначениеКатегории", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ФизическиеЛица);
	Иначе
		СообщитьОбОшибке("Не найдено Назначение Категории!!!");
		Возврат Ложь;
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КатегорииОбъектов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КатегорииОбъектов КАК КатегорииОбъектов
	|ГДЕ
	|	НЕ КатегорииОбъектов.ПометкаУдаления
	|	И КатегорииОбъектов.НазначениеКатегории.Ссылка = &НазначениеКатегории
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура СкопироватьЗначенияСвойствОбъекта(ОбъектИсточник, ОбъектПриемник) Экспорт
	
	СписокСвойств = ПолучитьСписокСвойствОбъекта(ОбъектИсточник);
	Для Каждого ЭлементСписка ИЗ СписокСвойств Цикл
		Значение = ПолучитьЗначениеСвойствОбъекта(ОбъектИсточник, ЭлементСписка.Ссылка.Наименование);
		ЗаписатьЗначениеСвойстваОбъекта(ОбъектПриемник, ЭлементСписка.Ссылка.Наименование, Значение);
	КонецЦикла;
	
КонецПроцедуры

Процедура СкопироватьЗначенияКатегорийОбъекта(ОбъектИсточник, ОбъектПриемник) Экспорт
	
	СписокСвойств = ПолучитьСписокКатегорийОбъекта(ОбъектИсточник);
	Для Каждого ЭлементСписка ИЗ СписокСвойств Цикл
		Значение = ПолучитьЗначениеКатегорииОбъекта(ОбъектИсточник, ЭлементСписка.Ссылка.Наименование);
		ЗаписатьЗначениеКатегорииОбъекта(ОбъектПриемник, ЭлементСписка.Ссылка.Наименование, Значение);
	КонецЦикла;
	
КонецПроцедуры

////////////////// Работа с Категориями объекта /////////////////////////////////

Функция ПолучитьЗначениеКатегорииОбъекта(Объект, НазваниеКатегории) Экспорт
	
	Категория = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КатегорииОбъектов.Ссылка КАК Категория
	|ИЗ
	|	Справочник.КатегорииОбъектов КАК КатегорииОбъектов
	|ГДЕ
	|	КатегорииОбъектов.Наименование = &Наименование
	|	И КатегорииОбъектов.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Наименование", НазваниеКатегории);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Категория = Выборка.Категория;
	КонецЕсли;
	
	Если Категория = Неопределено ИЛИ Категория.Пустая() Тогда
		Сообщить("Не существует Категория объекта "+ СокрЛП(НазваниеКатегории));
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КатегорииОбъектов.Объект
	|ИЗ
	|	РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	|ГДЕ
	|	КатегорииОбъектов.Объект = &Объект
	|	И КатегорииОбъектов.Категория = &Категория";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Категория", Категория);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьЗначениеКатегорииОбъектаПредопределенной(Объект, ИмяКатегории) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КатегорииОбъектов.Объект
	|ИЗ
	|	РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	|ГДЕ
	|	КатегорииОбъектов.Объект = &Объект
	|	И КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов." + ИмяКатегории + ")";
	Запрос.УстановитьПараметр("Объект", Объект);
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

Функция ЗаписатьЗначениеКатегорииОбъекта(Объект, НазваниеКатегории, Значение = Истина) Экспорт
	
	Категория = Справочники.КатегорииОбъектов.НайтиПоНаименованию(СокрЛП(НазваниеКатегории)).Ссылка;
	
	Если Категория = Неопределено ИЛИ Категория.Пустая() Тогда
		Сообщить("Не установлена Категория объекта "+ СокрЛП(НазваниеКатегории));
		Возврат Неопределено;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.КатегорииОбъектов.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Объект.Установить(Объект); 
	НаборЗаписей.Отбор.Категория.Установить(Категория);
	
	Если Значение Тогда
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.Объект = Объект; 
		НоваяЗапись.Категория = Категория; 
	КонецЕсли;
	
	Попытка
		НаборЗаписей.Записать();
		Возврат Истина;
	Исключение
		Сообщить("Не могу записать Категорию: " + ОписаниеОшибки(), СтатусСообщения.Важное);
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

функция ПолучитьОбъектыСУстановленнойКатегорией(НазваниеКатегории) Экспорт
	
	Категория = Справочники.КатегорииОбъектов.НайтиПоНаименованию(СокрЛП(НазваниеКатегории)).Ссылка;
	
	Если Категория = Неопределено ИЛИ Категория.Пустая() Тогда
		Сообщить("Не установлена Категория объекта "+ СокрЛП(НазваниеКатегории));
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КатегорииОбъектов.Объект КАК Объект
	|ИЗ
	|	РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	|ГДЕ
	|	КатегорииОбъектов.Категория = &Категория
	|
	|УПОРЯДОЧИТЬ ПО
	|	Объект";
	
	Запрос.УстановитьПараметр("Категория", Категория);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// ++ Шворобей ВЮ 10.02.2022

//Кухарь А.Ю.  21.05.2022 начало
//Получение таблица деклараций с учётом того, что они могут быть указаны на элемент, а не только на модель
Функция ПолучитьТаблицуДекларацийПоМассивуНоменклатуры (МассивНоменклатуры,Дата) экспорт
	Запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.Родитель КАК Модель,
	|	Номенклатура.Родитель.ТипТовара КАК РодительТипТовара
	|ПОМЕСТИТЬ ТЗНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&СписокНоменклатуры)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(т1.НоменклатураИзДекларацииЭлемент, т1.НоменклатураИзДекларацииГруппа) КАК НоменклатураСертификата,
	|	ЕСТЬNULL(т1.СертификатЭлемент, т1.СертификатГруппа) КАК Сертификат,
	|	т1.ТипТовара КАК ТипТовара,
	|	ЕСТЬNULL(т1.НоменклатураНачальнаяЭлемент, т1.НоменклатураНачальнаяГруппа) КАК НоменклатураНачальная,
	|	МАКСИМУМ(т1.ПризнакДекларацииНаЭлемент) КАК ПризнакДекларацииНаЭлемент,
	|	ЕСТЬNULL(т1.ПериодЭлементы, т1.ПериодГруппы) КАК ПериодСертификата
	|ПОМЕСТИТЬ ТЗДекларацийСдублями
	|ИЗ
	|	(ВЫБРАТЬ
	|		ИсторияСрезПоследних.Значение КАК СертификатЭлемент,
	|		ИсторияСрезПоследних.Объект КАК НоменклатураИзДекларацииЭлемент,
	|		NULL КАК НоменклатураИзДекларацииГруппа,
	|		ТЗНоменклатуры.РодительТипТовара КАК ТипТовара,
	|		NULL КАК СертификатГруппа,
	|		ТЗНоменклатуры.Номенклатура КАК НоменклатураНачальнаяЭлемент,
	|		NULL КАК НоменклатураНачальнаяГруппа,
	|		ИСТИНА КАК ПризнакДекларацииНаЭлемент,
	|		ИсторияСрезПоследних.Период КАК ПериодЭлементы,
	|		NULL КАК ПериодГруппы
	|	ИЗ
	|		ТЗНоменклатуры КАК ТЗНоменклатуры
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.История.СрезПоследних(&Дата2, Реквизит = ""Декларация"") КАК ИсторияСрезПоследних
	|			ПО ТЗНоменклатуры.Номенклатура = ИсторияСрезПоследних.Объект
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		NULL,
	|		NULL,
	|		ИсторияСрезПоследних.Объект,
	|		ТЗНоменклатуры.РодительТипТовара,
	|		ИсторияСрезПоследних.Значение,
	|		ТЗНоменклатуры.Номенклатура,
	|		ТЗНоменклатуры.Номенклатура,
	|		ЛОЖЬ,
	|		NULL,
	|		ИсторияСрезПоследних.Период
	|	ИЗ
	|		ТЗНоменклатуры КАК ТЗНоменклатуры
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.История.СрезПоследних(&Дата2, Реквизит = ""Декларация"") КАК ИсторияСрезПоследних
	|			ПО ТЗНоменклатуры.Модель = ИсторияСрезПоследних.Объект) КАК т1
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(т1.НоменклатураИзДекларацииЭлемент, т1.НоменклатураИзДекларацииГруппа),
	|	ЕСТЬNULL(т1.СертификатЭлемент, т1.СертификатГруппа),
	|	т1.ТипТовара,
	|	ЕСТЬNULL(т1.НоменклатураНачальнаяЭлемент, т1.НоменклатураНачальнаяГруппа),
	|	ЕСТЬNULL(т1.ПериодЭлементы, т1.ПериодГруппы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗДекларацийСдублями.НоменклатураСертификата КАК НоменклатураСертификата,
	|	ТЗДекларацийСдублями.НоменклатураНачальная КАК НоменклатураНачальная,
	|	МАКСИМУМ(ТЗДекларацийСдублями.ПериодСертификата) КАК ПериодСертификата,
	|	ТЗДекларацийСдублями.ПризнакДекларацииНаЭлемент КАК ПризнакДекларацииНаЭлемент
	|ПОМЕСТИТЬ МаксимумыДатСертификатов
	|ИЗ
	|	ТЗДекларацийСдублями КАК ТЗДекларацийСдублями
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЗДекларацийСдублями.НоменклатураСертификата,
	|	ТЗДекларацийСдублями.НоменклатураНачальная,
	|	ТЗДекларацийСдублями.ПризнакДекларацииНаЭлемент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимумыДатСертификатов.НоменклатураСертификата КАК НоменклатураСертификата,
	|	МаксимумыДатСертификатов.НоменклатураНачальная КАК НоменклатураНачальная,
	|	МаксимумыДатСертификатов.ПериодСертификата КАК ПериодСертификата,
	|	МаксимумыДатСертификатов.ПризнакДекларацииНаЭлемент КАК ПризнакДекларацииНаЭлемент,
	|	ТЗДекларацийСдублями.Сертификат КАК Сертификат,
	|	ТЗДекларацийСдублями.ТипТовара КАК ТипТовара
	|ПОМЕСТИТЬ ТЗДекларацийСдублямиСрез
	|ИЗ
	|	МаксимумыДатСертификатов КАК МаксимумыДатСертификатов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТЗДекларацийСдублями КАК ТЗДекларацийСдублями
	|		ПО МаксимумыДатСертификатов.НоменклатураСертификата = ТЗДекларацийСдублями.НоменклатураСертификата
	|			И МаксимумыДатСертификатов.НоменклатураНачальная = ТЗДекларацийСдублями.НоменклатураНачальная
	|			И МаксимумыДатСертификатов.ПериодСертификата = ТЗДекларацийСдублями.ПериодСертификата
	|			И МаксимумыДатСертификатов.ПризнакДекларацииНаЭлемент = ТЗДекларацийСдублями.ПризнакДекларацииНаЭлемент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗДекларацийСдублямиСрез.НоменклатураНачальная КАК НоменклатураНачальная,
	|	МАКСИМУМ(ТЗДекларацийСдублямиСрез.ПризнакДекларацииНаЭлемент) КАК ПризнакДекларацииНаЭлемент
	|ПОМЕСТИТЬ ТаблицаДляУдаленияДублей
	|ИЗ
	|	ТЗДекларацийСдублямиСрез КАК ТЗДекларацийСдублямиСрез
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЗДекларацийСдублямиСрез.НоменклатураНачальная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДляУдаленияДублей.НоменклатураНачальная КАК НоменклатураНачальная,
	|	ТЗДекларацийСдублямиСрез.ТипТовара КАК ТипТовара,
	|	ТаблицаДляУдаленияДублей.ПризнакДекларацииНаЭлемент КАК ПризнакДекларацииНаЭлемент,
	|	ТЗДекларацийСдублямиСрез.НоменклатураСертификата КАК НоменклатураСертификата,
	|	ТЗДекларацийСдублямиСрез.Сертификат КАК Декларация,
	|	ВЫБОР
	|		КОГДА ТЗДекларацийСдублямиСрез.Сертификат ССЫЛКА Справочник.Декларация
	|			ТОГДА ВЫРАЗИТЬ(ТЗДекларацийСдублямиСрез.Сертификат КАК Справочник.Декларация).ДатаНачала
	|		ИНАЧЕ &ПустаяДата
	|	КОНЕЦ КАК ДатаНачала,
	|	ВЫБОР
	|		КОГДА ТЗДекларацийСдублямиСрез.Сертификат ССЫЛКА Справочник.Декларация
	|			ТОГДА ВЫРАЗИТЬ(ТЗДекларацийСдублямиСрез.Сертификат КАК Справочник.Декларация).ДатаОкончания
	|		ИНАЧЕ &ПустаяДата
	|	КОНЕЦ КАК ДатаОкончания,
	|	ВЫБОР
	|		КОГДА ТЗДекларацийСдублямиСрез.Сертификат ССЫЛКА Справочник.Декларация
	|			ТОГДА ВЫРАЗИТЬ(ТЗДекларацийСдублямиСрез.Сертификат КАК Справочник.Декларация).ВидДокумента
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ВидДокумента,
	|	ВЫБОР
	|		КОГДА ТЗДекларацийСдублямиСрез.Сертификат ССЫЛКА Справочник.Декларация
	|			ТОГДА ВЫРАЗИТЬ(ТЗДекларацийСдублямиСрез.Сертификат КАК Справочник.Декларация).Орган
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Орган,
	|	ВЫБОР
	|		КОГДА ТЗДекларацийСдублямиСрез.Сертификат ССЫЛКА Справочник.Декларация
	|			ТОГДА ВЫРАЗИТЬ(ТЗДекларацийСдублямиСрез.Сертификат КАК Справочник.Декларация).Наименование
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Номер,
	|	ВЫБОР
	|		КОГДА ТЗДекларацийСдублямиСрез.Сертификат ССЫЛКА Справочник.Декларация
	|			ТОГДА ВЫРАЗИТЬ(ТЗДекларацийСдублямиСрез.Сертификат КАК Справочник.Декларация).Изготовитель
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Изготовитель
	|ИЗ
	|	ТаблицаДляУдаленияДублей КАК ТаблицаДляУдаленияДублей
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТЗДекларацийСдублямиСрез КАК ТЗДекларацийСдублямиСрез
	|		ПО ТаблицаДляУдаленияДублей.НоменклатураНачальная = ТЗДекларацийСдублямиСрез.НоменклатураНачальная
	|			И ТаблицаДляУдаленияДублей.ПризнакДекларацииНаЭлемент = ТЗДекларацийСдублямиСрез.ПризнакДекларацииНаЭлемент";
	запрос.УстановитьПараметр("СписокНоменклатуры",МассивНоменклатуры);
	запрос.УстановитьПараметр("Дата2",Дата);
	запрос.УстановитьПараметр("ПустаяДата",ПустаяДата());
	
	возврат запрос.Выполнить().Выгрузить();
	
КонецФункции
//Кухарь А.Ю.  21.05.2022 конец

Функция ПолучитьДанныеЛистаНабораПоДаннымЭтикеткиФБС (ШКЭтикетки,Контрагент) Экспорт
	
	// Шворобей ВЮ 21.11.2023 ++
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата",Константы.ДатаЗапретаРедактирования.Получить());
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("ШКЭтикетки", СокрЛП(ШКЭтикетки));
	
	МассивСтрокОтбора = Новый Массив();
	МассивСтрокОтбора.Добавить("Штрихкод");         // Озон и Вайлдберриз
	МассивСтрокОтбора.Добавить("ПрефиксЗаказа");    // СберМегаМаркет
	МассивСтрокОтбора.Добавить("НомерЗаказа");      // Яндекс
	
	Для Каждого СтрокаОтбора ИЗ МассивСтрокОтбора Цикл
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЛистПереукладки.Ссылка КАК ЛистПереукладки,
		|	ЛистПереукладки.ЛистНабора КАК ЛистНабора, 
		//Валетов + 02,09,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-6861 Ошибка. Было:
		//  |	ЛистПереукладки.ЛистНабора.Дата КАК ЛистНабора,	
		|	ЛистПереукладки.ЛистНабора.Дата КАК ЛистНабораДата,
		//Валетов -		
		|	ЛистПереукладки.ДокОснование КАК Документ,
		|	ЛистПереукладки.НомерЗаказа КАК НомерЗаказа,
		|	ЛистПереукладки.ЛистНабора.КоличествоДокумента КАК Количество,
		|	ЛистПереукладки.ДокОснование.ДатаОтгрузки КАК ДатаОтгрузки
		|ИЗ
		|	Документ.ЛистПереукладки КАК ЛистПереукладки
		|ГДЕ
		|	ЛистПереукладки.Дата > &Дата
		|	И ЛистПереукладки.Проведен
		|	И ЛистПереукладки.ДокОснование.Контрагент = &Контрагент
		|	И ЛистПереукладки." + СтрокаОтбора + "  = &ШКЭтикетки";
		
		Результат = Запрос.Выполнить().Выгрузить();
		Если Результат.Количество() > 0 Тогда
			Для каждого СтрТЗ из Результат цикл
				Возврат СтрТЗ;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	// Шворобей ВЮ 21.11.2023 ++
	
КонецФункции

Функция ПолучитьНоменклатураПоНомеруЗаказаФБС (НомерЗаказа) экспорт
	
КонецФункции

//Михайловский С. 20220712 -оповещения настраиваемыми делаем+++
Функция СформСписокПолучат(ТипРассылки, ОбъектРассылки = Неопределено, ФлагРассылки = "РассылкиЭлПочта") Экспорт
	
	СписокПолучат = Новый СписокЗначений;
	
	// Кухарь А.Ю. 05.08.2024 начало
	// ДУ=?(ЗначениеЗаполнено(ОбъектРассылки)," И РассылкиЭлПочтаПолучателиУведомлений.Ссылка.ОбъектРассылки = &ОбъектРассылки ","");
	ДУ=?(ЗначениеЗаполнено(ОбъектРассылки)," И Рассылки.Ссылка.ОбъектРассылки = &ОбъектРассылки ","");	 
	// Кухарь А.Ю. 05.08.2024 конец
	
	
	Запрос = Новый Запрос;
	
	Если ФлагРассылки = "ФизЛицаРазрешениеОтгрузки" Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ФизическиеЛица.Ссылка КАК Сотрудник,
		|	ФизическиеЛица.ЕМэйл КАК СотрудникЕМэйл
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.РазрешениеОтгрузки
		|АВТОУПОРЯДОЧИВАНИЕ
		|";
		
	ИначеЕсли ФлагРассылки = "РассылкиЭлПочта" Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Рассылки.Сотрудник.ЕМэйл КАК СотрудникЕМэйл
		|ИЗ
		|	Справочник.РассылкиЭлПочта.ПолучателиУведомлений КАК Рассылки
		|ГДЕ
		|	Рассылки.Ссылка.ТипРассылки = &ТипРассылки
		|	"+ДУ+"
		|";
		
		Запрос.УстановитьПараметр("ТипРассылки",ТипРассылки);
		
		Если ЗначениеЗаполнено(ОбъектРассылки) Тогда
			Запрос.УстановитьПараметр("ОбъектРассылки",ОбъектРассылки);
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Выб = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выб.Следующий() Цикл
		Мыло = Выб.СотрудникЕМэйл;
		Если ЗначениеЗаполнено(Мыло) Тогда
			СписокПолучат.Добавить(Мыло);
		КонецЕсли;	
	КонецЦикла;
	
	Возврат СписокПолучат;
	
КонецФункции
//Михайловский С. 20220712 -оповещения настраиваемыми делаем---

//Михайловский С. 20221006 -qr+++
Функция ПодключитьКомпонентуИзМакета(Идентификатор, ПолноеИмяМакета) Экспорт
	
	ПодключаемыйМодуль = Неопределено;
	
	Если Не МакетСуществует(ПолноеИмяМакета) Тогда 
		ВызватьИсключение ОценкаПроизводительностиКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Не удалось подключить внешнюю компоненту ""%1"" на сервере
		|из %2
		|по причине:
		|Подключение на сервере не из макета запрещено'"),
		Идентификатор,
		ПолноеИмяМакета);
	КонецЕсли;
	
	Местоположение = ПолноеИмяМакета;
	СимволическоеИмя = Идентификатор + "SymbolicName";
	
	//Если ПодключитьВнешнююКомпоненту(Местоположение, СимволическоеИмя) Тогда
	Если ПодключитьВнешнююКомпоненту(Местоположение, СимволическоеИмя, , ТипПодключенияВнешнейКомпоненты.НеИзолированно) Тогда
		
		Попытка
			ПодключаемыйМодуль = Новый("AddIn." + СимволическоеИмя + "." + Идентификатор);
			Если ПодключаемыйМодуль = Неопределено Тогда 
				ВызватьИсключение НСтр("ru = 'Оператор Новый вернул Неопределено'");
			КонецЕсли;
		Исключение
			ПодключаемыйМодуль = Неопределено;
			//ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		
		Если ПодключаемыйМодуль = Неопределено Тогда
			
			ТекстОшибки = ОценкаПроизводительностиКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось создать объект внешней компоненты ""%1"", подключенной на сервере
			|из макета ""%2"",
			|по причине:
			|%3'"),
			Идентификатор,
			Местоположение,
			ТекстОшибки);
			
			//ЗаписьЖурналаРегистрации(
			//	НСтр("ru = 'Подключение внешней компоненты на сервере'",
			//		КодОсновногоЯзыка()),
			//	УровеньЖурналаРегистрации.Ошибка,,,
			//	ТекстОшибки);
			
		КонецЕсли;
		
	Иначе
		
		ТекстОшибки = ОценкаПроизводительностиКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Не удалось подключить внешнюю компоненту ""%1"" на сервере
		|из макета ""%2""
		|по причине:
		|Метод ПодключитьВнешнююКомпоненту вернул Ложь.'"),
		Идентификатор,
		Местоположение);
		//
		//ЗаписьЖурналаРегистрации(
		//	НСтр("ru = 'Подключение внешней компоненты на сервере'",
		//		КодОсновногоЯзыка()),
		//	УровеньЖурналаРегистрации.Ошибка,,,
		//	ТекстОшибки);
		
	КонецЕсли;
	
	Возврат ПодключаемыйМодуль;
	
КонецФункции

Функция МакетСуществует(ПолноеИмяМакета)
	
	Макет = Метаданные.НайтиПоПолномуИмени(ПолноеИмяМакета);
	Если ТипЗнч(Макет) = Тип("ОбъектМетаданных") Тогда 
		
		Шаблон = Новый Структура("ТипМакета");
		ЗаполнитьЗначенияСвойств(Шаблон, Макет);
		ТипМакета = Неопределено;
		Если Шаблон.Свойство("ТипМакета", ТипМакета) Тогда 
			Возврат ТипМакета <> Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция КомпонентаФормированияQRКода() Экспорт
	
	ТекстОшибки = НСтр("ru = 'Не удалось подключить внешнюю компоненту для генерации QR-кода. Подробности в журнале регистрации.'");
	
	QRCodeGenerator = ПодключитьКомпонентуИзМакета("QRCodeExtension", "ОбщийМакет.КомпонентаПечатиQRКода");
	Если QRCodeGenerator = Неопределено Тогда 
		Сообщить(ТекстОшибки);
	КонецЕсли;
	
	Возврат QRCodeGenerator;
	
КонецФункции

//Михайловский С. 20221006 -qr---

// Кухарь А.Ю.  26.01.2023 начало
//
Процедура УстановитьПунктДоставкиКлиентСервер(ДокументОбъект,ИмяРеквизитаКонтрагент="Контрагент",ИмяРеквизитаПД="ПунктДоставки") Экспорт	
	Контрагент		=ДокументОбъект[ИмяРеквизитаКонтрагент];
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Если ЕстьРеквизитДокумента("ОсновнойПунктДоставки",Контрагент.Метаданные()) И ЗначениеЗаполнено(Контрагент.ОсновнойПунктДоставки) Тогда
			ДокументОбъект[ИмяРеквизитаПД]=Контрагент.ОсновнойПунктДоставки;	
		ИначеЕсли КоличествоПДКлиентСервер(Контрагент)=1 Тогда		
			Выборка=Справочники.ПунктыДоставки.Выбрать(,Контрагент);
			Пока Выборка.Следующий() Цикл
				ДокументОбъект[ИмяРеквизитаПД]=Выборка.Ссылка;			
			КонецЦикла;
		ИначеЕсли ИмяРеквизитаКонтрагент = "СкладПолучатель" Тогда
			Выборка=Справочники.ПунктыДоставки.Выбрать(,Контрагент,,"Наименование Убыв");
			Пока Выборка.Следующий() Цикл
				ДокументОбъект[ИмяРеквизитаПД]=Выборка.Ссылка;			
			КонецЦикла;
		Иначе
			ДокументОбъект[ИмяРеквизитаПД]=Неопределено;		
		КонецЕсли;		
	Иначе
		ДокументОбъект[ИмяРеквизитаПД]=Неопределено;		
	КонецЕсли;	
КонецПроцедуры 


Процедура УстановитьДоговорКлиентСервер (ДокументОбъект,ИмяРеквизитаКонтрагент="Контрагент",ИмяРеквизитаДоговор="Договор") Экспорт
	Контрагент	=ДокументОбъект[ИмяРеквизитаКонтрагент];
	Договор		=ДокументОбъект[ИмяРеквизитаДоговор];
	Организация	=ДокументОбъект.Организация;
	
	КодЦБ=?(ПустаяСтрока(Контрагент.КодЦБ),Контрагент.Код,Контрагент.КодЦБ);
	
	
	ДокументОбъект[ИмяРеквизитаДоговор]=Неопределено;
	Если Контрагент.Пустая() Тогда Возврат КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Контрагент.ОсновнойДоговор) Тогда
		Договора=ПолучитьДоговорыКонтрагентаКлиентСервер(Контрагент,Организация);
	Иначе
		Договора=Новый Массив;	
		Договора.Добавить(Контрагент.ОсновнойДоговор);
	КонецЕсли;	
	
	Если Договора.ВГраница()=0 Тогда
		ДокументОбъект[ИмяРеквизитаДоговор]=Договора[0];
	КонецЕсли;
	
КонецПроцедуры  

Процедура УстановитьОтсрочкуПлатежаКлиентСервер (ДокументОбъект) экспорт
	Если ДокументОбъект.Контрагент.Ведущий.ТолькоПредоплата Тогда
		ДокументОбъект.ОтсрочкаПлатежа = Справочники.ОтсрочкиПлатежа.НайтиПоКоду("1");				
	ИначеЕсли ЗначениеЗаполнено(ДокументОбъект.Договор.ОтсрочкаПлатежа) тогда  
		ДокументОбъект.ОтсрочкаПлатежа = ДокументОбъект.Договор.ОтсрочкаПлатежа;
	ИначеЕсли ЗначениеЗаполнено(ДокументОбъект.ПунктДоставки.ОтсрочкаПлатежа) тогда
		ДокументОбъект.ОтсрочкаПлатежа = ДокументОбъект.ПунктДоставки.ОтсрочкаПлатежа;
	КонецЕсли;	
КонецПроцедуры

Функция ПолучитьДоговорыКонтрагентаКлиентСервер(Контрагент,Организация=Неопределено)
	МассивДоговоров=Новый Массив;
	
	КодЦБ=?(ПустаяСтрока(Контрагент.КодЦБ),Контрагент.Код,Контрагент.КодЦБ);
	
	Выборка=Справочники.Договоры.Выбрать(,,Новый Структура("КодЦБ",КодЦБ));
	Пока Выборка.Следующий() Цикл
		//Если задана организация то договора с другой организацией пропускаем
		//	Если Организация<>Неопределено И НЕ Организация.Пустая() И Выборка.Организация<>Организация Тогда Продолжить КонецЕсли; 	
		
		
		МассивДоговоров.Добавить(Выборка.Ссылка);
	КонецЦикла; 
	
	Возврат МассивДоговоров;
КонецФункции


Функция КоличествоПДКлиентСервер(Контрагент) Экспорт
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПунктыДоставки.Ссылка) КАК Количество
		|ИЗ
		|	Справочник.ПунктыДоставки КАК ПунктыДоставки
		|ГДЕ
		|	ПунктыДоставки.Владелец = &Владелец
		|	И не ПунктыДоставки.ПометкаУдаления ";
		
		Запрос.УстановитьПараметр("Владелец",Контрагент);
		
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Количество;			
		КонецЕсли;		
	КонецЕсли;
	
	Возврат 0;
КонецФункции

Процедура ПунктДоставки_ПриИзмененииКлиентСервер(ДокументОбъект) экспорт
	ТипДокумента=ДокументОбъект.метаданные().имя;
	
	ПунктДоставки=ДокументОбъект.ПунктДоставки;
	НаборПолей=новый Структура("ТипДоставки,АдресПерегруза,Менеджер,РайонДоставки,Регион,Договор,ТранспортнаяКомпания,ПунктПерегруза,
	|Грузополучатель,Получатель,КодПоставщика,КодОперации,СкладКомиссия,ОтсрочкаПлатежа,ТипЦен,ТипСкидок,Скидка,НулеваяСтавкаНДС,
	|Контрагент");
	ЗаполнитьЗначенияСвойств(НаборПолей,ДокументОбъект);
	
	
	
	НаборПолей.ТипДоставки=ПунктДоставки.ТипДоставки;
	
	если ПунктДоставки.ТипДоставки=Перечисления.ТипыДоставки.Перегруз или ПунктДоставки.ТипДоставки=Перечисления.ТипыДоставки.Самовывоз тогда
		НаборПолей.АдресПерегруза=ПунктДоставки.АдресАнтор;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПунктДоставки.Менеджер)  Тогда
		Если ПараметрыСеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			НаборПолей.Менеджер=ПунктДоставки.Менеджер;	
		Конецесли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПунктДоставки.Договор)  Тогда
		Договор=ПунктДоставки.Договор;
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(ПунктДоставки.РайонДоставки) Тогда
		НаборПолей.РайонДоставки=ПунктДоставки.РайонДоставки;			
	КонецЕсли;	
	Если ЗначениеЗаполнено(ПунктДоставки.Регион) Тогда
		НаборПолей.Регион=ПунктДоставки.Регион;			
	КонецЕсли;	
	
	
	если ПунктДоставки.ТипДоставки=Перечисления.ТипыДоставки.ТранспортнаяКомпания тогда
		Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
			НаборПолей.ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
		иначе
			НаборПолей.ТранспортнаяКомпания=Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;	
		Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
			НаборПолей.ПунктПерегруза=ПунктДоставки.ПунктПерегруза;
		иначе
			НаборПолей.ПунктПерегруза=Справочники.ПунктыДоставки.ПустаяСсылка();
		КонецЕсли;	
	иначе
		НаборПолей.ТранспортнаяКомпания=Справочники.Контрагенты.ПустаяСсылка();	
		НаборПолей.ПунктПерегруза=Справочники.ПунктыДоставки.ПустаяСсылка();
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(ПунктДоставки.Грузополучатель) Тогда
		НаборПолей.Грузополучатель=ПунктДоставки.Грузополучатель;		
	КонецЕсли;
	Если ЗначениеЗаполнено(ПунктДоставки.Получатель) Тогда
		НаборПолей.Получатель=ПунктДоставки.Получатель;		
	КонецЕсли;
	
	если ТипДокумента="РасходнаяНакладная" тогда
		ДокументОбъект.ДопОбработки.Очистить();
		Если ПунктДоставки.ВидыДопОбработок.Количество() = 0 Тогда
			Для Каждого СтрокаТЧ Из ДокументОбъект.Контрагент.ВидыДопОбработок Цикл
				СтрокаДО=ДокументОбъект.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
			КонецЦикла;
		Иначе
			Для Каждого СтрокаТЧ Из ПунктДоставки.ВидыДопОбработок Цикл
				СтрокаДО=ДокументОбъект.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
			КонецЦикла;		
		КонецЕсли;
		
		Если ПунктДоставки.НулеваяСтавкаНДС или НаборПолей.Контрагент.НулеваяСтавкаНДС Тогда
			НаборПолей.НулеваяСтавкаНДС = Истина;	
		ИначеЕсли НаборПолей.НулеваяСтавкаНДС Тогда
			НаборПолей.НулеваяСтавкаНДС = Ложь;
		КонецЕсли;
		
		
	КонецЕсли;
	
	КодПоставщикаПунктаДоставки=ПунктДоставки.КодПоставщика;
	Если НЕ КодПоставщикаПунктаДоставки.Пустая() И НаборПолей.КодПоставщика<>КодПоставщикаПунктаДоставки Тогда
		НаборПолей.КодПоставщика=КодПоставщикаПунктаДоставки;
	КонецЕсли; 
	
	
	
	Если ЗначениеЗаполнено(ПунктДоставки.СкладКомиссия) Тогда
		НаборПолей.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия;
		НаборПолей.СкладКомиссия = ПунктДоставки.СкладКомиссия;
	Иначе
		Если НаборПолей.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия Тогда
			НаборПолей.КодОперации = Перечисления.КодыОперацийОстатки.Реализация;
			НаборПолей.СкладКомиссия = Справочники.Склады.ПустаяСсылка();
		КонецЕсли;	
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(ПунктДоставки.ОтсрочкаПлатежа) Тогда
		НаборПолей.ОтсрочкаПлатежа=ПунктДоставки.ОтсрочкаПлатежа;		
	КонецЕсли;
	
	//типы цен скидки
	Если ЗначениеЗаполнено(ПунктДоставки.ТипЦен) И НаборПолей.ТипЦен<>ПунктДоставки.ТипЦен Тогда
		НаборПолей.ТипЦен=ПунктДоставки.ТипЦен;		
	КонецЕсли; 
	Если ЗначениеЗаполнено(ПунктДоставки.ТипСкидок) И НаборПолей.ТипСкидок<>ПунктДоставки.ТипСкидок Тогда
		НаборПолей.ТипСкидок=ПунктДоставки.ТипСкидок;		
	КонецЕсли;
	Если ПунктДоставки.Скидка<>0 И ПунктДоставки.Скидка<>НаборПолей.Скидка Тогда
		НаборПолей.Скидка=ПунктДоставки.Скидка;		
	КонецЕсли;
	
	
	
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект,НаборПолей);
КонецПроцедуры
// Кухарь А.Ю.  26.01.2023 конец


// Кухарь А.Ю. 01.03.2023 начало
//
Функция ПолучитьРодителяВерхнегоУровня (Номенклатура) экспорт
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура
	|ИТОГИ ПО
	|	Ссылка ИЕРАРХИЯ";
	запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	результат=запрос.Выполнить().выгрузить();
	если результат.Количество()< 1 тогда
		возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	возврат результат.Получить(0).Номенклатура;
	
КонецФункции
// Кухарь А.Ю. 01.03.2023 конец

//Михайловский 20230323 компенсация +++
Функция ПолучитьЗначРеквСпр(ЭлемСпр,ИмяРекв) Экспорт 
	Запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	|	РеквизитыСправочников.Справочник КАК Справочник,
	|	РеквизитыСправочников.ИмяРеквизита КАК ИмяРеквизита,
	|	РеквизитыСправочников.ЗначениеРеквизита КАК ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
	|ГДЕ
	|	РеквизитыСправочников.ИмяРеквизита = &ИмяРеквизита
	|	И РеквизитыСправочников.Справочник = &Справочник";
	Запрос.УстановитьПараметр("Справочник",ЭлемСпр);
	Запрос.УстановитьПараметр("ИмяРеквизита",ИмяРекв);
	Выборка = запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЗначениеРеквизита;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Процедура УстановитьЗначРеквСпр(ЭлемСпр,ИмяРекв,ЗначРекв) Экспорт  
	МенЗап=РегистрыСведений.РеквизитыСправочников.СоздатьМенеджерЗаписи();
	МенЗап.Справочник=ЭлемСпр;
	МенЗап.ИмяРеквизита=ИмяРекв;
	Если НЕ ЗначениеЗаполнено(ЗначРекв) Тогда
		Попытка МенЗап.Удалить(); Исключение КонецПопытки;
	Иначе
		Попытка
			МенЗап.ЗначениеРеквизита=ЗначРекв;
			МенЗап.Записать();
		Исключение
		КонецПопытки;	
	КонецЕсли;	
КонецПроцедуры
//Михайловский 20230323 компенсация ---

//++Данилова Е.В. 14.02.2025 HELP-2851
Функция ПолучитьСправочникРеквизитыПоЗначению(ИмяРеквизита,ЗначРеквизита) Экспорт
	
	Запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	|	РеквизитыСправочников.Справочник КАК Справочник,
	|	РеквизитыСправочников.ИмяРеквизита КАК ИмяРеквизита,
	|	РеквизитыСправочников.ЗначениеРеквизита КАК ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
	|ГДЕ
	|	РеквизитыСправочников.ИмяРеквизита = &ИмяРеквизита
	|	И РеквизитыСправочников.ЗначениеРеквизита = &ЗначениеРеквизита";
	Запрос.УстановитьПараметр("ЗначениеРеквизита",ЗначРеквизита);
	Запрос.УстановитьПараметр("ИмяРеквизита",ИмяРеквизита);
	Выборка = запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Справочник;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	
КонецФункции // ()

//--Данилова Е.В. 14.02.2025


#Область Выгрузкаb2b
//нечаева 21,09,22++
Процедура СкопироватьВ_архив2(ДопИмя="",Имяфайла)Экспорт
	
	ИмяФайла = ""+Год(ТекущаяДата())+"_"+месяц(ТекущаяДата())+"_"+День(ТекущаяДата())+"_"+Час(ТекущаяДата())+"_"+минута(ТекущаяДата());
	НовыйАрхив = Новый ЗаписьZipФайла(
	"\\srvfiles\b2b_files\"+ДопИмя+ИмяФайла+".zip",
	"", 
	"архив изменений данных для б2б товары", // комментарий к архиву
	МетодСжатияZIP.Сжатие, 
	УровеньСжатияZIP.Оптимальный,
	МетодШифрованияZIP.Zip20
	);
	
	
	//НовыйАрхив.Добавить(
	//    "c:\readme.txt" // указываем полный путь к файлу
	//);
	
	
	// А что если в "c:\work" находится другая папка, в которой
	// в свою очередь тоже есть txt файлы. Чтобы обработать
	// и эти файлы наш предыдущий пример следует изменить вот так:    
	
	НовыйАрхив.Добавить(
	// мКаталогНаДиске+"\*.xml", // указываем маску к файлам
	ИмяФайла,
	РежимСохраненияПутейZIP.СохранятьОтносительныеПути,
	РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно
	);
	
	НовыйАрхив.Записать();
	
	
	
конецПроцедуры
//нечаева 21,09,22--

// Кухарь А.Ю.  14.04.2023 начало
//
Функция СформироватьJsonB2b (Тело="")  экспорт
	// пример Андрея
	//если не ЗначениеЗаполнено(Тело) тогда  //Тест GEY
	//	СтруктураОтвета=новый Структура ("Messages,Result");
	//	//СтруктураОтвета="123321";
	//	МассивСообщений=новый Массив;
	//	МассивСообщений.Добавить(новый Структура("Контрагент,Результат","SNL-01",Истина));
	//	МассивСообщений.Добавить(новый Структура("Контрагент,Результат","SNL-02",Ложь));
	//	//
	//	СтруктураОтвета.Result = "Обработано 1 контрагент из 2";
	//	СтруктураОтвета.Messages=МассивСообщений;
	//	
	//	записьJSON = новый ЗаписьJSON;
	//	ЗаписьJSON.УстановитьСтроку();
	//	//
	//	ЗаписатьJSON(записьJSON,СтруктураОтвета);
	//	возврат ЗаписьJSON.Закрыть();   
	//	//если в массив что-то несъедобное будет, ссылочные там типы или ещё что-то, то при обращения запросу вернёт "Ошибку инициализации модуля"
	//иначе  //Тест Post
	//	
	//	СтруктураОтвета=новый Структура ("Result");
	//	СтруктураОтвета.Result = "Result"+Тело;	
	//	записьJSON = новый ЗаписьJSON;
	//	ЗаписьJSON.УстановитьСтроку();
	//	ЗаписатьJSON(записьJSON,СтруктураОтвета);
	//	возврат ЗаписьJSON.Закрыть();   
	//	
	//КонецЕсли;
	
	//------------------------------------------------------------------------------------------------
	// нечаева 26,04,23+++   тело - это строка
	
	
	
	
	
	//нечаева 11,01,23 ++
	// запишем в лог?	
	ИмяФайла = ""+Год(ТекущаяДата())+"_"+месяц(ТекущаяДата())+"_"+День(ТекущаяДата())+"_"+Час(ТекущаяДата())+"_"+минута(ТекущаяДата());
	ИмяФайлаОбмена =  "\\srvfiles\b2b_files\sale-new_b2b\"+ИмяФайла+".txt";
	
	Дописывать    = Истина;
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайлаОбмена, КодировкаТекста.UTF8, , Дописывать);
	ТекстСообщений     = ""+Тело;
	ЗаписьТекста.ЗаписатьСтроку(ТекстСообщений);
	ЗаписьТекста.Закрыть();
	
	//СкопироватьВ_архив("sale-new_b2b\",ИмяФайла); 
	//нечаева 11,01,23 -- 
	
	
	
	//--------------------------------------------------------
	СтрДата = Новый Структура;	
	
	СтруктураОтвета=новый Структура();
	СтруктураОтвета.Вставить("result","OK");
	СтруктураОтвета.Вставить("message","OK");
	СтруктураОтвета.Вставить("duration","0.12345");
	СтруктураОтвета.Вставить("requestId","123456789");
	СтруктураОтвета.Вставить("data",СтрДата);
	
	если не ЗначениеЗаполнено(Тело) тогда  //Тест    
		
		// письмо писать себе?
		СтруктураОтвета.Вставить("result","ERROR");
		СтруктураОтвета.Вставить("message","Ошибка чтения данных с сайта");
		
		ОшибкаОбработки = Истина;
		
		записьJSON = новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьВЛог("b2b test","Ошибка загрузка скидок. Не заполнено тело запроса"+Тело,,,);
		
		ЗаписатьJSON(записьJSON,СтруктураОтвета);
		возврат ЗаписьJSON.Закрыть();   
		//если в массив что-то несъедобное будет, ссылочные там типы или ещё что-то, то при обращения запросу вернёт "Ошибку инициализации модуля"
		
	иначе  //Тест Post
		//		//
		//		{  ответ на сайт
		//  "result": "OK",
		//  "message": "OK",
		//  "duration": "0.0001",
		//  "requestId": "123456789"
		//  "data": {    
		//  }
		//}
		
		
		ОшибкаОбработки = ложь;
		Если  Тело<>"" Тогда
			
			ЧтениеJSON0 = Новый ЧтениеJSON;
			ЧтениеJSON0.УстановитьСтроку(Тело);
			СодержаниеТ = ПрочитатьJSON(ЧтениеJSON0); // структура
			// проставляем галку для контаргента, если ее еще нет.
			
			СкидкаНомерДок = СтрЗаменить(СодержаниеТ.data.sale,"sk_","");
			СкидкаКодКонтрагента = СодержаниеТ.data.user;  // интегральный код
			
			Док = документы.УстановкаСкидокПоКонтрагентам.НайтиПоНомеру(СкидкаНомерДок,НачалоГода(ТекущаяДата()));
			
			Если НЕ док.Пустая() Тогда
				
				ДокОб= док.ПолучитьОбъект();
				естьИзменения = ложь;
				// Кухарь А.Ю.  07.06.2023 начало
				//
				//для каждого текстрока из докОб.Контрагенты цикл
				//	Если текстрока.Контрагент.Ведущий.Код = СкидкаКодКонтрагента и НЕ текстрока.Согласован Тогда
				//		
				//		текстрока.Согласован =Истина;
				//		ЕстьИзменения = истина;
				//		#Если клиент  тогда
				//			сообщить(""+СкидкаКодКонтрагента);
				//			
				//		#КонецЕсли 
				//		ЗаписатьВЛог("b2b test","Загрузка скидок. Контрагент - "+текстрока.Контрагент+" Ведущий -"+СкидкаКодКонтрагента+" скидка -"+СкидкаНомерДок,,,);
				//		
				//	конецЕсли;	
				//	Если текстрока.Контрагент.Ведущий.Код = СкидкаКодКонтрагента тогда
				//		контрагентНайден = истина;
				//	КонецЕсли;	
				//конецЦикла;	
				
				запрос=новый запрос;
				запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	УстановкаСкидокПоКонтрагентамКонтрагенты.Контрагент КАК Контрагент,
				|	УстановкаСкидокПоКонтрагентамКонтрагенты.НомерСтроки КАК НомерСтроки,
				|	УстановкаСкидокПоКонтрагентамКонтрагенты.Контрагент.Наименование КАК КонтрагентНаименование
				|ИЗ
				|	Документ.УстановкаСкидокПоКонтрагентам.Контрагенты КАК УстановкаСкидокПоКонтрагентамКонтрагенты
				|ГДЕ
				|	УстановкаСкидокПоКонтрагентамКонтрагенты.Контрагент.Ведущий.Код = &Код
				|	И УстановкаСкидокПоКонтрагентамКонтрагенты.Ссылка = &Ссылка
				|	И НЕ УстановкаСкидокПоКонтрагентамКонтрагенты.Согласован";
				запрос.УстановитьПараметр("Ссылка",док);
				запрос.УстановитьПараметр("Код",СкидкаКодКонтрагента);
				ВыборкаКонтрагенты=запрос.Выполнить().Выбрать();
				пока ВыборкаКонтрагенты.Следующий() цикл
					контрагентНайден = истина;
					ТекСтрока=ДокОб.Контрагенты.Получить(ВыборкаКонтрагенты.НомерСтроки-1);
					ТекСтрока.Согласован=Истина;
					ЕстьИзменения = истина;
					ЗаписатьВЛог("b2b test","Загрузка скидок. Контрагент - "+ВыборкаКонтрагенты.КонтрагентНаименование+" Ведущий -"+СкидкаКодКонтрагента+" скидка -"+СкидкаНомерДок,,,);
					#Если клиент  тогда
						сообщить(""+СкидкаКодКонтрагента);						
					#КонецЕсли 			
				КонецЦикла;	
				// Кухарь А.Ю.  07.06.2023 конец
				
				#Если клиент  тогда
					сообщить("Есть изменения "+ЕстьИзменения);
				#КонецЕсли
				
				
				Если естьИзменения Тогда
					попытка
						ДокОб.Записать();
					исключение
						СтруктураОтвета.Вставить("result","ERROR");
						СтруктураОтвета.Вставить("message","Ошибка записи документа скидок.");
						
						записьJSON = новый ЗаписьJSON;
						ЗаписьJSON.УстановитьСтроку();
						ЗаписатьJSON(записьJSON,СтруктураОтвета);
						ЗаписатьВЛог("b2b test","Ошибка загрузка скидок.  Контрагент - "+СкидкаКодКонтрагента+" скидка -"+СкидкаНомерДок +ОписаниеОшибки(),,,);
						
						возврат ЗаписьJSON.Закрыть();  
						
						
						ОшибкаОбработки = Истина;
					конецпопытки;
					
				КонецЕсли;
				
			КонецЕсли;	
			
		КонецЕсли;
		
		//**************************************************************************
		// ответ передать для сайта
		
		записьJSON = новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(записьJSON,СтруктураОтвета);
		возврат ЗаписьJSON.Закрыть();   
		
		
	КонецЕсли;
	
	ЗаписатьВЛог("b2b test","Загрузка скидок. Контрагент - "+СкидкаКодКонтрагента+" скидка -"+СкидкаНомерДок,,,);
	
	
	// нечаева 26,04,23---
	
КонецФункции
// Кухарь А.Ю.  14.04.2023 конец

Функция ЗагрузитьУчастиеВСкидкахb2b(Тело="")  экспорт
	
	ЗаписатьВЛог("b2b test","Загрузка скидок. начало "+ТекущаяДата(),,,);
	
	//------------------------------------------------------------------------------------------------
	// нечаева 26,04,23+++   тело - это строка
	
	// запишем в лог	
	ИмяФайла = ""+Год(ТекущаяДата())+"_"+месяц(ТекущаяДата())+"_"+День(ТекущаяДата())+"_"+Час(ТекущаяДата())+"_"+минута(ТекущаяДата());
	ИмяФайлаОбмена =  "\\srvfiles\b2b_files\sale-new_b2b\"+ИмяФайла+".txt";
	
	Дописывать    = Истина;
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайлаОбмена, КодировкаТекста.UTF8, , Дописывать);
	ТекстСообщений     = ""+Тело;
	ЗаписьТекста.ЗаписатьСтроку(ТекстСообщений);
	ЗаписьТекста.Закрыть();
	
	//СкопироватьВ_архив("sale-new_b2b\",ИмяФайла); 
	//нечаева 11,01,23 -
	
	
	//--------------------------------------------------------
	СтрДата = Новый Структура;	
	
	СтруктураОтвета=новый Структура();
	СтруктураОтвета.Вставить("result","OK");
	СтруктураОтвета.Вставить("message","OK");
	//СтруктураОтвета.Вставить("duration","0.12345");
	//СтруктураОтвета.Вставить("requestId","123456789");
	СтруктураОтвета.Вставить("data",СтрДата);
	
	если не ЗначениеЗаполнено(Тело) тогда  //Тест    
		
		// письмо писать себе?
		СтруктураОтвета.Вставить("result","ERROR");
		СтруктураОтвета.Вставить("message","Ошибка чтения данных с сайта");
		
		ОшибкаОбработки = Истина;
		
		записьJSON = новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьВЛог("b2b test","Ошибка загрузка скидок. Не заполнено тело запроса"+Тело,,,);
		
		ЗаписатьJSON(записьJSON,СтруктураОтвета);
		возврат ЗаписьJSON.Закрыть();   
		//если в массив что-то несъедобное будет, ссылочные там типы или ещё что-то, то при обращения запросу вернёт "Ошибку инициализации модуля"
		
	иначе  //Тест Post
		//		//
		//		{  ответ на сайт
		//  "result": "OK",
		//  "message": "OK",
		//  "duration": "0.0001",
		//  "requestId": "123456789"
		//  "data": {    
		//  }
		//}
		
		ОшибкаОбработки = ложь;
		ЕстьИзменения = ложь;
		контрагентнайден = ложь;
		
		Если  Тело<>"" Тогда
			
			ЧтениеJSON0 = Новый ЧтениеJSON;
			ЧтениеJSON0.УстановитьСтроку(Тело);
			СодержаниеТ = ПрочитатьJSON(ЧтениеJSON0); // структура
			// проставляем галку для контаргента, если ее еще нет.
			
			СкидкаНомерДок = СтрЗаменить(СодержаниеТ.data.sale,"sk_","");
			Если СтрДЛина(СкидкаНомерДок) <> 9 Тогда
				
				СтруктураОтвета.Вставить("result","ERROR");
				СтруктураОтвета.Вставить("message","Не верный номер документа скидок.");
				записьJSON = новый ЗаписьJSON;
				ЗаписьJSON.УстановитьСтроку();
				ЗаписатьJSON(записьJSON,СтруктураОтвета);
				
				возврат ЗаписьJSON.Закрыть();  
				
			конецЕсли;	
			СкидкаКодКонтрагента = СодержаниеТ.data.user;  // интегральный код
			
			Док = документы.УстановкаСкидокПоКонтрагентам.НайтиПоНомеру(СкидкаНомерДок,НачалоГода(ТекущаяДата()));
			
			Если НЕ док.Пустая() Тогда
				
				ДокОб= док.ПолучитьОбъект();
				естьИзменения = ложь;
				контрагентнайден = ложь;
				// Кухарь А.Ю.  07.06.2023 начало
				//
				//для каждого текстрока из докОб.Контрагенты цикл
				//	Если текстрока.Контрагент.Ведущий.Код = СкидкаКодКонтрагента и НЕ текстрока.Согласован Тогда
				//		
				//		текстрока.Согласован =Истина;
				//		ЕстьИзменения = истина;
				//		#Если клиент  тогда
				//			сообщить(""+СкидкаКодКонтрагента);
				//			
				//		#КонецЕсли 
				//		ЗаписатьВЛог("b2b test","Загрузка скидок. Контрагент - "+текстрока.Контрагент+" Ведущий -"+СкидкаКодКонтрагента+" скидка -"+СкидкаНомерДок,,,);
				//		
				//	конецЕсли;	
				//	Если текстрока.Контрагент.Ведущий.Код = СкидкаКодКонтрагента тогда
				//		контрагентНайден = истина;
				//	КонецЕсли;	
				//конецЦикла;	
				
				запрос=новый запрос;
				запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	УстановкаСкидокПоКонтрагентамКонтрагенты.Контрагент КАК Контрагент,
				|	УстановкаСкидокПоКонтрагентамКонтрагенты.НомерСтроки КАК НомерСтроки,
				|	УстановкаСкидокПоКонтрагентамКонтрагенты.Контрагент.Наименование КАК КонтрагентНаименование
				|ИЗ
				|	Документ.УстановкаСкидокПоКонтрагентам.Контрагенты КАК УстановкаСкидокПоКонтрагентамКонтрагенты
				|ГДЕ
				|	УстановкаСкидокПоКонтрагентамКонтрагенты.Контрагент.Ведущий.Код = &Код
				|	И УстановкаСкидокПоКонтрагентамКонтрагенты.Ссылка = &Ссылка";
				// Кухарь А.Ю.  05.09.2023 начало
				//  				|	И НЕ УстановкаСкидокПоКонтрагентамКонтрагенты.Согласован";			 
				// Кухарь А.Ю.  05.09.2023 конец
				
				запрос.УстановитьПараметр("Ссылка",док);
				запрос.УстановитьПараметр("Код",СкидкаКодКонтрагента);
				ВыборкаКонтрагенты=запрос.Выполнить().Выбрать();
				пока ВыборкаКонтрагенты.Следующий() цикл
					контрагентНайден = истина;
					ТекСтрока=ДокОб.Контрагенты.Получить(ВыборкаКонтрагенты.НомерСтроки-1);
					// Кухарь А.Ю.  05.09.2023 начало
					//Иногда модифицированность заполняется, если поставить тоже самое значение
					если не ТекСтрока.Согласован тогда
						ТекСтрока.Согласован=Истина;
					КонецЕсли;
					// Кухарь А.Ю.  05.09.2023 конец
					
					
					ТекСтрока.Согласован=Истина;
					ЕстьИзменения = истина;
					ЗаписатьВЛог("b2b test","Загрузка скидок. Контрагент - "+ВыборкаКонтрагенты.КонтрагентНаименование+" Ведущий -"+СкидкаКодКонтрагента+" скидка -"+СкидкаНомерДок,,,);
					#Если клиент  тогда
						сообщить(""+СкидкаКодКонтрагента);						
					#КонецЕсли 			
				КонецЦикла;	
				// Кухарь А.Ю.  07.06.2023 конец
				
				#Если клиент  тогда
					сообщить("Есть изменения "+ЕстьИзменения);
				#КонецЕсли
				
				
				Если естьИзменения Тогда
					попытка
						// Кухарь А.Ю.  05.09.2023 начало
						//
						если ДокОб.модифицированность() тогда 
							// Кухарь А.Ю.  05.09.2023 конец							
							Если  ДокОб.Проведен тогда
								ДокОб.Записать(РежимЗаписиДокумента.Проведение);
							иначе
								ДокОб.Записать(РежимЗаписиДокумента.запись);
							конецЕсли;
							// Кухарь А.Ю.  05.09.2023 начало
							//
						КонецЕсли; 
						// Кухарь А.Ю.  05.09.2023 конец
						
					исключение
						СтруктураОтвета.Вставить("result","ERROR");
						СтруктураОтвета.Вставить("message","Ошибка записи документа скидок.");
						
						записьJSON = новый ЗаписьJSON;
						ЗаписьJSON.УстановитьСтроку();
						ЗаписатьJSON(записьJSON,СтруктураОтвета);
						ЗаписатьВЛог("b2b test","Ошибка загрузка скидок.  Контрагент - "+СкидкаКодКонтрагента+" скидка -"+СкидкаНомерДок +ОписаниеОшибки(),,,);
						#Если клиент  тогда
							сообщить("Ошибка загрузка скидок.  Контрагент - "+СкидкаКодКонтрагента+" скидка -"+СкидкаНомерДок +ОписаниеОшибки());
						#КонецЕсли 
						
						возврат ЗаписьJSON.Закрыть();  
						
						
						ОшибкаОбработки = Истина;
					конецпопытки;
					
					
				КонецЕсли;
			иначе
				
				СтруктураОтвета.Вставить("result","ERROR");
				СтруктураОтвета.Вставить("message","В 1с не найден документ скидок.");
				
				записьJSON = новый ЗаписьJSON;
				ЗаписьJSON.УстановитьСтроку();
				ЗаписатьJSON(записьJSON,СтруктураОтвета);
				ЗаписатьВЛог("b2b test","Ошибка загрузка скидок.  Контрагент - "+СкидкаКодКонтрагента+" скидка -"+СкидкаНомерДок +ОписаниеОшибки(),,,);
				#Если клиент  тогда
					сообщить("Ошибка загрузка скидок.  Контрагент - "+СкидкаКодКонтрагента+" скидка -"+СкидкаНомерДок +ОписаниеОшибки());
				#КонецЕсли 
				
				возврат ЗаписьJSON.Закрыть()
				
			КонецЕсли;	
			
		КонецЕсли;
		
		
		Если НЕ ЕстьИзменения и  контрагентНайден ТОгда
			СтруктураОтвета.Вставить("result","OK");
			СтруктураОтвета.Вставить("message","В 1с скидка по этому контрагенту уже установлена");
			
		КонецЕсли;	
		
		Если НЕ ЕстьИзменения и НЕ контрагентНайден Тогда
			СтруктураОтвета.Вставить("result","ERROR");
			СтруктураОтвета.Вставить("message","Не найден контрагент в документе скидок. код контрагента - "+СкидкаКодКонтрагента);
			
			записьJSON = новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
			ЗаписатьJSON(записьJSON,СтруктураОтвета);
			ЗаписатьВЛог("b2b test","Ошибка загрузка скидок.  Контрагент - "+СкидкаКодКонтрагента+" скидка -"+СкидкаНомерДок +ОписаниеОшибки(),,,);
			#Если клиент  тогда
				сообщить("Ошибка загрузка скидок.  Контрагент - "+СкидкаКодКонтрагента+" скидка -"+СкидкаНомерДок +ОписаниеОшибки());
			#КонецЕсли 
			
			возврат ЗаписьJSON.Закрыть()
		конецЕсли;	
		
		
		//**************************************************************************
		// ответ передать для сайта
		
		записьJSON = новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(записьJSON,СтруктураОтвета);
		
		ЗаписатьВЛог("b2b test","1Загрузка скидок конец. Контрагент - "+СкидкаКодКонтрагента+" скидка -"+СкидкаНомерДок+" "+ТекущаяДата(),,,);
		
		возврат ЗаписьJSON.Закрыть();   
		
		
	КонецЕсли;
	
	ЗаписатьВЛог("b2b test","2Загрузка скидок конец. Контрагент - "+СкидкаКодКонтрагента+" скидка -"+СкидкаНомерДок+" "+ТекущаяДата(),,,);
	
	
	// нечаева 26,04,23---
	
КонецФункции


//нечаева 27,04,23+++
Функция ЕстьВложенныеГруппы(Товар)
	
	Результат = ложь;
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = истина
	|	И Номенклатура.ПометкаУдаления = ложь
	|	И Номенклатура.Ссылка В ИЕРАРХИИ(&ТекНом)";
	Запрос.УстановитьПараметр("ТекНом",Товар.ссылка);
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	Если Рез.Количество()>1 Тогда
		результат = истина;
	КонецЕсли; 
	
	
	Возврат результат;
	
КонецФункции	

Функция ПолучитьКонтрДляСкидок(Ведущий)
	
	
	ВыборкаКонтрагентов = неопределено;
	
	Запрос=Новый запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ведущий.Ссылка В ИЕРАРХИИ(&текконтрагент)
	|	И Контрагенты.ПометкаУдаления = ЛОЖЬ
	|	И Контрагенты.НеИспользовать = ЛОЖЬ
	|	И Контрагенты.Ведущий.ВыгружатьВИнтернетМагазин = &выгружать
	|	И Контрагенты.Владелец = &СкВл";
	
	Запрос.УстановитьПараметр("СкВл", справочники.ИБ.НайтиПоКоду("SSP"));
	Запрос.УстановитьПараметр("выгружать", перечисления.ВыгружатьНаСайт.Да);
	Запрос.УстановитьПараметр("текконтрагент", ведущий);
	
	РезультатЗапрос = Запрос.Выполнить();
	ВыборкаКонтрагентов  = РезультатЗапрос.Выгрузить();
	
	
	Возврат  ВыборкаКонтрагентов;
	
	
	
КонецФункции	

Процедура ВыгрузитьСкидкиКонтрагентаb2b() Экспорт
	
	// пример структуры
	
	//	
	//	{
	//  "apiVersion": "1.0",
	//  "data": [
	//    {
	//      "id": "SMR-7755_SNL-063466",
	//      "name": "Скидка Колготки и чулки",
	//      "discountPercent": "18",
	//      "propCode": "Id_TipTovDiscount",
	//      "propValue": "ttdSNL-063466",
	//      "priority": "100",
	//      "users": [
	//        "SMR-7755",
	//        "SMR-7755"
	//      ]
	//    },
	//    {
	//      "id": "SMR-1131_sk_SNL-00461_30",
	//      "name": "Скидка ГС ЯНВАРЬ-ФЕВРАЛЬ 23 МСК",
	//      "discountPercent": "30",
	//      "dateStart": "30.12.2022",
	//      "dateFinish": "28.02.2023",
	//      "products": [
	//        "SNL-524142",
	//        "SNL-524969",
	//        "SNL-524146"
	//      ],
	//      "priority": "300",
	//      "users": [
	//        "SMR-7755",
	//        "SMR-7755"
	//      ]
	//    }
	//  ]
	//}
	
	
	ОбщиеДанные = Новый Массив;
	
	ИмяВыходногоФайлаДЖ = ПолучитьИмяВременногоФайла(".json");
	сообщить(ИмяВыходногоФайлаДж + " с командой");
	
	Запись = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( ,Символы.Таб);
	Запись.ОткрытьФайл(ИмяВыходногоФайлаДЖ,,,ПараметрыЗаписиJSON);
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата; 
	//	Сообщить(" количество товаров "+товары.Количество());
	
	// -------------------------------------
	//собираем массив по скидкам по контаргенту
	
	СсылкаК=справочники.Контрагенты.НайтиПоКоду("SSR-9370"); 
	
	#Если Клиент Тогда
		Состояние("Заполнение личных скидок..."+ссылкаК);
	#КонецЕсли
	//первая часть скидок
	//ТекКонтр = МассивКонтр[ПП];
	Ведущий = СсылкаК.Ведущий;
	//весь список активных контрагентов
	КонтрДляСкидок = ПолучитьКонтрДляСкидок(Ведущий);
	// берем первого попавшегося, считаем, что для всех подчиненных ведущему, скидки табличной части одинаковы всегда, в том числе и акции.
	// если в акциях-документах есть хоть один согласившийся, считаем, что акция действительна для всех. 
	Если КонтрДляСкидок.количество() > 0 Тогда
		ТекКонтр = ссылкаК; //подчиненный
	иначе
		//продолжить;
		// нет ни одного подчиненного контаргента.
	конецЕсли;
	
	тзСкидки = текконтр.скидки;
	Для каждого текстрока из ТЗСкидки цикл
		// проверим, что этот товар не модель.
		НеМодель = ЕстьВложенныеГруппы(ТекСтрока.Номенклатура);
		//нечаева 17,04,23+++ новый формат для скидок, через точку.
		ТекСкидка=ПроцедурыОбменаССайтом.ЗаменитьТочку(ТекСтрока.Скидка,2);
		кодСкидки = ""+Ведущий.код+"_"+ТекСтрока.Номенклатура.код;
		
		СтрПРо = новый Структура;
		
		//нечаева 17,04,23---
		Если НеМодель тогда
			
			//НСтр = СТРПро.Вставить(.Добавить();	
			СтрПро.Вставить("id",Строка(кодСкидки));
			СтрПро.Вставить("name", Строка("Скидка "+ТекСтрока.Номенклатура.наименование));
			СтрПро.Вставить("discountPercent", Строка(ТекСкидка));
			СтрПро.Вставить("propCode", Строка("Id_TipTovDiscount"));
			СтрПро.Вставить("propValue", Строка("ttd"+ТекСтрока.Номенклатура.код));
			СтрПро.Вставить("priority", Строка("100"));
			МассивК = Новый Массив;
			МассивК.Добавить(Строка(Ведущий.код));
			СтрПро.Вставить("users", МассивК);  // тут масссив
			ОбщиеДанные.Добавить(СтрПро);
			
		Иначе
			
			СтрПро.Вставить("id",Строка(кодСкидки));
			СтрПро.Вставить("name", Строка("Скидка "+ТекСтрока.Номенклатура.наименование));
			СтрПро.Вставить("discountPercent", Строка(ТекСкидка));
			Массивн = Новый Массив;
			Массивн.Добавить(Строка(ТекСтрока.Номенклатура.код));
			
			СтрПро.Вставить("products", МассивН ); 
			СтрПро.Вставить("priority", Строка("100"));
			МассивК = Новый Массив;
			МассивК.Добавить(Строка(Ведущий.код));
			СтрПро.Вставить("users", МассивК);  // тут масссив
			ОбщиеДанные.Добавить(СтрПро);
			
			
		конецЕсли;	
		
	конецЦикла;
	//--------------------------------------------------------------------------------
	// вторая часть по скидкам контрагента
	//********************************************************************************
	
	// выбираем все акции, где есть хоть один согласившийся конечный контрагент!!!!
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	УстановкаСкидокПоКонтрагентамКонтрагенты.Ссылка КАК Ссылка,
	|	УстановкаСкидокПоКонтрагентамКонтрагенты.Согласован КАК Согласован,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Скидка КАК Скидка
	|ИЗ
	|	Документ.УстановкаСкидокПоКонтрагентам.Контрагенты КАК УстановкаСкидокПоКонтрагентамКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			УстановкаСкидокПоКонтрагентамСкидки.Ссылка КАК Ссылка,
	|			УстановкаСкидокПоКонтрагентамСкидки.Скидка КАК Скидка,
	|			УстановкаСкидокПоКонтрагентамСкидки.Номенклатура КАК Номенклатура,
	|			УстановкаСкидокПоКонтрагентамСкидки.Модель КАК Модель,
	|			УстановкаСкидокПоКонтрагентамСкидки.Бренд КАК Бренд,
	|			УстановкаСкидокПоКонтрагентамСкидки.ТипТовара КАК ТипТовара
	|		ИЗ
	|			Документ.УстановкаСкидокПоКонтрагентам.Скидки КАК УстановкаСкидокПоКонтрагентамСкидки) КАК ВложенныйЗапрос
	|		ПО УстановкаСкидокПоКонтрагентамКонтрагенты.Ссылка = ВложенныйЗапрос.Ссылка
	|ГДЕ
	|	УстановкаСкидокПоКонтрагентамКонтрагенты.Согласован = ИСТИНА
	|	И УстановкаСкидокПоКонтрагентамКонтрагенты.Ссылка.Дата <= &Дата1
	|	И УстановкаСкидокПоКонтрагентамКонтрагенты.Ссылка.Дата2 >= &Дата2
	|	И УстановкаСкидокПоКонтрагентамКонтрагенты.Ссылка.Проведен = ИСТИНА
	|	И УстановкаСкидокПоКонтрагентамКонтрагенты.Контрагент В ИЕРАРХИИ(&Контрагент)
	|ИТОГИ ПО
	|	Ссылка,
	|	Скидка";
	
	Запрос.УстановитьПараметр("Дата2",ТекущаяДата());
	Запрос.УстановитьПараметр("Дата1",ТекущаяДата());
	Запрос.УстановитьПараметр("Контрагент",ТекКонтр);      	
	
	Рез=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ССылка");
	//#Если Клиент Тогда
	//	Сообщить(" Количество выгружамых акций- "+Рез.Количество());	
	//#КонецЕсли
	
	
	Пока Рез.Следующий() Цикл
		
		Выборка = Рез;
		//#Если Клиент Тогда
		//	ОбработкаПрерыванияПользователя();
		//	Состояние("Обработка: "+Рез.ссылка);			
		//#КонецЕсли	
		
		Рез2 = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Скидка");
		
		Пока Рез2.Следующий() Цикл
			
			ТекСкидка=ПроцедурыОбменаССайтом.ЗаменитьТочку(Рез2.Скидка,2);
			
			кодСкидки = ""+Ведущий.код+"_sk_"+Рез.Ссылка.номер+"_"+Рез2.Скидка;
			
			СтрПРо = новый Структура;
			
			СтрПро.Вставить("id",Строка(кодСкидки));
			СтрПро.Вставить("name", Строка("Скидка "+Рез.Ссылка.комментарий));
			СтрПро.Вставить("discountPercent", Строка(ТекСкидка));
			СтрПро.Вставить("dateStart", Строка(Формат(Рез.Ссылка.Дата,"ДФ=dd.MM.yyyy; ДЛФ=D")) );
			СтрПро.Вставить("dateFinish", Строка(Формат(Рез.ССылка.Дата2,"ДФ=dd.MM.yyyy; ДЛФ=D")) );
			
			//--------------------------------------------------------
			Рез3 = Рез2.Выбрать(); // тут уже по товарам
			Массивн = Новый Массив;
			
			Пока Рез3.Следующий() Цикл
				
				Массивн.Добавить(Строка(Рез3.номенклатура.код));
				
			КонецЦикла;
			
			СтрПро.Вставить("products", МассивН ); 
			СтрПро.Вставить("priority", Строка("300"));
			МассивК = Новый Массив;
			МассивК.Добавить(Строка(Ведущий.код));
			СтрПро.Вставить("users", МассивК);  // тут масссив
			ОбщиеДанные.Добавить(СтрПро);
			
			
		конецЦикла;			
	КонецЦикла;
	
	//--------------------------------------------------------------------------------
	
	Данные= Новый Структура;
	
	Данные.Вставить("apiVersion","1.0");  
	Данные.Вставить("data",ОБщиеДанные); // это массив структур
	
	
	
	Попытка
		ЗаписатьJSON(Запись, Данные, НастройкиСериализации);
		Запись.Закрыть();
		
	Исключение
		сообщить(ОписаниеОшибки());
		
	КонецПопытки;;  
	
	
	
КонецПроцедуры

//нечаева 27,04,23+++


#КонецОбласти



// Кухарь А.Ю.  01.08.2023 начало
//
Функция ПрочитатьРеквизитыРНКПНКПРМ (Ссылка,ИмяРеквизита) экспорт
	Запрос=новый запрос;
	запрос.УстановитьПараметр("Ссылка",Ссылка);
	запрос.УстановитьПараметр("ИмяРеквизита",ИмяРеквизита);
	
	запрос.Текст="ВЫБРАТЬ
	|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита КАК ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
	|ГДЕ
	|	РеквизитыРНКПНКПРМ.ИмяРеквизита = &ИмяРеквизита
	|	И РеквизитыРНКПНКПРМ.Документ = &Ссылка";
	
	результат=запрос.Выполнить().Выбрать();
	пока результат.Следующий() цикл
		возврат результат.ЗначениеРеквизита;
	КонецЦикла;
	
	возврат Неопределено;
КонецФункции

Функция ПрочитатьКомплектующиеНоменклатуры (Номенклатура,ТолькоТовар=ложь) Экспорт 
	Запрос=новый запрос;
	запрос.УстановитьПараметр("Товар",Перечисления.ВидыНоменклаутры.Товар);
	запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	
	запрос.Текст="ВЫБРАТЬ
	|	НоменклатураКоплектующие.Номенклатура КАК Номенклатура,
	|	СУММА(НоменклатураКоплектующие.Количество) КАК Количество
	|ИЗ
	|	Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
	|ГДЕ
	|	НоменклатураКоплектующие.Номенклатура.Родитель.ВидНоменклатуры = &Товар
	|	И НоменклатураКоплектующие.Количество > 0
	|	И НоменклатураКоплектующие.Ссылка = &Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	НоменклатураКоплектующие.Номенклатура";
	
	если не ТолькоТовар тогда
		запрос.Текст=СтрЗаменить(запрос.Текст,"НоменклатураКоплектующие.Номенклатура.Родитель.ВидНоменклатуры = &Товар","Истина");
	КонецЕсли;
	
	возврат запрос.Выполнить().Выгрузить();
	
	
КонецФункции

// Кухарь А.Ю.  01.08.2023 конец


// Кельманов А.В. - Чтобы можно было экспортно вызывать - 2025.04.10
Функция ПолучитьСтруктуруДанныхМаркиЧЗПоНаименованию_Экспорт(Наименование, ЭтоОтгрузка = Истина) Экспорт
	
	СтруктураВозврата = ПолучитьСтруктуруДанныхМаркиЧЗПоНаименованию(Наименование, ЭтоОтгрузка);
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Кухарь А.Ю.  16.04.2025 начало 

// Кельманов А.В. - HELP-6008 - 2025.08.13 {
//Функция ПолучитьСтруктуруВложенныхКодов(ТипШК, Данные) Экспорт   
Функция ПолучитьСтруктуруВложенныхКодов(ТипШК, Данные, ТипДокумента = "ЛистНабора") Экспорт   
	// Кельманов А.В. - HELP-6008 - 2025.08.13 }
	
	СтруктураВозврата = Новый Структура("Успех,Ошибки,ДанныеКодаЧЗ,ТаблицаВложений"); 
	ТаблицаВложений = Новый ТаблицаЗначений;
	МассивОшибок = Новый Массив;
	
	НаименованиеМарки = Лев(Данные, 31);	
	ДанныеКоробки = ПолучитьСтруктуруДанныхМаркиЧЗПоНаименованию(НаименованиеМарки, Истина);	
	
	Если Не ЗначениеЗаполнено(ДанныеКоробки.МаркаЧЗ) Тогда
		МассивОшибок.Добавить(СтрШаблон("Не найден код ЧЗ по %1", Данные));
	КонецЕсли; 
	
	Если МассивОшибок.Количество() = 0 Тогда  
		
		Запрос = Новый Запрос;
		
		// Кельманов А.В. - HELP-6008 - 2025.08.12 {
		//Запрос.Текст = "ВЫБРАТЬ
		//|	ЕСТЬNULL(Уровень2.Штрихкод, Уровень1.Штрихкод) КАК КодЧЗШтуки,
		//|	ЕСТЬNULL(Уровень2.Штрихкод.ТипШК, Уровень1.Штрихкод.ТипШК) КАК ТипШК
		//|ПОМЕСТИТЬ ТЗШтук
		//|ИЗ
		//|	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК Уровень1
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК Уровень2
		//|		ПО Уровень1.Штрихкод = Уровень2.Ссылка
		//|ГДЕ
		//|	Уровень1.Ссылка = &МаркаЧЗ
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ТЗШтук.ТипШК КАК ТипШК,
		//|	ТЗШтук.КодЧЗШтуки.Владелец КАК Номенклатура,
		//|	СУММА(1) КАК Количество,
		//|	ПОДСТРОКА(ТЗШтук.КодЧЗШтуки.Владелец.ГТИН, 2, 13) КАК ШтрихКод
		//|ИЗ
		//|	ТЗШтук КАК ТЗШтук
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ТЗШтук.КодЧЗШтуки.Владелец,
		//|	ТЗШтук.ТипШК,
		//|	ПОДСТРОКА(ТЗШтук.КодЧЗШтуки.Владелец.ГТИН, 2, 13)";
		Запрос.Текст = "ВЫБРАТЬ
		|	ЕСТЬNULL(Уровень2.Штрихкод, Уровень1.Штрихкод) КАК КодЧЗШтуки,
		|	ЕСТЬNULL(Уровень2.Штрихкод.ТипШК, Уровень1.Штрихкод.ТипШК) КАК ТипШК
		|ПОМЕСТИТЬ ТЗШтук
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК Уровень1
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК Уровень2
		|		ПО Уровень1.Штрихкод = Уровень2.Ссылка  
		// Кухарь А.Ю.  24.10.2025 начало
		// HELP-7562 (Но это общий косяк. Не надо брать коды, что внутри штук)
		|		И Уровень1.Штрихкод.ТипШК <> значение (Перечисление.ТипыШтрихкодов.Штука)					    
		// Кухарь А.Ю.  24.10.2025 конец
		
		|ГДЕ
		|	Уровень1.Ссылка = &МаркаЧЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗШтук.ТипШК КАК ТипШК,
		|	ТЗШтук.КодЧЗШтуки.Владелец КАК Номенклатура,
		|	СУММА(1) КАК Количество,
		|	ПОДСТРОКА(ТЗШтук.КодЧЗШтуки.Владелец.ГТИН, 2, 13) КАК ШтрихКод
		|ИЗ
		|	ТЗШтук КАК ТЗШтук
		|
		|СГРУППИРОВАТЬ ПО
		|	ТЗШтук.КодЧЗШтуки.Владелец,
		|	ТЗШтук.ТипШК,
		|	ПОДСТРОКА(ТЗШтук.КодЧЗШтуки.Владелец.ГТИН, 2, 13)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗШтук.КодЧЗШтуки КАК КодЧЗШтуки,
		|	СтатусыКМ_ФактСрезПоследних.Статус КАК Статус
		|ИЗ
		|	ТЗШтук КАК ТЗШтук
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыКМ_Факт.СрезПоследних КАК СтатусыКМ_ФактСрезПоследних
		|		ПО ТЗШтук.КодЧЗШтуки = СтатусыКМ_ФактСрезПоследних.ШтрихКодУпаковки
		|ГДЕ
		|	НЕ ВЫБОР
		|				КОГДА ТЗШтук.КодЧЗШтуки.СпособВводаВОборот В (ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.Импорт), ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.ПокупкаВРФ), ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.Производство))
		|					ТОГДА ЕСТЬNULL(СтатусыКМ_ФактСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.ПустаяСсылка)) В (ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.ВОбороте))
		|				КОГДА ТЗШтук.КодЧЗШтуки.СпособВводаВОборот В (ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.МаркировкаОстатков), ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.Перемаркировка))
		|					ТОГДА ЕСТЬNULL(СтатусыКМ_ФактСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.ПустаяСсылка)) В (ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.ВОбороте), ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.Нанесен), ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.Распечатан))
		|			КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ТЗШтук.КодЧЗШтуки,
		|	СтатусыКМ_ФактСрезПоследних.Статус";
		// Кельманов А.В. - HELP-6008 - 2025.08.12 }
		
		Запрос.УстановитьПараметр("МаркаЧЗ", ДанныеКоробки.МаркаЧЗ);  
		
		// Кельманов А.В. - HELP-6008 - 2025.08.12 {
		//ТаблицаВложений = Запрос.Выполнить().Выгрузить();     
		Результат = Запрос.ВыполнитьПакет();
		
		ТаблицаВложений = Результат[1].Выгрузить();     
		// Кельманов А.В. - HELP-6008 - 2025.08.12 }
		
		Для Каждого СтрокаКода Из ТаблицаВложений Цикл
			
			Если СтрокаКода.ТипШК <> Перечисления.ТипыШтрихКодов.Штука Тогда 
				МассивОшибок.Добавить(СтрШаблон("В отсканированном коде %1 обнаружено вложение с некорректным типом ШК %2", ДанныеКоробки.МаркаЧЗ, СтрокаКода.ТипШК));	
			КонецЕсли;          
			
			Если Не ЗначениеЗаполнено(СтрокаКода.Номенклатура) Тогда 
				МассивОшибок.Добавить(СтрШаблон("В отсканированном коде %1 обнаружено вложение с пустой номенклатурой", ДанныеКоробки.МаркаЧЗ));	
			КонецЕсли;          
			
		КонецЦикла;
		
		Если ТаблицаВложений.Количество() = 0 Тогда    
			МассивОшибок.Добавить(СтрШаблон("В отсканированном коде %1 нет вложений", ДанныеКоробки.МаркаЧЗ));	
		КонецЕсли;
		
		// Кельманов А.В. - HELP-6008 - 2025.08.12 {
		СтатусыКодов = Результат[2].Выгрузить();
		
		Для Каждого Стр Из СтатусыКодов Цикл
			
			МассивОшибок.Добавить(СтрШаблон("В отсканированном коде %1 обнаружено вложение с некорректным статусом - Код: %2; Статус: %3", ДанныеКоробки.МаркаЧЗ, Стр.КодЧЗШтуки, Стр.Статус));
			
		КонецЦикла;
		// Кельманов А.В. - HELP-6008 - 2025.08.12 }
		
		ДанныеКоробки.Количество = ТаблицаВложений.Итог("Количество");
		
	КонецЕсли;
	
	Если МассивОшибок.Количество() = 0 Тогда 
		
		СтруктураВозврата.Успех = Истина;
		СтруктураВозврата.Ошибки = Неопределено; 
		СтруктураВозврата.ДанныеКодаЧЗ = ДанныеКоробки;
		СтруктураВозврата.ТаблицаВложений = ТаблицаВложений;
		
	Иначе
		
		// Кельманов А.В. - HELP-6008 - 2025.08.13 {
		Если ТипДокумента = "ЛистПереукладки" Тогда
			МассивОшибок.Добавить(СтрШаблон("Некорректные вложения в агрегации %1, отсканируйте ЧЗ поштучно или отсканируйте другой короб.", ДанныеКоробки.МаркаЧЗ));			
		Иначе
			МассивОшибок.Добавить(СтрШаблон("Некорректные вложения в агрегации %1, отсканируйте ЧЗ поштучно.", ДанныеКоробки.МаркаЧЗ));			
		КонецЕсли;
		// Кельманов А.В. - HELP-6008 - 2025.08.13 }
		
		СтруктураВозврата.Успех = Ложь;
		СтруктураВозврата.Ошибки = МассивОшибок; 
		СтруктураВозврата.ДанныеКодаЧЗ = Неопределено;
		СтруктураВозврата.ТаблицаВложений = Неопределено;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Кухарь А.Ю.  06.03.2024 начало
//
Функция ПолучитьСтруктуруДанныхМаркиЧЗПоНаименованию (Наименование,ЭтоОтгрузка=Истина)
	
	если СтрДлина(Наименование)=20 тогда
		Наименование=Сред(Наименование,3);
	КонецЕсли;
	
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	//+MARK-704 20251126 Михайловский
	//СтруктураВозврата=новый Структура("МаркаЧЗ,ТипКода,ТипУпаковки,Количество,Количество1,ТипШК,Номенклатура,ШтрихКод,ОшибкаПоискаКодаЧЗ,СканировалиКодЧЗ,СпособВводаВОборот,Статус,КомментарийКОшибке");
	СтруктураВозврата=новый Структура("МаркаЧЗ,ТипКода,ТипУпаковки,Количество,Количество1,ТипШК,Номенклатура,ШтрихКод,ОшибкаПоискаКодаЧЗ,СканировалиКодЧЗ,СпособВводаВОборот,Статус,КомментарийКОшибке, ЗначениеШтрихкода, КМКоррекция");
	//-MARK-704 20251126 Михайловский
	ШтрихКодУпаковки=Справочники.ШтрихкодыУпаковокТоваров.НайтиПоНаименованию(Наименование);
	
	Если ЭтоОтгрузка = Истина Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ШтрихкодыУпаковокТоваров.Ссылка КАК МаркаЧЗ, 
		//+MARK-704 20251126 Михайловский
		|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихКода КАК ЗначениеШтрихкода,
		//+MARK-704 20251126 Михайловский
		|	ШтрихкодыУпаковокТоваров.ТипКода КАК ТипКода,
		|	ШтрихкодыУпаковокТоваров.ТипУпаковки КАК ТипУпаковки,
		|	ВЫБОР
		// Кельманов А.В. - HELP-8013 - 2025.11.28 {
		//|		КОГДА ШтрихкодыУпаковокТоваров.Владелец.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект)
		//|				И ШтрихкодыУпаковокТоваров.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
		|		КОГДА ШтрихкодыУпаковокТоваров.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
		// Кельманов А.В. - HELP-8013 - 2025.11.28 }
		|			ТОГДА 1
		|		ИНАЧЕ ШтрихкодыУпаковокТоваров.Количество
		|	КОНЕЦ КАК Количество1, 
		//++Данилова Е.В. 02.12.2025  MARK-1869
		|	СтатусыКМ_ФактСрезПоследних.Регистратор КАК Регистратор,
		//--Данилова Е.В. 02.12.2025
		|	ШтрихкодыУпаковокТоваров.ТипШК КАК ТипШК,
		|	ШтрихкодыУпаковокТоваров.Владелец КАК Номенклатура,
		|	ПОДСТРОКА(ШтрихкодыУпаковокТоваров.Владелец.ГТИН, 2, 13) КАК ШтрихКод,
		|	ЛОЖЬ КАК ОшибкаПоискаКодаЧЗ,
		|	ИСТИНА КАК СканировалиКодЧЗ,
		|	ВЫБОР
		|		КОГДА ШтрихкодыУпаковокТоваров.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
		|			ТОГДА ШтрихкодыУпаковокТоваров.Владелец.Родитель.ШтукВКоробке
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Количество,
		|	СтатусыКМ_ФактСрезПоследних.Статус КАК Статус,
		|	ШтрихкодыУпаковокТоваров.СпособВводаВОборот КАК СпособВводаВОборот
		|ИЗ	
		|	РегистрСведений.СтатусыКМ_Факт.СрезПоследних(, 
		|		ШтрихКодУпаковки  = &ШтрихКодУпаковки			
		|	) КАК СтатусыКМ_ФактСрезПоследних		
		|ЛЕВОЕ СОЕДИНЕНИЕ 
		|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|ПО
		|	СтатусыКМ_ФактСрезПоследних.ШтрихКодУпаковки = ШтрихкодыУпаковокТоваров.Ссылка
		|ГДЕ
		|	НЕ ШтрихкодыУпаковокТоваров.ПометкаУдаления
		|";
		
		Запрос.УстановитьПараметр("Наименование", Наименование);
		Запрос.УстановитьПараметр("ШтрихКодУпаковки", ШтрихКодУпаковки);
		
	Иначе
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ШтрихкодыУпаковокТоваров.Ссылка КАК МаркаЧЗ, 
		//+MARK-704 20251126 Михайловский
		|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихКода КАК ЗначениеШтрихкода,
		//+MARK-704 20251126 Михайловский
		|	ШтрихкодыУпаковокТоваров.ТипКода КАК ТипКода,
		|	ШтрихкодыУпаковокТоваров.ТипУпаковки КАК ТипУпаковки,
		|	ВЫБОР
		// Кельманов А.В. - HELP-8013 - 2025.11.28 {
		//|		КОГДА ШтрихкодыУпаковокТоваров.Владелец.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект)
		//|				И ШтрихкодыУпаковокТоваров.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
		|		КОГДА ШтрихкодыУпаковокТоваров.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
		// Кельманов А.В. - HELP-8013 - 2025.11.28 }
		|			ТОГДА 1
		|		ИНАЧЕ ШтрихкодыУпаковокТоваров.Количество
		|	КОНЕЦ КАК Количество1,
		|	ШтрихкодыУпаковокТоваров.ТипШК КАК ТипШК,
		|	ШтрихкодыУпаковокТоваров.Владелец КАК Номенклатура,
		|	ПОДСТРОКА(ШтрихкодыУпаковокТоваров.Владелец.ГТИН, 2, 13) КАК ШтрихКод,
		|	ЛОЖЬ КАК ОшибкаПоискаКодаЧЗ,
		|	ИСТИНА КАК СканировалиКодЧЗ,
		|	ВЫБОР
		|		КОГДА ШтрихкодыУпаковокТоваров.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
		|			ТОГДА ШтрихкодыУпаковокТоваров.Владелец.Родитель.ШтукВКоробке
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Количество,
		|	ЗНАЧЕНИЕ(ПЕречисление.СтатусыКодовМаркировкиФакт.Эмитирован) КАК Статус,
		|	ШтрихкодыУпаковокТоваров.СпособВводаВОборот КАК СпособВводаВОборот
		|
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|ГДЕ
		|	ШтрихкодыУпаковокТоваров.Ссылка = &ШтрихКодУпаковки";
		
		Запрос.УстановитьПараметр("ШтрихКодУпаковки", ШтрихКодУпаковки);
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЭтоОтгрузка Тогда 
			
			МожноИспользовать = Ложь;
			
			Если (Выборка.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Импорт 
				Или Выборка.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.ПокупкаВРФ  
				Или Выборка.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Производство) 
				
				И ((Выборка.Статус = Перечисления.СтатусыКодовМаркировкиФакт.ВОбороте
					// Ихсанов Д. А. Начало 04.01.2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8436
					Или Выборка.Статус = Перечисления.СтатусыКодовМаркировкиФакт.Нанесен)
					// Ихсанов Д. А. Конец 04.01.2026
				Или (Выборка.ТипШК = Перечисления.ТипыШтрихКодов.Коробка И Выборка.Статус = Перечисления.СтатусыКодовМаркировкиФакт.Списан) // Кельманов А.В. - HELP-5585 - 2025.06.18	
				Или (Выборка.ТипШК = Перечисления.ТипыШтрихКодов.Коробка И Выборка.Статус = Перечисления.СтатусыКодовМаркировкиФакт.Расформирован)) //++Данилова Е.В. 30.05.2025 HELP-5130	
				
				Тогда 		 
				
				МожноИспользовать = Истина;	
				
			ИначеЕсли (Выборка.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.МаркировкаОстатков 
				Или Выборка.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Перемаркировка)  			
				
				И (Выборка.Статус = Перечисления.СтатусыКодовМаркировкиФакт.Нанесен 
				Или Выборка.Статус = Перечисления.СтатусыКодовМаркировкиФакт.ВОбороте
				Или Выборка.Статус = Перечисления.СтатусыКодовМаркировкиФакт.Распечатан //Валетов + 27,05,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-2262
				Или (Выборка.ТипШК = Перечисления.ТипыШтрихКодов.Коробка И Выборка.Статус = Перечисления.СтатусыКодовМаркировкиФакт.Списан) // Кельманов А.В. - HELP-5585 - 2025.06.18	
				Или (Выборка.ТипШК = Перечисления.ТипыШтрихКодов.Коробка И Выборка.Статус = Перечисления.СтатусыКодовМаркировкиФакт.Расформирован)) //++Данилова Е.В. 26.05.2025 HELP-5130, HELP-5109	
				
				Тогда
				
				МожноИспользовать = Истина;
				// Кухарь А.Ю.  03.12.2025 начало   OUT-173
			ИначеЕсли Выборка.ТипКода = Перечисления.ТипыКодовМаркировки.Набор и  Выборка.Статус = Перечисления.СтатусыКодовМаркировкиФакт.Распечатан тогда
				МожноИспользовать = Истина;	
				// Кухарь А.Ю.  03.12.2025 конец
				
			Иначе
				
				МожноИспользовать = Ложь; 
				
				СтруктураВозврата.КомментарийКОшибке = "Способ ввода в оборот: " + Выборка.СпособВводаВОборот + "; Статус: " + Выборка.Статус;  
				
				//++Данилова Е.В. 02.12.2025  MARK-1869 
				Если Выборка.Статус = Перечисления.СтатусыКодовМаркировкиФакт.ОтгруженПокупателю Тогда
					
					ТекстОшибки = "Код отгружен клиенту "; 
					Если ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ХранилищеКодовМаркировки") 
						И ТипЗнч(Выборка.Регистратор.ДокОснование) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
						
						ТекстОшибки = ТекстОшибки + Строка(Выборка.Регистратор.ДокОснование.Контрагент) +  " " + Строка(Выборка.Регистратор.ДокОснование); 	
						
					КонецЕсли;
					
					ТекстОшибки = ТекстОшибки + " , замените КМ"; 
					
					СтруктураВозврата.КомментарийКОшибке =  СтруктураВозврата.КомментарийКОшибке + Символы.ПС + ТекстОшибки; 
					
				КонецЕсли;
				МассивСтатусовВыбыл = Новый Массив; 
				МассивСтатусовВыбыл.Добавить(Перечисления.СтатусыКодовМаркировкиФакт.Списан);
				МассивСтатусовВыбыл.Добавить(Перечисления.СтатусыКодовМаркировкиФакт.Выбыл);
				МассивСтатусовВыбыл.Добавить(Перечисления.СтатусыКодовМаркировкиФакт.Карантин);
				Если МассивСтатусовВыбыл.Найти(Выборка.Статус) <> Неопределено Тогда
					
					ТекстОшибки = "Статус кода " + Строка(Выборка.Статус) + ", замените КМ";  	
					СтруктураВозврата.КомментарийКОшибке =  СтруктураВозврата.КомментарийКОшибке + Символы.ПС + ТекстОшибки;
				КонецЕсли;
				
				//--Данилова Е.В. 02.12.2025
				
			КонецЕсли;
			
		Иначе
			
			МожноИспользовать = Истина;
			
		КонецЕсли;
		
		Если МожноИспользовать Тогда
			
			ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);        
			//+MARK-704 20251126 Михайловский
			Если ЗначениеЗаполнено(СтрНайти(Выборка.ЗначениеШтрихкода, "******")) Тогда
				СтруктураВозврата.КМКоррекция = Истина;
			Иначе
				СтруктураВозврата.КМКоррекция = Ложь;
			КонецЕсли;	
			//-MARK-704 20251126 Михайловский
			Возврат СтруктураВозврата;
			
		КонецЕсли;
		
	КонецЦикла;
	//++Данилова Е.В. 02.12.2025 MARK-1869
	Если ЭтоОтгрузка
		И Выборка.Количество() = 0
		И ( ШтрихКодУпаковки.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Импорт 
		Или ШтрихКодУпаковки.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.ПокупкаВРФ  
		Или ШтрихКодУпаковки.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Производство) Тогда
		
		ТекстОшибки = "Код не принят по ПНК, обратитесь в техподдержку";  	
		СтруктураВозврата.КомментарийКОшибке =  ТекстОшибки;
		
	КонецЕсли; 
	//--Данилова Е.В. 02.12.2025
	
	СтруктураВозврата.ОшибкаПоискаКодаЧЗ = Истина;
	
	ТекстСообщения = "ОбщегоНазначения.ПолучитьСтруктуруДанныхМаркиЧЗПоНаименованию";
	ЗаписатьВЛог("Мониторинг СтатусыКМ_Факт", ТекстСообщения, , , , (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало) / 1000);
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Кухарь А.Ю.  01.08.2023 конец

// Кельманов А.В. - Перенёс из РКМ - 2025.05.20
Функция ПолучитьВложенныеШК(КодАгрегации) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка КАК ШК_Родитель,
	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ ВложенныеПервыйУровень
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	|ГДЕ
	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка = &КодАгрегации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка КАК ШК_Родитель,
	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ ВложенныеВторойУровень
	|ИЗ
	|	ВложенныеПервыйУровень КАК ВложенныеПервыйУровень
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	|		ПО ВложенныеПервыйУровень.Штрихкод = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка КАК ШК_Родитель,
	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ ВложенныеТретийУровень
	|ИЗ
	|	ВложенныеВторойУровень КАК ВложенныеВторойУровень
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	|		ПО ВложенныеВторойУровень.Штрихкод = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка КАК ШК_Родитель,
	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ ВложенныеЧетвёртыйУровень
	|ИЗ
	|	ВложенныеТретийУровень КАК ВложенныеТретийУровень
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	|		ПО ВложенныеТретийУровень.Штрихкод = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка КАК ШК_Родитель,
	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ ВложенныеПятыйУровень
	|ИЗ
	|	ВложенныеЧетвёртыйУровень КАК ВложенныеЧетвёртыйУровень
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	|		ПО ВложенныеЧетвёртыйУровень.Штрихкод = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныеПервыйУровень.ШК_Родитель КАК ШК_Родитель,
	|	ВложенныеПервыйУровень.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ ВТ_Вложенные
	|ИЗ
	|	ВложенныеПервыйУровень КАК ВложенныеПервыйУровень
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныеВторойУровень.ШК_Родитель,
	|	ВложенныеВторойУровень.Штрихкод
	|ИЗ
	|	ВложенныеВторойУровень КАК ВложенныеВторойУровень
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныеТретийУровень.ШК_Родитель,
	|	ВложенныеТретийУровень.Штрихкод
	|ИЗ
	|	ВложенныеТретийУровень КАК ВложенныеТретийУровень
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныеЧетвёртыйУровень.ШК_Родитель,
	|	ВложенныеЧетвёртыйУровень.Штрихкод
	|ИЗ
	|	ВложенныеЧетвёртыйУровень КАК ВложенныеЧетвёртыйУровень
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныеПятыйУровень.ШК_Родитель,
	|	ВложенныеПятыйУровень.Штрихкод
	|ИЗ
	|	ВложенныеПятыйУровень КАК ВложенныеПятыйУровень
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Вложенные.ШК_Родитель КАК ШК_Родитель,
	|	ВТ_Вложенные.Штрихкод КАК Штрихкод,
	|	ВТ_Вложенные.Штрихкод.Владелец КАК Номенклатура
	// Кельманов А.В. - HELP-4798 - 2025.05.20 {
	|	,
	|	ПОДСТРОКА(ВТ_Вложенные.Штрихкод.Владелец.ГТИН, 2, 13) КАК ЛинейныйШК
	// Кельманов А.В. - HELP-4798 - 2025.05.20 }
	|ИЗ
	|	ВТ_Вложенные КАК ВТ_Вложенные
	|ГДЕ
	|	ВТ_Вложенные.ШК_Родитель.ТипШК <> ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	|	И ВТ_Вложенные.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)";
	
	Запрос.УстановитьПараметр("КодАгрегации", КодАгрегации);
	
	ТЗ_Вложенные = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ_Вложенные;
	
КонецФункции

// Кухарь А.Ю.  17.03.2024 начало
Функция ЗаполнитьТаблицуМарокИзХКМ (ДокОснование) экспорт
	Запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодКоробки = &ПустойШК
	|			ТОГДА ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодУпаковки
	|		ИНАЧЕ ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодКоробки
	|	КОНЕЦ КАК ШтрихкодУпаковки
	|ИЗ
	|	Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок КАК ХранилищеКодовМаркировкиШтрихкодыУпаковок
	|ГДЕ
	|	ХранилищеКодовМаркировкиШтрихкодыУпаковок.Ссылка.Проведен
	| И	ХранилищеКодовМаркировкиШтрихкодыУпаковок.Ссылка.ДокОснование В(&ДокОснование)  
	|	И ХранилищеКодовМаркировкиШтрихкодыУпаковок.Ссылка.ПланФакт = &ПланФакт"; 
	Запрос.УстановитьПараметр("ПустойШК",Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка()); 
	
	если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ПриходнаяНакладная") тогда
		РеквизитыШапки=ПолучитьРеквизитыШапки(ДокОснование,"ДокОснование,КодОперации","Документ");
		ДокОснованиеХКМ=РеквизитыШапки.ДокОснование;
		КодОперации=РеквизитыШапки.КодОперации;
		
		если КодОперации=Перечисления.КодыОперацийОстатки.ЗакупкаР  тогда
			если ТипЗнч(ДокОснованиеХКМ)<>Тип("ДокументСсылка.ЗаказПоставщику") тогда
				Сообщить("Неподходящее док. основание у ПНК. Должно быть ЗПС, а сейчас "+Строка(ТипЗнч(ДокОснованиеХКМ)));
				ТаблицаВозврата=новый ТаблицаЗначений;
				ТаблицаВозврата.Колонки.Добавить("ШтрихкодУпаковки");
				возврат ТаблицаВозврата;
			КонецЕсли;
			// Кухарь А.Ю.  24.03.2025 начало
			//запрос.УстановитьПараметр("ДокОснованиеХКМ",РеквизитыШапки.ДокОснование);
			//Валетов + 09,04,2025 Добавил поиск по ДокОснованию, если ТЧ ЗПС пустая.
			//Пустая Задача
			Если ДокОснование.ЗаказыПоставщикам.Количество() > 0 Тогда
				ДокОснованиеХКМ=ДокОснование.ЗаказыПоставщикам.Выгрузить().ВыгрузитьКОлонку("ЗПС");
			Иначе
				ДокОснованиеХКМ = новый Массив;
				ДокОснованиеХКМ.Добавить(ДокОснование.ДокОснование);
			КонецЕсли;
			//Валетов -
			// Кухарь А.Ю.  24.03.2025 конец
			ПланФакт=Перечисления.ПланФакт.Факт;  //У ПНК закупки - планом является факт от ЗПС
		иначе
			ДокОснованиеХКМ=ДокОснование;	
			ПланФакт=Перечисления.ПланФакт.План;
			
		КонецЕсли;		
	иначе
		ДокОснованиеХКМ=ДокОснование;
		ПланФакт=Перечисления.ПланФакт.Факт;
		
	КонецЕсли;
	//Валетов + 02,04,2025  ПустаяЗадача
	//Адаптация под исправление Андрея по массиву ЗПС при приемке ПНК 
	Если ТипЗнч(ДокОснованиеХКМ) <> Тип("Массив") Тогда
		ДокОснованиеХКМ = новый Массив;
		ДокОснованиеХКМ.Добавить(ДокОснование);
	КонецЕсли;
	//Валетов-
	
	Запрос.УстановитьПараметр("ДокОснование",ДокОснованиеХКМ); 
	Запрос.УстановитьПараметр("ПланФакт",ПланФакт); 	
	// Кухарь А.Ю.  22.10.2024 конец
	
	ТаблицаМарокИзХКМ=запрос.Выполнить().Выгрузить();
	
	ТаблицаМарокИзХКМ.Индексы.Добавить("ШтрихкодУпаковки");
	Возврат ТаблицаМарокИзХКМ;
КонецФункции

Функция СравнитьХКМиЛНПоМаркам (ДокОснование,МассивКорректировочныхДокументов=Неопределено) экспорт
	Запрос=новый запрос;  
	//Валетов + 18,11,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-7611, 
	//БЫЛО Поменял запрос на сравнение Вложения Коробов ХКМ с вложением Коробов ЛН
	//Запрос.Текст="ВЫБРАТЬ
	//|	ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	//|	1 КАК ШтрихкодУпаковкиКоличество,
	//|	ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК КАК ШтрихкодУпаковкиТипШК,
	//|	ХранилищеКодовМаркировкиШтрихкодыУпаковок.Ссылка КАК ХКМСсылка,
	//|	ЕСТЬNULL(ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод, ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодУпаковки) КАК ШтрихкодШтукиХКМ
	//|ПОМЕСТИТЬ ХКМ
	//|ИЗ
	//|	Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок КАК ХранилищеКодовМаркировкиШтрихкодыУпаковок
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//|		ПО ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	//|ГДЕ
	//// Кухарь А.Ю.  22.10.2024 начало
	////	|	ХранилищеКодовМаркировкиШтрихкодыУпаковок.Ссылка.ДокОснование = &ДокОснование
	//// Кухарь А.Ю.  24.03.2025 начало
	//|	ХранилищеКодовМаркировкиШтрихкодыУпаковок.Ссылка.ДокОснование В (&ДокОснованиеХКМ)  
	//// Кухарь А.Ю.  24.03.2025 конец
	//
	//|	И ХранилищеКодовМаркировкиШтрихкодыУпаковок.Ссылка.ПланФакт = &ПланФакт
	//|	И &ДокОснованиеКорректное
	//// Кухарь А.Ю.  22.10.2024 конец
	//
	//
	//|	И ХранилищеКодовМаркировкиШтрихкодыУпаковок.Ссылка.Проведен
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	//|	1 КАК Количество,
	//|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК КАК ШтрихкодУпаковкиТипШК,
	//|	ЛистНабораШтрихкодыУпаковок.Ссылка КАК Ссылка,
	//|	ЕСТЬNULL(ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод, ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки) КАК ШтрихкодШтукиЛН
	//|ПОМЕСТИТЬ ЛН
	//|ИЗ
	//|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//|		ПО ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	//|ГДЕ
	//|	ЛистНабораШтрихкодыУпаковок.Ссылка.ДокОснование = &ДокОснование
	//|	И ЛистНабораШтрихкодыУпаковок.Ссылка.Проведен
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ЕСТЬNULL(ХКМ.ШтрихкодУпаковки, ЛН.ШтрихкодУпаковки) КАК ШтрихкодУпаковки,
	//|	ЕСТЬNULL(ХКМ.ШтрихкодУпаковкиТипШК, ЛН.ШтрихкодУпаковкиТипШК) КАК ТипШК,
	//|	ЕСТЬNULL(ХКМ.ШтрихкодУпаковкиКоличество, 0) - ЕСТЬNULL(ЛН.Количество, 0) КАК Дельта,
	//|	ЛН.Ссылка КАК ЛистНабора,
	//|	ЛН.Количество КАК КоличествоЛН,
	//|	ХКМ.ШтрихкодУпаковкиКоличество КАК КоличествоХКМ,
	//|	ХКМ.ХКМСсылка КАК ХКМСсылка,
	//|	ЕСТЬNULL(ХКМ.ШтрихкодУпаковки.Владелец, ЛН.ШтрихкодУпаковки.Владелец) КАК Номенклатура
	//|ИЗ
	//|	ХКМ КАК ХКМ
	//|		ПОЛНОЕ СОЕДИНЕНИЕ ЛН КАК ЛН
	//|		ПО ХКМ.ШтрихкодШтукиХКМ = ЛН.ШтрихкодШтукиЛН
	//|ГДЕ
	//|	ЕСТЬNULL(ХКМ.ШтрихкодУпаковкиКоличество, 0) - ЕСТЬNULL(ЛН.Количество, 0) <> 0";
	//// Кухарь А.Ю.  22.10.2024 начало
	////  
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодКоробки КАК ШтрихкодУпаковки,
	|	1 КАК ШтрихкодУпаковкиКоличество,
	|	ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК КАК ШтрихкодУпаковкиТипШК,
	|	ХранилищеКодовМаркировкиШтрихкодыУпаковок.Ссылка КАК ХКМСсылка,
	|	ЕСТЬNULL(ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод, ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодУпаковки) КАК ШтрихкодШтукиХКМ
	|ПОМЕСТИТЬ ХКМ
	|ИЗ
	|	Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок КАК ХранилищеКодовМаркировкиШтрихкодыУпаковок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	|		ПО ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодКоробки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	|ГДЕ
	|	ХранилищеКодовМаркировкиШтрихкодыУпаковок.Ссылка.ДокОснование В(&ДокОснованиеХКМ)
	|	И ХранилищеКодовМаркировкиШтрихкодыУпаковок.Ссылка.ПланФакт = &ПланФакт
	|	И ХранилищеКодовМаркировкиШтрихкодыУпаковок.Ссылка.Проведен
	|	И &ДокОснованиеКорректное
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|	1 КАК Количество,
	|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК КАК ШтрихкодУпаковкиТипШК,
	|	ЛистНабораШтрихкодыУпаковок.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод, ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки) КАК ШтрихкодШтукиЛН
	|ПОМЕСТИТЬ ЛН
	|ИЗ
	|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	|		ПО ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	|			И (ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК <> ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
	|ГДЕ
	|	ЛистНабораШтрихкодыУпаковок.Ссылка.ДокОснование = &ДокОснование
	|	И ЛистНабораШтрихкодыУпаковок.Ссылка.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ХКМ.ШтрихкодУпаковки, ЛН.ШтрихкодУпаковки) КАК ШтрихкодУпаковки,
	|	ЕСТЬNULL(ХКМ.ШтрихкодУпаковкиТипШК, ЛН.ШтрихкодУпаковкиТипШК) КАК ТипШК,
	|	ЕСТЬNULL(ХКМ.ШтрихкодУпаковкиКоличество, 0) - ЕСТЬNULL(ЛН.Количество, 0) КАК Дельта,
	|	ЛН.Ссылка КАК ЛистНабора,
	|	ЛН.Количество КАК КоличествоЛН,
	|	ХКМ.ШтрихкодУпаковкиКоличество КАК КоличествоХКМ,
	|	ХКМ.ХКМСсылка КАК ХКМСсылка,
	|	ЕСТЬNULL(ХКМ.ШтрихкодУпаковки.Владелец, ЛН.ШтрихкодУпаковки.Владелец) КАК Номенклатура
	|ИЗ
	|	ХКМ КАК ХКМ
	|		ПОЛНОЕ СОЕДИНЕНИЕ ЛН КАК ЛН
	|		ПО ХКМ.ШтрихкодШтукиХКМ = ЛН.ШтрихкодШтукиЛН
	|ГДЕ
	|	ЕСТЬNULL(ХКМ.ШтрихкодУпаковкиКоличество, 0) - ЕСТЬNULL(ЛН.Количество, 0) <> 0";
	
	запрос.УстановитьПараметр("ДокОснованиеКорректное",Истина);
	РеквизитыШапки=ПолучитьРеквизитыШапки(ДокОснование,"КодОперации,ДокОснование","Документ");
	
	если РеквизитыШапки.КодОперации = Перечисления.КодыОперацийОстатки.ЗакупкаР тогда
		
		
		// Кухарь А.Ю.  24.03.2025 начало
		//запрос.УстановитьПараметр("ДокОснованиеХКМ",РеквизитыШапки.ДокОснование);	
		СписокЗПС=ДокОснование.ЗаказыПоставщикам.Выгрузить().ВыгрузитьКОлонку("ЗПС");
		//Валетов + 09,04,2025 Добавил поиск по ДокОснованию, если ТЧ ЗПС пустая.
		//Пустая Задача
		Если СписокЗПС.Количество() = 0 Тогда
			СписокЗПС.Добавить(ДокОснование.ДокОснование);
		КонецЕсли;
		//Валетов -
		запрос.УстановитьПараметр("ДокОснованиеХКМ",СписокЗПС);	
		// Кухарь А.Ю.  24.03.2025 конец
		
		запрос.УстановитьПараметр("ПланФакт",Перечисления.ПланФакт.Факт); //У ПНК закупки - планом является факт от ЗПС
		если ТипЗнч(РеквизитыШапки.ДокОснование) <>Тип("ДокументСсылка.ЗаказПоставщику") тогда   //Нужно чтобы в заявке тогда ничего не нашлось
			запрос.УстановитьПараметр("ДокОснованиеКорректное",ложь);
			Сообщить("Неподходящее док. основание у ПНК. Должно быть ЗПС, а сейчас "+Строка(ТипЗнч(РеквизитыШапки.ДокОснование)));
		КонецЕсли;
	иначе
		запрос.УстановитьПараметр("ДокОснованиеХКМ",ДокОснование);	
		запрос.УстановитьПараметр("ПланФакт",Перечисления.ПланФакт.План);
		
	КонецЕсли;
	// Кухарь А.Ю.  22.10.2024 конец
	
	запрос.УстановитьПараметр("ДокОснование",ДокОснование);
	возврат запрос.Выполнить().Выгрузить();
	
КонецФункции
// Кухарь А.Ю.  17.03.2024 конец

// Кухарь А.Ю.  31.03.2024 начало
//
Функция ПолучитьДанныеКодаЧЗДляТСД(НаименованиеМарки) Экспорт
	
	// Кельманов А.В. - ASU-1695 - 2025.01.16 {
	//СтруктураВозврата = Новый Структура("УИДКодаЧЗ, УИДНоменклатуры, КодЧЗ, ТипШК, Номенклатура, Ошибки, Успех");
	//
	//СтруктураВозврата.Успех = Ложь;
	//СтруктураВозврата.Ошибки = "";
	//
	//Запрос=новый запрос;
	//Запрос.Текст =	"ВЫБРАТЬ
	//|	ШтрихкодыУпаковокТоваров.Ссылка КАК КодЧЗ,
	//|	ШтрихкодыУпаковокТоваров.ТипШК КАК ТипШК,
	//|	ШтрихкодыУпаковокТоваров.Владелец КАК Номенклатура
	//|ИЗ
	//|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	//|ГДЕ
	//|	НЕ ШтрихкодыУпаковокТоваров.ПометкаУдаления
	//|	И ШтрихкодыУпаковокТоваров.Наименование = &Наименование";
	//запрос.УстановитьПараметр("Наименование",НаименованиеМарки);
	//Выборка=запрос.Выполнить().Выбрать();
	//если Выборка.Количество()=0 тогда
	//	СтруктураВозврата.Ошибки="Не найден код ЧЗ по наименованию "+НаименованиеМарки;
	//КонецЕсли;
	//
	//пока Выборка.следующий() цикл
	//	ЗаполнитьЗначенияСвойств(СтруктураВозврата,Выборка);
	//	СтруктураВозврата.УИДКодаЧЗ = Выборка.КодЧЗ.УникальныйИдентификатор();	
	//	СтруктураВозврата.УИДНоменклатуры = Выборка.Номенклатура.УникальныйИдентификатор();
	//	СтруктураВозврата.Успех=Истина;
	//КонецЦикла;
	
	// Кельманов А.В. - HELP-4798 - 2025.05.20 {
	//СтруктураВозврата = Новый Структура("УИДКодаЧЗ, УИДНоменклатуры, МаркаЧЗ, Количество, Количество1, ТипШК, Номенклатура, ШтрихКод, ОшибкаПоискаКодаЧЗ");
	
	// Кельманов А.В. - Оптимизация работы - 2025.12.09 {
	//СтруктураВозврата = Новый Структура("УИДКодаЧЗ, УИДНоменклатуры, МаркаЧЗ, Количество, Количество1, ТипШК, ТипУпаковки, Номенклатура, ШтрихКод, ОшибкаПоискаКодаЧЗ");

	// Кельманов А.В. - HELP-8528 - 2026.01.14 {
	//СтруктураВозврата = Новый Структура("УИДКодаЧЗ, УИДНоменклатуры, МаркаЧЗ, Количество, Количество1, ТипШК, ТипУпаковки, Номенклатура, ШтрихКод, ЗначениеШтрихкода, ОшибкаПоискаКодаЧЗ");
	СтруктураВозврата = Новый Структура("УИДКодаЧЗ, УИДНоменклатуры, МаркаЧЗ, Количество, Количество1, ТипШК, ТипУпаковки, Номенклатура, ШтрихКод, ЗначениеШтрихкода, ОшибкаПоискаКодаЧЗ, КомментарийКОшибке");
	// Кельманов А.В. - HELP-8528 - 2026.01.14 }

	// Кельманов А.В. - Оптимизация работы - 2025.12.09 }
	
	// Кельманов А.В. - HELP-4798 - 2025.05.20 }
	
	СтруктураМарки = ПолучитьСтруктуруДанныхМаркиЧЗПоНаименованию(НаименованиеМарки);
	
	ЗаполнитьЗначенияСвойств(СтруктураВозврата, СтруктураМарки);
	
	Если Не СтруктураВозврата.ОшибкаПоискаКодаЧЗ Тогда 
		
		СтруктураВозврата.УИДКодаЧЗ = СтруктураВозврата.МаркаЧЗ.УникальныйИдентификатор();	
		СтруктураВозврата.УИДНоменклатуры = СтруктураВозврата.Номенклатура.УникальныйИдентификатор();
		
	КонецЕсли;
	// Кельманов А.В. - ASU-1695 - 2025.01.16 }
	
	Ответ = Сериализовать(Новый ХранилищеЗначения(Сериализовать(СтруктураВозврата), Новый СжатиеДанных(9)));
	
	Возврат Ответ;
	
КонецФункции

// Кельманов А.В. - HELP-4798 - 2025.05.20
Функция ПолучитьДанныеНоменклатурыПоВложеннымШК(КодАгрегации) Экспорт
	
	МассивВозврата = Новый Массив;
	
	ТЗ_Вложенные = ПолучитьВложенныеШК(КодАгрегации);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ТЗ_Вложенные.Номенклатура КАК Номенклатура,
	|	ТЗ_Вложенные.ЛинейныйШК КАК ЛинейныйШК,
	|	ТЗ_Вложенные.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ ВТ_Вложенные
	|ИЗ
	|	&ТЗ_Вложенные КАК ТЗ_Вложенные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Вложенные.Номенклатура КАК Номенклатура,
	|	ВТ_Вложенные.ЛинейныйШК КАК ЛинейныйШК,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Вложенные.Штрихкод) КАК Количество
	|ИЗ
	|	ВТ_Вложенные КАК ВТ_Вложенные
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Вложенные.Номенклатура,
	|	ВТ_Вложенные.ЛинейныйШК";
	
	Запрос.УстановитьПараметр("ТЗ_Вложенные", ТЗ_Вложенные);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураВозврата = Новый Структура("Номенклатура, ЛинейныйШК, Количество, Ошибки");
			
			ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
			
			СтруктураВозврата.Ошибки = "";
			
			МассивВозврата.Добавить(СтруктураВозврата);
			
		КонецЦикла;
		
	Иначе
		
		СтруктураВозврата = Новый Структура("Номенклатура, ЛинейныйШК, Количество, Ошибки");
		
		СтруктураВозврата.Ошибки = "Не найдены данные номенклатуры по вложенным ШК для кода: " + КодАгрегации;
		
		МассивВозврата.Добавить(СтруктураВозврата);
		
	КонецЕсли;
	
	Ответ = Сериализовать(Новый ХранилищеЗначения(Сериализовать(МассивВозврата), Новый СжатиеДанных(9)));
	
	Возврат Ответ;
	
КонецФункции

// Кельманов А.В. - MARK-766 - 2025.01.31
Функция ПолучитьСвободныеКодыЧЗ(ДанныеНоменклатуры) Экспорт
	
	МассивВозврата = Новый Массив;
	
	СтруктураДанныхНоменклатуры = Десериализовать(Десериализовать(ДанныеНоменклатуры).Получить());
	
	Если СтруктураДанныхНоменклатуры <> Неопределено Тогда
		
		ТекНоменклатура = СтруктураДанныхНоменклатуры.Номенклатура;
		ТекКоличество = СтруктураДанныхНоменклатуры.Количество;
		ТекТипШК = Перечисления.ТипыШтрихКодов.Штука;
		
		// Кельманов А.В. - Оптимизация работы - 2025.04.30 {
		УзелТСД = Неопределено;
		
		Если СтруктураДанныхНоменклатуры.Свойство("КодУзла") Тогда
			
			УзелТСД = ПланыОбмена.МобильныеТСД.НайтиПоКоду(СтруктураДанныхНоменклатуры.КодУзла);
			
		КонецЕсли;
		
		СборщикКомплектаТСД = Неопределено;
		
		Если СтруктураДанныхНоменклатуры.Свойство("Наборщик") Тогда
			
			СборщикКомплектаТСД = СтруктураДанныхНоменклатуры.Наборщик;
			
		КонецЕсли;
		// Кельманов А.В. - Оптимизация работы - 2025.04.30 }
		
		// Кельманов А.В. - оптимизация работы - 2025.03.27 {
		//ТекПодразделение = ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла();
		//
		//МассивКодов = Новый Массив;
		//
		//Для Счетчик = 1 По ТекКоличество Цикл
		//	
		//	СтруктураПоиска = Новый Структура("Номенклатура, ТипШК, Подразделение, МассивИсключаемыхКодов",
		//	ТекНоменклатура, ТекТипШК, ТекПодразделение, МассивКодов);				 
		//	
		//	СтруктураКодаЧЗ = МаркировкаКС.ПолучитьСвободныйКодДляПечати(СтруктураПоиска);
		//	
		//	СтруктураВозврата = Новый Структура("УИДКодаЧЗ, УИДНоменклатуры, МаркаЧЗ, НаименованиеМарки, Количество, Количество1, Номенклатура, ТипШК, Успех, Ошибки");
		//	
		//	СтруктураВозврата.Успех = СтруктураКодаЧЗ.Успех;
		//	СтруктураВозврата.Ошибки = СтруктураКодаЧЗ.Ошибки;
		//	СтруктураВозврата.Номенклатура = ТекНоменклатура;
		//	СтруктураВозврата.ТипШК = ТекТипШК;
		//	СтруктураВозврата.УИДНоменклатуры = ТекНоменклатура.УникальныйИдентификатор();
		//	СтруктураВозврата.Количество = 1;
		//	СтруктураВозврата.Количество1 = 1;
		//	
		//	Если СтруктураКодаЧЗ.Успех Тогда
		//		
		//		КодЧЗ = СтруктураКодаЧЗ.КодЧЗ;
		//		
		//		СтруктураВозврата.МаркаЧЗ = КодЧЗ;
		//		СтруктураВозврата.УИДКодаЧЗ = КодЧЗ.УникальныйИдентификатор();
		//		СтруктураВозврата.НаименованиеМарки = КодЧЗ.Наименование;
		
		//		МассивКодов.Добавить(КодЧЗ);
		//		
		//	КонецЕсли;
		//	
		//	МассивВозврата.Добавить(СтруктураВозврата);
		//	
		//КонецЦикла;
		ЗСБ = СтруктураДанныхНоменклатуры.ЗСБ;
		
		// Кельманов А.В. - Оптимизация работы - 2025.04.30 {
		//ЛСК = Документы.ЛистСборкиКомплектовЧЗ.ПолучитьЛСКДляFBS(ЗСБ);
		ЛСК = Документы.ЛистСборкиКомплектовЧЗ.ПолучитьЛСКДляFBS(ЗСБ, УзелТСД, СборщикКомплектаТСД);
		// Кельманов А.В. - Оптимизация работы - 2025.04.30 }
		
		ТаблицаДляПолученияКодов = Новый ТаблицаЗначений;
		ТаблицаДляПолученияКодов.Колонки.Добавить("Номенклатура");
		ТаблицаДляПолученияКодов.Колонки.Добавить("Количество");
		
		НовСтрПолучениеКодов = ТаблицаДляПолученияКодов.Добавить();
		НовСтрПолучениеКодов.Номенклатура = ТекНоменклатура;
		НовСтрПолучениеКодов.Количество = ТекКоличество;
		
		ДопПараметры = Новый Структура("Статус, ТипКода, Добавлять",
		Перечисления.СтатусыКодовМаркировкиФакт.ГотовКПечати, Перечисления.ТипыКодовМаркировки.Товар, Истина);
		
		рПолучения = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыШтук(ТаблицаДляПолученияКодов, ЛСК, ДопПараметры);		
		
		Если рПолучения.Успешно Тогда
			
			// Кельманов А.В. - Исправление ошибки - 2025.05.08 {
			//Для Каждого ШтрихкодУпаковки Из рПолучения.Данные Цикл
			Для Каждого СтрокаДанных Из рПолучения.Данные Цикл
				
				Для Каждого ШтрихкодУпаковки Из СтрокаДанных.Значение Цикл
					// Кельманов А.В. - Исправление ошибки - 2025.05.08 }
					
					// Кельманов А.В. - HELP-8233 - 2025.12.17 {
					//СтруктураВозврата = Новый Структура("УИДКодаЧЗ, УИДНоменклатуры, МаркаЧЗ, НаименованиеМарки, Количество, Количество1, Номенклатура, ТипШК, Успех, Ошибки");
					СтруктураВозврата = Новый Структура("УИДКодаЧЗ, УИДНоменклатуры, МаркаЧЗ, НаименованиеМарки, Количество, Количество1, Номенклатура, ТипШК, ТипУпаковки, ЗначениеШтрихкода, Успех, Ошибки");
					// Кельманов А.В. - HELP-8233 - 2025.12.17 }
					
					СтруктураВозврата.Успех = Истина;
					СтруктураВозврата.Ошибки = "";
					СтруктураВозврата.Номенклатура = ТекНоменклатура;
					СтруктураВозврата.ТипШК = ТекТипШК;
					СтруктураВозврата.УИДНоменклатуры = ТекНоменклатура.УникальныйИдентификатор();
					СтруктураВозврата.Количество = 1;
					СтруктураВозврата.Количество1 = 1;
					
					СтруктураВозврата.МаркаЧЗ = ШтрихкодУпаковки;
					СтруктураВозврата.УИДКодаЧЗ = ШтрихкодУпаковки.УникальныйИдентификатор();
					СтруктураВозврата.НаименованиеМарки = ШтрихкодУпаковки.Наименование;
					СтруктураВозврата.ТипУпаковки = ШтрихкодУпаковки.ТипУпаковки; // Кельманов А.В. - HELP-8233 - 2025.12.17
					СтруктураВозврата.ЗначениеШтрихкода = ШтрихкодУпаковки.ЗначениеШтрихКода; // Кельманов А.В. - Исправление ошибки - 2025.12.25
					
					МассивВозврата.Добавить(СтруктураВозврата);
					
					// Кельманов А.В. - Исправление ошибки - 2025.05.08 {
				КонецЦикла;
				// Кельманов А.В. - Исправление ошибки - 2025.05.08 }
				
			КонецЦикла;
			
		Иначе
			
			// Кельманов А.В. - HELP-8233 - 2025.12.17 {
			//СтруктураВозврата = Новый Структура("УИДКодаЧЗ, УИДНоменклатуры, МаркаЧЗ, НаименованиеМарки, Количество, Количество1, Номенклатура, ТипШК, Успех, Ошибки");
			СтруктураВозврата = Новый Структура("УИДКодаЧЗ, УИДНоменклатуры, МаркаЧЗ, НаименованиеМарки, Количество, Количество1, Номенклатура, ТипШК, ТипУпаковки, ЗначениеШтрихкода, Успех, Ошибки");
			// Кельманов А.В. - HELP-8233 - 2025.12.17 }
			
			СтруктураВозврата.Успех = Ложь;
			СтруктураВозврата.Ошибки = СтрСоединить(рПолучения.Ошибки, Символы.ПС);
			
			МассивВозврата.Добавить(СтруктураВозврата);
			
		КонецЕсли; 
		// Кельманов А.В. - оптимизация работы - 2025.03.27 }
		
		Ответ = Сериализовать(Новый ХранилищеЗначения(Сериализовать(МассивВозврата), Новый СжатиеДанных(9)));
		
		Возврат Ответ;
		
	Иначе
		
		// Кельманов А.В. - HELP-8233 - 2025.12.17 {
		//СтруктураВозврата = Новый Структура("УИДКодаЧЗ, УИДНоменклатуры, МаркаЧЗ, НаименованиеМарки, Количество, Количество1, Номенклатура, ТипШК, Успех, Ошибки");
		СтруктураВозврата = Новый Структура("УИДКодаЧЗ, УИДНоменклатуры, МаркаЧЗ, НаименованиеМарки, Количество, Количество1, Номенклатура, ТипШК, ТипУпаковки, ЗначениеШтрихкода, Успех, Ошибки");
		// Кельманов А.В. - HELP-8233 - 2025.12.17 }
		
		СтруктураВозврата.Успех = Ложь;
		СтруктураВозврата.Ошибки = "Ошибка в обработке данных номенклатуры при получении свободных кодов ЧЗ";
		
		МассивВозврата.Добавить(СтруктураВозврата);
		
		Ответ = Сериализовать(Новый ХранилищеЗначения(Сериализовать(МассивВозврата), Новый СжатиеДанных(9)));
		
		Возврат Ответ;
		
	КонецЕсли;
	
КонецФункции

// Кельманов А.В. - MARK-766 - 2025.02.02
Функция ДобавитьСпайкуВЛСКИЗаписатьСвязкуСНомеромЗаказа(ДанныеСпайки) Экспорт
	
	МассивДанныхСпайки = Десериализовать(Десериализовать(ДанныеСпайки).Получить());
	
	Если МассивДанныхСпайки <> Неопределено Тогда
		
		НомерЗаказаFBS = МассивДанныхСпайки[0].НомерЗаказаFBS;
		ЗСБ = МассивДанныхСпайки[0].ЗСБ;
		КодНабора = МассивДанныхСпайки[0].КодНабора;
		
		Результат = Документы.ЛистСборкиКомплектовЧЗ.ДобавитьСпайкуFBSВЛСК(МассивДанныхСпайки, КодНабора, ЗСБ); 
		
		Если Не Результат.Успех Тогда
			
			Ошибки = "Не удалось добавить спайку ЧЗ. Нужно исправить ошибки и отсканировать спайку заново" + Символы.ПС + Результат.Ошибки;
			
			Возврат Ошибки;
			
		КонецЕсли;
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗаданиеНаСборкуКомплектовЧЗ.ДокОснование.Контрагент КАК Контрагент
		|ИЗ
		|	Документ.ЗаданиеНаСборкуКомплектовЧЗ КАК ЗаданиеНаСборкуКомплектовЧЗ
		|ГДЕ
		|	ЗаданиеНаСборкуКомплектовЧЗ.Ссылка = &ЗСБ";
		
		Запрос.УстановитьПараметр("ЗСБ", ЗСБ);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Контрагент = Выборка.Контрагент;
			
			Если ЗначениеЗаполнено(Контрагент) Тогда
				
				Ошибки = ПроверитьЗаписатьСвязкуСНомеромЗаказа(Контрагент, НомерЗаказаFBS, КодНабора);
				
				Возврат Ошибки;
				
			Иначе
				
				Ошибки = "Не удалось определить контрагента по ЗСБ при записи в регистр ""Связь номеров заказа FBS и кодов ЧЗ спайки""";
				
				Возврат Ошибки;
				
			КонецЕсли;
			
		Иначе
			
			Ошибки = "Не удалось определить контрагента по ЗСБ при записи в регистр ""Связь номеров заказа FBS и кодов ЧЗ спайки""";
			
			Возврат Ошибки;
			
		КонецЕсли;
		
	Иначе
		
		Ошибки = "Ошибка в обработке данных спайки при добавлении в ЛСК";
		
		Возврат Ошибки;
		
	КонецЕсли;
	
КонецФункции

// Кельманов А.В. - HELP-4016 - 2025.04.22
Функция ЗаписатьКодыЧЗВЛСК(ДанныеДляПередачи, ДанныеКодыСпаекИНомераЗаказов) Экспорт
	
	Ошибки = "";
	
	МассивДанныхПоКодамЧЗ = Десериализовать(Десериализовать(ДанныеДляПередачи).Получить());
	МассивДанныхПоКодамСпаекИНомерамЗаказов = Десериализовать(Десериализовать(ДанныеКодыСпаекИНомераЗаказов).Получить());
	
	Если МассивДанныхПоКодамЧЗ <> Неопределено Тогда
		
		ЗСБ = МассивДанныхПоКодамЧЗ[0].ЗСБ;
		
		// Кельманов А.В. - Оптимизация работы - 2025.04.30 {
		УзелТСД = Неопределено;
		
		Если МассивДанныхПоКодамЧЗ[0].Свойство("КодУзла") Тогда
			
			УзелТСД = ПланыОбмена.МобильныеТСД.НайтиПоКоду(МассивДанныхПоКодамЧЗ[0].КодУзла);
			
		КонецЕсли;
		
		СборщикКомплектаТСД = Неопределено;
		
		Если МассивДанныхПоКодамЧЗ[0].Свойство("Наборщик") Тогда
			
			СборщикКомплектаТСД = МассивДанныхПоКодамЧЗ[0].Наборщик;
			
		КонецЕсли;		
		// Кельманов А.В. - Оптимизация работы - 2025.04.30 }
		
		МассивОшибок = Новый Массив;
		
		// Кельманов А.В. - Оптимизация работы - 2025.04.30 {
		//ЛСК = Документы.ЛистСборкиКомплектовЧЗ.ПолучитьЛСКДляFBS(ЗСБ);
		ЛСК = Документы.ЛистСборкиКомплектовЧЗ.ПолучитьЛСКДляFBS(ЗСБ, УзелТСД, СборщикКомплектаТСД);
		// Кельманов А.В. - Оптимизация работы - 2025.04.30 }
		
		ЛСКОбъект = ЛСК.ПолучитьОбъект();
		
		// Кельманов А.В. - Оптимизация работы - 2025.05.07 {
		ЛСКОбъект.ДатаОкончанияСканирования = ТекущаяДата();
		
		Если Не ЗначениеЗаполнено(ЛСКОбъект.ДатаНачалаСканирования) И МассивДанныхПоКодамЧЗ[0].Свойство("ДатаНачалаСканирования") Тогда
			
			ЛСКОбъект.ДатаНачалаСканирования = МассивДанныхПоКодамЧЗ[0].ДатаНачалаСканирования;
			
		КонецЕсли;
		// Кельманов А.В. - Оптимизация работы - 2025.05.07 }
		
		Для Каждого СтрокаДанных Из МассивДанныхПоКодамСпаекИНомерамЗаказов Цикл
			
			Если ЛСКОбъект.ШтрихкодыУпаковок.Найти(СтрокаДанных.КодНабора, "ШтрихкодКомплекта") <> Неопределено Тогда
				
				МассивОшибок.Добавить("Обнаружен дубль набора в ЛСК " + ЛСКОбъект.Номер + " по коду " + СтрокаДанных.КодНабора);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого СтрокаДанных Из МассивДанныхПоКодамЧЗ Цикл
			
			КодЧЗ = СтрокаДанных.МаркаЧЗ;
			
			Если ЛСКОбъект.ШтрихкодыУпаковок.Найти(КодЧЗ, "ШтрихкодУпаковки") <> Неопределено Тогда
				
				МассивОшибок.Добавить("Обнаружен дубль комплектующей в ЛСК " + ЛСКОбъект.Номер + " по коду " + КодЧЗ);
				
				Продолжить;
				
			КонецЕсли;
			
			СтрТЧ = ЛСКОбъект.ШтрихкодыУпаковок.Добавить();
			СтрТЧ.ДатаФормированияКомплекта = ТекущаяДата();
			СтрТЧ.Комплектующее = СтрокаДанных.Номенклатура;
			СтрТЧ.ШтрихкодКомплекта = СтрокаДанных.КодНабора;
			СтрТЧ.ШтрихкодУпаковки = КодЧЗ;	
			СтрТЧ.КодКомплектующегоНеНанесен = СтрокаДанных.НанесенияНеБыло;
			СтрТЧ.КодКомплектаПодтвержденСканированием = Истина; // Кельманов А.В. - Оптимизация работы - 2026.03.26
			
		КонецЦикла;
		
		Если МассивОшибок.Количество() = 0 Тогда
			
			Попытка
				
				ЛСКОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
			Исключение
				
				МассивОшибок.Добавить("Не удалось записать документ по причине " + ОписаниеОшибки());
				
			КонецПопытки;
			
		КонецЕсли; 
		
		Если МассивОшибок.Количество() > 0 Тогда
			
			Ошибки = "Не удалось записать коды ЧЗ в ЛСК" + Символы.ПС + СтрСоединить(МассивОшибок, Символы.ПС);
			
		КонецЕсли;
		
	Иначе
		
		Ошибки = "Ошибка в обработке данных при записи кодов ЧЗ в ЛСК";
		
	КонецЕсли;
	
	Возврат Ошибки;
	
КонецФункции

// Кельманов А.В. - MARK-766 - 2025.02.02
Функция ПроверитьЗаписатьСвязкуСНомеромЗаказа(Контрагент, НомерЗаказаFBS, КодСпайки)
	
	ТекстОшибки = "";
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	СвязьНомеровЗаказаFBSИКодовЧЗСпайки.Контрагент КАК Контрагент,
	|	СвязьНомеровЗаказаFBSИКодовЧЗСпайки.НомерЗаказаFBS КАК НомерЗаказаFBS,
	|	СвязьНомеровЗаказаFBSИКодовЧЗСпайки.КодСпайки КАК КодСпайки
	|ИЗ
	|	РегистрСведений.СвязьНомеровЗаказаFBSИКодовЧЗСпайки КАК СвязьНомеровЗаказаFBSИКодовЧЗСпайки
	|ГДЕ
	|	(СвязьНомеровЗаказаFBSИКодовЧЗСпайки.Контрагент <> &Контрагент
	|			ИЛИ СвязьНомеровЗаказаFBSИКодовЧЗСпайки.НомерЗаказаFBS <> &НомерЗаказаFBS)
	|	И СвязьНомеровЗаказаFBSИКодовЧЗСпайки.КодСпайки = &КодСпайки";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("НомерЗаказаFBS", НомерЗаказаFBS);
	Запрос.УстановитьПараметр("КодСпайки", КодСпайки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ТекстОшибки = "Для кода спайки " + КодСпайки + " уже установлена связка с контрагентом " 
		+ Выборка.Контрагент + " и номером заказа FBS " + Выборка.НомерЗаказаFBS;
		
		Возврат ТекстОшибки;
		
	КонецЕсли;
	
	Запись = РегистрыСведений.СвязьНомеровЗаказаFBSИКодовЧЗСпайки.СоздатьМенеджерЗаписи();
	
	Запись.Контрагент = Контрагент;
	Запись.НомерЗаказаFBS = НомерЗаказаFBS;
	
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		
		Если Запись.КодСпайки <> КодСпайки Тогда
			
			ТекстОшибки = "Для контрагента " + Контрагент + " и номера заказа FBS " 
			+ НомерЗаказаFBS + " уже установлена связка с кодом спайки " + Запись.КодСпайки;
			
		КонецЕсли;
		
	Иначе
		
		Запись.Контрагент = Контрагент;
		Запись.НомерЗаказаFBS = НомерЗаказаFBS;
		Запись.КодСпайки = КодСпайки;
		Запись.Записать();
		
	КонецЕсли;
	
	Возврат ТекстОшибки;
	
КонецФункции

// Кельманов А.В. - ASU-2104 - 2025.03.22
// Кельманов А.В. - HELP-3850 - 2025.04.07 {
//Функция СоздатьПолучитьЛСК_ДляТСД(УзелОбмена, Ошибки, ДанныеДляПолученияЛСК) Экспорт
Функция СоздатьПолучитьЛСК_ДляТСД(УзелОбмена, Ошибки, СтруктураДопПараметров) Экспорт
	// Кельманов А.В. - HELP-3850 - 2025.04.07 }
	
	// Кельманов А.В. - HELP-3850 - 2025.04.07 {
	//СтруктураДанныхДляПолученияЛСК = Десериализовать(Десериализовать(ДанныеДляПолученияЛСК).Получить());
	//
	//Результат = ОбменСТСД.ЗарегистрироватьЛСК_ДляТСД(УзелОбмена, Ошибки, СтруктураДанныхДляПолученияЛСК);
	Наборщик = Неопределено;
	
	ШКСотрудника = "";
	
	Если СтруктураДопПараметров.Свойство("ШКСотрудника") Тогда
		
		ШКСотрудника = СтруктураДопПараметров.ШКСотрудника;
		Наборщик = Справочники.ФизическиеЛица.НайтиПоРеквизиту("ШтрихКод", ШКСотрудника);
		
	КонецЕсли;
	
	СтруктураДанныхДляПолученияЛСК = Десериализовать(Десериализовать(СтруктураДопПараметров.ДополнительныеДанные).Получить());
	
	Результат = ОбменСТСД.ЗарегистрироватьЛСК_ДляТСД(УзелОбмена, Ошибки, СтруктураДанныхДляПолученияЛСК, Наборщик);
	// Кельманов А.В. - HELP-3850 - 2025.04.07 }
	
	Возврат Результат;
	
КонецФункции

// Кельманов А.В. - ASU-2104 - 2025.03.22
Функция ПолучитьДанныеКомплектующихСпайки_ДляТСД(ДанныеДляПолученияКомплектующих) Экспорт
	
	МассивВозврата = Новый Массив;
	
	Ошибки = ""; // Кельманов А.В. - Оптимизация работы - 2025.06.30
	
	СтруктураДанныхДляПолученияКомплектующих = Десериализовать(Десериализовать(ДанныеДляПолученияКомплектующих).Получить());
	
	Спайка = Неопределено;
	
	Если ЗначениеЗаполнено(СтруктураДанныхДляПолученияКомплектующих.ЛСК) Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта.Владелец КАК ШтрихкодКомплектаВладелец
		|ИЗ
		|	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
		|ГДЕ
		|	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка = &ЛСК";
		
		Запрос.УстановитьПараметр("ЛСК", СтруктураДанныхДляПолученияКомплектующих.ЛСК);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Спайка = Выборка.ШтрихкодКомплектаВладелец;
			
			// Кельманов А.В. - Оптимизация работы - 2025.06.30 {
		Иначе 
			
			Ошибки = "Ошибка: В ЛСК не заполнена ТЧ ШтрихкодыУпаковок";
			
			Возврат Ошибки;
			
			// Кельманов А.В. - Оптимизация работы - 2025.06.30 }
			
		КонецЕсли;
		
	Иначе
		
		// Кельманов А.В. - Оптимизация работы - 2025.06.30 {
		//Спайка = НайтиТоварПоШтрихКоду(СтруктураДанныхДляПолученияКомплектующих.ШКСпайкиЛинейный);
		Ошибки = "Ошибка: Не удалось определить ЛСК для получения данных по комплектующим";
		
		Возврат Ошибки;
		// Кельманов А.В. - Оптимизация работы - 2025.06.30 }
		
	КонецЕсли;
	
	ЛСК = СтруктураДанныхДляПолученияКомплектующих.ЛСК;
	
	Запрос = Новый Запрос;
	
	// Кельманов А.В. - HELP-4849 - 2026.04.28 {
	//Запрос.Текст = "ВЫБРАТЬ
	//|	ЛистСборкиКомплектовЧЗ.ДокОснование.ДокОснование КАК Накладная
	//|ПОМЕСТИТЬ ВТ_РНК
	//|ИЗ
	//|	Документ.ЛистСборкиКомплектовЧЗ КАК ЛистСборкиКомплектовЧЗ
	//|ГДЕ
	//|	ЛистСборкиКомплектовЧЗ.Ссылка = &ЛСК
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	РасходнаяНакладнаяКомплектующие.Продукция КАК Продукция,
	//|	РасходнаяНакладнаяКомплектующие.Номенклатура КАК Номенклатура,
	//|	РасходнаяНакладнаяКомплектующие.Количество КАК Количество,
	//|	РасходнаяНакладнаяКомплектующие.КоличествоПродукции КАК КоличествоПродукции,
	//|	РасходнаяНакладнаяКомплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар) КАК ЭтоТовар
	//|ИЗ
	//|	ВТ_РНК КАК ВТ_РНК
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
	//|		ПО ВТ_РНК.Накладная = РасходнаяНакладнаяКомплектующие.Ссылка
	//|ГДЕ
	//|	РасходнаяНакладнаяКомплектующие.Продукция = &Продукция";
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛистСборкиКомплектовЧЗ.ДокОснование.ДокОснование КАК Накладная
	               |ПОМЕСТИТЬ ВТ_Накладная
	               |ИЗ
	               |	Документ.ЛистСборкиКомплектовЧЗ КАК ЛистСборкиКомплектовЧЗ
	               |ГДЕ
	               |	ЛистСборкиКомплектовЧЗ.Ссылка = &ЛСК
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходнаяНакладнаяКомплектующие.Ссылка КАК Накладная,
	               |	РасходнаяНакладнаяКомплектующие.Продукция КАК Продукция,
	               |	РасходнаяНакладнаяКомплектующие.Номенклатура КАК Номенклатура,
	               |	РасходнаяНакладнаяКомплектующие.Количество КАК Количество,
	               |	РасходнаяНакладнаяКомплектующие.КоличествоПродукции КАК КоличествоПродукции,
	               |	РасходнаяНакладнаяКомплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар) КАК ЭтоТовар
	               |ИЗ
	               |	ВТ_Накладная КАК ВТ_Накладная
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
	               |		ПО ВТ_Накладная.Накладная = РасходнаяНакладнаяКомплектующие.Ссылка
	               |ГДЕ
	               |	РасходнаяНакладнаяКомплектующие.Продукция = &Продукция
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КомплектацияКомплектующие.Ссылка,
	               |	КомплектацияКомплектующие.Продукция,
	               |	КомплектацияКомплектующие.Номенклатура,
	               |	КомплектацияКомплектующие.Количество,
	               |	КомплектацияТовары.Количество,
	               |	КомплектацияКомплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	               |ИЗ
	               |	ВТ_Накладная КАК ВТ_Накладная
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Комплектация.Товары КАК КомплектацияТовары
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Комплектация.Комплектующие КАК КомплектацияКомплектующие
	               |			ПО КомплектацияТовары.Ссылка = КомплектацияКомплектующие.Ссылка
	               |				И КомплектацияТовары.Номенклатура = КомплектацияКомплектующие.Продукция
	               |		ПО ВТ_Накладная.Накладная = КомплектацияТовары.Ссылка
	               |ГДЕ
	               |	КомплектацияТовары.Номенклатура = &Продукция";
	// Кельманов А.В. - HELP-4849 - 2026.04.28 }
	
	Запрос.УстановитьПараметр("ЛСК", ЛСК);
	Запрос.УстановитьПараметр("Продукция", Спайка);
	
	ТЗ_Комплектующие = Запрос.Выполнить().Выгрузить();
	
	// Кельманов А.В. - HELP-4849 - 2026.04.28 {
	//ТЗ_Продукция = ТЗ_Комплектующие.Скопировать();
	//
	//ТЗ_Продукция.Свернуть(, "КоличествоПродукции");
	//
	//// Кельманов А.В. - Оптимизация работы - 2025.06.30 {
	//Если ТЗ_Продукция.Количество() = 0 Тогда
	//	
	//	Ошибки = "Ошибка: Не удалось получить актуальные данные по комплектующим";
	//	
	//	Возврат Ошибки;
	//	
	//КонецЕсли;
	//// Кельманов А.В. - Оптимизация работы - 2025.06.30 }
	//
	//КоличествоПродукции = ТЗ_Продукция[0].КоличествоПродукции;
	Если ТЗ_Комплектующие.Количество() = 0 Тогда
		
		Ошибки = "Ошибка: Не удалось получить актуальные данные по комплектующим";
		
		Возврат Ошибки;
		
	КонецЕсли;
	
	Если ТипЗнч(ТЗ_Комплектующие[0].Накладная) = Тип("ДокументСсылка.Комплектация") Тогда
		
		КоличествоПродукции = ТЗ_Комплектующие[0].КоличествоПродукции;
		
	Иначе
		
		ТЗ_Продукция = ТЗ_Комплектующие.Скопировать();
		
		ТЗ_Продукция.Свернуть(, "КоличествоПродукции");
		
		Если ТЗ_Продукция.Количество() = 0 Тогда
			
			Ошибки = "Ошибка: Не удалось получить актуальные данные по комплектующим";
			
			Возврат Ошибки;
			
		КонецЕсли;
		
		КоличествоПродукции = ТЗ_Продукция[0].КоличествоПродукции;
		
	КонецЕсли;
	// Кельманов А.В. - HELP-4849 - 2026.04.28 }
	
	Для Каждого Стр Из ТЗ_Комплектующие Цикл
		
		Если Стр.ЭтоТовар Тогда
			
			СтруктураВозврата = Новый Структура("Продукция, Номенклатура, Количество", 
			Стр.Продукция, Стр.Номенклатура, Стр.Количество / КоличествоПродукции);
			
			МассивВозврата.Добавить(СтруктураВозврата);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Ответ = Сериализовать(Новый ХранилищеЗначения(Сериализовать(МассивВозврата), Новый СжатиеДанных(9)));
	
	Возврат Ответ;
	
КонецФункции

// Кельманов А.В. - ASU-2104 - 2025.03.22
Функция ДобавитьСпайкуВВыбранныйЛСК_СУдалениемСтрокСПустымКодомКомплектующего(ДанныеСпайки) Экспорт
	
	Ошибки = "";
	
	МассивДанныхСпайки = Десериализовать(Десериализовать(ДанныеСпайки).Получить());
	
	Если МассивДанныхСпайки <> Неопределено Тогда
		
		ЛСК = МассивДанныхСпайки[0].ЛСК;
		КодНабора = МассивДанныхСпайки[0].КодНабора;
		
		ЛСКОбъект = ЛСК.ПолучитьОбъект();
		
		ПараметрыПоиска = Новый Структура("ШтрихкодКомплекта, ШтрихкодУпаковки", КодНабора, Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка());
		
		МассивСтрокДляУдаления = ЛСКОбъект.ШтрихкодыУпаковок.НайтиСтроки(ПараметрыПоиска);
		
		Для Каждого Строка Из МассивСтрокДляУдаления Цикл
			ЛСКОбъект.ШтрихкодыУпаковок.Удалить(Строка);
		КонецЦикла;
		
		// Это нужно перенести в Документы.ЛистСборкиКомплектовЧЗ.ДобавитьСпайкуFBSВЛСК - добавить вариант по конкретному ЛСК
		МассивОшибок = Новый Массив;
		
		Если ЛСКОбъект.ШтрихкодыУпаковок.Найти(КодНабора, "ШтрихкодКомплекта") <> Неопределено Тогда
			МассивОшибок.Добавить("Обнаружен дубль набора в ЛСК " + ЛСКОбъект.Номер + " по коду " + КодНабора);
		КонецЕсли;
		
		Для Каждого СтрокаТЗ Из МассивДанныхСпайки Цикл
			
			КодЧЗ = СтрокаТЗ.МаркаЧЗ;
			
			Если Не ЗначениеЗаполнено(КодЧЗ) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЛСКОбъект.ШтрихкодыУпаковок.Найти(КодЧЗ, "ШтрихкодУпаковки") <> Неопределено Тогда
				МассивОшибок.Добавить("Обнаружен дубль комплектующей в ЛСК " + ЛСКОбъект.Номер + " по коду " + КодЧЗ);
				Продолжить;
			КонецЕсли;
			
			СтрТЧ = ЛСКОбъект.ШтрихкодыУпаковок.Добавить();
			
			СтрТЧ.ДатаФормированияКомплекта = ТекущаяДата();
			СтрТЧ.Комплектующее = СтрокаТЗ.Номенклатура;
			СтрТЧ.ШтрихкодКомплекта = КодНабора;
			СтрТЧ.ШтрихкодУпаковки = КодЧЗ;	
			СтрТЧ.КодКомплектующегоНеНанесен = СтрокаТЗ.НанесенияНеБыло; 
			
		КонецЦикла;
		
		Если МассивОшибок.Количество() = 0 Тогда
			
			Попытка
				ЛСКОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				МассивОшибок.Добавить("Не удалось записать документ по причине " + ОписаниеОшибки());
			КонецПопытки;
			
		КонецЕсли; 
		
		Если МассивОшибок.Количество() > 0 Тогда
			
			Ошибки = "Не удалось добавить спайку ЧЗ. Нужно исправить ошибки и отсканировать спайку заново" + Символы.ПС + СтрСоединить(МассивОшибок, Символы.ПС);
			
		КонецЕсли;
		
	Иначе
		
		Ошибки = "Ошибка в обработке данных спайки при добавлении в ЛСК";
		
	КонецЕсли;
	
	Возврат Ошибки;
	
КонецФункции

// Кельманов А.В. - ASU-2104 - 2025.03.22
Функция УдалитьВЛСКСтрокиСПустымиКодамиКомплектующих(ДанныеЛСК) Экспорт
	
	ТекстОшибки = "";
	
	СтруктураДанныхЛСК = Десериализовать(Десериализовать(ДанныеЛСК).Получить());
	
	ЛСК = СтруктураДанныхЛСК.ЛСК;
	
	Если ЗначениеЗаполнено(ЛСК) Тогда
		
		ЛСКОбъект = ЛСК.ПолучитьОбъект();
		
		ПараметрыПоиска = Новый Структура("ШтрихкодУпаковки", Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка());
		
		МассивСтрокДляУдаления = ЛСКОбъект.ШтрихкодыУпаковок.НайтиСтроки(ПараметрыПоиска);
		
		Для Каждого Строка Из МассивСтрокДляУдаления Цикл
			
			ЛСКОбъект.ШтрихкодыУпаковок.Удалить(Строка);
			
		КонецЦикла;
		
		Попытка
			
			ЛСКОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		Исключение
			
			ТекстОшибки = ОписаниеОшибки();
			
		КонецПопытки;
		
	КонецЕсли; 
	
	Возврат ТекстОшибки;
	
КонецФункции

// Кельманов А.В. - HELP-4022 - 2025.04.29

// Кельманов А.В. - HELP-4758 - 2025.05.22 {
//Функция ЗавершитьСборкуСпаекПоЛСК(ДанныеЛСК) Экспорт

// Кельманов А.В. - SNL-88 - 2026.04.18 {
//Функция ЗавершитьСборкуСпаекПоЛСК(ДанныеЛСК, ДанныеНоменклатурыДляБронированияКодов) Экспорт
Функция ЗавершитьСборкуСпаекПоЛСК(ДанныеЛСК, ДанныеНоменклатурыДляБронированияКодов, ДанныеТекущаяБригада) Экспорт
	// Кельманов А.В. - SNL-88 - 2026.04.18 }
	
	// Кельманов А.В. - HELP-4758 - 2025.05.22 }
	
	Ошибки = "";
	
	МассивТекущаяБригада = Десериализовать(Десериализовать(ДанныеТекущаяБригада).Получить()); // Кельманов А.В. - SNL-88 - 2026.04.18
	
	// Кельманов А.В. - HELP-4758 - 2025.05.22 {
	рПолучения = Неопределено;
	
	МассивДанныхНоменклатурыДляБронированияКодов = Десериализовать(Десериализовать(ДанныеНоменклатурыДляБронированияКодов).Получить());
	
	Если МассивДанныхНоменклатурыДляБронированияКодов <> Неопределено И МассивДанныхНоменклатурыДляБронированияКодов.Количество() > 0 Тогда
		
		ЛСК = МассивДанныхНоменклатурыДляБронированияКодов[0].ЛСК;
		
		ТаблицаДляПолученияКодов = Новый ТаблицаЗначений;
		ТаблицаДляПолученияКодов.Колонки.Добавить("Номенклатура");
		ТаблицаДляПолученияКодов.Колонки.Добавить("Количество");
		
		КоличествоИтог = 0; // Кельманов А.В. - Исправление ошибки - 2025.12.20
		
		Для Каждого СтрокаТЗ Из МассивДанныхНоменклатурыДляБронированияКодов Цикл
			
			НовСтрПолучениеКодов = ТаблицаДляПолученияКодов.Добавить();
			НовСтрПолучениеКодов.Номенклатура = СтрокаТЗ.Номенклатура;
			НовСтрПолучениеКодов.Количество = СтрокаТЗ.Количество;
			
			КоличествоИтог = КоличествоИтог + СтрокаТЗ.Количество; // Кельманов А.В. - Исправление ошибки - 2025.12.20
			
		КонецЦикла;		                                          
		
		// Кельманов А.В. - Исправление ошибки - Коллеги, подписывайте, пожалуйста, кто и зачем добавляет; на всякий случай - тут массив структур, а не ТЗ - 2025.12.20 {
		//ТекстСообщения = СтрШаблон("Строк бронирования: %1, всего штук: ",  МассивДанныхНоменклатурыДляБронированияКодов.Количество(), МассивДанныхНоменклатурыДляБронированияКодов.Итог("Количество"));
		//ЗаписатьВЛог("Отладка.ЗавершитьСборкуСпаекПоЛСК", ТекстСообщения, "Отладка");
		ТекстСообщения = СтрШаблон("Строк бронирования: %1, всего штук: %2",  МассивДанныхНоменклатурыДляБронированияКодов.Количество(), КоличествоИтог);
		ЗаписатьВЛог("Отладка.ЗавершитьСборкуСпаекПоЛСК", ТекстСообщения, "Отладка");
		// Кельманов А.В. - Исправление ошибки - Коллеги, подписывайте, пожалуйста, кто и зачем добавляет; на всякий случай - тут массив структур, а не ТЗ - 2025.12.20 }
		
		ДопПараметры = Новый Структура("Статус, ТипКода, Добавлять",
		Перечисления.СтатусыКодовМаркировкиФакт.ГотовКПечати, Перечисления.ТипыКодовМаркировки.Товар, Истина);
		
		рПолучения = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыШтук(ТаблицаДляПолученияКодов, ЛСК, ДопПараметры);		
		
		Если Не рПолучения.Успешно Тогда
			
			Ошибки = СтрСоединить(рПолучения.Ошибки, Символы.ПС);
			
			Возврат Ошибки;
			
		КонецЕсли; 
		
	КонецЕсли;
	// Кельманов А.В. - HELP-4758 - 2025.05.22 }
		
	МассивДанныхЛСК = Десериализовать(Десериализовать(ДанныеЛСК).Получить());
	
	Если МассивДанныхЛСК <> Неопределено Тогда
		
		ЛСК = МассивДанныхЛСК[0].ЛСК;
		
		ЛСКОбъект = ЛСК.ПолучитьОбъект();
		
		ЛСКОбъект.ШтрихкодыУпаковок.Очистить();
		
		Для Каждого СтрокаТЗ Из МассивДанныхЛСК Цикл
			
			СтрТЧ = ЛСКОбъект.ШтрихкодыУпаковок.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрТЧ, СтрокаТЗ);
			
			СтрТЧ.КодКомплектаПодтвержденСканированием = Истина; // Кельманов А.В. - Оптимизация работы - 2026.03.26

			СтрТЧ.ДатаФормированияКомплекта = ТекущаяДата();
			
		КонецЦикла;
		
		// Кельманов А.В. - HELP-4758 - 2025.05.22 {
		Если рПолучения <> Неопределено Тогда
			
			Для Каждого СтрокаТЗ Из МассивДанныхНоменклатурыДляБронированияКодов Цикл
				
				СтруктураПоиска = Новый Структура("Комплектующее, ШтрихкодУпаковки, КодКомплектующегоНеНанесен", СтрокаТЗ.Номенклатура, Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка(), Истина);
				
				СтрокиДляЗаполнения = ЛСКОбъект.ШтрихкодыУпаковок.НайтиСтроки(СтруктураПоиска);
				
				СтрокиДанных = рПолучения.Данные.Получить(СтрокаТЗ.Номенклатура);
				
				Если СтрокиДляЗаполнения.Количество() > СтрокиДанных.Количество() Тогда
					
					Ошибки = "По номенклатуре " + СтрокаТЗ.Номенклатура + " забронировано недостаточное количество кодов: " + СтрокиДанных.Количество()
					+ ". Необходимо кодов: " + СтрокиДляЗаполнения.Количество();
					
					Возврат Ошибки;
					
				КонецЕсли;
				
				Счётчик = 0;
				
				Для Каждого ШтрихкодУпаковки Из СтрокиДанных Цикл
					
					СтрокиДляЗаполнения[Счётчик].ШтрихкодУпаковки = ШтрихкодУпаковки;
					
					Счётчик = Счётчик + 1;
					
				КонецЦикла;
				
			КонецЦикла;		
			
		КонецЕсли;
		// Кельманов А.В. - HELP-4758 - 2025.05.22 }
		
		// Кельманов А.В. - SNL-88 - 2026.04.18 {
		ЛСКОбъект.Бригада.Очистить();
		
		Если МассивТекущаяБригада <> Неопределено Тогда
			
			Для Каждого Сотрудник Из МассивТекущаяБригада Цикл
				
				СтрБригада = ЛСКОбъект.Бригада.Добавить();
				
				СтрБригада.Сотрудник = Сотрудник;
				
			КонецЦикла;
			
		КонецЕсли;
		// Кельманов А.В. - SNL-88 - 2026.04.18 }
		
		// Кельманов А.В. - ИЗМ-0000000124 - 2026.07.02 {
		//// Кельманов А.В. - Оптимизация работы - 2025.05.07 {
		//ЛСКОбъект.Завершен = Истина;
		//ЛСКОбъект.ДатаОкончанияСканирования = ТекущаяДата();
		//// Кельманов А.В. - Оптимизация работы - 2025.05.07 }
		Накладная = ПолучитьРеквизитШапки(ЛСКОбъект.ДокОснование, "ДокОснование", "Документ");
			
		СоздаватьЛП_ПоЛСК = СоздаватьЛП_ПоЛСК(Накладная); 
		
		Если Не СоздаватьЛП_ПоЛСК Тогда
			
			ЛСКОбъект.Завершен = Истина;
			ЛСКОбъект.ДатаОкончанияСканирования = ТекущаяДата();
			
		КонецЕсли;
		// Кельманов А.В. - ИЗМ-0000000124 - 2026.07.02 }
		
		Попытка
			
			ЛСКОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		Исключение
			
			Ошибки = "Не удалось записать документ по причине " + ОписаниеОшибки();
			
		КонецПопытки;
		
		// Кельманов А.В. - ИЗМ-0000000124 - 2026.07.02 {
		Если СоздаватьЛП_ПоЛСК И Не ЗначениеЗаполнено(Ошибки) И Не ЗначениеЗаполнено(ЛСКОбъект.ЛистНабора) Тогда
			
			ТипКороба = Неопределено;
			
			Если МассивДанныхЛСК[0].Свойство("ТипКороба") Тогда
				
				ТипКороба = МассивДанныхЛСК[0].ТипКороба;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТипКороба) Тогда
				
				ЛП = СоздатьЛП_ПоЛСК(ЛСКОбъект.Ссылка, Накладная, ТипКороба);
				
				Если ЗначениеЗаполнено(ЛП) Тогда
					
					ЛСКОбъект.ЛистНабора = ЛП;
					ЛСКОбъект.Завершен = Истина;
					ЛСКОбъект.ДатаОкончанияСканирования = ТекущаяДата();
					
					Попытка
						
						ЛСКОбъект.Записать(РежимЗаписиДокумента.Проведение);
						
					Исключение
						
						Ошибки = "Не удалось записать ЛСК при создании ЛП по причине " + ОписаниеОшибки();
						
					КонецПопытки;
					
				КонецЕсли;
				
			Иначе
				
				СоздаватьНовыйЛП = Ложь;
				
				ЛП = НайтиЛП_ПоЛСК(ЛСКОбъект.Ссылка, Накладная, СоздаватьНовыйЛП);
				
				Если ЗначениеЗаполнено(ЛП) Тогда
					
					ЛСКОбъект.ЛистНабора = ЛП;
					ЛСКОбъект.Завершен = Истина;
					ЛСКОбъект.ДатаОкончанияСканирования = ТекущаяДата();
					
					Попытка
						
						ЛСКОбъект.Записать(РежимЗаписиДокумента.Проведение);
						
					Исключение
						
						Ошибки = "Не удалось записать ЛСК при поиске ЛП по причине " + ОписаниеОшибки();
						
					КонецПопытки;
					
				КонецЕсли;
				
				Если СоздаватьНовыйЛП Тогда
					
					Ошибки = "Отсканируйте тип короба для создания листа переукладки!";
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		// Кельманов А.В. - ИЗМ-0000000124 - 2026.07.02 }
			
	Иначе
		
		Ошибки = "Ошибка в обработке данных при завершении сборки спаек по ЛСК";
		
	КонецЕсли;
	
	Возврат Ошибки;
	
КонецФункции

// Кельманов А.В. - HELP-5298 - 2025.06.11
Функция ПолучитьТекстZPLИзPDFПоНомеруЗаказа(НомерЗаказа) Экспорт
	
	СтруктураВозврата = Новый Структура("ZPL, Ошибки", "", "");
	
	КаталогФайловОзон = "\\srvfile-sk\FBS";
	КаталогФайловОзонZPL = КаталогФайловОзон + "\Ozon-ZPL-TXT";
	
	ИмяФайлаTXT = КаталогФайловОзонZPL + "\" + НомерЗаказа + ".txt";
	
	ФайлTXT = Новый Файл(ИмяФайлаTXT);
	
	Если ФайлTXT.Существует() Тогда
		
		Текст = Новый ЧтениеТекста(ИмяФайлаTXT);
		ZPL = Текст.Прочитать();	
		
		Если ZPL <> Неопределено Тогда
			
			СтруктураВозврата.ZPL = ZPL;
			
		Иначе
			
			СтруктураВозврата.Ошибки = "Не удалось прочитать текст ZPL для этикетки по номеру заказа " + НомерЗаказа + "!";
			
		КонецЕсли;
		
	Иначе
		
		СтруктураВозврата.Ошибки = "Для номера заказа " + НомерЗаказа + " не найден файл этикетки!";
		
	КонецЕсли;
	
	Ответ = Сериализовать(Новый ХранилищеЗначения(Сериализовать(СтруктураВозврата), Новый СжатиеДанных(9)));
	
	Возврат Ответ;
	
КонецФункции

// Кельманов А.В. - HELP-5158 - 2025.07.14
// Кухарь А.Ю.  17.02.2026 начало
// Функция ВыполнитьПроверкуКодовЧЗ_ДляЛН(ДанныеШКУпаковки, ДанныеШКНабора, ДанныеДокумента) Экспорт    
//OUT-201
Функция ВыполнитьПроверкуКодовЧЗ_ДляЛН(ДанныеШКУпаковки, ДанныеШКНабора, ДанныеДокумента,ДопПараметрыДляОтладки = Неопределено) Экспорт 
	// Кухарь А.Ю.  17.02.2026 конец
	
	
	Ошибки = "";
	
	МассивОшибок = Новый Массив;
	
	// Кухарь А.Ю.  17.02.2026 начало
	// Для того, чтобы вызвать для обычного ЛН при необходимости  
	//OUT-201
	//МассивШКУпаковки = Десериализовать(Десериализовать(ДанныеШКУпаковки).Получить());
	//МассивШКНабора = Десериализовать(Десериализовать(ДанныеШКНабора).Получить());
	//СтруктураДокумента = Десериализовать(Десериализовать(ДанныеДокумента).Получить());	
	//ЗНБ = СтруктураДокумента.ЗНБ;	
	//РеквизитыШапкиЗНБ = ПолучитьРеквизитыШапки(ЗНБ, "Накладная", "Документ");
	//Накладная = РеквизитыШапкиЗНБ.Накладная;	
	//ЛН = СтруктураДокумента.ЛН;       
	
	Если ТипЗнч(ДопПараметрыДляОтладки) = Тип("Структура") тогда 
		МассивШКУпаковки = ДопПараметрыДляОтладки.МассивШКУпаковки;
		МассивШКНабора = ДопПараметрыДляОтладки.МассивШКНабора;	
		ЗНБ	= ДопПараметрыДляОтладки.ЗНБ;
		ЛН	= ДопПараметрыДляОтладки.ЛН;	
	иначе	
		МассивШКУпаковки = Десериализовать(Десериализовать(ДанныеШКУпаковки).Получить());
		МассивШКНабора = Десериализовать(Десериализовать(ДанныеШКНабора).Получить());
		СтруктураДокумента = Десериализовать(Десериализовать(ДанныеДокумента).Получить());	
		ЗНБ = СтруктураДокумента.ЗНБ;	
		ЛН = СтруктураДокумента.ЛН;       		
	КонецЕсли;                   
	
	РеквизитыШапкиЗНБ = ПолучитьРеквизитыШапки(ЗНБ, "Накладная", "Документ");
	Накладная = РеквизитыШапкиЗНБ.Накладная;	

	// Кухарь А.Ю.  17.02.2026 конец
	
	
	// Кельманов А.В. - HELP-7030 - 2025.09.15 {
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК ШтрихкодУпаковки,
	|	ШтрихкодыУпаковокТоваров.СпособВводаВОборот КАК СпособВводаВОборот,
	|	ШтрихкодыУпаковокТоваров.ТипШК КАК ТипШК
	|ПОМЕСТИТЬ ВТ_КодыЧЗ
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	ШтрихкодыУпаковокТоваров.Ссылка В(&ШтрихкодыУпаковки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КодыЧЗ.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|	ВТ_КодыЧЗ.СпособВводаВОборот КАК СпособВводаВОборот,
	|	ЕСТЬNULL(СтатусыКМ_ФактСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	ВТ_КодыЧЗ КАК ВТ_КодыЧЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыКМ_Факт.СрезПоследних КАК СтатусыКМ_ФактСрезПоследних
	|		ПО ВТ_КодыЧЗ.ШтрихкодУпаковки = СтатусыКМ_ФактСрезПоследних.ШтрихКодУпаковки
	|ГДЕ
	|	НЕ ВЫБОР
	|				КОГДА ВТ_КодыЧЗ.СпособВводаВОборот В (ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.Импорт), ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.ПокупкаВРФ), ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.Производство))
	// Кельманов А.В. - HELP-9103 - 2026.03.10 {
	//|					ТОГДА ЕСТЬNULL(СтатусыКМ_ФактСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.ПустаяСсылка)) В (ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.ВОбороте), ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.Расформирован))
	|					ТОГДА ЕСТЬNULL(СтатусыКМ_ФактСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.ПустаяСсылка)) В (ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.ВОбороте), ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.Нанесен), ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.Расформирован))
	// Кельманов А.В. - HELP-9103 - 2026.03.10 }
	|							ИЛИ ЕСТЬNULL(СтатусыКМ_ФактСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.Списан)
	|								И ВТ_КодыЧЗ.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
	|				КОГДА ВТ_КодыЧЗ.СпособВводаВОборот В (ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.МаркировкаОстатков), ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.Перемаркировка))
	|					ТОГДА ЕСТЬNULL(СтатусыКМ_ФактСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.ПустаяСсылка)) В (ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.ВОбороте), ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.Нанесен), ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.Расформирован), ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.Распечатан))
	|							ИЛИ ЕСТЬNULL(СтатусыКМ_ФактСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.Списан)
	|								И ВТ_КодыЧЗ.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
	|			КОНЕЦ
	|	И НЕ(ЕСТЬNULL(СтатусыКМ_ФактСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.Вложен)
	|				И ВТ_КодыЧЗ.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	|				И &ОтгрузкаКомплектов)";
	
	Запрос.УстановитьПараметр("ШтрихкодыУпаковки", МассивШКУпаковки);
	
	ПолныеДанные = Документы.ПолныеДанныеЗаданияНабора.ПолучитьДокументПоЗНБ(ЗНБ);
	
	Если ЗначениеЗаполнено(ПолныеДанные) Тогда
		
		Запрос.УстановитьПараметр("ОтгрузкаКомплектов", ПолныеДанные.ОтгрузкаКомплектов);
		
	Иначе
		
		Запрос.УстановитьПараметр("ОтгрузкаКомплектов", Ложь);
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МассивОшибок.Добавить("Код: " + Выборка.ШтрихкодУпаковки + "; Статус: " + Выборка.Статус);
		
	КонецЦикла;

	// Кухарь А.Ю.  17.02.2026 начало
	// Оптимизация	OUT-201	
	//Запрос.Текст = "ВЫБРАТЬ
	//|	ЛН.Ссылка КАК ЛН
	//|ПОМЕСТИТЬ ВТ_ЛН
	//|ИЗ
	//|	Документ.ЛистНабора КАК ЛН
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ЗаданияНабора КАК ЛН_ЗН
	//|		ПО ЛН.Ссылка = ЛН_ЗН.Ссылка
	//|			И (ЛН_ЗН.ЗаданиеНабора = &ЗНБ)
	//|ГДЕ
	//|	ЛН.Проведен
	//|	И ЛН.Дата >= &Дата
	//|	И ЛН.Ссылка <> &Ссылка
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	ЛН
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Данные.ШтрихКодУпаковки КАК ШтрихКодУпаковки
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		ЛН_ШК.ШтрихкодУпаковки КАК ШтрихКодУпаковки
	//|	ИЗ
	//|		Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛН_ШК
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЛН КАК ВТ_ЛН
	//|			ПО (ВТ_ЛН.ЛН = ЛН_ШК.Ссылка)
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ВложенныеШК_1.Штрихкод
	//|	ИЗ
	//|		Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛН_ШК
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЛН КАК ВТ_ЛН
	//|			ПО (ВТ_ЛН.ЛН = ЛН_ШК.Ссылка)
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_1
	//|			ПО ЛН_ШК.ШтрихкодУпаковки = ВложенныеШК_1.Ссылка
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ВложенныеШК_2.Штрихкод
	//|	ИЗ
	//|		Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛН_ШК
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЛН КАК ВТ_ЛН
	//|			ПО (ВТ_ЛН.ЛН = ЛН_ШК.Ссылка)
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_1
	//|			ПО ЛН_ШК.ШтрихкодУпаковки = ВложенныеШК_1.Ссылка
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_2
	//|			ПО (ВложенныеШК_1.Штрихкод = ВложенныеШК_2.Ссылка)
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ВложенныеШК_3.Штрихкод
	//|	ИЗ
	//|		Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛН_ШК
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЛН КАК ВТ_ЛН
	//|			ПО (ВТ_ЛН.ЛН = ЛН_ШК.Ссылка)
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_1
	//|			ПО ЛН_ШК.ШтрихкодУпаковки = ВложенныеШК_1.Ссылка
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_2
	//|			ПО (ВложенныеШК_1.Штрихкод = ВложенныеШК_2.Ссылка)
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_3
	//|			ПО (ВложенныеШК_2.Штрихкод = ВложенныеШК_3.Ссылка)
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ВложенныеШК_4.Штрихкод
	//|	ИЗ
	//|		Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛН_ШК
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЛН КАК ВТ_ЛН
	//|			ПО (ВТ_ЛН.ЛН = ЛН_ШК.Ссылка)
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_1
	//|			ПО ЛН_ШК.ШтрихкодУпаковки = ВложенныеШК_1.Ссылка
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_2
	//|			ПО (ВложенныеШК_1.Штрихкод = ВложенныеШК_2.Ссылка)
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_3
	//|			ПО (ВложенныеШК_2.Штрихкод = ВложенныеШК_3.Ссылка)
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_4
	//|			ПО (ВложенныеШК_3.Штрихкод = ВложенныеШК_4.Ссылка)
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ВложенныеШК_5.Штрихкод
	//|	ИЗ
	//|		Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛН_ШК
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЛН КАК ВТ_ЛН
	//|			ПО (ВТ_ЛН.ЛН = ЛН_ШК.Ссылка)
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_1
	//|			ПО ЛН_ШК.ШтрихкодУпаковки = ВложенныеШК_1.Ссылка
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_2
	//|			ПО (ВложенныеШК_1.Штрихкод = ВложенныеШК_2.Ссылка)
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_3
	//|			ПО (ВложенныеШК_2.Штрихкод = ВложенныеШК_3.Ссылка)
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_4
	//|			ПО (ВложенныеШК_3.Штрихкод = ВложенныеШК_4.Ссылка)
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_5
	//|			ПО (ВложенныеШК_4.Штрихкод = ВложенныеШК_5.Ссылка)
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ШтрихкодыУпаковокТоваров.Ссылка
	//|	ИЗ
	//|		Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	//|	ГДЕ
	//|		ШтрихкодыУпаковокТоваров.Ссылка В(&ШтрихкодыУпаковки)
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ВложенныеШК_1.Штрихкод
	//|	ИЗ
	//|		Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_1
	//|			ПО ШтрихкодыУпаковокТоваров.Ссылка = ВложенныеШК_1.Ссылка
	//|	ГДЕ
	//|		ШтрихкодыУпаковокТоваров.Ссылка В(&ШтрихкодыУпаковки)
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ВложенныеШК_2.Штрихкод
	//|	ИЗ
	//|		Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_1
	//|			ПО ШтрихкодыУпаковокТоваров.Ссылка = ВложенныеШК_1.Ссылка
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_2
	//|			ПО (ВложенныеШК_1.Штрихкод = ВложенныеШК_2.Ссылка)
	//|	ГДЕ
	//|		ШтрихкодыУпаковокТоваров.Ссылка В(&ШтрихкодыУпаковки)
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ВложенныеШК_3.Штрихкод
	//|	ИЗ
	//|		Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_1
	//|			ПО ШтрихкодыУпаковокТоваров.Ссылка = ВложенныеШК_1.Ссылка
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_2
	//|			ПО (ВложенныеШК_1.Штрихкод = ВложенныеШК_2.Ссылка)
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_3
	//|			ПО (ВложенныеШК_2.Штрихкод = ВложенныеШК_3.Ссылка)
	//|	ГДЕ
	//|		ШтрихкодыУпаковокТоваров.Ссылка В(&ШтрихкодыУпаковки)
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ВложенныеШК_4.Штрихкод
	//|	ИЗ
	//|		Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_1
	//|			ПО ШтрихкодыУпаковокТоваров.Ссылка = ВложенныеШК_1.Ссылка
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_2
	//|			ПО (ВложенныеШК_1.Штрихкод = ВложенныеШК_2.Ссылка)
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_3
	//|			ПО (ВложенныеШК_2.Штрихкод = ВложенныеШК_3.Ссылка)
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_4
	//|			ПО (ВложенныеШК_3.Штрихкод = ВложенныеШК_4.Ссылка)
	//|	ГДЕ
	//|		ШтрихкодыУпаковокТоваров.Ссылка В(&ШтрихкодыУпаковки)
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ВложенныеШК_5.Штрихкод
	//|	ИЗ
	//|		Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_1
	//|			ПО ШтрихкодыУпаковокТоваров.Ссылка = ВложенныеШК_1.Ссылка
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_2
	//|			ПО (ВложенныеШК_1.Штрихкод = ВложенныеШК_2.Ссылка)
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_3
	//|			ПО (ВложенныеШК_2.Штрихкод = ВложенныеШК_3.Ссылка)
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_4
	//|			ПО (ВложенныеШК_3.Штрихкод = ВложенныеШК_4.Ссылка)
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШК_5
	//|			ПО (ВложенныеШК_4.Штрихкод = ВложенныеШК_5.Ссылка)
	//|	ГДЕ
	//|		ШтрихкодыУпаковокТоваров.Ссылка В(&ШтрихкодыУпаковки)) КАК Данные
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Данные.ШтрихКодУпаковки
	//|
	//|ИМЕЮЩИЕ
	//|	КОЛИЧЕСТВО(*) > 1";       
	//Запрос.УстановитьПараметр("ЗНБ", ЗНБ);	
 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛН.Ссылка КАК ЛН,
	               |	ЛН.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	               |ПОМЕСТИТЬ ВсеКодыЛН
	               |ИЗ
	               |	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛН
	               |ГДЕ
	               |	ЛН.Ссылка.Проведен
	               |	И ЛН.Ссылка.Дата >= &Дата
	               |	И ЛН.Ссылка.ДокОснование = &Накладная
	               |	И ЛН.Ссылка <> &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	НЕОПРЕДЕЛЕНО,
	               |	ШтрихкодыУпаковокТоваров.Ссылка
	               |ИЗ
	               |	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	               |ГДЕ
	               |	ШтрихкодыУпаковокТоваров.Ссылка В(&ШтрихкодыУпаковки)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ШтрихкодУпаковки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВсеКодыЛН.ШтрихкодУпаковки КАК ШтрихкодУпаковкиИсходный,
	               |	ВсеКодыЛН.ЛН КАК ЛН,
	               |	ЕСТЬNULL(КодыРазвернутые.Штрихкод, ВсеКодыЛН.ШтрихкодУпаковки) КАК ШтрихкодВложенныйУровень1
	               |ПОМЕСТИТЬ ВерхНиз1
	               |ИЗ
	               |	ВсеКодыЛН КАК ВсеКодыЛН
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК КодыРазвернутые
	               |		ПО ВсеКодыЛН.ШтрихкодУпаковки = КодыРазвернутые.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ШтрихкодВложенныйУровень1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВерхНиз1.ШтрихкодУпаковкиИсходный КАК ШтрихкодУпаковкиИсходный,
	               |	ВерхНиз1.ШтрихкодВложенныйУровень1 КАК ШтрихкодВложенныйУровень1,
	               |	ЕСТЬNULL(КодыРазвернутые.Штрихкод, ВерхНиз1.ШтрихкодВложенныйУровень1) КАК ШтрихкодВложенныйУровень2,
	               |	ВерхНиз1.ЛН КАК ЛН
	               |ПОМЕСТИТЬ ПолныйНаборКодовПоКолонкам
	               |ИЗ
	               |	ВерхНиз1 КАК ВерхНиз1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК КодыРазвернутые
	               |		ПО ВерхНиз1.ШтрихкодВложенныйУровень1 = КодыРазвернутые.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПолныйНаборКодовПоКолонкам.ШтрихкодВложенныйУровень2 КАК ПроверяемыйКод,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПолныйНаборКодовПоКолонкам.ЛН) КАК Вхождения
	               |ПОМЕСТИТЬ Дубли
	               |ИЗ
	               |	ПолныйНаборКодовПоКолонкам КАК ПолныйНаборКодовПоКолонкам
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПолныйНаборКодовПоКолонкам.ШтрихкодВложенныйУровень2
	               |
	               |ИМЕЮЩИЕ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПолныйНаборКодовПоКолонкам.ЛН) > 1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПолныйНаборКодовПоКолонкам.ШтрихкодУпаковкиИсходный КАК ШтрихкодУпаковки,
	               |	ПолныйНаборКодовПоКолонкам.ЛН КАК ЛН
	               |ИЗ
	               |	Дубли КАК Дубли
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПолныйНаборКодовПоКолонкам КАК ПолныйНаборКодовПоКолонкам
	               |		ПО Дубли.ПроверяемыйКод = ПолныйНаборКодовПоКолонкам.ШтрихкодВложенныйУровень2
	               |ГДЕ
	               |	ПолныйНаборКодовПоКолонкам.ШтрихкодУпаковкиИсходный В(&ШтрихкодыУпаковки)
				   |	и ПолныйНаборКодовПоКолонкам.ЛН <> &Ссылка";
	// Кухарь А.Ю.  17.02.2026 конец
	
	
	Запрос.УстановитьПараметр("Дата", ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования() - 30 * 24 * 3600);	
	Запрос.УстановитьПараметр("ШтрихкодыУпаковки", МассивШКУпаковки);                                             
	Запрос.УстановитьПараметр("Накладная",Накладная);
	
	
	Если ЗначениеЗаполнено(ЛН) Тогда
		Запрос.УстановитьПараметр("Ссылка", ЛН);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ЛН.Ссылка <> &Ссылка", "");             
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПолныйНаборКодовПоКолонкам.ЛН <> &Ссылка", "ПолныйНаборКодовПоКолонкам.ЛН <> Неопределено"); 
	КонецЕсли;    
		
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МассивОшибок.Добавить("Был ошибочно отсканирован вложенный код ЧЗ: " + Выборка.ШтрихкодУпаковки);
		
	КонецЦикла;
	// Кельманов А.В. - HELP-7030 - 2025.09.16 }
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец КАК Номенклатура,
	               |	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШКУпаковки,
	               |	ЛистНабораШтрихкодыУпаковок.Ссылка.ДокОснование КАК ДокОснование,
	               |	ЛистНабораШтрихкодыУпаковок.Ссылка.Дата КАК Дата,
	               |	ЛистНабораШтрихкодыУпаковок.НомерЗаказа КАК НомерЗаказа, 
				   // Кухарь А.Ю.  17.02.2026 начало  
				   //OUT-201
				   |	ЛистНабораШтрихкодыУпаковок.Ссылка КАК Лист		   
				   // Кухарь А.Ю.  17.02.2026 конец				   
	               |ИЗ
	               |	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	               |ГДЕ
	               |	ЛистНабораШтрихкодыУпаковок.Ссылка.Дата >= &Дата
	               |	И ЛистНабораШтрихкодыУпаковок.Ссылка.ДокОснование ССЫЛКА Документ.РасходнаяНакладная
	               |	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки В(&ШтрихкодыУпаковки)
	               |	И ЛистНабораШтрихкодыУпаковок.Ссылка <> &Ссылка
	               |	И ЛистНабораШтрихкодыУпаковок.Ссылка.Проведен
	               |	И ВЫРАЗИТЬ(ЛистНабораШтрихкодыУпаковок.Ссылка.ДокОснование КАК Документ.РасходнаяНакладная).Проведен
	               |	И НЕ ВЫРАЗИТЬ(ЛистНабораШтрихкодыУпаковок.Ссылка.ДокОснование КАК Документ.РасходнаяНакладная).СостояниеНакладной В (&СостоянияОтгружены)";
	
	СостоянияОтгружены = Новый Массив;
	СостоянияОтгружены.Добавить(Перечисления.СостоянияНакладной.ГотоваКОтгрузке);
	СостоянияОтгружены.Добавить(Перечисления.СостоянияНакладной.Отгружена);
	
	ДатаПроверки = Константы.ДатаЗапретаРедактирования.Получить();
	
	Запрос.УстановитьПараметр("СостоянияОтгружены", СостоянияОтгружены); 
	Запрос.УстановитьПараметр("Дата", ДатаПроверки - 86400*30);
	
	Запрос.УстановитьПараметр("ШтрихкодыУпаковки", МассивШКУпаковки);
	
	Если ЗначениеЗаполнено(ЛН) Тогда
		Запрос.УстановитьПараметр("Ссылка", ЛН);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ЛистНабораШтрихкодыУпаковок.Ссылка <> &Ссылка", "");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		//Валетов + 10,12,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8129 Добавил параметр 5 и заполнение
		МассивОшибок.Добавить(СтрШаблон("Марка %1 (%2) обнаружена в другом документе %3 %5 требуется убрать эту марку либо из неё, либо из %4", 
		// Кухарь А.Ю.  17.02.2026 начало       
		// OUT-201
		// 		Выборка.ШКУпаковки, Выборка.Номенклатура, Выборка.ДокОснование, Накладная, ?(ЗначениеЗаполнено(Выборка.НомерЗаказа),"Номер Заказа: "+Выборка.НомерЗаказа,"")));   
		Выборка.ШКУпаковки, Выборка.Номенклатура, Выборка.Лист, "текущего листа "+?(ЗначениеЗаполнено(ЛН)," - "+ЛН,""), ?(ЗначениеЗаполнено(Выборка.НомерЗаказа),"Номер Заказа: "+Выборка.НомерЗаказа,"")));   		 
		// Кухарь А.Ю.  17.02.2026 конец
		

		
		
	КонецЦикла;
	
	Если МассивШКНабора.Количество() > 0 Тогда 
		
		ЗапросСпайки = Новый Запрос;
		
		ЗапросСпайки.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛистНабораШтрихкодыУпаковок.ШтрихкодНабора.Владелец КАК Номенклатура,
		|	ЛистНабораШтрихкодыУпаковок.ШтрихкодНабора КАК ШКУпаковки,
		|	ЛистНабораШтрихкодыУпаковок.Ссылка.ДокОснование КАК ДокОснование,
		|	ЛистНабораШтрихкодыУпаковок.Ссылка.Дата КАК Дата,
		|	ЛистНабораШтрихкодыУпаковок.НомерЗаказа КАК НомерЗаказа
		|ИЗ
		|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		|ГДЕ
		|	ЛистНабораШтрихкодыУпаковок.Ссылка.Дата >= &Дата
		|	И ЛистНабораШтрихкодыУпаковок.Ссылка.ДокОснование ССЫЛКА Документ.РасходнаяНакладная
		|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодНабора В(&ШтрихкодыУпаковки)
		|	И ЛистНабораШтрихкодыУпаковок.Ссылка <> &Ссылка
		|	И ЛистНабораШтрихкодыУпаковок.Ссылка.Проведен
		|	И ВЫРАЗИТЬ(ЛистНабораШтрихкодыУпаковок.Ссылка.ДокОснование КАК Документ.РасходнаяНакладная).Проведен
		|	И НЕ ВЫРАЗИТЬ(ЛистНабораШтрихкодыУпаковок.Ссылка.ДокОснование КАК Документ.РасходнаяНакладная).СостояниеНакладной В (&СостоянияОтгружены)";
		
		СостоянияОтгружены = Новый Массив;
		СостоянияОтгружены.Добавить(Перечисления.СостоянияНакладной.ГотоваКОтгрузке);
		СостоянияОтгружены.Добавить(Перечисления.СостоянияНакладной.Отгружена);
		
		ДатаПроверки = Константы.ДатаЗапретаРедактирования.Получить();
		
		ЗапросСпайки.УстановитьПараметр("СостоянияОтгружены", СостоянияОтгружены); 
		ЗапросСпайки.УстановитьПараметр("Дата", ДатаПроверки - 86400*30);
		
		ЗапросСпайки.УстановитьПараметр("ШтрихкодыУпаковки", МассивШКНабора);
		
		Если ЗначениеЗаполнено(ЛН) Тогда
			ЗапросСпайки.УстановитьПараметр("Ссылка", ЛН);
		Иначе
			ЗапросСпайки.Текст = СтрЗаменить(ЗапросСпайки.Текст, "И ЛистНабораШтрихкодыУпаковок.Ссылка <> &Ссылка", "");
		КонецЕсли;
		
		ВыборкаСпайки = ЗапросСпайки.Выполнить().Выбрать();
		
		Пока ВыборкаСпайки.Следующий() Цикл
			//Валетов + 10,12,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8129 Добавил параметр 5 и заполнение	
			МассивОшибок.Добавить(СтрШаблон("Марка %1 (%2) обнаружена в другом документе %3 %5 требуется убрать эту марку либо из неё, либо из %4",
			ВыборкаСпайки.ШКУпаковки, ВыборкаСпайки.Номенклатура, ВыборкаСпайки.ДокОснование, Накладная, ?(ЗначениеЗаполнено(ВыборкаСпайки.НомерЗаказа),"Номер Заказа: "+ВыборкаСпайки.НомерЗаказа,"")));
			
		КонецЦикла
		
	КонецЕсли;
	
	Если МассивОшибок.Количество() > 0 Тогда
		
		Ошибки = СтрСоединить(МассивОшибок, Символы.ПС);
		
	КонецЕсли;
	
	Возврат Ошибки;
	
КонецФункции

// Кельманов А.В. - HELP-7030 - 2025.09.12
Функция ОбработатьЗагруженныйСТСДЛистНабора(ДанныеЛН) Экспорт
	
	Ошибки = "";
	
	МассивОшибок = Новый Массив;
	
	СтруктураДокумента = Десериализовать(Десериализовать(ДанныеЛН).Получить());
	
	РеквизитыШапки = СтруктураДокумента.РеквизитыШапки;
	МассивТовары = СтруктураДокумента.МассивТовары;
	МассивШтрихкодыУпаковок = СтруктураДокумента.МассивШтрихкодыУпаковок;
	МассивОшибкиСотрудников = СтруктураДокумента.МассивОшибкиСотрудников;
	МассивЗаданияНабора = СтруктураДокумента.МассивЗаданияНабора;
	МассивШтрихкодыКоробокДляАгрегации = СтруктураДокумента.МассивШтрихкодыКоробокДляАгрегации; // Кельманов А.В. - HELP-5128 - 2025.10.01
	
	ЛНУжеВыгружались = ОбщегоНазначения_ПИ.ЗНБУжеЗагружен(РеквизитыШапки.ЗНБ);
	
	Если ЛНУжеВыгружались Тогда
		
		Ошибки = "ЗНБ уже выгружался из ТСД в 1С. Нельзя выгружать листы набора в базу склада.";
		
		Возврат Ошибки;
		
	КонецЕсли;
	
	// Кельманов А.В. - Оптимизация работы - 2026.04.23 {
	//РеквизитыШапкиЗНБ = ПолучитьРеквизитыШапки(РеквизитыШапки.ЗНБ, "Накладная,СостояниеНакладной", "Документ");
	РеквизитыШапкиЗНБ = ПолучитьРеквизитыШапки(РеквизитыШапки.ЗНБ, "Накладная,СостояниеНакладной,Сектор", "Документ");
	// Кельманов А.В. - Оптимизация работы - 2026.04.23 }
	
	СостояниеЗНБ = РеквизитыШапкиЗНБ.СостояниеНакладной;
	
	Если СостояниеЗНБ <> Перечисления.СостоянияНакладной.ВНаборе И СостояниеЗНБ <> Перечисления.СостоянияНакладной.ОжиданиеСканирования  
		И СостояниеЗНБ <> Перечисления.СостоянияНакладной.Сканирование Тогда
		
		Ошибки = "Состояние ЗНБ: " + СостояниеЗНБ + ". Нельзя выгружать листы набора в базу склада.";
		
		Возврат Ошибки;
		
	КонецЕсли;		
	
	Накладная = РеквизитыШапкиЗНБ.Накладная;
	
	Новый_UID = Новый УникальныйИдентификатор(РеквизитыШапки.УИД);
	
	ЛН_НоваяСсылка = Документы.ЛистНабора.ПолучитьСсылку(Новый_UID);
	
	ЛН_Объект = ЛН_НоваяСсылка.ПолучитьОбъект();
	
	Если ЛН_Объект = Неопределено Тогда
		
		Если РеквизитыШапки.ПометкаУдаления Тогда
			
			Возврат Ошибки;
			
		КонецЕсли;
		
		ЛН_Объект = Документы.ЛистНабора.СоздатьДокумент();
		
		ЛН_Объект.УстановитьСсылкуНового(ЛН_НоваяСсылка);
		
	КонецЕсли;
	
	Если РеквизитыШапки.Свойство("КодУзла") Тогда
		
		ЛН_Объект.УзелТСД = ПланыОбмена.МобильныеТСД.НайтиПоКоду(РеквизитыШапки.КодУзла);
		
	КонецЕсли;
	
	ЛН_Объект.Товары.Очистить();
	ЛН_Объект.ШтрихкодыУпаковок.Очистить();
	ЛН_Объект.ОшибкиСотрудников.Очистить();
	ЛН_Объект.ЗаданияНабора.Очистить(); 
	ЛН_Объект.ШтрихкодыКоробокДляАгрегации.Очистить(); // Кельманов А.В. - Исправление ошибки - 2025.11.13
	
	ЗаполнитьЗначенияСвойств(ЛН_Объект, РеквизитыШапки);
	
	ЛН_Объект.РежимСканирования = Перечисления.РежимСканирования.Добавление; // Кельманов А.В. - HELP-8540 - 2026.01.16

	// Кельманов А.В. - Оптимизация работы - 2026.04.23 {
	Если Не ЗначениеЗаполнено(ЛН_Объект.Здание) Тогда
		
		ЛН_Объект.Здание = РеквизитыШапкиЗНБ.Сектор.Здание; 
		
	КонецЕсли;
	// Кельманов А.В. - Оптимизация работы - 2026.04.23 }
	
	Для Каждого Стр Из МассивТовары Цикл
		
		НовСтр = ЛН_Объект.Товары.Добавить();
		
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		
	КонецЦикла;
	
	Для Каждого Стр Из МассивШтрихкодыУпаковок Цикл
		
		НовСтр = ЛН_Объект.ШтрихкодыУпаковок.Добавить();
		
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		
	КонецЦикла;
	
	Для Каждого Стр Из МассивОшибкиСотрудников Цикл
		
		НовСтр = ЛН_Объект.ОшибкиСотрудников.Добавить();
		
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		
	КонецЦикла;
	
	Для Каждого ЗНБ Из МассивЗаданияНабора Цикл
		
		НовСтр = ЛН_Объект.ЗаданияНабора.Добавить();
		
		НовСтр.ЗаданиеНабора = ЗНБ;
		
	КонецЦикла;
	
	// Кельманов А.В. - HELP-5128 - 2025.10.01 {
	Для Каждого Стр Из МассивШтрихкодыКоробокДляАгрегации Цикл
		
		НовСтр = ЛН_Объект.ШтрихкодыКоробокДляАгрегации.Добавить();
		
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		
	КонецЦикла;
	// Кельманов А.В. - HELP-5128 - 2025.10.01 }
	
	// Кельманов А.В. - Оптимизация работы - 2026.04.23 {
	Если Не ЗначениеЗаполнено(ЛН_Объект.ШКЛистаНабора) Тогда
		
		ЛН_Объект.СформироватьШКЛистаНабора(); 
		
	КонецЕсли;
	// Кельманов А.В. - Оптимизация работы - 2026.04.23 }
	
	ЛН_Объект.ДополнительныеСвойства.Вставить("ЗагрузкаСТСД", Истина);
	
	Попытка
		
		Если ЛН_Объект.ПометкаУдаления Тогда
			
			ЛН_Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			
		Иначе
			
			ЛН_Объект.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЕсли;
		
	Исключение
		
		МассивОшибок.Добавить(ОписаниеОшибки());
		
	КонецПопытки;
	
	// Кельманов А.В. - SNL-122 - 2026.03.19 {
	Если МассивОшибок.Количество() = 0 И ЗначениеЗаполнено(РеквизитыШапки.ИДКоробки) Тогда
		
		РезЗаписи = РегистрыСведений.ИДКоробок.ЗаписатьИдКоробок(РеквизитыШапки.ИДКоробки, ЛН_Объект.Ссылка);
		
	КонецЕсли;
	// Кельманов А.В. - SNL-122 - 2026.03.19 }
	
	Если МассивОшибок.Количество() > 0 Тогда
		
		Ошибки = СтрСоединить(МассивОшибок, Символы.ПС);
				
	КонецЕсли;
	
	Возврат Ошибки;
	
КонецФункции

// Кельманов А.В. - HELP-4834 - 2025.09.17
Функция ПолучитьРеквизитыДляЭтикеткиОнлайн(ДанныеЛН) Экспорт
	
	МассивРеквизитов = Новый Массив;
	
	СтруктураЛН = Десериализовать(Десериализовать(ДанныеЛН).Получить());
	
	// Кельманов А.В. - SNL-120 - 2026.04.16 {
	//ЛН = СтруктураЛН.ЛН;
	ЭтоЛП = Ложь;
	
	Если СтруктураЛН.Свойство("ЛП") Тогда
		
		ЛН = СтруктураЛН.ЛП;
		
		ЭтоЛП = Истина;
		
	Иначе
		
		ЛН = СтруктураЛН.ЛН;
		
	КонецЕсли;
	// Кельманов А.В. - SNL-120 - 2026.04.16 }
	
	ДокОснование = ЛН.ДокОснование;
	
	// Кельманов А.В. - ИЗМ-0000000164 - 2026.06.16 {
	Если ЭтоВиртуальнаяРНК(ДокОснование) Тогда
		
		ТекстОповещения = "Ошибки:Для резервных РНК этикетка онлайн не печатается!";
		
		Возврат ТекстОповещения;
		
	КонецЕсли;
	// Кельманов А.В. - ИЗМ-0000000164 - 2026.06.16 }

	ВидДокументаОснования = ДокОснование.Метаданные().Имя;
	
	ДопПараметрыНакладной = Неопределено;
	
	Если ВидДокументаОснования = "РасходнаяНакладная" Тогда
		
		ДопПараметрыНакладной = ОбщегоНазначения_ПИ.ПолучитьДопПараметрыНакладной(ДокОснование);
		
	КонецЕсли;
	
	РеквизитыДокОснования = ПолучитьРеквизитыШапки(ДокОснование, "СостояниеНакладной", "Документ");
	
	СостояниеНакладной = РеквизитыДокОснования.СостояниеНакладной;
	
	// Кельманов А.В. - SNL-120 - 2026.04.16 {
	//СтруктураКоробок = ПолучитьСписокШКкоробокЛистаНабора(ЛН, Истина);
	ДанныеДляПерезаполнения = Неопределено;
	ЛНОбъект = ЛН.ПолучитьОбъект();

	// Кельманов А.В. - Оптимизация работы - 2026.04.23 {
	Если Не ЭтоЛП Тогда
		
		ЛНОбъект.ДополнительныеСвойства.Вставить("УпрощенныйРежим", Истина);
		
	КонецЕсли;
	// Кельманов А.В. - Оптимизация работы - 2026.04.23 }

	// Кельманов А.В. - 0000000966 - 2026.06.09 {
	//СтруктураКоробок = ПолучитьСписокШКкоробокЛистаНабора(ЛНОбъект, Истина, ДанныеДляПерезаполнения);
	СтруктураКоробок = ПолучитьСписокШКкоробокЛистаНабора(ЛНОбъект, Истина, ДанныеДляПерезаполнения, Ложь);
	// Кельманов А.В. - 0000000966 - 2026.06.09 }

	Обработки.ПечатьЛистаНабора.ПерезаполнитьНомераКоробок(ЛНОбъект, ДанныеДляПерезаполнения);
	// Кельманов А.В. - SNL-120 - 2026.04.16 }
	
	МожноВыводитьОбщееКоличествоМест = Истина;
	КолКоробок = 0;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ПланНабора.Ссылка КАК ПланНабора
	|ИЗ
	|	Документ.ПланНабора КАК ПланНабора
	|ГДЕ
	|	ПланНабора.Проведен
	|	И ПланНабора.Накладная = &ДокОснование";	
	
	Запрос.УстановитьПараметр("ДокОснование", ДокОснование);
	
	Выборка = Запрос.Выполнить().Выбрать();       
	
	Пока Выборка.Следующий() Цикл
		
		ПланНабора = Выборка.ПланНабора.ПолучитьОбъект();
		
		ТЗБР = ПланНабора.тБрэндов.Выгрузить();
		ТЗБР.Свернуть("Состояние, СекторХранения");	 
		
		Для Каждого СтрТЗБР Из ТЗБР Цикл			
			
			Если ПолучитьНомерСостоянияНакладной(СтрТЗБР.Состояние, СтрТЗБР.СекторХранения = "2") < 800 Тогда				 
				МожноВыводитьОбщееКоличествоМест = Ложь;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если МожноВыводитьОбщееКоличествоМест Тогда		
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита КАК ЗначениеРеквизита
		|ИЗ
		|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
		|ГДЕ
		|	РеквизитыРНКПНКПРМ.Документ = &Документ
		|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = ""СмешаннаяНакладная""";
		
		Запрос.УстановитьПараметр("Документ", ДокОснование);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.ЗначениеРеквизита = Истина И
				СостояниеНакладной <> Перечисления.СостоянияНакладной.ОжиданиеПаллетирования И
				СостояниеНакладной <> Перечисления.СостоянияНакладной.Паллетирование И
				СостояниеНакладной <> Перечисления.СостоянияНакладной.ОжиданиеТермоусадки И
				СостояниеНакладной <> Перечисления.СостоянияНакладной.Термоусадка И
				СостояниеНакладной <> Перечисления.СостоянияНакладной.ГотоваКОтгрузке Тогда	
				
				МожноВыводитьОбщееКоличествоМест = Ложь;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ДопПараметрыНакладной <> Неопределено И ДопПараметрыНакладной.ОтгрузкаFBS = Истина И
			СостояниеНакладной <> Перечисления.СостоянияНакладной.ОжиданиеПаллетирования И
			СостояниеНакладной <> Перечисления.СостоянияНакладной.ОжиданиеДопОбработки И
			СостояниеНакладной <> Перечисления.СостоянияНакладной.ДопОбработка И
			СостояниеНакладной <> Перечисления.СостоянияНакладной.Паллетирование И
			СостояниеНакладной <> Перечисления.СостоянияНакладной.ОжиданиеТермоусадки И
			СостояниеНакладной <> Перечисления.СостоянияНакладной.Термоусадка И
			СостояниеНакладной <> Перечисления.СостоянияНакладной.Отгружена И 	
			СостояниеНакладной <> Перечисления.СостоянияНакладной.ГотоваКОтгрузке Тогда
			
			МожноВыводитьОбщееКоличествоМест = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если МожноВыводитьОбщееКоличествоМест Тогда	
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(ЛистНабора.КоличествоКоробок, 0)) КАК КоличествоКоробок
		|ИЗ
		|	Документ.ЛистНабора КАК ЛистНабора
		|ГДЕ
		|	ЛистНабора.Проведен
		|	И ЛистНабора.ДокОснование = &ДокОснование";
		
		// Кельманов А.В. - SNL-120 - 2026.04.16 {
		Если ЭтоЛП Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЛистНабора", "ЛистПереукладки"); 
			
		КонецЕсли;
		// Кельманов А.В. - SNL-120 - 2026.04.16 }
		
		Запрос.УстановитьПараметр("ДокОснование", ДокОснование);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.КоличествоКоробок = Null Тогда 
				
				Продолжить;
				
			КонецЕсли;
			
			КолКоробок = КолКоробок + Выборка.КоличествоКоробок;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого СтрТЗ Из СтруктураКоробок Цикл
		
		СтруктураРеквизитов = Новый Структура("НомерКоробки, ВсегоКоробок, КоличествоВКоробке, НаименованиеНоменклатуры, QRКод", "", "", "", "", "");
		
		СтруктураРеквизитов.НомерКоробки = СтрТЗ.НомерКоробки;
		СтруктураРеквизитов.НаименованиеНоменклатуры = СтрТЗ.Номенклатура;
		СтруктураРеквизитов.QRКод = ЗакодироватьЛистИКоробкуВСтроку(ЛН, СтрТЗ.НомерКоробки);
		
		Если ЛН.ТипШК <> Перечисления.ТипыШтрихКодов.Коробка Тогда
			
			СтруктураРеквизитов.КоличествоВКоробке = ЛН.Товары.Итог("Количество");
			
		КонецЕсли;
		
		Если ТипЗнч(СтрТЗ.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
			
			Если ЗначениеЗаполнено(СтрТЗ.ШтукВКоробке) Тогда
				ШтукВКоробке = СтрТЗ.ШтукВКоробке;
			Иначе
				ШтукВКоробке = СтрТЗ.Номенклатура.Родитель.ШтукВКоробке;
			КонецЕсли;
			
			Если ШтукВКоробке > 0 Тогда
				СтруктураРеквизитов.КоличествоВКоробке = ШтукВКоробке;
			КонецЕсли;
			
		КонецЕсли;
		
		Если МожноВыводитьОбщееКоличествоМест И СтрТЗ.НомерКоробки = КолКоробок Тогда			
			
			СтруктураРеквизитов.ВсегоКоробок = КолКоробок;
			
		КонецЕсли;
		
		МассивРеквизитов.Добавить(СтруктураРеквизитов);
		
	КонецЦикла;
	
	Ответ = Сериализовать(Новый ХранилищеЗначения(Сериализовать(МассивРеквизитов), Новый СжатиеДанных(9)));
	
	Возврат Ответ;
	
КонецФункции

// Кельманов А.В. - SNL-122 - 2026.03.19
Функция ПроверитьОтсканированныйИдКоробки(ШК) Экспорт

	Ошибки = "";
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИДКоробок.ИДКоробки КАК ИДКоробки,
	               |	ИДКоробок.ЛистНабора КАК ЛистНабора,
	               |	ИДКоробок.ДатаЗаписи КАК ДатаЗаписи
	               |ИЗ
	               |	РегистрСведений.ИДКоробок КАК ИДКоробок
	               |ГДЕ
	               |	ИДКоробок.ИДКоробки = &ИДКоробки";
	
	Запрос.УстановитьПараметр("ИДКоробки", ШК);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Ошибки = "ID коробки " + ШК + " уже был ранее отсканирован";
		
	КонецЕсли;
	
	Возврат Ошибки;
	
КонецФункции

Функция Сериализовать(ОбъектСериализации) Экспорт
	ДеревоВОбъектеXDTO = СериализаторXDTO.ЗаписатьXDTO(ОбъектСериализации);
	МойXML = Новый ЗаписьXML;
	МойXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(МойXML, ДеревоВОбъектеXDTO);
	Возврат МойXML.Закрыть();
КонецФункции

Функция Десериализовать(XMLСтруктураСериализованногоОбъекта)
	ЧтениеXMLДанных = Новый ЧтениеXML;
	ЧтениеXMLДанных.УстановитьСтроку(XMLСтруктураСериализованногоОбъекта);
	ТЗ = СериализаторXDTO.ПрочитатьXML(ЧтениеXMLДанных);
	ЧтениеXMLДанных.Закрыть();  
	Возврат ТЗ;
КонецФункции

// Кухарь А.Ю.  31.03.2024 конец
// Если передано число - то Истина, иначе Ложь
Функция ЭтоЧисло(Знач ЧислоСтрокой) Экспорт
	
	Для Сч = 1 По СтрДлина(ЧислоСтрокой) Цикл
		Символ = Сред(ЧислоСтрокой, Сч, 1);
		Если Найти("1234567890,.", Символ) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции 
// Кухарь А.Ю.  31.03.2024 конец

// Кухарь А.Ю.  09.07.2024 начало
//
Функция ОпределитьНеобходимостьМаркировкиПоНакладной(Накладная) Экспорт
	
	Если Накладная = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Кельманов А.В. - HELP-2442 - 2024.12.26 {
	//ВидНакладной = Накладная.Метаданные().Имя;
	//
	//ТребуетсяМаркировка = Ложь;
	//
	//// Кухарь А.Ю. 09.09.2024 начало
	////если ВидНакладной = "РасходнаяНакладная" тогда
	//Если ВидНакладной = "РасходнаяНакладная" Или ВидНакладной = "СписаниеТМЦ" Тогда	 
	//	// Кухарь А.Ю. 09.09.2024 конец
	//	
	//	РеквизитыШапки = ПолучитьРеквизитыШапки(Накладная, "ТребуетсяМаркировка", "Документ");
	//	
	//	Если РеквизитыШапки.ТребуетсяМаркировка Тогда
	//		
	//		ТребуетсяМаркировка = Истина;
	//		
	//	КонецЕсли;
	//	
	//ИначеЕсли ВидНакладной = "Перемещение" Тогда
	//	
	//	РеквизитыНакладной = ПолучитьРеквизитыШапки(Накладная, "Склад,СкладПолучатель,Склад.КодФизическогоУзла,СкладПолучатель.КодФизическогоУзла", "Документ");
	//	
	//	// Кухарь А.Ю. 05.08.2024 начало
	//	// 		Если РеквизитыНакладной.СкладПолучатель_КодФизическогоУзла<>ПараметрыСеанса.ЭтотУзел.Код  тогда 
	//	Если РеквизитыНакладной.СкладПолучатель_КодФизическогоУзла <> РеквизитыНакладной.Склад_КодФизическогоУзла Тогда 
	//		// Кухарь А.Ю. 05.08.2024 конец				 
	//		
	//		ТребуетсяМаркировка = Истина;
	//		
	//	Иначе
	//		
	//		ТребуетсяМаркировка = Ложь;
	//		
	//	КонецЕсли;
	//	
	//ИначеЕсли ВидНакладной = "ПриходнаяНакладная" Тогда
	//	РеквизитыНакладной = ПолучитьРеквизитыШапки(Накладная, "КодОперации", "Документ");		
	//	
	//	//если РеквизитыНакладной.КодОперации = Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя
	//	//	или РеквизитыНакладной.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия
	//	//	тогда		
	//	//	ТребуетсяМаркировка=ложь;	
	//	//иначе
	//	ТребуетсяМаркировка = Истина;
	//	//КонецЕсли;
	//	
	//Иначе
	//	
	//	ТребуетсяМаркировка = Ложь;
	//	
	//КонецЕсли;
	ТребуетсяМаркировка = Ложь;
	
	Если ТипЗнч(Накладная) = Тип("Структура") Тогда
		
		Если Накладная.Свойство("ВидНакладной") Тогда
			
			ВидНакладной = Накладная.ВидНакладной;
			
			Если ВидНакладной = "Перемещение" Тогда
				
				Если Накладная.Свойство("Склад_КодФизическогоУзла") И Накладная.Свойство("СкладПолучатель_КодФизическогоУзла") Тогда
					
					Если Накладная.СкладПолучатель_КодФизическогоУзла <> Накладная.Склад_КодФизическогоУзла Тогда 
						
						ТребуетсяМаркировка = Истина;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ВидНакладной = Накладная.Метаданные().Имя;
		
		Если ВидНакладной = "РасходнаяНакладная" Или ВидНакладной = "СписаниеТМЦ" Тогда	 
			
			РеквизитыШапки = ПолучитьРеквизитыШапки(Накладная, "ТребуетсяМаркировка", "Документ");
			
			Если РеквизитыШапки.ТребуетсяМаркировка Тогда
				
				ТребуетсяМаркировка = Истина;
				
			КонецЕсли;
			
		ИначеЕсли ВидНакладной = "Перемещение" Тогда
			
			
			// Кухарь А.Ю. 07.03.2025 начало
			// Пустая задача
			//РеквизитыНакладной = ПолучитьРеквизитыШапки(Накладная, "Склад,СкладПолучатель,Склад.КодФизическогоУзла,СкладПолучатель.КодФизическогоУзла", "Документ");
			//Если РеквизитыНакладной.СкладПолучатель_КодФизическогоУзла <> РеквизитыНакладной.Склад_КодФизическогоУзла Тогда 				
			//ТребуетсяМаркировка = Истина;			
			//КонецЕсли;
			РеквизитыНакладной = ПолучитьРеквизитыШапки(Накладная, "Склад,СкладПолучатель,Склад.КодФизическогоУзла,СкладПолучатель.КодФизическогоУзла,Склад.ВидСклада,СкладПолучатель.ВидСклада", "Документ");	
			Если РеквизитыНакладной.СкладПолучатель_ВидСклада <>Перечисления.ВидСклада.ВиртуальныйДляСклада
				и РеквизитыНакладной.Склад_ВидСклада <>Перечисления.ВидСклада.ВиртуальныйДляСклада Тогда 			
				ТребуетсяМаркировка = Истина;			
			КонецЕсли;
			// Кухарь А.Ю. 07.03.2025 конец
			
			
		ИначеЕсли ВидНакладной = "ПриходнаяНакладная" Тогда
			
			РеквизитыНакладной = ПолучитьРеквизитыШапки(Накладная, "КодОперации", "Документ");		
			
			ТребуетсяМаркировка = Истина;
			
		Иначе
			
			ТребуетсяМаркировка = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	// Кельманов А.В. - HELP-2442 - 2024.12.26 }
	
	Возврат ТребуетсяМаркировка;
	
КонецФункции
// Кухарь А.Ю.  09.07.2024 конец

// Кухарь А.Ю.  13.08.2024 начало
//
Функция ЭтоУзелОтправителяПоСкладу (знач Склад) Экспорт
	// Кухарь А.Ю. 10.03.2025 начало
	// Пустая задача
	//если ПолучитьРеквизитШапки(Склад,"КодФизическогоУзла","Справочник") = ПараметрыСеанса.ЭтотУзел.Код тогда
	КодСклада=ПолучитьРеквизитШапки(Склад,"КодФизическогоУзла","Справочник");
	если КодСклада="" тогда
		КодСклада="SNL";
	КонецЕсли;
	если КодСклада = ПараметрыСеанса.ЭтотУзел.Код тогда
		// Кухарь А.Ю. 10.03.2025 конец
		
		
		Возврат Истина;
	КонецЕсли;
	
	возврат Ложь;
КонецФункции
// Кухарь А.Ю.  13.08.2024 конец

// Кухарь А.Ю.  12.12.2024 начало
//
Функция ПроверитьНаличиеЛистовПереукладки (Знач Накладная) экспорт
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛистПереукладки.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЛистПереукладки КАК ЛистПереукладки
	|ГДЕ
	|	ЛистПереукладки.Проведен
	|	И НЕ ЛистПереукладки.НеУчитыватьПриОпределенииКоличестваМест
	|	И ЛистПереукладки.ДокОснование = &Накладная
	|	И (ЛистПереукладки.КодАгрегации <> &ПустойКодАгрегации Или ЛистПереукладки.ШтрихкодыУпаковок.ШтрихкодБлочка <> &ПустойКодАгрегации)";
	запрос.УстановитьПараметр("ПустойКодАгрегации",Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка());	
	запрос.УстановитьПараметр("Накладная",Накладная);
	Выборка = запрос.Выполнить().Выбрать();
	пока Выборка.Следующий() цикл
		Возврат Истина;
	КонецЦикла;
	
	возврат ложь;
	
КонецФункции

Функция СформироватьКартинкуШК_EAN13(Знач ШтрихКод, ВысотаРисунка,ШиринаРисунка) экспорт    
	
	ПараметрыШК = ПараметрыГенерацииШКпоУмолчанию();
	
	Эталон 		= Справочники.ШтрихкодыУпаковокТоваров.ПолучитьМакет("Эталон");
	ММвВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
	ПараметрыШК.ТипКода			= 1;
	
	К = 100/Мин(ВысотаРисунка,ШиринаРисунка);
	
	мВысота = Окр(К * ВысотаРисунка / ММвВПикселе);
	мШирина = Окр(К * ШиринаРисунка / ММвВПикселе);	
	
	УголПоворота	= ?(мВысота>мШирина, 90, 0);
	
	ПараметрыШК.Высота			= мВысота;
	ПараметрыШК.Ширина			= мШирина;	
	
	ПараметрыШК.ОтображатьТекст = Истина;
	ПараметрыШК.РазмерШрифта	= Цел(12*К);
	
	
	ПараметрыШК.УголПоворота	= УголПоворота;
	
	ПараметрыШК.Штрихкод		= ШтрихКод;	
	
	РезультатШтрихкод = ПодготовитьИзображениеШтрихкода(КомпонентаФормированияDataMatrixКода(), ПараметрыШК);
	
	
	Возврат РезультатШтрихкод;
	
КонецФункции

Функция ПодготовитьИзображениеШтрихкода(ВнешняяКомпонента, ПараметрыШтрихкода)
	
	// Результат 
	РезультатОперации = Новый Структура("Успешно,ДвоичныеДанные,Картинка", Ложь);	
	
	// Зададим размер формируемой картинки.
	ШиринаШтрихкода = Макс(Окр(ПараметрыШтрихкода.Ширина),1);
	ВысотаШтрихкода = Макс(Окр(ПараметрыШтрихкода.Высота),1);	
	
	ВнешняяКомпонента.Ширина = ШиринаШтрихкода;
	ВнешняяКомпонента.Высота = ВысотаШтрихкода;
	ВнешняяКомпонента.АвтоТип = Ложь;
	
	ШтрихкодВрем = Строка(ПараметрыШтрихкода.Штрихкод); // Преобразуем явно в строку.
	
	Если ПараметрыШтрихкода.ТипКода = 99 Тогда
		ВнешняяКомпонента.АвтоТип = Истина;
	Иначе
		ВнешняяКомпонента.АвтоТип = Ложь;
		ВнешняяКомпонента.ТипКода = ПараметрыШтрихкода.ТипКода;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("ПрозрачныйФон") Тогда
		ВнешняяКомпонента.ПрозрачныйФон = ПараметрыШтрихкода.ПрозрачныйФон;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("ТипВходныхДанных") Тогда
		ВнешняяКомпонента.ТипВходныхДанных = ПараметрыШтрихкода.ТипВходныхДанных;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("GS1DatabarКоличествоСтрок") Тогда
		ВнешняяКомпонента.GS1DatabarКоличествоСтрок = ПараметрыШтрихкода.GS1DatabarКоличествоСтрок;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("УбратьЛишнийФон") Тогда
		ВнешняяКомпонента.УбратьЛишнийФон = ПараметрыШтрихкода.УбратьЛишнийФон;
	КонецЕсли;
	
	ВнешняяКомпонента.ОтображатьТекст = ПараметрыШтрихкода.ОтображатьТекст;
	// Формируем картинку штрихкода.
	ВнешняяКомпонента.ЗначениеКода = ШтрихкодВрем;
	// Угол поворота штрихкода.
	ВнешняяКомпонента.УголПоворота = ?(ПараметрыШтрихкода.Свойство("УголПоворота"), ПараметрыШтрихкода.УголПоворота, 0);
	// Уровень коррекции QR кода (L=0, M=1, Q=2, H=3).
	ВнешняяКомпонента.УровеньКоррекцииQR = ?(ПараметрыШтрихкода.Свойство("УровеньКоррекцииQR"), ПараметрыШтрихкода.УровеньКоррекцииQR, 1);
	
	// Для обеспечения совместимости с предыдущими версиями БПО.
	Если Не ПараметрыШтрихкода.Свойство("Масштабировать")
		Или (ПараметрыШтрихкода.Свойство("Масштабировать") И ПараметрыШтрихкода.Масштабировать) Тогда
		
		Если Не ПараметрыШтрихкода.Свойство("СохранятьПропорции")
			Или (ПараметрыШтрихкода.Свойство("СохранятьПропорции") И Не ПараметрыШтрихкода.СохранятьПропорции) Тогда
			// Если установленная нами ширина меньше минимально допустимой для этого штрихкода.
			Если ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода Тогда
				ВнешняяКомпонента.Ширина = ВнешняяКомпонента.МинимальнаяШиринаКода;
			КонецЕсли;
			// Если установленная нами высота меньше минимально допустимой для этого штрихкода.
			Если ВнешняяКомпонента.Высота < ВнешняяКомпонента.МинимальнаяВысотаКода Тогда
				ВнешняяКомпонента.Высота = ВнешняяКомпонента.МинимальнаяВысотаКода;
			КонецЕсли;
		ИначеЕсли ПараметрыШтрихкода.Свойство("СохранятьПропорции") И ПараметрыШтрихкода.СохранятьПропорции Тогда
			Пока ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода 
				Или ВнешняяКомпонента.Высота < ВнешняяКомпонента.МинимальнаяВысотаКода Цикл
				// Если установленная нами ширина меньше минимально допустимой для этого штрихкода.
				Если ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода Тогда
					ВнешняяКомпонента.Ширина = ВнешняяКомпонента.МинимальнаяШиринаКода;
					ВнешняяКомпонента.Высота = Окр(ВнешняяКомпонента.МинимальнаяШиринаКода / ШиринаШтрихкода) * ВысотаШтрихкода;
				КонецЕсли;
				// Если установленная нами высота меньше минимально допустимой для этого штрихкода.
				Если ВнешняяКомпонента.Высота < ВнешняяКомпонента.МинимальнаяВысотаКода Тогда
					ВнешняяКомпонента.Высота = ВнешняяКомпонента.МинимальнаяВысотаКода;
					ВнешняяКомпонента.Ширина = Окр(ВнешняяКомпонента.МинимальнаяВысотаКода / ВысотаШтрихкода) * ШиринаШтрихкода;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// ВертикальноеВыравниваниеКода: 1 - по верхнему краю, 2 - по центру, 3 - по нижнему краю.
	Если ПараметрыШтрихкода.Свойство("ВертикальноеВыравнивание") И (ПараметрыШтрихкода.ВертикальноеВыравнивание > 0) Тогда
		ВнешняяКомпонента.ВертикальноеВыравниваниеКода = ПараметрыШтрихкода.ВертикальноеВыравнивание;
	КонецЕсли;
	
	// Кухарь А.Ю. 20.05.2024 начало
	//ВнешняяКомпонента.BarAlign=2;
	// Кухарь А.Ю. 20.05.2024 конец
	
	Если ПараметрыШтрихкода.Свойство("РазмерШрифта") И (ПараметрыШтрихкода.РазмерШрифта > 0) 
		И (ПараметрыШтрихкода.ОтображатьТекст) И (ВнешняяКомпонента.РазмерШрифта <> ПараметрыШтрихкода.РазмерШрифта) Тогда
		ВнешняяКомпонента.РазмерШрифта = ПараметрыШтрихкода.РазмерШрифта;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("РазмерШрифта") И ПараметрыШтрихкода.РазмерШрифта > 0
		И ПараметрыШтрихкода.Свойство("МонохромныйШрифт") Тогда
		Если ПараметрыШтрихкода.МонохромныйШрифт Тогда
			ВнешняяКомпонента.МаксимальныйРазмерШрифтаДляПринтеровНизкогоРазрешения = ПараметрыШтрихкода.РазмерШрифта + 1;
		Иначе
			ВнешняяКомпонента.МаксимальныйРазмерШрифтаДляПринтеровНизкогоРазрешения = -1;
		КонецЕсли;
	КонецЕсли;
	
	
	Если ПараметрыШтрихкода.ТипКода = 16 Тогда // QR
		Если ПараметрыШтрихкода.Свойство("ЛоготипКартинка") И ЗначениеЗаполнено(ПараметрыШтрихкода.ЛоготипКартинка) Тогда 
			ВнешняяКомпонента.ЛоготипКартинка = ПараметрыШтрихкода.ЛоготипКартинка;    
		Иначе
			ВнешняяКомпонента.ЛоготипКартинка = "";
		КонецЕсли;
		Если ПараметрыШтрихкода.Свойство("ЛоготипРазмерПроцентОтШК") И Не ПустаяСтрока(ПараметрыШтрихкода.ЛоготипРазмерПроцентОтШК) Тогда 
			ВнешняяКомпонента.ЛоготипРазмерПроцентОтШК = ПараметрыШтрихкода.ЛоготипРазмерПроцентОтШК;
		КонецЕсли;
	КонецЕсли;
	
	
	// Сформируем картинку
	ДвоичныеДанныеКартинки 		= ВнешняяКомпонента.ПолучитьШтрихкод();
	РезультатОперации.Успешно 	= (ВнешняяКомпонента.Результат = 0);
	// Если картинка сформировалась.
	Если ДвоичныеДанныеКартинки <> Неопределено Тогда
		РезультатОперации.ДвоичныеДанные	= ДвоичныеДанныеКартинки;
		РезультатОперации.Картинка 			= Новый Картинка(ДвоичныеДанныеКартинки); // Формируем из двоичных данных.
	КонецЕсли;
	
	Возврат РезультатОперации;
	
КонецФункции

Функция ПараметрыГенерацииШКпоУмолчанию() 
	
	ПараметрыШтрихкода = Новый Структура;
	
	ПараметрыШтрихкода.Вставить("Ширина", 						150);
	ПараметрыШтрихкода.Вставить("Высота", 						150);
	ПараметрыШтрихкода.Вставить("ТипКода", 						99);
	ПараметрыШтрихкода.Вставить("ОтображатьТекст",				Ложь);
	ПараметрыШтрихкода.Вставить("РазмерШрифта", 				12);
	ПараметрыШтрихкода.Вставить("УголПоворота", 				0);
	ПараметрыШтрихкода.Вставить("Штрихкод",				 		"");
	ПараметрыШтрихкода.Вставить("ПрозрачныйФон", 				Истина);
	ПараметрыШтрихкода.Вставить("УровеньКоррекцииQR",		 	1);
	// Кухарь А.Ю.  10.12.2024 начало
	//
	//ПараметрыШтрихкода.Вставить("Масштабировать", 				Ложь);
	//ПараметрыШтрихкода.Вставить("СохранятьПропорции", 			Ложь);
	//ПараметрыШтрихкода.Вставить("УбратьЛишнийФон",	 			Ложь); 
	ПараметрыШтрихкода.Вставить("УбратьЛишнийФон",	 			Истина); 	
	ПараметрыШтрихкода.Вставить("Масштабировать", 				Истина);
	ПараметрыШтрихкода.Вставить("СохранятьПропорции", 			Истина);
	
	
	// Кухарь А.Ю.  10.12.2024 конец
	
	ПараметрыШтрихкода.Вставить("ВертикальноеВыравнивание" , 	1); 
	ПараметрыШтрихкода.Вставить("GS1DatabarКоличествоСтрок", 	2);
	ПараметрыШтрихкода.Вставить("ТипВходныхДанных", 			0);
	
	ПараметрыШтрихкода.Вставить("ЛоготипКартинка");
	ПараметрыШтрихкода.Вставить("ЛоготипРазмерПроцентОтШК");
	
	Возврат ПараметрыШтрихкода;
	
КонецФункции

Функция КомпонентаФормированияDataMatrixКода() 
	
	
	ТекстОшибки = НСтр("ru = 'Не удалось подключить внешнюю компоненту для генерации DataMatrix-кода.'");
	
	CodeGenerator = ПодключитьКомпонентуИзМакета("Barcode", "ОбщийМакет.КомпонентаПечатиШтрихкодов");
	Если CodeGenerator = Неопределено Тогда 
		Сообщить(ТекстОшибки);
	КонецЕсли;
	
	Возврат CodeGenerator;	
КонецФункции
// Кухарь А.Ю.  12.12.2024 конец

//Нечаева 28,01,25
Функция НайтиПунктДоставки(ГлнПунктаДоставки) Экспорт
	
	ПунктДоставкиН = Справочники.ПунктыДоставки.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	аа.Ссылка КАК Ссылка,
	|	аа.Владелец КАК Владелец,
	|	аа.комментарий КАК комментарий
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПунктыДоставки.Ссылка КАК Ссылка,
	|		ПунктыДоставки.Ссылка.Владелец КАК Владелец,
	|		ВЫРАЗИТЬ(ПунктыДоставки.Комменатрий КАК СТРОКА(100)) КАК комментарий
	|	ИЗ
	|		Справочник.ПунктыДоставки.ИЛН КАК ПунктыДоставки
	|	ГДЕ
	|		ПунктыДоставки.КодИЛН = &ТекКод
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПунктыДоставки.Ссылка,
	|		ПунктыДоставки.Ссылка.Владелец,
	|		""""
	|	ИЗ
	|		Справочник.ПунктыДоставки КАК ПунктыДоставки
	|	ГДЕ
	|		ПунктыДоставки.КодИЛН = &ТекКод) КАК аа
	|
	|УПОРЯДОЧИТЬ ПО
	|	комментарий";
	
	Запрос.УстановитьПараметр("ТекКод", СокрЛП(ГлнПунктаДоставки));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ПунктДоставкиН = Выборка.Ссылка;
		
	КонецЕсли; 
	
	Возврат ПунктДоставкиН;
	
КонецФункции 



// Кухарь А.Ю.  06.03.2025 начало
// Пустая задача

Функция ЕстьЛПСАгрегацией(Накладная) экспорт
	запрос=новый запрос;
	запрос.УстановитьПараметр("Накладная",Накладная);
	запрос.Текст= "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Лист.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК Лист
	|ГДЕ
	|	Лист.Ссылка.Проведен
	|	И Лист.Ссылка.ДокОснование = &Накладная
	|	И (Лист.ШтрихкодБлочка <> &ПустойШК
	|			ИЛИ Лист.Ссылка.КодАгрегации <> &ПустойШК)";
	запрос.УстановитьПараметр("ПустойШК",Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка());
	выборка=запрос.Выполнить().Выбрать();
	пока выборка.Следующий() цикл
		возврат Истина;
	КонецЦикла;
	
	возврат Ложь;
КонецФункции

// Кухарь А.Ю. 01.05.2025 начало
Функция ЕстьЛистБезКодаАгрегации(Накладная,ИмяЛиста = "ЛистПереукладки") экспорт
	запрос=новый запрос;
	запрос.УстановитьПараметр("Накладная",Накладная);
	запрос.УстановитьПараметр("ПустойШК",Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка());	
	запрос.Текст= "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Лист.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЛистПереукладки КАК Лист
	|ГДЕ
	|	Лист.Проведен 
	|	И Лист.ДокОснование = &Накладная
	|	И Лист.КодАгрегации = &ПустойШК";
	если ИмяЛиста="ЛистПереукладки" тогда  
		Запрос.Текст=СтрЗаменить(запрос.Текст,"Документ.ЛистПереукладки КАК Лист","Документ.ЛистНабора КАК Лист");
	КонецЕсли;
	выборка=запрос.Выполнить().Выбрать();
	пока выборка.Следующий() цикл
		возврат Истина;
	КонецЦикла;
	
	возврат Ложь;
КонецФункции


// Кухарь А.Ю. 01.05.2025 конец


//Кухарь А.Ю.  14.03.2025 начало
// Пустая задача 
Функция ПолучитьПоляДляИмпортныхЭтикеток (знач ЗПС, знач ИмяМакета)
	если ложь тогда ЗПС=документы.ЗаказПоставщику.НайтиПоНомеру("");КонецЕсли;
	
	ДанныеИзготовителя=ЗаполнитьДанныеИзготовителя(ЗПС,ИмяМакета);
	ДатаВыпуска=ПустаяДата();
	если ТипЗнч(зпс.ДокОснование)=Тип("ДокументСсылка.КонтрактСПроизводителем") и ЗначениеЗаполнено(зпс.ДокОснование) тогда
		ДатаВыпуска=зпс.ДокОснование.Контракт.ДатаКонтракта;
	КонецЕсли;
	если ДатаВыпуска=ПустаяДата() тогда
		ДатаВыпуска=зпс.ДокОснование.Дата
	КонецЕсли;
	
	ДанныеОрганизации=ЗаполнитьДанныеОрганизации();
	
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	АртикулаНосков.Значение КАК АртикулДляПечатиНосков,
	|	АртикулаКолготок.Значение КАК АртикулДляПечатиКолготокНаСтикере,
	|	ЗаказПоставщикуТовары.Номенклатура.Цвет КАК Цвет,
	|	ЗаказПоставщикуТовары.Номенклатура.Размер КАК Размер,
	|	ЗаказПоставщикуТовары.Номенклатура.КодПроизводителя КАК КодПроизводителя,
	|	ЗаказПоставщикуТовары.Номенклатура.Состав КАК НоменклатураСостав,
	|	ЗаказПоставщикуТовары.Номенклатура.Цвет.РусскоеНаименование КАК ЦветРусский,
	|	ЗаказПоставщикуТовары.Номенклатура.Размер КАК ПростоРазмер,
	|	"""" КАК ОбхватГруди,
	|	"""" КАК ОбхватПодГрудью,
	|	"""" КАК Рост,
	|	"""" КАК ОбхватТалии,
	|	"""" КАК ОбхватБедер,
	|	"""" КАК РеквизитыРазмера,
	|	"""" КАК Изготовитель,
	|	"""" КАК Изготовитель2,
	|	ЗаказПоставщикуТовары.Номенклатура.ДопПараметрРазмера КАК ДопПараметрРазмера,
	|	ЗаказПоставщикуТовары.Номенклатура.Родитель.Состав КАК Состав,
	|	ЗаказПоставщикуТовары.Номенклатура.Родитель.Состав КАК СоставДляСпорта,
	|	ЗаказПоставщикуТовары.Номенклатура.Родитель.ТипТовара КАК ТипТовара,
	|	ЗаказПоставщикуТовары.Номенклатура.Родитель.ФР_ТипТовара КАК ФР_ТипТовара,
	|	ЗНАЧЕНИЕ(Справочник.ШтрихКоды.ПустаяСсылка) КАК ШтрихКод,
	|	&ДатаВыпуска КАК ДатаВыпуска,
	|	ЗаказПоставщикуТовары.Номенклатура.Родитель КАК Модель,
	|	ЗаказПоставщикуТовары.Ссылка.Организация КАК Организация,
	|	ЗаказПоставщикуТовары.Ссылка.Организация.ИНН КАК ИННОрганизации,
	|	ЗаказПоставщикуТовары.Ссылка.Организация.КПП КАК КППОрганизации,
	|	ЗаказПоставщикуТовары.Ссылка.Организация.Телефоны КАК ТелефонОрганизации
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК АртикулаНосков
	|		ПО ЗаказПоставщикуТовары.Номенклатура.Родитель = АртикулаНосков.Объект
	|			И (АртикулаНосков.Свойство = &АртикулДляПечатиНосков)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК АртикулаКолготок
	|		ПО ЗаказПоставщикуТовары.Номенклатура.Родитель = АртикулаКолготок.Объект
	|			И (АртикулаКолготок.Свойство = &АртикулДляПечатиКолготокНаСтикере)
	|ГДЕ
	|	ЗаказПоставщикуТовары.Количество > 0
	|	И ЗаказПоставщикуТовары.Ссылка.Ссылка = &Ссылка";
	запрос.УстановитьПараметр("Ссылка",ЗПС);
	запрос.УстановитьПараметр("ДатаВыпуска",ДатаВыпуска);
	
	Запрос.УстановитьПараметр("АртикулДляПечатиНосков",				ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("АртикулДляПечатиНосков"));
	Запрос.УстановитьПараметр("АртикулДляПечатиКолготокНаСтикере",	ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("АртикулДляПечатиКолготокНаСтикере"));
	
	ТаблицаВозврата = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаТаблицыВозврата из ТаблицаВозврата цикл
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыВозврата,ДанныеИзготовителя);
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыВозврата,ДанныеОрганизации);
		
		НаборВремПолей=ПолучитьРеквизитыРазмера(СтрокаТаблицыВозврата.Размер,ИмяМакета);
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыВозврата,НаборВремПолей);
		
		НаборВремПолей=ПерезаполнитьСостав(СтрокаТаблицыВозврата.Номенклатура,ИмяМакета);
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыВозврата,НаборВремПолей);
		
		НаборВремПолей=ПерезаполнитьТипТовара(СтрокаТаблицыВозврата.ТипТовара,ИмяМакета);
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыВозврата,НаборВремПолей);	
		
		
		ДопУсловие="	И подстрока(ШтрихКоды.Описание,1,3) = ""GS1""";	
		СтрокаТаблицыВозврата.ШтрихКод=ПолучитьШтрихКодТовара(СтрокаТаблицыВозврата.Номенклатура,Перечисления.ТипыШтрихКодов.Штука,Перечисления.ВидыШК.Основной,,ДопУсловие,Истина);	
		
		НаборВремПолей=ДанныеИмпортёра(ИмяМакета,СтрокаТаблицыВозврата.Модель,ДатаВыпуска);
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыВозврата,НаборВремПолей);	
		
		
	КонецЦикла;
	
	
	
	//Импортёр: [ИмпортерИстория],ИНН/КПП [ИННИмпортера]/[КППИмпортера]. 	
	//ДатаВыпуска	
	возврат ТаблицаВозврата;
	
	//[ПростоРазмер] [ДопПараметрРазмера]
	//[РеквизитыРазмера]	 
	
КонецФункции

Функция ПолучитьРеквизитыРазмера (Размер,ИмяМакета)
	
	НаборПолей = новый Структура;
	НаборПолей.Вставить("ОбхватГруди",""); 
	НаборПолей.Вставить("ОбхватПодГрудью",""); 
	НаборПолей.Вставить("Рост",""); 
	НаборПолей.Вставить("ОбхватТалии",""); 
	НаборПолей.Вставить("ОбхватБедер",""); 
	НаборПолей.Вставить("РеквизитыРазмера","");
	МассивРеквизитовРазмера=новый Массив;
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	РеквизитыСправочников.ИмяРеквизита КАК ИмяРеквизита,
	|	РеквизитыСправочников.ЗначениеРеквизита КАК ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
	|ГДЕ
	|	РеквизитыСправочников.Справочник = &Размер";
	запрос.УстановитьПараметр("Размер",Размер);
	ВыборкаРеквизитыРазмера=запрос.Выполнить().Выбрать();
	пока ВыборкаРеквизитыРазмера.Следующий() цикл
		если ВыборкаРеквизитыРазмера.ИмяРеквизита="Обхват под грудью" или ВыборкаРеквизитыРазмера.ИмяРеквизита="Обхватподгрудью" тогда
			НаборПолей.ОбхватПодГрудью="Обхват под грудью:"+ВыборкаРеквизитыРазмера.ЗначениеРеквизита;
		ИначеЕсли  ВыборкаРеквизитыРазмера.ИмяРеквизита="Обхватбедер" тогда
			НаборПолей.ОбхватБедер="Обхват бедер:"+ВыборкаРеквизитыРазмера.ЗначениеРеквизита;
		ИначеЕсли  ВыборкаРеквизитыРазмера.ИмяРеквизита="ОбхватГруди" тогда
			НаборПолей.ОбхватГруди="Обхват груди:"+ВыборкаРеквизитыРазмера.ЗначениеРеквизита;
		ИначеЕсли  ВыборкаРеквизитыРазмера.ИмяРеквизита="Рост" тогда
			НаборПолей.Рост="Рост:"+ВыборкаРеквизитыРазмера.ЗначениеРеквизита;
		ИначеЕсли  ВыборкаРеквизитыРазмера.ИмяРеквизита="ОбхватТалии" тогда
			НаборПолей.ОбхватТалии="Обхват талии:"+ВыборкаРеквизитыРазмера.ЗначениеРеквизита;
		иначе
			Продолжить;;
		КонецЕсли;
	КонецЦикла;
	
	Если НаборПолей.ОбхватГруди <> "" Тогда
		МассивРеквизитовРазмера.Добавить(НаборПолей.ОбхватГруди);
	КонецЕсли;
	Если НаборПолей.ОбхватПодГрудью <> "" Тогда
		МассивРеквизитовРазмера.Добавить(НаборПолей.ОбхватПодГрудью);
	КонецЕсли;	
	Если НаборПолей.ОбхватТалии <> "" Тогда
		МассивРеквизитовРазмера.Добавить(НаборПолей.ОбхватТалии);
	КонецЕсли;
	Если НаборПолей.ОбхватБедер <> "" Тогда
		МассивРеквизитовРазмера.Добавить(НаборПолей.ОбхватБедер);
	КонецЕсли;
	Если НаборПолей.Рост <> "" Тогда
		МассивРеквизитовРазмера.Добавить(НаборПолей.Рост);
	КонецЕсли;	
	
	НаборПолей.РеквизитыРазмера=СтрСоединить(МассивРеквизитовРазмера,символы.ПС);
	
	возврат НаборПолей;
КонецФункции

Функция ПерезаполнитьСостав (Номенклатура,ИмяМакета)
	НаборПолей=новый Структура;
	ТЧСостав			= Номенклатура.Родитель.СоставНоменклатуры;
	СоставДляСпорта="";
	МассивМатериаловПроцентВКонце=новый Массив;
	
	Для каждого СтрТЧ из ТЧСостав цикл
		СоставДляСпорта=СоставДляСпорта+СтрТЧ.Процент+"% "+СтрТЧ.МатериалСостав.АнглоязычноеНаименование+ " | "+СтрТЧ.МатериалСостав.Наименование+","+Символы.ПС;
		МассивМатериаловПроцентВКонце.Добавить(""+СтрТЧ.МатериалСостав+" %");	
	КонецЦикла;
	
	если ИмяМакета="МакетИнформацияУпаковкаОбщаяЧЗ" тогда
		ТекСостав=СтрСоединить(МассивМатериаловПроцентВКонце);	
	КонецЕсли;
	
	если СтрДлина(СоставДляСпорта)>1 тогда
		СоставДляСпорта=Сред(СоставДляСпорта,1,СтрДлина(СоставДляСпорта)-2);
		НаборПолей.Вставить("СоставДляСпорта",СоставДляСпорта);
		НаборПолей.СоставДляСпорта=СтрЗаменить(НаборПолей.составдляспорта,"100% CO | Ластовица Хлопок","Lining| Состав Ластовицы:100% CO| Хлопок"); 	
	КонецЕсли;
	
	ТекСостав=ПолучитьРеквизитРодителя(Номенклатура,"Состав");
	ТекСостав=СтрЗаменить(ТекСостав,"Хлопок","Cotton\Хлопок");
	ТекСостав=СтрЗаменить(ТекСостав,"Полиамид","Polyamide\Полиамид");
	ТекСостав=СтрЗаменить(ТекСостав,"Эластан","Elastane\Эластан");
	ТекСостав=СтрЗаменить(ТекСостав,"Люрекс","Lurex\Люрекс");
	ТекСостав=СтрЗаменить(ТекСостав,"люрекс","Lurex\Люрекс");	
	ТекСостав=СтрЗаменить(ТекСостав,"Бамбук","Bamboo\Бамбук");
	ТекСостав=СтрЗаменить(ТекСостав,"Полиэстер","Polyester\Полиэстер");
	ТекСостав=СтрЗаменить(ТекСостав,"Мерс.Хлопок","Mers.Cotton\Мерс.Хлопок");
	ТекСостав=СтрЗаменить(ТекСостав,"мерс. хлопок","Mers.Cotton\Мерс.Хлопок");
	ТекСостав=СтрЗаменить(ТекСостав,"Мерс. хлопок","Mers.Cotton\Мерс.Хлопок");	
	ТекСостав=СтрЗаменить(ТекСостав,"Вискоза","Viscose\Вискоза");
	ТекСостав=СтрЗаменить(ТекСостав,"Шерсть","Wool\Шерсть");
	ТекСостав=СтрЗаменить(ТекСостав,"Ангора","Angora\Ангора");
	ТекСостав=СтрЗаменить(ТекСостав,"Акрил","Acrylic\Акрил");
	ТекСостав=СтрЗаменить(ТекСостав,"Крапива","Nettle\Крапива");
	ТекСостав=СтрЗаменить(ТекСостав,"Лавсан","Lavsan\Лавсан");
	ТекСостав=СтрЗаменить(ТекСостав,"Микромодал","Micromodal\Микромодaл");
	ТекСостав=СтрЗаменить(ТекСостав,"Модал","Modal\Модал");
	ТекСостав=СтрЗаменить(ТекСостав,"модал","Modal\Модал");
	
	ТекСостав=СтрЗаменить(ТекСостав,"Кашемир","Cashmere\Кашемир");	
	ТекСостав=СтрЗаменить(ТекСостав,"Шелк","Silk\Шелк");
	ТекСостав=СтрЗаменить(ТекСостав,"Шерсть мериноса","Merino wool\Шерсть мериноса");
	ТекСостав=СтрЗаменить(ТекСостав,"Элит","Elit\Элит");
	ТекСостав=СтрЗаменить(ТекСостав,"Протеин молока","Milk protein\Протеин молока");
	ТекСостав=СтрЗаменить(ТекСостав,"Поликолон","Polycolon\Поликолон");
	ТекСостав=СтрЗаменить(ТекСостав,"Термолайт","Thermolite\Термолайт");
	ТекСостав=СтрЗаменить(ТекСостав,"Нейлон","Nylon\Нейлон");
	ТекСостав=СтрЗаменить(ТекСостав,"нейлон","Nylon\Нейлон");
	
	ТекСостав=СтрЗаменить(ТекСостав,"хлопок","Cotton\Хлопок");
	ТекСостав=СтрЗаменить(ТекСостав,"полиамид","Polyamide\Полиамид");
	ТекСостав=СтрЗаменить(ТекСостав,"эластан","Elastane\Эластан");
	ТекСостав=СтрЗаменить(ТекСостав,"бамбук","Bamboo\Бамбук");
	ТекСостав=СтрЗаменить(ТекСостав,"полиэстер","Polyester\Полиэстер");
	ТекСостав=СтрЗаменить(ТекСостав,"мерс.хлопок","Mers.Cotton\Мерс.Хлопок");
	ТекСостав=СтрЗаменить(ТекСостав,"вискоза","Viscose\Вискоза");
	ТекСостав=СтрЗаменить(ТекСостав,"шерсть","Wool\Шерсть");
	ТекСостав=СтрЗаменить(ТекСостав,"ангора","Angora\Ангора");
	ТекСостав=СтрЗаменить(ТекСостав,"акрил","Acrylic\Акрил");
	ТекСостав=СтрЗаменить(ТекСостав,"крапива","Nettle\Крапива");
	ТекСостав=СтрЗаменить(ТекСостав,"лавсан","Lavsan\Лавсан");
	ТекСостав=СтрЗаменить(ТекСостав,"микромодал","Micromodal\Микромодал");
	ТекСостав=СтрЗаменить(ТекСостав,"кашемир","Cashmere\Кашемир");	
	ТекСостав=СтрЗаменить(ТекСостав,"шелк","Silk\Шелк");
	ТекСостав=СтрЗаменить(ТекСостав,"шерсть мериноса","Merino wool\Шерсть мериноса");
	ТекСостав=СтрЗаменить(ТекСостав,"элит","Elit\Элит");
	ТекСостав=СтрЗаменить(ТекСостав,"протеин молока","Milk protein\Протеин молока");
	ТекСостав=СтрЗаменить(ТекСостав,"поликолон","Polycolon\Поликолон");
	ТекСостав=СтрЗаменить(ТекСостав,"термолайт","Thermolite\Термолайт");	
	ТекСостав=СтрЗаменить(ТекСостав,"Полиэфир","Polyether\Полиэфир");	
	ТекСостав=СтрЗаменить(ТекСостав,"Металлизированная нить","Metallized thread\Металлизированная нить");	
	если ИмяМакета="МакетИнформацияУпаковкаОбщаяЧЗ" тогда
		ТекСостав=СтрЗаменить(ТекСостав,"100% Ластовица Cotton\Хлопок",символы.ПС+"Состав ластовицы:100% Cotton/Хлопок");	
		ТекСостав=СтрЗаменить(ТекСостав,"Ластовица 100% Cotton\Хлопок",символы.ПС+"Состав ластовицы:100% Cotton/Хлопок");	
	КонецЕсли;
	НаборПолей.Вставить("Состав", ТекСостав);
	
	возврат НаборПолей;
КонецФункции

Функция ПерезаполнитьТипТовара (ТипТовара,ИмяМакета)
	НаборПолей=новый Структура;
	ТипТовара			= СокрЛП(ТипТовара);				
	ТипТовара=СтрЗаменить(Строка(ТипТовара),"дет.","детские");
	ТипТовара=СтрЗаменить(Строка(ТипТовара),"жен.","женские");
	ТипТовара=СтрЗаменить(Строка(ТипТовара),"муж.","мужские");	
	ТипТовара=СтрЗаменить(Строка(ТипТовара),"Гольфины","получулки");
	ТипТовара=СтрЗаменить(Строка(ТипТовара),"гольфины","получулки");	
	ТипТовара=СтрЗаменить(Строка(ТипТовара),".","");
	НаборПолей.Вставить("ТипТовара",ТипТовара);
	
КонецФункции


Функция ЗаполнитьДанныеИзготовителя (ЗПС,ИмяМакета)
	РеквизитыШапки=ПолучитьРеквизитШапки(зпс,"Контрагент,Контрагент.Код,Контрагент.ЮридическийАдрес,Контрагент.ПолноеНаименование,Контрагент.ПочтовыйАдрес","Документ");
	НаборПолей=новый Структура();
	КодКонтрагента=РеквизитыШапки.Контрагент_Код;
	если КодКонтрагента ="SSR-7303" или  КодКонтрагента="SSP-4032"  тогда    //Пром-Текс ООО (носки GRIFF) и Арт-текс
		Изготовитель=РеквизитыШапки.Контрагент_ПочтовыйАдрес;
		Импортер=Справочники.Организации.ПустаяСсылка();
	иначе
		Изготовитель=РеквизитыШапки.Контрагент_ПолноеНаименование+". "+РеквизитыШапки.Контрагент_ЮридическийАдрес;
	КонецЕсли;
	изготовитель=СтрЗаменить(Изготовитель,"Поставщик ","");
	// Андреев И.Д. 16.02.2021 конец
	НаборПолей.Вставить("Изготовитель", ?(Изготовитель="","","Изготовитель и его адрес: "+Изготовитель));
	НаборПолей.Вставить("Изготовитель2", ?(Изготовитель="","","Изготовитель и его адрес: "+Изготовитель));		
	возврат НаборПолей;
КонецФункции

Функция ДанныеИмпортёра (ИмяМакета,Модель,ДатаВыпуска,Фабрика="",Страна=Неопределено)
	НаборПолей=новый Структура;
	ИмпортерИстория=Неопределено;
	
	если ЗначениеЗаполнено(Страна) Тогда 
		ОтборДляГТД=новый Структура;
		ОтборДляГТД.Вставить("Страна",Страна);
		ГТД = ПолучитьГрупповойПериодическийРеквизит(Модель,"НомерГТД",,ОтборДляГТД);
		если ГТД=Неопределено тогда
			ГТД=Справочники.ГТД.НайтиПоНаименованию("Без номера");
		КонецЕсли;	
	иначе
		ГТД = ПолучитьГрупповойПериодическийРеквизит(Модель,"НомерГТД");
		если ГТД=Неопределено тогда
			ГТД=Справочники.ГТД.НайтиПоНаименованию("Без номера");
		КонецЕсли;
	КонецЕсли;
	
	
	Если (ГТД <> Неопределено или ГТД=Справочники.ГТД.НайтиПоНаименованию("Без номера")) Тогда
		//если (ЗначениеЗаполнено(Страна) и ГТД.СтранаПроисхождения <>  Страна)  тогда
		//	НаборПолей.Вставить("Импортер", Справочники.Контрагенты.ПустаяСсылка());
		//	НаборПолей.Вставить("ЮрАдресИмпортера", "");
		//иначе
		ИмпортерИстория = ГТД.Импортер;
		ИмпортердляИстории = ГТД.Импортер.ПолноеНаименование;
		НаборПолей.Вставить("Импортер", ИмпортерИстория);
		ЮрАдресОрганизации=ПолучитьПоследнееЗначениеИзПериодическиеРеквизитыДокументовИСправочников("ЮридическийАдрес",ИмпортерИстория,ДатаВыпуска); 
		если ЮрАдресОрганизации=Неопределено тогда
			ЮрАдресОрганизации=ИмпортерИстория.ЮридическийАдрес;
		КонецЕсли;
		НаборПолей.Вставить("ЮрАдресИмпортера", ЮрАдресОрганизации);
		НаборПолей.Вставить("ИмпортерИстория", Строка(ИмпортердляИстории)+", "+Строка(ЮрАдресОрганизации));
		//КонецЕсли;
	КонецЕсли;	
	
	НаборПолей.Вставить("ГТД", ГТД);
	
	
	
	если ЗначениеЗаполнено(Страна) тогда
		ОтборДляГТД=новый Структура;
		ОтборДляГТД.Вставить("Страна",Страна);
		Декларация = ПолучитьПериодическийРеквизит(Модель,"Декларация",ТекущаяДата(),,,ОтборДляГТД);		
	иначе
		Декларация = ПолучитьПериодическийРеквизит(Модель,"Декларация",ТекущаяДата());
	КонецЕсли;
	
	если Декларация<>Неопределено тогда 
		НаборПолей.Вставить("Декларация", декларация);
		НаборПолей.Вставить("фабрика",?(Фабрика="","","Адрес по изготовлению продукции: "+Фабрика+" "));		 
		
		//если ЗначениеЗаполнено(Страна) и ГТД.СтранаПроисхождения <>  Страна тогда
		//	НаборПолей.Вставить("Декларация", Неопределено);	
		//иначе
		
		НаборПолей.Вставить("Импортер",СтрЗаменить(Декларация.организация,"«Стиль Трейд»","""Стиль Трейд"""));
		
		ЮрАдресОрганизации=ПолучитьПоследнееЗначениеИзПериодическиеРеквизитыДокументовИСправочников("ЮридическийАдрес",Декларация.организация,ДатаВыпуска); 
		если ЮрАдресОрганизации=Неопределено тогда
			ЮрАдресОрганизации=Декларация.организация.ЮридическийАдрес;
		КонецЕсли;
		НаборПолей.Вставить("ЮрАдресИмпортера",ЮрАдресОрганизации);
		//КонецЕсли;
		
		//если ЗначениеЗаполнено(Импортер) тогда	
		//	НаборПолей.Вставить("Импортер",Импортер);
		//	НаборПолей.Вставить("ЮрАдресИмпортера",ЮрАдресИмпортера);
		//КонецЕсли;
	иначе
		//НаборПолей.Вставить("Декларация", Неопределено);
		//НаборПолей.Вставить("фабрика",?(Фабрика="","","Адрес по изготовлению продукции: "+Фабрика+" "));			
		//если ЗначениеЗаполнено(Импортер) тогда	
		//	НаборПолей.Вставить("Импортер",Импортер);
		//	НаборПолей.Вставить("ЮрАдресИмпортера",ЮрАдресИмпортера);
		//КонецЕсли;
	КонецЕсли;
	если ЗначениеЗаполнено(ИмпортерИстория) тогда
		НаборПолей.Вставить("ИННИмпортера", ИмпортерИстория.ИНН);
		НаборПолей.Вставить("КППИмпортера", ИмпортерИстория.КПП);
	КонецЕсли;
	возврат НаборПолей;
КонецФункции

Функция ЗаполнитьДанныеОрганизации()
	
	НаборПолей=новый Структура;
	ЕЕЭ=ОбщегоНазначения_ПИ.ПолучитьЗначениеКонстанты("ОсновнаяОрганизацияУправленческогоУчета");
	НаборПолей.Вставить("Организация", ЕЕЭ);
	НаборПолей.Вставить("ИННОрганизации", ЕЕЭ.ИНН);
	НаборПолей.Вставить("КППОрганизации", ЕЕЭ.КПП);
	НаборПолей.Вставить("ТелефонОрганизации", ЕЕЭ.Телефоны);	
	Возврат НаборПолей;
КонецФункции
//Кухарь А.Ю.  14.03.2025 конец
Функция РежимТранзакцииУправляемый() Экспорт
	Если НЕ ТранзакцияАктивна() Тогда
		Возврат Ложь;
	КонецЕсли;  
	
	Попытка
		НачатьТранзакцию(РежимУправленияБлокировкойДанных.Автоматический);
		ЗафиксироватьТранзакцию();
	Исключение
		Возврат Истина;
	КонецПопытки; 
	Возврат Ложь;	
КонецФункции


// Кухарь А.Ю.  02.05.2025 начало
Функция ЗакодироватьЛистИКоробкуВСтроку(Лист, НомерКоробки) Экспорт
	
	// Кельманов А.В. - SNL-66 - 2025.12.24 {
	//МассивДанных = Новый Массив;
	//МассивДанных.Добавить(Лист);
	//МассивДанных.Добавить(НомерКоробки);		
	//
	//СтрокаВозврата = стрзаменить(ЗначениеВСтрокуВнутр(МассивДанных),"¶","");
	СтрокаВозврата = СтрЗаменить("{""##" + Лист.УникальныйИдентификатор() + "##" + Строка(НомерКоробки), "¶", "");
	// Кельманов А.В. - SNL-66 - 2025.12.24 }
	
	СтрокаВозврата = СтрЗаменить(СтрокаВозврата, Символы.ПС, "");
	
	Возврат СтрокаВозврата;
	
КонецФункции    

    
//Кухарь А.Ю. 22.01.2026 начало   
// HELP-8550
//Функция РаскодироватьЛистИКоробкуИзСтроки(Данные) Экспорт    
Функция РаскодироватьЛистИКоробкуИзСтроки(знач Данные) Экспорт    
//Кухарь А.Ю. 22.01.2026 конец
	
	
	Данные = СтрЗаменить(Данные, "¶", "");
	
	СтруктураВозврата = Новый Структура("Успех, Ошибки, Лист, НомерКоробки", Ложь, Новый Массив, Неопределено, 0);
	
	// Кельманов А.В. - SNL-66 - 2025.12.24 {
	Если Лев(Данные, 4) = "{""##" Тогда
		
		Данные = Прав(Данные, СтрДлина(Данные) - 4);
		
		ПозицияНачалаЗадвоеннойСтроки = СтрНайти(Данные, "{""##");
		
		Если ПозицияНачалаЗадвоеннойСтроки > 0 Тогда
			
			Данные = Лев(Данные, ПозицияНачалаЗадвоеннойСтроки - 1);
			
		КонецЕсли;
		
		ПозицияРазделителя = СтрНайти(Данные, "##");
		
		Если ПозицияРазделителя = 0 Тогда
			
			СтруктураВозврата.Ошибки.Добавить("Не удалось раскодировать строку. Отсутствует разделитель ##. " + Данные);
			
			Возврат СтруктураВозврата;
			
		КонецЕсли;
		
		ПодстрокаЛист = Лев(Данные, ПозицияРазделителя - 1);
		
		УИД_Листа = Новый УникальныйИдентификатор(ПодстрокаЛист);
		
		Лист_Ссылка = Документы.ЛистНабора.ПолучитьСсылку(УИД_Листа);
		
		Лист_Объект = Лист_Ссылка.ПолучитьОбъект();
		
		Если Лист_Объект = Неопределено Тогда
			
			Лист_Ссылка = Документы.ЛистПереукладки.ПолучитьСсылку(УИД_Листа);
			
			Лист_Объект = Лист_Ссылка.ПолучитьОбъект();
			
			Если Лист_Объект = Неопределено Тогда
				
				СтруктураВозврата.Ошибки.Добавить("Строка не содержит ссылку на ЛН или ЛП");
				
				Возврат СтруктураВозврата;
								
			КонецЕсли;   
			
		КонецЕсли;
		
		ПодстрокаНомерКоробки = Прав(Данные, СтрДлина(Данные) - ПозицияРазделителя - 1);
		
		Попытка
			
			НомерКоробки = Число(ПодстрокаНомерКоробки);
			
		Исключение
			
			СтруктураВозврата.Ошибки.Добавить("Некорректно задан номер коробки");
			
			Возврат СтруктураВозврата;
								
		КонецПопытки;
		
		СтруктураВозврата.Успех = Истина;	
		СтруктураВозврата.Лист = Лист_Ссылка;
		СтруктураВозврата.НомерКоробки = НомерКоробки;
		
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	// Кельманов А.В. - SNL-66 - 2025.12.24 }
	
	Попытка
		
		МассивДанных = ЗначениеИзСтрокиВнутр(Данные);
		
	Исключение   
		
		СтруктураВозврата.Ошибки.Добавить("Не удалось раскодировать строку. " + Данные);
		
		Возврат СтруктураВозврата;
		
	КонецПопытки;
	
	Если ТипЗнч(МассивДанных) <> Тип("Массив") Тогда
		
		СтруктураВозврата.Ошибки.Добавить("Строка не содержит массива данных");
		
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	Если МассивДанных.Количество() <> 2 Тогда  
		
		СтруктураВозврата.Ошибки.Добавить("Массив содержит неправильное количество данных");
		
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	Если ТипЗнч(МассивДанных[0]) <> Тип("ДокументСсылка.ЛистНабора") 
		И ТипЗнч(МассивДанных[0]) <> Тип("ДокументСсылка.ЛистПереукладки") 
		Тогда             
		
		СтруктураВозврата.Ошибки.Добавить("Массив не содержит ЛН или ЛП");
		
		Возврат СтруктураВозврата;
		
	КонецЕсли;   
	
	Если ТипЗнч(МассивДанных[1]) <> Тип("Число") Тогда 
		
		СтруктураВозврата.Ошибки.Добавить("Массив не содержит номера коробки");
		
		Возврат СтруктураВозврата;
		
	КонецЕсли;      
	
	СтруктураВозврата.Успех = Истина;	
	СтруктураВозврата.Лист = МассивДанных[0];
	СтруктураВозврата.НомерКоробки = МассивДанных[1];
	
	Возврат СтруктураВозврата;
	
КонецФункции  
// Кухарь А.Ю.  02.05.2025 конец    

//++Данилова Е.В. 18.06.2025 HELP-5142 
Функция ПолучитьДанныеПоВложеннымШКПоМаркеЧЗ(Знач МаркаЧЗ) Экспорт
	//++Данилова Е.В. 23.01.2026  поменяла запрос 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Владелец КАК Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод) КАК Количество
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|		ПО ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка = ШтрихкодыУпаковокТоваров.Ссылка
	|ГДЕ
	|	ШтрихкодыУпаковокТоваров.Ссылка = &Ссылка
	|	И ШтрихкодыУпаковокТоваров.ТипШК <> ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	|	И ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	|
	|СГРУППИРОВАТЬ ПО
	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Владелец
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод.Владелец,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод)
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|		ПО ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка = ШтрихкодыУпаковокТоваров.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1
	|		ПО (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Ссылка = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод)
	|ГДЕ
	|	ШтрихкодыУпаковокТоваров.Ссылка = &Ссылка
	|	И ШтрихкодыУпаковокТоваров.ТипШК <> ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	|	И ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК <> ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	|	И ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	|
	|СГРУППИРОВАТЬ ПО
	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды1.Штрихкод.Владелец";
	//--Данилова Е.В. 23.01.2026
	
	Запрос.УстановитьПараметр("Ссылка", МаркаЧЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	КоличествоШК = Новый Соответствие; 
	
	МассивТоваров = Новый Массив; 
	//++Данилова Е.В. 04.03.2026 SNL-153 
	КоличествоШКВсего = 0; 
	//--Данилова Е.В. 04.03.2026 
	Пока Выборка.Следующий() Цикл
		
		МассивТоваров.Добавить(Выборка.Номенклатура); 
		КоличествоШК.Вставить(Выборка.Номенклатура,Выборка.Количество); 		
		//++Данилова Е.В. 04.03.2026 SNL-153 
		КоличествоШКВсего = КоличествоШКВсего + Выборка.Количество; 
	//--Данилова Е.В. 04.03.2026
	КонецЦикла;  	
	 
	Возврат Новый Структура("МассивТоваров,КоличествоШК,КоличествоШКВсего",МассивТоваров,КоличествоШК,КоличествоШКВсего);	 
	
	
КонецФункции // HELP-5142()  
// ПроверкаВложенныхЧЗ()
// ()

#Область ПечатьДетскийМир
//Данилова Е.В. 07.05.2026 HELP-8363 
Процедура ПечатьКМКоробкиДетскогоМира(КМКоробки,КМУпаковки,Знач Лист,Знач Контрагент, Знач Накладная, КМАгрегацииДМ = неопределено) экспорт
	Запрос = новый запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	Лист.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.ЛистПереукладки.Товары КАК Лист
	|ГДЕ
	|	Лист.Ссылка = &Лист
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лист.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	|ИЗ
	|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК Лист
	|ГДЕ
	|	Лист.Ссылка = &Лист";
	запрос.УстановитьПараметр("Лист",Лист);
	Пакет = запрос.ВыполнитьПакет();
	ШтрихкодыУпаковок = Пакет[1].Выгрузить(); 
	МассивТоваров = Пакет[0].Выгрузить().ВыгрузитьКолонку("Номенклатура");
	
	
	Если ШтрихкодыУпаковок.Количество() > 0 Тогда		
		//МассивТоваров = ЛистНабора.Товары.ВыгрузитьКолонку("Номенклатура");    
		
		
		
		Если НЕ МаркировкаС.ПроверитьЕАНКоробкиПоМассивуТоваровИзБлочка(МассивТоваров,Контрагент) Тогда
			Сообщить("ШККонтрагента коробки по товарам не совпадает, проверьте матрицу товаров"); 
			Возврат; 
		КонецЕсли;		
		КодАгрегацииНаПечать = ПреобразоватьКМКоробки(КМКоробки,КМУпаковки, Контрагент);
		
		Если Не ЗначениеЗаполнено(КодАгрегацииНаПечать) Тогда
			
			Сообщить("Не удалось записать  агрегационный код для печати для Детского МИРА"); 
			
			Возврат; 
			
			
		КонецЕсли;
	Иначе 
		Сообщить("Не удалось преобразовать  штрихкод для печати для Детского МИРА"); 
		Возврат; 
	КонецЕсли;
	
	НомерКоробки	= ПолучитьНомерКоробки (Накладная,Лист);
	
	ОбработкаПечати = Обработки.ПечатьЭтикетокЧЗ.Создать();
	ИмяМакета="Этикетка_75_120";
	Макет = ОбработкаПечати.ПолучитьМакет(ИмяМакета);
	
	ТД = Новый ТабличныйДокумент;
	ТД.ОтображатьСетку		= Ложь;
	ТД.ОтображатьЗаголовки	= Ложь;	
	ТД.ИмяПараметровПечати	= "ПараметрыПечати_КМ_"+ИмяМакета;	
	
	ДанныеДляПечати	= Неопределено;
	
	ШтукЧЗВКоробке = ШтрихкодыУпаковок.Количество();
	
	ДопПараметры = Новый Структура("Артикул", "");
	
	
	ДопПараметры.Вставить("ОтображатьТекст",ложь); 
	ТипШКАгрегации = ПолучитьРеквизитШапки(Контрагент,"ТипШКАгрегации","Справочник"); 		 
	ПечататьCode128ДляАгрегаций = ТипШКАгрегации = Перечисления.ТипыКодировокШК.Code128;
	АгрегацияВCode128 = Ложь;
	Если ПечататьCode128ДляАгрегаций <> Неопределено Тогда
		АгрегацияВCode128 = ПечататьCode128ДляАгрегаций;	
	КонецЕсли;
	
	Если АгрегацияВCode128 Тогда 
		ДопПараметры.Вставить("АгрегацииВCode128",АгрегацияВCode128);		
	иначе
		ДопПараметры.Вставить("ДобавлятьСкобочкиВТекст",ЛОЖЬ);  		
	КонецЕсли;
	
	ДанныеИзМатрицы = МаркировкаС.ПолучитьДанныеПоНоменклатуреИзМатрицы(КМУпаковки.Владелец,Контрагент);  
	Если ДанныеИзМатрицы = неопределено Тогда	
		Возврат; 		
	КонецЕсли;
	
	АртикулКонтрагента = ДанныеИзМатрицы.КодПроизводителяКонтрагента; 	
	ДопПараметры.Вставить("Заголовок",АртикулКонтрагента + " Кол-во марок: " + Формат(ШтукЧЗВКоробке,"ЧГ=3,0"));
	ДопПараметры.Вставить("ШтрихкодСоСкобками",КодАгрегацииНаПечать.НаименованиеСоСкобками);
	ДопПараметры.Вставить("БезПрефикса",Истина);
	Область = ОбработкаПечати.СформироватьКА(Макет, ПолучитьРеквизитШапки(КодАгрегацииНаПечать,"Наименование","справочник"), НомерКоробки, ШтукЧЗВКоробке, ДопПараметры);	
	ТД.Вывести(Область);
	// Кухарь А.Ю.  27.05.2025 начало
	// HELP-5099
	// тд.Показать();
	если ПараметрыСеанса.ВыводитьПечатныеФормыНаПредпросмотр тогда
		тд.Показать();
	иначе
		тд.Напечатать();
	КонецЕсли; 
	// Кухарь А.Ю.  27.05.2025 конец 
	//++Данилова Е.В. 07.05.2026
	КМАгрегацииДМ = КодАгрегацииНаПечать;  
	//--Данилова Е.В. 07.05.2026 
КонецПроцедуры


Функция ПолучитьНомерКоробки (Накладная,Лист)
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ЛистПереукладки.Ссылка КАК Ссылка,
	|	ЛистПереукладки.Дата КАК Дата
	|ИЗ
	|	Документ.ЛистПереукладки КАК ЛистПереукладки
	|ГДЕ
	|	ЛистПереукладки.Проведен
	|	И ЛистПереукладки.ДокОснование = &Накладная
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	запрос.УстановитьПараметр("Накладная",Накладная);
	ТЗ=запрос.Выполнить().Выгрузить();
	СтрокаТЗ=ТЗ.Найти(Лист,"ссылка");
	возврат ТЗ.Индекс(СтрокаТЗ)+1;
КонецФункции



Функция ПреобразоватьКМКоробки(Знач КМКоробки, Знач КМУпаковки,Знач Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	АгрегационныеКодыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.АгрегационныеКодыКонтрагентов КАК АгрегационныеКодыКонтрагентов
	|ГДЕ
	|	АгрегационныеКодыКонтрагентов.ТипШК = &ТипШК
	|	И АгрегационныеКодыКонтрагентов.ШКЧЗ = &ШКЧЗ
	|	И АгрегационныеКодыКонтрагентов.Контрагент = &Контрагент
	|	И НЕ АгрегационныеКодыКонтрагентов.ПометкаУдаления
	|	///И АгрегационныеКодыКонтрагентов.Номенклатура = &Номенклатура";  //HELP-5557
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ТипШК", Перечисления.ТипыШтрихКодов.Коробка);
	Запрос.УстановитьПараметр("ШКЧЗ", КМКоробки);
	//++Данилова Е.В. 26.05.2025 ASU-2264 HELP-5557
	//Запрос.УстановитьПараметр("Номенклатура", КМУпаковки.Владелец);	
	//--Данилова Е.В. 26.05.2025 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда  	
		
		Возврат МаркировкаС.ЗаписатьНовыйАгрегационныйКодКонтрагентаДМ(КМУпаковки,Контрагент,Перечисления.ТипыШтрихКодов.Коробка,КМКоробки); 
		
	Иначе 
		Выборка = РезультатЗапроса.Выбрать(); 
		Выборка.Следующий(); 
		
		Возврат Выборка.ссылка; 
		
	КонецЕсли;
	
	
КонецФункции


#КонецОбласти
//--Данилова Е.В. 18.06.2025

//++Данилова Е.В. 03.07.2025 HELP-5801 
// <Описание функции>
//
// Параметры:
// МаркаЧЗ  - <СправочникСсылка.ШтрихкодыУпаковокТоваров> - отсканированный ШК, может быть коробка, штука, блочок
//                 
// ШКДляПроверки  - <Массив,СправочникСсылка.ШтрихкодыУпаковокТоваров> - ШК, по которым необходимо проверить статус
//                  Тип ШК - штука
//
// Возвращаемое значение:
//   <Соответствие>   - Ключ:ШтрихКодУпаковки Значение: Статус ШК 
//
Функция НекорректныеСтатусыМарокЧЗШтукиПриСканировании(Знач МаркаЧЗ, ШКДляПроверки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыКМ_ФактСрезПоследних.ШтрихКодУпаковки КАК ШтрихКодУпаковки,
	|	СтатусыКМ_ФактСрезПоследних.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.СтатусыКМ_Факт.СрезПоследних(
	|			,
	|			ШтрихКодУпаковки В (&ШК)
	|				И ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)) КАК СтатусыКМ_ФактСрезПоследних
	|ГДЕ
	|	НЕ СтатусыКМ_ФактСрезПоследних.Статус В (&Статусы)";
	
	СтатусыМассив = Новый Массив; 
	
	Если  МаркаЧЗ.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.ПокупкаВРФ
		ИЛИ МаркаЧЗ.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Импорт 
		ИЛИ МаркаЧЗ.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Производство Тогда
		
		СтатусыМассив.Добавить(Перечисления.СтатусыКодовМаркировкиФакт.ВОбороте);
		//Валетов + 10,03,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-9103 
		Если НЕ МаркаЧЗ.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Импорт Тогда 
			СтатусыМассив.Добавить(Перечисления.СтатусыКодовМаркировкиФакт.Нанесен); 
		КонецЕсли;
		//Валетов-
		
	Иначе
		
		СтатусыМассив.Добавить(Перечисления.СтатусыКодовМаркировкиФакт.Нанесен);
		СтатусыМассив.Добавить(Перечисления.СтатусыКодовМаркировкиФакт.ВОбороте);
		СтатусыМассив.Добавить(Перечисления.СтатусыКодовМаркировкиФакт.Распечатан);   
		
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("ШК",ШКДляПроверки);
	Запрос.УстановитьПараметр("Статусы",СтатусыМассив);  
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ОшибкиШК = Новый Соответствие; 
	
	Пока Выборка.Следующий() Цикл
		
		
		ОшибкиШК.Вставить(Выборка.ШтрихКодУпаковки,Выборка.Статус); 
		
		
	КонецЦикла;
	
	Возврат ОшибкиШК; 
	
	
КонецФункции

// Кельманов А.В. - HELP-5128 - 2025.10.01
Функция ОбработкаСканированияКоробаЧЗДляТСД(ДанныеКороба) Экспорт
	
	СтруктураВозврата = Новый Структура("КодЧЗКороба_Новый, Ошибки, УИД_ЛН, СтруктураНовогоКода", Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка(), "", "",
	// Кельманов А.В. - HELP-8583 - 2026.01.20 {
	//Новый Структура("УИДКодаЧЗ, Наименование, Количество, Количество1, ТипШК, ТипУпаковки, Номенклатура"));
	Новый Структура("УИДКодаЧЗ, Наименование, Количество, Количество1, ТипШК, ТипУпаковки, Номенклатура, ЗначениеШтрихкода"));
	// Кельманов А.В. - HELP-8583 - 2026.01.20 }
	
	МассивОшибок = Новый Массив;
	
	СтруктураДанныхКороба = Десериализовать(Десериализовать(ДанныеКороба).Получить());
	
	КодЧЗКороба = СтруктураДанныхКороба.КодЧЗКороба;
	ТипУпаковки = КодЧЗКороба.ТипУпаковки;
	ТипШК = КодЧЗКороба.ТипШК;
	
	ЗНБ = СтруктураДанныхКороба.ЗНБ;
	Накладная = ЗНБ.Накладная;
	
	РеквизитыНакладной = ПолучитьРеквизитыШапки(Накладная, "Контрагент,СостояниеНакладной", "Документ");
	
	Контрагент = РеквизитыНакладной.Контрагент;
	СостояниеНакладной = РеквизитыНакладной.СостояниеНакладной;
	
	УИД_ЛН = СтруктураДанныхКороба.УИД_ЛН;	
	ЛН = СтруктураДанныхКороба.ЛН;
	
	Если Не ЗначениеЗаполнено(ЛН) Тогда
		
		Если ЗначениеЗаполнено(УИД_ЛН) Тогда
			
			НовыйУИД = Новый УникальныйИдентификатор(УИД_ЛН);
			
		Иначе
			
			НовыйУИД = Новый УникальныйИдентификатор;
			
		КонецЕсли;
		
		ЛН = Документы.ЛистНабора.ПолучитьСсылку(НовыйУИД);
		
	КонецЕсли;
	
	ПравилаРаботыСАгрегациейЧЗ = МаркировкаКС.ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладной(Накладная);		
	
	// Кельманов А.В. - Оптимизация работы - 2026.04.10 {
	//Если Не ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияБлочков 
	Если Не ИспользоватьЛНТолькоДляНабора(Накладная) И Не ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияБлочков 
	// Кельманов А.В. - Оптимизация работы - 2026.04.10 }
		И ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияКоробок Тогда
		
		Если ЕстьЛПСАгрегацией(Накладная) Тогда
			
			МассивОшибок.Добавить("Агрегация начата в листах переукладки");
			
		Иначе
			
			МассивВложенныхШК = КодЧЗКороба.ВложенныеШтрихкоды.ВыгрузитьКолонку("Штрихкод");
			
			ОтсканирШКОшибки = НекорректныеСтатусыМарокЧЗШтукиПриСканировании(КодЧЗКороба, МассивВложенныхШК); 
			
			Если ОтсканирШКОшибки.Количество() > 0 Тогда 
				
				МассивОшибок.Добавить("Во вложениях короба найден ЧЗ отгруженный или списанный!!! Отсканируйте другой короб!");					
				
				Для Каждого ЭлементСоответствия Из ОтсканирШКОшибки Цикл
					
					МассивОшибок.Добавить(СтрШаблон("Статус вложенного ЧЗ %1 в коробку %2", ЭлементСоответствия.Ключ, ЭлементСоответствия.Значение));	
					
				КонецЦикла; 	
				
			Иначе 
				
				МожноИспользоватьФиктКоробки = ПолучитьЗначРеквСпр(Контрагент, "МожноИсполКоробкиИзФиктРНК");
				
				КМНаПереклейку = Ложь;
				
				Если МожноИспользоватьФиктКоробки = Истина Тогда  
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					
					"ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	ШтрихкодыУпаковокТоваров.Ссылка КАК ШтрихКодУпаковки
					|ИЗ
					|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИспользованныеКодыАгрегаций КАК ИспользованныеКодыАгрегаций
					|		ПО ШтрихкодыУпаковокТоваров.Ссылка = ИспользованныеКодыАгрегаций.ШтрихКодУпаковки
					|			И (ИспользованныеКодыАгрегаций.ШтрихКодУпаковки = &ШК)
					|			И (ИспользованныеКодыАгрегаций.Регистратор ССЫЛКА Документ.МаркировкаТоваровИСМП)
					|			И (ИспользованныеКодыАгрегаций.Регистратор.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан))
					|			И (ИспользованныеКодыАгрегаций.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация))
					|			И (ИспользованныеКодыАгрегаций.Регистратор.ДокументОснование ССЫЛКА Документ.РасходнаяНакладная)
					|ГДЕ
					|	ШтрихкодыУпаковокТоваров.Ссылка = &ШК"; 
					
					Запрос.УстановитьПараметр("ШК", КодЧЗКороба); 
					
					РезультатЗапроса = Запрос.Выполнить();
					
					КМНаПереклейку = РезультатЗапроса.Пустой();
					
				Иначе 
					
					КМНаПереклейку = Истина; 
					
				КонецЕсли;
				
				Если Не КМНаПереклейку Тогда 			 
					
					СтруктураВозврата.КодЧЗКороба_Новый = КодЧЗКороба;
					
				Иначе
					
					рБронирования = Документы.МаркировкаТоваровИСМП.ПолучитьРанееЗабронированныйКодАгрегацииДляЛиста(ЛН, Накладная, Перечисления.ТипыШтрихКодов.Коробка);
					
					ПолучаемыйКодАгрегации = Неопределено;
					
					Если Не рБронирования.Успешно Тогда            
						
						Если СостояниеНакладной = Перечисления.СостоянияНакладной.ГотоваКОтгрузке
							Или СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена Тогда					
							
							МассивОшибок.Добавить(СтрШаблон("Недопустимый тип основания: '%1' !", ТипЗнч(ЛН)));
							
						Иначе
							
							ОперАгрегации = Документы.МаркировкаТоваровИСМП.ПолучитьСоздатьДокАгрегации(Накладная, ТипШК);
							
							рБронирования = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныйКодАгрегации(ТипШК, ТипУпаковки, ОперАгрегации, Новый Структура("Добавлять", Истина));
							
							Если рБронирования.Успешно Тогда
								
								ПолучаемыйКодАгрегации = рБронирования.Данные;
								
								рДобавления = Документы.МаркировкаТоваровИСМП.ДобавитьШККоробкиВАгрегацию(ОперАгрегации, ЛН, ПолучаемыйКодАгрегации);
								
								Если Не рДобавления.Успешно Тогда
									
									рБронирования.Успешно = Ложь;						
									
									МаркировкаКС.ДобавитьОшибки(рБронирования, рДобавления);
									
								КонецЕсли;
								
							КонецЕсли;	
							
						КонецЕсли;
						
					Иначе
						
						ПолучаемыйКодАгрегации = рБронирования.Данные[0];
						
					КонецЕсли;
					
					Если рБронирования.Успешно Тогда
						
						Запрос = Новый Запрос;
						
						Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
						|	ЛистНабора.КодАгрегации КАК КодАгрегации,
						|	ЛистНабора.Ссылка КАК Ссылка
						|ИЗ
						|	Документ.ЛистНабора КАК ЛистНабора
						|ГДЕ
						|	ЛистНабора.Проведен
						|	И ЛистНабора.КодАгрегации = &КодАгрегации
						|	И ЛистНабора.Ссылка <> &Ссылка";
						
						Запрос.УстановитьПараметр("КодАгрегации", ПолучаемыйКодАгрегации);
						Запрос.УстановитьПараметр("Ссылка", ЛН);
						
						Выборка = Запрос.Выполнить().Выбрать();
						
						Если Выборка.Следующий() Тогда 
							
							МассивОшибок.Добавить(СтрШаблон("Обнаружен дубль кода %1 в %2", ПолучаемыйКодАгрегации, Выборка.Ссылка));
							
						Иначе
							
							СтруктураВозврата.КодЧЗКороба_Новый = ПолучаемыйКодАгрегации; 
							
						КонецЕсли;
						
					Иначе
						
						МаркировкаКС.ДобавитьОшибки(МассивОшибок, рБронирования);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если МассивОшибок.Количество() > 0 Тогда
		
		СтруктураВозврата.Ошибки = СтрСоединить(МассивОшибок, Символы.ПС);
		
	Иначе
		
		СтруктураВозврата.УИД_ЛН = НовыйУИД;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураВозврата.КодЧЗКороба_Новый) Тогда
		
		ЗаполнитьЗначенияСвойств(СтруктураВозврата.СтруктураНовогоКода, СтруктураВозврата.КодЧЗКороба_Новый);
		
		СтруктураВозврата.СтруктураНовогоКода.УИДКодаЧЗ = СтруктураВозврата.КодЧЗКороба_Новый.УникальныйИдентификатор();	
		
	КонецЕсли;
	
	Ответ = Сериализовать(Новый ХранилищеЗначения(Сериализовать(СтруктураВозврата), Новый СжатиеДанных(9)));
	
	Возврат Ответ;
	
КонецФункции

//+MARK-704 20251126 Михайловский
Процедура ОбновитьЗначКМ(МаркаЧЗ, ТекЗнач, НовЗнач) Экспорт
	Попытка	
		Если ЗначениеЗаполнено(МаркаЧЗ) Тогда
			Если Маркировка_ПИ.ТипТекущегоУзла() = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				ОбМаркаЧЗ = МаркаЧЗ.ПолучитьОбъект();
				ОбМаркаЧЗ.ЗначениеШтрихкода = НовЗнач;
				ОбМаркаЧЗ.Записать();
			Иначе
				МенЗап = РегистрыСведений.КорректировкаЗначениеКМ.СоздатьМенеджерЗаписи();
				МенЗап.ШтрихКодУпаковки =  МаркаЧЗ;
				МенЗап.ЗначениеШтрихкода = ТекЗнач;
				МенЗап.ЗначениеШтрихкода1 = НовЗнач;
				МенЗап.Записать();
			КонецЕсли;	
		КонецЕсли;
	Исключение
	КонецПопытки;	
КонецПроцедуры //-MARK-704 20251126 Михайловский

//+MARK-3664 20260419 Михайловский
Функция ОбновитьЗначКМКонтрИнверсРег(МаркаЧЗ, ТекЗнач, НовЗнач) Экспорт
	//ОбновитьЗначКМ(ДанныеМаркиЧЗ.МаркаЧЗ, ДанныеМаркиЧЗ.ЗначениеШтрихкода, Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(ДанныеДубльПров))); 
	Рез = ""; 
	Прод = Истина;
	Если НЕ Лев(СокрЛП(ТекЗнач), 31) = Лев(СокрЛП(НовЗнач), 31) Тогда
		Если Лев(СокрЛП(ТекЗнач), 31) = СМенитьРег(Лев(СокрЛП(НовЗнач), 31)) Тогда
			Рез = "Проверьте нажат ли CapsLock! Если нажат-нажмите на эту клавишу!";
			НовЗнач1 = Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(СМенитьРег(НовЗнач)));
		Иначе
			Прод = Ложь;
			Рез = "Корректировка КМ не зафиксирована, проблема соответствия sgtin";
			НовЗнач1 = Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(СМенитьРег(НовЗнач)));
		КонецЕсли;	
	Иначе
		НовЗнач1 = Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(НовЗнач));
	КонецЕсли;	  
	Если Прод Тогда
		Попытка	
			Если ЗначениеЗаполнено(МаркаЧЗ) Тогда
				Если Маркировка_ПИ.ТипТекущегоУзла() = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
					ОбМаркаЧЗ = МаркаЧЗ.ПолучитьОбъект();
					ОбМаркаЧЗ.ЗначениеШтрихкода = НовЗнач1;
					ОбМаркаЧЗ.Записать();
				Иначе
					МенЗап = РегистрыСведений.КорректировкаЗначениеКМ.СоздатьМенеджерЗаписи();
					МенЗап.ШтрихКодУпаковки =  МаркаЧЗ;
					МенЗап.ЗначениеШтрихкода = ТекЗнач;
					МенЗап.ЗначениеШтрихкода1 = НовЗнач1;
					МенЗап.Записать();
				КонецЕсли;	
			КонецЕсли;
		Исключение
		КонецПопытки; 
	Иначе
	КонецЕсли;
	Возврат Рез;
КонецФункции

Функция СМенитьРег(Вх) Экспорт
	Рез = "";
	п= 1;
	Пока п <= СтрДлина(Вх) Цикл
		ТекС = Сред(Вх, п, 1);
		номс = КодСимвола(ТекС);
		Если (номс >= 65) И (номс <= 90) Тогда
			Рез = Рез + Символ(97 + (номс - 65));	
		ИначеЕсли (номс >= 97) И (номс <= 122) Тогда
			Рез = Рез + Символ(65 + (номс - 97));
		Иначе     
			Рез = Рез + ТекС;
		КонецЕсли;	
		п = п + 1;
	КонецЦикла;	
	Возврат Рез;
КонецФункции //+MARK-3664 20260419 Михайловский

// Кухарь А.Ю.  30.01.2026 начало
Функция ПолучитьТаблицуТоваровКАдресногоХранения (Знач ДокументСсылка, Знач ИмяТЧ,ДопПараметры = Неопределено) Экспорт  
	ИмяДокумента = ДокументСсылка.Метаданные().Имя;  
	ИмяПоляНоменклатура = "Номенклатура";
	ИмяПоляКоличество = "Количество";
	СсылкаПН = "";
	
	если ТипЗнч(ДопПараметры) = Тип("Структура") тогда  
		Если ДопПараметры.Свойство("ИмяПоляНоменклатура") тогда  
			ИмяПоляНоменклатура = ДопПараметры.ИмяПоляНоменклатура;		
		КонецЕсли;   	
		Если ДопПараметры.Свойство("ИмяПоляКоличество") тогда  
			ИмяПоляКоличество = ДопПараметры.ИмяПоляКоличество;		
		КонецЕсли;	
		
		Если ДопПараметры.Свойство("ПН") тогда  
			СсылкаПН = ДопПараметры.ПН;		
		КонецЕсли;    
		
	КонецЕсли;
	
	Запрос = новый запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура, 
	|	ТаблицаТоваров.Номенклатура.Код КАК Код,
	|	СУММА(ТаблицаТоваров.Количество) КАК Количество
	|ИЗ
	|	Документ.РасходнаяНакладная.Товары КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.Ссылка = &ДокументСсылка
	|	И ТаблицаТоваров.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Номенклатура";      
	
	запрос.Текст = СтрЗаменить(запрос.Текст,"Документ.РасходнаяНакладная"	,"Документ."+ИмяДокумента);	
	запрос.Текст = СтрЗаменить(запрос.Текст,"Товары КАК ТаблицаТоваров"		,ИмяТЧ+ " КАК ТаблицаТоваров");
	запрос.Текст = СтрЗаменить(запрос.Текст,"ТаблицаТоваров.Номенклатура"	,"ТаблицаТоваров."+ИмяПоляНоменклатура);	
	запрос.Текст = СтрЗаменить(запрос.Текст,"ТаблицаТоваров.Количество"		,"ТаблицаТоваров."+ИмяПоляКоличество);	
	запрос.УстановитьПараметр("ДокументСсылка",ДокументСсылка);  
	
	ТаблицаИсходная  = запрос.Выполнить().Выгрузить();
	//ТаблицаСАдресами = ВозвратНоменклатурыВАдресеВременная(ТаблицаИсходная);   
	
	//ТЮА 03.02.2026         сссылка на накладную
	ТаблицаСАдресами = ADRESS.ВернутьОстатокНоменклатурыВАдресномХранении(ТаблицаИсходная, ДокументСсылка); 
	
	если ТаблицаСАдресами = Неопределено тогда   //Тут можно воткнуть отключение адресного хранения, вернув неопределено   
		ТаблицаСАдресами = новый ТаблицаЗначений;
		ТаблицаСАдресами.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТаблицаСАдресами.Колонки.Добавить("КоличествоВСекторе",Новый ОписаниеТипов("Число"));
		ТаблицаСАдресами.Колонки.Добавить("Сектор",Новый ОписаниеТипов("Строка"));
	КонецЕсли;
	
	запрос.УстановитьПараметр("ТаблицаИсходная",ТаблицаИсходная); 	
	запрос.УстановитьПараметр("ТаблицаСАдресами",ТаблицаСАдресами); 	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаИсходная.Номенклатура КАК Номенклатура,
	               |	ТаблицаИсходная.Количество КАК Количество,
	               |	ЛОЖЬ КАК АдресноеХранение
	               |ПОМЕСТИТЬ ВТИсходная
	               |ИЗ
	               |	&ТаблицаИсходная КАК ТаблицаИсходная
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаСАдресами.Номенклатура КАК Номенклатура,
	               |	ТаблицаСАдресами.КоличествоВСекторе КАК КоличествоВСекторе
	               |ПОМЕСТИТЬ ВТСАдресамиНачальная
	               |ИЗ
	               |	&ТаблицаСАдресами КАК ТаблицаСАдресами
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТСАдресамиНачальная.Номенклатура КАК Номенклатура,
	               |	СУММА(ВТСАдресамиНачальная.КоличествоВСекторе) КАК КоличествоВСекторе,
	               |	ИСТИНА КАК АдресноеХранение
	               |ПОМЕСТИТЬ ВтАдресаСвернутая
	               |ИЗ
	               |	ВТСАдресамиНачальная КАК ВТСАдресамиНачальная
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТСАдресамиНачальная.Номенклатура
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(ВТСАдресамиНачальная.КоличествоВСекторе) > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТИсходная.Номенклатура КАК Номенклатура,
	               |	МАКСИМУМ(ЕСТЬNULL(ВтАдресаСвернутая.АдресноеХранение, ВТИсходная.АдресноеХранение)) КАК АдресноеХранение
	               |ИЗ
	               |	ВТИсходная КАК ВТИсходная
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВтАдресаСвернутая КАК ВтАдресаСвернутая
	               |		ПО ВТИсходная.Номенклатура = ВтАдресаСвернутая.Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТИсходная.Номенклатура";          
	
	   возврат запрос.Выполнить().Выгрузить();
	 
КонецФункции         


Функция ВозвратНоменклатурыВАдресеВременная (знач ТаблицаНоменклатуры)
	возврат Неопределено;
	запрос = новый запрос;   
	Запрос.УстановитьПараметр("ТЗ",ТаблицаНоменклатуры);
	запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.Номенклатура КАК Номенклатура,
	               |	0 КАК КоличествоВСекторе,
	               |	"""" КАК Сектор
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.Номенклатура КАК Номенклатура,
	               |	ВТ.КоличествоВСекторе КАК КоличествоВСекторе,
	               |	ВТ.Сектор КАК Сектор
	               |ИЗ
	               |	ВТ КАК ВТ"; 
	
	ТаблицаВозвращаемая = запрос.Выполнить().Выгрузить();
	СтрТЗ = ТаблицаВозвращаемая[2];  
	СтрТЗ.КоличествоВСекторе = 2;
	СтрТЗ.Сектор = "123";
	
	СтрТЗ = ТаблицаВозвращаемая[3];  
	СтрТЗ.КоличествоВСекторе = 4;
	СтрТЗ.Сектор = "321";     
	
	Возврат ТаблицаВозвращаемая;
	
		
КонецФункции
// Кухарь А.Ю.  30.01.2026 конец

// Кельманов А.В. - ASU-2700 - 2026.01.28
Функция ДополнитьРеестрСканированияДаннымиСТСД(ДанныеСканирования) Экспорт
	
	Ошибки = "";
	
	МассивДанныхСканирования = Десериализовать(Десериализовать(ДанныеСканирования).Получить());
	
	МассивОшибок = Новый Массив;
	
	Если МассивДанныхСканирования <> Неопределено Тогда
		
		Для Каждого ЭлементДанныхСканирования Из МассивДанныхСканирования Цикл
			
			ШтрихКод = ЭлементДанныхСканирования.ШтрихКод;
			ДокументСканирования = ЭлементДанныхСканирования.ДокументСканирования;  

			ДопПараметры = Новый Структура;
			
			Если ЗначениеЗаполнено(ЭлементДанныхСканирования.ИД_Записи) Тогда
				ДопПараметры.Вставить("ИД_Записи", ЭлементДанныхСканирования.ИД_Записи);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭлементДанныхСканирования.ФизЛицо) Тогда
				ДопПараметры.Вставить("ФизЛицо", ЭлементДанныхСканирования.ФизЛицо);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭлементДанныхСканирования.РабочееМесто) Тогда
				ДопПараметры.Вставить("РабочееМесто", Справочники.РабочиеМеста.НайтиПоНаименованию(ЭлементДанныхСканирования.РабочееМесто));
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭлементДанныхСканирования.Знак) Тогда
				ДопПараметры.Вставить("Знак", ЭлементДанныхСканирования.Знак);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭлементДанныхСканирования.СостояниеСканера) Тогда
				ДопПараметры.Вставить("СостояниеСканера", ЭлементДанныхСканирования.СостояниеСканера);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭлементДанныхСканирования.Дата) Тогда
				ДопПараметры.Вставить("Дата", ЭлементДанныхСканирования.Дата);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭлементДанныхСканирования.КодировкаШК) Тогда
				ДопПараметры.Вставить("КодировкаШК", ЭлементДанныхСканирования.КодировкаШК);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭлементДанныхСканирования.ТипШК) Тогда
				ДопПараметры.Вставить("ТипШК", ЭлементДанныхСканирования.ТипШК);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭлементДанныхСканирования.НазначениеШК) Тогда
				ДопПараметры.Вставить("НазначениеШК", Справочники.НазначенияШК[ЭлементДанныхСканирования.НазначениеШК]);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭлементДанныхСканирования.ДанныеПоШК) Тогда
				ДопПараметры.Вставить("ДанныеПоШК", ЭлементДанныхСканирования.ДанныеПоШК);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭлементДанныхСканирования.ТекстОшибки) Тогда
				ДопПараметры.Вставить("ТекстОшибки", ЭлементДанныхСканирования.ТекстОшибки);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭлементДанныхСканирования.ДопИнфо) Тогда
				ДопПараметры.Вставить("ДопИнфо", ЭлементДанныхСканирования.ДопИнфо);
			КонецЕсли;
			
			// Кельманов А.В. - SNL-196 - 2026.04.14 {
			Если ЭлементДанныхСканирования.Свойство("ДокументЗадание") И ЗначениеЗаполнено(ЭлементДанныхСканирования.ДокументЗадание) Тогда
				
				ДопПараметры.Вставить("ДокументЗадание", ЭлементДанныхСканирования.ДокументЗадание);
				
			Иначе
				
				Если ЗначениеЗаполнено(ЭлементДанныхСканирования.ДокументСканирования) Тогда
					
					Если ТипЗнч(ЭлементДанныхСканирования.ДокументСканирования) = Тип("ДокументСсылка.ЛистСборкиКомплектовЧЗ")
						И ЗначениеЗаполнено(ЭлементДанныхСканирования.ДокументСканирования.ДокОснование) Тогда
						
						ДопПараметры.Вставить("ДокументЗадание", ЭлементДанныхСканирования.ДокументСканирования.ДокОснование);
						
					ИначеЕсли ТипЗнч(ЭлементДанныхСканирования.ДокументСканирования) = Тип("ДокументСсылка.ЛистПереукладки") 
						И ЗначениеЗаполнено(ЭлементДанныхСканирования.ДокументСканирования.ЗаданиеНаАгрегацию) Тогда
						
						ДопПараметры.Вставить("ДокументЗадание", ЭлементДанныхСканирования.ДокументСканирования.ЗаданиеНаАгрегацию);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			// Кельманов А.В. - SNL-196 - 2026.04.14 }
			
			Попытка
				
				ЗаписатьФактСканирования_Временная(ШтрихКод, ДокументСканирования, ДопПараметры);
				
			Исключение                                   
				
				ТекстСообщения = СтрШаблон("Ошибка записи пика ! ШК: '%1', док-т: '%2', ошибка: '%3' !", СокрЛП(ШтрихКод), ДокументСканирования, ОписаниеОшибки());
				
				МассивОшибок.Добавить(ТекстСообщения);
				
			КонецПопытки;
					
		КонецЦикла;
		
	КонецЕсли;
	
	Если МассивОшибок.Количество() > 0 Тогда
		
		Ошибки = СтрСоединить(МассивОшибок, Символы.ПС);
		
	КонецЕсли;
		
	Возврат Ошибки;
	
КонецФункции

// Кельманов А.В. - ASU-2700 - 2026.02.03
Функция ЗаписатьФактСканирования_Временная(ШтрихКод, ДокументСканирования, ДопПараметры = Неопределено) Экспорт
	
	НазначениеШК = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "НазначениеШК");

	Если НазначениеШК = Неопределено Тогда
		НазначениеШК = Маркировка_ПИ.ПолучитьНазначениеПоШК(ШтрихКод);
	КонецЕсли;
	
	Накладная = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Накладная");
	
	Если Не ЗначениеЗаполнено(Накладная) Тогда
		Накладная = МаркировкаС.НакладнаяПоДокументуСканирования(ДокументСканирования);	
	КонецЕсли; 

	// Кельманов А.В. - SNL-119 - 2026.03.16 {
	//ИД_Записи = Новый УникальныйИдентификатор(МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ИД_Записи"));
	ПараметрИД_Записи = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ИД_Записи");
	
	Если ПараметрИД_Записи = Неопределено Тогда
		ИД_Записи = Новый УникальныйИдентификатор;
	Иначе
		ИД_Записи = Новый УникальныйИдентификатор(ПараметрИД_Записи);
	КонецЕсли;
	// Кельманов А.В. - SNL-119 - 2026.03.16 }	
	
	Запись = РегистрыСведений.РеестрСканирования.СоздатьМенеджерЗаписи();
	
	Запись.ИД_Записи = ИД_Записи;
	
	Запись.Прочитать();
	
	Если Не Запись.Выбран() Тогда
		
		Запись.ИД_Записи = ИД_Записи;
		Запись.Автор = ПараметрыСеанса.Пользователь;
		Запись.ФизЛицо = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ФизЛицо");
		Запись.РабочееМесто = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "РабочееМесто");
		Запись.Знак = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Знак");
		Запись.СостояниеСканера = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "СостояниеСканера");
		Запись.ДокументСканирования = ДокументСканирования;
		Запись.Накладная = Накладная;
		Запись.Дата = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Дата");
		Запись.КодировкаШК = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "КодировкаШК");
		Запись.ТипШК = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ТипШК");	
		Запись.НазначениеШК	= НазначениеШК;
		Запись.ДанныеПоШК = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ДанныеПоШК");
		Запись.ШтрихКод = ШтрихКод;	
		Запись.ТекстОшибки = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ТекстОшибки"); 
		Запись.ДопИнфо = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ДопИнфо");
		Запись.ДокументЗадание = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ДокументЗадание"); // Кельманов А.В. - SNL-196 - 2026.04.14
		
		Запись.Записать(Ложь);
		
	КонецЕсли;
		
КонецФункции

// Кельманов А.В. - MARK-3462 - 2026.02.08
Функция ПроверитьВЧЗКодыДокумента_ДляТСД(ДанныеДокумента) Экспорт
	
	Ошибки = "";
	
	СтруктураДанныхДокумента = Десериализовать(Десериализовать(ДанныеДокумента).Получить());
	
	ДокДляПроверки = СтруктураДанныхДокумента.Документ;
	
	Если Маркировка_ПИ.ВыполнятьОнлайнПроверкиКМ() Тогда			
		
		Результат = МаркировкаС.ПроверитьКМпоДокументу(ДокДляПроверки);
		
		Если Результат.Успешно = Ложь Тогда
			
			Если Результат.Ошибки.Количество() > 0 Тогда
				
				Ошибки = СтрСоединить(Результат.Ошибки, Символы.ПС);
				
			КонецЕсли;
			
			Если ТипЗнч(Результат.Данные) = Тип("ТаблицаЗначений") И Результат.Данные.Количество() > 0 Тогда
				
				Ошибки = СокрЛП(Ошибки + Символы.ПС + СтрШаблон("Обнаружено %1 ошибок в КМ !", Результат.Данные.Количество()));					

			КонецЕсли;				

		КонецЕсли;
		
		Если Результат.Свойство("ОшибкаЧЗ") И Результат.ОшибкаЧЗ = Истина Тогда
			
			Ошибки = "Ошибка ЧЗ";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ошибки;
	
КонецФункции
	
// Кельманов А.В. - SNL-119 - 2026.02.20
Функция ИспользоватьЛНТолькоДляНабора(Накладная) Экспорт 
	
	Если Не ЗначениеЗаполнено(Накладная) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	РеквизитыДокументов_Накладная = ПолучитьЗначениеРеквизитовДокументов(Накладная, "ИспользоватьЛНТолькоДляНабора");
	
	ИспользоватьЛНТолькоДляНабора = Ложь;
	
	Для Каждого Стр Из РеквизитыДокументов_Накладная Цикл
		
		Если Стр.ЗначениеРеквизита = Истина Тогда
			
			ИспользоватьЛНТолькоДляНабора = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ИспользоватьЛНТолькоДляНабора;
	
КонецФункции

// Чирков Д.С. 11.03.2026
Функция СледующийРабочийДень(Дата) Экспорт
	Результат = КонецДня(Дата) + 1; 
	
	Запрос = Новый запрос;
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Дата
	|ИЗ
	|	Справочник.Календарь.Дни
	|ГДЕ	
	|	Дата > &Дата
	|	И Часы >0
	|	И НЕ Ссылка.ПометкаУдаления = Истина
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|";
	
	Запрос.УстановитьПараметр("Дата", НачалоДня(Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Дата) Тогда
		Результат = Выборка.Дата;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //СледующийРабочийДень(Дата) Экспорт

// Чирков Д.С. 20.03.2026
Функция ПустойУИД() Экспорт
	Возврат Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
КонецФункции //ПустойУИД()

Функция УдалитьЭлементыИзМассива(ИсходныйМассив, УдаляемыеЭлементы) Экспорт
	
	Для Каждого ЭлементМассива Из УдаляемыеЭлементы Цикл
	
		ПорядковыйНомер = ИсходныйМассив.Найти(ЭлементМассива);
		Если ПорядковыйНомер <> Неопределено Тогда
			ИсходныйМассив.Удалить(ПорядковыйНомер);
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат ИсходныйМассив;
КонецФункции

//Кухарь А.Ю.  16.04.2026 начало
//OUT-209
Функция ПолучитьИСформироватьОтчетРасшифровки (Знач ВнешнийОтчет, ТаблицаПолейОтбора) Экспорт  
	СтруктураВозврата = новый Структура("Успех,Ошибки",ложь,Новый Массив);	
	
	ВидОтчета = ОбщегоНазначения_ПИ.ПолучитьЗначениеРСРеквизитыСправочников(ВнешнийОтчет,"ОтчетРасшифровки","");     
	ИмяНастройки = ОбщегоНазначения_ПИ.ПолучитьЗначениеРСРеквизитыСправочников(ВнешнийОтчет,"ИмяНастройкиРасшифровки","");
	
	если не ЗначениеЗаполнено(ВидОтчета) тогда  
		СтруктураВозврата.Ошибки.Добавить("В РС реквизиты справочников не добавлен реквизит ОтчетРасшифровки");  
		Возврат СтруктураВозврата;
	КонецЕсли;                   
	
	если ИмяНастройки = "" тогда  
		СтруктураВозврата.Ошибки.Добавить("В РС реквизиты справочников не добавлен реквизит ИмяНастройки");
		Возврат СтруктураВозврата;
	КонецЕсли;            
	
       
	
	
	Отчет=Отчеты.ОбщийОтчетНаКомпоновке.Создать();	
	Отчет.ВидОтчета=ВидОтчета;					
	
	ИмяОтчета = "ОбщийОтчетНаКомпоновке_"+ПолучитьРеквизитШапки(ВидОтчета,"Код","Справочник");
	
	
	запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	|	НастройкиОбъектов.ЗначениеНастройки КАК ЗначениеНастройки
	|ИЗ
	|	РегистрСведений.НастройкиОбъектов КАК НастройкиОбъектов
	|ГДЕ
	|	НастройкиОбъектов.ИмяОбъекта = &ИмяОтчета
	|	И НастройкиОбъектов.Пользователь = &Пользователь";
	запрос.УстановитьПараметр("Пользователь",Справочники.Пользователи.НастройкиПоУмолчанию);      
	запрос.УстановитьПараметр("ИмяОтчета",ИмяОтчета);
	
	результат = запрос.Выполнить().Выбрать();   
	если результат.Количество() = 0 тогда   
		СтруктураВозврата.Ошибки.Добавить("Не найдены общие настройки отчёта по имени "+ИмяНастройки);
		возврат СтруктураВозврата;
	КонецЕсли;      
	
	пока результат.Следующий() цикл 
		ОбщиеНастройки = результат.ЗначениеНастройки.получить();       
		НужнаяНастройка = ОбщиеНастройки.Дерево.Строки.найти(ИмяНастройки);
		если НужнаяНастройка <> Неопределено тогда   
			НужнаяНастройкаКомпоновщика =  НужнаяНастройка.Значение.НастройкиКомпоновщика;
		иначе  
			СтруктураВозврата.Ошибки.Добавить("Не найдены общие настройки отчета по имени "+ИмяНастройки);
			возврат СтруктураВозврата;		
		КонецЕсли;
	КонецЦикла;    
	
	ФормаОтчета=Отчет.ПолучитьФорму();		
	Настройки = новый Структура("Дата1,Дата2,НастройкиКомпоновщика");  	
	настройки.Дата1 = НачалоГода(ТекущаяДата())-86400*365*2;
	настройки.Дата2 = КонецГода(ТекущаяДата())+86400*365*2; 
	ЭлементыОтбора = НужнаяНастройкаКомпоновщика.Отбор.Элементы;    
	
	
	
	для каждого ТекЭлемент из ЭлементыОтбора цикл      
		СтрокаТЗОтбора = ТаблицаПолейОтбора.найти(Строка(ТекЭлемент.ЛевоеЗначение),"ИмяПоля");
		если СтрокаТЗОтбора <> Неопределено тогда         
			ТекЭлемент.ПравоеЗначение = СтрокаТЗОтбора.ЗначениеПоля;	
		КонецЕсли;
	КонецЦикла;         
	
	
	
	настройки.НастройкиКомпоновщика = НужнаяНастройкаКомпоновщика;
	ФормаОтчета.Открыть();			
	ФормаОтчета.Дата1=Настройки.Дата1;											
	ФормаОтчета.Дата2=Настройки.Дата2;		
	ФормаОтчета.ВосстановитьНастройкуОтчета(Настройки);	
	ФормаОтчета.Сформировать(неопределено);
	
	если СтруктураВозврата.Ошибки.Количество() = 0 тогда
		СтруктураВозврата.Успех = Истина;
	КонецЕсли;   
	
	Возврат СтруктураВозврата;
	
	
КонецФункции
//Кухарь А.Ю.  16.04.2026 конец


Функция МожноРедактироватьРНКсАвансами(Ссылка)
	Результат = Истина;
	Если ЗначениеЗаполнено(Ссылка) И ТипЗнч(Ссылка) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		// Кухарь А.Ю.  09.06.2026 начало
		// Наряд 0000001114
		// рШапки = ПолучитьРеквизитыШапки(Ссылка, "Договор,ДатаОтгрузки");                
		//Если Справочники.Договоры.ЭтоДоговорПродажиСПредоплатой(рШапки.Договор) Тогда		
		рШапки = ПолучитьРеквизитыШапки(Ссылка, "Договор,ДатаОтгрузки,СостояниеНакладной");		 
		Если Справочники.Договоры.ЭтоДоговорПродажиСПредоплатой(рШапки.Договор)  и  рШапки.СостояниеНакладной <> Перечисления.СостоянияНакладной.ВРаботе Тогда
			// Кухарь А.Ю.  09.06.2026 конец
			ПерсональнаяДЗД	= ПолучитьПолномочиеПользователя("ПерсональнаяДатаЗапретаРедактирования", ПараметрыСеанса.Пользователь);
			
			Если ЗначениеЗаполнено(ПерсональнаяДЗД) Тогда
				ДЗР_Авансы = ПерсональнаяДЗД;
			Иначе
				ДЗР_Авансы = КонецДня(Константы.ДатаЗапретаРедактированияРНКпоАвансовымДоговорам.Получить());							
			КонецЕсли;                                                                                                  
			Если ЗначениеЗаполнено(рШапки.ДатаОтгрузки) И рШапки.ДатаОтгрузки <= ДЗР_Авансы  Тогда
				Результат = Ложь;
			КонецЕсли;			
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции //МожноРедактироватьРНКсАвансами(Ссылка)

// Кельманов А.В. - SNL-120 - 2026.04.10
Функция ОбработатьЗагруженныйСТСДЛистПереукладкиFBS(ДанныеЛП) Экспорт
	
	Ошибки = "";
	
	МассивОшибок = Новый Массив;
	
	СтруктураДокумента = Десериализовать(Десериализовать(ДанныеЛП).Получить());
	
	РеквизитыШапки = СтруктураДокумента.РеквизитыШапки;
	МассивТовары = СтруктураДокумента.МассивТовары;
	МассивШтрихкодыУпаковок = СтруктураДокумента.МассивШтрихкодыУпаковок;
	МассивШтрихкодыУпаковокДляЛСК = СтруктураДокумента.МассивШтрихкодыУпаковокДляЛСК;
	//МассивОшибкиСотрудников = СтруктураДокумента.МассивОшибкиСотрудников;
	
	// Кельманов А.В. - SNL-246 - 2026.05.26 {
	МассивТекущаяБригада = Новый Массив;
	
	Если СтруктураДокумента.Свойство("МассивТекущаяБригада") Тогда
		
		МассивТекущаяБригада = СтруктураДокумента.МассивТекущаяБригада;
		
	КонецЕсли;
	// Кельманов А.В. - SNL-246 - 2026.05.26 }
	
	Новый_УИДНакладной = Новый УникальныйИдентификатор(РеквизитыШапки.УИДНакладной);
	
	Накладная = Документы.РасходнаяНакладная.ПолучитьСсылку(Новый_УИДНакладной);
	
	Накладная_Объект = Накладная.ПолучитьОбъект();
	
	Если Накладная_Объект = Неопределено Тогда
		
		Ошибки = "Не найдена накладная по УИД";
		
		Возврат Ошибки;
		
	КонецЕсли;
	
	РеквизитыШапкиНакладная = ПолучитьРеквизитыШапки(Накладная, "СостояниеНакладной", "Документ");
	
	СостояниеНакладной = РеквизитыШапкиНакладная.СостояниеНакладной;
	
	Если СостояниеНакладной <> Перечисления.СостоянияНакладной.Переукладка Тогда
		
		Ошибки = "Состояние накладной: " + СостояниеНакладной + ". Нельзя выгружать листы переукладки в базу склада.";
		
		Возврат Ошибки;
		
	КонецЕсли;
	
	Новый_УИД = Новый УникальныйИдентификатор(РеквизитыШапки.УИД);
	
	ЛП = Документы.ЛистПереукладки.ПолучитьСсылку(Новый_УИД);
	
	ЛП_Объект = ЛП.ПолучитьОбъект();
	
	Если ЛП_Объект = Неопределено Тогда
		
		ЛП_Объект = Документы.ЛистПереукладки.СоздатьДокумент();
		
		ЛП_Объект.УстановитьСсылкуНового(ЛП);
		
	КонецЕсли;
	
	ЛП_Объект.Заполнить(Накладная);
		
	Если РеквизитыШапки.Свойство("КодУзла") Тогда
		
		ЛП_Объект.УзелТСД = ПланыОбмена.МобильныеТСД.НайтиПоКоду(РеквизитыШапки.КодУзла);
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЛП_Объект, РеквизитыШапки); 
	
	// Кельманов А.В. - SNL-234 - 2026.05.15 {
	РезультатПоиска = Документы.ЛистПереукладки.НайтиЕдиныйЗНАПоРНК(Накладная);
	
	Если РезультатПоиска.Успех Тогда
		
		ЛП_Объект.ЗаданиеНаАгрегацию = РезультатПоиска.Данные;
		
	КонецЕсли; 
	// Кельманов А.В. - SNL-234 - 2026.05.15 }
	
	ЛП_Объект.Товары.Очистить();
	ЛП_Объект.ШтрихкодыУпаковок.Очистить();
	ЛП_Объект.Бригада.Очистить(); // Кельманов А.В. - SNL-246 - 2026.05.26
	
	//ЛН_Объект.ОшибкиСотрудников.Очистить();	
	
	ЛП_Объект.РежимСканирования = Перечисления.РежимСканирования.Добавление; 
	
	Для Каждого Стр Из МассивТовары Цикл
		
		НовСтр = ЛП_Объект.Товары.Добавить();
		
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		
	КонецЦикла;
	
	Для Каждого Стр Из МассивШтрихкодыУпаковок Цикл
		
		НовСтр = ЛП_Объект.ШтрихкодыУпаковок.Добавить();
		
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		
	КонецЦикла;
	
	// Кельманов А.В. - SNL-246 - 2026.05.26 {
	Для Каждого Сотрудник Из МассивТекущаяБригада Цикл
		
		СтрБригада = ЛП_Объект.Бригада.Добавить();
		
		СтрБригада.Сотрудник = Сотрудник;
		
	КонецЦикла;			
	// Кельманов А.В. - SNL-246 - 2026.05.26 }
	
	//Для Каждого Стр Из МассивОшибкиСотрудников Цикл
	//	
	//	НовСтр = ЛП_Объект.ОшибкиСотрудников.Добавить();
	//	
	//	ЗаполнитьЗначенияСвойств(НовСтр, Стр);
	//	
	//КонецЦикла;
	
	Если МассивШтрихкодыУпаковокДляЛСК.Количество() > 0 Тогда
		
		Если РеквизитыШапки.Свойство("ЗСБ") И ЗначениеЗаполнено(РеквизитыШапки.ЗСБ) Тогда
			
			Если ЗначениеЗаполнено(ЛП_Объект.ЛСК) Тогда
				
				// Кельманов А.В. - Исправление ошибки - 2026.07.01 {
				//ЛСКОбъект = ЛП_Объект.ЛСК;
				ЛСК = ЛП_Объект.ЛСК;

				ЛСКОбъект = ЛСК.ПолучитьОбъект();
				// Кельманов А.В. - Исправление ошибки - 2026.07.01 }
				
			Иначе
				
				// Кельманов А.В. - HELP-9791 + HELP-9793 - 2026.05.18 {
				//ЛСК = Документы.ЛистСборкиКомплектовЧЗ.ПолучитьЛСКДляFBS(РеквизитыШапки.ЗСБ, ЛП_Объект.УзелТСД, ЛП_Объект.СканировщикФизЛицо, Истина);
				ЛСК = Документы.ЛистСборкиКомплектовЧЗ.ПолучитьЛСКДляFBS(РеквизитыШапки.ЗСБ, ЛП_Объект.УзелТСД, ЛП_Объект.СканировщикФизЛицо, , Истина);
				// Кельманов А.В. - HELP-9791 + HELP-9793 - 2026.05.18 }
				
				ЛП_Объект.ЛСК = ЛСК;
				
				ЛСКОбъект = ЛСК.ПолучитьОбъект();
				
			КонецЕсли;
		
			ЛСКОбъект.Товары.Очистить();
			ЛСКОбъект.ШтрихкодыУпаковок.Очистить();
			ЛСКОбъект.Бригада.Очистить(); // Кельманов А.В. - SNL-246 - 2026.05.26
			
			ЛСКОбъект.Дата = РеквизитыШапки.ДатаОкончанияСканирования; 
			ЛСКОбъект.ДатаОкончанияСканирования = РеквизитыШапки.ДатаОкончанияСканирования;
						
			Если Не ЗначениеЗаполнено(ЛСКОбъект.ДатаНачалаСканирования) Тогда
				ЛСКОбъект.ДатаНачалаСканирования = РеквизитыШапки.ДатаНачалаСканирования;  
			КонецЕсли;
			
			// Кельманов А.В. - ИЗМ-0000000124 - 2026.07.01 {
			Если Не ЗначениеЗаполнено(ЛСКОбъект.ЛистНабора) Тогда
				
				ЛСКОбъект.ЛистНабора = ЛП_Объект.Ссылка;
				
			КонецЕсли;
			// Кельманов А.В. - ИЗМ-0000000124 - 2026.07.01 }
			
			Для Каждого Стр Из МассивШтрихкодыУпаковокДляЛСК Цикл
			
				НовСтр = ЛСКОбъект.ШтрихкодыУпаковок.Добавить();
				
				ЗаполнитьЗначенияСвойств(НовСтр, Стр);
				
			КонецЦикла;
	
			// Кельманов А.В. - SNL-246 - 2026.05.26 {
			Для Каждого Сотрудник Из МассивТекущаяБригада Цикл
				
				СтрБригада = ЛСКОбъект.Бригада.Добавить();
				
				СтрБригада.Сотрудник = Сотрудник;
				
			КонецЦикла;			
			// Кельманов А.В. - SNL-246 - 2026.05.26 }
	
			Попытка
				
				ЛСКОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
			Исключение
				
				МассивОшибок.Добавить("Не удалось записать документ ЛСК по причине " + ОписаниеОшибки());
				
			КонецПопытки;
				
		Иначе
			
			МассивОшибок.Добавить("Не удалось определить ЗСБ для записи в ЛСК");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если МассивОшибок.Количество() = 0 Тогда
		
		Попытка
			
			ЛП_Объект.ДополнительныеСвойства.Вставить("НеПроставлятьКоличествоКоробокПоЗНА", Истина); // Кельманов А.В. - SNL-234 - 2026.05.15
			
			ЛП_Объект.Записать(РежимЗаписиДокумента.Проведение);
			
		Исключение
			
			МассивОшибок.Добавить(ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЕсли;
	
	Если МассивОшибок.Количество() > 0 Тогда
		
		Ошибки = СтрСоединить(МассивОшибок, Символы.ПС);
		
	// Кельманов А.В. - SNL-234 - 2026.05.15 {
	Иначе
		
		Документы.ЛистПереукладки.ПроставитьКоличествоКоробокПоЗНА(Накладная);
	// Кельманов А.В. - SNL-234 - 2026.05.15 }
				
	КонецЕсли;
	
	Возврат Ошибки;
	
КонецФункции

// Кухарь А.Ю.  11.04.2026 начало
// Пустая задача
Функция КонтрольДублейСтрокКоробовЛиста(ЛистОбъект) Экспорт
	СтруктураВозврата = Новый Структура("Успех,Ошибки,Данные", Истина, Новый Массив, Неопределено);  
	если ложь тогда ЛистОбъект = документы.ЛистНабора.СоздатьДокумент();КонецЕсли;    
	
	Запрос = новый запрос; 
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛистНабораНомераКоробок.Ссылка КАК ДругойЛН
	|ИЗ
	|	Документ.ЛистНабора.НомераКоробок КАК ЛистНабораНомераКоробок
	|ГДЕ
	|	ЛистНабораНомераКоробок.Ссылка.ДокОснование = &ДокОснование
	|	И ЛистНабораНомераКоробок.НомерКоробки В(&НомераКоробок)
	|	И ЛистНабораНомераКоробок.Ссылка <> &Ссылка";
	запрос.УстановитьПараметр("Ссылка",ЛистОбъект.Ссылка);
	запрос.УстановитьПараметр("ДокОснование",ЛистОбъект.ДокОснование);
	запрос.УстановитьПараметр("НомераКоробок",ЛистОбъект.НомераКоробок.Выгрузить().ВыгрузитьКолонку("НомерКоробки")); 
	Выборка = запрос.Выполнить().Выбрать();
	пока Выборка.Следующий() цикл   
		СтруктураВозврата.Ошибки.Добавить(СтрШаблон("Обнаружен дубль номера коробки с листом %1. Короба текущего ЛН очищены. Попробуйте их напечатать ещё раз.",Выборка.ДругойЛН));
	КонецЦикла;
	
	если СтруктураВозврата.Ошибки.Количество()>0 тогда
		СтруктураВозврата.Успех = ложь;
	КонецЕсли;    
	
	Возврат СтруктураВозврата;
КонецФункции
// Кухарь А.Ю.  11.04.2026 конец

// Кельманов А.В. - SNL-208 - 2026.04.22
Процедура ОбновитьТекущуюБригаду() Экспорт
	
	РабочееМесто = ПараметрыСеанса.РабочееМестоКлиента;
	
	Если ЗначениеЗаполнено(РабочееМесто) Тогда
		
		НЗ = РегистрыСведений.ТекущиеБригады.СоздатьНаборЗаписей();
		НЗ.Отбор.РабочееМесто.Использование = Истина;
		НЗ.Отбор.РабочееМесто.Значение = РабочееМесто;
		НЗ.Записать();
		
		// Кельманов А.В. - ИЗМ-0000000062 - 2026.06.26 {
		//Сканировщик = ПараметрыСеанса.Пользователь;
		//ФизЛицо = Сканировщик.ФизЛицо;
		//
		//Если ЗначениеЗаполнено(ФизЛицо) Тогда
		//	
		//	Запись = РегистрыСведений.ТекущиеБригады.СоздатьМенеджерЗаписи();
		//	Запись.РабочееМесто = РабочееМесто;
		//	Запись.Сотрудник = ФизЛицо;
		//	Запись.ДатаЗаписи = ТекущаяДата();
		//	Запись.Записать();
		//	
		//КонецЕсли;
		// Кельманов А.В. - ИЗМ-0000000062 - 2026.06.26 }
		
	КонецЕсли;
	
КонецПроцедуры

// Кельманов А.В. - SNL-208 - 2026.04.22
// Кельманов А.В. - ИЗМ-0000000062 - 2026.06.26 {
//Функция ТекущаяБригада() Экспорт
Функция ТекущаяБригада(ВозвращатьТекущегоСотрудникаДляНезаполненнойБригады = Истина) Экспорт
// Кельманов А.В. - ИЗМ-0000000062 - 2026.06.26 }
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТекущиеБригады.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	РегистрСведений.ТекущиеБригады КАК ТекущиеБригады
	               |ГДЕ
	               |	ТекущиеБригады.РабочееМесто = &РабочееМесто
	               |
	               |УПОРЯДОЧИТЬ ПО
				   // Кельманов А.В. - ИЗМ-0000000062 - 2026.06.26 {
	               |	ТекущиеБригады.ВедущийСотрудник УБЫВ,
				   // Кельманов А.В. - ИЗМ-0000000062 - 2026.06.26 }
	               |	ТекущиеБригады.ДатаЗаписи";
	
	Запрос.УстановитьПараметр("РабочееМесто", ПараметрыСеанса.РабочееМестоКлиента);
	
	ТекБригада = Запрос.Выполнить().Выгрузить();
	
	// Кельманов А.В. - ИЗМ-0000000062 - 2026.06.26 {
	Если ТекБригада.Количество() = 0 И ВозвращатьТекущегоСотрудникаДляНезаполненнойБригады Тогда
		
		Сканировщик = ПараметрыСеанса.Пользователь;
		ФизЛицо = Сканировщик.ФизЛицо;
		
		Если ЗначениеЗаполнено(ФизЛицо) Тогда
			
			НовСтр = ТекБригада.Добавить();
			НовСтр.Сотрудник = ФизЛицо;
			
		КонецЕсли;
		
	КонецЕсли;
	// Кельманов А.В. - ИЗМ-0000000062 - 2026.06.26 }

	Возврат ТекБригада; 
	
КонецФункции

//Чирков 30.04.2026
Функция ИспользоватьВспомогательныеДоговораПриВозвратах(ДатаДокумента) Экспорт
	Возврат (ДатаДокумента >= '20260401');
КонецФункции //ИспользоватьДоговораВозврата(ДатаДокумента)

// Ихсанов Д. А. Начало 10.06.2026 Наряд 0000000173 от 20.05.2026 11:47:35: e1cib/data/Документ.Наряд?ref=89690050568f680711f1542888ebf093
Процедура ПолучитьОстаткиСервер(СписокНоменклатуры,Склад,МасивНакладных,КэшОстатков, ФлагФизСклад = Ложь,МассивДополнительныхСкладов=Неопределено) Экспорт
	
	Если СписокНоменклатуры.ВГраница() < 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Возврат;
	КонецЕсли;
	
	МассивСкладов = Новый Массив();
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	Сводный.Номенклатура.Код77 КАК Код77,
	|	Сводный.Номенклатура КАК Номенклатура,
	|	СУММА(Сводный.Остаток) КАК Остаток,
	|	СУММА(Сводный.Резерв) КАК Резерв,
	|	СУММА(Сводный.ВиртуальныйРезерв) КАК ВиртуальныйРезерв
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЕСТЬNULL(Остатки.Номенклатура, Резервы.Номенклатура) КАК Номенклатура,
	|		ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК Остаток,
	|		ЕСТЬNULL(Резервы.КоличествоОстаток, 0) КАК Резерв,
	|		0 КАК ВиртуальныйРезерв
	|	ИЗ
	|		РегистрНакопления.ОстаткиТМЦ.Остатки(
	|				,
	|				Склад В (&МассивСкладов)
	|					И Номенклатура В (&СписокНоменклатуры)) КАК Остатки
	|			ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	|					,
	|					Склад В (&МассивСкладов)
	|						И Номенклатура В (&СписокНоменклатуры)) КАК Резервы
	|			ПО Остатки.Номенклатура = Резервы.Номенклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОстаткиТМЦ.Номенклатура,
	|		ОстаткиТМЦ.Количество,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ
	|	ГДЕ
	|		ОстаткиТМЦ.Регистратор в (&Регистратор)
	|		И ОстаткиТМЦ.Склад В(&МассивСкладов)
	|		И ОстаткиТМЦ.ВидДвижения = &Расход
	|		И ОстаткиТМЦ.Номенклатура В(&СписокНоменклатуры)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РезервыТМЦ.Номенклатура,
	|		0,
	|		-РезервыТМЦ.Количество,
	|		0
	|	ИЗ
	|		РегистрНакопления.РезервыТМЦ КАК РезервыТМЦ
	|	ГДЕ
	|		РезервыТМЦ.Регистратор В (&Регистратор)
	|		И РезервыТМЦ.Склад В(&МассивСкладов)
	|		И РезервыТМЦ.Номенклатура В(&СписокНоменклатуры)) КАК Сводный
	|
	|СГРУППИРОВАТЬ ПО
	|	Сводный.Номенклатура,
	|	Сводный.Номенклатура.Код77
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сводный.Номенклатура";
	
	Запрос.УстановитьПараметр("Расход",ВидДвиженияНакопления.Расход);	
	Запрос.УстановитьПараметр("Регистратор",МасивНакладных);
	Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
	
	//Кухарь 02.03.18 начало
	Если НЕ Склад.ФизическийСклад.Пустая() И ПараметрыСеанса.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение и склад.ВидСклада<>Перечисления.ВидСклада.ВиртуальныйДляСклада Тогда
		//Кухарь 02.03.18 конец
		МассивСкладов.Добавить(Склад.ФизическийСклад);				
	Иначе
		МассивСкладов.Добавить(Склад);				
	КонецЕсли;
	
	// Кухарь А.Ю.  02.05.2023 начало
	если МассивДополнительныхСкладов<>Неопределено тогда
		для каждого СтрМасс из МассивДополнительныхСкладов цикл
			МассивСкладов.Добавить(СтрМасс);
		КонецЦикла;
	КонецЕсли;
	// Кухарь А.Ю.  02.05.2023 конец
	
	
	
	Если ФлагФизСклад И НЕ Склад.ФизическийСклад.Пустая() Тогда
		МассивСкладов.Добавить(Склад.ФизическийСклад);
	КонецЕсли;
	Запрос.УстановитьПараметр("МассивСкладов", МассивСкладов);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл	
		КэшОстатков.Вставить(Выборка.Номенклатура,Новый Структура("Остаток,Резерв,СвободныйОстаток,Код77",Выборка.Остаток,Выборка.Резерв,Макс(0,Выборка.Остаток-Выборка.Резерв-Выборка.ВиртуальныйРезерв),Выборка.Код77));	
	КонецЦикла;
	
КонецПроцедуры //ПолучитьОстаткиСервер()

Функция ПолучитьПрефиксИБСервер(Склад) Экспорт
	
	Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение И ЗначениеЗаполнено(Склад.ПрефиксИБ) Тогда
		ПрефиксИБ = Склад.ПрефиксИБ;
	Иначе
		ПрефиксИБ = ПараметрыСеанса.ЭтотУзел.Код;
	КонецЕсли; 
	
	Возврат ПрефиксИБ;
	
КонецФункции // ПолучитьПрефиксИБСервер()
// Ихсанов Д. А. Конец 10.06.2026

// Кельманов А.В. - ИЗМ-0000000061 - 2026.06.17
Функция НеКонтролироватьСканированиеЧЗ(Накладная) Экспорт
	
	Если Не ЗначениеЗаполнено(Накладная) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	НеКонтролироватьСканированиеЧЗ = Ложь;

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПланНабора.НеконтролироватьСканированиеЧЗ КАК НеконтролироватьСканированиеЧЗ
	               |ИЗ
	               |	Документ.ПланНабора КАК ПланНабора
	               |ГДЕ
	               |	ПланНабора.ДокОснование = &ДокОснование";
	
	Запрос.УстановитьПараметр("ДокОснование", Накладная);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		НеКонтролироватьСканированиеЧЗ = Выборка.НеконтролироватьСканированиеЧЗ;
		
	КонецЕсли;
	
	Возврат НеКонтролироватьСканированиеЧЗ;
	
КонецФункции

// Кельманов А.В. - ИЗМ-0000000164 - 2026.06.16
// Проверяет, является ли переданный документ виртуальной расходной накладной.
//
// Параметры:
//  Накладная - ДокументСсылка - проверяемый документ
//
// Возвращаемое значение:
//  Булево - Истина, если передана ссылка на документ РасходнаяНакладная с признаком ВиртуальнаяНакладная, иначе Ложь
//
Функция ЭтоВиртуальнаяРНК(Накладная) Экспорт
	
	ЭтоВиртуальнаяРНК = Ложь;
	
	Если ТипЗнч(Накладная) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		ЭтоВиртуальнаяРНК = ПолучитьРеквизитШапки(Накладная, "ВиртуальнаяНакладная", "Документ");
	КонецЕсли;
	
	Возврат ЭтоВиртуальнаяРНК; 
	
КонецФункции

#Область ПрограммныйИнтерфейс

// Кельманов А.В. - ИЗМ-0000000122 - 2026.06.26
// Проверяет, нужно ли перезаполнить накладную по заказу клиента FBS.
//
// Параметры:
//  Накладная - ДокументСсылка.РасходнаяНакладная - проверяемый документ
//
// Возвращаемое значение:
//  Булево - Истина, если передана ссылка на документ РасходнаяНакладная 
//  с установленным реквизитом ОбновитьНакладнуюПоЗаказу = Истина в регистре РеквизитыДокументов
//
Функция НужноОбновитьНакладнуюПоЗаказу(Накладная) Экспорт 
	
	Если Не ЗначениеЗаполнено(Накладная) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	РеквизитыДокументов_Накладная = ПолучитьЗначениеРеквизитовДокументов(Накладная, "ОбновитьНакладнуюПоЗаказу");
	
	НужноОбновитьНакладнуюПоЗаказу = Ложь;
	
	Для Каждого Стр Из РеквизитыДокументов_Накладная Цикл
		
		Если Стр.ЗначениеРеквизита = Истина Тогда
			
			НужноОбновитьНакладнуюПоЗаказу = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НужноОбновитьНакладнуюПоЗаказу;
	
КонецФункции

// Кельманов А.В. - ИЗМ-0000000122 - 2026.06.26
// Обновляет РНК и ЗНБ по заказу клиента FBS - находит заказ клиента FBS по накладной и вызывает функцию перезаполнения.
//
// Параметры:
//  Накладная - ДокументСсылка.РасходнаяНакладная - обрабатываемый документ
//
Процедура ОбновитьНакладнуюПоЗаказу(Накладная) Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаказКлиентаFBS.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказКлиентаFBS КАК ЗаказКлиентаFBS
	|ГДЕ
	|	ЗаказКлиентаFBS.ДокОснование = &ДокОснование";
	
	Запрос.УстановитьПараметр("ДокОснование", Накладная);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ОбменМаркетПлейс.ПерезаполнитьРНКнаОснованииЗАКАЗА(Выборка.Ссылка);
		
		ЗаписатьЗначениеВРеквизитыДокументов(Ложь, Накладная, "ОбновитьНакладнуюПоЗаказу");
	
	КонецЕсли
	
КонецПроцедуры

// Кельманов А.В. - ИЗМ-0000000124 - 2026.07.01
// Проверяет, нужно ли создавать ЛП по ЛСК.
//
// Параметры:
//  Накладная - ДокументСсылка.РасходнаяНакладная - обрабатываемый документ
//
// Возвращаемое значение:
//  Булево - Истина, если передана ссылка на документ РасходнаяНакладная 
//  с установленным реквизитом СоздаватьЛП_ПоЛСК = Истина в регистре РеквизитыДокументов
//
Функция СоздаватьЛП_ПоЛСК(Накладная) Экспорт 
	
	Если Не ЗначениеЗаполнено(Накладная) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	РеквизитыДокументов_Накладная = ПолучитьЗначениеРеквизитовДокументов(Накладная, "СоздаватьЛП_ПоЛСК");
	
	СоздаватьЛП_ПоЛСК = Ложь;
	
	Для Каждого Стр Из РеквизитыДокументов_Накладная Цикл
		
		Если Стр.ЗначениеРеквизита = Истина Тогда
			
			СоздаватьЛП_ПоЛСК = Истина;
			
			Прервать; // Кельманов А.В. - Оптимизация работы - 2026.07.16
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СоздаватьЛП_ПоЛСК;
	
КонецФункции

// Кельманов А.В. - ИЗМ-0000000124 - 2026.07.01
// Ищет имеющийся созданный ранее ЛП по данной накладной, совпадающий по продукции с переданным ЛСК
// и устанавливает переданный ЛСК в реквизит ЛСК найденного ЛП.
//
// Параметры:
//  ЛСК - ДокументСсылка.ЛистСборкиКомплектовЧЗ
//  Накладная - ДокументСсылка.РасходнаяНакладная
//  СоздаватьНовыйЛП - Булево - изменяемый параметр - на входе Ложь, если нужно искать ЛП, но ЛП не найден, то возвращает Истина
//
// Возвращаемое значение:
//  ДокументСсылка.ЛистПереукладки - если найден подходящий ЛП
//
//  Неопределено - если по каким-то условиям для данной накладной и данного ЛСК не нужно искать ЛП или подходящий ЛП не найден
//
Функция НайтиЛП_ПоЛСК(ЛСК, Накладная, СоздаватьНовыйЛП = Ложь) Экспорт
	
	Если ТипЗнч(Накладная) <> Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	РеквизитыЛСК = ПолучитьРеквизитыШапки(ЛСК, "Продукция, КоличествоДокумента", "Документ");
	
	Если Не ЗначениеЗаполнено(РеквизитыЛСК.Продукция) Или Не ЗначениеЗаполнено(РеквизитыЛСК.КоличествоДокумента) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ПравилаАгрегацииЧестногоЗнака = ПолучитьРеквизитШапки(Накладная, "ПравилаАгрегацииЧестногоЗнака", "Документ");
	
	Если ЗначениеЗаполнено(ПравилаАгрегацииЧестногоЗнака) И ПравилаАгрегацииЧестногоЗнака <> Справочники.ПравилаАгрегацииЧестногоЗнака.НайтиПоКоду("000000003") Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ДопПараметрыНакладной = ОбщегоНазначения_ПИ.ПолучитьДопПараметрыНакладной(Накладная);
	
	Если ДопПараметрыНакладной.ОтгрузкаFBS Тогда
		
		Возврат Неопределено;
		
	КонецЕсли; 
	
	ЗапросКодыЧЗ = Новый Запрос;
	
	ЗапросКодыЧЗ.Текст = "ВЫБРАТЬ
	                     |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта КАК ШтрихкодКомплекта
	                     |ИЗ
	                     |	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
	                     |ГДЕ
	                     |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка = &ЛСК
	                     |
	                     |СГРУППИРОВАТЬ ПО
	                     |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта";
	
	ЗапросКодыЧЗ.УстановитьПараметр("ЛСК", ЛСК);
	
	КодыЧЗ = ЗапросКодыЧЗ.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛистПереукладкиТовары.Ссылка КАК ЛП,
	               |	ЛистПереукладкиТовары.Ссылка.Номер КАК ЛПНомер,
	               |	МАКСИМУМ(ЛистПереукладкиТовары.Номенклатура) КАК Продукция,
	               |	СУММА(ЛистПереукладкиТовары.Количество) КАК Количество
	               |ПОМЕСТИТЬ ВТ_ЛП
	               |ИЗ
	               |	Документ.ЛистПереукладки.Товары КАК ЛистПереукладкиТовары
	               |ГДЕ
	               |	ЛистПереукладкиТовары.Ссылка.ДокОснование = &Накладная
	               |	И ЛистПереукладкиТовары.Ссылка.ЛСК = ЗНАЧЕНИЕ(Документ.ЛистСборкиКомплектовЧЗ.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛистПереукладкиТовары.Ссылка
	               |
	               |ИМЕЮЩИЕ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛистПереукладкиТовары.Номенклатура) = 1 И
	               |	СУММА(ЛистПереукладкиТовары.Отсканировано) = 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ВТ_ЛП.ЛП КАК ЛП
	               |ИЗ
	               |	ВТ_ЛП КАК ВТ_ЛП
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистСборкиКомплектовЧЗ КАК ЛистСборкиКомплектовЧЗ
	               |		ПО ВТ_ЛП.Продукция = ЛистСборкиКомплектовЧЗ.Продукция
	               |			И ВТ_ЛП.Количество = ЛистСборкиКомплектовЧЗ.КоличествоДокумента
	               |ГДЕ
	               |	ЛистСборкиКомплектовЧЗ.Ссылка = &ЛСК
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВТ_ЛП.ЛПНомер";
	
	Запрос.УстановитьПараметр("Накладная", Накладная);
	Запрос.УстановитьПараметр("ЛСК", ЛСК);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЛПОбъект = Выборка.ЛП.ПолучитьОбъект();
		
		ЛПОбъект.ЛСК = ЛСК;
		
		Для Каждого Стр Из ЛПОбъект.Товары Цикл
			
			Стр.Отсканировано = Стр.Количество;
			
		КонецЦикла;
		
		Для Каждого СтрЧЗ Из КодыЧЗ Цикл
			
			НовСтр = ЛПОбъект.ШтрихкодыУпаковок.Добавить();
			
			НовСтр.ШтрихкодУпаковки = СтрЧЗ.ШтрихкодКомплекта;
			НовСтр.Количество = 1;
			
		КонецЦикла;
		
		ЛПОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		Возврат ЛПОбъект.Ссылка;
		
	КонецЕсли;

	СоздаватьНовыйЛП = Истина;

	Возврат Неопределено;
		
КонецФункции

// Кельманов А.В. - ИЗМ-0000000124 - 2026.07.01
// Создаёт ЛП по ЛСК.
//
// Параметры:
//  ЛСК - ДокументСсылка.ЛистСборкиКомплектовЧЗ
//  Накладная - ДокументСсылка.РасходнаяНакладная
//  ТипКороба - СправочникСсылка.ТипыКоробов - для записи реквизита в создаваемом ЛП
//
// Возвращаемое значение:
//  ДокументСсылка.ЛистПереукладки - если создан подходящий ЛП
//
//  Неопределено - если не удалось создать ЛП
//
Функция СоздатьЛП_ПоЛСК(ЛСК, Накладная, ТипКороба) Экспорт
	
	// ТИП КОРОБА С ПРОВЕРКОЙ ОБЪЁМА НА ТСД!!!!!
	
	Ошибки = "";
	
	РеквизитыЛСК = ПолучитьРеквизитыШапки(ЛСК, 
	"Продукция, КоличествоДокумента, Дата, ДатаНачалаСканирования, ДатаОкончанияСканирования, УзелТСД, СборщикКомплектаТСД", "Документ");
	
	ЗапросКодыЧЗ = Новый Запрос;
	
	ЗапросКодыЧЗ.Текст = "ВЫБРАТЬ
	                     |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта КАК ШтрихкодКомплекта
	                     |ИЗ
	                     |	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
	                     |ГДЕ
	                     |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка = &ЛСК
	                     |
	                     |СГРУППИРОВАТЬ ПО
	                     |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта";
	
	ЗапросКодыЧЗ.УстановитьПараметр("ЛСК", ЛСК);
	
	КодыЧЗ = ЗапросКодыЧЗ.Выполнить().Выгрузить();
	
	ЛП_Объект = Документы.ЛистПереукладки.СоздатьДокумент();
	
	ЛП_Объект.Заполнить(Накладная);
	ЛП_Объект.Дата = РеквизитыЛСК.Дата;
	ЛП_Объект.ДатаНачалаСканирования = РеквизитыЛСК.ДатаНачалаСканирования;
	ЛП_Объект.ДатаОкончанияСканирования = РеквизитыЛСК.ДатаОкончанияСканирования;
	ЛП_Объект.УзелТСД = РеквизитыЛСК.УзелТСД;
	ЛП_Объект.СканировщикФизЛицо = РеквизитыЛСК.СборщикКомплектаТСД;
	ЛП_Объект.ТипКороба = ТипКороба;
	
	РезультатПоиска = Документы.ЛистПереукладки.НайтиЕдиныйЗНАПоРНК(Накладная);
	
	Если РезультатПоиска.Успех Тогда
		
		ЛП_Объект.ЗаданиеНаАгрегацию = РезультатПоиска.Данные;
		
	КонецЕсли; 
	
	ЛП_Объект.Товары.Очистить();
	ЛП_Объект.ШтрихкодыУпаковок.Очистить();
	ЛП_Объект.Бригада.Очистить(); 
	
	ЛП_Объект.РежимСканирования = Перечисления.РежимСканирования.Добавление; 
	
	НовСтр = ЛП_Объект.Товары.Добавить();

	НовСтр.Номенклатура = РеквизитыЛСК.Продукция;
	НовСтр.Количество = РеквизитыЛСК.КоличествоДокумента;
	НовСтр.Отсканировано = РеквизитыЛСК.КоличествоДокумента;
	
	Для Каждого СтрЧЗ Из КодыЧЗ Цикл
		
		НовСтр = ЛП_Объект.ШтрихкодыУпаковок.Добавить();
		
		НовСтр.ШтрихкодУпаковки = СтрЧЗ.ШтрихкодКомплекта;
		НовСтр.Количество = 1;
		
	КонецЦикла;
	
	Для Каждого Стр Из ЛСК.Бригада Цикл
		
		СтрБригада = ЛП_Объект.Бригада.Добавить();
		
		СтрБригада.Сотрудник = Стр.Сотрудник;
		
	КонецЦикла;			

	Попытка
		
		ЛП_Объект.ДополнительныеСвойства.Вставить("НеПроставлятьКоличествоКоробокПоЗНА", Истина); 
		
		ЛП_Объект.Записать(РежимЗаписиДокумента.Проведение);
		
	Исключение
		
		Ошибки = ОписаниеОшибки();
		
	КонецПопытки;
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		Документы.ЛистПереукладки.ПроставитьКоличествоКоробокПоЗНА(Накладная);
		
		Возврат ЛП_Объект.Ссылка; 
		
	КонецЕсли;
	
КонецФункции

// Кельманов А.В. - Изменение 0000000187 - 2026.07.08
// Определяет, есть ли пустые значения реквизитов "НомерЗаказаFBS", "ШтрихКодFBS", "ШтрихКод" 
// в строках документа ПолныеДанныеЗаданияНабора.
//
// Параметры:
//  ПолныеДанные - ДокументСсылка.ПолныеДанныеЗаданияНабора - проверяемый документ
//
// Возвращаемое значение:
//  Строка - Перечисление строк документа ПолныеДанныеЗаданияНабора 
//  с незаполненными значениями перечисленных реквизитов
//
//  или пустая строка, если все проверяемые реквизиты заполнены
//
Функция ПроверитьПустыеЗначенияВКолонкахПолныхДанных(ПолныеДанные) Экспорт
	
	Ошибки = "";
	
	МассивОшибок = Новый Массив;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПолныеДанныеЗаданияНабораТовары.НомерСтроки КАК НомерСтроки,
	               |	ПолныеДанныеЗаданияНабораТовары.Номенклатура КАК Номенклатура,
	               |	ПолныеДанныеЗаданияНабораТовары.Количество КАК Количество,
	               |	ПолныеДанныеЗаданияНабораТовары.НомерЗаказаFBS КАК НомерЗаказаFBS,
	               |	ПолныеДанныеЗаданияНабораТовары.ШтрихКодFBS КАК ШтрихКодFBS,
	               |	ПолныеДанныеЗаданияНабораТовары.ШтрихКод КАК ШтрихКод,
	               |	ПолныеДанныеЗаданияНабораТовары.ПрефиксЗаказа КАК ПрефиксЗаказа,
	               |	ПолныеДанныеЗаданияНабораТовары.СуффиксЗаказа КАК СуффиксЗаказа
	               |ИЗ
	               |	Документ.ПолныеДанныеЗаданияНабора.Товары КАК ПолныеДанныеЗаданияНабораТовары
	               |ГДЕ
	               |	ПолныеДанныеЗаданияНабораТовары.Ссылка = &ПолныеДанные
	               |	И ПолныеДанныеЗаданияНабораТовары.Количество > 0
	               |	И (ПолныеДанныеЗаданияНабораТовары.НомерЗаказаFBS = """"
	               |			ИЛИ ПолныеДанныеЗаданияНабораТовары.ШтрихКодFBS = """"
	               |			ИЛИ ПолныеДанныеЗаданияНабораТовары.ШтрихКод = """")
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";
	
	Запрос.УстановитьПараметр("ПолныеДанные", ПолныеДанные);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.НомерЗаказаFBS) Тогда
			
			МассивОшибок.Добавить("Строка " + Выборка.НомерСтроки + ": не заполнен номер заказа FBS");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Выборка.ШтрихКодFBS) Тогда
			
			МассивОшибок.Добавить("Строка " + Выборка.НомерСтроки + ": не заполнен ШК заказа FBS");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Выборка.ШтрихКод) Тогда
			
			МассивОшибок.Добавить("Строка " + Выборка.НомерСтроки + ": не заполнен штрихкод");
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивОшибок.Количество() > 0 Тогда
		
		Ошибки = СтрСоединить(МассивОшибок, Символы.ПС);
		
	КонецЕсли;
	
	Возврат Ошибки;
	
КонецФункции

#КонецОбласти
