Функция СформироватьТабДокАктивныеЗНБ(Знач РезультатТЗ ) Экспорт
	
	ТЗАктивныеЗНБ 				= РезультатТЗ.ТЧАктивныеЗНБ; 
	ТЗАктивныеЗНБПроходныеРНК 	=  РезультатТЗ.ТЧАктивныеЗНБПроходныеРНК;
	Результат = Новый ТабличныйДокумент;
	
	СхемаКомпоновки  = ПолучитьМакет("АктивныеЗНБ");
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	//ДанныеРасшифровки=новый ДанныеРасшифровкиКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, СхемаКомпоновки.НастройкиПоУмолчанию); //,ДанныеРасшифровки);
	
	ВнешниеНаборы = новый Структура; 
	ВнешниеНаборы.Вставить("АктивныеЗНБ",ТЗАктивныеЗНБ);
	ВнешниеНаборы.Вставить("АктивныеЗНБПроходныеРНК",ТЗАктивныеЗНБПроходныеРНК);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,ВнешниеНаборы); //,ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);  
	
	Возврат Результат;
КонецФункции
Функция СформироватьТабДокНоменклатураБезАктивныхЗНБ(Знач ТЗ ) Экспорт

	Результат = Новый ТабличныйДокумент;
	
	СхемаКомпоновки  = ПолучитьМакет("НоменклатураБезАктивныеЗНБ");
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	ДанныеРасшифровки=новый ДанныеРасшифровкиКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, СхемаКомпоновки.НастройкиПоУмолчанию,ДанныеРасшифровки);
	
	ВнешниеНаборы = новый Структура; 
	ВнешниеНаборы.Вставить("НоменклатураБезАктивныеЗНБ",ТЗ); 
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,ВнешниеНаборы,ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);  
	
	Возврат Результат;
КонецФункции 

Функция СформироватьТабДокНоменклатураПоСкладамБезБлокировки(Знач ТЗ ) Экспорт

	Результат = Новый ТабличныйДокумент;
	
	СхемаКомпоновки  = ПолучитьМакет("НоменклатураПоСкладамБезБлокировки");
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	ДанныеРасшифровки=новый ДанныеРасшифровкиКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, СхемаКомпоновки.НастройкиПоУмолчанию,ДанныеРасшифровки);
	
	ВнешниеНаборы = новый Структура; 
	ВнешниеНаборы.Вставить("НоменклатураПоСкладамБезБлокировки",ТЗ); 
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,ВнешниеНаборы,ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);  
	
	Возврат Результат;
КонецФункции
Функция СформироватьТабДокНоменклатураБезАктивныхЗНББезУчетаБлокировок(Знач ТЗ ) Экспорт

	Результат = Новый ТабличныйДокумент;
	
	СхемаКомпоновки  = ПолучитьМакет("НоменклатураБезАктивныеЗНББезБлокировок");
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	ДанныеРасшифровки=новый ДанныеРасшифровкиКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, СхемаКомпоновки.НастройкиПоУмолчанию,ДанныеРасшифровки);
	
	ВнешниеНаборы = новый Структура; 
	ВнешниеНаборы.Вставить("НоменклатураБезАктивныеЗНБ",ТЗ); 
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,ВнешниеНаборы,ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);  
	
	Возврат Результат;
КонецФункции 

