
Функция ПереместитьСФизическогоСкладаНаВиртуальный(ДокСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	СводнаяТаблица = Новый ТаблицаЗначений;
	СводнаяТаблица.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	СводнаяТаблица.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	СводнаяТаблица.Колонки.Добавить("СвободныйОстатокСклад", Новый ОписаниеТипов("Число"));
	СводнаяТаблица.Колонки.Добавить("СвободныйОстатокСкладФиз", Новый ОписаниеТипов("Число"));
	
	МассивСкладов = Новый Массив();
	МассивСкладов.Добавить(ДокСсылка.Склад);
	Если ЗначениеЗаполнено(ДокСсылка.Склад.ФизическийСклад) Тогда
		МассивСкладов.Добавить(ДокСсылка.Склад.ФизическийСклад);
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Количество КАК Количество
	|ПОМЕСТИТЬ ТабличнаяЧасть
	|ИЗ
	|	Документ.РасходнаяНакладная.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &ДокСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сводный.Номенклатура КАК Номенклатура,
	|	СУММА(Сводный.Остаток) - СУММА(Сводный.Резерв) - СУММА(Сводный.ВиртуальныйРезерв) КАК СвободныйОстаток,
	|	СУММА(Сводный.Количество) КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЕСТЬNULL(Остатки.Номенклатура, ТабличнаяЧасть.Номенклатура) КАК Номенклатура,
	|		ЕСТЬNULL(ТабличнаяЧасть.Количество, 0) КАК Количество,
	|		ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК Остаток,
	|		ЕСТЬNULL(Резервы.КоличествоОстаток, 0) КАК Резерв,
	|		0 КАК ВиртуальныйРезерв
	|	ИЗ
	|		ТабличнаяЧасть КАК ТабличнаяЧасть
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(, Склад = &Склад) КАК Остатки
	|				ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(, Склад = &Склад) КАК Резервы
	|				ПО Остатки.Номенклатура = Резервы.Номенклатура
	|			ПО (Остатки.Номенклатура = ТабличнаяЧасть.Номенклатура)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЕСТЬNULL(ОстаткиТМЦ.Номенклатура, ТабличнаяЧасть.Номенклатура),
	|		0,
	|		ЕСТЬNULL(ОстаткиТМЦ.Количество, 0),
	|		0,
	|		0
	|	ИЗ
	|		ТабличнаяЧасть КАК ТабличнаяЧасть
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ
	|			ПО (ОстаткиТМЦ.Номенклатура = ТабличнаяЧасть.Номенклатура)
	|	ГДЕ
	|		ОстаткиТМЦ.Регистратор = &ДокСсылка
	|		И ОстаткиТМЦ.Склад = &Склад
	|		И ОстаткиТМЦ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЕСТЬNULL(РезервыТМЦ.Номенклатура, ТабличнаяЧасть.Номенклатура),
	|		0,
	|		0,
	|		-ЕСТЬNULL(РезервыТМЦ.Количество, 0),
	|		0
	|	ИЗ
	|		ТабличнаяЧасть КАК ТабличнаяЧасть
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ КАК РезервыТМЦ
	|			ПО (РезервыТМЦ.Номенклатура = ТабличнаяЧасть.Номенклатура)
	|	ГДЕ
	|		РезервыТМЦ.Регистратор = &ДокСсылка
	|		И РезервыТМЦ.Склад = &Склад) КАК Сводный
	|
	|СГРУППИРОВАТЬ ПО
	|	Сводный.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТабличнаяЧасть";
	
	Для Каждого Склад ИЗ МассивСкладов Цикл
		
		Запрос.УстановитьПараметр("Склад", Склад);
		
		УстановитьПривилегированныйРежим(Истина);
		ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
		УстановитьПривилегированныйРежим(Ложь);
		
		Для Каждого Стр ИЗ ТаблицаОстатков Цикл
			НоваяСтрока = СводнаяТаблица.Добавить();
			НоваяСтрока.Номенклатура = Стр.Номенклатура;
			Если Склад.ВидСклада = Перечисления.ВидСклада.Виртуальный Тогда
				НоваяСтрока.СвободныйОстатокСклад = Стр.СвободныйОстаток;
			КонецЕсли;
			Если Склад.ВидСклада = Перечисления.ВидСклада.Физический Тогда
				НоваяСтрока.СвободныйОстатокСкладФиз = Стр.СвободныйОстаток;
				НоваяСтрока.Количество = Стр.Количество;	
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	СводнаяТаблица.Свернуть("Номенклатура", "Количество, СвободныйОстатокСклад, СвободныйОстатокСкладФиз");
	
	//////////////// ПО СВОДНОЙ ТАБЛИЦЕ /////////////////////////////////////////////////////////////////
	
	ТаблицаКЗагрузке = Новый ТаблицаЗначений;
	ТаблицаКЗагрузке.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаКЗагрузке.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
	Для Каждого Стр ИЗ СводнаяТаблица Цикл
		Если Стр.Количество > Стр.СвободныйОстатокСклад И Стр.СвободныйОстатокСкладФиз > 0 Тогда
			НоваяСтрока = ТаблицаКЗагрузке.Добавить();
			НоваяСтрока.Номенклатура = Стр.Номенклатура;
			Если Стр.СвободныйОстатокСкладФиз >= Стр.Количество - Стр.СвободныйОстатокСклад Тогда
				НоваяСтрока.Количество = Стр.Количество - Стр.СвободныйОстатокСклад;
			Иначе
				НоваяСтрока.Количество = Стр.СвободныйОстатокСкладФиз;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ТаблицаКЗагрузке.Количество() > 0 Тогда
		НачатьТранзакцию();
		Перемещение = СоздатьПеремещение(ДокСсылка, ТаблицаКЗагрузке);
		Если Перемещение = Неопределено Тогда
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция СоздатьПеремещение(ДокументСсылка, ТаблицаКЗагрузке)
	
	Если НЕ ЗначениеЗаполнено(ДокументСсылка.Склад.ФизическийСклад) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТаблицаКЗагрузке.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Перемещение = Документы.Перемещение.СоздатьДокумент();
	
	// Кухарь А.Ю. 12.05.2022 начало
	// Начало дня - слишком рано. Иногда товара у отправителя на этот момент ещё нет
	//Перемещение.Дата = НачалоДня(ДокументСсылка.Дата);
	Перемещение.Дата = ДокументСсылка.Дата-1;
	// Кухарь А.Ю. 12.05.2022 конец
	
	Перемещение.ДатаОтгрузки = НачалоДня(ДокументСсылка.Дата);
	Перемещение.ДатаПриемки = НачалоДня(ДокументСсылка.Дата);
	
	ЗаполнитьШапкуДокумента(Перемещение,ПараметрыСеанса.Пользователь);
	Перемещение.ДокОснование = ДокументСсылка;
	Перемещение.СкладПолучатель = ДокументСсылка.Склад;	
	ОбменЭДО.УстановитьПунктДоставкиСб2б(Перемещение,"СкладПолучатель","ПунктДоставки");
	
	Перемещение.Валюта = Справочники.Валюты.НайтиПоКоду("810");
	Перемещение.Курс = 1;
	
	Перемещение.Склад = ДокументСсылка.Склад.ФизическийСклад;
	Перемещение.Комментарий = "Перемещаем с Физ.склада на Виртуальный";
	
	Перемещение.СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена;
	Перемещение.СостояниеНакладнойУПолучателя = Перечисления.СостоянияНакладной.Принята;
	Перемещение.Отгружен = Перечисления.Отгружен.Отгружен;
	
	УстановитьНомерДокументаКлиентСервер(Перемещение); 	 
	
	Для Каждого СтрокаТЧ ИЗ ТаблицаКЗагрузке Цикл
		НоваяСтрока = Перемещение.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		НоваяСтрока.Заявка = НоваяСтрока.Количество;
		НоваяСтрока.ПодтвержденнаяЗаявка = НоваяСтрока.Количество;
		НоваяСтрока.ПодтвержденнаяЗаявкаПеремещения = НоваяСтрока.Количество;
		НоваяСтрока.Коэффициент = 1;
		НоваяСтрока.Единица = СтрокаТЧ.Номенклатура.ОсновнаяЕдиница;
		ПриИзмененииНоменклатурыТабЧасти(НоваяСтрока, Перемещение);
		РассчитатьСуммуТабЧасти(НоваяСтрока, Перемещение);	
	КонецЦикла;
	
	Попытка
		Перемещение.Записать(РежимЗаписиДокумента.Проведение);
		//Кухарь А.Ю.  17.03.2022 начало
		СообщитьИзМодуля(""+Перемещение); 
		//Кухарь А.Ю.   17.03.2022 конец
		
		Возврат Перемещение.Ссылка;
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

// Шворобей ВЮ https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2221
//////////////////////////////////////////////////////////////////////////
// Возвращает ИСТИНА - товар маркирован, ЛОЖЬ - не маркирован
Функция ТоварМаркирован(Номенклатура, ДатаОтгрузки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ДатаОтгрузки", ДатаОтгрузки);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	спрНоменклатура.Ссылка КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА спрНоменклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА спрНоменклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаМаркировки,
	|	ВЫБОР
	|		КОГДА спрНоменклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА спрНоменклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаОбязательнойМаркировки
	|ПОМЕСТИТЬ ДанныеОТоваре
	|ИЗ
	|	Справочник.Номенклатура КАК спрНоменклатура
	|ГДЕ
	|	спрНоменклатура.Ссылка = &Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОТоваре.Номенклатура КАК Номенклатура,
	|	ДанныеОТоваре.ДатаМаркировки КАК ДатаМаркировки
	|ПОМЕСТИТЬ НеМаркированныйТовар
	|ИЗ
	|	ДанныеОТоваре КАК ДанныеОТоваре
	|ГДЕ
	|	(ДанныеОТоваре.ДатаМаркировки = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ ДанныеОТоваре.ДатаМаркировки > &ДатаОтгрузки)
	|	И (ДанныеОТоваре.ДатаОбязательнойМаркировки = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ ДанныеОТоваре.ДатаОбязательнойМаркировки > &ДатаОтгрузки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОТоваре.Номенклатура КАК Номенклатура,
	|	ДанныеОТоваре.ДатаМаркировки КАК ДатаМаркировки
	|ПОМЕСТИТЬ МаркированныйТовар
	|ИЗ
	|	ДанныеОТоваре КАК ДанныеОТоваре
	|ГДЕ
	|	ДанныеОТоваре.ДатаМаркировки <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ДанныеОТоваре.ДатаМаркировки <= &ДатаОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОТоваре.Номенклатура КАК Номенклатура,
	|	ДанныеОТоваре.ДатаОбязательнойМаркировки КАК ДатаОбязательнойМаркировки
	|ПОМЕСТИТЬ ОбязательноМаркированныйТовар
	|ИЗ
	|	ДанныеОТоваре КАК ДанныеОТоваре
	|ГДЕ
	|	(ДанныеОТоваре.ДатаОбязательнойМаркировки <> ДАТАВРЕМЯ(1, 1, 1)
	|				И ДанныеОТоваре.ДатаОбязательнойМаркировки <= &ДатаОтгрузки
	|			ИЛИ ДанныеОТоваре.Номенклатура.ОтгрузкаТолькоЧерезЧЗ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеОТоваре.Номенклатура) КАК Номенклатура
	|ИЗ
	|	ДанныеОТоваре КАК ДанныеОТоваре";
	
	УстановитьПривилегированныйРежим(Истина);
	МассивПакета = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	УстановитьПривилегированныйРежим(Ложь);
	
	НеМаркированныйТовар = МассивПакета[1].Выгрузить();
	МаркированныйТовар = МассивПакета[2].Выгрузить();
	ОбязательноМаркированныйТовар = МассивПакета[3].Выгрузить();
	
	Если НеМаркированныйТовар.Количество() > 0 Тогда
		Возврат Ложь;
	ИначеЕсли МаркированныйТовар.Количество() > 0 ИЛИ ОбязательноМаркированныйТовар.Количество() > 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции
// Шворобей ВЮ https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2221

// Кухарь А.Ю. 18.03.2025 начало
Функция СоздатьПредварительныеАгрегатыНаНакладную (РасходнаяНакладная,Перезаполнять=ложь) экспорт
	СтруктураВозврата=новый Структура("Ошибки,Успех");
	СтруктураВозврата.Ошибки=новый Массив;
	ТипУпаковки=Перечисления.ТипыУпаковок.МультитоварнаяУпаковка;
	
	НужныКоробки=ложь;
	ЕстьКоробки=ложь;
	НужныБлочки=ложь;
	ЕстьБлочки=Ложь;
	ДопПараметры = Новый Структура("Добавлять", Истина);
	
	ПравилаРаботыСАгрегациейЧЗ=МаркировкаКС.ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладной(РасходнаяНакладная);
	если ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияКоробок или ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияБлочков тогда
		запрос=новый запрос;
		запрос.Текст= "ВЫБРАТЬ различные
		|	МаркировкаТоваровИСМП.Ссылка КАК Ссылка,
		|	МаркировкаТоваровИСМП.ТипШК КАК ТипШК
		|ИЗ
		|	Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
		|ГДЕ
		|	МаркировкаТоваровИСМП.Проведен
		|	И МаркировкаТоваровИСМП.ВидОперацииИСМП = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИСМП.Агрегация)
		|	И МаркировкаТоваровИСМП.ДокументОснование = &РасходнаяНакладная
		|	И МаркировкаТоваровИСМП.ШтрихкодыКоробок.НомерСтроки = 1";
		запрос.УстановитьПараметр("РасходнаяНакладная",РасходнаяНакладная);	
		ТЗАгрегатов=запрос.Выполнить().Выгрузить();
		
		
		РезультатРасчетов=РасчитатьПланируемоеКоличествоКА (РасходнаяНакладная);
		если не РезультатРасчетов.Успех тогда
			возврат РезультатРасчетов;
		КонецЕсли;
		
		Если ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияБлочков тогда 
			НужныБлочки=Истина;
			если ТЗАгрегатов.Найти(Перечисления.ТипыШтрихКодов.Блочок)<>Неопределено и не Перезаполнять тогда
				ЕстьБлочки=Истина;
				
			КонецЕсли;
			если не  ЕстьБлочки и РезультатРасчетов.КоличествоБлочков=0 тогда
				СтруктураВозврата.Ошибки.Добавить("Не удалось расчитать блочки для агрегации");
			КонецЕсли;

		КонецЕсли;
		
		Если ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияКоробок тогда
			НужныКоробки=Истина;
			если ТЗАгрегатов.Найти(Перечисления.ТипыШтрихКодов.Коробка)<>Неопределено и не Перезаполнять тогда
				ЕстьКоробки=Истина;
			КонецЕсли;
			
			если не ЕстьКоробки и РезультатРасчетов.КоличествоКоробов=0 тогда
				СтруктураВозврата.Ошибки.Добавить("Не удалось расчитать короба для агрегации");
			КонецЕсли;
		КонецЕсли;
		
		если СтруктураВозврата.Ошибки.Количество()>0 тогда
			СтруктураВозврата.Успех=ложь;
			Возврат СтруктураВозврата;
		КонецЕсли;
		
		Если НужныКоробки и не ЕстьКоробки тогда
			ТипШК=Перечисления.ТипыШтрихКодов.Коробка;		
			ОперАгрегации = Документы.МаркировкаТоваровИСМП.ПолучитьСоздатьДокАгрегации(РасходнаяНакладная,ТипШК );
			если Перезаполнять тогда
				ОперАгрегацииОбъект=ОперАгрегации.ПолучитьОбъект();			
				ОперАгрегацииОбъект.ШтрихкодыКоробок.Очистить();
				ОперАгрегацииОбъект.ШтрихкодыУпаковок.Очистить();
				ОперАгрегацииОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			рБронирования = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыАгрегации(ТипШК,
			// Кухарь А.Ю.  16.04.2025 начало
			//Сделаем небольшой запас
			//ТипУпаковки,РезультатРасчетов.КоличествоКоробов,ОперАгрегации,ДопПараметры);
			ТипУпаковки,Цел(РезультатРасчетов.КоличествоКоробов*1.2),ОперАгрегации,ДопПараметры);
			// Кухарь А.Ю.  16.04.2025 конец
			
			если рБронирования.Успешно тогда
				ОперАгрегацииОбъект=ОперАгрегации.ПолучитьОбъект();
				если ложь тогда ОперАгрегацииОбъект=Документы.МаркировкаТоваровИСМП.СоздатьДокумент();КонецЕсли;
				Для каждого СтрМасс из рБронирования.Данные цикл
					СтрТЧ=ОперАгрегацииОбъект.ШтрихкодыКоробок.Добавить();
					СтрТЧ.ДатаДобавления=ТекущаяДата();
					СтрТЧ.ШтрихкодКоробки=СтрМасс;
				КонецЦикла;			
				Попытка
					ОперАгрегацииОбъект.Записать();
				Исключение
					//Кухарь А.Ю. 29.07.2025 начало
					СтруктураВозврата.Ошибки.Добавить("Не удалось записать короба для агрегации. "+ОписаниеОшибки());
					//Кухарь А.Ю.  29.07.2025 конец
					
				КонецПопытки;
			иначе     
				СтруктураВозврата.ошибки.добавить(СтрСоединить(рБронирования.Ошибки,символы.ПС));
			КонецЕсли;		
		КонецЕсли;
		
		
		Если НужныБлочки и не ЕстьБлочки тогда
			ТипШК=Перечисления.ТипыШтрихКодов.Блочок;		
			ОперАгрегации = Документы.МаркировкаТоваровИСМП.ПолучитьСоздатьДокАгрегации(РасходнаяНакладная,ТипШК );
			если Перезаполнять тогда
				ОперАгрегацииОбъект=ОперАгрегации.ПолучитьОбъект();			
				ОперАгрегацииОбъект.ШтрихкодыКоробок.Очистить();
				ОперАгрегацииОбъект.ШтрихкодыУпаковок.Очистить();
				ОперАгрегацииОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			рБронирования = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыАгрегации(ТипШК,
			// Кухарь А.Ю.  16.04.2025 начало
			// ТипУпаковки,РезультатРасчетов.КоличествоБлочков,ОперАгрегации,ДопПараметры);
			ТипУпаковки,Цел(РезультатРасчетов.КоличествоБлочков*1.2),ОперАгрегации,ДопПараметры);		 
			// Кухарь А.Ю.  16.04.2025 конец
			
			если рБронирования.Успешно тогда
				ОперАгрегацииОбъект=ОперАгрегации.ПолучитьОбъект();
				если ложь тогда ОперАгрегацииОбъект=Документы.МаркировкаТоваровИСМП.СоздатьДокумент();КонецЕсли;
				Для каждого СтрМасс из рБронирования.Данные цикл
					СтрТЧ=ОперАгрегацииОбъект.ШтрихкодыКоробок.Добавить();
					СтрТЧ.ДатаДобавления=ТекущаяДата();
					СтрТЧ.ШтрихкодКоробки=СтрМасс;
				КонецЦикла;			
				Попытка
					ОперАгрегацииОбъект.Записать();
				Исключение
					//Кухарь А.Ю. 29.07.2025 начало
					СтруктураВозврата.Ошибки.Добавить("Не удалось записать блочки для агрегации. "+ОписаниеОшибки());
					//Кухарь А.Ю.  29.07.2025 конец
				КонецПопытки;
			иначе
				СтруктураВозврата.ошибки.добавить(СтрСоединить(рБронирования.Ошибки,символы.ПС));
			КонецЕсли;		
		КонецЕсли;
		
		
	иначе
		СтруктураВозврата.Успех=Истина;
	КонецЕсли;
	
	если СтруктураВозврата.ошибки.количество()>0 тогда
		СтруктураВозврата.Успех=ложь;
	иначе
		СтруктураВозврата.Успех=Истина;
	КонецЕсли;
	возврат СтруктураВозврата;

КонецФункции

Функция РасчитатьПланируемоеКоличествоКА (РасходнаяНакладная) Экспорт
	СтруктураВозврата=новый Структура("КоличествоПаллет,КоличествоКоробов,КоличествоБлочков,Ошибки,Успех");
	СтруктураВозврата.Ошибки=новый Массив;
	СтруктураВозврата.КоличествоКоробов=0;	
	СтруктураВозврата.КоличествоБлочков=0;	
	СтруктураВозврата.Успех=ложь;		
	
	РеквизитыШапки=новый Структура("ТребуетсяМаркировка,ТребуетсяАгрегацияБлочков
	|,ТребуетсяАгрегацияКоробок,ТребуетсяАгрегацияКоробок
	|,ПунктДоставки,Договор,Дата,ПостояннаяАкция,Номенклатура
	|,СворачиватьПоНаименованиюКонтрагента,ИспользоватьНоменклатурнуюМатрицу
	|,Контрагент");
	
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	РасходнаяНакладная.Контрагент.РаботаСМаркированнымТоваром КАК ТребуетсяМаркировка,
	|	ЕСТЬNULL(РасходнаяНакладная.ПравилаАгрегацииЧестногоЗнака.ТребуетсяАгрегацияБлочков, ЛОЖЬ) КАК ТребуетсяАгрегацияБлочков,
	|	ЕСТЬNULL(РасходнаяНакладная.ПравилаАгрегацииЧестногоЗнака.ТребуетсяАгрегацияКоробок, ЛОЖЬ) КАК ТребуетсяАгрегацияКоробок,
	|	ЕСТЬNULL(РасходнаяНакладная.ПравилаАгрегацииЧестногоЗнака.ТребуетсяАгрегацияПаллет, ЛОЖЬ) КАК ТребуетсяАгрегацияПаллет,
	|	ЕСТЬNULL(РасходнаяНакладная.ПравилаАгрегацииЧестногоЗнака.ПриАгрегацииСворачиватьПоНаименованиюКонтрагента, ЛОЖЬ) КАК СворачиватьПоНаименованиюКонтрагента,
	|	ЕСТЬNULL(РасходнаяНакладная.Контрагент.ИспользоватьНоменклатурнуюМатрицу, ЛОЖЬ) КАК ИспользоватьНоменклатурнуюМатрицу,
	|	РасходнаяНакладная.ПунктДоставки КАК ПунктДоставки,
	|	РасходнаяНакладная.Договор КАК Договор,
	|	РасходнаяНакладная.Контрагент КАК Контрагент,
	|	РасходнаяНакладная.Дата КАК Дата,
	|	РасходнаяНакладная.ПостояннаяАкция КАК ПостояннаяАкция
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.Ссылка = &РасходнаяНакладная";
	запрос.УстановитьПараметр("РасходнаяНакладная",РасходнаяНакладная);
	Выборка=запрос.Выполнить().Выбрать();
	пока Выборка.Следующий() цикл		
		ЗаполнитьЗначенияСвойств(РеквизитыШапки,Выборка);
	КонецЦикла;
	
	если не РеквизитыШапки.ТребуетсяАгрегацияБлочков и не РеквизитыШапки.ТребуетсяАгрегацияКоробок тогда
		СтруктураВозврата.Успех=Истина;
		Возврат СтруктураВозврата;	
	КонецЕсли;
	
	
	Запрос.Текст="ВЫБРАТЬ
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	СУММА(ТЧ.Количество) КАК Количество
	|ИЗ
	|	Документ.РасходнаяНакладная.Товары КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &РасходнаяНакладная
	|	И ТЧ.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧ.Номенклатура";
	
	ТаблицаТоваров=запрос.Выполнить().Выгрузить();
	
	
	если РеквизитыШапки.ИспользоватьНоменклатурнуюМатрицу тогда
		РеквизитыШапки.Номенклатура=ТаблицаТоваров.ВыгрузитьКолонку("Номенклатура");	
		ТаблицаМатриц=ПолучитьТаблицуМатрицСрезПоследних(РеквизитыШапки);
		
		Запрос.Текст="ВЫБРАТЬ
		|	ТЧ.Номенклатура КАК Номенклатура,
		|	ТЧ.Количество КАК Количество
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	&ТаблицаТоваров КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧ.Номенклатура КАК Номенклатура,
		|	ТЧ.АртикулКонтрагента КАК АртикулКонтрагента,
		|	ТЧ.КратностьБлочка КАК КратностьБлочка,
		|	ТЧ.КратностьКоробки КАК КратностьКоробки
		|ПОМЕСТИТЬ Матрицы
		|ИЗ
		|	&ТаблицаМатриц КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧ.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ТЧ.КратностьБлочка) КАК КратностьБлочка,
		|	МАКСИМУМ(ТЧ.КратностьКоробки) КАК КратностьКоробки,
		|	МАКСИМУМ(ТЧ.АртикулКонтрагента) КАК АртикулКонтрагента
		|ПОМЕСТИТЬ МатрицыСвернутые
		|ИЗ
		|	Матрицы КАК ТЧ
		|
		|СГРУППИРОВАТЬ ПО
		|	ТЧ.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		// Кухарь А.Ю.  07.04.2025 начало
		// Пустая задача
		|	Товары.Номенклатура.Родитель.ШтукВКоробке КАК КратностьКоробкиИзНоменклатуры,
		|	Товары.Номенклатура.Родитель.ШтукВКоробочке КАК КратностьБлочкаИзНоменклатуры,
		
		// Кухарь А.Ю.  07.04.2025 конец
		
		|	Товары.Количество КАК Количество,
		|	ЕСТЬNULL(Матрицы.КратностьБлочка, 0) КАК КратностьБлочка,
		|	ЕСТЬNULL(Матрицы.КратностьКоробки, 0) КАК КратностьКоробки,
		|	0 КАК КоличествоКоробов,
		|	0 КАК КоличествоБлочков,
		|	ЕСТЬNULL(Матрицы.АртикулКонтрагента, """") КАК АртикулКонтрагента
		|ИЗ
		|	Товары КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ МатрицыСвернутые КАК Матрицы
		|		ПО Товары.Номенклатура = Матрицы.Номенклатура";	
		запрос.УстановитьПараметр("ТаблицаТоваров",ТаблицаТоваров);
		запрос.УстановитьПараметр("ТаблицаМатриц",ТаблицаМатриц);
		
		ТаблицаТоваровСматрицами=Запрос.Выполнить().Выгрузить();	
		
		
		Для каждого СтрокаТаблицы из ТаблицаТоваровСматрицами цикл
			// Кухарь А.Ю.  07.04.2025 начало
			если СтрокаТаблицы.КратностьКоробки = 0 тогда
				СтрокаТаблицы.КратностьКоробки=СтрокаТаблицы.КратностьКоробкиИзНоменклатуры;
			КонецЕсли;
			если СтрокаТаблицы.КратностьБлочка = 0 тогда
				СтрокаТаблицы.КратностьБлочка=СтрокаТаблицы.КратностьБлочкаИзНоменклатуры;
			КонецЕсли;		
			// Кухарь А.Ю.  07.04.2025 конец
			
			
			
			если  РеквизитыШапки.ТребуетсяАгрегацияБлочков тогда
				Если СтрокаТаблицы.КратностьБлочка=0 тогда					
					СтруктураВозврата.Ошибки.Добавить(СтрШаблон("Пустая кратность блочка в %1",СтрокаТаблицы.Номенклатура));
				иначе
					// +++ {Кузнецов Сергей Владимирович [03.04.2025] HELP-3900
					//СтрокаТаблицы.КоличествоБлочков=СтрокаТаблицы.Количество/СтрокаТаблицы.КоличествоБлочков;
					СтрокаТаблицы.КоличествоБлочков=СтрокаТаблицы.Количество/СтрокаТаблицы.КратностьБлочка;
					// }Кузнецов Сергей Владимирович +++ [03.04.2025]
				КонецЕсли;
			КонецЕсли;		
			если  РеквизитыШапки.ТребуетсяАгрегацияКоробок тогда
				Если СтрокаТаблицы.КратностьКоробки=0  тогда					
					СтруктураВозврата.Ошибки.Добавить(СтрШаблон("Пустая кратность коробки в %1",СтрокаТаблицы.Номенклатура));
				иначе
					СтрокаТаблицы.КоличествоКоробов=СтрокаТаблицы.Количество/СтрокаТаблицы.КратностьКоробки;
				КонецЕсли;
			КонецЕсли;		
		КонецЦикла;
		
		если СтруктураВозврата.Ошибки.Количество()=0 тогда
			КоличествоКоробов=ТаблицаТоваровСматрицами.Итог("КоличествоКоробов");
			если Цел(КоличествоКоробов)<>КоличествоКоробов тогда
				КоличествоКоробов=Цел(КоличествоКоробов)+1;
			КонецЕсли;
			
			КоличествоБлочков=ТаблицаТоваровСматрицами.Итог("КоличествоБлочков");
			если Цел(КоличествоБлочков)<>КоличествоБлочков тогда
				КоличествоБлочков=Цел(КоличествоБлочков)+1;
			КонецЕсли;
			
			
			СтруктураВозврата.КоличествоКоробов=КоличествоКоробов;
			СтруктураВозврата.КоличествоБлочков=КоличествоБлочков;
			СтруктураВозврата.Успех=Истина;
			Возврат СтруктураВозврата;	
		иначе
			СтруктураВозврата.Успех=ложь;
		КонецЕсли;
		
	иначе
		СтруктураВозврата.Ошибки.Добавить("Агрегация разрешена только по матричным контрагентам");
		СтруктураВозврата.Успех=ложь;
	КонецЕсли;
	
	Возврат СтруктураВозврата; 
	
КонецФункции
// Кухарь А.Ю. 18.03.2025 конец
