Перем НачСостНакладной;
Перем НеКонтролироватьЗапись;
Перем НеКонтролироватьТА;
//крохин начало 15.02.2013
Перем НеВыгружатьДокумент;
//крохин конец 15.02.2013
//крохин начало 15.04.2013   
Перем НеконтролироватьНаличиеСФ;
//крохин конец 15.04.2013
//Катаев+ 06/10/14
Перем НужноВыгружать;
//Катаев- 06/10/14
Перем КаталогЕкода, КаталогЕкодаФТП экспорт;

//Кухарь 17.01.19 начало
//Для того чтобы некоторые реквизиты не перезаписывались
//Процедура ЗаписьБезКонтроляПолномочий ()   экспорт
Перем ТЗНеизменяемыхРеквизитов;
// +++ {Кузнецов Сергей Владимирович [10.08.2022]
Перем ПростоЗаписать;
// }Кузнецов Сергей Владимирович +++ [10.08.2022]

// Шворобей ВЮ 19.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5152
Процедура ЗаписьБезКонтроляПолномочий(ТЗПараметров = Неопределено) Экспорт
	
	ТЗНеизменяемыхРеквизитов = ТЗПараметров;
	//Кухарь 17.01.19 конец
	
	НеКонтролироватьЗапись = ?(Дата > ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования(), Истина, Ложь);
	//++Данилова Е.В. 27.10.2025 HELP-7587 
	если ТипЗнч(ТЗНеизменяемыхРеквизитов) = Тип("ТаблицаЗначений") 
		И ТЗНеизменяемыхРеквизитов.найти("ЗаписьНЕВПопытке")<>Неопределено тогда
		ЗаписьНЕВПопытке=Истина; 
	иначе
		ЗаписьНЕВПопытке=Ложь;			
	КонецЕсли;
	
	Если ЗаписьНЕВПопытке Тогда
		
		Записать(?(Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
		НеКонтролироватьЗапись = Ложь;	
		
	Иначе 
		
		Попытка
			Записать(?(Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
			НеКонтролироватьЗапись = Ложь;
		Исключение
			#Если ТолстыйКлиентОбычноеПриложение Тогда
				Оповестить("ОшибкаПриЗаписиДокумента", "Ошибка при записи документа " + Строка(ЭтотОбъект));
			#КонецЕсли
		КонецПопытки;
	КонецЕсли;
	//--Данилова Е.В. 27.10.2025
	
КонецПроцедуры
// Шворобей ВЮ 19.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5152

//Катаев+ 23/05/14 Процедура для обработки ПроверкаВзаиморасчетов
Процедура ЗаписьПриПроверкиВзаиморасчетов() Экспорт
	НеКонтролироватьЗапись = Истина;
	Записать(РежимЗаписиДокумента.Проведение);
	НеКонтролироватьЗапись = Ложь;
КонецПроцедуры
//Катаев- 23/05/14

Процедура УстановитьСостояниеДокументов(НовоеСостояниеДокументов,КодУзла = Неопределено,НЕКонтрольСФ = Неопределено) Экспорт
	//крохин начало 15.04.2013
	Если НЕКонтрольСФ <> Неопределено И  НеКонтрольСФ Тогда
		НеконтролироватьНаличиеСФ = Истина;
	КонецЕсли;
	//крохин конец 15.04.2013
	//крохин начало 15.02.2013
	//теперь не выгружаем документ, вместо этого делаем запись в регистре сведений "состояние документов", 
	//на основании которого обработкой проставляем состояния в ЦО
	
	////крохин начало 09.02.2011
	////за датой запрета записываем реквизиты только в ЦО
	////НеКонтролироватьЗапись=Истина;
	////СостояниеДокументов=НовоеСостояниеДокументов;
	////Записать();
	////НеКонтролироватьЗапись=Ложь;
	//Отказ = Ложь;
	//Если ЭтотОбъект.Дата<=ПолучитьДатуЗапретаРедактирования(ЭтотОбъект) Тогда
	//	Отказ = Истина;
	//КонецЕсли;
	//Если Отказ Тогда
	//	Если	ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение  Тогда
	//	НеКонтролироватьЗапись=Истина;
	//СостояниеДокументов=НовоеСостояниеДокументов;
	//Записать();
	//НеКонтролироватьЗапись=Ложь;	
	//	КонецЕсли;
	//Иначе
	//НеКонтролироватьЗапись=Истина;
	//СостояниеДокументов=НовоеСостояниеДокументов;
	//Записать();
	//НеКонтролироватьЗапись=Ложь;
	//КонецЕсли;
	////крохин конец 09.02.2011
	Если СостояниеДокументов <> НовоеСостояниеДокументов Тогда
		НеВыгружатьДокумент = Истина;
		НеКонтролироватьЗапись=Истина;
		СостояниеДокументов=НовоеСостояниеДокументов;
		Записать();
		Если КодУзла = Неопределено Тогда
			СписокПолучателей = Новый СписокЗначений;
			Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда		
				//крохин начало 29.03.2013
				//только для складов с указанным кодом
				//СписокПолучателей.Добавить(Склад.КодФизическогоУзла);
				Если НЕ ПустаяСтрока(Склад.КодФизическогоУзла) Тогда
					СписокПолучателей.Добавить(Склад.КодФизическогоУзла);
				КонецЕсли;
				//крохин конец 29.03.2013
				
				ПодразделениеДоговора=Договор.Подразделение;
				
				//крохин начало 01.09.2011
				//кроме пустых подразделений
				//Если ПодразделениеДоговора<>ЭтотУзел.Подразделение Тогда
				Если ПодразделениеДоговора<>ПараметрыСеанса.ЭтотУзел.Подразделение И НЕ ПодразделениеДоговора.пустая() Тогда
					//крохин конец 01.09.2011
					Запрос=Новый Запрос;
					Запрос.Текст=" 
					|ВЫБРАТЬ
					|	Ссылка
					|ИЗ
					|	ПланОбмена.Основной КАК Основной
					|ГДЕ
					|	Подразделение = &Подразделение
					|	И НЕ ПометкаУдаления
					|	И Ссылка<>&ЭтотУзел";					
					
					Запрос.УстановитьПараметр("Подразделение",	ПодразделениеДоговора);
					Запрос.УстановитьПараметр("ЭтотУзел",		ПараметрыСеанса.ЭтотУзел);
					
					Выборка=Запрос.Выполнить().Выбрать();
					
					Пока Выборка.Следующий() Цикл
						СписокПолучателей.Добавить(Выборка.Ссылка.Код);
					КонецЦикла;						
				КонецЕсли;				
				
			Иначе
				
				Если Склад.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда
					СписокПолучателей.Добавить("SNL");					
				КонецЕсли;
			КонецЕсли;
			НЗ = РегистрыСведений.СостояниеДокументов.СоздатьНаборЗаписей();
			НЗ.Отбор.КодУзла.Установить(ПараметрыСеанса.ЭтотУзел.Код,Истина);
			НЗ.Отбор.Документ.Установить(Ссылка,Истина);
			Для Каждого УзелИзСписка Из СписокПолучателей Цикл
				Запись = НЗ.Добавить();
				Запись.Регистратор = Ссылка;
				Запись.Состояние = НовоеСостояниеДокументов;
				Запись.Автор = ПараметрыСеанса.Пользователь;
				Запись.КодУзлаПолучателя = УзелИзСписка;
				Запись.Документ = Ссылка;
				запись.КодУзла =  ПараметрыСеанса.ЭтотУзел.Код;
				Запись.Отработана = Ложь;
			КонецЦикла;
			НЗ.Записать();
		Иначе
			//крохин начало 11.08.2013
			//"отработана" ставим в обработке, запись не удаляем
			//НЗ = РегистрыСведений.СостояниеДокументов.СоздатьНаборЗаписей();
			//НЗ.Отбор.КодУзла.Установить(КодУзла,Истина);
			//НЗ.Отбор.КодУзлаПолучателя.Установить(ПараметрыСеанса.ЭтотУзел.Код,Истина);
			//НЗ.Отбор.Документ.Установить(Ссылка,Истина);
			//НЗ.Записать();
			//крохин конец 11.08.2013
		КонецЕсли;
		
		НеКонтролироватьЗапись=Ложь;
		НеВыгружатьДокумент = Ложь;
	КонецЕсли;
	
	Если КодУзла <> Неопределено Тогда
		НЗ = РегистрыСведений.СостояниеДокументов.СоздатьНаборЗаписей();
		НЗ.Отбор.КодУзла.Установить(КодУзла,Истина);
		НЗ.Отбор.КодУзлаПолучателя.Установить(ПараметрыСеанса.ЭтотУзел.Код,Истина);
		НЗ.Отбор.Документ.Установить(Ссылка,Истина);
		НЗ.Записать();
	КонецЕсли;	
	
	//крохин конец 15.02.2013
	
	//крохин начало 15.04.2013
	
	НеконтролироватьНаличиеСФ = Ложь;
	//крохин конец 15.04.2013
	
КонецПроцедуры

Процедура УстановитьДатуНомерСчета(НоваяДатасчета,НовыйНомерСчета)   Экспорт
	//крохин начало 09.02.2011
	//за датой запрета записываем реквизиты только в ЦО
	//НеКонтролироватьЗапись=Истина;
	//НомерСчета=НовыйНомерСчета;
	//ДатаСчета= НоваяДатасчета;
	//Записать();
	//НеКонтролироватьЗапись=Ложь;
	Отказ = Ложь;
	Если ЭтотОбъект.Дата<=ПолучитьДатуЗапретаРедактирования(ЭтотОбъект) Тогда
		Отказ = Истина;
	КонецЕсли;
	Если Отказ Тогда
		Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			НеКонтролироватьЗапись=Истина;
			НомерСчета=НовыйНомерСчета;
			ДатаСчета= НоваяДатасчета;
			Записать();
			НеКонтролироватьЗапись=Ложь;
		КонецЕсли;	
	Иначе
		НеКонтролироватьЗапись=Истина;
		НомерСчета=НовыйНомерСчета;
		ДатаСчета= НоваяДатасчета;
		Записать();
		НеКонтролироватьЗапись=Ложь;
	КонецЕсли;
	//крохин конец 09.02.2011
КонецПроцедуры

//крохин начало 08.10.2012
Процедура УстановитьСостояниеКоррекции(НовоеСостояниеКоррекции) Экспорт
	Отказ = Ложь;
	Если ЭтотОбъект.Дата<=ПолучитьДатуЗапретаРедактирования(ЭтотОбъект) Тогда
		Отказ = Истина;
	КонецЕсли;
	Если Отказ Тогда
		Если	ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение  Тогда
			НеКонтролироватьЗапись=Истина;
			СостояниеКоррекции=НовоеСостояниеКоррекции;
			Записать();
			НеКонтролироватьЗапись=Ложь;	
		КонецЕсли;
	Иначе
		НеКонтролироватьЗапись=Истина;
		СостояниеКоррекции=НовоеСостояниеКоррекции;
		Записать();
		НеКонтролироватьЗапись=Ложь;
	КонецЕсли;
	
КонецПроцедуры
//крохин конец 08.10.2012

Процедура ПеренестиРезерв() Экспорт
	НеКонтролироватьТА=Истина;
	//крохин начало 06.11.2012
	//при переносе резерва меняется курс
	Доллары					= Справочники.Валюты.НайтиПоКоду("840");
	Курс=ПолучитьКурсВалюты(?(Валюта=ПараметрыСеанса.ВалютаНац,Доллары,Валюта),Дата).Курс;
	//крохин конец 06.11.2012
	Записать(?(Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
	НеКонтролироватьТА=Ложь;
КонецПроцедуры 


//нечаева +++  04,09,13
Процедура ОтправлятьПисьмоОпревышенииЛимита() Экспорт
	
	// пропишем в регист нужно ли отправлять письмо
	
	ЗапросПисьмоОтправлено = Новый запрос;
	ЗапросПисьмоОтправлено.Текст = "ВЫБРАТЬ
	|	ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.Отправлено,
	|	ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.Емайл,
	|	ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.ОтгрузкуРазрешил
	|ИЗ
	|	РегистрСведений.ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж КАК ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж
	|ГДЕ
	|	ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.РНК = &ТекРНК
	|	И ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.Отгружен = &Отгружен
	|	И ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.ОтгрузкуРазрешил = &ОтгрузкуРазрешил
	|	И ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.ОтгружатьСПросроченнойЗадолженностью = &ПрЗад
	|	И ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.ОтгружатьСПревышениемЛимита = &ПрЛим";
	ЗапросПисьмоОтправлено.УстановитьПараметр("ТекРНк",Ссылка);
	ЗапросПисьмоОтправлено.УстановитьПараметр("Отгружен",Отгружен);
	ЗапросПисьмоОтправлено.УстановитьПараметр("ОтгрузкуРазрешил",ОтгрузкуРазрешил);
	ЗапросПисьмоОтправлено.УстановитьПараметр("ПрЗад",ОтгружатьСПросроченнойЗадолженостью);
	ЗапросПисьмоОтправлено.УстановитьПараметр("ПрЛим",ОтгружатьСПревышениемЛимитаКредита);
	
	УжеЕсть=Ложь;
	
	Выборка = ЗапросПисьмоОтправлено.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Отправлено = Выборка.Отправлено;
		УжеЕсть=Истина;
	Иначе
		Отправлено = Неопределено;
	КонецЕсли;
	
	//	#Если КЛИЕНТ Тогда
	// проверить изменилось ли ОЛ. - если да, то ставить ложь. и галки на отгрузку 
	Если ссылка.ОтгружатьСПросроченнойЗадолженостью<> ОтгружатьСПросроченнойЗадолженостью или
		ссылка.ОтгружатьСПревышениемЛимитаКредита <> ОтгружатьСПревышениемЛимитаКредита или
		ссылка.ОтгрузкуРазрешил  <> ОтгрузкуРазрешил Тогда
		// отправляем письмо еще раз, с новыми данными.
		
		Отправлено = Неопределено;
		
	КонецЕсли;
	//	#конецЕсли 
	
	
	Попытка
		// отправляем письмо, если еще не отправляли
		Если Отправлено=Неопределено и СостояниеНакладной<>перечисления.СостоянияНакладной.ВРаботе и не отгрузкуРазрешил.Пустая() Тогда
			
			
			// Проверим, есть ли такая запись...
			Запрос=новый Запрос;
			Запрос.текст="ВЫБРАТЬ
			|	ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.РНК КАК РНК,
			|	ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.ОтгрузкуРазрешил КАК отгрузкуРазрешил
			|ИЗ
			|	РегистрСведений.ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж КАК ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж
			|ГДЕ
			|	ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.РНК = &Рнк
			|	И ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.Отгружен = &Отгружен
			|	И ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.ОтгрузкуРазрешил = &ОтгрузкуРазрешил
			|	И ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.ОтгружатьСПросроченнойЗадолженностью = &П1
			|	И ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.ОтгружатьСПревышениемЛимита = &П2";
			
			Запрос.УстановитьПараметр("РНК",Ссылка);
			Запрос.УстановитьПараметр("Отгружен",Отгружен);
			Запрос.УстановитьПараметр("ОтгрузкуРазрешил",ОтгрузкуРазрешил);
			Запрос.УстановитьПараметр("п1",ОтгружатьСПросроченнойЗадолженостью);
			Запрос.УстановитьПараметр("п2",ОтгружатьСПревышениемЛимитаКредита);
			
			Рез=запрос.Выполнить().Выгрузить();
			
			Если УжеЕсть=Ложь и Рез.Количество()=0 Тогда
				// Если нет записей, тогда создаем новую	    		
				Попытка						
					НаборЗаписей = РегистрыСведений.ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.РНК.значение=Ссылка;
					НаборЗаписей.Отбор.Отгружен.значение=Отгружен;
					НаборЗаписей.Отбор.РНК.Использование = Истина;
					НаборЗаписей.Отбор.Отгружен.Использование = Истина;
					НаборЗаписей.Отбор.ОтгрузкуРазрешил.значение = ОтгрузкуРазрешил;
					НаборЗаписей.Отбор.ОтгрузкуРазрешил.Использование = Истина;
					
					
					//НаборЗаписей.Отбор.ОтгрузкуРазрешил.значение = Ссылка.ОтгрузкуРазрешил;
					НаборЗаписей.Прочитать();
					
					Запись = НаборЗаписей.Добавить();
					Запись.РНК = Ссылка;
					Запись.Отгружен = Отгружен;
					Запись.ОтгрузкуРазрешил = ОтгрузкуРазрешил;
					Запись.ОтгружатьСПросроченнойЗадолженностью = ОтгружатьСПросроченнойЗадолженостью;
					Запись.ОтгружатьСПревышениемЛимита = ОтгружатьСПревышениемЛимитаКредита ;
					Запись.Емайл = ОтгрузкуРазрешил.ЕМэйл;
					Запись.период = ТекущаяДата();
					Запись.отправлено = Ложь;
					НаборЗаписей.Записать();
				исключение
					//ЗаписатьВЛог("ЗаписьРНК",Строка(ДокОбъект)+" - не удалосьзаписать данные в регситр сведений для формирования уведомления","Важное");
				конецПопытки;
			КонецЕсли;
			
			
			// если запись есть, то меняем ее.
			Если УжеЕсть=Истина Тогда 
				Попытка						
					НаборЗаписей1 = РегистрыСведений.ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.СоздатьНаборЗаписей();
					НаборЗаписей1.Отбор.РНК.значение=Ссылка;
					НаборЗаписей1.Отбор.Отгружен.значение	= Отгружен;
					НаборЗаписей1.Отбор.ОтгрузкуРазрешил.значение = ОтгрузкуРазрешил;
					НаборЗаписей1.Отбор.РНК.Использование = Истина;
					НаборЗаписей1.Отбор.Отгружен.Использование = Истина;
					НаборЗаписей1.Отбор.ОтгрузкуРазрешил.Использование = Истина;
					НаборЗаписей1.Прочитать();
					
					Для каждого Запись из НаборЗаписей1 Цикл
						
						Запись.РНК = Ссылка;
						Запись.Отгружен = Отгружен;
						Запись.ОтгрузкуРазрешил = ОтгрузкуРазрешил;
						Запись.ОтгружатьСПросроченнойЗадолженностью =  ОтгружатьСПросроченнойЗадолженостью;
						Запись.ОтгружатьСПревышениемЛимита =  ОтгружатьСПревышениемЛимитаКредита ;
						Запись.Емайл = ОтгрузкуРазрешил.ЕМэйл;
						Запись.период = НачалоДня(ТекущаяДата());
						Запись.ПисьмоОтправленоДата=Дата(1,1,1);
						Запись.отправлено = Ложь;
						НаборЗаписей1.Записать();
						прервать;
					КонецЦикла;
					
					// смотрим есть ли не отправленные письма на др ОЛ, по этому же док. их отправлять не надо!!!
					// Проверим, есть ли такая запись...
					Запрос=новый Запрос;
					Запрос.текст="ВЫБРАТЬ
					|	ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.РНК КАК РНК,
					|	ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.ОтгрузкуРазрешил КАК отгрузкуРазрешил,
					|	ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.Отгружен КАК Отгружен,
					|	ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.ОтгружатьСПросроченнойЗадолженностью КАК ОтгружатьЗад,
					|	ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.ОтгружатьСПревышениемЛимита КАК ОтгружатьЛим
					|ИЗ
					|	РегистрСведений.ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж КАК ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж
					|ГДЕ
					|	ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.РНК = &Рнк
					|	И ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.ОтгрузкуРазрешил <> &ОтгрузкуРазрешил
					|	И ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.Отправлено = ЛОЖЬ";
					
					Запрос.УстановитьПараметр("РНК",Ссылка);
					Запрос.УстановитьПараметр("ОтгрузкуРазрешил",ОтгрузкуРазрешил);
					Рез=запрос.Выполнить().Выбрать();
					Если Рез.Количество()>0 Тогда
						Пока Рез.Следующий() Цикл
							// меняем на отправлено=Истина
							НаборЗаписей = РегистрыСведений.ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.СоздатьНаборЗаписей();
							НаборЗаписей.Отбор.РНК.значение=Рез.Рнк;
							НаборЗаписей.Отбор.Отгружен.значение	= Рез.Отгружен;
							НаборЗаписей.Отбор.ОтгрузкуРазрешил.значение = Рез.ОтгрузкуРазрешил;
							НаборЗаписей.Отбор.ОтгружатьСПросроченнойЗадолженностью.значение = Рез.ОтгружатьЗад;
							НаборЗаписей.Отбор.ОтгружатьСПревышениемЛимита.значение = Рез.ОтгружатьЛим;
							НаборЗаписей.Отбор.РНК.Использование = Истина;;
							НаборЗаписей.Отбор.Отгружен.Использование = Истина;
							НаборЗаписей.Отбор.ОтгрузкуРазрешил.Использование = Истина;
							НаборЗаписей.Отбор.ОтгружатьСПросроченнойЗадолженностью.Использование = Истина;
							НаборЗаписей.Отбор.ОтгружатьСПревышениемЛимита.Использование = Истина;
							
							НаборЗаписей.Прочитать();
							Для каждого Запись из НаборЗаписей Цикл
								
								Запись.РНК = Рез.Рнк;
								Запись.Отгружен = Рез.Отгружен;
								Запись.ОтгрузкуРазрешил = Рез.ОтгрузкуРазрешил;
								Запись.ОтгружатьСПросроченнойЗадолженностью = Рез.ОтгружатьЗад;
								Запись.ОтгружатьСПревышениемЛимита =  Рез.ОтгружатьЛим;
								Запись.Емайл = "";
								Запись.период = ТекущаяДата();
								Запись.ПисьмоОтправленоДата=Дата(1,1,1);
								Запись.отправлено = истина;
								НаборЗаписей.Записать();
								прервать;
							КонецЦикла;
						КонецЦикла;	
						
					КонецЕсли;
					
				исключение
					//Сообщить(ОписаниеОшибки());
					//!!!!!!!!!!
					//ЗаписатьВЛог("ЗаписьРНК",Строка(ссылка)+" Уже есть=Истина - не удалосьзаписать данные в регситр сведений для формирования уведомления","Важное");
				конецПопытки;
				
			КонецЕсли;
		КонецЕсли;
	исключение
		//ЗаписатьВЛог("ЗаписьРНК",Строка(ссылка)+" - не удалосьзаписать данные в регситр сведений для формирования уведомления","Важное");
	КонецПопытки;
	
	
	
	
	
	
	//
	//	//--------------------------------------------------------------------------------------
	//	//Нечаева +++ 07,08,13
	//	// пишем в регистр данные для отправки писем ОЛ по отпр или отгруженым накладным.
	//	
	//	Если (не отгрузкуРазрешил.Пустая()) и СостояниеНакладной<>Перечисления.СостоянияНакладной.ВРаботе  И ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение  Тогда
	//		
	//		ЗапросПисьмоОтправлено = Новый запрос;
	//		ЗапросПисьмоОтправлено.Текст = "ВЫБРАТЬ
	//									   |	ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.Отправлено,
	//									   |	ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.Емайл,
	//									   |	ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.ОтгрузкуРазрешил
	//									   |ИЗ
	//									   |	РегистрСведений.ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж КАК ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж
	//									   |ГДЕ
	//									   |	ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.РНК = &ТекРНК
	//									   |	И ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.Отгружен = &Отгружен
	//									   |	И ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.ОтгрузкуРазрешил = &ОтгрузкуРазрешил
	//									   |	И ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.ОтгружатьСПросроченнойЗадолженностью = &ПрЗад
	//									   |	И ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.ОтгружатьСПревышениемЛимита = &ПрЛим";
	//		ЗапросПисьмоОтправлено.УстановитьПараметр("ТекРНк",Ссылка);
	//		ЗапросПисьмоОтправлено.УстановитьПараметр("Отгружен",ссылка.Отгружен);
	//		ЗапросПисьмоОтправлено.УстановитьПараметр("ОтгрузкуРазрешил",ссылка.ОтгрузкуРазрешил);
	//		ЗапросПисьмоОтправлено.УстановитьПараметр("ПрЗад",ссылка.ОтгружатьСПросроченнойЗадолженостью);
	//		ЗапросПисьмоОтправлено.УстановитьПараметр("ПрЛим",ссылка.ОтгружатьСПревышениемЛимитаКредита);
	//	
	//		
	//		Выборка = ЗапросПисьмоОтправлено.Выполнить().Выбрать();
	//		Если Выборка.Следующий() Тогда
	//			Отправлено = Выборка.Отправлено;
	//		Иначе
	//			Отправлено = Неопределено;
	//		КонецЕсли;
	//		
	//		// проверить изменилось ли ОЛ. - если да, то ставить ложь. и галки на отгрузку 
	//		Если ссылка.ОтгружатьСПросроченнойЗадолженостью<> ЭтотОбъект.ОтгружатьСПросроченнойЗадолженостью или
	//			ссылка.ОтгружатьСПревышениемЛимитаКредита <> ЭтотОбъект.ОтгружатьСПревышениемЛимитаКредита или
	//			ссылка.ОтгрузкуРазрешил  <> ЭтотОбъект.ОтгрузкуРазрешил Тогда
	//			// отправляем письмо еще раз, с новыми данными.
	//			
	//			 Отправлено = Неопределено;
	//
	//		КонецЕсли;
	//
	//		попытка
	//			// отправляем письмо, если еще не отправляли
	//			Если Отправлено=Неопределено и ссылка.СостояниеДокументов<>перечисления.СостоянияНакладной.ВРаботе и не отгрузкуРазрешил.Пустая() Тогда
	//				//
	//				//НаборЗаписей = РегистрыСведений.ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.СоздатьНаборЗаписей();
	//				//НаборЗаписей.Отбор.РНК.значение=Ссылка;
	//				//НаборЗаписей.Отбор.Отгружен.значение	= Ссылка.Отгружен;
	//				//НаборЗаписей.Отбор.ОтгрузкуРазрешил.значение = Ссылка.ОтгрузкуРазрешил;
	//				//НаборЗаписей.Прочитать();
	//				//										
	//				//Запись = НаборЗаписей.Добавить();
	//				//Запись.РНК = Ссылка;
	//				//Запись.Отгружен = ссылка.Отгружен;
	//				//Запись.ОтгрузкуРазрешил = ссылка.ОтгрузкуРазрешил;
	//				//Запись.ОтгружатьСПросроченнойЗадолженностью = ссылка.ОтгружатьСПросроченнойЗадолженостью;
	//				//Запись.ОтгружатьСПревышениемЛимита = ссылка.ОтгружатьСПревышениемЛимитаКредита ;
	//				//Запись.Емайл= ссылка.ОтгрузкуРазрешил.ЕМэйл;
	//				//Запись.период=ТекущаяДата();
	//				//Запись.отправлено=Ложь;
	//				//НаборЗаписей.Записать();
	//				
	//				// Проверим, есть ли такая запись...
	//				Запрос=новый Запрос;
	//				Запрос.текст="ВЫБРАТЬ
	//				|	ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.РНК КАК РНК,
	//				|	ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.ОтгрузкуРазрешил КАК отгрузкуРазрешил
	//				|ИЗ
	//				|	РегистрСведений.ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж КАК ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж
	//				|ГДЕ
	//				|	ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.Период = &Дата2
	//				|	И ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.РНК = &Рнк
	//				|	И ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.Отгружен = &Отгружен
	//				|	И ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.ОтгрузкуРазрешил = &ОтгрузкуРазрешил
	//				|	И ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.ОтгружатьСПросроченнойЗадолженностью = &П1
	//				|	И ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.ОтгружатьСПревышениемЛимита = &П2            ";
	//				Запрос.УстановитьПараметр("Дата2",ТекущаяДата());
	//				Запрос.УстановитьПараметр("РНК",Ссылка);
	//				Запрос.УстановитьПараметр("Отгружен",ссылка.Отгружен);
	//				Запрос.УстановитьПараметр("ОтгрузкуРазрешил",ссылка.ОтгрузкуРазрешил);
	//				Запрос.УстановитьПараметр("п1",ссылка.ОтгружатьСПросроченнойЗадолженностью);
	//				Запрос.УстановитьПараметр("п2", ссылка.ОтгружатьСПревышениемЛимитаКредита);
	//				Если Не Запрос.Выполнить().Выбрать().Количество()>0 Тогда
	//					// Если нет записей, тогда создаем новую	    		
	//					
	//					
	//					НаборЗаписей = РегистрыСведений.ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.СоздатьНаборЗаписей();
	//					НаборЗаписей.Отбор.РНК.значение=Ссылка;
	//					НаборЗаписей.Отбор.Отгружен.значение	= Ссылка.Отгружен;
	//					НаборЗаписей.Отбор.ОтгрузкуРазрешил.значение = Ссылка.ОтгрузкуРазрешил;
	//					НаборЗаписей.Прочитать();
	//					
	//					Запись = НаборЗаписей.Добавить();
	//					Запись.РНК = Ссылка;
	//					Запись.Отгружен = ссылка.Отгружен;
	//					Запись.ОтгрузкуРазрешил = ссылка.ОтгрузкуРазрешил;
	//					Запись.ОтгружатьСПросроченнойЗадолженностью = ссылка.ОтгружатьСПросроченнойЗадолженостью;
	//					Запись.ОтгружатьСПревышениемЛимита = ссылка.ОтгружатьСПревышениемЛимитаКредита ;
	//					Запись.Емайл= ссылка.ОтгрузкуРазрешил.ЕМэйл;
	//					Запись.период=ТекущаяДата();
	//					Запись.отправлено=Ложь;
	//					НаборЗаписей.Записать();
	//				КонецЕсли;
	//		
	//		
	//				
	//			КонецЕсли;
	//		исключение
	//		КонецПопытки;
	//		
	//	КонецЕсли;
	//	//Нечаева +++ 07,08,13
	//	//--------------------------------------------------------------------------------------
	
	
	
	
КонецПроцедуры	


//нечаева 26,04,18+++
Функция ПолучитьАртикулыМатрицы(ДокОбъект)
	
	
	// для договоров не по матрице
	Попытка
		Если ДокОбъект.Договор.НеИспользоватьМатрицу Тогда
			НеИспользоватьМартицуПоДоговору=Истина;
		иначе
			НеИспользоватьМартицуПоДоговору=ложь;
		КонецЕсли;	
	Исключение
		НеИспользоватьМартицуПоДоговору=ложь;
	конецПопытки;
	ТЗ = новый ТаблицаЗначений;
	Тз.Очистить();
	
	Попытка
		Если ДокОбъект.контрагент.ИспользоватьНоменклатурнуюМатрицу и не НеИспользоватьМартицуПоДоговору Тогда
			// проверяем по какому типу расчитывать цену - с учетом договора или нет(если по договору не найдено). 
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Матрица.Ссылка КАК Ссылка1
			|ИЗ
			|	Документ.Матрица КАК Матрица
			|ГДЕ
			|	Матрица.Контрагент = &Контрагент
			|	И Матрица.Дата <= &Дата1
			|	И Матрица.ДатаОкончания >= &Дата2
			|	И Матрица.Договор = &Договор
			|	И Матрица.Проведен = истина
			|АВТОУПОРЯДОЧИВАНИЕ";
			
			
			Запрос.УстановитьПараметр("Дата2",НачалоДня(ДокОбъект.дата));
			Запрос.УстановитьПараметр("Дата1",КонецДня(ДокОбъект.дата));
			Запрос.УстановитьПараметр("Контрагент",ДокОбъект.Контрагент);
			Запрос.УстановитьПараметр("Договор",ДокОбъект.Договор);
			ТЗЕстьМатрицаПоДоговору = Запрос.Выполнить().Выгрузить();
			
			
			//запрос на получение
			Запрос=Новый Запрос;
			Запрос.Текст=
			"ВЫБРАТЬ
			|	МатрицаТовары.Номенклатура КАК Номенклатура,
			|	МатрицаТовары.ШККонтрагента КАК ШККонтрагента,
			|	МатрицаТовары.АртикулКонтрагента КАК АртикулКонтрагента,
			|	МатрицаТовары.Ссылка КАК Ссылка,
			|	МатрицаТовары.НаименованиеКонтрагента КАК НаименованиеКонтрагента,
			|	МатрицаТовары.Кратность КАК Кратность,
			|	МатрицаТовары.ШККонтрагентаБлочок КАК ШККонтрагентаБлочок,
			|	МатрицаТовары.ШКСпайки КАК ШКСпайки,
			|	МатрицаТовары.КратностьКоробки КАК КратностьКоробки
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|ГДЕ
			|	МатрицаТовары.Ссылка.Дата <= &Дата1
			|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
			|	И КОНЕЦПЕРИОДА(МатрицаТовары.Ссылка.ДатаОкончания, ДЕНЬ) >= &ТекДата
			|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА";
			
			
			Если ТЗЕстьМатрицаПоДоговору.Количество()>0 Тогда
				ЕстьМатрицаПоДоговору = истина;
				//с учетом договора
				Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.Договор = &Договор";
				
			иначе
				ЕстьМатрицаПоДоговору = ложь;
			КонецЕсли;
			
			Попытка
				Если Ссылка.ПостояннаяАкция Тогда
					Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
					//постоянные акции только под галку
				Иначе
					Запрос.Текст = Запрос.Текст +" И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция";
					
				КонецЕсли;
			Исключение
			КонецПопытки;	
			Запрос.Текст = Запрос.Текст +"	
			|УПОРЯДОЧИТЬ ПО
			|	МатрицаТовары.Ссылка.Дата УБЫВ
			|АВТОУПОРЯДОЧИВАНИЕ";
			
			Запрос.УстановитьПараметр("Контрагент",ДокОбъект.Контрагент);
			Запрос.УстановитьПараметр("Договор",ДокОбъект.Договор);
			Запрос.УстановитьПараметр("Дата1",КонецДня(ДокОбъект.Дата));
			Запрос.УстановитьПараметр("ТекДата",НачалоДня(ДокОбъект.Дата));
			
			тз1 = Запрос.Выполнить().Выгрузить();
			
			Возврат ТЗ1;
			
			
			
		КонецЕсли;
	исключение
		Возврат ТЗ;
	конецПопытки;	
	
	возврат ТЗ; //пустая таблица
	
КонецФункции
//нечаева 26,04,18----


//нечаева 10,11,21+++
//--------------------------------------------------------------------------------------------------------------
/// переводим на сборку заказы вб

Функция ТабЗначВМассив(ТаблицаЗначений) Экспорт
	НашМассив = Новый Массив;
	Для Каждого СтрокаТаблицы из ТаблицаЗначений Цикл
		НашаСтруктура = Новый Структура;
		Счетчик = 0;
		Для Каждого СтрокаСтруктуры из СтрокаТаблицы Цикл
			Если НЕ ТипЗнч(СтрокаСтруктуры) = Тип(ТаблицаЗначений) тогда
				НашаСтруктура.Вставить(ТаблицаЗначений.Колонки[Счетчик].Имя,СтрокаТаблицы[Счетчик]);
			Иначе
				НашаСтруктура.Вставить(ТаблицаЗначений.Колонки[Счетчик].Имя,ТабЗначВМассив(СтрокаСтруктуры));
			КонецЕсли;
			Счетчик = Счетчик + 1;
		КонецЦикла;
		НашМассив.Добавить(НашаСтруктура);
	КонецЦикла;
	Возврат(НашМассив);
КонецФункции

Функция PUT_Запрос(Команда,ТелоДж)  // get запрос
	
	// это продуктив пароли
	
	//	
	//	Токен для теста:
	//ee2add01c9436f523932a3da4e5af0b9d890515a67af1aa18df22327d020f0f2
	
	//Токен для работы:
	//c03ca9dde50797fce128771b121d2c826b1418ef7d72df1f21109d44ac421813
	//	
	//	
	
	// тестовые пароли
	КлиентИД = 836;                                                    
	//НашКлючАдмин ="ee2add01c9436f523932a3da4e5af0b9d890515a67af1aa18df22327d020f0f2"; //тест
	
	//рабочий
	//НашКлючАдмин = "c03ca9dde50797fce128771b121d2c826b1418ef7d72df1f21109d44ac421813";
	НашКлючАдмин = "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJhY2Nlc3NJRCI6IjAwMmRiM2RiLWQ5ZjQtNDg3MS1iNmZiLTg4NDNiNWRjMDYxOSJ9.VZkFemOFmBKpu1jV69GRMtCXjGftP-hruVLvNd1AZyY";
	
	Лимит = 10;
	
	ИмяВыходногоФайла = ПолучитьИмяВременногоФайла(".json");
	#если клиент тогда
		сообщить(ИмяВыходногоФайла);
	# конецесли
	//ДатаНачала =Формат(НачалоДня(Дата1),"ДФ=""гггг-ММ-дд""");
	//ДатаКонца = Формат(КонецДня(Дата2),"ДФ=""гггг-ММ-дд""");
	
	//АдресТ = "suppliers-orders-test.wildberries.ru"	; // тестовый сервер   https://wbxgate.wildberries.ru/stocks
	//АдресТ = "wbxgate-test.wildberries.ru" ;       ///stocks
	//АдресТ = "suppliers-orders.wildberries.ru";   // https://wbxgate.wildberries.ru/stocks     suppliers-orders.wildberries.ru
	
	АдресТ =  "marketplace-api.wildberries.ru" ;
	
	попытка                          
		Соединение = Новый HTTPСоединение(АдресТ,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);  
	исключение
		
		//Сообщить(ОписаниеОшибки());
	конецПопытки;
	//"/api/v1/orders?date_start=2020-03-23T14:58:33.102-08:00"
	
	
	HTTP_запрос = новый HTTPзапрос();
	
	HTTP_запрос.АдресРесурса = "/api/v2/orders";//?date_start=2020-03-23T14:58:33.102-08:00";   //stocks  ???
	
	ЗаголовокHTTP = Новый Соответствие();               
	ЗаголовокHTTP.Вставить("Content-Type", "application/json");
	ЗаголовокHTTP.Вставить("Accept", "text/xml");
	ЗаголовокHTTP.Вставить("Accept-Language", "ru");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("Content-Language", "ru");
	ЗаголовокHTTP.Вставить("Content-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("Host", АдресТ);
	ЗаголовокHTTP.Вставить("Server", АдресТ);
	ЗаголовокHTTP.Вставить("X-Auth-Token", НашКлючАдмин );
	ЗаголовокHTTP.Вставить("Token", НашКлючАдмин );
	ЗаголовокHTTP.Вставить("Authorization", НашКлючАдмин );
	
	
	//ЗаголовокHTTP.Вставить("X-Auth-Token","eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJhY2Nlc3NJRCI6IjAwMmRiM2RiLWQ5ZjQtNDg3MS1iNmZiLTg4NDNiNWRjMDYxOSJ9.VZkFemOFmBKpu1jV69GRMtCXjGftP-hruVLvNd1AZyY"); 
	
	//	ЗаголовокHTTP.Вставить("supplierVendorCode",);
	//  ЗаголовокHTTP.Вставить("Host", АдресТ); 
	//	ЗаголовокHTTP.Вставить("X-Auth-Token", НашКлючАдмин );	
	
	HTTP_запрос.Заголовки = ЗаголовокHTTP;
	
	//HTTP_запрос.УстановитьТелоИзСтроки(ТелоДЖ,,ИспользованиеByteOrderMark.НеИспользовать);
	//ТелоДж = "C:\Users\nechaeva\Desktop\вб\v8_3930_16.json";
	HTTP_запрос.УстановитьИмяФайлаТела(ТелоДЖ);
	
	//Ответ2 = Соединение.ВызватьHTTPМетод("PUT",HTTP_запрос);
	//	[
	//  {
	//    "orderId": "string",
	//    "status": 2
	//  }
	//]
	
	Попытка
		//Отправляем для обрааботки на наш сервер
		Ответ = Соединение.Записать(HTTP_запрос); //,ИмяВыходногоФайла);// Соединение.Получить(HTTP_запрос);  // ИмяВыходногоФайла
		
	Исключение
		#Если клиент Тогда
			Сообщить(ОписаниеОшибки());
		#КонецЕсли   
	КонецПопытки;
	//	ответ.ПолучитьИмяФайлаТела()
	//Соединение.ОтправитьДляОбработки(HTTP_запрос,ИмяВыходногоФайла);
	//Сообщить(ИмяВыходногоФайла);
	Если Ответ.КодСостояния<>200 тогда
		//КритическиеОшибкиОзон2.Добавить("Заказ "+телодж+" не проведен и не сброшен на склад!");
		//	КритическиеОшибкиОзон2.Добавить(""+ОписаниеОшибки());
		//ЗаписатьВЛог("ОшибкиЕкод","Заказ "+телодж+" не проведен и не сброшен на склад !2","Информация");
		//р2=ответ.ПолучитьТелоКакСтроку();
		//КритическиеОшибкиОзон2.Добавить(р2);
		
		//СообщитьКритОшибки();
		//КритическиеОшибкиОзон2.очистить();
		
	КонецЕсли;	
	#если клиент тогда
		
		Сообщить(Ответ.КодСостояния);
	# конецесли
	возврат Ответ;
	
	//--------------------------------------------------------------------------------------------------------------------------------
	
	
КонецФункции

//------------------------------------------------------------------
Процедура ОтправитьСтрокуЗаказа(Данные)
	
	
	ИмяВыходногоФайлаДЖ = ПолучитьИмяВременногоФайла(".JSON");
	
	команда=""; 	
	//
	Запись = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( ,Символы.Таб);
	Запись.ОткрытьФайл(ИмяВыходногоФайлаДЖ,,,ПараметрыЗаписиJSON);
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением; //ЛокальнаяДата;      "2020-10-31T21:00:00Z",
	
	
	Попытка
		ЗаписатьJSON(Запись, Данные, НастройкиСериализации);
		Запись.Закрыть();
	Исключение
		//сообщить(ОписаниеОшибки());
		
	КонецПопытки;;  
	
	
	//возврат;
	
	// выполнение пост запроса.
	//-------------------------------
	Результат = PUT_Запрос(Команда,ИмяВыходногоФайлаДЖ) ;    // ИмяВыходногоФайла?
	
	Если Результат.КодСостояния = 500 тогда
		
		Результат = PUT_Запрос(Команда,ИмяВыходногоФайлаДЖ) ; 
		
	КонецЕсли;
	
	///--------------------------------------
	Если Результат.КодСостояния = 500 тогда
		
		Результат = PUT_Запрос(Команда,ИмяВыходногоФайлаДЖ) ; 
		
	КонецЕсли;
	
	///--------------------------------------
	Если Результат.КодСостояния = 500 тогда
		
		Результат = PUT_Запрос(Команда,ИмяВыходногоФайлаДЖ) ; 
		
	КонецЕсли;
	
	
	///--------------------------------------
	Если Результат.КодСостояния = 500 тогда
		
		Результат = PUT_Запрос(Команда,ИмяВыходногоФайлаДЖ) ; 
		
	КонецЕсли;
	
	///--------------------------------------
	Если Результат.КодСостояния = 500 тогда
		
		Результат = PUT_Запрос(Команда,ИмяВыходногоФайлаДЖ) ; 
		
	КонецЕсли;
	
	
	///--------------------------------------
	Если Результат.КодСостояния = 500 тогда
		
		Результат = PUT_Запрос(Команда,ИмяВыходногоФайлаДЖ) ; 
		
	КонецЕсли;
	
	
	
	
	
	
	//-------------------------------
	р2=Результат.ПолучитьТелоКакСтроку();
	ИмяВыхОтвет=результат.ПолучитьИмяФайлаТела();
	//Сообщить(ИмяВыхОтвет);
	
	// можно отсюда обрабатывать
	Текст = Новый ТекстовыйДокумент;
	Текст.УстановитьТекст(Результат.ПолучитьТелоКакСтроку());
	#если клиент тогда
		
		сообщить(р2);
	#конецЕсли
	
КонецПроцедуры	

// переводим на сборку заказы
Процедура СобратьЗаказы(Накладная)
	
	
	//	возврат;
	
	// приняли заказ
	// смена статуса заказа  тут на 1 , на 2 при смене на рГ статуса заказа.
	// данные по товарам, пока временно 2 вида товаров только добавила для тестов
	
	ТЗ1 = Новый ТаблицаЗначений;
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказКлиентаFBSТовары.РИД КАК РИД,
	|	ЗаказКлиентаFBSТовары.ШтрихКод КАК ШтрихКод,
	|	ЗаказКлиентаFBSТовары.НомерЗаказа КАК НомерЗаказа,
	|	ЗаказКлиентаFBSТовары.Количество КАК Количество,
	|	ЗаказКлиентаFBSТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаFBSТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказКлиентаFBS.Товары КАК ЗаказКлиентаFBSТовары
	|ГДЕ
	|	ЗаказКлиентаFBSТовары.Ссылка.ДокОснование = &текдок";
	
	
	запрос.УстановитьПараметр("ТекДок",Накладная.ссылка);
	тз1 =Запрос.Выполнить().Выгрузить();
	
	
	текстр=1;
	Для каждого Текстрока из  тз1 цикл
		// получим данные из регистра;
		
		РИд = Текстрока.РИд;
		Ордер = Текстрока.НомерЗаказа;
		
		СтрПРо= Новый ТаблицаЗначений;
		СтрПРо.Колонки.Добавить("orderId");
		СтрПРо.Колонки.Добавить("status");
		
		НовСт = стрпро.Добавить();
		НовСт.orderId= ордер;            //  артикул вайлдберриз   код производителя у нас
		НовСт.status= 2;          // массив с размерами цветами	   // 2 - в состоянии рг отправляем
		
		//
		//Данные1 = новый массив;
		//данные1.Добавить(СтрПРо);
		
		ОтправитьСтрокуЗаказа(ТабЗначВМассив(СтрПро));
		
		//данные.Очистить();
		текстр=текстр+1;
	конецЦикла;
	
	
	
	
	
	//	новые
	//	[
	//  {
	//    "orderId": "string",
	//    "status": 2
	//  }
	//]
	//	
	//	
	
	
	
	
	возврат;
	
	
КонецПроцедуры
//Нечаева 15,02,20 ---

//нечаева 10,11,21----
//---------------------------------------------------------------------------------------------------------------


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.      
	
	ДополнительныеСвойства.Вставить("Начало", ТекущаяУниверсальнаяДатаВМиллисекундах());
	//+++Чирков Д.С. 30.03.2026 MARK-3532 Удалять коды из оперативного регистра при пометке на удаление РНК
	Если НЕ ЭтоНовый() Тогда
		ДополнительныеСвойства.Вставить("БылаПометкаУдаления", ПолучитьРеквизитШапки(Ссылка, "ПометкаУдаления"));
	КонецЕсли;	               
	//+++Чирков Д.С. 30.03.2026
	
	ТекущееПодразделение=ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла(); 
	
	если Валюта=Справочники.Валюты.ПустаяСсылка() тогда
		Валюта=Справочники.Валюты.НайтиПоКоду("810");
	КонецЕсли;
	
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;	
	если  ПростоЗаписать=Истина тогда Возврат конецЕсли;
	
	ТипУзла=ПараметрыСеанса.ТипУзла;
	
	#Если КЛИЕНТ Тогда
		
		Если НЕ ОбменДанными.Загрузка Тогда	
			Если ЭтоНовый() ИЛИ НЕ ЗначениеЗаполнено(ПравилаАгрегацииЧестногоЗнака) Тогда	
				ПравилаАгрегацииЧестногоЗнака = ПолучитьРеквизитШапки(ПунктДоставки, "ПравилаАгрегацииЧестногоЗнака", "Справочник");
				Если НЕ ЗначениеЗаполнено(ПравилаАгрегацииЧестногоЗнака) Тогда
					ПравилаАгрегацииЧестногоЗнака = ПолучитьРеквизитШапки(Контрагент, "ПравилаАгрегацииЧестногоЗнака", "Справочник");
				КонецЕсли;
			КонецЕсли; 	
			
			// упд только в офисе формируются
			Если  ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда			 
				
				// ищем упд, если еще нет, то генерируем.
				Если СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена и МеждуСвоимиОрганизациями Тогда
					
					УПД = Неопределено;
					УПД = УПДНакладной(Ссылка,Организация);
					//Если БелаяСФ Тогда
					попытка
						Если УПД.Пустая() Тогда
							
							УПД_Объект=Документы.УПД.СоздатьДокумент();				
							
							ЗаполнитьШапкуДокумента(УПД_Объект,ПараметрыСеанса.Пользователь,ПараметрыСеанса.ВалютаНац, "Продажа");				
							УПД_Объект.Заполнить(Ссылка);
							УПД_Объект.Организация=Организация;
							УПД_Объект.Дата=ДатаОтгрузки;			
							
							УстановитьНомерДокумента(УПД_Объект);				
							
							УПД_Объект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
							
							УПД=УПД_Объект.Ссылка;
							
						КонецЕсли;		
					исключение
						ЗаписатьВЛог("ЗаписьСФвОП"," Ошибка записи для РНК - "+Номер+" "+Дата+ОписаниеОшибки(),"Важное");		
					конецПопытки;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
	#КонецЕсли	
	
	если МеждуСвоимиОрганизациями тогда Возврат КонецЕсли;
	
	//крохин начало 08.04.2021
	//новых контрагентов может не быть в базе
	КодКонтрагента="";
	КодРодителяКонтрагента="";
	ВыгружатьЭлектронныеДокументы=Ложь;
	ФормироватьСФприОП=Ложь;
	КодИЛН="";
	ПунктДоставкиКод = "";    
	КодВторичногоКонтрагентаДляB2BИзКонтрагента="";
	//крохин конец 08.04.2021
	
	// Кухарь А.Ю.  23.05.2024 начало
	//
	ВозможнаРаботаСМаркировкой=ложь;
	// Кухарь А.Ю.  23.05.2024 конец
	
	
	// Кухарь А.Ю.  15.11.2023 начало
	СкладКомиссияИзПД=Справочники.Склады.ПустаяСсылка();
	ДоговорКомиссияИзПД=Справочники.Договоры.ПустаяСсылка();
	// Кухарь А.Ю.  15.11.2023 конец
	
	// Кухарь А.Ю.  11.09.2024 начало
	ВыделятьМаркированныйТовар=ложь; 
	// Кухарь А.Ю.  11.09.2024 конец
	
	// 
	Запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ
	|	Контрагенты.Код КАК Код,
	|	Контрагенты.Родитель.Код КАК РодительКод,
	|	Контрагенты.ВыгружатьЭлектронныеДокументы КАК ВыгружатьЭлектронныеДокументы,
	|	Контрагенты.ФормироватьСФприОП КАК ФормироватьСФприОП,
	|	Контрагенты.КодИЛН КАК КодИЛН,
	|	Контрагенты.КодВторичногоКонтрагентаДляB2B КАК КодВторичногоКонтрагентаДляB2B,
	|	Контрагенты.РаботаСМаркированнымТоваромПодтверждена КАК ВозможнаРаботаСМаркировкой,
	|	Контрагенты.ВыделятьМаркированныйТовар КАК ВыделятьМаркированныйТовар
	
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Ссылка";
	запрос.УстановитьПараметр("Ссылка",Контрагент);
	ДанныеКонтрагента=запрос.Выполнить().Выбрать();
	пока ДанныеКонтрагента.Следующий() цикл
		КодКонтрагента=ДанныеКонтрагента.Код;
		КодРодителяКонтрагента=ДанныеКонтрагента.РодительКод;
		ВыгружатьЭлектронныеДокументы=ДанныеКонтрагента.ВыгружатьЭлектронныеДокументы;
		ФормироватьСФприОП=ДанныеКонтрагента.ФормироватьСФприОП;
		КодИЛН=ДанныеКонтрагента.КодИЛН;
		КодВторичногоКонтрагентаДляB2BИзКонтрагента=ДанныеКонтрагента.КодВторичногоКонтрагентаДляB2B; 
		ВозможнаРаботаСМаркировкой = ДанныеКонтрагента.ВозможнаРаботаСМаркировкой;
		если не ЭтоНовый() тогда
			ДопПараметрыНакладной= ОбщегоНазначения_ПИ.ПолучитьДопПараметрыНакладной(Ссылка);
			// Кухарь А.Ю. 20.03.2025 начало
			//если ДопПараметрыНакладной.Имя="WB_FBO" и КодОперации=Перечисления.КодыОперацийОстатки.Реализация тогда
			если (ДопПараметрыНакладной.Имя="WB_FBO" или ДопПараметрыНакладной.Имя="OZON_FBO") и КодОперации=Перечисления.КодыОперацийОстатки.Реализация тогда				
				// Кухарь А.Ю. 20.03.2025 конец
				ВозможнаРаботаСМаркировкой = ложь;			
			КонецЕсли;
		КонецЕсли;
		
		ВыделятьМаркированныйТовар=ДанныеКонтрагента.ВыделятьМаркированныйТовар; 
		
	КонецЦикла;
	
	если ЭтоНовый() тогда
		если КодОперации=Перечисления.КодыОперацийОстатки.ПустаяСсылка() тогда
			КодОперации=Перечисления.КодыОперацийОстатки.Реализация;
		КонецЕсли;
	КонецЕсли;
	
	
	запрос.Текст= "ВЫБРАТЬ
	|	ПунктыДоставки.Ссылка КАК Ссылка,
	|	ПунктыДоставки.Код КАК Код,
	|	ПунктыДоставки.СкладКомиссия КАК СкладКомиссия,
	|	ПунктыДоставки.ДоговорКомиссия КАК ДоговорКомиссия
	|ИЗ
	|	Справочник.ПунктыДоставки КАК ПунктыДоставки
	|ГДЕ
	|	ПунктыДоставки.Ссылка = &Ссылка";
	запрос.УстановитьПараметр("Ссылка",ПунктДоставки);
	ДанныеПунктаДоставки=запрос.Выполнить().Выбрать();
	пока ДанныеПунктаДоставки.Следующий() цикл
		ПунктДоставкиКод = ДанныеПунктаДоставки.код; 
		СкладКомиссияИзПД= ДанныеПунктаДоставки.СкладКомиссия;
		ДоговорКомиссияИзПД = ДанныеПунктаДоставки.ДоговорКомиссия;	
	КонецЦикла;
	
	если СкладКомиссия=Справочники.Склады.ПустаяСсылка() и СкладКомиссияИзПД<>СкладКомиссия  тогда
		СкладКомиссия=СкладКомиссияИзПД;
	КонецЕсли;
	
	если ДоговорКомиссия=Справочники.Договоры.ПустаяСсылка() и ДоговорКомиссияИзПД<>ДоговорКомиссия  тогда
		ДоговорКомиссия=ДоговорКомиссияИзПД;
	КонецЕсли;	 
	
	ТипУзла=ПараметрыСеанса.ТипУзла;
	
	//Кухарь 10.12.15 начало
	//Запрет создание документов по виртуальным складам в ЦО
	Если Склад.ВидСклада=Перечисления.ВидСклада.ВиртуальныйДляСклада и ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
		#Если клиент тогда
			Сообщить("В ЦО запрещено создание документов по виртуальным складам");
		#КонецЕсли
		Отказ=Истина;
	КонецЕсли;
	//Кухарь 10.12.15 конец
	
	//Кухарь 16.02.18 начало
	//Запретим ставить РГ в перекрёстках без паллет.
	если не ОбменДанными.Загрузка и ТипУзла=Перечисления.ТипУзлаИБ.Склад тогда
		
		// Кухарь А.Ю. 26.03.2021 начало
		//		если Контрагент.Родитель.Код="SSR-4117" тогда //Х5 Retail Group
		если КодРодителяКонтрагента="SSR-4117" тогда
			// Кухарь А.Ю. 26.03.2021 конец		
			если СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке и КоличествоПаллет=0 тогда
				#Если клиент тогда
					Сообщить("Запрещено ставить в РГ накладные этого клиента с нулевым количеством паллет.");
				#КонецЕсли
				ЗаписатьВЛог("Ошибка","Пытались поставить в РГ накладные по Х5 Retail Group c 0 паллет "+Номер,"Информация");
				отказ=Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	//Кухарь 16.02.18 конец
	
	#Если КЛИЕНТ Тогда
		Если ТипУзла=Перечисления.ТипУзлаИБ.Склад Тогда
			Если СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке Тогда
				Попытка
					ЗаполнитьТЧРасходныхМатериалов(ЭтотОбъект);
				Исключение
				КонецПопытки;		
			КонецЕсли;
			
			СписокДоступныхСостояний=Неопределено;
			
			если СписокДоступныхСостояний <> Неопределено тогда
				если СписокДоступныхСостояний.найти(ЭтотОбъект.Ссылка.получитьобъект().состояниенакладной) = Неопределено и ЭтотОбъект.Ссылка.получитьобъект().состояниенакладной<> Перечисления.СостоянияНакладной.Отгружена тогда
					Сообщить("Накладная заблокирована для изменений документом: Блокировка выдачи в набор");
					отказ=Истина;
				ИначеЕсли 	СписокДоступныхСостояний.найти(ЭтотОбъект.состояниенакладной) = Неопределено и ЭтотОбъект.состояниенакладной<> Перечисления.СостоянияНакладной.Отгружена тогда
					Сообщить("Накладную нельзя записать в текущем статусе. Данный статус накладной запрещён документом: Блокировка выдачи в набор");
					отказ=Истина;
				КонецЕсли;
			КонецЕсли;
			//кухарь 23.04.14 конец			
		КонецЕсли;
		//Кухарь 26.03.17 конец		
		
		
		Если
			(ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение  ИЛИ ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение)
			И Отгружен=Перечисления.Отгружен.Резерв 
			И СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе 		
			И РежимЗаписи=РежимЗаписиДокумента.Проведение
			И Дата<ТекущаяДата()		
			И НеКонтролироватьТА=Ложь 
			И НЕ ПараметрыСеанса.ОтключитьКонтрольРезервов
			Тогда
			если не ПараметрыСеанса.ЗапущенаОбработка тогда
				Ответ=Вопрос("Резервные накладные корректируются только на текущую дату ! Изменить дату на текущую ?",РежимДиалогаВопрос.ОКОтмена,10);				
				Если Ответ=КодВозвратаДиалога.ОК Тогда
					мТекущаяДатаДокумента = Дата;
					Дата					=ТекущаяДата();
					Если ПроверитьНомерДокумента(ЭтотОбъект, мТекущаяДатаДокумента) Тогда		
						мТекущаяДатаДокумента	=Дата;			
					Иначе		
						Дата					=мТекущаяДатаДокумента;
					КонецЕсли;
					//крохин конец 08.01.2019
				Иначе
					//Кухарь 04.12.18 начало
					//Поставим через 10 сек. закрытие вопроса
					Сообщить("Истёк таймаут вопроса на смену даты.");
					//Кухарь 04.12.18 конец	
					
					Отказ=Истина;					
					Возврат;		
				КонецЕсли; 
				//кухарь 05.09.14 начало
				//убираем лишние вопросы при изменении РНК обработкой	
			иначе
				Дата=ТекущаяДата();
			КонецЕсли;
			//кухарь 05.09.14 конец 
		КонецЕсли;
		
		//Кухарь 11.07.19 перенёс комментарии *1 		
		
		//крохин начало 31.03.2011
		//запретим проводить будущим числом из формы
		Если  НЕ ОбменДанными.Загрузка Тогда
			Если КонецДня(Дата) > КонецДня(ТекущаяДата()) И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				Сообщить("Невозможно проведение будущей датой");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		//крохин конец 31.03.2011
		
		// Кухарь А.Ю. 15.03.2024 начало
		Если СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена и Модифицированность()  тогда
			если ПолучитьРеквизитШапки(Договор,"РезультатПроверкиСБ.ЗапретОтгрузки","Справочник")= Истина тогда
				Сообщить("Службой безопасности запрещена отгрузка по договору накладной "+Номер);
				Отказ=Истина;		
			КонецЕсли;
		КонецЕсли;
		// Кухарь А.Ю. 15.03.2024 конец
		
		
	#КОНЕЦЕСЛИ
	
	// Ихсанов Д. А. Начало 18.11.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-7714
	Если ОтгрузкаЗаказовПоЮрЛицу Тогда
		ТребуетсяМаркировкаПриоритет = Истина;
	КонецЕсли;
	// Ихсанов Д. А. Конец 18.11.2025
	
	
	// Кухарь А.Ю.  30.03.2026 начало     
	//SNL-179
	// НачРеквизиты= ПолучитьРеквизитыШапки(Ссылка,Новый Структура("СостояниеНакладной,Дата,Проведен"),"Документ"); 
	НачРеквизиты = ПолучитьРеквизитыШапки(Ссылка,Новый Структура("СостояниеНакладной,Дата,Проведен,Отгружен"),"Документ");   
	НачОтгружен  = НачРеквизиты.Отгружен;
	// Кухарь А.Ю.  30.03.2026 конец       
	
	НачСостНакладной	=НачРеквизиты.СостояниеНакладной; 
	НачДата				=НачРеквизиты.дата;	
	НачПроведен			=НачРеквизиты.Проведен;	
	
	Если ТребуетсяМаркировкаПриоритет
		И Не ТребуетсяМаркировка Тогда
		ТребуетсяМаркировка = Истина; 		
	КонецЕсли;              
	
	
	// Кухарь А.Ю.  30.03.2026 начало
	//SNL-179 
	если НачОтгружен <> Перечисления.Отгружен.Отгружен и Отгружен = Перечисления.Отгружен.Отгружен тогда  
		КоличествоСекундЗапретаОтНачалаДня = 300;          
		//Кухарь А.Ю.  11.06.2026 начало
		//ИЗМ 0000000186	
		если ДатаОтгрузки = ПустаяДата() тогда	 
			//Кухарь А.Ю.   11.06.2026 конец
			
			если НачалоДня(Дата)<>НачалоДня(ТекущаяДатаСеанса()) тогда //Разные дни
				Дата = НачалоДня(ТекущаяДатаСеанса())+КоличествоСекундЗапретаОтНачалаДня; 	
			Иначе
				если НачалоДня(ТекущаяДатаСеанса())+КоличествоСекундЗапретаОтНачалаДня > Дата  тогда // Дата документа раньше 5 минут от начала дня
					если НачалоДня(ТекущаяДатаСеанса())+КоличествоСекундЗапретаОтНачалаДня < ТекущаяДатаСеанса() тогда //5 минут с начала дня прошло
						Дата = НачалоДня(ТекущаяДатаСеанса())+КоличествоСекундЗапретаОтНачалаДня;
					иначе    
						ОкончаниеПериодаСтрокой = Прав(Строка( НачалоДня(ТекущаяДатаСеанса())+КоличествоСекундЗапретаОтНачалаДня),8);
						ВызватьИсключение "В период времени между 00:00:00 и "+ОкончаниеПериодаСтрокой+" запись отгрузки накладной - запрещена. Нужно немного подождать."; 
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;   
			//Кухарь А.Ю.  11.06.2026 начало
			//ИЗМ 0000000186
		Иначе    
			Дата = ДатаОтгрузки + КоличествоСекундЗапретаОтНачалаДня;      
			если Дата > ТекущаяДатаСеанса() тогда  
				ВызватьИсключение СтрШаблон("Накладную %1 можно отгрузить не раньше чем в %2",Номер,Дата); 
			КонецЕсли;
		КонецЕсли;	
		//Кухарь А.Ю.   11.06.2026 конец		
	КонецЕсли;
	// Кухарь А.Ю.  30.03.2026 конец
	
	
	Если не ОбменДанными.Загрузка  тогда   
		если не ЭтоНовый() и ТребуетсяМаркировка 						
			и ЭтоУзелОтправителяПоСкладу(Склад)
			и Дата>='20250301'
			тогда	
			если (НачСостНакладной<>Перечисления.СостоянияНакладной.ГотоваКОтгрузке
				и НачСостНакладной<>Перечисления.СостоянияНакладной.Отгружена
				//Валетов + 17,09,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5404
				и НачСостНакладной<>Перечисления.СостоянияНакладной.ОжиданиеОбработкиЧЗ)  
				
				или НачПроведен = ложь
				// Кухарь А.Ю.  13.08.2024 начало
				или не Документы.ХранилищеКодовМаркировки.ПроверитьНаличиеХКМ(Ссылка,Перечисления.ПланФакт.Факт,ТекущееПодразделение) 
				// Кухарь А.Ю.  13.08.2024 конец				
				тогда				
				если (СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке
					//Валетов + 17,09,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5404
					или  СостояниеНакладной=Перечисления.СостоянияНакладной.ОжиданиеОбработкиЧЗ 
					
					или  СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена) 
					//Валетов + 04,12,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8079
					//Добавил проверку чтоб при изменении СостояниеДокументов не перезаполнялись документы ЧЗ 
					И СостояниеДокументов = Ссылка.СостояниеДокументов
					//Валетов -
					тогда
					РезультатРаботыСДокументамиЧЗ=СозданиеДокументовЧЗ();
					если не РезультатРаботыСДокументамиЧЗ тогда
						отказ=Истина;
					КонецЕсли;
				КонецЕсли;
				
			ИначеЕсли НачСостНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке
				или НачСостНакладной=Перечисления.СостоянияНакладной.Отгружена 
				//Валетов + 17,09,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5404
				ИЛИ НачСостНакладной=Перечисления.СостоянияНакладной.ОжиданиеОбработкиЧЗ
				тогда
				
				если СостояниеНакладной<>Перечисления.СостоянияНакладной.ГотоваКОтгрузке 
					и  СостояниеНакладной<>Перечисления.СостоянияНакладной.Отгружена 
					//Валетов + 17,09,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5404
					и  СостояниеНакладной<>Перечисления.СостоянияНакладной.ОжиданиеОбработкиЧЗ
					тогда
					РезультатРаботыСХКМ=Документы.ХранилищеКодовМаркировки.Отменить_ХКМ_к_НАК(Ссылка,Перечисления.ПланФакт.Факт);				 
					если не РезультатРаботыСХКМ.Успешно тогда
						РезультатРаботыСХКМ.Ошибки.Добавить("Не удалось создать хранилище кодов маркировки");
						СообщитьИзМодуля(СтрСоединить(РезультатРаботыСХКМ.Ошибки,","));
						отказ=Истина;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		если СостояниеНакладной<>Перечисления.СостоянияНакладной.Отгружена и СостояниеНакладной<>Перечисления.СостоянияНакладной.ВРаботе 
			и  этотОбъект.СостояниеДокументов <> перечисления.СостояниеДокументов.НеВыписаны
			тогда
			
			Если ЭтотОбъект.СуммаДокумента <> ссылка.СуммаДокумента или ЭтотОбъект.КоличествоДокумента <>ссылка.КоличествоДокумента 
				или  ЭтотОбъект.Контрагент <> ссылка.Контрагент  Тогда				
				этотОбъект.СостояниеДокументов = перечисления.СостояниеДокументов.НеВыписаны;
			конецЕсли;
		КонецЕсли;
		
		если СостояниеНакладной<>Перечисления.СостоянияНакладной.ВРаботе и ПредварительныйЗаказ=Истина тогда 
			ПредварительныйЗаказ=Ложь;
		КонецЕсли;
		
		//++Данилова Е.В. 24.03.2026 ASU-2089 
		Если СостояниеНакладной = Перечисления.СостоянияНакладной.ВРаботе 
			И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			
			РезультатПроверкиАссортито = ПроверитьКомплектующиеАссортито();
			
			Если  НЕ РезультатПроверкиАссортито.Успешно Тогда
				
				Отказ = Истина;
				
				МаркировкаКС.ВывестиОшибки(РезультатПроверкиАссортито); 
				
			КонецЕсли;
			
		КонецЕсли;
		//--Данилова Е.В. 24.03.2026
	КонецЕсли;	
	//Нечаева 220622 ---
	
	если не ЭтоНовый() и ТипУзла=Перечисления.ТипУзлаИБ.Склад и не ОбменДанными.Загрузка тогда 
		СЗ=новый СписокЗначений;
		СЗ.Добавить(Перечисления.СостоянияНакладной.ОжиданиеПаллетирования);
		СЗ.Добавить(Перечисления.СостоянияНакладной.ОжиданиеТермоусадки);
		СЗ.Добавить(Перечисления.СостоянияНакладной.Паллетирование);
		СЗ.Добавить(Перечисления.СостоянияНакладной.Термоусадка);
		// Кухарь А.Ю.  15.10.2025 начало   
		// HELP-5404 Кухарь
		СЗ.Добавить(Перечисления.СостоянияНакладной.ОжиданиеОбработкиЧЗ);	
		// Кухарь А.Ю.  15.10.2025 конец
		
		СЗ.Добавить(Перечисления.СостоянияНакладной.ГотоваКОтгрузке);
		СЗ.Добавить(Перечисления.СостоянияНакладной.ОтгруженаНаТранзитныйСклад);
		СЗ.Добавить(Перечисления.СостоянияНакладной.Отгружена);
		СтрНач=сз.НайтиПоЗначению(НачСостНакладной);
		СтрКон=СЗ.НайтиПоЗначению(СостояниеНакладной);
		если СтрНач<>Неопределено тогда
			ИндНач=сз.Индекс(СтрНач);
			если СтрКон=Неопределено тогда 
				ИндКон=0;
			иначе
				ИндКон=сз.Индекс(СтрКон);
			КонецЕсли;
			Если ИндНач>ИндКон тогда
				если не ПолучитьПолномочиеПользователя("ВозвращатьНакладныеВПредыдущиеСостояния") тогда  //Потом нужно будет создать отдельное состояние.
					отказ=Истина;
					#Если КЛИЕНТ Тогда
						Сообщить("Недостаточно прав для возврата к предыдущему состоянию. Обратитесь к администратору.");
					#КонецЕсли
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	Если ЭтоНовый() И Организация.Пустая() И НЕ Склад.Пустая() И НЕ Склад.Организация.Пустая() Тогда
		Организация=Склад.Организация;	
	КонецЕсли;
	
	ЕстьИзменения		=Модифицированность();	
	НужноВыгружать		=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);   
	
	//Кухарь А.Ю. 11.09.2025 начало
	если СостояниеНакладной = Перечисления.СостоянияНакладной.ВРаботе тогда
		если ЕстьИзменения тогда 
			если не ОтгрузкаКомплектов тогда    
				Комплектующие.Очистить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Кухарь А.Ю. 11.09.2025 конец
	
	//крохин начало 15.02.2013
	//при изменении состояния документа не выгружаем его
	Если НеВыгружатьДокумент Тогда
		НужноВыгружать = Ложь;
		ЕстьИзменения = Ложь;
	КонецЕсли;
	
	//Феданченков М.С. 09.06.2026 начало
	//наряд 0000000951
	если ЭтоНовый() тогда
		
		ЗапВРег=РегистрыСведений.РеквизитыСправочников.СоздатьНаборЗаписей();	
		ЗапВРег.Отбор.ИмяРеквизита.значение="НужноПаллетирование";
		ЗапВРег.Отбор.Справочник.значение=Контрагент;
		ЗапВРег.Отбор.ИмяРеквизита.использование=Истина;
		ЗапВРег.Отбор.Справочник.использование=Истина;			
		ЗапВРег.Прочитать();
		для каждого СтрЗР из ЗапВРег цикл
			НужноПаллетирование=СтрЗР.ЗначениеРеквизита;
		КонецЦикла;		
		
		//Кухарь 19.12.18 начало
		//Из пунктов доставки тоже нужно брать
		ЗапВРег=РегистрыСведений.РеквизитыСправочников.СоздатьНаборЗаписей();	
		ЗапВРег.Отбор.ИмяРеквизита.значение="НужноПаллетирование";
		ЗапВРег.Отбор.Справочник.значение=ПунктДоставки;
		ЗапВРег.Отбор.ИмяРеквизита.использование=Истина;
		ЗапВРег.Отбор.Справочник.использование=Истина;			
		ЗапВРег.Прочитать();
		для каждого СтрЗР из ЗапВРег цикл
			НужноПаллетирование=СтрЗР.ЗначениеРеквизита;
		КонецЦикла;	
		
		если не НужноПаллетирование тогда
			ЗапВРег=РегистрыСведений.РеквизитыСправочников.СоздатьНаборЗаписей();	
			ЗапВРег.Отбор.ИмяРеквизита.значение="НужнаТермоусадка";
			ЗапВРег.Отбор.Справочник.значение=Контрагент;
			ЗапВРег.Отбор.ИмяРеквизита.использование=Истина;
			ЗапВРег.Отбор.Справочник.использование=Истина;			
			ЗапВРег.Прочитать();
			для каждого СтрЗР из ЗапВРег цикл
				НужнаТермоусадка=СтрЗР.ЗначениеРеквизита;
			КонецЦикла;			
			
			ЗапВРег=РегистрыСведений.РеквизитыСправочников.СоздатьНаборЗаписей();	
			ЗапВРег.Отбор.ИмяРеквизита.значение="НужнаТермоусадка";
			ЗапВРег.Отбор.Справочник.значение=ПунктДоставки;
			ЗапВРег.Отбор.ИмяРеквизита.использование=Истина;
			ЗапВРег.Отбор.Справочник.использование=Истина;			
			ЗапВРег.Прочитать();
			для каждого СтрЗР из ЗапВРег цикл
				НужнаТермоусадка=СтрЗР.ЗначениеРеквизита;
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	//Феданченков М.С. 09.06.2026 конец
	 
	Если НЕ ОбменДанными.Загрузка Тогда		
		Если НеКонтролироватьЗапись Тогда
		Иначе
			КонтрольДатыЗапрета(ЭтотОбъект,Отказ);			
			МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
			МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		КонецЕсли;		
		
		Если Отказ Тогда Возврат КонецЕсли; 
		
		если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.Склад тогда
			если РежимЗаписи=РежимЗаписиДокумента.Проведение тогда
				если СостояниеНакладной=Перечисления.СостоянияНакладной.ПолученоСкладом тогда
					Дата=ТекущаяДата();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если НачСостНакладной<>Перечисления.СостоянияНакладной.ВРаботе И ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение И ЕстьИзменения Тогда
			ЗаписатьВЛог("Изм. отпр. накл.",""+Номер+" "+Дата,"Важное");		
		КонецЕсли;	
		
		Если ЕстьИзменения Тогда //Чирков - 03.10.12 - не фига это все пересчитывать при загрузке 			
			ГруппыТоваров		= ГруппыТоваровДокумента(ЭтотОбъект);
			если СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе тогда
				СекторХранения = СекторХраненияДокумента(ЭтотОбъект);
			КонецЕсли;
			
			ДопОбработка=Ложь;		
			Для Каждого СтрокаТЧ Из ДопОбработки Цикл
				Если СтрокаТЧ.ВидДопОбработки<>Справочники.ВидыДопОбработки.БезОбработки Тогда
					ДопОбработка=Истина;
					Прервать;
				КонецЕсли;					
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	
	//Нечаева 06,02,17 +++
	#Если КЛИЕНТ Тогда
		
		Если НЕ ОбменДанными.Загрузка Тогда		
			Если  (ТипУзла=Перечисления.ТипУзлаИБ.Склад или ТипУзла=Перечисления.ТипУзлаИБ.Филиал) И ФормироватьСФприОП Тогда			 
				Если КодОперации <> Перечисления.КодыОперацийОстатки.Комиссия ТОгда
					Если СостояниеНакладной = Перечисления.СостоянияНакладной.ОжиданиеПаллетирования Или
						СостояниеНакладной = Перечисления.СостоянияНакладной.ГотоваКОтгрузке Тогда
						
						БелаяСФ =Истина;
						
						Если ВидОплаты = Перечисления.ВидыОплаты.НАЛ Тогда
							БелаяСФ = Ложь;			
						КонецЕсли;
						
						Если СуммаДокумента = 0 Тогда
							БелаяСФ = Ложь;			
						КонецЕсли;
						
						
						СФ=Неопределено;
						СФ=СчетФактураНакладной(Ссылка,Организация);
						Если БелаяСФ Тогда
							попытка
								Если СФ.Пустая() Тогда
									
									СФ_Объект=Документы.СчетФактура.СоздатьДокумент();				
									
									ЗаполнитьШапкуДокумента(СФ_Объект,ПараметрыСеанса.Пользователь,ПараметрыСеанса.ВалютаНац, "Продажа");				
									СФ_Объект.Заполнить(Ссылка);
									СФ_Объект.Организация=Организация;
									СФ_Объект.Дата=ДатаОтгрузки;			
									
									УстановитьНомерДокумента(СФ_Объект);				
									
									СФ_Объект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
									
									СФ=СФ_Объект.Ссылка;
									
								КонецЕсли;		
							исключение
								ЗаписатьВЛог("ЗаписьСФвОП"," Ошибка записи для РНК - "+Номер+" "+Дата+ОписаниеОшибки(),"Важное");		
							конецПопытки;
							
						КонецЕсли;					
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Отгружен = Перечисления.Отгружен.Резерв И НЕ Ссылка.Пустая() И НЕ НеконтролироватьНаличиеСФ И Не ОбменДанными.Загрузка Тогда	
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	СчетФактураНакладные.Ссылка
			|ИЗ
			|	Документ.СчетФактура.Накладные КАК СчетФактураНакладные
			|ГДЕ
			|	СчетФактураНакладные.Ссылка.Проведен
			|	И СчетФактураНакладные.Накладная = &Накладная";
			Запрос.УстановитьПараметр("Накладная",Ссылка);
			Выборка = запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Если НачалоДня(ДатаОтгрузки) > НачалоДня(Выборка.Ссылка.Дата) Тогда
					Предупреждение("Существует счет-фактура с датой, меньшей устанавливаемой. Удалите счет-фактуру перед изменением даты отгрузки");
					Отказ = Истина;
				КонецЕсли;		
			КонецЦикла;
		КонецЕсли;
	#КонецЕсли
	
	ИмяТЧ="Товары";  
	
	
	Если Отгружен = Перечисления.Отгружен.Резерв  тогда
		ТребуетсяМаркировка=МаркировкаКС.ОпределитьЗначениеТребуетсяМаркировкаВДокументе(ЭтотОбъект,Контрагент,ИмяТЧ);			
	КонецЕсли;
	
	если ТипЗнч(ДопПараметрыНакладной)=Тип("Структура") и  ДопПараметрыНакладной.Свойство("Имя") 
		// Кухарь А.Ю. 20.03.2025 начало
		//и ДопПараметрыНакладной.Имя="WB_FBO"
		и (ДопПараметрыНакладной.Имя="WB_FBO" или ДопПараметрыНакладной.Имя="OZON_FBO")
		// Кухарь А.Ю. 20.03.2025 конец		
		и КодОперации=Перечисления.КодыОперацийОстатки.Реализация тогда 
		ЭтоВыкупДляПродажиВСНГ=Истина;
		ТребуетсяМаркировка = ложь;
	иначе
		ЭтоВыкупДляПродажиВСНГ=Ложь;
	КонецЕсли;
	
	// Кухарь А.Ю.  24.09.2024 конец
	
	
	Если ЕстьИзменения Тогда //Чирков - 25.10.12 - не трогать !!!
		СуммаДокумента		= Товары.Итог("Всего");
		ОбъемДокумента		= Товары.Итог("Объем");
		КоличествоДокумента = Товары.Итог("Количество");
		
		КоличествоКомплектующих=Товары.Итог("КоличествоКомплектующих");
		если КоличествоКомплектующих< КоличествоДокумента тогда
			Для каждого СтрокаТЧ из Товары цикл
				ЗаполнитьКоличествоКомплектующихПоСтроке(СтрокаТЧ);		
			КонецЦикла;
			КоличествоКомплектующих=Товары.Итог("КоличествоКомплектующих");
		КонецЕсли;	 
		
		КоличествоКомплектующихДляСверки=0;
		если Комплектующие.Количество()>0 тогда
			КоличествоКомплектующихДляСверки=Комплектующие.Итог("КоличествоКомплектующих");
			если КоличествоКомплектующихДляСверки=0 тогда
				Для каждого СтрокаТЧ из Комплектующие цикл
					ЗаполнитьКоличествоКомплектующихПоСтроке(СтрокаТЧ);		
				КонецЦикла;			
			КонецЕсли;
		КонецЕсли;
		
		ПроверитьСоответствиеЗаявке(ЭтотОбъект);
		
		
		если не ЭтоНовый() и не ЭтоВыкупДляПродажиВСНГ  	
			и (СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе 
			или СостояниеНакладной=Перечисления.СостоянияНакладной.КОтправкеНаСклад) 
			тогда	
			Запрос.Текст="ВЫБРАТЬ
			|	Товары.Номенклатура КАК Номенклатура
			|ПОМЕСТИТЬ ВремТЗ
			|ИЗ
			|	&Товары КАК Товары
			|ГДЕ
			|	Товары.Количество > 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВремТЗ.Номенклатура.Наименование КАК Наименование
			|ИЗ
			|	ВремТЗ КАК ВремТЗ
			|ГДЕ
			|	 ВремТЗ.Номенклатура.ОтгрузкаТолькоЧерезЧЗ";
			// Кухарь А.Ю. 09.09.2024 начало
			//
			Запрос.УстановитьПараметр("Товары",Товары); 
			// Кухарь А.Ю. 09.09.2024 конец
			
			Выборка=запрос.Выполнить().Выбрать();
			если Выборка.Количество()>0 и не ВозможнаРаботаСМаркировкой тогда
				МассивОшибок=новый Массив;
				Пока Выборка.Следующий() цикл
					МассивОшибок.Добавить(выборка.Наименование);
				КонецЦикла;
				СтрокаОшибок="Обнаружена номенклатура, которую можно отгружать только клиенту, с признаком что работа с маркированным товаром подтверждена. "+СтрСоединить(МассивОшибок,", ");		
				СообщитьИзМодуля(СтрокаОшибок);
				Отказ=Истина;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	Если Дата>=Дата('20100429') и  ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение И ПереданПокупателюВЭлВиде=Ложь  Тогда
		Если ВыгружатьЭлектронныеДокументы Тогда			 
			Если ПереданПокупателюВЭлВиде=Ложь  Тогда //и СостояниеНакладной=перечисления.СостоянияНакладной.Отгружена Тогда //+++	
				ОтказСтолетов=Истина;
				Попытка		
					//.ВнешниеОбработки.Создать(""+Константы.КаталогВнешнихОтчетов.Получить() + "VigruzkaRiglaStoletov.epf");
					Выгрузка = Обработки.ЭлектроннаяВыгрузкаНакладныхПокупателю.Создать();  
					Выгрузка.ДокОбъект=ЭтотОбъект.Ссылка;
					// Кухарь А.Ю. 26.03.2021 начало
					//
					Выгрузка.КодКонтрагента=КодКонтрагента; 
					// Кухарь А.Ю. 26.03.2021 конец
					
					Выгрузка.Сформировать();
					ОтказСтолетов=Выгрузка.Отказ;
				Исключение
					
				КонецПопытки;
				
				Если НЕ ОтказСтолетов ТОгда
					ПереданПокупателюВЭлВиде=Истина;
				КонецЕсли;
				
			КонецЕсли;		
			
		КонецЕсли;
		
	КонецЕсли;
	
	// +++ Родионов, 2011-12-14, заполнение реквизита КоличествоПродукции
	ЭтаНакладнаяУжеОтгружена = Ложь;
	Если (НЕ ЭтоНовый()) И НакладнаяОтгружена() Тогда
		// документ есть в базе и сейчас у объекта статус "Отгружен" => посмотрим какой статус у этого документа в базе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладная.СостояниеНакладной
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			СостояниеНакладнойВБазе = Выборка.СостояниеНакладной;
			ЭтаНакладнаяУжеОтгружена = ((СостояниеНакладнойВБазе = Перечисления.СостоянияНакладной.Отгружена)
			Или (СостояниеНакладнойВБазе = Перечисления.СостоянияНакладной.ОтгруженаНаТранзитныйСклад));
		КонецЕсли;
	КонецЕсли;
	Если НЕ ЭтаНакладнаяУжеОтгружена Тогда
		ЗаполнитьКоличествоПродукции();	
		
		//Нечаева 13,11,2014 +++
		//проверим по кратности продукции и комплектующих
		#если клиент тогда
			
			ТЗКомплектующие = Комплектующие.Выгрузить(, "Продукция, КоличествоПродукции, Количество");
			ТЗКомплектующие.Свернуть("Продукция","КоличествоПродукции, Количество");
			Если  ТЗКомплектующие.Итог("Количество")<ТЗКомплектующие.Итог("КоличествоПродукции") Тогда 
				Отказ = Истина;
				Сообщить("Количество продукции больше, чем комплектующих. Сохранение отменено!", СтатусСообщения.Важное);
			конецЕсли;
			
			Для каждого ТекСтрока из ТЗКомплектующие цикл
				
				если ТекСтрока.количествоПродукции>0 Тогда
					
					Кратность=ТекСтрока.Количество/ТекСтрока.количествоПродукции;
					//сообщить(кратность);
					//Если не целое число
					Если Кратность-Цел(Кратность)>0 или  ТекСтрока.количествоПродукции>ТекСтрока.количество  Тогда 
						Отказ=Истина;
						Сообщить("По продукции "+ТекСтрока.продукция+" не правильное кол-во комплектующих. ", СтатусСообщения.Важное);
					КонецЕсли;
					
					//Кухарь 23.08.18 начало
					//Иногда полностью вычёркивают позицию
					//иначе
				ИначеЕсли  ТекСтрока.количество>0 тогда
					//Кухарь 23.08.18 конец            
					
					Отказ=Истина;
					Сообщить("По продукции "+ТекСтрока.продукция+" не правильное кол-во комплектующих. ", СтатусСообщения.Важное);
				КонецЕсли;	
				
			КонецЦикла;
		#конецесли
		//Нечаева 13,11,2014 ----
		
	КонецЕсли;
	// заполнение реквизита КоличествоПродукции, 2011-12-14, Родионов +++
	
	//крохин начало 16.02.2012
	//заполним дату оформления
	Если ЗначениеНеЗаполнено(ДатаОформления) Тогда
		ДатаОформления = ТекущаяДата();	
	КонецЕсли;
	//крохин конец 16.02.2012
	#Если КЛИЕНТ Тогда
		если дата <> НачДата и не ЭтоНовый() или отгружен=Перечисления.Отгружен.Отгружен  тогда
			если не ПараметрыСеанса.ЗапущенаОбработка  тогда
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				|	ПланНабора.Ссылка
				|ИЗ
				|	Документ.ПланНабора КАК ПланНабора
				
				|ГДЕ
				|	ПланНабора.ДокОснование = &ДокОснование
				|	И ПланНабора.Проведен";
				запрос.УстановитьПараметр("ДокОснование",Ссылка);
				
				Выборка = запрос.Выполнить().Выбрать();
				//крохин начало 02.12.2013
				Если Выборка.Следующий() И Не Ссылка.Пустая() Тогда
					//крохин конец 02.12.2013	
					ПланНабора = Выборка.Ссылка;
					//Если Ложь Тогда
					//	ПланНабора = Документы.ПланНабора.НайтиПоНомеру("");
					//КонецЕсли;
					ДокОбъект = ПланНабора.ПолучитьОбъект();
					Записывать = Ложь;
					//крохин начало 31.10.2013	
					//условия из коды выше + проверка даты плана набора
					Если НачалоДня(Дата) <> НачалоДня(ДокОбъект.Дата) Тогда
						ДокОбъект.Дата = Дата;
						Записывать = Истина;
					КонецЕсли;
					Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.ТорговоеПодразделение И (СостояниеНакладной = Перечисления.СостоянияНакладной.Сканирование ИЛИ СостояниеНакладной = Перечисления.СостоянияНакладной.ГотоваКОтгрузке) Тогда
						//крохин конец 31.10.2013
						Для Каждого СтрокаТЧ Из ДокОбъект.тБрэндов Цикл
							Если НЕ СтрокаТЧ.НаборЗакончен Тогда
								СтрокаТЧ.НаборЗакончен = Истина;
								СтрокаТЧ.ОкончаниеНабора = ТекущаяДата();
								Записывать = Истина;
							КонецЕсли;    													
						КонецЦикла;
						//крохин начало 31.10.2013  
						
						//Тимофеев Ю.А. 20.04.2026
						//https://yougile.collant.ru/team/ab6bad3a05c0/#SNL-105
						ADRESS.СнятьЗанятостьСотрудникаПоПланНабору(ДокОбъект.Ссылка,,"РНК "+Строка(Ссылка));
						//Тимофеев Ю.А. 20.04.2026
												
					КонецЕсли;
					
					Если (ПараметрыСеанса.ЭтотУзел.код = "ODN" или ПараметрыСеанса.ЭтотУзел.код = "OD7") И Отгружен = Перечисления.Отгружен.Отгружен Тогда
						//Кухарь 28.10.15 конец	
						Для Каждого СтрокаТЧ Из ДокОбъект.тБрэндов Цикл
							Если СтрокаТЧ.состояние <> Перечисления.СостоянияНакладной.Отгружена Тогда
								СтрокаТЧ.состояние = Перечисления.СостоянияНакладной.Отгружена;
								Записывать = Истина;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					//крохин конец 17.12.2013
					Если Записывать и не (ссылка.СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена) Тогда
						если Год(ПолучитьРеквизитШапки(ПланНабора,"Дата","Документ")) <> Год(ДокОбъект.дата) тогда
							УстановитьНомерДокумента(ДокОбъект);
						КонецЕсли;
						
						ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;   
			
			Запрос=новый запрос;
			запрос.Текст=			"ВЫБРАТЬ
			|	ЗаданиеНабора.Ссылка КАК Ссылка,
			// Кухарь А.Ю. 23.03.2021 начало
			|	ЗаданиеНабора.СостояниеНакладной КАК СостояниеНакладной,
			|	НАЧАЛОПЕРИОДА(ЗаданиеНабора.Дата, ДЕНЬ) КАК Дата									 
			// Кухарь А.Ю. 23.03.2021 конец									
			|ИЗ
			|	Документ.ЗаданиеНабора КАК ЗаданиеНабора
			|ГДЕ
			|	ЗаданиеНабора.Проведен
			|	И ЗаданиеНабора.Дата >= &Дата
			|	И ЗаданиеНабора.Накладная = &Накладная";
			запрос.УстановитьПараметр("Накладная",Ссылка);
			запрос.УстановитьПараметр("Дата",ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования());		
			результат=запрос.Выполнить().Выбрать();
			пока результат.Следующий() цикл
				Если результат.СостояниеНакладной=СостояниеНакладной и результат.дата=НачалоДня(дата) тогда
					Продолжить;
				КонецЕсли;				 
				ЗНБОбъект=результат.ссылка.получитьобъект();
				ЗНБОбъект.дата=дата;
				если СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена и ЗНБОбъект.СостояниеНакладной<>СостояниеНакладной тогда
					ЗНБОбъект.СостояниеНакладной=СостояниеНакладной;
				КонецЕсли;				
				ЗНБОбъект.записать(РежимЗаписиДокумента.Проведение);			
			КонецЦикла;
		КонецЕсли;
	#КонецЕсли
	
	если СостояниеНакладной<>Перечисления.СостоянияНакладной.Отгружена и ссылка.СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена тогда
		НачатьТранзакцию(); 
		ВернутьИзОтгружено();	
		ЗафиксироватьТранзакцию(); 
	КонецЕсли;
	//Кухарь 25.12.19 конец	 	
	
	Если НужноВыгружать 
		и ТребуетсяМаркировка
		и не ОбменДанными.Загрузка 
		И НужноЗаказатьКодыИДляМаркированногоСкладаПоНакланой()
		и ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение  Тогда	  
		
		НужноВыгружать = ПолучитьСтатусЗаказовКМПоНакланой(Ссылка);
		Если не НужноВыгружать Тогда
			Если СостояниеНакладной = Перечисления.СостоянияНакладной.КОтправкеНаСклад и не ЭтоНовый() Тогда
				СостояниеНакладной = Перечисления.СостоянияНакладной.ЗаказКМЧЗ; 
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли НужноВыгружать
		и ТребуетсяМаркировка
		и не ОбменДанными.Загрузка 
		И НужноЗаказатьКодыИДляМаркированногоСкладаПоНакланой()
		и ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение
		И (СостояниеНакладной = Перечисления.СостоянияНакладной.КОтправкеНаСклад ИЛИ СостояниеНакладной = Перечисления.СостоянияНакладной.ПолученоСкладом) 
		И НачСостНакладной = Перечисления.СостоянияНакладной.ВРаботе Тогда  
		//Когда перевели накладную в Екате из Вработе на склад, меняем на Заказ кодов маркировки
		СостояниеНакладной = Перечисления.СостоянияНакладной.ЗаказКМЧЗ; 
	ИначеЕсли НужноВыгружать
		и ТребуетсяМаркировка
		и ОбменДанными.Загрузка //!Перед Загрузкой выгружает Заново старый статус и не грузит новый
		И НужноЗаказатьКодыИДляМаркированногоСкладаПоНакланой()
		и ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение
		И СостояниеНакладной = Перечисления.СостоянияНакладной.ЗаказКМЧЗ 
		Тогда  
		НужноВыгружать = Ложь;
		СостояниеНакладной = Перечисления.СостоянияНакладной.ПолученоСкладом;
	КонецЕсли;
	
	ПроверитьЗаполненностьТНВЭД(ТипУзла);
	
	если ТребуетсяМаркировка 	
		И (СостояниеНакладной = Перечисления.СостоянияНакладной.КОтправкеНаСклад   		
		ИЛИ СостояниеНакладной = Перечисления.СостоянияНакладной.ПолученоСкладом
		ИЛИ СостояниеНакладной = Перечисления.СостоянияНакладной.ЗаказКМЧЗ)
		И (НачСостНакладной = Перечисления.СостоянияНакладной.ВРаботе ИЛИ НачСостНакладной = Перечисления.СостоянияНакладной.КОтправкеНаСклад) 
		Тогда 
		ПарамОтбора = Новый Структура;
		ПарамОтбора.Вставить("ТребуетсяМаркировка", Истина);
		Если Комплектующие.Количество() > 0 Тогда
			НайденныеСтроки = Комплектующие.НайтиСтроки(ПарамОтбора);
			ТекущаяТЧ = "Комплектующие";
		Иначе 
			НайденныеСтроки = Товары.НайтиСтроки(ПарамОтбора);
			ТекущаяТЧ = "Товары";
		КонецЕсли;
		ТекстСообщения = "";
		Для каждого Стр Из НайденныеСтроки Цикл 
			//Валетов + 24,07,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-2669
			Если ТекущаяТЧ = "Комплектующие" Тогда
				Если Стр.Продукция.ВидКомплекта = Перечисления.ВидыКомплектов.ГотовыйКомплект ИЛИ Стр.Продукция.ВидКомплекта = Перечисления.ВидыКомплектов.Комплект Тогда
					Если НЕ ЗначениеЗаполнено(Стр.Продукция.ГТИН) Тогда
						ТекстСообщения = ТекстСообщения + "В РНК: "+Ссылка+" в строке "+Стр.НомерСтроки+" не заполнен GTIN на продукцию "+Стр.Продукция+", требующую маркировки."+Символы.ПС; 
					КонецЕсли;
				КонецЕсли;
			КонецЕсли; 
			//Валетов-
			Если НЕ ЗначениеЗаполнено(Стр.Номенклатура.ГТИН) Тогда
				ТекстСообщения = ТекстСообщения + "В РНК: "+Ссылка+" в строке "+Стр.НомерСтроки+" не заполнен GTIN на "+Стр.Номенклатура+", требующую маркировки."+Символы.ПС; 
			КонецЕсли; 
			
		КонецЦикла;
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			СообщитьИзМодуля(ТекстСообщения);  
			НужноВыгружать = Ложь;    
			СостояниеНакладной = Перечисления.СостоянияНакладной.ВРаботе;
			//Отказ=Истина; Мешало записать неправильную накладную в сброшенном статусе.
		КонецЕсли;		
	КонецЕсли;
	//Валетов -
	
	Если НужноВыгружать Тогда
		
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
		//Мессерле 10,09,12
		УстановитьПолучателейИзмененийОбъектаВнешние(ЭтотОбъект);
		//Катаев+ 08/10/14
		Если Не ЭтотОбъект.Ссылка.Пустая() Тогда
			НужноВыгружать = Ложь;
		КонецЕсли;
		//Катаев- 08/10/14
	КонецЕсли;
	
	НадоОтправлять = истина;
	КодДоговора =  ЭтотОбъект.Ссылка.договор.код;
	
	Если Не ПустаяСтрока(КодИЛН) 		 
		И (ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") 
		ИЛИ ПланыОбмена.Основной.ЭтотУзел()= ПланыОбмена.Основной.НайтиПоКоду("EKF"))
		Тогда
		
		Если ВыгружатьЭлектронныеДокументы Тогда 		 
			СостояниеДокументаДляОтправки = ЛОжь;
			
			Если КодКонтрагента = "SSP-5862" или КодКонтрагента = "SSR-2291" или (кодКонтрагента = "SST-0259" и кодДоговора = "SNL-030816")  Тогда		
				Если СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена И ЭтотОбъект.Дата >= ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования() Тогда
					СостояниеДокументаДляОтправки = истина;
				КонецЕсли;
			ИначеЕсли  КодРодителяКонтрагента = "SSR-4117" или КодКонтрагента = "EKF-0865" или КодКонтрагента="SSP-2450"   или КодКонтрагента="SSP-4991"
				или КодКонтрагента="SSP-3881" или  КодКонтрагента="SSR-1593" или КодКонтрагента = "SSR-2450"  или (КодКонтрагента = "SSP-3687"  и ПунктДоставки.ГЛНКонтрагентаВторой<>"")		 
				Тогда
				// для перекрестка  отправляем Подтверждение в момент отправки на склад
				Если (СостояниеНакладной = Перечисления.СостоянияНакладной.КОтправкеНаСклад) 
					//нечаева 20,02,20++
					или (СостояниеНакладной = Перечисления.СостоянияНакладной.ОжиданиеПаллетирования)
					//нечаева 20,02,20--
					или (СостояниеНакладной = Перечисления.СостоянияНакладной.ПолученоСкладом) или (СостояниеНакладной = Перечисления.СостоянияНакладной.ГотоваКОтгрузке) или (СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена)  И ЭтотОбъект.Дата >= ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования() Тогда
					СостояниеДокументаДляОтправки = истина;			
				КонецЕсли;
			ИначеЕсли КодКонтрагента = "SSR-4185"  Тогда		
				Если (СостояниеНакладной = Перечисления.СостоянияНакладной.ГотоваКОтгрузке) или
					
					(СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена И ЭтотОбъект.Дата >= ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования()) Тогда
					СостояниеДокументаДляОтправки = истина;
				КонецЕсли;
			иначеЕсли 	КодКонтрагента = "SSR-4117" и ПунктДоставкиКод = "SNL-024031" Тогда
				// ничего не отправляем
				СостояниеДокументаДляОтправки = ложь;
				
			иначе
				// для остальных в Г
				Если (СостояниеНакладной = Перечисления.СостоянияНакладной.ГотоваКОтгрузке) 
					//нечаева 12,01,17 +++
					или (СостояниеНакладной = Перечисления.СостоянияНакладной.ОжиданиеПаллетирования) 
					//нечаева 12,01,17 ---
					или (СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена И ЭтотОбъект.Дата >= ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования()) Тогда
					СостояниеДокументаДляОтправки = истина;			
				КонецЕсли;
				
			конецЕсли;
			Если НадоОтправлять и  СостояниеДокументаДляОтправки  Тогда
				ДокументыПереданы=Истина;
				ЗапКолДок= Новый запрос;
				ЗапКолДок.Текст = "ВЫБРАТЬ
				|	ВыгружаемыеДокументыЕКОД.Код,
				|	ВыгружаемыеДокументыЕКОД.Наименование
				|ИЗ
				|	Справочник.ВыгружаемыеДокументыЕКОД КАК ВыгружаемыеДокументыЕКОД
				|ГДЕ
				|	ВыгружаемыеДокументыЕКОД.ПометкаУдаления = ложь
				|	И ВыгружаемыеДокументыЕКОД.Владелец = &ТекКонтрагент";
				
				ЗапКолДок.УстановитьПараметр("ТекКонтрагент",контрагент);
				рез1=ЗапКолДок.Выполнить().Выбрать();
				колДокументов = рез1.Количество();
				
				Если колДокументов = неопределено или колДокументов= Null Тогда
					колДокументов= 0;
				КонецЕсли;
				
				//выбираем что уже отправлено, и нужно ли еще что-то отправлять?
				Если колДокументов<>0 Тогда
					
					Запрос = Новый Запрос;
					//нечаева 25,04,17+++
					Запрос.Текст= "ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	ОтправкаЭлектронныхДокументов.ВидДокумента,
					|	ОтправкаЭлектронныхДокументов.ДокументОтправлен
					|ИЗ
					|	РегистрСведений.ОтправкаЭлектронныхДокументов КАК ОтправкаЭлектронныхДокументов
					|ГДЕ
					|	ОтправкаЭлектронныхДокументов.ДокументОтправлен = ИСТИНА
					|	И ОтправкаЭлектронныхДокументов.Документ = &ТекДок
					|	И ОтправкаЭлектронныхДокументов.ВидДокумента <> &Инвойс";
					Запрос.УстановитьПараметр("ТекДок",ссылка);
					Запрос.УстановитьПараметр("Инвойс",Перечисления.ДокументЕКОД.СчетФактура);
					//нечаева 25,04,17---инвойс добавился для роздухова
					Рез = Запрос.Выполнить().Выбрать();			
					ОтправленоДокументов = Рез.Количество();
					Если колДокументов- ОтправленоДокументов>0 Тогда
						
						// эта галка теперь только для писем с уведомлением не для Екода!!!!
						//						
						//временно, на этап тестирование оставила галку, остается вопрос как будет работать при обмене регистра из филиалов в ЦО.
						Если Не ПереданПокупателюВЭлВиде Тогда
							СформироватьДляЕДО(ЭтотОбъект, 0);
						КонецЕсли;
						
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//--------------------------------------------------------------------------------------
	//Нечаева +++ 07,08,13
	// пишем в регистр данные для отправки писем ОЛ по отпр или отгруженым накладным.
	
	Если (не отгрузкуРазрешил.Пустая()) и СостояниеНакладной<>Перечисления.СостоянияНакладной.ВРаботе  И ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение 
		И (ОтгружатьСПревышениемЛимитаКредита=Истина или ОтгружатьСПросроченнойЗадолженостью=Истина) и Ссылка<>Документы.РасходнаяНакладная.ПустаяСсылка() Тогда
		
		ОтправлятьПисьмоОпревышенииЛимита();
		
	КонецЕсли;
	//Нечаева +++ 07,08,13
	//--------------------------------------------------------------------------------------
	
	
	
	//крохин начало 15.08.2013
	//цены могут быть изменены обработкой, например, при принятии коррекции
	Если НЕ ОбменДанными.Загрузка Тогда
		
		ТребуетсяФлагПодарок = Ложь;
		Если Товары.Итог("Количество") > 0 Тогда
			Если Товары.Итог("Всего") = 0 Тогда
				Для Каждого СтрокаТЧ Из Товары Цикл
					Если СтрокаТЧ.Количество = 0 Тогда Продолжить КонецЕсли;
					ТребуетсяФлагПодарок = Истина;                                    //нечаева 17,04,14 ---
					Прервать;
				КонецЦикла;
				//Кухарь 29.02.16 начало
				//Ищем тут нулевую цену, если есть то запрещаем проводить 
			Иначе
				ОтборНулевыеЦены=новый Структура("Цена",0);
				МассивНулевыхЦен=Товары.НайтиСтроки(ОтборНулевыеЦены);
				для Каждого СтрМасс из МассивНулевыхЦен цикл
					если СтрМасс.Количество>0 тогда
						СообщитьИзМодуля("Запрещено сохранять РНК, "+Номер +" где есть как нулевые цены так и не нулевые!!");							
						Если Дата >= '20160310' Тогда
							Отказ = Истина;
						КонецЕсли;
						//крохин конец 07.03.2016
						Прервать;
					КонецЕсли;
				КонецЦикла;			
				//Кухарь 29.02.16 конец
			КонецЕсли;
		КонецЕсли;
		Если ТребуетсяФлагПодарок  И НЕ Подарок Тогда
			Подарок = Истина;
		ИначеЕсли НЕ ТребуетсяФлагПодарок И Подарок Тогда
			Подарок = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение и Проведен И НЕ ПараметрыСеанса.ОтключитьЖурнализациюЗаписи	И Не ОбменДанными.Загрузка И ОтгрузкаКомплектов И СостояниеНакладной <> Перечисления.СостоянияНакладной.ВРаботе Тогда	 
		// Кухарь А.Ю. 23.03.2021 конец
		ЗаполнитьИмпортераКМПЛРНК(Ссылка);
	КонецЕсли;
	//крохин конец 24.09.2013
	
	//Кухарь 17.01.19 начало
	//Если НЕ ОбменДанными.Загрузка и ПараметрыСеанса.ТипУзла= Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда	
	если ТЗНеизменяемыхРеквизитов<>Неопределено тогда
		если ТЗНеизменяемыхРеквизитов.найти("ДатаАвизации")<>Неопределено тогда
			МеняемДатуАвизации=ложь
		иначе
			МеняемДатуАвизации=истина;			
		КонецЕсли;
		// Кухарь А.Ю. 05.03.2021 начало
		// Оптимизация
		если ТЗНеизменяемыхРеквизитов.найти("КоличествоКоробок")<>Неопределено тогда
			МеняемКоличествоКоробов=ложь
		иначе
			МеняемКоличествоКоробов=истина;			
		КонецЕсли;	
		
		если ТЗНеизменяемыхРеквизитов.найти("Трудозатраты")<>Неопределено тогда
			ПересчитываемТрудозатраты=ложь
		иначе	
			ПересчитываемТрудозатраты=истина;	
		КонецЕсли;				
		// Кухарь А.Ю. 05.03.2021 конец	
	иначе
		МеняемДатуАвизации=истина;
		// Кухарь А.Ю. 05.03.2021 начало
		// Оптимизация
		МеняемКоличествоКоробов=Истина; 
		ПересчитываемТрудозатраты=Истина;
		// Кухарь А.Ю. 05.03.2021 конец	
	КонецЕсли;
	
	Если НЕ ОбменДанными.Загрузка и ПараметрыСеанса.ТипУзла= Перечисления.ТипУзлаИБ.УправляющееПодразделение и МеняемДатуАвизации Тогда	
		//Кухарь 17.01.19 конец
		
		РасчДатаАвизации=ОпределитьДатуАвизацииДокумента(ЭтотОбъект);
		если РасчДатаАвизации<>ДатаПриемки тогда
			УстановитьДатуАвизацииДокумента(ЭтотОбъект.Ссылка,РасчДатаАвизации);
			ДатаПриемки=РасчДатаАвизации;
		КонецЕсли;
	КонецЕсли;
	//кухарь 28.08.14 конец
	
	
	//кухарь 05.05.15 начало
	если ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.Склад и Склад.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код и не ЭтоНовый()  тогда 
		если СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке или
			СостояниеНакладной=Перечисления.СостоянияНакладной.ОжиданиеТермоусадки или 
			СостояниеНакладной=Перечисления.СостоянияНакладной.Термоусадка или
			СостояниеНакладной=Перечисления.СостоянияНакладной.ОжиданиеПаллетирования или 
			СостояниеНакладной=Перечисления.СостоянияНакладной.Паллетирование тогда
			если МеняемКоличествоКоробов тогда 
				СтрокаТЗ=ФинальныйПересчетКоробокИОбъемов(ЭтотОбъект);
				КоличествоКоробок=СтрокаТЗ.КоличествоКоробок;
				ОбъемКоробов=СтрокаТЗ.ОбъемКоробов;
				ЗаписатьКоличествоИОбъемКоробовВРегистр (ЭтотОбъект.Ссылка,СтрокаТЗ.КоличествоКоробок,СтрокаТЗ.ОбъемКоробов);	
			КонецЕсли;
			
			если СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке тогда
				
				если ПересчитываемТрудозатраты тогда
					СписокВидовРабот=новый СписокЗначений;
					СписокВидовРабот.Добавить(Справочники.ВидыВыполняемыхРабот.ДопОбработка);
					НачалоПроверки=ТекущаяДата();
					запрос=новый запрос;
					запрос.Текст="ВЫБРАТЬ
					|	КоллективныеРаботы.Ссылка
					|ИЗ
					|	Документ.КоллективныеРаботы КАК КоллективныеРаботы
					|ГДЕ
					|	КоллективныеРаботы.Проведен
					|	И КоллективныеРаботы.Дата > &ДатаЗапретаРедактирование
					|	И КоллективныеРаботы.ВидРаботы в (&СписокВидовРабот) 
					|	И КоллективныеРаботы.ДокОснование = &ДокОснование";
					запрос.УстановитьПараметр("ДатаЗапретаРедактирование",ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования());
					запрос.УстановитьПараметр("ДопОбработка",Справочники.ВидыВыполняемыхРабот.ДопОбработка);
					запрос.УстановитьПараметр("СписокВидовРабот",СписокВидовРабот);
					запрос.УстановитьПараметр("ДокОснование",ссылка);
					результат=запрос.Выполнить().Выбрать();
					пока результат.Следующий() цикл
						КоллективнаяРабота=результат.ссылка.получитьобъект();
						если КоллективнаяРабота.Состояние=Перечисления.СостоянияНакладной.ВРаботе тогда
							Запрос=новый запрос;
							запрос.текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
							|	ПланНаборатБрэндов.ДопОбработчик,
							|	ПланНаборатБрэндов.ОкончаниеДопОбработки
							|ИЗ
							|	Документ.ПланНабора.тБрэндов КАК ПланНаборатБрэндов
							|ГДЕ
							|	ПланНаборатБрэндов.Ссылка.Накладная = &ДокОснование
							|	И ПланНаборатБрэндов.Ссылка.Проведен
							|	И ПланНаборатБрэндов.Ссылка.Дата >= &Дата
							|
							|СГРУППИРОВАТЬ ПО
							|	ПланНаборатБрэндов.ДопОбработчик,
							|	ПланНаборатБрэндов.ОкончаниеДопОбработки";
							запрос.УстановитьПараметр("ДокОснование",Ссылка);
							запрос.УстановитьПараметр("Дата",НачалоДня(Дата));				
							ТЗДО=запрос.Выполнить().Выгрузить();
							ТЗДО.Свернуть("ДопОбработчик,ОкончаниеДопОбработки");
							ТЗДОСверн=ТЗДО.Скопировать();				
							ТЗДОСверн.Свернуть("ДопОбработчик");
							ТЗДОСверн.Колонки.Добавить("ОкончаниеДопОбработки");
							ДатаОкончания=ПустаяДата();
							Для каждого СтрДО из ТЗДОСверн цикл
								ДатаОкончания=ПустаяДата();
								МассСтрок=ТЗДО.НайтиСтроки(новый Структура("ДопОбработчик",СтрДО.ДопОбработчик));
								Для каждого СтрМасс из МассСтрок цикл
									ДатаОкончания=Макс(ДатаОкончания,СтрМасс.ОкончаниеДопОбработки)
								КонецЦикла;
								если ДатаОкончания=ПустаяДата() тогда 
									ДатаОкончания=НачалоПроверки;
								КонецЕсли;
								СтрДО.ОкончаниеДопОбработки=ДатаОкончания;
							КонецЦикла;							
							МассСтрок=КоллективнаяРабота.Данные.НайтиСтроки(новый Структура("ОкончаниеВыполнения",ПустаяДата()));
							Для каждого СтрМассива из МассСтрок цикл
								СтрТЗ=ТЗДОСверн.Найти(СтрМассива.ВедущийСотрудник);
								если СтрТЗ=Неопределено тогда
									СтрТЗ=ТЗДОСверн.Найти(СтрМассива.Сотрудник);
								КонецЕсли;
								если СтрТЗ=Неопределено тогда
									СтрМассива.ОкончаниеВыполнения=НачалоПроверки;
									Продолжить;
								КонецЕсли;
								СтрМассива.ОкончаниеВыполнения=СтрТЗ.ОкончаниеДопОбработки;
							КонецЦикла;	      
							
							// Кухарь А.Ю.  27.08.2025 начало
							если МассСтрок.количество() = 0 тогда
								если КоллективнаяРабота.ДатаОкончанияРабот = ПустаяДата() тогда
									если ЗначениеЗаполнено(ДатаОкончания) тогда 
										КоллективнаяРабота.ДатаОкончанияРабот = ДатаОкончания;
									КонецЕсли;
								КонецЕсли;      
							КонецЕсли;
							// Кухарь А.Ю.  27.08.2025 конец
							КоллективнаяРабота.Состояние=Перечисления.СостоянияНакладной.Отгружена;
							КоллективнаяРабота.Записать();	
						КонецЕсли;				
						ТрудоЗатратыНаДО=КоллективнаяРабота.КоличествоЧеловекоЧасов;
						ВремяНаДО=КоллективнаяРабота.ВремяРаботы/3600;		
					КонецЦикла;	
					// Кухарь А.Ю. 05.03.2021 начало
					// Оптимизация  если ПересчитываемТрудозатраты тогда
				Иначе
					// Шворобей ВЮ 30.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5976
					// ТАКОЙ СПОРНЫЙ КУСОК, ИЗ ТЗ (АНДРЕЙ ПУСТЬ ПРОВЕРИТ)
					МассивКР = Документы.КоллективныеРаботы.ПоискНезакрытыхКоллективныхРаботПоДокументуОснования(Ссылка);	
					Если МассивКР.Количество() > 0 Тогда
						СообщитьИзМодуля("Существуют незакрытые Коллективные работы по этому документу!");
						Для Каждого КР Из МассивКР Цикл
							СообщитьИзМодуля(Строка(КР));	
						КонецЦикла;
						//Отказ = Истина;
					КонецЕсли;
					// Шворобей ВЮ 30.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5976	
				КонецЕсли;
				// Кухарь А.Ю. 05.03.2021 конец
				
				// Шворобей ВЮ 30.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5976	
			ИначеЕсли СостояниеНакладной = Перечисления.СостоянияНакладной.ОжиданиеПаллетирования Тогда
				МассивКР = Документы.КоллективныеРаботы.ПоискНезакрытыхКоллективныхРаботПоДокументуОснования(Ссылка);	
				Если МассивКР.Количество() > 0 Тогда
					СообщитьИзМодуля("Существуют незакрытые Коллективные работы по этому документу!");
					Для Каждого КР Из МассивКР Цикл
						СообщитьИзМодуля(Строка(КР));	
					КонецЦикла;
					//Отказ = Истина;
				КонецЕсли;
				//++Данилова Е.В. 24.11.2025 ASU-2151
				Если НачСостНакладной <> Перечисления.СостоянияНакладной.ОжиданиеПаллетирования Тогда
					
					РезультатПроверки = МаркировкаС.КонтрольЧЗПоРНКОжиданиеПаллетирования(ссылка);
					Если НЕ РезультатПроверки.Успешно Тогда
						
						Отказ = Истина;
						//#Если Клиент Тогда  
						МаркировкаКС.ВывестиОшибки(РезультатПроверки); 	
						//#КонецЕсли
						
					КонецЕсли;
					
				КонецЕсли;
				//--Данилова Е.В. 24.11.2025 
			КонецЕсли;
			// Шворобей ВЮ 30.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5976	
			//Кухарь 27.02.19 конец
			
		КонецЕсли;	
	КонецЕсли;	
	//кухарь 05.05.15 конец
	
	//Кухарь 02.07.18 начало
	//Избавимся от пустых значений
	Если ТипДоставки = Перечисления.ТипыДоставки.ПустаяСсылка() тогда
		ТипДоставки=ПунктДоставки.ТипДоставки
	КонецЕсли;
	//Кухарь 02.07.18 конец
	
	// Кухарь А.Ю.  28.08.2023 начало
	Если ТипДоставки=Перечисления.ТипыДоставки.Доставка и ПунктПерегруза<>Справочники.ПунктыДоставки.ПустаяСсылка() тогда
		ПунктПерегруза=Справочники.ПунктыДоставки.ПустаяСсылка()
	КонецЕсли;
	// Кухарь А.Ю.  28.08.2023 конец
	
	
	//крохин начало 22.01.2020
	//сумма скидки по ДС может меняться на складе при изменении количества, для резервных РНК
	//для отгруженных РНК сумма скидки меняться не может
	//увеличиваться сумма скидки не может
	#Если КЛИЕНТ Тогда
		
		Если НЕ ОбменДанными.Загрузка Тогда
			Если ТипУзла <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				Если СуммаСкидкиДС <> 0 И СостояниеНакладной <> Перечисления.СостоянияНакладной.ВРаботе Тогда
					Если Ссылка.СуммаДокумента = 0 Тогда
						ПроцентИзмененияСуммыДокумента = 1;
					Иначе
						ПроцентИзмененияСуммыДокумента = СуммаДокумента/Ссылка.СуммаДокумента;
					КонецЕсли;
					
					
					
					Если ПроцентИзмененияСуммыДокумента <> 1 Тогда
						Если Отгружен = Перечисления.Отгружен.Отгружен Тогда
							СообщитьОбОшибке("невозможно изменение скидки по ДС в отгруженных РНК! Документ не записан: "+Ссылка);	
							Отказ = Истина;
						Иначе
							СуммаСкидкиДС = СуммаСкидкиДС*ПроцентИзмененияСуммыДокумента;	
						КонецЕсли;	
						
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
	#КонецЕсли
	//крохин конец 22.01.2020
	
	//крохин начало 04.10.2022
	//флаг устанавливается для отгрузок по коду операции "реализация" с комиссионного склада
	//в перспективе могут появиться и другие условия для этого флага
	Если Склад.ТипСклада = Перечисления.ТипСклада.КомиссионныйСклад
		И КодОперации = Перечисления.КодыОперацийОстатки.Реализация Тогда
		
		Если НЕ ОтгрузкаКомиссионногоТовараЗаГраницу Тогда
			ОтгрузкаКомиссионногоТовараЗаГраницу = Истина;
		КонецЕсли;
	Иначе
		Если ОтгрузкаКомиссионногоТовараЗаГраницу Тогда
			ОтгрузкаКомиссионногоТовараЗаГраницу = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	//крохин конец 04.10.2022
	
	
	
	// Кухарь А.Ю. 24.05.2022 начало
	// Контроль комплектов
	если Модифицированность() и не ОбменДанными.Загрузка и ОтгрузкаКомплектов тогда
		если Товары.Итог("КоличествоКомплектующих")<> Комплектующие.Итог("КоличествоКомплектующих") тогда
			СообщитьИзМодуля("Не совпадает количество комплектующих в таблице товаров и таблице комплектующие");
			ЗаписатьВЛог("Отладка","Кол КМП Кривое. РНК № "+Номер,"Важное");
			//отказ=Истина;
		КонецЕсли;	
	КонецЕсли;
	// Кухарь А.Ю. 24.05.2022 конец
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Перед записью РНК, если у Контрагента есть признак "ВыделятьМаркированныйТовар", то проверять по всем строкам
	// товаров с Количеством > 0.
	// Что в этом документе нет одновременно товара подлежащего маркировке и не подлежащего.
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Кухарь А.Ю.  19.08.2024 начало
	//
	#Если Клиент тогда
		
		// Кухарь А.Ю.  11.09.2024 начало
		// Если Контрагент.ВыделятьМаркированныйТовар и ПараметрыСеанса.ЭтотУзел.ТипУзла<>Перечисления.ТипУзлаИБ.Склад Тогда
		Если ПараметрыСеанса.ЭтотУзел.ТипУзла<>Перечисления.ТипУзлаИБ.Склад 
			// Кухарь А.Ю.  17.09.2024 начало
			и (СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе 
			или СостояниеНакладной=Перечисления.СостоянияНакладной.КОтправкеНаСклад) Тогда			
			// Кухарь А.Ю.  17.09.2024 конец
			
			// Шворобей ВЮ 20.12.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1807
			ТаблицаПереопределяемыхДат = МаркировкаКС.ПодготовитьТаблицуСПереопределяемойДатойНачалаРаботыСМаркировкой(ЭтотОбъект,"Товары");
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ТЧТовары", Товары.Выгрузить());
			
			Если ТаблицаПереопределяемыхДат <> Неопределено И ТаблицаПереопределяемыхДат.Количество() > 0 Тогда
				
				МассивОтбора = ТаблицаПереопределяемыхДат.НайтиСтроки(Новый Структура("ДатаНачалаРаботыСМаркировкой", Дата(1,1,1)));
				
				// Кухарь А.Ю.  13.01.2025 начало
				//https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2520
				//Если МассивОтбора.Количество() > 0 И МассивОтбора.Количество() < ТаблицаПереопределяемыхДат.Количество() Тогда
				Если ВыделятьМаркированныйТовар и МассивОтбора.Количество() > 0 И МассивОтбора.Количество() < ТаблицаПереопределяемыхДат.Количество() Тогда
					// Кухарь А.Ю.  13.01.2025 конец
					
					Сообщить("В накладной есть маркированный и не маркированный товар с Количеством > 0");
					Отказ = Истина; Возврат;
				КонецЕсли;
			Иначе
				
				// Кухарь А.Ю.  04.09.2024 начало
				Если ЗначениеЗаполнено(ДатаОтгрузки) Тогда
					Запрос.УстановитьПараметр("ДатаОтгрузки",ДатаОтгрузки);
				Иначе
					Запрос.УстановитьПараметр("ДатаОтгрузки",Дата);
				КонецЕсли;	
				// Кухарь А.Ю.  04.09.2024 конец
				
				Запрос.Текст =
				"ВЫБРАТЬ
				|	ТЧТовары.Номенклатура КАК Номенклатура,
				|	ТЧТовары.Количество КАК Количество
				|ПОМЕСТИТЬ ТЧТовары
				|ИЗ
				|	&ТЧТовары КАК ТЧТовары
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ЕСТЬNULL(спрНоменклатура.Ссылка, ТЧТовары.Номенклатура) КАК Номенклатура,
				|	ЕСТЬNULL(ТЧТовары.Количество, 0) КАК Количество,
				|	ВЫБОР
				|		КОГДА спрНоменклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой <> ДАТАВРЕМЯ(1, 1, 1)
				|			ТОГДА спрНоменклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой
				|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
				|	КОНЕЦ КАК ДатаОбязательнойМаркировки,
				|	ВЫБОР
				|		КОГДА спрНоменклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой <> ДАТАВРЕМЯ(1, 1, 1)
				|			ТОГДА спрНоменклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой
				|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
				|	КОНЕЦ КАК ДатаМаркировки
				|ПОМЕСТИТЬ ТЧТоварыМ
				|ИЗ
				|	ТЧТовары КАК ТЧТовары
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
				|		ПО ТЧТовары.Номенклатура = спрНоменклатура.Ссылка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ТЧТоварыМ.Номенклатура КАК Номенклатура,
				|	СУММА(ТЧТоварыМ.Количество) КАК Количество
				|ПОМЕСТИТЬ НеМаркированныйТовар
				|ИЗ
				|	ТЧТоварыМ КАК ТЧТоварыМ
				|ГДЕ
				|	ТЧТоварыМ.Количество > 0
				|	И (ТЧТоварыМ.ДатаМаркировки = ДАТАВРЕМЯ(1, 1, 1)
				|			ИЛИ ТЧТоварыМ.ДатаМаркировки > &ДатаОтгрузки)
				|
				|СГРУППИРОВАТЬ ПО
				|	ТЧТоварыМ.Номенклатура
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ТЧТоварыМ.Номенклатура КАК Номенклатура,
				|	СУММА(ТЧТоварыМ.Количество) КАК Количество
				|ПОМЕСТИТЬ МаркированныйТовар
				|ИЗ
				|	ТЧТоварыМ КАК ТЧТоварыМ
				|ГДЕ
				|	ТЧТоварыМ.Количество > 0
				|	И ТЧТоварыМ.ДатаМаркировки <> ДАТАВРЕМЯ(1, 1, 1)
				|	И ТЧТоварыМ.ДатаМаркировки <= &ДатаОтгрузки
				|
				|СГРУППИРОВАТЬ ПО
				|	ТЧТоварыМ.Номенклатура
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	КОЛИЧЕСТВО(ТЧТоварыМ.Количество) КАК Количество
				|ИЗ
				|	ТЧТоварыМ КАК ТЧТоварыМ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ТЧТоварыМ.Номенклатура КАК Номенклатура,
				|	ТЧТоварыМ.Номенклатура.Наименование КАК НоменклатураНаименование
				|ПОМЕСТИТЬ ОбязательноМаркируемыйТовар
				|ИЗ
				|	ТЧТоварыМ КАК ТЧТоварыМ
				|ГДЕ
				|	ТЧТоварыМ.Количество > 0
				|	И (ТЧТоварыМ.ДатаОбязательнойМаркировки <> ДАТАВРЕМЯ(1, 1, 1)
				|				И ТЧТоварыМ.ДатаОбязательнойМаркировки <= &ДатаОтгрузки
				|			ИЛИ ТЧТоварыМ.Номенклатура.ОтгрузкаТолькоЧерезЧЗ)";
				
				УстановитьПривилегированныйРежим(Истина);
				МассивПакета = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
				УстановитьПривилегированныйРежим(Ложь);
				
				ВсеТовары = МассивПакета[1].Выгрузить();
				Если ВсеТовары.Количество() = 0 Тогда Возврат; КонецЕсли;
				
				НеМаркированныйТовар = МассивПакета[2].Выгрузить();
				МаркированныйТовар = МассивПакета[3].Выгрузить();
				
				Если НеМаркированныйТовар.Количество() > 0 И МаркированныйТовар.Количество() > 0 и ВыделятьМаркированныйТовар  Тогда
					Сообщить("В накладной есть маркированный и не маркированный товар с Количеством > 0");
					Отказ = Истина; Возврат;	
				КонецЕсли;
				
				// Кухарь А.Ю.  11.09.2024 начало
				//
				ОбязательноМаркированныйТовар = МассивПакета[5].Выгрузить();
				МассивНаименований=ОбязательноМаркированныйТовар.выгрузитьКолонку("НоменклатураНаименование");
				// Кухарь А.Ю. 23.09.2024 начало
				//если ОбязательноМаркированныйТовар.количество()>0 и не ВозможнаРаботаСМаркировкой тогда
				Если ОбязательноМаркированныйТовар.количество()>0 и не ВозможнаРаботаСМаркировкой и не ЭтоВыкупДляПродажиВСНГ тогда
					// Кухарь А.Ю. 23.09.2024 конец
					
					СообщитьИзМодуля("с 15.09.2024 отгрузка подлежащего маркировке товара (2-й слой одежды) возможна только с нанесением маркировки на товар.
					|У клиента должна стоять отметка ""подтверждена работа с маркированным товаром"" 
					|в справочнике, а также настроено ЭДО для передачи кодов маркировки в УПД."+символы.ПС+СтрСоединить(МассивНаименований,символы.ПС));
					отказ=Истина;
				КонецЕсли;
				// Кухарь А.Ю.  11.09.2024 конец
			КонецЕсли
			// Шворобей ВЮ 20.12.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1807
			
		КонецЕсли;
		// Кухарь А.Ю.  19.08.2024 начало
	#КонецЕсли	 
	// Кухарь А.Ю.  19.08.2024 конец
	
	#Область ВидОплаты
	// Шворобей ВЮ 12.11.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1286
	Если ВидОплаты = Перечисления.ВидыОплаты.НАЛ И Ссылка.ВидОплаты = Перечисления.ВидыОплаты.БН Тогда
		ДополнительныеСвойства.Вставить("ТребуетсяУдалятьСФ", Истина);
	КонецЕсли;
	// Шворобей ВЮ 12.11.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1286
	#КонецОбласти
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//++ Данилова Е.В. 16.08.2024
	Если НЕ Отказ 
		И ( ПометкаУдаления 
		ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) Тогда
		
		b2b_ОбменЗаявками.ВернутьЗаказВРаботу(ссылка); 
		
	КонецЕсли;
	//-- Данилова Е.В. 16.08.2024	
	
	
	//Валетов +  https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-3158   
	//Валетов + Заказ кодов для ЕКБ + почистил лишние комментарии
	//https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-1947
	Если ТребуетсяМаркировка 
		и (СостояниеНакладной = Перечисления.СостоянияНакладной.КОтправкеНаСклад ИЛИ СостояниеНакладной = Перечисления.СостоянияНакладной.ЗаказКМЧЗ) 
		и (НачСостНакладной <> Перечисления.СостоянияНакладной.КОтправкеНаСклад ИЛИ НачСостНакладной <> Перечисления.СостоянияНакладной.ЗаказКМЧЗ)
		
		и ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение	  
		
		И (не ОбменДанными.Загрузка ИЛИ (ОбменДанными.Загрузка и СостояниеНакладной = Перечисления.СостоянияНакладной.ЗаказКМЧЗ)) 
		
		И НужноЗаказатьКодыИДляМаркированногоСкладаПоНакланой()
		Тогда 
		
		НаборЗаписей = РегистрыСведений.СтатусыЗаказаМарокДляДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Накладная.Установить(Ссылка);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Накладная = Ссылка;
			НоваяЗапись.СтатусыЗаказаКодовМаркировки = Перечисления.СтатусыЗаказаКодовМаркировки.ТребуетсяЗаказМарок;
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
	// Кухарь А.Ю.  18.03.2025 начало
	// Затёр кто-то пришлось возвращать
	Если ЕстьИзменения и  
		(СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе или  СостояниеНакладной=Перечисления.СостоянияНакладной.КОтправкеНаСклад)
		тогда
		МаркировкаКС.ЗаполнитьТабличныеЧастиПризнакомМаркировки(ЭтотОбъект);
	КонецЕсли;
	// Кухарь А.Ю.  18.03.2025 конец
	
	// Шворобей ВЮ 16.04.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4204 
	ФлагFBS = ?(Склад.ЭтоСкладFBS, Истина, Ложь);
	Если ЗначениеЗаполнено(ДатаОтгрузки) И НЕ ЗначениеЗаполнено(ДатаГотовности) Тогда
		ДатаГотовности = ?(ФлагFBS, ДатаОтгрузки, ДатаОтгрузки - 24 * 3600);	
	КонецЕсли;
	// Шворобей ВЮ 16.04.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4204
	
КонецПроцедуры
//--Данилова Е.В. 16.10.2025


//Валетов + 19.03.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-3476
Функция НужноЗаказатьКодыИДляМаркированногоСкладаПоНакланой()
	Если не Склад.ЭтоСкладМаркированногоТовара Тогда 
		Возврат Истина;
	Иначе
		ЕстьКомплекты = Ложь;
		
		Запрос =  Новый Запрос;
		Запрос.Текст = 
		//"ВЫБРАТЬ //Наряд 0000000710 Феданченков М.С. 06.06.2026
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&Номенклатура)
		|	И Номенклатура.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)";
		Запрос.УстановитьПараметр("Номенклатура", Товары.ВыгрузитьКолонку("Номенклатура")); 
		//Феданченков М.С. 06.06.2026 начало
		//Наряд 0000000710
		//Результат = Запрос.Выполнить().Выбрать();
		//Если Результат.Количество() > 0 Тогда 
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() И Комплектующие.Количество() > 0 Тогда
			ЕстьКомплекты = Истина;
		КонецЕсли;
		//Феданченков М.С. 06.06.2026 конец

		Возврат ЕстьКомплекты;
		
	КонецЕсли;	
	
КонецФункции

//Валетов + 04,03,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-3158
Функция ПолучитьСтатусЗаказовКМПоНакланой(Накладная)
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыЗаказаМарокДляДокументов.Накладная КАК Накладная
	|ИЗ
	|	РегистрСведений.СтатусыЗаказаМарокДляДокументов КАК СтатусыЗаказаМарокДляДокументов
	|ГДЕ
	|	СтатусыЗаказаМарокДляДокументов.СтатусыЗаказаКодовМаркировки = ЗНАЧЕНИЕ(перечисление.Статусызаказакодовмаркировки.Маркивведенывоборот)
	|	И СтатусыЗаказаМарокДляДокументов.Накладная = &Накладная";
	Запрос.УстановитьПараметр("Накладная", Накладная);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Кухарь А.Ю.  24.02.2025 начало
// Пустая задача

Функция СозданиеДокументовЧЗ() экспорт
	Отказ=ложь;          
	
	// Кухарь А.Ю. 07.04.2025 начало
	ДопПараметрыНакладной = ОбщегоНазначения_ПИ.ПолучитьДопПараметрыНакладной(Ссылка); 
	// Кухарь А.Ю. 07.04.2025 конец
	
	
	ЗСБ = НайтиДокумент("ЗаданиеНаСборкуКомплектовЧЗ",новый Структура("ДокОснование,Проведен",Ссылка,Истина));
	если ЗначениеЗаполнено(ЗСБ) тогда    
		
		// Кухарь А.Ю. 07.04.2025 начало
		// МаркировкаКС.ЗавершитьВсеЛСК(ЗСБ);
		если ДопПараметрыНакладной.ОтгрузкаFBS = Истина тогда
			ПроводитьЛСК=Истина;
		иначе
			ПроводитьЛСК=Ложь;
		КонецЕсли;
		МаркировкаКС.ЗавершитьВсеЛСК(ЗСБ,ПроводитьЛСК);	 
		// Кухарь А.Ю. 07.04.2025 конец
		
		
		Документы.ЗаданиеНаСборкуКомплектовЧЗ.ЗавершитьЗадание(ЗСБ);
		если ПолучитьРеквизитШапки(ЗСБ,"КоличествоШК","Документ")>0 тогда
			ДопПараметры=новый Структура("Статус",Перечисления.СтатусыДокументовМаркировки.КОбработке);
		иначе
			ДопПараметры=Неопределено;
		КонецЕсли;
		//++Данилова Е.В. 18.08.2025 MARK-1756 
		Документы.ЗаданиеНаСборкуКомплектовЧЗ.СоздатьРазагрегациюГотовыхНаборов(ЗСБ); 
		//--Данилова Е.В. 18.08.2025
		// Кухарь А.Ю. 06.04.2025 начало
		документы.ЗаданиеНаСборкуКомплектовЧЗ.Создать_Агрегации(ЗСБ,ДопПараметры);
		//РезультатСозданияАгрегаций =	документы.ЗаданиеНаСборкуКомплектовЧЗ.Создать_Агрегации(ЗСБ,ДопПараметры);	   
		//если не РезультатСозданияАгрегаций.Успешно тогда
		//	СообщитьИзМодуля(СтрСоединить(РезультатСозданияАгрегаций.Ошибки,","));
		//	отказ=Истина;	
		//КонецЕсли;
		// Кухарь А.Ю. 06.04.2025 конец
		
	КонецЕсли;
	
	ПравилаРаботыСАгрегациейЧЗ=МаркировкаКС.ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладной(Ссылка);
	
	БылиКороба=ложь;
	БылиБлочки=ложь;
	БылиПаллеты=ложь;
	// Кухарь А.Ю.  13.03.2025 начало
	// Пустая задача
	ПаллетыОтработаны=ложь; 
	// Кухарь А.Ю.  13.03.2025 конец
	
	
	если ПравилаРаботыСАгрегациейЧЗ.УстановленыПравилаРаботыСАгрегацией тогда
		Запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ
		|	МаркировкаТоваровИСМП.Ссылка КАК ДокМаркировки,
		|	МаркировкаТоваровИСМП.ТипШК КАК ТипШК,
		|	МаркировкаТоваровИСМП.Статус КАК Статус
		|ИЗ
		|	Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
		|ГДЕ
		|	МаркировкаТоваровИСМП.Проведен
		|	И МаркировкаТоваровИСМП.ДокументОснование = &ДокументОснование
		|	И МаркировкаТоваровИСМП.ВидОперации = &ВидОперации";
		запрос.УстановитьПараметр("ДокументОснование",Ссылка);
		запрос.УстановитьПараметр("ВидОперации",Перечисления.ВидыОперацийМаркировки.Агрегация);
		Выборка=запрос.Выполнить().Выбрать();
		
		ЗаписатьВЛог("Отладка","Начало заполнений агрегаций по РНК "+Номер,"Информация");
		
		
		пока Выборка.Следующий() цикл
			ДокМаркировки=выборка.ДокМаркировки;
			
			ЗаписатьВЛог("Отладка","Продолжение заполнений агрегаций по РНК "+Номер+". Заполнение агрегации "+ДокМаркировки+". Тип - "+Выборка.ТипШК,"Информация");
			
			
			если Выборка.ТипШК=Перечисления.ТипыШтрихКодов.Палета тогда
				БылиПаллеты=Истина;
				// Кухарь А.Ю.  13.03.2025 начало
				// Пустая задача
				если Выборка.Статус = Перечисления.СтатусыДокументовМаркировки.Обработан  тогда
					ПаллетыОтработаны=Истина;
				КонецЕсли;
				// Кухарь А.Ю.  13.03.2025 конец
				
				Продолжить;  //Паллет
			ИначеЕсли Выборка.ТипШК=Перечисления.ТипыШтрихКодов.Коробка тогда
				
				
				// Кухарь А.Ю.  26.02.2025 начало
				// Пустая задача
				запрос=новый запрос;
				запрос.Текст="ВЫБРАТЬ
				|	Лист.Ссылка КАК ДокументОснование,
				|	Лист.КодАгрегации КАК ШтрихкодКоробки
				|ИЗ
				|	Документ.ЛистНабора КАК Лист
				|ГДЕ
				|	Лист.Проведен
				|	И Лист.КодАгрегации <> &КодАгрегации
				|	И Лист.ДокОснование = &ДокОснование
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	Лист.Ссылка,
				|	Лист.КодАгрегации
				|ИЗ
				|	Документ.ЛистПереукладки КАК Лист
				|ГДЕ
				|	Лист.Проведен
				|	И Лист.КодАгрегации <> &КодАгрегации
				|	И Лист.ДокОснование = &ДокОснование
				| 
				//++Данилова Е.В. 05.06.2025 HELP-5130
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ЛистНабора.Ссылка,
				|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки
				|ИЗ
				|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
				|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ЛистНабораШтрихкодыКоробокДляАгрегации
				|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка
				|			И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ЛистНабораШтрихкодыКоробокДляАгрегации.НовыйКодКоробки
				|			И (ЛистНабораШтрихкодыКоробокДляАгрегации.НовыйКодКоробки <> ЛистНабораШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки)
				|ГДЕ
				|	ЛистНабора.ДокОснование = &ДокОснование
				|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
				|	И ЛистНабора.Проведен  
				//++Данилова Е.В. 02.04.2026 MARK-3539
				|	И НЕ &АгрегацииВЛП
				//--Данилова Е.В. 02.04.2026 
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ЛистПереукладки.Ссылка,
				|	ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки
				|ИЗ
				|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистПереукладкиШтрихкодыУпаковок
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладки
				|		ПО ЛистПереукладкиШтрихкодыУпаковок.Ссылка = ЛистПереукладки.Ссылка
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки.ШтрихкодыКоробокДляАгрегации КАК ЛистПереукладкиШтрихкодыКоробокДляАгрегации
				|		ПО ЛистПереукладкиШтрихкодыУпаковок.Ссылка = ЛистПереукладкиШтрихкодыКоробокДляАгрегации.Ссылка
				|			И ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки = ЛистПереукладкиШтрихкодыКоробокДляАгрегации.НовыйКодКоробки
				|			И (ЛистПереукладкиШтрихкодыКоробокДляАгрегации.НовыйКодКоробки <> ЛистПереукладкиШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки)
				|ГДЕ
				|	ЛистПереукладки.ДокОснование = &ДокОснование
				|	И ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
				|	И ЛистПереукладки.Проведен
				//--Данилова Е.В. 05.06.2025
				|";
				запрос.УстановитьПараметр("КодАгрегации",Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка());
				запрос.УстановитьПараметр("ДокОснование",Ссылка);
				//++Данилова Е.В. 02.04.2026 MARK-3539
				запрос.УстановитьПараметр("АгрегацииВЛП",МаркировкаС.ЕстьЛПСКодамиЧЗ(ссылка));
				//--Данилова Е.В. 02.04.2026 
				ДокМаркировкиОбъект=ДокМаркировки.получитьобъект();
				ДокМаркировкиОбъект.ШтрихкодыКоробок.Загрузить(запрос.Выполнить().Выгрузить());
				//++Данилова Е.В. 19.06.2025 HELP-5109
				Если ДокМаркировкиОбъект.ШтрихкодыКоробок.количество()>0 
					ИЛИ ОтсканированыВЛН_ЛП_Агрегаты(Перечисления.ТипыШтрихКодов.Коробка,ссылка) Тогда
					
					БылиКороба=Истина;
					
				КонецЕсли;
				//Кухарь А.Ю. 14.05.2025 начало
				//если ДокМаркировкиОбъект.ШтрихкодыКоробок.количество()>0 тогда 
				//	БылиКороба=Истина;            
				//КонецЕсли;
				//Кухарь А.Ю. 14.05.2025 конец
				//--Данилова Е.В. 19.06.2025
				
				ДокМаркировкиОбъект.ШтрихкодыУпаковок.Очистить();
				
				//Кухарь А.Ю.  26.06.2025 начало
				ДокМаркировкиОбъект.Дата = ТекущаяДата(); 
				//Кухарь А.Ю.  26.06.2025 конец
				
				ДокМаркировкиОбъект.Записать();
				
				// Кухарь А.Ю.  26.02.2025 конец 
				//++Данилова Е.В. 02.06.2025  HELP-5130 
				СоздатьРазагрегациюПоЗаводскимКоробкамВОбороте(); 
				//--Данилова Е.В. 02.06.2025
				
			ИначеЕсли Выборка.ТипШК=Перечисления.ТипыШтрихКодов.Блочок тогда
				
				// Кухарь А.Ю.  06.03.2025 начало
				// Пустая задача
				
				// Кухарь А.Ю.  26.02.2025 начало
				// Пустая задача
				запрос=новый запрос;
				запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Лист.Ссылка КАК ДокументОснование,
				|	Лист.ШтрихкодБлочка КАК ШтрихкодКоробки
				|ИЗ
				|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК Лист
				|ГДЕ
				|	Лист.Ссылка.ДокОснование = &ДокОснование
				// Кухарь А.Ю.  12.03.2025 начало
				// Исправление ошибки
				|  И Лист.Ссылка.проведен
				
				// Кухарь А.Ю.  12.03.2025 конец
				
				|	И Лист.ШтрихкодБлочка <> &КодАгрегации
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Лист.Ссылка,
				|	Лист.ШтрихкодБлочка
				|ИЗ
				|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК Лист
				|ГДЕ
				|	Лист.Ссылка.ДокОснование = &ДокОснование
				// Кухарь А.Ю.  12.03.2025 начало
				// Исправление ошибки
				|  И Лист.Ссылка.проведен
				
				// Кухарь А.Ю.  12.03.2025 конец
				
				|	И Лист.ШтрихкодБлочка <> &КодАгрегации
				//++Данилова Е.В. 30.05.2025 HELP-5109
				//|ОБЪЕДИНИТЬ ВСЕ
				//|
				//|ВЫБРАТЬ
				//|	ЛистНабора.Ссылка,
				//|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки
				//|ИЗ
				//|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
				//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
				//|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
				//|ГДЕ
				//|	ЛистНабора.ДокОснование = &ДокОснование
				//|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)
				//|	И ЛистНабора.Проведен
				//|   И ЛистНабораШтрихкодыУпаковок.ШтрихкодБлочка = Значение(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
				//|ОБЪЕДИНИТЬ ВСЕ
				//|
				//|ВЫБРАТЬ
				//|	ЛистПереукладки.Ссылка,
				//|	ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки
				//|ИЗ
				//|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистПереукладкиШтрихкодыУпаковок
				//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладки
				//|		ПО ЛистПереукладкиШтрихкодыУпаковок.Ссылка = ЛистПереукладки.Ссылка
				//|ГДЕ
				//|	ЛистПереукладки.ДокОснование = &ДокОснование
				//|	И ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)
				//|	И ЛистПереукладки.Проведен
				//|   И ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодБлочка = Значение(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
				//--Данилова Е.В. 30.05.2025
				|";
				запрос.УстановитьПараметр("КодАгрегации",Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка());
				запрос.УстановитьПараметр("ДокОснование",Ссылка);
				
				ДокМаркировкиОбъект=ДокМаркировки.получитьобъект();
				ДокМаркировкиОбъект.ШтрихкодыКоробок.Загрузить(запрос.Выполнить().Выгрузить()); 
				//++Данилова Е.В. 19.06.2025 HELP-5109 
				Если ДокМаркировкиОбъект.ШтрихкодыКоробок.количество()>0
					ИЛИ ОтсканированыВЛН_ЛП_Агрегаты(Перечисления.ТипыШтрихКодов.Блочок,ссылка) Тогда
					
					БылиБлочки = Истина;
					
				КонецЕсли;
				//Кухарь А.Ю. 14.05.2025 начало
				//если ДокМаркировкиОбъект.ШтрихкодыКоробок.количество()>0 тогда 
				//	БылиБлочки=Истина;            
				//КонецЕсли;
				//Кухарь А.Ю. 14.05.2025 конец
				//--Данилова Е.В. 19.06.2025
				ДокМаркировкиОбъект.ШтрихкодыУпаковок.Очистить();  
				//Кухарь А.Ю.  26.06.2025 начало
				ДокМаркировкиОбъект.Дата = ТекущаяДата(); 
				//Кухарь А.Ю.  26.06.2025 конец
				
				ДокМаркировкиОбъект.Записать();
				
				// Кухарь А.Ю.  06.03.2025 конец
				
			КонецЕсли;
			//++Данилова Е.В. 12.01.2026 MARK-2540  
			//РезультатСоздания=Документы.МаркировкаТоваровИСМП.ЗаполнитьШтрихкодыУпаковокПоЛистамНабора (ДокМаркировки,Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки);
			СтатусыОтработкиОМ = Новый Массив; 
			СтатусыОтработкиОМ.Добавить(Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки);
			СтатусыОтработкиОМ.Добавить(Перечисления.СтатусыДокументовМаркировки.ОшибкаОбработки);
			РезультатСоздания=Документы.МаркировкаТоваровИСМП.ЗаполнитьШтрихкодыУпаковокПоЛистамНабора (ДокМаркировки,Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки,СтатусыОтработкиОМ);
			//--Данилова Е.В. 12.01.2026 
			если не РезультатСоздания.Успешно тогда
				СообщитьИзМодуля(СтрСоединить(РезультатСоздания.Ошибки,","));
				ЗаписатьВЛог("Отладка","Ошибка заполнений агрегаций по РНК "+Номер+". Заполнение агрегации "+ДокМаркировки+". Тип - "+Выборка.ТипШК
				+". Ошибка - "+СтрСоединить(РезультатСоздания.Ошибки,","),"Информация");					
				отказ=Истина;  
			иначе
				ЗаписатьВЛог("Отладка","Функция заполнения агрегации вернула успешное заполнений агрегаций по РНК "+Номер+". Заполнение агрегации "+ДокМаркировки+". Тип - "+Выборка.ТипШК,"Информация");
			КонецЕсли;	
			
		КонецЦикла;
		если ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияКоробок и не БылиКороба тогда
			Сообщить("Не найдено агрегаций коробов");
			Отказ=Истина;
		КонецЕсли;	
		
		если ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияБлочков и не БылиБлочки тогда
			Сообщить("Не найдено агрегаций блочков");
			Отказ=Истина;
		КонецЕсли;	
	КонецЕсли;
	
	//Валетов + 26,03,2025  
	//ПустаяЗадача. Проверка количества агрегированного товара и количества штук в накладной
	// 03,04,2025 добавлено запись в регистр СтатусыЗаказаМарокДляДокументов  
	СтатусЧЗДляРегистра = "";
	Если (СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена ИЛИ СостояниеНакладной = Перечисления.СостоянияНакладной.ГотоваКОтгрузке)
		и (НачСостНакладной <> Перечисления.СостоянияНакладной.Отгружена ИЛИ НачСостНакладной <> Перечисления.СостоянияНакладной.ГотоваКОтгрузке)
		//Обходят проверку как-то Закоментировал еще в "ИначеЕсли"
		//	И Модифицированность()  
		И ТребуетсяМаркировка
		и ПараметрыСеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.Склад Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ //ПЕРВЫЕ 1  //Данилова Е.В. 06.10.2025 HELP-7334
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки) КАК КоличествоШтрихкодовУпаковки,
		//Валетов + 10,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8820
		|	КОЛИЧЕСТВО(МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки) КАК КоличествоШтрихкодовУпаковкиОбщ, 
		//Валетов - 
		//++Данилова Е.В. 06.10.2025 HELP-7334
		//|	МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка.ДокументОснование.КоличествоДокумента КАК КоличествоРНК,
		//--Данилова Е.В. 06.10.2025 HELP-7334
		|	МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка.ДокументОснование КАК РНК//, 
		//++Данилова Е.В. 06.10.2025 HELP-7334
		//	|	МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка КАК Ссылка 
		//--Данилова Е.В. 06.10.2025
		|ИЗ
		|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
		|ГДЕ
		|	МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка.ДокументОснование = &Док
		|	И МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка.Проведен
		|	И МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация)
		|	И МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
		|
		|СГРУППИРОВАТЬ ПО 
		//++Данилова Е.В. 06.10.2025 HELP-7334
		//|	МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка.ДокументОснование.КоличествоДокумента,
		//--Данилова Е.В. 06.10.2025 
		|	МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка.ДокументОснование
		//++Данилова Е.В. 06.10.2025 HELP-7334
		//|	МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка
		//--Данилова Е.В. 06.10.2025 HELP-7334
		|
		|УПОРЯДОЧИТЬ ПО
		|	РНК,
		|	КоличествоШтрихкодовУпаковки УБЫВ";
		
		Запрос.УстановитьПараметр("Док", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
		//Проверяем Операцию Маркировки по РНК с максимальным вложением. 
		//++Данилова Е.В. 30.05.2025  HELP-5130
		//КолШКЗаранееАгрегированных = КоличествоШКПоЗаранееСформированнымАгрегациям(ссылка);
		//HELP-5109
		//++Данилова Е.В. 02.04.2026 MARK-3539 
		//КолШКЗаранееАгрегированных = МаркировкаС.КоличествоШКПоЗаранееСформированнымАгрегациям(ссылка);
		КолШКЗаранееАгрегированных = МаркировкаС.КоличествоШКПоЗаранееСформированнымАгрегациямДоГотовоКОтгрузке(ссылка);
		//--Данилова Е.В. 02.04.2026 
		//--Данилова Е.В. 30.05.2025
		
		Пока РезультатЗапроса.Следующий() Цикл
			//++Данилова Е.В. 30.05.2025
			//Если Ссылка.КоличествоДокумента > РезультатЗапроса.КоличествоШтрихкодовУпаковки Тогда 
			Если Ссылка.КоличествоДокумента > (РезультатЗапроса.КоличествоШтрихкодовУпаковки  + КолШКЗаранееАгрегированных) Тогда
				//--Данилова Е.В. 30.05.2025 
				
				//Валетов + 10,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8820
				Если НЕ РезультатЗапроса.КоличествоШтрихкодовУпаковки = РезультатЗапроса.КоличествоШтрихкодовУпаковкиОбщ Тогда
					СообщитьИзМодуля("Количество товаров больше количества марок из-за наличия дублей! Нужно проверить Агрегации!");
					отказ=Истина;
				Иначе 
					//Валетов -	
					СообщитьИзМодуля("Количество товаров больше количества марок в агрегации первого уровня! Нужно проверить Агрегации!");
					отказ=Истина;  
				КонецЕсли;
			Иначе
				СтатусЧЗДляРегистра = Перечисления.СтатусыГотовностиКОтгрузкеЧЗ.ОжиданиеОбработкиЧЗ;
			КонецЕсли;
		КонецЦикла;
		//Если те же условия НО маркировка НЕ требуется	
	ИначеЕсли (СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена ИЛИ СостояниеНакладной = Перечисления.СостоянияНакладной.ГотоваКОтгрузке)
		и (НачСостНакладной <> Перечисления.СостоянияНакладной.Отгружена ИЛИ НачСостНакладной <> Перечисления.СостоянияНакладной.ГотоваКОтгрузке)
		//И Модифицированность()  
		И НЕ ТребуетсяМаркировка
		и ПараметрыСеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.Склад Тогда 
		СтатусЧЗДляРегистра = Перечисления.СтатусыГотовностиКОтгрузкеЧЗ.НеТребуется; 
		//Валетов + 17,09,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5404
	ИначеЕсли СостояниеНакладной = Перечисления.СостоянияНакладной.ОжиданиеОбработкиЧЗ Тогда
		СтатусЧЗДляРегистра = Перечисления.СтатусыГотовностиКОтгрузкеЧЗ.ОжиданиеОбработкиЧЗ;	
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(СтатусЧЗДляРегистра) Тогда 
		НаборЗаписей = РегистрыСведений.СтатусыЗаказаМарокДляДокументов.СоздатьНаборЗаписей();    
		// Кухарь А.Ю. 06.04.2025 начало				
		//НаборЗаписей.Отбор.Документ.Установить(Ссылка);
		НаборЗаписей.Отбор.Накладная.Установить(Ссылка);		 
		// Кухарь А.Ю. 06.04.2025 конец
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Накладная = Ссылка;
			НоваяЗапись.СтатусыЗаказаКодовМаркировки = СтатусЧЗДляРегистра;
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЕсли;	
	//Валетов - 
	
	// Кухарь А.Ю.  13.03.2025 начало
	// Пустая задача
	если не ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияПаллет или ПаллетыОтработаны тогда
		// Кухарь А.Ю.  13.03.2025 конец
		
		РезультатРаботыСХКМ=Документы.ХранилищеКодовМаркировки.Создать_ХКМ_к_РНК(Ссылка);
		если не РезультатРаботыСХКМ.Успешно тогда
			РезультатРаботыСХКМ.Ошибки.Добавить("Не удалось создать хранилище кодов маркировки");
			СообщитьИзМодуля(СтрСоединить(РезультатРаботыСХКМ.Ошибки,","));
			отказ=Истина;	
		КонецЕсли;
	КонецЕсли;
	
	// Кухарь А.Ю.  28.03.2025 начало
	//Упрощённая проверка
	если не ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияПаллет 
		и не ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияКоробок 
		и не ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияБлочков
		//крохин начало 03.04.2025
		//отключить после исправления ошибки, при которой ЛН не равен ЛСК
		И НЕ Склад.ЭтоСкладFBS 
		//крохин конец 03.04.2025
		и ОбщегоНазначения_ПИ.ЭтоУзел_Склад()
		тогда      
		
		
		
		// Кухарь А.Ю. 21.04.2025 начало
		Запрос=новый запрос;  
		запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
		|	ВЫБОР
		|		КОГДА ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоШтука
		|ИЗ
		|	Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок КАК ХранилищеКодовМаркировкиШтрихкодыУпаковок
		|ГДЕ
		|	ХранилищеКодовМаркировкиШтрихкодыУпаковок.Ссылка.ДокОснование = &ДокОснование";
		запрос.УстановитьПараметр("ДокОснование",Ссылка);
		ТаблицаКодов=запрос.Выполнить().Выгрузить();
		МассивТар=ТаблицаКодов.НайтиСтроки(новый Структура("ЭтоШтука",Ложь));  
		если МассивТар.Количество()>0 тогда
			КоличествоШтукВХКМ = Документы.МаркировкаТоваровИСМП.ПолучитьВложенныеКоды(ТаблицаКодов.ВыгрузитьКолонку("ШтрихкодУпаковки")).количество();
		иначе  
			КоличествоШтукВХКМ = ТаблицаКодов.Количество();	
		КонецЕсли;
		// Кухарь А.Ю. 21.04.2025 конец
		
		
		Запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ
		|	Товары.Количество КАК Количество
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	&Товары КАК Товары
		|ГДЕ
		|	Товары.ТребуетсяМаркировка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВТТовары.Количество), 0) КАК КоличествоРНК
		|ИЗ
		|	ВТТовары КАК ВТТовары";
		запрос.УстановитьПараметр("ДокОснование",Ссылка);
		запрос.УстановитьПараметр("Товары",товары.Выгрузить());
		выборка=запрос.Выполнить().Выбрать();
		пока Выборка.Следующий() цикл                  
			// Кухарь А.Ю. 21.04.2025 начало 
			//если Выборка.КоличествоХКМ <> Выборка.КоличествоРНК тогда
			если КоличествоШтукВХКМ <> Выборка.КоличествоРНК тогда		 
				// Кухарь А.Ю. 21.04.2025 конец	
				СообщитьИзМодуля(СтрШаблон("Не сошлось общее количество маркированного товара в РНК %1 и количество кодов в ХКМ %2"
				,Выборка.КоличествоРНК,КоличествоШтукВХКМ));
				// Шворобей ВЮ 19.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5152
				ДополнительныеСвойства.Вставить("ТекстОшибки", СтрШаблон("Не сошлось общее количество маркированного товара в РНК %1 и количество кодов в ХКМ %2"
				,Выборка.КоличествоРНК,КоличествоШтукВХКМ));
				// Шворобей ВЮ 19.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5152
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// Кухарь А.Ю.  28.03.2025 конец
	
	// Кухарь А.Ю. 17.06.2025 начало
	если ВиртуальнаяНакладная тогда
		Отказ = ложь;
	КонецЕсли;
	// Кухарь А.Ю. 17.06.2025 конец
	
	
	
	Возврат не Отказ;
	
КонецФункции 
// Кухарь А.Ю.  24.02.2025 конец

//Катаев+ 24/04/13 Процедуры и функции для формирования уведомления
Функция ЗаменитьТочку(ИсхЧисло,КолПослеЗапятой)
	
	//Катаев+ 19/12/14
	//СтрокаЧ=Формат(ИсхЧисло,"ЧДЦ="+КолПослеЗапятой+"");
	СтрокаЧ=Формат(ИсхЧисло,"ЧДЦ="+КолПослеЗапятой+"; ЧН=");
	//Катаев- 19/12/14
	СтрокаЧ=Строка(СтрокаЧ);
	СтрокаЧ= СтрЗаменить(СтрокаЧ,",",".");
	
	Возврат СтрокаЧ;
	
КонецФункции

Функция ПолучитьИЛН_Пост(Склад)
	Если Склад.ТипСклада = Перечисления.ТипСклада.Филиал ТОгда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ИЛН_Организации.Наименование
		|ИЗ
		|	Справочник.ИЛН_Организации КАК ИЛН_Организации
		|ГДЕ
		|	ИЛН_Организации.Узел.Подразделение = &Подразделение";
		Запрос.УстановитьПараметр("Подразделение", Склад.Подразделение);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Наименование;
		Иначе
			Возврат "4607182079990EC";
		КонецЕсли;
	Иначе
		Возврат "4607182079990EC";
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция ПолучитьПутьДляУвед(Путь)
	Пути = НайтиФайлы(Путь,"DESADV_*");
	Кол = Пути.Количество();
	Если Кол = 0 Тогда
		Возврат Неопределено;
	Иначе
		//Возврат Пути[кол-1].ПолноеИмя;
		
		//нечаева 12,03,20 ++
		Путь1 =  Пути[кол-1].Имя; //Пути[кол-1].ПолноеИмя;
		
		ПутьН = СтрНайти(Путь1,"DESADV_ALCO");
		Если ПутьН = 1 и Кол = 2 Тогда
			возврат Пути[кол-2].ПолноеИмя;
		иначе
			возврат Пути[кол-1].ПолноеИмя;
		КонецЕсли;	
		
		Возврат Неопределено;
		//нечаева 12,03,20 --
		
	КонецЕсли;
КонецФункции



//нечаева 21,04,17+++
Функция ПолучитьПутьДляУведИнвойс(Путь)
	Пути = НайтиФайлы(Путь,"DELIVERYNOTE_*"); //накладная для Холидей
	Кол = Пути.Количество();
	Если Кол = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Пути[кол-1].ПолноеИмя;
	КонецЕсли;
КонецФункции

//нечаева 21,04,17---



//Катаев+ 29/10/14
Функция ПолучитьПутьДляПодтвержедния(Путь)
	Пути = НайтиФайлы(Путь,"ORDERRSP_*");
	Кол = Пути.Количество();
	Если Кол = 0 Тогда
		//нечаева 11,10,19++
		Пути = НайтиФайлы(Путь,"ORDRSP_*");
		Кол = Пути.Количество();
		Если Кол = 0 Тогда
			
			Возврат Неопределено;
		иначе
			Возврат Пути[кол-1].ПолноеИмя;
			
		конецЕсли;
		//нечаева 11,10,19---
	Иначе
		Возврат Пути[кол-1].ПолноеИмя;
	КонецЕсли;
КонецФункции

// нечаева 09,09,24 ++ для Ленты дополнение 
Процедура СформироватьПодтверждениеЗаказа(ТзЗаказ, Ошибка, Провайдер) экспорт
	
	
	//нечаева 28,10,15+++		
	// берем первый для шапки, а потом общий собираем	
	ДокОбъект = ТЗЗаказ[0].документ.ссылка;     //++++++++++++++++++++++ меняем для сборки в один заказ.
	
	//нечаева 18,05,21+++
	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Кухарь А.Ю. 31.03.2026 начало
	// Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом тогда
	Если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() тогда
		//Кухарь А.Ю. 31.03.2026 конец      
		ЗаписатьВЛог("ОшибкиЕкод","Отмена выполнения. подтверждение не создано "+ДокОбъект+" база "+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
		
		ошибка=1;
		
		Возврат ;
	КонецЕсли;
	//  нечаева 18,05,21----
	
	// нечаева 130121 ++
	КаталогЕкода = Константы.КаталогЕКОД.Получить(); //\\SRVECOD\SFERAConnector2\EDI\ 
	// нечаева 130121---
	Если ПустаяСтрока(ДокОбъект.Контрагент.Родитель.КодИЛН) Тогда
		ИЛНПок =  ДокОбъект.Контрагент.КодИЛН;
	Иначе
		ИЛНПок =  ДокОбъект.Контрагент.Родитель.КодИЛН;
	КонецЕсли;
	
	
	ИЛНПост = "4607182079990WS";
	
	// нечаева 19,04,2023+++   единая
	Если ДокОбъект.организация.код = "SS-001" Тогда
		ИЛНПост = "4607182079990EC";
		
		//Нечаева 09,10,19+++
		Если Провайдер = 3 Тогда
			//ИЛНПост = "4607182079990";
			ИЛНПост = "4607182079990WS";
			
		КонецЕсли;
		//Нечаева 09,10,19---
	ИначеЕсли ДокОбъект.организация.код = "SSP-99" Тогда    // бтк
		
		ИЛНПост = "4607196338601WS";
		
	КонецЕсли;
	// нечаева 19,04,2023---
	
	// нечаева 04,03,24++
	КодКонтрагента = ДокОбъект.Контрагент.код;
	// нечаева 04,03,24--
	
	//Нечаева 20,03,17+++
	НомЗ = СтрЗаменить(СокрЛП(ДокОбъект.НомерЗаказа), "/", "_");		
	НомЗ = СтрЗаменить(НомЗ, "\", "_");		
	НомЗ = СтрЗаменить(НомЗ, "-", "_");		
	НомЗ = СтрЗаменить(НомЗ, " ", "_");		
	//Нечаева 20,03,17---
	НомРНК = СтрЗаменить(ДокОбъект.номер, "-", "_");
	//Катаев+ 14/11/14
	Если Провайдер = 0 или Провайдер = 3  Тогда
		Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
			
			// для метрополиса -  нечаева 17.12,25 +++  HELP-8244
			Если докОбъект.контрагент.код = "CHF-0200" Тогда
				ИЛНПок="4680014029103";
			КонецЕсли;
			
			
			Если докОбъект.контрагент.родитель.код = "SSR-4144" Тогда
				ИЛНПок="9777992579999";
			КонецЕсли;
			// для метрополиса -  нечаева 17.12,25 ---  HELP-8244
			
			
			
			ПутьДляУвед = ПолучитьПутьДляПодтвержедния(КаталогЕкода+ИЛНПост+"\"+ИЛНПок+"\OUT\");
			//Нечаева 15,03,18+++
			// Для Хорошего дня - магнолия
			Если ПутьДляУвед = Неопределено и (ИЛНПок = "9777992536626" или ДокОбъект.Контрагент.Родитель.код = "SMN-7541") ТОгда
				//   9777992579999 - корневой для Магнолии
				ПутьДляУвед = ПолучитьПутьДляПодтвержедния(КаталогЕкода+ИЛНПост+"\9777992579999\OUT\");
				
			КонецЕсли;		   
			//Нечаева 15,03,18---
			
			//Нечаева 01,11,2021+++
			// Для Еврологистик ТС Лама
			Если ПутьДляУвед = Неопределено и (ИЛНПок = "4620020788939" или ДокОбъект.Контрагент.Родитель.код = "SSR-6974") ТОгда
				//   9777992579999 - корневой для Магнолии
				ПутьДляУвед = ПолучитьПутьДляПодтвержедния(КаталогЕкода+ИЛНПост+"\4620020789998\OUT\");
				
			КонецЕсли;		   
			//Нечаева 101,11,2021---
			
			// 4680021979996 шагдарова ТС Абсолют			
			Если ПутьДляУвед = Неопределено и (ИЛНПок = "4680021979989" или КодКонтрагента = "SSR-9771") ТОгда
				
				ПутьДляУвед = ПолучитьПутьДляПодтвержедния(КаталогЕкода+ИЛНПост+"\4680021979996\OUT\");
				
			КонецЕсли;		   
			//Нечаева 25,10,23 ---
			
			// Для метро 11,11,2025 +++ HELP-6823
			Если ПутьДляУвед = Неопределено и (ИЛНПок = "4607070198888" или кодКонтрагента = "SSP-8643") ТОгда
				ПутьДляУвед = ПолучитьПутьДляПодтвержедния(КаталогЕкода+ИЛНПост+"\4607070199991\OUT\");
				
			КонецЕсли;		   
			//Нечаева 11,11,25 ---
			
			
			
			// 4630031839995 ОА гуливер	тк лето, нечаева 17,02,25		
			Если ПутьДляУвед = Неопределено и (ИЛНПок = "4670142219996" или КодКонтрагента = "SSR-9519") ТОгда
				
				//ПутьДляУвед = ПолучитьПутьДляПодтвержедния(КаталогЕкода+ИЛНПост+"\4630031839995\OUT\");
				
				
				// нечаева 05,09,25 +++ с 5 августа поменялась папка получения заказов??? корус что-то перенастроил у себя?
				ПутьДляУвед = ПолучитьПутьДляПодтвержедния(КаталогЕкода+ИЛНПост+"\1111111111133\OUT\");
				// нечаева 05,09,25 ---
				
				
				
			КонецЕсли;		   
			//Нечаева 17,02,25 ---
			
			
			// гипербола	нечаева 28,08,25		
			Если ПутьДляУвед = Неопределено и (ИЛНПок = "4607196385179" или КодКонтрагента = "EKF-1384") ТОгда
				
				ПутьДляУвед = ПолучитьПутьДляПодтвержедния(КаталогЕкода+ИЛНПост+"\4607968939999\OUT\");
				
			КонецЕсли;		   
			//Нечаева 28,08,25 ---
			
			
			
			
			Если ПутьДляУвед = Неопределено ТОгда
				Если КодКонтрагента <> "SSP-4991" Тогда
					#Если клиент Тогда
						Сообщить( Строка(ДокОбъект)+" - не удалось определить путь для сохранения файла подтверждения");
					#КонецЕсли
				конецЕсли;
				ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - не удалось определить путь для сохранения файла подтверждения","Важное");
				Ошибка = 1;
				Возврат;
			КонецЕсли;
			
			
			ИмяФайлаОбмена = ПутьДляУвед+"\Пз_"+СокрЛП(ДокОбъект.Номер)+".xml";
		Иначе
			Если ДокОбъект.Склад.КодФизическогоУзла <> ПланыОбмена.Основной.ЭтотУзел().Код Тогда
				Ошибка = 1;
				Возврат;
			КонецЕсли;
			
			// для метрополиса -  нечаева 24,07,25 +++
			Если докОбъект.контрагент.код = "CHF-0200" Тогда
				ИЛНПок="4680014029103";
			КонецЕсли;
			
			
			Если докОбъект.контрагент.родитель.код = "SSR-4144" Тогда
				ИЛНПок="9777992579999";
			КонецЕсли;
			
			
			ИмяФайлаОбменаФТП = "Пз_"+СокрЛП(НомЗ)+"_"+номРНК+".xml";
			УзелЦО = ПланыОбмена.Основной.НайтиПоКоду("SNL");
			
			
			//нечаева 13,12,18+++
			//КаталогFTP = ПолучитьПутьДляПодтвержедния("\\srvecode\EdiConnector2\ediECOD\"+ИЛНПост+"\"+ИЛНПок+"\OUT\");
			//для филиала нечаева 170122 +++
			КаталогFTP = ПолучитьПутьДляПодтвержедния(КаталогЕкодаФТП+ИЛНПост+"\"+ИЛНПок+"\OUT\");
			//нечаева 170222 ---
			//нечаева 13,12,18+++
			
			Если КаталогFTP = Неопределено ТОгда
				ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - не удалось определить путь для сохранения файла подтверждения","Важное");
				Ошибка = 1;
				Возврат;
			КонецЕсли;
			
			////05,12,16---
			ИмяФайлаОбмена = КаталогFTP+"\Пз_"+СокрЛП(ДокОбъект.НомерЗаказа)+".xml";
			//нечаева 12,09,17--
			
		КонецЕсли;
	Иначе //Для СКБ-Контур
		Если ПланыОбмена.Основной.ЭтотУзел() <> ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
			Если ДокОбъект.Склад.КодФизическогоУзла <> ПланыОбмена.Основной.ЭтотУзел().Код Тогда
				Ошибка = 1;
				Возврат;
			КонецЕсли;
		КонецЕсли;
		КаталогFTP="Outbox";
		// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
		//ПользовательFTP="*%*%*%";
		//ПарольFTP="*$*$*$";
		ПользовательFTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКFTPКонтур).Логин;
		ПарольFTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКFTPКонтур).Пароль;
		// Ихсанов Д. А. Конец  14.10.2025
		АдресFTP = "ftp-edi.kontur.ru";
		Соединение=УстановитьFTPСоединение(АдресFTP,ПользовательFTP,ПарольFTP,,Истина);
		Если Соединение=Неопределено Тогда
			Сообщить("Невозможно установить соединение с ftp");
			Ошибка = 1;
			Возврат;
		КонецЕсли;
		Соединение.УстановитьТекущийКаталог(КаталогFTP);
		//ИмяФайлаОбменаФТП = "Пз_"+ДокОбъект.НомерЗаказа+".xml";
		
		//Нечаева 20,03,17+++
		НомЗ = СтрЗаменить(СокрЛП(ДокОбъект.НомерЗаказа), "/", "");
		ИмяФайлаОбменаФТП = "Пз_"+НомЗ+".xml";
		//ИмяФайлаОбмена = "C:\TempSKB\"+"Пз_"+НомЗ+"_.xml";
		ИмяФайлаОбмена = КаталогВременныхФайлов()+"Пз_"+НомЗ+"_.xml";
		//Нечаева 20,03,17+++
		
	КонецЕсли;
	//Катаев- 14/11/14
	//Нечаева 20,03,17+++                       //нечаева 03,10,17+++
	ВремФайл = КаталогВременныхФайлов()+"Пз_"+СокрЛП(НомЗ)+".xml";
	//Нечаева 20,03,17---                       //нечаева 03,10,17---
	
	
	ЗаписьХМЛ=Новый ЗаписьXML;
	ЗаписьХМЛ.ОткрытьФайл(ВремФайл);
	ДокументДом=Новый ДокументDom("","Document-OrderResponse");
	КорневойЭлемент=ДокументДом.ЭлементДокумента;
	//----------------------------------------------------------------
	ЭлементДом=ДокументДом.СоздатьЭлемент("OrderResponse-Header");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	//----------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("OrderResponseNumber");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	//Катаев+ 19/12/14
	//текстДом=ДокументДом.СоздатьТекстовыйУзел("Пз_"+ДокОбъект.НомерЗаказа);
	текстДом=ДокументДом.СоздатьТекстовыйУзел("Пз_"+ДокОбъект.НомерЗаказа);     // нечаева 21,01,15
	//Катаев- 19/12/14
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	//----------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("OrderResponseDate");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	ДатаДок=Формат(ДокОбъект.Дата, "ДФ=""гггг-ММ-дд""");
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаДок));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	
	
	//----------------------------------------------------------------
	//нечаева 08,07,19+++
	Элемент2=ДокументДом.СоздатьЭлемент("OrderResponseTime");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	
	ВремяДок2=Формат(ТекущаяДата(), "ДФ=""ЧЧ:мм""");
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ВремяДок2));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	//нечаева 08,07,19--
	//----------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("ExpectedDeliveryDate");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	Если ДокОбъект.ДатаПриемки = Дата(1,1,1) Тогда
		ДатаДок2=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""гггг-ММ-дд""");
	Иначе
		ДатаДок2=Формат(ДокОбъект.ДатаПриемки, "ДФ=""гггг-ММ-дд""");
	КонецЕсли;
	
	// для Тандера, если есть др дата, то берем ее.
	//28,01,25++++
	Если КодКонтрагента = "SSP-3881" и ДокОбъект.Дата>Дата(25,01,26) ТОгда
		ПоискНомера=новый Запрос;
		ПоискНомера.Текст="ВЫБРАТЬ
		|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита КАК приемка
		|ИЗ
		|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
		|ГДЕ
		|	РеквизитыРНКПНКПРМ.Документ = &Документ
		|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = &ИмяРеквизита";
		ПоискНомера.УстановитьПараметр("Документ", ДокОбъект.ссылка);
		ПоискНомера.УстановитьПараметр("ИмяРеквизита","ДатаПриемкиПоЗаказу");
		СписокНомеров=ПоискНомера.Выполнить().Выбрать();
		
		Пока СписокНомеров.Следующий() Цикл
			
			ДатаДок2= Формат(СписокНомеров.приемка, "ДФ=""гггг-ММ-дд""");   //""+СокрЛП(СписокНомеров.приемка);
			
		КонецЦикла;
	КонецЕсли;
	//нечаева 28,01,25 +---	
	
	
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаДок2));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	//----------------------------------------------------------------
	
	// 21,01,15 +++  нечаева добавила отработку пустого времени
	ВремяДок22="";
	//Кухарь 10.02.16 начало	
	//Сначала будет проверятся нет ли времени доставки на конкретно эту накладную
	//Если ДокОбъект.ПунктДоставки.ВремяДоставки = Неопределено Тогда
	ВремяДоставки=ПолучитьВремяПриемки(ДокОбъект.ссылка);
	если ВремяДоставки=Справочники.ВремяПриемки.ПустаяСсылка() или ВремяДоставки=Неопределено тогда
		ВремяДоставки		=ДокОбъект.ПунктДоставки.ВремяДоставки;
	КонецЕсли;		
	Если ВремяДоставки = Справочники.ВремяПриемки.ПустаяСсылка() Тогда 
		//Кухарь 10.02.16 конец	
		ВремяДок22=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""ЧЧ:мм""");
	Иначе
		//Кухарь 10.02.16 начало
		//Время доставки может быть не из пункта доставки
		//ВремяДок22=Формат(ДокОбъект.ПунктДоставки.ВремяДоставки.КонецПериода1, "ДФ=""ЧЧ:мм""");
		ВремяДок22=Формат(ВремяДоставки.КонецПериода1, "ДФ=""ЧЧ:мм""");
		//Кухарь 10.02.16 конец
	КонецЕсли;
	//Если ВремяДок2="" Тогда 
	//	ВремяДок2 = "00:00";
	//конецЕсли;
	
	Если КодКонтрагента = "SSP-1973" Тогда
		Если СокрЛП(ВремяДок22)="" Тогда 
			//	ВремяДок2 = "00:00";
			ВремяДок22=Формат(ТекущаяДата(), "ДФ=""ЧЧ:мм""");
		конецЕсли;
	иначе
		Если СокрЛП(ВремяДок22)="" Тогда 
			ВремяДок22 = "00:00";
		конецЕсли;
	конецЕсли;
	// бигбокс не берем
	Если Не КодКонтрагента = "SSR-6841" Тогда
		
		Элемент2=ДокументДом.СоздатьЭлемент("ExpectedDeliveryTime");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ВремяДок22));
		ТекУзел2.ДобавитьДочерний(ТекстДом);
		
	КонецЕсли;
	
	
	
	//----------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("OrderNumber");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(СокрЛП(ДокОбъект.НомерЗаказа));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("OrderDate");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	ДатаДок=Формат(ДокОбъект.ДатаЗаказа, "ДФ=""гггг-ММ-дд""");
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаДок));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("ResponseType");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	тз = ДокОбъект.Товары.Выгрузить();
	СтатусДок = "29";
	Для Каждого стр из тз Цикл
		Если стр.Заявка <> стр.Количество Тогда
			СтатусДок = "4";
			Прервать;
		КонецЕсли;
	КонецЦикла;
	текстДом=ДокументДом.СоздатьТекстовыйУзел(СтатусДок);
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	//нечаева 23,01,15 +++ добавила строки 
	//------------------------------------------------------------
	если КодКонтрагента = "CHF-0006" Тогда
		Элемент2=ДокументДом.СоздатьЭлемент("Remarks");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(строка("Звк"));
		ТекУзел2.ДобавитьДочерний(ТекстДом);
	КонецЕсли;
	
	
	// нечаева 12,04,18+++
	// для Х5 в комментарий нужно писать причину недопоставки.
	Если контрагент.родитель.код = "SSR-4117" Тогда
		
		ПрНедопоставки=ПрочитатьЗначениеРеквизитаПНКПРМРНК("ПричинаНедопоставки",ЭтотОбъект.Ссылка);
		попытка
			Если ПрНедопоставки<>"" и ПрНедопоставки<>Неопределено Тогда
				// нам нужна только часть с кодом. 
				//нечаева 30,01,19+++
				Пр2 = Найти(ПрНедопоставки," ");
				Пр_н  = СокрЛП(Лев(ПрНедопоставки,Пр2));
				//нечаева 30,01,19---
				
				Элемент2=ДокументДом.СоздатьЭлемент("Remarks");
				ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(Пр_Н));
				ТекУзел2.ДобавитьДочерний(ТекстДом);
			КонецЕсли;
		исключение
		конецПопытки;
	КонецЕсли;
	
	//-------------------Заполнение ГЛН-------------------------------
	ЭлементДом=ДокументДом.СоздатьЭлемент("OrderResponse-Parties");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	//----------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("Buyer");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	КодИЛН=ДокОбъект.Контрагент.КодИЛН;
	
	
	// для Ашана
	//нечаева 08,07,19+++	
	Если КодКонтрагента = "SSP-2450" ТОгда
		ПоискНомера=новый Запрос;
		ПоискНомера.Текст="ВЫБРАТЬ
		|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита КАК приемка
		|ИЗ
		|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
		|ГДЕ
		|	РеквизитыРНКПНКПРМ.Документ = &Документ
		|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = &ИмяРеквизита";
		ПоискНомера.УстановитьПараметр("Документ", ЭтотОбъект.ссылка);
		ПоискНомера.УстановитьПараметр("ИмяРеквизита","GLNпокупателя");
		СписокНомеров=ПоискНомера.Выполнить().Выбрать();
		
		Пока СписокНомеров.Следующий() Цикл
			
			КодИЛН= ""+СписокНомеров.приемка;
			
		КонецЦикла;
	КонецЕсли;
	//нечаева 08,07,19 +---	
	
	
	
	
	Элемент3=ДокументДом.СоздатьЭлемент("ILN");
	ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(КодИЛН));
	ТекУзел3.ДобавитьДочерний(ТекстДом);
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("Seller");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	Элемент3=ДокументДом.СоздатьЭлемент("ILN");
	ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(Лев(ИЛНПост,13));
	ТекУзел3.ДобавитьДочерний(ТекстДом);
	
	
	//нечаева 24,10,24+++ ашан поменял коды 
	Если КодКонтрагента = "SSP-2450" ТОгда
		Если ДокОбъект.Дата<Дата(2024,10,21) ТОгда
			
			Элемент3=ДокументДом.СоздатьЭлемент("CodeByBuyer");
			ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(""+Строка(ДокОбъект.КодПоставщика)+"005"));
			ТекУзел3.ДобавитьДочерний(ТекстДом);
		иначе
			Элемент3=ДокументДом.СоздатьЭлемент("CodeByBuyer");
			ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка("000"+Строка(ДокОбъект.КодПоставщика)));
			ТекУзел3.ДобавитьДочерний(ТекстДом);
		КонецЕсли;
		
	КонецЕсли;
	//нечаева 24,10,24---
	
	
	
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("DeliveryPoint");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	Элемент3=ДокументДом.СоздатьЭлемент("ILN");
	ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
	КодИЛН=ДокОбъект.ПунктДоставки.КодИЛН;
	// нечаева 27,01,25 для Тандера из другого поля берем.
	Если КодКонтрагента = "SSP-3881" и ДокОбъект.Дата>Дата(25,01,26) ТОгда
		ПоискНомера=новый Запрос;
		ПоискНомера.Текст="ВЫБРАТЬ
		|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита КАК приемка
		|ИЗ
		|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
		|ГДЕ
		|	РеквизитыРНКПНКПРМ.Документ = &Документ
		|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = &ИмяРеквизита";
		ПоискНомера.УстановитьПараметр("Документ", ЭтотОбъект.ссылка);
		ПоискНомера.УстановитьПараметр("ИмяРеквизита","GLN");
		СписокНомеров=ПоискНомера.Выполнить().Выбрать();
		
		Пока СписокНомеров.Следующий() Цикл
			
			КодИЛН= ""+СокрЛП(СписокНомеров.приемка);
			
		КонецЦикла;
	КонецЕсли;
	//нечаева 27,01,25 +---	
	
	текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(КодИЛН));
	ТекУзел3.ДобавитьДочерний(ТекстДом);
	//-----------------Заполнение товара------------------------------
	ЭлементДом=ДокументДом.СоздатьЭлемент("OrderResponse-Lines");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	
	
	//нечаева 28,10,15+++
	//28,10,15++++
	// теперь ТЗ - список из документов из таблицы значений
	ЗапросТЗ = Новый Запрос;
	ЗапросТЗ.Текст = "ВЫБРАТЬ
	|	РасходнаяНакладнаяТовары.Ссылка,
	|	РасходнаяНакладнаяТовары.НомерСтроки,
	|	РасходнаяНакладнаяТовары.Номенклатура,
	|	РасходнаяНакладнаяТовары.Количество,
	|	РасходнаяНакладнаяТовары.Единица,
	|	РасходнаяНакладнаяТовары.Коэффициент,
	|	РасходнаяНакладнаяТовары.ЦенаБезСкидки,
	|	РасходнаяНакладнаяТовары.Цена,
	|	РасходнаяНакладнаяТовары.Сумма,
	|	РасходнаяНакладнаяТовары.Объем,
	|	РасходнаяНакладнаяТовары.СтавкаНДС,
	|	РасходнаяНакладнаяТовары.НДС,
	|	РасходнаяНакладнаяТовары.Всего,
	|	РасходнаяНакладнаяТовары.ВсегоБезСкидки,
	|	РасходнаяНакладнаяТовары.Скидка,
	|	РасходнаяНакладнаяТовары.ПодтвержденнаяЗаявка,
	|	РасходнаяНакладнаяТовары.Заявка,
	|	РасходнаяНакладнаяТовары.ТипЦен,
	|	РасходнаяНакладнаяТовары.ЦенаПосредника,
	|	РасходнаяНакладнаяТовары.ЦенаБезБонуса,
	|	РасходнаяНакладнаяТовары.ВсегоБезБонуса
	|ИЗ
	|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	|ГДЕ
	|	РасходнаяНакладнаяТовары.Ссылка В ИЕРАРХИИ(&ТЗЗаказы)";
	//ТЗЗаказ = Новый ТаблицаЗначений;				 
	СписокЗаказов = ТЗЗаказ.ВыгрузитьКолонку("Документ");				 
	ЗапросТЗ.УстановитьПараметр("ТЗЗаказы",СписокЗаказов);
	ТЗ = ЗапросТЗ.Выполнить().Выгрузить();
	
	//было 
	//тз = ДокОбъект.Товары.Выгрузить();
	//нечаева 28,10,15---
	
	
	
	//Нечаева 05,04,18 +++
	//для экспозиторов по Тандеру
	запрос=новый Запрос;
	запрос.Текст="ВЫБРАТЬ
	|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита как Экспозитор
	|ИЗ
	|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
	|ГДЕ
	|	РеквизитыРНКПНКПРМ.Документ = &Документ
	|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = ""Экспозитор"""; 
	запрос.УстановитьПараметр("Документ",ДокОбъект.ссылка);
	результат=запрос.Выполнить().Выбрать();
	если результат.Количество()>0 тогда
		Результат.Следующий();
		ТЗЭксп = ПолучитьТаблицуНакладнойТандерЭкспозиторы("СФ",ссылка,Результат.Экспозитор);
		СтрЭксп = ТЗЭксп[0];
		ТЗ.Очистить();
		// заполним по экспозитору их.
		НСтр = ТЗ.Добавить();
		Нстр.Ссылка= Ссылка;
		
		Нстр.НомерСтроки = 1;
		Нстр.Номенклатура = Результат.Экспозитор;
		НСтр.количество = СтрЭксп.количество;
		НСтр.Заявка = СтрЭксп.количество;
		НСтр.ПодтвержденнаяЗаявка = СтрЭксп.количество;
		НСтр.Единица = СтрЭксп.Единица; 
		НСтр.Коэффициент = 1;
		НСтр.Цена = Окр(СтрЭксп.Цена,2);
		НСтр.ЦенаБезСкидки = Окр(СтрЭксп.Цена,2);
		НСтр.Сумма = Окр(СтрЭксп.Сумма,2);
		//	НСтр.Объем = СтрЭксп.Объем;
		НСтр.ставкаНДС =ПолучитьРеквизитРодителя(НСтр.Номенклатура,"СтавкаНДС");
		НСтр.НДС = Окр(СтрЭксп.НДС,2);
		НСтр.ВсегоБезСкидки = Окр(СтрЭксп.Всего,2);
		НСтр.Всего =  Окр(СтрЭксп.Всего,2);
		НСтр.Скидка = 0;
		
		
	КонецЕсли;	
	
	//Нечаева 05,04,18 ---
	
	
	тз.Колонки.Добавить("ШККонтрагента");
	тз.Колонки.Добавить("АртикулКонтрагента");
	тз.Колонки.Добавить("НаименованиеКонтрагента");
	тз.Колонки.Добавить("Кратность");
	тз.Колонки.Добавить("КратностьКоробки");
	
	
	
	//-----------------------------------------------------------------------------------------------------------------------------
	
	//нечаева 26,04,18+++ 	
	тз1 = ПолучитьАртикулыМатрицы(ДокОбъект);
	//нечаева 26,04,18---
	
	Для Каждого ТекСтрока Из тз Цикл
		Если ТекСтрока.Количество=0 И КодКонтрагента <> "SSP-1973"
			//нечаева 10,12,20+++
			и КодКонтрагента <> "SSR-3546"
			//нечаева 10,12,20---
			Тогда
			Продолжить;
		КонецЕсли; 
		ШКПоМатрице=НЕопределено;
		АртикулПоМатрице=НЕопределено;
		//НайденнаяСтрока = тз1.Найти(ТекСтрока.Номенклатура,"Номенклатура");
		//нечаева 25,10,23 +++
		попытка
			НайденнаяСтрока = тз1.Найти(ТекСтрока.Номенклатура,"Номенклатура");
		исключение
			НайденнаяСтрока = неопределено;
		конецПопытки;
		//нечаева 25,10,23 ---
		Если НайденнаяСтрока <> Неопределено ТОгда
			Если ПустаяСтрока(НайденнаяСтрока.ШККонтрагентаБлочок) Тогда
				ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагента;
			Иначе
				ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагентаБлочок;
			КонецЕсли;
			
			//270520 нечаева ++  окей шк штуки всегда
			Если КодКонтрагента = "SSP-5862" Тогда
				ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагента;
			КонецЕсли;
			
			
			//для тандера нечаева 10,07,17 +++
			Если НЕ ПустаяСтрока(НайденнаяСтрока.ШКСпайки) Тогда
				ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШКСпайки;
			КонецЕсли;
			//нечаева 10,07,17 ---
			
			ТекСтрока.АртикулКонтрагента = НайденнаяСтрока.АртикулКонтрагента;
			ТекСтрока.НаименованиеКонтрагента = НайденнаяСтрока.НаименованиеКонтрагента;
			ТекСтрока.Кратность = Число(НайденнаяСтрока.Кратность);
			ТекСтрока.КратностьКоробки = Число(НайденнаяСтрока.КратностьКоробки);
			
			// для молнии поставим отдельную проверку!!
			Если НЕ ОбменДанными.Загрузка Тогда	
				Если СокрЛП(ТекСтрока.АртикулКонтрагента) = "" и  КодКонтрагента = "CHF-0006" Тогда
					Сообщить("В номенклатурной матрице"+ НайденнаяСтрока.Ссылка+" не найден артикул номенклатуры - "+ТекСтрока.Номенклатура,СтатусСообщения.Важное);
					Ошибка = 1;
				КонецЕсли;
			конецесли;
		Иначе
			//Сообщить("В номенклатурной матрице не найдена номенклатура "+ТекСтрока.Номенклатура);
			//нечаева 26,02,15 ++
			Если НЕ ОбменДанными.Загрузка Тогда	
				Сообщить("В номенклатурной матрице не найдена номенклатура "+ТекСтрока.Номенклатура);
			конецесли ;
			//нечаева 26,02,15 ++
			
			Ошибка = 1;
		КонецЕсли;
	КонецЦикла;
	Если Ошибка = 1 Тогда
		//Нечаева 18,03,15+++ 
		Если НЕ ОбменДанными.Загрузка Тогда	
			сообщить("Документ Подтверждение заказа не выгружен на сайт, поправьте матрицу!!!");
		конецесли ;
		//Нечаева 18,03,15 ---
		Возврат;
	КонецЕсли;
	//-----------------------------------------------------------------------------------------------------------------------------
	//Нечаева 18,03,15 ---
	РР=1;
	
	//Нечаева 10,07,17 +++ для тандера сворачиваем по спайкам, 
	
	ТЗАртикулы = новый ТаблицаЗначений;
	Если КодКонтрагента = "SSP-3881" 
		или докОбъект.контрагент.код = "CHF-0200"  // метрополис Нечаева 24,07,25 +++
		
		Тогда
		
		
		ТЗАртикулы = ТЗ.скопировать();
		ТЗАртикулы.свернуть("ШККонтрагента,АртикулКонтрагента,Цена,СтавкаНДС,НаименованиеКонтрагента,Кратность,КратностьКоробки","заявка,количество,Всего,Сумма,НДС");
		ТЗАртикулы.колонки.добавить("Номенклатура");  //??? нужно ли 
		
		
		Для Каждого ТекСтрока Из тзАртикулы Цикл
			
			ШКПоМатрице=НЕопределено;
			АртикулПоМатрице=НЕопределено;
			НайденнаяСтрока = тз1.Найти(ТекСтрока.АртикулКонтрагента,"АртикулКонтрагента");
			Если НайденнаяСтрока <> Неопределено ТОгда
				//Если ПустаяСтрока(НайденнаяСтрока.ШККонтрагентаБлочок) Тогда
				//	ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагента;
				//Иначе
				//	ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагентаБлочок;
				//КонецЕсли;
				//	ТекСтрока.АртикулКонтрагента = НайденнаяСтрока.АртикулКонтрагента;
				//	ТекСтрока.НаименованиеКонтрагента = НайденнаяСтрока.НаименованиеКонтрагента;
				ТекСтрока.Кратность = Число(НайденнаяСтрока.Кратность);
				ТекСтрока.КратностьКоробки = Число(НайденнаяСтрока.КратностьКоробки);
				ТекСтрока.Номенклатура = НайденнаяСтрока.Номенклатура;
			Иначе
				
			КонецЕсли;
			
		КонецЦикла;
		
		
		
	КонецЕсли;
	
	
	
	//Для Х5 сворачиваем по спайкам - артикулам, шк берем из спаек
	//Нечаева 14,08,18 +++
	Если ДокОбъект.Контрагент.родитель = Справочники.Контрагенты.НайтиПоКоду("SSR-4117")
		//для дикси мегамарт тоже самое нечаева15,10,18++
		или КодКонтрагента = "SSP-3687"
		//для виктория балтия тоже самое нечаева 06,04,20 ++
		или КодКонтрагента = "SSR-4726"
		//для мегамарт дикси юг, нечаева 22,12,23 ++
		или КодКонтрагента = "SSP-3687"
		
		Тогда
		
		ТЗАртикулы = новый ТаблицаЗначений;
		ТЗАртикулы = ТЗ.скопировать();
		ТЗАртикулы.свернуть("ШККонтрагента,АртикулКонтрагента,Цена,СтавкаНДС,НаименованиеКонтрагента","заявка,количество,Всего,Сумма,НДС");
		ТЗАртикулы.колонки.добавить("Номенклатура");  
		//нечаева 24,09,18+++
		ТЗАртикулы.колонки.добавить("Кратность"); 
		//нечаева 24,09,18--
		Для Каждого ТекСтрока Из тзАртикулы Цикл
			
			ШКПоМатрице=НЕопределено;
			АртикулПоМатрице=НЕопределено;
			НайденнаяСтрока = тз1.Найти(ТекСтрока.АртикулКонтрагента,"АртикулКонтрагента");
			Если НайденнаяСтрока <> Неопределено ТОгда
				ТекСтрока.Кратность = Число(НайденнаяСтрока.Кратность);
				ТекСтрока.Номенклатура = НайденнаяСтрока.Номенклатура;
			Иначе
				//нечаева 24,09,18+++
				ТекСтрока.Кратность = 1;
				//нечаева 24,09,18--
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	//Нечаева 14,08,18 ---
	
	//Нечаева 10,07,17 ---
	
	
	
	//Нечаева 06,04,15+++++
	// для 7 континента сворачиваем 5 позиций по спайкам.
	
	Если КодКонтрагента = "SSP-1973" Тогда
		
		ТЗАртикулы = ТЗ.скопировать();
		ТЗАртикулы.свернуть("АртикулКонтрагента,Цена,СтавкаНДС","заявка,количество,Всего,Сумма,НДС");
		ТЗАртикулы.колонки.добавить("ШККонтрагента"); 
		ТЗАртикулы.колонки.добавить("НаименованиеКонтрагента"); 
		ТЗАртикулы.колонки.добавить("Кратность"); 
		ТЗАртикулы.колонки.добавить("Номенклатура"); 
		
		
		Для Каждого ТекСтрока Из тзАртикулы Цикл
			
			ШКПоМатрице=НЕопределено;
			АртикулПоМатрице=НЕопределено;
			НайденнаяСтрока = тз1.Найти(ТекСтрока.АртикулКонтрагента,"АртикулКонтрагента");
			Если НайденнаяСтрока <> Неопределено ТОгда
				Если ПустаяСтрока(НайденнаяСтрока.ШККонтрагентаБлочок) Тогда
					ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагента;
				Иначе
					ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагентаБлочок;
				КонецЕсли;
				ТекСтрока.АртикулКонтрагента = НайденнаяСтрока.АртикулКонтрагента;
				ТекСтрока.НаименованиеКонтрагента = НайденнаяСтрока.НаименованиеКонтрагента;
				ТекСтрока.Кратность = Число(НайденнаяСтрока.Кратность);
				ТекСтрока.Номенклатура = НайденнаяСтрока.Номенклатура;
			Иначе
				
			КонецЕсли;
			Если ТекСтрока.АртикулКонтрагента = "121459" Тогда
				ШК = "8308583260760";
			КонецЕсли;
			
			Если ТекСтрока.АртикулКонтрагента = "121344" Тогда
				ШК = "88308583347850";
			КонецЕсли;
			
			Если ТекСтрока.АртикулКонтрагента = "170466" Тогда
				ШК = "8300277515859";
			КонецЕсли;
			
			Если ТекСтрока.АртикулКонтрагента = "177010" Тогда
				ШК = "8300277516931";
			КонецЕсли;
			
			Если ТекСтрока.АртикулКонтрагента = "121139" Тогда
				ШК = "8300497008261";
			КонецЕсли;
			
		КонецЦикла;
		
		// перенесла в др место 09,04,15++ нечаева
		// проверка, если код артикула = "" тогда не выводить ничего
		//----------------------
		Для Каждого ТекСтрока Из тзАртикулы Цикл
			Если СокрЛП(текСтрока.артикулКонтрагента) = "" Тогда
				Сообщить("Для номенклатуры - "+ТекСтрока.Номенклатура+" - не определен артикул контрагента, для выгрузки в Е-код!!! (Заполните Документ Матрица)");
				ошибка = 1;
			КонецЕсли;
		конецЦикла;
		
		
	КонецЕсли;
	
	
	///-------------------------------------------
	ТЗДляОтправки = ТЗ;
	// для 7 континента сворачиваем 5 позиций по спайкам.
	Если КодКонтрагента = "SSP-1973" 
		// или тандер нечаева 10,07,17+++
		или КодКонтрагента = "SSP-3881"
		//нечаева 14,08,18--
		или  ДокОбъект.Контрагент.родитель =  Справочники.Контрагенты.НайтиПоКоду("SSR-4117")  // х5
		//нечаева 14,08,18--
		//для дикси мегамарт тоже самое нечаева15,10,18++
		или КодКонтрагента = "SSP-3687"
		//для виктория балтия тоже самое нечаева 06,04,20 ++
		или КодКонтрагента = "SSR-4726"
		//для мегамарт дикси юг, нечаева 22,12,23 ++
		или КодКонтрагента = "SSP-3687"
		
		Тогда
		
		ТЗДляОтправки = ТЗАртикулы;
		
	КонецЕсли;
	
	//нечаева 14,08,18+++
	попытка 
		тзДляОтправки.колонки.добавить("НомерСтроки");	
	исключение
	КонецПопытки;
	//нечаева 14,08,18---
	
	
	Для Каждого ТекСтрока из тзДляОтправки Цикл
		// нечаева 06,04,015 --------	
		
		
		Если ТекСтрока.Количество=0 И КодКонтрагента <> "SSP-1973"
			//нечаева 10,12,20+++
			и КодКонтрагента <>"SSR-3546"
			//нечаева 10,12,20---
			
			Тогда
			Продолжить;
		КонецЕсли; 
		Если ТекСтрока.ШККонтрагента="" Тогда
			ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - Для номенклатуры - "+ТекСтрока.Номенклатура+" - не определен штрихкод, для выгрузки в Е-код!!! (Заполните Документ Матрица)","Важное");
			Сообщить("Для номенклатуры - "+ТекСтрока.Номенклатура+" - не определен штрихкод, для выгрузки в Е-код!!! (Заполните Документ Матрица)");
			Ошибка=1;
			Продолжить;
		КонецЕсли;
		//нечаева 24,10,24+++ добавила для метро
		Если КодКонтрагента <> "SSR-1593" 
			и КодКонтрагента <> "SSP-8643" 
			
			Тогда
			ШтукВУпаковке = 1;
			КодУпаковки = "PCE";
		Иначе
			Если ТекСтрока.Кратность > 0 Тогда
				ШтукВУпаковке = ТекСтрока.Кратность;
			Иначе
				ШтукВУпаковке = ТекСтрока.Номенклатура.Родитель.ШтукВКоробочке;
			Конецесли;
			Если ШтукВУпаковке = 0 Тогда
				ШтукВУпаковке = 1;
			КонецЕсли;
			КодУпаковки = "CT";
		Конецесли;
		
		
		// для Ашана и атака крастность берем из колонки кратность коробки
		// нечаева 04,03,24+++
		Если КодКонтрагента = "SSP-2450"  Тогда
			ШтукВКоробке = 1;
			КодУпаковки = "PCE";
			
			Если ТекСтрока.КратностьКоробки > 0 Тогда
				ШтукВКоробке = ТекСтрока.КратностьКоробки;
			Конецесли;
			Если ШтукВКоробке = 0 Тогда
				ШтукВКоробке = 1;
			КонецЕсли;
		Конецесли;
		
		// нечаева 04,03,24---
		
		
		
		Элемент=ДокументДом.СоздатьЭлемент("Line");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент);
		//----------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("Line-Item");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		//----------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("LineNumber");
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(рр));                 
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		//----------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("EAN");  //штрихкод
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(ТекСтрока.ШККонтрагента);                      
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		//----------------------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("LineItemStatus");  //статус позиции
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		Если ТекСтрока.Заявка = ТекСтрока.Количество Тогда
			СтатусПозиции = "5";
		Иначе
			Если ТекСтрока.Количество = 0 тогда
				СтатусПозиции =  "7";
			Иначе
				СтатусПозиции = "3";
			КонецЕсли;
		КонецЕсли;
		текстДом=ДокументДом.СоздатьТекстовыйУзел(СтатусПозиции);                      
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		//----------------------------------------------------------
		//Если ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-1973") Тогда
		Если НЕ ((КодКонтрагента = "SSP-1973")
			или ( КодКонтрагента ="CHF-0006")
			//нечаева 08,07,19 +++   ашан
			или ( КодКонтрагента ="SSP-2450")
			//нечаева 08,07,19 ---
			) Тогда
			Элемент3=ДокументДом.СоздатьЭлемент("SupplierItemCode");
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент3);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Текстрока.Номенклатура.код);
			ТекУзел4.ДобавитьДочерний(ТекстДом);
		КонецЕсли;
		
		//----------------------------------------------------------
		Если Не ПустаяСтрока(ТекСтрока.АртикулКонтрагента) Тогда
			Элемент=ДокументДом.СоздатьЭлемент("BuyerItemCode");  //аритикул
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			//нечаева 08,06,17+++
			текстДом=ДокументДом.СоздатьТекстовыйУзел(СокрЛП(ТекСтрока.АртикулКонтрагента));                     
			//нечаева 08,06,17---
			ТекУзел4.ДобавитьДочерний(ТекстДом);
		КонецЕсли;
		
		//----------------------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("ItemDescription");  // наименование номенклатуры
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		Если ПустаяСтрока(ТекСтрока.НаименованиеКонтрагента) Тогда
			текстДом=ДокументДом.СоздатьТекстовыйУзел(ТекСтрока.Номенклатура.Наименование);
		Иначе
			текстДом=ДокументДом.СоздатьТекстовыйУзел(ТекСтрока.НаименованиеКонтрагента);
		КонецЕсли;
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		//----------------------------------------------------------
		
		//нечаева 21,01,15 +++++
		Заявка=ЗаменитьТочку(ТекСтрока.Заявка,3);
		Элемент=ДокументДом.СоздатьЭлемент("OrderedQuantity");  //Заказано
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		
		//Количество222=ЗаменитьТочку(ТекСтрока.Количество/ШтукВУпаковке,3);
		
		//Нечаева 06,02,18+++
		Количество222=ЗаменитьТочку(ТекСтрока.Заявка/ШтукВУпаковке,3);
		//Нечаева 06,02,18---
		
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(количество222));                     
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		//----------------------------------------------------------
		//катаев+ 19/12/14
		//Количество=ЗаменитьТочку(ТекСтрока.Количество,3);
		Количество=ЗаменитьТочку(ТекСтрока.Количество/ШтукВУпаковке,3);
		
		//Катаев- 19/12/14
		Элемент=ДокументДом.СоздатьЭлемент("QuantityToBeDelivered");  //Подтверждено
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		//Катаев+ 19/12/14
		//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Количество/ШтукВУпаковке));
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Количество));
		//Катаев- 19/12/14
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		
		
		
		// нечаева 04,03,24+++ для Ленты  штуки в коробке и кол коробок.
		//UnitPacksizeToBeDelivered             // нечаева 24,10,24+++ метро
		Если  КодКонтрагента = "SSR-1593" или КодКонтрагента = "SSP-8643" 
			Тогда
			
			Элемент=ДокументДом.СоздатьЭлемент("UnitPacksizeToBeDelivered");
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ШтукВУпаковке)+".000");                     
			ТекУзел4.ДобавитьДочерний(ТекстДом);
			
		КонецЕсли;		 
		// нечаева 04,03,24 ---	
		
		
		
		
		// нечаева 04,03,24+++ для ашана штуки в коробке и кол коробок.
		//UnitPacksizeToBeDelivered
		Если  КодКонтрагента = "SSP-2450" Тогда
			
			Элемент=ДокументДом.СоздатьЭлемент("UnitPacksizeToBeDelivered");
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ШтукВКоробке)+".000");                     
			ТекУзел4.ДобавитьДочерний(ТекстДом);
			//-----------------------------------------------------------------------------------
			Элемент=ДокументДом.СоздатьЭлемент("FinalDeliveryQuantity");
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			ШтКоробок = ЗаменитьТочку(ТекСтрока.Количество/ШтукВКоробке,3);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ШтКоробок));                     
			ТекУзел4.ДобавитьДочерний(ТекстДом);			
		КонецЕсли;		 
		// нечаева 04,03,24 ---	
		
		
		
		//----------------------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("UnitOfMeasure");  //код упаковки
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(КодУпаковки);                     
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		//----------------------------------------------------------
		Если КодКонтрагента <>"SSP-1973" Тогда
			Элемент=ДокументДом.СоздатьЭлемент("Currency");
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			текстДом=ДокументДом.СоздатьТекстовыйУзел("RUR");
			ТекУзел4.ДобавитьДочерний(ТекстДом);
		КонецЕсли;
		//----------------------------------------------------------
		//Катаев+ 19/12/14
		//Цена = ЗаменитьТочку(Окр(ТекСтрока.Сумма/ТекСтрока.Количество,2,0),2);
		Если ТекСтрока.Количество = 0 ТОгда
			Цена = ЗаменитьТочку(ТекСтрока.Цена,3);   //21.01.15
		Иначе
			Цена = ЗаменитьТочку(Окр(ТекСтрока.Сумма/ТекСтрока.Количество,2,0),3);     //21.01.15
		КонецЕсли;
		//Цена = ЗаменитьТочку(ТекСтрока.Цена,3);
		//Катаев- 19/12/14
		Если КодКонтрагента<> "SSP-1973" и 
			// нечаева 04,03,24+++
			КодКонтрагента <> "SSP-2450" // ашан
			// нечаева 04,03,24 ---
			Тогда
			Элемент=ДокументДом.СоздатьЭлемент("OrderedUnitNetPrice");  // цена без ндс
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(цена));                      
			ТекУзел4.ДобавитьДочерний(ТекстДом);
		КонецЕсли;
		//----------------------------------------------------------
		
		//для бигбокса не надо                            и ашан   и ленты не надо
		Если НЕ (КодКонтрагента = "SSR-6841"  или 
			
			КодКонтрагента = "SSP-2450"  или КодКонтрагента = "SSR-1593")
			
			Тогда
			Элемент=ДокументДом.СоздатьЭлемент("OrderedUnitGrossPrice"); //Цена с НДС
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			Цена= ЗаменитьТочку(ТекСтрока.Цена,3);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
			ТекУзел4.ДобавитьДочерний(ТекстДом);
		КонецЕсли;
		//----------------------------------------------------------
		// если не ашан
		Если НЕ (КодКонтрагента = "SSP-2450" или КодКонтрагента = "SSR-1593") Тогда
			
			Элемент=ДокументДом.СоздатьЭлемент("TaxRate");
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			Если ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
				НДС_Текст = "10.00";
			ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
				НДС_Текст = "18.00";
			ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда 
				НДС_Текст = "20.00";   
				//Валетов +	20,01,2026 ПУСТАЯ ЗАДАЧА  Добавить везде Ставку НДС 22
			ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС22 Тогда 
				НДС_Текст = "22.00";
				//валетов -	
			ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
				НДС_Текст = "0.00";
			Иначе
				НДС_Текст = "Без НДС";
			КонецЕсли;
			текстДом=ДокументДом.СоздатьТекстовыйУзел(НДС_Текст);
			ТекУзел4.ДобавитьДочерний(ТекстДом);
			//----------------------------------------------------------------
			//нечаева для ТС молния
			//----------------------------------------------------------
			
			Цена= ЗаменитьТочку(ТекСтрока.НДС,3);                                                 // лента
			Если КодКонтрагента <> "SSP-1973" и НЕ КодКонтрагента = "SSR-6841" и не КодКонтрагента = "SSR-1593"Тогда
				Элемент=ДокументДом.СоздатьЭлемент("TaxAmount");  // сумма ндс
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
				ТекУзел4.ДобавитьДочерний(ТекстДом);
			КонецЕсли;
			
			//----------------------------------------------------------
			Цена= ЗаменитьТочку(ТекСтрока.Сумма,3);
			Если КодКонтрагента <> "SSP-1973" Тогда
				Элемент=ДокументДом.СоздатьЭлемент("NetAmount");  // сумма без ндс
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
				ТекУзел4.ДобавитьДочерний(ТекстДом);
			КонецЕсли;
			
		КонецЕсли;
		
		//------------------------------------------------	
		// нечаева 29,01,19+++
		// для Х5 в комментарий нужно писать причину недопоставки.
		Если КодКонтрагента = "SSR-4117" Тогда
			
			ПрНедопоставки=ПолучитьПричинуНедопоставки(ТекСтрока.Номенклатура);
			попытка
				Если ПрНедопоставки<>"" и ПрНедопоставки<>Неопределено Тогда
					// нам нужна только часть с кодом. 
					Пр2 = Найти(ПрНедопоставки,"  ");
					Пр_н  = СокрЛП(Лев(ПрНедопоставки,Пр2));
					
					Элемент=ДокументДом.СоздатьЭлемент("Remarks");
					ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(Пр_Н));
					ТекУзел4.ДобавитьДочерний(ТекстДом);
				КонецЕсли;
			исключение
			конецПопытки;
		КонецЕсли;
		//нечаева 29,01,19---
		
		
		//----------------------------------------------------------
		//Катаев+ 19/12/14 Для 7 континента не выводить
		// нечаева для ООО молния МОЛЛ тоже не выводить 22.01.15+++
		Если НЕ ((КодКонтрагента = "SSP-1973") 
			или ( КодКонтрагента ="CHF-0006")
			
			или 
			// нечаева 04,03,24+++
			КодКонтрагента = "SSP-2450" // ашан
			// нечаева 04,03,24 ---
			
			) Тогда
			Цена= ЗаменитьТочку(ТекСтрока.Всего,3);	//сумма с НДС
			Элемент=ДокументДом.СоздатьЭлемент("GrossAmount");
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
			ТекУзел4.ДобавитьДочерний(ТекстДом);
		КонецЕсли;
		//Катаев- 19/12/14
		
		
		
		
		РР=РР+1;
	КонецЦикла;
	Если Ошибка = 0 Тогда
		КорневойЭлемент=ДокументДом.ЭлементДокумента;
		ЭлементДом=ДокументДом.СоздатьЭлемент("OrderResponse-Summary");
		ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
		Элемент2=ДокументДом.СоздатьЭлемент("TotalLines");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(РР-1));
		ТекУзел2.ДобавитьДочерний(ТекстДом);
		
		//нечаева 12,08,16+++ 
		//---------------------------------------------------------------
		
		// для утконоса - новый импульс        //для бигбокса
		Если КодКонтрагента = "SSP-3563"  или КодКонтрагента = "SSR-6841"
			
			// для тандера тоже
			//нечаева 10,07,17+++
			или КодКонтрагента = "SSP-3881"
			//нечаева 10,07,17---
			
			// еврологистик
			//нечаева 27,10,21+++
			или КодКонтрагента = "SSR-6974"
			//нечаева 27,10,21---
			
			
			// нечаева 28,02,24+++ фикспрайс
			или  КодКонтрагента = "SSR-6999"
			// нечаева 28,02,24---
			
			Тогда
			
			Элемент2=ДокументДом.СоздатьЭлемент("TotalNetAmount");
			ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
			Сумма= товары.Итог("Сумма");
			Цена= ЗаменитьТочку(сумма,3);	//сумма без НДС
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(цена));
			ТекУзел2.ДобавитьДочерний(ТекстДом);
			
			//---------------------------------------------------------------
			
			Элемент2=ДокументДом.СоздатьЭлемент("TotalTaxAmount");
			ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
			Сумма= товары.Итог("ндс");
			Цена= ЗаменитьТочку(сумма,3);	//сумма без НДС
			
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(цена));
			ТекУзел2.ДобавитьДочерний(ТекстДом);
			//---------------------------------------------------------------
			
			Элемент2=ДокументДом.СоздатьЭлемент("TotalGrossAmount");
			ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
			Сумма= товары.Итог("всего");
			Цена= ЗаменитьТочку(сумма,3);	//сумма без НДС
			
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(цена));
			ТекУзел2.ДобавитьДочерний(ТекстДом);
			
			
			//-------------------------------------------------
			//для бигбокса 24,04,17+++  и для ашана
			Если  КодКонтрагента = "SSR-6841"  Тогда
				
				Элемент2=ДокументДом.СоздатьЭлемент("TotalQuantityToBeDelivered");
				ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
				Сумма= товары.Итог("Сумма");
				Цена= ЗаменитьТочку(ссылка.КоличествоДокумента,3);	//количество
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(цена));
				ТекУзел2.ДобавитьДочерний(ТекстДом);
				
			КонецЕсли;
			//для бигбокса 24,04,17 ---
			
		КонецЕсли;
		
		//для  ашана
		Если   КодКонтрагента = "SSP-2450" Тогда
			
			Элемент2=ДокументДом.СоздатьЭлемент("TotalQuantityToBeDelivered");
			ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
			Сумма= товары.Итог("Сумма");
			Цена= ЗаменитьТочку(ссылка.КоличествоДокумента,3);	//количество
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(цена));
			ТекУзел2.ДобавитьДочерний(ТекстДом);
			
		КонецЕсли;
		
		//нечаева 12,08,16---
		
		//---------------------------------------------------------------
		ЗаписьДом=Новый ЗаписьDom;
		ЗаписьДом.Записать(ДокументДом,ЗаписьХМЛ);
		ЗаписьХМЛ.Закрыть();
		ф1 = новый ЧтениеТекста(ВремФайл);
		ф2 = Новый ЗаписьТекста(ИмяФайлаОбмена);
		стр = ф1.ПрочитатьСтроку();
		Пока стр <> Неопределено Цикл
			//нечаева 23,01,15 +++
			Если стр <> "<?xml version=""1.0"" encoding=""UTF-8""?>" Тогда
				//Если стр <> "<?xml version=""1.0""?>" Тогда
				//нечаева 23,01,15 ---
				ф2.ЗаписатьСтроку(стр);
			КонецЕсли;
			стр = ф1.ПрочитатьСтроку();
		КонецЦикла;
		ф2.Закрыть();
		ф1.Закрыть();
		//Нечаева 20,03,17+++
		УдалитьФайлы(КаталогВременныхФайлов(),НомЗ+".xml");
		//Нечаева 20,03,17---
		//сообщить(""+КаталогВременныхФайлов()+"Пз_"+НомЗ+"_.xml");
		
		//нечаева 11,10,19+++
		Если Провайдер = 0 или провайдер = 3 Тогда
			Если ПланыОбмена.Основной.ЭтотУзел() <> ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
				//Соединение.Записать(ИмяФайлаОбмена, ИмяФайлаОбменаФТП);
				//Нечаева 20,03,17+++
				УдалитьФайлы(КаталогВременныхФайлов(),"Пз_"+НомЗ+"_.xml");
				//Нечаева 20,03,17-
				
				ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - подтверждение было успешно создано","Информация");
			Иначе	
				ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - подтверждение было успешно создано","Информация");
			КонецЕсли;
		Иначе
			
			Соединение.Записать(ИмяФайлаОбмена, ИмяФайлаОбменаФТП);
			//Нечаева 20,03,17+++
			УдалитьФайлы(КаталогВременныхФайлов(),"Пз_"+НомЗ+"_.xml");
			//Нечаева 20,03,17-
			
			ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - подтверждение было успешно создано на ftp СКБ-Контур","Информация");
		КонецЕсли;
		
		//	сообщить(""+КаталогВременныхФайлов()+"Пз_"+НомЗ+"_.xml");
		
		//Катаев- 14/11/14
	Иначе	
		ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - обнаружены ошибки, файл подтверждения не создан!","Важное");
		Сообщить("Обнаружены ошибки, файл подтверждения не записан!");
	КонецЕсли;
КонецПроцедуры



//нечаева 11,03,22+++  для х5 нужно получать заранее таблицу.
Функция ПолучитьТаблицуТоваровДляУведомления(ДокОбъект)
	
	ТЗДляОтправки = новый ТаблицаЗначений;
	тз = ДокОбъект.Товары.Выгрузить();
	
	
	//05,04,18+++ нечаева  ------------------------------------------------
	//для экспозиторов по Тандеру
	
	запрос=новый Запрос;
	запрос.Текст="ВЫБРАТЬ
	|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита как Экспозитор
	|ИЗ
	|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
	|ГДЕ
	|	РеквизитыРНКПНКПРМ.Документ = &Документ
	|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = ""Экспозитор"""; 
	запрос.УстановитьПараметр("Документ",ДокОбъект.ссылка);
	результат=запрос.Выполнить().Выбрать();
	если результат.Количество()>0 тогда
		Результат.Следующий();
		ТЗЭксп = ПолучитьТаблицуНакладнойТандерЭкспозиторы("СФ",ссылка,Результат.Экспозитор);
		СтрЭксп = ТЗЭксп[0];
		ТЗ.Очистить();
		// заполним по экспозитору их.
		НСтр = ТЗ.Добавить();
		
		Нстр.НомерСтроки = 1;
		Нстр.Номенклатура = Результат.Экспозитор;
		НСтр.количество = СтрЭксп.количество;
		НСтр.Заявка = СтрЭксп.количество;
		НСтр.ПодтвержденнаяЗаявка = СтрЭксп.количество;
		НСтр.Единица = СтрЭксп.Единица; 
		НСтр.Коэффициент = 1;
		НСтр.Цена = Окр(СтрЭксп.Цена,2);
		НСтр.ЦенаБезСкидки = Окр(СтрЭксп.Цена,2);
		НСтр.Сумма = Окр(СтрЭксп.Сумма,2);
		//	НСтр.Объем = СтрЭксп.Объем;
		НСтр.ставкаНДС =ПолучитьРеквизитРодителя(НСтр.Номенклатура,"СтавкаНДС");
		НСтр.НДС = Окр(СтрЭксп.НДС,2);
		НСтр.ВсегоБезСкидки = Окр(СтрЭксп.Всего,2);
		НСтр.Всего =  Окр(СтрЭксп.Всего,2);
		НСтр.Скидка = 0;
		
		
	КонецЕсли;	
	//05,04,18--- нечаева
	
	
	
	
	тз.Колонки.Добавить("ШККонтрагента");
	тз.Колонки.Добавить("АртикулКонтрагента");
	//Катаев+ 30/10/13
	тз.Колонки.Добавить("НаименованиеКонтрагента");
	//Катаев- 30/10/13
	//Катаев+ 07/10/14
	тз.Колонки.Добавить("Кратность");
	
	//нечаева 26,04,18+++ 	
	тз1 = ПолучитьАртикулыМатрицы(ДокОбъект);
	//нечаева 26,04,18---
	
	
	Для Каждого ТекСтрока Из тз Цикл
		//Катаев+ 04/04/14 пропускаем номенклатуру без количества
		//Катаев+ 31/10/14 Для 7 континента не пропускаем
		//Если ТекСтрока.Количество<=0 Тогда
		Если ТекСтрока.Количество<=0 И ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-1973") 
			//21,08,17 ++ нечаева для тандера
			И ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-3881")
			//21,08,17 -- нечаева для тандера
			//нечаева 10,12,20+++
			и ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSR-3546")
			//нечаева14,09,22+++
			и ДокОбъект.Контрагент.родитель <> Справочники.Контрагенты.НайтиПоКоду("SSR-4117")
			и ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("EKF-1242")  // урал логистик нечаева 27,03,24+++
			и ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("KRF-0349")
			Тогда
			//Катаев- 31/10/14
			Продолжить;
		КонецЕсли; 
		//Катаев- 04/04/14
		ШКПоМатрице=НЕопределено;
		АртикулПоМатрице=НЕопределено;
		//нечаева 25,10,23----
		попытка
			НайденнаяСтрока = тз1.Найти(ТекСтрока.Номенклатура,"Номенклатура");
		исключение
			НайденнаяСтрока =неопределено;
		конецПопытки;
		//нечаева 25,10,23+++
		Если НайденнаяСтрока <> Неопределено ТОгда
			
			Если ПустаяСтрока(НайденнаяСтрока.ШККонтрагентаБлочок) Тогда
				ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагента;
			Иначе
				ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагентаБлочок;
			КонецЕсли;
			
			//270520 нечаева ++  окей шк штуки всегда
			Если ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-5862") Тогда
				ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагента;
			КонецЕсли;
			
			
			
			//тандер нечаева 10,07,17++
			Если НЕ ПустаяСтрока(НайденнаяСтрока.ШКСпайки) Тогда
				ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШКСпайки;
			КонецЕсли;
			//тандер нечаева 10,07,17---
			
			
			
			ТекСтрока.АртикулКонтрагента = НайденнаяСтрока.АртикулКонтрагента;
			ТекСтрока.НаименованиеКонтрагента = НайденнаяСтрока.НаименованиеКонтрагента;
			//Катаев- 04/04/14
			//Катаев+ 07/10/14
			ТекСтрока.Кратность = Число(НайденнаяСтрока.Кратность);
			//Катаев- 07/10/14
		Иначе
			//нечаева 26,02,15 ++
			Если НЕ ОбменДанными.Загрузка Тогда	
				Сообщить("В номенклатурной матрице не найдена номенклатура "+ТекСтрока.Номенклатура);
			конецесли ;
			//нечаева 26,02,15 ++
			
			
			//Катаев+ 06/10/14
			//Возврат;
			Ошибка = 1;
			//Катаев- 06/10/14
		КонецЕсли;
		
	КонецЦикла;
	//тз.Свернуть("Номенклатура, ШККонтрагента, АртикулКонтрагента, Цена","Количество, Заявка");
	///----------------------------------------------------------------------------------------------------------------------------
	//Катаев+ 06/10/14
	Если Ошибка = 1 Тогда
		
		// Кухарь А.Ю.  06.02.2024 начало
		// 		Возврат неопределено;
		ТЗДляОтправки.Очистить();
		возврат ТЗДляОтправки;	
		// Кухарь А.Ю.  06.02.2024 конец
		
	КонецЕсли;
	//Катаев- 06/10/14
	ОбщаяСумма=0;
	//нечаева 18,05,15 +++
	ОбщаяСуммаСНДС = 0;
	ОбщаяНДС = 0;
	//нечаева 18,05,15 ---
	РР=1;
	//Катаев+ 02/12/13
	колДок = 0;
	//Катаев- 02/12/13
	//Для Каждого ТекСтрока из тз цикл
	
	
	
	//Для Тандера сворачиваем по артикулам, шк берем из спаек
	//Нечаева 10,07,17 +++
	ТЗАртикулы = новый ТаблицаЗначений;
	Если ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-3881") 		
		Тогда
		
		ТЗАртикулы = ТЗ.скопировать();
		ТЗАртикулы.свернуть("ШККонтрагента,АртикулКонтрагента,Цена,СтавкаНДС,НаименованиеКонтрагента,Кратность","заявка,количество,Всего,Сумма,НДС");
		//ТЗАртикулы.колонки.добавить("ШККонтрагента"); 
		//ТЗАртикулы.колонки.добавить("НаименованиеКонтрагента"); 
		//ТЗАртикулы.колонки.добавить("Кратность"); 
		//ТЗАртикулы.колонки.добавить("Номенклатура"); 
		//
		ТЗАртикулы.колонки.добавить("Номенклатура");  //??? нужно ли 
		
		Для Каждого ТекСтрока Из тзАртикулы Цикл
			
			ШКПоМатрице=НЕопределено;
			АртикулПоМатрице=НЕопределено;
			НайденнаяСтрока = тз1.Найти(ТекСтрока.АртикулКонтрагента,"АртикулКонтрагента");
			Если НайденнаяСтрока <> Неопределено ТОгда
				ТекСтрока.Кратность = Число(НайденнаяСтрока.Кратность);
				ТекСтрока.Номенклатура = НайденнаяСтрока.Номенклатура;
			Иначе
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	//Нечаева 10,07,17 ---
	
	// нечаева 18,11,24+++ для метро
	Если ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-8643") Тогда
		
		ТЗАртикулы = ТЗ.скопировать();
		ТЗАртикулы.свернуть("ШККонтрагента,АртикулКонтрагента,Цена,СтавкаНДС,НаименованиеКонтрагента","заявка,количество,Всего,Сумма,НДС");
		//ТЗАртикулы.колонки.добавить("ШККонтрагента"); 
		//ТЗАртикулы.колонки.добавить("НаименованиеКонтрагента"); 
		//ТЗАртикулы.колонки.добавить("Кратность"); 
		//ТЗАртикулы.колонки.добавить("Номенклатура"); 
		//
		ТЗАртикулы.колонки.добавить("Номенклатура");  //??? нужно ли 
		ТЗАртикулы.колонки.добавить("Кратность");
		Для Каждого ТекСтрока Из тзАртикулы Цикл
			
			ШКПоМатрице=НЕопределено;
			АртикулПоМатрице=НЕопределено;
			НайденнаяСтрока = тз1.Найти(ТекСтрока.ШККонтрагента,"ШкСпайки");
			Если НайденнаяСтрока <> Неопределено ТОгда
				ТекСтрока.Кратность = Число(НайденнаяСтрока.Кратность);
				ТекСтрока.Номенклатура = НайденнаяСтрока.Номенклатура;
			Иначе
				НайденнаяСтрока = тз1.Найти(ТекСтрока.АртикулКонтрагента,"АртикулКонтрагента");
				Если НайденнаяСтрока <> Неопределено ТОгда
					ТекСтрока.Кратность = Число(НайденнаяСтрока.Кратность);
					ТекСтрока.Номенклатура = НайденнаяСтрока.Номенклатура;
				Иначе
				конецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	// нечаева 18,11,24--
	
	
	//Нечаева 06,04,15+++++
	// для 7 континента сворачиваем 5 позиций по спайкам.
	//ТЗАртикулы = новый ТаблицаЗначений;
	
	Если ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-1973") Тогда
		
		ТЗАртикулы = ТЗ.скопировать();
		ТЗАртикулы.свернуть("АртикулКонтрагента,Цена,СтавкаНДС","заявка,количество,Всего,Сумма,НДС");
		ТЗАртикулы.колонки.добавить("ШККонтрагента"); 
		ТЗАртикулы.колонки.добавить("НаименованиеКонтрагента"); 
		ТЗАртикулы.колонки.добавить("Кратность"); 
		ТЗАртикулы.колонки.добавить("Номенклатура"); 
		
		
		Для Каждого ТекСтрока Из тзАртикулы Цикл
			
			ШКПоМатрице=НЕопределено;
			АртикулПоМатрице=НЕопределено;
			НайденнаяСтрока = тз1.Найти(ТекСтрока.АртикулКонтрагента,"АртикулКонтрагента");
			Если НайденнаяСтрока <> Неопределено ТОгда
				Если ПустаяСтрока(НайденнаяСтрока.ШККонтрагентаБлочок) Тогда
					ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагента;
				Иначе
					ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагентаБлочок;
				КонецЕсли;
				ТекСтрока.АртикулКонтрагента = НайденнаяСтрока.АртикулКонтрагента;
				ТекСтрока.НаименованиеКонтрагента = НайденнаяСтрока.НаименованиеКонтрагента;
				ТекСтрока.Кратность = Число(НайденнаяСтрока.Кратность);
				ТекСтрока.Номенклатура = НайденнаяСтрока.Номенклатура;
			Иначе
				
			КонецЕсли;
			Если ТекСтрока.АртикулКонтрагента = "121459" Тогда
				ШК = "8308583260760";
			КонецЕсли;
			
			Если ТекСтрока.АртикулКонтрагента = "121344" Тогда
				ШК = "88308583347850";
			КонецЕсли;
			
			Если ТекСтрока.АртикулКонтрагента = "170466" Тогда
				ШК = "8300277515859";
			КонецЕсли;
			
			Если ТекСтрока.АртикулКонтрагента = "177010" Тогда
				ШК = "8300277516931";
			КонецЕсли;
			
			Если ТекСтрока.АртикулКонтрагента = "121139" Тогда
				ШК = "8300497008261";
			КонецЕсли;
			
		КонецЦикла;
		
		
		///перенесла 09,04,15++
		// проверка, если код артикула = "" тогда не выводить ничего
		//----------------------
		Для Каждого ТекСтрока Из тзАртикулы Цикл
			Если СокрЛП(текСтрока.артикулКонтрагента) = "" Тогда
				Сообщить("Для номенклатуры - "+ТекСтрока.Номенклатура+" - не определен артикул контрагента, для выгрузки в Е-код!!! (Заполните Документ Матрица)");
				ошибка = 1;
			КонецЕсли;
		конецЦикла;
		
		
	КонецЕсли;
	
	
	//Для Х5 сворачиваем по спайкам - артикулам, шк берем из спаек
	//Нечаева 14,08,18 +++
	
	Если ДокОбъект.Контрагент.родитель = Справочники.Контрагенты.НайтиПоКоду("SSR-4117") 
		//для дикси мегамарт тоже самое нечаева15,10,18++
		или ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-3687")
		//для виктория балтия тоже самое нечаева 06,04,20 ++
		или ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSR-4726")
		//для мегамарт дикси юг, нечаева 22,12,23 ++
		или ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-3687")
		или ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("KRF-0349")   //нечаева 15,05,24+++
		или  ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSR-9519") // тк лето	
		или докОбъект.контрагент.код = "CHF-0200"  // метрополис Нечаева 24,07,25 +++
		
		Тогда
		
		ТЗАртикулы = ТЗ.скопировать();
		ТЗАртикулы.свернуть("ШККонтрагента,АртикулКонтрагента,Цена,СтавкаНДС,НаименованиеКонтрагента","заявка,количество,Всего,Сумма,НДС");
		//ТЗАртикулы.колонки.добавить("ШККонтрагента"); 
		//ТЗАртикулы.колонки.добавить("НаименованиеКонтрагента"); 
		//ТЗАртикулы.колонки.добавить("Кратность"); 
		//ТЗАртикулы.колонки.добавить("Номенклатура"); 
		//
		ТЗАртикулы.колонки.добавить("Номенклатура");  //??? нужно ли 
		//нечаева 24,09,18++
		ТЗАртикулы.колонки.добавить("Кратность"); 
		//нечаева 24,09,18--
		
		Для Каждого ТекСтрока Из тзАртикулы Цикл
			
			ШКПоМатрице=НЕопределено;
			АртикулПоМатрице=НЕопределено;
			НайденнаяСтрока = тз1.Найти(ТекСтрока.АртикулКонтрагента,"АртикулКонтрагента");
			Если НайденнаяСтрока <> Неопределено ТОгда
				ТекСтрока.Кратность = Число(НайденнаяСтрока.Кратность);
				ТекСтрока.Номенклатура = НайденнаяСтрока.Номенклатура;
			Иначе
				//нечаева 24,09,18++
				ТекСтрока.Кратность =1;
				//нечаева 24,09,18++
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	//Нечаева 14,08,18 ---
	
	
	
	
	///-------------------------------------------
	ТЗДляОтправки = ТЗ;
	// для 7 континента сворачиваем 5 позиций по спайкам.
	Если ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-1973") 
		//нечаева 10,07,17++
		или  ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-3881")  // тандер
		//нечаева 10,07,17--
		//нечаева 14,08,18--
		или  ДокОбъект.Контрагент.родитель =  Справочники.Контрагенты.НайтиПоКоду("SSR-4117")  // х5
		//нечаева 14,08,18--
		//для дикси мегамарт тоже самое нечаева15,10,18++
		или ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-3687")
		//для виктория балтия тоже самое нечаева 06,04,20 ++
		или ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSR-4726")
		//для мегамарт дикси юг, нечаева 22,12,23 ++
		или ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-3687")
		или ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("KRF-0349")   //нечаева 15,05,24++
		или ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-8643") // метро  Нечаева 27,11,24++
		или ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSR-9519") // тк лето
		или докОбъект.контрагент.код = "CHF-0200"  // метрополис Нечаева 24,07,25 +++
		
		Тогда
		
		ТЗДляОтправки = ТЗАртикулы;
		
	КонецЕсли;
	
	
	//27,02,17+++ нечаева 
	// в ТЗ Для Отправки добавим  паллету для перекрестка
	
	//нечаева 14,08,18+++
	попытка 
		тзДляОтправки.колонки.добавить("НомерСтроки");	
	исключение
	КонецПопытки;
	//нечаева 14,08,18---
	
	
	
	
	возврат ТЗДляОтправки;
	
	
	
	
КонецФункции	
//нечаева 11,03,22---

// нечаева  26,02,24
функция ПолучитьРеквизитРНКПНКПРМ(Документ,ИмяРеквизита)
	
	ЗначениеРеквизита = неопределено;
	
	ПоискНомера=новый Запрос;
	ПоискНомера.Текст="ВЫБРАТЬ
	|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита КАК ЗначениеРекв
	|ИЗ
	|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
	|ГДЕ
	|	РеквизитыРНКПНКПРМ.Документ = &Документ
	|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = &ИмяРеквизита";
	ПоискНомера.УстановитьПараметр("Документ", Документ);
	ПоискНомера.УстановитьПараметр("ИмяРеквизита",ИмяРеквизита);
	СписокНомеров=ПоискНомера.Выполнить().Выбрать();
	
	Пока СписокНомеров.Следующий() Цикл
		
		ЗначениеРеквизита = СписокНомеров.ЗначениеРекв;
		
	КонецЦикла;
	возврат ЗначениеРеквизита; 
	
конецФункции
// нечаева 21,01,25 ----


Процедура СформироватьУведомление(ДокОбъект, Ошибка, Провайдер) Экспорт
	
	//нечаева 18,05,21+++
	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Кухарь А.Ю. 31.03.2026 начало
	// Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом тогда 
	Если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() тогда
		//Кухарь А.Ю. 31.03.2026 конец       
		ЗаписатьВЛог("ОшибкиЕкод","Отмена выполнения. подтверждение не создано "+ДокОбъект+" база "+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
		
		ошибка=1;
		
		Возврат ;
	КонецЕсли;
	// нечаева 18,05,21----
	
	// нечаева 27,02,23 +++
	// для атака по некторым не отправл. уведомл об отгрузке.
	Если ДокОбъект.ПунктДоставки.КодИЛН = "4660000943095" или  ДокОбъект.ПунктДоставки.КодИЛН = "4660000943477"
		// для детского мира, ПД маркетплейс - не надо, нечаева 24,05,23+++ 
		или  ДокОбъект.ПунктДоставки.Код = "SNL-025840"
		Тогда
		возврат ;
	КонецЕсли;	
	// нечаева 27,02,23 ---
	
	кодКонтрагента = ДокОбъект.Контрагент.код ;
	кодРОдителяКонтр = ДокОбъект.Контрагент.родитель.код ;
	
	//нечаева 20,01,25+++
	Если  кодКонтрагента  = "SSP-3881"
		Тогда
		// 1. получаем СС коды, прописываем из для РНК, если их нет.
		// 2. получаем артикулы на сскоды, сворачиваем таблицу сс кодов аналогично таблице товаров.
		// 3. Ид паллет прописываем. и из этого массива уже формируем Уведомление об отгрузке. (свертка по артикулам для Тандера)
		
		// ТЗ для сс кодов для тандера.
		
		ПризнакКроссДокинга = ложь;
		
		ТЗССКодыТовары=Новый ТаблицаЗначений;
		ТЗССКодыТовары.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТЗССКодыТовары.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число"));
		ТЗССКодыТовары.Колонки.Добавить("ССКод",Новый ОписаниеТипов("строка"));
		ТЗССКодыТовары.Колонки.Добавить("Ид",Новый ОписаниеТипов("Число"));
		ТЗССКодыТовары.Колонки.Добавить("Ном2",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТЗССКодыТовары.Колонки.Добавить("Артикул",Новый ОписаниеТипов("Строка"));
		ТЗССКодыТовары.Очистить();
		
		// свертки возможно еще
		// СписокСтрокПоПаллетам.Свернуть("Номенклатура, SSCCКод", "Количество");
		
		
		// 1. получаем сскоды.
		// получаем на них артикулы. сворачиваем по артикулу, как и саму таблицу.
		ТЗССКодыТовары = ПолучитьТаблицуССкодовдляУведомления(ДокОбъект); // это из паллет
		
		
		
		ТЗССКодыССИд = ТЗССКодыТОвары.скопировать();
		ТЗССКодыССИд.свернуть("ССкод");
		ТЗССКодыСсид.Колонки.Добавить("Ид",Новый ОписаниеТипов("Число"));
		Ид=2;
		Для каждого Текстрока из ТЗССКодыССИд цикл
			ТекСтрока.Ид=Ид;
			Ид=Ид+1;
		КонецЦикла;	
		
		ТЗССКодовВРНк=ПолучитьНомераУпаковок(ДокОбъект);
		КоличествоССКодовВРНк = ТЗССКодовВРНк.количество();
		
		// проверка количество кодов должно совпадать.
		Если КоличествоССКодовВРНк<> ТЗССКодыССИд.количество() Тогда
			
			ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" не совпадают количество сс кодов в РНК и в паллетах!! уведомление не отправлено ","Важное");
			#если клиент тогда
				сообщить("Уведомление не отправлено, не совпадает количество SSCC кодов в паллетах и в РНК "+ДокОбъект.ссылка);
			# конецесли 
			
			возврат;
		КонецЕсли;	
		
		//-------------------------------------------------------------
		// проставим эти ИД в исходную таблицу.
		Для каждого ТекСтрока из ТЗССКодыТовары цикл
			
			ТИД = 0;
			ССкод = ТексТРока.ССкод;
			НайденнаяСтрока = ТЗССКодыСсид.Найти(ССкод, "ССкод");
			Если НайденнаяСтрока = Неопределено Тогда
				ТекСтрока.Ид = 0;
			иначе
				ТекСтрока.Ид =НайденнаяСтрока.Ид;
			КонецЕсли;     
			
		КонецЦикла;
		
		Если ТЗССКодыТовары.количество()>0 Тогда
			ПризнакКроссДокинга = истина;
		КонецЕсли;
		
		
	конецЕсли;
	// нечаева 20.01.25 ---
	
	//-------------------------------------------------------------------------------------------------
	
	// для Ашана
	// нечаева 17,09,19+++	
	Если кодконтрагента = "SSP-2450" ТОгда
		ПоискНомера=новый Запрос;
		ПоискНомера.Текст="ВЫБРАТЬ
		|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита КАК приемка
		|ИЗ
		|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
		|ГДЕ
		|	РеквизитыРНКПНКПРМ.Документ = &Документ
		|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = &ИмяРеквизита";
		ПоискНомера.УстановитьПараметр("Документ", ЭтотОбъект.ссылка);
		ПоискНомера.УстановитьПараметр("ИмяРеквизита","GLNпокупателя");
		СписокНомеров=ПоискНомера.Выполнить().Выбрать();
		// не отправляем если нет сс кода
		Если списокномеров.Количество() = 0 ТОгда
			#если клиент тогда
				сообщить("Уведомление не отправлено, нет SSCC кода "+ДокОбъект.ссылка);
			# конецесли 
			
			возврат;
		КонецЕсли;	
		
		
	КонецЕсли;
	//нечаева 17,09,19 +---	
	
	
	
	Если ПустаяСтрока(ДокОбъект.Контрагент.Родитель.КодИЛН) Тогда
		ИЛНПок =  ДокОбъект.Контрагент.КодИЛН;
	Иначе
		ИЛНПок =  ДокОбъект.Контрагент.Родитель.КодИЛН;
	КонецЕсли;
	
	//нечаева 02,02,015 +++
	если контрагент.Код = "PRF-0122" Тогда  // для виват-трейд только при отгрузке
		Если  СостояниеНакладной <> Перечисления.СостоянияНакладной.Отгружена  тогда
			ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - попытка формирования уведомления для виват-трейд, возврат ","Важное");
			возврат;
		иначе
			ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - формирование уведомления для виват-трейд ","Важное");
		конецЕсли;
	конецЕсли;	
	//нечаева 02,02,015 ---
	
	//нечаева 16,03,23+++
	// для командора в момент отгружено только отправляем
	если кодКонтрагента = "KRF-0349" Тогда  // для тс командор только при отгрузке
		Если  СостояниеНакладной <> Перечисления.СостоянияНакладной.Отгружена  тогда
			возврат;
		КонецЕсли;
	конецЕсли;	
	// нечаева 16,03,23--- 
	
	//нечаева 23,02,16+++ для перекрестка в РГ или отгружено. В ожидание паллетирования не отправлять.
	Если кодРОдителяКонтр = "SSR-4117"
		//нечаева 10,07,17++ для тандера также делаем.
		или  кодКонтрагента = "SSP-3881"  или   кодКонтрагента =  "SSR-2450"
		//окей
		////нечаева 26,09,18++
		или  кодКонтрагента = "SSP-3687" 
		////нечаева 26,09,18---
		
		Тогда 
		ОтправлятьДок = ложь;
		Если  СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена  или  СостояниеНакладной = Перечисления.СостоянияНакладной.ГотоваКОтгрузке тогда
			ОтправлятьДок = истина;
		конецЕсли;
		
		Если  НЕ ОтправлятьДок Тогда
			возврат;
		КонецЕсли;	
		
	конецЕсли;	
	//нечаева 23,02,16 ---
	
	
	//Нечаева 20,03,17+++
	НомЗ = СокрЛП(СтрЗаменить(СокрЛП(ДокОбъект.НомерЗаказа), "/", "_"));		
	НомЗ = СтрЗаменить(НомЗ, "\", "_");		
	//Нечаева 20,03,17---
	
	
	
	//Нечаева 07,02,17++++
	// для клиентов с галкой.
	ПроверкаСФДляДок = Истина;
	// для УПД и уведомлений.
	
	Если  контрагент.ФормироватьСФприОП  Тогда
		
		СФ=Неопределено;
		СФ=СчетФактураНакладной(Ссылка,Организация);
		Если СФ.Пустая() Тогда
			ПроверкаСФДляДок = ложь;
			ЗаписатьВЛог("Екод","уведомление не отправлено! еще нет СФ - "+Номер+" "+Дата+ОписаниеОшибки(),"Важное");		
			возврат;
			// ничего не формируем пока не загрузилась СФ.
		КонецЕсли;
		
	КонецЕсли;
	//Нечаева 07,02,17----
	
	//
	//ИЛНПост = "4607182079990EC";
	//
	//	
	////Нечаева 09,10,19+++
	//Если Провайдер = 3 Тогда
	//	//ИЛНПост = "4607182079990";
	//	ИЛНПост = "4607182079990WS";
	
	//КонецЕсли;
	////Нечаева 09,10,19---
	
	
	ИЛНПост = "4607182079990WS";
	
	// нечаева 19,04,2023+++   единая
	Если ДокОбъект.организация.код = "SS-001" Тогда
		ИЛНПост = "4607182079990EC";
		
		//Нечаева 09,10,19+++
		Если Провайдер = 3 Тогда
			//ИЛНПост = "4607182079990";
			ИЛНПост = "4607182079990WS";
			
		КонецЕсли;
		//Нечаева 09,10,19---
	ИначеЕсли ДокОбъект.организация.код = "SSP-99" Тогда    // бтк
		
		ИЛНПост = "4607196338601WS";
		
	КонецЕсли;
	// нечаева 19,04,2023---
	
	// нечаева 27,02,24++
	кодКонтрагента = ДокОбъект.Контрагент.код ;
	//нечаева 27,02,24---
	
	
	Если Провайдер = 0 или Провайдер = 3 Тогда
		Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
			
			// для метрополиса -  нечаева 17.12,25 +++  HELP-8244
			Если докОбъект.контрагент.код = "CHF-0200" Тогда
				ИЛНПок="4680014029103";
			КонецЕсли;
			
			
			Если докОбъект.контрагент.родитель.код = "SSR-4144" Тогда
				ИЛНПок="9777992579999";
			КонецЕсли;
			// для метрополиса -  нечаева 17.12,25 ---  HELP-8244
			
			
			
			ПутьДляУвед = ПолучитьПутьДляУвед(КаталогЕкода+ИЛНПост+"\"+ИЛНПок+"\OUT\");
			//Нечаева 15,03,18+++
			// Для Хорошего дня - магнолия
			Если ПутьДляУвед = Неопределено и (ИЛНПок = "9777992536626" или кодРОдителяКонтр = "SMN-7541") ТОгда
				//   9777992579999 - корневой для Магнолии
				ПутьДляУвед = ПолучитьПутьДляУвед(КаталогЕкода+ИЛНПост+"\9777992579999\OUT\");
				
			КонецЕсли;		   
			//Нечаева 15,03,18---
			
			
			//Нечаева 01,11,2021+++
			// Для Еврологистик ТС Лама
			Если ПутьДляУвед = Неопределено и (ИЛНПок = "4620020788939" или кодРОдителяКонтр = "SSR-6974") ТОгда
				//   9777992579999 - корневой для Магнолии
				ПутьДляУвед = ПолучитьПутьДляУвед(КаталогЕкода+ИЛНПост+"\4620020789998\OUT\");
				
			КонецЕсли;		   
			//Нечаева 101,11,2021---
			
			
			//Нечаева 13102022+++
			// Для урал
			Если ПутьДляУвед = Неопределено и (ИЛНПок = "4620020788939" или кодРОдителяКонтр = "EKF-0488") ТОгда
				//   9777992579999 - корневой для Магнолии
				ПутьДляУвед = ПолучитьПутьДляУвед(КаталогЕкода+ИЛНПост+"\4607182259835\OUT\");
				
			КонецЕсли;		   
			//Нечаева 13102022---
			
			
			//Нечаева 20,02,23+++
			// Для метро
			Если ПутьДляУвед = Неопределено и (ИЛНПок = "4607070198888" или кодКонтрагента = "SSP-8643") ТОгда
				//   9777992579999 - корневой для Магнолии
				ПутьДляУвед = ПолучитьПутьДляУвед(КаталогЕкода+ИЛНПост+"\4607070199991\OUT\");
				
			КонецЕсли;		   
			//Нечаева 20.02.23---
			
			// 4680021979996 шагдарова ТС Абсолют			
			Если ПутьДляУвед = Неопределено и (ИЛНПок = "4680021979989" или кодКонтрагента = "SSR-9771") ТОгда
				
				ПутьДляУвед = ПолучитьПутьДляУвед(КаталогЕкода+ИЛНПост+"\4680021979996\OUT\");
				
			КонецЕсли;		   
			//Нечаева 25,10,23 ---
			
			// 4630031839995 ОА гуливер	тк лето, нечаева 17,02,25		
			Если ПутьДляУвед = Неопределено и (ИЛНПок = "4670142219996" или КодКонтрагента = "SSR-9519") ТОгда
				
				//ПутьДляУвед = ПолучитьПутьДляУвед(КаталогЕкода+ИЛНПост+"\4630031839995\OUT\");
				
				// нечаева 05,09,25 +++ с 5 августа поменялась папка получения заказов??? корус что-то перенастроил у себя?
				ПутьДляУвед = ПолучитьПутьДляУвед(КаталогЕкода+ИЛНПост+"\1111111111133\OUT\");
				// нечаева 05,09,25 ---
				
				
			КонецЕсли;		   
			//Нечаева 17,02,25 ---
			
			
			
			// гипербола нечаева 28,08,25+++			
			Если ПутьДляУвед = Неопределено и (ИЛНПок = "4607196385179" или КодКонтрагента = "EKF-1384") ТОгда
				
				ПутьДляУвед = ПолучитьПутьДляУвед(КаталогЕкода+ИЛНПост+"\4607968939999\OUT\");
				
			КонецЕсли;		   
			//Нечаева 28,08,25 ---
			
			
			
			
			//Катаев- 24/10/14
			Если ПутьДляУвед = Неопределено ТОгда
				Если кодКонтрагента <> "SSP-4991" Тогда
					#Если клиент Тогда
						Сообщить( Строка(ДокОбъект)+" - не удалось определить путь для сохранения файла подтверждения");
					#КонецЕсли
				конецЕсли;
				
				ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - не удалось определить путь для сохранения файла уведомления","Важное");
				//Катаев+ 06/10/14
				Ошибка = 1;
				//Катаев- 06/10/14
				Возврат;
			КонецЕсли;
			//нечаева 26,08,21+++
			НомерДок =  ДокОбъект.Номер;
			Если кодКонтрагента = "SSP-2450" тогда
				
				НомерДок = Прав(ДокОбъект.номер,СтрДлина(ДокОбъект.номер)-5);		
				
			конецЕсли;	
			
			ИмяФайлаОбмена = ПутьДляУвед+"\"+НомерДок+".xml";
			//нечаева 26,08,21----
			
			//ИмяФайлаОбмена = ПутьДляУвед+"\"+ДокОбъект.Номер+".xml";
		Иначе // филиал
			//Катаев+ 24/10/14
			Если ДокОбъект.Склад.КодФизическогоУзла <> ПланыОбмена.Основной.ЭтотУзел().Код Тогда
				Ошибка = 1;
				Возврат;
			КонецЕсли;
			//Катаев- 24/10/14
			УзелЦО = ПланыОбмена.Основной.НайтиПоКоду("SNL");
			
			// для метрополиса -  нечаева 24,07,25 +++
			Если докОбъект.контрагент.код = "CHF-0200" Тогда
				ИЛНПок="4680014029103";
			КонецЕсли;
			
			
			//нечаева 12,09,17+++	
			Если кодРОдителяКонтр = "SSR-4144" Тогда
				ИЛНПок="9777992579999";
			КонецЕсли;
			
			////Нечаева 13102022+++
			//// Для урал
			//Если ПутьДляУвед = Неопределено и (ИЛНПок = "4620020788939" или ДокОбъект.Контрагент.Родитель.код = "EKF-0488") ТОгда
			//	//   9777992579999 - корневой для Магнолии
			//	ПутьДляУвед = ПолучитьПутьДляУвед(КаталогЕкода+ИЛНПост+"\4607182259835\OUT\");
			//	
			//КонецЕсли;		   
			////Нечаева 13102022---
			
			
			ИмяФайлаОбменаФТП = ""+СокрЛП(ДокОбъект.Номер)+".xml";
			УзелЦО = ПланыОбмена.Основной.НайтиПоКоду("SNL");
			
			//Нечаева 13,12,18+++
			//КаталогFTP = ПолучитьПутьДляУвед("\\srvecode\EdiConnector2\ediECOD\"+ИЛНПост+"\"+ИЛНПок+"\OUT\");
			//для филиала
			КаталогFTP = ПолучитьПутьДляУвед(КаталогЕкодаФТП+ИЛНПост+"\"+ИЛНПок+"\OUT\");
			
			//Нечаева 06022024+++
			// Для урал
			Если КаталогFTP = Неопределено и (ИЛНПок = "4620020788939" или ДокОбъект.Контрагент.Родитель.код = "EKF-0488" Или ИЛНПОк = "4607196314148")
				
				ТОгда
				//   9777992579999 - корневой для Магнолии
				КаталогFTP = ПолучитьПутьДляУвед(КаталогЕкодаФТП+ИЛНПост+"\4607182259835\OUT\");
				
			КонецЕсли;		   
			//Нечаева 060224---
			
			
			//Нечаева 13,12,18---
			Если КаталогFTP = Неопределено ТОгда
				ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - не удалось определить путь для сохранения файла подтверждения","Важное");
				Ошибка = 1;
				Возврат;
			КонецЕсли;
			
			//КаталогFTP="\\srvecode\EdiConnector2\ediECOD\4607182079990EC\"+ИЛНПок+"\OUT\";
			
			// нечаева для магнолии
			//05,12,16++
			//Если докОбъект.контрагент.родитель.код = "SSR-4144" Тогда
			//	КаталогFTP="\\srvecode\EdiConnector2\ediECOD\4607182079990EC\9777992579999\OUT\";
			//КонецЕсли;
			////05,12,16---
			//ИмяФайлаОбмена = КаталогFTP+"\"+СокрЛП(ДокОбъект.Номер)+".xml";
			//нечаева 26,08,21+++
			НомерДок =  ДокОбъект.Номер;
			Если кодКонтрагента = "SSP-2450" тогда
				
				НомерДок = Прав(ДокОбъект.номер,СтрДлина(ДокОбъект.номер)-5);		
				
			конецЕсли;	
			
			ИмяФайлаОбмена = КаталогFTP+"\"+НомерДок+".xml";
			//нечаева 26,08,21----
			//нечаева 12,09,17--
			
		КонецЕсли;
	Иначе
		// для контура
		Если ПланыОбмена.Основной.ЭтотУзел() <> ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
			Если ДокОбъект.Склад.КодФизическогоУзла <> ПланыОбмена.Основной.ЭтотУзел().Код Тогда
				Ошибка = 1;
				Возврат;
			КонецЕсли;
		КонецЕсли;
		КаталогFTP="Outbox";
		// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
		//ПользовательFTP="*%*%*%";
		//ПарольFTP="*$*$*$";
		ПользовательFTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКFTPКонтур).Логин;
		ПарольFTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКFTPКонтур).Пароль;
		// Ихсанов Д. А. Конец  14.10.2025
		АдресFTP = "ftp-edi.kontur.ru";
		Соединение=УстановитьFTPСоединение(АдресFTP,ПользовательFTP,ПарольFTP,,Истина);
		Если Соединение=Неопределено Тогда
			Сообщить("Невозможно установить соединение с ftp");
			Ошибка = 1;
			Возврат;
		КонецЕсли;
		Соединение.УстановитьТекущийКаталог(КаталогFTP);
		//Нечаева 20,03,17+++
		ИмяФайлаОбменаФТП = "Пз_"+НомЗ+".xml";
		ИмяФайлаОбмена = КаталогВременныхФайлов()+"Пз_"+НомЗ+"_.xml";
		//Нечаева 20,03,17-
		
	КонецЕсли;
	//Катаев- 14/11/14
	//Катаев- 02/10/14
	ВремФайл = КаталогВременныхФайлов()+ДокОбъект.Номер+".xml";
	
	Ошибка=0;
	
	
	ЗаписьХМЛ=Новый ЗаписьXML;
	ЗаписьХМЛ.ОткрытьФайл(ВремФайл);   //(Путь+Имя+".xml");
	ДокументДом=Новый ДокументDom("","Document-DespatchAdvice");   // "http://v8.1c./8.1/sample91_DOM","Document-Order"
	КорневойЭлемент=ДокументДом.ЭлементДокумента;
	//-------- Order-Header ------------------------------------------
	ЭлементДом=ДокументДом.СоздатьЭлемент("DespatchAdvice-Header");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	//----------------------------------------------------------------
	
	Элемент2=ДокументДом.СоздатьЭлемент("DespatchAdviceNumber");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	
	
	//нечаева 07,02,17++++
	Если  контрагент.ФормироватьСФприОП  Тогда
		
		попытка
			СФ = СчетФактураНакладной(ссылка);
			НомДок = СФ.номер;
		исключение
			ЗаписатьВЛог("Екод","ЗаписьСФвОП + не отправлено! Ошибка записи для РНК - "+Номер+" "+Дата+ОписаниеОшибки(),"Важное");		
			возврат;
			// не отправляем тогда
			
			НомДок = ДокОбъект.Номер;
		конецПопытки;
		
		Если СФ.пустая() Тогда
			
			ЗаписатьВЛог("Екод","ЗаписьСФвОП + не отправлено! Ошибка записи для РНК - "+Номер+" "+Дата+ОписаниеОшибки(),"Важное");		
			возврат;
		иначе
			НомДок = СФ.номер;
		КонецЕсли;
	иначе
		НомДок = ДокОбъект.Номер;
	КонецЕсли;	
	//нечаева 07,02,17 ----
	
	//нечаева 26,08,21+++
	Если кодКонтрагента = "SSP-2450" тогда
		
		НомДок = Прав(ДокОбъект.номер,СтрДлина(ДокОбъект.номер)-5);		
		
	конецЕсли;	
	//нечаева 26,08,21---
	
	
	текстДом=ДокументДом.СоздатьТекстовыйУзел(НомДок);
	//нечаева 23,01,16 -- заменим на номер СФ
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(ДокОбъект.Номер);
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	//------------------------------------------------------------
	
	//нечаева 17,08,16+++ для ленты дата документа = дате отгрузки
	ДатаДок=Формат(ДокОбъект.Дата, "ДФ=""гггг-ММ-дд""");
	// 21,11,16 Нечаева +++ добавила ИП Роздухов
	Если кодКонтрагента = "SSR-1593"  или кодКонтрагента = "SSR-2450"
		// для дикси также   нечавеа 27,10,17+++
		или кодКонтрагента = "SSP-3687"
		// для окей нечаева 30,10,18 ++
		или  кодКонтрагента = "SSP-5862" 
		// для окей нечаева 30,10,18 --
		или  кодКонтрагента = "KRF-0349" 
		// для командора  нечаева 15,07,22 --
		или  кодКонтрагента = "SSP-2812" 
		// авоська нечаева 14,04,25++
		Тогда
		ДатаДок=Формат(ДокОбъект.датаОтгрузки, "ДФ=""гггг-ММ-дд""");
	КонецЕсли;
	//нечаева 17,08,16---
	
	Элемент2=ДокументДом.СоздатьЭлемент("DespatchAdviceDate");  // дата
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаДок));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	
	//Катаев+ 30/10/14 Для 7 континента не выводить.
	Если кодКонтрагента <> "SSP-1973"  
		и кодКонтрагента<>"SST-4575"   // ТС Реми, Нечаева 03,02,26 задача SNL-118
		
		Тогда
		//------------------------------------------------------------
		
		Элемент2=ДокументДом.СоздатьЭлемент("DespatchAdviceTime");     // время
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		
		
		//нечаева 05,02,16 +++ для подружки с секундами
		Если  кодКонтрагента = "SSP-3698"  Тогда
			
			ВремяДок=Формат(ДокОбъект.Дата, "ДФ=""ЧЧ-мм-сс""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
		иначе
			ВремяДок=Формат(ДокОбъект.Дата, "ДФ=""ЧЧ:мм""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
		КонецЕсли;
		//нечаева 05,02,16 ---
		
		текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ВремяДок));
		ТекУзел2.ДобавитьДочерний(ТекстДом);
	КонецЕсли;
	
	
	
	
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("EstimatedDeliveryDate");  // дата
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	//Катаев+ 21/08/14 Если заполнена дата авизации, то ставим ее. Если нет, то дату отгрузки
	//ДатаДок2=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
	Если ДокОбъект.ДатаПриемки = Дата(1,1,1) Тогда
		ДатаДок2=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
	Иначе
		ДатаДок2=Формат(ДокОбъект.ДатаПриемки, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
	КонецЕсли;
	
	// для Тандера, если есть др дата, то берем ее.
	//28,01,25++++
	Если КодКонтрагента = "SSP-3881" и ДокОбъект.Дата>Дата(25,01,26) ТОгда
		ПоискНомера=новый Запрос;
		ПоискНомера.Текст="ВЫБРАТЬ
		|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита КАК приемка
		|ИЗ
		|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
		|ГДЕ
		|	РеквизитыРНКПНКПРМ.Документ = &Документ
		|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = &ИмяРеквизита";
		ПоискНомера.УстановитьПараметр("Документ", ДокОбъект.ссылка);
		ПоискНомера.УстановитьПараметр("ИмяРеквизита","ДатаПриемкиПоЗаказу");
		СписокНомеров=ПоискНомера.Выполнить().Выбрать();
		
		Пока СписокНомеров.Следующий() Цикл
			
			ДатаДок2= Формат(СписокНомеров.приемка, "ДФ=""гггг-ММ-дд""");   //""+СокрЛП(СписокНомеров.приемка);
			
		КонецЦикла;
	КонецЕсли;
	//нечаева 28,01,25 +---	
	
	
	//Катаев- 21/08/14
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаДок2));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	
	//Катаев+ 30/10/14 Для 7 континента не выводить
	// Кухарь А.Ю. 04.08.2021 начало
	//И для Ашана не выводить
	//	Если ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-1973") Тогда  
	// Реми
	Если кодКонтрагента <> "SSP-1973" и кодКонтрагента <> "SSP-2450" и кодКонтрагента<>"SST-4575" 
		Тогда	 
		// Кухарь А.Ю. 04.08.2021 конец
		//------------------------------------------------------------
		Элемент2=ДокументДом.СоздатьЭлемент("EstimatedDeliveryTime");     // время
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		//Катаев+ 21/08/14 Время доставки ставим из пункта доставки.
		//ВремяДок2=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""ЧЧ:мм""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
		//Кухарь 10.02.16 начало
		//Сначала будет проверятся нет ли времени доставки на конкретно эту накладную
		//Если ДокОбъект.ПунктДоставки.ВремяДоставки = Неопределено Тогда
		ВремяДоставки=ПолучитьВремяПриемки(ДокОбъект.ссылка);
		если ВремяДоставки=Справочники.ВремяПриемки.ПустаяСсылка() или ВремяДоставки=Неопределено тогда
			ВремяДоставки		=ДокОбъект.ПунктДоставки.ВремяДоставки;
		КонецЕсли;		
		Если ВремяДоставки = Справочники.ВремяПриемки.ПустаяСсылка() Тогда 
			//Кухарь 10.02.16 конец	
			
			//ВремяДок2=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""ЧЧ:мм""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
			
			//нечаева 05,02,16 +++ для подружки с секундами
			Если  кодКонтрагента = "SSP-3698"  Тогда
				
				ВремяДок2=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""ЧЧ-мм-сс""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
			иначе
				ВремяДок2=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""ЧЧ:мм""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
			КонецЕсли;
			//нечаева 05,02,16 ---
			
		Иначе
			//ВремяДок2=Формат(ДокОбъект.ПунктДоставки.ВремяДоставки.КонецПериода1, "ДФ=""ЧЧ:мм""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
			
			//нечаева 05,02,16 +++ для подружки с секундами
			Если  кодКонтрагента = "SSP-3698"  Тогда				
				//Кухарь 10.02.16 начало
				//Время доставки может быть не из пункта доставки
				//ВремяДок2=Формат(ДокОбъект.ПунктДоставки.ВремяДоставки.КонецПериода1, "ДФ=""ЧЧ:мм:сс""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
				ВремяДок2=Формат(ВремяДоставки.КонецПериода1, "ДФ=""ЧЧ-мм-сс""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
				//Кухарь 10.02.16 конец
				
			иначе						
				//Кухарь 10.02.16 начало
				//Время доставки может быть не из пункта доставки
				//ВремяДок2=Формат(ДокОбъект.ПунктДоставки.ВремяДоставки.КонецПериода1, "ДФ=""ЧЧ:мм""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
				ВремяДок2=Формат(ВремяДоставки.КонецПериода1, "ДФ=""ЧЧ:мм""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
				//Кухарь 10.02.16 конец
			КонецЕсли;
			//нечаева 05,02,16 ---
			
			
		КонецЕсли;
		
		
		// для подружки нужно с секундами.
		//нечаева 07,04,15++
		Если кодКонтрагента = "SSP-1973" Тогда
			Если СокрЛП(ВремяДок2)="" Тогда 
				ВремяДок2 = "00:00";
				//ВремяДок22=Формат(ТекущаяДата(), "ДФ=""ЧЧ:мм""");
			конецЕсли;
		иначе
			Если СокрЛП(ВремяДок2)="" Тогда 
				//ВремяДок22 = "00:00";
				
				//нечаева 05,02,16 +++ для подружки с секундами
				Если  кодКонтрагента = "SSP-3698"  Тогда
					ВремяДок22 = "00:00:00";
				иначе
					ВремяДок22 = "00:00";
				КонецЕсли;
				//нечаева 05,02,16 ---
				
			конецЕсли;
		конецЕсли;
		//нечаева 07,04,15 ---
		
		//Катаев- 21/08/14
		текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ВремяДок2));
		ТекУзел2.ДобавитьДочерний(ТекстДом);
		
	КонецЕсли;
	//----------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("BuyerOrderNumber");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(СокрЛП(ДокОбъект.НомерЗаказа));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("BuyerOrderDate");  // дата
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	ДатаДок=Формат(ДокОбъект.ДатаЗаказа, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаДок));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	
	// для Реми
	// номер договора
	если кодКонтрагента = "SST-4575"  тогда
		Элемент2=ДокументДом.СоздатьЭлемент("ContractNumber");  // дата
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		текстДом=ДокументДом.СоздатьТекстовыйУзел("ПЭО-25/120");
		ТекУзел2.ДобавитьДочерний(ТекстДом); 
	КонецЕсли;
	
	
	//Нечаева 11,03,22++++  для сети Х5
	Если кодРОдителяКонтр = "SSR-4117"  ТОгда
		//----------------------------------------------------------------
		Элемент2=ДокументДом.СоздатьЭлемент("BillOfLadingNumber");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(ДокОбъект.Номер);
		ТекУзел2.ДобавитьДочерний(ТекстДом);
		//------------------------------------------------------------
		Элемент2=ДокументДом.СоздатьЭлемент("BillOfLadingDate");  // дата
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		ДатаДок=Формат(ДокОбъект.Дата, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
		текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаДок));
		ТекУзел2.ДобавитьДочерний(ТекстДом);
	КонецЕсли;
	//нечаева 11,03,22---
	
	
	// Кухарь А.Ю. 04.08.2021 начало
	// Поле для Ашана
	// нечаева 27,02,24++ фикс прайс                                   // ТС Реми, Нечаева 03,02,26 задача SNL-118
	если кодКонтрагента = "SSP-2450"  или кодКонтрагента = "SSR-6999" или кодКонтрагента = "SST-4575"   тогда
		Элемент2=ДокументДом.СоздатьЭлемент("DocumentFunctionCode");  // дата
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		текстДом=ДокументДом.СоздатьТекстовыйУзел("O");
		ТекУзел2.ДобавитьДочерний(ТекстДом); 
	КонецЕсли;
	// Кухарь А.Ю. 04.08.2021 конец	
	
	//нечаева +++ 19,08,15+
	// для окей - доп поля.
	Если кодКонтрагента = "SSP-5862" Тогда
		// номер накладной
		Элемент2=ДокументДом.СоздатьЭлемент("DespatchNumber");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(ДокОбъект.Номер);
		ТекУзел2.ДобавитьДочерний(ТекстДом);
		//------------------------------------------------------------
		// дата накладной
		Элемент2=ДокументДом.СоздатьЭлемент("DespatchDate");  
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		ДатаДок=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
		текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаДок));
		ТекУзел2.ДобавитьДочерний(ТекстДом);
		
	КонецЕсли;
	//нечаева +++ 19,08,15---
	
	
	//24,04,17++ нечаева
	// для бигбокса дата накладной
	//------------------------------------------------------------
	// дата накладной
	Если кодКонтрагента  = "SSR-6841"  Тогда
		Элемент2=ДокументДом.СоздатьЭлемент("DespatchDate");  
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		ДатаДок=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
		текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаДок));
		ТекУзел2.ДобавитьДочерний(ТекстДом);
	КонецЕсли;
	//24,04,17-- нечаева
	
	//нечаева 29,01,17+++ для табер трейд
	Если кодКонтрагента = "SSP-3698" Тогда
		СФ = неопределено;
		попытка
			СФ = СчетФактураНакладной(ссылка);
			НомДокСФ = СФ.номер;
			ДатаСФ =СФ.дата;
		исключение
			НомДокСФ = "не создана";
			ДатаСФ = ДокОбъект.Дата;
		конецПопытки;
		
		//----------------------------------------------------------------
		Элемент2=ДокументДом.СоздатьЭлемент("InvoiceNumber");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(НомДокСФ);
		ТекУзел2.ДобавитьДочерний(ТекстДом);
		//------------------------------------------------------------
		Элемент2=ДокументДом.СоздатьЭлемент("InvoiceDate");  // дата
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		ДатаСФ=Формат(ДатаСФ, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
		текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаСФ));
		ТекУзел2.ДобавитьДочерний(ТекстДом);
		
	КонецЕсли;
	//нечаева 29,01,17 ---
	
	//нечаева 19,02,26+++ для Реми SNL-118
	Если кодКонтрагента = "SST-4575" Тогда
		СФ = неопределено;
		попытка
			СФ = СчетФактураНакладной(ссылка);
			НомДокСФ = СФ.номер;
			ДатаСФ =СФ.дата;
		исключение
			НомДокСФ = "не создана";
			ДатаСФ = ДокОбъект.Дата;
		конецПопытки;
		
		//----------------------------------------------------------------
		Элемент2=ДокументДом.СоздатьЭлемент("InvoiceNumber");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(НомДокСФ);
		ТекУзел2.ДобавитьДочерний(ТекстДом);
		//------------------------------------------------------------
		Элемент2=ДокументДом.СоздатьЭлемент("InvoiceDate");  // дата
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		ДатаСФ=Формат(ДатаСФ, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
		текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаСФ));
		ТекУзел2.ДобавитьДочерний(ТекстДом);
		
	КонецЕсли;
	//нечаева 19,02,26 ---  SNL-118
	
	
	
	//нечаева 30,04,25+++ табыш 
	Если кодКонтрагента = "SSR-9473" Тогда
		
		// номер накладной
		Элемент2=ДокументДом.СоздатьЭлемент("DespatchNumber");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(ДокОбъект.Номер);
		ТекУзел2.ДобавитьДочерний(ТекстДом);
		//------------------------------------------------------------
		// дата накладной
		Элемент2=ДокументДом.СоздатьЭлемент("DespatchDate");  
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		ДатаДок=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
		текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаДок));
		ТекУзел2.ДобавитьДочерний(ТекстДом);
		
		//-----------------------------------------------------
		СФ = неопределено;
		попытка
			СФ = СчетФактураНакладной(ссылка);
			НомДокСФ = СФ.номер;
			ДатаСФ =СФ.дата;
		исключение
			НомДокСФ = "не создана";
			ДатаСФ = ДокОбъект.Дата;
		конецПопытки;
		
		//----------------------------------------------------------------
		Элемент2=ДокументДом.СоздатьЭлемент("InvoiceNumber");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(НомДокСФ);
		ТекУзел2.ДобавитьДочерний(ТекстДом);
		//------------------------------------------------------------
		Элемент2=ДокументДом.СоздатьЭлемент("InvoiceDate");  // дата
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		ДатаСФ=Формат(ДатаСФ, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
		текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаСФ));
		ТекУзел2.ДобавитьДочерний(ТекстДом);
		
	КонецЕсли;
	//нечаева 30,04,25---
	
	
	//Катаев+ 01/12/14 Для Молнии выводим Номер заявки
	Если кодКонтрагента = "CHF-0006" Тогда
		НомерЗаявки = ПолучитьНомерЗаявки(ДокОбъект);
		Если Номерзаявки = Неопределено Тогда
			//нечаева 16,04,19
			Если НЕ ОбменДанными.Загрузка Тогда	
				Сообщить("НЕ заполнен номер заявки Молния к РНК, уведомление не отправлено ");
			конецесли ;
			Ошибка = 1;
		Иначе	
			Элемент2=ДокументДом.СоздатьЭлемент("SupplierOrderNumber");
			ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(НомерЗаявки);
			ТекУзел2.ДобавитьДочерний(ТекстДом);
		КонецЕсли;
	КонецЕсли;
	//Катаев- 01/12/14
	
	//Катаев+ 08/12/14 Элемент для перекрестка для Перекрестка
	Если кодРОдителяКонтр = "SSR-4117" Тогда
		Элемент2=ДокументДом.СоздатьЭлемент("DocumentFunctionCode");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		текстДом=ДокументДом.СоздатьТекстовыйУзел("O");
		ТекУзел2.ДобавитьДочерний(ТекстДом);
	КонецЕсли;
	//Катаев- 08/12/14
	
	
	//Катаев+ 30/10/14 Для 7 континента не выводить
	// Кухарь А.Ю. 04.08.2021 начало
	//И для Ашана не выводить
	//	Если ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-1973") Тогда
	Если кодКонтрагента <> "SSP-1973" и кодКонтрагента <> "SSP-2450" Тогда	 
		// Кухарь А.Ю. 04.08.2021 конец
		//------------------------------------------------------------
		Элемент2=ДокументДом.СоздатьЭлемент("Currency");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		текстДом=ДокументДом.СоздатьТекстовыйУзел("RUR");
		ТекУзел2.ДобавитьДочерний(ТекстДом);
	КонецЕсли;
	
	Если  кодКонтрагента = "SSR-6999"     Тогда
		
		//------------------------------------------------------------
		
		ФиоВодителяСфера = ПолучитьРеквизитРНКПНКПРМ(ДокОбъект.ссылка,"ФиоВодителяСфера");
		МаркаМашиныСфера = ПолучитьРеквизитРНКПНКПРМ(ДокОбъект.ссылка,"МаркаМашиныСфера");
		НомерМашиныСфера = ПолучитьРеквизитРНКПНКПРМ(ДокОбъект.ссылка,"НомерМашиныСфера");
		ТелефонВодителяСФера = ПолучитьРеквизитРНКПНКПРМ(ДокОбъект.ссылка,"ТелефонВодителяСФера");
		НомерПРицепаСфера = ПолучитьРеквизитРНКПНКПРМ(ДокОбъект.ссылка,"НомерПРицепаСфера");
		
		Если ФиоВодителяСфера ="" или ФиоВодителяСфера=неопределено тогда ФиоВодителяСфера = "Иванов Иван Иванович" КонецЕсли;
		Если МаркаМашиныСфера ="" или МаркаМашиныСфера=неопределено тогда МаркаМашиныСфера = "Не известна" КонецЕсли;
		Если НомерМашиныСфера ="" или НомерМашиныСфера=неопределено тогда НомерМашиныСфера = "PP 12345" КонецЕсли;
		Если ТелефонВодителяСФера ="" или ТелефонВодителяСФера=неопределено тогда ТелефонВодителяСФера = "8 999-999-99-99" КонецЕсли;
		Если НомерПРицепаСфера ="" или НомерПРицепаСфера=неопределено тогда НомерПРицепаСфера = "-" КонецЕсли;
		
		
		Элемент2=ДокументДом.СоздатьЭлемент("TransportDetails");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		
		//------------------------------------------------------------
		Элемент3=ДокументДом.СоздатьЭлемент("CarrierName");  
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ФиоВодителяСфера));  // 
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		//----------------------------------------------------------------
		Элемент3=ДокументДом.СоздатьЭлемент("VehicleType");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);                                     
		текстДом=ДокументДом.СоздатьТекстовыйУзел(МаркаМашиныСфера); //     
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		//------------------------------------------------------------
		Элемент3=ДокументДом.СоздатьЭлемент("LicencePlate");  
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(НомерМашиныСфера));  //
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		//----------------------------------------------------------------
		Элемент3=ДокументДом.СоздатьЭлемент("ShipmentIdentifier");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);                                   
		текстДом=ДокументДом.СоздатьТекстовыйУзел(НомерПРицепаСфера); //     
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		//----------------------------------------------------------------
		Элемент3=ДокументДом.СоздатьЭлемент("CarrierPhoneNumber");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);                                     //
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ТелефонВодителяСФера)); //   
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
	КонецЕсли;
	// нечаева 27,02,24 ---
	
	
	
	
	//**********************************************************
	//                второй блок данных
	//**********************************************************
	
	ЭлементДом=ДокументДом.СоздатьЭлемент("DespatchAdvice-Parties");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	//----------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("Buyer");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	
	СписокКодИЛН=ДокОбъект.ПунктДоставки.ИЛН;
	
	//Катаев+ 02/12/13
	//КодИЛН=ДокОбъект.ПунктДоставки.КодИЛН;
	КодИЛН=ДокОбъект.Контрагент.КодИЛН;
	//Катаев- 02/12/13
	
	
	//Нечаева 25,11,16+++
	// для АТАК
	Если кодКонтрагента = "SSR-6556" ТОгда
		
		КодИЛН  = ДокОбъект.ПунктДоставки.КодИЛН;
		
	КонецЕсли;
	//Нечаева 25,11,16---
	
	
	
	// для Ашана
	//нечаева 13,09,21+++	
	Если кодКонтрагента = "SSP-2450" ТОгда
		ПоискНомера=новый Запрос;
		ПоискНомера.Текст="ВЫБРАТЬ
		|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита КАК приемка
		|ИЗ
		|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
		|ГДЕ
		|	РеквизитыРНКПНКПРМ.Документ = &Документ
		|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = &ИмяРеквизита";
		ПоискНомера.УстановитьПараметр("Документ", ЭтотОбъект.ссылка);
		ПоискНомера.УстановитьПараметр("ИмяРеквизита","GLNпокупателя");
		СписокНомеров=ПоискНомера.Выполнить().Выбрать();
		
		Пока СписокНомеров.Следующий() Цикл
			
			КодИЛН= ""+СписокНомеров.приемка;
			
		КонецЦикла;
	КонецЕсли;
	//нечаева 13,09,21 +---	
	
	
	Элемент3=ДокументДом.СоздатьЭлемент("ILN");
	ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(КодИЛН));
	ТекУзел3.ДобавитьДочерний(ТекстДом);
	
	//для виктории	
	//нечаева 02,12,19++ 
	Если кодКонтрагента = "SSR-4726" ТОгда
		Элемент3=ДокументДом.СоздатьЭлемент("TaxID");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(3905069220));
		ТекУзел3.ДобавитьДочерний(ТекстДом);
	КонецЕсли;
	//нечаева 02,12,19*--
	
	//------------------------------------------------------------
	
	Элемент2=ДокументДом.СоздатьЭлемент("Seller");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	
	Элемент3=ДокументДом.СоздатьЭлемент("ILN");
	ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(Лев(ИЛНПост,13));
	ТекУзел3.ДобавитьДочерний(ТекстДом);
	
	// для виктории
	//нечаева 02,12,19++ 
	Если кодКонтрагента = "SSR-4726" ТОгда
		Элемент3=ДокументДом.СоздатьЭлемент("TaxID");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(771711527));
		ТекУзел3.ДобавитьДочерний(ТекстДом);
	КонецЕсли;
	//нечаева 02,12,19---
	
	
	
	//Катаев+ 30/10/14 Для 7 континента не выводить
	Если кодКонтрагента <> "SSP-1973" Тогда
		Элемент3=ДокументДом.СоздатьЭлемент("CodeByBuyer");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.КодПоставщика));
		ТекУзел3.ДобавитьДочерний(ТекстДом);
	КонецЕсли;
	//------------------------------------------------------------
	
	Элемент2=ДокументДом.СоздатьЭлемент("DeliveryPoint");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	
	Элемент3=ДокументДом.СоздатьЭлемент("ILN");
	ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
	КодИЛН=ДокОбъект.ПунктДоставки.КодИЛН;
	
	// нечаева 29,01,25 для Тандера из другого поля берем.
	Если КодКонтрагента = "SSP-3881" и ДокОбъект.Дата>Дата(25,01,26) ТОгда
		ПоискНомера=новый Запрос;
		ПоискНомера.Текст="ВЫБРАТЬ
		|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита КАК приемка
		|ИЗ
		|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
		|ГДЕ
		|	РеквизитыРНКПНКПРМ.Документ = &Документ
		|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = &ИмяРеквизита";
		ПоискНомера.УстановитьПараметр("Документ", ЭтотОбъект.ссылка);
		ПоискНомера.УстановитьПараметр("ИмяРеквизита","GLN");
		СписокНомеров=ПоискНомера.Выполнить().Выбрать();
		
		Пока СписокНомеров.Следующий() Цикл
			
			КодИЛН= ""+СокрЛП(СписокНомеров.приемка);
			
		КонецЦикла;
	КонецЕсли;
	//нечаева 29,01,25 +---	
	
	
	текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(КодИЛН));
	ТекУзел3.ДобавитьДочерний(ТекстДом);
	
	//Катаев+ 30/10/14 КПП организации для 7 Континента
	//------------------------------------------------------------
	Если кодКонтрагента = "SSP-1973" Тогда
		Элемент2=ДокументДом.СоздатьЭлемент("Consignor");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		
		Элемент3=ДокументДом.СоздатьЭлемент("UtilizationRegisterNumber");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.Организация.КПП));
		ТекУзел3.ДобавитьДочерний(ТекстДом);
	КонецЕсли;
	//Катаев- 30/10/14
	
	//Нечаева 19,06,23 +++      Европа курск.
	Если кодКонтрагента = "SST-0174" Тогда
		Элемент2=ДокументДом.СоздатьЭлемент("Consignor");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		//---
		Элемент3=ДокументДом.СоздатьЭлемент("ILN");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.Организация.GLN));
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		//---
		Элемент3=ДокументДом.СоздатьЭлемент("TaxID");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.Организация.ИНН));
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		//----
		Элемент3=ДокументДом.СоздатьЭлемент("UtilizationRegisterNumber");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.Организация.КПП));
		ТекУзел3.ДобавитьДочерний(ТекстДом);
	КонецЕсли;
	//Нечаева 19,06,23 ---
	
	
	//Катаев+ 02/12/13 Добавляю секцию по ГЛН пункта доставки
	Запрос = Новый запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
	|ГДЕ
	|	РеквизитыРНКПНКПРМ.Документ = &Документ
	|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = &ИмяРеквизита";
	Запрос.УстановитьПараметр("Документ", ДокОбъект.Ссылка);
	Запрос.УстановитьПараметр("ИмяРеквизита", "GLN");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() ТОгда
		КодИЛН_ПД = Выборка.ЗначениеРеквизита;
	Иначе
		КодИЛН_ПД = "";
	КонецЕсли;
	
	//нечаева 11,07,22+++   для командор.
	Если кодКонтрагента = "KRF-0349" ТОгда
		
		Элемент2=ДокументДом.СоздатьЭлемент("Invoicee");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		
		Элемент3=ДокументДом.СоздатьЭлемент("ILN");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.Контрагент.КодИЛН));
		ТекУзел3.ДобавитьДочерний(ТекстДом);
	конецЕсли;
	//нечаева 11,07,22 ---
	
	
	
	//Катаев+ 30/10/14 секцию заполнять если только есть данные
	Если КодИЛН_ПД <> "" Тогда
		
		//  нечаева 28,11,19 +++ виктория
		Если кодКонтрагента = "SSR-4726" ТОгда
			
			Элемент2=ДокументДом.СоздатьЭлемент("Invoicee");
			ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
			
			Элемент3=ДокументДом.СоздатьЭлемент("ILN");
			ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(КодИЛН_ПД));
			ТекУзел3.ДобавитьДочерний(ТекстДом);
		иначе
			Элемент2=ДокументДом.СоздатьЭлемент("UltimateCustomer");
			ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
			
			Элемент3=ДокументДом.СоздатьЭлемент("ILN");
			ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(КодИЛН_ПД));
			ТекУзел3.ДобавитьДочерний(ТекстДом);
			
			
		КонецЕсли;
		//  нечаева 28,11,19 ---
		
		
	КонецЕсли;
	//Катаев- 02/12/13
	
	
	//*****************************************************************************************************
	// нечаева 11,03,2022 +++ тут товары все собираем.
	ТЗДляОтправки = новый ТаблицаЗначений;
	ТЗДляОтправки = ПолучитьТаблицуТоваровДляУведомления(ДокОбъект);
	КолСтрокТоваров = ТЗДляОтправки.количество();
	// нечаева 11,03,2022 ---
	
	
	// для тандера.
	Если  кодКонтрагента  = "SSP-3881" и ПризнакКроссДокинга Тогда				 
		ТЗССКодыТовары2 =ТЗССКодыТовары.скопировать();
		НоваяТЗСКодами = РазделениеСтрокПоПаллетам(ТЗДляОтправки, ТЗССКодыТовары2, ДокОбъект);
		
		ТЗДляОтправки =  НоваяТЗСКодами;
		
		КолСтрокТоваров = ТЗДляОтправки.количество();
		
	КонецЕсли;
	
	
	//*****************************************************************************************************
	//Катаев+ 09/10/13 Добавил секцию по упаковке
	ИДУпаковки = 0;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
	|ГДЕ
	|	РеквизитыРНКПНКПРМ.Документ = &Документ
	//Катаев+ 18/12/14 Упаковок может быть несколько
	//|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = &ИмяРеквизита";
	|	И Подстрока(РеквизитыРНКПНКПРМ.ИмяРеквизита,1,21) = &ИмяРеквизита";
	//Катаев- 18/12/14
	Запрос.УстановитьПараметр("Документ", ДокОбъект.Ссылка);
	Запрос.УстановитьПараметр("ИмяРеквизита", "СерийныйНомерУпаковки");
	Выборка = Запрос.Выполнить().Выбрать();
	// ТС Реми, Нечаева 03,02,26 задача SNL-118
	Если Выборка.Количество() > 0 и не (КодКонтрагента = "SSR-9519") и  не (кодКонтрагента = "SST-4575")  Тогда
		Если кодРОдителяКонтр = "SSR-4117" Тогда
			НеобходимоПалетов = 0;
			Для Каждого стр из ТЗДляОтправки Цикл
				Если стр.Количество > 0 Тогда
					НеобходимоПалетов = НеобходимоПалетов+1;
				КонецЕсли;
			КонецЦикла;
			//нечаева это для упаковки паллет 25,05,18+++
			НеобходимоПалетов = НеобходимоПалетов+1;// 
			//нечаева 23,01,19++
			Если НеобходимоПалетов > Выборка.Количество() Тогда
				//нечаева 23,01,19--
				ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - Количество палетов не совпадает с количеством SSCC кодов. Необходимо - "+Строка(НеобходимоПалетов)+". Внесено SSCC кодов - "+Строка(Выборка.Количество()),"Важное");
				Ошибка=1;
				Возврат;
			КонецЕсли;
			//нечаева это для упаковки паллет 25,05,18---
		ИначеЕсли кодКонтрагента  = "SSP-3881" Тогда
			// может быть несколько паллет
		Иначе
			//Если Выборка.Количество() <> 1 Тогда
			//	ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - Количество палетов не совпадает с количеством SSCC кодов. Необходимо - 1. Внесено SSCC кодов - "+Строка(Выборка.Количество()),"Важное");
			//	Ошибка=1;
			//	Возврат;
			//КонецЕсли;
		КонецЕсли;
		//Создаем корневую секцию
		ЭлементДом=ДокументДом.СоздатьЭлемент("DespatchAdvice-Consignment");
		ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
		Элемент=ДокументДом.СоздатьЭлемент("Packing-Sequence");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент);
		
		Элемент=ДокументДом.СоздатьЭлемент("PackageId");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел("1");                 
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		ИДУпаковки = 2;
		ИДУпаковки1 = 2;
		
		КолСтрокТоваров =КолСтрокТоваров+1 ; // для паллет тоже нужен паллет, по условиям Х5 
		КонтрагентРодитель = ДокОбъект.Контрагент.Родитель;
		
		Пока Выборка.Следующий() Цикл
			ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
			Элемент=ДокументДом.СоздатьЭлемент("Packing-Sequence");
			ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент);
			
			Элемент=ДокументДом.СоздатьЭлемент("PackageId");
			ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ИДУпаковки));                 
			ТекУзел3.ДобавитьДочерний(ТекстДом);
			
			Элемент=ДокументДом.СоздатьЭлемент("ParentId");
			ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
			текстДом=ДокументДом.СоздатьТекстовыйУзел("1");
			ТекУзел3.ДобавитьДочерний(ТекстДом);
			
			Если кодРОдителяКонтр = "SSR-4117" Тогда
				Элемент=ДокументДом.СоздатьЭлемент("PackageNumber");
				ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел("1");
				ТекУзел3.ДобавитьДочерний(ТекстДом);
			КонецЕсли;
			
			Элемент=ДокументДом.СоздатьЭлемент("PackageType");
			ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
			Если кодРОдителяКонтр = "SSR-4117"  или 
				//тандер нечаева 15,01,25 ++
				кодКонтрагента = "SSP-3881"
				Тогда
				текстДом=ДокументДом.СоздатьТекстовыйУзел("201");
			Иначе
				текстДом=ДокументДом.СоздатьТекстовыйУзел("09");
			КонецЕсли;
			ТекУзел3.ДобавитьДочерний(ТекстДом);
			
			Элемент=ДокументДом.СоздатьЭлемент("SerialNumber");
			ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Выборка.ЗначениеРеквизита);                 
			ТекУзел3.ДобавитьДочерний(ТекстДом);
			
			//Нечаева 16,01,25+++
			// для тандера доп. поля.
			//--------------------------------------------------------------------------------------------------------
			//<PackageWeight>1.000</PackageWeight>   вес нетто
			//<PackageGrossWeight>1.000</PackageGrossWeight>  вес брутто
			//<PackageHeight>1.000</PackageHeight>         высота
			Если  кодКонтрагента  = "SSP-3881" и ПризнакКроссДокинга
				Тогда				 
				
				сскод = Выборка.ЗначениеРеквизита;
				// найдем строку и получим вес.
				НайденнаяСтрока = ТЗССКодыТовары.Найти(ССкод, "ССкод");
				Если НайденнаяСтрока <> Неопределено Тогда
					
					брутто = 100; //НайденнаяСтрока.Номенклатура.Родитель.ВесБруттоШтуки * НайденнаяСтрока.количество;
					НайденнаяСтрока.Ид = ИДУпаковки;
					высотакоробки = 170; //НайденнаяСтрока.Номенклатура.Родитель.ВысотаКоробки;
					//Длинакоробки = НайденнаяСтрока.Номенклатура.Родитель.ДлинаКоробки;
					//Ширинакоробки = НайденнаяСтрока.Номенклатура.Родитель.ШиринаКоробки;
					
				иначе 
					брутто = 100;
					ВысотаКоробки = 100;
					Длинакоробки=100;
					Ширинакоробки = 100;
				КонецЕсли;     
				
				ВесНетто=0.9*брутто;		
				
				Элемент=ДокументДом.СоздатьЭлемент("PackageWeight");
				ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);       // нечаева 02,07,25++
				текстДом=ДокументДом.СоздатьТекстовыйУзел(ЗаменитьТочку(весНетто,3));                 
				ТекУзел3.ДобавитьДочерний(ТекстДом);
				//----------------------------
				
				Элемент=ДокументДом.СоздатьЭлемент("PackageGrossWeight");
				ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(ЗаменитьТочку(брутто,3));                 
				ТекУзел3.ДобавитьДочерний(ТекстДом);
				
				//--------------------------------
				
				Элемент=ДокументДом.СоздатьЭлемент("PackageHeight");
				ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ЗаменитьТочку(ВысотаКоробки,3)));  // 1,2 м. максимум , есть высота коробки              
				ТекУзел3.ДобавитьДочерний(ТекстДом);
				//--------------------------------
				
				// пока не надо
				
				//Элемент=ДокументДом.СоздатьЭлемент("PackageLength");
				//ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
				//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ЗаменитьТочку(ДлинаКоробки,3)));  // 1,2 м. максимум , есть высота коробки              
				//ТекУзел3.ДобавитьДочерний(ТекстДом);
				//
				////--------------------------------
				//
				//Элемент=ДокументДом.СоздатьЭлемент("PackageWidth");
				//ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
				//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ЗаменитьТочку(ШиринаКоробки,3)));  // 1,2 м. максимум , есть высота коробки              
				//ТекУзел3.ДобавитьДочерний(ТекстДом);
				
				//<PackageLength>1.000</PackageLength>
				//<PackageWidth>1.000</PackageWidth>
				
			КонецЕсли;
			// нечаева 16,01,25---
			//---------------------------------------------------------------------------------------------------------
			
			
			
			// Кухарь А.Ю. 11.08.2021 начало
			// Если ДокОбъект.Контрагент.Родитель <> Справочники.Контрагенты.НайтиПоКоду("SSR-4117") Тогда
			Если кодРОдителяКонтр<> "SSR-4117" 
				и кодКонтрагента <> "SSP-2450" 
				
				// нечаева 15,01,25+++ тандер не надо
				и кодКонтрагента <> "SSP-3881"
				Тогда				 
				// Кухарь А.Ю. 11.08.2021 конец
				
				Элемент=ДокументДом.СоздатьЭлемент("DeliveryPlace");
				ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
				//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(КодИЛН));  //было               
				
				// Для Ленты пишем код конечного покупателя, если есть
				//нечаева 17,06,15 +++
				// для Ленты
				Если кодРОдителяКонтр = "SSR-4123" Тогда
					Если Строка(КодИЛН_ПД)<>"" Тогда
						текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(КодИЛН_ПД));                 
					Иначе
						#если Клиент Тогда
							Сообщить("Документ "+ДокОбъект+"- Нет данных по GLN конечного покупателя, Уведомление об отгрузке не отправлено!");
						#КонецЕсли
						Ошибка = 1;
						возврат;
					КонецЕсли;	
				Иначе
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(КодИЛН));                 
				КонецЕсли;	
				//нечаева 17,06,15 ---
				
				
				ТекУзел3.ДобавитьДочерний(ТекстДом);
			КонецЕсли;
			
			ИДУпаковки = ИДУпаковки+1;
			
			// для х5 кол-во паллет передаем по количеству свернутых строк.  нечаева 11,03,22++
			КолСтрокТоваров =  КолСтрокТоваров - 1;
			
			Если КолСтрокТоваров =0 и кодРОдителяКонтр = "SSR-4117"  Тогда
				прервать;
			КонецЕсли;	
			
		КонецЦикла;
	КонецЕсли;
	//Катаев- 18/12/14
	
	//-------------------------
	//    заполнение строк
	//-------------------------
	ЭлементДом=ДокументДом.СоздатьЭлемент("DespatchAdvice-Lines");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	
	тз = ДокОбъект.Товары.Выгрузить();
	
	
	рр = 1;
	колдок = 0;
	ОбщаяСумма=0;
	ОбщаяСуммаСНДС = 0;
	ОбщаяНДС = 0;
	
	
	// в ТЗ Для Отправки добавим  паллету для перекрестка                                  //нечаева 16,06,17 +++
	Если ДокОбъект.Контрагент.отправлятьУПД = истина и ДокОбъект.количествоПаллет>0 и кодРОдителяКонтр = "SSR-4117"  Тогда
		
		
		НовСтр = тзДляОтправки.добавить();
		
		НовСтр.НомерСтроки = ТЗДляОтправки.количество()+1;
		
		НовСтр.АртикулКонтрагента = "3354748";
		НовСтр.Номенклатура  = справочники.Номенклатура.НайтиПоКоду("ODB-000325");
		НовСтр.количество =   ДокОбъект.количествоПаллет;
		НовСтр.Цена = 0;
		НовСтр.Всего = 0;
		НовСтр.СтавкаНДС=0;
		НовСтр.ШККонтрагента ="3354748";
		
		НовСтр.Ндс = 0;
		НовСтр.Сумма = 0;
		НовСтр.Кратность = 1;
		
	КонецЕсли;
	//нечаева 11,03,22 -----
	
	
	
	Для Каждого ТекСтрока из тзДляОтправки Цикл
		// нечаева 06,04,015 --------	
		
		
		
		//Катаев+ 31/10/14 Для 7 континента не пропускаем
		//Если ТекСтрока.Количество<=0 Тогда                                                                      //27,02,17+++ нечаева 
		Если ТекСтрока.Количество<=0 И кодКонтрагента  <> "SSP-1973" 
			И кодРОдителяКонтр <>  "SSP-3674" 
			//21,08,17 ++ нечаева для тандера
			И кодКонтрагента  <> "SSP-3881"
			//21,08,17 -- нечаева для тандера
			//нечаева 10,12,20+++
			и кодКонтрагента <> "SSR-3546"
			//нечаева 14,09,22+++
			И кодРОдителяКонтр  <>  "SSR-4117" // х5 
			и кодКонтрагента <> "KRF-0349" //командор
			И кодКонтрагента <> "EKF-1242" //урал логистик , Нечаева 27,03,24+++
			
			Тогда
			//Катаев- 31/10/14                                                                                   //27,02,17--- нечаева 
			Продолжить;
		КонецЕсли; 
		Если ТекСтрока.ШККонтрагента="" Тогда
			ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - Для номенклатуры - "+ТекСтрока.Номенклатура+" - не определен штрихкод, для выгрузки в Е-код!!! (Заполните Документ Матрица)","Важное");
			Сообщить("Для номенклатуры - "+ТекСтрока.Номенклатура+" - не определен штрихкод, для выгрузки в Е-код!!! (Заполните Документ Матрица)");
			Ошибка=1;
			Продолжить;
		КонецЕсли;
		
		//нечаева 24,10,24+++ добавила для метро 
		Если кодКонтрагента <> "SSR-1593"
			и кодКонтрагента <> "SSP-8643" 
			// нечаева 24,10,24---
			Тогда
			ШтукВУпаковке = 1;
			КодУпаковки = "PCE";
		Иначе
			//Катаев+ 07/10/14 Если в матрице есть крмтность, то берем ее, иначе из номенклатуры
			//ШтукВУпаковке = ТекСтрока.Номенклатура.Родитель.ШтукВКоробочке;
			Если ТекСтрока.Кратность > 0 Тогда
				ШтукВУпаковке = ТекСтрока.Кратность;
			Иначе
				ШтукВУпаковке = ТекСтрока.Номенклатура.Родитель.ШтукВКоробочке;
			Конецесли;
			//Катаев- 07/10/14
			Если ШтукВУпаковке = 0 Тогда
				ШтукВУпаковке = 1;
			КонецЕсли;
			КодУпаковки = "CT";
		Конецесли;
		//Катаев- 20/02/14
		
		Элемент=ДокументДом.СоздатьЭлемент("Line");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент);
		//----------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("Line-Item");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		
		
		Элемент=ДокументДом.СоздатьЭлемент("LineNumber");
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(рр));                 
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		// нечаева 19,06,23+++                   // ТС Реми, Нечаева 03,02,26 задача SNL-118
		Если НЕ кодКонтрагента  = "SSR-6841"  и не (кодКонтрагента = "SST-4575")  ТОгда
			
			Элемент=ДокументДом.СоздатьЭлемент("OrderLineNumber");
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(рр));                 
			ТекУзел4.ДобавитьДочерний(ТекстДом);
		конецЕсли;
		// нечаева 19,06,23--
		//---------------------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("EAN");  //штрихкод
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		//нечаева 08,06,17+++
		текстДом=ДокументДом.СоздатьТекстовыйУзел(СокрЛП(ТекСтрока.ШККонтрагента));                      
		//нечаева 08,06,17---
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		//----------------------------------------------------------
		Если Не ПустаяСтрока(ТекСтрока.АртикулКонтрагента) Тогда
			Элемент=ДокументДом.СоздатьЭлемент("BuyerItemCode");  //ариткул
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			//нечаева 08,06,17+++
			текстДом=ДокументДом.СоздатьТекстовыйУзел(СокрЛП(ТекСтрока.АртикулКонтрагента));                     
			//нечаева 08,06,17---
			ТекУзел4.ДобавитьДочерний(ТекстДом);
		КонецЕсли;
		
		//Катаев+ 30/10/14 Для 7 континента и Подружки( табер трейд) не выводить
		Если кодКонтрагента <> "SSP-1973"
			
			и  кодКонтрагента <> "SSP-3698" 
			//нечаева 24,04,17+++ бигбокс
			и не кодКонтрагента  = "SSR-6841"
			//тандер
			и не кодКонтрагента  = "SSP-3881"
			Тогда
			
			Элемент3=ДокументДом.СоздатьЭлемент("SupplierItemCode");
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент3);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Текстрока.Номенклатура.код);
			ТекУзел4.ДобавитьДочерний(ТекстДом);
			
		КонецЕсли;
		//----------------------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("DespatchedQuantity");  //коли отправ
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		Кол=ЗаменитьТочку(ТекСтрока.Количество/ШтукВУпаковке,3);
		
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Кол));
		колДок = КолДок+ТекСтрока.Количество/ШтукВУпаковке;
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		//----------------------------------------------------------
		Заявка=ЗаменитьТочку(ТекСтрока.Заявка/ШтукВУпаковке,3);
		
		//Катаев+ 30/10/14 Для 7 континента не выводить
		Если кодКонтрагента <> "SSP-1973" Тогда
			
			Элемент=ДокументДом.СоздатьЭлемент("OrderedQuantity");  //штрихкод
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Заявка));
			ТекУзел4.ДобавитьДочерний(ТекстДом);
			
			//катаев+ 30/10/13 Количество в упаковке
			//----------------------------------------------------------
			Заявка=ЗаменитьТочку(ТекСтрока.Заявка,3);
			
			// Кухарь А.Ю. 04.08.2021 начало
			// + Ашан
			////нечаева 05,02,16+++
			//Если   ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-3698") 	//нечаева 24,04,17++ бигбокс
			//	и не ДокОбъект.Контрагент.код  = "SSR-6841"  Тогда
			//	// нечаева 24,04,17---
			//нечаева 05,02,16+++
			Если   кодКонтрагента <> "SSP-3698" 	//нечаева 24,04,17++ бигбокс
				и не кодКонтрагента  = "SSR-6841"  и кодКонтрагента<> "SSP-2450" Тогда
				// нечаева 24,04,17---		 
				// Кухарь А.Ю. 04.08.2021 конец
				
				Элемент=ДокументДом.СоздатьЭлемент("OrderedUnitPacksize");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ШтукВУпаковке));                     
				ТекУзел4.ДобавитьДочерний(ТекстДом);
				
			КонецЕсли;
			//нечаева 05,02,15 ---
			
			// Кухарь А.Ю. 04.08.2021 начало
			// Поле для Ашана
			Если   кодКонтрагента = "SSP-2450" тогда	//Ашан
				Элемент=ДокументДом.СоздатьЭлемент("DespatchedUnitPacksize");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ШтукВУпаковке)+".000");                     
				ТекУзел4.ДобавитьДочерний(ТекстДом);			
			КонецЕсли;		 
			// Кухарь А.Ю. 04.08.2021 конец			
			
		КонецЕсли;
		//катаев+ 30/10/13 Количество в упаковке
		//----------------------------------------------------------
		
		//Для подружки не надо (табер трейд)
		//нечаева 05,02,16+++
		Если   кодКонтрагента <> "SSP-3698"  Тогда
			
			
			Элемент=ДокументДом.СоздатьЭлемент("UnitOfMeasure");  //штрихкод
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			//Катаев+ 20/02/14
			//текстДом=ДокументДом.СоздатьТекстовыйУзел("CT");                     
			текстДом=ДокументДом.СоздатьТекстовыйУзел(КодУпаковки);                     
			//Катаев- 20/02/14
			ТекУзел4.ДобавитьДочерний(ТекстДом);
		кОНЕЦеСЛИ;
		
		//----------------------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("ItemDescription");  // наименование номенклатуры
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		//Катаев+ 30/10/13 Если заполнено наименование контрагента, то выводить его
		//текстДом=ДокументДом.СоздатьТекстовыйУзел(ТекСтрока.Номенклатура.Наименование);                      
		Если ПустаяСтрока(ТекСтрока.НаименованиеКонтрагента) Тогда
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Лев(ТекСтрока.Номенклатура.Наименование,70));
		Иначе
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Лев(ТекСтрока.НаименованиеКонтрагента,70));
		КонецЕсли;
		//Катаев- 30/10/13
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		Если ТекСтрока.Количество = 0 Тогда
			Цена = ЗаменитьТочку(ТекСтрока.Цена,2);
		Иначе
			Цена = ЗаменитьТочку(Окр(ТекСтрока.Сумма/ТекСтрока.Количество,2,0),2);
		КонецЕсли;
		//Катаев- 19/12/14
		//Катаев- 21/08/14
		
		
		//Для подружки не надо (табер трейд)
		//нечаева 05,02,16+++
		//	Если   ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-3698")  Тогда
		
		Элемент=ДокументДом.СоздатьЭлемент("UnitNetPrice");  // цена без ндс
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(цена));                      
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		//	КонецЕсли;
		
		
		кодКонтрагента = ДокОбъект.Контрагент.код ;
		
		//Катаев+ 27/10/14 Для 7 континета и Молнии добавил обяхательные поля
		Если кодКонтрагента = "SSP-1973" ИЛИ кодКонтрагента = "CHF-0006"
			// нечаева 21.09,15 +++
			или кодКонтрагента = "SSR-6024"// для красного яра.
			или кодКонтрагента= "SSR-6042"// для красного яра.
			// нечаева 21.09,15 ---
			//нечаева 24,04,17++ бигбокс
			или  кодКонтрагента  = "SSR-6841"  
			// нечаева 24,04,17---
			
			//нечаева 11,07,17++ тандер
			или  кодКонтрагента  = "SSP-3881"  
			// нечаева 11,07,17---
			
			//виктория 
			//нечаева 02,12,19++ 
			или  кодКонтрагента  = "SSR-4726"  
			//нечаева 02,12,19---
			
			//03,02,21+++ нечаева тс лама еврологистик
			или кодКонтрагента  = "SSR-6974" 
			//03,02,21---
			
			//12.07.22+++ нечаева командор
			или  кодКонтрагента = "KRF-0349" 
			//12.07.22---
			//нечаева 19,06,23++
			или   кодКонтрагента = "SST-0174"   // европа курск
			или  кодКонтрагента = "SSR-6999"   // фикс прайс нечаева 27,02,24+++
			или  кодКонтрагента = "SST-4575"     // ТС Реми, Нечаева 03,02,26 задача SNL-118
			
			// нечаева 19,06,23---
			Тогда 
			Элемент=ДокументДом.СоздатьЭлемент("UnitGrossPrice"); //Цена с НДС
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			Цена= ЗаменитьТочку(ТекСтрока.Цена,2);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
			ТекУзел4.ДобавитьДочерний(ТекстДом);
			
			Элемент=ДокументДом.СоздатьЭлемент("TaxAmount"); //Сумма НДС
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			Цена= ЗаменитьТочку(ТекСтрока.НДС,2);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
			ТекУзел4.ДобавитьДочерний(ТекстДом);
		КонецЕсли;
		//Катаев- 27/10/14
		
		
		//Нечаева + 04,02.16  Для Табре трейд (подружка)
		Если 	кодКонтрагента = "SSP-3698"	или 
			кодКонтрагента = "SSR-9999" //сладкая жизнь плюс нечаева 06,040,23+++
			Тогда 
			
			Элемент=ДокументДом.СоздатьЭлемент("TaxAmount"); //Сумма НДС
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			Цена= ЗаменитьТочку(ТекСтрока.НДС,2);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
			ТекУзел4.ДобавитьДочерний(ТекстДом);
			
			Элемент=ДокументДом.СоздатьЭлемент("UnitGrossPrice"); //Цена с НДС
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			Цена= ЗаменитьТочку(ТекСтрока.Цена,2);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
			ТекУзел4.ДобавитьДочерний(ТекстДом);
			
		КонецЕсли;
		//Нечаева --- 04,02.16
		
		
		
		// Сумма без НДС
		Сумма = ТекСтрока.Сумма;
		//Катаев- 21/08/14
		Цена= ЗаменитьТочку(Сумма,2);
		
		//Катаев+ 30/10/14 Для 7 континента не выводить
		Если кодКонтрагента <> "SSP-1973"
			
			// Кухарь А.Ю. 04.08.2021 начало
			// Для Ашана не надо
			и кодКонтрагента <> "SSP-2450" 
			
			тогда
			
			// Кухарь А.Ю. 04.08.2021 конец	
			//Для подружки не надо (табер трейд)
			//нечаева 05,02,16+++
			//и   ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-3698")  Тогда
			//нечаева 05,02,16---
			Элемент=ДокументДом.СоздатьЭлемент("NetAmount");  // сумма без ндс
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
			ТекУзел4.ДобавитьДочерний(ТекстДом);
		КонецЕсли;
		
		ОбщаяСумма=ОбщаяСумма+Сумма;
		//нечаева 19,08,15++
		ОбщаяСуммаСНДС = ОбщаяСуммаСНДС+ТекСтрока.Всего;
		ОбщаяНДС = ОбщаяНДС+ТекСтрока.НДС;
		//нечаева 19,08,15--
		
		Цена= ЗаменитьТочку(ТекСтрока.Всего,2); //Катаев+ 21/08/14
		// Кухарь А.Ю. 04.08.2021 начало
		// Для Ашана не нужно
		если кодКонтрагента <> "SSP-2450" тогда
			// Кухарь А.Ю. 04.08.2021 конец	
			Элемент=ДокументДом.СоздатьЭлемент("GrossAmount");
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
			ТекУзел4.ДобавитьДочерний(ТекстДом);
			//Катаев- 30/10/13
			//Катаев+ 01/11/13
			// Кухарь А.Ю. 04.08.2021 начало
			//
		КонецЕсли; 
		// Кухарь А.Ю. 04.08.2021 конец	
		
		
		
		если кодКонтрагента = "SSP-3698" тогда 
			// Кухарь А.Ю. 04.08.2021 конец			
			Элемент=ДокументДом.СоздатьЭлемент("TaxRate");
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			//Катаев+ 21/08/14 Ставку НДМ берем тоже из документа
			//текстДом=ДокументДом.СоздатьТекстовыйУзел("18.00");                      
			Если ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
				НДС_Текст = "10.00";
			ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
				НДС_Текст = "18.00";
			ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
				НДС_Текст = "20.00";
				//Валетов +	20,01,2026 ПУСТАЯ ЗАДАЧА  Добавить везде Ставку НДС 22
			ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС22 Тогда
				НДС_Текст = "22.00";
				//Валетов -
			ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
				НДС_Текст = "0.00";
			Иначе
				НДС_Текст = "Без НДС";
			КонецЕсли;
			//нечаева 16,11,17+++
			Если  ТекСтрока.ШККонтрагента ="3354748"    Тогда
				НДС_Текст = "0.00";
			КонецЕсли;	
			//нечаева 16,11,17---
			
			
			текстДом=ДокументДом.СоздатьТекстовыйУзел(НДС_Текст);
			ТекУзел4.ДобавитьДочерний(ТекстДом);
			//Катаев- 01/11/13
			
			// Кухарь А.Ю. 04.08.2021 начало
			// Для Ашана не нужно
		КонецЕсли;
		// Кухарь А.Ю. 04.08.2021 конец		
		
		
		
		//Для подружки не надо (табер трейд)
		//нечаева 05,02,16+++
		Если   кодКонтрагента<> "SSP-3698"  Тогда
			// Кухарь А.Ю. 04.08.2021 начало
			// Для Ашана не нужно
			если кодКонтрагента <> "SSP-2450" тогда 
				// Кухарь А.Ю. 04.08.2021 конец			
				Элемент=ДокументДом.СоздатьЭлемент("TaxRate");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				//Катаев+ 21/08/14 Ставку НДМ берем тоже из документа
				//текстДом=ДокументДом.СоздатьТекстовыйУзел("18.00");                      
				Если ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
					НДС_Текст = "10.00";
				ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
					НДС_Текст = "18.00";
				ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
					НДС_Текст = "20.00";
					//Валетов +	20,01,2026 ПУСТАЯ ЗАДАЧА  Добавить везде Ставку НДС 22
				ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС22 Тогда
					НДС_Текст = "22.00";
					//Валетов -
				ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
					НДС_Текст = "0.00";
				Иначе
					НДС_Текст = "Без НДС";
				КонецЕсли;
				//нечаева 16,11,17+++
				Если  ТекСтрока.ШККонтрагента ="3354748"    Тогда
					НДС_Текст = "0.00";
				КонецЕсли;	
				//нечаева 16,11,17---
				
				
				текстДом=ДокументДом.СоздатьТекстовыйУзел(НДС_Текст);
				ТекУзел4.ДобавитьДочерний(ТекстДом);
				//Катаев- 01/11/13
				
				// Кухарь А.Ю. 04.08.2021 начало
				// Для Ашана не нужно
			КонецЕсли;
			// Кухарь А.Ю. 04.08.2021 конец		
			
			
			// нечаева 15,01,25+++ тандер
			//<ReleaseDatePeriod>2005-07-25-2005-08-25</ReleaseDatePeriod>  период производства
			//<BestBeforeDatePeriod>2005-07-25-2005-08-25</BestBeforeDatePeriod>  период срока годности
			
			// Это для меркурия, закомментировала пока
			// нечаева 02,07,25++ теперь нужно всем.	
			Если кодКонтрагента = "SSP-3881" тогда
				// дата производства  
				Дата1=Формат(ДобавитьМЕсяц(ТекущаяДата(),-3), "ДФ=""гггг-ММ-дд""");
				Дата2=Формат(ДобавитьМЕсяц(ТекущаяДата(),-4), "ДФ=""гггг-ММ-дд""");
				
				
				Элемент=ДокументДом.СоздатьЭлемент("ReleaseDatePeriod");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Дата2)+"-"+Строка(Дата1));                      
				ТекУзел4.ДобавитьДочерний(ТекстДом);
				
				Элемент=ДокументДом.СоздатьЭлемент("BestBeforeDatePeriod");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Дата1)+"-"+Строка("2099-01-31"));                      
				ТекУзел4.ДобавитьДочерний(ТекстДом);
				
			КонецЕсли; 
			//// нечаева 15,01,25 тандер ----
			
			
			
			//нечаева 15,09,23++
			// для авоськи ExpiryDate
			если кодКонтрагента = "SSP-2812" тогда
				
				Элемент=ДокументДом.СоздатьЭлемент("ExpiryDate");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка("2099-01-31"));                      
				ТекУзел4.ДобавитьДочерний(ТекстДом);
				
				// дата производства  ProductionDate
				Дата1=Формат(ДобавитьМЕсяц(ТекущаяДата(),-3), "ДФ=""гггг-ММ-дд""");
				
				Элемент=ДокументДом.СоздатьЭлемент("ProductionDate");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Дата1));                      
				ТекУзел4.ДобавитьДочерний(ТекстДом);
				
				
			КонецЕсли; 
			
			
			
			//----------------------------------------------------------
			//ГТД
			
			ГТД=ПолучитьГрупповойПериодическийРеквизит(ТекСтрока.Номенклатура.Родитель,"НомерГТД",ТекущаяДата());
			
			Если ГТД = Неопределено или ГТД.СтранаПроисхождения.Наименование="РОССИЯ" Тогда
				//--------------------------------------------------------------------------------
				Элемент=ДокументДом.СоздатьЭлемент("CountryOfOriginCode");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел("RU");                      
				ТекУзел4.ДобавитьДочерний(ТекстДом);
			Иначе
				Если Врег(""+ГТД.СтранаПроисхождения)<>"РОССИЯ" И НЕ ПустаяСтрока(""+ГТД.СтранаПроисхождения) Тогда
					Страна		=""+ГТД.СтранаПроисхождения;
					НомерГТД	=СокрЛП(""+ГТД.Наименование);
				КонецЕсли;
				Если НомерГТД="" Тогда
					Сообщить("Для номенклатуры - "+ТекСтрока.Номенклатура+" - не определен номер ГТД! ");
					ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - Для номенклатуры - "+ТекСтрока.Номенклатура+" - не определен номер ГТД!","Важное");
					Ошибка=1;
				КонецЕсли;	
				
				//--------------------------------------------------------------------------------
				// ищем номер страны для гтд
				//--------------------------------------------------------------------------------
				Макет=Справочники.КлассификаторСтранМира.ПолучитьМакет("КлассификаторСтранМира");
				Искомое2 = СокрЛП(Страна);  //значение в макете есть, не находит
				Искомое = Макет.НайтиТекст(Искомое2); //,, ОбластьПоиска);
				Если Искомое<>Неопределено ТОгда
					Строка=Искомое.Низ;
					Колонка=Искомое.Лево+1; // для кода
				КонецЕсли;
				// получаем код
				
				Страна=Макет.Область(Строка,Колонка).Текст;
				//--------------------------------------------------------------------------------
				//Элемент=ДокументДом.СоздатьЭлемент("CountryOfOriginCode");
				//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Страна));                      
				//ТекУзел4.ДобавитьДочерний(ТекстДом);
				
				// ТС Реми, Нечаева 03,02,26 задача SNL-118
				// Для Реми RU, BY, KZ, AM, KG - не выводим.
				если кодКонтрагента = "SST-4575" тогда
					Если Страна<>"RU" и  Страна<>"BY" и    Страна<>"KZ" и 
						Страна<>"AM" и         Страна<>"KG" 
						
						Тогда
						Элемент=ДокументДом.СоздатьЭлемент("CountryOfOriginCode");
						ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
						текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Страна));                      
						ТекУзел4.ДобавитьДочерний(ТекстДом);
						
					конецЕсли;
				иначе
					//--------------------------------------------------------------------------------
					Элемент=ДокументДом.СоздатьЭлемент("CountryOfOriginCode");
					ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Страна));                      
					ТекУзел4.ДобавитьДочерний(ТекстДом);
				КонецЕсли;
				
				
				//----------------------------------------------------------
				Элемент=ДокументДом.СоздатьЭлемент("CustomsDeclarationNumber");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(НомерГТД));                      
				ТекУзел4.ДобавитьДочерний(ТекстДом);
				
				
			КонецЕсли; 
			// нечаева 05,05,16---
			
			
			// нечаева 04,05,25+++ перенесли блок в другое место.
			Если кодКонтрагента = "SSP-3881" и ПризнакКроссДокинга тогда
				
				
				//*********************************************************************************
				//<ProductsExpiry>     срок годности
				
				//<ProductExpiry>
				//<ProductPackageId>1</ProductPackageId>
				//<ProductExpiryDate>2018-10-21</ProductExpiryDate>    срок годности
				//<ProductionDate>2018-10-10</ProductionDate>       дата производства
				//<TotalShelfLifePeriod>11</TotalShelfLifePeriod>    срок в днях
				//<ProductQuantity>1.000</ProductQuantity>       количество товара
				//</ProductExpiry>
				//</ProductsExpiry>
				//----------------------------------------------------------------
				Дата1=Формат(ДобавитьМЕсяц(ТекущаяДата(),-3), "ДФ=""гггг-ММ-дд""");
				Дата2=Формат(ДобавитьМЕсяц(ТекущаяДата(),-4), "ДФ=""гггг-ММ-дд""");
				сскод = текстрока.сскод;
				// найдем строку и получим вес.
				
				ИдТ= ИДУпаковки1; // по умолчанию. номер упаковки
				
				Отбор = Новый Структура();
				Отбор.Вставить("ССкод",текстрока.сскод);
				СтрокиССКодами = ТЗССКодыТовары.НайтиСтроки(Отбор);
				Для каждого НТекСтрока из СтрокиССКодами Цикл
					ИДТ = НТекСтрока.Ид;				
					
					//*******************************************************************************
					Элемент=ДокументДом.СоздатьЭлемент("ProductsExpiry");
					ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
					
					Элемент=ДокументДом.СоздатьЭлемент("ProductExpiry");  
					ТекУзел5=ТекУзел4.ДобавитьДочерний(Элемент);
					//---------------------------------------------------------------
					
					Элемент=ДокументДом.СоздатьЭлемент("ProductPackageId");
					ТекУзел6=ТекУзел5.ДобавитьДочерний(Элемент);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ИдТ));                      
					ТекУзел6.ДобавитьДочерний(ТекстДом);
					
					//--------------------------------------------------------------
					
					Элемент=ДокументДом.СоздатьЭлемент("ProductExpiryDate");
					ТекУзел6=ТекУзел5.ДобавитьДочерний(Элемент);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка("2099-01-31"));                      
					ТекУзел6.ДобавитьДочерний(ТекстДом);
					
					//--------------------------------------------------------------
					
					Элемент=ДокументДом.СоздатьЭлемент("ProductionDate");
					ТекУзел6=ТекУзел5.ДобавитьДочерний(Элемент);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Дата2));                      
					ТекУзел6.ДобавитьДочерний(ТекстДом);
					
					//--------------------------------------------------------------
					// это в упаковке, а не в строке
					
					Кол=ЗаменитьТочку(НТекСтрока.Количество/ШтукВУпаковке,3);
					
					Элемент=ДокументДом.СоздатьЭлемент("ProductQuantity");
					ТекУзел6=ТекУзел5.ДобавитьДочерний(Элемент);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(кол));                      
					ТекУзел6.ДобавитьДочерний(ТекстДом);
					
					
				КонецЦикла;
				
			конецЕсли;
			// нечаева 04,05,25---
			
			
			
			
			
			
			
			// код производителя для авоськи и тандер 17,05,25+++
			//Line-Parties
			//нечаева 15,09,23+++
			если кодКонтрагента = "SSP-2812" или кодКонтрагента = "SSP-3881" тогда
				//Наименование производителя – из декларации, импортер – из ГТД
				ОтборДляГТД = неопределено; Декларация=Неопределено;
				Модель = Текстрока.Номенклатура.родитель; 
				//если ЗначениеЗаполнено(Страна) тогда
				//	ОтборДляГТД=новый Структура;
				//	ОтборДляГТД.Вставить("Страна",Страна);
				//иначе 
				//	ОтборДляГТД = Неопределено;
				//КонецЕсли;
				
				если Декларация=Неопределено тогда
					Декларация = ПолучитьПериодическийРеквизит(Модель,"Декларация",ТекущаяДата(),,,ОтборДляГТД);
				КонецЕсли;
				
				Изготовитель= неопределено;
				Если декларация <> Неопределено тогда
					НомерДекларации = декларация.Наименование;
					Изготовитель = декларация.Изготовитель;
					Орган = декларация.Орган;
					ФабрикаИзготовитель = декларация.Филиал;
					если СокрЛП(декларация.Филиал) <> "" и СокрЛП(декларация.Изготовитель)<>СокрЛП(декларация.Филиал)  тогда
						Филиал= "Предприятие-изготовитель: " + декларация.Филиал;
					иначе Филиал = ""
					КонецЕсли;
					ВидДокумента = декларация.ВидДокумента;	
					ДатаНачалаДекларации = Формат(декларация.ДатаНачала,"ДФ=dd.MM.yy");
					ДатаОкончанияДекларации = Формат(декларация.ДатаОкончания,"ДФ=dd.MM.yy");
				иначе
					//Сообщить("На позицию "+Номенклатура+" не установлена действующая декларация");	
				КонецЕсли;
				
				
				
				Элемент=ДокументДом.СоздатьЭлемент("Line-Parties");
				ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
				
				Элемент=ДокументДом.СоздатьЭлемент("Manufacturer");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				//ТекУзел4.ДобавитьДочерний(ТекстДом);
				
				//--------------------------------------------------------------------------------
				Элемент=ДокументДом.СоздатьЭлемент("Name");
				ТекУзел5=ТекУзел4.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Изготовитель));                      
				ТекУзел5.ДобавитьДочерний(ТекстДом);
				//--------------------------------------------------------------------------------
				//Элемент=ДокументДом.СоздатьЭлемент("FiscalNumber");
				//ТекУзел5=ТекУзел4.ДобавитьДочерний(Элемент);
				//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Страна));                      
				//ТекУзел5.ДобавитьДочерний(ТекстДом);
				////--------------------------------------------------------------------------------
				//Элемент=ДокументДом.СоздатьЭлемент("UtilizationRegisterNumber");
				//ТекУзел5=ТекУзел4.ДобавитьДочерний(Элемент);
				//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Страна));                      
				//ТекУзел5.ДобавитьДочерний(ТекстДом);
				
			КонецЕсли;
			
			
			
			
			
			//<Line-Measurements>
			//<GrossWeight>12.120</GrossWeight>  вес брутто
			//<NetVolume>12.000</NetVolume>          нетто
			//<StorageTemperature>50.00</StorageTemperature>  темпиратура хранения
			
			// нечаева 16,01,25+++ тандер
			
			//</Line-Measurements>
			//CT - коробка    https://edi-n.readthedocs.io/ru/latest/XML/units_edi.html
			Если кодКонтрагента = "SSP-3881" и ПризнакКроссДокинга тогда
				
				
				//*********************************************************************************
				//<ProductsExpiry>     срок годности
				
				//<ProductExpiry>
				//<ProductPackageId>1</ProductPackageId>
				//<ProductExpiryDate>2018-10-21</ProductExpiryDate>    срок годности
				//<ProductionDate>2018-10-10</ProductionDate>       дата производства
				//<TotalShelfLifePeriod>11</TotalShelfLifePeriod>    срок в днях
				//<ProductQuantity>1.000</ProductQuantity>       количество товара
				//</ProductExpiry>
				//</ProductsExpiry>
				//----------------------------------------------------------------
				Дата1=Формат(ДобавитьМЕсяц(ТекущаяДата(),-3), "ДФ=""гггг-ММ-дд""");
				Дата2=Формат(ДобавитьМЕсяц(ТекущаяДата(),-4), "ДФ=""гггг-ММ-дд""");
				сскод = текстрока.сскод;
				// найдем строку и получим вес.
				
				ИдТ= ИДУпаковки1; // по умолчанию. номер упаковки
				
				//// ищем все строки с товаром, номер паллеты сскода
				//НайденнаяСтрока = ТЗССКодыТовары.Найти(текстрока.номенклатура, "Номенклатура");
				//Если НайденнаяСтрока <> Неопределено Тогда
				//	ИДТ =НайденнаяСтрока.Ид;
				//иначе 
				//	ИдТ= ИДУпаковки1;
				//КонецЕсли;     
				////------------------------------------	
				
				
				Отбор = Новый Структура();
				Отбор.Вставить("ССкод",текстрока.сскод);
				СтрокиССКодами = ТЗССКодыТовары.НайтиСтроки(Отбор);   
				// нечаева 04,05,25+++ - перенесли в другое место блок.
				//Для каждого НТекСтрока из СтрокиССКодами Цикл
				//	ИДТ = НТекСтрока.Ид;				
				//	
				//	//*******************************************************************************
				//	Элемент=ДокументДом.СоздатьЭлемент("ProductsExpiry");
				//	ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
				//	
				//	Элемент=ДокументДом.СоздатьЭлемент("ProductExpiry");  
				//	ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				//	//---------------------------------------------------------------
				//	
				//	Элемент=ДокументДом.СоздатьЭлемент("ProductPackageId");
				//	ТекУзел5=ТекУзел4.ДобавитьДочерний(Элемент);
				//	текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ИдТ));                      
				//	ТекУзел5.ДобавитьДочерний(ТекстДом);
				//	
				//	//--------------------------------------------------------------
				//	
				//	Элемент=ДокументДом.СоздатьЭлемент("ProductExpiryDate");
				//	ТекУзел5=ТекУзел4.ДобавитьДочерний(Элемент);
				//	текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка("2099-01-31"));                      
				//	ТекУзел5.ДобавитьДочерний(ТекстДом);
				//	
				//	//--------------------------------------------------------------
				//	
				//	Элемент=ДокументДом.СоздатьЭлемент("ProductionDate");
				//	ТекУзел5=ТекУзел4.ДобавитьДочерний(Элемент);
				//	текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Дата2));                      
				//	ТекУзел5.ДобавитьДочерний(ТекстДом);
				//	
				//	//--------------------------------------------------------------
				//	// это в упаковке, а не в строке
				//	
				//	Кол=ЗаменитьТочку(НТекСтрока.Количество/ШтукВУпаковке,3);
				//	
				//	Элемент=ДокументДом.СоздатьЭлемент("ProductQuantity");
				//	ТекУзел5=ТекУзел4.ДобавитьДочерний(Элемент);
				//	текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(кол));                      
				//	ТекУзел5.ДобавитьДочерний(ТекстДом);
				//	
				//	
				//КонецЦикла;
				
				//**********************************************************************************
				//**********************************************************************************
				Элемент=ДокументДом.СоздатьЭлемент("Line-Measurements");
				ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
				
				//---------------------------------------------------------------
				Элемент=ДокументДом.СоздатьЭлемент("GrossWeight");  //вес брутто штуки
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				
				брутто = ТекСтрока.Номенклатура.Родитель.ВесБруттоШтуки;
				брутто = ЗаменитьТочку(брутто,3);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(брутто)); 
				ТекУзел4.ДобавитьДочерний(ТекстДом);
				
				//---------------------------------------------------------------
				// вес нетто  штуки   брутто*,9
				нетто =0.9*ТекСтрока.Номенклатура.Родитель.ВесБруттоШтуки;
				
				Кол1=ЗаменитьТочку(нетто,3);
				Элемент=ДокументДом.СоздатьЭлемент("NetVolume");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(кол1));                      
				ТекУзел4.ДобавитьДочерний(ТекстДом);
				//---------------------------------------------------------------
				// темпиратура хранения
				Элемент=ДокументДом.СоздатьЭлемент("StorageTemperature");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка("+50"));                      
				ТекУзел4.ДобавитьДочерний(ТекстДом);
				//--------------------------------------------------------------
				
				
				ТекУзел4.ДобавитьДочерний(ТекстДом);
				
			КонецЕсли; 
			// нечаева 16,01,25 тандер ----
			
			
			
			//Катаев+ 10/10/13 Если есть упаковка, то помещаем номенклатуру в нее  // для тк лето не надо 28,04,25+++ нечаева
			Если ИДУпаковки <> 0  и не (КодКонтрагента = "SSR-9519")
				// ТС Реми, Нечаева 03,02,26 задача SNL-118 , тоже не надо пока.
				и не (КодКонтрагента = "SST-4575")
				Тогда
				
				//Нечаева 16,04,18+++
				//для паллет по Перекрестку не прописываем SSCC коды.
				//Если  НЕ (Контрагент.родитель.код = "SSR-4117" и ТекСтрока.ШККонтрагента ="3354748") Тогда
				
				// для тандера отделаьно выделим   - должно быть несоклько, но как это заполнять не понятно?????? только для последней будет
				Если кодКонтрагента = "SSP-3881" тогда
					
					ИдТ= ИДУпаковки1; // по умолчанию
					// найдем номер упаковки
					//НайденнаяСтрока = ТЗССКодыТовары.Найти(текстрока.номенклатура, "Номенклатура");
					//Если НайденнаяСтрока <> Неопределено Тогда
					//	ИДТ =НайденнаяСтрока.Ид;
					//иначе 
					//	ИдТ= ИДУпаковки1;
					//КонецЕсли;     
					
					
					НайденнаяСтрока = ТЗССКодыТовары.Найти(текстрока.сскод, "сскод");
					Если НайденнаяСтрока <> Неопределено Тогда
						ИДТ =НайденнаяСтрока.Ид;
					иначе 
						ИдТ= ИДУпаковки1;
					КонецЕсли; 
					
					
					//---------------------------------------------------------------------------
					Элемент=ДокументДом.СоздатьЭлемент("Package-Reference");
					ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
					
					Элемент=ДокументДом.СоздатьЭлемент("PackageId");
					ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
					//Строка(ИдТ);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ИДТ));
					ТекУзел4.ДобавитьДочерний(ТекстДом);
					//------------------------------------------------------------
					Элемент=ДокументДом.СоздатьЭлемент("Quantity");
					ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
					
					Кол=ЗаменитьТочку(ТекСтрока.Количество/ШтукВУпаковке,3);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Кол)); 
					ТекУзел4.ДобавитьДочерний(ТекстДом);
					//------------------------------------------------------------
					// NumberOfUnitsInPackage - количество коробок на паллете
					ШтукВКоробе = ТекСтрока.Номенклатура.Родитель.ШтукВКоробке;
					
					//Валетов + 19,01,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8575 Добавил проверку на 0 Чтоб делилось без ошибки
					//Кол1=ЗаменитьТочку(ТекСтрока.Количество/ШтукВКоробе,0);
					Кол1=ЗаменитьТочку(ТекСтрока.Количество/?(ШтукВКоробе = 0,1,ШтукВКоробе),0);
					//Валетов -
					Элемент=ДокументДом.СоздатьЭлемент("NumberOfUnitsInPackage");
					ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(кол1));                      
					ТекУзел4.ДобавитьДочерний(ТекстДом);
					
					ТекУзел4.ДобавитьДочерний(ТекстДом);
					
					
				иначе	
					Элемент=ДокументДом.СоздатьЭлемент("Package-Reference");
					ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
					
					Элемент=ДокументДом.СоздатьЭлемент("PackageId");
					ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
					//Катаев+ 18/12/14 Если это Перекресток, то каждую позицию помещаем на отдельный палет.
					//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ИДУпаковки)); 
					
					// нечаева 20,01,24+++
					// для тандера
					Если кодКонтрагента = "SSP-3881" тогда
						//Строка(ИдТ);
						текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ИДТ));
					иначе
						текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ИДУпаковки1));
					конецЕсли;
					//нечаева 20,01,24--
					// было ТекстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ИДУпаковки1));
					
					Если ДокОбъект.Контрагент.Родитель = Справочники.Контрагенты.НайтиПоКоду("SSR-4117")
						или кодКонтрагента = "SSR-9519"
						
						Тогда 
						ИДУпаковки1 = ИДУпаковки1+1
					КонецЕсли;
					//Катаев- 18/12/14
					ТекУзел4.ДобавитьДочерний(ТекстДом);
					//------------------------------------------
					Элемент=ДокументДом.СоздатьЭлемент("Quantity");
					ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
					
					Кол=ЗаменитьТочку(ТекСтрока.Количество/ШтукВУпаковке,3);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Кол)); 
					ТекУзел4.ДобавитьДочерний(ТекстДом);
					
					
					ТекУзел4.ДобавитьДочерний(ТекстДом);
				КонецЕсли;
				
				
				//КонецЕсли;
				//нечаева 16,04,18---
			КонецЕсли;
			//Катаев- 10/10/13
			
			
			//-------------------------------------------------------------------------
			//<Line-Packages>	C4		
			//   <Package>	M[4]		Фасовка, может повторятся от 1 до 4 раз.
			//		<PackageType>PA</PackageType>	M	X(3)	Тип упаковки
			//		<PackageQuantity>100</PackageQuantity>	M	X(35)	Количество в упаковке
			//		<PackageUnitOfMeasure>100</PackageUnitOfMeasure>	M	X(3)	Единица измерения количества
			//   </Package>			
			//</Line-Packages>			
			// тандер 16,01,25 +++
			Если кодКонтрагента = "SSP-3881"  и ПризнакКроссДокинга  тогда
				
				Элемент=ДокументДом.СоздатьЭлемент("Line-Packages");
				ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
				
				Элемент=ДокументДом.СоздатьЭлемент("Package");  //
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				
				//---------------------------------------------------------------
				// 
				Элемент=ДокументДом.СоздатьЭлемент("PackageType");
				ТекУзел5=ТекУзел4.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка("CT"));                      
				ТекУзел5.ДобавитьДочерний(ТекстДом);
				//---------------------------------------------------------------
				// штук в коробке
				ШтукВКоробе = ТекСтрока.Номенклатура.Родитель.ШтукВКоробке;
				Кол1=ЗаменитьТочку(ШтукВКоробе,0);
				Элемент=ДокументДом.СоздатьЭлемент("PackageQuantity");
				ТекУзел5=ТекУзел4.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(кол1));                      
				ТекУзел5.ДобавитьДочерний(ТекстДом);
				//--------------------------------------------------------------
				Элемент=ДокументДом.СоздатьЭлемент("PackageUnitOfMeasure");
				ТекУзел5=ТекУзел4.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка("PCE"));                      
				ТекУзел5.ДобавитьДочерний(ТекстДом);
				
				//--------------------------------------------------------------
				
				//ТекУзел4.ДобавитьДочерний(ТекстДом);
				// Package
				//ТекУзел4.ДобавитьДочерний(ТекстДом);
				
			КонецЕсли; 
			// нечаева 16,01,25 тандер ----
			
			
			
			
			
		КонецЕсли;
		
		РР=РР+1;
		
	КонецЦикла;
	
	Если Ошибка = 0 Тогда
		
		//Катаев+ 30/10/14 Для 7 континента не выводить
		Если кодКонтрагента <> "SSP-1973" Тогда
			КорневойЭлемент=ДокументДом.ЭлементДокумента;
			//-------- Order-Header ------------------------------------------
			ЭлементДом=ДокументДом.СоздатьЭлемент("DespatchAdvice-Summary");
			ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
			
			// ТС Реми, Нечаева 03,02,26 задача SNL-118	
			Если кодКонтрагента = "SST-4575"  Тогда
				
				рр = рр-1;
				Элемент2=ДокументДом.СоздатьЭлемент("TotalLines");
				ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(рр));
				ТекУзел2.ДобавитьДочерний(ТекстДом);
				//------------------------------------------------------------
			КонецЕсли;
			
			
			//Катаев+ 08/12/14 для Перекрестка вывод другого элемнета в подвале
			Если кодРОдителяКонтр = "SSR-4117" Тогда
				рр = рр-1;
				Элемент2=ДокументДом.СоздатьЭлемент("TotalLines");
				ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(рр));
				ТекУзел2.ДобавитьДочерний(ТекстДом);
			Иначе
				//----------------------------------------------------------------
				
				
				//Для подружки
				//Для подружки надо (табер трейд)
				//нечаева 05,02,16+++
				Если   кодКонтрагента <> "SSP-3698"  Тогда
					
					Элемент2=ДокументДом.СоздатьЭлемент("TotalAmount");
					ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
					ОбщаяСумма=ЗаменитьТочку(ОбщаяСумма,2);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ОбщаяСумма));
					ТекУзел2.ДобавитьДочерний(ТекстДом);
					
				КонецЕсли;
				
				
				//------------------------------------------------------------
				Элемент2=ДокументДом.СоздатьЭлемент("TotalQuantity");  // общее количество
				ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
				колДок=ЗаменитьТочку(колДок,2);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(КолДок));
				ТекУзел2.ДобавитьДочерний(ТекстДом);
				//------------------------------------------------------------
				
				// для окей 
				// нечаева 19,08,15+++
				Если кодКонтрагента = "SSP-5862"
					или  // европа курск  нечаева 19,06,23++
					кодКонтрагента = "SST-0174"
					Тогда
					рр = рр-1;
					Элемент2=ДокументДом.СоздатьЭлемент("TotalLines");
					ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(рр));
					ТекУзел2.ДобавитьДочерний(ТекстДом);
					//------------------------------------------------------------
					//TotalGrossAmount - общая сумма с НДС
					
					Элемент2=ДокументДом.СоздатьЭлемент("TotalGrossAmount");
					ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
					ОбщаяСуммаСНДС=ЗаменитьТочку(ОбщаяСуммаСНДС,2);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ОбщаяСуммаСНдс));
					ТекУзел2.ДобавитьДочерний(ТекстДом);
					
					//------------------------------------------------------------
					//сумма НДС
					Элемент2=ДокументДом.СоздатьЭлемент("TotalTaxAmount");
					ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
					ОбщаяНДС=ЗаменитьТочку(ОбщаяНДС,2);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ОбщаяНДС));
					ТекУзел2.ДобавитьДочерний(ТекстДом);
					
				КонецЕсли;
				// нечаева 19,08,15---
				
				// для ТС Реми, Нечаева 03,02,26 задача SNL-118
				// нечаева 03,02,26+++
				Если кодКонтрагента = "SST-4575"  Тогда
					
					Элемент2=ДокументДом.СоздатьЭлемент("TotalNetAmount");
					ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
					Сумма= товары.Итог("Сумма");
					Цена= ЗаменитьТочку(сумма,3);	//сумма без НДС
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(цена));
					ТекУзел2.ДобавитьДочерний(ТекстДом);
					
					//---------------------------------------------------------------
					
					Элемент2=ДокументДом.СоздатьЭлемент("TotalTaxAmount");
					ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
					Сумма= товары.Итог("ндс");
					Цена= ЗаменитьТочку(сумма,3);	//сумма без НДС
					
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(цена));
					ТекУзел2.ДобавитьДочерний(ТекстДом);
					//---------------------------------------------------------------
					
					Элемент2=ДокументДом.СоздатьЭлемент("TotalGrossAmount");
					ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
					Сумма= товары.Итог("всего");
					Цена= ЗаменитьТочку(сумма,3);	//сумма без НДС
					
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(цена));
					ТекУзел2.ДобавитьДочерний(ТекстДом);
					
					
				конецЕсли;	
				
				
				//Для подружки
				//Для подружки надо (табер трейд)
				//нечаева 05,02,16+++
				Если   кодКонтрагента = "SSP-3698"
					//нечаева 24,04,17++ бигбокс
					или  кодКонтрагента  = "SSR-6841"  
					// нечаева 24,04,17---
					//командор
					или  кодКонтрагента  = "KRF-0349" 
					Тогда
					
					//TotalGrossAmount - общая сумма с НДС
					
					Элемент2=ДокументДом.СоздатьЭлемент("TotalGrossAmount");
					ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
					ОбщаяСуммаСНДС=ЗаменитьТочку(ОбщаяСуммаСНДС,2);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ОбщаяСуммаСНдс));
					ТекУзел2.ДобавитьДочерний(ТекстДом);
				КонецЕсли;			
				
				
				//нечаева 11,07,17 +++   тандер
				Если   кодКонтрагента = "SSP-3881" 
					или
					// виктория
					//нечаева 02,12,19++ 
					кодКонтрагента = "SSR-4726" 
					//нечаева 02,12,19--
					
					//03,02,21+++ нечаева тс лама еврологистик
					или  кодКонтрагента  = "SSR-6974" 
					//03,02,21---
					
					Тогда
					
					//TotalGrossAmount - общая сумма с НДС
					
					Элемент2=ДокументДом.СоздатьЭлемент("TotalGrossAmount");
					ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
					ОбщаяСуммаСНДС=ЗаменитьТочку(ОбщаяСуммаСНДС,2);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ОбщаяСуммаСНдс));
					ТекУзел2.ДобавитьДочерний(ТекстДом);
					
					//------------------------------------------------------------
					//сумма НДС
					Элемент2=ДокументДом.СоздатьЭлемент("TotalTaxAmount");
					ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
					ОбщаяНДС=ЗаменитьТочку(ОбщаяНДС,2);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ОбщаяНДС));
					ТекУзел2.ДобавитьДочерний(ТекстДом);
				КонецЕсли;			
				// нечаева 11,07,17 ---
				
				
			КонецЕсли;
		КонецЕсли;
		
		
		//C:\Users\nechaeva\Desktop\тандер\1
		
		//	// для тестов по тандеру
		//	ИмяФайлаОбмена = "C:\Users\nechaeva\Desktop\тандер\1\"+ссылка.Номер+".xml";
		//	
		//	////---------------------------------------------------------------
		//	ЗаписьДом=Новый ЗаписьDom;
		//	ЗаписьДом.Записать(ДокументДом,ЗаписьХМЛ);
		//	ЗаписьХМЛ.Закрыть();
		//	ф1 = новый ЧтениеТекста(ВремФайл);
		//	ф2 = Новый ЗаписьТекста(ИмяФайлаОбмена);
		//	стр = ф1.ПрочитатьСтроку();
		//	Пока стр <> Неопределено Цикл
		//		Если стр <> "<?xml version=""1.0"" encoding=""UTF-8""?>" Тогда
		//			ф2.ЗаписатьСтроку(стр);
		//		КонецЕсли;
		//		стр = ф1.ПрочитатьСтроку();
		//	КонецЦикла;
		//	ф2.Закрыть();
		//	ф1.Закрыть();
		//	УдалитьФайлы(КаталогВременныхФайлов(),ДокОбъект.Номер+".xml");
		//	
		//	
		//
		//	
		//	
		//	
		//  временно закрыла
		//
		
		//---------------------------------------------------------------
		ЗаписьДом=Новый ЗаписьDom;
		ЗаписьДом.Записать(ДокументДом,ЗаписьХМЛ);
		ЗаписьХМЛ.Закрыть();
		ф1 = новый ЧтениеТекста(ВремФайл);
		ф2 = Новый ЗаписьТекста(ИмяФайлаОбмена);
		стр = ф1.ПрочитатьСтроку();
		Пока стр <> Неопределено Цикл
			Если стр <> "<?xml version=""1.0"" encoding=""UTF-8""?>" Тогда
				ф2.ЗаписатьСтроку(стр);
			КонецЕсли;
			стр = ф1.ПрочитатьСтроку();
		КонецЦикла;
		ф2.Закрыть();
		ф1.Закрыть();
		УдалитьФайлы(КаталогВременныхФайлов(),ДокОбъект.Номер+".xml");
		//Катаев+ 02/10/14
		//	Сообщить("Сформирован файл: "+ИмяФайлаОбмена+" "+КаталогВременныхФайлов());
		//ПереданПокупателюВЭлВиде = Истина;
		//ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - уведомление было успешно создано","Информация");
		//Катаев+ 14/11/14
		//нечаева 22,09,20+++
		Если Провайдер = 0 или Провайдер = 3 Тогда
			// нечаева 22,09,20---
			Если ПланыОбмена.Основной.ЭтотУзел() <> ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
				//				Соединение.Записать(ИмяФайлаОбмена, ИмяФайлаОбменаФТП);
				УдалитьФайлы(КаталогВременныхФайлов(),ДокОбъект.Номер+"_.xml");
				Сообщить("Сформирован файл на ftp: ");
				ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - уведомление было успешно создано","Информация");
			Иначе
				#Если Клиент Тогда
					Сообщить("Сформирован файл: "+ИмяФайлаОбмена);
				#КонецЕсли
				
				ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - уведомление было успешно создано","Информация");
			КонецЕсли;
		Иначе
			Соединение.Записать(ИмяФайлаОбмена, ИмяФайлаОбменаФТП);
			//Если ошибка то проверить имя файла.
			УдалитьФайлы(КаталогВременныхФайлов(),ДокОбъект.Номер+"_.xml");
			ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - подтверждение было успешно создано на ftp СКБ-Контур","Информация");
		КонецЕсли;
		
		//нечаева 30,01,15 ++++
		// запишем данные в регистр сведений, чтобы не отправлять второй раз
		ЗаписатьДанныеВРегистрОтправкаЭлектронныхДокументов(ссылка,,Перечисления.ДокументЕКОД.УведомлениеОбОтгрузке);
		//нечаева 30,01,15 ---
		
		// нечаева  - пока оставим эту галку, посомтри, как будет работать обмен, до тестирования.
		//Катаев- 14/11/14
		ПереданПокупателюВЭлВиде = Истина;
		//Катаев- 02/10/14
		
		
		
		
		
		
		
		//нечаева 10,10,17++++
		// пропишем состояние, что требуется УПД,  или корректировочный УПД
		// для тандера и Ашана акты приемки не нужны. Тут проставляем статус
		
		//Тандер. 
		Если кодКонтрагента = "SSP-3881" Тогда
			//Нечаева 09,03,23++
			ДокументПрописан =ДокументПрописан();
			Если НЕ  документПрописан Тогда
				МенеджерЗаписи = РегистрыСведений.СостояниеЭлектронногоУПД.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Комментарий ="запись документа рнк1";
				МенеджерЗаписи.Объект = ДокОбъект.ссылка;
				МенеджерЗаписи.Дата = ТекущаяДата();
				МенеджерЗаписи.СостояниеУПД = перечисления.СостояниеУПД.ТребуетсяУПД;
				
				МенеджерЗаписи.Записать();
			конецЕсли;
			//нечаева 09,03,23---
			
		КонецЕсли;
		//нечаева 10,10,17---
		
	Иначе
		
		ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - обнаружены ошибки, файл уведомления не создан!","Важное");
		//	Сообщить("Обнаружены ошибки, файл не записан!");
		
	КонецЕсли;
КонецПроцедуры
//Катаев- 24/04/13



//для Холидей, вместо уведомления об отгрузке.формируется документ Накладная  DELIVERYNOTE из Инвойс
//нечаева 21,04,17+++
Процедура СформироватьИнвойсКорус(ДокОбъект, Ошибка, Провайдер)
	
	//нечаева 18,05,21+++
	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Кухарь А.Ю. 31.03.2026 начало
	// Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом тогда
	Если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() тогда
		//Кухарь А.Ю. 31.03.2026 конец       
		ЗаписатьВЛог("ОшибкиЕкод","Отмена выполнения. подтверждение не создано "+ДокОбъект+" база "+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
		
		ошибка=1;
		
		Возврат ;
	КонецЕсли;
	// нечаева 18,05,21----
	
	
	
	// формируется документ Накладная  DELIVERYNOTE
	
	Если ПустаяСтрока(ДокОбъект.Контрагент.Родитель.КодИЛН) Тогда
		ИЛНПок =  ДокОбъект.Контрагент.КодИЛН;
	Иначе
		ИЛНПок =  ДокОбъект.Контрагент.Родитель.КодИЛН;
	КонецЕсли;
	//	ИЛНПок =  ДокОбъект.Контрагент.КодИЛН;
	
	ИЛНПост = "4607182079990EC";
	
	//	провайдер = 0; // пока всегда корус
	
	Если Провайдер = 0 Тогда
		Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
			// нечаева 270122+++
			ПутьДляУвед = ПолучитьПутьДляУведИнвойс(КаталогЕкода+ИЛНПост+"\"+ИЛНПок+"\OUT\");
			// нечаева 270122----
			Если ПутьДляУвед = Неопределено ТОгда
				ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - не удалось определить путь для сохранения файла уведомления","Важное");
				
				Ошибка = 1;
				
				Возврат;
			КонецЕсли;
			ИмяФайлаОбмена = ПутьДляУвед+"\"+ДокОбъект.Номер+".xml";
			#Если Клиент Тогда
				сообщить(ИмяФайлаОбмена);
			#КонецЕсли	
		Иначе
			// склад или филиал
			Если ДокОбъект.Склад.КодФизическогоУзла <> ПланыОбмена.Основной.ЭтотУзел().Код Тогда
				Ошибка = 1;
				Возврат;
			КонецЕсли;
			
			УзелЦО = ПланыОбмена.Основной.НайтиПоКоду("SNL");
			КаталогFTP="ediECOD\4607182079990EC\"+ИЛНПок+"\OUT\";
			
			Если докОбъект.контрагент.родитель.код = "SSR-4144" Тогда
				КаталогFTP="ediECOD\4607182079990EC\9777992579999\OUT\";
			КонецЕсли;
			
			
			ПользовательFTP = "ecode";
			Соединение=УстановитьFTPСоединение(УзелЦО.АдресОбмена,ПользовательFTP,УзелЦО.Пароль,,УзелЦО.ПассивныйРежим);
			Если Соединение=Неопределено Тогда
				Сообщить("Невозможно установить соединение с ftp");
				Ошибка = 1;
				Возврат;
			КонецЕсли;
			Соединение.УстановитьТекущийКаталог(КаталогFTP);
			//Пути = Соединение.НайтиФайлы(, "INVOICE_*");         DELIVERYNOTE
			Пути = Соединение.НайтиФайлы(, "DELIVERYNOTE_*"); 
			Если Пути.Количество() = 0 Тогда
				
				Ошибка = 1;
				Возврат;
			Иначе
				//	ПутьДляУведомления = Соединение.НайтиФайлы(, "INVOICE_*")[0].Имя;
				ПутьДляУведомления = Соединение.НайтиФайлы(, "DELIVERYNOTE_*")[0].Имя;
				Соединение.УстановитьТекущийКаталог(ПутьДляУведомления);
				ИмяФайлаОбменаФТП = ДокОбъект.Номер+".xml";
				//ИмяФайлаОбмена = КаталогВременныхФайлов()+"INVOICE_"+ДокОбъект.Номер+"_.xml";  //докОбъект номер или СФ номер?
				ИмяФайлаОбмена = КаталогВременныхФайлов()+"DELIVERYNOTE_"+ДокОбъект.Номер+"_.xml";  //докОбъект номер или СФ номер?
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если ПланыОбмена.Основной.ЭтотУзел() <> ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
			Если ДокОбъект.Склад.КодФизическогоУзла <> ПланыОбмена.Основной.ЭтотУзел().Код Тогда
				Ошибка = 1;
				Возврат;
			КонецЕсли;
		КонецЕсли;
		КаталогFTP="Outbox";
		// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
		//ПользовательFTP="*%*%*%";
		//ПарольFTP="*$*$*$";
		ПользовательFTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКFTPКонтур).Логин;
		ПарольFTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКFTPКонтур).Пароль;
		// Ихсанов Д. А. Конец  14.10.2025
		АдресFTP = "ftp-edi.kontur.ru";
		Соединение=УстановитьFTPСоединение(АдресFTP,ПользовательFTP,ПарольFTP,,Истина);
		Если Соединение=Неопределено Тогда
			Сообщить("Невозможно установить соединение с ftp");
			Ошибка = 1;
			Возврат;
		КонецЕсли;
		Соединение.УстановитьТекущийКаталог(КаталогFTP);
		ИмяФайлаОбменаФТП = "Пз_"+СокрЛП(ДокОбъект.НомерЗаказа)+".xml";
		ИмяФайлаОбмена = КаталогВременныхФайлов()+"Инв_"+ДокОбъект.НомерЗаказа+"_.xml";
	КонецЕсли;
	
	ВремФайл = КаталогВременныхФайлов()+ДокОбъект.Номер+".xml";
	
	Ошибка=0;
	
	
	Если ПустаяСтрока(ДокОбъект.НомерЗаказа) Тогда
		Ошибка = 1;
		#Если Клиент Тогда
			Сообщить(Строка(ДокОбъект)+" - не заполнен номер заказа.");
		#Иначе
			ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - не заполнен номер заказа. ","Важное");
		#КонецЕсли
		Возврат;
	КонецЕсли;
	
	ИЛНПост = ПолучитьИЛН_Пост(ДокОбъект.Склад);
	Если ИЛНПост = Неопределено Тогда
		ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - не удалось определить ИЛН поставщика для формирования УПД уведомления","Важное");
		Возврат;
	КонецЕсли;
	ИЛНПост = "4607182079990EC";
	
	//
	//ПутьДляУвед = ПолучитьПутьДляУвед(Константы.КаталогЕКОД.Получить()+ИЛНПост+"\"+ИЛНПок+"\OUT\");
	//Если ПутьДляУвед = Неопределено ТОгда
	//	ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - не удалось определить путь для сохранения файла ","Важное");
	//	Возврат;
	//КонецЕсли;
	//ИмяФайлаОбмена = ПутьДляУвед+"\Invois_"+ДокОбъект.Номер+".xml";
	
	//ВремФайл = КаталогВременныхФайлов()+ДокОбъект.Номер+".xml";
	//
	//сообщить(ВремФайл);
	
	Ошибка=0;
	
	СписокКодИЛН=ДокОбъект.ПунктДоставки.ИЛН;
	
	//Катаев+ 02/12/13
	//КодИЛН=ДокОбъект.ПунктДоставки.КодИЛН;
	КодИЛН=ДокОбъект.Контрагент.КодИЛН;
	//Катаев- 02/12/13
	
	
	ЗаписьХМЛ=Новый ЗаписьXML;
	ЗаписьХМЛ.ОткрытьФайл(ВремФайл);   //(Путь+Имя+".xml");
	ДокументДом=Новый ДокументDom("","Document-Invoice");   // "http://v8.1c./8.1/sample91_DOM","Document-Order"
	КорневойЭлемент=ДокументДом.ЭлементДокумента;
	//-------- Order-Header ------------------------------------------
	ЭлементДом=ДокументДом.СоздатьЭлемент("Invoice-Header");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	//----------------------------------------------------------------
	// номер СФ
	
	СФ=Неопределено;
	СФ=СчетФактураНакладной(ДокОбъект.Ссылка,ДокОбъект.Организация);
	
	Если СФ = неопределено тогда
		сообщить("СФ не существует.");
		возврат;
	КонецЕсли;	
	
	Элемент2=ДокументДом.СоздатьЭлемент("InvoiceNumber");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(ДокОбъект.Номер);
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	//------------------------------------------------------------
	
	//нечаева 17,08,16+++ для ленты дата документа = дате отгрузки
	ДатаДок=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""гггг-ММ-дд""");
	
	Элемент2=ДокументДом.СоздатьЭлемент("InvoiceDate");  // дата
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаДок));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("InvoiceCurrency");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	текстДом=ДокументДом.СоздатьТекстовыйУзел("RUB");
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("DocumentFunctionCode");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	текстДом=ДокументДом.СоздатьТекстовыйУзел("D");
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("Remarks");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	текстДом=ДокументДом.СоздатьТекстовыйУзел("order_no: "+Строка(ДокОбъект.НомерЗаказа));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	
	
	////------------------------------------------------------------
	//Элемент2=ДокументДом.СоздатьЭлемент("MessageType");
	//ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел("INVDOP"); // INVDOP - упд.  SET - комплект. SF - сф, WAYBILL - накладная.
	//ТекУзел2.ДобавитьДочерний(ТекстДом);
	
	//---------------------------------------------------------------------------------------------------------------
	//	
	//ЭлементДом=ДокументДом.СоздатьЭлемент("Documents");
	//ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	//----------------------------------------------------------------
	
	//Элемент2=ДокументДом.СоздатьЭлемент("Documents");
	//ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	//
	//
	//Элемент3=ДокументДом.СоздатьЭлемент("DocumentDescription");
	//ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел("Товары переданы");
	//ТекУзел3.ДобавитьДочерний(ТекстДом);
	//
	//// следующий блок --------
	//Элемент3=ДокументДом.СоздатьЭлемент("Document");
	//ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
	//
	//// документы основания	
	//Элемент4=ДокументДом.СоздатьЭлемент("DocumentNumber");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(ДокОбъект.Договор.Наименование);
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	////----
	//Элемент4=ДокументДом.СоздатьЭлемент("DocumentDate");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//
	//ДатаДок2=Формат(ДокОбъект.Договор.Дата, "ДФ=""гггг-ММ-дд"""); 
	//
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДатаДок2));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	////----
	//Элемент4=ДокументДом.СоздатьЭлемент("DocumentName");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел("Договор");
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//
	//-----------------------------------------------------------------------------
	
	
	//-----------------------------------------------------------------------------
	// номер и дата, уведомления об отгрузке
	
	Элемент2=ДокументДом.СоздатьЭлемент("Delivery");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	
	//------------------------------------------------------------
	Элемент3=ДокументДом.СоздатьЭлемент("DeliveryDate");  // дата
	ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
	ДатаДок=Формат(ДокОбъект.ДатаПриемки, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаДок));  // СФ.Дата
	ТекУзел3.ДобавитьДочерний(ТекстДом);
	
	//----------------------------------------------------------------
	Элемент3=ДокументДом.СоздатьЭлемент("DeliveryNoteNumber");
	ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);                                     ///////????????????????????????????????????????
	текстДом=ДокументДом.СоздатьТекстовыйУзел(ДокОбъект.Номер); //СФ.Номер потом номер СФ будет     !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
	ТекУзел3.ДобавитьДочерний(ТекстДом);
	////------------------------------------------------------------
	//Элемент3=ДокументДом.СоздатьЭлемент("DeliveryNoteDate");  // дата
	//ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
	//ДатаДок=Формат(ДокОбъект.Дата, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаДок));  // СФ.Дата
	//ТекУзел3.ДобавитьДочерний(ТекстДом);
	
	//DeliveryDate
	//----------------------------------------------------------------
	
	
	//-------- Order-Header ------------------------------------------
	ЭлементДом=ДокументДом.СоздатьЭлемент("Invoice-Reference");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	//----------------------------------------------------------------
	// номер СФ
	
	
	Элемент2=ДокументДом.СоздатьЭлемент("Order");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	//----------------------------------------------------------------
	Элемент3=ДокументДом.СоздатьЭлемент("BuyerOrderNumber");
	ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(ДокОбъект.НомерЗаказа);
	ТекУзел3.ДобавитьДочерний(ТекстДом);
	//------------------------------------------------------------
	
	
	Элемент3=ДокументДом.СоздатьЭлемент("BuyerOrderDate");  // дата
	ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
	ДатаДок=Формат(ДокОбъект.ДатаЗаказа, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
	текстДом=ДокументДом.СоздатьТекстовыйУзел(ДатаДок);
	ТекУзел3.ДобавитьДочерний(ТекстДом);
	
	
	//--------------------------------------------------------------------------------------------------
	
	Элемент2=ДокументДом.СоздатьЭлемент("TaxInvoice");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	//----------------------------------------------------------------
	Элемент3=ДокументДом.СоздатьЭлемент("TaxInvoiceNumber");   // номер СФ
	ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(СФ.Номер);
	ТекУзел3.ДобавитьДочерний(ТекстДом);
	//------------------------------------------------------------
	
	
	Элемент3=ДокументДом.СоздатьЭлемент("TaxInvoiceDate");  // дата  СФ
	ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
	ДатаДок=Формат(СФ.Дата, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
	текстДом=ДокументДом.СоздатьТекстовыйУзел(ДатаДок);
	ТекУзел3.ДобавитьДочерний(ТекстДом);
	
	
	
	
	ЭлементДом=ДокументДом.СоздатьЭлемент("Invoice-Parties");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	//----------------------------------------------------------------
	
	
	//Элемент2=ДокументДом.СоздатьЭлемент("Documents");
	//ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	//
	
	Элемент3=ДокументДом.СоздатьЭлемент("Buyer");
	ТекУзел3=ТекУзел1.ДобавитьДочерний(Элемент3);
	
	
	
	Элемент4=ДокументДом.СоздатьЭлемент("ILN");
	ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	
	текстДом=ДокументДом.СоздатьТекстовыйУзел(Лев(ДокОбъект.Контрагент.КодИЛН,13));
	ТекУзел4.ДобавитьДочерний(ТекстДом);
	
	
	Элемент4=ДокументДом.СоздатьЭлемент("TaxID");
	ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.контрагент.ИНН));
	ТекУзел4.ДобавитьДочерний(ТекстДом);
	
	
	//Элемент4=ДокументДом.СоздатьЭлемент("UtilizationRegisterNumber");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.контрагент.КПП));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	
	//Элемент4=ДокументДом.СоздатьЭлемент("Name");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.контрагент.ПолноеНаименование));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	
	//----------------------------------------------------------------------------------------------------------------------------
	//                  наши реквизиты как поставщика	
	
	
	Элемент3=ДокументДом.СоздатьЭлемент("Seller");
	ТекУзел3=ТекУзел1.ДобавитьДочерний(Элемент3);
	
	
	Элемент4=ДокументДом.СоздатьЭлемент("ILN");
	ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	текстДом=ДокументДом.СоздатьТекстовыйУзел("4607182079990");
	ТекУзел4.ДобавитьДочерний(ТекстДом);
	
	
	Элемент4=ДокументДом.СоздатьЭлемент("TaxID");
	ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.Организация.ИНН));
	ТекУзел4.ДобавитьДочерний(ТекстДом);
	
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("UtilizationRegisterNumber");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.Организация.КПП));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("CodeByBuyer");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.КодПоставщика));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	
	
	//Элемент4=ДокументДом.СоздатьЭлемент("Name");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.Организация.ПолноеНаименование()));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("ManagingPerson");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка("Антонова Светлана"));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("ManagingPersonFather");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел("Петровна");
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("ContactFunction");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел("Сотрудник отдела ПРО");
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("AccountingContact");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел("Андреева Мария Александровна");
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("InsuranceContact");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка("0"));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("SupplierContact");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка("1"));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("AuthorityContact");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//// получим номер доверенности при подписании документов            //Антонова
	//СтрокаДов = ПроверкаПраваПодписи(ДокОбъект.ссылка,Справочники.ФизическиеЛица.НайтиПоКоду("AVT-000015"),истина,ДокОбъект.Организация);
	//
	////А = Формат('20020820153309', "ДЛФ=Д");
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка("доверенность "+СтрокаДов.НомерДоверенности+" от  "+Формат(СтрокаДов.датаДоверенности,"ДЛФ=Д")));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("StreetAndNumber");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(" улица Академика Королева,дом 9, корпус 5"));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("CityName");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка("г. Москва"));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("ProvinceCode");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка("77"));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("PostalCode");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка("129515"));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("Country");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка("RU"));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	
	
	//------------------------------------------------------------------------------------------------------------------------------
	//----------------------------------------------------------------------------------------------------------------------------
	//                 пункт доставки	
	
	
	Элемент3=ДокументДом.СоздатьЭлемент("DeliveryPoint");
	ТекУзел3=ТекУзел1.ДобавитьДочерний(Элемент3);
	
	//
	//Запрос = новый Запрос;
	//Запрос.текст = "ВЫБРАТЬ
	//|	КонтактнаяИнформация.Объект КАК Объект,
	//|	КонтактнаяИнформация.Поле1 КАК Индекс,
	//|	КонтактнаяИнформация.Поле2 КАК Регион,
	//|	КонтактнаяИнформация.Поле3 КАК Район,
	//|	КонтактнаяИнформация.Поле4 КАК Город,
	//|	КонтактнаяИнформация.Поле5 КАК НаселенныйПункт,
	//|	КонтактнаяИнформация.Поле6 КАК Улица
	//|ИЗ
	//|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	//|ГДЕ
	//|	КонтактнаяИнформация.Вид = &Вид
	//|	И КонтактнаяИнформация.Тип = &Тип
	//|	И КонтактнаяИнформация.Объект = &ПунктДоставки";
	//Запрос.УстановитьПараметр("Вид",Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента);
	//Запрос.УстановитьПараметр("Тип",перечисления.ТипыКонтактнойИнформации.Адрес);
	//Запрос.УстановитьПараметр("ПунктДоставки", ДокОбъект.ПунктДоставки);
	//
	//Рез = Запрос.Выполнить().Выбрать();
	//Если Рез.Следующий() Тогда
	//	СтрокаАдреса=Рез;
	//иначе
	//	СтрокаАдреса = "";
	//	сообщить("Для документа "+Докобъект.Ссылка+" не найден адрес пункта доставки, заполните в ТЧ списка СФ на отправку.");
	//	//возврат;
	//КонецЕсли;                                        
	
	
	Элемент4=ДокументДом.СоздатьЭлемент("ILN");
	ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.ПунктДоставки.КодИЛН));
	ТекУзел4.ДобавитьДочерний(ТекстДом);
	
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("TaxID");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.Контрагент.ИНН));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("UtilizationRegisterNumber");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.Контрагент.КПП));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("Name");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.ПунктДоставки.ПолноеНаименование()));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("StreetAndNumber");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	////текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(СтрокаАдреса.Улица));
	//текстДом=ДокументДом.СоздатьТекстовыйУзел("");
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("CityName");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	
	СтрАдр = "";
	//Если СокрЛП(СтрокаАдреса.Регион) <>"" Тогда
	//	СтрАдр=СтрАдр+""+СтрокаАдреса.Регион+" область";
	//КонецЕсли;
	//Если СокрЛП(СтрокаАдреса.район) <>"" Тогда
	//	СтрАдр=СтрАдр+", "+СтрокаАдреса.район;
	//КонецЕсли;
	//
	//Если СокрЛП(СтрокаАдреса.город) <>"" Тогда
	//	СтрАдр=СтрАдр+", "+СтрокаАдреса.город;
	//КонецЕсли;
	//
	//Если СокрЛП(СтрокаАдреса.населенныйПункт) <>"" Тогда
	//	СтрАдр=СтрАдр+", "+СтрокаАдреса.населенныйПункт;
	//КонецЕсли;
	//	
	//	текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(СтрАдр));
	//	ТекУзел4.ДобавитьДочерний(ТекстДом);
	//	
	//	Элемент4=ДокументДом.СоздатьЭлемент("ProvinceCode");
	//	ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//	// найдем из таблички. код регион
	//	//КодРег = КодРегионаПоНазванию(СокрЛП(СтрокаАдреса.Регион));
	//	КодРег = КодРегионаПоНазванию(СокрЛП(""));
	//	
	//	текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(КодРег));
	//	ТекУзел4.ДобавитьДочерний(ТекстДом);
	//	
	//	Элемент4=ДокументДом.СоздатьЭлемент("PostalCode");
	//	ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	////	текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(СтрокаАдреса.Индекс));
	//	текстДом=ДокументДом.СоздатьТекстовыйУзел("");
	//	ТекУзел4.ДобавитьДочерний(ТекстДом);
	//	
	//	Элемент4=ДокументДом.СоздатьЭлемент("Country");
	//	ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//	текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка("RU"));
	//	ТекУзел4.ДобавитьДочерний(ТекстДом);
	//	
	
	
	//------------------------------------------------------------------------------------------------------------------------------
	//----------------------------------------------------------------------------------------------------------------------------
	//                  наши реквизиты как грузоотправителя	
	
	//
	//Элемент3=ДокументДом.СоздатьЭлемент("Consignor");
	//ТекУзел3=ТекУзел1.ДобавитьДочерний(Элемент3);
	//
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("ILN");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел("4607182079990");
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("TaxID");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.Организация.ИНН));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("UtilizationRegisterNumber");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.Организация.КПП));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("Name");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.Организация.ПолноеНаименование()));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("ManagingPerson");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(""));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("ManagingPersonFather");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел("");
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("StreetAndNumber");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(" улица Академика Королева,дом 9, корпус 5"));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("CityName");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка("г. Москва"));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("ProvinceCode");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка("77"));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("PostalCode");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка("129515"));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("Country");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка("RU"));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//-------------------------------------------------------------------------------------------------------------------------------
	//-------------------------------------------------------------------------------------------------------------------------------
	//                          Consignor
	
	//Элемент3=ДокументДом.СоздатьЭлемент("Carrier");
	//ТекУзел3=ТекУзел1.ДобавитьДочерний(Элемент3);
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("Name");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.Организация.ПолноеНаименование()));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("ManagingPerson");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(""));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("ManagementContact");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(""));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	//
	//
	//Элемент4=ДокументДом.СоздатьЭлемент("ContactFunction");
	//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(""));
	//ТекУзел4.ДобавитьДочерний(ТекстДом);
	
	
	
	//----------------------------------------------------------------------------------------------------------------------------
	//                 
	
	Элемент3=ДокументДом.СоздатьЭлемент("Invoicee");
	ТекУзел3=ТекУзел1.ДобавитьДочерний(Элемент3);
	
	Элемент4=ДокументДом.СоздатьЭлемент("ILN");
	ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(Лев(ДокОбъект.Контрагент.КодИЛН,13));
	ТекУзел4.ДобавитьДочерний(ТекстДом);
	
	
	//----------------------------------------------------------------------------------------------------------------------------
	//                 
	
	Элемент3=ДокументДом.СоздатьЭлемент("Payer");
	ТекУзел3=ТекУзел1.ДобавитьДочерний(Элемент3);
	
	
	Элемент4=ДокументДом.СоздатьЭлемент("ILN");
	ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(Лев(ДокОбъект.Контрагент.КодИЛН,13));
	ТекУзел4.ДобавитьДочерний(ТекстДом);
	
	
	
	//************************************************************************************************************************	
	//-------------------------
	//    заполнение строк
	//-------------------------
	//************************************************************************************************************************	
	
	ЭлементДом=ДокументДом.СоздатьЭлемент("Invoice-Lines");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	
	тз = ДокОбъект.Товары.Выгрузить();
	тз.Колонки.Добавить("ШККонтрагента");
	тз.Колонки.Добавить("АртикулКонтрагента");
	тз.Колонки.Добавить("НаименованиеКонтрагента");
	тз.Колонки.Добавить("Кратность");
	// поменяла запрос, поставила как в поисках цен, иначе брал артикул непонятно из какой матрицы, упорядочение сделала
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	МатрицаТовары.Номенклатура,
	|	МатрицаТовары.ШККонтрагента,
	|	МатрицаТовары.АртикулКонтрагента,
	|	МатрицаТовары.Ссылка,
	|	МатрицаТовары.НаименованиеКонтрагента,
	|	МатрицаТовары.Кратность,
	|	МатрицаТовары.ШККонтрагентаБлочок
	|ИЗ
	|	Документ.Матрица.Товары КАК МатрицаТовары
	|ГДЕ
	|	МатрицаТовары.Ссылка.Дата <= &Дата1
	|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
	|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
	|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА";
	//нечаева 18,07,17++
	Попытка
		Если Ссылка.ПостояннаяАкция Тогда
			Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
			//крохин начало 28.07.2017
			//постоянные акции только под галку
		Иначе
			Запрос.Текст = Запрос.Текст +" И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция";
			//крохин конец 28.07.2017
		КонецЕсли;
	Исключение
	КонецПопытки;	
	Запрос.Текст = Запрос.Текст +"	
	|УПОРЯДОЧИТЬ ПО
	|	МатрицаТовары.Ссылка.Дата УБЫВ
	|АВТОУПОРЯДОЧИВАНИЕ";
	//нечаева 18,07,17---
	
	Запрос.УстановитьПараметр("Контрагент",ДокОбъект.Контрагент);
	Запрос.УстановитьПараметр("Дата1",КонецДня(ДокОбъект.Дата));
	Запрос.УстановитьПараметр("ТекДата",ДокОбъект.Дата);
	
	
	тз1 = Запрос.Выполнить().Выгрузить();
	Для Каждого ТекСтрока Из тз Цикл
		// пропускаем номенклатуру без количества
		// Для 7 континента не пропускаем
		Если ТекСтрока.Количество<=0 И ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-1973")
			//21,08,17 ++ нечаева для тандера
			И ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-3881")
			//21,08,17 -- нечаева для тандера
			//нечаева 10,12,20+++
			и ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSR-3546")
			//нечаева 10,12,20---
			
			Тогда
			Продолжить;
		КонецЕсли; 
		ШКПоМатрице=НЕопределено;
		АртикулПоМатрице=НЕопределено;
		НайденнаяСтрока = тз1.Найти(ТекСтрока.Номенклатура,"Номенклатура");
		Если НайденнаяСтрока <> Неопределено ТОгда
			Если ПустаяСтрока(НайденнаяСтрока.ШККонтрагентаБлочок) Тогда
				ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагента;
			Иначе
				ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагентаБлочок;
			КонецЕсли;
			ТекСтрока.АртикулКонтрагента = НайденнаяСтрока.АртикулКонтрагента;
			ТекСтрока.НаименованиеКонтрагента = НайденнаяСтрока.НаименованиеКонтрагента;
			
			ТекСтрока.Кратность = Число(НайденнаяСтрока.Кратность);
		Иначе
			
			//Сообщить("В номенклатурной матрице не найдена номенклатура "+ТекСтрока.Номенклатура);
			
			Ошибка = 1;
			
		КонецЕсли;
		
	КонецЦикла;
	//тз.Свернуть("Номенклатура, ШККонтрагента, АртикулКонтрагента, Цена","Количество, Заявка");
	///----------------------------------------------------------------------------------------------------------------------------
	
	Если Ошибка = 1 Тогда
		Возврат;
	КонецЕсли;
	
	ОбщаяСумма=0;
	//нечаева 18,05,15 +++
	ОбщаяСуммаСНДС = 0;
	ОбщаяНДС = 0;
	
	РР=1;
	
	колДок = 0;
	
	//Нечаева 06,04,15+++++
	// для 7 континента сворачиваем 5 позиций по спайкам.
	ТЗАртикулы = новый ТаблицаЗначений;
	
	Если ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-1973") Тогда
		
		ТЗАртикулы = ТЗ.скопировать();
		ТЗАртикулы.свернуть("АртикулКонтрагента,Цена,СтавкаНДС","заявка,количество,Всего,Сумма,НДС");
		ТЗАртикулы.колонки.добавить("ШККонтрагента"); 
		ТЗАртикулы.колонки.добавить("НаименованиеКонтрагента"); 
		ТЗАртикулы.колонки.добавить("Кратность"); 
		ТЗАртикулы.колонки.добавить("Номенклатура"); 
		
		
		Для Каждого ТекСтрока Из тзАртикулы Цикл
			
			ШКПоМатрице=НЕопределено;
			АртикулПоМатрице=НЕопределено;
			НайденнаяСтрока = тз1.Найти(ТекСтрока.АртикулКонтрагента,"АртикулКонтрагента");
			Если НайденнаяСтрока <> Неопределено ТОгда
				Если ПустаяСтрока(НайденнаяСтрока.ШККонтрагентаБлочок) Тогда
					ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагента;
				Иначе
					ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагентаБлочок;
				КонецЕсли;
				ТекСтрока.АртикулКонтрагента = НайденнаяСтрока.АртикулКонтрагента;
				ТекСтрока.НаименованиеКонтрагента = НайденнаяСтрока.НаименованиеКонтрагента;
				ТекСтрока.Кратность = Число(НайденнаяСтрока.Кратность);
				ТекСтрока.Номенклатура = НайденнаяСтрока.Номенклатура;
			Иначе
				
			КонецЕсли;
			Если ТекСтрока.АртикулКонтрагента = "121459" Тогда
				ШК = "8308583260760";
			КонецЕсли;
			
			Если ТекСтрока.АртикулКонтрагента = "121344" Тогда
				ШК = "88308583347850";
			КонецЕсли;
			
			Если ТекСтрока.АртикулКонтрагента = "170466" Тогда
				ШК = "8300277515859";
			КонецЕсли;
			
			Если ТекСтрока.АртикулКонтрагента = "177010" Тогда
				ШК = "8300277516931";
			КонецЕсли;
			
			Если ТекСтрока.АртикулКонтрагента = "121139" Тогда
				ШК = "8300497008261";
			КонецЕсли;
			
		КонецЦикла;
		
		
		///перенесла 09,04,15++
		// проверка, если код артикула = "" тогда не выводить ничего
		//----------------------
		Для Каждого ТекСтрока Из тзАртикулы Цикл
			Если СокрЛП(текСтрока.артикулКонтрагента) = "" Тогда
				//Сообщить("Для номенклатуры - "+ТекСтрока.Номенклатура+" - не определен артикул контрагента, для выгрузки в Е-код!!! (Заполните Документ Матрица)");
				ошибка = 1;
			КонецЕсли;
		конецЦикла;
		
		
	КонецЕсли;
	
	///-------------------------------------------
	ТЗДляОтправки = ТЗ;
	// для 7 континента сворачиваем 5 позиций по спайкам.
	Если ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-1973") Тогда
		
		ТЗДляОтправки = ТЗАртикулы;
		
	КонецЕсли;
	
	Для Каждого ТекСтрока из тзДляОтправки Цикл
		// нечаева 06,04,015 --------	
		
		
		//Катаев+ 31/10/14 Для 7 континента не пропускаем
		//Если ТекСтрока.Количество<=0 Тогда
		Если ТекСтрока.Количество<=0 И ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-1973") 
			//21,08,17 ++ нечаева для тандера
			И ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-3881")
			//21,08,17 -- нечаева для тандера
			//нечаева 10,12,20+++
			и ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSR-3546")
			//нечаева 10,12,20---
			
			Тогда
			//Катаев- 31/10/14
			Продолжить;
		КонецЕсли; 
		Если ТекСтрока.ШККонтрагента="" Тогда
			ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - Для номенклатуры - "+ТекСтрока.Номенклатура+" - не определен штрихкод, для выгрузки в Е-код!!! (Заполните Документ Матрица)","Важное");
			//	Сообщить("Для номенклатуры - "+ТекСтрока.Номенклатура+" - не определен штрихкод, для выгрузки в Е-код!!! (Заполните Документ Матрица)");
			Ошибка=1;
			Продолжить;
		КонецЕсли;
		
		// нечаева 24,1024+++ добавила для метро
		Если ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSR-1593") 
			и ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-8643") 
			
			
			Тогда
			ШтукВУпаковке = 1;
			КодУпаковки = "PCE";
		Иначе
			//Катаев+ 07/10/14 Если в матрице есть крмтность, то берем ее, иначе из номенклатуры
			//ШтукВУпаковке = ТекСтрока.Номенклатура.Родитель.ШтукВКоробочке;
			Если ТекСтрока.Кратность > 0 Тогда
				ШтукВУпаковке = ТекСтрока.Кратность;
			Иначе
				ШтукВУпаковке = ТекСтрока.Номенклатура.Родитель.ШтукВКоробочке;
			Конецесли;
			//Катаев- 07/10/14
			Если ШтукВУпаковке = 0 Тогда
				ШтукВУпаковке = 1;
			КонецЕсли;
			КодУпаковки = "CT";
		Конецесли;
		//Катаев- 20/02/14
		
		Элемент=ДокументДом.СоздатьЭлемент("Line");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент);
		//----------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("Line-Item");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		
		
		Элемент=ДокументДом.СоздатьЭлемент("LineNumber");
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(рр));                 
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		//
		//Элемент=ДокументДом.СоздатьЭлемент("OrderLineNumber");
		//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(рр));                 
		//ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		//
		//Элемент=ДокументДом.СоздатьЭлемент("LineItemInformation");
		//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка("1"));                 
		//ТекУзел4.ДобавитьДочерний(ТекстДом);
		//
		
		//---------------------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("EAN");  //штрихкод
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(ТекСтрока.ШККонтрагента);                      
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		//----------------------------------------------------------
		Если Не ПустаяСтрока(ТекСтрока.АртикулКонтрагента) Тогда
			Элемент=ДокументДом.СоздатьЭлемент("BuyerItemCode");  //ариткул
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(ТекСтрока.АртикулКонтрагента);                     
			ТекУзел4.ДобавитьДочерний(ТекстДом);
		КонецЕсли;
		
		
		////Катаев+ 30/10/14 Для 7 континента и Подружки( табер трейд) не выводить
		//Если ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-1973")
		//	и  ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-3698")  Тогда
		//	
		//	Элемент3=ДокументДом.СоздатьЭлемент("SupplierItemCode");
		//	ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент3);
		//	текстДом=ДокументДом.СоздатьТекстовыйУзел(Текстрока.Номенклатура.код);
		//	ТекУзел4.ДобавитьДочерний(ТекстДом);
		//	
		//КонецЕсли;
		
		
		//----------------------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("ItemDescription");  // наименование номенклатуры
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		// Если заполнено наименование контрагента, то выводить его
		Если ПустаяСтрока(ТекСтрока.НаименованиеКонтрагента) Тогда
			текстДом=ДокументДом.СоздатьТекстовыйУзел(ТекСтрока.Номенклатура.Наименование);
		Иначе
			текстДом=ДокументДом.СоздатьТекстовыйУзел(ТекСтрока.НаименованиеКонтрагента);
		КонецЕсли;
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		
		//---------------------------------------------------------------
		
		Элемент=ДокументДом.СоздатьЭлемент("ItemType");
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка("CU"));                     
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		
		
		
		//----------------------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("InvoiceQuantity");  //коли отправ
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		
		//Кол=ЗаменитьТочку(ТекСтрока.Количество,3);
		Кол=ЗаменитьТочку(ТекСтрока.Количество/ШтукВУпаковке,3);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Кол));
		колДок = КолДок+ТекСтрока.Количество/ШтукВУпаковке;
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		
		//Для подружки не надо (табер трейд)
		Если ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-3698")  Тогда
			
			Элемент=ДокументДом.СоздатьЭлемент("UnitOfMeasure");  //штрихкод
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			
			текстДом=ДокументДом.СоздатьТекстовыйУзел(КодУпаковки);                     
			ТекУзел4.ДобавитьДочерний(ТекстДом);
		кОНЕЦеСЛИ;
		
		//----------------------------------------------------------------------------
		Если ТекСтрока.Количество = 0 Тогда
			Цена = ЗаменитьТочку(ТекСтрока.Цена,2);
		Иначе
			Цена = ЗаменитьТочку(Окр(ТекСтрока.Сумма/ТекСтрока.Количество,2,0),2);
		КонецЕсли;
		
		//Для подружки не надо (табер трейд)
		Если   ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-3698")  Тогда
			Элемент=ДокументДом.СоздатьЭлемент("InvoiceUnitNetPrice");  // цена без ндс
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(цена));                      
			ТекУзел4.ДобавитьДочерний(ТекстДом);
			
			//----------------------------------------------------
			Элемент=ДокументДом.СоздатьЭлемент("InvoiceUnitGrossPrice");  // цена с ндс
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			Цена = ЗаменитьТочку(ТекСтрока.Цена,2);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(цена));                      
			ТекУзел4.ДобавитьДочерний(ТекстДом);
			
			//InvoiceUnitGrossPrice
		КонецЕсли;
		
		//
		//Элемент=ДокументДом.СоздатьЭлемент("OrderedUnitPacksize");
		//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ШтукВУпаковке));                     
		//ТекУзел4.ДобавитьДочерний(ТекстДом);
		//
		//
		
		
		//// Сумма без НДС
		//Сумма = ТекСтрока.Сумма;
		//Цена= ЗаменитьТочку(Сумма,2);
		//
		//Если ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-1973")
		//	
		//	//Для подружки не надо (табер трейд)
		//	и   ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-3698")  Тогда
		//	
		//	Элемент=ДокументДом.СоздатьЭлемент("NetAmount");  // сумма без ндс
		//	ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		//	текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
		//	ТекУзел4.ДобавитьДочерний(ТекстДом);
		//КонецЕсли;
		//
		ОбщаяСумма=ОбщаяСумма+ТекСтрока.Сумма;
		//нечаева 19,08,15++
		ОбщаяСуммаСНДС = ОбщаяСуммаСНДС+ТекСтрока.Всего;
		ОбщаяНДС = ОбщаяНДС+ТекСтрока.НДС;
		//нечаева 19,08,15--
		//
		//Цена= ЗаменитьТочку(ТекСтрока.Всего,2); //Катаев+ 21/08/14
		//
		//Элемент=ДокументДом.СоздатьЭлемент("GrossAmount");
		//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
		//ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		
		//Для подружки не надо (табер трейд)
		//нечаева 05,02,16+++
		Если   ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-3698")  Тогда
			
			
			ГТД=ПолучитьГрупповойПериодическийРеквизит(ТекСтрока.Номенклатура.Родитель,"НомерГТД",ТекущаяДата());
			
			Если ГТД = Неопределено или ГТД.СтранаПроисхождения.Наименование="РОССИЯ" Тогда
				//--------------------------------------------------------------------------------
				Элемент=ДокументДом.СоздатьЭлемент("CountryOfOriginCode");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел("RU");                      
				ТекУзел4.ДобавитьДочерний(ТекстДом);
			Иначе
				Если Врег(""+ГТД.СтранаПроисхождения)<>"РОССИЯ" И НЕ ПустаяСтрока(""+ГТД.СтранаПроисхождения) Тогда
					Страна		=""+ГТД.СтранаПроисхождения;
					НомерГТД	=СокрЛП(""+ГТД.Наименование);
				КонецЕсли;
				Если НомерГТД="" Тогда
					//	Сообщить("Для номенклатуры - "+ТекСтрока.Номенклатура+" - не определен номер ГТД! ");
					ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - Для номенклатуры - "+ТекСтрока.Номенклатура+" - не определен номер ГТД!","Важное");
					Ошибка=1;
				КонецЕсли;	
				
				//--------------------------------------------------------------------------------
				// ищем номер страны для гтд
				//--------------------------------------------------------------------------------
				Макет=Справочники.КлассификаторСтранМира.ПолучитьМакет("КлассификаторСтранМира");
				Искомое2 = СокрЛП(Страна);  //значение в макете есть, не находит
				Искомое = Макет.НайтиТекст(Искомое2); //,, ОбластьПоиска);
				Если Искомое<>Неопределено ТОгда
					Строка=Искомое.Низ;
					Колонка=Искомое.Лево+1; // для кода
				КонецЕсли;
				// получаем код
				
				Страна=Макет.Область(Строка,Колонка).Текст;
				
				// Если не перекресток, то пишется одной строкой. Для перекрестка блок. Возможно заполнение нескольких строк.
				Если НЕ (Докобъект.контрагент.родитель.код = "SSR-4117") Тогда
					//
					////--------------------------------------------------------------------------------
					//Элемент=ДокументДом.СоздатьЭлемент("CountryOfOriginCode");
					//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
					//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Страна));                      
					//ТекУзел4.ДобавитьДочерний(ТекстДом);
					//
					Элемент=ДокументДом.СоздатьЭлемент("TaxRate");
					ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
					//Катаев+ 21/08/14 Ставку НДМ берем тоже из документа
					//текстДом=ДокументДом.СоздатьТекстовыйУзел("18.00");                      
					Если ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
						НДС_Текст = "10.00";
					ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
						НДС_Текст = "18.00";
					ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
						НДС_Текст = "20.00";
						//Валетов +	20,01,2026 ПУСТАЯ ЗАДАЧА  Добавить везде Ставку НДС 22
					ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС22 Тогда
						НДС_Текст = "22.00";
						//Валетов -
					ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
						НДС_Текст = "0.00";
					Иначе
						НДС_Текст = "Без НДС";
					КонецЕсли;
					текстДом=ДокументДом.СоздатьТекстовыйУзел(НДС_Текст);
					ТекУзел4.ДобавитьДочерний(ТекстДом);
					
					
					////----------------------------------------------------------			
					//Элемент=ДокументДом.СоздатьЭлемент("TaxName");
					//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
					//текстДом=ДокументДом.СоздатьТекстовыйУзел("процент");                      
					//ТекУзел4.ДобавитьДочерний(ТекстДом);
					//
					
					//----------------------------------------------------------			
					Элемент=ДокументДом.СоздатьЭлемент("TaxAmount"); //Сумма НДС
					ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
					Цена= ЗаменитьТочку(ТекСтрока.НДС,2);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
					ТекУзел4.ДобавитьДочерний(ТекстДом);
					
					
					//----------------------------------------------------------			
					Элемент=ДокументДом.СоздатьЭлемент("NetAmount"); //Сумма без НДС
					ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
					Цена= ЗаменитьТочку(ТекСтрока.Сумма,2);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
					ТекУзел4.ДобавитьДочерний(ТекстДом);
					
					//----------------------------------------------------------			
					Элемент=ДокументДом.СоздатьЭлемент("GrossAmount"); //Сумма без НДС
					ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
					Цена= ЗаменитьТочку(ТекСтрока.Всего,2);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
					ТекУзел4.ДобавитьДочерний(ТекстДом);
					
					//----------------------------------------------------------
					//ГТД
					//
					////----------------------------------------------------------
					//Элемент=ДокументДом.СоздатьЭлемент("CustomsDeclarationNumber");
					//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
					//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(НомерГТД));                      
					//ТекУзел4.ДобавитьДочерний(ТекстДом);
				иначе
					// для  X5
					
					////--------------------------------------------------------------------------------
					//Элемент=ДокументДом.СоздатьЭлемент("CountryOfOriginCode");
					//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
					//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Страна));                      
					//ТекУзел4.ДобавитьДочерний(ТекстДом);
					//
					Элемент=ДокументДом.СоздатьЭлемент("TaxRate");
					ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
					//Катаев+ 21/08/14 Ставку НДМ берем тоже из документа
					//текстДом=ДокументДом.СоздатьТекстовыйУзел("18.00");                      
					Если ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
						НДС_Текст = "10.00";
					ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
						НДС_Текст = "18.00";
					ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
						НДС_Текст = "20.00";
						//Валетов +	20,01,2026 ПУСТАЯ ЗАДАЧА  Добавить везде Ставку НДС 22
					ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС22 Тогда
						НДС_Текст = "22.00";
						//Валетов -
					ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
						НДС_Текст = "0.00";
					Иначе
						НДС_Текст = "Без НДС";
					КонецЕсли;
					текстДом=ДокументДом.СоздатьТекстовыйУзел(НДС_Текст);
					ТекУзел4.ДобавитьДочерний(ТекстДом);
					
					//
					////----------------------------------------------------------			
					//Элемент=ДокументДом.СоздатьЭлемент("TaxName");
					//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
					//текстДом=ДокументДом.СоздатьТекстовыйУзел("процент");                      
					//ТекУзел4.ДобавитьДочерний(ТекстДом);
					//
					
					//----------------------------------------------------------			
					Элемент=ДокументДом.СоздатьЭлемент("TaxAmount"); //Сумма НДС
					ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
					Цена= ЗаменитьТочку(ТекСтрока.НДС,2);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
					ТекУзел4.ДобавитьДочерний(ТекстДом);
					
					
					//----------------------------------------------------------			
					Элемент=ДокументДом.СоздатьЭлемент("NetAmount"); //Сумма без НДС
					ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
					Цена= ЗаменитьТочку(ТекСтрока.Сумма,2);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
					ТекУзел4.ДобавитьДочерний(ТекстДом);
					
					//----------------------------------------------------------			
					Элемент=ДокументДом.СоздатьЭлемент("GrossAmount"); //Сумма без НДС
					ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
					Цена= ЗаменитьТочку(ТекСтрока.Всего,2);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
					ТекУзел4.ДобавитьДочерний(ТекстДом);
					
					//----------------------------------------------------------
					//ГТД
					
					
					
					//
					////----------------------------------------------
					//Элемент=ДокументДом.СоздатьЭлемент("Line-Declaration");
					//ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
					//
					//
					//Элемент=ДокументДом.СоздатьЭлемент("Declaration");
					//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
					////текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(рр));                 
					////ТекУзел4.ДобавитьДочерний(ТекстДом);
					////					
					////----------------------------------------------------------
					//Элемент=ДокументДом.СоздатьЭлемент("CustomsDeclarationNumber");
					//ТекУзел5=ТекУзел4.ДобавитьДочерний(Элемент);
					//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(НомерГТД));                      
					//ТекУзел5.ДобавитьДочерний(ТекстДом);
					
					
				КонецЕсли;	
				
				
			КонецЕсли; 
			
			
		КонецЕсли;
		
		РР=РР+1;
		
	КонецЦикла;
	//****************************************************************************************************************************************************
	//  подвал документа
	//****************************************************************************************************************************************************
	
	Если Ошибка = 0 Тогда
		
		//Катаев+ 30/10/14 Для 7 континента не выводить
		Если ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-1973") Тогда
			КорневойЭлемент=ДокументДом.ЭлементДокумента;
			//-------- Order-Header ------------------------------------------
			ЭлементДом=ДокументДом.СоздатьЭлемент("Invoice-Summary");
			ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
			
			//  ??????
			//Катаев+ 08/12/14 для Перекрестка вывод другого элемнета в подвале
			//Если ДокОбъект.Контрагент.Родитель = Справочники.Контрагенты.НайтиПоКоду("SSR-4117") Тогда
			рр = рр-1;
			Элемент2=ДокументДом.СоздатьЭлемент("TotalLines");
			ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(рр));
			ТекУзел2.ДобавитьДочерний(ТекстДом);
			//Иначе
			//----------------------------------------------------------------
			
			
			
			//Элемент2=ДокументДом.СоздатьЭлемент("TotalLines");
			//ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
			//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(рр));
			//ТекУзел2.ДобавитьДочерний(ТекстДом);
			//
			Элемент2=ДокументДом.СоздатьЭлемент("TotalNetAmount");
			ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
			ОбщаяСумма=ЗаменитьТочку(ОбщаяСумма,2);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ОбщаяСумма));
			ТекУзел2.ДобавитьДочерний(ТекстДом);
			
			//Элемент2=ДокументДом.СоздатьЭлемент("TotalTaxableBasis");
			//ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
			//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ОбщаяСумма));
			//ТекУзел2.ДобавитьДочерний(ТекстДом);
			
			Элемент2=ДокументДом.СоздатьЭлемент("TotalTaxAmount");
			ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
			ОбщаяНДС=ЗаменитьТочку(ОбщаяНДС,2);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ОбщаяНДС));
			ТекУзел2.ДобавитьДочерний(ТекстДом);
			
			
			Элемент2=ДокументДом.СоздатьЭлемент("TotalGrossAmount");
			ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
			ОбщаяСуммаСНДС=ЗаменитьТочку(ОбщаяСуммаСНДС,2);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ОбщаяСуммаСНдс));
			ТекУзел2.ДобавитьДочерний(ТекстДом);
			
			
			//----------------------------------------------------------------------------------------
			//----------------------------------------------------------------------------------------
			//----------------------------------------------------------------------------------------
			
			Элемент2=ДокументДом.СоздатьЭлемент("Tax-Summary");
			ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
			
			
			ТЗТовары = ДокОбъект.Товары.Выгрузить();
			ТЗТовары.Свернуть("СтавкаНДС","Сумма,НДС,Всего");
			
			Для каждого СтрокаНДС из ТЗТовары Цикл
				
				
				Элемент3=ДокументДом.СоздатьЭлемент("Tax-Summary-Line");
				ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
				
				//
				//<TaxRate>18.00</TaxRate>
				//<TaxName>процент</TaxName>
				//<TaxAmount>7769.07</TaxAmount>
				//<TaxableBasis>43161.50</TaxableBasis>
				//<TaxableAmount>43161.50</TaxableAmount>
				//<GrossAmount>50930.57</GrossAmount>
				//
				
				//-----------------------------------------------------------
				Элемент=ДокументДом.СоздатьЭлемент("TaxRate");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				//Катаев+ 21/08/14 Ставку НДМ берем тоже из документа
				//текстДом=ДокументДом.СоздатьТекстовыйУзел("18.00");                      
				Если ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
					НДС_Текст = "10.00";
				ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
					НДС_Текст = "18.00";
				ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
					НДС_Текст = "20.00"; 
					//Валетов +	20,01,2026 ПУСТАЯ ЗАДАЧА  Добавить везде Ставку НДС 22
				ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС22 Тогда
					НДС_Текст = "22.00";
					//Валетов -
				ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
					НДС_Текст = "0.00";
				Иначе
					НДС_Текст = "Без НДС";
				КонецЕсли;
				текстДом=ДокументДом.СоздатьТекстовыйУзел(НДС_Текст);
				ТекУзел4.ДобавитьДочерний(ТекстДом);
				
				////----------------------------------------------------------			
				//Элемент=ДокументДом.СоздатьЭлемент("TaxName");
				//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				//текстДом=ДокументДом.СоздатьТекстовыйУзел("процент");                      
				//ТекУзел4.ДобавитьДочерний(ТекстДом);
				////-----------------------------------------------------------
				Элемент4=ДокументДом.СоздатьЭлемент("TaxAmount");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
				СуммаНДС=ЗаменитьТочку(СтрокаНДС.НДС,2);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(СуммаНдс));
				ТекУзел4.ДобавитьДочерний(ТекстДом);
				////-----------------------------------------------------------
				//Элемент4=ДокументДом.СоздатьЭлемент("TaxableBasis");
				//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
				//Сумма=ЗаменитьТочку(СтрокаНДС.Сумма,2);
				//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Сумма));
				//ТекУзел4.ДобавитьДочерний(ТекстДом);
				////-----------------------------------------------------------
				Элемент4=ДокументДом.СоздатьЭлемент("TaxableAmount");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
				Сумма=ЗаменитьТочку(СтрокаНДС.Сумма,2);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Сумма));
				ТекУзел4.ДобавитьДочерний(ТекстДом);
				//
				////-----------------------------------------------------------
				//Элемент4=ДокументДом.СоздатьЭлемент("GrossAmount");
				//ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент4);
				//СуммаНДС=ЗаменитьТочку(СтрокаНДС.Всего,2);
				//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(СуммаНдс));
				//ТекУзел4.ДобавитьДочерний(ТекстДом);
				//
				//
				
			КонецЦикла;
			
			
		КонецЕсли;
		
		//		Сообщить("Сформирован файл: "+ИмяФайлаОбмена);
		
		
		//---------------------------------------------------------------
		ЗаписьДом=Новый ЗаписьDom;
		ЗаписьДом.Записать(ДокументДом,ЗаписьХМЛ);
		ЗаписьХМЛ.Закрыть();
		ф1 = новый ЧтениеТекста(ВремФайл);
		ф2 = Новый ЗаписьТекста(ИмяФайлаОбмена);
		стр = ф1.ПрочитатьСтроку();
		Пока стр <> Неопределено Цикл
			Если стр <> "<?xml version=""1.0"" encoding=""UTF-8""?>" Тогда
				ф2.ЗаписатьСтроку(стр);
			КонецЕсли;
			стр = ф1.ПрочитатьСтроку();
		КонецЦикла;
		ф2.Закрыть();
		ф1.Закрыть();
		//
		
		УдалитьФайлы(КаталогВременныхФайлов(),ДокОбъект.Номер+".xml");
		//	Сообщить("Сформирован файл: "+ИмяФайлаОбмена);
		
		ПереданПокупателюВЭлВиде = Истина; 
		
		ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - Уинвойс накладная было успешно создано","Информация");
		
		Если Провайдер = 0 Тогда
			Если ПланыОбмена.Основной.ЭтотУзел() <> ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
				Соединение.Записать(ИмяФайлаОбмена, ИмяФайлаОбменаФТП); //склад или филиал?
				УдалитьФайлы(КаталогВременныхФайлов(),ДокОбъект.Номер+"_.xml");
				//	Сообщить("Сформирован файл на ftp: ");
				ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - ИнвойсНакладная была успешно создано","Информация");
			Иначе	
				//	Сообщить("Сформирован файл: "+ИмяФайлаОбмена);
				ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - ИнвойсНакладная была успешно создано","Информация");
			КонецЕсли;
		Иначе
			Соединение.Записать(ИмяФайлаОбмена, ИмяФайлаОбменаФТП);
			УдалитьФайлы(КаталогВременныхФайлов(),ДокОбъект.Номер+"_.xml");
			ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - Инвойс накладная было успешно создано на ftp СКБ-Контур","Информация");
		КонецЕсли;
		
		//	нечаева 30,01,15 ++++	 запишем данные в регистр сведений, чтобы не отправлять второй раз
		ЗаписатьДанныеВРегистрОтправкаЭлектронныхДокументов(Докобъект.ссылка,,Перечисления.ДокументЕКОД.УведомлениеОбОтгрузке);
		//	нечаева 30,01,15 ---
		
		
	Иначе
		
		ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - обнаружены ошибки, файл уведомления не создан!","Важное");
		//Сообщить("Обнаружены ошибки, файл не записан!");
		
	КонецЕсли;
	
КонецПроцедуры
//нечаева 21,04,17---

//нечаева 08,10,20+++
Процедура СформироватьУведомлениеДЖИЭс(ДокОбъект, Ошибка, Провайдер,ТипДокумента = "Order") Экспорт
	
	//нечаева 18,05,21+++
	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Кухарь А.Ю. 31.03.2026 начало
	// Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом  тогда
	Если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() тогда
		//Кухарь А.Ю. 31.03.2026 конец      
		ЗаписатьВЛог("ОшибкиЕкод","Отмена выполнения. подтверждение не создано "+ДокОбъект+" база "+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
		
		ошибка=1;
		
		Возврат ;
	КонецЕсли;
	// нечаева 18,05,21----
	
	
	//Нечаева 20,03,17+++
	НомЗ = СокрЛП(СтрЗаменить(ДокОбъект.НомерЗаказа, "/", "_"));		
	НомЗ = СтрЗаменить(НомЗ, "\", "_");		
	//Нечаева 20,03,17---
	
	
	
	//	 ftp://212.109.217.226
	//Логин: *%*%*%
	//Пароль: *$*$*$
	
	
	
	КаталогFTP="EE/new";
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//ПользовательFTP="*%*%*%";
	//ПарольFTP="*$*$*$";
	ПользовательFTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
	Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКFTPCollant).Логин;
	ПарольFTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
	Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКFTPCollant).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	АдресFTP = "212.109.217.226";
	Соединение=УстановитьFTPСоединение(АдресFTP,ПользовательFTP,ПарольFTP,,Истина);
	Если Соединение=Неопределено Тогда
		Сообщить("Невозможно установить соединение с ftp");
		Ошибка = 1;
		Возврат;
	КонецЕсли;
	Соединение.УстановитьТекущийКаталог(КаталогFTP);
	
	ИмяФайлаОбменаФТП = "Пз_"+НомЗ+".xml";
	ИмяФайлаОбмена = КаталогВременныхФайлов()+"Пз_"+НомЗ+"_.xml";
	
	
	
	ВремФайл = КаталогВременныхФайлов()+ДокОбъект.Номер+".xml";
	
	Ошибка=0;
	
	
	ЗаписьXML = Новый ЗаписьXML;
	
	ЗаписьXML.ОткрытьФайл(ВремФайл);
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();    
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Data");
	ЗаписьXML.ЗаписатьАтрибут("Date", Строка(формат(ТекущаяДата(),"ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс""")));
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Doc");
	ЗаписьXML.ЗаписатьАтрибут("UIDDoc", Строка(ЭтотОбъект.ссылка.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьАтрибут("TypeDoc", ТипДокумента);  // invoise  - после РГ, автоматом
	ЗаписьXML.ЗаписатьАтрибут("Number", Строка(ЭтотОбъект.ссылка.Номерзаказа));
	ЗаписьXML.ЗаписатьАтрибут("Date", Строка(Формат(ЭтотОбъект.ссылка.Датазаказа,"ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс""")));
	ЗаписьXML.ЗаписатьАтрибут("SupplierINN", Строка(ЭтотОбъект.ссылка.контрагент.инн));
	ЗаписьXML.ЗаписатьАтрибут("SupplierKpp", Строка(ЭтотОбъект.ссылка.контрагент.кпп));   // пункт доставки кпп, если есть
	ЗаписьXML.ЗаписатьАтрибут("SupplierName", Строка(ЭтотОбъект.ссылка.контрагент.Наименование)); // это от пункта доставки?
	
	//   BuyerINN="7717115270" BuyerKPP="771701001" BuyerName="ООО &quot;Единая Европа - Элит&quot;" 
	
	ЗаписьXML.ЗаписатьАтрибут("BuyerInn", Строка("7717115270"));
	ЗаписьXML.ЗаписатьАтрибут("BuerKpp", Строка("771701001"));
	ЗаписьXML.ЗаписатьАтрибут("BuyerName", Строка("ООО Единая Европа - Элит"));
	
	ЗаписьXML.ЗаписатьАтрибут("WarehouseCode", Строка(ЭтотОбъект.ссылка.пунктдоставки.НомерМагазина));
	ЗаписьXML.ЗаписатьАтрибут("Warehouse", Строка(ЭтотОбъект.ссылка.пунктдоставки.Наименование));
	ЗаписьXML.ЗаписатьАтрибут("IncommingNumber", Строка(ЭтотОбъект.ссылка.номер));
	ЗаписьXML.ЗаписатьАтрибут("IncommingDate", Строка(Формат(ЭтотОбъект.ссылка.дата,"ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс""")));
	
	Для каждого Текстрока из товары цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Goods");
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	ШтрихКоды.Ссылка КАК Ссылка,
		|	ШтрихКоды.Владелец КАК Номенклатура,
		|	ШтрихКоды.ТипШК КАК ТипШК,
		|	ШтрихКоды.ВидШК КАК ВидШК,
		|	ШтрихКоды.Наименование КАК ШК
		|ИЗ
		|	Справочник.ШтрихКоды КАК ШтрихКоды
		|ГДЕ
		|	ШтрихКоды.Владелец В(&СписокНоменклатуры)
		|	И ШтрихКоды.Наименование <> ""9999999999999""
		|	И НЕ ШтрихКоды.ПометкаУдаления
		|	И ШтрихКоды.ВидШК = &ВидШК
		|	И ШтрихКоды.ТипШК = &ТипШк";	
		
		
		Запрос.УстановитьПараметр("СписокНоменклатуры",текстрока.Номенклатура);
		Запрос.УстановитьПараметр("ВидШК",Перечисления.ВидыШК.Основной);
		Запрос.УстановитьПараметр("ТипШК",Перечисления.ТипыШтрихКодов.Штука);
		Рез= запрос.Выполнить().Выбрать();
		если рез.Следующий() тогда
			шк = рез.шк;
		иначе
			шк = 0;
		конецесли;
		
		
		НДС1 = строка(текстрока.СтавкаНДС);
		НДС1 = СтрЗаменить(НДС1,"%","");
		
		ЗаписьXML.ЗаписатьАтрибут("UIDGoods", Строка(Текстрока.Номенклатура.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьАтрибут("SupplierCode", "");
		ЗаписьXML.ЗаписатьАтрибут("BuyerCode", Строка(""));
		ЗаписьXML.ЗаписатьАтрибут("GoodsName", Строка(ТекСтрока.Номенклатура.Наименование));
		ЗаписьXML.ЗаписатьАтрибут("Barcode", Строка(Шк));
		ЗаписьXML.ЗаписатьАтрибут("TM", Строка(ТекСтрока.Номенклатура.Брэнд));   // пункт доставки кпп, если есть
		ЗаписьXML.ЗаписатьАтрибут("Color", Строка(ТекСтрока.Номенклатура.Цвет.Наименование)); // это от пункта доставки?
		
		ЗаписьXML.ЗаписатьАтрибут("Size", Строка(ТекСтрока.Номенклатура.Размер.Наименование));
		ЗаписьXML.ЗаписатьАтрибут("ItemType", Строка(текстрока.Номенклатура.ТипТовара));
		ЗаписьXML.ЗаписатьАтрибут("Quantity", Строка(ТекСтрока.Количество));
		
		ЗаписьXML.ЗаписатьАтрибут("Price", Строка(ТекСтрока.Цена));
		ЗаписьXML.ЗаписатьАтрибут("Vatrate", Строка(НДС1));
		ЗаписьXML.ЗаписатьАтрибут("Sum", Строка(текстрока.Всего));
		ЗаписьXML.ЗаписатьАтрибут("Vatamount", Строка(ТекСтрока.НДС));
		
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // товары "Goods"
		
	КонецЦикла; 
	
	
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // док 
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // дата
	
	ЗаписьXML.Закрыть();
	
	
	# если клиент тогда
		Сообщить(""+ВремФайл );
	# конецесли
	
	
	//ЗаписьДом=Новый ЗаписьDom;
	//	ЗаписьДом.Записать(ДокументДом,ЗаписьXML);
	//	ЗаписьXML.Закрыть();
	//	ф1 = новый ЧтениеТекста(ВремФайл);
	//	ф2 = Новый ЗаписьТекста(ИмяФайлаОбмена);
	//	стр = ф1.ПрочитатьСтроку();
	//	Пока стр <> Неопределено Цикл
	//		Если стр <> "<?xml version=""1.0"" encoding=""UTF-8""?>" Тогда
	//			ф2.ЗаписатьСтроку(стр);
	//		КонецЕсли;
	//		стр = ф1.ПрочитатьСтроку();
	//	КонецЦикла;
	//	ф2.Закрыть();
	//	ф1.Закрыть();
	
	
	// КопироватьФайл(ВремФайл,ИмяФайлаОбменаФТП);
	
	//записать на фтп все
	
	Соединение.Записать(ВремФайл, ИмяФайлаОбменаФТП);
	
	//Если ошибка то проверить имя файла.
	// УдалитьФайлы(КаталогВременныхФайлов(),ДокОбъект.Номер+"_.xml");
	// ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - подтверждение было успешно создано на ftp джи эс","Информация");
	
	
	// запишем данные в регистр сведений, чтобы не отправлять второй раз
	ЗаписатьДанныеВРегистрОтправкаЭлектронныхДокументов(ссылка,,Перечисления.ДокументЕКОД.ПодтверждениеЗаказа);
	
	// ПереданПокупателюВЭлВиде = Истина;
	
	
	
	
	возврат;
	
	
КонецПроцедуры
// нечаева 08,10,20---



//нечаева 05,04,18+++
Функция ПолучитьТаблицуНакладнойТандерЭкспозиторы(Режим="Накладная",СФ=Неопределено,Экспозитор)
	
	ТН=Новый ТаблицаЗначений;
	
	ТН.Колонки.Добавить("Номенклатура");	
	ТН.Колонки.Добавить("Количество");
	ТН.Колонки.Добавить("НДС");
	ТН.Колонки.Добавить("Сумма");
	ТН.Колонки.Добавить("СтавкаНДС");
	ТН.Колонки.Добавить("Всего");
	ТН.Колонки.Добавить("Цена");
	
	ИсходнаяТЧ=Товары.Выгрузить();
	ИсходнаяТЧ = Новый ТаблицаЗначений;
	ИсходнаяТЧ.Колонки.Добавить("Номенклатура");	
	ИсходнаяТЧ.Колонки.Добавить("Количество");
	ИсходнаяТЧ.Колонки.Добавить("НДС");
	ИсходнаяТЧ.Колонки.Добавить("Сумма");
	ИсходнаяТЧ.Колонки.Добавить("Всего");
	ИсходнаяТЧ.Колонки.Добавить("Цена");
	
	
	// заменияем на колво экспозиторов. Цену берем из матрицы.
	
	ОбщКолво = товары.Итог("Количество");
	КолвВ1Эксп = Экспозитор.Коплектующие.Итог("Количество");
	Если КолвВ1Эксп = 0 Тогда
		ВсегоЭксп  = Окр(ОбщКолво);
	Иначе
		ВсегоЭксп  = Окр(ОбщКолво/КолвВ1Эксп);
	КонецЕсли;
	
	
	//------------------------------------------------------------------------
	//------------------------------------------------------------------------
	НовСтр = ТН.Добавить();
	НовСТр.Номенклатура = Экспозитор;
	НовСТр.Количество = ВсегоЭксп;
	//ЗаполнитьЦенуНоменклатурыТабЧастиПоМатрице(НовСТр, ДокОбъект) ;
	//ПриИзмененииНоменклатурыТабЧасти(НовСтр, ТекОб);
	
	
	
	//получим цену номенклатуры
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	МатрицаТовары.Номенклатура,
	|	МатрицаТовары.Цена,
	|	МатрицаПунктыДоставки.Ссылка
	|ИЗ
	|	Документ.Матрица.Товары КАК МатрицаТовары
	|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
	|ГДЕ
	|	МатрицаТовары.Ссылка.Дата <= &Дата1
	|	И МатрицаТовары.Ссылка.Проведен
	|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
	|	И МатрицаТовары.Ссылка.Договор = &Договор
	|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
	//	|	И МатрицаТовары.Ссылка.Акция = ИСТИНА
	|	И МатрицаТовары.Номенклатура = &ТекНом
	//	|	И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункДоставки
	|	УПОРЯДОЧИТЬ ПО
	|	МатрицаТовары.Ссылка.Дата УБЫВ
	|АВТОУПОРЯДОЧИВАНИЕ";
	//нечаева 18,07,17---
	Запрос.УстановитьПараметр("ТекНом",Экспозитор);			   
	Запрос.УстановитьПараметр("Дата2",НачалоДня(дата));
	Запрос.УстановитьПараметр("Дата1",КонецДня(дата));
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("Договор",Договор);
	
	Запрос.УстановитьПараметр("ТекПункДоставки",пунктДоставки);
	// цена по акции
	ТЗ1 = Запрос.Выполнить().Выгрузить();
	Если ТЗ1.Количество()>0 Тогда
		Цена = ТЗ1[0].Цена;
	Иначе	
		Цена = 0;
	КонецЕсли;	
	//------------------------------------------------------------------------------------------
	
	
	
	НовСтр.Цена = Цена;
	
	
	//Цена = ПолучитьЦенуНоменклатурыТабЧастиПоМатрице(НовСТр, ДокОбъект);
	//РассчитатьСуммуТабЧасти(НовСтр, ТекОб);
	
	НовСТр.Сумма 	= НовСТр.Цена * НовСТр.Количество;
	НовСТр.СтавкаНДС=ПолучитьСтавкуНДС(Экспозитор);
	СтавкаНДС=ПроцентНДСпоСтавке(НовСтр.СтавкаНДС);
	НовСтр.НДС	= НовСтр.Сумма*СтавкаНДС/(1+СтавкаНДС);			
	НовСтр.Всего	= НовСтр.Сумма;
	НовСтр.Сумма  = НовСтр.Всего - НовСтр.НДС;
	//------------------------------------------------------------------------
	//------------------------------------------------------------------------
	
	//нечаева 24,07,18++
	Если контрагент.НДС_Сверху Тогда
		
		НовСТр.СтавкаНДС=ПолучитьСтавкуНДС(Экспозитор);
		ЦенаБезНДС = Окр(НовСтр.Цена/(1+СтавкаНДС),2);	
		
		НовСТр.Сумма 	= ЦенаБезНДС * НовСТр.Количество;
		
		НовСтр.НДС	= Окр(НовСтр.Сумма*СтавкаНДС,2);			
		НовСтр.Всего	= НовСтр.Сумма+НовСтр.НДС;
		
		//----------------------------------------------
		
	КонецЕсли;
	//нечаева 24,07,18++---
	
	
	ТН.Колонки.Добавить("ШтрихКод");
	//ТН.Колонки.Добавить("Цена");
	//ТН.Колонки.Добавить("СтавкаНДС");
	ТН.Колонки.Добавить("НоменклатураПредставление");
	ТН.Колонки.Добавить("Единица");	
	ТН.Колонки.Добавить("ОКЕИ");	
	ТН.Колонки.Добавить("Страна");
	ТН.Колонки.Добавить("СтранаКод");
	ТН.Колонки.Добавить("НомерГТД");
	ТН.Колонки.Добавить("КодКонтрагента");
	ТН.Колонки.Добавить("КоличествоКоробок");
	ТН.Колонки.Добавить("ШтукВКоробке");
	
	ТН.Колонки.Добавить("ШКТовара");
	
	
	Для Каждого СтрокаТН Из ТН Цикл
		Номенклатура=СтрокаТН.Номенклатура;
		Модель		=СтрокаТН.Номенклатура.Родитель;
		
		//СтрокаТН.Цена		=?(СтрокаТН.Количество=0,0,СтрокаТН.Сумма/СтрокаТН.Количество);
		СтрокаТН.Цена		=?(СтрокаТН.Количество=0,0,СтрокаТН.Всего/СтрокаТН.Количество);
		Если СтрокаТН.Сумма=0 Тогда
			СтрокаТН.СтавкаНДС=100*ПроцентНДСпоСтавке(ПолучитьРеквизитРодителя(СтрокаТН.Номенклатура,"СтавкаНДС"));
		Иначе			
			СтрокаТН.СтавкаНДС	=Окр(100*(СтрокаТН.НДС/СтрокаТН.Сумма),0,1);
		КонецЕсли;			
		
		СтрокаТН.Единица	="шт.";			
		СтрокаТН.ОКЕИ		="796";
		
		
		//Кухарь 28.11.16 начало
		//крохин начало 16.12.2016
		//пока отменяем
		ГТД=ПолучитьГрупповойПериодическийРеквизит(Модель,"НомерГТД",Дата);					
		Страна	="Россия";
		НомерГТД="--------";
		//крохин начало 23.01.2012
		//новая форма
		СтранаКод = "643";
		//крохин конец 23.01.2012
		
		Если ГТД<>Неопределено И Врег(""+ГТД.СтранаПроисхождения)<>"РОССИЯ" И НЕ ПустаяСтрока(""+ГТД.СтранаПроисхождения) Тогда
			Страна		=""+ГТД.СтранаПроисхождения;
			НомерГТД	=СокрЛП(""+ГТД.Наименование);
			СтранаКод = ГТД.СтранаПроисхождения.Код;
		КонецЕсли;
		
		Если Страна<>"Россия" И СтрДлина(НомерГТД)<25 Тогда			
			Если СтрДлина(НомерГТД)<23 Тогда
				Сообщить("Кривой ГТД !!! Товар: """+СтрокаТН.Номенклатура+""", ГТД: """+НомерГТД+""" !");		
			Иначе
				Сообщить("Отсутствует 4-ый сегмент ГТД !!! Товар: """+СтрокаТН.Номенклатура+""", ГТД: """+НомерГТД+""" !");
				
				НомерГТД=НомерГТД+"/3";
			КонецЕсли; 					
		КонецЕсли;
		Если Страна="Россия" Тогда
			Страна	="--------";
		КонецЕсли;
		СтрокаТН.Страна		= Страна;
		СтрокаТН.НомерГТД	= НомерГТД;
		СтрокаТН.СтранаКод = СтранаКод;
		
		
		//Лобан 120314 +++
		//Печать наименование номенклатуры для контрагента из матрицы
		//СтрокаТН.НоменклатураПредставление=СокрЛП(Модель.ТипТовара)+" "+СокрЛП(Модель.Родитель.Брэнд)+" "+СокрЛП(Модель.КодПроизводителя)+" "+Номенклатура.Наименование;
		Запрос = Новый запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура,
		|	МатрицаТовары.НаименованиеКонтрагента КАК НаименованиеКонтрагента
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	МатрицаТовары.Ссылка.Проведен
		|	И МатрицаТовары.Ссылка.Дата <= &Дата
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент";
		
		//нечаева 18,07,17+++
		Попытка
			Если ПостояннаяАкция Тогда
				Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
				//крохин начало 28.07.2017
				//постоянные акции только под галку
			Иначе
				Запрос.Текст = Запрос.Текст +" И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция";
				//крохин конец 28.07.2017
			КонецЕсли;
		Исключение
			
		КонецПопытки;
		//нечаева 18,07,17---
		
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("Дата",Дата);
		ТЗ = Запрос.Выполнить().Выгрузить();	
		Отбор = Новый Структура();
		Отбор.Вставить("Номенклатура",СтрокаТН.номенклатура.Ссылка);
		НайденныеСтроки = ТЗ.НайтиСтроки(Отбор);
		для Каждого Строчка из НайденныеСтроки Цикл 
			НаименованиеКонтрагента = Строчка.НаименованиеКонтрагента;
		КонецЦикла;
		если Не ПустаяСтрока(НаименованиеКонтрагента) тогда
			СтрокаТН.НоменклатураПредставление = НаименованиеКонтрагента 
		иначе		
			СтрокаТН.НоменклатураПредставление=СокрЛП(Модель.ТипТовара)+" "+СокрЛП(Модель.Родитель.Брэнд)+" "+СокрЛП(Модель.КодПроизводителя)+" "+Номенклатура.Наименование;		
		КонецЕсли;	
		//Лобан 120314 ---
		
		
		//Лобан +++ 260713
		//Новая форма е5
		СтрокаТН.ШКТовара=ПолучитьШтрихКодТовара(СтрокаТН.Номенклатура);
		//Лобан --- 260713
		
		//СтрокаТН.ШтрихКод=ПолучитьАртикулКонтрагентаПоМатрице(СтрокаТН.Номенклатура);				
		
		
	КонецЦикла; 
	
	
	////крохин начало 05.09.2012
	////новый реквизит
	//Если УпорядочитьНоменклатуру Тогда
	//	ТН.Сортировать("Номенклатура");	
	//КонецЕсли;		
	////крохин конец 05.09.2012
	
	Возврат ТН;
КонецФункции // ПолучитьТаблицуНакладной()
//нечаева 05,04,18---


//нечаева 29,01,19+++
Функция ПолучитьПричинуНедопоставки(Ном)
	
	ЗапросСостоянияДокументов = Новый запрос;
	ЗапросСостоянияДокументов.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	РеквизитыТЧ_Товары_РНКПНКПРМ.Документ,
	|	РеквизитыТЧ_Товары_РНКПНКПРМ.Номенклатура,
	|	РеквизитыТЧ_Товары_РНКПНКПРМ.ИмяРеквизита,
	|	РеквизитыТЧ_Товары_РНКПНКПРМ.ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыТЧ_Товары_РНКПНКПРМ КАК РеквизитыТЧ_Товары_РНКПНКПРМ
	|ГДЕ
	|	РеквизитыТЧ_Товары_РНКПНКПРМ.Документ = &текдок
	|	И РеквизитыТЧ_Товары_РНКПНКПРМ.Номенклатура = &текном
	|	И РеквизитыТЧ_Товары_РНКПНКПРМ.ИмяРеквизита = &реквизит";
	ЗапросСостоянияДокументов.УстановитьПараметр("ТекДок",ссылка);
	ЗапросСостоянияДокументов.УстановитьПараметр("ТекНом",ном);
	ЗапросСостоянияДокументов.УстановитьПараметр("Реквизит","ПричинаНедопоставки");
	
	// Кухарь А.Ю. 30.03.2021 начало
	// дубль
	//Выборка = ЗапросСостоянияДокументов.Выполнить().Выбрать(); 
	// Кухарь А.Ю. 30.03.2021 конец
	
	
	ТЗ = ЗапросСостоянияДокументов.Выполнить().Выгрузить();
	Если ТЗ.Количество() = 0 Тогда
		Возврат "";
	Иначе
		Возврат ТЗ[0].ЗначениеРеквизита;
	КонецЕсли;	
	
	
КонецФункции
//нечаева 29,01,19---


// нечаева 28,01,15  переделала на регистр с галки в документе, данные о том, что отправлен документ.
//Катаев+ 28/10/14 Для формирования пакета EDI-документов (докумнетов может быть несоклько и с учетом того что обмен с несколькими провайдерами


Процедура СформироватьДляЕДО(ДокОбъект, Ошибка) Экспорт
	
	//нечаева 18,05,21+++
	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Кухарь А.Ю. 31.03.2026 начало
	// Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом тогда
	Если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() тогда
		//Кухарь А.Ю. 31.03.2026 конец
       
		ЗаписатьВЛог("ОшибкиЕкод","Отмена выполнения. подтверждение не создано "+ДокОбъект+" база "+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
		
		ошибка=1;
		
		Возврат ;
	КонецЕсли;
	// нечаева 18,05,21----
	
	
	Если ПустаяСтрока(ДокОбъект.НомерЗаказа) Тогда
		Ошибка = 1;
		#Если Клиент Тогда
			Сообщить(Строка(ДокОбъект)+" - не заполнен номер заказа. Уведомление об отгрузке не создано");
		#Иначе
			ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - не заполнен номер заказа. Уведомление об отгрузке не создано","Важное");
		#КонецЕсли
		Возврат;
	КонецЕсли;
	
	//Нечаева 07,04,15+++
	Если СтрДлина(ПунктДоставки.КодИЛН) = 0  Тогда
		Ошибка = 1;
		#Если Клиент Тогда
			Сообщить(Строка(ДокОбъект)+" - не заполнен номер GLN у пункта доставки. Уведомление об отгрузке не создано");
		#Иначе
			ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - не заполнен  GLN у пункта доставки. Уведомление об отгрузке не создано","Важное");
		#КонецЕсли
		Возврат;
	КонецЕсли;
	//Нечаева 07,04,15---
	
	
	Если ПустаяСтрока(ДокОбъект.Контрагент.Родитель.КодИЛН) Тогда
		ИЛНПок =  ДокОбъект.Контрагент.КодИЛН;
	Иначе
		ИЛНПок =  ДокОбъект.Контрагент.Родитель.КодИЛН;
	КонецЕсли;
	//Определяем какие EDI-документы надо формировать
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыгружаемыеДокументыЕКОД.Провайдер
	|ИЗ
	|	Справочник.ВыгружаемыеДокументыЕКОД КАК ВыгружаемыеДокументыЕКОД
	|ГДЕ
	|	ВыгружаемыеДокументыЕКОД.Владелец = &Контрагент
	|	И ВыгружаемыеДокументыЕКОД.ВидДокумента = &ВидДокумента
	|	И ВыгружаемыеДокументыЕКОД.ПометкаУдаления = ЛОЖЬ";
	
	
	// проверим не отправлено ли еще подтврждение заказа 
	Запрос2 = Новый Запрос;
	Запрос2.Текст= "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтправкаЭлектронныхДокументов.ВидДокумента,
	|	ОтправкаЭлектронныхДокументов.ДокументОтправлен
	|ИЗ
	|	РегистрСведений.ОтправкаЭлектронныхДокументов КАК ОтправкаЭлектронныхДокументов
	|ГДЕ
	|	ОтправкаЭлектронныхДокументов.ДокументОтправлен = ИСТИНА
	|	И ОтправкаЭлектронныхДокументов.Документ = &ТекДок
	|	И ОтправкаЭлектронныхДокументов.ВидДокумента = &Уведомл";
	Запрос2.УстановитьПараметр("ТекДок",ссылка);
	Запрос2.УстановитьПараметр("Уведомл",Перечисления.ДокументЕКОД.ПодтверждениеЗаказа);
	ДокументОтправлен = Запрос2.Выполнить().Выбрать();			
	
	
	
	
	// нечаева 26,10,15 +++
	// проверим, есть ли по 7 континенту вторая РНК по одному и тому номеру заказа.	
	// передаем теперь  все по номеру заказа для перекрестка!!!, т.к по ленте не надо там куча заказов на один номер
	// теперь если несколько РНК - на один заказ, то нужно отправить одно подтверждение на заказ.
	ТЗЗаказов = Новый ТаблицаЗначений;
	//нечаева 02,11,15+++
	ТЗЗаказов.Колонки.Добавить("Документ");
	//нечаева 02,11,15---
	ТЗЗаказов.Очистить();
	
	НовСтр = ТЗЗаказов.Добавить();
	НовСтр.документ = ссылка;
	
	//нечаева 22,03,16---
	
	Если ДокументОтправлен.Количество() = 0 тогда 
		
		Запрос.УстановитьПараметр("Контрагент", ДокОбъект.Контрагент);
		Запрос.УстановитьПараметр("ВидДокумента", Перечисления.ДокументЕКОД.ПодтверждениеЗаказа);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда                             // нечаева 09,10,19+++ добавилась Сфера ЕДИ
			Если Выборка.Провайдер = 0 ИЛИ Выборка.Провайдер = 1 ИЛИ Выборка.Провайдер = 3 Тогда //Для Коруса (0) или СКБ-Контур (1) выходные файлы 1 в 1. Отлично только куда сохранять файлы
				
				СформироватьПодтверждениеЗаказа(ТЗЗаказов, Ошибка, Выборка.Провайдер);
				
				//нечаева 28,10,15+++
				Если Ошибка = 0 Тогда
					Для каждого текЗаказ из ТЗЗаказов цикл
						Док = ТекЗаказ.документ.ссылка;
						ЗаписатьДанныеВРегистрОтправкаЭлектронныхДокументов(Док,,Перечисления.ДокументЕКОД.ПодтверждениеЗаказа);
					конецЦикла;
				КонецЕсли;
				//нечаева 28,10,15---
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	// нечаева 28,01,15 ---
	
	
	
	
	Если Ошибка = 0 Тогда
		// нечаева 28,01,15 +++
		// проверим не отправлено ли еще уведомление об отгрузке 
		Запрос2 = Новый Запрос;
		Запрос2.Текст= "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОтправкаЭлектронныхДокументов.ВидДокумента,
		|	ОтправкаЭлектронныхДокументов.ДокументОтправлен
		|ИЗ
		|	РегистрСведений.ОтправкаЭлектронныхДокументов КАК ОтправкаЭлектронныхДокументов
		|ГДЕ
		|	ОтправкаЭлектронныхДокументов.ДокументОтправлен = ИСТИНА
		|	И ОтправкаЭлектронныхДокументов.Документ = &ТекДок
		|	И ОтправкаЭлектронныхДокументов.ВидДокумента = &Уведомл";
		Запрос2.УстановитьПараметр("ТекДок",ссылка);
		Запрос2.УстановитьПараметр("Уведомл",Перечисления.ДокументЕКОД.УведомлениеОбОтгрузке);
		ДокументОтправлен = Запрос2.Выполнить().Выбрать();			
		
		Если ДокументОтправлен.Количество() = 0 тогда 
			//нечаева 29,04,15++
			Запрос.УстановитьПараметр("Контрагент", ДокОбъект.Контрагент);
			//нечаева 29,04,15--
			Запрос.УстановитьПараметр("ВидДокумента", Перечисления.ДокументЕКОД.УведомлениеОбОтгрузке);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда                            // нечаева 09,10,19+++  добавился 3 платформа - Сфера ЕДИ
				Если Выборка.Провайдер = 0 ИЛИ Выборка.Провайдер = 1 ИЛИ Выборка.Провайдер = 3 Тогда //Для Коруса (0) или СКБ-Контур (1) выходные файлы 1 в 1. Отлично только куда сохранять файлы
					
					// только для отгруженных
					//нечаева 07,05,15+++
					//	Если СостояниеНакладной =Перечисления.СостоянияНакладной.Отгружена Тогда
					//нечаева 07,05,15---
					
					//для холидей накладную отправляем вместо уведомления.
					Если контрагент.код = "SSR-2291" Тогда
						//отправляем накладную, другим уведомление
						//нечаева 12,04,16++ уведомление, только в РГ и отгружено
						Если  СостояниеНакладной <> Перечисления.СостоянияНакладной.КОтправкеНаСклад и СостояниеНакладной <> Перечисления.СостоянияНакладной.ПолученоСкладом  Тогда
							
							СформироватьИнвойсКорус(ДокОбъект, Ошибка, Выборка.Провайдер)
							
						КонецЕсли;	
						
					иначе
						//нечаева 12,04,16++ уведомление, только в РГ и отгружено
						Если  СостояниеНакладной <> Перечисления.СостоянияНакладной.КОтправкеНаСклад и СостояниеНакладной <> Перечисления.СостоянияНакладной.ПолученоСкладом  Тогда
							СформироватьУведомление(ДокОбъект, Ошибка, Выборка.Провайдер);
						КонецЕсли;	
					КонецЕсли;
					//нечаева 12,04,16 ---
					
					//	конецЕсли;
					
					//для Ленты - 
					////нечаева 07,05,15+++
					//Если СостояниеНакладной =Перечисления.СостоянияНакладной.ГотоваКОтгрузке и ссылка.Контрагент.Код = "SSR-1593" Тогда
					//	//нечаева 07,05,15-*-- ссылку убрала
					//	СформироватьУведомление(ДокОбъект, Ошибка, Выборка.Провайдер);
					//конецЕсли;
					//
					
					
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		// нечаева 28,01,15 ---
	КонецЕсли;
	
	
	
КонецПроцедуры



//нечаева 29,01,015 ++++
//протестить сначала на 1 филиале, потом на все поставить?
Процедура  ЗаписатьДанныеВРегистрОтправкаЭлектронныхДокументов(ДокСсылка,ОшибкаЗаписи=неопределено,ВидДокумента)
	
	//очистим, если есть данные
	НаборЗаписей = РегистрыСведений.ОтправкаЭлектронныхДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВидДокумента.Установить(ВидДокумента); 
	НаборЗаписей.Отбор.Документ.Установить(ДокСсылка); 
	НаборЗаписей.Записать(); 
	
	//запишем
	НаборЗаписей = РегистрыСведений.ОтправкаЭлектронныхДокументов.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.ВидДокумента.Установить(ВидДокумента); 
	НаборЗаписей.Отбор.Документ.Установить(ДокСсылка); 
	
	НоваяЗапись = НаборЗаписей.Добавить(); 
	НоваяЗапись.ВидДокумента = ВидДокумента;
	// нечаева 03,10,17+++
	НоваяЗапись.НомерЗаказа = СокрЛП(ДокСсылка.НомерЗаказа);
	// нечаева 03,10,17*----
	НоваяЗапись.датаЗаказа  = ДокСсылка.ДатаЗаказа;
	Новаязапись.Документ = ДокСсылка;
	новаязапись.ДокументОтправлен = истина;
	новаязапись.дата = ТекущаяДата();
	
	НаборЗаписей.Записать(); 
	
	//тут же Регистрируем записи в обмен  из набора записей в SNL
	// для филиалов, со складов будет в Цо писаться, обмен по регистру идет только в офис.
	Если ПараметрыСеанса.ЭтотУзел.ТипУзла <> Перечисления.ТипУзлаИБ.УправляющееПодразделение и ПараметрыСеанса.ЭтотУзел.ТипУзла <> Перечисления.ТипУзлаИБ.Склад 	Тогда
		
		тзНаборЗаписей = НаборЗаписей.Выгрузить();
		НаборЗаписей.Отбор.ВидДокумента.Установить(ВидДокумента); 
		НаборЗаписей.Отбор.ВидДокумента.Использование=Истина;
		НаборЗаписей.Отбор.Документ.Установить(ДокСсылка);
		НаборЗаписей.Отбор.Документ.Использование=Истина;
		
		НаборЗаписей.Отбор.НомерЗаказа.Установить(номерЗаказа);
		НаборЗаписей.Отбор.номерЗаказа.Использование=Истина;
		НаборЗаписей.Отбор.датаЗаказа.Установить(ДатаЗаказа);
		НаборЗаписей.Отбор.ДатаЗаказа.Использование=Истина;
		
		НаборЗаписей.Прочитать();
		НаборЗаписей.ОбменДанными.Получатели.Добавить(ПланыОбмена.Основной.НайтиПоКоду("SNL"));			  
		ПланыОбмена.ЗарегистрироватьИзменения(ПланыОбмена.Основной.НайтиПоКоду("SNL"),НаборЗаписей);
		
	КонецЕсли;	
	//конец регистрации обмена	регистра
	
КонецПроцедуры
//нечаева 29,01,015 ---



//Катаев+ 01/12/14
Функция ПолучитьНомерЗаявки(ДокОбъект)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
	|ГДЕ
	|	РеквизитыРНКПНКПРМ.Документ = &Документ
	|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = &ИмяРеквизита";
	Запрос.УстановитьПараметр("Документ", ДокОбъект.Ссылка);
	Запрос.УстановитьПараметр("ИмяРеквизита", "НомерЗаявкиМолния");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЗначениеРеквизита;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции
//Катаев- 01/12/14

функция ДокументПрописан()
	
	ДокументПрописан= ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СостояниеЭлектронногоУПД.СостояниеУПД КАК СостояниеУПД,
	|	СостояниеЭлектронногоУПД.Дата КАК Дата
	|ИЗ
	|	РегистрСведений.СостояниеЭлектронногоУПД КАК СостояниеЭлектронногоУПД
	|ГДЕ
	|	СостояниеЭлектронногоУПД.Объект = &текдок";
	Запрос.УстановитьПараметр("ТекДок", ссылка);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество()>0 Тогда
		
		ДокументПрописан = истина;
	КонецЕсли;   
	
	возврат ДокументПрописан;
	
	
КонецФункции	

Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//Тимофеев Ю.А. Начало   28-11-2024  ID-14396
	//
	//Рефакторинг кода - далее два раза обращение и иногда фоновое падает с ошибкой
	СписокПровереряемыхКонтрагентов = Новый СписокЗначений;
	СписокПровереряемыхКонтрагентов.Добавить(Справочники.Контрагенты.НайтиПоКоду("SSP-2450"));
	СписокПровереряемыхКонтрагентов.Добавить(Справочники.Контрагенты.НайтиПоКоду("EKF-0735"));
	//Тимофеев Ю.А. Конец    28-11-2024
	
	// Кухарь А.Ю. 04.03.2024 начало
	// РНК которая нужна только для УПД
	Если МеждуСвоимиОрганизациями тогда возврат;КонецЕсли; 
	// Кухарь А.Ю. 04.03.2024 конец
	
	//доработки Чиркова для свертки базы, 04.08.2016 начало
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;	
	//доработки Чиркова для свертки базы, начало 04.08.2016 конец
	// +++ {Кузнецов Сергей Владимирович [10.08.2022]
	ПростоЗаписать=ложь; 
	// }Кузнецов Сергей Владимирович +++ [10.08.2022]
	
	#Область ТребуетсяУдалятьСФ
	// Шворобей ВЮ 12.11.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1286
	Если ДополнительныеСвойства.Свойство("ТребуетсяУдалятьСФ") И
		ДополнительныеСвойства.ТребуетсяУдалятьСФ = Истина Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Накладная", Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Накладные.Ссылка КАК СФ
		|ИЗ
		|	Документ.СчетФактура.Накладные КАК Накладные
		|ГДЕ
		|	Накладные.Накладная = &Накладная
		|	И НЕ Накладные.Ссылка.ПометкаУдаления";
		
		УстановитьПривилегированныйРежим(Истина);
		Выборка = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);
		
		Пока Выборка.Следующий() Цикл
			СФОбъект = Выборка.СФ.ПолучитьОбъект();
			Если СФОбъект <> Неопределено Тогда
				СФОбъект.УстановитьПометкуУдаления(Истина);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	// Шворобей ВЮ 12.11.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1286
	#КонецОбласти
	
	//Кухарь 15.06.16 начало
	если СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке и ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.Склад тогда
		ЗаписьВРег=РегистрыСведений.СкладскойЧекЛист.СоздатьНаборЗаписей();
		ЗаписьВРег.Отбор.Объект.значение=Ссылка;
		ЗаписьВРег.Отбор.Объект.использование=Истина;
		ЗаписьВРег.Отбор.Операция.значение="ВложениеПакетаДокументовВКоробку";
		ЗаписьВРег.Отбор.Операция.использование=Истина;
		ЗаписьВРег.Прочитать();
		если ЗаписьВРег.Количество()=0 тогда			
			Запись=ЗаписьВРег.Добавить();
			Запись.Объект=Ссылка;
			Запись.Операция="ВложениеПакетаДокументовВКоробку";	
			Запись.ДатаИзменения=ТекущаяДата();
			Запись.ДопСведения="Не вложены";
			ЗаписьВРег.Записать();
		КонецЕсли;
	КонецЕсли;
	//Кухарь 15.06.16 конец
	
	
	Если НачСостНакладной<>СостояниеНакладной Тогда
		ЗаписатьИзменениеСостоянияНакладной(Ссылка,СостояниеНакладной);
	КонецЕсли;
	//крохин начало 06.08.2013
	//для РНК с РКМ
	Если НЕ ПараметрыСеанса.ОтключитьЖурнализациюЗаписи	Тогда 
		Если  ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение И СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена И ОтгрузкаКомплектов Тогда
			ЗаполнитьПервичнуюГруппуНоменклатуры(Товары.ВыгрузитьКолонку("Номенклатура"));
		КонецЕсли;
	КонецЕсли;
	//крохин конец 06.08.2013
	//Катаев+ 08/10/14
	
	ДокументПрописан= ложь;
	
	////нечаева 09,03,23+++
	//// проверим, еслть ли уже данные по регистру если есть, больше не пишем автоматом.
	//
	//	
	//	
	//Если Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-2450")  или Контрагент = Справочники.Контрагенты.НайтиПоКоду("EKF-0735") 
	//	и  СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке и ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.Склад
	//	
	//	тогда
	//	ДокументПрописан =ДокументПрописан();
	//	
	//КонецЕсли;
	//// нечаева 09,03,23----
	
	//Тимофеев Ю.А. Начало   28-11-2024  ID-14396
	// проверим, еслть ли уже данные по регистру если есть, больше не пишем автоматом.
	//Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-2450")  или Контрагент = Справочники.Контрагенты.НайтиПоКоду("EKF-0735")
	//заменим на СписокПровереряемыхКонтрагентов.НайтиПоЗначению(Контрагент)<>Неопределено
	
	Если СписокПровереряемыхКонтрагентов.НайтиПоЗначению(Контрагент)<>Неопределено 
		//Тимофеев Ю.А. Конец    28-11-2024
		и  СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке и ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.Склад
		Тогда
		
		ДокументПрописан =ДокументПрописан();
		
	КонецЕсли;
	
	Попытка	
		//Нечаева 10,10,17
		//Ашан. запись статуса для УПД.                                       // Нечаева 19.02.21+++   бьютилайф
		
		//Тимофеев Ю.А. Начало   28-11-2024
		//
		//Было
		//Если (Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-2450")  или Контрагент = Справочники.Контрагенты.НайтиПоКоду("EKF-0735"))
		//Стало
		Если СписокПровереряемыхКонтрагентов.НайтиПоЗначению(Контрагент)<>Неопределено		
			//Тимофеев Ю.А. Конец    28-11-2024                                            
			
			и  контрагент.ОтправлятьУПД 
			и  СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке и ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.Склад И (НЕ документПРописан)
			
			Тогда
			
			МенеджерЗаписи = РегистрыСведений.СостояниеЭлектронногоУПД.СоздатьМенеджерЗаписи();
			
			МенеджерЗаписи.Объект = ссылка;
			МенеджерЗаписи.Дата = ТекущаяДата();
			МенеджерЗаписи.Комментарий ="запись документа рнк2";
			МенеджерЗаписи.СостояниеУПД = перечисления.СостояниеУПД.ТребуетсяУПД;
			
			МенеджерЗаписи.Записать();
		КонецЕсли;
	Исключение
	КонецПопытки;
	//нечаева 10,10,17---
	
	
	//Нечаева 29,03,22 ++
	// сделаем запись в регистр, что это по веб заказам. после выгрузки на сайт проставим, что отгружен
	ЗаказССайта = ложь;
	РНКСсайта = ложь;
	попытка
		//++Данилова Е.В. 06.12.2024 		
		ЗаказыПоРНК = ПроцедурыОбменаССайтом.ПолучитьЗаказыПоРНК(Ссылка);
		ЗаказССайта = ПроцедурыОбменаССайтом.ОпределитьПризнакЗаказаССайта(ЗаказыПоРНК);
		//ЗаказССайта = ПроцедурыОбменаССайтом.ОпределитьПризнакЗаказаССайта(ДокОснование.Ссылка);
		//--Данилова Е.В. 06.12.2024
		РНКССайта = ПроцедурыОбменаССайтом.ОпределитьПризнакРНКССайта(Ссылка);
	исключение
		
	конецПопытки;
	
	Если ЗаказССайта и Не РНКССайта  и ( СостояниеНакладной= перечисления.СостоянияНакладной.Отгружена) Тогда
		Успешно = ПроцедурыОбменаССайтом.УстановитьКатегориюДокумента(ЭтотОбъект.Ссылка, Справочники.КатегорииОбъектов.ЗаказСWEBСайта, Истина);
	КонецЕсли;
	//нечаева 29,03,22 --	
	
	
	
	Если НужноВыгружать Тогда
		ЗанестиФилиалыВРегистрПолучателей(ЭтотОбъект);
	КонецЕсли;
	//Катаев- 08/10/14
	
	
	//+++Чирков Д.С. 30.03.2026 MARK-3532 Удалять коды из оперативного регистра при пометке на удаление РНК
	Если ПометкаУдаления И НЕ Отказ Тогда
		БылаПометкаУдаления = МаркировкаКС.ПолучитьЗначениеПараметра(ДополнительныеСвойства, "БылаПометкаУдаления");	
		Если БылаПометкаУдаления = Ложь Тогда
			РегистрыСведений.ОтгружаемыеКодыМаркировки.СоздатьЗадачуОчисткиОтгружаемыхКМНакладной(Ссылка);					
		КонецЕсли;
	КонецЕсли;
	//---Чирков Д.С. 30.03.2026
КонецПроцедуры



Процедура ПровестиПоВзаиморасчетам(Записывать=Ложь) Экспорт
	Если Отгружен=Перечисления.Отгружен.Отгружен Тогда
		ДвиженияПоВзаиморасчетам=Неопределено;
		РезультатПроведения=ПроведениеПоРегистрамВзаиморасчетов(Ссылка,ДвиженияПоВзаиморасчетам);
		ВыполнитьДвиженияПоРегистрам(ДвиженияПоВзаиморасчетам,Записывать);
	КонецЕсли;
КонецПроцедуры 

// *** 2011-11-21 сезонные бонусы
//Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,Записывать=Ложь)
// ---------- заменено на:
Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,Записывать=Ложь,Очищать=Истина)
	// 2011-11-21 сезонные бонусы ***
	Для Каждого НаборДвижений Из ДвиженияПоРегистрам Цикл
		ИмяРегистра		=НаборДвижений.Ключ;
		ТаблицаДвижения =НаборДвижений.Значение;
		
		Если Движения.Найти(ИмяРегистра)=Неопределено Тогда Продолжить  КонецЕсли; 
		
		НаборЗаписей=Движения[ИмяРегистра];
		Если Очищать Тогда
			НаборЗаписей.Очистить();
		КонецЕсли;
		
		Для Каждого Движение Из ТаблицаДвижения Цикл
			Запись=НаборЗаписей.Добавить();	
			ЗаполнитьЗначенияСвойств(Запись,Движение);	
			
			Запись.Регистратор=Ссылка;
		КонецЦикла;	
		
		Если Записывать Тогда
			НаборЗаписей.Записать();		
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры 

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт	
	
	если МеждуСвоимиОрганизациями тогда возврат;КонецЕсли; 
	
	Если ОбщегоНазначения_ПИ.ЭтоУзел_ЦО() Тогда
		Если СостояниеКоррекции = Перечисления.СостоянияКоррекции.Отработана Тогда
			Возврат;	
		КонецЕсли;
	ИначеЕсли ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.Склад Тогда
		Если СостояниеНакладной = Перечисления.СостоянияНакладной.Отменена Тогда
			Возврат;	
		КонецЕсли;
	КонецЕсли;
	
	ДвиженияПоРегистрам=Неопределено;
	
	Если ОбщегоНазначения_ПИ.ЭтоУзел_Склад() Тогда		
		Если  СостояниеНакладной=Перечисления.СостоянияНакладной.ПолученоСкладом Тогда
			Возврат;
		КонецЕсли;
		Если Отгружен<>Перечисления.Отгружен.Отгружен Тогда
			Возврат;								
		КонецЕсли;		
	КонецЕсли;
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	Если КодОперации = Перечисления.КодыОперацийОстатки.ВозвратПоставщику Тогда		
		ТаблицаСписания = Неопределено;
		РезультатПроведения=ПроведениеПоРегистрамОстатков(Ссылка,ДвиженияПоРегистрам,ОбменДанными.Загрузка,ТаблицаСписания);
		//подарки
	ИначеЕсли Подарок Тогда
		ТаблицаСписания = Неопределено;
		РезультатПроведения=ПроведениеПоРегистрамОстатков(Ссылка,ДвиженияПоРегистрам,ОбменДанными.Загрузка,ТаблицаСписания);
	Иначе
		РезультатПроведения=ПроведениеПоРегистрамОстатков(Ссылка,ДвиженияПоРегистрам,ОбменДанными.Загрузка);	
	Конецесли;
	
	Результат=РезультатПроведения["Результат"];
	
	Если Результат<0 И НЕ ОбменДанными.Загрузка Тогда		
		Отказ=Не(ПолучитьПолномочиеПользователя("СписыватьВМинус"));		
		
		ВывестиТрассировку(РезультатПроведения["ТОшибок"],?(Отказ,-2,Результат));			
	КонецЕсли; 
	
	
	Если НЕ Отказ Тогда
		ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,ОбменДанными.Загрузка);	
		
		ОчищатьДвиженияПоВзаиморасчетам = Истина;
		Если СезонныйБонус Тогда
			ДвиженияПоВзаиморасчетам	= Неопределено;
			РезультатПроведения			= ПровестиПоВзаиморасчетамСезонныеБонусы(Ссылка, ДвиженияПоВзаиморасчетам);
			ВыполнитьДвиженияПоРегистрам(ДвиженияПоВзаиморасчетам, ОбменДанными.Загрузка, ОчищатьДвиженияПоВзаиморасчетам);
			ОчищатьДвиженияПоВзаиморасчетам = Ложь; // последующие вызовы ВыполнитьДвиженияПоРегистрам() не должны приводить к очистке движений по взаиморасчётам
		КонецЕсли;
		
		Если Отгружен=Перечисления.Отгружен.Отгружен Тогда
			ДвиженияПоВзаиморасчетам=Неопределено;
			РезультатПроведения=ПроведениеПоРегистрамВзаиморасчетов(Ссылка, ДвиженияПоВзаиморасчетам);
			
			ВыполнитьДвиженияПоРегистрам(ДвиженияПоВзаиморасчетам, ОбменДанными.Загрузка, ОчищатьДвиженияПоВзаиморасчетам);
			
			Если  дата >= '20100701'  Тогда
				СформироватьДвиженияПоЗатратам(ТаблицаСписания);	
			КонецЕсли;
			
			Если КодОперации = Перечисления.КодыОперацийОстатки.Комиссия
				ИЛИ (КодОперации = Перечисления.КодыОперацийОстатки.Реализация И Склад.ТипСклада = Перечисления.ТипСклада.КомиссионныйСклад) Тогда
				
				ДвиженияПоОстаткамТМЦКомиссия = Неопределено;
				РезультатПроведения = ПроведениеПоРегиструОстаткиТМЦКомиссия(Ссылка,ДвиженияПоОстаткамТМЦКомиссия);
				ВыполнитьДвиженияПоРегистрам(ДвиженияПоОстаткамТМЦКомиссия, ОбменДанными.Загрузка);
				
			КонецЕсли;
		КонецЕсли;      
		
		// Кухарь А.Ю.  13.07.2026 начало 
		// Изменение 0000000223
		НужныПроводкиПоПланам = ОбщегоНазначения_ПИ.ДляНакладнойТребуютсяПроводкиПоОстаткамПланов(Ссылка, Контрагент);    
		Если НужныПроводкиПоПланам Тогда
			РегистрыНакопления.ОстаткиПлановПродаж.СформироватьИЗаписатьДвижения(ЭтотОбъект);    
		КонецЕсли;
		// Кухарь А.Ю.  13.07.2026 конец
		
	КонецЕсли; 
	
	
	если не УчетСертификатов.ПровестиДокументПоСертификатнымОстаткам(ЭтотОбъект) тогда
		отказ=Истина;
	КонецЕсли;
	
	//заказы контрагентов. Дописать условие на код операции
	Если КодОперации = Перечисления.КодыОперацийОстатки.АгентскийДоговор Тогда
		ДвиженияПоРегистрам=Неопределено;
		РезультатПроведения=ПроведениеПоРегистрамЗаказыКонтрагентов(Ссылка,ДвиженияПоРегистрам,ОбменДанными.Загрузка);
		ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,ОбменДанными.Загрузка);
	КонецЕсли;
	
	//запись объёма коробов и количество коробок в регистр	
	ЧСостояние=ПолучитьНомерСостоянияНакладной(СостояниеНакладной);
	если  ЧСостояние < 400 и ЧСостояние<>0 тогда
		если ПараметрыСеанса.ЭтотУзел.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
			ЗаписатьКоличествоИОбъемКоробовВРегистр(ЭтотОбъект.Ссылка,КоличествоКоробок,ОбъемКоробов);
		КонецЕсли;		
	КонецЕсли;
	
	Движения.Записать();
	если СостояниеКоррекции=Перечисления.СостоянияКоррекции.Утверждена и ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение и не ОбменДанными.Загрузка тогда
		ЗаписатьЗначениеВРеквизитыРНКПНКПРМ("ДатаПоследнегоИзменения",ТекущаяДата(),Ссылка);
	КонецЕсли;
	
	// Ихсанов Д. А. Начало 16.04.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2199
	Если ПараметрыСеанса.ТипУзла <> Перечисления.ТипУзлаИБ.Склад
		// Ихсанов Д. А. Начало 27.05.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2270
		//И СостояниеНакладной = Перечисления.СостоянияНакладной.КОтправкеНаСклад
		// Ихсанов Д. А. Конец  27.05.2025
		И (НЕ ОбменДанными.Загрузка) Тогда
		ПроверитьИнтернетЗаказПоРасходнойНакладной(Отказ);
	КонецЕсли;
	// Ихсанов Д. А. Конец  16.04.2025  
	
	
	

	
КонецПроцедуры



Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	Если Основание=Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;
	
	ВидОснования	= Основание.Метаданные().Имя;
	
	////////////////////////////////////////////////////////////////////////
	//Кухарь А.Ю.  27.10.2024 начало
	//Временно закомментировал. Этот код 3 месяца провисел в хранилище и никому не понадобился	
	//Если ВидОснования = "Заказ" Тогда
	//	#Если Клиент Тогда
	//		ВызватьИсключение "Документ РНК на основании Заказа создать не получится!";
	//	#КонецЕсли
	//КонецЕсли;
	//Кухарь А.Ю.  27.10.2024 конец
	////////////////////////////////////////////////////////////////////////
	
	ВариантЗаполнения=Неопределено;
	#ЕСЛИ КЛИЕНТ ТОГДА
		//крохин начало 08.10.2020	
		//при вводе на основании заказа заполняем по остаткам соответствующего регистра, а не по документу
		//ВариантЗаполнения=ВыбратьВариантЗаполнения();
		Если ВидОснования <> "Заказ" Тогда
			ВариантЗаполнения=ВыбратьВариантЗаполнения();	
		КонецЕсли;
		//крохин конец 08.10.2020	
	#КОНЕЦЕСЛИ
	
	
	ДокОснование	= Основание;
	
	// Шворобей ВЮ 20.09.2023 ++
	
	//Кухарь А.Ю.  20.10.2023 начало
	//ШаблонРеквизитов = "ИБ,Контрагент,Договор,ЛевыйКонтрагент,ПунктДоставки,Менеджер,БанковскийСчет,Организация,ОтсрочкаПлатежа,ВидОплаты,ТипЦен,ТипСкидок,Скидка,ТранспортнаяКомпания";
	ШаблонРеквизитов = "ИБ,Контрагент,Договор,ЛевыйКонтрагент,ПунктДоставки,Менеджер,БанковскийСчет,Организация,
	|ОтсрочкаПлатежа,ВидОплаты,ТипЦен,ТипСкидок,Скидка,ТранспортнаяКомпания,КодВторичногоКонтрагента,НаименованиеВторичногоКонтрагента,НомерЗаказаВторичногоКонтрагента";	
	//Кухарь А.Ю.  20.10.2023 конец
	
	
	СписокРеквизитов = ЗаполнениеДокументов.СформироватьСтрокуРеквизитовПоШаблону(Основание, ШаблонРеквизитов);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание, СписокРеквизитов);
	
	//ИБ				= Основание.ИБ;
	//Контрагент 		= ПолучитьРеквизитОбъекта(ДокОснование,"Контрагент");
	//Договор			= ПолучитьРеквизитОбъекта(ДокОснование,"Договор");
	//ЛевыйКонтрагент = ПолучитьРеквизитОбъекта(ДокОснование,"ЛевыйКонтрагент");
	//ПунктДоставки	= ПолучитьРеквизитОбъекта(ДокОснование,"ПунктДоставки");
	//Менеджер 		= ПолучитьРеквизитОбъекта(ДокОснование,"Менеджер");
	//БанковскийСчет	= ПолучитьРеквизитОбъекта(ДокОснование,"БанковскийСчет");
	//ОтсрочкаПлатежа = ПолучитьРеквизитОбъекта(ДокОснование,"ОтсрочкаПлатежа");			
	//ВидОплаты		= ПолучитьРеквизитОбъекта(ДокОснование,"ВидОплаты");		
	//Организация		= ПолучитьРеквизитОбъекта(ДокОснование,"Организация");
	
	//ТипЦен			= ПолучитьРеквизитОбъекта(ДокОснование,"ТипЦен");
	//ТипСкидок		= ПолучитьРеквизитОбъекта(ДокОснование,"ТипСкидок");
	//Скидка			= ПолучитьРеквизитОбъекта(ДокОснование,"Скидка");	
	//ТранспортнаяКомпания = ПолучитьРеквизитОбъекта(ДокОснование,"ТранспортнаяКомпания");
	
	// Шворобей ВЮ 20.09.2023 ++
	
	//крохин начало 03.08.2015
	ПереданПокупателюВЭлВиде = Ложь;
	//крохин конец 03.08.2015
	
	//крохин начало 25.05.2015
	//состояние накладной "в работе", иначе неверно отрабатывает "управление видимостью"
	СостояниеНакладной  = Перечисления.СостоянияНакладной.ВРаботе;
	//крохин конец 25.05.2015
	
	//крохин начало 25.12.2014
	//банковский счет и организацию перезаполняем из договора	
	Если ЗначениеЗаполнено(Договор.Организация) Тогда
		Организация=Договор.Организация;
		БанковскийСчет = Организация.ОсновнойБанковскийСчет;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Договор.РасчетныйСчетДляОплаты)  Тогда
		БанковскийСчет = Договор.РасчетныйСчетДляОплаты;
	КонецЕсли;
	
	Если ВидОснования = "Перемещение" Тогда
		Склад		= ДокОснование.СкладПолучатель;	
	Иначе		
		Склад		= ПолучитьРеквизитОбъекта(ДокОснование,"Склад");	
	КонецЕсли;
	
	// Шворобей ВЮ 18.10.2023 ++
	ЗаказыКСогласованию = ПолучитьЗначРеквСпр(Контрагент,"ЗаказыКСогласованию");
	Если ЗаказыКСогласованию <> Неопределено Тогда
		Если ЗаказыКСогласованию Тогда
			ПредварительныйЗаказ = Истина;
		КонецЕсли;
	КонецЕсли;
	// Шворобей ВЮ 18.10.2023 ++
	
	//крохин начало 27.02.2013
	//если склад не соответствует подразделению - не копируем
	ЭтотУзел = ПараметрыСеанса.ЭтотУзел;
	Если ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		Если Склад.ТипСклада = Перечисления.ТипСклада.Филиал Тогда
			Склад = Справочники.Склады.ПустаяСсылка();
		КонецЕсли;
	ИначеЕсли ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
		Если Склад.Подразделение <> ЭтотУзел.Подразделение Тогда
			Склад = Справочники.Склады.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	//крохин конец 27.02.2013
	
	//крохин начало 05.03.2011
	//подразделение не копируем
	//++Данилова Е.В. 29.09.2025 HELP-7048
	//Подразделение = Менеджер.Подразделение; 
	Подразделение = ЗаполнениеДокументов.ПодразделениеПродажПоМенеджеру(Менеджер);
	//--Данилова Е.В. 29.09.2025
	Если Подразделение = Справочники.Подразделения.ПустаяСсылка() Тогда
		Подразделение = Склад.Подразделение;
	КонецЕсли;
	//крохин конец 05.03.2011
	
	//крохин начало 01.11.2012
	//снова копируем подразделение, только для РНК-основания
	Если ДокОснование.Метаданные().Имя = "РасходнаяНакладная" Тогда
		Подразделение = ПолучитьРеквизитРодителя(ДокОснование,"Подразделение");
	КонецЕсли;
	//крохин конец 01.11.2012
	
	//крохин начало
	//Группы товаров пересчитаем заново
	//ГруппыТоваров	= ПолучитьРеквизитОбъекта(ДокОснование,"ГруппыТоваров");
	//крохин конец
	
	// Андреев И.Д. 13.03.2024 начало	
	//ДопСкидкаНаНакладную = основание.контрагент.ДопСкидкаНаНакладную;
	если ЕстьРеквизитДокумента("контрагент",Основание.метаданные()) тогда
		ДопСкидкаНаНакладную = ПолучитьРеквизитШапки(Основание,"контрагент.ДопСкидкаНаНакладную","Документ");
	КонецЕсли;
	// Андреев И.Д. 13.03.2024 конец
	
	
	
	
	
	
	Если ВидОснования="ПриходнаяНакладная" И НЕ ПолучитьПолномочиеПользователя("ВидимостьПриходныхЦен") Тогда
		ОбнулитьЦены=Истина;	
	Иначе
		ОбнулитьЦены=Ложь;	
	КонецЕсли;
	
	Если ВариантЗаполнения="РазницаСНабором" Тогда
		Форма=Обработки.СравнениеЛистовНабора.ПолучитьФорму();		
		Форма.Документ		=ДокОснование;
		
		РезультатСравнения	=Форма.ПолучитьОшибкиНабора();	
		ТН					=РезультатСравнения.ТН;
		
		Дата				=ДокОснование.Дата;
		ДатаОтгрузки		=Дата;
		
		Комментарий		= "Недостача по ";
	Иначе
		Комментарий		= "";
	КонецЕсли;	
	
	//Комментарий=Комментарий+ДокОснование.Метаданные()+" № " + ДокОснование.Номер + " от " + Формат(ДокОснование.Дата,"ДФ=dd.MM.yy");
	//нечаева 11,10,22 ++
	Комментарий=ДокОснование.Комментарий+" "+комментарий+" "+ДокОснование.Метаданные()+" № " + ДокОснование.Номер + " от " + Формат(ДокОснование.Дата,"ДФ=dd.MM.yy");
	//нечаева 11,10,22 --
	
	
	//крохин начало 03.10.2012
	//ставка НДС
	Если ПунктДоставки.НулеваяСтавкаНДС или Контрагент.НулеваяСтавкаНДС Тогда
		НулеваяСтавкаНДС = Истина;	
	Иначе
		НулеваяСтавкаНДС = Ложь;
	КонецЕсли;
	//крохин конец 03.10.2012
	
	//Для Каждого исхСтрокаТЧ Из ДокОснование.Товары Цикл
	//	СтрокаТЧ = Товары.Добавить();
	//	
	//	ЗаполнитьЗначенияСвойств(СтрокаТЧ,исхСтрокаТЧ);	
	//	Если ВариантЗаполнения="НехватающиеЗаявка" Тогда
	//		СтрокаТЧ.ПодтвержденнаяЗаявка	=исхСтрокаТЧ.Заявка-исхСтрокаТЧ.Количество;
	//		СтрокаТЧ.Количество				=СтрокаТЧ.ПодтвержденнаяЗаявка;				
	//		СтрокаТЧ.Заявка					=СтрокаТЧ.ПодтвержденнаяЗаявка;
	//	ИначеЕсли ВариантЗаполнения="НехватающиеПодтверждение" Тогда
	//		СтрокаТЧ.ПодтвержденнаяЗаявка	=исхСтрокаТЧ.ПодтвержденнаяЗаявка-исхСтрокаТЧ.Количество;
	//		СтрокаТЧ.Количество				=СтрокаТЧ.ПодтвержденнаяЗаявка;				
	//		СтрокаТЧ.Заявка					=СтрокаТЧ.ПодтвержденнаяЗаявка;
	//	ИначеЕсли ВариантЗаполнения="Целиком" Тогда			
	//		Если СтрокаТЧ.Заявка=0 Тогда
	//			СтрокаТЧ.Заявка	=СтрокаТЧ.Количество;			
	//		КонецЕсли;
	//		Если СтрокаТЧ.ПодтвержденнаяЗаявка=0 Тогда
	//			СтрокаТЧ.ПодтвержденнаяЗаявка=СтрокаТЧ.Количество;
	//		КонецЕсли;
	//	ИначеЕсли ВариантЗаполнения="РазницаСНабором" Тогда
	//		СтрокаТН=ТН.Найти(СтрокаТЧ.Номенклатура,"Номенклатура");
	//		Если СтрокаТН=Неопределено Тогда
	//			СтрокаТЧ.Количество=0;	
	//		Иначе
	//			СтрокаТЧ.Количество				=СтрокаТН.Разница;
	//			СтрокаТЧ.Заявка					=СтрокаТН.Разница;
	//			СтрокаТЧ.ПодтвержденнаяЗаявка	=СтрокаТН.Разница;
	//		КонецЕсли;			
	//	КонецЕсли;		
	//	
	//	Если ОбнулитьЦены Тогда
	//		СтрокаТЧ.Цена=0;		
	//		СтрокаТЧ.ЦенаБезСкидки=0;
	//	КонецЕсли;
	//	
	//	Если СтрокаТЧ.Количество=0 Тогда
	//		Товары.Удалить(СтрокаТЧ);	
	//	Иначе
	//		РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект);
	//	КонецЕсли; 
	//КонецЦикла;	
	
	
	
	
	// нечаева начало
	//крохин начало 08.10.2020
	////при вводе на основании заказа заполняем по остаткам соответствующего регистра, а не по документу
	//Если ВидОснования <> "ПродажаИМ" Тогда
	Если ВидОснования <> "ПродажаИМ" И  ВидОснования <> "Заказ" Тогда
		//крохин конец 08.10.2020
		
		
		
		
		Для Каждого исхСтрокаТЧ Из ДокОснование.Товары Цикл
			СтрокаТЧ = Товары.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,исхСтрокаТЧ);
			//крохин начало 03.10.2012
			Если НулеваяСтавкаНДС Тогда
				СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НДС0;
			Иначе
				СтрокаТЧ.СтавкаНДС = СтрокаТЧ.Номенклатура.Родитель.СтавкаНДС;			
			КонецЕсли;
			//крохин конец 03.10.2012
			Если ВариантЗаполнения="НехватающиеЗаявка" Тогда
				СтрокаТЧ.ПодтвержденнаяЗаявка	=исхСтрокаТЧ.Заявка-исхСтрокаТЧ.Количество;
				СтрокаТЧ.Количество				=СтрокаТЧ.ПодтвержденнаяЗаявка;				
				СтрокаТЧ.Заявка					=СтрокаТЧ.ПодтвержденнаяЗаявка;
			ИначеЕсли ВариантЗаполнения="НехватающиеПодтверждение" Тогда
				СтрокаТЧ.ПодтвержденнаяЗаявка	=исхСтрокаТЧ.ПодтвержденнаяЗаявка-исхСтрокаТЧ.Количество;
				СтрокаТЧ.Количество				=СтрокаТЧ.ПодтвержденнаяЗаявка;				
				СтрокаТЧ.Заявка					=СтрокаТЧ.ПодтвержденнаяЗаявка;
			ИначеЕсли ВариантЗаполнения="Целиком" Тогда			
				Если СтрокаТЧ.Заявка=0 Тогда
					СтрокаТЧ.Заявка	=СтрокаТЧ.Количество;			
				КонецЕсли;
				Если СтрокаТЧ.ПодтвержденнаяЗаявка=0 Тогда
					СтрокаТЧ.ПодтвержденнаяЗаявка=СтрокаТЧ.Количество;
				КонецЕсли;
			ИначеЕсли ВариантЗаполнения="РазницаСНабором" Тогда
				СтрокаТН=ТН.Найти(СтрокаТЧ.Номенклатура,"Номенклатура");
				Если СтрокаТН=Неопределено Тогда
					СтрокаТЧ.Количество=0;	
				Иначе
					СтрокаТЧ.Количество				=СтрокаТН.Разница;
					СтрокаТЧ.Заявка					=СтрокаТН.Разница;
					СтрокаТЧ.ПодтвержденнаяЗаявка	=СтрокаТН.Разница;
				КонецЕсли;			
			КонецЕсли;		
			
			Если ОбнулитьЦены Тогда
				СтрокаТЧ.Цена=0;		
				СтрокаТЧ.ЦенаБезСкидки=0;
			КонецЕсли;
			
			Если СтрокаТЧ.Количество=0 Тогда
				Товары.Удалить(СтрокаТЧ);	
			Иначе
				РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект);
			КонецЕсли; 
		КонецЦикла;	
		//крохин начало 26.07.2022
		////при вводе на основании заказа b2b заполняем полностью как в заказе
	ИначеЕсли ВидОснования = "Заказ" И Основание.ИсточникЗаказа = Перечисления.ИсточникЗаказа.Сайт Тогда
		
		// Шворобей ВЮ 20.09.2023 ++
		ШаблонРеквизитов = "Скидка,Дата,ДатаОтгрузки,ДопСкидкаНаНакладную,КодВторичногоКонтрагента,НаименованиеВторичногоКонтрагента,НомерЗаказаВторичногоКонтрагента";
		СписокРеквизитов = ЗаполнениеДокументов.СформироватьСтрокуРеквизитовПоШаблону(Основание, ШаблонРеквизитов);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание, СписокРеквизитов);
		// Шворобей ВЮ 20.09.2023 ++
		
		Для Каждого исхСтрокаТЧ Из ДокОснование.Товары Цикл
			СтрокаТЧ = Товары.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,исхСтрокаТЧ);
			
			СтрокаТЧ.ПодтвержденнаяЗаявка = СтрокаТЧ.Количество;
			
			Если НулеваяСтавкаНДС Тогда
				СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НДС0;
			Иначе
				СтрокаТЧ.СтавкаНДС = СтрокаТЧ.Номенклатура.Родитель.СтавкаНДС;			
			КонецЕсли;
		КонецЦикла;	
		//крохин конец 26.07.2022
		
		// Шворобей ВЮ 20.09.2023 ++ Отключил за ненадобностью
		//нечаева 18,11,2022++
		//Скидка = ДокОснование.скидка;
		//Дата = ДокОснование.Дата;
		//ДатаОтгрузки = ДокОснование.ДатаОтгрузки;
		//ДопСкидкаНаНакладную = ДокОснование.ДопСкидкаНаНакладную;
		// нечаева 18,11,2022++
		// Шворобей ВЮ 20.09.2023 ++ Отключил за ненадобностью
		
		////при вводе на основании заказа заполняем по остаткам соответствующего регистра, а не по документу
	ИначеЕсли ВидОснования = "Заказ" Тогда
		
		// Шворобей ВЮ 20.09.2023 ++
		ШаблонРеквизитов = "Дата,ДатаОтгрузки,ДопСкидкаНаНакладную,КодОперации,ПунктДоставки,КодВторичногоКонтрагента,НаименованиеВторичногоКонтрагента,НомерЗаказаВторичногоКонтрагента,ПоставщикПоАгентскойСхеме";
		СписокРеквизитов = ЗаполнениеДокументов.СформироватьСтрокуРеквизитовПоШаблону(Основание, ШаблонРеквизитов);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание, СписокРеквизитов);
		// Шворобей ВЮ 20.09.2023 ++
		
		// Шворобей ВЮ 20.09.2023 ++ Отключил за ненадобностью
		// нечаева 01,06,22+++
		//Дата = ДокОснование.Дата;
		//ДатаОтгрузки = ДокОснование.ДатаОтгрузки;
		//ДопСкидкаНаНакладную = ДокОснование.ДопСкидкаНаНакладную;
		//КодОперации = Основание.КодОперации;
		//ПунктДоставки = Основание.ПунктДоставки;
		// нечаева 01,06,2022---
		// Шворобей ВЮ 20.09.2023 ++
		
		КодОперации = Перечисления.КодыОперацийОстатки.АгентскийДоговор;
		//крохин начало 15.12.2021
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Остатки.Номенклатура КАК Номенклатура,
		|	Остатки.КоличествоОстаток КАК КоличествоОстаток,
		|	Остатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ЗаказыКонтрагентов.Остатки(&Дата1, Заказ = &Заказ) КАК Остатки";
		
		Запрос.УстановитьПараметр("Заказ",Основание);
		Запрос.УстановитьПараметр("Дата1",ТекущаяДата());
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.КоличествоОстаток > 0 Тогда
				НоваяСтрокаТЧ = Товары.Добавить();
				НоваяСтрокаТЧ.Номенклатура = Выборка.Номенклатура;
				ПриИзмененииНоменклатурыТабЧасти(НоваяСтрокаТЧ,Ссылка);
				НоваяСтрокаТЧ.Количество = Выборка.КоличествоОстаток;
				НоваяСтрокаТЧ.Заявка = НоваяСтрокаТЧ.Количество;
				НоваяСтрокаТЧ.ПодтвержденнаяЗаявка = НоваяСтрокаТЧ.Количество;
				НоваяСтрокаТЧ.Цена = ?(Выборка.СуммаОстаток = 0,0,Выборка.СуммаОстаток/Выборка.КоличествоОстаток);
				РассчитатьСуммуТабЧасти(НоваяСтрокаТЧ, ЭтотОбъект);
			КонецЕсли;
		КонецЦикла;	
		//крохин конец 08.10.2020
		// Шворобей ВЮ 10.01.2024 ++
		ПересчитатьТабличнуюЧасть(Товары);
		// Шворобей ВЮ 10.01.2024 ++
	Иначе
		
		Комментарий="Заказ интернет магазина № " + ДокОснование.НомерВходящегоДокументаЭлектронногоОбмена + " от " + Формат(ДокОснование.ДатаВходящегоДокументаЭлектронногоОбмена,"ДФ=dd.MM.yy");
		ОбщСкидка=0;
		Для Каждого исхСтрокаТЧ Из ДокОснование.Товары Цикл
			СтрокаТЧ = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,исхСтрокаТЧ);	
			Если СтрокаТЧ.Скидка<>0 и СтрокаТЧ.Скидка<>-1 Тогда
				ОбщСкидка=10;
				Скидка=ОбщСкидка;
				СтрокаТЧ.скидка=0;
			КонецЕсли;	
			
			Если СтрокаТЧ.Количество=0 Тогда
				Товары.Удалить(СтрокаТЧ);	
			Иначе
				РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект);
			КонецЕсли;
			
		КонецЦикла;	
		
		// и для услуг
		Для Каждого исхСтрокаТЧ Из ДокОснование.Услуги Цикл
			
			СтрокаТЧ = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,исхСтрокаТЧ);
			СтрокаТЧ.Скидка=0;
			Если СтрокаТЧ.Количество=0 или СтрокаТЧ.Цена=0 Тогда
				Товары.Удалить(СтрокаТЧ);	
			Иначе
				//РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект);
			КонецЕсли; 
		КонецЦикла;	
		
		ТекДок=Основание.ПолучитьОбъект();
		ТекДок.СформированаРНк=Истина;
		ТекДок.записать(РежимЗаписиДокумента.ОтменаПроведения);
		
	КонецЕсли;
	// нечаева конец
	
	
	
	
	//крохин начало
	ГруппыТоваров	=ГруппыТоваровДокумента(ЭтотОбъект);
	Если Дата >= '20101001' Тогда
		СекторХранения = СекторХраненияДокумента(ЭтотОбъект);
	КонецЕсли;
	//крохин конец
	
	//крохин начало 22.02.2013
	СостояниеКоррекции = Перечисления.СостоянияКоррекции.ПустаяСсылка();
	//крохин конец 22.02.2013
	
	//крохин начало 17.09.2013
	ОтгружатьПоНулевымЦенам = Ложь;
	ОтгружатьСПревышениемЛимитаКредита = Ложь;
	ОтгружатьСПросроченнойЗадолженостью = Ложь;
	ОтгрузкуРазрешил = Ложь;
	//крохин конец 17.09.2013
	
	//крохин начало 19.05.2015
	Упаковка.Очистить();
	РедактированиеУпаковки = Ложь;
	//крохин конец 19.05.2015
	//Кухарь 09.03.17 начало
	КоличествоПаллет=0;
	//Кухарь 09.03.17 конец	
	//Кухарь 18.10.17 начало
	ОбъемПаллет=0;
	//Кухарь 18.10.17 конец
	//крохин начало 10.04.2017
	НомерСчета = Неопределено;
	ДатаСчета = Неопределено;
	//крохин конец 10.04.2017
	//Кухарь 19.01.18 начало
	ГосНомерАМЭкспедитора="";
	ФиоЭкспедитора="";
	ТелефонЭкспедитора="";
	ВремяПерегруза="";
	
	//Кухарь 19.01.18 конец
	//Кухарь 19.01.18 конец
	//Кухарь 14.05.18 начало
	//Заполним адрес из ПД
	если ПунктДоставки.ТипДоставки=Перечисления.ТипыДоставки.Перегруз или ПунктДоставки.ТипДоставки=Перечисления.ТипыДоставки.Самовывоз тогда
		АдресПерегруза=ПунктДоставки.АдресАнтор;
	КонецЕсли;
	//Кухарь 14.05.18 начало
	
	//Кухарь 16.01.19 начало
	ТрудозатратыНаТермоусадку=0;
	ТрудозатратыНаДО=0;
	ТрудозатратыНаНабор=0;
	ТрудозатратыНаПаллетирование=0;
	ТрудозатратыНаСканирование=0;
	ВремяНаДО=0;
	ВремяНаНабор=0;
	ВремяНаПаллетирование=0;
	ВремяНаСканирование=0;
	ВремяНаТермоусадку=0;
	//Кухарь 16.01.19 конец
	
	//крохин начало 22.01.2020
	ДоговорСкидкиДС = Справочники.Договоры.ПустаяСсылка();
	СуммаСкидкиДС = 0;
	//крохин конец 22.01.2020
	//  Кухарь 18.08.2020 начало
	//  
	РасходныеМатериалы.Очистить();
	// Кухарь  18.08.2020 конец
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)	
	Организация			=Неопределено;
	СостояниеНакладной	=Неопределено;
	//крохин начало 25.05.2015
	//состояние накладной "в работе", иначе неверно отрабатывает "управление видимостью"
	СостояниеНакладной  = Перечисления.СостоянияНакладной.ВРаботе;
	//крохин конец 25.05.2015
	Отгружен			=Неопределено;
	СостояниеДокументов	=Неопределено;	
	
	ДатаОтгрузки		=Неопределено;
	ДатаОплаты			=Неопределено;
	ДатаВыгрузки		=Неопределено;
	ДатаОформления		=Неопределено;
	
	Автор				=Неопределено;
	
	//крохин начало 03.08.2015
	ПереданПокупателюВЭлВиде = Ложь;
	//крохин конец 03.08.2015
	
	//крохин начало 27.02.2013
	//если склад не соответствует подразделению - не копируем
	ЭтотУзел = ПараметрыСеанса.ЭтотУзел;
	Если ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		Если Склад.ТипСклада = Перечисления.ТипСклада.Филиал Тогда
			Склад = Справочники.Склады.ПустаяСсылка();
		КонецЕсли;
	ИначеЕсли ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
		Если Склад.Подразделение <> ЭтотУзел.Подразделение Тогда
			Склад = Справочники.Склады.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	//крохин конец 27.02.2013
	
	
	Если Менеджер.Пустая() Тогда
		Менеджер=?(ПунктДоставки.Менеджер.Пустая(),Контрагент.Менеджер,ПунктДоставки.Менеджер);
		
	КонецЕсли;
	//крохин начало	
	//++Данилова Е.В. 29.09.2025 HELP-7048
	//Подразделение = Менеджер.Подразделение; 
	Подразделение = ЗаполнениеДокументов.ПодразделениеПродажПоМенеджеру(Менеджер);
	//--Данилова Е.В. 29.09.2025
	Если Подразделение = Справочники.Подразделения.ПустаяСсылка() Тогда
		Подразделение = Склад.Подразделение;
	КонецЕсли;
	//крохин конец
	
	Если Договор.Пустая() Или Договор.НеИспользовать Тогда
		Договор=Контрагент.ОсновнойДоговор;			
	КонецЕсли; 
	//крохин начало
	//только предоплата
	Если Контрагент.Ведущий.ТолькоПредоплата Тогда
		ОтсрочкаПлатежа = Справочники.ОтсрочкиПлатежа.НайтиПоКоду("1");	
	КонецЕсли;
	//крохин конец
	
	//крохин начало 03.10.2012
	//ставка НДС
	Если ПунктДоставки.НулеваяСтавкаНДС или Контрагент.НулеваяСтавкаНДС Тогда
		НулеваяСтавкаНДС = Истина;	
	Иначе
		НулеваяСтавкаНДС = Ложь;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ ИЗ Товары Цикл
		Если НулеваяСтавкаНДС Тогда
			СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НДС0;
		Иначе
			СтрокаТЧ.СтавкаНДС = СтрокаТЧ.Номенклатура.Родитель.СтавкаНДС;			
		КонецЕсли;
		РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект,"ОтВсего");
	КонецЦикла;
	//крохин конец 03.10.2012
	
	//крохин начало 22.02.2013
	СостояниеКоррекции = Перечисления.СостоянияКоррекции.ПустаяСсылка();
	//крохин конец 22.02.2013
	
	//крохин начало 17.09.2013
	ОтгружатьПоНулевымЦенам = Ложь;
	ОтгружатьСПревышениемЛимитаКредита = Ложь;
	ОтгружатьСПросроченнойЗадолженостью = Ложь;
	ОтгрузкуРазрешил = Ложь;
	//крохин конец 17.09.2013 
	
	//крохин начало 19.05.2015
	Упаковка.Очистить();
	РедактированиеУпаковки = Ложь;
	//крохин конец 19.05.2015
	//Кухарь 09.03.17 начало
	КоличествоПаллет=0;
	//Кухарь 09.03.17 конец	
	//Кухарь 18.10.17 начало
	ОбъемПаллет=0;
	//Кухарь 18.10.17 конец
	
	//крохин начало 10.04.2017
	НомерСчета = Неопределено;
	ДатаСчета = Неопределено;
	//крохин конец 10.04.2017
	//Кухарь 19.01.18 начало
	ГосНомерАМЭкспедитора="";
	ФиоЭкспедитора="";
	ТелефонЭкспедитора="";
	ВремяПерегруза="";
	
	//Кухарь 19.01.18 конец	
	//Кухарь 14.05.18 начало
	//Заполним адрес из ПД
	если ПунктДоставки.ТипДоставки=Перечисления.ТипыДоставки.Перегруз или ПунктДоставки.ТипДоставки=Перечисления.ТипыДоставки.Самовывоз тогда
		АдресПерегруза=ПунктДоставки.АдресАнтор;
	КонецЕсли;
	//Кухарь 14.05.18 начало
	
	//Кухарь 16.01.19 начало
	ТрудозатратыНаТермоусадку=0;
	ТрудозатратыНаДО=0;
	ТрудозатратыНаНабор=0;
	ТрудозатратыНаПаллетирование=0;
	ТрудозатратыНаСканирование=0;
	ВремяНаДО=0;
	ВремяНаНабор=0;
	ВремяНаПаллетирование=0;
	ВремяНаСканирование=0;
	ВремяНаТермоусадку=0;
	//Кухарь 16.01.19 конец
	
	//крохин начало 22.01.2020
	ДоговорСкидкиДС = Справочники.Договоры.ПустаяСсылка();
	СуммаСкидкиДС = 0;
	//крохин конец 22.01.2020
	
	//  Кухарь 18.08.2020 начало
	//  
	РасходныеМатериалы.Очистить();
	// Кухарь  18.08.2020 конец
	
	//крохин начало 21.11.2023
	КодВторичногоКонтрагента = "";
	НаименованиеВторичногоКонтрагента = "";
	НомерЗаказаВторичногоКонтрагента = "";
	//крохин конец 21.11.2023
	
	// Шворобей ВЮ 10.01.2024 ++
	ПоставщикПоАгентскойСхеме = Неопределено;
	ПересчитатьТабличнуюЧасть(Товары);
	// Шворобей ВЮ 10.01.2024 ++
	
КонецПроцедуры

// +++ Родионов, 2011-12-14, заполнение реквизита КоличествоПродукции
Функция НакладнаяОтгружена() Экспорт
	
	Возврат (СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена)
	Или (СостояниеНакладной = Перечисления.СостоянияНакладной.ОтгруженаНаТранзитныйСклад);
	
КонецФункции

Процедура ЗаполнитьКоличествоПродукции() Экспорт
	
	// обнуление колонки КоличествоПродукции
	Для Каждого СтрокаТЧ Из Комплектующие Цикл 
		СтрокаТЧ.КоличествоПродукции = 0;
	КонецЦикла;
	
	ТПродукции = Товары.Выгрузить(, "Номенклатура, Количество, Коэффициент");
	Для Каждого СтрокаТЗ Из ТПродукции Цикл
		СтрокаТЗ.Количество = СтрокаТЗ.Количество * СтрокаТЗ.Коэффициент;		
	КонецЦикла;
	ТПродукции.Свернуть("Номенклатура", "Количество");
	
	Для Каждого СтрокаТЗ Из ТПродукции Цикл
		СтрокаКомплектующих = Комплектующие.Найти(СтрокаТЗ.Номенклатура, "Продукция");
		Если СтрокаКомплектующих <> Неопределено Тогда
			СтрокаКомплектующих.КоличествоПродукции = СтрокаТЗ.Количество;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
// заполнение реквизита КоличествоПродукции, 2011-12-14, Родионов +++

//крохин начало
Процедура СформироватьДвиженияПоЗатратам(ТС) Экспорт
	ВалютаУпр=Константы.ВалютаУпрУчета_2009.Получить();
	Если КодОперации = Перечисления.КодыОперацийОстатки.ВозвратПоставщику Тогда
		ТС.Свернуть("Номенклатура","Количество,СписанаСтоимость");
		
		
		
		
		//списания по акциям
		ТЗ=Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("Подразделение");
		ТЗ.Колонки.Добавить("СтатьяЗатрат");
		
		ТЗ.Колонки.Добавить("СуммаУпр",ПолучитьОписаниеТиповЧисла(19,2));
		//крохин начало 03.02.2016
		//по возвратам поставщику другой вид движения
		ТЗ.Колонки.Добавить("ВидДвижения");
		//крохин конец 03.02.2016
		
		Для Каждого СтрокаТЧ Из Товары Цикл	
			СтрокаТС=ТС.Найти(СтрокаТЧ.Номенклатура,"Номенклатура");			
			Если СтрокаТС<>Неопределено И СтрокаТС.Количество<>0 Тогда
				// Шворобей 09.01.2024 ++ https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2458 Тогда
				Если Дата >= '20160101' И Контрагент.СтавкаНДСКонтрагента = Перечисления.СтавкиНДС.БезНДС И КодОперации = Перечисления.КодыОперацийОстатки.ВозвратПоставщику Тогда
					ТекСТавкаНДС = ПроцентНДСпоСтавке(ПолучитьСтавкуНДС(СтрокаТС.Номенклатура));
					ТекСтоимость = СтрокаТЧ.Цена*(1 + ТекСТавкаНДС/(1+ТекСТавкаНДС));
					//крохин начало 26.02.2016
					//НДС сверху с февраля 2016
					//ТекСтоимость = СтрокаТЧ.Цена*(1 + ТекСТавкаНДС/(1+ТекСТавкаНДС));
					Если Дата >= '20160201' Тогда
						ТекСтоимость = СтрокаТЧ.Цена*(1 + ТекСТавкаНДС);					
					Иначе
						ТекСтоимость = СтрокаТЧ.Цена*(1 + ТекСТавкаНДС/(1+ТекСТавкаНДС));
					КонецЕсли;
					//крохин конец 26.02.2016
					ДобавкаНДС = Окр(СтрокаТЧ.Всего - ТекСтоимость*СтрокаТС.Количество,2);
					Если ДобавкаНДС <> 0 Тогда
						СтрокаТЗ=ТЗ.Добавить();	
						СтрокаТЗ.ВидДвижения = ВидДвиженияНакопления.Приход;
						СтрокаТЗ.СуммаУпр		=  - ДобавкаНДС;
						СтрокаТЗ.СтатьяЗатрат	= Справочники.СтатьиЗатрат.НайтиПоКоду("321 210");;//ндс
						СтрокаТЗ.Подразделение	= Справочники.Подразделения.НайтиПоКоду("SSP-0001");
						
					КонецЕсли;
					СуммаЗатрат = Окр(СтрокаТЧ.Всего - СтрокаТЧ.Количество*СтрокаТС.СписанаСтоимость/СтрокаТС.Количество,2);
					ОстатокЗатрат = СуммаЗатрат - ДобавкаНДС;
					Если ОстатокЗатрат <> 0 Тогда
						СтрокаТЗ=ТЗ.Добавить();		
						СтрокаТЗ.ВидДвижения = ВидДвиженияНакопления.Расход;
						СтрокаТЗ.СуммаУпр		= ОстатокЗатрат;
						СтрокаТЗ.СтатьяЗатрат	= Справочники.СтатьиЗатрат.Конвертация;//ошибки ценообразования
						СтрокаТЗ.Подразделение	= Подразделение;
						
					КонецЕсли;
					
				Иначе
					СтрокаТЗ=ТЗ.Добавить();	
					СтрокаТЗ.ВидДвижения = ВидДвиженияНакопления.Расход;
					СтрокаТЗ.СуммаУпр		= Окр(СтрокаТЧ.Всего - СтрокаТЧ.Количество*СтрокаТС.СписанаСтоимость/СтрокаТС.Количество,2);
					СтрокаТЗ.СтатьяЗатрат	= Справочники.СтатьиЗатрат.Конвертация;//ошибки ценообразования
					СтрокаТЗ.Подразделение	= Подразделение;
				КонецЕсли;
				//крохин конец 03.02.2016		
			КонецЕсли;
		КонецЦикла;
		
		//крохин начало 03.02.2016
		//ТЗ.Свернуть("Подразделение,СтатьяЗатрат","СуммаУпр");
		ТЗ.Свернуть("Подразделение,СтатьяЗатрат,ВидДвижения","СуммаУпр");
		//крохин конец 03.02.2016
		
		Для Каждого СтрокаТЗ Из ТЗ Цикл		
			Если СтрокаТЗ.СуммаУпр = 0 Тогда Продолжить КонецЕсли;
			Движение=Движения.Затраты.Добавить();
			
			Движение.Период			= Дата;
			
			//крохин начало 03.02.2016
			//Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;		
			Если Дата >= '20160101' И СтрокаТЗ.ВидДвижения <> Неопределено Тогда
				Движение.ВидДвижения	= СтрокаТЗ.ВидДвижения;	
			Иначе
				Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;	
			КонецЕсли;
			//крохин конец 03.02.2016		
			
			Движение.Подразделение	= СтрокаТЗ.Подразделение;			
			Движение.СтатьяЗатрат	= СтрокаТЗ.СтатьяЗатрат;
			
			Движение.СуммаУпр		= СтрокаТЗ.СуммаУпр;	
			
			Движение.СуммаДокумента	= СтрокаТЗ.СуммаУпр;
			Движение.ВалютаДокумента= ВалютаУпр;
			
			//крохин начало
			Движение.Комментарий        = "возврат поставщику";
			//крохин конец
			
			Движение.ДатаЗаписи		= ТекущаяДата();
		КонецЦикла; 
		//крохин начало 10.04.2012
		//подарки
	ИначеЕсли Подарок Тогда
		ТЗ=Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("Подразделение");
		ТЗ.Колонки.Добавить("СтатьяЗатрат");
		ТЗ.Колонки.Добавить("Субзатрата");
		
		ТЗ.Колонки.Добавить("СуммаУпр",ПолучитьОписаниеТиповЧисла(19,2));		
		Для Каждого СтрокаТЧ Из Товары Цикл	
			СтрокаТС=ТС.Найти(СтрокаТЧ.Номенклатура,"Номенклатура");			
			
			Если СтрокаТС<>Неопределено И СтрокаТС.Количество<>0 Тогда				
				СтрокаТЗ=ТЗ.Добавить();							
				СтрокаТЗ.СуммаУпр		= Окр(СтрокаТЧ.Всего - СтрокаТЧ.Количество*СтрокаТС.СписанаСтоимость/СтрокаТС.Количество,2);
				//крохин начало 07.02.2020
				//изменилась статья затрат
				//СтрокаТЗ.СтатьяЗатрат	= Справочники.СтатьиЗатрат.НайтиПоКоду("320 510");//Продвижение Бренда
				//СтрокаТЗ.Субзатрата     = Справочники.СубЗатраты.НайтиПоКоду("SNL-00045");
				Если Дата >= '20200101' Тогда
					СтрокаТЗ.СтатьяЗатрат	= Справочники.СтатьиЗатрат.НайтиПоКоду("320 570");//Трейд маркетинг
					СтрокаТЗ.Субзатрата     = Справочники.СубЗатраты.НайтиПоКоду("SNL-00063");
				Иначе			
					СтрокаТЗ.СтатьяЗатрат	= Справочники.СтатьиЗатрат.НайтиПоКоду("320 510");//Продвижение Бренда
					СтрокаТЗ.Субзатрата     = Справочники.СубЗатраты.НайтиПоКоду("SNL-00045");
				КонецЕсли;
				//крохин конец 07.02.2020
				СтрокаТЗ.Подразделение	= Подразделение;
				
			КонецЕсли;			
			
		КонецЦикла;
		
		ТЗ.Свернуть("Подразделение,СтатьяЗатрат,СубЗатрата","СуммаУпр");
		Для Каждого СтрокаТЗ Из ТЗ Цикл		
			Если СтрокаТЗ.СуммаУпр = 0 Тогда Продолжить КонецЕсли;
			Движение=Движения.Затраты.Добавить();
			
			Движение.Период			= Дата;
			
			Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;		
			
			Движение.Подразделение	= СтрокаТЗ.Подразделение;			
			Движение.СтатьяЗатрат	= СтрокаТЗ.СтатьяЗатрат;
			Движение.СубЗатрата     = СтрокаТЗ.Субзатрата;
			
			
			Движение.СуммаУпр		= - СтрокаТЗ.СуммаУпр;	
			
			Движение.СуммаДокумента	= - СтрокаТЗ.СуммаУпр;
			Движение.ВалютаДокумента= ВалютаУпр;
			
			//крохин начало
			Движение.Комментарий        = "подарок";
			//крохин конец
			
			Движение.ДатаЗаписи		= ТекущаяДата();
		КонецЦикла; 
		
		
		//крохин конец 10.04.2012
		
	Иначе	
		//услуги
		//Чирков 03.10.12+++
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Номенклатура.Наименование КАК Номенклатура_Наименование,		
		|	Всего
		|ИЗ
		|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
		|ГДЕ
		|	Ссылка = &Ссылка
		|	И Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Услуга)";
		
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		ТекСтатьяЗатрат=Справочники.СтатьиЗатрат.НайтиПоКоду("212 000");
		
		Выборка=Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			//Чирков 03.10.12---
			Движение=Движения.Затраты.Добавить();
			
			Движение.Период			= Дата;
			
			Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;		
			
			Движение.Подразделение	= Подразделение;			
			Движение.СтатьяЗатрат	= ТекСтатьяЗатрат;
			//крохин начало 11.03.2019
			//появились услуги в валюте
			//Движение.СуммаУпр		= Выборка.Всего;	
			//
			//Движение.СуммаДокумента	= Выборка.Всего;
			//Движение.ВалютаДокумента= ВалютаУпр;
			
			Движение.СуммаУпр		= глПересчет(Выборка.Всего, Валюта, Курс, ВалютаУпр, Дата);	
			
			Движение.СуммаДокумента	= Выборка.Всего;
			
			Движение.ВалютаДокумента= Валюта;
			
			//крохин конец 11.03.2019
			
			//крохин начало
			Движение.Комментарий    = Выборка.Номенклатура_Наименование;
			//крохин конец
			
			Движение.ДатаЗаписи		= ТекущаяДата();			
		КонецЦикла;
	Конецесли;	
	
	//крохин начало 22.01.2020
	//при заполнении "суммы скидки" формируются доп. проводки
	Если СуммаСкидкиДС <> 0 Тогда
		Движение=Движения.Затраты.Добавить();
		
		Движение.Период			= Дата;
		
		Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;		
		
		Движение.Подразделение	= Подразделение;			
		Движение.СтатьяЗатрат	= Справочники.СтатьиЗатрат.НайтиПоКоду("320 570"); //Трейд-маркетинг
		
		Движение.СуммаУпр		= глПересчет(СуммаСкидкиДС, Валюта, Курс, ВалютаУпр, Дата);	
		
		Движение.СуммаДокумента	= СуммаДокумента;
		
		Движение.ВалютаДокумента= Валюта;
		
		Движение.Комментарий    = "скидка по ДС";
		
		Движение.ДатаЗаписи		= ТекущаяДата();
	КонецЕсли;		
	//крохин конец 22.01.2020
	
	
	Если ОбменДанными.Загрузка Тогда
		Движения.Затраты.Записать();	
	КонецЕсли;	
КонецПроцедуры
//крохин конец

// +++ 2011-11-21 сезонные бонусы
Функция РасчетСезонногоБонусаРазрешен(ФлагСообщатьОПричинахЗапрета = Ложь) Экспорт
	
	МассивСообщений	= Новый Массив;
	Результат		= Истина;
	
	ТипУзла = ПараметрыСеанса.ТипУзла;	
	Если ТипУзла <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		// Цены расчитываются только в офисных базах !!!
		МассивСообщений.Добавить("Недопустимый тип узла текущей ИБ: " + ТипУзла + ".");
		Результат = Ложь;
	КонецЕсли;
	
	МассивДопустимыхСостояний = Новый Массив;
	МассивДопустимыхСостояний.Добавить(Перечисления.СостоянияНакладной.ВРаботе);
	МассивДопустимыхСостояний.Добавить(Перечисления.СостоянияНакладной.КОтправкеНаСклад);
	Если МассивДопустимыхСостояний.Найти(СостояниеНакладной) = Неопределено Тогда 
		МассивСообщений.Добавить("Недопустимое состояние накладной: " + СостояниеНакладной + ".");
		Результат = Ложь;
	КонецЕсли;
	
	//Если КодОперации <> Перечисления.КодыОперацийОстатки.Реализация Тогда
	//	МассивСообщений.Добавить("Недопустимый код операции: " + КодОперации + ".");
	//	Результат = Ложь;
	//КонецЕсли;		
	
	Если НЕ Результат И ФлагСообщатьОПричинахЗапрета Тогда
		Сообщить("Расчет бонусов для " + ЭтотОбъект + " запрещён:", СтатусСообщения.Важное);
		Для Каждого Сообщение Из МассивСообщений Цикл
			Сообщить(" - " + Сообщение);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

Процедура РассчитатьСезонныйБонус() Экспорт
	
	Если Товары.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// проверим есть ли в таб.части Товары ненулевые суммы в колонке "ВсегоБезБонуса"
	ЗаполненоВсегоБезБонуса = Ложь;
	Для Каждого СтрокаТЧ Из Товары Цикл
		Если СтрокаТЧ.ВсегоБезБонуса <> 0 Тогда
			ЗаполненоВсегоБезБонуса = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	Если НЕ ЗаполненоВсегоБезБонуса Тогда
		// это старый документ, у которого в таб.части Товары не заполнена колонка "ВсегоБезБонуса"
		СообщитьОбОшибке("В табличной части ""Товары"" не заполнены значения в колонке ""ВсегоБезБонуса"".");
		Возврат;		
	КонецЕсли;		
	
	Если НЕ РасчетСезонногоБонусаРазрешен() Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоОтменаНачисления = (НЕ СезонныйБонус); // если СезонныйБонус = Ложь, то нужно сделать "отмену начисления ранее начисленного бонуса"
	
	ДоговорСезонногоБонуса = ПолучитьДоговорСезонногоБонуса(Контрагент);
	
	Если СезонныйБонус И (ДоговорСезонногоБонуса = Неопределено) Тогда
		СообщитьОбОшибке("Для контрагента """ + Контрагент + """ не найден договор с видом """ + Справочники.ВидыДоговоров.СезонныйБонус + """!");
		ЭтоОтменаНачисления = Истина;
	КонецЕсли;
	
	ДопустимыйКодОперации = Перечисления.КодыОперацийОстатки.Реализация;
	Если СезонныйБонус И (КодОперации <> ДопустимыйКодОперации) Тогда
		СообщитьОбОшибке("Расчет сезонного бонуса возможен только для накладных с кодом операции """ + ДопустимыйКодОперации + """!");
		ЭтоОтменаНачисления = Истина;
	КонецЕсли;
	
	Если ЭтоОтменаНачисления Тогда
		// отменяем начисление сезонного бонуса
		Для Каждого СтрокаТЧ Из Товары Цикл
			Если СтрокаТЧ.ВсегоБезБонуса = 0 Тогда
				// видимо это строка старого документа, в котором не установлено значение ВсегоБезБонуса
				Продолжить;
			КонецЕсли;
			Если СтрокаТЧ.Всего <> СтрокаТЧ.ВсегоБезБонуса Тогда
				СтрокаТЧ.Всего = СтрокаТЧ.ВсегоБезБонуса;
				РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект, "ОтВсего");
			КонецЕсли;
		КонецЦикла;
		// всё сделано ==> выходим
		Возврат;
	КонецЕсли;
	
	ОстатокБонуса	= 0;
	ИтогоБезБонуса	= Товары.Итог("ВсегоБезБонуса");
	
	// получим остаток на бонусном договоре
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВзаиморасчетыОстатки.Договор,
	|	-ВзаиморасчетыОстатки.СуммаВалОстаток КАК ОстатокБонуса
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.Остатки(, Договор = &Договор) КАК ВзаиморасчетыОстатки";
	Запрос.УстановитьПараметр("Договор", ДоговорСезонногоБонуса);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка			= РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ВалютаБонуса	= ПолучитьВалютуРасчетов(ДоговорСезонногоБонуса);
		ОстатокБонуса	= ОстатокБонуса + ?(ВалютаБонуса = Валюта, Выборка.ОстатокБонуса, глПересчет(Выборка.ОстатокБонуса, ВалютаБонуса, Дата, Валюта, Курс));
	КонецЕсли;
	
	// добавим движения текущего документа по бонусному договору
	Если Проведен Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(Взаиморасчеты.СуммаВал * ВЫБОР
		|			КОГДА Взаиморасчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА 1
		|			ИНАЧЕ -1
		|		КОНЕЦ) КАК СуммаДвиженийТекДок
		|ИЗ
		|	РегистрНакопления.Взаиморасчеты КАК Взаиморасчеты
		|ГДЕ
		|	Взаиморасчеты.Регистратор = &Регистратор
		|	И Взаиморасчеты.Активность
		|	И Взаиморасчеты.Договор = &Договор";
		Запрос.УстановитьПараметр("Регистратор", Ссылка);
		Запрос.УстановитьПараметр("Договор", ДоговорСезонногоБонуса);
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка			= РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			ОстатокБонуса	= ОстатокБонуса + Выборка.СуммаДвиженийТекДок;
		КонецЕсли;
	КонецЕсли;	
	
	МаксБонусПоНакл	= Окр(ИтогоБезБонуса * ДоговорСезонногоБонуса.ПроцентСкидкиСБ / 100, 2);
	РазмерБонуса	= Мин(ОстатокБонуса, МаксБонусПоНакл);
	Если РазмерБонуса < 0 Тогда
		РазмерБонуса = 0;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из Товары Цикл
		СтрокаТЧ.Всего = СтрокаТЧ.ВсегоБезБонуса - Окр(РазмерБонуса * (СтрокаТЧ.ВсегоБезБонуса / ИтогоБезБонуса), 2);
		РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект, "ОтВсего");
	КонецЦикла;
	ОшибкаОкругления = ИтогоБезБонуса - Товары.Итог("Всего") - РазмерБонуса;
	Если ОшибкаОкругления <> 0 Тогда
		// накопленные ошибки округления бросаем на строку с кол-вом = 1 (а если такой нет, то на 1-ую строку)
		СтрокаТЧ = Товары.Найти(1, "Количество");
		Если СтрокаТЧ = Неопределено Тогда
			СтрокаТЧ = Товары[0];
		КонецЕсли;
		СтрокаТЧ.Всего = СтрокаТЧ.Всего + ОшибкаОкругления;
		РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект, "ОтВсего");
	КонецЕсли;
	
КонецПроцедуры

//Кухарь 04.04.16 начало
//Удалим сф
Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	// Кухарь А.Ю.  16.06.2022 начало	
	если не ОбменДанными.Загрузка тогда
		если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.Склад тогда
			если не ПолучитьПолномочиеПользователя("РаспроводитьНакладные") тогда
				СообщитьИзМодуля("Недостаточно прав для распроведения РНК");
				отказ=Истина;
			КонецЕсли;
		КонецЕсли;
		// Кухарь А.Ю.  01.08.2024 начало
		//
		Запрос=новый запрос;
		запрос.Текст=   "ВЫБРАТЬ
		|	ХранилищеКодовМаркировки.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ХранилищеКодовМаркировки КАК ХранилищеКодовМаркировки
		|ГДЕ
		|	ХранилищеКодовМаркировки.Проведен
		|	И ХранилищеКодовМаркировки.ПланФакт = &ПланФакт
		|	И ХранилищеКодовМаркировки.ДокОснование = &Ссылка";
		запрос.УстановитьПараметр("ПланФакт",Перечисления.ПланФакт.Факт);
		запрос.УстановитьПараметр("Ссылка",Ссылка);
		если запрос.Выполнить().Выбрать().Количество()>0 тогда
			Документы.ХранилищеКодовМаркировки.Отменить_ХКМ_к_НАК(Ссылка,Перечисления.ПланФакт.Факт);
		КонецЕсли;
		// Кухарь А.Ю.  01.08.2024 конец
		
		
	КонецЕсли;
	// Кухарь А.Ю.  16.06.2022 конец
	
	// пометим УПД на удаление. 
	// Нечаева 10,06,24+++	
	запросУПД=новый Запрос;
	запросУПД.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УПД.Ссылка КАК УПД
	|ИЗ
	|	Документ.УПД КАК УПД
	|ГДЕ
	|	УПД.Ссылка.Проведен
	|	И УПД.ДокОснование = &Накладная";
	запросУПД.УстановитьПараметр("Накладная",ЭтотОбъект.Ссылка);
	результатУПД=запросУПД.Выполнить().Выбрать();
	Пока результатУПД.Следующий() цикл
		УПД=результатУПД.УПД.получитьобъект();
		УПД.Проведен=ложь;
		УПД.ПометкаУдаления=Истина;
		Попытка
			УПД.записать();
		Исключение
		КонецПопытки;
		#Если Клиент тогда
			Сообщить("УПД: "+УПД.номер+" помечена на удаление");
		#КонецЕсли
	КонецЦикла;
	// Нечаева 10,06,24---	
	
	
	
	//Кухарь 20.04.18 начало
	//Удалять будем в любых состояниях
	//если СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке или СостояниеНакладной=Перечисления.СостоянияНакладной.ОтгруженаНаТранзитныйСклад
	//	или СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена тогда  
	//Кухарь 20.04.18 начало	
	запросСФ=новый Запрос;
	запросСФ.Текст="ВЫБРАТЬ различные
	|	СчетФактураНакладные.Ссылка КАК СФ
	|ИЗ
	|	Документ.СчетФактура.Накладные КАК СчетФактураНакладные
	|ГДЕ
	|	СчетФактураНакладные.Ссылка.Проведен
	|	И СчетФактураНакладные.Накладная = &Накладная";
	запросСФ.УстановитьПараметр("Накладная",ЭтотОбъект.Ссылка);
	результатСФ=запросСФ.Выполнить().Выбрать();
	Пока результатСФ.Следующий() цикл
		СФ=результатСФ.сф.получитьобъект();
		//сф=документы.СчетФактура.НайтиПоНомеру().ПолучитьОбъект();
		сф.Проведен=ложь;
		сф.ПометкаУдаления=Истина;
		Попытка
			сф.записать();
		Исключение
		КонецПопытки;
		#Если Клиент тогда
			Сообщить("Счёт-фактура: "+сф.номер+" помечена на удаление");
		#КонецЕсли
	КонецЦикла;
	
	//Кухарь 20.04.18 начало
	//Удалять будем в любых состояниях
	//КонецЕсли; 
	//Кухарь 20.04.18 начало	
	
	//Кухарь 03.12.19 начало
	//Удалим документы ЗНБ, которые делают проводки
	если ОбщегоНазначения_ПИ.ЭтоУзел_ODN_или_OD7() тогда 
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ
		|	ЗаданиеНабора.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаданиеНабора КАК ЗаданиеНабора
		|ГДЕ
		|	ЗаданиеНабора.Проведен
		|	И ЗаданиеНабора.Накладная = &Накладная";
		запрос.УстановитьПараметр("Накладная",ЭтотОбъект.Ссылка);
		результат=запрос.Выполнить().Выбрать();
		пока результат.Следующий() цикл
			ЗНБ=результат.Ссылка.получитьобъект();
			если ложь тогда ЗНБ=Документы.ЗаданиеНабора.ПустаяСсылка().ПолучитьОбъект();КонецЕсли;
			ЗНБ.УстановитьПометкуУдаления(Истина);	
		КонецЦикла;
	КонецЕсли;
	//Кухарь 03.12.19 конец	
	
	
	
	
КонецПроцедуры
//Кухарь 04.04.16 конец


//Кухарь 25.12.19 начало
Процедура ВернутьИзОтгружено ()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ первые 1
	|	ПланНабора.Ссылка
	|ИЗ
	|	Документ.ПланНабора КАК ПланНабора
	
	|ГДЕ
	|	ПланНабора.ДокОснование = &ДокОснование
	|	И ПланНабора.Проведен";
	запрос.УстановитьПараметр("ДокОснование",Ссылка);			
	Выборка = запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Не Ссылка.Пустая() Тогда
		ПланНабора = Выборка.Ссылка.получитьобъект();
		если ложь тогда ПланНабора=документы.ПланНабора.ПустаяСсылка().ПолучитьОбъект();КонецЕсли;
		НужноЗаписывать=ложь;
		Для каждого СтрТЧ из ПланНабора.тБрэндов цикл
			если СтрТЧ.Состояние<>СостояниеНакладной тогда
				НужноЗаписывать=Истина;
				СтрТЧ.Состояние=СостояниеНакладной;
				
			КонецЕсли;
		КонецЦикла;
		если НужноЗаписывать тогда
			
			// Кухарь А.Ю. 24.02.2022 начало
			// ПланНабора.Записать();
			ПланНабора.ЗаписатьБезОбработки(РежимЗаписиДокумента.Запись); 	
			// Кухарь А.Ю. 24.02.2022 конец
			
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаданиеНабора.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаданиеНабора КАК ЗаданиеНабора
	|ГДЕ
	|	ЗаданиеНабора.Проведен
	|	И ЗаданиеНабора.Накладная = &Накладная
	|	И ЗаданиеНабора.Дата >= &Дата";
	запрос.УстановитьПараметр("Накладная",Ссылка);		
	запрос.УстановитьПараметр("Дата",ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования());		
	запрос.УстановитьПараметр("СостояниеНакладной",СостояниеНакладной);
	результат=запрос.Выполнить().Выбрать();
	пока результат.Следующий() цикл
		ЗНБ = результат.Ссылка.получитьобъект();
		если ложь тогда ЗНБ=документы.ЗаданиеНабора.СоздатьДокумент();КонецЕсли;
		// Кухарь А.Ю. 24.04.2020 начало
		// есть краткий момент времени когда у ЗНБ уже проводки по резервам вернулись, 
		//а у РНК проводки по остаткам ещё не убрались.Если дату ЗНБ сделать чуть меньше, то трассировки не будет
		ЗНБ.дата=Дата-1;	 
		// Кухарь А.Ю. 24.04.2020 конец    		
		ЗНБ.СостояниеНакладной=СостояниеНакладной;
		// Кухарь А.Ю. 03.06.2021 начало
		// ЗНБ.записать(РежимЗаписиДокумента.Проведение);
		ЗНБ.ЗаписатьЗНББезКонтроляСостояний(РежимЗаписиДокумента.Проведение);		 
		// Кухарь А.Ю. 03.06.2021 конец
		
	КонецЦикла;
	
КонецПроцедуры
//Кухарь 25.12.19 конец


// Кухарь А.Ю. 26.11.2021 начало
// Перенес из формы РНК. Заполнить комплектующие
Процедура ЗаполнитьКомплектующиеРНК () Экспорт
	// Кухарь А.Ю.  05.09.2022 начало
	//Перенёс всё в общий модуль
	ЗаполнениеДокументов.ЗаполнитьТЧКомплектующие(ЭтотОбъект); 
	возврат;
	// Кухарь А.Ю.  05.09.2022 конец
	
	
	Комплектующие.Очистить();
	
	// Кухарь А.Ю.  15.08.2022 начало
	// Номенклатура замены
	Запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НоменклатураКоплектующие.Номенклатура КАК Запчасть,
	|	НоменклатураКоплектующие.Номенклатура.НоменклатураЗамены КАК ЗаменаЗапчасти,
	|	НоменклатураКоплектующие.Ссылка КАК Продукция
	|ИЗ
	|	Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
	|ГДЕ
	|	НоменклатураКоплектующие.Ссылка В(&СписокНоменклатуры)";
	запрос.УстановитьПараметр("СписокНоменклатуры",товары.ВыгрузитьКолонку("Номенклатура"));
	ТаблицаЗамен=запрос.Выполнить().Выгрузить();
	// Кухарь А.Ю.  15.08.2022 конец
	
	
	Для Каждого СтрокаТоваров Из Товары Цикл	
		
		Если СтрокаТоваров.Количество = 0 Тогда 
			Продолжить 
		КонецЕсли; 
		
		Номенклатура = СтрокаТоваров.Номенклатура;
		
		Если Номенклатура.Коплектующие.Количество() > 0 Тогда
			// комплект
			
			// Кухарь А.Ю.  05.09.2022 начало
			// Ассортито заполнялись неправильно
			ОтрузкаКратноКомплекту=Истина;
			ВидКомплекта=ПолучитьРеквизитШапки(СтрокаТоваров.Номенклатура,"родитель.ВидКомплекта","Справочник");
			если ВидКомплекта=Перечисления.ВидыКомплектов.Ассортито тогда
				КоэффициентКратности=Номенклатура.Коплектующие.Итог("Количество"); 
				КоличествоКомплектовАссортито= СтрокаТоваров.Количество/КоэффициентКратности;
				если Цел(КоличествоКомплектовАссортито)<> КоличествоКомплектовАссортито или КоэффициентКратности=0 тогда
					Сообщить("Ассортито "+СтрокаТоваров.Номенклатура+" отгружено не кратно комплекту - " +Строка(КоэффициентКратности));
					ОтрузкаКратноКомплекту=Ложь;
				КонецЕсли;
				
			иначе
				КоэффициентКратности=1;
			КонецЕсли;
			// Кухарь А.Ю.  05.09.2022 конец
			
			Для Каждого СтрокаКомплекта Из Номенклатура.Коплектующие Цикл
				Если СтрокаКомплекта.Количество = 0 Тогда 
					Продолжить 
				КонецЕсли; 
				
				СтрокаТЧ = Комплектующие.Добавить();	
				
				СтрокаТЧ.Продукция		= Номенклатура;
				СтрокаТЧ.Номенклатура	= СтрокаКомплекта.Номенклатура;
				// Кухарь А.Ю.  15.08.2022 начало
				//Номенклатура замены
				СтрокаЗамены=ТаблицаЗамен.Найти(СтрокаТЧ.Номенклатура,"Запчасть");
				если СтрокаЗамены<>Неопределено и ЗначениеЗаполнено(СтрокаЗамены.ЗаменаЗапчасти) тогда
					СтрокаТЧ.Номенклатура	= СтрокаЗамены.ЗаменаЗапчасти;
				КонецЕсли;				
				// Кухарь А.Ю.  15.08.2022 конец
				
				ПриИзмененииНоменклатурыТабЧасти(СтрокаТЧ, ЭтотОбъект);
				
				СтрокаТЧ.Единица		= СтрокаКомплекта.Единица;
				СтрокаТЧ.Коэффициент	= СтрокаКомплекта.Коэффициент;
				
				// Кухарь А.Ю.  05.09.2022 начало
				//Ассортито заполнялось неправильно
				//  				 СтрокаТЧ.Количество		= СтрокаКомплекта.Количество * СтрокаТоваров.Количество * СтрокаТоваров.Коэффициент; // и разделить на СтрокаКомплекта.Коэффициент?			
				если ВидКомплекта=Перечисления.ВидыКомплектов.Ассортито и ОтрузкаКратноКомплекту тогда
					СтрокаТЧ.Количество		=СтрокаКомплекта.Количество*СтрокаТоваров.Количество/КоэффициентКратности;	
				иначе
					СтрокаТЧ.Количество		= СтрокаКомплекта.Количество * СтрокаТоваров.Количество * СтрокаТоваров.Коэффициент; // и разделить на СтрокаКомплекта.Коэффициент?
				КонецЕсли;
				// Кухарь А.Ю.  05.09.2022 конец
				
				//нечаева 06,03,18+++
				РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект);
				//нечаева 06,03,18---
				
			КонецЦикла; 
		Иначе			
			// обычный товар
			СтрокаТЧ = Комплектующие.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаТоваров);
			СтрокаТЧ.Продукция = Номенклатура;
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры
// Кухарь А.Ю. 26.11.2021 конец
// +++ {Кузнецов [23.08.2022]
Процедура ЗаписатьБезОбработки(РежимЗаписи) экспорт
	ПростоЗаписать=Истина;
	НужноВыгружать =Ложь;
	//ОбменДанными.Загрузка=Истина;
	если РежимЗаписи=РежимЗаписиДокумента.Проведение тогда
		Проведен=Истина;
		ПометкаУдаления=Ложь;
	КонецЕсли;
	Записать();
КонецПроцедуры
// }Кузнецов +++ [23.08.2022]

// 2011-11-21 сезонные бонусы +++

// Шворобей ВЮ 28.12.2023 ++
Процедура ПересчитатьТабличнуюЧасть(ТабЧасть) Экспорт
	Для Каждого СтрокаТЧ ИЗ ТабЧасть Цикл
		ПриИзмененииНоменклатурыТабЧасти(СтрокаТЧ, ЭтотОбъект);
		РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект);
	КонецЦикла;
КонецПроцедуры
//Нечаева+++ 26,01,15---


// нечаева 04,03,24++ 
Процедура СформироватьПодтверждениеЗаказа2(ТзЗаказ, Ошибка, Провайдер) экспорт
	
	
	//нечаева 28,10,15+++		
	// берем первый для шапки, а потом общий собираем	
	ДокОбъект = ТЗЗаказ[0].документ.ссылка;     //++++++++++++++++++++++ меняем для сборки в один заказ.
	
	//нечаева 18,05,21+++
	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Кухарь А.Ю. 31.03.2026 начало
	// Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом тогда
	Если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() тогда 
		//Кухарь А.Ю. 31.03.2026 конец
        
		ЗаписатьВЛог("ОшибкиЕкод","Отмена выполнения. подтверждение не создано "+ДокОбъект+" база "+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
		
		ошибка=1;
		
		Возврат ;
	КонецЕсли;
	//  нечаева 18,05,21----
	
	// нечаева 130121 ++
	КаталогЕкода = Константы.КаталогЕКОД.Получить(); //\\SRVECOD\SFERAConnector2\EDI\ 
	// нечаева 130121---
	Если ПустаяСтрока(ДокОбъект.Контрагент.Родитель.КодИЛН) Тогда
		ИЛНПок =  ДокОбъект.Контрагент.КодИЛН;
	Иначе
		ИЛНПок =  ДокОбъект.Контрагент.Родитель.КодИЛН;
	КонецЕсли;
	
	
	ИЛНПост = "4607182079990WS";
	
	// нечаева 19,04,2023+++   единая
	Если ДокОбъект.организация.код = "SS-001" Тогда
		ИЛНПост = "4607182079990EC";
		
		//Нечаева 09,10,19+++
		Если Провайдер = 3 Тогда
			//ИЛНПост = "4607182079990";
			ИЛНПост = "4607182079990WS";
			
		КонецЕсли;
		//Нечаева 09,10,19---
	ИначеЕсли ДокОбъект.организация.код = "SSP-99" Тогда    // бтк
		
		ИЛНПост = "4607196338601WS";
		
	КонецЕсли;
	// нечаева 19,04,2023---
	
	// нечаева 04,03,24++
	КодКонтрагента = ДокОбъект.Контрагент.код;
	// нечаева 04,03,24--
	
	//Нечаева 20,03,17+++
	НомЗ = СтрЗаменить(СокрЛП(ДокОбъект.НомерЗаказа), "/", "_");		
	НомЗ = СтрЗаменить(НомЗ, "\", "_");		
	НомЗ = СтрЗаменить(НомЗ, "-", "_");		
	НомЗ = СтрЗаменить(НомЗ, " ", "_");		
	//Нечаева 20,03,17---
	НомРНК = СтрЗаменить(ДокОбъект.номер, "-", "_");
	//Катаев+ 14/11/14
	Если Провайдер = 0 или Провайдер = 3  Тогда
		Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
			ПутьДляУвед = ПолучитьПутьДляПодтвержедния(КаталогЕкода+ИЛНПост+"\"+ИЛНПок+"\OUT\");
			//Нечаева 15,03,18+++
			// Для Хорошего дня - магнолия
			Если ПутьДляУвед = Неопределено и (ИЛНПок = "9777992536626" или ДокОбъект.Контрагент.Родитель.код = "SMN-7541") ТОгда
				//   9777992579999 - корневой для Магнолии
				ПутьДляУвед = ПолучитьПутьДляПодтвержедния(КаталогЕкода+ИЛНПост+"\9777992579999\OUT\");
				
			КонецЕсли;		   
			//Нечаева 15,03,18---
			
			//Нечаева 01,11,2021+++
			// Для Еврологистик ТС Лама
			Если ПутьДляУвед = Неопределено и (ИЛНПок = "4620020788939" или ДокОбъект.Контрагент.Родитель.код = "SSR-6974") ТОгда
				//   9777992579999 - корневой для Магнолии
				ПутьДляУвед = ПолучитьПутьДляПодтвержедния(КаталогЕкода+ИЛНПост+"\4620020789998\OUT\");
				
			КонецЕсли;		   
			//Нечаева 101,11,2021---
			
			// 4680021979996 шагдарова ТС Абсолют			
			Если ПутьДляУвед = Неопределено и (ИЛНПок = "4680021979989" или КодКонтрагента = "SSR-9771") ТОгда
				
				ПутьДляУвед = ПолучитьПутьДляПодтвержедния(КаталогЕкода+ИЛНПост+"\4680021979996\OUT\");
				
			КонецЕсли;		   
			//Нечаева 25,10,23 ---
			
			
			Если ПутьДляУвед = Неопределено ТОгда
				Если КодКонтрагента <> "SSP-4991" Тогда
					#Если клиент Тогда
						Сообщить( Строка(ДокОбъект)+" - не удалось определить путь для сохранения файла подтверждения");
					#КонецЕсли
				конецЕсли;
				ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - не удалось определить путь для сохранения файла подтверждения","Важное");
				Ошибка = 1;
				Возврат;
			КонецЕсли;
			
			
			ИмяФайлаОбмена = ПутьДляУвед+"\Пз_"+СокрЛП(ДокОбъект.Номер)+".xml";
		Иначе
			Если ДокОбъект.Склад.КодФизическогоУзла <> ПланыОбмена.Основной.ЭтотУзел().Код Тогда
				Ошибка = 1;
				Возврат;
			КонецЕсли;
			
			Если докОбъект.контрагент.родитель.код = "SSR-4144" Тогда
				ИЛНПок="9777992579999";
			КонецЕсли;
			
			
			ИмяФайлаОбменаФТП = "Пз_"+СокрЛП(НомЗ)+"_"+номРНК+".xml";
			УзелЦО = ПланыОбмена.Основной.НайтиПоКоду("SNL");
			
			
			//нечаева 13,12,18+++
			//КаталогFTP = ПолучитьПутьДляПодтвержедния("\\srvecode\EdiConnector2\ediECOD\"+ИЛНПост+"\"+ИЛНПок+"\OUT\");
			//для филиала нечаева 170122 +++
			КаталогFTP = ПолучитьПутьДляПодтвержедния(КаталогЕкодаФТП+ИЛНПост+"\"+ИЛНПок+"\OUT\");
			//нечаева 170222 ---
			//нечаева 13,12,18+++
			
			Если КаталогFTP = Неопределено ТОгда
				ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - не удалось определить путь для сохранения файла подтверждения","Важное");
				Ошибка = 1;
				Возврат;
			КонецЕсли;
			
			////05,12,16---
			ИмяФайлаОбмена = КаталогFTP+"\Пз_"+СокрЛП(ДокОбъект.НомерЗаказа)+".xml";
			//нечаева 12,09,17--
			
		КонецЕсли;
	Иначе //Для СКБ-Контур
		Если ПланыОбмена.Основной.ЭтотУзел() <> ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
			Если ДокОбъект.Склад.КодФизическогоУзла <> ПланыОбмена.Основной.ЭтотУзел().Код Тогда
				Ошибка = 1;
				Возврат;
			КонецЕсли;
		КонецЕсли;
		КаталогFTP="Outbox";
		// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
		//ПользовательFTP="*%*%*%";
		//ПарольFTP="*$*$*$";
		ПользовательFTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКFTPКонтур).Логин;
		ПарольFTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКFTPКонтур).Пароль;
		// Ихсанов Д. А. Конец  14.10.2025
		АдресFTP = "ftp-edi.kontur.ru";
		Соединение=УстановитьFTPСоединение(АдресFTP,ПользовательFTP,ПарольFTP,,Истина);
		Если Соединение=Неопределено Тогда
			Сообщить("Невозможно установить соединение с ftp");
			Ошибка = 1;
			Возврат;
		КонецЕсли;
		Соединение.УстановитьТекущийКаталог(КаталогFTP);
		//ИмяФайлаОбменаФТП = "Пз_"+ДокОбъект.НомерЗаказа+".xml";
		
		//Нечаева 20,03,17+++
		НомЗ = СтрЗаменить(СокрЛП(ДокОбъект.НомерЗаказа), "/", "");
		ИмяФайлаОбменаФТП = "Пз_"+НомЗ+".xml";
		//ИмяФайлаОбмена = "C:\TempSKB\"+"Пз_"+НомЗ+"_.xml";
		ИмяФайлаОбмена = КаталогВременныхФайлов()+"Пз_"+НомЗ+"_.xml";
		//Нечаева 20,03,17+++
		
	КонецЕсли;
	//Катаев- 14/11/14
	//Нечаева 20,03,17+++                       //нечаева 03,10,17+++
	ВремФайл = КаталогВременныхФайлов()+"Пз_"+СокрЛП(НомЗ)+".xml";
	//Нечаева 20,03,17---                       //нечаева 03,10,17---
	
	
	ЗаписьХМЛ=Новый ЗаписьXML;
	ЗаписьХМЛ.ОткрытьФайл(ВремФайл);
	ДокументДом=Новый ДокументDom("","Document-OrderResponse");
	КорневойЭлемент=ДокументДом.ЭлементДокумента;
	//----------------------------------------------------------------
	ЭлементДом=ДокументДом.СоздатьЭлемент("OrderResponse-Header");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	//----------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("OrderResponseNumber");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	//Катаев+ 19/12/14
	//текстДом=ДокументДом.СоздатьТекстовыйУзел("Пз_"+ДокОбъект.НомерЗаказа);
	текстДом=ДокументДом.СоздатьТекстовыйУзел("Пз_"+ДокОбъект.НомерЗаказа);     // нечаева 21,01,15
	//Катаев- 19/12/14
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	//----------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("OrderResponseDate");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	ДатаДок=Формат(ДокОбъект.Дата, "ДФ=""гггг-ММ-дд""");
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаДок));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	
	
	//----------------------------------------------------------------
	//нечаева 08,07,19+++
	Элемент2=ДокументДом.СоздатьЭлемент("OrderResponseTime");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	
	ВремяДок2=Формат(ТекущаяДата(), "ДФ=""ЧЧ:мм""");
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ВремяДок2));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	//нечаева 08,07,19--
	//----------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("ExpectedDeliveryDate");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	Если ДокОбъект.ДатаПриемки = Дата(1,1,1) Тогда
		ДатаДок2=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""гггг-ММ-дд""");
	Иначе
		ДатаДок2=Формат(ДокОбъект.ДатаПриемки, "ДФ=""гггг-ММ-дд""");
	КонецЕсли;
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаДок2));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	//----------------------------------------------------------------
	
	// 21,01,15 +++  нечаева добавила отработку пустого времени
	ВремяДок22="";
	//Кухарь 10.02.16 начало	
	//Сначала будет проверятся нет ли времени доставки на конкретно эту накладную
	//Если ДокОбъект.ПунктДоставки.ВремяДоставки = Неопределено Тогда
	ВремяДоставки=ПолучитьВремяПриемки(ДокОбъект.ссылка);
	если ВремяДоставки=Справочники.ВремяПриемки.ПустаяСсылка() или ВремяДоставки=Неопределено тогда
		ВремяДоставки		=ДокОбъект.ПунктДоставки.ВремяДоставки;
	КонецЕсли;		
	Если ВремяДоставки = Справочники.ВремяПриемки.ПустаяСсылка() Тогда 
		//Кухарь 10.02.16 конец	
		ВремяДок22=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""ЧЧ:мм""");
	Иначе
		//Кухарь 10.02.16 начало
		//Время доставки может быть не из пункта доставки
		//ВремяДок22=Формат(ДокОбъект.ПунктДоставки.ВремяДоставки.КонецПериода1, "ДФ=""ЧЧ:мм""");
		ВремяДок22=Формат(ВремяДоставки.КонецПериода1, "ДФ=""ЧЧ:мм""");
		//Кухарь 10.02.16 конец
	КонецЕсли;
	//Если ВремяДок2="" Тогда 
	//	ВремяДок2 = "00:00";
	//конецЕсли;
	
	Если КодКонтрагента = "SSP-1973" Тогда
		Если СокрЛП(ВремяДок22)="" Тогда 
			//	ВремяДок2 = "00:00";
			ВремяДок22=Формат(ТекущаяДата(), "ДФ=""ЧЧ:мм""");
		конецЕсли;
	иначе
		Если СокрЛП(ВремяДок22)="" Тогда 
			ВремяДок22 = "00:00";
		конецЕсли;
	конецЕсли;
	// бигбокс не берем
	Если Не КодКонтрагента = "SSR-6841" Тогда
		
		Элемент2=ДокументДом.СоздатьЭлемент("ExpectedDeliveryTime");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ВремяДок22));
		ТекУзел2.ДобавитьДочерний(ТекстДом);
		
	КонецЕсли;
	
	
	
	//----------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("OrderNumber");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(СокрЛП(ДокОбъект.НомерЗаказа));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("OrderDate");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	ДатаДок=Формат(ДокОбъект.ДатаЗаказа, "ДФ=""гггг-ММ-дд""");
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаДок));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("ResponseType");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	тз = ДокОбъект.Товары.Выгрузить();
	СтатусДок = "29";
	Для Каждого стр из тз Цикл
		Если стр.Заявка <> стр.Количество Тогда
			СтатусДок = "4";
			Прервать;
		КонецЕсли;
	КонецЦикла;
	текстДом=ДокументДом.СоздатьТекстовыйУзел(СтатусДок);
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	//нечаева 23,01,15 +++ добавила строки 
	//------------------------------------------------------------
	если КодКонтрагента = "CHF-0006" Тогда
		Элемент2=ДокументДом.СоздатьЭлемент("Remarks");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(строка("Звк"));
		ТекУзел2.ДобавитьДочерний(ТекстДом);
	КонецЕсли;
	
	
	// нечаева 12,04,18+++
	// для Х5 в комментарий нужно писать причину недопоставки.
	Если контрагент.родитель.код = "SSR-4117" Тогда
		
		ПрНедопоставки=ПрочитатьЗначениеРеквизитаПНКПРМРНК("ПричинаНедопоставки",ЭтотОбъект.Ссылка);
		попытка
			Если ПрНедопоставки<>"" и ПрНедопоставки<>Неопределено Тогда
				// нам нужна только часть с кодом. 
				//нечаева 30,01,19+++
				Пр2 = Найти(ПрНедопоставки," ");
				Пр_н  = СокрЛП(Лев(ПрНедопоставки,Пр2));
				//нечаева 30,01,19---
				
				Элемент2=ДокументДом.СоздатьЭлемент("Remarks");
				ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(Пр_Н));
				ТекУзел2.ДобавитьДочерний(ТекстДом);
			КонецЕсли;
		исключение
		конецПопытки;
	КонецЕсли;
	
	//-------------------Заполнение ГЛН-------------------------------
	ЭлементДом=ДокументДом.СоздатьЭлемент("OrderResponse-Parties");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	//----------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("Buyer");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	КодИЛН=ДокОбъект.Контрагент.КодИЛН;
	
	
	// для Ашана
	//нечаева 08,07,19+++	
	Если КодКонтрагента = "SSP-2450" ТОгда
		ПоискНомера=новый Запрос;
		ПоискНомера.Текст="ВЫБРАТЬ
		|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита КАК приемка
		|ИЗ
		|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
		|ГДЕ
		|	РеквизитыРНКПНКПРМ.Документ = &Документ
		|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = &ИмяРеквизита";
		ПоискНомера.УстановитьПараметр("Документ", ЭтотОбъект.ссылка);
		ПоискНомера.УстановитьПараметр("ИмяРеквизита","GLNпокупателя");
		СписокНомеров=ПоискНомера.Выполнить().Выбрать();
		
		Пока СписокНомеров.Следующий() Цикл
			
			КодИЛН= ""+СписокНомеров.приемка;
			
		КонецЦикла;
	КонецЕсли;
	//нечаева 08,07,19 +---	
	
	
	
	
	Элемент3=ДокументДом.СоздатьЭлемент("ILN");
	ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(КодИЛН));
	ТекУзел3.ДобавитьДочерний(ТекстДом);
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("Seller");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	Элемент3=ДокументДом.СоздатьЭлемент("ILN");
	ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(Лев(ИЛНПост,13));
	ТекУзел3.ДобавитьДочерний(ТекстДом);
	
	//нечаева 08,07,19+++	
	Если КодКонтрагента = "SSP-2450" ТОгда
		Элемент3=ДокументДом.СоздатьЭлемент("CodeByBuyer");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(""+Строка(ДокОбъект.КодПоставщика)+"005"));
		ТекУзел3.ДобавитьДочерний(ТекстДом);
	КонецЕсли;
	//нечаева 08,07,19---
	
	
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("DeliveryPoint");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	Элемент3=ДокументДом.СоздатьЭлемент("ILN");
	ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
	КодИЛН=ДокОбъект.ПунктДоставки.КодИЛН;
	текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(КодИЛН));
	ТекУзел3.ДобавитьДочерний(ТекстДом);
	//-----------------Заполнение товара------------------------------
	ЭлементДом=ДокументДом.СоздатьЭлемент("OrderResponse-Lines");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	
	
	//нечаева 28,10,15+++
	//28,10,15++++
	// теперь ТЗ - список из документов из таблицы значений
	ЗапросТЗ = Новый Запрос;
	ЗапросТЗ.Текст = "ВЫБРАТЬ
	|	РасходнаяНакладнаяТовары.Ссылка,
	|	РасходнаяНакладнаяТовары.НомерСтроки,
	|	РасходнаяНакладнаяТовары.Номенклатура,
	|	РасходнаяНакладнаяТовары.Количество,
	|	РасходнаяНакладнаяТовары.Единица,
	|	РасходнаяНакладнаяТовары.Коэффициент,
	|	РасходнаяНакладнаяТовары.ЦенаБезСкидки,
	|	РасходнаяНакладнаяТовары.Цена,
	|	РасходнаяНакладнаяТовары.Сумма,
	|	РасходнаяНакладнаяТовары.Объем,
	|	РасходнаяНакладнаяТовары.СтавкаНДС,
	|	РасходнаяНакладнаяТовары.НДС,
	|	РасходнаяНакладнаяТовары.Всего,
	|	РасходнаяНакладнаяТовары.ВсегоБезСкидки,
	|	РасходнаяНакладнаяТовары.Скидка,
	|	РасходнаяНакладнаяТовары.ПодтвержденнаяЗаявка,
	|	РасходнаяНакладнаяТовары.Заявка,
	|	РасходнаяНакладнаяТовары.ТипЦен,
	|	РасходнаяНакладнаяТовары.ЦенаПосредника,
	|	РасходнаяНакладнаяТовары.ЦенаБезБонуса,
	|	РасходнаяНакладнаяТовары.ВсегоБезБонуса
	|ИЗ
	|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	|ГДЕ
	|	РасходнаяНакладнаяТовары.Ссылка В ИЕРАРХИИ(&ТЗЗаказы)";
	//ТЗЗаказ = Новый ТаблицаЗначений;				 
	СписокЗаказов = ТЗЗаказ.ВыгрузитьКолонку("Документ");				 
	ЗапросТЗ.УстановитьПараметр("ТЗЗаказы",СписокЗаказов);
	ТЗ = ЗапросТЗ.Выполнить().Выгрузить();
	
	//было 
	//тз = ДокОбъект.Товары.Выгрузить();
	//нечаева 28,10,15---
	
	
	
	//Нечаева 05,04,18 +++
	//для экспозиторов по Тандеру
	запрос=новый Запрос;
	запрос.Текст="ВЫБРАТЬ
	|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита как Экспозитор
	|ИЗ
	|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
	|ГДЕ
	|	РеквизитыРНКПНКПРМ.Документ = &Документ
	|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = ""Экспозитор"""; 
	запрос.УстановитьПараметр("Документ",ДокОбъект.ссылка);
	результат=запрос.Выполнить().Выбрать();
	если результат.Количество()>0 тогда
		Результат.Следующий();
		ТЗЭксп = ПолучитьТаблицуНакладнойТандерЭкспозиторы("СФ",ссылка,Результат.Экспозитор);
		СтрЭксп = ТЗЭксп[0];
		ТЗ.Очистить();
		// заполним по экспозитору их.
		НСтр = ТЗ.Добавить();
		Нстр.Ссылка= Ссылка;
		
		Нстр.НомерСтроки = 1;
		Нстр.Номенклатура = Результат.Экспозитор;
		НСтр.количество = СтрЭксп.количество;
		НСтр.Заявка = СтрЭксп.количество;
		НСтр.ПодтвержденнаяЗаявка = СтрЭксп.количество;
		НСтр.Единица = СтрЭксп.Единица; 
		НСтр.Коэффициент = 1;
		НСтр.Цена = Окр(СтрЭксп.Цена,2);
		НСтр.ЦенаБезСкидки = Окр(СтрЭксп.Цена,2);
		НСтр.Сумма = Окр(СтрЭксп.Сумма,2);
		//	НСтр.Объем = СтрЭксп.Объем;
		НСтр.ставкаНДС =ПолучитьРеквизитРодителя(НСтр.Номенклатура,"СтавкаНДС");
		НСтр.НДС = Окр(СтрЭксп.НДС,2);
		НСтр.ВсегоБезСкидки = Окр(СтрЭксп.Всего,2);
		НСтр.Всего =  Окр(СтрЭксп.Всего,2);
		НСтр.Скидка = 0;
		
		
	КонецЕсли;	
	
	//Нечаева 05,04,18 ---
	
	
	тз.Колонки.Добавить("ШККонтрагента");
	тз.Колонки.Добавить("АртикулКонтрагента");
	тз.Колонки.Добавить("НаименованиеКонтрагента");
	тз.Колонки.Добавить("Кратность");
	тз.Колонки.Добавить("КратностьКоробки");
	
	
	
	//-----------------------------------------------------------------------------------------------------------------------------
	
	//нечаева 26,04,18+++ 	
	тз1 = ПолучитьАртикулыМатрицы(ДокОбъект);
	//нечаева 26,04,18---
	
	Для Каждого ТекСтрока Из тз Цикл
		Если ТекСтрока.Количество=0 И КодКонтрагента <> "SSP-1973"
			//нечаева 10,12,20+++
			и КодКонтрагента <> "SSR-3546"
			//нечаева 10,12,20---
			Тогда
			Продолжить;
		КонецЕсли; 
		ШКПоМатрице=НЕопределено;
		АртикулПоМатрице=НЕопределено;
		//НайденнаяСтрока = тз1.Найти(ТекСтрока.Номенклатура,"Номенклатура");
		//нечаева 25,10,23 +++
		попытка
			НайденнаяСтрока = тз1.Найти(ТекСтрока.Номенклатура,"Номенклатура");
		исключение
			НайденнаяСтрока = неопределено;
		конецПопытки;
		//нечаева 25,10,23 ---
		Если НайденнаяСтрока <> Неопределено ТОгда
			Если ПустаяСтрока(НайденнаяСтрока.ШККонтрагентаБлочок) Тогда
				ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагента;
			Иначе
				ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагентаБлочок;
			КонецЕсли;
			
			//270520 нечаева ++  окей шк штуки всегда
			Если КодКонтрагента = "SSP-5862" Тогда
				ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагента;
			КонецЕсли;
			
			
			//для тандера нечаева 10,07,17 +++
			Если НЕ ПустаяСтрока(НайденнаяСтрока.ШКСпайки) Тогда
				ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШКСпайки;
			КонецЕсли;
			//нечаева 10,07,17 ---
			
			ТекСтрока.АртикулКонтрагента = НайденнаяСтрока.АртикулКонтрагента;
			ТекСтрока.НаименованиеКонтрагента = НайденнаяСтрока.НаименованиеКонтрагента;
			ТекСтрока.Кратность = Число(НайденнаяСтрока.Кратность);
			ТекСтрока.КратностьКоробки = Число(НайденнаяСтрока.КратностьКоробки);
			
			// для молнии поставим отдельную проверку!!
			Если НЕ ОбменДанными.Загрузка Тогда	
				Если СокрЛП(ТекСтрока.АртикулКонтрагента) = "" и  КодКонтрагента = "CHF-0006" Тогда
					Сообщить("В номенклатурной матрице"+ НайденнаяСтрока.Ссылка+" не найден артикул номенклатуры - "+ТекСтрока.Номенклатура,СтатусСообщения.Важное);
					Ошибка = 1;
				КонецЕсли;
			конецесли;
		Иначе
			//Сообщить("В номенклатурной матрице не найдена номенклатура "+ТекСтрока.Номенклатура);
			//нечаева 26,02,15 ++
			Если НЕ ОбменДанными.Загрузка Тогда	
				Сообщить("В номенклатурной матрице не найдена номенклатура "+ТекСтрока.Номенклатура);
			конецесли ;
			//нечаева 26,02,15 ++
			
			Ошибка = 1;
		КонецЕсли;
	КонецЦикла;
	Если Ошибка = 1 Тогда
		//Нечаева 18,03,15+++ 
		Если НЕ ОбменДанными.Загрузка Тогда	
			сообщить("Документ Подтверждение заказа не выгружен на сайт, поправьте матрицу!!!");
		конецесли ;
		//Нечаева 18,03,15 ---
		Возврат;
	КонецЕсли;
	//-----------------------------------------------------------------------------------------------------------------------------
	//Нечаева 18,03,15 ---
	РР=1;
	
	//Нечаева 10,07,17 +++ для тандера сворачиваем по спайкам, 
	
	ТЗАртикулы = новый ТаблицаЗначений;
	Если КодКонтрагента = "SSP-3881" Тогда
		
		
		ТЗАртикулы = ТЗ.скопировать();
		ТЗАртикулы.свернуть("ШККонтрагента,АртикулКонтрагента,Цена,СтавкаНДС,НаименованиеКонтрагента,Кратность,КратностьКоробки","заявка,количество,Всего,Сумма,НДС");
		ТЗАртикулы.колонки.добавить("Номенклатура");  //??? нужно ли 
		
		
		Для Каждого ТекСтрока Из тзАртикулы Цикл
			
			ШКПоМатрице=НЕопределено;
			АртикулПоМатрице=НЕопределено;
			НайденнаяСтрока = тз1.Найти(ТекСтрока.АртикулКонтрагента,"АртикулКонтрагента");
			Если НайденнаяСтрока <> Неопределено ТОгда
				//Если ПустаяСтрока(НайденнаяСтрока.ШККонтрагентаБлочок) Тогда
				//	ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагента;
				//Иначе
				//	ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагентаБлочок;
				//КонецЕсли;
				//	ТекСтрока.АртикулКонтрагента = НайденнаяСтрока.АртикулКонтрагента;
				//	ТекСтрока.НаименованиеКонтрагента = НайденнаяСтрока.НаименованиеКонтрагента;
				ТекСтрока.Кратность = Число(НайденнаяСтрока.Кратность);
				ТекСтрока.КратностьКоробки = Число(НайденнаяСтрока.КратностьКоробки);
				ТекСтрока.Номенклатура = НайденнаяСтрока.Номенклатура;
			Иначе
				
			КонецЕсли;
			
		КонецЦикла;
		
		
		
	КонецЕсли;
	
	
	
	//Для Х5 сворачиваем по спайкам - артикулам, шк берем из спаек
	//Нечаева 14,08,18 +++
	Если ДокОбъект.Контрагент.родитель = Справочники.Контрагенты.НайтиПоКоду("SSR-4117")
		//для дикси мегамарт тоже самое нечаева15,10,18++
		или КодКонтрагента = "SSP-3687"
		//для виктория балтия тоже самое нечаева 06,04,20 ++
		или КодКонтрагента = "SSR-4726"
		//для мегамарт дикси юг, нечаева 22,12,23 ++
		или КодКонтрагента = "SSP-3687"
		
		Тогда
		
		ТЗАртикулы = новый ТаблицаЗначений;
		ТЗАртикулы = ТЗ.скопировать();
		ТЗАртикулы.свернуть("ШККонтрагента,АртикулКонтрагента,Цена,СтавкаНДС,НаименованиеКонтрагента","заявка,количество,Всего,Сумма,НДС");
		ТЗАртикулы.колонки.добавить("Номенклатура");  
		//нечаева 24,09,18+++
		ТЗАртикулы.колонки.добавить("Кратность"); 
		//нечаева 24,09,18--
		Для Каждого ТекСтрока Из тзАртикулы Цикл
			
			ШКПоМатрице=НЕопределено;
			АртикулПоМатрице=НЕопределено;
			НайденнаяСтрока = тз1.Найти(ТекСтрока.АртикулКонтрагента,"АртикулКонтрагента");
			Если НайденнаяСтрока <> Неопределено ТОгда
				ТекСтрока.Кратность = Число(НайденнаяСтрока.Кратность);
				ТекСтрока.Номенклатура = НайденнаяСтрока.Номенклатура;
			Иначе
				//нечаева 24,09,18+++
				ТекСтрока.Кратность = 1;
				//нечаева 24,09,18--
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	//Нечаева 14,08,18 ---
	
	//Нечаева 10,07,17 ---
	
	
	
	//Нечаева 06,04,15+++++
	// для 7 континента сворачиваем 5 позиций по спайкам.
	
	Если КодКонтрагента = "SSP-1973" Тогда
		
		ТЗАртикулы = ТЗ.скопировать();
		ТЗАртикулы.свернуть("АртикулКонтрагента,Цена,СтавкаНДС","заявка,количество,Всего,Сумма,НДС");
		ТЗАртикулы.колонки.добавить("ШККонтрагента"); 
		ТЗАртикулы.колонки.добавить("НаименованиеКонтрагента"); 
		ТЗАртикулы.колонки.добавить("Кратность"); 
		ТЗАртикулы.колонки.добавить("Номенклатура"); 
		
		
		Для Каждого ТекСтрока Из тзАртикулы Цикл
			
			ШКПоМатрице=НЕопределено;
			АртикулПоМатрице=НЕопределено;
			НайденнаяСтрока = тз1.Найти(ТекСтрока.АртикулКонтрагента,"АртикулКонтрагента");
			Если НайденнаяСтрока <> Неопределено ТОгда
				Если ПустаяСтрока(НайденнаяСтрока.ШККонтрагентаБлочок) Тогда
					ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагента;
				Иначе
					ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагентаБлочок;
				КонецЕсли;
				ТекСтрока.АртикулКонтрагента = НайденнаяСтрока.АртикулКонтрагента;
				ТекСтрока.НаименованиеКонтрагента = НайденнаяСтрока.НаименованиеКонтрагента;
				ТекСтрока.Кратность = Число(НайденнаяСтрока.Кратность);
				ТекСтрока.Номенклатура = НайденнаяСтрока.Номенклатура;
			Иначе
				
			КонецЕсли;
			Если ТекСтрока.АртикулКонтрагента = "121459" Тогда
				ШК = "8308583260760";
			КонецЕсли;
			
			Если ТекСтрока.АртикулКонтрагента = "121344" Тогда
				ШК = "88308583347850";
			КонецЕсли;
			
			Если ТекСтрока.АртикулКонтрагента = "170466" Тогда
				ШК = "8300277515859";
			КонецЕсли;
			
			Если ТекСтрока.АртикулКонтрагента = "177010" Тогда
				ШК = "8300277516931";
			КонецЕсли;
			
			Если ТекСтрока.АртикулКонтрагента = "121139" Тогда
				ШК = "8300497008261";
			КонецЕсли;
			
		КонецЦикла;
		
		// перенесла в др место 09,04,15++ нечаева
		// проверка, если код артикула = "" тогда не выводить ничего
		//----------------------
		Для Каждого ТекСтрока Из тзАртикулы Цикл
			Если СокрЛП(текСтрока.артикулКонтрагента) = "" Тогда
				Сообщить("Для номенклатуры - "+ТекСтрока.Номенклатура+" - не определен артикул контрагента, для выгрузки в Е-код!!! (Заполните Документ Матрица)");
				ошибка = 1;
			КонецЕсли;
		конецЦикла;
		
		
	КонецЕсли;
	
	
	///-------------------------------------------
	ТЗДляОтправки = ТЗ;
	// для 7 континента сворачиваем 5 позиций по спайкам.
	Если КодКонтрагента = "SSP-1973" 
		// или тандер нечаева 10,07,17+++
		или КодКонтрагента = "SSP-3881"
		//нечаева 14,08,18--
		или  ДокОбъект.Контрагент.родитель =  Справочники.Контрагенты.НайтиПоКоду("SSR-4117")  // х5
		//нечаева 14,08,18--
		//для дикси мегамарт тоже самое нечаева15,10,18++
		или КодКонтрагента = "SSP-3687"
		//для виктория балтия тоже самое нечаева 06,04,20 ++
		или КодКонтрагента = "SSR-4726"
		//для мегамарт дикси юг, нечаева 22,12,23 ++
		или КодКонтрагента = "SSP-3687"
		
		Тогда
		
		ТЗДляОтправки = ТЗАртикулы;
		
	КонецЕсли;
	
	//нечаева 14,08,18+++
	попытка 
		тзДляОтправки.колонки.добавить("НомерСтроки");	
	исключение
	КонецПопытки;
	//нечаева 14,08,18---
	
	
	Для Каждого ТекСтрока из тзДляОтправки Цикл
		// нечаева 06,04,015 --------	
		
		
		Если ТекСтрока.Количество=0 И КодКонтрагента <> "SSP-1973"
			//нечаева 10,12,20+++
			и КодКонтрагента <>"SSR-3546"
			//нечаева 10,12,20---
			
			Тогда
			Продолжить;
		КонецЕсли; 
		Если ТекСтрока.ШККонтрагента="" Тогда
			ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - Для номенклатуры - "+ТекСтрока.Номенклатура+" - не определен штрихкод, для выгрузки в Е-код!!! (Заполните Документ Матрица)","Важное");
			Сообщить("Для номенклатуры - "+ТекСтрока.Номенклатура+" - не определен штрихкод, для выгрузки в Е-код!!! (Заполните Документ Матрица)");
			Ошибка=1;
			Продолжить;
		КонецЕсли;
		Если КодКонтрагента <> "SSR-1593" Тогда
			ШтукВУпаковке = 1;
			КодУпаковки = "PCE";
		Иначе
			Если ТекСтрока.Кратность > 0 Тогда
				ШтукВУпаковке = ТекСтрока.Кратность;
			Иначе
				ШтукВУпаковке = ТекСтрока.Номенклатура.Родитель.ШтукВКоробочке;
			Конецесли;
			Если ШтукВУпаковке = 0 Тогда
				ШтукВУпаковке = 1;
			КонецЕсли;
			КодУпаковки = "CT";
		Конецесли;
		
		
		// для Ашана и атака крастность берем из колонки кратность коробки
		// нечаева 04,03,24+++
		Если КодКонтрагента = "SSP-2450" Тогда
			ШтукВКоробке = 1;
			КодУпаковки = "PCE";
			
			Если ТекСтрока.КратностьКоробки > 0 Тогда
				ШтукВКоробке = ТекСтрока.КратностьКоробки;
			Конецесли;
			Если ШтукВКоробке = 0 Тогда
				ШтукВКоробке = 1;
			КонецЕсли;
		Конецесли;
		
		// нечаева 04,03,24---
		
		
		
		Элемент=ДокументДом.СоздатьЭлемент("Line");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент);
		//----------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("Line-Item");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		//----------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("LineNumber");
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(рр));                 
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		//----------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("EAN");  //штрихкод
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(ТекСтрока.ШККонтрагента);                      
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		//----------------------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("LineItemStatus");  //статус позиции
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		Если ТекСтрока.Заявка = ТекСтрока.Количество Тогда
			СтатусПозиции = "5";
		Иначе
			Если ТекСтрока.Количество = 0 тогда
				СтатусПозиции =  "7";
			Иначе
				СтатусПозиции = "3";
			КонецЕсли;
		КонецЕсли;
		текстДом=ДокументДом.СоздатьТекстовыйУзел(СтатусПозиции);                      
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		//----------------------------------------------------------
		//Если ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-1973") Тогда
		Если НЕ ((КодКонтрагента = "SSP-1973")
			или ( КодКонтрагента ="CHF-0006")
			//нечаева 08,07,19 +++   ашан
			или ( КодКонтрагента ="SSP-2450")
			//нечаева 08,07,19 ---
			) Тогда
			Элемент3=ДокументДом.СоздатьЭлемент("SupplierItemCode");
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент3);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Текстрока.Номенклатура.код);
			ТекУзел4.ДобавитьДочерний(ТекстДом);
		КонецЕсли;
		
		//----------------------------------------------------------
		Если Не ПустаяСтрока(ТекСтрока.АртикулКонтрагента) Тогда
			Элемент=ДокументДом.СоздатьЭлемент("BuyerItemCode");  //аритикул
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			//нечаева 08,06,17+++
			текстДом=ДокументДом.СоздатьТекстовыйУзел(СокрЛП(ТекСтрока.АртикулКонтрагента));                     
			//нечаева 08,06,17---
			ТекУзел4.ДобавитьДочерний(ТекстДом);
		КонецЕсли;
		
		//----------------------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("ItemDescription");  // наименование номенклатуры
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		Если ПустаяСтрока(ТекСтрока.НаименованиеКонтрагента) Тогда
			текстДом=ДокументДом.СоздатьТекстовыйУзел(ТекСтрока.Номенклатура.Наименование);
		Иначе
			текстДом=ДокументДом.СоздатьТекстовыйУзел(ТекСтрока.НаименованиеКонтрагента);
		КонецЕсли;
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		//----------------------------------------------------------
		
		//нечаева 21,01,15 +++++
		Заявка=ЗаменитьТочку(ТекСтрока.Заявка,3);
		Элемент=ДокументДом.СоздатьЭлемент("OrderedQuantity");  //Заказано
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		
		//Количество222=ЗаменитьТочку(ТекСтрока.Количество/ШтукВУпаковке,3);
		
		//Нечаева 06,02,18+++
		Количество222=ЗаменитьТочку(ТекСтрока.Заявка/ШтукВУпаковке,3);
		//Нечаева 06,02,18---
		
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(количество222));                     
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		//----------------------------------------------------------
		//катаев+ 19/12/14
		//Количество=ЗаменитьТочку(ТекСтрока.Количество,3);
		Количество=ЗаменитьТочку(ТекСтрока.Количество/ШтукВУпаковке,3);
		
		//Катаев- 19/12/14
		Элемент=ДокументДом.СоздатьЭлемент("QuantityToBeDelivered");  //Подтверждено
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		//Катаев+ 19/12/14
		//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Количество/ШтукВУпаковке));
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Количество));
		//Катаев- 19/12/14
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		
		
		// нечаева 04,03,24+++ для ашана штуки в коробке и кол коробок.
		//UnitPacksizeToBeDelivered
		Если  КодКонтрагента = "SSP-2450" Тогда
			
			Элемент=ДокументДом.СоздатьЭлемент("UnitPacksizeToBeDelivered");
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ШтукВКоробке)+".000");                     
			ТекУзел4.ДобавитьДочерний(ТекстДом);
			//-----------------------------------------------------------------------------------
			Элемент=ДокументДом.СоздатьЭлемент("FinalDeliveryQuantity");
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			ШтКоробок = ЗаменитьТочку(ТекСтрока.Количество/ШтукВКоробке,3);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ШтКоробок));                     
			ТекУзел4.ДобавитьДочерний(ТекстДом);			
		КонецЕсли;		 
		// нечаева 04,03,24 ---	
		
		
		
		//----------------------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("UnitOfMeasure");  //код упаковки
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(КодУпаковки);                     
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		//----------------------------------------------------------
		Если КодКонтрагента <>"SSP-1973" Тогда
			Элемент=ДокументДом.СоздатьЭлемент("Currency");
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			текстДом=ДокументДом.СоздатьТекстовыйУзел("RUR");
			ТекУзел4.ДобавитьДочерний(ТекстДом);
		КонецЕсли;
		//----------------------------------------------------------
		//Катаев+ 19/12/14
		//Цена = ЗаменитьТочку(Окр(ТекСтрока.Сумма/ТекСтрока.Количество,2,0),2);
		Если ТекСтрока.Количество = 0 ТОгда
			Цена = ЗаменитьТочку(ТекСтрока.Цена,3);   //21.01.15
		Иначе
			Цена = ЗаменитьТочку(Окр(ТекСтрока.Сумма/ТекСтрока.Количество,2,0),3);     //21.01.15
		КонецЕсли;
		//Цена = ЗаменитьТочку(ТекСтрока.Цена,3);
		//Катаев- 19/12/14
		Если КодКонтрагента<> "SSP-1973" и 
			// нечаева 04,03,24+++
			КодКонтрагента <> "SSP-2450" // ашан
			// нечаева 04,03,24 ---
			Тогда
			Элемент=ДокументДом.СоздатьЭлемент("OrderedUnitNetPrice");  // цена без ндс
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(цена));                      
			ТекУзел4.ДобавитьДочерний(ТекстДом);
		КонецЕсли;
		//----------------------------------------------------------
		
		//для бигбокса не надо                            и ашан
		Если НЕ (КодКонтрагента = "SSR-6841" или 
			
			КодКонтрагента = "SSP-2450")
			
			Тогда
			Элемент=ДокументДом.СоздатьЭлемент("OrderedUnitGrossPrice"); //Цена с НДС
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			Цена= ЗаменитьТочку(ТекСтрока.Цена,3);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
			ТекУзел4.ДобавитьДочерний(ТекстДом);
		КонецЕсли;
		//----------------------------------------------------------
		// если не ашан
		Если НЕ (КодКонтрагента = "SSP-2450") Тогда
			
			Элемент=ДокументДом.СоздатьЭлемент("TaxRate");
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			Если ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
				НДС_Текст = "10.00";
			ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
				НДС_Текст = "18.00";
			ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
				НДС_Текст = "20.00";
				//Валетов +	20,01,2026 ПУСТАЯ ЗАДАЧА  Добавить везде Ставку НДС 22
			ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС22 Тогда
				НДС_Текст = "22.00";
				//Валетов -
			ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
				НДС_Текст = "0.00";
			Иначе
				НДС_Текст = "Без НДС";
			КонецЕсли;
			текстДом=ДокументДом.СоздатьТекстовыйУзел(НДС_Текст);
			ТекУзел4.ДобавитьДочерний(ТекстДом);
			//----------------------------------------------------------------
			//нечаева для ТС молния
			//----------------------------------------------------------
			
			Цена= ЗаменитьТочку(ТекСтрока.НДС,3);                                                 // бигбокс
			Если КодКонтрагента <> "SSP-1973" и НЕ КодКонтрагента = "SSR-6841" Тогда
				Элемент=ДокументДом.СоздатьЭлемент("TaxAmount");  // сумма ндс
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
				ТекУзел4.ДобавитьДочерний(ТекстДом);
			КонецЕсли;
			
			//----------------------------------------------------------
			Цена= ЗаменитьТочку(ТекСтрока.Сумма,3);
			Если КодКонтрагента <> "SSP-1973" Тогда
				Элемент=ДокументДом.СоздатьЭлемент("NetAmount");  // сумма без ндс
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
				ТекУзел4.ДобавитьДочерний(ТекстДом);
			КонецЕсли;
			
		КонецЕсли;
		
		//------------------------------------------------	
		// нечаева 29,01,19+++
		// для Х5 в комментарий нужно писать причину недопоставки.
		Если КодКонтрагента = "SSR-4117" Тогда
			
			ПрНедопоставки=ПолучитьПричинуНедопоставки(ТекСтрока.Номенклатура);
			попытка
				Если ПрНедопоставки<>"" и ПрНедопоставки<>Неопределено Тогда
					// нам нужна только часть с кодом. 
					Пр2 = Найти(ПрНедопоставки,"  ");
					Пр_н  = СокрЛП(Лев(ПрНедопоставки,Пр2));
					
					Элемент=ДокументДом.СоздатьЭлемент("Remarks");
					ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(Пр_Н));
					ТекУзел4.ДобавитьДочерний(ТекстДом);
				КонецЕсли;
			исключение
			конецПопытки;
		КонецЕсли;
		//нечаева 29,01,19---
		
		
		//----------------------------------------------------------
		//Катаев+ 19/12/14 Для 7 континента не выводить
		// нечаева для ООО молния МОЛЛ тоже не выводить 22.01.15+++
		Если НЕ ((КодКонтрагента = "SSP-1973") 
			или ( КодКонтрагента ="CHF-0006")
			
			или 
			// нечаева 04,03,24+++
			КодКонтрагента = "SSP-2450" // ашан
			// нечаева 04,03,24 ---
			
			) Тогда
			Цена= ЗаменитьТочку(ТекСтрока.Всего,3);	//сумма с НДС
			Элемент=ДокументДом.СоздатьЭлемент("GrossAmount");
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
			ТекУзел4.ДобавитьДочерний(ТекстДом);
		КонецЕсли;
		//Катаев- 19/12/14
		
		
		
		
		РР=РР+1;
	КонецЦикла;
	Если Ошибка = 0 Тогда
		КорневойЭлемент=ДокументДом.ЭлементДокумента;
		ЭлементДом=ДокументДом.СоздатьЭлемент("OrderResponse-Summary");
		ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
		Элемент2=ДокументДом.СоздатьЭлемент("TotalLines");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(РР-1));
		ТекУзел2.ДобавитьДочерний(ТекстДом);
		
		//нечаева 12,08,16+++ 
		//---------------------------------------------------------------
		
		// для утконоса - новый импульс        //для бигбокса
		Если КодКонтрагента = "SSP-3563"  или КодКонтрагента = "SSR-6841"
			
			// для тандера тоже
			//нечаева 10,07,17+++
			или КодКонтрагента = "SSP-3881"
			//нечаева 10,07,17---
			
			// еврологистик
			//нечаева 27,10,21+++
			или КодКонтрагента = "SSR-6974"
			//нечаева 27,10,21---
			
			
			// нечаева 28,02,24+++ фикспрайс
			или  КодКонтрагента = "SSR-6999"
			// нечаева 28,02,24---
			
			Тогда
			
			Элемент2=ДокументДом.СоздатьЭлемент("TotalNetAmount");
			ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
			Сумма= товары.Итог("Сумма");
			Цена= ЗаменитьТочку(сумма,3);	//сумма без НДС
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(цена));
			ТекУзел2.ДобавитьДочерний(ТекстДом);
			
			//---------------------------------------------------------------
			
			Элемент2=ДокументДом.СоздатьЭлемент("TotalTaxAmount");
			ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
			Сумма= товары.Итог("ндс");
			Цена= ЗаменитьТочку(сумма,3);	//сумма без НДС
			
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(цена));
			ТекУзел2.ДобавитьДочерний(ТекстДом);
			//---------------------------------------------------------------
			
			Элемент2=ДокументДом.СоздатьЭлемент("TotalGrossAmount");
			ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
			Сумма= товары.Итог("всего");
			Цена= ЗаменитьТочку(сумма,3);	//сумма без НДС
			
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(цена));
			ТекУзел2.ДобавитьДочерний(ТекстДом);
			
			
			//-------------------------------------------------
			//для бигбокса 24,04,17+++  и для ашана
			Если  КодКонтрагента = "SSR-6841"  Тогда
				
				Элемент2=ДокументДом.СоздатьЭлемент("TotalQuantityToBeDelivered");
				ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
				Сумма= товары.Итог("Сумма");
				Цена= ЗаменитьТочку(ссылка.КоличествоДокумента,3);	//количество
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(цена));
				ТекУзел2.ДобавитьДочерний(ТекстДом);
				
			КонецЕсли;
			//для бигбокса 24,04,17 ---
			
		КонецЕсли;
		
		//для  ашана
		Если   КодКонтрагента = "SSP-2450" Тогда
			
			Элемент2=ДокументДом.СоздатьЭлемент("TotalQuantityToBeDelivered");
			ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
			Сумма= товары.Итог("Сумма");
			Цена= ЗаменитьТочку(ссылка.КоличествоДокумента,3);	//количество
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(цена));
			ТекУзел2.ДобавитьДочерний(ТекстДом);
			
		КонецЕсли;
		
		//нечаева 12,08,16---
		
		//---------------------------------------------------------------
		ЗаписьДом=Новый ЗаписьDom;
		ЗаписьДом.Записать(ДокументДом,ЗаписьХМЛ);
		ЗаписьХМЛ.Закрыть();
		ф1 = новый ЧтениеТекста(ВремФайл);
		ф2 = Новый ЗаписьТекста(ИмяФайлаОбмена);
		стр = ф1.ПрочитатьСтроку();
		Пока стр <> Неопределено Цикл
			//нечаева 23,01,15 +++
			Если стр <> "<?xml version=""1.0"" encoding=""UTF-8""?>" Тогда
				//Если стр <> "<?xml version=""1.0""?>" Тогда
				//нечаева 23,01,15 ---
				ф2.ЗаписатьСтроку(стр);
			КонецЕсли;
			стр = ф1.ПрочитатьСтроку();
		КонецЦикла;
		ф2.Закрыть();
		ф1.Закрыть();
		//Нечаева 20,03,17+++
		УдалитьФайлы(КаталогВременныхФайлов(),НомЗ+".xml");
		//Нечаева 20,03,17---
		//сообщить(""+КаталогВременныхФайлов()+"Пз_"+НомЗ+"_.xml");
		
		//нечаева 11,10,19+++
		Если Провайдер = 0 или провайдер = 3 Тогда
			Если ПланыОбмена.Основной.ЭтотУзел() <> ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
				//Соединение.Записать(ИмяФайлаОбмена, ИмяФайлаОбменаФТП);
				//Нечаева 20,03,17+++
				УдалитьФайлы(КаталогВременныхФайлов(),"Пз_"+НомЗ+"_.xml");
				//Нечаева 20,03,17-
				
				ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - подтверждение было успешно создано","Информация");
			Иначе	
				ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - подтверждение было успешно создано","Информация");
			КонецЕсли;
		Иначе
			
			Соединение.Записать(ИмяФайлаОбмена, ИмяФайлаОбменаФТП);
			//Нечаева 20,03,17+++
			УдалитьФайлы(КаталогВременныхФайлов(),"Пз_"+НомЗ+"_.xml");
			//Нечаева 20,03,17-
			
			ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - подтверждение было успешно создано на ftp СКБ-Контур","Информация");
		КонецЕсли;
		
		//	сообщить(""+КаталогВременныхФайлов()+"Пз_"+НомЗ+"_.xml");
		
		//Катаев- 14/11/14
	Иначе	
		ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - обнаружены ошибки, файл подтверждения не создан!","Важное");
		Сообщить("Обнаружены ошибки, файл подтверждения не записан!");
	КонецЕсли;
КонецПроцедуры


//----------------------------------------
// нечаева 30,01,25+++
Функция В_JSON(Значение) Экспорт
	ЗначениеВнутр = ПривестиЗначение(Значение);
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON,ЗначениеВнутр);
	Возврат ЗаписьJSON.Закрыть();
КонецФункции
Функция Из_JSON(Значение,ВСоответствие=Истина) Экспорт
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Значение);
	Возврат ПрочитатьJSON(ЧтениеJSON,ВСоответствие);
КонецФункции
Функция ПривестиЗначение(Значение) Экспорт   
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		Возврат Значение;
	ИначеЕсли ТипЗнч(Значение) = Тип("Неопределено") Тогда	
		Возврат Значение;
	ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда	
		Возврат Значение;
	ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда	
		Возврат Значение;
	ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда	
		Возврат Значение;
	ИначеЕсли ТипЗнч(Значение) = Тип("Булево") Тогда	
		Возврат Значение;
	ИначеЕсли ТипЗнч(Значение) = Тип("Массив") Тогда	
		ЗначениеВнутр = Новый Массив;
		Для каждого СтрЗнач Из Значение Цикл
			ЗначениеВнутр.Добавить(ПривестиЗначение(СтрЗнач));
		КонецЦикла;	
		Возврат ЗначениеВнутр;
	ИначеЕсли ТипЗнч(Значение) = Тип("Структура") Тогда	
		ЗначениеВнутр = Новый Структура;
		Для каждого СтрЗнач Из Значение Цикл
			ЗначениеВнутр.Вставить(СтрЗнач.Ключ,ПривестиЗначение(СтрЗнач.Значение));
		КонецЦикла;	
		Возврат ЗначениеВнутр;
	ИначеЕсли ТипЗнч(Значение) = Тип("ТаблицаЗначений") Тогда	
		ЗначениеВнутр = Новый Массив;
		Для каждого СтрЗнач Из Значение Цикл
			СтрокаЗначения = Новый Структура();
			Для каждого Колонка Из Значение.Колонки Цикл
				СтрокаЗначения.Вставить(Колонка.Имя,ПривестиЗначение(СтрЗнач[Колонка.Имя]));	
			КонецЦикла;	
			ЗначениеВнутр.Добавить(СтрокаЗначения);
		КонецЦикла;	
		Возврат ЗначениеВнутр;
	ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) ИЛИ Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
		Если Значение.Пустая() Тогда
			Возврат Неопределено;
		КонецЕсли;	
		Возврат Строка(Значение.УникальныйИдентификатор());
	Иначе
		Возврат Строка(Значение);
	КонецЕсли;	
КонецФункции

Функция ПолучитьТаблицуССКодов(НомерРНК,ДатаРНК) Экспорт
	
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//WS_User="*%*%*%";
	//WS_Password="*$*$*$";
	WS_User = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
	Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКWebСервисуСклада).Логин;
	WS_Password = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
	Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКWebСервисуСклада).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	Определение = Новый WSОпределения("http://srvsql-sk:31415/od7/ws/wsPalletsExt.1cws?wsdl",WS_User,WS_Password);
	
	Прокси = Новый WSПрокси(Определение, "http://collant.ru/wsPalletsExt","wsPalletsExt","wsPalletsExtSoap" );    
	Прокси.Пользователь = WS_User;
	Прокси.Пароль = WS_Password;
	
	
	Данные = Прокси.GetPData(НомерРНК,Формат(ДатаРНК,"ДФ=yyyyMMdd"));
	ДанныеВН = Из_JSON(Данные,Ложь);
	
	Результат = Новый ТаблицаЗначений();
	Результат.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Результат.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("ССКод",Новый ОписаниеТипов("Строка"));
	
	Для каждого Элемент Из ДанныеВН Цикл
		Если Элемент.SSCCКод <> "" Тогда
			Стр = Результат.Добавить();
			Стр.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент.Номенклатура));
			Стр.Количество = Элемент.Количество;
			Стр.ССКод = Элемент.SSCCКод;
			
		КонецЕсли;	
	КонецЦикла;    
	Результат.Сортировать("Номенклатура");
	Возврат Результат;
	
КонецФункции

//нечаева 21,01,25+++  для тандера таблица сс кодов
Функция ПолучитьТаблицуССкодовдляУведомления(ДокОбъект) экспорт
	
	ТЗ= новый ТаблицаЗначений;
	ТЗ=Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("ССКод",Новый ОписаниеТипов("строка"));
	//ТЗ.Колонки.Добавить("Ид",Новый ОписаниеТипов("строка"));
	//ТЗ.Колонки.Добавить("Ном2",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	//ТЗ.Колонки.Добавить("АртикулКонтрагента",Новый ОписаниеТипов("Строка"));
	ТЗ.Очистить();
	
	ТЗ = ПолучитьТаблицуССКодов(ДокОбъект.Номер,ДокОбъект.Дата);
	ТЗ.Свернуть("Номенклатура,ССКод,Количество");
	ТЗ.Колонки.Добавить("Ид",Новый ОписаниеТипов("строка"));
	ТЗ.Колонки.Добавить("Ном2",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ.Колонки.Добавить("АртикулКонтрагента",Новый ОписаниеТипов("Строка"));
	
	пп=1;
	
	
	тз.Колонки.Добавить("ШККонтрагента");
	тз.Колонки.Добавить("НаименованиеКонтрагента");
	
	//нечаева 26,04,18+++ 	
	тз1 = ПолучитьАртикулыМатрицы(ДокОбъект);
	//нечаева 26,04,18---
	
	
	Для Каждого ТекСтрока Из тз Цикл
		Если ТекСтрока.Количество<=0 И ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-1973") 
			И ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-3881")
			и ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSR-3546")
			и ДокОбъект.Контрагент.родитель <> Справочники.Контрагенты.НайтиПоКоду("SSR-4117")
			и ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("EKF-1242")  // урал логистик нечаева 27,03,24+++
			и ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("KRF-0349")
			Тогда
			
			Продолжить;
		КонецЕсли; 
		
		ШКПоМатрице=НЕопределено;
		АртикулПоМатрице=НЕопределено;
		
		попытка
			НайденнаяСтрока = тз1.Найти(ТекСтрока.Номенклатура,"Номенклатура");
		исключение
			НайденнаяСтрока =неопределено;
		конецПопытки;
		Если НайденнаяСтрока <> Неопределено ТОгда
			
			Если ПустаяСтрока(НайденнаяСтрока.ШККонтрагентаБлочок) Тогда
				ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагента;
			Иначе
				ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагентаБлочок;
			КонецЕсли;
			
			//270520 нечаева ++  окей шк штуки всегда
			Если ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-5862") Тогда
				ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагента;
			КонецЕсли;
			
			
			Если НЕ ПустаяСтрока(НайденнаяСтрока.ШКСпайки) Тогда
				ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШКСпайки;
			КонецЕсли;
			
			
			ТекСтрока.АртикулКонтрагента = НайденнаяСтрока.АртикулКонтрагента;
			ТекСтрока.НаименованиеКонтрагента = НайденнаяСтрока.НаименованиеКонтрагента;
		Иначе
			Если НЕ ОбменДанными.Загрузка Тогда	
				Сообщить("В номенклатурной матрице не найдена номенклатура "+ТекСтрока.Номенклатура);
			конецесли ;
			Ошибка = 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Ошибка = 1 Тогда
		
		ТЗ.Очистить();
		возврат ТЗ;	
		
	КонецЕсли;
	РР=1;
	
	колДок = 0;
	
	//Для Тандера сворачиваем по артикулам, шк берем из спаек
	ТЗАртикулы = новый ТаблицаЗначений;
	Если ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-3881") Тогда
		
		ТЗАртикулы = ТЗ.скопировать();
		ТЗАртикулы.свернуть("ШККонтрагента,АртикулКонтрагента,НаименованиеКонтрагента,ССкод,Ид","количество");
		
		ТЗАртикулы.колонки.добавить("Номенклатура");  
		
		Для Каждого ТекСтрока Из тзАртикулы Цикл
			
			ШКПоМатрице=НЕопределено;
			АртикулПоМатрице=НЕопределено;
			НайденнаяСтрока = тз1.Найти(ТекСтрока.АртикулКонтрагента,"АртикулКонтрагента");
			Если НайденнаяСтрока <> Неопределено ТОгда
				ТекСтрока.Номенклатура = НайденнаяСтрока.Номенклатура;
			Иначе
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	///-------------------------------------------
	ТЗДляОтправки = ТЗ;
	Если   ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-3881")  // тандер
		
		Тогда
		
		ТЗДляОтправки = ТЗАртикулы;
		
	КонецЕсли;
	
	//-----------------------------------------------------------------------
	// если ссс кодов нет, тогда очищаем и ничего не крепим.
	ТЗ.Свернуть("ССкод"); 
	Если тз.Количество()=0 Тогда
		ТЗДляОтправки.Очистить();
	КонецЕсли;
	
	
	возврат ТЗДляОтправки;
	
	
КонецФункции	

// нечаева для Тандера СС коды делим по строкам
функция РазделениеСтрокПоПаллетам(ДанныеДляПечати, СписокСтрокПоПаллетам, Накладная) экспорт
	
	//---------------------------------------------------------------------------------------
	//для Тандера, если у нас деление по паллетам идет. строки делим если на одну два сс кода.
	
	ВыборкаСтрокТовары = Новый ТаблицаЗначений;
	
	ВыборкаСтрокТовары = ДанныеДляПечати.скопировать();  //.ЗаполнитьЗначения(ВыборкаСтрокТовары); 
	ВыборкаСтрокТовары.Колонки.Добавить("СуммаБезНДС",Новый ОписаниеТипов("Число"));
	ВыборкаСтрокТовары.Колонки.Добавить("СуммаСНДС",Новый ОписаниеТипов("Число"));
	ВыборкаСтрокТовары.Колонки.Добавить("ССКод",Новый ОписаниеТипов("строка"));
	ВыборкаСтрокТовары.Колонки.Добавить("КратностьБлочка",Новый ОписаниеТипов("строка"));
	ВыборкаСтрокТовары.Колонки.Добавить("Модель",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ВыборкаСтрокТовары.Колонки.Добавить("ЭтоГруппаНом",Новый ОписаниеТипов("Булево"));
	
	// Кухарь А.Ю.  30.01.2025 начало
	//
	если СписокСтрокПоПаллетам.колонки.найти("Ном2") = Неопределено тогда
		СписокСтрокПоПаллетам.колонки.Добавить("Ном2");
	КонецЕсли;
	// Кухарь А.Ю.  30.01.2025 конец
	
	
	//таблица для дополнительных строк.
	ВыборкаСтрокТовары2 = Новый ТаблицаЗначений;
	ВыборкаСтрокТовары2 = ВыборкаСтрокТовары.скопировать(); 
	ВыборкаСтрокТовары2.очистить();
	
	Если Накладная.отгрузкаКомплектов Тогда
		Для Каждого Строчка1 Из ВыборкаСтрокТовары Цикл
			
			
			
			// Кухарь А.Ю.  30.01.2025 начало
			// Ном = Строчка1.Товар; // ТекНом; // пропишем ее в комплектующих
			Ном = Строчка1.Номенклатура;
			// ТекНом; // пропишем ее в комплектующих		 
			// Кухарь А.Ю.  30.01.2025 конец
			
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	НоменклатураКоплектующие.Ссылка КАК Ссылка,
			|	НоменклатураКоплектующие.Номенклатура КАК Номенклатура,
			|	НоменклатураКоплектующие.Коэффициент КАК Коэффициент,
			|	НоменклатураКоплектующие.Количество КАК Количество,
			|	НоменклатураКоплектующие.Единица КАК Единица
			|ИЗ
			|	Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
			|ГДЕ
			|	НоменклатураКоплектующие.Ссылка = &ном";
			Запрос.УстановитьПараметр("Ном",Ном) ;
			Рез22 = Запрос.Выполнить().Выгрузить();
			
			// СписокСтрокПоПаллетам.Колонки.Добавить("Товар2");
			
			Для каждого ТСтр из СписокСтрокПоПаллетам цикл
				Поиск = Рез22.Найти(ТСтр.Номенклатура,"Номенклатура");
				Если Поиск<> неопределено Тогда 
					ТСтр.Ном2 = ном;
				КонецЕсли;	
				
			КонецЦикла;
			
		КонецЦикла;
		//+++++++++02,03,20
		Для каждого ТСтр из СписокСтрокПоПаллетам цикл
			Если ТСтр.Ном2<>неопределено и ТСтр.Ном2<>справочники.номенклатура.пустаяССылка() Тогда
				ТСтр.номенклатура = ТСтр.Ном2;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	СписокСтрокПоПаллетам.Свернуть("Номенклатура, ССКод", "Количество");
	
	//---------------------------------
	Кратко= ложь;
	попытка
		Кратко = Накладная.Контрагент.НаборПечатныхФорм.Список[0].Кратко;
	исключение
	конецПопытки;
	
	
	Для Каждого Строчка1 Из ВыборкаСтрокТовары Цикл
		Если строчка1.количество=0 Тогда
			продолжить;
		КонецЕсли;	
		ЦенаСН = Строчка1.Всего/Строчка1.количество;
		СтавкаНДС2=ПроцентНДСпоСтавке(Строчка1.СтавкаНДС);
		
		// выбираем строки с номенклатурой из СписокСтрокПоПаллетам.
		// проверим есть ли две строки, тогда делим.
		// типизируем, чтобы можно было запросы по ней делать
		ТЗ2  = Новый ТаблицаЗначений;
		ТЗ2.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТЗ2.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число"));
		ТЗ2.Колонки.Добавить("ССКод",Новый ОписаниеТипов("строка"));
		// для комплектации свернет по товару.
		
		
		Запрос = Новый Запрос;
		ДанныеСкладов=Неопределено;
		МВТ = Новый МенеджерВременныхТаблиц;
		Запрос.МенеджерВременныхТаблиц = МВТ;
		Запрос.Текст  = "ВЫБРАТЬ 
		|	ТЗ2.Количество,
		|	ТЗ2.ССКод как ССКод
		|ПОМЕСТИТЬ ТЗ2
		|ИЗ
		|	&ТЗ2 КАК ТЗ2
		|ГДЕ
		|	ТЗ2.Номенклатура = &ТекТовар";
		Запрос.УстановитьПараметр("ТекТовар",Строчка1.Номенклатура.ссылка); // было товар
		Запрос.УстановитьПараметр("ТЗ2", СписокСтрокПоПаллетам);
		Запрос.Выполнить();
		
		Запрос.Текст="ВЫБРАТЬ
		|	ТЗ2.Количество,
		|	ТЗ2.СсКод как ССКод
		|ИЗ
		|	ТЗ2 КАК ТЗ2	";
		
		РезНом=Запрос.Выполнить().Выбрать();
		
		Если РезНом.Количество()>1 Тогда
			// делим строки по количеству и пересчитываем их.
			//ЦенаСН = Строчка1.Сумма/Строчка1.количество; //цена c НДС;
			Сч =1;
			Пока РезНом.Следующий() Цикл
				Если Сч = 1 Тогда
					
					Строчка1.ССкод = РезНом.Сскод ;
					Строчка1.количество = РезНом.Количество;
					Строчка1.заявка = РезНом.Количество;
					//пересчитаем
					Строчка1.Всего = Окр(ЦенаСН * Строчка1.Количество,2); //новая сумма С НДС
					Строчка1.НДС =  Строчка1.Всего- Окр(Строчка1.Всего/(1+СтавкаНДС2),2);;
					Строчка1.Сумма = Строчка1.Всего - Строчка1.НДС;
					
					Сч = Сч+1;
					продолжить;
				КонецЕсли;	
				
				НовСтр = ВыборкаСтрокТовары2.Добавить();
				НовСтр.Количество = РезНом.Количество;
				НовСтр.ССКод = РезНом.СсКод ;
				НовСтр.СтавкаНДС = Строчка1.СтавкаНДС;
				НовСтр.Сумма = Строчка1.Сумма;
				//НовСтр.СуммаНДС = Строчка1.СуммаНДС;
				НовСтр.Цена = Строчка1.Цена;
				НовСтр.СуммаБезНДС = Строчка1.СуммаБезНДС;
				НовСтр.СуммаСНДС = Строчка1.СуммаСНДС;
				НовСтр.Кратность = Строчка1.Кратность;
				НовСтр.АртикулКонтрагента = Строчка1.АртикулКонтрагента;
				НовСтр.Всего = Строчка1.Всего;  //????
				НовСтр.Заявка = РезНом.Количество;
				НовСтр.КратностьБлочка = Строчка1.КратностьБлочка;
				НовСтр.Модель = Строчка1.Модель;
				НовСтр.НДС = Строчка1.НДС;
				НовСтр.НаименованиеКонтрагента = Строчка1.НаименованиеКонтрагента;
				НовСтр.Номенклатура = Строчка1.Номенклатура;
				НовСтр.НомерСтроки = Строчка1.НомерСтроки;
				
				НовСтр.ШККонтрагента = Строчка1.ШККонтрагента;
				НовСтр.ЭтоГруппаНом = Строчка1.ЭтоГруппаНом;
				
				Сч = Сч+1;
				
				//пересчитаем
				НовСтр.Всего = Окр(НовСтр.Цена * НовСтр.Количество,2); //новая сумма С НДС
				НовСтр.НДС = НовСтр.Всего- Окр(НовСтр.ВСего/(1+СтавкаНДС2),2);  // сумма ндс
				НовСтр.Сумма = НовСтр.Всего - НовСтр.НДС;
				
				
			КонецЦикла;
			
		иначе	
			// просто sscc код прописываем.
			ТС = РезНом.Следующий();
			Строчка1.ССКод = РезНом.ССКод ;
			
		КонецЕсли;
		
	Конеццикла;
	
	
	
	// добавим строки разбитые в исходную таблицу. и сделаем пересчет.
	Для каждого текстрока22 из ВыборкаСтрокТовары2 цикл
		
		СтТЗ = ВыборкаСтрокТовары.добавить();
		ЗаполнитьЗначенияСвойств(СтТЗ, ТекСтрока22);
		
	КонецЦикла;
	
	возврат ВыборкаСтрокТовары;
	
	
	
конецФункции

// сскоды в РНК для Тандера
Функция ПолучитьНомераУпаковок(ДокОбъект) экспорт
	
	ТЗ = Новый ТаблицаЗначений;
	
	ТекДок = ДокОбъект.Ссылка;
	
	запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита как Номер,
	|	0 КАК Код
	|ИЗ
	|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
	|ГДЕ
	|	РеквизитыРНКПНКПРМ.Документ = &текдок
	|	И РеквизитыРНКПНКПРМ.ИмяРеквизита ПОДОБНО &рек";
	запрос.УстановитьПараметр("ТекДок",ТекДок.ссылка);
	запрос.УстановитьПараметр("рек","СерийныйНомерУпаковки%");
	РезКоды = Запрос.Выполнить().Выгрузить();
	
	РР=2;
	Для каждого Стр Из 	РезКоды цикл
		
		Стр.код = РР;
		РР=РР+1;
		
	КонецЦикла;
	
	
	ТЗ = резКоды;
	
	
	возврат ТЗ;
	
КонецФункции
// нечаев 30,01,25+++ много доработок внутри для тандера кроссдокинг
//------------------------



//Катаев+ 28/10/14
//Процедура СформироватьУведомление(ДокОбъект, Ошибка = 0) Экспорт //Катаев+ в получаемые параметры добавлео ", Ошибка = 0" для скаладских журналов
Процедура СформироватьУведомление_до_Тандера(ДокОбъект, Ошибка, Провайдер) Экспорт
	
	//нечаева 18,05,21+++
	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Кухарь А.Ю. 31.03.2026 начало
	// Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом тогда 
	Если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() тогда 
		//Кухарь А.Ю. 31.03.2026 конец
       
		ЗаписатьВЛог("ОшибкиЕкод","Отмена выполнения. подтверждение не создано "+ДокОбъект+" база "+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
		
		ошибка=1;
		
		Возврат ;
	КонецЕсли;
	// нечаева 18,05,21----
	
	// нечаева 27,02,23 ++
	// для атака по некторым не отправл. уведомл об отгрузке.
	Если ДокОбъект.ПунктДоставки.КодИЛН = "4660000943095" или  ДокОбъект.ПунктДоставки.КодИЛН = "4660000943477"
		// для детского мира, ПД маркетплейс - не надо, нечаева 24,05,23+++ 
		или  ДокОбъект.ПунктДоставки.Код = "SNL-025840"
		Тогда
		возврат ;
	КонецЕсли;	
	// нечаева 27,02,23 --
	
	
	
	
	
	
	// для Ашана
	//нечаева 17,09,19+++	
	Если ДокОбъект.Контрагент.код = "SSP-2450" ТОгда
		ПоискНомера=новый Запрос;
		ПоискНомера.Текст="ВЫБРАТЬ
		|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита КАК приемка
		|ИЗ
		|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
		|ГДЕ
		|	РеквизитыРНКПНКПРМ.Документ = &Документ
		|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = &ИмяРеквизита";
		ПоискНомера.УстановитьПараметр("Документ", ЭтотОбъект.ссылка);
		ПоискНомера.УстановитьПараметр("ИмяРеквизита","GLNпокупателя");
		СписокНомеров=ПоискНомера.Выполнить().Выбрать();
		// не отправляем если нет сс кода
		Если списокномеров.Количество() = 0 ТОгда
			#если клиент тогда
				сообщить("Уведомление не отправлено, нет SSCC кода "+ДокОбъект.ссылка);
			# конецесли 
			
			возврат;
		КонецЕсли;	
		
		
	КонецЕсли;
	//нечаева 17,09,19 +---	
	
	
	
	Если ПустаяСтрока(ДокОбъект.Контрагент.Родитель.КодИЛН) Тогда
		ИЛНПок =  ДокОбъект.Контрагент.КодИЛН;
	Иначе
		ИЛНПок =  ДокОбъект.Контрагент.Родитель.КодИЛН;
	КонецЕсли;
	
	//нечаева 02,02,015 +++
	если контрагент.Код = "PRF-0122" Тогда  // для виват-трейд только при отгрузке
		Если  СостояниеНакладной <> Перечисления.СостоянияНакладной.Отгружена  тогда
			ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - попытка формирования уведомления для виват-трейд, возврат ","Важное");
			возврат;
		иначе
			ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - формирование уведомления для виват-трейд ","Важное");
		конецЕсли;
	конецЕсли;	
	//нечаева 02,02,015 ---
	
	//нечаева 16,03,23+++
	// для командора в момент отгружено только отправляем
	если контрагент.Код = "KRF-0349" Тогда  // для тс командор только при отгрузке
		Если  СостояниеНакладной <> Перечисления.СостоянияНакладной.Отгружена  тогда
			возврат;
		КонецЕсли;
	конецЕсли;	
	// нечаева 16,03,23--- 
	
	//нечаева 23,02,16+++ для перекрестка в РГ или отгружено. В ожидание паллетирования не отправлять.
	Если контрагент.Родитель.Код = "SSR-4117"
		//нечаева 10,07,17++ для тандера также делаем.
		или  контрагент.Код = "SSP-3881"  или   контрагент.Код =  "SSR-2450"
		//окей
		////нечаева 26,09,18++
		или  контрагент.Код = "SSP-3687" 
		////нечаева 26,09,18---
		
		Тогда 
		ОтправлятьДок = ложь;
		Если  СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена  или  СостояниеНакладной = Перечисления.СостоянияНакладной.ГотоваКОтгрузке тогда
			ОтправлятьДок = истина;
		конецЕсли;
		
		Если  НЕ ОтправлятьДок Тогда
			возврат;
		КонецЕсли;	
		
	конецЕсли;	
	//нечаева 23,02,16 ---
	
	
	//Нечаева 20,03,17+++
	НомЗ = СокрЛП(СтрЗаменить(СокрЛП(ДокОбъект.НомерЗаказа), "/", "_"));		
	НомЗ = СтрЗаменить(НомЗ, "\", "_");		
	//Нечаева 20,03,17---
	
	
	
	//Нечаева 07,02,17++++
	// для клиентов с галкой.
	ПроверкаСФДляДок = Истина;
	// для УПД и уведомлений.
	
	Если  контрагент.ФормироватьСФприОП  Тогда
		
		СФ=Неопределено;
		СФ=СчетФактураНакладной(Ссылка,Организация);
		Если СФ.Пустая() Тогда
			ПроверкаСФДляДок = ложь;
			ЗаписатьВЛог("Екод","уведомление не отправлено! еще нет СФ - "+Номер+" "+Дата+ОписаниеОшибки(),"Важное");		
			возврат;
			// ничего не формируем пока не загрузилась СФ.
		КонецЕсли;
		
	КонецЕсли;
	//Нечаева 07,02,17----
	
	//
	//ИЛНПост = "4607182079990EC";
	//
	//	
	////Нечаева 09,10,19+++
	//Если Провайдер = 3 Тогда
	//	//ИЛНПост = "4607182079990";
	//	ИЛНПост = "4607182079990WS";
	
	//КонецЕсли;
	////Нечаева 09,10,19---
	
	
	ИЛНПост = "4607182079990WS";
	
	// нечаева 19,04,2023+++   единая
	Если ДокОбъект.организация.код = "SS-001" Тогда
		ИЛНПост = "4607182079990EC";
		
		//Нечаева 09,10,19+++
		Если Провайдер = 3 Тогда
			//ИЛНПост = "4607182079990";
			ИЛНПост = "4607182079990WS";
			
		КонецЕсли;
		//Нечаева 09,10,19---
	ИначеЕсли ДокОбъект.организация.код = "SSP-99" Тогда    // бтк
		
		ИЛНПост = "4607196338601WS";
		
	КонецЕсли;
	// нечаева 19,04,2023---
	
	// нечаева 27,02,24++
	кодКонтрагента = ДокОбъект.Контрагент.код ;
	//нечаева 27,02,24---
	
	
	Если Провайдер = 0 или Провайдер = 3 Тогда
		Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
			
			ПутьДляУвед = ПолучитьПутьДляУвед(КаталогЕкода+ИЛНПост+"\"+ИЛНПок+"\OUT\");
			//Нечаева 15,03,18+++
			// Для Хорошего дня - магнолия
			Если ПутьДляУвед = Неопределено и (ИЛНПок = "9777992536626" или ДокОбъект.Контрагент.Родитель.код = "SMN-7541") ТОгда
				//   9777992579999 - корневой для Магнолии
				ПутьДляУвед = ПолучитьПутьДляУвед(КаталогЕкода+ИЛНПост+"\9777992579999\OUT\");
				
			КонецЕсли;		   
			//Нечаева 15,03,18---
			
			
			//Нечаева 01,11,2021+++
			// Для Еврологистик ТС Лама
			Если ПутьДляУвед = Неопределено и (ИЛНПок = "4620020788939" или ДокОбъект.Контрагент.Родитель.код = "SSR-6974") ТОгда
				//   9777992579999 - корневой для Магнолии
				ПутьДляУвед = ПолучитьПутьДляУвед(КаталогЕкода+ИЛНПост+"\4620020789998\OUT\");
				
			КонецЕсли;		   
			//Нечаева 101,11,2021---
			
			
			//Нечаева 13102022+++
			// Для урал
			Если ПутьДляУвед = Неопределено и (ИЛНПок = "4620020788939" или ДокОбъект.Контрагент.Родитель.код = "EKF-0488") ТОгда
				//   9777992579999 - корневой для Магнолии
				ПутьДляУвед = ПолучитьПутьДляУвед(КаталогЕкода+ИЛНПост+"\4607182259835\OUT\");
				
			КонецЕсли;		   
			//Нечаева 13102022---
			
			
			//Нечаева 20,02,23+++
			// Для метро
			Если ПутьДляУвед = Неопределено и (ИЛНПок = "4607070198888" или кодКонтрагента = "SSP-8643") ТОгда
				//   9777992579999 - корневой для Магнолии
				ПутьДляУвед = ПолучитьПутьДляУвед(КаталогЕкода+ИЛНПост+"\4607070199991\OUT\");
				
			КонецЕсли;		   
			//Нечаева 20.02.23---
			
			// 4680021979996 шагдарова ТС Абсолют			
			Если ПутьДляУвед = Неопределено и (ИЛНПок = "4680021979989" или кодКонтрагента = "SSR-9771") ТОгда
				
				ПутьДляУвед = ПолучитьПутьДляУвед(КаталогЕкода+ИЛНПост+"\4680021979996\OUT\");
				
			КонецЕсли;		   
			//Нечаева 25,10,23 ---
			
			
			
			//Катаев- 24/10/14
			Если ПутьДляУвед = Неопределено ТОгда
				Если кодКонтрагента <> "SSP-4991" Тогда
					#Если клиент Тогда
						Сообщить( Строка(ДокОбъект)+" - не удалось определить путь для сохранения файла подтверждения");
					#КонецЕсли
				конецЕсли;
				
				ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - не удалось определить путь для сохранения файла уведомления","Важное");
				//Катаев+ 06/10/14
				Ошибка = 1;
				//Катаев- 06/10/14
				Возврат;
			КонецЕсли;
			//нечаева 26,08,21+++
			НомерДок =  ДокОбъект.Номер;
			Если кодКонтрагента = "SSP-2450" тогда
				
				НомерДок = Прав(ДокОбъект.номер,СтрДлина(ДокОбъект.номер)-5);		
				
			конецЕсли;	
			
			ИмяФайлаОбмена = ПутьДляУвед+"\"+НомерДок+".xml";
			//нечаева 26,08,21----
			
			//ИмяФайлаОбмена = ПутьДляУвед+"\"+ДокОбъект.Номер+".xml";
		Иначе // филиал
			//Катаев+ 24/10/14
			Если ДокОбъект.Склад.КодФизическогоУзла <> ПланыОбмена.Основной.ЭтотУзел().Код Тогда
				Ошибка = 1;
				Возврат;
			КонецЕсли;
			//Катаев- 24/10/14
			УзелЦО = ПланыОбмена.Основной.НайтиПоКоду("SNL");
			
			//нечаева 12,09,17+++	
			Если докОбъект.контрагент.родитель.код = "SSR-4144" Тогда
				ИЛНПок="9777992579999";
			КонецЕсли;
			
			////Нечаева 13102022+++
			//// Для урал
			//Если ПутьДляУвед = Неопределено и (ИЛНПок = "4620020788939" или ДокОбъект.Контрагент.Родитель.код = "EKF-0488") ТОгда
			//	//   9777992579999 - корневой для Магнолии
			//	ПутьДляУвед = ПолучитьПутьДляУвед(КаталогЕкода+ИЛНПост+"\4607182259835\OUT\");
			//	
			//КонецЕсли;		   
			////Нечаева 13102022---
			
			
			ИмяФайлаОбменаФТП = ""+СокрЛП(ДокОбъект.Номер)+".xml";
			УзелЦО = ПланыОбмена.Основной.НайтиПоКоду("SNL");
			
			//Нечаева 13,12,18+++
			//КаталогFTP = ПолучитьПутьДляУвед("\\srvecode\EdiConnector2\ediECOD\"+ИЛНПост+"\"+ИЛНПок+"\OUT\");
			//для филиала
			КаталогFTP = ПолучитьПутьДляУвед(КаталогЕкодаФТП+ИЛНПост+"\"+ИЛНПок+"\OUT\");
			
			//Нечаева 06022024+++
			// Для урал
			Если КаталогFTP = Неопределено и (ИЛНПок = "4620020788939" или ДокОбъект.Контрагент.Родитель.код = "EKF-0488" Или ИЛНПОк = "4607196314148")
				
				ТОгда
				//   9777992579999 - корневой для Магнолии
				КаталогFTP = ПолучитьПутьДляУвед(КаталогЕкодаФТП+ИЛНПост+"\4607182259835\OUT\");
				
			КонецЕсли;		   
			//Нечаева 060224---
			
			
			//Нечаева 13,12,18---
			Если КаталогFTP = Неопределено ТОгда
				ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - не удалось определить путь для сохранения файла подтверждения","Важное");
				Ошибка = 1;
				Возврат;
			КонецЕсли;
			
			//КаталогFTP="\\srvecode\EdiConnector2\ediECOD\4607182079990EC\"+ИЛНПок+"\OUT\";
			
			// нечаева для магнолии
			//05,12,16++
			//Если докОбъект.контрагент.родитель.код = "SSR-4144" Тогда
			//	КаталогFTP="\\srvecode\EdiConnector2\ediECOD\4607182079990EC\9777992579999\OUT\";
			//КонецЕсли;
			////05,12,16---
			//ИмяФайлаОбмена = КаталогFTP+"\"+СокрЛП(ДокОбъект.Номер)+".xml";
			//нечаева 26,08,21+++
			НомерДок =  ДокОбъект.Номер;
			Если кодКонтрагента = "SSP-2450" тогда
				
				НомерДок = Прав(ДокОбъект.номер,СтрДлина(ДокОбъект.номер)-5);		
				
			конецЕсли;	
			
			ИмяФайлаОбмена = КаталогFTP+"\"+НомерДок+".xml";
			//нечаева 26,08,21----
			
			//нечаева 12,09,17--
			
			
			
		КонецЕсли;
	Иначе
		// для контура
		Если ПланыОбмена.Основной.ЭтотУзел() <> ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
			Если ДокОбъект.Склад.КодФизическогоУзла <> ПланыОбмена.Основной.ЭтотУзел().Код Тогда
				Ошибка = 1;
				Возврат;
			КонецЕсли;
		КонецЕсли;
		КаталогFTP="Outbox";
		// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
		//ПользовательFTP="*%*%*%";
		//ПарольFTP="*$*$*$";
		ПользовательFTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКFTPКонтур).Логин;
		ПарольFTP = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКFTPКонтур).Пароль;
		// Ихсанов Д. А. Конец  14.10.2025
		АдресFTP = "ftp-edi.kontur.ru";
		Соединение=УстановитьFTPСоединение(АдресFTP,ПользовательFTP,ПарольFTP,,Истина);
		Если Соединение=Неопределено Тогда
			Сообщить("Невозможно установить соединение с ftp");
			Ошибка = 1;
			Возврат;
		КонецЕсли;
		Соединение.УстановитьТекущийКаталог(КаталогFTP);
		//Нечаева 20,03,17+++
		ИмяФайлаОбменаФТП = "Пз_"+НомЗ+".xml";
		ИмяФайлаОбмена = КаталогВременныхФайлов()+"Пз_"+НомЗ+"_.xml";
		//Нечаева 20,03,17-
		
	КонецЕсли;
	//Катаев- 14/11/14
	//Катаев- 02/10/14
	ВремФайл = КаталогВременныхФайлов()+ДокОбъект.Номер+".xml";
	
	Ошибка=0;
	
	
	ЗаписьХМЛ=Новый ЗаписьXML;
	ЗаписьХМЛ.ОткрытьФайл(ВремФайл);   //(Путь+Имя+".xml");
	ДокументДом=Новый ДокументDom("","Document-DespatchAdvice");   // "http://v8.1c./8.1/sample91_DOM","Document-Order"
	КорневойЭлемент=ДокументДом.ЭлементДокумента;
	//-------- Order-Header ------------------------------------------
	ЭлементДом=ДокументДом.СоздатьЭлемент("DespatchAdvice-Header");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	//----------------------------------------------------------------
	
	Элемент2=ДокументДом.СоздатьЭлемент("DespatchAdviceNumber");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	
	
	//нечаева 07,02,17++++
	Если  контрагент.ФормироватьСФприОП  Тогда
		
		попытка
			СФ = СчетФактураНакладной(ссылка);
			НомДок = СФ.номер;
		исключение
			ЗаписатьВЛог("Екод","ЗаписьСФвОП + не отправлено! Ошибка записи для РНК - "+Номер+" "+Дата+ОписаниеОшибки(),"Важное");		
			возврат;
			// не отправляем тогда
			
			НомДок = ДокОбъект.Номер;
		конецПопытки;
		
		Если СФ.пустая() Тогда
			
			ЗаписатьВЛог("Екод","ЗаписьСФвОП + не отправлено! Ошибка записи для РНК - "+Номер+" "+Дата+ОписаниеОшибки(),"Важное");		
			возврат;
		иначе
			НомДок = СФ.номер;
		КонецЕсли;
	иначе
		НомДок = ДокОбъект.Номер;
	КонецЕсли;	
	//нечаева 07,02,17 ----
	
	//нечаева 26,08,21+++
	Если кодКонтрагента = "SSP-2450" тогда
		
		НомДок = Прав(ДокОбъект.номер,СтрДлина(ДокОбъект.номер)-5);		
		
	конецЕсли;	
	//нечаева 26,08,21---
	
	
	текстДом=ДокументДом.СоздатьТекстовыйУзел(НомДок);
	//нечаева 23,01,16 -- заменим на номер СФ
	//текстДом=ДокументДом.СоздатьТекстовыйУзел(ДокОбъект.Номер);
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	//------------------------------------------------------------
	
	//нечаева 17,08,16+++ для ленты дата документа = дате отгрузки
	ДатаДок=Формат(ДокОбъект.Дата, "ДФ=""гггг-ММ-дд""");
	// 21,11,16 Нечаева +++ добавила ИП Роздухов
	Если кодКонтрагента = "SSR-1593"  или кодКонтрагента = "SSR-2450"
		// для дикси также   нечавеа 27,10,17+++
		или кодКонтрагента = "SSP-3687"
		// для окей нечаева 30,10,18 ++
		или  кодКонтрагента = "SSP-5862" 
		// для окей нечаева 30,10,18 --
		или  кодКонтрагента = "KRF-0349" 
		// для командора  нечаева 15,07,22 --
		
		
		
		Тогда
		ДатаДок=Формат(ДокОбъект.датаОтгрузки, "ДФ=""гггг-ММ-дд""");
	КонецЕсли;
	//нечаева 17,08,16---
	
	Элемент2=ДокументДом.СоздатьЭлемент("DespatchAdviceDate");  // дата
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаДок));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	
	//Катаев+ 30/10/14 Для 7 континента не выводить.
	Если ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-1973")  Тогда
		//------------------------------------------------------------
		
		Элемент2=ДокументДом.СоздатьЭлемент("DespatchAdviceTime");     // время
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		
		
		//нечаева 05,02,16 +++ для подружки с секундами
		Если  ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-3698")  Тогда
			
			ВремяДок=Формат(ДокОбъект.Дата, "ДФ=""ЧЧ-мм-сс""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
		иначе
			ВремяДок=Формат(ДокОбъект.Дата, "ДФ=""ЧЧ:мм""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
		КонецЕсли;
		//нечаева 05,02,16 ---
		
		текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ВремяДок));
		ТекУзел2.ДобавитьДочерний(ТекстДом);
	КонецЕсли;
	
	
	
	
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("EstimatedDeliveryDate");  // дата
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	//Катаев+ 21/08/14 Если заполнена дата авизации, то ставим ее. Если нет, то дату отгрузки
	//ДатаДок2=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
	Если ДокОбъект.ДатаПриемки = Дата(1,1,1) Тогда
		ДатаДок2=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
	Иначе
		ДатаДок2=Формат(ДокОбъект.ДатаПриемки, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
	КонецЕсли;
	
	
	//Катаев- 21/08/14
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаДок2));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	
	//Катаев+ 30/10/14 Для 7 континента не выводить
	// Кухарь А.Ю. 04.08.2021 начало
	//И для Ашана не выводить
	//	Если ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-1973") Тогда
	Если ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-1973") и ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-2450") Тогда	 
		// Кухарь А.Ю. 04.08.2021 конец
		//------------------------------------------------------------
		Элемент2=ДокументДом.СоздатьЭлемент("EstimatedDeliveryTime");     // время
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		//Катаев+ 21/08/14 Время доставки ставим из пункта доставки.
		//ВремяДок2=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""ЧЧ:мм""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
		//Кухарь 10.02.16 начало
		//Сначала будет проверятся нет ли времени доставки на конкретно эту накладную
		//Если ДокОбъект.ПунктДоставки.ВремяДоставки = Неопределено Тогда
		ВремяДоставки=ПолучитьВремяПриемки(ДокОбъект.ссылка);
		если ВремяДоставки=Справочники.ВремяПриемки.ПустаяСсылка() или ВремяДоставки=Неопределено тогда
			ВремяДоставки		=ДокОбъект.ПунктДоставки.ВремяДоставки;
		КонецЕсли;		
		Если ВремяДоставки = Справочники.ВремяПриемки.ПустаяСсылка() Тогда 
			//Кухарь 10.02.16 конец	
			
			//ВремяДок2=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""ЧЧ:мм""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
			
			//нечаева 05,02,16 +++ для подружки с секундами
			Если  ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-3698")  Тогда
				
				ВремяДок2=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""ЧЧ-мм-сс""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
			иначе
				ВремяДок2=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""ЧЧ:мм""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
			КонецЕсли;
			//нечаева 05,02,16 ---
			
		Иначе
			//ВремяДок2=Формат(ДокОбъект.ПунктДоставки.ВремяДоставки.КонецПериода1, "ДФ=""ЧЧ:мм""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
			
			//нечаева 05,02,16 +++ для подружки с секундами
			Если  ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-3698")  Тогда				
				//Кухарь 10.02.16 начало
				//Время доставки может быть не из пункта доставки
				//ВремяДок2=Формат(ДокОбъект.ПунктДоставки.ВремяДоставки.КонецПериода1, "ДФ=""ЧЧ:мм:сс""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
				ВремяДок2=Формат(ВремяДоставки.КонецПериода1, "ДФ=""ЧЧ-мм-сс""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
				//Кухарь 10.02.16 конец
				
			иначе						
				//Кухарь 10.02.16 начало
				//Время доставки может быть не из пункта доставки
				//ВремяДок2=Формат(ДокОбъект.ПунктДоставки.ВремяДоставки.КонецПериода1, "ДФ=""ЧЧ:мм""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
				ВремяДок2=Формат(ВремяДоставки.КонецПериода1, "ДФ=""ЧЧ:мм""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
				//Кухарь 10.02.16 конец
			КонецЕсли;
			//нечаева 05,02,16 ---
			
			
		КонецЕсли;
		
		
		// для подружки нужно с секундами.
		//нечаева 07,04,15++
		Если кодКонтрагента = "SSP-1973" Тогда
			Если СокрЛП(ВремяДок2)="" Тогда 
				ВремяДок2 = "00:00";
				//ВремяДок22=Формат(ТекущаяДата(), "ДФ=""ЧЧ:мм""");
			конецЕсли;
		иначе
			Если СокрЛП(ВремяДок2)="" Тогда 
				//ВремяДок22 = "00:00";
				
				//нечаева 05,02,16 +++ для подружки с секундами
				Если  кодКонтрагента = "SSP-3698"  Тогда
					ВремяДок22 = "00:00:00";
				иначе
					ВремяДок22 = "00:00";
				КонецЕсли;
				//нечаева 05,02,16 ---
				
			конецЕсли;
		конецЕсли;
		//нечаева 07,04,15 ---
		
		//Катаев- 21/08/14
		текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ВремяДок2));
		ТекУзел2.ДобавитьДочерний(ТекстДом);
		
	КонецЕсли;
	//----------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("BuyerOrderNumber");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(СокрЛП(ДокОбъект.НомерЗаказа));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("BuyerOrderDate");  // дата
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	ДатаДок=Формат(ДокОбъект.ДатаЗаказа, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаДок));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	
	
	//Нечаева 11,03,22++++  для сети Х5
	Если ДокОбъект.Контрагент.родитель = Справочники.Контрагенты.НайтиПоКоду("SSR-4117")  ТОгда
		//----------------------------------------------------------------
		Элемент2=ДокументДом.СоздатьЭлемент("BillOfLadingNumber");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(ДокОбъект.Номер);
		ТекУзел2.ДобавитьДочерний(ТекстДом);
		//------------------------------------------------------------
		Элемент2=ДокументДом.СоздатьЭлемент("BillOfLadingDate");  // дата
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		ДатаДок=Формат(ДокОбъект.Дата, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
		текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаДок));
		ТекУзел2.ДобавитьДочерний(ТекстДом);
	КонецЕсли;
	//нечаева 11,03,22---
	
	
	// Кухарь А.Ю. 04.08.2021 начало
	// Поле для Ашана
	// нечаева 27,02,24++ фикс прайс
	если кодКонтрагента = "SSP-2450"  или кодКонтрагента = "SSR-6999"  тогда
		Элемент2=ДокументДом.СоздатьЭлемент("DocumentFunctionCode");  // дата
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		текстДом=ДокументДом.СоздатьТекстовыйУзел("O");
		ТекУзел2.ДобавитьДочерний(ТекстДом); 
	КонецЕсли;
	// Кухарь А.Ю. 04.08.2021 конец	
	
	//нечаева +++ 19,08,15+
	// для окей - доп поля.
	Если кодКонтрагента = "SSP-5862" Тогда
		// номер накладной
		Элемент2=ДокументДом.СоздатьЭлемент("DespatchNumber");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(ДокОбъект.Номер);
		ТекУзел2.ДобавитьДочерний(ТекстДом);
		//------------------------------------------------------------
		// дата накладной
		Элемент2=ДокументДом.СоздатьЭлемент("DespatchDate");  
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		ДатаДок=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
		текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаДок));
		ТекУзел2.ДобавитьДочерний(ТекстДом);
		
	КонецЕсли;
	//нечаева +++ 19,08,15---
	
	
	//24,04,17++ нечаева
	// для бигбокса дата накладной
	//------------------------------------------------------------
	// дата накладной
	Если кодКонтрагента  = "SSR-6841"  Тогда
		Элемент2=ДокументДом.СоздатьЭлемент("DespatchDate");  
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		ДатаДок=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
		текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаДок));
		ТекУзел2.ДобавитьДочерний(ТекстДом);
	КонецЕсли;
	//24,04,17-- нечаева
	
	//нечаева 27,01,17+++ для табер трейд
	Если кодКонтрагента = "SSP-3698" Тогда
		СФ = неопределено;
		попытка
			СФ = СчетФактураНакладной(ссылка);
			НомДокСФ = СФ.номер;
			ДатаСФ =СФ.дата;
		исключение
			НомДокСФ = "не создана";
			ДатаСФ = ДокОбъект.Дата;
		конецПопытки;
		
		//----------------------------------------------------------------
		Элемент2=ДокументДом.СоздатьЭлемент("InvoiceNumber");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(НомДокСФ);
		ТекУзел2.ДобавитьДочерний(ТекстДом);
		//------------------------------------------------------------
		Элемент2=ДокументДом.СоздатьЭлемент("InvoiceDate");  // дата
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		ДатаСФ=Формат(ДатаСФ, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
		текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаСФ));
		ТекУзел2.ДобавитьДочерний(ТекстДом);
		
	КонецЕсли;
	//нечаева 27,01,17 ---
	
	
	
	
	//Катаев+ 01/12/14 Для Молнии выводим Номер заявки
	Если ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("CHF-0006") Тогда
		НомерЗаявки = ПолучитьНомерЗаявки(ДокОбъект);
		Если Номерзаявки = Неопределено Тогда
			//нечаева 16,04,19
			Если НЕ ОбменДанными.Загрузка Тогда	
				Сообщить("НЕ заполнен номер заявки Молния к РНК, уведомление не отправлено ");
			конецесли ;
			Ошибка = 1;
		Иначе	
			Элемент2=ДокументДом.СоздатьЭлемент("SupplierOrderNumber");
			ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(НомерЗаявки);
			ТекУзел2.ДобавитьДочерний(ТекстДом);
		КонецЕсли;
	КонецЕсли;
	//Катаев- 01/12/14
	
	//Катаев+ 08/12/14 Элемент для перекрестка для Перекрестка
	Если ДокОбъект.Контрагент.Родитель = Справочники.Контрагенты.НайтиПоКоду("SSR-4117") Тогда
		Элемент2=ДокументДом.СоздатьЭлемент("DocumentFunctionCode");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		текстДом=ДокументДом.СоздатьТекстовыйУзел("O");
		ТекУзел2.ДобавитьДочерний(ТекстДом);
	КонецЕсли;
	//Катаев- 08/12/14
	
	
	//Катаев+ 30/10/14 Для 7 континента не выводить
	// Кухарь А.Ю. 04.08.2021 начало
	//И для Ашана не выводить
	//	Если ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-1973") Тогда
	Если ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-1973") и ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-2450") Тогда	 
		// Кухарь А.Ю. 04.08.2021 конец
		//------------------------------------------------------------
		Элемент2=ДокументДом.СоздатьЭлемент("Currency");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		текстДом=ДокументДом.СоздатьТекстовыйУзел("RUR");
		ТекУзел2.ДобавитьДочерний(ТекстДом);
	КонецЕсли;
	
	Если  кодКонтрагента = "SSR-6999"     Тогда
		
		//------------------------------------------------------------
		
		ФиоВодителяСфера = ПолучитьРеквизитРНКПНКПРМ(ДокОбъект.ссылка,"ФиоВодителяСфера");
		МаркаМашиныСфера = ПолучитьРеквизитРНКПНКПРМ(ДокОбъект.ссылка,"МаркаМашиныСфера");
		НомерМашиныСфера = ПолучитьРеквизитРНКПНКПРМ(ДокОбъект.ссылка,"НомерМашиныСфера");
		ТелефонВодителяСФера = ПолучитьРеквизитРНКПНКПРМ(ДокОбъект.ссылка,"ТелефонВодителяСФера");
		НомерПРицепаСфера = ПолучитьРеквизитРНКПНКПРМ(ДокОбъект.ссылка,"НомерПРицепаСфера");
		
		Если ФиоВодителяСфера ="" или ФиоВодителяСфера=неопределено тогда ФиоВодителяСфера = "Иванов Иван Иванович" КонецЕсли;
		Если МаркаМашиныСфера ="" или МаркаМашиныСфера=неопределено тогда МаркаМашиныСфера = "Не известна" КонецЕсли;
		Если НомерМашиныСфера ="" или НомерМашиныСфера=неопределено тогда НомерМашиныСфера = "PP 12345" КонецЕсли;
		Если ТелефонВодителяСФера ="" или ТелефонВодителяСФера=неопределено тогда ТелефонВодителяСФера = "8 999-999-99-99" КонецЕсли;
		Если НомерПРицепаСфера ="" или НомерПРицепаСфера=неопределено тогда НомерПРицепаСфера = "-" КонецЕсли;
		
		
		Элемент2=ДокументДом.СоздатьЭлемент("TransportDetails");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		
		//------------------------------------------------------------
		Элемент3=ДокументДом.СоздатьЭлемент("CarrierName");  
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ФиоВодителяСфера));  // 
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		//----------------------------------------------------------------
		Элемент3=ДокументДом.СоздатьЭлемент("VehicleType");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);                                     
		текстДом=ДокументДом.СоздатьТекстовыйУзел(МаркаМашиныСфера); //     
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		//------------------------------------------------------------
		Элемент3=ДокументДом.СоздатьЭлемент("LicencePlate");  
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(НомерМашиныСфера));  //
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		//----------------------------------------------------------------
		Элемент3=ДокументДом.СоздатьЭлемент("ShipmentIdentifier");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);                                   
		текстДом=ДокументДом.СоздатьТекстовыйУзел(НомерПРицепаСфера); //     
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		//----------------------------------------------------------------
		Элемент3=ДокументДом.СоздатьЭлемент("CarrierPhoneNumber");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);                                     //
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ТелефонВодителяСФера)); //   
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
	КонецЕсли;
	// нечаева 27,02,24 ---
	
	
	
	
	//**********************************************************
	//                второй блок данных
	//**********************************************************
	
	ЭлементДом=ДокументДом.СоздатьЭлемент("DespatchAdvice-Parties");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	//----------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("Buyer");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	
	СписокКодИЛН=ДокОбъект.ПунктДоставки.ИЛН;
	
	//Катаев+ 02/12/13
	//КодИЛН=ДокОбъект.ПунктДоставки.КодИЛН;
	КодИЛН=ДокОбъект.Контрагент.КодИЛН;
	//Катаев- 02/12/13
	
	
	//Нечаева 25,11,16+++
	// для АТАК
	Если кодКонтрагента = "SSR-6556" ТОгда
		
		КодИЛН  = ДокОбъект.ПунктДоставки.КодИЛН;
		
	КонецЕсли;
	//Нечаева 25,11,16---
	
	
	
	// для Ашана
	//нечаева 13,09,21+++	
	Если кодКонтрагента = "SSP-2450" ТОгда
		ПоискНомера=новый Запрос;
		ПоискНомера.Текст="ВЫБРАТЬ
		|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита КАК приемка
		|ИЗ
		|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
		|ГДЕ
		|	РеквизитыРНКПНКПРМ.Документ = &Документ
		|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = &ИмяРеквизита";
		ПоискНомера.УстановитьПараметр("Документ", ЭтотОбъект.ссылка);
		ПоискНомера.УстановитьПараметр("ИмяРеквизита","GLNпокупателя");
		СписокНомеров=ПоискНомера.Выполнить().Выбрать();
		
		Пока СписокНомеров.Следующий() Цикл
			
			КодИЛН= ""+СписокНомеров.приемка;
			
		КонецЦикла;
	КонецЕсли;
	//нечаева 13,09,21 +---	
	
	
	Элемент3=ДокументДом.СоздатьЭлемент("ILN");
	ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(КодИЛН));
	ТекУзел3.ДобавитьДочерний(ТекстДом);
	
	//для виктории	
	//нечаева 02,12,19++ 
	Если кодКонтрагента = "SSR-4726" ТОгда
		Элемент3=ДокументДом.СоздатьЭлемент("TaxID");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(3905069220));
		ТекУзел3.ДобавитьДочерний(ТекстДом);
	КонецЕсли;
	//нечаева 02,12,19*--
	
	//------------------------------------------------------------
	
	Элемент2=ДокументДом.СоздатьЭлемент("Seller");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	
	Элемент3=ДокументДом.СоздатьЭлемент("ILN");
	ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(Лев(ИЛНПост,13));
	ТекУзел3.ДобавитьДочерний(ТекстДом);
	
	// для виктории
	//нечаева 02,12,19++ 
	Если кодКонтрагента = "SSR-4726" ТОгда
		Элемент3=ДокументДом.СоздатьЭлемент("TaxID");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(771711527));
		ТекУзел3.ДобавитьДочерний(ТекстДом);
	КонецЕсли;
	//нечаева 02,12,19---
	
	
	
	//Катаев+ 30/10/14 Для 7 континента не выводить
	Если ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-1973") Тогда
		Элемент3=ДокументДом.СоздатьЭлемент("CodeByBuyer");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.КодПоставщика));
		ТекУзел3.ДобавитьДочерний(ТекстДом);
	КонецЕсли;
	//------------------------------------------------------------
	
	Элемент2=ДокументДом.СоздатьЭлемент("DeliveryPoint");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	
	Элемент3=ДокументДом.СоздатьЭлемент("ILN");
	ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
	КодИЛН=ДокОбъект.ПунктДоставки.КодИЛН;
	текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(КодИЛН));
	ТекУзел3.ДобавитьДочерний(ТекстДом);
	
	//Катаев+ 30/10/14 КПП организации для 7 Континента
	//------------------------------------------------------------
	Если ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-1973") Тогда
		Элемент2=ДокументДом.СоздатьЭлемент("Consignor");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		
		Элемент3=ДокументДом.СоздатьЭлемент("UtilizationRegisterNumber");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.Организация.КПП));
		ТекУзел3.ДобавитьДочерний(ТекстДом);
	КонецЕсли;
	//Катаев- 30/10/14
	
	//Нечаева 19,06,23 +++      Европа курск.
	Если ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SST-0174") Тогда
		Элемент2=ДокументДом.СоздатьЭлемент("Consignor");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		//---
		Элемент3=ДокументДом.СоздатьЭлемент("ILN");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.Организация.GLN));
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		//---
		Элемент3=ДокументДом.СоздатьЭлемент("TaxID");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.Организация.ИНН));
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		//----
		Элемент3=ДокументДом.СоздатьЭлемент("UtilizationRegisterNumber");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.Организация.КПП));
		ТекУзел3.ДобавитьДочерний(ТекстДом);
	КонецЕсли;
	//Нечаева 19,06,23 ---
	
	
	//Катаев+ 02/12/13 Добавляю секцию по ГЛН пункта доставки
	Запрос = Новый запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
	|ГДЕ
	|	РеквизитыРНКПНКПРМ.Документ = &Документ
	|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = &ИмяРеквизита";
	Запрос.УстановитьПараметр("Документ", ДокОбъект.Ссылка);
	Запрос.УстановитьПараметр("ИмяРеквизита", "GLN");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() ТОгда
		КодИЛН_ПД = Выборка.ЗначениеРеквизита;
	Иначе
		КодИЛН_ПД = "";
	КонецЕсли;
	
	//нечаева 11,07,22+++   для командор.
	Если кодКонтрагента = "KRF-0349" ТОгда
		
		Элемент2=ДокументДом.СоздатьЭлемент("Invoicee");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		
		Элемент3=ДокументДом.СоздатьЭлемент("ILN");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.Контрагент.КодИЛН));
		ТекУзел3.ДобавитьДочерний(ТекстДом);
	конецЕсли;
	//нечаева 11,07,22 ---
	
	
	
	//Катаев+ 30/10/14 секцию заполнять если только есть данные
	Если КодИЛН_ПД <> "" Тогда
		
		//  нечаева 28,11,19 +++ виктория
		Если кодКонтрагента = "SSR-4726" ТОгда
			
			Элемент2=ДокументДом.СоздатьЭлемент("Invoicee");
			ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
			
			Элемент3=ДокументДом.СоздатьЭлемент("ILN");
			ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(КодИЛН_ПД));
			ТекУзел3.ДобавитьДочерний(ТекстДом);
		иначе
			Элемент2=ДокументДом.СоздатьЭлемент("UltimateCustomer");
			ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
			
			Элемент3=ДокументДом.СоздатьЭлемент("ILN");
			ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(КодИЛН_ПД));
			ТекУзел3.ДобавитьДочерний(ТекстДом);
			
			
		КонецЕсли;
		//  нечаева 28,11,19 ---
		
		
	КонецЕсли;
	//Катаев- 02/12/13
	
	
	
	// нечаева 11,03,2022 +++ тут товары все собираем.
	ТЗДляОтправки = новый ТаблицаЗначений;
	ТЗДляОтправки = ПолучитьТаблицуТоваровДляУведомления(ДокОбъект);
	КолСтрокТоваров = ТЗДляОтправки.количество();
	// нечаева 11,03,2022 ---
	
	
	
	//Катаев+ 09/10/13 Добавил секцию по упаковке
	ИДУпаковки = 0;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
	|ГДЕ
	|	РеквизитыРНКПНКПРМ.Документ = &Документ
	//Катаев+ 18/12/14 Упаковок может быть несколько
	//|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = &ИмяРеквизита";
	|	И Подстрока(РеквизитыРНКПНКПРМ.ИмяРеквизита,1,21) = &ИмяРеквизита";
	//Катаев- 18/12/14
	Запрос.УстановитьПараметр("Документ", ДокОбъект.Ссылка);
	Запрос.УстановитьПараметр("ИмяРеквизита", "СерийныйНомерУпаковки");
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		Если ДокОбъект.Контрагент.Родитель = Справочники.Контрагенты.НайтиПоКоду("SSR-4117") Тогда
			НеобходимоПалетов = 0;
			Для Каждого стр из ТЗДляОтправки Цикл
				Если стр.Количество > 0 Тогда
					НеобходимоПалетов = НеобходимоПалетов+1;
				КонецЕсли;
			КонецЦикла;
			//нечаева это для упаковки паллет 25,05,18+++
			НеобходимоПалетов = НеобходимоПалетов+1;// 
			//нечаева 23,01,19++
			Если НеобходимоПалетов > Выборка.Количество() Тогда
				//нечаева 23,01,19--
				ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - Количество палетов не совпадает с количеством SSCC кодов. Необходимо - "+Строка(НеобходимоПалетов)+". Внесено SSCC кодов - "+Строка(Выборка.Количество()),"Важное");
				Ошибка=1;
				Возврат;
			КонецЕсли;
			//нечаева это для упаковки паллет 25,05,18---
			
		Иначе
			Если Выборка.Количество() <> 1 Тогда
				ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - Количество палетов не совпадает с количеством SSCC кодов. Необходимо - 1. Внесено SSCC кодов - "+Строка(Выборка.Количество()),"Важное");
				Ошибка=1;
				Возврат;
			КонецЕсли;
		КонецЕсли;
		//Создаем корневую секцию
		ЭлементДом=ДокументДом.СоздатьЭлемент("DespatchAdvice-Consignment");
		ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
		Элемент=ДокументДом.СоздатьЭлемент("Packing-Sequence");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент);
		
		Элемент=ДокументДом.СоздатьЭлемент("PackageId");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел("1");                 
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		ИДУпаковки = 2;
		ИДУпаковки1 = 2;
		
		КолСтрокТоваров =КолСтрокТоваров+1 ; // для паллет тоже нужен паллет, по условиям Х5 
		КонтрагентРодитель = ДокОбъект.Контрагент.Родитель;
		
		Пока Выборка.Следующий() Цикл
			ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
			Элемент=ДокументДом.СоздатьЭлемент("Packing-Sequence");
			ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент);
			
			Элемент=ДокументДом.СоздатьЭлемент("PackageId");
			ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ИДУпаковки));                 
			ТекУзел3.ДобавитьДочерний(ТекстДом);
			
			Элемент=ДокументДом.СоздатьЭлемент("ParentId");
			ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
			текстДом=ДокументДом.СоздатьТекстовыйУзел("1");
			ТекУзел3.ДобавитьДочерний(ТекстДом);
			
			Если КонтрагентРодитель = Справочники.Контрагенты.НайтиПоКоду("SSR-4117") Тогда
				Элемент=ДокументДом.СоздатьЭлемент("PackageNumber");
				ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел("1");
				ТекУзел3.ДобавитьДочерний(ТекстДом);
			КонецЕсли;
			
			Элемент=ДокументДом.СоздатьЭлемент("PackageType");
			ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
			Если КонтрагентРодитель = Справочники.Контрагенты.НайтиПоКоду("SSR-4117") Тогда
				текстДом=ДокументДом.СоздатьТекстовыйУзел("201");
			Иначе
				текстДом=ДокументДом.СоздатьТекстовыйУзел("09");
			КонецЕсли;
			ТекУзел3.ДобавитьДочерний(ТекстДом);
			
			Элемент=ДокументДом.СоздатьЭлемент("SerialNumber");
			ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Выборка.ЗначениеРеквизита);                 
			ТекУзел3.ДобавитьДочерний(ТекстДом);
			
			// Кухарь А.Ю. 11.08.2021 начало
			// Если ДокОбъект.Контрагент.Родитель <> Справочники.Контрагенты.НайтиПоКоду("SSR-4117") Тогда
			Если КонтрагентРодитель <> Справочники.Контрагенты.НайтиПоКоду("SSR-4117") 
				и ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-2450") 
				Тогда				 
				// Кухарь А.Ю. 11.08.2021 конец
				
				Элемент=ДокументДом.СоздатьЭлемент("DeliveryPlace");
				ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
				//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(КодИЛН));  //было               
				
				// Для Ленты пишем код конечного покупателя, если есть
				//нечаева 17,06,15 +++
				// для Ленты
				Если КонтрагентРодитель = Справочники.Контрагенты.НайтиПоКоду("SSR-4123") Тогда
					Если Строка(КодИЛН_ПД)<>"" Тогда
						текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(КодИЛН_ПД));                 
					Иначе
						#если Клиент Тогда
							Сообщить("Документ "+ДокОбъект+"- Нет данных по GLN конечного покупателя, Уведомление об отгрузке не отправлено!");
						#КонецЕсли
						Ошибка = 1;
						возврат;
					КонецЕсли;	
				Иначе
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(КодИЛН));                 
				КонецЕсли;	
				//нечаева 17,06,15 ---
				
				
				ТекУзел3.ДобавитьДочерний(ТекстДом);
			КонецЕсли;
			
			ИДУпаковки = ИДУпаковки+1;
			
			// для х5 кол-во паллет передаем по количеству свернутых строк.  нечаева 11,03,22++
			КолСтрокТоваров =  КолСтрокТоваров - 1;
			
			Если КолСтрокТоваров =0 и КонтрагентРодитель = Справочники.Контрагенты.НайтиПоКоду("SSR-4117")  Тогда
				прервать;
			КонецЕсли;	
			
		КонецЦикла;
	КонецЕсли;
	//Катаев- 18/12/14
	
	//-------------------------
	//    заполнение строк
	//-------------------------
	ЭлементДом=ДокументДом.СоздатьЭлемент("DespatchAdvice-Lines");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	
	тз = ДокОбъект.Товары.Выгрузить();
	
	
	рр = 1;
	колдок = 0;
	ОбщаяСумма=0;
	ОбщаяСуммаСНДС = 0;
	ОбщаяНДС = 0;
	
	
	// в ТЗ Для Отправки добавим  паллету для перекрестка                                  //нечаева 16,06,17 +++
	Если ДокОбъект.Контрагент.отправлятьУПД = истина и ДокОбъект.количествоПаллет>0 и ДокОбъект.Контрагент.родитель.код = "SSR-4117"  Тогда
		
		
		НовСтр = тзДляОтправки.добавить();
		
		НовСтр.НомерСтроки = ТЗДляОтправки.количество()+1;
		
		НовСтр.АртикулКонтрагента = "3354748";
		НовСтр.Номенклатура  = справочники.Номенклатура.НайтиПоКоду("ODB-000325");
		НовСтр.количество =   ДокОбъект.количествоПаллет;
		НовСтр.Цена = 0;
		НовСтр.Всего = 0;
		НовСтр.СтавкаНДС=0;
		НовСтр.ШККонтрагента ="3354748";
		
		НовСтр.Ндс = 0;
		НовСтр.Сумма = 0;
		НовСтр.Кратность = 1;
		
	КонецЕсли;
	//нечаева 11,03,22 -----
	
	
	
	Для Каждого ТекСтрока из тзДляОтправки Цикл
		// нечаева 06,04,015 --------	
		
		
		
		//Катаев+ 31/10/14 Для 7 континента не пропускаем
		//Если ТекСтрока.Количество<=0 Тогда                                                                      //27,02,17+++ нечаева 
		Если ТекСтрока.Количество<=0 И кодКонтрагента  <> "SSP-1973" 
			И ДокОбъект.Контрагент.родитель.код  <>  "SSP-3674" 
			//21,08,17 ++ нечаева для тандера
			И кодКонтрагента  <> "SSP-3881"
			//21,08,17 -- нечаева для тандера
			//нечаева 10,12,20+++
			и кодКонтрагента <> "SSR-3546"
			//нечаева 14,09,22+++
			И ДокОбъект.Контрагент.родитель.код  <>  "SSR-4117" // х5 
			и кодКонтрагента <> "KRF-0349" //командор
			И кодКонтрагента <> "EKF-1242" //урал логистик , Нечаева 27,03,24+++
			
			Тогда
			//Катаев- 31/10/14                                                                                   //27,02,17--- нечаева 
			Продолжить;
		КонецЕсли; 
		Если ТекСтрока.ШККонтрагента="" Тогда
			ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - Для номенклатуры - "+ТекСтрока.Номенклатура+" - не определен штрихкод, для выгрузки в Е-код!!! (Заполните Документ Матрица)","Важное");
			Сообщить("Для номенклатуры - "+ТекСтрока.Номенклатура+" - не определен штрихкод, для выгрузки в Е-код!!! (Заполните Документ Матрица)");
			Ошибка=1;
			Продолжить;
		КонецЕсли;
		
		//нечаева 24,10,24+++ добавила для метро 
		Если ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSR-1593")
			и ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-8643") 
			// нечаева 24,10,24---
			Тогда
			ШтукВУпаковке = 1;
			КодУпаковки = "PCE";
		Иначе
			//Катаев+ 07/10/14 Если в матрице есть крмтность, то берем ее, иначе из номенклатуры
			//ШтукВУпаковке = ТекСтрока.Номенклатура.Родитель.ШтукВКоробочке;
			Если ТекСтрока.Кратность > 0 Тогда
				ШтукВУпаковке = ТекСтрока.Кратность;
			Иначе
				ШтукВУпаковке = ТекСтрока.Номенклатура.Родитель.ШтукВКоробочке;
			Конецесли;
			//Катаев- 07/10/14
			Если ШтукВУпаковке = 0 Тогда
				ШтукВУпаковке = 1;
			КонецЕсли;
			КодУпаковки = "CT";
		Конецесли;
		//Катаев- 20/02/14
		
		Элемент=ДокументДом.СоздатьЭлемент("Line");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент);
		//----------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("Line-Item");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		
		
		Элемент=ДокументДом.СоздатьЭлемент("LineNumber");
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(рр));                 
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		// нечаева 19,06,23+++
		Если НЕ кодКонтрагента  = "SSR-6841"  ТОгда
			
			Элемент=ДокументДом.СоздатьЭлемент("OrderLineNumber");
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(рр));                 
			ТекУзел4.ДобавитьДочерний(ТекстДом);
		конецЕсли;
		// нечаева 19,06,23--
		//---------------------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("EAN");  //штрихкод
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		//нечаева 08,06,17+++
		текстДом=ДокументДом.СоздатьТекстовыйУзел(СокрЛП(ТекСтрока.ШККонтрагента));                      
		//нечаева 08,06,17---
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		//----------------------------------------------------------
		Если Не ПустаяСтрока(ТекСтрока.АртикулКонтрагента) Тогда
			Элемент=ДокументДом.СоздатьЭлемент("BuyerItemCode");  //ариткул
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			//нечаева 08,06,17+++
			текстДом=ДокументДом.СоздатьТекстовыйУзел(СокрЛП(ТекСтрока.АртикулКонтрагента));                     
			//нечаева 08,06,17---
			ТекУзел4.ДобавитьДочерний(ТекстДом);
		КонецЕсли;
		
		//Катаев+ 30/10/14 Для 7 континента и Подружки( табер трейд) не выводить
		Если кодКонтрагента <> "SSP-1973"
			
			и  кодКонтрагента <> "SSP-3698" 
			//нечаева 24,04,17+++ бигбокс
			и не кодКонтрагента  = "SSR-6841"
			//тандер
			и не кодКонтрагента  = "SSP-3881"
			Тогда
			
			Элемент3=ДокументДом.СоздатьЭлемент("SupplierItemCode");
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент3);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Текстрока.Номенклатура.код);
			ТекУзел4.ДобавитьДочерний(ТекстДом);
			
		КонецЕсли;
		//----------------------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("DespatchedQuantity");  //коли отправ
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		Кол=ЗаменитьТочку(ТекСтрока.Количество/ШтукВУпаковке,3);
		
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Кол));
		колДок = КолДок+ТекСтрока.Количество/ШтукВУпаковке;
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		//----------------------------------------------------------
		Заявка=ЗаменитьТочку(ТекСтрока.Заявка/ШтукВУпаковке,3);
		
		//Катаев+ 30/10/14 Для 7 континента не выводить
		Если ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-1973") Тогда
			
			Элемент=ДокументДом.СоздатьЭлемент("OrderedQuantity");  //штрихкод
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Заявка));
			ТекУзел4.ДобавитьДочерний(ТекстДом);
			
			//катаев+ 30/10/13 Количество в упаковке
			//----------------------------------------------------------
			Заявка=ЗаменитьТочку(ТекСтрока.Заявка,3);
			
			// Кухарь А.Ю. 04.08.2021 начало
			// + Ашан
			////нечаева 05,02,16+++
			//Если   ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-3698") 	//нечаева 24,04,17++ бигбокс
			//	и не ДокОбъект.Контрагент.код  = "SSR-6841"  Тогда
			//	// нечаева 24,04,17---
			//нечаева 05,02,16+++
			Если   ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-3698") 	//нечаева 24,04,17++ бигбокс
				и не кодКонтрагента  = "SSR-6841"  и ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-2450") Тогда
				// нечаева 24,04,17---		 
				// Кухарь А.Ю. 04.08.2021 конец
				
				Элемент=ДокументДом.СоздатьЭлемент("OrderedUnitPacksize");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ШтукВУпаковке));                     
				ТекУзел4.ДобавитьДочерний(ТекстДом);
				
			КонецЕсли;
			//нечаева 05,02,15 ---
			
			// Кухарь А.Ю. 04.08.2021 начало
			// Поле для Ашана
			Если   ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-2450") тогда	//Ашан
				Элемент=ДокументДом.СоздатьЭлемент("DespatchedUnitPacksize");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ШтукВУпаковке)+".000");                     
				ТекУзел4.ДобавитьДочерний(ТекстДом);			
			КонецЕсли;		 
			// Кухарь А.Ю. 04.08.2021 конец			
			
		КонецЕсли;
		//катаев+ 30/10/13 Количество в упаковке
		//----------------------------------------------------------
		
		//Для подружки не надо (табер трейд)
		//нечаева 05,02,16+++
		Если   ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-3698")  Тогда
			
			
			Элемент=ДокументДом.СоздатьЭлемент("UnitOfMeasure");  //штрихкод
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			//Катаев+ 20/02/14
			//текстДом=ДокументДом.СоздатьТекстовыйУзел("CT");                     
			текстДом=ДокументДом.СоздатьТекстовыйУзел(КодУпаковки);                     
			//Катаев- 20/02/14
			ТекУзел4.ДобавитьДочерний(ТекстДом);
		кОНЕЦеСЛИ;
		
		//----------------------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("ItemDescription");  // наименование номенклатуры
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		//Катаев+ 30/10/13 Если заполнено наименование контрагента, то выводить его
		//текстДом=ДокументДом.СоздатьТекстовыйУзел(ТекСтрока.Номенклатура.Наименование);                      
		Если ПустаяСтрока(ТекСтрока.НаименованиеКонтрагента) Тогда
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Лев(ТекСтрока.Номенклатура.Наименование,70));
		Иначе
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Лев(ТекСтрока.НаименованиеКонтрагента,70));
		КонецЕсли;
		//Катаев- 30/10/13
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		Если ТекСтрока.Количество = 0 Тогда
			Цена = ЗаменитьТочку(ТекСтрока.Цена,2);
		Иначе
			Цена = ЗаменитьТочку(Окр(ТекСтрока.Сумма/ТекСтрока.Количество,2,0),2);
		КонецЕсли;
		//Катаев- 19/12/14
		//Катаев- 21/08/14
		
		
		//Для подружки не надо (табер трейд)
		//нечаева 05,02,16+++
		//	Если   ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-3698")  Тогда
		
		Элемент=ДокументДом.СоздатьЭлемент("UnitNetPrice");  // цена без ндс
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(цена));                      
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		//	КонецЕсли;
		
		
		кодКонтрагента = ДокОбъект.Контрагент.код ;
		
		//Катаев+ 27/10/14 Для 7 континета и Молнии добавил обяхательные поля
		Если кодКонтрагента = "SSP-1973" ИЛИ кодКонтрагента = "CHF-0006"
			// нечаева 21.09,15 +++
			или кодКонтрагента = "SSR-6024"// для красного яра.
			или кодКонтрагента= "SSR-6042"// для красного яра.
			// нечаева 21.09,15 ---
			//нечаева 24,04,17++ бигбокс
			или  кодКонтрагента  = "SSR-6841"  
			// нечаева 24,04,17---
			
			//нечаева 11,07,17++ тандер
			или  кодКонтрагента  = "SSP-3881"  
			// нечаева 11,07,17---
			
			//виктория 
			//нечаева 02,12,19++ 
			или  кодКонтрагента  = "SSR-4726"  
			//нечаева 02,12,19---
			
			//03,02,21+++ нечаева тс лама еврологистик
			или кодКонтрагента  = "SSR-6974" 
			//03,02,21---
			
			//12.07.22+++ нечаева командор
			или  кодКонтрагента = "KRF-0349" 
			//12.07.22---
			//нечаева 19,06,23++
			или   кодКонтрагента = "SST-0174"   // европа курск
			или  кодКонтрагента = "SSR-6999"   // фикс прайс нечаева 27,02,24+++
			
			// нечаева 19,06,23---
			Тогда 
			Элемент=ДокументДом.СоздатьЭлемент("UnitGrossPrice"); //Цена с НДС
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			Цена= ЗаменитьТочку(ТекСтрока.Цена,2);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
			ТекУзел4.ДобавитьДочерний(ТекстДом);
			
			Элемент=ДокументДом.СоздатьЭлемент("TaxAmount"); //Сумма НДС
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			Цена= ЗаменитьТочку(ТекСтрока.НДС,2);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
			ТекУзел4.ДобавитьДочерний(ТекстДом);
		КонецЕсли;
		//Катаев- 27/10/14
		
		
		//Нечаева + 04,02.16  Для Табре трейд (подружка)
		Если 	кодКонтрагента = "SSP-3698"	или 
			кодКонтрагента = "SSR-9999" //сладкая жизнь плюс нечаева 06,040,23+++
			Тогда 
			
			Элемент=ДокументДом.СоздатьЭлемент("TaxAmount"); //Сумма НДС
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			Цена= ЗаменитьТочку(ТекСтрока.НДС,2);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
			ТекУзел4.ДобавитьДочерний(ТекстДом);
			
			Элемент=ДокументДом.СоздатьЭлемент("UnitGrossPrice"); //Цена с НДС
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			Цена= ЗаменитьТочку(ТекСтрока.Цена,2);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
			ТекУзел4.ДобавитьДочерний(ТекстДом);
			
		КонецЕсли;
		//Нечаева --- 04,02.16
		
		
		
		// Сумма без НДС
		Сумма = ТекСтрока.Сумма;
		//Катаев- 21/08/14
		Цена= ЗаменитьТочку(Сумма,2);
		
		//Катаев+ 30/10/14 Для 7 континента не выводить
		Если кодКонтрагента <> "SSP-1973"
			
			// Кухарь А.Ю. 04.08.2021 начало
			// Для Ашана не надо
			и кодКонтрагента <> "SSP-2450" 
			
			тогда
			
			// Кухарь А.Ю. 04.08.2021 конец	
			//Для подружки не надо (табер трейд)
			//нечаева 05,02,16+++
			//и   ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-3698")  Тогда
			//нечаева 05,02,16---
			Элемент=ДокументДом.СоздатьЭлемент("NetAmount");  // сумма без ндс
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
			ТекУзел4.ДобавитьДочерний(ТекстДом);
		КонецЕсли;
		
		ОбщаяСумма=ОбщаяСумма+Сумма;
		//нечаева 19,08,15++
		ОбщаяСуммаСНДС = ОбщаяСуммаСНДС+ТекСтрока.Всего;
		ОбщаяНДС = ОбщаяНДС+ТекСтрока.НДС;
		//нечаева 19,08,15--
		
		Цена= ЗаменитьТочку(ТекСтрока.Всего,2); //Катаев+ 21/08/14
		// Кухарь А.Ю. 04.08.2021 начало
		// Для Ашана не нужно
		если кодКонтрагента <> "SSP-2450" тогда
			// Кухарь А.Ю. 04.08.2021 конец	
			Элемент=ДокументДом.СоздатьЭлемент("GrossAmount");
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
			ТекУзел4.ДобавитьДочерний(ТекстДом);
			//Катаев- 30/10/13
			//Катаев+ 01/11/13
			// Кухарь А.Ю. 04.08.2021 начало
			//
		КонецЕсли; 
		// Кухарь А.Ю. 04.08.2021 конец	
		
		
		
		если кодКонтрагента = "SSP-3698" тогда 
			// Кухарь А.Ю. 04.08.2021 конец			
			Элемент=ДокументДом.СоздатьЭлемент("TaxRate");
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			//Катаев+ 21/08/14 Ставку НДМ берем тоже из документа
			//текстДом=ДокументДом.СоздатьТекстовыйУзел("18.00");                      
			Если ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
				НДС_Текст = "10.00";
			ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
				НДС_Текст = "18.00";
			ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
				НДС_Текст = "20.00"; 
				//Валетов +	20,01,2026 ПУСТАЯ ЗАДАЧА  Добавить везде Ставку НДС 22
			ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС22 Тогда
				НДС_Текст = "22.00";
				//Валетов - 	
			ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
				НДС_Текст = "0.00";
			Иначе
				НДС_Текст = "Без НДС";
			КонецЕсли;
			//нечаева 16,11,17+++
			Если  ТекСтрока.ШККонтрагента ="3354748"    Тогда
				НДС_Текст = "0.00";
			КонецЕсли;	
			//нечаева 16,11,17---
			
			
			текстДом=ДокументДом.СоздатьТекстовыйУзел(НДС_Текст);
			ТекУзел4.ДобавитьДочерний(ТекстДом);
			//Катаев- 01/11/13
			
			// Кухарь А.Ю. 04.08.2021 начало
			// Для Ашана не нужно
		КонецЕсли;
		// Кухарь А.Ю. 04.08.2021 конец		
		
		
		
		//Для подружки не надо (табер трейд)
		//нечаева 05,02,16+++
		Если   кодКонтрагента<> "SSP-3698"  Тогда
			// Кухарь А.Ю. 04.08.2021 начало
			// Для Ашана не нужно
			если кодКонтрагента <> "SSP-2450" тогда 
				// Кухарь А.Ю. 04.08.2021 конец			
				Элемент=ДокументДом.СоздатьЭлемент("TaxRate");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				//Катаев+ 21/08/14 Ставку НДМ берем тоже из документа
				//текстДом=ДокументДом.СоздатьТекстовыйУзел("18.00");                      
				Если ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
					НДС_Текст = "10.00";
				ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
					НДС_Текст = "18.00";
				ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
					НДС_Текст = "20.00";
				ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
					НДС_Текст = "0.00";
				Иначе
					НДС_Текст = "Без НДС";
				КонецЕсли;
				//нечаева 16,11,17+++
				Если  ТекСтрока.ШККонтрагента ="3354748"    Тогда
					НДС_Текст = "0.00";
				КонецЕсли;	
				//нечаева 16,11,17---
				
				
				текстДом=ДокументДом.СоздатьТекстовыйУзел(НДС_Текст);
				ТекУзел4.ДобавитьДочерний(ТекстДом);
				//Катаев- 01/11/13
				
				// Кухарь А.Ю. 04.08.2021 начало
				// Для Ашана не нужно
			КонецЕсли;
			// Кухарь А.Ю. 04.08.2021 конец		
			
			
			//нечаева 15,09,23++
			// для авоськи ExpiryDate
			если кодКонтрагента = "SSP-2812" тогда
				
				Элемент=ДокументДом.СоздатьЭлемент("ExpiryDate");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка("2099-01-31"));                      
				ТекУзел4.ДобавитьДочерний(ТекстДом);
				
				// дата производства  ProductionDate
				Дата1=Формат(ДобавитьМЕсяц(ТекущаяДата(),-3), "ДФ=""гггг-ММ-дд""");
				
				Элемент=ДокументДом.СоздатьЭлемент("ProductionDate");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Дата1));                      
				ТекУзел4.ДобавитьДочерний(ТекстДом);
				
				
			КонецЕсли; 
			
			
			
			//----------------------------------------------------------
			//ГТД
			
			ГТД=ПолучитьГрупповойПериодическийРеквизит(ТекСтрока.Номенклатура.Родитель,"НомерГТД",ТекущаяДата());
			
			Если ГТД = Неопределено или ГТД.СтранаПроисхождения.Наименование="РОССИЯ" Тогда
				//--------------------------------------------------------------------------------
				Элемент=ДокументДом.СоздатьЭлемент("CountryOfOriginCode");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел("RU");                      
				ТекУзел4.ДобавитьДочерний(ТекстДом);
			Иначе
				Если Врег(""+ГТД.СтранаПроисхождения)<>"РОССИЯ" И НЕ ПустаяСтрока(""+ГТД.СтранаПроисхождения) Тогда
					Страна		=""+ГТД.СтранаПроисхождения;
					НомерГТД	=СокрЛП(""+ГТД.Наименование);
				КонецЕсли;
				Если НомерГТД="" Тогда
					Сообщить("Для номенклатуры - "+ТекСтрока.Номенклатура+" - не определен номер ГТД! ");
					ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - Для номенклатуры - "+ТекСтрока.Номенклатура+" - не определен номер ГТД!","Важное");
					Ошибка=1;
				КонецЕсли;	
				
				//--------------------------------------------------------------------------------
				// ищем номер страны для гтд
				//--------------------------------------------------------------------------------
				Макет=Справочники.КлассификаторСтранМира.ПолучитьМакет("КлассификаторСтранМира");
				Искомое2 = СокрЛП(Страна);  //значение в макете есть, не находит
				Искомое = Макет.НайтиТекст(Искомое2); //,, ОбластьПоиска);
				Если Искомое<>Неопределено ТОгда
					Строка=Искомое.Низ;
					Колонка=Искомое.Лево+1; // для кода
				КонецЕсли;
				// получаем код
				
				Страна=Макет.Область(Строка,Колонка).Текст;
				//--------------------------------------------------------------------------------
				Элемент=ДокументДом.СоздатьЭлемент("CountryOfOriginCode");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Страна));                      
				ТекУзел4.ДобавитьДочерний(ТекстДом);
				
				//----------------------------------------------------------
				Элемент=ДокументДом.СоздатьЭлемент("CustomsDeclarationNumber");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(НомерГТД));                      
				ТекУзел4.ДобавитьДочерний(ТекстДом);
				
				
			КонецЕсли; 
			// нечаева 05,05,16---
			
			
			
			//Катаев+ 10/10/13 Если есть упаковка, то помещаем номенклатуру в нее
			Если ИДУпаковки <> 0 Тогда
				
				//Нечаева 16,04,18+++
				//для паллет по Перекрестку не прописываем SSCC коды.
				//Если  НЕ (Контрагент.родитель.код = "SSR-4117" и ТекСтрока.ШККонтрагента ="3354748") Тогда
				
				
				Элемент=ДокументДом.СоздатьЭлемент("Package-Reference");
				ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
				
				Элемент=ДокументДом.СоздатьЭлемент("PackageId");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				//Катаев+ 18/12/14 Если это Перекресток, то каждую позицию помещаем на отдельный палет.
				//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ИДУпаковки));                      
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ИДУпаковки1));
				Если ДокОбъект.Контрагент.Родитель = Справочники.Контрагенты.НайтиПоКоду("SSR-4117") Тогда 
					ИДУпаковки1 = ИДУпаковки1+1
				КонецЕсли;
				//Катаев- 18/12/14
				ТекУзел4.ДобавитьДочерний(ТекстДом);
				
				Элемент=ДокументДом.СоздатьЭлемент("Quantity");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				//Катаев+ 19/12/14
				//Кол=ЗаменитьТочку(ТекСтрока.Количество,3);
				//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Кол/ШтукВУпаковке));                     
				Кол=ЗаменитьТочку(ТекСтрока.Количество/ШтукВУпаковке,3);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Кол));                     
				//Катаев- 19/12/14
				ТекУзел4.ДобавитьДочерний(ТекстДом);
				//КонецЕсли;
				//нечаева 16,04,18---
			КонецЕсли;
			//Катаев- 10/10/13
			
			
			// код производителя для авоськи
			//Line-Parties
			//нечаева 15,09,23+++
			если кодКонтрагента = "SSP-2812" тогда
				//Наименование производителя – из декларации, импортер – из ГТД
				ОтборДляГТД = неопределено; Декларация=Неопределено;
				Модель = Текстрока.Номенклатура.родитель; 
				//если ЗначениеЗаполнено(Страна) тогда
				//	ОтборДляГТД=новый Структура;
				//	ОтборДляГТД.Вставить("Страна",Страна);
				//иначе 
				//	ОтборДляГТД = Неопределено;
				//КонецЕсли;
				
				если Декларация=Неопределено тогда
					Декларация = ПолучитьПериодическийРеквизит(Модель,"Декларация",ТекущаяДата(),,,ОтборДляГТД);
				КонецЕсли;
				
				Изготовитель= неопределено;
				Если декларация <> Неопределено тогда
					НомерДекларации = декларация.Наименование;
					Изготовитель = декларация.Изготовитель;
					Орган = декларация.Орган;
					ФабрикаИзготовитель = декларация.Филиал;
					если СокрЛП(декларация.Филиал) <> "" и СокрЛП(декларация.Изготовитель)<>СокрЛП(декларация.Филиал)  тогда
						Филиал= "Предприятие-изготовитель: " + декларация.Филиал;
					иначе Филиал = ""
					КонецЕсли;
					ВидДокумента = декларация.ВидДокумента;	
					ДатаНачалаДекларации = Формат(декларация.ДатаНачала,"ДФ=dd.MM.yy");
					ДатаОкончанияДекларации = Формат(декларация.ДатаОкончания,"ДФ=dd.MM.yy");
				иначе
					//Сообщить("На позицию "+Номенклатура+" не установлена действующая декларация");	
				КонецЕсли;
				
				
				
				
				Элемент=ДокументДом.СоздатьЭлемент("Line-Parties");
				ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
				
				Элемент=ДокументДом.СоздатьЭлемент("Manufacturer");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				//ТекУзел4.ДобавитьДочерний(ТекстДом);
				
				//--------------------------------------------------------------------------------
				Элемент=ДокументДом.СоздатьЭлемент("Name");
				ТекУзел5=ТекУзел4.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Изготовитель));                      
				ТекУзел5.ДобавитьДочерний(ТекстДом);
				//--------------------------------------------------------------------------------
				//Элемент=ДокументДом.СоздатьЭлемент("FiscalNumber");
				//ТекУзел5=ТекУзел4.ДобавитьДочерний(Элемент);
				//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Страна));                      
				//ТекУзел5.ДобавитьДочерний(ТекстДом);
				////--------------------------------------------------------------------------------
				//Элемент=ДокументДом.СоздатьЭлемент("UtilizationRegisterNumber");
				//ТекУзел5=ТекУзел4.ДобавитьДочерний(Элемент);
				//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Страна));                      
				//ТекУзел5.ДобавитьДочерний(ТекстДом);
				
			КонецЕсли;
			//-------------------------------------------------------------------------
			
			
			
		КонецЕсли;
		
		РР=РР+1;
		
	КонецЦикла;
	
	Если Ошибка = 0 Тогда
		
		//Катаев+ 30/10/14 Для 7 континента не выводить
		Если ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-1973") Тогда
			КорневойЭлемент=ДокументДом.ЭлементДокумента;
			//-------- Order-Header ------------------------------------------
			ЭлементДом=ДокументДом.СоздатьЭлемент("DespatchAdvice-Summary");
			ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
			
			//Катаев+ 08/12/14 для Перекрестка вывод другого элемнета в подвале
			Если ДокОбъект.Контрагент.Родитель = Справочники.Контрагенты.НайтиПоКоду("SSR-4117") Тогда
				рр = рр-1;
				Элемент2=ДокументДом.СоздатьЭлемент("TotalLines");
				ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(рр));
				ТекУзел2.ДобавитьДочерний(ТекстДом);
			Иначе
				//----------------------------------------------------------------
				
				
				//Для подружки
				//Для подружки надо (табер трейд)
				//нечаева 05,02,16+++
				Если   ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-3698")  Тогда
					
					Элемент2=ДокументДом.СоздатьЭлемент("TotalAmount");
					ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
					ОбщаяСумма=ЗаменитьТочку(ОбщаяСумма,2);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ОбщаяСумма));
					ТекУзел2.ДобавитьДочерний(ТекстДом);
					
				КонецЕсли;
				
				
				//------------------------------------------------------------
				Элемент2=ДокументДом.СоздатьЭлемент("TotalQuantity");  // общее количество
				ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
				колДок=ЗаменитьТочку(колДок,2);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(КолДок));
				ТекУзел2.ДобавитьДочерний(ТекстДом);
				//------------------------------------------------------------
				
				// для окей 
				// нечаева 19,08,15+++
				Если ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-5862")
					или  // европа курск  нечаева 19,06,23++
					ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SST-0174")
					Тогда
					рр = рр-1;
					Элемент2=ДокументДом.СоздатьЭлемент("TotalLines");
					ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(рр));
					ТекУзел2.ДобавитьДочерний(ТекстДом);
					//------------------------------------------------------------
					//TotalGrossAmount - общая сумма с НДС
					
					Элемент2=ДокументДом.СоздатьЭлемент("TotalGrossAmount");
					ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
					ОбщаяСуммаСНДС=ЗаменитьТочку(ОбщаяСуммаСНДС,2);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ОбщаяСуммаСНдс));
					ТекУзел2.ДобавитьДочерний(ТекстДом);
					
					//------------------------------------------------------------
					//сумма НДС
					Элемент2=ДокументДом.СоздатьЭлемент("TotalTaxAmount");
					ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
					ОбщаяНДС=ЗаменитьТочку(ОбщаяНДС,2);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ОбщаяНДС));
					ТекУзел2.ДобавитьДочерний(ТекстДом);
					
				КонецЕсли;
				// нечаева 19,08,15---
				
				
				
				//Для подружки
				//Для подружки надо (табер трейд)
				//нечаева 05,02,16+++
				Если   ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-3698")
					//нечаева 24,04,17++ бигбокс
					или  кодКонтрагента  = "SSR-6841"  
					// нечаева 24,04,17---
					//командор
					или  кодКонтрагента  = "KRF-0349" 
					Тогда
					
					//TotalGrossAmount - общая сумма с НДС
					
					Элемент2=ДокументДом.СоздатьЭлемент("TotalGrossAmount");
					ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
					ОбщаяСуммаСНДС=ЗаменитьТочку(ОбщаяСуммаСНДС,2);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ОбщаяСуммаСНдс));
					ТекУзел2.ДобавитьДочерний(ТекстДом);
				КонецЕсли;			
				
				
				//нечаева 11,07,17 +++   тандер
				Если   ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-3881") 
					или
					// виктория
					//нечаева 02,12,19++ 
					ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSR-4726") 
					//нечаева 02,12,19--
					
					//03,02,21+++ нечаева тс лама еврологистик
					или  кодКонтрагента  = "SSR-6974" 
					//03,02,21---
					
					
					
					Тогда
					
					//TotalGrossAmount - общая сумма с НДС
					
					Элемент2=ДокументДом.СоздатьЭлемент("TotalGrossAmount");
					ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
					ОбщаяСуммаСНДС=ЗаменитьТочку(ОбщаяСуммаСНДС,2);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ОбщаяСуммаСНдс));
					ТекУзел2.ДобавитьДочерний(ТекстДом);
					
					//------------------------------------------------------------
					//сумма НДС
					Элемент2=ДокументДом.СоздатьЭлемент("TotalTaxAmount");
					ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
					ОбщаяНДС=ЗаменитьТочку(ОбщаяНДС,2);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ОбщаяНДС));
					ТекУзел2.ДобавитьДочерний(ТекстДом);
				КонецЕсли;			
				// нечаева 11,07,17 ---
				
				
			КонецЕсли;
		КонецЕсли;
		
		//---------------------------------------------------------------
		ЗаписьДом=Новый ЗаписьDom;
		ЗаписьДом.Записать(ДокументДом,ЗаписьХМЛ);
		ЗаписьХМЛ.Закрыть();
		ф1 = новый ЧтениеТекста(ВремФайл);
		ф2 = Новый ЗаписьТекста(ИмяФайлаОбмена);
		стр = ф1.ПрочитатьСтроку();
		Пока стр <> Неопределено Цикл
			Если стр <> "<?xml version=""1.0"" encoding=""UTF-8""?>" Тогда
				ф2.ЗаписатьСтроку(стр);
			КонецЕсли;
			стр = ф1.ПрочитатьСтроку();
		КонецЦикла;
		ф2.Закрыть();
		ф1.Закрыть();
		УдалитьФайлы(КаталогВременныхФайлов(),ДокОбъект.Номер+".xml");
		//Катаев+ 02/10/14
		//	Сообщить("Сформирован файл: "+ИмяФайлаОбмена+" "+КаталогВременныхФайлов());
		//ПереданПокупателюВЭлВиде = Истина;
		//ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - уведомление было успешно создано","Информация");
		//Катаев+ 14/11/14
		//нечаева 22,09,20+++
		Если Провайдер = 0 или Провайдер = 3 Тогда
			// нечаева 22,09,20---
			Если ПланыОбмена.Основной.ЭтотУзел() <> ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
				//				Соединение.Записать(ИмяФайлаОбмена, ИмяФайлаОбменаФТП);
				УдалитьФайлы(КаталогВременныхФайлов(),ДокОбъект.Номер+"_.xml");
				Сообщить("Сформирован файл на ftp: ");
				ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - уведомление было успешно создано","Информация");
			Иначе
				#Если Клиент Тогда
					Сообщить("Сформирован файл: "+ИмяФайлаОбмена);
				#КонецЕсли
				
				ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - уведомление было успешно создано","Информация");
			КонецЕсли;
		Иначе
			Соединение.Записать(ИмяФайлаОбмена, ИмяФайлаОбменаФТП);
			//Если ошибка то проверить имя файла.
			УдалитьФайлы(КаталогВременныхФайлов(),ДокОбъект.Номер+"_.xml");
			ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - подтверждение было успешно создано на ftp СКБ-Контур","Информация");
		КонецЕсли;
		
		//нечаева 30,01,15 ++++
		// запишем данные в регистр сведений, чтобы не отправлять второй раз
		ЗаписатьДанныеВРегистрОтправкаЭлектронныхДокументов(ссылка,,Перечисления.ДокументЕКОД.УведомлениеОбОтгрузке);
		//нечаева 30,01,15 ---
		
		// нечаева  - пока оставим эту галку, посомтри, как будет работать обмен, до тестирования.
		//Катаев- 14/11/14
		ПереданПокупателюВЭлВиде = Истина;
		//Катаев- 02/10/14
		
		
		//нечаева 10,10,17++++
		// пропишем состояние, что требуется УПД,  или корректировочный УПД
		// для тандера и Ашана акты приемки не нужны. Тут проставляем статус
		
		//Тандер. 
		Если ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-3881") Тогда
			//Нечаева 09,03,23++
			ДокументПрописан =ДокументПрописан();
			Если НЕ  документПрописан Тогда
				МенеджерЗаписи = РегистрыСведений.СостояниеЭлектронногоУПД.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Комментарий ="запись документа рнк1";
				МенеджерЗаписи.Объект = ДокОбъект.ссылка;
				МенеджерЗаписи.Дата = ТекущаяДата();
				МенеджерЗаписи.СостояниеУПД = перечисления.СостояниеУПД.ТребуетсяУПД;
				
				МенеджерЗаписи.Записать();
			конецЕсли;
			//нечаева 09,03,23---
			
		КонецЕсли;
		//нечаева 10,10,17---
		
		
		
	Иначе
		
		ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - обнаружены ошибки, файл уведомления не создан!","Важное");
		//	Сообщить("Обнаружены ошибки, файл не записан!");
		
	КонецЕсли;
КонецПроцедуры
// Шворобей ВЮ 28.12.2023 ++


// Ихсанов Д. А. Начало 16.04.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2199
// Процедура - Проверить интернет заказ по расходной накладной
//
// Параметры:
//  Отказ	 - Булево
//
Процедура ПроверитьИнтернетЗаказПоРасходнойНакладной(Отказ)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	РасходнаяНакладная.Ссылка КАК РасходнаяНакладная,
	|	ИнетМагазины.Ссылка КАК ИнтернетМагазин
	|ПОМЕСТИТЬ вт_ДанныеПоРасходнойНакладной
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнетМагазины КАК ИнетМагазины
	|		ПО РасходнаяНакладная.Контрагент = ИнетМагазины.Контрагент
	|			И РасходнаяНакладная.ПунктДоставки = ИнетМагазины.ПунктДоставки
	|ГДЕ
	|	РасходнаяНакладная.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ДанныеПоРасходнойНакладной.ИнтернетМагазин КАК ИнтернетМагазин
	|ИЗ
	|	вт_ДанныеПоРасходнойНакладной КАК вт_ДанныеПоРасходнойНакладной
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиентаFBS.Ссылка КАК Ссылка
	|ИЗ
	|	вт_ДанныеПоРасходнойНакладной КАК вт_ДанныеПоРасходнойНакладной
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиентаFBS КАК ЗаказКлиентаFBS
	|		ПО вт_ДанныеПоРасходнойНакладной.РасходнаяНакладная = ЗаказКлиентаFBS.ДокОснование
	|			И (ЗаказКлиентаFBS.Проведен)");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	УКонтрагентаЕстьМаркетПлейс = Не РезультатыЗапроса[1].Пустой();
	Если УКонтрагентаЕстьМаркетПлейс И РезультатыЗапроса[2].Пустой() Тогда
		ТекстСообщения = НСтр("ru = 'Контрагент участвует в интернет продажах!
		|По документу не был найден Заказ клиента FBS! Пометьте накладную на удаление и загрузите данные заново!'");
		
		//+++Чирков 18.04.2025
		//Кому на сервере показывать предупреждения ? Почему вообще эта проверка не в форме ?
		//ПоказатьПредупреждение(, ТекстСообщения,, НСтр("ru = 'Невозможно провести документ!'"));
		Сообщить(ТекстСообщения, СтатусСообщения.Важное);
		//---Чирков 18.04.2025
		
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры // ПроверитьИнтернетЗаказПоРасходнойНакладной()
// Ихсанов Д. А. Конец  16.04.2025 

//++Данилова Е.В. 30.05.2025 HELP-5130  Перенесла в общий модуль  МаркировкаС
Функция КоличествоШКПоЗаранееСформированнымАгрегациям(Знач ДокументОснование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ВложенныйЗапрос.КоличествоПоКоробкам) + СУММА(ВложенныйЗапрос.КоличествоПоБлочкам) КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод) КАК КоличествоПоКоробкам,
	|		0 КАК КоличествоПоБлочкам
	|	ИЗ
	|		Документ.ЛистНабора КАК ЛистНабора
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	|			ПО ЛистНабора.Ссылка = ЛистНабораШтрихкодыУпаковок.Ссылка
	|				И (ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ЛистНабораШтрихкодыКоробокДляАгрегации
	|			ПО ЛистНабора.Ссылка = ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка
	|				И (ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ЛистНабораШтрихкодыКоробокДляАгрегации.НовыйКодКоробки)
	|				И (ЛистНабораШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки = ЛистНабораШтрихкодыКоробокДляАгрегации.НовыйКодКоробки)
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	|			ПО (ЛистНабораШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка)
	|	ГДЕ
	|		ЛистНабора.Проведен
	|		И ЛистНабора.ДокОснование = &ДокОснование
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		0,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод)
	|	ИЗ
	|		Документ.ЛистНабора КАК ЛистНабора
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	|			ПО ЛистНабора.Ссылка = ЛистНабораШтрихкодыУпаковок.Ссылка
	|				И (ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок))
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	|			ПО (ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка)
	|	ГДЕ
	|		ЛистНабора.Проведен
	|		И ЛистНабора.ДокОснование = &ДокОснование) КАК ВложенныйЗапрос";
	
	Запрос.УстановитьПараметр("ДокОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	КоличествоВложенных = 0; 	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КоличествоВложенных = ВыборкаДетальныеЗаписи.Количество; 
	КонецЦикла;
	
	Возврат КоличествоВложенных; 
	
	
КонецФункции // КоличествоШКПоЗаранееСформированнымАгрегациям()

Процедура СоздатьРазагрегациюПоЗаводскимКоробкамВОбороте()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛистНабораШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки КАК ШтрихкодУпаковки,
	|	ЛистНабораШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки.Наименование КАК КодАгрегации
	|ИЗ
	|	Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ЛистНабораШтрихкодыКоробокДляАгрегации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
	|		ПО ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка = ЛистНабора.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыКМ_Факт.СрезПоследних(, ) КАК СтатусыКМ_ФактШК
	|		ПО (СтатусыКМ_ФактШК.ШтрихКодУпаковки = ЛистНабораШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки)
	|			И (СтатусыКМ_ФактШК.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.Расформирован))
	|ГДЕ
	|	ЛистНабора.Проведен
	|	И ЛистНабора.ДокОснование = &ДокОснование
	|	И ЛистНабораШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки <> ЛистНабораШтрихкодыКоробокДляАгрегации.НовыйКодКоробки
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЛистПереукладкиШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки,
	|	ЛистПереукладкиШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки.Наименование
	|ИЗ
	|	Документ.ЛистПереукладки.ШтрихкодыКоробокДляАгрегации КАК ЛистПереукладкиШтрихкодыКоробокДляАгрегации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладки
	|		ПО ЛистПереукладкиШтрихкодыКоробокДляАгрегации.Ссылка = ЛистПереукладки.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыКМ_Факт.СрезПоследних(, ) КАК СтатусыКМ_ФактШК
	|		ПО (СтатусыКМ_ФактШК.ШтрихКодУпаковки = ЛистПереукладкиШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки)
	|			И (СтатусыКМ_ФактШК.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.Расформирован))
	|ГДЕ
	|	ЛистПереукладки.Проведен
	|	И ЛистПереукладки.ДокОснование = &ДокОснование
	|	И ЛистПереукладкиШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки <> ЛистПереукладкиШтрихкодыКоробокДляАгрегации.НовыйКодКоробки";
	
	Запрос.УстановитьПараметр("ДокОснование", ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ШКДляМаркировкиТоваров = РезультатЗапроса.Выгрузить(); 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
		|ГДЕ
		|	МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка.ДокументОснование = &Док
		|	И МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка.Проведен
		|	И МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.РасформированиеУпаковки)
		|
		|СГРУППИРОВАТЬ ПО
		|	МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка";
		
		Запрос.УстановитьПараметр("Док", ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать(); 
		
		Если Выборка.Следующий() Тогда
			
			рШапки		= ПолучитьРеквизитыШапки(Выборка.ссылка, "Статус"); 
			
			Если рШапки.Статус = Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки Тогда 			
				ДокМаркировкиОбъект = Выборка.ссылка.ПолучитьОбъект();
				ДокМаркировкиОбъект.Товары.Очистить();
				ДокМаркировкиОбъект.ШтрихкодыУпаковок.Очистить(); 
			Иначе
				
				ТекстОшибки = СтрШаблон("Недопустимый статус документа: '%1' !", рШапки.Статус);
				Сообщить(ТекстОшибки); 
				Отказ = истина;
				Возврат; 
			КонецЕсли;
		Иначе 
			ДокМаркировкиОбъект = Документы.МаркировкаТоваровИСМП.СоздатьДокумент(); 
		КонецЕсли;
		
		ДокМаркировкиОбъект.Дата	= ТекущаяДатаСеанса(); 			
		
		ДокМаркировкиОбъект.Организация	= Организация; 
		ДокМаркировкиОбъект.Заполнить(ссылка);
		ДокМаркировкиОбъект.ДокументОснование = ссылка;
		ДокМаркировкиОбъект.ПодразделениеНанесения = Склад.Подразделение;
		ДокМаркировкиОбъект.ДополнительныеСвойства.Вставить("ЗаполнятьТолькоШапку", Истина);
		
		ДокМаркировкиОбъект.ВидОперации		= Перечисления.ВидыОперацийМаркировки.РасформированиеУпаковки;
		ДокМаркировкиОбъект.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.РасформированиеУпаковки;
		ДокМаркировкиОбъект.Статус			= Перечисления.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки;
		
		ДокМаркировкиОбъект.ШтрихкодыУпаковок.Загрузить(ШКДляМаркировкиТоваров); 
		
		Попытка
			ДокМаркировкиОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Отказ = Истина; 
			Сообщить("Ошибка проведения документа разагрегации!!! Описание ошибки: " +ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		
	КонецЕсли;	
	
	
КонецПроцедуры

//--Данилова Е.В. 30.05.2025
//++Данилова Е.В. 19.06.2025 HELP-5109 
Функция ОтсканированыВЛН_ЛП_Агрегаты(ТиШК,ДокОснование) 
	
	Если  ТиШК = Перечисления.ТипыШтрихКодов.Блочок Тогда
		
		Запрос = Новый Запрос; 
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛистНабора.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
		|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
		|ГДЕ
		|	ЛистНабора.ДокОснование = &ДокОснование
		|	И ЛистНабора.Проведен
		|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛистПереукладки.Ссылка
		|ИЗ
		|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистПереукладкиШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладки
		|		ПО ЛистПереукладкиШтрихкодыУпаковок.Ссылка = ЛистПереукладки.Ссылка
		|ГДЕ
		|	ЛистПереукладки.ДокОснование = &ДокОснование
		|	И ЛистПереукладки.Проведен
		|	И ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)";
		Запрос.УстановитьПараметр("ДокОснование",ДокОснование); 
		РезультатЗапроса = Запрос.Выполнить(); 
		
		Возврат НЕ РезультатЗапроса.Пустой(); 
		
	ИначеЕсли ТиШК = Перечисления.ТипыШтрихКодов.Коробка Тогда
		
		Запрос = Новый Запрос; 
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛистНабора.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
		|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ЛистНабораШтрихкодыКоробокДляАгрегации
		|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистНабораШтрихкодыКоробокДляАгрегации.Ссылка
		|			И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ЛистНабораШтрихкодыКоробокДляАгрегации.НовыйКодКоробки
		|			И (ЛистНабораШтрихкодыКоробокДляАгрегации.НовыйКодКоробки = ЛистНабораШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки)
		|ГДЕ
		|	ЛистНабора.ДокОснование = &ДокОснование
		|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
		|	И ЛистНабора.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛистПереукладки.Ссылка
		|ИЗ
		|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистПереукладкиШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладки
		|		ПО ЛистПереукладкиШтрихкодыУпаковок.Ссылка = ЛистПереукладки.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки.ШтрихкодыКоробокДляАгрегации КАК ЛистПереукладкиШтрихкодыКоробокДляАгрегации
		|		ПО ЛистПереукладкиШтрихкодыУпаковок.Ссылка = ЛистПереукладкиШтрихкодыКоробокДляАгрегации.Ссылка
		|			И ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки = ЛистПереукладкиШтрихкодыКоробокДляАгрегации.НовыйКодКоробки
		|			И (ЛистПереукладкиШтрихкодыКоробокДляАгрегации.НовыйКодКоробки = ЛистПереукладкиШтрихкодыКоробокДляАгрегации.ИсходныйКодКоробки)
		|ГДЕ
		|	ЛистПереукладки.ДокОснование = &ДокОснование
		|	И ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
		|	И ЛистПереукладки.Проведен"; 
		
		Запрос.УстановитьПараметр("ДокОснование",ДокОснование); 
		РезультатЗапроса = Запрос.Выполнить(); 
		
		Возврат НЕ РезультатЗапроса.Пустой(); 
		
	Иначе 
		
		Возврат Ложь;
		
	КонецЕсли;
	
	
	
КонецФункции // ОтсканированыТолькоАгрегаты()

//++Данилова Е.В. 16.10.2025 MARK-3128
Процедура ПроверитьЗаполненностьТНВЭД(ТипУзла) 	
	
	НезаполненныеТНВЭД = Новый Массив; 
	Если СостояниеНакладной = Перечисления.СостоянияНакладной.КОтправкеНаСклад
		И НачСостНакладной = Перечисления.СостоянияНакладной.ВРаботе 
		И  ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда  		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(РасходнаяНакладнаяТовары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	РасходнаяНакладнаяТовары.Количество КАК Количество
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	&Товары КАК РасходнаяНакладнаяТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(РасходнаяНакладнаяТовары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	РасходнаяНакладнаяТовары.Количество КАК Количество
		|ПОМЕСТИТЬ ВТКомплектующие
		|ИЗ
		|	&Комплектующие КАК РасходнаяНакладнаяТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТТовары.Номенклатура КАК Номенклатура,
		|	ВЫРАЗИТЬ(ВТТовары.Номенклатура КАК Справочник.Номенклатура).Код КАК Код
		|ИЗ
		|	ВТТовары КАК ВТТовары
		|ГДЕ
		|	ВТТовары.Количество > 0
		|	И ВЫРАЗИТЬ(ВТТовары.Номенклатура КАК Справочник.Номенклатура).Родитель.ЭтоМодель
		|	И ВЫРАЗИТЬ(ВТТовары.Номенклатура КАК Справочник.Номенклатура).Родитель.ВидНоменклатуры = &Товар
		|	И ВЫРАЗИТЬ(ВТТовары.Номенклатура КАК Справочник.Номенклатура).Родитель.ТНВЭД = &ПустойТНВЭД
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТТовары.Номенклатура,
		|	ВЫРАЗИТЬ(ВТТовары.Номенклатура КАК Справочник.Номенклатура).Код
		|ИЗ
		|	ВТКомплектующие КАК ВТТовары
		|ГДЕ
		|	ВТТовары.Количество > 0
		|	И ВЫРАЗИТЬ(ВТТовары.Номенклатура КАК Справочник.Номенклатура).Родитель.ЭтоМодель
		|	И ВЫРАЗИТЬ(ВТТовары.Номенклатура КАК Справочник.Номенклатура).Родитель.ВидНоменклатуры = &Товар
		|	И ВЫРАЗИТЬ(ВТТовары.Номенклатура КАК Справочник.Номенклатура).Родитель.ТНВЭД = &ПустойТНВЭД";
		
		Запрос.УстановитьПараметр("ПустойТНВЭД", Справочники.ТНВЭД.ПустаяСсылка());
		Запрос.УстановитьПараметр("Товар", Перечисления.ВидыНоменклаутры.Товар);
		Запрос.УстановитьПараметр("Товары", Товары.Выгрузить(,"Номенклатура,Количество"));
		Запрос.УстановитьПараметр("Комплектующие", Комплектующие.Выгрузить(,"Номенклатура,Количество"));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НезаполненныеТНВЭД.Добавить(ВыборкаДетальныеЗаписи.Код);
		КонецЦикла; 	
		
		Если НезаполненныеТНВЭД.Количество() > 0 Тогда
			
			Если НЕ СостояниеНакладной = Перечисления.СостоянияНакладной.ВРаботе Тогда 		
				
				#Если  КЛИЕНТ Тогда
					
					ТекстСообщения = "В РНК присутствует позиции с незаполненным полем ТНВЭД:" + Символы.ПС + СтрСоединить(НезаполненныеТНВЭД,Символы.ПС)+					
					" Товар не будет промаркирован КМ. Обратитесь в отдел ВЭД для проставления кода ТНВЭД в случае необходимости промаркировать товар."; 
					
					СписокВопрос = Новый СписокЗначений; 
					СписокВопрос.Добавить("Продолжить","Продолжить");
					СписокВопрос.Добавить("Отменить","Отменить");
					КодОтвета = Вопрос(ТекстСообщения,СписокВопрос);
					Если КодОтвета = "Отменить" Тогда
						
						СостояниеНакладной = Перечисления.СостоянияНакладной.ВРаботе;	
						
					КонецЕсли;
					
				#ИНАЧЕ
					
					СостояниеНакладной = Перечисления.СостоянияНакладной.ВРаботе; 
					
				#КонецЕсли
			КонецЕсли;                      
			
			ТекстСообщения = "В накладной есть позиции с незаполненным ТНВЭД:" + Символы.ПС + СтрСоединить(НезаполненныеТНВЭД,Символы.ПС); 	
			СообщитьИзМодуля(ТекстСообщения);
			
		КонецЕсли;
	Конецесли;
	
КонецПроцедуры

//--Данилова Е.В. 19.06.2025 
//++Данилова Е.В. 24.03.2026 ASU-2089 
Функция ПроверитьКомплектующиеАссортито()
	
	Результат = МаркировкаКС.СтруктураРезультата(Истина); 
	
	Если Не ОтгрузкаКомплектов Тогда
		
		Возврат Результат; 	
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Комплектующие.Продукция КАК Справочник.Номенклатура) КАК Продукция,
	|	Комплектующие.Номенклатура КАК Номенклатура,
	|	Комплектующие.Количество КАК Количество
	|ПОМЕСТИТЬ ВТКомплектующие
	|ИЗ
	|	&Комплектующие КАК Комплектующие
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТКомплектующие.Продукция) КАК Продукция,
	|	ВТКомплектующие.Номенклатура КАК Номенклатура
	|ИЗ
	|	ВТКомплектующие КАК ВТКомплектующие
	|ГДЕ
	|	ВТКомплектующие.Продукция.Родитель.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Ассортито)
	|	И ВТКомплектующие.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТКомплектующие.Номенклатура
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТКомплектующие.Продукция) > 1";
	
	Запрос.УстановитьПараметр("Комплектующие", Комплектующие.Выгрузить(,"Продукция,номенклатура,количество"));
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если НЕ  РезультатЗапроса.Пустой() Тогда
		
		ТекстОошибки = "В одной РНК не должна быть продукция вида ассортито с одинаковыми комплектующими!!"; 
		
		Выборка = РезультатЗапроса.Выбрать(); 
		
		МассивПовторов = Новый Массив; 
		Пока Выборка.Следующий()  Цикл
			
			ТекстРасшифровка = СтрШаблон("Комплектующая по разной продукции %1",Выборка.Номенклатура); 	
			МассивПовторов.Добавить(ТекстРасшифровка); 
			
		КонецЦикла;
		
		Результат.Ошибки.Добавить(ТекстОошибки + Символы.ПС + СтрСоединить(МассивПовторов,Символы.ПС)); 
	КонецЕсли;
	
	Результат.Успешно = Результат.Ошибки.Количество() = 0; 
	
	Возврат Результат; 
КонецФункции // ПроверитьКомплектующиеАссортито()

//--Данилова Е.В. 24.03.2026 
НеКонтролироватьЗапись	=Ложь;
НеКонтролироватьТА		=Ложь;
//крохин начало 15.02.2013
НеВыгружатьДокумент = Ложь;
//крохин конец 15.02.2013
//крохин начало 15.04.2013
НеконтролироватьНаличиеСФ = Ложь;
//крохин конец 15.04.2013
// нечаева 130122 ++
КаталогЕкода = Константы.КаталогЕКОД.Получить(); //\\SRVECOD\SFERAConnector2\EDI\
КаталогЕкодаФТП = "\\SRVECOD-C\SFERAConnector\EDI\" ;//"\\SRVECOD-C\SFERAConnector\EDI\";  

// для уведомлений филиала
// нечаева 130122---
