&НаКлиенте
Перем ХэшКомплектов;

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.ДополнительныеПараметры = Новый Структура;
	
	ОпределитьСкладМаркированногоТовара(); // Кельманов А.В. - HELP-4221 - 2025.07.17
	
	// Кельманов А.В. - SNL-208 - 2026.04.22 {
	Если Объект.Ссылка.Пустая() И Объект.фРежим = 0 Тогда
		Объект.Бригада.Очистить();
		Объект.Бригада.Загрузить(ТекущаяБригада());
	КонецЕсли;
	// Кельманов А.В. - SNL-208 - 2026.04.22 }
	
	//Валетов + 14,05,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-9726
	Если Объект.Завершен Тогда
		Элементы.кнТолькоТекКомплект.Пометка = Ложь;
	Иначе
		Элементы.кнТолькоТекКомплект.Пометка = Истина;  
	КонецЕсли; 
	//Валетов -
	УправлениеВидимостью();
	
	ЗаполнитьШаблонСпайки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ХэшКомплектов = ПолучитьХэшиКомплектовЗадания();	
	НайтиКомплект();        
	
	Если Объект.Ссылка.Пустая() И Объект.фРежим = 2 Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.КоличествоПродукции;	
	КонецЕсли;
	
	ДополнительныеРеквизиты = Новый Структура;  
	
	// Кельманов А.В. - HELP-5254 - 2026.03.23 { 
	Если Объект.фРежим = 0 И ЗначениеЗаполнено(Объект.Продукция) Тогда
		
		ЗаполнитьДопустимыеКомплектующие_Продукция();
		
		Если Не ЗначениеЗаполнено(Объект.КоличествоДокумента) Тогда
			
			ПоказатьПредупреждение(, "Укажите плановое количество спаек!");
			
			Элементы.КоличествоПродукции.ТолькоПросмотр = Ложь;
			Элементы.КоличествоПродукции.ЦветФона = WebЦвета.Бирюзовый; 
			ЭтаФорма.ТекущийЭлемент = Элементы.КоличествоПродукции;
			
		Иначе
			
			ОпределитьОжидаемыйДляСканированияКодЧЗ();
			
		КонецЕсли;
		
	КонецЕсли;
	// Кельманов А.В. - HELP-5254 - 2026.03.23 }

	// Кельманов А.В. - ПРО-0000000116 - 2026.06.23 {
	Накладная = Неопределено;
	
	Если ЗначениеЗаполнено(Объект.ДокОснование) Тогда
		
		Накладная = ПолучитьРеквизитШапки(Объект.ДокОснование, "ДокОснование", "Документ");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Накладная) И ТипЗнч(Накладная) = Тип("ДокументСсылка.Перемаркировка") Тогда
		
		ОпределитьОжидаемыйДляСканированияКодЧЗ();
		
	КонецЕсли;
	// Кельманов А.В. - ПРО-0000000116 - 2026.06.23 }

	//++Данилова Е.В. 15.06.2026 №0000001219
	ОбновитьКоличествоСобранныхКомплектов(); 
	//--Данилова Е.В. 15.06.2026
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если ТолькоПросмотр Тогда Возврат КонецЕсли;
	Если НЕ ВводДоступен() Тогда Возврат КонецЕсли;
	
	Если НЕ ЭтоСобытиеСканера(Событие) Тогда Возврат КонецЕсли;
	
	глТорговоеОборудование.СканерПосылкаДанных(1);
	глСобытиеСканераОтработано = Истина;
	
	ОбработатьВводШК(Данные);	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Для Каждого СтрокаТЧ Из Объект.ШтрихкодыУпаковок Цикл
		Если СтрокаТЧ.ШтрихкодКомплекта.Пустая() Тогда
			Отказ = Истина;
			Сообщить("Не заполнен КМ набора в строке: " + Формат(СтрокаТЧ.НомерСтроки, "ЧРГ=' '; ЧГ=3,0"));
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовУправления

&НаКлиенте
Процедура ШтрихкодыУпаковок_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ВыбраннаяСтрока<>Неопределено И Поле <> Неопределено Тогда    
		Попытка //Валетов+ 30.06.2026 Проблема 0000000163 
			ТекЗначение = Объект.ШтрихкодыУпаковок.НайтиПоИдентификатору(ВыбраннаяСтрока)[Сред(Поле.Имя, СтрДлина(Элемент.Имя)+1)]; 
			ПоказатьЗначение(, ТекЗначение);   
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодыУпаковок_ПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ШтрихкодКомплекта) Тогда	
		//ТекущйКомплект = ПолучитьРеквизитШапки(Элемент.ТекущиеДанные.ШтрихкодКомплекта, "Владелец");
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура Товары_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ВыбраннаяСтрока<>Неопределено И Поле <> Неопределено Тогда
		ТекЗначение = Объект.Товары.НайтиПоИдентификатору(ВыбраннаяСтрока)[Сред(Поле.Имя, СтрДлина(Элемент.Имя)+1)]; 
		ПоказатьЗначение(, ТекЗначение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура фРежим_ПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

// Кельманов А.В. - Оптимизация работы - 2026.03.25
&НаКлиенте
Процедура ИмитацияСканированияПриИзменении(Элемент)
	
	ВнешнееСобытие(Неопределено, "BarCodeValue", ИмитацияСканирования); 
	
	ИмитацияСканирования = "";

КонецПроцедуры

// Кельманов А.В. - HELP-5254 - 2026.03.30
&НаКлиенте
Процедура КоличествоПродукцииПриИзменении(Элемент)
	
	Если Объект.фРежим = 0 И ЗначениеЗаполнено(Объект.Продукция) И ЗначениеЗаполнено(Объект.КоличествоДокумента) Тогда
		
		Если Объект.Ссылка.Пустая() Тогда
			
			Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));	
			
		КонецЕсли;
		
		ТекстОшибки = ЗабронироватьКодыСпаек();
		
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			
			Сообщить(ТекстОшибки);
			
			Объект.КоличествоДокумента = 0;
			
			Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
			
			ПоказатьПредупреждение(, "Укажите плановое количество спаек!");
			
			Элементы.КоличествоПродукции.ТолькоПросмотр = Ложь;
			Элементы.КоличествоПродукции.ЦветФона = WebЦвета.Бирюзовый; 
			ЭтаФорма.ТекущийЭлемент = Элементы.КоличествоПродукции;
			
		Иначе
			
			Элементы.КоличествоПродукции.ЦветФона = WebЦвета.Белый; 

		КонецЕсли;
		
		УправлениеВидимостью();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

// Кельманов А.В. - HELP-5254 - 2026.03.30
&НаСервере
Функция ЗабронироватьКодыСпаек()
	
	ТекстОшибки = "";
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	|ИЗ
	|	Документ.ЗаданиеНаСборкуКомплектовЧЗ.ШтрихкодыУпаковок КАК ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыКМ_Факт.СрезПоследних(, Номенклатура = &Владелец) КАК СтатусыКМ_ФактСрезПоследних
	|		ПО ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки = СтатусыКМ_ФактСрезПоследних.ШтрихКодУпаковки
	|ГДЕ
	|	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.Ссылка = &ЗСБЧЗ
	|	И СтатусыКМ_ФактСрезПоследних.Статус = &Статус";
	
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыКодовМаркировкиФакт.Зарезервирован);
	Запрос.УстановитьПараметр("ЗСБЧЗ", Объект.ДокОснование);
	Запрос.УстановитьПараметр("Владелец", Объект.Продукция);
	
	МассивДоступныхКодовЗСБ = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШтрихкодУпаковки");
	
	ТаблицаДляПолученияКодов = Новый ТаблицаЗначений;
	ТаблицаДляПолученияКодов.Колонки.Добавить("Номенклатура");
	ТаблицаДляПолученияКодов.Колонки.Добавить("Количество");
	
	НовСтрПолучениеКодов = ТаблицаДляПолученияКодов.Добавить();
	НовСтрПолучениеКодов.Номенклатура = Объект.Продукция;
	НовСтрПолучениеКодов.Количество = Объект.КоличествоДокумента;
	
	ДопПараметры = Новый Структура("Статус, МассивДоступныхКодов, ТипКода, Добавлять",
	Перечисления.СтатусыКодовМаркировкиФакт.Зарезервирован, МассивДоступныхКодовЗСБ, Перечисления.ТипыКодовМаркировки.Набор, Истина);
	
	РезультатПолученияКодов = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыШтук(ТаблицаДляПолученияКодов, Объект.Ссылка, ДопПараметры);		
	
	Если Не РезультатПолученияКодов.Успешно Тогда
		
		ТекстОшибки = СтрСоединить(РезультатПолученияКодов.Ошибки, Символы.ПС);
		
	Иначе
		
		Объект.ШтрихкодыУпаковок.Очистить();
		Объект.Товары.Очистить();
		
		Для Каждого СтрокаДанных Из РезультатПолученияКодов.Данные.Получить(Объект.Продукция) Цикл
			
			НовСтр = Объект.ШтрихкодыУпаковок.Добавить();
			
			НовСтр.ШтрихкодКомплекта = СтрокаДанных;
			
		КонецЦикла;
		
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));	
		
	КонецЕсли;
	
	Возврат ТекстОшибки;

КонецФункции

// Кельманов А.В. - HELP-4221 - 2025.07.17
&НаСервере
Процедура ОпределитьСкладМаркированногоТовара()
	
	ЭтоСкладМаркированногоТовара = Ложь;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ЗаданиеНаСборкуКомплектовЧЗ.ДокОснование.Склад.ЭтоСкладМаркированногоТовара, ЛОЖЬ) КАК ЭтоСкладМаркированногоТовара
	               |ИЗ
	               |	Документ.ЗаданиеНаСборкуКомплектовЧЗ КАК ЗаданиеНаСборкуКомплектовЧЗ
	               |ГДЕ
	               |	ЗаданиеНаСборкуКомплектовЧЗ.Ссылка = &ЗСБ";
	
	Запрос.УстановитьПараметр("ЗСБ", Объект.ДокОснование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЭтоСкладМаркированногоТовара = Выборка.ЭтоСкладМаркированногоТовара;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью()
	
	Если РольДоступна("Администратор") Тогда	
		Элементы.Завершен.ТолькоПросмотр				= ТолькоПросмотр;	
		
		Элементы.ШтрихкодыУпаковок.ТолькоПросмотр		= ТолькоПросмотр;	
		Элементы.ШтрихкодыУпаковок.ИзменятьСоставСтрок	= Истина;		
	КонецЕсли;
	
	Элементы.фРежим.Доступность = (Объект.ШтрихкодыУпаковок.Количество() = 0);
	
	Если Объект.Завершен Тогда
		Элементы.кнРаспечататьКодКомплекта.Доступность	= Ложь;
		Элементы.кнЗавершитьСборку.Доступность 			= Ложь;
		
		Элементы.ОчититьКодыКомплектующих.Доступность 	= Ложь;
		Элементы.ЗаполнитьКодыКомплектующих.Доступность = Ложь;		
		
		Если НЕ РольДоступна("Администратор") Тогда
			ТолькоПросмотр	= Истина;			
		КонецЕсли;
	Иначе
		УстановитьФильтрПоТекущемуКомплекту();				
	КонецЕсли;
	
	Элементы.гТекущйКомплект.Видимость = Ложь;
	Элементы.гПродукция.Видимость = Ложь;
	Элементы.кнРаспечататьКодКомплекта.Видимость = Ложь;
	Элементы.кнРаспечататьЛентуКомплектов.Видимость = Ложь;
	
	// Кельманов А.В. - HELP-4221 - 2025.07.17 {
	Если ЭтоСкладМаркированногоТовара И Не Объект.фРежим = 2 Тогда
		Элементы.фРежим.Видимость = Ложь;		
		Элементы.фРежим1.Видимость = Истина;		
	Иначе
		Элементы.фРежим.Видимость = Истина;		
		Элементы.фРежим1.Видимость = Ложь;		
	КонецЕсли;
	// Кельманов А.В. - HELP-4221 - 2025.07.17 }
	
	Если Объект.фРежим = 0 Тогда //Обычный
		// Кельманов А.В. - HELP-5254 - 2026.03.23 {
		Элементы.гПродукция.Видимость = Истина;	
		Элементы.ПродукцияШ.ТолькоПросмотр = Истина;
		Элементы.КоличествоПродукции.ТолькоПросмотр = Не ЗначениеЗаполнено(Объект.Продукция) Или ЗначениеЗаполнено(Объект.КоличествоДокумента);
		// Кельманов А.В. - HELP-5254 - 2026.03.23 }
		Элементы.гТекущйКомплект.Видимость 				= Истина;
		Элементы.кнРаспечататьКодКомплекта.Видимость	= Истина;
		Элементы.кнЗаполнитьПакет.Видимость				= Ложь;
	ИначеЕсли Объект.фРежим = 1 Тогда //Упрощенный
		Элементы.гТекущйКомплект.Видимость 				= Истина;
		Элементы.кнРаспечататьКодКомплекта.Видимость 	= Истина;
		Элементы.кнЗаполнитьПакет.Видимость				= Ложь;
	ИначеЕсли Объект.фРежим = 2 Тогда //Пакетный
		Элементы.гПродукция.Видимость = Истина;	
		Элементы.ПродукцияШ.ТолькоПросмотр = Ложь; // Кельманов А.В. - HELP-5254 - 2026.03.23	
		Элементы.кнРаспечататьЛентуКомплектов.Видимость = Истина;
		Элементы.кнЗаполнитьПакет.Видимость				= Истина;
	КонецЕсли; 
	
	
	Элементы.ФормаОчиститьДвижения.Доступность = НЕ Объект.Ссылка.Пустая() И ПолучитьПолномочиеПользователя(ПланыВидовХарактеристик.ПолномочияПользователей.ОчисткаЛСК);	
	// Кельманов А.В. - HELP-3850 - 2025.04.03 {
	Элементы.УзелТСД.Видимость = ЗначениеЗаполнено(Объект.УзелТСД);
	Элементы.СборщикКомплектаТСД.Видимость = ЗначениеЗаполнено(Объект.СборщикКомплектаТСД);     
	// Кельманов А.В. - HELP-3850 - 2025.04.03 }
	// Кухарь А.Ю. 06.05.2025 начало
	Элементы.ДатаНачалаСканирования.Видимость = ЗначениеЗаполнено(Объект.ДатаНачалаСканирования);
	Элементы.ДатаОкончанияСканирования.Видимость = ЗначениеЗаполнено(Объект.ДатаОкончанияСканирования);
	// Кухарь А.Ю. 06.05.2025 конец
	
	// Шворобей ВЮ 15.05.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4854
	Если ПолучитьПолномочиеПользователя("ОчисткаЛСК", ПараметрыСеанса.Пользователь) Тогда
		Элементы.кнРазрешитьРедактированиеМарок.Доступность = Истина;
	КонецЕсли;
	// Шворобей ВЮ 15.05.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4854
	
КонецПроцедуры

&НаСервере
Функция ДобавитьКомплектующиеНабора(КМНабора)
	
КонецФункции //ДобавитьКомплектующиеНабора(КМНабора)

&НаСервере
Функция ПолучитьКодыДляКоробки(ВыбНоменклатура)	
	Результат = Новый Структура("Успешно,Ошибки,ШтрихКодКоробки,ШтрихКодыУпаковок", Истина, Новый Массив, Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка(), Новый Массив);			
	
	ШтукВКоробке = ПолучитьРеквизитШапки(ВыбНоменклатура, "Родитель.ШтукВКоробке");
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихКодУпаковки КАК ШтрихкодКоробки
	|ИЗ
	|	РегистрСведений.СтатусыКМ_Факт.СрезПоследних(,
	|		Номенклатура 	= ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)	
	|		И ТипШК			= ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)    
	//Валетов + 24,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3522 Добавил Перемаркировку
	|		И ШтрихКодУпаковки.СпособВводаВОборот В (ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.МаркировкаОстатков), ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.Перемаркировка))
	|		И ШтрихКодУпаковки.ТипУпаковки	= ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МонотоварнаяУпаковка)	
	|	)
	|ГДЕ
	|	Местонахождение = &ПодразделениеНанесения	
	|	И НЕ ВПути
	|	И Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.ГотовКПечати)
	|ДЛЯ ИЗМЕНЕНИЯ
	|	РегистрСведений.СтатусыКМ_Факт.СрезПоследних
	|;
	|ВЫБРАТЬ ПЕРВЫЕ " + ШтукВКоробке + "
	|	ШтрихКодУпаковки КАК ШтрихКодУпаковки
	|ИЗ
	|	РегистрСведений.СтатусыКМ_Факт.СрезПоследних(,
	|		ШтрихКодУпаковки.Владелец 	= &Номенклатура
	|		И ТипШК						= ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)     
	//Валетов + 24,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3522  Добавил Перемаркировку
	|		И ШтрихКодУпаковки.СпособВводаВОборот 	В (ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.МаркировкаОстатков), ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.Перемаркировка))
	|		И ШтрихКодУпаковки.ТипУпаковки 			= ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МаркированныйТовар)
	|		И ШтрихКодУпаковки.ТипКода В (ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор))
	|	)
	|ГДЕ
	|	Местонахождение = &ПодразделениеНанесения	
	|	И НЕ ВПути
	|	И Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.ГотовКПечати)
	|ДЛЯ ИЗМЕНЕНИЯ
	|	РегистрСведений.СтатусыКМ_Факт.СрезПоследних
	|";
	
	Запрос.УстановитьПараметр("ПодразделениеНанесения", Объект.Подразделение);
	Запрос.УстановитьПараметр("Номенклатура", 			ВыбНоменклатура);
	
	рЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = рЗапроса[0].Выбрать();	
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ШтрихКодКоробки) Тогда
			Результат.ШтрихкодКоробки = Выборка.ШтрихкодКоробки;					
		КонецЕсли;	
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(Результат.ШтрихкодКоробки) Тогда
		Результат.Ошибки.Добавить("Не найдено свободных кодов агрегации !");			
	КонецЕсли; 
	
	Выборка = рЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.ШтрихКодыУпаковок.Добавить(Выборка.ШтрихКодУпаковки);
	КонецЦикла;	
	
	ПолученоКМ = Результат.ШтрихКодыУпаковок.Количество();
	Если ПолученоКМ = ШтукВКоробке Тогда
	Иначе	
		ТекстОшибки = СтрШаблон("Найдено: %1 из необходимых: %2 кодов маркировки.", ПолученоКМ, ШтукВКоробке);
		
		Результат.Ошибки.Добавить(ТекстОшибки);		
	КонецЕсли;
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;
КонецФункции //ПолучитьКодыДляКоробки(ВыбНоменклатура)

&НаСервере
Функция СоздатьЛистМаркировки(Номенклатура)
	ЛН_Объект = Документы.ЛистМаркировкиОстатков.СоздатьДокумент();	
	ЗаполнитьШапкуДокумента(ЛН_Объект, ПараметрыСеанса.Пользователь); 	
	
	ЛН_Объект.Дата			= ТекущаяДата();
	ЛН_Объект.ДокОснование	= Объект.Ссылка;
	ЛН_Объект.Номенклатура	= Номенклатура;
	
	ЛН_Объект.Записать();
	Возврат ЛН_Объект.Ссылка;	
КонецФункции //СоздатьЛистНабора() 

&НаСервереБезКонтекста
Функция ПолучитьХэшКомплектаПоКМ(МассивКМ)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Владелец.Код 					КАК Номенклатура_Код,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ссылка) 	КАК Количество
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров
	|ГДЕ	
	|	Ссылка В (&МассивКМ)
	|СГРУППИРОВАТЬ ПО
	|	Владелец.Код
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура_Код
	|";
	
	Запрос.УстановитьПараметр("МассивКМ", МассивКМ);
	Строки = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Строки.Добавить(Выборка.Номенклатура_Код+"___"+Выборка.Количество);	
	КонецЦикла; 
	
	Возврат СтрСоединить(Строки, ",");
КонецФункции //ПолучитьХэшКомплектаПоКМ(МассивКМ)

&НаСервереБезКонтекста
Функция ПолучитьХэшКомплектаПоНом(МассивНоменклатуры)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Номенклатура ИЗ &ТЗ КАК ТЗ
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Код	КАК Номенклатура_Код,
	|	СУММА(1) 			КАК Количество
	|ИЗ
	|	ВТ_Номенклатура	
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура_Код
	|";
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));	
	Для Каждого Номенклатура Из МассивНоменклатуры Цикл
		СтрокаТЗ = ТЗ.Добавить();
		СтрокаТЗ.Номенклатура = Номенклатура;	
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	
	Строки = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Строки.Добавить(Выборка.Номенклатура_Код+"___"+Выборка.Количество);	
	КонецЦикла; 
	
	Возврат СтрСоединить(Строки, ",");
КонецФункции //ПолучитьХэшКомплектаПоНом(МассивКМ)

&НаСервере
Функция ПолучитьХэшиКомплектовЗадания()
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Номенклатура 					КАК Продукция,
	|	Null							КАК Номенклатура,
	|	""""							КАК Номенклатура_Код,
	|	0				 				КАК Количество,
	|	СУММА(Количество*Коэффициент) 	КАК КоличествоПродукции
	|ИЗ
	|	Документ.ЗаданиеНаСборкуКомплектовЧЗ.Товары
	|ГДЕ
	|	Ссылка = &ДокОснование	
	|	И Количество*Коэффициент<>0
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Продукция,
	|	Номенклатура,
	|	Номенклатура.Код				КАК Номенклатура_Код,
	|	СУММА(Количество*Коэффициент)  	КАК Количество,
	|	0								КАК КоличествоПродукции
	|ИЗ
	|	Документ.ЗаданиеНаСборкуКомплектовЧЗ.Комплектующие
	|ГДЕ
	|	Ссылка = &ДокОснование	
	|	И Количество*Коэффициент<>0
	|СГРУППИРОВАТЬ ПО
	|	Продукция,
	|	Номенклатура
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура_Код
	|ИТОГИ СУММА(КоличествоПродукции) ПО
	|	Продукция
	|";
	
	Запрос.УстановитьПараметр("ДокОснование", Объект.ДокОснование);
	
	ДопустимыеКомплекты.Очистить();
	мДопустимыеКомплектующие = Новый Соответствие;
	
	Выборка_Продукция = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Продукция");
	
	Пока Выборка_Продукция.Следующий() Цикл
		
		// Кельманов А.В. - HELP-9640 - 2026.05.12 {
		Если Объект.фРежим = 0 И ЗначениеЗаполнено(Объект.Продукция) И Выборка_Продукция.Продукция <> Объект.Продукция Тогда
			
			Продолжить;
			
		КонецЕсли;
		// Кельманов А.В. - HELP-9640 - 2026.05.12 }
		
		ДопустимыеКомплекты.Добавить(Выборка_Продукция.Продукция);
		
		Строки = Новый Массив;
		Выборка = Выборка_Продукция.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.Количество>0 Тогда
				Строки.Добавить(Выборка.Номенклатура_Код+"___"+Выборка.Количество/Выборка_Продукция.КоличествоПродукции);
				мДопустимыеКомплектующие[Выборка.Номенклатура] = Истина;			
			КонецЕсли;
		КонецЦикла;
		
		Результат[СтрСоединить(Строки, ",")] = Выборка_Продукция.Продукция;
		
	КонецЦикла;
	
	Для Каждого КиЗ Из мДопустимыеКомплектующие Цикл
		ДопустимыеКомплектующие.Добавить(КиЗ.Ключ);	
	КонецЦикла; 
	
	Возврат Результат;
КонецФункции //ПолучитьХэшиКомплектовЗадания()

&НаСервере
Процедура ЗаполнитьШаблонСпайки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Комплектующее КАК Номенклатура,
		|	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.КодКомплектующегоНеНанесен КАК СканировалиЛинейнымШК
		|ИЗ
		|	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
		|ГДЕ
		|	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Комплектующее,
		|	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.КодКомплектующегоНеНанесен";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	ШаблонСпайкиЗначение = РеквизитФормыВЗначение("ШаблонСпайки");
	ШаблонСпайкиЗначение = Запрос.Выполнить().Выгрузить();
	ЗначениеВРеквизитФормы(ШаблонСпайкиЗначение, "ШаблонСпайки");
		
КонецПроцедуры

&НаСервере
Функция ПроверитьДобавитьСтрокуВШаблонСканированияСпайки(Номенклатура, СканировалиЛинейнымШК = Ложь)
	
	СтруктураПоиска = Новый Структура("Номенклатура", Номенклатура);
	НайденныеСтроки = ШаблонСпайки.НайтиСтроки(СтруктураПоиска);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		
		НовСтр = ШаблонСпайки.Добавить();
		НовСтр.Номенклатура = Номенклатура;
		НовСтр.СканировалиЛинейнымШК = СканировалиЛинейнымШК;
		
		Возврат Истина;
		
	Иначе
		
		СтрокаШаблон = НайденныеСтроки[0];
		
		Если СканировалиЛинейнымШК = СтрокаШаблон.СканировалиЛинейнымШК Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

// Кельманов А.В. - HELP-5254 - 2026.03.23
&НаСервере
Функция ПроверитьВсеКомплектыСобраны(Комплект)
	
	ВсеКомплектыСобраны = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаданиеНаСборкуКомплектовЧЗТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(ЗаданиеНаСборкуКомплектовЧЗТовары.Количество) КАК КоличествоЗСБ
	               |ПОМЕСТИТЬ ВТ_ЗСБ
	               |ИЗ
	               |	Документ.ЗаданиеНаСборкуКомплектовЧЗ.Товары КАК ЗаданиеНаСборкуКомплектовЧЗТовары
	               |ГДЕ
	               |	ЗаданиеНаСборкуКомплектовЧЗТовары.Ссылка = &ЗСБ
	               |	И ЗаданиеНаСборкуКомплектовЧЗТовары.Номенклатура = &Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаданиеНаСборкуКомплектовЧЗТовары.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта.Владелец КАК Продукция,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта) КАК КоличествоЛСК
	               |ПОМЕСТИТЬ ВТ_ЛСК
	               |ИЗ
	               |	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
	               |ГДЕ
	               |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта.Владелец = &Номенклатура
	               |	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.ДокОснование = &ЗСБ
	               |	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.Проведен
	               |	И НЕ ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта.ВерсияДанных ЕСТЬ NULL
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта.Владелец
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ЗСБ.КоличествоЗСБ КАК КоличествоЗСБ,
	               |	ЕСТЬNULL(ВТ_ЛСК.КоличествоЛСК, 0) КАК КоличествоЛСК
	               |ИЗ
	               |	ВТ_ЗСБ КАК ВТ_ЗСБ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЛСК КАК ВТ_ЛСК
	               |		ПО ВТ_ЗСБ.Номенклатура = ВТ_ЛСК.Продукция";
	
	Запрос.УстановитьПараметр("ЗСБ", Объект.ДокОснование);
	Запрос.УстановитьПараметр("Номенклатура", Комплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ДоступноКомплектов = Выборка.КоличествоЗСБ - Выборка.КоличествоЛСК;
		
		Если ДоступноКомплектов = 0 Тогда
			
			ВсеКомплектыСобраны = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВсеКомплектыСобраны;
	
КонецФункции

// Кельманов А.В. - HELP-5254 - 2026.03.23
&НаСервере
Процедура ЗаполнитьДопустимыеКомплектующие_Продукция()
	
	ДопустимыеКомплектующие_Продукция.Очистить();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗаданиеНаСборкуКомплектовЧЗКомплектующие.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	Документ.ЗаданиеНаСборкуКомплектовЧЗ.Комплектующие КАК ЗаданиеНаСборкуКомплектовЧЗКомплектующие
	               |ГДЕ
	               |	ЗаданиеНаСборкуКомплектовЧЗКомплектующие.Ссылка = &ЗНБ
	               |	И ЗаданиеНаСборкуКомплектовЧЗКомплектующие.Продукция = &Продукция
	               |	И ЗаданиеНаСборкуКомплектовЧЗКомплектующие.Количество * ЗаданиеНаСборкуКомплектовЧЗКомплектующие.Коэффициент <> 0";
	
	Запрос.УстановитьПараметр("ЗНБ", Объект.ДокОснование);
	Запрос.УстановитьПараметр("Продукция", Объект.Продукция);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДопустимыеКомплектующие_Продукция.Добавить(Выборка.Номенклатура);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВводШК(Данные)     
	
	// Кухарь А.Ю.  16.04.2026 начало 
	//OUT-210
	если Лев(Данные,1) = Символ(29) тогда   
		Сообщить("Отсканирован некорректный код ЧЗ, содержащий 1м символом <GS1>. Код на этом товаре нужно заменить на правильный.");
		Возврат;
	КонецЕсли;
	// Кухарь А.Ю.  16.04.2026 конец
	
	// Кухарь А.Ю.  02.04.2026 начало
	Данные = СтрЗаменить(Данные,Символ(29),"");  
	// Кухарь А.Ю.  02.04.2026 конец
	
	// Кельманов А.В. - ИЗМ-0000000124 - 2026.07.02 {
	Если НужноОтсканироватьТипКороба Тогда
		
		ТекстОшибки = "";
		
		ОбработатьСканированиеТипаКороба(Данные, ТекстОшибки);
		
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			
			Сообщить(ТекстОшибки);
			
		Иначе
			
			ЗавершитьСборку(Неопределено);
			
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	// Кельманов А.В. - ИЗМ-0000000124 - 2026.07.02 }
	
	// Кухарь А.Ю. 06.05.2025 начало          
	ОбновлятьФорму=ложь;
	если объект.ДатаНачалаСканирования=ПустаяДата() тогда   
		объект.ДатаНачалаСканирования=ТекущаяДата();
		ОбновлятьФорму=Истина;
	КонецЕсли;
	// Кухарь А.Ю. 06.05.2025 конец

	// Кельманов А.В. - HELP-6053 - 2025.07.17 {
	
	// Кельманов А.В. - HELP-5254 - 2026.03.23 {
	//Если Объект.фРежим = 2 Тогда
	Если Объект.фРежим = 2 Или (Объект.фРежим = 0 И Не ЗначениеЗаполнено(Объект.Продукция) И Не ЗначениеЗаполнено(Объект.КоличествоДокумента)) Тогда
	// Кельманов А.В. - HELP-5254 - 2026.03.23 }
		
		Товар = НайтиТоварПоШК(Данные);	
		
		// Кельманов А.В. - HELP-9632 - 2026.04.30 {
		Если Не ЗначениеЗаполнено(Товар) Тогда
			
			Товар = НайтиТоварПоМатрице(Данные);
			
		КонецЕсли;
		// Кельманов А.В. - HELP-9632 - 2026.04.30 }
		
		Если ЗначениеЗаполнено(Товар) Тогда
			
			Если ДопустимыеКомплекты.НайтиПоЗначению(Товар) <> Неопределено Тогда
				
				// Кельманов А.В. - HELP-5254 - 2026.03.23 {
				//Объект.Продукция = Товар;
				Если ПроверитьВсеКомплектыСобраны(Товар) Тогда
					
					ТекстСообщения = СтрШаблон("Собраны все комплекты '%1' ( %2 ) по заданию на сборку %3 !", Товар, ПолучитьРеквизитШапки(Товар, "Код"), Объект.ДокОснование);
					ПоказатьПредупреждение(, ТекстСообщения);			
					МаркировкаК.ВоспроизвестиЗвукОшибки();
					
				Иначе
					
					Объект.Продукция = Товар;
					
					Если Объект.фРежим = 0 Тогда
						
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = СтрШаблон("Доступно комплектов '%1' ( %2 ) для сборки: %3 !", Товар, ПолучитьРеквизитШапки(Товар, "Код"), ДоступноКомплектов);
						Сообщение.Сообщить();
						
						ЗаполнитьДопустимыеКомплектующие_Продукция();
						
						ПоказатьПредупреждение(, "Укажите плановое количество спаек!");
						
						Элементы.КоличествоПродукции.ТолькоПросмотр = Ложь;
						Элементы.КоличествоПродукции.ЦветФона = WebЦвета.Бирюзовый; 
						ЭтаФорма.ТекущийЭлемент = Элементы.КоличествоПродукции;	
						
						ХэшКомплектов = ПолучитьХэшиКомплектовЗадания(); // Кельманов А.В. - HELP-9640 - 2026.05.12 {
		
					КонецЕсли;
					
				КонецЕсли;
				// Кельманов А.В. - HELP-5254 - 2026.03.23 }
				
			Иначе
				
				ТекстСообщения = СтрШаблон("Набор: '%1' ( %2 ) отсутствует в задании на сборку !", Товар, ПолучитьРеквизитШапки(Товар, "Код"));
				ПоказатьПредупреждение(, ТекстСообщения);			
				МаркировкаК.ВоспроизвестиЗвукОшибки();
				
				// Кельманов А.В. - HELP-5254 - 2026.03.23 {
				Если Объект.фРежим = 0 Тогда
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Отсканируйте линейный ШК спайки";
					Сообщение.Сообщить();
					
					ЗаполнитьДопустимыеКомплектующие_Продукция();
					
				КонецЕсли;
				// Кельманов А.В. - HELP-5254 - 2026.03.23 }
				
			КонецЕсли;		
			
			// Кельманов А.В. - HELP-5254 - 2026.03.23 {
		Иначе
			
			Если Объект.фРежим = 0 Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Отсканируйте линейный ШК спайки";
				Сообщение.Сообщить();
				
				ЗаполнитьДопустимыеКомплектующие_Продукция();
				
			КонецЕсли;
			// Кельманов А.В. - HELP-5254 - 2026.03.23 }
			
		КонецЕсли;  	
		
		Возврат;
		
	КонецЕсли;
	// Кельманов А.В. - HELP-6053 - 2025.07.17 }
	
	// Кельманов А.В. - HELP-5254 - 2026.03.30 {
	Если Объект.фРежим = 0 И Не ЗначениеЗаполнено(Объект.КоличествоДокумента) Тогда
		
		ПоказатьПредупреждение(, "Укажите плановое количество спаек!");
		
		Элементы.КоличествоПродукции.ТолькоПросмотр = Ложь;
		Элементы.КоличествоПродукции.ЦветФона = WebЦвета.Бирюзовый;
		ЭтаФорма.ТекущийЭлемент = Элементы.КоличествоПродукции;
		
		Возврат;
		
	КонецЕсли;
	// Кельманов А.В. - HELP-5254 - 2026.03.30 }
	
	// Кельманов А.В. - HELP-5254 - 2026.03.25 {
	Если Объект.фРежим = 0 И ЗначениеЗаполнено(ОжидаемыйДляСканированияКодЧЗ) Тогда
		
		ОтсканированОжидаемыйКодЧЗ = Истина; 
		
		Номенклатура = Неопределено;
		
		Данные = СтрЗаменить(Данные, Символ(29), "");
		Данные = Лев(СтрЗаменить(Данные, Символы.ПС, ""), 31);
		
		рПоиска = НайтиТоварПоКМ(Данные);
		
		Если Не рПоиска.Успешно Тогда                
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрСоединить(рПоиска.Ошибки, Символы.ПС);
			Сообщение.Сообщить();
			
			ОтсканированОжидаемыйКодЧЗ = Ложь;
			
		ИначеЕсли рПоиска.Данные.КодМаркировки <> ОжидаемыйДляСканированияКодЧЗ Тогда
			
			Номенклатура = рПоиска.Данные.Номенклатура;

			ОтсканированОжидаемыйКодЧЗ = Ложь;
			
		Иначе
			
			Номенклатура = рПоиска.Данные.Номенклатура;
			
			Результат = ДобавитьКМвДокумент_ОбычныйРежим(рПоиска.Данные.Номенклатура, рПоиска.Данные.КодМаркировки);
			
			ОжидаемыйДляСканированияКодЧЗ = Неопределено;
			
			ОпределитьОжидаемыйДляСканированияКодЧЗ();
			
			Если Объект.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("КодКомплектаПодтвержденСканированием", Ложь)).Количество() = 0
				И Объект.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("ШтрихкодУпаковки", ПредопределенноеЗначение("Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка"))).Количество() = 0 Тогда
				
				Модифицированность = Истина; // Кельманов А.В. - Оптимизация работы - 2026.04.09
				
				ЗавершитьСборку(Неопределено);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ОтсканированОжидаемыйКодЧЗ Тогда
			
			ПоказатьПредупреждение(, "Отсканируйте код ЧЗ спайки: " + ОжидаемыйДляСканированияКодЧЗ);
			
		КонецЕсли;
		
		пПика = Новый Структура("ДанныеПоШК,КодировкаШК", Номенклатура, ПредопределенноеЗначение("Перечисление.ТипыКодировокШК.DataMatrix"));
		МаркировкаК.ЗаписатьФактСканирования(Данные, Объект.Ссылка, пПика);

		Возврат;
			
	КонецЕсли;
	// Кельманов А.В. - HELP-5254 - 2026.03.25 }
	
	Если СокрЛП(Данные) = "8888888890003" ИЛИ СокрЛП(Данные) = "8888888889915" Тогда
		//+++Чирков Д.С. 19.01.2026 фиксация пиков
		МаркировкаК.ЗаписатьФактСканирования(Данные, Объект.Ссылка);
		//---Чирков Д.С. 19.01.2026 фиксация пиков
		
		Если НайтиКомплект() Тогда
			рУстановки = УстановитьКодКомплекта(ТекущйКомплект);			
			Если рУстановки.Успешно Тогда
				РаспечататьКодКомплекта();
			// Кельманов А.В. - Оптимизация работы - 2025.08.28 {
			Иначе
				МаркировкаК.ВывестиОшибки(рУстановки);
				МаркировкаК.ВоспроизвестиЗвукОшибки();
			// Кельманов А.В. - Оптимизация работы - 2025.08.28 }
			КонецЕсли; 
		Иначе			
			МаркировкаК.ВоспроизвестиЗвукОшибки();
			ПоказатьПредупреждение(, "Не найден требуемый комплект по текущему составу комплектующих !");
		КонецЕсли;  
		// Кухарь А.Ю. 06.05.2025 начало
	ИначеЕсли Лев(Данные,3)="777" тогда
		Объект.СборщикКомплектаТСД = НайтиФизЛицоПоШК(Данные);   
		Сообщить("Установлен сотрудник - "+Объект.СборщикКомплектаТСД);
		ОбновлятьФорму=Истина;

		// Кухарь А.Ю. 06.05.2025 конец
		
		//+++Чирков Д.С. 19.01.2026 фиксация пиков          
		пПика = Новый Структура("ДанныеПоШК,КодировкаШК", Объект.СборщикКомплектаТСД, ПредопределенноеЗначение("Перечисление.ТипыКодировокШК.EAN13"));
		МаркировкаК.ЗаписатьФактСканирования(Данные, Объект.Ссылка, пПика);
		//---Чирков Д.С. 19.01.2026 фиксация пиков	
	ИначеЕсли СтрДлина(Данные) < 31 Тогда
		Номенклатура = НайтиТоварПоШК(Данные);
		//+++Чирков Д.С. 19.01.2026 фиксация пиков          
		пПика = Новый Структура("ДанныеПоШК,КодировкаШК", Номенклатура, ПредопределенноеЗначение("Перечисление.ТипыКодировокШК.EAN13"));
		МаркировкаК.ЗаписатьФактСканирования(Данные, Объект.Ссылка, пПика);
		//---Чирков Д.С. 19.01.2026 фиксация пиков		
		
		Если ЗначениеЗаполнено(Номенклатура) Тогда
			ВидНоменклатуры = ПолучитьРеквизитШапки(Номенклатура, "Родитель.ВидНоменклатуры");
			
			// Смирнов М.Ю. 19.05.2025 HELP-4279 начало
			Если ВидНоменклатуры <> Перечисления.ВидыНоменклаутры.Товар Тогда
				
				ДобавитьВспомогательныйТоварВДокумент(Номенклатура); 
			
			ИначеЕсли ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Товар Тогда
				
				// Кельманов А.В. - HELP-4236 - 2025.07.17 {
				//// Андреев И.Д. 04.в06.2025 начало	
				//Если не объект.фРежим = 2 тогда
				//	Сообщить("В данном документе разрешено сканировать товар только по кодам ЧЗ !", СтатусСообщения.Важное);
				//конецесли;			
				//// Андреев И.Д. 04.06.2025 конец
				Если ЭтоСкладМаркированногоТовара Тогда
					
					ПоказатьПредупреждение(, "В данном документе разрешено сканировать товар только по кодам ЧЗ!");
					
					Возврат;
					
				КонецЕсли;			
				// Кельманов А.В. - HELP-4236 - 2025.07.17 }
				
				Если ПроверитьДобавитьСтрокуВШаблонСканированияСпайки(Номенклатура, Истина) Тогда
					ДобавитьВспомогательныйТоварВДокумент(Номенклатура);
				Иначе
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Данная номенклатура должна быть сканирована другим типом кода";
					Сообщение.Сообщить();
				КонецЕсли;
			
			КонецЕсли;
			
			//Иначе
			//	Сообщить("В данном документе разрешено сканировать товар только по кодам ЧЗ !", СтатусСообщения.Важное);				
			//КонецЕсли;
			// Смирнов М.Ю. 19.05.2025 HELP-4279 конец
			
		КонецЕсли;
	Иначе			
	    //Кухарь 23.03.2025 начало
		Данные 	= СтрЗаменить(Данные, Символ(29), "");
		//Кухарь 23.03.2025 конец
		Данные 	= Лев(СтрЗаменить(Данные, Символы.ПС, ""), 31);
		
		рПоиска = НайтиТоварПоКМ(Данные);
		//+++Чирков Д.С. 19.01.2026 фиксация пиков
		Номенклатура = Неопределено;              
		//---Чирков Д.С. 19.01.2026 фиксация пиков
		
		Если рПоиска.Успешно Тогда                
			//+++Чирков Д.С. 19.01.2026 фиксация пиков
			Номенклатура = рПоиска.Данные.Номенклатура;
			//---Чирков Д.С. 19.01.2026 фиксация пиков
			
			// Смирнов М.Ю. 19.05.2025 HELP-4279 начало
			Если ПроверитьДобавитьСтрокуВШаблонСканированияСпайки(рПоиска.Данные.Номенклатура) Тогда
				ДобавитьКМвДокумент(рПоиска.Данные.Номенклатура, рПоиска.Данные.КодМаркировки);
			Иначе
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Данная номенклатура должна быть сканирована другим типом кода";
				Сообщение.Сообщить();
			КонецЕсли;
			// Смирнов М.Ю. 19.05.2025 HELP-4279 конец			
		Иначе
			ПоказатьПредупреждение(, СтрСоединить(рПоиска.Ошибки, Символы.ПС));		
		КонецЕсли;
		
		//+++Чирков Д.С. 19.01.2026 фиксация пиков
		пПика = Новый Структура("ДанныеПоШК,КодировкаШК", Номенклатура, ПредопределенноеЗначение("Перечисление.ТипыКодировокШК.DataMatrix"));
		МаркировкаК.ЗаписатьФактСканирования(Данные, Объект.Ссылка, пПика);
		//---Чирков Д.С. 19.01.2026 фиксация пиков
	КонецЕсли;	
	
	РаспечататьКодКомплекта_СОграничениемВыводаСообщений(Ложь); // Кельманов А.В. - HELP-7319 - 2025.12.01
	
	// Кельманов А.В. - HELP-6053 - 2025.07.17 {
	//// Андреев И.Д. 04.06.2025 начало
	//Если объект.фРежим = 2 и не Лев(Данные,3)="777"  тогда 		
	//	Товар =  НайтиТоварПоШК(Данные);	
	//	Если ЗначениеЗаполнено(Товар) тогда
	//		объект.Продукция = 	Товар;
	//	КонецЕсли;  	
	//КонецЕсли;
	//// Андреев И.Д. 04.06.2025 конец
	// Кельманов А.В. - HELP-6053 - 2025.07.17 }
	
	// Кухарь А.Ю. 06.05.2025 начало
	если ОбновлятьФорму тогда
		УправлениеВидимостью();
	КонецЕсли;
	// Кухарь А.Ю. 06.05.2025 конец
	
КонецПроцедуры //ОбработатьВводШК(Данные)

// Кельманов А.В. - ИЗМ-0000000124 - 2026.07.02
&НаСервере
Процедура ОбработатьСканированиеТипаКороба(Данные, ТекстОшибки = "")
	
	ТипКороба = Справочники.ТипыКоробов.НайтиПоРеквизиту("ШтрихКод", Данные);			 
	
	Если ТипКороба.Пустая() Тогда
		
		ТекстОшибки = "Не найден тип короба с штрих-кодом: """ + Данные + """ !";
		
	ИначеЕсли Не ЗначениеЗаполнено(ТипКороба.Объем) Тогда
		
		ТекстОшибки = "Для типа короба """ + ТипКороба 
		+ " не указан объём. Заполните объём типа короба в элементе справочника или отсканируйте другой ШК коробки.";
		
	Иначе
		
		НужноОтсканироватьТипКороба = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ДобавитьКМвДокумент(Номенклатура, КодМаркировки)
	рПроверки = МожноДобавлятьКодКомплектующего(КодМаркировки);
	Если НЕ рПроверки.Успешно Тогда
		МаркировкаКС.ВывестиОшибки(рПроверки);
		МаркировкаК.ВоспроизвестиЗвукОшибки(3);
		Возврат рПроверки;	
	КонецЕсли;
	
	Если Объект.фРежим = 0 Тогда
		Результат = ДобавитьКМвДокумент_ОбычныйРежим(Номенклатура, КодМаркировки); 		
	ИначеЕсли Объект.фРежим = 1 Тогда
		Результат = ДобавитьКМвДокумент_УпрощенныйРежим(Номенклатура, КодМаркировки);		
	Иначе
		ПоказатьПредупреждение(, "В пакетом режиме сканирование в документ не допускается !");
		МаркировкаК.ВоспроизвестиЗвукОшибки(3);
	КонецЕсли;	
	
	Элементы.фРежим.ТолькоПросмотр = (Объект.ШтрихкодыУпаковок.Количество() > 0);
	
	Возврат Результат;
КонецФункции //ДобавитьКМвДокумент(Номенклатура, КодМаркировки)

&НаКлиенте
Функция МожноДобавлятьКодКомплектующего(КодМаркировки)
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	ТекСтатус	= МаркировкаС.ТекущийСтатусКодаФакт(КодМаркировки);
	Если ЕстьКМКомплектующегоВДокументе(КодМаркировки) Тогда
		Если ТекСтатус = Перечисления.СтатусыКодовМаркировкиФакт.Распечатан Тогда					
		Иначе			
			Результат.Ошибки.Добавить(СтрШаблон("Код маркировки: '%1' уже сканировался в этот документ !", КодМаркировки));
		КонецЕсли;
	Иначе		
		Если ТекСтатус = Перечисления.СтатусыКодовМаркировкиФакт.ВОбороте
			ИЛИ ТекСтатус = Перечисления.СтатусыКодовМаркировкиФакт.Нанесен Тогда
			Результат.Успешно = Истина;
		Иначе
			Результат.Ошибки.Добавить(СтрШаблон("Недопустимый статус КМ: '%1' !", КодМаркировки));
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //МожноДобавлятьКодКомплектующего(КодМаркировки)

&НаКлиенте
Функция ЕстьКМКомплектующегоВДокументе(КодМаркировки)
	Возврат (Объект.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("ШтрихкодУпаковки", КодМаркировки)).Количество() > 0);
КонецФункции //ЕстьКМКомплектующегоВДокументе(КодМаркировки) 

&НаКлиенте
Функция ДобавитьКМвДокумент_ОбычныйРежим(Номенклатура, КодМаркировки)
	
	Нашли = Ложь;
	
	// Кельманов А.В. - HELP-5254 - 2026.03.24 {
	//Если ДопустимыеКомплектующие.НайтиПоЗначению(Номенклатура) <> Неопределено Тогда
	Если ДопустимыеКомплектующие_Продукция.НайтиПоЗначению(Номенклатура) <> Неопределено Тогда
	// Кельманов А.В. - HELP-5254 - 2026.03.24 }
		
		Нашли = Истина;
		Строки = Объект.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("ШтрихкодУпаковки", КодМаркировки));
		Если Строки.Количество() = 0 Тогда				
			СтрокаТЧ = Объект.ШтрихкодыУпаковок.Добавить();
			СтрокаТЧ.Комплектующее		= Номенклатура;
			СтрокаТЧ.ШтрихкодУпаковки 	= КодМаркировки;
		    //++Данилова Е.В. 11.06.2026 №0000001219
			ИдентификаторСтроки = СтрокаТЧ.ПолучитьИдентификатор(); 
			Элементы.ШтрихкодыУпаковок.ТекущаяСтрока = ИдентификаторСтроки; 
			//--Данилова Е.В. 11.06.2026 
			НайтиКомплект();
		Иначе
			ТекстСообщения = СтрШаблон("Код маркировки : '%1' уже присутствует в документе !", КодМаркировки); 
			ПоказатьПредупреждение(, ТекстСообщения);				
			МаркировкаК.ВоспроизвестиЗвукОшибки();
		КонецЕсли;				
	КонецЕсли;
	
	Если ДопустимыеКомплекты.НайтиПоЗначению(Номенклатура) <> Неопределено Тогда
		Нашли	= Истина;				
		Строки	= Объект.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("ШтрихкодКомплекта", КодМаркировки));
		
		Ошибки = Новый Массив;
		
		Если Строки.Количество() = 0 Тогда
			Ошибки.Добавить("Не обнаружено строк комплектующих для комплекта ! " + Номенклатура);
		Иначе
			Для Каждого СтрокаТЧ Из Строки Цикл
				Если СтрокаТЧ.КодКомплектаПодтвержденСканированием Тогда
					Ошибки.Добавить("Код комплекта уже сканировался в документ ! Стр.: " + Объект.ШтрихкодыУпаковок.Индекс(СтрокаТЧ));
				КонецЕсли; 				
			КонецЦикла;			
		КонецЕсли;		
		
		Если Ошибки.Количество() = 0  Тогда
			Для Каждого СтрокаТЧ Из Строки Цикл
				СтрокаТЧ.КодКомплектаПодтвержденСканированием = Истина;					
			КонецЦикла;
			//++Данилова Е.В. 11.06.2026 №0000001219 
			Если Строки.Количество() > 0 Тогда 
				ИдентификаторСтроки = СтрокаТЧ.ПолучитьИдентификатор(); 
				Элементы.ШтрихкодыУпаковок.ТекущаяСтрока = ИдентификаторСтроки;
			КонецЕсли;
			ОбновитьКоличествоСобранныхКомплектов(); 
			//--Данилова Е.В. 11.06.2026
			Записать();
		Иначе
			ПоказатьПредупреждение(, СтрСоединить(Ошибки, Символы.ПС));
		КонецЕсли;				
	КонецЕсли;
	
	Если Не Нашли Тогда
				
		// Кельманов А.В. - HELP-5254 - 2026.03.24 {
		//ТекстСообщения = СтрШаблон("Номенклатура: '%1' ( %2 ) отсутствует в задании на сборку !", Номенклатура, ПолучитьРеквизитШапки(Номенклатура, "Код"));
		ТекстСообщения = СтрШаблон("Номенклатура: '%1' ( %2 ) отсутствует в комплекте: '%3' !", Номенклатура, ПолучитьРеквизитШапки(Номенклатура, "Код"), Объект.Продукция);
		// Кельманов А.В. - HELP-5254 - 2026.03.24 }
		
		ПоказатьПредупреждение(, ТекстСообщения);			
		МаркировкаК.ВоспроизвестиЗвукОшибки();
		
	КонецЕсли;
	
КонецФункции //ДобавитьКМвДокумент(Номенклатура, КодМаркировки)

&НаКлиенте
Функция ДобавитьКМвДокумент_УпрощенныйРежим(Номенклатура, КодМаркировки)
	Если ДопустимыеКомплекты.НайтиПоЗначению(Номенклатура) <> Неопределено Тогда
		Строки	= Объект.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("ШтрихкодКомплекта", ПредопределенноеЗначение("Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка")));
		Если Строки.Количество() = 0 Тогда
			рПолучения = ПолучитьЗабронироватьКодыКомплектующих(Номенклатура);			
			Если рПолучения.Успешно Тогда
				Данные = рПолучения.Данные;
				Для Каждого ШтрихкодУпаковки Из Данные.КодыКомплектующих Цикл
					СтрокаТЧ = Объект.ШтрихкодыУпаковок.Добавить();									
					
					СтрокаТЧ.ШтрихкодКомплекта	= КодМаркировки;
					СтрокаТЧ.ШтрихкодУпаковки	= ШтрихкодУпаковки;
					СтрокаТЧ.Комплектующее		= ПолучитьРеквизитШапки(ШтрихкодУпаковки, "Владелец");					
					СтрокаТЧ.ДатаФормированияКомплекта = Данные.ДатаФормированияКомплекта;
					//++Данилова Е.В. 11.06.2026 №0000001219
					ИдентификаторСтроки = СтрокаТЧ.ПолучитьИдентификатор(); 
					Элементы.ШтрихкодыУпаковок.ТекущаяСтрока = ИдентификаторСтроки; 
					//--Данилова Е.В. 11.06.2026
				КонецЦикла; 			
				
				Для каждого СтрокаНТК Из Данные.НеТоварныеКомплектующие Цикл
					Для Сч = 1 По СтрокаНТК.Количество  Цикл
						СтрокаТЧ.ШтрихкодКомплекта	= КодМаркировки;						
						СтрокаТЧ.Комплектующее		= СтрокаНТК.Комплектующее;					
						СтрокаТЧ.ДатаФормированияКомплекта = Данные.ДатаФормированияКомплекта;					
					КонецЦикла;
				КонецЦикла; 
				
				Записать();
			Иначе				
				ПоказатьПредупреждение(, СтрСоединить(рПолучения, Символы.ПС));
				МаркировкаК.ВоспроизвестиЗвукОшибки();
			КонецЕсли; 
		Иначе			
			ТекстСообщения = СтрШаблон("В документе найдены строки недозаполненного набора !");
			ПоказатьПредупреждение(, ТекстСообщения);			
			МаркировкаК.ВоспроизвестиЗвукОшибки();
		КонецЕсли;
	Иначе
		ТекстСообщения = СтрШаблон("Набор: '%1' ( %2 ) отсутствует в задании на сборку !", Номенклатура, ПолучитьРеквизитШапки(Номенклатура, "Код"));
		ПоказатьПредупреждение(, ТекстСообщения);			
		МаркировкаК.ВоспроизвестиЗвукОшибки();
	КонецЕсли;		
КонецФункции //ДобавитьКомлектВДокумент_УпрощенныйРежим() 

&НаСервере
Функция ПолучитьЗабронироватьКодыКомплектующих(Набор)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Номенклатура,	
	|	Количество,
	|	Номенклатура.Родитель.ВидНоменклатуры КАК ВидНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура.Коплектующие 
	|ГДЕ
	|	Ссылка = &Набор	
	|";
	
	Запрос.УстановитьПараметр("Набор", Набор);	
	
	КодыКомплектующих 		= Новый Массив;
	НеТоварныеКомплектующие = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Товар Тогда
			Для Сч = 0 По Выборка.Количество() Цикл
				рПолучения = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыШтук(Выборка.Номенклатура, Объект.Ссылка, Новый Структура("Количество", Выборка.Количество));
				Если рПолучения.Успешно Тогда
					Для Каждого ШтрихкодУпаковки Из рПолучения.Данные Цикл
						КодыКомплектующих.Добавить(ШтрихкодУпаковки);				
					КонецЦикла;
				Иначе
					МаркировкаКС.ДобавитьОшибки(Результат, рПолучения);				
					Прервать;
				КонецЕсли; 
			КонецЦикла;			
		Иначе			
			НеТоварныеКомплектующие.Добавить(Новый Структура("Комплектующее,Количество", Выборка.Номенклатура, Выборка.Количество));
		КонецЕсли;
	КонецЦикла;
	
	Если Результат.Ошибки.Количество() = 0 Тогда
		ДатаФормированияКомплекта = ТекущаяДата();
		РегистрыСведений.СтатусыКМ_Факт.УстановитьСтатусКМ(КодыКомплектующих, Перечисления.СтатусыКодовМаркировкиФакт.Вложен, Объект.Ссылка, Новый Структура("Добавлять,Период,ИспользоватьУправляемыеБлокировки", Истина, ДатаФормированияКомплекта, Истина));
		
		Результат.Данные = Новый Структура(
			"НеТоварныеКомплектующие,КодыКомплектующих,ДатаФормированияКомплекта",
			НеТоварныеКомплектующие,КодыКомплектующих,ДатаФормированияКомплекта
		);		
	Иначе
		Результат.Успешно = Ложь;		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПолучитьЗабронироватьКодыКомплектующих(Набор)

&НаКлиенте
Функция ДобавитьВспомогательныйТоварВДокумент(Номенклатура)
	Если ДопустимыеКомплектующие.НайтиПоЗначению(Номенклатура) <> Неопределено Тогда		
		СтрокаТЧ = Объект.ШтрихкодыУпаковок.Добавить();
		СтрокаТЧ.Комплектующее	= Номенклатура;
		
		НайтиКомплект();		
	Иначе	
		ТекстСообщения = СтрШаблон("Номенклатура: '%1' ( %2 ) отсутствует в задании на сборку !", Номенклатура, ПолучитьРеквизитШапки(Номенклатура, "Код"));
		ПоказатьПредупреждение(, ТекстСообщения);			
		МаркировкаК.ВоспроизвестиЗвукОшибки();
	КонецЕсли;
КонецФункции //ДобавитьКМвДокумент(Номенклатура, КодМаркировки)

&НаКлиенте
Функция НайтиКомплект()
	рПоиска = НайтиКомплектПоКомплектующим();
	Если рПоиска.Успешно Тогда
		ТекущйКомплект = рПоиска.Данные.Комплект;
	Иначе
		ТекущйКомплект = Неопределено;		
	КонецЕсли;
	КоличествоКомплектующих = рПоиска.Данные.КоличествоКомплектующих;
	
	Если КоличествоКомплектующих > 0 Тогда
		Элементы.КоличествоКомплектующих.ЦветТекстаЗаголовка = WebЦвета.Красный;
		Элементы.КоличествоКомплектующих.ЦветТекста = WebЦвета.Красный;
	Иначе
		Элементы.КоличествоКомплектующих.ЦветТекстаЗаголовка = WebЦвета.Зеленый;
		Элементы.КоличествоКомплектующих.ЦветТекста = WebЦвета.Зеленый;
	КонецЕсли; 
	
	Возврат ЗначениеЗаполнено(ТекущйКомплект);
КонецФункции //НайтиКомплект()

&НаКлиенте
Функция ОбновитьКоличествоСвободныхКомплектующих()
	
	мОтборстрок = Новый Структура("ШтрихкодКомплекта", Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка());
	КоличествоКомплектующих = Объект.ШтрихкодыУпаковок.НайтиСтроки(мОтборстрок).Количество();
	 
КонецФункции //ОбновитьКоличествоСвободныхКомплектующих() 
//++Данилова Е.В. 15.06.2026 №0000001219
&НаКлиенте
Функция ОбновитьКоличествоСобранныхКомплектов()
	
	мОтборстрок = Новый Структура("КодКомплектаПодтвержденСканированием",истина);
	СтрокиСобранные = Объект.ШтрихкодыУпаковок.НайтиСтроки(мОтборстрок);
	КМКомплекты = Новый Соответствие(); 
	Для Каждого СтрокаСобранная Из СтрокиСобранные Цикл
		КМКомплекты.Вставить(СтрокаСобранная.ШтрихкодКомплекта); 
	КонецЦикла;	
	КоличествоСобранныхКомплектов = КМКомплекты.Количество();	
	
КонецФункции
//--Данилова Е.В. 15.06.2026 
 
&НаКлиенте
Функция НайтиКомплектПоКомплектующим()
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Коды = Новый Массив;
	Для Каждого Строка Из Объект.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("ШтрихкодКомплекта", Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка())) Цикл
		Если ЗначениеЗаполнено(Строка.Комплектующее) Тогда
			Коды.Добавить(Строка.Комплектующее);		
		КонецЕсли;
	КонецЦикла;
	
	мТекКомплект = ХэшКомплектов[ПолучитьХэшКомплектаПоНом(Коды)];
	
	// Кельманов А.В. - HELP-9583 - 2026.04.28 {
	Если Объект.фРежим = 0 И ЗначениеЗаполнено(Объект.Продукция) И ЗначениеЗаполнено(мТекКомплект) И Объект.Продукция <> мТекКомплект Тогда
		
		мТекКомплект = Неопределено;
		
	КонецЕсли;
	// Кельманов А.В. - HELP-9583 - 2026.04.28 }
	
	Результат.Данные = Новый Структура("Комплект,КоличествоКомплектующих", мТекКомплект, Коды.Количество());	
	Если ЗначениеЗаполнено(мТекКомплект) Тогда		
		Результат.Успешно = Истина;
	Иначе
		Результат.Ошибки.Добавить("Не удалось определить набор по текущим комплектующим !");		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //НайтиКомплектПоКомплектующим()
 
&НаСервереБезКонтекста
Функция НайтиТоварПоКМ(Знач ДанныеКМ)
	ДанныеКМ	= Лев(СтрЗаменить(ДанныеКМ, Символы.ПС, ""), 31);
	
	Результат	= МаркировкаКС.СтруктураРезультата(Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Владелец		КАК Номенклатура,
	|	Владелец.Код	КАК Номенклатура_Код,
	|	Ссылка 			КАК КодМаркировки,
	|	СпособВводаВОборот
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров	
	|ГДЕ
	|	Наименование = &ДанныеКМ
	|	И ( 
	|		ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Товар)
	|		ИЛИ ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор)
	|	)
	|";
	
	Запрос.УстановитьПараметр("ДанныеКМ", ДанныеКМ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.КодМаркировки) Тогда
		Если ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
			//Валетов + 06,03,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-9098 Закоментил, ибо перемаркировка теперь наше всё
			//Если Выборка.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Перемаркировка Тогда
			//	Результат.Ошибки.Добавить("Недопустимый способ ввода в оборот:  '" + Выборка.СпособВводаВОборот + "' !");
			//Иначе
				Результат.Успешно 	= Истина;
				Результат.Данные 	= Новый Структура("Номенклатура,Номенклатура_Код,КодМаркировки", 
					Выборка.Номенклатура, Выборка.Номенклатура_Код, Выборка.КодМаркировки);			
			//КонецЕсли;
		Иначе
			Результат.Ошибки.Добавить("Не найден код маркировки: '" + ДанныеКМ + "' !");
		КонецЕсли; 
	Иначе
		Результат.Ошибки.Добавить("Не найден код маркировки: '" + ДанныеКМ + "' !");		
	КонецЕсли; 

	Возврат Результат;
КонецФункции //НайтиТоварПоКМ(ДанныеКМ)
 
&НаСервереБезКонтекста
Функция Нечто()

	

КонецФункции // ()
 
&НаСервере
Функция ВнешнееСобытиеНаСервере(Данные)
	
	Если Объект.Ссылка.Пустая() Тогда
		Записать();
	КонецЕсли;	
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиТоварПоШК(Данные)
	Возврат НайтиТоварПоШтрихКоду(Данные, Неопределено, 0, Неопределено, Ложь);
КонецФункции

// Кельманов А.В. - HELP-9632 - 2026.04.30
&НаСервере
Функция НайтиТоварПоМатрице(Данные)
	
	Товар = Неопределено;
	
	ЗСБ = Объект.ДокОснование;
		
	Если ЗначениеЗаполнено(ЗСБ) Тогда
		
		ТЗМатриц = ПолучитьТаблицуМатриц(ЗСБ.ДокОснование);		

		МассМатрицы = ТЗМатриц.НайтиСтроки(Новый Структура("ШККонтрагента", Данные));
		
		Если МассМатрицы.Количество() > 0 Тогда
			
			СтрокаМатрицы = МассМатрицы.Получить(0);
			
			Товар = СтрокаМатрицы.Номенклатура;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Товар;
	
КонецФункции

// Кухарь А.Ю. 06.05.2025 начало
&НаСервереБезКонтекста
Функция НайтиФизЛицоПоШК (Данные)
	Возврат Справочники.ФизическиеЛица.НайтиПоРеквизиту("ШтрихКод",Данные);
КонецФункции
// Кухарь А.Ю. 06.05.2025 конец

&НаСервереБезКонтекста
Процедура ШтрихкодыУпаковокПриАктивизацииСтроки_НаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура РаспечататьКодКомплекта(Команда = Неопределено)

	// Кельманов А.В. - HELP-7319 - 2025.12.01 {
	//рПроверки = ПроверитьЗаполнениеКомплектующих();
	//Если рПроверки.Успешно Тогда		
	//	рПоиска = НайтиКомплектПоКомплектующим();
	//	Если рПоиска.Успешно Тогда
	//		ТекущйКомплект = рПоиска.Данные.Комплект;
	//		
	//		рУстановки = УстановитьКодКомплекта(ТекущйКомплект);			
	//		Если рУстановки.Успешно Тогда
	//			ОбновитьКоличествоСвободныхКомплектующих();
	//			рПечати = НапечататьКодКомплекта_НаСервере(рУстановки.Данные);
	//			Если рПечати.Успешно Тогда
	//				Если фПечататьКодНабораСразуНаПринтер Тогда
	//					рПечати.Данные.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
	//				Иначе					
	//					рПечати.Данные.Показать("Этикетки по ЛМ: " + ТекущийЛистМаркировки);
	//				КонецЕсли;
	//			Иначе
	//				МаркировкаК.ВывестиОшибки(рПечати);			
	//			КонецЕсли; 
	//		Иначе
	//			МаркировкаК.ВывестиОшибки(рУстановки);
	//			МаркировкаК.ВоспроизвестиЗвукОшибки();
	//		КонецЕсли; 
	//	Иначе
	//		МаркировкаК.ВывестиОшибки(рПоиска);
	//	КонецЕсли;		
	//Иначе
	//	МаркировкаК.ВывестиОшибки(рПроверки);
	//	МаркировкаК.ВоспроизвестиЗвукОшибки();
	//КонецЕсли;
	РаспечататьКодКомплекта_СОграничениемВыводаСообщений();
	// Кельманов А.В. - HELP-7319 - 2025.12.01 }
	
КонецПроцедуры

// Кельманов А.В. - HELP-7319 - 2025.12.01
&НаКлиенте
Процедура РаспечататьКодКомплекта_СОграничениемВыводаСообщений(ВыводитьВсеСообщения = Истина)
		
	// Кельманов А.В. - HELP-5254 - 2026.03.31 {
	Если ЗначениеЗаполнено(ОжидаемыйДляСканированияКодЧЗ) Тогда
		
		рПечати = НапечататьКодКомплекта_НаСервере(ОжидаемыйДляСканированияКодЧЗ);
		
		Если рПечати.Успешно Тогда
			
			Если фПечататьКодНабораСразуНаПринтер Тогда
				рПечати.Данные.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
			Иначе					
				рПечати.Данные.Показать("Этикетки по ЛМ: " + ТекущийЛистМаркировки);
			КонецЕсли;
			
		Иначе
			
			МаркировкаК.ВывестиОшибки(рПечати);
			
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	// Кельманов А.В. - HELP-5254 - 2026.03.31 }
	
	рПроверки = ПроверитьЗаполнениеКомплектующих();
	
	// Кельманов А.В. - HELP-5254 - 2026.03.30 {
	//Если рПроверки.Успешно Тогда		
	Если рПроверки.Успешно Или (Объект.фРежим = 0 И ЗначениеЗаполнено(Объект.Продукция)) Тогда		
	// Кельманов А.В. - HELP-5254 - 2026.03.30 }
		
		рПоиска = НайтиКомплектПоКомплектующим();
		
		Если рПоиска.Успешно Тогда
			
			ТекущйКомплект = рПоиска.Данные.Комплект;
			
			рУстановки = УстановитьКодКомплекта(ТекущйКомплект);			
			//++Данилова Е.В. 15.06.2026 0000001219
			СтрокиПоКМ = Объект.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("ШтрихкодКомплекта",ОжидаемыйДляСканированияКодЧЗ));
			Если СтрокиПоКМ.Количество() > 0   Тогда
				
				ИдентификаторСтроки = СтрокиПоКМ[СтрокиПоКМ.Количество()-1].ПолучитьИдентификатор(); 
				Элементы.ШтрихкодыУпаковок.ТекущаяСтрока = ИдентификаторСтроки; 	
				
			КонецЕсли;
			//--Данилова Е.В. 15.06.2026 
			Если рУстановки.Успешно Тогда
				
				ОбновитьКоличествоСвободныхКомплектующих();
				рПечати = НапечататьКодКомплекта_НаСервере(рУстановки.Данные);
				
				Если рПечати.Успешно Тогда
					
					Если фПечататьКодНабораСразуНаПринтер Тогда
						рПечати.Данные.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
					Иначе					
						рПечати.Данные.Показать("Этикетки по ЛМ: " + ТекущийЛистМаркировки);
					КонецЕсли;
					
				Иначе
					
					МаркировкаК.ВывестиОшибки(рПечати);
					
				КонецЕсли;
				
			Иначе
				
				МаркировкаК.ВывестиОшибки(рУстановки);
				МаркировкаК.ВоспроизвестиЗвукОшибки();
				
			КонецЕсли;
			
		Иначе
			
			Если ВыводитьВсеСообщения Тогда
				
				МаркировкаК.ВывестиОшибки(рПоиска);
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Если ВыводитьВсеСообщения Тогда
			
			МаркировкаК.ВывестиОшибки(рПроверки);
			МаркировкаК.ВоспроизвестиЗвукОшибки();
			
		КонецЕсли;
		
	КонецЕсли;
	
	НайтиКомплект(); // Кельманов А.В. - Оптимизация работы - 2026.03.26

	// Кельманов А.В. - HELP-5254 - 2026.03.25 {
	Если Объект.фРежим = 0 И ЗначениеЗаполнено(ОжидаемыйДляСканированияКодЧЗ) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Отсканируйте код ЧЗ спайки: " + ОжидаемыйДляСканированияКодЧЗ;
		Сообщение.Сообщить();
			
	КонецЕсли;
	// Кельманов А.В. - HELP-5254 - 2026.03.25 }
	
КонецПроцедуры

// Кельманов А.В. - HELP-5254 - 2026.03.30
&НаКлиенте
Процедура ОпределитьОжидаемыйДляСканированияКодЧЗ()
	
	ОпределитьОжидаемыйДляСканированияКодЧЗНаСервере();
	
	Если ЗначениеЗаполнено(ОжидаемыйДляСканированияКодЧЗ) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Отсканируйте код ЧЗ спайки: " + ОжидаемыйДляСканированияКодЧЗ;
		Сообщение.Сообщить();
			
	КонецЕсли;
	
КонецПроцедуры

// Кельманов А.В. - HELP-5254 - 2026.03.30
&НаСервере
Процедура ОпределитьОжидаемыйДляСканированияКодЧЗНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта КАК ШтрихкодКомплекта
	               |ИЗ
	               |	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
	               |ГДЕ
	               |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	               |	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	               |	И НЕ ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.КодКомплектаПодтвержденСканированием
	               |	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка = &ЛСК";
	
	Запрос.УстановитьПараметр("ЛСК", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ОжидаемыйДляСканированияКодЧЗ = Выборка.ШтрихкодКомплекта;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УстановитьКодКомплекта(Комплект)
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Если Объект.Ссылка.Пустая() ИЛИ НЕ Объект.Проведен Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));	
	КонецЕсли;
	
	сНоменклатура 	= Новый Соответствие;
	сНеТовар		= Новый Соответствие;
	
	МассивКодовКомплектующих = Новый Массив; // Кельманов А.В. - Оптимизация работы - 2026.04.09
	
	СтрокиТЧ = Объект.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("ШтрихкодКомплекта", Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка()));
	
	Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
		
		Если СтрокаТЧ.ШтрихкодУпаковки.Пустая() Тогда
			
			Если ПолучитьРеквизитШапки(СтрокаТЧ.Комплектующее,"Родитель.ВидНоменклатуры") = Перечисления.ВидыНоменклаутры.Товар Тогда
				Кол = сНоменклатура[СтрокаТЧ.Комплектующее];
				Если Кол = Неопределено Тогда
					Кол = 0;			
				КонецЕсли;
				сНоменклатура[СтрокаТЧ.Комплектующее] = Кол + 1;			
			Иначе
				сНеТовар[СтрокаТЧ.Комплектующее] = Истина;
			КонецЕсли;
			
			// Кельманов А.В. - Оптимизация работы - 2026.04.09 {
		Иначе
			
			Если Объект.фРежим = 0 И ЗначениеЗаполнено(Объект.Продукция) Тогда
				
				МассивКодовКомплектующих.Добавить(СтрокаТЧ.ШтрихкодУпаковки);
				
			КонецЕсли;
			// Кельманов А.В. - Оптимизация работы - 2026.04.09 }
	
		КонецЕсли;
		
	КонецЦикла;	
	
	//Недостающие коды комплектующих
	КодыКомплектующих = Новый Соответствие;
	Для Каждого КиЗ Из сНоменклатура Цикл
		Комплектующее = КиЗ.Ключ;				
		пПолучения	= Новый Структура("Количество,НовыйСтатус,Добавлять", КиЗ.Значение, Перечисления.СтатусыКодовМаркировкиФакт.Вложен, Истина);
		рПолучения	= Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыШтук(Комплектующее, Объект.Ссылка, пПолучения);
		Если рПолучения.Успешно Тогда
			КодыКомплектующих[Комплектующее] = рПолучения.Данные;
		Иначе
			МаркировкаКС.ДобавитьОшибки(Результат, рПолучения);
		КонецЕсли; 
	КонецЦикла;
	
	Если Результат.Ошибки.Количество() > 0 Тогда
		Результат.Ошибки.Вставить(0, "Не удалось получить коды маркировки для комплектующих !");
		Результат.Успешно = Ложь;		
		Возврат Результат;
	КонецЕсли; 
	
	//Получение кода комплекта	
	ДатаФормированияКомплекта	= ТекущаяДата();
	
	пПолучения	= Новый Структура("ТипКода,Количество,Период,Добавлять", Перечисления.ТипыКодовМаркировки.Набор, 1, ДатаФормированияКомплекта, Истина);
	
	// Кельманов А.В. - HELP-5254 - 2026.03.30 {
	//// Кельманов А.В. - HELP-4052 - 2025.05.14 {
	//Запрос = Новый Запрос;
	//
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	//               |ИЗ
	//               |	Документ.ЗаданиеНаСборкуКомплектовЧЗ.ШтрихкодыУпаковок КАК ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыКМ_Факт.СрезПоследних(, Номенклатура = &Владелец) КАК СтатусыКМ_ФактСрезПоследних
	//               |		ПО ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки = СтатусыКМ_ФактСрезПоследних.ШтрихКодУпаковки
	//               |ГДЕ
	//               |	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.Ссылка = &ЗСБЧЗ
	//               |	И СтатусыКМ_ФактСрезПоследних.Статус = &Статус";
	//
	//Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыКодовМаркировкиФакт.Зарезервирован);
	//Запрос.УстановитьПараметр("ЗСБЧЗ", Объект.ДокОснование);
	//Запрос.УстановитьПараметр("Владелец", Комплект);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Если Не РезультатЗапроса.Пустой() Тогда
	//	
	//	МассивДоступныхКодовЗСБ = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШтрихкодУпаковки");
	//	
	//	пПолучения.Вставить("МассивДоступныхКодов", МассивДоступныхКодовЗСБ);
	//	пПолучения.Вставить("Статус", Перечисления.СтатусыКодовМаркировкиФакт.Зарезервирован);
	//	
	//// Кельманов А.В. - Оптимизация работы - 2025.08.28 {
	//Иначе
	//	
	//	Результат.Ошибки.Добавить("Не обнаружены зарезервированные коды ЧЗ спаек в ЗСБ!");					
	//	
	//	Результат.Успешно = Ложь;
	//	
	//	Возврат Результат;			
	//// Кельманов А.В. - Оптимизация работы - 2025.08.28 } 
	//
	//КонецЕсли;
	//// Кельманов А.В. - HELP-4052 - 2025.05.14 }
	Если Объект.фРежим = 0 И ЗначениеЗаполнено(Объект.Продукция) Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта КАК ШтрихкодКомплекта
		               |ИЗ
		               |	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
		               |ГДЕ
		               |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка = &ЛСК
		               |	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("ЛСК", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			МассивДоступныхКодовЛСК = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШтрихкодКомплекта");
			
			пПолучения.Вставить("МассивДоступныхКодов", МассивДоступныхКодовЛСК);
			пПолучения.Вставить("Статус", Перечисления.СтатусыКодовМаркировкиФакт.Распечатан);
			
		Иначе
			
			Результат.Ошибки.Добавить("Не обнаружены свободные забронированные коды ЧЗ спаек в текущем ЛСК!");					
			
			Результат.Успешно = Ложь;
			
			Возврат Результат;			
			
		КонецЕсли;
		
	Иначе
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		               |ИЗ
		               |	Документ.ЗаданиеНаСборкуКомплектовЧЗ.ШтрихкодыУпаковок КАК ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыКМ_Факт.СрезПоследних(, Номенклатура = &Владелец) КАК СтатусыКМ_ФактСрезПоследних
		               |		ПО ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки = СтатусыКМ_ФактСрезПоследних.ШтрихКодУпаковки
		               |ГДЕ
		               |	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.Ссылка = &ЗСБЧЗ
		               |	И СтатусыКМ_ФактСрезПоследних.Статус = &Статус";
		
		Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыКодовМаркировкиФакт.Зарезервирован);
		Запрос.УстановитьПараметр("ЗСБЧЗ", Объект.ДокОснование);
		Запрос.УстановитьПараметр("Владелец", Комплект);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			МассивДоступныхКодовЗСБ = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШтрихкодУпаковки");
			
			пПолучения.Вставить("МассивДоступныхКодов", МассивДоступныхКодовЗСБ);
			пПолучения.Вставить("Статус", Перечисления.СтатусыКодовМаркировкиФакт.Зарезервирован);
			
		Иначе
			
			Результат.Ошибки.Добавить("Не обнаружены зарезервированные коды ЧЗ спаек в ЗСБ!");					
			
			Результат.Успешно = Ложь;
			
			Возврат Результат;			
			
		КонецЕсли;
		
	КонецЕсли;
	// Кельманов А.В. - HELP-5254 - 2026.03.30 }
	
	рПолучения	= Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыШтук(Комплект, Объект.Ссылка, пПолучения);
	
	Если рПолучения.Успешно Тогда
		КМКомплекта = рПолучения.Данные[Комплект][0];
				
		// Кельманов А.В. - HELP-5254 - 2026.03.25 {
		//СтрокиКомплекта = Объект.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("ШтрихкодКомплекта", КМКомплекта));
		//Если СтрокиКомплекта.Количество() > 0 Тогда
		//	Результат.Ошибки.Добавить(СтрШаблон("ШК комплекта: '%1' уже успользовался в данном документе !", КМКомплекта));					
		//	Результат.Успешно = Ложь;
		//	Возврат Результат;
		//КонецЕсли; 
		Если Объект.фРежим = 0 И ЗначениеЗаполнено(Объект.Продукция) Тогда
			
			СтрокиКомплекта = Объект.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("ШтрихкодКомплекта", КМКомплекта)); 
			
			Для Каждого СтрКомпл Из СтрокиКомплекта Цикл
				
				Если ЗначениеЗаполнено(СтрКомпл.ШтрихкодУпаковки) Тогда
					Результат.Ошибки.Добавить(СтрШаблон("ШК комплекта: '%1' уже успользовался в данном документе !", КМКомплекта));					
					Результат.Успешно = Ложь;
					Возврат Результат;
				КонецЕсли;
				
			КонецЦикла; 

			ОжидаемыйДляСканированияКодЧЗ = КМКомплекта;
			
			ПараметрыПоиска = Новый Структура("ШтрихкодКомплекта, ШтрихкодУпаковки", КМКомплекта, Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка());
			
			МассивСтрокДляУдаления = Объект.ШтрихкодыУпаковок.НайтиСтроки(ПараметрыПоиска);
			
			Для Каждого Строка Из МассивСтрокДляУдаления Цикл
				
				Объект.ШтрихкодыУпаковок.Удалить(Строка);
				
			КонецЦикла;
			
			// Кельманов А.В. - Оптимизация работы - 2026.04.09 {
			Если МассивКодовКомплектующих.Количество() > 0 Тогда
				
				ПарамЗаписи	= Новый Структура("Период,Добавлять,ИспользоватьУправляемыеБлокировки", ДатаФормированияКомплекта, Истина, Истина);
				
				РегистрыСведений.СтатусыКМ_Факт.УстановитьСтатусКМ(МассивКодовКомплектующих, Перечисления.СтатусыКодовМаркировкиФакт.Вложен, Объект.Ссылка, ПарамЗаписи);
				
			КонецЕсли;
			// Кельманов А.В. - Оптимизация работы - 2026.04.09 }
			
		Иначе
			
			СтрокиКомплекта = Объект.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("ШтрихкодКомплекта", КМКомплекта));
			Если СтрокиКомплекта.Количество() > 0 Тогда
				Результат.Ошибки.Добавить(СтрШаблон("ШК комплекта: '%1' уже успользовался в данном документе !", КМКомплекта));					
				Результат.Успешно = Ложь;
				Возврат Результат;
			КонецЕсли; 
			
		КонецЕсли; 
		// Кельманов А.В. - HELP-5254 - 2026.03.25 }
		
		Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
			СтрокаТЧ.ШтрихкодКомплекта 			= КМКомплекта;
			СтрокаТЧ.ДатаФормированияКомплекта  = ДатаФормированияКомплекта;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ШтрихкодУпаковки) И сНеТовар[СтрокаТЧ.Комплектующее] = Неопределено Тогда
				СтрокаТЧ.ШтрихкодУпаковки 			= КодыКомплектующих[СтрокаТЧ.Комплектующее][0];
				СтрокаТЧ.КодКомплектующегоНеНанесен = Истина;
				
				КодыКомплектующих[СтрокаТЧ.Комплектующее].Удалить(0);							
			КонецЕсли; 
		КонецЦикла;
		 
		КодыКомплектующих = Новый Массив;
		Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
			Если ЗначениеЗаполнено(СтрокаТЧ.ШтрихкодУпаковки) И СтрокаТЧ.КодКомплектующегоНеНанесен Тогда
				КодыКомплектующих.Добавить(СтрокаТЧ.ШтрихкодУпаковки);			
			КонецЕсли;
		КонецЦикла;
		
		//+++Чирков Д.С. 17.08.2025 MARK-2690 Контроль добавления в ЛСК по статусу КМ 
		рПроверки = ПроверитьСтатусыКодовКомплектующих(КодыКомплектующих);
		Если рПроверки.Успешно Тогда                                       
		//---Чирков Д.С. 
			ПарамЗаписи	= Новый Структура("Период,Добавлять,ИспользоватьУправляемыеБлокировки", ДатаФормированияКомплекта-1, Истина, Истина);
			РегистрыСведений.СтатусыКМ_Факт.УстановитьСтатусКМ(КодыКомплектующих, Перечисления.СтатусыКодовМаркировкиФакт.НанесенВиртуально, Объект.Ссылка, ПарамЗаписи);
					
			Попытка
				Записать();			
				
				Результат.Успешно	= Истина;
				Результат.Данные 	= КМКомплекта;
			Исключение
				Для Каждого СтрокаТЧ Из Объект.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("ШтрихкодКомплекта", КМКомплекта)) Цикл
					СтрокаТЧ.ШтрихкодКомплекта 			= Неопределено;							
					СтрокаТЧ.ДатаФормированияКомплекта  = Неопределено;
				КонецЦикла;			
				
				КМКомплекта = Неопределено;
				Результат.Ошибки.Добавить("Не удалось провести документ ! " + ОписаниеОшибки());			
			КонецПопытки;			
		//+++Чирков Д.С. 17.08.2025 MARK-2690 Контроль добавления в ЛСК по статусу КМ 
		Иначе
			МаркировкаКС.ДобавитьОшибки(Результат, рПроверки);					
		//---Чирков Д.С.
		КонецЕсли;
	Иначе
		МаркировкаКС.ДобавитьОшибки(Результат, рПолучения);
		ТекстОшибки = СтрШаблон("Не удалось найти свободный КМ для комплекта: %1 (%2) !", Комплект, Комплект.Код);
		Результат.Ошибки.Добавить(ТекстОшибки);		
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции //УстановитьКодКомплекта() 

&НаСервере
Функция ПроверитьСтатусыКодовКомплектующих(КодыКомплектующих)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Запрос = Новый Запрос;	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки,
	|	Статус
	|ИЗ
	|	РегистрСведений.СтатусыКМ_Факт.СрезПоследних(, ШтрихкодУпаковки В (&КодыКомплектующих))
	|";	
	
	Запрос.УстановитьПараметр("КодыКомплектующих", КодыКомплектующих);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Статус = Выборка.Статус;
		Если Статус = Перечисления.СтатусыКодовМаркировкиФакт.Нанесен Тогда
		ИначеЕсли Статус = Перечисления.СтатусыКодовМаркировкиФакт.ВОбороте Тогда
		Иначе     
			ТекстОшибки = СтрШаблон("Недопустимый статус кода комплектующего: '%1' - '&2' ! Ожидаемый статус 'Нанесен' или 'В обороте' !", Выборка.ШтрихкодУпаковки, Выборка.Статус);
			Результат.Ошибки.Добавить(ТекстОшибки);
		КонецЕсли;
	КонецЦикла;
	
	Результат.Успешно = Результат.Ошибки.Количество() = 0;
	
	Возврат Результат;	
КонецФункции //ПроверитьСтатусыКодовКомплектующих(ШтрихкодКомплекта)


&НаСервереБезКонтекста
Функция ПолучитьПоляКМДляПечати(КМ)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Владелец							КАК Номенклатура,
	|	Владелец.Родитель.КодПроизводителя	КАК Артикул,
	|	Владелец.Цвет						КАК Цвет,
	|	Владелец.Размер						КАК Размер,
	|	Ссылка								КАК ШтрихкодУпаковки,	
	|	ЗначениеШтрихкода					КАК ЗначениеКМ
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	Ссылка = &КМ
	|";
	
	Запрос.УстановитьПараметр("КМ", КМ);
	рЗапроса = Запрос.Выполнить();
	
	Результат = Новый Структура;
	Для Каждого Кол Из рЗапроса.Колонки Цикл
		Результат.Вставить(Кол.Имя, Неопределено);	
	КонецЦикла; 
	Выборка = рЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);	
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ПолучитьПоляКМДляПечати(КМ)

&НаСервереБезКонтекста
Функция НапечататьКодКомплекта_НаСервере(КМКомплекта, ИмяМакета	= "Этикетка_25_25", СразуНаПринтер = Ложь, НомерШтуки = 0)
	Результат		= МаркировкаКС.СтруктураРезультата(Ложь);	
	
	ОбработкаПечати = Обработки.ПечатьЭтикетокЧЗ.Создать();
	Макет = ОбработкаПечати.ПолучитьМакет(ИмяМакета);
	
	ТД = Новый ТабличныйДокумент;
	ТД.ОтображатьСетку		= Ложь;
	ТД.ОтображатьЗаголовки	= Ложь;
	// Смирнов М.Ю. 16.06.2025 HELP-4528 начало
	//ТД.ИмяПараметровПечати	= "ПараметрыПечати_КМ_ЛСК_"+ИмяМакета;
	ТД.ИмяПараметровПечати	= "ПараметрыПечати_КМ_ЛСК_КодКомплекта" + ИмяМакета;
	// Смирнов М.Ю. 16.06.2025 HELP-4528 конец
	
	РаспечатанныеКМ = Новый Соответствие;
	
	ДанныеДляПечати	= ПолучитьПоляКМДляПечати(КМКомплекта);		
 
	// Кухарь А.Ю.  19.11.2025 начало   
	//ДопПараметры = Новый Структура("НомерШтуки,НомерКоробки,ШтукВКоробке", 1, 1, 1); 

	// Кельманов А.В. - Вернул как было - 2025.11.20 {
	//НомерШтуки = 0;
	//ДопПараметры = Новый Структура("НомерШтуки,НомерКоробки,ШтукВКоробке", 0, 1, 1);
	ДопПараметры = Новый Структура("НомерШтуки,НомерКоробки,ШтукВКоробке", 1, 1, 1);
	// Кельманов А.В. - Вернул как было - 2025.11.20 }

	// Кухарь А.Ю.  19.11.2025 конец
	
	Если НомерШтуки <> 0 Тогда
		ДопПараметры.НомерШтуки = "№ " + НомерШтуки;			
	КонецЕсли;	
	Область 		= ОбработкаПечати.СформироватьЭтикету(Макет, ДанныеДляПечати, ДопПараметры);
	
	ТД.Вывести(Область);
	
	Результат.Данные 	= ТД;
	Результат.Успешно 	= Истина;
	
	Возврат Результат;
КонецФункции //НапечататьКодКомплекта_НаСервере(КМКомплекта, ИмяМакета	= "Этикетка_25_25", СразуНаПринтер = Ложь)

&НаКлиенте
Процедура ДобавитьКМ(Команда)
	Данные = "";
	Если ВвестиЗначение(Данные, "Введите код маркировки", "Строка") Тогда
		ОбработатьВводШК(Данные);	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьФильтрПоТекущемуКомплекту(Команда)
	Элементы.кнТолькоТекКомплект.Пометка = НЕ Элементы.кнТолькоТекКомплект.Пометка;
	УстановитьФильтрПоТекущемуКомплекту();
КонецПроцедуры

&НаСервере
Процедура УстановитьФильтрПоТекущемуКомплекту()	
	Если Элементы.кнТолькоТекКомплект.Пометка Тогда
		Элементы.ШтрихкодыУпаковок.ОтборСтрок = Новый ФиксированнаяСтруктура("КодКомплектаПодтвержденСканированием", Ложь);		
	Иначе		
		Элементы.ШтрихкодыУпаковок.ОтборСтрок = Неопределено;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодыУпаковок_ПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НЕ ОтменаРедактирования Тогда
		рПоиска = НайтиКомплект();			
		ОбновитьКоличествоСвободныхКомплектующих();
		//++Данилова Е.В. 15.06.2026 №0000001219
		ОбновитьКоличествоСобранныхКомплектов(); 
		//--Данилова Е.В. 15.06.2026 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьСборку(Команда)

	Если Модифицированность Или Не Объект.Проведен Тогда
		Записали = Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
		Если Не Записали Тогда Возврат; КонецЕсли		
	КонецЕсли;
	
	рПроверки = ПроверитьВозможностьЗавершенияСборки();
	
	Если рПроверки.Успешно Тогда
		
		// Кельманов А.В. - ИЗМ-0000000124 - 2026.07.02 {
		Накладная = ПолучитьРеквизитШапки(Объект.ДокОснование, "ДокОснование", "Документ");
			
		Если СоздаватьЛП_ПоЛСК(Накладная) И Не ЗначениеЗаполнено(Объект.ЛистНабора) Тогда
			
			Если ЗначениеЗаполнено(ТипКороба) Тогда
				
				ЛП = СоздатьЛП_ПоЛСК(Объект.Ссылка, Накладная, ТипКороба);
				
				Если ЗначениеЗаполнено(ЛП) Тогда
					
					Объект.ЛистНабора = ЛП;
					
					Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
					
				КонецЕсли;
				
			Иначе
				
				СоздаватьНовыйЛП = Ложь;
				
				ЛП = НайтиЛП_ПоЛСК(Объект.Ссылка, Накладная, СоздаватьНовыйЛП);
				
				Если ЗначениеЗаполнено(ЛП) Тогда
					
					Объект.ЛистНабора = ЛП;
					
					Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
					
				КонецЕсли;
				
				Если СоздаватьНовыйЛП Тогда
					
					НужноОтсканироватьТипКороба = Истина;
					
					Сообщить("Отсканируйте тип короба для создания листа переукладки!");
					
					Возврат;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		// Кельманов А.В. - ИЗМ-0000000124 - 2026.07.02 }
		
		рЗавершения = ЗавершитьМаркировку_НаСервере();
		
		Если рЗавершения.Успешно Тогда	
			
			Сообщить("Маркировка завершена.", СтатусСообщения.Информация);
			
			//Сообщить("Сформировано: "+ рЗавершения.ОбработаноОбъектов+" агрегаций.", СтатусСообщения.Информация);			 
			// Кухарь А.Ю. 06.05.2025 начало
			Если Не ЗначениеЗаполнено(Объект.СборщикКомплектаТСД) Тогда
				Сообщить("Не указан исполнитель, ваши достижения не будут учтены при формировании отчётов по трудозатратам. Для установки исполнителя отсканируйте ШК сотрудника.");
			КонецЕсли;
			// Кухарь А.Ю. 06.05.2025 конец
			
			Закрыть();
			
		Иначе
			
			Сообщить(СтрСоединить(рЗавершения.Ошибки, Символы.ПС), СтатусСообщения.Важное);
			
		КонецЕсли;
		
	Иначе
		
		Сообщить("Обнаружены ошибки сборки !", СтатусСообщения.Важное);
		Сообщить(СтрСоединить(рПроверки.Ошибки, Символы.ПС));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗавершитьМаркировку_НаСервере()
	
	Результат = МаркировкаКС.СтруктураРезультата();	
	
	Объект.Завершен = Истина;
	
	// Кухарь А.Ю. 06.05.2025 начало
	Если Объект.ДатаОкончанияСканирования = ПустаяДата() Тогда   
		Объект.ДатаОкончанияСканирования = ТекущаяДата();	
	КонецЕсли;
	// Кухарь А.Ю. 06.05.2025 конец

	//++Данилова Е.В. 08.06.2026 MARK-3615
	//Результат.Успешно = Записать();
	Результат.Успешно = Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	//--Данилова Е.В. 08.06.2026 
	
	Возврат Результат;
	
КонецФункции //ЗавершитьМаркировку_НаСервере()

&НаСервере
Функция ПроверитьВозможностьЗавершенияСборки()
	Результат = МаркировкаКС.СтруктураРезультата();
	
	рПроверкиКомплектующих = ПроверитьЗаполнениеКомплектующих();
	Если НЕ рПроверкиКомплектующих.Успешно Тогда
		Возврат рПроверкиКомплектующих;	
	КонецЕсли;

	// Кухарь А.Ю.  07.05.2026 начало
	// HELP-9696     
	рПроверкиСканированияПродукции = ПроверитьПодтверждениеСканированиемПродукции();
	Если НЕ рПроверкиСканированияПродукции.Успешно Тогда
		Возврат рПроверкиСканированияПродукции;	
	КонецЕсли;           
	// Кухарь А.Ю.  07.05.2026 конец	 
	
	Возврат Результат;
КонецФункции //ПроверитьВозможностьЗавершенияСборки()

&НаСервере
Функция ПроверитьЗаполнениеКомплектующих()
	Результат 		= МаркировкаКС.СтруктураРезультата();
	
	Запрос 			= Новый Запрос;
	Запрос.Текст	= "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_ШтрихкодыУпаковок ИЗ &ТЧ_ШтрихкодыУпаковок КАК ТЧ_ШтрихкодыУпаковок
	|;
	|ВЫБРАТЬ
	|	НомерСтроки,	
	|	ШтрихкодУпаковки,
	|	Комплектующее,
	|	Комплектующее.Родитель.ВидНоменклатуры КАК Комплектующее_ВидНоменклатуры
	|ИЗ
	|	ВТ_ШтрихкодыУпаковок
	|ГДЕ	
	|	Комплектующее = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	ИЛИ (
	|		Комплектующее.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|		И ШтрихкодУпаковки = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)	
	|	)
	|";	
	
	Запрос.УстановитьПараметр("ТЧ_ШтрихкодыУпаковок", Объект.ШтрихкодыУпаковок.Выгрузить());
	
	Ошибки	= Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		// Кельманов А.В. - MARK-3199 - 2025.10.30 {
		//Если Выборка.Комплектующее_ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Товар 
		Если (Выборка.Комплектующее_ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Товар Или Не ЗначениеЗаполнено(Выборка.Комплектующее)) 
		// Кельманов А.В. - MARK-3199 - 2025.10.30 }
			И НЕ ЗначениеЗаполнено(Выборка.ШтрихкодУпаковки) Тогда
			Результат.Ошибки.Добавить(СтрШаблон("Не указан КМ комплектующего в строке: %1 !", Выборка.НомерСтроки));		
		КонецЕсли;
	КонецЦикла;
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;
КонецФункции //ПроверитьЗаполнениеТЧ_КМ()

// Кухарь А.Ю.  07.05.2026 начало
// HELP-9696   
&НаСервере
Функция ПроверитьПодтверждениеСканированиемПродукции()
	Результат 		= МаркировкаКС.СтруктураРезультата();
	МассивСтрок	=Объект.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("КодКомплектаПодтвержденСканированием",Ложь));  
	Для каждого СтрМасс из МассивСтрок цикл     
		Результат.Ошибки.Добавить("Не отсканирован КМ набора в строке: " + Формат(СтрМасс.НомерСтроки, "ЧРГ=' '; ЧГ=3,0"));
	КонецЦикла;
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);	
	Возврат Результат;
КонецФункции //ПроверитьЗаполнениеТЧ_КМ()
// Кухарь А.Ю.  07.05.2026 


&НаКлиенте
Процедура ЗаполнитьПакет(Команда)
	Ошибки = "";
	Если Объект.ПометкаУдаления Тогда
		Ошибки = "Документ помечен на удаление !";			
	ИначеЕсли Объект.Продукция.Пустая() ИЛИ Объект.КоличествоДокумента = 0 Тогда
		Ошибки = "Не указано количество продукции !";
	КонецЕсли;   
	Если НЕ ПустаяСтрока(Ошибки) Тогда
		ПоказатьПредупреждение(, Ошибки);
		Возврат;
	КонецЕсли;
	
	Если МаркировкаК.ЗаписатьИзмененныйОбъектВУпрФорме(ЭтаФорма, Истина) Тогда	
		
		// Кельманов А.В. - Оптимизация работы - 2025.08.28 {
		//ЗаполнитьПакет_НаСервере();
		ЗаполнитьПакет_НаСервере(Ошибки);
		
		Если Не ПустаяСтрока(Ошибки) Тогда
			Сообщить(Ошибки);
		КонецЕсли;
		// Кельманов А.В. - Оптимизация работы - 2025.08.28 }
		
		УправлениеВидимостью();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Кельманов А.В. - Оптимизация работы - 2025.08.28 {
//Процедура ЗаполнитьПакет_НаСервере()
Процедура ЗаполнитьПакет_НаСервере(Ошибки)
// Кельманов А.В. - Оптимизация работы - 2025.08.28 }
	
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	// Кельманов А.В. - HELP-4052 - 2025.05.14 {
	//рЗаполнения = Документы.ЛистСборкиКомплектовЧЗ.ПолучитьЗабронироватьКМПакетно(Объект.Продукция, Объект.КоличествоДокумента, Объект.Ссылка);
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	               |ИЗ
	               |	Документ.ЗаданиеНаСборкуКомплектовЧЗ.ШтрихкодыУпаковок КАК ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыКМ_Факт.СрезПоследних(, Номенклатура = &Владелец) КАК СтатусыКМ_ФактСрезПоследних
	               |		ПО ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки = СтатусыКМ_ФактСрезПоследних.ШтрихКодУпаковки
	               |ГДЕ
	               |	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.Ссылка = &ЗСБЧЗ
	               |	И СтатусыКМ_ФактСрезПоследних.Статус = &Статус";
	
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыКодовМаркировкиФакт.Зарезервирован);
	Запрос.УстановитьПараметр("ЗСБЧЗ", Объект.ДокОснование);
	Запрос.УстановитьПараметр("Владелец", Объект.Продукция);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		МассивДоступныхКодовЗСБ = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШтрихкодУпаковки");
		
		ДопПараметры = Новый Структура("Статус, МассивДоступныхКодов",
		Перечисления.СтатусыКодовМаркировкиФакт.Зарезервирован, МассивДоступныхКодовЗСБ);
		
		рЗаполнения = Документы.ЛистСборкиКомплектовЧЗ.ПолучитьЗабронироватьКМПакетно(Объект.Продукция, Объект.КоличествоДокумента, Объект.Ссылка, ДопПараметры);
		
	Иначе
		
		// Кельманов А.В. - Оптимизация работы - 2025.08.28 {
		//рЗаполнения = Документы.ЛистСборкиКомплектовЧЗ.ПолучитьЗабронироватьКМПакетно(Объект.Продукция, Объект.КоличествоДокумента, Объект.Ссылка);		
		Ошибки = "Не обнаружены зарезервированные коды ЧЗ спаек в ЗСБ!";
		
		Возврат;			
		// Кельманов А.В. - Оптимизация работы - 2025.08.28 } 
		
	КонецЕсли;
	// Кельманов А.В. - HELP-4052 - 2025.05.14 }
	
	Если рЗаполнения.Успешно Тогда
		Объект.ШтрихкодыУпаковок.Загрузить(рЗаполнения.Данные);
		
		Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		Записать();
		
		Время = (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000;
		ЗаписатьВЛог("Мониторинг СтатусыКМ_Факт", "Проведение ЛСК. ЗаполнитьПакет_НаСервере", "Информация", , , Время);		
	Иначе
		МаркировкаКС.ВывестиОшибки(рЗаполнения);	
		РегистрыСведений.СтатусыКМ_Факт.ОчиститьДвижения(Объект.Ссылка);
	КонецЕсли; 
	
	Время = (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000;
	ЗаписатьВЛог("Мониторинг СтатусыКМ_Факт", "Проведение ЛСК. ЗаполнитьПакет_НаСервере", "Кол. комплектов: " + Объект.КоличествоДокумента, , , Время);
КонецПроцедуры

&НаКлиенте
Процедура РаспечататьКодыКомплектов(Команда)
	сКоды = Новый Соответствие;	
	мКоды = Новый Массив;
	Для каждого СтрокаТЧ Из Объект.ШтрихкодыУпаковок Цикл
		Если сКоды[СтрокаТЧ.ШтрихкодКомплекта] = Неопределено Тогда
			сКоды[СтрокаТЧ.ШтрихкодКомплекта] = Истина;	
			мКоды.Добавить(СтрокаТЧ.ШтрихкодКомплекта);
		КонецЕсли;		
	КонецЦикла; 
	
	рПечати = РаспечататьКодыКомплектов_НаСервере(мКоды);
	Если рПечати.Успешно Тогда
		Если фПечататьКодНабораСразуНаПринтер Тогда
			рПечати.Данные.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
		Иначе					
			рПечати.Данные.Показать("Этикетки по ЛСК: " + Объект.Ссылка);      
		КонецЕсли;        
		// Кухарь А.Ю. 06.05.2025 начало
		если объект.ДатаНачалаСканирования=ПустаяДата() тогда   
			объект.ДатаНачалаСканирования=ТекущаяДата();	
		КонецЕсли;
		// Кухарь А.Ю. 06.05.2025 конец
		
		
	Иначе
		МаркировкаК.ВывестиОшибки(рПечати);			
	КонецЕсли;	
КонецПроцедуры //РаспечататьКодыКомплектов(Команда)

&НаСервереБезКонтекста
Функция РаспечататьКодыКомплектов_НаСервере(мКоды)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	НомерШутки = 0;
	ИмяМакета = "Этикетка_25_25";
	ТД = Новый ТабличныйДокумент;
	// Смирнов М.Ю. 29.05.2025 HELP-3868 начало
	ТД.ИмяПараметровПечати	= "ПараметрыПечати_КМ_ЛСК_" + ИмяМакета;
	// Смирнов М.Ю. 29.05.2025 HELP-3868 конец
	
	Для Каждого КодМаркировки Из мКоды Цикл
		НомерШутки = НомерШутки + 1;
		рПечати = НапечататьКодКомплекта_НаСервере(КодМаркировки, , , НомерШутки);	
		Если рПечати.Успешно Тогда
			ТД.Вывести(рПечати.Данные);		
			ТД.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			МаркировкаКС.ДобавитьОшибки(Результат, рПечати);			
		КонецЕсли;
	КонецЦикла; 
	
	ТД.ОтображатьЗаголовки 	= Ложь;
	ТД.ОтображатьСетку		= Ложь;
	
	Результат.Данные = ТД;
	
	Возврат Результат;
КонецФункции //РаспечататьКодыКомплектов_НаСервере(сКоды)

// Шворобей ВЮ 28.05.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4854
&НаКлиенте
Процедура УдалитьКомплектующее(Команда)
	
	МассивСтрок = Элементы.ШтрихкодыУпаковок.ВыделенныеСтроки;
	
	ЗначениеСвойства = Неопределено;
	
	Если ТипЗнч(ДополнительныеРеквизиты) = Тип("Структура") И ДополнительныеРеквизиты.Свойство("ОчисткаЛСК") Тогда
		ЗначениеСвойства = ДополнительныеРеквизиты.ОчисткаЛСК;
	КонецЕсли;
	
	Если МассивСтрок.Количество() > 0 И ЗначениеСвойства = Истина Тогда
		
   		Для Индекс = -МассивСтрок.ВГраница() По 0 Цикл
        
        		ИдентификаторСтроки = МассивСтрок[-Индекс];
        		НайденнаяСтрока = Объект.ШтрихкодыУпаковок.НайтиПоИдентификатору(ИдентификаторСтроки);
        
        		Объект.ШтрихкодыУпаковок.Удалить(НайденнаяСтрока);
        
		КонецЦикла;
		
	Иначе
		ПоказатьПредупреждение(, "Не выбраны строки комплектующих!");
	КонецЕсли;
	
КонецПроцедуры
// Шворобей ВЮ 28.05.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4854

&НаКлиенте
Функция ПовторнаяПечать_Комплекты()
	
	// Кельманов А.В. - HELP-5659 - 2025.08.06 {
	мВсеКоды = Новый Массив;
	Для Каждого СтрокаТЧ Из Объект.ШтрихкодыУпаковок Цикл
		Если мВсеКоды.Найти(СтрокаТЧ.ШтрихкодКомплекта) = Неопределено Тогда
			мВсеКоды.Добавить(СтрокаТЧ.ШтрихкодКомплекта);
		КонецЕсли;		
	КонецЦикла; 
	// Кельманов А.В. - HELP-5659 - 2025.08.06 }

	сКоды 			= Новый Соответствие;
	КодыМаркировки  = Новый Массив;	
	Для Каждого ИдСтроки Из Элементы.ШтрихкодыУпаковок.ВыделенныеСтроки Цикл
		СтрокаТЧ = Объект.ШтрихкодыУпаковок.НайтиПоИдентификатору(ИдСтроки);		
		Если сКоды[СтрокаТЧ.ШтрихкодКомплекта] = Неопределено Тогда		
			сКоды[СтрокаТЧ.ШтрихкодКомплекта]	= Истина;	
			КодыМаркировки.Добавить(СтрокаТЧ.ШтрихкодКомплекта);
		КонецЕсли;
	КонецЦикла;
	
	ТД = Неопределено;
	Для Каждого КодМаркировки Из КодыМаркировки Цикл

		// Кельманов А.В. - HELP-5659 - 2025.08.06 {
		//рПечати = НапечататьКодКомплекта_НаСервере(КодМаркировки);
		НомерШтуки = мВсеКоды.Найти(КодМаркировки) + 1;
		
	    рПечати = НапечататьКодКомплекта_НаСервере(КодМаркировки, , , НомерШтуки);
		// Кельманов А.В. - HELP-5659 - 2025.08.06 }

		Если рПечати.Успешно Тогда
			Если ТД = Неопределено Тогда
				ТД = рПечати.Данные;
			Иначе
				ТД.ВывестиГоризонтальныйРазделительСтраниц();
				// Смирнов М.Ю. 16.06.2025 HELP-4528 начало
				ТД.ИмяПараметровПечати	= "ПараметрыПечати_КМ_ЛСК_КодКомплекта_Повт" + "Этикетка_25_25";
				// Смирнов М.Ю. 16.06.2025 HELP-4528 конец
				ТД.Вывести(рПечати.Данные);
			КонецЕсли;
		Иначе
			МаркировкаК.ВывестиОшибки(рПечати);			
		КонецЕсли;
	КонецЦикла; 
	
	ТД.ОтображатьСетку = Ложь;
	ТД.ОтображатьЗаголовки = Ложь;	
	
	Если фПечататьКодНабораСразуНаПринтер Тогда
		ТД.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
	Иначе					
		ТД.Показать("Коды комплектов по ЛСБ: " + Объект.Ссылка);
	КонецЕсли;
КонецФункции //ПовторнаяПечать_Комплекты()

&НаСервере
Функция ЗаменитьДублиКомплектующихНаСервере()
	МассивСообщений=новый Массив;
	Запрос=новый запрос;
	запрос.Текст=   "ВЫБРАТЬ
	                |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка КАК Ссылка,
	                |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	                |ПОМЕСТИТЬ ПолнаяТЗ
	                |ИЗ
	                |	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
	                |ГДЕ
	                |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.Проведен
	                |	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.ДокОснование = &ДокОснование
	                |	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки В(&ШтрихкодУпаковки)
	                |	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки <> &ПустойШК
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПолнаяТЗ.Ссылка) КАК Ссылка,
	                |	ПолнаяТЗ.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	                |	ПолнаяТЗ.ШтрихкодУпаковки.Владелец КАК ШтрихкодУпаковкиВладелец
	                |ПОМЕСТИТЬ Дубли
	                |ИЗ
	                |	ПолнаяТЗ КАК ПолнаяТЗ
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ПолнаяТЗ.ШтрихкодУпаковки,
	                |	ПолнаяТЗ.ШтрихкодУпаковки.Владелец
	                |
	                |ИМЕЮЩИЕ
	                |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПолнаяТЗ.Ссылка) > 1
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	Дубли.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	                |	Дубли.ШтрихкодУпаковкиВладелец КАК Номенклатура,
	                |	ПолнаяТЗ.Ссылка КАК Ссылка
	                |ИЗ
	                |	Дубли КАК Дубли
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ПолнаяТЗ КАК ПолнаяТЗ
	                |		ПО Дубли.ШтрихкодУпаковки = ПолнаяТЗ.ШтрихкодУпаковки
	                |ГДЕ
	                |	ПолнаяТЗ.Ссылка = &Ссылка
	                |ИТОГИ ПО
	                |	Номенклатура";
	запрос.УстановитьПараметр("ШтрихкодУпаковки",Объект.ШтрихкодыУпаковок.Выгрузить().ВыгрузитьКолонку("ШтрихкодУпаковки"));
	запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	запрос.УстановитьПараметр("ПустойШК",Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка());

	запрос.УстановитьПараметр("ДокОснование",объект.ДокОснование);
	
	ВыборкаНоменклатуры=запрос.Выполнить().выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Номенклатура");
	Пока ВыборкаНоменклатуры.Следующий() цикл
		Выборка=ВыборкаНоменклатуры.Выбрать();
		рПолучения = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьСвободныеКодыШтук(ВыборкаНоменклатуры.Номенклатура, Выборка.Количество());
		Сч=0;
		
		Если рПолучения.Успешно Тогда
			Пока Выборка.Следующий() цикл 
				КодЗамены=рПолучения.Данные[сч];
				МассСтрок=Объект.ШтрихкодыУпаковок.НайтиСтроки(новый Структура("ШтрихкодУпаковки",Выборка.ШтрихкодУпаковки));
				Для каждого СтрМасс из МассСтрок цикл
					СтрМасс.ШтрихкодУпаковки=КодЗамены;
					МассивСообщений.Добавить(СтрШаблон("Замена с %1 на %2",Выборка.ШтрихкодУпаковки,КодЗамены));
				КонецЦикла;
				сч=сч+1;
			КонецЦикла;
		Иначе
			МассивСообщений.Добавить("не получилось...");			
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	// Кухарь А.Ю.  24.04.2025 начало
	//Записать();
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение) );
	// Кухарь А.Ю.  24.04.2025 конец

	Возврат МассивСообщений;
	
КонецФункции

&НаКлиенте
Процедура ЗаменитьДублиКомплектующих(Команда)
	Сообщения=ЗаменитьДублиКомплектующихНаСервере();
	Сообщить(СтрСоединить(Сообщения,символы.ПС));

КонецПроцедуры

&НаСервере
Процедура ДополнитьСпайкуНаСервере(Комплектующее,ШтрихкодКомплекта,Количество)
	
	
рПолучения = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьСвободныеКодыШтук(Комплектующее, Количество);

Если рПолучения.Успешно Тогда
	Для каждого СтрКода из рПолучения.Данные цикл
		СтрТЧ=Объект.ШтрихкодыУпаковок.Добавить();
		СтрТЧ.Комплектующее=Комплектующее;
		СтрТЧ.ШтрихкодУпаковки=СтрКода;
		СтрТЧ.ДатаФормированияКомплекта=ТекущаяДата();
		СтрТЧ.КодКомплектующегоНеНанесен=Истина;
		СтрТЧ.ШтрихкодКомплекта=ШтрихкодКомплекта;	
	КонецЦикла;
	
КонецЕсли; 
// Кухарь А.Ю.  24.04.2025 начало
//Записать();
Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение) );
// Кухарь А.Ю.  24.04.2025 конец


КонецПроцедуры

&НаКлиенте
Процедура ДополнитьСпайку(Команда)
	Количество=0;
	ВвестиЧисло(Количество);
	Строка=Элементы.ШтрихкодыУпаковок.ТекущиеДанные;
	
	ДополнитьСпайкуНаСервере(Строка.Комплектующее,Строка.ШтрихкодКомплекта,Количество);
КонецПроцедуры

&НаСервере
Функция  ЗаменитьВыделеннуюКомплектующуюНаСервере(ШтрихкодУпаковки)
	МассивСообщений=новый Массив;

	рПолучения = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьСвободныеКодыШтук(ШтрихкодУпаковки.Владелец, 1);
	Если рПолучения.Успешно Тогда
		Для каждого СтрКода из рПолучения.Данные цикл
			МассСтрок=Объект.ШтрихкодыУпаковок.НайтиСтроки(новый Структура("ШтрихкодУпаковки",ШтрихкодУпаковки));
			Для каждого СтрМасс из МассСтрок цикл
				СтрМасс.ШтрихкодУпаковки=СтрКода;
				МассивСообщений.Добавить(СтрШаблон("Замена %1 на %2",ШтрихкодУпаковки,СтрКода));
			КонецЦикла;
		КонецЦикла;
	иначе
		МассивСообщений.Добавить("Ничего не получилось...");
	КонецЕсли;

	// Кухарь А.Ю.  24.04.2025 начало
	//Записать();
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение) );
	// Кухарь А.Ю.  24.04.2025 конец
	
	
	возврат МассивСообщений;

КонецФункции

&НаКлиенте
Процедура ЗаменитьВыделеннуюКомплектующую(Команда)
	Строка=Элементы.ШтрихкодыУпаковок.ТекущиеДанные;
	
	Сообщения=ЗаменитьВыделеннуюКомплектующуюНаСервере(Строка.ШтрихкодУпаковки);
	Сообщить(СтрСоединить(Сообщения,символы.ПС));
	Прочитать();
КонецПроцедуры

&НаСервере
Функция ЗаменитьВыделеннуюСпайкуНаСервере(ШтрихкодУпаковки)
МассивСообщений=новый Массив;

	рПолучения = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьСвободныеКодыШтук(ШтрихкодУпаковки.Владелец, 1);
	Если рПолучения.Успешно Тогда
		Для каждого СтрКода из рПолучения.Данные цикл
			МассСтрок=Объект.ШтрихкодыУпаковок.НайтиСтроки(новый Структура("ШтрихкодКомплекта",ШтрихкодУпаковки));
			Для каждого СтрМасс из МассСтрок цикл
				СтрМасс.ШтрихкодКомплекта=СтрКода;
				МассивСообщений.Добавить(СтрШаблон("Замена %1 на %2",ШтрихкодУпаковки,СтрКода));
			КонецЦикла;
		КонецЦикла;
	иначе
		МассивСообщений.Добавить("Ничего не получилось...");
	КонецЕсли;
	// Кухарь А.Ю.  24.04.2025 начало
	//Записать();
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение) );
	// Кухарь А.Ю.  24.04.2025 конец

	возврат МассивСообщений;

КонецФункции

&НаКлиенте
Процедура ЗаменитьВыделеннуюСпайку(Команда)
		Строка=Элементы.ШтрихкодыУпаковок.ТекущиеДанные;
	
	Сообщения=ЗаменитьВыделеннуюСпайкуНаСервере(Строка.ШтрихкодКомплекта);
	Сообщить(СтрСоединить(Сообщения,символы.ПС));
	Прочитать();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКодыКомплектующих(Команда)
	ЗаполнитьКодыКомплектующих_НаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКодыКомплектующих_НаСервере()
	мНоменклатура = Новый Массив;
	Если МаркировкаК.ЗаписатьИзмененныйОбъектВУпрФорме(ЭтаФорма) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Комплектующее
		|ИЗ
		|	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок
		|ГДЕ
		|	ШтрихкодУпаковки = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
		|	И Комплектующее.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
		|	И Ссылка = &Ссылка
		|";              
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
		мНоменклатура	= Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Комплектующее");		
		рПолучения		= Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыШтук(мНоменклатура, Объект.Ссылка, Новый Структура("Добавлять", Истина));
		Если рПолучения.Успешно Тогда						
			Для каждого КиЗ Из рПолучения.Данные Цикл
				Номенклатура	= КиЗ.Ключ;
				Коды			= КиЗ.Значение; 
				Сч = 0;
				Для Каждого СтрокаТЧ Из Объект.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("Комплектующее,ШтрихкодУпаковки", Номенклатура, Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка())) Цикл
					СтрокаТЧ.ШтрихкодУпаковки = Коды[Сч];
					Сч = Сч + 1;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКодыКомплектующих(Команда)	
	Для Каждого СтрокаТЧ Из Объект.ШтрихкодыУпаковок Цикл
		СтрокаТЧ.ШтрихкодУпаковки = Неопределено;			
	КонецЦикла;               
	ЗаписатьПроОчистку();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПроОчистку()
	ЗаписатьВЛог("Предупреждения.ЛСК", "Очистка кодов комплектующих", "Предупреждение");
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДвижения(Команда)
	ОчиститьДвижения_НаСервере(Объект.Ссылка);	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьДвижения_НаСервере(ДокСсылка)
	Документы.ЛистСборкиКомплектовЧЗ.ОчиститьДвижения(ДокСсылка);
	
	ТекстСообщения = СтрШаблон("Очищены движения документа: '%1'.", ДокСсылка);
	Сообщить(ТекстСообщения, СтатусСообщения.Информация);
	ЗаписатьВЛог("ОчисткаДвиженийЛСК", ТекстСообщения, "Информация"); 
КонецПроцедуры

#Область КнопкаРазрешитьРедактированиеМарок

&НаКлиенте
Процедура РазрешитьРедактированиеМарок(Команда)
	
	// Кухарь А.Ю.  04.06.2025 начало
	РезультатПроверки=ПроверитьВозможностьОчистки(объект.ДокОснование); 
	если не РезультатПроверки.Успех тогда
		Сообщить(СтрСоединить(РезультатПроверки.Ошибки,Символы.ПС));
		возврат;
	КонецЕсли;
	// Кухарь А.Ю.  04.06.2025 конец
		
	
	ПричинаОчисткиЛСК = "";
	Если НЕ ВвестиСтроку(ПричинаОчисткиЛСК, "Введите причину очистки ЛСК") Тогда
		Сообщить("Строка не введена. Редактирование запрещено!");
		Возврат;
	КонецЕсли;
	
	Если ПричинаОчисткиЛСК = "" Тогда
		ПричинаОчисткиЛСК = "Очистка ЛСК";
	КонецЕсли;
	
	Документы.ЛистСборкиКомплектовЧЗ.ЗаписатьВЖурналИзмененийРеквизитовДокумента(Объект.Ссылка, "ОчисткаЛСК",, ПричинаОчисткиЛСК);
	
	Если ТипЗнч(ДополнительныеРеквизиты) = Тип("Структура") Тогда
		ДополнительныеРеквизиты.Вставить("ОчисткаЛСК", Истина);
	КонецЕсли;

	// Кухарь А.Ю.  04.06.2025 начало
	ТолькоПросмотр = ложь;
	// Кухарь А.Ю.  04.06.2025 конец
		
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодыУпаковокПередУдалением(Элемент, Отказ)
	
	ЗначениеСвойства = Неопределено;
	
	Если ТипЗнч(ДополнительныеРеквизиты) = Тип("Структура") И ДополнительныеРеквизиты.Свойство("ОчисткаЛСК") Тогда
		ЗначениеСвойства = ДополнительныеРеквизиты.ОчисткаЛСК;
	КонецЕсли;
	
	Если ЗначениеСвойства = Неопределено ИЛИ ЗначениеСвойства = Ложь Тогда
		Сообщить("Нет прав на удаление строки!!!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
 
&НаСервереБезКонтекста
Функция ПроверитьВозможностьОчистки(ЗСБ)
	СтруктураВозврата = новый Структура("Успех,Ошибки");
	МассивОшибок = новый Массив;
	Запрос=новый запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	МаркировкаТоваровИСМП.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
	               |ГДЕ
	               |	МаркировкаТоваровИСМП.Статус <> &ВРаботе
	               |	И МаркировкаТоваровИСМП.Проведен
	               |	И МаркировкаТоваровИСМП.ВидОперацииИСМП = &ФормированиеНабора
	               |	И МаркировкаТоваровИСМП.ДокументОснование = &ЗСБ";
	запрос.УстановитьПараметр("ВРаботе",Перечисления.СтатусыДокументовМаркировки.ВРаботе);
	запрос.УстановитьПараметр("ЗСБ",ЗСБ);
	запрос.УстановитьПараметр("ФормированиеНабора",Перечисления.ВидыОперацийИСМП.ФормированиеНабора);
	выборка = запрос.Выполнить().Выбрать();
	пока выборка.Следующий() цикл
		МассивОшибок.Добавить("Найден документ для отправки в ЧЗ, в статусе не в работе. Перед очисткой нужно этот документ вернуть в работу "+выборка.ссылка);
	КонецЦикла;
	если МассивОшибок.Количество()>0 тогда
		СтруктураВозврата.Успех = ложь;
		СтруктураВозврата.Ошибки = МассивОшибок;
	иначе
		СтруктураВозврата.Успех = Истина;
	КонецЕсли;
	
	возврат СтруктураВозврата;
КонецФункции

#КонецОбласти
