
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	если не РольДоступна("Администратор") тогда
		Сообщить("Функционал доступен под роль - Администратор");
		Возврат;
	КонецЕсли;
	
	 ПерезаполнитьХКМ(ПараметрКоманды);
	
КонецПроцедуры

&НаСервере
Функция ПерезаполнитьХКМ(МассивСсылок)	
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ХранилищеКодовМаркировки.ДокОснование.Ссылка КАК Накладная
	|ИЗ
	|	Документ.ХранилищеКодовМаркировки КАК ХранилищеКодовМаркировки
	|ГДЕ
	|	ХранилищеКодовМаркировки.ДокОснование.СостояниеНакладной = &СостояниеНакладной
	|	И ХранилищеКодовМаркировки.ДокОснование.Проведен
	|	И ХранилищеКодовМаркировки.ДокОснование ССЫЛКА Документ.РасходнаяНакладная
	|	И ХранилищеКодовМаркировки.Ссылка В(&МассивСсылок)";
	
	запрос.УстановитьПараметр("МассивСсылок",МассивСсылок);
	запрос.УстановитьПараметр("СостояниеНакладной",Перечисления.СостоянияНакладной.ГотоваКОтгрузке);
	
	Выборка=запрос.Выполнить().Выбрать();
	пока Выборка.Следующий() цикл
		РезультатРаботыСХКМ=Документы.ХранилищеКодовМаркировки.Создать_ХКМ_к_РНК(Выборка.Накладная);
		если не РезультатРаботыСХКМ.Успешно тогда
			РезультатРаботыСХКМ.Ошибки.Добавить("Не удалось создать хранилище кодов маркировки");
			СообщитьИзМодуля(СтрСоединить(РезультатРаботыСХКМ.Ошибки,","));
			Продолжить;	
		КонецЕсли;
		
	КонецЦикла;
	
	
	
КонецФункции
 
