Функция СтатусЧЗ_Статус1С(СтатусЧЗ) Экспорт
	Результат = Перечисления.СтатусыКарточкиНоменклатурыВЧЗ.ПустаяСсылка();
	
	Если НРег(СтатусЧЗ) = "moderation" Тогда               
		Результат = Перечисления.СтатусыКарточкиНоменклатурыВЧЗ.НаМодерации;
	ИначеЕсли НРег(СтатусЧЗ) = "signed" Тогда                               
		Результат = Перечисления.СтатусыКарточкиНоменклатурыВЧЗ.ОжидаетПодписания;		
	ИначеЕсли НРег(СтатусЧЗ) = "published" Тогда                                        
		Результат = Перечисления.СтатусыКарточкиНоменклатурыВЧЗ.Опубликована;		
	КонецЕсли;	
		
	Возврат Результат;
КонецФункции //СтатусЧЗ_Статус1С(СтатусЧЗ) Экспорт