//#Если Сервер Тогда
Функция ЗаписатьВтаблицуОшибок(ТО,Объект,ТипОшибки,НомерСтроки,СтрокаТовара=Неопределено,Остаток=0,Резерв=0)
	Если ТипЗнч(ТО)<>Тип("ТаблицаЗначений") Тогда
		ТО=Новый ТаблицаЗначений;	
		
		ТО.Колонки.Добавить("Объект");		
		ТО.Колонки.Добавить("ТипОшибки");
		ТО.Колонки.Добавить("НомерСтроки");		
		ТО.Колонки.Добавить("Склад");		
		ТО.Колонки.Добавить("Номенклатура");		
		ТО.Колонки.Добавить("Количество");
		ТО.Колонки.Добавить("Остаток");
		ТО.Колонки.Добавить("Резерв");
		ТО.Колонки.Добавить("ВиртуальныйРезерв");		
	КонецЕсли;
	
	СтрокаТО=ТО.Добавить();
	
	СтрокаТО.Объект				=Объект.Ссылка;
	СтрокаТО.ТипОшибки			=ТипОшибки;
	
	Если СтрокаТовара<>Неопределено Тогда
		СтрокаТО.Склад			=СтрокаТовара.Склад;
		СтрокаТО.Номенклатура	=СтрокаТовара.Номенклатура;
		СтрокаТО.Количество		=СтрокаТовара.Количество;	
		
		// Кухарь А.Ю. 04.04.2025 начало
		// ХЗ зачем это
		//	БЕ						=СтрокаТовара.Номенклатура.БазоваяЕдиница;
		//Иначе
		//	БЕ="";	 
		// Кухарь А.Ю. 04.04.2025 конец
		
	
	КонецЕсли;	
	
	СтрокаТО.Остаток			=Остаток;
	СтрокаТО.Резерв				=Резерв;	
КонецФункции // ЗаписатьВтаблицуОшибок()

Процедура ОчиститьДвиженияДокументаПоИстории(Ссылка) Экспорт
	НаборЗаписей=РегистрыСведений.История.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Использование	=Истина;
	НаборЗаписей.Отбор.Документ.Значение		=Ссылка;
	
	НаборЗаписей.Записать();
КонецПроцедуры

// +++ РНК+КМПЛ+ЗаявкаНаПерепаковку
Функция ПолучитьИмяТоварнойТЧ(Документ)
	
	ВидДок	= Документ.Метаданные().Имя;	
	ИмяТЧ	= "Товары"; // для большинства документов
	
	// Шворобей ВЮ 28.04.2022 +
	Если ВидДок = "Комплектация" ИЛИ ВидДок = "ЗаявкаНаПерепаковку" Тогда
		ИмяТЧ = "Комплектующие";
	ИначеЕсли ВидДок = "РасходнаяНакладная" И Документ.ОтгрузкаКомплектов Тогда
		ЭтоРезерв = (Документ.Отгружен = Перечисления.Отгружен.Резерв Или Документ.Отгружен = Перечисления.Отгружен.РезервТранзит);
		Если ЭтоРезерв Тогда
			ИмяТЧ = "Комплектующие";
		КонецЕсли;
	КонецЕсли;
	
	Возврат ИмяТЧ;
	
КонецФункции

// *** РНК+КМПЛ
//Функция ПолучитьНоменклатуруДокумента(Ссылка)
//	Запрос=Новый Запрос;
//	Запрос.Текст="
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	Номенклатура
//	|ИЗ
//	|	Документ."+Ссылка.Метаданные().Имя+"."+?(Ссылка.Метаданные().Имя="Комплектация","Комплектующие","Товары")+"
//	|ГДЕ
//	|	Ссылка = &Ссылка";
//	
//	Запрос.УстановитьПараметр("Ссылка",Ссылка);
//	
//	МН=Новый Массив;
//	
//	Выборка=Запрос.Выполнить().Выбрать();
//	Пока Выборка.Следующий() Цикл
//		МН.Добавить(Выборка.Номенклатура);	
//	КонецЦикла; 
//	
//	Возврат МН;
//КонецФункции //ПолучитьНоменклатуруДокумента()
// ---------- заменено на:
Функция ПолучитьНоменклатуруДокумента(Ссылка, ИмяТЧ = Неопределено)
	
	ИмяТоварнойТЧ = ?(ЗначениеЗаполнено(ИмяТЧ), ИмяТЧ, ПолучитьИмяТоварнойТЧ(Ссылка));
	
	Запрос=Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура
	|ИЗ
	|	Документ." + Ссылка.Метаданные().Имя + "." + ИмяТоварнойТЧ + "
	|ГДЕ
	|	Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	МН = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МН.Добавить(Выборка.Номенклатура);
	КонецЦикла; 
	
	Возврат МН;
	
КонецФункции //ПолучитьНоменклатуруДокумента()

Функция ПолучитьВиртуальныеСклады(ФизическийСклад)
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Склады.Ссылка КАК Склад
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.ФизическийСклад = &ФизическийСклад";
	
	МассивСкладов=Новый Массив;
	Запрос.УстановитьПараметр("ФизическийСклад",ФизическийСклад);
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//Кухарь 13.05.16 начало
		//Уберём виртуальные для склада
		если выборка.склад.ВидСклада=Перечисления.ВидСклада.ВиртуальныйДляСклада тогда Продолжить; КонецЕсли;			
		//Кухарь 13.05.16 конец
		МассивСкладов.Добавить(Выборка.Склад);			
	КонецЦикла; 
	
	Возврат МассивСкладов;
КонецФункции //ПолучитьВиртуальныеСклады() 

//крохин начало
//добавил слово "Экспорт" в "ПолучитьОстаткиТМЦ"
//крохин конец
// *** РНК+КМПЛ
// Функция ПолучитьОстаткиТМЦ(Конт,Загрузка,Склад=Неопределено,Период=Неопределено) Экспорт
// ---------- заменено на:
Функция ПолучитьОстаткиТМЦ(Конт,Загрузка,Склад=Неопределено,Период=Неопределено,ИмяТЧ=Неопределено) Экспорт
	// РНК+КМПЛ ***
	ВидДокумента=Конт.Метаданные().Имя;
	
	Запрос=Новый Запрос;
	Если Загрузка ИЛИ (ПараметрыСеанса.ЭтотУзел.Подразделение.ВидПодразделения = Перечисления.ВидыПодразделений.Франчайзинг И (КОНТ.Метаданные().Имя = "Перемещение" И Конт.СкладПолучатель.КодФизическогоУзла = ПараметрыСеанса.ЭтотУзел.Подразделение.КодФизическогоУзла77)) ИЛИ (ПараметрыСеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.Склад И (КОНТ.Метаданные().Имя = "Перемещение" ИЛИ КОНТ.Метаданные().Имя = "РасходнаяНакладная") И Конт.СостояниеНакладной = Перечисления.СостоянияНакладной.ПроверенаПоОстаткам) Тогда
		ТекстЗапроса="
		|ВЫБРАТЬ 
		|	&СкладДокумента				КАК Склад,
		|	Номенклатура,
		|	СУММА(Количество)			КАК Остаток,
		|	СУММА(Всего)				КАК Стоимость,	
		|	СУММА(0)					КАК Амортизация,	
		|	СУММА(0)					КАК Резерв		
		|ИЗ
		|	Документ."+ВидДокумента+".Товары ГДЕ Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО 
		|	Ссылка.Склад,
		|	Номенклатура
		|УПОРЯДОЧИТЬ ПО Номенклатура,Ссылка.Склад.Код";
	Иначе		
		ТекстЗапроса="
		|ВЫБРАТЬ 
		|	Склад,
		|	Номенклатура,
		|	СУММА(Остаток)				КАК Остаток,
		|	СУММА(Стоимость)			КАК Стоимость,	
		|	СУММА(Амортизация)			КАК Амортизация,
		|	СУММА(Резерв)				КАК Резерв		
		|ИЗ
		|(
		|ВЫБРАТЬ
		|	Склад,
		|	Номенклатура,	
		|	КоличествоОстаток	Как Остаток,	
		|	СуммаОстаток 		Как Стоимость,			
		|	0					Как Амортизация,		
		|	0 Как Резерв		
		|ИЗ
		|	РегистрНакопления.ОстаткиТМЦ.Остатки(&МоментВремени,
		|	Склад В (&Склады)
		|	И Номенклатура В  (&МассивНоменклатуры)
		|)	
		|КАК ОстаткиОпер
		|ДЛЯ ИЗМЕНЕНИЯ РегистрНакопления.ОстаткиТМЦ.Остатки	
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	Склад,
		|	ОС,	
		|	0					Как Остаток,	
		|	0			 		Как Стоимость,			
		|	АмортизацияОстаток	Как Амортизация,		
		|	0 Как Резерв		
		|ИЗ
		|	РегистрНакопления.Амортизация.Остатки(&МоментВремени,Склад В (&Склады) И ОС В (&МассивНоменклатуры))	
		|КАК ОстаткиАморт
		|ДЛЯ ИЗМЕНЕНИЯ РегистрНакопления.Амортизация.Остатки";
		
		КонтрольРезервов=Истина;
		Если ПараметрыСеанса.ОтключитьКонтрольРезервов ИЛИ ВидДокумента="СписаниеТМЦ" Тогда			
			КонтрольРезервов=Ложь;
		КонецЕсли; 
		
		Если КонтрольРезервов Тогда
			ТекстЗапроса=ТекстЗапроса+"
			|ОБЪЕДИНИТЬ ВСЕ
			|ВЫБРАТЬ
			|	Склад,
			|	Номенклатура,	
			|	0 				Как Остаток,	
			|	0				Как Стоимость,			
			|	0				Как Амортизация,
			|	КоличествоОстаток Как Резерв			
			|ИЗ
			|	РегистрНакопления.РезервыТМЦ.Остатки(&МоментВремени,
			|	Склад В (&Склады)
			|	И Номенклатура В (&МассивНоменклатуры))	
			|КАК РезервыОпер
			|ДЛЯ ИЗМЕНЕНИЯ РегистрНакопления.РезервыТМЦ.Остатки";
		КонецЕсли;
		
		ТекстЗапроса=ТекстЗапроса+"
		|) КАК ОбщийЗапрос
		|СГРУППИРОВАТЬ ПО Склад,Номенклатура
		|УПОРЯДОЧИТЬ ПО Номенклатура,Склад.Код";
	КонецЕсли;	
	
	Запрос.Текст=ТекстЗапроса;	
	
	Запрос.УстановитьПараметр("Ссылка",				Конт.Ссылка);
	// *** РНК+КМПЛ
	Запрос.УстановитьПараметр("МассивНоменклатуры",	ПолучитьНоменклатуруДокумента(Конт.Ссылка, ИмяТЧ));
	// РНК+КМПЛ ***
	
	ТекСкладДокумента=Конт.Склад;
	если ТекСкладДокумента.ВидСклада=Перечисления.ВидСклада.ВиртуальныйДляСклада и ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
		ТекСкладДокумента=ТекСкладДокумента.ФизическийСклад;
		НеиспользоватьСкладДокумента=Истина;
	иначе
		НеиспользоватьСкладДокумента=Ложь;
	КонецЕсли;
	
	Склады=Новый Массив;
	Если Склад=Неопределено Тогда		
		Если ПараметрыСеанса.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда		
			Если Конт.Склад.ФизическийСклад.Пустая() Тогда
				Склады.Добавить(Конт.Склад);						
			Иначе
				если Конт.Склад.ВидСклада=Перечисления.ВидСклада.ВиртуальныйДляСклада и ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.Склад тогда 	
					Склады.Добавить(Конт.Склад);
					ТекСкладДокумента=Конт.Склад;
				иначе
					Склады.Добавить(Конт.Склад.ФизическийСклад);
					ТекСкладДокумента=Конт.Склад.ФизическийСклад;
				КонецЕсли;
			КонецЕсли;	
		Иначе   
			если НеиспользоватьСкладДокумента тогда
				Склады.Добавить(ТекСкладДокумента);
			иначе
				Склады.Добавить(Конт.Склад);
			КонецЕсли;
			// Кухарь А.Ю. 12.02.2024 конец
			
			//все-таки проще исправлять потом, чем списывать по разным складам. С 1 сентября 2009 
			//Если ВидДокумента="СписаниеТМЦ" Тогда
			Если ВидДокумента="СписаниеТМЦ" И Конт.Дата < '20090901' Тогда
				ВиртуальныеСклады=ПолучитьВиртуальныеСклады(Конт.Склад);					
				Для Каждого ВиртСклад Из ВиртуальныеСклады Цикл
					Склады.Добавить(ВиртСклад);			
				КонецЦикла; 
			КонецЕсли; 
		КонецЕсли;		
	Иначе
		Склады.Добавить(Склад);
	КонецЕсли;	
	
	
	//Мессерле 23,01,2012
	Если  ТипЗнч(Конт)=Тип("ДокументСсылка.ЗаказПоставщику") и ЗначениеЗаполнено(Конт.транзитныйСклад)  тогда  //Мессерле 05.04.12 и Загрузка
		ТекСкладДокумента=Конт.ТранзитныйСклад;
	Конецесли;	
	
	Запрос.УстановитьПараметр("СкладДокумента",ТекСкладДокумента);
	Запрос.УстановитьПараметр("Склады",Склады);
	Если Период=Неопределено Тогда
		Запрос.УстановитьПараметр("МоментВремени",новый граница(Конт.МоментВремени(),видграницы.Исключая));	
	Иначе
		Запрос.УстановитьПараметр("МоментВремени",Период);
	КонецЕсли;	
	
	Результат	=Запрос.Выполнить();
	
	ТО=Результат.Выгрузить();	

	Если ВидДокумента="ОтчетКомиссионера" тогда		
		ВозвратыКомиссия=ПолучитьВозвратыКомиссииТекущегоДокумента(Конт);
		пока ВозвратыКомиссия.Следующий() цикл
			если  ВозвратыКомиссия.ДатаИзДокумента>='20230301' тогда
				МассивСтарыхСтрок=ТО.НайтиСтроки(новый Структура("Номенклатура",ВозвратыКомиссия.Номенклатура)); 	
				Если МассивСтарыхСтрок.Количество()= 0 тогда
					НоваяСтрокаТО = ТО.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаТО,ВозвратыКомиссия);
					ЦенаПрихода=ПолучитьЦенуПрихода(НоваяСтрокаТО.Номенклатура,НоваяСтрокаТО.Склад,ВозвратыКомиссия.ДатаИзДокумента);
					
					если ЦенаПрихода=0 или ЦенаПрихода = Неопределено тогда
						НоваяСтрокаТО.Стоимость=-ВозвратыКомиссия.ВсегоИзДокумента;
					Иначе
						НоваяСтрокаТО.Стоимость=ЦенаПрихода*ВозвратыКомиссия.Остаток;
					КонецЕсли;
				иначе
					СтараяСтрока=МассивСтарыхСтрок.Получить(0);
					СтарыйОстаток=СтараяСтрока.Остаток;
					СтараяСтоимость=СтараяСтрока.Стоимость;
					СтараяЦена=?(СтарыйОстаток=0,0,СтараяСтоимость/СтарыйОстаток);
					НоваяСтоимость=ВозвратыКомиссия.Остаток*СтараяЦена;
					СтараяСтрока.Остаток=СтараяСтрока.Остаток+ВозвратыКомиссия.Остаток;
					СтараяСтрока.Стоимость=СтараяСтрока.Стоимость+НоваяСтоимость;		
				КонецЕсли;
			Иначе
				НоваяСтрокаТО = ТО.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТО,ВозвратыКомиссия);			
			КонецЕсли;
			// Кухарь А.Ю.  12.04.2023 конец
			
		КонецЦикла;
	КонецЕсли;
	// Кухарь А.Ю. 23.09.2021 конец
	
	
	//крохин начало 10.07.2015
	//добавляем остатки упаковки
	Если ВидДокумента="РасходнаяНакладная" И ТребуетсяУпаковка(Конт.ДопОбработки,Конт.КодОперации) Тогда
		если Конт.КМПЛУпаковка тогда
			ТОупаковки = ПолучитьОстаткиТМЦУпаковка(Конт,Загрузка,Склад,Период,"КомплектующиеУпаковки");
		иначе
			ТОупаковки = ПолучитьОстаткиТМЦУпаковка(Конт,Загрузка,Склад,Период,"Упаковка");	
		КонецЕсли;
		Для каждого СтрокаТОУпаковка Из ТОупаковки Цикл
			НоваяСтрокаТО = ТО.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТО,СтрокаТОУпаковка);
		КонецЦикла;
	КонецЕсли;
	Если ВидДокумента="Перемещение" Тогда
		ТОупаковки = ПолучитьОстаткиТМЦУпаковка(Конт,Загрузка,Склад,Период,"Упаковка");
		Для каждого СтрокаТОУпаковка Из ТОупаковки Цикл
			НоваяСтрокаТО = ТО.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТО,СтрокаТОУпаковка);
		КонецЦикла;
	КонецЕсли;	
	
	ТО.Колонки.Добавить("Погашено",			ПолучитьОписаниеТиповЧисла(12,3));
	ТО.Колонки.Добавить("СписанаСтоимость",	ПолучитьОписаниеТиповЧисла(19,2));
	
	Возврат ТО;
КонецФункции

//крохин начало 10.07.2015
//остатки упаковки
Функция ПолучитьОстаткиТМЦУпаковка(Конт,Загрузка,Склад=Неопределено,Период=Неопределено,ИмяТЧ=Неопределено) Экспорт
	// РНК+КМПЛ ***
	//крохин конец	
	ВидДокумента=Конт.Метаданные().Имя;
	
	Запрос=Новый Запрос;
	//крохин начало 23.12.2013
	//в Брянске тоже для ПРМ тоже ТЧ документа, переделать на реквизит
	//Если Загрузка Тогда //при загрузке тупо берем в качестве остатков ТЧ документа
	//крохин начало 29.05.2014
	//переделал на реквизит, требуется всем франчам
	//Если Загрузка ИЛИ (ПараметрыСеанса.ЭтотУзел.Подразделение.код = "SSP-0162" И КОНТ.Метаданные().Имя = "Перемещение") Тогда	
	Если Загрузка ИЛИ (ПараметрыСеанса.ЭтотУзел.Подразделение.ВидПодразделения = Перечисления.ВидыПодразделений.Франчайзинг И КОНТ.Метаданные().Имя = "Перемещение") Тогда	
		//крохин конец 29.05.2014	
		//крохин конец 23.12.2013	
		ТекстЗапроса="
		|ВЫБРАТЬ 
		|	&СкладДокумента				КАК Склад,
		|	Номенклатура,
		|	СУММА(Количество)			КАК Остаток,
		|	СУММА(0)				    КАК Стоимость,	
		|	СУММА(0)					КАК Амортизация,	
		|	СУММА(0)					КАК Резерв		
		|ИЗ
		|	Документ."+ВидДокумента+".Упаковка ГДЕ Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО 
		|	Ссылка.Склад,
		|	Номенклатура
		|УПОРЯДОЧИТЬ ПО Номенклатура,Ссылка.Склад.Код";
	Иначе		
		ТекстЗапроса="
		|ВЫБРАТЬ 
		|	Склад,
		|	Номенклатура,
		|	СУММА(Остаток)				КАК Остаток,
		|	СУММА(Стоимость)			КАК Стоимость,	
		|	СУММА(Амортизация)			КАК Амортизация,
		|	СУММА(Резерв)				КАК Резерв		
		|ИЗ
		|(
		|ВЫБРАТЬ
		|	Склад,
		|	Номенклатура,	
		|	КоличествоОстаток	Как Остаток,	
		|	СуммаОстаток 		Как Стоимость,			
		|	0					Как Амортизация,		
		|	0 Как Резерв		
		|ИЗ
		|	РегистрНакопления.ОстаткиТМЦ.Остатки(&МоментВремени,
		|	Склад В (&Склады)
		|	И Номенклатура В  (&МассивНоменклатуры)
		|)	
		|КАК ОстаткиОпер
		|ДЛЯ ИЗМЕНЕНИЯ РегистрНакопления.ОстаткиТМЦ.Остатки	
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	Склад,
		|	ОС,	
		|	0					Как Остаток,	
		|	0			 		Как Стоимость,			
		|	АмортизацияОстаток	Как Амортизация,		
		|	0 Как Резерв		
		|ИЗ
		|	РегистрНакопления.Амортизация.Остатки(&МоментВремени,Склад В (&Склады) И ОС В (&МассивНоменклатуры))	
		|КАК ОстаткиАморт
		|ДЛЯ ИЗМЕНЕНИЯ РегистрНакопления.Амортизация.Остатки";
		
		КонтрольРезервов=Истина;
		Если ПараметрыСеанса.ОтключитьКонтрольРезервов ИЛИ ВидДокумента="СписаниеТМЦ" Тогда			
			КонтрольРезервов=Ложь;
		КонецЕсли; 
		
		Если КонтрольРезервов Тогда
			ТекстЗапроса=ТекстЗапроса+"
			|ОБЪЕДИНИТЬ ВСЕ
			|ВЫБРАТЬ
			|	Склад,
			|	Номенклатура,	
			|	0 				Как Остаток,	
			|	0				Как Стоимость,			
			|	0				Как Амортизация,
			|	КоличествоОстаток Как Резерв			
			|ИЗ
			|	РегистрНакопления.РезервыТМЦ.Остатки(&МоментВремени,
			|	Склад В (&Склады)
			|	И Номенклатура В (&МассивНоменклатуры))	
			|КАК РезервыОпер
			|ДЛЯ ИЗМЕНЕНИЯ РегистрНакопления.РезервыТМЦ.Остатки";
		КонецЕсли;
		
		ТекстЗапроса=ТекстЗапроса+"
		|) КАК ОбщийЗапрос
		|СГРУППИРОВАТЬ ПО Склад,Номенклатура
		|УПОРЯДОЧИТЬ ПО Номенклатура,Склад.Код";
	КонецЕсли;	
	
	Запрос.Текст=ТекстЗапроса;	
	
	Запрос.УстановитьПараметр("Ссылка",				Конт.Ссылка);
	// *** РНК+КМПЛ
	//Запрос.УстановитьПараметр("МассивНоменклатуры",	ПолучитьНоменклатуруДокумента(Конт.Ссылка));
	// ---------- заменено на:
	Запрос.УстановитьПараметр("МассивНоменклатуры",	ПолучитьНоменклатуруДокумента(Конт.Ссылка, ИмяТЧ));
	// РНК+КМПЛ ***
	
	ТекСкладДокумента=Конт.Склад;
	
	Склады=Новый Массив;
	Если Склад=Неопределено Тогда		
		Если ПараметрыСеанса.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда		
			Если Конт.Склад.ФизическийСклад.Пустая()  Тогда
				Склады.Добавить(Конт.Склад);						
			Иначе
				Склады.Добавить(Конт.Склад.ФизическийСклад);
				ТекСкладДокумента=Конт.Склад.ФизическийСклад;
			КонецЕсли;	
		Иначе   
			Склады.Добавить(Конт.Склад);
			//все-таки проще исправлять потом, чем списывать по разным складам. С 1 сентября 2009 
			//Если ВидДокумента="СписаниеТМЦ" Тогда
			Если ВидДокумента="СписаниеТМЦ" И Конт.Дата < '20090901' Тогда
				ВиртуальныеСклады=ПолучитьВиртуальныеСклады(Конт.Склад);					
				Для Каждого ВиртСклад Из ВиртуальныеСклады Цикл
					Склады.Добавить(ВиртСклад);			
				КонецЦикла; 
			КонецЕсли; 
		КонецЕсли;		
	Иначе
		Склады.Добавить(Склад);
	КонецЕсли;	
	
	
	//Мессерле 23,01,2012
	Если  ТипЗнч(Конт)=Тип("ДокументСсылка.ЗаказПоставщику") и ЗначениеЗаполнено(Конт.транзитныйСклад)  тогда  //Мессерле 05.04.12 и Загрузка
		ТекСкладДокумента=Конт.ТранзитныйСклад;
	Конецесли;	
	
	Запрос.УстановитьПараметр("СкладДокумента",ТекСкладДокумента);
	Запрос.УстановитьПараметр("Склады",Склады);
	Если Период=Неопределено Тогда
		Запрос.УстановитьПараметр("МоментВремени",новый граница(Конт.МоментВремени(),видграницы.Исключая));	
	Иначе
		Запрос.УстановитьПараметр("МоментВремени",Период);
	КонецЕсли;	
	
	Результат	=Запрос.Выполнить();
	
	ТО=Результат.Выгрузить();	
	
	
	
	//ТО.Колонки.Добавить("Погашено");
	//ТО.Колонки.Добавить("СписанаСтоимость");	
	
	Возврат ТО;
КонецФункции
//крохин конец 10.07.2015


Функция ПолучитьРезервыТМЦ(Конт,Загрузка=Ложь,ИмяТЧ="Товары")	
	ВидДокумента=Конт.Метаданные().Имя;
	
	Запрос=Новый Запрос;
	
	Если Загрузка ИЛИ ПараметрыСеанса.ОтключитьКонтрольРезервов Тогда
		
		Запрос.Текст="
		|ВЫБРАТЬ 
		|	Ссылка.Склад				КАК Склад,
		|	Номенклатура,
		|	СУММА(Количество)			КАК Остаток,
		// Кухарь А.Ю. 13.01.2020 начало
		//Стоимость вроде бы не нужна, на всякий само поле оставлю
		// 		|	СУММА(Всего)				КАК Стоимость,	
		|	СУММА(0)				КАК Стоимость,	
		// Кухарь А.Ю. 13.01.2020 конец
		|	СУММА(0)					КАК Резерв	
		|ИЗ
		|	Документ."+ВидДокумента+"."+ИмяТЧ+" ГДЕ Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО Ссылка.Склад,Номенклатура";
	Иначе
		Запрос.Текст="
		|ВЫБРАТЬ 
		|	Склад,
		|	Номенклатура,
		|	СУММА(Остаток)				КАК Остаток,	
		|	СУММА(Резерв)				КАК Резерв		
		|ИЗ
		|(
		|ВЫБРАТЬ
		|	ОстаткиОпер.Склад,
		|	ОстаткиОпер.Номенклатура,	
		|	ОстаткиОпер.КоличествоОстаток Как Остаток,		
		|	0 Как Резерв		
		|ИЗ
		|	РегистрНакопления.ОстаткиТМЦ.Остатки(&МоментВремени,Склад = &Склад И Номенклатура В (&МассивНоменклатуры)
		|)	
		|КАК ОстаткиОпер	
		|ДЛЯ ИЗМЕНЕНИЯ РегистрНакопления.ОстаткиТМЦ.Остатки	
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	РезервыОпер.Склад,
		|	РезервыОпер.Номенклатура,	
		|	0 Как Остаток,		
		|	РезервыОпер.КоличествоОстаток Как Резерв		
		|ИЗ
		|	РегистрНакопления.РезервыТМЦ.Остатки(&МоментВремени,Склад = &Склад И Номенклатура В (&МассивНоменклатуры))	
		|КАК РезервыОпер
		|ДЛЯ ИЗМЕНЕНИЯ РегистрНакопления.РезервыТМЦ.Остатки	
		|) КАК ОбщийЗапрос
		|СГРУППИРОВАТЬ ПО Склад,Номенклатура
		|"
		;
	КонецЕсли;	
	
	Если ПараметрыСеанса.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		// Кухарь А.Ю. 24.08.2020 начало
		// Для ЗНБ с верхнего склада
		//Если Конт.Склад.ФизическийСклад.Пустая()  Тогда		
		Если Конт.Склад.ФизическийСклад.Пустая() или (ВидДокумента= "ЗаданиеНабора" и Конт.Склад.ВидСклада=Перечисления.ВидСклада.ВиртуальныйДляСклада)  Тогда
			// Кухарь А.Ю. 24.08.2020 конец
			Запрос.УстановитьПараметр("Склад",						Конт.Склад);					
		Иначе
			Запрос.УстановитьПараметр("Склад",						Конт.Склад.ФизическийСклад);			
		КонецЕсли;
	Иначе
		Запрос.УстановитьПараметр("Склад",							Конт.Склад);		
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("Расход",ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("Приход",ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("Ссылка",Конт.Ссылка);
	Запрос.УстановитьПараметр("МассивНоменклатуры",ПолучитьНоменклатуруДокумента(Конт.Ссылка));	
	
	//++Ратманов
	//Запрос.УстановитьПараметр("МоментВремени",Конт.МоментВремени());
	Запрос.УстановитьПараметр("МоментВремени",Новый Граница(Конт.МоментВремени(),ВидГраницы.Исключая));
	//--Ратманов
	
	Результат	=Запрос.Выполнить();
	
	ТО=Результат.Выгрузить();
	
	//крохин начало 10.07.2015
	//добавляем резервы упаковки
	Если ВидДокумента="РасходнаяНакладная" И ТребуетсяУпаковка(Конт.ДопОбработки,Конт.КодОперации) Тогда
		ТОупаковки = ПолучитьРезервыТМЦУпаковка(Конт,Загрузка,"Упаковка");
		Для каждого СтрокаТОУпаковка Из ТОупаковки Цикл
			НоваяСтрокаТО = ТО.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТО,СтрокаТОУпаковка);
		КонецЦикла;
	КонецЕсли;
	//крохин конец 10.07.2015
	//крохин начало 21.10.2015
	Если ВидДокумента="Перемещение" Тогда
		ТОупаковки = ПолучитьРезервыТМЦУпаковка(Конт,Загрузка,"Упаковка");
		Для каждого СтрокаТОУпаковка Из ТОупаковки Цикл
			НоваяСтрокаТО = ТО.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТО,СтрокаТОУпаковка);
		КонецЦикла;
	КонецЕсли;
	
	//крохин конец 21.10.2015
	
	Возврат ТО;
КонецФункции


Функция ПолучитьРезервыТМЦУпаковка(Конт,Загрузка=Ложь,ИмяТЧ="Товары")	
	ВидДокумента=Конт.Метаданные().Имя;
	
	Запрос=Новый Запрос;
	
	Если Загрузка ИЛИ ПараметрыСеанса.ОтключитьКонтрольРезервов Тогда
		
		Запрос.Текст="
		|ВЫБРАТЬ 
		|	Ссылка.Склад				КАК Склад,
		|	Номенклатура,
		|	СУММА(Количество)			КАК Остаток,
		|	СУММА(0)				КАК Стоимость,	
		|	СУММА(0)					КАК Резерв	
		|ИЗ
		|	Документ."+ВидДокумента+"."+ИмяТЧ+" ГДЕ Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО Ссылка.Склад,Номенклатура";
	Иначе
		Запрос.Текст="
		|ВЫБРАТЬ 
		|	Склад,
		|	Номенклатура,
		|	СУММА(Остаток)				КАК Остаток,	
		|	СУММА(Резерв)				КАК Резерв		
		|ИЗ
		|(
		|ВЫБРАТЬ
		|	ОстаткиОпер.Склад,
		|	ОстаткиОпер.Номенклатура,	
		|	ОстаткиОпер.КоличествоОстаток Как Остаток,		
		|	0 Как Резерв		
		|ИЗ
		|	РегистрНакопления.ОстаткиТМЦ.Остатки(&МоментВремени,Склад = &Склад И Номенклатура В (&МассивНоменклатуры)
		|)	
		|КАК ОстаткиОпер	
		|ДЛЯ ИЗМЕНЕНИЯ РегистрНакопления.ОстаткиТМЦ.Остатки	
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	РезервыОпер.Склад,
		|	РезервыОпер.Номенклатура,	
		|	0 Как Остаток,		
		|	РезервыОпер.КоличествоОстаток Как Резерв		
		|ИЗ
		|	РегистрНакопления.РезервыТМЦ.Остатки(&МоментВремени,Склад = &Склад И Номенклатура В (&МассивНоменклатуры))	
		|КАК РезервыОпер
		|ДЛЯ ИЗМЕНЕНИЯ РегистрНакопления.РезервыТМЦ.Остатки	
		|) КАК ОбщийЗапрос
		|СГРУППИРОВАТЬ ПО Склад,Номенклатура
		|"
		;
	КонецЕсли;	
	
	Если ПараметрыСеанса.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		Если Конт.Склад.ФизическийСклад.Пустая() Тогда
			Запрос.УстановитьПараметр("Склад",						Конт.Склад);					
		Иначе
			Запрос.УстановитьПараметр("Склад",						Конт.Склад.ФизическийСклад);			
		КонецЕсли;
	Иначе
		Запрос.УстановитьПараметр("Склад",							Конт.Склад);		
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("Расход",ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("Приход",ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("Ссылка",Конт.Ссылка);
	//Кухарь 01.04.19 начало	
	//Комплектующие упаковки	
	//Запрос.УстановитьПараметр("МассивНоменклатуры",ПолучитьНоменклатуруДокумента(Конт.Ссылка,"Упаковка"));		
	если Конт.КМПЛУпаковка тогда
		Запрос.УстановитьПараметр("МассивНоменклатуры",ПолучитьНоменклатуруДокумента(Конт.Ссылка,"КомплектующиеУпаковки"));	
	иначе
		Запрос.УстановитьПараметр("МассивНоменклатуры",ПолучитьНоменклатуруДокумента(Конт.Ссылка,"Упаковка"));	
	КонецЕсли;
	//Кухарь 01.04.19 конец	
	
	
	Запрос.УстановитьПараметр("МоментВремени",Конт.МоментВремени());
	
	Результат	=Запрос.Выполнить();
	
	ТО=Результат.Выгрузить();
	
	
	Возврат ТО;
КонецФункции


Функция ПолучитьЦеныМоделей(Конт,СписокМоделей,Загрузка)
	ВидДокумента=Конт.Метаданные().Имя;
	
	Запрос=Новый Запрос;
	
	Если Загрузка ИЛИ ПараметрыСеанса.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда //при загрузке (или на складах и ТЦ) тупо берем в качестве цен ТЧ документа
		ТекстЗапроса="
		|ВЫБРАТЬ		
		|	Номенклатура.Родитель		КАК Модель,
		|	СУММА(Количество)			КАК Остаток,
		|	СУММА(Всего)				КАК Стоимость,
		|	ВЫБОР КОГДА СУММА(Количество)=0 ТОГДА NULL ИНАЧЕ СУММА(Всего)/СУММА(Количество) КОНЕЦ КАК РасчетнаяЦена
		|ИЗ
		|	Документ."+ВидДокумента+".Товары ГДЕ Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО Номенклатура.Родитель";
	Иначе		
		ТекстЗапроса="
		|ВЫБРАТЬ 
		|	Модель,
		|	СУММА(Остаток)		КАК Остаток,
		|	СУММА(Стоимость)	КАК Стоимость,
		|	ВЫБОР КОГДА СУММА(Остаток)=0 ТОГДА NULL ИНАЧЕ СУММА(Стоимость)/СУММА(Остаток) КОНЕЦ КАК РасчетнаяЦена
		|ИЗ
		|(
		|ВЫБРАТЬ		
		|	Номенклатура.Родитель	КАК Модель,	
		|	КоличествоОстаток		КАК Остаток,	
		|	СуммаОстаток 			КАК Стоимость
		|ИЗ
		|	РегистрНакопления.ОстаткиТМЦ.Остатки(&МоментВремени,
		//|	Склад = &Склад И 	
		//крохин начало 15.05.2024
		|";
		Если Конт.Дата > '20240501' Тогда
			ТекстЗапроса=ТекстЗапроса + "
			| Склад.Подразделение.ВидПодразделения <> Значение(Перечисление.ВидыПодразделений.Франчайзинг) И
			|";	
		КонецЕсли;
		ТекстЗапроса=ТекстЗапроса + "
		//крохин конец 15.05.2024
		|	Номенклатура В ИЕРАРХИИ (&СписокМоделей)
		|)) КАК Остатки
		|СГРУППИРОВАТЬ ПО Модель";
	КонецЕсли; 
	
	
	Запрос.Текст=ТекстЗапроса;	
	
	Запрос.УстановитьПараметр("МоментВремени",Конт.МоментВремени());
	
	Запрос.УстановитьПараметр("Ссылка",			Конт.Ссылка);
	Запрос.УстановитьПараметр("Склад",			Конт.Склад);
	Запрос.УстановитьПараметр("СписокМоделей",	СписокМоделей);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // ПолучитьЦеныМоделец()


Функция ПолучитьЦеныОстатков(ПНК)
	Запрос=Новый Запрос;
	
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Номенклатура		КАК Номенклатура,	
	|	ВЫБОР 
	|		КОГДА Склад = &Склад ТОГДА КоличествоОстаток	
	|	ИНАЧЕ 0 
	|	КОНЕЦ				КАК Остаток_Склад,		
	|	КоличествоОстаток	КАК Остаток_Общий,
	|	ВЫБОР 
	|		КОГДА Склад = &Склад ТОГДА СуммаОстаток
	|	ИНАЧЕ 0 
	|	КОНЕЦ 				КАК Стоимость_Склад,		
	|	СуммаОстаток		КАК Стоимость_Общий	
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(&Дата2,
	//|		Склад = &Склад И 
	//крохин начало 06.08.2019
	//без франчайзинга
	|";
	Если ПНК.Дата > '20190701' Тогда
		Запрос.Текст=Запрос.Текст + "
		| Склад.Подразделение.ВидПодразделения <> Значение(Перечисление.ВидыПодразделений.Франчайзинг) И";	
	КонецЕсли;
	Запрос.Текст=Запрос.Текст + "
	//крохин конец 06.08.2019
	|		Номенклатура В (&Номенклатура))
	|КАК ОстаткиТМЦОстатки";
	
	Запрос.УстановитьПараметр("Дата2", Новый Граница(ПНК.МоментВремени(),ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Склад",ПНК.Склад);
	Запрос.УстановитьПараметр("Номенклатура",ПНК.Товары.ВыгрузитьКолонку("Номенклатура"));
	
	ТР		=Запрос.Выполнить().Выгрузить();
	ТР.Свернуть("Номенклатура","Остаток_Склад,Остаток_Общий,Стоимость_Склад,Стоимость_Общий");
	
	Возврат ТР;
КонецФункции //ПолучитьЦеныОстатков(ПНК)


Функция ПолучитьТаблицуРеализацииДляВозврата(ПНК)
	Запрос=Новый Запрос;	
	ДатаЧ='20090101';
	
	Если ПНК.ДокОснование<>Неопределено И НЕ ПНК.ДокОснование.Пустая() Тогда	
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Номенклатура КАК Номенклатура,
		|	Количество КАК Количество,
		|	Сумма КАК Стоимость
		|ИЗ
		|	РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ
		|ГДЕ
		|	ОстаткиТМЦ.Регистратор = &Регистратор
		|	И ОстаткиТМЦ.ВидДвижения = &ВидДвижения";
		
		Запрос.УстановитьПараметр("Регистратор",ПНК.ДокОснование);
		Запрос.УстановитьПараметр("ВидДвижения",ВидДвиженияНакопления.Расход);
		
		ТР=Запрос.Выполнить().Выгрузить();
		
		Если ЗначениеЗаполнено(Константы.ДатаЗапретаВидимости.Получить()) Тогда
			ДатаОтгрузки=ПНК.Дата;
		Иначе
			ДатаОтгрузки=ПНК.ДокОснование.Дата;
		КонецЕсли;
		
		Если ПНК.Дата>=ДатаЧ И ДатаОтгрузки<ДатаЧ Тогда		
			ВалютаУпр_Старая	=ПараметрыСеанса.ВалютаУпр;
			КурсУпр_Старый		=ПолучитьКурсВалюты_ПоРусски(ВалютаУпр_Старая,ДатаОтгрузки);
			
			ВалютаУпр			=ПараметрыСеанса.ВалютаУпр_2009;
			КурсУпр				=ПолучитьКурсВалюты_ПоРусски(ВалютаУпр,ДатаОтгрузки);
			
			Для Каждого СтрокаТР ИЗ ТР Цикл
				СтрокаТР.Стоимость=глПересчет(СтрокаТР.Стоимость,ВалютаУпр_Старая,КурсУпр_Старый,ВалютаУпр,КурсУпр);			
			КонецЦикла; 			
		КонецЕсли;				
	Иначе
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Номенклатура		КАК Номенклатура,
		|	КоличествоОстаток	КАК Количество,
		|	СуммаОстаток		КАК Стоимость	
		|ИЗ
		|	РегистрНакопления.ОстаткиТМЦ.Остатки(&Дата2,Склад = &Склад И Номенклатура В (&Номенклатура))
		|КАК ОстаткиТМЦОстатки";
		
		Запрос.УстановитьПараметр("Дата2", Новый Граница(ПНК.МоментВремени(),ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("Склад",ПНК.Склад);
		Запрос.УстановитьПараметр("Номенклатура",ПНК.Товары.ВыгрузитьКолонку("Номенклатура"));	
		
		ТР=Запрос.Выполнить().Выгрузить();
		
		Запрос.МенеджерВременныхТаблиц=Новый МенеджерВременныхТаблиц;
		Запрос.Текст="
		|ВЫБРАТЬ 
		|	* 
		|ПОМЕСТИТЬ ТР
		|ИЗ
		|	&ТР КАК ТР
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Номенклатура	
		|ПОМЕСТИТЬ ПНК
		|ИЗ
		|	Документ.ПриходнаяНакладная.Товары КАК ПНК
		|ГДЕ
		|	Ссылка=&Ссылка
		|	И Количество<>0
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПНК.Номенклатура КАК Номенклатура
		|ИЗ
		|	ПНК
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ТР
		|ПО		
		|	ТР.Номенклатура=ПНК.Номенклатура
		|ГДЕ
		|	ТР.Количество ЕСТЬ NULL ИЛИ ТР.Количество=0";
		
		Запрос.УстановитьПараметр("ТР",ТР);
		Запрос.УстановитьПараметр("Ссылка",ПНК.Ссылка);
		СписокПустыхПозиций=Запрос.Выполнить().Выгрузить();
		
		/////////////////////////////////////////////////////////////////////////////////
		// НОВОЕ УСЛОВИЕ И ПНК.КодОперации <> Перечисления.КодыОперацийОстатки.Комиссия
		/////////////////////////////////////////////////////////////////////////////////
		
		Если СписокПустыхПозиций.Количество()>0 И ПНК.Дата>='20110601'
			И ПНК.КодОперации <> Перечисления.КодыОперацийОстатки.Комиссия Тогда
			
			Запрос=Новый Запрос;
			Запрос.Текст="
			|ВЫБРАТЬ
			|	Номенклатура,
			|	Период,
			|	Регистратор,
			|	Сумма,
			|	Количество
			|ПОМЕСТИТЬ Приходы
			|ИЗ
			|	РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ
			|ГДЕ
			|	ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|	И (КодОперации = ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.Закупка) ИЛИ КодОперации = ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.Комплектация))
			|	И Номенклатура В (&Номенклатура)
			|	И Период МЕЖДУ &ДатаЧ И &Дата2
			|;
			|ВЫБРАТЬ 
			|	Номенклатура,
			|	МАКСИМУМ(Период) КАК Период
			|ПОМЕСТИТЬ ПоследниеПриходы
			|ИЗ Приходы
			|СГРУППИРОВАТЬ ПО 
			|	Номенклатура
			|;
			|ВЫБРАТЬ 
			|	Приходы.Номенклатура,
			|	СУММА(Приходы.Сумма) 		КАК Стоимость,
			|	СУММА(Приходы.Количество) 	КАК Количество
			|ИЗ
			|	ПоследниеПриходы
			|ЛЕВОЕ СОЕДИНЕНИЕ
			|	Приходы
			|ПО
			|	ПоследниеПриходы.Номенклатура=Приходы.Номенклатура
			|	И ПоследниеПриходы.Период=Приходы.Период
			|СГРУППИРОВАТЬ ПО
			|	Приходы.Номенклатура";
			
			Запрос.УстановитьПараметр("ДатаЧ", ДатаЧ);
			Запрос.УстановитьПараметр("Дата2", ПНК.Дата);			
			Запрос.УстановитьПараметр("Номенклатура",СписокПустыхПозиций);
			
			ТР_ПоПустым=Запрос.Выполнить().Выгрузить();
			Для Каждого СтрокаТР_Попустым Из ТР_ПоПустым Цикл
				СтрокаТР=ТР.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТР,СтрокаТР_Попустым);			
			КонецЦикла; 			
		КонецЕсли;
		
		Для Каждого СтрокаТР Из ТР Цикл
			Если СтрокаТР.Количество<>0 Тогда
				СтрокаТР.Стоимость	=1000000*СтрокаТР.Стоимость/СтрокаТР.Количество;
				СтрокаТР.Количество	=1000000;
			КонецЕсли; 
		КонецЦикла;   
	КонецЕсли;	
	
	Возврат ТР;
КонецФункции // ()

//крохин начало 08.12.2020
Функция ПолучитьТаблицуРеализацииДляВозвратаОтчетКомиссионера(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОтчетКомиссионераТовары.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.ОтчетКомиссионера.Товары КАК ОтчетКомиссионераТовары
	|ГДЕ
	|	ОтчетКомиссионераТовары.Ссылка = &Ссылка
	|	И ОтчетКомиссионераТовары.Количество < 0";
	Запрос.УстановитьПараметр("Ссылка",Документ);
	
	СписокНоменклатуры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
	
	Запрос=Новый Запрос;	
	ДатаЧ='20090101';
	
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Номенклатура		КАК Номенклатура,
	|	КоличествоОстаток	КАК Количество,
	|	СуммаОстаток		КАК Стоимость	
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(&Дата2,Склад = &Склад И Номенклатура В (&Номенклатура))
	|КАК ОстаткиТМЦОстатки";
	
	Запрос.УстановитьПараметр("Дата2", Новый Граница(Документ.МоментВремени(),ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Склад",Документ.Склад);
	Запрос.УстановитьПараметр("Номенклатура",СписокНоменклатуры);	
	
	ТР=Запрос.Выполнить().Выгрузить();
	
	Запрос.МенеджерВременныхТаблиц=Новый МенеджерВременныхТаблиц;
	Запрос.Текст="
	|ВЫБРАТЬ 
	|	* 
	|ПОМЕСТИТЬ ТР
	|ИЗ
	|	&ТР КАК ТР
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура	
	|ПОМЕСТИТЬ ПНК
	|ИЗ
	|	Документ.ОтчетКомиссионера.Товары КАК ПНК
	|ГДЕ
	|	Ссылка=&Ссылка
	|	И Количество<0
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПНК.Номенклатура КАК Номенклатура
	|ИЗ
	|	ПНК
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ТР
	|ПО		
	|	ТР.Номенклатура=ПНК.Номенклатура
	|ГДЕ
	|	ТР.Количество ЕСТЬ NULL ИЛИ ТР.Количество=0";
	
	Запрос.УстановитьПараметр("ТР",ТР);
	Запрос.УстановитьПараметр("Ссылка",Документ.Ссылка);
	СписокПустыхПозиций=Запрос.Выполнить().Выгрузить();
	
	Если СписокПустыхПозиций.Количество()>0 И Документ.Дата>='20110601' Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Номенклатура,
		|	Период,
		|	Регистратор,
		|	Сумма,
		|	Количество
		|ПОМЕСТИТЬ Приходы
		|ИЗ
		|	РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ
		|ГДЕ
		|	ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И (КодОперации = ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.Закупка) ИЛИ КодОперации = ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.Комплектация))
		|	И Номенклатура В (&Номенклатура)
		|	И Период МЕЖДУ &ДатаЧ И &Дата2
		|;
		|ВЫБРАТЬ 
		|	Номенклатура,
		|	МАКСИМУМ(Период) КАК Период
		|ПОМЕСТИТЬ ПоследниеПриходы
		|ИЗ Приходы
		|СГРУППИРОВАТЬ ПО 
		|	Номенклатура
		|;
		|ВЫБРАТЬ 
		|	Приходы.Номенклатура,
		|	СУММА(Приходы.Сумма) 		КАК Стоимость,
		|	СУММА(Приходы.Количество) 	КАК Количество
		|ИЗ
		|	ПоследниеПриходы
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	Приходы
		|ПО
		|	ПоследниеПриходы.Номенклатура=Приходы.Номенклатура
		|	И ПоследниеПриходы.Период=Приходы.Период
		|СГРУППИРОВАТЬ ПО
		|	Приходы.Номенклатура";
		
		Запрос.УстановитьПараметр("ДатаЧ", ДатаЧ);
		Запрос.УстановитьПараметр("Дата2", Документ.Дата);			
		Запрос.УстановитьПараметр("Номенклатура",СписокПустыхПозиций);
		
		ТР_ПоПустым=Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаТР_Попустым Из ТР_ПоПустым Цикл
			СтрокаТР=ТР.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТР,СтрокаТР_Попустым);			
		КонецЦикла; 			
	КонецЕсли;
	
	Для Каждого СтрокаТР Из ТР Цикл
		Если СтрокаТР.Количество<>0 Тогда
			СтрокаТР.Стоимость	=1000000*СтрокаТР.Стоимость/СтрокаТР.Количество;
			СтрокаТР.Количество	=1000000;
		КонецЕсли; 
	КонецЦикла;   
	
	
	Возврат ТР;
КонецФункции // ()

//крохин конец 08.12.2020

//крохин начало 08.12.2020
Функция ПолучитьТаблицуРеализацииДляВозвратаПретензия(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПретензияТовары.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.Претензия.Товары КАК ПретензияТовары
	|ГДЕ
	|	ПретензияТовары.Ссылка = &Ссылка
	|	И ПретензияТовары.Количество > 0";
	Запрос.УстановитьПараметр("Ссылка",Документ);
	
	СписокНоменклатуры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
	
	Запрос=Новый Запрос;	
	ДатаЧ='20090101';
	
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Номенклатура		КАК Номенклатура,
	|	КоличествоОстаток	КАК Количество,
	|	СуммаОстаток		КАК Стоимость	
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(&Дата2,Склад = &Склад И Номенклатура В (&Номенклатура))
	|КАК ОстаткиТМЦОстатки";
	
	Запрос.УстановитьПараметр("Дата2", Новый Граница(Документ.МоментВремени(),ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Склад",Документ.ДокОснование.СкладКомиссия);
	Запрос.УстановитьПараметр("Номенклатура",СписокНоменклатуры);	
	
	ТР=Запрос.Выполнить().Выгрузить();
	
	Запрос.МенеджерВременныхТаблиц=Новый МенеджерВременныхТаблиц;
	Запрос.Текст="
	|ВЫБРАТЬ 
	|	* 
	|ПОМЕСТИТЬ ТР
	|ИЗ
	|	&ТР КАК ТР
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура	
	|ПОМЕСТИТЬ ПНК
	|ИЗ
	|	Документ.Претензия.Товары КАК ПНК
	|ГДЕ
	|	Ссылка=&Ссылка
	|	И Количество<0
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПНК.Номенклатура КАК Номенклатура
	|ИЗ
	|	ПНК
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ТР
	|ПО		
	|	ТР.Номенклатура=ПНК.Номенклатура
	|ГДЕ
	|	ТР.Количество ЕСТЬ NULL ИЛИ ТР.Количество=0";
	
	Запрос.УстановитьПараметр("ТР",ТР);
	Запрос.УстановитьПараметр("Ссылка",Документ.Ссылка);
	СписокПустыхПозиций=Запрос.Выполнить().Выгрузить();
	
	Если СписокПустыхПозиций.Количество()>0 И Документ.Дата>='20110601' Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Номенклатура,
		|	Период,
		|	Регистратор,
		|	Сумма,
		|	Количество
		|ПОМЕСТИТЬ Приходы
		|ИЗ
		|	РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ
		|ГДЕ
		|	ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И (КодОперации = ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.Закупка) ИЛИ КодОперации = ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.Комплектация))
		|	И Номенклатура В (&Номенклатура)
		|	И Период МЕЖДУ &ДатаЧ И &Дата2
		|;
		|ВЫБРАТЬ 
		|	Номенклатура,
		|	МАКСИМУМ(Период) КАК Период
		|ПОМЕСТИТЬ ПоследниеПриходы
		|ИЗ Приходы
		|СГРУППИРОВАТЬ ПО 
		|	Номенклатура
		|;
		|ВЫБРАТЬ 
		|	Приходы.Номенклатура,
		|	СУММА(Приходы.Сумма) 		КАК Стоимость,
		|	СУММА(Приходы.Количество) 	КАК Количество
		|ИЗ
		|	ПоследниеПриходы
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	Приходы
		|ПО
		|	ПоследниеПриходы.Номенклатура=Приходы.Номенклатура
		|	И ПоследниеПриходы.Период=Приходы.Период
		|СГРУППИРОВАТЬ ПО
		|	Приходы.Номенклатура";
		
		Запрос.УстановитьПараметр("ДатаЧ", ДатаЧ);
		Запрос.УстановитьПараметр("Дата2", Документ.Дата);			
		Запрос.УстановитьПараметр("Номенклатура",СписокПустыхПозиций);
		
		ТР_ПоПустым=Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаТР_Попустым Из ТР_ПоПустым Цикл
			СтрокаТР=ТР.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТР,СтрокаТР_Попустым);			
		КонецЦикла; 			
	КонецЕсли;
	
	Для Каждого СтрокаТР Из ТР Цикл
		Если СтрокаТР.Количество<>0 Тогда
			СтрокаТР.Стоимость	=1000000*СтрокаТР.Стоимость/СтрокаТР.Количество;
			СтрокаТР.Количество	=1000000;
		КонецЕсли; 
	КонецЦикла;   
	
	
	Возврат ТР;
КонецФункции // ()

Функция ПогаситьРезервы(ТекДок,Товары,Остатки,ТДВР,Получатель,ТО=Неопределено)		
	//Товары.Сортировать("Номенклатура"); //Чирков - а на хрена оно надо ?
	
	Результат=1;
	ВидДокумента=ТекДок.Метаданные().Имя;
	
	Если ВидДокумента="ЗаданиеНабора" Тогда
		Заказ=ТекДок.Накладная;
	Иначе
		Заказ=ТекДок.Ссылка;
	КонецЕсли;
	
	Для Каждого СтрокаТоваров Из Товары Цикл	
		Если СтрокаТоваров.ЭтоУслуга Тогда 			
		Иначе			
			ТекОстатки		=Остатки.НайтиСтроки(Новый Структура("Номенклатура",СтрокаТоваров.Номенклатура));
			
			Если ВидДокумента="Перемещение" Тогда
				НадоСписать 	=СтрокаТоваров.ПодтвержденнаяЗаявка;
			Иначе				
				НадоСписать 	=СтрокаТоваров.Количество;			
			КонецЕсли;			
			
			Остаток			=0; Резерв		=0;
			
			Для Каждого СтрокаОстатка Из ТекОстатки Цикл
				Остаток					=СтрокаОстатка.Остаток;
				Резерв					=СтрокаОстатка.Резерв;
				
				ОперационныйОстаток		=СтрокаОстатка.Остаток	-Макс(СтрокаОстатка.Резерв,0);				
				
				ТекКоличество=Мин(НадоСписать,ОперационныйОстаток);
				
				Если ТекКоличество>0 Тогда					
					СтрокаОстатка.Остаток	=СтрокаОстатка.Остаток	-ТекКоличество;				
					
					Движение 				= ТДВР.Добавить();
					
					Движение.Активность		= Истина;					
					Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;
					
					Движение.Период 		= ТекДок.Дата;
					
					Движение.Склад			= СтрокаТоваров.Склад;
					Движение.Номенклатура	= СтрокаТоваров.Номенклатура;					
					Движение.Заказ			= Заказ;
					Движение.Получатель		= Получатель;					
					
					Движение.Количество		= ТекКоличество;
					
					НадоСписать				= НадоСписать-ТекКоличество;					
				КонецЕсли;
			КонецЦикла; 
			
			Если НадоСписать<>0 Тогда
				ЗаписатьВТаблицуОшибок(ТО,ТекДок,"Недостаточно товара",Товары.Индекс(СтрокаТоваров),СтрокаТоваров,Остаток,Резерв);
				
				Результат=-1;
				
				Движение				= ТДВР.Добавить();
				
				Движение.Активность		= Истина;
				Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;
				
				Движение.Период 		= ТекДок.Дата;
				
				Движение.Склад			= СтрокаТоваров.Склад;
				Движение.Номенклатура	= СтрокаТоваров.Номенклатура;				
				Движение.Заказ			= Заказ;
				Движение.Получатель		= Получатель;
				
				Движение.Количество		= НадоСписать;				
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат Результат;
КонецФункции

// нечаева
Функция ПроверитьОстатки(ТекДок,КодОперации,Товары,Остатки,ТДВО,Получатель=Неопределено,ПунктДоставки=Неопределено,ТО=Неопределено,КонтрольОстатков=Истина,Период=Неопределено,КолонкаКоличества="Количество")
	МетаДок=ТекДок.Метаданные();
	Если ЕстьРеквизитДокумента("Валюта",МетаДок) Тогда
		ВалютаДокумента=ТекДок.Валюта;		
	Иначе
		ВалютаДокумента=?(ТекДок.Дата>='20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);						
	КонецЕсли;	
	
	НеСписыватьКоличество=Ложь;
	
	КурсУпр		=	глПересчет(1,ВалютаДокумента,ТекДок.Дата,ПараметрыСеанса.ВалютаУпр_2009,ТекДок.Дата,Ложь);		
	
	Результат=1;
	
	КэшЦенСписания	=Новый Соответствие;
	ПолучательВТЧ	=?(Товары.Колонки.Найти("Получатель")=Неопределено,Ложь,Истина); 
	ТекПериод		=?(Период=Неопределено,ТекДок.Дата,Период);
	
	Для Каждого СтрокаТоваров Из Товары Цикл	
		
		НадоСписать 	=СтрокаТоваров.Количество;			
		
		Если КонтрольОстатков Тогда
			
			Номенклатура	=СтрокаТоваров.Номенклатура;
			ТекОстатки		=Остатки.НайтиСтроки(Новый Структура("Номенклатура",СтрокаТоваров.Номенклатура));
			
			Остаток			=0;  Резерв		=0;
			
			ЦенаСписания	=Неопределено;
			
			Для Каждого СтрокаОстатка Из ТекОстатки Цикл
				Остаток					=СтрокаОстатка.Остаток;
				Резерв					=СтрокаОстатка.Резерв;					
				
				ОперационныйОстаток		=СтрокаОстатка.Остаток	-Макс(СтрокаОстатка.Резерв,0);
				
				Если Остаток<>0 Тогда
					ЦенаСписания=СтрокаОстатка.Стоимость/Остаток;
					КэшЦенСписания.Вставить(Номенклатура,ЦенаСписания);
				КонецЕсли; 
				
				ТекКоличество=Мин(НадоСписать,ОперационныйОстаток);
				Если ТекКоличество>0 Тогда			
					
					НадоСписать=НадоСписать-ТекКоличество;
				КонецЕсли;
			КонецЦикла; 
			Если НадоСписать<>0 Тогда				
				ЗаписатьВТаблицуОшибок(ТО,ТекДок,"Недостаточно товара",Товары.Индекс(СтрокаТоваров),СтрокаТоваров,Остаток,Резерв);
				
				Результат=-1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
	Возврат Результат;
КонецФункции
// нечаева --




Функция ДвиженияПриходнойНакладной(ТекДок,ТД)
	ЭтоЛена			 	= ?(Найти(Константы.НеПроводитьПриходПоИБ.Получить(),ТекДок.ИБ.Код)<>0,?(ТекДок.КодОперации=Перечисления.КодыОперацийОстатки.ЗакупкаР,Ложь,Истина),Ложь);	
	Если ТекДок.Дата>='20080901' Тогда ЭтоЛена=Ложь КонецЕсли; 
	
	ЦеныОстатков		= Неопределено;
	
	Результат=1;
	
	//закупку по Лене в ЦИБ не проводим
	Если ЭтоЛена и ТекДок.КодОперации=Перечисления.КодыОперацийОстатки.Закупка Тогда
		ТД.Очистить();	
		Возврат Результат;
	КонецЕсли; 
	
	ДатаДок				= ТекДок.Дата;
	
	ВалютаУпр_Старая	= ПараметрыСеанса.ВалютаУпр;	
	
	ВалютаУпр			= ?(ТекДок.Дата>='20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);	
	КурсУпр				= ПолучитьКурсВалюты_ПоРусски(ВалютаУпр,ДатаДок);
	
	Рубли		= ПараметрыСеанса.ВалютаНац;
	КурсРубля	= ПолучитьКурсВалюты_ПоРусски(Рубли,ДатаДок);
	
	ВалютаДок	=ТекДок.Валюта;
	КурсДок		=ТекДок.Курс;	
	
	КодОперации		=ТекДок.КодОперации;
	
	ЕстьРНКОснование=Ложь;
	//крохин начало 19.07.2022
	//Если КодОперации=Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя Тогда	
	//при возврате комиссионного товара себестоимость рассчитывается аналогично обычному возврату 
	Если КодОперации=Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя ИЛИ (КодОперации=Перечисления.КодыОперацийОстатки.Комиссия И ТекДок.Дата >= '20220701') Тогда		
		//крохин конец 19.07.2022	
		
		ТС=ПолучитьТаблицуРеализацииДляВозврата(ТекДок);
		
		РассчитатьОбороты(ТД,ТекДок.Валюта,ТекДок.Курс,Рубли,КурсРубля,ВалютаУпр,КурсУпр,-1);
		
		Если ЗначениеЗаполнено(ТекДок.ДокОснование) И ТекДок.ДокОснование.Метаданные().Имя="РасходнаяНакладная" Тогда	
			ЕстьРНКОснование=Истина;
		КонецЕсли;
	КонецЕсли;
	
	ЗаписиЦПП=РегистрыСведений.История.СоздатьНаборЗаписей();
	ЗаписиЦПП.Отбор.Документ.Использование	=Истина;
	ЗаписиЦПП.Отбор.Документ.Значение		=ТекДок.Ссылка;
	
	ЗаписиЦПП.Отбор.Реквизит.Использование	=Истина;
	ЗаписиЦПП.Отбор.Реквизит.Значение		="ЦенаПоследнегоПрихода";
	
	СписокПозиций=Новый Соответствие;
	
	ВалСто		=0;	
	//крохин начало 10.04.2013
	//франчайзинг - реквизит подразделения	
	//+++Чирков франчи и розницные ТЦ 21.01.13				
	//Если ТекДок.Подразделение.Код="SSP-0148" ИЛИ ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
	//крохин начало 23.12.2013
	//в Брянске нужен оборот, потом переделать на реквизит
	//Если ТекДок.Подразделение.ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг ИЛИ ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
	//крохин начало 29.05.2014
	//переделал на реквизит
	//крохин начало 05.06.2014
	//в ЦО проводки не нужны, ошибка
	//Если ПараметрыСеанса.ЭтотУзел.Подразделение.ВидПодразделения<>Перечисления.ВидыПодразделений.Франчайзинг И ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
	Если ПараметрыСеанса.ЭтотУзел.Подразделение.ВидПодразделения<>Перечисления.ВидыПодразделений.Франчайзинг И (ТекДок.Подразделение.ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг) Тогда
		//крохин конец 05.06.2014
		//крохин конец 29.05.2014
		//крохин конец 23.12.2013	
		//крохин конец 10.04.2013
		ЗаписыватьСтоимость=Ложь;
	Иначе
		ЗаписыватьСтоимость=Истина;		
	КонецЕсли;	
	//---Чирков франчи и розницные ТЦ 21.01.13
	
	Для Каждого СтрокаТД Из ТД Цикл
		
		СтрокаТД.ВалютаДокумента=ВалютаДок;
		
		Если ЭтоЛена Тогда
			// Ленина накладная в центральной базе			
			ЦПП=ПолучитьПериодическийРеквизит(СтрокаТД.Номенклатура,"ЦенаПоследнегоПрихода",ТекДок.Дата);			
			
			ВалСто=СтрокаТД.Количество*?(ЦПП=Неопределено,0,ЦПП);			
			Если ВалСто=0 Тогда
				Сообщить("При проведении приходной накладной по ИБ: """+ТекДок.ИБ+""" не задана цена последнего прихода ! Товар: "+СтрокаТД.Номенклатура,СтатусСообщения.Важное);
			КонецЕсли;				
		Иначе				
			// если стоит цена возврата то используем ее
			//крохин начало 19.07.2022
			//Если КодОперации=Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя Тогда	
			//при возврате комиссионного товара себестоимость рассчитывается аналогично обычному возврату 
			Если КодОперации=Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя ИЛИ (КодОперации=Перечисления.КодыОперацийОстатки.Комиссия И ТекДок.Дата >= '20220701') Тогда		
				//крохин конец 19.07.2022
				ТекСтоимость	=СтрокаТД.Количество*СтрокаТД.ЦенаВозврата;				
				ВалСто			=глПересчет(ТекСтоимость,ВалютаДок,КурсДок,ВалютаУпр,КурсУпр);
				
				Если ВалютаДок<>ВалютаУпр Тогда
					ВалСто			=0; //ха-ха именно так оно всегда и работалов 7.7				
				КонецЕсли;				
				
				Если ТекДок.Дата>='20080901' Тогда
					ВалСто			=0;				
				КонецЕсли; 
				
			Иначе
				ТекСтоимость	=СтрокаТД.Всего;
				//для контрагентов без НДС с/с увеличивается и формируются затраты
				// Шворобей 09.01.2024 ++ https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2458
				Если ТекДок.Дата >= '20151201' И КодОперации = Перечисления.КодыОперацийОстатки.ЗакупкаР И ТекДок.Контрагент.СтавкаНДСКонтрагента = Перечисления.СтавкиНДС.БезНДС Тогда
					ТекСТавкаНДС = ПроцентНДСпоСтавке(ПолучитьСтавкуНДС(СтрокаТД.Номенклатура));
					//крохин начало 26.02.2016
					//НДС сверху с февраля 2016
					//ТекСтоимость = ТекСтоимость*(1 + ТекСТавкаНДС/(1+ТекСТавкаНДС));
					Если ТекДок.Дата >= '20160201' Тогда
						ТекСтоимость = ТекСтоимость*(1 + ТекСТавкаНДС);					
					Иначе
						ТекСтоимость = ТекСтоимость*(1 + ТекСТавкаНДС/(1+ТекСТавкаНДС));
					КонецЕсли;
					//крохин конец 26.02.2016
				КонецЕсли;
				//крохин конец 21.12.2015
				ВалСто			=глПересчет(ТекСтоимость,ВалютаДок,КурсДок,ВалютаУпр,КурсУпр);
				
				Если НЕ ЭтоЛена Тогда
					ЦенаПрихода=?(СтрокаТД.Количество=0,0,ВалСто/СтрокаТД.Количество);
					Если ЦенаПрихода>0 Тогда
						//!!!!!!!!!!!!!!!!!!!!!! Вернуть назад
						
						Если СписокПозиций.Получить(СтрокаТД.Номенклатура)=Неопределено Тогда
							ЗаписьЦПП=ЗаписиЦПП.Добавить();
							ЗаписьЦПП.Период	=ТекДок.Дата;
							ЗаписьЦПП.Реквизит	="ЦенаПоследнегоПрихода";
							ЗаписьЦПП.Объект	=СтрокаТД.Номенклатура;
							ЗаписьЦПП.Документ	=ТекДок.Ссылка;
							ЗаписьЦПП.Значение	=ЦенаПрихода;
							
							//чушь из-за дублей строк в накладных
							СписокПозиций.Вставить(СтрокаТД.Номенклатура,Истина);						
						КонецЕсли;					
						
						//УстановитьПериодическийРеквизит(СтрокаТД.Номенклатура,"ЦенаПоследнегоПрихода",ЦенаПрихода,ДатаДок,ТекДок.Ссылка);
					КонецЕсли;						
				КонецЕсли;					
			КонецЕсли;				
		КонецЕсли;			
		
		//крохин начало 19.07.2022
		//Если КодОперации=Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя Тогда	
		//при возврате комиссионного товара себестоимость рассчитывается аналогично обычному возврату 
		Если КодОперации=Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя ИЛИ (КодОперации=Перечисления.КодыОперацийОстатки.Комиссия И ТекДок.Дата >= '20220701') Тогда		
			//крохин конец 19.07.2022
			Если ЭтоЛена Тогда
				СтрокаТД.Всего			=  ВалСто;
			ИначеЕсли НЕ ЗаписыватьСтоимость Тогда //+++Чирков франчи и розницные ТЦ 21.01.13				
				СтрокаТД.Всего=0;
			Иначе					
				Перебор=0;
				
				СтрокаТС=ТС.Найти(СтрокаТД.Номенклатура,"Номенклатура");
				
				Если СтрокаТС<>Неопределено Тогда					
					Если ВалСто=0 Тогда
						ВалСто=?(СтрокаТС.Количество<>0,СтрокаТД.Количество*Окр(СтрокаТС.Стоимость/СтрокаТС.Количество,2,1),0); // дурь собачья (округление) но трудящиеся все равно попросят!!!						
					КонецЕсли;
					Если СтрокаТС.Количество<СтрокаТД.Количество Тогда
						Перебор=СтрокаТД.Количество-СтрокаТС.Количество;
					КонецЕсли;					
				Иначе
					Перебор=СтрокаТД.Количество;					
				КонецЕсли;
				
				Если Перебор>0 Тогда
					Если ЕстьРНКОснование Тогда
						Сообщить("Превышение количества возвращенного товара: "+СтрокаТД.Номенклатура+" над отгруженым на "+Перебор+" шт. !",СтатусСообщения.Важное);				    
						Результат=0;
					Иначе
						Если ТекДок.Дата>='20080901' Тогда
							ВалСто			=0;          
						ИначеЕсли СтрокаТД.ЦенаВозврата=0 Тогда								
							// нечаева 01,07,14 добавила роль +++
							Если  РольДоступна("Администратор") Тогда
								Сообщить("Внимание ! Товара : """+СтрокаТД.Номенклатура+""" нет на складе и не задана цена возврата. Товар приходуется по продажным ценам !",СтатусСообщения.ОченьВажное);
							конецЕсли;
							// нечаева 01,07,14 добавила роль ---
							ВалСто=глПересчет(СтрокаТД.Всего,ВалютаДок,КурсДок,ВалютаУпр,КурсУпр);						 								
						Иначе
							ВалСто=глПересчет(СтрокаТД.ЦенаВозврата*СтрокаТД.Количество,ВалютаДок,КурсДок,ВалютаУпр,КурсУпр);							
						КонецЕсли;						
					КонецЕсли;									
				КонецЕсли;		
				
				Если ВалСто=0 Тогда
					Если ЦеныОстатков=Неопределено Тогда
						ЦеныОстатков=ПолучитьЦеныОстатков(ТекДок);
					КонецЕсли;
					
					СтрокаЦеныОстатка=ЦеныОстатков.Найти(СтрокаТД.Номенклатура,"Номенклатура");					
					Если СтрокаЦеныОстатка<>Неопределено И (СтрокаЦеныОстатка.Остаток_Склад<>0 ИЛИ СтрокаЦеныОстатка.Остаток_Общий<>0) Тогда						
						Если СтрокаЦеныОстатка.Остаток_Склад<>0 Тогда
							ТекОстаток	=СтрокаЦеныОстатка.Остаток_Склад;
							ТекСтоимость=СтрокаЦеныОстатка.Стоимость_Склад;													
						Иначе
							ТекОстаток	=СтрокаЦеныОстатка.Остаток_Общий;
							ТекСтоимость=СтрокаЦеныОстатка.Стоимость_Общий;
						КонецЕсли;
						
						ВалСто	=СтрокаТД.Количество*Окр(ТекСтоимость/ТекОстаток,2,1);						
					Иначе						
						ДатаРеквизита=Неопределено;
						ЦПП		=ПолучитьПериодическийРеквизит(СтрокаТД.Номенклатура,"ЦенаПоследнегоПрихода",ТекДок.Дата,,ДатаРеквизита);
						Если ЦПП<>Неопределено Тогда
							Если ДатаРеквизита<'20090101' Тогда
								ЦПП=глПересчет(ЦПП,ВалютаУпр_Старая,ДатаРеквизита,ВалютаУпр,КурсУпр);						
							КонецЕсли;
							ВалСто	=СтрокаТД.Количество*ЦПП;												
						Иначе
							ВалСто	=0;						
						КонецЕсли;						
					КонецЕсли;				
				КонецЕсли;
				
				Если ТекДок.Дата>='20080901' И  ВалСто=0 Тогда	
					//крохин начало
					//не товар может иметь нулевые ЦПП
					
					//// нечаева 01,07,14 добавила роль +++
					//		Если  РольДоступна("Администратор") Тогда
					//			Сообщить("Внимание ! Товара : """+СтрокаТД.Номенклатура+""" нет на складе и не задана цена возврата. Товар приходуется по продажным ценам !",СтатусСообщения.ОченьВажное);
					//		конецЕсли;
					//		// нечаева 01,07,14 добавила роль ---
					//ВалСто=глПересчет(СтрокаТД.Всего,ВалютаДок,КурсДок,ВалютаУпр,КурсУпр);	
					//Если ТекДок.Дата <'20110401' Или СтрокаТД.Номенклатура.Родитель.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Товар Тогда
					Если ТекДок.Дата <'20110401' Или СтрокаТД.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Товар Тогда //Чирков
						
						//Сообщить("Внимание ! Товара : """+СтрокаТД.Номенклатура+""" нет на складе и не задана цена возврата. Товар приходуется по продажным ценам !",СтатусСообщения.ОченьВажное);
						// нечаева 01,07,14 добавила роль +++
						Если  РольДоступна("Администратор") Тогда
							Сообщить("Внимание ! Товара : """+СтрокаТД.Номенклатура+""" нет на складе и не задана цена возврата. Товар приходуется по продажным ценам !",СтатусСообщения.ОченьВажное);
						конецЕсли;
						// нечаева 01,07,14 добавила роль ---
						ВалСто=глПересчет(СтрокаТД.Всего,ВалютаДок,КурсДок,ВалютаУпр,КурсУпр);	
					КонецЕсли;	
					//крохин конец					
				КонецЕсли;
			КонецЕсли;
			
			//Катаев+ 17/07/14
			//СтрокаТД.ЦенаВозврата	=  глПересчет(ВалСто,ВалютаУпр,ДатаДок,ВалютаДок,КурсДок)/СтрокаТД.Количество;
			Если СтрокаТД.Количество = 0 Тогда
				СтрокаТД.ЦенаВозврата	=  0;
			Иначе
				СтрокаТД.ЦенаВозврата	=  глПересчет(ВалСто,ВалютаУпр,ДатаДок,ВалютаДок,КурсДок)/СтрокаТД.Количество;
			КонецЕсли;
			//Катаев- 17/07/14
		ИначеЕсли КодОперации=Перечисления.КодыОперацийОстатки.Прочее Тогда
			Если НЕ ЭтоЛена Тогда
				Сообщить("Приходные накладные с типом ""Прочее"" предназначены только для Лениной базы !",СтатусСообщения.Важное);				    
				Результат=-1;
			КонецЕсли;
		КонецЕсли;		
		
		СтрокаТД.Всего			=  ВалСто;
		//крохин начало
		//сертификаты всегда имеют нулевую себестоимость
		//Если ПолучитьРеквизитРодителя(СтрокаТД.Номенклатура,"ВидНоменклатуры") = Перечисления.ВидыНоменклаутры.ПодарочныйСертификат Тогда
		Если СтрокаТД.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.ПодарочныйСертификат Тогда //Чирков 
			СтрокаТД.Всего = 0;
			//крохин начало 11.06.2013
			//и нулевой оборот при возвратах 
			Если ТекДок.Дата>='20130501' И КодОперации=Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя Тогда
				СтрокаТД.оборот = 0;
				СтрокаТД.ОборотБезСкидки = 0;
			КонецЕсли;
			//крохин конец 11.06.2013
			
			
		КонецЕсли;
		//крохин конец
	КонецЦикла;	
	
	ЗаписиЦПП.Записать();
	
	
	Возврат Результат;
КонецФункции

Функция ДвиженияЗаказаПоставщику(ТекДок,ТД)		
	Результат=1;
	
	ДатаДок		=ТекДок.Дата;
	
	ВалютаУпр	= ?(ТекДок.Дата>='20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);
	КурсУпр		= ПолучитьКурсВалюты(ВалютаУпр,ДатаДок);	
	
	ВалютаДок	=ТекДок.Валюта;
	КурсДок		=ТекДок.Курс;
	
	Если ВалютаДок<>ВалютаУпр Тогда
		Для Каждого СтрокаТД Из ТД Цикл		
			СтрокаТД.Всего	=глПересчет(СтрокаТД.Всего,ВалютаДок,КурсДок,ВалютаУпр,КурсУпр);	
		КонецЦикла;	
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции

Функция ДвиженияОприходования(ТекДок,ТД,ТО,Загрузка)
	ВалютаУпр	=?(ТекДок.Дата>='20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);
	КурсУпр		=ПолучитьКурсВалюты_ПоРусски(ВалютаУпр,ТекДок.Дата);
	
	ВалютаДок	=?(ЗначениеЗаполнено(ТекДок.Валюта),ТекДок.Валюта,ПараметрыСеанса.ВалютаУпр);
	КурсДок		=?(ЗначениеЗаполнено(ТекДок.Курс),ТекДок.Курс,ПолучитьКурсВалюты_ПоРусски(ВалютаДок,ТекДок.Дата));
	
	Результат=1;
	
	ТД.Колонки.Добавить("РасчетнаяЦена",ПолучитьОписаниеТиповЧисла(15,2));
	
	СписокМоделей=Новый Массив;
	
	ТипУзла=ПараметрыСеанса.ТипУзла;
	
	НеНашлиЦены=Новый Соответствие;
	Для Каждого СтрокаТД Из ТД Цикл
		Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			Если СтрокаТД.ВидНоменклатуры<>Перечисления.ВидыНоменклаутры.ОсновноеСредство Тогда			
				СтрокаОстатка=ТО.Найти(СтрокаТД.Номенклатура,"Номенклатура");	
				Если СтрокаОстатка<>Неопределено И СтрокаОстатка.Остаток>0 Тогда
					Если СтрокаОстатка.Стоимость>0 Тогда
						СтрокаТД.РасчетнаяЦена=СтрокаОстатка.Стоимость/СтрокаОстатка.Остаток;
					Иначе
						Если ТекДок.Дата>='20091101'Тогда //По просьбе Сибилева от 17.11.2009 приходуем по нулевым ценам
							СтрокаТД.РасчетнаяЦена=0
						Иначе
							НеНашлиЦены.Вставить(СтрокаТД,Истина);
							Если СписокМоделей.Найти(СтрокаТД.Номенклатура.Родитель)=Неопределено Тогда
								СписокМоделей.Добавить(СтрокаТД.Номенклатура.Родитель);			
							КонецЕсли; 						
						КонецЕсли;					
					КонецЕсли;
				Иначе
					НеНашлиЦены.Вставить(СтрокаТД,Истина);
					Если СписокМоделей.Найти(СтрокаТД.Номенклатура.Родитель)=Неопределено Тогда
						СписокМоделей.Добавить(СтрокаТД.Номенклатура.Родитель);			
					КонецЕсли; 
				КонецЕсли;			
			КонецЕсли;			
		Иначе //в периферийных узлах просто берем цены из ТЧ
			НеНашлиЦены.Вставить(СтрокаТД,Истина);
			Если СписокМоделей.Найти(СтрокаТД.Номенклатура.Родитель)=Неопределено Тогда
				СписокМоделей.Добавить(СтрокаТД.Номенклатура.Родитель);			
			КонецЕсли;			
		КонецЕсли;		
	КонецЦикла;
	
	//если не нашли на остатках попробуем найти по остаткам модели
	Если НеНашлиЦены.Количество()>0 Тогда
		ТО=ПолучитьЦеныМоделей(ТекДок,СписокМоделей,Загрузка);	
		Для Каждого Элемент Из НеНашлиЦены Цикл		
			СтрокаТД=Элемент.Ключ;
			СтрокаОстатка=ТО.Найти(СтрокаТД.Номенклатура.Родитель,"Модель");	
			Если СтрокаОстатка<>Неопределено И ЗначениеЗаполнено(СтрокаОстатка.РасчетнаяЦена) Тогда
				СтрокаТД.РасчетнаяЦена=СтрокаОстатка.РасчетнаяЦена;
				НеНашлиЦены.Удалить(СтрокаТД);
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
	
	//если совсем ничего не нашли тогда берем ЦПП
	Если НеНашлиЦены.Количество()>0 Тогда
		Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			Для Каждого Элемент Из НеНашлиЦены Цикл
				СтрокаТД=Элемент.Ключ;
				//ПолучитьПериодическийРеквизит(Объект,ИмяРеквизита,Знач Дата2=Неопределено,КодИБ=Неопределено,ДатаРеквизита="") Экспорт
				
				ДатаЦены="";
				СтрокаТД.РасчетнаяЦена=ПолучитьПериодическийРеквизит(СтрокаТД.Номенклатура,"ЦенаПоследнегоПрихода",ТекДок.Дата,,ДатаЦены);
				Если ЗначениеЗаполнено(СтрокаТД.РасчетнаяЦена) И ДатаЦены<'20090101' И ТекДок.Дата>='20090101' Тогда
					СтрокаТД.РасчетнаяЦена=глПересчет(СтрокаТД.РасчетнаяЦена,ПараметрыСеанса.ВалютаУпр,ДатаЦены,ВалютаУпр,КурсУпр);									
				КонецЕсли; 
			КонецЦикла;	
		КонецЕсли;	
	КонецЕсли;
	
	ТекСкладДокумента=ТекДок.Склад;
	
	Склады=Новый Массив;
	Если ПараметрыСеанса.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда	
		//Кухарь 13.05.16 начало
		//Не увидел что у ОПР отдельно всё
		//Если НЕ ТекДок.Склад.ФизическийСклад.Пустая()  Тогда
		Если НЕ ТекДок.Склад.ФизическийСклад.Пустая()  и не (ТекДок.склад.ВидСклада=Перечисления.ВидСклада.ВиртуальныйДляСклада и ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.Склад) Тогда
			//Кухарь 13.05.16 конец
			ТекСкладДокумента=ТекДок.Склад.ФизическийСклад;
		КонецЕсли;
		//Кухарь 13.05.16 начало
		//крохин начало 20.12.2018
		//опечатка
		//ИначеЕсли ТекСкладДокумента.видсклада=Перечисления.ВидСклада.ВиртуальныйДляСклада и НЕ ТекСкладДокумента.Склад.ФизическийСклад.Пустая()  тогда
	ИначеЕсли ТекСкладДокумента.видсклада=Перечисления.ВидСклада.ВиртуальныйДляСклада и НЕ ТекСкладДокумента.ФизическийСклад.Пустая()  тогда
		//крохин конец 20.12.2018
		ТекСкладДокумента=ТекСкладДокумента.ФизическийСклад;
		//Кухарь 13.05.16 конец		
		
	КонецЕсли;		
	
	ТД.ЗаполнитьЗначения(ТекСкладДокумента,"Склад");	
	Для Каждого СтрокаТД ИЗ ТД Цикл
		Если ЗначениеЗаполнено(СтрокаТД.ЦенаОприходования) Тогда
			СтрокаТД.РасчетнаяЦена=глПересчет(СтрокаТД.ЦенаОприходования,ВалютаДок,КурсДок,ВалютаУпр,КурсУпр);		
		КонецЕсли;
		Если СтрокаТД.ВидНоменклатуры<>Перечисления.ВидыНоменклаутры.ОсновноеСредство Тогда
			СтрокаТД.Всего=СтрокаТД.Количество*СтрокаТД.РасчетнаяЦена;
		Иначе
			Если СтрокаТД.Количество<>0 Тогда				
				СтрокаТД.Всего=СтрокаТД.Количество*СтрокаТД.РасчетнаяЦена;			
			КонецЕсли;			
		КонецЕсли;			
	КонецЦикла; 
	
	Возврат Результат;
КонецФункции // ДвиженияОприходования() 

Функция ДвиженияИнвентаризации(ТекДок,ТД)
	//крохин начало 20.12.2018
	//разрешаем ИНВ по вспомогательному складу, в ЦО проводки по основному
	//ТД.ЗаполнитьЗначения(ТекДок.Склад,"Склад");
	Если ТекДок.Склад.ВидСклада=Перечисления.ВидСклада.ВиртуальныйДляСклада И ПараметрыСеанса.ЭтотУзел.ТипУзла <> Перечисления.ТипУзлаИБ.Склад Тогда
		ТД.ЗаполнитьЗначения(ТекДок.Склад.ФизическийСклад,"Склад");
	Иначе
		ТД.ЗаполнитьЗначения(ТекДок.Склад,"Склад");
	КонецЕсли;
	//крохин конец 20.12.2018	
	ТС=ТД.Скопировать(); ТС.Очистить();
	ТО=ТД.Скопировать(); ТО.Очистить();
	
	Для Каждого СтрокаТЧ Из ТД Цикл
		Если СтрокаТЧ.Количество<0 Тогда		
			СтрокаТС=ТС.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТС,СтрокаТЧ);
			СтрокаТС.Количество=-СтрокаТС.Количество;
		ИначеЕсли СтрокаТЧ.Количество>0 Тогда		
			СтрокаТО=ТО.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТО,СтрокаТЧ);
		КонецЕсли;		
	КонецЦикла;	
	
	Возврат Новый Структура("ТС,ТО",ТС,ТО);
КонецФункции // ДвиженияИнвентаризации()


Функция ПолучитьТаблицуСписания(Документ)
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ОстаткиТМЦ.Склад,
	|	ОстаткиТМЦ.Номенклатура,
	|	ОстаткиТМЦ.Марка,
	|	ОстаткиТМЦ.Количество,
	|	ОстаткиТМЦ.Вес,
	|	ОстаткиТМЦ.Сумма
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ
	|ГДЕ
	|	ОстаткиТМЦ.Регистратор = &Регистратор
	|	И ОстаткиТМЦ.ВидДвижения = &Расход"
	;
	
	Запрос.УстановитьПараметр("Регистратор",Документ);
	Запрос.УстановитьПараметр("Расход",ВидДвиженияНакопления.Расход);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // ПолучитьТаблицуСписания() 


Функция СоздатьТаблицуДвижений(ИмяРегистра)
	Набор=РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
	
	Возврат Набор.Выгрузить();	
КонецФункции // СоздатьТаблицуДвижений(ИмяРегистра) 

Функция ПолучитьТЧДокумента(Ссылка,ВидДокумента,ИмяТЧ="Товары")
	МетаДок=Метаданные.Документы[ВидДокумента];
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Номенклатура.Услуга 					КАК ЭтоУслуга,
	|	Номенклатура.Родитель.ВидНоменклатуры	КАК ВидНоменклатуры,
	|	*
	|ИЗ
	|	Документ."+ВидДокумента+"."+ИмяТЧ+"
	|ГДЕ
	|	Ссылка = &Ссылка
	|	И (
	|		Количество<>0 
	|		"+?(ЕстьРеквизитТабЧастиДокумента("Всего",МетаДок,ИмяТЧ),"ИЛИ Всего<>0","")+"
	|		"+?(ВидДокумента="Перемещение"," ИЛИ ПодтвержденнаяЗаявка<>0","")+"
	|	)
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура";	
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // ПолучитьТЧДокумента()

Функция ПолучитьТЧУпаковкаДокумента(Ссылка,ВидДокумента,ИмяТЧ="Упаковка")
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Номенклатура.Услуга 					КАК ЭтоУслуга,
	|	Номенклатура.Родитель.ВидНоменклатуры	КАК ВидНоменклатуры,
	|   0 КАК Всего,
	|   0 КАК ВсегоБезСкидки,
	|	*
	|ИЗ
	|	Документ."+ВидДокумента+"."+ИмяТЧ+"
	|ГДЕ
	|	Ссылка = &Ссылка
	//|	И (Количество<>0 ИЛИ Всего<>0"+?(ВидДокумента="Перемещение"," ИЛИ ПодтвержденнаяЗаявка<>0","")+")
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура";	
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // ПолучитьТЧДокумента()

Функция РассчитатьОбороты(ТД,ВалютаДокумента,КурсДокумента,Рубли,КурсРубля,ВалютаУпр,КурсВалютыУпр,Знак=1)
	Для Каждого СтрокаТД Из ТД Цикл
		Если ВалютаДокумента<>ВалютаУпр Тогда
			СтрокаТД.ОборотУпр			=Знак*глПересчет(СтрокаТД.Всего,			ВалютаДокумента,КурсДокумента,ВалютаУпр,КурсВалютыУпр);							
			СтрокаТД.ОборотБезСкидкиУпр =Знак*глПересчет(СтрокаТД.ВсегоБезСкидки,	ВалютаДокумента,КурсДокумента,ВалютаУпр,КурсВалютыУпр);
		Иначе
			СтрокаТД.ОборотУпр			=Знак*СтрокаТД.Всего;				
			СтрокаТД.ОборотБезСкидкиУпр =Знак*СтрокаТД.ВсегоБезСкидки;
		КонецЕсли;
		
		Если ВалютаДокумента<>Рубли Тогда
			СтрокаТД.Оборот				=Знак*глПересчет(СтрокаТД.Всего,			ВалютаДокумента,КурсДокумента,Рубли,29);							
			СтрокаТД.ОборотБезСкидки	=Знак*глПересчет(СтрокаТД.ВсегоБезСкидки,	ВалютаДокумента,КурсДокумента,Рубли,29);
		Иначе
			СтрокаТД.Оборот				=Знак*СтрокаТД.Всего;				
			СтрокаТД.ОборотБезСкидки	=Знак*СтрокаТД.ВсегоБезСкидки;
		КонецЕсли;
	КонецЦикла;	
КонецФункции // РассчитатьОборот()


Функция ПровестиПоОстаткам(Документ,Движения,Загрузка=Ложь,ТаблицаСписания) Экспорт	
	Если ПараметрыСеанса.Отладка Тогда
		Сообщить("Проведение: "+Документ);
	КонецЕсли;
	
	ЭтотУзел=ПараметрыСеанса.ЭтотУзел;
	
	Результат	=1;
	ТОшибок		=Неопределено;	
	
	ТДВО=СоздатьТаблицуДвижений("ОстаткиТМЦ");
	ТДВР=СоздатьТаблицуДвижений("РезервыТМЦ");
	
	КонтрольОстатковНаТА=НЕ ПолучитьПолномочиеПользователя("НеКонтролироватьОстаткиНаТА");
	
	ТекВид			= Документ.Метаданные().Имя;	
	ТекДок			= Документ;
	
	ДатаДокумента	= ПолучитьРеквизитыШапки(ТекДок,Новый Структура("Дата")).Дата;	
	
	#Если Клиент Тогда
		Состояние(""+ТекВид+" "+ТекДок.Номер+" "+ДатаДокумента);
	#КонецЕсли
	
	ВалютаУпр	= ?(ДатаДокумента>='20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);	
	КурсУпр		= ПолучитьКурсВалюты_ПоРусски(ВалютаУпр,Документ.Дата);
	
	Рубли		= ПараметрыСеанса.ВалютаНац;	
	КурсРубля	= ПолучитьКурсВалюты_ПоРусски(Рубли,ДатаДокумента);
	
	ТС=Новый ТаблицаЗначений;
	ТС.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));	
	
	// *** РНК+КМПЛ
	ИмяТЧ = ПолучитьИмяТоварнойТЧ(Документ);
	// РНК+КМПЛ ***	
	
	ТД=ПолучитьТЧДокумента(Документ,ТекВид,ИмяТЧ);
	ТД.Колонки.Добавить("КодОперации");
	//упаковка
	Если ТекВид="РасходнаяНакладная" И ТребуетсяУпаковка(Документ.ДопОбработки,Документ.КодОперации) Тогда
		если  Документ.КМПЛУпаковка тогда
			ТДУпаковка = ПолучитьТЧУпаковкаДокумента(Документ.Ссылка,ТекВид,"КомплектующиеУпаковки");
			Если  ПараметрыСеанса.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				ТекСклад			=?(ТекДок.Склад.ФизическийСклад.Пустая(),ТекДок.Склад,ТекДок.Склад.ФизическийСклад);
			Иначе
				ТекСклад			=ТекДок.Склад;
			КонецЕсли;
			
			Для Каждого СтрокаТДУпаковка ИЗ ТДУпаковка Цикл	
				если СтрокаТДУпаковка.Номенклатура<> СтрокаТДУпаковка.Продукция тогда
					
					НоваяСтрокаТД = ТД.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаТД,СтрокаТДУпаковка);
					НоваяСтрокаТД.КодОперации = Перечисления.КодыОперацийОстатки.Комплектация;
					
					Движение = ТДВО.Добавить();		
					
					Движение.Активность		= Истина;
					Движение.подразделение=ТекДок.подразделение;
					движение.валютаДокумента=ТекДок.валюта;
					Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;
					Движение.ПунктДоставки	= ТекДок.пунктДоставки;
					
					Движение.Период 		= ТекДок.Дата;
					Движение.Склад			= ТекСклад;
					Движение.Номенклатура	= СтрокаТДУпаковка.Продукция;										
					Движение.Количество		= СтрокаТДУпаковка.КоличествоПродукции;
					Движение.КодОперации	= Перечисления.КодыОперацийОстатки.Комплектация;
					Движение.Отправитель	= ТекДок.Склад;	
				КонецЕсли;
				
				
			КонецЦикла;
			ТДПродукции=ТДУпаковка.скопировать();
			ТДПродукции.свернуть("Продукция","Количество,КоличествоПродукции");
			Для каждого СтрПродукции из ТДПродукции цикл
				НоваяСтрокаТД = ТД.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТД,СтрПродукции);
				НоваяСтрокаТД.Номенклатура=СтрПродукции.Продукция;
				НоваяСтрокаТД.КодОперации = Перечисления.КодыОперацийОстатки.Списание;	
				НоваяСтрокаТД.Всего=0;
				НоваяСтрокаТД.ВсегоБезСкидки=0;				
				НоваяСтрокаТД.ЭтоУслуга=ложь;
			КонецЦикла;
			
			
		иначе
			ТДУпаковка = ПолучитьТЧУпаковкаДокумента(Документ.Ссылка,ТекВид,"Упаковка");
			Для Каждого СтрокаТДУпаковка ИЗ ТДУпаковка Цикл	
				НоваяСтрокаТД = ТД.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТД,СтрокаТДУпаковка);
				//крохин начало 29.10.2015
				Если Документ.дата >= '20151001' Тогда
					НоваяСтрокаТД.КодОперации = Перечисления.КодыОперацийОстатки.Списание;
				КонецЕсли;
				//крохин конец 29.10.2015
			КонецЦикла;
			
		КонецЕсли;
		//Кухарь 01.04.19 конец
		
	КонецЕсли;
	//крохин конец 10.07.2015
	
	//крохин начало 29.10.2015
	//упаковка ПРМ
	Если ТекВид = "Перемещение" Тогда
		ТДУпаковка = ПолучитьТЧУпаковкаДокумента(Документ.Ссылка,ТекВид,"Упаковка");
		Для Каждого СтрокаТДУпаковка ИЗ ТДУпаковка Цикл	
			НоваяСтрокаТД = ТД.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТД,СтрокаТДУпаковка);
			Если Документ.дата >= '20151001' Тогда
				НоваяСтрокаТД.КодОперации = Перечисления.КодыОперацийОстатки.Списание;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если НЕ ЕстьРеквизитТабЧастиДокумента("Склад",ТекДок.Метаданные(), ИмяТЧ) Тогда	
		ТД.Колонки.Добавить("Склад",Новый ОписаниеТипов("СправочникСсылка.Склады"));	
	КонецЕсли;	
	
	Если НЕ ЕстьРеквизитТабЧастиДокумента("Подразделение",ТекДок.Метаданные(), ИмяТЧ) Тогда
		ТД.Колонки.Добавить("Подразделение",Новый ОписаниеТипов("СправочникСсылка.Подразделения"));	
	КонецЕсли;
	
	
	ТД.Колонки.Добавить("ЦенаСписания", 		ПолучитьОписаниеТиповЧисла(19,10));
	ТД.Колонки.Добавить("СписанаСтоимость", 	ПолучитьОписаниеТиповЧисла(19,2));
	ТД.Колонки.Добавить("Оборот",				ПолучитьОписаниеТиповЧисла(19,2));	
	ТД.Колонки.Добавить("ОборотБезСкидки",		ПолучитьОписаниеТиповЧисла(19,2));	
	ТД.Колонки.Добавить("ОборотУпр",			ПолучитьОписаниеТиповЧисла(19,2));	
	ТД.Колонки.Добавить("ОборотБезСкидкиУпр",	ПолучитьОписаниеТиповЧисла(19,2));	
	ТД.Колонки.Добавить("ВалютаДокумента",		ПолучитьОписаниеТиповЧисла(19,2));	
	ТД.Колонки.Добавить("Амортизация",			ПолучитьОписаниеТиповЧисла(19,2));
	
	Если ТД.Колонки.Найти("ДК")=Неопределено Тогда
		ТД.Колонки.Добавить("ДК");		
	КонецЕсли;	
	
	Если ТекДок.Дата<'20080201' ИЛИ ПараметрыСеанса.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		ТекСклад			=?(ТекДок.Склад.ФизическийСклад.Пустая(),ТекДок.Склад,ТекДок.Склад.ФизическийСклад);
	Иначе
		ТекСклад			=ТекДок.Склад;
	КонецЕсли;
	
	//ЗПС формирует движения только по транзитному складу
	Если ТекВид="ЗаказПоставщику" Тогда
		ТекСклад = ТекДок.ТранзитныйСклад;
	Конецесли;
	//Новый вид склада
	если ТекДок.склад.ВидСклада=Перечисления.ВидСклада.ВиртуальныйДляСклада тогда
		если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.Склад тогда
			ТекСклад=ТекДок.склад;
		иначе
			ТекСклад=ТекДок.склад.физическийсклад;
		КонецЕсли;
	КонецЕсли;
	ТД.ЗаполнитьЗначения(ТекСклад,"Склад");
	// +++ 2011-11-21 сезонные бонусы
	Если ТекВид="РасходнаяНакладная" 
		И ЕстьРеквизитТабЧастиДокумента("ЦенаБезБонуса", ТекДок.Метаданные(), ИмяТЧ) Тогда
		Если Документ.СезонныйБонус	Тогда
			// для РНК с сезонным бонусом вместо Цена и Всего используем ЦенаБезБонуса и ВсегоБезБонуса
			Для Каждого СтрокаТД Из ТД Цикл
				СтрокаТД.Цена	= СтрокаТД.ЦенаБезБонуса;
				СтрокаТД.Всего	= СтрокаТД.ВсегоБезБонуса;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	// 2011-11-21 сезонные бонусы +++
	Если ТекВид="ПриходнаяНакладная" Тогда
		//крохин начало
		//по услугам ИМ движений не делаем
		СписокУдаляемыхСтрок = Новый СписокЗначений;
		Для Каждого СтрокаТД Из ТД Цикл
			//Если ПолучитьРеквизитРодителя(СтрокаТД.Номенклатура,"ВидНоменклатуры") =  Перечисления.ВидыНоменклаутры.Услуга Тогда
			Если СтрокаТД.ВидНоменклатуры =  Перечисления.ВидыНоменклаутры.Услуга Тогда //Чирков
				СписокУдаляемыхСтрок.Добавить(СтрокаТД);
			КонецЕсли;
			//по упаковке тоже не делаем движений
			//Если ПолучитьРеквизитРодителя(СтрокаТД.Номенклатура,"ВидНоменклатуры") =  Перечисления.ВидыНоменклаутры.Упаковка Тогда
			Если СтрокаТД.ВидНоменклатуры =  Перечисления.ВидыНоменклаутры.Упаковка Тогда //Чирков
				СписокУдаляемыхСтрок.Добавить(СтрокаТД);
			КонецЕсли;
			//крохин конец	
		КонецЦикла;
		
		Для Каждого СтрокаСписка Из СписокУдаляемыхСтрок Цикл
			Тд.Удалить(СтрокаСписка.Значение);	
		КонецЦикла;		
		//крохин конец
		
		ТД.ЗаполнитьЗначения(ТекДок.Подразделение,"Подразделение");
		
		Результат	=ДвиженияПриходнойНакладной(ТекДок,ТД);
		
		ТекРезультат=ОприходоватьПартию(ТекДок,ТекДок.КодОперации,ТД,ТДВО,ТекДок.Контрагент,ТекДок.ПунктДоставки);
		//крохин начало 25.01.2017
		//возвраты сертификатов формируют доп. проводку, на списание сертификата
		Если ТекДок.ВозвратПСотЧЛ Тогда
			ТДСертификатов = ТД.скопировать();
			ТДСертификатов.очистить();
			Для Каждого СтрокаТД Из ТД Цикл
				Если СтрокаТД.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.ПодарочныйСертификат Тогда
					ЕщёОднаСтрокаТД = ТДСертификатов.Добавить();
					ЗаполнитьЗначенияСвойств(ЕщёОднаСтрокаТД,СтрокаТД);
					ЕщёОднаСтрокаТД.Сумма = 0;
					ЕщёОднаСтрокаТД.КодОперации = Перечисления.КодыОперацийОстатки.Списание;
				КонецЕсли;
			КонецЦикла;
			Если ТДСертификатов.количество() > 0 Тогда
				ТО  = ПолучитьОстаткиТМЦ(ТекДок,Загрузка);
				ТекРезультатСертификатов = ПогаситьПартии(ТекДок, , ТДСертификатов, ТО, ТДВО, ТекДок.Склад,, ТОшибок, Истина);	
				ТекРезультат = Мин(ТекРезультат,ТекРезультатСертификатов);
			КонецЕсли;
		КонецЕсли;
		
		//крохин конец 25.01.2017
		
		//крохин начало 10.12.2020
		//крохин начало 06.04.2021
		//проводки только в ЦО
		//Если ТекДок.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия Тогда
		Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение И ТекДок.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия Тогда	
			//крохин конец 06.04.2021
			КопияТДВО = ТДВО.Скопировать();	
			Для каждого СтрокаТЧ Из КопияТДВО Цикл
				НоваяСтрокаТДВО = ТДВО.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТДВО,строкаТЧ);
				НоваяСтрокаТДВО.ВидДвижения = ВидДвиженияНакопления.Расход;
				НоваяСтрокаТДВО.Склад = ТекДок.СкладКомиссия;
			КонецЦикла;
		КонецЕсли;
		//крохин конец 10.12.2020
		/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		// Если в ПНК не заполнена ТЧ "рекламации", то проводки делает ПНК. Если заполнена ТЧ "документ клиента", то по данным ТЧ
		// "документ клиента", если не заполнена, то по данным ТЧ "товары". Проводки в ПНК делаются только в состоянии "принята складом".
		/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
		//Валетов + 20.03.24 Добавления движения По ОстаткамТМЦ как в ПРМ чтоб не создавать дополнительный документ 
		//Проверяются: СкладПолучатель=ПодразделениеФранчайзинга,определенные статусы РНК, дата внедрения, Количество в ТЧ
		//+HELP-1937 20241217 Михайловский , 20250122 Крохин, другая дата , HELP-2633
		//УслРКМ = ?(ТекДок.Дата >= Дата('20241201'), Истина, ?(ТекДок.Рекламации.Количество() = 0, Истина, Ложь));
		УслРКМ = ?(ТекДок.Дата >= Дата('20250101'), Истина, ?(ТекДок.Рекламации.Количество() = 0, Истина, Ложь));
		//-HELP-1937 20241217 Михайловский
		Если ТекДок.СостояниеНакладной = Перечисления.СостоянияНакладной.Принята
			//+HELP-1937 20241217 Михайловский
			//вместо
			//И ТекДок.Рекламации.Количество() = 0
			И УслРКМ
			//-HELP-1937 20241217 Михайловский
			
			И ПараметрыСеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение 
			// Кухарь А.Ю.  11.09.2024 начало
			И ТекДок.дата>='20240901'
			// Кухарь А.Ю.  11.09.2024 конец
			
			Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РеквизитыСправочников.ЗначениеРеквизита КАК Подразделение,
			|	РеквизитыСправочников.ЗначениеРеквизита.ОсновнойСклад КАК ОсновнойСклад
			|ИЗ
			|	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
			|ГДЕ
			|	РеквизитыСправочников.ИмяРеквизита = ""ПодразделениеФранчайзинга""
			|	И РеквизитыСправочников.Справочник = &ПунктДоставки";			 
			
			Запрос.УстановитьПараметр("ПунктДоставки", ТекДок.ПунктДоставки);
			
			Резалт = Запрос.Выполнить().Выгрузить();
			
			ОсновнойСклад = Неопределено;
			Если Резалт.Количество() > 0 Тогда
				ОсновнойСклад = ?(ЗначениеЗаполнено(Резалт[0].ОсновнойСклад), Резалт[0].ОсновнойСклад, Неопределено);	
			КонецЕсли;
			
			Если ТекДок["Заказ"].Количество() > 0 Тогда
				ТабличнаяЧасть = ТекДок["Заказ"];
			Иначе
				ТабличнаяЧасть = ТекДок["Товары"];
			КонецЕсли;
			
			Если ОсновнойСклад <> Неопределено Тогда
				Для Каждого ТекСтрокаТовары Из ТабличнаяЧасть Цикл 
					Если ТекСтрокаТовары.Количество <> 0 Тогда
						
						ДопЗаписьОстатковТМЦ = ТДВО.Добавить();
						// + HELP-1937 20241106 Михайловский
						//ДопЗаписьОстатковТМЦ.ВидДвижения		= ВидДвиженияНакопления.Приход;
						ДопЗаписьОстатковТМЦ.ВидДвижения		= ВидДвиженияНакопления.Расход;
						// - HELP-1937 20241106 Михайловский
						ДопЗаписьОстатковТМЦ.Активность		= Истина;
						ДопЗаписьОстатковТМЦ.КодОперации 		= Перечисления.КодыОперацийОстатки.Перемещение;
						ДопЗаписьОстатковТМЦ.Период 		= ТекДок.Дата;
						ДопЗаписьОстатковТМЦ.Номенклатура 		= ТекСтрокаТовары.Номенклатура;
						ДопЗаписьОстатковТМЦ.Склад 			= ОсновнойСклад;
						ДопЗаписьОстатковТМЦ.Количество     	= ТекСтрокаТовары.Количество;
						ДопЗаписьОстатковТМЦ.Отправитель		= ТекДок.Склад;
						ДопЗаписьОстатковТМЦ.Сумма			= 0;
						
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;

		Результат	=Мин(Результат,ТекРезультат);	
	ИначеЕсли ТекВид="ОтчетКомиссионера" Тогда
		
		ТД.Колонки.Добавить("ВсегоБезСкидки");	
		Для Каждого СтрокаТД Из ТД Цикл
			СтрокаТД.ВсегоБезСкидки = СтрокаТД.Всего;
			СтрокаТД.Подразделение = ТекДок.Подразделение;
		КонецЦикла;
		ТД.Свернуть("ВалютаДокумента,ВидНоменклатуры,ДК,Подразделение,КодОперации,Номенклатура,Подразделение,Склад,Ссылка,СтавкаНДС,ЭтоУслуга,Цена",
		"АгентскоеВознаграждение,Амортизация,Всего,ВсегоБезСкидки,ВсегоПередачи,Количество,КомиссионныеРасходы,НДС,НДСОплата,Оборот,ОборотБезСкидки,ОборотБезСкидкиУпр,ОборотУпр,Оплата,ПлатноеХранение,ПрочиеРасходы,СкладскаяОбработка,СписанаСтоимость,Сумма,ТранспортныеРасходы");
		
		
		РассчитатьОбороты(ТД,Рубли,КурсРубля,Рубли,КурсРубля,ВалютаУпр,КурсУпр);
		КодОперации = Перечисления.КодыОперацийОстатки.Реализация;
		ТО=ПолучитьОстаткиТМЦ(ТекДок,Загрузка);
		Результат=ПогаситьПартии(ТекДок,КодОперации,ТД,ТО,ТДВО,ТекДок.Контрагент,ТекДок.ПунктДоставки,ТОшибок);
	ИначеЕсли ТекВид="Претензия" Тогда    	

		Для Каждого СтрокаТЧ ИЗ ТД Цикл
			СтрокаТЧ.Количество = - СтрокаТЧ.Количество;
			СтрокаТЧ.Сумма = - СтрокаТЧ.Сумма;
		КонецЦикла;

		КодОперации = Перечисления.КодыОперацийОстатки.Комиссия;
		
		ТД.ЗаполнитьЗначения(ТекДок.ДОкОснование.СкладКомиссия,"Склад");
		ТО=ПолучитьОстаткиТМЦ(ТекДок,Загрузка,ТекДок.ДОкОснование.СкладКомиссия);
		Результат=ПогаситьПартии(ТекДок,КодОперации,ТД,ТО,ТДВО,ТекДок.Контрагент,ТекДок.ДокОснование.ПунктДоставки,ТОшибок);
		
	ИначеЕсли ТекВид="РасходнаяНакладная" Тогда				
		Если ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение ИЛИ ТекДок.Склад.КодФизическогоУзла=ЭтотУзел.Код Тогда
			ТД.ЗаполнитьЗначения(ТекДок.Подразделение,"Подразделение");
			//по услугам ИМ движений не делаем
			СписокУдаляемыхСтрок = Новый СписокЗначений;
			Для Каждого СтрокаТД Из ТД Цикл
				Если СтрокаТД.ВидНоменклатуры =  Перечисления.ВидыНоменклаутры.Услуга Тогда //Чирков
					СписокУдаляемыхСтрок.Добавить(СтрокаТД);
				КонецЕсли;
				//по упаковке тоже не делаем движений
				Если СтрокаТД.ВидНоменклатуры =  Перечисления.ВидыНоменклаутры.Упаковка Тогда //Чирков
					СписокУдаляемыхСтрок.Добавить(СтрокаТД);
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого СтрокаСписка Из СписокУдаляемыхСтрок Цикл
				Тд.Удалить(СтрокаСписка.Значение);	
			КонецЦикла;		
			
			Если ТекДок.Отгружен=Перечисления.Отгружен.ОтгруженТранзит Тогда
				КодОперации=Перечисления.КодыОперацийОстатки.Перемещение;						
			Иначе			
				КодОперации=?(ТекДок.КодОперации.Пустая(),Перечисления.КодыОперацийОстатки.Реализация,ТекДок.КодОперации);						
			КонецЕсли;

			//в РНК-подарках код операции - списание
			Если ТекДок.Отгружен=Перечисления.Отгружен.Отгружен И ТекДок.Подарок Тогда
				КодОперации = Перечисления.КодыОперацийОстатки.Списание;	
			КонецЕсли;
			//крохин конец 16.04.2012
			
			РассчитатьОбороты(ТД,ТекДок.Валюта,ТекДок.Курс,Рубли,КурсРубля,ВалютаУпр,КурсУпр);
			
			Если ТекДок.Отгружен=Перечисления.Отгружен.Резерв ИЛИ ТекДок.Отгружен=Перечисления.Отгружен.РезервТранзит или ТекДок.Отгружен=Перечисления.Отгружен.Отменен Тогда
				//РНК+КМПЛ				
				Если НЕ ТекДок.ОтгрузкаКомплектов Тогда
					ТО=ПолучитьРезервыТМЦ(ТекДок,Загрузка);
				Иначе
					ТО=ПолучитьРезервыТМЦ(ТекДок,Загрузка,"Комплектующие");
				КонецЕсли;

				если ТекДок.КМПЛУпаковка  и ТДУпаковка <>Неопределено тогда
					Для Каждого СтрокаТДУпаковка ИЗ ТДУпаковка Цикл		
						если СтрокаТДУпаковка.Номенклатура<> СтрокаТДУпаковка.Продукция тогда							
							СтрокаТО				= ТО.Найти(СтрокаТДУпаковка.Продукция, "Номенклатура");
							Если СтрокаТО = Неопределено Тогда
								СтрокаТО				= ТО.Добавить();
								СтрокаТО.Склад			= Движение.Склад;
								СтрокаТО.Номенклатура	= Движение.Номенклатура;
								СтрокаТО.Остаток		= 0;
								СтрокаТО.Резерв			= 0;
							КонецЕсли;
							СтрокаТО.Остаток		= СтрокаТО.Остаток + СтрокаТДУпаковка.Количество;	
						КонецЕсли;
					КонецЦикла;	
				КонецЕсли;				
				//добавим упаковку 
				Результат=ПогаситьРезервы(ТекДок,ТД,ТО,ТДВР,ТекДок.Контрагент,ТОшибок);			
			Иначе
				// +++ РНК+КМПЛ
				Если ТекДок.ОтгрузкаКомплектов Тогда
					// Сначала спишем комплектующие и оприходуем продукцию (комплекты).
					
					КодОперацииКомплектация = Перечисления.КодыОперацийОстатки.Комплектация;
					
					// 1. Списание комплектующих.
					ТДКомплектующие = ПолучитьТЧДокумента(Документ.Ссылка, ТекВид, "Комплектующие");
					
					//крохин начало 16.11.2015
					//служебная колонка для упаковки
					ТДКомплектующие.Колонки.Добавить("КодОперации");
					// добавляем дополнительные колонки
					Если Не(ЕстьРеквизитТабЧастиДокумента("Склад",ТекДок.Метаданные(),"Товары")) Тогда	
						ТДКомплектующие.Колонки.Добавить("Склад",Новый ОписаниеТипов("СправочникСсылка.Склады"));	
					КонецЕсли;	
					Если Не(ЕстьРеквизитТабЧастиДокумента("Подразделение",ТекДок.Метаданные(),"Товары")) Тогда
						ТДКомплектующие.Колонки.Добавить("Подразделение",Новый ОписаниеТипов("СправочникСсылка.Подразделения"));	
					КонецЕсли; 				
					ТДКомплектующие.Колонки.Добавить("ЦенаСписания", 		ПолучитьОписаниеТиповЧисла(19,10));
					ТДКомплектующие.Колонки.Добавить("СписанаСтоимость", 	ПолучитьОписаниеТиповЧисла(19,2));
					ТДКомплектующие.Колонки.Добавить("Оборот",				ПолучитьОписаниеТиповЧисла(19,2));	
					ТДКомплектующие.Колонки.Добавить("ОборотБезСкидки",		ПолучитьОписаниеТиповЧисла(19,2));	
					ТДКомплектующие.Колонки.Добавить("ОборотУпр",			ПолучитьОписаниеТиповЧисла(19,2));	
					ТДКомплектующие.Колонки.Добавить("ОборотБезСкидкиУпр",	ПолучитьОписаниеТиповЧисла(19,2));	
					ТДКомплектующие.Колонки.Добавить("ВалютаДокумента",		ПолучитьОписаниеТиповЧисла(19,2));	
					ТДКомплектующие.Колонки.Добавить("Амортизация",			ПолучитьОписаниеТиповЧисла(19,2));				
					Если ТДКомплектующие.Колонки.Найти("ДК")=Неопределено Тогда
						ТДКомплектующие.Колонки.Добавить("ДК");		
					КонецЕсли;					
					ТДКомплектующие.ЗаполнитьЗначения(ТекСклад,"Склад");
					ТДКомплектующие.ЗаполнитьЗначения(ТекДок.Подразделение,"Подразделение");
					
					ТО			= ПолучитьОстаткиТМЦ(ТекДок, Загрузка,,, "Комплектующие");
					
					// Кухарь А.Ю.  14.03.2024 начало
					// Результат	= ПогаситьПартии(ТекДок, КодОперацииКомплектация, ТДКомплектующие, ТО, ТДВО, ТекДок.Склад,, ТОшибок, Истина);
					Результат	= ПогаситьПартии(ТекДок, КодОперацииКомплектация, ТДКомплектующие, ТО, ТДВО, ТекДок.Склад,, ТОшибок, Истина,,,Загрузка); 
					// Кухарь А.Ю.  14.03.2024 конец
					
					
					// 2. Оприходование продукции (комплектов).				
					ТПрихода = ТДКомплектующие.Скопировать();
					ТПрихода.Свернуть("Продукция", "СписанаСтоимость, КоличествоПродукции"); // ТПрихода.Свернуть("Продукция", "Количество, СписанаСтоимость, Амортизация");					
					Для Каждого СтрокаТД Из ТПрихода Цикл
						
						//Родионов конец 06.12.2011
						
						Движение = ТДВО.Добавить();
						
						Движение.Активность		= Истина;
						Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;
						Движение.Период 		= ТекДок.Дата;
						Движение.Склад			= ТекСклад;
						Движение.Номенклатура	= СтрокаТД.Продукция;										
						Движение.Количество		= СтрокаТД.КоличествоПродукции;
						Движение.Сумма			= СтрокаТД.СписанаСтоимость;
						Движение.КодОперации	= КодОперацииКомплектация;
						Движение.Отправитель	= ТекДок.Склад;	
						
						// добавим продукцию (комплекты) в таблицу остатков 
						СтрокаТО				= ТО.Найти(Движение.Номенклатура, "Номенклатура");
						Если СтрокаТО = Неопределено Тогда
							СтрокаТО				= ТО.Добавить();
							СтрокаТО.Склад			= Движение.Склад;
							СтрокаТО.Номенклатура	= Движение.Номенклатура;
							СтрокаТО.Остаток		= 0;
							СтрокаТО.Стоимость		= 0;
							СтрокаТО.Амортизация	= 0;
							СтрокаТО.Резерв			= 0;
						КонецЕсли;
						СтрокаТО.Остаток		= СтрокаТО.Остаток + Движение.Количество;
						СтрокаТО.Стоимость		= СтрокаТО.Стоимость + Движение.Сумма;						
						
					КонецЦикла;	
					
				Иначе
					
					// это обычная РНК (не комплектация)
					ТО=ПолучитьОстаткиТМЦ(ТекДок,Загрузка);
					
				КонецЕсли;	// Если ТекДок.ОтгрузкаКомплектов Тогда
				// РНК+КМПЛ +++
				
				//Иногда ставят галку по ошибке
				если ТекДок.КМПЛУпаковка  и ТДУпаковка <>Неопределено тогда
					//Кухарь 29.05.19 конец
					
					Для Каждого СтрокаТДУпаковка ИЗ ТДУпаковка Цикл		
						если СтрокаТДУпаковка.Номенклатура<> СтрокаТДУпаковка.Продукция тогда
							
							СтрокаТО				= ТО.Найти(СтрокаТДУпаковка.Продукция, "Номенклатура");
							Если СтрокаТО = Неопределено Тогда
								СтрокаТО				= ТО.Добавить();
								СтрокаТО.Склад			= Движение.Склад;
								СтрокаТО.Номенклатура	= Движение.Номенклатура;
								СтрокаТО.Остаток		= 0;
								СтрокаТО.Стоимость		= 0;
								СтрокаТО.Амортизация	= 0;
								СтрокаТО.Резерв			= 0;
							КонецЕсли;
							СтрокаТО.Остаток		= СтрокаТО.Остаток + СтрокаТДУпаковка.Количество;
							СтрокаТО.Стоимость		= СтрокаТО.Стоимость + СтрокаТДУпаковка.Всего;		
						КонецЕсли;
					КонецЦикла;	
				КонецЕсли;
				Результат=ПогаситьПартии(ТекДок,КодОперации,ТД,ТО,ТДВО,ТекДок.Контрагент,ТекДок.ПунктДоставки,ТОшибок,,,,Загрузка);				
				Если ПараметрыСеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
					Если КодОперации = Перечисления.КодыОперацийОстатки.Комиссия Тогда
						ТП = ТДВО.Скопировать();
						ТП.Колонки.Добавить("Всего");
						СкладКомиссия = ТекДок.СкладКомиссия;
						Для Каждого СтрокаТП Из ТП Цикл	
							Если СтрокаТП.КодОперации <> Перечисления.КодыОперацийОстатки.Комиссия Тогда
								СтрокаТП.количество = 0;
							КонецЕсли;
							СтрокаТП.всего = строкаТП.Сумма;
							строкаТП.Склад = СкладКомиссия;
						КонецЦикла;
						Результат=Мин(Результат,ОприходоватьПартию(ТекДок,КодОперации,ТП,ТДВО,ТекДок.Контрагент,ТекДок.ПунктДоставки));	
						ВалютаУпр	= ?(ТекДок.Дата>='20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);	
						ТДВО.ЗаполнитьЗначения(ТекДок.Валюта,"ВалютаДокумента");
					КонецЕсли;
				КонецЕсли;
				//крохин конец 05.05.2020
				Если ТекДок.Отгружен=Перечисления.Отгружен.ОтгруженТранзит Тогда
					//крохин начало 14.04.2017
					//бывает не заполнен реквизит
					//ТД.ЗаполнитьЗначения(ТекДок.СкладТранзит,"Склад");
					Если ЗначениеЗаполнено(ТекДок.СкладТранзит) Тогда
						ТД.ЗаполнитьЗначения(ТекДок.СкладТранзит,"Склад");
					Иначе
						ТД.ЗаполнитьЗначения(ТекДок.Склад.СкладОтгрузкиТранзитом,"Склад");
					КонецЕсли;
					//крохин конец 14.04.2017
					Для Каждого СтрокаТД Из ТД Цикл
						СтавкаНДС		=ПроцентНДСпоСтавке(СтрокаТД.СтавкаНДС);				
						СтрокаТД.Всего	=СтрокаТД.СписанаСтоимость;
						СтрокаТД.Сумма	=СтрокаТД.СписанаСтоимость/(1+СтавкаНДС);				
					КонецЦикла;			
					
					Результат=Мин(Результат,ОприходоватьПартию(ТекДок,КодОперации,ТД,ТДВО,ТекДок.Контрагент,ТекДок.ПунктДоставки));					
					
					ТДВО.ЗаполнитьЗначения(0,"Оборот,ОборотБезСкидки,ОборотУпр,ОборотБезСкидкиУпр");
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
		//Валетов + 20.03.24 Добавления движения По ОстаткамТМЦ как в ПРМ чтоб не создавать дополнительный документ 
		//Проверяются: СкладПолучатель=ПодразделениеФранчайзинга,определенные статусы РНК, дата внедрения, Количество в ТЧ 
		Если ТекДок.СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена
			И ТекДок.Отгружен = Перечисления.Отгружен.Отгружен 
			И ТекДок.Дата >=  '20240401'
			// Кухарь А.Ю.  02.04.2024 начало
			и ПараметрыСеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение 
			// Кухарь А.Ю.  02.04.2024 конец		
			Тогда 
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РеквизитыСправочников.ЗначениеРеквизита КАК Подразделение
			|ИЗ
			|	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
			|ГДЕ
			|	РеквизитыСправочников.ИмяРеквизита = ""ПодразделениеФранчайзинга""
			// Кухарь А.Ю. 27.05.2024 начало
			// 			|	И РеквизитыСправочников.Справочник.Ссылка = &ПунктДоставки
			|	И РеквизитыСправочников.Справочник = &ПунктДоставки";			 
			// Кухарь А.Ю. 27.05.2024 конец
			
			Запрос.УстановитьПараметр("ПунктДоставки",ТекДок.ПунктДоставки);
			ПунктДоставкиРезультат = Запрос.Выполнить().Выгрузить();
			Если ПунктДоставкиРезультат.Количество() > 0 Тогда  
				Для Каждого ТекСтрокаТовары Из ТекДок.Товары Цикл 
					Если ТекСтрокаТовары.Количество<>0 тогда
						ПериодОперации = ТекДок.Дата;
						Если ЗначениеЗаполнено(ТекДок.ДатаПриемки) И ТекДок.ДатаПриемки <= ТекущаяДата() Тогда  
							ПериодОперации = ТекДок.ДатаПриемки;
						КонецЕсли;
						ДопЗаписьОстаковТМЦ = ТДВО.Добавить();
						
						ДопЗаписьОстаковТМЦ.ВидДвижения		= ВидДвиженияНакопления.Приход;
						ДопЗаписьОстаковТМЦ.Активность		= Истина;
						ДопЗаписьОстаковТМЦ.КодОперации 	= Перечисления.КодыОперацийОстатки.Перемещение;
						ДопЗаписьОстаковТМЦ.Период 			= ПериодОперации;
						ДопЗаписьОстаковТМЦ.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
						ДопЗаписьОстаковТМЦ.Склад 			= ПунктДоставкиРезультат[0].Подразделение.ОсновнойСклад;
						ДопЗаписьОстаковТМЦ.Количество      = ТекСтрокаТовары.Количество;
						ДопЗаписьОстаковТМЦ.Отправитель		= ТекДок.Склад;
						ДопЗаписьОстаковТМЦ.Сумма			= 0;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;	
		КонецЕсли;
		//Валетов -
		
		
	ИначеЕсли ТекВид="ОтчетКассовойСмены" Тогда				
		КодОперации		=ТекДок.КодОперации;
		ТекПодразделение=ТекДок.Подразделение;
		
		ТД.Колонки.Контрагент.Имя="Получатель";
		//крохин начало 25.08.2021
		Для Каждого СтрокаТД Из ТД Цикл
			Если СтрокаТД.Подразделение.Пустая() Тогда
				СтрокаТД.Подразделение = ТекПодразделение;	
			КонецЕсли;
		КонецЦикла;
		//крохин конец 25.08.2021
		
		
		ТО=ПолучитьОстаткиТМЦ(ТекДок,Загрузка);
		Если КодОперации=Перечисления.КодыОперацийОстатки.Реализация Тогда					
			РассчитатьОбороты(ТД,ТекДок.Валюта,ТекДок.Курс,Рубли,КурсРубля,ВалютаУпр,КурсУпр);
			Результат=ПогаситьПартии(ТекДок,КодОперации,ТД,ТО,ТДВО,Неопределено,,ТОшибок);
			
			Для Каждого СтрокаТЧ Из ТекДок.ПодарочныеСертификаты Цикл	
				//крохин начало 05.05.2011
				//с 1 апреля 2011 г. оборотов при оплате сертификатами нет
				Если ДатаДокумента >= '20110401' Тогда
					Прервать;
				КонецЕсли;
				//крохин конец 05.05.2011
				
				//крохин начало 25.04.2011
				//Добавим ЕЕ из чека 2011
				//Если СтрокаТЧ.ВидСертификата=Справочники.ВидыПодарочныхСертификатов.ЕЕ ИЛИ СтрокаТЧ.ВидСертификата=Справочники.ВидыПодарочныхСертификатов.ЕЕИзЧека2011 Тогда // ИЛИ СтрокаТЧ.ВидСертификата=Справочники.ВидыПодарочныхСертификатов.ЕЕИзЧека2
				Если СтрокаТЧ.ВидСертификата=Справочники.ВидыПодарочныхСертификатов.ЕЕ ИЛИ СтрокаТЧ.ВидСертификата=Справочники.ВидыПодарочныхСертификатов.ЕЕИзЧека2011 ИЛИ СтрокаТЧ.ВидСертификата=Справочники.ВидыПодарочныхСертификатов.ЕЕИзЧека Тогда				
					//крохин конец 25.04.2011
					
					СтрокаТД=ТДВО.Добавить();		
					
					СтрокаТД.Активность				= Истина;
					
					СтрокаТД.Период					= ТекДок.Дата;
					СтрокаТД.ВидДвижения			= ВидДвиженияНакопления.Приход;
					
					СтрокаТД.Склад                  = ТекДок.Склад;
					СтрокаТД.Номенклатура			= СтрокаТЧ.Сертификат.Владелец;				
					//крохин начало 28.04.2011
					//косяк с пустой номенклатурой,если ОКС грузится раньше сертификата пишем сертификат ЕЕЭ, чтобы снялся олап
					Если СтрокаТД.Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
						СтрокаТД.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("SNL-143459");	
					КонецЕсли;
					//крохин конец 28.04.2011
					
					СтрокаТД.Количество				= 1;
					
					Если НЕ СтрокаТЧ.Сертификат.Подарок Тогда
						СтрокаТД.Сумма					= СтрокаТЧ.Номинал;
						
						СтрокаТД.Оборот					=-СтрокаТЧ.СуммаОплатыСертификатами;					
						СтрокаТД.ОборотБезСкидки		=-СтрокаТЧ.СуммаОплатыСертификатами;	
						
					КонецЕсли;					
					
					СтрокаТД.КодОперации			= Перечисления.КодыОперацийОстатки.ПогашениеСертификата;
					
					//крохин начало
					Если  СтрокаТЧ.Сертификат.Подарок И ТекДок.Дата>='20100101' Тогда
						СтрокаТД.Сумма					= СтрокаТЧ.Номинал;
						
						СтрокаТД.Оборот					=-СтрокаТЧ.СуммаОплатыСертификатами;					
						СтрокаТД.ОборотБезСкидки		=-СтрокаТЧ.СуммаОплатыСертификатами;
						СуммаЧека = 0;
						СебестоимостьЧека = 0;
						Для Каждого СтрокаТС Из ТекДок.Товары Цикл
							Если СтрокаТС.НомерЧека = СтрокаТЧ.НомерЧека Тогда	
								СуммаЧека = СуммаЧека + СтрокаТС.Всего;	
								СтрокаСебестоимости=ТД.Найти(СтрокаТС.Номенклатура,"Номенклатура");
								Если СтрокаТС <> Неопределено Тогда
									СебестоимостьЧека = СебестоимостьЧека +  СтрокаСебестоимости.СписанаСтоимость/СтрокаСебестоимости.Количество;
								Конецесли;
							КонецЕсли;	
						КонецЦикла;	
						Если СуммаЧека > 0 Тогда
							Процент = Мин(СтрокаТЧ.Номинал/СуммаЧека,1);
						Иначе
							Процент = 0;
						КонецЕсли;
						СуммаСписания =  Окр(СебестоимостьЧека*Процент,2);
						СтрокаТД.Сумма = СуммаСписания;	
						//       СтрокаТД.Сумма = 0;
					КонецЕсли;
					//крохин конец
					
					СтрокаТД.Отправитель			= СтрокаТЧ.Контрагент;
					СтрокаТД.Подразделение			= ТекДок.Склад.Подразделение;
					
					
					СтрокаТД=ТДВО.Добавить();		
					
					СтрокаТД.Активность				= Истина;
					
					СтрокаТД.Период					= ТекДок.Дата;
					СтрокаТД.ВидДвижения			= ВидДвиженияНакопления.Расход;
					
					СтрокаТД.Склад                  = ТекДок.Склад;
					СтрокаТД.Номенклатура			= СтрокаТЧ.Сертификат.Владелец;
					//крохин начало 28.04.2011
					//косяк с пустой номенклатурой, если ОКС грузится раньше сертификата, пишем сертификат ЕЕЭ, чтобы снялся олап
					Если СтрокаТД.Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
						СтрокаТД.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("SNL-143459");	
					КонецЕсли;
					//крохин конец 28.04.2011
					
					
					СтрокаТД.Количество				= 1;
					
					СтрокаТД.КодОперации			= Перечисления.КодыОперацийОстатки.ПогашениеСертификата;
					
					Если НЕ СтрокаТЧ.Сертификат.Подарок Тогда
						СтрокаТД.Сумма					= СтрокаТЧ.Номинал;
						
						СтрокаТД.Оборот					= 0;					
						СтрокаТД.ОборотБезСкидки		= 0;
						//крохин начало
					ИначеЕсли ТекДок.Дата>='20100101' Тогда
						
						СтрокаТД.Сумма					= СтрокаТЧ.Номинал;
						
						СтрокаТД.Оборот					=0;				
						СтрокаТД.ОборотБезСкидки		=0;	
						СтрокаТД.КодОперации			= Перечисления.КодыОперацийОстатки.Списание;
						
						СтрокаТД.Сумма = СуммаСписания;
						//СтрокаТД.Сумма = 0;
						//крохин конец
					КонецЕсли;					
					
					
					СтрокаТД.Отправитель			= СтрокаТЧ.Контрагент;		
					СтрокаТД.Подразделение			= ТекДок.Склад.Подразделение;
				КонецЕсли;				
			КонецЦикла; 
		Иначе
			РассчитатьОбороты(ТД,ТекДок.Валюта,ТекДок.Курс,Рубли,КурсРубля,ВалютаУпр,КурсУпр,-1);
			КэшЦенПоСебестоимости=Новый Соответствие;
			Если (ТекПодразделение.ВидПодразделения<>Перечисления.ВидыПодразделений.Франчайзинг И ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение) ИЛИ
				(ТекПодразделение.ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг И ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение) Тогда
				ТД.ЗаполнитьЗначения(0,"Всего");
				
				//по сертификатам оборот 0
				Если ТекДок.Дата >= '20220801' Тогда
					Для Каждого СтрокаТД Из ТД Цикл	
						Если СтрокаТД.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.ПодарочныйСертификат Тогда
							СтрокаТД.Оборот = 0;
							СтрокаТД.ОборотБезСкидки = 0;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				//крохин конец 25.08.2022
			Иначе				
				Для Каждого СтрокаТД Из ТД Цикл			
					Номенклатура=СтрокаТД.Номенклатура;
					
					Цена=КэшЦенПоСебестоимости.Получить(Номенклатура);
					
					Если Цена=Неопределено Тогда
						Цена=0;
						
						СтрокаТО=ТО.Найти(Номенклатура,"Номенклатура");				
						Если СтрокаТО<>Неопределено Тогда
							Цена=?(СтрокаТО.Остаток=0,0,СтрокаТО.Стоимость/СтрокаТО.Остаток);					
						КонецЕсли;				
						Если Цена=0 Тогда
							Цена=ПолучитьЦенуПоследнегоПрихода(Номенклатура,ТекДок.Склад,ТекДок.Дата);
						КонецЕсли;
						Если Цена=0 Тогда
							ЦПП=ПолучитьПериодическийРеквизит(СтрокаТД.Номенклатура,"ЦенаПоследнегоПрихода",ТекДок.Дата);
							Цена=?(ЦПП=Неопределено,0,ЦПП);			
						КонецЕсли;
						//крохин начало
						Если Документ.Дата > '20091201' И СтрокаТД.ВидНоменклатуры <> Перечисления.ВидыНоменклаутры.Товар Тогда //Чирков
							Цена = 0;	
						КонецЕсли;
						
						КэшЦенПоСебестоимости.Вставить(Номенклатура,Цена);
					КонецЕсли;				
					
					СтрокаТД.Всего=СтрокаТД.Количество*Цена;	
					//крохин начало 15.09.2024
					//по сертификатам оборот 0
					Если ТекДок.Дата >= '20240801' Тогда
						Если СтрокаТД.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.ПодарочныйСертификат Тогда
							СтрокаТД.Оборот = 0;
							СтрокаТД.ОборотБезСкидки = 0;
						КонецЕсли;
					КонецЕсли;
					//крохин конец 15.09.2024
					
				КонецЦикла;				
			КонецЕсли;
			
			ОприходоватьПартию(ТекДок,КодОперации,ТД,ТДВО);
			
			//крохин начало 25.08.2022
			//возвраты сертификатов формируют доп. проводку, на списание сертификата
			Если ТекДок.Дата >= '20220801' Тогда
				ТДСертификатов = ТД.скопировать();
				ТДСертификатов.очистить();
				Для Каждого СтрокаТД Из ТД Цикл
					Если СтрокаТД.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.ПодарочныйСертификат Тогда
						ЕщёОднаСтрокаТД = ТДСертификатов.Добавить();
						ЗаполнитьЗначенияСвойств(ЕщёОднаСтрокаТД,СтрокаТД);
						ЕщёОднаСтрокаТД.Сумма = 0;
						ЕщёОднаСтрокаТД.КодОперации = Перечисления.КодыОперацийОстатки.Списание;
					КонецЕсли;
				КонецЦикла;
				Если ТДСертификатов.количество() > 0 Тогда
					ТО  = ПолучитьОстаткиТМЦ(ТекДок,Загрузка);
					ТекРезультатСертификатов = ПогаситьПартии(ТекДок, , ТДСертификатов, ТО, ТДВО, ТекДок.Склад,, ТОшибок, Истина);	
					//				ТекРезультат = Мин(ТекРезультат,ТекРезультатСертификатов);
				КонецЕсли;
			КонецЕсли;
			//крохин конец 25.08.2022
			
		КонецЕсли;		
	ИначеЕсли ТекВид="Перемещение" Тогда
		//крохин начало
		//по услугам ИМ движений не делаем
		СписокУдаляемыхСтрок = Новый СписокЗначений;
		Для Каждого СтрокаТД Из ТД Цикл
			Если ПолучитьРеквизитРодителя(СтрокаТД.Номенклатура,"ВидНоменклатуры") =  Перечисления.ВидыНоменклаутры.Услуга Тогда
				СписокУдаляемыхСтрок.Добавить(СтрокаТД);
			КонецЕсли;
			//крохин начало
			//по упаковке тоже не делаем движений
			Если ПолучитьРеквизитРодителя(СтрокаТД.Номенклатура,"ВидНоменклатуры") =  Перечисления.ВидыНоменклаутры.Упаковка Тогда
				СписокУдаляемыхСтрок.Добавить(СтрокаТД);
			КонецЕсли;
			//крохин конец
		КонецЦикла;
		Для Каждого СтрокаСписка Из СписокУдаляемыхСтрок Цикл
			Тд.Удалить(СтрокаСписка.Значение);	
		КонецЦикла;		
		//крохин конец
		КодОперации=Перечисления.КодыОперацийОстатки.Перемещение;
		
		Если ТекДок.Дата<'20080201' ИЛИ ПараметрыСеанса.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			ТекСкладПолучатель	=?(ТекДок.СкладПолучатель.ФизическийСклад.Пустая(),ТекДок.СкладПолучатель,ТекДок.СкладПолучатель.ФизическийСклад);
		Иначе
			ТекСкладПолучатель	=ТекДок.СкладПолучатель;					
		КонецЕсли;		
		
		//Кухарь 10.12.15 начало
		//Для складов проводки делаем по виртуальному для складов, в ЦО не делаем
		если ТекДок.складполучатель.ВидСклада=Перечисления.ВидСклада.ВиртуальныйДляСклада тогда
			если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.Склад тогда
				ТекСкладПолучатель=ТекДок.СкладПолучатель;
			иначе
				ТекСкладПолучатель=ТекДок.СкладПолучатель.физическийсклад;
			КонецЕсли;
		КонецЕсли;		
		
		//Кухарь 10.12.15 конец
		
		Если ТекДок.Отгружен=Перечисления.Отгружен.Резерв Тогда
			Если (ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение) ИЛИ (ТекСклад.КодФизическогоУзла=ЭтотУзел.Код) Тогда
				Если ТекДок.Склад.Код = "SSX-66" Тогда
				Иначе
					если ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.Склад и ТекСклад.ВидСклада=Перечисления.ВидСклада.ВиртуальныйДляСклада тогда
						ТО=ПолучитьОстаткиТМЦ(ТекДок,Загрузка,ТекСклад);				
					иначе
						ТО=ПолучитьОстаткиТМЦ(ТекДок,Загрузка);
					КонецЕсли;			
					//Кухарь 14.12.15 конец
					
					Результат=ПогаситьРезервы(ТекДок,ТД,ТО,ТДВР,ТекДок.СкладПолучатель,ТОшибок);
				КонецЕсли;
				//крохин конец 30.01.2014
			КонецЕсли;			
		Иначе
			ИсходнаяТД	=ТД.Скопировать();		
			Если (ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение) ИЛИ (ТекСклад.КодФизическогоУзла=ЭтотУзел.Код) Тогда	
				если ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.Склад и ТекСклад.ВидСклада=Перечисления.ВидСклада.ВиртуальныйДляСклада тогда
					ТО=ПолучитьОстаткиТМЦ(ТекДок,Загрузка,ТекСклад);				
				иначе
					ТО=ПолучитьОстаткиТМЦ(ТекДок,Загрузка);
				КонецЕсли;			
				Если ТекДок.Склад.Код = "SSX-66" Тогда
				Иначе
					Результат	=ПогаситьПартии(ТекДок,КодОперации,ТД,ТО,ТДВО,ТекСкладПолучатель,ТекДок.ПунктДоставки,ТОшибок,Истина,,"ПодтвержденнаяЗаявка");			
				КонецЕсли;
			КонецЕсли;	
			
			Если ПараметрыСеанса.ЭтотУзел.Подразделение.ВидПодразделения = Перечисления.ВидыПодразделений.Франчайзинг Тогда
				Для Каждого СтрокаТД Из ТД Цикл
					если ТекущаяДата()>'20181201' тогда
						СтрокаТД.СписанаСтоимость	=СтрокаТД.себестоимость;	
					иначе
						СтрокаТД.СписанаСтоимость	=?(СтрокаТД.себестоимость=0,СтрокаТД.Всего,СтрокаТД.себестоимость);	
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Для Каждого СтрокаТД Из ТД Цикл
				СтавкаНДС		=ПроцентНДСпоСтавке(СтрокаТД.СтавкаНДС);
				
				СтрокаТД.Всего	=СтрокаТД.СписанаСтоимость;
				СтрокаТД.Сумма	=СтрокаТД.СписанаСтоимость/(1+СтавкаНДС);				
			КонецЦикла;
			
			Если Документ.Отгружен=Перечисления.Отгружен.ОтгруженТранзит Тогда
				Если ЗначениеЗаполнено(ТекДок.СкладТранзит) Тогда
					ТД.ЗаполнитьЗначения(ТекДок.СкладТранзит,"Склад");
				Иначе
					ТД.ЗаполнитьЗначения(ТекДок.Склад.СкладОтгрузкиТранзитом,"Склад");
				КонецЕсли;
				//крохин конец 14.04.2017
				Результат=Мин(Результат,ОприходоватьПартию(ТекДок,КодОперации,ТД,ТДВО,ТекДок.Склад,,Документ.Дата));			
			ИначеЕсли (ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение) ИЛИ (ТекСкладПолучатель.КодФизическогоУзла=ЭтотУзел.Код) Тогда				
				Если Документ.Дата>='20070801' Тогда					
					Если Документ.СостояниеНакладнойУПолучателя=Перечисления.СостоянияНакладной.Принята Тогда
						
						ТекДатаПриемки=?(НачалоДня(Документ.ДатаПриемки)<Документ.Дата,Документ.Дата,Документ.ДатаПриемки);
						
						Если НачалоДня(ТекДатаПриемки)=НачалоДня(Документ.Дата) И Документ.НеСоответствуетЗаявке=Ложь Тогда
							Если Документ.Дата>='20140301' И  Документ.СкладПолучатель.Код = "SSX-66" Тогда
							Иначе
								ТД.ЗаполнитьЗначения(ТекСкладПолучатель,"Склад");
								//удаляем упаковку
								СписокУдаляемыхСтрок = Новый СписокЗначений;
								Для Каждого СтрокаТД Из ТД Цикл
									Если СтрокаТД.КодОперации = Перечисления.КодыОперацийОстатки.Списание  Тогда
										//СтрокаТД.КодОперации = Перечисления.КодыОперацийОстатки.ПустаяСсылка();
										СписокУдаляемыхСтрок.Добавить(СтрокаТД);
									КонецЕсли;
								КонецЦикла;	
								Для Каждого СтрокаСписка Из СписокУдаляемыхСтрок Цикл
									Тд.Удалить(СтрокаСписка.Значение);	
								КонецЦикла;
								//крохин конец 11.11.2015
								Результат=Мин(Результат,ОприходоватьПартию(ТекДок,КодОперации,ТД,ТДВО,ТекДок.Склад));						
							КонецЕсли;
							//крохин конец 03.04.2014
						Иначе													
							//транзит (имеет смысл только в ЦО)
							Если ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
								//принимаем на транзит
								ТД.ЗаполнитьЗначения(ТекСкладПолучатель.СкладПути,"Склад");
								//крохин начало 11.11.2015
								//удаляем упаковку	
								СписокУдаляемыхСтрок = Новый СписокЗначений;
								Для Каждого СтрокаТД Из ТД Цикл
									Если СтрокаТД.КодОперации = Перечисления.КодыОперацийОстатки.Списание  Тогда
										//СтрокаТД.КодОперации = Перечисления.КодыОперацийОстатки.ПустаяСсылка();
										СписокУдаляемыхСтрок.Добавить(СтрокаТД);
									КонецЕсли;
								КонецЦикла;	
								Для Каждого СтрокаСписка Из СписокУдаляемыхСтрок Цикл
									Тд.Удалить(СтрокаСписка.Значение);	
								КонецЦикла;
								//крохин конец 11.11.2015
								Результат=Мин(Результат,ОприходоватьПартию(ТекДок,КодОперации,ТД,ТДВО,ТекДок.Склад,,,"ПодтвержденнаяЗаявка"));
								
								//списываем с транзита датой приемки
								Для Каждого СтрокаТД Из ТД Цикл							
									СтавкаНДС		=ПроцентНДСпоСтавке(СтрокаТД.СтавкаНДС);
									
									Если СтрокаТД.СписанаСтоимость=0 ИЛИ СтрокаТД.ПодтвержденнаяЗаявка=0 Тогда
										СтрокаТД.СписанаСтоимость=СтрокаТД.ЦенаСписания*СтрокаТД.Количество;
									Иначе								
										СтрокаТД.СписанаСтоимость=СтрокаТД.Количество*СтрокаТД.СписанаСтоимость/СтрокаТД.ПодтвержденнаяЗаявка;
									КонецЕсли;					
									
									СтрокаТД.Всего	=СтрокаТД.СписанаСтоимость;
									СтрокаТД.Сумма	=СтрокаТД.СписанаСтоимость/(1+СтавкаНДС);
								КонецЦикла;
								
								ДатаЧ='20090101';
								Если ТекДок.Дата<Датач И ТекДатаПриемки>=ДатаЧ Тогда
									Курс=ПолучитьКурсВалюты_ПоРусски(ПараметрыСеанса.ВалютаУпр,НачалоДня(ДатаЧ)-1);									
									Для Каждого СтрокаТД Из ТД Цикл
										СтавкаНДС		=ПроцентНДСпоСтавке(СтрокаТД.СтавкаНДС);
										
										СтрокаТД.Всего			=СтрокаТД.Всего/Курс;
										СтрокаТД.ВсегоБезСкидки	=СтрокаТД.ВсегоБезСкидки/Курс;
										СтрокаТД.Сумма				=СтрокаТД.Сумма/Курс;
										СтрокаТД.СписанаСтоимость   =СтрокаТД.СписанаСтоимость/Курс;
									КонецЦикла;									
								КонецЕсли;
								Результат=Мин(Результат,ПогаситьПартии(ТекДок,КодОперации,ТД,Неопределено,ТДВО,ТекСкладПолучатель,ТекДок.ПунктДоставки,ТОшибок,Ложь,ТекДатаПриемки));
							КонецЕсли;
							
							//ставим на склад получатель по дате приемки
							//крохин начало 03.04.2014
							//по РС франчайзинг не нужны проводки приемки
							//ТД.ЗаполнитьЗначения(ТекСкладПолучатель,"Склад");
							//Результат=Мин(Результат,ОприходоватьПартию(ТекДок,КодОперации,ТД,ТДВО,ТекДок.Склад,,ТекДатаПриемки));
							Если Документ.Дата>='20140301' И  Документ.СкладПолучатель.Код = "SSX-66" Тогда
							Иначе
								ТД.ЗаполнитьЗначения(ТекСкладПолучатель,"Склад");
								//крохин начало 06.12.2015
								//удаляем упаковку	
								СписокУдаляемыхСтрок = Новый СписокЗначений;
								Для Каждого СтрокаТД Из ТД Цикл
									Если СтрокаТД.КодОперации = Перечисления.КодыОперацийОстатки.Списание  Тогда
										//СтрокаТД.КодОперации = Перечисления.КодыОперацийОстатки.ПустаяСсылка();
										СписокУдаляемыхСтрок.Добавить(СтрокаТД);
									КонецЕсли;
								КонецЦикла;	
								Для Каждого СтрокаСписка Из СписокУдаляемыхСтрок Цикл
									Тд.Удалить(СтрокаСписка.Значение);	
								КонецЦикла;
								//крохин конец 06.12.2015
								
								Результат=Мин(Результат,ОприходоватьПартию(ТекДок,КодОперации,ТД,ТДВО,ТекДок.Склад,,ТекДатаПриемки));						
							КонецЕсли;
							//крохин конец 03.04.2014
							
						КонецЕсли;					
					Иначе
						//ставим на транзит
						ТД.ЗаполнитьЗначения(ТекСкладПолучатель.СкладПути,"Склад");
						//крохин начало 11.11.2015
						//удаляем упаковку	
						СписокУдаляемыхСтрок = Новый СписокЗначений;
						Для Каждого СтрокаТД Из ТД Цикл
							Если СтрокаТД.КодОперации = Перечисления.КодыОперацийОстатки.Списание  Тогда
								//СтрокаТД.КодОперации = Перечисления.КодыОперацийОстатки.ПустаяСсылка();
								СписокУдаляемыхСтрок.Добавить(СтрокаТД);
							КонецЕсли;
						КонецЦикла;	
						Для Каждого СтрокаСписка Из СписокУдаляемыхСтрок Цикл
							Тд.Удалить(СтрокаСписка.Значение);	
						КонецЦикла;
						//крохин конец 11.11.2015
						Результат=Мин(Результат,ОприходоватьПартию(ТекДок,КодОперации,ТД,ТДВО,ТекДок.Склад,,,"ПодтвержденнаяЗаявка"));					
					КонецЕсли;
				Иначе
					ТД.ЗаполнитьЗначения(ТекСкладПолучатель,"Склад");
					Результат=Мин(Результат,ОприходоватьПартию(ТекДок,КодОперации,ТД,ТДВО,ТекДок.Склад));				
				КонецЕсли;			
			КонецЕсли; 
		КонецЕсли;
	ИначеЕсли ТекВид="РекламационнаяНакладная" Тогда
		
		
		
		ВидОснования=ТекДок.ДокОснование.Метаданные().Имя;		
		
		Если ВидОснования="ПриходнаяНакладная" ИЛИ ВидОснования="Перемещение" Тогда
			// ПНК и ПРК с точки зрения рекламаций - приходные документы соответственно недостачи по ним списываются
			ВидДвижения=ВидДвиженияНакопления.Расход;
			
			Если ТекДок.ДокОснование.КодОперации=Перечисления.КодыОперацийОстатки.ЗакупкаР Тогда
				ТД.Очистить();			
			КонецЕсли; 
		ИначеЕсли ВидОснования="РасходнаяНакладная" Тогда
			//приходуем на склад
			ВидДвижения=ВидДвиженияНакопления.Приход;
			//крохин начало 08.12.2011
			//вычерки
			Если ТекДок.ВидРекламации = Перечисления.ВидыРекламаций.Вычерк Тогда
				ТО = ПолучитьОстаткиТМЦ(ТекДок,Загрузка);
				КодОперации = Перечисления.КодыОперацийОстатки.Рекламация;
				Результат	=ПогаситьПартии(ТекДок,КодОперации,ТД,ТО,ТДВО,ТекСкладПолучатель,ТекДок.ДокОснование.ПунктДоставки,ТОшибок,Истина,,"Количество");
				ТДВО.очистить();
			КонецЕсли;
			//крохин конец 08.12.2011
			
		Иначе
			ВидДвижения=ВидДвиженияНакопления.Приход;
		КонецЕсли;	
		
		Для Каждого СтрокаТД Из ТД Цикл
			Если СтрокаТД.Количество=0 Тогда Продолжить КонецЕсли; 
			
			Движение=ТДВО.Добавить();	
			
			Движение.Активность		= Истина;
			Движение.Период			= ТекДок.Дата;		
			
			Движение.Склад			= ТекСклад;
			Движение.Номенклатура	= СтрокаТД.Номенклатура;
			
			Движение.Количество		= СтрокаТД.Количество;
			Движение.Сумма			= СтрокаТД.Всего;
			
			
			
			
			Движение.КодОперации	= Перечисления.КодыОперацийОстатки.Рекламация;			
			Движение.Отправитель	= ТекДок.Корреспондент;
			
			Движение.ВидДвижения	= ВидДвижения;
			
			//крохин начало 08.12.2011
			//вычерки
			Если ТекДок.ВидРекламации = Перечисления.ВидыРекламаций.Вычерк Тогда
				Движение.Сумма			= СтрокаТД.СписанаСтоимость;
				Движение.ВалютаДокумента=  ТекДок.ДокОснование.Валюта;
				Движение.оборот         = -СтрокаТД.Всего;
				Движение.оборотБезСкидки= -СтрокаТД.Всего;
				Движение.оборотУпр      = -СтрокаТД.Всего;
				Движение.оборотБезСкидкиУпр= -СтрокаТД.Всего;
				//++Данилова Е.В. 03.10.2025 HELP-7050
				Если ТекДок.дата >= Дата(2025,09,01) Тогда 
					//Движение.Подразделение  = ТекДок.ДокОснование.Подразделение;
					Движение.Подразделение  = ?(ЗначениеЗаполнено(ТекДок.Подразделение),ТекДок.Подразделение,ТекДок.ДокОснование.Подразделение);
				Иначе
					Движение.Подразделение  = ТекДок.ДокОснование.Подразделение; 
				КонецЕсли;  
				//--Данилова Е.В. 03.10.2025
				Движение.ПунктДоставки  = ТекДок.ДокОснование.ПунктДоставки;
				Движение.КодОперации	= Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя;
				Если  ТекДок.Дата >='20191001' Тогда
					Движение.КодОперации	=Перечисления.КодыОперацийОстатки.Реализация;
				Иначе
					Движение.КодОперации	=Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя;
				КонецЕсли;
				Если Движение.Количество < 0 Тогда
					Движение.Количество = - Движение.Количество;
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.КодОперации	= Перечисления.КодыОперацийОстатки.Реализация;
					Движение.Сумма			= -СтрокаТД.СписанаСтоимость;
				КонецЕсли;
			КонецЕсли;
			Движение.акция = СтрокаТД.Акция;
		КонецЦикла;
		
		Если ПараметрыСеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			Если ТекДок.ВидРекламации = Перечисления.ВидыРекламаций.Вычерк Тогда
				Если ТекДок.ДокОснование.Метаданные().Имя = "РасходнаяНакладная" Тогда
					Если ТекДок.ДокОснование.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия Тогда						
						//крохин начало 15.07.2020
						//обороты в комиссионных РНК и РКМ нулевые
						Для Каждого СтрокаТЧ Из ТДВО Цикл						
							СтрокаТЧ.Оборот = 0;
							СтрокаТЧ.ОборотБезСкидки = 0;
							СтрокаТЧ.ОборотУпр = 0;
							СтрокаТЧ.ОборотБезСкидкиУпр = 0;
						КонецЦикла;
						//крохин конец 15.07.2020	
						ТП = ТДВО.Скопировать();
						СкладКомиссия = ТекДок.СкладКомиссия;
						Для Каждого СтрокаТЧ Из ТП Цикл
							НоваяСтрокаТДВО = ТДВО.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрокаТДВО,СтрокаТЧ);
							НоваяСтрокаТДВО.Склад = СкладКомиссия;
							Если  СтрокаТЧ.ВидДвижения =  ВидДвиженияНакопления.Расход Тогда
								НоваяСтрокаТДВО.ВидДвижения = ВидДвиженияНакопления.Приход;
							Иначе
								НоваяСтрокаТДВО.ВидДвижения = ВидДвиженияНакопления.Расход;
							КонецЕсли;
						КонецЦикла;
						ТДВО.ЗаполнитьЗначения(Перечисления.КодыОперацийОстатки.Комиссия,"КодОперации");
					КонецЕсли;				 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		Если ТипЗнч(ТекДок.ДокОснование) = Тип("ДокументСсылка.РасходнаяНакладная")
			И (ТекДок.ВидРекламации = Перечисления.ВидыРекламаций.Вычерк ИЛИ ТекДок.ВидРекламации = Перечисления.ВидыРекламаций.Возврат)
			И ТекДок.Дата >=  '20240401' 
			и ПараметрыСеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение
			Тогда 
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РеквизитыСправочников.ЗначениеРеквизита КАК Подразделение
			|ИЗ
			|	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
			|ГДЕ
			|	РеквизитыСправочников.ИмяРеквизита = ""ПодразделениеФранчайзинга""
			|	И РеквизитыСправочников.Справочник.Ссылка = &ПунктДоставки";
			Запрос.УстановитьПараметр("ПунктДоставки",ТекДок.ПунктДоставки);
			ПунктДоставкиРезультат = Запрос.Выполнить().Выгрузить();
			Если ПунктДоставкиРезультат.Количество() > 0 Тогда  
				Для Каждого ТекСтрокаТовары Из ТекДок.Товары Цикл 
					
					Если ТекСтрокаТовары.Количество < 0 Тогда
						ВидДвиженияДопЗапись = ВидДвиженияНакопления.Приход;
					ИначеЕсли ТекСтрокаТовары.Количество > 0 Тогда 
						ВидДвиженияДопЗапись = ВидДвиженияНакопления.Расход;
					Иначе
						Продолжить;
					КонецЕсли;
					
					ДопЗаписьОстаковТМЦ = ТДВО.Добавить();
					ДопЗаписьОстаковТМЦ.ВидДвижения		= ВидДвиженияДопЗапись;
					ДопЗаписьОстаковТМЦ.Активность		= Истина;
					ДопЗаписьОстаковТМЦ.КодОперации 	= Перечисления.КодыОперацийОстатки.Перемещение;
					ДопЗаписьОстаковТМЦ.Период 			= ТекДок.Дата;
					ДопЗаписьОстаковТМЦ.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
					ДопЗаписьОстаковТМЦ.Склад 			= ПунктДоставкиРезультат[0].Подразделение.ОсновнойСклад;
					ДопЗаписьОстаковТМЦ.Количество      = ?(ТекСтрокаТовары.Количество > 0,ТекСтрокаТовары.Количество,ТекСтрокаТовары.Количество * -1);
					ДопЗаписьОстаковТМЦ.Отправитель		= ТекДок.Склад;
					ДопЗаписьОстаковТМЦ.Сумма			= 0;
					
				КонецЦикла;
			КонецЕсли;	
		КонецЕсли;
		//Валетов -
		
		
		Результат=1;
		
		//**************************************************************************************************************************************		
		//Нечаева 15,02,14 +++	
	ИначеЕсли ТекВид="КорректировкаЦенВНакладной" Тогда
		
		ТДНакл=ПолучитьТЧДокумента(Документ.ДокОснование.Ссылка,"РасходнаяНакладная","Товары");	
		
		ВидОснования=ТекДок.ДокОснование.Метаданные().Имя;		
		// делается 2 проводки, на списание по даннным РНК и приход по даным РКМ (или наоборот).
		Если ВидОснования="ПриходнаяНакладная" ИЛИ ВидОснования="Перемещение" Тогда
			// ПНК и ПРК с точки зрения рекламаций - приходные документы соответственно недостачи по ним списываются
			ВидДвижения=ВидДвиженияНакопления.Расход;
			
			Если ТекДок.ДокОснование.КодОперации=Перечисления.КодыОперацийОстатки.ЗакупкаР Тогда
				ТД.Очистить();			
			КонецЕсли; 
		ИначеЕсли ВидОснования="РасходнаяНакладная" Тогда
			//приходуем на склад
			ВидДвижения=ВидДвиженияНакопления.Приход;
		Иначе
			ВидДвижения=ВидДвиженияНакопления.Приход;
		КонецЕсли;		
		
		Для Каждого СтрокаТД Из ТД Цикл
			Если СтрокаТД.Количество=0 или СтрокаТД.Количество=0 Тогда Продолжить КонецЕсли; 
				ТО = ПолучитьОстаткиТМЦ(ТекДок,Загрузка);
				ТДВО.очистить();
				
				Для Каждого СтрокаТД Из ТекДок.Товары Цикл
					
					Движение=ТДВО.Добавить();	
					
					Движение.Активность		= Истина;
					Движение.Период			= ТекДок.Дата;		
					
					Движение.Склад			= ТекСклад;
					Движение.Номенклатура	= СтрокаТД.Номенклатура;
					
					Движение.Количество		= 0;
					Движение.Оборот			= -СтрокаТД.Всего;	
					Движение.Сумма          = 0;
					
					Движение.Отправитель	= ТекДок.Корреспондент;
					Движение.ВалютаДокумента=  ТекДок.ДокОснование.Валюта;
					Движение.оборотБезСкидки= Движение.оборот;
					Движение.оборотУпр      = Движение.оборот;
					Движение.оборотБезСкидкиУпр= Движение.оборот;
					//++Данилова Е.В. 03.10.2025 HELP-7050
					Если ТекДок.дата >= Дата(2025,09,01) Тогда 
						//	Движение.Подразделение  = ТекДок.ДокОснование.Подразделение;
						Движение.Подразделение  = ?(ЗначениеЗаполнено(ТекДок.Подразделение),ТекДок.Подразделение,ТекДок.ДокОснование.Подразделение);
					Иначе
						Движение.Подразделение  = ТекДок.ДокОснование.Подразделение; 
					КонецЕсли; 
					//--Данилова Е.В. 03.10.2025
					Движение.ПунктДоставки  = ТекДок.ДокОснование.ПунктДоставки;
					Движение.КодОперации	= Перечисления.КодыОперацийОстатки.Реализация;
				КонецЦикла;
				//какая-то ошибка, проводки формируются много раз
				Если ТекДок.Дата >= '20171101' Тогда
					Прервать;
				КонецЕсли;
		КонецЦикла;
		
		Результат=1;
		//Нечаева 15,02,14 ---
		//**************************************************************************************************************************************	
		
		
	ИначеЕсли ТекВид="СписаниеТМЦ" Тогда
		КодОперации=ТекДок.КодОперации;
		
		ТО=ПолучитьОстаткиТМЦ(ТекДок,Загрузка);

		НадоОбнулятьСебестоимость = Ложь;
		Если ТекДок.Дата >= '20040101' Тогда
			Если  ПараметрыСеанса.ЭтотУзел.Подразделение.ВидПодразделения <> Перечисления.ВидыПодразделений.Франчайзинг И  ТекДок.Склад.Подразделение.ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг Тогда
				НадоОбнулятьСебестоимость = Истина;	
			КонецЕсли;
		Иначе	
			Если ПараметрыСеанса.ЭтотУзел.Подразделение.ВидПодразделения <> Перечисления.ВидыПодразделений.Франчайзинг И (ТекДок.Дата >= '20130301' И ТекДок.Подразделение.ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг) Тогда
				НадоОбнулятьСебестоимость = Истина;
			КонецЕсли;
		КонецЕсли;
		Если НадоОбнулятьСебестоимость Тогда
			ТО.ЗаполнитьЗначения(0,"Стоимость");
		КонецЕсли;
		
		Результат	=ПогаситьПартии(ТекДок,КодОперации,ТД,ТО,ТДВО,ТекДок.СтатьяЗатрат,,ТОшибок,Истина);
		
	ИначеЕсли ТекВид="ЗаказПоставщику" Тогда
		КодОперации=Перечисления.КодыОперацийОстатки.Перемещение;

		ТО			=ПолучитьОстаткиТМЦ(ТекДок,Загрузка,ТекДок.ТранзитныйСклад);

		Результат	=ПогаситьПартии(ТекДок,КодОперации,ТД,ТО,ТДВО,ТекДок.Контрагент,,ТОшибок,Истина);
	ИначеЕсли ТекВид="Комплектация" Тогда
		КодОперации=Перечисления.КодыОперацийОстатки.Комплектация;
		
		Если ТекДок.Отгружен=Перечисления.Отгружен.Резерв Тогда	
			ТО=ПолучитьРезервыТМЦ(ТекДок,Загрузка);
			Результат	=ПогаситьРезервы(ТекДок,ТД,ТО,ТДВР,ТекДок.Склад,ТОшибок);			
		Иначе
			ТО			=ПолучитьОстаткиТМЦ(ТекДок,Загрузка);
			Результат	=ПогаситьПартии(ТекДок,КодОперации,ТД,ТО,ТДВО,ТекДок.Склад,,ТОшибок,Истина);		
			
			ТД.Свернуть("Продукция,Номенклатура","Количество,СписанаСтоимость,Амортизация");
			
			ТПрихода=ТД.Скопировать();		
			ТПрихода.Свернуть("Продукция","Количество,СписанаСтоимость,Амортизация");

			Если ТекДок.Дата >= '20110501' Тогда
				ЗаписиЦПП=РегистрыСведений.История.СоздатьНаборЗаписей();
				ЗаписиЦПП.Отбор.Документ.Использование	=Истина;
				ЗаписиЦПП.Отбор.Документ.Значение		=ТекДок.Ссылка;
				
				ЗаписиЦПП.Отбор.Реквизит.Использование	=Истина;
				ЗаписиЦПП.Отбор.Реквизит.Значение		="ЦенаПоследнегоПрихода";
			КонецЕсли;

			Если ТекДок.ЭтоРаскомплектация И (ТекДок.дата >= '20240201' И ТекДок.дата < '20260701') тогда
				ТПрихода=ТД.Скопировать();
				ТПрихода.Свернуть("Номенклатура","Количество,СписанаСтоимость");
				//Валетов + 02.07.2026 Проблема 0000000166 Приход делаем по ТЧ Продукция 
				Для Каждого СтрокаТЧ Из ТекДок.Товары Цикл   
				//Валетов-
					Если СтрокаТЧ.Номенклатура.Родитель.ВидНоменклатуры <> Перечисления.ВидыНоменклаутры.Товар Тогда Продолжить; КонецЕсли;
					
					Движение = ТДВО.Добавить();
					
					Движение.Активность		= Истина;
					Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;
					Движение.Период 		= ТекДок.Дата;
					Движение.Склад = ТекСклад;   
					//Валетов + 02.07.2026 Проблема 0000000166 Приход делаем по ТЧ Продукция
				    Движение.Номенклатура	= СтрокаТЧ.Номенклатура; 
					Движение.Количество		= СтрокаТЧ.КоличествоКомплектующих;	
					
					ПараметрыОтбора = Новый Структура;
					//Валетов + 02.07.2026 Проблема 0000000166 Приход делаем по ТЧ Продукция
					ПараметрыОтбора.Вставить("Продукция", СтрокаТЧ.Номенклатура);  
					
					МассивСтрокТЧ = ТекДок.Комплектующие.НайтиСтроки(ПараметрыОтбора);
					КоличествоТоваров = 0;
					Для Сч=0 По (МассивСтрокТЧ.Количество() - 1) Цикл
						Если МассивСтрокТЧ[СЧ].Продукция.Родитель.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Товар Тогда
							КоличествоТоваров = КоличествоТоваров + МассивСтрокТЧ[СЧ].КоличествоКомплектующих;
						КонецЕсли;
					КонецЦикла;
					
					СтрокаКМП	= ТПрихода.Найти(СтрокаТЧ.Номенклатура,"Номенклатура");
					
					Если СтрокаКМП<>Неопределено И КоличествоТоваров <> 0 Тогда			
						Движение.Сумма		= СтрокаКМП.СписанаСтоимость*СтрокаТЧ.КоличествоКомплектующих/КоличествоТоваров;
					Иначе
						Движение.Сумма		= 0;				
					КонецЕсли;	
					
					Движение.КодОперации	= КодОперации;
					Движение.Отправитель	= ТекДок.Склад;	
				КонецЦикла;
				//упаковка из ТЧ "товары"
				Для Каждого СтрокаТЧ Из ТекДок.Товары Цикл	
					Если СтрокаТЧ.Номенклатура.Родитель.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Товар Тогда Продолжить; КонецЕсли;
					
					Движение = ТДВО.Добавить();
					
					Движение.Активность		= Истина;
					Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;
					Движение.Период 		= ТекДок.Дата;
					Движение.Склад = ТекСклад;
					Движение.Номенклатура	= СтрокаТЧ.Номенклатура;						
					Движение.Количество		= СтрокаТЧ.Количество;							
					Движение.Сумма		= 0;							
					Движение.КодОперации	= КодОперации;
					Движение.Отправитель	= ТекДок.Склад;	
				КонецЦикла;
				//добавим разницу из-за округления в первую строку
				ТДВОКопия = ТДВО.Скопировать();
				ТДВОКопия.Свернуть("ВидДвижения","Сумма");
				Разница = 0;
				Для Каждого СтрокаТДВОКопия Из ТДВОКопия Цикл
					Если СтрокаТДВОКопия.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
						Разница = Разница + СтрокаТДВОКопия.Сумма;	
					Иначе
						Разница = Разница - СтрокаТДВОКопия.Сумма;
					КонецЕсли;
				КонецЦикла;
				Если Разница <> 0 Тогда
					Для Каждого СтрокаТДВО Из ТДВО Цикл
						Если СтрокаТДВО.ВидДвижения  = ВидДвиженияНакопления.Приход И СтрокаТДВО.Сумма > Разница Тогда
							СтрокаТДВО.Сумма = СтрокаТДВО.Сумма - Разница;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			Иначе
				//крохин конец 04.12.2024	
				Для Каждого СтрокаТЧ Из ТекДок.Товары Цикл			
					Движение = ТДВО.Добавить();
					
					Движение.Активность		= Истина;
					Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;
					Движение.Период 		= ТекДок.Дата;
					Движение.Склад = ТекСклад;
					Движение.Номенклатура	= СтрокаТЧ.Номенклатура;		
					Движение.Количество		= СтрокаТЧ.Количество;
					//крохин конец 20.10.2021
					
					Движение.Количество		= СтрокаТЧ.Количество*СтрокаТЧ.Коэффициент;					
					
					СтрокаКМП	= ТПрихода.Найти(СтрокаТЧ.Номенклатура,"Продукция");
					
					Если СтрокаКМП<>Неопределено Тогда			
						Движение.Сумма		= СтрокаКМП.СписанаСтоимость;
					Иначе
						Движение.Сумма		= 0;				
					КонецЕсли;	
					
					Движение.КодОперации	= КодОперации;
					Движение.Отправитель	= ТекДок.Склад;	
					//установка ЦПП
					Если ТекДок.Дата >= '20110501' Тогда	
						ЗаписьЦПП=ЗаписиЦПП.Добавить();
						ЗаписьЦПП.Период	=ТекДок.Дата;
						ЗаписьЦПП.Реквизит	="ЦенаПоследнегоПрихода";
						ЗаписьЦПП.Объект	=СтрокаТЧ.Номенклатура;
						ЗаписьЦПП.Документ	=ТекДок.Ссылка;
						ЦенаПрихода = ?((СтрокаТЧ.Количество = 0) ИЛИ (СтрокаКМП=Неопределено),0,СтрокаКМП.СписанаСтоимость/СтрокаТЧ.Количество);
						ЗаписьЦПП.Значение	=ЦенаПрихода;   
					КонецЕсли;
					//крохин конец 30.05.2011
				КонецЦикла;	
				//крохин начало 04.12.2024
				//для раскомплектации проводки другие
			КонецЕсли;
			//крохин конец 04.12.2024 
			ЗаписиЦПП.Записать();

			Если ТекДок.РезервироватьПродукцию Тогда
				Для Каждого СтрокаТЧ Из ТекДок.Товары Цикл
					Движение				= ТДВР.Добавить();
					
					Движение.Активность		= Истина;
					Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;
					
					Движение.Период 		= ТекДок.Дата;
					
					Движение.Склад			= ТекДок.Склад;
					Движение.Номенклатура	= СтрокаТЧ.Номенклатура;				
					Движение.Заказ			= ТекДок;
					Движение.Получатель		= ТекДок.Контрагент;
					
					Движение.Количество		= СтрокаТЧ.Количество;
				КонецЦикла;
			КонецЕсли;
			//крохин конец 09.02.2020
		КонецЕсли;		
	ИначеЕсли ТекВид="ОприходованиеТМЦ" Тогда
		КодОперации=ТекДок.КодОперации;
		ТО=ПолучитьОстаткиТМЦ(ТекДок,Загрузка);
		Результат=ДвиженияОприходования(ТекДок,ТД,ТО,Загрузка);

		Если ПараметрыСеанса.ЭтотУзел.Подразделение.ВидПодразделения <> Перечисления.ВидыПодразделений.Франчайзинг И (ТекДок.Дата >= '20130301' И ТекДок.Подразделение.ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг) Тогда			
			ТД.ЗаполнитьЗначения(0,"Сумма");
			ТД.ЗаполнитьЗначения(0,"Цена");
			ТД.ЗаполнитьЗначения(0,"НДС");
			ТД.ЗаполнитьЗначения(0,"Всего");
			ТД.ЗаполнитьЗначения(0,"РасчетнаяЦена");
			ТД.ЗаполнитьЗначения(0,"ЦенаОприходования");
		КонецЕсли;
		//крохин конец 10.04.2013
		
		Если Результат>0 Тогда
			Результат=ОприходоватьПартию(ТекДок,КодОперации,ТД,ТДВО);		
		КонецЕсли;		
	ИначеЕсли ТекВид="ВводОстатковТМЦ" Тогда
		КодОперации	=Перечисления.КодыОпераций.ВводОстатков;				
		Результат	=ОприходоватьПартию(ТекДок,КодОперации,ТД,ТДВО);
	ИначеЕсли ТекВид="Чек" Тогда
		КодОперации	=ТекДок.КодОперации;				
		
		Для Каждого СтрокаТД Из ТД Цикл			
			Движение=ТДВО.Добавить();	
			
			Движение.Активность		= Истина;
			Движение.Период			= ТекДок.Дата;		
			
			Движение.Склад			= ТекДок.Склад;	
			
			Движение.Номенклатура	= СтрокаТД.Номенклатура;			
			Движение.Количество		= СтрокаТД.Количество;		
			
			Движение.Сумма			= 0;		
			
			Движение.Оборот			= ?(КодОперации=Перечисления.КодыОперацийОстатки.Реализация,СтрокаТД.Всего,-СтрокаТД.Всего);		
			Движение.ОборотБезСкидки= ?(КодОперации=Перечисления.КодыОперацийОстатки.Реализация,СтрокаТД.ВсегоБезСкидки,-СтрокаТД.ВсегоБезСкидки);
			
			Движение.КодОперации	= КодОперации;
			
			Движение.Отправитель	= ТекДок.Контрагент;		
			
			Движение.ВидДвижения	= ?(КодОперации=Перечисления.КодыОперацийОстатки.Реализация,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);
		КонецЦикла;
		// нечаева +++	
	ИначеЕсли  ТекВид="ПродажаИМ" Тогда
		
		КодОперации	=ТекДок.КодОперации;				
		
		//ТО			=ПолучитьОстаткиТМЦ(ТекДок,Загрузка);
		//Результат	=ПроверитьОстатки(ТекДок,КодОперации,ТД,ТО,ТДВО,ТекДок.Склад,,ТОшибок,Истина);		// погаситьПартии
		
		ПунктДоставки="Самовывоз";
		
		ТД.ЗаполнитьЗначения(ТекДок.Подразделение,"Подразделение");
		
		НоменклатураКрохина=Справочники.Номенклатура.НайтиПоКоду("SNL-288462"); //Чирков
		
		//по услугам ИМ движений не делаем
		СписокУдаляемыхСтрок = Новый СписокЗначений;
		Для Каждого СтрокаТД Из ТД Цикл
			Если СтрокаТД.ВидНоменклатуры =  Перечисления.ВидыНоменклаутры.Услуга Тогда
				СписокУдаляемыхСтрок.Добавить(СтрокаТД);
			КонецЕсли;
			//крохин начало 26.09.2012
			//по электронным сертификатам тоже не делаем движений
			Если ТекДок.Дата >= '20120901' И СтрокаТД.Номенклатура = НоменклатураКрохина Тогда //Чирков
				СписокУдаляемыхСтрок.Добавить(СтрокаТД);				
			КонецЕсли;
			//крохин конец 26.09.2012
		КонецЦикла;
		
		Для Каждого СтрокаСписка Из СписокУдаляемыхСтрок Цикл
			Тд.Удалить(СтрокаСписка.Значение);	
		КонецЦикла;		
		//крохин конец
		
		Если ТекДок.состояниеНакладной=Перечисления.СостоянияНакладной.Отгружена Тогда
			КодОперации=Перечисления.КодыОперацийОстатки.Перемещение;						
		Иначе			
			КодОперации=?(ТекДок.КодОперации.Пустая(),Перечисления.КодыОперацийОстатки.Реализация,ТекДок.КодОперации);						
		КонецЕсли;
		
		РассчитатьОбороты(ТД,ТекДок.Валюта,ТекДок.Курс,Рубли,КурсРубля,ВалютаУпр,КурсУпр);
		
		Если ТекДок.состояниеНакладной=Перечисления.СостоянияНакладной.ВНаборе или ТекДок.состояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе или ТекДок.состояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке Тогда
			ТО=ПолучитьРезервыТМЦ(ТекДок,Загрузка);
			Результат=ПогаситьРезервы(ТекДок,ТД,ТО,ТДВР,ТекДок.Контрагент,ТОшибок);			
		Иначе
			
			ТО=ПолучитьОстаткиТМЦ(ТекДок,Загрузка);	
			ПунктДоставки=Справочники.ПунктыДоставки.НайтиПоКоду("SNL-007584");
			Результат=ПогаситьПартии(ТекДок,КодОперации,ТД,ТО,ТДВО,ТекДок.Контрагент,ПунктДоставки,ТОшибок);
			
		КонецЕсли;
		
	ИначеЕсли ТекВид="Инвентаризация" Тогда		
		
		ТД.ЗаполнитьЗначения(ТекСклад,"Склад");	
		
		КодОперации	=Перечисления.КодыОперацийОстатки.Инвентаризация;				
		ТаблицыД	=ДвиженияИнвентаризации(ТекДок,ТД);
		
		ТС			=ТаблицыД.ТС;

		Если ПараметрыСеанса.ЭтотУзел.Подразделение.ВидПодразделения <> Перечисления.ВидыПодразделений.Франчайзинг И (ТекДок.Дата >= '20130301' И ТекДок.Склад.Подразделение.ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг) Тогда			
			ТС.ЗаполнитьЗначения(0,"Всего");
			ТС.ЗаполнитьЗначения(0,"Цена");
			ТС.ЗаполнитьЗначения(0,"Сумма");
			ТС.ЗаполнитьЗначения(0,"НДС");
		КонецЕсли;
		//крохин конец 10.04.2013
		
		
		ТОст		=ПолучитьОстаткиТМЦ(ТекДок,Загрузка);
		Результат	=ПогаситьПартии(ТекДок,КодОперации,ТС,ТОст,ТДВО,ТекСклад,,ТОшибок);
		
		СТС			=ТС.Скопировать();
		СТС.Колонки.Добавить("Модель");
		Для Каждого СтрокаСТС Из СТС Цикл
			СтрокаСТС.Модель=СтрокаСТС.Номенклатура.Родитель;		
		КонецЦикла; 
		СТС.Свернуть("Модель","Количество,СписанаСтоимость,Амортизация");
		
		ТО			=ТаблицыД.ТО;
		Для Каждого СтрокаТО Из ТО Цикл
			Если СтрокаТО.ЦенаОприходования=0 Тогда				
				Цена=0;
				
				СтрокиОстатка=ТОст.НайтиСтроки(Новый Структура("Номенклатура,Склад",СтрокаТО.Номенклатура,ТекДок.Склад));
				Для Каждого СтрокаОстатка Из СтрокиОстатка Цикл
					Если СтрокаОстатка.Остаток<>0 Тогда
						Цена=СтрокаОстатка.Стоимость/СтрокаОстатка.Остаток;			
						Прервать;
					КонецЕсли;		
				КонецЦикла;
				
				//списанная стоимость по моделям
				Если Цена=0 Тогда
					СтрокиСписания=СТС.НайтиСтроки(Новый Структура("Модель",СтрокаТО.Номенклатура.Родитель));
					Для Каждого СтрокаСписания Из СтрокиСписания Цикл
						Если СтрокаСписания.Количество<>0 Тогда
							Цена=СтрокаСписания.СписанаСтоимость/СтрокаСписания.Количество;			
							Прервать;
						КонецЕсли;		
					КонецЦикла;				
				КонецЕсли; 
				
				
				//приход или ЦПП
				Если Цена=0 Тогда				
					Цена=ПолучитьЦенуПрихода(СтрокаТО.Номенклатура,ТекДок.Склад,ТекДок.Дата,Истина);
				КонецЕсли;
				
				Если Цена=Неопределено ИЛИ Цена=0 Тогда
					
					если ТекДок.Склад.ТипСклада<>перечисления.ТипСклада.ВнешнийСклад тогда //В Риге задают глупые вопросы
						Сообщить("Неопределена цена прихода ! Номенклатура: "+СтрокаТО.Номенклатура+" "+ТекДок.Склад,СтатусСообщения.Важное);
					конецесли;
					СтрокаТО.Всего=0;
					
				Иначе
					СтрокаТО.Всего=СтрокаТО.Количество*Цена;
				КонецЕсли;				
			Иначе
				СтрокаТО.Всего=СтрокаТО.Количество*СтрокаТО.ЦенаОприходования;
			КонецЕсли;			
		КонецЦикла; 
		
		//крохин начало 10.04.2013
		//крохин начало 23.12.2013
		//в Брянске нужен, потом переделать на реквизит
		//Если ТекДок.Дата > '20130301' И ТекДок.Склад.Подразделение.ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг Тогда
		//крохин начало 29.05.2014
		//в базе франча оборот нужен, в ЦО - нулевой
		//Если ПараметрыСеанса.ЭтотУзел.Подразделение.Код <> "SSP-0162" И (ТекДок.Дата >= '20130301' И ТекДок.Склад.Подразделение.ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг) Тогда			
		Если ПараметрыСеанса.ЭтотУзел.Подразделение.ВидПодразделения <> Перечисления.ВидыПодразделений.Франчайзинг И (ТекДок.Дата >= '20130301' И ТекДок.Склад.подразделение.ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг) Тогда			
			//крохин конец 29.05.2014
			
			//крохин конец 23.12.2013	
			ТО.ЗаполнитьЗначения(0,"Всего");
			ТО.ЗаполнитьЗначения(0,"Цена");
			ТО.ЗаполнитьЗначения(0,"Сумма");
			ТО.ЗаполнитьЗначения(0,"НДС");
		КонецЕсли;
		//крохин конец 10.04.2013
		
		
		//ОприходоватьПартию(ТекДок,КодОперации,ТП,ТДВО,Отправитель=Неопределено,ПунктДоставки=Неопределено,Период=Неопределено,КолонкаКоличества="Количество") //ТП - ТаблицаПрихода		
		ОприходоватьПартию(ТекДок,КодОперации,ТО,ТДВО,ТекДок.Склад);	
		
		Если ТекДок.СостояниеНакладной<>Перечисления.СостоянияНакладной.Отгружена Тогда
			Для Каждого СтрокаТЧ Из ТекДок.Товары Цикл
				Если СтрокаТЧ.Количество<>0 Тогда
					СтрокаТО=ТДВО.Добавить();
					
					СтрокаТО.Активность		=Истина;
					СтрокаТО.Период			=ТекДок.Дата;
					СтрокаТО.Склад			=ТекДок.СкладВременногоХранения;
					СтрокаТО.Номенклатура   =СтрокаТЧ.Номенклатура;					
					СтрокаТО.Количество		=-СтрокаТЧ.Количество;					
				КонецЕсли;
			КонецЦикла;  		
		КонецЕсли; 
		
		ТД=Новый Структура("ТС,ТО",ТС,ТО);
	ИначеЕсли ТекВид="ЗаказПоставщику" Тогда
		Если ТекДок.СостояниеЗаказа=Перечисления.СостояниеЗаказаПоставщику.ПодтвержденныйЗаказ
			ИЛИ ТекДок.СостояниеЗаказа=Перечисления.СостояниеЗаказаПоставщику.ВПути			
			ИЛИ ТекДок.СостояниеЗаказа=Перечисления.СостояниеЗаказаПоставщику.Таможня Тогда			
			
			ДвиженияЗаказаПоставщику(ТекДок,ТД);
			КодОперации=Перечисления.КодыОперацийОстатки.ЗакупкаР;
			Результат=ОприходоватьПартию(ТекДок,КодОперации,ТД,ТДВО,ТекДок.Контрагент);		
		КонецЕсли;			
	ИначеЕсли ТекВид="ЗаданиеНабора" Тогда
		
		ТекСостояние=ПолучитьРеквизитШапки(ТекДок,"СостояниеНакладной","Документ");
		если ТекСостояние<>Перечисления.СостоянияНакладной.ПустаяСсылка() 
			и ТекСостояние<>Перечисления.СостоянияНакладной.СформированыЗаданияНабора 
			и ТекСостояние<>Перечисления.СостоянияНакладной.ОжиданиеНабора
			и ТекСостояние<>Перечисления.СостоянияНакладной.Отменена
			и ТекСостояние<>Перечисления.СостоянияНакладной.ПроверенаПоОстаткам			
			и ТекСостояние<>Перечисления.СостоянияНакладной.Отгружена
			тогда 						
			ТО			= ПолучитьРезервыТМЦ(ТекДок,Загрузка);
			Результат	= ПогаситьРезервы(ТекДок,ТД,ТО,ТДВР,ТекДок.Получатель,ТОшибок);		
		КонецЕсли; 
	ИначеЕсли ТекВид = "Заказ" Тогда
		Если (ТекДок.ИсточникЗаказа = Перечисления.ИсточникЗаказа.Сайт или ТекДок.ИсточникЗаказа = Перечисления.ИсточникЗаказа.БазаТЦфранчайзинг) 
			И ТекДок.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.ВРаботе
			и не (ТекДок.СостояниеСогласования=Перечисления.СостоянияСогласования.ОтмененКонтрагент или ТекДок.СостояниеСогласования=Перечисления.СостоянияСогласования.ОтмененЦО)
			Тогда
			
			Если ТекДок.ДополнительныеДвижения.Количество() > 0 Тогда
				ТДВР.Очистить();
				Для Каждого ТекСтрока Из ТекДок.ДополнительныеДвижения Цикл
					Если ТекСтрока.Количество > 0 Тогда
						НоваяСтрока = ТДВР.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
						НоваяСтрока.Активность		=Истина;
						НоваяСтрока.Период = ТекДок.Дата;
						НоваяСтрока.Регистратор = ТекДок.Ссылка;
						НоваяСтрока.Заказ = ТекДок.Ссылка;
						НоваяСтрока.Получатель = ТекДок.Контрагент;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
	ИначеЕсли ТекВид = "ЗаявкаНаПерепаковку" Тогда
		ТипУзла=ПараметрыСеанса.ЭтотУзел.ТипУзла; 
		Если ТипУзла=ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
			Склад = ТекДок.Склад;
		Иначе
			Если ТекДок.Склад.ВидСклада=Перечисления.ВидСклада.Виртуальный тогда
				Склад = ТекДок.Склад.ФизическийСклад;
			Иначе
				Склад = ТекДок.Склад;
			КонецЕсли;
		КонецЕсли;
		
		Если ТекДок.Статус = Перечисления.СтатусыЗаявокНаПерепаковку.ВРаботе
			ИЛИ ТекДок.Статус = Перечисления.СтатусыЗаявокНаПерепаковку.КОтправкеНаСклад Тогда
			ТО			= ПолучитьОстаткиТМЦ(ТекДок, Загрузка, ,, "Комплектующие");			 
			Результат	= ПогаситьПартии(ТекДок,КодОперации,ТД,ТО,ТДВО,ТекДок.Склад,,ТОшибок,Истина);
			
			Если ТекДок.Комплектующие.Количество() > 0 И ТОшибок = Неопределено Тогда
				ТДВР.Очистить();
				Для Каждого ТекСтрока Из ТекДок.Комплектующие Цикл
					Если ТекСтрока.Количество > 0 Тогда
						НоваяСтрока = ТДВР.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
						НоваяСтрока.Активность = Истина;
						НоваяСтрока.Период = ТекДок.Дата;
						НоваяСтрока.Регистратор = ТекДок.Ссылка;
						НоваяСтрока.Заказ = ТекДок.Ссылка;
						НоваяСтрока.Склад = Склад;
						НоваяСтрока.Получатель = Склад;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		ИначеЕсли ТекДок.Статус = Перечисления.СтатусыЗаявокНаПерепаковку.Закрыта Тогда
			ТО			= ПолучитьОстаткиТМЦ(ТекДок, Загрузка, ,, "Товары");		 
			Результат	= ПогаситьПартии(ТекДок,КодОперации,ТД,ТО,ТДВО,ТекДок.Склад,,ТОшибок,Истина);
			
			Если ТекДок.Товары.Количество() > 0 И ТОшибок = Неопределено Тогда
				ТДВР.Очистить();
				Для Каждого ТекСтрока Из ТекДок.Товары Цикл
					Если ТекСтрока.Количество > 0 Тогда
						НоваяСтрока = ТДВР.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
						НоваяСтрока.Активность = Истина;
						НоваяСтрока.Период = ТекДок.Дата;
						НоваяСтрока.Регистратор = ТекДок.Ссылка;
						НоваяСтрока.Заказ = ТекДок.Ссылка;
						НоваяСтрока.Получатель = Склад;
						НоваяСтрока.Склад = Склад;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		Иначе
			ТДВР.Очистить();
		КонецЕсли;
	КонецЕсли;  
	
	ТаблицаСписания	= ТД;
	
	Запрос=Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=Новый МенеджерВременныхТаблиц;
	Запрос.Текст="
	|ВЫБРАТЬ 
	|	Период,Активность,ВидДвижения,Склад,Номенклатура,Амортизация 
	|ПОМЕСТИТЬ ТДВА 
	|ИЗ 	
	|	&ТДВО КАК ТДВО
	|;
	|ВЫБРАТЬ Период,Активность,ВидДвижения,Склад,Номенклатура КАК ОС,СУММА(Амортизация) КАК Амортизация
	|ИЗ ТДВА 
	|ГДЕ Амортизация<>0
	|СГРУППИРОВАТЬ ПО Период,Активность,ВидДвижения,Склад,Номенклатура";
	
	Запрос.УстановитьПараметр("ТДВО",ТДВО);
	
	ТДВА=Запрос.Выполнить().Выгрузить();
	
	ТДВЗ=СоздатьТаблицуДвижений("Затраты");
	
	Если ТДВА.Количество()>0 И (КодОперации=Перечисления.КодыОперацийОстатки.Реализация ИЛИ КодОперации=Перечисления.КодыОперацийОстатки.Списание) Тогда				
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Склад.Подразделение 		КАК Подразделение,
		|	Номенклатура 				КАК ОС,
		|	СостояниеОС.СтатьяЗатрат 	КАК СтатьяЗатрат,
		|	СУММА(Амортизация) 			КАК СуммаУпр
		|ИЗ ТДВА 		
		|ЛЕВОЕ СОЕДИНЕНИЕ		
		|	РегистрСведений.СостояниеОС.СрезПоследних(&Дата2,ОС В (Выбрать Различные Номенклатура ИЗ ТДВА)) КАК СостояниеОС
		|ПО 
		|	ТДВА.Номенклатура=СостояниеОС.ОС
		|ГДЕ 
		|	Амортизация<>0
		|СГРУППИРОВАТЬ ПО
		|	Склад.Подразделение,
		|	Номенклатура,
		|	СостояниеОС.СтатьяЗатрат";		
		
		Если КодОперации=Перечисления.КодыОперацийОстатки.Списание Тогда
			ФиксированныеРеквизиты=Новый Структура("Период,Активность,ВидДвижения,Контрагент,ВалютаДокумента,ДатаЗаписи",ДатаДокумента,Истина,ВидДвиженияНакопления.Расход,ТекДок.Склад,ПараметрыСеанса.ВалютаНац,ТекущаяДата());		
		Иначе
			ФиксированныеРеквизиты=Новый Структура("Период,Активность,ВидДвижения,Контрагент,Договор,ВалютаДокумента,ДатаЗаписи",ДатаДокумента,Истина,ВидДвиженияНакопления.Расход,ТекДок.Контрагент,ТекДок.Договор,ПараметрыСеанса.ВалютаНац,ТекущаяДата());			
		КонецЕсли;		
		
		Запрос.УстановитьПараметр("Дата2",ТекДок.Дата);
		РезультатЗапроса=Запрос.Выполнить();
		Выборка			=РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Движение=ТДВЗ.Добавить();
			
			Если 1=2 Тогда
				Движение=РегистрыНакопления.Затраты.СоздатьНаборЗаписей().Добавить();			
			КонецЕсли; 
			
			ЗаполнитьЗначенияСвойств(Движение,ФиксированныеРеквизиты);
			ЗаполнитьЗначенияСвойств(Движение,Выборка,"Подразделение,СтатьяЗатрат,СуммаУпр");			
		КонецЦикла; 
		
		ПА=РезультатЗапроса.Выгрузить();
		
		ФиксированныеРеквизиты.Вставить("ВидДвижения",ВидДвиженияНакопления.Приход);
		ФР_Остатки=Новый Структура("КодОперации,Оборот,ОборотБезСкидки,ОборотУпр,ОборотБезСкидкиУпр",Перечисления.КодыОперацийОстатки.Списание,0,0,0,0);
		
		Если КодОперации=Перечисления.КодыОперацийОстатки.Реализация Тогда			
			ТДВО_Доп=ТДВО.СкопироватьКолонки();
			Для Каждого СтрокаТД Из ТДВО Цикл
				Если СтрокаТД.Амортизация<>0 Тогда
					СтрокаДоп=ТДВО_Доп.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаДоп,СтрокаТД);
					
					СтрокаТД.Сумма		=СтрокаТД.Сумма-СтрокаТД.Амортизация;				
					СтрокаДоп.Сумма		=СтрокаТД.Амортизация;
					СтрокаДоп.Количество=0;
					
					СтрокаТД.Амортизация=0;
					
					ЗаполнитьЗначенияСвойств(СтрокаДоп,ФР_Остатки);				
					
					Движение=ТДВЗ.Добавить();			
					ЗаполнитьЗначенияСвойств(Движение,ФиксированныеРеквизиты);				
					Движение.СуммаУпр				=СтрокаДоп.Сумма;
					
					СтрокаПА=ПА.Найти(СтрокаТД.Номенклатура,Номенклатура);
					Если СтрокаПА<>Неопределено Тогда					
						ЗаполнитьЗначенияСвойств(Движение,СтрокаПА,"Подразделение,СтатьяЗатрат");			
					КонецЕсли; 
				КонецЕсли; 		
			КонецЦикла;
			
			Для Каждого СтрокаДоп Из ТДВО_Доп Цикл
				СтрокаТД=ТДВО.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТД,СтрокаДоп);
			КонецЦикла; 
		КонецЕсли;
	КонецЕсли; 
	//крохин начало
	//вместо пустого склада движения по остаткам ТМЦ проводим по складу "Пустой Склад", чтобы не вешать олап
	Для Каждого СтрокаТДВО ИЗ ТДВО Цикл
		Если СтрокаТДВО.Склад = Неопределено ИЛи СтрокаТДВО.Склад = Справочники.Склады.ПустаяСсылка() Тогда
			СтрокаТДВО.Склад = Справочники.Склады.НайтиПоКоду("SSR-64");	
		КонецЕсли;
	КонецЦикла;
	//крохин конец
	
	Движения		=Новый Структура("ОстаткиТМЦ,РезервыТМЦ,Амортизация,Затраты",ТДВО,ТДВР,ТДВА,ТДВЗ);
	
	Возврат Новый Структура("Результат,ТОшибок",Результат,ТОшибок);
КонецФункции

//крохин начало 08.10.2020
Функция ПроведениеПоРегистрамЗаказыКонтрагентов(ДокументСсылка,Движения,Загрузка=Ложь) Экспорт	
	РезультатПроведения	=ПровестиПоЗаказамКонтрагентов(ДокументСсылка,Движения,Загрузка);	
	Возврат РезультатПроведения;		
КонецФункции

Функция  ПровестиПоЗаказамКонтрагентов(Документ,Движения,Загрузка=Ложь) Экспорт
	Если ПараметрыСеанса.Отладка Тогда
		Сообщить("Проведение: "+Документ);
	КонецЕсли;
	
	ЭтотУзел=ПараметрыСеанса.ЭтотУзел;
	
	Результат	=1;
	ТОшибок		=Неопределено;	
	ТДВЗК=СоздатьТаблицуДвижений("ЗаказыКонтрагентов");
	
	
	ТекВид			= Документ.Метаданные().Имя;	
	ТекДок			= Документ;
	
	ДатаДокумента	= ПолучитьРеквизитыШапки(ТекДок,Новый Структура("Дата")).Дата;	
	
	#Если Клиент Тогда
		Состояние(""+ТекВид+" "+ТекДок.Номер+" "+ДатаДокумента);
	#КонецЕсли
	
	ВалютаУпр	= ?(ДатаДокумента>='20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);	
	КурсУпр		= ПолучитьКурсВалюты_ПоРусски(ВалютаУпр,Документ.Дата);
	
	Рубли		= ПараметрыСеанса.ВалютаНац;	
	КурсРубля	= ПолучитьКурсВалюты_ПоРусски(Рубли,ДатаДокумента);
	
	ТС=Новый ТаблицаЗначений;
	ТС.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));	
	
	ИмяТЧ = ПолучитьИмяТоварнойТЧ(Документ);	
	
	ТД=ПолучитьТЧДокумента(Документ,ТекВид,ИмяТЧ);
	
	
	Для Каждого СтрокаТД Из ТД Цикл
		Если СтрокаТД.Количество = 0 И СтрокаТД.Всего = 0 Тогда Продолжить; КонецЕсли;
		СтрокаТДВЗК = ТДВЗК.Добавить();
		СтрокаТДВЗК.Контрагент = ТекДок.Контрагент;
		СтрокаТДВЗК.Номенклатура = СтрокаТД.Номенклатура;
		
		СтрокаТДВЗК.Количество = СтрокаТД.Количество;
		СтрокаТДВЗК.Сумма = СтрокаТД.Всего;
		СтрокаТДВЗК.Период = ДатаДокумента;
		Если ТекВид = "Заказ" Тогда
			СтрокаТДВЗК.ВидДвижения = ВидДвиженияНакопления.Приход;
			СтрокаТДВЗК.Заказ = ТекДок;
		Иначе
			СтрокаТДВЗК.ВидДвижения = ВидДвиженияНакопления.Расход;
			СтрокаТДВЗК.Заказ = ТекДок.ДокОснование;
		КонецЕсли; 
		СтрокаТДВЗК.Активность = Истина;
	КонецЦикла;
	
	Движения		=Новый Структура("ЗаказыКонтрагентов",ТДВЗК);
	
	Возврат Новый Структура("Результат,ТОшибок",Результат,ТОшибок);
	
	
КонецФункции

Процедура ЗаписатьИзменениеСостоянияНакладной(Накладная,НовоеСостояние) Экспорт
	// Кухарь А.Ю. 09.11.2021 начало
	// Иногда выдаёт ошибку с дублями ключевых полей
	//НЗ=РегистрыСведений.ТаймингиСостояний.СоздатьНаборЗаписей();
	//Запись=НЗ.Добавить();
	//
	//Запись.Автор		=ПараметрыСеанса.Пользователь;
	//Запись.Объект		=Накладная;
	//Запись.Период		=ТекущаяДата();
	//Запись.Состояние	=НовоеСостояние;
	//
	//НЗ.Записать(ложь); 
	// Кухарь А.Ю. 09.11.2021 конец
	
	
	
	//Тимофеев Ю.А. Начало   13-11-2024
	//
	//
	
	Попытка
		
		ЗаписьВРег=РегистрыСведений.ТаймингиСостояний.СоздатьМенеджерЗаписи();
		ЗаписьВРег.Автор=ПараметрыСеанса.Пользователь;
		ЗаписьВРег.Объект=Накладная;
		ЗаписьВРег.Период=ТекущаяДата();
		ЗаписьВРег.Состояние=НовоеСостояние;
		ЗаписьВРег.Записать();	 
		
	Исключение
		
		ЗаписатьВЛог("МП_Вайлберриз","Ошибка записи ТАЙМИНГ СОСТОЯНИЯ !","Ошибка");
		
	КонецПопытки;
	
	//Тимофеев Ю.А. Конец    13-11-2024 
	
	
КонецПроцедуры

//ЗАКАЗЫ ПОСТАВЩИКАМ
Функция ЕстьДвиженияПоЗаказам(ДокОснование)
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Количество
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам КАК ЗаказыПоставщикам
	|ГДЕ
	|	Регистратор = &Заказ
	|	И Заказ = &Заказ
	|	И Количество <> 0
	|	И ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)";
	
	Запрос.УстановитьПараметр("Заказ",ДокОснование);
	
	Если Запрос.Выполнить().Выбрать().Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;	
	КонецЕсли; 
КонецФункции // ()

Функция ПолучитьОстаткиЗаявок(Ссылка,ДокОснование)
	ВидДокумента=Ссылка.Метаданные().Имя;
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	ЗаявкаПоставщику КАК Заказ
	|ПОМЕСТИТЬ Заявки
	|ИЗ Документ."+ВидДокумента+".Товары ГДЕ Ссылка=&Ссылка
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	Номенклатура 
	|ПОМЕСТИТЬ СписокНоменклатуры
	|ИЗ Документ."+ВидДокумента+".Товары ГДЕ Ссылка=&Ссылка
	|;	
	|ВЫБРАТЬ
	|	Номенклатура,
	|	Заказ,
	|	КоличествоОстаток	КАК Количество,
	|	СуммаРубОстаток		СуммаРуб,
	|	СуммаUSDОстаток		СуммаUSD,
	|	СуммаEURОстаток		СуммаEUR
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(&МоментВремени,
	|		(Заказ=&ДокОснование ИЛИ Заказ В (ВЫБРАТЬ Заказ ИЗ Заявки))
	|		И Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ СписокНоменклатуры)
	|		) КАК ЗаказыПоставщикамОстатки";
	
	Запрос.УстановитьПараметр("МоментВремени",	Ссылка.МоментВремени());
	Запрос.УстановитьПараметр("Ссылка",			Ссылка);
	Запрос.УстановитьПараметр("ДокОснование",	ДокОснование);		
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // ()

Функция СписатьСтарыеЗаказыПоставщикам(Ссылка,Валюты_Курсы) Экспорт
	ТаблицаДвижений=РегистрыНакопления.ЗаказыПоставщикам.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	
	ДокОснование		= Ссылка.ДокОснование;
	СписыватьЗаказы		= ЕстьДвиженияПоЗаказам(ДокОснование);
	//крохин начало 15.02.2011
	//по заказам не проводим только если нет док основания и не заполнены КП
	//Если НЕ СписыватьЗаказы Тогда 
	//	Возврат Новый Структура("ЗаказыПоставщикам",ТаблицаДвижений); 
	//КонецЕсли;
	//крохин конец 15.02.2011
	
	ВалютаДокумета  = Валюты_Курсы.ВалютаДокумента;
	КурсДокумента	= Валюты_Курсы.КурсДокумента;
	//крохин начало
	//заказы поставщикам списываем по складам из основания
	//ФиксированныеРеквизиты=Новый Структура("Период,ВидДвижения,Активность,Склад",Ссылка.Дата,ВидДвиженияНакопления.Расход,Истина,Ссылка.Склад);
	//крохин начало 15.02.2011
	//склад используем из исходного заказа, а не Докоснования. Может быть указан в КП
	//ФиксированныеРеквизиты=Новый Структура("Период,ВидДвижения,Активность,Склад",Ссылка.Дата,ВидДвиженияНакопления.Расход,Истина,ДокОснование.Склад);
	ФиксированныеРеквизиты=Новый Структура("Период,ВидДвижения,Активность",Ссылка.Дата,ВидДвиженияНакопления.Расход,Истина);
	//крохин конец 15.02.2011
	//крохин конец
	
	ОстаткиЗаказов=ПолучитьОстаткиЗаявок(Ссылка,ДокОснование);	
	
	Для Каждого СтрокаТЧ Из Ссылка.Товары Цикл
		//крохин начало 15.02.2011
		//по заказам не проводим только если нет док основания и не заполнены КП
		Если НЕ СписыватьЗаказы И НЕ ЗначениеЗаполнено(СтрокаТЧ.ЗаявкаПоставщику) Тогда
			Продолжить;
		КонецЕсли;
		//строки с нулевым количеством движений не делают
		Если СтрокаТЧ.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		//крохин конец 15.02.2011
		
		Движение=ТаблицаДвижений.Добавить();			
		
		ЗаполнитьЗначенияСвойств(Движение,ФиксированныеРеквизиты);
		
		ИсходныйЗаказ			= ?(ЗначениеЗаполнено(СтрокаТЧ.ЗаявкаПоставщику),СтрокаТЧ.ЗаявкаПоставщику,ДокОснование);
		//крохин начало 15.02.2011
		//склад используем из исходного заказа, а не Докоснования. Может быть указан в КП
		//ФиксированныеРеквизиты=Новый Структура("Период,ВидДвижения,Активность,Склад",Ссылка.Дата,ВидДвиженияНакопления.Расход,Истина,ДокОснование.Склад);
		Движение.Склад = ИсходныйЗаказ.Склад;	
		//крохин конец 15.02.2011
		
		СтрокиОстатка			= ОстаткиЗаказов.НайтиСтроки(Новый Структура("Заказ,Номенклатура",ИсходныйЗаказ,СтрокаТЧ.Номенклатура));
		СтрокаОстатка			= Неопределено;
		Если СтрокиОстатка.Количество()>0 Тогда
			Для Каждого СтрокаОстатка Из СтрокиОстатка Цикл
				Если СтрокаОстатка.Количество<>0 Тогда Прервать КонецЕсли;						
			КонецЦикла; 						
		КонецЕсли;
		//крохин начало
		//при нулевых остатках КП используем цену из документа-списания
		//Если СтрокаОстатка<>Неопределено Тогда
		Если СтрокаОстатка<>Неопределено И СтрокаОстатка.Количество <> 0 Тогда
			//крохин конец
			ЦенаРуб=СтрокаОстатка.СуммаРуб/СтрокаОстатка.Количество;
			ЦенаUSD=СтрокаОстатка.СуммаUSD/СтрокаОстатка.Количество;
			ЦенаEUR=СтрокаОстатка.СуммаEUR/СтрокаОстатка.Количество;
		Иначе
			ЦенаРуб=глПересчет(СтрокаТЧ.Всего/СтрокаТЧ.Количество,ВалютаДокумета,КурсДокумента,Валюты_Курсы.ВалютаНац,	1);
			// Кельманов А.В. - HELP-1735 - 2024.12.13 {
			//ЦенаUSD=глПересчет(СтрокаТЧ.Всего/СтрокаТЧ.Количество,ВалютаДокумета,КурсДокумента,Валюты_Курсы.Евро,		Валюты_Курсы.КурсЕвро);
			//ЦенаEUR=глПересчет(СтрокаТЧ.Всего/СтрокаТЧ.Количество,ВалютаДокумета,КурсДокумента,Валюты_Курсы.Доллары,	Валюты_Курсы.КурсДоллара);
			Если Ссылка.Дата  >= '20241201' Тогда
				
				ЦенаUSD = глПересчет(СтрокаТЧ.Всего / СтрокаТЧ.Количество, ВалютаДокумета, КурсДокумента, Валюты_Курсы.Доллары, Валюты_Курсы.КурсДоллара);
				ЦенаEUR = глПересчет(СтрокаТЧ.Всего / СтрокаТЧ.Количество, ВалютаДокумета, КурсДокумента, Валюты_Курсы.Евро, Валюты_Курсы.КурсЕвро);
				
			Иначе
				
				ЦенаUSD = глПересчет(СтрокаТЧ.Всего / СтрокаТЧ.Количество, ВалютаДокумета, КурсДокумента, Валюты_Курсы.Евро, Валюты_Курсы.КурсЕвро);
				ЦенаEUR = глПересчет(СтрокаТЧ.Всего / СтрокаТЧ.Количество, ВалютаДокумета, КурсДокумента, Валюты_Курсы.Доллары, Валюты_Курсы.КурсДоллара);
				
			КонецЕсли;
			// Кельманов А.В. - HELP-1735 - 2024.12.13 }
		КонецЕсли;
		
		
		Движение.Номенклатура	= СтрокаТЧ.Номенклатура;
		Движение.Заказ			= ИсходныйЗаказ;
		
		Движение.Количество		= СтрокаТЧ.Количество;				
		Движение.СуммаРуб		= СтрокаТЧ.Количество*ЦенаРуб;
		Движение.СуммаEUR		= СтрокаТЧ.Количество*ЦенаEUR;
		Движение.СуммаUSD		= СтрокаТЧ.Количество*ЦенаUSD;
		
		//крохин начало 04.08.2011
		Если ЕстьРеквизитДокумента("Контракт",Движение.Заказ.Метаданные()) Тогда
			Движение.Контракт =  Движение.Заказ.Контракт;
		КонецЕсли;
		//крохин конец 04.08.2011
		
		Если ЗначениеЗаполнено(Движение.Заказ) Тогда
			Движение.Отправитель	= Движение.Заказ.Контрагент;		
		КонецЕсли; 		
	КонецЦикла;	
	
	Возврат Новый Структура("ЗаказыПоставщикам",ТаблицаДвижений);
КонецФункции
//++Данилова Е.В. 29.07.2025 HELP-6187 
Функция СписатьСтарыеЗаказыПоставщикамПоКомплектующим(Ссылка,Валюты_Курсы,ПоДокОснованию = Истина,СписатьШтуки = истина) Экспорт
	
	ВидДокумента  = Ссылка.Метаданные().Имя;
	
	Если СписатьШтуки Тогда
		
		ТаблицаДвижений = РегистрыНакопления.ЗаказыПоставщикамШтуки.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	Иначе 
		
		ТаблицаДвижений = РегистрыНакопления.ЗаказыПоставщикам.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	КонецЕсли;
	
	
	ДокОснование		= Ссылка.ДокОснование;
	Если ПоДокОснованию Тогда 
		СписыватьЗаказы		= ЕстьДвиженияПоЗаказамШтуки(ДокОснование);
	Иначе
		СписыватьЗаказы = ЛОЖЬ; 
	КонецЕсли;
	
	ВалютаДокумета  = Валюты_Курсы.ВалютаДокумента;
	КурсДокумента	= Валюты_Курсы.КурсДокумента;
	
	ФиксированныеРеквизиты = Новый Структура("Период,ВидДвижения,Активность",Ссылка.Дата,ВидДвиженияНакопления.Расход,Истина);
	
	ОстаткиЗаказов = ПолучитьОстаткиЗаявокПоКомплектующим(Ссылка,ДокОснование,ПоДокОснованию,СписатьШтуки);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтрактСПроизводителемКомплектующие.Номенклатура КАК Номенклатура,
	|	СУММА(КонтрактСПроизводителемКомплектующие.Количество) КАК Количество,
	|	МАКСИМУМ(КонтрактСПроизводителемКомплектующие.Цена) КАК Цена,
	|	СУММА(КонтрактСПроизводителемКомплектующие.Всего) КАК Всего,
	|	КонтрактСПроизводителемКомплектующие.Коэффициент КАК Коэффициент,
	|	КонтрактСПроизводителемКомплектующие.ЗаявкаПоставщику КАК ЗаявкаПоставщику
	|ИЗ
	|	Документ.%ВидДокумента%.Комплектующие КАК КонтрактСПроизводителемКомплектующие
	|ГДЕ
	|	КонтрактСПроизводителемКомплектующие.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтрактСПроизводителемКомплектующие.Номенклатура,
	|	КонтрактСПроизводителемКомплектующие.Коэффициент,
	|	КонтрактСПроизводителемКомплектующие.ЗаявкаПоставщику";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ВидДокумента%",ВидДокумента); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтрокаТЧ = РезультатЗапроса.Выбрать();

	Пока СтрокаТЧ.Следующий() Цикл
		
		Если НЕ СписыватьЗаказы И НЕ ЗначениеЗаполнено(СтрокаТЧ.ЗаявкаПоставщику) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СписатьШтуки
			И НЕ ПоДокОснованию 
			И СтрокаТЧ.ЗаявкаПоставщику = ссылка Тогда //КПНаКомплекты
		
			Продолжить; 	
		
		КонецЕсли;
		
		Если СтрокаТЧ.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
				
		Движение = ТаблицаДвижений.Добавить();			
		
		ЗаполнитьЗначенияСвойств(Движение,ФиксированныеРеквизиты);
		
		ИсходныйЗаказ			= ?(ЗначениеЗаполнено(СтрокаТЧ.ЗаявкаПоставщику),СтрокаТЧ.ЗаявкаПоставщику,ДокОснование);
		
		Движение.Склад = ИсходныйЗаказ.Склад;	
		
		СтрокиОстатка			= ОстаткиЗаказов.НайтиСтроки(Новый Структура("Заказ,Номенклатура",ИсходныйЗаказ,СтрокаТЧ.Номенклатура));
		СтрокаОстатка			= Неопределено;
		Если СтрокиОстатка.Количество()>0 Тогда
			Для Каждого СтрокаОстатка Из СтрокиОстатка Цикл
				Если СтрокаОстатка.Количество<>0 Тогда Прервать КонецЕсли;						
			КонецЦикла; 						
		КонецЕсли;
		Если СтрокаОстатка<>Неопределено И СтрокаОстатка.Количество <> 0 Тогда
			ЦенаРуб=СтрокаОстатка.СуммаРуб/СтрокаОстатка.Количество;
			ЦенаUSD=СтрокаОстатка.СуммаUSD/СтрокаОстатка.Количество;
			ЦенаEUR=СтрокаОстатка.СуммаEUR/СтрокаОстатка.Количество;
		Иначе
			ЦенаРуб = глПересчет(СтрокаТЧ.Всего/СтрокаТЧ.Количество,ВалютаДокумета,КурсДокумента,Валюты_Курсы.ВалютаНац,	1);
			
			Если Ссылка.Дата  >= '20241201' Тогда
				
				ЦенаUSD = глПересчет(СтрокаТЧ.Всего / СтрокаТЧ.Количество, ВалютаДокумета, КурсДокумента, Валюты_Курсы.Доллары, Валюты_Курсы.КурсДоллара);
				ЦенаEUR = глПересчет(СтрокаТЧ.Всего / СтрокаТЧ.Количество, ВалютаДокумета, КурсДокумента, Валюты_Курсы.Евро, Валюты_Курсы.КурсЕвро);
				
			Иначе
				
				ЦенаUSD = глПересчет(СтрокаТЧ.Всего / СтрокаТЧ.Количество, ВалютаДокумета, КурсДокумента, Валюты_Курсы.Евро, Валюты_Курсы.КурсЕвро);
				ЦенаEUR = глПересчет(СтрокаТЧ.Всего / СтрокаТЧ.Количество, ВалютаДокумета, КурсДокумента, Валюты_Курсы.Доллары, Валюты_Курсы.КурсДоллара);
				
			КонецЕсли;
			
		КонецЕсли;
		
		
		Движение.Номенклатура	= СтрокаТЧ.Номенклатура;
		Движение.Заказ			= ИсходныйЗаказ;
		
		Движение.Количество		= СтрокаТЧ.Количество;				
		Движение.СуммаРуб		= СтрокаТЧ.Количество*ЦенаРуб;
		Движение.СуммаEUR		= СтрокаТЧ.Количество*ЦенаEUR;
		Движение.СуммаUSD		= СтрокаТЧ.Количество*ЦенаUSD;
		
		
		Если ЕстьРеквизитДокумента("Контракт",Движение.Заказ.Метаданные()) Тогда
			Движение.Контракт =  Движение.Заказ.Контракт;
		КонецЕсли;		
		
		Если ЗначениеЗаполнено(Движение.Заказ) Тогда
			Движение.Отправитель	= Движение.Заказ.Контрагент;		
		КонецЕсли; 		
	КонецЦикла;	
	Если СписатьШтуки Тогда 
		Возврат Новый Структура("ЗаказыПоставщикамШтуки",ТаблицаДвижений);
	Иначе
		Возврат Новый Структура("ЗаказыПоставщикам",ТаблицаДвижений);
	КонецЕсли;
КонецФункции

Функция ПолучитьОстаткиЗаявокПоКомплектующим(Ссылка,ДокОснование,ПоДокОснованию,СписатьШтуки)
	ВидДокумента  = Ссылка.Метаданные().Имя;
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	ЗаявкаПоставщику КАК Заказ
	|ПОМЕСТИТЬ Заявки
	|ИЗ Документ."+ВидДокумента+".Комплектующие ГДЕ Ссылка=&Ссылка
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	Номенклатура 
	|ПОМЕСТИТЬ СписокНоменклатуры
	|ИЗ Документ."+ВидДокумента+".Комплектующие ГДЕ Ссылка=&Ссылка
	|;	
	
	|ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыПоставщикамОстатки.Заказ КАК Заказ,
	|	ЗаказыПоставщикамОстатки.КоличествоОстаток КАК Количество,
	|	ЗаказыПоставщикамОстатки.СуммаРубОстаток КАК СуммаРуб,
	|	ЗаказыПоставщикамОстатки.СуммаUSDОстаток КАК СуммаUSD,
	|	ЗаказыПоставщикамОстатки.СуммаEURОстаток КАК СуммаEUR
	|ИЗ
	|	РегистрНакопления.%ЗаказыПоставщикамШтуки%.Остатки(
	|			&МоментВремени,
	|			ВЫБОР
	|					КОГДА &ПоДокоснованию
	|						ТОГДА Заказ = &ДокОснование
	|								ИЛИ Заказ В
	|									(ВЫБРАТЬ
	|										Заявки.Заказ
	|									ИЗ
	|										Заявки КАК Заявки)
	|					ИНАЧЕ Заказ В
	|							(ВЫБРАТЬ
	|								Заявки.Заказ
	|							ИЗ
	|								Заявки КАК Заявки)
	|				КОНЕЦ
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						СписокНоменклатуры.Номенклатура
	|					ИЗ
	|						СписокНоменклатуры КАК СписокНоменклатуры)) КАК ЗаказыПоставщикамОстатки";
	
	Запрос.УстановитьПараметр("МоментВремени",	Ссылка.МоментВремени());
	Запрос.УстановитьПараметр("Ссылка",			Ссылка);
	Запрос.УстановитьПараметр("ДокОснование",	ДокОснование);
	
	Запрос.УстановитьПараметр("ПоДокоснованию",	ПоДокОснованию); 
	Если СписатьШтуки Тогда 	
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ЗаказыПоставщикамШтуки%","ЗаказыПоставщикамШтуки"); 
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ЗаказыПоставщикамШтуки%","ЗаказыПоставщикам");
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // () 

Функция ЕстьДвиженияПоЗаказамШтуки(ДокОснование)
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ЗаказыПоставщикам.Количество КАК Количество
	             |ИЗ
	             |	РегистрНакопления.ЗаказыПоставщикамШтуки КАК ЗаказыПоставщикам
	             |ГДЕ
	             |	ЗаказыПоставщикам.Регистратор = &Заказ
	             |	И ЗаказыПоставщикам.Заказ = &Заказ
	             |	И ЗаказыПоставщикам.Количество <> 0
	             |	И ЗаказыПоставщикам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)";
	
	Запрос.УстановитьПараметр("Заказ",ДокОснование);
	
	Если Запрос.Выполнить().Выбрать().Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;	
	КонецЕсли; 
КонецФункции

//--Данилова Е.В. 29.07.2025
//Мессерле
функция ВернутьТипГруппыНоменклатуры(Группа) экспорт
	//Возвращает тип. номенклатуры, считая уровни СНИЗУ (станд. Уровень()-сверху)
	Родитель=Группа.родитель;
	
	//Для новых товаров будет незаполнено, также и для товаров первого уровня- все можно редактировать
	Если НЕ ЗначениеЗаполнено(Родитель) тогда
		возврат("Модель");
	Конецесли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Родитель = &ССылка
	|	И (НЕ Номенклатура.ЭтоГруппа)";
	
	Запрос.УстановитьПараметр("ССылка", Группа);
	выб=запрос.Выполнить().Выбрать();
	Если выб.Количество()>0 тогда
		Возврат("Модель");
	Конецесли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Родитель КАК Коллекция,
	|	Номенклатура.Родитель.Родитель КАК Бренд
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура1
	|		ПО Номенклатура.Ссылка = Номенклатура1.Родитель
	|			И ((НЕ Номенклатура1.ЭтоГруппа))
	|ГДЕ
	|	Номенклатура.Родитель В ИЕРАРХИИ(&ССылка)
	|	И Номенклатура.ЭтоГруппа
	|
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура.Родитель,
	|	Номенклатура.Родитель.Родитель
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Номенклатура1.Ссылка) > 0";
	
	Запрос.УстановитьПараметр("ССылка", Родитель);
	
	Результат = Запрос.Выполнить();
	тз=Результат.Выгрузить();
	НАШЛИ=ЛОЖЬ;
	ВыборкаДетали = Результат.Выбрать();
	Если ВыборкаДетали.Количество()=1 тогда
		ВыборкаДетали.Следующий();
		Если  ВыборкаДетали.Коллекция=Родитель тогда
			Возврат("Модель");
		иначеесли	ВыборкаДетали.Бренд=Родитель тогда
			Возврат("Коллекция");
		иначе	
			Возврат("Модель");
		Конецесли;
	иначеесли  ВыборкаДетали.Количество()>1 тогда
		//Бренд или выше
		
		пока выборкадетали.Следующий() цикл
			
			Если	ВыборкаДетали.Бренд=Родитель тогда
				Возврат("Коллекция");
			Конецесли;
			
		Конеццикла; 
	иначеесли ВыборкаДетали.Количество()=0 тогда
		Нашли=Ложь;
	иначе
		Нашли=ИСТИНА;
	Конецесли;
	
	Если НЕ НАШЛИ тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В ИЕРАРХИИ(&ССылка)
		|	И (НЕ Номенклатура.ЭтоГруппа)";
		
		Запрос.УстановитьПараметр("ССылка", Родитель);
		выб=запрос.Выполнить().Выбрать();
		Если выб.Количество()=0 тогда //Нет элементов внутри родителя- считаем моделью
			Возврат("Модель");
		Конецесли;
		
		Возврат("ТипТовара");
	Конецесли;
	
Конецфункции	


// Кухарь А.Ю. 23.09.2021 начало
//
Функция ПолучитьВозвратыКомиссииТекущегоДокумента (Документ)
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЗ.Номенклатура КАК Номенклатура,
	|	СУММА(-ТЗ.Количество) КАК Остаток,
	|	ТЗ.Ссылка.Склад КАК Склад,
	|	СУММА(0) КАК Амортизация,
	|	СУММА(0) КАК Резерв,
	|	0 КАК Стоимость,
	// Кухарь А.Ю.  12.04.2023 начало
	//
	|	ТЗ.Ссылка.Дата КАК ДатаИзДокумента,
	|	СУММА(ТЗ.Всего) КАК ВсегоИзДокумента	 
	// Кухарь А.Ю.  12.04.2023 конец
	
	|ИЗ
	|	Документ.ОтчетКомиссионера.Товары КАК ТЗ
	|ГДЕ
	|	ТЗ.Количество < 0
	|	И ТЗ.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЗ.Номенклатура,
	|	ТЗ.Ссылка.Склад,
	// Кухарь А.Ю.  12.04.2023 начало
	//
	|	ТЗ.Ссылка.Дата"; 
	// Кухарь А.Ю.  12.04.2023 конец
	
	Запрос.УстановитьПараметр("Ссылка",Документ);
	Возврат запрос.Выполнить().Выбрать();
КонецФункции
// Кухарь А.Ю. 23.09.2021 конец

Процедура РаспределитьСуммуПропорциональноБазе(Таблица, ИмяКолонкиБазы, ИмяКолонкиДляРаспределения, Сумма, ИмяКолонкиНоменклатуры = "Продукция") Экспорт
	
	СуммаБазы = 0;
	Для Каждого СтрокаТаблицы ИЗ Таблица Цикл
		
		ЭтоТовар = ЗначениеРеквизитаОбъекта(СтрокаТаблицы[ИмяКолонкиНоменклатуры].Родитель, "ВидНоменклатуры") = Перечисления.ВидыНоменклаутры.Товар;
		
		Если ЭтоТовар И СтрокаТаблицы[ИмяКолонкиБазы] <> 0 Тогда
			СуммаБазы = СуммаБазы + СтрокаТаблицы[ИмяКолонкиБазы];	
		КонецЕсли;
		
	КонецЦикла;
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	Для Каждого СтрокаТаблицы ИЗ Таблица Цикл
		
		ЭтоТовар = ЗначениеРеквизитаОбъекта(СтрокаТаблицы[ИмяКолонкиНоменклатуры].Родитель, "ВидНоменклатуры") = Перечисления.ВидыНоменклаутры.Товар;
		
		Если НЕ ЭтоТовар Тогда
			Продолжить;
		КонецЕсли;
		
		К = Сумма / СуммаБазы;
		
		СуммаКРаспределению = Окр(СтрокаТаблицы[ИмяКолонкиБазы] * К, 2);
		
		СтрокаТаблицы[ИмяКолонкиДляРаспределения] = СтрокаТаблицы[ИмяКолонкиДляРаспределения] + СуммаКРаспределению;
		
		Сумма = Сумма - СуммаКРаспределению;
		
		СуммаБазы = СуммаБазы - СтрокаТаблицы[ИмяКолонкиБазы]
		
	КонецЦикла
	
КонецПроцедуры
// РНК+КМПЛ +++

#Область ЦенаПрихода

//крохин начало
//добавил слово "Экспорт"  в "ПолучитьЦенуПрихода"
//крохин конец
Функция ПолучитьЦенуПрихода(Номенклатура,Склад,Дата,Инвентаризация=Ложь)	Экспорт
	Цена		= Неопределено;
	ВалютаУпр	= ?(Дата>='20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);			
	КурсУпр		= ПолучитьКурсВалюты_ПоРусски(ВалютаУпр,Дата);
	
	//крохин начало 10.05.2011
	//у не товара используем ЦПП
	Если Инвентаризация И Дата >= '20110401' И Номенклатура.Родитель.ВидНоменклатуры <> Перечисления.ВидыНоменклаутры.Товар Тогда
		Цена=ПолучитьПериодическийРеквизит(Номенклатура,"ЦенаПоследнегоПрихода",Дата);
		Если ЗначениеНеЗаполнено(Цена) Тогда
			Возврат 0;
		Иначе 
			Возврат Цена;
		КонецЕсли;
	КонецЕсли;
	//крохин конец 10.05.2011
	
	Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Сумма/Количество Как Цена,Период
		|ИЗ
		|	РегистрНакопления.ОстаткиТМЦ
		|ГДЕ
		|	Период<=&Дата2
		|	И Номенклатура = &Номенклатура И Склад=&Склад
		|	И ВидДвижения = &Приход
		|	И Сумма <> 0 И Количество <> 0
		|УПОРЯДОЧИТЬ ПО Период УБЫВ";
		
		Запрос.УстановитьПараметр("Номенклатура",Номенклатура);	
		Запрос.УстановитьПараметр("Склад",Склад);
		Запрос.УстановитьПараметр("Приход",ВидДвиженияНакопления.Приход);
		Запрос.УстановитьПараметр("Дата2",Дата);		
		
		Выборка=Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Дата>='20090101' И Выборка.Период<'20090101' Тогда
				Возврат глПересчет(Выборка.Цена,ПараметрыСеанса.ВалютаУпр,Выборка.Период,ВалютаУпр,КурсУпр);
			Иначе
				Возврат Выборка.Цена;			
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли;	
	
	Если Инвентаризация Тогда
		Цена=ПолучитьПериодическийРеквизит(Номенклатура,"ЦенаПоследнегоПрихода",Дата);
		Если ЗначениеНеЗаполнено(Цена) И НЕ Константы.РозничныйТипЦен.Получить().Пустая() Тогда		
			//ПолучитьЦенуНоменклатуры(Номенклатура,Единица=Неопределено,ТипЦен,ВалютаДокумента,КурсДокумента,ДатаРасчета=Неопределено) Экспорт
			
			Цена	= ПолучитьЦенуНоменклатуры(Номенклатура,,Константы.РозничныйТипЦен.Получить(),ВалютаУпр,КурсУпр,Дата);	
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Цена;
КонецФункции //ПолучитьЦенуПрихода()

Функция ПолучитьЦенуПоследнегоПрихода(Номенклатура,Склад,Период)
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СУММА(Количество)	КАК Количество,
	|	СУММА(Сумма)		КАК Сумма,
	|	Регистратор.Дата	КАК Дата,
	|	Регистратор.Курс	КАК Курс
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ
	|ГДЕ	
	|	ОстаткиТМЦ.Номенклатура = &Номенклатура
	|	И КодОперации В (&КодыОпераций)
	|	И Период		<=&Период	
	|	И Количество	> 0
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиТМЦ.Регистратор
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор.Дата УБЫВ"
	;
	
	КодыОпераций=Новый СписокЗначений;
	КодыОпераций.Добавить(Перечисления.КодыОперацийОстатки.Закупка);	
	
	Запрос.УстановитьПараметр("КодыОпераций",КодыОпераций);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Склад",Склад);
	Запрос.УстановитьПараметр("Период",Период);
	
	ДатаЧ='20090101';
	
	Цена=0;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда		
		Цена=Окр(Выборка.Сумма/Выборка.Количество,2,1);				
		Если Период>=ДатаЧ И Выборка.Дата<ДатаЧ Тогда				
			Цена=Окр((Выборка.Сумма/Выборка.Курс)/Выборка.Количество,2,1);			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Цена;
КонецФункции // ПолучитьЦенуПоследнегоПрихода()

#КонецОбласти

//крохин конец 08.12.2020

#Область Партии

Функция ОприходоватьПартию(ТекДок,КодОперации,ТП,ТДВО,Отправитель=Неопределено,ПунктДоставки=Неопределено,Период=Неопределено,КолонкаКоличества="Количество") //ТП - ТаблицаПрихода		
	Если ЕстьРеквизитДокумента("Валюта",ТекДок.Метаданные()) Тогда
		ВалютаДокумента=ТекДок.Валюта;		
	Иначе
		ВалютаДокумента=?(ТекДок.Дата>='20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);						
	КонецЕсли;	
	КурсУпр		=	глПересчет(1,ВалютаДокумента,ТекДок.Дата,ПараметрыСеанса.ВалютаУпр_2009,ТекДок.Дата,Ложь);		
	
	ТекПериод		=?(Период=Неопределено,ТекДок.Дата,Период);
	
	ОтправительВТЧ	=?(ТП.Колонки.Найти("Получатель")=Неопределено,Ложь,Истина);	
	
	//крохин начало 12.04.2021
	//ПНК-возвраты по комиссионной схеме приходуют товар по себестоимости
	Если ТекДок.Метаданные().Имя <> "РасходнаяНакладная" И КодОперации = Перечисления.КодыОперацийОстатки.Комиссия Тогда
		ТО = ПолучитьОстаткиТМЦ(ТекДок,Ложь,ТекДок.СкладКомиссия);	
	КонецЕсли;
	//крохин конец 12.04.2021
	
	Для Каждого СтрокаТП Из ТП Цикл
		////крохин начало 11.11.2015
		//для упаковки в ПРМ проводок не делаем
		//Если ТекДок.Метаданные().Имя = "Перемещение" И (СтрокаТП.КодОперации = Перечисления.КодыОперацийОстатки.Списание ИЛИ СтрокаТП.КодОперации = Перечисления.КодыОперацийОстатки.ПустаяСсылка()) Тогда
		//Продолжить;	
		//КонецЕсли;
		////крохин конец 11.11.2015
		НадоОприходовать=СтрокаТП[КолонкаКоличества];
		Если (КодОперации=Перечисления.КодыОперацийОстатки.Списание ИЛИ КодОперации=Перечисления.КодыОперацийОстатки.Оприходование) Тогда
			Если НадоОприходовать=0 И СтрокаТП.Всего=0 Тогда
				Продолжить;			
			КонецЕсли;			
		ИначеЕсли НадоОприходовать=0 Тогда 
			Продолжить;					
		КонецЕсли;		
		
		Движение=ТДВО.Добавить();	
		
		Движение.Активность		= Истина;
		Движение.Период		= ТекПериод;		
		
		Движение.Склад		= СтрокаТП.Склад;	
		
		Движение.Номенклатура	= СтрокаТП.Номенклатура;			
		Движение.Количество		= НадоОприходовать;		
		
		Движение.Сумма		= СтрокаТП.Всего;	
		
		//крохин начало 12.04.2021
		//ПНК-возвраты по комиссионной схеме приходуют товар по себестоимости
		
		// Шворобей ВЮ 30.10.2024 ++ https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-1856
		Если КодОперации = Перечисления.КодыОперацийОстатки.Комиссия Тогда
			
			Если ТекДок.Метаданные().Имя = "ПриходнаяНакладная" Тогда
				СтрокаОстатка=ТО.Найти(СтрокаТП.Номенклатура,"Номенклатура");
				Если СтрокаОстатка <> Неопределено И СтрокаОстатка.Остаток > 0 Тогда
					//крохин начало 04.12.2024
					//условие косячное 
					//Если СтрокаОстатка.Стоимость = 0 И ТекДок.Дата >= '20241101' Тогда
					//	Движение.Сумма = 0;
					//КонецЕсли;
					Если СтрокаОстатка.Стоимость = 0 И ТекДок.Дата >= '20240101' Тогда
						Движение.Сумма = 0;
					ИначеЕсли СтрокаОстатка.Стоимость>0 Тогда
						Движение.Сумма = НадоОприходовать*СтрокаОстатка.Стоимость/СтрокаОстатка.Остаток;
					КонецЕсли;
					//крохин конец 04.12.2024
				КонецЕсли;
			ИначеЕсли ТекДок.Метаданные().Имя <> "РасходнаяНакладная" Тогда
				СтрокаОстатка=ТО.Найти(СтрокаТП.Номенклатура,"Номенклатура");	
				Если СтрокаОстатка<>Неопределено И СтрокаОстатка.Остаток>0 Тогда
					Если СтрокаОстатка.Стоимость>0 Тогда
						Движение.Сумма = НадоОприходовать*СтрокаОстатка.Стоимость/СтрокаОстатка.Остаток;					
					КонецЕсли;
				КонецЕсли; 		
			КонецЕсли;
			
		КонецЕсли;
		// Шворобей ВЮ 30.10.2024 ++ https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-1856
		
		Движение.Оборот		= СтрокаТП.Оборот;		
		Движение.ОборотБезСкидки= СтрокаТП.ОборотБезСкидки;
		
		Движение.ОборотУпр		= КурсУпр*СтрокаТП.Оборот;		
		Движение.ОборотБезСкидкиУпр	= КурсУпр*СтрокаТП.ОборотБезСкидки;
		
		Движение.КодОперации	= КодОперации;		
		
		Если ОтправительВТЧ Тогда
			Движение.Отправитель = СтрокаТП.Получатель;
		Иначе
			Движение.Отправитель = Отправитель;
		КонецЕсли; 	
		
		Движение.Подразделение	= СтрокаТП.Подразделение;
		Движение.ПунктДоставки	= ПунктДоставки;
		
		Движение.Амортизация	= СтрокаТП.Амортизация;
		
	КонецЦикла;
	
	Возврат 1;
КонецФункции

// Кухарь А.Ю.  14.03.2024 начало
//Функция ПогаситьПартии(ТекДок,КодОперации,Товары,Остатки,ТДВО,Получатель=Неопределено,ПунктДоставки=Неопределено,ТО=Неопределено,КонтрольОстатков=Истина,Период=Неопределено,КолонкаКоличества="Количество")
Функция ПогаситьПартии(ТекДок,КодОперации,Товары,Остатки,ТДВО,Получатель=Неопределено,ПунктДоставки=Неопределено,ТО=Неопределено,КонтрольОстатков=Истина,Период=Неопределено,КолонкаКоличества="Количество",Загрузка=ложь) 
	// Кухарь А.Ю.  14.03.2024 конец
	
	МетаДок=ТекДок.Метаданные();
	//крохин начало 12.04.2021
	МетаДокИмя = МетаДок.Имя;
	//крохин конец 12.04.2021
	Если ЕстьРеквизитДокумента("Валюта",МетаДок) Тогда
		ВалютаДокумента=ТекДок.Валюта;		
	Иначе
		ВалютаДокумента=?(ТекДок.Дата>='20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);						
	КонецЕсли;	
	
	НеСписыватьКоличество=Ложь;
	Если МетаДок.Имя="СписаниеТМЦ" Тогда
		НеСписыватьКоличество=ТекДок.НеСписыватьКоличество;
	КонецЕсли; 
	
	КурсУпр		=	глПересчет(1,ВалютаДокумента,ТекДок.Дата,ПараметрыСеанса.ВалютаУпр_2009,ТекДок.Дата,Ложь);		
	
	Результат=1;
	
	КэшЦенСписания	=Новый Соответствие;
	
	ПолучательВТЧ	=?(Товары.Колонки.Найти("Получатель")=Неопределено,Ложь,Истина); 
	ТекПериод		=?(Период=Неопределено,ТекДок.Дата,Период);
	
	//крохин начало 08.12.2020
	//расчет себестоимости возвратов по отчетам комиссионера
	//крохин начало 12.04.2021
	//	Если ТекДок.Метаданные().Имя = "ОтчетКомиссионера" Тогда
	Если МетаДокИмя = "ОтчетКомиссионера"  Тогда
		//крохин конец 12.04.2021	
		ТОминусов = ПолучитьТаблицуРеализацииДляВозвратаОтчетКомиссионера(ТекДок);	
	КонецЕсли;
	Если МетаДокИмя = "Претензия"  Тогда
		//крохин конец 12.04.2021	
		ТОминусов = ПолучитьТаблицуРеализацииДляВозвратаПретензия(ТекДок);	
	КонецЕсли;
	//крохин конец 08.12.2020
	
	Для Каждого СтрокаТоваров Из Товары Цикл
		
		Если СтрокаТоваров.ЭтоУслуга <> Null И СтрокаТоваров.ЭтоУслуга Тогда
			//крохин конец 20.02.2016 
			Движение = ТДВО.Добавить();
			
			Движение.Активность		= Истина;
			Движение.ВидДвижения		= ВидДвиженияНакопления.Расход;
			Движение.Период 		= ТекПериод;
			
			Движение.Склад		= СтрокаТоваров.Склад;
			Движение.Номенклатура	= СтрокаТоваров.Номенклатура;			
			
			Движение.Количество		= 0;			
			Движение.Сумма 		= 0;				
			
			Движение.КодОперации		= КодОперации;
			Движение.Отправитель		= Получатель;
			Движение.Подразделение	= СтрокаТоваров.Подразделение;
			Движение.ПунктДоставки	= ПунктДоставки;
			Движение.ДК			= СтрокаТоваров.ДК;
			
			Движение.ВалютаДокумента= ВалютаДокумента;
			
			Движение.Оборот		= СтрокаТоваров.Оборот;
			Движение.ОборотБезСкидки	= СтрокаТоваров.ОборотБезСкидки;
			
			Движение.ОборотУпр		= Движение.Оборот*КурсУпр;
			Движение.ОборотБезСкидкиУпр	= Движение.ОборотБезСкидки*КурсУпр;			
			
		Иначе
			НадоСписать 	=СтрокаТоваров[КолонкаКоличества];
			Если НадоСписать=0 Тогда 
				Если ТекДок.Метаданные().Имя="Перемещение" И СтрокаТоваров.ПодтвержденнаяЗаявка<>СтрокаТоваров.Количество И СтрокаТоваров.Склад=ТекДок.Склад И ТО<>Неопределено Тогда
					ТекОстатки		=Остатки.НайтиСтроки(Новый Структура("Номенклатура",СтрокаТоваров.Номенклатура));				
					Количество=0;	Стоимость=0;
					
					Для Каждого СтрокаОстатка Из ТекОстатки Цикл					
						Количество  =Количество	+СтрокаОстатка.Остаток;
						Стоимость	=Стоимость	+СтрокаОстатка.Стоимость;					
					КонецЦикла;				
					
					СтрокаТоваров.ЦенаСписания=?(Количество=0,0,Стоимость/Количество);
				КонецЕсли; 
				Продолжить; 
			КонецЕсли;
			
			// Кухарь А.Ю. 24.11.2020 начало
			// В документе Отчёт комиссионеров иногда есть отрицательные количества, которые контролировать не нужно.
			//Если КонтрольОстатков Тогда	
			
			
			//крохин начало 12.04.2021
			//	если   МетаДок.Имя="ОтчетКомиссионера"  и НадоСписать < 0 тогда
			Если (МетаДокИмя = "ОтчетКомиссионера" ИЛИ МетаДокИмя = "Претензия")  и НадоСписать < 0  Тогда
				//крохин конец 12.04.2021	
				ЭтуСтрочкуНеКонтролируем=Истина;
			Иначе
				ЭтуСтрочкуНеКонтролируем=Ложь;
			КонецЕсли;
			Если КонтрольОстатков и не ЭтуСтрочкуНеКонтролируем Тогда
				// Кухарь А.Ю. 24.11.2020 конец
				
				Номенклатура			= СтрокаТоваров.Номенклатура;
				
				ТекОстатки			= Остатки.НайтиСтроки(Новый Структура("Номенклатура",СтрокаТоваров.Номенклатура));
				
				ОборотПоСтроке  		= СтрокаТоваров.Оборот;		
				ОборотПоСтрокеБезСкидки 	= СтрокаТоваров.ОборотБезСкидки;
				
				ОборотПоСтрокеУпр  		= СтрокаТоваров.ОборотУпр;		
				ОборотПоСтрокеБезСкидкиУпр	= СтрокаТоваров.ОборотБезСкидкиУпр;
				
				Цена				= ОборотПоСтроке/НадоСписать;
				ЦенаБезСкидки			= ОборотПоСтрокеБезСкидки/НадоСписать;
				
				Остаток = 0; Резерв = 0;
				
				ЦенаСписания	=Неопределено;
				
				Для Каждого СтрокаОстатка Из ТекОстатки Цикл
					Остаток		= СтрокаОстатка.Остаток;
					Резерв			= СтрокаОстатка.Резерв;					
					
					ОперационныйОстаток	= СтрокаОстатка.Остаток - Макс(СтрокаОстатка.Резерв,0);
					
					Если Остаток <> 0 Тогда
						ЦенаСписания=СтрокаОстатка.Стоимость/Остаток;
						/////////////////////////////////////////////////////
						КэшЦенСписания.Вставить(Номенклатура,ЦенаСписания);
						/////////////////////////////////////////////////////
					ИначеЕсли Остаток = 0 И ТекДок.Дата >= '20240101' Тогда // Цену списания ищем из Последнего прихода
						ЦенаСписания = 0;
						Если ЕстьРеквизитДокумента("Склад", МетаДок) Тогда
							ЦенаСписания = ПолучитьЦенуПоследнегоПрихода(Номенклатура, ТекДок.Склад, ТекДок.Дата);
							ЦенаСписания = ?(ЦенаСписания = Неопределено, 0, ЦенаСписания);
						КонецЕсли;
						Если ЦенаСписания = 0 Тогда
							ЦенаСписания = ПолучитьПериодическийРеквизит(Номенклатура, "ЦенаПоследнегоПрихода", ТекДок.Дата);
							ЦенаСписания = ?(ЦенаСписания = Неопределено, 0, ЦенаСписания);			
						КонецЕсли;
						Если ЦенаСписания = 0 Тогда
							ЦенаСписания = ПолучитьЦенуНоменклатуры(Номенклатура,,Константы.РозничныйТипЦен.Получить(),ПараметрыСеанса.ВалютаУпр_2009,КурсУпр,ТекДок.Дата);
							ЦенаСписания = ?(ЦенаСписания = Неопределено, 0, ЦенаСписания);
						КонецЕсли;
						/////////////////////////////////////////////////////
						КэшЦенСписания.Вставить(Номенклатура,ЦенаСписания);
						/////////////////////////////////////////////////////
					Иначе
						ЦенаСписания = 0;
					КонецЕсли; 
					
					ТекКоличество=Мин(НадоСписать,ОперационныйОстаток);
					Если ТекКоличество>0 Тогда			
						ТекСумма = Окр(?(ТекКоличество = СтрокаОстатка.Остаток, СтрокаОстатка.Стоимость, ТекКоличество*СтрокаОстатка.Стоимость/СтрокаОстатка.Остаток),2,1);
						ТекАмортизация = Окр(?(ТекКоличество=СтрокаОстатка.Остаток, СтрокаОстатка.Амортизация, ТекКоличество*СтрокаОстатка.Амортизация/СтрокаОстатка.Остаток),2,1);
						ТекОборот = Окр(Цена*ТекКоличество,2,1);
						ТекОборотБезСкидки = Окр(ЦенаБезСкидки*ТекКоличество,2,1);
						
						СтрокаОстатка.Остаток	=СтрокаОстатка.Остаток	-ТекКоличество;
						
						СтрокаОстатка.Стоимость	=СтрокаОстатка.Стоимость-ТекСумма;
						
						// нечаева  +++
						Если ТекДок.Метаданные().Имя <> "ПродажаИМ" Тогда
							
							////////////////////////////////////////////////////////////////////////////
							// ДВИГАЕМ ОСТАТКИ ТДВО - Таблица остатков
							////////////////////////////////////////////////////////////////////////////
							
							Движение = ТДВО.Добавить();
							
							Движение.Активность		= Истина;
							Движение.ВидДвижения		= ВидДвиженияНакопления.Расход;
							Движение.Период 		= ТекПериод;
							
							Движение.Склад		= СтрокаОстатка.Склад;
							Движение.Номенклатура	= СтрокаТоваров.Номенклатура;					
							
							Если НеСписыватьКоличество Тогда
								Движение.Количество	= 0;					
							Иначе
								Движение.Количество	= ТекКоличество;
							КонецЕсли; 
							//крохин начало
							//По галке "не списывать количество" списываем с остатков всю сумму
							Если НеСписыватьКоличество Тогда
								Движение.Сумма	= СтрокаОстатка.Стоимость+ТекСумма;					
							Иначе
								Движение.Сумма	= ТекСумма;
							КонецЕсли; 
							
							//крохин начало 25.02.2011
							//сертификаты всегда продаём за 0
							Если КодОперации =  Перечисления.КодыОперацийОстатки.Реализация Тогда
								//Если СтрокаТоваров.Номенклатура.Родитель.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.ПодарочныйСертификат Тогда
								Если СтрокаТоваров.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.ПодарочныйСертификат Тогда //Чирков
									//крохин начало 05.04.2011
									//с 1 апреля 2011 года оборота по подарочным сертификатам нет
									Если ТекДок.Дата >= '20110401' Тогда
										ТекОборот = 0;	
										ТекОборотБезСкидки = 0;
									КонецЕсли;
									//крохин конец 05.04.2011
									Если Движение.Сумма <> 0 И Движение.Сумма < 100 Тогда
										//крохин начало 09.03.2011
										//ЗаписатьВЛог("ПродажаСертификатов","Движение.Сумма = "+Движение.Сумма+". ТекСумма = "+ТекСумма+ ".ТекКоличество = "+ТекКоличество+ ".СтрокаОстатка.Стоимость = "+СтрокаОстатка.Стоимость+ ".СтрокаОстатка.Остаток = "+СтрокаОстатка.Остаток+ ". СтрокаОстатка.Резерв "+СтрокаОстатка.Резерв,"Информация",Ложь);
										Попытка
											ЭтоЗагрузка = ТекДок.получитьобъект().ОбменДанными.Загрузка;
										Исключение
											ЭтоЗагрузка = "Ошибка определения загрузки: "+ОписаниеОшибки();
										КонецПопытки;
										
										ЗаписатьВЛог("ПродажаСертификатов","Движение.Сумма = "+Движение.Сумма+". ТекСумма = "+ТекСумма+ ".ТекКоличество = "+ТекКоличество+ ".СтрокаОстатка.Стоимость = "+СтрокаОстатка.Стоимость+ ".СтрокаОстатка.Остаток = "+СтрокаОстатка.Остаток+ ". СтрокаОстатка.Резерв "+СтрокаОстатка.Резерв+ ". Документ: "+ТекДок+ ". Загрузка: "+ЭтоЗагрузка ,"Информация",Ложь);
										//крохин конец 09.03.2011
										Движение.Сумма		= 0;	
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
							//крохин конец 25.02.2011
							
							//крохин начало
							Если ТекДок.Метаданные().Имя = "ОтчетКассовойСмены" И  СтрокаТоваров.Скидка = 100 Тогда
								
								Движение.КодОперации	= Перечисления.КодыОперацийОстатки.Списание;
							иначеЕсли ТекДок.Метаданные().Имя = "ПродажаИМ" Тогда
								Движение.КодОперации	= Перечисления.КодыОперацийОстатки.Перемещение;
							иначе
								
								//крохин начало 29.10.2015
								//Движение.КодОперации	= КодОперации;
								//по упаковке код операции может быть другой
								//Кухарь 31.10.15 начало
								попытка
									//Кухарь 31.10.15 конец
									Если СтрокаТоваров.КодОперации <> Неопределено Тогда
										Движение.КодОперации	= СтрокаТоваров.КодОперации;	
									Иначе
										Движение.КодОперации	= КодОперации;	
									КонецЕсли;
									//Кухарь 31.10.15 начало	 
								Исключение
									Движение.КодОперации	= КодОперации;
								КонецПопытки;
								//Кухарь 31.10.15 конец
								//крохин конец 29.10.2015
							КонецЕсли;
							//крохин конец
							
							Движение.Отправитель	= ?(ПолучательВТЧ,СтрокаТоваров.Получатель,Получатель);
							Движение.Подразделение	= СтрокаТоваров.Подразделение;
							Движение.ПунктДоставки	= ПунктДоставки;
							Движение.ДК			= СтрокаТоваров.ДК;
							
							Движение.ВалютаДокумента= ВалютаДокумента;
							Движение.Амортизация	= ТекАмортизация;
							
							Движение.Оборот		= ТекОборот;
							Движение.ОборотБезСкидки	= ТекОборотБезСкидки;
							
							Движение.ОборотУпр		= Движение.Оборот*КурсУпр;
							Движение.ОборотБезСкидкиУпр	= Движение.ОборотБезСкидки*КурсУпр;			
							
							НадоСписатьЗ=НадоСписать;
							НадоСписать=НадоСписать-ТекКоличество;
							//крохин начало
							//По галке "не списывать количество" списываем с остатков всю сумму
							//СтрокаТоваров.СписанаСтоимость	=СтрокаТоваров.СписанаСтоимость	+ТекСумма;
							Если НеСписыватьКоличество Тогда
								СтрокаТоваров.СписанаСтоимость    = СтрокаОстатка.Стоимость+ТекСумма;
							Иначе
								СтрокаТоваров.СписанаСтоимость	=СтрокаТоваров.СписанаСтоимость	+ТекСумма;
							Конецесли;
							//крохин конец
							
							СтрокаТоваров.Амортизация		= СтрокаТоваров.Амортизация	 + ТекАмортизация;
							
							ОборотПоСтроке			= ОборотПоСтроке - ТекОборот;										
							ОборотПоСтрокеБезСкидки		= ОборотПоСтрокеБезСкидки - ТекОборотБезСкидки;
							
							
						КонецЕсли;	
						// нечаева ---
						
						
						
						
						
						// Нечаева ++++
						Если ТекДок.Метаданные().Имя = "ПродажаИМ" Тогда
							
							// движение перемещения по коммиссионной торговле.
							//**********************************************************************************************
							
							Движение = ТДВО.Добавить();
							
							Движение.Активность		= Истина;
							Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;
							Движение.Период 		= ТекПериод;
							Движение.КодОперации	= Перечисления.КодыОперацийОстатки.Перемещение;
							
							Движение.Склад			= ТекДок.Склад;
							Движение.Номенклатура	= СтрокаТоваров.Номенклатура;					
							
							Если НеСписыватьКоличество Тогда
								Движение.Количество		= 0;					
							Иначе
								Движение.Количество		= ТекКоличество;
							КонецЕсли; 
							//По галке "не списывать количество" списываем с остатков всю сумму
							Если НеСписыватьКоличество Тогда
								Движение.Сумма		= СтрокаОстатка.Стоимость+ТекСумма;					
							Иначе
								Движение.Сумма		= ТекСумма;
							КонецЕсли; 
							
							//сертификаты всегда продаём за 0
							Если КодОперации =  Перечисления.КодыОперацийОстатки.Реализация Тогда
								//Если СтрокаТоваров.Номенклатура.Родитель.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.ПодарочныйСертификат Тогда
								Если СтрокаТоваров.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.ПодарочныйСертификат Тогда //Чирков
									//крохин начало 05.05.2011
									//с 1 апреля 2011 года оборота по подарочным сертификатам нет
									Если ТекДок.Дата >= '20110401' Тогда
										ТекОборот = 0;	
										ТекОборотБезСкидки = 0;
									КонецЕсли;
									//крохин конец 05.05.2011
									Если Движение.Сумма <> 0 И Движение.Сумма < 100 Тогда
										//ЗаписатьВЛог("ПродажаСертификатов","Движение.Сумма = "+Движение.Сумма+". ТекСумма = "+ТекСумма+ ".ТекКоличество = "+ТекКоличество+ ".СтрокаОстатка.Стоимость = "+СтрокаОстатка.Стоимость+ ".СтрокаОстатка.Остаток = "+СтрокаОстатка.Остаток+ ". СтрокаОстатка.Резерв "+СтрокаОстатка.Резерв,"Информация",Ложь);
										попытка
											ЭтоЗагрузка = ТекДок.получитьобъект().ОбменДанными.Загрузка;
										Исключение
											ЭтоЗагрузка = "Ошибка определения загрузки: "+ОписаниеОшибки();
										КонецПопытки;
										
										ЗаписатьВЛог("ПродажаСертификатов","Движение.Сумма = "+Движение.Сумма+". ТекСумма = "+ТекСумма+ ".ТекКоличество = "+ТекКоличество+ ".СтрокаОстатка.Стоимость = "+СтрокаОстатка.Стоимость+ ".СтрокаОстатка.Остаток = "+СтрокаОстатка.Остаток+ ". СтрокаОстатка.Резерв "+СтрокаОстатка.Резерв+ ". Документ: "+ТекДок+ ". Загрузка: "+ЭтоЗагрузка ,"Информация",Ложь);
										Движение.Сумма		= 0;	
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
							
							
							Движение.Отправитель	= ТекДок.ТранзитныйСклад;
							Движение.ПунктДоставки	= Справочники.ПунктыДоставки.НайтиПоКоду("SNL-007263"); // семеновский факт. адрес
							Движение.ВалютаДокумента= ВалютаДокумента;
							Движение.Амортизация	= ТекАмортизация;
							НадоСписать=НадоСписать-ТекКоличество; // вычитаем один раз только
							
							НадоСписатьЗ=НадоСписать; 
							
							//По галке "не списывать количество" списываем с остатков всю сумму
							Если НеСписыватьКоличество Тогда
								СтрокаТоваров.СписанаСтоимость    = СтрокаОстатка.Стоимость+ТекСумма;
							Иначе
								СтрокаТоваров.СписанаСтоимость	=СтрокаТоваров.СписанаСтоимость	+ТекСумма;
							Конецесли;
							
							
							//*************************************************************************************************************************
							// делаем по комиссионной торговле движение.
							Движение = ТДВО.Добавить();
							
							Движение.КодОперации	= Перечисления.КодыОперацийОстатки.Перемещение;
							Движение.Активность		= Истина;
							Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;
							Движение.Период 		= ТекПериод;
							
							Движение.Склад			= ТекДок.ТранзитныйСклад;
							Движение.Номенклатура	= СтрокаТоваров.Номенклатура;					
							
							Если НеСписыватьКоличество Тогда
								Движение.Количество		= 0;					
							Иначе
								Движение.Количество		= ТекКоличество;
							КонецЕсли; 
							//По галке "не списывать количество" списываем с остатков всю сумму
							Если НеСписыватьКоличество Тогда
								Движение.Сумма		= СтрокаОстатка.Стоимость+ТекСумма;					
							Иначе
								Движение.Сумма		= ТекСумма;
							КонецЕсли; 
							
							//сертификаты всегда продаём за 0
							Если КодОперации =  Перечисления.КодыОперацийОстатки.Реализация Тогда
								//Если СтрокаТоваров.Номенклатура.Родитель.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.ПодарочныйСертификат Тогда
								Если СтрокаТоваров.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.ПодарочныйСертификат Тогда //Чирков
									//крохин начало 05.05.2011
									//с 1 апреля 2011 года оборота по подарочным сертификатам нет
									Если ТекДок.Дата >= '20110401' Тогда
										ТекОборот = 0;	
										ТекОборотБезСкидки = 0;
									КонецЕсли;
									//крохин конец 05.05.2011
									Если Движение.Сумма <> 0 И Движение.Сумма < 100 Тогда
										//ЗаписатьВЛог("ПродажаСертификатов","Движение.Сумма = "+Движение.Сумма+". ТекСумма = "+ТекСумма+ ".ТекКоличество = "+ТекКоличество+ ".СтрокаОстатка.Стоимость = "+СтрокаОстатка.Стоимость+ ".СтрокаОстатка.Остаток = "+СтрокаОстатка.Остаток+ ". СтрокаОстатка.Резерв "+СтрокаОстатка.Резерв,"Информация",Ложь);
										попытка
											ЭтоЗагрузка = ТекДок.получитьобъект().ОбменДанными.Загрузка;
										Исключение
											ЭтоЗагрузка = "Ошибка определения загрузки: "+ОписаниеОшибки();
										КонецПопытки;
										
										ЗаписатьВЛог("ПродажаСертификатов","Движение.Сумма = "+Движение.Сумма+". ТекСумма = "+ТекСумма+ ".ТекКоличество = "+ТекКоличество+ ".СтрокаОстатка.Стоимость = "+СтрокаОстатка.Стоимость+ ".СтрокаОстатка.Остаток = "+СтрокаОстатка.Остаток+ ". СтрокаОстатка.Резерв "+СтрокаОстатка.Резерв+ ". Документ: "+ТекДок+ ". Загрузка: "+ЭтоЗагрузка ,"Информация",Ложь);
										Движение.Сумма		= 0;	
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
							
							Движение.Отправитель	= ТекДок.Склад;
							Движение.ВалютаДокумента= ВалютаДокумента;
							
							//По галке "не списывать количество" списываем с остатков всю сумму
							Если НеСписыватьКоличество Тогда
								СтрокаТоваров.СписанаСтоимость = СтрокаОстатка.Стоимость+ТекСумма;
							Иначе
								СтрокаТоваров.СписанаСтоимость = СтрокаТоваров.СписанаСтоимость	+ТекСумма;
							Конецесли;
							
							СтрокаТоваров.Амортизация = СтрокаТоваров.Амортизация		+ТекАмортизация;
							ОборотПоСтроке			= ОборотПоСтроке			-ТекОборот;										
							ОборотПоСтрокеБезСкидки	= ОборотПоСтрокеБезСкидки-ТекОборотБезСкидки;
							
							
							//*************************************************************************************************************************
							Если ТекДок.СостояниеНакладной=Перечисления.СостоянияНакладной.Доставлена Тогда
								
								// делаем продажу по коммисионной торговле.
								Движение = ТДВО.Добавить();
								
								Движение.КодОперации	= Перечисления.КодыОперацийОстатки.Реализация;
								Движение.Активность		= Истина;
								Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;
								Движение.Период 		= ТекПериод;
								
								Движение.Склад			= ТекДок.ТранзитныйСклад;
								Движение.Номенклатура	= СтрокаТоваров.Номенклатура;					
								
								Если НеСписыватьКоличество Тогда
									Движение.Количество		= 0;					
								Иначе
									Движение.Количество		= ТекКоличество;
								КонецЕсли; 
								
								//По галке "не списывать количество" списываем с остатков всю сумму
								Если НеСписыватьКоличество Тогда
									Движение.Сумма		= СтрокаОстатка.Стоимость+ТекСумма;					
								Иначе
									Движение.Сумма		= ТекСумма;
								КонецЕсли; 
								
								//сертификаты всегда продаём за 0
								Если КодОперации =  Перечисления.КодыОперацийОстатки.Реализация Тогда
									Если СтрокаТоваров.Номенклатура.Родитель.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.ПодарочныйСертификат Тогда
										//крохин начало 05.05.2011
										//с 1 апреля 2011 года оборота по подарочным сертификатам нет
										Если ТекДок.Дата >= '20110401' Тогда
											ТекОборот = 0;	
											ТекОборотБезСкидки = 0;
										КонецЕсли;
										//крохин конец 05.05.2011
										Если Движение.Сумма <> 0 И Движение.Сумма < 100 Тогда
											//ЗаписатьВЛог("ПродажаСертификатов","Движение.Сумма = "+Движение.Сумма+". ТекСумма = "+ТекСумма+ ".ТекКоличество = "+ТекКоличество+ ".СтрокаОстатка.Стоимость = "+СтрокаОстатка.Стоимость+ ".СтрокаОстатка.Остаток = "+СтрокаОстатка.Остаток+ ". СтрокаОстатка.Резерв "+СтрокаОстатка.Резерв,"Информация",Ложь);
											попытка
												ЭтоЗагрузка = ТекДок.получитьобъект().ОбменДанными.Загрузка;
											Исключение
												ЭтоЗагрузка = "Ошибка определения загрузки: "+ОписаниеОшибки();
											КонецПопытки;
											
											ЗаписатьВЛог("ПродажаСертификатов","Движение.Сумма = "+Движение.Сумма+". ТекСумма = "+ТекСумма+ ".ТекКоличество = "+ТекКоличество+ ".СтрокаОстатка.Стоимость = "+СтрокаОстатка.Стоимость+ ".СтрокаОстатка.Остаток = "+СтрокаОстатка.Остаток+ ". СтрокаОстатка.Резерв "+СтрокаОстатка.Резерв+ ". Документ: "+ТекДок+ ". Загрузка: "+ЭтоЗагрузка ,"Информация",Ложь);
											Движение.Сумма		= 0;	
										КонецЕсли;
									КонецЕсли;
								КонецЕсли;
								
								
								Движение.Отправитель	= ?(ПолучательВТЧ,СтрокаТоваров.Получатель,Получатель);
								Движение.Подразделение	= СтрокаТоваров.Подразделение;
								Движение.ПунктДоставки	= ПунктДоставки;
								Движение.ДК				= СтрокаТоваров.ДК;
								
								Движение.ВалютаДокумента= ВалютаДокумента;
								Движение.Амортизация	= ТекАмортизация;
								
								Движение.Оборот			= ТекОборот;
								Движение.ОборотБезСкидки= ТекОборотБезСкидки;
								
								Движение.ОборотУпр			= Движение.Оборот*КурсУпр;
								Движение.ОборотБезСкидкиУпр	= Движение.ОборотБезСкидки*КурсУпр;			
								
								//По галке "не списывать количество" списываем с остатков всю сумму
								Если НеСписыватьКоличество Тогда
									СтрокаТоваров.СписанаСтоимость    = СтрокаОстатка.Стоимость+ТекСумма;
								Иначе
									СтрокаТоваров.СписанаСтоимость	=СтрокаТоваров.СписанаСтоимость	+ТекСумма;
								Конецесли;
								
								СтрокаТоваров.Амортизация		=СтрокаТоваров.Амортизация		+ТекАмортизация;
								ОборотПоСтроке			=ОборотПоСтроке			-ТекОборот;										
								ОборотПоСтрокеБезСкидки	=ОборотПоСтрокеБезСкидки-ТекОборотБезСкидки;
								
								
							КонецЕсли;
							
						КонецЕсли;
						// Нечаева ----
						
						
					КонецЕсли;
					
					
				КонецЦикла; 
				
				Если НадоСписать<>0 Тогда				
					ЗаписатьВТаблицуОшибок(ТО,ТекДок,"Недостаточно товара",Товары.Индекс(СтрокаТоваров),СтрокаТоваров,Остаток,Резерв);
					
					ТекПодразделение=СтрокаТоваров.Склад.Подразделение;					
					Если 1=2 Тогда
						ТекПодразделение=Справочники.Подразделения.ПустаяСсылка();											
					КонецЕсли; 
					
					Если ТекПодразделение.ВидПодразделения<>Перечисления.ВидыПодразделений.Франчайзинг И ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
						НулевыеСуммы = Истина;
					Иначе
						НулевыеСуммы = Ложь;						
					КонецЕсли; 
					//---Чирков
					
					Результат=-1;
					
					/////////////////////////////////////////////////////////////////////////////////
					Если ЦенаСписания = Неопределено Тогда
						ЦенаСписания = КэшЦенСписания.Получить(Номенклатура);
					КонецЕсли;					
					Если ЦенаСписания = Неопределено Тогда
						// Кухарь А.Ю.  14.03.2024 начало
						Если Загрузка тогда
							ЦенаСписания=0;
						иначе	
							ЦенаСписания=ПолучитьЦенуПрихода(СтрокаТоваров.Номенклатура,СтрокаТоваров.Склад,ТекДок.Дата);
						КонецЕсли;
						// Кухарь А.Ю.  14.03.2024 конец
						
					КонецЕсли;					
					Если ЦенаСписания=Неопределено Тогда
						ЗаписатьВТаблицуОшибок(ТО,ТекДок,"Невозможно определить цену списания",Товары.Индекс(СтрокаТоваров),СтрокаТоваров);
						
						ТекСумма=0;
					Иначе
						ТекСумма = НадоСписать * ЦенаСписания;
					КонецЕсли;
					/////////////////////////////////////////////////////////////////////////////////
					
					Движение = ТДВО.Добавить();
					
					Движение.Активность		= Истина;
					Движение.ВидДвижения		= ВидДвиженияНакопления.Расход;
					
					Движение.Период 		= ТекПериод;
					
					Движение.Склад		= СтрокаТоваров.Склад;
					Движение.Номенклатура	= СтрокаТоваров.Номенклатура;				
					
					Если НеСписыватьКоличество Тогда
						Движение.Количество	= 0;					
					Иначе
						Движение.Количество	= НадоСписать;				
					КонецЕсли;
					
					//+++Чирков - не нужны суммы по франчам и в розничных подразделениях 21.01.13
					Если НулевыеСуммы Тогда
						ТекСумма=0;					
					КонецЕсли; 
					//---Чирков
					
					//крохин начало
					//По галке "не списывать количество" списываем с остатков всю сумму
					//Движение.Сумма 			= ТекСумма;
					Если НеСписыватьКоличество Тогда
						Движение.Сумма		= 0;					
					Иначе
						Движение.Сумма		= ТекСумма;
					КонецЕсли; 
					//крохин конец
					
					
					
					//крохин начало
					Если ТекДок.Метаданные().Имя = "ОтчетКассовойСмены" И  СтрокаТоваров.Скидка = 100 Тогда
						Движение.КодОперации	= Перечисления.КодыОперацийОстатки.Списание;
					иначе
						//крохин начало 29.10.2015
						//Движение.КодОперации	= КодОперации;
						//по упаковке код операции может быть другой
						//крохин 16.11.2015 - добавил попытку на всякий случай
						попытка
							Если СтрокаТоваров.КодОперации <> Неопределено Тогда
								Движение.КодОперации	= СтрокаТоваров.КодОперации;	
							Иначе
								Движение.КодОперации	= КодОперации;	
							КонецЕсли;
						исключение
							Движение.КодОперации	= КодОперации;
						конецпопытки
						//крохин конец 29.10.2015
					КонецЕсли;
					//крохин конец	
					Движение.Отправитель	= ?(ПолучательВТЧ,СтрокаТоваров.Получатель,Получатель);
					Движение.Подразделение	= СтрокаТоваров.Подразделение;
					Движение.ПунктДоставки	= ПунктДоставки;
					Движение.ДК				= СтрокаТоваров.ДК;
					
					Движение.ВалютаДокумента= ВалютаДокумента;
					
					Движение.Оборот			= ОборотПоСтроке;
					Движение.ОборотБезСкидки= ОборотПоСтрокеБезСкидки;				
					
					Движение.ОборотУпр			= Движение.Оборот*КурсУпр;
					Движение.ОборотБезСкидкиУпр	= Движение.ОборотБезСкидки*КурсУпр;
					
					СтрокаТоваров.СписанаСтоимость=СтрокаТоваров.СписанаСтоимость+ТекСумма;		
				КонецЕсли;
			Иначе
				Движение = ТДВО.Добавить();
				
				Движение.Активность		= Истина;
				Движение.ВидДвижения		= ВидДвиженияНакопления.Расход;
				
				Движение.Период 		= ТекПериод;
				
				Движение.Склад		= СтрокаТоваров.Склад;
				Движение.Номенклатура	= СтрокаТоваров.Номенклатура;				
				
				Если НеСписыватьКоличество Тогда
					Движение.Количество	= 0;					
				Иначе
					Движение.Количество	= НадоСписать;				
				КонецЕсли;
				
				Движение.Сумма 		= СтрокаТоваров.СписанаСтоимость;
				
				
				//крохин начало
				
				//крохин начало 22.01.2022
				//всё по нулевой  стоимости списывается, а не только товар со скидкой 100%
				//Если ТекДок.Метаданные().Имя = "ОтчетКассовойСмены" И  СтрокаТоваров.Скидка = 100 Тогда
				//	Движение.КодОперации	= Перечисления.КодыОперацийОстатки.Списание;
				Если ТекДок.Метаданные().Имя = "ОтчетКассовойСмены" Тогда
					Если ТекДок.Дата >= '20221201' Тогда
						Если  СтрокаТоваров.Всего = 0 Тогда
							Движение.КодОперации	= Перечисления.КодыОперацийОстатки.Списание;
						КонецЕсли;
					Иначе
						Если  СтрокаТоваров.Скидка = 100 Тогда
							Движение.КодОперации	= Перечисления.КодыОперацийОстатки.Списание;
						КонецЕсли;
					КонецЕсли;
					//крохин конец 22.01.2022
				иначе
					//крохин начало 29.10.2015
					//Движение.КодОперации	= КодОперации;
					//по упаковке код операции может быть другой
					Если СтрокаТоваров.КодОперации <> Неопределено Тогда
						Движение.КодОперации	= СтрокаТоваров.КодОперации;	
					Иначе
						Движение.КодОперации	= КодОперации;	
					КонецЕсли;
					//крохин конец 29.10.2015
				КонецЕсли;
				//крохин конец		
				
				
				
				Движение.Отправитель	= Получатель;
				Движение.Подразделение	= СтрокаТоваров.Подразделение;
				Движение.ПунктДоставки	= ПунктДоставки;
				
				Движение.ВалютаДокумента	= ВалютаДокумента;
				
				Движение.Оборот		= ОборотПоСтроке;
				Движение.ОборотБезСкидки	= ОборотПоСтрокеБезСкидки;				
				
				Движение.ОборотУпр		= Движение.Оборот*КурсУпр;
				Движение.ОборотБезСкидкиУпр	= Движение.ОборотБезСкидки*КурсУпр;			
				
				Движение.Амортизация		= СтрокаТоваров.Амортизация;
				
				//крохин начало 08.12.2020
				//для отчетов комиссионера минусовые строки оформляем как возврат
				//крохин начало 12.04.2021
				//	Если ТекДок.Метаданные().Имя = "ОтчетКомиссионера" Тогда
				Если (МетаДокИмя = "ОтчетКомиссионера" ИЛИ МетаДокИмя = "Претензия") Тогда
					//крохин конец 12.04.2021 
					
					Если НадоСписать < 0 Тогда
						
						Если СтрокаТоваров.СписанаСтоимость = 0 Тогда
							СтрокаТОМинусов = ТОминусов.Найти(СтрокаТоваров.Номенклатура);
							Если СтрокаТОМинусов <> Неопределено И СтрокаТОМинусов.Количество <> 0 Тогда
								СписанаСтоимость = СтрокаТОМинусов.Стоимость/СтрокаТОМинусов.Количество;
							Иначе
								СписанаСтоимость = 0;
							КонецЕсли;
							//крохин начало 04.12.2024
							//HELP-1854
							//		ИначеЕсли ТекДок.Дата >= '20241101' Тогда
							Если СписанаСтоимость = 0 И ТекДок.Дата >= '20240101' Тогда
								СписанаСтоимость = 0;
								Если ЕстьРеквизитДокумента("Склад", МетаДок) Тогда
									СписанаСтоимость = ПолучитьЦенуПоследнегоПрихода(СтрокаТоваров.Номенклатура, ТекДок.Склад, ТекДок.Дата);
									СписанаСтоимость = ?(СписанаСтоимость = Неопределено, 0, СписанаСтоимость);
								КонецЕсли;
								Если СписанаСтоимость = 0 Тогда
									СписанаСтоимость = ПолучитьПериодическийРеквизит(СтрокаТоваров.Номенклатура, "ЦенаПоследнегоПрихода", ТекДок.Дата);
									СписанаСтоимость = ?(СписанаСтоимость = Неопределено, 0, СписанаСтоимость);			
								КонецЕсли;
								Если СписанаСтоимость = 0 Тогда
									СписанаСтоимость = ПолучитьЦенуНоменклатуры(СтрокаТоваров.Номенклатура,,Константы.РозничныйТипЦен.Получить(),ПараметрыСеанса.ВалютаУпр_2009,КурсУпр,ТекДок.Дата);
									СписанаСтоимость = ?(СписанаСтоимость = Неопределено, 0, СписанаСтоимость);
								КонецЕсли;
							КонецЕсли;
							//крохин конец 04.12.2024
						Иначе
							СписанаСтоимость = СтрокаТоваров.СписанаСтоимость; 
						КонецЕсли;
						
						ОборотПоСтроке  		= СтрокаТоваров.Оборот;		
						ОборотПоСтрокеБезСкидки 	= СтрокаТоваров.ОборотБезСкидки;
						
						ОборотПоСтрокеУпр  		= СтрокаТоваров.ОборотУпр;		
						ОборотПоСтрокеБезСкидкиУпр	= СтрокаТоваров.ОборотБезСкидкиУпр;
						
						Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;
						Движение.Количество		= -НадоСписать;
						// Кухарь А.Ю.  27.12.2022 начало
						//У ПРТ был неправильный код операции. По согласованию с Сибилёвым и Колобковым, внёс изменения и перепровёл неправильные ПРТ с 02.03.2021 23:59:59
						//Движение.КодОперации = перечисления.КодыОперацийОстатки.ВозвратОтПокупателя;
						если МетаДокИмя="Претензия" тогда
							Движение.КодОперации = перечисления.КодыОперацийОстатки.Комиссия;
						иначе
							Движение.КодОперации = перечисления.КодыОперацийОстатки.ВозвратОтПокупателя;
						КонецЕсли;						 
						// Кухарь А.Ю.  27.12.2022 конец
						
						// Кухарь А.Ю.  12.04.2023 начало
						Если  ТекПериод>='20230301' тогда
							Движение.Сумма = СписанаСтоимость * Движение.Количество;
						иначе
							Движение.Сумма = СписанаСтоимость;
						КонецЕсли;
						// Кухарь А.Ю.  12.04.2023 конец
						
						Движение.Оборот			= ОборотПоСтроке;
						Движение.ОборотБезСкидки= ОборотПоСтрокеБезСкидки;				
						
						Движение.ОборотУпр			= Движение.Оборот*КурсУпр;
						Движение.ОборотБезСкидкиУпр	= Движение.ОборотБезСкидки*КурсУпр;	
					КонецЕсли;
				КонецЕсли;
				//крохин конец 08.12.2020
				
			КонецЕсли;			
		КонецЕсли; 
		
		//крохин начало 12.01.2021
		//для РНК нужен флаг "акция"
		ВидНакладной = ТекДок.Метаданные().Имя;
		Если ВидНакладной = "РасходнаяНакладная" И КодОперации = Перечисления.КодыОперацийОстатки.Реализация Тогда
			Движение.Акция = СтрокаТоваров.Акция;	
		КонецЕсли;				
		//крохин конец 12.01.2021
		
	КонецЦикла; 
	
	Если (ТекДок.Метаданные().Имя = "РасходнаяНакладная" И КодОперации = Перечисления.КодыОперацийОстатки.Комиссия) Тогда
		Для Каждого СтрокаТЧ Из ТДВО Цикл
			
			СтрокаТЧ.Оборот = 0;
			СтрокаТЧ.ОборотБезСкидки = 0;
			СтрокаТЧ.ОборотУпр = 0;
			СтрокаТЧ.ОборотБезСкидкиУпр = 0;
			//крохин конец 15.07.2020
		КонецЦикла;
	КонецЕсли;
	//крохин конец 05.05.2020
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область Остатки

Функция ПроведениеПоРегистрамОстатков(ДокументСсылка,Движения,Загрузка=Ложь,ТаблицаСписания=Неопределено) Экспорт	
	РезультатПроведения	=ПровестиПоОстаткам(ДокументСсылка,Движения,Загрузка,ТаблицаСписания);	
	Возврат РезультатПроведения;		
КонецФункции
#КонецОбласти


#Область ОстаткиКомиссия

Функция ПроведениеПоРегиструОстаткиТМЦКомиссия(ДокументСсылка,Движения) Экспорт
	РезультатПроведения	=ПровестиПоОстаткамТМЦКомиссия(ДокументСсылка,Движения);	
	Возврат РезультатПроведения;		
КонецФункции

Функция ПровестиПоОстаткамТМЦКомиссия(Документ,Движения) Экспорт
	Если ПараметрыСеанса.ТипУзла <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		ТДВ=СоздатьТаблицуДвижений("ОстаткиТМЦКомиссия");
		Движения=Новый Структура("ОстаткиТМЦКомиссия",ТДВ);
		Возврат 1;	
	КонецЕсли;
	
	ТекВид=Документ.Метаданные().Имя;	
	ТекДок = Документ;
	
	ДатаДокумента=ТекДок.Дата;
	
	#Если Клиент Тогда
		Состояние(""+ТекВид+" "+ТекДок.Номер+" "+ТекДок.Дата);
	#КонецЕсли
	ТДВ=СоздатьТаблицуДвижений("ОстаткиТМЦКомиссия");
	
	Если ТекВид = "РасходнаяНакладная" Тогда
		
		// Шворобей ВЮ 05.03.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-689
		Если ТекДок.КодОперации = Перечисления.КодыОперацийОстатки.Реализация И ТекДок.Склад.ТипСклада = Перечисления.ТипСклада.КомиссионныйСклад Тогда
			ТО = ПолучитьОстаткиТМЦКомиссия(ТекДок, Ложь);
		Иначе
			ТО = Неопределено;
		КонецЕсли;
		
		Если ТекДок.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия Тогда
		
			Для Каждого СтрокаТЧ Из ТекДок.Товары Цикл
				
				Если СтрокаТЧ.Количество = 0 Тогда 
					Продолжить;
				КонецЕсли;
				
				Запись = ТДВ.Добавить();
				Запись.Активность = Истина;
				Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
				Запись.Период = ТекДок.Дата;
				Запись.Склад = ТекДок.СкладКомиссия;
				Запись.Номенклатура = СтрокаТЧ.номенклатура;
				Запись.Количество = СтрокаТЧ.Количество;
				Запись.Сумма = СтрокаТЧ.Всего;
				Запись.Контрагент = ТекДок.Контрагент;
				Запись.ПунктДоставки = ТекДок.ПунктДоставки;
				Запись.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ТекДок.КодОперации = Перечисления.КодыОперацийОстатки.Реализация
			И ТекДок.Склад.ТипСклада = Перечисления.ТипСклада.КомиссионныйСклад
			И ТО <> Неопределено Тогда
				
			Для Каждого СтрокаТЧ Из ТекДок.Товары Цикл
				
				Если СтрокаТЧ.Количество = 0 Тогда 
					Продолжить;
				КонецЕсли;
				
				Запись = ТДВ.Добавить();
				Запись.Активность = Истина;
				Запись.ВидДвижения = ВидДвиженияНакопления.Расход;
				Запись.Период = ТекДок.Дата;
				Запись.Склад = ТекДок.Склад;
				Запись.Номенклатура = СтрокаТЧ.Номенклатура;
				Запись.Количество = СтрокаТЧ.Количество;
				
				ТекОстатки = ТО.НайтиСтроки(Новый Структура("Номенклатура",СтрокаТЧ.Номенклатура));				
				Количество = 0; Стоимость = 0;		
				Для Каждого СтрокаОстатка Из ТекОстатки Цикл					
					Количество =Количество + СтрокаОстатка.Остаток;
					Стоимость = Стоимость + СтрокаОстатка.Стоимость;					
				КонецЦикла;							
				ЦенаСписания = ?(Количество = 0, 0, Стоимость / Количество);
			
				Если ЦенаСписания = 0 Тогда
					ЦенаСписания = СтрокаТЧ.Цена;	
				КонецЕсли;
				Запись.Сумма = СтрокаТЧ.Количество * ЦенаСписания;
				
				Запись.Контрагент = ТекДок.Контрагент;
				Запись.ПунктДоставки = ТекДок.ПунктДоставки;
				Запись.КодОперации = Перечисления.КодыОперацийОстатки.Реализация;

			КонецЦикла;
			
		КонецЕсли;
		// Шворобей ВЮ 05.03.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-689
		
	ИначеЕсли ТекВид = "РекламационнаяНакладная" Тогда
		Для Каждого СтрокаТЧ Из ТекДок.Товары Цикл
			Если СтрокаТЧ.Количество = 0 Тогда 
				Продолжить;
			КонецЕсли;
			Запись = ТДВ.Добавить();
			Запись.Активность = Истина;
			Если СтрокаТЧ.Количество > 0 Тогда
				Запись.ВидДвижения = ВидДвиженияНакопления.Расход;
				Запись.Количество = СтрокаТЧ.Количество;
				Запись.Сумма = строкаТЧ.Всего;
			Иначе
				Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
				Запись.Количество = -СтрокаТЧ.Количество;
				Запись.Сумма = -строкаТЧ.Всего;
			КонецЕсли;
			Запись.Период = ТекДок.Дата;
			Запись.Склад = ТекДок.СкладКомиссия;
			Запись.Номенклатура = СтрокаТЧ.номенклатура;
			Запись.Контрагент = ТекДок.Корреспондент;
			Запись.ПунктДоставки = ТекДок.ПунктДоставки;
			Запись.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия;
		КонецЦикла;
		
	ИначеЕсли ТекВид = "ОтчетКомиссионера" Тогда
		ТО = ПолучитьОстаткиТМЦКомиссия(ТекДок,Ложь);
		Для Каждого СтрокаТЧ Из ТекДок.Товары Цикл
			Если СтрокаТЧ.Количество = 0 Тогда 
				Продолжить;
			КонецЕсли;
			Запись = ТДВ.Добавить();
			Запись.Активность = Истина;
			//крохин начало 07.12.2020
			//Запись.ВидДвижения = ВидДвиженияНакопления.Расход;
			Если СтрокаТЧ.Количество > 0 Тогда
				Запись.ВидДвижения = ВидДвиженияНакопления.Расход;
			Иначе
				Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
			КонецЕсли;
			//крохин конец 07.12.2020
			Запись.Период = ТекДок.Дата;
			Запись.Склад = ТекДок.Склад;
			Запись.Номенклатура = СтрокаТЧ.номенклатура;
			
			//крохин начало 07.12.2020
			//Запись.Количество = СтрокаТЧ.Количество;
			Если СтрокаТЧ.Количество > 0 Тогда
				Запись.Количество = СтрокаТЧ.Количество;
			Иначе
				Запись.Количество = -СтрокаТЧ.Количество;
			КонецЕсли;
			//крохин конец 07.12.2020
			
			// Кухарь А.Ю. 18.06.2020 начало
			// Иногда цена списания в эксельке
			если ЗначениеЗаполнено(СтрокаТЧ.ЦенаПередачи) тогда
				ЦенаСписания=СтрокаТЧ.ЦенаПередачи;
			Иначе 
				// Кухарь А.Ю. 18.06.2020 конец
				
				ТекОстатки		=ТО.НайтиСтроки(Новый Структура("Номенклатура",СтрокаТЧ.Номенклатура));				
				Количество=0;	Стоимость=0;		
				Для Каждого СтрокаОстатка Из ТекОстатки Цикл					
					Количество  =Количество	+СтрокаОстатка.Остаток;
					Стоимость	=Стоимость	+СтрокаОстатка.Стоимость;					
				КонецЦикла;							
				ЦенаСписания=?(Количество=0,0,Стоимость/Количество);	
				// Кухарь А.Ю. 18.06.2020 начало
				// Иногда цена списания в эксельке
			КонецЕсли;
			// Кухарь А.Ю. 18.06.2020 конец
			
			
			//крохин начало 07.12.2020
			//Запись.ВидДвижения = ВидДвиженияНакопления.Расход;
			Если СтрокаТЧ.Количество > 0 Тогда
				Запись.Сумма = СтрокаТЧ.Количество*ЦенаСписания;
			Иначе
				Запись.Сумма = -СтрокаТЧ.Количество*ЦенаСписания;
			КонецЕсли;
			//крохин конец 07.12.2020
			Запись.Контрагент = ТекДок.Контрагент;
			Запись.ПунктДоставки = ТекДок.ПунктДоставки;
			Запись.КодОперации = Перечисления.КодыОперацийОстатки.Реализация;
			
			Запись.Оборот = СтрокаТЧ.Всего;
			//крохин начало 07.12.2020
			//Запись.Оборот = СтрокаТЧ.Всего;
			//Запись.ТранспортныеРасходы = СтрокаТЧ.ТранспортныеРасходы;
			//Запись.КомиссионныеРасходы = СтрокаТЧ.КомиссионныеРасходы;
			//Запись.ПрочиеРасходы = СтрокаТЧ.ПрочиеРасходы;
			
			Если СтрокаТЧ.Количество > 0 Тогда
				Запись.Оборот = СтрокаТЧ.Всего;
				Запись.ТранспортныеРасходы = СтрокаТЧ.ТранспортныеРасходы;
				Запись.КомиссионныеРасходы = СтрокаТЧ.КомиссионныеРасходы;
				Запись.ПрочиеРасходы = СтрокаТЧ.ПрочиеРасходы;
			Иначе
				Запись.Оборот = -СтрокаТЧ.Всего;
				Запись.ТранспортныеРасходы = -СтрокаТЧ.ТранспортныеРасходы;
				Запись.КомиссионныеРасходы = -СтрокаТЧ.КомиссионныеРасходы;
				Запись.ПрочиеРасходы       = -СтрокаТЧ.ПрочиеРасходы;
				
			КонецЕсли;
			//крохин конец 07.12.2020
			
			Запись.периодОтчета = ТекДок.ПериодОтчета;
			
		КонецЦикла;
	ИначеЕсли ТекВид = "ПриходнаяНакладная" Тогда
		
		// Шворобей ВЮ 05.03.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-689
		Если ТекДок.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия Тогда
			
			Для Каждого СтрокаТЧ Из ТекДок.Товары Цикл
				
				Если СтрокаТЧ.Количество = 0 Тогда 
					Продолжить;
				КонецЕсли;
				
				Запись = ТДВ.Добавить();
				Запись.Активность = Истина;
				Запись.ВидДвижения = ВидДвиженияНакопления.Расход;
				Запись.Период = ТекДок.Дата;
				Запись.Склад = ТекДок.СкладКомиссия;
				Запись.Номенклатура = СтрокаТЧ.Номенклатура;
				Запись.Количество = СтрокаТЧ.Количество;
				Запись.Сумма = СтрокаТЧ.Всего;
				Запись.Контрагент = ТекДок.Контрагент;
				Запись.ПунктДоставки = ТекДок.ПунктДоставки;
				Запись.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ТекДок.КодОперации = Перечисления.КодыОперацийОстатки.ЗакупкаР
			И ТекДок.Склад.ТипСклада = Перечисления.ТипСклада.КомиссионныйСклад Тогда
			
			Для Каждого СтрокаТЧ Из ТекДок.Товары Цикл
				
				Если СтрокаТЧ.Количество = 0 Тогда 
					Продолжить;
				КонецЕсли;
				
				Запись = ТДВ.Добавить();
				Запись.Активность = Истина;
				Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
				Запись.Период = ТекДок.Дата;
				Запись.Склад = ТекДок.Склад;
				Запись.Номенклатура = СтрокаТЧ.Номенклатура;
				Запись.Количество = СтрокаТЧ.Количество;
				Запись.Сумма = СтрокаТЧ.Всего;
				Запись.Контрагент = ТекДок.Контрагент;
				Запись.ПунктДоставки = ТекДок.ПунктДоставки;
				Запись.КодОперации = Перечисления.КодыОперацийОстатки.ЗакупкаР;
				
			КонецЦикла;
			
		КонецЕсли;
		// Шворобей ВЮ 05.03.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-689
		
	ИначеЕсли ТекВид = "ОприходованиеТМЦ" Тогда
		ТО = ПолучитьОстаткиТМЦКомиссия(ТекДок,Ложь);
		ПараметрыСкладаКомиссионера = ОпределитьПараметрыСкладаКомиссионера(ТекДок.Склад);
		Для Каждого СтрокаТЧ Из ТекДок.Товары Цикл
			Если СтрокаТЧ.Количество = 0 Тогда 
				Продолжить;
			КонецЕсли;
			Запись = ТДВ.Добавить();
			Запись.Активность = Истина;
			Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
			Запись.Период = ТекДок.Дата;
			Запись.Склад = ТекДок.Склад;
			Запись.Номенклатура = СтрокаТЧ.номенклатура;
			
			Запись.Количество = СтрокаТЧ.Количество;
			ТекОстатки		=ТО.НайтиСтроки(Новый Структура("Номенклатура",СтрокаТЧ.Номенклатура));				
			Количество=0;	Стоимость=0;		
			Для Каждого СтрокаОстатка Из ТекОстатки Цикл					
				Количество  =Количество	+СтрокаОстатка.Остаток;
				Стоимость	=Стоимость	+СтрокаОстатка.Стоимость;					
			КонецЦикла;							
			ЦенаСписания=?(Количество=0,0,Стоимость/Количество);
			
			
			Если ЦенаСписания = 0 Тогда
				ЦенаСписания = строкаТЧ.Цена;	
			КонецЕсли;
			
			Запись.Сумма = СтрокаТЧ.Количество*ЦенаСписания;
			
			
			Запись.Контрагент = ПараметрыСкладаКомиссионера.Контрагент;
			Запись.ПунктДоставки = ПараметрыСкладаКомиссионера.ПунктДоставки;
			
			Запись.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия;
			
			//крохин начало 12.04.2021
			//Запись.Оборот = СтрокаТЧ.Всего;
			Запись.Оборот = 0;
			//крохин конец 12.04.2021
		КонецЦикла;	
	ИначеЕсли ТекВид = "СписаниеТМЦ" Тогда
		ТО = ПолучитьОстаткиТМЦКомиссия(ТекДок,Ложь);
		ПараметрыСкладаКомиссионера = ОпределитьПараметрыСкладаКомиссионера(ТекДок.Склад);
		Для Каждого СтрокаТЧ Из ТекДок.Товары Цикл
			Если СтрокаТЧ.Количество = 0 Тогда 
				Продолжить;
			КонецЕсли;
			Запись = ТДВ.Добавить();
			Запись.Активность = Истина;
			Запись.ВидДвижения = ВидДвиженияНакопления.Расход;
			Запись.Период = ТекДок.Дата;
			Запись.Склад = ТекДок.Склад;
			Запись.Номенклатура = СтрокаТЧ.номенклатура;
			
			Запись.Количество = СтрокаТЧ.Количество;
			ТекОстатки		=ТО.НайтиСтроки(Новый Структура("Номенклатура",СтрокаТЧ.Номенклатура));				
			Количество=0;	Стоимость=0;		
			Для Каждого СтрокаОстатка Из ТекОстатки Цикл					
				Количество  =Количество	+СтрокаОстатка.Остаток;
				Стоимость	=Стоимость	+СтрокаОстатка.Стоимость;					
			КонецЦикла;							
			ЦенаСписания=?(Количество=0,0,Стоимость/Количество);
			
			
			Если ЦенаСписания = 0 Тогда
				ЦенаСписания = строкаТЧ.Цена;	
			КонецЕсли;
			
			Запись.Сумма = СтрокаТЧ.Количество*ЦенаСписания;
			
			
			Запись.Контрагент = ПараметрыСкладаКомиссионера.Контрагент;
			Запись.ПунктДоставки = ПараметрыСкладаКомиссионера.ПунктДоставки;
			
			Запись.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия;
			
			//крохин начало 12.04.2021
			//Запись.Оборот = СтрокаТЧ.Всего;
			Запись.Оборот = 0;
			//крохин конец 12.04.2021
		КонецЦикла;
		//крохин конец 29.12.2020
		
		//крохин начало 12.04.2021
	ИначеЕсли ТекВид = "Претензия" Тогда
		ТО = ПолучитьОстаткиТМЦКомиссия(ТекДок,Ложь,ТекДок.ДокОснование.СкладКомиссия);
		ПараметрыСкладаКомиссионера = ОпределитьПараметрыСкладаКомиссионера(ТекДок.Склад);
		Для Каждого СтрокаТЧ Из ТекДок.Товары Цикл
			Если СтрокаТЧ.Количество = 0 Тогда 
				Продолжить;
			КонецЕсли;
			Запись = ТДВ.Добавить();
			Запись.Активность = Истина;
			//крохин начало 12.04.2021
			//Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
			Если  СтрокаТЧ.Количество > 0 Тогда
				Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
			Иначе
				Запись.ВидДвижения = ВидДвиженияНакопления.Расход;
			КонецЕсли;
			//крохин конец 12.04.2021
			Запись.Период = ТекДок.Дата;
			Запись.Склад = ТекДок.Склад;
			Запись.Номенклатура = СтрокаТЧ.номенклатура;
			
			
			//крохин начало 12.04.2021
			//Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
			Если  СтрокаТЧ.Количество > 0 Тогда
				Запись.Количество = СтрокаТЧ.Количество;
			Иначе
				Запись.Количество = - СтрокаТЧ.Количество;
			КонецЕсли;
			//крохин конец 12.04.2021
			ТекОстатки		=ТО.НайтиСтроки(Новый Структура("Номенклатура",СтрокаТЧ.Номенклатура));				
			Количество=0;	Стоимость=0;		
			Для Каждого СтрокаОстатка Из ТекОстатки Цикл					
				Количество  =Количество	+СтрокаОстатка.Остаток;
				Стоимость	=Стоимость	+СтрокаОстатка.Стоимость;					
			КонецЦикла;							
			ЦенаСписания=?(Количество=0,0,Стоимость/Количество);
			
			
			Если ЦенаСписания = 0 Тогда
				ЦенаСписания = строкаТЧ.Цена;	
			КонецЕсли;
			
			
			//крохин начало 12.04.2021
			//Запись.Сумма = СтрокаТЧ.Количество*ЦенаСписания;
			Если  СтрокаТЧ.Количество > 0 Тогда
				Запись.Сумма = СтрокаТЧ.Количество*ЦенаСписания;
			Иначе
				Запись.Сумма = -СтрокаТЧ.Количество*ЦенаСписания;
			КонецЕсли;
			//крохин конец 12.04.2021
			
			
			Запись.Контрагент = ПараметрыСкладаКомиссионера.Контрагент;
			Запись.ПунктДоставки = ПараметрыСкладаКомиссионера.ПунктДоставки;
			
			Запись.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия;
			
			
			//крохин начало 12.04.2021
			//Запись.Оборот = СтрокаТЧ.Всего;
			Запись.Оборот = 0;
			//крохин конец 12.04.2021
			
			
			
		КонецЦикла;
		//крохин конец 12.04.2021
		
		
		
	КонецЕсли;
	
	
	
	Движения=Новый Структура("ОстаткиТМЦКомиссия",ТДВ);
	
	Возврат 1;
КонецФункции

Функция ПолучитьОстаткиТМЦКомиссия(Конт,Загрузка,Склад=Неопределено,Период=Неопределено,ИмяТЧ=Неопределено) Экспорт
	// РНК+КМПЛ ***
	//крохин конец	
	ВидДокумента=Конт.Метаданные().Имя;
	
	Запрос=Новый Запрос;
	Если Загрузка Тогда
		
		ТекстЗапроса="
		|ВЫБРАТЬ 
		|	&СкладДокумента				КАК Склад,
		|	Номенклатура,
		|	СУММА(Количество)			КАК Остаток,
		|	СУММА(Всего)				КАК Стоимость	
		|ИЗ
		|	Документ."+ВидДокумента+".Товары ГДЕ Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО 
		|	Ссылка.Склад,
		|	Номенклатура
		|УПОРЯДОЧИТЬ ПО Номенклатура,Ссылка.Склад.Код";
	Иначе		
		ТекстЗапроса="
		|ВЫБРАТЬ 
		|	Склад,
		|	Номенклатура,
		|	СУММА(Остаток)				КАК Остаток,
		|	СУММА(Стоимость)			КАК Стоимость		
		|ИЗ
		|(
		|ВЫБРАТЬ
		|	Склад,
		|	Номенклатура,	
		|	КоличествоОстаток	Как Остаток,	
		|	СуммаОстаток 		Как Стоимость			
		|ИЗ
		|	РегистрНакопления.ОстаткиТМЦКомиссия.Остатки(&МоментВремени,
		|	Склад В (&Склады)
		|	И Номенклатура В  (&МассивНоменклатуры)
		|)	
		|КАК ОстаткиОпер
		|ДЛЯ ИЗМЕНЕНИЯ РегистрНакопления.ОстаткиТМЦКомиссия.Остатки";
		
		
		ТекстЗапроса=ТекстЗапроса+"
		|) КАК ОбщийЗапрос
		|СГРУППИРОВАТЬ ПО Склад,Номенклатура
		|УПОРЯДОЧИТЬ ПО Номенклатура,Склад.Код";
	КонецЕсли;	
	
	Запрос.Текст=ТекстЗапроса;	
	
	Запрос.УстановитьПараметр("Ссылка",				Конт.Ссылка);
	Запрос.УстановитьПараметр("МассивНоменклатуры",	ПолучитьНоменклатуруДокумента(Конт.Ссылка, ИмяТЧ));
	
	ТекСкладДокумента=Конт.Склад;
	
	Склады=Новый Массив;
	Склады.Добавить(Конт.Склад);						
	
	Запрос.УстановитьПараметр("СкладДокумента",ТекСкладДокумента);
	Запрос.УстановитьПараметр("Склады",Склады);
	Если Период=Неопределено Тогда
		Запрос.УстановитьПараметр("МоментВремени",новый граница(Конт.МоментВремени(),видграницы.Исключая));	
	Иначе
		Запрос.УстановитьПараметр("МоментВремени",Период);
	КонецЕсли;	
	
	Результат	=Запрос.Выполнить();
	
	ТО=Результат.Выгрузить();	
	
	ТО.Колонки.Добавить("Погашено",			ПолучитьОписаниеТиповЧисла(12,3));
	ТО.Колонки.Добавить("СписанаСтоимость",	ПолучитьОписаниеТиповЧисла(19,2));
	
	Возврат ТО;
КонецФункции

#КонецОбласти
