//++Данилова Е.В. 15.12.2025  HELP-7617 
Перем НеКонтролироватьТА;  
//--Данилова Е.В. 15.12.2025

Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,Записывать=Ложь)
	Для Каждого НаборДвижений Из ДвиженияПоРегистрам Цикл
		ИмяРегистра		=НаборДвижений.Ключ;
		ТаблицаДвижения =НаборДвижений.Значение;
		
		Если Движения.Найти(ИмяРегистра)=Неопределено Тогда Продолжить КонецЕсли; 
		
		НаборЗаписей=Движения[ИмяРегистра];		
		НаборЗаписей.Очистить();
		
		Для Каждого Движение Из ТаблицаДвижения Цикл
			Запись=НаборЗаписей.Добавить();	
			ЗаполнитьЗначенияСвойств(Запись,Движение);	
			
			Запись.Регистратор=Ссылка;
		КонецЦикла;	
		
		Если Записывать Тогда
			НаборЗаписей.Записать();		
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры 


//СОБЫТИЯ ОБЪЕКТА
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения	=Модифицированность();
	НужноВыгружать	=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	
//Кухарь А.Ю.  12.02.2024 начало
// Саща попросил снять запрет на запись  Опр и Спн	
	//если НЕ ПараметрыСеанса.ЗапущенаОбработка И НЕ ОбменДанными.Загрузка И Склад.ВидСклада=Перечисления.ВидСклада.ВиртуальныйДляСклада и ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
	//	#Если клиент тогда
	//		Сообщить("В ЦО запрещено создание документов по виртуальным складам");
	//	#КонецЕсли
	//	отказ=Истина;
	//КонецЕсли;
//Кухарь А.Ю.  12.02.2024 конец

	
	
	Если НЕ ОбменДанными.Загрузка Тогда
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
		Если Отказ Тогда Возврат КонецЕсли;		
	КонецЕсли;
	//++Данилова Е.В. 03.02.2026  SNL-109 
	Если НЕ ОбменДанными.Загрузка
		И ЕстьИзменения  Тогда 
		
		ЕстьБлокировкаПоТоварам = Обработки.ПланИнвентаризации.ЕстьблокировкаПоТоварамСклада(Склад,Товары.Выгрузить(,"Номенклатура").выгрузитьКолонку("Номенклатура")); 
		
		Если ЕстьБлокировкаПоТоварам Тогда 
			Отказ = истина;
			Сообщить("В документе присутствует заблокированная номенклатура! Документ доступен только для просмотра!");
			Возврат; 
		КонецЕсли; 	
		
	КонецЕсли;
	//--Данилова Е.В. 03.02.2026 
	
	Если ЕстьИзменения Тогда 
		СуммаДокумента		= Товары.Итог("Всего");
		ОбъемДокумента		= Товары.Итог("Объем");
		КоличествоДокумента = Товары.Итог("Количество");
		
		ГруппыТоваров   	= ГруппыТоваровДокумента(ЭтотОбъект);
		
		// Кухарь А.Ю. 09.09.2024 начало
		ТребуетсяМаркировка=МаркировкаКС.ОпределитьЗначениеТребуетсяМаркировкаВДокументе(ЭтотОбъект,,,Истина); 
		//крохин начало 19.03.2025
		//HELP-2535 - затычка		
		//// Кухарь А.Ю.  15.01.2025 начало
		//// если ТребуетсяМаркировка тогда
		//если ТребуетсяМаркировка и Дата>='20250101' тогда		 
		//	// Кухарь А.Ю.  15.01.2025 конец
		если ТребуетсяМаркировка и Дата>='20250301' тогда	
		//крохин конец 19.03.2025

			если ЭтоУзелОтправителяПоСкладу(Склад) тогда
				если Проведен и СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена тогда
					// Кухарь А.Ю. 28.03.2025 начало
					// Пустая задача
					если ОбщегоНазначения_ПИ.ЕстьЛНСМаркировкой(Ссылка) тогда
						// Кухарь А.Ю. 28.03.2025 конец
						
						РезультатРаботыСХКМ=Документы.ХранилищеКодовМаркировки.Создать_ХКМ_к_СПН(Ссылка);
						если не РезультатРаботыСХКМ.Успешно тогда
							РезультатРаботыСХКМ.Ошибки.Добавить("Не удалось создать хранилище кодов маркировки");
							СообщитьИзМодуля(СтрСоединить(РезультатРаботыСХКМ.Ошибки,","));
							отказ=Истина;	
						КонецЕсли;
						// Кухарь А.Ю. 28.03.2025 начало
						// Пустая задача
					КонецЕсли; 
					// Кухарь А.Ю. 28.03.2025 конец
					
				ИначеЕсли РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения или (СостояниеНакладной<>Перечисления.СостоянияНакладной.Отгружена и Ссылка.СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена) тогда
					РезультатРаботыСХКМ=Документы.ХранилищеКодовМаркировки.Отменить_ХКМ_к_НАК(Ссылка,Перечисления.ПланФакт.Факт);
					если не РезультатРаботыСХКМ.Успешно тогда
						РезультатРаботыСХКМ.Ошибки.Добавить("Не удалось создать хранилище кодов маркировки");
						СообщитьИзМодуля(СтрСоединить(РезультатРаботыСХКМ.Ошибки,","));
						отказ=Истина;	
					КонецЕсли;						
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		// Кухарь А.Ю. 09.09.2024 конец
		
	КонецЕсли; 
	//Кухарь 29.12.15 начало
	//Не выгружаем ни куда при перепроведении
	если ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение и ПараметрыСеанса.ОтключитьЖурнализациюЗаписи =Истина тогда
		НужноВыгружать=ложь;
	КонецЕсли;
	//Кухарь 29.12.15 конец		
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	СостояниеНакладной	=Неопределено;
	Автор				=Неопределено;
	
	ДатаВыгрузки		=Неопределено;
	
	//крохин начало 01.07.2011
	Организация = Неопределено;
	//крохин конец 01.07.2011
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)	
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	Если Основание=Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;
	
	ВидОснования	= Основание.Метаданные().Имя;		
	ДокОснование	= Основание;	
	ИБ				= Основание.ИБ;
	
	// Шворобей ВЮ 20.09.2023 ++
	Если ЕстьРеквизитДокумента("Склад", Основание.Метаданные()) Тогда
		Если ЗначениеЗаполнено(Основание.Склад.Организация) Тогда
			Организация = Основание.Склад.Организация; 
		КонецЕсли;
	КонецЕсли;
	// Шворобей ВЮ 20.09.2023 ++
	
	Товары.Очистить();
	Для Каждого СтрокаОснования Из Основание.Товары Цикл
		Если СтрокаОснования.Количество>0 Тогда
			СтрокаТЧ=Товары.Добавить();				
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаОснования);
		КонецЕсли;	
	КонецЦикла; 
	//крохин начало 05.04.2012
	//в СПН на основании РНК всегда одна статья затрат и подразделение, из РНК
	//крохин начало 07.06.2012
	//РКМ можно ввести позже
	//Если ВидОснования = "РасходнаяНакладная" И ЕстьРКМ(Основание) Тогда
	Если ВидОснования = "РасходнаяНакладная" Тогда
		//крохин конец 07.06.2012	
		СтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоКоду("223 230");
		Подразделение = ДокОснование.Подразделение;

	КонецЕсли;
	//крохин конец 05.04.2012
	
	//крохин начало 23.10.2012
	//в СПН на основании РКМ всегда одна статья затрат и подразделение, из докоснования РКМ
	Если ВидОснования = "РекламационнаяНакладная" И ДокОснование.ДокОснование.Метаданные().Имя = "РасходнаяНакладная" Тогда
		СтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоКоду("223 230");
		Подразделение = ДокОснование.ДокОснование.Подразделение;	

	КонецЕсли;
	//крохин конец 23.10.2012
	
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	Если СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе Тогда Возврат КонецЕсли; 
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	ДвиженияПоРегистрам=Неопределено;
	
	ТС=Неопределено;	
	РезультатПроведения=ПроведениеПоРегистрамОстатков(Ссылка,ДвиженияПоРегистрам,ОбменДанными.Загрузка,ТС);	
	
	Результат=РезультатПроведения["Результат"];
	Если Результат<0 И НЕ ОбменДанными.Загрузка Тогда 			
		Отказ=Не(ПолучитьПолномочиеПользователя("СписыватьВМинус"));
		
		ВывестиТрассировку(РезультатПроведения["ТОшибок"],?(Отказ,-2,Результат));
	КонецЕсли;
	
	Если Отказ Тогда Возврат КонецЕсли;		
	
	ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,ОбменДанными.Загрузка);	
	
	ТС.Свернуть("Номенклатура","Количество,СписанаСтоимость");
	Для Каждого СтрокаТЧ Из Товары Цикл
		СтрокаТС=ТС.Найти(СтрокаТЧ.Номенклатура,"Номенклатура");	
		Если СтрокаТС<>Неопределено И СтрокаТС.Количество<>0 Тогда
			//крохин начало 13.09.2017
			//отрицательные суммы тоже возможны
			//СтрокаТЧ.Всего=Макс(0,СтрокаТЧ.Количество*СтрокаТС.СписанаСтоимость/СтрокаТС.Количество);
			Если Дата >= '20170801' Тогда
			СтрокаТЧ.Всего=СтрокаТЧ.Количество*СтрокаТС.СписанаСтоимость/СтрокаТС.Количество;
		    Иначе
			СтрокаТЧ.Всего=Макс(0,СтрокаТЧ.Количество*СтрокаТС.СписанаСтоимость/СтрокаТС.Количество);
			КонецЕсли;
			//крохин конец 13.09.2017
		Иначе
			СтрокаТЧ.Всего=0;			
		КонецЕсли; 
		РассчитатьСуммуТабЧасти(СтрокаТЧ,ЭтотОбъект,"ОтВсего");		
	КонецЦикла;	
	СуммаДокумента=Товары.Итог("Всего");
	//кухарь 10.06.14 начало
	//замена конфигураторной ошибки сообщением
	//	Записать();

	Попытка
		Записать();
	Исключение
		#Если Клиент Тогда  
			//Ратманов
			Сообщить("Не удалось записать документ");
		#Иначе
			ЗаписатьВЛог("Ошибка записи документа", "Не удалось записать документ "+ЭтотОбъект, "Ошибка");
		#КонецЕсли
		Возврат;
	КонецПопытки;
	//кухарь 10.06.14 конец	
	ВалютаДокумента=?(Дата>='20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);
	
	//ЗАТРАТЫ
	//крохин начало 11.04.2013
	Если СуммаДокумента <> 0 Тогда
		
		//крохин конец 11.04.2013
		Движение=Движения.Затраты.Добавить();
		
		Движение.Период			= Дата;
		
		Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;
		
		Движение.Подразделение	= Подразделение;
		Движение.СтатьяЗатрат	= СтатьяЗатрат;
		//крохин начало
		Движение.СубЗатрата     = СубЗатрата;
		Движение.Комментарий    = Комментарий;
		Движение.КапитальныеЗатраты = КапитальныеЗатраты;
		//крохин конец
		
		Движение.СуммаУпр		= СуммаДокумента;	
		
		Движение.СуммаДокумента	= СуммаДокумента;
		Движение.ВалютаДокумента= ВалютаДокумента;	
		
		Движение.ДатаЗаписи		=ТекущаяДата();
		
		Если ОбменДанными.Загрузка Тогда
			Движения.Затраты.Записать();	
		КонецЕсли;	
		//крохин начало 11.04.2013
	КонецЕсли;
	//крохин конец 11.04.2013
	//кухарь учет сертификатов 11.09.13 начало
	если не УчетСертификатов.ПровестиДокументПоСертификатнымОстаткам(ЭтотОбъект) тогда
		отказ=Истина;
	КонецЕсли;
	//кухарь учет сертификатов 11.09.13 конец
	
	 //крохин начало 29.12.2020
	 //крохин начало 29.12.2020
	Если Склад.ТипСклада = Перечисления.ТипСклада.КомиссионныйСклад Тогда
			ДвиженияПоОстаткамТМЦКомиссия = Неопределено;
			РезультатПроведения = ПроведениеПоРегиструОстаткиТМЦКомиссия(Ссылка,ДвиженияПоОстаткамТМЦКомиссия);
			ВыполнитьДвиженияПоРегистрам(ДвиженияПоОстаткамТМЦКомиссия, Истина);
	КонецЕсли;
   //крохин конец 29.12.2020
	
	//кухарь 22.07.14 начало	
	если ОбменДанными.Загрузка тогда
		Движения.СертификатныеОстатки.Записать();
	КонецЕсли;
//кухарь 22.07.14 конец	
	
	
КонецПроцедуры

Функция ЕстьРКМ(РНК)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РекламационнаяНакладная.Ссылка
	|ИЗ
	|	Документ.РекламационнаяНакладная КАК РекламационнаяНакладная
	|ГДЕ
	|	(НЕ РекламационнаяНакладная.ПометкаУдаления)
	|	И РекламационнаяНакладная.ДокОснование = &ДокОснование";
	Запрос.УстановитьПараметр("ДокОснование",РНК);
	Выборка = запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

//кухарь учет сертификатов 11.09.13 начало
Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	если ТребуетсяМаркировка тогда
		РезультатРаботыСХКМ=Документы.ХранилищеКодовМаркировки.Отменить_ХКМ_к_НАК(Ссылка,Перечисления.ПланФакт.Факт);
	КонецЕсли;
	//Кухарь А.Ю.  11.09.2024 конец
	
	УчетСертификатов.УдалениеКомментариевСписанныхСертификатов(ЭтотОбъект);
КонецПроцедуры
//кухарь учет сертификатов 11.09.13 конец

//++Данилова Е.В. 15.12.2025  HELP-7617
Процедура ПеренестиРезерв() Экспорт
	НеКонтролироватьТА=Истина;
	Записать(?(Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
	НеКонтролироватьТА=Ложь;
КонецПроцедуры  
//--Данилова Е.В. 15.12.2025 

//++Данилова Е.В. 15.12.2025  HELP-7617 
НеКонтролироватьТА = Ложь;   
//--Данилова Е.В. 15.12.2025