//Нечаева ++


// 07,07,2014  +++ немного доработала механизм с факт адресами
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБРАБОТКИ ТАБЛИЧНОЙ ЧАСТИ ТОРГОВЫХ ДОКУМЕНТОВ
Функция ЦенаНоменклатурыПоМатрице(Номенклатура,Контрагент,ПунктДоставки=неопределено,ДатаРасчета) Экспорт
	
	Если  Номенклатура=Null или Номенклатура.ВидНоменклатуры=Перечисления.ВидыНоменклаутры.ПодарочныйСертификат или Номенклатура=неопределено Тогда Возврат 0 КонецЕсли;	
	
	ТекТипЦен			= справочники.ТипыЦен.ПустаяСсылка();
	Цена				= 0;
	Распродажа			= Ложь;
	ДатаРасчетаЦены= Датарасчета;
	Если ПунктДоставки=неопределено тогда ПунктДоставки=Справочники.ПунктыДоставки.ПустаяСсылка() КонецЕсли;
	
	
	//нечаева 11,04,14+++	
	ТекТовар = номенклатура;
	//-------------------------------------------------------------------------------
	ТЗМартицПоФА=новый ТаблицаЗначений;
	//------------------------------------------
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Ссылка
	|ИЗ
	|	(ВЫБРАТЬ
	|		МатрицаПунктыДоставки.ПунктДоставки КАК ПунктДоставки,
	|		СУММА(1) КАК кол,
	|		Матрица.Ссылка КАК Ссылка
	|	ИЗ
	|		Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Матрица КАК Матрица
	|			ПО МатрицаПунктыДоставки.Ссылка = Матрица.Ссылка
	|	ГДЕ
	|		Матрица.Контрагент = &Контрагент
	|		И Матрица.Дата <= &Дата1
	|		И Матрица.ДатаОкончания >= &Дата2
	|		И МатрицаПунктыДоставки.ПунктДоставки <> &пустая
	|	
	|	СГРУППИРОВАТЬ ПО
	|		МатрицаПунктыДоставки.ПунктДоставки,
	|		Матрица.Ссылка) КАК ВложенныйЗапрос
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
	Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("пустая",справочники.ПунктыДоставки.ПустаяСсылка());
	// цена по акции
	ТЗМартицПоФА = Запрос.Выполнить().Выгрузить();
	
	
	//---------------------------------------------
	ЕстьМартицаПоФактАдресу=ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МатрицаПунктыДоставки.Ссылка
	|ИЗ
	|	Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	|ГДЕ
	|	МатрицаПунктыДоставки.Ссылка.Дата <= &Дата1
	|	И МатрицаПунктыДоставки.Ссылка.Проведен
	|	И МатрицаПунктыДоставки.Ссылка.Контрагент = &Контрагент
	|	И МатрицаПунктыДоставки.Ссылка.ДатаОкончания >= &Дата2
	|		И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункДоставки
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
	Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("ТекПункДоставки",пунктДоставки);
	// цена по акции
	ТЗМК = Запрос.Выполнить().Выгрузить();
	
	Если ТЗМК.Количество()>0 Тогда
		ЕстьМартицаПоФактАдресу=истина;
	конецЕсли;
	// список значений матриц с пустыми значениями.
	
	
	ТекЦена=0;
	
	Если ЕстьМартицаПоФактАдресу Тогда
		
		//считаем по матрице. для конкретного факт. адреса
		//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	МатрицаТовары.Номенклатура,
		|	МатрицаТовары.Цена,
		|	МатрицаПунктыДоставки.Ссылка
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
		|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
		|ГДЕ
		|	МатрицаТовары.Ссылка.Дата <= &Дата1
		|	И МатрицаТовары.Ссылка.Проведен
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
		|	И МатрицаТовары.Ссылка.Акция = ИСТИНА
		|	И МатрицаТовары.Номенклатура = &ТекНом
		|	И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункДоставки
		|
		|УПОРЯДОЧИТЬ ПО
		|	МатрицаТовары.Ссылка.Дата УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("ТекНом",ТекТовар);			   
		Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТекПункДоставки",пунктДоставки);
		// цена по акции
		ТЗ1 = Запрос.Выполнить().Выгрузить();
		
		//цена по основному способу расчета, без учета акции		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	МатрицаТовары.Номенклатура,
		|	МатрицаТовары.Цена,
		|	МатрицаПунктыДоставки.Ссылка
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
		|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
		|ГДЕ
		|	МатрицаТовары.Ссылка.Дата <= &Дата1
		|	И МатрицаТовары.Ссылка.Проведен
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
		|	И МатрицаТовары.Номенклатура = &ТекНом
		|	И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункт
		|
		|УПОРЯДОЧИТЬ ПО
		|	МатрицаТовары.Ссылка.Дата УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("ТекНом",ТекТовар);
		Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТекПункт",пунктДоставки);
		ТЗ2 = Запрос.Выполнить().Выгрузить();
		
		Отбор = новый Структура;
		Отбор.Вставить("Номенклатура",ТекТовар);
		СтрокиМатриц = ТЗ1.НайтиСтроки(Отбор); 
		СтрокиМатриц2 = ТЗ2.НайтиСтроки(Отбор); 
		ТекЦена=0;
		Если СтрокиМатриц.Количество() = 0 Тогда
			// смотрим по основной базе
			Если СтрокиМатриц2.Количество() = 0 Тогда
				ТекЦена=0;
			Иначе
				Для Каждого СтрокаМатриц Из СтрокиМатриц2 Цикл
					ТекЦена=СтрокаМатриц.Цена;
				КонецЦикла;
			КонецЕсли;
			
		Иначе
			
			Для Каждого СтрокаМатриц Из СтрокиМатриц Цикл
				ТекЦена=СтрокаМатриц.Цена;
			КонецЦикла;
			
		КонецЕсли;
		
		
	иначе 
		// берем по матрицам без заполненных факт адресов.
		
		
		ТекТовар = номенклатура;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура,
		|	МатрицаТовары.Цена,
		|	МатрицаТовары.Ссылка
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	МатрицаТовары.Ссылка.Дата <= &Дата1
		|	И МатрицаТовары.Ссылка.Проведен
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
		|	И МатрицаТовары.Ссылка.Акция = ИСТИНА
		|	И МатрицаТовары.Номенклатура = &ТекНом
		|	И НЕ МатрицаТовары.Ссылка В(&ТЗМартицПоФА)
		|
		|УПОРЯДОЧИТЬ ПО
		|	МатрицаТовары.Ссылка.Дата УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("ТекНом",ТекТовар);			   
		Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТЗМартицПоФА",ТЗМартицПоФА);
		
		// цена по акции
		ТЗ1 = Запрос.Выполнить().Выгрузить();
		
		//цена по основному способу расчета, без учета матрицы.		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура,
		|	МатрицаТовары.Цена,
		|	МатрицаТовары.Ссылка
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	МатрицаТовары.Ссылка.Дата <= &Дата1
		|	И МатрицаТовары.Ссылка.Проведен
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
		|	И МатрицаТовары.Номенклатура = &ТекНом
		|	И НЕ МатрицаТовары.Ссылка В(&ТЗМартицПоФА)
		|
		|УПОРЯДОЧИТЬ ПО
		|	МатрицаТовары.Ссылка.Дата УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("ТекНом",ТекТовар);
		Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТЗМартицПоФА",ТЗМартицПоФА);
		
		ТЗ2 = Запрос.Выполнить().Выгрузить();
		
		
		Отбор = новый Структура;
		Отбор.Вставить("Номенклатура",ТекТовар);
		СтрокиМатриц = ТЗ1.НайтиСтроки(Отбор); 
		СтрокиМатриц2 = ТЗ2.НайтиСтроки(Отбор); 
		ТекЦена=0;
		Если СтрокиМатриц.Количество() = 0 Тогда
			// смотрим по основной базе
			Если СтрокиМатриц2.Количество() = 0 Тогда
				ТекЦена=0;
			Иначе
				Для Каждого СтрокаМатриц Из СтрокиМатриц2 Цикл
					Если СтрокаМатриц.ссылка.ПунктыДоставки.Количество()=0 Тогда
						ТекЦена=СтрокаМатриц.Цена;
						прервать;
					конецЕсли;	
				КонецЦикла;
			КонецЕсли;
			
		Иначе
			
			Для Каждого СтрокаМатриц Из СтрокиМатриц Цикл
				//ТекЦена=СтрокаМатриц.Цена;
				Если СтрокаМатриц.ссылка.ПунктыДоставки.Количество()=0 Тогда
					ТекЦена=СтрокаМатриц.Цена;
					прервать;
				конецЕсли;	
				
			КонецЦикла;
			
		КонецЕсли;
	конецЕсли;
	//нечаева 11,04,14
	
	Возврат ТекЦена;
	
	
КонецФункции
//07,07,2014 --


// нечаева 14,12,16++
Функция ПолучитьЦенуДляАртура(КодНом) Экспорт
	
	//чернышев
	Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSR-6515");
	
	ТекТипЦен			= контрагент.ТипЦен;
	Цена				= 0;
	Распродажа			= Ложь;
	валюта = справочники.Валюты.НайтиПоКоду("810");
	
	Номенклатура = справочники.Номенклатура.НайтиПоКоду(КодНом);
	Модель = Номенклатура.родитель;
	//распродажа
	Цена=ПолучитьЦенуНоменклатуры(Номенклатура,,Контрагент.ТипЦенРаспродажа,Валюта,1,ТекущаяДата());			
	Если ЗначениеЗаполнено(Цена) Тогда
		
		Распродажа							= Истина;
		Возврат Цена;
		
	КонецЕсли; 
	
	Цена = ПолучитьЦенуКонтрагента(ТекущаяДата(),Контрагент,Модель);
	//СкидкаТек = ПолучитьСкидкуКонтрагента(ТекущаяДата(),Контрагент,Модель);
	
	Если ЗначениеЗаполнено(Цена) Тогда
		Возврат Цена;
	иначе
		возврат 0;
	КонецЕсли;
	
	
КонецФункции // ПриИзмененииНоменклатурыТабЧасти()
// нечаева 14,12,16--

//нечаева 26,06,17++
Функция ПолучитьЦенуЧЛДляАртураСписок(СписокШК) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Модель,
	|	ЦеныНоменклатурыСрезПоследних.ТипЦен КАК ТипЦен,
	|	ЦеныНоменклатурыСрезПоследних.Прайс.Дата КАК ДатаПрайса,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	|	ШтрихКоды.Наименование,
	|	ШтрихКоды.Владелец,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Код КАК Код
	|ПОМЕСТИТЬ Цены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			{(&Дата2)},
	|			Прайс.Проведен
	|				И Прайс.Дата2 >= &Дата2
	|				И ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихКоды КАК ШтрихКоды
	|		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = ШтрихКоды.Владелец.Родитель
	|ГДЕ
	|	ШтрихКоды.ТипШК = &ТипШк
	|	И ШтрихКоды.ВидШК = &видШк
	|	И ШтрихКоды.Наименование В ИЕРАРХИИ(&СпШК)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Модель,
	|	ТипЦен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Цены.ДатаПрайса) КАК ДатаПрайса,
	|	Цены.Модель,
	|	Цены.ТипЦен
	|ПОМЕСТИТЬ Прайсы
	|ИЗ
	|	Цены КАК Цены
	|
	|СГРУППИРОВАТЬ ПО
	|	Цены.ТипЦен,
	|	Цены.Модель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""Цены"" КАК Раздел,
	|	Прайсы.Модель,
	|	Прайсы.ТипЦен,
	|	Цены.Цена,
	|	Цены.Код,
	|	Цены.Наименование
	|ИЗ
	|	Прайсы КАК Прайсы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цены КАК Цены
	|		ПО (Цены.Модель = Прайсы.Модель)
	|			И (Цены.ТипЦен = Прайсы.ТипЦен)
	|			И (Цены.ДатаПрайса = Прайсы.ДатаПрайса)";
	
	Запрос.УстановитьПараметр("Дата2",НачалоДня(ТекущаяДата()));			   
	Запрос.УстановитьПараметр("СпШк",СписокШК);	
	Запрос.УстановитьПараметр("ТипЦен",справочники.ТипыЦен.НайтиПоКоду("SSP-0301")); // частное лицо
	Запрос.УстановитьПараметр("ТипШк",перечисления.ТипыШтрихКодов.Штука);
	Запрос.УстановитьПараметр("ВидШк",перечисления.ВидыШК.Основной);
	
	//нечаева 22,08,18++	
	Рез = Запрос.Выполнить().Выбрать();
	Цена = 0;
	Пока Рез.Следующий() Цикл
		НН = Рез;
		Цена =  НН.Цена;
		
		Если Цена>0 Тогда
			Возврат Цена;
		КонецЕсли;
	КонецЦикла;
	
	Возврат 0;
	//нечаева 22,08,18++
	
	
КонецФункции
//нечаева 26,06,17--


// нечаева 25,07,18++
Функция ПолучитьСкидкуДляАртура(КодНом) Экспорт
	
	//чернышев
	Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSR-6515");
	ТипСкидок = справочники.ТипыСкидок.НайтиПоКоду("SNL-0008");  //sale ниже некуда
	ТипЦен = справочники.ТипыЦен.НайтиПоКоду("SSP-0301");  //частное лицо
	//для частного лица
	Скидка = 0;
	
	ТекТипЦен			= контрагент.ТипЦен;
	Цена				= 0;
	Распродажа			= Ложь;
	валюта = справочники.Валюты.НайтиПоКоду("810");
	
	Номенклатура = справочники.Номенклатура.НайтиПоКоду(КодНом);
	Модель = Номенклатура.родитель;
	
	Скидка = ПолучитьСкидкуНоменклатуры(Модель,ТипСкидок,ТекущаяДата(),ТипЦен);
	//
	Если ЗначениеЗаполнено(Скидка) Тогда
		Возврат Скидка;
	иначе
		возврат 0;
	КонецЕсли;
	Возврат Скидка;
	
КонецФункции // ПриИзмененииНоменклатурыТабЧасти()
// нечаева 25,07,18--


//нечаева 04,09,18++
Функция ПолучитьЦенуЧЛДляАртура(ШК) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Модель,
	|	ЦеныНоменклатурыСрезПоследних.ТипЦен КАК ТипЦен,
	|	ЦеныНоменклатурыСрезПоследних.Прайс.Дата КАК ДатаПрайса,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	|	ШтрихКоды.Наименование,
	|	ШтрихКоды.Владелец,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Код КАК Код
	|ПОМЕСТИТЬ Цены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			{(&Дата2)},
	|			Прайс.Проведен
	|				И Прайс.Дата2 >= &Дата2
	|				И ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихКоды КАК ШтрихКоды
	|		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = ШтрихКоды.Владелец.Родитель
	|ГДЕ
	|	ШтрихКоды.ТипШК = &ТипШк
	|	И ШтрихКоды.ВидШК = &видШк
	|	И ШтрихКоды.Наименование =(&СпШК)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Модель,
	|	ТипЦен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Цены.ДатаПрайса) КАК ДатаПрайса,
	|	Цены.Модель,
	|	Цены.ТипЦен
	|ПОМЕСТИТЬ Прайсы
	|ИЗ
	|	Цены КАК Цены
	|
	|СГРУППИРОВАТЬ ПО
	|	Цены.ТипЦен,
	|	Цены.Модель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""Цены"" КАК Раздел,
	|	Прайсы.Модель,
	|	Прайсы.ТипЦен,
	|	Цены.Цена,
	|	Цены.Код,
	|	Цены.Наименование
	|ИЗ
	|	Прайсы КАК Прайсы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цены КАК Цены
	|		ПО (Цены.Модель = Прайсы.Модель)
	|			И (Цены.ТипЦен = Прайсы.ТипЦен)
	|			И (Цены.ДатаПрайса = Прайсы.ДатаПрайса)";
	
	Запрос.УстановитьПараметр("Дата2",НачалоДня(ТекущаяДата()));			   
	Запрос.УстановитьПараметр("СпШк",ШК);	
	Запрос.УстановитьПараметр("ТипЦен",справочники.ТипыЦен.НайтиПоКоду("SSP-0301")); // частное лицо
	Запрос.УстановитьПараметр("ТипШк",перечисления.ТипыШтрихКодов.Штука);
	Запрос.УстановитьПараметр("ВидШк",перечисления.ВидыШК.Основной);
	
	Рез = Запрос.Выполнить().Выбрать();
	Цена = 0;
	Пока Рез.Следующий() Цикл
		НН = Рез;
		Цена =  НН.Цена;
		
		Если Цена>0 Тогда
			Возврат Цена;
		КонецЕсли;
	КонецЦикла;
	
	Возврат 0;
	
	
КонецФункции
//нечаева 04,09,18--





функция КоличествоСоСкидкой(ВсегоСоСкидкой,ВсегоБезСкидки,Количество)  Экспорт
	
	
	Если НЕ ВсегоБезСкидки-ВсегоСоСкидкой =0 Тогда
		Возврат Количество;
	КонецЕсли;
	
	Возврат 0;	
	
КонецФункции

Функция ПолучитьПериодическийРеквизит1(Объект,ИмяРеквизита,Знач Дата2=Неопределено,КодИБ=Неопределено,ДатаРеквизита="") Экспорт
	Дата2=?(Дата2=Неопределено,ТекущаяДата(),Дата2);
	
	Запрос=Новый Запрос;
	Если КодИБ=Неопределено Тогда
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Значение,Период
		|ИЗ
		|	РегистрСведений.История.СрезПоследних(&Дата2,Объект = &Объект И Реквизит = &Реквизит)
		|УПОРЯДОЧИТЬ ПО	Период УБЫВ";		
	Иначе
		Запрос.Текст="
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Значение,Период
		|ИЗ
		|	РегистрСведений.История
		|ГДЕ 
		|	Объект = &Объект И Реквизит = &Реквизит И Период<=&Дата2 И Значение.Владелец.Код=&КодИБ	
		|УПОРЯДОЧИТЬ ПО	Период УБЫВ";			
		
		Запрос.УстановитьПараметр("КодИБ",КодИБ);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата2));
	Запрос.УстановитьПараметр("Объект",Объект);
	Запрос.УстановитьПараметр("Реквизит",ИмяРеквизита);
	
	Выборка=Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ДатаРеквизита=Выборка.Период;
		Возврат Выборка.Значение;
	КонецЦикла; 
	
	Возврат Неопределено;
КонецФункции // ПолучитьпериодическийРеквизит()

Функция ПолучитьГрупповойПериодическийРеквизит1(Ссылка,ИмяРеквизита,Знач Дата2=Неопределено)	Экспорт
	Значение=Неопределено;
	
	Если Ссылка<>Неопределено И НЕ Ссылка.Пустая() Тогда		
		Значение=ПолучитьПериодическийРеквизит(Ссылка,ИмяРеквизита,Дата2);
		Если Значение=Неопределено И Ссылка.Уровень()<>0 Тогда
			Значение=ПолучитьГрупповойПериодическийРеквизит1(Ссылка.Родитель,ИмяРеквизита,Дата2);	
		КонецЕсли;
	КонецЕсли;	
	
	Возврат Значение;
КонецФункции // ПолучитьГрупповойПериодическийРЕквизит()

//крохин начало 06.12.2016
Функция ПолучитьРеквизитГрупповогоПериодическогоРеквизита(Ссылка,ИмяРеквизита,Знач Дата2=Неопределено,ИмяРеквизитаРеквизита = Неопределено)	Экспорт
	Значение=Неопределено;
	
	Если Ссылка<>Неопределено И НЕ Ссылка.Пустая() Тогда		
		Значение=ПолучитьПериодическийРеквизит(Ссылка,ИмяРеквизита,Дата2);
		Если Значение=Неопределено И Ссылка.Уровень()<>0 Тогда
			Значение=ПолучитьГрупповойПериодическийРеквизит1(Ссылка.Родитель,ИмяРеквизита,Дата2);	
		КонецЕсли;
	КонецЕсли;	
	Если НЕ ЗначениеНеЗаполнено(Значение) Тогда
		Возврат Значение[ИмяРеквизитаРеквизита];
	Иначе
		Возврат Значение;
	КонецЕсли;
	
КонецФункции	
//крохин конец 06.12.2016

Функция СкидкаКонтрагентаО(Дата2,Номенклатура,ТипСкидок_Контрагент) Экспорт
	
	Запрос=Новый Запрос;
	//Запрос.Текст="
	//|ВЫБРАТЬ ПЕРВЫЕ 1		
	//|	Скидка,ТипЦен,
	//|	ВЫБОР 
	//|		КОГДА Номенклатура	=&Номенклатура0 ТОГДА 0
	//|		КОГДА Номенклатура	=&Номенклатура1 ТОГДА 1
	//|		КОГДА Номенклатура	=&Номенклатура2 ТОГДА 2
	//|		КОГДА Номенклатура	=&Номенклатура3 ТОГДА 3
	//|		КОГДА Номенклатура	=&Номенклатура4 ТОГДА 4
	//// Кухарь А.Ю. 13.10.2022 начало
	////+1 уровень иерархии
	//|		КОГДА Номенклатура	=&Номенклатура5 ТОГДА 5 
	//// Кухарь А.Ю. 13.10.2022 конец
	//
	//|	ИНАЧЕ 100 
	//|	КОНЕЦ КАК Уровень
	//|ИЗ
	//|	Справочник.Контрагенты.Скидки
	//|ГДЕ
	//|	Ссылка = &Контрагент		
	//|	И Номенклатура В (&СписокПозиций)
	//|УПОРЯДОЧИТЬ ПО Уровень";
	
	// Шворобей ВЮ 05.03.2024 ++
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СкидкиКонтрагентов.Скидка КАК Скидка,
	|	СкидкиКонтрагентов.ТипЦен КАК ТипЦен,
	|	ВЫБОР
	|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура0
	|			ТОГДА 0
	|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура1
	|			ТОГДА 1
	|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура2
	|			ТОГДА 2
	|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура3
	|			ТОГДА 3
	|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура4
	|			ТОГДА 4
	|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура5
	|			ТОГДА 5
	|		ИНАЧЕ 100
	|	КОНЕЦ КАК Уровень
	|ИЗ
	|	РегистрСведений.СкидкиКонтрагентов КАК СкидкиКонтрагентов
	|ГДЕ
	|	СкидкиКонтрагентов.Номенклатура В(&СписокПозиций)
	|	И СкидкиКонтрагентов.Контрагент = &Контрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Уровень";
	// Шворобей ВЮ 05.03.2024 ++
	
	Запрос.УстановитьПараметр("Контрагент", ?(ЗначениеЗаполнено(ТипСкидок_Контрагент.Ведущий), ТипСкидок_Контрагент.Ведущий, ТипСкидок_Контрагент));		
	
	СписокПозиций=Новый Массив;
	
	Уровень=0;		
	ТекРодитель=Номенклатура;
	// Кухарь А.Ю. 13.10.2022 начало
	//+1 уровень иерархии
	//Пока Уровень<5 Цикл
	Пока Уровень<6 Цикл
		// Кухарь А.Ю. 13.10.2022 конец
		
		СписокПозиций.Добавить(ТекРодитель);		
		Запрос.УстановитьПараметр("Номенклатура"+Уровень,ТекРодитель);
		
		Уровень=Уровень+1;
		ТекРодитель=ТекРодитель.Родитель;			
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СписокПозиций",	СписокПозиций);
	
	Результат=Запрос.Выполнить();
	
	Выборка=Результат.Выбрать();
	Пока Выборка.Следующий() Цикл			
		ТипЦенСкидок=Выборка.ТипЦен;
		Возврат  Выборка;
	КонецЦикла;
	
	
	Возврат Неопределено;
	
	
КонецФункции 

Функция ЦенаКонтрагентаО(Дата2,Номенклатура,ТипЦен) Экспорт
	
	ТекТипЦен			= ТипЦен;
	Распродажа			= Ложь;
	
	
	Валюта=ТипЦен.Валюта;
	Курс=ПолучитьКурсВалюты_ПоРусски(Валюта, Дата2);
	Цена=ПолучитьЦенуНоменклатуры(Номенклатура,,ТипЦен,Валюта,Курс,Дата2);
	
	//определение - ПолучитьЦенуНоменклатуры(Номенклатура,Единица=Неопределено,ТипЦен,ВалютаДокумента,КурсДокумента,ДатаРасчета=Неопределено) Экспорт
	
	Возврат Цена;
	
КонецФункции

Функция ПолучитьЦенуКонтрагента(Дата,Контрагент,Модель) Экспорт 
	
	ТипЦенРаспродажа=ПолучитьРеквизитРодителя(Контрагент,"ТипЦенРаспродажа");
	ТипЦен_SALE=Контрагент.ТипЦенРаспродажа;
	ТипЦен=Справочники.ТипыЦен.ПустаяСсылка();
	
	Скидка=0;
	ЦенаРаспродажа=0;
	Цена=0;
	ИтЦена=0;
	
	
	СкидкаВЫб=СкидкаКонтрагентаО(дата,Модель,Контрагент);
	
	Если  СкидкаВыб=Неопределено Тогда
		СкидкаКонтрагента=ПолучитьРеквизитРодителя(Контрагент,"Скидка");
		Если СкидкаКонтрагента>0 Тогда
			Скидка=СкидкаКонтрагента;
			//крохин начало 29.06.2012
			//Тип цен может быть задан в контрагенте, а не родителе
			//ТипЦен=ПолучитьРеквизитРодителя(Контрагент,"ТипЦен");
			ТипЦен = Контрагент.ТипЦен;
			Если ТипЦен.Пустая() Тогда
				
			КонецЕсли;
			//крохин конец 29.06.2012
			
		КонецЕсли; 
		
	Иначе
		Скидка=СкидкаВыб.Скидка;
		ТипЦен=СкидкаВыб.ТипЦен;
		//Сообщить("  "+Модель+" "+Скидка+"  "+ТипЦен);
	КонецЕсли; 
	
	Цена=ЦенаКонтрагентаО(Дата,Модель,ТипЦен);
	//-----------------------------------------------------
	Если ТипЦен_SALE.Пустая() Тогда
		ТипЦен_SALE=Контрагент.ТипЦенРаспродажа;
	КонецЕсли; 
	
	ЦенаРаспродажа=ЦенаКонтрагентаО(Дата,Модель,ТипЦен_SALE);
	Если НЕ ЦенаРаспродажа=Неопределено Тогда
		Цена=ЦенаРаспродажа;
		ТипЦен=ТипЦен_SALE;
	КонецЕсли; 
	
	//*****************************************************************
	Если ТипЦен=ТипЦен_SALE Тогда
		
		ИтЦена=Цена;
		ИтСкидка="-";
		
	Иначе
		
		Если НЕ Скидка=Неопределено и НЕ Цена=Неопределено Тогда
			Если Скидка=-1 Тогда
				ИтЦена=Цена;
			Иначе
				ИтЦена=Цена-(Цена/100*Скидка);
			КонецЕсли; 
		Иначе
			ИтЦена=Цена;
		КонецЕсли; 
		
		//ИтЦена=Цена;
		ИтСкидка=Число(Скидка);
		
	КонецЕсли;		
	//*****************************************************************
	
	
	Возврат ИтЦена;
	
	
КонецФункции

Функция ПолучитьСкидкуКонтрагента(Дата,Контрагент,Модель) Экспорт 
	
	
	ТипЦенРаспродажа=ПолучитьРеквизитРодителя(Контрагент,"ТипЦенРаспродажа");
	ТипЦен_SALE=Контрагент.ТипЦенРаспродажа;
	ТипЦен=Справочники.ТипыЦен.ПустаяСсылка();
	
	Скидка=0;
	
	СкидкаВЫб=СкидкаКонтрагентаО(дата,Модель,Контрагент);
	
	Если  СкидкаВыб=Неопределено Тогда
		СкидкаКонтрагента=ПолучитьРеквизитРодителя(Контрагент,"Скидка");
		Если СкидкаКонтрагента>0 Тогда
			Скидка=СкидкаКонтрагента;
			ТипЦен=ПолучитьРеквизитРодителя(Контрагент,"ТипЦен");
		КонецЕсли; 
		
	Иначе
		Скидка=СкидкаВыб.Скидка;
		ТипЦен=СкидкаВыб.ТипЦен;
		//Сообщить("  "+Модель+" "+Скидка+"  "+ТипЦен);
	КонецЕсли; 
	
	Цена=ЦенаКонтрагентаО(Дата,Модель,ТипЦен);
	ЦенаРаспродажа=ЦенаКонтрагентаО(Дата,Модель,ТипЦен_SALE);
	Если НЕ ЦенаРаспродажа=Неопределено Тогда
		Цена=ЦенаРаспродажа;
		ТипЦен=ТипЦен_SALE;
	КонецЕсли; 
	
	//-----------------------------------------------------
	Если ТипЦен_SALE.Пустая() Тогда
		ТипЦен_SALE=Контрагент.ТипЦенРаспродажа;
	КонецЕсли; 
	
	ЦенаРаспродажа=ЦенаКонтрагентаО(Дата,Модель,ТипЦен_SALE);
	Если НЕ ЦенаРаспродажа=Неопределено Тогда
		Цена=ЦенаРаспродажа;
		ТипЦен=ТипЦен_SALE;
	КонецЕсли; 
	
	//*****************************************************************
	Если ТипЦен=ТипЦен_SALE Тогда
		
		ИтСкидка="-";
		
	Иначе
		
		ИтСкидка=Число(Скидка);
		
	КонецЕсли;		
	//*****************************************************************
	
	
	Возврат ИтСкидка;
	
	
	
КонецФункции

Функция ПолучитьСкидкуНоменклатурыЧисло(Номенклатура,ТипСкидок_Контрагент,ДатаРасчета=Неопределено,ТипЦенСкидок=Неопределено) Экспорт
	
	Если ТипЗнч(ТипСкидок_Контрагент)=Тип("СправочникСсылка.ТипыСкидок") Тогда		//по типу скидок
		Если ДатаРасчета=Неопределено Тогда
			#Если Клиент Тогда		
				ТекДатаРасчета=РабочаяДата;
			#Иначе
				ТекДатаРасчета=ТекущаяДата();		
			#КонецЕсли		
		Иначе
			ТекДатаРасчета=ДатаРасчета;	
		КонецЕсли;
		
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ ПЕРВЫЕ 1		
		|	Скидка,
		|	ВЫБОР 
		|		КОГДА Номенклатура	=&Номенклатура0 ТОГДА 0
		|		КОГДА Номенклатура	=&Номенклатура1 ТОГДА 1
		|		КОГДА Номенклатура	=&Номенклатура2 ТОГДА 2
		|		КОГДА Номенклатура	=&Номенклатура3 ТОГДА 3
		|		КОГДА Номенклатура	=&Номенклатура3 ТОГДА 4
			// Кухарь А.Ю. 13.10.2022 начало
			//+1 уровень иерархии
			 |		КОГДА Номенклатура	=&Номенклатура5 ТОГДА 5
			// Кухарь А.Ю. 13.10.2022 конец
		
		|	ИНАЧЕ 100 
		|	КОНЕЦ КАК Уровень
		|ИЗ
		|РегистрСведений.СкидкиНоменклатуры.СрезПоследних(КонецПериода(&Дата2,День),
		|	(ТипСкидок = &ТипСкидок)
		|	И Номенклатура В (&СписокПозиций)
		|	И Документ.Проведен
		|	И КОНЕЦПЕРИОДА(Документ.Дата2,День) >= &Дата2 и документ.Дата < &Дата2		
		|	) КАК ЦеныНоменклатурыСрезПоследних		
		|УПОРЯДОЧИТЬ ПО Документ.Дата Убыв,Уровень";
		
		
		Запрос.УстановитьПараметр("Дата2",			ТекДатаРасчета);
		Запрос.УстановитьПараметр("ТипСкидок",		ТипСкидок_Контрагент.базовый);   //!!!!!!!!!!!!
		
		СписокПозиций=Новый Массив;
		
		Уровень=0;		
		ТекРодитель=Номенклатура;
		// Кухарь А.Ю. 13.10.2022 начало
		//+1 уровень иерархии
		//Пока Уровень<5 Цикл
		Пока Уровень<6 Цикл
			// Кухарь А.Ю. 13.10.2022 конец
			СписокПозиций.Добавить(ТекРодитель);		
			Запрос.УстановитьПараметр("Номенклатура"+Уровень,ТекРодитель);
			
			Уровень=Уровень+1;
			ТекРодитель=ТекРодитель.Родитель;	
		КонецЦикла;
		
		Запрос.УстановитьПараметр("СписокПозиций",	СписокПозиций);
		
		Результат=Запрос.Выполнить();
		
		Выборка=Результат.Выбрать();
		Пока Выборка.Следующий() Цикл			
			Возврат  Выборка.Скидка;
		КонецЦикла;
		
		
		//второй запрос по другому типу скидок. если по базовому нет.
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ ПЕРВЫЕ 1		
		|	Скидка,
		|	ВЫБОР 
		|		КОГДА Номенклатура	=&Номенклатура0 ТОГДА 0
		|		КОГДА Номенклатура	=&Номенклатура1 ТОГДА 1
		|		КОГДА Номенклатура	=&Номенклатура2 ТОГДА 2
		|		КОГДА Номенклатура	=&Номенклатура3 ТОГДА 3
		|		КОГДА Номенклатура	=&Номенклатура3 ТОГДА 4
			// Кухарь А.Ю. 13.10.2022 начало
			//+1 уровень иерархии
			 |		КОГДА Номенклатура	=&Номенклатура5 ТОГДА 5
			// Кухарь А.Ю. 13.10.2022 конец
		
		|	ИНАЧЕ 100 
		|	КОНЕЦ КАК Уровень
		|ИЗ
		|РегистрСведений.СкидкиНоменклатуры.СрезПоследних(КонецПериода(&Дата2,День),
		|	(ТипСкидок = &ТипСкидок)
		|	И Номенклатура В (&СписокПозиций)
		|	И Документ.Проведен
		|	И КОНЕЦПЕРИОДА(Документ.Дата2,День) >= &Дата2 и документ.Дата < &Дата2		
		|	) КАК ЦеныНоменклатурыСрезПоследних		
		|УПОРЯДОЧИТЬ ПО Документ.Дата Убыв,Уровень";
		
		
		Запрос.УстановитьПараметр("Дата2",			ТекДатаРасчета);
		Запрос.УстановитьПараметр("ТипСкидок",		ТипСкидок_Контрагент);
		
		СписокПозиций=Новый Массив;
		
		Уровень=0;		
		ТекРодитель=Номенклатура;
		// Кухарь А.Ю. 13.10.2022 начало
		//+1 уровень иерархии
		//Пока Уровень<5 Цикл
		Пока Уровень<6 Цикл
			// Кухарь А.Ю. 13.10.2022 конец
			СписокПозиций.Добавить(ТекРодитель);		
			Запрос.УстановитьПараметр("Номенклатура"+Уровень,ТекРодитель);
			
			Уровень=Уровень+1;
			ТекРодитель=ТекРодитель.Родитель;	
		КонецЦикла;
		
		Запрос.УстановитьПараметр("СписокПозиций",	СписокПозиций);
		
		Результат=Запрос.Выполнить();
		
		Выборка=Результат.Выбрать();
		Пока Выборка.Следующий() Цикл			
			Возврат  Выборка.Скидка;
		КонецЦикла;
		
		
		
	Иначе
		Запрос=Новый Запрос;
		//Запрос.Текст="
		//|ВЫБРАТЬ ПЕРВЫЕ 1		
		//|	Скидка,ТипЦен,
		//|	ВЫБОР 
		//|		КОГДА Номенклатура	=&Номенклатура0 ТОГДА 0
		//|		КОГДА Номенклатура	=&Номенклатура1 ТОГДА 1
		//|		КОГДА Номенклатура	=&Номенклатура2 ТОГДА 2
		//|		КОГДА Номенклатура	=&Номенклатура3 ТОГДА 3
		//|		КОГДА Номенклатура	=&Номенклатура4 ТОГДА 4
		//// Кухарь А.Ю. 13.10.2022 начало
		////+1 уровень иерархии
		//|		КОГДА Номенклатура	=&Номенклатура5 ТОГДА 5 
		//// Кухарь А.Ю. 13.10.2022 конец
		//
		//|	ИНАЧЕ 100 
		//|	КОНЕЦ КАК Уровень
		//|ИЗ
		//|	Справочник.Контрагенты.Скидки
		//|ГДЕ
		//|	Ссылка = &Контрагент		
		//|	И Номенклатура В (&СписокПозиций)
		//|УПОРЯДОЧИТЬ ПО Уровень";
		
		// Шворобей ВЮ 05.03.2024 ++
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СкидкиКонтрагентов.Скидка КАК Скидка,
		|	СкидкиКонтрагентов.ТипЦен КАК ТипЦен,
		|	ВЫБОР
		|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура0
		|			ТОГДА 0
		|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура1
		|			ТОГДА 1
		|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура2
		|			ТОГДА 2
		|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура3
		|			ТОГДА 3
		|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура4
		|			ТОГДА 4
		|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура5
		|			ТОГДА 5
		|		ИНАЧЕ 100
		|	КОНЕЦ КАК Уровень
		|ИЗ
		|	РегистрСведений.СкидкиКонтрагентов КАК СкидкиКонтрагентов
		|ГДЕ
		|	СкидкиКонтрагентов.Номенклатура В(&СписокПозиций)
		|	И СкидкиКонтрагентов.Контрагент = &Контрагент
		|
		|УПОРЯДОЧИТЬ ПО
		|	Уровень";
		// Шворобей ВЮ 05.03.2024 ++
		
		Запрос.УстановитьПараметр("Контрагент", ?(ЗначениеЗаполнено(ТипСкидок_Контрагент.Ведущий), ТипСкидок_Контрагент.Ведущий, ТипСкидок_Контрагент));		
		
		СписокПозиций=Новый Массив;
		
		Уровень=0;		
		ТекРодитель=Номенклатура;
		// Кухарь А.Ю. 13.10.2022 начало
		//+1 уровень иерархии
		//Пока Уровень<5 Цикл
		Пока Уровень<6 Цикл
			// Кухарь А.Ю. 13.10.2022 конец
			СписокПозиций.Добавить(ТекРодитель);		
			Запрос.УстановитьПараметр("Номенклатура"+Уровень,ТекРодитель);
			
			Уровень=Уровень+1;
			ТекРодитель=ТекРодитель.Родитель;			
		КонецЦикла;
		
		Запрос.УстановитьПараметр("СписокПозиций",	СписокПозиций);
		
		Результат=Запрос.Выполнить();
		
		Выборка=Результат.Выбрать();
		Пока Выборка.Следующий() Цикл			
			ТипЦенСкидок=Выборка.ТипЦен;
			Возврат  Выборка.Скидка;
		КонецЦикла;
	КонецЕсли;
	
	Возврат 0;
КонецФункции // ПолучитьСкидкуНоменклатуры()

Функция ПолучитьНаимДаты(Дата) Экспорт
	Рез=Строка(Формат(Дата,"ДЛФ=Д"));
	ДеньН=ДеньНЕдели(Дата);
	НомДн="";
	Если Деньн=1 Тогда
		НомДн="Пн.";
	конецЕсли;
	
	Если Деньн=2 Тогда
		НомДн="Вт.";
	конецЕсли;
	
	Если Деньн=3 Тогда
		НомДн="Ср.";
	конецЕсли;
	
	Если Деньн=4 Тогда
		НомДн="Чт.";
	конецЕсли;
	
	Если Деньн=5 Тогда
		НомДн="Пт.";
	конецЕсли;
	
	Если Деньн=6 тогда
		НомДн="Сб.";
	конецЕсли;
	
	Если Деньн=7 Тогда
		НомДн="Вс.";
	конецЕсли;
	
	
	Рез=Рез+" "+Строка(НомДн);
	
	возврат РЕз;
	
	
КонецФункции

Функция ДатаПоследногоПрихода(Номенклатура,Склад) Экспорт
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПеремещениеТовары.Номенклатура,
	|	ПеремещениеТовары.Ссылка.Дата КАК Дата,
	|	ПеремещениеТовары.Ссылка.СкладПолучатель КАК Склад
	|ИЗ
	|	Документ.Перемещение.Товары КАК ПеремещениеТовары
	|ГДЕ
	|	ПеремещениеТовары.Ссылка.Проведен = ИСТИНА
	|	И ПеремещениеТовары.Номенклатура В ИЕРАРХИИ(&ТекНОм)
	|	И ПеремещениеТовары.Ссылка.СкладПолучатель В ИЕРАРХИИ(&ТекСклад)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ ";
	
	Запрос.УстановитьПараметр("ТекНом",Номенклатура);
	Запрос.УстановитьПараметр("ТекСклад",Склад);
	
	Рез=Запрос.Выполнить().Выбрать();
	
	Дата=Неопределено;
	Если РЕз.Следующий() Тогда
		Дата=Рез.Дата;
	КонецЕсли;	
	
	Возврат Дата;
	
КонецФункции

// Нечаева 23,05,2011 для отчета на компановке начало
Функция Округление(ЧислоОкр,Целые=12,режим=0) Экспорт
	
	Возврат Окр(ЧислоОкр,Целые,режим)
	
КонецФункции
// Нечаева 23,05,2011 для отчета на компановке конец

// Нечаева 14.06.,2011 для отчета на компановке начало
функция ГТДДляЕкодаГТД(Номенклатура) Экспорт
	
	
	ГТД=ПолучитьГрупповойПериодическийРеквизит(Номенклатура.Родитель,"НомерГТД",ТекущаяДата());
	
	Страна	="RU";
	НомерГТД="";
	Если ГТД<>Неопределено И Врег(""+ГТД.СтранаПроисхождения)<>"РОССИЯ" И НЕ ПустаяСтрока(""+ГТД.СтранаПроисхождения) Тогда
		Страна		=""+ГТД.СтранаПроисхождения;
		НомерГТД	=СокрЛП(""+ГТД.Наименование);
	КонецЕсли;
	
	
	Если НомерГТД="" Тогда
		Сообщить("Для номенклатуры - "+Номенклатура+" - не определен номер ГТД! ");
		Ошибка=1;
	КонецЕсли;	
	
	//--------------------------------------------------------------------------------
	// ищем номер страны для гтд
	//--------------------------------------------------------------------------------
	Макет=ПолучитьОбщийМакет("КлассификаторСтранМира");
	Искомое2 = СокрЛП(Страна);  //значение в макете есть, не находит
	Искомое = Макет.НайтиТекст(Искомое2); //,, ОбластьПоиска);
	Если Искомое<>Неопределено ТОгда
		Строка=Искомое.Низ;
		Колонка=Искомое.Лево+1; // для кода
	КонецЕсли;
	// получаем код
	
	Страна=Макет.Область(Строка,Колонка).Текст;
	
	Возврат Гтд;
	
КонецФункции


функция ГТДДляЕкодаСтрана(Номенклатура)  Экспорт
	
	
	ГТД=ПолучитьГрупповойПериодическийРеквизит(Номенклатура.Родитель,"НомерГТД",ТекущаяДата());
	
	Страна	="RU";
	НомерГТД="";
	Если ГТД<>Неопределено И Врег(""+ГТД.СтранаПроисхождения)<>"РОССИЯ" И НЕ ПустаяСтрока(""+ГТД.СтранаПроисхождения) Тогда
		Страна		=""+ГТД.СтранаПроисхождения;
		НомерГТД	=СокрЛП(""+ГТД.Наименование);
	КонецЕсли;
	
	
	Если НомерГТД="" Тогда
		Сообщить("Для номенклатуры - "+Номенклатура+" - не определен номер ГТД! ");
		Ошибка=1;
	КонецЕсли;	
	
	//--------------------------------------------------------------------------------
	// ищем номер страны для гтд
	//--------------------------------------------------------------------------------
	Макет=ПолучитьОбщийМакет("КлассификаторСтранМира");
	Искомое2 = СокрЛП(Страна);  //значение в макете есть, не находит
	Искомое = Макет.НайтиТекст(Искомое2); //,, ОбластьПоиска);
	Если Искомое<>Неопределено ТОгда
		Строка=Искомое.Низ;
		Колонка=Искомое.Лево+1; // для кода
	КонецЕсли;
	// получаем код
	
	Страна=Макет.Область(Строка,Колонка).Текст;
	
	
	Возврат Страна;
	
	
КонецФункции
// Нечаева 14.06.,2011 для отчета на компановке конец	


//Нечаева --

////Мессерле Для группового получения Скидок номенклатуры (если не заданы 2 посл. параметра, то работает по прежнему алгоритму)
//Алгоритм использования: объявляем в модуле, откуда идет вызов функции , локальную или глобальную переменную, которую передаем во ВремТз, 
//формируем список номенклатуры , по  которому надо вернуть скидки
//и передаем в МассивНоменклатуры. Скидки рассчитываются для всего списка и хранятся во ВремТз.
//Для переинициализации надо задать новый список номенклатуры и сбросить ВремТз в модуле, где была объявлена переменная ВремТз (ВремТз="")
//Аналогично работают функции  ПолучитьЦенуНоменклатуры  и ПолучитьСвойстваНоменклатуры.
//Пример использования - обработка "ПечатьЭтикеток"

// нечаева ст. вариант до оптимизации запроса
Функция ПолучитьСкидкуНоменклатурыCт(Номенклатура,ТипСкидок_Контрагент,ДатаРасчета=Неопределено,ТипЦенСкидок=Неопределено,МассивНоменклатуры=НЕОПРЕДЕЛЕНО,ВремТз=НЕОПРЕДЕЛЕНО) Экспорт
	
	Если ТипЗнч(ТипСкидок_Контрагент)=Тип("СправочникСсылка.ТипыСкидок") Тогда		//по типу скидок
		Если ДатаРасчета=Неопределено Тогда
			#Если Клиент Тогда
				// нечаева 06,08,13 +++ было везде на конец дня
				//ТекДатаРасчета=КонецДня(РабочаяДата);
				ТекДатаРасчета=ТекущаяДата(); //РабочаяДата;
			#Иначе
				ТекДатаРасчета=ТекущаяДата();		
			#КонецЕсли		
		Иначе
			ТекДатаРасчета=ДатаРасчета;	
		КонецЕсли;
		
		Если НЕ(ВремТз="" или ВремТз=НЕОПРЕДЕЛЕНО) И ЗначениеЗаполнено(Номенклатура) тогда
			Стр=ВремТз.найти(номенклатура,"Номенклатура");
			Если Стр=Неопределено тогда    
				Стр=ВремТз.найти(номенклатура.родитель,"Номенклатура");
				Если Стр=Неопределено тогда
					Стр=ВремТз.найти(номенклатура.родитель.родитель,"Номенклатура");
					Если Стр=Неопределено тогда
						Возврат(0);
					иначе
						Возврат(стр.скидка);
					Конецесли;	  
					
					Возврат(0);
				иначе
					Возврат(стр.скидка);
				Конецесли;
				возврат(0);
			иначе
				Возврат(стр.скидка);
			Конецесли;
			
		Конецесли;
		
		если МассивНоменклатуры<>Неопределено тогда //Передали что-то
			Если ВремТз="" тогда
				
				//			//мессерле
				//			запрос=новый запрос;
				//			
				//				запрос.Текст="ВЫБРАТЬ
				//					 |	а1.Скидка,
				//					 |	а1.уровень,
				//					 |	а1.Номенклатура
				//					 |ИЗ
				//					 |	(ВЫБРАТЬ
				//					 |		ЦеныНоменклатурыСрезПоследних.Скидка КАК Скидка,
				//					 |		0 КАК уровень,
				//					 |		ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
				//					 |		ЦеныНоменклатурыСрезПоследних.Документ.Дата КАК ДокументДата
				//					 |	ИЗ
				//					 |		РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				//					 |				КонецПериода(&Дата2,День),
				//					 |				(ТипСкидок = &ТипСкидок
				//					 |					ИЛИ ТипСкидок = &ТипСкидок_Базовый)
				//					 |					И Номенклатура В (&СписокПозиций)
				//					 |					И Документ.Проведен
				//					 |					И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2  и документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				//					 |	
				//					 |	ОБЪЕДИНИТЬ ВСЕ
				//					 |	
				//					 |	ВЫБРАТЬ
				//					 |		ЦеныНоменклатурыСрезПоследних.Скидка,
				//					 |		1,
				//					 |		ЦеныНоменклатурыСрезПоследних.Номенклатура,
				//					 |		ЦеныНоменклатурыСрезПоследних.Документ.Дата
				//					 |	ИЗ
				//					 |		РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				//					 |				КонецПериода(&Дата2,день),
				//					 |				(ТипСкидок = &ТипСкидок
				//					 |					ИЛИ ТипСкидок = &ТипСкидок_Базовый)
				//					 |					И Номенклатура В
				//					 |						(ВЫБРАТЬ РАЗЛИЧНЫЕ
				//					 |							Справочник.Номенклатура.Ссылка.Родитель
				//					 |						ИЗ
				//					 |							Справочник.Номенклатура
				//					 |						ГДЕ
				//					 |							Справочник.Номенклатура.Ссылка В (&СписокПозиций))
				//					 |					И Документ.Проведен
				//					 |					И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2  и документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				//					 |	
				//					 |	ОБЪЕДИНИТЬ ВСЕ
				//					 |	
				//					 |	ВЫБРАТЬ
				//					 |		ЦеныНоменклатурыСрезПоследних.Скидка,
				//					 |		2,
				//					 |		ЦеныНоменклатурыСрезПоследних.Номенклатура,
				//					 |		ЦеныНоменклатурыСрезПоследних.Документ.Дата
				//					 |	ИЗ
				//					 |		РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				//					 |				КонецПериода(&Дата2,День),
				//					 |				(ТипСкидок = &ТипСкидок
				//					 |					ИЛИ ТипСкидок = &ТипСкидок_Базовый)
				//					 |					И Номенклатура В
				//					 |						(ВЫБРАТЬ РАЗЛИЧНЫЕ
				//					 |							Справочник.Номенклатура.Ссылка.Родитель.Родитель
				//					 |						ИЗ
				//					 |							Справочник.Номенклатура
				//					 |						ГДЕ
				//					 |							Справочник.Номенклатура.Ссылка В (&СписокПозиций))
				//					 |					И Документ.Проведен
				//					 |					И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2  и документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				//					 |	
				//					 |	ОБЪЕДИНИТЬ ВСЕ
				//					 |	
				//					 |	ВЫБРАТЬ
				//					 |		ЦеныНоменклатурыСрезПоследних.Скидка,
				//					 |		3,
				//					 |		ЦеныНоменклатурыСрезПоследних.Номенклатура,
				//					 |		ЦеныНоменклатурыСрезПоследних.Документ.Дата
				//					 |	ИЗ
				//					 |		РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				//					 |				КонецПериода(&Дата2,День),
				//					 |				(ТипСкидок = &ТипСкидок
				//					 |					ИЛИ ТипСкидок = &ТипСкидок_Базовый)
				//					 |					И Номенклатура В
				//					 |						(ВЫБРАТЬ РАЗЛИЧНЫЕ
				//					 |							Справочник.Номенклатура.Ссылка.Родитель.Родитель.Родитель
				//					 |						ИЗ
				//					 |							Справочник.Номенклатура
				//					 |						ГДЕ
				//					 |							Справочник.Номенклатура.Ссылка В (&СписокПозиций))
				//					 |					И Документ.Проведен
				//					 |					И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2  и документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				//					 |	
				//					 |	ОБЪЕДИНИТЬ ВСЕ
				//					 |	
				//					 |	ВЫБРАТЬ
				//					 |		ЦеныНоменклатурыСрезПоследних.Скидка,
				//					 |		4,
				//					 |		ЦеныНоменклатурыСрезПоследних.Номенклатура,
				//					 |		ЦеныНоменклатурыСрезПоследних.Документ.Дата
				//					 |	ИЗ
				//					 |		РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				//					 |				КонецПериода(&Дата2,День),
				//					 |				(ТипСкидок = &ТипСкидок
				//					 |					ИЛИ ТипСкидок = &ТипСкидок_Базовый)
				//					 |					И Номенклатура В
				//					 |						(ВЫБРАТЬ РАЗЛИЧНЫЕ
				//					 |							Справочник.Номенклатура.Ссылка.Родитель.Родитель.Родитель.Родитель
				//					 |						ИЗ
				//					 |							Справочник.Номенклатура
				//					 |						ГДЕ
				//					 |							Справочник.Номенклатура.Ссылка В (&СписокПозиций))
				//					 |					И Документ.Проведен
				//					 |					И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2  и документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних) КАК а1
				//					 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				//					 |			МИНИМУМ(а2.уровень) КАК уровень,
				//					 |			а2.Номенклатура КАК Номенклатура
				//					 |		ИЗ
				//					 |			(ВЫБРАТЬ
				//					 |				ЦеныНоменклатурыСрезПоследних.Скидка КАК Скидка,
				//					 |				0 КАК уровень,
				//					 |				ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура
				//					 |			ИЗ
				//					 |				РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				//					 |						КонецПериода(&Дата2,День),
				//					 |						(ТипСкидок = &ТипСкидок
				//					 |							ИЛИ ТипСкидок = &ТипСкидок_Базовый)
				//					 |							И Номенклатура В (&СписокПозиций)
				//					 |							И Документ.Проведен
				//					 |							И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2  и документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				//					 |			
				//					 |			ОБЪЕДИНИТЬ ВСЕ
				//					 |			
				//					 |			ВЫБРАТЬ
				//					 |				ЦеныНоменклатурыСрезПоследних.Скидка,
				//					 |				1,
				//					 |				ЦеныНоменклатурыСрезПоследних.Номенклатура
				//					 |			ИЗ
				//					 |				РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				//					 |						КонецПериода(&Дата2,День),
				//					 |						(ТипСкидок = &ТипСкидок
				//					 |							ИЛИ ТипСкидок = &ТипСкидок_Базовый)
				//					 |							И Номенклатура В
				//					 |								(ВЫБРАТЬ РАЗЛИЧНЫЕ
				//					 |									Справочник.Номенклатура.Ссылка.Родитель
				//					 |								ИЗ
				//					 |									Справочник.Номенклатура
				//					 |								ГДЕ
				//					 |									Справочник.Номенклатура.Ссылка В (&СписокПозиций))
				//					 |							И Документ.Проведен
				//					 |							И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2  и документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				//					 |			
				//					 |			ОБЪЕДИНИТЬ ВСЕ
				//					 |			
				//					 |			ВЫБРАТЬ
				//					 |				ЦеныНоменклатурыСрезПоследних.Скидка,
				//					 |				2,
				//					 |				ЦеныНоменклатурыСрезПоследних.Номенклатура
				//					 |			ИЗ
				//					 |				РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				//					 |						КонецПериода(&Дата2,День),
				//					 |						(ТипСкидок = &ТипСкидок
				//					 |							ИЛИ ТипСкидок = &ТипСкидок_Базовый)
				//					 |							И Номенклатура В
				//					 |								(ВЫБРАТЬ РАЗЛИЧНЫЕ
				//					 |									Справочник.Номенклатура.Ссылка.Родитель.Родитель
				//					 |								ИЗ
				//					 |									Справочник.Номенклатура
				//					 |								ГДЕ
				//					 |									Справочник.Номенклатура.Ссылка В (&СписокПозиций))
				//					 |							И Документ.Проведен
				//					 |							И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2  и документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				//					 |			
				//					 |			ОБЪЕДИНИТЬ ВСЕ
				//					 |			
				//					 |			ВЫБРАТЬ
				//					 |				ЦеныНоменклатурыСрезПоследних.Скидка,
				//					 |				3,
				//					 |				ЦеныНоменклатурыСрезПоследних.Номенклатура
				//					 |			ИЗ
				//					 |				РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				//					 |						КонецПериода(&Дата2,День),
				//					 |						(ТипСкидок = &ТипСкидок
				//					 |							ИЛИ ТипСкидок = &ТипСкидок_Базовый)
				//					 |							И Номенклатура В
				//					 |								(ВЫБРАТЬ РАЗЛИЧНЫЕ
				//					 |									Справочник.Номенклатура.Ссылка.Родитель.Родитель.Родитель
				//					 |								ИЗ
				//					 |									Справочник.Номенклатура
				//					 |								ГДЕ
				//					 |									Справочник.Номенклатура.Ссылка В (&СписокПозиций))
				//					 |							И Документ.Проведен
				//					 |							И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2  и документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				//					 |			
				//					 |			ОБЪЕДИНИТЬ ВСЕ
				//					 |			
				//					 |			ВЫБРАТЬ
				//					 |				ЦеныНоменклатурыСрезПоследних.Скидка,
				//					 |				4,
				//					 |				ЦеныНоменклатурыСрезПоследних.Номенклатура
				//					 |			ИЗ
				//					 |				РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				//					 |						КонецПериода(&Дата2,День),
				//					 |						(ТипСкидок = &ТипСкидок
				//					 |							ИЛИ ТипСкидок = &ТипСкидок_Базовый)
				//					 |							И Номенклатура В
				//					 |								(ВЫБРАТЬ РАЗЛИЧНЫЕ
				//					 |									Справочник.Номенклатура.Ссылка.Родитель.Родитель.Родитель.Родитель
				//					 |								ИЗ
				//					 |									Справочник.Номенклатура
				//					 |								ГДЕ
				//					 |									Справочник.Номенклатура.Ссылка В (&СписокПозиций))
				//					 |							И Документ.Проведен
				//					 |							И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2  и документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних) КАК а2
				//					 |		
				//					 |		СГРУППИРОВАТЬ ПО
				//					 |			а2.Номенклатура,
				//					 |			а2.Скидка) КАК а2
				//					 |		ПО а1.уровень = а2.уровень
				//					 |			И а1.Номенклатура = а2.Номенклатура
				//					 |
				//					 |УПОРЯДОЧИТЬ ПО
				//					 |	а1.ДокументДата УБЫВ";
				//		   		  
				//		
				//
				//			Запрос.УстановитьПараметр("Дата2",			ТекДатаРасчета);
				//			Запрос.УстановитьПараметр("ТипСкидок",		ТипСкидок_Контрагент);
				//			Запрос.УстановитьПараметр("ТипСкидок_Базовый",ТипСкидок_Контрагент.Базовый);
				//			Запрос.УстановитьПараметр("СписокПозиций",	МассивНоменклатуры);   	 
				//			ВремТз=запрос.Выполнить().выгрузить();
				//			ВремТз.Индексы.Добавить("Номенклатура");
				//			
				//			
				//		Конецесли;
				//		
				//		ЕСЛИ ЗначениеЗаполнено(Номенклатура) тогда
				//			Стр=ВремТз.найти(номенклатура,"Номенклатура");
				//			Если Стр=Неопределено тогда    
				//				Стр=ВремТз.найти(номенклатура.родитель,"Номенклатура");
				//				Если Стр=Неопределено тогда
				//					Стр=ВремТз.найти(номенклатура.родитель.родитель,"Номенклатура");
				//					Если Стр=Неопределено тогда
				//						Возврат(0);
				//					иначе
				//						Возврат(стр.скидка);
				//					Конецесли;	  
				//					
				//					Возврат(0);
				//				иначе
				//					Возврат(стр.скидка);
				//				Конецесли;
				//				возврат(0);
				//			иначе
				//				Возврат(стр.скидка);
				//			Конецесли;
				//		Конецесли;
				//		Возврат(0);
				//		
				//		
				
				
				
				//нечаева 02,06,14 разделила на два запроса  ++++
				
				запрос=новый запрос;
				
				запрос.Текст="ВЫБРАТЬ
				|	а1.Скидка,
				|	а1.уровень,
				|	а1.Номенклатура,
				|	а1.ДокументДата
				|ИЗ
				|	(ВЫБРАТЬ
				|		ЦеныНоменклатурыСрезПоследних.Скидка КАК Скидка,
				|		0 КАК уровень,
				|		ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
				|		ЦеныНоменклатурыСрезПоследних.Документ.Дата КАК ДокументДата
				|	ИЗ
				|		РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|				КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|				ТипСкидок = &ТипСкидок
				|					И Номенклатура В (&СписокПозиций)
				|					И Документ.Проведен
				|					И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|					И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ЦеныНоменклатурыСрезПоследних.Скидка,
				|		1,
				|		ЦеныНоменклатурыСрезПоследних.Номенклатура,
				|		ЦеныНоменклатурыСрезПоследних.Документ.Дата
				|	ИЗ
				|		РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|				КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|				ТипСкидок = &ТипСкидок
				|					И Номенклатура В
				|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|							Справочник.Номенклатура.Ссылка.Родитель
				|						ИЗ
				|							Справочник.Номенклатура
				|						ГДЕ
				|							Справочник.Номенклатура.Ссылка В (&СписокПозиций))
				|					И Документ.Проведен
				|					И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|					И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ЦеныНоменклатурыСрезПоследних.Скидка,
				|		2,
				|		ЦеныНоменклатурыСрезПоследних.Номенклатура,
				|		ЦеныНоменклатурыСрезПоследних.Документ.Дата
				|	ИЗ
				|		РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|				КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|				ТипСкидок = &ТипСкидок
				|					И Номенклатура В
				|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|							Справочник.Номенклатура.Ссылка.Родитель.Родитель
				|						ИЗ
				|							Справочник.Номенклатура
				|						ГДЕ
				|							Справочник.Номенклатура.Ссылка В (&СписокПозиций))
				|					И Документ.Проведен
				|					И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|					И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ЦеныНоменклатурыСрезПоследних.Скидка,
				|		3,
				|		ЦеныНоменклатурыСрезПоследних.Номенклатура,
				|		ЦеныНоменклатурыСрезПоследних.Документ.Дата
				|	ИЗ
				|		РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|				КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|				ТипСкидок = &ТипСкидок
				|					И Номенклатура В
				|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|							Справочник.Номенклатура.Ссылка.Родитель.Родитель.Родитель
				|						ИЗ
				|							Справочник.Номенклатура
				|						ГДЕ
				|							Справочник.Номенклатура.Ссылка В (&СписокПозиций))
				|					И Документ.Проведен
				|					И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|					И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ЦеныНоменклатурыСрезПоследних.Скидка,
				|		4,
				|		ЦеныНоменклатурыСрезПоследних.Номенклатура,
				|		ЦеныНоменклатурыСрезПоследних.Документ.Дата
				|	ИЗ
				|		РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|				КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|				ТипСкидок = &ТипСкидок
				|					И Номенклатура В
				|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|							Справочник.Номенклатура.Ссылка.Родитель.Родитель.Родитель.Родитель
				|						ИЗ
				|							Справочник.Номенклатура
				|						ГДЕ
				|							Справочник.Номенклатура.Ссылка В (&СписокПозиций))
				|					И Документ.Проведен
				|					И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|					И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних) КАК а1
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			МИНИМУМ(а2.уровень) КАК уровень,
				|			а2.Номенклатура КАК Номенклатура
				|		ИЗ
				|			(ВЫБРАТЬ
				|				ЦеныНоменклатурыСрезПоследних.Скидка КАК Скидка,
				|				0 КАК уровень,
				|				ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура
				|			ИЗ
				|				РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|						КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|						ТипСкидок = &ТипСкидок
				|							И Номенклатура В (&СписокПозиций)
				|							И Документ.Проведен
				|							И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|							И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|			
				|			ОБЪЕДИНИТЬ ВСЕ
				|			
				|			ВЫБРАТЬ
				|				ЦеныНоменклатурыСрезПоследних.Скидка,
				|				1,
				|				ЦеныНоменклатурыСрезПоследних.Номенклатура
				|			ИЗ
				|				РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|						КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|						ТипСкидок = &ТипСкидок
				|							И Номенклатура В
				|								(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|									Справочник.Номенклатура.Ссылка.Родитель
				|								ИЗ
				|									Справочник.Номенклатура
				|								ГДЕ
				|									Справочник.Номенклатура.Ссылка В (&СписокПозиций))
				|							И Документ.Проведен
				|							И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|							И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|			
				|			ОБЪЕДИНИТЬ ВСЕ
				|			
				|			ВЫБРАТЬ
				|				ЦеныНоменклатурыСрезПоследних.Скидка,
				|				2,
				|				ЦеныНоменклатурыСрезПоследних.Номенклатура
				|			ИЗ
				|				РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|						КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|						ТипСкидок = &ТипСкидок
				|							И Номенклатура В
				|								(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|									Справочник.Номенклатура.Ссылка.Родитель.Родитель
				|								ИЗ
				|									Справочник.Номенклатура
				|								ГДЕ
				|									Справочник.Номенклатура.Ссылка В (&СписокПозиций))
				|							И Документ.Проведен
				|							И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|							И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|			
				|			ОБЪЕДИНИТЬ ВСЕ
				|			
				|			ВЫБРАТЬ
				|				ЦеныНоменклатурыСрезПоследних.Скидка,
				|				3,
				|				ЦеныНоменклатурыСрезПоследних.Номенклатура
				|			ИЗ
				|				РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|						КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|						ТипСкидок = &ТипСкидок
				|							И Номенклатура В
				|								(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|									Справочник.Номенклатура.Ссылка.Родитель.Родитель.Родитель
				|								ИЗ
				|									Справочник.Номенклатура
				|								ГДЕ
				|									Справочник.Номенклатура.Ссылка В (&СписокПозиций))
				|							И Документ.Проведен
				|							И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|							И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|			
				|			ОБЪЕДИНИТЬ ВСЕ
				|			
				|			ВЫБРАТЬ
				|				ЦеныНоменклатурыСрезПоследних.Скидка,
				|				4,
				|				ЦеныНоменклатурыСрезПоследних.Номенклатура
				|			ИЗ
				|				РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|						КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|						ТипСкидок = &ТипСкидок
				|							И Номенклатура В
				|								(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|									Справочник.Номенклатура.Ссылка.Родитель.Родитель.Родитель.Родитель
				|								ИЗ
				|									Справочник.Номенклатура
				|								ГДЕ
				|									Справочник.Номенклатура.Ссылка В (&СписокПозиций))
				|							И Документ.Проведен
				|							И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|							И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних) КАК а2
				|		
				|		СГРУППИРОВАТЬ ПО
				|			а2.Номенклатура,
				|			а2.Скидка) КАК а2
				|		ПО а1.уровень = а2.уровень
				|			И а1.Номенклатура = а2.Номенклатура
				|
				|УПОРЯДОЧИТЬ ПО
				|	а1.ДокументДата УБЫВ";
				
				
				
				Запрос.УстановитьПараметр("Дата2",			ТекДатаРасчета);
				Запрос.УстановитьПараметр("ТипСкидок",		ТипСкидок_Контрагент);
				//Запрос.УстановитьПараметр("ТипСкидок_Базовый",ТипСкидок_Контрагент.Базовый);
				Запрос.УстановитьПараметр("СписокПозиций",	МассивНоменклатуры);   	 
				ВремТз=запрос.Выполнить().выгрузить();
				ВремТз.Индексы.Добавить("Номенклатура");
				
				
				
				// запрос 2
				
				запрос2=новый запрос;
				запрос2.Текст="ВЫБРАТЬ
				|	а1.Скидка,
				|	а1.уровень,
				|	а1.Номенклатура,
				|	а1.ДокументДата
				|ИЗ
				|	(ВЫБРАТЬ
				|		ЦеныНоменклатурыСрезПоследних.Скидка КАК Скидка,
				|		0 КАК уровень,
				|		ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
				|		ЦеныНоменклатурыСрезПоследних.Документ.Дата КАК ДокументДата
				|	ИЗ
				|		РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|				КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|				ТипСкидок = &ТипСкидок_Базовый
				|					И Номенклатура В (&СписокПозиций)
				|					И Документ.Проведен
				|					И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|					И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ЦеныНоменклатурыСрезПоследних.Скидка,
				|		1,
				|		ЦеныНоменклатурыСрезПоследних.Номенклатура,
				|		ЦеныНоменклатурыСрезПоследних.Документ.Дата
				|	ИЗ
				|		РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|				КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|				ТипСкидок = &ТипСкидок_Базовый
				|					И Номенклатура В
				|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|							Справочник.Номенклатура.Ссылка.Родитель
				|						ИЗ
				|							Справочник.Номенклатура
				|						ГДЕ
				|							Справочник.Номенклатура.Ссылка В (&СписокПозиций))
				|					И Документ.Проведен
				|					И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|					И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ЦеныНоменклатурыСрезПоследних.Скидка,
				|		2,
				|		ЦеныНоменклатурыСрезПоследних.Номенклатура,
				|		ЦеныНоменклатурыСрезПоследних.Документ.Дата
				|	ИЗ
				|		РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|				КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|				ТипСкидок = &ТипСкидок_Базовый
				|					И Номенклатура В
				|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|							Справочник.Номенклатура.Ссылка.Родитель.Родитель
				|						ИЗ
				|							Справочник.Номенклатура
				|						ГДЕ
				|							Справочник.Номенклатура.Ссылка В (&СписокПозиций))
				|					И Документ.Проведен
				|					И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|					И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ЦеныНоменклатурыСрезПоследних.Скидка,
				|		3,
				|		ЦеныНоменклатурыСрезПоследних.Номенклатура,
				|		ЦеныНоменклатурыСрезПоследних.Документ.Дата
				|	ИЗ
				|		РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|				КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|				ТипСкидок = &ТипСкидок_Базовый
				|					И Номенклатура В
				|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|							Справочник.Номенклатура.Ссылка.Родитель.Родитель.Родитель
				|						ИЗ
				|							Справочник.Номенклатура
				|						ГДЕ
				|							Справочник.Номенклатура.Ссылка В (&СписокПозиций))
				|					И Документ.Проведен
				|					И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|					И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ЦеныНоменклатурыСрезПоследних.Скидка,
				|		4,
				|		ЦеныНоменклатурыСрезПоследних.Номенклатура,
				|		ЦеныНоменклатурыСрезПоследних.Документ.Дата
				|	ИЗ
				|		РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|				КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|				ТипСкидок = &ТипСкидок_Базовый
				|					И Номенклатура В
				|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|							Справочник.Номенклатура.Ссылка.Родитель.Родитель.Родитель.Родитель
				|						ИЗ
				|							Справочник.Номенклатура
				|						ГДЕ
				|							Справочник.Номенклатура.Ссылка В (&СписокПозиций))
				|					И Документ.Проведен
				|					И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|					И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних) КАК а1
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			МИНИМУМ(а2.уровень) КАК уровень,
				|			а2.Номенклатура КАК Номенклатура
				|		ИЗ
				|			(ВЫБРАТЬ
				|				ЦеныНоменклатурыСрезПоследних.Скидка КАК Скидка,
				|				0 КАК уровень,
				|				ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура
				|			ИЗ
				|				РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|						КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|						ТипСкидок = &ТипСкидок_Базовый
				|							И Номенклатура В (&СписокПозиций)
				|							И Документ.Проведен
				|							И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|							И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|			
				|			ОБЪЕДИНИТЬ ВСЕ
				|			
				|			ВЫБРАТЬ
				|				ЦеныНоменклатурыСрезПоследних.Скидка,
				|				1,
				|				ЦеныНоменклатурыСрезПоследних.Номенклатура
				|			ИЗ
				|				РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|						КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|						ТипСкидок = &ТипСкидок_Базовый
				|							И Номенклатура В
				|								(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|									Справочник.Номенклатура.Ссылка.Родитель
				|								ИЗ
				|									Справочник.Номенклатура
				|								ГДЕ
				|									Справочник.Номенклатура.Ссылка В (&СписокПозиций))
				|							И Документ.Проведен
				|							И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|							И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|			
				|			ОБЪЕДИНИТЬ ВСЕ
				|			
				|			ВЫБРАТЬ
				|				ЦеныНоменклатурыСрезПоследних.Скидка,
				|				2,
				|				ЦеныНоменклатурыСрезПоследних.Номенклатура
				|			ИЗ
				|				РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|						КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|						ТипСкидок = &ТипСкидок_Базовый
				|							И Номенклатура В
				|								(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|									Справочник.Номенклатура.Ссылка.Родитель.Родитель
				|								ИЗ
				|									Справочник.Номенклатура
				|								ГДЕ
				|									Справочник.Номенклатура.Ссылка В (&СписокПозиций))
				|							И Документ.Проведен
				|							И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|							И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|			
				|			ОБЪЕДИНИТЬ ВСЕ
				|			
				|			ВЫБРАТЬ
				|				ЦеныНоменклатурыСрезПоследних.Скидка,
				|				3,
				|				ЦеныНоменклатурыСрезПоследних.Номенклатура
				|			ИЗ
				|				РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|						КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|						ТипСкидок = &ТипСкидок_Базовый
				|							И Номенклатура В
				|								(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|									Справочник.Номенклатура.Ссылка.Родитель.Родитель.Родитель
				|								ИЗ
				|									Справочник.Номенклатура
				|								ГДЕ
				|									Справочник.Номенклатура.Ссылка В (&СписокПозиций))
				|							И Документ.Проведен
				|							И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|							И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|			
				|			ОБЪЕДИНИТЬ ВСЕ
				|			
				|			ВЫБРАТЬ
				|				ЦеныНоменклатурыСрезПоследних.Скидка,
				|				4,
				|				ЦеныНоменклатурыСрезПоследних.Номенклатура
				|			ИЗ
				|				РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|						КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|						ТипСкидок = &ТипСкидок_Базовый
				|							И Номенклатура В
				|								(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|									Справочник.Номенклатура.Ссылка.Родитель.Родитель.Родитель.Родитель
				|								ИЗ
				|									Справочник.Номенклатура
				|								ГДЕ
				|									Справочник.Номенклатура.Ссылка В (&СписокПозиций))
				|							И Документ.Проведен
				|							И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|							И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних) КАК а2
				|		
				|		СГРУППИРОВАТЬ ПО
				|			а2.Номенклатура,
				|			а2.Скидка) КАК а2
				|		ПО а1.уровень = а2.уровень
				|			И а1.Номенклатура = а2.Номенклатура
				|
				|УПОРЯДОЧИТЬ ПО
				|	а1.ДокументДата УБЫВ";
				
				
				
				Запрос2.УстановитьПараметр("Дата2",			ТекДатаРасчета);
				Запрос2.УстановитьПараметр("ТипСкидок",		ТипСкидок_Контрагент);
				Запрос2.УстановитьПараметр("ТипСкидок_Базовый",ТипСкидок_Контрагент.Базовый);
				Запрос2.УстановитьПараметр("СписокПозиций",	МассивНоменклатуры);   	 
				ВремТЗ2=запрос2.Выполнить().выгрузить();
				ВремТЗ2.Индексы.Добавить("Номенклатура");
				
				//
				//	//нечаева 11,06,14+++
				//	// Ищем в 1 тз если есть, не переносим. если нет берем цену из тз2 (это по базовому прайсу).
				//	Для каждого Стр из ВремТз2 Цикл
				//		ТекНом=Стр.Номенклатура;
				//							
				//		СтрПоиск=ВремТз.найти(ТекНом,"Номенклатура");
				//		Если СтрПоиск=Неопределено тогда
				//			 // нет цены по не базовой цене, перенесем по базовой.
				//			НовСтр=ВремТз.Добавить();
				//			НовСтр.Номенклатура= Стр.Номенклатура;
				//			НовСтр.Скидка=Стр.Скидка;
				//			НовСтр.Уровень=Стр.Уровень;
				//		Конецесли;	
				//			
				//	КонецЦикла;
				//	 //нечаева 11,06,14---
				
				
				//нечаева 1806,14 +++ нулевые цены 
				//нечаева 11,06,14+++
				// Ищем в 1 тз если есть, не переносим. если нет берем цену из тз2 (это по базовому прайсу).
				Для каждого Стр из ВремТз2 Цикл
					ТекНом=Стр.Номенклатура;
					
					СтрПоиск=ВремТз.найти(ТекНом,"Номенклатура");
					Если СтрПоиск=Неопределено ИЛИ СтрПоиск.Скидка=0  тогда
						// нет цены по не базовой цене, перенесем по базовой.
						НовСтр=ВремТз.Добавить();
						НовСтр.Номенклатура= Стр.Номенклатура;
						НовСтр.Скидка=Стр.Скидка;
						НовСтр.Уровень=Стр.Уровень;
						НовСтр.ДокументДата=Стр.ДокументДата;
						
					Конецесли;	
					
				КонецЦикла;
				//нечаева 11,06,14---
				ВремТз.Сортировать("ДокументДата Убыв");
				//нечаева 1806,14 +++ нулевые цены ---
				
				
				
				
			Конецесли;
			
			ЕСЛИ ЗначениеЗаполнено(Номенклатура) тогда
				Стр=ВремТз.найти(номенклатура,"Номенклатура");
				Если Стр=Неопределено тогда    
					Стр=ВремТз.найти(номенклатура.родитель,"Номенклатура");
					Если Стр=Неопределено тогда
						Стр=ВремТз.найти(номенклатура.родитель.родитель,"Номенклатура");
						Если Стр=Неопределено тогда
							// нечаева 02,06,14 +++  добавила тз2
							
							Стр=ВремТЗ2.найти(номенклатура.родитель.родитель,"Номенклатура");
							Если Стр=Неопределено тогда
								Возврат(0);
								
							иначе
								Возврат(стр.Цена);
							Конецесли;	
							
							// нечаева 02,06,14 ---
							
						иначе
							Возврат(стр.скидка);
						Конецесли;	  
						
						Возврат(0);
					иначе
						Возврат(стр.скидка);
					Конецесли;
					возврат(0);
				иначе
					Возврат(стр.скидка);
				Конецесли;
			Конецесли;
			Возврат(0);
			
			
			//нечаева 02,06,14 ----
			
			
		иначе
			//-----------------------------------------------------------------------------
			//Нечаева 14,08,13 ++++
			//считается основной тип скидок, если нет базовой скидки
			Запрос=Новый Запрос;
			Запрос.Текст="
			|ВЫБРАТЬ ПЕРВЫЕ 1		
			|	Скидка,
			|	ВЫБОР 
			|		КОГДА Номенклатура	=&Номенклатура0 ТОГДА 0
			|		КОГДА Номенклатура	=&Номенклатура1 ТОГДА 1
			|		КОГДА Номенклатура	=&Номенклатура2 ТОГДА 2
			|		КОГДА Номенклатура	=&Номенклатура3 ТОГДА 3
			|		КОГДА Номенклатура	=&Номенклатура3 ТОГДА 4
			// Кухарь А.Ю. 13.10.2022 начало
			//+1 уровень иерархии
			 |		КОГДА Номенклатура	=&Номенклатура5 ТОГДА 5
			// Кухарь А.Ю. 13.10.2022 конец
			
			|	ИНАЧЕ 100 
			|	КОНЕЦ КАК Уровень
			|ИЗ
			|РегистрСведений.СкидкиНоменклатуры.СрезПоследних(КонецПериода(&Дата2,День),
			|	(ТипСкидок = &ТипСкидок)
			|	И Номенклатура В (&СписокПозиций)
			|	И Документ.Проведен
			|	И КОНЕЦПЕРИОДА(Документ.Дата2,День) >= &Дата2 и документ.Дата < &Дата2		
			|	) КАК ЦеныНоменклатурыСрезПоследних		
			|УПОРЯДОЧИТЬ ПО Документ.Дата Убыв,Уровень";
			
			Запрос.УстановитьПараметр("Дата2",			ТекДатаРасчета);
			Запрос.УстановитьПараметр("ТипСкидок",		ТипСкидок_Контрагент);
			//крохин начало
			//добавил базовый тип скидок, аналогично типу цен
			Запрос.УстановитьПараметр("ТипСкидок_Базовый",		ТипСкидок_Контрагент.Базовый);
			//крохин конец
			
			СписокПозиций=Новый Массив;
			
			Уровень=0;		
			ТекРодитель=Номенклатура;
			// Кухарь А.Ю. 13.10.2022 начало
			//+1 уровень иерархии
			//Пока Уровень<5 Цикл
			Пока Уровень<6 Цикл
				// Кухарь А.Ю. 13.10.2022 конец
				СписокПозиций.Добавить(ТекРодитель);		
				Запрос.УстановитьПараметр("Номенклатура"+Уровень,ТекРодитель);
				
				Уровень=Уровень+1;
				ТекРодитель=ТекРодитель.Родитель;	
			КонецЦикла;
			
			Запрос.УстановитьПараметр("СписокПозиций",	СписокПозиций);
			
			Результат=Запрос.Выполнить();
			
			Выборка=Результат.Выбрать();
			//нечаева 18,06,14 +++ проверку на нулев скидку
			Пока Выборка.Следующий()  и Выборка.Скидка<>0 Цикл			
				Возврат  Выборка.Скидка;
			КонецЦикла;
			//нечаева 18,06,14 ---
			
			//считается базовы тип скидок
			// если он есть то основной не смотрим и не сравниваем
			Запрос=Новый Запрос;
			Запрос.Текст="
			|ВЫБРАТЬ ПЕРВЫЕ 1		
			|	Скидка,
			|	ВЫБОР 
			|		КОГДА Номенклатура	=&Номенклатура0 ТОГДА 0
			|		КОГДА Номенклатура	=&Номенклатура1 ТОГДА 1
			|		КОГДА Номенклатура	=&Номенклатура2 ТОГДА 2
			|		КОГДА Номенклатура	=&Номенклатура3 ТОГДА 3
			|		КОГДА Номенклатура	=&Номенклатура3 ТОГДА 4
			// Кухарь А.Ю. 13.10.2022 начало
			//+1 уровень иерархии
			 |		КОГДА Номенклатура	=&Номенклатура5 ТОГДА 5
			// Кухарь А.Ю. 13.10.2022 конец
			
			|	ИНАЧЕ 100 
			|	КОНЕЦ КАК Уровень
			|ИЗ
			|РегистрСведений.СкидкиНоменклатуры.СрезПоследних(КонецПериода(&Дата2,День),
			|	(ТипСкидок = &ТипСкидок_Базовый)
			//|	(ТипСкидок = &ТипСкидок ИЛИ ТипСкидок = &ТипСкидок_Базовый)
			|	И Номенклатура В (&СписокПозиций)
			|	И Документ.Проведен
			|	И КОНЕЦПЕРИОДА(Документ.Дата2,День) >= &Дата2 и документ.Дата < &Дата2		
			|	) КАК ЦеныНоменклатурыСрезПоследних		
			|УПОРЯДОЧИТЬ ПО Документ.Дата Убыв,Уровень";
			
			Запрос.УстановитьПараметр("Дата2",			ТекДатаРасчета);
			Запрос.УстановитьПараметр("ТипСкидок",		ТипСкидок_Контрагент);
			//крохин начало
			//добавил базовый тип скидок, аналогично типу цен
			Запрос.УстановитьПараметр("ТипСкидок_Базовый",		ТипСкидок_Контрагент.Базовый);
			//крохин конец
			
			СписокПозиций=Новый Массив;
			
			Уровень=0;		
			ТекРодитель=Номенклатура;
			// Кухарь А.Ю. 13.10.2022 начало
			//+1 уровень иерархии
			//Пока Уровень<5 Цикл
			Пока Уровень<6 Цикл
				// Кухарь А.Ю. 13.10.2022 конец
				СписокПозиций.Добавить(ТекРодитель);		
				Запрос.УстановитьПараметр("Номенклатура"+Уровень,ТекРодитель);
				
				Уровень=Уровень+1;
				ТекРодитель=ТекРодитель.Родитель;	
			КонецЦикла;
			
			Запрос.УстановитьПараметр("СписокПозиций",	СписокПозиций);
			
			Результат=Запрос.Выполнить();
			
			Выборка=Результат.Выбрать();
			Пока Выборка.Следующий() Цикл			
				Возврат  Выборка.Скидка;
			КонецЦикла;
			
			
		Конецесли;
		//Нечаева 14,08,13 --------
		
		
		
	Иначе
		Запрос=Новый Запрос;
		//Запрос.Текст="
		//|ВЫБРАТЬ ПЕРВЫЕ 1		
		//|	Скидка,ТипЦен,
		//|	ВЫБОР 
		//|		КОГДА Номенклатура	=&Номенклатура0 ТОГДА 0
		//|		КОГДА Номенклатура	=&Номенклатура1 ТОГДА 1
		//|		КОГДА Номенклатура	=&Номенклатура2 ТОГДА 2
		//|		КОГДА Номенклатура	=&Номенклатура3 ТОГДА 3
		//|		КОГДА Номенклатура	=&Номенклатура4 ТОГДА 4
		//// Кухарь А.Ю. 13.10.2022 начало
		////+1 уровень иерархии
		//|		КОГДА Номенклатура	=&Номенклатура5 ТОГДА 5 
		//// Кухарь А.Ю. 13.10.2022 конец
		//
		//|	ИНАЧЕ 100 
		//|	КОНЕЦ КАК Уровень
		//|ИЗ
		//|	Справочник.Контрагенты.Скидки
		//|ГДЕ
		//|	Ссылка = &Контрагент		
		//|	И Номенклатура В (&СписокПозиций)
		//|УПОРЯДОЧИТЬ ПО Уровень";
		
		// Шворобей ВЮ 05.03.2024 ++
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СкидкиКонтрагентов.Скидка КАК Скидка,
		|	СкидкиКонтрагентов.ТипЦен КАК ТипЦен,
		|	ВЫБОР
		|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура0
		|			ТОГДА 0
		|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура1
		|			ТОГДА 1
		|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура2
		|			ТОГДА 2
		|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура3
		|			ТОГДА 3
		|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура4
		|			ТОГДА 4
		|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура5
		|			ТОГДА 5
		|		ИНАЧЕ 100
		|	КОНЕЦ КАК Уровень
		|ИЗ
		|	РегистрСведений.СкидкиКонтрагентов КАК СкидкиКонтрагентов
		|ГДЕ
		|	СкидкиКонтрагентов.Номенклатура В(&СписокПозиций)
		|	И СкидкиКонтрагентов.Контрагент = &Контрагент
		|
		|УПОРЯДОЧИТЬ ПО
		|	Уровень";
		// Шворобей ВЮ 05.03.2024 ++
			
		Запрос.УстановитьПараметр("Контрагент", ?(ЗначениеЗаполнено(ТипСкидок_Контрагент.Ведущий), ТипСкидок_Контрагент.Ведущий, ТипСкидок_Контрагент));		
		
		СписокПозиций=Новый Массив;
		
		Уровень=0;		
		ТекРодитель=Номенклатура;
		// Кухарь А.Ю. 13.10.2022 начало
		//+1 уровень иерархии
		//Пока Уровень<5 Цикл
		Пока Уровень<6 Цикл
			// Кухарь А.Ю. 13.10.2022 конец
			СписокПозиций.Добавить(ТекРодитель);		
			Запрос.УстановитьПараметр("Номенклатура"+Уровень,ТекРодитель);
			
			Уровень=Уровень+1;
			ТекРодитель=ТекРодитель.Родитель;			
		КонецЦикла;
		
		Запрос.УстановитьПараметр("СписокПозиций",	СписокПозиций);
		
		Результат=Запрос.Выполнить();
		
		Выборка=Результат.Выбрать();
		Пока Выборка.Следующий() Цикл			
			ТипЦенСкидок=Выборка.ТипЦен;
			Возврат  Выборка.Скидка;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции // ПолучитьСкидкуНоменклатуры()


//нечаева 13,07,22++
функция АкцияДействуетДляКонтрагента(ТекДокумент,ТипСкидок_Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	УстановкаСкидокПоКонтрагентамКонтрагенты.Согласован КАК Согласован
	|ИЗ
	|	Документ.УстановкаСкидокПоКонтрагентам.Контрагенты КАК УстановкаСкидокПоКонтрагентамКонтрагенты
	|ГДЕ
	|	УстановкаСкидокПоКонтрагентамКонтрагенты.Контрагент = &Контрагент
	|	И УстановкаСкидокПоКонтрагентамКонтрагенты.Ссылка = &Документ
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("Документ",ТекДокумент);
	запрос.УстановитьПараметр("Контрагент",ТипСкидок_Контрагент);
	Выборка = запрос.Выполнить().Выбрать();
	Если выборка.Следующий() тогда
		
		возврат выборка.согласован;
	КонецЕсли;	
	
	возврат ложь;
	
конецфункции	
//нечаева 13,07,22 ---


//крохин начало 12.01.2021
//для РНК нужен флаг "акция"
//Функция ПолучитьСкидкуНоменклатуры(Номенклатура,ТипСкидок_Контрагент,ДатаРасчета=Неопределено,ТипЦенСкидок=Неопределено,МассивНоменклатуры=НЕОПРЕДЕЛЕНО,ВремТз=НЕОПРЕДЕЛЕНО) Экспорт
Функция ПолучитьСкидкуНоменклатуры(Номенклатура,ТипСкидок_Контрагент,ДатаРасчета=Неопределено,ТипЦенСкидок=Неопределено,МассивНоменклатуры=НЕОПРЕДЕЛЕНО,ВремТз=НЕОПРЕДЕЛЕНО,ФиксироватьАкцию=Ложь) Экспорт
	//крохин конец 12.01.2021	
	
	Если ТипЗнч(ТипСкидок_Контрагент)=Тип("СправочникСсылка.ТипыСкидок") Тогда		//по типу скидок
		Если ДатаРасчета=Неопределено Тогда
			#Если Клиент Тогда
				// нечаева 06,08,13 +++ было везде на конец дня
				//ТекДатаРасчета=КонецДня(РабочаяДата);
				ТекДатаРасчета=ТекущаяДата(); //РабочаяДата;
			#Иначе
				ТекДатаРасчета=ТекущаяДата();		
			#КонецЕсли		
		Иначе
			ТекДатаРасчета=ДатаРасчета;	
		КонецЕсли;
		
		Если НЕ(ВремТз="" или ВремТз=НЕОПРЕДЕЛЕНО) И ЗначениеЗаполнено(Номенклатура) тогда
			Стр=ВремТз.найти(номенклатура,"Номенклатура");
			Если Стр=Неопределено тогда    
				Стр=ВремТз.найти(номенклатура.родитель,"Номенклатура");
				Если Стр=Неопределено тогда
					Стр=ВремТз.найти(номенклатура.родитель.родитель,"Номенклатура");
					Если Стр=Неопределено тогда
						Возврат(0);
					иначе
						Возврат(стр.скидка);
					Конецесли;	  
					
					Возврат(0);
				иначе
					Возврат(стр.скидка);
				Конецесли;
				возврат(0);
			иначе
				Возврат(стр.скидка);
			Конецесли;
			
		Конецесли;
		
		если МассивНоменклатуры<>Неопределено тогда //Передали что-то
			Если ВремТз="" тогда
				//нечева 18,06,14--- оптимизация запроса						
				// 1 уровень	
				Запр=Новый Запрос;
				Запр.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Номенклатура.Ссылка.Родитель
				|ИЗ
				|	Справочник.Номенклатура КАК Номенклатура
				|ГДЕ
				|	Номенклатура.Ссылка В(&СписокПозиций)";
				Запр.УстановитьПараметр("СписокПозиций",	МассивНоменклатуры);  
				СписокПозиций1=запр.Выполнить().Выгрузить();
				//второй уровень
				Запр=Новый Запрос;
				Запр.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Номенклатура.Ссылка.Родитель
				|ИЗ
				|	Справочник.Номенклатура КАК Номенклатура
				|ГДЕ
				|	Номенклатура.Ссылка В(&СписокПозиций)";
				Запр.УстановитьПараметр("СписокПозиций",	СписокПозиций1);  
				СписокПозиций2=запр.Выполнить().Выгрузить();
				// 3
				Запр=Новый Запрос;
				Запр.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Номенклатура.Ссылка.Родитель
				|ИЗ
				|	Справочник.Номенклатура КАК Номенклатура
				|ГДЕ
				|	Номенклатура.Ссылка В(&СписокПозиций)";
				Запр.УстановитьПараметр("СписокПозиций",	СписокПозиций2);  
				СписокПозиций3=запр.Выполнить().Выгрузить();
				// 4
				Запр=Новый Запрос;
				Запр.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Номенклатура.Ссылка.Родитель
				|ИЗ
				|	Справочник.Номенклатура КАК Номенклатура
				|ГДЕ
				|	Номенклатура.Ссылка В(&СписокПозиций)";
				Запр.УстановитьПараметр("СписокПозиций",	СписокПозиций3);  
				СписокПозиций4=запр.Выполнить().Выгрузить();
				
				
				
				
				//нечаева 02,06,14 разделила на два запроса  ++++
				
				запрос=новый запрос;
				
				запрос.Текст="ВЫБРАТЬ
				|	а1.Скидка,
				|	а1.уровень,
				|	а1.Номенклатура,
				|	а1.ДокументДата
				|ИЗ
				|	(ВЫБРАТЬ
				|		ЦеныНоменклатурыСрезПоследних.Скидка КАК Скидка,
				|		0 КАК уровень,
				|		ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
				|		ЦеныНоменклатурыСрезПоследних.Документ.Дата КАК ДокументДата
				|	ИЗ
				|		РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|				КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|				ТипСкидок = &ТипСкидок
				|					И Номенклатура В (&СписокПозиций)
				|					И Документ.Проведен
				|					И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|					И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ЦеныНоменклатурыСрезПоследних.Скидка,
				|		1,
				|		ЦеныНоменклатурыСрезПоследних.Номенклатура,
				|		ЦеныНоменклатурыСрезПоследних.Документ.Дата
				|	ИЗ
				|		РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|				КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|				ТипСкидок = &ТипСкидок
				|					И Номенклатура В (&СписокПозиций1)
				|					И Документ.Проведен
				|					И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|					И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ЦеныНоменклатурыСрезПоследних.Скидка,
				|		2,
				|		ЦеныНоменклатурыСрезПоследних.Номенклатура,
				|		ЦеныНоменклатурыСрезПоследних.Документ.Дата
				|	ИЗ
				|		РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|				КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|				ТипСкидок = &ТипСкидок
				|					И Номенклатура В (&СписокПозиций2)
				|					И Документ.Проведен
				|					И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|					И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ЦеныНоменклатурыСрезПоследних.Скидка,
				|		3,
				|		ЦеныНоменклатурыСрезПоследних.Номенклатура,
				|		ЦеныНоменклатурыСрезПоследних.Документ.Дата
				|	ИЗ
				|		РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|				КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|				ТипСкидок = &ТипСкидок
				|					И Номенклатура В (&СписокПозиций3)
				|					И Документ.Проведен
				|					И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|					И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ЦеныНоменклатурыСрезПоследних.Скидка,
				|		4,
				|		ЦеныНоменклатурыСрезПоследних.Номенклатура,
				|		ЦеныНоменклатурыСрезПоследних.Документ.Дата
				|	ИЗ
				|		РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|				КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|				ТипСкидок = &ТипСкидок
				|					И Номенклатура В (&СписокПозиций4)
				|					И Документ.Проведен
				|					И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|					И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних) КАК а1
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			МИНИМУМ(а2.уровень) КАК уровень,
				|			а2.Номенклатура КАК Номенклатура
				|		ИЗ
				|			(ВЫБРАТЬ
				|				ЦеныНоменклатурыСрезПоследних.Скидка КАК Скидка,
				|				0 КАК уровень,
				|				ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура
				|			ИЗ
				|				РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|						КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|						ТипСкидок = &ТипСкидок
				|							И Номенклатура В (&СписокПозиций)
				|							И Документ.Проведен
				|							И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|							И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|			
				|			ОБЪЕДИНИТЬ ВСЕ
				|			
				|			ВЫБРАТЬ
				|				ЦеныНоменклатурыСрезПоследних.Скидка,
				|				1,
				|				ЦеныНоменклатурыСрезПоследних.Номенклатура
				|			ИЗ
				|				РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|						КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|						ТипСкидок = &ТипСкидок
				|							И Номенклатура В (&СписокПозиций1)
				|							И Документ.Проведен
				|							И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|							И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|			
				|			ОБЪЕДИНИТЬ ВСЕ
				|			
				|			ВЫБРАТЬ
				|				ЦеныНоменклатурыСрезПоследних.Скидка,
				|				2,
				|				ЦеныНоменклатурыСрезПоследних.Номенклатура
				|			ИЗ
				|				РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|						КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|						ТипСкидок = &ТипСкидок
				|							И Номенклатура В (&СписокПозиций2)
				|							И Документ.Проведен
				|							И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|							И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|			
				|			ОБЪЕДИНИТЬ ВСЕ
				|			
				|			ВЫБРАТЬ
				|				ЦеныНоменклатурыСрезПоследних.Скидка,
				|				3,
				|				ЦеныНоменклатурыСрезПоследних.Номенклатура
				|			ИЗ
				|				РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|						КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|						ТипСкидок = &ТипСкидок
				|							И Номенклатура В (&СписокПозиций3)
				|							И Документ.Проведен
				|							И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|							И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|			
				|			ОБЪЕДИНИТЬ ВСЕ
				|			
				|			ВЫБРАТЬ
				|				ЦеныНоменклатурыСрезПоследних.Скидка,
				|				4,
				|				ЦеныНоменклатурыСрезПоследних.Номенклатура
				|			ИЗ
				|				РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|						КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|						ТипСкидок = &ТипСкидок
				|							И Номенклатура В (&СписокПозиций4)
				|							И Документ.Проведен
				|							И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|							И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних) КАК а2
				|		
				|		СГРУППИРОВАТЬ ПО
				|			а2.Номенклатура,
				|			а2.Скидка) КАК а2
				|		ПО а1.уровень = а2.уровень
				|			И а1.Номенклатура = а2.Номенклатура
				|
				|УПОРЯДОЧИТЬ ПО
				|	а1.ДокументДата УБЫВ";
				
				
				
				Запрос.УстановитьПараметр("Дата2",			ТекДатаРасчета);
				Запрос.УстановитьПараметр("ТипСкидок",		ТипСкидок_Контрагент);
				//Запрос.УстановитьПараметр("ТипСкидок_Базовый",ТипСкидок_Контрагент.Базовый);
				Запрос.УстановитьПараметр("СписокПозиций",	МассивНоменклатуры); 
				Запрос.УстановитьПараметр("СписокПозиций1",СписокПозиций1);
				Запрос.УстановитьПараметр("СписокПозиций2",СписокПозиций2);
				Запрос.УстановитьПараметр("СписокПозиций3",СписокПозиций3);
				Запрос.УстановитьПараметр("СписокПозиций4",СписокПозиций4);
				
				// 12.09.2014 +++ нечаева
				ВремТз=запрос.Выполнить().выгрузить();
				ВремТз.Индексы.Добавить("Номенклатура");
				
				МоделиТЗ= ВремТз.Скопировать();
				МоделиТЗ.Свернуть("Номенклатура");
				
				/// удаляем списанные скидки =-1.
				Для каждого Стр из МоделиТЗ цикл
					
					
					ТекНом=Стр.Номенклатура;
					
					Отбор = Новый Структура();
					Отбор.Вставить("Номенклатура",ТекНом);
					
					СтрПоиск=ВремТз.найтиСтроки(Отбор);
					
					Если СтрПоиск.Количество()>0 и СтрПоиск[0].Скидка=-1 Тогда
						
						Для каждого СТРН из СтрПоиск цикл
							
							ВремТз.Удалить(СтрН);
							
						конецЦикла;
						
					конецесли;
					
				КонецЦикла;
				
				ВремТз.Сортировать("ДокументДата Убыв");
				// 12.09.2014  нечаева   -------
				
				
				
				// запрос 2
				
				запрос2=новый запрос;
				запрос2.Текст="ВЫБРАТЬ
				|	а1.Скидка,
				|	а1.уровень,
				|	а1.Номенклатура,
				|	а1.ДокументДата
				|ИЗ
				|	(ВЫБРАТЬ
				|		ЦеныНоменклатурыСрезПоследних.Скидка КАК Скидка,
				|		0 КАК уровень,
				|		ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
				|		ЦеныНоменклатурыСрезПоследних.Документ.Дата КАК ДокументДата
				|	ИЗ
				|		РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|				КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|				ТипСкидок = &ТипСкидок_Базовый
				|					И Номенклатура В (&СписокПозиций)
				|					И Документ.Проведен
				|					И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|					И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ЦеныНоменклатурыСрезПоследних.Скидка,
				|		1,
				|		ЦеныНоменклатурыСрезПоследних.Номенклатура,
				|		ЦеныНоменклатурыСрезПоследних.Документ.Дата
				|	ИЗ
				|		РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|				КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|				ТипСкидок = &ТипСкидок_Базовый
				|					И Номенклатура В (&СписокПозиций1)
				|					И Документ.Проведен
				|					И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|					И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ЦеныНоменклатурыСрезПоследних.Скидка,
				|		2,
				|		ЦеныНоменклатурыСрезПоследних.Номенклатура,
				|		ЦеныНоменклатурыСрезПоследних.Документ.Дата
				|	ИЗ
				|		РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|				КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|				ТипСкидок = &ТипСкидок_Базовый
				|					И Номенклатура В (&СписокПозиций2)
				|					И Документ.Проведен
				|					И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|					И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ЦеныНоменклатурыСрезПоследних.Скидка,
				|		3,
				|		ЦеныНоменклатурыСрезПоследних.Номенклатура,
				|		ЦеныНоменклатурыСрезПоследних.Документ.Дата
				|	ИЗ
				|		РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|				КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|				ТипСкидок = &ТипСкидок_Базовый
				|					И Номенклатура В (&СписокПозиций3)
				|					И Документ.Проведен
				|					И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|					И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ЦеныНоменклатурыСрезПоследних.Скидка,
				|		4,
				|		ЦеныНоменклатурыСрезПоследних.Номенклатура,
				|		ЦеныНоменклатурыСрезПоследних.Документ.Дата
				|	ИЗ
				|		РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|				КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|				ТипСкидок = &ТипСкидок_Базовый
				|					И Номенклатура В (&СписокПозиций4)
				|					И Документ.Проведен
				|					И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|					И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних) КАК а1
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			МИНИМУМ(а2.уровень) КАК уровень,
				|			а2.Номенклатура КАК Номенклатура
				|		ИЗ
				|			(ВЫБРАТЬ
				|				ЦеныНоменклатурыСрезПоследних.Скидка КАК Скидка,
				|				0 КАК уровень,
				|				ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура
				|			ИЗ
				|				РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|						КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|						ТипСкидок = &ТипСкидок_Базовый
				|							И Номенклатура В (&СписокПозиций)
				|							И Документ.Проведен
				|							И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|							И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|			
				|			ОБЪЕДИНИТЬ ВСЕ
				|			
				|			ВЫБРАТЬ
				|				ЦеныНоменклатурыСрезПоследних.Скидка,
				|				1,
				|				ЦеныНоменклатурыСрезПоследних.Номенклатура
				|			ИЗ
				|				РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|						КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|						ТипСкидок = &ТипСкидок_Базовый
				|							И Номенклатура В (&СписокПозиций1)
				|							И Документ.Проведен
				|							И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|							И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|			
				|			ОБЪЕДИНИТЬ ВСЕ
				|			
				|			ВЫБРАТЬ
				|				ЦеныНоменклатурыСрезПоследних.Скидка,
				|				2,
				|				ЦеныНоменклатурыСрезПоследних.Номенклатура
				|			ИЗ
				|				РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|						КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|						ТипСкидок = &ТипСкидок_Базовый
				|							И Номенклатура В (&СписокПозиций2)
				|							И Документ.Проведен
				|							И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|							И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|			
				|			ОБЪЕДИНИТЬ ВСЕ
				|			
				|			ВЫБРАТЬ
				|				ЦеныНоменклатурыСрезПоследних.Скидка,
				|				3,
				|				ЦеныНоменклатурыСрезПоследних.Номенклатура
				|			ИЗ
				|				РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|						КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|						ТипСкидок = &ТипСкидок_Базовый
				|							И Номенклатура В (&СписокПозиций3)
				|							И Документ.Проведен
				|							И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|							И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|			
				|			ОБЪЕДИНИТЬ ВСЕ
				|			
				|			ВЫБРАТЬ
				|				ЦеныНоменклатурыСрезПоследних.Скидка,
				|				4,
				|				ЦеныНоменклатурыСрезПоследних.Номенклатура
				|			ИЗ
				|				РегистрСведений.СкидкиНоменклатуры.СрезПоследних(
				|						КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|						ТипСкидок = &ТипСкидок_Базовый
				|							И Номенклатура В (&СписокПозиций4)
				|							И Документ.Проведен
				|							И КОНЕЦПЕРИОДА(Документ.Дата2, ДЕНЬ) >= &Дата2
				|							И документ.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних) КАК а2
				|		
				|		СГРУППИРОВАТЬ ПО
				|			а2.Номенклатура,
				|			а2.Скидка) КАК а2
				|		ПО а1.уровень = а2.уровень
				|			И а1.Номенклатура = а2.Номенклатура
				|
				|УПОРЯДОЧИТЬ ПО
				|	а1.ДокументДата УБЫВ";
				
				
				
				Запрос2.УстановитьПараметр("Дата2",			ТекДатаРасчета);
				Запрос2.УстановитьПараметр("ТипСкидок",		ТипСкидок_Контрагент);
				Запрос2.УстановитьПараметр("ТипСкидок_Базовый",ТипСкидок_Контрагент.Базовый);
				Запрос2.УстановитьПараметр("СписокПозиций",	МассивНоменклатуры);
				
				Запрос2.УстановитьПараметр("СписокПозиций1",СписокПозиций1);
				Запрос2.УстановитьПараметр("СписокПозиций2",СписокПозиций2);
				Запрос2.УстановитьПараметр("СписокПозиций3",СписокПозиций3);
				Запрос2.УстановитьПараметр("СписокПозиций4",СписокПозиций4);
				
				
				ВремТЗ2=запрос2.Выполнить().выгрузить();
				ВремТЗ2.Индексы.Добавить("Номенклатура");
				
				
				
				//нечаева 1806,14 +++ нулевые цены 
				//нечаева 11,06,14+++
				// Ищем в 1 тз если есть, не переносим. если нет берем цену из тз2 (это по базовому прайсу).
				Для каждого Стр из ВремТз2 Цикл
					ТекНом=Стр.Номенклатура;
					
					СтрПоиск=ВремТз.найти(ТекНом,"Номенклатура");
					// 12.09.2014 +++ нечаева
					Если СтрПоиск=Неопределено или СтрПоиск.Скидка=-1 тогда  
						// 12.09.2014 --- нечаева
						// нет скидки по не базовой цене, перенесем по базовой.
						НовСтр=ВремТз.Добавить();
						НовСтр.Номенклатура= Стр.Номенклатура;
						НовСтр.Скидка=Стр.Скидка;
						НовСтр.Уровень=Стр.Уровень;
						НовСтр.ДокументДата=Стр.ДокументДата;
						
					Конецесли;	
					
				КонецЦикла;
				//нечаева 11,06,14---
				ВремТз.Сортировать("ДокументДата Убыв");
				//нечаева 1806,14 +++ нулевые цены ---
				
				
			Конецесли;
			
			// 12.09.2014 +++ нечаева
			ПолученнаяСкидка=0;
			ЕСЛИ ЗначениеЗаполнено(Номенклатура) тогда
				Стр=ВремТз.найти(номенклатура,"Номенклатура");
				Если Стр=Неопределено тогда    
					Стр=ВремТз.найти(номенклатура.родитель,"Номенклатура");
					Если Стр=Неопределено тогда
						Стр=ВремТз.найти(номенклатура.родитель.родитель,"Номенклатура");
						Если Стр=Неопределено тогда
							// нечаева 02,06,14 +++  добавила тз2
							
							Стр=ВремТЗ2.найти(номенклатура.родитель.родитель,"Номенклатура");
							Если Стр=Неопределено тогда
								Возврат(0);
								
							иначе
								Возврат(стр.Скидка);
							Конецесли;	
							
							// нечаева 02,06,14 ---
							
						иначе
							//	Возврат(стр.скидка);
							ПолученнаяСкидка=Стр.скидка;
						Конецесли;	  
						
						Возврат(0);
					иначе
						//	Возврат(стр.скидка);
						ПолученнаяСкидка=Стр.скидка;
					Конецесли;
					возврат(0);
				иначе
					//	Возврат(стр.скидка);
					ПолученнаяСкидка=Стр.скидка;
				Конецесли;
			Конецесли;
			
			
			Если ПолученнаяСкидка=-1 Тогда
				Возврат(0);
			иначе
				Возврат(ПолученнаяСкидка);
			КонецЕсли;	
			
			Возврат(0);
			
			// 12.09.2014 --- нечаева
			
			//нечева 18,06,14---		 
		иначе
			//-----------------------------------------------------------------------------
			//Нечаева 14,08,13 ++++
			//считается основной тип скидок, если нет базовой скидки
			Запрос=Новый Запрос;
			Запрос.Текст="
			|ВЫБРАТЬ ПЕРВЫЕ 1		
			|	Скидка,
			|	ВЫБОР 
			|		КОГДА Номенклатура	=&Номенклатура0 ТОГДА 0
			|		КОГДА Номенклатура	=&Номенклатура1 ТОГДА 1
			|		КОГДА Номенклатура	=&Номенклатура2 ТОГДА 2
			|		КОГДА Номенклатура	=&Номенклатура3 ТОГДА 3
			|		КОГДА Номенклатура	=&Номенклатура3 ТОГДА 4
				// Кухарь А.Ю. 13.10.2022 начало
			//+1 уровень иерархии
			 |		КОГДА Номенклатура	=&Номенклатура5 ТОГДА 5
			// Кухарь А.Ю. 13.10.2022 конец
		
			|	ИНАЧЕ 100 
			|	КОНЕЦ КАК Уровень
			|ИЗ
			|РегистрСведений.СкидкиНоменклатуры.СрезПоследних(КонецПериода(&Дата2,День),
			|	(ТипСкидок = &ТипСкидок)
			|	И Номенклатура В (&СписокПозиций)
			|	И Документ.Проведен
			|	И КОНЕЦПЕРИОДА(Документ.Дата2,День) >= &Дата2 и документ.Дата < &Дата2		
			|	) КАК ЦеныНоменклатурыСрезПоследних		
			|УПОРЯДОЧИТЬ ПО Документ.Дата Убыв,Уровень";
			
			Запрос.УстановитьПараметр("Дата2",			ТекДатаРасчета);
			Запрос.УстановитьПараметр("ТипСкидок",		ТипСкидок_Контрагент);
			//крохин начало
			//добавил базовый тип скидок, аналогично типу цен
			Запрос.УстановитьПараметр("ТипСкидок_Базовый",		ТипСкидок_Контрагент.Базовый);
			//крохин конец
			
			СписокПозиций=Новый Массив;
			
			Уровень=0;		
			ТекРодитель=Номенклатура;
			// Кухарь А.Ю. 13.10.2022 начало
			//+1 уровень иерархии
			//Пока Уровень<5 Цикл
			Пока Уровень<6 Цикл
				// Кухарь А.Ю. 13.10.2022 конец
				СписокПозиций.Добавить(ТекРодитель);		
				Запрос.УстановитьПараметр("Номенклатура"+Уровень,ТекРодитель);
				
				Уровень=Уровень+1;
				ТекРодитель=ТекРодитель.Родитель;	
			КонецЦикла;
			
			Запрос.УстановитьПараметр("СписокПозиций",	СписокПозиций);
			
			Результат=Запрос.Выполнить();
			
			Выборка=Результат.Выбрать();
			// нечаева 12,09,14
			Пока Выборка.Следующий() Цикл
				Если Выборка.Скидка=-1 Тогда 
					прервать;
				иначе
					Возврат  Выборка.Скидка;
				конецЕсли;
			КонецЦикла;
			// нечаева 12,09,14+++
			
			//считается базовы тип скидок
			// если он есть то основной не смотрим и не сравниваем
			Запрос=Новый Запрос;
			Запрос.Текст="
			|ВЫБРАТЬ ПЕРВЫЕ 1		
			|	Скидка,
			|	ВЫБОР 
			|		КОГДА Номенклатура	=&Номенклатура0 ТОГДА 0
			|		КОГДА Номенклатура	=&Номенклатура1 ТОГДА 1
			|		КОГДА Номенклатура	=&Номенклатура2 ТОГДА 2
			|		КОГДА Номенклатура	=&Номенклатура3 ТОГДА 3
			|		КОГДА Номенклатура	=&Номенклатура3 ТОГДА 4
				// Кухарь А.Ю. 13.10.2022 начало
			//+1 уровень иерархии
			 |		КОГДА Номенклатура	=&Номенклатура5 ТОГДА 5
			// Кухарь А.Ю. 13.10.2022 конец
		
			|	ИНАЧЕ 100 
			|	КОНЕЦ КАК Уровень
			|ИЗ
			|РегистрСведений.СкидкиНоменклатуры.СрезПоследних(КонецПериода(&Дата2,День),
			|	(ТипСкидок = &ТипСкидок_Базовый)
			//|	(ТипСкидок = &ТипСкидок ИЛИ ТипСкидок = &ТипСкидок_Базовый)
			|	И Номенклатура В (&СписокПозиций)
			|	И Документ.Проведен
			|	И КОНЕЦПЕРИОДА(Документ.Дата2,День) >= &Дата2 и документ.Дата < &Дата2		
			|	) КАК ЦеныНоменклатурыСрезПоследних		
			|УПОРЯДОЧИТЬ ПО Документ.Дата Убыв,Уровень";
			
			Запрос.УстановитьПараметр("Дата2",			ТекДатаРасчета);
			Запрос.УстановитьПараметр("ТипСкидок",		ТипСкидок_Контрагент);
			//крохин начало
			//добавил базовый тип скидок, аналогично типу цен
			Запрос.УстановитьПараметр("ТипСкидок_Базовый",		ТипСкидок_Контрагент.Базовый);
			//крохин конец
			
			СписокПозиций=Новый Массив;
			
			Уровень=0;		
			ТекРодитель=Номенклатура;
			// Кухарь А.Ю. 13.10.2022 начало
			//+1 уровень иерархии
			//Пока Уровень<5 Цикл
			Пока Уровень<6 Цикл
				// Кухарь А.Ю. 13.10.2022 конец
				СписокПозиций.Добавить(ТекРодитель);		
				Запрос.УстановитьПараметр("Номенклатура"+Уровень,ТекРодитель);
				
				Уровень=Уровень+1;
				ТекРодитель=ТекРодитель.Родитель;	
			КонецЦикла;
			
			Запрос.УстановитьПараметр("СписокПозиций",	СписокПозиций);
			
			Результат=Запрос.Выполнить();
			
			Выборка=Результат.Выбрать();
			Пока Выборка.Следующий() Цикл			
				Возврат  Выборка.Скидка;
			КонецЦикла;
			
			
		Конецесли;
		//Нечаева 14,08,13 --------
		
		
		
	Иначе
		//крохин начало 05.02.2020
		//акции для оптового отдела
		
		Если ДатаРасчета=Неопределено Тогда
			ТекДатаРасчета=ТекущаяДата();			
		Иначе
			ТекДатаРасчета=ДатаРасчета;	
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	СкидкиНоменклатурыКонтрагентов.ТипЦен КАК ТипЦен,
		|	СкидкиНоменклатурыКонтрагентов.Номенклатура КАК Номенклатура,
		|	СкидкиНоменклатурыКонтрагентов.Документ КАК Документ,
		|	СкидкиНоменклатурыКонтрагентов.Скидка КАК Скидка,
		|	СкидкиНоменклатурыКонтрагентов.Контрагент КАК Контрагент
		|ИЗ
		|	РегистрСведений.СкидкиНоменклатурыКонтрагентов КАК СкидкиНоменклатурыКонтрагентов
		|ГДЕ
		|	СкидкиНоменклатурыКонтрагентов.Документ.Дата <= &Дата
		|	И СкидкиНоменклатурыКонтрагентов.Документ.Дата2 >= &Дата2
		|	И СкидкиНоменклатурыКонтрагентов.Номенклатура = &Номенклатура
		|	И СкидкиНоменклатурыКонтрагентов.Контрагент = &Контрагент
		|
		|УПОРЯДОЧИТЬ ПО
		|	СкидкиНоменклатурыКонтрагентов.Документ.Дата УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("Дата",ДатаРасчета);
		Запрос.УстановитьПараметр("Дата2",ДатаРасчета);
		запрос.УстановитьПараметр("Номенклатура",?(Номенклатура.Этогруппа,Номенклатура,Номенклатура.Родитель));
		запрос.УстановитьПараметр("Контрагент",ТипСкидок_Контрагент);
		Выборка = запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ТипЦенСкидок=Выборка.ТипЦен;
			//крохин начало 12.01.2021
			//для РНК нужен флаг "акция"
			
			
			//нечаева 13,07,22  - заготовка
			// проверим, что акция действительна для контрагента.
			//ДействуетАк = АкцияДействуетДляКонтрагента(Выборка.Документ,ТипСкидок_Контрагент); 
			//Если  ДействуетАк  тогда ,,,, выполняем
			
			
			
			Если ФиксироватьАкцию Тогда
				СтруктураСкидки = Новый Структура;
				СтруктураСкидки.Вставить("Скидка",Выборка.Скидка);
				СтруктураСкидки.Вставить("Акция",Истина);
				Возврат СтруктураСкидки;
			Иначе
				Возврат  Выборка.Скидка;
			КонецЕсли;
			//крохин конец 12.01.2021
		КонецЕсли;
		//крохин конец 05.02.2020
		Запрос=Новый Запрос;
		//Запрос.Текст="
		//|ВЫБРАТЬ ПЕРВЫЕ 1		
		//|	Скидка,ТипЦен,
		//|	ВЫБОР 
		//|		КОГДА Номенклатура	=&Номенклатура0 ТОГДА 0
		//|		КОГДА Номенклатура	=&Номенклатура1 ТОГДА 1
		//|		КОГДА Номенклатура	=&Номенклатура2 ТОГДА 2
		//|		КОГДА Номенклатура	=&Номенклатура3 ТОГДА 3
		//|		КОГДА Номенклатура	=&Номенклатура4 ТОГДА 4
		//// Кухарь А.Ю. 13.10.2022 начало
		////+1 уровень иерархии
		//|		КОГДА Номенклатура	=&Номенклатура5 ТОГДА 5 
		//// Кухарь А.Ю. 13.10.2022 конец
		//
		//|	ИНАЧЕ 100 
		//|	КОНЕЦ КАК Уровень
		//|ИЗ
		//|	Справочник.Контрагенты.Скидки
		//|ГДЕ
		//|	Ссылка = &Контрагент		
		//|	И Номенклатура В (&СписокПозиций)
		//|УПОРЯДОЧИТЬ ПО Уровень";
		
		// Шворобей ВЮ 05.03.2024 ++
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СкидкиКонтрагентов.Скидка КАК Скидка,
		|	СкидкиКонтрагентов.ТипЦен КАК ТипЦен,
		|	ВЫБОР
		|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура0
		|			ТОГДА 0
		|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура1
		|			ТОГДА 1
		|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура2
		|			ТОГДА 2
		|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура3
		|			ТОГДА 3
		|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура4
		|			ТОГДА 4
		|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура5
		|			ТОГДА 5
		|		ИНАЧЕ 100
		|	КОНЕЦ КАК Уровень
		|ИЗ
		|	РегистрСведений.СкидкиКонтрагентов КАК СкидкиКонтрагентов
		|ГДЕ
		|	СкидкиКонтрагентов.Номенклатура В(&СписокПозиций)
		|	И СкидкиКонтрагентов.Контрагент = &Контрагент
		|
		|УПОРЯДОЧИТЬ ПО
		|	Уровень";
		// Шворобей ВЮ 05.03.2024 ++
		
		Запрос.УстановитьПараметр("Контрагент", ?(ЗначениеЗаполнено(ТипСкидок_Контрагент.Ведущий), ТипСкидок_Контрагент.Ведущий, ТипСкидок_Контрагент));		
		
		СписокПозиций=Новый Массив;
		
		Уровень=0;		
		ТекРодитель=Номенклатура;
		// Кухарь А.Ю. 13.10.2022 начало
		//+1 уровень иерархии
		//Пока Уровень<5 Цикл
		Пока Уровень<6 Цикл
			// Кухарь А.Ю. 13.10.2022 конец
			СписокПозиций.Добавить(ТекРодитель);		
			Запрос.УстановитьПараметр("Номенклатура"+Уровень,ТекРодитель);
			
			Уровень=Уровень+1;
			ТекРодитель=ТекРодитель.Родитель;			
		КонецЦикла;
		
		Запрос.УстановитьПараметр("СписокПозиций",	СписокПозиций);
		
		Результат=Запрос.Выполнить();
		
		Выборка=Результат.Выбрать();
		Пока Выборка.Следующий() Цикл			
			ТипЦенСкидок=Выборка.ТипЦен;
			Возврат  Выборка.Скидка;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции // ПолучитьСкидкуНоменклатуры()


Функция ПолучитьНаценкуНоменклатуры(Номенклатура,ТипСкидок_Контрагент,ДатаРасчета=Неопределено,ТипЦенСкидок=Неопределено,МассивНоменклатуры=НЕОПРЕДЕЛЕНО,ВремТз=НЕОПРЕДЕЛЕНО) Экспорт
	
	Запрос=Новый Запрос;
	//Запрос.Текст="
	//|ВЫБРАТЬ ПЕРВЫЕ 1		
	//|	Наценка,ТипЦен,
	//|	ВЫБОР 
	//|		КОГДА Номенклатура	=&Номенклатура0 ТОГДА 0
	//|		КОГДА Номенклатура	=&Номенклатура1 ТОГДА 1
	//|		КОГДА Номенклатура	=&Номенклатура2 ТОГДА 2
	//|		КОГДА Номенклатура	=&Номенклатура3 ТОГДА 3
	//|		КОГДА Номенклатура	=&Номенклатура4 ТОГДА 4
	//// Кухарь А.Ю. 13.10.2022 начало
	////+1 уровень иерархии
	//|		КОГДА Номенклатура	=&Номенклатура5 ТОГДА 5 
	//// Кухарь А.Ю. 13.10.2022 конец
	//
	//|	ИНАЧЕ 100 
	//|	КОНЕЦ КАК Уровень
	//|ИЗ
	//|	Справочник.Контрагенты.Скидки
	//|ГДЕ
	//|	Ссылка = &Контрагент		
	//|	И Номенклатура В (&СписокПозиций)
	//|УПОРЯДОЧИТЬ ПО Уровень";
	
	// Шворобей ВЮ 05.03.2024 ++
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СкидкиКонтрагентов.Наценка КАК Наценка,
	|	СкидкиКонтрагентов.ТипЦен КАК ТипЦен,
	|	ВЫБОР
	|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура0
	|			ТОГДА 0
	|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура1
	|			ТОГДА 1
	|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура2
	|			ТОГДА 2
	|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура3
	|			ТОГДА 3
	|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура4
	|			ТОГДА 4
	|		КОГДА СкидкиКонтрагентов.Номенклатура = &Номенклатура5
	|			ТОГДА 5
	|		ИНАЧЕ 100
	|	КОНЕЦ КАК Уровень
	|ИЗ
	|	РегистрСведений.СкидкиКонтрагентов КАК СкидкиКонтрагентов
	|ГДЕ
	|	СкидкиКонтрагентов.Номенклатура В(&СписокПозиций)
	|	И СкидкиКонтрагентов.Контрагент = &Контрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Уровень";
	// Шворобей ВЮ 05.03.2024 ++
	
	Запрос.УстановитьПараметр("Контрагент", ?(ЗначениеЗаполнено(ТипСкидок_Контрагент.Ведущий), ТипСкидок_Контрагент.Ведущий, ТипСкидок_Контрагент));		
	
	СписокПозиций=Новый Массив;
	
	Уровень=0;		
	ТекРодитель=Номенклатура;
	// Кухарь А.Ю. 13.10.2022 начало
	//+1 уровень иерархии
	//Пока Уровень<5 Цикл
	Пока Уровень<6 Цикл
		// Кухарь А.Ю. 13.10.2022 конец
		СписокПозиций.Добавить(ТекРодитель);		
		Запрос.УстановитьПараметр("Номенклатура"+Уровень,ТекРодитель);
		
		Уровень=Уровень+1;
		ТекРодитель=ТекРодитель.Родитель;			
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СписокПозиций",	СписокПозиций);
	
	Результат=Запрос.Выполнить();
	
	Выборка=Результат.Выбрать();
	Пока Выборка.Следующий() Цикл			
		//		ТипЦенСкидок=Выборка.ТипЦен;
		Возврат  Выборка.Наценка;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции // ПолучитьСкидкуНоменклатуры()



//Мессерле Для группового получения цен номенклатуры (если не заданы 2 посл. параметр, то работает по прежнему алгоритма)
Функция ПолучитьЦенуНоменклатуры(Номенклатура,Единица=Неопределено,ТипЦен,ВалютаДокумента,КурсДокумента,ДатаРасчета=Неопределено,МассивНоменклатуры=НЕОПРЕДЕЛЕНО,ВремТз=НЕОПРЕДЕЛЕНО) Экспорт
	Если ТипЦен<>Неопределено И НЕ ТипЦен.Пустая() Тогда		
		Запрос=Новый Запрос;
		
		Если ДатаРасчета=Неопределено Тогда
			#Если Клиент Тогда		
				// нечаева 06,08,13 +++ было везде на конец дня
				//ТекДатаРасчета=КонецДня(РабочаяДата);
				ТекДатаРасчета=Текущаядата();  //РабочаяДата;
				
			#Иначе
				ТекДатаРасчета=КонецДня(ТекущаяДата());		
			#КонецЕсли		
		Иначе
			//ТекДатаРасчета=КонецДня(ДатаРасчета);	
			ТекДатаРасчета=ДатаРасчета;
		КонецЕсли;
		
		Если НЕ(ВремТз="" или ВремТз=НЕОПРЕДЕЛЕНО) тогда
			Стр=ВремТз.найти(номенклатура,"Номенклатура");
			Если Стр=Неопределено тогда    
				Стр=ВремТз.найти(номенклатура.родитель,"Номенклатура");
				Если Стр=Неопределено тогда
					Стр=ВремТз.найти(номенклатура.родитель.родитель,"Номенклатура");
					Если Стр=Неопределено тогда
						Возврат(0);
					иначе
						Возврат(стр.Цена);
					Конецесли;	  
					
					Возврат(0);
				иначе
					Возврат(стр.Цена);
				Конецесли;
				возврат(0);
			иначе
				Возврат(стр.Цена);
			Конецесли;
			
		Конецесли;
		
		Если МассивНоменклатуры<>Неопределено тогда //Передали что-то   
			колвмасс=МассивНоменклатуры.количество();
			для ном5=0 по КолВмасс-1 цикл                                                                     
				МассивНоменклатуры.Добавить(МассивНоменклатуры.получить(ном5).значение.родитель);  
			Конеццикла;	
			//нечаева 09,01,13 ++++ разбила на 2 запроса
			Если ВремТз="" тогда
				
				//по основному типу цен считаем
				запрос=новый запрос;
				Запрос.Текст="ВЫБРАТЬ
				|	ЦеныНоменклатурыСрезПоследних.Цена,
				|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
				|	ЦеныНоменклатурыСрезПоследних.Прайс.Дата КАК ПрайсДата
				|ИЗ
				|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
				|			КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|			ТипЦен = &ТипЦен
				|				И Номенклатура В (&СписокНоменклатуры)
				|				И Прайс.Проведен
				|				И КОНЕЦПЕРИОДА(Прайс.Дата2, ДЕНЬ) >= &Дата2
				|				И Прайс.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
				|			МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Прайс.Дата) КАК Дата
				|		ИЗ
				|			РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
				|					КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ),
				|					ТипЦен = &ТипЦен
				|						И Номенклатура В (&СписокНоменклатуры)
				|						И Прайс.Проведен
				|						И КОНЕЦПЕРИОДА(Прайс.Дата2, ДЕНЬ) >= &Дата2
				|						И Прайс.Дата < &Дата2) КАК ЦеныНоменклатурыСрезПоследних
				|		ГДЕ
				|			ЦеныНоменклатурыСрезПоследних.Номенклатура.ЭтоГруппа
				|		
				|		СГРУППИРОВАТЬ ПО
				|			ЦеныНоменклатурыСрезПоследних.Номенклатура) КАК Даты
				|		ПО ЦеныНоменклатурыСрезПоследних.Прайс.Дата = Даты.Дата
				|			И ЦеныНоменклатурыСрезПоследних.Номенклатура = Даты.Номенклатура
				|ГДЕ
				|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ЭтоГруппа
				//  |	И ЦеныНоменклатурыСрезПоследних.Цена <> -1
				|
				|УПОРЯДОЧИТЬ ПО
				|	ПрайсДата УБЫВ";
				
				// по базовому типу цен считаем
				запрос2=новый запрос;
				Запрос2.Текст="ВЫБРАТЬ
				|	ЦеныНоменклатурыСрезПоследних.Цена,
				|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
				|	ЦеныНоменклатурыСрезПоследних.Прайс.Дата КАК ПрайсДата
				|ИЗ
				|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
				|			КонецПериода(&Дата2,День),
				|			( ТипЦен = &ТипЦен_Базовый)
				|				И Номенклатура В (&СписокНоменклатуры)
				|				И Прайс.Проведен
				|				И КОНЕЦПЕРИОДА(Прайс.Дата2, ДЕНЬ) >= &Дата2 И Прайс.Дата < &Дата2 ) КАК ЦеныНоменклатурыСрезПоследних
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
				|			МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Прайс.Дата) КАК Дата
				|		ИЗ
				|			РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
				|					КонецПериода(&Дата2,День),
				|					( ТипЦен = &ТипЦен_Базовый)
				|						И Номенклатура В (&СписокНоменклатуры)
				|						И Прайс.Проведен
				|						И КОНЕЦПЕРИОДА(Прайс.Дата2, ДЕНЬ) >= &Дата2 И Прайс.Дата < &Дата2 ) КАК ЦеныНоменклатурыСрезПоследних
				|		ГДЕ
				|			ЦеныНоменклатурыСрезПоследних.Номенклатура.ЭтоГруппа
				|		
				|		СГРУППИРОВАТЬ ПО
				|			ЦеныНоменклатурыСрезПоследних.Номенклатура) КАК Даты
				|		ПО ЦеныНоменклатурыСрезПоследних.Прайс.Дата = Даты.Дата
				|			И ЦеныНоменклатурыСрезПоследних.Номенклатура = Даты.Номенклатура
				|ГДЕ
				|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ЭтоГруппа
				|
				|УПОРЯДОЧИТЬ ПО
				|	ПрайсДата УБЫВ";
				
				
				
				СписокНоменклатуры=новый СписокЗначений;
				
				для ном=0  по массивноменклатуры.количество()-1 цикл
					СписокНоменклатуры.Добавить(?(массивноменклатуры[ном].значение.ЭтоГруппа,массивноменклатуры[ном].значение,массивноменклатуры[ном].значение.Родитель));
				Конеццикла;
				// цены по текущему типу цен
				Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
				Запрос.УстановитьПараметр("Дата2",				ТекДатаРасчета);
				Запрос.УстановитьПараметр("ТипЦен",				ТипЦен);	
				//Запрос.УстановитьПараметр("ТипЦен_Базовый",		ТипЦен.Базовый);
				ВремТз=Запрос.Выполнить().Выгрузить();
				
				// цены по базовому типу цен
				Запрос2.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
				Запрос2.УстановитьПараметр("Дата2",				ТекДатаРасчета);
				//Запрос2.УстановитьПараметр("ТипЦен",				ТипЦен);	
				Запрос2.УстановитьПараметр("ТипЦен_Базовый",		ТипЦен.Базовый);
				ВремТз2=Запрос2.Выполнить().Выгрузить();
				
				// 12.09.2014 +++ нечаева
				// Ищем в 1 тз если есть, не переносим. если нет берем цену из тз2 (это по базовому прайсу).
				Для каждого Стр из ВремТз2 Цикл
					ТекНом=Стр.Номенклатура;
					
					СтрПоиск=ВремТз.найти(ТекНом,"Номенклатура");
					Если СтрПоиск=Неопределено или Стр.Цена=-1  тогда
						// нет цены по не базовой цене, перенесем по базовой.
						НовСтр=ВремТз.Добавить();
						НовСтр.Номенклатура= Стр.Номенклатура;
						НовСтр.Цена=Стр.Цена;
						НовСтр.Прайсдата=Стр.ПрайсДата;
					Конецесли;	
					
				КонецЦикла;
				//нечаева 09,01,13 ----
				// 12.09.2014 --- нечаева
				
				
			Конецесли;
			
			
			// 12.09.2014 +++ нечаева
			ПолученнаяЦена= 0;
			Если ЗначениеЗаполнено(Номенклатура) тогда
				Стр=ВремТз.найти(номенклатура,"Номенклатура");
				Если Стр=Неопределено тогда    
					Стр=ВремТз.найти(номенклатура.родитель,"Номенклатура");
					Если Стр=Неопределено тогда
						Стр=ВремТз.найти(номенклатура.родитель.родитель,"Номенклатура");
						// нечаева 09,01,13 +++  добавила тз2
						Если Стр=Неопределено тогда
							
							Стр=ВремТз2.найти(номенклатура.родитель.родитель,"Номенклатура");
							Если Стр=Неопределено тогда
								Возврат(0);
								
							иначе
								// цена по базовому прайс-листу
								Возврат(стр.Цена);
							Конецесли;	
							
						иначе
							// цена по локальному прайсу
							//Возврат(стр.Цена);
							полученнаяцена=стр.Цена;
							
						Конецесли;	  
						// нечаева 09,01,13 ---
						Возврат(0);
					иначе
						полученнаяцена=стр.Цена;
						
					Конецесли;
					возврат(0);
				иначе
					полученнаяцена=стр.Цена;
				Конецесли;
			Конецесли;
			Если ПолученнаяЦена=-1 Тогда
				Возврат(0);
			иначе
				Возврат(ПолученнаяЦена);
			КонецЕсли;	
			Возврат(0);
			
			// 12.09.2014 нечаева  -------
			
			
			//мессерле
		иначе
			//Нечаева 14,08,13++++
			
			// считаем по текущему типу цен
			//Запрос.Текст="
			//|ВЫБРАТЬ ПЕРВЫЕ 1	
			//|	Цена,
			//|	ВЫБОР 
			//|		КОГДА ТипЦен = &ТипЦен ТОГДА 0		
			//|	ИНАЧЕ 100 КОНЕЦ КАК Уровень
			//|ИЗ
			//|РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата2,
			//|	(ТипЦен = &ТипЦен)
			//|	И Номенклатура = &Номенклатура0
			//|	И Прайс.Проведен
			//|	И КОНЕЦПЕРИОДА(Прайс.Дата2,День) >= &Дата2	
			//|	) КАК ЦеныНоменклатурыСрезПоследних
			//|ГДЕ Номенклатура.ЭтоГруппа
			//|УПОРЯДОЧИТЬ ПО Уровень,Прайс.Дата Убыв";
			
			
			// сначала считаем цену по приоритетному типу цен - локальному , если нет то берем базовый.
			Запрос.Текст="
			|ВЫБРАТЬ ПЕРВЫЕ 1	
			|	Цена,
			|	ВЫБОР 
			|		КОГДА ТипЦен = &ТипЦен ТОГДА 0		
			|	ИНАЧЕ 100 КОНЕЦ КАК Уровень
			|ИЗ
			|РегистрСведений.ЦеныНоменклатуры.СрезПоследних(КонецПериода(&Дата2,День),
			|	(ТипЦен = &ТипЦен)
			|	И Номенклатура = &Номенклатура0
			|	И Прайс.Проведен
			|	И КОНЕЦПЕРИОДА(Прайс.Дата2,День) >= &Дата2 И Прайс.Дата < &Дата2
			|	) КАК ЦеныНоменклатурыСрезПоследних
			|ГДЕ Номенклатура.ЭтоГруппа
			|УПОРЯДОЧИТЬ ПО Уровень,Прайс.Дата Убыв";
			
			
			
			
			Запрос.УстановитьПараметр("Дата2",				ТекДатаРасчета);
			Запрос.УстановитьПараметр("ТипЦен",				ТипЦен);	
			Запрос.УстановитьПараметр("ТипЦен_Базовый",		ТипЦен.Базовый);		
			
			// Кухарь А.Ю.  06.03.2026 начало
			//Запрос.УстановитьПараметр("Номенклатура0",	?(Номенклатура.ЭтоГруппа,Номенклатура,Номенклатура.Родитель));      
			РеквизитыНоменклатуры = ПолучитьРеквизитыШапки(Номенклатура,"ЭтоГруппа,Родитель","Справочник");
			Запрос.УстановитьПараметр("Номенклатура0",	?(РеквизитыНоменклатуры.ЭтоГруппа,Номенклатура,РеквизитыНоменклатуры.Родитель));
			// Кухарь А.Ю.  06.03.2026 конец
			
						
			Результат=Запрос.Выполнить();
			//крохин начало 22.09.2011
			//единицу не используем больше
			//Коэффициент=?(Единица=Неопределено,1,Единица.Коэффициент);
			Коэффициент = 1;
			//крохин конец 22.09.2011;
			Выборка=Результат.Выбрать();
			
			
			
			Пока Выборка.Следующий() Цикл			
				//нечаева 08,09,2014 +++
				Если Выборка.цена<>-1 Тогда
					Возврат  глПересчет(Выборка.Цена*Коэффициент,ТипЦен.Валюта,ТекДатаРасчета,ВалютаДокумента,КурсДокумента);
				иначе 
					// тогда берем цену по базовому прайс-листу. сделано для франчей - сброс цен
					прервать;
				КонецЕсли;
				//нечаева 08,09,2014 ----
			КонецЦикла;	
			
			
			// смотрим базовый тип цен
			Запрос.Текст="
			|ВЫБРАТЬ ПЕРВЫЕ 1	
			|	Цена,
			|	ВЫБОР 
			|		КОГДА ТипЦен = &ТипЦен ТОГДА 0		
			|	ИНАЧЕ 100 КОНЕЦ КАК Уровень
			|ИЗ
			|РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата2,
			|	(ТипЦен=&ТипЦен_Базовый)
			|	И Номенклатура = &Номенклатура0
			|	И Прайс.Проведен
			|	И КОНЕЦПЕРИОДА(Прайс.Дата2,День) >= &Дата2	И Прайс.Дата < &Дата2
			|	) КАК ЦеныНоменклатурыСрезПоследних
			|ГДЕ Номенклатура.ЭтоГруппа
			|УПОРЯДОЧИТЬ ПО Уровень,Прайс.Дата Убыв";
			
			Запрос.УстановитьПараметр("Дата2",				ТекДатаРасчета);
			Запрос.УстановитьПараметр("ТипЦен",				ТипЦен);	
			Запрос.УстановитьПараметр("ТипЦен_Базовый",		ТипЦен.Базовый);		
			
			Запрос.УстановитьПараметр("Номенклатура0",	?(Номенклатура.ЭтоГруппа,Номенклатура,Номенклатура.Родитель));
			
			Результат=Запрос.Выполнить();
			//крохин начало 22.09.2011
			//единицу не используем больше
			//Коэффициент=?(Единица=Неопределено,1,Единица.Коэффициент);
			Коэффициент = 1;
			//крохин конец 22.09.2011;
			Выборка=Результат.Выбрать();
			Пока Выборка.Следующий() Цикл			
				Возврат  глПересчет(Выборка.Цена*Коэффициент,ТипЦен.Валюта,ТекДатаРасчета,ВалютаДокумента,КурсДокумента);
			КонецЦикла;	
			
			
			
			//Нечаева 14,08,13 ------
		КонецЕсли;
	//////////////////////////////////////////////////////////////////////////////////////////	
		Возврат 0;
	Иначе
		Возврат 0;
	Конецесли;
	//////////////////////////////////////////////////////////////////////////////////////////
КонецФункции

//Мессерле Для группового получения свойств номенклатуры (Номенклатура- первый параметр:можно задавать как элемент, так и группу (модель))
Функция ПолучитьСвойстваНоменклатуры(Номенклатура,МассивНоменклатуры=НЕОПРЕДЕЛЕНО,ВремТз=Неопределено)  Экспорт
	
	Свойства=Новый Структура;
	
	Если НЕ(ВремТз="" или ВремТз=НЕОПРЕДЕЛЕНО) тогда
		
		Стр=ВремТз.найти(номенклатура,"Номенклатура");
		Если Стр<>Неопределено тогда
			Если  стр.свойства<>Неопределено тогда
				Возврат(стр.свойства);
			Конецесли;
		Конецесли;
		
		Стр=ВремТз.найти(номенклатура,"Модель");
		Если Стр<>Неопределено тогда
			Если  стр.свойства<>Неопределено тогда  
				Возврат(стр.свойства);
			Конецесли;
		Конецесли;
		
		
		Если Стр=Неопределено тогда
			Возврат(свойства);
		Конецесли;
		
	Конецесли;
	
	
	если МассивНоменклатуры<>Неопределено тогда //Передали что-то
		
		Если ВремТз="" тогда
			
			
			Запрос=Новый Запрос;
			
			Запрос.Текст="ВЫБРАТЬ
			|	аа.Свойство,
			|	аа.Значение,
			|	аа.Уровень КАК Уровень,
			|	аа.номенклатура,
			|	аа.Модель
			|ИЗ
			|	(ВЫБРАТЬ
			|		ЗначенияСвойствОбъектов.Свойство КАК Свойство,
			|		ЗначенияСвойствОбъектов.Значение КАК Значение,
			|		0 КАК Уровень,
			|		Номенклатура.Ссылка КАК номенклатура,
			|		Номенклатура.Родитель КАК Модель
			|	ИЗ
			|		Справочник.Номенклатура КАК Номенклатура
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
			|			ПО Номенклатура.Ссылка = ЗначенияСвойствОбъектов.Объект
			|	ГДЕ
			|		Номенклатура.Ссылка В(&СписокНоменклатуры)
			|		И Номенклатура.ЭтоГруппа = ЛОЖЬ
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ЗначенияСвойствОбъектов.Свойство,
			|		ЗначенияСвойствОбъектов.Значение,
			|		1,
			|		Номенклатура.Ссылка,
			|		Номенклатура.Родитель
			|	ИЗ
			|		Справочник.Номенклатура КАК Номенклатура
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
			|			ПО Номенклатура.Родитель = ЗначенияСвойствОбъектов.Объект
			|	ГДЕ
			|		Номенклатура.Ссылка В(&СписокНоменклатуры)
			|		И Номенклатура.ЭтоГруппа = ЛОЖЬ
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ЗначенияСвойствОбъектов.Свойство,
			|		ЗначенияСвойствОбъектов.Значение,
			|		2,
			|		Номенклатура.Ссылка,
			|		Номенклатура.Родитель
			|	ИЗ
			|		Справочник.Номенклатура КАК Номенклатура
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
			|			ПО Номенклатура.Родитель.Родитель = ЗначенияСвойствОбъектов.Объект
			|	ГДЕ
			|		Номенклатура.Ссылка В(&СписокНоменклатуры)
			|		И Номенклатура.ЭтоГруппа = ЛОЖЬ) КАК аа
			|ГДЕ
			|	(НЕ аа.Значение ЕСТЬ NULL )
			|
			|УПОРЯДОЧИТЬ ПО
			|	номенклатура,Уровень";	
			
			Свойства=Новый Структура;
			
			Запрос.УстановитьПараметр("СписокНоменклатуры",МассивНоменклатуры);
			
			ВремТз=Запрос.Выполнить().Выгрузить();
			ВремТз.Колонки.Добавить("Свойства");
			ВремТз.Индексы.Добавить("Номенклатура");
			ВремТз.Индексы.Добавить("Модель");
			
			старном="";
			Для каждого стр из ВремТз цикл
				Попытка
					Если старНом<>Стр.номенклатура тогда
						Свойства=Новый Структура;
					Конецесли;
					СтарНом=Стр.номенклатура;
					КодСвойства=СтрЗаменить(стр.Свойство,"""","");	
					КодСвойства=СтрЗаменить(стр.Свойство," ","");
					
					//крохин начало 01.03.2012
					//Свойства.Вставить(КодСвойства,стр.Значение);
					Если стр.Свойство <> Null Тогда
						Свойства.Вставить(КодСвойства,стр.Значение);
					КонецЕсли;
					//крохин конец 01.03.2012
					стр.свойства=Свойства;
					
				Исключение
					//Сообщить("Ошибочное свойство: "+стр.Свойство);
				КонецПопытки;		
			КонецЦикла;	
			
			Стр=ВремТз.найти(номенклатура,"Номенклатура");
			Если Стр=Неопределено тогда
				
				Стр=ВремТз.найти(номенклатура,"Модель");
				Если Стр<>Неопределено тогда
					Возврат(стр.Свойства);
				Конецесли;
				
				Возврат(Свойства);
				
			иначе
				Возврат(стр.Свойство);
			Конецесли;
			
		Конецесли; //ВремТз пустая
		
		//мессерле
		
	иначе
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЗначенияСвойствОбъектов.Объект = &Брэнд
		|			ТОГДА 1
		|		КОГДА ЗначенияСвойствОбъектов.Объект = &Модель
		|			ТОГДА 2
		|		КОГДА ЗначенияСвойствОбъектов.Объект = &Номенклатура
		|			ТОГДА 3
		|		ИНАЧЕ 4
		|	КОНЕЦ КАК Уровень,
		|	ЗначенияСвойствОбъектов.Свойство,
		|	ЗначенияСвойствОбъектов.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	(ЗначенияСвойствОбъектов.Объект = &Модель
		|			ИЛИ ЗначенияСвойствОбъектов.Объект = &Брэнд
		|			ИЛИ ЗначенияСвойствОбъектов.Объект = &Номенклатура)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Уровень,
		|	ЗначенияСвойствОбъектов.Объект";	
		
		Свойства=Новый Структура;
		
		Запрос.УстановитьПараметр("Модель",Номенклатура.Родитель);
		Запрос.УстановитьПараметр("Брэнд",Номенклатура.Родитель.родитель);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		
		Выборка=Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Попытка
				КодСвойства=СтрЗаменить(Выборка.Свойство,"""","");	
				КодСвойства=СтрЗаменить(Выборка.Свойство," ","");
				
				Свойства.Вставить(КодСвойства,Выборка.Значение);		
			Исключение
				//крохин начало 26.02.2013
				//мешает сообщение
				//Сообщить("Ошибочное свойство: "+Выборка.Свойство);
				//крохин конец 26.02.2013
			КонецПопытки;		
		КонецЦикла;	
		
		Возврат Свойства;
	Конецесли;
КонецФункции //ПолучитьСвойстваНоменклатуры(Номенклатура) 


// <Описание функции>
//
// Параметры
//  <Параметр1>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   – <описание возвращаемого значения>
//
Функция ПолучитьЦенуНоменклатуры_Старая(Номенклатура,Единица=Неопределено,ТипЦен,ВалютаДокумента,КурсДокумента,ДатаРасчета=Неопределено) Экспорт
	Запрос=Новый Запрос;
	
	Если ДатаРасчета=Неопределено Тогда
		#Если Клиент Тогда		
			ТекДатаРасчета=КонецДня(РабочаяДата);
		#Иначе
			ТекДатаРасчета=КонецДня(ТекущаяДата());		
		#КонецЕсли		
	Иначе
		ТекДатаРасчета=КонецДня(ДатаРасчета);	
	КонецЕсли;
	
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1		
	|	Прайс.Цена,	
	|	ВЫБОР 
	|		КОГДА СпрНом.Ссылка 							= Прайс.Номенклатура ТОГДА 1 
	|		КОГДА СпрНом.Ссылка.Родитель					= Прайс.Номенклатура ТОГДА 2 
	//|		КОГДА СпрНом.Ссылка.Родитель.Родитель			= Прайс.Номенклатура ТОГДА 3 
	//|		КОГДА СпрНом.Ссылка.Родитель.Родитель.Родитель	= Прайс.Номенклатура ТОГДА 4
	|	ИНАЧЕ NULL
	|	КОНЕЦ*10000000000+РАЗНОСТЬДАТ(Прайс.Ссылка.Дата,&Дата2,Секунда) КАК Уровень
	|ИЗ
	|	Документ.ПрайсЛист.Товары КАК Прайс
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНом
	|ПО (
	|	СпрНом.Ссылка 								= Прайс.Номенклатура ИЛИ 
	|	СпрНом.Ссылка.Родитель						= Прайс.Номенклатура 
	//ИЛИ
	//|	СпрНом.Ссылка.Родитель.Родитель				= Прайс.Номенклатура ИЛИ
	//|	СпрНом.Ссылка.Родитель.Родитель.Родитель	= Прайс.Номенклатура 
	|	)
	|ГДЕ 
	|	Прайс.Ссылка.Проведен
	|	И Прайс.Ссылка.ТипЦен	= &ТипЦен
	|	И НАЧАЛОПЕРИОДА(Прайс.Ссылка.Дата,День)<= &Дата2
	|	И КОНЕЦПЕРИОДА(Прайс.Ссылка.Дата2,День)>= &Дата2
	|	И СпрНом.Ссылка 	= &Номенклатура";
	
	Если НЕ Номенклатура.ЭтоГруппа Тогда
		Запрос.Текст=Запрос.Текст+"						
		|	И СпрНом.ЭтоГруппа 	= Ложь";	
	КонецЕсли; 
	
	Запрос.Текст=Запрос.Текст+"
	|УПОРЯДОЧИТЬ ПО Уровень";
	
	Запрос.УстановитьПараметр("Дата2",			ТекДатаРасчета);
	Запрос.УстановитьПараметр("ТипЦен",			ТипЦен);
	Запрос.УстановитьПараметр("Номенклатура",	Номенклатура);
	
	Результат=Запрос.Выполнить();
	
	//крохин начало 22.09.2011
	//единицу не используем больше
	//Коэффициент=?(Единица=Неопределено,1,Единица.Коэффициент);
	Коэффициент = 1;
	//крохин конец 22.09.2011;
	
	
	Выборка=Результат.Выбрать();
	Пока Выборка.Следующий() Цикл			
		Возврат  глПересчет(Выборка.Цена*Коэффициент,ТипЦен.Валюта,ТекДатаРасчета,ВалютаДокумента,КурсДокумента);
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции // ПолучитьЦенуНоменклатуры()

// Шворобей ВЮ 09.01.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2457
Функция ПроцентНДСпоСтавке(Ставка) Экспорт
	Если Ставка = Перечисления.СтавкиНДС.НДС5 Тогда
		Возврат 0.05;
	ИначеЕсли Ставка = Перечисления.СтавкиНДС.НДС7 Тогда
		Возврат 0.07;
	ИначеЕсли Ставка=Перечисления.СтавкиНДС.НДС20 Тогда
		Возврат 0.20;   
	// нечаева 26.12.25 https://yougile.collant.ru/team/ab6bad3a05c0/#SNL-95 
	ИначеЕсли Ставка=Перечисления.СтавкиНДС.НДС22 Тогда
		Возврат 0.22;
	// нечаева 26.12.25 https://yougile.collant.ru/team/ab6bad3a05c0/#SNL-95
	
	ИначеЕсли Ставка=Перечисления.СтавкиНДС.НДС18 Тогда
		Возврат 0.18;
	ИначеЕсли Ставка=Перечисления.СтавкиНДС.НДС10 Тогда		
		Возврат 0.1;	
	Иначе
		Возврат 0.0;			
	КонецЕсли;
КонецФункции                 


// Кухарь А.Ю.  24.03.2026 начало
Функция СтавкаНДСПоПроценту (Процент) Экспорт
	
	если ТипЗнч(Процент) = Тип("Число") и Процент>0 и Процент<1 тогда    
		Процент = 100*Процент; 
	ИначеЕсли ТипЗнч(Процент) = Тип("Строка") тогда  
		Процент = ВРег(Процент);
		Процент = СтрЗаменить(Процент," ","");
		Процент = СтрЗаменить(Процент,"%","");
		
		если СтрНайти(Процент,"БЕЗ") > 0 и СтрНайти(Процент,"НДС")> 0 тогда 
			возврат Перечисления.СтавкиНДС.БезНДС;  
		иначе       
			попытка
				Процент = Число(Процент);
			исключение
				возврат Неопределено;
			КонецПопытки;
		КонецЕсли;   		
	КонецЕсли;   
	
	 
	 
	
	Если Процент = 0 Тогда
		Возврат Перечисления.СтавкиНДС.НДС0;
	ИначеЕсли Процент = 10 Тогда
		Возврат Перечисления.СтавкиНДС.НДС10;

	ИначеЕсли Процент = 18 Тогда
		Возврат Перечисления.СтавкиНДС.НДС18;  
			ИначеЕсли Процент = 20 Тогда
		Возврат Перечисления.СтавкиНДС.НДС20;   
	ИначеЕсли Процент = 22 Тогда
		Возврат Перечисления.СтавкиНДС.НДС22;   
	ИначеЕсли Процент = 5 Тогда
		Возврат Перечисления.СтавкиНДС.НДС5;   
	ИначеЕсли Процент = 7 Тогда
		Возврат Перечисления.СтавкиНДС.НДС7;  
	иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции        
// Кухарь А.Ю.  24.03.2026 конец


Процедура ОткрытьПодборМарок(Форма) Экспорт
	СтрокаТЧ=Форма.ЭлементыФормы.Товары.ТекущаяСтрока;
	
	ФормаПодбора=ПолучитьОбщуюФорму("ПодборПартий",Форма);	
	ФормаПодбора.Документ		=Форма.Ссылка;
	
	Если Форма.Ссылка.Метаданные().ТабличныеЧасти.Товары.Реквизиты.Найти("Склад")<>Неопределено Тогда
		ФормаПодбора.Склад			=СтрокаТЧ.Склад;
	ИначеЕсли Форма.Ссылка.Метаданные().Реквизиты.Найти("Склад")<>Неопределено Тогда
		ФормаПодбора.Склад			=Форма.Склад;		
	ИначеЕсли Форма.Ссылка.Метаданные().Реквизиты.Найти("СкладОтправитель")<>Неопределено Тогда
		ФормаПодбора.Склад			=Форма.СкладОтправитель;
	Иначе
		Сообщить("Ошибка определения склада источника !",СтатусСообщения.Важное);
	КонецЕсли; 	
	
	ФормаПодбора.Номенклатура	=СтрокаТЧ.Номенклатура;
	
	Попытка
		ФормаПодбора.Количество		=СтрокаТЧ.Заказ;
	Исключение
		ФормаПодбора.Количество		=СтрокаТЧ.Количество;		
	Конецпопытки;
	
	ФормаПодбора.Открыть();
КонецПроцедуры

Процедура ОткрытьПодборКредДокументов(Форма,Элемент,Контрагент,Договор) Экспорт	
	
	ФормаПодбора=ПолучитьОбщуюФорму("ПодборКредДокументов",Элемент);	
	ФормаПодбора.Документ	=Форма.Ссылка;
	
	ФормаПодбора.Контрагент	=Контрагент;
	ФормаПодбора.Договор	=Договор;
	
	ФормаПодбора.Открыть();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБРАБОТКИ ТАБЛИЧНОЙ ЧАСТИ ТОРГОВЫХ ДОКУМЕНТОВ
 
// Кухарь А.Ю.  06.03.2026 начало
//Процедура ЗаполнитьЦенуНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект) Экспорт 
Процедура ЗаполнитьЦенуНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект,ДопПараметры = Неопределено) Экспорт 
	
	ОтключитьРасчетСкидок = ложь;  
	ПредопределеннаяЦена = 0;
	если ТипЗнч(ДопПараметры) = Тип("Структура") тогда 
		если ДопПараметры.Свойство("ОтключитьРасчетСкидок") тогда
			ОтключитьРасчетСкидок = ДопПараметры.ОтключитьРасчетСкидок;
		КонецЕсли;   
		
		если ДопПараметры.Свойство("ПредопределеннаяЦена") тогда
			ПредопределеннаяЦена = ДопПараметры.ПредопределеннаяЦена;
		КонецЕсли;   		
	КонецЕсли;
// Кухарь А.Ю.  06.03.2026 конец

	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	// Кухарь А.Ю.  24.05.2023 начало
	ИмяДокумента=МетаданныеДокумента.Имя; 
	// Кухарь А.Ю.  24.05.2023 конец
	
	
	//Если ДокументОбъект.метаданные().Имя = "КорректировкаЦенВНакладной" Тогда
	//	ИмяРеквизитаЦены=?(ЕстьРеквизитТабЧастиДокумента("ЦенаФактБезСкидки",ДокументОбъект.Метаданные(),ИмяТЧ),"ЦенаФактБезСкидки","ЦенаФакт");
	//КонецЕсли;
	
	
	Если НЕ ЕстьРеквизитДокумента("ТипЦен",МетаданныеДокумента) Тогда Возврат КонецЕсли; 
	//Кухарь 13.03.18 начало
	//оптимизация
	//Если СтрокаТабличнойЧасти=Неопределено ИЛИ СтрокаТабличнойЧасти.Номенклатура.Пустая() ИЛИ СтрокаТабличнойЧасти.Номенклатура.ВидНоменклатуры=Перечисления.ВидыНоменклаутры.ПодарочныйСертификат Тогда Возврат КонецЕсли; 
	Если СтрокаТабличнойЧасти=Неопределено ИЛИ СтрокаТабличнойЧасти.Номенклатура.Пустая() Тогда Возврат КонецЕсли;
	//Кухарь 13.03.18 конец 
	
	ИмяТабличнойЧасти	= ПолучитьИмяТабличнойЧастиПоСсылкеНаСтроку(СтрокаТабличнойЧасти);	
	ИмяРеквизитыЦены	= ?(ЕстьРеквизитТабЧастиДокумента("ЦенаБезСкидки",МетаданныеДокумента,ИмяТабличнойЧасти),"ЦенаБезСкидки","Цена");
	// нечаева 28,05,15++
	Если ДокументОбъект.метаданные().Имя = "КорректировкаЦенВНакладной" Тогда
		ИмяРеквизитыЦены=?(ЕстьРеквизитТабЧастиДокумента("ЦенаФактБезСкидки",МетаданныеДокумента,ИмяТабличнойЧасти),"ЦенаФактБезСкидки","ЦенаФакт");
	КонецЕсли;
	// нечаева 28,05,15--
	
	ТекТипЦен			= ДокументОбъект.ТипЦен;
	Цена				= 0;
	Распродажа			= Ложь;
	
	Если ЕстьРеквизитДокумента("ТипЦенРаспродажа",МетаданныеДокумента) И ЗначениеЗаполнено(ДокументОбъект.ТипЦенРаспродажа) Тогда		 
		Цена=ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,СтрокаТабличнойЧасти.Единица,ДокументОбъект.ТипЦенРаспродажа,ДокументОбъект.Валюта,ДокументОбъект.Курс,ДокументОбъект.Дата);			
		Если ЗначениеЗаполнено(Цена) Тогда
			ТекТипЦен							= ДокументОбъект.ТипЦенРаспродажа;				
			
			СтрокаТабличнойЧасти.ЦенаБезСкидки	= Цена;				
			Распродажа							= Истина;
		КонецЕсли; 
	КонецЕсли;
	
	//Если ЕстьРеквизитТабЧастиДокумента("Скидка", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда		
	//	Если Распродажа Тогда
	//		СтрокаТабличнойЧасти.Скидка			= -1;
	//	Иначе			
	//		Если ЕстьРеквизитДокумента("Контрагент",МетаданныеДокумента) И ЗначениеЗаполнено(ДокументОбъект.Контрагент) И ДокументОбъект.Контрагент.Скидки.Количество()>0 Тогда	
	//			// Контрагент типа "Оптовик" 
	//			СтрокаТабличнойЧасти.Скидка=ПолучитьСкидкуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,ДокументОбъект.Контрагент,ДокументОбъект.Дата,ТекТипЦен);	
	//		Иначе
	//			Если ЕстьРеквизитДокумента("ТипСкидок",МетаданныеДокумента) Тогда
	//				СтрокаТабличнойЧасти.Скидка=ПолучитьСкидкуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,ДокументОбъект.ТипСкидок,ДокументОбъект.Дата);			
	//			КонецЕсли;	
	//			//крохин начало
	//			//для чеков. Если скидка ТЧ меньше скидки документа, используется скидка документа
	//			Если ДокументОбъект.Метаданные().Имя = "Чек" Тогда
	//			СтрокаТабличнойЧасти.Скидка = Макс(СтрокаТабличнойЧасти.Скидка,ДокументОбъект.Скидка);	
	//			//8 марта
	//			Если ДокументОбъект.Акция.СкидкаПоПризнаку <> 0 И СтрокаТабличнойЧасти.Скидка <> -1 Тогда
	//				Если ПолучитьРеквизитРодителя(СтрокаТабличнойЧасти.Номенклатура,"ПоловозрастнойПризнак") <> Справочники.ПоловозрастныеПризнакиНоменклатуры.Муж И
	//					ПолучитьРеквизитРодителя(СтрокаТабличнойЧасти.Номенклатура,"ПоловозрастнойПризнак") <> Справочники.ПоловозрастныеПризнакиНоменклатуры.Дет И
	//					ПолучитьРеквизитРодителя(СтрокаТабличнойЧасти.Номенклатура,"ПоловозрастнойПризнак") <> Справочники.ПоловозрастныеПризнакиНоменклатуры.ПустаяСсылка() И
	//					ПолучитьРеквизитРодителя(СтрокаТабличнойЧасти.Номенклатура,"ПоловозрастнойПризнак") <> Неопределено Тогда
	//					СтрокаТабличнойЧасти.Акция = ДокументОбъект.Акция;
	//					СтрокаТабличнойЧасти.Скидка = Макс(ДокументОбъект.Скидка + ДокументОбъект.Акция.СкидкаПоПризнаку,СтрокаТабличнойЧасти.Скидка);
	//					СтрокаТабличнойЧасти.НеПересчитывать = Истина;
	//					Конецесли;	
	//			КонецЕсли;
	//			
	//		Конецесли;
	//			//крохин конец
	//		КонецЕсли;
	//		
	//		Если ЕстьРеквизитДокумента("Договор",МетаданныеДокумента) И ЗначениеЗаполнено(ДокументОбъект.Договор) И ДокументОбъект.Договор.ДопСкидка<>0 Тогда
	//			СтрокаТабличнойЧасти.Скидка=СтрокаТабличнойЧасти.Скидка+ДокументОбъект.Договор.ДопСкидка;
	//			Если СтрокаТабличнойЧасти.Скидка=-1 Тогда				
	//				СтрокаТабличнойЧасти.Скидка=0;									
	//			КонецЕсли;	
	//		КонецЕсли; 
	//	КонецЕсли;		
	//Иначе
	//	ТекТипЦен	= ДокументОбъект.ТипЦен;			
	//КонецЕсли;	
	
	
	//нечаева 29,05,15++ Для КЦН
	Контрагент= Неопределено;
	Если ЕстьРеквизитДокумента("Контрагент",ДокументОбъект.Метаданные()) ТОгда
		Контрагент = ДокументОбъект.Контрагент;
	КонецЕсли;	
	Если ЕстьРеквизитДокумента("Корреспондент",ДокументОбъект.Метаданные())  ТОгда
		Если  ДокументОбъект.Корреспондент.Метаданные().Имя = "Контрагенты"  Тогда
			Контрагент = ДокументОбъект.Корреспондент;
		КонецЕсли;
	КонецЕсли;	
	//нечаева 29,05,15---
	
	
	
	
	
	// нечаева +++ для инет магазина изменения
	Если МетаданныеДокумента.Имя<>"ПродажаИМ" Тогда	
		
		Если ЕстьРеквизитТабЧастиДокумента("Скидка", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
			
			Если Распродажа Тогда
				СтрокаТабличнойЧасти.Скидка			= -1;
			Иначе			
				// Кухарь А.Ю.  06.03.2026 начало
				// Пустая задача
				если не ОтключитьРасчетСкидок тогда 
					// Кухарь А.Ю.  06.03.2026 конец
					
					Если  ЗначениеЗаполнено(Контрагент) И ОбщегоНазначения_ПИ.ПроверитьНаличиеСкидокУКонтрагента(Контрагент) Тогда 
						
						Если ДокументОбъект.Метаданные().Имя = "РасходнаяНакладная" Тогда
							Если Метаданные.НайтиПоТипу(ТипЗнч(СтрокаТабличнойЧасти)).Имя = "Товары" Тогда
								СтруктураСкидки = ПолучитьСкидкуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,Контрагент,ДокументОбъект.Дата,ТекТипЦен,Неопределено,Неопределено,Истина);
								Если СтруктураСкидки = Неопределено ИЛИ ТипЗнч(СтруктураСкидки) = ТипЗнч(0) Тогда
									СтрокаТабличнойЧасти.скидка = СтруктураСкидки;
									СтрокаТабличнойЧасти.Акция=Ложь;
								Иначе
									СтрокаТабличнойЧасти.Скидка=СтруктураСкидки.Скидка;
									СтрокаТабличнойЧасти.Акция=СтруктураСкидки.Акция;
								КонецЕсли;
							КонецЕсли;
						Иначе
							СтрокаТабличнойЧасти.Скидка=ПолучитьСкидкуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,Контрагент,ДокументОбъект.Дата,ТекТипЦен);
						КонецЕсли;
						//крохин конец 12.01.2021
						Наценка = ПолучитьНаценкуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,Контрагент,ДокументОбъект.Дата,ТекТипЦен); // нечаева 29,05,15++
						Если Наценка <> Неопределено И Наценка <> 0 Тогда
							Скидка = СтрокаТабличнойЧасти.Скидка;
							СтрокаТабличнойЧасти.Скидка = Скидка -Наценка + Скидка*Наценка/100;
						КонецЕсли;
						
						//нечаева 09,06,15+++
						// для оптовых клиентов увеличиваем на тип скидок
						Если ЕстьРеквизитДокумента("ТипСкидок",МетаданныеДокумента) Тогда
							Если НЕ ДокументОбъект.ТипСкидок.пустая() Тогда
								
								ДопСкидкаОпт = ПолучитьСкидкуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,ДокументОбъект.ТипСкидок,ДокументОбъект.Дата,); 
								Если ДопСкидкаОпт = Неопределено Тогда ДопСкидкаОпт = 0; КонецЕсли;
								
								СтрокаТабличнойЧасти.Скидка = СтрокаТабличнойЧасти.Скидка+ДопСкидкаОпт;
								
							КонецЕсли; 
						КонецЕсли;
						//нечаева 09,06,15---
						
						
						
					Иначе
						Если ЕстьРеквизитДокумента("ТипСкидок",МетаданныеДокумента) Тогда
							СтрокаТабличнойЧасти.Скидка=ПолучитьСкидкуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,ДокументОбъект.ТипСкидок,ДокументОбъект.Дата);			
						КонецЕсли;	
						//крохин начало
						//для чеков. Если скидка ТЧ меньше скидки документа, используется скидка документа
						Если ДокументОбъект.Метаданные().Имя = "Чек" Тогда
							СтрокаТабличнойЧасти.Скидка = Макс(СтрокаТабличнойЧасти.Скидка,ДокументОбъект.Скидка);	
							//8 марта
							Если ДокументОбъект.Акция.СкидкаПоПризнаку <> 0 И СтрокаТабличнойЧасти.Скидка <> -1 Тогда
								
								//нечаева 01,03,16+++
								Если ПолучитьРеквизитРодителя(СтрокаТабличнойЧасти.Номенклатура,"ПоловозрастнойПризнак") = ДокументОбъект.Акция.ПоловозрастнойПризнак и
									//нечаева 01,03,16---	
									ПолучитьРеквизитРодителя(СтрокаТабличнойЧасти.Номенклатура,"ПоловозрастнойПризнак") <> Справочники.ПоловозрастныеПризнакиНоменклатуры.ПустаяСсылка() И
									ПолучитьРеквизитРодителя(СтрокаТабличнойЧасти.Номенклатура,"ПоловозрастнойПризнак") <> Неопределено Тогда
									СтрокаТабличнойЧасти.Акция = ДокументОбъект.Акция;
									СтрокаТабличнойЧасти.Скидка = Макс(ДокументОбъект.Скидка + ДокументОбъект.Акция.СкидкаПоПризнаку,СтрокаТабличнойЧасти.Скидка);
									СтрокаТабличнойЧасти.НеПересчитывать = Истина;
								Конецесли;	
							КонецЕсли;
							
						Конецесли;
						//крохин конец
					КонецЕсли;
					
					Если ЕстьРеквизитДокумента("Договор",МетаданныеДокумента) И ЗначениеЗаполнено(ДокументОбъект.Договор) И ДокументОбъект.Договор.ДопСкидка<>0 Тогда
						СтрокаТабличнойЧасти.Скидка=СтрокаТабличнойЧасти.Скидка+ДокументОбъект.Договор.ДопСкидка;
						Если СтрокаТабличнойЧасти.Скидка=-1 Тогда				
							СтрокаТабличнойЧасти.Скидка=0;									
						КонецЕсли;	
					КонецЕсли; 
				КонецЕсли;	
				
				// Кухарь А.Ю.  06.03.2026 начало
				// Пустая задача
			КонецЕсли; 
			// Кухарь А.Ю.  06.03.2026 конец
			
		Иначе			
			//кухарь 04.12.14 начало
			//для ЗПС
			Если ЕстьРеквизитТабЧастиДокумента("Скидка1", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда	 
				Если ЕстьРеквизитДокумента("Контрагент",МетаданныеДокумента) И ЗначениеЗаполнено(ДокументОбъект.Контрагент) И ДокументОбъект.Контрагент.Скидки.Количество()>0 Тогда	
					СтрокаТабличнойЧасти.Скидка1=ПолучитьСкидкуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,ДокументОбъект.Контрагент,ДокументОбъект.Дата,ТекТипЦен);	
					Наценка = ПолучитьНаценкуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,ДокументОбъект.Контрагент,ДокументОбъект.Дата,ТекТипЦен);
					Если Наценка <> Неопределено И Наценка <> 0 Тогда
						Скидка1 = СтрокаТабличнойЧасти.Скидка1;
						СтрокаТабличнойЧасти.Скидка1 = Скидка1 -Наценка + Скидка1*Наценка/100;
					КонецЕсли;
					
				Иначе
					Если ЕстьРеквизитДокумента("ТипСкидок",МетаданныеДокумента) Тогда
						СтрокаТабличнойЧасти.Скидка1=ПолучитьСкидкуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,ДокументОбъект.ТипСкидок,ДокументОбъект.Дата);			
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
			//кухарь 04.12.14 конец	
			ТекТипЦен	= ДокументОбъект.ТипЦен;			
		КонецЕсли;	
	КонецЕсли;
	
	Если МетаданныеДокумента.Имя="ПродажаИМ" Тогда		
		Если Распродажа Тогда
			СтрокаТабличнойЧасти.Скидка			= -1;
		Иначе
			
			//нечаева +++
			Если ЕстьРеквизитДокумента("ТипСкидок",МетаданныеДокумента) Тогда
				СкидкаРаспродажа=ПолучитьСкидкуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,ДокументОбъект.ТипСкидок,ДокументОбъект.Дата);			
				попытка
					Если СкидкаРаспродажа>СтрокаТабличнойЧасти.Скидка Тогда
						СтрокаТабличнойЧасти.Скидка=СкидкаРаспродажа;
					КонецЕсли;
				исключение
				конецПопытки;
				
			КонецЕсли;	
			
			//нечаева ---
			
			
			СтрокаТабличнойЧасти.Скидка = Макс(СтрокаТабличнойЧасти.Скидка,ДокументОбъект.Скидка);	
			
			//Если ЕстьРеквизитДокумента("Договор",МетаданныеДокумента) И ЗначениеЗаполнено(ДокументОбъект.Договор) И ДокументОбъект.Договор.ДопСкидка<>0 Тогда
			//	СтрокаТабличнойЧасти.Скидка=СтрокаТабличнойЧасти.Скидка+ДокументОбъект.Договор.ДопСкидка;
			//	Если СтрокаТабличнойЧасти.Скидка=-1 Тогда				
			//		СтрокаТабличнойЧасти.Скидка=0;									
			//	КонецЕсли;	
			//КонецЕсли; 
		КонецЕсли;		
		
	КонецЕсли;
	// нечаева ----
	
	
	
	//нечаева 30.03.2011 начало
	// изменяем дату взятия цены, для интернет магазина не дата документа, а дата заказа!	
	//Если ЕстьРеквизитТабЧастиДокумента(ИмяРеквизитыЦены, МетаданныеДокумента, ИмяТабличнойЧасти) Тогда		
	//	СтрокаТабличнойЧасти[ИмяРеквизитыЦены]=ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,СтрокаТабличнойЧасти.Единица,ТекТипЦен,ДокументОбъект.Валюта,ДокументОбъект.Курс,ДокументОбъект.Дата);
	//КонецЕсли; 
	//
	//Если ЕстьРеквизитТабЧастиДокумента("ТипЦен",МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
	//	СтрокаТабличнойЧасти.ТипЦен = ТекТипЦен;
	//КонецЕсли;
	//	//крохин начало
	////продажи сотруднику
	//Если ДокументОбъект.Метаданные().Имя = "Чек" И ДокументОбъект.Акция = Справочники.Акции.НайтиПоКоду("SNL-00008") И ДокументОбъект.Акция <> Справочники.Акции.ПустаяСсылка() Тогда
	////sale
	//Цена=ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,СтрокаТабличнойЧасти.Единица,Справочники.ТипыЦен.НайтиПоКоду("SNL-0393"),ДокументОбъект.Валюта,ДокументОбъект.Курс,ДокументОбъект.Дата);	
	//СтрокаТабличнойЧасти.ЦенаБезСкидки	= Цена;	
	//СтрокаТабличнойЧасти.Скидка = -1;
	////базовый прайс белье
	//Если НЕ ЗначениеЗаполнено(Цена) Тогда
	//Цена=ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,СтрокаТабличнойЧасти.Единица,Справочники.ТипыЦен.НайтиПоКоду("SNL-0333"),ДокументОбъект.Валюта,ДокументОбъект.Курс,ДокументОбъект.Дата);	
	//СтрокаТабличнойЧасти.ЦенаБезСкидки	= Цена;	
	//СтрокаТабличнойЧасти.Скидка = -1;
	//КонецЕсли;
	////оптовая цена белье
	//	Если НЕ ЗначениеЗаполнено(Цена) Тогда
	//Цена=ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,СтрокаТабличнойЧасти.Единица,Справочники.ТипыЦен.НайтиПоКоду("SSP-0318"),ДокументОбъект.Валюта,ДокументОбъект.Курс,ДокументОбъект.Дата);	
	//СтрокаТабличнойЧасти.ЦенаБезСкидки	= Цена;	
	//СтрокаТабличнойЧасти.Скидка = -1;
	//КонецЕсли;
	////обцл
	//Если НЕ ЗначениеЗаполнено(Цена) Тогда
	//Цена=ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,СтрокаТабличнойЧасти.Единица,Справочники.ТипыЦен.НайтиПоКоду("SNL-0229"),ДокументОбъект.Валюта,ДокументОбъект.Курс,ДокументОбъект.Дата);	
	//СтрокаТабличнойЧасти.ЦенаБезСкидки	= Цена;	
	//СтрокаТабличнойЧасти.Скидка = -1;
	//КонецЕсли;
	////ЧЛ - 15%
	//Если НЕ ЗначениеЗаполнено(Цена) Тогда
	//Цена=ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,СтрокаТабличнойЧасти.Единица,Справочники.ТипыЦен.НайтиПоКоду("SSP-0301"),ДокументОбъект.Валюта,ДокументОбъект.Курс,ДокументОбъект.Дата);	
	//СтрокаТабличнойЧасти.ЦенаБезСкидки	= Цена;	
	//СтрокаТабличнойЧасти.Скидка = 15;
	//КонецЕсли;
	
	ДатаРасчетаЦены= ДокументОбъект.Дата;
	Если МетаданныеДокумента.Имя="ПродажаИМ" Тогда	
		ДатаРасчетаЦены= ДокументОбъект.ДатаВходящегоДокументаЭлектронногоОбмена;
	КонецЕсли;
	
	
	Если ЕстьРеквизитТабЧастиДокумента(ИмяРеквизитыЦены, МетаданныеДокумента, ИмяТабличнойЧасти) Тогда		    
		// Кухарь А.Ю.  12.03.2026 начало
		// СтрокаТабличнойЧасти[ИмяРеквизитыЦены]=ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,СтрокаТабличнойЧасти.Единица,ТекТипЦен,ДокументОбъект.Валюта,ДокументОбъект.Курс,ДатаРасчетаЦены);              
		если ПредопределеннаяЦена = 0 тогда
			СтрокаТабличнойЧасти[ИмяРеквизитыЦены]=ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,СтрокаТабличнойЧасти.Единица,ТекТипЦен,ДокументОбъект.Валюта,ДокументОбъект.Курс,ДатаРасчетаЦены);
		иначе  
			СтрокаТабличнойЧасти[ИмяРеквизитыЦены]= ПредопределеннаяЦена;
		КонецЕсли;
		// Кухарь А.Ю.  12.03.2026 конец
		
	КонецЕсли; 
	
	Если ЕстьРеквизитТабЧастиДокумента("ТипЦен",МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
		СтрокаТабличнойЧасти.ТипЦен = ТекТипЦен;
	КонецЕсли;
	//крохин начало
	//продажи сотруднику
	Если ДокументОбъект.Метаданные().Имя = "Чек" И ДокументОбъект.Акция = Справочники.Акции.НайтиПоКоду("SNL-00008") И ДокументОбъект.Акция <> Справочники.Акции.ПустаяСсылка() Тогда
		//крохин начало 03.01.2012
		//новый алгоритм
		//		//крохин начало 20.12.2011
		////SaleОпт
		//Цена=ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,СтрокаТабличнойЧасти.Единица,Справочники.ТипыЦен.НайтиПоКоду("SSP-0314"),ДокументОбъект.Валюта,ДокументОбъект.Курс,ДатаРасчетаЦены);	
		//СтрокаТабличнойЧасти.ЦенаБезСкидки	= Цена;	
		//СтрокаТабличнойЧасти.Скидка = -1;
		////SaleТочечнаяРозница
		//Если НЕ ЗначениеЗаполнено(Цена) Тогда
		//Цена=ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,СтрокаТабличнойЧасти.Единица,Справочники.ТипыЦен.НайтиПоКоду("SNL-0584"),ДокументОбъект.Валюта,ДокументОбъект.Курс,ДатаРасчетаЦены);	
		//СтрокаТабличнойЧасти.ЦенаБезСкидки	= Цена;	
		//СтрокаТабличнойЧасти.Скидка = -1;
		//КонецЕсли;
		////крохин конец 20.12.2011	
		//крохин конец 03.01.2012
		//sale
		Если НЕ ЗначениеЗаполнено(Цена) Тогда
			Цена=ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,СтрокаТабличнойЧасти.Единица,Справочники.ТипыЦен.НайтиПоКоду("SNL-0393"),ДокументОбъект.Валюта,ДокументОбъект.Курс,ДатаРасчетаЦены);	
			СтрокаТабличнойЧасти.ЦенаБезСкидки	= Цена;	
			СтрокаТабличнойЧасти.Скидка = -1;
		КонецЕсли;
		//базовый прайс белье
		Если НЕ ЗначениеЗаполнено(Цена) Тогда
			Цена=ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,СтрокаТабличнойЧасти.Единица,Справочники.ТипыЦен.НайтиПоКоду("SNL-0333"),ДокументОбъект.Валюта,ДокументОбъект.Курс,ДатаРасчетаЦены);	
			СтрокаТабличнойЧасти.ЦенаБезСкидки	= Цена;	
			СтрокаТабличнойЧасти.Скидка = -1;
		КонецЕсли;
		//оптовая цена белье
		Если НЕ ЗначениеЗаполнено(Цена) Тогда
			Цена=ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,СтрокаТабличнойЧасти.Единица,Справочники.ТипыЦен.НайтиПоКоду("SSP-0318"),ДокументОбъект.Валюта,ДокументОбъект.Курс,ДатаРасчетаЦены);	
			СтрокаТабличнойЧасти.ЦенаБезСкидки	= Цена;	
			СтрокаТабличнойЧасти.Скидка = -1;
		КонецЕсли;
		//обцл
		Если НЕ ЗначениеЗаполнено(Цена) Тогда
			Цена=ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,СтрокаТабличнойЧасти.Единица,Справочники.ТипыЦен.НайтиПоКоду("SNL-0229"),ДокументОбъект.Валюта,ДокументОбъект.Курс,ДокументОбъект.Дата);	
			СтрокаТабличнойЧасти.ЦенаБезСкидки	= Цена;	
			СтрокаТабличнойЧасти.Скидка = -1;
		КонецЕсли;
		//крохин начало 03.01.2012
		//новый алгоритм
		//SaleТочечнаяРозница
		Если НЕ ЗначениеЗаполнено(Цена) Тогда
			Цена=ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,СтрокаТабличнойЧасти.Единица,Справочники.ТипыЦен.НайтиПоКоду("SNL-0584"),ДокументОбъект.Валюта,ДокументОбъект.Курс,ДатаРасчетаЦены);	
			СтрокаТабличнойЧасти.ЦенаБезСкидки	= Цена;	
			СтрокаТабличнойЧасти.Скидка = -1;
		КонецЕсли;	
		//крохин конец 03.01.2012
		
		//ЧЛ - 15%
		Если НЕ ЗначениеЗаполнено(Цена) Тогда
			Цена=ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,СтрокаТабличнойЧасти.Единица,Справочники.ТипыЦен.НайтиПоКоду("SSP-0301"),ДокументОбъект.Валюта,ДокументОбъект.Курс,ДокументОбъект.Дата);	
			СтрокаТабличнойЧасти.ЦенаБезСкидки	= Цена;	
			СтрокаТабличнойЧасти.Скидка = 15;
		КонецЕсли;
		
		
	КонецЕсли;
	//крохин конец
	
	//нечаева 30.03.2011 конец
	
	
	
	//крохин конец
	
	// +++ 2011-11-21 сезонные бонусы
	// {{{ ЗАКОММЕНТИРОВАНО, Т.К. ПОСЛЕ ВЫЗОВА ЗаполнитьЦенуНоменклатурыТабЧасти 
	// ДОЛЖЕН БЫТЬ ВЫЗОВ РассчитатьСуммуТабЧасти, А В НЁМ БУДУТ ЗАПОЛНЕНЫ ЦенаБезБонуса И ВсегоБезБонуса
	//Если (МетаданныеДокумента.Имя = "РасходнаяНакладная") 
	//	И ЕстьРеквизитТабЧастиДокумента("ЦенаБезБонуса", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
	//	СтрокаТабличнойЧасти.ЦенаБезБонуса = СтрокаТабличнойЧасти.Цена;
	//КонецЕсли;
	// }}}
	// 2011-11-21 сезонные бонусы +++
	//кухарь исключение пустых цен в ПРМ 07.11.13  начало
	//кухарь 04.12.14 начало
	//не будем расчитывать цены для ПРМ созданных обработкой, пусть ставят руками
	//если ДокументОбъект.метаданные().имя="Перемещение" тогда 
	если ДокументОбъект.метаданные().имя="Перемещение" и ПараметрыСеанса.ЗапущенаОбработка=Ложь тогда 
		
		//Кухарь 01.08.17 начало
		//У франчазёров своя схема
		если ЗначениеЗаполнено(ДокументОбъект.склад.Подразделение.ТипАртикулаКонтрагента) тогда 
			запрос=новый запрос;
			запрос.Текст="ВЫБРАТЬ
			|	ОстаткиТМЦОстатки.Номенклатура как Номенклатура,
			|	ВЫБОР
			|		КОГДА ОстаткиТМЦОстатки.КоличествоОстаток = 0
			|			ТОГДА 0
			|		ИНАЧЕ ОстаткиТМЦОстатки.СуммаОстаток / ОстаткиТМЦОстатки.КоличествоОстаток
			|	КОНЕЦ КАК цена
			|ИЗ
			|	РегистрНакопления.ОстаткиТМЦ.Остатки(
			|			&МоментВремени,
			|			Номенклатура = &Номенклатура
			|				И склад = &Склад) КАК ОстаткиТМЦОстатки";
			запрос.УстановитьПараметр("Номенклатура",СтрокаТабличнойЧасти.Номенклатура);
			запрос.УстановитьПараметр("Склад",ДокументОбъект.Склад);
			запрос.УстановитьПараметр("МоментВремени",новый Граница(ДокументОбъект.МоментВремени(),ВидГраницы.Исключая));
			результат=запрос.Выполнить().выбрать();
			
			пока результат.Следующий() цикл
				СтрокаТабличнойЧасти.Цена=результат.цена;
			КонецЦикла;		
			
			если СтрокаТабличнойЧасти.Цена=0 тогда	
				запрос=новый запрос;
				запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
				|	ПеремещениеТовары.Цена
				|ИЗ
				|	Документ.Перемещение.Товары КАК ПеремещениеТовары
				|ГДЕ
				|	ПеремещениеТовары.Ссылка.СкладПолучатель = &СкладПолучатель
				|	И ПеремещениеТовары.Цена > 0
				|	И ПеремещениеТовары.Ссылка.Проведен
				|	И ПеремещениеТовары.Номенклатура = &Номенклатура
				|
				|УПОРЯДОЧИТЬ ПО
				|	ПеремещениеТовары.Ссылка.Дата УБЫВ";
				запрос.УстановитьПараметр("СкладПолучатель",ДокументОбъект.Склад);
				запрос.УстановитьПараметр("Номенклатура",СтрокаТабличнойЧасти.Номенклатура);
				РезЦен=запрос.Выполнить().Выбрать();
				пока РезЦен.Следующий() цикл 
					СтрокаТабличнойЧасти.Цена=РезЦен.цена;
				КонецЦикла;
			КонецЕсли;
			если  СтрокаТабличнойЧасти.Цена>0 тогда 
				СтрокаТабличнойЧасти.ценабезскидки=СтрокаТабличнойЧасти.Цена;
				СтрокаТабличнойЧасти.Скидка=0;
				Возврат;
			КонецЕсли;
		КонецЕсли;
		//Кухарь 01.08.17 конец
		
		
		//кухарь 04.12.14 конец	
		Если СтрокаТабличнойЧасти.ценабезскидки=0  Тогда
			СтрокаТабличнойЧасти.скидка=0;
			Цена=ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,СтрокаТабличнойЧасти.Единица,Справочники.ТипыЦен.НайтиПоКоду("SSP-0301"),ДокументОбъект.Валюта,ДокументОбъект.Курс,ДокументОбъект.Дата);	
			//кухарь 05.09.14 начало
			//если не нашлось и в 00. Частное лицо, попробуем поискать в SALE Частное лицо 
			если цена=0 или цена="" или цена=Неопределено тогда
				Цена=ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,СтрокаТабличнойЧасти.Единица,Справочники.ТипыЦен.НайтиПоКоду("SNL-0393"),ДокументОбъект.Валюта,ДокументОбъект.Курс,ДокументОбъект.Дата);	
			КонецЕсли;
			//кухарь 05.09.14 конец
			
			//кухарь 25.11.14 начало
			//если цен по прежнему нет, поищем цену в остатках
			если Цена=0 или цена = "" или цена=Неопределено тогда
				запрос=новый запрос;
				запрос.Текст="ВЫБРАТЬ
				|	ОстаткиТМЦОстаткиИОбороты.Регистратор КАК ссылка
				|ИЗ
				|	РегистрНакопления.ОстаткиТМЦ.ОстаткиИОбороты(
				|			&НачПериода,
				|			,
				|			Авто,
				|			,
				|			Номенклатура = &Номенклатура
				|				И склад.подразделение = &Подразделение) КАК ОстаткиТМЦОстаткиИОбороты
				|ГДЕ
				|	(НЕ(ОстаткиТМЦОстаткиИОбороты.Регистратор.Ссылка ССЫЛКА Документ.Перемещение
				|				И ОстаткиТМЦОстаткиИОбороты.Регистратор.Склад.Подразделение = ОстаткиТМЦОстаткиИОбороты.Регистратор.СкладПолучатель.Подразделение))
				//Валетов + 16,12,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8193
				|	И НЕ ОстаткиТМЦОстаткиИОбороты.Регистратор.Ссылка ССЫЛКА Документ.КорректировкаЗаписейРегистров    
				//Валетов -
				|	И ОстаткиТМЦОстаткиИОбороты.КоличествоПриход > 0
				|
				|УПОРЯДОЧИТЬ ПО
				|	ОстаткиТМЦОстаткиИОбороты.Регистратор.Дата УБЫВ";
				запрос.УстановитьПараметр("Номенклатура",СтрокаТабличнойЧасти.Номенклатура);
				запрос.УстановитьПараметр("Подразделение",ПараметрыСеанса.ЭтотУзел.Подразделение);
				//кухарь 17.12.14 начало
				//на складе нельзя выбирать документы позже этой даты
				запрос.УстановитьПараметр("НачПериода",Константы.ДатаЗапретаВидимости.Получить());				
				//кухарь 17.12.14 конец
				результат=запрос.Выполнить().Выгрузить();
				если результат.Количество()=0 тогда
					цена=0;
				иначе
					Регистратор=результат.Получить(0).ссылка;
					цена=Регистратор.товары.найти(СтрокаТабличнойЧасти.Номенклатура).цена;
					
				КонецЕсли;
			КонецЕсли;
			
			//кухарь 26.12.14 начало
			//иногда эта цена отрицательная, возьмём максимальную
			//если Цена=0 тогда
			//	запрос=новый запрос;
			//	запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
			//	|	ЦеныНоменклатурыСрезПоследних.Цена как Цена
			//	|ИЗ
			//	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних
			//	|
			//	|УПОРЯДОЧИТЬ ПО
			//	|	ЦеныНоменклатурыСрезПоследних.Период УБЫВ";
			если Цена<=0 тогда
				запрос=новый запрос;
				запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
				|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена,
				|	ЦеныНоменклатурыСрезПоследних.Номенклатура
				|ИЗ
				|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних
				|
				|СГРУППИРОВАТЬ ПО
				|	ЦеныНоменклатурыСрезПоследних.Номенклатура";
				//кухарь 26.12.14 конец
				запрос.УстановитьПараметр("Номенклатура",СтрокаТабличнойЧасти.Номенклатура.родитель);
				результат=запрос.Выполнить().Выгрузить();
				если результат.Количество()=0 тогда
					цена=0;
				иначе
					цена=результат.Получить(0).цена;
				КонецЕсли;					
			КонецЕсли;
			//кухарь 25.11.14 конец
			
			
			//Кухарь 06.08.15 начало
			//Если цена таки 0
			если Цена <=0 тогда
				запрос=новый Запрос;
				запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
				|	ЕСТЬNULL(МатрицаТовары.Цена, 0) КАК Цена
				|ИЗ
				|	Документ.Матрица.Товары КАК МатрицаТовары
				|ГДЕ
				|	МатрицаТовары.Цена > 0";
				результат=запрос.Выполнить().Выбрать();
				если результат.Следующий() тогда
					цена=результат.цена;
				КонецЕсли;
			КонецЕсли;
			//Кухарь 06.08.15 конец
			
			
			СтрокаТабличнойЧасти.ценабезскидки	= Цена;
		КонецЕсли;
	КонецЕсли;
	
	//кухарь исключение пустых цен в ПРМ 07.11.13  конец
	
	// Кухарь А.Ю.  24.05.2023 начало
	//
	если ИмяДокумента="ЗаказПоставщику"  тогда
		//ТекСкидка= 100*(СтрокаТабличнойЧасти.ЦенаБезСкидки-СтрокаТабличнойЧасти.Цена)/СтрокаТабличнойЧасти.ЦенаБезСкидки;

		если ЗначениеЗаполнено(ДокументОбъект.КонтрагентКомпенсация) И ЗначениеЗаполнено(ДокументОбъект.ДоговорКомпенсация) И  ЗначениеЗаполнено(ДокументОбъект.ТипЦенКомпенсация) тогда
			ТипЦенКомпенсация=ДокументОбъект.ТипЦенКомпенсация;
			если ДокументОбъект.Валюта=ТипЦенКомпенсация.Валюта тогда		
				СтрокаТабличнойЧасти.ЦенаКомпенсации=ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура,СтрокаТабличнойЧасти.Единица,ТипЦенКомпенсация,ДокументОбъект.Валюта,ДокументОбъект.Курс,ДатаРасчетаЦены); 
			иначе
				СтрокаТабличнойЧасти.ЦенаКомпенсации=0;
			КонецЕсли;
		иначе
			СтрокаТабличнойЧасти.ЦенаКомпенсации=0;
			СтрокаТабличнойЧасти.ЦенаСКомпенсацией=0;
		КонецЕсли;
		
		//СтрокаТабличнойЧасти.Цена=СтрокаТабличнойЧасти.ЦенаБезСкидки-СтрокаТабличнойЧасти.ЦенаКомпенсации;
		//СтрокаТабличнойЧасти.ЦенаБезСкидки=СтрокаТабличнойЧасти.Цена/(1-ТекСкидка/100);

	КонецЕсли;
	// Кухарь А.Ю.  24.05.2023 конец
	
	
	
КонецПроцедуры


// Процедура выполняет стандартные действия при изменении номенклатуры 
// в строке табличной части документа (очищает ссылки на подчиненные справочники).
//
// Параметры:
//  СтрокаТабличнойЧасти - строка табличной части документа,
//  ДокументОбъект       - объект редактируемого документа
//  ИмяЕдиницыИзмерения  - наименование единицы измерения
//  27.06.2024 Тимофеев Ю.А.
//  ЦенаСМаркетПлейса    - внешнее значение цены (например переданное из заказа с Маркетлейса

//
// Кухарь А.Ю.  06.03.2026 начало
// Пустая задача 
//Процедура ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект, ИмяЕдиницыИзмерения = "Единица", ЦенаСМаркетПлейса=0) Экспорт
Процедура ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект, ИмяЕдиницыИзмерения = "Единица", ЦенаСМаркетПлейса=0, ДопПараметры = Неопределено) Экспорт
 
// Кухарь А.Ю.  06.03.2026 конец
	
	ИмяТабличнойЧасти = ПолучитьИмяТабличнойЧастиПоСсылкеНаСтроку(СтрокаТабличнойЧасти);
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	//нечаева 27,05,15 +++
	// для договоров не по матрице
	Попытка
		Если ДокументОбъект.Договор.НеИспользоватьМатрицу Тогда
			НеИспользоватьМартицуПоДоговору=Истина;
		иначе
			НеИспользоватьМартицуПоДоговору=ложь;
		КонецЕсли;	
	Исключение
		НеИспользоватьМартицуПоДоговору=ложь;
	конецПопытки;
	//нечаева 27,05,15 ---  
	
	// Кухарь А.Ю.  12.03.2026 начало     
	ЗаполнятьСтавкуНДСИзМодели = ложь;   
	КоэффициентВсегдаОдин = ложь;   
	ПредопределеннаяЦена = 0;
	если ТипЗнч(ДопПараметры) = Тип("Структура") тогда           
		Если ДопПараметры.Свойство("ЗаполнятьСтавкуНДСИзРодителя") тогда   
			ЗаполнятьСтавкуНДСИзМодели = ДопПараметры.ЗаполнятьСтавкуНДСИзРодителя;
		КонецЕсли;       
		
		Если ДопПараметры.Свойство("КоэффициентВсегдаОдин") тогда   
			КоэффициентВсегдаОдин = ДопПараметры.КоэффициентВсегдаОдин;
		КонецЕсли; 

		Если ДопПараметры.Свойство("ПредопределеннаяЦена") тогда   
			ПредопределеннаяЦена = ДопПараметры.ПредопределеннаяЦена;
		КонецЕсли; 
		
	КонецЕсли;    
	если ЗаполнятьСтавкуНДСИзМодели тогда 
		РеквизитыМодели = ОбщегоНазначения_ПИ.ПолучитьРеквизитыШапки_ПИ(СтрокаТабличнойЧасти.Номенклатура,"Родитель,Родитель.СтавкаНДС","Справочник");
	КонецЕсли;
	// Кухарь А.Ю.  12.03.2026 конец
	

	
	
	// При изменении номенклатуры очистим ссылки на подчиненные справочники
	
	// Кухарь А.Ю.  06.03.2026 начало
	//Если ЕстьРеквизитТабЧастиДокумента(ИмяЕдиницыИзмерения, МетаданныеДокумента, ИмяТабличнойЧасти)
	//	И СтрокаТабличнойЧасти.Номенклатура <> СтрокаТабличнойЧасти[ИмяЕдиницыИзмерения].Владелец Тогда
	//	СтрокаТабличнойЧасти[ИмяЕдиницыИзмерения] = СтрокаТабличнойЧасти.Номенклатура.ОсновнаяЕдиница;
	//	Если ЕстьРеквизитТабЧастиДокумента("Коэффициент", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
	//		СтрокаТабличнойЧасти.Коэффициент = СтрокаТабличнойЧасти[ИмяЕдиницыИзмерения].Коэффициент;
	//	КонецЕсли;
	//	Если ЕстьРеквизитТабЧастиДокумента("МестВКоробе", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
	//		Если ПолучитьЗначениеПоУмолчанию("ПересчитыватьКоличествоПриИзмененииКоробов")=Ложь Тогда
	//			СтрокаТабличнойЧасти.МестВКоробе = СтрокаТабличнойЧасти.Номенклатура.ОсновнаяЕдиница.ШтукВКоробе;
	//		КонецЕсли;			
	//	КонецЕсли;
	//	Если ЕстьРеквизитТабЧастиДокумента("Склад", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда			
	//		Если ЕстьРеквизитДокумента("СостояниеЗаказа",МетаданныеДокумента) и ДокументОбъект.СостояниеЗаказа<>Перечисления.СостояниеЗаказа.ВРаботе Тогда
	//		Иначе
	//			Если (ЕстьРеквизитДокумента("Склад", МетаданныеДокумента)) и Не(ДокументОбъект.Склад.Пустая()) Тогда
	//				СтрокаТабличнойЧасти.Склад = ДокументОбъект.Склад;						
	//			ИначеЕсли Не(СтрокаТабличнойЧасти.Номенклатура.Склад.Пустая()) Тогда
	//				СтрокаТабличнойЧасти.Склад = СтрокаТабличнойЧасти.Номенклатура.Склад;						
	//			ИначеЕсли СтрокаТабличнойЧасти.Склад.Пустая() Тогда 					
	//				СтрокаТабличнойЧасти.Склад = ПолучитьЗначениеПоУмолчанию("ОсновнойСклад");											
	//			КонецЕсли;
	//		КонецЕсли;			
	//	КонецЕсли;		
	//КонецЕсли;   
	//       
	СтруктураРеквизитовНоменклатуры = ОбщегоНазначения_ПИ.ПолучитьРеквизитыШапки_ПИ(СтрокаТабличнойЧасти.Номенклатура,"ОсновнаяЕдиница,Коэффициент","Справочник");
	
	Если ЕстьРеквизитТабЧастиДокумента(ИмяЕдиницыИзмерения, МетаданныеДокумента, ИмяТабличнойЧасти)
		И СтрокаТабличнойЧасти.Номенклатура <> СтрокаТабличнойЧасти[ИмяЕдиницыИзмерения].Владелец Тогда
		СтрокаТабличнойЧасти[ИмяЕдиницыИзмерения] = СтруктураРеквизитовНоменклатуры.ОсновнаяЕдиница;
		// Кухарь А.Ю.  12.03.2026 начало
		//Если ЕстьРеквизитТабЧастиДокумента("Коэффициент", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
		//	СтрокаТабличнойЧасти.Коэффициент = СтрокаТабличнойЧасти[ИмяЕдиницыИзмерения].Коэффициент;
		//КонецЕсли; 
		если КоэффициентВсегдаОдин тогда 
			СтрокаТабличнойЧасти.Коэффициент = 1;
		иначе
			Если ЕстьРеквизитТабЧастиДокумента("Коэффициент", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
				СтрокаТабличнойЧасти.Коэффициент = СтрокаТабличнойЧасти[ИмяЕдиницыИзмерения].Коэффициент;
			КонецЕсли;
		КонецЕсли;
		// Кухарь А.Ю.  12.03.2026 конец
		
		Если ЕстьРеквизитТабЧастиДокумента("Склад", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда			
			Если ЕстьРеквизитДокумента("СостояниеЗаказа",МетаданныеДокумента) и ДокументОбъект.СостояниеЗаказа<>Перечисления.СостояниеЗаказа.ВРаботе Тогда
			Иначе
				Если (ЕстьРеквизитДокумента("Склад", МетаданныеДокумента)) и Не(ДокументОбъект.Склад.Пустая()) Тогда
					СтрокаТабличнойЧасти.Склад = ДокументОбъект.Склад;											
				ИначеЕсли СтрокаТабличнойЧасти.Склад.Пустая() Тогда 					
					СтрокаТабличнойЧасти.Склад = ПолучитьЗначениеПоУмолчанию("ОсновнойСклад");											
				КонецЕсли;
			КонецЕсли;			
		КонецЕсли;		
	КонецЕсли;   	
	// Кухарь А.Ю.  06.03.2026 конец
	
	
	// Кухарь А.Ю.  12.03.2026 начало      
	//ЗаполнитьСтавкуНДСТабЧасти(СтрокаТабличнойЧасти,ДокументОбъект);    
	если ЗаполнятьСтавкуНДСИзМодели тогда 
		СтрокаТабличнойЧасти.СтавкаНДС = РеквизитыМодели.Родитель_СтавкаНДС;	
	иначе
		ЗаполнитьСтавкуНДСТабЧасти(СтрокаТабличнойЧасти,ДокументОбъект);
	КонецЕсли;
	// Кухарь А.Ю.  12.03.2026 конец
	
	
	
	//27.06.2024 Тимофеев Ю.А.
	
	//Если параметр ЦенаСМаркетПлейса>0 то установим ее	
	Если ЦенаСМаркетПлейса>0 Тогда
		СтрокаТабличнойЧасти.ЦенаБезСкидки=ЦенаСМаркетПлейса; 
		РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);

	Иначе
		
		//ЗаполнитьЦенуНоменклатурыТабЧасти(СтрокаТабличнойЧасти,ДокументОбъект);
		//нечаева  +++ 03.04.14
		Попытка
			//нечаева 05,06,14  +++    смотрим менеджера у контрагента
			//Если ДокументОбъект.контрагент.ИспользоватьНоменклатурнуюМатрицу и ДокументОбъект.менеджер.подразделение.родитель= Справочники.Подразделения.НайтиПоКоду("GRP-0421")  Тогда
			//крохин начало 22.10.2014
			//с 23.10.2014 для всех матричных контрагентов прайсы  не используем
			//Если ДокументОбъект.контрагент.ИспользоватьНоменклатурнуюМатрицу и ДокументОбъект.Контрагент.менеджер.подразделение.родитель= Справочники.Подразделения.НайтиПоКоду("GRP-0421")  Тогда
			
			//нечаева 27,05,15+++
			Если ДокументОбъект.контрагент.ИспользоватьНоменклатурнуюМатрицу и не НеИспользоватьМартицуПоДоговору Тогда
				///27,05,15---
				
				//крохин конец 22.10.2014
				//нечаева 05,06,14 ---
				
				// 22,08,14+++ нечаева
				// проверяем по какому типу расчитывать цену - с учетом договора или нет(если по договору не найдено). 
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Матрица.Ссылка КАК Ссылка1
				|ИЗ
				|	Документ.Матрица КАК Матрица
				|ГДЕ
				|	Матрица.Контрагент = &Контрагент
				|	И Матрица.Дата <= &Дата1
				|	И Матрица.ДатаОкончания >= &Дата2
				|	И Матрица.Договор = &Договор
				|	И Матрица.Проведен = истина
				|АВТОУПОРЯДОЧИВАНИЕ";
				
				
				Запрос.УстановитьПараметр("Дата2",НачалоДня(ДокументОбъект.дата));
				Запрос.УстановитьПараметр("Дата1",КонецДня(ДокументОбъект.дата));
				Запрос.УстановитьПараметр("Контрагент",ДокументОбъект.Контрагент);
				Запрос.УстановитьПараметр("Договор",ДокументОбъект.Договор);
				ТЗЕстьМатрицаПоДоговору = Запрос.Выполнить().Выгрузить();
				Если ТЗЕстьМатрицаПоДоговору.Количество()>0 Тогда
					ЗаполнитьЦенуНоменклатурыТабЧастиПоМатрице(СтрокаТабличнойЧасти,ДокументОбъект);
				иначе
					сообщить("!!! Не найдена матрица по договору документа, цены заполнены без учета договора!");
									// Кухарь А.Ю.  06.03.2026 начало
				// ЗаполнитьЦенуНоменклатурыТабЧасти(СтрокаТабличнойЧасти,ДокументОбъект); 
				ЗаполнитьЦенуНоменклатурыТабЧасти(СтрокаТабличнойЧасти,ДокументОбъект,ДопПараметры); 
				// Кухарь А.Ю.  06.03.2026 конец
				КонецЕсли;
				// 22,08,14 ---- нечаева
				
			иначе	
				// Кухарь А.Ю.  06.03.2026 начало
				// ЗаполнитьЦенуНоменклатурыТабЧасти(СтрокаТабличнойЧасти,ДокументОбъект); 
				ЗаполнитьЦенуНоменклатурыТабЧасти(СтрокаТабличнойЧасти,ДокументОбъект,ДопПараметры); 
				// Кухарь А.Ю.  06.03.2026 конец
				
			КонецЕсли;
		исключение
							// Кухарь А.Ю.  06.03.2026 начало
				// ЗаполнитьЦенуНоменклатурыТабЧасти(СтрокаТабличнойЧасти,ДокументОбъект); 
				ЗаполнитьЦенуНоменклатурыТабЧасти(СтрокаТабличнойЧасти,ДокументОбъект,ДопПараметры); 
				// Кухарь А.Ю.  06.03.2026 конец
		конецПопытки;	
		
	КонецЕсли;
	//Тимофеев Ю.А.

	
	
	
	//нечаева 03,04,014 ---
	
	// Кухарь А.Ю. 26.04.2022 начало
	// РНК + КМП
	Если  ЕстьРеквизитТабЧастиДокумента("КоличествоКомплектующих",МетаданныеДокумента,ИмяТабличнойЧасти) Тогда 
		ЗаполнитьКоличествоКомплектующихПоСтроке(СтрокаТабличнойЧасти);
	КонецЕсли;
	// Кухарь А.Ю. 26.04.2022 конец
	
	
КонецПроцедуры // ПриИзмененииНоменклатурыТабЧасти()

// Процедура выполняет стандартные действия при изменении единицы цены
// в строке табличной части документа.
//
// Параметры:
//  СтрокаТабличнойЧасти - строка табличной части документа,
//  ДокументОбъект       - объект редактируемого документа
//
Процедура ПриИзмененииЕдиницыТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект) Экспорт
	
	ИмяТабличнойЧасти   = ПолучитьИмяТабличнойЧастиПоСсылкеНаСтроку(СтрокаТабличнойЧасти);
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Если ЕстьРеквизитТабЧастиДокумента("ЕдиницаИзмеренияМест", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
		Если ЕстьРеквизитТабЧастиДокумента("КоличествоМест", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
			
			Если ЗначениеНеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаИзмерения) Тогда
				СообщитьОбОшибке("Для "+СтрокаТабличнойЧасти.Номенклатура.Наименование+" не выбрана единица измерения цены!
				|Пересчет количества невозможен.");
			Иначе
				Если СтрокаТабличнойЧасти.Коэффициент = 0 Тогда
					СообщитьОбОшибке("Для "+СтрокаТабличнойЧасти.Номенклатура.Наименование+" у единицы измерения цены "
					+СтрокаТабличнойЧасти.ЕдиницаИзмерения.Наименование+" не проставлен коэффициент!
					|Пересчет количества невозможен.");
				Иначе
					СтароеЗначениеКоэффициента = СтрокаТабличнойЧасти.Коэффициент;
					НовоеЗначениеКоэффициента  = СтрокаТабличнойЧасти.ЕдиницаИзмерения.Коэффициент;
					
					Если НовоеЗначениеКоэффициента <> СтароеЗначениеКоэффициента Тогда
						СтрокаТабличнойЧасти.Коэффициент = НовоеЗначениеКоэффициента;
						
						Если НЕ ЗначениеНеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаИзмеренияМест) Тогда
							СтрокаТабличнойЧасти.Количество  = СтрокаТабличнойЧасти.Количество * СтароеЗначениеКоэффициента
							/ НовоеЗначениеКоэффициента;
						КонецЕсли;
						
						РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
						
						Если ЕстьРеквизитТабЧастиДокумента("Цена", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
							СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Цена *НовоеЗначениеКоэффициента 
							/ СтароеЗначениеКоэффициента;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		СтароеЗначениеКоэффициента = СтрокаТабличнойЧасти.Коэффициент;
		
		// Установить коэффициент
		СтрокаТабличнойЧасти.Коэффициент = СтрокаТабличнойЧасти.ЕдиницаИзмерения.Коэффициент;
		
		// если в табличной части есть реквизит КоличествоМест, то цена задается не за ЕдиницуИзмерения,
		// а за базовую единицу хранения остатков. Т.е. цену пересчитывать не нужно
		Если ЕстьРеквизитТабЧастиДокумента("КоличествоМест", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
			// надо обновить изменение к-ва в документе
			РассчитатьКоличествоТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
		Иначе
			// ПересчитатьЦену
			Если СтароеЗначениеКоэффициента > 0
				И ЕстьРеквизитТабЧастиДокумента("Цена", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
				СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Коэффициент 
				/ СтароеЗначениеКоэффициента;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПриИзмененииЕдиницыТабЧасти

// Процедура выполняет стандартные действия при изменении единицы мест
// в строке табличной части документа.
//
// Параметры:
//  СтрокаТабличнойЧасти - строка табличной части документа,
//  ДокументОбъект       - объект редактируемого документа
//
Процедура ПриИзмененииЕдиницыМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект) Экспорт
	
	// Рассчитывает количество мест исходя из количества
	РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
	
КонецПроцедуры // ПриИзмененииЕдиницыМестаТабЧасти

// Процедура выполняет стандартные действия при изменении суммы 
// в строке табличной части документа.
//
// Параметры:
//  СтрокаТабличнойЧасти - строка табличной части документа,
//  ДокументОбъект       - объект редактируемого документа
//
Процедура ПриИзмененииСуммыТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект) Экспорт
	
	ИмяТабличнойЧасти = ПолучитьИмяТабличнойЧастиПоСсылкеНаСтроку(СтрокаТабличнойЧасти);
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Если ЗначениеНеЗаполнено(СтрокаТабличнойЧасти.Количество) Тогда
		СтрокаТабличнойЧасти.Цена = 0;
	Иначе	
		Если ЕстьРеквизитТабЧастиДокумента("ПроцентСкидкиНаценки", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
			ПересчитыватьСкидку = ПолучитьЗначениеПоУмолчанию("ПриИзмененииСуммыПересчитыватьСкидку");
			Если (ПересчитыватьСкидку И СтрокаТабличнойЧасти.ПроцентСкидкиНаценки <> 0) Тогда
				Если (СтрокаТабличнойЧасти.Цена = 0) Или (СтрокаТабличнойЧасти.Количество = 0) Тогда
					СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = 0;
					Если СтрокаТабличнойЧасти.Цена = 0 Тогда
						СообщитьОбОшибке("Цена равна 0, после изменения суммы установлена нулевая скидка!");
					Иначе
						СообщитьОбОшибке("Количество равно 0, после изменения суммы установлена нулевая скидка!");
					КонецЕсли;
				Иначе
					СуммаБезАвтоматическихСкидок = СтрокаТабличнойЧасти.Сумма;
					Если ЕстьРеквизитТабЧастиДокумента("ПроцентАвтоматическихСкидок", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
						СуммаБезСкидок = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
						СуммаБезАвтоматическихСкидок = СуммаБезСкидок - СуммаБезСкидок
						* СтрокаТабличнойЧасти.ПроцентАвтоматическихСкидок;
					КонецЕсли;
					СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = (1 - СуммаБезАвтоматическихСкидок
					/ (СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество)) * 100;
				КонецЕсли;
			Иначе
				Если СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = 100 Тогда
					СтрокаТабличнойЧасти.Цена = 0;
					СообщитьОбОшибке("Скидка равна 100%, после изменения суммы установлена нулевая цена!");
				Иначе
					ПроцентАвтоматическихСкидок = 0;
					Если ЕстьРеквизитТабЧастиДокумента("ПроцентАвтоматическихСкидок", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
						ПроцентАвтоматическихСкидок = СтрокаТабличнойЧасти.ПроцентАвтоматическихСкидок;
					КонецЕсли;
					СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма 
					/ ((1 - СтрокаТабличнойЧасти.ПроцентСкидкиНаценки - ПроцентАвтоматическихСкидок / 100)
					* СтрокаТабличнойЧасти.Количество);
				КонецЕсли;
			КонецЕсли;
		Иначе
			СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;			
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры // ПриИзмененииСуммыТабЧасти()

// Процедура заполняет Содержание из полного наименования номенклатуры в строке табличной части
//
// Параметры
//  СтрокаТабличнойЧасти - Строка табличной части
//
Процедура ЗаполнитьСодержаниеТабЧасти(СтрокаТабличнойЧасти, Документобъект) Экспорт
	
	ИмяТабличнойЧасти = ПолучитьИмяТабличнойЧастиПоСсылкеНаСтроку(СтрокаТабличнойЧасти);
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Если ЕстьРеквизитТабЧастиДокумента("Содержание", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
		СтрокаТабличнойЧасти.Содержание = СтрокаТабличнойЧасти.Номенклатура.НаименованиеПолное;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСодержаниеТабЧасти()

// Процедура очищает значение нужного реквизита в переданной ТЧ.
//
// Параметры:
//  ТабЧаст      - табличная часть,
//  ИмяРеквизита - строка, имя реквизита.
//
Процедура ОчиститьРеквизитТЧ(ТабЧасть, ИмяРеквизита) Экспорт
	
	Для Каждого Строка Из ТабЧасть Цикл
		Если Не ЗначениеНеЗаполнено(Строка[ИмяРеквизита]) Тогда
			Строка[ИмяРеквизита] = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры //ОчиститьРеквизитТЧ()

Процедура ПриИзмененииСкладаТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект) Экспорт
	ИмяТабличнойЧасти = ПолучитьИмяТабличнойЧастиПоСсылкеНаСтроку(СтрокаТабличнойЧасти);
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	// При изменении номенклатуры очистим ссылки на подчиненные справочники
	Если ЕстьРеквизитТабЧастиДокумента("МОЛ", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
		Если СтрокаТабличнойЧасти.Склад.УчетПоМОЛ=Истина И СтрокаТабличнойЧасти.Склад.СписокМОЛ.Найти(СтрокаТабличнойЧасти.МОЛ)<>Неопределено Тогда						
		Иначе			
			СтрокаТабличнойЧасти.МОЛ=Неопределено;		
		КонецЕсли; 		
	КонецЕсли;
КонецПроцедуры	

Процедура ПриИзмененииСклада(ДокументОбъект,ИмяРеквизитаСклад="Склад",ИмяРеквизитаМОЛ="МОЛ") Экспорт
	Склад	=ДокументОбъект[ИмяРеквизитаСклад];
	МОЛ     =ДокументОбъект[ИмяРеквизитаМОЛ];
	
	Если Склад.УчетПоМОЛ=Истина И Склад.СписокМОЛ.Найти(МОЛ)<>Неопределено Тогда						
	Иначе			
		ДокументОбъект[ИмяРеквизитаМОЛ]=Неопределено;		
	КонецЕсли; 		
КонецПроцедуры 

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБРАБОТКИ РАССЧЕТА ТАБЛИЧНОЙ ЧАСТИ ТОРГОВЫХ ДОКУМЕНТОВ

// <Описание функции>
//
// Параметры
//  <Параметр1>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   – <описание возвращаемого значения>
//
Функция ПолучитьСтавкуНДС(Номенклатура) Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ВЫБОР 
	|		КОГДА СтавкаНДС<>&ПустаяСтавка ТОГДА СтавкаНДС
	|		КОГДА Родитель.СтавкаНДС<>&ПустаяСтавка ТОГДА Родитель.СтавкаНДС
	|		КОГДА Родитель.Родитель.СтавкаНДС<>&ПустаяСтавка ТОГДА Родитель.Родитель.СтавкаНДС
	|		КОГДА Родитель.Родитель.Родитель.СтавкаНДС<>&ПустаяСтавка ТОГДА Родитель.Родитель.Родитель.СтавкаНДС
	//крохин начало
	|		КОГДА Родитель.Родитель.Родитель.Родитель.СтавкаНДС<>&ПустаяСтавка ТОГДА Родитель.Родитель.Родитель.Родитель.СтавкаНДС
	//|		КОГДА Родитель.Родитель.Родитель.Родитель.СтавкаНДС<>&ПустаяСтавка ТОГДА Родитель.Родитель.Родитель.СтавкаНДС
	//крохин конец
	|	ИНАЧЕ 
	| 		&ПустаяСтавка
	|	КОНЕЦ КАК СтавкаНДС
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ПустаяСтавка",Перечисления.СтавкиНДС.ПустаяСсылка());
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СтавкаНДС		
	Иначе
		Возврат Перечисления.СтавкиНДС.ПустаяСсылка();		
	КонецЕсли;
КонецФункции // ПолучитьСтавкуНДС()


// Процедура заполняет ставку НДС в строке табличной части документа
//
// Параметры:
//  СтрокаТабличнойЧасти     - строка табличной части документа,
//  ДокументОбъект           - объект редактируемого документа.
//
Процедура ЗаполнитьСтавкуНДСТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект) Экспорт
	
	ИмяТабличнойЧасти = ПолучитьИмяТабличнойЧастиПоСсылкеНаСтроку(СтрокаТабличнойЧасти);
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	//Заполнить СтавкаНДС
	Если ЕстьРеквизитТабЧастиДокумента("СтавкаНДС", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
		//крохин начало 29.03.2011
		//для отгрузки белорусским клиентам- ставка 0%
		//СтрокаТабличнойЧасти.СтавкаНДС = ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.Номенклатура);
		Если ЕстьРеквизитДокумента("НулеваяСтавкаНДС",МетаданныеДокумента) И ДокументОбъект.НулеваяСтавкаНДС Тогда
			СтрокаТабличнойЧасти.СтавкаНДС = Перечисления.СтавкиНДС.НДС0;			
		Иначе
			//Катаев+ 02/06/14
			//СтрокаТабличнойЧасти.СтавкаНДС = ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.Номенклатура);
			
			//Если МетаданныеДокумента.Имя = "ПриходнаяНакладная" и ИмяТабличнойЧасти = "Заказ" Тогда
			Если ЕстьРеквизитДокумента("ПоставщикПоАгентскойСхеме", МетаданныеДокумента) Тогда
				Если (ЕстьРеквизитДокумента("КодОперации", МетаданныеДокумента) И ДокументОбъект.КодОперации = Перечисления.КодыОперацийОстатки.АгентскийДоговор) И
					// Шворобей 09.01.2024 ++ https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2458
					(ЗначениеЗаполнено(ДокументОбъект.ПоставщикПоАгентскойСхеме) И ДокументОбъект.ПоставщикПоАгентскойСхеме.СтавкаНДСКонтрагента = Перечисления.СтавкиНДС.БезНДС) Тогда
						СтрокаТабличнойЧасти.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
				//крохин начало 16.01.2024
				//ошибка
				//ИначеЕсли ДокументОбъект.Контрагент.КонтрагентБезНДС Тогда
				//	СтрокаТабличнойЧасти.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
				//крохин конец 16.01.2024
				Иначе
					СтрокаТабличнойЧасти.СтавкаНДС = ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.Номенклатура);
				КонецЕсли;
			Иначе
				СтрокаТабличнойЧасти.СтавкаНДС = ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.Номенклатура);
			КонецЕсли;
			//Катаев- 02/06/14
		КонецЕсли;
		// Шворобей 09.01.2024 ++
		//крохин конец 29.03.2011
		
		//крохин начало 21.01.2019
		//для франчайзи без НДС
		//крохин начало 14.02.2019
		//ставка НДС для франчайзи нулевая во всех документах
		//Если ПараметрыСеанса.ЭтотУзел.Подразделение.НулеваяСтавкаНДСвЧеке И ДокументОбъект.метаданные().Имя = "Чек" Тогда
		Если ПараметрыСеанса.ЭтотУзел.Подразделение.НулеваяСтавкаНДСвЧеке Тогда
			//крохин конец 14.02.2019	
			СтрокаТабличнойЧасти.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
		КонецЕсли;
		//крохин конец 21.01.2019
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСтавкуНДСТабЧасти()

// Процедура заполняет единицу в строке табличной части документа
//
// Параметры:
//  СтрокаТабличнойЧасти     - строка табличной части документа,
//  ДокументОбъект           - объект редактируемого документа.
//
Процедура ЗаполнитьЕдиницуТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект) Экспорт
	
	// берем из самого реквизита Номенклатура
	СтрокаТабличнойЧасти.Единица	 = СтрокаТабличнойЧасти.Номенклатура.ОсновнаяЕдиница;
	СтрокаТабличнойЧасти.Коэффициент = СтрокаТабличнойЧасти.ЕдиницаИзмерения.Коэффициент;
	
	РассчитатьКоличествоТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект);
	
КонецПроцедуры // ЗаполнитьЕдиницуТабЧасти()




//Нечаева 03,04,18+++
Функция ПолучитьСуммыТандерЭкспозиторы(ДокОбъект,Экспозитор)
	
	ТН=Новый ТаблицаЗначений;
	
	ТН.Колонки.Добавить("Номенклатура");	
	ТН.Колонки.Добавить("Количество");
	ТН.Колонки.Добавить("НДС");
	ТН.Колонки.Добавить("Сумма");
	ТН.Колонки.Добавить("СтавкаНДС");
	ТН.Колонки.Добавить("Всего");
	ТН.Колонки.Добавить("Цена");
	
	ИсходнаяТЧ=ДокОбъект.Товары.Выгрузить();
	ИсходнаяТЧ = Новый ТаблицаЗначений;
	ИсходнаяТЧ.Колонки.Добавить("Номенклатура");	
	ИсходнаяТЧ.Колонки.Добавить("Количество");
	ИсходнаяТЧ.Колонки.Добавить("НДС");
	ИсходнаяТЧ.Колонки.Добавить("Сумма");
	ИсходнаяТЧ.Колонки.Добавить("Всего");
	ИсходнаяТЧ.Колонки.Добавить("Цена");
	
	
	// заменияем на колво экспозиторов. Цену берем из матрицы.
	
	ОбщКолво = ДокОбъект.товары.Итог("Количество");
	КолвВ1Эксп = Экспозитор.Коплектующие.Итог("Количество");
	Если КолвВ1Эксп = 0 Тогда
		ВсегоЭксп  = Окр(ОбщКолво);
	Иначе
		ВсегоЭксп  = Окр(ОбщКолво/КолвВ1Эксп);
	КонецЕсли;
	
	
	//------------------------------------------------------------------------
	//------------------------------------------------------------------------
	НовСтр = ТН.Добавить();
	НовСТр.Номенклатура = Экспозитор;
	НовСТр.Количество = ВсегоЭксп;
	//ЗаполнитьЦенуНоменклатурыТабЧастиПоМатрице(НовСТр, ДокОбъект) ;
	//ПриИзмененииНоменклатурыТабЧасти(НовСтр, ТекОб);
	
	
	
	//получим цену номенклатуры
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	МатрицаТовары.Номенклатура,
	|	МатрицаТовары.Цена,
	|	МатрицаПунктыДоставки.Ссылка
	|ИЗ
	|	Документ.Матрица.Товары КАК МатрицаТовары
	|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
	|ГДЕ
	|	МатрицаТовары.Ссылка.Дата <= &Дата1
	|	И МатрицаТовары.Ссылка.Проведен
	|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
	|	И МатрицаТовары.Ссылка.Договор = &Договор
	|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
	//	|	И МатрицаТовары.Ссылка.Акция = ИСТИНА
	|	И МатрицаТовары.Номенклатура = &ТекНом
	//	|	И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункДоставки
	|	УПОРЯДОЧИТЬ ПО
	|	МатрицаТовары.Ссылка.Дата УБЫВ
	|АВТОУПОРЯДОЧИВАНИЕ";
	//нечаева 18,07,17---
	Запрос.УстановитьПараметр("ТекНом",Экспозитор);			   
	Запрос.УстановитьПараметр("Дата2",НачалоДня(ДокОбъект.дата));
	Запрос.УстановитьПараметр("Дата1",КонецДня(ДокОбъект.дата));
	Запрос.УстановитьПараметр("Контрагент",ДокОбъект.Контрагент);
	Запрос.УстановитьПараметр("Договор",ДокОбъект.Договор);
	
	Запрос.УстановитьПараметр("ТекПункДоставки",ДокОбъект.пунктДоставки);
	// цена по акции
	ТЗ1 = Запрос.Выполнить().Выгрузить();
	Если ТЗ1.Количество()>0 Тогда
		Цена = ТЗ1[0].Цена;
	Иначе	
		Цена = 0;
	КонецЕсли;	
	//------------------------------------------------------------------------------------------
	
	НовСтр.Цена = Цена;
	
	НовСТр.Сумма 	= НовСТр.Цена * НовСТр.Количество;
	НовСТр.СтавкаНДС=ПолучитьСтавкуНДС(Экспозитор);
	СтавкаНДС=ПроцентНДСпоСтавке(НовСтр.СтавкаНДС);
	НовСтр.НДС	= Окр(НовСтр.Сумма*СтавкаНДС/(1+СтавкаНДС),2);			
	НовСтр.Всего	= НовСтр.Сумма;
	НовСтр.Сумма  = НовСтр.Всего - НовСтр.НДС;
	//------------------------------------------------------------------------
		
	// нечаева 11,10,23+++
	Ндссверху = ложь;

	Если ДокОбъект.Контрагент.НДС_СВерху = истина Тогда
		Ндссверху = истина;
	КонецЕсли;
		
	Если НдсСверху  Тогда
		Цена = Окр(Цена/(1+СтавкаНДС),2);
		НовСТр.Сумма	= Цена * НовСТр.Количество;
		НовСТр.НДС	= Окр(НовСТр.Сумма*СтавкаНДС,2);
		НовСТр.Всего	=  НовСТр.Сумма + НовСТр.НДС;
	КонецЕсли;
	// нечаева 11,10,23---
	
	//------------------------------------------------------------------------
	
	Для Каждого СтрокаТН Из ТН Цикл
		Номенклатура=СтрокаТН.Номенклатура;
		Модель		=СтрокаТН.Номенклатура.Родитель;
		// было
		//СтрокаТН.Цена		=?(СтрокаТН.Количество=0,0,СтрокаТН.Сумма/СтрокаТН.Количество);
		//Если СтрокаТН.Сумма=0 Тогда
		//	СтрокаТН.СтавкаНДС=100*ПроцентНДСпоСтавке(ПолучитьРеквизитРодителя(СтрокаТН.Номенклатура,"СтавкаНДС"));
		//Иначе			
		//	СтрокаТН.СтавкаНДС	=Окр(100*(СтрокаТН.НДС/СтрокаТН.Сумма),0,1);
		//КонецЕсли;			
		
		// нечаева11,10,23++
		ПрСтНДС = ПроцентНДСпоСтавке(ПолучитьРеквизитРодителя(СтрокаТН.Номенклатура,"СтавкаНДС"));
		
		Если СтрокаТН.Сумма=0 Тогда
			СтрокаТН.СтавкаНДС=100*ПрСтНДС ;
		Иначе			
			СтрокаТН.СтавкаНДС	=Окр(100*(СтрокаТН.НДС/СтрокаТН.Сумма),0,1);
		КонецЕсли;			
				
		Если НдсСверху  Тогда
			СтрокаТН.Цена =  ?(СтрокаТН.Количество=0,0,Окр(СтрокаТН.Цена/(1+ПрСтНДС),2))
			//цена = Окр(Цена/(1+СтавкаНДС),2);
		иначе
			СтрокаТН.Цена		=?(СтрокаТН.Количество=0,0,СтрокаТН.Сумма/СтрокаТН.Количество);
		КонецЕсли;
		// нечаева 11,10,23---

	КонецЦикла; 
	
	
	Возврат ТН;
КонецФункции // ПолучитьТаблицуНакладной()

Функция ПоправкаСуммТандер(ДокументОбъект,ТТТ)
	
	//ОбработкаПрерыванияПользователя();
	
	ПоправкаВсего = ТТТ.итог("Всего") - ДокументОбъект.Товары.Итог("Всего");
	ПоправкаНДС = ТТТ.итог("НДС") - ДокументОбъект.Товары.Итог("НДС");
	ШагПоправкиНДС =0 ;
	ШагПоправкиВсего = 0 ;
	
	//нечаева 08,11,19 +++    
	// увеличила сумму со 100 на 300 нечаева 25,10,23+++
	Если ПоправкаВсего<-300 или ПоправкаВсего>300 
		или ПоправкаНДС<-300 или ПоправкаНДС>300
		Тогда
		
		#если клиент тогда
			сообщить("Проверьте количество товаров в накладной, оно должно быть кратно экспозиторам!");
			сообщить("Итоговые суммы не пересчитаны! Разница больше 300 руб.");

		#конецесли	
		возврат ложь;
		
	КонецЕсли;	
	//нечаева 08,11,19 ---
	
	
	
	Если (ПоправкаВсего>1 ) или (ПоправкаВсего<-1) Тогда 
		ШагПоправкиВсего = Окр(ПоправкаВсего/ДокументОбъект.Товары.количество(),2);
	ИначеЕсли ПоправкаВсего<>0 Тогда
		ШагПоправкиВсего = 0.01;
	КонецЕсли;	
	
	Если ПоправкаНДС>1 или ПоправкаНДС<-1 Тогда 
		ШагПоправкиНДС = Окр(ПоправкаНДС/ДокументОбъект.Товары.количество(),2);
	иначеЕсли ПоправкаНДС<>0 Тогда
		ШагПоправкиНДС = 0.01;
	КонецЕсли;	
	
	Если ШагПоправкиНДС<0 Тогда ШагПоправкиНДС = -ШагПоправкиНДС; КонецЕсли;
	Если ШагПоправкиВсего<0 Тогда ШагПоправкиВсего = -ШагПоправкиВсего; КонецЕсли;
	
	Если  ПоправкаВсего<>0 или ПоправкаНДС<>0 Тогда
		Для Каждого ТекСтрокаТаблицыСтрок Из ДокументОбъект.Товары Цикл
			
			//ОбработкаПрерыванияПользователя();
			
			//Нечаева 
			Если ТекСтрокаТаблицыСтрок.Количество = 0 Тогда 
				продолжить;
			КонецЕсли; 
			
			Если ПоправкаНДС = 0 и ПоправкаВсего = 0 Тогда
				
				прервать;
			КонецЕсли;	
			
			
			Если ПоправкаНДС > 0 Тогда
				
				ТекСтрокаТаблицыСтрок.НДС = ТекСтрокаТаблицыСтрок.НДС +  ШагПоправкиНДС;
				ПоправкаНДС = поправкаНДС - ШагПоправкиНДС;
				
				Если ШагПоправкиНДС> ПоправкаНДС  Тогда
					ШагПоправкиНДС = ПоправкаНДС;
				КонецЕсли;
				
				
				//Если (поправкаНДС - ШагПоправкиНДС)>0  Тогда
				//	ТекСтрокаТаблицыСтрок.НДС = ТекСтрокаТаблицыСтрок.НДС +  ШагПоправкиНДС;
				//	ПоправкаНДС = поправкаНДС - ШагПоправкиНДС;
				//иначе
				//	ТекСтрокаТаблицыСтрок.НДС = ТекСтрокаТаблицыСтрок.НДС + ПоправкаНДС;
				//	ПоправкаНДС = 0;
				//КонецЕсли;	
				
				//ПоправкаНДС = поправкаНДС - 0.01;
			ИначеЕсли поправкаНДС < 0 тогда
				//ТекСтрокаТаблицыСтрок.НДС = ТекСтрокаТаблицыСтрок.НДС - 0.01;
				//ПоправкаНДС = поправкаНДС + 0.01;
				
				
				ТекСтрокаТаблицыСтрок.НДС = ТекСтрокаТаблицыСтрок.НДС - ШагПоправкиНДС;
				ПоправкаНДС = поправкаНДС + ШагПоправкиНДС;
				
				Если ШагПоправкиНДС< -ПоправкаНДС Тогда
					ШагПоправкиНДС = -ПоправкаНДС;
				КонецЕсли;
				
				
				
				
				
				//Если (поправкаНДС + ШагПоправкиНДС)<0  Тогда
				//	ТекСтрокаТаблицыСтрок.НДС = ТекСтрокаТаблицыСтрок.НДС - ШагПоправкиНДС;
				//	ПоправкаНДС = поправкаНДС + ШагПоправкиНДС;
				//иначе
				//	ТекСтрокаТаблицыСтрок.НДС = ТекСтрокаТаблицыСтрок.НДС - ПоправкаНДС;
				//	ПоправкаНДС = 0;
				//КонецЕсли;	
				//
				
			КонецЕсли;
			
			Если ПоправкаВсего > 0 Тогда
				
				ТекСтрокаТаблицыСтрок.Всего = ТекСтрокаТаблицыСтрок.Всего + ШагПоправкиВсего;
				ПоправкаВсего = поправкаВсего - ШагПоправкиВсего;
				
				
				Если ШагПоправкиВсего> ПоправкаВсего Тогда
					ШагПоправкиВсего = ПоправкаВсего;
				КонецЕсли;
				
				
				
				
				//Если (поправкаВсего - ШагПоправкиВсего)>0  Тогда
				//	ТекСтрокаТаблицыСтрок.Всего = ТекСтрокаТаблицыСтрок.Всего + ШагПоправкиВсего;
				//	ПоправкаВсего = поправкаВсего - ШагПоправкиВсего;
				//иначе
				//	//ТекСтрокаТаблицыСтрок.Всего = ТекСтрокаТаблицыСтрок.Всего + ПоправкаВсего;
				//	//ПоправкаВсего = 0;
				//КонецЕсли;	
				//
				
				//ТекСтрокаТаблицыСтрок.Всего = ТекСтрокаТаблицыСтрок.Всего + 0.01;
				//ПоправкаВсего = поправкаВсего - 0.01;
			ИначеЕсли поправкаВсего < 0 тогда
				
				ТекСтрокаТаблицыСтрок.Всего = ТекСтрокаТаблицыСтрок.Всего - ШагПоправкиВсего;
				ПоправкаВсего = поправкаВсего + ШагПоправкиВсего;
				
				Если ШагПоправкиВсего< ПоправкаВсего Тогда
					ШагПоправкиВсего = ПоправкаВсего;
				КонецЕсли;
				
				
				//Если (поправкаВсего + ШагПоправкиВсего)<0  Тогда
				//	ТекСтрокаТаблицыСтрок.Всего = ТекСтрокаТаблицыСтрок.Всего - ШагПоправкиВсего;
				//	ПоправкаВсего = поправкаВсего + ШагПоправкиВсего;
				//иначе
				//	//ТекСтрокаТаблицыСтрок.Всего = ТекСтрокаТаблицыСтрок.Всего - ПоправкаВсего;
				//	//ПоправкаВсего = 0;
				//КонецЕсли;	
				
				//ТекСтрокаТаблицыСтрок.Всего = ТекСтрокаТаблицыСтрок.Всего - 0.01;
				//ПоправкаВсего = поправкаВсего + 0.01;
				
				
				
				
				
			КонецЕсли;
			
			ТекСтрокаТаблицыСтрок.Сумма = ТекСтрокаТаблицыСтрок.Всего - ТекСтрокаТаблицыСтрок.НДС;
			ТекСтрокаТаблицыСтрок.ВсегоБезБонуса = ТекСтрокаТаблицыСтрок.Всего;
			ТекСтрокаТаблицыСтрок.ВсегоБезСкидки = ТекСтрокаТаблицыСтрок.Всего;
			
			
			
		КонецЦикла;
		
		
	КонецЕсли;	
	
	Если  ПоправкаВсего=0 и ПоправкаНДС=0 Тогда
		Возврат Истина;
	КонецЕсли;	
	
	
	Если ПоправкаВсего<>0 или ПоправкаНДС<>0 Тогда
		
		ПоправкаСуммТандер(ДокументОбъект,ТТТ);
	иначе	
		возврат Истина;
		
	КонецЕсли;
	
	возврат истина;
	
КонецФункции

//Нечаева 03,04,18---




// Рассчитывает сумму в строке табличной части документа
//
// Параметры:
//  СтрокаТабличнойЧасти - строка табличной части документа,
//  ДокументОбъект       - объект редактируемого документа,
//  ВидРасчета           - "Со всеми скидками", сумма минус скидки;
//                         "Без учета ручной скидки", сумма минус автоматические скидки;
//                         "Без учета скидок", сумма (Цена * Количество);
//
//Процедура РассчитатьСуммуТабЧасти(СтрокаТЧ, ДокументОбъект, СпособРасчета = Неопределено) Экспорт  
// Кухарь А.Ю. 27.10.2025 начало
// HELP-7589
Процедура РассчитатьСуммуТабЧасти(СтрокаТЧ, ДокументОбъект, СпособРасчета = Неопределено,ДопПараметры = Неопределено) Экспорт  
// Кухарь А.Ю. 27.10.2025 конец
	
	ИмяТабличнойЧасти 			= ПолучитьИмяТабличнойЧастиПоСсылкеНаСтроку(СтрокаТЧ);
	МетаданныеДокумента 		= ДокументОбъект.Метаданные();
	ВидДокумента				= МетаданныеДокумента.Имя;
	
	// Кухарь А.Ю.  12.03.2026 начало 
	ОтключитьРасчетЛогистическихРеквизитов = ложь;
	если ТипЗнч(ДопПараметры) = Тип("Структура") тогда
		если ДопПараметры.Свойство("ОтключитьРасчетЛогистическихРеквизитов") тогда    
			ОтключитьРасчетЛогистическихРеквизитов =  ДопПараметры.ОтключитьРасчетЛогистическихРеквизитов;
		КонецЕсли;      
	КонецЕсли;
	// Кухарь А.Ю.  12.03.2026 конец
	
	
	Если МетаданныеДокумента.Имя="ЗаказПоставщику" Тогда
		Цена=	(1-ДокументОбъект.Скидка1/100)*
		(1-ДокументОбъект.Скидка2/100)*
		(1-ДокументОбъект.Скидка3/100)*
		(1-ДокументОбъект.Скидка4/100)*
		(1-СтрокаТЧ.Скидка1/100)*
		(1-СтрокаТЧ.Скидка2/100)*
		(1-СтрокаТЧ.Скидка3/100)*
		(1-СтрокаТЧ.Скидка4/100)*
		(1-СтрокаТЧ.Скидка5/100);
		СтрокаТч.Единица=СтрокаТЧ.номенклатура.ОсновнаяЕдиница;
		СтрокаТч.Коэффициент = 1;
		Скидка=100*(1-Цена);
		
		
		// нечаева 14,04,16+++ для РКМ не пересчитываем  скидку, цена уже со скидкой передается, скидка в документе по строкам вседа =0.
	ИначеЕсли  МетаданныеДокумента.Имя="РекламационнаяНакладная" Тогда
		
		Скидка=0;
		// нечаева 14,04,16---	
	Иначе
		СкидкаТЧ=?(ЕстьРеквизитТабЧастиДокумента("Скидка",МетаданныеДокумента,ИмяТабличнойЧасти),СтрокаТЧ.Скидка,0);
		Если СкидкаТЧ=0 Тогда
			Скидка=?(ЕстьРеквизитДокумента("Скидка",МетаданныеДокумента),ДокументОбъект.Скидка,0);
		Иначе
			Если СкидкаТЧ>0 Тогда				
				Скидка=СкидкаТЧ;
				Если ЕстьРеквизитДокумента("ДопСкидкаНаНакладную",МетаданныеДокумента) И ДокументОбъект.ДопСкидкаНаНакладную Тогда
					Скидка=Скидка+ДокументОбъект.Скидка;
				КонецЕсли; 
			Иначе
				//крохин начало 23.04.2012
				//для Беларуси, скидки могут быть отрицательными
				//	Скидка=0;
				Если СкидкаТЧ = -1 Тогда
					Скидка=0;
				Иначе
					Скидка=СкидкаТЧ;
					Если ЕстьРеквизитДокумента("ДопСкидкаНаНакладную",МетаданныеДокумента) И ДокументОбъект.ДопСкидкаНаНакладную Тогда
						Скидка=Скидка+ДокументОбъект.Скидка;
					КонецЕсли;
				КонецЕсли;
				//крохин конец 23.04.2012
			КонецЕсли;
		КонецЕсли;
		////нечаева 03,06,15+++
		//// для оптовых клиентов увеличиваем тип скидок
		//Если ЕстьРеквизитДокумента("ТипСкидок",МетаданныеДокумента) Тогда
		//	Если  НЕ ДокументОбъект.ТипСкидок.пустая() Тогда
		//					
		//		ДопСкидкаОпт = ПолучитьСкидкуНоменклатуры(СтрокаТЧ.Номенклатура,ДокументОбъект.ТипСкидок,ДокументОбъект.Дата,);	 
		//		Если ДопСкидкаОпт = Неопределено Тогда ДопСкидкаОпт = 0; КонецЕсли;
		//		
		//		Скидка = Скидка+ДопСкидкаОпт;
		//		
		//	КонецЕсли;	
		//КонецЕсли;
		////нечаева 03,06,15---
		
		
	КонецЕсли;	
	
	
	
	
	//Если ЕстьРеквизитТабЧастиДокумента("Единица",ДокументОбъект.Метаданные(),ИмяТабличнойЧасти) Тогда
	//	Если СтрокаТабличнойЧасти.Единица.ОКЕИ.Код="796" Тогда //штучный товар
	//		Если СтрокаТабличнойЧасти.Количество<>Цел(СтрокаТабличнойЧасти.Количество) Тогда
	//			Сообщить("Для штучного товара:"""+СтрокаТабличнойЧасти.Номенклатура+""" указано дробное количество !!! Количество изменено !!!",СтатусСообщения.Важное);
	//			СтрокаТабличнойЧасти.Количество=Цел(СтрокаТабличнойЧасти.Количество);		
	//		КонецЕсли;		
	//	КонецЕсли;
	//КонецЕсли; 
	
	
	// Кухарь А.Ю.  12.03.2026 начало
	// Если ЕстьРеквизитТабЧастиДокумента("Объем",МетаданныеДокумента,ИмяТабличнойЧасти) Тогда   
	Если ЕстьРеквизитТабЧастиДокумента("Объем",МетаданныеДокумента,ИмяТабличнойЧасти) и не ОтключитьРасчетЛогистическихРеквизитов Тогда   
		// Кухарь А.Ю.  12.03.2026 конец
		
		// Кухарь А.Ю. 17.01.2020 начало
		// Будем получать сразу все лог. реквизиты + исправление некорректного объёма, иногда он заполнен в элементе
		//ОбъемКоробки=ПолучитьРеквизитРодителя(СтрокаТЧ.Номенклатура,"ОбъемКоробки");
		//ШтукВКоробке=ПолучитьРеквизитРодителя(СтрокаТЧ.Номенклатура,"ШтукВКоробке");		 
		ЛогистическиеРеквизитыНоменклатуры=ПолучитьЛогистическиеРеквизитыНоменклатуры(СтрокаТЧ.Номенклатура);
		ОбъемКоробки=ЛогистическиеРеквизитыНоменклатуры.ОбъемКоробки;
		ШтукВКоробке=ЛогистическиеРеквизитыНоменклатуры.Родитель_ШтукВКоробке;;
		// Кухарь А.Ю. 17.01.2020 конец
		
		
		Если ШтукВКоробке<>Неопределено И ШтукВКоробке<>Null Тогда
			//крохин начало
			ОбъемСтроки = ?(ШтукВКоробке<>0,СтрокаТЧ.Количество * СтрокаТЧ.Коэффициент*ОбъемКоробки/ШтукВКоробке,0);
			//СтрокаТЧ.Объем	= ?(ШтукВКоробке<>0,СтрокаТЧ.Количество * СтрокаТЧ.Коэффициент*ОбъемКоробки/ШтукВКоробке,0);		
			СтрокаТЧ.Объем = ОбъемСтроки;
			Если ОбъемСтроки <> 0 И СтрокаТЧ.Объем = 0 Тогда
				СтрокаТЧ.Объем = 0.001;
			КонецЕсли;
			//крохин конец	
		КонецЕсли;		
	КонецЕсли;	
	
	Если НЕ ЕстьРеквизитТабЧастиДокумента("Всего",МетаданныеДокумента,ИмяТабличнойЧасти) Тогда Возврат КонецЕсли;
	
	Если СпособРасчета=Неопределено Тогда
		Если ЕстьРеквизитТабЧастиДокумента("ЦенаБезСкидки",МетаданныеДокумента,ИмяТабличнойЧасти) Тогда	
			СтрокаТЧ.ВсегоБезСкидки	= СтрокаТЧ.ЦенаБезСкидки*СтрокаТЧ.Количество;
			
			Если ВидДокумента="ЗаказПоставщику" И ДокументОбъект.РасчетСкидокОтСуммы И СтрокаТЧ.Количество<>0 Тогда				
				Цена			= СтрокаТЧ.ЦенаБезСкидки*(1-Скидка/100);				
			Иначе
				СтрокаТЧ.Цена	= СтрокаТЧ.ЦенаБезСкидки*(1-Скидка/100); //округление под разрядность реквизита "Цена" документа
				Цена			= СтрокаТЧ.Цена;
			КонецЕсли;
		Иначе
			Цена				= СтрокаТЧ.Цена;			
		КонецЕсли; 
		
		//крохин начало 27.02.2020
		//в чеке цена округляется до рублей в пользу покупателя
		Если  МетаданныеДокумента.Имя="Чек" Тогда
			Цена = Цел(Цена);	
		КонецЕсли;
		//крохин конец 27.02.2020
		
		//+HELP-2485 20250116 Михайловский
		//перемещения для продажи сотрудникам для чека в фр
		Если МетаданныеДокумента.Имя = "Перемещение" И ДокументОбъект.СкладПолучатель.Код = "STЕ-08" Тогда
			Цена = Цел(Цена);
		КонецЕсли;	
		//-HELP-2485 20250116 Михайловский
		
		СтрокаТЧ.Цена			= Цена;
		// Шворобей ВЮ 04.07.2022 ++
		Если ЕстьРеквизитТабЧастиДокумента("Сумма",ДокументОбъект.Метаданные(),ИмяТабличнойЧасти) Тогда
			СтрокаТЧ.Сумма 		= Цена * СтрокаТЧ.Количество;
		КонецЕсли;
		//Если ЕстьРеквизитТабЧастиДокумента("Всего",ДокументОбъект.Метаданные(),ИмяТабличнойЧасти) Тогда
		//	СтрокаТЧ.Всего 		= Цена * СтрокаТЧ.Количество;
		//КонецЕсли;
		// Шворобей ВЮ 04.07.2022 ++
		
		Если ЕстьРеквизитТабЧастиДокумента("СтавкаНДС",ДокументОбъект.Метаданные(),ИмяТабличнойЧасти) Тогда
			СтавкаНДС=ПроцентНДСпоСтавке(СтрокаТЧ.СтавкаНДС);
			//Катаев+ 19/05/14
			//СтрокаТЧ.НДС	=СтрокаТЧ.Сумма*СтавкаНДС/(1+СтавкаНДС);			
			//СтрокаТЧ.Всего	=СтрокаТЧ.Сумма;
			//СтрокаТЧ.Сумма  =СтрокаТЧ.Всего-СтрокаТЧ.НДС;
			//Катаев+ 28/05/14 В документах вместо контрагента может использоваться и корреспондент
			//Если ДокументОбъект.Контрагент.НДС_Сверху Тогда
			Если ЕстьРеквизитДокумента("Контрагент", МетаданныеДокумента) Тогда
				НДС_Сверху = ДокументОбъект.Контрагент.НДС_Сверху;
				//нечаева 26,02,15+
				контрагентТ = ДокументОбъект.контрагент;
				//нечаева 26,02,15+
			ИначеЕсли ЕстьРеквизитДокумента("Корреспондент", МетаданныеДокумента) Тогда
				//Катаев+ 30/05/14
				//Катаев+ 16/10/14 ошибочно стояли кавычки
				//Если ТипЗнч("ДокументОбъект.Корреспондент") = тип("СправочникСсылка.Контрагенты") Тогда
				Если ТипЗнч(ДокументОбъект.Корреспондент) = тип("СправочникСсылка.Контрагенты") Тогда
					//Катаев- 16/10/14
					НДС_Сверху = ДокументОбъект.Корреспондент.НДС_Сверху;
					//нечаева 26,02,15+
					контрагентТ = ДокументОбъект.корреспондент;
					//нечаева 26,02,15+
				Иначе
					НДС_Сверху = Ложь;
					//нечаева 26,02,15+
					контрагентТ = неопределено;
					//нечаева 26,02,15+
					
				КонецЕсли;
				//Катаев- 30/05/14
			Иначе
				НДС_Сверху = Ложь;
				//нечаева 26,02,15+
				контрагентТ = неопределено;
				//нечаева 26,02,15+
			КонецЕсли;
			Если НДС_Сверху Тогда
				//крохин начало 31.10.2014
				//нечаева 20,11,2014 +++ поставила округление сумм до 2 зн.
				//26,02,15 ++ Нечаева
				Если ДокументОбъект.Метаданные().Имя = "КорректировкаЦенВНакладной" Тогда
					
					//26,02,15 -- Нечаева
					//считаем до изменения
					//Если ДокументОбъект.ДокОснование.Дата >= '20141010' Тогда
					Если (ДокументОбъект.ДокОснование.Дата >= '20141010' и контрагентТ.код = "SSP-3674") //перекресток
						//крохин начало 11.05.2016
						или (ДокументОбъект.ДокОснование.Дата >= '20160511' и (контрагентТ.код ="SSP-3286" ИЛИ контрагентТ.код ="SSR-1151" ИЛИ контрагентТ.код ="SSP-2697" ИЛИ контрагентТ.код ="SSR-6003" ИЛИ контрагентТ.код ="SSR-6004" )) //ООО Сладкая жизнь НН, ООО «Копейка Москва, ООО «Агроторг» , СПАР РИТЕЙЛ и СПАР Владимир
						//крохин конец 11.05.2016						
						//нечаева 03,03,15+++
						или (ДокументОбъект.ДокОснование.Дата >= '20150304' и контрагентТ.код ="SSP-5862" ) //окей
						//нечаева 03,03,15---
						//нечаева 16,03,15---
						или (ДокументОбъект.ДокОснование.Дата >= '20150312' и контрагентТ.код ="CHF-0006" ) //МОЛЛ ООО
						//нечаева 16,03,15---
						//нечаева 03,11,16++
						или (ДокументОбъект.ДокОснование.Дата >= '20160311' и контрагентТ.код ="SSR-6786" ) //ООО ИКС пять
						//нечаева 03,11,16---
						//нечаева 28,02,11++                          с 01,03,2017
						или (ДокументОбъект.ДокОснование.Дата >= '20170103' и контрагентТ.код ="SSR-4726" ) //ООО виктория балтия
						//нечаева 280217---
						//крохин начало 11.08.2017
						или (ДокументОбъект.ДокОснование.Дата >= '20170812' и контрагентТ.код ="SSP-3687" ) //Мегамарт АО Дикси Юг
						//крохин конец 11.08.2017
						
						//нечаева начало 25,10,17++
						или (ДокументОбъект.ДокОснование.Дата >= '20171017' и контрагентТ.код ="SSR-7215" ) //экспресс ритейл
						//нечаева конец 25,10,17--
						
						//крохин начало 21.05.2018
						или (ДокументОбъект.ДокОснование.Дата >= '20180521' и контрагентТ.код ="SSR-4185" ) //продмир
						//крохин конец 21.05.2018
						
						//нечаева 19,08,21 +++
						или (ДокументОбъект.ДокОснование.Дата >= '20210819' и контрагентТ.код ="SSP-3088" ) //агроаспект
						//нечаева 19,08,21 ---				
						
						
						Тогда
						ЦенаДоИзменения = СтрокаТЧ.ЦенаИсх;
						ЦенаДоИзменения = Окр(ЦенаДоИзменения/(1+СтавкаНДС),2);
						СуммаДоИзменения= Окр(ЦенаДоИзменения * СтрокаТЧ.Количество,2);
						НДСДоИзменения	= Окр(СуммаДоИзменения*СтавкаНДС,2);
						ВсегоДоИзменения	= Окр(СуммаДоИзменения + НДСДоИзменения,2);
					Иначе
						
						
						ВсегоДоИзменения  =  СтрокаТЧ.ЦенаИсх * СтрокаТЧ.Количество;
						СуммаДоИзменения  =  Окр(ВсегоДоИзменения/(1+СтавкаНДС),2);
						НДСДоИзменения    =  ВсегоДоИзменения - СуммаДоИзменения;
					КонецЕсли;
					
					//считаем после изменения
					// нечаева  12,01,15 +++ поменяла на 4 знака
					//крохин начало 10.04.2017
					//4 знака нужны не всем, для МОЛЛ ООО только 2
					Если контрагентТ.код ="CHF-0006" Тогда
						ЦенаПослеИзменения = СтрокаТЧ.ЦенаФакт;
						ЦенаПослеИзменения = Окр(ЦенаПослеИзменения/(1+СтавкаНДС),2);
						СуммаПослеИзменения= Окр(ЦенаПослеИзменения * СтрокаТЧ.Количество,2);
						НДСПослеИзменения	= Окр(СуммаПослеИзменения*СтавкаНДС,2);
						ВсегоПослеИзменения	= Окр(СуммаПослеИзменения + НДСПослеИзменения,2);
					Иначе
						ЦенаПослеИзменения = СтрокаТЧ.ЦенаФакт;
						ЦенаПослеИзменения = Окр(ЦенаПослеИзменения/(1+СтавкаНДС),4);
						СуммаПослеИзменения= Окр(ЦенаПослеИзменения * СтрокаТЧ.Количество,4);
						НДСПослеИзменения	= Окр(СуммаПослеИзменения*СтавкаНДС,4);
						ВсегоПослеИзменения	= Окр(СуммаПослеИзменения + НДСПослеИзменения,4);
						
					КонецЕсли;
					//крохин конец 10.04.2017
					// нечаева  12,01,15--- поменяла на 4 знака
					//нечаева 20,11,2014----- поставила округление сумм до 2 зн.
					//вычитаем
					СтрокаТЧ.Сумма	= СуммаДоИзменения - СуммаПослеИзменения;
					СтрокаТЧ.НДС	= НДСДоИзменения - НДСПослеИзменения;
					СтрокаТЧ.Всего	= ВсегоДоИзменения - ВсегоПослеИзменения;
					Если ЕстьРеквизитТабЧастиДокумента("ЦенаБезСкидки",МетаданныеДокумента,ИмяТабличнойЧасти) Тогда						
						СтрокаТЧ.ВсегоБезСкидки	= 100*СтрокаТЧ.Всего/(1 - Скидка);//СтрокаТЧ.ВсегоБезСкидки*(1-Скидка/100);
						
					КонецЕсли;
					// нечаева  12,01,15 +++
					Если Скидка=0 тогда
						СтрокаТЧ.ВсегоБезСкидки	= СтрокаТЧ.Всего;
					Конецесли;	
					// нечаева  12,01,15 ---	
					
				Иначе
					//крохин конец 31.10.2014
					//Катаев- 28/05/14
					Цена = Окр(Цена/(1+СтавкаНДС),2);
					СтрокаТЧ.Сумма	= Цена * СтрокаТЧ.Количество;
					СтрокаТЧ.НДС	= СтрокаТЧ.Сумма*СтавкаНДС;
					СтрокаТЧ.Всего	= СтрокаТЧ.Сумма + СтрокаТЧ.НДС;
					//Катаев+ 18/09/14
					//ЦенаБезСкидки = Окр(СтрокаТЧ.ЦенаБезСкидки/(1+СтавкаНДС),2);
					//СтрокаТЧ.ВсегоБезСкидки	= ЦенаБезСкидки*СтрокаТЧ.Количество*(1+СтавкаНДС);
					Если ЕстьРеквизитТабЧастиДокумента("ЦенаБезСкидки",МетаданныеДокумента,ИмяТабличнойЧасти) Тогда	
						ЦенаБезСкидки = Окр(СтрокаТЧ.ЦенаБезСкидки/(1+СтавкаНДС),2);
						СтрокаТЧ.ВсегоБезСкидки	= ЦенаБезСкидки*СтрокаТЧ.Количество*(1+СтавкаНДС);
					КонецЕсли;
					//Катаев- 18/09/14
					//крохин начало 31.10.2014
				КонецЕсли;
				//крохин конец 31.10.2014
				
			Иначе	
				СтрокаТЧ.НДС	=СтрокаТЧ.Сумма*СтавкаНДС/(1+СтавкаНДС);			
				СтрокаТЧ.Всего	=СтрокаТЧ.Сумма;
				СтрокаТЧ.Сумма  =СтрокаТЧ.Всего-СтрокаТЧ.НДС;
			КонецЕсли;
			
			//Катаев- 19/05/14
		КонецЕсли;	
		// +++ 2011-11-21 сезонные бонусы
		Если (МетаданныеДокумента.Имя = "РасходнаяНакладная") 
			И ЕстьРеквизитТабЧастиДокумента("ЦенаБезБонуса", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
			СтрокаТЧ.ЦенаБезБонуса	= СтрокаТЧ.Цена;
			//Катаев+ 19/05/14
			//СтрокаТЧ.ВсегоБезБонуса = СтрокаТЧ.ЦенаБезБонуса * СтрокаТЧ.Количество;
			Если ДокументОбъект.Контрагент.НДС_Сверху Тогда
				СтрокаТЧ.ВсегоБезБонуса = СтрокаТЧ.Всего;
			Иначе
				СтрокаТЧ.ВсегоБезБонуса = СтрокаТЧ.ЦенаБезБонуса * СтрокаТЧ.Количество;
			КонецЕсли;
			//Катаев- 19/05/14
		КонецЕсли;
		// 2011-11-21 сезонные бонусы +++
		//Катаев+ 04/09/14 Расчет цен для инвойса
		Если (МетаданныеДокумента.Имя = "ЗаказПоставщику") Тогда
			СтрокаТЧ.ЦенаДляИнвойса	= СтрокаТЧ.Цена * (1 + ДокументОбъект.НаценкаДляИнвойса/100);
			СтрокаТЧ.СуммаДляИнвойса = СтрокаТЧ.ЦенаДляИнвойса * СтрокаТЧ.Количество;
		КонецЕсли;
		//Катаев- 04/09/14
	ИначеЕсли СпособРасчета="ОтВсего" Тогда		
		СтрокаТЧ.Сумма 				= СтрокаТЧ.Всего;
		
		Если ЕстьРеквизитТабЧастиДокумента("СтавкаНДС",ДокументОбъект.Метаданные(),ИмяТабличнойЧасти) Тогда
			СтавкаНДС=ПроцентНДСпоСтавке(СтрокаТЧ.СтавкаНДС);
			
			СтрокаТЧ.НДС	=СтрокаТЧ.Всего*СтавкаНДС/(1+СтавкаНДС);			
			СтрокаТЧ.Всего	=СтрокаТЧ.Сумма;
			СтрокаТЧ.Сумма  =СтрокаТЧ.Всего-СтрокаТЧ.НДС;
		КонецЕсли;
		
		СтрокаТЧ.Цена	=?(СтрокаТЧ.Количество=0,0,СтрокаТЧ.Всего/СтрокаТЧ.Количество);
		//Катаев+ 18/09/14
		//СтрокаТЧ.ЦенаБезСкидки	=СтрокаТЧ.Цена/(1-Скидка/100);
		//СтрокаТЧ.ВсегоБезСкидки =СтрокаТЧ.ЦенаБезСкидки*СтрокаТЧ.Количество;
		Если ЕстьРеквизитТабЧастиДокумента("ЦенаБезСкидки",МетаданныеДокумента,ИмяТабличнойЧасти) Тогда
			СтрокаТЧ.ЦенаБезСкидки	=СтрокаТЧ.Цена/(1-Скидка/100);
			СтрокаТЧ.ВсегоБезСкидки =СтрокаТЧ.ЦенаБезСкидки*СтрокаТЧ.Количество;
		КонецЕсли;
		//Катаев- 18/09/14
	Иначе
		Сообщить("Не правильно задан способ расчета сумм в ТЧ !",СтатусСообщения.Важное);
	КонецЕсли;
	//крохин начало 27.10.2017
	//Для ТС Метрополис необходимо перераспределять копейки НДС как при свертке по моделям
	//крохин начало 26.12.2017
	//КЦН тоже, и дата поменялась
	//Если (МетаданныеДокумента.Имя = "РасходнаяНакладная") И  ДокументОбъект.контрагент.НДС_поМоделям И ДокументОбъект.Дата >= '20171001' Тогда
	//крохин начало 24.01.2019
	//в ПРМ "корреспондент = склад"
	//Если ((МетаданныеДокумента.Имя = "РасходнаяНакладная" И  ДокументОбъект.контрагент.НДС_поМоделям) ИЛИ (МетаданныеДокумента.Имя = "КорректировкаЦенВНакладной" И  ДокументОбъект.Корреспондент.НДС_поМоделям)) И ДокументОбъект.Дата >= '20170701' Тогда
	Если ((МетаданныеДокумента.Имя = "РасходнаяНакладная" И  ДокументОбъект.контрагент.НДС_поМоделям) ИЛИ (МетаданныеДокумента.Имя = "КорректировкаЦенВНакладной" И  (ДокументОбъект.Корреспондент.Метаданные().Имя = "Контрагенты" И ДокументОбъект.Корреспондент.НДС_поМоделям))) И ДокументОбъект.Дата >= '20170701' Тогда
		//крохин конец 24.01.2019
		//крохин конец 26.12.2017	
		ТаблицаСтрок = Новый ТаблицаЗначений;
		ТаблицаСтрок.Колонки.Добавить("СтрокаТабличнойЧастиТовары");
		ТаблицаСтрок.Колонки.Добавить("Всего");
		ВсегоПоМодели = 0;
		ВсегоНДСПоМодели = 0;
		Для Каждого ТекСтрокаТЧ Из ДокументОбъект.Товары Цикл
			//Нечаева 14,03,18++
			Если ТекСтрокаТЧ.Количество = 0 Тогда 
				продолжить;
			КонецЕсли;  
			//Нечаева 14,03,18--
			Если ТекСтрокаТЧ.номенклатура.Родитель = СтрокаТЧ.номенклатура.Родитель Тогда
				НоваяСтрокаТаблицыСтрок = ТаблицаСтрок.Добавить();
				НоваяСтрокаТаблицыСтрок.СтрокаТабличнойЧастиТовары = ТекСтрокаТЧ;
				ВсегоПоМодели = ВсегоПоМодели + ТекСтрокаТЧ.Всего;
				ВсегоНДСПоМодели = ВсегоНДСПоМодели + ТекСтрокаТЧ.НДС;
			КонецЕсли;
		КонецЦикла;
		СтавкаНДС=ПроцентНДСпоСтавке(СтрокаТЧ.СтавкаНДС);
		РассчетныйНДС	=Окр(ВсегоПоМодели*СтавкаНДС/(1+СтавкаНДС),2);
		Поправка = РассчетныйНДС - ВсегоНДСПоМодели;
		Для Каждого ТекСтрокаТаблицыСтрок Из ТаблицаСтрок Цикл
			//Нечаева 14,03,18++
			Если ТекСтрокаТаблицыСтрок.СтрокаТабличнойЧастиТовары.Количество = 0 Тогда 
				продолжить;
			КонецЕсли; 
			//Нечаева 14,03,18--
			Если Поправка > 0 Тогда
				ТекСтрокаТаблицыСтрок.СтрокаТабличнойЧастиТовары.НДС = ТекСтрокаТаблицыСтрок.СтрокаТабличнойЧастиТовары.НДС + 0.01;
				Поправка = поправка - 0.01;
			иначеесли поправка < 0 тогда
				ТекСтрокаТаблицыСтрок.СтрокаТабличнойЧастиТовары.НДС = ТекСтрокаТаблицыСтрок.СтрокаТабличнойЧастиТовары.НДС - 0.01;
				Поправка = поправка + 0.01;
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли; 
	//крохин конец 27.10.2017
	
	//нечаева 16,04,18+++
	// для отгрузки экспозиторов для Тандера, распределяем копейки в разнице между развернутым экспозитором и ценой на свернутый.
	//нечаева 30,01,19++ и для х5 тоже суммы приводим по копейкам  
	//крохин начало 11.09.2023
	//ещё виктория балтия. Надо переделать на галку в контрагенте
	//Если ((МетаданныеДокумента.Имя = "РасходнаяНакладная" и (ДокументОбъект.контрагент.код = "SSP-3881" или ДокументОбъект.контрагент.родитель.код = "SSR-4117" ) )) И ДокументОбъект.Дата >= '20180401' Тогда
	
	// Кельманов А.В. - ASU-826 - 2024.12.09 {
	//Если ((МетаданныеДокумента.Имя = "РасходнаяНакладная" и (ДокументОбъект.контрагент.код = "SSP-3881" или ДокументОбъект.контрагент.родитель.код = "SSR-4117" ИЛИ ДокументОбъект.контрагент.код = "SSR-4726") )) И ДокументОбъект.Дата >= '20180401' Тогда
	Если МетаданныеДокумента.Имя = "РасходнаяНакладная" И ДокументОбъект.Контрагент.ПодгонятьКопейкиПриСверткеЭкспозитора И ДокументОбъект.Дата >= '20180401' Тогда
	// Кельманов А.В. - ASU-826 - 2024.12.09 }
		
	//крохин конец 11.09.2023
	
		Экспозитор = ложь;
		
		запрос=новый Запрос;
		запрос.Текст="ВЫБРАТЬ
		|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита как Экспозитор
		|ИЗ
		|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
		|ГДЕ
		|	РеквизитыРНКПНКПРМ.Документ = &Документ
		|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = ""Экспозитор"""; 
		запрос.УстановитьПараметр("Документ",ДокументОбъект.ссылка);
		результат=запрос.Выполнить().Выбрать();
		если результат.Количество()>0 тогда
			Результат.Следующий();
			
			ТТТ = ПолучитьСуммыТандерЭкспозиторы(ДокументОбъект,Результат.Экспозитор);
			// Сравним Итоговые Суммы и приведем
			Если ТТТ.итог("Всего")<>ДокументОбъект.Товары.Итог("Всего") Тогда
				//Нужны корректировки НДС и Всего
				Экспозитор = Истина;
				
			КонецЕсли;	
		КонецЕсли;
		
		Если Экспозитор Тогда
			Поправили = ПоправкаСуммТандер(ДокументОбъект,ТТТ);
		КонецЕсли;
		
	КонецЕсли;
	// нечаева 16,04,18----
	
	//крохин начало 05.05.2020
	//комиссионная торговля
	Если МетаданныеДокумента.Имя = "ОтчетКомиссионера" Тогда
		//крохин начало 16.08.2020
		//оплата равна сумме проводок по взаиморасчетам. Рассчитывается исходя из настроек контрагента
		//// Кухарь А.Ю. 25.06.2020 начало
		//// СтрокаТЧ.Оплата = СтрокаТЧ.Всего - СтрокаТЧ.ТранспортныеРасходы - СтрокаТЧ.КомиссионныеРасходы - СтрокаТЧ.ПрочиеРасходы;
		//СтрокаТЧ.Оплата = СтрокаТЧ.Всего - СтрокаТЧ.ТранспортныеРасходы - СтрокаТЧ.КомиссионныеРасходы - СтрокаТЧ.ПрочиеРасходы
		//-СтрокаТЧ.СкладскаяОбработка-СтрокаТЧ.ПлатноеХранение-СтрокаТЧ.АгентскоеВознаграждение; 	
		//// Кухарь А.Ю. 25.06.2020 конец
		СтрокаТЧ.Оплата = СтрокаТЧ.Всего;
		
		УчитыватьКомиссионныеРасходы = ДокументОбъект.УчитыватьКомиссионныеРасходы; 	
		
		Если УчитыватьКомиссионныеРасходы = Перечисления.СпособыУчетаРасходовКомиссионера.УПДкОтчетуКомиссионера ИЛИ УчитыватьКомиссионныеРасходы = Перечисления.СпособыУчетаРасходовКомиссионера.УПДотсутствует Тогда
			СтрокаТЧ.Оплата = СтрокаТЧ.Оплата - СтрокаТЧ.КомиссионныеРасходы;
		КонецЕсли;
		
		УчитыватьТранспортныеРасходы = ДокументОбъект.УчитыватьТранспортныеРасходы;
		
		Если УчитыватьТранспортныеРасходы = Перечисления.СпособыУчетаРасходовКомиссионера.УПДкОтчетуКомиссионера ИЛИ УчитыватьТранспортныеРасходы = Перечисления.СпособыУчетаРасходовКомиссионера.УПДотсутствует Тогда
			СтрокаТЧ.Оплата = СтрокаТЧ.Оплата - СтрокаТЧ.ТранспортныеРасходы;
		КонецЕсли;
		
		УчитыватьПрочиеРасходы = ДокументОбъект.УчитыватьПрочиеРасходы;
		
		Если УчитыватьПрочиеРасходы = Перечисления.СпособыУчетаРасходовКомиссионера.УПДкОтчетуКомиссионера ИЛИ УчитыватьПрочиеРасходы = Перечисления.СпособыУчетаРасходовКомиссионера.УПДотсутствует Тогда
			СтрокаТЧ.Оплата = СтрокаТЧ.Оплата - СтрокаТЧ.ПрочиеРасходы;
		КонецЕсли;
		
		УчитыватьСкладскуюОбработку = ДокументОбъект.УчитыватьСкладскуюОбработку;
		
		Если УчитыватьСкладскуюОбработку = Перечисления.СпособыУчетаРасходовКомиссионера.УПДкОтчетуКомиссионера ИЛИ УчитыватьСкладскуюОбработку = Перечисления.СпособыУчетаРасходовКомиссионера.УПДотсутствует Тогда
			СтрокаТЧ.Оплата = СтрокаТЧ.Оплата - СтрокаТЧ.СкладскаяОбработка;
		КонецЕсли;
		
		УчитыватьПлатноеХранение = ДокументОбъект.УчитыватьПлатноеХранение;
		
		Если УчитыватьПлатноеХранение = Перечисления.СпособыУчетаРасходовКомиссионера.УПДкОтчетуКомиссионера ИЛИ УчитыватьПлатноеХранение = Перечисления.СпособыУчетаРасходовКомиссионера.УПДотсутствует Тогда
			СтрокаТЧ.Оплата = СтрокаТЧ.Оплата - СтрокаТЧ.ПлатноеХранение;
		КонецЕсли;
		
		УчитыватьАгентскоеВознаграждение = ДокументОбъект.УчитыватьАгентскоеВознаграждение;
		
		Если УчитыватьАгентскоеВознаграждение = Перечисления.СпособыУчетаРасходовКомиссионера.УПДкОтчетуКомиссионера ИЛИ УчитыватьАгентскоеВознаграждение = Перечисления.СпособыУчетаРасходовКомиссионера.УПДотсутствует Тогда
			СтрокаТЧ.Оплата = СтрокаТЧ.Оплата - СтрокаТЧ.АгентскоеВознаграждение;
		КонецЕсли;	
		
		//крохин конец 16.08.2020
		
		//крохин начало 20.12.2021	
		//// Кухарь А.Ю. 27.10.2021 начало
		////
		//СтрокаТЧ.ВсегоБезБонусов=Макс(0,СтрокаТЧ.Всего-СтрокаТЧ.СуммаОплатыБонусами); 
		//// Кухарь А.Ю. 27.10.2021 конец
		СтрокаТЧ.ВсегоБезБонусов=СтрокаТЧ.Всего-СтрокаТЧ.СуммаОплатыБонусами;
		//крохин конец 20.12.2021
		
		//крохин начало 26.11.2021
		//НДС с бонусов
		Если СтрокаТЧ.ВсегоБезБонусов <> 0 Тогда
			Если СтрокаТЧ.Всего <> 0 Тогда
				СтрокаТЧ.НДС = СтрокаТЧ.НДС*СтрокаТЧ.ВсегоБезБонусов/СтрокаТЧ.Всего;
				СтрокаТЧ.Сумма = СтрокаТЧ.Всего - СтрокаТЧ.НДС;
			Иначе
				СтрокаТЧ.НДС = 0;
				СтрокаТЧ.Сумма = СтрокаТЧ.Всего - СтрокаТЧ.НДС;
			КонецЕсли;
		КонецЕсли;
		//крохин конец 26.11.2021
		
		
	КонецЕсли;
	
	//крохин конец 05.05.2020
	
	
	// Кухарь А.Ю. 26.04.2022 начало
	// Пока что только РНК
	//крохин начало 02.12.2024 - вернуть как было после раскомплектации.  
	//Если  ЕстьРеквизитТабЧастиДокумента("КоличествоКомплектующих",МетаданныеДокумента,ИмяТабличнойЧасти) Тогда 
	Если ЕстьРеквизитТабЧастиДокумента("КоличествоКомплектующих",МетаданныеДокумента,ИмяТабличнойЧасти) И (МетаданныеДокумента.Имя <> "Комплектация" ИЛИ ДокументОбъект.Дата >= '20260701')Тогда 
	//крохин конец 02.12.2024	
		ЗаполнитьКоличествоКомплектующихПоСтроке(СтрокаТЧ);
	КонецЕсли;
	// Кухарь А.Ю. 26.04.2022 конец

	// Кухарь А.Ю. 26.04.2022 конец
	
	Если МетаданныеДокумента.Имя = "ЗаказПоставщику" Тогда
		Если ЗначениеЗаполнено(ДокументОбъект.КонтрагентКомпенсация) И ЗначениеЗаполнено(ДокументОбъект.ДоговорКомпенсация) И 
			ЗначениеЗаполнено(ДокументОбъект.ТипЦенКомпенсация) Тогда
			Если СтрокаТЧ.ЦенаКомпенсации>0 Тогда
				СтрокаТЧ.ЦенаСКомпенсацией=СтрокаТЧ.Цена;
				СтрокаТЧ.ВсегоСКомпенсацией=СтрокаТЧ.Всего;
				СтрокаТЧ.Компенсация=Окр(СтрокаТЧ.ЦенаКомпенсации*СтрокаТЧ.Количество,2);
			Иначе
				СтрокаТЧ.ВсегоСКомпенсацией=СтрокаТЧ.Всего;	
				СтрокаТЧ.Компенсация=0;	
				СтрокаТЧ.ЦенаСКомпенсацией=СтрокаТЧ.цена;
			КонецЕсли;		
			СтрокаТЧ.Цена= СтрокаТЧ.Цена-СтрокаТЧ.ЦенаКомпенсации;
			СтрокаТЧ.Всего= СтрокаТЧ.Цена*СтрокаТЧ.Количество;	

		Иначе
			СтрокаТЧ.ВсегоСКомпенсацией=0;	
			СтрокаТЧ.Компенсация=0;	
			СтрокаТЧ.ЦенаСКомпенсацией=0;
			СтрокаТЧ.ЦенаКомпенсации=0;	
		КонецЕсли;
	КонецЕсли;
	
    //// Крохин  16.12.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1637
	//заполнение компенсации в СПП, если поменяли Количество или ЦенаКомпенсаци
	Если МетаданныеДокумента.Имя = "СписаниеТМЦСпути" Тогда
		Если ЗначениеЗаполнено(ДокументОбъект.КонтрагентКомпенсация) И ЗначениеЗаполнено(ДокументОбъект.ДоговорКомпенсация) И 
			ЗначениеЗаполнено(ДокументОбъект.ТипЦенКомпенсация) Тогда			
			СтрокаТЧ.Компенсация = Окр(СтрокаТЧ.ЦенаКомпенсации * СтрокаТЧ.Количество,2);
			СтрокаТЧ.ВсегоСКомпенсацией = СтрокаТЧ.СуммаПоставщика+СтрокаТЧ.Компенсация;			
		КонецЕсли;
	КонецЕсли;
	//// Крохин  16.12.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1637

	// Кухарь А.Ю. 27.10.2025 начало 
	//HELP-7589
	Если МетаданныеДокумента.Имя = "КонтрактСПроизводителем" и СтрокаТЧ.Цена>0 и ТипЗнч(ДопПараметры) = Тип("Структура")  Тогда
		если ДопПараметры.Свойство("ВыделятьЦенуУпаковки") и ДопПараметры.Свойство("ТипЦеныУпаковки") тогда
			ЦенаУпаковки=ПолучитьЦенуНоменклатуры(СтрокаТЧ.Номенклатура,СтрокаТЧ.Единица,ДопПараметры.ТипЦеныУпаковки,ДокументОбъект.Валюта,ДокументОбъект.Курс,ДокументОбъект.Дата);
			если ЦенаУпаковки >= СтрокаТЧ.Цена тогда  
				СтрокаТЧ.ЦенаБезУпаковки = СтрокаТЧ.Цена;  
				СтрокаТЧ.ЦенаУпаковки = 0;    
				СообщитьИзМодуля(СтрШаблон("Цена упаковки по %1 - больше или равна общей цене, это некорректно. Цена упаковки обнулена.",СтрокаТЧ.Номенклатура));
			иначе
				СтрокаТЧ.ЦенаБезУпаковки = СтрокаТЧ.Цена - ЦенаУпаковки;
				СтрокаТЧ.ЦенаУпаковки = ЦенаУпаковки;				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// Кухарь А.Ю. 27.10.2025 конец
	
КонецПроцедуры // РассчитатьСуммуТабЧасти()

//Катаев+ 04/09/14
Процедура РассчитатьСуммуИнвойсаТабЧасти(тз, ДокументОбъект) Экспорт
	//Катаев+ 07/11/14 Обработка переделана на использовании цен из регистра партии
	//МетаданныеДокумента = ДокументОбъект.Метаданные();
	//ВидДокумента= МетаданныеДокумента.Имя;
	//тзМодель = Новый таблицаЗначений;
	//тзМодель.Колонки.Добавить("Модель");
	//тзМодель.Колонки.Добавить("Цена");
	//Для Каждого стр из тз Цикл
	//	НайденнаяСтрока = тзМодель.Найти(стр.Номенклатура.Родитель, "Модель");
	//	Если НайденнаяСтрока = Неопределено Тогда
	//		стрМодель = тзМодель.Добавить();
	//		стрМодель.Модель = стр.Номенклатура.Родитель;
	//		стрМодель.Цена = стр.Цена;
	//	Иначе
	//		Если НайденнаяСтрока.Цена < стр.Цена Тогда
	//			НайденнаяСтрока.Цена = стр.Цена
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	//Для Каждого стр из тз Цикл
	//	НайденнаяСтрока = тзМодель.Найти(стр.Номенклатура.Родитель, "Модель");
	//	Если ВидДокумента = "ЗаказПоставщику" Тогда
	//		НаценкаДляИнвойса = ДокументОбъект.НаценкаДляИнвойса;
	//	Иначе
	//		НаценкаДляИнвойса = стр.ДокОбъект.НаценкаДляИнвойса;
	//	КонецЕсли;
	//	стр.ЦенаДляИнвойса = Окр(НайденнаяСтрока.Цена * (1 + НаценкаДляИнвойса/100),2);
	//	стр.СуммаДляИнвойса = стр.ЦенаДляИнвойса * стр.Количество;
	//КонецЦикла;
	//Если ВидДокумента = "ЗаказПоставщику" Тогда
	//	ДокументОбъект.Товары.Загрузить(тз);
	//Иначе
	//	//Определяем ЗПС которые будут правиться и в каждый ЗПС загружаем только часть данных из тз
	//	Для Каждого Заказы из ДокументОбъект.Заказы Цикл
	//		ЗПС = Заказы.Заказ;
	//		Запрос = Новый Запрос;
	//		Запрос.Текст=
	//		"ВЫБРАТЬ
	//		|	ТЗ.Номенклатура,
	//		|	ТЗ.Количество,
	//		|	ТЗ.Единица,
	//		|	ТЗ.Коэффициент,
	//		|	ТЗ.ЦенаБезСкидки,
	//		|	ТЗ.Цена,
	//		|	ТЗ.Сумма,
	//		|	ТЗ.Объем,
	//		|	ТЗ.СтавкаНДС,
	//		|	ТЗ.НДС,
	//		|	ТЗ.Всего,
	//		|	ТЗ.ВсегоБезСкидки,
	//		|	ТЗ.Заявка,
	//		|	ТЗ.ПодтвержденнаяЗаявка,
	//		|	ТЗ.ДопРасходыПоМашине,
	//		|	ТЗ.Скидка1,
	//		|	ТЗ.Скидка2,
	//		|	ТЗ.Скидка3,
	//		|	ТЗ.Скидка4,
	//		|	ТЗ.Скидка5,
	//		|	ТЗ.ДопРасходыПоИнвойсу,
	//		|	ТЗ.ПроцентДопРасходовМашины,
	//		|	ТЗ.РасчетнаяЦена,
	//		|	ТЗ.РасчетнаяСумма,
	//		|	ТЗ.ЗаявкаПоставщику,
	//		|	ТЗ.ЦенаДляИнвойса,
	//		|	ТЗ.СуммаДляИнвойса
	//		|ПОМЕСТИТЬ тзЗПС
	//		|ИЗ
	//		|	&ТЗ КАК ТЗ
	//		|ГДЕ
	//		|	ТЗ.ДокОбъект = &ЗПС
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|ВЫБРАТЬ
	//		|	тзЗПС.Номенклатура,
	//		|	тзЗПС.Количество,
	//		|	тзЗПС.Единица,
	//		|	тзЗПС.Коэффициент,
	//		|	тзЗПС.ЦенаБезСкидки,
	//		|	тзЗПС.Цена,
	//		|	тзЗПС.Сумма,
	//		|	тзЗПС.Объем,
	//		|	тзЗПС.СтавкаНДС,
	//		|	тзЗПС.НДС,
	//		|	тзЗПС.Всего,
	//		|	тзЗПС.ВсегоБезСкидки,
	//		|	тзЗПС.Заявка,
	//		|	тзЗПС.ПодтвержденнаяЗаявка,
	//		|	тзЗПС.ДопРасходыПоМашине,
	//		|	тзЗПС.Скидка1,
	//		|	тзЗПС.Скидка2,
	//		|	тзЗПС.Скидка3,
	//		|	тзЗПС.Скидка4,
	//		|	тзЗПС.Скидка5,
	//		|	тзЗПС.ДопРасходыПоИнвойсу,
	//		|	тзЗПС.ПроцентДопРасходовМашины,
	//		|	тзЗПС.РасчетнаяЦена,
	//		|	тзЗПС.РасчетнаяСумма,
	//		|	тзЗПС.ЗаявкаПоставщику,
	//		|	тзЗПС.ЦенаДляИнвойса,
	//		|	тзЗПС.СуммаДляИнвойса
	//		|ИЗ
	//		|	тзЗПС КАК тзЗПС";
	//		Запрос.УстановитьПараметр("ТЗ", тз);
	//		Запрос.УстановитьПараметр("ЗПС", ЗПС);
	//		тзЗПС = Запрос.Выполнить().Выгрузить();
	//		ДокОбъект = ЗПС.ПолучитьОбъект();
	//		ДокОбъект.Товары.Загрузить(тзЗПС);
	//		ДокОбъект.Записать();
	//	КонецЦикла;
	//КонецЕсли;
	//ДокументОбъект = Документы.ЗаказПоставщику.СоздатьДокумент();
	//Определяем цены по моделям исходя из регистра партий с учетом наценки
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(Партии.Сумма) КАК Сумма,
	|	СУММА(Партии.Количество) КАК Количество
	|ИЗ
	|	РегистрНакопления.Партии КАК Партии
	|ГДЕ
	|	Партии.Регистратор = &КП
	|	И Партии.Номенклатура = &Номенклатура";
	Если ТипЗнч(ДокументОбъект.ДокОснование) = Тип("ДокументОбъект.ЗаказПоставщику") Тогда
		Запрос.УстановитьПараметр("КП", ДокументОбъект.ДокОснование.ДокОснование);
	Иначе
		Запрос.УстановитьПараметр("КП", ДокументОбъект.ДокОснование);
	КонецЕсли;
	тзМодель = Новый таблицаЗначений;
	тзМодель.Колонки.Добавить("Модель");
	тзМодель.Колонки.Добавить("Цена");
	Для Каждого стр из ДокументОбъект.Товары Цикл
		Запрос.УстановитьПараметр("Номенклатура", стр.Номенклатура);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			расчЦена = Окр((1 + ДокументОбъект.НаценкаДляИнвойса/100)*Выборка.Сумма/Выборка.Количество,4);
		Иначе
			расчЦена = 0;
		КонецЕсли;
		НайденнаяСтрока = тзМодель.Найти(стр.Номенклатура.Родитель, "Модель");
		Если НайденнаяСтрока = Неопределено Тогда
			стрМодель = тзМодель.Добавить();
			стрМодель.Модель = стр.Номенклатура.Родитель;
			стрМодель.Цена = расчЦена;
		Иначе
			Если НайденнаяСтрока.Цена < расчЦена Тогда
				НайденнаяСтрока.Цена = расчЦена;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	//Для каждой номенклатуры проставляем цену для инвайса исходя из цены для модели
	Для Каждого стр из ДокументОбъект.Товары Цикл
		Модель = стр.Номенклатура.Родитель;
		НайденнаяСтрока = тзМодель.Найти(Модель, "Модель");
		стр.ЦенаДляИнвойса = НайденнаяСтрока.Цена;
		стр.СуммаДляИнвойса = стр.ЦенаДляИнвойса*стр.Количество;
	КонецЦикла;
	//Катаев- 07/11/14
КонецПроцедуры
//Катаев- 04/09/14

// Рассчитывает количество исходя из количества мест
//
// Параметры:
//  СтрокаТабличнойЧасти - строка табличной части документа,
//  ДокументОбъект       - объект редактируемого документа.
//
Процедура РассчитатьКоличествоТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект) Экспорт
	
	ИмяТабличнойЧасти   = ПолучитьИмяТабличнойЧастиПоСсылкеНаСтроку(СтрокаТабличнойЧасти);
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Если ЕстьРеквизитТабЧастиДокумента("ЕдиницаИзмеренияМест", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
		Если ЕстьРеквизитТабЧастиДокумента("Количество", МетаданныеДокумента, ИмяТабличнойЧасти)
			И ЕстьРеквизитТабЧастиДокумента("КоличествоМест", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
			
			
			Если ЗначениеНеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаИзмерения) Тогда
				СообщитьОбОшибке("Для "+СтрокаТабличнойЧасти.Номенклатура.Наименование+" не выбрана единица измерения!
				|Пересчет количества невозможен.");
			ИначеЕсли ЗначениеНеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаИзмеренияМест) Тогда
				Если СтрокаТабличнойЧасти.КоличествоМест = 0 Тогда 
					Возврат;
				КонецЕсли;
				
				СообщитьОбОшибке("Для "+СтрокаТабличнойЧасти.Номенклатура.Наименование+" не выбрана единица измерения мест!
				|Пересчет количества невозможен.");
			Иначе
				Если СтрокаТабличнойЧасти.Коэффициент = 0 Тогда
					СообщитьОбОшибке("Для "+СтрокаТабличнойЧасти.Номенклатура.Наименование+" у единицы измерения цены "
					+СтрокаТабличнойЧасти.ЕдиницаИзмерения.Наименование+" не проставлен коэффициент!
					|Пересчет количества невозможен.");
				ИначеЕсли СтрокаТабличнойЧасти.ЕдиницаИзмеренияМест.Коэффициент = 0 Тогда
					СообщитьОбОшибке("Для "+СтрокаТабличнойЧасти.Номенклатура.Наименование+" у единицы измерения мест "
					+СтрокаТабличнойЧасти.ЕдиницаИзмеренияМест.Наименование+" не проставлен коэффициент!
					|Пересчет количества невозможен.");
				Иначе
					Если СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.ЕдиницаИзмеренияМест Тогда
						СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.КоличествоМест;
					Иначе
						Количество = СтрокаТабличнойЧасти.КоличествоМест * СтрокаТабличнойЧасти.ЕдиницаИзмеренияМест.Коэффициент
						/ СтрокаТабличнойЧасти.Коэффициент;
						
						Если Цел(Количество) = Количество Тогда
							СтрокаТабличнойЧасти.Количество = Количество;
						Иначе
							СообщитьОбОшибке("Для "+СтрокаТабличнойЧасти.Номенклатура.Наименование
							+" у единицы измерения цены "+СтрокаТабличнойЧасти.ЕдиницаИзмеренияМест.Наименование+
							+" или мест "+СтрокаТабличнойЧасти.ЕдиницаИзмеренияМест.Наименование+
							+" не верно указан коэффициент!
							|Пересчет количества невозможен.");
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если ЕстьРеквизитТабЧастиДокумента("Количество", МетаданныеДокумента, ИмяТабличнойЧасти)
			И ЕстьРеквизитТабЧастиДокумента("КоличествоМест", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
			Если ЗначениеНеЗаполнено(СтрокаТабличнойЧасти.Номенклатура.ЕдиницаХраненияОстатков) Тогда
				СообщитьОбОшибке("Для "+СтрокаТабличнойЧасти.Номенклатура.Наименование+" не выбрана единица хранения остатков!
				|Пересчет количества невозможен.");
			ИначеЕсли СтрокаТабличнойЧасти.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент = 0 Тогда
				СообщитьОбОшибке("Для "+СтрокаТабличнойЧасти.Номенклатура.Наименование+" у единицы измерения "
				+СтрокаТабличнойЧасти.Номенклатура.ЕдиницаХраненияОстатков.Наименование+" не проставлен коэффициент!
				|Пересчет количества невозможен.");
			Иначе
				СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.КоличествоМест * СтрокаТабличнойЧасти.Коэффициент
				/ СтрокаТабличнойЧасти.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // РассчитатьКоличествоТабЧасти()

// Рассчитывает количество мест исходя из количества
//
// Параметры:
//  СтрокаТабличнойЧасти - строка табличной части документа,
//  ДокументОбъект       - объект редактируемого документа.
//
Процедура РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект) Экспорт
	
	ИмяТабличнойЧасти   = ПолучитьИмяТабличнойЧастиПоСсылкеНаСтроку(СтрокаТабличнойЧасти);
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Если ЕстьРеквизитТабЧастиДокумента("ЕдиницаИзмеренияМест", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
		Если ЕстьРеквизитТабЧастиДокумента("Количество", МетаданныеДокумента, ИмяТабличнойЧасти)
			И ЕстьРеквизитТабЧастиДокумента("КоличествоМест", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
			
			Если ЗначениеНеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаИзмерения) Тогда
				СообщитьОбОшибке("Для "+СтрокаТабличнойЧасти.Номенклатура.Наименование+" не выбрана единица измерения цены!
				|Пересчет количества невозможен.");
			ИначеЕсли ЗначениеНеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаИзмеренияМест) Тогда
				СтрокаТабличнойЧасти.КоличествоМест = 0;
			Иначе
				Если СтрокаТабличнойЧасти.Коэффициент = 0 Тогда
					СообщитьОбОшибке("Для "+СтрокаТабличнойЧасти.Номенклатура.Наименование+" у единицы измерения цены "
					+СтрокаТабличнойЧасти.ЕдиницаИзмерения.Наименование+" не проставлен коэффициент!
					|Пересчет количества невозможен.");
				ИначеЕсли СтрокаТабличнойЧасти.ЕдиницаИзмеренияМест.Коэффициент = 0 Тогда
					СообщитьОбОшибке("Для "+СтрокаТабличнойЧасти.Номенклатура.Наименование+" у единицы измерения мест "
					+СтрокаТабличнойЧасти.ЕдиницаИзмеренияМест.Наименование+" не проставлен коэффициент!
					|Пересчет количества невозможен.");
				Иначе
					Если СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.ЕдиницаИзмеренияМест Тогда
						СтрокаТабличнойЧасти.КоличествоМест = СтрокаТабличнойЧасти.Количество;
					Иначе
						КоличествоМест = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Коэффициент
						/ СтрокаТабличнойЧасти.ЕдиницаИзмеренияМест.Коэффициент;
						КоличествоМест = ?(Цел(КоличествоМест) = КоличествоМест, КоличествоМест, 0);
						
						СтрокаТабличнойЧасти.КоличествоМест = КоличествоМест;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если ЕстьРеквизитТабЧастиДокумента("КоличествоМест", МетаданныеДокумента, ИмяТабличнойЧасти)
			и СтрокаТабличнойЧасти.Коэффициент > 0 Тогда
			Если ЗначениеНеЗаполнено(СтрокаТабличнойЧасти.Номенклатура.ЕдиницаХраненияОстатков) Тогда
				СообщитьОбОшибке("Для "+СтрокаТабличнойЧасти.Номенклатура.Наименование+" не выбрана единица хранения остатков!
				|Пересчет количества невозможен.");
			ИначеЕсли СтрокаТабличнойЧасти.Коэффициент = 0 Тогда
				СообщитьОбОшибке("Не проставлен коэффициент!
				|Пересчет количества мест невозможен.");
			Иначе
				СтрокаТабличнойЧасти.КоличествоМест = СтрокаТабличнойЧасти.Количество 
				* СтрокаТабличнойЧасти.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
				/ СтрокаТабличнойЧасти.Коэффициент;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // РассчитатьКоличествоМестТабЧасти()

// Процедура выполняет проверку заполнения единицы измерения мест и количества мест
//
// Параметры:
//  ТабличнаяЧасть - табличная часть документа, в которой осуществляется проверка
//
Процедура ПриЗаписиПроверитьЕдиницуИзмеренияМест(ТабличнаяЧасть) Экспорт
	
	Для каждого СтрокаТабличнойЧасти Из ТабличнаяЧасть Цикл
		Если НЕ ЗначениеНеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаИзмеренияМест)
			И СтрокаТабличнойЧасти.КоличествоМест = 0 Тогда
			СтрокаТабличнойЧасти.ЕдиницаИзмеренияМест = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПриЗаписиПроверитьЕдиницуИзмеренияМест()

// Функция выполняет поиск первой, удовлетворяющей условию поика, строки табличной части.
//
// Параметры:
//  ТабличнаяЧасть - табличная часть документа, в которой осуществляется поиск,
//  СтруктураОтбора - структура - задает условие поиска.
//
// Возвращаемое значение: 
//  Строка табличной части - найденная строка табличной части,
//  Неопределено           - строка табличной части не найдена.
//
Функция НайтиСтрокуТабЧасти(ТабличнаяЧасть, СтруктураОтбора) Экспорт
	
	СтрокаТабличнойЧасти = Неопределено;
	МассивНайденныхСтрок = ТабличнаяЧасть.НайтиСтроки(СтруктураОтбора);
	Если МассивНайденныхСтрок.Количество() > 0 Тогда
		
		// Нашли. Вернем первую найденную строку.
		СтрокаТабличнойЧасти = МассивНайденныхСтрок[0];
	КонецЕсли;
	
	Возврат СтрокаТабличнойЧасти;
	
КонецФункции // НайтиСтрокуТабЧасти()

// Рассчитывает цену в строке табличной части документа
//
// Параметры:
//  СтрокаТабличнойЧасти - строка табличной части документа,
//  ДокументОбъект     - объект редактируемого документа.
//
Процедура РассчитатьЦенуТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект) Экспорт
	
	ИмяТабличнойЧасти = ПолучитьИмяТабличнойЧастиПоСсылкеНаСтроку(СтрокаТабличнойЧасти);
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	//Реквизит "ЦенаФакт"  для КЦН
	//нечаева 29,05,15++
	
	Если ДокументОБъект.метаданные().Имя = "КорректировкаЦенВНакладной" Тогда
		//	
		//		СтрокаТабличнойЧасти.ЦенаФакт = СтрокаТабличнойЧасти.Сумма / (1 - СтрокаТабличнойЧасти.ПроцентСкидкиНаценки / 100) / СтрокаТабличнойЧасти.Количество;
		
		СтрокаТабличнойЧасти.ЦенаФакт = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
		
	иначе
		Если ЕстьРеквизитТабЧастиДокумента("ПроцентСкидкиНаценки", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
			Если (ЕстьРеквизитТабЧастиДокумента("СкидкаПоСуммеДокумента", МетаданныеДокумента, ИмяТабличнойЧасти)
				И СтрокаТабличнойЧасти.СкидкаПоСуммеДокумента <> 0)
				Или (ЕстьРеквизитТабЧастиДокумента("СкидкаПоКоличествуТовара", МетаданныеДокумента, ИмяТабличнойЧасти)
				И СтрокаТабличнойЧасти.СкидкаПоКоличествуТовара <> 0)
				Или (ЕстьРеквизитТабЧастиДокумента("СкидкаПоВидуОплаты", МетаданныеДокумента, ИмяТабличнойЧасти)
				И СтрокаТабличнойЧасти.СкидкаПоВидуОплаты <> 0)
				Или (ЕстьРеквизитТабЧастиДокумента("СкидкаПоДисконтнойКарте", МетаданныеДокумента, ИмяТабличнойЧасти)
				И СтрокаТабличнойЧасти.СкидкаПоДисконтнойКарте <> 0)
				Тогда
				//Невозможно рассчитать цену по сумме документа!!!
			Иначе
				СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / (1 - СтрокаТабличнойЧасти.ПроцентСкидкиНаценки / 100) / СтрокаТабличнойЧасти.Количество;
			КонецЕсли;
		Иначе
			СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
		КонецЕсли;
	КонецЕсли;
	//нечаева 29,05,15---
	
КонецПроцедуры // РассчитатьЦенуТабЧасти()

// персчитывает ТЧ при изменении курса, валюты или типа цен 
Процедура ПересчетТЧ(ДокументОбъект,ИмяТЧ,Валюта2,Валюта1,Курс2,Курс1,ИзмененТипЦен=Ложь) Экспорт
	// Кухарь А.Ю. 20.05.2024 начало
	//
	если ЕстьРеквизитДокумента("МеждуСвоимиОрганизациями",ДокументОбъект.Метаданные()) тогда
		если ДокументОбъект.МеждуСвоимиОрганизациями тогда
			 //СообщитьИзМодуля("На документы между своими организациями пересчёт цен не нужен.");
			 Возврат;
		КонецЕсли;
	КонецЕсли;
	// Кухарь А.Ю. 20.05.2024 конец
	
	
	ИмяРеквизитаЦены=?(ЕстьРеквизитТабЧастиДокумента("ЦенаБезСкидки",ДокументОбъект.Метаданные(),ИмяТЧ),"ЦенаБезСкидки","Цена");
	// нечаева 28,05,15++
	Если ДокументОбъект.метаданные().Имя = "КорректировкаЦенВНакладной" Тогда
		ИмяРеквизитаЦены=?(ЕстьРеквизитТабЧастиДокумента("ЦенаФактБезСкидки",ДокументОбъект.Метаданные(),ИмяТЧ),"ЦенаФактБезСкидки","ЦенаФакт");
	КонецЕсли;
	// нечаева 28,05,15--
	
	//нечаева 29,05,15++ Для КЦН
	Контрагент= Неопределено;
	Если ЕстьРеквизитДокумента("Контрагент",ДокументОбъект.Метаданные()) ТОгда
		Контрагент = ДокументОбъект.Контрагент;
	КонецЕсли;	
	Если ЕстьРеквизитДокумента("Корреспондент",ДокументОбъект.Метаданные())  ТОгда
		Если  ДокументОбъект.Корреспондент.Метаданные().Имя = "Контрагенты"  Тогда
			Контрагент = ДокументОбъект.Корреспондент;
		КонецЕсли;
	КонецЕсли;	
	//нечаева 29,05,15---
	
	
	Для Каждого СтрокаТЧ Из ДокументОбъект[ИмяТЧ] Цикл
		//крохин начало
		//для некоторых акций не пересчитывается сумма по акционным строкам в чеке
		Если ДокументОбъект.метаданные().Имя = "Чек" И ИмяТЧ = "Товары" Тогда
			Если СтрокаТЧ.НеПересчитывать Тогда
				продолжить;
			Конецесли;	
		КонецЕсли;
		//крохин конец
		Если ИзмененТипЦен Тогда
			//крохин начало 06.03.2012
			//электронный сертификат ИМ
			//ЗаполнитьЦенуНоменклатурыТабЧасти(СтрокаТЧ,ДокументОбъект);
			//нечаева  +++ 03.04.14
			попытка  
				//нечаева 05,06,14  +++  смотрим менеджера у контрагента
				//ли ДокументОбъект.контрагент.ИспользоватьНоменклатурнуюМатрицу  и ДокументОбъект.менеджер.подразделение.родитель = Справочники.Подразделения.НайтиПоКоду("GRP-0421") Тогда
				//крохин начало 22.10.2014
				//с 23.10.2014 для всех матричных контрагентов прайсы  не используем
				//Если ДокументОбъект.контрагент.ИспользоватьНоменклатурнуюМатрицу  и ДокументОбъект.Контрагент.менеджер.подразделение.родитель = Справочники.Подразделения.НайтиПоКоду("GRP-0421") Тогда
				
				
				//нечаева 27,05,15 +++
				// для договоров не по матрице
				Попытка
					Если ДокументОбъект.Договор.НеИспользоватьМатрицу  Тогда
						НеИспользоватьМартицуПоДоговору=Истина;
					иначе
						НеИспользоватьМартицуПоДоговору=ложь;
					КонецЕсли;	
				исключение
					НеИспользоватьМартицуПоДоговору=ложь;
				конецПопытки;
				//29,05,15+++ нечаева убрала объект для контрагента
				Если контрагент.ИспользоватьНоменклатурнуюМатрицу и не НеИспользоватьМартицуПоДоговору Тогда		
					//нечаева 27,05,15 ---	
					// Кухарь А.Ю. 29.09.2021 начало
					// В ПРМ на отвественное хранение цены из матрицы
					если  ДокументОбъект.метаданные().имя="Перемещение" тогда
						СтрокаТЧ.Скидка=0;
						ЗаполнитьЦенуНоменклатурыТабЧастиПоМатрицеБезУчетаДоговора(СтрокаТЧ,ДокументОбъект);	
						
					иначе											
						// Кухарь А.Ю. 29.09.2021 конец
						
						//крохин начало 22.10.2014	
						//нечаева 05,06,14  ---
						//ЗаполнитьЦенуНоменклатурыТабЧастиПоМатрице(СтрокаТЧ,ДокументОбъект);
						
						// 22,08,14+++ нечаева
						// проверяем по какому типу расчитывать цену - с учетом договора или нет(если по договору не найдено). 
						Запрос = Новый Запрос;
						Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
						|	Матрица.Ссылка КАК Ссылка1
						|ИЗ
						|	Документ.Матрица КАК Матрица
						|ГДЕ
						|	Матрица.Контрагент = &Контрагент
						|	И Матрица.Дата <= &Дата1
						|	И Матрица.ДатаОкончания >= &Дата2
						|	И Матрица.Договор = &Договор
						|	И Матрица.Проведен = истина
						|АВТОУПОРЯДОЧИВАНИЕ";
						
						
						Запрос.УстановитьПараметр("Дата2",НачалоДня(ДокументОбъект.дата));
						Запрос.УстановитьПараметр("Дата1",КонецДня(ДокументОбъект.дата));
						Запрос.УстановитьПараметр("Контрагент",Контрагент);   //нечаева 29,05,15+++
						Запрос.УстановитьПараметр("Договор",ДокументОбъект.Договор);
						ТЗЕстьМатрицаПоДоговору = Запрос.Выполнить().Выгрузить();
						Если ТЗЕстьМатрицаПоДоговору.Количество()>0 Тогда
							ЗаполнитьЦенуНоменклатурыТабЧастиПоМатрице(СтрокаТЧ,ДокументОбъект);
						иначе
							сообщить("!!! Не найдена матрица по договору документа, цены заполнены без учета договора!");
							ЗаполнитьЦенуНоменклатурыТабЧастиПоМатрицеБезУчетаДоговора(СтрокаТЧ,ДокументОбъект);
						КонецЕсли;
						// 22,08,14 ---- нечаева
						
						// Кухарь А.Ю. 29.09.2021 начало
						//// В ПРМ на отвественное хранение цены из матрицы
					КонецЕсли;
					// Кухарь А.Ю. 29.09.2021 конец
					
				иначе	
					ЗаполнитьЦенуНоменклатурыТабЧасти(СтрокаТЧ,ДокументОбъект);
				КонецЕсли;
			исключение
				ЗаполнитьЦенуНоменклатурыТабЧасти(СтрокаТЧ,ДокументОбъект);
			конецПопытки;	
			//нечаева 03,04,014 ---
			
			Если ДокументОбъект.метаданные().Имя = "ПродажаИМ" И СтрокаТЧ.Номенклатура.Код = "SNL-288462" Тогда
				СтрокаТЧ.ЦенаБезСкидки = СтрокаТЧ.Цена;
			Иначе
				//крохин начало 23.04.2012
				//похоже лишний пересчет
				//ЗаполнитьЦенуНоменклатурыТабЧасти(СтрокаТЧ,ДокументОбъект);
				//крохин конец 23.04.2012		
			КонецЕсли;
			//крохин конец 06.03.2012
		Иначе
			СтрокаТЧ[ИмяРеквизитаЦены]=глПересчет(СтрокаТЧ[ИмяРеквизитаЦены],Валюта1,Курс1,Валюта2,Курс2);			
			//РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект, СпособРасчета = Неопределено) Экспорт
			
			//	РассчитатьСуммуТабЧасти(СтрокаТЧ,ДокументОбъект);
		КонецЕсли;
		
		РассчитатьСуммуТабЧасти(СтрокаТЧ,ДокументОбъект);
	КонецЦикла;
КонецПроцедуры



//нечаева 03,04,2014 +++
// персчитывает ТЧ при изменении курса, валюты или типа цен 
// при расчете с исп ном. матриц 
Процедура ПересчетТЧМатрицы(ДокументОбъект,ИмяТЧ,Валюта2,Валюта1,Курс2,Курс1) Экспорт	
	ИмяРеквизитаЦены=?(ЕстьРеквизитТабЧастиДокумента("ЦенаБезСкидки",ДокументОбъект.Метаданные(),ИмяТЧ),"ЦенаБезСкидки","Цена");	
	// нечаева 28,05,15++
	Если ДокументОбъект.метаданные().Имя = "КорректировкаЦенВНакладной" Тогда
		ИмяРеквизитаЦены=?(ЕстьРеквизитТабЧастиДокумента("ЦенаФактБезСкидки",ДокументОбъект.Метаданные(),ИмяТЧ),"ЦенаФактБезСкидки","ЦенаФакт");
	КонецЕсли;
	// нечаева 28,05,15--
	
	Для Каждого СтрокаТЧ Из ДокументОбъект[ИмяТЧ] Цикл
		//крохин начало
		//для некоторых акций не пересчитывается сумма по акционным строкам в чеке
		Если ДокументОбъект.метаданные().Имя = "Чек" И ИмяТЧ = "Товары" Тогда
			Если СтрокаТЧ.НеПересчитывать Тогда
				продолжить;
			Конецесли;	
		КонецЕсли;
		//крохин конец
		
		
		//нечаева 29,05,15++
		Контрагент= Неопределено;
		Если ЕстьРеквизитДокумента("Контрагент",ДокументОбъект.Метаданные()) ТОгда
			Контрагент = ДокументОбъект.Контрагент;
		КонецЕсли;	
		Если ЕстьРеквизитДокумента("Корреспондент",ДокументОбъект.Метаданные())  ТОгда
			Если  ДокументОбъект.Корреспондент.Метаданные().Имя = "Контрагенты"  Тогда
				Контрагент = ДокументОбъект.Корреспондент;
			КонецЕсли;
		КонецЕсли;	
		//нечаева 29,05,15---	
		
		
		// 22,08,14+++ нечаева
		// проверяем по какому типу расчитывать цену - с учетом договора или нет(если по договору не найдено). 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Матрица.Ссылка КАК Ссылка1
		|ИЗ
		|	Документ.Матрица КАК Матрица
		|ГДЕ
		|	Матрица.Контрагент = &Контрагент
		|	И Матрица.Дата <= &Дата1
		|	И Матрица.ДатаОкончания >= &Дата2
		|	И Матрица.Договор = &Договор
		|	И Матрица.Проведен = истина
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		
		Запрос.УстановитьПараметр("Дата2",НачалоДня(ДокументОбъект.дата));
		Запрос.УстановитьПараметр("Дата1",КонецДня(ДокументОбъект.дата));
		Запрос.УстановитьПараметр("Контрагент",Контрагент); //нечаева 29,05,15 +++
		Запрос.УстановитьПараметр("Договор",ДокументОбъект.Договор);
		ТЗЕстьМатрицаПоДоговору = Запрос.Выполнить().Выгрузить();
		Если ТЗЕстьМатрицаПоДоговору.Количество()>0 Тогда
			ЗаполнитьЦенуНоменклатурыТабЧастиПоМатрице(СтрокаТЧ,ДокументОбъект);
		иначе
			сообщить("!!! Не найдена матрица по договору документа, цены заполнены без учета договора!");
			ЗаполнитьЦенуНоменклатурыТабЧастиПоМатрицеБезУчетаДоговора(СтрокаТЧ,ДокументОбъект);
		КонецЕсли;
		// 22,08,14 ---- нечаева
		
		
		//ЗаполнитьЦенуНоменклатурыТабЧастиПоМатрице(СтрокаТЧ,ДокументОбъект);
		
		РассчитатьСуммуТабЧасти(СтрокаТЧ,ДокументОбъект);
	КонецЦикла;
КонецПроцедуры

// 17.04.2014  +++ немного доработала механизм с факт адресами
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБРАБОТКИ ТАБЛИЧНОЙ ЧАСТИ ТОРГОВЫХ ДОКУМЕНТОВ
Процедура ЗаполнитьЦенуНоменклатурыТабЧастиПоМатрицеБезУчетаДоговора(СтрокаТабличнойЧасти, ДокументОбъект) Экспорт
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Если НЕ ЕстьРеквизитДокумента("ТипЦен",МетаданныеДокумента) Тогда Возврат КонецЕсли; 
	Если СтрокаТабличнойЧасти=Неопределено ИЛИ СтрокаТабличнойЧасти.Номенклатура.Пустая() ИЛИ СтрокаТабличнойЧасти.Номенклатура.ВидНоменклатуры=Перечисления.ВидыНоменклаутры.ПодарочныйСертификат Тогда Возврат КонецЕсли;	
	
	ИмяТабличнойЧасти	= ПолучитьИмяТабличнойЧастиПоСсылкеНаСтроку(СтрокаТабличнойЧасти);	
	ИмяРеквизитыЦены	= ?(ЕстьРеквизитТабЧастиДокумента("ЦенаБезСкидки",МетаданныеДокумента,ИмяТабличнойЧасти),"ЦенаБезСкидки","Цена");
	
	ТекТипЦен			= справочники.ТипыЦен.ПустаяСсылка();
	Цена				= 0;
	Распродажа			= Ложь;
	
	ДатаРасчетаЦены= ДокументОбъект.Дата;
	
	//нечаева 29,05,15++
	Контрагент= Неопределено;
	Если ЕстьРеквизитДокумента("Контрагент",ДокументОбъект.Метаданные()) ТОгда
		Контрагент = ДокументОбъект.Контрагент;
	КонецЕсли;	
	Если ЕстьРеквизитДокумента("Корреспондент",ДокументОбъект.Метаданные())  ТОгда
		Если  ДокументОбъект.Корреспондент.Метаданные().Имя = "Контрагенты"  Тогда
			Контрагент = ДокументОбъект.Корреспондент;
		КонецЕсли;
	КонецЕсли;	
	//нечаева 29,05,15---
	
	Если ЕстьРеквизитТабЧастиДокумента(ИмяРеквизитыЦены, МетаданныеДокумента, ИмяТабличнойЧасти) Тогда		
		//нечаева 11,04,14+++	
		
		ТекТовар = СтрокаТабличнойЧасти.номенклатура;
		//-------------------------------------------------------------------------------
		ТЗМартицПоФА=новый ТаблицаЗначений;
		//------------------------------------------
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.Ссылка
		|ИЗ
		|	(ВЫБРАТЬ
		|		МатрицаПунктыДоставки.ПунктДоставки КАК ПунктДоставки,
		|		СУММА(1) КАК кол,
		|		Матрица.Ссылка КАК Ссылка
		|	ИЗ
		|		Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Матрица КАК Матрица
		|			ПО МатрицаПунктыДоставки.Ссылка = Матрица.Ссылка
		|	ГДЕ
		|		Матрица.Контрагент = &Контрагент
		|		И Матрица.Дата <= &Дата1
		|		И Матрица.ДатаОкончания >= &Дата2
		|		И МатрицаПунктыДоставки.ПунктДоставки <> &пустая";
		//нечаева 18,07,17++
		Попытка
			Если ДокументОбъект.ПостояннаяАкция Тогда
				Запрос.Текст = Запрос.Текст +" И Матрица.ПостояннаяАкция = истина";
				//крохин начало 28.07.2017
				//постоянные акции только под галку
			Иначе
				Запрос.Текст = Запрос.Текст +" И НЕ Матрица.ПостояннаяАкция";
				//крохин конец 28.07.2017
			КонецЕсли;
		Исключение
			
		КонецПопытки;
		
		Запрос.Текст = Запрос.Текст +"	
		|	СГРУППИРОВАТЬ ПО
		|		МатрицаПунктыДоставки.ПунктДоставки,
		|		Матрица.Ссылка) КАК ВложенныйЗапрос
		|АВТОУПОРЯДОЧИВАНИЕ";
		//нечаева 18,07,17---
		
		
		Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("пустая",справочники.ПунктДоставкиКонтрагента.ПустаяСсылка());
		// цена по акции
		ТЗМартицПоФА = Запрос.Выполнить().Выгрузить();
		
		
		
		
		//---------------------------------------------
		ЕстьМартицаПоФактАдресу=ложь;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	МатрицаПунктыДоставки.Ссылка
		|ИЗ
		|	Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
		|ГДЕ
		|	МатрицаПунктыДоставки.Ссылка.Дата <= &Дата1
		|	И МатрицаПунктыДоставки.Ссылка.Проведен
		|	И МатрицаПунктыДоставки.Ссылка.Контрагент = &Контрагент
		|	И МатрицаПунктыДоставки.Ссылка.ДатаОкончания >= &Дата2
		|		И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункДоставки
		//крохин начало 28.07.2017
		|	И НЕ МатрицаПунктыДоставки.Ссылка.ПостояннаяАкция 
		//крохин конец 28.07.2017
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		
		//нечаева 18,07,17++
		Попытка
			Если ДокументОбъект.ПостояннаяАкция Тогда
				
				Запрос.Текст = "ВЫБРАТЬ
				|	МатрицаПунктыДоставки.Ссылка
				|ИЗ
				|	Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
				|ГДЕ
				|	МатрицаПунктыДоставки.Ссылка.Дата <= &Дата1
				|	И МатрицаПунктыДоставки.Ссылка.Проведен
				|	И МатрицаПунктыДоставки.Ссылка.Контрагент = &Контрагент
				|	И МатрицаПунктыДоставки.Ссылка.ДатаОкончания >= &Дата2
				|	И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункДоставки
				|	И МатрицаПунктыДоставки.Ссылка.ПостояннаяАкция = истина
				|АВТОУПОРЯДОЧИВАНИЕ";
				
			КонецЕсли;
		Исключение
		КонецПопытки;
		//нечаева 18,07,17---
		
		Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТекПункДоставки",ДокументОбъект.пунктДоставки.ссылка);
		// цена по акции
		ТЗМК = Запрос.Выполнить().Выгрузить();
		
		Если ТЗМК.Количество()>0 Тогда
			ЕстьМартицаПоФактАдресу=истина;
		конецЕсли;
		// список значений матриц с пустыми значениями.
		
		
		
		
		
		ТекЦена=0;
		
		Если ЕстьМартицаПоФактАдресу Тогда
			
			//считаем по матрице. для конкретного факт. адреса
			//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	МатрицаТовары.Номенклатура,
			|	МатрицаТовары.Цена,
			|	МатрицаПунктыДоставки.Ссылка
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
			|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
			|ГДЕ
			|	МатрицаТовары.Ссылка.Дата <= &Дата1
			|	И МатрицаТовары.Ссылка.Проведен
			|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
			|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
			|	И МатрицаТовары.Ссылка.Акция = ИСТИНА
			|	И МатрицаТовары.Номенклатура = &ТекНом
			|	И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункДоставки";
			
			//нечаева 18,07,17++
			Попытка
				Если ДокументОбъект.ПостояннаяАкция Тогда
					Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
					//крохин начало 28.07.2017
					//постоянные акции только под галку
				Иначе
					Запрос.Текст = Запрос.Текст +" И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция";
					//крохин конец 28.07.2017
					
				КонецЕсли;
			Исключение
				
			КонецПопытки;
			
			Запрос.Текст = Запрос.Текст +"
			|	УПОРЯДОЧИТЬ ПО
			|	МатрицаТовары.Ссылка.Дата УБЫВ
			|АВТОУПОРЯДОЧИВАНИЕ";
			//нечаева 18,07,17---
			
			Запрос.УстановитьПараметр("ТекНом",ТекТовар);			   
			Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
			Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("ТекПункДоставки",ДокументОбъект.пунктДоставки);
			// цена по акции
			ТЗ1 = Запрос.Выполнить().Выгрузить();
			
			//цена по основному способу расчета, без учета акции		
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	МатрицаТовары.Номенклатура,
			|	МатрицаТовары.Цена,
			|	МатрицаПунктыДоставки.Ссылка
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
			|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
			|ГДЕ
			|	МатрицаТовары.Ссылка.Дата <= &Дата1
			|	И МатрицаТовары.Ссылка.Проведен
			|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
			|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
			|	И МатрицаТовары.Номенклатура = &ТекНом
			|	И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункт";
			//нечаева 18,07,17++
			Попытка
				Если ДокументОбъект.ПостояннаяАкция Тогда
					Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
					//крохин начало 28.07.2017
					//постоянные акции только под галку
				Иначе
					Запрос.Текст = Запрос.Текст +" И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция";
					//крохин конец 28.07.2017
					
				КонецЕсли;
			Исключение
				
			КонецПопытки;
			
			Запрос.Текст = Запрос.Текст +"
			|	УПОРЯДОЧИТЬ ПО
			|	МатрицаТовары.Ссылка.Дата УБЫВ
			|АВТОУПОРЯДОЧИВАНИЕ";
			//нечаева 18,07,17---
			
			Запрос.УстановитьПараметр("ТекНом",ТекТовар);
			Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
			Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("ТекПункт",ДокументОбъект.пунктДоставки);
			ТЗ2 = Запрос.Выполнить().Выгрузить();
			
			Отбор = новый Структура;
			Отбор.Вставить("Номенклатура",ТекТовар);
			СтрокиМатриц = ТЗ1.НайтиСтроки(Отбор); 
			СтрокиМатриц2 = ТЗ2.НайтиСтроки(Отбор); 
			ТекЦена=0;
			Если СтрокиМатриц.Количество() = 0 Тогда
				// смотрим по основной базе
				Если СтрокиМатриц2.Количество() = 0 Тогда
					ТекЦена=0;
				Иначе
					Для Каждого СтрокаМатриц Из СтрокиМатриц2 Цикл
						ТекЦена=СтрокаМатриц.Цена;
					КонецЦикла;
				КонецЕсли;
				
			Иначе
				
				Для Каждого СтрокаМатриц Из СтрокиМатриц Цикл
					ТекЦена=СтрокаМатриц.Цена;
				КонецЦикла;
				
			КонецЕсли;
			
			
		иначе 
			// берем по матрицам без заполненных факт адресов.
			
			Контрагент=ДокументОбъект.Контрагент;
			ТекТовар = СтрокаТабличнойЧасти.номенклатура;
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	МатрицаТовары.Номенклатура,
			|	МатрицаТовары.Цена,
			|	МатрицаТовары.Ссылка
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|ГДЕ
			|	МатрицаТовары.Ссылка.Дата <= &Дата1
			|	И МатрицаТовары.Ссылка.Проведен
			|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
			|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
			|	И МатрицаТовары.Ссылка.Акция = ИСТИНА
			|	И МатрицаТовары.Номенклатура = &ТекНом
			|	И НЕ МатрицаТовары.Ссылка В(&ТЗМартицПоФА)";
			//нечаева 18,07,17++
			Попытка
				Если ДокументОбъект.ПостояннаяАкция Тогда
					Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
					//крохин начало 28.07.2017
					//постоянные акции только под галку
				Иначе
					Запрос.Текст = Запрос.Текст +" И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция";
					//крохин конец 28.07.2017
					
				КонецЕсли;
			Исключение
				
			КонецПопытки;
			
			Запрос.Текст = Запрос.Текст +"
			|	УПОРЯДОЧИТЬ ПО
			|	МатрицаТовары.Ссылка.Дата УБЫВ
			|АВТОУПОРЯДОЧИВАНИЕ";
			//нечаева 18,07,17---
			
			Запрос.УстановитьПараметр("ТекНом",ТекТовар);			   
			Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
			Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("ТЗМартицПоФА",ТЗМартицПоФА);
			
			// цена по акции
			ТЗ1 = Запрос.Выполнить().Выгрузить();
			
			//цена по основному способу расчета, без учета матрицы.		
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	МатрицаТовары.Номенклатура,
			|	МатрицаТовары.Цена,
			|	МатрицаТовары.Ссылка
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|ГДЕ
			|	МатрицаТовары.Ссылка.Дата <= &Дата1
			|	И МатрицаТовары.Ссылка.Проведен
			|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
			|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
			|	И МатрицаТовары.Номенклатура = &ТекНом
			|	И НЕ МатрицаТовары.Ссылка В(&ТЗМартицПоФА)";
			//нечаева 18,07,17++
			Попытка
				Если ДокументОбъект.ПостояннаяАкция Тогда
					Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
					//крохин начало 28.07.2017
					//постоянные акции только под галку
				Иначе
					Запрос.Текст = Запрос.Текст +" И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция";
					//крохин конец 28.07.2017
				КонецЕсли;
			Исключение
				
			КонецПопытки;
			
			Запрос.Текст = Запрос.Текст +"
			|	УПОРЯДОЧИТЬ ПО
			|	МатрицаТовары.Ссылка.Дата УБЫВ
			|АВТОУПОРЯДОЧИВАНИЕ";
			//нечаева 18,07,17---
			
			Запрос.УстановитьПараметр("ТекНом",ТекТовар);
			Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
			Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("ТЗМартицПоФА",ТЗМартицПоФА);
			
			ТЗ2 = Запрос.Выполнить().Выгрузить();
			
			
			Отбор = новый Структура;
			Отбор.Вставить("Номенклатура",ТекТовар);
			СтрокиМатриц = ТЗ1.НайтиСтроки(Отбор); 
			СтрокиМатриц2 = ТЗ2.НайтиСтроки(Отбор); 
			ТекЦена=0;
			Если СтрокиМатриц.Количество() = 0 Тогда
				// смотрим по основной базе
				Если СтрокиМатриц2.Количество() = 0 Тогда
					ТекЦена=0;
				Иначе
					Для Каждого СтрокаМатриц Из СтрокиМатриц2 Цикл
						Если СтрокаМатриц.ссылка.ПунктыДоставки.Количество()=0 Тогда
							ТекЦена=СтрокаМатриц.Цена;
							прервать;
						конецЕсли;	
					КонецЦикла;
				КонецЕсли;
				
			Иначе
				
				Для Каждого СтрокаМатриц Из СтрокиМатриц Цикл
					//ТекЦена=СтрокаМатриц.Цена;
					Если СтрокаМатриц.ссылка.ПунктыДоставки.Количество()=0 Тогда
						ТекЦена=СтрокаМатриц.Цена;
						прервать;
					конецЕсли;	
					
				КонецЦикла;
				
			КонецЕсли;
		конецЕсли;
		//нечаева 11,04,14
		
		СтрокаТабличнойЧасти[ИмяРеквизитыЦены]=ТекЦена;
	КонецЕсли; 
	
	Если ЕстьРеквизитТабЧастиДокумента("ТипЦен",МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
		СтрокаТабличнойЧасти.ТипЦен = ТекТипЦен;
	КонецЕсли;
	
	
КонецПроцедуры
// 17.04.2014 --
//нечаева 03,04,2014 ---



// 21,08.2014  +++ Нечаева  добавила договора 
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБРАБОТКИ ТАБЛИЧНОЙ ЧАСТИ ТОРГОВЫХ ДОКУМЕНТОВ
Процедура ЗаполнитьЦенуНоменклатурыТабЧастиПоМатрице(СтрокаТабличнойЧасти, ДокументОбъект) Экспорт
	
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();

	
	//крохин начало 12.01.2021
	//для РНК нужен флаг "акция"
	Если МетаданныеДокумента.Имя = "РасходнаяНакладная" Тогда
		НуженРасчетАкции = Истина;	
		ЭтоАкция = Ложь;
	Иначе
		НуженРасчетАкции = Ложь;	
		ЭтоАкция = Ложь;	
	КонецЕсли;
	//крохин конец 12.01.2021
	
	
	
	Если НЕ ЕстьРеквизитДокумента("ТипЦен",МетаданныеДокумента) Тогда Возврат КонецЕсли; 
	Если СтрокаТабличнойЧасти=Неопределено ИЛИ СтрокаТабличнойЧасти.Номенклатура.Пустая() ИЛИ СтрокаТабличнойЧасти.Номенклатура.ВидНоменклатуры=Перечисления.ВидыНоменклаутры.ПодарочныйСертификат Тогда Возврат КонецЕсли;	
	
	ИмяТабличнойЧасти	= ПолучитьИмяТабличнойЧастиПоСсылкеНаСтроку(СтрокаТабличнойЧасти);	
	ИмяРеквизитыЦены	= ?(ЕстьРеквизитТабЧастиДокумента("ЦенаБезСкидки",МетаданныеДокумента,ИмяТабличнойЧасти),"ЦенаБезСкидки","Цена");
	
	ТекТипЦен			= справочники.ТипыЦен.ПустаяСсылка();
	Цена				= 0;
	Распродажа			= Ложь;
	
	ДатаРасчетаЦены= ДокументОбъект.Дата;
	//нечаева 29,05,15++
	Контрагент= Неопределено;
	Если ЕстьРеквизитДокумента("Контрагент",ДокументОбъект.Метаданные()) ТОгда
		Контрагент = ДокументОбъект.Контрагент;
	КонецЕсли;	
	Если ЕстьРеквизитДокумента("Корреспондент",ДокументОбъект.Метаданные())  ТОгда
		Если  ДокументОбъект.Корреспондент.Метаданные().Имя = "Контрагенты"  Тогда
			Контрагент = ДокументОбъект.Корреспондент;
		КонецЕсли;
	КонецЕсли;	
	//нечаева 29,05,15---
	Если ЕстьРеквизитТабЧастиДокумента(ИмяРеквизитыЦены, МетаданныеДокумента, ИмяТабличнойЧасти) Тогда		
		//нечаева 11,04,14+++	
		//Контрагент=ДокументОбъект.Контрагент;
		Договор = ДокументОбъект.договор;
		ТекТовар = СтрокаТабличнойЧасти.номенклатура;
		//-------------------------------------------------------------------------------
		ТЗМартицПоФА=новый ТаблицаЗначений;
		//------------------------------------------
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.Ссылка
		|ИЗ
		|	(ВЫБРАТЬ
		|		МатрицаПунктыДоставки.ПунктДоставки КАК ПунктДоставки,
		|		СУММА(1) КАК кол,
		|		Матрица.Ссылка КАК Ссылка
		|	ИЗ
		|		Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Матрица КАК Матрица
		|			ПО МатрицаПунктыДоставки.Ссылка = Матрица.Ссылка
		|	ГДЕ
		|		Матрица.Контрагент = &Контрагент
		|		И Матрица.Дата <= &Дата1
		|		И Матрица.ДатаОкончания >= &Дата2
		|		И МатрицаПунктыДоставки.ПунктДоставки <> &пустая
		|		И Матрица.Договор = &Договор";
		
		//нечаева 18,07,17++
		Попытка
			Если ДокументОбъект.ПостояннаяАкция Тогда
				Запрос.Текст = Запрос.Текст +" И Матрица.ПостояннаяАкция = истина";
				
				//крохин начало 28.07.2017
				//постоянные акции только под галку
			Иначе
				Запрос.Текст = Запрос.Текст +" И НЕ Матрица.ПостояннаяАкция";
				//крохин конец 28.07.2017
				
				
			КонецЕсли;
		Исключение
			
		КонецПопытки;
		
		Запрос.Текст = Запрос.Текст +"	
		|	СГРУППИРОВАТЬ ПО
		|		МатрицаПунктыДоставки.ПунктДоставки,
		|		Матрица.Ссылка) КАК ВложенныйЗапрос
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		//нечаева 18,07,17---
		
		Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("Договор",Договор);
		
		Запрос.УстановитьПараметр("пустая",справочники.ПунктыДоставки.ПустаяСсылка());
		// цена по акции
		ТЗМартицПоФА = Запрос.Выполнить().Выгрузить();
		
		
		//---------------------------------------------
		ЕстьМартицаПоФактАдресу=ложь;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	МатрицаПунктыДоставки.Ссылка
		|ИЗ
		|	Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
		|ГДЕ
		|	МатрицаПунктыДоставки.Ссылка.Дата <= &Дата1
		|	И МатрицаПунктыДоставки.Ссылка.Проведен
		|	И МатрицаПунктыДоставки.Ссылка.Договор = &Договор
		|	И МатрицаПунктыДоставки.Ссылка.Контрагент = &Контрагент
		|	И МатрицаПунктыДоставки.Ссылка.ДатаОкончания >= &Дата2
		|	И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункДоставки
		//крохин начало 28.07.2017
		|	И НЕ МатрицаПунктыДоставки.Ссылка.ПостояннаяАкция
		//крохин конец 28.07.2017
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		//нечаева 18,07,17++
		Попытка
			Если ДокументОбъект.ПостояннаяАкция Тогда
				Запрос.Текст = "ВЫБРАТЬ
				|	МатрицаПунктыДоставки.Ссылка
				|ИЗ
				|	Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
				|ГДЕ
				|	МатрицаПунктыДоставки.Ссылка.Дата <= &Дата1
				|	И МатрицаПунктыДоставки.Ссылка.Проведен
				|	И МатрицаПунктыДоставки.Ссылка.Договор = &Договор
				|	И МатрицаПунктыДоставки.Ссылка.Контрагент = &Контрагент
				|	И МатрицаПунктыДоставки.Ссылка.ДатаОкончания >= &Дата2
				|	И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункДоставки
				|	И МатрицаПунктыДоставки.Ссылка.ПостояннаяАкция = истина
				|АВТОУПОРЯДОЧИВАНИЕ";
				
			КонецЕсли;
		Исключение
			
		КонецПопытки;
		//нечаева 18,07,17-*--
		
		Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("Договор",Договор);
		Запрос.УстановитьПараметр("ТекПункДоставки",ДокументОбъект.пунктДоставки.ссылка);
		// цена по акции
		ТЗМК = Запрос.Выполнить().Выгрузить();
		
		Если ТЗМК.Количество()>0 Тогда
			ЕстьМартицаПоФактАдресу=истина;
		конецЕсли;
		// список значений матриц с пустыми значениями.
		
		
		
		
		ТекЦена=0;
		
		Если ЕстьМартицаПоФактАдресу Тогда
			
			//считаем по матрице. для конкретного факт. адреса
			//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	МатрицаТовары.Номенклатура,
			|	МатрицаТовары.Цена,
			|	МатрицаПунктыДоставки.Ссылка
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
			|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
			|ГДЕ
			|	МатрицаТовары.Ссылка.Дата <= &Дата1
			|	И МатрицаТовары.Ссылка.Проведен
			|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
			|	И МатрицаТовары.Ссылка.Договор = &Договор
			|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
			|	И МатрицаТовары.Ссылка.Акция = ИСТИНА
			|	И МатрицаТовары.Номенклатура = &ТекНом
			|	И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункДоставки";
			
			//нечаева 18,07,17++
			Попытка
				Если ДокументОбъект.ПостояннаяАкция Тогда
					Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
					//крохин начало 28.07.2017
					//постоянные акции только под галку
				Иначе
					Запрос.Текст = Запрос.Текст +" И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция";
					//крохин конец 28.07.2017
					
					
				КонецЕсли;
			Исключение
				
			КонецПопытки;
			
			Запрос.Текст = Запрос.Текст +"
			|	УПОРЯДОЧИТЬ ПО
			|	МатрицаТовары.Ссылка.Дата УБЫВ
			|АВТОУПОРЯДОЧИВАНИЕ";
			//нечаева 18,07,17---
			
			
			Запрос.УстановитьПараметр("ТекНом",ТекТовар);			   
			Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
			Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("Договор",Договор);
			
			Запрос.УстановитьПараметр("ТекПункДоставки",ДокументОбъект.пунктДоставки);
			// цена по акции
			ТЗ1 = Запрос.Выполнить().Выгрузить();
			
			//цена по основному способу расчета, без учета акции		
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	МатрицаТовары.Номенклатура,
			|	МатрицаТовары.Цена,
			|	МатрицаПунктыДоставки.Ссылка
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
			|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
			|ГДЕ
			|	МатрицаТовары.Ссылка.Дата <= &Дата1
			|	И МатрицаТовары.Ссылка.Проведен
			|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
			|	И МатрицаТовары.Ссылка.Договор = &Договор
			|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
			|	И МатрицаТовары.Номенклатура = &ТекНом
			|	И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункт";
			
			//нечаева 18,07,17++
			Попытка
				Если ДокументОбъект.ПостояннаяАкция Тогда
					Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
					//крохин начало 28.07.2017
					//постоянные акции только под галку
				Иначе
					Запрос.Текст = Запрос.Текст +" И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция";
					//крохин конец 28.07.2017
					
					
				КонецЕсли;
			Исключение
				
			КонецПопытки;
			
			Запрос.Текст = Запрос.Текст +"
			|	УПОРЯДОЧИТЬ ПО
			|	МатрицаТовары.Ссылка.Дата УБЫВ
			|АВТОУПОРЯДОЧИВАНИЕ";
			//нечаева 18,07,17---
			
			Запрос.УстановитьПараметр("ТекНом",ТекТовар);
			Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
			Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("Договор",Договор);
			
			Запрос.УстановитьПараметр("ТекПункт",ДокументОбъект.пунктДоставки);
			ТЗ2 = Запрос.Выполнить().Выгрузить();
			
			Отбор = новый Структура;
			Отбор.Вставить("Номенклатура",ТекТовар);
			СтрокиМатриц = ТЗ1.НайтиСтроки(Отбор); 
			СтрокиМатриц2 = ТЗ2.НайтиСтроки(Отбор); 
			ТекЦена=0;
			Если СтрокиМатриц.Количество() = 0 Тогда
				// смотрим по основной базе
				Если СтрокиМатриц2.Количество() = 0 Тогда
					ТекЦена=0;
				Иначе
					Для Каждого СтрокаМатриц Из СтрокиМатриц2 Цикл
						ТекЦена=СтрокаМатриц.Цена;
						//крохин начало 12.01.2021
						//для РНК нужен флаг "акция"
						Если НуженРасчетАкции Тогда
							Если  СтрокаМатриц.Ссылка.Акция ИЛИ СтрокаМатриц.Ссылка.ПостояннаяАкция Тогда
								ЭтоАкция = Истина;
							КонецЕсли;
						КонецЕсли;
						//крохин конец 12.01.2021
					КонецЦикла;
				КонецЕсли;
				
			Иначе
				
				Для Каждого СтрокаМатриц Из СтрокиМатриц Цикл
					ТекЦена=СтрокаМатриц.Цена;
					//крохин начало 12.01.2021
					//для РНК нужен флаг "акция"
					Если НуженРасчетАкции Тогда
						Если  СтрокаМатриц.Ссылка.Акция ИЛИ СтрокаМатриц.Ссылка.ПостояннаяАкция Тогда
							ЭтоАкция = Истина;
						КонецЕсли;
					КонецЕсли;
					//крохин конец 12.01.2021
				КонецЦикла;
				
			КонецЕсли;
			
			
		иначе 
			// берем по матрицам без заполненных факт адресов.
			
			Контрагент=ДокументОбъект.Контрагент;
			ТекТовар = СтрокаТабличнойЧасти.номенклатура;
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	МатрицаТовары.Номенклатура,
			|	МатрицаТовары.Цена,
			|	МатрицаТовары.Ссылка
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|ГДЕ
			|	МатрицаТовары.Ссылка.Дата <= &Дата1
			|	И МатрицаТовары.Ссылка.Проведен
			|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
			|	И МатрицаТовары.Ссылка.Договор = &Договор
			|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
			|	И МатрицаТовары.Ссылка.Акция = ИСТИНА
			|	И МатрицаТовары.Номенклатура = &ТекНом
			|	И НЕ МатрицаТовары.Ссылка В(&ТЗМартицПоФА)";
			
			//нечаева 18,07,17++
			Попытка
				Если ДокументОбъект.ПостояннаяАкция Тогда
					Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
					//крохин начало 28.07.2017
					//постоянные акции только под галку
				Иначе
					Запрос.Текст = Запрос.Текст +" И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция ";
					//крохин конец 28.07.2017
					
				КонецЕсли;
			Исключение
			КонецПопытки;	
			Запрос.Текст = Запрос.Текст +"
			|	УПОРЯДОЧИТЬ ПО
			|	МатрицаТовары.Ссылка.Дата УБЫВ
			|АВТОУПОРЯДОЧИВАНИЕ";
			//нечаева  18,07,17+++
			
			Запрос.УстановитьПараметр("ТекНом",ТекТовар);			   
			Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
			Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("Договор",Договор);
			
			Запрос.УстановитьПараметр("ТЗМартицПоФА",ТЗМартицПоФА);
			
			// цена по акции
			ТЗ1 = Запрос.Выполнить().Выгрузить();
			
			//цена по основному способу расчета, без учета матрицы.		
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	МатрицаТовары.Номенклатура,
			|	МатрицаТовары.Цена,
			|	МатрицаТовары.Ссылка
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|ГДЕ
			|	МатрицаТовары.Ссылка.Дата <= &Дата1
			|	И МатрицаТовары.Ссылка.Проведен
			|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
			|	И МатрицаТовары.Ссылка.Договор = &Договор
			|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
			|	И МатрицаТовары.Номенклатура = &ТекНом
			|	И (НЕ МатрицаТовары.Ссылка В (&ТЗМартицПоФА))";
			
			//нечаева 18,07,17++
			Попытка
				Если ДокументОбъект.ПостояннаяАкция Тогда
					Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
					//крохин начало 28.07.2017
					//постоянные акции только под галку
				Иначе
					Запрос.Текст = Запрос.Текст +" И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция ";
					//крохин конец 28.07.2017
				КонецЕсли;
			Исключение
			КонецПопытки;	
			Запрос.Текст = Запрос.Текст +"
			|	УПОРЯДОЧИТЬ ПО
			|	МатрицаТовары.Ссылка.Дата УБЫВ
			|АВТОУПОРЯДОЧИВАНИЕ";
			//нечаева  18,07,17+++
			Запрос.УстановитьПараметр("ТекНом",ТекТовар);
			Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
			Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("Договор",Договор);
			
			Запрос.УстановитьПараметр("ТЗМартицПоФА",ТЗМартицПоФА);
			
			ТЗ2 = Запрос.Выполнить().Выгрузить();
			
			
			Отбор = новый Структура;
			Отбор.Вставить("Номенклатура",ТекТовар);
			СтрокиМатриц = ТЗ1.НайтиСтроки(Отбор); 
			СтрокиМатриц2 = ТЗ2.НайтиСтроки(Отбор); 
			ТекЦена=0;
			Если СтрокиМатриц.Количество() = 0 Тогда
				// смотрим по основной базе
				Если СтрокиМатриц2.Количество() = 0 Тогда
					ТекЦена=0;
				Иначе
					Для Каждого СтрокаМатриц Из СтрокиМатриц2 Цикл
						Если СтрокаМатриц.ссылка.ПунктыДоставки.Количество()=0 Тогда
							ТекЦена=СтрокаМатриц.Цена;
							//крохин начало 12.01.2021
							//для РНК нужен флаг "акция"
							Если НуженРасчетАкции Тогда
								Если  СтрокаМатриц.Ссылка.Акция ИЛИ СтрокаМатриц.Ссылка.ПостояннаяАкция Тогда
									ЭтоАкция = Истина;
								КонецЕсли;
							КонецЕсли;
							//крохин конец 12.01.2021
							прервать;
						конецЕсли;	
					КонецЦикла;
				КонецЕсли;
				
			Иначе
				
				Для Каждого СтрокаМатриц Из СтрокиМатриц Цикл
					//ТекЦена=СтрокаМатриц.Цена;
					Если СтрокаМатриц.ссылка.ПунктыДоставки.Количество()=0 Тогда
						ТекЦена=СтрокаМатриц.Цена;
						//крохин начало 12.01.2021
						//для РНК нужен флаг "акция"
						Если НуженРасчетАкции Тогда
							Если  СтрокаМатриц.Ссылка.Акция ИЛИ СтрокаМатриц.Ссылка.ПостояннаяАкция Тогда
								ЭтоАкция = Истина;
							КонецЕсли;
						КонецЕсли;
						//крохин конец 12.01.2021
						
						прервать;
					конецЕсли;	
					
				КонецЦикла;
				
			КонецЕсли;
		конецЕсли;
		//нечаева 11,04,14
		
		СтрокаТабличнойЧасти[ИмяРеквизитыЦены]=ТекЦена;
		//крохин начало 12.01.2021
		//для РНК нужен флаг "акция"
		Если НуженРасчетАкции Тогда
			СтрокаТабличнойЧасти.Акция = ЭтоАкция;
		КонецЕсли;
		//крохин конец 12.01.2021
	КонецЕсли; 
	
	Если ЕстьРеквизитТабЧастиДокумента("ТипЦен",МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
		СтрокаТабличнойЧасти.ТипЦен = ТекТипЦен;
	КонецЕсли;
	
	
КонецПроцедуры
// 21,08.2014 --
//нечаева 03,04,2014 ---


//выдает число, а не меняет строку таб части.
// Нечаева для заполения пустых цен в РКМ 14,04,16+++
Функция ПолучитьЦенуНоменклатурыТабЧастиПоМатрице(СтрокаТабличнойЧасти, ДокументОбъект) Экспорт
	
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Если НЕ ЕстьРеквизитДокумента("ТипЦен",МетаданныеДокумента) Тогда Возврат 0 КонецЕсли; 
	Если СтрокаТабличнойЧасти=Неопределено ИЛИ СтрокаТабличнойЧасти.Номенклатура.Пустая() ИЛИ СтрокаТабличнойЧасти.Номенклатура.ВидНоменклатуры=Перечисления.ВидыНоменклаутры.ПодарочныйСертификат Тогда Возврат 0 КонецЕсли;	
	
	ИмяТабличнойЧасти	= ПолучитьИмяТабличнойЧастиПоСсылкеНаСтроку(СтрокаТабличнойЧасти);	
	ИмяРеквизитыЦены	= ?(ЕстьРеквизитТабЧастиДокумента("ЦенаБезСкидки",МетаданныеДокумента,ИмяТабличнойЧасти),"ЦенаБезСкидки","Цена");
	
	ТекТипЦен			= справочники.ТипыЦен.ПустаяСсылка();
	Цена				= 0;
	Распродажа			= Ложь;
	
	ДатаРасчетаЦены= ДокументОбъект.Дата;
	//нечаева 29,05,15++
	Контрагент= Неопределено;
	Если ЕстьРеквизитДокумента("Контрагент",ДокументОбъект.Метаданные()) ТОгда
		Контрагент = ДокументОбъект.Контрагент;
	КонецЕсли;	
	Если ЕстьРеквизитДокумента("Корреспондент",ДокументОбъект.Метаданные())  ТОгда
		Если  ДокументОбъект.Корреспондент.Метаданные().Имя = "Контрагенты"  Тогда
			Контрагент = ДокументОбъект.Корреспондент;
		КонецЕсли;
	КонецЕсли;	
	//нечаева 29,05,15---
	Если ЕстьРеквизитТабЧастиДокумента(ИмяРеквизитыЦены, МетаданныеДокумента, ИмяТабличнойЧасти) Тогда		
		//нечаева 11,04,14+++	
		//Контрагент=ДокументОбъект.Контрагент;
		Договор = ДокументОбъект.договор;
		ТекТовар = СтрокаТабличнойЧасти.номенклатура;
		//-------------------------------------------------------------------------------
		ТЗМартицПоФА=новый ТаблицаЗначений;
		//------------------------------------------
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.Ссылка
		|ИЗ
		|	(ВЫБРАТЬ
		|		МатрицаПунктыДоставки.ПунктДоставки КАК ПунктДоставки,
		|		СУММА(1) КАК кол,
		|		Матрица.Ссылка КАК Ссылка
		|	ИЗ
		|		Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Матрица КАК Матрица
		|			ПО МатрицаПунктыДоставки.Ссылка = Матрица.Ссылка
		|	ГДЕ
		|		Матрица.Контрагент = &Контрагент
		|		И Матрица.Дата <= &Дата1
		|		И Матрица.ДатаОкончания >= &Дата2
		|		И МатрицаПунктыДоставки.ПунктДоставки <> &пустая
		|		И Матрица.Договор = &Договор";
		
		//нечаева 18,07,17++
		Попытка
			Если ДокументОбъект.ПостояннаяАкция Тогда
				Запрос.Текст = Запрос.Текст +" И Матрица.ПостояннаяАкция = истина";
				//крохин начало 28.07.2017
				//постоянные акции только под галку
			Иначе
				Запрос.Текст = Запрос.Текст +" И НЕ Матрица.ПостояннаяАкция";
				//крохин конец 28.07.2017
				
			КонецЕсли;
		Исключение
			
		КонецПопытки;
		
		Запрос.Текст = Запрос.Текст +"	
		|	СГРУППИРОВАТЬ ПО
		|		МатрицаПунктыДоставки.ПунктДоставки,
		|		Матрица.Ссылка) КАК ВложенныйЗапрос
		|АВТОУПОРЯДОЧИВАНИЕ";
		//нечаева 18,07,17---
		Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("Договор",Договор);
		
		Запрос.УстановитьПараметр("пустая",справочники.ПунктыДоставки.ПустаяСсылка());
		// цена по акции
		ТЗМартицПоФА = Запрос.Выполнить().Выгрузить();
		
		//---------------------------------------------
		ЕстьМартицаПоФактАдресу=ложь;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	МатрицаПунктыДоставки.Ссылка
		|ИЗ
		|	Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
		|ГДЕ
		|	МатрицаПунктыДоставки.Ссылка.Дата <= &Дата1
		|	И МатрицаПунктыДоставки.Ссылка.Проведен
		|	И МатрицаПунктыДоставки.Ссылка.Договор = &Договор
		|	И МатрицаПунктыДоставки.Ссылка.Контрагент = &Контрагент
		|	И МатрицаПунктыДоставки.Ссылка.ДатаОкончания >= &Дата2
		|	И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункДоставки
		//крохин 28.07.2017
		|	И НЕ МатрицаПунктыДоставки.Ссылка.ПостояннаяАкция
		//крохин конец 28.07.2017
		| АВТОУПОРЯДОЧИВАНИЕ";
		//нечаева 18,07,17+++
		
		
		Попытка
			Если ДокументОбъект.ПостояннаяАкция Тогда
				
				Запрос.Текст = "ВЫБРАТЬ
				|	МатрицаПунктыДоставки.Ссылка
				|ИЗ
				|	Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
				|ГДЕ
				|	МатрицаПунктыДоставки.Ссылка.Дата <= &Дата1
				|	И МатрицаПунктыДоставки.Ссылка.Проведен
				|	И МатрицаПунктыДоставки.Ссылка.Договор = &Договор
				|	И МатрицаПунктыДоставки.Ссылка.Контрагент = &Контрагент
				|	И МатрицаПунктыДоставки.Ссылка.ДатаОкончания >= &Дата2
				|	И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункДоставки
				|	И МатрицаПунктыДоставки.Ссылка.ПостояннаяАкция = истина
				|АВТОУПОРЯДОЧИВАНИЕ";
				
			КонецЕсли;
		Исключение
		КонецПопытки;
		//нечаева 18,07,17---
		
		Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("Договор",Договор);
		Запрос.УстановитьПараметр("ТекПункДоставки",ДокументОбъект.пунктДоставки.ссылка);
		// цена по акции
		ТЗМК = Запрос.Выполнить().Выгрузить();
		
		Если ТЗМК.Количество()>0 Тогда
			ЕстьМартицаПоФактАдресу=истина;
		конецЕсли;
		// список значений матриц с пустыми значениями.
		
		
		ТекЦена=0;
		
		Если ЕстьМартицаПоФактАдресу Тогда
			
			//считаем по матрице. для конкретного факт. адреса
			//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	МатрицаТовары.Номенклатура,
			|	МатрицаТовары.Цена,
			|	МатрицаПунктыДоставки.Ссылка
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
			|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
			|ГДЕ
			|	МатрицаТовары.Ссылка.Дата <= &Дата1
			|	И МатрицаТовары.Ссылка.Проведен
			|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
			|	И МатрицаТовары.Ссылка.Договор = &Договор
			|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
			|	И МатрицаТовары.Ссылка.Акция = ИСТИНА
			|	И МатрицаТовары.Номенклатура = &ТекНом
			|	И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункДоставки";
			//нечаева 18,07,17++
			Попытка
				Если ДокументОбъект.ПостояннаяАкция Тогда
					Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
					//крохин начало 28.07.2017
					//постоянные акции только под галку
				Иначе
					Запрос.Текст = Запрос.Текст +" И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция";
					//крохин конец 28.07.2017
				КонецЕсли;
			Исключение
				
			КонецПопытки;
			
			Запрос.Текст = Запрос.Текст +"
			|	УПОРЯДОЧИТЬ ПО
			|	МатрицаТовары.Ссылка.Дата УБЫВ
			|АВТОУПОРЯДОЧИВАНИЕ";
			//нечаева 18,07,17---
			Запрос.УстановитьПараметр("ТекНом",ТекТовар);			   
			Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
			Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("Договор",Договор);
			
			Запрос.УстановитьПараметр("ТекПункДоставки",ДокументОбъект.пунктДоставки);
			// цена по акции
			ТЗ1 = Запрос.Выполнить().Выгрузить();
			
			//цена по основному способу расчета, без учета акции		
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	МатрицаТовары.Номенклатура,
			|	МатрицаТовары.Цена,
			|	МатрицаПунктыДоставки.Ссылка
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
			|		ПО МатрицаТовары.Ссылка = МатрицаПунктыДоставки.Ссылка
			|ГДЕ
			|	МатрицаТовары.Ссылка.Дата <= &Дата1
			|	И МатрицаТовары.Ссылка.Проведен
			|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
			|	И МатрицаТовары.Ссылка.Договор = &Договор
			|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
			|	И МатрицаТовары.Номенклатура = &ТекНом
			|	И МатрицаПунктыДоставки.ПунктДоставки.Ссылка = &текПункт";
			
			//нечаева 18,07,17++
			Попытка
				Если ДокументОбъект.ПостояннаяАкция Тогда
					Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
					//крохин начало 28.07.2017
					//постоянные акции только под галку
				Иначе
					Запрос.Текст = Запрос.Текст +" И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция";
					//крохин конец 28.07.2017
					
				КонецЕсли;
			Исключение
				
			КонецПопытки;
			
			Запрос.Текст = Запрос.Текст +"
			|	УПОРЯДОЧИТЬ ПО
			|	МатрицаТовары.Ссылка.Дата УБЫВ
			|АВТОУПОРЯДОЧИВАНИЕ";
			//нечаева 18,07,17---
			
			Запрос.УстановитьПараметр("ТекНом",ТекТовар);
			Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
			Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("Договор",Договор);
			
			Запрос.УстановитьПараметр("ТекПункт",ДокументОбъект.пунктДоставки);
			ТЗ2 = Запрос.Выполнить().Выгрузить();
			
			Отбор = новый Структура;
			Отбор.Вставить("Номенклатура",ТекТовар);
			СтрокиМатриц = ТЗ1.НайтиСтроки(Отбор); 
			СтрокиМатриц2 = ТЗ2.НайтиСтроки(Отбор); 
			ТекЦена=0;
			Если СтрокиМатриц.Количество() = 0 Тогда
				// смотрим по основной базе
				Если СтрокиМатриц2.Количество() = 0 Тогда
					ТекЦена=0;
				Иначе
					Для Каждого СтрокаМатриц Из СтрокиМатриц2 Цикл
						ТекЦена=СтрокаМатриц.Цена;
					КонецЦикла;
				КонецЕсли;
				
			Иначе
				
				Для Каждого СтрокаМатриц Из СтрокиМатриц Цикл
					ТекЦена=СтрокаМатриц.Цена;
				КонецЦикла;
				
			КонецЕсли;
			
			
		иначе 
			// берем по матрицам без заполненных факт адресов.
			
			Контрагент=ДокументОбъект.Контрагент;
			ТекТовар = СтрокаТабличнойЧасти.номенклатура;
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	МатрицаТовары.Номенклатура,
			|	МатрицаТовары.Цена,
			|	МатрицаТовары.Ссылка
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|ГДЕ
			|	МатрицаТовары.Ссылка.Дата <= &Дата1
			|	И МатрицаТовары.Ссылка.Проведен
			|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
			|	И МатрицаТовары.Ссылка.Договор = &Договор
			|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
			|	И МатрицаТовары.Ссылка.Акция = ИСТИНА
			|	И МатрицаТовары.Номенклатура = &ТекНом
			|	И НЕ МатрицаТовары.Ссылка В(&ТЗМартицПоФА)";
			
			//нечаева 18,07,17++
			Попытка
				Если ДокументОбъект.ПостояннаяАкция Тогда
					Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
					//крохин начало 28.07.2017
					//постоянные акции только под галку
				Иначе
					Запрос.Текст = Запрос.Текст +" И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция";
					//крохин конец 28.07.2017
				КонецЕсли;
			Исключение
				
			КонецПопытки;
			
			Запрос.Текст = Запрос.Текст +"
			|	УПОРЯДОЧИТЬ ПО
			|	МатрицаТовары.Ссылка.Дата УБЫВ
			|АВТОУПОРЯДОЧИВАНИЕ";
			//нечаева 18,07,17---
			
			Запрос.УстановитьПараметр("ТекНом",ТекТовар);			   
			Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
			Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("Договор",Договор);
			
			Запрос.УстановитьПараметр("ТЗМартицПоФА",ТЗМартицПоФА);
			
			// цена по акции
			ТЗ1 = Запрос.Выполнить().Выгрузить();
			
			//цена по основному способу расчета, без учета матрицы.		
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	МатрицаТовары.Номенклатура,
			|	МатрицаТовары.Цена,
			|	МатрицаТовары.Ссылка
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|ГДЕ
			|	МатрицаТовары.Ссылка.Дата <= &Дата1
			|	И МатрицаТовары.Ссылка.Проведен
			|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
			|	И МатрицаТовары.Ссылка.Договор = &Договор
			|	И МатрицаТовары.Ссылка.ДатаОкончания >= &Дата2
			|	И МатрицаТовары.Номенклатура = &ТекНом
			|	И (НЕ МатрицаТовары.Ссылка В (&ТЗМартицПоФА))";
			
			//нечаева 18,07,17++
			Попытка
				Если ДокументОбъект.ПостояннаяАкция Тогда
					Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
					//крохин начало 28.07.2017
					//постоянные акции только под галку
				Иначе
					Запрос.Текст = Запрос.Текст +" И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция";
					//крохин конец 28.07.2017
				КонецЕсли;
			Исключение
				
			КонецПопытки;
			
			Запрос.Текст = Запрос.Текст +"
			|	УПОРЯДОЧИТЬ ПО
			|	МатрицаТовары.Ссылка.Дата УБЫВ
			|АВТОУПОРЯДОЧИВАНИЕ";
			//нечаева 18,07,17---
			
			
			Запрос.УстановитьПараметр("ТекНом",ТекТовар);
			Запрос.УстановитьПараметр("Дата2",НачалоДня(ДатаРасчетаЦены));
			Запрос.УстановитьПараметр("Дата1",КонецДня(ДатаРасчетаЦены));
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("Договор",Договор);
			
			Запрос.УстановитьПараметр("ТЗМартицПоФА",ТЗМартицПоФА);
			
			ТЗ2 = Запрос.Выполнить().Выгрузить();
			
			
			Отбор = новый Структура;
			Отбор.Вставить("Номенклатура",ТекТовар);
			СтрокиМатриц = ТЗ1.НайтиСтроки(Отбор); 
			СтрокиМатриц2 = ТЗ2.НайтиСтроки(Отбор); 
			ТекЦена=0;
			Если СтрокиМатриц.Количество() = 0 Тогда
				// смотрим по основной базе
				Если СтрокиМатриц2.Количество() = 0 Тогда
					ТекЦена=0;
				Иначе
					Для Каждого СтрокаМатриц Из СтрокиМатриц2 Цикл
						Если СтрокаМатриц.ссылка.ПунктыДоставки.Количество()=0 Тогда
							ТекЦена=СтрокаМатриц.Цена;
							прервать;
						конецЕсли;	
					КонецЦикла;
				КонецЕсли;
				
			Иначе
				
				Для Каждого СтрокаМатриц Из СтрокиМатриц Цикл
					//ТекЦена=СтрокаМатриц.Цена;
					Если СтрокаМатриц.ссылка.ПунктыДоставки.Количество()=0 Тогда
						ТекЦена=СтрокаМатриц.Цена;
						прервать;
					конецЕсли;	
					
				КонецЦикла;
				
			КонецЕсли;
		конецЕсли;
		//нечаева 11,04,14
		
		//СтрокаТабличнойЧасти[ИмяРеквизитыЦены]=ТекЦена;
	КонецЕсли; 
	//
	//Если ЕстьРеквизитТабЧастиДокумента("ТипЦен",МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
	//	СтрокаТабличнойЧасти.ТипЦен = ТекТипЦен;
	//КонецЕсли;
	//
	Возврат ТекЦена;
	
КонецФункции
// нечаева 14,04,16 ----


Функция ПроверитьСоответствиеЗаявке(ДокОбъект) Экспорт
	МетаДок		=ДокОбъект.Метаданные();
	
	Если ЕстьРеквизитДокумента("НеСоответствуетЗаявке",МетаДок) И ЕстьРеквизитТабЧастиДокумента("ПодтвержденнаяЗаявка",МетаДок,"Товары") Тогда
		ДокОбъект.НеСоответствуетЗаявке=Ложь;			
		Для Каждого СтрокаТЧ Из ДокОбъект.Товары Цикл
			Если СтрокаТЧ.ПодтвержденнаяЗаявка<>СтрокаТЧ.Количество Тогда
				ДокОбъект.НеСоответствуетЗаявке=Истина;
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
	
	
КонецФункции // ПроверитьСоответствиеЗаявке()


//контроль и свертка дублирующих позиций по ТЧ нечаева 07,08,2014 ++
Функция КонтрольДублейСтрокБезСуммирования(ДокОбъект) Экспорт	
	СтрокиДублей		= Новый Соответствие;
	УдаляемыеСтроки     = Новый Массив;
	МетаДок				= ДокОбъект.Метаданные();
	естьдубли= ложь;
	
	Если НЕ ЕстьТабЧастьДокумента("Товары",МетаДок) Тогда	
		Возврат Истина;		
	КонецЕсли;
	
	//Тимофеев Ю.А. 01.10.2023 было
	
	//Для Каждого СтрокаТЧ Из ДокОбъект.Товары Цикл	
	//	СтрокаДубля=СтрокиДублей.Получить(СтрокаТЧ.Номенклатура);
	//	Если СтрокаДубля=Неопределено Тогда
	//		Если СтрокаТЧ.Номенклатура.ВидНоменклатуры<>Перечисления.ВидыНоменклаутры.ПодарочныйСертификат Тогда
	//			СтрокиДублей.Вставить(СтрокаТЧ.Номенклатура,СтрокаТЧ);			
	//		КонецЕсли;			
	//	Иначе			
	//		//УдаляемыеСтроки.Добавить(СтрокаТЧ);
	//		сообщить("Дубль строк по Номенклатуре - "+СтрокаТЧ.Номенклатура);
	//		естьдубли=истина;
	//	КонецЕсли;
	//КонецЦикла; 	
	
	//Тимофеев Ю.А. 01.10.2023 Начало
	
			
	ЭтоПодарочныйСертификат=Перечисления.ВидыНоменклаутры.ПодарочныйСертификат;
	
	Для Каждого СтрокаТЧ Из ДокОбъект.Товары Цикл
		
		ТекНоменклатура = СтрокаТЧ.Номенклатура;
		
		СтрокаДубля=СтрокиДублей.Получить(ТекНоменклатура);
		Если СтрокаДубля=Неопределено Тогда
			
			Если МетаДок.Имя = "Матрица" Тогда 
				//в матрице проверять не будет ПС - время увеличиться в 5 раз
				СтрокиДублей.Вставить(ТекНоменклатура,СтрокаТЧ); 					
			Иначе        					
				Если ТекНоменклатура.ВидНоменклатуры<>ЭтоПодарочныйСертификат Тогда
					СтрокиДублей.Вставить(ТекНоменклатура,СтрокаТЧ);			
				КонецЕсли;	 
			КонецЕсли;    
			
		Иначе			
			//УдаляемыеСтроки.Добавить(СтрокаТЧ);
			сообщить("Дубль строк по Номенклатуре - "+ТекНоменклатура);
			естьдубли=истина;
			
		КонецЕсли;
	КонецЦикла; 	
		
	
	//Тимофеев Ю.А. 01.10.2023 Конец

	
	
	
	//Для Каждого СтрокаТЧ ИЗ УдаляемыеСтроки Цикл
	//	ДокОбъект.Товары.Удалить(СтрокаТЧ);		
	//КонецЦикла;
	возврат естьдубли;
	
КонецФункции // КонтрольДублейСтрок(ДокОбъект) Экспорт
//контроль и свертка дублирующих позиций по ТЧ нечаева 07,08,2014 --


//контроль и свертка дублирующих позиций по ТЧ накладной
Функция КонтрольДублейСтрок(ДокОбъект) Экспорт	
	СтрокиДублей		= Новый Соответствие;
	УдаляемыеСтроки     = Новый Массив;
	МетаДок				= ДокОбъект.Метаданные();
	
	//+++Чирков - 16.01.13 надоели ошибки в логах
	Если НЕ ЕстьТабЧастьДокумента("Товары",МетаДок) Тогда	
		Возврат Истина;		
	КонецЕсли;
	//---Чирков
	
	СуммируемыеКолонки	= Новый Массив;
	Если ЕстьРеквизитТабЧастиДокумента("Заявка",МетаДок,"Товары") Тогда
		СуммируемыеКолонки.Добавить("Заявка");
	КонецЕсли; 
	Если ЕстьРеквизитТабЧастиДокумента("ПодтвержденнаяЗаявка",МетаДок,"Товары") Тогда
		СуммируемыеКолонки.Добавить("ПодтвержденнаяЗаявка");
	КонецЕсли;
	Если ЕстьРеквизитТабЧастиДокумента("КоличествоРасч",МетаДок,"Товары") Тогда
		СуммируемыеКолонки.Добавить("КоличествоРасч");
	КонецЕсли;
	Если ЕстьРеквизитТабЧастиДокумента("КоличествоФакт",МетаДок,"Товары") Тогда
		СуммируемыеКолонки.Добавить("КоличествоФакт");
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из ДокОбъект.Товары Цикл	
		СтрокаДубля=СтрокиДублей.Получить(СтрокаТЧ.Номенклатура);
		Если СтрокаДубля=Неопределено Тогда
			//Кухарь 13.03.18 начало
			//оптимизация
			//Если СтрокаТЧ.Номенклатура.ВидНоменклатуры<>Перечисления.ВидыНоменклаутры.ПодарочныйСертификат Тогда
			//	СтрокиДублей.Вставить(СтрокаТЧ.Номенклатура,СтрокаТЧ);			
			//КонецЕсли;
			СтрокиДублей.Вставить(СтрокаТЧ.Номенклатура,СтрокаТЧ);	
			//Кухарь 13.03.18 конец
			
		Иначе			
			СтрокаДубля.Количество	=СтрокаДубля.Количество	+СтрокаТЧ.Количество;
			//крохин начало
			//СтрокаДубля.Всего		=СтрокаДубля.Всего		+СтрокаТЧ.Всего;
			Если ЕстьРеквизитТабЧастиДокумента("Всего",МетаДок,"Товары") Тогда
				СтрокаДубля.Всего		=СтрокаДубля.Всего		+СтрокаТЧ.Всего;
			Конецесли;
			//крохин конец
			
			Для Каждого Колонка Из СуммируемыеКолонки Цикл
				СтрокаДубля[Колонка]=СтрокаДубля[Колонка]+СтрокаТЧ[Колонка];			
			КонецЦикла;			
			
			РассчитатьСуммуТабЧасти(СтрокаДубля,ДокОбъект,"ОтВсего");			
			
			УдаляемыеСтроки.Добавить(СтрокаТЧ);
		КонецЕсли;
	КонецЦикла; 	
	
	Для Каждого СтрокаТЧ ИЗ УдаляемыеСтроки Цикл
		ДокОбъект.Товары.Удалить(СтрокаТЧ);		
	КонецЦикла;
	
	ПроверитьСоответствиеЗаявке(ДокОбъект);
КонецФункции // КонтрольДублейСтрок(ДокОбъект) Экспорт

//крохин начало 07.10.2013
//контроль и свертка дублирующих позиций по ТЧ ПНК в Риге
Функция КонтрольДублейСтрокСштукВКоробе(ДокОбъект) Экспорт	
	СтрокиДублей		= Новый Соответствие;
	УдаляемыеСтроки     = Новый Массив;
	МетаДок				= ДокОбъект.Метаданные();
	
	//+++Чирков - 16.01.13 надоели ошибки в логах
	Если НЕ ЕстьТабЧастьДокумента("Товары",МетаДок) Тогда	
		Возврат Истина;		
	КонецЕсли;
	//---Чирков
	
	СуммируемыеКолонки	= Новый Массив;
	Если ЕстьРеквизитТабЧастиДокумента("Заявка",МетаДок,"Товары") Тогда
		СуммируемыеКолонки.Добавить("Заявка");
	КонецЕсли; 
	Если ЕстьРеквизитТабЧастиДокумента("ПодтвержденнаяЗаявка",МетаДок,"Товары") Тогда
		СуммируемыеКолонки.Добавить("ПодтвержденнаяЗаявка");
	КонецЕсли;
	Если ЕстьРеквизитТабЧастиДокумента("КоличествоРасч",МетаДок,"Товары") Тогда
		СуммируемыеКолонки.Добавить("КоличествоРасч");
	КонецЕсли;
	Если ЕстьРеквизитТабЧастиДокумента("КоличествоФакт",МетаДок,"Товары") Тогда
		СуммируемыеКолонки.Добавить("КоличествоФакт");
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из ДокОбъект.Товары Цикл	
		//крохин начало 07.10.2013
		//новый ключ
		//Кухарь 14.05.15 начало
		//СтрокаДубля=СтрокиДублей.Получить("//"+СтрокаТЧ.ШтВКоробе+"//"+СтрокаТЧ.Номенклатура);
		СтрокаДубля=СтрокиДублей.Получить("//"+СтрокаТЧ.производитель+"//"+СтрокаТЧ.ШтВКоробе+"//"+СтрокаТЧ.Номенклатура);
		//Кухарь 14.05.15 конец
		//крохин конец 07.10.2013
		Если СтрокаДубля=Неопределено Тогда
			Если СтрокаТЧ.Номенклатура.ВидНоменклатуры<>Перечисления.ВидыНоменклаутры.ПодарочныйСертификат Тогда
				//крохин начало 07.10.2013
				//новый ключ
				//крохин начало 18.12.2015
				//новый ключ
				//СтрокиДублей.Вставить("//"+СтрокаТЧ.ШтВКоробе+"//"+СтрокаТЧ.Номенклатура,СтрокаТЧ);
				СтрокиДублей.Вставить("//"+СтрокаТЧ.производитель+"//"+СтрокаТЧ.ШтВКоробе+"//"+СтрокаТЧ.Номенклатура,СтрокаТЧ);			
				//крохин конец 18.12.2015
				//крохин конец 07.10.2013
			КонецЕсли;			
		Иначе			
			СтрокаДубля.Количество	=СтрокаДубля.Количество	+СтрокаТЧ.Количество;
			//крохин начало
			//СтрокаДубля.Всего		=СтрокаДубля.Всего		+СтрокаТЧ.Всего;
			Если ЕстьРеквизитТабЧастиДокумента("Всего",МетаДок,"Товары") Тогда
				СтрокаДубля.Всего		=СтрокаДубля.Всего		+СтрокаТЧ.Всего;
			Конецесли;
			//крохин конец
			
			Для Каждого Колонка Из СуммируемыеКолонки Цикл
				СтрокаДубля[Колонка]=СтрокаДубля[Колонка]+СтрокаТЧ[Колонка];			
			КонецЦикла;			
			
			РассчитатьСуммуТабЧасти(СтрокаДубля,ДокОбъект,"ОтВсего");			
			
			УдаляемыеСтроки.Добавить(СтрокаТЧ);
		КонецЕсли;
	КонецЦикла; 	
	
	Для Каждого СтрокаТЧ ИЗ УдаляемыеСтроки Цикл
		ДокОбъект.Товары.Удалить(СтрокаТЧ);		
	КонецЦикла;
	
	ПроверитьСоответствиеЗаявке(ДокОбъект);
КонецФункции // КонтрольДублейСтрок(ДокОбъект) Экспорт
//крохин конец 07.10.2013

//крохин начало 27.07.2021
Функция КонтрольДублейСтрокБезСертификатов(ДокОбъект) Экспорт	
	СтрокиДублей		= Новый Соответствие;
	УдаляемыеСтроки     = Новый Массив;
	МетаДок				= ДокОбъект.Метаданные();
	
	//+++Чирков - 16.01.13 надоели ошибки в логах
	Если НЕ ЕстьТабЧастьДокумента("Товары",МетаДок) Тогда	
		Возврат Истина;		
	КонецЕсли;
	//---Чирков
	
	СуммируемыеКолонки	= Новый Массив;
	Если ЕстьРеквизитТабЧастиДокумента("Заявка",МетаДок,"Товары") Тогда
		СуммируемыеКолонки.Добавить("Заявка");
	КонецЕсли; 
	Если ЕстьРеквизитТабЧастиДокумента("ПодтвержденнаяЗаявка",МетаДок,"Товары") Тогда
		СуммируемыеКолонки.Добавить("ПодтвержденнаяЗаявка");
	КонецЕсли;
	Если ЕстьРеквизитТабЧастиДокумента("КоличествоРасч",МетаДок,"Товары") Тогда
		СуммируемыеКолонки.Добавить("КоличествоРасч");
	КонецЕсли;
	Если ЕстьРеквизитТабЧастиДокумента("КоличествоФакт",МетаДок,"Товары") Тогда
		СуммируемыеКолонки.Добавить("КоличествоФакт");
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из ДокОбъект.Товары Цикл	
		Если СтрокаТЧ.Номенклатура.ВидНоменклатуры=Перечисления.ВидыНоменклаутры.ПодарочныйСертификат Тогда
			Продолжить;
		КонецЕсли;
		//крохин начало 27.07.2021
		//сворачиваем только строки без акции
		Если СтрокаТЧ.АвтопроверяемаяАкция.ПродажаБлочкамиПоФиксированнымЦенам Тогда
			Продолжить;	
		КонецЕсли;
		//крохин конец 27.07.2021
		СтрокаДубля=СтрокиДублей.Получить(СтрокаТЧ.Номенклатура);
		Если СтрокаДубля=Неопределено Тогда
			СтрокиДублей.Вставить(СтрокаТЧ.Номенклатура,СтрокаТЧ);	
		Иначе			
			СтрокаДубля.Количество	=СтрокаДубля.Количество	+СтрокаТЧ.Количество;
			Если ЕстьРеквизитТабЧастиДокумента("Всего",МетаДок,"Товары") Тогда
				СтрокаДубля.Всего		=СтрокаДубля.Всего		+СтрокаТЧ.Всего;
			Конецесли;
			Для Каждого Колонка Из СуммируемыеКолонки Цикл
				СтрокаДубля[Колонка]=СтрокаДубля[Колонка]+СтрокаТЧ[Колонка];			
			КонецЦикла;			
			
			РассчитатьСуммуТабЧасти(СтрокаДубля,ДокОбъект,"ОтВсего");			
			
			УдаляемыеСтроки.Добавить(СтрокаТЧ);
		КонецЕсли;
	КонецЦикла; 	
	
	Для Каждого СтрокаТЧ ИЗ УдаляемыеСтроки Цикл
		ДокОбъект.Товары.Удалить(СтрокаТЧ);		
	КонецЦикла;
	
	ПроверитьСоответствиеЗаявке(ДокОбъект);
	
КонецФункции // КонтрольДублейСтрок(ДокОбъект) Экспорт
//крохин конец 07.10.2013

//Нечаева 15,06,23+++
//контроль и свертка дублирующих позиций по ТЧ новинки
Функция КонтрольДублейНоменклатуры(ДокОбъект,ИМяТЧ="Новинки") Экспорт	
	СтрокиДублей		= Новый Соответствие;
	УдаляемыеСтроки     = Новый Массив;
	МетаДок				= ДокОбъект.Метаданные();
	

	Если НЕ ЕстьТабЧастьДокумента(ИмяТЧ,МетаДок) Тогда	
		Возврат Истина;		
	КонецЕсли;
		
	
	Для Каждого СтрокаТЧ Из ДокОбъект.Новинки Цикл	
		СтрокаДубля=СтрокиДублей.Получить(СтрокаТЧ.Номенклатура);
		Если СтрокаДубля=Неопределено Тогда
			СтрокиДублей.Вставить(СтрокаТЧ.Номенклатура,СтрокаТЧ);	
				
		Иначе			
			
			УдаляемыеСтроки.Добавить(СтрокаТЧ);
		КонецЕсли;
	КонецЦикла; 	
	
	Для Каждого СтрокаТЧ ИЗ УдаляемыеСтроки Цикл
		ДокОбъект.Новинки.Удалить(СтрокаТЧ);		
	КонецЦикла;
	
	
КонецФункции // КонтрольДублейСтрок(ДокОбъект) Экспорт
//Нечаева 15,06,23 ---




// Кухарь А.Ю. 08.09.2021 начало
// Функция ПолучитьТЗУпаковки(ТЧ)   Экспорт
Функция ПолучитьТЗУпаковки(ТЧ,Контрагент=Неопределено)   Экспорт	 
	// Кухарь А.Ю. 08.09.2021 конец
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура");
	ТЗ.Колонки.Добавить("Родитель");
	ТЗ.Колонки.Добавить("Количество");
	ТЗ.Колонки.Добавить("Номенклатура2");
	
	//Кухарь 09.02.17 начало
	//Часть упаковки будет использоваться только при определённой доп обработки.
	ТЗ.Колонки.Добавить("ДопОбработка");
	//Кухарь 09.02.17 конец
	
	//крохин начало 18.05.2015
	//не используется
	//ТЗ.Колонки.Добавить("Заказ");
	//крохин конец 18.05.2015
	Для Каждого СтрокаТЧ ИЗ ТЧ Цикл
		ВыборкаУпаковки = Справочники.Упаковка.Выбрать(,СтрокаТЧ.Номенклатура);
		Пока ВыборкаУпаковки.Следующий() Цикл  
			//Кухарь 22.10.18 начало
			//фиктивная упаковка для носков и колготок
			если ВыборкаУпаковки.НезаполнятьВНакладных тогда
				Продолжить;
			КонецЕсли;
			//Кухарь 22.10.18 конец
			
			Для Каждого СтрокаУпаковки Из ВыборкаУпаковки.ЭлементыУпаковки Цикл
				// Кухарь А.Ю. 08.09.2021 начало
				// Упаковка для разных клиентов
				если  ЗначениеЗаполнено(СтрокаУпаковки.Контрагент) и СтрокаУпаковки.Контрагент<>Контрагент тогда Продолжить;КонецЕсли; 
				// Кухарь А.Ю. 08.09.2021 конец
				
				
				СтрокаТЗ = ТЗ.Добавить();
				//Кухарь 09.02.17 начало
				//Часть упаковки будет использоваться только при определённой доп обработки.
				СтрокаТЗ.ДопОбработка=СтрокаУпаковки.ВидДопОбработки;
				//Кухарь 09.02.17 конец
				СтрокаТЗ.Номенклатура = СтрокаУпаковки.Номенклатура;
				СтрокаТЗ.Номенклатура2 = СтрокаТЧ.Номенклатура.родитель;
				СтрокаТЗ.Родитель = СтрокаТЧ.Номенклатура.Родитель.Родитель;
				СтрокаТЗ.Количество = СтрокаУпаковки.Количество*СтрокаТЧ.Количество;
				//крохин начало 18.05.2015
				//не используется
				//СтрокаТЗ.Заказ = СтрокаТЧ.ЗаявкаПоставщику;	
				//крохин конец 18.05.2015			
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	//крохин начало 18.05.2015
	//не используется
	//ТЗ.Свернуть("Номенклатура,Заказ","Количество");
	//Кухарь 09.02.17 начало
	//Часть упаковки будет использоваться только при определённой доп обработки.	
	//ТЗ.Свернуть("Номенклатура","Количество");
	ТЗ.Свернуть("Номенклатура,ДопОбработка","Количество");
	//Кухарь 09.02.17 конец
	
	//крохин конец 18.05.2015
	Возврат ТЗ;
КонецФункции
//крохин конец 13.05.2011


//крохин начало 19.05.2015
Функция ТребуетсяУпаковка(ДопОбработки,КодОперации)  Экспорт
	//крохин начало 0306.2020 
	//Если КодОперации <> Перечисления.КодыОперацийОстатки.Реализация Тогда
	Если КодОперации <> Перечисления.КодыОперацийОстатки.Реализация И КодОперации <> Перечисления.КодыОперацийОстатки.Комиссия Тогда
		//крохин конец 03.06.2020	
		Возврат Ложь;	  
	КонецЕсли;
	Для Каждого строкаТЧ Из ДопОбработки цикл
		//крохин начало 21.08.2018
		//изменились виды доп. обработки для упаковки. После обновление надо поменять на реквизит 
		//Если строкаТЧ.ВидДопОбработки = Справочники.ВидыДопОбработки.НайтиПоКоду("OD7-00104") 
		//	или  строкаТЧ.ВидДопОбработки = Справочники.ВидыДопОбработки.НайтиПоКоду("OD7-00113")        
		//	ИЛИ строкаТЧ.ВидДопОбработки = Справочники.ВидыДопОбработки.ОтгрузкаУпаковкиОтдельно Тогда
		Если строкаТЧ.ВидДопОбработки.Код = "OD7-00103" 
			ИЛИ  строкаТЧ.ВидДопОбработки.Код = "OD7-00126"
			ИЛИ строкаТЧ.ВидДопОбработки.Код = "OD7-00128"
			ИЛИ строкаТЧ.ВидДопОбработки.Код = "OD7-00127"
			ИЛИ строкаТЧ.ВидДопОбработки.Код = "OD7-00104"
			ИЛИ строкаТЧ.ВидДопОбработки.Код = "OD7-00113"
			ИЛИ строкаТЧ.ВидДопОбработки = Справочники.ВидыДопОбработки.ОтгрузкаУпаковкиОтдельно 
			//крохин начало 29.08.2018
			//по ошибке ставят группу
			//ИЛИ строкаТЧ.ВидДопОбработки.РассчитыватьУпаковку Тогда
			ИЛИ (НЕ строкаТЧ.ВидДопОбработки.ЭтоГруппа И строкаТЧ.ВидДопОбработки.РассчитыватьУпаковку) Тогда
			//крохин конец 29.08.2018
			
			//крохин конец 21.08.2018
			Возврат Истина;	 
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции
//крохин конец 19.05.2015
//крохин начало 23.09.2015

Функция ТребуетсяУпаковкаПРМ(ДопОбработки)  Экспорт
	Для Каждого строкаТЧ Из ДопОбработки цикл
		//Кухарь 28.06.17 начало
		//Если строкаТЧ.ДопОбработка = Справочники.ВидыДопОбработки.УпаковкаТовара ИЛИ строкаТЧ.ДопОбработка = Справочники.ВидыДопОбработки.ОтгрузкаУпаковкиОтдельно Тогда
		//крохин начало 21.08.2018
		//изменились виды доп. обработки для упаковки. После обновления надо поменять на реквизит 
		//Если строкаТЧ.ДопОбработка = Справочники.ВидыДопОбработки.УпаковкаТовара ИЛИ строкаТЧ.ДопОбработка = Справочники.ВидыДопОбработки.ОтгрузкаУпаковкиОтдельно
		//	ИЛИ строкаТЧ.ДопОбработка = Справочники.ВидыДопОбработки.НайтиПоКоду("OD7-00104") ИЛИ строкаТЧ.ДопОбработка = Справочники.ВидыДопОбработки.НайтиПоКоду("OD7-00113")   Тогда
		//	
		Если строкаТЧ.ДопОбработка.Код = "OD7-00103" 
			ИЛИ  строкаТЧ.ДопОбработка.Код = "OD7-00126"
			ИЛИ строкаТЧ.ДопОбработка.Код = "OD7-00128"
			ИЛИ строкаТЧ.ДопОбработка.Код = "OD7-00127"
			ИЛИ строкаТЧ.ДопОбработка.Код = "OD7-00104"
			ИЛИ строкаТЧ.ДопОбработка.Код = "OD7-00113"
			ИЛИ строкаТЧ.ДопОбработка = Справочники.ВидыДопОбработки.ОтгрузкаУпаковкиОтдельно 
			ИЛИ строкаТЧ.ДопОбработка.РассчитыватьУпаковку  Тогда
			//крохин конец 21.08.2018
			//Кухарь 28.06.17 конец	
			Возврат Истина;	 
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции


//крохин конец 23.09.2015






//Нечаева 25,08,20+++ 
Функция ПроверкаШКGS1НаИспользование(ШтрихКод) Экспорт
	
	Используется = ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ШтрихКоды.Владелец КАК Владелец,
	|	ШтрихКоды.Наименование КАК Наименование,
	|	ШтрихКоды.ТипШК КАК ТипШК,
	|	ШтрихКоды.ВидШК КАК ВидШК
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.Наименование = &текшк";
	//|	И ШтрихКоды.ВидШК = &Доп";
	Запрос.УстановитьПараметр("ТекШК",Строка(ШтрихКод));
	//Запрос.УстановитьПараметр("Доп",перечисления.ВидыШК.Дополнительный);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() ТОгда
		#если клиент тогда
			сообщить(" Штрикод - "+ШтрихКод+" уже загружен, номенклатура - "+рез.владелец+" код - "+рез.владелец.код);
		#конецесли
		
		Используется = истина;
		возврат используется;
	КонецЕсли;
	
	
	попытка
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	РезервированиеШКGS1.ДокументРегистрации КАК ДокументРегистрации,
		|	РезервированиеШКGS1.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.РезервированиеШКGS1 КАК РезервированиеШКGS1
		|ГДЕ
		|	РезервированиеШКGS1.GS1 = &ТекШк";
		Запрос.УстановитьПараметр("ТекШК",(ШтрихКод));
		//Запрос.УстановитьПараметр("Доп",перечисления.ВидыШК.Дополнительный);
		Рез = Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() ТОгда
			#если клиент тогда
				
				сообщить(" Штрикод - "+ШтрихКод+" уже загружен в регистр. ");
			#конецесли
			
			Используется = истина;
			возврат используется;
			
		КонецЕсли;
	исключение
		#если клиент тогда
			
			сообщить(" Штрикод - "+ШтрихКод+" не загружен в регистр. ");
		#конецесли
		
		Используется = истина;
		возврат используется;
		
	конецпопытки;
	
	
	
	Возврат ложь;
	
КонецФункции
//Нечаева 25,08,20----

//Нечаева 25,08,20+++ 
Функция ПроверкаШКGS1НаПрисвоение(ШтрихКод,выводитьСообщения = истина) Экспорт
	
	Используется = ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ШтрихКоды.Владелец КАК Владелец,
	|	ШтрихКоды.Наименование КАК Наименование,
	|	ШтрихКоды.ТипШК КАК ТипШК,
	|	ШтрихКоды.ВидШК КАК ВидШК
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.Наименование = &текшк";
	//	|	И ШтрихКоды.ВидШК = &Доп";
	Запрос.УстановитьПараметр("ТекШК",Строка(ШтрихКод));
	//Запрос.УстановитьПараметр("Доп",перечисления.ВидыШК.Дополнительный);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() ТОгда
		#если клиент тогда
			Если выводитьсообщения тогда
				сообщить(" Штрикод - "+ШтрихКод+" уже используется, номенклатура - "+рез.владелец+" код - "+рез.владелец.код);
			конецЕсли;	
		#конецесли
		
		Используется = истина;
		возврат используется;
	КонецЕсли;
	
	
	
	Возврат ложь;
	
КонецФункции
//Нечаева 25,08,20----




////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ РАБОТЫ С ИНТЕРФЕЙСОМ 

#Если Клиент Тогда
	////////////////////////////////////////////////////////////////////////////////
	// ПРОЦЕДУРЫ И ФУНКЦИИ ОБРАБОТКИ ПОДБОРА В ТОРГОВЫЕ ДОКУМЕНТЫ
	
	// Универсальная процедура, которая инициирует механизм подбора
	// номенклатуры в документы (открывает основную форму обработки подбор).
	//
	// Параметры:
	//  ФормаДокумента - форма документа, в который осуществляется подбор,
	//  СтруктураПараметров - параметры, которые передаются в форму подбора.
	//
	Процедура ОткрытьПодборНоменклатуры(ФормаДокумента, СтруктураПараметров, ФормаПодбора = Неопределено) Экспорт
		
		// Добавляем обработчики в форму
		МетаданныеДокумента = ФормаДокумента.ДокументОбъект.Метаданные();
		
		Для Каждого ЭлементСтруктурыПараметров Из СтруктураПараметров Цикл
			Если ЕстьРеквизитДокумента(ЭлементСтруктурыПараметров.Ключ, МетаданныеДокумента) Тогда
				ФормаДокумента.ПодключитьОбработчикИзмененияДанных(ЭлементСтруктурыПараметров.Ключ, "ОбновитьФормуПодбора", Ложь);
			КонецЕсли;
		КонецЦикла;
		
		// Открываем форму подбора.
		ФормаПодбора = ВнешниеОбработки.ПодборНоменклатуры.ПолучитьФорму("ОсновнаяФорма", ФормаДокумента, ФормаДокумента);
		ФормаПодбора.ОбработкаОбъект.СтруктураИсходныхПараметров = СтруктураПараметров;
		ФормаПодбора.Открыть();
		
	КонецПроцедуры // ОткрытьПодборНоменклатуры()
	
	// Процедура, которая обновляет параметры подбора номенклатуры и
	// инициирует обновление формы подбора, если она открыта
	//
	// Параметры:
	//  ДокументОбъект     - объект документа, в котором производится подбор.
	//  ФормаДокумента     - форма документа, в который осуществляется подбор,
	//  ПолноеИмяРеквизита - полное имя реквизита, который изменился.
	//
	Процедура ОбновитьПараметрыИФормуПодбора(ДокументОбъект, ФормаДокумента, ПолноеИмяРеквизита) Экспорт
		
		ФормаПодбора = Обработки.ПодборНоменклатуры.ПолучитьФорму("ОсновнаяФорма", ФормаДокумента, ФормаДокумента);
		
		Если ФормаПодбора.Открыта() Тогда
			
			ИмяРеквизита = СтрЗаменить(ПолноеИмяРеквизита, "ДокументОбъект.", "");
			
			Если ФормаПодбора.ОбработкаОбъект.СтруктураИсходныхПараметров.Свойство(ИмяРеквизита) Тогда
				
				ФормаПодбора.ОбработкаОбъект.СтруктураИсходныхПараметров.Вставить(ИмяРеквизита, ДокументОбъект[ИмяРеквизита]);
				СтруктураЗапроса = ФормаПодбора.ЭлементыФормы.СписокВидовПодбора.Значение;
				Родитель         = ФормаПодбора.ПолучитьТекущегоРодителя();
				
				ФормаПодбора.ПерезаполнитьТаблицуНоменклатуры(Родитель, СтруктураЗапроса);
			КонецЕсли;
		КонецЕсли;
		
	КонецПроцедуры // ОбновитьПараметрыИФормуПодбора()
#КонецЕсли

// +++ 2012-01-18, Родионов, "заполнение первичной группы номенклатуры при приемке ПНК"
// Процедура заполняет в номенклатуре из в таб.части Товары реквизит ПервичнаяГруппа 
// значением текущей группы номенклатуры. Реквизит ПервичнаяГруппа заполняется только
// в том случае, если он ещё не заполнен.
//
Процедура ЗаполнитьПервичнуюГруппуНоменклатуры(МассивНоменклатуры)	Экспорт
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "
	|ВЫБРАТЬ
	|	Ссылка,
	|	Родитель
	|ИЗ
	|	Справочник.Номенклатура
	|ГДЕ
	|	Ссылка В(&СписокНоменклатуры)
	|	И ПервичнаяГруппа = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("СписокНоменклатуры",МассивНоменклатуры);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		// нет номенклатуры для обработки
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СпрОбъект.ОбменДанными.Загрузка = Истина; // чтобы избежать лишних проверок
		СпрОбъект.ПервичнаяГруппа = СпрОбъект.Родитель; // Выборка.Родитель;
		СпрОбъект.Записать();
	КонецЦикла;	
КонецПроцедуры // ЗаполнитьПервичнуюГруппуНоменклатуры()
// "заполнение первичной группы номенклатуры при приемке ПНК", Родионов, 2012-01-18 +++


//крохин начало 14.02.2013
//заполнение импортера и ГТД в комплектах
Процедура ЗаполнитьИмпортераКМПЛ(Документ)  Экспорт
	
	ТЗ = Документ.Комплектующие.Выгрузить(,"Продукция,Номенклатура");
	ТЗНовыхГТД = Новый ТаблицаЗначений;
	ТЗНовыхГТД.Колонки.Добавить("Номенклатура");
	ТЗНовыхГТД.Колонки.Добавить("ГТД");
	Для Каждого СтрокаТЗ ИЗ ТЗ Цикл
		СтрокаТЗ.Номенклатура = СтрокаТЗ.Номенклатура.Родитель;	
		СтрокаТЗ.Продукция = СтрокаТЗ.Продукция.Родитель;	
	КонецЦикла;
	ТЗ.Свернуть("Продукция,Номенклатура");
	ТЗ.Колонки.Добавить("ГТД");
	ТЗ.Колонки.Добавить("БылГТД");
	СписокПродукции = Новый СписокЗначений;
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		Если СписокПродукции.НайтиПоЗначению(СтрокаТЗ.Продукция) <> Неопределено Тогда Продолжить КонецЕсли;
		ГТД = ПолучитьГрупповойПериодическийРеквизит(СтрокаТЗ.Номенклатура,"НомерГТД",Документ.Дата);
		//			БылГТД = ПолучитьГрупповойПериодическийРеквизит(СтрокаТЗ.Продукция,"НомерГТД",Документ.Дата);
		//Кухарь 31.05.18 начало
		//иногда затираются нужные ГТД
		//Если ГТД <> Неопределено Тогда 
		если гтд<>Неопределено тогда
			ДатаНовогоГТД=сред(гтд.Наименование,Найти(гтд.Наименование,"/")+1,6);
			попытка
				ДатаНовогоГТД=Дата("20"+Прав(ДатаНовогоГТД,2)+Сред(ДатаНовогоГТД,3,2)+Лев(ДатаНовогоГТД,2));
			Исключение
				ДатаНовогоГТД=ПустаяДата();
			КонецПопытки;
		иначе
			ДатаНовогоГТД=ПустаяДата();
		КонецЕсли;	
		
		ГТДСтарый=ПолучитьГрупповойПериодическийРеквизит(СтрокаТЗ.продукция,"НомерГТД",Документ.Дата-1);
		если ГТДСтарый<>Неопределено тогда
			ДатаСтарогоГТД=сред(ГТДСтарый.Наименование,Найти(ГТДСтарый.Наименование,"/")+1,6);
			
			попытка
				ДатаСтарогоГТД=Дата("20"+Прав(ДатаСтарогоГТД,2)+Сред(ДатаСтарогоГТД,3,2)+Лев(ДатаСтарогоГТД,2));
			Исключение
				ДатаСтарогоГТД=ПустаяДата();
			КонецПопытки;
		иначе
			ДатаСтарогоГТД=ПустаяДата();
		КонецЕсли;
		Если ГТД <> Неопределено и (ДатаНовогоГТД> ДатаСтарогоГТД или (ДатаНовогоГТД=ПустаяДата() и ДатаСтарогоГТД=ПустаяДата())) Тогда 
			
			//Кухарь 31.05.18 конец
			
			СтрокаТЗНовыхГТД = ТЗНовыхГТД.Добавить();
			СтрокаТЗНовыхГТД.Номенклатура = СтрокаТЗ.Продукция;
			СтрокаТЗНовыхГТД.ГТД = ГТД;
		КонецЕсли;
		
		СписокПродукции.Добавить(СтрокаТЗ.продукция);
	КонецЦикла;
	Если ТЗНовыхГТД.Количество() > 0 Тогда
		НЗ=РегистрыСведений.История.СоздатьНаборЗаписей();
		//крохин начало
		//ГТД записываем датой из ГТД, а не из документа 
		НЗ.Отбор.Период.Установить(Документ.Дата,Истина);
		
		//крохин конец
		//НЗ.Отбор.Реквизит.Установить("НомерГТД",Истина);
		НЗ.Отбор.Документ.Установить(Документ.Ссылка,Истина);
		
		Для Каждого СтрокаГТД Из ТЗНовыхГТД Цикл
			Если НЕ СтрокаГТД.ГТД.Пустая() И НЕ СтрокаГТД.Номенклатура.Пустая() Тогда
				Запись=НЗ.Добавить();
				//крохин начало
				//ГТД записываем датой из ГТД, а не из документа 
				//	Запись.Период		=Дата;
				Запись.Период		=Документ.Дата;
				//крохин конец
				Запись.Объект		=СтрокаГТД.Номенклатура;
				Запись.Реквизит		="НомерГТД";
				Запись.Документ		=Документ.Ссылка;		
				
				Запись.Значение		=СтрокаГТД.ГТД;			
				
				Запись.Регистратор	=Документ.Ссылка;			
			КонецЕсли;	
		КонецЦикла;
		НЗ.Записать();
	КонецЕсли;
	
КонецПроцедуры

//крохин конец 14.02.2013

//крохин начало 24.09.2013
//заполнение импортера и ГТД в комплектах
Процедура ЗаполнитьИмпортераКМПЛРНК(Документ)  Экспорт
	
	ТЗ = Документ.Комплектующие.Выгрузить(,"Продукция,Номенклатура");
	ТЗНовыхГТД = Новый ТаблицаЗначений;
	ТЗНовыхГТД.Колонки.Добавить("Номенклатура");
	ТЗНовыхГТД.Колонки.Добавить("ГТД");
	
	ДатаДокумента=ПолучитьРеквизитШапки(Документ,"Дата","Документ");
	запрос=новый запрос;
					// | &ТЗ как ТЗ
 //|	Документ.РасходнаяНакладная.Комплектующие КАК ТЗ

	запрос.Текст="ВЫБРАТЬ
	             |	ТЗ.Номенклатура КАК Номенклатура,
	             |	ТЗ.Продукция КАК Продукция
	             |ПОМЕСТИТЬ ВремТЗ
	             |ИЗ
	             | &ТЗ как ТЗ
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ИсторияСрезПоследних.Значение КАК ГТД,
	             |	ИсторияСрезПоследних.Объект КАК Продукция,
	             |	ИсторияСрезПоследних.Период КАК Период
	             |ПОМЕСТИТЬ ГТДПродукции
	             |ИЗ
	             |	РегистрСведений.История.СрезПоследних(
	             |			&Дата2,
	             |			Объект В
	             |					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |						ВремТЗ.Продукция.Родитель
	             |					ИЗ
	             |						ВремТЗ КАК ВремТЗ
	             |					ГДЕ
	             |						ВремТЗ.Продукция.Родитель.ВидКомплекта В (&СписокВидовКомлекта))
	             |				И Реквизит = ""НомерГТД"") КАК ИсторияСрезПоследних
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ИсторияСрезПоследних.Объект,
	             |	ИсторияСрезПоследних.Значение,
	             |	ИсторияСрезПоследних.Период
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ИсторияСрезПоследних.Значение КАК ГТД,
	             |	ИсторияСрезПоследних.Объект КАК Номенклатура,
	             |	ИсторияСрезПоследних.Период КАК Период
	             |ПОМЕСТИТЬ ГТДНоменклатуры
	             |ИЗ
	             |	РегистрСведений.История.СрезПоследних(
	             |			&Дата1,
	             |			Объект В
	             |					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |						ВремТЗ.Номенклатура.Родитель
	             |					ИЗ
	             |						ВремТЗ КАК ВремТЗ
	             |					ГДЕ
	             |						ВремТЗ.Продукция.Родитель.ВидКомплекта В (&СписокВидовКомлекта))
	             |				И Реквизит = ""НомерГТД"") КАК ИсторияСрезПоследних
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ГТДПродукции.Продукция КАК Продукция,
	             |	МАКСИМУМ(ГТДПродукции.Период) КАК Период
	             |ПОМЕСТИТЬ ГТДПродМакс
	             |ИЗ
	             |	ГТДПродукции КАК ГТДПродукции
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ГТДПродукции.Продукция
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ГТДНоменклатуры.Номенклатура КАК Номенклатура,
	             |	МАКСИМУМ(ГТДНоменклатуры.Период) КАК Период
	             |ПОМЕСТИТЬ ГТДНомМакс
	             |ИЗ
	             |	ГТДНоменклатуры КАК ГТДНоменклатуры
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ГТДНоменклатуры.Номенклатура
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	МАКСИМУМ(ГТДПродукции.ГТД) КАК ГТД,
	             |	ГТДПродМакс.Продукция КАК Продукция
	             |ПОМЕСТИТЬ ГТДПродФин
	             |ИЗ
	             |	ГТДПродМакс КАК ГТДПродМакс
	             |		ЛЕВОЕ СОЕДИНЕНИЕ ГТДПродукции КАК ГТДПродукции
	             |		ПО ГТДПродМакс.Продукция = ГТДПродукции.Продукция
	             |			И ГТДПродМакс.Период = ГТДПродукции.Период
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ГТДПродМакс.Продукция
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ГТДНомМакс.Номенклатура КАК Номенклатура,
	             |	МАКСИМУМ(ГТДНоменклатуры.ГТД) КАК ГТД
	             |ПОМЕСТИТЬ ГТДНомФин
	             |ИЗ
	             |	ГТДНомМакс КАК ГТДНомМакс
	             |		ЛЕВОЕ СОЕДИНЕНИЕ ГТДНоменклатуры КАК ГТДНоменклатуры
	             |		ПО ГТДНомМакс.Номенклатура = ГТДНоменклатуры.Номенклатура
	             |			И ГТДНомМакс.Период = ГТДНоменклатуры.Период
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ГТДНомМакс.Номенклатура
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ВремТЗ.Номенклатура.Родитель КАК Номенклатура,
	             |	ВремТЗ.Продукция.Родитель КАК Продукция,
	             |	ГТДПродукции.ГТД КАК ГТДСтарый,
	             |	ГТДНоменклатуры.ГТД КАК ГТД
	             |ПОМЕСТИТЬ ГотовыеДанные
	             |ИЗ
	             |	ВремТЗ КАК ВремТЗ
	             |		ЛЕВОЕ СОЕДИНЕНИЕ ГТДПродФин КАК ГТДПродукции
	             |		ПО ВремТЗ.Продукция.Родитель = ГТДПродукции.Продукция
	             |		ЛЕВОЕ СОЕДИНЕНИЕ ГТДНомФин КАК ГТДНоменклатуры
	             |		ПО ВремТЗ.Номенклатура.Родитель = ГТДНоменклатуры.Номенклатура
	             |ГДЕ
	             |	ВремТЗ.Продукция.Родитель.ВидКомплекта В(&СписокВидовКомлекта)
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ГотовыеДанные.Номенклатура КАК Номенклатура,
	             |	ГотовыеДанные.Продукция КАК Продукция,
	             |	ВЫБОР
	             |		КОГДА ГотовыеДанные.ГТД ССЫЛКА Справочник.ГТД
	             |			ТОГДА ВЫРАЗИТЬ(ГотовыеДанные.ГТД КАК Справочник.ГТД).Наименование
	             |	КОНЕЦ КАК НаименованиеГТД,
	             |	ВЫБОР
	             |		КОГДА ГотовыеДанные.ГТДСтарый ССЫЛКА Справочник.ГТД
	             |			ТОГДА ВЫРАЗИТЬ(ГотовыеДанные.ГТДСтарый КАК Справочник.ГТД).Наименование
	             |	КОНЕЦ КАК НаименованиеГТДСтарый,
	             |	ГотовыеДанные.ГТДСтарый КАК ГТДСтарый,
	             |	ГотовыеДанные.ГТД КАК ГТД
	             |ИЗ
	             |	ГотовыеДанные КАК ГотовыеДанные
	             |ГДЕ
	             |	НЕ ГотовыеДанные.ГТД ЕСТЬ NULL";
	запрос.УстановитьПараметр("ТЗ",ТЗ);	
	запрос.УстановитьПараметр("Дата2",ДатаДокумента);
	запрос.УстановитьПараметр("Дата1",ДатаДокумента-1);
	запрос.УстановитьПараметр("ПустаяДата",ПустаяДата());
	СписокВидовКомлекта=новый СписокЗначений;
	СписокВидовКомлекта.Добавить(Перечисления.ВидыКомплектов.Ассортито);
	СписокВидовКомлекта.Добавить(Перечисления.ВидыКомплектов.Комплект);
	запрос.УстановитьПараметр("СписокВидовКомлекта",СписокВидовКомлекта);
	
	
	ТЗ=запрос.Выполнить().Выгрузить();
	СписокПродукции = Новый СписокЗначений;
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		Если СписокПродукции.НайтиПоЗначению(СтрокаТЗ.Продукция) <> Неопределено Тогда Продолжить КонецЕсли;
		ГТД=СтрокаТЗ.ГТД;
		НаименованиеГТД=СтрокаТЗ.НаименованиеГТД;
		ГТДСтарый=СтрокаТЗ.ГТДСтарый;
		НаименованиеСтарогоГТД=СтрокаТЗ.НаименованиеГТДСтарый;
		если ГТД=ГТДСтарый тогда Продолжить;КонецЕсли;
		
		если ЗначениеЗаполнено(ГТД) тогда
			ДатаНовогоГТД=сред(НаименованиеГТД,Найти(НаименованиеГТД,"/")+1,6);
			попытка
				ДатаНовогоГТД=Дата("20"+Прав(ДатаНовогоГТД,2)+Сред(ДатаНовогоГТД,3,2)+Лев(ДатаНовогоГТД,2));
			Исключение
				ДатаНовогоГТД=ПустаяДата();
			КонецПопытки;
		иначе
			ДатаНовогоГТД=ПустаяДата();
		КонецЕсли;	
		
		если ЗначениеЗаполнено(ГТДСтарый) тогда
			ДатаСтарогоГТД=сред(НаименованиеСтарогоГТД,Найти(НаименованиеСтарогоГТД,"/")+1,6);
			
			попытка
				ДатаСтарогоГТД=Дата("20"+Прав(ДатаСтарогоГТД,2)+Сред(ДатаСтарогоГТД,3,2)+Лев(ДатаСтарогоГТД,2));
			Исключение
				ДатаСтарогоГТД=ПустаяДата();
			КонецПопытки;
		иначе
			ДатаСтарогоГТД=ПустаяДата();
		КонецЕсли;
		
		Если ГТД <> Неопределено и (ДатаНовогоГТД> ДатаСтарогоГТД или (ДатаНовогоГТД=ПустаяДата() и ДатаСтарогоГТД=ПустаяДата())) Тогда
			СтрокаТЗНовыхГТД = ТЗНовыхГТД.Добавить();
			СтрокаТЗНовыхГТД.Номенклатура = СтрокаТЗ.Продукция;
			СтрокаТЗНовыхГТД.ГТД = ГТД;
			СписокПродукции.Добавить(СтрокаТЗ.продукция);
		КонецЕсли;
		

	КонецЦикла;	
	
	
	
	
	
	Если ТЗНовыхГТД.Количество() > 0 Тогда
		НЗ=РегистрыСведений.История.СоздатьНаборЗаписей();
		//крохин начало
		//ГТД записываем датой из ГТД, а не из документа 
		НЗ.Отбор.Период.Установить(Документ.Дата,Истина);
		
		//крохин конец
		//НЗ.Отбор.Реквизит.Установить("НомерГТД",Истина);
		НЗ.Отбор.Документ.Установить(Документ.Ссылка,Истина);
		
		Для Каждого СтрокаГТД Из ТЗНовыхГТД Цикл
			Если НЕ СтрокаГТД.ГТД.Пустая() И НЕ СтрокаГТД.Номенклатура.Пустая() Тогда
				Запись=НЗ.Добавить();
				//крохин начало
				//ГТД записываем датой из ГТД, а не из документа 
				//	Запись.Период		=Дата;
				Запись.Период		=Документ.Дата;
				//крохин конец
				Запись.Объект		=СтрокаГТД.Номенклатура;
				Запись.Реквизит		="НомерГТД";
				Запись.Документ		=Документ.Ссылка;		
				
				Запись.Значение		=СтрокаГТД.ГТД;			
				
				Запись.Регистратор	=Документ.Ссылка;			
			КонецЕсли;	
		КонецЦикла;
		НЗ.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Кухарь А.Ю.  14.02.2024 начало
// Удалить в 2025. Вызовы этой процедуры отключены. При включении дополнить этот комментарий
Процедура ЗаполнитьИмпортераКМПЛРНК14022024Отключена(Документ)  Экспорт
	
	ТЗ = Документ.Комплектующие.Выгрузить(,"Продукция,Номенклатура");
	ТЗНовыхГТД = Новый ТаблицаЗначений;
	ТЗНовыхГТД.Колонки.Добавить("Номенклатура");
	ТЗНовыхГТД.Колонки.Добавить("ГТД");
	Для Каждого СтрокаТЗ ИЗ ТЗ Цикл
		СтрокаТЗ.Номенклатура = СтрокаТЗ.Номенклатура.Родитель;	
		СтрокаТЗ.Продукция = СтрокаТЗ.Продукция.Родитель;	
	КонецЦикла;
	ТЗ.Свернуть("Продукция,Номенклатура");
	ТЗ.Колонки.Добавить("ГТД");
	ТЗ.Колонки.Добавить("БылГТД");
	СписокПродукции = Новый СписокЗначений;
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		Если СписокПродукции.НайтиПоЗначению(СтрокаТЗ.Продукция) <> Неопределено Тогда Продолжить КонецЕсли;
		ГТД = ПолучитьГрупповойПериодическийРеквизит(СтрокаТЗ.Номенклатура,"НомерГТД",Документ.Дата);
		//			БылГТД = ПолучитьГрупповойПериодическийРеквизит(СтрокаТЗ.Продукция,"НомерГТД",Документ.Дата);
		//Кухарь 31.05.18 начало
		//иногда затираются нужные ГТД
		//Если ГТД <> Неопределено Тогда 
		если гтд<>Неопределено тогда
			ДатаНовогоГТД=сред(гтд.Наименование,Найти(гтд.Наименование,"/")+1,6);
			попытка
				ДатаНовогоГТД=Дата("20"+Прав(ДатаНовогоГТД,2)+Сред(ДатаНовогоГТД,3,2)+Лев(ДатаНовогоГТД,2));
			Исключение
				ДатаНовогоГТД=ПустаяДата();
			КонецПопытки;
		иначе
			ДатаНовогоГТД=ПустаяДата();
		КонецЕсли;	
		
		ГТДСтарый=ПолучитьГрупповойПериодическийРеквизит(СтрокаТЗ.продукция,"НомерГТД",Документ.Дата-1);
		если ГТДСтарый<>Неопределено тогда
			ДатаСтарогоГТД=сред(ГТДСтарый.Наименование,Найти(ГТДСтарый.Наименование,"/")+1,6);
			
			попытка
				ДатаСтарогоГТД=Дата("20"+Прав(ДатаСтарогоГТД,2)+Сред(ДатаСтарогоГТД,3,2)+Лев(ДатаСтарогоГТД,2));
			Исключение
				ДатаСтарогоГТД=ПустаяДата();
			КонецПопытки;
		иначе
			ДатаСтарогоГТД=ПустаяДата();
		КонецЕсли;
		Если ГТД <> Неопределено и (ДатаНовогоГТД> ДатаСтарогоГТД или (ДатаНовогоГТД=ПустаяДата() и ДатаСтарогоГТД=ПустаяДата())) Тогда
			
			//Кухарь 31.05.18 конец
			
			СтрокаТЗНовыхГТД = ТЗНовыхГТД.Добавить();
			СтрокаТЗНовыхГТД.Номенклатура = СтрокаТЗ.Продукция;
			СтрокаТЗНовыхГТД.ГТД = ГТД;
		КонецЕсли;
		
		СписокПродукции.Добавить(СтрокаТЗ.продукция);
	КонецЦикла;
	Если ТЗНовыхГТД.Количество() > 0 Тогда
		НЗ=РегистрыСведений.История.СоздатьНаборЗаписей();
		//крохин начало
		//ГТД записываем датой из ГТД, а не из документа 
		НЗ.Отбор.Период.Установить(Документ.Дата,Истина);
		
		//крохин конец
		//НЗ.Отбор.Реквизит.Установить("НомерГТД",Истина);
		НЗ.Отбор.Документ.Установить(Документ.Ссылка,Истина);
		
		Для Каждого СтрокаГТД Из ТЗНовыхГТД Цикл
			Если НЕ СтрокаГТД.ГТД.Пустая() И НЕ СтрокаГТД.Номенклатура.Пустая() Тогда
				Запись=НЗ.Добавить();
				//крохин начало
				//ГТД записываем датой из ГТД, а не из документа 
				//	Запись.Период		=Дата;
				Запись.Период		=Документ.Дата;
				//крохин конец
				Запись.Объект		=СтрокаГТД.Номенклатура;
				Запись.Реквизит		="НомерГТД";
				Запись.Документ		=Документ.Ссылка;		
				
				Запись.Значение		=СтрокаГТД.ГТД;			
				
				Запись.Регистратор	=Документ.Ссылка;			
			КонецЕсли;	
		КонецЦикла;
		НЗ.Записать();
	КонецЕсли;
	
КонецПроцедуры 


//крохин конец 24.09.2013
//кухарь 10.04.14 начало
Процедура ОбнулитьЦеныВТабЧасти(ТабличнаяЧасть,ДокОбъект) экспорт
	для каждого СтрокаТЧ из ТабличнаяЧасть цикл
		СтрокаТЧ.Цена=0;
		СтрокаТЧ.ЦенаБезСкидки=0;
		СтрокаТЧ.Сумма=0;
		СтрокаТЧ.НДС=0;
		СтрокаТЧ.Всего=0;
		СтрокаТЧ.ВсегоБезСкидки=0;
		Если ДокОбъект.Метаданные().имя="РасходнаяНакладная" тогда
			СтрокаТЧ.ЦенаБезБонуса=0;
			СтрокаТЧ.ВсегоБезБонуса=0;			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
//кухарь 10.04.14 конец

//Катаев+ 05/06/14
Процедура РассчитатьТоварыПоДаннымКлиента(СтрокаТЧ, НайденнаяСтрока, ДокументОбъект) Экспорт
	Если НайденнаяСтрока.Количество = 0 Тогда
		строкаТЧ.Всего = 0;
	Иначе
		строкаТЧ.Всего = НайденнаяСтрока.Всего*НайденнаяСтрока.КоличествоФакт/НайденнаяСтрока.Количество;
	КонецЕсли;
	
	ИмяТабличнойЧасти 			= ПолучитьИмяТабличнойЧастиПоСсылкеНаСтроку(СтрокаТЧ);
	МетаданныеДокумента 		= ДокументОбъект.Метаданные();
	СкидкаТЧ=?(ЕстьРеквизитТабЧастиДокумента("Скидка",МетаданныеДокумента,ИмяТабличнойЧасти),СтрокаТЧ.Скидка,0);
	Если СкидкаТЧ=0 Тогда
		Скидка=?(ЕстьРеквизитДокумента("Скидка",МетаданныеДокумента),ДокументОбъект.Скидка,0);
	Иначе
		Если СкидкаТЧ>0 Тогда				
			Скидка=СкидкаТЧ;
			Если ЕстьРеквизитДокумента("ДопСкидкаНаНакладную",МетаданныеДокумента) И ДокументОбъект.ДопСкидкаНаНакладную Тогда
				Скидка=Скидка+ДокументОбъект.Скидка;
			КонецЕсли; 
		Иначе
			//крохин начало 23.04.2012
			//для Беларуси, скидки могут быть отрицательными
			//	Скидка=0;
			Если СкидкаТЧ = -1 Тогда
				Скидка=0;
			Иначе
				Скидка=СкидкаТЧ;
				Если ЕстьРеквизитДокумента("ДопСкидкаНаНакладную",МетаданныеДокумента) И ДокументОбъект.ДопСкидкаНаНакладную Тогда
					Скидка=Скидка+ДокументОбъект.Скидка;
				КонецЕсли;
			КонецЕсли;
			//крохин конец 23.04.2012
		КонецЕсли;		
	КонецЕсли;	
	
	//нечаева 03,06,15+++
	// для оптовых клиентов увеличиваем тип скидок
	Если ЕстьРеквизитДокумента("ТипСкидок",МетаданныеДокумента) Тогда
		Если  НЕ ДокументОбъект.ТипСкидок.пустая() Тогда
			
			ДопСкидкаОпт = ПолучитьСкидкуНоменклатуры(СтрокаТЧ.Номенклатура,ДокументОбъект.ТипСкидок,ДокументОбъект.Дата,);	 
			Если ДопСкидкаОпт = Неопределено Тогда
				ДопСкидкаОпт = 0;
			КонецЕсли;	
			Скидка = Скидка+ДопСкидкаОпт;
			
		КонецЕсли;	
	КонецЕсли;
	//нечаева 03,06,15---
	
	
	Если ЕстьРеквизитТабЧастиДокумента("СтавкаНДС",ДокументОбъект.Метаданные(),ИмяТабличнойЧасти) Тогда
		СтавкаНДС=ПроцентНДСпоСтавке(СтрокаТЧ.СтавкаНДС);
		
		СтрокаТЧ.НДС	=СтрокаТЧ.Всего*СтавкаНДС/(1+СтавкаНДС);			
		СтрокаТЧ.Сумма  =СтрокаТЧ.Всего-СтрокаТЧ.НДС;
	КонецЕсли;
	
	Если ЕстьРеквизитТабЧастиДокумента("ЦенаБезСкидки",МетаданныеДокумента,ИмяТабличнойЧасти) Тогда
		Если НайденнаяСтрока.Количество = 0 Тогда
			ЦенаБезСкидки = 0;
		Иначе
			ЦенаБезСкидки	=НайденнаяСтрока.Всего/НайденнаяСтрока.Количество/(1-Скидка/100);
		КонецЕсли;
		СтрокаТЧ.ЦенаБезСкидки = ЦенаБезСкидки;
		СтрокаТЧ.ВсегоБезСкидки =ЦенаБезСкидки*СтрокаТЧ.Количество;
	КонецЕсли;		
Конецпроцедуры
//Катаев- 05/06/14


//Кухарь 06.12.18 начало
Функция ПроверитьЗаполнитьЦеныПРМПоСебестоимостиФранч (ДокОбъект) экспорт
	// Кухарь А.Ю.  02.08.2022 начало
	// Для ЦО проверка не нужна
	если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
		возврат Истина;
	КонецЕсли;
	// Кухарь А.Ю.  02.08.2022 конец
	
	
	если ложь тогда ДокОбъект=Документы.Перемещение.ПустаяСсылка().ПолучитьОбъект();КонецЕсли;
	если ДокОбъект.Ссылка=Документы.Перемещение.ПустаяСсылка() тогда
		СообщитьИзМодуля("Сначала запишите ПРМ");
		возврат ложь;
	КонецЕсли;
	
	Граница=Последовательности.Товары.ПолучитьГраницу();   
	//Кухарь 12.12.18 начало
	//Конфигураторная ошибка	
	//если Граница.Дата<ДокОбъект.Ссылка.дата тогда	
	если Граница.Ссылка.Дата<ДокОбъект.Ссылка.дата тогда
		//Кухарь 12.12.18 конец		
		СообщитьИзМодуля("Перед отгрузкой проведите базу");
		возврат ложь;
	КонецЕсли;
	
	Товары=ДокОбъект.Товары;
	ЕстьСебестоимость=Истина;
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ПеремещениеТовары.Номенклатура
	|ПОМЕСТИТЬ т1
	|ИЗ
	|	Документ.Перемещение.Товары КАК ПеремещениеТовары
	|ГДЕ
	|	ПеремещениеТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СРЕДНЕЕ(ВЫБОР
	|			КОГДА ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) = 0
	|				ТОГДА 0
	|			ИНАЧЕ ЕСТЬNULL(ОстаткиТМЦОстатки.СуммаОстаток, 0) / ОстаткиТМЦОстатки.КоличествоОстаток
	|		КОНЕЦ) КАК Себестоимость,
	|	т1.Номенклатура
	|ИЗ
	|	т1 КАК т1
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(&Дата2, Склад = &Склад) КАК ОстаткиТМЦОстатки
	|		ПО т1.Номенклатура = ОстаткиТМЦОстатки.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	т1.Номенклатура";
	запрос.УстановитьПараметр("Ссылка",ДокОбъект.Ссылка);
	//Кухарь 12.12.18 начало
	//Конфигураторная ошибка
	запрос.УстановитьПараметр("Дата2",ДокОбъект.Дата);
	запрос.УстановитьПараметр("Склад",ДокОбъект.склад);
	//Кухарь 12.12.18 конец	
	Результат=запрос.Выполнить().Выгрузить();		
	Для каждого СтрТЧ из Товары цикл
		СтрТЗ=Результат.Найти(СтрТЧ.Номенклатура);
		если СтрТЗ=Неопределено   тогда 	
			СтрТЧ.Цена=0;
			Продолжить;
		КонецЕсли;	
		Себестоимость=СтрТЗ.Себестоимость;
		СтрТЧ.Цена=Себестоимость;
		СтрТЧ.ЦенаБезСкидки=Себестоимость;		
		СтрТЧ.Себестоимость=Себестоимость*СтрТЧ.Количество;	
	КонецЦикла;
	
	Отбор=новый Структура("Цена",0);
	МассСтрокТЧ=Товары.НайтиСтроки(Отбор);
	Для каждого СтрТЧ из МассСтрокТЧ цикл
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПеремещениеТовары.Себестоимость КАК Себестоимость,
		|	ПеремещениеТовары.Цена КАК Цена,
		|	ПеремещениеТовары.Количество КАК Количество
		|ИЗ
		|	Документ.Перемещение.Товары КАК ПеремещениеТовары
		|ГДЕ
		|	ПеремещениеТовары.Номенклатура = &Номенклатура
		|	И ПеремещениеТовары.Ссылка.Проведен
		|	И ПеремещениеТовары.Ссылка.СкладПолучатель = &СкладПолучатель
		|	И ПеремещениеТовары.Количество > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПеремещениеТовары.Ссылка.Дата";
		запрос.УстановитьПараметр("Номенклатура",СтрТЧ.Номенклатура);
		запрос.УстановитьПараметр("СкладПолучатель",ДокОбъект.Склад);
		Результат=запрос.Выполнить().Выбрать();
		пока Результат.Следующий() цикл
			Себестоимость=?(Результат.Себестоимость=0,Результат.Цена,Результат.Себестоимость/Результат.Количество);
			СтрТЧ.Цена=Себестоимость;
			СтрТЧ.ЦенаБезСкидки=Себестоимость;		
			СтрТЧ.Себестоимость=Себестоимость*СтрТЧ.Количество;
			//Кухарь 13.12.18 начало
			//Иногда цены всё ещё пустые
			ЗаполнитьЦенуНоменклатурыТабЧасти(СтрТЧ, ДокОбъект);
			//Кухарь 13.12.18 конец
		КонецЦикла;
	КонецЦикла;
	
	МассСтрокТЧ=Товары.НайтиСтроки(Отбор);
	Для каждого СтрТЧ из МассСтрокТЧ цикл
		СообщитьИзМодуля("Нулевая цена на "+СтрТЧ.номенклатура.наименование);
		ЕстьСебестоимость=Ложь;
	КонецЦикла;
	
	Возврат ЕстьСебестоимость;
КонецФункции

//Кухарь 06.12.18 конец

// Кухарь А.Ю. 13.05.2022 начало 
Процедура ЗаполнитьКоличествоКомплектующихПоСтроке (СтрокаТЧ) экспорт
	РеквизитыНоменклатуры=ПолучитьРеквизитыШапки(СтрокаТЧ.Номенклатура,"Родитель.ШтукВКомплекте,Родитель.ВидНоменклатуры","Справочник");
	КратностьКомплектующих=РеквизитыНоменклатуры.Родитель_ШтукВКомплекте;
	ВидНоменклатуры=РеквизитыНоменклатуры.Родитель_ВидНоменклатуры;
	если ВидНоменклатуры=Перечисления.ВидыНоменклаутры.Товар Тогда		
		//++Данилова Е.В. 27.01.2025
		//Если КратностьКомплектующих=0 тогда КратностьКомплектующих=1;КонецЕсли;
		Если КратностьКомплектующих = 0 
			ИЛИ ЗначениеРеквизитаОбъекта(СтрокаТЧ.Номенклатура,"ВидКомплекта") = Перечисления.ВидыКомплектов.ГотовыйКомплект тогда
			КратностьКомплектующих = 1;
		КонецЕсли;
		//--Данилова Е.В. 27.01.2025
		СтрокаТЧ.КоличествоКомплектующих=СтрокаТЧ.Количество* КратностьКомплектующих;
	иначе
		СтрокаТЧ.КоличествоКомплектующих=0;
	КонецЕсли;
КонецПроцедуры	 
// Кухарь А.Ю. 13.05.2022 конец
