&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	рПроверки = ПроверитьДокументыКОбработке(ПараметрКоманды);
	
	Для Каждого ТекстОшибки Из рПроверки.ОшибкиДокументов Цикл
		Сообщить(ТекстОшибки, СтатусСообщения.Важное);	
	КонецЦикла;
	
	ИспользоватьЗадачи = Истина;
	Для Каждого ДокСсылка Из рПроверки.ДокументыКОбработке Цикл
		Если ИспользоватьЗадачи Тогда
			рДобавления = ДобавитьЗадачу_ЗаписьКодов(ДокСсылка);
			Если рДобавления.Успешно Тогда
				Сообщить("Создана задача загрузки кодов по документу: " + ДокСсылка,  СтатусСообщения.Информация);
			Иначе
				МаркировкаКС.ВывестиОшибки(рДобавления);		
			КонецЕсли;
		Иначе
			ЗаписатьКодыВФоне(ДокСсылка);
		КонецЕсли;		 
	КонецЦикла;	
	
	Если рПроверки.ДокументыКОбработке.Количество() = 0 Тогда
		Сообщить("Не найдено подходящих документов для обработки.", СтатусСообщения.Внимание);	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Функция ЗаписатьКодыВФоне(ДокСсылка)	
	МассивИД = МаркировкаВС.ПолучитьМассивЗаписейЗагрузкиКМ(ДокСсылка);
	
	Если МассивИД.Количество() > 0 Тогда
		пПроцедуры = Новый Массив;
		пПроцедуры.Добавить(МассивИД);	//МассивИД
		пПроцедуры.Добавить(Ложь);		//ПерезаписыватьКМ
		
		пВыполнения = инт_ДлительныеОперации.ПараметрыВыполненияФункции(Новый УникальныйИдентификатор);
		
		рЗапуска = инт_ДлительныеОперации.ВыполнитьВФоне("Обработка.АпиЧЗ.ЗагрузитьКодыИзЛогов", пПроцедуры, пВыполнения);	
		
		Если рЗапуска.Статус = "Ошибка" Тогда
			Сообщить(рЗапуска.ПодробноеПредставлениеОшибки, СтатусСообщения.Важное);
			Возврат Неопределено;
		КонецЕсли; 
		
		пОжидания = инт_ДлительныеОперацииК.ПараметрыОжидания(ЭтотОбъект);
		пОжидания.ВыводитьПрогрессВыполнения = Истина;
		пОжидания.Заголовок = "Запись кодов маркировки ЧЗ";
		
		ооЗавершение = Новый ОписаниеОповещения("ОжиданиеЗавершенияФЗ", ЭтотОбъект, Новый Структура("ЗаказНаЭмиссию", ДокСсылка));
		
		инт_ДлительныеОперацииК.ОжидатьЗавершение(рЗапуска, ооЗавершение, пОжидания);			
	Иначе
		Сообщить("Не обнаружено полученных кодов по документу: '" + ДокСсылка + "' !", СтатусСообщения.Внимание);								
	КонецЕсли;	
КонецФункции //ЗаписатьКодыВФоне(ДокСсылка)

&НаКлиенте
Процедура ОжиданиеЗавершенияФЗ(Результат = Неопределено, ДопПараметры = Неопределено) Экспорт
	Если ТипЗнч(Результат) = Тип("Структура") Тогда		
		Если Результат.Статус = "Выполнено" Тогда
			ЗаказНаЭмиссию = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ЗаказНаЭмиссию");			
			рОбработки = ОбновитьКоличествоПолученныхКодов(ЗаказНаЭмиссию);			
			Если рОбработки.Успешно Тогда
				МаркировкаК.ВывестиСообщения(рОбработки, СтатусСообщения.Информация);					
			КонецЕсли; 
		ИначеЕсли Результат.Статус = "Ошибка" Тогда
			Сообщить(Результат.ПодробноеПредставлениеОшибки, СтатусСообщения.Важное);		
		КонецЕсли;	
	Иначе
		Сообщить("Некорректный тип результата фонового задания: " + ТипЗнч(Результат)+" ! Ожидаемый тип: 'Структура' !", СтатусСообщения.Важное);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПроверитьДокументыКОбработке(мСсылки)
	Результат = Новый Структура("ОшибкиДокументов,ДокументыКОбработке", Новый Массив, Новый Массив, Новый Массив);
	
	Для Каждого ДокСсылка Из мСсылки Цикл			
		рПроверки = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ПроверитьДокументПередЗаписьюКМ(ДокСсылка);
		Если рПроверки.Успешно Тогда
			Результат.ДокументыКОбработке.Добавить(ДокСсылка);
		Иначе
			МаркировкаКС.ДобавитьОшибки(Результат.ОшибкиДокументов, рПроверки);				
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции //ПроверитьДокументыКОбработке(мСсылки)

&НаСервере
Функция ОбновитьКоличествоПолученныхКодов(ЗаказНаЭмиссию)
	Возврат Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ОбновитьКоличествоПолученныхКодов(ЗаказНаЭмиссию);
КонецФункции //ОбновитьКоличествоПолученныхКодов(ЗаказНаЭмиссию)

&НаСервере
Функция ДобавитьЗадачу_ЗаписьКодов(ДокСсылка)
	СпособВводаВОборот = ПолучитьРеквизитШапки(ДокСсылка, "СпособВводаВОборот");
	
	пМетода		= Новый Структура("ДокСсылка,Перезаписывать", ДокСсылка, Ложь);
	пОбработки 	= Новый Структура("ПараметрыМетода", пМетода);
	
	//Валетов + 21,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3522 Добавил ИЛИ 
	Если СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.МаркировкаОстатков ИЛИ СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Перемаркировка Тогда
		пОбработки.Вставить("Приоритет", 0); 	
	КонецЕсли;	
	
	Возврат РегистрыСведений.ОчередьЗадач.СоздатьЗадачу("Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ЗагрузитьКодыИзЛогов", "ЗагрузкаКМ", ДокСсылка, пОбработки);
КонецФункции // ()
 


