
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)	
	рПроверки = ПроверитьДокументыКОбработке(ПараметрКоманды);	
	
	Для Каждого ТекстОшибки Из рПроверки.ОшибкиДокументов Цикл
		Сообщить(ТекстОшибки, СтатусСообщения.Важное);	
	КонецЦикла; 
	
	Для Каждого ДокСсылка Из рПроверки.ДокументыКОбработке Цикл
		УстановитьРеквизитыОбъекта(ДокСсылка, Новый Структура("Статус", Перечисления.СтатусыДокументовМаркировки.КОбработке));		
		
		рОбработки = МаркировкаВС.ОтправитьНаОбработку_ОперМаркировки(ДокСсылка);		
		
		Если рОбработки.Успешно Тогда
			ОповеститьОбИзменении(ДокСсылка);
			Оповестить("ИзмененСтатус", , ДокСсылка);	
		Иначе
			Сообщить(СтрСоединить(рОбработки.Ошибки, Символы.ПС), СтатусСообщения.Важное);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьДокументыКОбработке(мСсылки)
	Результат = Новый Структура("ОшибкиДокументов,ДокументыКОбработке", Новый Массив, Новый Массив);	
	
	Для Каждого ДокСсылка Из мСсылки Цикл
		
		рПроверки = Документы.МаркировкаТоваровИСМП.ПроверитьДокументПередОтправкойВЧЗ(ДокСсылка);
		Если рПроверки.Успешно Тогда
			Результат.ДокументыКОбработке.Добавить(ДокСсылка);
		Иначе
			МаркировкаКС.ДобавитьОшибки(Результат.ОшибкиДокументов, рПроверки);				
		КонецЕсли;
		
	КонецЦикла; 	
	
	Возврат Результат;
КонецФункции // ()
 