Функция СформироватьСтруктуруМетаданных(ИмяПланаОбмена=Неопределено) Экспорт
	
	Дерево = Новый ДеревоЗначений;
	Колонки = Дерево.Колонки;
	Колонки.Добавить("Наименование");
	Колонки.Добавить("МетаПолноеИмя");
	Колонки.Добавить("ИндексКартинки");
	Колонки.Добавить("Пометка");
	Колонки.Добавить("ИдентификаторСтроки");
	
	Колонки.Добавить("Авторегистрация");
	Колонки.Добавить("КоличествоИзменений");
	Колонки.Добавить("КоличествоВыгруженных");
	Колонки.Добавить("КоличествоНевыгруженных");
	Колонки.Добавить("КоличествоИзмененийСтрокой");
	
	// Корень
	СтрокаКорень = Дерево.Строки.Добавить();
	СтрокаКорень.Наименование = Метаданные.Представление();
	СтрокаКорень.ИндексКартинки = 0;
	СтрокаКорень.ИдентификаторСтроки = 0;
	
	// Параметры
	ТекПараметры = Новый Структура("СтруктураИмен, СтруктураПредставлений, СтруктураАвторегистрации, Строки", 
		Новый Структура, Новый Структура, Новый Структура, СтрокаКорень.Строки);
	
	Если ИмяПланаОбмена=Неопределено Тогда
		ПланОбмена = Неопределено;
	ИначеЕсли ТипЗнч(ИмяПланаОбмена)=Тип("Строка") Тогда
		ПланОбмена = Метаданные.ПланыОбмена[ИмяПланаОбмена];
	Иначе
		ПланОбмена = ИмяПланаОбмена.Метаданные();
	КонецЕсли;
	ТекПараметры.Вставить("ПланОбмена", ПланОбмена);
	
	Результат = Новый Структура("Дерево, СтруктураИмен, СтруктураПредставлений, СтруктураАвторегистрации", 
		Дерево, ТекПараметры.СтруктураИмен, ТекПараметры.СтруктураПредставлений, ТекПараметры.СтруктураАвторегистрации);
	
	ТекНомерСтроки = 1;
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 1,  2,  Ложь,   "Константы",               НСтр("ru='Константы'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 3,  4,  Истина, "Справочники",             НСтр("ru='Справочники'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 5,  6,  Истина, "Последовательности",      НСтр("ru='Последовательности'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 7,  8,  Истина, "Документы",               НСтр("ru='Документы'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 9,  10, Истина, "ПланыВидовХарактеристик", НСтр("ru='Планы видов характеристик'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 11, 12, Истина, "ПланыСчетов",             НСтр("ru='Планы счетов'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 13, 14, Истина, "ПланыВидовРасчета",       НСтр("ru='Планы видов расчета'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 15, 16, Истина, "РегистрыСведений",        НСтр("ru='Регистры сведений'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 17, 18, Истина, "РегистрыНакопления",      НСтр("ru='Регистры накопления'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 19, 20, Истина, "РегистрыБухгалтерии",     НСтр("ru='Регистры бухгалтерии'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 21, 22, Истина, "РегистрыРасчета",         НСтр("ru='Регистры расчета'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 23, 24, Истина, "БизнесПроцессы",          НСтр("ru='Бизнес-процессы'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 25, 26, Истина, "Задачи",                  НСтр("ru='Задачи'"));
	
	Возврат Результат;
КонецФункции

Процедура СформироватьУровеньМетаданных(ТекущийНомерСтроки, Параметры, ИндексКартинки, ИндексКартинкиУзлов, ДобавлятьПодчиненные, ИмяМета, ПредставлениеМета)
	
	ПредставленияУровня = Новый Массив;
	Авторегистрации     = Новый Массив;
	ИменаУровня         = Новый Массив;
	
	ВсеСтроки = Параметры.Строки;
	МетаПлан  = Параметры.ПланОбмена;
	
	СтрокаГруппа = ВсеСтроки.Добавить();
	СтрокаГруппа.ИдентификаторСтроки = ТекущийНомерСтроки;
	
	СтрокаГруппа.МетаПолноеИмя  = ИмяМета;
	СтрокаГруппа.Наименование   = ПредставлениеМета;
	СтрокаГруппа.ИндексКартинки = ИндексКартинки;
	
	Строки = СтрокаГруппа.Строки;
	БылиПодчиненные = Ложь;
	
	Для Каждого Мета Из Метаданные[ИмяМета] Цикл
		
		Если МетаПлан=Неопределено Тогда
			// Без учета плана обмена
			БылиПодчиненные = Истина;
			МетаПолноеИмя   = Мета.ПолноеИмя();
			Наименование    = Мета.Представление();
			Если ДобавлятьПодчиненные Тогда
				НовСтрока = Строки.Добавить();
				НовСтрока.МетаПолноеИмя  = МетаПолноеИмя;
				НовСтрока.Наименование   = Наименование ;
				НовСтрока.ИндексКартинки = ИндексКартинкиУзлов;
				
				ТекущийНомерСтроки = ТекущийНомерСтроки + 1;
				НовСтрока.ИдентификаторСтроки = ТекущийНомерСтроки;
			КонецЕсли;	
			ИменаУровня.Добавить(МетаПолноеИмя);
			ПредставленияУровня.Добавить(Наименование);
			
		Иначе
			Элемент = МетаПлан.Состав.Найти(Мета);
			Если Элемент<>Неопределено Тогда
				БылиПодчиненные = Истина;
				МетаПолноеИмя   = Мета.ПолноеИмя();
				Наименование    = Мета.Представление();
				Авторегистрация = ?(Элемент.Авторегистрация=АвтоРегистрацияИзменений.Запретить, 1, 2);
				Если ДобавлятьПодчиненные Тогда
					НовСтрока = Строки.Добавить();
					НовСтрока.МетаПолноеИмя   = МетаПолноеИмя;
					НовСтрока.Наименование    = Наименование ;
					НовСтрока.ИндексКартинки  = ИндексКартинкиУзлов;
					НовСтрока.Авторегистрация = Авторегистрация;
					
					ТекущийНомерСтроки = ТекущийНомерСтроки + 1;
					НовСтрока.ИдентификаторСтроки = ТекущийНомерСтроки;
				КонецЕсли;
				ИменаУровня.Добавить(МетаПолноеИмя);
				ПредставленияУровня.Добавить(Наименование);
				Авторегистрации.Добавить(Авторегистрация);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если БылиПодчиненные Тогда
		Строки.Сортировать("Наименование");
		Параметры.СтруктураИмен.Вставить(ИмяМета, ИменаУровня);
		Параметры.СтруктураПредставлений.Вставить(ИмяМета, ПредставленияУровня);
		Если Не ДобавлятьПодчиненные Тогда
			Параметры.СтруктураАвторегистрации.Вставить(ИмяМета, Авторегистрации);
		КонецЕсли;
	Иначе
		// Виды объектов без регистрации не вставляем
		ВсеСтроки.Удалить(СтрокаГруппа);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьКоличествоИзменений(СписокТаблиц, СписокУзлов) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	Колонки = Результат.Колонки;
	Колонки.Добавить("МетаПолноеИмя");
	Колонки.Добавить("УзелОбмена");
	Колонки.Добавить("КоличествоИзменений");
	Колонки.Добавить("КоличествоВыгруженных");
	Колонки.Добавить("КоличествоНеВыгруженных");
	
	Результат.Индексы.Добавить("МетаПолноеИмя");
	Результат.Индексы.Добавить("УзелОбмена");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокУзлов", СписокУзлов);
	
	// На входе или массив или структура/соответствие со многими массивами
	Если СписокТаблиц=Неопределено Тогда
		Возврат Результат;
	ИначеЕсли ТипЗнч(СписокТаблиц)=Тип("Массив") Тогда
		Источник = Новый Структура("_", СписокТаблиц);
	Иначе
		Источник = СписокТаблиц;
	КонецЕсли;
	
	// Пачками по 200 таблиц в запросе
	Текст = "";
	Номер = 0;
	Для Каждого КлючЗначение Из Источник Цикл
		Если ТипЗнч(КлючЗначение.Значение)<>Тип("Массив") Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Элемент Из КлючЗначение.Значение Цикл
			Если ПустаяСтрока(Элемент) Тогда
				Продолжить;
			КонецЕсли;
			
			Текст = Текст + ?(Текст="", "", "ОБЪЕДИНИТЬ ВСЕ") + " 
				|ВЫБРАТЬ 
				|	""" + Элемент + """ КАК МетаПолноеИмя,
				|	Узел                КАК УзелОбмена,
				|	КОЛИЧЕСТВО(*)              КАК КоличествоИзменений,
				|	КОЛИЧЕСТВО(НомерСообщения) КАК КоличествоВыгруженных,
				|	КОЛИЧЕСТВО(*) - КОЛИЧЕСТВО(НомерСообщения) КАК КоличествоНеВыгруженных
				|ИЗ
				|	" + Элемент + ".Изменения
				|ГДЕ
				|	Узел В (&СписокУзлов)
				|СГРУППИРОВАТЬ ПО
				|	Узел
				|";
				
			Номер = Номер + 1;
			Если Номер=200	Тогда
				Запрос.Текст = Текст;
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					ЗаполнитьЗначенияСвойств(Результат.Добавить(), Выборка);
				КонецЦикла;
				Текст = "";
				Номер = 0;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	// Дочитываем хвосты
	Если Текст<>"" Тогда
		Запрос.Текст = Текст;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Результат.Добавить(), Выборка);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции



//// Накапливаем результаты регистраций
////
//Процедура ДобавитьРезультаты(Приемник, Источник)
//	Приемник.Успешно = Приемник.Успешно + Источник.Успешно;
//	Приемник.Всего   = Приемник.Всего   + Источник.Всего;
//КонецПроцедуры	

//// Возвращает массив дополнительно регистрируемых объектов согласно флагам
////
//Функция ПолучитьДополнительныеОбъектыРегистрации(ОбъектРегистрации, УзелКонтроляАвторегистрации, БезАвторегистрации, ИмяТаблицы=Неопределено)
//	Результат = Новый Массив;
//	
//	// Смотрим на глобальные параметры
//	Если (Не НастройкаАвторегистрацияДвижений) И (Не НастройкаАвторегистрацияПоследовательностей) Тогда
//		Возврат Результат;
//	КонецЕсли;
//	
//	ТипЗначения = ТипЗнч(ОбъектРегистрации);
//	НаВходеИмя = ТипЗначения=Тип("Строка");
//	Если НаВходеИмя Тогда
//		Описание = ХарактеристикиПоМетаданным(ОбъектРегистрации);
//	ИначеЕсли ТипЗначения=Тип("Структура") Тогда
//		Описание = ХарактеристикиПоМетаданным(ИмяТаблицы);
//		Если Описание.ЭтоПоследовательность Тогда
//			Возврат Результат;
//		КонецЕсли;
//	Иначе
//		Описание = ХарактеристикиПоМетаданным(ОбъектРегистрации.Метаданные());
//	КонецЕсли;
//	
//	МетаОбъект = Описание.Метаданные;
//	
//	// Коллекцию рекурсивно	
//	Если Описание.ЭтоКоллекция Тогда
//		Для Каждого Мета Из МетаОбъект Цикл
//			ДополнительныйНабор = ПолучитьДополнительныеОбъектыРегистрации(Мета.ПолноеИмя(), УзелКонтроляАвторегистрации, БезАвторегистрации, ИмяТаблицы);
//			Для Каждого Элемент Из ДополнительныйНабор Цикл
//				Результат.Добавить(Элемент);
//			КонецЦикла;
//		КонецЦикла;
//		Возврат Результат;
//	КонецЕсли;
//	
//	// Одиночное
//	СоставУзла = УзелКонтроляАвторегистрации.Метаданные().Состав;
//	
//	// Документы. Могут влиять на последовательности и движения
//	Если Метаданные.Документы.Содержит(МетаОбъект) Тогда
//		
//		Если НастройкаАвторегистрацияДвижений Тогда
//			Для Каждого Мета Из МетаОбъект.Движения Цикл
//				
//				ЭлементСостава = СоставУзла.Найти(Мета);
//				Если ЭлементСостава<>Неопределено И (БезАвторегистрации Или ЭлементСостава.Авторегистрация=АвтоРегистрацияИзменений.Разрешить) Тогда
//					Если НаВходеИмя Тогда
//						Результат.Добавить(Мета);
//					Иначе
//						Описание = ХарактеристикиПоМетаданным(Мета);
//						Набор = Описание.Менеджер.СоздатьНаборЗаписей();
//						Набор.Отбор.Регистратор.Установить(ОбъектРегистрации);
//						Набор.Прочитать();
//						Результат.Добавить(Набор);
//						// И проверим полученный набор рекурсивно
//						ДополнительныйНабор = ПолучитьДополнительныеОбъектыРегистрации(Набор, УзелКонтроляАвторегистрации, БезАвторегистрации, ИмяТаблицы);
//						Для Каждого Элемент Из ДополнительныйНабор Цикл
//							Результат.Добавить(Элемент);
//						КонецЦикла;
//					КонецЕсли;
//				КонецЕсли;
//				
//			КонецЦикла;
//		КонецЕсли;
//		
//		Если НастройкаАвторегистрацияПоследовательностей Тогда
//			Для Каждого Мета Из Метаданные.Последовательности Цикл
//				
//				Описание = ХарактеристикиПоМетаданным(Мета);
//				Если Мета.Документы.Содержит(МетаОбъект) Тогда
//					// Последовательность регистрируется для данного документа
//					ЭлементСостава = СоставУзла.Найти(Мета);
//					Если ЭлементСостава<>Неопределено И (БезАвторегистрации Или ЭлементСостава.Авторегистрация=АвтоРегистрацияИзменений.Разрешить) Тогда
//						// Регистрируется на этом узле
//						Если НаВходеИмя Тогда
//							Результат.Добавить(Мета);
//						Иначе
//							Набор = Описание.Менеджер.СоздатьНаборЗаписей();
//							Набор.Отбор.Регистратор.Установить(ОбъектРегистрации);
//							Набор.Прочитать();
//							Результат.Добавить(Набор);
//						КонецЕсли;
//					КонецЕсли;
//				КонецЕсли;
//				
//			КонецЦикла;
//			
//		КонецЕсли;
//		
//	// Записи регистров. Могут влиять на последовательности
//	ИначеЕсли НастройкаАвторегистрацияПоследовательностей И (
//		Метаданные.РегистрыСведений.Содержит(МетаОбъект)
//		Или Метаданные.РегистрыНакопления.Содержит(МетаОбъект)
//		Или Метаданные.РегистрыБухгалтерии.Содержит(МетаОбъект)
//		Или Метаданные.РегистрыРасчета.Содержит(МетаОбъект)
//	) Тогда
//		Для Каждого Мета Из Метаданные.Последовательности Цикл
//			Если Мета.Движения.Содержит(МетаОбъект) Тогда
//				// Последовательность регистрируется для набора записей
//				ЭлементСостава = СоставУзла.Найти(Мета);
//				Если ЭлементСостава<>Неопределено И (БезАвторегистрации Или ЭлементСостава.Авторегистрация=АвтоРегистрацияИзменений.Разрешить) Тогда
//					Результат.Добавить(Мета);
//				КонецЕсли;
//			КонецЕсли;
//		КонецЦикла;
//		
//	КонецЕсли;
//	
//	Возврат Результат;
//КонецФункции

//// Преобразует строку в число
////
//// Параметры:
////     Текст - Строка - строковое представление числа
//// 
//// Возвращаемое значение:
////     Число        - преобразованная строка
////     Неопределено - если строка не может быть преобразована
////
Функция СтрокаВЧисло(Знач Текст)
	ТекстЧисла = СокрЛП(СтрЗаменить(Текст, Символы.НПП, ""));
	
	Если ПустаяСтрока(ТекстЧисла) Тогда
		Возврат 0;
	КонецЕсли;
	
	// Ведущие нули
	Позиция = 1;
	Пока Сред(ТекстЧисла, Позиция, 1)="0" Цикл
		Позиция = Позиция + 1;
	КонецЦикла;
	ТекстЧисла = Сред(ТекстЧисла, Позиция);
	
	// Проверяем на результат по умолчанию
	Если ТекстЧисла="0" Тогда
		Результат = 0;
	Иначе
		ТипЧисло = Новый ОписаниеТипов("Число");
		Результат = ТипЧисло.ПривестиЗначение(ТекстЧисла);
		Если Результат=0 Тогда
			// Результат по умолчанию обработан выше, это ошибка преобразования
			Результат = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции
