
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Режим = Ложь;
	
	Элементы.ДатаЗапретаРедактирования.ТолькоПросмотр =
		Не ПолучитьПолномочиеПользователя("ИзменениеДатыЗапретаРедактирования");
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПереключитьДату();
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КаталогВнешнихОтчетовНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	НаборКонстант.КаталогВнешнихОтчетов = РаботаСДиалогамиК.ВыборКаталогаКлиент(НаборКонстант.КаталогВнешнихОтчетов);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогДокументовНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	НаборКонстант.КаталогДокументов = РаботаСДиалогамиК.ВыборКаталогаКлиент(НаборКонстант.КаталогДокументов);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогНеобработанныхСкановНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	НаборКонстант.КаталогНеобработанныхСканов =
		РаботаСДиалогамиК.ВыборКаталогаКлиент(НаборКонстант.КаталогНеобработанныхСканов);
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаСоединенияСБазойЛоговНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Connect= Новый COMОбъект("ADODB.Connection");
	СтандартнаяОбработка=Ложь;
	NewDataLink=Новый COMОбъект("DataLinks");
	Connect.ConnectionString = НаборКонстант.СтрокаСоединенияСБазойЛогов;
	NewDataLink.PromptEdit(Connect);
	НаборКонстант.СтрокаСоединенияСБазойЛогов=Connect.ConnectionString;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ГруппаСтрокаСоединения_АвтоматическийОбмен_Заполнить(Команда)
	
	НаборКонстант.СтрокаСоединенияИБ_АвтоматическийОбмен = СтрокаСоединенияИнформационнойБазы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьРежим(Команда)
	
	ПереключитьРежимНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПереключитьРежимНаСервере()
	
	Если Не Режим И Не РольДоступна("Администратор") Тогда
		Возврат;
	КонецЕсли;
	
	УправлениеВидимостью();
	
КонецПроцедуры // ПереключитьРежимНаСервере()

// Управление видимостью.
&НаСервере
Процедура УправлениеВидимостью()
	
	Элементы.ГруппаДополнительнаяИнформация.Видимость = Режим;
	
	Если НаборКонстант.БазаАрхиваЛогов Тогда
		Элементы.СтрокаСоединенияСБазойЛогов.Заголовок = "Строка COM соединения c 1C базой источником логов";
	Иначе
		Элементы.СтрокаСоединенияСБазойЛогов.Заголовок = "Строка SQL соединения c базой архивов логов";
	КонецЕсли;
	
КонецПроцедуры // УправлениеВидимостью()

#КонецОбласти
