// Регистрирует изменения документа вместе с движениями
Процедура ЗарегистрироватьИзмененияДокумента(ДокСсылка,Узел) Экспорт
	//регистрация документа
	ПланыОбмена.ЗарегистрироватьИзменения(Узел,ДокСсылка);
	ЗаписатьПроОтправкуНаСклад(ДокСсылка,Узел);
	
	//с некоторых пор :) движения слава богу не гуляют между базами
	
	////регистрация движений
	//МетаУзел=Узел.Метаданные();
	//ДокОбъект=ДокСсылка.ПолучитьОбъект();
	//Для каждого Движение Из ДокОбъект.Движения Цикл
	//	Если МетаУзел.Состав.Найти(Движение.Метаданные())<>Неопределено Тогда
	//		ПланыОбмена.ЗарегистрироватьИзменения(Узел,Движение);				
	//	КонецЕсли;			
	//КонецЦикла;	
КонецПроцедуры

// Процедура вывода диагностического сообщения о регистрации изменений данных
// 
// Параметры:
//  Данные - объект данных, для которого необходимо вывести информацию о
//			 регистрации изменений
//
Процедура ВывестиРегистрацию(Данные) Экспорт
	
	ОбменДанными = Данные.ОбменДанными;
	Сообщить(" - Регистрация " + Данные.Метаданные() + ": " + Строка(Данные));
	//Вывод списка узлов куда будет выполняться регистрация
	Для Каждого Получатель Из ОбменДанными.Получатели Цикл		
		Если Не ОбменДанными.Отправитель = Получатель Тогда 			
			Сообщить("   - " + Получатель);			
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры // ВывестиРегистрацию(Данные)

// Процедура выборочной регистраци изменений по складам
//
// Параметры:
//  ОбменДанными - значение регистрации изменений
//  Склад		 - ссылка на склад, по которому производится регистрация
//
Процедура ВключитьРегистрацию(ОбменДанными, Склад) Экспорт
	
	//Получение узлов для конкретного склада 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	УдаленныеСклады.Ссылка
	|ИЗ
	|	ПланОбмена.УдаленныеСклады КАК УдаленныеСклады
	|
	|ГДЕ
	|	(УдаленныеСклады.Склад = &Склад ИЛИ
	|	УдаленныеСклады.Склад = &ПустойСклад) И
	| 	УдаленныеСклады.Ссылка <> &ЭтотУзел";
	
	Запрос.УстановитьПараметр("Склад", Склад);  
	Запрос.УстановитьПараметр("ПустойСклад", Справочники.Склады.ПустаяСсылка());  
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.УдаленныеСклады.ЭтотУзел());  
	Выборка = Запрос.Выполнить().Выбрать();
	// Регистрация изменений для выбранных узлов
	Пока Выборка.Следующий() Цикл
		
		ОбменДанными.Получатели.Добавить(Выборка.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры // ВключитьРегистрацию(ОбменДанными, Склад)

// Полная регистрация изменений данных для конкретного узла
//
// Параметры:
// 	Узел 				- ссылка на узел, для которого производится регистрация изменений данных
//  РегистрироватьВсе	- булево, признак регистрации всех изменений для узла
//
Процедура ПолнаяРегистрацияДанныхПоУзлу(Узел, РегистрироватьВсе) Экспорт
	
	// регистрация изменений всех данных для узла производится в случае
	// значения параметра РегистрироватьВсе = Истина или
	// значение склада в узле не установлено
	//Если РегистрироватьВсе Или Узел.Склад.Пустая() Тогда
	//	
	//	Сообщить("Регистрация всех данных по узлу " + Узел);
	//	ПланыОбмена.ЗарегистрироватьИзменения(Узел);  
	//	
	//Иначе
	//	
	//	Сообщить("Регистрация данных по узлу " + Узел + " -----------");
	//	ПланОбмена = Узел.Метаданные();
	//	Состав = ПланОбмена.Состав;
	//	Для Каждого ЭлементСостава Из Состав Цикл
	//		
	//		Сообщить("   Регистрация данных " + ЭлементСостава.Метаданные + " по узлу " + Узел);
	//		Если ЭлементСостава.Метаданные = Метаданные.Документы.РасходнаяНакладная Тогда
	//			
	//			// Для документов РасходнаяНакладная регистрация изменений для узла
	//			// производится только при совпадении складов узла и накладной
	//			
	//			// Выбираем документы РасходнаяНакладная по складу узла
	//			Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Документ.РасходнаяНакладная
	//								   |ГДЕ Склад = &Склад");
	//			Запрос.УстановитьПараметр("Склад", Узел.Склад);
	//			Выборка = Запрос.Выполнить().Выбрать();
	//			Пока Выборка.Следующий() Цикл
	//				
	//				// регистрируем изменение документа для узла
	//				ПланыОбмена.ЗарегистрироватьИзменения(Узел, Выборка.Ссылка);  
	//				
	//			КонецЦикла;
	//			
	//		ИначеЕсли ЭлементСостава.Метаданные = Метаданные.РегистрыНакопления.УчетНоменклатуры Тогда
	//			
	//			// Выбираем всех различных регистраторов регистра
	//			Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ Регистратор ИЗ РегистрНакопления.УчетНоменклатуры
	//								   |ГДЕ Склад = &Склад");
	//			Запрос.УстановитьПараметр("Склад", Узел.Склад);
	//			Выборка = Запрос.Выполнить().Выбрать();
	//			Пока Выборка.Следующий() Цикл
	//				
	//				// Создаем набор записей регистра с отбором по регистратору
	//				НаборЗаписей = РегистрыНакопления.УчетНоменклатуры.СоздатьНаборЗаписей();
	//				НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
	//				// регистрируем изменения набора записей для узла
	//				ПланыОбмена.ЗарегистрироватьИзменения(Узел, НаборЗаписей);
	//				
	//			КонецЦикла;
	//			
	//		Иначе	
	//			
	//			// Регистрация изменений всех данных объекта для узла
	//			ПланыОбмена.ЗарегистрироватьИзменения(Узел, ЭлементСостава.Метаданные);  
	//			
	//		КонецЕсли;	
	//		
	//	КонецЦикла;
	//	
	//КонецЕсли;	
	
КонецПроцедуры // ПолнаяРегистрацияДанныхПоУзлу(Узел, Все)

// Полное удаление регистрации изменения данных для узла
//
// Параметры:
// 	Узел 	- ссылка на узел, для которого производится удаление
//			  регистрации изменений данных
//
Процедура ПолноеУдалениеРегистрацииДанныхПоУзлу(Узел) Экспорт
	
	Сообщить("Удаление регистрации всех данных по узлу " + Узел);
	ПланыОбмена.УдалитьРегистрациюИзменений(Узел);  
	
КонецПроцедуры // ПолноеУдалениеРегистрацииДанныхПоУзлу(Узел)


// Выполняет полный обмен со всеми узлами
// Для каждого узла плана обмена УдаленныеСклады производится чтение сообщения
// с данными от других узлов и формирование нового сообщения с измененными данными
//
Процедура ОбменСоСкладами() Экспорт	
	ВыборкаУзлов = ПланыОбмена.Основной.Выбрать();
	Пока ВыборкаУзлов.Следующий() Цикл
		
		// производим обмен данными со всеми узлами, кроме текущего (ЭтотУзел)
		Если ВыборкаУзлов.Ссылка <> ПараметрыСеанса.ЭтотУзел И НЕ ВыборкаУзлов.ПометкаУдаления Тогда
			
			УзелОбъект = ВыборкаУзлов.ПолучитьОбъект();
			
			//Получение сообщения
			УзелОбъект.ПрочитатьСообщениеСИзменениями();
			
			//Формирование сообщения
			УзелОбъект.ЗаписатьСообщениеСИзменениями();			
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры // ОбменСоСкладами()

Функция ЗаписатьВТаблицуЗагрузки(Данные)
	
	
	
КонецФункции // ЗаписатьВТаблицуЗагрузки()

Функция ПеревестиИмяУзла(Имя)
	Словарь=Новый Соответствие();
	
	Словарь.Вставить("DocumentObject","Документ");
	Словарь.Вставить("CatalogObject","Справочник");
	Словарь.Вставить("Ref","Ссылка");
	Словарь.Вставить("Date","Дата");
	Словарь.Вставить("Number","Номер");
	Словарь.Вставить("Code","Код");	
	
	Попытка	
		Возврат Словарь[Имя];	
	Исключение
		Возврат Имя;	
	КонецПопытки;
КонецФункции // ПеревестиИмяУзла()

Функция ПолучитьРезвизитыИзXML(ПредставлениеXML) Экспорт
	Чтение=Новый ЧтениеXML;
	Чтение.УстановитьСтроку(ПредставлениеXML);
	
	ИзвлекаемыеПоля=Новый Структура("Ref,Date,Number,Code","Ссылка","Дата","Номер","Код");
	
	СтруктураРеквизитов=Новый Структура;
	
	СчитаноЭлементов=0;
	
	Пока Чтение.Прочитать() Цикл
		Если Чтение.ТипУзла=ТипУзлаXML.НачалоЭлемента Тогда
			ИмяУзла=Чтение.Имя;
			Поз=Найти(ИмяУзла,".");
			Если Поз<>0 Тогда
				Тип=Лев(Чтение.Имя,Поз-1);
				Вид=Сред(Чтение.Имя,Поз+1);			
				
				СтруктураРеквизитов.Вставить("Тип",ПеревестиИмяУзла(Тип));
				СтруктураРеквизитов.Вставить("Вид",Вид);
			КонецЕсли; 
		ИначеЕсли Чтение.ТипУзла=ТипУзлаXML.Текст Тогда			
			СчитаноЭлементов=СчитаноЭлементов+1;
			
			ЗначениеЭлемента=ТипУзлаXML.Текст;
			Если ИзвлекаемыеПоля.Свойство(ИмяУзла) Тогда
				СтруктураРеквизитов.Вставить(ПеревестиИмяУзла(ИмяУзла),?(ИмяУзла="Date",XMLЗначение(Тип("Дата"),Чтение.Значение),Чтение.Значение));			
			КонецЕсли; 
		КонецЕсли;		
		
		Если СчитаноЭлементов>7 Тогда Прервать КонецЕсли; 
	КонецЦикла;	
	
	Возврат  СтруктураРеквизитов;
КонецФункции // ПолучитьРезвизитыПакета()


Функция ДобавитьУзелВПолучателей(СписокПолучателей,УзелПолучатель,УзелОтправитель,Загрузка)
	Если Загрузка И УзелПолучатель=УзелОтправитель Тогда //туда-сюда гонять не будем		
	ИначеЕсли НЕ УзелПолучатель.Пустая() Тогда
		СписокПолучателей.Добавить(УзелПолучатель);
	КонецЕсли;
КонецФункции // Добавить()


//МАРШРУТИЗАЦИЯ ИЗМЕНЕНИЙ

Функция ПолучитьСписокПолучателейЦен(ТипЦен) Экспорт
	СписокПолучателей=Новый Массив;
	
	Запрос=Новый Запрос;					
	Запрос.Текст="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка
	|ИЗ
	|	ПланОбмена.Основной.ТипыЦен КАК ОсновнойТипыЦен
	|ГДЕ
	|	ТипЦен = &ТипЦен";
	
	Запрос.УстановитьПараметр("ТипЦен",ТипЦен);
	
	Выборка=Запрос.Выполнить().Выбрать();	
	
	Если Выборка.Количество()=0 Тогда
		//если данный тип цен не имеет персональной адресации
		//отправляем во все розничные подразделения
		
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Основной.Ссылка
		|ИЗ
		|	ПланОбмена.Основной КАК Основной
		|ГДЕ
		//крохин начало 31.05.2019
		|   НЕ Ссылка.ПометкаУдаления И
		//крохин конец 31.05.2019
		|	Основной.ТипУзла = &ТипУзла";
		Запрос.УстановитьПараметр("ТипУзла",Перечисления.ТипУзлаИБ.ТорговоеПодразделение);	
		
		Выборка=Запрос.Выполнить().Выбрать();	
	КонецЕсли; 
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка<>ПланыОбмена.Основной.ЭтотУзел() Тогда
			СписокПолучателей.Добавить(Выборка.Ссылка);
		КонецЕсли;				
	КонецЦикла;	
	
	Возврат СписокПолучателей;	
КонецФункции // ПолучитьСписокПолучателейЦен()

//Нечаева +++  08,11,13
Функция ПолучитьСписокПолучателейИННКонтрагентов() Экспорт
	СписокПолучателей=Новый Массив;
	
	Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		// филиалы
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	Основной.Ссылка,
		|	Основной.Наименование
		|ИЗ
		|	ПланОбмена.Основной КАК Основной
		|ГДЕ
		|	(НЕ Основной.ПометкаУдаления)
		|	И Основной.Ссылка <> &ЭтотУзел
		|	И Основной.Подразделение В ИЕРАРХИИ(&Филиалы)";
		
		Запрос.УстановитьПараметр("ЭтотУзел",ПараметрыСеанса.ЭтотУзел);
		// деп. опт. продаж
		Запрос.УстановитьПараметр("Филиалы",Справочники.Подразделения.НайтиПоКоду("GRP-0419"));
		Выборка=Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если истина Тогда
				СписокПолучателей.Добавить(Выборка.Ссылка);		
			КонецЕсли;
		КонецЦикла; 
		// склады
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	Основной.Ссылка,
		|	Основной.Наименование
		|ИЗ
		|	ПланОбмена.Основной КАК Основной
		|ГДЕ
		|	(НЕ Основной.ПометкаУдаления)
		|	И Основной.Ссылка <> &ЭтотУзел
		|	И Основной.ТипУзла = &Склады";
		
		Запрос.УстановитьПараметр("ЭтотУзел",ПараметрыСеанса.ЭтотУзел);
		Запрос.УстановитьПараметр("Склады",Перечисления.ТипУзлаИБ.Склад);
		Выборка=Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если истина Тогда
				СписокПолучателей.Добавить(Выборка.Ссылка);		
			КонецЕсли;
		КонецЦикла; 
		
	Иначе
		СписокПолучателей.Добавить(ПараметрыСеанса.ЭтотУзел.УправляющийУзел);
	КонецЕсли;	
	
	Возврат СписокПолучателей;
КонецФункции // ПолучитьСписокПолучателейЦен()
//Нечаева --- 08,11,13


Функция ПолучитьСписокПолучателейСкидок(ТипСкидок) Экспорт
	СписокПолучателей=Новый Массив;
	
	Запрос=Новый Запрос;					
	Запрос.Текст="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка
	|ИЗ
	|	ПланОбмена.Основной.ТипыСкидок
	|ГДЕ
	|	ТипСкидок = &ТипСкидок";
	
	
	
	
	Запрос.УстановитьПараметр("ТипСкидок",ТипСкидок);
	
	Выборка=Запрос.Выполнить().Выбрать();	
	
	Если Выборка.Количество()=0 Тогда
		//если данный тип цен не имеет персональной адресации
		//отправляем во все розничные подразделения
		
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Основной.Ссылка
		|ИЗ
		|	ПланОбмена.Основной КАК Основной
		|ГДЕ
		//крохин начало 31.05.2019
		|   НЕ Ссылка.ПометкаУдаления И
		//крохин конец 31.05.2019
		|	Основной.ТипУзла = &ТипУзла";
		Запрос.УстановитьПараметр("ТипУзла",Перечисления.ТипУзлаИБ.ТорговоеПодразделение);	
		
		Выборка=Запрос.Выполнить().Выбрать();	
	КонецЕсли; 
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка<>ПланыОбмена.Основной.ЭтотУзел() Тогда
			СписокПолучателей.Добавить(Выборка.Ссылка);
		КонецЕсли;				
	КонецЦикла;	
	
	Возврат СписокПолучателей;	
КонецФункции // ПолучитьСписокПолучателейСкидок(ТипСкидок) Экспорт

Функция ПолучитьСписокПолучателейИнформацииОКонтрагентах()
	СписокПолучателей=Новый Массив;
	
	Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Ссылка
		|ИЗ
		|	ПланОбмена.Основной КАК Основной
		|ГДЕ
		|	НЕ Основной.ПометкаУдаления
		|	И Ссылка <> &ЭтотУзел
		|	И НЕ ПометкаУдаления
		|	И НЕ Основной.ОтключитьВыгрузкуСправочников";
		
		Запрос.УстановитьПараметр("ЭтотУзел",ПараметрыСеанса.ЭтотУзел);
		Выборка=Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокПолучателей.Добавить(Выборка.Ссылка);		
		КонецЦикла; 
	Иначе
		СписокПолучателей.Добавить(ПараметрыСеанса.ЭтотУзел.УправляющийУзел);
	КонецЕсли;	
	
	Возврат СписокПолучателей;
КонецФункции

//Катаев+ 04/06/13
//Катаев+ 17/10/14
//Процедура ДобавитьВУзелФилиала(СписокПолучателей, Отправитель, Загрузка, Контрагент, УзелСклада=Неопределено)
Процедура ДобавитьВУзелФилиала(СписокПолучателей, Отправитель, Загрузка, Контрагент, УзелСклада=Неопределено, ЗагружатьНаСклад = Ложь)
	//Катаев- 17/10/14
	//Катаев+ 05/05/14 Переделал немного проверку
	////Катаев+ 20/03/14 Если Узел склада не принадлежит текущему узлу или это не ЦО, то в филиалы не регистрируем
	//Если ПланыОбмена.Основной.ЭтотУзел() <> УзелСклада или ПланыОбмена.Основной.ЭтотУзел().Код <> "SNL" Тогда
	//	Возврат;
	//Конецесли;
	////Катаев- 20/03/14
	Если ПланыОбмена.Основной.ЭтотУзел().Код <> "SNL" Тогда
		Если ПланыОбмена.Основной.ЭтотУзел() <> УзелСклада Тогда
			Возврат;
		Конецесли;
	КонецЕсли;
	//Катаев- 05/05/14
	Контрагент1 = Контрагент;
	//Катаев+ 11/06/13
	Если ТипЗнч(Контрагент1) <> Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат;
	КонецЕсли;
	//Катаев- 11/06/13
	//крохин начало 18.06.2013
	Попытка 
		Тест = Контрагент1.Уровень();
	Исключение
		Возврат;
	КонецПопытки;
	//крохин конец 18.06.2013
	//Катаев+ 25/12/13 Если контрагент не в группе "Покупатели", то в узел не добавляем
	Контрагент2 = Контрагент;
	Пока Контрагент2.Уровень() <> 0 Цикл
		Контрагент2 = Контрагент2.Родитель;
	КонецЦикла;
	//Катаев+ 29/01/14 Контрагент может быть и из интегральной базы. Добавил в проперку еще и его.
	Если Контрагент2 <> справочники.Контрагенты.НайтиПоКоду("SSP-0001") и Контрагент2 <> справочники.Контрагенты.НайтиПоКоду("SMN-0001") Тогда 
		Возврат;
	КонецЕсли;
	//Катаев- 25/12/13
	//Катаев+ 10/07/13 Есть контрагенты у которых узлы прописаны как в контрагенте, так и в вышестоящих узлах. Добавлять необходимо во все узлы.
	//Пока Контрагент1.РегиональныеУзлы.Количество()=0 И Контрагент1.Уровень()>1 Цикл
	//	Контрагент1 = Контрагент1.Родитель;
	//КонецЦикла;
	//Если Контрагент1.РегиональныеУзлы.Количество() <> 0 Тогда
	//	Для каждого Фил Из Контрагент1.РегиональныеУзлы Цикл
	//		УзелФил = ПланыОбмена.Основной.НайтиПоКоду(Фил.КодУзла);
	//		Если УзелФил <> ПланыОбмена.Основной.НайтиПоКоду("SNL") И УзелФил <> УзелСклада Тогда
	//			ДобавитьУзелВПолучателей(СписокПолучателей,УзелФил,Отправитель,Загрузка);
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	Пока Контрагент1.Уровень() > 1 цикл
		Пока Контрагент1.РегиональныеУзлы.Количество()=0 И Контрагент1.Уровень()>1 Цикл
			Контрагент1 = Контрагент1.Родитель;
		КонецЦикла;
		Если Контрагент1.РегиональныеУзлы.Количество() <> 0 Тогда
			Для каждого Фил Из Контрагент1.РегиональныеУзлы Цикл
				УзелФил = ПланыОбмена.Основной.НайтиПоКоду(Фил.КодУзла);
				Если УзелФил <> ПланыОбмена.Основной.НайтиПоКоду("SNL") И УзелФил <> УзелСклада Тогда
					//Катаев+ 17/10/14 В узел склада добавляем если при условии что загружать в склад можно 
					//ДобавитьУзелВПолучателей(СписокПолучателей,УзелФил,Отправитель,Загрузка);
					Если ЗагружатьНаСклад Тогда
						ДобавитьУзелВПолучателей(СписокПолучателей,УзелФил,Отправитель,Загрузка);
					Иначе
						Если УзелФил.ТипУзла <> Перечисления.ТипУзлаИБ.Склад Тогда
							ДобавитьУзелВПолучателей(СписокПолучателей,УзелФил,Отправитель,Загрузка);
						КонецЕсли;
					КонецЕсли;
					//Катаев- 17/10/14
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		//Катаев+ 11/07/13
		Контрагент1 = Контрагент1.Родитель;
		УровеньК = Контрагент1.Уровень();
		//Катаев- 11/07/13
	КонецЦикла;
	//Еатаев- 10/07/13
КонецПроцедуры
//Катаев- 04/06/13

//Катаев+ 06/06/13
Процедура ДобавитьВУзелФилиалаСз(СписокПолучателей, Отправитель, Загрузка, СзКонтрагент, УзелСклада=Неопределено)
	тзФилиал = Новый ТаблицаЗначений;
	тзФилиал.Колонки.Добавить("Узел");
	Для Каждого Контр Из сзКонтрагент Цикл
		Контрагент1 = Контр.Значение;
		//Катаев+ 11/06/13
		Если ТипЗнч(Контрагент1) <> Тип("СправочникСсылка.Контрагенты") Тогда
			Продолжить;
		КонецЕсли;
		//Катаев- 11/06/13
		//крохин начало 18.06.2013
		Попытка 
			Тест = Контрагент1.Уровень();
		Исключение
			Продолжить;
		КонецПопытки;
		//крохин конец 18.06.2013
		//Катаев+ 25/12/13 Если контрагент не в группе "Покупатели", то в узел не добавляем
		Контрагент2 = Контрагент1;
		Пока Контрагент2.Уровень() <> 0 Цикл
			Контрагент2 = Контрагент2.Родитель;
		КонецЦикла;
		//Катаев+ 29/01/14 Контрагент может быть и из интегральной базы. Добавил в проверку еще и его.
		Если Контрагент2 <> справочники.Контрагенты.НайтиПоКоду("SSP-0001") и Контрагент2 <> справочники.Контрагенты.НайтиПоКоду("SMN-0001") Тогда
			Продолжить;
		КонецЕсли;
		//Катаев- 25/12/13
		//Катаев+ 11/06/13
		//Пока Контрагент.РегиональныеУзлы.Количество()=0 И Контрагент.Уровень()>1 Цикл
		//	Контрагент = Контрагент.Родитель;
		//КонецЦикла;
		Попытка
			УровеньК = Контрагент1.Уровень();
		Исключение
			УровеньК = 0;
		КонецПопытки;
		//Катаев+ 10/07/13 Есть контрагенты у которых узлы прописаны как в контрагенте, так и в вышестоящих узлах. Добавлять необходимо во все узлы.
		//Пока Контрагент1.РегиональныеУзлы.Количество()=0 И УровеньК>1 Цикл
		//	Контрагент1 = Контрагент1.Родитель;
		//	УровеньК = Контрагент1.Уровень();
		//КонецЦикла;
		////Катаев- 11/06/13
		//Если Контрагент1.РегиональныеУзлы.Количество() <> 0 Тогда
		//	Для Каждого Фил из Контрагент1.РегиональныеУзлы Цикл
		//		УзелФил = ПланыОбмена.Основной.НайтиПоКоду(Фил.КодУзла);
		//		Если УзелФил <> ПланыОбмена.Основной.НайтиПоКоду("SNL") И УзелФил <> УзелСклада Тогда
		//			НоваяСтрока = тзФилиал.Добавить();
		//			НоваяСтрока.Узел = УзелФил;
		//		КонецЕсли;
		//	КонецЦикла;
		//КонецЕсли;
		Пока УровеньК>1 Цикл
			Пока Контрагент1.РегиональныеУзлы.Количество()=0 И УровеньК>1 Цикл
				Контрагент1 = Контрагент1.Родитель;
				УровеньК = Контрагент1.Уровень();
			КонецЦикла;
			Если Контрагент1.РегиональныеУзлы.Количество() <> 0 Тогда
				Для Каждого Фил из Контрагент1.РегиональныеУзлы Цикл
					УзелФил = ПланыОбмена.Основной.НайтиПоКоду(Фил.КодУзла);
					Если УзелФил <> ПланыОбмена.Основной.НайтиПоКоду("SNL") И УзелФил <> УзелСклада Тогда
						НоваяСтрока = тзФилиал.Добавить();
						НоваяСтрока.Узел = УзелФил;
					КонецЕсли;
				КонецЦикла;
				//Катаев+ 11/07/13
				Контрагент1 = Контрагент1.Родитель;
				УровеньК = Контрагент1.Уровень();
				//Катаев- 11/07/13						
			КонецЕсли;
		КонецЦикла;
		//Катаев- 10/07/13
	КонецЦикла;
	тзФилиал.Свернуть("Узел");
	Для Каждого УзелФил из тзФилиал Цикл
		ДобавитьУзелВПолучателей(СписокПолучателей,УзелФил.Узел,Отправитель,Загрузка);
	КонецЦикла;
КонецПроцедуры
//Катаев- 06/06/13

Функция ПолучитьСписокПолучателейИзмененийОбъекта(Объект,ДопИнфо=Неопределено)
	ЭтотУзел			=ПланыОбмена.Основной.ЭтотУзел();		
	УправляющийУзел		=ЭтотУзел.УправляющийУзел;
	ТипУзла				=ПараметрыСеанса.ТипУзла;
	
	ОбменДанными		=Объект.ОбменДанными;
	Отправитель			=ОбменДанными.Отправитель;
	Загрузка			=ОбменДанными.Загрузка;
	
	СписокПолучателей	=Новый СписокЗначений;
	ТипОбъекта			=ТипОбъекта(Объект);
	ВидОбъекта			=Объект.Метаданные().Имя;

	ДокументВзаиморасчетов = Ложь;
	
	Если ТипОбъекта="Документ" Тогда
		Если ВидОбъекта="РасходнаяНакладная" ИЛИ ВидОбъекта="ПриходнаяНакладная" Тогда
			Склад		=Объект.Склад;
			УзелСклада	=ПланыОбмена.Основной.НайтиПоКоду(Склад.КодФизическогоУзла);			
			
			Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда		
				Если Объект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе Тогда 
				ИначеЕсли Объект.СостояниеНакладной=Перечисления.СостоянияНакладной.ПолученоОфисом Тогда 
				Иначе					
					ДобавитьУзелВПолучателей(СписокПолучателей,УзелСклада,Отправитель,Загрузка);
				КонецЕсли; //На склад выгружаются только накладные к отправке и измененные после отправки				

				Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение И (Объект.СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена ИЛИ Объект.СостояниеНакладной=Перечисления.СостоянияНакладной.Принята) Тогда
					ДобавитьВУзелФилиала(СписокПолучателей, Отправитель, Загрузка, Объект.Контрагент, УзелСклада);
					ДокументВзаиморасчетов = Истина;
				ИначеЕсли ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение И Объект.СостояниеНакладной<>Перечисления.СостоянияНакладной.ВРаботе И ВидОбъекта="ПриходнаяНакладная" Тогда
					ДобавитьВУзелФилиала(СписокПолучателей, Отправитель, Загрузка, Объект.Контрагент, УзелСклада);
					ДокументВзаиморасчетов = Истина;
				КонецЕсли; 
				Если Объект.ПометкаУдаления Тогда
					ДобавитьВУзелФилиала(СписокПолучателей, Отправитель, Загрузка, Объект.Контрагент, УзелСклада);
					ДокументВзаиморасчетов = Истина;
				КонецЕсли;
			ИначеЕсли ТипУзла=Перечисления.ТипУзлаИБ.Склад ИЛИ ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
				Если Объект.СостояниеНакладной<>Перечисления.СостоянияНакладной.ВРаботе Тогда 
					Если Объект.Склад.КодФизическогоУзла=ЭтотУзел.Код Тогда
						ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);					
					КонецЕсли;
					//теперь резервные РНК выгружаются в офис
				Иначе
					Если ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение И ВидОбъекта="РасходнаяНакладная" Тогда
						//теперь из оптовых ТЦ не выгружаются РНК
						Если Объект.Склад.КодФизическогоУзла=ЭтотУзел.Код И (Объект.Склад.ТипСклада = Перечисления.ТипСклада.Филиал) Тогда
							ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);					
						КонецЕсли;	
					КонецЕсли;
				КонецЕсли; //На склад выгружаются только накладные к отправке и измененные после отправки
			КонецЕсли;
		ИначеЕсли ВидОбъекта="ОтчетКассовойСмены" Тогда
			Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда		
				//ОКСЫ - в обратку не отправляем принципиально !!!
			ИначеЕсли ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			КонецЕсли;
			//нечаева 02,09,16+++ 
		//нечаева 09.06.26 +++ эТРН
		ИначеЕсли ВидОбъекта="ЭлТранспортнаяНакладная" Тогда
			//Только со склада в офис.
			Если ТипУзла=Перечисления.ТипУзлаИБ.склад Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			КонецЕсли;
		//нечаева 09.06.26 ---	
	    ИначеЕсли ВидОбъекта="Паллета" Тогда
			Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда		
				//обратно паллеты не отправляем, только склад их редактирует.
				// и грузим в офис только по Ленте, для екода, по паллетам
			ИначеЕсли ТипУзла=Перечисления.ТипУзлаИБ.склад Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			КонецЕсли;	                      //нечаева 12,11,18 +++
		ИначеЕсли ВидОбъекта="ЛистНабора" или ВидОбъекта="ЛистПереукладки"  Тогда
			//нечаева 12,11,18 ---
			Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда		
				//обратно на склад не отправляем, только склад их редактирует.
				// и грузим в офис только по Ленте, для екода, по паллетам
			ИначеЕсли ТипУзла=Перечисления.ТипУзлаИБ.склад Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			КонецЕсли;	
			//нечаева 02,09,16--- 		
		ИначеЕсли ВидОбъекта="Перемещение" Тогда
			Склад			=Объект.Склад;
			СкладПолучатель =Объект.СкладПолучатель;
			
			УзелСклада				=ПланыОбмена.Основной.НайтиПоКоду(Склад.КодФизическогоУзла);
			УзелСкладаПолучателя	=ПланыОбмена.Основной.НайтиПоКоду(СкладПолучатель.КодФизическогоУзла);
			
			Если НЕ (СкладПолучатель.ФизическийСклад=Склад ИЛИ СкладПолучатель=Склад.ФизическийСклад ИЛИ (СкладПолучатель.ФизическийСклад = Склад.ФизическийСклад И Не ПустаяСтрока(Склад.ФизическийСклад))) Тогда //виртуалки пропускаем
				Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда		
					Если Объект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе Тогда
					ИначеЕсли Объект.СостояниеНакладной=Перечисления.СостоянияНакладной.ПолученоОфисом Тогда
					Иначе						
						ДобавитьУзелВПолучателей(СписокПолучателей,УзелСклада,Отправитель,Загрузка);						
					КонецЕсли; 
					Если Объект.СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена
						ИЛИ Объект.СостояниеНакладной=Перечисления.СостоянияНакладной.ОтгруженаНаТранзитныйСклад Тогда //накладные на склад получатель отправляем только после отгрузки
						Если Объект.СостояниеНакладнойУПолучателя.Пустая() Тогда
							Объект.СостояниеНакладнойУПолучателя=Перечисления.СостоянияНакладной.КОтправкеНаСклад;						
						КонецЕсли;
						ДобавитьУзелВПолучателей(СписокПолучателей,УзелСкладаПолучателя,Отправитель,Загрузка);						
					КонецЕсли;					
				ИначеЕсли ТипУзла=Перечисления.ТипУзлаИБ.Склад ИЛИ ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда		
					Если Склад.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код И Объект.СостояниеНакладной<>Перечисления.СостоянияНакладной.ВРаботе Тогда
						ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
					ИначеЕсли СкладПолучатель.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код И Объект.СостояниеНакладнойУПОлучателя<>Перечисления.СостоянияНакладной.ВРаботе Тогда
						ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);						
					КонецЕсли;					
				КонецЕсли;			
			КонецЕсли;			
			
		ИначеЕсли ВидОбъекта="РекламационнаяНакладная" или ВидОбъекта="КорректировкаЦенВНакладной" ИЛИ ВидОбъекта="СчетФактура" ИЛИ ВидОбъекта="ПланПродаж" 
			ИЛИ ВидОбъекта="КорректировочныйСчетФактура"
			ИЛИ ВидОбъекта = "ЗаявкаНаРекламацию"  Тогда

			Склад		= ?(ВидОбъекта = "ЗаявкаНаРекламацию", Объект.ДокОснование.Склад , Объект.Склад);
			УзелСклада	=ПланыОбмена.Основной.НайтиПоКоду(Склад.КодФизическогоУзла);
			
			Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда		
				ДобавитьУзелВПолучателей(СписокПолучателей,УзелСклада,Отправитель,Загрузка);
				Если ВидОбъекта="РекламационнаяНакладная" или ВидОбъекта="КорректировкаЦенВНакладной"
					ИЛИ ВидОбъекта = "ЗаявкаНаРекламацию" Тогда
					Если ЗначениеЗаполнено(Объект.Корреспондент) И Объект.Корреспондент.Метаданные().Имя = "Контрагенты" Тогда
						ДобавитьВУзелФилиала(СписокПолучателей, Отправитель, Загрузка, Объект.Корреспондент, УзелСклада);
						ДокументВзаиморасчетов = Истина;
					КонецЕсли;
				Иначе
					ДобавитьВУзелФилиала(СписокПолучателей, Отправитель, Загрузка, Объект.Контрагент, УзелСклада);
				КонецЕсли;
			ИначеЕсли ТипУзла=Перечисления.ТипУзлаИБ.Склад ИЛИ ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);				
			КонецЕсли;		
		ИначеЕсли ВидОбъекта="ПрайсЛист" Тогда 
			Если Объект.ТипЦен.Розничный И ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				СписокПолучателейЦен=ПолучитьСписокПолучателейЦен(Объект.ТипЦен);
				
				Для Каждого Получатель Из СписокПолучателейЦен Цикл
					СписокПолучателей.Добавить(Получатель);						
				КонецЦикла;
			КонецЕсли; 			
		ИначеЕсли ВидОбъекта="УстановкаСкидок" Тогда 
			Если Объект.ТипСкидок.Розничный И ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				СписокПолучателейЦен=ПолучитьСписокПолучателейСкидок(Объект.ТипСкидок);
				
				Для Каждого Получатель Из СписокПолучателейЦен Цикл
					СписокПолучателей.Добавить(Получатель);						
				КонецЦикла;
			КонецЕсли;
		ИначеЕсли ВидОбъекта="Инвентаризация" ИЛИ ВидОбъекта="СписаниеТМЦ" ИЛИ ВидОбъекта="ОприходованиеТМЦ" ИЛИ ВидОбъекта="Комплектация" Тогда			
			Склад		=Объект.Склад;			
			УзелСклада	=ПланыОбмена.Основной.НайтиПоКоду(Склад.КодФизическогоУзла);
			
			Если Объект.СостояниеНакладной<>Перечисления.СостоянияНакладной.ВРаботе Тогда				
				Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда		
					ДобавитьУзелВПолучателей(СписокПолучателей,УзелСклада,Отправитель,Загрузка);
				ИначеЕсли ТипУзла=Перечисления.ТипУзлаИБ.Склад ИЛИ ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
					ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);				
				КонецЕсли;			
			КонецЕсли;	
		ИначеЕсли ВидОбъекта="СлужебнаяЗаписка"  Тогда			
			Склад		=Объект.Склад;			
			УзелСклада	=ПланыОбмена.Основной.НайтиПоКоду(Склад.КодФизическогоУзла);
			
			Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение и  Объект.Состояние<>Перечисления.СостоянияКоррекции.ВРаботе Тогда		
				ДобавитьУзелВПолучателей(СписокПолучателей,УзелСклада,Отправитель,Загрузка);
			КонецЕсли;
			
			Если ТипУзла=Перечисления.ТипУзлаИБ.Склад ИЛИ ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);				
			КонецЕсли;			
		ИначеЕсли ВидОбъекта="ЗаявкаНаОтгрузку" Тогда
			Если ПараметрыСеанса.ЭтотУзел.Подразделение.ЕстьВыделенныйСклад Тогда
				Возврат СписокПолучателей;	
			Конецесли;
			Склад		=Объект.Склад;			
			УзелСклада	=ПланыОбмена.Основной.НайтиПоКоду(Склад.КодФизическогоУзла);
			
			Если Объект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе Тогда
			Иначе
				Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
					ДобавитьУзелВПолучателей(СписокПолучателей,Константы.УзелТранспортногоОтдела.Получить(),Отправитель,Загрузка);
					ДобавитьУзелВПолучателей(СписокПолучателей,УзелСклада,Отправитель,Загрузка);
				ИначеЕсли ТипУзла=Перечисления.ТипУзлаИБ.Склад ИЛИ ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
					ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
				КонецЕсли;			
			КонецЕсли;
		ИначеЕсли ВидОбъекта="РасходныйКассовыйОрдер" 
			ИЛИ ВидОбъекта="ПриходныйКассовыйОрдер" ИЛИ  ВидОбъекта="ПереводСредств" 
			ИЛИ ВидОбъекта="ВводОстатковДС" ИЛИ ВидОбъекта="Табель" 
			ИЛИ ВидОбъекта="АвансовыйОтчет" ИЛИ ВидОбъекта="ЭмиссияПодарочныхСертификатов" 
			ИЛИ ВидОбъекта="ПланПродаж2" ИЛИ ВидОбъекта="Распределение2" //Чирков 01.07.13
			Тогда //Адресация по подразделению
			
			Если ТипУзла=Перечисления.ТипУзлаИБ.Склад ИЛИ ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			ИначеЕсли ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				Запрос=Новый Запрос;
				Запрос.Текст=" 
				|ВЫБРАТЬ
				|	Ссылка
				|ИЗ
				|	ПланОбмена.Основной КАК Основной
				|ГДЕ
				|	Подразделение В (&Подразделения)
				|	И НЕ ПометкаУдаления
				|	И Ссылка<>&ЭтотУзел";
				
				Подразделения=Новый Массив;
				Если ВидОбъекта="ПереводСредств" Тогда
					Подразделения.Добавить(Объект.Источник_Подразделение);				
					Подразделения.Добавить(Объект.Получатель_Подразделение);					
				Иначе
					Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
						Подразделения.Добавить(Объект.Подразделение);					
					КонецЕсли;					
				КонецЕсли; 
				
				Запрос.УстановитьПараметр("Подразделения",Подразделения);
				Запрос.УстановитьПараметр("ЭтотУзел",ПараметрыСеанса.ЭтотУзел);
				
				Выборка=Запрос.Выполнить().Выбрать();
				
				Пока Выборка.Следующий() Цикл
					ДобавитьУзелВПолучателей(СписокПолучателей,Выборка.Ссылка,Отправитель,Загрузка);
				КонецЦикла; 
				//Катаев+ 21/11/13 Для РКО и ПКО, если плательщик контрагент, то добавляем в узлы по контрагенту
				Если ВидОбъекта="РасходныйКассовыйОрдер" ИЛИ ВидОбъекта="ПриходныйКассовыйОрдер" Тогда
					Если ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.Контрагенты") ТОгда
						ДобавитьВУзелФилиала(СписокПолучателей, Отправитель, Загрузка, Объект.Контрагент, УзелСклада);
						//Катаев+ 08/09/14
						ДокументВзаиморасчетов = Истина;
						//Катаев- 08/09/14
					КонецЕсли;
				КонецЕсли;
				//Катаев- 21/11/13
			КонецЕсли;	
		ИначеЕсли ВидОбъекта="ДвиженияДенежныхСредств" ИЛИ ВидОбъекта="КорректировкаЗадолженности" Тогда //Адресация по подразделению договора			
			Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда //Только выгрузка из ЦО
				сзКонтрагент = Новый СписокЗначений;
				Если ВидОбъекта="ДвиженияДенежныхСредств" Тогда
					Если Объект.БанковскийСчет.ВыгружатьВФилиал Тогда
						тУзел = ПланыОбмена.Основной.Выбрать();
						Пока тУзел.Следующий() Цикл
							Если Не тУзел.ПометкаУдаления И тУзел.ТипУзла = Перечисления.ТипУзлаИБ.ТорговоеПодразделение И тУзел.Подразделение.ЕстьВыделенныйСклад Тогда
								узел = ПланыОбмена.Основной.НайтиПоКоду(тУзел.Код);
								СписокПолучателей.Добавить(узел);
							КонецЕсли;
						КонецЦикла
					КонецЕсли;
				ИначеЕсли ВидОбъекта="КорректировкаЗадолженности" Тогда		
					Для Каждого стр Из Объект.Расчеты Цикл
						Если сзКонтрагент.НайтиПоЗначению(стр.Контрагент) = Неопределено Тогда
							сзКонтрагент.Добавить(стр.Контрагент);
						КонецЕсли;
					КонецЦикла;
					Для Каждого стр из Объект.Ссылка.Расчеты Цикл
						Если сзКонтрагент.НайтиПоЗначению(стр.Контрагент) = Неопределено Тогда
							сзКонтрагент.Добавить(стр.Контрагент);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				ДобавитьВУзелФилиалаСз(СписокПолучателей, Отправитель, Загрузка, сзКонтрагент, УзелСклада);
				ДокументВзаиморасчетов = Истина;
			КонецЕсли;
		ИначеЕсли ВидОбъекта="Взаимозачет" Тогда //Адресация по подразделению договора			
			Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда //Только выгрузка из ЦО
				сзКонтрагент = Новый СписокЗначений;
				Если Объект.Взаимозачеты.Количество() = 0 Тогда
					Если Объект.Контрагент_Дебитор = Объект.Контрагент_Кредитор Тогда
						сзКонтрагент.Добавить(Объект.Контрагент_Дебитор);
					Иначе
						сзКонтрагент.Добавить(Объект.Контрагент_Дебитор);
						сзКонтрагент.Добавить(Объект.Контрагент_Кредитор);
					КонецЕсли;
				Иначе
					тз = Объект.Взаимозачеты.Выгрузить(,"Контрагент_Дебитор,Контрагент_Кредитор");
					тз.Свернуть("Контрагент_Дебитор,Контрагент_Кредитор","");
					Для Каждого стр из тз Цикл
						Если стр.Контрагент_Дебитор = стр.Контрагент_Кредитор Тогда
							сзКонтрагент.Добавить(стр.Контрагент_Дебитор);
						Иначе
							сзКонтрагент.Добавить(стр.Контрагент_Дебитор);
							сзКонтрагент.Добавить(стр.Контрагент_Кредитор);
						КонецЕсли;
					КонецЦикла;
					тз = Объект.Ссылка.Взаимозачеты.Выгрузить(,"Контрагент_Кредитор");
					тз.Свернуть("Контрагент_Кредитор");
					Для Каждого стр из тз Цикл
						Если сзКонтрагент.НайтиПоЗначению(стр.Контрагент_Кредитор) = Неопределено Тогда
							сзКонтрагент.Добавить(стр.Контрагент_Кредитор);
						КонецЕсли;
					КонецЦикла;
					тз = Объект.Ссылка.Взаимозачеты.Выгрузить(,"Контрагент_Дебитор");
					тз.Свернуть("Контрагент_Дебитор");
					Для Каждого стр из тз Цикл
						Если сзКонтрагент.НайтиПоЗначению(стр.Контрагент_Дебитор) = Неопределено Тогда
							сзКонтрагент.Добавить(стр.Контрагент_Дебитор);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				ДобавитьВУзелФилиалаСз(СписокПолучателей, Отправитель, Загрузка, сзКонтрагент, УзелСклада);
				ДокументВзаиморасчетов = Истина;
			КонецЕсли;
			
			//крохин начало
		ИначеЕсли ВидОбъекта="Матрица" Тогда		
			Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				Выборка = ПланыОбмена.Основной.Выбрать();
				пока Выборка.Следующий() Цикл
					Если Выборка.ТипУзла = Перечисления.ТипУзлаИБ.Склад Тогда
						Если Выборка.Ссылка.Код<>"RI1" и Выборка.Ссылка.Код<>"RI2" тогда 
							ДобавитьУзелВПолучателей(СписокПолучателей,Выборка.Ссылка,Отправитель,Загрузка);	
						КонецЕсли;		
					КонецЕсли;
				КонецЦикла;
				Для Каждого Узел ИЗ Объект.Подразделения Цикл
					ДобавитьУзелВПолучателей(СписокПолучателей,Узел.подразделение,Отправитель,Загрузка);
				КонецЦикла;
			иначе			
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			КонецЕсли;
		ИначеЕсли ВидОбъекта="ЗаявкаВТранспортныйОтдел" Тогда	
			УзелСклада =  ПланыОбмена.Основной.НайтиПоКоду(Объект.Подразделение.КодФизическогоУзла77);
			Если Объект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе Тогда
			Иначе
				Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
					ДобавитьУзелВПолучателей(СписокПолучателей,Константы.УзелТранспортногоОтдела.Получить(),Отправитель,Загрузка);
					если не (ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение и УзелСклада.Подразделение.ЕстьВыделенныйСклад=Ложь) тогда
						ДобавитьУзелВПолучателей(СписокПолучателей,УзелСклада,Отправитель,Загрузка);
					КонецЕсли;
				ИначеЕсли ТипУзла=Перечисления.ТипУзлаИБ.Склад ИЛИ (ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение и ПараметрыСеанса.ЭтотУзел.Подразделение.ЕстьВыделенныйСклад) Тогда					
					ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
				КонецЕсли;			
			КонецЕсли;
		ИначеЕсли ВидОбъекта="ПродажаИМ" Тогда	
			Если Объект.СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена 
				ИЛИ Объект.СостояниеНакладной = Перечисления.СостоянияНакладной.ОжиданиеОплаты
				ИЛИ Объект.СостояниеНакладной = Перечисления.СостоянияНакладной.Доставлена Тогда
				Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
					ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);		
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ВидОбъекта="ЗаказПоставщику" И ( (Объект.Склад.код="SSP-04" и объект.СостояниеЗаказа=Перечисления.СостояниеЗаказаПоставщику.ВПути ) или Объект.ТранзитныйСклад.ТипСклада=Перечисления.ТипСклада.ВнешнийСклад) Тогда
			Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			Иначе
				УзелСклада =  ПланыОбмена.Основной.НайтиПоКоду(Объект.ТранзитныйСклад.КодФизическогоУзла);
				ДобавитьУзелВПолучателей(СписокПолучателей,УзелСклада,Отправитель,Загрузка);
			КонецЕсли;
			
			//Мессерле 9999
			Если объект.товары.количество()>0 тогда
				Заявка=объект.товары[0].ЗаявкаПоставщику;
				Если Заявка<>Неопределено и Объект.склад=Справочники.Склады.НайтиПоКоду("SSP-04") тогда //криво регистрируем для Риги 
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	Подразделения.КодФизическогоУзла77
					|ИЗ
					|	Справочник.Подразделения КАК Подразделения
					|ГДЕ
					|	Подразделения.ОсновнойСклад.ТипСклада = &ТипСклада";
					Запрос.УстановитьПараметр("ТипСклада",Перечисления.ТипСклада.ВнешнийСклад);
					Выборка = Запрос.Выполнить().Выбрать();
					Пока Выборка.Следующий() Цикл
						Если НЕ ПустаяСтрока(Выборка.КодФизическогоУзла77) Тогда
							УзелСклада =  ПланыОбмена.Основной.НайтиПоКоду(Выборка.КодФизическогоУзла77);	
							Если не УзелСклада.Пустая() Тогда
								ДобавитьУзелВПолучателей(СписокПолучателей,УзелСклада,Отправитель,Загрузка);	
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				Конецесли;
			Конецесли;
		ИначеЕсли ВидОбъекта="КоррекцияРегистраПартии" Тогда
			Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			Иначе 
				запрос=новый запрос;
				запрос.Текст=" ВЫБРАТЬ первые 1
				|	Склады.Ссылка
				|ИЗ
				|	Справочник.Склады КАК Склады
				|ГДЕ
				|	Склады.ТипСклада = ЗНАЧЕНИЕ(перечисление.ТипСклада.ВнешнийСклад) или Склады.ТипСклада = ЗНАЧЕНИЕ(перечисление.ТипСклада.ВнешнийСкладРезерв)";
				
				Выб=запрос.Выполнить().Выбрать();
				пока выб.Следующий() цикл
					УзелСклада =  ПланыОбмена.Основной.НайтиПоКоду(Выб.ссылка.КодФизическогоУзла);
					Если УзелСклада<>ПараметрыСеанса.ЭтотУзел тогда 
						ДобавитьУзелВПолучателей(СписокПолучателей,УзелСклада,Отправитель,Загрузка);
					Конецесли;
				Конеццикла;
			Конецесли;
		ИначеЕсли ВидОбъекта="РекомендованныйОстаток" Тогда
			
			Запрос=новый запрос();
			Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			Иначе 
				подр=объект.Подразделения;
				для каждого стр из подр цикл
					запрос=новый запрос("ВЫБРАТЬ
					|	Основной.Ссылка
					|ИЗ
					|	ПланОбмена.Основной КАК Основной
					|ГДЕ
					|	Основной.Подразделение В(&Подразделение)");
					запрос.УстановитьПараметр("Подразделение",стр.подразделение);
					выб=запрос.Выполнить().Выбрать();
					пока выб.Следующий() цикл
						ДобавитьУзелВПолучателей(СписокПолучателей,Выб.ссылка,Отправитель,Загрузка);
					КонецЦикла;
				Конеццикла;
				
			Конецесли;
			
		ИначеЕсли ВидОбъекта="Заказ" Тогда
			
			Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			Иначе 
				Если Объект.СостояниеНакладной=перечисления.СостояниеЗаказа.Утвержден тогда		
					запрос=новый запрос("ВЫБРАТЬ
					|	Основной.Ссылка
					|ИЗ
					|	ПланОбмена.Основной КАК Основной
					|ГДЕ
					|	Основной.Подразделение В(&Подразделение)");
					запрос.УстановитьПараметр("Подразделение",Объект.подразделение);
					выб=запрос.Выполнить().Выбрать();
					
					пока выб.Следующий() цикл
						ДобавитьУзелВПолучателей(СписокПолучателей,Выб.ссылка,Отправитель,Загрузка);
					конеццикла;
				Конецесли;
			Конецесли;
		ИначеЕсли ВидОбъекта="БлокировкаАкции" Тогда
			Запрос=Новый Запрос;
			Запрос.Текст="
			|ВЫБРАТЬ
			|	Ссылка
			|ИЗ
			|	ПланОбмена.Основной КАК Основной
			|ГДЕ
			|	Основной.Подразделение = &Подразделение И НЕ ПометкаУдаления";
			
			Запрос.УстановитьПараметр("Подразделение",Объект.Подразделение);
			Выборка=Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				СписокПолучателей.Добавить(Выборка.Ссылка);
			КонецЦикла;	
		ИначеЕсли ВидОбъекта = "КонтрактСПроизводителем" И Объект.ТоварыПартии.Количество() > 0 Тогда	
			Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Подразделения.КодФизическогоУзла77
				|ИЗ
				|	Справочник.Подразделения КАК Подразделения
				|ГДЕ
				|	Подразделения.ОсновнойСклад.ТипСклада = &ТипСклада";
				Запрос.УстановитьПараметр("ТипСклада",Перечисления.ТипСклада.ВнешнийСклад);
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					Если НЕ ПустаяСтрока(Выборка.КодФизическогоУзла77) Тогда
						УзелСклада =  ПланыОбмена.Основной.НайтиПоКоду(Выборка.КодФизическогоУзла77);	
						Если не УзелСклада.Пустая() Тогда
							ДобавитьУзелВПолучателей(СписокПолучателей,УзелСклада,Отправитель,Загрузка);	
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
		ИначеЕсли ВидОбъекта = "ТранспортнаяНакладная" или ВидОбъекта = "КоррекцияТоваров" Тогда
			Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				Если ЭтотУзел.Код<>"RI1" и ЭтотУзел.Код<>"RI2" тогда 
					ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
				КонецЕсли;
			Иначе
				Выборка = ПланыОбмена.Основной.Выбрать();
				пока Выборка.Следующий() Цикл
					Если Выборка.ТипУзла = Перечисления.ТипУзлаИБ.Склад Тогда
						Если Выборка.Ссылка.Код<>"RI1" и Выборка.Ссылка.Код<>"RI2" тогда 
							ДобавитьУзелВПолучателей(СписокПолучателей,Выборка.Ссылка,Отправитель,Загрузка);	
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		ИначеЕсли ВидОбъекта = "Контейнер" Тогда	
			Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			Иначе
				УзелСклада =  ПланыОбмена.Основной.НайтиПоКоду(Объект.Склад.КодФизическогоУзла);
				ДобавитьУзелВПолучателей(СписокПолучателей,УзелСклада,Отправитель,Загрузка);
			КонецЕсли;
		ИначеЕсли ВидОбъекта = "Претензия" Тогда
			Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			Иначе
				УзелСклада =  ПланыОбмена.Основной.НайтиПоКоду(Объект.Склад.КодФизическогоУзла);
				ДобавитьУзелВПолучателей(СписокПолучателей,УзелСклада,Отправитель,Загрузка);
				ДобавитьВУзелФилиала(СписокПолучателей, Отправитель, Загрузка, Объект.Контрагент, УзелСклада);
				ДокументВзаиморасчетов = Истина;
			КонецЕсли;
		ИначеЕсли ВидОбъекта = "КоррекцияРНК" 
				
			Тогда
			Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			Иначе
				УзелСклада =  ПланыОбмена.Основной.НайтиПоКоду(Объект.Склад.КодФизическогоУзла);
				ДобавитьУзелВПолучателей(СписокПолучателей,УзелСклада,Отправитель,Загрузка);
			КонецЕсли;			
		//Нечаева 26,09,25 ++	
		ИначеЕсли  ВидОбъекта = "РасхожденияКодовМаркировкиМП" 
			
			Тогда
			Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			Иначе
				УзелСклада =  ПланыОбмена.Основной.НайтиПоКоду("OD7");
				ДобавитьУзелВПолучателей(СписокПолучателей,УзелСклада,Отправитель,Загрузка);
			КонецЕсли;
	    //Нечаева 26,09,25 --

		ИначеЕсли ВидОбъекта = "РегистрацияДисконтнойКарты" Тогда
			Если ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				Если НЕ Объект.ТЦРегистрации.Пустая() Тогда
					УзелТЦ =  ПланыОбмена.Основной.НайтиПоКоду(Объект.ТЦРегистрации.КодФизическогоУзла77);
					ДобавитьУзелВПолучателей(СписокПолучателей,УзелТЦ,Отправитель,Загрузка);
				КонецЕсли;
			Иначе
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);	
			КонецЕсли;
		ИначеЕсли ВидОбъекта = "УслугиСтороннихОрганизаций"	 Тогда
			Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			Иначе
				ДобавитьВУзелФилиала(СписокПолучателей, Отправитель, Загрузка,Объект.Контрагент);
				ДокументВзаиморасчетов = Истина;
			КонецЕсли;
		ИначеЕсли ВидОбъекта="ПриходМатериаловИТары" или ВидОбъекта="РасходМатериаловИТары" тогда
			Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			КонецЕсли;
		ИначеЕсли ВидОбъекта="ХранилищеПодарочныхСертификатов" тогда	
			ДокОснОбъект=Объект.ДокОбъект;
			если ДокОснОбъект.метаданные().имя="Перемещение" тогда
				Склад			=Объект.Склад;
				СкладПолучатель =Объект.СкладПолучатель;
				если склад=Справочники.Склады.ПустаяСсылка() тогда
					склад =ДокОснОбъект.склад;
				КонецЕсли;
				если СкладПолучатель=Справочники.Склады.ПустаяСсылка() тогда
					СкладПолучатель =ДокОснОбъект.СкладПолучатель;
				КонецЕсли;

				УзелСклада				=ПланыОбмена.Основной.НайтиПоКоду(Склад.КодФизическогоУзла);
				УзелСкладаПолучателя	=ПланыОбмена.Основной.НайтиПоКоду(СкладПолучатель.КодФизическогоУзла);
				
				Если НЕ (СкладПолучатель.ФизическийСклад=Склад ИЛИ СкладПолучатель=Склад.ФизическийСклад ИЛИ (СкладПолучатель.ФизическийСклад = Склад.ФизическийСклад И Не ПустаяСтрока(Склад.ФизическийСклад))) Тогда //виртуалки пропускаем
					Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда	
						ДобавитьУзелВПолучателей(СписокПолучателей,УзелСкладаПолучателя,Отправитель,Загрузка);
						Если ДокОснОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе Тогда
						ИначеЕсли ДокОснОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ПолученоОфисом Тогда
						Иначе						
							ДобавитьУзелВПолучателей(СписокПолучателей,УзелСклада,Отправитель,Загрузка);						
						КонецЕсли; 
						Если ДокОснОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена
							ИЛИ ДокОснОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ОтгруженаНаТранзитныйСклад Тогда //накладные на склад получатель отправляем только после отгрузки
							Если ДокОснОбъект.СостояниеНакладнойУПолучателя.Пустая() Тогда
								ДокОснОбъект.СостояниеНакладнойУПолучателя=Перечисления.СостоянияНакладной.КОтправкеНаСклад;						
							КонецЕсли;
						КонецЕсли;					
					ИначеЕсли ТипУзла=Перечисления.ТипУзлаИБ.Склад ИЛИ ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда	
						ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
					КонецЕсли;			
				КонецЕсли;
			иначе
				Склад		=ДокОснОбъект.Склад;			
				УзелСклада	=ПланыОбмена.Основной.НайтиПоКоду(Склад.КодФизическогоУзла);
				Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда		
					ДобавитьУзелВПолучателей(СписокПолучателей,УзелСклада,Отправитель,Загрузка);
				ИначеЕсли ТипУзла=Перечисления.ТипУзлаИБ.Склад ИЛИ ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
					ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);				
				КонецЕсли;						
			КонецЕсли;
		ИначеЕсли ВидОбъекта="Доставка" Тогда
			Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда		
				ДобавитьУзелВПолучателей(СписокПолучателей,Константы.УзелТранспортногоОтдела.Получить(),Отправитель,Загрузка);
			Иначе
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			КонецЕсли;	
		ИначеЕсли ВидОбъекта="ЗаказКлиентаFBS" Тогда
			Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда		
				ДобавитьУзелВПолучателей(СписокПолучателей,Константы.УзелТранспортногоОтдела.Получить(),Отправитель,Загрузка);
			Иначе
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка); //Тимофеев Ю.А. 22.01.25 ASU-1952	
			КонецЕсли;	
		ИначеЕсли ВидОбъекта="ПеремещениеМатериаловИТары" тогда
			Склад			=Объект.Склад;
			СкладПолучатель =Объект.СкладПолучатель;
			
			УзелСклада				=ПланыОбмена.Основной.НайтиПоКоду(Склад.КодФизическогоУзла);
			УзелСкладаПолучателя	=ПланыОбмена.Основной.НайтиПоКоду(СкладПолучатель.КодФизическогоУзла);
			
			Если НЕ (СкладПолучатель.ФизическийСклад=Склад ИЛИ СкладПолучатель=Склад.ФизическийСклад ИЛИ (СкладПолучатель.ФизическийСклад = Склад.ФизическийСклад И Не ПустаяСтрока(Склад.ФизическийСклад))) Тогда //виртуалки пропускаем
				Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда		
					Если Объект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе Тогда
					ИначеЕсли Объект.СостояниеНакладной=Перечисления.СостоянияНакладной.ПолученоОфисом Тогда
					Иначе						
						ДобавитьУзелВПолучателей(СписокПолучателей,УзелСклада,Отправитель,Загрузка);						
					КонецЕсли; 
					Если Объект.СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена
						ИЛИ Объект.СостояниеНакладной=Перечисления.СостоянияНакладной.ОтгруженаНаТранзитныйСклад Тогда //накладные на склад получатель отправляем только после отгрузки
						Если Объект.СостояниеНакладнойУПолучателя.Пустая() Тогда
							Объект.СостояниеНакладнойУПолучателя=Перечисления.СостоянияНакладной.КОтправкеНаСклад;						
						КонецЕсли;
						ДобавитьУзелВПолучателей(СписокПолучателей,УзелСкладаПолучателя,Отправитель,Загрузка);						
					КонецЕсли;					
				ИначеЕсли ТипУзла=Перечисления.ТипУзлаИБ.Склад ИЛИ ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда		
					Если Склад.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код И Объект.СостояниеНакладной<>Перечисления.СостоянияНакладной.ВРаботе Тогда
						ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
					ИначеЕсли СкладПолучатель.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код И Объект.СостояниеНакладнойУПОлучателя<>Перечисления.СостоянияНакладной.ВРаботе Тогда
						ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);						
					КонецЕсли;					
				КонецЕсли;			
			КонецЕсли;			
			
		ИначеЕсли ВидОбъекта="АктПриемкиМашины" Тогда
			Склад		=Объект.Склад;			
			УзелСклада	=ПланыОбмена.Основной.НайтиПоКоду(Склад.КодФизическогоУзла);
			
			Если Объект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе Тогда
			Иначе
				Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда					
					ДобавитьУзелВПолучателей(СписокПолучателей,УзелСклада,Отправитель,Загрузка);					
				ИначеЕсли ТипУзла=Перечисления.ТипУзлаИБ.Склад Тогда
					ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
				КонецЕсли;			
			КонецЕсли;
		ИначеЕсли ВидОбъекта = "ОплатаЧерезККМ" Тогда 
			Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			КонецЕсли;
		ИначеЕсли ВидОбъекта = "ЗаявкаНаПерепаковку" Тогда
			Если ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда                       
            	ДобавитьУзелВПолучателей(СписокПолучателей,Константы.УзелТранспортногоОтдела.Получить(),Отправитель,Загрузка);
            Иначе
            	ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			КонецЕсли;
		//++Данилова Е.В. 06.02.2026 SNL-109
		ИначеЕсли  ВидОбъекта = "БлокировкаВыдачиВНабор" Тогда
			Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			Иначе
				УзелСклада =  ПланыОбмена.Основной.НайтиПоКоду("OD7");
				ДобавитьУзелВПолучателей(СписокПолучателей,УзелСклада,Отправитель,Загрузка);
			КонецЕсли;
		//--Данилова Е.В. 06.02.2026
		КонецЕсли;
	ИначеЕсли ТипОбъекта="Справочник" Тогда
		Если ВидОбъекта="ТипыЦен" И НЕ Объект.ЭтоГруппа И Объект.Розничный И ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда			
			СписокПолучателейЦен=ПолучитьСписокПолучателейЦен(Объект.Ссылка);			
			Для Каждого Получатель Из СписокПолучателейЦен Цикл
				СписокПолучателей.Добавить(Получатель);			
			КонецЦикла;  
		ИначеЕсли 	ВидОбъекта="Контрагенты" 
			ИЛИ ВидОбъекта="Договоры" 
			ИЛИ ВидОбъекта="БанковскиеСчета" 
			ИЛИ ВидОбъекта="ПунктыДоставки" 
			ИЛИ ВидОбъекта="ТипыАтрикуловКонтрагентов" 
			ИЛИ ВидОбъекта="КодыПоставщиков" 
			ИЛИ ВидОбъекта="АртикулыКонтрагентов"
			ИЛИ ВидОбъекта="ВыгружаемыеДокументыЕКОД"
			ИЛИ ВидОбъекта="МакетыЭтикетокКонтрагента"			
			ИЛИ ВидОбъекта="ШтрихКодыКонтрагентов" Тогда
			ТекСписокПолучателей=ПолучитьСписокПолучателейИнформацииОКонтрагентах();
			Если 	ВидОбъекта="Контрагенты" И Объект.ЭтоГруппа Тогда
				Выборка=ПланыОбмена.Основной.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если Выборка.Ссылка=ПараметрыСеанса.ЭтотУзел Тогда Продолжить КонецЕсли;				
					Если Выборка.ОтключитьЗагрузкуСправочников Тогда Продолжить КонецЕсли;
					
					СписокПолучателей.Добавить(Выборка.Ссылка);
				КонецЦикла; 
			КонецЕсли;
			
			Для Каждого Получатель Из ТекСписокПолучателей Цикл
				СписокПолучателей.Добавить(Получатель);			
			КонецЦикла;
			
			//выгружаем фактические адреса складов аналогично складам
			Если ВидОбъекта="ПунктыДоставки" И Объект.Владелец.Метаданные().Имя = "Склады" Тогда
				Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
					Выборка=ПланыОбмена.Основной.Выбрать();
					Пока Выборка.Следующий() Цикл
						Если Выборка.Ссылка=ПараметрыСеанса.ЭтотУзел Тогда Продолжить КонецЕсли;				
						Если Выборка.ОтключитьЗагрузкуСправочников Тогда Продолжить КонецЕсли;
						
						СписокПолучателей.Добавить(Выборка.Ссылка);
					КонецЦикла; 
				КонецЕсли;
			КонецЕсли;
			Если  ВидОбъекта="СостояниеНакладнойУКлиента"  ТОгда
				Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
					ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
				Иначе 
					// из ЦО должно уйти на склады.  
					Попытка
						СписокПолучателей.Добавить(ПланыОбмена.Основной.НайтиПоКоду("OD7"));
					Исключение
					КонецПопытки;
				конецЕсли;
			конецЕсли;
			Если ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				Если ВидОбъекта="Договоры" ИЛИ ВидОбъекта = "ВыгружаемыеДокументыЕКОД" Тогда
					ДобавитьВУзелФилиала(СписокПолучателей, Отправитель, Загрузка, Объект.Владелец);
				ИначеЕсли ВидОбъекта="Контрагенты" ТОгда
					ДобавитьВУзелФилиала(СписокПолучателей, Отправитель, Загрузка, Объект.Ссылка,,Истина);
				КонецЕсли;
			КонецЕсли;
			Если ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				Если ВидОбъекта="БанковскиеСчета" Тогда
					Если Объект.ВыгружатьВФилиал Тогда
						тУзел = ПланыОбмена.Основной.Выбрать();
						Пока тУзел.Следующий() Цикл
							Если Не тУзел.ПометкаУдаления И тУзел.ТипУзла = Перечисления.ТипУзлаИБ.ТорговоеПодразделение И тУзел.Подразделение.ЕстьВыделенныйСклад Тогда
								узел = ПланыОбмена.Основной.НайтиПоКоду(тУзел.Код);
								СписокПолучателей.Добавить(узел);
							КонецЕсли;
						КонецЦикла
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			//ДК не грузим на склады и в филиалы, со складов и филиалов
		ИначеЕсли ВидОбъекта="ДисконтныеКарты" ИЛИ ВидОбъекта = "ПодарочныеСертификаты" Тогда
			Если ТипУзла = Перечисления.ТипУзлаИБ.Склад ИЛИ (ПараметрыСеанса.ЕстьВыделенныйСклад И НЕ ПараметрыСеанса.ЭтотУзел.Код = "SEM") Тогда	
				Возврат СписокПолучателей;
			КонецЕсли;
			Если ВидОбъекта="ДисконтныеКарты" И Объект<>Неопределено И Объект.Ликвидирована Тогда
				Возврат СписокПолучателей;			
			КонецЕсли; 
			
			Запрос=Новый Запрос;
			Запрос.Текст="
			|ВЫБРАТЬ
			|	Ссылка
			|ИЗ
			|	ПланОбмена.Основной КАК Основной
			|ГДЕ
			|	Ссылка <> &ЭтотУзел
			|	И НЕ ПометкаУдаления
			|	И ТипУзла <> ЗНАЧЕНИЕ(Перечисление.ТипУзлаИБ.Склад)	
			|	И (Подразделение.КодФизическогоУзла77 = ""SEM"" ИЛИ НЕ Подразделение.ЕстьВыделенныйСклад ИЛИ Подразделение =ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))"; //Чирков 03.06.13 SP0 с пустым подразделением
			
			Запрос.УстановитьПараметр("ЭтотУзел",ПланыОбмена.Основной.ЭтотУзел());
			
			Выборка=Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл				
				СписокПолучателей.Добавить(Выборка.Ссылка);
			КонецЦикла;
		ИначеЕсли ВидОбъекта="Склады" Тогда
			Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				Выборка=ПланыОбмена.Основной.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если Выборка.Ссылка=ПараметрыСеанса.ЭтотУзел Тогда Продолжить КонецЕсли;				
					Если Выборка.ОтключитьЗагрузкуСправочников Тогда Продолжить КонецЕсли;
					
					СписокПолучателей.Добавить(Выборка.Ссылка);
				КонецЦикла; 
			КонецЕсли;						
		ИначеЕсли ВидОбъекта="Кассы" Тогда
			Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				Если НЕ Объект.ЭтоГруппа Тогда
					Если НЕ Объект.РозничныйСклад.Пустая() И НЕ ПустаяСтрока(Объект.РозничныйСклад.КодФизическогоУзла) Тогда
						СписокПолучателей.Добавить(ПланыОбмена.Основной.НайтиПоКоду(Объект.РозничныйСклад.КодФизическогоУзла));				
					КонецЕсли; 				
					Если Объект.ВыгружатьВФилиал Тогда
						тУзел = ПланыОбмена.Основной.Выбрать();
						Пока тУзел.Следующий() Цикл
							Если Не тУзел.ПометкаУдаления И тУзел.ТипУзла = Перечисления.ТипУзлаИБ.ТорговоеПодразделение И тУзел.Подразделение.ЕстьВыделенныйСклад Тогда
								узел = ПланыОбмена.Основной.НайтиПоКоду(тУзел.Код);
								СписокПолучателей.Добавить(узел);
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				Иначе
					Выборка=ПланыОбмена.Основной.Выбрать();
					Пока Выборка.Следующий() Цикл
						Если Выборка.Ссылка=ПараметрыСеанса.ЭтотУзел Тогда Продолжить КонецЕсли;				
						Если Выборка.ОтключитьЗагрузкуСправочников Тогда Продолжить КонецЕсли;
						
						СписокПолучателей.Добавить(Выборка.Ссылка);
					КонецЦикла; 
				КонецЕсли;
			Иначе
				СписокПолучателей.Добавить(ПараметрыСеанса.ЭтотУзел.УправляющийУзел);
			КонецЕсли;		
		ИначеЕсли ВидОбъекта="Акции" Тогда
			Запрос=Новый Запрос;
			Запрос.Текст="
			|ВЫБРАТЬ
			|	Ссылка
			|ИЗ
			|	ПланОбмена.Основной КАК Основной
			|ГДЕ
			|	Основной.Подразделение В(&СписокПодразделений) И НЕ ПометкаУдаления";
			
			Запрос.УстановитьПараметр("СписокПодразделений",Объект.Подразделения.ВыгрузитьКолонку("Подразделение"));
			Выборка=Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				СписокПолучателей.Добавить(Выборка.Ссылка);
			КонецЦикла;
		иначеесли  	ВидОбъекта="Партии" или ВидОбъекта="КонтрактыСПроизводителем" тогда
			Выборка=ПланыОбмена.Основной.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.ОтключитьЗагрузкуСправочников Тогда Продолжить КонецЕсли;
				Если Выборка.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда Продолжить КонецЕсли; 
				Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
					Если ПланыОбмена.Основной.ЭтотУзел() <> Выборка.Ссылка Тогда
						СписокПолучателей.Добавить(Выборка.Ссылка);
					КонецЕсли;
				иначеесли  Выборка.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
					СписокПолучателей.Добавить(Выборка.Ссылка);  //Передать в ЦО
				Конецесли;
			КонецЦикла; 
			//электронные сертификаты
		ИначеЕсли  	ВидОбъекта="ЭлектронныеСертификаты" Тогда
			Если ПараметрыСеанса.ТипУзла <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			КонецЕсли;
		ИначеЕсли ВидОбъекта = "ТипыКоробов" или ВидОбъекта = "ТарифыДоставки" или ВидОбъекта = "СтоимостиДоставки"  Тогда
			Если ПараметрыСеанса.ТипУзла <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			Иначе
				Выборка=ПланыОбмена.Основной.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если Выборка.Ссылка=ПараметрыСеанса.ЭтотУзел Тогда Продолжить КонецЕсли;				
					Если Выборка.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда Продолжить КонецЕсли;
					
					СписокПолучателей.Добавить(Выборка.Ссылка);
				КонецЦикла;
			КонецЕсли;
		ИначеЕсли ВидОбъекта = "ШтрихКоды" Тогда
			Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение ИЛИ ТипУзла=Перечисления.ТипУзлаИБ.Склад Тогда
				Запрос=Новый Запрос;
				Запрос.Текст="
				|ВЫБРАТЬ
				|	Ссылка
				|ИЗ
				|	ПланОбмена.Основной КАК Основной
				|ГДЕ
				|	Ссылка <> &ЭтотУзел
				|	И НЕ ПометкаУдаления";
				
				Если Объект.ТипШК<>Перечисления.ТипыШтрихКодов.Штука Тогда
					Запрос.Текст=Запрос.Текст+"
					|	И
					|	(
					|		ТипУзла = ЗНАЧЕНИЕ(Перечисление.ТипУзлаИБ.Склад)
					|		ИЛИ ТипУзла = ЗНАЧЕНИЕ(Перечисление.ТипУзлаИБ.УправляющееПодразделение)
					|		ИЛИ Подразделение.ЕстьВыделенныйСклад
					|	)";				
				КонецЕсли;				
				
				Запрос.УстановитьПараметр("ЭтотУзел",ПланыОбмена.Основной.ЭтотУзел());
				
				Выборка=Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл				
					СписокПолучателей.Добавить(Выборка.Ссылка);
				КонецЦикла;				
			КонецЕсли;
		ИначеЕсли ВидОбъекта="СтатистикаОбменов" Тогда
			Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			КонецЕсли;	
			//крохин начало 29.01.2016
		ИначеЕсли ВидОбъекта = "Упаковка" Тогда
			Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				Выборка=ПланыОбмена.Основной.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если Выборка.Ссылка=ПараметрыСеанса.ЭтотУзел Тогда Продолжить КонецЕсли;				
					Если Выборка.ТипУзла<>Перечисления.ТипУзлаИБ.Склад Тогда Продолжить КонецЕсли;					
					СписокПолучателей.Добавить(Выборка.Ссылка);
				КонецЦикла;
			КонецЕсли;
			//Чек листы	
		ИначеЕсли ВидОбъекта = "ЧекЛисты" или  ВидОбъекта = "ВидыТребованийКЕдинице" или  ВидОбъекта = "ВидыТребованийККоробу" или  ВидОбъекта = "ВидыТребованийКПаллете"  Тогда
			Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				Выборка=ПланыОбмена.Основной.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если Выборка.Ссылка=ПараметрыСеанса.ЭтотУзел Тогда Продолжить КонецЕсли;				
					Если Выборка.ТипУзла<>Перечисления.ТипУзлаИБ.Склад Тогда Продолжить КонецЕсли;					
					СписокПолучателей.Добавить(Выборка.Ссылка);
				КонецЦикла;
			ИначеЕсли ТипУзла=Перечисления.ТипУзлаИБ.Склад тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			КонецЕсли;
			//адреса антор грузим только на склад и со склада
		ИначеЕсли ВидОбъекта = "АндресАнтор" Тогда
			Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				Выборка=ПланыОбмена.Основной.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если Выборка.Ссылка=ПараметрыСеанса.ЭтотУзел Тогда Продолжить КонецЕсли;				
					Если Выборка.ТипУзла<>Перечисления.ТипУзлаИБ.Склад Тогда Продолжить КонецЕсли;					
					СписокПолучателей.Добавить(Выборка.Ссылка);
				КонецЦикла;
			ИначеЕсли ТипУзла=Перечисления.ТипУзлаИБ.Склад тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			КонецЕсли;
			//ЦО
		ИначеЕсли ВидОбъекта = "ГТД" 
			ИЛИ ВидОбъекта = "Декларация"
			ИЛИ ВидОбъекта = "ГТД"
			ИЛИ ВидОбъекта = "ЗначенияСвойствОбъектов"
			ИЛИ ВидОбъекта = "Размеры"
			ИЛИ ВидОбъекта = "ФизическиеЛица"
			ИЛИ ВидОбъекта = "Цвета"		
			Тогда
			Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				Запрос=Новый Запрос;
				Запрос.Текст="
				|ВЫБРАТЬ
				|	Ссылка
				|ИЗ
				|	ПланОбмена.Основной КАК Основной
				|ГДЕ
				|	Ссылка <> &ЭтотУзел
				|	И НЕ ПометкаУдаления";			
				
				Запрос.УстановитьПараметр("ЭтотУзел",ПланыОбмена.Основной.ЭтотУзел());
				
				Выборка=Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл				
					СписокПолучателей.Добавить(Выборка.Ссылка);
				КонецЦикла;
			КонецЕсли;	
			//ЦО, склад
		ИначеЕсли ВидОбъекта = "Номенклатура"
			ИЛИ ВидОбъекта = "Единицы"		
			Тогда
			Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				Запрос=Новый Запрос;
				Запрос.Текст="
				|ВЫБРАТЬ
				|	Ссылка
				|ИЗ
				|	ПланОбмена.Основной КАК Основной
				|ГДЕ
				|	Ссылка <> &ЭтотУзел
				|	И НЕ ПометкаУдаления";			
				
				Запрос.УстановитьПараметр("ЭтотУзел",ПланыОбмена.Основной.ЭтотУзел());
				
				Выборка=Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл				
					СписокПолучателей.Добавить(Выборка.Ссылка);
				КонецЦикла;
			ИначеЕсли ТипУзла=Перечисления.ТипУзлаИБ.Склад тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			КонецЕсли;
		ИначеЕсли ВидОбъекта = "Автомобили"
			ИЛИ ВидОбъекта = "ВидыДопОбработки"
			ИЛИ ВидОбъекта = "НастройкиПечатиПодКонтрагента"		     
			ИЛИ ВидОбъекта = "МатериалыСостав"
			Тогда
			Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				Запрос=Новый Запрос;
				Запрос.Текст="
				|ВЫБРАТЬ
				|	Ссылка
				|ИЗ
				|	ПланОбмена.Основной КАК Основной
				|ГДЕ
				|	Ссылка <> &ЭтотУзел
				|	И НЕ ПометкаУдаления";			
				
				Запрос.УстановитьПараметр("ЭтотУзел",ПланыОбмена.Основной.ЭтотУзел());
				
				Выборка=Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл	
					Если  выборка.ссылка.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение и не выборка.ссылка.Подразделение.ЕстьВыделенныйСклад тогда			 
						Продолжить;
					КонецЕсли;				 
					СписокПолучателей.Добавить(Выборка.Ссылка);
				КонецЦикла;
			ИначеЕсли ТипУзла=Перечисления.ТипУзлаИБ.Склад ИЛИ ПланыОбмена.Основной.ЭтотУзел().Подразделение.ЕстьВыделенныйСклад тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			КонецЕсли;
			//Склад и Филиал
		ИначеЕсли ВидОбъекта = "ТНВЭД" тогда
			Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				Запрос=Новый Запрос;
				Запрос.Текст="ВЫБРАТЬ
				|	Основной.Ссылка КАК Ссылка
				|ИЗ
				|	ПланОбмена.Основной КАК Основной
				|ГДЕ
				|	Основной.Ссылка <> &ЭтотУзел
				|	И НЕ Основной.ПометкаУдаления
				|	И (Основной.ТипУзла = &ТипУзла
				|			ИЛИ Основной.Подразделение.ЕстьВыделенныйСклад)";			
				
				Запрос.УстановитьПараметр("ЭтотУзел",ПланыОбмена.Основной.ЭтотУзел());
				запрос.УстановитьПараметр("ТипУзла",Перечисления.ТипУзлаИБ.Склад);
				
				Выборка=Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл				
					СписокПолучателей.Добавить(Выборка.Ссылка);
				КонецЦикла;
			КонецЕсли;
			// теперь только между складом и ЦО
		ИначеЕсли ВидОбъекта="ВремяПриемки" тогда
			Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда		
				ДобавитьУзелВПолучателей(СписокПолучателей,Константы.УзелТранспортногоОтдела.Получить(),Отправитель,Загрузка);
			Иначе
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			КонецЕсли;	
		// Кухарь А.Ю. 20.03.2026 начало
		// SNL-137
		ИначеЕсли ВидОбъекта="ВидыНоменклатурыДляЭтикеток" тогда
			Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда		
				ДобавитьУзелВПолучателей(СписокПолучателей,ОбщегоНазначения_ПИ.ПолучитьЗначениеКонстанты("УзелТранспортногоОтдела"),Отправитель,Загрузка);
			КонецЕсли;				
		// Кухарь А.Ю. 20.03.2026 конец
			
		ИначеЕсли ВидОбъекта = "Подразделения"
			ИЛИ ВидОбъекта = "Пользователи"		
			Тогда
			Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				Запрос=Новый Запрос;
				Запрос.Текст="
				|ВЫБРАТЬ
				|	Ссылка
				|ИЗ
				|	ПланОбмена.Основной КАК Основной
				|ГДЕ
				|	Ссылка <> &ЭтотУзел
				|	И НЕ ПометкаУдаления";			
				
				Запрос.УстановитьПараметр("ЭтотУзел",ПланыОбмена.Основной.ЭтотУзел());
				
				Выборка=Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл				
					СписокПолучателей.Добавить(Выборка.Ссылка);
				КонецЦикла;
			Иначе
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			КонецЕсли;
			//причины коррекций грузим из ЦО на склад и в филиал
		ИначеЕсли ВидОбъекта = "ПричиныКоррекций" Тогда
			Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				Запрос=Новый Запрос;
				Запрос.Текст="ВЫБРАТЬ
				|	Основной.Ссылка КАК Ссылка
				|ИЗ
				|	ПланОбмена.Основной КАК Основной
				|ГДЕ
				|	Основной.Ссылка <> &ЭтотУзел
				|	И НЕ Основной.ПометкаУдаления";			
				
				Запрос.УстановитьПараметр("ЭтотУзел",ПланыОбмена.Основной.ЭтотУзел());
				
				Выборка=Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					ТекУзел =  Выборка.Ссылка;
					Если Ложь Тогда
						ТекУзел = ПараметрыСеанса.ЭтотУзел;
					КонецЕсли;
					Если ТекУзел.ТипУзла = Перечисления.ТипУзлаИБ.Склад ИЛИ ТекУзел.Подразделение.ЕстьВыделенныйСклад Тогда
						СписокПолучателей.Добавить(ТекУзел);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		ИначеЕсли ВидОбъекта = "РолиИсполнителей" Тогда
			Если ТипУзла=Перечисления.ТипУзлаИБ.Склад тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			ИначеЕсли ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
				СписокКодовУзлов=новый СписокЗначений;
				
				СписокКодовУзлов.Добавить("OD7");
				
				для каждого СтрСписка из СписокКодовУзлов цикл
					ДобавитьУзелВПолучателей(СписокПолучателей,ПланыОбмена.Основной.НайтиПоКоду(СтрСписка.Значение),Отправитель,Загрузка);
				КонецЦикла;
			КонецЕсли;   
		КонецЕсли; 
	ИначеЕсли ТипОбъекта="РегистрСведений" Тогда
		Если ВидОбъекта="История" Тогда
			Для Каждого Запись Из Объект Цикл
				Если Запись.Реквизит="НомерГТД" ИЛИ Запись.Реквизит="Подразделение" ИЛИ Запись.Реквизит="Декларация" Тогда
					Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда 
						
					Иначе
						ЗапросУзлы = Новый Запрос;
						ЗапросУзлы.Текст = "ВЫБРАТЬ
						|	Основной.Ссылка
						|ИЗ
						|	ПланОбмена.Основной КАК Основной
						|ГДЕ
						|	НЕ Основной.ПометкаУдаления";
						Выборка = ЗапросУзлы.Выполнить().Выбрать();
						Пока Выборка.Следующий() Цикл
							Если Выборка.Ссылка=ЭтотУзел Тогда Продолжить КонецЕсли; //на всякий пожарный
							
							СписокПолучателей.Добавить(Выборка.Ссылка);
						КонецЦикла;			
					КонецЕсли;			
				КонецЕсли;				
			КонецЦикла;			
		ИначеЕсли ВидОбъекта="РассогласованияОбъектов" Тогда
			Для Каждого Запись Из Объект Цикл
				Выборка=ПланыОбмена.Основной.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					Если Выборка.Ссылка=ЭтотУзел Тогда Продолжить КонецЕсли; //на всякий пожарный
					Если ОбменДанными.Загрузка И ОбменДанными.Отправитель=Выборка.Ссылка Тогда Продолжить КонецЕсли; //в обратку не отправляем
					Если НЕ(Выборка.Код=Запись.КодУзла1 ИЛИ Выборка.Код=Запись.КодУзла2) Тогда Продолжить КонецЕсли; //Узлы рассогласования не совпадают с получателем
					
					СписокПолучателей.Добавить(Выборка.Ссылка);
				КонецЦикла;
			КонецЦикла;			
			// Данные для печати этикеток
		ИначеЕсли ВидОбъекта="ЗначенияСвойствОбъектов" тогда
			Если ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
				ТЗУзлов=ПолучитьТаблицуУзловОсновногоОбмена(Истина,Истина);			
				Для каждого СтрокаУзла из ТЗУзлов Цикл								
					СписокПолучателей.Добавить(СтрокаУзла.Узел);
				КонецЦикла;				
			КонецЕсли;				
		ИначеЕсли ВидОбъекта="ИННКонтрагентов" Тогда	
			Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			Иначе 
				// из ЦО должно уйти в филиалы, склады.
				Попытка
					СписокПолучателейИНН=ПолучитьСписокПолучателейИННКонтрагентов();
					Для Каждого Получатель Из СписокПолучателейИНН Цикл
						СписокПолучателей.Добавить(Получатель);						
					КонецЦикла;
				Исключение
					
				КонецПопытки;
			КонецЕсли;
		ИначеЕсли ВидОбъекта="СостояниеЭлектронногоУПД" 
			//Нечаева 12,12,25++   MARK-3107
			или  ВидОбъекта="СостояниеЭУПД_в_ЧЗ"
			//Нечаева 12,12,25 -- MARK-3107
			Тогда //или ВидОбъекта="СостояниеЭлектрУПДРучнаяКорр" Тогда	
			//нечаева 16,05,18--
			Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			Иначе 
				// из ЦО должно уйти в филиалы, склады.   сделаем как ИНН ходят.
				Попытка
					СписокПолучателейИНН=ПолучитьСписокПолучателейИННКонтрагентов();
					Для Каждого Получатель Из СписокПолучателейИНН Цикл
						СписокПолучателей.Добавить(Получатель);						
					КонецЦикла;
				Исключение
					
				КонецПопытки;
			КонецЕсли;
			// для обмена заказами с интернет магазинами.
		ИначеЕсли  ВидОбъекта="СостояниеНакладнойУКлиента" или ВидОбъекта="ID_FBS" или ВидОбъекта="ИнформацияШКЛН_FBS"  ТОгда
			
			Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			Иначе 
				// из ЦО должно уйти на склады.  
				Попытка
					СписокПолучателей.Добавить(ПланыОбмена.Основной.НайтиПоКоду("OD7"));
				Исключение
				КонецПопытки;
			конецЕсли;
		ИначеЕсли ВидОбъекта="GLNКонечногоПокупателя" Тогда	
			Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			Иначе 
				// из ЦО должно уйти в филиалы, склады.   сделаем как ИНН ходят.
				Попытка
					СписокПолучателей.Добавить(ПланыОбмена.Основной.НайтиПоКоду("OD7"));
				Исключение
					
				КонецПопытки;
		КонецЕсли;
		ИначеЕсли ВидОбъекта="РезервированиеШКGS1" Тогда
			Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			Иначе 
				// из ЦО должно на склад часцы.  
				Попытка
					КодУзлаЧасцы = "OD7";
					УзелСклада = ПланыОбмена.Основной.НайтиПоКоду(КодУзлаЧасцы);
					//УзелСклада =  ПланыОбмена.Основной.НайтиПоКоду(Объект.Склад.КодФизическогоУзла);
					ДобавитьУзелВПолучателей(СписокПолучателей,УзелСклада,Отправитель,Загрузка);
					///----------------------------
					КодУзлаЧасцы = "EKF";    //филиал
					УзелСклада = ПланыОбмена.Основной.НайтиПоКоду(КодУзлаЧасцы);
					//УзелСклада =  ПланыОбмена.Основной.НайтиПоКоду(Объект.Склад.КодФизическогоУзла);
					ДобавитьУзелВПолучателей(СписокПолучателей,УзелСклада,Отправитель,Загрузка);

					
				Исключение
					
				КонецПопытки;
			КонецЕсли;
		//нечаева 03,09,20----

			//нечаева 20,02,18+++ склад, филиал, офис
		ИначеЕсли ВидОбъекта="ЗначенияСвойствОбъектовУПД" Тогда	
			Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			Иначе 
				// из ЦО должно уйти в филиалы, склады.   сделаем как ИНН ходят.
				Попытка
					СписокПолучателей.Добавить(ПланыОбмена.Основной.НайтиПоКоду("OD7"));
				Исключение
					
				КонецПопытки;
			КонецЕсли;
		ИначеЕсли ВидОбъекта="ОтправкаЭлектронныхДокументов" Тогда
			Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				// грузим только на склад. в офис не надо
			Иначе 
				Попытка
					// пока только часцы
					КодУзлаЧасцы = "OD7";
					УзелСклада = ПланыОбмена.Основной.НайтиПоКоду(КодУзлаЧасцы);
					ДобавитьУзелВПолучателей(СписокПолучателей,УзелСклада,Отправитель,Загрузка);
				Исключение
					
				КонецПопытки;
			КонецЕсли;
		ИначеЕсли ВидОбъекта="УчитыватьВычеркиВТорг12" Тогда	
			Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			Иначе 
				попытка
					// на склад отправим.
					УзелСклада=ПланыОбмена.Основной.НайтиПоКоду(Объект.отбор.документ.значение.склад.КодФизическогоУзла);
					
					//ДобавитьУзелВПолучателей(СписокПолучателей,УзелСклада,Отправитель,Загрузка);
					Если УзелСклада <> ЭтотУзел Тогда
						ДобавитьУзелВПолучателей(СписокПолучателей,УзелСклада,Отправитель,Загрузка);
					КонецЕсли;
				исключение
				конецПопытки;
				
			КонецЕсли;
			//нечаева начало 28,11,16---
			//Кухарь А.Ю  23.06.2024 начало
			//
		ИначеЕсли ВидОбъекта="СкидкиКонтрагентов" Тогда
			Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			иначе
				ТЗУзлов=ПолучитьТаблицуУзловОсновногоОбмена(Истина,Истина);			
				Для каждого СтрокаУзла из ТЗУзлов Цикл								
					СписокПолучателей.Добавить(СтрокаУзла.Узел);
				КонецЦикла;		
			КонецЕсли;
			//Кухарь А.Ю  23.06.2024 конец
			
		ИначеЕсли ВидОбъекта="КоличествоПосетителей" Тогда	
			Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			Иначе 
				Попытка
					КодУзлаТЦ = Объект.Отбор.Подразделение.Значение.КодФизическогоУзла77;
					СписокПолучателей.Добавить(ПланыОбмена.Основной.НайтиПоКоду(КодУзлаТЦ));
				Исключение
				КонецПопытки;
			КонецЕсли;
		ИначеЕсли ВидОбъекта="СостояниеДокументов" Тогда
			Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			Иначе	
				СЗ = Объект.ВыгрузитьКолонку("КодУзлаПолучателя");
				Для Каждого Элемент Из СЗ Цикл
					УзелСклада	=ПланыОбмена.Основной.НайтиПоКоду(Элемент);
					Если НЕ УзелСклада.Пустая() Тогда
						ДобавитьУзелВПолучателей(СписокПолучателей,УзелСклада,Отправитель,Загрузка);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		ИначеЕсли ВидОбъекта="СверкиИтоговБН" тогда
			Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			КонецЕсли;
		ИначеЕсли ВидОбъекта="РеквизитыРНКПНКПРМ" тогда
			если Объект.отбор.документ.значение.метаданные().имя="ЗаявкаВТранспортныйОтдел" тогда 
				ДобавитьУзелВПолучателей(СписокПолучателей,Константы.УзелТранспортногоОтдела.Получить(),Отправитель,Загрузка);
			иначе
				УзелСклада=ПланыОбмена.Основной.НайтиПоКоду(Объект.отбор.документ.значение.склад.КодФизическогоУзла);
				Если УзелСклада <> ЭтотУзел Тогда
					ДобавитьУзелВПолучателей(СписокПолучателей,УзелСклада,Отправитель,Загрузка);
				КонецЕсли;
			КонецЕсли;		
		ИначеЕсли  ВидОбъекта="ПисьмаНаОтправку" тогда	
			Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение и ТипЗнч(Объект.Отбор.Основание.значение)<>Тип("ДокументСсылка.ЗаявкаНаДоставку") Тогда							
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			КонецЕсли;
			
		ИначеЕсли ВидОбъекта="РеквизитыДокументов" Тогда
			
			Если ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			КонецЕсли;
			Если (Объект.Отбор.ИмяРеквизита.значение = "ВерхнийШКЭтикетки" 
				 или Объект.Отбор.ИмяРеквизита.значение = "ВремяПриемкиДляЗОГ" 
				 // Кухарь А.Ю. 22.10.2025 начало
				 // HELP-5978
				 //++Данилова Е.В. 18.12.2025 HELP-8148 
				// или Объект.Отбор.ИмяРеквизита.значение = "Связь_РНК_ПРМ"
				 или СтрНайти(Объект.Отбор.ИмяРеквизита.значение,"Связь_РНК_ПРМ") > 0 
				 //--Данилова Е.В. 18.12.2025 
				 // Кухарь А.Ю. 22.10.2025 конец		
				) и ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение  Тогда	 
				 ДобавитьУзелВПолучателей(СписокПолучателей,Константы.УзелТранспортногоОтдела.Получить(),Отправитель,Загрузка);			 
			КонецЕсли;
		ИначеЕсли ВидОбъекта="ПериодическиеРеквизитыДокументовИСправочников" тогда
			Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				если объект.отбор.ИмяРеквизита.Значение="ЮридическийАдрес" тогда
					Выборка=ПланыОбмена.Основной.Выбрать();
					Пока Выборка.Следующий() Цикл
						СписокПолучателей.Добавить(Выборка.Ссылка);
					КонецЦикла; 
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ВидОбъекта="РеквизитыТЧ_Товары_РНКПНКПРМ" ИЛИ ВидОбъекта = "ТЗнаДОКонтрагентов" Тогда
			Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,Константы.УзелТранспортногоОтдела.Получить(),Отправитель,Загрузка);
			КонецЕсли;
		ИначеЕсли ВидОбъекта="КонтактнаяИнформация" тогда
			Если ТипУзла=Перечисления.ТипУзлаИБ.Склад тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			КонецЕсли;
		ИначеЕсли ВидОбъекта="ИнформацияШКЛН" или ВидОбъекта="РеквизитыСправочников" тогда	
			Если ТипУзла=Перечисления.ТипУзлаИБ.Склад тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			ИначеЕсли ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
				СписокКодовУзлов=новый СписокЗначений;
				СписокКодовУзлов.Добавить("ODN");
				СписокКодовУзлов.Добавить("ODM");
				СписокКодовУзлов.Добавить("OD7");
				
				для каждого СтрСписка из СписокКодовУзлов цикл
					ДобавитьУзелВПолучателей(СписокПолучателей,ПланыОбмена.Основной.НайтиПоКоду(СтрСписка.Значение),Отправитель,Загрузка);
				КонецЦикла;
			КонецЕсли;
		ИначеЕсли ВидОбъекта="ИнформацияШКПаллеты" тогда
			Если ТипУзла=Перечисления.ТипУзлаИБ.Склад тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			ИначеЕсли ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
				СписокКодовУзлов=новый СписокЗначений;
				СписокКодовУзлов.Добавить("ODN");
				СписокКодовУзлов.Добавить("ODM");
				СписокКодовУзлов.Добавить("OD7");
				
				для каждого СтрСписка из СписокКодовУзлов цикл
					ДобавитьУзелВПолучателей(СписокПолучателей,ПланыОбмена.Основной.НайтиПоКоду(СтрСписка.Значение),Отправитель,Загрузка);
				КонецЦикла;
			КонецЕсли;			
		ИначеЕсли ВидОбъекта="ИсполнителиЗадач" тогда
			Если ТипУзла=Перечисления.ТипУзлаИБ.Склад тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			ИначеЕсли ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
				СписокКодовУзлов=новый СписокЗначений;
				
				СписокКодовУзлов.Добавить("OD7");
				
				для каждого СтрСписка из СписокКодовУзлов цикл
					ДобавитьУзелВПолучателей(СписокПолучателей,ПланыОбмена.Основной.НайтиПоКоду(СтрСписка.Значение),Отправитель,Загрузка);
				КонецЦикла;
			КонецЕсли;   
		КонецЕсли;		
	ИначеЕсли ТипОбъекта="РегистрНакопления" Тогда    //с некоторых пор не выгружаем и не загружаем
	ИначеЕсли ТипОбъекта="БизнесПроцесс" Тогда    
		Если ВидОбъекта="РасформированиеНакладной" тогда
			Если ТипУзла=Перечисления.ТипУзлаИБ.Склад тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			ИначеЕсли ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
				СписокКодовУзлов=новый СписокЗначений;
				
				СписокКодовУзлов.Добавить("OD7");
				
				для каждого СтрСписка из СписокКодовУзлов цикл
					ДобавитьУзелВПолучателей(СписокПолучателей,ПланыОбмена.Основной.НайтиПоКоду(СтрСписка.Значение),Отправитель,Загрузка);
				КонецЦикла;
			КонецЕсли;   
		КонецЕсли;
	ИначеЕсли ТипОбъекта="Задача" Тогда    
		Если ВидОбъекта="ЗадачиПользователя" тогда
			Если ТипУзла=Перечисления.ТипУзлаИБ.Склад тогда
				ДобавитьУзелВПолучателей(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
			ИначеЕсли ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
				СписокКодовУзлов=новый СписокЗначений;
				
				СписокКодовУзлов.Добавить("OD7");
				
				для каждого СтрСписка из СписокКодовУзлов цикл
					ДобавитьУзелВПолучателей(СписокПолучателей,ПланыОбмена.Основной.НайтиПоКоду(СтрСписка.Значение),Отправитель,Загрузка);
				КонецЦикла;
			КонецЕсли;   
		КонецЕсли;
	КонецЕсли;	
	Возврат СписокПолучателей;
	
КонецФункции // ПолучитьСписокПолучателейОбъекта()

//Мессерле
Процедура УстановитьПолучателейИзмененийОбъектаВнешние(Объект)	Экспорт
	
	ЭтотУзел	=ПланыОбмена.ВнешниеКлиенты.ЭтотУзел();		
	ТипОбъекта	=ТипОбъекта(Объект);
	ВидОбъекта	=Объект.Метаданные().Имя;
	ОбменДанными=Объект.ОбменДанными;
	
	//Мессерле 25,10,2012 -по пунктам доставки
	Если ВидОбъекта="РасходнаяНакладная" и ЗначениеЗаполнено(объект.ПунктДоставки) Тогда
		Если ЗначениеЗаполнено(объект.ПунктДоставки.УзелОбменаВнешнихКлиентов) тогда
			ОбменДанными.Получатели.Добавить(объект.ПунктДоставки.УзелОбменаВнешнихКлиентов);
		Конецесли;
	Конецесли;	
	
	//Катаев+ 24/09/14 Типы цен теперь будут браться из карточки внешнего клиента
	//Если ВидОбъекта="ПрайсЛист" и (объект.ТипЦен.код="SNL-0229" или объект.ТипЦен.код="SSP-0314" или объект.ТипЦен.код="SSP-0333 ") Тогда //Коды дал Гришаков  ));//Катаев+ 20/06/14 добавил прайс по белью
	//	уз=планыобмена.ВнешниеКлиенты.Выбрать();
	//	пока уз.Следующий() цикл
	//		если Уз.Ссылка<>планыобмена.ВнешниеКлиенты.ЭтотУзел() тогда
	//			ОбменДанными.Получатели.Добавить(уз.ссылка);
	//		Конецесли;
	//	Конеццикла;
	//Конецесли;	
	Если ВидОбъекта="ПрайсЛист" Тогда
		уз=планыобмена.ВнешниеКлиенты.Выбрать();
		пока уз.Следующий() цикл
			//крохин начало 30.09.2020
			Если уз.ПометкаУдаления Тогда Продолжить; КонецЕсли;
			//крохин конец 30.09.2020
			если Уз.Ссылка<>планыобмена.ВнешниеКлиенты.ЭтотУзел() тогда
				Если уз.ТипыЦен.Количество() = 0 Тогда
					// Если типы цен не указаны, то проверяем входит ли тип цен в следующие - (0) Оптовый Базовый Ценовой Лист (ОБЦЛ), SALE ОПТ (оптовые клиенты) или Базовый прайс  - БЕЛЬЕ
					Если объект.ТипЦен.код="SNL-0229" или объект.ТипЦен.код="SSP-0314" или объект.ТипЦен.код="SNL-0333" Тогда
						ОбменДанными.Получатели.Добавить(уз.ссылка);
					КонецЕсли;
				Иначе
					для Каждого типЦен из уз.ТипыЦен Цикл
						Если типЦен.ТипЦен = объект.ТипЦен Тогда
							ОбменДанными.Получатели.Добавить(уз.ссылка);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			Конецесли;
		Конеццикла;
	Конецесли;	
	//Катаев- 24/09/14
	//Катаев+ 17/06/14 Регистрация справочников Номенклатуры и ШК
	Если ВидОбъекта = "Номенклатура" или ВидОбъекта = "ШтрихКоды" Тогда
		уз=планыобмена.ВнешниеКлиенты.Выбрать();
		Если ВидОбъекта = "Номенклатура" Тогда
			текОбъект = Объект.Ссылка;
		Иначе
			текОбъект = Объект.Владелец.Ссылка;
		КонецЕсли;
		пока уз.Следующий() цикл
			//крохин начало 30.09.2020
			Если уз.ПометкаУдаления Тогда Продолжить; КонецЕсли;
			//крохин конец 30.09.2020
			Если Уз.Ссылка <> ПланыОбмена.ВнешниеКлиенты.ЭтотУзел() Тогда
				Если Уз.ВыгружаемаяНоменклатура.Количество() = 0 Тогда
					ОбменДанными.Получатели.Добавить(уз.ссылка);
				Иначе
					Запрос = Новый запрос;
					Запрос.Текст =
					"ВЫБРАТЬ
					|	ВнешниеКлиентыВыгружаемаяНоменклатура.Номенклатура
					|ПОМЕСТИТЬ тз
					|ИЗ
					|	ПланОбмена.ВнешниеКлиенты.ВыгружаемаяНоменклатура КАК ВнешниеКлиентыВыгружаемаяНоменклатура
					|ГДЕ
					|	ВнешниеКлиентыВыгружаемаяНоменклатура.Ссылка = &Узел
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	тз.Номенклатура
					|ИЗ
					|	тз КАК тз
					|ГДЕ
					|	тз.Номенклатура В (&сзНоменклатура)";
					сзНоменклатура = Новый СписокЗначений;
					Пока текОбъект.Уровень() <> 0 Цикл
						сзНоменклатура.Добавить(текОбъект);
						текОбъект = текОбъект.Родитель;
					КонецЦикла;
					сзНоменклатура.Добавить(текОбъект);
					Запрос.УстановитьПараметр("сзНоменклатура", сзНоменклатура);
					Запрос.УстановитьПараметр("Узел", уз.ссылка);
					выборка = запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда
						ОбменДанными.Получатели.Добавить(уз.ссылка);
					КонецЕсли;
				КонецЕсли;
			Конецесли;
		Конеццикла;
	КонецЕсли;
	//Катаев- 17/06/14
КонецПроцедуры
//Мессерле

Процедура УстановитьПолучателейИзмененийОбъекта(Объект)	Экспорт
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли; 
	
	ОбменДанными=Объект.ОбменДанными;
	
	ЭтотУзел	=ПланыОбмена.Основной.ЭтотУзел();		
	ТипУзла		=ПараметрыСеанса.ТипУзла;
	
	ТипОбъекта	=ТипОбъекта(Объект);
	ВидОбъекта	=Объект.Метаданные().Имя;
	
	//ОбменДанными.Получатели.Очистить();
	СписокПолучателей=ПолучитьСписокПолучателейИзмененийОбъекта(Объект);
	Для Каждого Получатель Из СписокПолучателей Цикл		
		УзелПолучатель=Получатель.Значение;
		Если ТипОбъекта="Документ" И УзелПолучатель.ОтключитьОбменДокументами Тогда
			Если ВидОбъекта="УстановкаСкидок" ИЛИ ВидОбъекта="ПрайсЛист" ИЛИ ВидОбъекта="ПланПродаж" Тогда
			Иначе
				Продолжить;			
			КонецЕсли;			
		КонецЕсли;
		Если НЕ УзелПолучатель.Пустая() и УзелПолучатель <> ЭтотУзел Тогда
			ОбменДанными.Получатели.Добавить(УзелПолучатель);		
		КонецЕсли;		
	КонецЦикла;	
	
	//Отправка подтверждений о приеме накладных складом или магазином
	Если ТипОбъекта="Документ" И ОбменДанными.Загрузка И ОбменДанными.Отправитель<>Неопределено Тогда
		Отправитель				=ОбменДанными.Отправитель;
		
		Если НЕ Объект.Ссылка.Пустая() И ПланыОбмена.ИзменениеЗарегистрировано(Отправитель,Объект) И СписокПолучателей.НайтиПоЗначению(Отправитель)=Неопределено Тогда	
			ОбменДанными.Отправитель
			=Неопределено;
			ОбменДанными.Получатели.Добавить(Отправитель);
		КонецЕсли; 
		
		Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			Если ВидОбъекта="Перемещение" Тогда
				Если Объект.СостояниеНакладнойУПолучателя=Перечисления.СостоянияНакладной.КОтправкеВОфис Тогда
					Объект.СостояниеНакладнойУПолучателя=Перечисления.СостоянияНакладной.ПолученоОфисом;				
					
					ОбменДанными.Отправитель=Неопределено;
					ОбменДанными.Получатели.Добавить(Отправитель);
				ИначеЕсли Объект.СостояниеНакладной=Перечисления.СостоянияНакладной.КОтправкеВОфис Тогда
					Объект.СостояниеНакладной=Перечисления.СостоянияНакладной.ПолученоОфисом;				
					
					ОбменДанными.Отправитель=Неопределено;
					ОбменДанными.Получатели.Добавить(Отправитель);					
				КонецЕсли;		
			ИначеЕсли (ВидОбъекта="РасходнаяНакладная" ИЛИ ВидОбъекта="ПриходнаяНакладная") И Объект.СостояниеНакладной=Перечисления.СостоянияНакладной.КОтправкеВОфис Тогда
				Объект.СостояниеНакладной=Перечисления.СостоянияНакладной.ПолученоОфисом;
				
				ОбменДанными.Отправитель=Неопределено;
				ОбменДанными.Получатели.Добавить(Отправитель);
			КонецЕсли;
		ИначеЕсли ТипУзла=Перечисления.ТипУзлаИБ.Склад ИЛИ ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
			Если Отправитель<>Неопределено Тогда
				Если (ВидОбъекта="РасходнаяНакладная" ИЛИ ВидОбъекта="ПриходнаяНакладная" ИЛИ ВидОбъекта="Комплектация" ИЛИ ВидОбъекта="АктПриемкиМашины") И Объект.СостояниеНакладной=Перечисления.СостоянияНакладной.КОтправкеНаСклад Тогда
					Объект.СостояниеНакладной=Перечисления.СостоянияНакладной.ПолученоСкладом;			
					
					ОбменДанными.Отправитель=Неопределено;
					ОбменДанными.Получатели.Добавить(Отправитель);					
				ИначеЕсли ВидОбъекта="Перемещение" Тогда
					Если Объект.Склад.КодФизическогоУзла=ЭтотУзел.Код И Объект.СостояниеНакладной=Перечисления.СостоянияНакладной.КОтправкеНаСклад Тогда
						Объект.СостояниеНакладной=Перечисления.СостоянияНакладной.ПолученоСкладом;
						
						ОбменДанными.Отправитель=Неопределено;
						ОбменДанными.Получатели.Добавить(Отправитель);		
					ИначеЕсли Объект.СкладПолучатель.КодФизическогоУзла=ЭтотУзел.Код И Объект.СостояниеНакладнойУПолучателя=Перечисления.СостоянияНакладной.КОтправкеНаСклад Тогда				
						Объект.СостояниеНакладнойУПолучателя=Перечисления.СостоянияНакладной.ПолученоСкладом;
						
						ОбменДанными.Отправитель=Неопределено;
						ОбменДанными.Получатели.Добавить(Отправитель);		
					КонецЕсли;					
				КонецЕсли;				
			КонецЕсли;		
		КонецЕсли;
		
		Если ВидОбъекта="ЗаявкаНаОтгрузку" И ЭтотУзел=Константы.УзелТранспортногоОтдела.Получить() И Объект.СостояниеНакладной=Перечисления.СостоянияНакладной.КОтправкеНаСклад Тогда
			Объект.СостояниеНакладной=Перечисления.СостоянияНакладной.ПолученоСкладом; 
			
			ОбменДанными.Отправитель=Неопределено;
			ОбменДанными.Получатели.Добавить(Отправитель);							
		КонецЕсли; 
	КонецЕсли;	
КонецПроцедуры


//Возвращает Узел текущей ИБ для заданного узла
Функция ПолучитьЭтотУзел(Узел) Экспорт
	Возврат ПланыОбмена[Узел.Метаданные().Имя].ЭтотУзел();
КонецФункции // ПолучитьЭтотУзел()


//РАБОТА С ФАЙЛАМИ ОБМЕНА
// Функция получения файла с новым сообщением обмена
// Ищет и копирует в указанный файл файл с последним сообщением обмена
//
// Параметры:
//  ИмяФайла	- файл, в который будет произведено копирование файла с сообщением обмена
//
// Возвращаемое значение:
//  Булево - Истина - если файл с сообщением обмена получен и Ложь - в противном случае
//

// Функция получает имя файла обмена
// Формирует имя файла обмена для двух узлов
//
// Параметры:
//  УзелИсточник - ссылка на узел-источник сообщения обмена
//  УзелПриемник - ссылка на узел-приемник сообщения обмена
//  Постфикс - строка, добавляемая в конец имени файла
//
// Возвращаемое значение:
//  ИмяФайла - строка с именем файла
//
Функция ПолучитьИмяФайлаОбмена(УзелИсточник, УзелПриемник, Постфикс = "",Расширение="xml") Экспорт
	
	// формируем имя файла, исходя из кодов источника и приемника сообщения обмена
	Возврат "Msg_" + СокрЛП(УзелИсточник.Код) + "_" + СокрЛП(УзелПриемник.Код)+"_" + СокрЛП(Постфикс) + "."+Расширение;
	
КонецФункции // ПолучитьИмяФайлаОбмена(УзелИсточник, УзелПриемник, Постфикс = "")

Функция ПолучитьФайлОбмена(Знач ИмяФайла,Узел,Распаковывать=Истина) Экспорт
	// Выбираем метод получения файла обмена
	Если Узел.Переключатель = 0 Тогда //Локальная сеть
		// Получаем копию файла обмена с новым сообщением во временный файл
		Возврат ПолучитьФайлОбменаСеть(ИмяФайла,Узел,Распаковывать);		
	ИначеЕсли Узел.Переключатель = 1 Тогда //E-Mail			
		// Получаем файл обмена с новым сообщением во временный файл
		Возврат  ПринятьФайлОбменаМыло(ИмяФайла,Узел)		
	ИначеЕсли Узел.Переключатель = 2 Тогда //Очередь MSMQ				
		Возврат  ПолучитьФайлОбменаИЗОчереди(ИмяФайла,Узел);				
	ИначеЕсли Узел.Переключатель = 3 Тогда //Очередь IBMMQ					
		Возврат  ПолучитьФайлОбменаИЗОчередиWSMQ(ИмяФайла,Узел);								
	ИначеЕсли Узел.Переключатель = 4 Тогда
		Возврат  ПолучитьФайлОбменаFTP(ИмяФайла,Узел);
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции // ПолучитьФайлОбмена()

Функция ОтправитьФайлОбмена(ИмяФайла,НомерСообщения,Узел,Архивировать=Истина) Экспорт
	Результат=Новый Структура("Результат,Описание",Истина,Неопределено);		
	
	Если Узел.Переключатель = 0 Тогда 		
		// Публикуем файл с сообщением обмена
		РезультатОтправки=ОпубликоватьФайлОбмена(ИмяФайла, НомерСообщения,Узел,Архивировать);				
		
		Результат.Вставить("Результат",	РезультатОтправки.Результат);
		Результат.Вставить("Описание",	РезультатОтправки.Описание);
	ИначеЕсли Узел.Переключатель = 1 Тогда			
		ОтправитьФайлОбменаМыло(ИмяФайла, НомерСообщения,Узел);   		
	ИначеЕсли Узел.Переключатель = 2 Тогда				
		ПоместитьДанныеОбменаВОчередь(ИмяФайла, НомерСообщения,Узел);			
	ИначеЕсли Узел.Переключатель = 3 Тогда				
		ПоместитьДанныеОбменаВОчередьWSMQ(ИмяФайла, НомерСообщения,Узел);
	ИначеЕсли Узел.Переключатель = 4 Тогда					
		РезультатОтправки=ОтправитьФайлОбменапоFTP(ИмяФайла, НомерСообщения,Узел);			
		
		Результат.Вставить("Результат",	РезультатОтправки.Результат);
		Результат.Вставить("Описание",	РезультатОтправки.Описание);
	КонецЕсли;
	
	Попытка		
		// Удаляем файл с сообщением обмена
		УдалитьФайлы(ИмяФайла);		
	Исключение
		ЗаписатьВЛог("ОбменДанными","Ошибка удаления файла: """+ИмяФайла+""" !","Ошибка");
	КонецПопытки;	
	
	Возврат Результат;	
КонецФункции // ОтправитьФалОбмена()

Функция ПолучитьФайлОбменаСеть(ИмяФайла, Узел, Распаковывать=Истина) Экспорт
	
	// Получаем маску для поиска файлов с сообщениями обмена
	МаскаФайлов = ПолучитьИмяФайлаОбмена(Узел,ПланыОбмена[Узел.Метаданные().Имя].ЭтотУзел(), "??????????",?(Распаковывать,"zip","xml"));
	
	ИмяФайлаСообщения = "";
	// Ищем файлы по маске в каталоге загрузки
	Файлы = НайтиФайлы(Узел.АдресОбмена, МаскаФайлов);
	
	// Отбираем файл с максимальным номером в имени
	Для Каждого Файл Из Файлы Цикл		
		Если ПустаяСтрока(ИмяФайлаСообщения) Или Файл.ПолноеИмя > ИмяФайлаСообщения Тогда			
			ИмяФайлаСообщения = Файл.ПолноеИмя;			
		КонецЕсли;			
	КонецЦикла;
	
	Если Не ПустаяСтрока(ИмяФайлаСообщения) Тогда		
		ЗаписатьВЛог("ОбменДаннымиОсновной","Получение файла: "+ИмяФайлаСообщения,Перечисления.ТипыСообщенийЛога.Информация);	
		
		Если Распаковывать Тогда
			ИмяАрхива			=ИмяФайлаСообщения;
			ИмяФайлаСообщения	=ПолучитьЧастьИмениФайла(ИмяАрхива,"ПолноеИмяБезРасширения")+".xml";
			
			Попытка
				ЧтениеZIP=Новый ЧтениеZipФайла;
				
				ЧтениеZIP=Новый ЧтениеZipФайла(ИмяАрхива);
				ЧтениеZIP.ИзвлечьВсе(ПолучитьЧастьИмениФайла(ИмяАрхива,"ПолныйПуть"),РежимВосстановленияПутейФайловZIP.НеВосстанавливать);		
			Исключение
				ЗаписатьВЛог("ОбменДаннымиОсновной","Ошибка распаковки файла: "+ИмяФайлаСообщения+". "+ОписаниеОшибки(),Перечисления.ТипыСообщенийЛога.Ошибка);								
				Возврат Ложь;
			КонецПопытки;			
		КонецЕсли;		
		
		//ПереместитьФайл(ИсходноеИмяФайла,ИмяФайла);
		
		Попытка			
			// Копируем файл с сообщением обмена в указанный файл
			ПереместитьФайл(ИмяФайлаСообщения, ИмяФайла);			
		Исключение			
			ЗаписатьВЛог("ОбменДаннымиОсновной","Ошибка перемещения файла: """+ИмяФайлаСообщения+""" - """+ИмяФайла+""". "+ОписаниеОшибки(),Перечисления.ТипыСообщенийЛога.Ошибка);				
			Возврат Ложь;			
		КонецПопытки;
		
		// Файл с сообщением обмена получен успешно
		Возврат Истина;		
	КонецЕсли;	
	
	Возврат Ложь;	
КонецФункции // ПолучитьФайлОбмена(ИмяФайла)

Функция ПолучитьФайлОбменаFTP(ИмяФайла,Узел)
	
	// Получаем маску для поиска файлов с сообщениями обмена
	МаскаФайлов = ПолучитьИмяФайлаОбмена(Узел.Ссылка, ПланыОбмена[Узел.Метаданные().Имя].ЭтотУзел(), "??????????","zip");
	
	ИмяФайлаСообщения = "";
	
	Соединение=УстановитьFTPСоединение(Узел.АдресОбмена,Узел.Пользователь,Узел.Пароль,,Узел.ПассивныйРежим);
	Если Соединение=Неопределено Тогда
		ЗаписатьВЛог("ОбменДаннымиОсновной","Ошибка установки соединения с FTP сервером: "+Узел.АдресОбмена,Перечисления.ТипыСообщенийЛога.Ошибка,Истина);		
		Возврат Ложь;	
	КонецЕсли;
	
	КаталогНаСервере="/"+?(ПустаяСтрока(Узел.КаталогFTP),"",Узел.КаталогFTP+"/");
	
	
	ИмяФайлаСообщения = "";
	
	// Ищем файлы по маске в каталоге загрузки
	Файлы = Соединение.НайтиФайлы(КаталогНаСервере, МаскаФайлов);
	
	// Отбираем файл с максимальным номером в имени
	Для Каждого Файл Из Файлы Цикл		
		Если ПустаяСтрока(ИмяФайлаСообщения) Или Файл.ПолноеИмя > ИмяФайлаСообщения Тогда			
			ИмяФайлаСообщения = Файл.ПолноеИмя;			
		КонецЕсли;		
	КонецЦикла;
	
	КаталогЗагрузки	=ПолучитьЧастьИмениФайла(ИмяФайла,"ПолныйПуть");
	
	ИмяАрхива		=КаталогЗагрузки+ПолучитьЧастьИмениФайла(ИмяФайлаСообщения,"Имя");
	ИсходноеИмяФайла=КаталогЗагрузки+ПолучитьЧастьИмениФайла(ИмяФайлаСообщения,"ИмяБезРасширения")+".xml";
	
	Если Не ПустаяСтрока(ИмяФайлаСообщения) Тогда
		ЗаписатьВЛог("ОбменДаннымиОсновной","Получение файла: " + ИмяФайлаСообщения,Перечисления.ТипыСообщенийЛога.Информация);		
		
		Попытка			
			// Копируем файл с сообщением обмена в указанный файл
			Соединение.Получить(ИмяФайлаСообщения, ИмяАрхива);
			
			ЧтениеZIP=Новый ЧтениеZipФайла(ИмяАрхива);
			ЧтениеZIP.ИзвлечьВсе(ПолучитьЧастьИмениФайла(ИмяАрхива,"ПолныйПуть"),РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
			
			ПереместитьФайл(ИсходноеИмяФайла,ИмяФайла);			
		Исключение
			ЗаписатьВЛог("ОбменДаннымиОсновной","Ошибка получения файла: " + ИмяФайлаСообщения+". "+ОписаниеОшибки(),Перечисления.ТипыСообщенийЛога.Ошибка);
			Возврат Ложь;			
		КонецПопытки;
		
		// Файл с сообщением обмена получен успешно
		Возврат Истина;		
	КонецЕсли;	
	
	Возврат Ложь;	
КонецФункции // ПолучитьФайлОбмена(ИмяФайла)

// Функция получения файла с новым сообщением обмена по электронной почте
// Ищет и записывает в указанный файл файл с последним сообщением обмена
//
// Параметры:
//  ИмяФайла - файл, в который будет записан файл с сообщением обмена
//
// Возвращаемое значение:
//  Булево - Истина - если файл с сообщением обмена получен и Ложь - в противном случае
//
Функция ПринятьФайлОбменаМыло(ИмяФайла,Узел)
	ЭтотУзел=ПланыОбмена[Узел.Метаданные().Имя].ЭтотУзел();
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.АдресСервераPOP3 = Узел.СерверPOP3;
	Профиль.Пользователь = Узел.Пользователь;
	Профиль.Пароль = Узел.Пароль;
	
	Попытка
		
		Почта = Новый ИнтернетПочта;
		Почта.Подключиться(Профиль);
		
		// Получаем все сообщения из почтового ящика
		МассивСообщений = Новый Массив;
		МассивСообщений = Почта.Выбрать(Ложь);
		
	Исключение
		
		// Ошибка при подключении к серверу или при приеме сообщения обмена
		Сообщить(" - Ошибка при подключении или приеме" + ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;
	
	// Далее все оставшиеся сообщения в МассивСообщенийОбмена, и только они, 
	// будут удалены с сервера. Это исключает удаление личных сообщений из
	// почтового ящика.
	МассивСообщенийОбмена = Новый Массив;
	
	Если МассивСообщений.Количество() = 0 Тогда
		
		// Сообщений в почтовом ящике нет
		Возврат Ложь;
		
	КонецЕсли;
	
	ИмяФайлаСообщения = "";
	Для Индекс = 0 По МассивСообщений.Количество() - 1 Цикл
		
		// Отсеиваем только сообщения, которые содержат файлы обмена 
		// для участвующих в обмене узлов.
		ЧастьТемы = "СООБЩЕНИЕ_ОБМЕНА: " + "Message" + СокрП(Узел.Код) + "_" + СокрП(ПланыОбмена.Оснвной.ЭтотУзел().Код);
		Если Лев(МассивСообщений[Индекс].Тема, СтрДлина(ЧастьТемы)) = ЧастьТемы Тогда
			
			Если МассивСообщений[Индекс].Вложения[0].Имя > ИмяФайлаСообщения Тогда
				
				// Выбираем сообщение с последним номером сообщения обмена
				ИмяФайлаСообщения = МассивСообщений[Индекс].Вложения[0].Имя;
				ИндексСообщения = Индекс;
				
			КонецЕсли;	
			
			МассивСообщенийОбмена.Добавить(МассивСообщений[Индекс]);
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Если ИндексСообщения <> Неопределено Тогда 
		
		// Записываем файл обмена во временный файл
		МассивСообщений[ИндексСообщения].Вложения[0].Данные.Записать(ИмяФайла);
		
		Сообщить(" - Принят файл обмена данными " + ИмяФайлаСообщения + " с адреса " + Узел.ПочтовыйАдресОбмена);
		
		// Удаляем все сообщения обмена с сервера для узлов, участвующих в обмене
		Почта.УдалитьСообщения(МассивСообщенийОбмена);
		Почта.Отключиться();        
		Возврат Истина;
		
	Иначе
		
		// Сообщений обмена в почтовом ящике нет
		Почта.Отключиться();        
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции // ПринятьФайлОбмена(ИмяФайла)

// Функция получения файла с новым сообщением обмена из очереди
// Выбирает из очереди сообщение обмена и сохраняет в файле
//
// Параметры:
//  ИмяФайла - файл, в который будет произведено копирование файла с сообщением обмена
//
// Возвращаемое значение:
//  Булево - Истина - если файл с сообщением обмена получен и Ложь - в противном случае
//
Функция ПолучитьФайлОбменаИЗОчереди(ИмяФайла,Узел)
	
	// Флаги
	MQ_DENY_NONE = 0;
	MQ_RECEIVE_ACCESS = 1;
	MQ_NO_TRANSACTION = 0;
	
	qinfo = Новый COMОбъект("MSMQ.MSMQQueueInfo");
	
	// Находим позицую начала имени очереди в АдресОбменаMSMQ
	Индекс = СтрДлина(Узел.ОчередьОбменаMSMQ);
	Пока (Индекс <> 0) Цикл
		
		Если Сред(Узел.ОчередьОбменаMSMQ, Индекс, 1) = "\" Тогда
			Прервать;
		КонецЕсли;
		
		Индекс = Индекс - 1;
		
	КонецЦикла;
	
	// Собираем путь к очереди для чтения данных обмена
	qinfo.PathName = ".\" + Прав(Узел.ОчередьОбменаMSMQ, СтрДлина(Узел.ОчередьОбменаMSMQ) - Индекс) + 
	"_" + СокрП(ПланыОбмена.Основной.ЭтотУзел().Код);
	
	Попытка
		
		qinfo.Create();
		
	Исключение
	КонецПопытки;
	
	// Открываем очередь
	Очередь = qinfo.Open(MQ_RECEIVE_ACCESS, MQ_DENY_NONE);
	
	// Временный объект необходим для поиска последнего сообщения
	СообщениеВрем = Новый COMОбъект("MSMQ.MSMQMessage");
	// Читаем первое сообщение
	СообщениеВрем = Очередь.Receive(MQ_NO_TRANSACTION, , , 0);
	
	Пока (СообщениеВрем <> Неопределено) Цикл
		
		Сообщение = СообщениеВрем;
		// Читаем последующие сообщения, если они присутствуют
		СообщениеВрем = Очередь.Receive(MQ_NO_TRANSACTION, , , 0);
		
	КонецЦикла;
	
	// Закрываем очередь
	Очередь.Close();
	
	// Если получили сообщение, разбираем его и передаем данные обмена 
	// дальше для обработки
	Если Сообщение <> Неопределено Тогда
		
		ИмяФайлаСообщения = Сообщение.Label;
		ФайлОбмена = Новый ЗаписьТекста(ИмяФайла);
		ФайлОбмена.Записать(Сообщение.Body);
		ФайлОбмена.Закрыть();
		
		Сообщить(" - Принят файл обмена данными " + ИмяФайлаСообщения + " из очереди " + Узел.ОчередьОбменаMSMQ);
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

// Функция получения файла с новым сообщением обмена из очереди IBM WebSphere MQ
// Выбирает из очереди сообщение обмена и сохраняет в файле
//
// Параметры:
//  ИмяФайла - файл, в который будет произведено копирование файла с сообщением обмена
//
// Возвращаемое значение:
//  Булево - Истина - если файл с сообщением обмена получен и Ложь - в противном случае
//
Функция ПолучитьФайлОбменаИЗОчередиWSMQ(ИмяФайла,Узел)
	
	// Определяем флаг
	MQOO_INPUT_AS_Q_DEF = 1;
	
	Попытка
		
		// Подключаемся к менеджеру очереди
		Сессия = Новый COMОбъект("MQAX200.MQSession");
		МенеджерОчереди = Сессия.AccessQueueManager("");     
		
	Исключение
		
		Сообщить(" - Ошибка доступа к очереди: " + ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;
	
	// Открываем очередь для чтения из неё данных обмена
	Попытка
		
		Очередь = МенеджерОчереди.AccessQueue(Узел.ЛокальнаяОчередь, MQOO_INPUT_AS_Q_DEF);
		
	Исключение
		
		Сообщить(" - Ошибка открытия очереди: " + ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;
	
	Попытка
		
		// Создаем сообщение
		Сообщение = Сессия.AccessMessage();
		// получаем сообщение
		Очередь.Get(Сообщение);
		
	Исключение
		
		Сообщить(" - Ошибка чтения данных из очереди: " + ОписаниеОшибки());
		Возврат Ложь;
		
	КонецПопытки;
	
	// Читаем из сообщения данные обмена и сохраняем их в файл
	Данные = Сообщение.ReadString(Сообщение.MessageLength);
	
	ФайлОбмена = Новый ЗаписьТекста(ИмяФайла);
	ФайлОбмена.Записать(Данные);
	ФайлОбмена.Закрыть();
	
	Сообщить(" - Принят файл обмена данными из очереди " + Узел.ЛокальнаяОчередь);
	
	Возврат Истина;
	
КонецФункции


Функция ПолучитьЧастьИмениФайла(Имяфайла,ЧастьИмени) Экспорт
	Файл=Новый Файл(Имяфайла);
	
	Если ЧастьИмени="ПолныйПуть" Тогда
		Возврат Файл.Путь;
	ИначеЕсли ЧастьИмени="ПолноеИмяБезРасширения" Тогда
		Возврат Файл.Путь+Файл.ИмяБезРасширения;
	ИначеЕсли ЧастьИмени="Имя" Тогда
		Возврат Файл.Имя;
	ИначеЕсли ЧастьИмени="ИмяБезРасширения" Тогда
		Возврат Файл.ИмяБезРасширения;		
	Иначе
		Возврат Файл.ПолноеИмя;
	КонецЕсли;	
КонецФункции // ПолучитьЧастьИмениФайла()

/////////////////////////////////////////////////////////////////////////////////////////////
/// ОТПРАВКА ФАЙЛОВ ОБМЕНА
// Процедура публикации файла с сообщением обмена
//
// Параметры:
//  ИмяФайла 		- имя файла, содержащего сообщение обмена
//  НомерСообщения  - номер сообщения отправляемых данных

// Сохранение на диск, или сеть
Функция ОпубликоватьФайлОбмена(ИсходноеИмяФайла, НомерСообщения, Узел, Архивировать = Истина) Экспорт
	РезультатОтправки	=Новый Структура("Результат,Описание",Истина,"");
	ЭтотУзел		  = ПланыОбмена[Узел.Метаданные().Имя].ЭтотУзел();
	
	//	Архивировать	  = Истина;
	
	ИмяФайлаСообщения = ПолучитьИмяФайлаОбмена(ЭтотУзел,Узел,Формат(НомерСообщения, "ЧЦ=10; ЧВН=; ЧГ=0"));	
	
	ИмяФайла		  = ИсходноеИмяФайла;
	
	Если Архивировать Тогда
		ПолноеИмяФайлаСообщения	=ПолучитьЧастьИмениФайла(ИсходноеИмяФайла,"ПолныйПуть")+ИмяФайлаСообщения;
		ПереместитьФайл(ИмяФайла,ПолноеИмяФайлаСообщения);
		
		ПолноеИмяфайлаАрхива	=ПолучитьЧастьИмениФайла(ПолноеИмяФайлаСообщения,"ПолноеИмяБезРасширения")+".zip";	
		
		Если НЕ ЗаархивироватьФайл(ПолноеИмяФайлаСообщения,ПолноеИмяфайлаАрхива) Тогда
			ТекстОшибки="Ошибка архивации файла !";
			ЗаписатьВЛог("ОбменДанными",ТекстОшибки,"Ошибка");
			
			РезультатОтправки.Результат	=Ложь;
			РезультатОтправки.Описание  =ТекстОшибки;
			
			Возврат РезультатОтправки;
		Иначе
			ИмяФайла			=ПолноеИмяфайлаАрхива;
			ИмяФайлаСообщения	=ПолучитьЧастьИмениФайла(ПолноеИмяфайлаАрхива,"Имя");			
		КонецЕсли;		
	КонецЕсли; 
	
	Путь = СтрЗаменить(Узел.АдресОбмена, "\", "/");
	// Копируем файл в каталог, определенный для данного узла
	Попытка		
		ИмяФайлаПолучателя=Путь + ?(Прав(Путь, 1) = "/", "", "/") + ИмяФайлаСообщения;		
		КопироватьФайл(ИмяФайла,ИмяФайлаПолучателя);		
	Исключение
		ТекстОшибки="Ошибка копирования файла: """+ИмяФайла+"""-->"""+ИмяФайлаПолучателя+""" ! "+ОписаниеОшибки();
		
		ЗаписатьВЛог("ОбменДанными",ТекстОшибки,"Ошибка",Истина);
		
		РезультатОтправки.Результат	=Ложь;
		РезультатОтправки.Описание  =ТекстОшибки;
		
		Возврат РезультатОтправки;		
	КонецПопытки;
	
	Сообщить(" - Опубликован файл: """ + ИмяФайлаПолучателя+""".");
	
	Попытка	
		УдалитьФайлы(ИмяФайла);	
	Исключение
		ЗаписатьВЛог("ОбменДанными","Ошибка удаления файла: """+ИмяФайла+""" ! "+ОписаниеОшибки(),"Ошибка",Истина);		
	КонецПопытки;
	
	// Удаляем ранее выгруженные файлы
	ФайлСообщения = Новый Файл(ИмяФайлаСообщения);
	МаскаФайлов = ПолучитьИмяФайлаОбмена(ЭтотУзел, Узел, "??????????",?(Архивировать,"zip","xml"));
	Файлы = НайтиФайлы(Узел.АдресОбмена, МаскаФайлов);
	Для Каждого Файл Из Файлы Цикл		
		Если Файл.Имя <> ФайлСообщения.Имя Тогда			
			Попытка				
				// Пытаемся удалить файл со старым сообщением
				УдалитьФайлы(Файл.ПолноеИмя);				
			Исключение
				ЗаписатьВЛог("ОбменДанными","Ошибка удаления файла: """+Файл.ПолноеИмя+""" ! "+ОписаниеОшибки(),"Ошибка",Истина);						
			КонецПопытки;			
		КонецЕсли;		
	КонецЦикла;	
	
	Возврат РезультатОтправки;
КонецФункции// ОпубликоватьФайлОбмена(ИмяФайла, НомерСообщения)

// Отправка по FTP
Функция УстановитьFTPСоединение(Сервер,Пользователь,Пароль,Прокся=Неопределено,Пассивный=Ложь) Экспорт
	Попытка	
		//крохин начало
		//Соединение=Новый FTPСоединение(Сервер,,Пользователь,Пароль,Прокся,Пассивный);
		Соединение=Новый FTPСоединение(Сервер,,Пользователь,Пароль,Прокся,Пассивный,180);
		//крохин конец
		
		Возврат Соединение;		
	Исключение		
		ЗаписатьВЛог("ОбменДаннымиОсновной","Ошибка установки соединения с FTP сервером ! Сервер: " + Сервер,Перечисления.ТипыСообщенийЛога.Ошибка,Истина);		
		Возврат Неопределено;
	КонецПопытки;
КонецФункции // ()

Функция ОтправитьФайлОбменапоFTP(ИсходноеИмяФайла, НомерСообщения,Узел)
	Результат	=Новый Структура("Результат,Описание",Ложь,"Неизвестная ошибка! Смотри лог !");
	
	ЭтотУзел=ПланыОбмена[Узел.Метаданные().Имя].ЭтотУзел();
	
	Архивировать=Истина;
	
	ИмяФайлаСообщения = ПолучитьИмяФайлаОбмена(ЭтотУзел,Узел,Формат(НомерСообщения, "ЧЦ=10; ЧВН=; ЧГ=0"));	
	
	ИмяФайла		  = ИсходноеИмяФайла;
	
	Если Архивировать Тогда
		ПолноеИмяФайлаСообщения	=ПолучитьЧастьИмениФайла(ИсходноеИмяФайла,"ПолныйПуть")+ИмяФайлаСообщения;
		ПереместитьФайл(ИмяФайла,ПолноеИмяФайлаСообщения);
		
		ПолноеИмяфайлаАрхива	=ПолучитьЧастьИмениФайла(ПолноеИмяФайлаСообщения,"ПолноеИмяБезРасширения")+".zip";	
		
		Если НЕ ЗаархивироватьФайл(ПолноеИмяФайлаСообщения,ПолноеИмяфайлаАрхива) Тогда
			Сообщение="Ошибка архивации сообщения ! Сообщение: "+ПолноеИмяФайлаСообщения;
			
			ЗаписатьВЛог("ОбменДаннымиОсновной",Сообщение,Перечисления.ТипыСообщенийЛога.Ошибка,Истина);			
			
			Результат.Вставить("Сообщение",Сообщение);
			Возврат Результат;
		Иначе
			ИмяФайла			=ПолноеИмяфайлаАрхива;
			ИмяФайлаСообщения	=ПолучитьЧастьИмениФайла(ПолноеИмяфайлаАрхива,"Имя");			
		КонецЕсли;		
	КонецЕсли;
	
	Соединение=УстановитьFTPСоединение(Узел.АдресОбмена,Узел.Пользователь,Узел.Пароль,,Узел.ПассивныйРежим);
	Если Соединение=Неопределено Тогда
		Сообщение="Ошибка установки соединения с FTP сервером ! Свервер: "+Узел.АдресОбмена;
		ЗаписатьВЛог("ОбменДаннымиОсновной",Сообщение,Перечисления.ТипыСообщенийЛога.Ошибка,Истина);		
		
		Результат.Вставить("Сообщение",Сообщение);
		Возврат Результат;
	КонецЕсли;
	
	ИмяФайлаСообщения=ПолучитьЧастьИмениФайла(ИмяФайла,"Имя");
	
	Если НЕ ПустаяСтрока(Узел.КаталогFTP) Тогда
		Соединение.УстановитьТекущийКаталог(Узел.КаталогFTP);	
	КонецЕсли;
	
	Попытка
		Соединение.Записать(ИмяФайла,ИмяФайлаСообщения);
	Исключение
		Сообщение="Ошибка передачи файла на FTP сервер ! Сервер: "+Узел.АдресОбмена+" файл: "+ИмяФайлаСообщения;
		ЗаписатьВЛог("ОбменДаннымиОсновной",Сообщение,Перечисления.ТипыСообщенийЛога.Ошибка,Истина);
		
		Результат.Вставить("Сообщение",Сообщение);
		Возврат Результат;
	КонецПопытки;	
	
	КаталогНаСервере="/"+?(ПустаяСтрока(Узел.КаталогFTP),"",Узел.КаталогFTP+"/");
	
	Отправлен=Ложь;	
	Файлы=Соединение.НайтиФайлы(КаталогНаСервере+ИмяФайлаСообщения);
	Для Каждого Файл Из Файлы Цикл
		Отправлен=Истина;
		
		ЗаписатьВЛог("ОбменДаннымиОсновной","Файл отправлен на FTP сервер ! Сервер: "+Узел.АдресОбмена+", файл: "+Файл.Имя,Перечисления.ТипыСообщенийЛога.Информация);
	КонецЦикла;
	
	Если Отправлен Тогда
		// Удаляем ранее выгруженные файлы на FTP сервере
		ФайлСообщения = Новый Файл(ИмяФайлаСообщения);
		МаскаФайлов = ПолучитьИмяФайлаОбмена(ЭтотУзел, Узел, "??????????",?(Архивировать,"zip","xml"));
		Файлы = Соединение.НайтиФайлы(КаталогНаСервере, МаскаФайлов);
		Для Каждого Файл Из Файлы Цикл		
			Если Файл.Имя <> ФайлСообщения.Имя Тогда			
				Попытка				
					// Пытаемся удалить файл со старым сообщением
					Соединение.Удалить(КаталогНаСервере,Файл.Имя);				
				Исключение
					ЗаписатьВЛог("ОбменДаннымиОсновной","Ошибка удаления Файла на FTP сервере ! Сервер: "+Узел.АдресОбмена+", файл: "+Файл.Имя+". "+ОписаниеОшибки(),Перечисления.ТипыСообщенийЛога.Ошибка,Истина);
				КонецПопытки;			
			КонецЕсли;		
		КонецЦикла;		
		
		// Удаляем ранее выгруженные локальные файлы		
		ЛокальныйКаталогВыгрузки    = ПолучитьЧастьИмениФайла(ИсходноеИмяФайла,"ПолныйПуть");
		
		МаскаФайлов = ПолучитьИмяФайлаОбмена(ЭтотУзел, Узел, "??????????",?(Архивировать,"zip","xml"));
		Попытка				
			// Пытаемся удалить файл со старым сообщением
			УдалитьФайлы(ЛокальныйКаталогВыгрузки,МаскаФайлов);				
		Исключение
			ЗаписатьВЛог("ОбменДаннымиОсновной","Ошибка удаления Файлов на FTP сервере ! Сервер: "+Узел.АдресОбмена+", файлы: "+МаскаФайлов+". "+ОписаниеОшибки(),Перечисления.ТипыСообщенийЛога.Ошибка,Истина);
		КонецПопытки;		
		
	Иначе
		ЗаписатьВЛог("ОбменДаннымиОсновной","Отправленный файл не найден на FTP сервере ! Сервер: "+Узел.АдресОбмена+", файл: "+ИмяФайлаСообщения,Перечисления.ТипыСообщенийЛога.Ошибка,Истина);		
	КонецЕсли;
	
	Результат.Результат	=Отправлен;
	Результат.Описание	="Оправлено сообщение: "+НомерСообщения;
	
	Возврат Результат;
КонецФункции

// Процедура публикации файла с сообщением обмена по электронной почте
//
// Параметры:
//  ИмяФайла 		- имя файла, содержащего сообщение обмена
//  НомерСообщения  - номер сообщения отправляемых данных
//
Процедура ОтправитьФайлОбменаМыло(ИмяФайла, НомерСообщения,Узел)
	ЭтотУзел=ПланыОбмена[Узел.Метаданные().Имя].ЭтотУзел();
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.АдресСервераSMTP = Узел.СерверSMTP;
	
	ИмяФайлаСообщения = ПолучитьИмяФайлаОбмена(ЭтотУзел,Узел,Формат(НомерСообщения, "ЧЦ=10; ЧВН=; ЧГ=0"));
	
	// Формируем сообщение обмена
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	Сообщение.Тема = "СООБЩЕНИЕ_ОБМЕНА: " + ИмяФайлаСообщения;
	Сообщение.Получатели.Добавить(Узел.ПочтовыйАдресОбмена);
	
	ФайлСообщения = Новый Файл(ИмяФайлаСообщения);
	// Создаем вложение с файлом обмена
	Сообщение.Вложения.Добавить(ИмяФайла, ФайлСообщения.Имя);
	
	Почта = Новый ИнтернетПочта;
	
	Попытка
		
		Почта.Подключиться(Профиль);
		// Отправляем сообщение с файлом обмена
		Почта.Послать(Сообщение);
		
	Исключение
		
		Сообщить(" - Ошибка при отправки файла: " + ИмяФайлаСообщения);
		Сообщить(ОписаниеОшибки());
		Возврат;
		
	КонецПопытки;
	
	Сообщить(" - Отправлен файл " + ИмяФайлаСообщения + " на адрес " + Узел.ПочтовыйАдресОбмена);
	
	Почта.Отключиться();
	
КонецПроцедуры // ОтправитьФайлОбмена(ИмяФайла, НомерСообщения)

// Процедура размещения сообщения обмена в очереди
//
// Параметры:
//  ИмяФайла 		- имя файла, содержащего сообщение обмена
//  НомерСообщения  - номер сообщения отправляемых данных
//
Процедура ПоместитьДанныеОбменаВОчередь(ИмяФайла, НомерСообщения,Узел)
	ЭтотУзел=ПланыОбмена[Узел.Метаданные().Имя].ЭтотУзел();
	// Флаги
	MQ_SEND_ACCESS = 2;
	MQ_DENY_NONE = 0;
	
	// Получаем имя файла с номером сообщения
	ИмяФайлаСообщения = ПолучитьИмяФайлаОбмена(ЭтотУзел,Узел, Формат(НомерСообщения, "ЧЦ=10; ЧВН=; ЧГ=0"));
	
	qinfo = Новый COMОбъект("MSMQ.MSMQQueueInfo");
	// Формируем путь к очереди на удаленном компьютере
	qinfo.PathName = Узел.ОчередьОбменаMSMQ + "_" + СокрП(Узел.Код);
	
	// Если очередь не создана, создаем
	Попытка
		
		qinfo.Create();
		
	Исключение
	КонецПопытки;
	
	// Открываем очередь на запись
	Очередь = qinfo.Open(MQ_SEND_ACCESS, MQ_DENY_NONE);
	
	ДанныеОбмена = Новый ЧтениеТекста;
	ДанныеОбмена.Открыть(ИмяФайла);
	
	// Создаем сообщение, содержащее данные обмена
	Сообщение = Новый COMОбъект("MSMQ.MSMQMessage");
	Сообщение.Label = ИмяФайлаСообщения;
	Сообщение.Body = ДанныеОбмена.Прочитать();
	Сообщение.ResponseQueueInfo = qinfo;
	
	// Помещаем сообщение в очередь
	Сообщение.Send(Очередь);
	
	Сообщить(" - Помещен файл " + ИмяФайлаСообщения + " в очередь " + Узел.ОчередьОбменаMSMQ);
	
	Очередь.Close();
	ДанныеОбмена.Закрыть();
	
КонецПроцедуры

// Процедура размещения сообщения обмена в очереди IBM WebSphere MQ
//
// Параметры:
//  ИмяФайла 		- имя файла, содержащего сообщение обмена
//  НомерСообщения  - номер сообщения отправляемых данных
//
Процедура ПоместитьДанныеОбменаВОчередьWSMQ(ИмяФайла, НомерСообщения,Узел)
	
	// Определяем флаг
	MQOO_OUTPUT = 16;
	
	Попытка
		
		// Подключаемся к менеджеру очереди
		Сессия = Новый COMОбъект("MQAX200.MQSession");
		МенеджерОчереди = Сессия.AccessQueueManager("");     
		
	Исключение
		
		Сообщить(" - Ошибка доступа к очереди: " + ОписаниеОшибки());
		Возврат;
		
	КонецПопытки;
	
	Попытка
		
		// Открываем очередь на запись
		Очередь = МенеджерОчереди.AccessQueue(Узел.УдаленнаяОчередь, MQOO_OUTPUT);
		
	Исключение
		
		Сообщить(" - Ошибка открытия очереди: " + ОписаниеОшибки());
		Возврат;
		
	КонецПопытки;
	
	Попытка
		
		// Создаем новое сообщение
		Сообщение = Сессия.AccessMessage();
		
		// Открываем файл с данными обмена
		ДанныеОбмена = Новый ЧтениеТекста;
		ДанныеОбмена.Открыть(ИмяФайла);
		
		// Считываем данные из файла в сообщение, которое затем помещается в очередь
		Сообщение.writeString(ДанныеОбмена.Прочитать());
		// Помещаем сообщение в очередь
		Очередь.Put(Сообщение);
		
	Исключение
		
		Сообщить(" - Ошибка размещения сообщения в очереди: " + ОписаниеОшибки());
		Возврат;
		
	КонецПопытки;
	
	Сообщить(" - Помещен файл в очередь " + Узел.УдаленнаяОчередь);
	
	ДанныеОбмена.Закрыть();
	
КонецПроцедуры



// Процедура удаления файлов со старыми сообщениями обмена
// Удаляет файлы с именами равными или меньшими переданному номеру сообщения
// 
// Параметры:
//  НомерСообщения - номер сообщения
//
Процедура УдалитьФайлыОбмена(НомерСообщения,Узел) Экспорт
	ЭтотУзел=ПланыОбмена[Узел.Метаданные().Имя].ЭтотУзел();
	
	// Получаем имя файла с номером сообщения
	МаксИмяФайла = ПолучитьИмяФайлаОбмена(Узел,ЭтотУзел,Формат(НомерСообщения, "ЧЦ=10; ЧВН=; ЧГ=0"),"zip"); 		
	// Получаем маску для поиска файлов с сообщениями обмена
	МаскаФайлов = ПолучитьИмяФайлаОбмена(Узел,ЭтотУзел, "??????????","zip");
	
	Если Узел.Переключатель=4 Тогда //FTP		
		Соединение=УстановитьFTPСоединение(Узел.АдресОбмена,Узел.Пользователь,Узел.Пароль,,Узел.ПассивныйРежим);
		
		Если Соединение=Неопределено Тогда 
			ЗаписатьВЛог("ОбменДаннымиОсновной","Ошибка установки FTP соединения ! Сервер: "+Узел.АдресОбмена,Перечисления.ТипыСообщенийЛога.Ошибка,Истина);			
			Возврат;  
		КонецЕсли;
		
		КаталогНаСервере="/"+?(ПустаяСтрока(Узел.КаталогFTP),"",Узел.КаталогFTP+"/");		
		// Ищем файлы по маске в каталоге загрузки
		Файлы = Соединение.НайтиФайлы(КаталогНаСервере, МаскаФайлов);
		// Удаление файлов со старыми сообщениями обмена
		Для Каждого Файл Из Файлы Цикл			
			// Удаляем только файлы, имена которых меньше или равны имени файла с указанным номером сообщения
			Если Файл.Имя <= МаксИмяФайла Тогда				
				Попытка					
					// Пытаемся удалить файл
					Соединение.Удалить(КаталогНаСервере,Файл.Имя);					
				Исключение
					ЗаписатьВЛог("ОбменДаннымиОсновной","Ошибка удаления файла на FTP сервере ! Сервер: "+Узел.АдресОбмена+", файл: "+Файл.Имя,Перечисления.ТипыСообщенийЛога.Ошибка,Истина);
					//крохин начало 20.02.2013
					//тут тоже может быть ошибка
					//Сообщить("Ошибка: "+ОписаниеОшибки(),СтатусСообщения.Важное);
					#Если Клиент Тогда
						Сообщить("Ошибка: "+ОписаниеОшибки(),СтатусСообщения.Важное);
					#КонецЕсли
					//крохин конец
				КонецПопытки;				
			КонецЕсли;			
		КонецЦикла;
	Иначе		
		// Ищем файлы по маске в каталоге загрузки
		Файлы = НайтиФайлы(СокрЛП(Узел.АдресОбмена), МаскаФайлов);		
		// Удаление файлов со старыми сообщениями обмена
		Для Каждого Файл Из Файлы Цикл			
			// Удаляем только файлы, имена которых меньше или равны имени файла с указанным номером сообщения
			Если Файл.Имя <= МаксИмяФайла Тогда				
				Попытка					
					// Пытаемся удалить файл
					УдалитьФайлы(Файл.ПолноеИмя);					
				Исключение
					ЗаписатьВЛог("ОбменДанными","Ошибка удаления файла: """+Файл.ПолноеИмя+"""."+ОписаниеОшибки(),"Ошибка");
				КонецПопытки;				
			КонецЕсли;			
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры // УдалитьФайлыОбмена(НомерСообщения)

Функция НужноВыгружатьДокумент(Модифицированность,Ссылка,РежимЗаписи,ПометкаУдаления) Экспорт
	РеквизитыШапки=ПолучитьРеквизитыШапки(Ссылка,Новый Структура("ПометкаУдаления,Проведен"),"Документ");
	
	Если 
		Модифицированность
		ИЛИ (НЕ РеквизитыШапки.Проведен И РежимЗаписи=РежимЗаписиДокумента.Проведение) 
		ИЛИ (РеквизитыШапки.Проведен И РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения) 
		ИЛИ РеквизитыШапки.ПометкаУдаления<>ПометкаУдаления Тогда
		Возврат Истина;				
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

//функция НужноЗаписатьИзмененияНоменклатурыДляУзла(Узел,Номенклатура) Экспорт


//СписНом=Узел.Ссылка.НоменклатураДляВключения.выгрузитьколонку("Номенклатура");
//Если Списном.количество()=0 тогда
//	Возврат ИСТИНА;
//Конецесли;   

//Если ПараметрыСеанса.ЭтотУзел.код=Узел.код тогда
//	Возврат ЛОЖЬ;
//Конецесли;   

//СписНом2=новый списокзначений;
//для ном=0 по списном.Количество()-1 цикл
//	Списном2.Добавить(Списном[ном].родитель);
//Конеццикла;

//Запрос=новый Запрос;
//Запрос.Текст="ВЫБРАТЬ
//|	1 КАК Поле1
//|ГДЕ
//|	(&Ссылка В ИЕРАРХИИ (&СписокРазрешеннойНоменклатуры)
//|			ИЛИ &Ссылка В (&СписокРодителей))";


//Запрос.УстановитьПараметр("ссылка",Номенклатура.ссылка);
//Запрос.УстановитьПараметр("СписокРазрешеннойНоменклатуры", СписНом);
//Запрос.УстановитьПараметр("СписокРодителей", СписНом2);

//Выб=Запрос.Выполнить().Выбрать();
//Если выб.Количество()=0 тогда 
//	Возврат ЛОЖЬ;
//иначе
//	Возврат ИСТИНА;
//Конецесли;

//Конецфункции

//процедура СнятьРегистрациюНоменклатурыДляВнешнегоСклада(Объект) экспорт	//Мессерле- Рига


//Запрос=новый Запрос;
//Запрос.Текст="ВЫБРАТЬ
//|	ОсновнойНоменклатураДляВключения.Ссылка КАК Ссылка
//|ИЗ
//|	ПланОбмена.Основной.НоменклатураДляВключения КАК ОсновнойНоменклатураДляВключения
//|
//|СГРУППИРОВАТЬ ПО
//|	ОсновнойНоменклатураДляВключения.Ссылка
//|
//|ИМЕЮЩИЕ
//|	КОЛИЧЕСТВО(ОсновнойНоменклатураДляВключения.Ссылка) > 0";
//СписУзловСОграничениями=Запрос.Выполнить().Выбрать();

//Пока СписУзловСОграничениями.Следующий() цикл
//	
//	
//	Запрос=новый Запрос;
//	//Запрос.Текст="ВЫБРАТЬ
//	//			 |	Номенклатура.Ссылка КАК Ссылка
//	//			 |ИЗ
//	//			 |	Справочник.Номенклатура КАК Номенклатура
//	//			 |ГДЕ
//	//			 |	Номенклатура.Ссылка = &Ссылка
//	//			 |	И Номенклатура.Ссылка В ИЕРАРХИИ(&СписокРазрешеннойНоменклатуры)";
//	
//	Запрос.Текст="ВЫБРАТЬ
//	|	1 КАК Поле1
//	|ГДЕ
//	|	&Ссылка В ИЕРАРХИИ (&СписокРазрешеннойНоменклатуры)";
//	
//	
//	Запрос.УстановитьПараметр("ссылка",Объект.ссылка);
//	Запрос.УстановитьПараметр("СписокРазрешеннойНоменклатуры", СписУзловСОграничениями.Ссылка.НоменклатураДляВключения.выгрузитьколонку("Номенклатура"));
//	
//	
//	Выб=Запрос.Выполнить().Выбрать();
//	Если выб.Количество()=0 тогда //Убираем номенклатуру
//		Если ПараметрыСеанса.ЭтотУзел.код<>СписУзловСОграничениями.ссылка.код тогда
//			планыобмена.Удалитьрегистрациюизменений(СписУзловСОграничениями.ссылка,Объект);
//		Конецесли;
//	Конецесли;
//	
//Конеццикла;	


//Конецпроцедуры

//крохин начало 28.03.2013
Процедура СообщитьИзМодуля(ТекстСообщения) Экспорт
	#ЕСЛИ КЛИЕНТ ТОГДА
		Сообщить(ТекстСообщения); 
	#КОНЕЦЕСЛИ
КонецПроцедуры    		 

//крохин конец 28.03.2013

//Катаев+ 08/10/14
Процедура ЗанестиФилиалыВРегистрПолучателей(Объект) Экспорт
	СписокПолучателей=ПолучитьСписокПолучателейИзмененийОбъекта(Объект);
КонецПроцедуры
//Катаев- 08/10/14


// Кухарь А.Ю. 03.05.2022 начало
// Общая функция, надоело смотреть на простыню запросов, в основной процедуре
Функция ПолучитьТаблицуУзловОсновногоОбмена (НужныСклады=ложь,НужныФилиалы=ложь,НужныТЦ=Ложь) экспорт
	
	если не НужныСклады и не НужныФилиалы и не НужныТЦ  тогда
		ТЗ=новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("Узел");
		Возврат ТЗ; //Для совместимости
	КонецЕсли;
	
	Запрос=новый запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	Основной.Ссылка КАК Узел
	             |ИЗ
	             |	ПланОбмена.Основной КАК Основной
	             |ГДЕ
	             |	Основной.Ссылка <> &ЭтотУзел
	             |	И НЕ Основной.ПометкаУдаления
	             |	И Основной.ТипУзла = &Склад
	             |	И &НужныСклады
	             |
	             |ОБЪЕДИНИТЬ ВСЕ
	             |
	             |ВЫБРАТЬ
	             |	Основной.Ссылка
	             |ИЗ
	             |	ПланОбмена.Основной КАК Основной
	             |ГДЕ
	             |	Основной.Ссылка <> &ЭтотУзел
	             |	И НЕ Основной.ПометкаУдаления
	             |	И Основной.ТипУзла = &Магазин
	             |	И Основной.Подразделение.ЕстьВыделенныйСклад
	             |	И &НужныФилиалы
	             |
	             |ОБЪЕДИНИТЬ ВСЕ
	             |
	             |ВЫБРАТЬ
	             |	Основной.Ссылка
	             |ИЗ
	             |	ПланОбмена.Основной КАК Основной
	             |ГДЕ
	             |	Основной.Ссылка <> &ЭтотУзел
	             |	И НЕ Основной.ПометкаУдаления
	             |	И Основной.ТипУзла = &Магазин
	             |	И НЕ Основной.Подразделение.ЕстьВыделенныйСклад
	             |	И &НужныТЦ";	
	
	запрос.УстановитьПараметр("ЭтотУзел",ПланыОбмена.Основной.ЭтотУзел());
	
	запрос.УстановитьПараметр("НужныСклады",НужныСклады);
	запрос.УстановитьПараметр("Склад",Перечисления.ТипУзлаИБ.Склад);
	
	запрос.УстановитьПараметр("НужныФилиалы",НужныФилиалы);
	запрос.УстановитьПараметр("НужныТЦ",НужныТЦ);
	запрос.УстановитьПараметр("Магазин",Перечисления.ТипУзлаИБ.ТорговоеПодразделение);

	возврат запрос.Выполнить().выгрузить();
КонецФункции
// Кухарь А.Ю. 03.05.2022 конец

