Перем глТекущийПользователь Экспорт; //?
Перем глТорговоеОборудование Экспорт;
Перем глСобытиеСканераОтработано Экспорт;
Перем глДоллары Экспорт;

Перем глИсточник Экспорт; //для OLE импорта
Перем НомерЗаписиЛога Экспорт;

Перем КодировкаПрямая;
Перем КодировкаОбратная;
Перем КэшСтруктур;
Перем глНомерПринимаемогоСообщения Экспорт;

перем ЭквайринговыйТерминал экспорт;

//крохин начало 26.09.2013
//мониторинг софтпойнт
Перем ЗапросМониторинг Экспорт;
//крохин конец 26.09.2013

// Адрес сервера, на котором хранятся данные для интернет-поддержки.
Перем АдресРесурсовОбозревателя Экспорт;

Перем ЯваСкрипт;
Перем ПараметрыПриложения Экспорт;

// Кухарь А.Ю. 27.02.2020 начало
 Перем глБуферОбменаТЧ Экспорт;
// Кухарь А.Ю. 27.02.2020 конец

//Чирков 09.07.2024 +++ 
Перем глПодключаемоеОборудование Экспорт;
Перем глОбщиеЗначения Экспорт;
//Чирков 09.07.2024 ---

Функция ВыполнитьУстановкуПериодаИтогов(СписокРегистровКРассчету, ПредпочтительнаяДатаРасчетаИтогов) Экспорт
	
	СписокРассчитанных = Новый Массив;
	Для Каждого РегистрИзСписка Из СписокРегистровКРассчету Цикл
		ПозицияТочки = Найти(РегистрИзСписка, ".");
		ТипРегистра = Лев(РегистрИзСписка, ПозицияТочки - 1);
		ИмяРегистра = Сред(РегистрИзСписка, ПозицияТочки + 1);
		Если ТипРегистра = "РегистрНакопления" Тогда
			РегистрМенеджер = РегистрыНакопления[ИмяРегистра];
			МетаданныеРегистра = Метаданные.РегистрыНакопления[ИмяРегистра];
			ТипРегистраСтрокой = " накопления ";
		ИначеЕсли ТипРегистра = "РегистрБухгалтерии" Тогда
			РегистрМенеджер = РегистрыБухгалтерии[ИмяРегистра];
			МетаданныеРегистра = Метаданные.РегистрыБухгалтерии[ИмяРегистра];
			ТипРегистраСтрокой = " бухгалтерии "
		КонецЕсли;
						
		// повторная проверка прав нужна, так как процедура экспортная
		Если Не ПравоДоступа("УправлениеИтогами", МетаданныеРегистра) Тогда
			Продолжить;
		КонецЕсли;			
		
		РегистрМенеджер.УстановитьПериодРассчитанныхИтогов(ПредпочтительнаяДатаРасчетаИтогов);
		СписокРассчитанных.Добавить(ТипРегистраСтрокой + """" + МетаданныеРегистра.Синоним + """");
		
	КонецЦикла;
	
	Возврат СписокРассчитанных;

	
КонецФункции

Процедура ОпределитьНеобходимостьПерестановкиГраницыИтогов()
	
	ДеньМесяцаНачалаНапоминания		= 5;
	ДеньМесяцаБезусловногоПересчета = 10;
	
	ТекущийДеньМесяца = День(ТекущаяДата());	
	НадоПересчитывать = Истина;
	
	Если ТекущийДеньМесяца<ДеньМесяцаНачалаНапоминания Тогда
		НадоПересчитывать = Ложь;
	Иначе
		Если ТекущийДеньМесяца<ДеньМесяцаБезусловногоПересчета Тогда
			ЕстьПользователиВБазе = Ложь;
			Попытка
				УстановитьМонопольныйРежим(Истина);
			Исключение
				ЕстьПользователиВБазе = Истина;
			КонецПопытки;
			Если Не ЕстьПользователиВБазе Тогда
				УстановитьМонопольныйРежим(Ложь);
			КонецЕсли;
			НадоПересчитывать = Не ЕстьПользователиВБазе;
		Иначе
			НадоПересчитывать = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Не НадоПересчитывать Тогда Возврат КонецЕсли;
	
	ПредпочтительнаяДатаРасчетаИтогов = НачалоМесяца(ТекущаяДата())-1;
	СписокРегистровКРассчету = Новый Массив;
	Для Каждого Регистр ИЗ РегистрыНакопления Цикл                               
		МетаданныеРегистра = Метаданные.НайтиПоТипу(Тип(Регистр));
		Если МетаданныеРегистра.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки Тогда
			Если Регистр.ПолучитьПериодРассчитанныхИтогов()<ПредпочтительнаяДатаРасчетаИтогов  Тогда
				Если ПравоДоступа("УправлениеИтогами", МетаданныеРегистра) Тогда
					СписокРегистровКРассчету.Добавить(МетаданныеРегистра.ПолноеИмя());
				КонецЕсли;
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла;	
	
	Для Каждого Регистр ИЗ РегистрыБухгалтерии Цикл                               
		МетаданныеРегистра = Метаданные.НайтиПоТипу(Тип(Регистр));
		Если Регистр.ПолучитьПериодРассчитанныхИтогов()<ПредпочтительнаяДатаРасчетаИтогов  Тогда
			Если ПравоДоступа("УправлениеИтогами", МетаданныеРегистра) Тогда
				СписокРегистровКРассчету.Добавить(МетаданныеРегистра.ПолноеИмя());
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если СписокРегистровКРассчету.Количество()=0 Тогда Возврат КонецЕсли;	
	
	Если ИмяПользователя()= "Auto" Тогда
		СписокРассчитанных = ВыполнитьУстановкуПериодаИтогов(СписокРегистровКРассчету, ПредпочтительнаяДатаРасчетаИтогов);
	Иначе
		Если Вопрос("Для повышения производительности рекомендуется выполнить"+Символы.ПС+
			"расчет итогов регистров по "+Формат(ПредпочтительнаяДатаРасчетаИтогов, "ДФ=дд.ММ.гггг" )+". Выполнить его сейчас?", 
			РежимДиалогаВопрос.ДаНет,3 , КодВозвратаДиалога.Нет) <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
		СписокРассчитанных = ВыполнитьУстановкуПериодаИтогов(СписокРегистровКРассчету, ПредпочтительнаяДатаРасчетаИтогов);
		Для Каждого РегистрИзСписка ИЗ СписокРассчитанных Цикл
			Сообщить("Итоги регистра" + РегистрИзСписка + " были рассчитаны по: "+Формат(ПредпочтительнаяДатаРасчетаИтогов, "ДФ=дд.ММ.гггг" ));
		КонецЦикла;
	Конецесли;
	
	
КонецПроцедуры

Процедура ВыставитьЗаголовокСистемы() Экспорт
	СтрокаЗаголовка=ПланыОбмена.Основной.ЭтотУзел().Наименование+"/"+СокрЛП(ПараметрыСеанса.Пользователь)+"/"+СтрокаСоединенияИнформационнойБазы();
	Если НЕ ПараметрыСеанса.КассаККМ.Пустая() Тогда
		СтрокаЗаголовка=СтрокаЗаголовка+"Касса: "+ПараметрыСеанса.КассаККМ;	
	КонецЕсли; 
	
	СисИнфо	= Новый СистемнаяИнформация;
	СтрокаЗаголовка=СтрокаЗаголовка+"/"+СисИнфо.ТипПлатформы;	
	
	УстановитьЗаголовокСистемы(СтрокаЗаголовка);
КонецПроцедуры

///СОБЫТИЯ ПРИЛОЖЕНИЯ
Процедура ПриНачалеРаботыСистемы()
	ОценкаПроизводительностиКлиент.ПередНачаломРаботыСистемы(Неопределено);
	
	ПараметрыСеанса.РабочееМестоКлиента	= Справочники.РабочиеМеста.ПолучитьТекущееРабочееМесто(ИмяКомпьютера()); 
	
	ОбновитьТекущуюБригаду(); // Кельманов А.В. - SNL-208 - 2026.04.22
	
	//Кухарь 14.11.17 начало
	ПараметрыСеанса.АктивныеНаборщики="";
	//Кухарь 14.11.17 конец
	


	//крохин начало
	//установим дату запрета видимости
	Если НЕ ПараметрыСеанса.ЭтотУзел.Подразделение.Пустая() Тогда
		Если ПараметрыСеанса.ЭтотУзел.Подразделение.ДатаЗапретаВидимости <> Константы.ДатаЗапретаВидимости.Получить() Тогда
		ПараметрыСеанса.ДатаЗапретаВидимости = ПараметрыСеанса.ЭтотУзел.Подразделение.ДатаЗапретаВидимости;
		Константы.ДатаЗапретаВидимости.Установить(ПараметрыСеанса.ДатаЗапретаВидимости);
		КонецЕсли;
	КонецЕсли;
	//крохин конец
	ПереключитьДату(Истина);
	
	//инициализация переменных
	КэшСтруктур					= Новый Соответствие;
	ЖелтыйЦвет					= Новый Цвет(255,255,180);	
	глСобытиеСканераОтработано  = Ложь;
	глДоллары					= Справочники.Валюты.НайтиПоКоду("840");	
	
	ЗаписатьВЛог("Система","Вход в систему. Пользователь: "+ИмяПользователя()+", компьютер: "+ИмяКомпьютера(),"Информация");
		
	// Завершение обновления конфигурации
	Обработки.ОбновлениеКонфигурации.Создать().ЗавершитьОбновлениеКонфигурации();
	
	ПервыйЗапуск = (Константы.НомерВерсииКонфигурации.Получить()="");															
	ВыполнитьОбновлениеИнформационнойБазы();
	
	// отработка режима завершения работы системы	
	Если ОбработатьПараметрЗапуска() Тогда Возврат КонецЕсли;	
	УправлениеСоединениямиИБ.УстановитьКонтрольРежимаЗавершенияРаботыПользователей();
	
	ПроверитьНаличиеОбновлений();	
	
	Если РольДоступна("Администратор") Тогда
		ОпределитьНеобходимостьПерестановкиГраницыИтогов();
	КонецЕсли;	
	
	Подразделение=ПараметрыСеанса.ЭтотУзел.Подразделение;
	
	Если НЕ Подразделение.Пустая() Тогда
		ТекущаяДатаЗапрета=КонецДня(Константы.ДатаЗапретаРедактирования.Получить());
		Если Подразделение.СдвигатьДатуЗапрета<>0 Тогда
			НоваяДатаЗапрета=КонецДня(НачалоДня(ТекущаяДата()-Подразделение.СдвигатьДатуЗапрета*24*60*60-1));
		Иначе
			НоваяДатаЗапрета=КонецДня(Подразделение.ДатаЗапретаРедактирования);
		КонецЕсли;
		Если НоваяДатаЗапрета<>ТекущаяДатаЗапрета Тогда
			Константы.ДатаЗапретаРедактирования.Установить(НоваяДатаЗапрета);
		КонецЕсли; 
	КонецЕсли;
	
	
	ВыставитьЗаголовокСистемы();
	//крохин начало
	//ПодключитьТорговоеОборудование();	
	//Если глТорговоеОборудование.млФР.Количество()>0 Тогда
	//	Форма=Обработки.ОбслуживаниеФР.ПолучитьФорму();
	//	Форма.Открыть();
	//	
	//	Предупреждение("Необходимо ввести пароль кассира и установить кассу по умолчанию !",5);
	//КонецЕсли;
	Если ИмяПользователя()<> "Auto" Тогда
		ПодключитьТорговоеОборудование();	
		Если глТорговоеОборудование.млФР.Количество()>0 Тогда
			//Форма = Обработки.ОбслуживаниеФР.ПолучитьФорму();
			Форма = Обработки.ОбслуживаниеФР_2024.ПолучитьФорму();
			Форма.Открыть();			
			
			//Предупреждение("Необходимо ввести пароль кассира и установить кассу по умолчанию !",5);
		КонецЕсли;	
	КонецЕсли;	
	//крохин конец
	
	//если лев(параметрысеанса.пользователь.наименование,3)="TSD" тогда 
	если лев(параметрысеанса.пользователь.наименование,3)="TSD" или лев(параметрысеанса.пользователь.наименование,3)="tsd" тогда           
		//Кухарь А.Ю.  30.10.2025 начало
		// HELP-7738
		//если ВРег(лев(параметрысеанса.пользователь.наименование,5))="TSD11" или
		//	ВРег(лев(параметрысеанса.пользователь.наименование,5))="TSD13" или
		//	ВРег(лев(параметрысеанса.пользователь.наименование,5))="TSD14" или
		//	ВРег(лев(параметрысеанса.пользователь.наименование,5))="TSD15" или
		//	ВРег(лев(параметрысеанса.пользователь.наименование,5))="TSD16" или
		//	ВРег(лев(параметрысеанса.пользователь.наименование,5))="TSD17" или
		//	ВРег(лев(параметрысеанса.пользователь.наименование,5))="TSD18" или
		//	ВРег(лев(параметрысеанса.пользователь.наименование,5))="TSD19" или
		//	ВРег(лев(параметрысеанса.пользователь.наименование,5))="TSD20" или			
		//	ВРег(лев(параметрысеанса.пользователь.наименование,5))="TSD21" или	 
		//	ВРег(лев(параметрысеанса.пользователь.наименование,5))="TSD22" или	 
		//	ВРег(лев(параметрысеанса.пользователь.наименование,5))="TSD23" или	 
		//	ВРег(лев(параметрысеанса.пользователь.наименование,5))="TSD24" или	 			 
		//	ВРег(лев(параметрысеанса.пользователь.наименование,5))="TSD25" или	 
		//	ВРег(лев(параметрысеанса.пользователь.наименование,5))="TSD26" или	 
		//	ВРег(лев(параметрысеанса.пользователь.наименование,5))="TSD27" или	
		//	ВРег(лев(параметрысеанса.пользователь.наименование,5))="TSD28" или	 	
		//	ВРег(лев(параметрысеанса.пользователь.наименование,5))="TSD29" или	 
		//	ВРег(лев(параметрысеанса.пользователь.наименование,5))="TSD30" или	
		//	ВРег(лев(параметрысеанса.пользователь.наименование,5))="TSD31" или	 	
		//	ВРег(лев(параметрысеанса.пользователь.наименование,4))="TSD4" или
		//	ВРег(лев(параметрысеанса.пользователь.наименование,4))="TSD7" или
		//	ВРег(лев(параметрысеанса.пользователь.наименование,4))="TSD8" 
		//	тогда

		//	форма=Обработки.РаботаСТСДчерезRDPAndroid.ПолучитьФорму("Основная");
		//Иначе 
		//	форма=Обработки.РаботаСТСДчерезRDP.ПолучитьФорму("Основная");
		//КонецЕсли;
		форма=Обработки.РаботаСТСДчерезRDPAndroid.ПолучитьФорму("Основная"); 
		//Кухарь А.Ю. 30.10.2025 конец
		
		//Кухарь 19.09.2022 конец	
		
		форма.ОткрытьМодально();	
		ЗавершитьРаботуСистемы(ложь);
	КонецЕсли;
	//Кухарь 04.02.16 конец
	
	//кухарь 22.12.14 конец

	
		//Нечаева начало
	//фишка для автообмена в регионах
//	Если ПараметрыСеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
    Если ИмяПользователя()= "Auto" Тогда
	//проверим, что пользователь auto один, иначе закрываем соединение
	 ТекущееСоединение = НомерСоединенияИнформационнойБазы();
   СоединенияИнформационнойБазы = ПолучитьСоединенияИнформационнойБазы();
   //кухарь добавил попытку т.к.переставал идти обмен при условии что кто-то в окошке логина в момент входа пользователя авто 19.08.13  начало
   Попытка
	   Для Каждого Соединение Из СоединенияИнформационнойБазы Цикл
		   Если  Соединение.НомерСоединения <>  ТекущееСоединение И Соединение.Пользователь.Имя = "Auto" И Соединение.ИмяПриложения <> "Designer" Тогда
			   ЗавершитьРаботуСистемы(Истина);	   
		   КонецЕсли;
	   КонецЦикла;
   Исключение
   КонецПопытки;
   //кухарь добавил попытку т.к.переставал идти обмен при условии что кто-то в окошке логина в момент входа пользователя авто 19.08.13 конец

		//Если база такаято-то с таким интервалом ...
		ПодключитьОбработчикОжидания("ОбработкаЗаданий",10);
		ЗаписатьВЛог("Регламент","Подключение обработки ожидания","Информация");
	Иначе
		ЗаписатьВЛог("Регламент","Обработка ожидания не подключена. Пользователь: "+ИмяПользователя(),"Информация");
	КонецЕсли;
//	КонецЕсли;
	//Нечаева конец

	 РазницаВоВремени = ПараметрыСеанса.ЭтотУзел.Подразделение.РазницаВоВремени;
//     сообщить(строка((РазницаВоВремени+15))+":15");

	// Ихсанов Д. А. Начало 20.05.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2253
	// Механизм требуется запускать только на рабочем контуре, поэтому необходимо убедиться, что проверка выполняется
	// не на тестовой базе, что бы на сайт не ушли неверные данные
	Если РольДоступна("ПроверкаРаботоспособностиСистемыОнлайнПродаж") Тогда
           
		//Кухарь А.Ю.  31.03.2026 начало
		//Рефакторинг. Приведение к 1й функции 
		//СтрокаСоединенияСразрешеннымОбменом = ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
		//ТекущаяСтрокаСоединения				= ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
		//Если СтрокаСоединенияСразрешеннымОбменом = ТекущаяСтрокаСоединения      
		если ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза()
			//Кухарь А.Ю.  31.03.2026 конец		
			И ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			// Проверяем установку блокировки регламентных заданий
			Если БлокировкаРегламентныхЗаданийУстановлена() Тогда
				Попытка
					// Если блокировка установлена, то исполняем обнуление остатков по всем актуальным маркетплейсам
					// РЕФАКТОРИНГ - Внутри хардкод на ссылки по маркетплейсам!!!
					ОбменМаркетПлейс.ВнештатноеОбнулениеОстатковПоМаркетплейсам();
				Исключение
					Сообщить("Активна блокировка регламентных заданий! Не удалось выполнить обнуление остатков по маркетплейсам!
						|Пожалуйста, сообщите о проблеме Администратору системы.");
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
		ЗавершитьРаботуСистемы(Ложь);
	КонецЕсли;
	// Ихсанов Д. А. Конец 20.05.2025

КонецПроцедуры // ПриНачалеРаботыСистемы()

// Ихсанов Д. А. Начало 20.05.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2253
// Функция - Блокировка регламентных заданий установлена
// 
// Возвращаемое значение:
//  Булево - Если регламентные задания заблокированы то Истина, иначе Ложь
//
Функция БлокировкаРегламентныхЗаданийУстановлена()
	
	ТекущаяДата		 = ТекущаяДатаСеанса();
	СекундВОдномЧасе = 3600;
	
	ДатаПоследнегоЗапускаФоновогоЗадания = КонецНедели(ТекущаяДата);
	
	СписокФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания();
	Для каждого ФоновоеЗадание из СписокФоновыхЗаданий Цикл
		ДатаПоследнегоЗапускаФоновогоЗадания = ФоновоеЗадание.Конец;
		
		Прервать
	КонецЦикла;
	
	Если (ТекущаяДата - СекундВОдномЧасе) > ДатаПоследнегоЗапускаФоновогоЗадания Тогда
		Возврат Истина
	КонецЕсли;
	
	Возврат Ложь
	
КонецФункции // БлокировкаРегламентныхЗаданийУстановлена()
// Ихсанов Д. А. Конец 20.05.2025

  //Нечаева начало
  //фишка для автообмена в регионах
Процедура ОбработкаЗаданий() Экспорт
	
	Если ПараметрыСеанса.ЭтотУзел.Подразделение.ВремяОбмена.Количество() > 0 Тогда
    Подразделение = ПараметрыСеанса.ЭтотУзел.Подразделение;
		
	ТекущееВремя = Формат(ТекущаяДата(), "ДЛФ=В"); 
	ТекущееВремя=Лев(ТекущееВремя,СтрДлина(ТекущееВремя)-3);
	
	//делаем проверку на время.
	
	//ЭтотУзел		= ПланыОбмена.Основной.ЭтотУзел().Код;
	
	Если ПараметрыСеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
		ЗаписатьВЛог("Регламент",ПараметрыСеанса.ЭтотУзел.ТипУзла,"Информация");
		возврат;
	КонецЕсли;	
 	//    ЗаписатьВЛог("Начало работы",ТекущееВремя,"Информация");
    РазницаВоВремени = ПараметрыСеанса.ЭтотУзел.Подразделение.РазницаВоВремени;
	//Если ПараметрыСеанса.ЭтотУзел.Подразделение = Справочники.Подразделения.НайтиПоКоду("SSP-0072") Тогда //золотой Вавилон
	//Время=Новый Массив(32);
	//	Иначе
	//Время=Новый Массив(26);
	//КонецЕсли;
	//Время[0]=строка((РазницаВоВремени+6))+":25";    //6-35
	//Время[1]=строка((РазницаВоВремени+6))+":45";
	//Время[2]=строка((РазницаВоВремени+9))+":05";    //9-15
	//Время[3]=строка((РазницаВоВремени+9))+":25";
	//Время[4]=строка((РазницаВоВремени+10))+":25";   //10-35
	//Время[5]=строка((РазницаВоВремени+10))+":45";
	//Время[6]=строка((РазницаВоВремени+11))+":45";   //11-55
	//Время[7]=строка((РазницаВоВремени+12))+":05"; 
	//Время[8]=строка((РазницаВоВремени+13))+":05";   //13-15
	//Время[9]=строка((РазницаВоВремени+13))+":25";  
	//Время[10]=строка((РазницаВоВремени+14))+":25";   //14-35
	//Время[11]=строка((РазницаВоВремени+14))+":45";
	//Время[12]=строка((РазницаВоВремени+15))+":45";   //15-55
	//Время[13]=строка((РазницаВоВремени+16))+":05";  
	//Время[14]=строка((РазницаВоВремени+17))+":05";   //17-15
	//Время[15]=строка((РазницаВоВремени+17))+":25";
	//Время[16]=строка((РазницаВоВремени+18))+":25";   //18-35
	//Время[17]=строка((РазницаВоВремени+18))+":45";  
	//Время[18]=строка((РазницаВоВремени+19))+":45";  //19-55
	//Время[19]=строка((РазницаВоВремени+20))+":05";
	//Время[20]=строка((РазницаВоВремени+21))+":05";   //21-15
	//Время[21]=строка((РазницаВоВремени+21))+":25";  
	//Время[22]=строка((РазницаВоВремени+22))+":25";  //22-35
	//Время[23] =строка((РазницаВоВремени+22))+":45";
	//Если РазницаВоВремени <> 0 Тогда
	//Время[24]="22:25";
	//Время[25] ="22:45";
	//КонецЕсли;
	//Если ПараметрыСеанса.ЭтотУзел.Подразделение = Справочники.Подразделения.НайтиПоКоду("SSP-0072") Тогда //золотой Вавилон
	//Время[26] =строка((РазницаВоВремени+7))+":05";
	//Время[27] =строка((РазницаВоВремени+7))+":45";
	//Время[28] =строка((РазницаВоВремени+8))+":25";
	//Время[29] =строка((РазницаВоВремени+9))+":45";
	//Время[30] =строка((РазницаВоВремени+11))+":05";
	//Время[31] =строка((РазницаВоВремени+12))+":25";
	//КонецЕсли;
	Время=Новый Массив(Подразделение.ВремяОбмена.Количество()+2);
	Для Каждого СтрокаВремениОбмена Из Подразделение.ВремяОбмена Цикл
	Время[СтрокаВремениОбмена.НомерСтроки - 1] =строка(формат(СтрокаВремениОбмена.Время+РазницаВоВремени*60*60,"ДЛФ=T"));
    КонецЦикла;
    Время[Подразделение.ВремяОбмена.Количество()] = "22:25";
    Время[Подразделение.ВремяОбмена.Количество()+1] = "22:45";
		
	Для ТекВремя=0 По Время.Количество()-1 Цикл
		Если ТекущееВремя < Время[ТекВремя] И Время[ТекВремя] < ТекущееВремя + 60 Тогда
			ВыполнитьОбработкуЗаданий();	
		КонецЕсли;		
	КонецЦикла;
	//крохин начало 22.09.2011
	//время может быть разное у разных подразделений
	//Если ТекущееВремя = "23:00" Тогда
	Если  ПараметрыСеанса.ЭтотУзел.Подразделение.ВремяОкончанияОбмена <> '00010101000000' Тогда
		ВремяЗавершения = ПараметрыСеанса.ЭтотУзел.Подразделение.ВремяОкончанияОбмена;
		ВремяЗавершения = Формат(ВремяЗавершения, "ДЛФ=В");
		Иначе
		ВремяЗавершения = "23:00";
	КонецЕсли;
	Если (Лев(ТекущееВремя,5) = Лев(ВремяЗавершения,5)) Тогда
	//крохин конец 22.09.2011
	ЗавершитьРаботуСистемы(Истина);	
    КонецЕсли;
    КонецЕсли;

КонецПроцедуры
   	//Нечаева конец



Процедура ПриЗавершенииРаботыСистемы()
	ОценкаПроизводительностиКлиентСервер.ЗаписатьКэшЛогов();		
		
	ЗаписатьВЛог("Система","Выход из системы. Пользователь: "+ИмяПользователя()+", компьютер: "+ИмяКомпьютера(),"Информация");
	глИсточник="";
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ)	
	глИсточник="";
КонецПроцедуры

// Эта процедура отлавливает данные от сканера штрихкода и ККМ,
// когда не открыта ни одна из форм, использующих сканер и ККМ в своей работе.
//
Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)
	//крохин начало 20.02.2013
	//время открытия чека
	НачалоСканирования = ТекущаяДата();
	//крохин конец 20.02.2013
	Если глТорговоеОборудование <> Неопределено Тогда		
		Если ЭтоСобытиеСканера(Событие) Тогда
			глТорговоеОборудование.СканерПосылкаДанных(1);
			
			Если ПараметрыСеанса.КассаККМ.ПодключенФР И НЕ глСобытиеСканераОтработано Тогда
				//крохин начало 03.12.2012
				//отрабатываем сканирование процедурой из чека
				//Номенклатура=НайтиТоварПоШтрихКоду(Данные,Перечисления.ТипыШтрихКодов.Штука);
				//крохин конец 03.12.2012
				
				ЧекОбъект=Документы.Чек.СоздатьДокумент();
				ЧекОбъект.Дата=ТекущаяДата();
				
				Форма=ЧекОбъект.ПолучитьФорму();
				Форма.ЗаполнитьШапкуЧека();
				//крохин начало 03.12.2012
				//отрабатываем сканирование процедурой из чека
				//ДобавитьТоварВДокумент(Номенклатура,ЧекОбъект);
				//Форма.Открыть();
				Форма.Открыть();
				Форма.ВнешнееСобытиеЧек(Источник, Событие, Данные);
				//крохин конец 03.12.2012
				//крохин начало 20.02.2013
				//время открытия чека
				Если ТекущаяДата() - НачалоСканирования > 0 Тогда
					ЗаписатьВЛог("ОткрытиеЧека","Пользователь: "+ИмяПользователя()+", компьютер: "+ИмяКомпьютера()+" Чек: "+ ЧекОбъект.Номер+" Время: "+(ТекущаяДата() - НачалоСканирования)+ " сек.","Информация",,,ТекущаяДата() - НачалоСканирования);
				КонецЕсли;
				//крохин конец 20.02.2013
				
			КонецЕсли;			
			
			глСобытиеСканераОтработано=Ложь;
			
		Иначе
			глТорговоеОборудование.ОбработкаСобытияККМ(Источник, Событие, Данные);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


///ТОРГОВОЕ ОБОРУДОВАНИЕ
// Подключение торгового оборудования, подключенного к данному компьютеру
//
Процедура ПодключитьТорговоеОборудование(Обработка=Неопределено) Экспорт
	Если Обработка<>Неопределено Тогда
		глТорговоеОборудование = Обработка;
	Иначе		
		Если глТорговоеОборудование = Неопределено Тогда	
			глТорговоеОборудование = Обработки.ТорговоеОборудование.Создать();
		КонецЕсли;
	КонецЕсли;
	
	//Чирков 09.07.2024 +++ 
	Если глПодключаемоеОборудование = Неопределено Тогда
		глПодключаемоеОборудование = Новый Структура;
		глПодключаемоеОборудование.Вставить("ЗагруженныеДрайверы", Новый Соответствие);
	КонецЕсли;
	//Чирков 09.07.2024 --- 
	
	глТорговоеОборудование.ПодключитьОборудование();	
КонецПроцедуры

// Отключение торгового оборудования, подключенного к данному компьютеру
//
Процедура ОтключитьТорговоеОборудование() Экспорт
	Если глТорговоеОборудование <> Неопределено Тогда
		глТорговоеОборудование.ОтключитьОборудование();
	КонецЕсли;
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// СЕРВИСНЫЕ ПРОЦЕДУРЫ

// Процедура проверяет, есть ли необходимость выполнять обновление информационной базы.
// Если необходимо - выполняется обновление.
// Если обновление не удалось выполнить - предлагается завершить работу системы.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьОбновлениеИнформационнойБазы() Экспорт

	// Проверка необходимости обновления информационной базы.
	ПервыйЗапуск = (Константы.НомерВерсииКонфигурации.Получить()="");
	
	Если НЕ ПустаяСтрока(Метаданные.Версия) и   Константы.НомерВерсииКонфигурации.Получить() <> Метаданные.Версия Тогда
		Если ПервыйЗапуск тогда
			//Обработка первого запуска
		Иначе
			Предупреждение("Изменился номер версии конфигурации. Будет выполнено обновление информационной базы.");
		КонецЕслИ;
	Иначе
		Возврат;
	КонецЕсли;

	// Проверка наличия прав для обновления информационной базы.
	Если НЕ ПравоДоступа("МонопольныйРежим", Метаданные) 
	 ИЛИ НЕ ПравоДоступа("Использование",    Метаданные.Обработки.ОбновлениеИнформационнойБазы) 
	 ИЛИ НЕ ПравоДоступа("Просмотр",         Метаданные.Обработки.ОбновлениеИнформационнойБазы) Тогда

		Предупреждение("Недостаточно прав для выполнения обновления. Работа системы будет завершена.");
        глЗапрашиватьПодтверждениеПриЗакрытии = Ложь;
		ЗавершитьРаботуСистемы();
		Возврат;

	КонецЕсли;

	Попытка
		УстановитьМонопольныйРежим(Истина);

	Исключение
		Сообщить(ОписаниеОшибки(), СтатусСообщения.ОченьВажное);
		Предупреждение("Не удалось установить монопольный режим. Работа системы будет завершена.");
		глЗапрашиватьПодтверждениеПриЗакрытии = Ложь;
		ЗавершитьРаботуСистемы();
		Возврат;

	КонецПопытки;
	
	// Обновление информационной базы.
	Обработки.ОбновлениеИнформационнойБазы.Создать().ВыполнитьОбновление();

	// Откючение монопольного режима.
	УстановитьМонопольныйРежим(Ложь);

	// Проверка выполнения обновления информационной базы.
	Если Константы.НомерВерсииКонфигурации.Получить() <> Метаданные.Версия Тогда

		Сообщить("Обновление информационной базы не выполнено.", СтатусСообщения.Важное);

		Текст = "Не выполнено обновление информационной базы! Завершить работу системы?";
		Ответ = Вопрос(Текст, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, );

		Если Ответ = КодВозвратаДиалога.Да Тогда
			глЗапрашиватьПодтверждениеПриЗакрытии = Ложь;
			ЗавершитьРаботуСистемы();
		КонецЕсли;

	ИначеЕсли ПервыйЗапуск Тогда
		Сообщить("Начальное заполнение информационной базы выполнено успешно.", СтатусСообщения.Информация);
		
	Иначе
		Сообщить("Обновление информационной базы выполнено успешно.", СтатусСообщения.Информация);

	КонецЕсли;

КонецПроцедуры

// Процедура проверяет необходимость проверки наличия комплекта обновления конфигурации
//
Процедура ПроверитьНаличиеОбновлений()

	ПроверятьПриЗапуске = ВосстановитьЗначение("ПроверкаНаличияОбновленияПроверятьПриЗапуске");
	ПроверятьПриЗапуске = ?(ТипЗнч(ПроверятьПриЗапуске) = Тип("Неопределено"), Ложь, ПроверятьПриЗапуске);

	Если НЕ ПроверятьПриЗапуске Тогда
		Возврат;
	КонецЕсли;

	ОбработкаОбновления = Обработки.ОбновлениеКонфигурации.Создать();
	Форма = ОбработкаОбновления.ПолучитьФорму("ОбновлениеКонфигурации");
	Форма.ПроверкаНаличияОбновленияПриЗапуске = ПроверятьПриЗапуске;
	Форма.Открыть();

КонецПроцедуры //ПроверитьНаличиеОбновлений()


//БЛОК АВТООБМЕНА
Процедура ВыполнитьОбмен() Экспорт
	ЭтотУзел=ПланыОбмена.Основной.ЭтотУзел();
	
	Выборка=ПланыОбмена.Основной.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка=ЭтотУзел Тогда Продолжить КонецЕсли; 	
		Если НЕ Выборка.АвтоматическийОбмен Тогда Продолжить КонецЕсли; 		
		
		Если ТекущаяДата()>Выборка.ДатаСледующегоОбмена Тогда //нужен обмен
			Попытка				
				УзелОбъект=Выборка.ПолучитьОбъект();
				
				УзелОбъект.ПрочитатьСообщениеСИзменениями();
				УзелОбъект.ЗаписатьСообщениеСИзменениями();
				
				УзелОбъект=Неопределено;
				
				
				УзелОбъект=ПланыОбмена.Основной.НайтиПоКоду(Выборка.Код);
				УзелОбъект=УзелОбъект.ПолучитьОбъект();
				
				
				УзелОбъект.Записать();
			Исключение
				Сообщить("Ошибка обмена с узлом : "+УзелОбъект+". Обмен не выполнен ! "+ОписаниеОшибки(),СтатусСообщения.Важное);		
				Продолжить;
			КонецПопытки;		
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
 

//БЛОК ШТРИХ-КОДИРОВАНИЯ ДОКУМЕНТОВ
//ИМБЕЦИЛЫ ИЗ 1С не могли сделать нормальных кодов символов - дебилы
Функция БайтовыйКодСимвола(Символ) Экспорт
	Возврат КодировкаПрямая[Символ];
КонецФункции // КодСимвола()

Функция СимволПоБайтовомуКоду(Код)
	Возврат КодировкаОбратная[Код];
КонецФункции // ()
  
Функция Бинарное(НачЗн)
	Зн=НачЗн;	
	Стр="";	
	Для Сч=1 по 8 Цикл
		Бит=Зн%2;
		
		Стр=""+Бит+Стр;   
		Зн=(Зн-Бит)/2;		
	КонецЦикла;     
	
	Возврат Стр;
КонецФункции //

Функция Десятичное(НачЗн)
	Зн=0;
	База=128;
	
	ТекДлинна=Мин(СтрДлина(НачЗн),8);
	
	Для Сч=1 по ТекДлинна Цикл
		Зн=Зн+База*Число(Сред(НачЗн,Сч,1));					    
		База=База/2;
	КонецЦикла;
	
	Возврат Зн;
КонецФункции //Десятичное

Функция Закодировать64(НачСтр) Экспорт
	База="ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";
	
	Стр=НачСтр;
	
	Остаток=СтрДлина(Стр) % 3;
	НеХватает=?(Остаток=0,0,3-Остаток); 
	
	Для Сч=1 по НеХватает Цикл
		Стр=Стр+" ";	    
	КонецЦикла;	
	    
	СтрокаБит="";
	
	Длина=СтрДлина(Стр);
	
	ПолнаяСтрока="";
	Для Сч=1 По Длина Цикл
		СтрокаБит=СтрокаБит+Бинарное(БайтовыйКодСимвола(Сред(Стр,Сч,1)));		
	КонецЦикла;
	
	СтрокаКода="";
	Пока СтрДлина(СтрокаБит)>0 Цикл		
		БитовоеЗначение="00"+Лев(СтрокаБит,6);
		
		СтрокаКода	=СтрокаКода+Сред(База,Десятичное(БитовоеЗначение)+1,1);			    
		СтрокаБит	=Сред(СтрокаБит,7);
	КонецЦикла;                                                      
	
	Возврат СтрокаКода;	
КонецФункции // 

Функция Раскодировать64(НачСтр) Экспорт 
	База="ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";
	
	Стр=СокрЛП(НачСтр);
	
	СтрокаБит="";
	
	Длина=СтрДлина(Стр);
	
	ПолнаяСтрока="";
	Для Сч=1 По Длина Цикл
		Символ=Сред(Стр,Сч,1);
		Десятичное=Найти(База,Символ)-1;		
		СтрокаБит=СтрокаБит+Сред(Бинарное(Десятичное),3);		
	КонецЦикла;
	              
	СтрокаИсходная="";
	Пока СтрДлина(СтрокаБит)>0 Цикл		
		БитовоеЗначение=Лев(СтрокаБит,8);
		
		СтрокаИсходная	=СтрокаИсходная+СимволпоБайтовомуКоду(Десятичное(БитовоеЗначение));			    
		СтрокаБит		=Сред(СтрокаБит,9);
	КонецЦикла;                      
	
	Возврат СтрокаИсходная;	    
КонецФункции //Раскодировать

Функция ИдПоВидуДокумента(Вид)
	Возврат Метаданные.Документы[Вид].Синоним;	
КонецФункции //ВнутреннийИдВидаДокумента

Функция ВидПоИДДокумента(Ид)  
	Для Каждого МетаДок Из Метаданные.Документы Цикл
		Если МетаДок.Синоним=Ид Тогда
			Возврат МетаДок.Имя;
		КонецЕсли;	    
	КонецЦикла;    
	Возврат "";
КонецФункции //ВидпоИД

Функция глСформироватьШКДока(Док) экспорт
	Если Док.Пустая() Тогда Возврат "" КонецЕсли;
	КодИсх="*"+ИдПоВидуДокумента(Док.Метаданные().Имя)+"*"+Док.Номер+"*"+Прав(""+Год(Док.Дата),2)+"*";		
	Возврат Закодировать64(КодИсх);
КонецФункции //СформироватьШКДока

//крохин начало 15.10.2013
//крохин начало 18.11.2013
//Функция глСформироватьШКДокаСоСтрокой(Док,ИДСтроки) экспорт
//Если Док.Пустая() Тогда Возврат "" КонецЕсли;
//	КодИсх="*"+ИдПоВидуДокумента(Док.Метаданные().Имя)+"*"+Док.Номер+"*"+Прав(""+Год(Док.Дата),2)+"*"+ИДСтроки;		
//	Возврат Закодировать64(КодИсх);
//КонецФункции 

Функция глСформироватьШКДокаСоСтрокой(Док,ИДСтроки,НомерСпецификации) экспорт
	
	Если Док.Пустая() Тогда Возврат "" КонецЕсли;
	КодИсх="*"+ИдПоВидуДокумента(Док.Метаданные().Имя)+"*"+Док.Номер+"*"+Прав(""+Год(Док.Дата),2)+"**"+НомерСпецификации;
	ШК = Закодировать64(КодИсх);
	НаборЗаписей = РегистрыСведений.ИнформацияШКПланаНабора.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ШКНабораСтрокПланаНабора.Использование	=Истина;
	НаборЗаписей.Отбор.ШКНабораСтрокПланаНабора.Значение		=ШК;
	НаборЗаписей.Очистить();
    Запись = НаборЗаписей.Добавить();
	Запись.ШКНабораСтрокПланаНабора = ШК;
	Запись.СписокНомеровСтрок = ИДСтроки;
	НаборЗаписей.Записать();

	Возврат ШК;
КонецФункции 
//крохин конец 18.11.2013
//крохин конец 15.10.2013

 //крохин начало 09.10.2012
Функция глСформироватьШКДокаРазвернуто(Метаданные,Номер,Дата) экспорт
	КодИсх="*"+ИдПоВидуДокумента(Метаданные)+"*"+Номер+"*"+Прав(""+Год(Дата),2)+"*";		
	Возврат Закодировать64(КодИсх);
КонецФункции
//крохин конец 09.10.2012

// Кельманов А.В. - SNL-119 - 2026.03.16 {
//Функция глНайтиДокПоШК(ШК) экспорт
Функция глНайтиДокПоШК(ШК, ТекстОшибки = "") Экспорт
	// Кельманов А.В. - SNL-119 - 2026.03.16 }
	
	ТекСтр=СокрЛП(ШК);
	ТекСтр=Раскодировать64(ТекСтр);
	
	Если Сред(ТекСтр,1,1)<>"*" Тогда
		
		// Кельманов А.В. - SNL-119 - 2026.03.16 {
		//Сообщить("Штрих-код: """+ШК+""" не является штрих-кодом документа !");
		ТекстОшибки = "Штрих-код: """ + ШК + """ не является штрих-кодом документа !";
		Сообщить(ТекстОшибки);
		// Кельманов А.В. - SNL-119 - 2026.03.16 }
		
		Возврат "";
		
	КонецЕсли;	
	
	Если ПустаяСтрока(ТекСтр)=0 Тогда
		ТекСтр=Сред(ТекСтр,2,СтрДлина(ТекСтр)-2);
		ТекСтр=СтрЗаменить(ТекСтр,"*",Символы.ПС);
		
		СЗ=Новый Структура;
		
		Для Сч=1 По СтрЧислоСтрок(ТекСтр) Цикл
			СЗ.Вставить("Пар"+Сч,СтрПолучитьСтроку(ТекСтр,Сч));					
		КонецЦикла; 		
		
		Ид  	=СЗ.Пар1;
		Номер 	=СЗ.Пар2;         
		Дт  	=СЗ.Пар3;
		Дт  	=Дата("20"+Дт,1,1);
		
		Вид=ВидПоИдДокумента(Ид);
		Если ПустаяСтрока(Вид)=1 Тогда
			
			// Кельманов А.В. - SNL-119 - 2026.03.16 {
			//Сообщить("Не обнаружен вид документа соответствующий ИД: """+Ид+""" !","!");     
			ТекстОшибки = "Не обнаружен вид документа соответствующий ИД: """ + Ид + """ !";
			Сообщить(ТекстОшибки, "!");
			// Кельманов А.В. - SNL-119 - 2026.03.16 }
			
			Возврат Неопределено;
			
		КонецЕсли;
		
		Док=Документы[Вид].НайтиПоНомеру(Номер,Дт);
		
		Если Док<>Неопределено И НЕ Док.Пустая() Тогда
			Возврат Док;   
		КонецЕсли;
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции //глНайтиДокПоШК


 //загрузка XMl при измененной структуре метаданных
Функция ПолучитьСтруктуруОбъекта(МетаОбъект)
	СтруктураОбъекта=Новый Соответствие;
	
	Если ТипОбъекта(МетаОбъект)="Документ" Тогда
		
		//<Ref>cb7ebfea-760e-11db-abb3-0016e65e0172</Ref>
		//<DeletionMark>false</DeletionMark>
		//<Date>2006-11-17T10:39:46</Date>
		//<Number>1</Number>
		//<Posted>true</Posted>
		
		СвойстваРеквизита=Новый Структура("Тип",Тип("ДокументСсылка."+МетаОбъект.Имя));
		СтруктураОбъекта.Вставить("Ref",СвойстваРеквизита);
		
		СвойстваРеквизита=Новый Структура("Тип",Тип("Булево"));
		СтруктураОбъекта.Вставить("DeletionMark",СвойстваРеквизита);
		
		СвойстваРеквизита=Новый Структура("Тип",Тип("Дата"));
		СтруктураОбъекта.Вставить("Date",СвойстваРеквизита);
		
		СвойстваРеквизита=Новый Структура("Тип",Тип("Строка"));
		СтруктураОбъекта.Вставить("Number",СвойстваРеквизита);
		
		СвойстваРеквизита=Новый Структура("Тип",Тип("Булево"));
		СтруктураОбъекта.Вставить("Posted",СвойстваРеквизита);
		
		Для Каждого Реквизит Из МетаОбъект.Реквизиты Цикл
			
			СвойстваРеквизита=Новый Структура("Тип",ТипМетаРеквизита(Реквизит));
			СтруктураОбъекта.Вставить(Реквизит.Имя,СвойстваРеквизита);
			
			Для Каждого ТЧ Из МетаОбъект.ТабличныеЧасти Цикл				
				СтруктураТЧ=Новый Соответствие;
				Для Каждого Реквизит Из ТЧ.Реквизиты Цикл
					СвойстваРеквизита=Новый Структура("Тип",ТипМетаРеквизита(Реквизит));
					СтруктураТЧ.Вставить(Реквизит.Имя,СвойстваРеквизита);
				КонецЦикла; 
				
				СвойстваРеквизита=Новый Структура("Тип,Структура","ТабличнаяЧасть",СтруктураТЧ);
				СтруктураОбъекта.Вставить(ТЧ.Имя,СвойстваРеквизита);			
			КонецЦикла; 
		КонецЦикла;	
	КонецЕсли;
	
	Возврат СтруктураОбъекта;
КонецФункции // ПолучитьСтруктуруОбъекта()

Функция ТипРеквизита(Чтение,МетаТипРеквизита)
	ТипXML=ПолучитьXMLТип(Чтение);
	
	Если ТипXML<>Неопределено Тогда
		ТипРеквизита=ИзXMLТипа(ТипXML);	
	КонецЕсли;	
	Если ТипРеквизита=Неопределено Тогда
		ТипРеквизита=МетаТипРеквизита;		
	КонецЕсли;
	
	Возврат ТипРеквизита;
КонецФункции // ТипРеквизита() 

Функция ТипМетаРеквизита(МетаРеквизит)
	Если МетаРеквизит.Тип.Типы().ВГраница()>0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат МетаРеквизит.Тип.Типы()[0];			
	КонецЕсли;
КонецФункции // ТипМетаРеквизита()

Функция ЗагрузитьРеквизит(Чтение,МетаТипРеквизита)
	ТипРеквизита=ТипРеквизита(Чтение,МетаТипРеквизита);
	
	Значение=Неопределено;
	
	Если Чтение.ТипУзла=ТипУзлаXML.НачалоЭлемента Тогда		
		Чтение.Прочитать();	
		Если Чтение.ТипУзла=ТипУзлаXML.Текст Тогда			
			Значение=XMLЗначение(ТипРеквизита,Чтение.Значение);
		КонецЕсли; 
	КонецЕсли; 
	
	Если Чтение.ТипУзла<>ТипУзлаXML.КонецЭлемента Тогда	Чтение.Прочитать() КонецЕсли;
	
	Возврат Значение;
КонецФункции // ЗагрузитьРеквизит()

Функция ЗагрузитьСтрокуТЧ(Чтение,Структура,СтрокаТЧ)	
	Уровень=1;
	Пока Чтение.Прочитать() Цикл
		ТипУзла=Чтение.ТипУзла;
		ИмяУзла=Чтение.Имя;

		Если ТипУзла=ТипУзлаXML.НачалоЭлемента Тогда
			Уровень=Уровень+1;
			
			ОписаниеРеквизита=Структура[ИмяУзла];
			Если ОписаниеРеквизита<>Неопределено Тогда
				СтрокаТЧ[ИмяУзла]=ЗагрузитьРеквизит(Чтение,ОписаниеРеквизита.Тип);			
			КонецЕсли;
		КонецЕсли;
		
		Если Чтение.ТипУзла=ТипУзлаXML.КонецЭлемента Тогда
			Уровень=Уровень-1;
			
			Если ИмяУзла="Row" И Уровень=0 Тогда
				Возврат СтрокаТЧ;			
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла; 
	
	Сообщить("Плохой выхлоп !!!",СтатусСообщения.ОченьВажное);
КонецФункции // ЗагрузитьСтрокуТЧ() 

Функция ЗагрузитьТЧ(Чтение,СтруктураТЧ)
	Уровень=0;
	
	ТЧ=Новый ТаблицаЗначений;
	Для Каждого Реквизит Из СтруктураТЧ Цикл		
		МассивТипов=Новый Массив;
		МассивТипов.Добавить(Реквизит.Значение.Тип);
		ТипКолонки=Новый ОписаниеТипов(МассивТипов);
		ТЧ.Колонки.Добавить(Реквизит.Ключ,ТипКолонки);	
	КонецЦикла; 
	
	ИмяТЧ=Чтение.Имя;	
	Пока Чтение.Прочитать() Цикл
		ТипУзла=Чтение.ТипУзла;
		ИмяУзла=Чтение.Имя;
		
		Если ТипУзла=ТипУзлаXML.НачалоЭлемента Тогда			
			Если ИмяУзла="Row" Тогда
				СтрокаТЧ=ТЧ.Добавить();		
				
				ЗагрузитьСтрокуТЧ(Чтение,СтруктураТЧ,СтрокаТЧ);			
			КонецЕсли; 						
		ИначеЕсли ТипУзла=ТипУзлаXML.КонецЭлемента Тогда			
			Если Чтение.Имя=ИмяТЧ Тогда Возврат ТЧ КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТЧ;
КонецФункции // ЗагрузитьТЧ()


Функция ЗагрузитьДокументИз_XML(Чтение,ТипОбъекта) Экспорт
	Структура	=КэшСтруктур[ТипОбъекта];
	МетаОбъект	=Метаданные.НайтиПоТипу(ТипОбъекта);
	Если Структура=Неопределено Тогда		
		Структура	=ПолучитьСтруктуруОбъекта(МетаОбъект);		
		КэшСтруктур.Вставить(ТипОбъекта,Структура);
	КонецЕсли; 
	
	Объект=Неопределено;
	
	ИмяУзлаОбъекта	=Чтение.Имя;
	Пока Чтение.Прочитать() Цикл				
		Если Чтение.ТипУзла=ТипУзлаXML.НачалоЭлемента Тогда
			ИмяРеквизита		=Чтение.Имя;
			РеквизитСтруктуры	=Структура[ИмяРеквизита];
			
			Если РеквизитСтруктуры=Неопределено Тогда Продолжить КонецЕсли; //нет реквизита в объекте
			
			МетаТипРеквизита=РеквизитСтруктуры.Тип;
			
			ЗначениеРеквизита=Неопределено;
			
			ТипРеквизита=ТипРеквизита(Чтение,МетаТипРеквизита);					
			
			Если ТипРеквизита="ТабличнаяЧасть" Тогда						
				ТЧ=ЗагрузитьТЧ(Чтение,Структура[ИмяРеквизита].Структура);
				
				Объект[ИмяРеквизита].Очистить();
				Объект[ИмяРеквизита].Загрузить(ТЧ);				
			Иначе
				ЗначениеРеквизита	=ЗагрузитьРеквизит(Чтение,МетаТипРеквизита);							
				
				Если ИмяРеквизита="Ref" Тогда
					Объект=ЗначениеРеквизита.ПолучитьОбъект();
					
					Если Объект=Неопределено Тогда
						Объект=Документы[МетаОбъект.Имя].СоздатьДокумент();				
						Объект.УстановитьСсылкуНового(ЗначениеРеквизита);						
					КонецЕсли;			
				Иначе
					Объект[ИмяРеквизита]=ЗначениеРеквизита;
				КонецЕсли; 				
			КонецЕсли;
		КонецЕсли;
		
		Если Чтение.ТипУзла=ТипУзлаXML.КонецЭлемента И Чтение.Имя=ИмяУзлаОбъекта Тогда Прервать КонецЕсли;			
	КонецЦикла; 
	
	Возврат Объект;
КонецФункции

Процедура ПередНачаломРаботыСистемы(Отказ)
	Если РольДоступна("Automat") Тогда
		Отказ=Истина;
	КонецЕсли;					
	Если ПараметрыПриложения = Неопределено Тогда
		ПараметрыПриложения = Новый Соответствие;
	КонецЕсли;
КонецПроцедуры

//крохин начало 26.09.2013
//мониторинг софтпойнт
Процедура СообщениеМониторинга(сообщение)
    ЗаписатьВЛог("СофтПойнт","Сообщение мониторинга. Пользователь: "+ИмяПользователя()+", компьютер: "+ИмяКомпьютера()+". Сообщение: "+сообщение,"Информация");
КонецПроцедуры

Процедура ЗагрузкаМониторинга()
	Перем Запр;
	Перем Spid;
	Перем mon;
	
	try
		ЗапросМониторинг=Новый Запрос("Выбрать ""softpoint auth""");
		ЗапросМониторинг.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		ЗапросМониторинг.Выполнить();
		
		ЗагрузитьВнешнююКомпоненту(Константы.КаталогВнешнихОтчетов.Получить()+ "SoftpointPerfExpert\sp_mon8.dll");
		mon = Новый("AddIn.SPMon8");
		Если mon.InitMonitor() = 0 Тогда
			СообщениеМониторинга("Ошибка инициализации мониторинга: " + mon.GetLastError());
			ЗапросМониторинг.МенеджерВременныхТаблиц.Закрыть();
			Возврат;
		КонецЕсли
	except
		СообщениеМониторинга("Ошибка 1С при загрузке внешней компоненты мониторинга: " + ОписаниеОшибки());
		ЗапросМониторинг.МенеджерВременныхТаблиц.Закрыть();
		Возврат;
	endtry;
	
  	mon.SetParam("db", СтрокаСоединенияИнформационнойБазы());
	Spid = НомерСоединенияИнформационнойБазы();
	
	try
		Если mon.SetupMonitor(ИмяПользователя(), СтрЗаменить(Строка(Spid), Символы.НПП, "")) = 0 Тогда
			СообщениеМониторинга("Ошибка запуска мониторинга: " + mon.GetLastError());
			ЗапросМониторинг.МенеджерВременныхТаблиц.Закрыть();
			Возврат;	
		КонецЕсли
	except
		СообщениеМониторинга("Ошибка 1С при запуске мониторинга: " + ОписаниеОшибки());
		ЗапросМониторинг.МенеджерВременныхТаблиц.Закрыть();
		Возврат;
	endtry;
	
    mon.SetParam("user", ИмяПользователя());
    mon.SetParam("log", "on");
КонецПроцедуры
//крохин конец 26.09.2013

Функция ТекущаяУниверсальнаяДатаВМиллисекундах_81() Экспорт
	Если ЯваСкрипт = Неопределено Тогда
		Попытка
			ЯваСкрипт = Новый COMОбъект("MSScriptControl.ScriptControl");
			ЯваСкрипт.Language = "javascript";
		Исключение
			Сообщить("Невозможно подключить MSScriptControl.ScriptControl");
			Возврат 0;
		КонецПопытки;	
	КонецЕсли;	

	ВремяНачала = ЯваСкрипт.Eval("(new Date()).valueOf()");
	Возврат ВремяНачала;
КонецФункции //ТекущаяУниверсальнаяДатаВМиллисекундах() Экспорт
 
Процедура ЗаполнитьКодировки()
	КодировкаПрямая=Новый Соответствие;
	
	КодировкаПрямая.Вставить(" ",32);
	КодировкаПрямая.Вставить("!",33);
	КодировкаПрямая.Вставить("""",34);
	КодировкаПрямая.Вставить("#",35);
	КодировкаПрямая.Вставить("$",36);
	КодировкаПрямая.Вставить("%",37);
	КодировкаПрямая.Вставить("&",38);
	КодировкаПрямая.Вставить("'",39);
	КодировкаПрямая.Вставить("(",40);
	КодировкаПрямая.Вставить(")",41);
	КодировкаПрямая.Вставить("*",42);
	КодировкаПрямая.Вставить("+",43);
	КодировкаПрямая.Вставить(",",44);
	КодировкаПрямая.Вставить("-",45);
	КодировкаПрямая.Вставить(".",46);
	КодировкаПрямая.Вставить("/",47);
	КодировкаПрямая.Вставить("0",48);
	КодировкаПрямая.Вставить("1",49);
	КодировкаПрямая.Вставить("2",50);
	КодировкаПрямая.Вставить("3",51);
	КодировкаПрямая.Вставить("4",52);
	КодировкаПрямая.Вставить("5",53);
	КодировкаПрямая.Вставить("6",54);
	КодировкаПрямая.Вставить("7",55);
	КодировкаПрямая.Вставить("8",56);
	КодировкаПрямая.Вставить("9",57);
	КодировкаПрямая.Вставить(":",58);
	КодировкаПрямая.Вставить(";",59);
	КодировкаПрямая.Вставить("<",60);
	КодировкаПрямая.Вставить("=",61);
	КодировкаПрямая.Вставить(">",62);
	КодировкаПрямая.Вставить("?",63);
	КодировкаПрямая.Вставить("@",64);
	КодировкаПрямая.Вставить("A",65);
	КодировкаПрямая.Вставить("B",66);
	КодировкаПрямая.Вставить("C",67);
	КодировкаПрямая.Вставить("D",68);
	КодировкаПрямая.Вставить("E",69);
	КодировкаПрямая.Вставить("F",70);
	КодировкаПрямая.Вставить("G",71);
	КодировкаПрямая.Вставить("H",72);
	КодировкаПрямая.Вставить("I",73);
	КодировкаПрямая.Вставить("J",74);
	КодировкаПрямая.Вставить("K",75);
	КодировкаПрямая.Вставить("L",76);
	КодировкаПрямая.Вставить("M",77);
	КодировкаПрямая.Вставить("N",78);
	КодировкаПрямая.Вставить("O",79);
	КодировкаПрямая.Вставить("P",80);
	КодировкаПрямая.Вставить("Q",81);
	КодировкаПрямая.Вставить("R",82);
	КодировкаПрямая.Вставить("S",83);
	КодировкаПрямая.Вставить("T",84);
	КодировкаПрямая.Вставить("U",85);
	КодировкаПрямая.Вставить("V",86);
	КодировкаПрямая.Вставить("W",87);
	КодировкаПрямая.Вставить("X",88);
	КодировкаПрямая.Вставить("Y",89);
	КодировкаПрямая.Вставить("Z",90);
	КодировкаПрямая.Вставить("[",91);
	КодировкаПрямая.Вставить("\",92);
	КодировкаПрямая.Вставить("]",93);
	КодировкаПрямая.Вставить("^",94);
	КодировкаПрямая.Вставить("_",95);
	КодировкаПрямая.Вставить("`",96);
	КодировкаПрямая.Вставить("a",97);
	КодировкаПрямая.Вставить("b",98);
	КодировкаПрямая.Вставить("c",99);
	КодировкаПрямая.Вставить("d",100);
	КодировкаПрямая.Вставить("e",101);
	КодировкаПрямая.Вставить("f",102);
	КодировкаПрямая.Вставить("g",103);
	КодировкаПрямая.Вставить("h",104);
	КодировкаПрямая.Вставить("i",105);
	КодировкаПрямая.Вставить("j",106);
	КодировкаПрямая.Вставить("k",107);
	КодировкаПрямая.Вставить("l",108);
	КодировкаПрямая.Вставить("m",109);
	КодировкаПрямая.Вставить("n",110);
	КодировкаПрямая.Вставить("o",111);
	КодировкаПрямая.Вставить("p",112);
	КодировкаПрямая.Вставить("q",113);
	КодировкаПрямая.Вставить("r",114);
	КодировкаПрямая.Вставить("s",115);
	КодировкаПрямая.Вставить("t",116);
	КодировкаПрямая.Вставить("u",117);
	КодировкаПрямая.Вставить("v",118);
	КодировкаПрямая.Вставить("w",119);
	КодировкаПрямая.Вставить("x",120);
	КодировкаПрямая.Вставить("y",121);
	КодировкаПрямая.Вставить("z",122);
	КодировкаПрямая.Вставить("{",123);
	КодировкаПрямая.Вставить("|",124);
	КодировкаПрямая.Вставить("}",125);
	КодировкаПрямая.Вставить("~",126);
	КодировкаПрямая.Вставить("",127);
	КодировкаПрямая.Вставить("Ђ",128);
	КодировкаПрямая.Вставить("Ѓ",129);
	КодировкаПрямая.Вставить("‚",130);
	КодировкаПрямая.Вставить("ѓ",131);
	КодировкаПрямая.Вставить("„",132);
	КодировкаПрямая.Вставить("…",133);
	КодировкаПрямая.Вставить("†",134);
	КодировкаПрямая.Вставить("‡",135);
	КодировкаПрямая.Вставить("€",136);
	КодировкаПрямая.Вставить("‰",137);
	КодировкаПрямая.Вставить("Љ",138);
	КодировкаПрямая.Вставить("‹",139);
	КодировкаПрямая.Вставить("Њ",140);
	КодировкаПрямая.Вставить("Ќ",141);
	КодировкаПрямая.Вставить("Ћ",142);
	КодировкаПрямая.Вставить("Џ",143);
	КодировкаПрямая.Вставить("ђ",144);
	КодировкаПрямая.Вставить("‘",145);
	КодировкаПрямая.Вставить("’",146);
	КодировкаПрямая.Вставить("“",147);
	КодировкаПрямая.Вставить("”",148);
	КодировкаПрямая.Вставить("•",149);
	КодировкаПрямая.Вставить("–",150);
	КодировкаПрямая.Вставить("—",151);
	КодировкаПрямая.Вставить("",152);
	КодировкаПрямая.Вставить("™",153);
	КодировкаПрямая.Вставить("љ",154);
	КодировкаПрямая.Вставить("›",155);
	КодировкаПрямая.Вставить("њ",156);
	КодировкаПрямая.Вставить("ќ",157);
	КодировкаПрямая.Вставить("ћ",158);
	КодировкаПрямая.Вставить("џ",159);
	КодировкаПрямая.Вставить(" ",160);
	КодировкаПрямая.Вставить("Ў",161);
	КодировкаПрямая.Вставить("ў",162);
	КодировкаПрямая.Вставить("Ј",163);
	КодировкаПрямая.Вставить("¤",164);
	КодировкаПрямая.Вставить("Ґ",165);
	КодировкаПрямая.Вставить("¦",166);
	КодировкаПрямая.Вставить("§",167);
	КодировкаПрямая.Вставить("Ё",168);
	КодировкаПрямая.Вставить("©",169);
	КодировкаПрямая.Вставить("Є",170);
	КодировкаПрямая.Вставить("«",171);
	КодировкаПрямая.Вставить("¬",172);
	КодировкаПрямая.Вставить("",173);
	КодировкаПрямая.Вставить("®",174);
	КодировкаПрямая.Вставить("Ї",175);
	КодировкаПрямая.Вставить("°",176);
	КодировкаПрямая.Вставить("±",177);
	КодировкаПрямая.Вставить("І",178);
	КодировкаПрямая.Вставить("і",179);
	КодировкаПрямая.Вставить("ґ",180);
	КодировкаПрямая.Вставить("µ",181);
	КодировкаПрямая.Вставить("¶",182);
	КодировкаПрямая.Вставить("·",183);
	КодировкаПрямая.Вставить("ё",184);
	КодировкаПрямая.Вставить("№",185);
	КодировкаПрямая.Вставить("є",186);
	КодировкаПрямая.Вставить("»",187);
	КодировкаПрямая.Вставить("ј",188);
	КодировкаПрямая.Вставить("Ѕ",189);
	КодировкаПрямая.Вставить("ѕ",190);
	КодировкаПрямая.Вставить("ї",191);
	КодировкаПрямая.Вставить("А",192);
	КодировкаПрямая.Вставить("Б",193);
	КодировкаПрямая.Вставить("В",194);
	КодировкаПрямая.Вставить("Г",195);
	КодировкаПрямая.Вставить("Д",196);
	КодировкаПрямая.Вставить("Е",197);
	КодировкаПрямая.Вставить("Ж",198);
	КодировкаПрямая.Вставить("З",199);
	КодировкаПрямая.Вставить("И",200);
	КодировкаПрямая.Вставить("Й",201);
	КодировкаПрямая.Вставить("К",202);
	КодировкаПрямая.Вставить("Л",203);
	КодировкаПрямая.Вставить("М",204);
	КодировкаПрямая.Вставить("Н",205);
	КодировкаПрямая.Вставить("О",206);
	КодировкаПрямая.Вставить("П",207);
	КодировкаПрямая.Вставить("Р",208);
	КодировкаПрямая.Вставить("С",209);
	КодировкаПрямая.Вставить("Т",210);
	КодировкаПрямая.Вставить("У",211);
	КодировкаПрямая.Вставить("Ф",212);
	КодировкаПрямая.Вставить("Х",213);
	КодировкаПрямая.Вставить("Ц",214);
	КодировкаПрямая.Вставить("Ч",215);
	КодировкаПрямая.Вставить("Ш",216);
	КодировкаПрямая.Вставить("Щ",217);
	КодировкаПрямая.Вставить("Ъ",218);
	КодировкаПрямая.Вставить("Ы",219);
	КодировкаПрямая.Вставить("Ь",220);
	КодировкаПрямая.Вставить("Э",221);
	КодировкаПрямая.Вставить("Ю",222);
	КодировкаПрямая.Вставить("Я",223);
	КодировкаПрямая.Вставить("а",224);
	КодировкаПрямая.Вставить("б",225);
	КодировкаПрямая.Вставить("в",226);
	КодировкаПрямая.Вставить("г",227);
	КодировкаПрямая.Вставить("д",228);
	КодировкаПрямая.Вставить("е",229);
	КодировкаПрямая.Вставить("ж",230);
	КодировкаПрямая.Вставить("з",231);
	КодировкаПрямая.Вставить("и",232);
	КодировкаПрямая.Вставить("й",233);
	КодировкаПрямая.Вставить("к",234);
	КодировкаПрямая.Вставить("л",235);
	КодировкаПрямая.Вставить("м",236);
	КодировкаПрямая.Вставить("н",237);
	КодировкаПрямая.Вставить("о",238);
	КодировкаПрямая.Вставить("п",239);
	КодировкаПрямая.Вставить("р",240);
	КодировкаПрямая.Вставить("с",241);
	КодировкаПрямая.Вставить("т",242);
	КодировкаПрямая.Вставить("у",243);
	КодировкаПрямая.Вставить("ф",244);
	КодировкаПрямая.Вставить("х",245);
	КодировкаПрямая.Вставить("ц",246);
	КодировкаПрямая.Вставить("ч",247);
	КодировкаПрямая.Вставить("ш",248);
	КодировкаПрямая.Вставить("щ",249);
	КодировкаПрямая.Вставить("ъ",250);
	КодировкаПрямая.Вставить("ы",251);
	КодировкаПрямая.Вставить("ь",252);
	КодировкаПрямая.Вставить("э",253);
	КодировкаПрямая.Вставить("ю",254);
	КодировкаПрямая.Вставить("я",255);
	
	КодировкаОбратная=Новый Соответствие;
	
	КодировкаОбратная.Вставить(32," ");
	КодировкаОбратная.Вставить(33,"!");
	КодировкаОбратная.Вставить(34,"""");
	КодировкаОбратная.Вставить(35,"#");
	КодировкаОбратная.Вставить(36,"$");
	КодировкаОбратная.Вставить(37,"%");
	КодировкаОбратная.Вставить(38,"&");
	КодировкаОбратная.Вставить(39,"'");
	КодировкаОбратная.Вставить(40,"(");
	КодировкаОбратная.Вставить(41,")");
	КодировкаОбратная.Вставить(42,"*");
	КодировкаОбратная.Вставить(43,"+");
	КодировкаОбратная.Вставить(44,",");
	КодировкаОбратная.Вставить(45,"-");
	КодировкаОбратная.Вставить(46,".");
	КодировкаОбратная.Вставить(47,"/");
	КодировкаОбратная.Вставить(48,"0");
	КодировкаОбратная.Вставить(49,"1");
	КодировкаОбратная.Вставить(50,"2");
	КодировкаОбратная.Вставить(51,"3");
	КодировкаОбратная.Вставить(52,"4");
	КодировкаОбратная.Вставить(53,"5");
	КодировкаОбратная.Вставить(54,"6");
	КодировкаОбратная.Вставить(55,"7");
	КодировкаОбратная.Вставить(56,"8");
	КодировкаОбратная.Вставить(57,"9");
	КодировкаОбратная.Вставить(58,":");
	КодировкаОбратная.Вставить(59,";");
	КодировкаОбратная.Вставить(60,"<");
	КодировкаОбратная.Вставить(61,"=");
	КодировкаОбратная.Вставить(62,">");
	КодировкаОбратная.Вставить(63,"?");
	КодировкаОбратная.Вставить(64,"@");
	КодировкаОбратная.Вставить(65,"A");
	КодировкаОбратная.Вставить(66,"B");
	КодировкаОбратная.Вставить(67,"C");
	КодировкаОбратная.Вставить(68,"D");
	КодировкаОбратная.Вставить(69,"E");
	КодировкаОбратная.Вставить(70,"F");
	КодировкаОбратная.Вставить(71,"G");
	КодировкаОбратная.Вставить(72,"H");
	КодировкаОбратная.Вставить(73,"I");
	КодировкаОбратная.Вставить(74,"J");
	КодировкаОбратная.Вставить(75,"K");
	КодировкаОбратная.Вставить(76,"L");
	КодировкаОбратная.Вставить(77,"M");
	КодировкаОбратная.Вставить(78,"N");
	КодировкаОбратная.Вставить(79,"O");
	КодировкаОбратная.Вставить(80,"P");
	КодировкаОбратная.Вставить(81,"Q");
	КодировкаОбратная.Вставить(82,"R");
	КодировкаОбратная.Вставить(83,"S");
	КодировкаОбратная.Вставить(84,"T");
	КодировкаОбратная.Вставить(85,"U");
	КодировкаОбратная.Вставить(86,"V");
	КодировкаОбратная.Вставить(87,"W");
	КодировкаОбратная.Вставить(88,"X");
	КодировкаОбратная.Вставить(89,"Y");
	КодировкаОбратная.Вставить(90,"Z");
	КодировкаОбратная.Вставить(91,"[");
	КодировкаОбратная.Вставить(92,"\");
	КодировкаОбратная.Вставить(93,"]");
	КодировкаОбратная.Вставить(94,"^");
	КодировкаОбратная.Вставить(95,"_");
	КодировкаОбратная.Вставить(96,"`");
	КодировкаОбратная.Вставить(97,"a");
	КодировкаОбратная.Вставить(98,"b");
	КодировкаОбратная.Вставить(99,"c");
	КодировкаОбратная.Вставить(100,"d");
	КодировкаОбратная.Вставить(101,"e");
	КодировкаОбратная.Вставить(102,"f");
	КодировкаОбратная.Вставить(103,"g");
	КодировкаОбратная.Вставить(104,"h");
	КодировкаОбратная.Вставить(105,"i");
	КодировкаОбратная.Вставить(106,"j");
	КодировкаОбратная.Вставить(107,"k");
	КодировкаОбратная.Вставить(108,"l");
	КодировкаОбратная.Вставить(109,"m");
	КодировкаОбратная.Вставить(110,"n");
	КодировкаОбратная.Вставить(111,"o");
	КодировкаОбратная.Вставить(112,"p");
	КодировкаОбратная.Вставить(113,"q");
	КодировкаОбратная.Вставить(114,"r");
	КодировкаОбратная.Вставить(115,"s");
	КодировкаОбратная.Вставить(116,"t");
	КодировкаОбратная.Вставить(117,"u");
	КодировкаОбратная.Вставить(118,"v");
	КодировкаОбратная.Вставить(119,"w");
	КодировкаОбратная.Вставить(120,"x");
	КодировкаОбратная.Вставить(121,"y");
	КодировкаОбратная.Вставить(122,"z");
	КодировкаОбратная.Вставить(123,"{");
	КодировкаОбратная.Вставить(124,"|");
	КодировкаОбратная.Вставить(125,"}");
	КодировкаОбратная.Вставить(126,"~");
	КодировкаОбратная.Вставить(127,"");
	КодировкаОбратная.Вставить(128,"Ђ");
	КодировкаОбратная.Вставить(129,"Ѓ");
	КодировкаОбратная.Вставить(130,"‚");
	КодировкаОбратная.Вставить(131,"ѓ");
	КодировкаОбратная.Вставить(132,"„");
	КодировкаОбратная.Вставить(133,"…");
	КодировкаОбратная.Вставить(134,"†");
	КодировкаОбратная.Вставить(135,"‡");
	КодировкаОбратная.Вставить(136,"€");
	КодировкаОбратная.Вставить(137,"‰");
	КодировкаОбратная.Вставить(138,"Љ");
	КодировкаОбратная.Вставить(139,"‹");
	КодировкаОбратная.Вставить(140,"Њ");
	КодировкаОбратная.Вставить(141,"Ќ");
	КодировкаОбратная.Вставить(142,"Ћ");
	КодировкаОбратная.Вставить(143,"Џ");
	КодировкаОбратная.Вставить(144,"ђ");
	КодировкаОбратная.Вставить(145,"‘");
	КодировкаОбратная.Вставить(146,"’");
	КодировкаОбратная.Вставить(147,"“");
	КодировкаОбратная.Вставить(148,"”");
	КодировкаОбратная.Вставить(149,"•");
	КодировкаОбратная.Вставить(150,"–");
	КодировкаОбратная.Вставить(151,"—");
	КодировкаОбратная.Вставить(152,"");
	КодировкаОбратная.Вставить(153,"™");
	КодировкаОбратная.Вставить(154,"љ");
	КодировкаОбратная.Вставить(155,"›");
	КодировкаОбратная.Вставить(156,"њ");
	КодировкаОбратная.Вставить(157,"ќ");
	КодировкаОбратная.Вставить(158,"ћ");
	КодировкаОбратная.Вставить(159,"џ");
	КодировкаОбратная.Вставить(160," ");
	КодировкаОбратная.Вставить(161,"Ў");
	КодировкаОбратная.Вставить(162,"ў");
	КодировкаОбратная.Вставить(163,"Ј");
	КодировкаОбратная.Вставить(164,"¤");
	КодировкаОбратная.Вставить(165,"Ґ");
	КодировкаОбратная.Вставить(166,"¦");
	КодировкаОбратная.Вставить(167,"§");
	КодировкаОбратная.Вставить(168,"Ё");
	КодировкаОбратная.Вставить(169,"©");
	КодировкаОбратная.Вставить(170,"Є");
	КодировкаОбратная.Вставить(171,"«");
	КодировкаОбратная.Вставить(172,"¬");
	КодировкаОбратная.Вставить(173,"");
	КодировкаОбратная.Вставить(174,"®");
	КодировкаОбратная.Вставить(175,"Ї");
	КодировкаОбратная.Вставить(176,"°");
	КодировкаОбратная.Вставить(177,"±");
	КодировкаОбратная.Вставить(178,"І");
	КодировкаОбратная.Вставить(179,"і");
	КодировкаОбратная.Вставить(180,"ґ");
	КодировкаОбратная.Вставить(181,"µ");
	КодировкаОбратная.Вставить(182,"¶");
	КодировкаОбратная.Вставить(183,"·");
	КодировкаОбратная.Вставить(184,"ё");
	КодировкаОбратная.Вставить(185,"№");
	КодировкаОбратная.Вставить(186,"є");
	КодировкаОбратная.Вставить(187,"»");
	КодировкаОбратная.Вставить(188,"ј");
	КодировкаОбратная.Вставить(189,"Ѕ");
	КодировкаОбратная.Вставить(190,"ѕ");
	КодировкаОбратная.Вставить(191,"ї");
	КодировкаОбратная.Вставить(192,"А");
	КодировкаОбратная.Вставить(193,"Б");
	КодировкаОбратная.Вставить(194,"В");
	КодировкаОбратная.Вставить(195,"Г");
	КодировкаОбратная.Вставить(196,"Д");
	КодировкаОбратная.Вставить(197,"Е");
	КодировкаОбратная.Вставить(198,"Ж");
	КодировкаОбратная.Вставить(199,"З");
	КодировкаОбратная.Вставить(200,"И");
	КодировкаОбратная.Вставить(201,"Й");
	КодировкаОбратная.Вставить(202,"К");
	КодировкаОбратная.Вставить(203,"Л");
	КодировкаОбратная.Вставить(204,"М");
	КодировкаОбратная.Вставить(205,"Н");
	КодировкаОбратная.Вставить(206,"О");
	КодировкаОбратная.Вставить(207,"П");
	КодировкаОбратная.Вставить(208,"Р");
	КодировкаОбратная.Вставить(209,"С");
	КодировкаОбратная.Вставить(210,"Т");
	КодировкаОбратная.Вставить(211,"У");
	КодировкаОбратная.Вставить(212,"Ф");
	КодировкаОбратная.Вставить(213,"Х");
	КодировкаОбратная.Вставить(214,"Ц");
	КодировкаОбратная.Вставить(215,"Ч");
	КодировкаОбратная.Вставить(216,"Ш");
	КодировкаОбратная.Вставить(217,"Щ");
	КодировкаОбратная.Вставить(218,"Ъ");
	КодировкаОбратная.Вставить(219,"Ы");
	КодировкаОбратная.Вставить(220,"Ь");
	КодировкаОбратная.Вставить(221,"Э");
	КодировкаОбратная.Вставить(222,"Ю");
	КодировкаОбратная.Вставить(223,"Я");
	КодировкаОбратная.Вставить(224,"а");
	КодировкаОбратная.Вставить(225,"б");
	КодировкаОбратная.Вставить(226,"в");
	КодировкаОбратная.Вставить(227,"г");
	КодировкаОбратная.Вставить(228,"д");
	КодировкаОбратная.Вставить(229,"е");
	КодировкаОбратная.Вставить(230,"ж");
	КодировкаОбратная.Вставить(231,"з");
	КодировкаОбратная.Вставить(232,"и");
	КодировкаОбратная.Вставить(233,"й");
	КодировкаОбратная.Вставить(234,"к");
	КодировкаОбратная.Вставить(235,"л");
	КодировкаОбратная.Вставить(236,"м");
	КодировкаОбратная.Вставить(237,"н");
	КодировкаОбратная.Вставить(238,"о");
	КодировкаОбратная.Вставить(239,"п");
	КодировкаОбратная.Вставить(240,"р");
	КодировкаОбратная.Вставить(241,"с");
	КодировкаОбратная.Вставить(242,"т");
	КодировкаОбратная.Вставить(243,"у");
	КодировкаОбратная.Вставить(244,"ф");
	КодировкаОбратная.Вставить(245,"х");
	КодировкаОбратная.Вставить(246,"ц");
	КодировкаОбратная.Вставить(247,"ч");
	КодировкаОбратная.Вставить(248,"ш");
	КодировкаОбратная.Вставить(249,"щ");
	КодировкаОбратная.Вставить(250,"ъ");
	КодировкаОбратная.Вставить(251,"ы");
	КодировкаОбратная.Вставить(252,"ь");
	КодировкаОбратная.Вставить(253,"э");
	КодировкаОбратная.Вставить(254,"ю");
	КодировкаОбратная.Вставить(255,"я");
	
	
	
КонецПроцедуры

Функция ПолучитьСерверТО() Экспорт
	Возврат глТорговоеОборудование;
КонецФункции //ПолучитьСерверТО() Экспорт
 

ЗаполнитьКодировки();

НомерЗаписиЛога=0;

АдресРесурсовОбозревателя = "EE_UPR";
глОбщиеЗначения	= Новый Соответствие;