// Процедура инициализирует глобальную переменную глТекущийПользователь.
// Переменная содержит ссылку на элемент справочника "Пользователи", 
// соответствующий текущему пользователю информационной базы.
//
// Параметры:
//  Нет.
//
Процедура ОпределитьТекущегоПользователя()
	
	  Если ПустаяСтрока(ИмяПользователя()) Тогда
		ИмяПользователя           = "НеАвторизован";
		ПолноеИмяПользователя     = "Не авторизован";
		
	Иначе
		ИмяПользователя           = ИмяПользователя();
		
		Если ПустаяСтрока(ПолноеИмяПользователя()) Тогда
			ПолноеИмяПользователя = ИмяПользователя;
		Иначе
			ПолноеИмяПользователя = ПолноеИмяПользователя();
		КонецЕсли;
	КонецЕсли;
	
	глТекущийПользователь = Справочники.Пользователи.НайтиПоКоду(ИмяПользователя);
	
	Если глТекущийПользователь = Справочники.Пользователи.ПустаяСсылка() Тогда
		ОбъектПользователь = Справочники.Пользователи.СоздатьЭлемент();
		
		ОбъектПользователь.Код          = ИмяПользователя;
		ОбъектПользователь.Наименование = ПолноеИмяПользователя;
		
		ПараметрыСеанса.ОтключитьЖурнализациюЗаписи=Истина;
		ОбъектПользователь.Записать();
		ПараметрыСеанса.ОтключитьЖурнализациюЗаписи=Ложь;
		
		Сообщить("Пользователь зарегистрирован в справочнике пользователей.");
		глТекущийПользователь = ОбъектПользователь.Ссылка;		
	Иначе
		
	КонецЕсли;
	
	ПараметрыСеанса.Пользователь		=глТекущийПользователь;	
КонецПроцедуры // ОпределитьТекущегоПользователя()

Процедура УстановкаПараметровСеанса()

	ПараметрыСеанса.НомерСообщения				= 0;
	ПараметрыСеанса.Отправитель					= ПланыОбмена.Основной.ПустаяСсылка();
	ПараметрыСеанса.НомерЗаписиЛога 			= 0;
	ПараметрыСеанса.СверткаБазы					= Ложь;
	//+++Чирков 30.03.2025
	ПараметрыСеанса.КэшЛогов 					= "";
	//---Чирков 30.03.2025	
	ПараметрыСеанса.РабочееМестоКлиента			= Справочники.РабочиеМеста.ПустаяСсылка();
	
	ПараметрыСеанса.ЭтотУзел					= ПланыОбмена.Основной.ЭтотУзел();
	ПараметрыСеанса.ТипУзла						= ПланыОбмена.Основной.ЭтотУзел().ТипУзла;
	
	ОпределитьТекущегоПользователя();
	
	ПараметрыСеанса.ОтключитьЖурнализациюЗаписи	= Ложь;
	ПараметрыСеанса.ОтключитьЖурнализациюОбмена = Ложь;
	ПараметрыСеанса.Отладка						= Ложь;
	ПараметрыСеанса.ОтключитьКонтрольДЗР    	= Ложь;
	ПараметрыСеанса.ОтключитьКонтрольРезервов	= Ложь;	
	
	ПараметрыСеанса.ВалютаНац  					= Константы.НациональнаяВалюта.Получить();	
	ПараметрыСеанса.ВалютаУпр					= Константы.ВалютаУпрУчета.Получить();
	ПараметрыСеанса.ВалютаУпр_2009				= Константы.ВалютаУпрУчета_2009.Получить();
	
	ПараметрыСеанса.СверткаБазы					= Ложь;
	ПараметрыСеанса.БазаАрхиваЛогов				= Константы.БазаАрхиваЛогов.Получить();
	
	Если НЕ ЗначениеЗаполнено(ПараметрыСеанса.ВалютаУпр_2009) Тогда
		ПараметрыСеанса.ВалютаУпр_2009			= Константы.ВалютаУпрУчета.Получить();			
	КонецЕсли;
	
	ПараметрыСеанса.КассаККМ									=Справочники.Кассы.ПустаяСсылка();
	ПараметрыСеанса.ПарольКассираФискальногоРегистратора		=ПолучитьЗначениеПоУмолчанию("ПарольКассираФискальногоРегистратора");
	ПараметрыСеанса.ПарольАдминистратораФискальногоРегистратора ="";
	
	УстановленныеПараметры=Новый Массив;
	ПараметрыСеанса.ВыполнятьЗамерыПроизводительности=Константы.ВыполнятьЗамерыПроизводительности.Получить();
	ОценкаПроизводительностиСлужебный.УстановкаПараметровСеанса("КомментарийЗамераВремени",УстановленныеПараметры);
	
	//Нечаева +++ для     11,09,13
	ПараметрыСеанса.СлипБаллов = "";
	//Нечаева --- для     11,09,13
	
	ДП=Новый Массив;
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ Ссылка 
	|ИЗ Справочник.Подразделения 
	|ГДЕ Ссылка В ИЕРАРХИИ 
	|	(ВЫБРАТЬ Подразделение ИЗ Справочник.Пользователи.ДоступныеПодразделения ГДЕ Ссылка=&Пользователь)";
	Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.Пользователь);
	Выборка=Запрос.Выполнить().Выбрать();
	
	ДП=Новый Массив;
	Пока Выборка.Следующий() Цикл
		ДП.Добавить(Выборка.Ссылка);	
	КонецЦикла; 
	
	ПараметрыСеанса.ДоступныеПодразделения=Новый ФиксированныйМассив(ДП);
	
	ПараметрыСеанса.ДатаЗапретаВидимости	='00010101';
	ПараметрыСеанса.КонтрольДатыВидимости	=Ложь;
	
	Если ЗначениеЗаполнено(ПараметрыСеанса.Пользователь) И НЕ ЗначениеЗаполнено(ПараметрыСеанса.Пользователь.Интерфейс) Тогда
		ПользовательИБ=ПользователиИнформационнойБазы.НайтиПоИмени(СокрЛП(ПараметрыСеанса.Пользователь.Код));				
		
		ПользовательОбъект=ПараметрыСеанса.Пользователь.ПолучитьОбъект();
		Если ПользовательИБ<>Неопределено Тогда
			ПользовательОбъект.Интерфейс=ПользовательИБ.ОсновнойИнтерфейс.Имя;		
		КонецЕсли; 
		
		ПользовательОбъект.Записать();			
	КонецЕсли; 
	
	ПереключитьДату();
	
	//Нечаева 27,10,2022 +++
	// разделим обмен по товарам, на 2 сайта.
	// стильпарк
	МассивУзловДляОбменаССайтомТоварами = новый массив;
	МассивУзловДляОбменаССайтомТоварами.Добавить(планыобмена.ОбменССайтомТоварами.НайтиПоКоду("STP"));
	
	ПараметрыСеанса.ВсеУзлыДляОбменаССайтомТоварами = Новый ФиксированныйМассив(МассивУзловДляОбменаССайтомТоварами);
	//************************************************	
	МВсеУзлыДляОбменаССайтомТоварамиb2b = новый массив;
	МВсеУзлыДляОбменаССайтомТоварамиb2b.Добавить(планыобмена.ОбменССайтомТоварами.НайтиПоКоду("B2B"));
	// нечаева 04,09,23++
	//МВсеУзлыДляОбменаССайтомТоварамиb2b.Добавить(планыобмена.ОбменССайтомТоварами.НайтиПоКоду("MNB"));
	// нечаева  04,09,23 ---
	
	ПараметрыСеанса.ВсеУзлыДляОбменаССайтомТоварамиb2b = Новый ФиксированныйМассив(МВсеУзлыДляОбменаССайтомТоварамиb2b);
		
	ПараметрыСеанса.НаличиеОбменаССайтом = (МассивУзловДляОбменаССайтомТоварами.Количество() + МВсеУзлыДляОбменаССайтомТоварамиb2b.Количество())>0;  // 
	//ПараметрыСеанса.НаличиеОбменаССайтом = (МассивУзловДляОбменаССайтомТоварами.Количество() > 0);

	// нечаева 27,10,2022 ---
	
	
	
	////нечаева++
	//// обмен с сайтом
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	ОбменССайтомТоварами.Ссылка КАК Ссылка
	//|ИЗ
	//|	ПланОбмена.ОбменССайтомТоварами КАК ОбменССайтомТоварами
	//|ГДЕ
	//|	(ОбменССайтомТоварами.Ссылка <> &ЭтотУзел)	
	//|";
	//
	//Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ОбменССайтомТоварами.ЭтотУзел());
	//МассивУзловДляОбменаССайтомТоварами = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	//ПараметрыСеанса.ВсеУзлыДляОбменаССайтомТоварами = Новый ФиксированныйМассив(МассивУзловДляОбменаССайтомТоварами);
	//
	////Запрос = Новый Запрос;
	////Запрос.Текст = "ВЫБРАТЬ
	////			   |	ОбменССайтомЗаказами.Ссылка КАК Ссылка
	////			   |ИЗ
	////			   |	ПланОбмена.ОбменССайтомЗаказами КАК ОбменССайтомЗаказами
	////			   |ГДЕ
	////			   |	(ОбменССайтомЗаказами.Ссылка <> &ЭтотУзел)	
	////			   |";
	////			   
	////Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ОбменССайтомЗаказами.ЭтотУзел());
	////МассивУзловДляОбменаССайтомЗаказами = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	////ПараметрыСеанса.ВсеУзлыДляОбменаССайтомЗаказами = Новый ФиксированныйМассив(МассивУзловДляОбменаССайтомЗаказами);	
	//
	////ПараметрыСеанса.НаличиеОбменаССайтом = (МассивУзловДляОбменаССайтомТоварами.Количество() + МассивУзловДляОбменаССайтомЗаказами.Количество() > 0);
	//ПараметрыСеанса.НаличиеОбменаССайтом = (МассивУзловДляОбменаССайтомТоварами.Количество() > 0);
	//
	//
	////нечаева ++ 15042022
	//// обмен с сайтом b2b
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ОбменССайтомТоварами.Ссылка КАК Ссылка
	//               |ИЗ
	//               |	ПланОбмена.ОбменССайтом_b2b КАК ОбменССайтомТоварами
	//               |ГДЕ
	//               |	ОбменССайтомТоварами.Ссылка <> &ЭтотУзел";
	//
	//Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ОбменССайтом_b2b.ЭтотУзел());
	//МассивУзловДляОбменаССайтомТоварамиb2b = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	//ПараметрыСеанса.ВсеУзлыДляОбменаССайтомТоварамиb2b = Новый ФиксированныйМассив(МассивУзловДляОбменаССайтомТоварамиb2b);
	//// нечаева 15042022 ---
	
	
	
	//нечаева---
	//крохин начало 25.04.2013
	ПараметрыСеанса.ОрганизацияПриПечатиДокументов = Справочники.Организации.ПустаяСсылка();
	ПараметрыСеанса.ОтветственноеЛицоПриПечатиДокументов = Справочники.ФизическиеЛица.ПустаяСсылка();
	//крохин конец 25.04.2013
	
	//Чирков+++ 21.05.2013
	ПараметрыСеанса.ЕстьВыделенныйСклад=?(ЗначениеЗаполнено(ПланыОбмена.Основной.ЭтотУзел().Подразделение),ПланыОбмена.Основной.ЭтотУзел().Подразделение.ЕстьВыделенныйСклад,Ложь);	
	//Чирков--- 21.05.2013
	
	//крохин начало 16.10.2013
	ПараметрыСеанса.СостояниеСканераДляПланаНабора = Перечисления.СостоянияСканераДляПланаНабора.НеОпределено;
	//крохин конец 16.10.2013
	//крохин начало 15.09.2014
	ПараметрыСеанса.ЗапущенаОбработка = Ложь;
	//крохин конец 15.09.2014
	
	// Кухарь А.Ю.  25.02.2025 начало
	//ПараметрыСеанса.ВыводитьПечатныеФормыНаПредпросмотр=ложь; 			
	если РольДоступна("Администратор") тогда
		ПараметрыСеанса.ВыводитьПечатныеФормыНаПредпросмотр=Истина; 		
	иначе
		ПараметрыСеанса.ВыводитьПечатныеФормыНаПредпросмотр=ложь; 		
	КонецЕсли;
	// Кухарь А.Ю.  25.02.2025 конец
	
	
	ПараметрыСеанса.УровеньДоступа	= ПараметрыСеанса.Пользователь.УровеньДоступа;
	ПараметрыСеанса.ОбщиеЗначения	= Новый ХранилищеЗначения(Новый Соответствие);
	
КонецПроцедуры
