Процедура ИнициализацияПостроителя(ВидРасчета,Построитель,Настройки=Неопределено,ИмяРегистра) Экспорт;
	Если ПустаяСтрока(ИмяРегистра) Тогда Возврат КонецЕсли; 
	
	ТекПостроитель=Построитель;
	
	МетаРег=Метаданные.РегистрыНакопления[ИмяРегистра];
	
	ОписаниеПолей		="";	
	ОписаниеГруппировок	="";		
	ОписаниеИтогов		="";
		
	Для Каждого Измерение Из МетаРег.Измерения Цикл
		ОписаниеГруппировок=ОписаниеГруппировок+",
		|	"+Измерение.Имя+".*";
	КонецЦикла;
	
	Если ВидРасчета="Обороты" Тогда
		Если МетаРег.Реквизиты.Количество()>0 Тогда
			Для Каждого Реквизит Из МетаРег.Реквизиты Цикл				
				Типы=Реквизит.Тип.Типы();
				Если Типы.Количество()=1 И Типы[0]=Тип("Число") Тогда					
					ОписаниеПолей=ОписаниеПолей+",
					|	СУММА("+Реквизит.Имя+") КАК "+Реквизит.Имя;
					
					ОписаниеИтогов=ОписаниеИтогов+",
					|	СУММА("+Реквизит.Имя+") КАК "+Реквизит.Имя;
				Иначе
					ОписаниеГруппировок=ОписаниеГруппировок+",
					|	"+Реквизит.Имя+".*";
				КонецЕсли; 
			КонецЦикла;		
		КонецЕсли;		
		
		Для Каждого Ресурс Из МетаРег.Ресурсы Цикл
			ОписаниеПолей=ОписаниеПолей+",
			|	СУММА(ВЫБОР КОГДА ВидДвижения=ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА "+Ресурс.Имя+" ИНАЧЕ 0 КОНЕЦ) КАК "+Ресурс.Имя+"_Приход,
			|	СУММА(ВЫБОР КОГДА ВидДвижения=ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА "+Ресурс.Имя+" ИНАЧЕ 0 КОНЕЦ) КАК "+Ресурс.Имя+"_Расход,
			|	СУММА(ВЫБОР КОГДА ВидДвижения=ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА 1 ИНАЧЕ -1 КОНЕЦ*"+Ресурс.Имя+") КАК "+Ресурс.Имя+"_Оборот";
			
			ОписаниеИтогов=ОписаниеИтогов+",
			|	СУММА("+Ресурс.Имя+"_Приход),СУММА("+Ресурс.Имя+"_Расход),СУММА("+Ресурс.Имя+"_Оборот)";			
		КонецЦикла; 
		
		ОписаниеПолей		=Сред(ОписаниеПолей,2);
		ОписаниеГруппировок	=Сред(ОписаниеГруппировок,2);
		ОписаниеИтогов		=Сред(ОписаниеИтогов,2);
		
		Текст="
		|ВЫБРАТЬ
		|"+ОписаниеПолей+"		
		|{
		|ВЫБРАТЬ
		|"+ОписаниеГруппировок+"
		|}
		|ИЗ 
		|	РегистрНакопления."+ИмяРегистра+"
		|ГДЕ
		|	Период Между &Дата1 И &Дата2	
		|{
		|ГДЕ"+ОписаниеГруппировок+"		
		|}
		|ИТОГИ"+ОписаниеИтогов+" ПО ОБЩИЕ
		|{
		|ИТОГИ ПО "+ОписаниеГруппировок+"
		|}";		
		
		ТекстЗапроса=Текст;
		ТекПостроитель.Текст=СокрЛП(Текст);		
		ТекПостроитель.ЗаполнитьНастройки();
		
		Если Настройки<>Неопределено Тогда
			ТекПостроитель.УстановитьНастройки(Настройки);
		КонецЕсли; 
	ИначеЕсли ВидРасчета="ОстаткиИОбороты" Тогда		
		Для Каждого Ресурс Из МетаРег.Ресурсы Цикл
			ОписаниеПолей=ОписаниеПолей+",
			|	"+Ресурс.Имя+"НачальныйОстаток	КАК "+Ресурс.Имя+"_Нач,
			|	"+Ресурс.Имя+"КонечныйОстаток	КАК "+Ресурс.Имя+"_Кон,
			|	"+Ресурс.Имя+"Оборот			КАК "+Ресурс.Имя+"_Об";
			
			ОписаниеИтогов=ОписаниеИтогов+",
			|	СУММА("+Ресурс.Имя+"_Нач),СУММА("+Ресурс.Имя+"_Кон)";			
		КонецЦикла; 
		
		ОписаниеПолей		=Сред(ОписаниеПолей,2);
		ОписаниеГруппировок	=Сред(ОписаниеГруппировок,2);
		ОписаниеИтогов		=Сред(ОписаниеИтогов,2);
		
		Текст="
		|ВЫБРАТЬ
		|"+ОписаниеПолей+"		
		|{
		|ВЫБРАТЬ
		|"+ОписаниеГруппировок+"
		|}
		|ИЗ 
		|	РегистрНакопления."+ИмяРегистра+".ОстаткиИОбороты(&Дата1,&Дата2,Период,,{"+ОписаниеГруппировок+"})
		|ИТОГИ"+ОписаниеИтогов+" ПО ОБЩИЕ
		|{
		|ИТОГИ ПО "+ОписаниеГруппировок+"
		|}";		
		
		ТекстЗапроса			=Текст;
		ТекПостроитель.Текст	=СокрЛП(Текст);		
		ТекПостроитель.ЗаполнитьНастройки();
		
		Если Настройки<>Неопределено Тогда
			ТекПостроитель.УстановитьНастройки(Настройки);
		КонецЕсли;
	Иначе
		ТекПостроитель=Новый ПостроительОтчета;		
	КонецЕсли;	
КонецПроцедуры
