// Вывод результата компоновки в табличный документ
//
Процедура ВывестиРезультатВТабличныйДокумент(ПроцессорКомпоновкиДанных, ТабличныйДокумент) Экспорт
	
	// Создадим и инициализируем процессор вывода результата
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабличныйДокумент);
	
	// Обозначим начало вывода
	ПроцессорВывода.НачатьВывод();
	
	ТаблицаЗафиксирована = Ложь;
	
	// Основной цикл вывода отчета
	Пока Истина Цикл
		
		// Получим следующий элемент результата компоновки
		ЭлементРезультата = ПроцессорКомпоновкиДанных.Следующий();
		
		Если ЭлементРезультата = Неопределено Тогда
			// Следующий элемент не получен - заканчиваем цикл вывода
			Прервать;
			
		Иначе
			Если Не ТаблицаЗафиксирована И ЭлементРезультата.ЗначенияПараметров.Количество() > 0 Тогда
				ТаблицаЗафиксирована = Истина;
				ТабличныйДокумент.ФиксацияСверху = ТабличныйДокумент.ВысотаТаблицы;
			КонецЕсли;
			
			// Элемент получен - выведем его при помощи процессора вывода
			ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПроцессорВывода.ЗакончитьВывод();
	
КонецПроцедуры

// Процедура выводить форму структуры подчиненности документа
Процедура ПоказатьСтруктуруПодчиненностиДокумента(ДокументСсылка) Экспорт
	
	ФормаСтруктурыПодчиненности = ПолучитьОбщуюФорму("ФормаСтруктурыПодчиненности");
	Если ФормаСтруктурыПодчиненности.Открыта() Тогда
		ФормаСтруктурыПодчиненности.Закрыть();
	КонецЕсли;
	ФормаСтруктурыПодчиненности.ДокументСсылка = ДокументСсылка;
	ФормаСтруктурыПодчиненности.Открыть();
	
КонецПроцедуры

// Процедура вызывается для вывода сообщений пользователю
//
// Параметры:
//  СсылкаСправочника - ссылка на справочник, объект которого проверяется;
//  ИмяРеквизита - строка, имя реквизита, который не заполнен.
//
Процедура СообщитьПользователюНезаполненРеквизит(СсылкаСправочника, ИмяРеквизита) Экспорт
	
	ТекстСообщения = "Перед записью в элементе справочника """ + СсылкаСправочника.Метаданные().Синоним + """ необходимо заполнить """ + ИмяРеквизита + """!";
	
	Сообщить(ТекстСообщения, СтатусСообщения.Важное);
	
КонецПроцедуры // СообщитьПользователюНезаполненРеквизит()

// Функция спрашивает пользователя записать ли объект, или нет, если он новый
//
// Параметры
//  ФормаОбъекта - Форма объекта, из которой пытаются произвести действия
//
// Возвращаемое значение:
//   Булево - Объект записан или нет
//
Функция ЗаписатьНовыйОбъектВФорме(ФормаОбъекта) Экспорт
	
	Если ФормаОбъекта.ЭтоНовый() Тогда
		Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ФормаОбъекта.ЭтотОбъект.Ссылка)) Тогда
			ТекстВопроса = "Для выполнения данной операции необходимо записать документ. Записать?";
		Иначе // Справочник
			ТекстВопроса = "Для выполнения данной операции необходимо записать элемент. Записать?";
		КонецЕсли; 
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат Ложь;
		Иначе
			Попытка
				Возврат ФормаОбъекта.ЗаписатьВФорме();
			Исключение
				Сообщить(ОписаниеОшибки());
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли;
	Иначе
		Возврат Истина;
	КонецЕсли; 
	
КонецФункции // ЗаписатьНовыйОбъектВФорме()

Функция ЗаписатьИзмененныйОбъектВФорме(ФормаОбъекта) Экспорт
	
	Если ФормаОбъекта.Модифицированность Тогда
		Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ФормаОбъекта.ЭтотОбъект.Ссылка)) Тогда
			ТекстВопроса = "Для выполнения данной операции необходимо записать документ. Записать?";
		Иначе // Справочник
			ТекстВопроса = "Для выполнения данной операции необходимо записать элемент. Записать?";
		КонецЕсли; 
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат Ложь;
		Иначе
			Попытка
				Возврат ФормаОбъекта.ЗаписатьВФорме();
			Исключение
				Сообщить(ОписаниеОшибки());
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции // ЗаписатьНовыйОбъектВФорме()

Функция ПроверкаРазрешенияРедактирования(Форма) Экспорт	
	Если Форма.Дата<=ПолучитьДатуЗапретаРедактирования(Форма.Ссылка) Тогда
		Форма.ТолькоПросмотр=Истина;	
	КонецЕсли;	
	
	//было
	////контроль доступности документов по складу
	//МетаДок=Форма.Метаданные();	
	//Если ЕстьРеквизитДокумента("Склад",МетаДок) Тогда		
	//	Документ=Форма.ЭтотОбъект;		
	//	ЭтотУзел=ПараметрыСеанса.ЭтотУзел;		
	//	
	//	Если ЭтотУзел.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение И МетаДок.Имя="Перемещение" Тогда
	//		Если Документ.Склад.КодФизическогоУзла=ЭтотУзел.Код Тогда
	//			СкладДокумента=Документ.Склад;
	//		ИначеЕсли Документ.СкладПолучатель.КодФизическогоУзла=ЭтотУзел.Код Тогда
	//			СкладДокумента=Документ.СкладПолучатель;							
	//		Иначе
	//			СкладДокумента=Документ.Склад;				
	//		КонецЕсли;			
	//	Иначе
	//		СкладДокумента=Документ.Склад;
	//	КонецЕсли; 
	//	
	//	Доступ						=ПолучитьПараметрыДоступаКДокументамПоСкладу(СкладДокумента);
	//	ДоступНаПросмотр			=Доступ.Просмотр;
	//	ДоступНаРедактирование		=Доступ.Редактирование;
	//	
	//	Если ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение И МетаДок.Имя="Перемещение" Тогда		
	//		Доступ					=ПолучитьПараметрыДоступаКДокументамПоСкладу(Документ.СкладПолучатель);
	//		ДоступНаПросмотр		=Макс(ДоступНаПросмотр,Доступ.Просмотр);
	//		ДоступНаРедактирование	=Макс(ДоступНаРедактирование,Доступ.Редактирование);			
	//	КонецЕсли;				
	//	
	//	Если НЕ ДоступНаПросмотр Тогда
	//		Предупреждение("Недостаточно прав для просмотра документов по складу: """+СкладДокумента+""" !");
	//		Возврат Ложь;		
	//	ИначеЕсли НЕ Форма.ТолькоПросмотр Тогда
	//		Форма.ТолькоПросмотр=НЕ ДоступНаРедактирование;			
	//	КонецЕсли;		
	//КонецЕсли;
	
	       	
	
	//нечаева 20,01,16+++ 
	// для работников склада разрешаем работу со всеми документами
	// и для ТЦ
	МетаДок=Форма.Метаданные();	                                             // тц . Нечаева  01,02,16+++ 
	Если параметрыСеанса.ТипУзла = перечисления.ТипУзлаИБ.Склад или  (параметрысеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.ТорговоеПодразделение И   (НЕ параметрысеанса.ЭтотУзел.Подразделение.ЕстьВыделенныйСклад) ) 
		
		или  параметрыСеанса.ЭтотУзел.Код = "SEM" 	Тогда
		Доступ = истина;													//  Нечаева  01,02,16  ----
		ДоступНаПросмотр = истина;
		ДоступНаРедактирование = истина;
		
	иначе	
	//контроль доступности документов по складу  для остальных узлов  - филиалы только
	Если ЕстьРеквизитДокумента("Склад",МетаДок) Тогда		
		Документ=Форма.ЭтотОбъект;		
		ЭтотУзел=ПараметрыСеанса.ЭтотУзел;		
		
		Если ЭтотУзел.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение И МетаДок.Имя="Перемещение" Тогда
			Если Документ.Склад.КодФизическогоУзла=ЭтотУзел.Код Тогда
				СкладДокумента=Документ.Склад;
			ИначеЕсли Документ.СкладПолучатель.КодФизическогоУзла=ЭтотУзел.Код Тогда
				СкладДокумента=Документ.СкладПолучатель;							
			Иначе
				СкладДокумента=Документ.Склад;				
			КонецЕсли;			
		Иначе
			СкладДокумента=Документ.Склад;
		КонецЕсли; 
		
		Доступ						=ПолучитьПараметрыДоступаКДокументамПоСкладу(СкладДокумента);
		ДоступНаПросмотр			=Доступ.Просмотр;
		ДоступНаРедактирование		=Доступ.Редактирование;
		
		Если ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение И МетаДок.Имя="Перемещение" Тогда		
			Доступ					=ПолучитьПараметрыДоступаКДокументамПоСкладу(Документ.СкладПолучатель);
			ДоступНаПросмотр		=Макс(ДоступНаПросмотр,Доступ.Просмотр);
			ДоступНаРедактирование	=Макс(ДоступНаРедактирование,Доступ.Редактирование);			
		КонецЕсли;				
		
		Если НЕ ДоступНаПросмотр Тогда
			Предупреждение("Недостаточно прав для просмотра документов по складу: """+СкладДокумента+""" !");
			Возврат Ложь;		
		ИначеЕсли НЕ Форма.ТолькоПросмотр Тогда
			Форма.ТолькоПросмотр=НЕ ДоступНаРедактирование;			
		КонецЕсли;		
	КонецЕсли;

		
	КонецЕсли;	
	//нечаева 20,01,16---
	
	
		
	ВидДокумента=МетаДок.Имя;
	Если ВидДокумента="Чек" И Форма.Ссылка.ЧекПробитНаККМ Тогда
		
		//Форма.ТолькоПросмотр=НЕ ПолучитьПолномочиеПользователя("ИзменениеПробитыхЧеков");
		
		// Нечаева ++  запрет редактирования пробитых чеков  31,10,13
		Если НЕ РольДоступна("Администратор") Тогда
			Форма.ТолькоПросмотр=истина;  //НЕ ПолучитьПолномочиеПользователя("ИзменениеПробитыхЧеков");
		Конецесли;
		// нечаева ---  31,10,13
		
		
	ИначеЕсли ВидДокумента="СчетФактура" Тогда
		Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			Форма.ТолькоПросмотр=НЕ ПолучитьПолномочиеПользователя("ВыпискаСФвОфисе");
		КонецЕсли;		
	ИначеЕсли Найти("ДвиженияДенежныхСредств,ПереводСредств,ПриходныйКассовыйОрдер,РасходныйКассовыйОрдер",ВидДокумента)<>0 Тогда
		Возврат ПроверкаДоступаККассовомуДокументу(Форма);
	КонецЕсли;
	//крохин начало
	//запрещаем редактирование кассы и чеков прошлыми датами
	Если ВидДокумента="Чек" ИЛИ ВидДокумента = "ПриходныйКассовыйОрдер" ИЛИ ВидДокумента = "РасходныйКассовыйОрдер" ИЛИ ВидДокумента = "ПереводСредств" ИЛИ ВидДокумента = "ОтчетКассовойСмены" Тогда
		Если ПараметрыСеанса.ТипУзла <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			Если НЕ РольДоступна("Администратор") Тогда
				Если началодня(Форма.Дата) < НачалоДня(ТекущаяДата()) Тогда
					Форма.ТолькоПросмотр=Истина;			
				КонецЕсли;			
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//крохин конец
	
	Возврат Истина;
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБРАБОТКИ ИНФОРМАЦИИ В ФОРМЕ

//  Процедура определяет ситуацию, когда при изменении своей даты документ 
//  оказывается в другом периоде нумерации документов, и в это м случае
//  присваивает документу новый уникальный номер.
//
// Параметры:
//  ДокументОбъект         - контекст документа,из которого вызвана процедура 
//  НачальнаяДатаДокумента - начальная дата документа 
// 
Функция ПроверитьНомерДокумента(ДокументОбъект, НачальнаяДатаДокумента,Предупреждать=Истина) Экспорт   // в разработке
	
    //крохин начало 31.12.2024
	//с 2025 года для РНК, ПНК, ПРМ не надо перенумеровывать, для новых будет префикс каждый год меняться
	
	// Кухарь А.Ю.  28.12.2022 начало
	//Отменяем смену номера для РНК
	// Кухарь А.Ю.  09.01.2023 начало 
	//В филиалах нужно менять
	//если ПараметрыСеанса.ТипУзла<>Перечисления.ТипУзлаИБ.ТорговоеПодразделение тогда
	//	// Кухарь А.Ю.  09.01.2023 конец
	//	если ТипЗнч(ДокументОбъект)=Тип("ДокументОбъект.РасходнаяНакладная") или ТипЗнч(ДокументОбъект)=Тип("ДокументСсылка.РасходнаяНакладная") тогда
	//		возврат Истина;
	//	КонецЕсли;	
	//КонецЕсли;
	// Кухарь А.Ю.  28.12.2022 конец

	
	Если ТипЗнч(ДокументОбъект)=Тип("ДокументОбъект.РасходнаяНакладная") или ТипЗнч(ДокументОбъект)=Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		возврат Истина;
	КонецЕсли;
	Если ТипЗнч(ДокументОбъект)=Тип("ДокументОбъект.ПриходнаяНакладная") или ТипЗнч(ДокументОбъект)=Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		возврат Истина;
	КонецЕсли;
	Если ТипЗнч(ДокументОбъект)=Тип("ДокументОбъект.Перемещение") или ТипЗнч(ДокументОбъект)=Тип("ДокументСсылка.Перемещение") Тогда
		возврат Истина;
	КонецЕсли;
	Если ТипЗнч(ДокументОбъект)=Тип("ДокументОбъект.Заказ") или ТипЗнч(ДокументОбъект)=Тип("ДокументСсылка.Заказ") Тогда
		возврат Истина;
	КонецЕсли;
	//крохин конец 31.12.2024


	

	
	// Определяем назначенную для данного вида документов периодичность смены номера
	ПериодСменыНомера = ДокументОбъект.Метаданные().ПериодичностьНомера;
	
	//В зависимости от установленной периодичности смены номеров,
	//определяем разность старой и новой датами документа.
	РазностьДат=0;
	
	Если ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Год Тогда
		РазностьДат = НачалоГода(НачальнаяДатаДокумента) - НачалоГода(ДокументОбъект.Дата);
		
	ИначеЕсли ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Квартал Тогда
		РазностьДат = НачалоКвартала(НачальнаяДатаДокумента) - НачалоКвартала(ДокументОбъект.Дата);
		
	ИначеЕсли ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Месяц Тогда
		РазностьДат = НачалоМесяца(НачальнаяДатаДокумента) - НачалоМесяца(ДокументОбъект.Дата);
		
	ИначеЕсли ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.День Тогда
		РазностьДат = НачальнаяДатаДокумента - ДокументОбъект.Дата; 
	КонецЕсли;
	
	Если РазностьДат <> 0 Тогда
		Если Предупреждать Тогда
			Ответ=Вопрос("Изменена дата документа ! Номер документа будет изменен ! Продолжать ?",РежимДиалогаВопрос.ДаНет);
			Если Ответ<>КодВозвратаДиалога.Да Тогда
				Возврат Ложь;			
			КонецЕсли;
		КонецЕсли;		
		УстановитьНомерДокумента(ДокументОбъект);
	КонецЕсли;
	
	Возврат Истина;
КонецФункции// ПроверитьНомерДокумента()

Функция ПерваяСФ(Префикс,Дата)
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ
	|	Документ.СчетФактура КАК СчетФактура
	|ГДЕ
	|	Дата МЕЖДУ &Дата1 И &Дата2
	|	И Номер ПОДОБНО &Номер
	|	И НЕ ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Дата));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата));
	Запрос.УстановитьПараметр("Номер",Префикс+"%");		
	
	Возврат Запрос.Выполнить().Пустой();
КонецФункции //ПерваяСФ(Префикс,Дата)

Функция УстановитьНормальныйНовыйНомер(ДокументОбъект,Префикс,КоличествоПропусков=0)
	МетаДок=ДокументОбъект.Метаданные();	
	Периодичность=МетаДок.ПериодичностьНомера;
	ДлинаЧисловойЧасти=МетаДок.ДлинаНомера-СтрДлина(СокрЛП(Префикс));;
	
	Если МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Год Тогда
		Дата1=НачалоГода(ДокументОбъект.Дата);	
		Дата2=КонецГода(ДокументОбъект.Дата);	
	ИначеЕсли МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Квартал Тогда
		Дата1=НачалоКвартала(ДокументОбъект.Дата);	
		Дата2=КонецКвартала(ДокументОбъект.Дата);					
	ИначеЕсли МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Месяц Тогда
		Дата1=НачалоМесяца(ДокументОбъект.Дата);	
		Дата2=КонецМесяца(ДокументОбъект.Дата);					
	ИначеЕсли МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.День Тогда
		Дата1=НачалоДня(ДокументОбъект.Дата);	
		Дата2=КонецДня(ДокументОбъект.Дата);
	Иначе
		Дата1=Неопределено;		
		Дата2=Неопределено;
	КонецЕсли;
	
	Шаблон=СокрЛП(Префикс);
	Для Сч=1 По ДлинаЧисловойЧасти Цикл
		Шаблон=Шаблон+"[0-9]";	
	КонецЦикла;
	
	Запрос=Новый Запрос;
	//нечаева 02,12,16++
	//было
	//Запрос.Текст="
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	МАКСИМУМ(Номер) КАК Номер
	//|ИЗ
	//|	Документ."+МетаДок.Имя+"
	//|ГДЕ
	//|	"+?(Дата1=Неопределено,"","Дата МЕЖДУ &Дата1 И &Дата2 И ")+"
	//|	Номер ПОДОБНО &Шаблон";
	
	// Для СФ и КСФ берем последний номер из их последовательности.
	Если  МетаДок.Имя = "СчетФактура" или МетаДок.Имя = "КорректировочныйСчетФактура"  Тогда
		
		Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(СчетФактура.Номер) КАК Номер
		|ИЗ
		|	Документ.СчетФактура КАК СчетФактура
		|ГДЕ
		// |	СчетФактура.Дата МЕЖДУ &Дата1 И &Дата2
		|	"+?(Дата1=Неопределено,"","Дата МЕЖДУ &Дата1 И &Дата2 И ")+"
		|	СчетФактура.Номер ПОДОБНО &Шаблон
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МАКСИМУМ(КорректировочныйСчетФактура.Номер)
		|ИЗ
		|	Документ.КорректировочныйСчетФактура КАК КорректировочныйСчетФактура
		|ГДЕ
		|	"+?(Дата1=Неопределено,"","Дата МЕЖДУ &Дата1 И &Дата2 И ")+"
		|	КорректировочныйСчетФактура.Номер ПОДОБНО &Шаблон
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер УБЫВ";
		
	иначе
		Запрос.Текст="
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(Номер) КАК Номер
		|ИЗ
		|	Документ."+МетаДок.Имя+"
		|ГДЕ
		|	"+?(Дата1=Неопределено,"","Дата МЕЖДУ &Дата1 И &Дата2 И ")+"
		|	Номер ПОДОБНО &Шаблон";
		
	КонецЕсли;
	//нечаева 02,12,16---
	
	Запрос.УстановитьПараметр("Шаблон",Шаблон);
	
	Если Дата1<>Неопределено Тогда
		Запрос.УстановитьПараметр("Дата1",Дата1);
		Запрос.УстановитьПараметр("Дата2",Дата2);
	КонецЕсли;
	
	НомерДока		=Неопределено;
	ПоследнийНомер =0;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.Номер) Тогда
			НомерДока		=Выборка.Номер;
			ПоследнийНомер	=Число(СтрЗаменить(Выборка.Номер,СокрЛП(Префикс),""));
		КонецЕсли;		
	КонецЕсли;	
	
	Коэффициент=1;
	
	//Если НомерДока<>Неопределено Тогда	
	//	ПоследнийДок=Документы[МетаДок.Имя].НайтиПоНомеру(НомерДока,ДокументОбъект.Дата);
	//	Если ПоследнийДок<>Неопределено Тогда
	//		Коэффициент=Цел(Макс(1,(КонецДня(ДокументОбъект.Дата)-КонецДня(ПоследнийДок.Дата))/(24*60*60)));
	//	КонецЕсли;
	//КонецЕсли;
	Если КоличествоПропусков = 1 Тогда
		КоличествоПропусков = 0;
		ПоследнийДок=Документы[МетаДок.Имя].НайтиПоНомеру(НомерДока,ДокументОбъект.Дата);
		Запрос = Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	ПропускСФ.КоличествоПропусков,
		|	ПропускСФ.Дата,
		|	ПропускСФ.ТипСклада
		|ИЗ
		|	Справочник.ПропускСФ КАК ПропускСФ
		|ГДЕ
		|	(НЕ ПропускСФ.ПометкаУдаления)
		|	И ПропускСФ.ТипСклада = &ТипСклада
		|	И ПропускСФ.Дата МЕЖДУ &Дата1 И &Дата2";
		
		Если Дата1<>Неопределено Тогда
			Если ПоследнийДок <> Документы[МетаДок.Имя].ПустаяСсылка() Тогда
				Запрос.УстановитьПараметр("Дата1",КонецДня(ПоследнийДок.Дата)+1);
			Иначе
				Запрос.УстановитьПараметр("Дата1",КонецДня(НачалоГода(ДокументОбъект.Дата)));
			Конецесли;
			Запрос.УстановитьПараметр("Дата2",КонецДня(ДокументОбъект.Дата));
		КонецЕсли;
		Если Лев(Префикс,2)="КБ" Тогда
			Запрос.УстановитьПараметр("ТипСклада",Перечисления.ТипСклада.КБСтиль);	
		Иначе
			Запрос.УстановитьПараметр("ТипСклада",ДокументОбъект.Склад.ТипСклада);	
		КонецЕсли;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			КоличествоПропусков = Выборка.КоличествоПропусков + КоличествоПропусков ;
		КонецЦикла;
	КонецЕсли;
	
	ДокументОбъект.Номер=СокрЛП(Префикс)+Формат(ПоследнийНомер+1+КоличествоПропусков*Коэффициент,"ЧЦ="+ДлинаЧисловойЧасти+"; ЧВН=");
КонецФункции //УстановитьНормальныйНовыйНомер(ДокументОбъект,Префикс,КоличествоПропусков=0)

Функция ПолучитьПрефиксИБ(Склад) Экспорт	
	Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение И ЗначениеЗаполнено(Склад.ПрефиксИБ) Тогда
		ПрефиксИБ=Склад.ПрефиксИБ;
	Иначе
		ПрефиксИБ=ПараметрыСеанса.ЭтотУзел.Код;
	КонецЕсли; 
	
	Возврат ПрефиксИБ;
КонецФункции // ()

//крохин начало
Функция ПолучитьДатуОплаты(ДатаОтгрузки,ОтсрочкаПлатежа)  Экспорт
	Если   ДатаОтгрузки = '00010101000000' Тогда
		Возврат  '00010101000000'
	Иначе
		Если  ОтсрочкаПлатежа.ВидОтсрочки = Перечисления.ВидыОтсрочки.БанковскиеДни Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	КалендарьДни.Дата КАК Дата
			|ИЗ
			|	Справочник.Календарь.Дни КАК КалендарьДни
			|ГДЕ
			|	КалендарьДни.Дата >= &ДатаОтгрузки
			|	И КалендарьДни.Часы <> 0
			|	И (НЕ КалендарьДни.Ссылка.ПометкаУдаления)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата
			|АВТОУПОРЯДОЧИВАНИЕ";
			Запрос.УстановитьПараметр("ДатаОтгрузки",ДатаОтгрузки);
			Выборка = Запрос.Выполнить().Выбрать();
			НПП = 0;
			Пока Выборка.Следующий() Цикл
				
				Если НПП = ОтсрочкаПлатежа.Отсрочка Тогда
					Возврат Выборка.Дата;	
				Конецесли;
				НПП = НПП + 1;
			КонецЦикла;
			
			Возврат ДатаОтгрузки+ОтсрочкаПлатежа.Отсрочка*24*60*60;		
		Иначе		
			Возврат ДатаОтгрузки+ОтсрочкаПлатежа.Отсрочка*24*60*60;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции
//крохин конец
// Процедура устанавливает номер документа.
//
// Параметры:
//  ДокументОбъект  - ДокументОбъект. Экземпляр документа, которому 
//                    необходимо присвоить новый номер
//

//нечаева 27,09,16+++
//удаляем лидирующие нули, например, в номерах КСФ
Функция УдалитьНули(СтрокаСНулями) Экспорт
	
	СтрокаБезНулей = СтрокаСНулями;
	
	Если Лев(СтрокаСНулями,1) = "0" ТОгда
		СтрокаБезНулей = Прав(СтрокаСНулями,СтрДлина(СтрокаСнулями)-1);
		Возврат УдалитьНули(СтрокаБезНулей);
	КонецЕсли;	
	
	Возврат СтрокаБезНулей;
	
КонецФункции
//нечаева 27,09,16---


// Кухарь А.Ю. 15.12.2021 начало
// Для вызова из регламентных заданий нужно переделать
Процедура УстановитьНомерДокументаСтарая(ДокументОбъект) экспорт 
	// Если  нет реквизита "Организация" или для нее не задан префикс, то 
	// используем пустой префикс,
	// иначе используем префикс организации.
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	ДопБуква="";
	Если МетаданныеДокумента.Имя="РасходнаяНакладная" Тогда
		//крохин начало 17.01.2020
		//ДопБуква=?(ДокументОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН,"б","а");
		Если ДокументОбъект.Дата >= '20200101' Тогда
			ДопБуква="б";
		Иначе
			ДопБуква=?(ДокументОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН,"б","а");
		КонецЕсли;
		//крохин конец 17.01.2020
	ИначеЕсли МетаданныеДокумента.Имя="ОтчетКассовойСмены" Тогда
		ДопБуква=?(ДокументОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН,"кб","кн");	
	КонецЕсли; 
	
	Вид=МетаданныеДокумента.Имя;
	//кухарь 15.08.14 начало
	//Если Вид="ЛистНабора" Тогда
	Если Вид="ЛистНабора" или Вид="ЛистПереукладки" Тогда
		//кухарь 15.08.14 конец
		
		//ДокументОбъект.УстановитьНовыйНомер(СокрЛП(ДокументОбъект.ДокОснование.Номер)+"/");
		// Нечаева    +++++ 02,07,13 // новый префикс для листов набора на инвентаризацию
		ИмяДокумента=СокрЛП(ДокументОбъект.ДокОснование.Номер);
		ТипДокОсн= ДокументОбъект.ДокОснование.Метаданные().Имя;
		Если ТипДокОсн="Инвентаризация" Тогда
			
			ИмяДокумента=""+ИмяДокумента+"i";
			// и убираем один ноль;
			ИмяДокумента=Лев(ИмяДокумента,4)+Сред(ИмяДокумента,6,СтрДлина(ИмяДокумента))+"/";
			ДокументОбъект.УстановитьНовыйНомер(СокрЛП(ИмяДокумента));
		Иначе
			ДокументОбъект.УстановитьНовыйНомер(СокрЛП(ДокументОбъект.ДокОснование.Номер)+"/");
		КонецЕсли;
		//// нечаева  ------ 02,07,13
		
		//нечаева 23,08,16+++	
	ИначеЕсли  Вид="КорректировочныйСчетФактура" Тогда
		//крохин начало 01.08.2019
		
		//попытка
		//	
		//	Если ДокументОбъект.ДокОснование.метаданные.имя="РНК" Тогда
		//		возврат;
		//	КонецЕсли;	
		//исключение
		//конецПопытки;
		//крохин конец 01.08.2019
		
		//номер РНК
		попытка
			
			ДокРНк=ДокументОбъект.накладные[0].накладная.докоснование.ссылка; 
			
		исключение
			сообщить("Сначала сохраните документ!");
		конецПопытки;
		
		
		
		//нечаева 06,02,17------
		Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
			Префикс=ПараметрыСеанса.ЭтотУзел.Код;
			//крохин начало
			ПрефиксСклада	=СокрЛП(ДокументОбъект.Склад.Префикс);
			Префикс = Префикс + ПрефиксСклада;
			//крохин конец
			//крохин начало 24.09.2013
			//в филиалах появились отгрузки от ГТ
			Если ДокументОбъект.Организация <> Справочники.Организации.НайтиПоКоду("SS-001") И не ПустаяСтрока(ДокументОбъект.Организация.Префикс) Тогда
				Префикс = Лев(ДокументОбъект.Организация.Префикс,1)+ Прав(Префикс,СтрДлина(Префикс)-1);	
			КонецЕсли;
			//крохин конец 24.09.2013
		Иначе
			ПрефиксКонтрагента="";
			
			Если ДокументОбъект.Накладные.Количество()>0 Тогда
				Накладная=ДокументОбъект.Накладные[0].Накладная;
				Если ЕстьРеквизитДокумента("ПунктДоставки",Накладная.Метаданные()) И ЗначениеЗаполнено(Накладная.ПунктДоставки.ПрефиксСФ) Тогда
					ПрефиксКонтрагента=СокрЛП(Накладная.ПунктДоставки.ПрефиксСФ);
				КонецЕсли;			
			КонецЕсли;			
			
			Если ПустаяСтрока(ПрефиксКонтрагента) Тогда
				ПрефиксКонтрагента=СокрЛП(ПолучитьРеквизитРодителя(ДокументОбъект.Контрагент,"ПрефиксСФ"));			
			КонецЕсли; 
			
			Если ПустаяСтрока(ПрефиксКонтрагента) Тогда
				ПрефиксСклада	=СокрЛП(ДокументОбъект.Склад.Префикс);
				//крохин начало 01.08.2019
				//для КСФ-возвратов в ЦО префикс склада всегда "v"
				Попытка
					ДокРКМ =  ДокументОбъект.накладные[0].накладная;
					Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение И ДокРКМ.Метаданные().Имя = "РекламационнаяНакладная" И НЕ (ДокРКМ.ДокументВозврата.Пустая()) Тогда
						ПрефиксСклада = "v";	
					КонецЕсли;
				Исключение
					
				КонецПопытки;
				//крохин конец 01.08.2019
				ПрефиксИБ		=СокрЛП(ДокументОбъект.Склад.ПрефиксИБ);
				
				Если ПрефиксИБ="SNL" Тогда
					Префикс=ПрефиксИБ;
				Иначе
					Префикс=?(НЕ ПустаяСтрока(ДокументОбъект.Организация.Префикс),СокрЛП(ДокументОбъект.Организация.Префикс)+ПрефиксСклада,ДокументОбъект.ИБ.Код);				
				КонецЕсли;				
			Иначе				
				Префикс=?(НЕ ПустаяСтрока(ДокументОбъект.Организация.Префикс),СокрЛП(ДокументОбъект.Организация.Префикс)+ПрефиксКонтрагента,ДокументОбъект.ИБ.Код);			
			КонецЕсли;			
		КонецЕсли; 
		
		Если ПерваяСФ(Префикс,ДокументОбъект.Дата) Тогда
			//Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
			//	КоличествоПропусков=2;			
			//ИначеЕсли Лев(Префикс,2)="КБ" Тогда
			//	КоличествоПропусков=4;
			//Иначе	
			//	КоличествоПропусков=1;						
			//КонецЕсли;
			КоличествоПропусков = 1; 
		Иначе
			КоличествоПропусков=0;
		КонецЕсли;
		
		УстановитьНормальныйНовыйНомер(ДокументОбъект,Префикс+"-",КоличествоПропусков);
		//нечаева 06,02,17 ++++
		
		
		
		
		//// ищем СФ
		//Запрос= Новый Запрос;
		//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		//			   |	СчетФактураНакладные.Ссылка
		//			   |ИЗ
		//			   |	Документ.СчетФактура.Накладные КАК СчетФактураНакладные
		//			   |ГДЕ
		//			   |	СчетФактураНакладные.Накладная.ссылка = &ТекДок
		//			   |	И СчетФактураНакладные.Ссылка.Проведен = ИСТИНА";
		//запрос.УстановитьПараметр("ТекДок",ДокРНк.ссылка);			   
		//Рез = Запрос.Выполнить().Выбрать();
		//Если рез.Количество()= 0 Тогда
		//	сообщить("Не создана СФ, к документу РНК! КСФ создать не возможно.");
		//Иначе
		//	Если РЕз.Следующий() ТОгда
		//		ИмяДокумента = Рез.ссылка.номер; // номер СФ.
		//		// новое через ШК
		//		ТипДокОсн= ДокументОбъект.накладные[0].накладная.Метаданные().Имя;
		//		Если ТипДокОсн="Инвентаризация" Тогда
		//			ИмяДокумента=""+ИмяДокумента+"i";
		//			ИмяДокумента=Лев(ИмяДокумента,4)+Сред(ИмяДокумента,6,СтрДлина(ИмяДокумента))+"/";
		//			ДокументОбъект.УстановитьНовыйНомер(СокрЛП(ИмяДокумента));
		//		Иначе
		//			ДокументОбъект.УстановитьНовыйНомер(СокрЛП(""+ИмяДокумента+"/"));
		//			// удалим лишние нули, перед номером. нечаева 27,09,16+++
		//			СтрокаПСЛ =  Найти(ДокументОбъект.Номер, "/");
		//			Если СтрокаПСЛ > 0 Тогда
		//				ЧастьДляОбрезки = Прав(ДокументОбъект.Номер,СтрДлина(ДокументОбъект.Номер)-СтрокаПСЛ);
		//				НомерБезНулей = УдалитьНули(ЧастьДляОбрезки); 
		//				ДокументОбъект.Номер = ИмяДокумента+"/"+НомерБезНулей;
		//			КонецЕсли;
		//			// нечаева 27,09,16 ---
		//		
		//		КонецЕсли;
		//	КонецЕсли;
		//конецесли;
		//
		//нечаева 23,08,16---
	ИначеЕсли Вид="СчетФактура" Тогда 		
		Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
			Префикс=ПараметрыСеанса.ЭтотУзел.Код;
			//крохин начало
			ПрефиксСклада	=СокрЛП(ДокументОбъект.Склад.Префикс);
			Префикс = Префикс + ПрефиксСклада;
			//крохин конец
			//крохин начало 24.09.2013
			//в филиалах появились отгрузки от ГТ
			Если ДокументОбъект.Организация <> Справочники.Организации.НайтиПоКоду("SS-001") И не ПустаяСтрока(ДокументОбъект.Организация.Префикс) Тогда
				Префикс = Лев(ДокументОбъект.Организация.Префикс,1)+ Прав(Префикс,СтрДлина(Префикс)-1);	
			КонецЕсли;
			//крохин конец 24.09.2013
		Иначе
			ПрефиксКонтрагента="";
			
			Если ДокументОбъект.Накладные.Количество()>0 Тогда
				Накладная=ДокументОбъект.Накладные[0].Накладная;
				Если ЕстьРеквизитДокумента("ПунктДоставки",Накладная.Метаданные()) И ЗначениеЗаполнено(Накладная.ПунктДоставки.ПрефиксСФ) Тогда
					ПрефиксКонтрагента=СокрЛП(Накладная.ПунктДоставки.ПрефиксСФ);
				КонецЕсли;			
			КонецЕсли;			
			
			Если ПустаяСтрока(ПрефиксКонтрагента) Тогда
				ПрефиксКонтрагента=СокрЛП(ПолучитьРеквизитРодителя(ДокументОбъект.Контрагент,"ПрефиксСФ"));			
			КонецЕсли; 
			
			Если ПустаяСтрока(ПрефиксКонтрагента) Тогда
				ПрефиксСклада	=СокрЛП(ДокументОбъект.Склад.Префикс);
				ПрефиксИБ		=СокрЛП(ДокументОбъект.Склад.ПрефиксИБ);
				
				Если ПрефиксИБ="SNL" Тогда
					Префикс=ПрефиксИБ;
				Иначе
					Префикс=?(НЕ ПустаяСтрока(ДокументОбъект.Организация.Префикс),СокрЛП(ДокументОбъект.Организация.Префикс)+ПрефиксСклада,ДокументОбъект.ИБ.Код);				
				КонецЕсли;				
			Иначе				
				Префикс=?(НЕ ПустаяСтрока(ДокументОбъект.Организация.Префикс),СокрЛП(ДокументОбъект.Организация.Префикс)+ПрефиксКонтрагента,ДокументОбъект.ИБ.Код);			
			КонецЕсли;			
		КонецЕсли; 
		
		Если ПерваяСФ(Префикс,ДокументОбъект.Дата) Тогда
			//Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
			//	КоличествоПропусков=2;			
			//ИначеЕсли Лев(Префикс,2)="КБ" Тогда
			//	КоличествоПропусков=4;
			//Иначе	
			//	КоличествоПропусков=1;						
			//КонецЕсли;
			КоличествоПропусков = 1; 
		Иначе
			КоличествоПропусков=0;
		КонецЕсли;
		
		УстановитьНормальныйНовыйНомер(ДокументОбъект,Префикс+"-",КоличествоПропусков);
	ИначеЕсли ЕстьРеквизитДокумента("ИБ",МетаданныеДокумента) Тогда
		ЭтотУзел=ПараметрыСеанса.ЭтотУзел;
		
		Если МетаданныеДокумента.Имя="РасходнаяНакладная" И СокрЛП(ДокументОбъект.Контрагент.Код)="SSP-8643" Тогда		
			Если ДокументОбъект.Дата>Дата(2015,06,28) и ДокументОбъект.Дата<Дата(2016,01,01) Тогда
				
				КодИБ="SST";
				ПрефиксИБ = "SST";
				
			иначе
				
				// нечаева 29,06,15+++
				КодИБ = "SSP";
				ПрефиксИБ = "SSP";
				// нечаева 29,06,15---
			КонецЕсли;
			
		Иначе
			Если ЕстьРеквизитДокумента("Склад",МетаданныеДокумента) Тогда
				ПрефиксИБ=ДокументОбъект.Склад.ПрефиксИБ;
				если (МетаданныеДокумента.Имя="РасходнаяНакладная" ИЛИ МетаданныеДокумента.Имя="Перемещение" ИЛИ МетаданныеДокумента.Имя="ПриходнаяНакладная")  Тогда         
					//Кухарь А.Ю.  22.12.2025 начало
					//Если  ДеньГода(ДокументОбъект.Дата) > 334 Тогда 	
					//	Если ЭтотУзел.Код = "EKF" Тогда 
					//		ПрефиксИБ = "EKT";
					//	КонецЕсли;		
					//	Если ПрефиксИБ = "SSP" или ПрефиксИБ = "" Тогда 
					//		ПрефиксИБ = "SST";
					//	КонецЕсли;
					//ИначеЕсли ДеньГода(ДокументОбъект.Дата) > 181 Тогда
					//	
					//	Если ПрефиксИБ = "SSP" или ПрефиксИБ = "" Тогда 
					//		ПрефиксИБ = "SSV";
					//	КонецЕсли;
					//КонецЕсли;
					 ПрефиксИБ = ОбщегоНазначения_ПИ.ПолучитьПрефиксПоДатеИУзлу(НачалоГода(ДокументОбъект.Дата),ЭтотУзел);
					//Кухарь А.Ю.  22.12.2025 конец

				КонецЕсли;
			КонецЕсли;		
			Если ПустаяСтрока(ПрефиксИБ) Тогда
				ПрефиксИБ=ДокументОбъект.ИБ.Код;			
			КонецЕсли; 	   
			
			КодИБ=?(ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение,ПрефиксИБ,ЭтотУзел.Код);

		
			
		КонецЕсли;		
		
		//Мессерле
		Если МетаданныеДокумента.Имя="Заказ"  Тогда		
			Если ЕстьРеквизитДокумента("Склад",МетаданныеДокумента) Тогда
				ПрефиксИБ=ДокументОбъект.Склад.ПрефиксИБ;
			КонецЕсли;		
			Если ПустаяСтрока(ПрефиксИБ) Тогда
				ПрефиксИБ=ДокументОбъект.ИБ.Код;			
			КонецЕсли; 
			
			КодИБ=?(ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение,ПрефиксИБ,ЭтотУзел.Код);			
		КонецЕсли;		
		
		Если МетаданныеДокумента.Имя="РекомендованныйОстаток"  Тогда		
			ПрефиксИБ="";			
			КодИБ=ПараметрыСеанса.ЭтотУзел.Код;			
		КонецЕсли;	
		//Мессерле
		//крохин начало 17.12.2017
		//в декабре префикс другой
		//Если МетаданныеДокумента.Имя="ПриходнаяНакладная" И КодИБ="SSP" Тогда
		//крохин начало 02.08.2021
		//Если МетаданныеДокумента.Имя="ПриходнаяНакладная" И (КодИБ="SSP" ИЛИ КодИБ="SST") Тогда
		Если МетаданныеДокумента.Имя="ПриходнаяНакладная" И (КодИБ="SSP" ИЛИ КодИБ="SST" ИЛИ КодИБ="SSV") Тогда
			//крохин конец 02.08.2021
			//крохин конец 17.12.2017	
			ДокументОбъект.УстановитьНовыйНомер(КодИБ+"-0");
		Иначе
			ДокументОбъект.УстановитьНовыйНомер(КодИБ+ДопБуква+"-");
		КонецЕсли;
		//крохин начало 27.10.2014
		//временно, в плане набора кончилась нумерация
		Если МетаданныеДокумента.Имя="ПланНабора" И ПараметрыСеанса.ЭтотУзел.Код = "ODN" И Прав(Год(ТекущаяДата()),2) = "14" Тогда
			ДокументОбъект.УстановитьНовыйНомер("ODR-");	
		КонецЕсли;
		//крохин конец 27.10.2014
		//Кухарь 24.04.17 начало
		//Ещё 1 док
		//ИначеЕсли Вид="УслугиСтороннихОрганизаций" Тогда
		//Кухарь 18.06.17 начало
		//ИначеЕсли Вид="УслугиСтороннихОрганизаций" или Вид="СчетЗаДоставку"  Тогда
	ИначеЕсли Вид="УслугиСтороннихОрганизаций" или Вид="СчетЗаДоставку" или Вид="НоменклатурноеПриложениеКПаллете"  Тогда
		//Кухарь 18.06.17 конец
		//Кухарь 24.04.17 конец
		//Кухарь 23.04.17 начало
		//Усо теперь ещё и в филиалах создают
		//Префикс=ДокументОбъект.Организация.Префикс+"-";
		если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
			Префикс=ДокументОбъект.Организация.Префикс+"-";
		иначе
			Префикс=ПараметрыСеанса.ЭтотУзел.Код+"-";
		КонецЕсли;
		//Кухарь 23.04.17 конец
		
		ДокументОбъект.УстановитьНовыйНомер(Префикс);
	ИначеЕсли Вид="АвансовыйОтчет" Тогда
		Если ДокументОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН Тогда
			Префикс=ДокументОбъект.Организация.Префикс+"-";
		Иначе
			Префикс=ПараметрыСеанса.ЭтотУзел.Код;			
		КонецЕсли;
		
		ДокументОбъект.УстановитьНовыйНомер(Префикс);
	Иначе		
		КодИБ=ПараметрыСеанса.ЭтотУзел.Код;
		
		ДокументОбъект.УстановитьНовыйНомер(КодИБ+"-");		
	КонецЕсли;	
КонецПроцедуры // УстановитьНомерДокумента()

Процедура УстановитьНомерДокумента(ДокументОбъект) Экспорт
	УстановитьНомерДокументаКлиентСервер(ДокументОбъект);	
КонецПроцедуры // УстановитьНомерДокумента()
// Кухарь А.Ю. 15.12.2021 конец

Процедура УстановитьКодСправочника(СправочникОбъект) Экспорт
	
	МетаданныеСправочника= СправочникОбъект.Метаданные();
	
	Если Не ЕстьРеквизитДокумента("ИБ", МетаданныеСправочника) Тогда
		СправочникОбъект.УстановитьНовыйКод(ПолучитьПрефиксНомеров());
	КонецЕсли;
	
КонецПроцедуры // УстановитьНомерДокумента()

Процедура ВыборФайла(Элемент,Расширение="dbf",ПроверятьСуществование=Ложь,ПолныйПуть=Истина) Экспорт
	
	ДиалогФыбораФайла								=	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогФыбораФайла.Фильтр						=	"Файл данных (*."+Расширение+")|*."+Расширение+"";
	ДиалогФыбораФайла.Заголовок						=	"Выберите файл";
	ДиалогФыбораФайла.ПредварительныйПросмотр		=	Ложь;
	ДиалогФыбораФайла.Расширение					=	Расширение;
	ДиалогФыбораФайла.ИндексФильтра					=	0;
	ДиалогФыбораФайла.ПолноеИмяФайла				=	Элемент.Значение;
	ДиалогФыбораФайла.ПроверятьСуществованиеФайла	=	ПроверятьСуществование;
	
	Если ДиалогФыбораФайла.Выбрать() Тогда
		Файл	= Новый Файл(ДиалогФыбораФайла.ПолноеИмяФайла);
		Элемент.Значение = ?(ПолныйПуть,Файл.ПолноеИмя,Файл.Имя);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыборКаталога(Элемент,ПроверятьСуществование=Ложь) Экспорт
	
	ДиалогФыбораФайла								=	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	ДиалогФыбораФайла.Заголовок						=	"Выберите каталог";		
	//ДиалогФыбораФайла.ПолноеИмяФайла				=	Элемент.Значение;
	ДиалогФыбораФайла.ПроверятьСуществованиеФайла	=	ПроверятьСуществование;
	ДиалогФыбораФайла.Каталог						=	Элемент.Значение;
	
	Если ДиалогФыбораФайла.Выбрать() Тогда
		Элемент.Значение = ДиалогФыбораФайла.Каталог+"\";
	КонецЕсли;
	
КонецПроцедуры

//ПОДБОРЫ
Процедура ПодборНоменклатурыПоШК(Форма,Элемент, Текст, Значение, СтандартнаяОбработка,ТипШК=Неопределено) Экспорт
	СписокВыбора=Новый СписокЗначений;
	
	ТекСтрока=СокрЛП(Текст);	
	Если НЕ ПустаяСтрока(ТекСтрока) Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(ШтрихКоды.Владелец.Родитель.Родитель) КАК Брэнд,
		|	ПРЕДСТАВЛЕНИЕ(ШтрихКоды.Владелец.Родитель) КАК Модель,
		|	ПРЕДСТАВЛЕНИЕ(ШтрихКоды.Владелец) КАК НоменклатураПредставление,
		|	ШтрихКоды.Владелец КАК Номенклатура,		
		|	ШтрихКоды.Наименование КАК ШтрихКод
		|ИЗ
		|	Справочник.ШтрихКоды КАК ШтрихКоды
		|ГДЕ
		|	ШтрихКоды.Наименование ПОДОБНО &ШаблонПоиска
		|	И ШтрихКоды.ТипШК=&ТипШК";
		
		Запрос.УстановитьПараметр("ТипШК",?(ТипШК=Неопределено,Перечисления.ТипыШтрихКодов.Штука,ТипШК));
		Запрос.УстановитьПараметр("ШаблонПоиска",СтрЗаменить(ТекСтрока," ","%"));	
		
		
		
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Количество()>50 Тогда
			Предупреждение("Найдено более 50 записей соответствующих шаблону поиска !!!");	
		Иначе
			Пока Выборка.Следующий() Цикл
				СписокВыбора.Добавить(Выборка.Номенклатура,""+Выборка.ШтрихКод+" "+Выборка.Брэнд+" "+Выборка.НоменклатураПредставление+" ");		
			КонецЦикла;
			СписокВыбора.СортироватьПоПредставлению();		
		КонецЕсли;
	КонецЕсли;
	
	СтандартнаяОбработка=Ложь;
	Если СписокВыбора.Количество()=0 Тогда		
		Значение=Неопределено;
	ИначеЕсли СписокВыбора.Количество()=1 Тогда
		Значение=СписокВыбора.Получить(0).Значение;		
	Иначе
		Выбор=Форма.ВыбратьИзСписка(СписокВыбора,Элемент);
		Если Выбор<>Неопределено Тогда			
			Значение=Выбор.Значение;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПодборНоменклатурыПоКоду(Форма,Элемент, Текст, Значение, СтандартнаяОбработка,ТолькоПервые=Ложь) Экспорт
	ОбъектМетаданных=Метаданные.НайтиПоТипу(ТипЗнч(Элемент.Значение));
	СписокВыбора=Новый СписокЗначений;
	
	Если ОбъектМетаданных<>Неопределено И Метаданные.Справочники.Индекс(ОбъектМетаданных)>0 И ОбъектМетаданных.ДлинаНаименования>0 Тогда
		ТекСтрока=СокрЛП(Текст);	
		Пока Найти(ТекСтрока,"  ")<>0 Цикл
			ТекСтрока=СтрЗаменить(ТекСтрока,"  "," ");			
		КонецЦикла;
		
		Если ПустаяСтрока(ТекСтрока) Тогда Возврат КонецЕсли; 
		
		МетаСправочник=Метаданные.НайтиПоТипу(ТипЗнч(Элемент.Значение));
		
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Ссылка,
		|	Наименование,Код";
		
		//Если МетаСправочник.Имя="Номенклатура" Тогда		
		//	Запрос.Текст=Запрос.Текст+",ШтрихКод";			
		//КонецЕсли;
		
		Запрос.Текст=Запрос.Текст+"
		|ИЗ
		|	Справочник."+МетаСправочник.Имя+"
		|ГДЕ
		|	Код ПОДОБНО &ШаблонПоиска";
		
		Если МетаСправочник.Иерархический Тогда			
			Если Элемент.ВыборГруппИЭлементов=ИспользованиеГруппИЭлементов.Группы Тогда
				Запрос.Текст=Запрос.Текст+"
				|	И ЭтоГруппа";
			ИначеЕсли Элемент.ВыборГруппИЭлементов=ИспользованиеГруппИЭлементов.Элементы Тогда
				Запрос.Текст=Запрос.Текст+"
				|	И НЕ ЭтоГруппа";		
			КонецЕсли; 
		КонецЕсли; 
		
		Если МетаСправочник.Владельцы.Содержит(Метаданные.Справочники["ИБ"]) И Форма.ЭлементыФормы.Найти("ИБ")<>Неопределено Тогда
			ТекИБ=Форма.ЭлементыФормы.ИБ.Значение;
			
			Если ТекИБ<>Неопределено И НЕ ТекИБ.Пустая() Тогда
				Запрос.Текст=Запрос.Текст+" И Владелец=&ИБ";			
				Запрос.УстановитьПараметр("ИБ",ТекИБ);			
			КонецЕсли;			
		КонецЕсли;
		
		Запрос.Текст=Запрос.Текст+"
		|Упорядочить ПО Код";
		
		Запрос.УстановитьПараметр("ШаблонПоиска","%"+Формат(Число(Текст), "ЧЦ=6; ЧВН="));	
		
		Выборка=Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл			
			СписокВыбора.Добавить(Выборка.Ссылка,""+Выборка.Код+" "+Выборка.Наименование);					
		КонецЦикла;	
		
		СтандартнаяОбработка=Ложь;
		Если СписокВыбора.Количество()=0 Тогда		
		ИначеЕсли СписокВыбора.Количество()=1 Тогда
			Значение=СписокВыбора.Получить(0).Значение;		
		Иначе
			Выбор=Форма.ВыбратьИзСписка(СписокВыбора,Элемент);
			Если Выбор<>Неопределено Тогда			
				Значение=Выбор.Значение;
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

Процедура ПодборПоФрагментам(Форма,Элемент, Текст, Значение, СтандартнаяОбработка,ТолькоПервые=Истина,Организация=Неопределено) Экспорт
	
	ОбъектМетаданных=Метаданные.НайтиПоТипу(ТипЗнч(Элемент.Значение));
	СписокВыбора=Новый СписокЗначений;
	
	Если ОбъектМетаданных<>Неопределено И Метаданные.Справочники.Индекс(ОбъектМетаданных)>0 И ОбъектМетаданных.ДлинаНаименования>0 Тогда
		ТекСтрока=СокрЛП(Текст);	
		Пока Найти(ТекСтрока,"  ")<>0 Цикл
			ТекСтрока=СтрЗаменить(ТекСтрока,"  "," ");			
		КонецЦикла;
		
		Если ПустаяСтрока(ТекСтрока) Тогда Возврат КонецЕсли; 
		
		МетаСправочник=Метаданные.НайтиПоТипу(ТипЗнч(Элемент.Значение));
		
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Ссылка,
		|	Наименование,
		|	Код";		
		
		Если МетаСправочник.Имя="Контрагенты" Тогда		
			Запрос.Текст=Запрос.Текст+",ИНН,КПП";			
		КонецЕсли;
		
		Запрос.Текст=Запрос.Текст+"
		|ИЗ
		|	Справочник."+МетаСправочник.Имя+"
		|ГДЕ
		|	(Наименование ПОДОБНО &ШаблонПоиска ИЛИ Код ПОДОБНО &ШаблонПоиска"+?(МетаСправочник.Имя="Контрагенты"," ИЛИ ИНН ПОДОБНО &ШаблонПоиска","")+")";
		Если МетаСправочник.Имя="Контрагенты" Тогда		
			Запрос.Текст=Запрос.Текст+" И НЕ ПОДСТРОКА(Наименование,1,2)=""__""";
			//крохин начало
			Запрос.Текст=Запрос.Текст+"
			|	И НЕ ПометкаУдаления";
			//крохин конец
			
		КонецЕсли;
		
		Если МетаСправочник.Иерархический Тогда
			Если Элемент.ВыборГруппИЭлементов=ИспользованиеГруппИЭлементов.Группы Тогда
				Запрос.Текст=Запрос.Текст+"
				|	И ЭтоГруппа";
			ИначеЕсли Элемент.ВыборГруппИЭлементов=ИспользованиеГруппИЭлементов.Элементы Тогда
				Запрос.Текст=Запрос.Текст+"
				|	И НЕ ЭтоГруппа";		
			КонецЕсли; 
		КонецЕсли; 
		
		Если Организация<>Неопределено Тогда
			Запрос.Текст=Запрос.Текст+"
			|	И Организация=&Организация";					
			Запрос.УстановитьПараметр("Организация",Организация);
		КонецЕсли; 
		
		Если МетаСправочник.Владельцы.Содержит(Метаданные.Справочники["ИБ"]) Тогда
			Если (Элемент.ВыборПоВладельцу=Неопределено ИЛИ Элемент.ВыборПоВладельцу.Пустая()) И Форма.ЭлементыФормы.Найти("ИБ")<>Неопределено Тогда
				ТекИБ=Форма.ЭлементыФормы.ИБ.Значение;
			Иначе
				ТекИБ=Элемент.ВыборПоВладельцу;
			КонецЕсли;
			
			Если ТекИБ<>Неопределено И НЕ ТекИБ.Пустая() Тогда
				Запрос.Текст=Запрос.Текст+" И Владелец=&ИБ";			
				Запрос.УстановитьПараметр("ИБ",ТекИБ);			
			КонецЕсли;
		ИначеЕсли МетаСправочник.Владельцы.Количество()>0 И Элемент.ВыборПоВладельцу<>Неопределено Тогда
			Запрос.Текст=Запрос.Текст+" И Владелец=&Владелец";			
			Запрос.УстановитьПараметр("Владелец",Элемент.ВыборПоВладельцу);			
		КонецЕсли;
		
		Запрос.Текст=Запрос.Текст+"
		|Упорядочить ПО Наименование";
		
		Запрос.УстановитьПараметр("ШаблонПоиска",?(ТолькоПервые,"","%")+СтрЗаменить(ТекСтрока," ","%")+"%");	
		
		Выборка=Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл			
			СписокВыбора.Добавить(Выборка.Ссылка,""+Выборка.Наименование+" ("+Выборка.Код+")"+?(МетаСправочник.Имя="Контрагенты"," ИНН\КПП: "+СокрЛП(Выборка.ИНН)+"\"+СокрЛП(Выборка.КПП),""));					
		КонецЦикла;	
		
		СтандартнаяОбработка=Ложь;
		Если СписокВыбора.Количество()=0 Тогда		
		ИначеЕсли СписокВыбора.Количество()=1 Тогда
			Значение=СписокВыбора.Получить(0).Значение;		
		Иначе
			Выбор=Форма.ВыбратьИзСписка(СписокВыбора,Элемент);
			Если Выбор<>Неопределено Тогда			
				Значение=Выбор.Значение;
			КонецЕсли;
		КонецЕсли;
		
		Если Значение=Неопределено И ТипЗнч(Элемент.Значение)<>Тип("Неопределено") Тогда
			Значение=ПустоеЗначениеТипа(ТипЗнч(Элемент.Значение));	
		КонецЕсли;		
	КонецЕсли;	
КонецПроцедуры

Процедура ПодборСтатьиДДСПоФрагментам(Форма,Элемент, Текст, Значение, СтандартнаяОбработка,ТолькоПервые=Истина,ДопФильтр="") Экспорт
	
	ОбъектМетаданных=Метаданные.НайтиПоТипу(ТипЗнч(Элемент.Значение));
	СписокВыбора=Новый СписокЗначений;
	
	Если ОбъектМетаданных<>Неопределено И Метаданные.Справочники.Индекс(ОбъектМетаданных)>0 И ОбъектМетаданных.ДлинаНаименования>0 Тогда
		ТекСтрока=СокрЛП(Текст);	
		Пока Найти(ТекСтрока,"  ")<>0 Цикл
			ТекСтрока=СтрЗаменить(ТекСтрока,"  "," ");			
		КонецЦикла;
		
		Если ПустаяСтрока(ТекСтрока) Тогда Возврат КонецЕсли; 
		
		МетаСправочник=Метаданные.НайтиПоТипу(ТипЗнч(Элемент.Значение));
		
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Ссылка,
		|	Наименование,Код
		|ИЗ
		|	Справочник."+МетаСправочник.Имя+"
		|ГДЕ
		|	(Наименование ПОДОБНО &ШаблонПоиска ИЛИ Код ПОДОБНО &ШаблонПоиска)";
		
		Если МетаСправочник.Иерархический Тогда
			Если Элемент.ВыборГруппИЭлементов=ИспользованиеГруппИЭлементов.Группы Тогда
				Запрос.Текст=Запрос.Текст+"
				|	И ЭтоГруппа";
			ИначеЕсли Элемент.ВыборГруппИЭлементов=ИспользованиеГруппИЭлементов.Элементы Тогда
				Запрос.Текст=Запрос.Текст+"
				|	И НЕ ЭтоГруппа";		
			КонецЕсли; 
		КонецЕсли;
		Если ЗначениеЗаполнено(ДопФильтр) Тогда
			Запрос.Текст=Запрос.Текст+"
			|	И "+ДопФильтр;		
		КонецЕсли; 
		
		Запрос.Текст=Запрос.Текст+"
		|Упорядочить ПО Наименование";
		
		Запрос.УстановитьПараметр("ШаблонПоиска",?(ТолькоПервые,"","%")+СтрЗаменить(ТекСтрока," ","%")+"%");	
		
		Выборка=Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл			
			СписокВыбора.Добавить(Выборка.Ссылка,""+Выборка.Наименование+" ("+Выборка.Код+")");					
		КонецЦикла;	
		
		СтандартнаяОбработка=Ложь;
		Если СписокВыбора.Количество()=0 Тогда		
		ИначеЕсли СписокВыбора.Количество()=1 Тогда
			Значение=СписокВыбора.Получить(0).Значение;		
		Иначе
			Выбор=Форма.ВыбратьИзСписка(СписокВыбора,Элемент);
			Если Выбор<>Неопределено Тогда			
				Значение=Выбор.Значение;
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;	
КонецПроцедуры

Процедура ПодборСчетаПоФрагментам(Форма,Элемент, Текст, Значение, СтандартнаяОбработка,ТолькоПервые=Истина,ДопФильтр="") Экспорт	
	
	ТекСтрока=СокрЛП(Текст);	
	Пока Найти(ТекСтрока,"  ")<>0 Цикл
		ТекСтрока=СтрЗаменить(ТекСтрока,"  "," ");			
	КонецЦикла;	
	
	Если ПустаяСтрока(ТекСтрока) Тогда Возврат КонецЕсли; 
	
	МетаСправочник=Метаданные.НайтиПоТипу(ТипЗнч(Элемент.Значение));
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Ссылка,
	|	Наименование,Код
	|ИЗ
	|	ПланСчетов.Хозрасчетный
	|ГДЕ
	|	(Наименование ПОДОБНО &ШаблонПоиска ИЛИ Код ПОДОБНО &ШаблонПоиска)
	|	И НЕ ЗапретитьИспользоватьВПроводках";
	
	Если ЗначениеЗаполнено(ДопФильтр) Тогда
		Запрос.Текст=Запрос.Текст+"
		|	И "+ДопФильтр;		
	КонецЕсли; 
	
	Запрос.Текст=Запрос.Текст+"
	|Упорядочить ПО Порядок";
	
	Запрос.УстановитьПараметр("ШаблонПоиска",?(ТолькоПервые,"","%")+СтрЗаменить(ТекСтрока," ","%")+"%");	
	
	СписокВыбора=Новый СписокЗначений;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл			
		СписокВыбора.Добавить(Выборка.Ссылка,""+Выборка.Код+" ("+Выборка.Наименование+")");					
	КонецЦикла;	
	
	СтандартнаяОбработка=Ложь;
	Если СписокВыбора.Количество()=0 Тогда		
	ИначеЕсли СписокВыбора.Количество()=1 Тогда
		Значение=СписокВыбора.Получить(0).Значение;		
	Иначе
		Выбор=Форма.ВыбратьИзСписка(СписокВыбора,Элемент);
		Если Выбор<>Неопределено Тогда			
			Значение=Выбор.Значение;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

Процедура ПодборДокаПоФрагментам(Форма,Элемент, Текст, Значение, СтандартнаяОбработка,СписокВидов=Неопределено,Знач Дата1=Неопределено,СписокСкладов=Неопределено) Экспорт
	Дата1=?(Дата1=Неопределено,ТекущаяДата()-3*30*24*60*60,Дата1);
	
	ОбъектМетаданных=Метаданные.НайтиПоТипу(ТипЗнч(Элемент.Значение));
	СписокВыбора	=Новый СписокЗначений;
	
	Если СписокВидов=Неопределено Тогда
		Если ОбъектМетаданных<>Неопределено И Метаданные.Документы.Индекс(ОбъектМетаданных)>0 Тогда
			СписокВидов=Новый Структура;			
			СписокВидов.Вставить(ОбъектМетаданных.Имя);
		КонецЕсли;	
	КонецЕсли;
	
	ТекстЗапроса="";
	Для Каждого Вид Из СписокВидов Цикл
		ТекВид=Вид.Ключ;
		
		Если ТекВид="РасходнаяНакладная" ИЛИ ТекВид="ПриходнаяНакладная" Тогда
			ПолеДопИнфо="Контрагент";	
		ИначеЕсли ТекВид="Перемещение" Тогда
			ПолеДопИнфо="СкладПолучатель";
		Иначе
			ПолеДопИнфо="""""";	
		КонецЕсли;	
		
		ТекстЗапроса=ТекстЗапроса+?(ПустаяСтрока(ТекстЗапроса),""," ОБЪЕДИНИТЬ ВСЕ ")+"
		|ВЫБРАТЬ
		|	Ссылка,
		|	Номер, 
		|	Дата,
		|   "+ПолеДопИнфо+" КАК ДопИнфо
		|ИЗ
		|	Документ."+Вид.Ключ+"
		|ГДЕ
		|	Номер ПОДОБНО &ШаблонПоиска
		|	И Дата>&Дата1 ";
		
		Если ЕстьРеквизитДокумента("Склад",Метаданные.Документы[Вид.Ключ]) И СписокСкладов<>Неопределено Тогда
			ТекстЗапроса=ТекстЗапроса+"
			|	И Склад В (&СписокСкладов)";
		КонецЕсли; 
	КонецЦикла; 	
	
	ТекСтрока=СокрЛП(Текст);	
	Пока Найти(ТекСтрока,"  ")<>0 Цикл
		ТекСтрока=СтрЗаменить(ТекСтрока,"  "," ");			
	КонецЦикла;
	
	Если ПустаяСтрока(ТекСтрока) Тогда Возврат КонецЕсли; 
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Ссылка,
	|	Номер,Дата,ДопИнфо
	|ИЗ
	|("+ТекстЗапроса+") КАК Сводный
	|Упорядочить ПО Номер";
	
	Запрос.УстановитьПараметр("Дата1",Дата1);	
	Запрос.УстановитьПараметр("ШаблонПоиска","%"+СтрЗаменить(ТекСтрока," ","%")+"%");	
	Запрос.УстановитьПараметр("СписокСкладов",СписокСкладов);	
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокВыбора.Добавить(Выборка.Ссылка,""+Выборка.Ссылка.Метаданные()+" "+Выборка.Номер+" "+Формат(Выборка.Дата,"ДФ=dd.MM.yy")+" "+Выборка.ДопИнфо);		
	КонецЦикла;	
	
	СтандартнаяОбработка=Ложь;
	Если СписокВыбора.Количество()=0 Тогда
		Если ОбъектМетаданных<>Неопределено Тогда
			Значение=Документы[ОбъектМетаданных.Имя].ПустаяСсылка();
		Иначе     //хотя такого вообще быть не должно
			Значение=Элемент.Значение;		
		КонецЕсли;		
	ИначеЕсли СписокВыбора.Количество()=1 Тогда
		Значение=СписокВыбора.Получить(0).Значение;		
	Иначе
		Выбор=Форма.ВыбратьИзСписка(СписокВыбора,Элемент);
		Если Выбор<>Неопределено Тогда			
			Значение=Выбор.Значение;
		Иначе
			Значение=Элемент.Значение;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПодборПодразделенияПоФрагментам(Форма,Элемент, Текст, Значение, СтандартнаяОбработка) Экспорт
	СписокВыбора=Новый СписокЗначений;
	
	ТекСтрока=СокрЛП(Текст);	
	Пока Найти(ТекСтрока,"  ")<>0 Цикл
		ТекСтрока=СтрЗаменить(ТекСтрока,"  "," ");			
	КонецЦикла;
	
	Если ПустаяСтрока(ТекСтрока) Тогда Возврат КонецЕсли; 
	
	МетаСправочник=Метаданные.НайтиПоТипу(ТипЗнч(Элемент.Значение));
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Ссылка,
	|	Наименование,Код
	|ИЗ
	|	Справочник.Подразделения
	|ГДЕ
	|	(Наименование ПОДОБНО &ШаблонПоиска ИЛИ Код ПОДОБНО &ШаблонПоискаКода)";
	
	Если МетаСправочник.Иерархический Тогда
		Если Элемент.ВыборГруппИЭлементов=ИспользованиеГруппИЭлементов.Группы Тогда
			Запрос.Текст=Запрос.Текст+" И ЭтоГруппа";
		ИначеЕсли Элемент.ВыборГруппИЭлементов=ИспользованиеГруппИЭлементов.Элементы Тогда			
			Запрос.Текст=Запрос.Текст+" И НЕ ЭтоГруппа";		
		КонецЕсли; 
	КонецЕсли;		
	
	Запрос.Текст=Запрос.Текст+"
	|Упорядочить ПО Наименование";
	
	Запрос.УстановитьПараметр("ШаблонПоиска",		"%"+СтрЗаменить(ТекСтрока," ","%")+"%");	
	Запрос.УстановитьПараметр("ШаблонПоискаКода",	"SSP-%"+СокрЛП(ТекСтрока));	
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл			
		СписокВыбора.Добавить(Выборка.Ссылка,""+Выборка.Наименование+" ("+Выборка.Код+")");					
	КонецЦикла;	
	
	СтандартнаяОбработка=Ложь;
	Если СписокВыбора.Количество()=0 Тогда		
	ИначеЕсли СписокВыбора.Количество()=1 Тогда
		Значение=СписокВыбора.Получить(0).Значение;		
	Иначе
		Выбор=Форма.ВыбратьИзСписка(СписокВыбора,Элемент);
		Если Выбор<>Неопределено Тогда			
			Значение=Выбор.Значение;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

Процедура ПодборДоговораПоФрагментам(Форма,Элемент, Текст, Значение, СтандартнаяОбработка,Контрагент,Организация=Неопределено) Экспорт	
	ОбъектМетаданных=Метаданные.НайтиПоТипу(ТипЗнч(Элемент.Значение));
	СписокВыбора=Новый СписокЗначений;
	
	Если ОбъектМетаданных<>Неопределено И Метаданные.Справочники.Индекс(ОбъектМетаданных)>0 И ОбъектМетаданных.ДлинаНаименования>0 Тогда
		ТекСтрока=СокрЛП(Текст);	
		Пока Найти(ТекСтрока,"  ")<>0 Цикл
			ТекСтрока=СтрЗаменить(ТекСтрока,"  "," ");			
		КонецЦикла;
		
		Если ПустаяСтрока(ТекСтрока) Тогда Возврат КонецЕсли; 
		
		МетаСправочник=Метаданные.НайтиПоТипу(ТипЗнч(Элемент.Значение));
		
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Ссылка,
		|	Наименование,Код
		|ИЗ
		|	Справочник."+МетаСправочник.Имя+"
		|ГДЕ
		|	КодЦБ=&КодЦБ И (Наименование ПОДОБНО &ШаблонПоиска ИЛИ Код ПОДОБНО &ШаблонПоиска)
		|	И НЕ НеИспользовать";
		
		Если МетаСправочник.Иерархический Тогда
			Если Элемент.ВыборГруппИЭлементов=ИспользованиеГруппИЭлементов.Группы Тогда
				Запрос.Текст=Запрос.Текст+"
				|	И ЭтоГруппа";
			ИначеЕсли Элемент.ВыборГруппИЭлементов=ИспользованиеГруппИЭлементов.Элементы Тогда
				Запрос.Текст=Запрос.Текст+"
				|	И НЕ ЭтоГруппа"; 				
			КонецЕсли;
		КонецЕсли;		
		
		Если ЗначениеЗаполнено(Организация) Тогда		
			Запрос.Текст=Запрос.Текст+"
			|	И Организация=&Организация";
		КонецЕсли; 
		
		Запрос.Текст=Запрос.Текст+"
		|Упорядочить ПО Наименование";
		
		Запрос.УстановитьПараметр("ШаблонПоиска",СтрЗаменить(ТекСтрока," ","%")+"%");	
		Запрос.УстановитьПараметр("КодЦБ",?(ЗначениеЗаполнено(Контрагент.КодЦБ),Контрагент.КодЦБ,Контрагент.Код));
		Запрос.УстановитьПараметр("Организация",Организация);	
		
		Выборка=Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл			
			СписокВыбора.Добавить(Выборка.Ссылка,""+Выборка.Наименование+" ("+Выборка.Код+")");					
		КонецЦикла;	
		
		СтандартнаяОбработка=Ложь;
		Если СписокВыбора.Количество()=0 Тогда		
		ИначеЕсли СписокВыбора.Количество()=1 Тогда
			Значение=СписокВыбора.Получить(0).Значение;		
		Иначе
			Выбор=Форма.ВыбратьИзСписка(СписокВыбора,Элемент);
			Если Выбор<>Неопределено Тогда			
				Значение=Выбор.Значение;
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;	
КонецПроцедуры

// ВНЕШНИЕ ПЕЧАТНЫЕ ФОРМЫ
Функция СтрокуВСписок(Строка)
	Список=Новый СписокЗначений;
	
	Пока Не(ПустаяСтрока(Строка)) Цикл
		Поз=Найти(Строка,",");
		Если Поз<>0 Тогда
			Список.Добавить(Лев(Строка,Поз-1));	
			Строка=Сред(Строка,Поз+1);
		Иначе
			Список.Добавить(Строка);	
			Строка="";			
		КонецЕсли; 	    
	КонецЦикла;
	Возврат Список;
КонецФункции


// Кухарь А.Ю. 27.10.2021 начало
// Функция ПолучитьТаблицуПечатныхФорм(ВидОбъекта="",ИмяФайлаОписания="") Экспорт	
Функция ПолучитьТаблицуПечатныхФорм(ВидОбъекта="",ИмяФайлаОписания="",Контрагент=неопределено) Экспорт	 
// Кухарь А.Ю. 27.10.2021 конец
	
	ТПФ=Новый ТаблицаЗначений;
	ТПФ.Колонки.Добавить("ИдКнопки");
	ТПФ.Колонки.Добавить("Наименование");
	
	Части=РазложитьСтрокуВМассивПодстрок(ВидОбъекта,".");
	Если Части.Количество()<>2 Тогда
		Возврат ТПФ;
	КонецЕсли; 
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ВнешниеОтчеты.Код КАК Код,
	             |	ВнешниеОтчеты.Наименование КАК Наименование,
	             |	ВнешниеОтчеты.Ссылка КАК Ссылка
	             |ИЗ
	             |	Справочник.ВнешниеОтчеты КАК ВнешниеОтчеты
	             |ГДЕ
	             |	ВнешниеОтчеты.ВидОбработки = ""Печать""
	             |	И ПОДСТРОКА(ВнешниеОтчеты.ТипОбъекта, 1, 1000) = &ТипОбъекта
	             |	И ВнешниеОтчеты.ВидДокумента = &ВидДокумента
	             |	И НЕ ВнешниеОтчеты.ЭтоГруппа
	             |	И НЕ ВнешниеОтчеты.ПометкаУдаления
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ВнешниеОтчеты.Наименование";
	
	Запрос.УстановитьПараметр("ТипОбъекта",		Части[0]);
	Запрос.УстановитьПараметр("ВидДокумента",	Части[1]);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		// Андреев И.Д. 27.10.2021 начало
		// Не выводит печатные формы, при условиях:	
		//Если ЗначениеЗаполнено(Контрагент) и Выборка.Ссылка.Контрагенты.количество()>0 тогда
		//	если Выборка.Ссылка.Контрагенты.Найти(Контрагент)=неопределено тогда
		//		продолжить
		//	конецесли;
		//КонецЕсли;	
		// Андреев И.Д. 27.10.2021 конец
			
		СтрокаТПФ				=ТПФ.Добавить();
		СтрокаТПФ.ИдКнопки		="_"+Формат(Выборка.Код,"ЧГ=0");
		СтрокаТПФ.Наименование  = Выборка.Наименование;
	КонецЦикла;
	
	Возврат ТПФ;
КонецФункции //ПолучитьТаблицуПечатныхФорм(ВидОбъекта="",ИмяФайлаОписания="") Экспорт

// Кухарь А.Ю. 27.10.2021 начало
//Процедура НастроитьПодменюПечати(Форма,ТипОбъекта=Неопределено,ВидОбъекта=Неопределено) Экспорт
Процедура НастроитьПодменюПечати(Форма,ТипОбъекта=Неопределено,ВидОбъекта=Неопределено,Контрагент=неопределено) Экспорт 
// Кухарь А.Ю. 27.10.2021 конец


	
	Тип=?(ТипОбъекта=Неопределено,ТипОбъекта(Форма.Ссылка),ТипОбъекта);
	Вид=?(ВидОбъекта=Неопределено,Форма.Метаданные().Имя,ВидОбъекта);
	
	// Андреев И.Д. 27.10.2021 начало
	// проверка на контрагента на форме
	//если Контрагент=неопределено тогда
	//	если форма.элементыформы.найти("Контрагент")<>Неопределено тогда
	//		Контрагент = форма.контрагент;
	//	иначе
	//		Контрагент = неопределено;
	//	КонецЕсли;				
	//конецесли;
	контрагент =Неопределено;
	// Андреев И.Д. 27.10.2021 конец

	
	
	ПодменюПечати	=Форма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПодменюПечати;	
	ПодменюПечати.Кнопки.Очистить();
	
	ИмяПечатнойФормы=ВосстановитьЗначение(Тип+"."+Вид+"ИмяПечатнойФормы");	
	ИдКнопкиПоУмолчанию=Неопределено;
	
	СтрокаТПФПоУмолчанию=Неопределено;
		
	// Андреев И.Д. 27.10.2021 начало
	//  + контрагент
	//ТПФ		=ПолучитьТаблицуПечатныхФорм(Тип+"."+Вид);
	ТПФ		=ПолучитьТаблицуПечатныхФорм(Тип+"."+Вид,,Контрагент);
	// Андреев И.Д. 27.10.2021 конец

	Для Каждого СтрокаТПФ Из ТПФ Цикл
		Кнопка=ПодменюПечати.Кнопки.Добавить(СтрокаТПФ.ИДКнопки,ТипКнопкиКоманднойПанели.Действие,СтрокаТПФ.Наименование,Новый Действие("Печать"));
		Кнопка.Пояснение=СтрокаТПФ.ИДКнопки;
		Если СтрокаТПФ.Наименование=ИмяПечатнойФормы Тогда
			СтрокаТПФПоУмолчанию=СтрокаТПФ;			
		КонецЕсли;		
	КонецЦикла;
	
	
	
	
	
	
	
	
	
	КнопкаПоУмолчанию=Форма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПечатьПоУмолчанию;	
	
	Если ТПФ.Количество()=0 Тогда
		КнопкаПоУмолчанию.Доступность=Ложь;
	Иначе
		КнопкаПоУмолчанию.Доступность=Истина;		
		
		Если СтрокаТПФПоУмолчанию=Неопределено Тогда
			СтрокаТПФПоУмолчанию=ТПФ[0];
		КонецЕсли;
		
		КнопкаПоУмолчанию.Текст		=СтрокаТПФПоУмолчанию.Наименование;			
		КнопкаПоУмолчанию.Пояснение	=СтрокаТПФПоУмолчанию.ИдКнопки;
	КонецЕсли;	
КонецПроцедуры

Процедура ВнешняяПечать(Форма,Объект,Элемент,ДопПараметры=Неопределено) Экспорт
	Тип				=ТипОбъекта(Объект);
	ВидОбъекта		=Тип+"."+Объект.Метаданные().Имя;
	
	КодОбработки=Число(Сред(Элемент.Пояснение,2));
	ЭлементОбработки=Справочники.ВнешниеОтчеты.НайтиПоКоду(КодОбработки);	
	
	Обработка=ПолучитьОбработкуПоЭлементу(ЭлементОбработки,КодОбработки);	
	Если Обработка=Неопределено Тогда Возврат КонецЕсли; 
	
	КнопкаПоУмолчанию=Форма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПечатьПоУмолчанию;
	
	КнопкаПоУмолчанию.Текст	=ЭлементОбработки.Наименование;
	КнопкаПоУмолчанию.Пояснение="_"+Формат(ЭлементОбработки.Код,"ЧГ=0");
	
	ОбработкаПечати=Обработка.ПолучитьФорму(ЭлементОбработки.ИмяФормы);
	ОбработкаПечати.Печать(Объект,ДопПараметры);			
	
	СохранитьЗначение(ВидОбъекта+"ИмяПечатнойФормы",КнопкаПоУмолчанию.Текст);	
КонецПроцедуры


Функция ПолучитьПолучателяДокумента(Документ) Экспорт
	МетаДок=Документ.Метаданные();
	
	Если ЕстьРеквизитДокумента("ПунктДоставки",МетаДок) И НЕ Документ.ПунктДоставки.Пустая() Тогда
		Возврат Документ.ПунктДоставки;		
	КонецЕсли;
	
	Если ЕстьРеквизитДокумента("Контрагент",МетаДок) И НЕ Документ.Контрагент.Пустая()  Тогда
		Возврат Документ.Контрагент;				
	КонецЕсли;
	
	Если ЕстьРеквизитДокумента("СкладПолучатель",МетаДок) И НЕ Документ.СкладПолучатель.Пустая() Тогда
		Возврат Документ.СкладПолучатель;		
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции //ПолучитьПолучателяДокумента(Документ)


Функция ПолучитьНаборПечФормДокумента(Документ) Экспорт
	Если Документ=Неопределено Тогда
		Возврат Справочники.НаборыПечатныхФорм.Стандарт
	КонецЕсли; 
	
	МетаДок=Документ.Метаданные();
	ВидДокумента=Документ.Метаданные().Имя;
	
	Если ЕстьРеквизитДокумента("ПунктДоставки",МетаДок) И ЗначениеЗаполнено(Документ.ПунктДоставки.НаборПечатныхФорм) Тогда
		Возврат Документ.ПунктДоставки.НаборПечатныхФорм;
	КонецЕсли;
	
	Если ЕстьРеквизитДокумента("Контрагент",МетаДок) Тогда
		НаборПечФорм=ПолучитьРеквизитРодителя(Документ.Контрагент,"НаборПечатныхФорм");
		Если НЕ НаборПечФорм.Пустая() Тогда
			Возврат НаборПечФорм;		
		КонецЕсли; 
	КонецЕсли;
	
	Если ЕстьРеквизитДокумента("СкладПолучатель",МетаДок) Тогда
		НаборПечФорм=ПолучитьРеквизитРодителя(Документ.СкладПолучатель,"НаборПечатныхФорм");
		Если НЕ НаборПечФорм.Пустая() Тогда
			Возврат НаборПечФорм;		
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Справочники.НаборыПечатныхФорм.Стандарт;
КонецФункции //ПолучитьНаборПечФормДокумента(Документ) 

//Кухарь 20.11.17 начало
//Процедура ПакетнаяПечать(ТекДок) Экспорт
Процедура ПакетнаяПечать(ТекДок,ЭтоМассоваяПечать=ложь) Экспорт
//Кухарь 20.11.17 конец	

	Если ТекДок<>Неопределено и НЕ(ТекДок.Пустая()) Тогда		
		Обработка=ПолучитьВнешнююОбработку("ПакетнаяПечать.epf","PrnForms\");
		Если Обработка=Неопределено Тогда Возврат КонецЕсли; 
		
		ФормаОбработки=Обработка.ПолучитьФорму();		
		ФормаОбработки.ТекДок		=ТекДок;
		
		//Кухарь 20.11.17 начало
		//Массовая печать
		ФормаОбработки.ЭтоМассоваяПечать=ЭтоМассоваяПечать;
		//Кухарь 20.11.17 конец	
		
		ФормаОбработки.НаборФорм	=ПолучитьНаборПечФормДокумента(ТекДок);			
		
		ФормаОбработки.ЗакрытьПослеПечати	=Истина;
		ФормаОбработки.СразуНаПринтер		=Истина;
		
		ФормаОбработки.Открыть();
	КонецЕсли;	
КонецПроцедуры


Функция ПолучитьСписокКодовПоставщика(Знач ВыбКонтрагент) Экспорт	    
	СВ=Новый СписокЗначений;
	
	Выборка=Справочники.КодыПоставщиков.Выбрать(,ВыбКонтрагент);
	Если НЕ Выборка.Следующий() Тогда
		Если НЕ ВыбКонтрагент.Родитель.Пустая() Тогда
			Возврат ПолучитьСписокКодовПоставщика(ВыбКонтрагент.Родитель);			
		КонецЕсли;	    
	Иначе 
		Выборка=Справочники.КодыПоставщиков.Выбрать(,ВыбКонтрагент);
		Пока Выборка.Следующий() Цикл
			СВ.Добавить(Выборка.Ссылка,""+Выборка.Наименование+", исп. для фирмы: "+Выборка.Организация+", прим.: "+Выборка.Примечание);
		КонецЦикла;		
	КонецЕсли;	
	
	Возврат СВ;
КонецФункции //ПолучитьСписокКодовПоставщика(Знач ВыбКонтрагент)

//РАБОТА С ВНЕШНИМИ ОБРАБОТКАМИ

//	ищет внешнюю обработку, если нет внешней пытается найти встроенную, 
//	если и ее нет возвращает "Неопределено"
Функция ПолучитьВнешнююОбработку(ИмяФайла,ПодКаталог="") Экспорт
	Обработка		= Неопределено;
	ИмяОбработки	= СтрЗаменить(ИмяФайла,".epf","");
	ПолноеИмяФайла  = Константы.КаталогВнешнихОтчетов.Получить()+ПодКаталог+ИмяФайла;
	
	Файл=Новый Файл(ПолноеИмяФайла);
	Если Файл.Существует() Тогда
		Обработка=ВнешниеОбработки.Создать(ПолноеИмяФайла);	
	ИначеЕсли Метаданные.Обработки.Найти(ИмяОбработки)<>Неопределено Тогда
		Обработка=Обработки[ИмяОбработки].Создать();
	ИначеЕсли Метаданные.Отчеты.Найти(ИмяОбработки)<>Неопределено Тогда
		Обработка=Отчеты[ИмяОбработки].Создать();	
	КонецЕсли; 
	
	Возврат Обработка;
КонецФункции // ПолучитьВнешнююОбработку(ИмяФайла,ПодКаталог="")



Процедура НастроитьПодменюКодовОпераций(Форма,ДопустимыеКоды) Экспорт
	Вид			=Форма.Ссылка.Метаданные().Имя;
	Подменю		=Форма.ЭлементыФормы.ДействияФормы.Кнопки.ПодменюКодовОпераций;
	Действие	=Новый Действие("ДействияФормыВыборКодаОперации");
	МетаЗначения=Метаданные.Перечисления.КодыОперацийОстатки.ЗначенияПеречисления;
	
	Для Каждого ТекКодОперации Из ДопустимыеКоды Цикл
		МетаКодОперации=МетаЗначениеПеречисления(ТекКодОперации.Значение); 
		Подменю.Кнопки.Добавить(МетаКодОперации.Имя, ТипКнопкиКоманднойПанели.Действие,МетаКодОперации.Синоним,Действие);
	КонецЦикла;		
	
	Подменю.Текст=""+Форма.КодОперации;
КонецПроцедуры 

//ПОДМЕНЮ ЗАПОЛНИТЬ,ПОДБОР
Функция ПолучитьТаблицуОбработокМодификации(Тип,Вид,ИмяТЧ,ВидОбработки)
	ТО=Новый ТаблицаЗначений;	
	
	ТО.Колонки.Добавить("ИдКнопки");
	ТО.Колонки.Добавить("ИмяКнопки");
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ 
	|	Код,Наименование
	|ИЗ
	|	Справочник.ВнешниеОтчеты
	|ГДЕ
	|	ВидДокумента	=&Вид
	|	И ИмяТЧ			=&ИмяТЧ
	|	И ВидОбработки	=&ВидОбработки
	|	И Не ЭтоГруппа	
	|	И Не ПометкаУдаления
	|";
	
	Запрос.УстановитьПараметр("Вид",			Вид);
	Запрос.УстановитьПараметр("ИмяТЧ",			ИмяТЧ);
	Запрос.УстановитьПараметр("ВидОбработки",	ВидОбработки);
	
	Выборка  = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТО=ТО.Добавить();
		
		СтрокаТО.ИдКнопки	="_"+Формат(Выборка.Код,"ЧГ=0");
		СтрокаТО.ИмяКнопки	=Выборка.Наименование;		
	КонецЦикла;
	
	Возврат ТО;
КонецФункции //ПолучитьТаблицуОбработокМодификации(Тип,Вид,ИмяТЧ,ВидОбработки)

Процедура НастроитьПодменю(Форма,ИмяТЧ,ВидОбработки,ИмяПроцедурыОбработчика="")
	Сч=0;	
	
	Тип						=ТипОбъекта(Форма.ЭтотОбъект);
	Вид						=Форма.Метаданные().Имя;
	КоманднаяПанель 		=Форма.ЭлементыФормы["кп"+ИмяТЧ];
	
	КнопкаПоУмолчанию		=КоманднаяПанель.Кнопки.Найти(ВидОбработки+"ПоУмолчанию");
	
	ОбработкиМодификации	=ПолучитьТаблицуОбработокМодификации(Тип,Вид,ИмяТЧ,ВидОбработки);
	
	ИмяОбработки			=ВосстановитьЗначение(Тип+"_"+Вид+"_Обработка_"+ВидОбработки);
	УстановилиПоУмолчанию	=Ложь;
	
	Подменю			=КоманднаяПанель.Кнопки["Подменю"+ВидОбработки];		
	Если ПустаяСтрока(ИмяПроцедурыОбработчика) Тогда
		ДействиеПоКнопке=Новый Действие("ОбработкаОткрытия"+ВидОбработки);
	Иначе
		ДействиеПоКнопке=Новый Действие(ИмяПроцедурыОбработчика);
	КонецЕсли;	
	
	Для Каждого СтрокаОМ Из ОбработкиМодификации Цикл
		Кнопка=Подменю.Кнопки.Добавить(СтрокаОМ.ИдКнопки,ТипКнопкиКоманднойПанели.Действие,СтрокаОМ.ИмяКнопки,ДействиеПоКнопке);					
		Кнопка.Пояснение		=СтрокаОМ.ИдКнопки;
		Кнопка.ИзменяетДанные   =Истина;
		
		Если КнопкаПоУмолчанию<>Неопределено И ИмяОбработки=СтрокаОМ.ИдКнопки Тогда
			//	КнопкаПоУмолчанию.Имя		=СтрокаОМ.ИдКнопки;
			
			КнопкаПоУмолчанию.Текст    	=СтрокаОМ.ИмяКнопки;
			КнопкаПоУмолчанию.Пояснение =СтрокаОМ.ИдКнопки;			
			
			УстановилиПоУмолчанию=Истина;
		КонецЕсли; 
	КонецЦикла; 
	
	Если КнопкаПоУмолчанию<>Неопределено Тогда
		Если УстановилиПоУмолчанию=Ложь И ОбработкиМодификации.Количество()>0 Тогда		
			КнопкаПоУмолчанию.Текст    	=ОбработкиМодификации[0].ИмяКнопки;
			КнопкаПоУмолчанию.Пояснение =ОбработкиМодификации[0].ИдКнопки;						
		КонецЕсли;
		
		Если ОбработкиМодификации.Количество()=0 Тогда
			КнопкаПоУмолчанию.Доступность=Ложь;		
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

Процедура НастроитьПодменюЗаполнить(Форма,ИмяТЧ="Товары",ИмяПроцедурыОбработчика="") Экспорт
	НастроитьПодменю(Форма,ИмяТЧ,"Заполнить",ИмяПроцедурыОбработчика)	
КонецПроцедуры

Процедура НастроитьПодменюПодбор(Форма,ИмяТЧ="Товары",ИмяПроцедурыОбработчика="") Экспорт
	НастроитьПодменю(Форма,ИмяТЧ,"Подбор",ИмяПроцедурыОбработчика)
КонецПроцедуры

Функция РазобратьСтрокуПоРазделителям(Знач Строка,Разделитель)
	Части=Новый Массив;
	
	Поз=Найти(Строка,Разделитель);
	Пока Поз<>0 Цикл
		Части.Добавить(Лев(Строка,Поз-1));			
		
		Строка=Сред(Строка,Поз+1);	
		Поз=Найти(Строка,Разделитель);
	КонецЦикла; 
	
	Если СтрДлина(Строка)<>0 Тогда
		Части.Добавить(Строка);	
	КонецЕсли; 
	
	Возврат Части;
КонецФункции // РазобратьСтрокуПоРазделителям()

Процедура УстановитьКнопкуПоУмолчанию(Форма,Элемент)
	КодОбработки=Число(Сред(Элемент.Пояснение,2));
	ЭлементОбработки=Справочники.ВнешниеОтчеты.НайтиПоКоду(КодОбработки);
	
	Если Найти(Элемент.Имя,"ПоУмолчанию")=0 Тогда		
		ВидОбработки=ЭлементОбработки.ВидОбработки;
		
		КоманднаяПанель		=Форма.ЭлементыФормы["кп"+ЭлементОбработки.ИмяТЧ];
		КнопкаПоУмолчанию   =КоманднаяПанель.Кнопки[ВидОбработки+"ПоУмолчанию"];
		
		КнопкаПоУмолчанию.Текст		=Элемент.Текст;
		КнопкаПоУмолчанию.Пояснение	=Элемент.Пояснение;		
		
		Тип=ТипОбъекта(Форма.ЭтотОбъект);
		Вид=Форма.Метаданные().Имя;
		
		СохранитьЗначение(Тип+"_"+Вид+"_Обработка_"+ВидОбработки,Элемент.Пояснение);
	КонецЕсли; 
КонецПроцедуры

Функция ПолучитьОбработкуПоЭлементу(ЭлементОбработки,КодОбработки)
	Если ЭлементОбработки.Пустая() Тогда
		Сообщить("Не найден элемент справочника ""Внешние обработки"" с кодом: "+КодОбработки,СтатусСообщения.Важное);	
		Возврат Неопределено;
	КонецЕсли;
	
	//Кухарь 13.12.19 начало
	//Для анализа использования
	ЗаписатьДатуИспользованияВнешнегоОтчёта (ЭлементОбработки);
	//Кухарь 13.12.19 конец
	
	
	ИмяОбработки=ЭлементОбработки.ИмяФайла;
	
	Внешняя=Ложь;
	Если Лев(ИмяОбработки,3)="ВН_" Тогда
		ИмяОбработки=Сред(ИмяОбработки,4);	
		Внешняя=Истина;
	КонецЕсли; 
	
	Обработка=Неопределено;
	
	Если Внешняя Тогда
		Если ЭлементОбработки.ВидОбработки="Печать" Тогда
			ДопКаталог="PrnForms\";			
		ИначеЕсли ЭлементОбработки.ВидОбработки="Заполнить" Тогда
			ДопКаталог="FillForms\";						
		ИначеЕсли ЭлементОбработки.ВидОбработки="Подбор" Тогда
			ДопКаталог="SelForms\";									
		Иначе
			ДопКаталог="";		
		КонецЕсли; 
		
		ИмяФайлаОбработки	=Константы.КаталогВнешнихОтчетов.Получить()+ДопКаталог+ИмяОбработки+".epf";	
		ФайлОбработки		=Новый Файл(ИмяФайлаОбработки);
		Если ФайлОбработки.Существует() Тогда
			Возврат ВнешниеОбработки.Создать(ИмяФайлаОбработки);				
		КонецЕсли;
	Иначе
		Если Метаданные.Обработки.Найти(ИмяОбработки)<>Неопределено Тогда
			Возврат Обработки[ИмяОбработки].Создать();	
		КонецЕсли;
	КонецЕсли;	
	
	Предупреждение("Обработка: """+ИмяОбработки+""" не обнаружена !");
	Возврат Неопределено;	
КонецФункции  

Процедура ЗаполнитьТЧ(Форма,Элемент) Экспорт		
	Попытка
		КодОбработки=Число(Сред(Элемент.Пояснение,2));	
	Исключение
		Возврат;
	КонецПопытки;	
	
	ЭлементОбработки=Справочники.ВнешниеОтчеты.НайтиПоКоду(КодОбработки);
	
	Обработка=ПолучитьОбработкуПоЭлементу(ЭлементОбработки,КодОбработки);	
	Если Обработка=Неопределено Тогда Возврат КонецЕсли; 
	
	УстановитьКнопкуПоУмолчанию(Форма,Элемент);
	
	ИмяФормы=?(ПустаяСтрока(ЭлементОбработки.ИмяФормы),Неопределено,ЭлементОбработки.ИмяФормы);
	
	Форма.Модифицированность = Ложь;
	
	Обработка.ДокОбъект	=Форма.ЭтотОбъект;
	ФормаОбработки		=Обработка.ПолучитьФорму(ИмяФормы,Форма,"Ключ");
	ФормаОбработки.Открыть();
КонецПроцедуры

Процедура ОткрытьПодборТЧ(Форма,Элемент,ИмяТЧ="Товары",КолонкаПодбора="Номенклатура",ДопПараметры=Неопределено) Экспорт
	КодОбработки=Число(Сред(Элемент.Пояснение,2));
	ЭлементОбработки=Справочники.ВнешниеОтчеты.НайтиПоКоду(КодОбработки);	
	
	Обработка=ПолучитьОбработкуПоЭлементу(ЭлементОбработки,КодОбработки);	
	Если Обработка=Неопределено Тогда Возврат КонецЕсли; 
	
	УстановитьКнопкуПоУмолчанию(Форма,Элемент);
	
	ТекСтрока=Форма.ЭлементыФормы[ИмяТЧ].ТекущаяСтрока;
	НачальноеЗначениеВыбора=?(ТекСтрока<>Неопределено,ТекСтрока[КолонкаПодбора],Неопределено);	
	
	ИмяФормы=?(ПустаяСтрока(ЭлементОбработки.ИмяФормы),Неопределено,ЭлементОбработки.ИмяФормы);
	
	ФормаОбработки						=Обработка.ПолучитьФорму(ИмяФормы,Форма.ЭлементыФормы[ИмяТЧ],"Ключ");
	ФормаОбработки.Объект				=Форма.ЭтотОбъект;
	ФормаОбработки.РежимВыбора			=Истина;
	ФормаОбработки.НачальноеЗначениеВыбора=НачальноеЗначениеВыбора;
	ФормаОбработки.ЗакрыватьПриВыборе	=Ложь;	
	
	Попытка	
		ФормаОбработки.Параметры=ДопПараметры;
	Исключение	
	КонецПопытки;
	
	ФормаОбработки.Открыть();
КонецПроцедуры

// ЗАКЛАДКИ ПО СКЛАДАМ
Процедура УтановитьОтборПоСкладу(Форма) Экспорт
	ТекСклад=Форма.ЭлементыФормы.ПанельОтбораПоСкладам.ТекущаяСтраница.Значение;
	Если ТекСклад<>Неопределено Тогда
		Форма.ЭлементыФормы.Товары.ОтборСтрок["Склад"].Установить(ТекСклад);
	Иначе
		Форма.ЭлементыФормы.Товары.ОтборСтрок.Сбросить();
	КонецЕсли;
КонецПроцедуры 

Процедура ПерерисовкаЗакладокОтбора(Форма) Экспорт
	ПанельОтбора	=Форма.ЭлементыФормы.ПанельОтбораПоСкладам;
	Если Форма.ЭлементыФормы.Товары.ТекущаяСтрока=Неопределено Тогда
		ТекущийОтбор	=ПанельОтбора.ТекущаяСтраница.Значение;		
	Иначе		
		ТекущийОтбор	=Форма.ЭлементыФормы.Товары.ТекущаяСтрока.Склад;
	КонецЕсли;
	
	Пока ПанельОтбора.Страницы.Количество()>1 Цикл
		ПанельОтбора.Страницы.Удалить(1);		
	КонецЦикла; 
	
	Список=Новый СписокЗначений;	
	Склады=Форма.Товары.ВыгрузитьКолонку("Склад");
	Для Каждого Склад Из Склады Цикл
		Если Список.НайтиПоЗначению(Склад)=Неопределено Тогда
			Список.Добавить(Склад);			
			Страница=ПанельОтбора.Страницы.Добавить(""+Склад.Код,""+Склад,Склад);			
			Если ТекущийОтбор=Склад Тогда
				ПанельОтбора.ТекущаяСтраница=Страница;
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;	
	
	УтановитьОтборПоСкладу(Форма);
КонецПроцедуры 

//ВЫБОР НОМЕНКЛАТУРЫ
Процедура НачалоВыбораНоменклатуры(Элемент, СтандартнаяОбработка) Экспорт
	Если ПолучитьЗначениеПоУмолчанию("ВыборНоменклатурыПо77") Тогда
		СтандартнаяОбработка=Ложь;
		
		Форма=Справочники.Номенклатура.ПолучитьФормуСписка("ФормаСписка77",Элемент,"Подбор");
		Форма.РежимВыбора=Истина;
		Форма.НачальноеЗначениеВыбора=Элемент.Значение;
		Форма.Открыть();		
	КонецЕсли;	
КонецПроцедуры

Процедура ПоказатьСФ(Форма,РНК) Экспорт	
	СФ=СчетФактураНакладной(РНК);
	
	ФормаСФ=Неопределено;
	
	Если СФ.Пустая() Тогда
		Если РНК.ПометкаУдаления Тогда
			Предупреждение("СФ не обнаружена ! Невозможно выписать СФ на удаленную накладную !");
		ИначеЕсли РНК.СостояниеЗаказа=Перечисления.СостояниеЗаказа.РаспечатанИОтгружен Тогда
			Предупреждение("СФ не обнаружена ! Накладная была отгружена без СФ !");			
		ИначеЕсли РНК.Контрагент.СводныеСФ Тогда
			Предупреждение("Для контрагента: """+РНК.Контрагент+""" можно выписывать только сводные СФ !");
		Иначе
			ОбъектСФ=Документы.СчетФактура.СоздатьДокумент();				
			ОбъектСФ.Заполнить(РНК);
			ФормаСФ=ОбъектСФ.ПолучитьФорму("ФормаДокумента",Форма,"СФ"+РНК);			
		КонецЕсли;		
	Иначе
		Если СФ.ПометкаУдаления Тогда
			Предупреждение("Найденная СФ помечена на удаление !");
		КонецЕсли;		
		ФормаСФ=СФ.ПолучитьФорму("ФормаДокумента",Форма,"СФ"+РНК.Ссылка);
	КонецЕсли;
	
	Если ФормаСФ<>Неопределено Тогда
		ФормаСФ.Открыть();
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьДоговорыКорагента(Контрагент,Организация=Неопределено)
	МассивДоговоров=Новый Массив;
	
	КодЦБ=?(ПустаяСтрока(Контрагент.КодЦБ),Контрагент.Код,Контрагент.КодЦБ);
	
	Выборка=Справочники.Договоры.Выбрать(,,Новый Структура("КодЦБ",КодЦБ));
	Пока Выборка.Следующий() Цикл
		//Если задана организация то договора с другой организацией пропускаем
		//	Если Организация<>Неопределено И НЕ Организация.Пустая() И Выборка.Организация<>Организация Тогда Продолжить КонецЕсли; 	
		
		
		МассивДоговоров.Добавить(Выборка.Ссылка);
	КонецЦикла; 
	
	Возврат МассивДоговоров;
КонецФункции // ПолучитьДОговорыКорагента()

Процедура ВыбратьДоговор(Контрагент,Элемент,СтандартнаяОбработка,Организация=Неопределено) Экспорт
	СтандартнаяОбработка=Ложь;	
	
	Форма=Справочники.Договоры.ПолучитьФормуВыбора("ФормаВыбора",Элемент);
	Форма.ПараметрОтборПоВладельцу=Контрагент;
	Форма.Организация=Организация;
	
	Форма.Открыть();
КонецПроцедуры

Процедура ВыбратьДопЗначениеСубконто(Элемент,СтандартнаяОбработка,Организация=Неопределено) Экспорт
	СтандартнаяОбработка=Ложь;	
	
	Форма=Справочники.ДопЗначенияСубконто.ПолучитьФормуВыбора("ФормаВыбора",Элемент);
	Форма.ПараметрОтборПоВладельцу=Элемент.ВыборПоВладельцу;
	Форма.Организация=Организация;
	
	Форма.Открыть();
КонецПроцедуры

Процедура УстановитьДоговор(ДокументОбъект,ИмяРеквизитаКонтрагент="Контрагент",ИмяРеквизитаДоговор="Договор") Экспорт
	Контрагент	=ДокументОбъект[ИмяРеквизитаКонтрагент];
	Договор		=ДокументОбъект[ИмяРеквизитаДоговор];
	Организация	=ДокументОбъект.Организация;
	
	КодЦБ=?(ПустаяСтрока(Контрагент.КодЦБ),Контрагент.Код,Контрагент.КодЦБ);
	
	//По просьбе Ярослава, задача № 0000000468 
	//Если НЕ(Договор.Пустая()) Тогда
	//	Если СокрЛП(Договор.КодЦБ)=СокрЛП(КодЦБ) Тогда
	//		Возврат;
	//	КонецЕсли; 		
	//КонецЕсли;
	
	ДокументОбъект[ИмяРеквизитаДоговор]=Неопределено;
	
	Если Контрагент.Пустая() Тогда Возврат КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Контрагент.ОсновнойДоговор) Тогда
		Договора=ПолучитьДоговорыКорагента(Контрагент,Организация);
	Иначе
		Договора=Новый Массив;	
		Договора.Добавить(Контрагент.ОсновнойДоговор);
	КонецЕсли;	
	
	//Нечаева// 
	
	Если Договора.ВГраница()<0 Тогда
		Предупреждение("Невозможно определить договор контрагента !");
	ИначеЕсли Договора.ВГраница()=0 Тогда
		ДокументОбъект[ИмяРеквизитаДоговор]=Договора[0];			
	Иначе
		Предупреждение("У контрагента: """+Контрагент+""" заключено несколько договоров с организацией """+Организация+""" !"+Символы.ПС+
		"Основной договор для данного контрагента не указан !"+Символы.ПС+
		"Требуется вручную выбрать необходимый договор !");	
	КонецЕсли;	
КонецПроцедуры

Процедура УстановитьПунктДоставки(ДокументОбъект,ИмяРеквизитаКонтрагент="Контрагент",ИмяРеквизитаПД="ПунктДоставки") Экспорт	
	Контрагент		=ДокументОбъект[ИмяРеквизитаКонтрагент];
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Если ЕстьРеквизитДокумента("ОсновнойПунктДоставки",Контрагент.Метаданные()) И ЗначениеЗаполнено(Контрагент.ОсновнойПунктДоставки) Тогда
			ДокументОбъект[ИмяРеквизитаПД]=Контрагент.ОсновнойПунктДоставки;	
		ИначеЕсли КоличествоПД(Контрагент)=1 Тогда		
			Выборка=Справочники.ПунктыДоставки.Выбрать(,Контрагент);
			Пока Выборка.Следующий() Цикл
				ДокументОбъект[ИмяРеквизитаПД]=Выборка.Ссылка;			
			КонецЦикла;
			//крохин начало
			//для складов, если несколько ПД, выбираем первый
		ИначеЕсли ИмяРеквизитаКонтрагент = "СкладПолучатель" Тогда
			//крохин начало 28.07.2011
			//выбираем первый по наименованию
			//Выборка=Справочники.ПунктыДоставки.Выбрать(,Контрагент);
			Выборка=Справочники.ПунктыДоставки.Выбрать(,Контрагент,,"Наименование Убыв");
			//крохин конец 28.07.2011
			Пока Выборка.Следующий() Цикл
				ДокументОбъект[ИмяРеквизитаПД]=Выборка.Ссылка;			
			КонецЦикла;
			//крохин конец
		Иначе
			ДокументОбъект[ИмяРеквизитаПД]=Неопределено;		
		КонецЕсли;		
	Иначе
		ДокументОбъект[ИмяРеквизитаПД]=Неопределено;		
	КонецЕсли;	
КонецПроцедуры//УстановитьПунктДоставки(ДокументОбъект,ИмяРеквизитаКонтрагент="Контрагент")

Процедура НачалоВыбораДоговора(ДокументОбъект, ФормаДокумента, ЭлементФормы, Контрагент, Договор,СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	// В качестве владельца формы выбора устанавливаем данный элемент формы, чтобы выбранное
	// значение было присвоено стандартно.
	ФормаВыбора = Справочники.Договоры.ПолучитьФормуВыбора(,ЭлементФормы,);
	
	// Владельца менять по умолчанию не даем.
	ФормаВыбора.ПараметрОтборПоВладельцу = Контрагент;
	ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.Владелец.Доступность = Ложь;
	
	// Еще надо фильтровать по организации, если она заполнена
	Если ЕстьРеквизитДокумента("Организация",МетаданныеДокумента) Тогда
		ФормаВыбора.СправочникСписок.Отбор.Организация.Значение                            = ДокументОбъект.Организация;
		ФормаВыбора.СправочникСписок.Отбор.Организация.Использование                       = Истина;
		ФормаВыбора.СправочникСписок.Отбор.Организация.ВидСравнения                        = ВидСравнения.Равно;
		ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.Организация.Доступность = Ложь;
	КонецЕсли;
	
	ФормаВыбора.ЭлементыФормы.СправочникСписок.ТекущаяСтрока = Договор;
	ФормаВыбора.Открыть();
КонецПроцедуры

Процедура КонтрольДоговора(ДокументОбъект,Элемент) Экспорт	
	Если НЕ(Элемент.Значение.Пустая()) И Элемент.Значение.Организация<>ДокументОбъект.Организация Тогда
		Предупреждение("Нельзя выбирать договор другой организации !");	
		Элемент.Значение= Неопределено;			
	КонецЕсли;    
КонецПроцедуры

// контроль выбора  складов и МОЛ-ов
Процедура НачалоВыбораСклада(ЭлементФормы, Склад, СтандартнаяОбработка,ИБ=Неопределено) Экспорт	
	СтандартнаяОбработка = Ложь;
	
	ФормаВыбора = Справочники.Склады.ПолучитьФормуВыбора(,ЭлементФормы,);
	
	Если Не(РольДоступна("Администратор")) Тогда
		ФормаВыбора.ЭлементыФормы.Список.НастройкаОтбора.Код.Доступность   			= Ложь;
		ФормаВыбора.ЭлементыФормы.Список.НастройкаОтбора.ЭтоГруппа.Доступность   	= Ложь;		
		//ФормаВыбора.ЭлементыФормы.Список.НастройкаОтбора.Владелец.Доступность   	= Ложь;		
	КонецЕсли;
	
	////Кухарь 28.12.15 начало
	////Непонятно зачем это нужно
	//ФормаВыбора.ЭлементыФормы.Список.ИерархическийПросмотр=Ложь;
	//
	//ЭлементОтбора=ФормаВыбора.Список.Отбор.ЭтоГруппа;		
	//
	//Если ЭлементФормы.ВыборГруппИЭлементов=ИспользованиеГруппИЭлементов.Элементы Тогда
	//	ЭлементОтбора.Использование	=Истина;
	//	ЭлементОтбора.ВидСравнения	=ВидСравнения.Равно;
	//	ЭлементОтбора.Значение		=Ложь;
	//ИначеЕсли ЭлементФормы.ВыборГруппИЭлементов=ИспользованиеГруппИЭлементов.Группы Тогда
	//	ЭлементОтбора.Использование	=Истина;
	//	ЭлементОтбора.ВидСравнения	=ВидСравнения.Равно;
	//	ЭлементОтбора.Значение		=Истина;
	//КонецЕсли; 
	////Кухарь 28.12.15 конец
	
	
	//кухарь 05.06.14 начало
	//запретим выбор складов где неиспользовать=истина
	ЭлементОтбора2=ФормаВыбора.Список.Отбор.НеИспользовать;
	ЭлементОтбора2.Использование	=Истина;
	ЭлементОтбора2.ВидСравнения	=ВидСравнения.Равно;
	ЭлементОтбора2.Значение		=Ложь;
	
	
	//кухарь 05.06.14 конец
	
	//Если ПараметрыСеанса.ЭтотУзел.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
	//	ЭлементОтбора=ФормаВыбора.Список.Отбор.Владелец;
	//	
	//	ЭлементОтбора.Использование	=Истина;
	//	ЭлементОтбора.ВидСравнения	=ВидСравнения.Равно;
	//	ЭлементОтбора.Значение		=ИБ;		
	//КонецЕсли; 
	
	//ТекПользователь=ПараметрыСеанса.Пользователь;
	//Если ТекПользователь.ДоступныеСклады.Количество()>0 Тогда
	//	ФормаВыбора.СправочникСписок.Отбор.Код.Использование = Истина;
	//	ФормаВыбора.СправочникСписок.Отбор.Код.ВидСравнения  = ВидСравнения.ВСписке;
	//	
	//	ФормаВыбора.СправочникСписок.Отбор.Код.Значение.Очистить();
	//	Для Каждого СтрокаСклада Из ТекПользователь.ДоступныеСклады Цикл
	//		ФормаВыбора.СправочникСписок.Отбор.Код.Значение.Добавить(СтрокаСклада.Склад.Код);	
	//	КонецЦикла;
	//КонецЕсли;
	
	ФормаВыбора.ЭлементыФормы.Список.ТекущаяСтрока = Склад;
	ФормаВыбора.Открыть();
КонецПроцедуры

Процедура ПодборСкладаПоФрагментам(Форма,Элемент, Текст, Значение, СтандартнаяОбработка,ТолькоПервые=Истина) Экспорт
	СписокВыбора=Новый СписокЗначений;
	
	ТекСтрока=СокрЛП(Текст);	
	Пока Найти(ТекСтрока,"  ")<>0 Цикл
		ТекСтрока=СтрЗаменить(ТекСтрока,"  "," ");			
	КонецЦикла;
	
	Если ПустаяСтрока(ТекСтрока) Тогда Возврат КонецЕсли; 
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Справочник.Склады
	|ГДЕ
	|	Наименование ПОДОБНО &ШаблонПоиска И НЕ ЭтоГруппа";	
	
	//ТекПользователь=ПараметрыСеанса.Пользователь;
	//Если ТекПользователь.ДоступныеСклады.Количество()>0 Тогда
	//	Запрос.Текст=Запрос.Текст+" И Ссылка В (
	//		|ВЫБРАТЬ Склад
	//		|ИЗ Справочник.Пользователи.ДоступныеСклады КАК ДоступныеСклады
	//		|ГДЕ ДоступныеСклады.Ссылка = &Пользователь)";
	//	
	//	Запрос.УстановитьПараметр("Пользователь",ТекПользователь);
	//КонецЕсли; 
	
	Запрос.Текст=Запрос.Текст+"	
	|Упорядочить ПО Наименование"
	;
	
	Запрос.УстановитьПараметр("ШаблонПоиска",?(ТолькоПервые,"","%")+СтрЗаменить(ТекСтрока," ","%")+"%");	
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокВыбора.Добавить(Выборка.Ссылка);		
	КонецЦикла;
	
	СтандартнаяОбработка=Ложь;
	Если СписокВыбора.Количество()=0 Тогда				
	ИначеЕсли СписокВыбора.Количество()=1 Тогда		
		Значение			=СписокВыбора.Получить(0).Значение;		
	Иначе
		Выбор=Форма.ВыбратьИзСписка(СписокВыбора,Элемент);
		Если Выбор<>Неопределено Тогда
			Значение=Выбор.Значение;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры


// Процедура устанавливает отбор по основной организации в указанно форме
//
Процедура УстановитьОтборПоОрганизации(Форма, УчетПоВсемОрганизациям, ОсновнаяОрганизация, ИмяРеквизитаСписка, СкрыватьКолонку = Истина, ИмяОтбора = "Организация") Экспорт
	
	// В том случае если учте ведется по одной организации необходимо установить мягкий отбор.
	// т.е. отбор, с возможностью его изменения.
	
	Если НЕ УчетПоВсемОрганизациям Тогда // Установлен режим учета по одной организации
		
		Если НЕ (ТипЗнч(Форма[ИмяРеквизитаСписка]) = Тип("ТаблицаЗначений")) Тогда // Элемент - табличное поле
			
			// Проверим - Если это связанный регитср сведений тогда не нужно устанавливать отбор - 
			// он уже установлен системой автоматически
			
			Если ИмяРеквизитаСписка = "РегистрСведенийСписок" Тогда
				
				// Возвможно это переход по кнопке ПЕрейти
				Если ТипЗнч(Форма.ПараметрОтборПоИзмерению) = Тип("Структура") Тогда
					Если НЕ ЗначениеНеЗаполнено(Форма.ПараметрОтборПоИзмерению) Тогда
						Возврат; // Это переход по кнопке Перейти - не нужно устанавливать отбор
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
			Форма[ИмяРеквизитаСписка].Отбор[ИмяОтбора].ВидСравнения  = ВидСравнения.Равно;
			Форма[ИмяРеквизитаСписка].Отбор[ИмяОтбора].Использование = Истина;
			Форма[ИмяРеквизитаСписка].Отбор[ИмяОтбора].Значение      = ОсновнаяОрганизация;
			
			Форма.ЭлементыФормы[ИмяРеквизитаСписка].НастройкаОтбора[ИмяОтбора].Доступность = Ложь;
			
		КонецЕсли;
		
		Если СкрыватьКолонку Тогда
			
			Если НЕ Форма.ЭлементыФормы[ИмяРеквизитаСписка].Колонки.Найти(ИмяОтбора) = Неопределено Тогда
				
				Форма.ЭлементыФормы[ИмяРеквизитаСписка].Колонки[ИмяОтбора].Видимость         = Ложь;
				Форма.ЭлементыФормы[ИмяРеквизитаСписка].Колонки[ИмяОтбора].ИзменятьВидимость = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьОтборПоОрганизации()


Процедура УстановитьЗаголовокФормы(Форма,Объект) Экспорт
	Форма.Заголовок		=Объект.Метаданные().Синоним+" "+Объект.Номер+" "+Формат(Объект.Дата,"ДФ=dd.MM.yy")+" / "+СокрЛП(Объект.Автор)+?(Объект.Ссылка.Пустая()," / Новый","");
	Форма.АвтоЗаголовок	=Ложь;
КонецПроцедуры

// Шворобей ВЮ 01.11.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-1748
///ТИПЫ ЦЕНЫ И ВАЛЮТЫ В ФОРМАХ
Процедура УстановитьЗаголовокКнопкиЦеныВалюта(Форма, МассивТекстаНадписи = Неопределено) Экспорт
	
	ДокОбъект	=Форма.ЭтотОбъект;
	МетаДок		=ДокОбъект.Метаданные();
	Надпись		=Форма.ЭлементыФормы.тЦеныВалюта;	
	
	ТекстНадписи="";
	Если ЕстьРеквизитДокумента("Валюта",МетаДок) Тогда
		ТекстНадписи ="Валюта: "+ДокОбъект.Валюта+", курс: "+Формат(ДокОбъект.Курс,"ЧДЦ=4");
	КонецЕсли;
	Если МассивТекстаНадписи <> Неопределено И МассивТекстаНадписи.Количество() > 1 Тогда
		ТекстНадписи = ТекстНадписи + Символы.ПС + МассивТекстаНадписи[0];
	КонецЕсли;
	Если ЕстьРеквизитДокумента("ТипЦен",МетаДок) Тогда
		ТекстНадписи = ТекстНадписи + Символы.ПС+"Тип цен: "+ДокОбъект.ТипЦен; 
	КонецЕсли; 
	Если ЕстьРеквизитДокумента("ТипСкидок",МетаДок) Тогда
		ТекстНадписи = ТекстНадписи + Символы.ПС+"Тип скидок: "+ДокОбъект.ТипСкидок;
	КонецЕсли;
	Если ЕстьРеквизитТабЧастиДокумента("ВсегоБезСкидки",МетаДок,"Товары") И ЕстьРеквизитТабЧастиДокумента("Всего",МетаДок,"Товары") Тогда
		ТекстНадписи = ТекстНадписи + Символы.ПС+"Скидка по накладной: "+Формат(ДокОбъект.Товары.Итог("ВсегоБезСкидки")-ДокОбъект.Товары.Итог("Всего"),"ЧДЦ=2; ЧРГ=' '; ЧГ=3,0");
	КонецЕсли;
	
	Если МассивТекстаНадписи <> Неопределено И МассивТекстаНадписи.Количество() > 2 Тогда
		ТекстНадписи = ТекстНадписи + Символы.ПС + МассивТекстаНадписи[1];
	КонецЕсли;
	
	Надпись.Значение = ТекстНадписи;
	
КонецПроцедуры 
// Шворобей ВЮ 01.11.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-1748

Процедура УстановитьТипЦенВалюту(Форма) Экспорт
	
	ФормаИзмененияЦен	=ПолучитьОбщуюФорму("ЦеныИВалюта",Форма);	
	ДокОбъект			=Форма.ЭтотОбъект;
	
	Результат			=ФормаИзмененияЦен.ОткрытьМодально();
	
	Если Результат=Неопределено Тогда Возврат КонецЕсли;
	
	НовыйТипЦен		=Результат["ТипЦен"];
	НовыйТипСкидок	=Результат["ТипСкидок"];
	НоваяВалюта		=Результат["Валюта"];
	НовыйКурс		=Результат["Курс"];
	
	Если НовыйТипЦен<>Неопределено ИЛИ НовыйТипСкидок<>Неопределено Тогда
		Ответ=Вопрос("Пересчитать цены в документе в соответствии с выбранным типом цен и скидок ?",РежимДиалогаВопрос.ДаНетОтмена);
		Если Ответ=КодВозвратаДиалога.Отмена Тогда
			Возврат;
		КонецЕсли;
		
		Если НовыйТипЦен<>Неопределено Тогда
			ДокОбъект.ТипЦен=НовыйТипЦен;			
		КонецЕсли; 
		Если НовыйТипСкидок<>Неопределено Тогда
			ДокОбъект.ТипСкидок=НовыйТипСкидок;			
		КонецЕсли;			
		
		Если Ответ=КодВозвратаДиалога.Да Тогда			
			ПересчетТЧ(ДокОбъект,"Товары",?(НоваяВалюта=Неопределено,ДокОбъект.Валюта,НоваяВалюта),ДокОбъект.Валюта,?(НовыйКурс=Неопределено,ДокОбъект.Курс,НовыйКурс),ДокОбъект.Курс,Истина);
		Иначе
			ПересчетТЧ(ДокОбъект,"Товары",?(НоваяВалюта=Неопределено,ДокОбъект.Валюта,НоваяВалюта),ДокОбъект.Валюта,?(НовыйКурс=Неопределено,ДокОбъект.Курс,НовыйКурс),ДокОбъект.Курс);
		КонецЕсли;
	ИначеЕсли НоваяВалюта<>Неопределено И НоваяВалюта<>ДокОбъект.Валюта Тогда
		ПересчетТЧ(ДокОбъект,"Товары",НоваяВалюта,ДокОбъект.Валюта,?(НовыйКурс=Неопределено,ДокОбъект.Курс,НовыйКурс),ДокОбъект.Курс);			
	КонецЕсли; 
	
	Если НоваяВалюта<>Неопределено Тогда
		ДокОбъект.Валюта=НоваяВалюта;
	КонецЕсли; 
	Если НовыйКурс<>Неопределено Тогда
		ДокОбъект.Курс=НовыйКурс;		
	КонецЕсли;
	
	УстановитьЗаголовокКнопкиЦеныВалюта(Форма);
	
КонецПроцедуры

///
/// ПОДБОР ПО ШК

//Кухарь 27.07.15 начало
//Добавление возможности брать количество товара из справочника ШтрихКоды.ШтВКоробе если там что-то указали
//Функция ДобавитьТоварВДокумент(Номенклатура,ДокОбъект,Знач ТипШК=Неопределено,Количество=1,НеДобавлятьПозиции=Ложь,Обнулять=Ложь,КолонкаКоличества="Количество",ИмяТЧ="Товары") Экспорт
Функция ДобавитьТоварВДокумент(Номенклатура,ДокОбъект,Знач ТипШК=Неопределено,Количество=1,НеДобавлятьПозиции=Ложь,Обнулять=Ложь,КолонкаКоличества="Количество",ИмяТЧ="Товары",КоличествоИзШК=0) Экспорт	
	//Кухарь 27.07.15 конец	
	СтрокаТовара=Неопределено;
	
	//крохин начало 28.05.2012
	//в РКМ надо вычитать при сканировании
	Если ДокОбъект <> Неопределено И ДокОбъект.Метаданные().Имя = "РекламационнаяНакладная" Тогда
		//	Количество = - Количество; 	
	КонецЕсли;
	//крохин конец 28.05.2012

	
	
	// Кухарь А.Ю.  15.08.2024 начало
	//Привело к тому, что сломался подбор в накладных
	//Если ЗначениеЗаполнено(Номенклатура) Тогда Возврат СтрокаТовара КонецЕсли; 
	Если не ЗначениеЗаполнено(Номенклатура) Тогда Возврат СтрокаТовара КонецЕсли; 	 
	// Кухарь А.Ю.  15.08.2024 конец
	
	Если Номенклатура.Пустая() Тогда Возврат СтрокаТовара КонецЕсли; 
	
	ТипШК=?(ТипШК=Неопределено,Перечисления.ТипыШтрихКодов.Штука,ТипШК);
	Коэфф=1;
	//Кухарь 27.07.15 начало
	//Добавление возможности брать количество товара из справочника ШтрихКоды.ШтВКоробе если там что-то указали	
	если КоличествоИзШК=0 тогда
		//Кухарь 27.07.15 конец	
		
		Если ТипШК=Перечисления.ТипыШтрихКодов.Штука Тогда
		ИначеЕсли ТипШК=Перечисления.ТипыШтрихКодов.Коробка Тогда
			Коэфф=ПолучитьРеквизитРодителя(Номенклатура,"ШтукВКоробке");		
			Если Коэфф=0 Тогда
				Сообщить("Для товара: """+Номенклатура+""" не указано количество штук в коробке !",СтатусСообщения.Важное);	
			КонецЕсли; 
		ИначеЕсли ТипШК=Перечисления.ТипыШтрихКодов.Блочок Тогда
			Коэфф=ПолучитьРеквизитРодителя(Номенклатура,"ШтукВКоробочке");	
			Если Коэфф=0 Тогда
				Сообщить("Для товара: """+Номенклатура+""" не указано количество штук в блочке !",СтатусСообщения.Важное);	
				
				Сигнал();
				Сигнал();
				Сигнал();
			КонецЕсли; 
		КонецЕсли; 
		//Кухарь 27.07.15 начало
		//Добавление возможности брать количество товара из справочника ШтрихКоды.ШтВКоробе если там что-то указали
	иначе
		Коэфф=КоличествоИзШК;
	КонецЕсли;
	//Кухарь 27.07.15 конец	
	ТЧ=ДокОбъект[ИмяТЧ];
	
	Если Коэфф<>0 Тогда
		СтрокаТовара=ТЧ.Найти(Номенклатура,"Номенклатура");	
		
		Если СтрокаТовара<>Неопределено Тогда
			СтрокаТовара[КолонкаКоличества]=?(Обнулять,0,1)*СтрокаТовара[КолонкаКоличества]+Коэфф*Количество;	
		Иначе
			Если НеДобавлятьПозиции=Ложь Тогда
				СтрокаТовара=ТЧ.Добавить();			
				СтрокаТовара.Номенклатура	=Номенклатура;
				ПриИзмененииНоменклатурыТабЧасти(СтрокаТовара, ДокОбъект);		
				
				СтрокаТовара[КолонкаКоличества]=Коэфф*Количество;
			Иначе
				Предупреждение("Текущее состояние накладной не допускает ввод новых позиций !");
			КонецЕсли;			
		КонецЕсли; 
		
		Если СтрокаТовара<>Неопределено Тогда
			РассчитатьСуммуТабЧасти(СтрокаТовара,ДокОбъект);
		КонецЕсли;		
	КонецЕсли; 	
	
	Возврат СтрокаТовара;
КонецФункции

//крохин начало


//Кухарь 27.07.15 начало
//Добавление возможности брать количество товара из справочника ШтрихКоды.ШтВКоробе если там что-то указали
//Функция ДобавитьТоварВДокументсШК(Номенклатура,ДокОбъект,Знач ТипШК=Неопределено,ШК = "",Количество=1,НеДобавлятьПозиции=Ложь,Обнулять=Ложь,КолонкаКоличества="Количество",ИмяТЧ="Товары") Экспорт

	
Функция ДобавитьТоварВДокументсШК(Номенклатура, ДокОбъект,Знач ТипШК = Неопределено,ШК = "",Количество = 1,НеДобавлятьПозиции = Ложь,Обнулять = Ложь,
		КолонкаКоличества = "Количество", ИмяТЧ = "Товары", КоличествоИзШК = 0,
		ЭтоНекондиция = Неопределено, ЭтоБрак = Неопределено, СканированиеSSCC = Ложь) Экспорт	
		
		// Кухарь А.Ю.  15.12.2024 начало
		//
		если СтрДлина(ШК) = 85 или СтрДлина(ШК) = 83 тогда
			ЭтоСканированиеКодаШтукиЧЗ=Истина;
		иначе
			ЭтоСканированиеКодаШтукиЧЗ=ложь;
		КонецЕсли;
		// Кухарь А.Ю.  15.12.2024 конец
	СтрокаТовара=Неопределено;
	
	Если Номенклатура.Пустая() Тогда Возврат СтрокаТовара КонецЕсли; 
	
	ТипШК=?(ТипШК=Неопределено,Перечисления.ТипыШтрихКодов.Штука,ТипШК);
	
	Коэфф=1;
	//Кухарь 27.07.15 начало
	//Добавление возможности брать количество товара из справочника ШтрихКоды.ШтВКоробе если там что-то указали
	если КоличествоИзШК=0 тогда
		//Кухарь 27.07.15 конец		
		Если ТипШК=Перечисления.ТипыШтрихКодов.Штука Тогда
		ИначеЕсли ТипШК=Перечисления.ТипыШтрихКодов.Коробка Тогда
			Коэфф=ПолучитьРеквизитРодителя(Номенклатура,"ШтукВКоробке");		
			Если Коэфф=0 Тогда
				Сообщить("Для товара: """+Номенклатура+""" не указано количество штук в коробке !",СтатусСообщения.Важное);	
			КонецЕсли; 
		ИначеЕсли ТипШК=Перечисления.ТипыШтрихКодов.Блочок Тогда
			Коэфф=ПолучитьРеквизитРодителя(Номенклатура,"ШтукВКоробочке");	
			Если Коэфф=0 Тогда
				Сообщить("Для товара: """+Номенклатура+""" не указано количество штук в блочке !",СтатусСообщения.Важное);	
				
				Сигнал();
				Сигнал();
				Сигнал();
			КонецЕсли; 
		КонецЕсли; 
		//Кухарь 27.07.15 начало
		//Добавление возможности брать количество товара из справочника ШтрихКоды.ШтВКоробе если там что-то указали
	иначе
		Коэфф=КоличествоИзШК;
	КонецЕсли;
	//Кухарь 27.07.15 конец		
	ТЧ=ДокОбъект[ИмяТЧ];
	
	Если Коэфф<>0 Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",Номенклатура);
		
		// Кухарь А.Ю.  15.12.2024 начало
		//Отбор.Вставить("ШК",ШК);
		//Отбор.Вставить("ТипШК",ТипШК);
		если не ЭтоСканированиеКодаШтукиЧЗ тогда
			//++Данилова Е.В. 22.05.2025 HELP-5111 
			Если НЕ СканированиеSSCC Тогда
				
				Отбор.Вставить("ШК",ШК);
				Отбор.Вставить("ТипШК",ТипШК);
				
				
			КонецЕсли;
			//--Данилова Е.В. 22.05.2025
			//Отбор.Вставить("ШК",ШК);
			//Отбор.Вставить("ТипШК",ТипШК);
		КонецЕсли;
		// Кухарь А.Ю.  15.12.2024 конец
		
		Если ЭтоНекондиция <> Неопределено Тогда
			Отбор.Вставить("ЭтоНекондиция", ЭтоНекондиция);
		КонецЕсли;
		Если ЭтоБрак <> Неопределено Тогда
			Отбор.Вставить("ЭтоБрак", ЭтоБрак);
		КонецЕсли;
		СтрокиТовара=ТЧ.НайтиСтроки(Отбор);	
		Для Каждого Строчка Из СтрокиТовара Цикл
			СтрокаТовара = Строчка;
			Прервать;
		КонецЦикла;
		Если СтрокаТовара<>Неопределено Тогда
			СтрокаТовара[КолонкаКоличества]=?(Обнулять,0,1)*СтрокаТовара[КолонкаКоличества]+Коэфф*Количество;	
		Иначе
			Если НеДобавлятьПозиции=Ложь Тогда
				СтрокаТовара=ТЧ.Добавить();			
				СтрокаТовара.Номенклатура	=Номенклатура;
				СтрокаТовара.ШК = ШК;
				СтрокаТовара.ТипШК = ТипШК;
				// Кухарь А.Ю. 03.04.2020 начало
				// Для сканирования некондиции
				Если ЭтоНекондиция <> Неопределено И ЭтоБрак = Неопределено Тогда
					СтрокаТовара.ЭтоНекондиция = ЭтоНекондиция;
				КонецЕсли;
				// Кухарь А.Ю. 03.04.2020 конец
				Если ЭтоБрак <> Неопределено И ЭтоНекондиция = Неопределено Тогда  // Шворобей ВЮ 04.10.2022 ++
					СтрокаТовара.ЭтоБрак = ЭтоБрак;
				КонецЕсли;
				
				ПриИзмененииНоменклатурыТабЧасти(СтрокаТовара, ДокОбъект);		
				
				СтрокаТовара[КолонкаКоличества]=Коэфф*Количество;
			Иначе
				Предупреждение("Текущее состояние накладной не допускает ввод новых позиций !");
			КонецЕсли;			
		КонецЕсли; 
		
		Если СтрокаТовара<>Неопределено Тогда
			РассчитатьСуммуТабЧасти(СтрокаТовара,ДокОбъект);
		КонецЕсли;		
	КонецЕсли; 	
	
	Возврат СтрокаТовара;
КонецФункции

 //Кухарь 06.04.17 начало
	
	//Кухарь 27.07.15 конец	
// Кухарь А.Ю. 03.04.2020 начало
//Обработка сканирования некондиции
// Функция ВычестьТоварВДокументсШК(Номенклатура,ДокОбъект,Знач ТипШК=Неопределено,ШК = "",Количество=1,НеДобавлятьПозиции=Ложь,Обнулять=Ложь,КолонкаКоличества="Количество",ИмяТЧ="Товары",КоличествоИзШК=0) Экспорт
Функция ВычестьТоварВДокументсШК(Номенклатура,ДокОбъект,Знач ТипШК=Неопределено,ШК = "",Количество=1,НеДобавлятьПозиции=Ложь,Обнулять=Ложь,
		КолонкаКоличества = "Количество", ИмяТЧ = "Товары", КоличествоИзШК = 0,
		ЭтоНекондиция = Неопределено, ЭтоБрак = Неопределено) Экспорт
// Кухарь А.Ю. 03.04.2020 конец
	
	СтрокаТовара = Неопределено;
	
	Если Номенклатура.Пустая() Тогда Возврат СтрокаТовара КонецЕсли; 
	
	// Шворобей ВЮ 22.05.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4868
	МетаданныеДок = Неопределено; 
	//++Данилова Е.В. 06.03.2026 HELP-9093
	ИмяДокумента = ""; 
	//--Данилова Е.В. 06.03.2026
	Если ДокОбъект <> Неопределено Тогда
		МетаданныеДок = ДокОбъект.Метаданные(); 
		//++Данилова Е.В. 06.03.2026 HELP-9093
		ИмяДокумента = МетаданныеДок.Имя; 
		//--Данилова Е.В. 06.03.2026 
	Иначе
		Возврат СтрокаТовара;
	КонецЕсли;
	// Шворобей ВЮ 22.05.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4868
	
	ТЧ = ДокОбъект[ИмяТЧ];
	
	ТипШК=?(ТипШК=Неопределено,Перечисления.ТипыШтрихКодов.Штука,ТипШК);
	
	Коэфф=1;
	//Кухарь 27.07.15 начало
	//Добавление возможности брать количество товара из справочника ШтрихКоды.ШтВКоробе если там что-то указали
	если КоличествоИзШК=0 тогда
		//Кухарь 27.07.15 конец		
		Если ТипШК=Перечисления.ТипыШтрихКодов.Штука Тогда
		ИначеЕсли ТипШК=Перечисления.ТипыШтрихКодов.Коробка Тогда
			Коэфф=ПолучитьРеквизитРодителя(Номенклатура,"ШтукВКоробке");		
			Если Коэфф=0 Тогда
				Сообщить("Для товара: """+Номенклатура+""" не указано количество штук в коробке !",СтатусСообщения.Важное);	
			КонецЕсли; 
		ИначеЕсли ТипШК=Перечисления.ТипыШтрихКодов.Блочок Тогда
			Коэфф=ПолучитьРеквизитРодителя(Номенклатура,"ШтукВКоробочке");	
			Если Коэфф=0 Тогда
				Сообщить("Для товара: """+Номенклатура+""" не указано количество штук в блочке !",СтатусСообщения.Важное);	
				
				Сигнал();
				Сигнал();
				Сигнал();
			КонецЕсли; 
		КонецЕсли; 
		//Кухарь 27.07.15 начало
		//Добавление возможности брать количество товара из справочника ШтрихКоды.ШтВКоробе если там что-то указали
	иначе
		Коэфф=КоличествоИзШК;
	КонецЕсли;
	//Кухарь 27.07.15 конец		
	
	Если Коэфф <> 0 Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",Номенклатура);
		Отбор.Вставить("ШК",ШК);
		Отбор.Вставить("ТипШК",ТипШК);
		
		// Кухарь А.Ю. 03.04.2020 начало
		// Для сканирования некондиции
		// Шворобей ВЮ 25.10.2022 ++
		Если ЭтоНекондиция <> Неопределено Тогда
			Отбор.Вставить("ЭтоНекондиция", ЭтоНекондиция);
		КонецЕсли;
		Если ЭтоБрак <> Неопределено Тогда
			Отбор.Вставить("ЭтоБрак", ЭтоБрак);
		КонецЕсли;
		 // Шворобей ВЮ 25.10.2022 ++
		// Кухарь А.Ю. 03.04.2020 конец
		
		СтрокиТовара = ТЧ.НайтиСтроки(Отбор);	
		Для Каждого СтрокаТовара Из СтрокиТовара Цикл
			
			Если СтрокаТовара <> Неопределено Тогда
			
				СтрокаТовара[КолонкаКоличества] = СтрокаТовара[КолонкаКоличества] - Коэфф * Количество;
				
				//Тимофеев Ю.А. 29.11.2023
				//выходила ошибка так как Строка товара Неопределена убрал в условие
				Если СтрокаТовара[КолонкаКоличества] = 0 Тогда
					  
					// Кухарь А.Ю. 18.08.2025 начало
					//Инд = ДокОбъект[ТЧ].Индекс(СтрокаТовара);
					//ДокОбъект[ТЧ].Удалить(Инд);
					Инд = ДокОбъект[ИмяТЧ].Индекс(СтрокаТовара);
					ДокОбъект[ИмяТЧ].Удалить(Инд);
					// Кухарь А.Ю. 18.08.2025 конец
					
					СтрокаТовара = Неопределено;
				КонецЕсли;
				//Тимофеев Ю.А. 29.11.2023
				
				Если СтрокаТовара <> Неопределено Тогда
					РассчитатьСуммуТабЧасти(СтрокаТовара,ДокОбъект);
				КонецЕсли;		
				
			КонецЕсли;
			Прервать;
		КонецЦикла;
		
		// Шворобей ВЮ 22.05.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4868 
		Если ЕстьРеквизитТабЧастиДокумента("Отсканировано", МетаданныеДок, ИмяТЧ) Тогда
			СтрокиТовара = ТЧ.НайтиСтроки(Новый Структура("Номенклатура",Номенклатура));	
			Для Каждого СтрокаТовара Из СтрокиТовара Цикл
				СтрокаТовара["Отсканировано"] = СтрокаТовара["Отсканировано"] - Коэфф * Количество;
			КонецЦикла;
			//++Данилова Е.В. 06.03.2026 HELP-9093 
			Если ИмяДокумента = "ЛистПереукладки"
				И ДокОбъект.ОтклКонтрольНоменклатуры Тогда
				
				СтрокиТовара = ДокОбъект[ИмяТЧ].НайтиСтроки(Новый Структура("Номенклатура,Отсканировано",Номенклатура,0));	
				Для каждого СтрокаТовара Из СтрокиТовара Цикл
					
					ДокОбъект[ИмяТЧ].Удалить(СтрокаТовара);	
					
				КонецЦикла;
			КонецЕсли;
			//--Данилова Е.В. 06.03.2026 
		КонецЕсли;
		// Шворобей ВЮ 22.05.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4868
	КонецЕсли; 	
	
	Возврат СтрокаТовара;
КонецФункции
//Кухарь 06.04.17

//крохин конец

//заполняет доступные состояния для накладных
Процедура НастроитьСписокСостояний(Форма) Экспорт
	СписокВыбора=Форма.ЭлементыФормы.СостояниеНакладной.ДоступныеЗначения;
	СписокВыбора.Очистить();	
	
	ДокОбъект=Форма.ЭтотОбъект;
	ВидДокумента=ДокОбъект.Метаданные().Имя;
	Если ВидДокумента="ПриходнаяНакладная" Тогда
		Если Форма.ЭтоНовый() Тогда
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ВРаботе);			
		КонецЕсли;
		
		СписокВыбора.Добавить(Перечисления.СостоянияНакладной.КОтправкеНаСклад);			
		СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ПолученоСкладом);
		СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Сканирование);			
		СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ГотоваКПриемке);
		//СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Принята);
		//нечаева 07,04,14 +++
		Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			Если СокрЛП(Форма.ЭтотОбъект.Склад.КодФизическогоУзла)="" или Форма.ЭтотОбъект.Склад.КодФизическогоУзла = ПараметрыСеанса.ЭтотУзел.Подразделение.КодФизическогоУзла77  Тогда
				СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Принята);
			конецЕсли;
		иначе
			Если Форма.ЭтотОбъект.Склад.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда //	И ДокОбъект.Проведен 			
				СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Принята);
			конецЕсли;
		конецЕсли;
		//нечаева 07,04,14 ---
		
	ИначеЕсли ВидДокумента="РасходнаяНакладная" Тогда		
		Если Форма.ЭтоНовый() Тогда
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ВРаботе);		
		КонецЕсли;
		
		Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.КОтправкеНаСклад);		
		Иначе
			//Кухарь 10.06.2024 начало
			если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение тогда
				СписокВыбора.Добавить(Перечисления.СостоянияНакладной.КОтправкеНаСклад);	
			КонецЕсли;
			//Кухарь 10.06.2024 конец
			
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ПолученоСкладом);			
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ВНаборе);
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Сканирование);
			
			// Кухарь А.Ю.  26.10.2022 начало
			// По просьбе администраторов склада
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ОжиданиеДопОбработки);		
			// Кухарь А.Ю.  26.10.2022 конец			
			//крохин начало 16.02.2012
			//новое состояние
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ДопОбработка);
			//крохин конец 16.02.2012
			
			// Кельманов А.В. - SNL-119 - 2026.03.04 {
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ОжиданиеПереукладки);
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Переукладка);
			// Кельманов А.В. - SNL-119 - 2026.03.04 }   
			
			//крохин начало 21.03.2013
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ВМашине);
			//крохин конец 21.03.2013
			
			// Кухарь А.Ю. 02.06.2023 начало
			// ещё состояние по просьбе Тульчинского Ю.А.		
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ОжиданиеТермоусадки);
			// Кухарь А.Ю. 02.06.2023 конец
			
			//Кухарь 28.02.17 начало
			//Новые состояния 
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ОжиданиеПаллетирования);
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Паллетирование);
			
			//Кухарь 28.02.17 конец

		КонецЕсли;
		
		Если ДокОбъект.Проведен Тогда
			
			//нечаева 07,04,14 +++
			//только для узлов склада.
			Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				Если СокрЛП(Форма.ЭтотОбъект.Склад.КодФизическогоУзла)="" или Форма.ЭтотОбъект.Склад.КодФизическогоУзла = ПараметрыСеанса.ЭтотУзел.Подразделение.КодФизическогоУзла77  Тогда
					СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ГотоваКОтгрузке);		
					СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Отгружена);
				конецЕсли;
			иначе
				Если Форма.ЭтотОбъект.Склад.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда //	И ДокОбъект.Проведен 			
					СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ГотоваКОтгрузке);		
					СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Отгружена);
				конецЕсли;
			конецЕсли;
			//нечаева 07,04,14 ---
			
			//СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ГотоваКОтгрузке);		
			//СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Отгружена);
			
		КонецЕсли;	
	ИначеЕсли ВидДокумента="Перемещение" Тогда
		Если Форма.ЭтоНовый() Тогда
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ВРаботе);		
		КонецЕсли;
		
		Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.КотправкеНаСклад);			
			
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ГотоваКОтгрузке);
			//нечаева 07,04,14 +++
			
			Если Форма.ЭтотОбъект.Склад=Форма.ЭтотОбъект.СкладПолучатель.ФизическийСклад
				ИЛИ Форма.ЭтотОбъект.Склад.ФизическийСклад=Форма.ЭтотОбъект.СкладПолучатель 
				ИЛИ Форма.ЭтотОбъект.Склад.ФизическийСклад=Форма.ЭтотОбъект.СкладПолучатель.ФизическийСклад Тогда
				//крохин конец
				Виртуалка=Истина;                                     
			Иначе
				Виртуалка=Ложь;                         
			КонецЕсли;
			
			
			
			Если СокрЛП(Форма.ЭтотОбъект.Склад.КодФизическогоУзла)="" или Форма.ЭтотОбъект.Склад.КодФизическогоУзла = ПараметрыСеанса.ЭтотУзел.Подразделение.КодФизическогоУзла77 
				или виртуалка  
				Тогда
				СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Отгружена);		
			конецЕсли;
			//нечаева 07,04,14 ---
			
			//СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Отгружена);		
		Иначе
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.КОтправкеВОфис);
			
			Если Форма.ЭтотОбъект.Склад.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда		
				
				// Кухарь А.Ю.  06.06.2022 начало
				// Чтобы могли создавать планы набора
				СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ПолученоСкладом);
				// Кухарь А.Ю.  06.06.2022 конец
				
				СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ВНаборе);
				СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Сканирование);
				
				Если Форма.ЭтотОбъект.Склад.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код И ДокОбъект.Проведен Тогда
					СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ГотоваКОтгрузке);
					СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Отгружена);
				КонецЕсли; 
			КонецЕсли;			
		КонецЕсли;
		
		Если РольДоступна("Администратор") Тогда
			Для Сч=0 По Перечисления.СостоянияНакладной.Количество()-1 Цикл
				Состояние=Перечисления.СостоянияНакладной.Получить(Сч);
				Если СписокВыбора.НайтиПоЗначению(Состояние)=Неопределено Тогда
					СписокВыбора.Добавить(Состояние);			
				КонецЕсли; 				
			КонецЦикла;
			
			СписокВыбора.СортироватьПоЗначению();
		КонецЕсли; 
		//крохин начало
		//	Если Форма.ЭтотОбъект.Склад=Форма.ЭтотОбъект.СкладПолучатель.ФизическийСклад
		//		ИЛИ Форма.ЭтотОбъект.Склад.ФизическийСклад=Форма.ЭтотОбъект.СкладПолучатель Тогда
		Если Форма.ЭтотОбъект.Склад=Форма.ЭтотОбъект.СкладПолучатель.ФизическийСклад
			ИЛИ Форма.ЭтотОбъект.Склад.ФизическийСклад=Форма.ЭтотОбъект.СкладПолучатель 
			ИЛИ Форма.ЭтотОбъект.Склад.ФизическийСклад=Форма.ЭтотОбъект.СкладПолучатель.ФизическийСклад Тогда
			//крохин конец
			Виртуалка=Истина;			
		Иначе
			Виртуалка=Ложь;		
		КонецЕсли; 
		
		//состояниен накладной у получателя
		СписокВыбора=Форма.ЭлементыФормы.СостояниеНакладнойУПолучателя.ДоступныеЗначения;
		СписокВыбора.Очистить();
		
		
		//кухарь 05.06.14 начало
		СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Доставлена);	
		//кухарь 05.06.14 конец
		Если Форма.ЭтоНовый() Тогда
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ВРаботе);	
		КонецЕсли;
		
		Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.КотправкеНаСклад);
			Если ДокОбъект.СкладПолучатель.ВидСклада=Перечисления.ВидСклада.Виртуальный ИЛИ Виртуалка Тогда
				СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Принята);							
			КонецЕсли; 
		Иначе
			Если Форма.ЭтотОбъект.СкладПолучатель.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда
				СписокВыбора.Добавить(Перечисления.СостоянияНакладной.КОтправкеВОфис);
				СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Сканирование);
				СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ГотоваКПриемке);
				СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Принята);
			КонецЕсли;			
		КонецЕсли;		
		
		Если РольДоступна("Администратор") Тогда
			Для Сч=0 По Перечисления.СостоянияНакладной.Количество()-1 Цикл
				Состояние=Перечисления.СостоянияНакладной.Получить(Сч);
				Если СписокВыбора.НайтиПоЗначению(Состояние)=Неопределено Тогда
					СписокВыбора.Добавить(Состояние);			
				КонецЕсли; 				
			КонецЦикла;			
			СписокВыбора.СортироватьПоЗначению();
		КонецЕсли; 
	ИначеЕсли ВидДокумента="ЗаявкаНаОтгрузку" Тогда
		Если Форма.ЭтоНовый() Тогда
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ВРаботе);		
		КонецЕсли;
		
		Если ПараметрыСеанса.ЭтотУзел=Константы.УзелТранспортногоОтдела.Получить() Тогда
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ПолученоСкладом);
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Отгружена);			
		Иначе
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.КОтправкеНаСклад);		
		КонецЕсли; 		
	ИначеЕсли ВидДокумента="Инвентаризация" Тогда
		Если Форма.ЭтоНовый() Тогда
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ВРаботе);		
		КонецЕсли;		
		
		СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Сканирование);
		СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ГотоваКОтгрузке);
		//кухарь 05.06.14 начало
		//СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Отгружена);
		Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			Если СокрЛП(Форма.ЭтотОбъект.Склад.КодФизическогоУзла)="" или Форма.ЭтотОбъект.Склад.КодФизическогоУзла = ПараметрыСеанса.ЭтотУзел.Подразделение.КодФизическогоУзла77  Тогда
				СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Отгружена);
			иначе
				если Форма.ЭтотОбъект.Склад.подразделение.закрыто тогда
					СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Отгружена);
				КонецЕсли;
				
			конецЕсли;    
			//кухарь 11.06.14 начало
			//разблокировал состояние отгружена на др складах
		иначе		
			Если  Форма.ЭтотОбъект.Склад.КодФизическогоУзла = ПараметрыСеанса.ЭтотУзел.Подразделение.КодФизическогоУзла77  Тогда
				СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Отгружена);
			КонецЕсли;
			//кухарь 11.06.14 конец	
		КонецЕсли;
		//кухарь 05.06.14 конец
		
		
	ИначеЕсли ВидДокумента="СписаниеТМЦ" ИЛИ ВидДокумента="Комплектация" Тогда		
		Если Форма.ЭтоНовый() Тогда
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ВРаботе);		
		КонецЕсли;
		//кухарь 10.06.14 начало
		//добавление в список доступных состояний, так как при пустом списке выводятся все, что не есть хорошо"
		Если ВидДокумента="СписаниеТМЦ" тогда
			//кухарь 10.06.14 конец	
			//кухарь 05.06.14 начало
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Сканирование);	
			//кухарь 05.06.14 конец
			//кухарь 10.06.14 начало
		КонецЕсли;
		//кухарь 10.06.14 конец
		//крохин начало
		//для комплектация добавим "в наборе" и "сканирование"
		Если ВидДокумента="Комплектация" Тогда	
			// Кухарь А.Ю. 23.08.2021 начало
			// По просьбе Гамовой
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ПолученоСкладом);
			// Кухарь А.Ю. 23.08.2021 конец			
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Сканирование);
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ВНаборе);
		КонецЕсли;
		//крохин конец
		//СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Отгружена);
		//нечаева 07,04,14 +++
		//только для узлов склада.
		Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			Если СокрЛП(Форма.ЭтотОбъект.Склад.КодФизическогоУзла)="" или Форма.ЭтотОбъект.Склад.КодФизическогоУзла = ПараметрыСеанса.ЭтотУзел.Подразделение.КодФизическогоУзла77  Тогда
				СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Отгружена);
				//кухарь 05.06.14 начало
			иначе
				если Форма.ЭтотОбъект.Склад.подразделение.закрыто тогда
					СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Отгружена);
				КонецЕсли;
				//кухарь 05.06.14 конец
				
			конецЕсли;
		иначе
			Если Форма.ЭтотОбъект.Склад.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда 			
				СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Отгружена);
			конецЕсли;
		конецЕсли;
		//нечаева 07,04,14 ---
		
		
	ИначеЕсли ВидДокумента="ОприходованиеТМЦ" Тогда
		Если Форма.ЭтоНовый() Тогда
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ВРаботе);		
		КонецЕсли;
		
		СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Сканирование);
		//нечаева 07,04,14 +++
		//только для узлов склада.
		Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			Если СокрЛП(Форма.ЭтотОбъект.Склад.КодФизическогоУзла)="" или Форма.ЭтотОбъект.Склад.КодФизическогоУзла = ПараметрыСеанса.ЭтотУзел.Подразделение.КодФизическогоУзла77  Тогда
				СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Принята);
				//кухарь 05.06.14 начало
			иначе
				если Форма.ЭтотОбъект.Склад.подразделение.закрыто тогда
					СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Принята);
				КонецЕсли;
				//кухарь 05.06.14 конец
			конецЕсли;
		иначе
			Если Форма.ЭтотОбъект.Склад.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда //	И ДокОбъект.Проведен 			
				СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Принята);
			конецЕсли;
		конецЕсли;
		//нечаева 07,04,14 ---
		//СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Принята);
		//крохин начало 21.03.2013
	ИначеЕсли ВидДокумента="Паллета" Тогда
		Если Форма.ЭтоНовый() Тогда
			СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ВРаботе);			
		КонецЕсли;
		
		СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Сканирование);			
		СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ГотоваКОтгрузке);
		СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ВМашине);
		СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ОтгруженаНаТранзитныйСклад);
		СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Отгружена);
	ИначеЕсли ВидДокумента = "ЛистЗагрузки" Тогда	
		СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Сканирование);			
		СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ВМашине);
		СписокВыбора.Добавить(Перечисления.СостоянияНакладной.ОтгруженаНаТранзитныйСклад);
		СписокВыбора.Добавить(Перечисления.СостоянияНакладной.Отгружена);
		//крохин конец 21.03.2013
	КонецЕсли;	
КонецПроцедуры

//ТИПЫ ШК
Функция ПолучитьТипШКПоУмолчанию(Объект=Неопределено) Экспорт
	ТипШК=ПолучитьЗначениеПоУмолчанию("ОсновнойТипШК");
	
	Если Объект<>Неопределено И ЕстьРеквизитДокумента("Склад",Объект.Метаданные()) И НЕ Объект.Склад.ТипШКПоУмолчанию.Пустая() Тогда
		ТипШК=Объект.Склад.ТипШКПоУмолчанию;		
	КонецЕсли; 
	
	Если ТипШК=Неопределено ИЛИ ТипШК.Пустая() Тогда
		ТипШК=Перечисления.ТипыШтрихКодов.Штука;	
	КонецЕсли; 
	
	Возврат ТипШК;
КонецФункции // ПолучитьТипШКПоУмолчанию()()

Процедура ЗаполнитьТипыШК(Форма) Экспорт
	Форма.ЭлементыФормы.тПоследняяСосканированнаяПозиция.Значение="";	
	
	СписокВыбора=Форма.ЭлементыФормы.ТипШК.СписокВыбора;
	Для Сч=0 По Перечисления.ТипыШтрихКодов.Количество()-1 Цикл
		СписокВыбора.Добавить(Перечисления.ТипыШтрихКодов[Сч]);	
	КонецЦикла;	
	
	Форма.ТипШК=ПолучитьТипШКПоУмолчанию(Форма.ЭтотОбъект);
КонецПроцедуры


Процедура УстановитьКолонтитулы(ТД,ПопожениеКолонтитула="Верхний") Экспорт
	Если ПопожениеКолонтитула="Верхний" Тогда
		Колонтитул=ТД.ВерхнийКолонтитул;
	Иначе
		Колонтитул=ТД.НижнийКолонтитул;	
	КонецЕсли; 
	
	Колонтитул.Выводить=Истина;
	Колонтитул.ВертикальноеПоложение=ВертикальноеПоложение.Верх;
	
	Колонтитул.ТекстСлева="Сформирован: "+СокрЛП(ПараметрыСеанса.Пользователь)+", "+ТекущаяДата();	
	// Кухарь А.Ю. 08.02.2021 начало
	//Глюк платформы какой-то 8.3.15.1830. В этот колонтитул криво передаётся сочетание пробела с цифрами	
	Колонтитул.ТекстСлева=СтрЗаменить(Колонтитул.ТекстСлева," ",Символы.НПП);  
	// Кухарь А.Ю. 08.02.2021 конец

	
	
	Колонтитул.ТекстСправа="Стр. № [&НомерСтраницы]из [&СтраницВсего]";
	
КонецПроцедуры

//вывод контрольной информации в печ. форму для сравнения спецификаций
Процедура ВывестиКонтрольнуюИнформациюВВыходнуюТаблицу(ДокОбъект,Таб,Макет) Экспорт	
	Если Константы.НеВыводитьКонтрольнуюИнформациюПриПечати.Получить() Тогда Возврат КонецЕсли;
	
	МетаДок=ДокОбъект.Метаданные();
	
	ПараметрыШапки=Новый Структура;
	
	Вид80=ДокОбъект.Метаданные().Имя;
	Если Вид80="РасходнаяНакладная" Тогда
		Вид77=?(ДокОбъект.ВидОплаты=Перечисления.ВидыОплаты.НАЛ,"РасходнаяНАЛ","РасходнаяБН");
	Иначе
		Вид77=Вид80;			
	КонецЕсли; 
	
	ПараметрыШапки.Вставить("Вид77",Вид77);
	ПараметрыШапки.Вставить("Номер",ДокОбъект.Номер);
	ПараметрыШапки.Вставить("Дата",	ДокОбъект.Дата);
	
	Если ЕстьРеквизитДокумента("ДатаОтгрузки",МетаДок) Тогда
		ПараметрыШапки.Вставить("ДатаОтгрузки",	ДокОбъект.ДатаОтгрузки);		
	КонецЕсли; 
	
	Если ЕстьРеквизитДокумента("Контрагент",МетаДок) Тогда
		ПараметрыШапки.Вставить("КонтрагентНаименование",	ДокОбъект.Контрагент.Наименование);	
		ПараметрыШапки.Вставить("КонтрагентКод",			ДокОбъект.Контрагент.Код);
	КонецЕсли;
	
	ПараметрыШапки.Вставить("СкладНаименование",		ДокОбъект.Склад.Наименование);
	ПараметрыШапки.Вставить("СкладКод",					ДокОбъект.Склад.Код);	
	Если ЕстьРеквизитДокумента("Организация",ДокОбъект.Метаданные()) Тогда
		попытка
			ПараметрыШапки.Вставить("ОрганизацияНаименование",	ДокОбъект.Организация.Наименование);
		исключение
			ПараметрыШапки.Вставить("ОрганизацияНаименование",	Справочники.Организации.НайтиПоКоду("SS-001"));
		КонецПопытки;
	КонецЕсли;	
	
	Обл_Шапка=Макет.ПолучитьОбласть("Контроль_Шапка");
	Обл_Шапка.Параметры.Заполнить(ПараметрыШапки);
	
	НачСтрока=Таб.ВысотаТаблицы+1;
	
	Таб.Вывести(Обл_Шапка);
	
	Для Каждого СтрокаТЧ Из ДокОбъект.Товары  Цикл
		ОблСтрока=Макет.ПолучитьОбласть("Контроль_Строка");
		
		ПараметрыСтроки=Новый Структура;
		
		ПараметрыСтроки.Вставить("Код77",		СтрокаТЧ.Номенклатура.Код77);
		ПараметрыСтроки.Вставить("Наименование",СтрокаТЧ.Номенклатура.Наименование);
		ПараметрыСтроки.Вставить("Количество",	СтрокаТЧ.Количество);
		
		Если Вид80<>"ЛистНабора" Тогда
			ПараметрыСтроки.Вставить("Цена",		СтрокаТЧ.Цена);
			ПараметрыСтроки.Вставить("НДС",			СтрокаТЧ.НДС);
			ПараметрыСтроки.Вставить("Всего",		СтрокаТЧ.Всего);		
		КонецЕсли; 
		
		ОблСтрока.Параметры.Заполнить(ПараметрыСтроки);		
		
		Таб.Вывести(ОблСтрока);
	КонецЦикла;
	
	Таб.Область(НачСтрока,,Таб.ВысотаТаблицы).Видимость=Ложь;
КонецПроцедуры

Функция БукваОтгружен(Отгружен) Экспорт
	Если Отгружен=Перечисления.Отгружен.Отгружен  Тогда
		Возврат "О";	
	ИначеЕсли Отгружен=Перечисления.Отгружен.Резерв Тогда
		Возврат "Р";
	ИначеЕсли Отгружен=Перечисления.Отгружен.РезервТранзит Тогда
		Возврат "т";
	ИначеЕсли Отгружен=Перечисления.Отгружен.ОтгруженТранзит Тогда
		Возврат "Т";
		// +++ {Кузнецов Сергей Владимирович [11.10.2022]
	ИначеЕсли Отгружен=Перечисления.Отгружен.Отменен Тогда
		Возврат "Х";
		// }Кузнецов Сергей Владимирович +++ [11.10.2022]
	Иначе
		Возврат "-";
	КонецЕсли; 	
КонецФункции // БукваОтгружен()

Функция БукваСостоянияНакладной(Состояние) Экспорт
	
	Если Состояние=Перечисления.СостоянияНакладной.ВРаботе Тогда
		Возврат "";
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.КОтправкеНаСклад Тогда
		Возврат "д";
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ПолученоСкладом Тогда
		Возврат "Д";
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.Сканирование Тогда
		Возврат "С";	
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ВНаборе Тогда
		Возврат "Н";
		//крохин начало 16.02.2012
		//новое состояние
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ДопОбработка Тогда
		Возврат "ДО";
		//крохин конец 16.02.2012
		//крохин начало 21.03.2013
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ВМашине Тогда
		Возврат "М";
		//крохин конец 21.03.2013
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ГотоваКОтгрузке ИЛИ Состояние=Перечисления.СостоянияНакладной.ГотоваКПриемке Тогда
		Возврат "Г";			
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.Отгружена Тогда
		Возврат "О";			
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ОтгруженаНаТранзитныйСклад Тогда
		Возврат "Т";			
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.Принята Тогда
		Возврат "П";			
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.КОтправкеВОфис Тогда
		Возврат "ф";
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ПолученоОфисом Тогда
		Возврат "Ф";
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.Доставлена Тогда
		Возврат "Д";
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ОжиданиеОплаты Тогда
		Возврат "ОО";
		//крохин начало 11.12.2013
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ОжиданиеНабора Тогда
		Возврат "ОН";
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ОжиданиеСканирования Тогда
		Возврат "ОС";
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ОжиданиеДопОбработки Тогда
		Возврат "ОД";
		//крохин конец 11.12.2013
		//Кухарь 18.08.14 начало
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ОжиданиеПереукладки Тогда
		Возврат "ОУ";
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.Переукладка Тогда
		Возврат "У";	
		//Кухарь 18.08.14 конец
		//кухарь 12.11.14 начало
	ИначеЕсли  Состояние=Перечисления.СостоянияНакладной.ВЗонеХранения тогда
		возврат "ЗХ"
		//кухарь 12.11.14 конец
		//Кухарь 10.12.15 начало
		//Переименовали в ПроверенаПоОстаткам
		//ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ГотоваКНабору тогда
		//возврат "ГН";
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ПроверенаПоОстаткам тогда
		возврат "ПО";
		//Кухарь 16.06.16 начало
		//Кухарь 27.12.17 начало
		//Термоусадка
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ОжиданиеТермоусадки тогда
		возврат "ОТ";
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.Термоусадка тогда
		возврат "ТУ";
		
		//Кухарь 27.12.17 конец		
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ОжиданиеПаллетирования тогда
		возврат "ОП";
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.Паллетирование тогда
		возврат "ПЛ";	
		//Кухарь 16.06.16  конец
	
		//Кухарь 10.12.15 конец
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.СформированыЗаданияНабора Тогда
		Возврат "ЗН";
	// Кухарь А.Ю. 06.04.2020 начало
	// Накладная ждёт что где-то что-то руками что-то поменяют, до этих пор штатная схема смены состояний отключается.
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ОжиданиеКорректировки Тогда
		Возврат "ОЖ"; 
	// Кухарь А.Ю. 06.04.2020 конец
	// +++ {Кузнецов Сергей Владимирович [11.10.2022]
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.Отменена Тогда
		Возврат "Х";
		// }Кузнецов Сергей Владимирович +++ [11.10.2022]
		// Кухарь А.Ю.  11.11.2024 начало
		//
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ОжиданиеКомплектацииЧЗ Тогда
		Возврат "ОК";
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.КомплектацияЧЗ Тогда
		Возврат "К";
		
		// Кухарь А.Ю.  11.11.2024 конец
		// Кухарь А.Ю.  15.10.2025 начало    
		// HELP-5404 Кухарь
	ИначеЕсли Состояние=Перечисления.СостоянияНакладной.ОжиданиеОбработкиЧЗ Тогда
		Возврат "ЧЗ";
		// Кухарь А.Ю.  15.10.2025 конец
	
	Иначе
		Возврат "н/у";		
	КонецЕсли;
	
КонецФункции //глБукваСостоянияНакладной(ТекущийДокумент)

//крохин начало 08.10.2020

Функция БукваСостоянияЗаказаКонтрагента(Состояние) Экспорт
	
	Если Состояние=Перечисления.СостоянияЗаказаКонтрагента.ВРаботе Тогда
		Возврат "";
	ИначеЕсли Состояние=Перечисления.СостоянияЗаказаКонтрагента.ПодтвержденныйЗаказ Тогда
		Возврат "п";
	ИначеЕсли Состояние=Перечисления.СостоянияЗаказаКонтрагента.Оплачен Тогда
		Возврат "о";
	ИначеЕсли Состояние=Перечисления.СостоянияЗаказаКонтрагента.ЗаказаноПоставщику Тогда
		Возврат "пр";	
	ИначеЕсли Состояние=Перечисления.СостоянияЗаказаКонтрагента.ВыполненЧастично Тогда
		Возврат "вч";
	ИначеЕсли Состояние=Перечисления.СостоянияЗаказаКонтрагента.Выполнен Тогда
		Возврат "в";
	Иначе
		Возврат "н/у";		
	КонецЕсли;
	
КонецФункции //глБукваСостоянияНакладной(ТекущийДокумент)

//крохин конец 08.10.2020

//ЗАКЛАДКИ В СПРАВОЧНИКАХ
Процедура УстановитьОтборПоВладельцу(Форма) Экспорт
	Список=Форма.ЭлементыФормы.Список.Значение;
	Дерево=Форма.ЭлементыФормы.Дерево.Значение;
	
	Владелец=Форма.ЭлементыФормы.Панель.ТекущаяСтраница.Значение;
	
	ОтборПоВладельцу=Список.Отбор.Владелец;
	
	ОтборПоВладельцу.ВидСравнения	=ВидСравнения.Равно;
	ОтборПоВладельцу.Значение		=Владелец;
	ОтборПоВладельцу.Использование	=Истина;
	
	ОтборПоВладельцу=Дерево.Отбор.Владелец;
	
	ОтборПоВладельцу.ВидСравнения	=ВидСравнения.Равно;
	ОтборПоВладельцу.Значение		=Владелец;
	ОтборПоВладельцу.Использование	=Истина;
КонецПроцедуры

Процедура УстановитьЗакладкиПоВладельцам(Форма) Экспорт
	ТекущаяСтраница			=Неопределено;
	Панель					=Форма.ЭлементыФормы.Панель;
	НачальноеЗначениеВыбора	=Форма.НачальноеЗначениеВыбора;
	Если НачальноеЗначениеВыбора=Неопределено Тогда
		НачальноеЗначениеВыбора=Форма.ПараметрТекущаяСтрока;
	КонецЕсли; 
	ПараметрОтборПоВладельцу=Форма.ПараметрОтборПоВладельцу;	
	
	ЕстьОтборПоВладельцу=Истина;
	Если НачальноеЗначениеВыбора<>Неопределено И НЕ НачальноеЗначениеВыбора.Пустая()  Тогда
		ТекВладелец=НачальноеЗначениеВыбора.Владелец;
	ИначеЕсли ПараметрОтборПоВладельцу<>Неопределено И НЕ ПараметрОтборПоВладельцу.Пустая() Тогда
		ТекВладелец=ПараметрОтборПоВладельцу;		
	Иначе
		ТекВладелец=ПолучитьИБПоУмолчанию();		
		ЕстьОтборПоВладельцу=Ложь;
	КонецЕсли; 
	
	ЗначенияОтбора=Новый ТаблицаЗначений;
	ЗначенияОтбора.Колонки.Добавить("ЗначениеОтбора");
	
	Если Форма.РежимВыбора И ЕстьОтборПоВладельцу И НЕ РольДоступна("Администратор") Тогда
		Форма.ЭлементыФормы.Список.НастройкаОтбора.Владелец.Доступность=Ложь;
		СтрокаОтбора=ЗначенияОтбора.Добавить();
		СтрокаОтбора.ЗначениеОтбора=ТекВладелец;
	Иначе
		Вид=Метаданные.НайтиПоТипу(ТипЗнч(Форма.Список)).Имя;
		
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Владелец КАК ЗначениеОтбора,
		|	Владелец.Наименование КАК ВладелецНаименование
		|ИЗ
		|	Справочник."+Вид+" КАК Справочник
		|УПОРЯДОЧИТЬ ПО	ВладелецНаименование";
		
		ЗначенияОтбора=Запрос.Выполнить().Выгрузить();		
	КонецЕсли; 
	
	Для Каждого Строка Из ЗначенияОтбора Цикл	
		Если ЗначенияОтбора.Индекс(Строка)=0 Тогда
			Страница=Панель.Страницы.Начальная;			
		Иначе			
			Страница=Панель.Страницы.Добавить("Владелец__"+ЗначенияОтбора.Индекс(Строка));		
		КонецЕсли;
		
		Страница.Заголовок	=""+Строка.ЗначениеОтбора;
		Страница.Значение	=Строка.ЗначениеОтбора;
		
		Если ТекВладелец=Строка.ЗначениеОтбора Тогда
			ТекущаяСтраница=Страница;
		КонецЕсли;
	КонецЦикла;
	
	Если ТекущаяСтраница<>Неопределено Тогда
		Панель.ТекущаяСтраница=ТекущаяСтраница;
		УстановитьОтборПоВладельцу(Форма);		
	КонецЕсли;	
	                          
	//Если Форма.ЭлементыФормы.Список.ТекущаяСтрока <> Неопределено Тогда
	Форма.ЭлементыФормы.Список.ИерархическийПросмотр = Ложь;
	Форма.ЭлементыФормы.Список.ИерархическийПросмотр = Истина;
	//КонецЕсли;
	
КонецПроцедуры


// ОТБОРЫ В ЖУРНАЛАХ
Процедура УстановитьОтборЖурнала(Форма, ЭлементыОтбора = Неопределено, ПоляМножественногоОтбора = Неопределено, ПоляГрупповогоОтбора = Неопределено) Экспорт
	
	ЭлементыМножественногоОтбора = Новый СписокЗначений;
	
	Если ЭлементыОтбора <> Неопределено Тогда // Шворобей ВЮ 02.04.2024 ++ Добавил условие
		Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
			
			ИмяЭлементаОтбора=ЭлементОтбора.Ключ;
			
			ТекЗначение = ЭлементОтбора.Значение;
			
			Если НЕ ЗначениеЗаполнено(ТекЗначение) Тогда
				ТекЗначение = Форма.ЭлементыФормы[ИмяЭлементаОтбора].Значение;
			КонецЕсли;
			
			Если ИмяЭлементаОтбора = "ВидДокумента" И НЕ ЗначениеНеЗаполнено(ТекЗначение) Тогда
				ТекЗначение = Метаданные.Документы[ТекЗначение];		
			КонецЕсли; 
			
			Если ПоляМножественногоОтбора <> Неопределено И ПоляМножественногоОтбора.Свойство(ИмяЭлементаОтбора) Тогда
				Если НЕ ЗначениеНеЗаполнено(ТекЗначение)  Тогда
					ЭлементыМножественногоОтбора.Добавить(ТекЗначение);
				КонецЕсли;			
			Иначе
				ЭлементОтбора=Форма.Список.Отбор[ИмяЭлементаОтбора];
				
				Если ЗначениеНеЗаполнено(ТекЗначение) Тогда
					ЭлементОтбора.Использование=Ложь;
				Иначе			
					ЭлементОтбора.ВидСравнения	=ВидСравнения.Равно;
					
					Если ТипОбъекта(ТекЗначение)="Справочник" И ТекЗначение.ЭтоГруппа И ПоляГрупповогоОтбора<>Неопределено И ПоляГрупповогоОтбора.Свойство(ИмяЭлементаОтбора) Тогда
						ЭлементОтбора.ВидСравнения	=ВидСравнения.ВИерархии;				
					КонецЕсли; 
					
					Если ТипЗнч(ЭлементОтбора.Значение)=Тип("Булево") И ТипЗнч(ТекЗначение)=Тип("Число") Тогда
						Если ТекЗначение=0 Тогда
							ЭлементОтбора.Установить(Ложь,Истина);
						ИначеЕсли ТекЗначение=1 Тогда
							ЭлементОтбора.Установить(Истина,Истина);
						Иначе
							ЭлементОтбора.Установить(Ложь,Ложь);						
						КонецЕсли;				
					Иначе
						// Кухарь А.Ю.  07.05.2026 начало
						// HELP-9700  
						//ЭлементОтбора.Значение		= ТекЗначение;									
						//ЭлементОтбора.Использование	= Истина;						
						Если Форма.КлючУникальности = "ЛистыПереукладки" тогда
							если ТипЗнч(ТекЗначение)<>Тип("ДокументСсылка.РасходнаяНакладная") Тогда
								ЭлементОтбора.Значение		= Документы.РасходнаяНакладная.ПустаяСсылка();									
								ЭлементОтбора.Использование	= Истина;	
								ЭлементОтбораДата = Форма.Список.Отбор["Дата"];
								ЭлементОтбораДата.Значение 	= ТекущаяДата();
								ЭлементОтбораДата.Использование = Истина;  
							иначе               
								ЭлементОтбора.Значение		= ТекЗначение;									
								ЭлементОтбора.Использование	= Истина;	
								ЭлементОтбораДата = Форма.Список.Отбор["Дата"];
								ЭлементОтбораДата.Использование = ложь;  							
							КонецЕсли;		
						иначе
							ЭлементОтбора.Значение		= ТекЗначение;									
							ЭлементОтбора.Использование	= Истина;
						КонецЕсли;	
						// Кухарь А.Ю.  07.05.2026 конец	
							
					КонецЕсли;				
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Шворобей ВЮ 02.04.2024 ++  Переделал, было не работоспособно
	ИмяЭлементаОтбора = Неопределено;
	Если ПоляМножественногоОтбора <> Неопределено Тогда
		
		Для Каждого ПолеМО ИЗ ПоляМножественногоОтбора Цикл
			ИмяЭлементаОтбора = ПолеМО.Ключ;
			ИмяПоляМножественногоОтбора = ПолеМО.Значение;
			Прервать;
		КонецЦикла;
		
		Если ИмяЭлементаОтбора = Неопределено Тогда Возврат КонецЕсли;
		
		Если ПустаяСтрока(ИмяПоляМножественногоОтбора) Тогда
			ИмяПоляМножественногоОтбора = "Список" + ИмяЭлементаОтбора;
		КонецЕсли;
			
		ЗначениеМножественногоОтбора = Форма.ЭлементыФормы[ИмяПоляМножественногоОтбора].Значение;
			
		Для Каждого ТекЭлементОтбора ИЗ ЗначениеМножественногоОтбора Цикл
			Если ЗначениеЗаполнено(ТекЭлементОтбора.Значение) И ЭлементыМножественногоОтбора.НайтиПоЗначению(ТекЭлементОтбора.Значение) = Неопределено Тогда
				ЭлементыМножественногоОтбора.Добавить(ТекЭлементОтбора.Значение);
			КонецЕсли;
		КонецЦикла;
		
		ЭлементОтбора = Форма.Список.Отбор[ИмяЭлементаОтбора];
		
		Если ЭлементыМножественногоОтбора.Количество() = 0 Тогда
			ЭлементОтбора.Использование = Ложь;			
		Иначе
			ЭлементОтбора.ВидСравнения	= ВидСравнения.ВСписке;
			ЭлементОтбора.Значение		= ЭлементыМножественногоОтбора;		
			ЭлементОтбора.Использование	= Истина;
		КонецЕсли;
	КонецЕсли;
	// Шворобей ВЮ 02.04.2024 ++
	
	//кухарь 31.03.15 начало
	Если ПоляГрупповогоОтбора <> Неопределено тогда
		Для каждого ПолеГО из ПоляГрупповогоОтбора Цикл
			Попытка
				ИмяЭлементаОтбора = ПолеГО.ключ;
				Если ИмяЭлементаОтбора = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ЭлементОтбора = Форма.Список.Отбор[ИмяЭлементаОтбора];	
				Если ЭлементОтбора.ВидСравнения = ВидСравнения.ВСписке Тогда
					ЭлементОтбора.ВидСравнения = ВидСравнения.ВСпискеПоИерархии;
				ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравнения.Равно Тогда
					ЭлементОтбора.ВидСравнения = ВидСравнения.ВИерархии;
				КонецЕсли;		
			Исключение
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	//кухарь 31.03.15 конец
	
КонецПроцедуры

Функция ПолучитьУстановкиОтбора(Форма,ЭлементыОтбора) Экспорт
	УстановкиОтбора=Новый Соответствие;
	
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		ЗначениеОтбора=Форма[ЭлементОтбора.Ключ];
		
		Если НЕ ЗначениеНеЗаполнено(ЗначениеОтбора) Тогда
			УстановкиОтбора.Вставить(ЭлементОтбора.Ключ,ЗначениеОтбора);
		КонецЕсли;	
	КонецЦикла;
	
	Возврат УстановкиОтбора;
КонецФункции // ПолучитьУстакновкиОтбора()

Функция ПолучитьРеквизитДокумента(ДокСсылка,ИмяЭлементаОтбора) Экспорт
	ВидДокумента=ДокСсылка.Метаданные().Имя;
	
	Если ИмяЭлементаОтбора="ВидДокумента" Тогда
		Возврат ВидДокумента;	
	ИначеЕсли ИмяЭлементаОтбора="Получатель" Тогда
		Если ВидДокумента="Перемещение" Тогда		
			Возврат ДокСсылка.СкладПолучатель;
		Иначе
			Возврат ДокСсылка.Контрагент;
		КонецЕсли; 
	Иначе
		Если ДокСсылка.Метаданные().Реквизиты.Найти(ИмяЭлементаОтбора)<>Неопределено Тогда
			Возврат ДокСсылка[ИмяЭлементаОтбора];
		Иначе
			Возврат Неопределено;
		КонецЕсли; 		
	КонецЕсли;
КонецФункции // ПолучитьЗначениеЭлементаОтбораДокумента()

Процедура УстановитьЭлементыОтбораПоДокументу(Форма,ЭлементыОтбора,ДокСсылка,ПоляМножественногоОтбора=Неопределено) Экспорт
	ПереустановитьОтбор=Ложь;
	ЭлементыМножественногоОтбора=Новый СписокЗначений;
	
	УстановкиОтбора	=ПолучитьУстановкиОтбора(Форма,ЭлементыОтбора);
	МетаДок			=ДокСсылка.Метаданные();	
	
	Для Каждого ЭлементОтбора Из УстановкиОтбора Цикл		
		ИмяЭлементаОтбора	=ЭлементОтбора.Ключ;
		ЗначениеОтбора		=ЭлементОтбора.Значение;
		
		Если ЗначениеНеЗаполнено(ЗначениеОтбора) Тогда Продолжить КонецЕсли; 
		
		Если ПоляМножественногоОтбора<>Неопределено И ПоляМножественногоОтбора.Свойство(ИмяЭлементаОтбора) Тогда
			Если Не ЗначениеНеЗаполнено(ЗначениеОтбора) Тогда				
				ЭлементыМножественногоОтбора.Добавить(ЗначениеОтбора,ИмяЭлементаОтбора);			
			КонецЕсли;		
		Иначе
			Если ЗначениеНеЗаполнено(ЗначениеОтбора) Тогда Продолжить КонецЕсли; 
			//Если НЕ ЕстьРеквизитДокумента(ИмяЭлементаОтбора,МетаДок) Тогда Продолжить КонецЕсли; 
			
			РеквизитДокумента=ПолучитьРеквизитДокумента(ДокСсылка,ИмяЭлементаОтбора);
			Если РеквизитДокумента<>ЗначениеОтбора Тогда
				Форма[ИмяЭлементаОтбора]=РеквизитДокумента;				
				ПереустановитьОтбор=Истина;
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла;
	
	Если ПоляМножественногоОтбора<>Неопределено Тогда
		Для Каждого ПолеМО ИЗ ПоляМножественногоОтбора Цикл
			ИмяЭлементаОтбора=ПолеМО.Ключ;			
			Прервать;
		КонецЦикла;
		
		РеквизитДокумента=ПолучитьРеквизитДокумента(ДокСсылка,ИмяЭлементаОтбора);
		Если ЭлементыМножественногоОтбора.НайтиПоЗначению(РеквизитДокумента)=Неопределено Тогда
			Если НЕ ЗначениеНеЗаполнено(Форма[ИмяЭлементаОтбора]) Тогда
				Форма[ИмяЭлементаОтбора]=РеквизитДокумента;						
				ПереустановитьОтбор=Истина;			
			КонецЕсли;			
		КонецЕсли;	
	КонецЕсли; 
	
	Если ПереустановитьОтбор Тогда
		УстановитьОтборЖурнала(Форма,ЭлементыОтбора,ПоляМножественногоОтбора);	
	КонецЕсли; 
КонецПроцедуры  

//ЖУРНАЛИЗАЦИЯ
Функция ПолучитьСсылкуСписка(Список,ПустаяСсылка=Неопределено) Экспорт
	ТекДанные=Список.ТекущиеДанные;
	Если ТекДанные=Неопределено Тогда
		Возврат ПустаяСсылка;
	Иначе
		Возврат ТекДанные.Ссылка;	
	КонецЕсли; 
КонецФункции // ПолучитьСсылкуСписка()

Процедура ОткрытьЖурналРегистрации(Ссылка) Экспорт
	Если Константы.ИспользоватьВнешниеЛоги.Получить() Тогда
		ИмяФайла=Константы.КаталогВнешнихОтчетов.Получить()+"ПросмотрЖурналаРегистрации.epf";
		
		Файл=Новый Файл(ИмяФайла);
		Если Файл.Существует() Тогда
			Обработка=ВнешниеОбработки.Создать(ИмяФайла);
			
			Обработка.СсылкаНаОбъект=Ссылка;
			Обработка.ПолучитьФорму().Открыть();			
		ИначеЕсли Метаданные.Обработки.Найти("ПросмотрЖурналаРегистрации")<>Неопределено Тогда
			Обработка=Обработки.ПросмотрЖурналаРегистрации.Создать();
			
			Обработка.СсылкаНаОбъект=Ссылка;
			Обработка.ПолучитьФорму().Открыть();	
		КонецЕсли;	
	Иначе
		Форма=РегистрыСведений.ЖурналРегистрации.ПолучитьФормуСписка();
		Форма.СсылкаНаОбъект=Ссылка;
		Форма.Открыть();	
	КонецЕсли;	
КонецПроцедуры

Процедура ОткрытьЖурналРассогласований(Ссылка) Экспорт
	Форма=РегистрыСведений.РассогласованияОбъектов.ПолучитьФормуСписка();
	Форма.СсылкаНаОбъект=Ссылка;
	Форма.Открыть();
КонецПроцедуры

// Кухарь А.Ю.  02.05.2023 конец
//Процедура ПолучитьОстатки(СписокНоменклатуры,Склад,Накладная,КэшОстатков, ФлагФизСклад = Ложь) Экспорт 
Процедура ПолучитьОстатки(СписокНоменклатуры,Склад,МасивНакладных,КэшОстатков, ФлагФизСклад = Ложь,МассивДополнительныхСкладов=Неопределено) Экспорт
// Кухарь А.Ю.  02.05.2023 конец

	
	Если СписокНоменклатуры.ВГраница()<0 Тогда Возврат КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Склад) Тогда Возврат КонецЕсли;
	
	МассивСкладов = Новый Массив();
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	Сводный.Номенклатура.Код77 КАК Код77,
	|	Сводный.Номенклатура КАК Номенклатура,
	|	СУММА(Сводный.Остаток) КАК Остаток,
	|	СУММА(Сводный.Резерв) КАК Резерв,
	|	СУММА(Сводный.ВиртуальныйРезерв) КАК ВиртуальныйРезерв
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЕСТЬNULL(Остатки.Номенклатура, Резервы.Номенклатура) КАК Номенклатура,
	|		ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК Остаток,
	|		ЕСТЬNULL(Резервы.КоличествоОстаток, 0) КАК Резерв,
	|		0 КАК ВиртуальныйРезерв
	|	ИЗ
	|		РегистрНакопления.ОстаткиТМЦ.Остатки(
	|				,
	|				Склад В (&МассивСкладов)
	|					И Номенклатура В (&СписокНоменклатуры)) КАК Остатки
	|			ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	|					,
	|					Склад В (&МассивСкладов)
	|						И Номенклатура В (&СписокНоменклатуры)) КАК Резервы
	|			ПО Остатки.Номенклатура = Резервы.Номенклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОстаткиТМЦ.Номенклатура,
	|		ОстаткиТМЦ.Количество,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ
	|	ГДЕ
	|		ОстаткиТМЦ.Регистратор в (&Регистратор)
	|		И ОстаткиТМЦ.Склад В(&МассивСкладов)
	|		И ОстаткиТМЦ.ВидДвижения = &Расход
	|		И ОстаткиТМЦ.Номенклатура В(&СписокНоменклатуры)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РезервыТМЦ.Номенклатура,
	|		0,
	|		-РезервыТМЦ.Количество,
	|		0
	|	ИЗ
	|		РегистрНакопления.РезервыТМЦ КАК РезервыТМЦ
	|	ГДЕ
	|		РезервыТМЦ.Регистратор В (&Регистратор)
	|		И РезервыТМЦ.Склад В(&МассивСкладов)
	|		И РезервыТМЦ.Номенклатура В(&СписокНоменклатуры)) КАК Сводный
	|
	|СГРУППИРОВАТЬ ПО
	|	Сводный.Номенклатура,
	|	Сводный.Номенклатура.Код77
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сводный.Номенклатура";
	
	Запрос.УстановитьПараметр("Расход",ВидДвиженияНакопления.Расход);	
	Запрос.УстановитьПараметр("Регистратор",МасивНакладных);
	Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
	
	//Кухарь 02.03.18 начало
	Если НЕ Склад.ФизическийСклад.Пустая() И ПараметрыСеанса.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение и склад.ВидСклада<>Перечисления.ВидСклада.ВиртуальныйДляСклада Тогда
		//Кухарь 02.03.18 конец
		МассивСкладов.Добавить(Склад.ФизическийСклад);				
	Иначе
		МассивСкладов.Добавить(Склад);				
	КонецЕсли;
	
	// Кухарь А.Ю.  02.05.2023 начало
	если МассивДополнительныхСкладов<>Неопределено тогда
		для каждого СтрМасс из МассивДополнительныхСкладов цикл
			МассивСкладов.Добавить(СтрМасс);
		КонецЦикла;
	КонецЕсли;
	// Кухарь А.Ю.  02.05.2023 конец
	
	
	
	Если ФлагФизСклад И НЕ Склад.ФизическийСклад.Пустая() Тогда
		МассивСкладов.Добавить(Склад.ФизическийСклад);
	КонецЕсли;
	Запрос.УстановитьПараметр("МассивСкладов", МассивСкладов);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл	
		КэшОстатков.Вставить(Выборка.Номенклатура,Новый Структура("Остаток,Резерв,СвободныйОстаток,Код77",Выборка.Остаток,Выборка.Резерв,Макс(0,Выборка.Остаток-Выборка.Резерв-Выборка.ВиртуальныйРезерв),Выборка.Код77));	
	КонецЦикла;
	
КонецПроцедуры 
//крохин начало

//крохин начало
Процедура ПолучитьОстаткиСкладОтветственногоХранения(СписокНоменклатуры,Склад,Накладная,КэшОстатков) Экспорт	
	Если СписокНоменклатуры.ВГраница()<0 Тогда Возврат КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Склад) Тогда Возврат КонецЕсли; 
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Номенклатура.Код77 КАК Код77,
	|	Номенклатура,
	|	СУММА(Остаток) КАК Остаток,
	|	СУММА(Резерв) КАК Резерв,
	|	СУММА(ВиртуальныйРезерв) КАК ВиртуальныйРезерв
	|ИЗ
	|(
	|ВЫБРАТЬ
	|	ЕстьNULL(Остатки.Номенклатура,Резервы.Номенклатура) КАК Номенклатура,
	|	ЕстьNULL(Остатки.КоличествоОстаток,0) КАК Остаток,
	|	ЕстьNULL(Резервы.КоличествоОстаток,0) КАК Резерв,
	//|	ЕстьNULL(ВиртуальныеРезервы.КоличествоОстаток,0) КАК ВиртуальныйРезерв
	|	0									  КАК ВиртуальныйРезерв
	|ИЗ
	//крохин начало 20.10.2011
	//складов ответственного хранения теперь несколько
	//|	РегистрНакопления.ОстаткиТМЦ.Остатки(,(Склад = &Склад ИЛИ Склад = &СкладОтветственногоХранения) И Номенклатура В (&СписокНоменклатуры)) КАК Остатки
	//|ПОЛНОЕ СОЕДИНЕНИЕ
	//|	РегистрНакопления.РезервыТМЦ.Остатки(,(Склад = &Склад ИЛИ Склад = &СкладОтветственногоХранения) И Номенклатура В (&СписокНоменклатуры)) КАК Резервы
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(,(Склад = &Склад ИЛИ Склад В (&СкладыОтветственногоХранения)) И Номенклатура В (&СписокНоменклатуры)) КАК Остатки
	|ПОЛНОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.РезервыТМЦ.Остатки(,(Склад = &Склад ИЛИ Склад В (&СкладыОтветственногоХранения)) И Номенклатура В (&СписокНоменклатуры)) КАК Резервы
	|ПО  Остатки.Номенклатура=Резервы.Номенклатура
	//крохин конец 20.10.2011
	
	//|ПОЛНОЕ СОЕДИНЕНИЕ
	//|	РегистрНакопления.РезервыТМЦ.Остатки(,Склад = &Склад И НЕ Заказ ССЫЛКА Документ.ВиртуальныйРезерв И Номенклатура В (&СписокНоменклатуры)) КАК Резервы
	//|ПО  Остатки.Номенклатура=Резервы.Номенклатура
	//|ПОЛНОЕ СОЕДИНЕНИЕ
	//|	РегистрНакопления.РезервыТМЦ.Остатки(,Склад = &Склад И Заказ ССЫЛКА Документ.ВиртуальныйРезерв И Получатель<>&ВиртуальныйСклад И Номенклатура В (&СписокНоменклатуры)) КАК ВиртуальныеРезервы
	//|ПО  Остатки.Номенклатура=ВиртуальныеРезервы.Номенклатура
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Номенклатура,	
	|	Количество КАК Остаток,
	|	0 КАК Резерв,
	|	0 КАК ВиртуальныйРезерв
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ
	|ГДЕ
	|	Регистратор 	= &Регистратор
	//крохин начало 20.10.2011
	//складов ответственного хранения теперь несколько
	//|	И (Склад = &Склад ИЛИ Склад = &СкладОтветственногоХранения)
	|	И (Склад = &Склад ИЛИ Склад В (&СкладыОтветственногоХранения))
	//крохин конец 20.10.2011
	|	И ВидДвижения 	= &Расход	
	|	И Номенклатура В (&СписокНоменклатуры)
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Номенклатура,	
	|	0 КАК Остаток,
	|	-Количество КАК Резерв,
	|	0 КАК ВиртуальныйРезерв
	|ИЗ	
	|	РегистрНакопления.РезервыТМЦ КАК РезервыТМЦ
	|ГДЕ 	
	|	Регистратор	= &Регистратор
	//крохин начало 20.10.2011
	//складов ответственного хранения теперь несколько
	//|	И (Склад = &Склад ИЛИ Склад = &СкладОтветственногоХранения)
	|	И (Склад = &Склад ИЛИ Склад В (&СкладыОтветственногоХранения))
	//крохин конец 20.10.2011
	|	И Номенклатура В (&СписокНоменклатуры)
	|) КАК Сводный
	|СГРУППИРОВАТЬ ПО Номенклатура
	|УПОРЯДОЧИТЬ ПО Номенклатура";
	
	Запрос.УстановитьПараметр("Расход",ВидДвиженияНакопления.Расход);	
	Запрос.УстановитьПараметр("Регистратор",Накладная);
	Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
	
	//Если Склад.ФизическийСклад.Пустая() Тогда
	//	Запрос.УстановитьПараметр("Склад",						Склад);		
	//	Запрос.УстановитьПараметр("ВиртуальныйСклад",			Неопределено);				
	//Иначе
	//	Запрос.УстановитьПараметр("Склад",						Склад.ФизическийСклад);
	//	Запрос.УстановитьПараметр("ВиртуальныйСклад",			Склад);
	//КонецЕсли;
	
	Если НЕ Склад.ФизическийСклад.Пустая() И ПараметрыСеанса.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		Запрос.УстановитьПараметр("Склад",	Склад.ФизическийСклад);				
	Иначе
		Запрос.УстановитьПараметр("Склад",	Склад);				
	КонецЕсли; 
	//Запрос.УстановитьПараметр("ВиртуальныйСклад",				Неопределено);
	//крохин начало 20.10.2011
	//складов ответственного хранения теперь несколько
	
	//	Запрос.УстановитьПараметр("СкладОтветственногоХранения",Справочники.Склады.НайтиПоКоду("SMN-39")); //Склад ответственного хранения (ODK) 
	ВыборкаСкладов = Справочники.Склады.Выбрать(,,Новый Структура("ТипСклада",Перечисления.ТипСклада.ПалетноеХранение),);
	СписокСкладов = Новый СписокЗначений;
	Пока  ВыборкаСкладов.Следующий() Цикл
		СписокСкладов.Добавить(ВыборкаСкладов.Ссылка);	
	КонецЦикла;
	Запрос.УстановитьПараметр("СкладыОтветственногоХранения",СписокСкладов);
	//крохин конец
	Выборка=Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл	
		КэшОстатков.Вставить(Выборка.Номенклатура,Новый Структура("Остаток,Резерв,СвободныйОстаток,Код77",Выборка.Остаток,Выборка.Резерв,Макс(0,Выборка.Остаток-Выборка.Резерв-Выборка.ВиртуальныйРезерв),Выборка.Код77));	
	КонецЦикла; 
КонецПроцедуры 
//крохин конец

//крохин начало 15.12.2021
Процедура ПолучитьОстаткиПоСпискуСкладов(СписокНоменклатуры,СписокСкладов,Накладная,КэшОстатков) Экспорт	
	Если СписокНоменклатуры.ВГраница()<0 Тогда Возврат КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(СписокСкладов) Тогда Возврат КонецЕсли; 
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Номенклатура.Код77 КАК Код77,
	|	Номенклатура,
	|	СУММА(Остаток) КАК Остаток,
	|	СУММА(Резерв) КАК Резерв,
	|	СУММА(ВиртуальныйРезерв) КАК ВиртуальныйРезерв
	|ИЗ
	|(
	|ВЫБРАТЬ
	|	ЕстьNULL(Остатки.Номенклатура,Резервы.Номенклатура) КАК Номенклатура,
	|	ЕстьNULL(Остатки.КоличествоОстаток,0) КАК Остаток,
	|	ЕстьNULL(Резервы.КоличествоОстаток,0) КАК Резерв,
	//|	ЕстьNULL(ВиртуальныеРезервы.КоличествоОстаток,0) КАК ВиртуальныйРезерв
	|	0									  КАК ВиртуальныйРезерв
	|ИЗ
	//крохин начало 20.10.2011
	//складов ответственного хранения теперь несколько
	//|	РегистрНакопления.ОстаткиТМЦ.Остатки(,(Склад = &Склад ИЛИ Склад = &СкладОтветственногоХранения) И Номенклатура В (&СписокНоменклатуры)) КАК Остатки
	//|ПОЛНОЕ СОЕДИНЕНИЕ
	//|	РегистрНакопления.РезервыТМЦ.Остатки(,(Склад = &Склад ИЛИ Склад = &СкладОтветственногоХранения) И Номенклатура В (&СписокНоменклатуры)) КАК Резервы
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(,(Склад = &Склад ИЛИ Склад В (&СкладыОтветственногоХранения)) И Номенклатура В (&СписокНоменклатуры)) КАК Остатки
	|ПОЛНОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.РезервыТМЦ.Остатки(,(Склад = &Склад ИЛИ Склад В (&СкладыОтветственногоХранения)) И Номенклатура В (&СписокНоменклатуры)) КАК Резервы
	|ПО  Остатки.Номенклатура=Резервы.Номенклатура
	//крохин конец 20.10.2011
	
	//|ПОЛНОЕ СОЕДИНЕНИЕ
	//|	РегистрНакопления.РезервыТМЦ.Остатки(,Склад = &Склад И НЕ Заказ ССЫЛКА Документ.ВиртуальныйРезерв И Номенклатура В (&СписокНоменклатуры)) КАК Резервы
	//|ПО  Остатки.Номенклатура=Резервы.Номенклатура
	//|ПОЛНОЕ СОЕДИНЕНИЕ
	//|	РегистрНакопления.РезервыТМЦ.Остатки(,Склад = &Склад И Заказ ССЫЛКА Документ.ВиртуальныйРезерв И Получатель<>&ВиртуальныйСклад И Номенклатура В (&СписокНоменклатуры)) КАК ВиртуальныеРезервы
	//|ПО  Остатки.Номенклатура=ВиртуальныеРезервы.Номенклатура
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Номенклатура,	
	|	Количество КАК Остаток,
	|	0 КАК Резерв,
	|	0 КАК ВиртуальныйРезерв
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ
	|ГДЕ
	|	Регистратор 	= &Регистратор
	//крохин начало 20.10.2011
	//складов ответственного хранения теперь несколько
	//|	И (Склад = &Склад ИЛИ Склад = &СкладОтветственногоХранения)
	|	И (Склад = &Склад ИЛИ Склад В (&СкладыОтветственногоХранения))
	//крохин конец 20.10.2011
	|	И ВидДвижения 	= &Расход	
	|	И Номенклатура В (&СписокНоменклатуры)
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Номенклатура,	
	|	0 КАК Остаток,
	|	-Количество КАК Резерв,
	|	0 КАК ВиртуальныйРезерв
	|ИЗ	
	|	РегистрНакопления.РезервыТМЦ КАК РезервыТМЦ
	|ГДЕ 	
	|	Регистратор	= &Регистратор
	//крохин начало 20.10.2011
	//складов ответственного хранения теперь несколько
	//|	И (Склад = &Склад ИЛИ Склад = &СкладОтветственногоХранения)
	|	И (Склад = &Склад ИЛИ Склад В (&СкладыОтветственногоХранения))
	//крохин конец 20.10.2011
	|	И Номенклатура В (&СписокНоменклатуры)
	|) КАК Сводный
	|СГРУППИРОВАТЬ ПО Номенклатура
	|УПОРЯДОЧИТЬ ПО Номенклатура";
	
	Запрос.УстановитьПараметр("Расход",ВидДвиженияНакопления.Расход);	
	Запрос.УстановитьПараметр("Регистратор",Накладная);
	Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
	
	//Если Склад.ФизическийСклад.Пустая() Тогда
	//	Запрос.УстановитьПараметр("Склад",						Склад);		
	//	Запрос.УстановитьПараметр("ВиртуальныйСклад",			Неопределено);				
	//Иначе
	//	Запрос.УстановитьПараметр("Склад",						Склад.ФизическийСклад);
	//	Запрос.УстановитьПараметр("ВиртуальныйСклад",			Склад);
	//КонецЕсли;
	
	//Если НЕ Склад.ФизическийСклад.Пустая() И ПараметрыСеанса.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
	//	Запрос.УстановитьПараметр("Склад",	Склад.ФизическийСклад);				
	//Иначе
	//	Запрос.УстановитьПараметр("Склад",	Склад);				
	//КонецЕсли; 
	Запрос.УстановитьПараметр("Склад",Накладная.Склад);
	//Запрос.УстановитьПараметр("ВиртуальныйСклад",				Неопределено);
	//крохин начало 20.10.2011
	//складов ответственного хранения теперь несколько
	
	//	Запрос.УстановитьПараметр("СкладОтветственногоХранения",Справочники.Склады.НайтиПоКоду("SMN-39")); //Склад ответственного хранения (ODK) 
	//ВыборкаСкладов = Справочники.Склады.Выбрать(,,Новый Структура("ТипСклада",Перечисления.ТипСклада.ПалетноеХранение),);
	//СписокСкладов = Новый СписокЗначений;
	//Пока  ВыборкаСкладов.Следующий() Цикл
	//	СписокСкладов.Добавить(ВыборкаСкладов.Ссылка);	
	//КонецЦикла;
	Запрос.УстановитьПараметр("СкладыОтветственногоХранения",СписокСкладов);
	//крохин конец
	Выборка=Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл	
		КэшОстатков.Вставить(Выборка.Номенклатура,Новый Структура("Остаток,Резерв,СвободныйОстаток,Код77",Выборка.Остаток,Выборка.Резерв,Макс(0,Выборка.Остаток-Выборка.Резерв-Выборка.ВиртуальныйРезерв),Выборка.Код77));	
	КонецЦикла; 
КонецПроцедуры 
//крохин конец 15.12.2021


Функция ВыбратьВариантЗаполнения() Экспорт
	Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.Склад Тогда
		Возврат "РазницаСНабором";
	Иначе
		Меню=Новый СписокЗначений;
		Меню.Добавить("Целиком","Заполнить целиком по документу");
		Меню.Добавить("НехватающиеЗаявка","Заполнить недостающими позициями по заявке");		
		Меню.Добавить("НехватающиеПодтверждение","Заполнить недостающими позициями по подтвержденной заявке");		
		
		ВариантЗаполнения=Меню.ВыбратьЭлемент("Вариант заполнения");	
		Если ВариантЗаполнения=Неопределено Тогда
			Возврат "Целиком";	
		Иначе
			Возврат ВариантЗаполнения.Значение;
		КонецЕсли;	
	КонецЕсли;	
КонецФункции // ВыбратьВариантЗаполнения()



//ВНЕШНИЕ ОБРАБОТКИ В ИНТЕРФЕЙСЕ
Процедура ОткрытьОбменXML_Внешний() Экспорт
	Форма=ВнешниеОбработки.ПолучитьФорму(Константы.КаталогВнешнихОтчетов.Получить()+"УниверсальныйОбменДаннымиXML.epf",,,1);
	Форма.Открыть();
КонецПроцедуры

Процедура ОткрытьСравнениеСпецификаций() Экспорт
	Обработка=ПолучитьВнешнююОбработку("СравнениеСпецификаций.epf");
	Если Обработка=Неопределено Тогда Возврат КонецЕсли; 
	
	Обработка.ПолучитьФорму().Открыть();
КонецПроцедуры


//РАБОТА С КОМАНДНЫМИ ПАНЕЛЯМИ
Процедура УдалитьКнопкуПанели(Панель,ИмяКнопки) Экспорт
	Кнопка=Панель.Кнопки.Найти(ИмяКнопки);
	Если Кнопка<>Неопределено Тогда
		Панель.Кнопки.Удалить(Кнопка);
	КонецЕсли;
КонецПроцедуры

Процедура ОткрытьЖурналСкладские() Экспорт
	Форма=ЖурналыДокументов.Складские.ПолучитьФорму(,,Новый УникальныйИдентификатор);
	Форма.Открыть();
КонецПроцедуры

// Шворобей ВЮ 10.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5951 
Функция ПолучитьШКНоменклатуры(СписокНоменклатуры,КэшШтрихКодов) Экспорт
	
	Если СписокНоменклатуры.ВГраница()<0 Тогда Возврат Неопределено	КонецЕсли; 
	
	Если ТипЗнч(КэшШтрихКодов)<>Тип("ТаблицаЗначений") Тогда		
		КэшШтрихКодов = Новый ТаблицаЗначений;
		КэшШтрихКодов.Колонки.Добавить("Номенклатура");
		КэшШтрихКодов.Колонки.Добавить("ШтрихКод_Штука_Ссылка");
		КэшШтрихКодов.Колонки.Добавить("ШтрихКод_Штука_Значение");
		КэшШтрихКодов.Колонки.Добавить("ШтрихКод_Коробка_Ссылка");
		КэшШтрихКодов.Колонки.Добавить("ШтрихКод_Коробка_Значение");
		КэшШтрихКодов.Колонки.Добавить("ШтрихКод_Блочок_Ссылка");
		КэшШтрихКодов.Колонки.Добавить("ШтрихКод_Блочок_Значение");
		//Кухарь 08.07.19 начало
		//Новые колонки на форме номенклатуры
		КэшШтрихКодов.Колонки.Добавить("ШтрихКод_GS1_Ссылка");
		КэшШтрихКодов.Колонки.Добавить("ШтрихКод_GS1_Значение");
		//Кухарь 08.07.19 конец		
		
		//Кухарь  24.10.2024 начало
		КэшШтрихКодов.Колонки.Добавить("ШтрихКод_GS1_Rus_Ссылка");
		КэшШтрихКодов.Колонки.Добавить("ШтрихКод_GS1_Rus_Значение");
		//Кухарь  24.10.2024 конец
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ШтрихКоды.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	|			ТОГДА ШтрихКоды.Ссылка
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ШтрихКоды.ПустаяСсылка)
	|	КОНЕЦ КАК ШтрихКод_Штука_Ссылка,
	|	ВЫБОР
	|		КОГДА ШтрихКоды.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)
	|			ТОГДА ШтрихКоды.Ссылка
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ШтрихКоды.ПустаяСсылка)
	|	КОНЕЦ КАК ШтрихКод_Блочок_Ссылка,
	|	ВЫБОР
	|		КОГДА ШтрихКоды.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
	|			ТОГДА ШтрихКоды.Ссылка
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ШтрихКоды.ПустаяСсылка)
	|	КОНЕЦ КАК ШтрихКод_Коробка_Ссылка,
	|	ШтрихКоды.Владелец КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ШтрихКоды.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	|			ТОГДА ШтрихКоды.Наименование
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ШтрихКод_Штука_Значение,
	|	ВЫБОР
	|		КОГДА ШтрихКоды.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)
	|			ТОГДА ШтрихКоды.Наименование
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ШтрихКод_Блочок_Значение,
	|	ВЫБОР
	|		КОГДА ШтрихКоды.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
	|			ТОГДА ШтрихКоды.Наименование
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ШтрихКод_Коробка_Значение
	|ПОМЕСТИТЬ вр_ОсновныеШК
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.Владелец В(&СписокНоменклатуры)
	|	И ШтрихКоды.Наименование <> ""9999999999999""
	|	И НЕ ШтрихКоды.ПометкаУдаления
	|	И ШтрихКоды.ВидШК = ЗНАЧЕНИЕ(Перечисление.ВидыШК.Основной)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтрихКоды.Ссылка КАК ШтрихКод_GS1_Ссылка,
	|	ШтрихКоды.Владелец КАК Номенклатура,
	|	ШтрихКоды.Наименование КАК ШтрихКод_GS1_Значение
	|ПОМЕСТИТЬ вр_Описание
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.Владелец В(&СписокНоменклатуры)
	|	И (ВЫРАЗИТЬ(ШтрихКоды.Описание КАК СТРОКА(3))) = ""GS1""
	|	И НЕ ШтрихКоды.ПометкаУдаления
	|	И ШтрихКоды.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтрихКоды.Ссылка КАК ШтрихКод_GS1_Rus_Ссылка,
	|	ШтрихКоды.Владелец КАК Номенклатура,
	|	ШтрихКоды.Наименование КАК ШтрихКод_GS1_Rus_Значение
	|ПОМЕСТИТЬ вр_ШтрихкодыRus
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.Владелец В(&СписокНоменклатуры)
	|	И НЕ ШтрихКоды.ПометкаУдаления
	|	И ШтрихКоды.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	|	И ШтрихКоды.ЭтоКодGS1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_ОсновныеШК.Номенклатура КАК Номенклатура,
	|	вр_ОсновныеШК.ШтрихКод_Штука_Ссылка КАК ШтрихКод_Штука_Ссылка,
	|	вр_ОсновныеШК.ШтрихКод_Блочок_Ссылка КАК ШтрихКод_Блочок_Ссылка,
	|	вр_ОсновныеШК.ШтрихКод_Коробка_Ссылка КАК ШтрихКод_Коробка_Ссылка,
	|	вр_ОсновныеШК.ШтрихКод_Штука_Значение КАК ШтрихКод_Штука_Значение,
	|	вр_ОсновныеШК.ШтрихКод_Блочок_Значение КАК ШтрихКод_Блочок_Значение,
	|	вр_ОсновныеШК.ШтрихКод_Коробка_Значение КАК ШтрихКод_Коробка_Значение,
	|	вр_Описание.ШтрихКод_GS1_Ссылка КАК ШтрихКод_GS1_Ссылка,
	|	вр_Описание.ШтрихКод_GS1_Значение КАК ШтрихКод_GS1_Значение,
	|	вр_ШтрихкодыRus.ШтрихКод_GS1_Rus_Ссылка КАК ШтрихКод_GS1_Rus_Ссылка,
	|	вр_ШтрихкодыRus.ШтрихКод_GS1_Rus_Значение КАК ШтрихКод_GS1_Rus_Значение
	|ИЗ
	|	вр_ОсновныеШК КАК вр_ОсновныеШК
	|		ЛЕВОЕ СОЕДИНЕНИЕ вр_Описание КАК вр_Описание
	|		ПО вр_ОсновныеШК.Номенклатура = вр_Описание.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ вр_ШтрихкодыRus КАК вр_ШтрихкодыRus
	|		ПО вр_ОсновныеШК.Номенклатура = вр_ШтрихкодыRus.Номенклатура";
	
	УстановитьПривилегированныйРежим(Истина);
	тзВыборка = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Для Каждого Стр ИЗ тзВыборка Цикл
		
		СтрокаКэша = глНайтиВТаблице(КэшШтрихКодов, Стр.Номенклатура,"Номенклатура",Истина);
		
		Для Каждого Колонка из тзВыборка.Колонки Цикл
			Если ЗначениеЗаполнено(Стр[Колонка.Имя]) Тогда
				СтрокаКэша[Колонка.Имя] = Стр[Колонка.Имя];		
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла; 
	
КонецФункции // ПолучитьШКТоваров()
// Шворобей ВЮ 10.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5951 

Функция КоличествоПД(Контрагент) Экспорт
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ссылка) КАК Количество
		|ИЗ
		|	Справочник.ПунктыДоставки КАК ПунктыДоставки
		|ГДЕ
		|	Владелец = &Владелец";
		
		Запрос.УстановитьПараметр("Владелец",Контрагент);
		
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Количество;			
		КонецЕсли;		
	КонецЕсли;
	
	Возврат 0;
КонецФункции //КоличествоПД(Контрагент)

Процедура ПриВыбореСчетаВТабличномПоле(Счет,ДанныеСтроки,ЭлементСписок,ЭлементДиалогаСчет = НЕОПРЕДЕЛЕНО, ТолькоПросмотр = ЛОЖЬ) Экспорт
	//ПриВыбореСчетаВТабличномПоле(Элемент.Значение,ТекущиеДанные,ЭлементыФормы.Услуги);
	
	ЭлементыСубконто = Новый Структура;
	
	Для Сч=1 По 3 Цикл
		ЭлементыСубконто.Вставить("Субконто"				+Сч,ДанныеСтроки["Субконто"+Сч]);		
		ЭлементыСубконто.Вставить("ЭлементДиалогаСубконто"	+Сч,ЭлементСписок.Колонки["Субконто"+Сч]);
	КонецЦикла; 
	
	ЧислоАктивныхСубконто = Счет.ВидыСубконто.Количество();
	
	Для Сч = 1 По ЧислоАктивныхСубконто Цикл
		ТипСубк = Счет.ВидыСубконто[Сч - 1].ВидСубконто.ТипЗначения;
		
		ЭлементыСубконто["ЭлементДиалогаСубконто" + Сч].ТолькоПросмотр = ТолькоПросмотр;
		
		Если ТипЗнч(ЭлементыСубконто["ЭлементДиалогаСубконто" + Сч]) = Тип("ПолеВвода") Тогда
			ЭлементыСубконто["ЭлементДиалогаСубконто" + Сч].ВыбиратьТип = (ТипСубк.Типы().Количество() > 1);
		Иначе
			ЭлементыСубконто["ЭлементДиалогаСубконто" + Сч].ЭлементУправления.ВыбиратьТип = (ТипСубк.Типы().Количество() > 1);
		КонецЕсли; 
		
		// Чтобы не устанавливался флаг модифицированности при открытии формы
		Если ТипСубк.ПривестиЗначение(ЭлементыСубконто["Субконто" + Сч]) <> ЭлементыСубконто["Субконто" + Сч] Тогда
			ЭлементыСубконто["Субконто" + Сч] = ТипСубк.ПривестиЗначение(ЭлементыСубконто["Субконто" + Сч]);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Сч = (ЧислоАктивныхСубконто + 1) По 3 Цикл
		
		Если Не ЭлементыСубконто["Субконто" + Сч] = Неопределено Тогда
			ЭлементыСубконто["Субконто" + Сч] = Неопределено;
		КонецЕсли;
		
		ЭлементыСубконто["ЭлементДиалогаСубконто" + Сч].ТолькоПросмотр = Истина;
		
	КонецЦикла;
	
	Если ЭлементДиалогаСчет <> Неопределено Тогда
		ЭлементДиалогаСчет.ТолькоПросмотр = ТолькоПросмотр;
	КонецЕсли;
	
	Для Сч=1 По 3 Цикл
		Если ДанныеСтроки["Субконто"+Сч]<>ЭлементыСубконто["Субконто"+Сч] Тогда
			ДанныеСтроки["Субконто"+Сч]=ЭлементыСубконто["Субконто"+Сч]
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры


Функция СтрокаПериода(Дата,Периодичность,СНачалаГода=Ложь) Экспорт
	Если Периодичность=Перечисления.ПериодичностьОтчетов.День Тогда
		Возврат ПредставлениеПериода(?(СНачалаГода,НачалоГода(Дата),НачалоДня(Дата)),КонецДня(Дата),"ФП = Истина");		
	ИначеЕсли Периодичность=Перечисления.ПериодичностьОтчетов.Месяц Тогда
		Возврат ПредставлениеПериода(?(СНачалаГода,НачалоГода(Дата),НачалоМесяца(Дата)),КонецМесяца(Дата),"ФП = Истина");	
	ИначеЕсли Периодичность=Перечисления.ПериодичностьОтчетов.Квартал Тогда
		Возврат ПредставлениеПериода(?(СНачалаГода,НачалоГода(Дата),НачалоКвартала(Дата)),КонецКвартала(Дата),"ФП = Истина");		
	ИначеЕсли Периодичность=Перечисления.ПериодичностьОтчетов.Год Тогда
		Возврат ПредставлениеПериода(НачалоГода(Дата),КонецГода(Дата),"ФП = Истина");				
	КонецЕсли;
КонецФункции // СтрокаПериода()

//СВОЙСТВА В СПИСКАХ
Функция ПолучитьСвойство(СсылкаНаОбъект,ВидСвойства,Кэш=Неопределено) Экспорт
	ЗначениеСвойства= Неопределено;
	
	Если Кэш=Неопределено Тогда
		СтрокаСвойств=Кэш.Найти(СсылкаНаОбъект,"СсылкаНаОбъект");
	Иначе
		СтрокаСвойств=Неопределено;	
	КонецЕсли;	
	
	Если СтрокаСвойств=Неопределено Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Значение
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	Объект = &СсылкаНаОбъект
		|	И Свойство = &ВидСвойства";
		
		Запрос.УстановитьПараметр("СсылкаНаОбъект",	СсылкаНаОбъект);
		Запрос.УстановитьПараметр("ВидСвойства",	ВидСвойства);
		
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗначениеСвойства  = Выборка.Значение;		
		КонецЕсли;	
		
		Если Кэш<>Неопределено Тогда
			СтрокаКэша=Кэш.Добавить();				
			СтрокаКэша.СсылкаНаОбъект	= СсылкаНаОбъект;		
			СтрокаКэша.ЗначениеСвойства	= ЗначениеСвойства;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат ЗначениеСвойства;
КонецФункции

Процедура ПриИзмененииСвойстваВСписке(ЭУ,Список,ВидСвойства,Кэш=Неопределено) Экспорт	
	ВыбЗначение		= ЭУ.Значение;
	СсылкаНаОбъект	= Список.ТекущиеДанные.Ссылка;
	
	Если СсылкаНаОбъект=Неопределено ИЛИ СсылкаНаОбъект.Пустая() Тогда Возврат КонецЕсли; 
	
	ЗаписьСвойств=РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();	
	ЗаписьСвойств.Объект	=СсылкаНаОбъект;
	ЗаписьСвойств.Свойство  =ВидСвойства;
	ЗаписьСвойств.Значение	=ВыбЗначение;
	
	Если ВыбЗначение=Неопределено ИЛИ НЕ ЗначениеЗаполнено(ВыбЗначение) Тогда		
		ЗаписьСвойств.Удалить();
	Иначе
		ЗаписьСвойств.Записать();
	КонецЕсли;
	
	СтрокаСвойств=Кэш.Найти(СсылкаНаОбъект,"СсылкаНаОбъект");
	Если СтрокаСвойств<>Неопределено Тогда
		СтрокаСвойств.ЗначениеСвойства=ВыбЗначение;
	КонецЕсли;
	
	Список.ОбновитьСтроки();
КонецПроцедуры


Функция ДобавитьОбязательнуюКолонкуСписка(Список,ИмяКолонки) Экспорт
	Колонка=Список.Колонки.Найти(ИмяКолонки);
	Если Колонка=Неопределено Тогда
		Колонка=Список.Колонки.Добавить(ИмяКолонки,Ложь);
	Иначе
		Колонка.АвтоУдаление=Ложь;
	КонецЕсли; 	
КонецФункции

Процедура ВыбратьСтатьюДДС(Элемент,ВидСтатьи,СтандартнаяОбработка) Экспорт
	СтандартнаяОбработка=Ложь;	
	
	Форма=Справочники.СтатьиЗатрат.ПолучитьФормуВыбора("ФормаВыбораСФильтром",Элемент);
	Форма.фВидСтатей=ВидСтатьи;
	//Форма.РежимВыбора=Истина;
	
	Форма.Открыть();
КонецПроцедуры

Процедура УстановитьФильтрВыбораПеречисления(Элемент,ДоступныеЗначения)	Экспорт
	СтруктураИмен=Новый Структура(ДоступныеЗначения);
	МетаПер=Метаданные.НайтиПоТипу(Элемент.ТипЗначения.Типы()[0]);
	СписокДЗ=Элемент.ДоступныеЗначения;
	СписокДЗ.Очистить();
	
	Для Каждого Имя Из СтруктураИмен Цикл
		СписокДЗ.Добавить(Перечисления[МетаПер.Имя][Имя.Ключ]);		
	КонецЦикла;	
КонецПроцедуры
//крохин начало 28.03.2013 
//крохин начало 18.03.2013
//Процедура СообщитьИзМодуля(ТекстСообщения) Экспорт
//	#ЕСЛИ КЛИЕНТ ТОГДА
//	Сообщить(ТекстСообщения); 
//	#КОНЕЦЕСЛИ
//КонецПроцедуры    		 

//крохин конец 18.03.2013
//крохин конец 28.03.2013

Процедура ПоказатьДвижения(Форма) Экспорт
	Если РольДоступна("Администратор") Тогда
		мПараметры	= Новый Структура("ДокументСсылка",Форма.ЭтотОбъект.Ссылка);
		ОткрытьФорму("ОбщаяФорма.ФормаДвиженияДокумента",мПараметры,Форма);	
	КонецЕсли; 
КонецПроцедуры

//+SNL-91 20260120 Михайловский
Процедура НастроитьПодменюПечати1(Форма, ТипОбъекта=Неопределено, ВидОбъекта=Неопределено, Контрагент=неопределено) Экспорт 
	Тип=?(ТипОбъекта=Неопределено,ТипОбъекта(Форма.Ссылка),ТипОбъекта);
	Вид=?(ВидОбъекта=Неопределено,Форма.Метаданные().Имя,ВидОбъекта);
	ПодменюПечати	=Форма.ЭлементыФормы.ДействияФормы.Кнопки.ПодменюПечати;	
	ПодменюПечати.Кнопки.Очистить();
	ИмяПечатнойФормы=ВосстановитьЗначение(Тип+"."+Вид+"ИмяПечатнойФормы");	
	ИдКнопкиПоУмолчанию=Неопределено;
	СтрокаТПФПоУмолчанию=Неопределено;
	ТПФ		= ПолучитьТаблицуПечатныхФорм(Тип+"."+Вид);
	Для Каждого СтрокаТПФ Из ТПФ Цикл
		Кнопка=ПодменюПечати.Кнопки.Добавить(СтрокаТПФ.ИДКнопки,ТипКнопкиКоманднойПанели.Действие,СтрокаТПФ.Наименование,Новый Действие("ПечатьВнеш"));
		Кнопка.Пояснение=СтрокаТПФ.ИДКнопки;
		Кнопка.Доступность = Истина;
		Если СтрокаТПФ.Наименование=ИмяПечатнойФормы Тогда
			СтрокаТПФПоУмолчанию=СтрокаТПФ;			
		КонецЕсли;		
	КонецЦикла;
КонецПроцедуры

Процедура ВнешняяПечать1(Форма, Ссылка, Элемент, ДопПараметры=Неопределено) Экспорт
	КодВОО = Сред(СокрЛП(Элемент.Пояснение), 2);
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ВнешниеОтчеты.Код КАК Код,
	|	ВнешниеОтчеты.Наименование КАК Наименование,
	|	ВнешниеОтчеты.Ссылка КАК Ссылка,
	|	ВнешниеОтчеты.ИмяФайла КАК ИмяФайла
	|ИЗ
	|	Справочник.ВнешниеОтчеты КАК ВнешниеОтчеты
	|ГДЕ
	|	ВнешниеОтчеты.Код = &КодВОО";
	
	Запрос.УстановитьПараметр("КодВОО",		Число(КодВОО));
	Выборка=Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда
		ОбработкаПечати = Неопределено;
		ИмяОбработки = СокрЛП(Выборка.ИмяФайла);
		Если Лев(ИмяОбработки,3)="ВН_" Тогда
			ИмяОбработки=Сред(ИмяОбработки,4);	
		КонецЕсли;
		ДопКаталог="PrnForms\";
		ПолноеИмяФайлаОб	=СокрЛП(Константы.КаталогВнешнихОтчетов.Получить() + ИмяОбработки + ".epf");
		ПолноеИмяФайлаОтч	=СокрЛП(Константы.КаталогВнешнихОтчетов.Получить() + ИмяОбработки + ".erf");
		
		ПолноеИмяФайлаОб1	=СокрЛП(Константы.КаталогВнешнихОтчетов.Получить() + ДопКаталог + ИмяОбработки + ".epf");
		ПолноеИмяФайлаОтч1	=СокрЛП(Константы.КаталогВнешнихОтчетов.Получить() + ДопКаталог + ИмяОбработки + ".erf");
		
		ФайлОтчетаОб		= Новый Файл(ПолноеИмяФайлаОб);
		ФайлОтчетаОтч		= Новый Файл(ПолноеИмяФайлаОтч); 
		
		ФайлОтчетаОб1		= Новый Файл(ПолноеИмяФайлаОб1);
		ФайлОтчетаОтч1		= Новый Файл(ПолноеИмяФайлаОтч1);
		
		Если ФайлОтчетаОб.Существует() Тогда
			ОбработкаПечати = ВнешниеОбработки.Создать(ПолноеИмяФайлаОб);
		ИначеЕсли ФайлОтчетаОтч.Существует() Тогда
			ОбработкаПечати = ВнешниеОтчеты.Создать(ПолноеИмяФайлаОтч); 
		ИначеЕсли ФайлОтчетаОб1.Существует() Тогда
			ОбработкаПечати = ВнешниеОбработки.Создать(ПолноеИмяФайлаОб1);
		ИначеЕсли ФайлОтчетаОтч1.Существует() Тогда
			ОбработкаПечати = ВнешниеОтчеты.Создать(ПолноеИмяФайлаОтч1);
		Иначе
			Попытка
				ОбработкаПечати = Обработки[ИмяОбработки].Создать();
			Исключение 
				Попытка
					ОбработкаПечати = Отчеты[ИмяОбработки].Создать();
				Исключение
				КонецПопытки;
			КонецПопытки;	
		КонецЕсли;
		Если НЕ ОбработкаПечати = Неопределено Тогда
			ФормаО	= ОбработкаПечати.ПолучитьФорму();
			Попытка         
				//Если ОбработкаПечати.Свойство("ПечатьСразу") Тогда
				//	ОбработкаПечати.ПечатьСразу = Истина;
				//КонецЕсли;	   
				//Для Каждого КлЗ Из ОбработкаПечати.Реквизиты Цикл
				//	Если КлЗ.Ключ = "ПечатьСразу" Тогда
				//		КлЗ.Значение = Истина;
				//	ИначеЕсли ТипЗнч(КлЗ.Ключ) = ТипЗнч(Ссылка) Тогда
				//		КлЗ.Значение = Ссылка;
				//	КонецЕсли;	
				//КонецЦикла;	
				//Сообщить(Ссылка.МетаДанные().ПолноеИмя());
				Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.ЗоныХранения") Тогда
					ОбработкаПечати.ПечатьСразу = Истина;
					ОбработкаПечати.ЗонаХранения = Ссылка;
				КонецЕсли;
				ФормаО.Открыть();
				//КонецЕсли;
			Исключение
				
				Сообщить("Ошибка открытия внешней формы " + ОписаниеОшибки());
				ФормаО.Открыть();
			КонецПопытки;
		КонецЕсли;	
		
	КонецЕсли;
		
КонецПроцедуры //-SNL-91 20260120 Михайловский

