Функция ЭтоДоговорПродажиСПредоплатой(ДоговорСсылка) Экспорт
	Результат = Ложь;
	Если ТипЗнч(ДоговорСсылка) = Тип("СправочникСсылка.Договоры") И ЗначениеЗаполнено(ДоговорСсылка) Тогда
		рШапки = ПолучитьРеквизитыШапки(ДоговорСсылка, "ВидДоговора_Новый,УсловияОплаты");
		Если рШапки.ВидДоговора_Новый = Справочники.ВидыДоговоров.Товары_Продажа
			И рШапки.УсловияОплаты = Перечисления.УсловияОплаты.Предоплата Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции //ЭтоДоговорПродажиСПредоплатой(Ссылка) Экспорт

Функция НайтиСоздатьДоговорВозврата(ДоговорОтгрузки) Экспорт
	Результат = Справочники.Договоры.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(ДоговорОтгрузки) Тогда
		пПоиска = Новый Структура("Владелец,Организация,ВалютаКредита,ВидДоговора_Новый", 
		ДоговорОтгрузки.Владелец, ДоговорОтгрузки.Организация, ДоговорОтгрузки.ВалютаКредита, Справочники.ВидыДоговоров.Возвраты
		);
		
		Результат = МаркировкаС.НайтиСправочник("Договоры", пПоиска); 
		Если НЕ ЗначениеЗаполнено(Результат) Тогда
			Дог_Объект = Справочники.Договоры.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(Дог_Объект, пПоиска);	
			Дог_Объект.Наименование = "Возвраты";
			
			Дог_Объект.КодЦБ		= ДоговорОтгрузки.КодЦБ;
			Дог_Объект.КодБух		= ДоговорОтгрузки.КодБух;
			
			УстановитьПривилегированныйРежим(Истина);
			Дог_Объект.Записать();
			
			Результат = Дог_Объект.Ссылка;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //НайтиСоздатьДоговорВозврата(ДоговорОтгрузки) Экспорт