Процедура ПередЗаписью(Отказ)
	Если НЕ ОбменДанными.Загрузка Тогда
		Отказ=НЕ ПолучитьПолномочиеПользователя("РедактированиеКонтрагентов");	
	КонецЕсли;	
	
	// Кухарь А.Ю.  18.04.2023 начало
	// Для новых ставим, что непроверен
	если ЭтоНовый() тогда
		РезультатПроверкиСБ=Справочники.РезультатыПроверкиСБ.НеПроверен;
	КонецЕсли;
	// Кухарь А.Ю.  18.04.2023 конец
	
	
	//крохин начало 23.01.2012
	Если НЕ ОбменДанными.Загрузка Тогда
		//крохин начало 24.04.2013
		Если ПометкаУдаления И НЕ Ссылка.ПометкаУдаления Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	Контрагенты.Ссылка
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.ОсновнойДоговор = &ОсновнойДоговор";
			Запрос.УстановитьПараметр("ОсновнойДоговор",Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				СообщитьИзМодуля("Договор используется как основной у контаргента "+Выборка.Ссылка);   
			КонецЦикла;
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ПунктыДоставки.Ссылка
			|ИЗ
			|	Справочник.ПунктыДоставки КАК ПунктыДоставки
			|ГДЕ
			|	ПунктыДоставки.Договор = &Договор";
			Запрос.УстановитьПараметр("Договор",Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				СообщитьИзМодуля("Договор используется в пункте доставки "+Выборка.Ссылка+ ". Контрагент: "+Выборка.Ссылка.Владелец);   
			КонецЦикла;
			
		КонецЕсли;
		//крохин конец 24.04.2013
		
		ВыгрузитьВТЦ();
	КонецЕсли;
	//крохин конец 23.01.2012
	
	//крохин начало 22.01.2020
	//может быть только один договор с флагом "ДС". Запрет не нужен, только предупреждение
	Если НЕ ОбменДанными.Загрузка Тогда
		Если ДопСоглашение Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	Договоры.Ссылка КАК Договор
			|ИЗ
			|	Справочник.Договоры КАК Договоры
			|ГДЕ
			|	Договоры.ДопСоглашение
			|	И Договоры.КодЦБ = &КодЦБ
			|	И Договоры.Ссылка <> &Ссылка";
			Запрос.УстановитьПараметр("КодЦБ",КодЦБ);
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Количество() > 0 Тогда
				СообщитьОбОшибке("Обнаружено несколько договоров ДС!");
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	//крохин конец 22.01.2020
	
	УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс=ПолучитьПрефиксНомеров(ЭтотОбъект);
КонецПроцедуры

Процедура ВыгрузитьВТЦ()
	//выгрузим контрагента в филиалы, если необходимо
	ТЗ=Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("КодУзла");
	ВерхнийУровень = Владелец;
	Если Владелец.Метаданные().Имя <> "Контрагенты" Тогда
		//крохин начало 27.02.2013
		//для физ.лиц регистрируем 
		Если Владелец.Метаданные().Имя = "ФизическиеЛица" Тогда	
			ВыборкаУзлов = ПланыОбмена.Основной.Выбрать();
			Пока ВыборкаУзлов.Следующий() Цикл 
				Если ВыборкаУзлов.Ссылка <> ПараметрыСеанса.ЭтотУзел Тогда
					ЭтотОбъект.ОбменДанными.Получатели.Добавить( ВыборкаУзлов.Ссылка);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		//крохин конец 27.02.2013
		Возврат;
	КонецЕсли;
	Пока НЕ ВерхнийУровень.Пустая()  Цикл
		Для Каждого КодУзла Из ВерхнийУровень.РегиональныеУзлы Цикл
			//Катаев+ 25/07/13
			//СтрокаТЗ = ТЗ.Добавить();
			//СтрокаТЗ.КодУзла = КодУзла.КодУзла;
			Если Не ПустаяСтрока(КодУзла.КодУзла) Тогда
				СтрокаТЗ = ТЗ.Добавить();
				СтрокаТЗ.КодУзла = КодУзла.КодУзла;
			КонецЕсли;
			//Катаев- 25/07/13
		КонецЦикла;
		ВерхнийУровень = ВерхнийУровень.Родитель;
	КонецЦикла;
	ТЗ.Свернуть("КодУзла");
	//из складских баз выгружаем только в ЦО
	Если ПараметрыСеанса.ТипУзла <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		ТЗ.Очистить();
		СтрокаТЗ = ТЗ.Добавить();
		СтрокаТЗ.КодУзла = "SNL";
	КонецЕсли;
	Если Тз.Количество() <> 0 Тогда
		СписокУзловПолучателей=Новый Массив;	
		Для Каждого строкаТЗ Из ТЗ Цикл
			СписокУзловПолучателей.Добавить(ПланыОбмена.Основной.НайтиПоКоду(СтрокаТЗ.КодУзла));	
		КонецЦикла;
		Для Н = 0 По СписокУзловПолучателей.Количество()-1 Цикл
			ЭтотОбъект.ОбменДанными.Получатели.Добавить(СписокУзловПолучателей.Получить(Н));	
		КонецЦикла;
		
		//	ПланыОбмена.ЗарегистрироватьИзменения(СписокУзловПолучателей,ЭтотОбъект.Ссылка);		
	КонецЕсли;
КонецПроцедуры