// Кухарь А.Ю. 26.01.2021 начало
// Нужно ЗНБ перепроводить после коррекции количества
перем СписокЗНБ; 
// Кухарь А.Ю. 26.01.2021 конец



Процедура Заполнить() Экспорт
	ВидДокумента=Документ.Метаданные().Имя;
	
	ИмяРеквизитаКоличество	="Количество";
	ИмяРеквизитаСостояние	="СостояниеНакладной";
	
	Если ВидДокумента="Перемещение" Тогда		
		Если Документ.Склад.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда			
			ИмяРеквизитаКоличество="ПодтвержденнаяЗаявка"; //Отгружено
		ИначеЕсли Документ.СкладПолучатель.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда
			ИмяРеквизитаСостояние	="СостояниеНакладнойУПолучателя";			
		КонецЕсли;		
	КонецЕсли;
	
	//Нечаева +++
	Если ВидДокумента="ПродажаИМ" Тогда
		ИмяРеквизитаКоличество="ПодтвержденнаяЗаявка";
	КонецЕсли;	
	//Нечаева --
	
	//Кухарь 02.11.16 начало
	//Состояния документов теперь по другому определяются
	//Если НЕ (ВидДокумента="КонтрактСПроизводителем" или  ВидДокумента="ЗаказПоставщику") тогда
	Если НЕ (ВидДокумента="КонтрактСПроизводителем" или  ВидДокумента="ЗаказПоставщику" или  ВидДокумента="РасходнаяНакладная" или  ВидДокумента="Перемещение" или  ВидДокумента="Комплектация"  ) тогда
		//Кухарь 02.11.16 конец	
		Если Документ[ИмяРеквизитаСостояние]<>Перечисления.СостоянияНакладной.Сканирование Тогда
			#Если Клиент тогда
				Предупреждение("Не допустимое состояние накладной ! 
				|Заполняются только документы в состоянии ""Сканирование""
				|Текущее состояние: """+Документ[ИмяРеквизитаСостояние]+""" !");
			#КонецЕсли
			Возврат;
		КонецЕсли;	
	Конецесли;
	ДокОбъект=Документ.ПолучитьОбъект();
	
	//Мессерле
	
	
	Запрос=Новый Запрос;
	
	запрос2=новый запрос;
	запрос2.Текст="ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|ГДЕ
	|	ЗаказПоставщику.ДокОснование = &ДокОснование
	|	И (НЕ ЗаказПоставщику.ПометкаУдаления)";
	
	Запрос2.УстановитьПараметр("ДокОснование",Документ.Ссылка);
	
	Выб=Запрос2.Выполнить().Выбрать();
	Если выб.Следующий() тогда
		ДокОсн=выб.ссылка;
	иначе
		докосн=НЕОПРЕДЕЛЕНО;
	Конецесли;	   
	
	
	Минусуем=Ложь;
	Если ДокОсн<>НЕОПРЕДЕЛЕНО тогда //Ищем документ с остатком в зоне сборки
		Минусуем=ИСТИНА;
	Конецесли;	
	
	
	//Мессерле
	
	//10.01.12
	
	Если  ВидДокумента="ЗаказПоставщику" и документ.Склад.ТипСклада=перечисления.ТипСклада.ВнешнийСклад тогда    
		//Не с чем сравнивать! Это отгрузка
		докобъект.Товары.Очистить();
		докобъект.ТоварыПартии.Очистить();
	конецесли;
	
	Если НЕ (ВидДокумента="ЗаказПоставщику" и Минусуем)  тогда
		Запрос.Текст="
		|ВЫБРАТЬ
		|	ЛистНабораТовары.Номенклатура,
		
		// Кухарь А.Ю.  07.06.2022 начало
		//Иногда в разных ЛН разные штук в коробе на одну позицию и заполнение по ЛН  становится кривым
		// 		|выбор когда ЛистНабораТовары.ШтВКоробе=0 тогда СУММА(ЛистНабораТовары.Количество) иначе СУММА(ЛистНабораТовары.Количество)/ЛистНабораТовары.ШтВКоробе конец  как КоличествоКоробов,
		//|	ЛистНабораТовары.ШтВКоробе как ШтукВКоробе, 
		|	1 как ШтукВКоробе, 
		|	1 как  КоличествоКоробов,
		// Кухарь А.Ю.  07.06.2022 конец
		
		
		|ЛистНаборатовары.ссылка.Им7 КАК Им7,
		//++Данилова Е.В. 26.02.2026  SNL-150
		//|	СУММА(ЛистНабораТовары.Количество) КАК "+ИмяРеквизитаКоличество+" 
		|	СУММА(ЛистНабораТовары.%КолонкаКоличество%) КАК "+ИмяРеквизитаКоличество+"
		//--Данилова Е.В. 26.02.2026 
		|ИЗ
		|	Документ.ЛистНабора.Товары КАК ЛистНабораТовары
		|ГДЕ
		|	ЛистНабораТовары.Ссылка.ДокОснование = &ДокОснование
		|	И  ЛистНабораТовары.Ссылка.Проведен
		// Кухарь А.Ю.  06.08.2022 начало
		//ЛН которые загружены с ТСД, но ещё не переклеенные
		|	И не ЛистНабораТовары.Ссылка.ТребуетПроверки
		// Кухарь А.Ю.  06.08.2022 конец
		
		|СГРУППИРОВАТЬ ПО
		// Кухарь А.Ю.  07.06.2022 начало
		// 		|	ЛистНабораТовары.Номенклатура,ЛистНабораТовары.ШтВКоробе,ЛистНаборатовары.ссылка.Им7 упорядочить по ЛистНабораТовары.Номенклатура";
		|	ЛистНабораТовары.Номенклатура,ЛистНаборатовары.ссылка.Им7 упорядочить по ЛистНабораТовары.Номенклатура";	 
		// Кухарь А.Ю.  07.06.2022 конец
		
		//++Данилова Е.В. 26.02.2026 SNL-150  
		если СравнениеЛП Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"Документ.ЛистНабора","Документ.ЛистПереукладки");
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"%КолонкаКоличество%","Отсканировано");
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"ЛистНаборатовары.ссылка.Им7","Значение(Справочник.Партии.ПустаяСсылка)");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"%КолонкаКоличество%","Количество");
		КонецЕсли;
		//--Данилова Е.В. 26.02.2026
		
		//Кухарь начало 21.09.12 пересчёт Кол-ва коробов из ЛН
		коробки = новый Запрос; 
		//++Данилова Е.В. 26.02.2026 SNL-150
		//Коробки.Текст="ВЫБРАТЬ
		//|	СУММА(ЛистНабора.КоличествоКоробок) КАК КоличествоКоробок
		//|ИЗ
		//|	Документ.ЛистНабора КАК ЛистНабора
		//|ГДЕ
		//|	ЛистНабора.Проведен	
		//// Кухарь А.Ю.  06.08.2022 начало
		////ЛН которые загружены с ТСД, но ещё не переклеенные
		//|	И не ЛистНабора.ТребуетПроверки
		//// Кухарь А.Ю.  06.08.2022 конец		
		//|	И ЛистНабора.ДокОснование = &ДокОснование";
		//Коробки.УстановитьПараметр("ДокОснование",Документ.Ссылка);
		Коробки.Текст="ВЫБРАТЬ
		|	СУММА(ЛистНабораДок.КоличествоКоробок) КАК КоличествоКоробок
		|ИЗ
		|	Документ.ЛистНабора КАК ЛистНабораДок
		|ГДЕ
		|	ЛистНабораДок.Проведен
		|	И НЕ ЛистНабораДок.ТребуетПроверки
		|	И ЛистНабораДок.ДокОснование = &ДокОснование";
		Коробки.УстановитьПараметр("ДокОснование",Документ.Ссылка); 
		если СравнениеЛП Тогда 
			коробки.Текст = СтрЗаменить(коробки.Текст,"Документ.ЛистНабора","Документ.ЛистПереукладки");
		КонецЕсли;
		//--Данилова Е.В. 26.02.2026
		КолКор=Коробки.Выполнить().Выгрузить().Получить(0).КоличествоКоробок;
		//Кухарь конец 21.09.12
		
		// Кухарь А.Ю.  07.06.2022 начало
		//Исправил по другому
		//Кухарь 17.11.17 начало
		//В честь дня рождения Крохина А.В. надо наконец исправить этот старый косяк с кривым заполнением по ЛН если есть разное количество штук в коробе  по одной номенклатуре.
		//если ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.Склад тогда
		//	если ВидДокумента="Перемещение" или ВидДокумента="РасходнаяНакладная" тогда
		//		запрос.Текст=СтрЗаменить(запрос.Текст,"ЛистНабораТовары.ШтВКоробе как ШтукВКоробе, выбор когда ЛистНабораТовары.ШтВКоробе=0 тогда СУММА(ЛистНабораТовары.Количество) иначе СУММА(ЛистНабораТовары.Количество)/ЛистНабораТовары.ШтВКоробе конец  как КоличествоКоробов,ЛистНаборатовары.ссылка.Им7,","");
		//		запрос.текст=СтрЗаменить(запрос.Текст,",ЛистНабораТовары.ШтВКоробе,ЛистНаборатовары.ссылка.Им7","");
		//	КонецЕсли;
		//КонецЕсли;
		//Кухарь 17.11.17 конец
		
		// Кухарь А.Ю.  07.06.2022 конец
		
		
	иначе
		Запрос.Текст="ВЫБРАТЬ
		|	аа.Номенклатура,
		|	аа.ШтукВКоробе,
		|	СУММА(аа.КоличествоКоробов) КАК КоличествоКоробов,
		|	аа.ИМ7,
		|	СУММА(аа.Количество) КАК Количество
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЛистНабораТовары.Номенклатура КАК Номенклатура,
		|		ЛистНабораТовары.ШтВКоробе КАК ШтукВКоробе,
		|		ВЫБОР
		|			КОГДА ЛистНабораТовары.ШтВКоробе = 0
		|				ТОГДА ЛистНабораТовары.Количество
		|			ИНАЧЕ ЛистНабораТовары.%КолонкаКоличество% / ЛистНабораТовары.ШтВКоробе
		|		КОНЕЦ КАК КоличествоКоробов,
		|		ЛистНабораТовары.Ссылка.ИМ7 КАК ИМ7,
		|		ЛистНабораТовары.%КолонкаКоличество% КАК Количество
		|	ИЗ
		|		Документ.ЛистНабора.Товары КАК ЛистНабораТовары
		|	ГДЕ
		|		ЛистНабораТовары.Ссылка.ДокОснование = &ДокОснование
		|		И ЛистНабораТовары.Ссылка.Проведен
		// Кухарь А.Ю.  06.08.2022 начало
		//ЛН которые загружены с ТСД, но ещё не переклеенные
		|	И не ЛистНабораТовары.Ссылка.ТребуетПроверки
		// Кухарь А.Ю.  06.08.2022 конец
		
		
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЛистНабораТовары.Номенклатура,
		|		ЛистНабораТовары.ШтВКоробе,
		|		-ВЫБОР
		|			КОГДА ЛистНабораТовары.ШтВКоробе = 0
		|				ТОГДА ЛистНабораТовары.%КолонкаКоличество%
		|			ИНАЧЕ ЛистНабораТовары.%КолонкаКоличество% / ЛистНабораТовары.ШтВКоробе
		|		КОНЕЦ,
		|		ЛистНабораТовары.Ссылка.ИМ7,
		|		-ЛистНабораТовары.%КолонкаКоличество%
		|	ИЗ
		|		Документ.ЛистНабора.Товары КАК ЛистНабораТовары
		|	ГДЕ
		|		ЛистНабораТовары.Ссылка.ДокОснование = &ДокОснованиеЗПС
		|		И ЛистНабораТовары.Ссылка.Проведен
		// Кухарь А.Ю.  06.08.2022 начало
		//ЛН которые загружены с ТСД, но ещё не переклеенные
		|	И не ЛистНабораТовары.Ссылка.ТребуетПроверки
		// Кухарь А.Ю.  06.08.2022 конец
		
		|) КАК аа
		|
		|СГРУППИРОВАТЬ ПО
		|	аа.Номенклатура,
		|	аа.ИМ7,
		|	аа.ШтукВКоробе";
		
		//Запрос.Текст="ВЫБРАТЬ
		//			 |	ЛистНабораТовары.Номенклатура КАК Номенклатура,
		//			 |	ЛистНабораТовары.ШтВКоробе КАК ШтукВКоробе,
		//			 |	СУММА(ВЫБОР
		//			 |			КОГДА ЛистНабораТовары.ШтВКоробе = 0
		//			 |				ТОГДА ЛистНабораТовары.Количество
		//			 |			ИНАЧЕ ЛистНабораТовары.Количество / ЛистНабораТовары.ШтВКоробе
		//			 |		КОНЕЦ - ЕСТЬNULL(ВЫБОР
		//			 |				КОГДА ЛистНабораТовары1.ШтВКоробе = 0
		//			 |					ТОГДА ЛистНабораТовары1.Количество
		//			 |				ИНАЧЕ ЛистНабораТовары1.Количество / ЛистНабораТовары1.ШтВКоробе
		//			 |			КОНЕЦ, 0)) КАК КоличествоКоробов,
		//			 |	ЛистНабораТовары.Ссылка.ИМ7 КАК ИМ7,
		//			 |	СУММА(ЛистНабораТовары.Количество - ЕСТЬNULL(ЛистНабораТовары1.Количество, 0)) КАК Количество
		//			 |ИЗ
		//			 |	Документ.ЛистНабора.Товары КАК ЛистНабораТовары
		//			 |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистНабора.Товары КАК ЛистНабораТовары1
		//			 |		ПО ЛистНабораТовары.Номенклатура = ЛистНабораТовары1.Номенклатура
		//			 |			И ЛистНабораТовары.Ссылка.ИМ7 = ЛистНабораТовары1.Ссылка.ИМ7
		//			 |			И ЛистНабораТовары.ШтВКоробе = ЛистНабораТовары1.ШтВКоробе
		//			 |			И (ЛистНабораТовары1.Ссылка.ДокОснование = &ДокОснованиеЗПС)
		//			 |			И (ЛистНабораТовары1.Ссылка.Проведен)
		//			 |ГДЕ
		//			 |	ЛистНабораТовары.Ссылка.ДокОснование = &ДокОснование
		//			 |	И ЛистНабораТовары.Ссылка.Проведен
		//			 |
		//			 |СГРУППИРОВАТЬ ПО
		//			 |	ЛистНабораТовары.Номенклатура,
		//			 |	ЛистНабораТовары.ШтВКоробе,
		//			 |	ЛистНабораТовары.Ссылка.ИМ7";
		
		
		Запрос.УстановитьПараметр("ДокОснованиеЗПС",ДокОсн);
		//++Данилова Е.В. 26.02.2026 SNL-150  
		если СравнениеЛП Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"Документ.ЛистНабора","Документ.ЛистПереукладки");
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"%КолонкаКоличество%","Отсканировано");
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"ЛистНаборатовары.ссылка.Им7","Значение(Справочник.Партии.ПустаяСсылка)");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"%КолонкаКоличество%","Количество");
		КонецЕсли;
		//--Данилова Е.В. 26.02.2026
		
	Конецесли;
	Запрос.УстановитьПараметр("ДокОснование",Документ.Ссылка);
	Выборка=Запрос.Выполнить().Выбрать();
	
	ВидОснования=Документ.Метаданные().Имя;
	
	ЕстьКорректировки=Ложь;
	
	ОбработанныеСтроки=Новый Соответствие;
	// Кухарь А.Ю. 06.04.2020 начало
	//Зафиксируем что и на сколько изменилось, чтобы сделать тоже самое в ПН и ЗНБ
	ТЗВычерков=новый ТаблицаЗначений;
	ТЗВычерков.Колонки.Добавить("Номенклатура");
	ТЗВычерков.Колонки.Добавить("Количество");
	// Кухарь А.Ю. 06.04.2020 конец
	
	
	
	Пока Выборка.Следующий() Цикл
		если ВидОснования="ПриходнаяНакладная" и докобъект.Склад.ТипСклада=перечисления.ТипСклада.ВнешнийСклад тогда
			отбор=новый структура;
			отбор.Вставить("Номенклатура",Выборка.Номенклатура);
			отбор.Вставить("ШтВКоробе",Выборка.ШтукВКоробе);
			Масс=ДокОбъект.Товары.НайтиСтроки(Отбор);
			Если Масс.количество()=0 тогда
				отбор=новый структура;
				отбор.Вставить("Номенклатура",Выборка.Номенклатура);
				отбор.Вставить("ШтВКоробе",0);
				Масс=ДокОбъект.Товары.НайтиСтроки(Отбор);
			Конецесли;
			Если масс.количество()>1 тогда
				// Кельманов А.В. - SNL-119 - 2026.03.19 {
				//Предупреждение(""+ДокОбъект+" "+Выборка.Номенклатура+" Внутренняя ошибка.Обратитесь в ИТ-отдел");Возврат;
				#Если Клиент Тогда
					Предупреждение(""+ДокОбъект+" "+Выборка.Номенклатура+" Внутренняя ошибка.Обратитесь в ИТ-отдел");
				#КонецЕсли
				Возврат;
				// Кельманов А.В. - SNL-119 - 2026.03.19 }
			Конецесли;	
			Если масс.количество()=0 тогда
				СтрокаТч=НЕОПРЕДЕЛЕНО;
			иначе
				СтрокаТч=Масс[0];
			Конецесли;
			
		иначе	
			СтрокаТЧ=ДокОбъект.Товары.Найти(Выборка.Номенклатура);
			//крохин начало 15.11.2011
			//для РНК с комплектацией сравниваем ТЧ "комплектующие"
			Если ДокОбъект.Метаданные().Имя = "РасходнаяНакладная" И ДокОбъект.ОтгрузкаКомплектов Тогда
				//Кухарь 18.10.16 начало
				//несколько строчек с одинаковой номенклатурой в ТЧ комплектующие
				//СтрокаТЧ=ДокОбъект.Комплектующие.Найти(Выборка.Номенклатура,"Номенклатура");
				ОтборКМП=новый Структура;
				ОтборКМП.Вставить("Номенклатура",Выборка.Номенклатура);
				МассКМП=ДокОбъект.Комплектующие.НайтиСтроки(ОтборКМП);
				Если МассКМП.количество()>0 тогда
					СтрокаТЧ=МассКМП.получить(0);
				КонецЕсли;
				//Кухарь 18.10.16 конец
				
			КонецЕсли;
			//крохин конец 15.11.2011
		Конецесли;
		
		
		
		
		Если СтрокаТЧ=Неопределено Тогда
			Если ВидОснования="РасходнаяНакладная" Тогда
				Если Выборка.Количество<>0 Тогда
					Сообщить("Позиция: """+Выборка.Номенклатура+""" отсутствует в накладной !!! Данная позиция не добавлена в накладную !!!",СтатусСообщения.ОченьВажное);				
				КонецЕсли;				
				Продолжить;
			КонецЕсли; 			
			СтрокаТЧ=ДокОбъект.Товары.Добавить();		
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,Выборка);
			ПриИзмененииНоменклатурыТабЧасти(СтрокаТЧ,ДокОбъект);
			
		Иначе
			//крохин начало 15.11.2011
			//для РНК с комплектацией сравниваем ТЧ "комплектующие"
			//СтрокаТЧ[ИмяРеквизитаКоличество]=Выборка[ИмяРеквизитаКоличество];
			Если ДокОбъект.Метаданные().Имя = "РасходнаяНакладная" И ДокОбъект.ОтгрузкаКомплектов Тогда
				Отбор=новый Структура;
				Отбор.Вставить("Номенклатура",Выборка.Номенклатура);
				МассивСтрок=ДокОбъект.Комплектующие.НайтиСтроки(Отбор);
				Остаток=Выборка[ИмяРеквизитаКоличество];
				
				Для каждого СтрокаКомлектующих из МассивСтрок цикл
					Если Остаток >= СтрокаКомлектующих.Количество Тогда
						Остаток=Остаток - СтрокаКомлектующих.Количество;
					Иначе
						
						// Кухарь А.Ю. 06.04.2020 начало
						//Запомним расхождение
						если Остаток-СтрокаКомлектующих.Количество <>0 тогда
							СтрРасх=ТЗВычерков.Добавить();
							СтрРасх.Номенклатура= Выборка.Номенклатура;
							СтрРасх.Количество= Остаток-СтрокаКомлектующих.Количество;
						КонецЕсли;
						// Кухарь А.Ю. 06.04.2020 конец
						
						СтрокаКомлектующих.Количество = Остаток;
						Остаток=0; 
						
						
					КонецЕсли;
					
					//Кухарь 18.10.16 начало
					//Для нескольких строк КМП
					Если МассКМП.количество()>1 тогда
						для каждого СтрМассКмп из МассКМП цикл
							если СтрМассКмп.Продукция=СтрокаКомлектующих.продукция тогда
								СтрокаТч=СтрМассКмп;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					//Кухарь 18.10.16 конец
					
					
					ОбработанныеСтроки.Вставить(СтрокаТЧ,Истина);
				Конеццикла;
				
			Иначе
				
				
				// Кухарь А.Ю. 06.04.2020 начало
				//Запомним расхождение
				если Выборка[ИмяРеквизитаКоличество] - СтрокаТЧ[ИмяРеквизитаКоличество]<>0 тогда 
					СтрРасх=ТЗВычерков.Добавить();
					СтрРасх.Номенклатура= Выборка.Номенклатура;
					СтрРасх.Количество= Выборка[ИмяРеквизитаКоличество] - СтрокаТЧ[ИмяРеквизитаКоличество];
				КонецЕсли;
				// Кухарь А.Ю. 06.04.2020 конец
				
				СтрокаТЧ[ИмяРеквизитаКоличество]=Выборка[ИмяРеквизитаКоличество];
			КонецЕсли;
			
			//крохин конец 15.11.2011
			
			
		КонецЕсли;
		
		Если ВидОснования="ПриходнаяНакладная" тогда
			СтрокаТЧ.ШтВКоробе=выборка.штуквкоробе;
			СтрокаТЧ.КоличествоКоробов=выборка.КоличествоКоробов;
		Конецесли;
		
		
		Если ВидДокумента="Перемещение" И ИмяРеквизитаКоличество="ПодтвержденнаяЗаявка" 
			И ДокОбъект.СостояниеНакладнойУПолучателя<>Перечисления.СостоянияНакладной.Принята Тогда
			СтрокаТЧ.Количество=СтрокаТЧ.ПодтвержденнаяЗаявка;
		КонецЕсли; 
		
		//Нечаева-+++
		Если ВидДокумента="ПродажаИМ" И ИмяРеквизитаКоличество="ПодтвержденнаяЗаявка" Тогда			
			СтрокаТЧ.Количество=СтрокаТЧ.ПодтвержденнаяЗаявка-СтрокаТЧ.Возврат;
		КонецЕсли; 
		//Нечаева ---
		//крохин начало 15.11.2011
		//для РНК с комплектацией сравниваем ТЧ "комплектующие", отработанные строки вставлены ранее
		
		//ОбработанныеСтроки.Вставить(СтрокаТЧ,Истина);	
		Если ДокОбъект.Метаданные().Имя = "РасходнаяНакладная" И ДокОбъект.ОтгрузкаКомплектов Тогда
		Иначе
			ОбработанныеСтроки.Вставить(СтрокаТЧ,Истина);
		КонецЕсли;
		//крохин конец 15.11.2011
		
		
		РассчитатьСуммуТабЧасти(СтрокаТЧ,ДокОбъект);
		
		ЕстьКорректировки=Истина;
		
		//Партии
		Если  (ВидДокумента="КонтрактСПроизводителем" или  ВидДокумента="ЗаказПоставщику" или (ВидДокумента="Инвентаризация" и документ.Склад.ТипСклада=перечисления.ТипСклада.ВнешнийСклад)) тогда    
			
			Отбор=новый структура;
			отбор.Вставить("Номенклатура",Выборка.Номенклатура);
			отбор.Вставить("Им7",Выборка.Им7);
			
			если выборка.штуквкоробе<>0 тогда
				отбор.Вставить("ШтукВКоробе",Выборка.ШтукВКоробе);
			Конецесли;
			
			Масс=ДокОбъект.ТоварыПартии.НайтиСтроки(отбор);
			
			Если Масс.Количество()>1 тогда
				сообщить("Для "+Выборка.Номенклатура+" по "+Выборка.Им7+" и шт. в кор.="+Выборка.ШтукВКоробе+" есть дублирующиеся строки!");Возврат;
			Конецесли;
			
			Если Масс.Количество()=1 тогда
				СтрокаТЧ1=масс[0];
			иначе
				СтрокаТЧ1=ДокОбъект.Товарыпартии.Добавить();		
				ЗаполнитьЗначенияСвойств(СтрокаТЧ1,Выборка);
			Конецесли;
			
			
			Если  (ВидДокумента="Инвентаризация" и документ.Склад.ТипСклада=перечисления.ТипСклада.ВнешнийСклад) тогда    
				
				СтрокаТЧ1.КоличествоФакт=Выборка.Количество;
				
				//Вот здесь геморой, т.к. по партиям может быть много строк, а по товарам только одна
				СтрокаТЧ1.ШтукВКоробе=выборка.штуквкоробе;
				
				Отбор=новый структура;
				отбор.Вставить("Номенклатура",Выборка.Номенклатура);
				Масс=ДокОбъект.ТоварыПартии.НайтиСтроки(отбор);
				
				фактОст=0;
				Для каждого стр из масс цикл
					ФактОст=ФактОст+стр.КоличествоФакт;
				Конеццикла;	
				
				СтрокаТЧ.КоличествоФакт=ФактОст;
				СтрокаТЧ.Количество=СтрокаТЧ.КоличествоФакт-СтрокаТЧ.КоличествоРасч;
				
			иначе
				СтрокаТЧ1.Количество=Выборка.Количество;
			Конецесли;
			
		КонецЕсли;	
		
	Конеццикла;
	//Мессерле
	Если  ВидДокумента="ЗаказПоставщику" и документ.Склад.ТипСклада=перечисления.ТипСклада.ВнешнийСклад тогда    
		//Загрузим товары из партий
		тз2=новый ТаблицаЗначений;
		тз2=ДокОбъект.ТоварыПартии.выгрузить();
		Тз2.колонки.добавить("Заявка");
		Тз2.колонки.добавить("СтавкаНДС"); 
		Тз2.колонки.добавить("ПодтвержденнаяЗаявка");
		
		для каждого стр2 из тз2 цикл
			стр2.заявка=стр2.количество;
			стр2.ставкандс=ПолучитьРеквизитРодителя(стр2.номенклатура,"СтавкаНДС");
			стр2.ПодтвержденнаяЗаявка =стр2.количество;
		Конеццикла;		 
		Тз2.свернуть("Номенклатура,СтавкаНДС","количество,Заявка,ПодтвержденнаяЗаявка");
		докобъект.товары.загрузить(Тз2);
		Для каждого стр2 из докобъект.товары цикл
			РассчитатьСуммуТабЧасти(Стр2,ДокОбъект);
		Конеццикла;	 
		
	иначе
		//крохин начало 15.11.2011
		//для РНК с комплектацией сравниваем ТЧ "комплектующие", и затем корректируем товары
		//	Для Каждого СтрокаТЧ Из ДокОбъект.Товары Цикл
		//	Если ОбработанныеСтроки[СтрокаТЧ]=Неопределено Тогда
		//		СтрокаТЧ[ИмяРеквизитаКоличество]=0;
		//		
		//		Если ВидДокумента="Перемещение" И ИмяРеквизитаКоличество="ПодтвержденнаяЗаявка" 
		//		И (ДокОбъект.СостояниеНакладнойУПолучателя.Пустая()
		//			ИЛИ ДокОбъект.СостояниеНакладнойУПолучателя=Перечисления.СостоянияНакладной.ВРаботе) Тогда			
		//			
		//			СтрокаТЧ.Количество=СтрокаТЧ.ПодтвержденнаяЗаявка;
		//		КонецЕсли; 
		//		
		//		//Нечаева-+++
		//		Если ВидДокумента="ПродажаИМ" И ИмяРеквизитаКоличество="ПодтвержденнаяЗаявка" Тогда			
		//			СтрокаТЧ.Количество=СтрокаТЧ.ПодтвержденнаяЗаявка-СтрокаТЧ.Возврат;
		//		КонецЕсли; 
		//		//Нечаева ---
		//   		
		//		РассчитатьСуммуТабЧасти(СтрокаТЧ,ДокОбъект);
		//		ЕстьКорректировки=Истина;
		//	КонецЕсли;
		//КонецЦикла;
		//Кухарь 22.11.17 начало
		//У белья доп обработка до сканирования		
		ЕстьКолготки=ложь;
		//Кухарь 22.11.17 конец		
		Если ДокОбъект.Метаданные().Имя = "РасходнаяНакладная" И ДокОбъект.ОтгрузкаКомплектов Тогда
			//обработка комплектующих
			
			Для Каждого СтрокаТЧ Из ДокОбъект.Комплектующие Цикл
				Если ОбработанныеСтроки[СтрокаТЧ]=Неопределено Тогда
					// Кухарь А.Ю.  06.08.2022 начало
					// Не обрабатывались строчки, которых в ЛН нет, а в РНК есть
					если СтрокаТЧ.Количество<> 0 тогда
						СтрРасх=ТЗВычерков.Добавить();
						СтрРасх.Номенклатура= СтрокаТЧ.Номенклатура;
						СтрРасх.Количество=  -СтрокаТЧ.Количество;	
					КонецЕсли;
					// Кухарь А.Ю.  06.08.2022 конец
					
					
					СтрокаТЧ[ИмяРеквизитаКоличество]=0;
					РассчитатьСуммуТабЧасти(СтрокаТЧ,ДокОбъект);
					ЕстьКорректировки=Истина;
					
					
					
				КонецЕсли;
			КонецЦикла;
			//обработка товаров
			ТаблицаТоваров = ДокОбъект.Комплектующие.Выгрузить();
			ТаблицаТоваров.Свернуть("Продукция","Количество");
			Для Каждого СтрокаТЧ Из ДокОбъект.Товары Цикл
				
				//Кухарь 22.11.17 начало
				//У белья доп обработка до сканирования		
				если ЕстьКолготки=Ложь тогда
					ТекСектор=ПолучитьРеквизитРодителя(СтрокаТЧ.Номенклатура.Родитель,"СекторХранения");
					если ТекСектор<>"2" тогда
						ЕстьКолготки=Истина;
					КонецЕсли;
				КонецЕсли;
				//Кухарь 22.11.17 конец	
				
				СтрокаТаблицы = ТаблицаТоваров.Найти(СтрокаТЧ.Номенклатура,"Продукция");
				Если СтрокаТаблицы = Неопределено Тогда
					СтрокаТч.Количество = 0;
					РассчитатьСуммуТабЧасти(СтрокаТЧ,ДокОбъект);
					ЕстьКорректировки=Истина;
					//Кухарь 27.04.18 начало
					//будем что-то менять только если что-то вычеркнули из товара, который реально комплектуется
					//ИначеЕсли  СтрокаТч.Количество <> СтрокаТаблицы.Количество Тогда
				ИначеЕсли  СтрокаТч.Количество > СтрокаТаблицы.Количество Тогда
					//Кухарь 27.04.18 конец
					
					СтрокаТч.Количество = СтрокаТаблицы.Количество;
					РассчитатьСуммуТабЧасти(СтрокаТЧ,ДокОбъект);
					ЕстьКорректировки=Истина;
				КонецЕсли;
			КонецЦикла;  
		Иначе
			Для Каждого СтрокаТЧ Из ДокОбъект.Товары Цикл
				
				//Кухарь 22.11.17 начало
				//У белья доп обработка до сканирования		
				если ЕстьКолготки=Ложь тогда
					ТекСектор=ПолучитьРеквизитРодителя(СтрокаТЧ.Номенклатура.Родитель,"СекторХранения");
					если ТекСектор<>"2" тогда
						ЕстьКолготки=Истина;
					КонецЕсли;
				КонецЕсли;
				//Кухарь 22.11.17 конец	
				
				Если ОбработанныеСтроки[СтрокаТЧ]=Неопределено Тогда
					
					// Кухарь А.Ю.  06.08.2022 начало
					// Не обрабатывались строчки, которых в ЛН нет, а в РНК есть
					если  СтрокаТЧ[ИмяРеквизитаКоличество]<>0 тогда
						СтрРасх=ТЗВычерков.Добавить();
						СтрРасх.Номенклатура= СтрокаТЧ.Номенклатура;
						СтрРасх.Количество= -СтрокаТЧ[ИмяРеквизитаКоличество];	
					КонецЕсли;
					// Кухарь А.Ю.  06.08.2022 конец
					
					
					СтрокаТЧ[ИмяРеквизитаКоличество]=0;
					
					Если ВидДокумента="Перемещение" И ИмяРеквизитаКоличество="ПодтвержденнаяЗаявка" 
						И (ДокОбъект.СостояниеНакладнойУПолучателя.Пустая()
						ИЛИ ДокОбъект.СостояниеНакладнойУПолучателя=Перечисления.СостоянияНакладной.ВРаботе) Тогда			
						
						СтрокаТЧ.Количество=СтрокаТЧ.ПодтвержденнаяЗаявка;
					КонецЕсли; 
					
					//Нечаева-+++
					Если ВидДокумента="ПродажаИМ" И ИмяРеквизитаКоличество="ПодтвержденнаяЗаявка" Тогда			
						СтрокаТЧ.Количество=СтрокаТЧ.ПодтвержденнаяЗаявка-СтрокаТЧ.Возврат;
					КонецЕсли; 
					//Нечаева ---
					
					РассчитатьСуммуТабЧасти(СтрокаТЧ,ДокОбъект);
					ЕстьКорректировки=Истина;
				КонецЕсли;
			КонецЦикла; 	
		КонецЕсли;
		
		//крохин конец 15.11.2011
		Если НЕ ЕстьКорректировки Тогда
			// Кельманов А.В. - SNL-119 - 2026.03.19 {
			//Предупреждение("Накладная не откорректирована !",3);
			#Если Клиент Тогда
				Предупреждение("Накладная не откорректирована !",3);
			#КонецЕсли
			// Кельманов А.В. - SNL-119 - 2026.03.19 }
			Возврат		
		КонецЕсли;
		
	Конецесли; //Мессерле- заполнение ЗПС в РИге
	
	ВидДокумента			=ДокОбъект.Метаданные().Имя;
	
	//Мессерле
	Если  ВидДокумента="Инвентаризация" тогда
		для каждого стр5 из ДокОбъект.товары цикл
			стр5.количество=стр5.количествофакт-стр5.количестворасч;
		Конеццикла;
	Конецесли;
	//Мессерле
	
	РежимЗаписи=?(ДокОбъект.Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись);
	//Кухарь 14.11.16 начало
	//ДокОбъект.Товары.Сортировать("Номенклатура");
	если ДокОбъект.Метаданные().Имя<>"РасходнаяНакладная" тогда
		ДокОбъект.Товары.Сортировать("Номенклатура");
	КонецЕсли;
	//Кухарь 14.11.16 конец	
	
	Если (ВидДокумента="КонтрактСПроизводителем" или  ВидДокумента="ЗаказПоставщику" или (ВидДокумента="Инвентаризация" и документ.Склад.ТипСклада=перечисления.ТипСклада.ВнешнийСклад)) тогда
		ДокОбъект.ТоварыПартии.Сортировать("Номенклатура");
	Конецесли;
	
	//крохин начало 19.05.2015
	//упаковка
	Если ДокОбъект.Метаданные().Имя = "РасходнаяНакладная" И ТребуетсяУпаковка(Докобъект.ДопОбработки.Выгрузить(,"ВидДопОбработки"),ДокОбъект.КодОперации) Тогда
		Если  НЕ Докобъект.РедактированиеУпаковки Тогда
			
			// Кухарь А.Ю. 08.09.2021 начало
			//ТЗУпаковки = ПолучитьТЗУпаковки(Докобъект.Товары.Выгрузить(,"Номенклатура,Количество"));
			ТЗУпаковки = ПолучитьТЗУпаковки(Докобъект.Товары.Выгрузить(,"Номенклатура,Количество"),ДокОбъект.Контрагент);		 
			// Кухарь А.Ю. 08.09.2021 конец
			
			Докобъект.Упаковка.Очистить();
			Для Каждого СтрокаТЗ ИЗ ТЗУпаковки Цикл
				//крохин начало 12.09.18 начало
				//Часть упаковки будет использоваться только при определённой доп обработке
				если СтрокаТЗ.ДопОбработка<>Справочники.ВидыДопОбработки.ПустаяСсылка() тогда
					если ДокОбъект.ДопОбработки.Найти(СтрокаТЗ.ДопОбработка)=Неопределено тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				//крохин конец 12.0.18 конец
				НоваяСтрока = Докобъект.Упаковка.Добавить();
				НоваяСтрока.Номенклатура = СтрокаТЗ.Номенклатура;
				НоваяСтрока.Количество = СтрокаТЗ.Количество;
				НоваяСтрока.ПодтвержденнаяЗаявка = СтрокаТЗ.Количество;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	//для ПРМ тоже
	Если ДокОбъект.Метаданные().Имя = "Перемещение" И ТребуетсяУпаковкаПРМ(Докобъект.ПунктДоставки.ВидыДопОбработок.Выгрузить(,"ДопОбработка")) И ДокОбъект.Склад.КодФизическогоУзла = ПараметрыСеанса.ЭтотУзел.Код Тогда
		Если  НЕ Докобъект.РедактированиеУпаковки Тогда
			//Если Истина Тогда
			// Кухарь А.Ю. 08.09.2021 начало
			//ТЗУпаковки = ПолучитьТЗУпаковки(Докобъект.Товары.Выгрузить(,"Номенклатура,Количество"));
			ТЗУпаковки = ПолучитьТЗУпаковки(Докобъект.Товары.Выгрузить(,"Номенклатура,Количество"),ДокОбъект.Контрагент);		 
			// Кухарь А.Ю. 08.09.2021 конец
			
			Докобъект.Упаковка.Очистить();
			Для Каждого СтрокаТЗ ИЗ ТЗУпаковки Цикл
				//крохин начало 12.09.18 начало
				//Часть упаковки будет использоваться только при определённой доп обработке
				если СтрокаТЗ.ДопОбработка<>Справочники.ВидыДопОбработки.ПустаяСсылка() тогда
					если ДокОбъект.ПунктДоставки.ВидыДопОбработок.Найти(СтрокаТЗ.ДопОбработка)=Неопределено тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				//крохин конец 12.0.18 конец
				НоваяСтрока = Докобъект.Упаковка.Добавить();
				НоваяСтрока.Номенклатура = СтрокаТЗ.Номенклатура;
				НоваяСтрока.Количество = СтрокаТЗ.Количество;
				НоваяСтрока.ПодтвержденнаяЗаявка = СтрокаТЗ.Количество;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;	
	//крохин конец 19.05.2015
	
	// Кухарь А.Ю. 07.04.2020 начало
	// Скорректируем ЗНБ
	ЭтоУзел_ODN_или_OD7=ОбщегоНазначения_ПИ.ЭтоУзел_ODN_или_OD7() ; 
	если   ЭтоУзел_ODN_или_OD7 тогда
		ТЗВычерков.Свернуть("Номенклатура","Количество");
		ЗНБОтработаны=ЗаполнитьЗНБ(ТЗВычерков);
		если не ЗНБОтработаны тогда
			СообщитьИзМодуля("Не удалось изменить товар в ЗНБ. Накладная по ЛН не заполнена.");
			Возврат;
		КонецЕсли;
	КонецЕсли;	 
	// Кухарь А.Ю. 07.04.2020 конец
	
	Попытка	
		ДокОбъект.Записать(РежимЗаписи);	
	Исключение
		// Кельманов А.В. - SNL-119 - 2026.03.19 {
		//Предупреждение("Ошибка записи документа !");
		#Если Клиент Тогда
			Предупреждение("Ошибка записи документа !");
		#КонецЕсли
		// Кельманов А.В. - SNL-119 - 2026.03.19 }
		Возврат;
	КонецПопытки;
	
	ПолучитьРезультатСравнения();
	Ошибки		=ПолучитьОшибкиНабора();	
	ЕстьОшибки	=Ошибки.Ошибки;
	
	ИмяРеквизитаСостояние	="СостояниеНакладной";	
	СостояниеГотовности=Перечисления.СостоянияНакладной.ГотоваКОтгрузке;
	
	
	
	Если ВидДокумента="Перемещение" Тогда		
		Если Документ.Склад.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда
			//кухарь 16.10.14 начало
			//на складах после сканирования идёт ожидание допобработки
			если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.Склад тогда
				Для Каждого СтрокаДопОбработки Из Документ.ПунктДоставки.ВидыДопОбработок Цикл
					Если СтрокаДопОбработки.ДопОбработка <> Справочники.ВидыДопОбработки.БезОбработки Тогда
						//Кухарь 22.11.17 начало
						//У белья доп обработка до сканирования
						//СостояниеГотовности=Перечисления.СостоянияНакладной.ОжиданиеДопОбработки;
						если ЕстьКолготки=Истина тогда
							СостояниеГотовности=Перечисления.СостоянияНакладной.ОжиданиеДопОбработки;
						КонецЕсли;
						//Кухарь 22.11.17 конец							
						
						Прервать;	
					КонецЕсли;
				КонецЦикла;		
			КонецЕсли;
			//кухарь 16.10.14 конец	
		ИначеЕсли Документ.СкладПолучатель.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда
			ИмяРеквизитаСостояние	="СостояниеНакладнойУПолучателя";			
			СостояниеГотовности		=Перечисления.СостоянияНакладной.ГотоваКПриемке;
		КонецЕсли;	
	КонецЕсли;
	
	//кухарь 16.10.14 начало
	//на складах после сканирования идёт ожидание допобработки
	если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.Склад и ВидДокумента="РасходнаяНакладная" тогда
		Для Каждого СтрокаДопОбработки Из Документ.ДопОбработки Цикл
			Если СтрокаДопОбработки.ВидДопОбработки <> Справочники.ВидыДопОбработки.БезОбработки Тогда
				//Кухарь 22.11.17 начало
				//У белья доп обработка до сканирования
				//СостояниеГотовности=Перечисления.СостоянияНакладной.ОжиданиеДопОбработки;
				если ЕстьКолготки=Истина тогда
					СостояниеГотовности=Перечисления.СостоянияНакладной.ОжиданиеДопОбработки;
				КонецЕсли;
				//Кухарь 22.11.17 конец	
				Прервать;	
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	//кухарь 16.10.14 конец
	
	
	//Мессерле
	Если  ВидДокумента="Инвентаризация" тогда
		для каждого стр5 из ДокОбъект.товары цикл
			стр5.количество=стр5.количествофакт-стр5.количестворасч;
		Конеццикла;
	Конецесли;
	//Мессерле
	
	Если НЕ ЕстьОшибки Тогда
		Если НЕ (ВидДокумента="КонтрактСПроизводителем" или  ВидДокумента="ЗаказПоставщику" или (ВидДокумента="Инвентаризация" и документ.Склад.ТипСклада=перечисления.ТипСклада.ВнешнийСклад)) тогда
			
			Если ДокОбъект[ИмяРеквизитаСостояние]=Перечисления.СостоянияНакладной.Сканирование Тогда
				ВидДокумента			=ДокОбъект.Метаданные().Имя;
				ДокОбъект.ОбъемКоробов	=Ошибки.ОбъемКоробов;
				Если ВидДокумента="ПриходнаяНакладная" Тогда		
					ДокОбъект.СостояниеНакладной	=Перечисления.СостоянияНакладной.ГотоваКПриемке;
				ИначеЕсли ВидДокумента="РасходнаяНакладная" Тогда				
					//Кухарь 16.11.18 начало
					//Забыл термоусадку и паллетирование
					//ДокОбъект.СостояниеНакладной	=Перечисления.СостоянияНакладной.ГотоваКОтгрузке;
					если ложь тогда ДокОбъект=документы.РасходнаяНакладная.ПустаяСсылка();КонецЕсли;
					если ДокОбъект.НужнаТермоусадка тогда
						ДокОбъект.СостояниеНакладной	=Перечисления.СостоянияНакладной.ОжиданиеТермоусадки;					
					ИначеЕсли  ДокОбъект.НужноПаллетирование тогда
						ДокОбъект.СостояниеНакладной	=Перечисления.СостоянияНакладной.ОжиданиеПаллетирования;
						
					иначе					
						ДокОбъект.СостояниеНакладной	=Перечисления.СостоянияНакладной.ГотоваКОтгрузке;
					КонецЕсли;
					//Кухарь 16.11.18 конец
					
					//крохин начало 16.02.2012
					//если требуется доп.обработка, ставим такое состояние					
					Для Каждого СтрокаДопОбработки Из ДокОбъект.ДопОбработки Цикл
						Если СтрокаДопОбработки.ВидДопОбработки <> Справочники.ВидыДопОбработки.БезОбработки Тогда
							//Кухарь 22.11.17 начало
							//У белья доп обработка до сканирования
							//ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ДопОбработка;
							если ЕстьКолготки=Истина тогда
								ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ДопОбработка;
							КонецЕсли;
							//Кухарь 22.11.17 конец	
							
							Прервать;	
						КонецЕсли;
					КонецЦикла;
					//крохин конец 16.02.2012
				ИначеЕсли ВидДокумента="Перемещение" Тогда				
					ДокОбъект[ИмяРеквизитаСостояние]=СостояниеГотовности;
				КонецЕсли;	
			Конецесли;
			
			//Кухарь начало 21.09.12 пересчёт Кол-ва коробов из ЛН
			если ВидДокумента="Перемещение" или ВидДокумента="ПриходнаяНакладная" или ВидДокумента="РасходнаяНакладная" тогда
				ДокОбъект.количествокоробок=КолКор;
			КонецЕсли;
			//Кухарь конец 21.09.12		
			
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			
		КонецЕсли;
	КонецЕсли;	
	////Кухарь 29.02.16 начало
	////Уже не нужно наверное
	////кухарь 17.03.15 начало
	//ЗаполнитьПланыНабора(Документ);
	////кухарь 17.03.15 конец
	////Кухарь 29.02.16 конец	
	
	//Кухарь 17.02.16 начало
	ПроверитьОшибкиПоПланамНабораИИсправить(документ);
	//Кухарь 17.02.16 конец
	
	
	// Кухарь А.Ю. 26.01.2021 начало
	//
	если СписокЗНБ<>Неопределено тогда
		Для каждого СтрСписка из СписокЗНБ цикл
			ЗНБОбъект=СтрСписка.значение.получитьОбъект();
			ЗНБОбъект.записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;
	КонецЕсли;
	// Кухарь А.Ю. 26.01.2021 конец
	
	
КонецПроцедуры




// Кухарь А.Ю.  04.03.2026 начало
// Процедура ПолучитьРезультатСравнения(СУчетомНедостач=Ложь) Экспорт  
 Процедура ПолучитьРезультатСравнения(СУчетомНедостач=Ложь,УчитыватьТребующиеПроверкиЛН = ложь) Экспорт  
// Кухарь А.Ю.  04.03.2026 конец
	
	Если Документ=Неопределено Тогда Возврат КонецЕсли;
	
	ВидДокумента=Документ.Метаданные().Имя;
	
	ИмяРеквизитаКоличество	="Количество";
	ИмяТЧ					="Товары";
	
	Если ВидДокумента="Перемещение" Тогда
		Если Документ.СкладПолучатель.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда			
		ИначеЕсли Документ.Склад.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда			
			ИмяРеквизитаКоличество="ПодтвержденнаяЗаявка"; //Отгружено
		КонецЕсли;		
	ИначеЕсли ВидДокумента="Инвентаризация" Тогда
		ИмяРеквизитаКоличество="КоличествоФакт";		
	ИначеЕсли ВидДокумента="Комплектация" Тогда
		//Кухарь А.Ю.  07.11.2022 начало
		//ИмяТЧ="Комплектующие";
		если документ.ЭтоРаскомплектация и документ.ЭтоВозвратИМ тогда
			ИмяТЧ="Товары";
		иначе
			ИмяТЧ="Комплектующие";
		КонецЕсли;	 
		//Кухарь А.Ю.  07.11.2022 конец
		
		// +++ Родионов, 2011-11-02, Если РНК содержит КМП тогда сравнение с ЛН должно проходить по колонке "Номенклатура" закладки "Комплектующие"
	ИначеЕсли ВидДокумента = "РасходнаяНакладная" Тогда

		// Кельманов А.В. - SNL-119 - 2026.03.24 {
		//Если Документ.ОтгрузкаКомплектов Тогда   		
		ИспользоватьЛНТолькоДляНабора = ИспользоватьЛНТолькоДляНабора(Документ);
		
		ДопПараметрыНакладной = ОбщегоНазначения_ПИ.ПолучитьДопПараметрыНакладной(Документ);
		
		Если Документ.ОтгрузкаКомплектов И Не (СравнениеЛП И ИспользоватьЛНТолькоДляНабора И ДопПараметрыНакладной.ОтгрузкаFBS = Истина) Тогда   		
		// Кельманов А.В. - SNL-119 - 2026.03.24 }				
			
			// это РНК+КМПЛ
			ИмяТЧ = "Комплектующие";
		КонецЕсли;
		// 2011-11-02, Если РНК содержит КМП тогда сравнение с ЛН должно проходить по колонке "Номенклатура" закладки "Комплектующие", Родионов +++	
	КонецЕсли;
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ	
//	|	ПРЕДСТАВЛЕНИЕ(Номенклатура) КАК НоменклатураПредставление,
	|	Номенклатура,
	|	Номенклатура.Код77 КАК Код77,
	|	Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
	|	НомерЛН,
	|	СУММА(КолВНакл) КАК КолВНакл,	
	|	СУММА(КолВЛН) КАК КолВЛН,
	|	СУММА(КолВНакл)-СУММА(КолВЛН) КАК Разница,	
	|	ВЫБОР 
	|		КОГДА СУММА(КолВНакл)>СУММА(КолВЛН) ТОГДА СУММА(КолВНакл)-СУММА(КолВЛН)
	|		ИНАЧЕ СУММА(КолВЛН)-СУММА(КолВНакл)
	|	КОНЕЦ
	|	КАК МодульРазницы
	|ИЗ
	|(
	|ВЫБРАТЬ
	|	Номенклатура,
	|	""НАКЛ"" КАК НомерЛН,
	|	"+ИмяРеквизитаКоличество+" КАК КолВНакл,
	|	0 КАК КолВЛН
	|ИЗ
	|	Документ."+ВидДокумента+"."+ИмяТЧ+" КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка	
	|	И "+ИмяРеквизитаКоличество+" <> 0
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Номенклатура,
	|	Ссылка.Номер КАК НомерЛН,
	|	0 КАК КолВНакл,
	//++Данилова Е.В. 26.02.2026 SNL-150 
	//|	Количество КАК КолВЛН
	|	%Количество% КАК КолВЛН
	//--Данилова Е.В. 26.02.2026 
	|ИЗ
	|	Документ.ЛистНабора.Товары КАК ЛистНабораТовары
	|ГДЕ         
// Кухарь А.Ю.  04.03.2026 начало
// 	|	ВЫРАЗИТЬ(Ссылка.ДокОснование КАК Документ."+Документ.Метаданные().Имя+").Ссылка= &Ссылка
	|	Ссылка.ДокОснование = &Ссылка
// Кухарь А.Ю.  04.03.2026 конец
	
	|	И Ссылка.Проведен   	
	// Кухарь А.Ю.  06.08.2022 начало
	|	И не Ссылка.ТребуетПроверки
	// Кухарь А.Ю.  06.08.2022 конец
	
	|	И Ссылка<>&ИсключаемыйЛН
	|) КАК Сводный
	|СГРУППИРОВАТЬ ПО Номенклатура,НомерЛН	
	|ИТОГИ 
	|	СУММА(КолВНакл),СУММА(КолВЛН),СУММА(Разница),СУММА(МодульРазницы) 
	|ПО ОБЩИЕ,Номенклатура ИЕРАРХИЯ,НомерЛН"; 
	// Кухарь А.Ю.  23.10.2025 начало  
	//Help-7574	
	//|АВТОУПОРЯДОЧИВАНИЕ";
	// Кухарь А.Ю.  23.10.2025 конец   
	
   // Кухарь А.Ю.  04.03.2026 начало
   // Оптимизация
   запрос.УстановитьПараметр("ДатаЛиста",ПолучитьРеквизитШапки(Документ,"Дата","Документ")-60*24*3600);
   если  УчитыватьТребующиеПроверкиЛН тогда
	   запрос.Текст = СтрЗаменить(запрос.Текст,"И не Ссылка.ТребуетПроверки","");
   КонецЕсли;
   // Кухарь А.Ю.  04.03.2026 конец
   
	Запрос.УстановитьПараметр("ИсключаемыйЛН",	ИсключаемыйЛН);
	Запрос.УстановитьПараметр("Ссылка",			Документ);
	//++Данилова Е.В. 26.02.2026  SNL-150
	
	Если СравнениеЛП Тогда
	
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Документ.ЛистНабора","Документ.ЛистПереукладки");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Количество%","Отсканировано");
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Количество%","Количество");
	КонецЕсли;
	//--Данилова Е.В. 26.02.2026 
	Результат=Запрос.Выполнить();
	
	РезультатСравнения=Результат;
КонецПроцедуры

Функция ВывестиРезультатСравнения() Экспорт
	ТД=Новый ТабличныйДокумент;
	

// Кухарь А.Ю.  14.11.2022 начало
//
МаксУровень=0; 
// Кухарь А.Ю.  14.11.2022 конец
	
	
	//крохин начало 21.09.2018
	//номера паллет
	Если фВыводитьЛН И фВыводитьПаллеты Тогда
		ЗапросПаллеты = Новый Запрос;	
		ЗапросПаллеты.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПаллетаЛистыНабора.Ссылка.Номер КАК НомерПаллеты,
		|	ПаллетаЛистыНабора.ЛистНабора.Номер КАК НомерЛН
		|ИЗ
		|	Документ.Паллета.ЛистыНабора КАК ПаллетаЛистыНабора
		|ГДЕ
		|	ПаллетаЛистыНабора.ЛистНабора.ДокОснование = &ДокОснование
		| И ПаллетаЛистыНабора.Ссылка.Проведен
		|	И ПаллетаЛистыНабора.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2";
		ЗапросПаллеты.УстановитьПараметр("ДокОснование",Документ);				
		ЗапросПаллеты.УстановитьПараметр("Дата1",Документ.Дата - 30*24*60*60);
		ЗапросПаллеты.УстановитьПараметр("Дата2",Документ.Дата + 30*24*60*60);
		ТаблицаПаллет = ЗапросПаллеты.Выполнить().Выгрузить();
		
	КонецЕсли;
	//крохин конец 21.09.2018
	
	Макет=ПолучитьМакет("СравнениеЛН");
	
	ОблЗаголовок=Макет.ПолучитьОбласть("Заголовок|Начало");
	
	ОблЗаголовок.Параметры.Док=Документ;
	ОблЗаголовок.Параметры.Заполнить(Документ);
	
	ТД.Вывести(ОблЗаголовок);
	//крохин начало 21.09.2018
	//номера паллет
	//ТД.Вывести(Макет.ПолучитьОбласть("Шапка|Начало"));
	Если фВыводитьЛН И фВыводитьПаллеты Тогда
		
		ТД.Вывести(Макет.ПолучитьОбласть("ШапкаПаллеты|Начало"))
	Иначе
		ТД.Вывести(Макет.ПолучитьОбласть("Шапка|Начало"));	
	КонецЕсли;
	//крохин конец 21.09.2018
	
	ТД.НачатьАвтогруппировкуКолонок();
	
	ВыборкаПоЛН=РезультатСравнения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"НомерЛН");
	Пока ВыборкаПоЛН.Следующий() Цикл
		Если ВыборкаПоЛН.НомерЛН="НАКЛ" Тогда Продолжить КонецЕсли;
		
		
		//крохин начало 21.09.2018
		//номера паллет
		//ОблЛН=Макет.ПолучитьОбласть("Шапка|НомерЛН");
		//ОблЛН.Параметры.НомерЛН=СтрЗаменить(ВыборкаПоЛН.НомерЛН,СокрЛП(Документ.Номер)+"/","");
		Если фВыводитьЛН И фВыводитьПаллеты Тогда
			ОблЛН=Макет.ПолучитьОбласть("ШапкаПаллеты|НомерЛН"); 
			//++Данилова Е.В. 27.02.2026 SNL-150
			ОблЛН.Параметры.ЛН = ?(СравнениеЛП,"ЛП","ЛН"); 
			//--Данилова Е.В. 27.02.2026 
			ОблЛН.Параметры.НомерЛН=СтрЗаменить(ВыборкаПоЛН.НомерЛН,СокрЛП(Документ.Номер)+"/","");	
			ОтборПаллеты = Новый Структура();
			ОтборПаллеты.Вставить("НомерЛН",ВыборкаПоЛН.НомерЛН);
			НайденныеСтроки = ТаблицаПаллет.НайтиСтроки(ОтборПаллеты);
			СписокПаллет = "";
			Для Каждого НайденнаяСтроки Из НайденныеСтроки Цикл
				СписокПаллет = 	СписокПаллет + НайденнаяСтроки.НомерПаллеты + ",";
			КонецЦикла;
			Если ПустаяСтрока(СписокПаллет) Тогда
				СписокПаллет = "без паллет";
			Иначе
				СписокПаллет = Лев(СписокПаллет,СтрДлина(СписокПаллет) - 1);
			КонецЕсли;
			ОблЛН.Параметры.СписокПаллет = СписокПаллет;
			//++Данилова Е.В. 27.02.2026 SNL-150
			ТД.Присоединить(ОблЛН,1);
			//Иначе
		ИначеЕсли  фВыводитьЛН Тогда  		
			//--Данилова Е.В. 27.02.2026 
			ОблЛН=Макет.ПолучитьОбласть("Шапка|НомерЛН");
			//++Данилова Е.В. 27.02.2026 SNL-150
			ОблЛН.Параметры.ЛН = ?(СравнениеЛП,"ЛП","ЛН"); 
			//--Данилова Е.В. 27.02.2026
			ОблЛН.Параметры.НомерЛН=СтрЗаменить(ВыборкаПоЛН.НомерЛН,СокрЛП(Документ.Номер)+"/",""); 
			//++Данилова Е.В. 27.02.2026 SNL-150
			ТД.Присоединить(ОблЛН,1);
			//--Данилова Е.В. 27.02.2026
		КонецЕсли;
		//крохин конец 21.09.2018
		//ТД.Присоединить(ОблЛН,1);	
	КонецЦикла; 
	
	ТД.Присоединить(Макет.ПолучитьОбласть("Шапка|Разница"));	
	
	ТД.ФиксацияСверху=ТД.ВысотаТаблицы;
	
	ТД.НачатьАвтогруппировкуСтрок();	
	
	ЕстьОшибки=Ложь;
	
	ВыборкаПоНоменклатуре=РезультатСравнения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Номенклатура");
	Всего=ВыборкаПоНоменклатуре.Количество();
	
	Пока ВыборкаПоНоменклатуре.Следующий() Цикл
		
		// Кельманов А.В. - SNL-119 - 2026.03.19 {
		//ОбработкаПрерыванияПользователя();
		//
		//Состояние(Всего);
		#Если Клиент Тогда
			ОбработкаПрерыванияПользователя();
			
			Состояние(Всего);
		#КонецЕсли
		// Кельманов А.В. - SNL-119 - 2026.03.19 }
		
		Всего=Всего-1;
		
		ОблСтрока=Макет.ПолучитьОбласть("Строка|Начало");
		
		ОблСтрока.Параметры.Заполнить(ВыборкаПоНоменклатуре);
		Если НЕ ВыборкаПоНоменклатуре.ЭтоГруппа Тогда		
			ОблСтрока.Параметры.Код77=ВыборкаПоНоменклатуре.Код77;
		ИначеЕсли фТолькоОшибки Тогда
			Продолжить;			
		КонецЕсли; 
		Если ВыборкаПоНоменклатуре.Разница=0 И фТолькоОшибки Тогда Продолжить КонецЕсли; 
		
		
		ТД.Вывести(ОблСтрока,ВыборкаПоНоменклатуре.Уровень(),,Ложь);
		// Кухарь А.Ю.  14.11.2022 начало
		//
		МаксУровень=Макс(МаксУровень,ВыборкаПоНоменклатуре.Уровень()); 
		// Кухарь А.Ю.  14.11.2022 конец
				 
		Если фВыводитьЛН Тогда
			ВыборкаПоЛН=ВыборкаПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"НомерЛН","Все");
			Пока ВыборкаПоЛН.Следующий() Цикл
				Если ВыборкаПоЛН.НомерЛН="НАКЛ" Тогда Продолжить КонецЕсли;
				
				ОблЛН=Макет.ПолучитьОбласть("Строка|НомерЛН");
				ОблЛН.Параметры.Заполнить(ВыборкаПоЛН);
				
				ТД.Присоединить(ОблЛН);		
			КонецЦикла;			
		КонецЕсли;		
		
		ОблКонец=Макет.ПолучитьОбласть("Строка|Разница");
		ОблКонец.Параметры.Заполнить(ВыборкаПоНоменклатуре);
		
		ТД.Присоединить(ОблКонец,0);
		
		ТекОбласть=ТД.Область(ТД.ВысотаТаблицы,2,ТД.ВысотаТаблицы,ТД.ШиринаТаблицы);
		
		Если ВыборкаПоНоменклатуре.ЭтоГруппа Тогда
			ТекОбласть.Шрифт=Новый Шрифт(,,Истина);	
		КонецЕсли; 
		
		Если ВыборкаПоНоменклатуре.Разница>0 Тогда
			ЕстьОшибки=Истина;
			ТекОбласть.ЦветФона=Новый Цвет(255,255,0);		
		ИначеЕсли ВыборкаПоНоменклатуре.Разница<0 Тогда
			ЕстьОшибки=Истина;
			ТекОбласть.ЦветФона=Новый Цвет(255,150,150);
		КонецЕсли;		
	КонецЦикла; 
	
	ТД.ЗакончитьАвтогруппировкуСтрок();
	
	ТД.ЗакончитьАвтогруппировкуКолонок();
	
	
	ОблИтогоНачало	=Макет.ПолучитьОбласть("Итого|Начало");
	ОблИтогоРазница	=Макет.ПолучитьОбласть("Итого|Разница");
	
	Выборка=РезультатСравнения.Выбрать();
	Если Выборка.Следующий() Тогда
		ОблИтогоНачало.Параметры.Заполнить(Выборка);
		ОблИтогоРазница.Параметры.Заполнить(Выборка);		
	КонецЕсли; 
	ТД.Вывести(ОблИтогоНачало);
	//++Данилова Е.В. 27.02.2026 SNL-150
	если фВыводитьЛН Тогда
		ВыборкаПоЛН=РезультатСравнения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"НомерЛН");
		Пока ВыборкаПоЛН.Следующий() Цикл
			Если ВыборкаПоЛН.НомерЛН="НАКЛ" Тогда Продолжить КонецЕсли;
			
			ОблЛН=Макет.ПолучитьОбласть("Итого|НомерЛН");
			ОблЛН.Параметры.Заполнить(ВыборкаПоЛН);
			ТД.Присоединить(ОблЛН);	
		КонецЦикла;
	КонецЕсли;
	//--Данилова Е.В. 27.02.2026
	ТД.Присоединить(ОблИтогоРазница);
	
	ТД.ОтображатьЗаголовки	=Ложь;
	ТД.ОтображатьСетку		=Ложь;
	
	
	ТД.ИмяПараметровПечати			="ОпцииПечати_СравнениеЛистовНабора";	
	ТД.ИмяСохраненияПоложенияОкна   ="РазмерОкна_СравнениеЛистовНабора";
	
	
	Обл=ТД.Область(6,2,6,2);
	Если ЕстьОшибки Тогда
		Обл.Текст="ЕСТЬ ОШИБКИ НАБОРА";	
		Обл.ЦветТекста=Новый Цвет(255,0,0);		
	Иначе
		Обл.Текст="НЕТ ОШИБОК";			
	КонецЕсли; 
	
	
	// Кельманов А.В. - SNL-119 - 2026.03.19 {
	//УстановитьКолонтитулы(ТД);	
	#Если Клиент Тогда
		УстановитьКолонтитулы(ТД);	
	#КонецЕсли
	// Кельманов А.В. - SNL-119 - 2026.03.19 }
	
	//ТД.Показать("Сравнение набора: "+Документ);
	
	// Кухарь А.Ю.  14.11.2022 начало
	//
	ТД.ПоказатьУровеньГруппировокСтрок(МаксУровень); 
	// Кухарь А.Ю.  14.11.2022 конец
	
	
	
	Возврат ТД;	
КонецФункции

Функция ПолучитьОбъемКоробов()
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ	
	|	СУММА(ОбъемКоробов) КАК ОбъемКоробов,	
	|	СУММА(КоличествоКоробок) КАК КоличествоКоробок
	|ИЗ
	|	Документ.ЛистНабора
	|ГДЕ
	|	ДокОснование= &Ссылка
	|	И Проведен";
	
	Запрос.УстановитьПараметр("Ссылка",Документ);	
	//++Данилова Е.В. 26.02.2026 SNL-150  
	если СравнениеЛП Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Документ.ЛистНабора","Документ.ЛистПереукладки"); 
	КонецЕсли;
	//--Данилова Е.В. 26.02.2026 
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда		
		Результат=Новый Структура("ОбъемКоробов,КоличествоКоробок",Выборка.ОбъемКоробов,Выборка.КоличествоКоробок);
	Иначе
		Результат=Новый Структура("ОбъемКоробов,КоличествоКоробок",0,0);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПолучитьОбъемКоробов() 

Функция ПолучитьОшибкиНабора() Экспорт
	Ошибки=Ложь;
	
	ТП=Новый ТаблицаЗначений;
	ТП.Колонки.Добавить("Номенклатура");
	ТП.Колонки.Добавить("КолВНакл");
	ТП.Колонки.Добавить("КолВЛН");
	ТП.Колонки.Добавить("Разница");
	
	ТН=ТП.Скопировать();
	
	Если РезультатСравнения=Неопределено Тогда ПолучитьРезультатСравнения() КонецЕсли; 	
	Если РезультатСравнения=Неопределено Тогда Возврат Новый Структура("Ошибки,ТП,ТН",Истина,ТП,ТН) КонецЕсли; // видимо не указан докмент или какая ошибка		
	
	ВыборкаПоНоменклатуре=РезультатСравнения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Номенклатура");
	Пока ВыборкаПоНоменклатуре.Следующий() Цикл
		Если ВыборкаПоНоменклатуре.ТипЗаписи()=ТипЗаписиЗапроса.ИтогПоГруппировке Тогда
			Если ВыборкаПоНоменклатуре.Разница<0 Тогда //Перебор
				СтрокаТО=ТП.Добавить();
			ИначеЕсли ВыборкаПоНоменклатуре.Разница>0 Тогда //Недобор
				СтрокаТО=ТН.Добавить();
			Иначе //усе в порядке
				Продолжить;			
			КонецЕсли;		
			
			ЗаполнитьЗначенияСвойств(СтрокаТО,ВыборкаПоНоменклатуре);
			Ошибки=Истина;
		КонецЕсли;		
	КонецЦикла;
	
	ТП.Сортировать("Номенклатура");
	ТН.Сортировать("Номенклатура");
	
	ОбъемКоробов=ПолучитьОбъемКоробов();
	
	Возврат Новый Структура("Ошибки,ТП,ТН,ОбъемКоробов,КоличествоКоробок",Ошибки,ТП,ТН,ОбъемКоробов.ОбъемКоробов,ОбъемКоробов.КоличествоКоробок);
КонецФункции // ПолучитьОшибкиНабора()

Процедура ВывестиТаблицуОшибок(ТО,ВидТО) Экспорт
	ТД		=Новый ТабличныйДокумент;
	
	Макет	=ПолучитьМакет("ТаблицаОшибок");	
	
	ОблЗаголовок=Макет.ПолучитьОбласть("Заголовок");
	ОблЗаголовок.Параметры.Документ	=Документ;
	ОблЗаголовок.Параметры.ВидТО	=ВидТО;
	
	ТД.Вывести(ОблЗаголовок);
	
	ОблШапка	=Макет.ПолучитьОбласть("Шапка");	
	ТД.Вывести(ОблШапка);
	
	Для Каждого СтрокаТО Из ТО Цикл
		ОблСтрока=Макет.ПолучитьОбласть("Строка");
		ОблСтрока.Параметры.Заполнить(СтрокаТО);	
		
		ТД.Вывести(ОблСтрока);
	КонецЦикла; 
	
	// Кельманов А.В. - SNL-119 - 2026.03.19 {
	//УстановитьКолонтитулы(ТД);	
	#Если Клиент Тогда
		УстановитьКолонтитулы(ТД);	
	#КонецЕсли
	// Кельманов А.В. - SNL-119 - 2026.03.19 }
	
	ТД.ИмяПараметровПечати			="ПараметрыПечати_ТаблицаОшибокНабора";
	ТД.ИмяСохраненияПоложенияОкна   ="ПоложениеОкна_ТаблицаОшибокНабора";
	ТД.ОтображатьСетку		=Ложь;
	ТД.ОтображатьЗаголовки	=Ложь;
	
	ТД.Показать("Перебор по накладной: "+Документ);
КонецПроцедуры


//кухарь 17.03.15 начало
Процедура ЗаполнитьПланыНабора (Накладная)
	запрос=новый Запрос;
	//++Данилова Е.В. 26.02.2026 SNL-150
	//запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	//|	ЛистНабора.Ссылка как ЛН
	//|ИЗ
	//|	Документ.ЛистНабора КАК ЛистНабора
	//|ГДЕ
	//|	ЛистНабора.Проведен
	//|	И ЛистНабора.ДокОснование = &ДокОснование
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ЛистНабора.Дата УБЫВ";
	запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛистНабораДок.Ссылка КАК ЛН
	|ИЗ
	|	Документ.ЛистНабора КАК ЛистНабораДок
	|ГДЕ
	|	ЛистНабораДок.Проведен
	|	И ЛистНабораДок.ДокОснование = &ДокОснование
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛистНабораДок.Дата УБЫВ";
	//--Данилова Е.В. 26.02.2026 
	запрос.УстановитьПараметр("ДокОснование",Накладная.ссылка); 
	//++Данилова Е.В. 26.02.2026 SNL-150  
	если СравнениеЛП Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Документ.ЛистНабора","Документ.ЛистПереукладки"); 
	КонецЕсли;
	//--Данилова Е.В. 26.02.2026
	Результат=запрос.Выполнить().Выбрать();
	пока Результат.Следующий() цикл
		ЛН=Результат.ЛН.получитьобъект();
		ЛН.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
КонецПроцедуры


//Кухарь 17.02.16 начало
//Планы набора меняем тоже
Процедура ПроверитьОшибкиПоПланамНабораИИсправить(ДокОснование )
	
	
	ПланНабора=Неопределено;
	Разбивали=ложь;
	НужноЗаписатьПланНабора=ложь;
	Запрос=Новый запрос;
	запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПланНабора.Ссылка как ПланНабора
	|ИЗ
	|	Документ.ПланНабора КАК ПланНабора
	|ГДЕ
	|	ПланНабора.ДокОснование = &ДокОснование
	|	И ПланНабора.Проведен";
	запрос.УстановитьПараметр("ДокОснование",ДокОснование.Ссылка);
	результат=запрос.Выполнить().Выбрать();
	пока результат.Следующий() цикл
		ПланНабора=результат.ПланНабора.получитьобъект();
		
		если ложь тогда
			ПланНабора=Документы.ПланНабора.НайтиПоНомеру("").ПолучитьОбъект();
		КонецЕсли;
		
		Для каждого СтрТЧ из ПланНабора.тБрэндов цикл
			СтрТЧ.Состояние=ДокОснование.состояниенакладной;
			СтрТЧ.СканировкаЗакончена=Истина;
			если СтрТЧ.ОкончаниеСканировки=ПустаяДата() тогда
				СтрТЧ.ОкончаниеСканировки=ТекущаяДата();
			КонецЕсли;
			
		КонецЦикла;
		
		ПланНабора.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
	
	
	
	
	
КонецПроцедуры
//Кухарь 17.02.16 конец


// Кухарь А.Ю. 07.04.2020 начало
// Скорректируем ЗНБ
Функция ЗаполнитьЗНБ(ТЗВычерков)
	
	// Кухарь А.Ю. 26.01.2021 начало
	СписокЗНБ=новый СписокЗначений; 
	// Кухарь А.Ю. 26.01.2021 конец
	
	ТЗВычерков.колонки.добавить("КоличествоШтуки");
	// Кухарь А.Ю.  06.08.2022 начало
	// Оптимизация
	МассивНоменклатуры=ТЗВычерков.выгрузитьколонку("Номенклатура"); 
	Запрос=новый Запрос;
	запрос.Текст= "ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.Родитель.ШтукВКоробке КАК ШтукВКоробке
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&МассивНоменклатуры)";
	запрос.УстановитьПараметр("МассивНоменклатуры",МассивНоменклатуры);
	ТЗШтукВКоробек=запрос.Выполнить().Выгрузить();
	// Кухарь А.Ю.  06.08.2022 конец
	
	для каждого СтрТЗ из ТЗВычерков цикл
		
		// Кухарь А.Ю.  06.08.2022 начало
		//КоличествоВКоробе=СтрТЗ.Номенклатура.родитель.ШтукВКоробке;
		КоличествоВКоробе=ТЗШтукВКоробек.Найти(СтрТЗ.Номенклатура,"Номенклатура").ШтукВКоробке; 
		// Кухарь А.Ю.  06.08.2022 конец
		
		если КоличествоВКоробе=0 тогда
			СтрТЗ.КоличествоШтуки=СтрТЗ.количество;
		иначе
			СтрТЗ.КоличествоШтуки=стртз.количество - цел(СтрТЗ.количество/КоличествоВКоробе);
		КонецЕсли;
	КонецЦикла;
	
	Запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ
	|	ЗаданиеНабораТовары.Номенклатура КАК Номенклатура,
	|	ЗаданиеНабораТовары.Ссылка КАК ЗНБ
	|ИЗ
	|	Документ.ЗаданиеНабора.Товары КАК ЗаданиеНабораТовары
	|ГДЕ
	|	ЗаданиеНабораТовары.Ссылка.Дата >= &Дата
	|	И ЗаданиеНабораТовары.Ссылка.Проведен
	|	И ЗаданиеНабораТовары.Ссылка.Накладная = &Накладная
	|	И ЗаданиеНабораТовары.Номенклатура В(&СписокНоменклатуры)
	// Кухарь А.Ю.  06.08.2022 начало
	//	              |	И ЗаданиеНабораТовары.Количество > 0
	// Кухарь А.Ю.  06.08.2022 конец
	
	
	|ИТОГИ ПО
	|	ЗНБ,
	|	Номенклатура";
	запрос.УстановитьПараметр("Дата",Документ.Дата-30*24*3600);
	запрос.УстановитьПараметр("Накладная",Документ);
	
	// Кухарь А.Ю.  06.08.2022 начало
	// 	запрос.УстановитьПараметр("СписокНоменклатуры",ТЗВычерков.выгрузитьколонку("Номенклатура"));
	запрос.УстановитьПараметр("СписокНоменклатуры",МассивНоменклатуры);	 
	// Кухарь А.Ю.  06.08.2022 конец
	
	ВыборкаЗНБ=запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ЗНБ");
	если ВыборкаЗНБ.Количество()=0 тогда
		возврат Истина;
	КонецЕсли;
	НачатьТранзакцию();
	
	пока ВыборкаЗНБ.Следующий() цикл
		ЗНБ=ВыборкаЗНБ.ЗНБ.получитьобъект();
		этоблочки= ЗНБ.этоблочки;
		если ложь тогда ЗНБ=документы.ЗаданиеНабора.ПустаяСсылка().ПолучитьОбъект();КонецЕсли;
		ВыборкаНоменклатура=ВыборкаЗНБ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Номенклатура");
		пока ВыборкаНоменклатура.Следующий() цикл
			Номенклатура=ВыборкаНоменклатура.Номенклатура;
			СтрТЗ=ТЗВычерков.найти(Номенклатура);
			если  этоблочки тогда  //Сортировка выборки такова, что сначала вычёркивают ЗНБ с этоблочки, потом коробные
				если СтрТЗ.КоличествоШтуки<>0 тогда
					СтрТЧ=ЗНБ.Товары.Найти(Номенклатура);
					Если СтрТЧ.Количество>=-СтрТЗ.КоличествоШтуки тогда
						СтрТЧ.Количество=СтрТЧ.Количество+СтрТЗ.КоличествоШтуки;  //Строка из ЗНБ
						СтрТЗ.Количество=СтрТЗ.Количество-СтрТЗ.КоличествоШтуки;  //Строка из ТЗ
						
						СтрТЗ.КоличествоШтуки=0;
						
					Иначе    //По идее такого не дольжно быть, это значит что в ЗНБ со штуками товара меньше чем пытаются вычеркнуть щтук
						Дельта=СтрТЧ.Количество+СтрТЗ.КоличествоШтуки;
						СтрТЧ.Количество=0;
						СтрТЗ.Количество =СтрТЗ.Количество-СтрТЗ.КоличествоШтуки+Дельта;
						СтрТЗ.КоличествоШтуки=Дельта;
					КонецЕсли;
				КонецЕсли;
			иначе
				если СтрТЗ.Количество<>0 тогда //Могло уже всё выбраться в ЗНБ со штуками
					СтрТЧ=ЗНБ.Товары.Найти(Номенклатура);
					Если СтрТЧ.Количество>=-СтрТЗ.Количество тогда
						СтрТЧ.Количество=СтрТЧ.Количество+СтрТЗ.Количество; //Строка из ЗНБ
						СтрТЗ.Количество=0; 								//Строка из ТЗ
					Иначе    //По идее такого не дольжно быть, это значит что в ЗНБ со штуками товара меньше чем пытаются вычеркнуть щтук
						Дельта=СтрТЧ.Количество+СтрТЗ.Количество;
						СтрТЧ.Количество=0;
						СтрТЗ.Количество=Дельта;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		если ЗНБ.Модифицированность() тогда
			знб.Записать(РежимЗаписиДокумента.Проведение);
			// Кухарь А.Ю. 26.01.2021 начало
			//
			если СписокЗНБ.НайтиПоЗначению(ЗНБ) = Неопределено тогда
				СписокЗНБ.Добавить(знб.Ссылка);
			КонецЕсли;
			// Кухарь А.Ю. 26.01.2021 конец
			
		КонецЕсли;	
	КонецЦикла;
	
	
	
	если ТЗВычерков.найтистроки(Новый Структура("Количество",0)).количество()<>ТЗВычерков.количество() тогда
		ОтменитьТранзакцию();
		Возврат ложь;     //Если что-то не так, то все ЗНБ возвращаем как было
	КонецЕсли;
	ЗафиксироватьТранзакцию();
	возврат Истина;
	
КонецФункции
// Кухарь А.Ю. 07.04.2020 конец 
//++Данилова Е.В. 27.02.2026
Функция ПолучитьОшибкиНабораПоЛистамОбщий() Экспорт
	Ошибки=Ложь; 
	перебор = ложь; 
	Недостача = Ложь; 
	Результат = ПолучитьРезультатСравненияОптим(); 
	Выборка = Результат.Выбрать(); 
	Пока Выборка.Следующий() Цикл
	
	
		Недостача = Выборка.Разница > 0; 
		перебор   = Выборка.Разница < 0;
		
		Ошибки = Недостача Или Перебор; 
	КонецЦикла;
		
	ОбъемКоробов=ПолучитьОбъемКоробов();
	
	Возврат Новый Структура("Ошибки,Перебор,Недостача,ОбъемКоробов,КоличествоКоробок",Ошибки,перебор,Недостача,ОбъемКоробов.ОбъемКоробов,ОбъемКоробов.КоличествоКоробок);
КонецФункции // ПолучитьОшибкиНабора()

Функция ПолучитьРезультатСравненияОптим() Экспорт
	 
	ВидДокумента=Документ.Метаданные().Имя;
	
	ИмяРеквизитаКоличество	="Количество";
	ИмяТЧ					="Товары";
	
	Если ВидДокумента="Перемещение" Тогда
		Если Документ.СкладПолучатель.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда			
		ИначеЕсли Документ.Склад.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код Тогда			
			ИмяРеквизитаКоличество="ПодтвержденнаяЗаявка"; //Отгружено
		КонецЕсли;		
	ИначеЕсли ВидДокумента="Инвентаризация" Тогда
		ИмяРеквизитаКоличество="КоличествоФакт";		
	ИначеЕсли ВидДокумента="Комплектация" Тогда
		если документ.ЭтоРаскомплектация и документ.ЭтоВозвратИМ тогда
			ИмяТЧ="Товары";
		иначе
			ИмяТЧ="Комплектующие";
		КонецЕсли;	 
	ИначеЕсли ВидДокумента = "РасходнаяНакладная" Тогда
		
		// Кельманов А.В. - SNL-119 - 2026.03.24 {
		//Если Документ.ОтгрузкаКомплектов Тогда   		
		ИспользоватьЛНТолькоДляНабора = ИспользоватьЛНТолькоДляНабора(Документ);
		
		ДопПараметрыНакладной = ОбщегоНазначения_ПИ.ПолучитьДопПараметрыНакладной(Документ);
		
		Если Документ.ОтгрузкаКомплектов И Не (СравнениеЛП И ИспользоватьЛНТолькоДляНабора И ДопПараметрыНакладной.ОтгрузкаFBS = Истина) Тогда   		
		// Кельманов А.В. - SNL-119 - 2026.03.24 }				
			
			ИмяТЧ = "Комплектующие";
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	СУММА("+ИмяРеквизитаКоличество+") КАК КолВНакл
	|ПОМЕСТИТЬ ВТНакладная
	|ИЗ
	|	Документ."+ВидДокумента+"."+ИмяТЧ+" КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И "+ИмяРеквизитаКоличество+" <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЛистНабораДок.КоличествоДокумента) КАК КолЛН
	|ПОМЕСТИТЬ ВТЛН
	|ИЗ
	|	Документ.ЛистНабора КАК ЛистНабораДок
	|ГДЕ
	|	ВЫРАЗИТЬ(ЛистНабораДок.Ссылка.ДокОснование КАК Документ."+Документ.Метаданные().Имя+").Ссылка = &Ссылка
	|	И ЛистНабораДок.Ссылка.Проведен
	|	И НЕ ЛистНабораДок.Ссылка.ТребуетПроверки
	|	И ЛистНабораДок.Ссылка <> &ИсключаемыйЛН
	|	И ЛистНабораДок.Завершен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сумма(ЕСТЬNULL(ВТНакладная.КолВНакл,0)) - Сумма(ЕСТЬNULL(ВТЛН.КолЛН, 0)) КАК Разница
	|ИЗ
	|	ВТНакладная КАК ВТНакладная
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТЛН КАК ВТЛН
	|		ПО (ИСТИНА)"; 
	
	
//	Запрос=Новый Запрос;
//	Запрос.Текст="
//	|ВЫБРАТЬ	
////	|	ПРЕДСТАВЛЕНИЕ(Номенклатура) КАК НоменклатураПредставление,
//	|	Номенклатура,
//	|	Номенклатура.Код77 КАК Код77,
//	|	Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
//	|	НомерЛН,
//	|	СУММА(КолВНакл) КАК КолВНакл,	
//	|	СУММА(КолВЛН) КАК КолВЛН,
//	|	СУММА(КолВНакл)-СУММА(КолВЛН) КАК Разница,	
//	|	ВЫБОР 
//	|		КОГДА СУММА(КолВНакл)>СУММА(КолВЛН) ТОГДА СУММА(КолВНакл)-СУММА(КолВЛН)
//	|		ИНАЧЕ СУММА(КолВЛН)-СУММА(КолВНакл)
//	|	КОНЕЦ
//	|	КАК МодульРазницы
//	|ИЗ
//	|(
//	|ВЫБРАТЬ
//	|	Номенклатура,
//	|	""НАКЛ"" КАК НомерЛН,
//	|	"+ИмяРеквизитаКоличество+" КАК КолВНакл,
//	|	0 КАК КолВЛН
//	|ИЗ
//	|	Документ."+ВидДокумента+"."+ИмяТЧ+" КАК Товары
//	|ГДЕ
//	|	Товары.Ссылка = &Ссылка	
//	|	И "+ИмяРеквизитаКоличество+" <> 0
//	|ОБЪЕДИНИТЬ ВСЕ
//	|ВЫБРАТЬ
//	|	Номенклатура,
//	|	Ссылка.Номер КАК НомерЛН,
//	|	0 КАК КолВНакл,
//	//++Данилова Е.В. 26.02.2026 SNL-150 
//	//|	Количество КАК КолВЛН
//	|	%Количество% КАК КолВЛН
//	//--Данилова Е.В. 26.02.2026 
//	|ИЗ
//	|	Документ.ЛистНабора.Товары КАК ЛистНабораТовары
//	|ГДЕ
//	|	ВЫРАЗИТЬ(Ссылка.ДокОснование КАК Документ."+Документ.Метаданные().Имя+").Ссылка= &Ссылка
//	|	И Ссылка.Проведен
//	// Кухарь А.Ю.  06.08.2022 начало
//	|	И не Ссылка.ТребуетПроверки
//	// Кухарь А.Ю.  06.08.2022 конец
//	
//	|	И Ссылка<>&ИсключаемыйЛН
//	|) КАК Сводный
//	|СГРУППИРОВАТЬ ПО Номенклатура,НомерЛН	
//	|ИТОГИ 
//	|	СУММА(КолВНакл),СУММА(КолВЛН),СУММА(Разница),СУММА(МодульРазницы) 
//	|ПО ОБЩИЕ,Номенклатура ИЕРАРХИЯ,НомерЛН"; 
	// Кухарь А.Ю.  23.10.2025 начало  
	//Help-7574	
	//|АВТОУПОРЯДОЧИВАНИЕ";
	// Кухарь А.Ю.  23.10.2025 конец

	Запрос.УстановитьПараметр("ИсключаемыйЛН",	ИсключаемыйЛН);
	Запрос.УстановитьПараметр("Ссылка",			Документ); 
	
	Если СравнениеЛП Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Документ.ЛистНабора","Документ.ЛистПереукладки");
		//	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Количество%","Отсканировано");
		//Иначе 
		//	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Количество%","Количество");
	КонецЕсли;
	//--Данилова Е.В. 26.02.2026 
	Результат=Запрос.Выполнить();
	
	Возврат результат; 
КонецФункции


//--Данилова Е.В. 27.02.2026 
