//Шаблон балванка для регламентного задания

Процедура Сформировать(ТаблицаПараметров=НЕОПРЕДЕЛЕНО) Экспорт  
	
	Если ТаблицаПараметров=Неопределено Тогда 
		
		Возврат;
		
	Иначе   	
		ЗаписатьВЛог("Регламент_Проверка","Старт проверки статусов рег.заданий","Информация");
		
		
		ОтборПоКлючу = Новый Структура();
		ОтборПоКлючу.Вставить("Имя","Ключ");  				
		
		ПоискКода=ТаблицаПараметров.НайтиСтроки(ОтборПоКлючу);
		
		Если ПоискКода.Количество()>0 Тогда
			
			//получим список получателей
			СписокПолучателей=новый СписокЗначений;
			
			СписокРазработчика=новый СписокЗначений;
            СписокРазработчика.Добавить("timofeev@collant.ru");
			
			ОтборПоКлючу = Новый Структура();
			ОтборПоКлючу.Вставить("Имя","Почта");
			
			ПоискПочты=ТаблицаПараметров.НайтиСтроки(ОтборПоКлючу);
			
			Если ПоискПочты.Количество()>0 Тогда
				Для каждого НайденнаяПочта из ПоискПочты Цикл
					СписокПолучателей.Добавить(НайденнаяПочта.Значение);
				КонецЦикла;
			КонецЕсли;
			//получим список получателей  
			
			
			
			Для каждого НайденныйКлюч из ПоискКода Цикл
				
				//ключ регламентного задания
				ЗначениеКода  = НайденныйКлюч.Значение;
				//время в минутах
				ВремяВминутах = НайденныйКлюч.Комментарий;
				
				Попытка     					
					ВремяВСекундах = Число(ВремяВминутах) *60 ;					
				Исключение                                     					
					ВремяВСекундах = 3600;                     					
				КонецПопытки;                                  				
				
				Если ЗначениеЗаполнено(ЗначениеКода) Тогда
					
					СтруктураДляОтбора = Новый Структура;
					СтруктураДляОтбора.Вставить("Ключ",ЗначениеКода);
					
					Фоновые = ФоновыеЗадания.ПолучитьФоновыеЗадания(СтруктураДляОтбора);
					
					Если Фоновые.Количество()=0 Тогда
						
						//Если Час(ТекущаяДата())>10  Тогда
						//	
						//	Попытка
						//		Если СписокПолучателей.Количество()>0 Тогда
						//			Сооб="Время больше 10 утра , а данных по фоновому заданию нет. Нужно проверить";								
						//			
						//			ТекстОповещения="Здравствуйте!"+Символы.ПС+Сооб;
						//			
						//			ОбменМаркетПлейс.ОтправитьПочтовоеСообщениеИзЕкода(СписокПолучателей,"НЕТ ДАННЫХ по ФОНОВЫМ ЗАДАНИЯМ !",ТекстОповещения); 
						//		КонецЕсли;
						//	Исключение
						//		
						//	КонецПопытки;
						//	
						//КонецЕсли;
						
					Иначе
						
						Для Каждого ФоновоеЗадание из Фоновые Цикл 						
							
							Ошибки ="";
							
							Если ФоновоеЗадание.ИнформацияОбОшибке <> Неопределено Тогда
								Ошибки = ФоновоеЗадание.ИнформацияОбОшибке.Описание;
							КонецЕсли;
							
							
							Старт=ФоновоеЗадание.Начало;
							финиш=ФоновоеЗадание.Конец;
							
							Если Финиш = Неопределено Тогда  //значит задание выполняется и еще не окончено
								Финиш=ТекущаяДатаСеанса();								
							Иначе
								Продолжить;
							КонецЕсли;
							
							Разница = финиш - Старт;         //сколько секунд выполняется задание
							
							Если Разница>ВремяВСекундах Тогда
								
								//отправить сообщение , что оно зависло и будет завершено через 30 минут
								
								Попытка
									
									Если СписокПолучателей.Количество()>0 Тогда
										
										Если ЗначениеЗаполнено(ФоновоеЗадание.Наименование) Тогда
											
											ИмяФонЗадания =  ФоновоеЗадание.Наименование
											
										Иначе
											
											ИмяФонЗадания = ФоновоеЗадание.Ключ;
											
										КонецЕсли;
										
										
										Сооб="Зависло ФОНОВОЕ ЗАДАНИЕ ["+ИмяФонЗадания+"] - выполняется :"+Формат(Дата(1,1,1)+Разница,"ДЛФ=T")+Символы.ПС+"Реанимировано с 1 попытки";								
										
										ТекстОповещения="Здравствуйте!"+Символы.ПС+Сооб+Символы.ПС+"Выявлены ошибки "+Ошибки;
										
										ОбменМаркетПлейс.ОтправитьПочтовоеСообщениеИзЕкода(СписокПолучателей,"Зависло ФОНОВОЕ ЗАДАНИЕ ["+ИмяФонЗадания+"] - реанимировано",ТекстОповещения);  
									КонецЕсли; 									
									
								Исключение
									
								КонецПопытки;				
								
								
								ФоновоеЗадание = ФоновоеЗадание.ОжидатьЗавершенияВыполнения(60);
								
								ЗаписатьВЛог("Регламент_Проверка","Зависло ФОНОВОЕ ЗАДАНИЕ ["+ФоновоеЗадание.Наименование+"] - РЕАНИМИРОВАНО","Информация"); 
								
								Ошибки ="";
								
							ИначеЕсли Разница>(ВремяВСекундах+1800) Тогда	
								//отправить сообщение , что оно зависло и завершено
								
								ФоновоеЗадание.Отменить();         								
								
								Попытка
									
									Если СписокПолучателей.Количество()>0 Тогда
										
										Если ЗначениеЗаполнено(ФоновоеЗадание.Наименование) Тогда
											
											ИмяФонЗадания =  ФоновоеЗадание.Наименование
											
										Иначе
											
											ИмяФонЗадания = ФоновоеЗадание.Ключ;
											
										КонецЕсли;   										
										
										Сооб="Зависло ФОНОВОЕ ЗАДАНИЕ ["+ИмяФонЗадания+"] - выполняется :"+Формат(Дата(1,1,1)+Разница,"ДЛФ=T")+Символы.ПС+"Отменено пользователем";								
										
										ТекстОповещения="Здравствуйте!"+Символы.ПС+Сооб+Символы.ПС+"Выявлены ошибки "+Ошибки;
										
										ОбменМаркетПлейс.ОтправитьПочтовоеСообщениеИзЕкода(СписокПолучателей,"Зависло ФОНОВОЕ ЗАДАНИЕ ["+ИмяФонЗадания+"] - ОТМЕНЕНО",ТекстОповещения);
										
									КонецЕсли; 									
									
								Исключение
									
								КонецПопытки;	
								
								ЗаписатьВЛог("Регламент_Проверка","Зависло ФОНОВОЕ ЗАДАНИЕ ["+ФоновоеЗадание.Наименование+"] - ОТМЕНЕНО","Информация");
								
								Ошибки ="";     
								
							КонецЕсли;
							
							Если ЗначениеЗаполнено(Ошибки) Тогда
																
								Если ЗначениеЗаполнено(ФоновоеЗадание.Наименование) Тогда
									
									ИмяФонЗадания =  ФоновоеЗадание.Наименование
									
								Иначе
									
									ИмяФонЗадания = ФоновоеЗадание.Ключ;
									
								КонецЕсли;   										
								
								Сооб="ФОНОВОЕ ЗАДАНИЕ ["+ИмяФонЗадания+"] - завершено с ошибкой " +Символы.ПС+"Отменено пользователем";								
								
								ТекстОповещения="Здравствуйте!"+Символы.ПС+"Выявлены ошибки "+Ошибки;
								
								ОбменМаркетПлейс.ОтправитьПочтовоеСообщениеИзЕкода(СписокРазработчика,"ФОНОВОЕ ЗАДАНИЕ ["+ИмяФонЗадания+"] - завершено с ошибкой",ТекстОповещения);
																
							КонецЕсли;     						
							
						КонецЦикла;  											
						
					КонецЕсли;       
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;     		
		
		ЗаписатьВЛог("Регламент_Проверка","Конец проверки статуса рег.заданий","Информация");	
		
	КонецЕсли;
	
КонецПроцедуры