
&НаСервере
Процедура ПеревозчикПриИзмененииНаСервере()  
	
	// по коду контрагента сделать.
	если Объект.Перевозчик.Наименование  = "ООО ЭЙР ТРАНС АВТО" тогда
		Объект.АдресПеревозчика = "ООО ЭЙР ТРАНС АВТО, г. Домодедово,ул.Лесная,д.23";
		Объект.КонтЛицо = "Орлов А.Б.,т.89055996669";
		
	ИначеЕсли Объект.Перевозчик.Наименование = "ООО Промо Бизнес Логистика" тогда
		Объект.АдресПеревозчика = "ООО Промо Бизнес Логистика, г.Москва,ул.Кацюбинского, д.4";
		Объект.КонтЛицо = "Сафонова Т.И., ТЕЛ. 5891442";
		
	КонецЕсли;
	Попытка
		Объект.КонтЛицо = ""+Объект.Перевозчик.ТерриториальныйМенеджер + " "+ СокрЛП(Объект.Перевозчик.Телефоны);
	Исключение
	КонецПопытки;
	Объект.АдресПеревозчика =  Объект.Перевозчик.ЮридическийАдрес;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревозчикПриИзменении(Элемент)
	
	ПеревозчикПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Если Объект.ОтправительФио.Пустая()   Тогда
			
		Объект.ОтправительФио = ПараметрыСеанса.Пользователь.ФизЛицо;	
				
	КонецЕсли;
 	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗаказнаяМашинаПриИзмененииНаСервере()
	
	Если Объект.ЗаказнаяМашина.Водитель.НеИспользовать Тогда
		Сообщить("Ошибка: выбран запрещенный к использованию водитель: "+Объект.ЗаказнаяМашина.Водитель+"!");
		Объект.ЗаказнаяМашина = Справочники.Автомобили.ПустаяСсылка();
		Возврат;
	КонецЕсли;
	
	Объект.МаркаТС=Объект.ЗаказнаяМашина.Марка;
	
	Если ПустаяСтрока(Объект.ЗаказнаяМашина.Контрагент) тогда
		Объект.КонтЛицо = Объект.ЗаказнаяМашина.Родитель.Контрагент.ФизЛицо.Наименование+" "+Объект.ЗаказнаяМашина.Родитель.Контрагент.ФизЛицо.Телефон;
	Иначе  
		Объект.КонтЛицо = Объект.ЗаказнаяМашина.Контрагент.ФизЛицо.Наименование+" "+Объект.ЗаказнаяМашина.Контрагент.ФизЛицо.Телефон;
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.ЗаказнаяМашина.Контрагент) тогда
		Объект.Перевозчик = Объект.ЗаказнаяМашина.Родитель.Контрагент;
	Иначе  
		Объект.Перевозчик = Объект.ЗаказнаяМашина.Контрагент;
	КонецЕсли;
	
	
	Если ПустаяСтрока(Объект.ЗаказнаяМашина.Контрагент) тогда
		Объект.АдресПеревозчика = Объект.ЗаказнаяМашина.Родитель.Контрагент.ПочтовыйАдрес;
	Иначе  
		Объект.АдресПеревозчика = Объект.ЗаказнаяМашина.Контрагент.ПочтовыйАдрес;
	КонецЕсли;
    	
	Если НЕ ПустаяСтрока(Объект.Перевозчик) тогда
		Объект.АдресПеревозчика =  Объект.Перевозчик.ЮридическийАдрес
	КонецЕсли;

	Объект.НомерТС=Объект.ЗаказнаяМашина.ГосНомер;  
	Объект.Водитель = Объект.ЗаказнаяМашина.Водитель;
	Объект.ВодительФИО = Объект.ЗаказнаяМашина.Водитель.Фамилия+" "+Объект.ЗаказнаяМашина.Водитель.Имя+" "+Объект.ЗаказнаяМашина.Водитель.Отчество; //+" "+ЗаказнаяМашина.Водитель.Телефон;
	
	//проверка на корректность выбора машины, без запрета
	Если НЕ Объект.ЗаказнаяМашина.Пустая() Тогда
		Если Объект.ЗаказнаяМашина.Контрагент <> Объект.Заказная.Контрагент Тогда
			Сообщить("Не совпадает перевозчик в ЗОГ и ТН");	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ЗаказнаяМашинаПриИзменении(Элемент)
	ЗаказнаяМашинаПриИзмененииНаСервере();
КонецПроцедуры

