#Область ЗаполнитьНастройки
//Данилова Е.В. 26.12.2025 SNL-92  добавление параметра
Функция ПолучитьЗначениеРеквизитыСправочников(Ссылка = Неопределено, ИмяРеквизита = "", ТолькоПервые = Ложь, ТочноеСоответствие = Истина ) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	//++Данилова Е.В. 26.12.2025 SNL-92 
	Если ТочноеСоответствие Тогда
		
		Запрос.УстановитьПараметр("ИмяРеквизита", ИмяРеквизита);	
	Иначе 
		Запрос.УстановитьПараметр("ИмяРеквизита", ИмяРеквизита + "%");
	КонецЕсли;
	//Запрос.УстановитьПараметр("ИмяРеквизита", ИмяРеквизита);
	//--Данилова Е.В. 26.12.2025
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ " + ?(ТолькоПервые = Истина, "ПЕРВЫЕ 1", "") + "
	|	РеквизитыСправочников.ЗначениеРеквизита КАК ЗначениеРеквизита,
	|   РеквизитыСправочников.ИмяРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
	|ГДЕ 
	//++Данилова Е.В. 26.12.2025 SNL-92 
	|	РеквизитыСправочников.ИмяРеквизита ПОДОБНО &ИмяРеквизита 
	//|	РеквизитыСправочников.ИмяРеквизита = &ИмяРеквизита
	//--Данилова Е.В. 26.12.2025
	|	" + ?(Ссылка = Неопределено, "", "И РеквизитыСправочников.Справочник = &Ссылка") + "
	|  УПОРЯДОЧИТЬ ПО РеквизитыСправочников.ИмяРеквизита ";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ТолькоПервые Тогда
		Если Выборка.Следующий() Тогда
			Результат = Выборка.ЗначениеРеквизита;
		КонецЕсли;
	Иначе
		Результат = Новый Массив;
		Пока Выборка.Следующий() Цикл
			Результат.Добавить(Выборка.ЗначениеРеквизита);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьНастройки() Экспорт
	
	СтруктураВозврата = Новый Структура; 
	
	СтруктураВозврата.Вставить("СкладБезМарок", ПолучитьЗначениеРеквизитыСправочников(, "СкладБезМарок", Истина));
	СтруктураВозврата.Вставить("СкладМаркировки", ПолучитьЗначениеРеквизитыСправочников(, "СкладМаркировки", Истина));
	СтруктураВозврата.Вставить("СкладСмешанныеСпайки", ПолучитьЗначениеРеквизитыСправочников(, "СкладСмешанныеСпайки", Истина));
	
	СтруктураВозврата.Вставить("ДоступныеСкладыБезМарок", ПолучитьЗначениеРеквизитыСправочников(, "ДоступныйСкладБезМарок", Ложь,ложь));
	СтруктураВозврата.Вставить("ДоступныеСкладыМаркировка", ПолучитьЗначениеРеквизитыСправочников(, "ДоступныйСкладМаркировка", Ложь,ложь));
    //++Данилова Е.В. 01.11.2025 HELP-7698 
	СтруктураВозврата.Вставить("СкладНекоррМарок", ПолучитьЗначениеРеквизитыСправочников(, "СкладНекоррМарок", Истина));
	//--Данилова Е.В. 01.11.2025 
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ЗаполнитьСпайки(НакладнаяИсточник, НемаркированныеСклады, МаркированныеСклады) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НакладнаяИсточник", НакладнаяИсточник);
	Запрос.УстановитьПараметр("НемаркированныеСклады", НемаркированныеСклады);
	Запрос.УстановитьПараметр("МаркированныеСклады", МаркированныеСклады);
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Комплектующие.Продукция КАК Номенклатура,
	|	Комплектующие.Номенклатура КАК Комплектующее,
	|	ЕСТЬNULL(Товары.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(Комплектующие.Количество, 0) КАК КоличествоКомплектующих
	|ПОМЕСТИТЬ вр_Спайка
	|ИЗ
	|	Документ.РасходнаяНакладная.Комплектующие КАК Комплектующие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Товары КАК Товары
	|		ПО Комплектующие.Продукция = Товары.Номенклатура
	|			И Комплектующие.Ссылка = Товары.Ссылка
	|ГДЕ
	|	Комплектующие.Ссылка = &НакладнаяИсточник
	//++Данилова Е.В. 03.10.2025  HELP-5978 
	//|	И Комплектующие.Номенклатура.Родитель.ВидНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар), ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект))
	|	И Комплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	//--Данилова Е.В. 03.10.2025
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_Спайка.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ОстаткиТМЦОстатки.Номенклатура, вр_Спайка.Комплектующее) КАК Комплектующее,
	|	СУММА(ЕСТЬNULL(вр_Спайка.Количество, 0)) КАК Количество,
	|	СУММА(ЕСТЬNULL(вр_Спайка.КоличествоКомплектующих, 0)) КАК КоличествоКомплектующих,
	|	СУММА(ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0)) КАК ОстатокНаНемаркированныхСкладах
	|ПОМЕСТИТЬ вр_ОстатокНаНемаркированныхСкладах
	|ИЗ
	|	вр_Спайка КАК вр_Спайка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(&Период, Склад В (&НемаркированныеСклады)) КАК ОстаткиТМЦОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(&Период, Склад В (&НемаркированныеСклады)) КАК РезервыТМЦОстатки
	|			ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
	|				И ОстаткиТМЦОстатки.Склад = РезервыТМЦОстатки.Склад
	|		ПО вр_Спайка.Комплектующее = ОстаткиТМЦОстатки.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	вр_Спайка.Номенклатура,
	|	ЕСТЬNULL(ОстаткиТМЦОстатки.Номенклатура, вр_Спайка.Комплектующее)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_Спайка.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ОстаткиТМЦОстатки.Номенклатура, вр_Спайка.Комплектующее) КАК Комплектующее,
	|	СУММА(ЕСТЬNULL(вр_Спайка.Количество, 0)) КАК Количество,
	|	СУММА(ЕСТЬNULL(вр_Спайка.КоличествоКомплектующих, 0)) КАК КоличествоКомплектующих,
	|	СУММА(ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0)) КАК ОстатокНаМаркированныхСкладах
	|ПОМЕСТИТЬ вр_ОстатокНаМаркированныхСкладах
	|ИЗ
	|	вр_Спайка КАК вр_Спайка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(&Период, Склад В (&МаркированныеСклады)) КАК ОстаткиТМЦОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(&Период, Склад В (&МаркированныеСклады)) КАК РезервыТМЦОстатки
	|			ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
	|				И ОстаткиТМЦОстатки.Склад = РезервыТМЦОстатки.Склад
	|		ПО вр_Спайка.Комплектующее = ОстаткиТМЦОстатки.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	вр_Спайка.Номенклатура,
	|	ЕСТЬNULL(ОстаткиТМЦОстатки.Номенклатура, вр_Спайка.Комплектующее)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_Спайка.Номенклатура КАК Номенклатура,
	|	вр_Спайка.Комплектующее КАК Комплектующее,
	|	ЕСТЬNULL(вр_Спайка.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(вр_Спайка.КоличествоКомплектующих, 0) КАК КоличествоКомплектующих,
	|	ЕСТЬNULL(вр_ОстатокНаНемаркированныхСкладах.ОстатокНаНемаркированныхСкладах, 0) КАК ОстатокНаНемаркированныхСкладах,
	|	ЕСТЬNULL(вр_ОстатокНаМаркированныхСкладах.ОстатокНаМаркированныхСкладах, 0) КАК ОстатокНаМаркированныхСкладах,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(вр_ОстатокНаНемаркированныхСкладах.ОстатокНаНемаркированныхСкладах, 0) > ЕСТЬNULL(вр_ОстатокНаМаркированныхСкладах.ОстатокНаМаркированныхСкладах, 0)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(вр_ОстатокНаМаркированныхСкладах.ОстатокНаМаркированныхСкладах, 0) > ЕСТЬNULL(вр_ОстатокНаНемаркированныхСкладах.ОстатокНаНемаркированныхСкладах, 0)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|	КОНЕЦ КАК ПризнакМаркировки
	|ИЗ
	|	вр_Спайка КАК вр_Спайка
	|		ЛЕВОЕ СОЕДИНЕНИЕ вр_ОстатокНаНемаркированныхСкладах КАК вр_ОстатокНаНемаркированныхСкладах
	|		ПО вр_Спайка.Комплектующее = вр_ОстатокНаНемаркированныхСкладах.Комплектующее
	|			И вр_Спайка.Номенклатура = вр_ОстатокНаНемаркированныхСкладах.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ вр_ОстатокНаМаркированныхСкладах КАК вр_ОстатокНаМаркированныхСкладах
	|		ПО вр_Спайка.Комплектующее = вр_ОстатокНаМаркированныхСкладах.Комплектующее
	|			И вр_Спайка.Номенклатура = вр_ОстатокНаМаркированныхСкладах.Номенклатура";
	
	УстановитьПривилегированныйРежим(Истина);
	тзКомплектующие = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);

	Возврат тзКомплектующие;

КонецФункции

Функция ЗаполнитьУпаковку(НакладнаяИсточник, НемаркированныеСклады, МаркированныеСклады) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НакладнаяИсточник", НакладнаяИсточник);
	Запрос.УстановитьПараметр("НемаркированныеСклады", НемаркированныеСклады);
	Запрос.УстановитьПараметр("МаркированныеСклады", МаркированныеСклады);
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Комплектующие.Продукция КАК Номенклатура,
	|	Комплектующие.Номенклатура КАК Комплектующее,
	|	ЕСТЬNULL(Товары.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(Комплектующие.Количество, 0) КАК КоличествоКомплектующих
	|ПОМЕСТИТЬ вр_Спайка
	|ИЗ
	|	Документ.РасходнаяНакладная.Комплектующие КАК Комплектующие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Товары КАК Товары
	|		ПО Комплектующие.Продукция = Товары.Номенклатура
	|			И Комплектующие.Ссылка = Товары.Ссылка
	|ГДЕ
	|	Комплектующие.Ссылка = &НакладнаяИсточник  
	//++Данилова Е.В. 03.10.2025  HELP-5978 
	//|	И НЕ Комплектующие.Номенклатура.Родитель.ВидНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар), ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект)) 
	|	И НЕ Комплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	//--Данилова Е.В. 03.10.2025
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_Спайка.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ОстаткиТМЦОстатки.Номенклатура, вр_Спайка.Комплектующее) КАК Комплектующее,
	|	СУММА(ЕСТЬNULL(вр_Спайка.Количество, 0)) КАК Количество,
	|	СУММА(ЕСТЬNULL(вр_Спайка.КоличествоКомплектующих, 0)) КАК КоличествоКомплектующих,
	|	СУММА(ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0)) КАК ОстатокНаНемаркированныхСкладах
	|ПОМЕСТИТЬ вр_ОстатокНаНемаркированныхСкладах
	|ИЗ
	|	вр_Спайка КАК вр_Спайка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(&Период, Склад В (&НемаркированныеСклады)) КАК ОстаткиТМЦОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(&Период, Склад В (&НемаркированныеСклады)) КАК РезервыТМЦОстатки
	|			ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
	|				И ОстаткиТМЦОстатки.Склад = РезервыТМЦОстатки.Склад
	|		ПО вр_Спайка.Комплектующее = ОстаткиТМЦОстатки.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	вр_Спайка.Номенклатура,
	|	ЕСТЬNULL(ОстаткиТМЦОстатки.Номенклатура, вр_Спайка.Комплектующее)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_Спайка.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ОстаткиТМЦОстатки.Номенклатура, вр_Спайка.Комплектующее) КАК Комплектующее,
	|	СУММА(ЕСТЬNULL(вр_Спайка.Количество, 0)) КАК Количество,
	|	СУММА(ЕСТЬNULL(вр_Спайка.КоличествоКомплектующих, 0)) КАК КоличествоКомплектующих,
	|	СУММА(ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0)) КАК ОстатокНаМаркированныхСкладах
	|ПОМЕСТИТЬ вр_ОстатокНаМаркированныхСкладах
	|ИЗ
	|	вр_Спайка КАК вр_Спайка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(&Период, Склад В (&МаркированныеСклады)) КАК ОстаткиТМЦОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(&Период, Склад В (&МаркированныеСклады)) КАК РезервыТМЦОстатки
	|			ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
	|				И ОстаткиТМЦОстатки.Склад = РезервыТМЦОстатки.Склад
	|		ПО вр_Спайка.Комплектующее = ОстаткиТМЦОстатки.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	вр_Спайка.Номенклатура,
	|	ЕСТЬNULL(ОстаткиТМЦОстатки.Номенклатура, вр_Спайка.Комплектующее)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_Спайка.Номенклатура КАК Номенклатура,
	|	вр_Спайка.Комплектующее КАК Комплектующее,
	|	ЕСТЬNULL(вр_Спайка.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(вр_Спайка.КоличествоКомплектующих, 0) КАК КоличествоКомплектующих,
	|	ЕСТЬNULL(вр_ОстатокНаНемаркированныхСкладах.ОстатокНаНемаркированныхСкладах, 0) КАК ОстатокНаНемаркированныхСкладах,
	|	ЕСТЬNULL(вр_ОстатокНаМаркированныхСкладах.ОстатокНаМаркированныхСкладах, 0) КАК ОстатокНаМаркированныхСкладах,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(вр_ОстатокНаНемаркированныхСкладах.ОстатокНаНемаркированныхСкладах, 0) > ЕСТЬNULL(вр_ОстатокНаМаркированныхСкладах.ОстатокНаМаркированныхСкладах, 0)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(вр_ОстатокНаМаркированныхСкладах.ОстатокНаМаркированныхСкладах, 0) > ЕСТЬNULL(вр_ОстатокНаНемаркированныхСкладах.ОстатокНаНемаркированныхСкладах, 0)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|	КОНЕЦ КАК ПризнакМаркировки
	|ПОМЕСТИТЬ вр_Сводная
	|ИЗ
	|	вр_Спайка КАК вр_Спайка
	|		ЛЕВОЕ СОЕДИНЕНИЕ вр_ОстатокНаНемаркированныхСкладах КАК вр_ОстатокНаНемаркированныхСкладах
	|		ПО вр_Спайка.Комплектующее = вр_ОстатокНаНемаркированныхСкладах.Комплектующее
	|			И вр_Спайка.Номенклатура = вр_ОстатокНаНемаркированныхСкладах.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ вр_ОстатокНаМаркированныхСкладах КАК вр_ОстатокНаМаркированныхСкладах
	|		ПО вр_Спайка.Комплектующее = вр_ОстатокНаМаркированныхСкладах.Комплектующее
	|			И вр_Спайка.Номенклатура = вр_ОстатокНаМаркированныхСкладах.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_Сводная.Номенклатура КАК Номенклатура,
	|	вр_Сводная.Комплектующее КАК Комплектующее,
	|	СУММА(вр_Сводная.Количество) КАК Количество,
	|	СУММА(вр_Сводная.КоличествоКомплектующих) КАК КоличествоКомплектующих,
	|	МАКСИМУМ(вр_Сводная.ПризнакМаркировки) КАК ПризнакМаркировки
	|ИЗ
	|	вр_Сводная КАК вр_Сводная
	|
	|СГРУППИРОВАТЬ ПО
	|	вр_Сводная.Номенклатура,
	|	вр_Сводная.Комплектующее";
	
	УстановитьПривилегированныйРежим(Истина);
	тзУпаковка = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);

	Возврат тзУпаковка;

КонецФункции

//++Данилова Е.В. 01.11.2025 HELP-7698
Функция ЗаполнитьСпайкиБезПризнакаМаркировки(НакладнаяИсточник) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НакладнаяИсточник", НакладнаяИсточник);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Комплектующие.Продукция КАК Номенклатура,
	|	Комплектующие.Номенклатура КАК Комплектующее,
	|	ЕСТЬNULL(Товары.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(Комплектующие.Количество, 0) КАК КоличествоКомплектующих
	|ИЗ
	|	Документ.РасходнаяНакладная.Комплектующие КАК Комплектующие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Товары КАК Товары
	|		ПО Комплектующие.Продукция = Товары.Номенклатура
	|			И Комплектующие.Ссылка = Товары.Ссылка
	|ГДЕ
	|	Комплектующие.Ссылка = &НакладнаяИсточник
	|	И Комплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)";
	
	УстановитьПривилегированныйРежим(Истина);
	тзКомплектующие = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);

	Возврат тзКомплектующие;

КонецФункции 

Функция ЗаполнитьУпаковкуБезПризнакаМаркировки(НакладнаяИсточник) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НакладнаяИсточник", НакладнаяИсточник);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Комплектующие.Продукция КАК Номенклатура,
	|	Комплектующие.Номенклатура КАК Комплектующее,
	|	ЕСТЬNULL(Товары.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(Комплектующие.Количество, 0) КАК КоличествоКомплектующих
	|ИЗ
	|	Документ.РасходнаяНакладная.Комплектующие КАК Комплектующие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Товары КАК Товары
	|		ПО Комплектующие.Продукция = Товары.Номенклатура
	|			И Комплектующие.Ссылка = Товары.Ссылка
	|ГДЕ
	|	Комплектующие.Ссылка = &НакладнаяИсточник
	|	И НЕ Комплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)";
	
	УстановитьПривилегированныйРежим(Истина);
	тзУпаковка = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);

	Возврат тзУпаковка;

КонецФункции




//--Данилова Е.В. 01.11.2025 
#КонецОбласти

#Область Расчеты
//Данилова Е.В. 24.10.2025 HELP-7587 
Функция РассчитатьОстатки(тзСпайки, МассивСкладов, БазовыйСклад, УчитыватьРезерв = Истина, РасчетУпаковокПоСкладуСмешанСпаек = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("тзСпайки", тзСпайки);
	Запрос.УстановитьПараметр("МассивСкладов", МассивСкладов);
	
	Если ТипЗнч(БазовыйСклад) = Тип("СправочникСсылка.Склады") Тогда
		МассивСкладовБазовый = Новый Массив;
		МассивСкладовБазовый.Добавить(БазовыйСклад);
		Запрос.УстановитьПараметр("БазовыйСклад", МассивСкладовБазовый);
	ИначеЕсли ТипЗнч(БазовыйСклад) = Тип("Массив") Тогда
		Запрос.УстановитьПараметр("БазовыйСклад", БазовыйСклад);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	
	Если УчитыватьРезерв Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Спайки.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ВЫРАЗИТЬ(Спайки.Комплектующее КАК Справочник.Номенклатура) КАК Комплектующее,
		|	ВЫРАЗИТЬ(Спайки.ПризнакМаркировки КАК БУЛЕВО) КАК ПризнакМаркировки,
		|	ВЫРАЗИТЬ(Спайки.Количество КАК ЧИСЛО) КАК Количество,
		|	ВЫРАЗИТЬ(Спайки.КоличествоКомплектующих КАК ЧИСЛО) КАК КоличествоКомплектующих
		|ПОМЕСТИТЬ вр_Спайка
		|ИЗ
		|	&тзСпайки КАК Спайки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вр_Спайка.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(ОстаткиТМЦОстатки.Номенклатура, вр_Спайка.Комплектующее) КАК Комплектующее,
		|	СУММА(ЕСТЬNULL(вр_Спайка.Количество, 0)) КАК Количество,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(вр_Спайка.КоличествоКомплектующих, 0) = 0
		|				ТОГДА 1
		|			ИНАЧЕ ЕСТЬNULL(вр_Спайка.КоличествоКомплектующих, 0)
		|		КОНЕЦ) КАК КоличествоКомплектующих,
		|	МАКСИМУМ(вр_Спайка.ПризнакМаркировки) КАК ПризнакМаркировки,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) > 0
		|				ТОГДА ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстатокНаБазовомСкладе,
		|	ВЫБОР
		|		КОГДА СУММА(ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0)) >= СУММА(ВЫБОР
		|					КОГДА ЕСТЬNULL(вр_Спайка.КоличествоКомплектующих, 0) = 0
		|						ТОГДА 1
		|					ИНАЧЕ ЕСТЬNULL(вр_Спайка.КоличествоКомплектующих, 0)
		|				КОНЕЦ)
		|			ТОГДА 0
		|		ИНАЧЕ СУММА(ВЫБОР
		|					КОГДА ЕСТЬNULL(вр_Спайка.КоличествоКомплектующих, 0) = 0
		|						ТОГДА 1
		|					ИНАЧЕ ЕСТЬNULL(вр_Спайка.КоличествоКомплектующих, 0)
		|				КОНЕЦ) - СУММА(ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0))
		|	КОНЕЦ КАК НужноПереместитьНаБазовыйСклад
		|ПОМЕСТИТЬ вр_ОстатокНаБазовомСкладе
		|ИЗ
		|	вр_Спайка КАК вр_Спайка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(&Период, Склад В (&БазовыйСклад)) КАК ОстаткиТМЦОстатки
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(&Период, Склад В (&БазовыйСклад)) КАК РезервыТМЦОстатки
		|			ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
		|				И ОстаткиТМЦОстатки.Склад = РезервыТМЦОстатки.Склад
		|		ПО вр_Спайка.Комплектующее = ОстаткиТМЦОстатки.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	вр_Спайка.Номенклатура,
		|	ЕСТЬNULL(ОстаткиТМЦОстатки.Номенклатура, вр_Спайка.Комплектующее)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вр_Спайка.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(ОстаткиТМЦОстатки.Номенклатура, вр_Спайка.Комплектующее) КАК Комплектующее,
		|	МАКСИМУМ(ЕСТЬNULL(вр_Спайка.Количество, 0)) КАК Количество,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЕСТЬNULL(вр_Спайка.КоличествоКомплектующих, 0) = 0
		|				ТОГДА 1
		|			ИНАЧЕ ЕСТЬNULL(вр_Спайка.КоличествоКомплектующих, 0)
		|		КОНЕЦ) КАК КоличествоКомплектующих,
		|	МАКСИМУМ(вр_Спайка.ПризнакМаркировки) КАК ПризнакМаркировки,
		|	СУММА(ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0)) - СУММА(ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0)) КАК Остаток
		|ПОМЕСТИТЬ вр_Остатки
		|ИЗ
		|	вр_Спайка КАК вр_Спайка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(&Период, Склад В (&МассивСкладов)) КАК ОстаткиТМЦОстатки
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(&Период, Склад В (&МассивСкладов)) КАК РезервыТМЦОстатки
		|			ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
		|				И ОстаткиТМЦОстатки.Склад = РезервыТМЦОстатки.Склад
		|		ПО вр_Спайка.Комплектующее = ОстаткиТМЦОстатки.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	вр_Спайка.Номенклатура,
		|	ЕСТЬNULL(ОстаткиТМЦОстатки.Номенклатура, вр_Спайка.Комплектующее)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вр_Спайка.Номенклатура КАК Номенклатура,
		|	вр_Спайка.Комплектующее КАК Комплектующее,
		|	СУММА(ЕСТЬNULL(вр_Спайка.Количество, 0)) КАК Количество,
		|	СУММА(ЕСТЬNULL(вр_Спайка.КоличествоКомплектующих, 0)) КАК КоличествоКомплектующих,
		|	МАКСИМУМ(вр_Спайка.ПризнакМаркировки) КАК ПризнакМаркировки,
		|	СУММА(ЕСТЬNULL(вр_ОстатокНаБазовомСкладе.ОстатокНаБазовомСкладе, 0)) КАК ОстатокБазовыйСклад,
		|	СУММА(ЕСТЬNULL(вр_Остатки.Остаток, 0)) КАК Остаток,
		|	0 КАК НужноПереместить
		|ИЗ
		|	вр_Спайка КАК вр_Спайка
		|		ЛЕВОЕ СОЕДИНЕНИЕ вр_ОстатокНаБазовомСкладе КАК вр_ОстатокНаБазовомСкладе
		|		ПО вр_Спайка.Комплектующее = вр_ОстатокНаБазовомСкладе.Комплектующее
		|			И вр_Спайка.Номенклатура = вр_ОстатокНаБазовомСкладе.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ вр_Остатки КАК вр_Остатки
		|		ПО вр_Спайка.Комплектующее = вр_Остатки.Комплектующее
		|			И вр_Спайка.Номенклатура = вр_Остатки.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	вр_Спайка.Номенклатура,
		|	вр_Спайка.Комплектующее";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Спайки.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ВЫРАЗИТЬ(Спайки.Комплектующее КАК Справочник.Номенклатура) КАК Комплектующее,
		|	ВЫРАЗИТЬ(Спайки.ПризнакМаркировки КАК БУЛЕВО) КАК ПризнакМаркировки,
		|	ВЫРАЗИТЬ(Спайки.Количество КАК ЧИСЛО) КАК Количество,
		|	ВЫРАЗИТЬ(Спайки.КоличествоКомплектующих КАК ЧИСЛО) КАК КоличествоКомплектующих
		|ПОМЕСТИТЬ вр_Спайка
		|ИЗ
		|	&тзСпайки КАК Спайки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вр_Спайка.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(ОстаткиТМЦОстатки.Номенклатура, вр_Спайка.Комплектующее) КАК Комплектующее,
		|	СУММА(ЕСТЬNULL(вр_Спайка.Количество, 0)) КАК Количество,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(вр_Спайка.КоличествоКомплектующих, 0) = 0
		|				ТОГДА 1
		|			ИНАЧЕ ЕСТЬNULL(вр_Спайка.КоличествоКомплектующих, 0)
		|		КОНЕЦ) КАК КоличествоКомплектующих,
		|	МАКСИМУМ(вр_Спайка.ПризнакМаркировки) КАК ПризнакМаркировки,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) > 0
		|				ТОГДА ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстатокНаБазовомСкладе,
		|	ВЫБОР
		|		КОГДА СУММА(ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0)) >= СУММА(ВЫБОР
		|					КОГДА ЕСТЬNULL(вр_Спайка.КоличествоКомплектующих, 0) = 0
		|						ТОГДА 1
		|					ИНАЧЕ ЕСТЬNULL(вр_Спайка.КоличествоКомплектующих, 0)
		|				КОНЕЦ)
		|			ТОГДА 0
		|		ИНАЧЕ СУММА(ВЫБОР
		|					КОГДА ЕСТЬNULL(вр_Спайка.КоличествоКомплектующих, 0) = 0
		|						ТОГДА 1
		|					ИНАЧЕ ЕСТЬNULL(вр_Спайка.КоличествоКомплектующих, 0)
		|				КОНЕЦ) - СУММА(ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0))
		|	КОНЕЦ КАК НужноПереместитьНаБазовыйСклад
		|ПОМЕСТИТЬ вр_ОстатокНаБазовомСкладе
		|ИЗ
		|	вр_Спайка КАК вр_Спайка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(&Период, Склад В (&БазовыйСклад)) КАК ОстаткиТМЦОстатки
		|		ПО вр_Спайка.Комплектующее = ОстаткиТМЦОстатки.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	вр_Спайка.Номенклатура,
		|	ЕСТЬNULL(ОстаткиТМЦОстатки.Номенклатура, вр_Спайка.Комплектующее)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вр_Спайка.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(ОстаткиТМЦОстатки.Номенклатура, вр_Спайка.Комплектующее) КАК Комплектующее,
		|	МАКСИМУМ(ЕСТЬNULL(вр_Спайка.Количество, 0)) КАК Количество,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЕСТЬNULL(вр_Спайка.КоличествоКомплектующих, 0) = 0
		|				ТОГДА 1
		|			ИНАЧЕ ЕСТЬNULL(вр_Спайка.КоличествоКомплектующих, 0)
		|		КОНЕЦ) КАК КоличествоКомплектующих,
		|	МАКСИМУМ(вр_Спайка.ПризнакМаркировки) КАК ПризнакМаркировки,
		|	СУММА(ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0)) КАК Остаток
		|ПОМЕСТИТЬ вр_Остатки
		|ИЗ
		|	вр_Спайка КАК вр_Спайка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(&Период, Склад В (&МассивСкладов)) КАК ОстаткиТМЦОстатки
		|		ПО вр_Спайка.Комплектующее = ОстаткиТМЦОстатки.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	вр_Спайка.Номенклатура,
		|	ЕСТЬNULL(ОстаткиТМЦОстатки.Номенклатура, вр_Спайка.Комплектующее)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вр_Спайка.Номенклатура КАК Номенклатура,
		|	вр_Спайка.Комплектующее КАК Комплектующее,
		|	СУММА(ЕСТЬNULL(вр_Спайка.Количество, 0)) КАК Количество,
		|	СУММА(ЕСТЬNULL(вр_Спайка.КоличествоКомплектующих, 0)) КАК КоличествоКомплектующих,
		|	МАКСИМУМ(вр_Спайка.ПризнакМаркировки) КАК ПризнакМаркировки,
		|	СУММА(ЕСТЬNULL(вр_ОстатокНаБазовомСкладе.ОстатокНаБазовомСкладе, 0)) КАК ОстатокБазовыйСклад,
		|	СУММА(ЕСТЬNULL(вр_Остатки.Остаток, 0)) КАК Остаток,
		|	0 КАК НужноПереместить
		|ИЗ
		|	вр_Спайка КАК вр_Спайка
		|		ЛЕВОЕ СОЕДИНЕНИЕ вр_ОстатокНаБазовомСкладе КАК вр_ОстатокНаБазовомСкладе
		|		ПО вр_Спайка.Комплектующее = вр_ОстатокНаБазовомСкладе.Комплектующее
		|			И вр_Спайка.Номенклатура = вр_ОстатокНаБазовомСкладе.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ вр_Остатки КАК вр_Остатки
		|		ПО вр_Спайка.Комплектующее = вр_Остатки.Комплектующее
		|			И вр_Спайка.Номенклатура = вр_Остатки.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	вр_Спайка.Номенклатура,
		|	вр_Спайка.Комплектующее";
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	тзОстатки = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	//Данилова Е.В. 06.10.2025 используется для упаковок
	Для Каждого Стр ИЗ тзОстатки Цикл
		
		//++Данилова Е.В. 24.10.2025 
		Если РасчетУпаковокПоСкладуСмешанСпаек Тогда
			
			Стр.ОстатокБазовыйСклад = 0; 	
			
		КонецЕсли;
		//--Данилова Е.В. 24.10.2025

		Если Стр.КоличествоКомплектующих > Стр.ОстатокБазовыйСклад + Стр.Остаток Тогда  		
			Стр.НужноПереместить = Стр.Остаток;			
		ИначеЕсли Стр.КоличествоКомплектующих <= Стр.ОстатокБазовыйСклад Тогда
			Стр.НужноПереместить = 0;
		ИначеЕсли Стр.КоличествоКомплектующих > Стр.ОстатокБазовыйСклад И Стр.КоличествоКомплектующих <= Стр.ОстатокБазовыйСклад + Стр.Остаток Тогда
			Стр.НужноПереместить = Стр.КоличествоКомплектующих - Стр.ОстатокБазовыйСклад;
		КонецЕсли;
		
	КонецЦикла;

	Возврат тзОстатки;
	
КонецФункции

Функция ОпределитьТипСпайки(тзОднойСпайки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("тзОднойСпайки", тзОднойСпайки);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(тзОднойСпайки.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(тзОднойСпайки.Комплектующее КАК Справочник.Номенклатура) КАК Комплектующее,
	|	ВЫРАЗИТЬ(тзОднойСпайки.ПризнакМаркировки КАК БУЛЕВО) КАК ПризнакМаркировки
	|ПОМЕСТИТЬ вр_Спайка
	|ИЗ
	|	&тзОднойСпайки КАК тзОднойСпайки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_Спайка.Номенклатура КАК Номенклатура,
	|	вр_Спайка.Комплектующее КАК Комплектующее,
	|	вр_Спайка.ПризнакМаркировки КАК ПризнакМаркировки
	|ПОМЕСТИТЬ вр_НемаркированныеКомплектующие
	|ИЗ
	|	вр_Спайка КАК вр_Спайка
	|ГДЕ
	|	вр_Спайка.ПризнакМаркировки = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_Спайка.Номенклатура КАК Номенклатура,
	|	вр_Спайка.Комплектующее КАК Комплектующее,
	|	вр_Спайка.ПризнакМаркировки КАК ПризнакМаркировки
	|ПОМЕСТИТЬ вр_МаркированныеКомплектующие
	|ИЗ
	|	вр_Спайка КАК вр_Спайка
	|ГДЕ
	|	вр_Спайка.ПризнакМаркировки = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вр_Спайка.Комплектующее) КАК Комплектующее
	|ИЗ
	|	вр_Спайка КАК вр_Спайка";
	
	УстановитьПривилегированныйРежим(Истина);
	МассивПакетов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	УстановитьПривилегированныйРежим(Ложь);
	
	НемаркированныеКомплектующие = МассивПакетов[1].Выгрузить();
	МаркированныеКомплектующие = МассивПакетов[2].Выгрузить();
	
	Если НемаркированныеКомплектующие.Количество() > 0 И МаркированныеКомплектующие.Количество() = 0 Тогда
		Возврат "БезМарок";
	ИначеЕсли НемаркированныеКомплектующие.Количество() = 0 И МаркированныеКомплектующие.Количество() > 0 Тогда
		Возврат "СМарками";
	ИначеЕсли НемаркированныеКомплектующие.Количество() > 0 И МаркированныеКомплектующие.Количество() > 0 Тогда
		Возврат "СмешанныеСпайки";
	Иначе
		Возврат "БезМарок";
	КонецЕсли;
	
КонецФункции
//Данилова Е.В. 23.10.2025 HELP-5978
Функция ПодогнатьКоличествоСпаекКОстатку(тзСпайки,ЭтоСмешанныеСпайки = Ложь, МассивНоменклатуры = неопределено, ПроверятьНаМинКолПродукции = ложь) Экспорт
	
	тзПодогнанныхСпаек = тзСпайки.СкопироватьКолонки();
	//++Данилова Е.В. 01.11.2025  HELP-7698 
	Если МассивНоменклатуры = Неопределено  Тогда
		
		МассивНоменклатуры = ЗаполнениеДокументов.УдалитьПовторяющиесяЭлементыМассива(тзСпайки.ВыгрузитьКолонку("Номенклатура"));	
		
	КонецЕсли; 
	//--Данилова Е.В. 01.11.2025
	Для Каждого Номенклатура ИЗ МассивНоменклатуры Цикл
		
		тзОднойСпайки = тзСпайки.Скопировать(Новый Структура("Номенклатура", Номенклатура));
		//++Данилова Е.В. 28.10.2025 HELP-7587 
		тзОднойСпайки.Колонки.Добавить("ОстатокБазовыйСкладСохр");
		тзОднойСпайки.Колонки.Добавить("ОстатокСохр");
		//--Данилова Е.В. 28.10.2025
		ВсеОК = Истина;
		//++Данилова Е.В. 02.10.2025 HELP-5978
		//ПересчитыватьСпайку = Ложь;
		
		МассивКоличеств = Новый Массив; 
		
		
		СоответствиеКомплектующееКолСпаек = Новый Соответствие;
		ПересчитыватьСпайку = Истина;
		//--Данилова Е.В. 02.10.2025
		
		Для Каждого СтрокаТЗ ИЗ тзОднойСпайки Цикл   // Цикл по Спайке
			//++Данилова Е.В. 23.10.2025 HELP-5978
			Если ЭтоСмешанныеСпайки = Истина Тогда
			
				СтрокаТЗ.ОстатокБазовыйСклад = 0; 	
			
			КонецЕсли;
			
			СтрокаТЗ.ОстатокБазовыйСкладСохр = СтрокаТЗ.ОстатокБазовыйСклад; 
			СтрокаТЗ.ОстатокСохр = СтрокаТЗ.Остаток; 
			//--Данилова Е.В. 23.10.2025
			
			///// ЕСЛИ ОСТАТОК ПО ОДНОЙ КОМПЛЕКТУЮЩЕЙ <= 0 - ВЫЧЕРКИВАЕМ ВСЮ СПАЙКУ
			Если СтрокаТЗ.Остаток <= 0 И СтрокаТЗ.ОстатокБазовыйСклад <= 0 Тогда
				ВсеОК = Ложь;
				//++Данилова Е.В. 02.10.2025
				ПересчитыватьСпайку = ЛОЖЬ;
				//--Данилова Е.В. 02.10.2025
				Прервать;
			Иначе   //Если  СтрокаТЗ.КоличествоКомплектующих > СтрокаТЗ.Остаток + СтрокаТЗ.ОстатокБазовыйСклад Тогда  //++Данилова Е.В. 02.10.2025 HELP-5978
				//++Данилова Е.В. 02.10.2025 HELP-5978 
				Если СтрокаТЗ.Количество = 0 Тогда
				
					КоличествоКомплектВСпайке = 0; 	
				Иначе 
					КоличествоКомплектВСпайке = Цел(СтрокаТЗ.КоличествоКомплектующих/СтрокаТЗ.Количество);
				КонецЕсли;
				
				Если КоличествоКомплектВСпайке = 0 Тогда
				
					ПодобранноеКоличество = 0; 	
				Иначе 
					ПодобранноеКоличество = Цел((СтрокаТЗ.Остаток + СтрокаТЗ.ОстатокБазовыйСклад)/КоличествоКомплектВСпайке); 
				КонецЕсли;
				//Коэффициент = СтрокаТЗ.КоличествоКомплектующих / ?(СтрокаТЗ.Количество = 0, 1, СтрокаТЗ.Количество);
				//ПодобранноеКоличество = (СтрокаТЗ.Остаток + СтрокаТЗ.ОстатокБазовыйСклад) / ?(СтрокаТЗ.КоличествоКомплектующих = 0, 1, СтрокаТЗ.КоличествоКомплектующих);
				//ПодобранноеКоличество = Окр(ПодобранноеКоличество, 0, РежимОкругления.Окр15как10);
				//--Данилова Е.В. 02.10.2025 
				Если ПодобранноеКоличество <= 0 Тогда
					ВсеОК = Ложь;
					//++Данилова Е.В. 02.10.2025
					ПересчитыватьСпайку = ЛОЖЬ;
					//--Данилова Е.В. 02.10.2025
					Прервать;
				КонецЕсли;
				//++Данилова Е.В. 02.10.2025 HELP-5978
				//ПересчитыватьСпайку = Истина; 
				МассивКоличеств.Добавить(ПодобранноеКоличество); 
				СоответствиеКомплектующееКолСпаек.Вставить(СтрокаТЗ.Комплектующее,КоличествоКомплектВСпайке); 
				//--Данилова Е.В. 02.10.2025
			КонецЕсли;
			
		КонецЦикла;
		
		Если ПересчитыватьСпайку Тогда
			Если МассивКоличеств.Количество() > 0 Тогда
				МинимальноеКоличество = 1000000;
				Для Каждого СтрКоличество ИЗ МассивКоличеств Цикл
					МинимальноеКоличество = Мин(СтрКоличество, МинимальноеКоличество);	
				КонецЦикла;
				Для Каждого СтрокаТЗ ИЗ тзОднойСпайки Цикл 
					//++Данилова Е.В. 03.10.2025 HELP-5978
					//СтрокаТЗ.Количество = МинимальноеКоличество;
					СтрокаТЗ.Количество = Мин(СтрокаТЗ.Количество,МинимальноеКоличество);
					//++Данилова Е.В. 01.11.2025 HELP-7698 
					Если ПроверятьНаМинКолПродукции = Истина 
						И СтрокаТЗ.ЕстьМИН Тогда
						
						Если СтрокаТЗ.Количество < СтрокаТЗ.МинКоличествоПродукции Тогда
							
							ВсеОК = ЛОЖЬ; 
							Прервать; 
							
						КонецЕсли;	
						
					КонецЕсли;
					//--Данилова Е.В. 01.11.2025
					КоличествоКомплектВСпайке = СоответствиеКомплектующееКолСпаек.Получить(СтрокаТЗ.Комплектующее);
					Если КоличествоКомплектВСпайке <> неопределено  Тогда
					
						СтрокаТЗ.КоличествоКомплектующих = СтрокаТЗ.Количество * КоличествоКомплектВСпайке;	
					
					КонецЕсли;
					//++Данилова Е.В. 28.10.2025 HELP-7587  
					ОстатокБазовыйСкладКомпл  = СтрокаТЗ.ОстатокБазовыйСклад; 
					ОстатокКомпл = СтрокаТЗ.Остаток; 
					//--Данилова Е.В. 28.10.2025
					Если СтрокаТЗ.КоличествоКомплектующих > СтрокаТЗ.ОстатокБазовыйСклад + СтрокаТЗ.Остаток Тогда  		
						СтрокаТЗ.НужноПереместить = СтрокаТЗ.Остаток;
						//++Данилова Е.В. 28.10.2025 HELP-7587  
						ОстатокБазовыйСкладКомпл = 0; 
						ОстатокКомпл = 0; 
						//--Данилова Е.В. 28.10.2025
					ИначеЕсли СтрокаТЗ.КоличествоКомплектующих <= СтрокаТЗ.ОстатокБазовыйСклад Тогда
						СтрокаТЗ.НужноПереместить = 0;
						//++Данилова Е.В. 28.10.2025 HELP-7587  
						ОстатокБазовыйСкладКомпл = ОстатокБазовыйСкладКомпл - СтрокаТЗ.КоличествоКомплектующих; 						 
						//--Данилова Е.В. 28.10.2025
					ИначеЕсли СтрокаТЗ.КоличествоКомплектующих > СтрокаТЗ.ОстатокБазовыйСклад И СтрокаТЗ.КоличествоКомплектующих <= СтрокаТЗ.ОстатокБазовыйСклад + СтрокаТЗ.Остаток Тогда
						СтрокаТЗ.НужноПереместить = СтрокаТЗ.КоличествоКомплектующих - СтрокаТЗ.ОстатокБазовыйСклад;
						//++Данилова Е.В. 28.10.2025 HELP-7587  
						ОстатокБазовыйСкладКомпл = 0; 
						ОстатокКомпл = ОстатокКомпл - СтрокаТЗ.НужноПереместить; 
						//--Данилова Е.В. 28.10.2025
					КонецЕсли;
					
					//--Данилова Е.В. 03.10.2025  
					//++Данилова Е.В. 28.10.2025 HELP-7587 
					//необходимо еще уменьшить остаток по комплектующей, чтобы расчет был верный 
					ОтборКомплект = Новый Структура("Комплектующее",СтрокаТЗ.Комплектующее);
					СтрокиПоКомплектующей = ТЗСпайки.НайтиСтроки(ОтборКомплект);
					Для каждого СтрокаПоКомплектующей Из СтрокиПоКомплектующей Цикл
					
						СтрокаПоКомплектующей.ОстатокБазовыйСклад = ОстатокБазовыйСкладКомпл; 
						СтрокаПоКомплектующей.Остаток = ОстатокКомпл; 
					
					КонецЦикла;
					//--Данилова Е.В. 28.10.2025
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если ВсеОК Тогда
			Для Каждого СтрокаТЗ ИЗ тзОднойСпайки Цикл 
				//++Данилова Е.В. 28.10.2025 HELP-7587
				//ЗаполнитьЗначенияСвойств(тзПодогнанныхСпаек.Добавить(), СтрокаТЗ,,"ОстатокБазовыйСклад,Остаток"); 
				НоваяСтрока = тзПодогнанныхСпаек.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ,,"ОстатокБазовыйСклад,Остаток");
				НоваяСтрока.ОстатокБазовыйСклад 	= СтрокаТЗ.ОстатокБазовыйСкладСохр; 
				НоваяСтрока.Остаток 				= СтрокаТЗ.ОстатокСохр;
				//-Данилова Е.В. 28.10.2025 HELP-7587 
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат тзПодогнанныхСпаек;
	
КонецФункции

Функция ПреобразоватьТаблицуСпаекВТаблицуТовары(тзСпайки, тзТовары = Неопределено, СкладПриемник = Неопределено, СпайкиБезУпаковки = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("тзСпайки", тзСпайки);
	Запрос.УстановитьПараметр("тзТовары", тзТовары);
	Запрос.УстановитьПараметр("СкладПриемник", СкладПриемник);
	//++Данилова Е.В. 06.11.2025 HELP-7698
	Запрос.УстановитьПараметр("ТЗСпайкиБезУпаковки", СпайкиБезУпаковки);
	//--Данилова Е.В. 06.11.2025
	Если тзТовары = Неопределено И СкладПриемник = Неопределено Тогда  // Перемещение
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(тзСпайки.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ВЫРАЗИТЬ(тзСпайки.Комплектующее КАК Справочник.Номенклатура) КАК Комплектующее,
		|	ВЫРАЗИТЬ(тзСпайки.НужноПереместить КАК ЧИСЛО) КАК НужноПереместить
		|ПОМЕСТИТЬ вр_Спайка
		|ИЗ
		|	&тзСпайки КАК тзСпайки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вр_Спайка.Комплектующее КАК Номенклатура,
		|	ЕСТЬNULL(вр_Спайка.НужноПереместить, 0) КАК Количество
		|ПОМЕСТИТЬ вр_Сводная
		|ИЗ
		|	вр_Спайка КАК вр_Спайка
		|ГДЕ
		|	ЕСТЬNULL(вр_Спайка.НужноПереместить, 0) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вр_Сводная.Номенклатура КАК Номенклатура,
		|	СУММА(ЕСТЬNULL(вр_Сводная.Количество, 0)) КАК Количество
		|ИЗ
		|	вр_Сводная КАК вр_Сводная
		|
		|СГРУППИРОВАТЬ ПО
		|	вр_Сводная.Номенклатура";
		
	ИначеЕсли тзТовары = Неопределено И ТипЗнч(СкладПриемник) = Тип("СправочникСсылка.Склады") Тогда  // Перемещение на Склад Отгрузки
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(тзСпайки.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ВЫРАЗИТЬ(тзСпайки.Комплектующее КАК Справочник.Номенклатура) КАК Комплектующее,
		|	ВЫРАЗИТЬ(тзСпайки.НужноПереместить КАК ЧИСЛО) КАК НужноПереместить,
		|	ВЫРАЗИТЬ(тзСпайки.СкладОтгрузки КАК Справочник.Склады) КАК СкладОтгрузки
		|ПОМЕСТИТЬ вр_Спайка
		|ИЗ
		|	&тзСпайки КАК тзСпайки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вр_Спайка.Комплектующее КАК Номенклатура,
		|	ЕСТЬNULL(вр_Спайка.НужноПереместить, 0) КАК Количество
		|ПОМЕСТИТЬ вр_Сводная
		|ИЗ
		|	вр_Спайка КАК вр_Спайка
		|ГДЕ
		|	ЕСТЬNULL(вр_Спайка.НужноПереместить, 0) > 0
		|	И вр_Спайка.СкладОтгрузки = &СкладПриемник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вр_Сводная.Номенклатура КАК Номенклатура,
		|	СУММА(ЕСТЬNULL(вр_Сводная.Количество, 0)) КАК Количество
		|ИЗ
		|	вр_Сводная КАК вр_Сводная
		|
		|СГРУППИРОВАТЬ ПО
		|	вр_Сводная.Номенклатура";
		//++Данилова Е.В. 06.11.2025 HELP-7698 
	ИначеЕсли ТипЗнч(тзТовары) = Тип("ТаблицаЗначений") И ТипЗнч(СпайкиБезУпаковки) = Тип("ТаблицаЗначений") Тогда //РНК по спайкам 
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(тзТовары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ВЫРАЗИТЬ(тзТовары.Количество КАК ЧИСЛО) КАК КоличествоИсх
		|ПОМЕСТИТЬ вр_Товары
		|ИЗ
		|	&тзТовары КАК тзТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(тзСпайки.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ВЫРАЗИТЬ(тзСпайки.Комплектующее КАК Справочник.Номенклатура) КАК Комплектующее,
		|	ВЫРАЗИТЬ(тзСпайки.Количество КАК ЧИСЛО) КАК Количество,
		|	тзСпайки.БезУпаковки КАК БезУпаковки
		|ПОМЕСТИТЬ вр_Спайка
		|ИЗ
		|	&тзСпайки КАК тзСпайки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗСпайкиБезУпаковки.Номенклатура КАК Номенклатура,
		|	ТЗСпайкиБезУпаковки.Отгрузить КАК Отгрузить,
		|	ТЗСпайкиБезУпаковки.СкладОтгрузки КАК СкладОтгрузки
		|ПОМЕСТИТЬ ВТСпайкиБезУпаковки
		|ИЗ
		|	&ТЗСпайкиБезУпаковки КАК ТЗСпайкиБезУпаковки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вр_Спайка.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(вр_Товары.КоличествоИсх, 0) >= ЕСТЬNULL(вр_Спайка.Количество, 0)
		|			ТОГДА ЕСТЬNULL(вр_Спайка.Количество, 0)
		|		ИНАЧЕ ЕСТЬNULL(вр_Товары.КоличествоИсх, 0)
		|	КОНЕЦ КАК Количество
		|ИЗ
		|	вр_Спайка КАК вр_Спайка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вр_Товары КАК вр_Товары
		|		ПО вр_Спайка.Номенклатура = вр_Товары.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСпайкиБезУпаковки КАК ВТСпайкиБезУпаковки
		|		ПО (ВТСпайкиБезУпаковки.Номенклатура = вр_Спайка.Номенклатура)
		|			И (ВТСпайкиБезУпаковки.СкладОтгрузки = &СкладПриемник)
		|			И (вр_Спайка.БезУпаковки)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ ВТСпайкиБезУпаковки.Номенклатура ЕСТЬ NULL
		|				ТОГДА ВТСпайкиБезУпаковки.Отгрузить
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";

		//--Данилова Е.В. 06.11.2025
	ИначеЕсли ТипЗнч(тзТовары) = Тип("ТаблицаЗначений") Тогда  // Расходная накладная
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(тзТовары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ВЫРАЗИТЬ(тзТовары.Количество КАК ЧИСЛО) КАК КоличествоИсх
		|ПОМЕСТИТЬ вр_Товары
		|ИЗ
		|	&тзТовары КАК тзТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(тзСпайки.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ВЫРАЗИТЬ(тзСпайки.Комплектующее КАК Справочник.Номенклатура) КАК Комплектующее,
		|	ВЫРАЗИТЬ(тзСпайки.Количество КАК ЧИСЛО) КАК Количество
		|ПОМЕСТИТЬ вр_Спайка
		|ИЗ
		|	&тзСпайки КАК тзСпайки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вр_Спайка.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(вр_Товары.КоличествоИсх, 0) >= ЕСТЬNULL(вр_Спайка.Количество, 0)
		|			ТОГДА ЕСТЬNULL(вр_Спайка.Количество, 0)
		|		ИНАЧЕ ЕСТЬNULL(вр_Товары.КоличествоИсх, 0)
		|	КОНЕЦ КАК Количество
		|ИЗ
		|	вр_Спайка КАК вр_Спайка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вр_Товары КАК вр_Товары
		|		ПО вр_Спайка.Номенклатура = вр_Товары.Номенклатура";
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	тзСпайкиТовары = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат тзСпайкиТовары;
	
КонецФункции

/////////////////////////////////////////////////////////////////////////////////////////////////

Функция РассчитатьОстаткиПоОдномуСкладу(Номенклатура, Склад, УчитыватьРезерв = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	
	Если УчитыватьРезерв Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) > 0
		|				ТОГДА ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Остаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТМЦ.Остатки(
		|			&Период,
		|			Склад = &Склад
		|				И Номенклатура = &Номенклатура) КАК ОстаткиТМЦОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
		|				&Период,
		|				Склад = &Склад
		|					И Номенклатура = &Номенклатура) КАК РезервыТМЦОстатки
		|		ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
		|			И ОстаткиТМЦОстатки.Склад = РезервыТМЦОстатки.Склад
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиТМЦОстатки.Номенклатура";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) > 0
		|				ТОГДА ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Остаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТМЦ.Остатки(
		|			&Период,
		|			Склад = &Склад
		|				И Номенклатура = &Номенклатура) КАК ОстаткиТМЦОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиТМЦОстатки.Номенклатура";
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Остаток;
	КонецЦикла;

	Возврат 0;
	
КонецФункции

Функция УстановитьСкладОтгрузкиДляУпаковки(тзУпаковка, тзСпайки, СкладПриемник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("тзСпайки", тзСпайки);
	Запрос.УстановитьПараметр("тзУпаковка", тзУпаковка);
	Запрос.УстановитьПараметр("СкладПриемник", СкладПриемник);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Спайки.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(Спайки.НужноПереместить КАК ЧИСЛО) КАК НужноПереместить
	|ПОМЕСТИТЬ вр_Спайка
	|ИЗ
	|	&тзСпайки КАК Спайки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(тзУпаковка.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(тзУпаковка.Комплектующее КАК Справочник.Номенклатура) КАК Комплектующее,
	|	ВЫРАЗИТЬ(тзУпаковка.ПризнакМаркировки КАК БУЛЕВО) КАК ПризнакМаркировки,
	|	ВЫРАЗИТЬ(тзУпаковка.Количество КАК ЧИСЛО) КАК Количество,
	|	ВЫРАЗИТЬ(тзУпаковка.КоличествоКомплектующих КАК ЧИСЛО) КАК КоличествоКомплектующих
	|ПОМЕСТИТЬ вр_Упаковка
	|ИЗ
	|	&тзУпаковка КАК тзУпаковка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_Упаковка.Номенклатура КАК Номенклатура,
	|	вр_Упаковка.Комплектующее КАК Комплектующее,
	|	вр_Упаковка.ПризнакМаркировки КАК ПризнакМаркировки,
	|	ЕСТЬNULL(вр_Упаковка.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(вр_Упаковка.КоличествоКомплектующих, 0) КАК КоличествоКомплектующих,
	|	ВЫБОР
	|		КОГДА вр_Упаковка.Номенклатура = вр_Спайка.Номенклатура
	|				И ЕСТЬNULL(вр_Спайка.НужноПереместить, 0) > 0
	|			ТОГДА ЕСТЬNULL(вр_Упаковка.КоличествоКомплектующих, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НужноПереместить,
	|	ВЫБОР
	|		КОГДА вр_Упаковка.Номенклатура = вр_Спайка.Номенклатура
	|			ТОГДА &СкладПриемник
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|	КОНЕЦ КАК СкладОтгрузки
	|ИЗ
	|	вр_Упаковка КАК вр_Упаковка
	|		ЛЕВОЕ СОЕДИНЕНИЕ вр_Спайка КАК вр_Спайка
	|		ПО вр_Упаковка.Номенклатура = вр_Спайка.Номенклатура";
	
	УстановитьПривилегированныйРежим(Истина);
	тзУпаковкаСклад = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат тзУпаковкаСклад;
	
КонецФункции

#КонецОбласти

#Область Служебные

// Возвращает структуру реквизитов объекта или ссылки, включая стандартные реквизиты и реквизиты табличной части.
// Можно использовать, если необходимо, например, эмулировать вызов метода, использующего объект формы.
//
// Параметры:
//  ВходящийОбъект - ЛюбаяСсылка или ЛюбойОбъект
//
// Возвращаемое значение:
//  Структура
//
Функция КонвертироватьОбъектВСтруктуру(ВходящийОбъект, ТолькоРеквизиты = Ложь,
		КонвертироватьСтандартныеРеквизиты = Ложь, МассивНеКонвертировать = Неопределено) Экспорт
	
	СтруктураОбъекта = Новый Структура;
	Если МассивНеКонвертировать = Неопределено Тогда
		МассивНеКонвертировать = Новый Массив;	
	КонецЕсли;
	
	Если КонвертироватьСтандартныеРеквизиты Тогда
		СтандартныеРеквизитыОбъекта = ВходящийОбъект.Метаданные().СтандартныеРеквизиты;
		Для Каждого СтандартныйРеквизит Из СтандартныеРеквизитыОбъекта Цикл
			СтруктураОбъекта.Вставить(СтандартныйРеквизит.Имя, ВходящийОбъект[СтандартныйРеквизит.Имя]);
		КонецЦикла;
	КонецЕсли;
	
	РеквизитыОбъекта = ВходящийОбъект.Метаданные().Реквизиты;
	Для Каждого Реквизит Из РеквизитыОбъекта Цикл
		Если МассивНеКонвертировать.Найти(Реквизит.Имя) = Неопределено Тогда 
			СтруктураОбъекта.Вставить(Реквизит.Имя, ВходящийОбъект[Реквизит.Имя]);
		КонецЕсли;
	КонецЦикла;
	
	Если ТолькоРеквизиты = Ложь Тогда	
		ТЧ = ВходящийОбъект.Метаданные().ТабличныеЧасти;
		Для Каждого ТаблЧасть Из ТЧ Цикл
			ТЗ = ВходящийОбъект[ТаблЧасть.Имя].Выгрузить();
			Массив = ТаблицаЗначенийВМассив(ТЗ);
			СтруктураОбъекта.Вставить(ТаблЧасть.Имя, Массив);
		КонецЦикла;
	КонецЕсли;
	
	Возврат СтруктураОбъекта;
	
КонецФункции

Функция ТаблицаЗначенийВМассив(ТаблицаЗначений) Экспорт
	
	Массив = Новый Массив();
	СтруктураСтрокой = "";
	НужнаЗапятая = Ложь;
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		Если НужнаЗапятая Тогда
			СтруктураСтрокой = СтруктураСтрокой + ",";
		КонецЕсли;
		СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
		НужнаЗапятая = Истина;
	КонецЦикла;
	Для Каждого Строка Из ТаблицаЗначений Цикл
		НоваяСтрока = Новый Структура(СтруктураСтрокой);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		Массив.Добавить(НоваяСтрока);
	КонецЦикла;
	Возврат Массив;
	
КонецФункции

//++Данилова Е.В. 03.02.2026 SNL-92 
Функция СкладДляРасчетаСпаек() Экспорт 
     
 	//Возврат Справочники.Склады.НайтиПоКоду("STD-99");
	СкладИзНастроек = Справочники.Склады.НайтиПоКоду("STD-95");
	СкладыИзНастроек = Документы.ЗаказСмешанныхСпаекFBO.ПолучитьЗначениеРеквизитыСправочников(, "РасчетПоСпайкамЗаказFBO", ложь,ложь);
	Если ТипЗнч(СкладыИзНастроек) = Тип("Массив") Тогда
		
		Возврат СкладыИзНастроек; 
	Иначе 
		СкладыИзНастроек = Новый Массив;
		СкладыИзНастроек.Добавить(СкладИзНастроек); 
	КонецЕсли;
	
	Возврат СкладыИзНастроек; 
	 
 
КонецФункции 
//--Данилова Е.В. 03.02.2026
#КонецОбласти

