&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Для Каждого Ссылка Из ПараметрКоманды Цикл		
		ТабДок = Новый ТабличныйДокумент;
		
		ПечатьЛицевая(ТабДок, Ссылка);
		
		ТабДок.ОтображатьСетку 		= Ложь;
		ТабДок.Защита 				= Ложь;
		ТабДок.ТолькоПросмотр 		= Ложь;
		ТабДок.ОтображатьЗаголовки 	= Ложь;
		
		ТабДок.Показать();		
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура ПечатьЛицевая(ТабДок, Ссылка)
	Документы.ПутевойЛист.ПечатьЛицевая(ТабДок, Ссылка);
КонецПроцедуры
