// Кухарь А.Ю.  18.12.2025 начало
//HELP-8209
Функция ПолучитьСтруктуруРекомендуемыхТиповЦенПоПодразделению (Знач Подразделение) Экспорт
	СтруктураВозврата = СоздатьСтруктуруВозвратаРекомендуемыхТиповЦен();	
	если не ЗначениеЗаполнено(Подразделение) тогда  
		СтруктураВозврата.Ошибки.Добавить("Не заполнено подразделение");
	иначе
		СтруктураВозврата.ИспользоватьМатрицуДляПлановПродаж = ОбщегоНазначения_ПИ.ПрочитатьРСРеквизитСправочника_ПИ("ИспользоватьМатрицуДляПлановПродаж",Подразделение,ложь);	  
		если не СтруктураВозврата.ИспользоватьМатрицуДляПлановПродаж тогда
			СтруктураВозврата.ТипЦен = ОбщегоНазначения_ПИ.ПрочитатьРСРеквизитСправочника_ПИ("ТипЦеныДляПлановПродаж",Подразделение,Справочники.ТипыЦен.ПустаяСсылка());	     
			если СтруктураВозврата.ТипЦен = Справочники.ТипыЦен.ПустаяСсылка() и не СтруктураВозврата.ИспользоватьМатрицуДляПлановПродаж тогда 
				СтруктураВозврата.Ошибки.Добавить("Не удалось определить тип цен по подразделению "+Строка(Подразделение));
			КонецЕсли;
		КонецЕсли;
		СтруктураВозврата.Скидка = ОбщегоНазначения_ПИ.ПрочитатьРСРеквизитСправочника_ПИ("СкидкаДляПлановПродаж",Подразделение,0);	
	КонецЕсли;     
	
	
	если  СтруктураВозврата.Ошибки.Количество() > 0 тогда  
		СтруктураВозврата.Успех = ложь;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции     

Функция СоздатьСтруктуруВозвратаРекомендуемыхТиповЦен () Экспорт   
	возврат новый Структура("Успех,Ошибки,ТипЦен,Скидка,ИспользоватьМатрицуДляПлановПродаж"
	, Истина, новый Массив, Справочники.ТипыЦен.ПустаяСсылка(),0,ложь);

КонецФункции
// Кухарь А.Ю.  18.12.2025 конец
