
#Область СлужебныеПроцедурыИФункции  
// Кухарь А.Ю.  02.07.2026 начало
 //Изменение 0000000223
Функция ЗаполнениеОстаткаПлан () 
	
	СтруктураВозврата = Новый Структура ("Успешно, Ошибки", Истина, Новый Массив); 
	
	Запрос = Новый Запрос;   
	Запрос.УстановитьПараметр("Ссылка",Ссылка);      
	Запрос.УстановитьПараметр("Состав",Состав);
	Если Детальный Тогда
		ИмяКолонкиНоменклатуры = "Номенклатура";
	Иначе 
		ИмяКолонкиНоменклатуры = "Модель";
	КонецЕсли;
	
	Запрос.Текст = СтрШаблон("ВЫБРАТЬ
	|	ПланПродажСостав.%1 КАК Номенклатура,
	|	ПланПродажСостав.Количество КАК Количество
	|ПОМЕСТИТЬ ИсходнаяТЧ
	|ИЗ
	|	Документ.ПланПродаж.Состав КАК ПланПродажСостав
	|ГДЕ
	|	ПланПродажСостав.Ссылка = &Ссылка
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланПродажСостав.%1 КАК Номенклатура,
	|	ПланПродажСостав.Количество КАК Количество,
	|	ПланПродажСостав.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ТекущаяТЧ   
	|ИЗ
	|	&Состав КАК ПланПродажСостав
	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТекущаяТЧ.Номенклатура, ИсходнаяТЧ.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ТекущаяТЧ.Количество, 0) КАК ТекущееКоличество,
	|	ЕСТЬNULL(ИсходнаяТЧ.Количество, 0) КАК ИсходноеКоличество,
	|	ЕСТЬNULL(ТекущаяТЧ.КоличествоОстаток, ТекущаяТЧ.КоличествоОстаток) КАК ОстатокПлана,
	|	ЕСТЬNULL(ТекущаяТЧ.Количество, 0) - ЕСТЬNULL(ИсходнаяТЧ.Количество, 0) КАК ДельтаКоличества
	|ИЗ
	|	ТекущаяТЧ КАК ТекущаяТЧ
	|		ПОЛНОЕ СОЕДИНЕНИЕ ИсходнаяТЧ КАК ИсходнаяТЧ
	|		ПО ТекущаяТЧ.Номенклатура = ИсходнаяТЧ.Номенклатура
	|ГДЕ
	|	ЕСТЬNULL(ТекущаяТЧ.Количество, 0) - ЕСТЬNULL(ИсходнаяТЧ.Количество, 0) <> 0", 
	ИмяКолонкиНоменклатуры);          
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл  
		Номенклатура = Выборка.Номенклатура;
		Если Выборка.ДельтаКоличества < 0 Тогда  
			УменьшениеПлана = -1 * Выборка.ДельтаКоличества;
			Если УменьшениеПлана > Выборка.ОстатокПлана Тогда 
				СтруктураВозврата.Ошибки.Добавить(СтрШаблон("По номенклатуре %1 не хватает остатка плана 
				|- %2, для уменьшения количества на - %3 штук", 
				Номенклатура, Выборка.ОстатокПлана, УменьшениеПлана));    
			Иначе
				СтрокаТЧ = Состав.Найти(Номенклатура, ИмяКолонкиНоменклатуры);  
				Если СтрокаТЧ <> Неопределено Тогда
					СтрокаТЧ.КоличествоОстаток = СтрокаТЧ.КоличествоОстаток - УменьшениеПлана;	
				КонецЕсли;
			КонецЕсли;    
		Иначе
			УвеличениеПлана = Выборка.ДельтаКоличества; 
			СтрокаТЧ = Состав.Найти(Номенклатура, ИмяКолонкиНоменклатуры);  
			Если СтрокаТЧ <> Неопределено Тогда
				СтрокаТЧ.КоличествоОстаток = СтрокаТЧ.КоличествоОстаток + УвеличениеПлана;	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;      
	
	Если СтруктураВозврата.Ошибки.Количество() > 0 Тогда 
		СтруктураВозврата.Успешно = Ложь;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции
// Кухарь А.Ю.  02.07.2026 конец

// Кухарь А.Ю.  15.07.2026 начало
// Изменение 0000000223
Функция ПланРаспределялсяВНакладные () 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РаспределениеПлановПродажПоНакладным.Накладная КАК Накладная
	|ИЗ
	|	РегистрСведений.РаспределениеПлановПродажПоНакладным КАК РаспределениеПлановПродажПоНакладным
	|ГДЕ
	|	РаспределениеПлановПродажПоНакладным.ПланПродаж = &ПланПродаж";
	Запрос.УстановитьПараметр("ПланПродаж",Ссылка); 
	Выборка = Запрос.Выполнить();
	Если Выборка.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции
// Кухарь А.Ю.  15.07.2026 конец

#КонецОбласти

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)			
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.

	
	// Кухарь А.Ю.  15.07.2026 начало   
	// Изменение 0000000223   
	Если Не ОбщегоНазначения_ПИ.ПрочитатьРСРеквизитСправочника_ПИ("ОтключитьРасчетОстаткаПланов", Неопределено, Ложь) Тогда	
		РеквизитыШапкиНач = ПолучитьРеквизитыШапки(Ссылка, "НеУчитыватьПриРасчетеЗаказа", "Документ");
		Если НеУчитыватьПриРасчетеЗаказа = Истина И РеквизитыШапкиНач.НеУчитыватьПриРасчетеЗаказа = Ложь Тогда 
			Для Каждого СтрокаТЧ Из Состав Цикл
				СтрокаТЧ.КоличествоОстаток = 0;
			КонецЦикла         
		ИначеЕсли НеУчитыватьПриРасчетеЗаказа = Ложь И РеквизитыШапкиНач.НеУчитыватьПриРасчетеЗаказа = Истина Тогда
			Если Не ПланРаспределялсяВНакладные() Тогда
				Для Каждого СтрокаТЧ Из Состав Цикл
					СтрокаТЧ.КоличествоОстаток = СтрокаТЧ.Количество;
				КонецЦикла      
			КонецЕсли;
		КонецЕсли;             
	КонецЕсли;
	// Кухарь А.Ю.  15.07.2026 конец
   
	
	// Кухарь А.Ю.  18.12.2025 начало
	//HELP-8209
	если не ЦеныРассчитаны или Модифицированность() тогда  
		РезультатОбновленияЦен = ОбновитьЦеныПоПравилам(новый Структура("РасчитатьПоПодразделению",истина));
		если РезультатОбновленияЦен.Успех тогда
			ЦеныРассчитаны = Истина;
		иначе       
			ЦеныРассчитаны = ложь;  
			РезультатОбновленияЦен.Ошибки.Добавить("Не удалось расчитать цены по плану продаж № "+Номер);
	        СообщитьИзМодуля(СтрСоединить(РезультатОбновленияЦен.Ошибки,Символы.ПС));
		КонецЕсли; 
	КонецЕсли;
	// Кухарь А.Ю.  18.12.2025 конец
	
	ЕстьИзменения		=Модифицированность();
	НужноВыгружать		=Ложь;
	
	// Нечаева 21,01,26 +++ OUT-179
	Если Проведен Тогда  
		// запрет на распроведение и запрет, на пометку на удаление.
		Если режимзаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			Отказ = истина;
			сообщить("Отмена проведения запрещена!");
		КонецЕсли;
		
		Если ЭтотОбъект.ПометкаУдаления = Истина ТОгда
	    	 Отказ = истина;
			сообщить("Пометка на удаление запрещена! Воспользуйтесь кнопкой - Обнулить!");
   		КонецЕсли;	
		
	КонецЕсли;
	// Нечаева 21,01,26 --- OUT-179


	
	Если НЕ ОбменДанными.Загрузка Тогда		
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
		// Кухарь А.Ю.  02.07.2026 начало
		// Изменение 0000000223
		Если ЕстьИзменения Тогда   
			Если Не ОбщегоНазначения_ПИ.ПрочитатьРСРеквизитСправочника_ПИ("ОтключитьРасчетОстаткаПланов", Неопределено, Ложь) Тогда
				РезультатЗаполненияОстатка = ЗаполнениеОстаткаПлан(); 
				Если Не РезультатЗаполненияОстатка.Успешно Тогда  
					ТекстОшибки = СтрСоединить(РезультатЗаполненияОстатка.Ошибки, ", ");
					ВызватьИсключение ТекстОшибки;
				КонецЕсли;    
			КонецЕсли;
		КонецЕсли;
		// Кухарь А.Ю.  02.07.2026 конец
		
		Если Отказ Тогда Возврат КонецЕсли; 	
	КонецЕсли;		

	Если Отказ Тогда Возврат КонецЕсли;
		
	Если ЕстьИзменения Тогда 
		ТипТовара			= Брэнд.Родитель;		
		КоличествоДокумента = Состав.Итог("Количество");
		СуммаДокумента		= Состав.Итог("Всего");
		ГруппыТоваров		= ГруппыТоваровДокумента(ЭтотОбъект,"Состав",?(Детальный,"Номенклатура","Модель"));
		
		Состав.Сортировать("ТипТовара,Брэнд,Модель,Номенклатура");
		
		НужноВыгружать		= Истина;
	Иначе
		Если (НЕ Ссылка.Проведен И РежимЗаписи=РежимЗаписиДокумента.Проведение) ИЛИ Ссылка.ПометкаУдаления<>ПометкаУдаления Тогда
			НужноВыгружать=Истина;			
		КонецЕсли;		
	КонецЕсли;	
	
	Если НужноВыгружать Тогда
		//УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;
	//++Данилова Е.В. 28.07.2025  HELP-6187
	Если ЕстьИзменения
		И Дата >= Дата(2025,07,01) Тогда
	
		ЗаполнитьТЧКомплектующие(); 	
	    ПроверитьТЧКомплектующие(Отказ); 
		
	КонецЕсли;
	//--Данилова Е.В. 28.07.2025  
	
		
	//---------------------------------------------------------------------------------------------------------
	// нечаева 19,01,26 ++OUT-179
	
	
	
	
	
	
	
	
	// создадим документ коррекции, если есть изменения.
	Если ЭтотОбъект.Проведен и ЕстьИзменения Тогда 
		КоррекцияПлана=Документы.ЗаявкаНаКоррекциюПланаПродаж.СоздатьДокумент();
		ЗаполнитьШапкуДокумента(КоррекцияПлана,ПараметрыСеанса.Пользователь);
		КоррекцияПлана.ОбработкаЗаполнения(ЭтотОбъект);
		КоррекцияПлана.Дата=ТекущаяДата();
		КоррекцияПлана.ДатаПланаПродаж = дата;
		КоррекцияПлана.ДокОснование = ЭтотОбъект.Ссылка;
		
		
		// запись изменений, смотрим, что сейчас есть.
		для каждого СтрТЧПлана из ЭтотОбъект.Состав цикл
			
		
			
			если ЭтотОбъект.Детальный тогда
				СтрСостава=КоррекцияПлана.Состав.Найти(СтрТЧПлана.Номенклатура,"Номенклатура");
			иначе
				СтрСостава=КоррекцияПлана.Состав.Найти(СтрТЧПлана.Модель,"Модель");
			КонецЕсли;
			
			
			если СтрСостава=Неопределено тогда	
				СтрСостава=КоррекцияПлана.Состав.Добавить();
				ЗаполнитьЗначенияСвойств(СтрСостава,СтрТЧПлана);		
				СтрСостава.количествоИсх=0;		
			КонецЕсли;
			СтрСостава.КоличествоФакт=СтрТЧПлана.Количество; // новое количество 
			
			// найдем строку по ссылке
			если ЭтотОбъект.Детальный тогда
				СтрСоставаИсх=ссылка.Состав.Найти(СтрТЧПлана.Номенклатура,"Номенклатура");
			иначе
				СтрСоставаИсх=Ссылка.Состав.Найти(СтрТЧПлана.Модель,"Модель");
			КонецЕсли;
			
			//СтрСостава.КоличествоИсх = СтрСоставаИсх.Количество;
			//Нечаева 30,01,26 ++
			Если СтрСоставаИсх = неопределено Тогда
				СтрСостава.КоличествоИсх = 0;
			иначе	
				СтрСостава.КоличествоИсх = СтрСоставаИсх.Количество;
			КонецЕсли;
			//Нечаева 30,01,26 --

			СтрСостава.Количество= СтрСостава.КоличествоИсх-СтрСостава.КоличествоФакт;
						
			
		КонецЦикла;
		
		// для новых строк. или удаленных?	
		если КоррекцияПлана.Состав.Количество()<>ЭтотОбъект.Состав.Количество() тогда
			Для каждого СтрСостава из  КоррекцияПлана.Состав цикл
				если ЭтотОбъект.Детальный тогда
					СтрТЧПлана=ЭтотОбъект.Состав.Найти(СтрСостава.Номенклатура,"Номенклатура");
				иначе
					СтрТЧПлана=ЭтотОбъект.Состав.Найти(СтрСостава.Модель,"Модель");
				КонецЕсли;
				
				если СтрТЧПлана=Неопределено тогда	
					СтрСостава.КоличествоФакт=0;
					СтрСостава.Количество=СтрСостава.КоличествоИсх-СтрСостава.КоличествоФакт;	
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		// ---------------------------------------------------
		
		СтруктураДляПоиска = Новый Структура("Количество", 0); 
		ТабличнаяЧастьДок = КоррекцияПлана.Состав; 
		МассивПустыхСтрок = ТабличнаяЧастьДок.НайтиСтроки(СтруктураДляПоиска); 
		Для каждого Строка Из МассивПустыхСтрок Цикл 
			ТабличнаяЧастьДок.Удалить(Строка); 
		КонецЦикла; 
			
		КоррекцияПлана.ОтработалСотрудник=ПараметрыСеанса.Пользователь;
		КоррекцияПлана.ПричинаКоррекции=Справочники.ПричиныКоррекций.НайтиПоКоду("000000002");
		КоррекцияПлана.Утвержден=Истина;
		КоррекцияПлана.ДатаОтработки=ТекущаяДата(); 
		КоррекцияПлана.Записать(РежимЗаписиДокумента.Проведение);	
		
		//КоррекцияПлана.ПолучитьФорму("ФормаДокумента").Открыть();   
		
	КонецЕсли;
	// сразу корректируем
	
	//----------------------------------------------------------------------------------------------------------
	// нечаева 19,01,26 ++  
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	ЗапросПоДням=Новый Запрос;
	ЗапросПоДням.Текст="
	|ВЫБРАТЬ
	|	КалендарьДни.Дата КАК Дата
	|ИЗ
	|	Справочник.Календарь.Дни КАК КалендарьДни
	|ГДЕ
	|	КалендарьДни.Ссылка.Период = &Период
	|	И КалендарьДни.Часы > 0
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Дата)
	|ПО ОБЩИЕ";
	
	ЗапросПоДням.УстановитьПараметр("Период",НачалоМесяца(Дата));
	РезультатПоДням	=ЗапросПоДням.Выполнить();
	
	ВсегоДней=0;
	
	ВыборкаПоДням	=РезультатПоДням.Выбрать();
	Пока ВыборкаПоДням.Следующий() Цикл
		Если ВыборкаПоДням.ТипЗаписи()=ТипЗаписиЗапроса.ОбщийИтог Тогда
			ВсегоДней=ВыборкаПоДням.Дата;			
		Иначе					
			Прервать;
		КонецЕсли;	
	КонецЦикла; 
	
	Если ВсегоДней=0 Тогда
		Сообщить("Не заполнен календарь на: " +ПредставлениеПериода(НачалоМесяца(Дата),КонецМесяца(Дата)),СтатусСообщения.Важное);					
		Отказ=Истина;
		Возврат;			
	КонецЕсли;
	
	КоэффКурса=глПересчет(1,Валюта,Курс,ПараметрыСеанса.ВалютаНац,Дата);
	
	ТР=Новый ТаблицаЗначений;
	ТР.Колонки.Добавить("ИтогоРасчКол");
	ТР.Колонки.Добавить("ИтогоФактКол");
	ТР.Колонки.Добавить("Отклонение");
	//++Данилова Е.В. 28.07.2025 HELP-6187 
	ИспользоватьСхемуСКомплектующими = Дата >= Дата(2025,07,01); 
	//--Данилова Е.В. 28.07.2025
	//++Данилова Е.В. 28.07.2025 HELP-6187 
	Если НЕ ИспользоватьСхемуСКомплектующими Тогда 
		
		Если НЕ Детальный Тогда
			
			ТекстЗапроса = "
			|ВЫБРАТЬ
			|	ПланПродажСостав.Модель КАК Модель,
			|	РаспределениеСрезПоследних.Номенклатура,
			|	ПланПродажСостав.Количество КАК Количество,
			|	РаспределениеСрезПоследних.Процент КАК Процент,	
			|	ПланПродажСостав.Количество * РаспределениеСрезПоследних.Процент / 100 КАК План
			|ИЗ
			|	Документ.ПланПродаж.Состав КАК ПланПродажСостав
			|ЛЕВОЕ СОЕДИНЕНИЕ 
			|	РегистрСведений.Распределение.СрезПоследних(&Дата2,Склад=&Склад) КАК РаспределениеСрезПоследних
			|ПО 
			|	ПланПродажСостав.Модель = РаспределениеСрезПоследних.Номенклатура.Родитель
			|ГДЕ
			|	ПланПродажСостав.Ссылка = &Ссылка		
			|ИТОГИ
			|	СУММА(Количество), 
			|	СУММА(План), 
			|	СУММА(Процент)
			|ПО Модель"
			; 	
			//Валетов + 22,01,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#SNL-112 Добавил передачу Отказ в процедуру
			//ДвиженияПоРаспределениюНеДетальные(ВсегоДней, КоэффКурса, РезультатПоДням, ТР,ТекстЗапроса,"ПланПродаж");  
			ДвиженияПоРаспределениюНеДетальные(ВсегоДней, КоэффКурса, РезультатПоДням, ТР,ТекстЗапроса,"ПланПродаж", Отказ);
			//Валетов -
		Иначе
			
			ДвиженияПоТЧДетальные(ВсегоДней, КоэффКурса, РезультатПоДням,"Состав","ПланПродаж");

		КонецЕсли;
		
	Иначе       
		Если НЕ Детальный Тогда
			 	
			ТекстЗапроса = "
			|ВЫБРАТЬ
			|	ПланПродажСостав.Модель КАК Модель,
			|	РаспределениеСрезПоследних.Номенклатура,
			|	ПланПродажСостав.Количество КАК Количество,
			|	РаспределениеСрезПоследних.Процент КАК Процент,	
			|	ПланПродажСостав.Количество * РаспределениеСрезПоследних.Процент / 100 КАК План
			|ИЗ
			|	Документ.ПланПродаж.Состав КАК ПланПродажСостав
			|ЛЕВОЕ СОЕДИНЕНИЕ 
			|	РегистрСведений.Распределение.СрезПоследних(&Дата2,Склад=&Склад) КАК РаспределениеСрезПоследних
			|ПО 
			|	ПланПродажСостав.Модель = РаспределениеСрезПоследних.Номенклатура.Родитель
			|ГДЕ
			|	ПланПродажСостав.Ссылка = &Ссылка		
			|ИТОГИ
			|	СУММА(Количество), 
			|	СУММА(План), 
			|	СУММА(Процент)
			|ПО Модель"
			; 	
						
			//Валетов + 22,01,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#SNL-112 Добавил передачу Отказ в процедуру
			//ДвиженияПоРаспределениюНеДетальные(ВсегоДней, КоэффКурса, РезультатПоДням, ТР,ТекстЗапроса,"ПланПродаж");  
			ДвиженияПоРаспределениюНеДетальные(ВсегоДней, КоэффКурса, РезультатПоДням, ТР,ТекстЗапроса,"ПланПродаж", Отказ);
			//Валетов -
			  						
		Иначе			
			ДвиженияПоТЧДетальные(ВсегоДней, КоэффКурса, РезультатПоДням,"Состав","ПланПродаж");
						
		КонецЕсли;  
		
		// Кухарь А.Ю.  01.07.2026 начало
		// Изменение 0000000223               
		Если Не ОбщегоНазначения_ПИ.ПрочитатьРСРеквизитСправочника_ПИ("ОтключитьРасчетОстаткаПланов", Неопределено, Ложь) Тогда	
			РегистрыНакопления.ОстаткиПлановПродаж.СформироватьИЗаписатьДвижения(ЭтотОбъект);	
		КонецЕсли;
		// Кухарь А.Ю.  01.07.2026 конец
		
	
		
		
		// Кухарь А.Ю.  19.12.2025 начало
	    Запрос = новый запрос;
	    запрос.Текст = "ВЫБРАТЬ
	                   |	ПланПродаж.Период КАК Период,
	                   |	ПланПродаж.Регистратор КАК Регистратор,
	                   |	ПланПродаж.НомерСтроки КАК НомерСтроки,
	                   |	ПланПродаж.Активность КАК Активность,
	                   |	ПланПродаж.Номенклатура КАК Номенклатура,
	                   |	ПланПродаж.Склад КАК Склад,
	                   |	ПланПродаж.Контрагент КАК Контрагент,
	                   |	ПланПродаж.Количество КАК Количество,
	                   |	ПланПродаж.Сумма КАК Сумма,
	                   |	ПланПродаж.Подразделение КАК Подразделение,
	                   |	ПланПродаж.НеУчитыватьПриРасчетеЗаказа КАК НеУчитыватьПриРасчетеЗаказа,
	                   |	ПланПродаж.ВидПланаПродаж КАК ВидПланаПродаж
	                   |ПОМЕСТИТЬ ВТ
	                   |ИЗ
	                   |	РегистрНакопления.ПланПродаж КАК ПланПродаж
	                   |;
	                   |
	                   |////////////////////////////////////////////////////////////////////////////////
	                   |ВЫБРАТЬ
	                   |	ВТ.Период КАК Период,
	                   |	ВТ.Регистратор КАК Регистратор,
	                   |	ВТ.НомерСтроки КАК НомерСтроки,
	                   |	ВТ.Активность КАК Активность,
	                   |	ВТ.Номенклатура КАК Номенклатура,
	                   |	ВТ.Склад КАК Склад,
	                   |	ВТ.Контрагент КАК Контрагент,
	                   |	ВТ.Количество КАК Количество,
	                   |	ВТ.Сумма КАК Сумма,
	                   |	ВТ.Подразделение КАК Подразделение,
	                   |	ВТ.НеУчитыватьПриРасчетеЗаказа КАК НеУчитыватьПриРасчетеЗаказа,
	                   |	ВТ.ВидПланаПродаж КАК ВидПланаПродаж,
	                   |	ВТ.Номенклатура.ВидКомплекта КАК ВидКомплекта
	                   |ИЗ
	                   |	ВТ КАК ВТ
	                   |;
	                   |
	                   |////////////////////////////////////////////////////////////////////////////////
	                   |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                   |	НоменклатураКоплектующие.Номенклатура КАК Номенклатура,
	                   |	СУММА(НоменклатураКоплектующие.Количество) КАК Количество,
	                   |	НоменклатураКоплектующие.Ссылка КАК Продукция,
	                   |	НоменклатураКоплектующие.Ссылка.Родитель.ШтукВКомплекте КАК ШтукВКомплекте
	                   |ИЗ
	                   |	Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
	                   |ГДЕ
	                   |	НоменклатураКоплектующие.Ссылка В
	                   |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	                   |				т1.Номенклатура КАК Номенклатура
	                   |			ИЗ
	                   |				ВТ КАК т1
	                   |			ГДЕ
	                   |				т1.Номенклатура.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект))
	                   |	И НоменклатураКоплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	                   |
	                   |СГРУППИРОВАТЬ ПО
	                   |	НоменклатураКоплектующие.Номенклатура,
	                   |	НоменклатураКоплектующие.Ссылка";
	    запрос.Текст = СтрЗаменить(запрос.Текст,"РегистрНакопления.ПланПродаж","&ТЗ");
	    запрос.УстановитьПараметр("ТЗ",Движения.ПланПродаж.Выгрузить());      		
	    ПакетЗапросов = Запрос.ВыполнитьПакет(); 		
	    ТаблицаДвижений = ПакетЗапросов[1].Выгрузить(); 
	  	ТаблицаКомплектующих = ПакетЗапросов[2].Выгрузить();    
		МассивОшибок = новый Массив;
	    Для Каждого Запись Из ТаблицаДвижений Цикл           
	    	Номенклатура = Запись.Номенклатура;
			Если  Запись.ВидКомплекта = Перечисления.ВидыКомплектов.Комплект Тогда  
				ОсталосьРаспределить = запись.Сумма;
	    		МассивСтрокКомплектующих = ТаблицаКомплектующих.НайтиСтроки(новый Структура("Продукция",Номенклатура));      
	
				Для Каждого СтрокаТЧ ИЗ МассивСтрокКомплектующих Цикл  
					если СтрокаТЧ.ШтукВКомплекте = 0 тогда
						МассивОшибок.Добавить("Не заполнено штук в комплекте у "+Номенклатура);
						Прервать;
					КонецЕсли;

	    				НоваяЗапись = Движения.ПланПродажШтуки.Добавить();             
	    				ЗаполнитьЗначенияСвойств(НоваяЗапись,Запись);
	    				НоваяЗапись.Номенклатура = СтрокаТЧ.Номенклатура;
	    				НоваяЗапись.Количество = СтрокаТЧ.Количество * Запись.Количество;              
						НоваяЗапись.Сумма	   = Запись.Сумма*(СтрокаТЧ.Количество/СтрокаТЧ.ШтукВКомплекте);
	    		КонецЦикла;
	    	Иначе
	    		НоваяЗапись = Движения.ПланПродажШтуки.Добавить(); 
	    		ЗаполнитьЗначенияСвойств(НоваяЗапись,Запись);
			КонецЕсли;       
			если МассивОшибок.Количество()>0 тогда  
				ВызватьИсключение СтрСоединить(МассивОшибок,символы.ПС);
			КонецЕсли;
	    КонецЦикла;
		
 

	КонецЕсли; 	
	//--Данилова Е.В. 28.07.2025
КонецПроцедуры

Процедура ДвиженияПоТЧДетальные(Знач ВсегоДней, Знач КоэффКурса, Знач РезультатПоДням, ИмяТЧ, ИмяРНакопления)  	

	
	Запрос = Новый Запрос; 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланПродажКомплектующие.Номенклатура КАК Номенклатура,
	|	СУММА(ПланПродажКомплектующие.Количество) КАК Количество, 
	|	СУММА(ПланПродажКомплектующие.КоличествоОстаток) КАК КоличествоОстаток,
	|	ПланПродажКомплектующие.Коэффициент КАК Коэффициент,
	|	МАКСИМУМ(ПланПродажКомплектующие.Цена) КАК Цена,
	|	СУММА(ПланПродажКомплектующие.Сумма) КАК Сумма,
	|	ПланПродажКомплектующие.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ПланПродажКомплектующие.НДС) КАК НДС
	|ИЗ
	|	Документ.ПланПродаж.%ИмяТЧ% КАК ПланПродажКомплектующие
	|ГДЕ
	|	ПланПродажКомплектующие.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланПродажКомплектующие.Номенклатура,
	|	ПланПродажКомплектующие.СтавкаНДС,
	|	ПланПродажКомплектующие.Коэффициент"; 
	Запрос.УстановитьПараметр("ссылка",ссылка);
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ИмяТЧ%",ИмяТЧ);
	СтрокаТЧ = Запрос.Выполнить().Выбрать(); 
	Пока СтрокаТЧ.Следующий() Цикл	
		ИтогоРасчКол=0;
		ИтогоФактКол=0;		
		
		ВыборкаПоДням=РезультатПоДням.Выбрать();			
		Пока ВыборкаПоДням.Следующий() Цикл  
			
			Если ВыборкаПоДням.ТипЗаписи()=ТипЗаписиЗапроса.ОбщийИтог Тогда Продолжить КонецЕсли;
			Движение=Движения[ИмяРНакопления].Добавить();
			Движение.НеУчитыватьПриРасчетеЗаказа = НеУчитыватьПриРасчетеЗаказа;
			Движение.ВидПланаПродаж = ВидПланаПродаж;

			Если НЕ Акция Тогда
				Движение.Период			=ВыборкаПоДням.Дата;
			Иначе
				Движение.Период			=Дата;
			КонецЕсли;
			Движение.Номенклатура	=СтрокаТЧ.Номенклатура;
			Движение.Склад			=Склад;
			Движение.Контрагент     =Контрагент;
			
			РасчКол					=СтрокаТЧ.Количество/ВсегоДней;			
			Движение.Количество		=РасчКол;
			
			ИтогоРасчКол			=ИтогоРасчКол+РасчКол;
			ИтогоФактКол			=ИтогоФактКол+Движение.Количество;
			
			Корректировка=Окр(ИтогоРасчКол-ИтогоФактКол,0,1);
			Если Корректировка<>0 Тогда
				Движение.Количество	=Движение.Количество+Корректировка;
				ИтогоФактКол		=ИтогоФактКол+Корректировка;					
			КонецЕсли;
			
			Если Движение.Количество=0 Тогда
				Движения[ИмяРНакопления].Удалить(Движение);				
			КонецЕсли; 
			
			Движение.Сумма			=Движение.Количество*СтрокаТЧ.Цена*КоэффКурса;
			
			Движение.Подразделение	=Подразделение;  
			
		КонецЦикла;		
	КонецЦикла;

КонецПроцедуры

//Валетов + 22,01,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#SNL-112 Добавил передачу Отказ в процедуру
Процедура ДвиженияПоРаспределениюНеДетальные(Знач ВсегоДней, Знач КоэффКурса, Знач РезультатПоДням, Знач ТР, ТекстЗапроса, ИмяРНакопления,Отказ)	
//Валетов -
	Запрос = Новый Запрос;
	//++Данилова Е.В. 28.07.2025 HELP-6187 
	Запрос.Текст = ТекстЗапроса;  
	//Запрос.Текст="
	//|ВЫБРАТЬ
	//|	ПланПродажСостав.Модель КАК Модель,
	//|	РаспределениеСрезПоследних.Номенклатура,
	//|	ПланПродажСостав.Количество КАК Количество,
	//|	РаспределениеСрезПоследних.Процент КАК Процент,	
	//|	ПланПродажСостав.Количество * РаспределениеСрезПоследних.Процент / 100 КАК План
	//|ИЗ
	//|	Документ.ПланПродаж.Состав КАК ПланПродажСостав
	//|ЛЕВОЕ СОЕДИНЕНИЕ 
	//|	РегистрСведений.Распределение.СрезПоследних(&Дата2,Склад=&Склад) КАК РаспределениеСрезПоследних
	//|ПО 
	//|	ПланПродажСостав.Модель = РаспределениеСрезПоследних.Номенклатура.Родитель
	//|ГДЕ
	//|	ПланПродажСостав.Ссылка = &Ссылка		
	//|ИТОГИ
	//|	СУММА(Количество), 
	//|	СУММА(План), 
	//|	СУММА(Процент)
	//|ПО Модель"
	//; 
	//--Данилова Е.В. 28.07.2025
	
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата));
	Запрос.УстановитьПараметр("Склад",Склад);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	КэшЦен=Новый Соответствие;
	
	ВыборкаПоМоделям=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Модель");
	Пока ВыборкаПоМоделям.Следующий() Цикл		
		Если ВыборкаПоМоделям.Количество=0 Тогда Продолжить КонецЕсли; 
		
		Если ВыборкаПоМоделям.План=Null ИЛИ ВыборкаПоМоделям.План=0 Тогда
			Сообщить("Не задано распределение по модели: "+ВыборкаПоМоделям.Модель.Родитель+"/"+ВыборкаПоМоделям.Модель,СтатусСообщения.Важное);
			Отказ=Истина;
			Продолжить;	
		КонецЕсли;		
		
		ИтогоРасчКол=0;
		ИтогоФактКол=0;
		КоэффициентКорректировки=100/ВыборкаПоМоделям.Процент;
		
		Модель	= ВыборкаПоМоделям.Модель;
		Цена	= КэшЦен.Получить(Модель);
		
		Если Цена=Неопределено Тогда
			СтрокаТЧ=Состав.Найти(Модель,"Модель");
			Если СтрокаТЧ<>Неопределено Тогда
				Цена=СтрокаТЧ.Цена;
				КэшЦен.Вставить(Модель,Цена);
			Иначе
				Цена=0;
			КонецЕсли; 
		КонецЕсли; 
		
		ВыборкаПоТоварам=ВыборкаПоМоделям.Выбрать();	
		Пока ВыборкаПоТоварам.Следующий() Цикл
			Если ВыборкаПоТоварам.План=Null или ВыборкаПоТоварам.План=0 Тогда Продолжить КонецЕсли;			
			
			ВыборкаПоДням=РезультатПоДням.Выбрать();			
			Пока ВыборкаПоДням.Следующий() Цикл
				Если ВыборкаПоДням.ТипЗаписи()=ТипЗаписиЗапроса.ОбщийИтог Тогда Продолжить КонецЕсли;					
				//++Данилова Е.В. 28.07.2025 HELP-6187	
				//Движение=Движения.ПланПродаж.Добавить();
				Движение=Движения[ИмяРНакопления].Добавить();
				//--Данилова Е.В. 28.07.2025
				
				//крохин начало 15.09.2020
				Движение.НеУчитыватьПриРасчетеЗаказа = НеУчитыватьПриРасчетеЗаказа;
				//крохин конец 15.09.2020
				
				// Шворобей ВЮ 08.08.2023 ++
				Движение.ВидПланаПродаж = ВидПланаПродаж;
				// Шворобей ВЮ 08.08.2023 ++
				
				//крохин начало 11.09.2012
				//акция формирует проводки на одну дату
				//Движение.Период			=ВыборкаПоДням.Дата;
				Если НЕ Акция Тогда
					Движение.Период			=ВыборкаПоДням.Дата;
				Иначе
					Движение.Период			=Дата;
				КонецЕсли;
				//крохин конец 11.09.2012
				Движение.Номенклатура	=ВыборкаПоТоварам.Номенклатура;
				Движение.Склад			=Склад;
				//крохин начало
				Движение.Контрагент     =Контрагент;
				//крохин конец
				
				РасчКол				=ВыборкаПоТоварам.План/ВсегоДней*КоэффициентКорректировки;			
				Движение.Количество	=РасчКол;
				
				ИтогоРасчКол		=ИтогоРасчКол+РасчКол;
				ИтогоФактКол		=ИтогоФактКол+Движение.Количество;
				
				Корректировка=Окр(ИтогоРасчКол-ИтогоФактКол,0,1);
				Если Корректировка<>0 Тогда
					Движение.Количество	=Движение.Количество+Корректировка;
					ИтогоФактКол		=ИтогоФактКол+Корректировка;					
				КонецЕсли;				
				
				Движение.Сумма			=Движение.Количество*Цена*КоэффКурса;
				
				Движение.Подразделение	=Подразделение;
				
				СтрокаТР=ТР.Добавить();
				СтрокаТР.ИтогоРасчКол	=ИтогоРасчКол;
				СтрокаТР.ИтогоФактКол	=ИтогоФактКол;
				СтрокаТР.Отклонение		=ИтогоРасчКол-ИтогоФактКол;
				
			КонецЦикла;			
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда  
			
		Валюта 	= Основание.Валюта;
		ИБ 		= Основание.ИБ;
		Склад 	= Основание.Склад;
		ТипЦен 	= Основание.ТипЦен;
		
		Для Каждого СтрокаИст Из Основание.Товары  Цикл
			Если СтрокаИст.Количество=0 Тогда Продолжить КонецЕсли;
			
			СтрокаТЧ=Состав.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаИст);
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры

#Область Комплектующие 
//++Данилова Е.В. 28.07.2025
Процедура ЗаполнитьТЧКомплектующие()
	
	//Если Комплектующие.Количество() = 0  Тогда
	
	Если Детальный Тогда 
		
		ЗаполнениеДокументов.ЗаполнитьТЧКомплектующиеСоСверткой(ЭтотОбъект,,,"Состав",истина);
		Для каждого СтрокаТЧ Из Состав Цикл
			
			ЗаполнитьКоличествоКомплектующихПоСтроке(СтрокаТЧ); 	
			
		КонецЦикла;
		
		//Сообщить("Была (пере)заполнена Табличная часть ""Комплектующие""");  
		//КонецЕсли;
	Иначе
		
		ТЧСостав = ПолучитьТаблицуСоставИзРаспределения();
		
		
		ЗаполнитьТЧКомплектующиеПоРаспределению(ТЧСостав); 
		
		//Сообщить("Была (пере)заполнена Табличная часть ""Комплектующие""");
		
	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТаблицуСоставИзРаспределения() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланПродажСостав.Модель КАК Модель,
	|	ПланПродажСостав.Количество КАК Количество
	|ПОМЕСТИТЬ ВТПланПродажСостав
	|ИЗ
	|	&Состав КАК ПланПродажСостав
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПланПродажСостав.Модель КАК Модель,
	|	РаспределениеСрезПоследних.Номенклатура КАК Номенклатура,
	|	ПланПродажСостав.Количество * РаспределениеСрезПоследних.Процент / 100 КАК Количество,
	|	ВЫБОР
	|		КОГДА РаспределениеСрезПоследних.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|			ТОГДА ВЫБОР
	|					КОГДА РаспределениеСрезПоследних.Номенклатура.Родитель.ШтукВКомплекте = 0
	|							ИЛИ РаспределениеСрезПоследних.Номенклатура.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект)
	|						ТОГДА ПланПродажСостав.Количество * РаспределениеСрезПоследних.Процент / 100
	|					ИНАЧЕ ПланПродажСостав.Количество * РаспределениеСрезПоследних.Процент / 100 * РаспределениеСрезПоследних.Номенклатура.Родитель.ШтукВКомплекте
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоКомплектующих,
	|	1 КАК Коэффициент,
	|	0 КАК Цена
	|ИЗ
	|	ВТПланПродажСостав КАК ПланПродажСостав
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Распределение.СрезПоследних(&Дата2, Склад = &Склад) КАК РаспределениеСрезПоследних
	|		ПО ПланПродажСостав.Модель = РаспределениеСрезПоследних.Номенклатура.Родитель
	|ГДЕ
	|	НЕ РаспределениеСрезПоследних.Номенклатура ЕСТЬ NULL
	|	И РаспределениеСрезПоследних.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата));
	Запрос.УстановитьПараметр("Склад",Склад);
	Запрос.УстановитьПараметр("Состав",Состав.Выгрузить());
	
	ТЧСостав = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЧСостав;

КонецФункции

Процедура ПроверитьТЧКомплектующие(Отказ)

	КоличествоДокумента 	= Состав.Итог("Количество");
	КоличествоКомплектующих = Комплектующие.Итог("Количество");
	
	КоличествоКомплектующихДляСверки = Состав.Итог("КоличествоКомплектующих");
	
	Если КоличествоКомплектующихДляСверки = 0 
		И Детальный Тогда
		Для каждого СтрокаТЧ из Состав цикл
			ЗаполнитьКоличествоКомплектующихПоСтроке(СтрокаТЧ);		
		КонецЦикла;			
	КонецЕсли;
	
	Если не ОбменДанными.Загрузка тогда
		
		Если Детальный
			И Состав.Итог("КоличествоКомплектующих") <> Комплектующие.Итог("Количество") тогда
			СообщитьИзМодуля("Не совпадает количество комплектующих в таблице состав и в таблице комплектующие");
			Отказ = Истина; 
		КонецЕсли;
		
		Если Детальный Тогда 
			
			//ТЧНоменклатура = Состав.Выгрузить(,"Номенклатура");
			//ТЧНоменклатура.Свернуть("Номенклатура"); 
			МассивНоменклатуры = ПолучитьМассивНоменклатуры("Состав","Номенклатура");//ТЧНоменклатура.ВыгрузитьКолонку("Номенклатура");
			
			//ТЧПродукции = Комплектующие.Выгрузить(,"Продукция"); 
			//ТЧПродукции.Свернуть("Продукция"); 	
			
			МассивПродукции = ПолучитьМассивНоменклатуры("Комплектующие","Продукция");//ТЧПродукции.ВыгрузитьКолонку("Продукция");
			
			Если МассивНоменклатуры.Количество() <>  МассивПродукции.Количество() Тогда
				
				Отказ = истина; 
				Сообщить("Не совпадает номенклатура на закладке Состав и Комплектующие");
			Иначе 
				Для каждого ЭлементТовара Из МассивНоменклатуры Цикл
					
					Если МассивПродукции.Найти(ЭлементТовара) = неопределено Тогда
						
						Отказ = Истина; 	
						
						Сообщить("Не совпадает номенклатура на закладке Состав:" +Строка(ЭлементТовара)  + " и Комплектующие: не найдено");
						
					КонецЕсли;	
					
				КонецЦикла; 
				
				Для каждого ЭлементТовара Из МассивПродукции Цикл
					
					Если МассивНоменклатуры.Найти(ЭлементТовара) = неопределено Тогда
						
						Отказ = Истина; 	
						
						Сообщить("Не совпадает номенклатура на закладке Комплектующие:" +Строка(ЭлементТовара)  + " и Состав: не найдено");
						
					КонецЕсли;	
					
				КонецЦикла;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;                                
	

КонецПроцедуры

Функция ЗаполнитьТЧКомплектующиеПоРаспределению(ТЧРаспределения)  Экспорт
	
	
	ТаблицаКомплектующих = Новый ТаблицаЗначений;
	ТаблицаКомплектующих.Колонки.Добавить("Продукция");
	ТаблицаКомплектующих.Колонки.Добавить("Номенклатура");
	ТаблицаКомплектующих.Колонки.Добавить("Количество");
	
	СоответствиеМодельКоличествоКомплектующих = Новый Соответствие; 
	Для Каждого СтрокаТЧ Из ТЧРаспределения Цикл
		
		ВремТЗ = ПолучитьТаблицуКомплектующих(СтрокаТЧ.Номенклатура);
		Для Каждого СтрокаВремТЗ Из ВремТЗ Цикл
			
			Если СтрокаВремТЗ.Номенклатура.Родитель.ВидНоменклатуры <> Перечисления.ВидыНоменклаутры.Товар Тогда
				
				Продолжить;	
			КонецЕсли;
			
			НоваяСтрока = ТаблицаКомплектующих.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВремТЗ);
			
		КонецЦикла;
		
		КоличествоКомплектующих = СоответствиеМодельКоличествоКомплектующих.Получить(СтрокаТЧ.Модель); 
		Если КоличествоКомплектующих = неопределено Тогда
			
			КоличествоКомплектующих = 0; 	
			
		КонецЕсли;
		СоответствиеМодельКоличествоКомплектующих.Вставить(СтрокаТЧ.Модель,КоличествоКомплектующих + Окр(СтрокаТЧ.КоличествоКомплектующих)); 
	КонецЦикла;
	
	ТР = Новый ТаблицаЗначений;	
	ТР.Колонки.Добавить("Продукция");
	ТР.Колонки.Добавить("Номенклатура");
	ТР.Колонки.Добавить("Количество");
	ТР.Колонки.Добавить("Всего");
	
	Для Каждого СтрокаТЧ Из ТЧРаспределения Цикл
		
		
		КолвоПродукции	= СтрокаТЧ.Количество * СтрокаТЧ.Коэффициент;
		
		СтрокиТаблицыКомплектующих = ТаблицаКомплектующих.НайтиСтроки(Новый Структура("Продукция", СтрокаТЧ.Номенклатура));
		
		Для Каждого СтрокаТаблицыКомплектующих Из СтрокиТаблицыКомплектующих Цикл			
			
			ТекНоменклатура		= СтрокаТаблицыКомплектующих.Номенклатура;
			ТребуемоеКоличество	= КолвоПродукции * СтрокаТаблицыКомплектующих.Количество;
			
			Если ТребуемоеКоличество = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТекНоменклатура.Коплектующие.Количество() = 0 
				ИЛИ ТекНоменклатура.ВидКомплекта = Перечисления.ВидыКомплектов.ГотовыйКомплект Тогда
				СтрокаТР = ТР.Добавить();
				СтрокаТР.Продукция		= СтрокаТЧ.Номенклатура;
				СтрокаТР.Номенклатура	= ТекНоменклатура;				
				СтрокаТР.Количество		= ТребуемоеКоличество;
				Если СтрокаТЧ.Номенклатура.ВидКомплекта <> Перечисления.ВидыКомплектов.Комплект Тогда // Если ЭтоПродукцияБезВложенныхКомплектов Тогда
					СтрокаТР.Всего = СтрокаТР.Количество * СтрокаТЧ.Цена;
				КонецЕсли;				
				
				
			ИначеЕсли (ТекНоменклатура.ВидКомплекта = Перечисления.ВидыКомплектов.Ассортито)
				Или (НЕ ЗначениеЗаполнено(ТекНоменклатура.ВидКомплекта)) Тогда
				
				ТЗПропорций = Новый ТаблицаЗначений;
				ТЗПропорций.Колонки.Добавить("Номенклатура");
				ТЗПропорций.Колонки.Добавить("Количество");
				
				для каждого СтрТЧКМП из ТекНоменклатура.Коплектующие цикл
					СтрПроп=ТЗПропорций.Добавить();
					СтрПроп.Номенклатура=СтрТЧКМП.Номенклатура;
					СтрПроп.Количество=Окр(ТребуемоеКоличество*СтрТЧКМП.Количество/ТекНоменклатура.Коплектующие.Итог("Количество"),0);			
				КонецЦикла;
				если ТЗПропорций.Итог("Количество")<>ТребуемоеКоличество тогда
					СтрДоберём = ТЗПропорций.Получить(ТЗПропорций.Количество()-1);
					СтрДоберём.количество=СтрДоберём.количество+(ТребуемоеКоличество-ТЗПропорций.Итог("Количество"));
				КонецЕсли;
				
				
				ТЗПропорций.Свернуть("Номенклатура","Количество");
				Для каждого СтрТЗПроп из ТЗПропорций цикл
					СтрокаТР=ТР.Добавить();
					СтрокаТР.Продукция 		= СтрокаТЧ.Номенклатура;
					СтрокаТР.Номенклатура	= СтрТЗПроп.Номенклатура;				
					СтрокаТР.Количество		= + СтрТЗПроп.Количество;
					Если СтрокаТЧ.Номенклатура.ВидКомплекта <> Перечисления.ВидыКомплектов.Комплект Тогда // Если ЭтоПродукцияБезВложенныхКомплектов Тогда
						СтрокаТР.Всего = СтрТЗПроп.Количество * СтрокаТЧ.Цена;
					КонецЕсли;
				КонецЦикла;	
				
				
			Иначе
				СообщитьИзМодуля("ВНУТРЕННЯЯ ОШИБКА! Комплекты с Вид комплекта = " + ТекНоменклатура.ВидКомплекта + " не поддерживаются!");					
			КонецЕсли;							
		КонецЦикла;			
	КонецЦикла;	
	
	ТР.Свернуть("Номенклатура, Продукция","Количество, Всего");
	
	
	Комплектующие.Очистить(); 
	
	Для Каждого СтрокаТР Из ТР Цикл
		Если СтрокаТР.Количество = 0 тогда
			Продолжить;
		КонецЕсли;
		СтрокаТЧ = Комплектующие.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаТР);
		
		ПриИзмененииНоменклатурыТабЧасти(СтрокаТЧ, ЭтотОбъект);
		РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект, "ОтВсего");			
	КонецЦикла;
	
	Для каждого СтрокаПоМодели Из Состав Цикл
		
		СтрокаПоМодели.КоличествоКомплектующих = СоответствиеМодельКоличествоКомплектующих.Получить(СтрокаПоМодели.Модель); 
		
	КонецЦикла;
	
	
КонецФункции

Функция ПолучитьТаблицуКомплектующих(Продукция, МассивПродукцииВерхнегоУровня = Неопределено)
	
	ТаблицаКомплектующих = Новый ТаблицаЗначений;
	ТаблицаКомплектующих.Колонки.Добавить("Продукция");
	ТаблицаКомплектующих.Колонки.Добавить("Номенклатура");
	ТаблицаКомплектующих.Колонки.Добавить("Количество");
	
	// чтобы отслеживать ситуацию зацикливания комплектов
	МассивПВУ = Новый Массив;
	Если МассивПродукцииВерхнегоУровня <> Неопределено Тогда
		Для Каждого Элемент Из МассивПродукцииВерхнегоУровня Цикл 
			МассивПВУ.Добавить(Элемент);
		КонецЦикла;
	КонецЕсли;
	МассивПВУ.Добавить(Продукция);
	
	ОбщКолКомп=Продукция.Коплектующие.Итог("Количество");
	
	Запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НоменклатураКоплектующие.Номенклатура КАК Запчасть,
	|	НоменклатураКоплектующие.Номенклатура.НоменклатураЗамены КАК ЗаменаЗапчасти,
	|	НоменклатураКоплектующие.Ссылка КАК Продукция
	|ИЗ
	|	Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
	|ГДЕ
	|	НоменклатураКоплектующие.Ссылка = &Продукция";
	запрос.УстановитьПараметр("Продукция",Продукция);
	ТаблицаЗамен=запрос.Выполнить().Выгрузить();
	
	Если (Продукция.ВидКомплекта = Перечисления.ВидыКомплектов.Комплект)
		И (Продукция.Коплектующие.Количество() > 0) Тогда		
		Для Каждого СтрокаТЧ Из Продукция.Коплектующие Цикл
			Комплектующее = СтрокаТЧ.Номенклатура;
			
			СтрокаЗамены=ТаблицаЗамен.Найти(Комплектующее,"Запчасть");
			если СтрокаЗамены<>Неопределено и ЗначениеЗаполнено(СтрокаЗамены.ЗаменаЗапчасти) тогда
				Комплектующее	= СтрокаЗамены.ЗаменаЗапчасти;
			КонецЕсли;				
			Если МассивПВУ.Найти(Комплектующее) <> Неопределено Тогда
				СообщитьИзМодуля("ОШИБКА! Обнаружено зацикливание комплектующих у комплекта """ + МассивПВУ[0] + """!" + Символы.ПС
				+ " - зацикливание возникло на комплектующем """ + Комплектующее + """"
				+ " из вложенного комплекта """ + Продукция + """");
				Продолжить;
			КонецЕсли;
			
			КолвоКомплектующих	= СтрокаТЧ.Количество * СтрокаТЧ.Единица.Коэффициент;
			ВремТЗ				= ПолучитьТаблицуКомплектующих(Комплектующее, МассивПВУ);
			Для Каждого СтрокаВремТЗ Из ВремТЗ Цикл
				НоваяСтрока = ТаблицаКомплектующих.Добавить();
				НоваяСтрока.Продукция		= Продукция;
				НоваяСтрока.Номенклатура	= СтрокаВремТЗ.Номенклатура;			
				НоваяСтрока.Количество		= КолвоКомплектующих * СтрокаВремТЗ.Количество;				
			КонецЦикла;			
		КонецЦикла;				
	Иначе
		НоваяСтрока					= ТаблицаКомплектующих.Добавить();
		НоваяСтрока.Продукция		= Продукция; // МассивПВУ[0];
		НоваяСтрока.Номенклатура	= Продукция;
		НоваяСтрока.Количество		= 1;
	КонецЕсли;
	
	Возврат ТаблицаКомплектующих; 
	
КонецФункции

Функция ПолучитьМассивНоменклатуры(ИмяТЧ,ИмяКолонки)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПланПродажТовары.%ИмяКолонки% КАК Номенклатура,
		|	ПланПродажТовары.Количество КАК Количество
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	&Товары КАК ПланПродажТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТТовары.Номенклатура КАК Номенклатура
		|ИЗ
		|	ВТТовары КАК ВТТовары
		|ГДЕ
		|	ВТТовары.Количество > 0
		|	И ВЫРАЗИТЬ(ВТТовары.Номенклатура КАК Справочник.Номенклатура).Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)"; 	
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ИмяКолонки%",ИмяКолонки);
	
	Запрос.УстановитьПараметр("Товары",ЭтотОбъект[ИмяТЧ].Выгрузить()); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Номенклатура"); 


КонецФункции  


//--Данилова Е.В. 28.07.2025
#КонецОбласти

 
// Кухарь А.Ю.  18.12.2025 начало
// HELP-8209    
#Область РасчетЦен 

Функция ОбновитьЦеныПоПравилам (СтруктураПараметров = Неопределено) Экспорт 

	ЦеныОбновлены = ложь;       
	СтруктураТиповЦен = Неопределено;     
	СтруктураВозврата = новый Структура("Успех,Ошибки",Истина,Новый Массив);
	
	если ТипЗнч(СтруктураПараметров) = Тип("Структура") тогда 
		Если СтруктураПараметров.Свойство("РасчитатьПоПодразделению") и   СтруктураПараметров.РасчитатьПоПодразделению = Истина тогда 
			СтруктураТиповЦен = Документы.ПланПродаж.ПолучитьСтруктуруРекомендуемыхТиповЦенПоПодразделению(Подразделение);      
			если не СтруктураТиповЦен.Успех тогда   
				МаркировкаКС.ДобавитьОшибки(СтруктураВозврата.Ошибки,СтруктураТиповЦен.Ошибки);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	          
	
	
	если СтруктураВозврата.Ошибки.количество() = 0 тогда
		если СтруктураТиповЦен = Неопределено тогда
			СтруктураТиповЦен = ПолучитьСтруктуруРекомендуемыхТиповЦенПоТекущемуОбъекту();
		иначе 
			Скидка = СтруктураТиповЦен.Скидка;	
			ТипЦен = СтруктураТиповЦен.ТипЦен;	
		КонецЕсли; 
		

		
		если СтруктураТиповЦен.ИспользоватьМатрицуДляПлановПродаж тогда
			Результат = ОбновитьЦеныПоМатрицам(СтруктураТиповЦен);
		Иначе
			Результат = ОбновитьЦеныПоТипуЦен(СтруктураТиповЦен);
		КонецЕсли; 
		если не Результат.Успех тогда
			МаркировкаКС.ДобавитьОшибки(СтруктураВозврата.Ошибки,Результат.Ошибки); 
		КонецЕсли;
	КонецЕсли; 
	
	если СтруктураВозврата.Ошибки.количество() > 0 тогда  
		СтруктураВозврата.Успех = ложь;
	КонецЕсли;

	возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьСтруктуруРекомендуемыхТиповЦенПоТекущемуОбъекту () 

	СтруктураВозврата = Документы.ПланПродаж.СоздатьСтруктуруВозвратаРекомендуемыхТиповЦен();	
	ЗаполнитьЗначенияСвойств(СтруктураВозврата,ЭтотОбъект,"ТипЦен,Скидка");    
	если не ЗначениеЗаполнено(СтруктураВозврата.ТипЦен) тогда 
		СтруктураВозврата.ИспользоватьМатрицуДляПлановПродаж = Истина;
	КонецЕсли;
	Возврат СтруктураВозврата;
		
КонецФункции       

Функция ОбновитьЦеныПоМатрицам(СтруктураТиповЦен)
	СтруктураВозврата = новый Структура("Успех,Ошибки",Истина, новый Массив);		
	СтруктураОтключаемыхФильтров = новый Структура("ПунктДоставки,Договор,ПостояннаяАкция",Истина,Истина,Истина);      
	ДатаЦены = ?(ЗначениеЗаполнено(ДатаРасчетаЦенПоМатрице),ДатаРасчетаЦенПоМатрице,Дата);
	
	МассивНоменклатуры = ПолучитьМассивНоменклатурыПланаРазвернуто();
	СтруктураДокумента = новый Структура("Номенклатура,ПунктДоставки,Контрагент,Дата,Договор,ПостояннаяАкция",
	МассивНоменклатуры,Справочники.ПунктыДоставки.ПустаяСсылка(),Контрагент,ДатаЦены,Справочники.Договоры.ПустаяСсылка(),ложь);       
	
	
	если МатрицыДляРасчетаЦен.Количество() = 0 тогда
		ТаблицаМатриц = ПолучитьТаблицуМатрицСрезПоследних(СтруктураДокумента,Неопределено,МассивНоменклатуры,СтруктураОтключаемыхФильтров);    
	иначе 
		ТаблицаМатриц = ПолучитьТаблицуМатрицИзМатрицДляРасчётаЦен(МассивНоменклатуры);    
	КонецЕсли;

	Если Детальный тогда
		ИмяКолонкиПоиска = "Номенклатура";
	Иначе
		ИмяКолонкиПоиска = "Модель";   
		ТаблицаМатриц.Свернуть("Модель,Цена")
	КонецЕсли;
	
	
	Для каждого СтрокаТЧ из Состав цикл    
		СтрокаТЗ = ТаблицаМатриц.Найти(СтрокаТЧ.Номенклатура,ИмяКолонкиПоиска);
		если СтрокаТЗ = Неопределено тогда 
			СтруктураВозврата.Ошибки.Добавить("Не найдена цена в матрице по "+СтрокаТЧ.Номенклатура);     
			Продолжить;
		КонецЕсли; 
		
		СтрокаТЧ.ЦенаБезСкидки=СтрокаТЗ.Цена;
		СтрокаТЧ.Цена=Макс(СтрокаТЗ.Цена*(1-СтруктураТиповЦен.Скидка/100),0);
		РассчитатьСуммуТабЧасти(СтрокаТЧ,ЭтотОбъект);
		
	КонецЦикла;        
	
	если СтруктураВозврата.Ошибки.Количество()>0 тогда
		СтруктураВозврата.Успех = ложь;
	КонецЕсли;
	
	возврат СтруктураВозврата;
	
КонецФункции

Функция ОбновитьЦеныПоТипуЦен(СтруктураТиповЦен) 
	
	СтруктураВозврата = новый Структура("Успех,Ошибки",Истина, новый Массив);
	
	если не ЗначениеЗаполнено(СтруктураТиповЦен.ТипЦен) тогда    
		СтруктураВозврата.Ошибки.Добавить("Не заполнен тип цен");  
	иначе	
		Для каждого СтрокаТЧ из Состав цикл   
			ЦенаПоПрайсу=ПолучитьЦенуНоменклатуры(СтрокаТЧ.Модель,,СтруктураТиповЦен.ТипЦен,Валюта,Курс,Дата);
			если не ЗначениеЗаполнено(ЦенаПоПрайсу) тогда  
				СтруктураВозврата.Ошибки.Добавить("Не найдена цена в прайсах по "+СтрокаТЧ.Модель);  	
			КонецЕсли;	                                 
			СтрокаТЧ.ЦенаБезСкидки=ЦенаПоПрайсу;
			СтрокаТЧ.Цена=Макс(ЦенаПоПрайсу*(1-СтруктураТиповЦен.Скидка/100),0);
			
			РассчитатьСуммуТабЧасти(СтрокаТЧ,ЭтотОбъект);		
		КонецЦикла;
	КонецЕсли;
	
	если СтруктураВозврата.Ошибки.Количество()>0 тогда
		СтруктураВозврата.Успех = ложь;
	КонецЕсли;
	
	возврат СтруктураВозврата;    
	
	
КонецФункции

Функция ПолучитьМассивНоменклатурыПланаРазвернуто () 
	Запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ(&МассивНоменклатуры)";
	запрос.УстановитьПараметр("МассивНоменклатуры",Состав.ВыгрузитьКолонку("Номенклатура"));      
	Возврат запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьТаблицуМатрицИзМатрицДляРасчётаЦен (МассивНоменклатуры)
	Запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	|	МатрицаТовары.Номенклатура КАК Номенклатура,
	|	МатрицаТовары.Номенклатура.Родитель КАК Модель,
	|	МатрицаТовары.Цена КАК Цена
	|ИЗ
	|	Документ.Матрица.Товары КАК МатрицаТовары
	|ГДЕ
	|	МатрицаТовары.Ссылка В(&МассивМатриц)
	|	И МатрицаТовары.Номенклатура В ИЕРАРХИИ(&МассивНоменклатуры)";
	запрос.УстановитьПараметр("МассивМатриц",МатрицыДляРасчетаЦен.ВыгрузитьКолонку("Матрица"));   
	запрос.УстановитьПараметр("МассивНоменклатуры",МассивНоменклатуры);   	 
	возврат запрос.Выполнить().Выгрузить();
КонецФункции
#КонецОбласти


// Кухарь А.Ю.  18.12.2025 конец


