Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	
	ПараметрыСеанса.ОтключитьЖурнализациюЗаписи	=Истина;	
	//		ПараметрыСеанса.ОтключитьКонтрольДЗР		=Истина;
	ПараметрыСеанса.ОтключитьКонтрольРезервов	=Истина;
	
	Если Константы.ДатаРасчетнойПоследовательностиЦенЗаказовПоставщикам.Получить() >  Константы.ДатаЗапретаРедактирования.Получить() Тогда
		ДатаЗапрета = Константы.ДатаРасчетнойПоследовательностиЦенЗаказовПоставщикам.Получить();  
	Иначе
		ДатаЗапрета = КонецДня(Константы.ДатаЗапретаРедактирования.Получить())+1; 
	КонецЕсли;
	
	ЗаписатьВЛог("Обработка цен в ЗПС","Начало обработки. Проведение с : "+ДатаЗапрета,"Информация");
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка КАК Документ
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|ГДЕ
	|	ЗаказПоставщику.Проведен
	|	И ЗаказПоставщику.СостояниеЗаказа <> &СостояниеЗаказа
	|	И ЗаказПоставщику.Машина = &ПустаяМашина
	|	И (НЕ ЗаказПоставщику.ЦеныПересчитаны)
	|	И ЗаказПоставщику.ОтгрузкаСТранзитногоСклада
	|	И ЗаказПоставщику.Дата >= &ДатаЗапрета
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказПоставщику.Ссылка.Дата
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("СостояниеЗаказа",Перечисления.СостояниеЗаказаПоставщику.Получен);
	// Запрос.УстановитьПараметр("ДатаЗапрета",Макс(КонецДня(Константы.ДатаРасчетнойПоследовательностиЦенЗаказовПоставщикам.Получить()),КонецДня(Константы.ДатаЗапретаРедактирования.Получить())));
	Запрос.УстановитьПараметр("ДатаЗапрета",ДатаЗапрета);
	Запрос.УстановитьПараметр("ПустаяМашина",Документы.Машина.ПустаяСсылка());
	СписокЗПС = Новый ТаблицаЗначений;
	СписокЗПС.Колонки.Добавить("Документ");
	Выборка = запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаЗПС = СписокЗПС.Добавить();
		СтрокаЗПС.Документ = Выборка.Документ;
		
	КонецЦикла;
	
	// СтрокаЗПС = СписокЗПС.Добавить();
	//СтрокаЗПС.Документ = Документы.ЗаказПоставщику.НайтиПоНомеру("RI1-000132",ТекущаяДата());
	// СтрокаЗПС = СписокЗПС.Добавить();
	//СтрокаЗПС.Документ = Документы.ЗаказПоставщику.НайтиПоНомеру("RI1-000159",ТекущаяДата());
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ    Различные
	|	Партии.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.Партии КАК Партии
	|ГДЕ
	|	Партии.Период >= &ДатаЗапрета
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("ДатаЗапрета",ДатаЗапрета);
	
	Выборка = запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		#Если Клиент Тогда
			ОбработкаПрерыванияПользователя();
		#КонецЕсли
		Если СписокЗПС.найти(Выборка.Регистратор,"Документ") <> Неопределено Тогда
			ПересчитатьЦеныВЗПС(Выборка.Регистратор);
		Иначе
			//ДокОбъект = Выборка.Регистратор.ПолучитьОбъект();
			//ДокОбъект.записать(РежимЗаписиДокумента.Проведение);
			//нечаева 15,10,14 +++
			ДокОбъект = Выборка.Регистратор.ПолучитьОбъект();
			ВидДок=Выборка.Регистратор.Ссылка.Метаданные().Имя;
			Если ВидДок<>"КоррекцияРегистраПартии" Тогда
				
				ДокОбъект.записать(РежимЗаписиДокумента.Проведение);
				//кухарь 26.02.15 начало
				//на случай блокировок, чтобы не цеплять запросом уже отработанные документы
				Константы.ДатаРасчетнойПоследовательностиЦенЗаказовПоставщикам.Установить(Выборка.Регистратор.дата);
				//кухарь 26.02.15 конец
				
			КонецЕсли;
			//нечаева 15,10,14 ---

			
			
			
			
			//	ЗаписатьВЛог("Обработка цен в ЗПС","Проведен ЗПС "+ДокОбъект.Номер + " от "+ДокОбъект.Дата,"Информация");
			
						
			
		КонецЕсли;
	КонецЦикла;
	Константы.ДатаРасчетнойПоследовательностиЦенЗаказовПоставщикам.Установить(ТекущаяДата());
	ПараметрыСеанса.ОтключитьЖурнализациюЗаписи	=Ложь;	
	//	ПараметрыСеанса.ОтключитьКонтрольДЗР		=Ложь;
	ПараметрыСеанса.ОтключитьКонтрольРезервов	=Ложь;
	ЗаписатьВЛог("Обработка цен в ЗПС","Обработка успешно завершена","Информация");
	
КонецПроцедуры

Процедура ПересчитатьЦеныВЗПС(ЗПС)
	запрос = Новый Запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ОстаткиТМЦОстатки.Номенклатура,
	|	СУММА(ОстаткиТМЦОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	СУММА(ОстаткиТМЦОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(
	|			&Момент,
	|			Склад = &ТранзСклад
	|				И Номенклатура В (&СписокНом)) КАК ОстаткиТМЦОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиТМЦОстатки.Номенклатура";
	ДокОбъект = ЗПС.ПолучитьОбъект();
	Запрос.УстановитьПараметр("СписокНом",ДокОбъект.Товары.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("ТранзСклад",ДокОбъект.ТранзитныйСклад);
	Запрос.УстановитьПараметр("Момент",новый граница(ДокОбъект.МоментВремени(),видграницы.Исключая));
	
	Тз=запрос.Выполнить().Выгрузить();
	
	для каждого стр из ДокОбъект.товары цикл
		ТекСтр=тз.Найти(стр.номенклатура,"Номенклатура");
		Если ТекСтр=НЕОПРЕДЕЛЕНО тогда
			//	 сообщить("Не найдена цена для "+стр.Номенклатура);
			продолжить;
		Конецесли;	 
		если текстр.Количествоостаток=0 тогда
			//	 сообщить("0 количестводля "+стр.Номенклатура);
			продолжить;
		Конецесли;	 
		
		Цена=текстр.Суммаостаток/текстр.Количествоостаток;
		стр.цена=Цена;
		стр.ЦенаБезСкидки=стр.Цена;
		стр.сумма=стр.количество*стр.цена;
		стр.Всего=стр.Сумма;
		//крохин начало 30.04.2013
		//расчетные цены тоже заполняем, иначе без машины в ЗПС они не пересчитываются
		//Катаев+ 07/11/14 При нулевом количестве и цена расчетная должна быть пустой
		//стр.РасчетнаяЦена =стр.цена;
		Если стр.Количество = 0 Тогда
			стр.РасчетнаяЦена =0;
		Иначе
			стр.РасчетнаяЦена =стр.цена;
		КонецЕсли;
		//Катаев- 07/11/14
		стр.РасчетнаяСумма = стр.Сумма;
		//крохин конец 30.04.2013
		стр.СтавкаНДС=стр.Номенклатура.Родитель.СтавкаНДС;
		стр.Заявка=стр.Количество;
		стр.ПодтвержденнаяЗаявка=стр.Количество;
		РассчитатьСуммуТабЧасти(стр, ДокОбъект);
		
	Конеццикла;
	ДокОбъект.ЦеныПересчитаны = Истина;
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	ЗаписатьВЛог("Обработка цен в ЗПС","Пересчитаны цены в ЗПС "+ДокОбъект.Номер + " от "+ДокОбъект.Дата,"Информация");
	
	
КонецПроцедуры