


#Область Выгрузкаb2b

	//шпаргалка по вызову 	

	//ПараметрДляОбмена = планыобмена.ОбменССайтомТоварами.НайтиПоКоду("B2B").НомерОтправленного;
	//ТипФайла = "Offers-"+СокрЛП(Строка(ПараметрДляОБмена));
	//Успех = ПроцедурыОбменаССайтом.ПроверитьЗагрузкуФайлаНаСайте(СтруктураПараметровСайта,ТипФайла);

Функция   ПроверитьЗагрузкуФайлаНаСайте(СтруктураПараметровСайта,ТипФайла) Экспорт

	Успешно = Истина;
	
	команда = "local/crons/notify/import_status.php?import_id="+ТипФайла;   //"Offers-22"; 
	ПутьКФайлу = КомандаЗагрузки(СтруктураПараметровСайта,команда);
	
	Успешно = ПрочитатьФайлXMLПоследовательно(ПутьКФайлу);
		 
	Возврат Успешно;
	
КонецФункции


Функция ПостроитьПуть(СтекИмен)
    Путь = "";
    
    Для Каждого Имя Из СтекИмен Цикл
        Путь = Путь + "/" + Имя;
    КонецЦикла;
    
    Возврат Путь;
КонецФункции


Функция ПрочитатьФайлXMLПоследовательно(ПутьКФайлу)
    // Этот способ подойдёт для очень больших файлов,
 
    Парсер = Новый ЧтениеXML;
    Парсер.ОткрытьФайл(ПутьКФайлу);
	
	СписокОшибок = Новый Массив;
	
    СтекИмен = Новый СписокЗначений;
    
 	ЗагрузкаСОшибкой = ложь;
 
       Пока Парсер.Прочитать() Цикл
        Если Парсер.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
            СтекИмен.Добавить(Парсер.Имя);
            ПолныйПуть = ПостроитьПуть(СтекИмен);
 
            Если ПолныйПуть = "/Результат/Заказ/ИдЗаказа" Тогда
                //ИДЗаказа = Парсер.ЗначениеАтрибута("ИдЗаказа"); // если внутри есть атирибуты, то так.
				
				Парсер.Прочитать();
                Если Парсер.ТипУзла = ТипУзлаXML.Текст Тогда
                    //Сообщить("ИДЗаказа:");
                    //Сообщить(Парсер.Значение);
                КонецЕсли;
				ИДЗаказа = Парсер.Значение;
				
				
			ИначеЕсли ПолныйПуть = "/Результат/Заказ/Статус/Название" Тогда
				
				Парсер.Прочитать();
               	Название = Парсер.Значение;
				Если Название = "Ошибка" Тогда
					ЗагрузкаСОшибкой = истина;
				КонецЕсли;	
							
            ИначеЕсли ПолныйПуть = "/Результат/Заказ/Ошибки/Ошибка" Тогда
				
				Парсер.Прочитать();
               	Название = Парсер.Значение;
			    Если Название <> Неопределено Тогда
                    //Сообщить(" " + Название);
					СписокОшибок.Добавить(Название);
                КонецЕсли;
            КонецЕсли;
        ИначеЕсли Парсер.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
            СтекИмен.Удалить(СтекИмен.Количество() - 1);
        КонецЕсли;

		
    КонецЦикла;
  
    Парсер.Закрыть();

	// отправить письмо, если ошибки
	
	Если ЗагрузкаСОшибкой ТОгда
		
		СообщитьОшибки(ИДЗаказа,СписокОшибок);
		СписокОшибок.Очистить();
		
	КонецЕсли;	
	
	
	возврат НЕ ЗагрузкаСОшибкой;
	
	
КонецФункции


Процедура СообщитьОшибки(ИмяФайла,СписокОшибок) Экспорт
		
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);		 

	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	//------------------------------------------------
	// сообщение о ошибках
	//------------------------------------------------
	сообщениеКрит=новый интернетПочтовоеСообщение;
	СообщениеКрит.Получатели.Добавить("nechaeva@collant.ru");
	//СообщениеКрит.Получатели.Добавить("nikolaev@collant.ru");
	//СообщениеКрит.Получатели.Добавить("krohin@collant.ru");
	
	
	//Выборка = регистрыСведений.Емайл_КритОшибки.Выбрать();
	//Пока  Выборка.Следующий() Цикл
	//	СообщениеКрит.Получатели.Добавить(Выборка.емайл);
	//КонецЦикла;
	//Если СообщениеКрит.Получатели.Количество() = 0 Тогда
	//	СообщениеКрит.Получатели.Добавить("nechaeva@collant.ru");
	//КонецЕсли;
	
	
	сообщениеКрит.Отправитель="ecode@collant.ru";
	СообщениеКрит.Тема="Автообмен b2b. Ошибка загрузки "+ИмяФайла;
	Строка="Добрый день!!!"+Символ(13);
	НомСтр=1;
	Если НЕ СписокОшибок=Неопределено и СписокОшибок.Количество()>0 Тогда
		Для рр=0 по СписокОшибок.Количество()-1 Цикл
			Строка=Строка+Символ(13)+НомСтр+". "+СписокОшибок[рр];
			Строка=Строка+Символ(13);
			НомСтр=НомСтр+1;
		КонецЦикла;
	КонецЕсли;
	
	Строка=Строка+Символ(13)+"________________________________________________________________";
	//-----------------------------------------
	СообщениеКрит.Тексты.Добавить(Строка);
	
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
		почта.Послать(СообщениеКрит);
		Почта.Отключиться();
	исключение
		//ЗаписатьВЛог("екод","Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки(),"Информация");
	конецПопытки;
	
КонецПроцедуры


Процедура СообщитьПользователю(ТекстСообщения, ИнформацияОВыгрузке, Статус = Неопределено)
	
	
	#Если Клиент Тогда
		Если Статус = Неопределено Тогда
			Статус = СтатусСообщения.Обычное;	
		КонецЕсли;
		Сообщить(ТекстСообщения, Статус);
	#Иначе
		ЗаписатьВЛог("ОбменССайтом",ТекстСообщения,"Информация");                     
	#КонецЕсли
	
КонецПроцедуры	


Функция КомандаЗагрузки(СтруктураПараметровСайта, команда)

	ОтветСервера = Неопределено;
	ИмяФайлаОтвета = ПолучитьИмяВременногоФайла();
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".txt");
	
	АдресТ = "www.collant.ru" ;   
	попытка 
		Соединение = Новый HTTPСоединение(АдресТ,443,СтруктураПараметровСайта.ИмяПользователя,СтруктураПараметровСайта.Пароль,,,Новый ЗащищенноеСоединениеOpenSSL);  // логин  пароль сюда пропсиать
	исключение
		//Сообщить(ОписаниеОшибки());
	конецПопытки;
		
	//команда = "local/crons/import/catalog.php?";   
		
	HTTPзапрос = новый HTTPзапрос();
	HTTPзапрос.АдресРесурса = Команда;
	
	// формируем файл для отправки
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".xml");
		
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json");
	ЗаголовокHTTP.Вставить("Accept", "text/xml");
	ЗаголовокHTTP.Вставить("Accept-Language", "ru");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("Content-Language", "ru");
	ЗаголовокHTTP.Вставить("Content-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("Host", "www.collant.ru");
	
	HTTPзапрос.Заголовки = ЗаголовокHTTP;

	//Ответ = Соединение.Получить(HTTP_запрос);  // ИмяВыходногоФайла
	
	попытка
		Соединение.Получить(HTTPзапрос, ИмяВременногоФайла);   
	исключение
		СообщитьПользователю("Ошибка отправки Файла по количеству товаров. "+ОписаниеОшибки(),истина);
	конецПопытки;
		
	ФайлОтвета = Новый Файл(ИмяВременногоФайла);
	ОтветСервера = неопределено;
	
	Если ФайлОтвета.Существует() Тогда
		
		//ТекстОтвета = Новый ТекстовыйДокумент();
		//ТекстОтвета.Прочитать(ИмяВременногоФайла);
		//Если ТекстОтвета.КоличествоСтрок()>0 Тогда
		//	ОтветСервера = ТекстОтвета.ПолучитьТекст();	
		//Иначе
		//	// если пустой ответ, то все прогрузилось
		//	СообщитьПользователю(ОтветСервера,истина);
		//КонецЕсли;	
		
	Иначе	
		СообщитьПользователю("Отправка файла на сервер: Ответ сервера не получен.", Истина); 
	КонецЕсли;	
	//сообщитьПользователю(ОтветСервера);
	//
	//
	//Попытка
	//	УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайлаОтвета);   
	//Исключение
	//КонецПопытки;

	возврат ИмяВременногоФайла;	
	

конецФункции


//-------------------------------------
Процедура ОчиститьЗаписиВРегистреСведенийСОтбором(ИмяРегистра,Дата) Экспорт 
	
	НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Дата.Установить(Дата);
	НаборЗаписей.Записать();    
КонецПроцедуры


Процедура ОтборИОчисткаРегистраСведений(ИмяРегистра) Экспорт 
		
	//имя = "ЛогиОбменаССайтомb2bЦены";
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛогиОбменаССайтомb2b.Дата КАК ДатаО
	               |ИЗ
	               |	РегистрСведений."+ИмяРегистра+" КАК ЛогиОбменаССайтомb2b
	               |ГДЕ
	               |	ЛогиОбменаССайтомb2b.Дата <= &ДатаОчистки";
	
	Запрос.УстановитьПараметр("ДатаОчистки",(НачалоДня(ТекущаяДата())-7*24*60*60));
	Рез = запрос.Выполнить().Выбрать();
	
	
	Пока рез.Следующий() цикл
		
		ОчиститьЗаписиВРегистреСведенийСОтбором(ИмяРегистра,рез.ДатаО);

	КонецЦикла;

	
КонецПроцедуры


//нечаева 020323 для новой копии б2б тест2 +++
процедура СкопироватьНаFTP2(ИмяФайла,КраткоеИмя,ИмяПапкиНаСервере="catalog") экспорт
	//----------------------------------------------
	//	 переносим автоматом на их фтп - сервер
	//----------------------------------------------
	Если НЕ ПроверитьСуществованиеФайла(ИмяФайла) ТОгда
		возврат;
	КонецЕсли;	
	Попытка
		//Сервер=Новый FTPСоединение("80.78.249.244:22",,"serptop","cruelty-INNING-sphinx"); 
		//Сервер=Новый FTPСоединение("80.78.249.244",,"collant-1c","3A4m7R0y"); 
		//Сервер=Новый FTPСоединение("212.109.217.46",,"1c_collant","pB4lB6fK5hxC5b"); 
		
		// с 31,10,2022 нечаева
		//Сервер=Новый FTPСоединение("79.143.72.73",,"1c_collant","pB4lB6fK5hxC5b");
		Сервер=Новый FTPСоединение("212.109.217.46",,"1c_collant","wK3lU5uP0h");
		
	Исключение
		ЗаписатьВЛог("b2b","Файл не передан на ФТП /"+ИмяПапкиНаСервере+"/"+КраткоеИмя+ОписаниеОшибки(),,,);

	
		Возврат;
	КонецПопытки;
	
	Попытка
		Сервер.Записать(ИмяФайла,"/"+ИмяПапкиНаСервере+"/"+КраткоеИмя);
		ЗаписатьВЛог("b2b","передан на ФТП /"+ИмяПапкиНаСервере+"/"+КраткоеИмя,,,);

	Исключение
		ЗаписатьВЛог("b2b","Файл не передан на ФТП /"+ИмяПапкиНаСервере+"/"+КраткоеИмя+ОписаниеОшибки(),,,);

	КонецПопытки;
		
	Сервер=Неопределено;
		
	//Сообщить("файл "+КраткоеИмя+ " выгружен на фтп");		
КонецПроцедуры


//  нечаева 17,04,23+++
Функция ЗаменитьТочку(ИсхЧисло,КолПослеЗапятой) Экспорт
	
	//Катаев+ 19/12/14
	//СтрокаЧ=Формат(ИсхЧисло,"ЧДЦ="+КолПослеЗапятой+"");
	СтрокаЧ=Формат(ИсхЧисло,"ЧДЦ="+КолПослеЗапятой+"; ЧН=");
	//Катаев- 19/12/14
	СтрокаЧ=Строка(СтрокаЧ);
	СтрокаЧ= СтрЗаменить(СтрокаЧ,",",".");
	
	Возврат СтрокаЧ;
	
КонецФункции



#КонецОбласти




//////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РЕГИСТРАЦИИ ИЗМЕНЕНИЙ ПО ПЛАНУ ОБМЕНА

//нечаева 12,12,2022+++
 Функция ПроверитьСуществованиеФайла(ЛокПолноеИмяФайла) Экспорт
	ВыбФайл = Новый Файл(ЛокПолноеИмяФайла);		
	Возврат ВыбФайл.Существует();
КонецФункции   
//нечаева 12,12,2022---

//нечаева 31102022 +++
процедура СкопироватьНаFTP(ИмяФайла,КраткоеИмя,ИмяПапкиНаСервере="catalog",Адрес="",Логин="",Пароль="",ИмяЛога="b2b") экспорт
	//----------------------------------------------
	//	 переносим автоматом на их фтп - сервер
	//----------------------------------------------
	Если НЕ ПроверитьСуществованиеФайла(ИмяФайла) ТОгда
		возврат;
	КонецЕсли;	
	
	Если Адрес="" и Логин="" и Пароль="" ТОгда
		// стильпарк?
		//++Данилова Е.В. 23.10.2024
		//Адрес="185.195.144.104";
		Адрес="www.collant.ru";
		//--Данилова Е.В. 23.10.2024
		// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
		//Логин="*%*%*%";
		//Пароль="*$*$*$";
		Логин = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
			Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКFTPНаСайтеCollant).Логин;
		Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
			Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКFTPНаСайтеCollant).Пароль;
		// Ихсанов Д. А. Конец  14.10.2025
		
	КонецЕсли;	
		
	Попытка
		//нечаева19,01,23 ++
		Сервер=Новый FTPСоединение(Адрес,,Логин,Пароль);
		//нечаева19,01,23--
	Исключение
		ЗаписатьВЛог(ИмяЛога,"Файл не передан на ФТП /"+ИмяПапкиНаСервере+"/"+КраткоеИмя+ОписаниеОшибки(),,,);

		Возврат;
	КонецПопытки;
	Если ИмяЛога="миними" тогда
		// для миними нет корневой папки, пока так, для теста
		Попытка
			Сервер.Записать(ИмяФайла,"/"+КраткоеИмя);
			ЗаписатьВЛог(ИмяЛога,"передан на ФТП /"+КраткоеИмя,,,);
			
		Исключение
			ЗаписатьВЛог(ИмяЛога,"Файл не передан на ФТП /"+КраткоеИмя+ОписаниеОшибки(),,,);
			
		КонецПопытки;
	иначе	
		Попытка
			Сервер.Записать(ИмяФайла,"/"+ИмяПапкиНаСервере+"/"+КраткоеИмя);
			ЗаписатьВЛог(ИмяЛога,"передан на ФТП /"+ИмяПапкиНаСервере+"/"+КраткоеИмя,,,);
			
		Исключение
			ЗаписатьВЛог(ИмяЛога,"Файл не передан на ФТП /"+ИмяПапкиНаСервере+"/"+КраткоеИмя+ОписаниеОшибки(),,,);
			
		КонецПопытки;
	КонецЕсли;
		
	Сервер=Неопределено;
		
	//Сообщить("файл "+КраткоеИмя+ " выгружен на фтп");		
КонецПроцедуры

// Кухарь А.Ю. 19.05.2023 начало
//
Функция СоздатьКаталогНаFTP(ИмяПапкиНаСервере, СтруктураСоединения = Неопределено) Экспорт
	
	Если СтруктураСоединения = Неопределено Тогда
		//++Данилова Е.В. 23.10.2024
		//СтруктураСоединения = Новый Структура("Адрес, Логин, Пароль", "185.195.144.104", "*%*%*%", "*$*$*$");
		// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
		//СтруктураСоединения = Новый Структура("Адрес, Логин, Пароль", "www.collant.ru","*%*%*%", "*$*$*$");
		СтруктураСоединения = Новый Структура("Адрес, Логин, Пароль", "www.collant.ru",
			РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
				Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКFTPНаСайтеCollant).Логин,
			РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
				Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКFTPНаСайтеCollant).Пароль);
		// Ихсанов Д. А. Конец  14.10.2025
		//--Данилова Е.В. 23.10.2024
	КонецЕсли;
	
	// Смирнов МЮ 14.05.2025 HELP-4368 Начало
	Попытка
		Сервер = Новый FTPСоединение(
			СтруктураСоединения.Адрес,
			, 
			СтруктураСоединения.Логин, 
			СтруктураСоединения.Пароль,
			, 
			Истина,
			60
		);
	Исключение
		ЗаписатьВЛог("b2b","Файл не создан на ФТП /"+ИмяПапкиНаСервере+ОписаниеОшибки(),,,);
		Сервер = Неопределено;
		Возврат Ложь;
	КонецПопытки;
	
	ЕстьКаталог=Истина;
	
	Для НомерПопытки = 1 По 3 Цикл
		Попытка
			Сервер.УстановитьТекущийКаталог(ИмяПапкиНаСервере);
			Сервер=Неопределено;
			Возврат Истина;
		Исключение
			ТекстСообщения = СтрШаблон(
				"Каталог не установлен на ФТП / %1 / %2. Попытка %3", 
				ИмяПапкиНаСервере, 
				ОписаниеОшибки(),
				НомерПопытки
			);
			ЗаписатьВЛог("b2b", ТекстСообщения,,,);	
		КонецПопытки;
	КонецЦикла;
	// Смирнов МЮ 14.05.2025 HELP-4368 Конец
	
	//++Данилова Е.В. 18.11.2024
	//Попытка
	//	Сервер.СоздатьКаталог(ИмяПапкиНаСервере);
	//	ЗаписатьВЛог("b2b","Каталог создан на ФТП /"+ИмяПапкиНаСервере,,,);
	//Исключение
	//	ЗаписатьВЛог("b2b","Каталог не создан на ФТП /"+ИмяПапкиНаСервере+"/"+ОписаниеОшибки(),,,);
	//	Сервер=Неопределено;
	//	возврат ложь;
	//КонецПопытки;
	КаталогСоздан = Ложь; 
	Для НомерПопытки = 1 По 3 Цикл
		Попытка
			Сервер.СоздатьКаталог(ИмяПапкиНаСервере);
			ЗаписатьВЛог("b2b","Каталог создан на ФТП /"+ИмяПапкиНаСервере,,,);
			КаталогСоздан = истина; 
			Прервать; 
		Исключение
			ЗаписатьВЛог("b2b","Каталог не создан на ФТП /"+ИмяПапкиНаСервере+"/"+ОписаниеОшибки() + " Попытка " + Строка(НомерПопытки),,,);
			Продолжить; 
		КонецПопытки; 
	КонецЦикла;
	Если НЕ КаталогСоздан Тогда
		
		Сервер=Неопределено; 	
		возврат ложь; 
		
	КонецЕсли;
	//--Данилова Е.В. 18.11.2024
	
	
	Сервер=Неопределено;
	Возврат Истина;

КонецФункции 
// Кухарь А.Ю. 19.05.2023 конец

//нечаева 0606,2022
Функция УбратьНулиПередКодом(Номер) Экспорт
	// убираем лидирующие нули	
	Ном=Номер;
	Для НН=1 по СтрДлина(Ном) Цикл
		Проверка=Лев(Ном,1);
		Если Проверка="0" Тогда
			Ном=Прав(Ном,СтрДлина(Ном)-1);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ном;
	
КонецФункции
//нечаева 06062022--


// нечаева 10,10,23+++

//--------------------------------------------------------------------------------------------------------------
//для монобрендовых выгрузка товаров, сайты одинаковые, изменения активности узлов.
Функция РегистрироватьИзмененияУзловДляМонобрендовыхСайтов(Ссылка,Объект) Экспорт
	
	//Выгружать =неопределено;	
	//возврат ложь; // временно не регистрируем
	
	
	//----------------------------------------------------------------
	//сначала смену активности, для монобрендовых сайтов, потом остальные. основное это снятие активности!!!!
	//  - таб. части  проверка через "ЗначениеВСтрокуВнутренняя"
		Выгружать = ложь;	
	
	//----------------------------------------------------------------
	//сначала смену активности, для монобрендовых сайтов, потом остальные. основное это снятие активности!!!!
	//  - таб. части  проверка через "ЗначениеВСтрокуВнутренняя"
	ТабличныеРеквизиты	=Новый Структура("ПолучателиИзмененийНоменклатуры");
	СменаАктивМонобренд = ложь;
	Для Каждого Реквизит Из ТабличныеРеквизиты Цикл
		
		Попытка
			Тз1=Ссылка[Реквизит.Ключ].Выгрузить();
			Тз2=Объект[Реквизит.Ключ].Выгрузить();
			Если ЗначениеВСтрокуВнутр(Тз1)<>ЗначениеВСтрокуВнутр(Тз2) Тогда
				Выгружать=Истина;
				СменаАктивМонобренд = истина;
			КонецЕсли;		
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	Если выгружать =ложь Тогда 
		возврат ложь;
	КонецЕсли;	
	
	
	ТаблицаНовая=новый ТаблицаЗначений;
	ТаблицаНовая.Колонки.Добавить("УзелОбмена", Новый ОписаниеТипов("ПланОбменаСсылка.ОбменССайтомТоварами"));
	ТаблицаНовая.Колонки.Добавить("Активность", Новый ОписаниеТипов("ПеречислениеСсылка.ВыгружатьНаСайт"));
	ТаблицаНовая2=новый ТаблицаЗначений;
	ТаблицаНовая2.Колонки.Добавить("УзелОбмена", Новый ОписаниеТипов("ПланОбменаСсылка.ОбменССайтомТоварами"));
	ТаблицаНовая2.Колонки.Добавить("Активность", Новый ОписаниеТипов("ПеречислениеСсылка.ВыгружатьНаСайт"));

	
	
	ТаблицаНовая = Ссылка.ПолучателиИзмененийНоменклатуры.выгрузить();
	ТаблицаНовая2 = Объект.ПолучателиИзмененийНоменклатуры.выгрузить();
	
	
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	             |	ТНов.УзелОбмена КАК УзелОбмена,
	             |	ТНов.Активность КАК Активность
	             |ПОМЕСТИТЬ ТНов
	             |ИЗ
	             |	&ТаблицаНовое КАК ТНов
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ТНов2.УзелОбмена КАК УзелОбмена,
	             |	ТНов2.Активность КАК Активность
	             |ПОМЕСТИТЬ ТНов2
	             |ИЗ
	             |	&ТаблицаНовое2 КАК ТНов2
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ 
	             |	ТНов1.УзелОбмена КАК УзелОбмена,
	             |	ТНов1.Активность КАК Активность,
	             |	1 КАК Сумма
	             |ИЗ
	             |	ТНов КАК ТНов1
	             |
	             |ОБЪЕДИНИТЬ ВСЕ
	             |
	             |ВЫБРАТЬ
	             |	ТНов2.УзелОбмена,
	             |	ТНов2.Активность,
	             |	1
	             |ИЗ
	             |	ТНов2 КАК ТНов2 ";
	запрос.УстановитьПараметр("ТаблицаНовое",ТаблицаНовая);       // выбрать различные.
	
	запрос.УстановитьПараметр("ТаблицаНовое2",ТаблицаНовая2);

	ТЗОбщая=запрос.Выполнить().Выгрузить();
	ТЗОбщая.свернуть("УзелОбмена,Активность","Сумма");
	пп=1;
	//********
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	             |	ТНов.УзелОбмена КАК УзелОбмена,
	             |	ТНов.Активность КАК Активность,
	             |	ТНов.Сумма КАК Сумма
	             |ПОМЕСТИТЬ ТНов
	             |ИЗ
	             |	&ТаблицаНовое КАК ТНов
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ различные
	             |	ТНов1.УзелОбмена КАК УзелОбмена,
	             |	ТНов1.Активность КАК Активность,
	             |	ТНов1.Сумма КАК сумма
	             |ИЗ
	             |	ТНов КАК ТНов1
	             |ГДЕ
	             |	ТНов1.Сумма = 1";
	запрос.УстановитьПараметр("ТаблицаНовое",ТЗОбщая);       // выбрать различные.

	СписокУзловСИзменениями =запрос.Выполнить().Выгрузить();
	СписокУзловСИзменениями.свернуть("УзелОбмена");
	МассивУзлов = СписокУзловСИзменениями.ВыгрузитьКолонку("УзелОбмена");
	
	//--------------------------------------------------------------------------------------------	
	
	Если Не ПараметрыСеанса.НаличиеОбменаССайтом Тогда
		Возврат ложь;
	КонецЕсли;
	// только для центральной базы!!!
	Если СменаАктивМонобренд и СписокУзловСИзменениями.Количество()>0 Тогда		
			
			Попытка
				ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Объект);
			Исключение
				сообщить(ОписаниеОшибки());
			конецПопытки;
	КонецЕсли;
	

	Возврат Выгружать;
	

	
КонецФункции

//для монобрендовых -  выгрузка товаров, сайты одинаковые, изменения самих товаров.
Функция РегистрироватьИзмененияНоменклатурыДляМонобрендовыхСайтов(Ссылка,Объект) Экспорт
		
	//-----------------------------------------------------------------
	// считаем, что активные узлы есть, и тут выгружаем изменения, только для активных.	
	// для номенклатуры
	Выгружать=Ложь;  
	Если Объект.модифицированность() ТОгда
		выгружать = истина;
	КонецЕсли;
	
	Возврат выгружать;
	
	//-------------------------------------------
	//// очень много переменных для выгрузки, почти все, в отличие от б2б и стильпарка, нет смысла проверять по элементно.  и товаров гораздо меньше, в монорендовых.
	//// внизу не все перечислены
	// было :
	
	//Выгружать=Ложь;                                                               
	//ГрупповыеРеквизиты	=Новый Структура("Цвет,Размер,ЦветИМ,СтавкаНДС,Наименование,Состав,ПоловозрастнойПризнак,Родитель,"+
	//"ВыгружатьВИнтернетМагазин,ПоловозрастнойПризнак,КатегорияИспользованияДляСайта,ТипТовараДляСайта,ЖизненныйЦиклНоменклатуры,ФР_ГруппаТоваров,ФР_ВидНоменклатуры,ФР_Пол,ФР_Бренд,ФР_Коллекция,ФР_Размер,"+
	//"БрендДляСайта,КоллекцияДляСайта,ОписаниеТовараДляСайта,РазмерДляСайта,ПодТипТовараДляСайта,НазваниеТовараДляСайта,Ведущий,ШтукВКоробочке,ШтукВКоробке");

	//
	//// проверяем есть ли изменения.
	//Для Каждого Реквизит Из ГрупповыеРеквизиты Цикл
	//	Попытка
	//		Если ссылка[Реквизит.Ключ]<>Объект[Реквизит.Ключ] Тогда
	//			Выгружать=Истина;
	//			Возврат Выгружать;

	//		КонецЕсли;		
	//	Исключение
	//	КонецПопытки;
	//	
	//КонецЦикла;	
	//
	//// СоставНоменклатуры, ПодТипыТовараДляСайта  - таб. части  проверка через "ЗначениеВСтрокуВнутренняя"
	//ТабличныеРеквизиты	=Новый Структура("СоставНоменклатуры,ПодТипыНоменклатурыДляСайта,ЗначкиДляЯрлыка,ЗначкиДляУпаковкиПроизводителя");
	//
	//Для Каждого Реквизит Из ТабличныеРеквизиты Цикл
	//	
	//	Попытка
	//		Тз1=Ссылка[Реквизит.Ключ].Выгрузить();
	//		Тз2=Объект[Реквизит.Ключ].Выгрузить();
	//		Если ЗначениеВСтрокуВнутр(Тз1)<>ЗначениеВСтрокуВнутр(Тз2) Тогда
	//			Выгружать=Истина;
	//			Возврат Выгружать;

	//		КонецЕсли;		
	//	Исключение
	//	КонецПопытки;
	//	
	//КонецЦикла;	
	//
	//Возврат Выгружать;
	
КонецФункции


// нечаева 05,10,23++++
Функция ПолучитьСписокУзловМонобрендовыхСайтов(ТекСсылка,ТолькоАктивныеУзлы=Истина) Экспорт
	
	// на активность уже не смотрим, если по изменению табличной части, иначе если поменялось на неактивность, то не снимется активность на сайте
	Если НЕ текссылка.ЭтоГруппа Тогда
		Модель = Модель = ТекССылка.Родитель.ссылка;;
	иначе
		модель = текссылка.Ссылка;
	КонецЕсли;
	
	Если ТолькоАктивныеУзлы Тогда
		ПеременнаяОбмена = "НоменклатураПолучателиИзмененийНоменклатуры.Активность = &активна и";
	иначе
		ПеременнаяОбмена = "";
	конецЕсли;
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НоменклатураПолучателиИзмененийНоменклатуры.узелОбмена КАК узелОбмена
				   |ИЗ
	               |	Справочник.Номенклатура.ПолучателиИзмененийНоменклатуры КАК НоменклатураПолучателиИзмененийНоменклатуры
	               |ГДЕ
	               |	  "+ПеременнаяОбмена+"
				   |	 НоменклатураПолучателиИзмененийНоменклатуры.Ссылка = &тексылка";
	Запрос.УстановитьПараметр("Активна",перечисления.ВыгружатьНаСайт.Да);
	Запрос.УстановитьПараметр("тексылка",Модель);
	
	Рез = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("узелОбмена");;
	
	возврат Рез;
	
	
КонецФункции	


Процедура ЗарегистрироватьИзмененияМонобрСайтов(Объект, МассивУзлов =неопределено)  Экспорт
	
	//-------------------- временно, пока не нужны регистрации!!!
	//возврат;
	//---------------
	Если Не ПараметрыСеанса.НаличиеОбменаССайтом Тогда
		Возврат;
	КонецЕсли;
	// только для центральной базы!!!
			
	ТипОбъекта = ТипЗнч(Объект);
	ТипОбъектаДокумент = Метаданные.Документы.Содержит(Объект.Метаданные());
	
	// Номенклатура и картинки
	Если  ТипОбъекта = Тип("СправочникСсылка.Номенклатура") Тогда 
		  
		МассивУзлов = ПолучитьСписокУзловМонобрендовыхСайтов(Объект.Ссылка,истина);
 
		Попытка
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Объект);
		Исключение 
		конецПопытки;
		
	КонецЕсли;		
		
КонецПроцедуры	

//--------------------------------------------------------------------------------------------------------------
// нечаева 10,10,23--


//нечаева 29,08,22++
Функция ВыгружатьНаСайтСтильпарк(Номенклатура) Экспорт
	
	ВыгружатьНаСайт = "Нет";
	Запрос = новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ном.Ссылка КАК Ссылка,
	             |	ном.Код КАК Код,
	             |	ВЫБОР
	             |		КОГДА ном.ВыгружатьНаСайтСтильпарк.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |			ТОГДА ""Да""
	             |		КОГДА ном.ВыгружатьНаСайтСтильпарк.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |			ТОГДА ""Нет""
	             |		ИНАЧЕ ВЫБОР
	             |				КОГДА ном.Родитель.ВыгружатьНаСайтСтильпарк.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |					ТОГДА ""Да""
	             |				КОГДА ном.Родитель.ВыгружатьНаСайтСтильпарк.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |					ТОГДА ""Нет""
	             |				ИНАЧЕ ВЫБОР
	             |						КОГДА ном.Родитель.Родитель.ВыгружатьНаСайтСтильпарк.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |							ТОГДА ""Да""
	             |						КОГДА ном.Родитель.Родитель.ВыгружатьНаСайтСтильпарк.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |							ТОГДА ""Нет""
	             |						ИНАЧЕ ВЫБОР
	             |								КОГДА ном.Родитель.Родитель.Родитель.ВыгружатьНаСайтСтильпарк.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |									ТОГДА ""Да""
	             |								КОГДА ном.Родитель.Родитель.Родитель.ВыгружатьНаСайтСтильпарк.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |									ТОГДА ""Нет""
	             |								ИНАЧЕ ВЫБОР
	             |										КОГДА ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьНаСайтСтильпарк.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |											ТОГДА ""Да""
	             |										КОГДА ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьНаСайтСтильпарк.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |											ТОГДА ""Нет""
	             |										ИНАЧЕ ""Нет""
	             |									КОНЕЦ
	             |							КОНЕЦ
	             |					КОНЕЦ
	             |			КОНЕЦ
	             |	КОНЕЦ КАК ВыгружатьНаСайт
				 |ИЗ
	             |	Справочник.Номенклатура КАК ном
	             |ГДЕ
	             |	ном.Родитель.Родитель.Родитель <> &Пустая
	             |	И ном.ПометкаУдаления = ЛОЖЬ
	             |	И ном.Ссылка В ИЕРАРХИИ(&текгруппа)
	             |	И ВЫБОР
	             |			КОГДА ном.ВыгружатьНаСайтСтильпарк.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |				ТОГДА ""Да""
	             |			КОГДА ном.ВыгружатьНаСайтСтильпарк.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |				ТОГДА ""Нет""
	             |			ИНАЧЕ ВЫБОР
	             |					КОГДА ном.Родитель.ВыгружатьНаСайтСтильпарк.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |						ТОГДА ""Да""
	             |					КОГДА ном.Родитель.ВыгружатьНаСайтСтильпарк.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |						ТОГДА ""Нет""
	             |					ИНАЧЕ ВЫБОР
	             |							КОГДА ном.Родитель.Родитель.ВыгружатьНаСайтСтильпарк.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |								ТОГДА ""Да""
	             |							КОГДА ном.Родитель.Родитель.ВыгружатьНаСайтСтильпарк.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |								ТОГДА ""Нет""
	             |							ИНАЧЕ ВЫБОР
	             |									КОГДА ном.Родитель.Родитель.Родитель.ВыгружатьНаСайтСтильпарк.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |										ТОГДА ""Да""
	             |									КОГДА ном.Родитель.Родитель.Родитель.ВыгружатьНаСайтСтильпарк.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |										ТОГДА ""Нет""
	             |									ИНАЧЕ ВЫБОР
	             |											КОГДА ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьНаСайтСтильпарк.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |												ТОГДА ""Да""
	             |											КОГДА ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьНаСайтСтильпарк.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |												ТОГДА ""Нет""
	             |											ИНАЧЕ ""Нет""
	             |										КОНЕЦ
	             |								КОНЕЦ
	             |						КОНЕЦ
	             |				КОНЕЦ
	             |		КОНЕЦ = ""Да"" ";
	
	
	//нечаева 10,08,22+++  если на цвет-размер, то признак смотрим у родителя.
	Если НЕ номенклатура.этогруппа тогда
		Ном = номенклатура.Родитель.ссылка;
	иначе
		Ном = номенклатура.ссылка;
	конецесли;	
	// нечаева 10,08,22--
	Запрос.УстановитьПараметр("текгруппа",Ном);  //ложь
	Запрос.УстановитьПараметр("Пустая",ложь);  //ложь
	Выборка=Запрос.Выполнить().Выбрать();
	Если выборка.Следующий() Тогда
		
		ВыгружатьНаСайт = выборка.ВыгружатьНаСайт;
		
	КонецЕсли;	
	
	возврат ВыгружатьНаСайт;
	
КонецФункции
// нечаева 29,08,22---

Функция ВыгружатьНаСайт(Номенклатура,ОбменСтильпарк = ложь,Объект=неопределено) Экспорт
	
	// нечаева 25,01,23 +++
	Если Номенклатура = справочники.Номенклатура.ПустаяСсылка() ТОгда
		возврат "нет";
	КонецЕсли;
	// нечаева 25,01,23 ---

	
	Если ОбменСтильпарк ТОгда
		ПеременнаяОбмена = "ВыгружатьНаСайтСтильПарк";
	иначе	
		ПеременнаяОбмена = "ВыгружатьВИнтернетМагазин";  // для б2б магазина
	конецЕсли;
	
	ВыгружатьНаСайт = "Нет";
	Запрос = новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ном.Ссылка КАК Ссылка,
	             |	ном.Код КАК Код,
				 //++Данилова Е.В. 18.10.2024
				 //|	ВЫБОР
				 //|		КОГДА ном."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
				 //|			ТОГДА ""Да""
				 //|		КОГДА ном."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
				 //|			ТОГДА ""Нет""
				 //|		ИНАЧЕ
				 //--Данилова Е.В. 18.10.2024
				 |	ВЫБОР
	             |				КОГДА ном.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |					ТОГДА ""Да""
	             |				КОГДА ном.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |					ТОГДА ""Нет""
	             |				ИНАЧЕ ВЫБОР
	             |						КОГДА ном.Родитель.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |							ТОГДА ""Да""
	             |						КОГДА ном.Родитель.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |							ТОГДА ""Нет""
	             |						ИНАЧЕ ВЫБОР
	             |								КОГДА ном.Родитель.Родитель.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |									ТОГДА ""Да""
	             |								КОГДА ном.Родитель.Родитель.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |									ТОГДА ""Нет""
	             |								ИНАЧЕ ВЫБОР
	             |										КОГДА ном.Родитель.Родитель.Родитель.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |											ТОГДА ""Да""
	             |										КОГДА ном.Родитель.Родитель.Родитель.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |											ТОГДА ""Нет""
	             |										ИНАЧЕ ""Нет""
	             |									КОНЕЦ
	             |							КОНЕЦ
	             |					КОНЕЦ
				 //++Данилова Е.В. 18.10.2024
	            // |			КОНЕЦ
				//--Данилова Е.В. 18.10.2024
	             |	КОНЕЦ КАК ВыгружатьНаСайт
				 |ИЗ
	             |	Справочник.Номенклатура КАК ном
	             |ГДЕ
	             |	ном.Родитель.Родитель.Родитель <> &Пустая
	             |	И ном.ПометкаУдаления = ЛОЖЬ
	             |	И ном.Ссылка В ИЕРАРХИИ(&текгруппа)
	             |	И 
				 //++Данилова Е.В. 18.10.2024
				 //ВЫБОР
				 //|			КОГДА ном."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
				 //|				ТОГДА ""Да""
				 //|			КОГДА ном."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
				 //|				ТОГДА ""Нет""
				 //|			ИНАЧЕ 
				 //--Данилова Е.В. 18.10.2024
				 |	ВЫБОР
	             |					КОГДА ном.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |						ТОГДА ""Да""
	             |					КОГДА ном.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |						ТОГДА ""Нет""
	             |					ИНАЧЕ ВЫБОР
	             |							КОГДА ном.Родитель.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |								ТОГДА ""Да""
	             |							КОГДА ном.Родитель.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |								ТОГДА ""Нет""
	             |							ИНАЧЕ ВЫБОР
	             |									КОГДА ном.Родитель.Родитель.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |										ТОГДА ""Да""
	             |									КОГДА ном.Родитель.Родитель.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |										ТОГДА ""Нет""
	             |									ИНАЧЕ ВЫБОР
	             |											КОГДА ном.Родитель.Родитель.Родитель.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |												ТОГДА ""Да""
	             |											КОГДА ном.Родитель.Родитель.Родитель.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |												ТОГДА ""Нет""
	             |											ИНАЧЕ ""Нет""
	             |										КОНЕЦ
	             |								КОНЕЦ
	             |						КОНЕЦ
				 //++Данилова Е.В. 18.10.2024
	             //|				КОНЕЦ
				 //--Данилова Е.В. 18.10.2024
	             |		КОНЕЦ = ""Да"" ";
	
	
	//нечаева 10,08,22+++  если на цвет-размер, то признак смотрим у родителя.
	Если НЕ номенклатура.этогруппа тогда
		Ном = номенклатура.ссылка.родитель;
	иначе
		Ном = номенклатура.ссылка;
	конецесли;	
	// нечаева 10,08,22--
	Запрос.УстановитьПараметр("текгруппа",Ном);  //ложь
	Запрос.УстановитьПараметр("Пустая",справочники.Номенклатура.ПустаяСсылка());  //ложь
	Выборка=Запрос.Выполнить().Выбрать();
	Если выборка.Следующий() Тогда
		
		ВыгружатьНаСайт = выборка.ВыгружатьНаСайт;
		
	КонецЕсли;	
	
	возврат ВыгружатьНаСайт;
	
	//
	//////////////////////////////////////////
	//Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	//             |	ном.Ссылка КАК Ссылка,
	//             |	ном.Код КАК Код,
	//             |	ВЫБОР
	//             |		КОГДА ном.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	//             |			ТОГДА ""Да""
	//             |		КОГДА ном.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	//             |			ТОГДА ""Нет""
	//             |		ИНАЧЕ ВЫБОР
	//             |				КОГДА ном.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	//             |					ТОГДА ""Да""
	//             |				КОГДА ном.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	//             |					ТОГДА ""Нет""
	//             |				ИНАЧЕ ВЫБОР
	//             |						КОГДА ном.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	//             |							ТОГДА ""Да""
	//             |						КОГДА ном.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	//             |							ТОГДА ""Нет""
	//             |						ИНАЧЕ ВЫБОР
	//             |								КОГДА ном.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	//             |									ТОГДА ""Да""
	//             |								КОГДА ном.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	//             |									ТОГДА ""Нет""
	//             |								ИНАЧЕ ВЫБОР
	//             |										КОГДА ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	//             |											ТОГДА ""Да""
	//             |										КОГДА ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	//             |											ТОГДА ""Нет""
	//             |										ИНАЧЕ ""Нет""
	//             |									КОНЕЦ
	//             |							КОНЕЦ
	//             |					КОНЕЦ
	//             |			КОНЕЦ
	//             |	КОНЕЦ КАК ВыгружатьНаСайт
	//			 |ИЗ
	//             |	Справочник.Номенклатура КАК ном
	//             |ГДЕ
	//             |	ном.Родитель.Родитель.Родитель <> &Пустая
	//             |	И ном.ПометкаУдаления = ЛОЖЬ
	//             |	И ном.Ссылка В ИЕРАРХИИ(&текгруппа)
	//             |	И ВЫБОР
	//             |			КОГДА ном.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	//             |				ТОГДА ""Да""
	//             |			КОГДА ном.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	//             |				ТОГДА ""Нет""
	//             |			ИНАЧЕ ВЫБОР
	//             |					КОГДА ном.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	//             |						ТОГДА ""Да""
	//             |					КОГДА ном.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	//             |						ТОГДА ""Нет""
	//             |					ИНАЧЕ ВЫБОР
	//             |							КОГДА ном.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	//             |								ТОГДА ""Да""
	//             |							КОГДА ном.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	//             |								ТОГДА ""Нет""
	//             |							ИНАЧЕ ВЫБОР
	//             |									КОГДА ном.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	//             |										ТОГДА ""Да""
	//             |									КОГДА ном.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	//             |										ТОГДА ""Нет""
	//             |									ИНАЧЕ ВЫБОР
	//             |											КОГДА ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	//             |												ТОГДА ""Да""
	//             |											КОГДА ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	//             |												ТОГДА ""Нет""
	//             |											ИНАЧЕ ""Нет""
	//             |										КОНЕЦ
	//             |								КОНЕЦ
	//             |						КОНЕЦ
	//             |				КОНЕЦ
	//             |		КОНЕЦ = ""Да"" ";

	
	
	
	
КонецФункции

Функция РегистрироватьИзмененияШКДляСайта(Ссылка,Объект) Экспорт
	
	ВыгружатьНаСайт = ВыгружатьНаСайт(ССылка.владелец);
	
	Если НЕ ВыгружатьНаСайт = "Да"  ТОгда
		
		возврат ложь;
		
	Иначе	
		 возврат истина;
	КонецЕсли;	
	
	//Выгружать=Ложь;
	//ГрупповыеРеквизиты	=Новый Структура("Наименование");
	//
	//
	//// проверяем есть ли изменения.
	//Для Каждого Реквизит Из ГрупповыеРеквизиты Цикл
	//	
	//	Попытка
	//		Если ссылка[Реквизит.Ключ]<>Объект[Реквизит.Ключ] Тогда
	//			Выгружать=Истина;
	//		КонецЕсли;		
	//	Исключение
	//	КонецПопытки;
	//	
	//КонецЦикла;	
	
	
	
	Возврат ВыгружатьНаСайт;
	
КонецФункции

//для сайта б2б , стильпарк -  выгрузка товаров, сайты одинаковые, разные переменные.
Функция РегистрироватьИзмененияНоменклатурыДляСайта(Ссылка,Объект,ОбменСтильпарк) Экспорт
		
	Если ОбменСтильпарк ТОгда
		
		ПризнакВыгрузкиНаСайт = "ВыгружатьНаСайтСтильПарк";
	иначе
		ПризнакВыгрузкиНаСайт = "ВыгружатьВИнтернетМагазин";
		
	КонецЕсли;	
		
	//нечаева25102022 +++
	ВыгружатьНаСайт = ВыгружатьНаСайт(ССылка,ОбменСтильпарк,ОБъект);
	
	//нечаева 26,01,24+++
	// для новых  товаров, у которых у родителя стоит = нет. не записываем.
	Если (ссылка[ПризнакВыгрузкиНаСайт] =перечисления.ВыгружатьНаСайт.ПустаяСсылка() и Объект[ПризнакВыгрузкиНаСайт] = перечисления.ВыгружатьНаСайт.Нет) 
		или 
	    (ссылка.родитель[ПризнакВыгрузкиНаСайт] =перечисления.ВыгружатьНаСайт.ПустаяСсылка() и Объект.родитель[ПризнакВыгрузкиНаСайт] = перечисления.ВыгружатьНаСайт.Нет) 
	Тогда
	    Выгружать=ложь;
		возврат ложь;
	КонецЕсли;
	//нечаева 26,01,24---
	
	ПризнакВыгрузкиИзменен = ложь;
	// если изменилась, сразу на сайт выгружаем
	Если ссылка[ПризнакВыгрузкиНаСайт]<>Объект[ПризнакВыгрузкиНаСайт] 
		или (ссылка.родитель[ПризнакВыгрузкиНаСайт]<>Объект.родитель[ПризнакВыгрузкиНаСайт] и ссылка.этоГруппа=ложь)
		
		Тогда
		Выгружать=Истина;
		ПризнакВыгрузкиИзменен = истина;

		возврат Истина;
	Иначе
		// признак выгрузки не менялся!!!
	КонецЕсли;	

	Если ссылка.ЖизненныйЦиклНоменклатуры<>Объект.ЖизненныйЦиклНоменклатуры  и ВыгружатьНаСайт = "Да"  Тогда
		Выгружать=Истина;
		возврат Истина;
	КонецЕсли;	
	
	// тут признак выгрузки на сайт не меняли, и если нет, то дальше не проверяем
	Если ВыгружатьНаСайт = "Нет" Тогда
		Выгружать=ложь;
		возврат ложь;
	КонецЕсли;	
	
	// для номенклатуры
	Выгружать=Ложь;                                                                                              // нечаева 23,08,24++ ТНВЭД
	ГрупповыеРеквизиты	=Новый Структура("Цвет,Размер,ЦветИМ,СтавкаНДС,Наименование,Состав,ПоловозрастнойПризнак,Родитель,ТНВЭД,ОтгрузкаТолькоЧерезЧЗ,"+
	"ВыгружатьВИнтернетМагазин,ПоловозрастнойПризнак,КатегорияИспользованияДляСайта,ТипТовараДляСайта,ЖизненныйЦиклНоменклатуры,ФР_ГруппаТоваров,ФР_ВидНоменклатуры,ФР_Пол,ФР_Бренд,ФР_Коллекция,ФР_Размер,"+
	"БрендДляСайта,КоллекцияДляСайта,ОписаниеТовараДляСайта,РазмерДляСайта,ПодТипТовараДляСайта,НазваниеТовараДляСайта,Ведущий,ШтукВКоробочке,ШтукВКоробке");

	
	// проверяем есть ли изменения.
	Для Каждого Реквизит Из ГрупповыеРеквизиты Цикл
		Попытка
			Если ссылка[Реквизит.Ключ]<>Объект[Реквизит.Ключ] Тогда
				Выгружать=Истина;
			КонецЕсли;		
		Исключение
		КонецПопытки;
		
	КонецЦикла;	
	
	// СоставНоменклатуры, ПодТипыТовараДляСайта  - таб. части  проверка через "ЗначениеВСтрокуВнутренняя"
	ТабличныеРеквизиты	=Новый Структура("СоставНоменклатуры,ПодТипыНоменклатурыДляСайта");
	
	Для Каждого Реквизит Из ТабличныеРеквизиты Цикл
		
		Попытка
			Тз1=Ссылка[Реквизит.Ключ].Выгрузить();
			Тз2=Объект[Реквизит.Ключ].Выгрузить();
			Если ЗначениеВСтрокуВнутр(Тз1)<>ЗначениеВСтрокуВнутр(Тз2) Тогда
				Выгружать=Истина;
			КонецЕсли;		
		Исключение
		КонецПопытки;
		
	КонецЦикла;	
	
//	Сообщить(" писать изменение в план обмена "+выгружать);

	Возврат Выгружать;
	
КонецФункции

//нечаева 03,04,23++
Процедура РегистрироватьИзмененияГруппыНоменклатурыДляСайта(Источник, ОбменСтильпарк = ложь) Экспорт

	ОбменСтильпарк = ложь;
		
	ВыгружатьНаСайт = "Нет";
	Запрос = новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ном.Ссылка КАК Ссылка,
	             |	ном.Код КАК Код,
	             |	ВЫБОР
	             |		КОГДА ном.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |			ТОГДА ""Да""
	             |		КОГДА ном.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |			ТОГДА ""Нет""
	             |		ИНАЧЕ ВЫБОР
	             |				КОГДА ном.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |					ТОГДА ""Да""
	             |				КОГДА ном.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |					ТОГДА ""Нет""
	             |				ИНАЧЕ ВЫБОР
	             |						КОГДА ном.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |							ТОГДА ""Да""
	             |						КОГДА ном.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |							ТОГДА ""Нет""
	             |						ИНАЧЕ ВЫБОР
	             |								КОГДА ном.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |									ТОГДА ""Да""
	             |								КОГДА ном.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |									ТОГДА ""Нет""
	             |								ИНАЧЕ ВЫБОР
	             |										КОГДА ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |											ТОГДА ""Да""
	             |										КОГДА ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |											ТОГДА ""Нет""
	             |										ИНАЧЕ ""Нет""
	             |									КОНЕЦ
	             |							КОНЕЦ
	             |					КОНЕЦ
	             |			КОНЕЦ
	             |	КОНЕЦ КАК ВыгружатьНаСайт
				 |ИЗ
	             |	Справочник.Номенклатура КАК ном
	             |ГДЕ
	             |	ном.ПометкаУдаления = ЛОЖЬ
	             |	И ном.Ссылка.ФР_ВидНоменклатуры В ИЕРАРХИИ(&текгруппа)
	             |	И ВЫБОР
	             |			КОГДА ном.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |				ТОГДА ""Да""
	             |			КОГДА ном.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |				ТОГДА ""Нет""
	             |			ИНАЧЕ ВЫБОР
	             |					КОГДА ном.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |						ТОГДА ""Да""
	             |					КОГДА ном.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |						ТОГДА ""Нет""
	             |					ИНАЧЕ ВЫБОР
	             |							КОГДА ном.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |								ТОГДА ""Да""
	             |							КОГДА ном.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |								ТОГДА ""Нет""
	             |							ИНАЧЕ ВЫБОР
	             |									КОГДА ном.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |										ТОГДА ""Да""
	             |									КОГДА ном.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |										ТОГДА ""Нет""
	             |									ИНАЧЕ ВЫБОР
	             |											КОГДА ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |												ТОГДА ""Да""
	             |											КОГДА ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |												ТОГДА ""Нет""
	             |											ИНАЧЕ ""Нет""
	             |										КОНЕЦ
	             |								КОНЕЦ
	             |						КОНЕЦ
	             |				КОНЕЦ
	             |		КОНЕЦ = ""Да"" ";
	
		

	Запрос.УстановитьПараметр("текгруппа",Источник);  // группа вида номенклатуры фр.
	Запрос.УстановитьПараметр("Пустая",ложь); 
	Выборка=Запрос.Выполнить().Выбрать();
	//Сообщить(""+источник+" "+источник.код+" "+выборка.Количество());

	Пока выборка.Следующий() цикл
		//Сообщить(Выборка.ссылка);
		ТекНОм = Выборка.ссылка;
		ЗарегистрироватьИзменения(ТекНОм, ОбменСтильпарк);
	
	КонецЦикла;	
	
КонецПроцедуры
//нечаева 03,04,23---


//-------------------------------------------------------------------------------------
// нечаева 23,08,24

Функция ПолучитьСписокНомТНВЭД(ТНВЭД,ОбменСтильпарк = ложь,Объект=неопределено) Экспорт
	
	
	Если ТНВЭД = справочники.ТНВЭД.ПустаяСсылка() ТОгда
		возврат "нет";
	КонецЕсли;
	
	
	Если ОбменСтильпарк ТОгда
		ПеременнаяОбмена = "ВыгружатьНаСайтСтильПарк";
	иначе	
		ПеременнаяОбмена = "ВыгружатьВИнтернетМагазин";  // для б2б магазина
	конецЕсли;
	
	ВыгружатьНаСайт = "Нет";
	Запрос = новый Запрос;      // только модели отберем
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ном.Ссылка КАК модель,
	             |	ном.Код КАК Код,
	             |	ВЫБОР
	             |		КОГДА ном."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |			ТОГДА ""Да""
	             |		КОГДА ном."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |			ТОГДА ""Нет""
	             |		ИНАЧЕ ВЫБОР
	             |				КОГДА ном.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |					ТОГДА ""Да""
	             |				КОГДА ном.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |					ТОГДА ""Нет""
	             |				ИНАЧЕ ВЫБОР
	             |						КОГДА ном.Родитель.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |							ТОГДА ""Да""
	             |						КОГДА ном.Родитель.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |							ТОГДА ""Нет""
	             |						ИНАЧЕ ВЫБОР
	             |								КОГДА ном.Родитель.Родитель.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |									ТОГДА ""Да""
	             |								КОГДА ном.Родитель.Родитель.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |									ТОГДА ""Нет""
	             |								ИНАЧЕ ВЫБОР
	             |										КОГДА ном.Родитель.Родитель.Родитель.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |											ТОГДА ""Да""
	             |										КОГДА ном.Родитель.Родитель.Родитель.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |											ТОГДА ""Нет""
	             |										ИНАЧЕ ""Нет""
	             |									КОНЕЦ
	             |							КОНЕЦ
	             |					КОНЕЦ
	             |			КОНЕЦ
	             |	КОНЕЦ КАК ВыгружатьНаСайт
				 |ИЗ
	             |	Справочник.Номенклатура КАК ном
	             |ГДЕ
	             |	ном.Родитель.Родитель.Родитель <> &Пустая
	             |	И ном.ПометкаУдаления = ЛОЖЬ
	             |	И ном.Ссылка.ТНВЭД в иерархии (&ТНВЭД)
	             |	И ВЫБОР
	             |			КОГДА ном."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |				ТОГДА ""Да""
	             |			КОГДА ном."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |				ТОГДА ""Нет""
	             |			ИНАЧЕ ВЫБОР
	             |					КОГДА ном.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |						ТОГДА ""Да""
	             |					КОГДА ном.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |						ТОГДА ""Нет""
	             |					ИНАЧЕ ВЫБОР
	             |							КОГДА ном.Родитель.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |								ТОГДА ""Да""
	             |							КОГДА ном.Родитель.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |								ТОГДА ""Нет""
	             |							ИНАЧЕ ВЫБОР
	             |									КОГДА ном.Родитель.Родитель.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |										ТОГДА ""Да""
	             |									КОГДА ном.Родитель.Родитель.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |										ТОГДА ""Нет""
	             |									ИНАЧЕ ВЫБОР
	             |											КОГДА ном.Родитель.Родитель.Родитель.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |												ТОГДА ""Да""
	             |											КОГДА ном.Родитель.Родитель.Родитель.Родитель."+ПеременнаяОбмена+".Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |												ТОГДА ""Нет""
	             |											ИНАЧЕ ""Нет""
	             |										КОНЕЦ
	             |								КОНЕЦ
	             |						КОНЕЦ
	             |				КОНЕЦ
	             |		КОНЕЦ = ""Да"" ";
	
	
	//нечаева 10,08,22+++  если на цвет-размер, то признак смотрим у родителя.
		
	// нечаева 10,08,22--
	Запрос.УстановитьПараметр("ТНВЭД",ТНВЭД);  //ложь
	Запрос.УстановитьПараметр("Пустая",справочники.Номенклатура.ПустаяСсылка());  //ложь
	Выборка=Запрос.Выполнить().Выгрузить();
	
	СписокНом = выборка.ВыгрузитьКолонку("Модель");	
	
	возврат СписокНом;
	
	
	
КонецФункции

функция ЗарегистрироватьИзмененияТНВЭДСайтов(СписокТоваров,ОбменСтильпарк = ложь) Экспорт
	
	Для каждого текстрока из списокТоваров цикл
		ЗарегистрироватьИзменения(ТекСтрока, ОбменСтильпарк);
	
	КонецЦикла;	
	
	возврат истина;
	
конецФункции	

// нечаева 23,08,24---
//-------------------------------------------------------------------------------


//???? нечаева 27,10,2022 +++
Функция РегистрироватьИзмененияНоменклатурыДляСайтаСтильпарк_предыд(Ссылка,Объект,ОбменСтильпарк) Экспорт
	
	
	
	//нечаева25102022 +++
	ВыгружатьНаСайт = ВыгружатьНаСайт(ССылка);
	// это к сайту b2b  .
	Если ссылка.ВыгружатьВИнтернетМагазин<>Объект.ВыгружатьВИнтернетМагазин Тогда
		Выгружать=Истина;
		возврат Истина;
	КонецЕсли;	

	Если ссылка.ЖизненныйЦиклНоменклатуры<>Объект.ЖизненныйЦиклНоменклатуры  и ВыгружатьНаСайт = "Да"  Тогда
		Выгружать=Истина;
		возврат Истина;
	КонецЕсли;	
	// нечаева 251022 --

	
	// для номенклатуры
	Выгружать=Ложь;                                                               //нечаева 15,06,2022
	ГрупповыеРеквизиты	=Новый Структура("Цвет,Размер,ЦветИМ,СтавкаНДС,Наименование,Состав,ПоловозрастнойПризнак,"+
	"ВыгружатьВИнтернетМагазин,ПоловозрастнойПризнак,КатегорияИспользованияДляСайта,ТипТовараДляСайта,ЖизненныйЦиклНоменклатуры"+
	"БрендДляСайта,КоллекцияДляСайта,ОписаниеТовараДляСайта,РазмерДляСайта,ПодТипТовараДляСайта,НазваниеТовараДляСайта,Ведущий,ШтукВКоробочке,ШтукВКоробке");
	//нечаева 10022022
	
	// проверяем есть ли изменения.
	Для Каждого Реквизит Из ГрупповыеРеквизиты Цикл
		Попытка
			Если ссылка[Реквизит.Ключ]<>Объект[Реквизит.Ключ] Тогда
				Выгружать=Истина;
			КонецЕсли;		
		Исключение
		КонецПопытки;
		
	КонецЦикла;	
	
	// СоставНоменклатуры, ПодТипыТовараДляСайта  - таб. части  проверка через "ЗначениеВСтрокуВнутренняя"
	ТабличныеРеквизиты	=Новый Структура("СоставНоменклатуры,ПодТипыНоменклатурыДляСайта");
	
	Для Каждого Реквизит Из ТабличныеРеквизиты Цикл
		
		Попытка
			Тз1=Ссылка[Реквизит.Ключ].Выгрузить();
			Тз2=Объект[Реквизит.Ключ].Выгрузить();
			Если ЗначениеВСтрокуВнутр(Тз1)<>ЗначениеВСтрокуВнутр(Тз2) Тогда
				Выгружать=Истина;
			КонецЕсли;		
		Исключение
		КонецПопытки;
		
	КонецЦикла;	
	
//	Сообщить(" писать изменение в план обмена "+выгружать);
	
	Возврат Выгружать;
	
КонецФункции
// нечаева 27,10,2022 ---

Процедура ЗарегистрироватьИзменения(Объект, ОбменСтильпарк = ложь)
	
	Если Не ПараметрыСеанса.НаличиеОбменаССайтом Тогда
		Возврат;
	КонецЕсли;
	// только для центральной базы!!!
			
	ТипОбъекта = ТипЗнч(Объект);
	ТипОбъектаДокумент = Метаданные.Документы.Содержит(Объект.Метаданные());
	
	// Номенклатура и картинки
	Если ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.ЗначенияСвойствОбъектовИнтернетМагазин") Тогда
		
		МассивУзлов = ПолучитьМассивУзловДляРегистрации(Истина);
		Для каждого Запись Из Объект Цикл
			
			ТипДанных = ТипЗнч(Запись.Объект);
			
			Если ТипДанных = Тип("СправочникСсылка.Номенклатура") Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Запись.Объект);
			//ИначеЕсли ТипДанных = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
			//	ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Запись.Объект.Владелец);
			КонецЕсли;	
			
		КонецЦикла;
		
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Номенклатура") Тогда 
		  
		МассивУзлов = ПолучитьМассивУзловДляРегистрации(Истина,ложь,ОбменСтильпарк);  
		Попытка
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Объект);
		Исключение 
		конецПопытки;
	// нечаева 310522 ++	
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Контрагенты") Тогда 
		  
		МассивУзлов = ПолучитьМассивУзловДляРегистрации(Ложь,Истина,ложь); // первая товары, вторая контрагенты 
		Попытка
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Объект);
		Исключение 
		конецПопытки;
	 //нечаева 310522---
	// если изменился ШК, тоже выгружаем	нечаева 120422
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Штрихкоды") Тогда 
		  
		МассивУзлов = ПолучитьМассивУзловДляРегистрации(Истина, ложь, ложь); // тут только на b2b будем грузить. 
		Попытка
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Объект.Владелец.ссылка);
		Исключение 
		конецПопытки;
		
	// Смирнов М.Ю. 18.06.2025 WEB-3352 начало
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.УстановкаСкидокПоКонтрагентам") Тогда
		
		МассивУзлов = ПолучитьМассивУзловДляРегистрации(Ложь, Истина, Ложь); // первая товары, вторая контрагенты 
		Попытка
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Объект);
		Исключение 
		КонецПопытки;
	// Смирнов М.Ю. 18.06.2025 WEB-3352 конец	
		
	КонецЕсли;		
		
КонецПроцедуры	



Функция РегистрироватьИзмененияНоменклатурыДляСайта_Ст(Ссылка,Объект) Экспорт
	
	// ссылка - еще без изм.
	// объект уже с изменением.
	Выгружать=Ложь;
	ГрупповыеРеквизиты	=Новый Структура("Цвет,Размер,ЦветИМ,СтавкаНДС,Наименование,Состав,ПоловозрастнойПризнак,"+
	"ВыгружатьВИнтернетМагазин,ПоловозрастнойПризнак,КатегорияИспользованияДляСайта,ТипТовараДляСайта,"+
	"БрендДляСайта,КоллекцияДляСайта,ОписаниеТовараДляСайта,РазмерДляСайта,ПодТипТовараДляСайта,НазваниеТовараДляСайта,Ведущий");
	
	// проверяем есть ли изменения.
	Для Каждого Реквизит Из ГрупповыеРеквизиты Цикл
		Попытка
			Если ссылка[Реквизит.Ключ]<>Объект[Реквизит.Ключ] Тогда
				Выгружать=Истина;
			КонецЕсли;		
		Исключение
		КонецПопытки;
		
	КонецЦикла;	
	
	// СоставНоменклатуры, ПодТипыТовараДляСайта  - таб. части  проверка через "ЗначениеВСтрокуВнутренняя"
	ТабличныеРеквизиты	=Новый Структура("СоставНоменклатуры,ПодТипыНоменклатурыДляСайта");
	
	Для Каждого Реквизит Из ТабличныеРеквизиты Цикл
		
		Попытка
			Тз1=Ссылка[Реквизит.Ключ].Выгрузить();
			Тз2=Объект[Реквизит.Ключ].Выгрузить();
			Если ЗначениеВСтрокуВнутр(Тз1)<>ЗначениеВСтрокуВнутр(Тз2) Тогда
				Выгружать=Истина;
			КонецЕсли;		
		Исключение
		КонецПопытки;
		
	КонецЦикла;	
	
//	Сообщить(" писать изменение в план обмена "+выгружать);
	
	Возврат Выгружать;
	
КонецФункции

Процедура ЗарегистрироватьИзменения_Ст(Объект)
	
	Если Не ПараметрыСеанса.НаличиеОбменаССайтом Тогда
		Возврат;
	КонецЕсли;
	// только для центральной базы!!!
	
	//+++
	//СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	//ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом Тогда        
	//	//ЗаписатьВЛог("Регламент","Отмена выполнения. Задача: Загрузка из ЕКОДЕ. Автообмен разрешен для базы: """+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
	//	//Возврат;
	//КонецЕсли;
	//
	
		
	ТипОбъекта = ТипЗнч(Объект);
	ТипОбъектаДокумент = Метаданные.Документы.Содержит(Объект.Метаданные());
	
	// Номенклатура и картинки
	Если ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.ЗначенияСвойствОбъектовИнтернетМагазин") Тогда
		
		МассивУзлов = ПолучитьМассивУзловДляРегистрации(Истина);
		Для каждого Запись Из Объект Цикл
			
			ТипДанных = ТипЗнч(Запись.Объект);
			
			Если ТипДанных = Тип("СправочникСсылка.Номенклатура") Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Запись.Объект);
			//ИначеЕсли ТипДанных = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
			//	ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Запись.Объект.Владелец);
			КонецЕсли;	
			
		КонецЦикла;
		
	// ++Нечаева 14.03.13 не нужно больше контролировать остатки ++
	//ИначеЕсли ТипОбъекта = Тип("РегистрНакопленияНаборЗаписей.ОстаткиТМЦ")
	//	  ИЛИ ТипОбъекта = Тип("РегистрНакопленияНаборЗаписей.РезервыТМЦ")
	//	  ИЛИ ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.ЦеныНоменклатуры") Тогда 
	//	  
	//	МассивУзлов = ПолучитьМассивУзловДляРегистрации(Истина);  
	//	Для каждого Запись Из Объект Цикл
	//		
	//		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Запись.Номенклатура);
	//		
	//	КонецЦикла;
	//
	//	
	//	
	//ИначеЕсли ТипОбъектаДокумент Тогда
	//	
	//	МассивУзлов = ПолучитьМассивУзловДляРегистрации(Истина);  
	//	МетаданныеДокумента = Объект.Метаданные();
	//	
	//	Если ЕстьТабЧастьДокумента("Товары", МетаданныеДокумента) Тогда
	//		Для каждого СтрокаТЧ Из Объект.Товары Цикл
	//			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, СтрокаТЧ.Номенклатура);
	//		КонецЦикла;
	//	ИначеЕсли ЕстьТабЧастьДокумента("Заказы", МетаданныеДокумента) Тогда
	//		Для каждого Заказ Из Объект.Заказы Цикл
	//			Для каждого СтрокаТЧ Из Заказ.ЗаказПокупателя.Товары Цикл
	//				ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, СтрокаТЧ.Номенклатура);
	//			КонецЦикла;	
	//		КонецЦикла;
	//	КонецЕсли;
	// -- Нечаева 14.03.13	
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Номенклатура") Тогда 
		  
		МассивУзлов = ПолучитьМассивУзловДляРегистрации(Истина);  
		Попытка
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Объект);
		Исключение 
		конецПопытки;
		
		
	КонецЕсли;		
		
КонецПроцедуры	


Процедура ПриЗаписиСправочникаОбменССайтомПриЗаписи(Источник, Отказ, ОбменСтильпарк = ложь) Экспорт
	
	ЗарегистрироватьИзменения(Источник, ОбменСтильпарк);
	
КонецПроцедуры

// Смирнов М.Ю. 18.06.2025 WEB-3352 начало
Процедура ПриЗаписиДокументаОбменССайтомПриЗаписи(Источник, Отказ, ОбменСтильпарк = Ложь) Экспорт
	
	ЗарегистрироватьИзменения(Источник, ОбменСтильпарк);
	
КонецПроцедуры
// Смирнов М.Ю. 18.06.2025 WEB-3352 конец

Процедура ПриЗаписиРегистраНакопленияОбменССайтомПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	//доработки Чиркова для свертки базы, 04.08.2016 начало
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;	
	//доработки Чиркова для свертки базы, начало 04.08.2016 конец 
	
	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
		
	    
	//Кухарь А.Ю.  31.03.2026 начало
	//Рефакторинг. Приведение к 1й функции
	//Если  ПланыОбмена.ОбменССайтомТоварами.ЭтотУзел().Код="SEM" И  ТекСтрокаСоединения=СтрокаСоединенияСразрешеннымОбменом Тогда
	Если  ПланыОбмена.ОбменССайтомТоварами.ЭтотУзел().Код="SEM" И ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() Тогда	
		//Кухарь А.Ю.  31.03.2026 конец  
		
		ЗарегистрироватьИзменения(Источник);
	
	КонецЕсли;
	
	
	
КонецПроцедуры

Процедура ЗаполнитьНастройкуОбменаWEBЗначениямиПоУмолчанию(НастройкаОбмена) Экспорт
	
	НастройкаОбмена.ОбменТоварами = Истина;
	НастройкаОбмена.ОбменЗаказами = Истина;
	
	НастройкаОбмена.ВыгружатьТолькоИзменения = Истина;
	НастройкаОбмена.ВыгружатьНаСайт		 	 = Истина;
	
	НастройкаОбмена.HTTPОбменИмяПользователя = "User";
	НастройкаОбмена.HTTPОбменПароль			 = "";
	
	НастройкаОбмена.ВыгружатьКартинки = Истина;
	НастройкаОбмена.ВыгружатьФайлы = Истина;
	
	НастройкаОбмена.СпособИдентификацииКонтрагентов	= "Наименование";
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	//ОсновнойКаталогФайлов 		= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновнойКаталогФайлов");
	//Если НЕ ЗначениеЗаполнено(ОсновнойКаталогФайлов) Тогда
	//	ОсновнойКаталогФайлов = "C:";	
	//КонецЕсли;
	//НастройкаОбмена.КаталогВыгрузки	= ОсновнойКаталогФайлов + "\1cbitrix";
	//
	//НастройкаОбмена.Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновнаяОрганизация");
	//Если НЕ ЗначениеЗаполнено(НастройкаОбмена.Организация) Тогда 
	//	Выборка = Справочники.Организации.Выбрать();
	//	Если Выборка.Следующий() Тогда
	//		НастройкаОбмена.Организация = Выборка.Ссылка;
	//	КонецЕсли;	
	//КонецЕсли;	
	//НастройкаОбмена.Подразделение 					  = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновноеПодразделение");
	//НастройкаОбмена.Ответственный 					  = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновнойОтветственный");
	//НастройкаОбмена.ЕдиницаИзмеренияНовойНоменклатуры = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновнаяЕдиницаПоКлассификатору");
	//
	Если НЕ ЗначениеЗаполнено(НастройкаОбмена.ЕдиницаИзмеренияНовойНоменклатуры) Тогда 
		ЕдиницаИзмеренияНовойНоменклатуры = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт", Истина);
		Если НЕ ЗначениеЗаполнено(НастройкаОбмена.ЕдиницаИзмеренияНовойНоменклатуры) Тогда 
			НастройкаОбмена.ЕдиницаИзмеренияНовойНоменклатуры = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("796");
		КонецЕсли;	
	КонецЕсли;	
	
	НастройкаОбмена.HTTPОбменАдресСайта	 = "http://localhost:6448/bitrix/admin/1c_exchange.php";
	
	НастройкаОбмена.ФорматДаты 			 = "ДФ=yyyy-MM-dd; ДЛФ=D";
	НастройкаОбмена.ФорматВремени 		 = "ДФ=ЧЧ:мм:сс; ДЛФ=T";
	НастройкаОбмена.РазделительДатаВремя = "T";
	
	НастройкаОбмена.ФорматСуммы 	 = "ЧЦ=18; ЧДЦ=2; ЧРД=,; ЧГ=";
	НастройкаОбмена.ФорматКоличества = "ЧЦ=18; ЧДЦ=2; ЧРД=,; ЧГ=";
	
	НастройкаОбмена.СохраненнаяТаблицаКаталогов = Новый ХранилищеЗначения(ПроцедурыОбменаССайтом.СоздатьТаблицуКаталогов());
	
КонецПроцедуры
	
// при нажатии на "Открытие" у каталога 
Процедура ОбработчикОткрытиеДляФайла(Элемент, СтандартнаяОбработка) Экспорт 
	
	СтандартнаяОбработка = Ложь;
	
	Если ПустаяСтрока(Элемент.Значение) Тогда
		Возврат;
	КонецЕсли;
	
	// открываем каталог который в настройках
	#Если Клиент Тогда 
		//++-++
	ЗапуститьПриложение(Элемент.Значение);
	#конецЕсли
	
КонецПроцедуры

Функция ПолучитьМассивУзловДляРегистрации(РегистрацияДляТоваров = Истина,РегистрацияДляКонтрагентов = ложь, ОбменСтильпарк = ложь) Экспорт
	
	МассивУзлов = Новый Массив();
	
	Если РегистрацияДляТоваров Тогда
		
		// нечаева 27,10,2022 ---
		Если не обменСтильпарк Тогда
			Для Каждого Элемент Из ПараметрыСеанса.ВсеУзлыДляОбменаССайтомТоварамиb2b Цикл
				МассивУзлов.Добавить(Элемент);
			КонецЦикла;
		иначе
			Для Каждого Элемент Из ПараметрыСеанса.ВсеУзлыДляОбменаССайтомТоварами Цикл
				МассивУзлов.Добавить(Элемент);
			КонецЦикла;
		
		конецЕсли;
		// нечаева 27,10,22 ---
		
		
	//нечаева 31,05,22++	
	ИначеЕсли РегистрацияДляКонтрагентов ТОгда
		
		//Для Каждого Элемент Из ПараметрыСеанса.ВсеУзлыДляОбменаССайтомКонтрагентами Цикл
		//	МассивУзлов.Добавить(Элемент);
		//КонецЦикла;	
		Узел = планыОБмена.ОбменССайтом_b2b.НайтиПоКоду("KNT");
		МассивУзлов.Добавить(Узел);
	//31,05,22 --
	
	Иначе
		
		Для Каждого Элемент Из ПараметрыСеанса.ВсеУзлыДляОбменаССайтомЗаказами Цикл
			МассивУзлов.Добавить(Элемент);
		КонецЦикла;	
		
	КонецЕсли;
	
	Возврат МассивУзлов;
	
КонецФункции

Процедура ВыполнитьАвтообмен(Настройка, ФлагАвтообмена = Истина, ВыгружатьЦветаИМ = ЛОжь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Настройка) Тогда
	 
		Возврат;
		
	КонецЕсли;	
	
	ОбработкаОбмена = Обработки.ОбменССайтом.Создать();	
	ОбработкаОбмена.НастройкаСсылка = Настройка;
	ОбработкаОбмена.Автообмен = ФлагАвтообмена;  //????
	ОбработкаОбмена.ВыгружатьЦветаИМ = ВыгружатьЦветаИМ;
	ОбработкаОбмена.ВыгрузитьДанные();	
	
КонецПроцедуры	

Функция ПолучитьФлагПринудительнойПолнойВыгрузки(НастройкаОбмена) Экспорт
	возврат Ложь;
	//Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	//					  |	НастройкиОбменаССайтомСПринудительнойПолнойВыгрузкой.НастройкаОбмена
	//					  |ИЗ
	//					  |	РегистрСведений.НастройкиОбменаССайтомСПринудительнойПолнойВыгрузкой КАК НастройкиОбменаССайтомСПринудительнойПолнойВыгрузкой
	//					  |ГДЕ
	//					  |	НастройкиОбменаССайтомСПринудительнойПолнойВыгрузкой.НастройкаОбмена = &НастройкаОбмена");
	//Запрос.УстановитьПараметр("НастройкаОбмена", НастройкаОбмена);					  
	//Возврат НЕ Запрос.Выполнить().Пустой();					  
КонецФункции

Процедура УстановитьФлагПринудительнойПолнойВыгрузки(НастройкаОбмена, Флаг) Экспорт
	
	Флаг=Ложь;
	//Зап = РегистрыСведений.НастройкиОбменаССайтомСПринудительнойПолнойВыгрузкой.СоздатьМенеджерЗаписи();
	//Зап.НастройкаОбмена = НастройкаОбмена;
	//Попытка
	//	Если Флаг Тогда
	//		Зап.Записать();
	//	Иначе	
	//		Зап.Удалить();
	//	КонецЕсли;	
	//Исключение
	//КонецПопытки;	
КонецПроцедуры	

Процедура ПриУдаленииПроведенияДокументовДляОбменаССайтомОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	Если планыОбмена.ОбменССайтомТоварами.ЭтотУзел().Код="SEM" Тогда
	
		ЗарегистрироватьИзменения(Источник);
	
	КонецЕсли;
	
	
		
КонецПроцедуры

// сервисные функции для работы обмена

Функция РазобратьАдресСайта(Знач АдресСайта) Экспорт
	
	АдресСайта = СокрЛП(АдресСайта); 
	
	HTTPСервер		 			= ""; 
	HTTPПорт					= 0;
	HTTPАдресСкрипта 			= "";
	HTTPЗащищенноеСоединение 	= Ложь;
	
	Если ЗначениеЗаполнено(АдресСайта) Тогда
		
		АдресСайта = СтрЗаменить(АдресСайта, "\", "/");
		АдресСайта = СтрЗаменить(АдресСайта, " ", "");
		
		Если ВРег(Лев(АдресСайта, 7)) = "HTTP://" Тогда
			АдресСайта = Сред(АдресСайта, 8);	
		ИначеЕсли ВРег(Лев(АдресСайта, 8)) = "HTTPS://" Тогда
			АдресСайта = Сред(АдресСайта, 9);
			HTTPЗащищенноеСоединение = Истина;
		КонецЕсли;

		ПозицияСлэша = Найти(АдресСайта, "/");
		
		Если ПозицияСлэша > 0 Тогда
			HTTPСервер 		 = Лев(АдресСайта, ПозицияСлэша - 1);	
			HTTPАдресСкрипта = Прав(АдресСайта, СтрДлина(АдресСайта) - ПозицияСлэша);
		Иначе	
			HTTPСервер 		 = АдресСайта;	
			HTTPАдресСкрипта = "";
		КонецЕсли;	
		ПозицияДвоеточия = Найти(HTTPСервер, ":");
		Если ПозицияДвоеточия > 0 Тогда
			HTTPСерверСПортом = HTTPСервер;
			HTTPСервер		  = Лев(HTTPСерверСПортом, ПозицияДвоеточия - 1);
			HTTPПортСтрока 	  = Прав(HTTPСерверСПортом, СтрДлина(HTTPСерверСПортом) - ПозицияДвоеточия);
		Иначе
			HTTPПортСтрока = "0";
		КонецЕсли;
		
		HTTPПорт = ПривестиСтрокуКЧислу(HTTPПортСтрока); //ОбщегоНазначения.
				
	КонецЕсли;
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("HTTPСервер"	  			, HTTPСервер); 
	СтруктураРезультата.Вставить("HTTPПорт"		   			, HTTPПорт);
	СтруктураРезультата.Вставить("HTTPАдресСкрипта"			, HTTPАдресСкрипта);
	СтруктураРезультата.Вставить("HTTPЗащищенноеСоединение"	, HTTPЗащищенноеСоединение);
	
	Возврат СтруктураРезультата;
	
КонецФункции

Функция ВыполнитьТестовоеПодключениеКСерверуHTTP(Объект, СтрокаСообщенияПользователю, 
	РезультатСоединения = Неопределено, ТипСоединения = "catalog") Экспорт
	
	СтруктураПараметровСайта = ПолучитьСтруктуруПараметровДляСоединения(Объект, Объект.HTTPОбменАдресСайта);
		
	Соединение = ПроцедурыОбменаССайтом.HTTPУстановитьСоединение(СтруктураПараметровСайта);
	
	Если Соединение = Неопределено Тогда
		Возврат "Ошибка при установке соединения с сайтом.";
	КонецЕсли;
	
	ОтветСервера = "";
	РезультатСоединения = HTTPВыполнитьАвторизациюДляСоединения(Соединение, СтруктураПараметровСайта, ОтветСервера, СтрокаСообщенияПользователю, ТипСоединения);
	
	Если Не РезультатСоединения Тогда
		Возврат "Соединение с сайтом не установлено.";
	Иначе
		Возврат "Соединение выполнено успешно.";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСтруктуруПараметровДляСоединения(Объект, Знач НачалоАдресаСкрипта = "") Экспорт
	
	СтруктураПараметровСайта = Новый Структура;
	СтруктураПараметровСайта.Вставить("ИмяПользователя", Объект.HTTPОбменИмяПользователя);
	СтруктураПараметровСайта.Вставить("Пароль"		   , Объект.HTTPОбменПароль);
	
	Если Не ПустаяСтрока(НачалоАдресаСкрипта) Тогда
		
		СтруктураАдреса = РазобратьАдресСайта(НачалоАдресаСкрипта);
		
		СтруктураПараметровСайта.Вставить("АдресСкрипта"		, СтруктураАдреса.HTTPАдресСкрипта);
		СтруктураПараметровСайта.Вставить("Сервер"				, СтруктураАдреса.HTTPСервер);
		СтруктураПараметровСайта.Вставить("Порт"				, СтруктураАдреса.HTTPПорт);
		СтруктураПараметровСайта.Вставить("ЗащищенноеСоединение", СтруктураАдреса.HTTPЗащищенноеСоединение);
		
	Иначе
		
		СтруктураПараметровСайта.Вставить("АдресСкрипта"		, Объект.HTTPОбменАдресСкрипта);
		СтруктураПараметровСайта.Вставить("Сервер"				, Объект.HTTPОбменСервер);
		СтруктураПараметровСайта.Вставить("Порт"				, Объект.HTTPОбменПорт);
		СтруктураПараметровСайта.Вставить("ЗащищенноеСоединение", Объект.HTTPОбменЗащищенноеСоединение);

	КонецЕсли;
	
	СтруктураПараметровСайта.Вставить("ПроксиСервер"		 , Объект.HTTPОбменПроксиСервер);
	СтруктураПараметровСайта.Вставить("ПроксиПорт"		     , Объект.HTTPОбменПроксиПорт);
	СтруктураПараметровСайта.Вставить("ПроксиИмяПользователя", Объект.HTTPОбменПроксиИмяПользователя);
	СтруктураПараметровСайта.Вставить("ПроксиПароль"		 , Объект.HTTPОбменПроксиПароль);
	СтруктураПараметровСайта.Вставить("ПроксиИспользование"  , Объект.HTTPОбменПроксиИспользование);	
	
	Возврат СтруктураПараметровСайта;
	
КонецФункции

Функция HTTPПолучитьДанныеССервера(Соединение, ПараметрыЗапроса="", Заголовки="", СтрокаСообщенияПользователю = "") Экспорт
	
	ОтветСервера   = Неопределено; 
	
	ИмяФайлаОтвета = ПолучитьИмяВременногоФайла();
		
	Попытка
		Соединение.Получить(СокрЛП(ПараметрыЗапроса), ИмяФайлаОтвета, СокрЛП(Заголовки));
	Исключение
		СтрокаСообщенияПользователю = "Не удалось получить данные с сервера. Проверьте правильность адреса сервера, порт, имя пользователя и пароль,"
			+ Символы.ПС + "а также настройки подключения к Интернет." + Символы.ПС + ОписаниеОшибки();
	КонецПопытки;	
	
	ФайлОтвета = Новый Файл(ИмяФайлаОтвета);
	
	Если ФайлОтвета.Существует() Тогда
		
		ТекстОтвета = Новый ТекстовыйДокумент();
		ТекстОтвета.Прочитать(ИмяФайлаОтвета);
		Если ТекстОтвета.КоличествоСтрок()>0 Тогда
			ОтветСервера = ТекстОтвета.ПолучитьТекст();	
		Иначе
			СтрокаСообщенияПользователю = СтрокаСообщенияПользователю + Символы.ПС + "Получение данных с сервера: Получен пустой ответ сервера."; 	
		КонецЕсли;	
		
	Иначе	
		СтрокаСообщенияПользователю = СтрокаСообщенияПользователю + Символы.ПС + "Получение данных с сервера: Ответ сервера не получен."; 
	КонецЕсли;	
	
	Попытка
		УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайлаОтвета);
	Исключение
		
	КонецПопытки;
	
	Возврат ОтветСервера;
	
КонецФункции

Функция HTTPВыполнитьАвторизациюДляСоединения(Соединение, СтруктураПараметровСайта, 
	ОтветСервера, СтрокаСообщенияПользователю, ТипСоединения = "catalog") Экспорт
	
	Успешно    = Истина;
	#Если Клиент Тогда
	Состояние("Установка соединения с сервером...");
	#КонецЕсли

	Соединение = ПроцедурыОбменаССайтом.HTTPУстановитьСоединение(СтруктураПараметровСайта);
	 
	Если Соединение = Неопределено Тогда
		СтрокаСообщенияПользователю = "Не удалось установить соединение с сервером.";
		Возврат Ложь;
	КонецЕсли;
	
	#Если Клиент Тогда
	Состояние("Проверка имени пользователя и пароля...");
	#КонецЕсли
	
	ОписаниеОшибки = "";
	ОтветСервера = HTTPПолучитьДанныеССервера(Соединение, СтруктураПараметровСайта.АдресСкрипта + "?type=" + ТипСоединения + "&mode=checkauth", , ОписаниеОшибки);
		
	Если ОтветСервера = Неопределено Тогда 
		СтрокаСообщенияПользователю = "Не удалось установить соединение с сервером. Авторизация пользователя не выполнена." + Символы.ПС + ОписаниеОшибки;
		Возврат Ложь;
	КонецЕсли;
		
	Если СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера, 1))) <> "success" Тогда
		СтрокаСообщенияПользователю = "Не удалось установить соединение с сервером. Проверьте имя пользователя и пароль." + Символы.ПС + ОписаниеОшибки;
		Возврат Ложь;
	КонецЕсли;
	
	СтрокаСообщенияПользователю = ОписаниеОшибки;
	
	Возврат Истина;
	
КонецФункции

Функция HTTPУстановитьСоединение(СтруктураПараметровСайта) Экспорт
	
	Соединение = НеОпределено;
		
	ИнтернетПрокси = НеОпределено;
	
	Если СтруктураПараметровСайта.ПроксиИспользование Тогда
		
		ИнтернетПрокси = Новый ИнтернетПрокси;
		ИнтернетПрокси.Пользователь = СтруктураПараметровСайта.ПроксиИмяПользователя;
		ИнтернетПрокси.Пароль		= СтруктураПараметровСайта.ПроксиПароль;
					
		ПротоколПрокси = ?(СтруктураПараметровСайта.ЗащищенноеСоединение, "HTTPS", "HTTP");
		
		Если СтруктураПараметровСайта.ПроксиПорт = 0 Тогда
			ИнтернетПрокси.Установить(ПротоколПрокси, СтруктураПараметровСайта.ПроксиСервер);
		Иначе	
			ИнтернетПрокси.Установить(ПротоколПрокси, СтруктураПараметровСайта.ПроксиСервер, СтруктураПараметровСайта.ПроксиПорт);
		КонецЕсли;	
		
	КонецЕсли;	
	
	Порт = ?(ЗначениеЗаполнено(СтруктураПараметровСайта.Порт), СтруктураПараметровСайта.Порт, ?(СтруктураПараметровСайта.ЗащищенноеСоединение, 443, 80));
	
	Попытка
		
		Соединение = Новый HTTPСоединение(СтруктураПараметровСайта.Сервер, Порт, СтруктураПараметровСайта.ИмяПользователя, СтруктураПараметровСайта.Пароль, ИнтернетПрокси, СтруктураПараметровСайта.ЗащищенноеСоединение);
		
		//ЗаписатьВЛог("Регламент",СтруктураПараметровСайта.Сервер,"Информация"); 
		//ЗаписатьВЛог("Регламент",СтруктураПараметровСайта.ИмяПользователя,"Информация"); 
		//ЗаписатьВЛог("Регламент",СтруктураПараметровСайта.Пароль,"Информация"); 
		//ЗаписатьВЛог("Регламент",порт,"Информация"); 
		//
		
		
	Исключение
		
		СообщитьОбОшибке("Не удалось установить соединение с сервером " + СтруктураПараметровСайта.Сервер + ":" + Строка(СтруктураПараметровСайта.Порт) + ".
			|Проверьте правильность адреса сервера, порт, имя пользователя и пароль.");
			
			//ОбщегоНазначения.
			
		Соединение = Неопределено;
		
			
	Конецпопытки;	
		
	Возврат Соединение;
	
КонецФункции

Процедура НастроитьПостроитель(ПостроительОбъект, КлассифицироватьПоЦеновымГруппам, УчетнаяПолитика = НеОпределено) Экспорт
	
	МассивДопустимыхТиповНоменклатуры = Новый Массив;
	МассивДопустимыхТиповНоменклатуры.Добавить(Перечисления.ТипыНоменклатуры.Товар);
	МассивДопустимыхТиповНоменклатуры.Добавить(Перечисления.ТипыНоменклатуры.Услуга);
	МассивДопустимыхТиповНоменклатуры.Добавить(Перечисления.ТипыНоменклатуры.Комплект);
	МассивДопустимыхТиповНоменклатуры.Добавить(Перечисления.ТипыНоменклатуры.Набор);

	ПостроительОбъект.Параметры.Вставить("МассивДопустимыхТиповНоменклатуры", МассивДопустимыхТиповНоменклатуры);
	
	ТекДата = ТекущаяДата();
	ПостроительОбъект.Параметры.Вставить("ТекДата", КонецДня(ТекДата));
	
	//Если НЕ УчетнаяПолитика = НеОпределено Тогда
	//	ПериодНакопленияСкидок =""; //ОбработкаТабличныхЧастей.ПолучитьПериодРасчетаНакопительныхСкидок(ТекДата, УчетнаяПолитика);
	//Иначе
		ПериодНакопленияСкидок = Новый Структура("ДатаНач,ДатаКон", '00010101000000', КонецДня(ТекДата));
	//КонецЕсли;	

	ПостроительОбъект.Параметры.Вставить("ДатаНач", ПериодНакопленияСкидок.ДатаНач);
	ПостроительОбъект.Параметры.Вставить("ДатаКон", ПериодНакопленияСкидок.ДатаКон);
	
	МассивУсловийСкидок = Новый Массив;
	МассивУсловийСкидок.Добавить(Перечисления.УсловияСкидкиНаценки.БезУсловий);
	МассивУсловийСкидок.Добавить(Перечисления.УсловияСкидкиНаценки.ПоВидуДисконтныхКарт);
	МассивУсловийСкидок.Добавить(Перечисления.УсловияСкидкиНаценки.ПоДисконтнойКарте);
	МассивУсловийСкидок.Добавить(Перечисления.УсловияСкидкиНаценки.ПоКоличествуТовара);
	МассивУсловийСкидок.Добавить(Перечисления.УсловияСкидкиНаценки.ПоСуммеДокумента);
	
	ПостроительОбъект.Параметры.Вставить("МассивУсловийСкидок", МассивУсловийСкидок);
	ПостроительОбъект.Параметры.Вставить("КлассифицироватьПоЦеновымГруппам", КлассифицироватьПоЦеновымГруппам);
	
	ПостроительОбъект.Текст = "";
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//						  |	НоменклатураСХарактеристиками.НоменклатураСсылка КАК НоменклатураСсылка,
	//						  |	НоменклатураСХарактеристиками.ХарактеристикаСсылка КАК ХарактеристикаСсылка,
	//						  |	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВРозницеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВНТТОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыКПередачеСоСкладовОстатки.КоличествоОстаток, 0) КАК Остаток
	//						  |ПОМЕСТИТЬ ВремНоменклатураСХарактеристиками
	//						  |ИЗ
	//						  |	(ВЫБРАТЬ
	//						  |		Номенклатура.Ссылка КАК НоменклатураСсылка,
	//						  |		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаСсылка
	//						  |	ИЗ
	//						  |		Справочник.Номенклатура КАК Номенклатура
	//						  |	ГДЕ
	//						  |		(НЕ Номенклатура.ЭтоГруппа)
	//						  |		И Номенклатура.ВидНоменклатуры.ТипНоменклатуры В(&МассивДопустимыхТиповНоменклатуры)
	//						  |	{ГДЕ
	//						  |		Номенклатура.Ссылка.* КАК Номенклатура}
	//						  |	
	//						  |	ОБЪЕДИНИТЬ
	//						  |	
	//						  |	ВЫБРАТЬ
	//						  |		ХарактеристикиНоменклатуры.Владелец,
	//						  |		ХарактеристикиНоменклатуры.Ссылка
	//						  |	ИЗ
	//						  |		Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	//						  |	ГДЕ
	//						  |		ХарактеристикиНоменклатуры.Владелец.ВидНоменклатуры.ТипНоменклатуры В(&МассивДопустимыхТиповНоменклатуры)
	//						  |		И ХарактеристикиНоменклатуры.Владелец.ВестиУчетПоХарактеристикам
	//						  |	{ГДЕ
	//						  |		ХарактеристикиНоменклатуры.Владелец.Ссылка.* КАК Номенклатура}) КАК НоменклатураСХарактеристиками
	//						  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(, {(Склад).*, (Номенклатура).* КАК Номенклатура}) КАК ТоварыНаСкладахОстатки
	//						  |		ПО НоменклатураСХарактеристиками.НоменклатураСсылка = ТоварыНаСкладахОстатки.Номенклатура
	//						  |			И НоменклатураСХарактеристиками.ХарактеристикаСсылка = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	//						  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРознице.Остатки(, {(Склад).*, (Номенклатура).* КАК Номенклатура}) КАК ТоварыВРозницеОстатки
	//						  |		ПО НоменклатураСХарактеристиками.НоменклатураСсылка = ТоварыВРозницеОстатки.Номенклатура
	//						  |			И НоменклатураСХарактеристиками.ХарактеристикаСсылка = ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры
	//						  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВНТТ.Остатки(, {(Склад).*, (Номенклатура).* КАК Номенклатура}) КАК ТоварыВНТТОстатки
	//						  |		ПО НоменклатураСХарактеристиками.НоменклатураСсылка = ТоварыВНТТОстатки.Номенклатура
	//						  |			И НоменклатураСХарактеристиками.ХарактеристикаСсылка = ТоварыВНТТОстатки.ХарактеристикаНоменклатуры
	//						  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, {(Склад).*, (Номенклатура).* КАК Номенклатура}) КАК ТоварыВРезервеНаСкладахОстатки
	//						  |		ПО НоменклатураСХарактеристиками.НоменклатураСсылка = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	//						  |			И НоменклатураСХарактеристиками.ХарактеристикаСсылка = ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры
	//						  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКПередачеСоСкладов.Остатки(, {(Склад).*, (Номенклатура).* КАК Номенклатура}) КАК ТоварыКПередачеСоСкладовОстатки
	//						  |		ПО НоменклатураСХарактеристиками.НоменклатураСсылка = ТоварыКПередачеСоСкладовОстатки.Номенклатура
	//						  |			И НоменклатураСХарактеристиками.ХарактеристикаСсылка = ТоварыКПередачеСоСкладовОстатки.ХарактеристикаНоменклатуры
	//						  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	//						  |		ПО НоменклатураСХарактеристиками.НоменклатураСсылка = КатегорииОбъектов.Объект
	//						  |ГДЕ
	//						  |	((НЕ &КлассифицироватьПоЦеновымГруппам)
	//						  |			ИЛИ &КлассифицироватьПоЦеновымГруппам
	//						  |				И (НЕ НоменклатураСХарактеристиками.НоменклатураСсылка.ЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)))
	//						  |{ГДЕ
	//						  |	(ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВРозницеОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВНТТОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыКПередачеСоСкладовОстатки.КоличествоОстаток, 0)) КАК Остаток,
	//						  |	(ЕСТЬNULL(КатегорииОбъектов.Категория, ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ПустаяСсылка))).* КАК КатегорияНоменклатуры}
	//						  |
	//						  |ИНДЕКСИРОВАТЬ ПО
	//						  |	НоменклатураСсылка,
	//						  |	ХарактеристикаСсылка
	//						  |;
	//						  |
	//						  |////////////////////////////////////////////////////////////////////////////////
	//						  |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//						  |	ВремНоменклатураСХарактеристиками.НоменклатураСсылка КАК НоменклатураСсылка,
	//						  |	ЗначенияСвойствОбъектовИнтернетМагазин.Свойство КАК СвойствоНоменклатурыСсылка,
	//						  |	ЗначенияСвойствОбъектовИнтернетМагазин.Значение
	//						  |ПОМЕСТИТЬ ВремЗначенияСвойствНоменклатуры
	//						  |ИЗ
	//						  |	ВремНоменклатураСХарактеристиками КАК ВремНоменклатураСХарактеристиками
	//						  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектовИнтернетМагазин КАК ЗначенияСвойствОбъектов
	//						  |		ПО ВремНоменклатураСХарактеристиками.НоменклатураСсылка = ЗначенияСвойствОбъектов.Объект
	//						  |{ГДЕ
	//						  |	ЗначенияСвойствОбъектов.Свойство.* КАК СвойствоНоменклатуры}
	//						  |
	//						  |ИНДЕКСИРОВАТЬ ПО
	//						  |	НоменклатураСсылка,
	//						  |	СвойствоНоменклатурыСсылка
	//						  |;
	//						  |
	//						  |////////////////////////////////////////////////////////////////////////////////
	//						  |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//						  |	ВремНоменклатураСХарактеристиками.НоменклатураСсылка КАК НоменклатураСсылка,
	//						  |	ВремНоменклатураСХарактеристиками.ХарактеристикаСсылка КАК ХарактеристикаСсылка,
	//						  |	ВремНоменклатураСХарактеристиками.Остаток КАК Остаток,
	//						  |	ЦеныНоменклатурыСрезПоследних.ТипЦен КАК ТипЦенСсылка,
	//						  |	ЦеныНоменклатурыСрезПоследних.Валюта КАК ВалютаЦеныСсылка,
	//						  |	ЦеныНоменклатурыСрезПоследних.Цена,
	//						  |	ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмеренияЦеныСсылка
	//						  |ПОМЕСТИТЬ ВремЦены
	//						  |ИЗ
	//						  |	ВремНоменклатураСХарактеристиками КАК ВремНоменклатураСХарактеристиками
	//						  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//						  |			РасчетныеЦены.Номенклатура КАК Номенклатура,
	//						  |			РасчетныеЦены.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//						  |			РасчетныеЦены.ТипЦен КАК ТипЦен,
	//						  |			ВЫБОР
	//						  |				КОГДА РасчетныеЦены.СпособРасчетаЦены = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаЦены.ПоПроцентнойНаценкеНаБазовыйТип)
	//						  |					ТОГДА РасчетныеЦены.ВалютаТипаЦен
	//						  |				ИНАЧЕ РасчетныеЦены.ВалютаЦеныПоДиапазону
	//						  |			КОНЕЦ КАК Валюта,
	//						  |			ВЫБОР
	//						  |				КОГДА РасчетныеЦены.СпособРасчетаЦены = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаЦены.ПоПроцентнойНаценкеНаБазовыйТип)
	//						  |					ТОГДА РасчетныеЦены.БазоваяЦена * РасчетныеЦены.КоэффициентПересчетаБазовойЦены * (1 + РасчетныеЦены.ПроцентСкидкиНаценки / 100)
	//						  |				ИНАЧЕ РасчетныеЦены.ЦенаПоДиапазону
	//						  |			КОНЕЦ КАК Цена,
	//						  |			РасчетныеЦены.ЕдиницаИзмеренияБазовойЦены КАК ЕдиницаИзмерения
	//						  |		ИЗ
	//						  |			(ВЫБРАТЬ
	//						  |				ДинамическиеЦены.Номенклатура КАК Номенклатура,
	//						  |				ДинамическиеЦены.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//						  |				ДинамическиеЦены.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	//						  |				ДинамическиеЦены.СпособРасчетаЦены КАК СпособРасчетаЦены,
	//						  |				ДинамическиеЦены.ТипЦен КАК ТипЦен,
	//						  |				ДинамическиеЦены.ТипЦен.ВалютаЦены КАК ВалютаТипаЦен,
	//						  |				ЕСТЬNULL(КурсыВалютыЦены.Курс, 0) КАК КурсВалютыЦены,
	//						  |				ЕСТЬNULL(КурсыВалютыЦены.Кратность, 0) КАК КратностьКурсаВалютыЦены,
	//						  |				ДинамическиеЦены.БазоваяЦена КАК БазоваяЦена,
	//						  |				ДинамическиеЦены.ВалютаБазовойЦены КАК ВалютаБазовойЦены,
	//						  |				ЕСТЬNULL(КурсыВалютыБазовойЦены.Курс, 0) КАК КурсВалютыБазовойЦены,
	//						  |				ЕСТЬNULL(КурсыВалютыБазовойЦены.Кратность, 0) КАК КратностьКурсаВалютыБазовойЦены,
	//						  |				ДинамическиеЦены.ЕдиницаИзмеренияБазовойЦены КАК ЕдиницаИзмеренияБазовойЦены,
	//						  |				ЕСТЬNULL(ДиапазоныЦенДляНаценкиСрезПоследних.Цена, 0) КАК ЦенаПоДиапазону,
	//						  |				ДиапазоныЦенДляНаценкиСрезПоследних.Валюта КАК ВалютаЦеныПоДиапазону,
	//						  |				ВЫБОР
	//						  |					КОГДА ДинамическиеЦены.ТипЦен.ВалютаЦены = ДинамическиеЦены.ВалютаБазовойЦены
	//						  |						ТОГДА 1
	//						  |					ИНАЧЕ ВЫБОР
	//						  |							КОГДА ЕСТЬNULL(КурсыВалютыЦены.Курс, 0) = 1
	//						  |								ТОГДА ВЫБОР
	//						  |										КОГДА ЕСТЬNULL(КурсыВалютыБазовойЦены.Кратность, 0) = 0
	//						  |											ТОГДА 0
	//						  |										ИНАЧЕ ЕСТЬNULL(КурсыВалютыБазовойЦены.Курс, 0) / ЕСТЬNULL(КурсыВалютыБазовойЦены.Кратность, 0)
	//						  |									КОНЕЦ
	//						  |							КОГДА ЕСТЬNULL(КурсыВалютыЦены.Курс, 0) <> 1
	//						  |									И ЕСТЬNULL(КурсыВалютыБазовойЦены.Курс, 0) = 1
	//						  |								ТОГДА ВЫБОР
	//						  |										КОГДА ЕСТЬNULL(КурсыВалютыЦены.Курс, 0) = 0
	//						  |											ТОГДА 0
	//						  |										ИНАЧЕ ЕСТЬNULL(КурсыВалютыЦены.Кратность, 0) / ЕСТЬNULL(КурсыВалютыЦены.Курс, 0)
	//						  |									КОНЕЦ
	//						  |							ИНАЧЕ ВЫБОР
	//						  |									КОГДА ЕСТЬNULL(КурсыВалютыЦены.Курс, 0) * ЕСТЬNULL(КурсыВалютыБазовойЦены.Кратность, 0) = 0
	//						  |										ТОГДА 0
	//						  |									ИНАЧЕ ЕСТЬNULL(КурсыВалютыБазовойЦены.Курс, 0) * ЕСТЬNULL(КурсыВалютыЦены.Кратность, 0) / ЕСТЬNULL(КурсыВалютыЦены.Курс, 0) * ЕСТЬNULL(КурсыВалютыБазовойЦены.Кратность, 0)
	//						  |								КОНЕЦ
	//						  |						КОНЕЦ
	//						  |				КОНЕЦ КАК КоэффициентПересчетаБазовойЦены
	//						  |			ИЗ
	//						  |				(ВЫБРАТЬ
	//						  |					БазовыеЦены.ТипЦен КАК ТипЦен,
	//						  |					БазовыеЦены.Номенклатура КАК Номенклатура,
	//						  |					БазовыеЦены.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//						  |					БазовыеЦены.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	//						  |					БазовыеЦены.СпособРасчетаЦены КАК СпособРасчетаЦены,
	//						  |					БазовыеЦены.БазоваяЦена КАК БазоваяЦена,
	//						  |					БазовыеЦены.ВалютаБазовойЦены КАК ВалютаБазовойЦены,
	//						  |					БазовыеЦены.ЕдиницаИзмеренияБазовойЦены КАК ЕдиницаИзмеренияБазовойЦены,
	//						  |					МИНИМУМ(ДиапазоныЦенДляНаценкиСрезПоследних.ВерхняяГраница) КАК ВерхняяГраница
	//						  |				ИЗ
	//						  |					(ВЫБРАТЬ
	//						  |						ТипыЦенНоменклатуры.Ссылка КАК ТипЦен,
	//						  |						ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	//						  |						ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//						  |						ЦеныНоменклатурыСрезПоследних.Цена КАК БазоваяЦена,
	//						  |						ЦеныНоменклатурыСрезПоследних.Валюта КАК ВалютаБазовойЦены,
	//						  |						ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмеренияБазовойЦены,
	//						  |						ВЫБОР
	//						  |							КОГДА ПроцентыСкидкиНаценкиДинамическихЦенСрезПоследних.ПроцентСкидкиНаценки ЕСТЬ NULL 
	//						  |								ТОГДА ТипыЦенНоменклатуры.ПроцентСкидкиНаценки
	//						  |							ИНАЧЕ ПроцентыСкидкиНаценкиДинамическихЦенСрезПоследних.ПроцентСкидкиНаценки
	//						  |						КОНЕЦ КАК ПроцентСкидкиНаценки,
	//						  |						ТипыЦенНоменклатуры.СпособРасчетаЦены КАК СпособРасчетаЦены
	//						  |					ИЗ
	//						  |						Справочник.ТипыЦенНоменклатуры КАК ТипыЦенНоменклатуры
	//						  |							ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	//						  |							ПО (ТипыЦенНоменклатуры.Рассчитывается)
	//						  |								И (ЦеныНоменклатурыСрезПоследних.ТипЦен = ТипыЦенНоменклатуры.БазовыйТипЦен)
	//						  |							ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ПроцентыСкидкиНаценкиДинамическихЦенСрезПоследних
	//						  |							ПО (ПроцентыСкидкиНаценкиДинамическихЦенСрезПоследних.ТипЦен = ТипыЦенНоменклатуры.Ссылка)
	//						  |								И (ПроцентыСкидкиНаценкиДинамическихЦенСрезПоследних.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура)
	//						  |								И (ПроцентыСкидкиНаценкиДинамическихЦенСрезПоследних.ХарактеристикаНоменклатуры = ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры)
	//						  |								И (ПроцентыСкидкиНаценкиДинамическихЦенСрезПоследних.Валюта = ЦеныНоменклатурыСрезПоследних.Валюта)
	//						  |								И (ПроцентыСкидкиНаценкиДинамическихЦенСрезПоследних.ЕдиницаИзмерения = ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения)
	//						  |								И (ПроцентыСкидкиНаценкиДинамическихЦенСрезПоследних.СпособРасчетаЦены = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаЦены.ПоПроцентнойНаценкеНаБазовыйТип))
	//						  |					{ГДЕ
	//						  |						ТипыЦенНоменклатуры.Ссылка.* КАК ТипЦен}) КАК БазовыеЦены
	//						  |						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДиапазоныЦенДляНаценки.СрезПоследних КАК ДиапазоныЦенДляНаценкиСрезПоследних
	//						  |						ПО БазовыеЦены.БазоваяЦена < ДиапазоныЦенДляНаценкиСрезПоследних.ВерхняяГраница
	//						  |							И БазовыеЦены.ТипЦен = ДиапазоныЦенДляНаценкиСрезПоследних.ТипЦен
	//						  |				
	//						  |				СГРУППИРОВАТЬ ПО
	//						  |					БазовыеЦены.ХарактеристикаНоменклатуры,
	//						  |					БазовыеЦены.СпособРасчетаЦены,
	//						  |					БазовыеЦены.ТипЦен,
	//						  |					БазовыеЦены.Номенклатура,
	//						  |					БазовыеЦены.ВалютаБазовойЦены,
	//						  |					БазовыеЦены.ЕдиницаИзмеренияБазовойЦены,
	//						  |					БазовыеЦены.ПроцентСкидкиНаценки,
	//						  |					БазовыеЦены.БазоваяЦена) КАК ДинамическиеЦены
	//						  |					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДиапазоныЦенДляНаценки.СрезПоследних КАК ДиапазоныЦенДляНаценкиСрезПоследних
	//						  |					ПО ДинамическиеЦены.БазоваяЦена < ДиапазоныЦенДляНаценкиСрезПоследних.ВерхняяГраница
	//						  |						И ДинамическиеЦены.ТипЦен = ДиапазоныЦенДляНаценкиСрезПоследних.ТипЦен
	//						  |						И ДинамическиеЦены.ВерхняяГраница = ДиапазоныЦенДляНаценкиСрезПоследних.ВерхняяГраница
	//						  |					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютыЦены
	//						  |					ПО ДинамическиеЦены.ТипЦен.ВалютаЦены = КурсыВалютыЦены.Валюта
	//						  |					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютыБазовойЦены
	//						  |					ПО ДинамическиеЦены.ВалютаБазовойЦены = КурсыВалютыБазовойЦены.Валюта) КАК РасчетныеЦены
	//						  |		
	//						  |		ОБЪЕДИНИТЬ ВСЕ
	//						  |		
	//						  |		ВЫБРАТЬ
	//						  |			ЦеныНоменклатурыСрезПоследних.Номенклатура,
	//						  |			ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры,
	//						  |			ЦеныНоменклатурыСрезПоследних.ТипЦен,
	//						  |			ЦеныНоменклатурыСрезПоследних.Валюта,
	//						  |			ЦеныНоменклатурыСрезПоследних.Цена,
	//						  |			ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения
	//						  |		ИЗ
	//						  |			РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, (НЕ ТипЦен.Рассчитывается) {(ТипЦен).*}) КАК ЦеныНоменклатурыСрезПоследних) КАК ЦеныНоменклатурыСрезПоследних
	//						  |		ПО ВремНоменклатураСХарактеристиками.НоменклатураСсылка = ЦеныНоменклатурыСрезПоследних.Номенклатура
	//						  |			И ВремНоменклатураСХарактеристиками.ХарактеристикаСсылка = ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры
	//						  |
	//						  |ИНДЕКСИРОВАТЬ ПО
	//						  |	НоменклатураСсылка,
	//						  |	ХарактеристикаСсылка,
	//						  |	ТипЦенСсылка
	//						  |;
	//						  |
	//						  |////////////////////////////////////////////////////////////////////////////////
	//						  |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//						  |	ВремНоменклатураСХарактеристиками.ХарактеристикаСсылка КАК ХарактеристикаСсылка,
	//						  |	ЗначенияСвойствОбъектов.Свойство КАК СвойствоХарактеристикиСсылка,
	//						  |	ЗначенияСвойствОбъектов.Значение КАК ЗначениеСвойстваХарактеристики
	//						  |ПОМЕСТИТЬ ВремЗначенияСвойствХарактеристик
	//						  |ИЗ
	//						  |	ВремНоменклатураСХарактеристиками КАК ВремНоменклатураСХарактеристиками
	//						  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	//						  |		ПО ВремНоменклатураСХарактеристиками.ХарактеристикаСсылка = ЗначенияСвойствОбъектов.Объект
	//						  |
	//						  |ИНДЕКСИРОВАТЬ ПО
	//						  |	ХарактеристикаСсылка,
	//						  |	СвойствоХарактеристикиСсылка
	//						  |;
	//						  |
	//						  |////////////////////////////////////////////////////////////////////////////////
	//						  |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//						  |	ВремНоменклатураСХарактеристиками.НоменклатураСсылка КАК НоменклатураСсылка,
	//						  |	ВремНоменклатураСХарактеристиками.ХарактеристикаСсылка КАК ХарактеристикаСсылка,
	//						  |	Штрихкоды.Штрихкод
	//						  |ПОМЕСТИТЬ ВремШтрихКоды
	//						  |ИЗ
	//						  |	ВремНоменклатураСХарактеристиками КАК ВремНоменклатураСХарактеристиками
	//						  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
	//						  |		ПО ВремНоменклатураСХарактеристиками.НоменклатураСсылка = Штрихкоды.Владелец
	//						  |			И ВремНоменклатураСХарактеристиками.ХарактеристикаСсылка = Штрихкоды.ХарактеристикаНоменклатуры
	//						  |			И ВремНоменклатураСХарактеристиками.НоменклатураСсылка.ЕдиницаХраненияОстатков = Штрихкоды.ЕдиницаИзмерения
	//						  |
	//						  |ИНДЕКСИРОВАТЬ ПО
	//						  |	НоменклатураСсылка,
	//						  |	ХарактеристикаСсылка
	//						  |;
	//						  |
	//						  |////////////////////////////////////////////////////////////////////////////////
	//						  |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//						  |	ВремНоменклатураСХарактеристиками.НоменклатураСсылка КАК НоменклатураСсылка,
	//						  |	ЕСТЬNULL(ХранилищеДополнительнойИнформации.Ссылка, ЗНАЧЕНИЕ(Справочник.ХранилищеДополнительнойИнформации.ПустаяСсылка)) КАК ХранилищеСсылка
	//						  |ПОМЕСТИТЬ ВремФайлы
	//						  |ИЗ
	//						  |	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	//						  |		ЛЕВОЕ СОЕДИНЕНИЕ ВремНоменклатураСХарактеристиками КАК ВремНоменклатураСХарактеристиками
	//						  |		ПО (ВремНоменклатураСХарактеристиками.НоменклатураСсылка = ХранилищеДополнительнойИнформации.Объект)
	//						  |
	//						  |ИНДЕКСИРОВАТЬ ПО
	//						  |	НоменклатураСсылка
	//						  |;
	//						  |
	//						  |////////////////////////////////////////////////////////////////////////////////
	//						  |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//						  |	Товары.НоменклатураСсылка КАК НоменклатураСсылка,
	//						  |	Товары.ХарактеристикаСсылка КАК ХарактеристикаСсылка,
	//						  |	Скидки.Условие КАК Условие,
	//						  |	Скидки.ЗначениеУсловия,
	//						  |	МАКСИМУМ(Скидки.ПроцентСкидкиНаценки) КАК ПроцентСкидкиНаценки,
	//						  |	Скидки.ОграничениеСкидкиНаценки,
	//						  |	Скидки.ДатаОкончания,
	//						  |	Скидки.ПолучательСкидки КАК ПолучательСкидки,
	//						  |	Скидки.Валюта,
	//						  |	Скидки.Регистратор КАК Регистратор
	//						  |ПОМЕСТИТЬ ВремСкидки
	//						  |ИЗ
	//						  |	ВремНоменклатураСХарактеристиками КАК Товары
	//						  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	//						  |			Скидки.Условие КАК Условие,
	//						  |			Скидки.ЗначениеУсловия КАК ЗначениеУсловия,
	//						  |			Скидки.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	//						  |			Скидки.ОграничениеСкидкиНаценки КАК ОграничениеСкидкиНаценки,
	//						  |			Скидки.ДатаОкончания КАК ДатаОкончания,
	//						  |			Скидки.ПолучательСкидки КАК ПолучательСкидки,
	//						  |			Скидки.Валюта КАК Валюта,
	//						  |			Скидки.Номенклатура КАК Номенклатура,
	//						  |			Скидки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//						  |			Скидки.НоменклатураЦеноваяГруппа КАК НоменклатураЦеноваяГруппа,
	//						  |			Скидки.Регистратор КАК Регистратор
	//						  |		ИЗ
	//						  |			(ВЫБРАТЬ
	//						  |				СкидкиНаценкиНоменклатурыСрезПоследних.Условие КАК Условие,
	//						  |				СкидкиНаценкиНоменклатурыСрезПоследних.ЗначениеУсловия КАК ЗначениеУсловия,
	//						  |				СкидкиНаценкиНоменклатурыСрезПоследних.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	//						  |				СкидкиНаценкиНоменклатурыСрезПоследних.ОграничениеСкидкиНаценки КАК ОграничениеСкидкиНаценки,
	//						  |				СкидкиНаценкиНоменклатурыСрезПоследних.ДатаОкончания КАК ДатаОкончания,
	//						  |				СкидкиНаценкиНоменклатурыСрезПоследних.ПолучательСкидки КАК ПолучательСкидки,
	//						  |				СкидкиНаценкиНоменклатурыСрезПоследних.Валюта КАК Валюта,
	//						  |				СкидкиНаценкиНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	//						  |				СкидкиНаценкиНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//						  |				ЕСТЬNULL(СкидкиНаценкиНоменклатурыСрезПоследних.Номенклатура.ЦеноваяГруппа, ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)) КАК НоменклатураЦеноваяГруппа,
	//						  |				СкидкиНаценкиНоменклатурыСрезПоследних.Регистратор КАК Регистратор
	//						  |			ИЗ
	//						  |				РегистрСведений.СкидкиНаценкиНоменклатуры.СрезПоследних(
	//						  |						,
	//						  |						(ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	//						  |							ИЛИ КОНЕЦПЕРИОДА(ДатаОкончания, ДЕНЬ) >= &ТекДата)
	//						  |							И Условие В (&МассивУсловийСкидок)
	//						  |							И Качество = ЗНАЧЕНИЕ(Справочник.Качество.Новый)) КАК СкидкиНаценкиНоменклатурыСрезПоследних
	//						  |			
	//						  |			ОБЪЕДИНИТЬ ВСЕ
	//						  |			
	//						  |			ВЫБРАТЬ
	//						  |				СкидкиНаценкиПоЦеновымГруппамСрезПоследних.Условие,
	//						  |				СкидкиНаценкиПоЦеновымГруппамСрезПоследних.ЗначениеУсловия,
	//						  |				СкидкиНаценкиПоЦеновымГруппамСрезПоследних.ПроцентСкидкиНаценки,
	//						  |				СкидкиНаценкиПоЦеновымГруппамСрезПоследних.ОграничениеСкидкиНаценки,
	//						  |				СкидкиНаценкиПоЦеновымГруппамСрезПоследних.ДатаОкончания,
	//						  |				СкидкиНаценкиПоЦеновымГруппамСрезПоследних.ПолучательСкидки,
	//						  |				СкидкиНаценкиПоЦеновымГруппамСрезПоследних.Валюта,
	//						  |				ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	//						  |				ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	//						  |				СкидкиНаценкиПоЦеновымГруппамСрезПоследних.ЦеноваяГруппа,
	//						  |				СкидкиНаценкиПоЦеновымГруппамСрезПоследних.Регистратор
	//						  |			ИЗ
	//						  |				РегистрСведений.СкидкиНаценкиПоЦеновымГруппам.СрезПоследних(
	//						  |						,
	//						  |						(ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	//						  |							ИЛИ КОНЕЦПЕРИОДА(ДатаОкончания, ДЕНЬ) >= &ТекДата)
	//						  |							И Условие В (&МассивУсловийСкидок)
	//						  |							И Качество = ЗНАЧЕНИЕ(Справочник.Качество.Новый)) КАК СкидкиНаценкиПоЦеновымГруппамСрезПоследних) КАК Скидки
	//						  |		ГДЕ
	//						  |			(Скидки.ПроцентСкидкиНаценки = 0
	//						  |						И (Скидки.Условие = ЗНАЧЕНИЕ(Перечисление.УсловияСкидкиНаценки.ПоДисконтнойКарте)
	//						  |							ИЛИ Скидки.Условие = ЗНАЧЕНИЕ(Перечисление.УсловияСкидкиНаценки.ПоВидуДисконтныхКарт))
	//						  |					ИЛИ Скидки.ПроцентСкидкиНаценки <> 0)) КАК Скидки
	//						  |		ПО (Товары.НоменклатураСсылка = Скидки.Номенклатура
	//						  |					И Товары.ХарактеристикаСсылка = Скидки.ХарактеристикаНоменклатуры
	//						  |				ИЛИ Товары.НоменклатураСсылка.ЦеноваяГруппа = Скидки.НоменклатураЦеноваяГруппа
	//						  |					И Скидки.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	//						  |					И Скидки.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	//						  |				ИЛИ Скидки.НоменклатураЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
	//						  |					И Скидки.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	//						  |					И Скидки.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	//						  |
	//						  |СГРУППИРОВАТЬ ПО
	//						  |	Товары.НоменклатураСсылка,
	//						  |	Товары.ХарактеристикаСсылка,
	//						  |	Скидки.Условие,
	//						  |	Скидки.ЗначениеУсловия,
	//						  |	Скидки.ОграничениеСкидкиНаценки,
	//						  |	Скидки.ДатаОкончания,
	//						  |	Скидки.ПолучательСкидки,
	//						  |	Скидки.Валюта,
	//						  |	Скидки.Регистратор
	//						  |
	//						  |ИНДЕКСИРОВАТЬ ПО
	//						  |	НоменклатураСсылка,
	//						  |	ХарактеристикаСсылка,
	//						  |	Условие,
	//						  |	Регистратор,
	//						  |	ПолучательСкидки
	//						  |;
	//						  |
	//						  |////////////////////////////////////////////////////////////////////////////////
	//						  |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//						  |	ВремСкидки.Регистратор КАК Регистратор,
	//						  |	ВремяДействияСкидокСрезПоследних.ДеньНедели,
	//						  |	ВремяДействияСкидокСрезПоследних.ВремяНачала,
	//						  |	ВремяДействияСкидокСрезПоследних.ВремяОкончания
	//						  |ПОМЕСТИТЬ ВремСкидкиВремяДействия
	//						  |ИЗ
	//						  |	ВремСкидки КАК ВремСкидки
	//						  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВремяДействияСкидок.СрезПоследних КАК ВремяДействияСкидокСрезПоследних
	//						  |		ПО ВремСкидки.Регистратор = ВремяДействияСкидокСрезПоследних.Регистратор
	//						  |
	//						  |ИНДЕКСИРОВАТЬ ПО
	//						  |	Регистратор
	//						  |;
	//						  |
	//						  |////////////////////////////////////////////////////////////////////////////////
	//						  |ВЫБРАТЬ ПЕРВЫЕ 0
	//						  |	ВремЗначенияСвойствНоменклатуры.НоменклатураСсылка,
	//						  |	ВремЗначенияСвойствНоменклатуры.СвойствоНоменклатурыСсылка,
	//						  |	ВремЗначенияСвойствНоменклатуры.Значение
	//						  |ИЗ
	//						  |	ВремЗначенияСвойствНоменклатуры КАК ВремЗначенияСвойствНоменклатуры
	//						  |;
	//						  |
	//						  |////////////////////////////////////////////////////////////////////////////////
	//						  |ВЫБРАТЬ ПЕРВЫЕ 0
	//						  |	ВремЗначенияСвойствХарактеристик.ХарактеристикаСсылка,
	//						  |	ВремЗначенияСвойствХарактеристик.СвойствоХарактеристикиСсылка,
	//						  |	ВремЗначенияСвойствХарактеристик.ЗначениеСвойстваХарактеристики
	//						  |ИЗ
	//						  |	ВремЗначенияСвойствХарактеристик КАК ВремЗначенияСвойствХарактеристик
	//						  |;
	//						  |
	//						  |////////////////////////////////////////////////////////////////////////////////
	//						  |ВЫБРАТЬ ПЕРВЫЕ 0
	//						  |	ВремЦены.НоменклатураСсылка,
	//						  |	ВремЦены.ХарактеристикаСсылка,
	//						  |	ВремЦены.Остаток,
	//						  |	ВремЦены.ТипЦенСсылка,
	//						  |	ВремЦены.ВалютаЦеныСсылка,
	//						  |	ВремЦены.Цена,
	//						  |	ВремЦены.ЕдиницаИзмеренияЦеныСсылка
	//						  |ИЗ
	//						  |	ВремЦены КАК ВремЦены
	//						  |;
	//						  |
	//						  |////////////////////////////////////////////////////////////////////////////////
	//						  |ВЫБРАТЬ ПЕРВЫЕ 0
	//						  |	ВремШтрихКоды.НоменклатураСсылка,
	//						  |	ВремШтрихКоды.ХарактеристикаСсылка,
	//						  |	ВремШтрихКоды.Штрихкод
	//						  |ИЗ
	//						  |	ВремШтрихКоды КАК ВремШтрихКоды
	//						  |;
	//						  |
	//						  |////////////////////////////////////////////////////////////////////////////////
	//						  |ВЫБРАТЬ ПЕРВЫЕ 0
	//						  |	ВремФайлы.НоменклатураСсылка,
	//						  |	ВремФайлы.ХранилищеСсылка
	//						  |ИЗ
	//						  |	ВремФайлы КАК ВремФайлы
	//						  |;
	//						  |
	//						  |////////////////////////////////////////////////////////////////////////////////
	//						  |ВЫБРАТЬ ПЕРВЫЕ 0
	//						  |	ВремСкидки.НоменклатураСсылка,
	//						  |	ВремСкидки.ХарактеристикаСсылка,
	//						  |	ВремСкидки.Условие,
	//						  |	ВремСкидки.ЗначениеУсловия,
	//						  |	ВремСкидки.ПроцентСкидкиНаценки,
	//						  |	ВремСкидки.ОграничениеСкидкиНаценки,
	//						  |	ВремСкидки.ДатаОкончания,
	//						  |	ВремСкидки.ПолучательСкидки,
	//						  |	ВремСкидки.Валюта,
	//						  |	ВремСкидки.Регистратор
	//						  |ИЗ
	//						  |	ВремСкидки КАК ВремСкидки
	//						  |;
	//						  |
	//						  |////////////////////////////////////////////////////////////////////////////////
	//						  |ВЫБРАТЬ ПЕРВЫЕ 0
	//						  |	ВремСкидкиВремяДействия.Регистратор,
	//						  |	ВремСкидкиВремяДействия.ДеньНедели,
	//						  |	ВремСкидкиВремяДействия.ВремяНачала,
	//						  |	ВремСкидкиВремяДействия.ВремяОкончания
	//						  |ИЗ
	//						  |	ВремСкидкиВремяДействия КАК ВремСкидкиВремяДействия";
	//						  
	//ТекстЗапросаГруппыНоменклатуры =
	//						  "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//						  |	ВремНоменклатураСХарактеристиками.НоменклатураСсылка КАК НоменклатураСсылка
	//						  |ИЗ
	//						  |	ВремНоменклатураСХарактеристиками КАК ВремНоменклатураСХарактеристиками
	//						  |{УПОРЯДОЧИТЬ ПО
	//						  |	НоменклатураСсылка.* КАК Номенклатура}
	//						  |ИТОГИ ПО
	//						  |	НоменклатураСсылка ТОЛЬКО ИЕРАРХИЯ
	//						  |АВТОУПОРЯДОЧИВАНИЕ";

	//ТекстЗапросаЦеновыеГруппы =
	//						  "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//						  |	ВремНоменклатураСХарактеристиками.НоменклатураСсылка.ЦеноваяГруппа КАК ЦеноваяГруппа,
	//						  |	ВремНоменклатураСХарактеристиками.НоменклатураСсылка КАК НоменклатураСсылка
	//						  |ИЗ
	//						  |	ВремНоменклатураСХарактеристиками КАК ВремНоменклатураСХарактеристиками
	//						  |{УПОРЯДОЧИТЬ ПО
	//						  |	НоменклатураСсылка.* КАК Номенклатура}
	//						  |ИТОГИ ПО
	//						  |	ЦеноваяГруппа ИЕРАРХИЯ
	//						  |АВТОУПОРЯДОЧИВАНИЕ";
	//						  
	//Если КлассифицироватьПоЦеновымГруппам Тогда
	//	ПостроительОбъект.Текст = ПостроительОбъект.Текст + ";" + ТекстЗапросаЦеновыеГруппы;
	//Иначе
	//	ПостроительОбъект.Текст = ПостроительОбъект.Текст + ";" + ТекстЗапросаГруппыНоменклатуры;						  
	//КонецЕсли;	
							  
КонецПроцедуры

Процедура ЗаполнитьОтборПостроителя(ПостроительОбъект) Экспорт
	
	ОтборКоличество = ПостроительОбъект.Отбор.Количество();
	Для Сч = 1 По ОтборКоличество Цикл
		ПостроительОбъект.Отбор.Удалить(ОтборКоличество - Сч);
	КонецЦикла;	
	
	ПостроительОбъект.Отбор.Добавить("Номенклатура", , "Номенклатура");
		
	ПостроительОбъект.Отбор.Добавить("ТипЦен", , "Тип цен");
	ПостроительОбъект.ДоступныеПоля.ТипЦен.Представление = "Тип цен";
	
	ПостроительОбъект.Отбор.Добавить("Склад", , "Остатки по складам");
	ПостроительОбъект.ДоступныеПоля.Склад.Представление = "Остатки по складам";
	
	ПостроительОбъект.Отбор.Добавить("Остаток", , "Остаток");
	ПостроительОбъект.ДоступныеПоля.Остаток.Представление = "Остаток";
	
	ПостроительОбъект.Отбор.Добавить("СвойствоНоменклатуры", , "Свойство номенклатуры");
	ПостроительОбъект.ДоступныеПоля.СвойствоНоменклатуры.Представление = "Свойство номенклатуры";
	
	ПостроительОбъект.Отбор.Добавить("КатегорияНоменклатуры", , "Категория номенклатуры");
	ПостроительОбъект.ДоступныеПоля.КатегорияНоменклатуры.Представление = "Категория номенклатуры";
	
КонецПроцедуры

Процедура ЗаполнитьПорядокПостроителя(ПостроительОбъект) Экспорт
	
	ПорядокКоличество = ПостроительОбъект.Порядок.Количество();
	Для Сч = 1 По ПорядокКоличество Цикл
		ПостроительОбъект.Порядок.Удалить(ПорядокКоличество - Сч);
	КонецЦикла;	
	
	ПостроительОбъект.Порядок.Добавить("Номенклатура.Наименование", "НоменклатураНаименование", "Номенклатура.Наименование");
	
КонецПроцедуры

Процедура АвтоОбменССайтом(КодНастройки) Экспорт
	
	Если НЕ ЗначениеЗаполнено(КодНастройки) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаОбмена = Справочники.НастройкиОбменаССайтом.НайтиПоКоду(КодНастройки);
	
	Если НЕ ЗначениеЗаполнено(НастройкаОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	Если НастройкаОбмена.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьАвтообмен(НастройкаОбмена, Истина);
	
КонецПроцедуры



Процедура ЗаданиеОбменССайтом(КодНастройки) Экспорт
	
	Если НЕ ЗначениеЗаполнено(КодНастройки) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаОбмена = Справочники.НастройкиОбменаССайтом.НайтиПоКоду(КодНастройки);
	
	Если НЕ ЗначениеЗаполнено(НастройкаОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	Если НастройкаОбмена.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьАвтообмен(НастройкаОбмена, Истина);
	
КонецПроцедуры

Функция ПолучитьЗаказыСОплатойИОтгрузкойПоКатегориямСт(МассивИзменений, МассивЗагруженныхДокументов) Экспорт
	//!!!!!!!!!!
	Запрос = Новый Запрос();
	КоличествоЗаказовОграничения = МассивИзменений.Количество();
		
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка,
		|	ЗаказыОплатаОтгрузка.Отгружен,
		|	ЗаказыОплатаОтгрузка.Оплачен,
		//|	ЗаказыОплатаОтгрузка.ДокументОтгрузки.Дата КАК ДатаДокументаОтгрузки,
		//|	ЗаказыОплатаОтгрузка.ДокументОтгрузки.Номер КАК НомерДокументаОтгрузки,
		//|	ЗаказыОплатаОтгрузка.ДокументОплаты.Дата КАК ДатаДокументаОплаты,
		//|	ЗаказыОплатаОтгрузка.ДокументОплаты.Номер КАК НомерДокументаОплаты,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.ПометкаУдаления КАК ПометкаУдаления,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Номер КАК Номер,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Дата КАК Дата,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Проведен КАК Проведен,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.ВалютаДокумента КАК ВалютаДокумента,
		|	1 КАК КурсВзаиморасчетов,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.СуммаДокумента КАК СуммаДокумента,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Контрагент КАК Контрагент,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДатаВходящегоДокументаЭлектронногоОбмена КАК ДатаВходящегоДокументаЭлектронногоОбмена,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДатаОплаты КАК ДатаОплаты,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Комментарий КАК Комментарий,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Товары.(
		|		ЗаказСсылка.Товары.Ссылка КАК Ссылка,
		|		ЗаказСсылка.Товары.НомерСтроки КАК НомерСтроки,
		|		ЗаказСсылка.Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		0 КАК ЕдиницаИзмеренияМест,
		|		ЗаказСсылка.Товары.Количество КАК Количество,
		|		0 КАК КоличествоМест,
		|		ЗаказСсылка.Товары.Коэффициент КАК Коэффициент,
		|		ЗаказСсылка.Товары.Номенклатура КАК Номенклатура,
		|		0 КАК ПлановаяСебестоимость,
		|		ЗаказСсылка.Товары.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
		|		null КАК Размещение,
		|		ЗаказСсылка.Товары.СтавкаНДС КАК СтавкаНДС,
		|		ЗаказСсылка.Товары.Сумма КАК Сумма,
		|		ЗаказСсылка.Товары.СуммаНДС КАК СуммаНДС,
		|		null КАК ХарактеристикаНоменклатуры,
		|		ЗаказСсылка.Товары.Цена КАК Цена,
		|		0 КАК ПроцентАвтоматическихСкидок,
		|		0 КАК УсловиеАвтоматическойСкидки,
		|		0 КАК ЗначениеУсловияАвтоматическойСкидки,
		|		ЗаказСсылка.Товары.КлючСтроки КАК КлючСтроки,
		|		null КАК СерияНоменклатуры
		|	) КАК Товары,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Услуги.(
		|		ЗаказСсылка.Услуги.Ссылка КАК Ссылка,
		|		ЗаказСсылка.Услуги.НомерСтроки КАК НомерСтроки,
		|		ЗаказСсылка.Услуги.Содержание КАК Содержание,
		|		ЗаказСсылка.Услуги.Количество КАК Количество,
		|		ЗаказСсылка.Услуги.Цена КАК Цена,
		|		ЗаказСсылка.Услуги.Сумма КАК Сумма,
		|		ЗаказСсылка.Услуги.СтавкаНДС КАК СтавкаНДС,
		|		ЗаказСсылка.Услуги.СуммаНДС КАК СуммаНДС,
		|		ЗаказСсылка.Услуги.Номенклатура КАК Номенклатура,
		|		ЗаказСсылка.Услуги.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
		|		0 КАК ПроцентАвтоматическихСкидок,
		|		0 КАК УсловиеАвтоматическойСкидки,
		|		0 КАК ЗначениеУсловияАвтоматическойСкидки
		|	) КАК Услуги,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.НомерВходящегоДокументаЭлектронногоОбмена КАК НомерВходящегоДокументаЭлектронногоОбмена,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.УчитыватьНДС КАК УчитыватьНДС
		|ИЗ
		|	(ВЫБРАТЬ
		|		Заказы.ЗаказСсылка КАК ЗаказСсылка,
		|		Заказы.Отгружен КАК Отгружен,
		|		Заказы.Оплачен КАК Оплачен,
		|		МАКСИМУМ(Заказы.ДокументОтгрузки) КАК ДокументОтгрузки,
		|		МАКСИМУМ(Заказы.ДокументОплаты) КАК ДокументОплаты
		|	ИЗ
		|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			Заказ.Ссылка КАК ЗаказСсылка,
		|			null КАК Отгружен,
		|			null КАК Оплачен,
		|			null КАК ДокументОтгрузки,
		|			null КАК ДокументОплаты
		|		ИЗ
		|			Документ.ПродажаИМ КАК Заказ
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
		|				ПО (КатегорииОбъектов.Объект = Заказ.Ссылка)
		|					И (КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ЗаказСWEBСайта))
		|		ГДЕ
		|			&УсловиеОграниченияПоДокументам) КАК Заказы
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Заказы.ЗаказСсылка,
		|		Заказы.Отгружен,
		|		Заказы.Оплачен) КАК ЗаказыОплатаОтгрузка";
		
	
	Если КоличествоЗаказовОграничения > 0 Тогда
		
		Запрос.УстановитьПараметр("МассивДокументовСсылок", МассивИзменений);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", " Заказ.Ссылка В (&МассивДокументовСсылок)");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоЗаказамОстатки", "");	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоРасчетамОстатки", "");

		
		//Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоЗаказамОстатки", " ПродажаИМ В (&МассивДокументовСсылок) ");	
		//Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоРасчетамОстатки", " Сделка В (&МассивДокументовСсылок) ");
		
	Иначе	
		
		Если МассивЗагруженныхДокументов.Количество() > 0 Тогда
			Запрос.УстановитьПараметр("МассивДокументовСсылокНеВыгружать", МассивЗагруженныхДокументов);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", " НЕ (Заказ.Ссылка В (&МассивДокументовСсылокНеВыгружать))");
		Иначе	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", "ИСТИНА");
		КонецЕсли;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоЗаказамОстатки", "");	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоРасчетамОстатки", "");
		
	КонецЕсли;	
		
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаДокументов;
	
КонецФункции


//нечаева 19,11,21 +++
Функция ПолучитьЗаказыСОплатойИОтгрузкойПоКатегориям(МассивИзменений, МассивЗагруженныхДокументов) Экспорт
	//!!!!!!!!!!
	Запрос = Новый Запрос();
	КоличествоЗаказовОграничения = МассивИзменений.Количество();
		
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка КАК ЗаказСсылка,
		|	ЗаказыОплатаОтгрузка.Отгружен КАК Отгружен,
		|	ЗаказыОплатаОтгрузка.Оплачен КАК Оплачен,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.ПометкаУдаления КАК ПометкаУдаления,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Номер КАК Номер,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Дата КАК Дата,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Проведен КАК Проведен,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Валюта КАК ВалютаДокумента,
		|	1 КАК КурсВзаиморасчетов,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.СуммаДокумента КАК СуммаДокумента,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Контрагент КАК Контрагент,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДатаЗаказа КАК ДатаВходящегоДокументаЭлектронногоОбмена,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДатаОплаты КАК ДатаОплаты,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Комментарий КАК Комментарий,
		|	NULL КАК СуммаВключаетНДС,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Товары.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		Единица КАК ЕдиницаИзмерения,
		|		0 КАК ЕдиницаИзмеренияМест,
		|		Количество КАК Количество,
		|		0 КАК КоличествоМест,
		|		Коэффициент КАК Коэффициент,
		|		Номенклатура КАК Номенклатура,
		|		0 КАК ПлановаяСебестоимость,
		|		Скидка КАК ПроцентСкидкиНаценки,
		|		NULL КАК Размещение,
		|		СтавкаНДС КАК СтавкаНДС,
		|		Сумма КАК Сумма,
		|		НДС КАК СуммаНДС,
		|		NULL КАК ХарактеристикаНоменклатуры,
		|		Цена КАК Цена,
		|		0 КАК ПроцентАвтоматическихСкидок,
		|		0 КАК УсловиеАвтоматическойСкидки,
		|		0 КАК ЗначениеУсловияАвтоматическойСкидки,
		|		NULL КАК КлючСтроки,
		|		NULL КАК СерияНоменклатуры
		|	) КАК Товары,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.НомерЗаказа КАК НомерВходящегоДокументаЭлектронногоОбмена,
		|	NULL КАК УчитыватьНДС
		|ИЗ
		|	(ВЫБРАТЬ
		|		Заказы.ЗаказСсылка КАК ЗаказСсылка,
		|		Заказы.Отгружен КАК Отгружен,
		|		Заказы.Оплачен КАК Оплачен,
		|		МАКСИМУМ(Заказы.ДокументОтгрузки) КАК ДокументОтгрузки,
		|		МАКСИМУМ(Заказы.ДокументОплаты) КАК ДокументОплаты
		|	ИЗ
		|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			Заказ.Ссылка КАК ЗаказСсылка,
		|			NULL КАК Отгружен,
		|			NULL КАК Оплачен,
		|			NULL КАК ДокументОтгрузки,
		|			NULL КАК ДокументОплаты
		|		ИЗ
		|			Документ.Заказ КАК Заказ
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
		|				ПО (КатегорииОбъектов.Объект = Заказ.Ссылка)
		|					И (КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ЗаказСWEBСайта))
		|		ГДЕ
		|			&УсловиеОграниченияПоДокументам) КАК Заказы
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Заказы.ЗаказСсылка,
		|		Заказы.Отгружен,
		|		Заказы.Оплачен) КАК ЗаказыОплатаОтгрузка
		|ГДЕ
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.СостояниеСогласования В(&насогласование)
		|	И ЗаказыОплатаОтгрузка.ЗаказСсылка.ПометкаУдаления = ложь";
		
	
	Если КоличествоЗаказовОграничения > 0 Тогда
		
		Запрос.УстановитьПараметр("МассивДокументовСсылок", МассивИзменений);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", " Заказ.Ссылка В (&МассивДокументовСсылок)");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоЗаказамОстатки", "");	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоРасчетамОстатки", "");

		
		//Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоЗаказамОстатки", " ПродажаИМ В (&МассивДокументовСсылок) ");	
		//Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоРасчетамОстатки", " Сделка В (&МассивДокументовСсылок) ");
		
	Иначе	
		
		Если МассивЗагруженныхДокументов.Количество() > 0 Тогда
			Запрос.УстановитьПараметр("МассивДокументовСсылокНеВыгружать", МассивЗагруженныхДокументов);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", " НЕ (Заказ.Ссылка В (&МассивДокументовСсылокНеВыгружать))");
		Иначе	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", "ИСТИНА");
		КонецЕсли;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоЗаказамОстатки", "");	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоРасчетамОстатки", "");
		
	КонецЕсли;	
	
	СписокСостояний = новый массив;
	списоксостояний.добавить(перечисления.СостоянияСогласования.НаСогласованииКонтрагент);
	списоксостояний.добавить(перечисления.СостоянияСогласования.ОтмененЦО);
	списоксостояний.добавить(перечисления.СостоянияСогласования.согласован); //? этот статус только по обмену с сайтом....
	
	
	Запрос.УстановитьПараметр("насогласование", СписокСостояний);
	
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаДокументов;
	
КонецФункции
// нечаева 19,11,21---


//нечаева 22,11,21 +++
Функция ПолучитьЗаказыСОплатойИОтгрузкойПоКатегориямПоРегистру(МассивИзменений, МассивЗагруженныхДокументов) Экспорт
	//!!!!!!!!!!
	Запрос = Новый Запрос();
	КоличествоЗаказовОграничения = МассивИзменений.Количество();
		
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка КАК ЗаказСсылка,
		|	ЗаказыОплатаОтгрузка.Отгружен КАК Отгружен,
		|	ЗаказыОплатаОтгрузка.Оплачен КАК Оплачен,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.ПометкаУдаления КАК ПометкаУдаления,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Номер КАК Номер,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Дата КАК Дата,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Проведен КАК Проведен,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Валюта КАК ВалютаДокумента,
		|	1 КАК КурсВзаиморасчетов,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.СуммаДокумента КАК СуммаДокумента,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Контрагент КАК Контрагент,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДатаЗаказа КАК ДатаВходящегоДокументаЭлектронногоОбмена,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДатаОплаты КАК ДатаОплаты,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Комментарий КАК Комментарий,
		|	NULL КАК СуммаВключаетНДС,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Товары.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		Единица КАК ЕдиницаИзмерения,
		|		0 КАК ЕдиницаИзмеренияМест,
		|		Количество КАК Количество,
		|		0 КАК КоличествоМест,
		|		Коэффициент КАК Коэффициент,
		|		Номенклатура КАК Номенклатура,
		|		0 КАК ПлановаяСебестоимость,
		|		Скидка КАК ПроцентСкидкиНаценки,
		|		NULL КАК Размещение,
		|		СтавкаНДС КАК СтавкаНДС,
		|		Сумма КАК Сумма,
		|		НДС КАК СуммаНДС,
		|		NULL КАК ХарактеристикаНоменклатуры,
		|		Цена КАК Цена,
		|		0 КАК ПроцентАвтоматическихСкидок,
		|		0 КАК УсловиеАвтоматическойСкидки,
		|		0 КАК ЗначениеУсловияАвтоматическойСкидки,
		|		NULL КАК КлючСтроки,
		|		NULL КАК СерияНоменклатуры
		|	) КАК Товары,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.НомерЗаказа КАК НомерВходящегоДокументаЭлектронногоОбмена,
		|	NULL КАК УчитыватьНДС,
		|	РегистрацияОбменаЗаказамиb2b.НужноОтправить КАК НужноОтправить
		|ИЗ
		|	(ВЫБРАТЬ
		|		Заказы.ЗаказСсылка КАК ЗаказСсылка,
		|		Заказы.Отгружен КАК Отгружен,
		|		Заказы.Оплачен КАК Оплачен,
		|		МАКСИМУМ(Заказы.ДокументОтгрузки) КАК ДокументОтгрузки,
		|		МАКСИМУМ(Заказы.ДокументОплаты) КАК ДокументОплаты
		|	ИЗ
		|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			Заказ.Ссылка КАК ЗаказСсылка,
		|			NULL КАК Отгружен,
		|			NULL КАК Оплачен,
		|			NULL КАК ДокументОтгрузки,
		|			NULL КАК ДокументОплаты
		|		ИЗ
		|			Документ.Заказ КАК Заказ
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
		|				ПО (КатегорииОбъектов.Объект = Заказ.Ссылка)
		|					И (КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ЗаказСWEBСайта))
		|		ГДЕ
		|			&УсловиеОграниченияПоДокументам) КАК Заказы
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Заказы.ЗаказСсылка,
		|		Заказы.Отгружен,
		|		Заказы.Оплачен) КАК ЗаказыОплатаОтгрузка
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияОбменаЗаказамиb2b КАК РегистрацияОбменаЗаказамиb2b
		|		ПО ЗаказыОплатаОтгрузка.ЗаказСсылка = РегистрацияОбменаЗаказамиb2b.Документ.Ссылка
		|ГДЕ
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.СостояниеСогласования В(&насогласование)
		|	И ЗаказыОплатаОтгрузка.ЗаказСсылка.ПометкаУдаления = ЛОЖЬ
		|	И РегистрацияОбменаЗаказамиb2b.НужноОтправить = ИСТИНА";
		
	
	Если КоличествоЗаказовОграничения > 0 Тогда
		
		Запрос.УстановитьПараметр("МассивДокументовСсылок", МассивИзменений);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", " Заказ.Ссылка В (&МассивДокументовСсылок)");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоЗаказамОстатки", "");	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоРасчетамОстатки", "");

		
		//Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоЗаказамОстатки", " ПродажаИМ В (&МассивДокументовСсылок) ");	
		//Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоРасчетамОстатки", " Сделка В (&МассивДокументовСсылок) ");
		
	Иначе	
		
		Если МассивЗагруженныхДокументов.Количество() > 0 Тогда
			Запрос.УстановитьПараметр("МассивДокументовСсылокНеВыгружать", МассивЗагруженныхДокументов);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", " НЕ (Заказ.Ссылка В (&МассивДокументовСсылокНеВыгружать))");
		Иначе	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", "ИСТИНА");
		КонецЕсли;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоЗаказамОстатки", "");	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоРасчетамОстатки", "");
		
	КонецЕсли;	
	
	СписокСостояний = новый массив;
	списоксостояний.добавить(перечисления.СостоянияСогласования.НаСогласованииКонтрагент);
	списоксостояний.добавить(перечисления.СостоянияСогласования.ОтмененЦО);
	списоксостояний.добавить(перечисления.СостоянияСогласования.согласован); //? этот статус только по обмену с сайтом....
	
	
	Запрос.УстановитьПараметр("насогласование", СписокСостояний);
	
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаДокументов;
	
КонецФункции
// нечаева22,1121---



//нечаева 17,03,22 +++
Функция ПолучитьЗаказыСОплатойИОтгрузкойПоКатегориямПоРегиструЗаказыДляРНК_ст(МассивИзменений, МассивЗагруженныхДокументов) Экспорт
	
	//!!!!!!!!!!
	
	Запрос = Новый Запрос();
	КоличествоЗаказовОграничения = МассивИзменений.Количество();
	
	Запрос.Текст =  "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.Ссылка КАК ЗаказСсылка,
		|	ЗаказыОплатаОтгрузка.Отгружен КАК Отгружен,
		|	ЗаказыОплатаОтгрузка.Оплачен КАК Оплачен,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.ПометкаУдаления КАК ПометкаУдаления,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.Номер КАК Номер,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.Дата КАК Дата,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.Проведен КАК Проведен,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Валюта КАК ВалютаДокумента,
		|	1 КАК КурсВзаиморасчетов,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.СуммаДокумента КАК СуммаДокумента,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.Контрагент КАК Контрагент,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.ДатаЗаказа КАК ДатаВходящегоДокументаЭлектронногоОбмена,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.ДатаОплаты КАК ДатаОплаты,
		|	ВЫРАЗИТЬ(ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.Комментарий КАК СТРОКА(200)) КАК Комментарий,
		|	NULL КАК СуммаВключаетНДС,
		|	NULL КАК товары,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.НомерЗаказа КАК НомерВходящегоДокументаЭлектронногоОбмена,
		|	NULL КАК УчитыватьНДС
		|ИЗ
		|	(ВЫБРАТЬ
		|		Заказы.ЗаказСсылка КАК ЗаказСсылка,
		|		Заказы.Отгружен КАК Отгружен,
		|		Заказы.Оплачен КАК Оплачен,
		|		МАКСИМУМ(Заказы.ДокументОтгрузки) КАК ДокументОтгрузки,
		|		МАКСИМУМ(Заказы.ДокументОплаты) КАК ДокументОплаты
		|	ИЗ
		|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			Заказ.Ссылка КАК ЗаказСсылка,
		|			NULL КАК Отгружен,
		|			NULL КАК Оплачен,
		|			NULL КАК ДокументОтгрузки,
		|			NULL КАК ДокументОплаты
		|		ИЗ
		|			Документ.РасходнаяНакладная КАК Заказ
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
		|				ПО (КатегорииОбъектов.Объект = Заказ.Ссылка)
		|					И (КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ЗаказСWEBСайта))
		|		ГДЕ
		|			&УсловиеОграниченияПоДокументам) КАК Заказы
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Заказы.ЗаказСсылка,
		|		Заказы.Отгружен,
		|		Заказы.Оплачен) КАК ЗаказыОплатаОтгрузка";
	
//	 |				ПО (КатегорииОбъектов.Объект = Заказ.Ссылка)           // ДокОснование.

	
	
	//|//ГДЕ
		//|//	ЗаказыОплатаОтгрузка.ЗаказСсылка.СостояниеСогласования В(&насогласование)
		//|//	И ЗаказыОплатаОтгрузка.ЗаказСсылка.ПометкаУдаления = ЛОЖЬ";
		

	
	Если КоличествоЗаказовОграничения > 0 Тогда
		
		Запрос.УстановитьПараметр("МассивДокументовСсылок", МассивИзменений);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", " Заказ.Ссылка В (&МассивДокументовСсылок)");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоЗаказамОстатки", "");	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоРасчетамОстатки", "");
		
		//Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоЗаказамОстатки", " ПродажаИМ В (&МассивДокументовСсылок) ");	
		//Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоРасчетамОстатки", " Сделка В (&МассивДокументовСсылок) ");
		
	Иначе	
		
		Если МассивЗагруженныхДокументов.Количество() > 0 Тогда
			Запрос.УстановитьПараметр("МассивДокументовСсылокНеВыгружать", МассивЗагруженныхДокументов);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", " НЕ (Заказ.Ссылка В (&МассивДокументовСсылокНеВыгружать))");
		Иначе	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", "ИСТИНА");
		КонецЕсли;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоЗаказамОстатки", "");	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоРасчетамОстатки", "");
		
	КонецЕсли;	
	
	СписокСостояний = новый массив;
	списоксостояний.добавить(перечисления.СостоянияСогласования.НаСогласованииКонтрагент);
	списоксостояний.добавить(перечисления.СостоянияСогласования.ОтмененЦО);
	списоксостояний.добавить(перечисления.СостоянияСогласования.согласован); //? этот статус только по обмену с сайтом....
	
	
	Запрос.УстановитьПараметр("насогласование", СписокСостояний);
	
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаДокументов;
	
КонецФункции

Функция ПолучитьТаблицуДокументовРНК(МассивИзменений, МассивЗагруженныхДокументов,ЗаказСсылка) Экспорт
	
	//!!!!!!!!!!
	
	Запрос = Новый Запрос();
	КоличествоЗаказовОграничения = МассивИзменений.Количество();
	
	//Запрос.Текст =
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	ЗаказыОплатаОтгрузка.ЗаказСсылка КАК ЗаказСсылка,
	//	|	ЗаказыОплатаОтгрузка.Отгружен КАК Отгружен,
	//	|	ЗаказыОплатаОтгрузка.Оплачен КАК Оплачен,
	//	|	ЗаказыОплатаОтгрузка.ЗаказСсылка.ПометкаУдаления КАК ПометкаУдаления,
	//	|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Номер КАК Номер,
	//	|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Дата КАК Дата,
	//	|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Проведен КАК Проведен,
	//	|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Валюта КАК ВалютаДокумента,
	//	|	1 КАК КурсВзаиморасчетов,
	//	|	ЗаказыОплатаОтгрузка.ЗаказСсылка.СуммаДокумента КАК СуммаДокумента,
	//	|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Контрагент КАК Контрагент,
	//	|	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДатаЗаказа КАК ДатаВходящегоДокументаЭлектронногоОбмена,
	//	|	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДатаОплаты КАК ДатаОплаты,
	//	|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Комментарий КАК Комментарий,
	//	|	NULL КАК СуммаВключаетНДС,
	//	|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Товары.(
	//	|		Ссылка КАК Ссылка,
	//	|		НомерСтроки КАК НомерСтроки,
	//	|		Единица КАК ЕдиницаИзмерения,
	//	|		0 КАК ЕдиницаИзмеренияМест,
	//	|		Количество КАК Количество,
	//	|		0 КАК КоличествоМест,
	//	|		Коэффициент КАК Коэффициент,
	//	|		Номенклатура КАК Номенклатура,
	//	|		0 КАК ПлановаяСебестоимость,
	//	|		Скидка КАК ПроцентСкидкиНаценки,
	//	|		NULL КАК Размещение,
	//	|		СтавкаНДС КАК СтавкаНДС,
	//	|		Сумма КАК Сумма,
	//	|		НДС КАК СуммаНДС,
	//	|		NULL КАК ХарактеристикаНоменклатуры,
	//	|		Цена КАК Цена,
	//	|		0 КАК ПроцентАвтоматическихСкидок,
	//	|		0 КАК УсловиеАвтоматическойСкидки,
	//	|		0 КАК ЗначениеУсловияАвтоматическойСкидки,
	//	|		NULL КАК КлючСтроки,
	//	|		NULL КАК СерияНоменклатуры
	//	|	) КАК Товары,
	//	|	ЗаказыОплатаОтгрузка.ЗаказСсылка.НомерЗаказа КАК НомерВходящегоДокументаЭлектронногоОбмена,
	//	|	NULL КАК УчитыватьНДС
	//	|ИЗ
	//	|	(ВЫБРАТЬ
	//	|		Заказы.ЗаказСсылка КАК ЗаказСсылка,
	//	|		Заказы.Отгружен КАК Отгружен,
	//	|		Заказы.Оплачен КАК Оплачен,
	//	|		МАКСИМУМ(Заказы.ДокументОтгрузки) КАК ДокументОтгрузки,
	//	|		МАКСИМУМ(Заказы.ДокументОплаты) КАК ДокументОплаты
	//	|	ИЗ
	//	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|			Заказ.Ссылка КАК ЗаказСсылка,
	//	|			NULL КАК Отгружен,
	//	|			NULL КАК Оплачен,
	//	|			NULL КАК ДокументОтгрузки,
	//	|			NULL КАК ДокументОплаты
	//	|		ИЗ
	//	|			Документ.РасходнаяНакладная КАК Заказ
	//	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	//	|				ПО (КатегорииОбъектов.Объект = Заказ.Ссылка)
	//	|					И (КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ЗаказСWEBСайта)
	//	|						ИЛИ КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.СостояниеЗаказаНаWEBСайтеОтгружен))
	//	|		ГДЕ
	//	|			&УсловиеОграниченияПоДокументам) КАК Заказы
	//	|	ГДЕ
	//	|		Заказы.ЗаказСсылка.ДокОснование.Ссылка В(&выбранныйзаказ)
	//	|	
	//	|	СГРУППИРОВАТЬ ПО
	//	|		Заказы.ЗаказСсылка,
	//	|		Заказы.Отгружен,
	//	|		Заказы.Оплачен) КАК ЗаказыОплатаОтгрузка";
		//|ГДЕ
		//|	ЗаказыОплатаОтгрузка.ЗаказСсылка В(&ВыбранныйЗаказ)";
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка КАК ЗаказСсылка,
		|	ЗаказыОплатаОтгрузка.Отгружен КАК Отгружен,
		|	ЗаказыОплатаОтгрузка.Оплачен КАК Оплачен,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.ПометкаУдаления КАК ПометкаУдаления,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Номер КАК Номер,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Дата КАК Дата,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Проведен КАК Проведен,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Валюта КАК ВалютаДокумента,
		|	1 КАК КурсВзаиморасчетов,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.СуммаДокумента КАК СуммаДокумента,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Контрагент КАК Контрагент,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДатаЗаказа КАК ДатаВходящегоДокументаЭлектронногоОбмена,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДатаОплаты КАК ДатаОплаты,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Комментарий КАК Комментарий,
		|	NULL КАК СуммаВключаетНДС,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Товары.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		Единица КАК ЕдиницаИзмерения,
		|		0 КАК ЕдиницаИзмеренияМест,
		|		Количество КАК Количество,
		|		0 КАК КоличествоМест,
		|		Коэффициент КАК Коэффициент,
		|		Номенклатура КАК Номенклатура,
		|		0 КАК ПлановаяСебестоимость,
		|		Скидка КАК ПроцентСкидкиНаценки,
		|		NULL КАК Размещение,
		|		СтавкаНДС КАК СтавкаНДС,
		|		Сумма КАК Сумма,
		|		НДС КАК СуммаНДС,
		|		NULL КАК ХарактеристикаНоменклатуры,
		|		Цена КАК Цена,
		|		0 КАК ПроцентАвтоматическихСкидок,
		|		0 КАК УсловиеАвтоматическойСкидки,
		|		0 КАК ЗначениеУсловияАвтоматическойСкидки,
		|		NULL КАК КлючСтроки,
		|		NULL КАК СерияНоменклатуры
		|	) КАК Товары,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.НомерЗаказа КАК НомерВходящегоДокументаЭлектронногоОбмена,
		|	NULL КАК УчитыватьНДС
		|ИЗ
		|	(ВЫБРАТЬ
		|		Заказы.ЗаказСсылка КАК ЗаказСсылка,
		|		Заказы.Отгружен КАК Отгружен,
		|		Заказы.Оплачен КАК Оплачен,
		|		МАКСИМУМ(Заказы.ДокументОтгрузки) КАК ДокументОтгрузки,
		|		МАКСИМУМ(Заказы.ДокументОплаты) КАК ДокументОплаты
		|	ИЗ
		|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			Заказ.Ссылка КАК ЗаказСсылка,
		|			NULL КАК Отгружен,
		|			NULL КАК Оплачен,
		|			NULL КАК ДокументОтгрузки,
		|			NULL КАК ДокументОплаты
		|		ИЗ
		|			Документ.РасходнаяНакладная КАК Заказ
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
		|				ПО (КатегорииОбъектов.Объект = Заказ.Ссылка)
		|					И (КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ЗаказСWEBСайта)
		|						ИЛИ КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.СостояниеЗаказаНаWEBСайтеОтгружен))
		|		ГДЕ
		|			&УсловиеОграниченияПоДокументам) КАК Заказы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заказ.РасходныеНакладные КАК РасходныеНакладныеЗаказ
		|			ПО (РасходныеНакладныеЗаказ.Документ = Заказы.ЗаказСсылка)
		|				И (РасходныеНакладныеЗаказ.Ссылка В (&выбранныйзаказ))
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Заказы.ЗаказСсылка,
		|		Заказы.Отгружен,
		|		Заказы.Оплачен) КАК ЗаказыОплатаОтгрузка";
	

	Если КоличествоЗаказовОграничения > 0 Тогда
		
		Запрос.УстановитьПараметр("МассивДокументовСсылок", МассивИзменений);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", " Заказ.Ссылка В (&МассивДокументовСсылок)");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоЗаказамОстатки", "");	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоРасчетамОстатки", "");
			
	Иначе	
		Если МассивЗагруженныхДокументов.Количество() > 0 Тогда
			Запрос.УстановитьПараметр("МассивДокументовСсылокНеВыгружать", МассивЗагруженныхДокументов);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", " НЕ (Заказ.Ссылка В (&МассивДокументовСсылокНеВыгружать))");
		Иначе	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", "ИСТИНА");
		КонецЕсли;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоЗаказамОстатки", "");	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоРасчетамОстатки", "");
		
	КонецЕсли;	
	
	//СписокСостояний = новый массив;
	//списоксостояний.добавить(перечисления.СостоянияСогласования.НаСогласованииКонтрагент);
	//списоксостояний.добавить(перечисления.СостоянияСогласования.ОтмененЦО);
	//списоксостояний.добавить(перечисления.СостоянияСогласования.согласован); //? этот статус только по обмену с сайтом....
	//
	Запрос.УстановитьПараметр("выбранныйзаказ", ЗаказСсылка);
	
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаДокументов;
	
КонецФункции
// нечаева 17,03,22--- 


//нечаева 25,09,23 +++
Функция ПолучитьЗаказыСОплатойИОтгрузкойПоКатегориямПоРегиструЗаказыДляРНК(МассивИзменений, МассивЗагруженныхДокументов) Экспорт
	
	//!!!!!!!!!!
	
	Запрос = Новый Запрос();
	КоличествоЗаказовОграничения = МассивИзменений.Количество();
	//++Данилова Е.В. 06.12.2024
	//Запрос.Текст =  "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//                |	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.Ссылка КАК ЗаказСсылка,
	//                |	ЗаказыОплатаОтгрузка.Отгружен КАК Отгружен,
	//                |	ЗаказыОплатаОтгрузка.Оплачен КАК Оплачен,
	//                |	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.ПометкаУдаления КАК ПометкаУдаления,
	//                |	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.Номер КАК Номер,
	//                |	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.Дата КАК Дата,
	//                |	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.Проведен КАК Проведен,
	//                |	ЗаказыОплатаОтгрузка.ЗаказСсылка.Валюта КАК ВалютаДокумента,
	//                |	1 КАК КурсВзаиморасчетов,
	//                |	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.СуммаДокумента КАК СуммаДокумента,
	//                |	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.Контрагент КАК Контрагент,
	//                |	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.ДатаЗаказа КАК ДатаВходящегоДокументаЭлектронногоОбмена,
	//                |	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.ДатаОплаты КАК ДатаОплаты,
	//                |	ВЫРАЗИТЬ(ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.Комментарий КАК СТРОКА(200)) КАК Комментарий,
	//                |	NULL КАК СуммаВключаетНДС,
	//                |	NULL КАК товары,
	//                |	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.НомерЗаказа КАК НомерВходящегоДокументаЭлектронногоОбмена,
	//                |	NULL КАК УчитыватьНДС
	//                |ИЗ
	//                |	(ВЫБРАТЬ
	//                |		Заказы.ЗаказСсылка КАК ЗаказСсылка,
	//                |		Заказы.Отгружен КАК Отгружен,
	//                |		Заказы.Оплачен КАК Оплачен,
	//                |		МАКСИМУМ(Заказы.ДокументОтгрузки) КАК ДокументОтгрузки,
	//                |		МАКСИМУМ(Заказы.ДокументОплаты) КАК ДокументОплаты
	//                |	ИЗ
	//                |		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//                |			Заказ.Ссылка КАК ЗаказСсылка,
	//                |			NULL КАК Отгружен,
	//                |			NULL КАК Оплачен,
	//                |			NULL КАК ДокументОтгрузки,
	//                |			NULL КАК ДокументОплаты
	//                |		ИЗ
	//                |			Документ.РасходнаяНакладная КАК Заказ
	//                |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	//                |				ПО (КатегорииОбъектов.Объект = Заказ.Ссылка)
	//                |					И (КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ЗаказСWEBСайта))
	//                |		ГДЕ
	//                |			&УсловиеОграниченияПоДокументам) КАК Заказы
	//                |	
	//                |	СГРУППИРОВАТЬ ПО
	//                |		Заказы.ЗаказСсылка,
	//                |		Заказы.Отгружен,
	//                |		Заказы.Оплачен) КАК ЗаказыОплатаОтгрузка";
	
	Запрос.Текст =  "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |	РНКЗаказы.Ссылка КАК ЗаказСсылка,
	                |	РНКОплатаОтгрузка.Отгружен КАК Отгружен,
	                |	РНКОплатаОтгрузка.Оплачен КАК Оплачен,
	                |	ДокЗаказы.ПометкаУдаления КАК ПометкаУдаления,
	                |	ДокЗаказы.Номер КАК Номер,
	                |	ДокЗаказы.Дата КАК Дата,
	                |	ДокЗаказы.Проведен КАК Проведен,
	                |	РНКОплатаОтгрузка.РНКСсылка.Валюта КАК ВалютаДокумента,
	                |	1 КАК КурсВзаиморасчетов,
	                |	ДокЗаказы.СуммаДокумента КАК СуммаДокумента,
	                |	ДокЗаказы.Контрагент КАК Контрагент,
	                |	ДокЗаказы.ДатаЗаказа КАК ДатаВходящегоДокументаЭлектронногоОбмена,
	                |	ДокЗаказы.ДатаОплаты КАК ДатаОплаты,
	                |	ВЫРАЗИТЬ(ДокЗаказы.Комментарий КАК СТРОКА(200)) КАК Комментарий,
	                |	NULL КАК СуммаВключаетНДС,
	                |	NULL КАК товары,
	                |	ДокЗаказы.НомерЗаказа КАК НомерВходящегоДокументаЭлектронногоОбмена,
	                |	NULL КАК УчитыватьНДС
	                |ИЗ
	                |	(ВЫБРАТЬ
	                |		РНК.РНКСсылка КАК РНКСсылка,
	                |		РНК.Отгружен КАК Отгружен,
	                |		РНК.Оплачен КАК Оплачен,
	                |		МАКСИМУМ(РНК.ДокументОтгрузки) КАК ДокументОтгрузки,
	                |		МАКСИМУМ(РНК.ДокументОплаты) КАК ДокументОплаты
	                |	ИЗ
	                |		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |			РНК.Ссылка КАК РНКСсылка,
	                |			NULL КАК Отгружен,
	                |			NULL КАК Оплачен,
	                |			NULL КАК ДокументОтгрузки,
	                |			NULL КАК ДокументОплаты
	                |		ИЗ
	                |			Документ.РасходнаяНакладная КАК РНК
	                |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	                |				ПО (КатегорииОбъектов.Объект = РНК.Ссылка)
	                |					И (КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ЗаказСWEBСайта))
	                |		ГДЕ
	                |			&УсловиеОграниченияПоДокументам) КАК РНК
	                |	
	                |	СГРУППИРОВАТЬ ПО
	                |		РНК.РНКСсылка,
	                |		РНК.Отгружен,
	                |		РНК.Оплачен) КАК РНКОплатаОтгрузка
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заказ.РасходныеНакладные КАК РНКЗаказы
	                |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заказ КАК ДокЗаказы
	                |			ПО (ДокЗаказы.Ссылка = РНКЗаказы.ссылка)
	                |		ПО (РНКЗаказы.Документ = РНКОплатаОтгрузка.РНКСсылка)";
	
	//--Данилова Е.В. 06.12.2024
	
	Если КоличествоЗаказовОграничения > 0 Тогда
		
		Запрос.УстановитьПараметр("МассивДокументовСсылок", МассивИзменений);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", " Заказ.Ссылка В (&МассивДокументовСсылок)");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоЗаказамОстатки", "");	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоРасчетамОстатки", "");
		
	Иначе	
		
		Если МассивЗагруженныхДокументов.Количество() > 0 Тогда
			Запрос.УстановитьПараметр("МассивДокументовСсылокНеВыгружать", МассивЗагруженныхДокументов);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", " НЕ (Заказ.Ссылка В (&МассивДокументовСсылокНеВыгружать))");
		Иначе	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", "ИСТИНА");
		КонецЕсли;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоЗаказамОстатки", "");	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоРасчетамОстатки", "");
		
	КонецЕсли;	
	
	СписокСостояний = новый массив;
	списоксостояний.добавить(перечисления.СостоянияСогласования.НаСогласованииКонтрагент);
	списоксостояний.добавить(перечисления.СостоянияСогласования.ОтмененЦО);
	списоксостояний.добавить(перечисления.СостоянияСогласования.согласован); //? этот статус только по обмену с сайтом....
	
	
	Запрос.УстановитьПараметр("насогласование", СписокСостояний);
	
	ТаблицаДокументов1 = Запрос.Выполнить().Выгрузить();
	
	///---------------------------------------------------
	// Заполним такую же по перемещения и обьединим, если в запросе обьединять, то все виснет намертво, хз почему.
		Запрос = Новый Запрос();
	КоличествоЗаказовОграничения = МассивИзменений.Количество();
	
	Запрос.Текст =  "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.Ссылка КАК ЗаказСсылка,
	                |	ЗаказыОплатаОтгрузка.Отгружен КАК Отгружен,
	                |	ЗаказыОплатаОтгрузка.Оплачен КАК Оплачен,
	                |	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.ПометкаУдаления КАК ПометкаУдаления,
	                |	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.Номер КАК Номер,
	                |	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.Дата КАК Дата,
	                |	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.Проведен КАК Проведен,
	                |	ЗаказыОплатаОтгрузка.ЗаказСсылка.Валюта КАК ВалютаДокумента,
	                |	1 КАК КурсВзаиморасчетов,
	                |	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.СуммаДокумента КАК СуммаДокумента,
	                |	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.Контрагент КАК Контрагент,
	                |	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.ДатаЗаказа КАК ДатаВходящегоДокументаЭлектронногоОбмена,
	                |	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.ДатаОплаты КАК ДатаОплаты,
	                |	ВЫРАЗИТЬ(ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.Комментарий КАК СТРОКА(200)) КАК Комментарий,
	                |	NULL КАК СуммаВключаетНДС,
	                |	NULL КАК товары,
	                |	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДокОснование.НомерЗаказа КАК НомерВходящегоДокументаЭлектронногоОбмена,
	                |	NULL КАК УчитыватьНДС
	                |ИЗ
	                |	(ВЫБРАТЬ
	                |		Заказы.ЗаказСсылка КАК ЗаказСсылка,
	                |		Заказы.Отгружен КАК Отгружен,
	                |		Заказы.Оплачен КАК Оплачен,
	                |		МАКСИМУМ(Заказы.ДокументОтгрузки) КАК ДокументОтгрузки,
	                |		МАКСИМУМ(Заказы.ДокументОплаты) КАК ДокументОплаты
	                |	ИЗ
	                |		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |			Заказ.Ссылка КАК ЗаказСсылка,
	                |			NULL КАК Отгружен,
	                |			NULL КАК Оплачен,
	                |			NULL КАК ДокументОтгрузки,
	                |			NULL КАК ДокументОплаты
	                |		ИЗ
	                |			Документ.Перемещение КАК Заказ
	                |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	                |				ПО (КатегорииОбъектов.Объект = Заказ.Ссылка)
	                |					И (КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ЗаказСWEBСайта))
	                |		ГДЕ
	                |			&УсловиеОграниченияПоДокументам) КАК Заказы
	                |	
	                |	СГРУППИРОВАТЬ ПО
	                |		Заказы.ЗаказСсылка,
	                |		Заказы.Отгружен,
	                |		Заказы.Оплачен) КАК ЗаказыОплатаОтгрузка";
	
	
	Если КоличествоЗаказовОграничения > 0 Тогда
		
		Запрос.УстановитьПараметр("МассивДокументовСсылок", МассивИзменений);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", " Заказ.Ссылка В (&МассивДокументовСсылок)");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоЗаказамОстатки", "");	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоРасчетамОстатки", "");
			
	Иначе	
		
		Если МассивЗагруженныхДокументов.Количество() > 0 Тогда
			Запрос.УстановитьПараметр("МассивДокументовСсылокНеВыгружать", МассивЗагруженныхДокументов);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", " НЕ (Заказ.Ссылка В (&МассивДокументовСсылокНеВыгружать))");
		Иначе	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", "ИСТИНА");
		КонецЕсли;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоЗаказамОстатки", "");	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоРасчетамОстатки", "");
		
	КонецЕсли;	
	
	//СписокСостояний = новый массив;
	//списоксостояний.добавить(перечисления.СостоянияСогласования.НаСогласованииКонтрагент);
	//списоксостояний.добавить(перечисления.СостоянияСогласования.ОтмененЦО);
	//списоксостояний.добавить(перечисления.СостоянияСогласования.согласован); //? этот статус только по обмену с сайтом....
	//
	//
	//Запрос.УстановитьПараметр("насогласование", СписокСостояний);
	
	ТаблицаДокументов2 = Запрос.Выполнить().Выгрузить();
	
	//---------------------------------------
	Для каждого текстр из ТаблицаДокументов2 цикл
		новстр = ТаблицаДокументов1.Добавить();
		ЗаполнитьЗначенияСвойств(новстр,текстр);
	конецЦикла ;

	ТаблицаДокументов1.Свернуть(" ЗаказСсылка,ОТгружен,Оплачен,ПометкаУдаления,Номер,Дата,Проведен,ВАлютаДокумента,КурсВзаиморасчетов,СуммаДокумента,Контрагент,ДатаВходящегоДокументаЭлектронногоОбмена,ДатаОплаты,Комментарий,СуммаВключаетНДС,товары,НомерВходящегоДокументаЭлектронногоОбмена,УчитыватьНДС");
	
	Возврат ТаблицаДокументов1;
	
КонецФункции







//нечаева 250122 +++
Функция ПолучитьЗаказыСОплатойИОтгрузкойПоКатегориямПоРегиструДляРНК(МассивИзменений, МассивЗагруженныхДокументов) Экспорт
	
	//!!!!!!!!!!
	
	Запрос = Новый Запрос();
	КоличествоЗаказовОграничения = МассивИзменений.Количество();
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка КАК ЗаказСсылка,
		|	ЗаказыОплатаОтгрузка.Отгружен КАК Отгружен,
		|	ЗаказыОплатаОтгрузка.Оплачен КАК Оплачен,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.ПометкаУдаления КАК ПометкаУдаления,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Номер КАК Номер,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Дата КАК Дата,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Проведен КАК Проведен,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Валюта КАК ВалютаДокумента,
		|	1 КАК КурсВзаиморасчетов,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.СуммаДокумента КАК СуммаДокумента,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Контрагент КАК Контрагент,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДатаЗаказа КАК ДатаВходящегоДокументаЭлектронногоОбмена,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.ДатаОплаты КАК ДатаОплаты,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Комментарий КАК Комментарий,
		|	NULL КАК СуммаВключаетНДС,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.Товары.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		Единица КАК ЕдиницаИзмерения,
		|		0 КАК ЕдиницаИзмеренияМест,
		|		Количество КАК Количество,
		|		0 КАК КоличествоМест,
		|		Коэффициент КАК Коэффициент,
		|		Номенклатура КАК Номенклатура,
		|		0 КАК ПлановаяСебестоимость,
		|		Скидка КАК ПроцентСкидкиНаценки,
		|		NULL КАК Размещение,
		|		СтавкаНДС КАК СтавкаНДС,
		|		Сумма КАК Сумма,
		|		НДС КАК СуммаНДС,
		|		NULL КАК ХарактеристикаНоменклатуры,
		|		Цена КАК Цена,
		|		0 КАК ПроцентАвтоматическихСкидок,
		|		0 КАК УсловиеАвтоматическойСкидки,
		|		0 КАК ЗначениеУсловияАвтоматическойСкидки,
		|		NULL КАК КлючСтроки,
		|		NULL КАК СерияНоменклатуры
		|	) КАК Товары,
		|	ЗаказыОплатаОтгрузка.ЗаказСсылка.НомерЗаказа КАК НомерВходящегоДокументаЭлектронногоОбмена,
		|	NULL КАК УчитыватьНДС
		|ИЗ
		|	(ВЫБРАТЬ
		|		Заказы.ЗаказСсылка КАК ЗаказСсылка,
		|		Заказы.Отгружен КАК Отгружен,
		|		Заказы.Оплачен КАК Оплачен,
		|		МАКСИМУМ(Заказы.ДокументОтгрузки) КАК ДокументОтгрузки,
		|		МАКСИМУМ(Заказы.ДокументОплаты) КАК ДокументОплаты
		|	ИЗ
		|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			Заказ.Ссылка КАК ЗаказСсылка,
		|			NULL КАК Отгружен,
		|			NULL КАК Оплачен,
		|			NULL КАК ДокументОтгрузки,
		|			NULL КАК ДокументОплаты
		|		ИЗ
		|			Документ.РасходнаяНакладная КАК Заказ
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
		|				ПО (КатегорииОбъектов.Объект = Заказ.Ссылка)
		|					И (КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ЗаказСWEBСайта))
		|		ГДЕ
		|			&УсловиеОграниченияПоДокументам) КАК Заказы
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Заказы.ЗаказСсылка,
		|		Заказы.Отгружен,
		|		Заказы.Оплачен) КАК ЗаказыОплатаОтгрузка";
		//|//ГДЕ
		//|//	ЗаказыОплатаОтгрузка.ЗаказСсылка.СостояниеСогласования В(&насогласование)
		//|//	И ЗаказыОплатаОтгрузка.ЗаказСсылка.ПометкаУдаления = ЛОЖЬ";
		

	
	Если КоличествоЗаказовОграничения > 0 Тогда
		
		Запрос.УстановитьПараметр("МассивДокументовСсылок", МассивИзменений);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", " Заказ.Ссылка В (&МассивДокументовСсылок)");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоЗаказамОстатки", "");	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоРасчетамОстатки", "");

		
		//Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоЗаказамОстатки", " ПродажаИМ В (&МассивДокументовСсылок) ");	
		//Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоРасчетамОстатки", " Сделка В (&МассивДокументовСсылок) ");
		
	Иначе	
		
		Если МассивЗагруженныхДокументов.Количество() > 0 Тогда
			Запрос.УстановитьПараметр("МассивДокументовСсылокНеВыгружать", МассивЗагруженныхДокументов);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", " НЕ (Заказ.Ссылка В (&МассивДокументовСсылокНеВыгружать))");
		Иначе	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", "ИСТИНА");
		КонецЕсли;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоЗаказамОстатки", "");	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоРасчетамОстатки", "");
		
	КонецЕсли;	
	
	СписокСостояний = новый массив;
	списоксостояний.добавить(перечисления.СостоянияСогласования.НаСогласованииКонтрагент);
	списоксостояний.добавить(перечисления.СостоянияСогласования.ОтмененЦО);
	списоксостояний.добавить(перечисления.СостоянияСогласования.согласован); //? этот статус только по обмену с сайтом....
	
	
	Запрос.УстановитьПараметр("насогласование", СписокСостояний);
	
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаДокументов;
	
КонецФункции
// нечаева 250122---

// нечаева 31052022
Функция ВыгружатьНаСайтКонтрагентов(Номенклатура) Экспорт
	
	ВыгружатьНаСайт = "Нет";
	Запрос = новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ном.Ссылка КАК Ссылка,
	             |	ном.Код КАК Код,
	             |	ВЫБОР
	             |		КОГДА ном.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |			ТОГДА ""Да""
	             |		КОГДА ном.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |			ТОГДА ""Нет""
	             |		ИНАЧЕ ВЫБОР
	             |				КОГДА ном.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |					ТОГДА ""Да""
	             |				КОГДА ном.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |					ТОГДА ""Нет""
	             |				ИНАЧЕ ВЫБОР
	             |						КОГДА ном.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |							ТОГДА ""Да""
	             |						КОГДА ном.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |							ТОГДА ""Нет""
	             |						ИНАЧЕ ВЫБОР
	             |								КОГДА ном.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |									ТОГДА ""Да""
	             |								КОГДА ном.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |									ТОГДА ""Нет""
	             |								ИНАЧЕ ВЫБОР
	             |										КОГДА ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |											ТОГДА ""Да""
	             |										КОГДА ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |											ТОГДА ""Нет""
	             |										ИНАЧЕ ""Нет""
	             |									КОНЕЦ
	             |							КОНЕЦ
	             |					КОНЕЦ
	             |			КОНЕЦ
	             |	КОНЕЦ КАК ВыгружатьНаСайт
				 |ИЗ
	             |	Справочник.Номенклатура КАК ном
	             |ГДЕ
	             |	ном.Родитель.Родитель.Родитель <> &Пустая
	             |	И ном.ПометкаУдаления = ЛОЖЬ
	             |	И ном.Ссылка В ИЕРАРХИИ(&текгруппа)
	             |	И ВЫБОР
	             |			КОГДА ном.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |				ТОГДА ""Да""
	             |			КОГДА ном.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |				ТОГДА ""Нет""
	             |			ИНАЧЕ ВЫБОР
	             |					КОГДА ном.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |						ТОГДА ""Да""
	             |					КОГДА ном.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |						ТОГДА ""Нет""
	             |					ИНАЧЕ ВЫБОР
	             |							КОГДА ном.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |								ТОГДА ""Да""
	             |							КОГДА ном.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |								ТОГДА ""Нет""
	             |							ИНАЧЕ ВЫБОР
	             |									КОГДА ном.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |										ТОГДА ""Да""
	             |									КОГДА ном.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |										ТОГДА ""Нет""
	             |									ИНАЧЕ ВЫБОР
	             |											КОГДА ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |												ТОГДА ""Да""
	             |											КОГДА ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |												ТОГДА ""Нет""
	             |											ИНАЧЕ ""Нет""
	             |										КОНЕЦ
	             |								КОНЕЦ
	             |						КОНЕЦ
	             |				КОНЕЦ
	             |		КОНЕЦ = ""Да"" ";
	
	
	Запрос.УстановитьПараметр("текгруппа",Номенклатура);  //ложь
	Запрос.УстановитьПараметр("Пустая",ложь);  //ложь
	Выборка=Запрос.Выполнить().Выбрать();
	Если выборка.Следующий() Тогда
		
		ВыгружатьНаСайт = выборка.ВыгружатьНаСайт;
		
	КонецЕсли;	
	
	возврат ВыгружатьНаСайт;
	
КонецФункции

Функция РегистрироватьИзмененияКонтрагентовДляСайта_b2b(Ссылка,Объект) Экспорт
	
	//нечаева 02,06,22++
	Если ССылка.ЭтоГруппа = Истина ТОгда
		выгружатьНаСайт=ложь;
		возврат ложь;
	КонецЕсли;	
	//02,06,22 --
	
	ВыгружатьНаСайт = ложь;
	Если Ссылка.ведущий.выгружатьвинтернетмагазин = перечисления.ВыгружатьНаСайт.Да или Ссылка.выгружатьвинтернетмагазин = перечисления.ВыгружатьНаСайт.Да ТОгда
		выгружатьНаСайт=Истина;
	КонецЕсли;	
		
	// это к сайту b2b 
	Если ссылка.ВыгружатьВИнтернетМагазин<>Объект.ВыгружатьВИнтернетМагазин Тогда
		Выгружать=Истина;
		возврат Истина;
	КонецЕсли;	
	
	Если Не ВыгружатьНаСайт ТОгда
	
		возврат ложь;
		
	КонецЕсли;	
	
	Выгружать = Истина;
	
	
	Возврат Выгружать;
	
КонецФункции
// нечаева 31052022


Процедура НастроитьФорматыЗначений(Объект) Экспорт
	ФормаНастрйки = ПолучитьОбщуюФорму("НастройкаФорматовЗначенийДляОбменаССайтом");
	ФормаНастрйки.Объект = Объект;
	ФормаНастрйки.ОткрытьМодально();
КонецПроцедуры	

Процедура ОбработатьСтрокуТаблицыКаталогов(ДанныеСтроки, ОформлениеЯчейки) Экспорт
	
	ГруппыВыбраны = Ложь;
	
	
	
	СписокГрупп = ДанныеСтроки.Группы;
	Если ТипЗнч(СписокГрупп) = Тип("СписокЗначений") Тогда
		// удалить не группы номенклатуры
		МассивУдалить = Новый Массив;
		Для Каждого ЭлементСЗ Из СписокГрупп Цикл
			ТекГруппа = ЭлементСЗ.Значение;
			Если (НЕ ТекГруппа.ЭтоГруппа) И (ТипЗнч(ТекГруппа) = Тип("СправочникСсылка.Номенклатура")) Тогда
				МассивУдалить.Добавить(ЭлементСЗ);
			КонецЕсли;
		КонецЦикла;	
		Для Каждого ЭлементМУ Из МассивУдалить Цикл
			СписокГрупп.Удалить(ЭлементМУ);	
		КонецЦикла;
		// удалить подчиненные элементы
		МассивУдалить = Новый Массив;
		Для Каждого ЭлементСЗ Из СписокГрупп Цикл
			ТекГруппа = ЭлементСЗ.Значение;
			Для Каждого ЭлементСЗВлож Из СписокГрупп Цикл
				Если ТекГруппа.ПринадлежитЭлементу(ЭлементСЗВлож.Значение) Тогда
					МассивУдалить.Добавить(ЭлементСЗ);
					Прервать;
				КонецЕсли;	
			КонецЦикла;			
		КонецЦикла;
		Для Каждого ЭлементМУ Из МассивУдалить Цикл
			СписокГрупп.Удалить(ЭлементМУ);	
		КонецЦикла;
		Для Каждого ЭлементСЗ Из СписокГрупп Цикл
			Если ЗначениеЗаполнено(ЭлементСЗ.Значение) Тогда
				ГруппыВыбраны = Истина;
				Прервать;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
		
	
	Если НЕ ЗначениеЗаполнено(ДанныеСтроки.ИдКаталога) Тогда
		ДанныеСтроки.ИдКаталога = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
		
	
	Если ГруппыВыбраны Тогда
		ОформлениеЯчейки.Шрифт = Новый Шрифт;
	Иначе	
		ОформлениеЯчейки.Текст = "<все>";
		ОформлениеЯчейки.Шрифт = Новый Шрифт(,,,Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуКаталогов(СохраненнаяТаблицаКаталогов, ТаблицаКаталогов) Экспорт
	СохрТаблицаКаталогов = СохраненнаяТаблицаКаталогов.Получить();		
	Если ТипЗнч(СохрТаблицаКаталогов) = Тип("ТаблицаЗначений") Тогда
		Если ТаблицаКаталогов.Колонки.Количество() = 0 Тогда
			ТаблицаКаталогов = СохрТаблицаКаталогов.Скопировать();
		Иначе
			ТаблицаКаталогов.Очистить();
			Для Каждого СтрокаСТК Из СохрТаблицаКаталогов Цикл
				НовСтрокаТК = ТаблицаКаталогов.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрокаТК, СтрокаСТК);
			КонецЦикла;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

Процедура СохранитьТаблицуКаталогов(СохраненнаяТаблицаКаталогов, ТаблицаКаталогов) Экспорт
	СохраненнаяТаблицаКаталогов = Новый ХранилищеЗначения(ТаблицаКаталогов);
КонецПроцедуры	

Функция СоздатьТаблицуКаталогов() Экспорт
	
	ТаблицаКаталогов = Новый ТаблицаЗначений;
	ТаблицаКаталогов.Колонки.Добавить("Каталог");
	ТаблицаКаталогов.Колонки.Добавить("Группы");
	ТаблицаКаталогов.Колонки.Добавить("ИдКаталога");
	
	НовСтрокаТК = ТаблицаКаталогов.Добавить();
	НовСтрокаТК.Каталог = "Основной каталог товаров (СТИЛЬПАРК)";
	НовСтрокаТК.ИдКаталога = Строка(Новый УникальныйИдентификатор);
	
	Возврат ТаблицаКаталогов;
КонецФункции

Функция ГруппыВыбраны(ТаблицаКаталогов) Экспорт
	
	ГруппыВыбраны = Ложь;
	Для Каждого СтрокаТК Из ТаблицаКаталогов Цикл
		Если ТипЗнч(СтрокаТК.Группы) = Тип("СписокЗначений") Тогда
			Для Каждого Группа Из СтрокаТК.Группы Цикл
				Если ЗначениеЗаполнено(Группа.Значение) Тогда
					ГруппыВыбраны = Истина;
					Прервать;
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат ГруппыВыбраны;
	
КонецФункции

//------------------------------------------------------------------

// Функция выполняет пропорциональное распределение суммы в соответствии
// с заданными коэффициентами распределения
//
// Параметры:
//  ИсхСумма   - распределяемая сумма
//  МассивКоэф - массив коэффициентов распределения
//  Точность   - точность округления при распределении. Необязателен.
//
//Возвращает:
//  МассивСумм - массив размерностью равный массиву коэффициентов, содержит
//               суммы в соответствии с весом коэффициента (из массива коэффициентов)
//               В случае если распределить не удалось (сумма = 0, кол-во коэф. = 0,
//               или суммарный вес коэф. = 0), тогда возвращается значение Неопределено
//
Функция РаспределитьПропорционально(Знач ИсхСумма, МассивКоэф, Знач Точность = 2, ПроверкаНулевыхЗначений=Истина) Экспорт

	Если МассивКоэф.Количество() = 0 Или (ПроверкаНулевыхЗначений И ИсхСумма = 0) Или ИсхСумма = Null Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИндексМакс = 0;
	МаксЗнач   = 0;
	РаспрСумма = 0;
	СуммаКоэф  = 0;
	
	Для К = 0 По МассивКоэф.Количество() - 1 Цикл
		
		МодульЧисла = ?(МассивКоэф[К] > 0, МассивКоэф[К], - МассивКоэф[К]);
		
		Если МаксЗнач < МодульЧисла Тогда
			МаксЗнач = МодульЧисла;
			ИндексМакс = К;
		КонецЕсли;
		
		СуммаКоэф = СуммаКоэф + МассивКоэф[К];
		
	КонецЦикла;
	
	Если СуммаКоэф = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МассивСумм = Новый Массив(МассивКоэф.Количество());
	
	Для К = 0 По МассивКоэф.Количество() - 1 Цикл
		МассивСумм[К] = Окр(ИсхСумма * МассивКоэф[К] / СуммаКоэф, Точность, 1);
		РаспрСумма = РаспрСумма + МассивСумм[К];
	КонецЦикла;
	
	// Погрешности округления отнесем на коэффицент с максимальным весом
	Если Не РаспрСумма = ИсхСумма Тогда
		МассивСумм[ИндексМакс] = МассивСумм[ИндексМакс] + ИсхСумма - РаспрСумма;
	КонецЕсли;
	
	Возврат МассивСумм;

КонецФункции // РаспределитьПропорционально()

//-----------------------------------------------------------------------------


//-----------------------------------------------------------------------------

// нечаева 19,09,23+++
Функция ОпределитьПризнакЗаказаССайта(ЗаказСсылка) Экспорт
	//++Данилова Е.В. 06.12.2024
	//МассивЗаказов = Новый Массив;
	//МассивЗаказов.Добавить(ЗаказСсылка);
	Если ТипЗнч(ЗаказСсылка) = Тип("Массив") Тогда
		
		МассивЗаказов = ЗаказСсылка; 
		
	Иначе 
		
		МассивЗаказов = Новый Массив;
		МассивЗаказов.Добавить(ЗаказСсылка);
		
	КонецЕсли;
	//++Данилова Е.В. 06.12.2024
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заказ.Ссылка КАК ДокументСсылка
	|ИЗ
	|	Документ.Заказ КАК Заказ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	|		ПО (КатегорииОбъектов.Объект = Заказ.Ссылка)
	|			И (КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ЗаказСWEBСайта))
	|ГДЕ
	|	Заказ.Ссылка В(&МассивЗаказов)
	|";
	
	УстановитьПривилегированныйРежим(Истина);
	Рез = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ?(НЕ Рез.Пустой(), Истина, Ложь);
	
КонецФункции

Функция ОпределитьПризнакПРМССайта(ЗаказСсылка) Экспорт
	

	МассивЗаказов = Новый Массив;
	МассивЗаказов.Добавить(ЗаказСсылка);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПРМ.Ссылка КАК ДокументСсылка
	|ИЗ
	|	Документ.Перемещение КАК ПРМ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	|		ПО (КатегорииОбъектов.Объект = ПРМ.Ссылка)
	|ГДЕ
	|	ПРМ.Ссылка В(&МассивЗаказов)";
	
	УстановитьПривилегированныйРежим(Истина);
	Рез = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ?(НЕ Рез.Пустой(), Истина, Ложь);
	
КонецФункции

Функция ОпределитьПризнакРНКССайта(ЗаказСсылка) Экспорт
	
	МассивЗаказов = Новый Массив;
	МассивЗаказов.Добавить(ЗаказСсылка);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РНК.Ссылка КАК ДокументСсылка
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РНК
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	|		ПО (КатегорииОбъектов.Объект = РНК.Ссылка)
	|	//		И (КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ЗаказСWEBСайта))
	|ГДЕ
	|	РНК.Ссылка В(&МассивЗаказов)";
	
	УстановитьПривилегированныйРежим(Истина);
	Рез = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ?(НЕ Рез.Пустой(), Истина, Ложь);
	
КонецФункции
// нечаева 19,09,23---


//нечаева 05,04,22++
Функция ПолучитьВсеРНКПоРегиструДляВыгрузки_ст(МассивИзменений, МассивЗагруженныхДокументов) Экспорт
	
	//!!!!!!!!!!  есть как уже отгруженные, так и еще не отгруженные
	// сдесь выбираем только не отгруженные РНК, для которых надо нам выгрузить. а потмо уже будем выбирать все отгруженные до этого, и еще не переданные на сайт.
	
	Запрос = Новый Запрос();
	КоличествоЗаказовОграничения = МассивИзменений.Количество();
	
	Запрос.Текст =  "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |	ЗаказыОплатаОтгрузка.ЗаказСсылка.Ссылка КАК ЗаказСсылка,
	                |	ЗаказыОплатаОтгрузка.Отгружен КАК Отгружен,
	                |	ЗаказыОплатаОтгрузка.Оплачен КАК Оплачен,
	                |	ЗаказыОплатаОтгрузка.ЗаказСсылка.НомерЗаказа КАК НомерВходящегоДокументаЭлектронногоОбмена,
	                |	NULL КАК УчитыватьНДС
	                |ИЗ
	                |	(ВЫБРАТЬ
	                |		Заказы.ЗаказСсылка КАК ЗаказСсылка,
	                |		Заказы.Отгружен КАК Отгружен,
	                |		Заказы.Оплачен КАК Оплачен,
	                |		МАКСИМУМ(Заказы.ДокументОтгрузки) КАК ДокументОтгрузки,
	                |		МАКСИМУМ(Заказы.ДокументОплаты) КАК ДокументОплаты
	                |	ИЗ
	                |		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |			Заказ.Ссылка КАК ЗаказСсылка,
	                |			NULL КАК Отгружен,
	                |			NULL КАК Оплачен,
	                |			NULL КАК ДокументОтгрузки,
	                |			NULL КАК ДокументОплаты
	                |		ИЗ
	                |			Документ.РасходнаяНакладная КАК Заказ
	                |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	                |				ПО (КатегорииОбъектов.Объект = Заказ.Ссылка)
	                |					И (КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ЗаказСWEBСайта))
	                |		ГДЕ
	                |			&УсловиеОграниченияПоДокументам) КАК Заказы
	                |	
	                |	СГРУППИРОВАТЬ ПО
	                |		Заказы.ЗаказСсылка,
	                |		Заказы.Отгружен,
	                |		Заказы.Оплачен) КАК ЗаказыОплатаОтгрузка";
	
		

	
	Если КоличествоЗаказовОграничения > 0 Тогда
		
		Запрос.УстановитьПараметр("МассивДокументовСсылок", МассивИзменений);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", " Заказ.Ссылка В (&МассивДокументовСсылок)");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоЗаказамОстатки", "");	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоРасчетамОстатки", "");
		
		//Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоЗаказамОстатки", " ПродажаИМ В (&МассивДокументовСсылок) ");	
		//Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоРасчетамОстатки", " Сделка В (&МассивДокументовСсылок) ");
		
	Иначе	
		
		Если МассивЗагруженныхДокументов.Количество() > 0 Тогда
			Запрос.УстановитьПараметр("МассивДокументовСсылокНеВыгружать", МассивЗагруженныхДокументов);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", " НЕ (Заказ.Ссылка В (&МассивДокументовСсылокНеВыгружать))");
		Иначе	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", "ИСТИНА");
		КонецЕсли;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоЗаказамОстатки", "");	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоРасчетамОстатки", "");
		
	КонецЕсли;	
	
	
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаДокументов;
	
КонецФункции
// нечаева 05,04,22 --


//нечаева 22,09,23++
Функция ПолучитьВсеРНКПоРегиструДляВыгрузки(МассивИзменений, МассивЗагруженныхДокументов) Экспорт
	
	//!!!!!!!!!!  есть как уже отгруженные, так и еще не отгруженные
	// сдесь выбираем только не отгруженные РНК, для которых надо нам выгрузить. а потмо уже будем выбирать все отгруженные до этого, и еще не переданные на сайт.
	
	Запрос = Новый Запрос();
	КоличествоЗаказовОграничения = МассивИзменений.Количество();
	
	Запрос.Текст =  "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |	ЗаказыОплатаОтгрузка.ЗаказСсылка.Ссылка КАК ЗаказСсылка,
	                |	ЗаказыОплатаОтгрузка.Отгружен КАК Отгружен,
	                |	ЗаказыОплатаОтгрузка.Оплачен КАК Оплачен,
	                |	ЗаказыОплатаОтгрузка.ЗаказСсылка.НомерЗаказа КАК НомерВходящегоДокументаЭлектронногоОбмена,
	                |	NULL КАК УчитыватьНДС
	                |ИЗ
	                |	(ВЫБРАТЬ
	                |		Заказы.ЗаказСсылка КАК ЗаказСсылка,
	                |		Заказы.Отгружен КАК Отгружен,
	                |		Заказы.Оплачен КАК Оплачен,
	                |		МАКСИМУМ(Заказы.ДокументОтгрузки) КАК ДокументОтгрузки,
	                |		МАКСИМУМ(Заказы.ДокументОплаты) КАК ДокументОплаты
	                |	ИЗ
	                |		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |			Заказ.Ссылка КАК ЗаказСсылка,
	                |			NULL КАК Отгружен,
	                |			NULL КАК Оплачен,
	                |			NULL КАК ДокументОтгрузки,
	                |			NULL КАК ДокументОплаты
	                |		ИЗ
	                |			Документ.РасходнаяНакладная КАК Заказ
	                |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	                |				ПО (КатегорииОбъектов.Объект = Заказ.Ссылка)
	                |					И (КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ЗаказСWEBСайта))
	                |		ГДЕ
	                |			&УсловиеОграниченияПоДокументам) КАК Заказы
	                |	
	                |	СГРУППИРОВАТЬ ПО
	                |		Заказы.ЗаказСсылка,
	                |		Заказы.Отгружен,
	                |		Заказы.Оплачен
	                |	
	                |	ОБЪЕДИНИТЬ ВСЕ
	                |	
	                |	ВЫБРАТЬ
	                |		Заказы.ЗаказСсылка,
	                |		Заказы.Отгружен,
	                |		Заказы.Оплачен,
	                |		МАКСИМУМ(Заказы.ДокументОтгрузки),
	                |		МАКСИМУМ(Заказы.ДокументОплаты)
	                |	ИЗ
	                |		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |			Заказ.Ссылка КАК ЗаказСсылка,
	                |			NULL КАК Отгружен,
	                |			NULL КАК Оплачен,
	                |			NULL КАК ДокументОтгрузки,
	                |			NULL КАК ДокументОплаты
	                |		ИЗ
	                |			Документ.Перемещение КАК Заказ
	                |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	                |				ПО (КатегорииОбъектов.Объект = Заказ.Ссылка)
	                |					И (КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ЗаказСWEBСайта))
	                |		ГДЕ
	                |			&УсловиеОграниченияПоДокументам) КАК Заказы
	                |	
	                |	СГРУППИРОВАТЬ ПО
	                |		Заказы.ЗаказСсылка,
	                |		Заказы.Отгружен,
	                |		Заказы.Оплачен) КАК ЗаказыОплатаОтгрузка";
	
		

	
	Если КоличествоЗаказовОграничения > 0 Тогда
		
		Запрос.УстановитьПараметр("МассивДокументовСсылок", МассивИзменений);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", " Заказ.Ссылка В (&МассивДокументовСсылок)");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоЗаказамОстатки", "");	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоРасчетамОстатки", "");
		
		//Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоЗаказамОстатки", " ПродажаИМ В (&МассивДокументовСсылок) ");	
		//Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоРасчетамОстатки", " Сделка В (&МассивДокументовСсылок) ");
		
	Иначе	
		
		Если МассивЗагруженныхДокументов.Количество() > 0 Тогда
			Запрос.УстановитьПараметр("МассивДокументовСсылокНеВыгружать", МассивЗагруженныхДокументов);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", " НЕ (Заказ.Ссылка В (&МассивДокументовСсылокНеВыгружать))");
		Иначе	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоДокументам", "ИСТИНА");
		КонецЕсли;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоЗаказамОстатки", "");	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОграниченияПоРасчетамОстатки", "");
		
	КонецЕсли;	
	
	
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаДокументов;
	
КонецФункции
// нечаева 22,09,23 --



Функция УстановитьКатегориюДокумента(ОбъектСсылка, КатегорияСсылка, ОбъектПринадлежитКатегории) Экспорт
	
	НаборЗаписей = РегистрыСведений.КатегорииОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(ОбъектСсылка);
	НаборЗаписей.Отбор.Категория.Установить(КатегорияСсылка);
	
	Если ОбъектПринадлежитКатегории Тогда
		
		Запись = НаборЗаписей.Добавить();
		Запись.Объект = ОбъектСсылка;
		Запись.Категория = КатегорияСсылка;
		
	КонецЕсли;	
	
	Попытка
		
		НаборЗаписей.Записать();
		
	Исключение
		//СообщитьОбИсключительнойОшибке(Ложь, "Не удалось установить/снять категорию """ + КатегорияСсылка.Наименование + """ документу " + Строка(ОбъектСсылка));
		Возврат Ложь;
	КонецПопытки;
	
	
	Возврат Истина;
	
КонецФункции	

//++Данилова Е.В. 06.12.2024
Функция ПолучитьЗаказыПоРНК(Знач МассивНакладных)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ  Различные 
		|	ЗаказРасходныеНакладные.Ссылка КАК Заказ
		|ИЗ
		|	Документ.Заказ.РасходныеНакладные КАК ЗаказРасходныеНакладные
		|ГДЕ
		|	ЗаказРасходныеНакладные.Ссылка.Проведен
		|	И ЗаказРасходныеНакладные.Документ В(&МассивНакладных)";
	
	Запрос.УстановитьПараметр("МассивНакладных", МассивНакладных);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Заказ");
	

КонецФункции

//--Данилова Е.В. 06.12.2024
// нечаева 31,03,22----


//Процедура СформироватьЗаказыXDTO(Параметры, ТаблицаДанныеЗаказов, КоммерческаяИнформацияXDTO)
//	
//	СтруктураСтатистики = Параметры.СтруктураСтатистики;
//	
//	КоммерческаяИнформацияXDTO = КоммерческаяИнформация(Параметры.ДатаФормирования);
//	ПакетCML = ПакетCML();
//	
//	Для Каждого ТекСтрока Из ТаблицаДанныеЗаказов Цикл
//		
//		// Если заказ есть в списке загруженных, то его не будем выгружать
//		//
//		Если Не СтруктураСтатистики.Загружено.Найти(ТекСтрока.Заказ) = Неопределено Тогда
//			Продолжить;
//		КонецЕсли;
//		
//		
//		Если НЕ ЗначениеЗаполнено(ТекСтрока.ЗаказНомерНаСайте)
//			ИЛИ НЕ ЗначениеЗаполнено(ТекСтрока.ЗаказДатаНаСайте) Тогда
//			Продолжить;
//		КонецЕсли;
//		
//		СтруктураСтатистики.Выгружено.Добавить(ТекСтрока.Заказ);
//		
//		ДокументТип			= ПакетCML.Получить("Документ");
//		ДокументXDTO		= ФабрикаXDTO.Создать(ДокументТип);
//		
//		ДокументXDTO.Ид				= УникальныйИдентификаторОбъекта(ТекСтрока.Заказ);
//		ДокументXDTO.Номер			= ТекСтрока.ЗаказНомерНаСайте;
//		ДокументXDTO.Дата			= ТекСтрока.ЗаказДатаНаСайте;
//		ДокументXDTO.ХозОперация	= НСтр("ru ='Заказ товара'");
//		ДокументXDTO.Роль			= НСтр("ru ='Продавец'");
//		ДокументXDTO.Валюта			= ФорматНаименованияВалютыДляXDTO(ТекСтрока.ЗаказВалютаКод);
//		ДокументXDTO.Курс			= ТекСтрока.ЗаказКурс;
//		ДокументXDTO.Сумма			= ТекСтрока.ЗаказСуммаДокумента;
//		ДокументXDTO.Время			= ТекСтрока.ЗаказДатаНаСайте;
//		Если ЗначениеЗаполнено(ТекСтрока.ЗаказДатаОплаты) Тогда
//			ДокументXDTO.СрокПлатежа	= ТекСтрока.ЗаказДатаОплаты;
//		КонецЕсли;
//		
//		Комментарий = Лев(ТекСтрока.ЗаказКомментарий, 3000);
//		Если НЕ ПустаяСтрока(Комментарий) Тогда
//			ДокументXDTO.Комментарий = Комментарий;
//		КонецЕсли;
//		
//		КонтрагентыXDTO = ФабрикаXDTO.Создать(ПолучитьТипСвойстваОтТипаОбъектаXDTO(ДокументТип, "Контрагенты"));
//		
//		РеквизитыКонтрагента = ДанныеКонтрагента(ТекСтрока);
//		
//		КонтрагентXDTO = ПолучитьКонтрагентаXDTO(РеквизитыКонтрагента);
//		КонтрагентыXDTO.Контрагент.Добавить(КонтрагентXDTO);
//		
//		ДокументXDTO.Контрагенты = КонтрагентыXDTO;
//		
//		ДеревоСвойствХарактеристик = Неопределено;
//		ДобавитьТоварыЗаказаXDTO(ДокументXDTO, ТекСтрока, ДеревоСвойствХарактеристик, Параметры);
//		
//		ДобавитьЗначенияРеквизитовЗаказаXDTO(ДокументXDTO, ПакетCML, ТекСтрока, Параметры);
//		
//		КоммерческаяИнформацияXDTO.Документ.Добавить(ДокументXDTO);
//		
//	КонецЦикла;

//	
//КонецПроцедуры

