// Чирков 13.02.2024 +++
Функция НайтиПоИмени(Имя, НазначениеСвойства) Экспорт
	Результат = ПланыВидовХарактеристик.СвойстваОбъектов.ПустаяСсылка();
	
	Запрос=Новый ("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка	
	|ИЗ
	|	ПланВидовХарактеристик.СвойстваОбъектов	
	|ГДЕ
	|	НазначениеСвойства = &НазначениеСвойства
	|	И Имя = &Имя
	|";
	
	
	Запрос.УстановитьПараметр("Имя", 				Имя);
	Запрос.УстановитьПараметр("НазначениеСвойства", НазначениеСвойства);	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
		Результат = Выборка.Ссылка;	
	КонецЕсли;	 
	
	Возврат Результат;	
КонецФункции // ()
// Чирков 13.02.2024 +++