
////////////////////////////////////////////////////////////////////////////////
// ИСПОЛЬЗУЕМЫЕ СОКРАЩЕНИЯ ИМЕН ПЕРЕМЕННЫХ (АБРЕВИАТУРЫ)

//  ПКО  - правило конвертации объектов
//  ПКС  - правило конвертации свойств объектов
//  ПКГС - правило конвертации группы свойств объектов
//  ПКЗ  - правило конвертации значений объектов
//  ПВД  - правило выгрузки данных
//  ПОД  - правило очистки данных


////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПЕРЕМЕННЫЕ МОДУЛЯ ДЛЯ НАПИСАНИЯ АЛГОРИТМОВ (ОБЩИЕ ДЛЯ ВЫГРУЗКИ И ЗАГРУЗКИ)
 
Перем Конвертация  Экспорт;  // Структура свойств конвертации (Имя, Ид, обработчики событий обмена)

Перем Алгоритмы    Экспорт;  // Структура, содержащая используемые алгоритмы
Перем Запросы      Экспорт;  // Структура, содержащая используемые запросы
Перем ДопОбработки Экспорт;  // Структура, содержащая используемые внешние обработки

Перем Правила      Экспорт;  // Структура, содержащая ссылки на ПКО

Перем Менеджеры    Экспорт;  // Соответствие, содержащее поля Имя, ИмяТипа, ТипСсылкиСтрокой, Менеджер, ОбъектМД, ПКО
Перем ФайлОбмена;            // Последовательно записываемый/читаемый файл обмена

Перем ПараметрыДопОбработок Экспорт;  // Структура, содержащая параметры, используемых внешних обработок

Перем ПараметрыИнициализированы Экспорт;  // Если Истина, то необходимые параметры конвертации проинициализированы


////////////////////////////////////////////////////////////////////////////////
// ФЛАГИ НАЛИЧИЯ ГЛОБАЛЬНЫХ ОБРАБОТЧИКОВ СОБЫТИЙ

Перем ЕстьГлобальныйОбработчикПередВыгрузкойОбъекта;
Перем ЕстьГлобальныйОбработчикПослеВыгрузкиОбъекта;

Перем ЕстьГлобальныйОбработчикПередКонвертациейОбъекта;

Перем ЕстьГлобальныйОбработчикПередЗагрузкойОбъекта;
Перем ЕстьГлобальныйОбработчикПослеЗагрузкиОбъекта;

Перем ВерсияПлатформыПриемника;

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБРАБОТОК ОБМЕНА (ОБЩИЕ ДЛЯ ВЫГРУЗКИ И ЗАГРУЗКИ)

Перем одТипСтрока;                // Тип("Строка")
Перем одТипБулево;                // Тип("Булево")
Перем одТипЧисло;                 // Тип("Число")
Перем одТипДата;                  // Тип("Дата")
Перем одТипХранилищеЗначения;     // Тип("ХранилищеЗначения")
Перем одТипДвоичныеДанные;        // Тип("ДвоичныеДанные")
Перем одТипВидДвиженияНакопления; // Тип("ВидДвиженияНакопления")

Перем одТипУзлаXML_КонецЭлемента  Экспорт;
Перем одТипУзлаXML_НачалоЭлемента Экспорт;
Перем одТипУзлаXML_Текст          Экспорт;

Перем одСообщения;             // Соответствие. Ключ - код ошибки,  Значение - описание ошибки

Перем мСписокМакетовПравилОбмена Экспорт;


////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ ОБРАБОТКИ ВЫГРУЗКИ
 
Перем мСчетчикВыгруженныхОбъектов Экспорт;   // Число - счетчик выгруженных объектов
Перем мXMLДокумент;                          // Вспомогательный DOM-XML документ, используемый при создании узлов xml
Перем мТаблицаПравилКонвертацииСвойств;      // ТаблицаЗначений - шаблон для воссоздания структуры таблицы путем копирования
Перем мXMLПравила;                           // xml-Строка, содержащая описание правил обмена


////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ ОБРАБОТКИ ЗАГРУЗКИ
 
Перем мСчетчикЗагруженныхОбъектов;        // Число - счетчик загруженных объектов

Перем мАтрибутыФайлаОбмена Экспорт;       // Структура. После открытия файла 
                                          // содержит атрибуты файла обмена 
                                          // согласно формату

Перем ЗагруженныеОбъекты;                // Соответствие. Ключ - Нпп объекта в файле,
                                          // Значение - ссылка на загруженный объект
Перем ЧислоХранимыхЗагруженныхОбъектов;  // число хранимых загруженных объектов, 
                                          // после которого Соответствие ЗагруженныеОбъекты 
                                          // очищается
Перем ЗапоминатьЗагруженныеОбъекты;
Перем ИспользоватьТранзакции;
Перем КоличествоОбъектовНаТранзакцию;


Перем ТаблицаВыгружаемыхОбъектов;
Перем ДопПараметрыОбмена;
Перем ТаблицаЗагруженныхОбъектов Экспорт;

#Если Клиент Тогда

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ ДЛЯ НАПИСАНИЯ АЛГОРИТМОВ

////////////////////////////////////////////////////////////////////////////////
// РАБОТА СО СТРОКАМИ

// Разбирает строку на две части: до подстроки разделителя и после.
//
// Параметры:
//  Стр          - разбираемая строка;
//  Разделитель  - подстрока-разделитель:
//  Режим        - 0 - разделитель в возвращаемые подстроки не включается;
//                 1 - разделитель включается в левую подстроку;
//                 2 - разделитель включается в правую подстроку.
//
// Возвращаемое значение:
//  Правая часть строки - до символа-разделителя.
// 
Функция ОтделитьРазделителем(Стр, Знач Разделитель, Режим=0)

	ПраваяЧасть         = "";
	ПозРазделителя      = Найти(Стр, Разделитель);
	ДлинаРазделителя    = СтрДлина(Разделитель);
	Если ПозРазделителя > 0 Тогда
		ПраваяЧасть	 = Сред(Стр, ПозРазделителя + ?(Режим=2, 0, ДлинаРазделителя));
		Стр          = СокрЛП(Лев(Стр, ПозРазделителя - ?(Режим=1, -ДлинаРазделителя + 1, 1)));
	КонецЕсли;

	Возврат(ПраваяЧасть);

КонецФункции // ОтделитьРазделителем()

// Преобразует значения из строки в массив, используя указанный разделитель
//
// Параметры:
//  Стр            - Разбираемая строка
//  Разделитель    - подстрока разделитель
//
// Возвращаемое значение:
//  Массив значений
// 
Функция МассивИзСтроки(Знач Стр, Разделитель=",")

	Массив      = Новый Массив;
	ПраваяЧасть = ОтделитьРазделителем(Стр, Разделитель);
	
	Пока Не ПустаяСтрока(Стр) Цикл
		Массив.Добавить(СокрЛП(Стр));
		Стр         = ПраваяЧасть;
		ПраваяЧасть = ОтделитьРазделителем(Стр, Разделитель);
	КонецЦикла; 

	Возврат(Массив);
	
КонецФункции // МассивИзСтроки() 

// Разбирает строку, выделяя из нее префикс и числовую часть.
//
// Параметры:
//  Стр            - Строка. Разбираемая строка;
//  ЧисловаяЧасть  - Число. Переменная, в которую возвратится числовая часть строки;
//  Режим          - Строка. Если "Число", то возвратит числовую часть, иначе - префикс.
//
// Возвращаемое значение:
//  Префикс строки
//
Функция ПолучитьПрефиксЧислоНомера(Знач Стр, ЧисловаяЧасть = "", Режим = "")

	Стр     = СокрЛП(Стр);
	Префикс = Стр;
	Длина   = СтрДлина(Стр);

	Для Сч = 1 По Длина Цикл
		Попытка
			ЧисловаяЧасть = Число(Стр);
		Исключение
			Стр = Прав(Стр, Длина - Сч);
			Продолжить;
		КонецПопытки;

		Если (ЧисловаяЧасть > 0) И (СтрДлина(Формат(ЧисловаяЧасть, "ЧГ=0")) = Длина - Сч + 1) Тогда 
			Префикс = Лев(Префикс, Сч - 1);

			Пока Прав(Префикс, 1) = "0" Цикл
				Префикс = Лев(Префикс, СтрДлина(Префикс) - 1);
			КонецЦикла;

			Прервать;
		Иначе
			Стр = Прав(Стр, Длина - Сч);
		КонецЕсли;

		Если ЧисловаяЧасть < 0 Тогда
			ЧисловаяЧасть = - ЧисловаяЧасть
		КонецЕсли;

	КонецЦикла;

	Если Режим = "Число" Тогда
		Возврат(ЧисловаяЧасть);
	Иначе
		Возврат(Префикс);
	КонецЕсли;

КонецФункции // ПолучитьПрефиксЧислоНомера()

// Приводит номер (код) к требуемой длине. При этом выделяется префикс
// и числовая часть номера, остальное пространство между префиксом и
// номером заполняется нулями.
// Функция может быть использована в обработчиках событий, программный код 
// которых хранится в правила обмена данными. Вызывается методом Выполнить()
// Сообщение "Не обнаружено ссылок на функцию" при проверке конфигурации 
// не является ошибкой проверки конфигурации
//
// Параметры:
//  Стр          - преобразовываемая строка;
//  Длина        - требуемая длина строки.
//
// Возвращаемое значение:
//  Строка       - код или номер, приведенная к требуемой длине.
// 
Функция ПривестиНомерКДлине(Знач Стр, Длина)

	Стр             = СокрЛП(Стр);

	ЧисловаяЧасть   = "";
	Результат       = ПолучитьПрефиксЧислоНомера(Стр, ЧисловаяЧасть);

	Пока Длина - СтрДлина(Результат) - СтрДлина(Формат(ЧисловаяЧасть, "ЧГ=0")) > 0 Цикл
		Результат = Результат + "0";
	КонецЦикла;

	Результат = Результат + Формат(ЧисловаяЧасть, "ЧГ=0");

	Возврат(Результат);

КонецФункции // ПривестиНомерКДлине()

// Добавляет к префиксу номера или кода подстроку
// Функция может быть использована в обработчиках событий, программный код 
// которых хранится в правила обмена данными. Вызывается методом Выполнить()
// Сообщение "Не обнаружено ссылок на функцию" при проверке конфигурации 
// не является ошибкой проверки конфигурации
//
// Параметры:
//  Стр          - Строка. Номер или код;
//  Добавок      - добаляемая к префиксу подстрока;
//  Длина        - требуемая результрирующая длина строки;
//  Режим        - "Слева" - подстрока добавляется слева к префиксу, иначе - справа.
//
// Возвращаемое значение:
//  Строка       - номер или код, к префиксу которого добавлена указанная подстрока.
//
Функция ДобавитьКПрефиксу(Знач Стр, Добавок = "", Длина = "", Режим = "Слева")

	Стр = СокрЛП(Формат(Стр,"ЧГ=0"));

	Если ПустаяСтрока(Длина) Тогда
		Длина = СтрДлина(Стр);
	КонецЕсли;

	ЧисловаяЧасть   = "";
	Префикс         = ПолучитьПрефиксЧислоНомера(Стр, ЧисловаяЧасть);

	Если Режим = "Слева" Тогда
		Результат = СокрЛП(Добавок) + Префикс;
	Иначе
		Результат = Префикс + СокрЛП(Добавок);
	КонецЕсли;

	Пока Длина - СтрДлина(Результат) - СтрДлина(Формат(ЧисловаяЧасть, "ЧГ=0")) > 0 Цикл
		Результат = Результат + "0";
	КонецЦикла;

	Результат = Результат + Формат(ЧисловаяЧасть, "ЧГ=0");

	Возврат(Результат);

КонецФункции // ДобавитьКПрефиксу()

// Дополняет строку указанным символом до указанной длины.
//
// Параметры: 
//  Стр          - дополняемая строка;
//  Длина        - требуемая длина результирующей строки;
//  Чем          - символ, которым дополняется строка.
//
// Возвращаемое значение:
//  Строка, дополненная указанным символом до указанной длины.
//
Функция одДополнитьСтроку(Стр, Длина, Чем = " ")

	Результат = СокрЛП(Стр);
	Пока Длина - СтрДлина(Результат) > 0 Цикл
		Результат = Результат + Чем;
	КонецЦикла;

	Возврат(Результат);

КонецФункции // одДополнитьСтроку() 


////////////////////////////////////////////////////////////////////////////////
// РАБОТА С ДАННЫМИ

// Возвращает строку - имя переданного значения перечисления.
// Функция может быть использована в обработчиках событий, программный код 
// которых хранится в правила обмена данными. Вызывается методом Выполнить()
// Сообщение "Не обнаружено ссылок на функцию" при проверке конфигурации 
// не является ошибкой проверки конфигурации
//
// Параметры:
//  Значение     - значение перечисления
//
// Возвращаемое значение:
//  Строка       - имя переданного значения перечисления.
//
Функция одИмяЗначенияПеречисления(Значение)

	ОбъектМД       = Значение.Метаданные();
	ИндексЗначения = Перечисления[ОбъектМД.Имя].Индекс(Значение);

	Возврат ОбъектМД.ЗначенияПеречисления[ИндексЗначения].Имя;

КонецФункции // одИмяЗначенияПеречисления()

// Определяет заполнено ли переданное значение
//
// Параметры: 
//  Значение       - значение, заполенение которого надо проверить
//
// Возвращаемое значение:
//  Истина         - значение не заполнено, ложь - иначе.
//
Функция одПустое(Значение, ЭтоNULL=Ложь)

	Результат   = Ложь;
	ТипЗначения = ТипЗнч(Значение);

	// Сначала примитивные типы
	Если Значение = Неопределено Тогда
		Результат = Истина;
	ИначеЕсли Значение = NULL Тогда
		Результат = Истина;
		ЭтоNULL   = Истина;
	ИначеЕсли ТипЗначения = одТипСтрока Тогда
		Если СокрЛП(Значение) = "" Тогда
			Результат = Истина;
		КонецЕсли; 
	ИначеЕсли ТипЗначения = одТипЧисло Тогда
		Если Значение = 0 Тогда
			Результат = Истина;
		КонецЕсли; 
	ИначеЕсли ТипЗначения = одТипДата Тогда
		Если Значение = Дата('00010101') Тогда
			Результат = Истина;
		КонецЕсли; 
	ИначеЕсли ТипЗначения = одТипБулево Тогда
		Результат = Не Значение;
	ИначеЕсли ТипЗначения = одТипХранилищеЗначения Тогда
		Если одПустое(Значение.Получить()) Тогда
			Результат = Истина;
		КонецЕсли;
	ИначеЕсли ТипЗначения = одТипДвоичныеДанные Тогда
		Результат = Ложь;
	Иначе

		// Для остальных будем считать значение пустым, если оно равно
		// значению по умолчанию своего типа.
		Попытка
			Если Значение = Новый(ТипЗначения) Тогда
				Результат = Истина;
			КонецЕсли;
		Исключение
			Результат = Ложь;
		КонецПопытки;

	КонецЕсли; 

	Возврат Результат;

КонецФункции // одПустое()

// Возвращает объект ОписаниеТипов, содержащий указанный тип.
//
// Параметры:
//  ЗначениеТипа - строка с именем типа или значение типа Тип.
//  
// Возвращаемое значение:
//  ОписаниеТипов
//
Функция одОписаниеТипа(ЗначениеТипа)

	МассивТипов = Новый Массив;
	Если ТипЗнч(ЗначениеТипа) = одТипСтрока Тогда
		МассивТипов.Добавить(Тип(ЗначениеТипа));
	Иначе
		МассивТипов.Добавить(ЗначениеТипа);
	КонецЕсли; 
	ОписаниеТипов	= Новый ОписаниеТипов(МассивТипов);

	Возврат ОписаниеТипов;

КонецФункции // одОписаниеТипа()

// Возвращает пустое (дефолтное) значение указанного типа
//
// Параметры:
//  Тип          - строка с именем типа или значение типа Тип.
//
// Возвращаемое значение:
//  Пустое значение указанного типа.
// 
Функция одПолучитьПустоеЗначение(Тип)

	Возврат одОписаниеТипа(Тип).ПривестиЗначение(Неопределено);

КонецФункции // ПолучитьПустоеЗначение()

// Осуществляет простой поиск объекта информационной базы по указанному свойству.
//
// Параметры:
//  Менеджер       - менеджер искомого объекта;
//  Свойство       - свойство, по которому осуществляем поиск: Имя, Код, 
//                   Наименование или Имя индексируемого реквизита;
//  Значение       - значение свойства, по которому ищем объект.
//
// Возвращаемое значение:
//  Найденный объект информационной базы.
//
Функция одНайтиОбъектПоСвойству(Менеджер, Свойство, Значение)

	Если Свойство = "Имя" Тогда
		
		Возврат Менеджер[Значение];		
		
	ИначеЕсли Свойство = "Код" Тогда
		
		Возврат Менеджер.НайтиПоКоду(Значение);
		
	ИначеЕсли Свойство = "Наименование" Тогда
		
		Возврат Менеджер.НайтиПоНаименованию(Значение, ИСТИНА);
		
	ИначеЕсли Свойство = "Номер" Тогда
		
		Возврат Менеджер.НайтиПоНомеру(Значение);
		
	ИначеЕсли Свойство = "{УникальныйИдентификатор}" Тогда
		
		Ссылка = Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(Значение));
		
		Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
			
			Возврат Менеджер.ПустаяСсылка();
			
		Иначе
			
			Возврат Ссылка;
			
		КонецЕсли;
		
	ИначеЕсли Свойство = "{ИмяПредопределенногоЭлемента}" Тогда
		
		Попытка
			
			Ссылка = Менеджер[Значение];
			
		Исключение
			
			Ссылка = Менеджер.НайтиПоКоду(Значение);
			
		КонецПопытки;
		
		Возврат Ссылка;
		
	Иначе
		
		Возврат Менеджер.НайтиПоРеквизиту(Свойство, Значение);
		
	КонецЕсли; 

КонецФункции // одНайтиОбъектПоСвойству() 

// Осуществляет простой поиск объекта информационной базы по указанному свойству.
//
// Параметры:
//  Стр            - Строка - значение свойства, по которому осуществляется 
//                   поиск объект;
//  Тип            - тип искомого объекта;
//  Свойство       - Строка - имя свойства, по-которому ищем объект.
//
// Возвращаемое значение:
//  Найденный объект информационной базы
//
Функция одПолучитьЗначениеПоСтроке(Стр, Тип, Свойство = "")

	Если ПустаяСтрока(Стр) Тогда
		Возврат Новый(Тип);
	КонецЕсли; 

	Свойства = Менеджеры[Тип];

	Если Свойства = Неопределено Тогда
		ОписаниеТипов = одОписаниеТипа(Тип);
		Возврат ОписаниеТипов.ПривестиЗначение(Стр);
	КонецЕсли;

	Если ПустаяСтрока(Свойство) Тогда
		Если Свойства.ИмяТипа = "Перечисление" Тогда
			Свойство = "Имя";
		Иначе
			Свойство = "{ИмяПредопределенногоЭлемента}";
			//Свойство = "Код";
		КонецЕсли; 
	КонецЕсли; 

	Возврат одНайтиОбъектПоСвойству(Свойства.Менеджер, Свойство, Стр);

КонецФункции // одПолучитьЗначениеПоСтроке()

// Возвращает строковое представление типа значения 
//
// Параметры: 
//  ЗначениеИлиТип - произвольное значение или значение типа тип
//
// Возвращаемое значение:
//  Строка - строковое представление типа значения
//
Функция одТипЗначенияСтрокой(ЗначениеИлиТип)

	ТипЗначения	= ТипЗнч(ЗначениеИлиТип);
	
	Если ТипЗначения = Тип("Тип") Тогда
		ТипЗначения	= ЗначениеИлиТип;
	КонецЕсли; 
	
	Если (ТипЗначения = Неопределено) Или (ЗначениеИлиТип = Неопределено) Тогда
		Результат = "";
	ИначеЕсли ТипЗначения = одТипСтрока Тогда
		Результат = "Строка";
	ИначеЕсли ТипЗначения = одТипЧисло Тогда
		Результат = "Число";
	ИначеЕсли ТипЗначения = одТипДата Тогда
		Результат = "Дата";
	ИначеЕсли ТипЗначения = одТипБулево Тогда
		Результат = "Булево";
	ИначеЕсли ТипЗначения = одТипХранилищеЗначения Тогда
		Результат = "ХранилищеЗначения";
	Иначе
		Менеджер = Менеджеры[ТипЗначения];
		Если Менеджер = Неопределено Тогда
			Сообщить("Неизвестный тип:  " + Строка(ТипЗнч(ТипЗначения)));
		Иначе
			Результат = Менеджер.ТипСсылкиСтрокой;
		КонецЕсли; 
	КонецЕсли; 

	Возврат Результат;
	
КонецФункции // одТипЗначенияСтрокой()

// Возвращает XML представление объекта ОписаниеТипов
// Функция может быть использована в обработчиках событий, программный код 
// которых хранится в правила обмена данными. Вызывается методом Выполнить()
// Сообщение "Не обнаружено ссылок на функцию" при проверке конфигурации 
// не является ошибкой проверки конфигурации
//
// Параметры:
//  ОписаниеТипов  - объект ОписаниеТипов, XML представление которого требуется получить
//
// Возвращаемое значение:
//  Строка - XML представление переданного объекта ОписаниеТипов
//
Функция одПолучитьXMLПредставлениеОписанияТипов(ОписаниеТипов)

	УзелТипов = DOM_СоздатьУзел("Типы");

	Если ТипЗнч(ОписаниеТипов) = Тип("Структура") Тогда
		DOM_УстановитьАтрибут(УзелТипов, "ДопустимыйЗнак",          СокрЛП(ОписаниеТипов.ДопустимыйЗнак));
		DOM_УстановитьАтрибут(УзелТипов, "Разрядность",             СокрЛП(ОписаниеТипов.Разрядность));
		DOM_УстановитьАтрибут(УзелТипов, "РазрядностьДробнойЧасти", СокрЛП(ОписаниеТипов.РазрядностьДробнойЧасти));
		DOM_УстановитьАтрибут(УзелТипов, "Длина",                   СокрЛП(ОписаниеТипов.Длина));
		DOM_УстановитьАтрибут(УзелТипов, "ДопустимаяДлина",         СокрЛП(ОписаниеТипов.ДопустимаяДлина));
		DOM_УстановитьАтрибут(УзелТипов, "СоставДаты",              СокрЛП(ОписаниеТипов.ЧастиДаты));
		
		Для каждого СтрТип Из ОписаниеТипов.Типы Цикл
			DOM_ДобавитьЭлемент(УзелТипов, "Тип", СокрЛП(СтрТип));
		КонецЦикла;
	Иначе
		КвЧисла       = ОписаниеТипов.КвалификаторыЧисла;
		КвСтроки      = ОписаниеТипов.КвалификаторыСтроки;
		КвДаты        = ОписаниеТипов.КвалификаторыДаты;

		DOM_УстановитьАтрибут(УзелТипов, "ДопустимыйЗнак",          СокрЛП(КвЧисла.ДопустимыйЗнак));
		DOM_УстановитьАтрибут(УзелТипов, "Разрядность",             СокрЛП(КвЧисла.Разрядность));
		DOM_УстановитьАтрибут(УзелТипов, "РазрядностьДробнойЧасти", СокрЛП(КвЧисла.РазрядностьДробнойЧасти));
		DOM_УстановитьАтрибут(УзелТипов, "Длина",                   СокрЛП(КвСтроки.Длина));
		DOM_УстановитьАтрибут(УзелТипов, "ДопустимаяДлина",         СокрЛП(КвСтроки.ДопустимаяДлина));
		DOM_УстановитьАтрибут(УзелТипов, "СоставДаты",              СокрЛП(КвДаты.ЧастиДаты));

		Для каждого Тип Из ОписаниеТипов.Типы() Цикл
			DOM_ДобавитьЭлемент(УзелТипов, "Тип", одТипЗначенияСтрокой(Тип));
		КонецЦикла;
	КонецЕсли;

	Возврат(УзелТипов.XML);
	
КонецФункции // одПолучитьXMLПредставлениеОписанияТипов() 

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ОБЪЕКТОМ DOM_XML

// Создает и возвращает узел нового xml-документа
//
// Параметры:
//  Нет.
//  
// Возвращаемое значение:
//  Узел нового xml-документа
//
Функция DOM_НовыйXMLДокумент() Экспорт

    Попытка
		XML = Новый COMОбъект("Msxml2.DOMDocument.4.0");
	Исключение
	    Попытка
			XML = Новый COMОбъект("Msxml2.DOMDocument.3.0");
		Исключение
			ЗаписатьВПротоколВыполнения(4);
			ФлагОшибки = Истина;
			Возврат Неопределено;
		КонецПопытки;
	КонецПопытки;

	Возврат XML;

КонецФункции // DOM_НовыйXMLДокумент()

// Создает новый xml-узел
//
// Параметры: 
//  Имя            - Имя узла
//
// Возвращаемое значение:
//  Объект нового xml-узла
//
Функция DOM_СоздатьУзел(Имя)

	Возврат мXMLДокумент.createElement(Имя);

КонецФункции // DOM_СоздатьУзел()

// Добавляет новый xml-узел к указанному узлу-родителю
// Функция может быть использована в обработчиках событий, программный код 
// которых хранится в правила обмена данными. Вызывается методом Выполнить()
// Сообщение "Не обнаружено ссылок на функцию" при проверке конфигурации 
// не является ошибкой проверки конфигурации
//
// Параметры: 
//  УзелРодитель   - xml-узел-родитель
//  Имя            - имя добавляемого узла
//
// Возвращаемое значение:
//  Новый xml-узел, добавленный к указанному узлу-родителю
//
Функция DOM_ДобавитьУзел(УзелРодитель, Имя)

	XMLDOMNode = мXMLДокумент.createElement(Имя);
	УзелРодитель.appendChild(XMLDOMNode);
	Возврат XMLDOMNode;

КонецФункции // DOM_ДобавитьУзел()

// Копирует указанный xml-узел
// Функция может быть использована в обработчиках событий, программный код 
// которых хранится в правила обмена данными. Вызывается методом Выполнить()
// Сообщение "Не обнаружено ссылок на функцию" при проверке конфигурации 
// не является ошибкой проверки конфигурации
//
// Параметры: 
//  Узел           - копируемый узел
//
// Возвращаемое значение:
//  Новый xml - копия указанного узла
//
Функция DOM_КопироватьУзел(Узел)

	Возврат Узел.cloneNode(Истина);
	
КонецФункции // DOM_Копироватьузел() 

// Добавляет новый xml-узел к указанному узлу-родителю, устанавливает значение
//
// Параметры: 
//  УзелРодитель   - xml-узел-родитель
//  Имя            - имя добавляемого узла
//  Значение       - значение добавляемого узла
//
// Возвращаемое значение:
//  Новый xml-узел, добавленный к указанному узлу-родителю
//
Функция DOM_ДобавитьЭлемент(УзелРодитель, Имя, Значение="")

	XMLDOMElement = мXMLДокумент.createElement(Имя);
	XMLDOMElement.text = Значение;
	УзелРодитель.appendChild(XMLDOMElement);
	Возврат XMLDOMElement;

КонецФункции // DOM_ДобавитьЭлемент()

// Подчиняет xml-узел указанному узлу-родителю
// Функция может быть использована в обработчиках событий, программный код 
// которых хранится в правила обмена данными. Вызывается методом Выполнить()
// Сообщение "Не обнаружено ссылок на функцию" при проверке конфигурации 
// не является ошибкой проверки конфигурации
//
// Параметры: 
//  УзелРодитель   - xml-узел-родитель
//  Узел           - подчиняемый узел 
//
Процедура DOM_ДобавитьПодчиненный(УзелРодитель, Узел)

	УзелРодитель.appendChild(Узел);
	
КонецПроцедуры // DOM_ДобавитьПодчиненный() 

// Устанавливает атрибут указанного xml-узла
//
// Параметры: 
//  Узел           - xml-узел
//  Имя            - имя атрибута
//  Значение       - устанавливаемое значение
//
Процедура DOM_УстановитьАтрибут(Узел, Имя, Значение)

	Узел.setAttribute(Имя, XMLСтрока(Значение));
	
КонецПроцедуры // DOM_УстановитьАтрибут()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ОБЪЕКТОМ XMLЗапись

// Создает новый xml-узел
// Функция может быть использована в обработчиках событий, программный код 
// которых хранится в правила обмена данными. Вызывается методом Выполнить()
//
// Параметры: 
//  Имя            - Имя узла
//
// Возвращаемое значение:
//  Объект нового xml-узла
//
Функция СоздатьУзел(Имя)

	ЗаписьXML = Новый ЗаписьXML;
	//ЗаписьXML.Отступ = Истина;
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьНачалоЭлемента(Имя);

	Возврат ЗаписьXML;

КонецФункции // СоздатьУзел()

// Добавляет новый xml-узел к указанному узлу-родителю
// Функция может быть использована в обработчиках событий, программный код 
// которых хранится в правила обмена данными. Вызывается методом Выполнить()
// Сообщение "Не обнаружено ссылок на функцию" при проверке конфигурации 
// не является ошибкой проверки конфигурации
//
// Параметры: 
//  УзелРодитель   - xml-узел-родитель
//  Имя            - имя добавляемого узла
//
// Возвращаемое значение:
//  Новый xml-узел, добавленный к указанному узлу-родителю
//
Функция ДобавитьУзел(УзелРодитель, Имя)

	УзелРодитель.ЗаписатьНачалоЭлемента(Имя);

	Возврат УзелРодитель;

КонецФункции // ДобавитьУзел()

// Копирует указанный xml-узел
// Функция может быть использована в обработчиках событий, программный код 
// которых хранится в правила обмена данными. Вызывается методом Выполнить()
// Сообщение "Не обнаружено ссылок на функцию" при проверке конфигурации 
// не является ошибкой проверки конфигурации
//
// Параметры: 
//  Узел           - копируемый узел
//
// Возвращаемое значение:
//  Новый xml - копия указанного узла
//
Функция КопироватьУзел(Узел)

	Стр = Узел.Закрыть();

	ЗаписьXML = Новый ЗаписьXML;
	//ЗаписьXML.Отступ = Истина;
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьБезОбработки(Стр);

	Возврат ЗаписьXML;
	
КонецФункции // Копироватьузел() 

// Осуществляет запись элемента и его значения в указанный объект
//
// Параметры:
//  Объект         - объект типа XMLЗапись
//  Имя            - Строка. Имя элемента
//  Значение       - Значение элемента
// 
Процедура одЗаписатьЭлемент(Объект, Имя, Значение="")

	Объект.ЗаписатьНачалоЭлемента(Имя);
	Объект.ЗаписатьТекст(XMLСтрока(Значение));
	Объект.ЗаписатьКонецЭлемента();
	
КонецПроцедуры // одЗаписатьЭлемент() 

// Подчиняет xml-узел указанному узлу-родителю
//
// Параметры: 
//  УзелРодитель   - xml-узел-родитель
//  Узел           - подчиняемый узел 
//
Процедура ДобавитьПодчиненный(УзелРодитель, Узел)

	Если ТипЗнч(Узел) = одТипСтрока Тогда
		УзелРодитель.ЗаписатьБезОбработки(Узел);
	Иначе
		Узел.ЗаписатьКонецЭлемента();
	    УзелРодитель.ЗаписатьБезОбработки(Узел.Закрыть());
	КонецЕсли; 
	
	//УзелРодитель.appendChild(Узел);
	
КонецПроцедуры // ДобавитьПодчиненный() 

// Устанавливает атрибут указанного xml-узла
//
// Параметры: 
//  Узел           - xml-узел
//  Имя            - имя атрибута
//  Значение       - устанавливаемое значение
//
Процедура УстановитьАтрибут(Узел, Имя, Значение)

	Узел.ЗаписатьАтрибут(Имя, XMLСтрока(Значение));
	
КонецПроцедуры // УстановитьАтрибут()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ОБЪЕКТОМ XMLЧтение

// Читает значение атрибута по имени из указанного объекта, приводит значение
// к указанному примитивному типу
//
// Параметры:
//  Объект      - объект типа XMLЧтение, спозиционированный на начале элемента,
//                атрибут которого требуется получить
//  Тип         - Значение типа Тип. Тип атрибута
//  Имя         - Строка. Имя атрибута
//
// Возвращаемое значение:
//  Значение атрибута полученное по имени и приведенное к указанному типу
// 
Функция одАтрибут(Объект, Тип, Имя)

	СтрЗначение = СокрП(Объект.ПолучитьАтрибут(Имя));
	Если Не ПустаяСтрока(СтрЗначение) Тогда
		Возврат XMLЗначение(Тип, СтрЗначение);
	Иначе
		Если      Тип = одТипСтрока Тогда
			Возврат ""; 
		ИначеЕсли Тип = одТипБулево Тогда
			Возврат Ложь;
		ИначеЕсли Тип = одТипЧисло Тогда
			Возврат 0;
		ИначеЕсли Тип = одТипДата Тогда
			Возврат Дата("01.01.0001 00:00:00");
		КонецЕсли; 
	КонецЕсли; 
	
КонецФункции // одАтрибут() 
 
// Пропускает узлы xml до конца указанного элемента (по умолчанию текущего)
//
// Параметры:
//  Объект   - объект типа XMLЧтение
//  Имя      - имя узла, до конца которого пропускаем элементы
// 
Процедура одПропустить(Объект, Имя="")

	КолвоВложений = 0; // количество одноименных вложений

	Если Имя = "" Тогда
		
		Имя = Объект.ЛокальноеИмя;
		
	КонецЕсли; 
	
	Пока Объект.Прочитать() Цикл
		
		ИмяУзла = Объект.ЛокальноеИмя;
		ТипУзла = Объект.ТипУзла;
		
		Если ИмяУзла = Имя Тогда
			
			Если ТипУзла = одТипУзлаXML_КонецЭлемента Тогда
				
				Если КолвоВложений = 0 Тогда
					
					Прервать;
					
				Иначе
					
					КолвоВложений = КолвоВложений - 1;
					
				КонецЕсли;
				
			ИначеЕсли ТипУзла = одТипУзлаXML_НачалоЭлемента Тогда
				
				КолвоВложений = КолвоВложений + 1;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // одПропустить() 

// Читает текст элемента и приводит значение к указанному типу
//
// Параметры:
//  Объект           - объект типа XMLЧтение, из которого осуществлется чтение
//  Тип              - тип получаемого значения
//  ИскатьПоСвойству - для ссылочных типов может быть указано свойство, по которому
//                     следует искать объект: "Код", "Наименование", <ИмяРеквизита>, "Имя" (предопределенного значения)
//
// Возвращаемое значение:
//  Значение xml-элемента, приведенное к соответствующему типу
//
Функция одЗначениеЭлемента(Объект, Тип, ИскатьПоСвойству="")

	Значение = "";
	Имя      = Объект.ЛокальноеИмя;

	Пока Объект.Прочитать() Цикл
		
		ИмяУзла = Объект.ЛокальноеИмя;
		ТипУзла = Объект.ТипУзла;
		
		Если ТипУзла = одТипУзлаXML_Текст Тогда
			
			Значение = СокрП(Объект.Значение);
			
		ИначеЕсли (ИмяУзла = Имя) И (ТипУзла = одТипУзлаXML_КонецЭлемента) Тогда
			
			Прервать;
			
		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЦикла;

	
	Если (Тип = одТипСтрока) ИЛИ (Тип = одТипБулево) ИЛИ (Тип = одТипЧисло) ИЛИ (Тип = одТипДата) ИЛИ (Тип = одТипХранилищеЗначения) ИЛИ (Тип = одТипВидДвиженияНакопления) Тогда
		
		Попытка
			Возврат XMLЗначение(Тип, Значение);
		Исключение
			Сообщить("Ошибка разбора XML !!! Строка: """+Значение+""" ! Тип: "+Тип,СтатусСообщения.ОченьВажное);
			Возврат "";
		КонецПопытки;	
		
	Иначе
		
		Возврат одПолучитьЗначениеПоСтроке(Значение, Тип, ИскатьПоСвойству);
		
	КонецЕсли; 
	
КонецФункции // одЗначениеЭлемента() 


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ФАЙЛОМ ОБМЕНА И ПРОТОКОЛОМ ВЫПОЛНЕНИЯ ВЫГРУЗКИ

// Сохраняет в файл указанный xml-узел
//
// Параметры:
//  Узел           - xml-узел, сохранямый в файл
//
Процедура ЗаписатьВФайл(Узел)

	Если ТипЗнч(Узел) <> одТипСтрока Тогда
		ФайлОбмена.ЗаписатьСтроку(Узел.Закрыть());
	Иначе
		ФайлОбмена.ЗаписатьСтроку(Узел);
	КонецЕсли;
	
КонецПроцедуры // ЗаписатьВФайл()

// Возвращает объект типа структура, содержащий все возможные поля
// записи протокола выполнения (сообщения об ошибкахи и т.п.)
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Объект типа структура
// 
Функция ПолучитьСтруктуруЗаписиПротокола()

	Возврат Новый Структура("ИмяПКО,ИмяПОД,Нпп,Источник,ТипОбъекта,Свойство,Значение,ТипЗначения,ПКО,ПКС,ПКГС,ПВД,ПОД,Объект,СвойствоПриемника,КонвертируемоеЗначение,Обработчик,ОписаниеОшибки,ПозицияМодуля,Текст,КодСообщения");
	
КонецФункции // ПолучитьСтруктуруЗаписиПротокола() 

// Сохраняет в протокол выполнения (или выводит на экран) сообщения указанной структуры
//
// Параметры:
//  Код               - Число. Код сообщения
//  СтруктураЗаписи   - Структура. Структура записи протокола
//  ВзвестиФлагОшибок - Если истина, то - это сообщение об ошибке. Взводится ФлагОшибки
// 
Процедура ЗаписатьВПротоколВыполнения(Код="", СтруктураЗаписи=Неопределено, ВзвестиФлагОшибок=Истина, Уровень=0, Выравнивание=22) Экспорт

	Отступ = "";
    Для Сч = 0 По Уровень-1 Цикл
		Отступ = Отступ + Символы.Таб;
	КонецЦикла; 
	
	Если ТипЗнч(Код) = одТипЧисло Тогда
		Стр = одСообщения[Код];
	Иначе
		Стр = Строка(Код);
	КонецЕсли;

	Стр = Отступ + Стр;
	
	Если СтруктураЗаписи <> Неопределено Тогда
		Для каждого Поле Из СтруктураЗаписи Цикл
			Значение = Поле.Значение;
			Если Значение = Неопределено Тогда
				Продолжить;
			КонецЕсли; 
			Ключ = Поле.Ключ;
			Стр  = Стр + Символы.ПС + Отступ + Символы.Таб + одДополнитьСтроку(Поле.Ключ, Выравнивание) + " =  " + Строка(Значение);
		КонецЦикла;
	КонецЕсли;

	
	Если ВзвестиФлагОшибок Тогда
		ФлагОшибки = Истина;
		Сообщить(Символы.ПС + Стр, СтатусСообщения.ОченьВажное);
	Иначе
		Сообщить(Символы.ПС + Стр, СтатусСообщения.Информация);
	КонецЕсли; 
	
КонецПроцедуры // ЗаписатьВПротоколВыполнения()

// Добавляет поле описания атрибута согласно синтаксису языка xml
//
// Параметры:
//  Стр            - строка, к которой добавляем описание атрибута
//  Имя            - имя атрибута
//  Значение       - значение атрибута
// 
Процедура ДобавитьПоле(Стр, Имя, Зн)

	Стр = Стр + " " + Имя + "=""" + XMLСтрока(Зн) + """";
	
КонецПроцедуры

// Открывает файл обмена, записывает заголовок файла в соответвтии с форматом обмена
//
// Параметры:
//  Нет.
//
Процедура ОткрытьФайлВыгрузки()

	// Архивные файлы будем идентифицировать по расширению ".aml"
	
	Если АрхивироватьФайл Тогда
		ИмяФайлаОбмена = СтрЗаменить(ИмяФайлаОбмена, ".xml", ".aml");
	КонецЕсли;

	
	ФайлОбмена = Новый ЗаписьТекста;
	Попытка
		ФайлОбмена.Открыть(ИмяФайлаОбмена, КодировкаТекста.UTF8);
	Исключение
		ЗаписатьВПротоколВыполнения(8);
		Возврат;
	КонецПопытки; 
	ФайлОбмена.ЗаписатьСтроку("<?xml version=""1.0"" encoding=""UTF-8""?>");

	Стр = "<ФайлОбмена";
	
	ДобавитьПоле(Стр, "ВерсияФормата",				"2.0");
	ДобавитьПоле(Стр, "ДатаВыгрузки",				ТекущаяДата());
	ДобавитьПоле(Стр, "НачалоПериодаВыгрузки",		ДатаНачала);
	ДобавитьПоле(Стр, "ОкончаниеПериодаВыгрузки",	ДатаОкончания);
	ДобавитьПоле(Стр, "ИмяКонфигурацииИсточника",	Конвертация.Источник);
	ДобавитьПоле(Стр, "ИмяКонфигурацииПриемника",	Конвертация.Приемник);
	ДобавитьПоле(Стр, "ИдПравилКонвертации",		Конвертация.Ид);
	ДобавитьПоле(Стр, "Комментарий",				Комментарий);
	
	Стр	=	Стр + ">";

	ФайлОбмена.ЗаписатьСтроку(Стр);
	
КонецПроцедуры  // ОткрытьФайлВыгрузки()

// Закрывает файл обмена
//
// Параметры:
//  Нет.
//
Процедура ЗакрытьФайл()

    ФайлОбмена.ЗаписатьСтроку("</ФайлОбмена>");
	ФайлОбмена.Закрыть();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ЗАГРУЗКИ ПРАВИЛ ОБМЕНА

// Осуществляет загрузку правила конвертации группы свойств
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  ТаблицаСвойств - таблица значений, содержащая ПКС
// 
Процедура ЗагрузитьПКГС(ПравилаОбмена, ТаблицаСвойств)

	Если одАтрибут(ПравилаОбмена, одТипБулево, "Отключить") Тогда
		одПропустить(ПравилаОбмена);
		Возврат;
	КонецЕсли;

	
	НоваяСтрока               = ТаблицаСвойств.Добавить();
	НоваяСтрока.ЭтоГруппа     = Истина;
	НоваяСтрока.ПравилаГруппы = мТаблицаПравилКонвертацииСвойств.Скопировать();

	
	// Значения по умолчанию

	НоваяСтрока.НеЗамещать               = Ложь;
	НоваяСтрока.ПолучитьИзВходящихДанных = Ложь;
	
	
	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Источник" Тогда
			НоваяСтрока.Источник		= одАтрибут(ПравилаОбмена, одТипСтрока, "Имя");
			НоваяСтрока.ВидИсточника	= одАтрибут(ПравилаОбмена, одТипСтрока, "Вид");
			НоваяСтрока.ТипИсточника	= одАтрибут(ПравилаОбмена, одТипСтрока, "Тип");
			одПропустить(ПравилаОбмена);
			
		ИначеЕсли ИмяУзла = "Приемник" Тогда
			НоваяСтрока.Приемник		= одАтрибут(ПравилаОбмена, одТипСтрока, "Имя");
			НоваяСтрока.ВидПриемника	= одАтрибут(ПравилаОбмена, одТипСтрока, "Вид");
			НоваяСтрока.ТипПриемника	= одАтрибут(ПравилаОбмена, одТипСтрока, "Тип");
			одПропустить(ПравилаОбмена);
			
		ИначеЕсли ИмяУзла = "Свойство" Тогда
			ЗагрузитьПКС(ПравилаОбмена, НоваяСтрока.ПравилаГруппы);

		ИначеЕсли ИмяУзла = "ПередОбработкойВыгрузки" Тогда
			НоваяСтрока.ПередОбработкойВыгрузки	= одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			НоваяСтрока.ЕстьОбработчикПередОбработкойВыгрузки = Не ПустаяСтрока(НоваяСтрока.ПередОбработкойВыгрузки);
			
		ИначеЕсли ИмяУзла = "ПослеОбработкиВыгрузки" Тогда
			НоваяСтрока.ПослеОбработкиВыгрузки	= одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			НоваяСтрока.ЕстьОбработчикПослеОбработкиВыгрузки = Не ПустаяСтрока(НоваяСтрока.ПослеОбработкиВыгрузки);
			
		ИначеЕсли ИмяУзла = "Код" Тогда
			НоваяСтрока.Имя = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			
		ИначеЕсли ИмяУзла = "Наименование" Тогда
			НоваяСтрока.Наименование = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			
		ИначеЕсли ИмяУзла = "Порядок" Тогда
			НоваяСтрока.Порядок = одЗначениеЭлемента(ПравилаОбмена, одТипЧисло);
			
		ИначеЕсли ИмяУзла = "НеЗамещать" Тогда
			НоваяСтрока.НеЗамещать = одЗначениеЭлемента(ПравилаОбмена, одТипБулево);
			
		ИначеЕсли ИмяУзла = "КодПравилаКонвертации" Тогда
			НоваяСтрока.ПравилоКонвертации = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			
		ИначеЕсли ИмяУзла = "ПередВыгрузкой" Тогда
			НоваяСтрока.ПередВыгрузкой = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			НоваяСтрока.ЕстьОбработчикПередВыгрузкой = Не ПустаяСтрока(НоваяСтрока.ПередВыгрузкой);
			
		ИначеЕсли ИмяУзла = "ПриВыгрузке" Тогда
			НоваяСтрока.ПриВыгрузке = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			НоваяСтрока.ЕстьОбработчикПриВыгрузке    = Не ПустаяСтрока(НоваяСтрока.ПриВыгрузке);
			
		ИначеЕсли ИмяУзла = "ПослеВыгрузки" Тогда
			НоваяСтрока.ПослеВыгрузки = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
	        НоваяСтрока.ЕстьОбработчикПослеВыгрузки  = Не ПустаяСтрока(НоваяСтрока.ПослеВыгрузки);
			
		ИначеЕсли ИмяУзла = "ПолучитьИзВходящихДанных" Тогда
			НоваяСтрока.ПолучитьИзВходящихДанных = одЗначениеЭлемента(ПравилаОбмена, одТипБулево);
			
		ИначеЕсли (ИмяУзла = "Группа") И (ТипУзла = одТипУзлаXML_КонецЭлемента) Тогда
			Прервать;
		Иначе
			
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ЗагрузитьПКГС() 

// Осуществляет загрузку правила конвертации свойств
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  ТаблицаСвойств - таблица значений, содержащая ПКС
//  ТаблицаПоиска  - таблица значений, содержащая ПКС (синхронизирующих)
// 
Процедура ЗагрузитьПКС(ПравилаОбмена, ТаблицаСвойств, ТаблицаПоиска="")

	Если одАтрибут(ПравилаОбмена, одТипБулево, "Отключить") Тогда
		одПропустить(ПравилаОбмена);
		Возврат;
	КонецЕсли;

	
	Если одАтрибут(ПравилаОбмена, одТипБулево, "Поиск") Тогда
		НоваяСтрока = ТаблицаПоиска.Добавить();
	Иначе
		НоваяСтрока = ТаблицаСвойств.Добавить();
	КонецЕсли; 

	
	// Значения по умолчанию

	НоваяСтрока.НеЗамещать               = Ложь;
	НоваяСтрока.ПолучитьИзВходящихДанных = Ложь;
	
	
	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если ИмяУзла = "Источник" Тогда
			НоваяСтрока.Источник		= одАтрибут(ПравилаОбмена, одТипСтрока, "Имя");
			НоваяСтрока.ВидИсточника	= одАтрибут(ПравилаОбмена, одТипСтрока, "Вид");
			НоваяСтрока.ТипИсточника	= одАтрибут(ПравилаОбмена, одТипСтрока, "Тип");
			одПропустить(ПравилаОбмена);
			
		ИначеЕсли ИмяУзла = "Приемник" Тогда
			НоваяСтрока.Приемник		= одАтрибут(ПравилаОбмена, одТипСтрока, "Имя");
			НоваяСтрока.ВидПриемника	= одАтрибут(ПравилаОбмена, одТипСтрока, "Вид");
			НоваяСтрока.ТипПриемника	= одАтрибут(ПравилаОбмена, одТипСтрока, "Тип");
			одПропустить(ПравилаОбмена);
			
		ИначеЕсли ИмяУзла = "Код" Тогда
			НоваяСтрока.Имя = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			
		ИначеЕсли ИмяУзла = "Наименование" Тогда
			НоваяСтрока.Наименование = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			
		ИначеЕсли ИмяУзла = "Порядок" Тогда
			НоваяСтрока.Порядок = одЗначениеЭлемента(ПравилаОбмена, одТипЧисло);
			
		ИначеЕсли ИмяУзла = "НеЗамещать" Тогда
			НоваяСтрока.НеЗамещать = одЗначениеЭлемента(ПравилаОбмена, одТипБулево);
			
		ИначеЕсли ИмяУзла = "КодПравилаКонвертации" Тогда
			НоваяСтрока.ПравилоКонвертации = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			
		ИначеЕсли ИмяУзла = "ПередВыгрузкой" Тогда
			НоваяСтрока.ПередВыгрузкой = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			НоваяСтрока.ЕстьОбработчикПередВыгрузкой = Не ПустаяСтрока(НоваяСтрока.ПередВыгрузкой);
			
		ИначеЕсли ИмяУзла = "ПриВыгрузке" Тогда
			НоваяСтрока.ПриВыгрузке = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			НоваяСтрока.ЕстьОбработчикПриВыгрузке    = Не ПустаяСтрока(НоваяСтрока.ПриВыгрузке);
			
		ИначеЕсли ИмяУзла = "ПослеВыгрузки" Тогда
			НоваяСтрока.ПослеВыгрузки = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
	        НоваяСтрока.ЕстьОбработчикПослеВыгрузки  = Не ПустаяСтрока(НоваяСтрока.ПослеВыгрузки);
			
		ИначеЕсли ИмяУзла = "ПолучитьИзВходящихДанных" Тогда
			НоваяСтрока.ПолучитьИзВходящихДанных = одЗначениеЭлемента(ПравилаОбмена, одТипБулево);
			
		ИначеЕсли (ИмяУзла = "Свойство") И (ТипУзла = одТипУзлаXML_КонецЭлемента) Тогда
			Прервать;
		Иначе
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ЗагрузитьПКС() 

// Осуществляет загрузку правил конвертации свойств
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  ТаблицаСвойств - таблица значений, содержащая ПКС
//  ТаблицаПоиска  - таблица значений, содержащая ПКС (синхронизирующих)
// 
Процедура ЗагрузитьСвойства(ПравилаОбмена, ТаблицаСвойств, ТаблицаПоиска)

	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Свойство" Тогда
			ЗагрузитьПКС(ПравилаОбмена, ТаблицаСвойств, ТаблицаПоиска);
		ИначеЕсли ИмяУзла = "Группа" Тогда
			ЗагрузитьПКГС(ПравилаОбмена, ТаблицаСвойств);
		ИначеЕсли (ИмяУзла = "Свойства") И (ТипУзла = одТипУзлаXML_КонецЭлемента) Тогда
			Прервать;
		Иначе
		КонецЕсли;
	КонецЦикла;

	ТаблицаСвойств.Сортировать("Порядок");
	ТаблицаПоиска.Сортировать("Порядок");
	
КонецПроцедуры // ЗагрузитьСвойства()

// Осуществляет загрузку правила конвертации значений
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  Значения       - соответствие значений объекта источника - строковым
//                   представлениям объекта приемника
//  ТипИсточника   - значение типа Тип - тип объекта источника
// 
Процедура ЗагрузитьПКЗ(ПравилаОбмена, Значения, ТипИсточника)

	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Источник" Тогда
			Источник = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
		ИначеЕсли ИмяУзла = "Приемник" Тогда
			Приемник = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
		ИначеЕсли (ИмяУзла = "Значение") И (ТипУзла = одТипУзлаXML_КонецЭлемента) Тогда
			Прервать;
		Иначе
		КонецЕсли;
	КонецЦикла;

	Значения[одПолучитьЗначениеПоСтроке(Источник, ТипИсточника)] = Приемник;
	
КонецПроцедуры // ЗагрузитьПКЗ()

// Осуществляет загрузку правил конвертации значений
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  Значения       - соответствие значений объекта источника - строковым
//                   представлениям объекта приемника
//  ТипИсточника   - значение типа Тип - тип объекта источника
// 
Процедура ЗагрузитьЗначения(ПравилаОбмена, Значения, ТипИсточника);

	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Значение" Тогда
			ЗагрузитьПКЗ(ПравилаОбмена, Значения, ТипИсточника);
		ИначеЕсли (ИмяУзла = "Значения") И (ТипУзла = одТипУзлаXML_КонецЭлемента) Тогда
			Прервать;
		Иначе
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Осуществляет загрузку правила конвертации объектов
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  ЗаписьXML      - Объект типа XMLЗапись - правила, сохраняемые в файл обмена и
//                   используемые при загрузке данных
// 
Процедура ЗагрузитьПравилоКонвертации(ПравилаОбмена, ЗаписьXML)

	ЗаписьXML.ЗаписатьНачалоЭлемента("Правило");

	НоваяСтрока = ТаблицаПравилКонвертации.Добавить();

	
	// Значения по умолчанию
	
	НоваяСтрока.ЗапоминатьВыгруженные = Истина;
	НоваяСтрока.НеЗамещать            = Ложь;
	
	
	Пока ПравилаОбмена.Прочитать() Цикл
		
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		
		Если      ИмяУзла = "Код" Тогда
			
			Значение = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			одЗаписатьЭлемент(ЗаписьXML, ИмяУзла, Значение);
			НоваяСтрока.Имя = Значение;
			
		ИначеЕсли ИмяУзла = "Наименование" Тогда
			
			НоваяСтрока.Наименование = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			
		ИначеЕсли ИмяУзла = "СинхронизироватьПоИдентификатору" Тогда
			
			НоваяСтрока.СинхронизироватьПоИдентификатору = одЗначениеЭлемента(ПравилаОбмена, одТипБулево);
			
		ИначеЕсли ИмяУзла = "НеЗапоминатьВыгруженные" Тогда
			
			НоваяСтрока.ЗапоминатьВыгруженные = Не одЗначениеЭлемента(ПравилаОбмена, одТипБулево);
			
		ИначеЕсли ИмяУзла = "НеЗамещать" Тогда
			
			Значение = одЗначениеЭлемента(ПравилаОбмена, одТипБулево);
			одЗаписатьЭлемент(ЗаписьXML, ИмяУзла, Значение);
			НоваяСтрока.НеЗамещать = Значение;
			
		ИначеЕсли ИмяУзла = "Приемник" Тогда
			
			Значение = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			одЗаписатьЭлемент(ЗаписьXML, ИмяУзла, Значение);
			НоваяСтрока.Приемник = Значение;
			
		ИначеЕсли ИмяУзла = "Источник" Тогда
			
			Значение = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			одЗаписатьЭлемент(ЗаписьXML, ИмяУзла, Значение);
			
			Если РежимОбмена = "Загрузка" Тогда
				
				НоваяСтрока.Источник	= Значение;
				
			Иначе
				
				Если Не ПустаяСтрока(Значение) Тогда
					
					НоваяСтрока.Источник	= Тип(Значение);
					
					Попытка
						
						Менеджеры[НоваяСтрока.Источник].ПКО = НоваяСтрока;
						
					Исключение
						
						СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
						ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
						ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
						ЗП.Объект                 = Строка(НоваяСтрока.Источник);
						ЗП.ОписаниеОшибки         = ОписаниеОшибки;
						ЗП.ПозицияМодуля          = СтрокаМодуля;
						ЗП.КодСообщения           = 11;
						ЗаписатьВПротоколВыполнения(11, ЗП);
						
					КонецПопытки; 
					
				КонецЕсли;
				
			КонецЕсли;


		// Свойства
		
		ИначеЕсли ИмяУзла = "Свойства" Тогда
		
			НоваяСтрока.СвойстваПоиска	= мТаблицаПравилКонвертацииСвойств.Скопировать();
			НоваяСтрока.Свойства		= мТаблицаПравилКонвертацииСвойств.Скопировать();
			
			
			Если НоваяСтрока.СинхронизироватьПоИдентификатору <> Неопределено И НоваяСтрока.СинхронизироватьПоИдентификатору Тогда
				
				СвойствоПоискаУИ = НоваяСтрока.СвойстваПоиска.Добавить();
				СвойствоПоискаУИ.Имя = "{УникальныйИдентификатор}";
				СвойствоПоискаУИ.Источник = "{УникальныйИдентификатор}";
				СвойствоПоискаУИ.Приемник = "{УникальныйИдентификатор}";
				
			КонецЕсли;
			
			ЗагрузитьСвойства(ПравилаОбмена, НоваяСтрока.Свойства, НоваяСтрока.СвойстваПоиска);

			
		// Значения
		
		ИначеЕсли ИмяУзла = "Значения" Тогда
		
			ЗагрузитьЗначения(ПравилаОбмена, НоваяСтрока.Значения, НоваяСтрока.Источник);

			
		// Обработчики событий
		
		ИначеЕсли ИмяУзла = "ПередВыгрузкой" Тогда
		
			НоваяСтрока.ПередВыгрузкой = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			НоваяСтрока.ЕстьОбработчикПередВыгрузкой = Не ПустаяСтрока(НоваяСтрока.ПередВыгрузкой);
			
		ИначеЕсли ИмяУзла = "ПриВыгрузке" Тогда
			
			НоваяСтрока.ПриВыгрузке = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			НоваяСтрока.ЕстьОбработчикПриВыгрузке    = Не ПустаяСтрока(НоваяСтрока.ПриВыгрузке);
			
		ИначеЕсли ИмяУзла = "ПослеВыгрузки" Тогда
			
			НоваяСтрока.ПослеВыгрузки = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			НоваяСтрока.ЕстьОбработчикПослеВыгрузки  = Не ПустаяСтрока(НоваяСтрока.ПослеВыгрузки);

			
		// Для загрузки
		
		ИначеЕсли ИмяУзла = "ПередЗагрузкой" Тогда
			
			Значение = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			
			Если РежимОбмена = "Загрузка" Тогда
				
				НоваяСтрока.ПередЗагрузкой               = Значение;
				НоваяСтрока.ЕстьОбработчикПередЗагрузкой = Не ПустаяСтрока(Значение);
				
			Иначе
				
				одЗаписатьЭлемент(ЗаписьXML, ИмяУзла, Значение);
				
			КонецЕсли;
			
		ИначеЕсли ИмяУзла = "ПриЗагрузке" Тогда
			
			Значение = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			
			Если РежимОбмена = "Загрузка" Тогда
				
				НоваяСтрока.ПриЗагрузке               = Значение;
				НоваяСтрока.ЕстьОбработчикПриЗагрузке = Не ПустаяСтрока(Значение);
				
			Иначе
				
				одЗаписатьЭлемент(ЗаписьXML, ИмяУзла, Значение);
				
			КонецЕсли; 
			
		ИначеЕсли ИмяУзла = "ПослеЗагрузки" Тогда
			
			Значение = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			
			Если РежимОбмена = "Загрузка" Тогда
				
				НоваяСтрока.ПослеЗагрузки               = Значение;
				НоваяСтрока.ЕстьОбработчикПослеЗагрузки = Не ПустаяСтрока(Значение);
				
			Иначе
				
				одЗаписатьЭлемент(ЗаписьXML, ИмяУзла, Значение);
				
			КонецЕсли;
			
		// Выход
		
		ИначеЕсли (ИмяУзла = "Правило") И (ТипУзла = одТипУзлаXML_КонецЭлемента) Тогда
		
			Прервать;
			
		Иначе
			
		КонецЕсли;
		
	КонецЦикла;

	ЗаписьXML.ЗаписатьКонецЭлемента();

	
	// Быстрый доступ к ПКО по имени
	
	Правила.Вставить(НоваяСтрока.Имя, НоваяСтрока);
	
КонецПроцедуры // ЗагрузитьПравилоКонвертации() 
 
// Осуществляет загрузку правил конвертации объектов
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  ЗаписьXML      - Объект типа XMLЗапись - правила, сохраняемые в файл обмена и
//                   используемые при загрузке данных
// 
Процедура ЗагрузитьПравилаКонвертации(ПравилаОбмена, ЗаписьXML)

	ТаблицаПравилКонвертации.Очистить();

	ЗаписьXML.ЗаписатьНачалоЭлемента("ПравилаКонвертацииОбъектов");
	
	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Правило" Тогда
			ЗагрузитьПравилоКонвертации(ПравилаОбмена, ЗаписьXML);
		ИначеЕсли (ИмяУзла = "ПравилаКонвертацииОбъектов") И (ТипУзла = одТипУзлаXML_КонецЭлемента) Тогда
			Прервать;
		Иначе
		КонецЕсли;
	КонецЦикла;

	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры // ЗагрузитьПравилаКонвертации() 

// Осуществляет загрузку группы правил очистки данных в соответствии с форматом правил обмена
//
// Параметры:
//  НоваяСтрока    - строка дерева значений, описывающая группу правил очистки данных
// 
Процедура ЗагрузитьГруппуПОД(ПравилаОбмена, НоваяСтрока)

	НоваяСтрока.ЭтоГруппа = Истина;
	НоваяСтрока.Включить  = Число(Не одАтрибут(ПравилаОбмена, одТипБулево, "Отключить"));
	
	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Код" Тогда
			НоваяСтрока.Имя = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);

		ИначеЕсли ИмяУзла = "Наименование" Тогда
			НоваяСтрока.Наименование = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
		
		ИначеЕсли ИмяУзла = "Порядок" Тогда
			НоваяСтрока.Порядок = одЗначениеЭлемента(ПравилаОбмена, одТипЧисло);
			
		ИначеЕсли ИмяУзла = "Правило" Тогда
			СтрокаДЗ = НоваяСтрока.Строки.Добавить();
			ЗагрузитьПОД(ПравилаОбмена, СтрокаДЗ);
			
		ИначеЕсли (ИмяУзла = "Группа") И (ТипУзла = одТипУзлаXML_НачалоЭлемента) Тогда
			СтрокаДЗ = НоваяСтрока.Строки.Добавить();
			ЗагрузитьГруппуПОД(ПравилаОбмена, СтрокаДЗ);
			
		// Выход
		
		ИначеЕсли (ИмяУзла = "Группа") И (ТипУзла = одТипУзлаXML_КонецЭлемента) Тогда
			Прервать;
		Иначе
		КонецЕсли;
	КонецЦикла;

	
	Если ПустаяСтрока(НоваяСтрока.Наименование) Тогда
		НоваяСтрока.Наименование = НоваяСтрока.Имя;
	КонецЕсли; 
	
КонецПроцедуры // ЗагрузитьГруппуПОД()

// Осуществляет загрузку правила очистки данных в соответствии с форматом правил обмена
//
// Параметры:
//  НоваяСтрока    - строка дерева значений, описывающая правило очистки данных
// 
Процедура ЗагрузитьПОД(ПравилаОбмена, НоваяСтрока)
	
	НоваяСтрока.Включить = Число(Не одАтрибут(ПравилаОбмена, одТипБулево, "Отключить"));
	
	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Код" Тогда
			Значение = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			НоваяСтрока.Имя = Значение;

		ИначеЕсли ИмяУзла = "Наименование" Тогда
			НоваяСтрока.Наименование = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
		
		ИначеЕсли ИмяУзла = "Порядок" Тогда
			НоваяСтрока.Порядок = одЗначениеЭлемента(ПравилаОбмена, одТипЧисло);
			
		ИначеЕсли ИмяУзла = "СпособОтбораДанных" Тогда
			НоваяСтрока.СпособОтбораДанных = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);

		ИначеЕсли ИмяУзла = "ОбъектВыборки" Тогда
			ОбъектВыборки = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			Если Не ПустаяСтрока(ОбъектВыборки) Тогда
				НоваяСтрока.ОбъектВыборки = Тип(ОбъектВыборки);
			КонецЕсли; 

		ИначеЕсли ИмяУзла = "УдалятьЗаПериод" Тогда
			НоваяСтрока.УдалятьЗаПериод = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			
		ИначеЕсли ИмяУзла = "Непосредственно" Тогда
			НоваяСтрока.Непосредственно = одЗначениеЭлемента(ПравилаОбмена, одТипБулево);

		
		// Обработчики событий

		ИначеЕсли ИмяУзла = "ПередОбработкойПравила" Тогда
			НоваяСтрока.ПередОбработкой = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			
		ИначеЕсли ИмяУзла = "ПослеОбработкиПравила" Тогда
			НоваяСтрока.ПослеОбработки = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
		
		ИначеЕсли ИмяУзла = "ПередУдалением" Тогда
			НоваяСтрока.ПередУдалением = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);

			
		// Выход
		
		ИначеЕсли (ИмяУзла = "Правило") И (ТипУзла = одТипУзлаXML_КонецЭлемента) Тогда
			Прервать;
		Иначе
		КонецЕсли;
	КонецЦикла;

	
	Если ПустаяСтрока(НоваяСтрока.Наименование) Тогда
		НоваяСтрока.Наименование = НоваяСтрока.Имя;
	КонецЕсли; 
	
КонецПроцедуры // ЗагрузитьПОД()

// Осуществляет загрузку правил очистки данных
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  ЗаписьXML      - Объект типа XMLЗапись - правила, сохраняемые в файл обмена и
//                   используемые при загрузке данных
// 
Процедура ЗагрузитьПравилаОчистки(ПравилаОбмена, ЗаписьXML)

	ТаблицаПравилОчистки.Строки.Очистить();
	СтрокиДЗ = ТаблицаПравилОчистки.Строки;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПравилаОчисткиДанных");

	Пока ПравилаОбмена.Прочитать() Цикл
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если ТипУзла = одТипУзлаXML_НачалоЭлемента Тогда
			ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
			Если РежимОбмена <> "Загрузка" Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента(ПравилаОбмена.Имя);
				Пока ПравилаОбмена.ПрочитатьАтрибут() Цикл
					ЗаписьXML.ЗаписатьАтрибут(ПравилаОбмена.Имя, ПравилаОбмена.Значение);
				КонецЦикла;
			Иначе
				Если ИмяУзла = "Правило" Тогда
					СтрокаДЗ = СтрокиДЗ.Добавить();
					ЗагрузитьПОД(ПравилаОбмена, СтрокаДЗ);
				ИначеЕсли ИмяУзла = "Группа" Тогда
					СтрокаДЗ = СтрокиДЗ.Добавить();
					ЗагрузитьГруппуПОД(ПравилаОбмена, СтрокаДЗ);
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ТипУзла = одТипУзлаXML_КонецЭлемента Тогда
			ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
			Если ИмяУзла = "ПравилаОчисткиДанных" Тогда
				Прервать;
			Иначе
				Если РежимОбмена <> "Загрузка" Тогда
					ЗаписьXML.ЗаписатьКонецЭлемента();
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ТипУзла = одТипУзлаXML_Текст Тогда
			Если РежимОбмена <> "Загрузка" Тогда
				ЗаписьXML.ЗаписатьТекст(ПравилаОбмена.Значение);
			КонецЕсли;
		Иначе
		КонецЕсли; 
	КонецЦикла;

	СтрокиДЗ.Сортировать("Порядок", Истина);
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры // ЗагрузитьПравилаОчистки() 

// Осуществляет загрузку алгоритма в соответствии с форматом правил обмена
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  ЗаписьXML      - Объект типа XMLЗапись - правила, сохраняемые в файл обмена и
//                   используемые при загрузке данных
// 
Процедура ЗагрузитьАлгоритм(ПравилаОбмена, ЗаписьXML)

	ИспользуетсяПриЗагрузке = одАтрибут(ПравилаОбмена, одТипБулево, "ИспользуетсяПриЗагрузке");
	Имя                     = одАтрибут(ПравилаОбмена, одТипСтрока, "Имя");
	
	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Текст" Тогда
			Текст = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
		ИначеЕсли (ИмяУзла = "Алгоритм") И (ТипУзла = одТипУзлаXML_КонецЭлемента) Тогда
			Прервать;
		Иначе
			одПропустить(ПравилаОбмена);
		КонецЕсли;
	КонецЦикла;

	
	Если ИспользуетсяПриЗагрузке Тогда
		Если РежимОбмена = "Загрузка" Тогда
			Алгоритмы.Вставить(Имя, Текст);
		Иначе
			ЗаписьXML.ЗаписатьНачалоЭлемента("Алгоритм");
			УстановитьАтрибут(ЗаписьXML, "ИспользуетсяПриЗагрузке", Истина);
			УстановитьАтрибут(ЗаписьXML, "Имя",   Имя);
			одЗаписатьЭлемент(ЗаписьXML, "Текст", Текст);
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
	Иначе
		Если РежимОбмена <> "Загрузка" Тогда
			Алгоритмы.Вставить(Имя, Текст);
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры // ЗагрузитьАлгоритм() 

// Осуществляет загрузку алгоритмов в соответствии с форматом правил обмена
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  ЗаписьXML      - Объект типа XMLЗапись - правила, сохраняемые в файл обмена и
//                   используемые при загрузке данных
// 
Процедура ЗагрузитьАлгоритмы(ПравилаОбмена, ЗаписьXML)

	Алгоритмы.Очистить();

	ЗаписьXML.ЗаписатьНачалоЭлемента("Алгоритмы");
	
	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Алгоритм" Тогда
			ЗагрузитьАлгоритм(ПравилаОбмена, ЗаписьXML);
		ИначеЕсли (ИмяУзла = "Алгоритмы") И (ТипУзла = одТипУзлаXML_КонецЭлемента) Тогда
			Прервать;
		Иначе
		КонецЕсли;
	КонецЦикла;

	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры // ЗагрузитьАлгоритмы() 

// Осуществляет загрузку запроса в соответствии с форматом правил обмена
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  ЗаписьXML      - Объект типа XMLЗапись - правила, сохраняемые в файл обмена и
//                   используемые при загрузке данных
// 
Процедура ЗагрузитьЗапрос(ПравилаОбмена, ЗаписьXML)

	ИспользуетсяПриЗагрузке = одАтрибут(ПравилаОбмена, одТипБулево, "ИспользуетсяПриЗагрузке");
	Имя                     = одАтрибут(ПравилаОбмена, одТипСтрока, "Имя");
	
	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Текст" Тогда
			Текст = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
		ИначеЕсли (ИмяУзла = "Запрос") И (ТипУзла = одТипУзлаXML_КонецЭлемента) Тогда
			Прервать;
		Иначе
			одПропустить(ПравилаОбмена);
		КонецЕсли;
	КонецЦикла;

	Если ИспользуетсяПриЗагрузке Тогда
		Если РежимОбмена = "Загрузка" Тогда
			Запрос	= Новый Запрос(Текст);
			Запросы.Вставить(Имя, Запрос);
		Иначе
			ЗаписьXML.ЗаписатьНачалоЭлемента("Запрос");
			УстановитьАтрибут(ЗаписьXML, "ИспользуетсяПриЗагрузке", Истина);
			УстановитьАтрибут(ЗаписьXML, "Имя",   Имя);
			одЗаписатьЭлемент(ЗаписьXML, "Текст", Текст);
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
	Иначе
		Если РежимОбмена <> "Загрузка" Тогда
			Запрос	= Новый Запрос(Текст);
			Запросы.Вставить(Имя, Запрос);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ЗагрузитьЗапрос() 

// Осуществляет загрузку запросов в соответствии с форматом правил обмена
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  ЗаписьXML      - Объект типа XMLЗапись - правила, сохраняемые в файл обмена и
//                   используемые при загрузке данных
// 
Процедура ЗагрузитьЗапросы(ПравилаОбмена, ЗаписьXML)

	Запросы.Очистить();

	ЗаписьXML.ЗаписатьНачалоЭлемента("Запросы");
	
	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Запрос" Тогда
			ЗагрузитьЗапрос(ПравилаОбмена, ЗаписьXML);
		ИначеЕсли (ИмяУзла = "Запросы") И (ТипУзла = одТипУзлаXML_КонецЭлемента) Тогда
			Прервать;
		Иначе
		КонецЕсли;
	КонецЦикла;

	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры // ЗагрузитьЗапросы() 

// Осуществляет загрузку параметров в соответствии с форматом правил обмена
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
// 
Процедура ЗагрузитьПараметры(ПравилаОбмена, ЗаписьXML)

	Параметры.Очистить();
	ТаблицаНастройкиПараметров.Очистить();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Параметры");
	
	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;

		Если ИмяУзла = "Параметр" И ТипУзла = одТипУзлаXML_НачалоЭлемента Тогда
			//Загрузка по версии правил 2.01
			Имя                     = одАтрибут(ПравилаОбмена, одТипСтрока, "Имя");
			Наименование            = одАтрибут(ПравилаОбмена, одТипСтрока, "Наименование");
			УстанавливатьВДиалоге   = одАтрибут(ПравилаОбмена, одТипБулево, "УстанавливатьВДиалоге");
			СтрокаТипаЗначения      = одАтрибут(ПравилаОбмена, одТипСтрока, "ТипЗначения");
			ИспользуетсяПриЗагрузке = одАтрибут(ПравилаОбмена, одТипБулево, "ИспользуетсяПриЗагрузке");
			
			Параметры.Вставить(Имя);
			Если УстанавливатьВДиалоге = ИСТИНА Тогда
				СтрокаТаблицы              = ТаблицаНастройкиПараметров.Добавить();
				СтрокаТаблицы.Наименование = Наименование;
				СтрокаТаблицы.Имя          = Имя;
				// Определяем типы значений и устанавливаем начальные значения
				Попытка
					ТипЗначенияДанных = Тип(СтрокаТипаЗначения);
					ТипОпределен = ИСТИНА;
				Исключение
					ТипОпределен = ЛОЖЬ;
				КонецПопытки;
				Если ТипОпределен = ИСТИНА Тогда
					СтрокаТаблицы.Значение = одПолучитьПустоеЗначение(ТипЗначенияДанных);
				Иначе
					СтрокаТаблицы.Значение = одПолучитьПустоеЗначение("Строка");
				КонецЕсли;
			КонецЕсли;
			
			Если ДопПараметрыОбмена<>Неопределено И ТипЗнч(ДопПараметрыОбмена)=Тип("ТаблицаЗначений") Тогда	
				СтрокаДП=ДопПараметрыОбмена.Найти(Имя,"Имя");
				Если СтрокаДП<>Неопределено Тогда		
					Параметры.Вставить(СтрокаДП.Имя,СтрокаДП.Значение);
				КонецЕсли;
			КонецЕсли;			

			Если ИспользуетсяПриЗагрузке Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("Параметр");
				УстановитьАтрибут(ЗаписьXML, "Имя",   Имя);
				одЗаписатьЭлемент(ЗаписьXML, "Наименование", Наименование);				
				
				Если ДопПараметрыОбмена<>Неопределено И ТипЗнч(ДопПараметрыОбмена)=Тип("ТаблицаЗначений") Тогда	
					СтрокаДП=ДопПараметрыОбмена.Найти(Имя,"Имя");
					Если СтрокаДП<>Неопределено Тогда		
						ЗаписьXML.ЗаписатьНачалоЭлемента("Значение");
						ЗаписьXML.ЗаписатьТекст(Строка(СтрокаДП.Значение));						
						ЗаписьXML.ЗаписатьКонецЭлемента();
					КонецЕсли;	
				КонецЕсли;				
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;

		ИначеЕсли (ТипУзла = одТипУзлаXML_Текст) Тогда
			Параметры.Вставить(Имя,ПравилаОбмена.Значение);			
		ИначеЕсли (ИмяУзла = "Параметры") И (ТипУзла = одТипУзлаXML_КонецЭлемента) Тогда
			Прервать;
		Иначе
		КонецЕсли;
	КонецЦикла;

	ЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры // ЗагрузитьПараметры() 

// Осуществляет загрузку обработки в соответствии с форматом правил обмена
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  ЗаписьXML      - Объект типа XMLЗапись - правила, сохраняемые в файл обмена и
//                   используемые при загрузке данных
// 
Процедура ЗагрузитьОбработку(ПравилаОбмена, ЗаписьXML)

	Имя                     = одАтрибут(ПравилаОбмена, одТипСтрока, "Имя");
	Наименование            = одАтрибут(ПравилаОбмена, одТипСтрока, "Наименование");
	ЭтоОбработкаНастройки   = одАтрибут(ПравилаОбмена, одТипБулево, "ЭтоОбработкаНастройки");
	
	ИспользуетсяПриВыгрузке = одАтрибут(ПравилаОбмена, одТипБулево, "ИспользуетсяПриВыгрузке");
	ИспользуетсяПриЗагрузке = одАтрибут(ПравилаОбмена, одТипБулево, "ИспользуетсяПриЗагрузке");

	СтрокаПараметров        = одАтрибут(ПравилаОбмена, одТипСтрока, "Параметры");
	
	ХранилищеОбработки      = одЗначениеЭлемента(ПравилаОбмена, одТипХранилищеЗначения);

	ПараметрыДопОбработок.Вставить(Имя, МассивИзСтроки(СтрокаПараметров));
	
	
	Если ИспользуетсяПриЗагрузке Тогда
		Если РежимОбмена = "Загрузка" Тогда
			УникальныйИдентификатор = Новый УникальныйИдентификатор();
			ИмяВременногоФайла      = КаталогВременныхФайлов() + УникальныйИдентификатор + ".epf";
			ХранилищеОбработки.Получить().Записать(ИмяВременногоФайла);
			ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяВременногоФайла);
			УдалитьФайлы(ИмяВременногоФайла);
            ДопОбработки.Вставить(Имя, ВнешняяОбработка);
		Иначе
			ЗаписьXML.ЗаписатьНачалоЭлемента("Обработка");
			УстановитьАтрибут(ЗаписьXML, "ИспользуетсяПриЗагрузке", Истина);
			УстановитьАтрибут(ЗаписьXML, "Имя",                     Имя);
			УстановитьАтрибут(ЗаписьXML, "Наименование",            Наименование);
			УстановитьАтрибут(ЗаписьXML, "ЭтоОбработкаНастройки",   ЭтоОбработкаНастройки);
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(ХранилищеОбработки));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
	КонецЕсли;
	
	Если ИспользуетсяПриВыгрузке Тогда
		Если РежимОбмена <> "Загрузка" Тогда
			УникальныйИдентификатор = Новый УникальныйИдентификатор();
			ИмяВременногоФайла      = КаталогВременныхФайлов() + УникальныйИдентификатор + ".epf";
			ХранилищеОбработки.Получить().Записать(ИмяВременногоФайла);
			ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяВременногоФайла);
			УдалитьФайлы(ИмяВременногоФайла);
            ДопОбработки.Вставить(Имя, ВнешняяОбработка);
		КонецЕсли;
	КонецЕсли;

	Если ЭтоОбработкаНастройки Тогда
		Если (РежимОбмена = "Загрузка") И ИспользуетсяПриЗагрузке Тогда
			ОбработкиНастройкиЗагрузки.Добавить(Имя, Наименование, , );
			
		ИначеЕсли (РежимОбмена = "Выгрузка") И ИспользуетсяПриВыгрузке Тогда
			ОбработкиНастройкиВыгрузки.Добавить(Имя, Наименование, , );
			
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры // ЗагрузитьОбработку() 

// Осуществляет загрузку внешних обработок в соответствии с форматом правил обмена
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  ЗаписьXML      - Объект типа XMLЗапись - правила, сохраняемые в файл обмена и
//                   используемые при загрузке данных
// 
Процедура ЗагрузитьОбработки(ПравилаОбмена, ЗаписьXML)

	ДопОбработки.Очистить();
	ПараметрыДопОбработок.Очистить();
	
	ОбработкиНастройкиВыгрузки.Очистить();
	ОбработкиНастройкиЗагрузки.Очистить();

	ЗаписьXML.ЗаписатьНачалоЭлемента("Обработки");
	
	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Обработка" Тогда
			ЗагрузитьОбработку(ПравилаОбмена, ЗаписьXML);
		ИначеЕсли (ИмяУзла = "Обработки") И (ТипУзла = одТипУзлаXML_КонецЭлемента) Тогда
			Прервать;
		Иначе
		КонецЕсли;
	КонецЦикла;

	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры // ЗагрузитьОбработки() 

// Осуществляет загрузку группы правил выгрузки данных в соответствии с форматом правил обмена
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  НоваяСтрока    - строка дерева значений, описывающая группу правил выгрузки данных
// 
Процедура ЗагрузитьГруппуПВД(ПравилаОбмена, НоваяСтрока)

	НоваяСтрока.ЭтоГруппа = Истина;
	НоваяСтрока.Включить  = Число(Не одАтрибут(ПравилаОбмена, одТипБулево, "Отключить"));
	
	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Код" Тогда
			НоваяСтрока.Имя = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);

		ИначеЕсли ИмяУзла = "Наименование" Тогда
			НоваяСтрока.Наименование = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
		
		ИначеЕсли ИмяУзла = "Порядок" Тогда
			НоваяСтрока.Порядок = одЗначениеЭлемента(ПравилаОбмена, одТипЧисло);
			
		ИначеЕсли ИмяУзла = "Правило" Тогда
			СтрокаДЗ = НоваяСтрока.Строки.Добавить();
			ЗагрузитьПВД(ПравилаОбмена, СтрокаДЗ);
			
		ИначеЕсли (ИмяУзла = "Группа") И (ТипУзла = одТипУзлаXML_НачалоЭлемента) Тогда
			СтрокаДЗ = НоваяСтрока.Строки.Добавить();
			ЗагрузитьГруппуПВД(ПравилаОбмена, СтрокаДЗ);
			
		// Выход
		
		ИначеЕсли (ИмяУзла = "Группа") И (ТипУзла = одТипУзлаXML_КонецЭлемента) Тогда
			Прервать;
		Иначе
		КонецЕсли;
	КонецЦикла;

	
	Если ПустаяСтрока(НоваяСтрока.Наименование) Тогда
		НоваяСтрока.Наименование = НоваяСтрока.Имя;
	КонецЕсли; 
	
КонецПроцедуры // ЗагрузитьГруппуПВД()

// Осуществляет загрузку правила выгрузки данных в соответствии с форматом правил обмена
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  НоваяСтрока    - строка дерева значений, описывающая правило выгрузки данных
// 
Процедура ЗагрузитьПВД(ПравилаОбмена, НоваяСтрока)

	НоваяСтрока.Включить = Число(Не одАтрибут(ПравилаОбмена, одТипБулево, "Отключить"));
	
	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Код" Тогда
			НоваяСтрока.Имя = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);

		ИначеЕсли ИмяУзла = "Наименование" Тогда
			НоваяСтрока.Наименование = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
		
		ИначеЕсли ИмяУзла = "Порядок" Тогда
			НоваяСтрока.Порядок = одЗначениеЭлемента(ПравилаОбмена, одТипЧисло);
			
		ИначеЕсли ИмяУзла = "СпособОтбораДанных" Тогда
			НоваяСтрока.СпособОтбораДанных = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);

		ИначеЕсли ИмяУзла = "ОбъектВыборки" Тогда
			ОбъектВыборки = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			Если Не ПустаяСтрока(ОбъектВыборки) Тогда
				НоваяСтрока.ОбъектВыборки = Тип(ОбъектВыборки);
			КонецЕсли;
			// Для поддержки отбора с помощью построителя
			Если Найти(ОбъектВыборки, "Ссылка.") Тогда
				НоваяСтрока.ИмяОбъектаДляЗапроса = СтрЗаменить(ОбъектВыборки, "Ссылка.", ".");
			КонецЕсли;

		ИначеЕсли ИмяУзла = "КодПравилаКонвертации" Тогда
			НоваяСтрока.ПравилоКонвертации = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);

		// Обработчики событий

		ИначеЕсли ИмяУзла = "ПередОбработкойПравила" Тогда
			НоваяСтрока.ПередОбработкой = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			
		ИначеЕсли ИмяУзла = "ПослеОбработкиПравила" Тогда
			НоваяСтрока.ПослеОбработки = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
		
		ИначеЕсли ИмяУзла = "ПередВыгрузкойОбъекта" Тогда
			НоваяСтрока.ПередВыгрузкой = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);

		ИначеЕсли ИмяУзла = "ПослеВыгрузкиОбъекта" Тогда
			НоваяСтрока.ПослеВыгрузки = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);

			
		// Выход
		
		ИначеЕсли (ИмяУзла = "Правило") И (ТипУзла = одТипУзлаXML_КонецЭлемента) Тогда
			Прервать;
		Иначе
		КонецЕсли;
	КонецЦикла;

	Если ПустаяСтрока(НоваяСтрока.Наименование) Тогда
		НоваяСтрока.Наименование = НоваяСтрока.Имя;
	КонецЕсли; 
	
КонецПроцедуры // ЗагрузитьПВД()

// Осуществляет загрузку правил выгрузки данных в соответствии с форматом правил обмена
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
// 
Процедура ЗагрузитьПравилаВыгрузки(ПравилаОбмена)

	ТаблицаПравилВыгрузки.Строки.Очистить();

	СтрокиДЗ = ТаблицаПравилВыгрузки.Строки;
	
	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Правило" Тогда
			СтрокаДЗ = СтрокиДЗ.Добавить();
			ЗагрузитьПВД(ПравилаОбмена, СтрокаДЗ);
		ИначеЕсли ИмяУзла = "Группа" Тогда
			СтрокаДЗ = СтрокиДЗ.Добавить();
			ЗагрузитьГруппуПВД(ПравилаОбмена, СтрокаДЗ);
		ИначеЕсли (ИмяУзла = "ПравилаВыгрузкиДанных") И (ТипУзла = одТипУзлаXML_КонецЭлемента) Тогда
			Прервать;
		Иначе
		КонецЕсли;
	КонецЦикла;

	СтрокиДЗ.Сортировать("Порядок", Истина);

КонецПроцедуры // ЗагрузитьПравилаВыгрузки()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ РАБОТЫ С ПРАВИЛАМИ ОБМЕНА

// Осуществляет поиск правила конвертации по имени или в соответствии с типом
// переданного объекта
//
// Параметры:
//  Объект         - Объект-источник, для которого ищем правило конвертации
//  ИмяПравила     - имя правила конвертации
//
// Возвращаемое значение:
//  Ссылка на правило конвертации (строка в таблице правил)
// 
Функция НайтиПравило(Объект, ИмяПравила="")

	Если Не ПустаяСтрока(ИмяПравила) Тогда
		Правило = Правила[ИмяПравила];
	Иначе
		Правило = Менеджеры[ТипЗнч(Объект)];
		Если Правило <> Неопределено Тогда
			Правило    = Правило.ПКО;
			ИмяПравила = Правило.Имя;
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Правило; 
	
КонецФункции

// Сохраняет правила обмена фо внутреннем формате
//
// Параметры:
//  Нет.
// 
Процедура СохранитьПравилаВоВнутреннемФормате() Экспорт

	Для Каждого Правило Из ТаблицаПравилКонвертации Цикл
		Правило.Выгруженные.Очистить();
	КонецЦикла;

	СтруктураПравил = Новый Структура;
	
	//Сохраняем запросы
	ЗапросыДляСохранения = Новый Структура;
	Для Каждого ЭлементСтруктуры Из Запросы Цикл
		ЗапросыДляСохранения.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение.Текст);
	КонецЦикла;

	ПараметрыДляСохранения = Новый Структура;
	Для Каждого ЭлементСтруктуры Из Параметры Цикл
		ПараметрыДляСохранения.Вставить(ЭлементСтруктуры.Ключ, Неопределено);
	КонецЦикла;

	СтруктураПравил.Вставить("ТаблицаПравилВыгрузки",      ТаблицаПравилВыгрузки);
	СтруктураПравил.Вставить("ТаблицаПравилКонвертации",   ТаблицаПравилКонвертации);
	СтруктураПравил.Вставить("Алгоритмы",                  Алгоритмы);
	СтруктураПравил.Вставить("Запросы",                    ЗапросыДляСохранения);
	СтруктураПравил.Вставить("Конвертация",                Конвертация);
	СтруктураПравил.Вставить("мXMLПравила",                мXMLПравила);
	СтруктураПравил.Вставить("ТаблицаНастройкиПараметров", ТаблицаНастройкиПараметров);
	СтруктураПравил.Вставить("Параметры",                  ПараметрыДляСохранения);

	СохраненныеНастройки  = Новый ХранилищеЗначения(СтруктураПравил);
	
КонецПроцедуры // СохранитьПравилаВоВнутреннемФормате()

// Восстанавливает правила из внутреннего формата
//
// Параметры:
// 
Процедура ВосстановитьПравилаИзВнутреннегоФормата() Экспорт

	СтруктураПравил = СохраненныеНастройки.Получить();

	ТаблицаПравилВыгрузки      = СтруктураПравил.ТаблицаПравилВыгрузки;
	ТаблицаПравилКонвертации   = СтруктураПравил.ТаблицаПравилКонвертации;
	Алгоритмы                  = СтруктураПравил.Алгоритмы;
	ЗапросыДляВосстановления   = СтруктураПравил.Запросы;
	Конвертация                = СтруктураПравил.Конвертация;
	мXMLПравила                = СтруктураПравил.мXMLПравила;
	ТаблицаНастройкиПараметров = СтруктураПравил.ТаблицаНастройкиПараметров;
	Параметры                  = СтруктураПравил.Параметры;
	ТаблицаНастройкиПараметров = СтруктураПравил.ТаблицаНастройкиПараметров;
	
	ЕстьГлобальныйОбработчикПередВыгрузкойОбъекта    = Не ПустаяСтрока(Конвертация.ПередВыгрузкойОбъекта);
	ЕстьГлобальныйОбработчикПослеВыгрузкиОбъекта     = Не ПустаяСтрока(Конвертация.ПослеВыгрузкиОбъекта);
	ЕстьГлобальныйОбработчикПередЗагрузкойОбъекта    = Не ПустаяСтрока(Конвертация.ПередЗагрузкойОбъекта);
	ЕстьГлобальныйОбработчикПослеЗагрузкиОбъекта     = Не ПустаяСтрока(Конвертация.ПослеЗагрузкиОбъекта);
	ЕстьГлобальныйОбработчикПередКонвертациейОбъекта = Не ПустаяСтрока(Конвертация.ПередКонвертациейОбъекта);

	// Восстанавливаем запросы
	Запросы.Очистить();
	Для Каждого ЭлементСтруктуры Из ЗапросыДляВосстановления Цикл
		Запрос = Новый Запрос(ЭлементСтруктуры.Значение);
		Запросы.Вставить(ЭлементСтруктуры.Ключ, Запрос);
	КонецЦикла;

	Если Менеджеры = Неопределено Тогда
		ИнициализацияМенеджеров();
	КонецЕсли; 

	Если одСообщения = Неопределено Тогда
		ИнициализацияСообщений();
	КонецЕсли; 

	Правила.Очистить();
	Для Каждого СтрокаТаблицы Из ТаблицаПравилКонвертации Цикл
		Правила.Вставить(СтрокаТаблицы.Имя, СтрокаТаблицы);

		Если НЕ СтрокаТаблицы.Источник = Неопределено Тогда
			Попытка
				Менеджеры[СтрокаТаблицы.Источник].ПКО = СтрокаТаблицы;
			Исключение
				СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
				ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
				ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
				ЗП.Объект                 = Строка(СтрокаТаблицы.Источник);
				ЗП.ОписаниеОшибки         = ОписаниеОшибки;
				ЗП.ПозицияМодуля          = СтрокаМодуля;
				ЗП.КодСообщения           = 11;
				ЗаписатьВПротоколВыполнения(11, ЗП);
			КонецПопытки;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // СохранитьПравилаВоВнутреннемФормате()

// Устанавливат значения парамтров в структуре Параметры 
// по таблице ТаблицаНастройкиПараметров
//
Процедура УстановитьПараметрыИзДиалога()

	Для Каждого СтрокаТаблицы Из ТаблицаНастройкиПараметров Цикл
		Параметры.Вставить(СтрокаТаблицы.Имя, СтрокаТаблицы.Значение);
	КонецЦикла;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА ПРАВИЛ ОЧИСТКИ

// Производит удаление (или помечает на удаление) объект выборки в соответствии с указанным правилом
//
// Параметры:
//  Объект         - удаляемый (помечаемый на удаление) объект выборки
//  Правило        - ссылка на правило очистки данных
//  Свойства       - свойства объекта метаданного удаляемого объекта 
//  ВходящиеДанные - произвольные вспомогательные данные
// 
Процедура УдалениеОбъектаВыборки(Объект, Правило, Свойства=Неопределено, ВходящиеДанные=Неопределено)

	Попытка
		
		Предопределенный = Объект.Предопределенный;
		
	Исключение
		
		Предопределенный = Ложь;
		
	КонецПопытки;
	
	Если Предопределенный Тогда
		
		Возврат;
		
	КонецЕсли;
		
	Отказ			       = Ложь;
	УдалитьНепосредственно = Правило.Непосредственно;


	// Обработчик ПередУдалениемОбъектаВыборки
	
	Если ФлагРежимОтладки Тогда
		
		Попытка
			
			Выполнить(Правило.ПередУдалением);
			
		Исключение
			
			СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
			ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
			ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
			ЗП.ПОД                    = Правило.Имя;
			ЗП.Объект                 = Строка(Объект) + "  (" + ТипЗнч(Объект) + ")";
			ЗП.Обработчик             = "ПередУдалениемОбъектаВыборки";
			ЗП.ОписаниеОшибки         = ОписаниеОшибки;
			ЗП.ПозицияМодуля          = СтрокаМодуля;
			ЗП.КодСообщения           = 29;
			ЗаписатьВПротоколВыполнения(29, ЗП);
			
		КонецПопытки;
		
	Иначе
		
		Выполнить(Правило.ПередУдалением);
		
	КонецЕсли;
	
	
	Если Отказ Тогда
		
		Возврат;
		
	КонецЕсли; 


	Если ФлагРежимОтладки Тогда
		
		Попытка
			
			Если УдалитьНепосредственно Тогда
				
				Объект.Удалить();
				
			ИначеЕсли Свойства.ИмяТипа = "РегистрСведений" Тогда
				
				Объект.Удалить();
				
			Иначе
				
				//УстановитьОбменДаннымиЗагрузка(Объект);
				Объект.УстановитьПометкуУдаления(Истина);
				
			КонецЕсли;
			
		Исключение
			
			СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
			ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
			ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
			ЗП.ПОД                    = Правило.Имя;
			ЗП.Объект                 = Строка(Объект) + "  (" + ТипЗнч(Объект) + ")";
			ЗП.ОписаниеОшибки         = ОписаниеОшибки;
			ЗП.ПозицияМодуля          = СтрокаМодуля;
			ЗП.КодСообщения           = 24;
			ЗаписатьВПротоколВыполнения(24, ЗП);
			
		КонецПопытки;
		
	Иначе
		
		Если УдалитьНепосредственно Тогда
			
			Объект.Удалить();
			
		ИначеЕсли Свойства.ИмяТипа = "РегистрСведений" Тогда
			
			Объект.Удалить();
			
		Иначе
			
			УстановитьОбменДаннымиЗагрузка(Объект);
			Объект.УстановитьПометкуУдаления(Истина);
			
		КонецЕсли;
		
	КонецЕсли; 

КонецПроцедуры // УдалениеОбъектаВыборки()

// Очищает данные по указанному правилу
//
// Параметры:
//  Правило        - ссылка на правило очистки данных
// 
Процедура ОчиститьДанныеПоПравилу(Правило)
	
	// Обработчик ПередОбработкой

	Отказ			= Ложь;
	ВыборкаДанных	= Неопределено;

	ИсходящиеДанные	= Неопределено;


	// Обработчик ПередОбработкойПравилаОчистки
	
	Если ФлагРежимОтладки Тогда
		
		Попытка
			
			Выполнить(Правило.ПередОбработкой);
			
		Исключение
			
			СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
			ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
			ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
			ЗП.ПОД                    = Правило.Имя;
			ЗП.Обработчик             = "ПередОбработкойПравилаОчистки";
			ЗП.ОписаниеОшибки         = ОписаниеОшибки;
			ЗП.ПозицияМодуля          = СтрокаМодуля;
			ЗП.КодСообщения           = 27;
			ЗаписатьВПротоколВыполнения(27, ЗП);
			
		КонецПопытки;
		
	Иначе
		
		Выполнить(Правило.ПередОбработкой);
		
	КонецЕсли;
	
	Если Отказ Тогда
		
		Возврат;
		
	КонецЕсли; 


    // Стандартная выборка
	
	Если Правило.СпособОтбораДанных = "СтандартнаяВыборка" Тогда
		
		Свойства	= Менеджеры[Правило.ОбъектВыборки];
		ИмяТипа		= Свойства.ИмяТипа;
		
		Если ИмяТипа = "Справочник" Тогда
			
			// Если удаление удет непосредственно, то достаточно удалить элементы верхнего уровня
			// элеменны групп удалятся вместе с группами
			Если Правило.Непосредственно Тогда
				Выборка = Свойства.Менеджер.Выбрать(Свойства.Менеджер.ПустаяСсылка());
			Иначе
				Выборка = Свойства.Менеджер.Выбрать();
			КонецЕсли;
			Состояние("Очистка справочника:  " + Свойства.Имя);
			
		ИначеЕсли ИмяТипа = "Документ" Тогда
			
	        Выборка =	Свойства.Менеджер.Выбрать(ДатаНачала, ДатаОкончания);
			Состояние("Удаление документов:  " + Свойства.Имя);
			
		ИначеЕсли ИмяТипа = "ПланВидовХарактеристик" Тогда
			
			// Если удаление удет непосредственно, то достаточно удалить элементы верхнего уровня
			// элеменны групп удалятся вместе с группами
			Если Правило.Непосредственно Тогда
				Выборка = Свойства.Менеджер.Выбрать(Свойства.Менеджер.ПустаяСсылка());
			Иначе
				Выборка = Свойства.Менеджер.Выбрать();
			КонецЕсли;
			Состояние("Очистка плана видов характеристик:  " + Свойства.Имя);
			
		ИначеЕсли ИмяТипа = "ПланСчетов" Тогда
			
			// Если удаление удет непосредственно, то достаточно удалить элементы верхнего уровня
			// элеменны групп удалятся вместе с группами
			Если Правило.Непосредственно Тогда
				Выборка = Свойства.Менеджер.Выбрать(Свойства.Менеджер.ПустаяСсылка());
			Иначе
				Выборка = Свойства.Менеджер.Выбрать();
			КонецЕсли;

			Состояние("Очистка плана счетов:  " + Свойства.Имя);
			
		ИначеЕсли ИмяТипа = "ПланВидовРасчета" Тогда
			
	        Выборка =	Свойства.Менеджер.Выбрать();
			Состояние("Очистка плана видов расчета:  " + Свойства.Имя);

		ИначеЕсли ИмяТипа = "РегистрСведений" Тогда
			
			Выборка =	Свойства.Менеджер.Выбрать();
			Состояние("Очистка регистра сведений:  " + Свойства.Имя);

		//ИначеЕсли ИмяТипа = "Константы" Тогда
			//НаборКонстант = Константы.СоздатьНабор();
			//НаборКонстант.Прочитать();
			//УдалениеОбъектаВыборки(НаборКонстант, Правило, Свойства, ИсходящиеДанные);
			
		Иначе
			
			Возврат;
			
		КонецЕсли;

		Если ИмяТипа <> "Константы" Тогда
			
			Пока Выборка.Следующий() Цикл
				
				ОбработкаПрерыванияПользователя();
				
				Если ИмяТипа =  "РегистрСведений" Тогда
					
					УдалениеОбъектаВыборки(Выборка.ПолучитьМенеджерЗаписи(), Правило, Свойства, ИсходящиеДанные);
					
				Иначе
					
					УдалениеОбъектаВыборки(Выборка.ПолучитьОбъект(), Правило, Свойства, ИсходящиеДанные);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;

	ИначеЕсли Правило.СпособОтбораДанных = "ПроизвольныйАлгоритм" Тогда

		Если ВыборкаДанных <> Неопределено Тогда
			
			ТипВыборки = ТипЗнч(ВыборкаДанных);
			
			Если ТипВыборки = Тип("ВыборкаИзРезультатаЗапроса") Тогда
				
				Пока ВыборкаДанных.Следующий() Цикл
					
					УдалениеОбъектаВыборки(ВыборкаДанных.Ссылка.ПолучитьОбъект(), Правило, , ИсходящиеДанные);
					
				КонецЦикла;	
				
			ИначеЕсли ТипВыборки = Тип("РезультатЗапроса") Тогда
				
				Выборка = ВыборкаДанных.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					УдалениеОбъектаВыборки(Выборка.Ссылка.ПолучитьОбъект(), Правило, , ИсходящиеДанные);
					
				КонецЦикла;
				
			ИначеЕсли ТипВыборки = Тип("Запрос") Тогда
				
				РезультатЗапроса = ВыборкаДанных.Выполнить();
				Выборка          = РезультатЗапроса.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					УдалениеОбъектаВыборки(Выборка.Ссылка.ПолучитьОбъект(), Правило, , ИсходящиеДанные);
					
				КонецЦикла;
				
			Иначе
				
				Для каждого Объект Из ВыборкаДанных Цикл
					
					УдалениеОбъектаВыборки(Объект.ПолучитьОбъект(), Правило, , ИсходящиеДанные);
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли; 
			
	КонецЕсли; 

	
	// Обработчик ПослеОбработкиПравилаОчистки

	Если ФлагРежимОтладки Тогда
		
		Попытка
			
			Выполнить(Правило.ПослеОбработки);
		Исключение
			
			СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
			ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
			ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
			ЗП.ПОД                    = Правило.Имя;
			ЗП.Обработчик             = "ПослеОбработкиПравилаОчистки";
			ЗП.ОписаниеОшибки         = ОписаниеОшибки;
			ЗП.ПозицияМодуля          = СтрокаМодуля;
			ЗП.КодСообщения           = 28;
			ЗаписатьВПротоколВыполнения(28, ЗП);
			
		КонецПопытки;
		
	Иначе
		
		Выполнить(Правило.ПослеОбработки);
		
	КонецЕсли;
	
КонецПроцедуры // ОчиститьДанныеПоПравилу()

// Обходит дерево правил очистки данных и выполняет очистку
//
// Параметры:
//  Строки         - Коллекция строк дерева значений
// 
Процедура ОбработатьПравилаОчистки(Строки)
	
	Для каждого ПравилоОчистки Из Строки Цикл
		
		Если ПравилоОчистки.Включить = 0 Тогда
			
			Продолжить;
			
		КонецЕсли; 

		Если ПравилоОчистки.ЭтоГруппа Тогда
			
			ОбработатьПравилаОчистки(ПравилоОчистки.Строки);
			Продолжить;
			
		КонецЕсли;
		
		ОчиститьДанныеПоПравилу(ПравилоОчистки);
		
	КонецЦикла; 
	
КонецПроцедуры // ОбработатьПравилаОчистки() 


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ЗАГРУЗКИ ДАННЫХ

// Устанавливает значение параметра "Загрузка" для свойства объекта "ОбменДанными".
//
// Параметры:
//  Объект   - объект, для которого устанавливается свойство
//  Значение - значение устанавливаемого свойства "Загрузка"
// 
Процедура УстановитьОбменДаннымиЗагрузка(Объект, Значение = Истина)
	
	Если ТипОбъекта(Объект)="Справочник" Тогда
		Если Объект.Ссылка.Пустая() И ЗначениеНеЗаполнено(Объект.Код) Тогда
			Объект.УстановитьНовыйКод();	
		КонецЕсли;  	
	КонецЕсли; 
	
//	Значение=Истина;
	
	Попытка
		Объект.ОбменДанными.Загрузка = Значение;
	Исключение
	КонецПопытки;
	
КонецПроцедуры // УстановитьОбменДаннымиЗагрузка()

Процедура УстановитьСсылкуНового(Объект, Менеджер, СвойстваПоиска)
	
	УИ = СвойстваПоиска["{УникальныйИдентификатор}"];
	
	Если УИ <> Неопределено Тогда
		
		Объект.УстановитьСсылкуНового(Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(УИ)));
		
		СвойстваПоиска.Удалить("{УникальныйИдентификатор}");
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьСсылкуНового()

// Ищет объект по номеру в списке уже загруженных объектов.
//
// Параметры:
//  Нпп          - номер искомого объекта в файле обмена
//
// Возвращаемое значение:
//  Ссылка на найденный объект. Если объект не найден, возвращается Неопределено.
// 
Функция НайтиОбъектПоНомеру(Нпп)

	Если Нпп = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЗагруженныеОбъекты[Нпп];
	КонецЕсли; 

КонецФункции // НайтиОбъектПоНомеру() 

// Создает новый объект указанного типа, устанавливает реквизиты, указанноые
// в структуре СвойстваПоиска.
//
// Параметры:
//  Тип            - тип создаваемого объекта
//  СвойстваПоиска - Структура, содержащая устанавливаемые реквизиты нового объекта
//
// Возвращаемое значение:
//  Новый объект информационной базы
// 
Функция СоздатьНовыйОбъект(Тип, СвойстваПоиска)

	СвойстваМД      = Менеджеры[Тип];
	ИмяТипа         = СвойстваМД.ИмяТипа;
	Менеджер        = СвойстваМД.Менеджер;
	ПометкаУдаления = Неопределено;

	
	Если ИмяТипа = "Справочник" Тогда
		
		ЭтоГруппа = СвойстваПоиска["ЭтоГруппа"];
		
		Если (ЭтоГруппа = Неопределено) Или Не ЭтоГруппа Тогда
			
			Объект = Менеджер.СоздатьЭлемент();
			
		Иначе
			
			Объект = Менеджер.СоздатьГруппу();
			
		КонецЕсли;
		
		УстановитьСсылкуНового(Объект, Менеджер, СвойстваПоиска);
		
	ИначеЕсли ИмяТипа = "Документ" Тогда
		
		Объект = Менеджер.СоздатьДокумент();
		
		УстановитьСсылкуНового(Объект, Менеджер, СвойстваПоиска);
		
	ИначеЕсли ИмяТипа = "ПланВидовХарактеристик" Тогда
		
		ЭтоГруппа = СвойстваПоиска["ЭтоГруппа"];
		
		Если (ЭтоГруппа = Неопределено) Или Не ЭтоГруппа Тогда
			
			Объект = Менеджер.СоздатьЭлемент();
			
		Иначе
			
			Объект = Менеджер.СоздатьГруппу();
			
		КонецЕсли; 
		
		УстановитьСсылкуНового(Объект, Менеджер, СвойстваПоиска);
		
	ИначеЕсли ИмяТипа = "ПланСчетов" Тогда
		
		Объект = Менеджер.СоздатьСчет();
		
		УстановитьСсылкуНового(Объект, Менеджер, СвойстваПоиска);
		
	ИначеЕсли ИмяТипа = "ПланВидовРасчета" Тогда
		
		Объект = Менеджер.СоздатьВидРасчета();
		
		УстановитьСсылкуНового(Объект, Менеджер, СвойстваПоиска);
		
	ИначеЕсли ИмяТипа = "РегистрСведений" Тогда
		
		Объект = Менеджер.СоздатьМенеджерЗаписи();
		Возврат Объект;
		
	КонецЕсли; 

	
	Для каждого Свойство Из СвойстваПоиска Цикл
		
		Имя      = Свойство.Ключ;
		Значение = Свойство.Значение;
		
		Если Имя = "ЭтоГруппа" Тогда
			
			Продолжить;
			
		ИначеЕсли Имя = "ПометкаУдаления" Тогда
			
			ПометкаУдаления = Значение;
			
		Иначе
			
			Объект[Имя] = Значение;
			
		КонецЕсли;
		
	КонецЦикла; 


	// Проверки

	Если ИмяТипа = "Документ" Тогда
		
		Если одПустое(Объект.Дата) Тогда
			
			Объект.Дата = РабочаяДата;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	//	!!!!!!!! Тут нужно проверить установлен ли владелец !!!!

	
	Если ФлагРежимОтладки Тогда
		
		Попытка
			
			УстановитьОбменДаннымиЗагрузка(Объект);
			Объект.Записать();
			
		Исключение
			
			СтрокаМодуля    = ОтделитьРазделителем(ОписаниеОшибки(), "{");
			ОписаниеОшибки  = ОтделитьРазделителем(СтрокаМодуля, "}: ");
			ЗП = ПолучитьСтруктуруЗаписиПротокола();
			ЗП.Объект         = Объект;
			ЗП.ТипОбъекта     = Тип;
			
			ТипОбъекта=ТипОбъекта(Объект);
			Если ТипОбъекта="Справочник" Тогда
				ДопИнфо=""+Объект.Код+" "+Объект.Наименование+" "+Объект.Владелец+" "+Объект.Родитель;
			Иначе
				ДопИнфо="";				
			КонецЕсли; 
			
			ЗП.ОписаниеОшибки = ОписаниеОшибки+" "+ДопИнфо;			
			
			ЗП.КодСообщения   = 26;
			ЗаписатьВПротоколВыполнения(26, ЗП, Истина);
			
			ЕстьОшибкиЗагрузки=Истина;
		КонецПопытки;
		
	Иначе
		
		УстановитьОбменДаннымиЗагрузка(Объект);
		Объект.Записать();
		
	КонецЕсли;
	

	Если ПометкаУдаления <> Неопределено Тогда
		
		УстановитьОбменДаннымиЗагрузка(Объект);
		Объект.УстановитьПометкуУдаления(ПометкаУдаления);
		
	Иначе
		
		УстановитьОбменДаннымиЗагрузка(Объект);
		Объект.УстановитьПометкуУдаления(Истина);
		
	КонецЕсли;

	Возврат Объект.Ссылка;
	
КонецФункции // СоздатьНовыйОбъект()

// Читает из файла узел свойства объекта, устанавливает значение свойства
//
// Параметры:
//  Тип            - тип значения свойства
//  ОбъектНайден   - если после выполнения функции - Ложь, то значит
//                   объект свойства не найден в информационной базе и создан новый
//
// Возвращаемое значение:
//  Значение свойства
// 
Функция ПрочитатьСвойство(Тип, ОбъектНайден=Истина)

	Значение = Неопределено;
	
	Пока ФайлОбмена.Прочитать() Цикл
		
		ИмяУзла = ФайлОбмена.ЛокальноеИмя;
		ТипУзла = ФайлОбмена.ТипУзла;
		
		Если      ИмяУзла = "Значение" Тогда
			
			ИскатьПоСвойству = одАтрибут(ФайлОбмена, одТипСтрока, "Свойство");
			Значение         = одЗначениеЭлемента(ФайлОбмена, Тип, ИскатьПоСвойству);
			
		ИначеЕсли ИмяУзла = "Пусто" Тогда
			
			Значение = одПолучитьПустоеЗначение(Тип);
			
		ИначеЕсли ИмяУзла = "Ссылка" Тогда
			
			Значение       = НайтиОбъектПоСсылке(Тип, , ОбъектНайден);
			
		ИначеЕсли ИмяУзла = "Выражение" Тогда
			
			Значение = Вычислить(одЗначениеЭлемента(ФайлОбмена, одТипСтрока));
			
		ИначеЕсли ИмяУзла = "Нпп" Тогда
			
			одПропустить(ФайлОбмена);
			
		ИначеЕсли (ИмяУзла = "Свойство") И (ТипУзла = одТипУзлаXML_КонецЭлемента) Тогда
			
			Прервать;
			
		Иначе
			
			ЗаписатьВПротоколВыполнения(9);
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Значение;
	
КонецФункции // ПрочитатьСвойство() 

// Производит поиск объекта в информационной базе, если не найден создает новый
//
// Параметры:
//  ТипОбъекта     - тип искомого объекта
//  СвойстваПоиска - структура, содержащая свойства по которым производится поиск объекта
//  ОбъектНайден   - если Ложь, то объект не найден, а создан новый
//
// Возвращаемое значение:
//  Новый или найденный объект информационной базы
//  
Функция НайтиОбъектПоСсылке(ТипОбъекта, СвойстваПоиска = "", ОбъектНайден = Истина)

	Если ЗапоминатьЗагруженныеОбъекты Тогда
		
		НппСсылки = одАтрибут(ФайлОбмена, одТипЧисло, "Нпп");
		
		Объект    = НайтиОбъектПоНомеру(НппСсылки);
		
		Если Объект <> Неопределено Тогда
			
			одПропустить(ФайлОбмена);
			Возврат Объект;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СвойстваПоиска = "" Тогда
		
		СвойстваПоиска = Новый Соответствие;
		
	КонецЕсли; 

	Пока ФайлОбмена.Прочитать() Цикл
		
		ИмяУзла = ФайлОбмена.ЛокальноеИмя;
		ТипУзла = ФайлОбмена.ТипУзла;
		
		Если ИмяУзла = "Свойство" Тогда
			
			Имя                 = одАтрибут(ФайлОбмена, одТипСтрока, "Имя");
			ТипСвойства         = Тип(одАтрибут(ФайлОбмена, одТипСтрока, "Тип"));
			ЗначениеСвойства    = ПрочитатьСвойство(ТипСвойства, ОбъектНайден);
			
			Если (Имя = "ЭтоГруппа") И (Не ЗначениеСвойства) Тогда
				
				Продолжить;
				
			КонецЕсли; 
			
			СвойстваПоиска[Имя] = ЗначениеСвойства;
			
		ИначеЕсли (ИмяУзла = "Ссылка") И (ТипУзла = одТипУзлаXML_КонецЭлемента) Тогда
			
			Прервать;
			
		Иначе
			
			ЗаписатьВПротоколВыполнения(9);
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;

	
	Если Не ОбъектНайден Тогда
		
		Объект = СоздатьНовыйОбъект(ТипОбъекта, СвойстваПоиска);
		
	Иначе
		
		ИскатьЗапросом     = Ложь;
		КолвоСвойствПоиска = СвойстваПоиска.Количество();
		СтруктураСвойств   = Менеджеры[ТипОбъекта];
		ИмяТипаОбъекта     = СтруктураСвойств.ИмяТипа;
		
		СвойствоУникальныйИдентификатор = СвойстваПоиска["{УникальныйИдентификатор}"];
		СвойствоИмяПредопределенного = СвойстваПоиска["{ИмяПредопределенногоЭлемента}"];
		
		Если СвойствоИмяПредопределенного <> Неопределено Тогда
			
			Объект = одНайтиОбъектПоСвойству(СтруктураСвойств.Менеджер, "{ИмяПредопределенногоЭлемента}", СвойствоИмяПредопределенного);
			
			Если Объект.Пустая() Тогда
				
				ОбъектНайден = Ложь;
				Объект       = СоздатьНовыйОбъект(ТипОбъекта, СвойстваПоиска);
				
			ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(ТипЗнч(Объект)) Тогда
				Возврат Объект;				
			Иначе
				
				НайденныйОбъект = Объект.ПолучитьОбъект();
				
				Для каждого Свойство Из СвойстваПоиска Цикл
					
					Имя      = Свойство.Ключ;
					Значение = Свойство.Значение;
					
					Если Имя = "ЭтоГруппа" ИЛИ Имя = "{УникальныйИдентификатор}" ИЛИ Имя = "{ИмяПредопределенногоЭлемента}" Тогда
						
						Продолжить;
						
					ИначеЕсли Имя = "ПометкаУдаления" Тогда
						
						УстановитьОбменДаннымиЗагрузка(НайденныйОбъект);
						НайденныйОбъект.УстановитьПометкуУдаления(Значение);
						
					Иначе
						
						НайденныйОбъект[Имя] = Значение;
						
					КонецЕсли;
					
				КонецЦикла;
				
				УстановитьОбменДаннымиЗагрузка(НайденныйОбъект);
				НайденныйОбъект.Записать();
				
			КонецЕсли;
			
		ИначеЕсли (СвойствоУникальныйИдентификатор <> Неопределено) Тогда
				
			Объект = одНайтиОбъектПоСвойству(СтруктураСвойств.Менеджер, "{УникальныйИдентификатор}", СвойствоУникальныйИдентификатор);
			
			Если Объект.Пустая() Тогда
				
				ОбъектНайден = Ложь;
				Объект       = СоздатьНовыйОбъект(ТипОбъекта, СвойстваПоиска);
				
			Иначе
				
				НайденныйОбъект = Объект.ПолучитьОбъект();
				
				Для каждого Свойство Из СвойстваПоиска Цикл
					
					Имя      = Свойство.Ключ;
					Значение = Свойство.Значение;
					
					Если Имя = "ЭтоГруппа" ИЛИ Имя = "{УникальныйИдентификатор}" ИЛИ Имя = "{ИмяПредопределенногоЭлемента}" Тогда
						
						Продолжить;
						
					ИначеЕсли Имя = "ПометкаУдаления" Тогда
						
						УстановитьОбменДаннымиЗагрузка(НайденныйОбъект);
						НайденныйОбъект.УстановитьПометкуУдаления(Значение);
						
					Иначе
						
						НайденныйОбъект[Имя] = Значение;
						
					КонецЕсли;
					
				КонецЦикла; 
				
				УстановитьОбменДаннымиЗагрузка(НайденныйОбъект);
				НайденныйОбъект.Записать();
				
			КонецЕсли;
		
		ИначеЕсли КолвоСвойствПоиска = 1 Тогда
			
			Для каждого Свойство Из СвойстваПоиска Цикл
				
				ИмяПараметра      = Свойство.Ключ;
				ЗначениеПараметра = Свойство.Значение;
				Объект            = одНайтиОбъектПоСвойству(СтруктураСвойств.Менеджер, ИмяПараметра, ЗначениеПараметра);
				
			КонецЦикла;
			
			Если Объект.Пустая() Тогда
				
				ОбъектНайден = Ложь;
				Объект       = СоздатьНовыйОбъект(ТипОбъекта, СвойстваПоиска);
				
			КонецЕсли;
			
		ИначеЕсли ИмяТипаОбъекта = "Документ" Тогда
			
			Если КолвоСвойствПоиска = 2 Тогда
				
				НомерДокумента = СвойстваПоиска["Номер"];
				ДатаДокумента  = СвойстваПоиска["Дата"];
				
				Если (НомерДокумента <> Неопределено) И (ДатаДокумента <> Неопределено) Тогда
					
					Объект = СтруктураСвойств.Менеджер.НайтиПоНомеру(НомерДокумента, ДатаДокумента);
					
					Если Объект.Пустая() Тогда
						
						ОбъектНайден = Ложь;
						Объект       = СоздатьНовыйОбъект(ТипОбъекта, СвойстваПоиска);
					ИначеЕсли Объект.Дата<>ДатаДокумента Тогда
//						Объект.Дата=ДатаДокумента;						
					КонецЕсли;
					
				Иначе
					
					ИскатьЗапросом = Истина;
					
				КонецЕсли;
				
			Иначе
				
				ИскатьЗапросом = Истина;
				
			КонецЕсли;
			
		ИначеЕсли ИмяТипаОбъекта = "Справочник" Тогда
			
			Владелец     = СвойстваПоиска["Владелец"];
			Родитель     = СвойстваПоиска["Родитель"];
			Код          = СвойстваПоиска["Код"];
			Наименование = СвойстваПоиска["Наименование"];
			
			Кол          = 0;
			
			Если Владелец <> Неопределено Тогда
				
				Кол = 1 + Кол;
				
			КонецЕсли;
			
			Если Родитель <> Неопределено Тогда
				
				Кол = 1 + Кол;
				
			КонецЕсли;
			
			Если Код <> Неопределено Тогда
				
				Кол = 1 + Кол;
				
			КонецЕсли;
			
			Если Наименование <> Неопределено Тогда
				
				Кол = 1 + Кол;
				
			КонецЕсли;
			
			Если Кол = КолвоСвойствПоиска Тогда
				
				Если (Код <> Неопределено) И (Наименование = Неопределено) Тогда
					
					Объект = СтруктураСвойств.Менеджер.НайтиПоКоду(Код, , Родитель, Владелец);
					
					Если Объект.Пустая() Тогда
						
						ОбъектНайден = Ложь;
						Объект       = СоздатьНовыйОбъект(ТипОбъекта, СвойстваПоиска);
						
					КонецЕсли;
					
				ИначеЕсли (Код = Неопределено) И (Наименование <> Неопределено) Тогда
					
					Объект = СтруктураСвойств.Менеджер.НайтиПоНаименованию(Наименование, ИСТИНА, Родитель, Владелец);
					
					Если Объект.Пустая() Тогда
						
						ОбъектНайден = Ложь;
						Объект       = СоздатьНовыйОбъект(ТипОбъекта, СвойстваПоиска);
						
					КонецЕсли;
					
				Иначе
					
					ИскатьЗапросом = Истина;
					
				КонецЕсли;
				
			Иначе
				
				ИскатьЗапросом = Истина;
				
			КонецЕсли;
			
		ИначеЕсли ИмяТипаОбъекта = "ПланВидовХарактеристик" Тогда
			
			Родитель     = СвойстваПоиска["Родитель"];
			Код          = СвойстваПоиска["Код"];
			Наименование = СвойстваПоиска["Наименование"];
			Кол          = 0;
			
			Если Родитель     <> Неопределено Тогда	Кол = 1 + Кол КонецЕсли;
			Если Код          <> Неопределено Тогда Кол = 1 + Кол КонецЕсли;
			Если Наименование <> Неопределено Тогда	Кол = 1 + Кол КонецЕсли;
			
			Если Кол = КолвоСвойствПоиска Тогда
				
				Если     (Код <> Неопределено) И (Наименование = Неопределено) Тогда
					
					Объект = СтруктураСвойств.Менеджер.НайтиПоКоду(Код, Родитель);
					
					Если Объект.Пустая() Тогда
						
						ОбъектНайден = Ложь;
						Объект       = СоздатьНовыйОбъект(ТипОбъекта, СвойстваПоиска);
						
					КонецЕсли;
					
				ИначеЕсли (Код = Неопределено) И (Наименование <> Неопределено) Тогда
					
					Объект = СтруктураСвойств.Менеджер.НайтиПоНаименованию(Наименование, ИСТИНА, Родитель);
					
					Если Объект.Пустая() Тогда
						
						ОбъектНайден = Ложь;
						Объект       = СоздатьНовыйОбъект(ТипОбъекта, СвойстваПоиска);
						
					КонецЕсли;
					
				Иначе
					
					ИскатьЗапросом = Истина;
					
				КонецЕсли;
				
			Иначе
				
				ИскатьЗапросом = Истина;
				
			КонецЕсли;
			
		Иначе
			
			ИскатьЗапросом = Истина;
			
		КонецЕсли;
		
		Если ИскатьЗапросом Тогда
			
			ЗапросПоиска       = Новый Запрос();
			ТекстЗапроса       = СтруктураСвойств.СтрокаПоиска;
			
			Для каждого Свойство Из СвойстваПоиска Цикл
				
				ИмяПараметра      = Свойство.Ключ;
				ЗначениеПараметра = Свойство.Значение;
				ЗапросПоиска.УстановитьПараметр(ИмяПараметра, ЗначениеПараметра);
				
				Попытка
					
					Длина = Менеджеры[ТипОбъекта].ОбъектМД.Реквизиты[ИмяПараметра].Тип.КвалификаторыСтроки.Длина;
					
					Если Длина = 0 И ТипЗнч(ЗначениеПараметра) = Тип("Строка") И Менеджеры[ТипОбъекта].ОбъектМД.Реквизиты[ИмяПараметра].Тип.СодержитТип(Тип("Строка")) Тогда
						
						СтрокаНеограниченнойДлины = Истина;
						
					Иначе
						
						СтрокаНеограниченнойДлины = Ложь;
						
					КонецЕсли;
					
				Исключение
					
					СтрокаНеограниченнойДлины = Ложь;
					
				КонецПопытки;
				
				Если СтрокаНеограниченнойДлины Тогда
					
					ТекстЗапроса = ТекстЗапроса + ?(КолвоСвойствПоиска <> СвойстваПоиска.Количество(), " И ", "") + ИмяПараметра + " ПОДОБНО &" + ИмяПараметра;
					
				Иначе
					
					ТекстЗапроса = ТекстЗапроса + ?(КолвоСвойствПоиска <> СвойстваПоиска.Количество(), " И ", "") + ИмяПараметра + " = &" + ИмяПараметра;
					
				КонецЕсли;
				
				КолвоСвойствПоиска = КолвоСвойствПоиска - 1;
				
			КонецЦикла;
			
			ЗапросПоиска.Текст = ТекстЗапроса;
			Результат = ЗапросПоиска.Выполнить();
			
			Если Результат.Пустой() Тогда
				
				ОбъектНайден = Ложь;
				Объект       = СоздатьНовыйОбъект(ТипОбъекта, СвойстваПоиска);
				
			Иначе
				
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				Объект = Выборка.Ссылка;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

	Если ЗапоминатьЗагруженныеОбъекты Тогда
		
		Если НппСсылки <> 0 Тогда
			
			ЗагруженныеОбъекты[НппСсылки] = Объект;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Объект;
	
КонецФункции // НайтиОбъектПоСсылке() 

// Устанавливает свойства объекта (записи)
//
// Параметры:
//  Запись         - объект, свойства которого устанавливаем
//                   Например, строка табличной части или запись регистра
//
Процедура УстановитьСвойстваЗаписи(Запись)

	Пока ФайлОбмена.Прочитать() Цикл
		
		ИмяУзла = ФайлОбмена.ЛокальноеИмя;
		ТипУзла = ФайлОбмена.ТипУзла;
		
		Если      ИмяУзла = "Свойство" Тогда
			
			Имя         = одАтрибут(ФайлОбмена, одТипСтрока, "Имя");
			
			Если Имя = "ВидДвижения" И Найти(Метаданные.НайтиПоТипу(ТипЗнч(Запись)).ПолноеИмя(), "РегистрНакопления") Тогда
				
				ТипСвойства = одТипВидДвиженияНакопления;
				
			Иначе
				
				ТипСвойства = Тип(одАтрибут(ФайлОбмена, одТипСтрока,  "Тип"));
				
			КонецЕсли;
				
			Запись[Имя] = ПрочитатьСвойство(ТипСвойства);
			
		ИначеЕсли ИмяУзла = "СубконтоДт" ИЛИ ИмяУзла = "СубконтоКт" Тогда
			
			Ключ = Неопределено;
			Значение = Неопределено;
			
			Пока ФайлОбмена.Прочитать() Цикл
				
				ИмяУзла = ФайлОбмена.ЛокальноеИмя;
				ТипУзла = ФайлОбмена.ТипУзла;
				
				Если ИмяУзла = "Свойство" Тогда
					
					Имя = одАтрибут(ФайлОбмена, одТипСтрока, "Имя");
					ТипСвойства = Тип(одАтрибут(ФайлОбмена, одТипСтрока,  "Тип"));
					
					Если Имя = "Ключ" Тогда
						
						Ключ = ПрочитатьСвойство(ТипСвойства);
						
					ИначеЕсли Имя = "Значение" Тогда
						
						Значение = ПрочитатьСвойство(ТипСвойства);
						
					КонецЕсли;
					
				ИначеЕсли (ИмяУзла = "СубконтоДт" ИЛИ ИмяУзла = "СубконтоКт") И (ТипУзла = одТипУзлаXML_КонецЭлемента) Тогда
					
					Прервать;
					
				Иначе
					
					ЗаписатьВПротоколВыполнения(9);
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если Ключ <> Неопределено И Значение <> Неопределено Тогда
				
				Запись[ИмяУзла][Ключ] = Значение;
				
			КонецЕсли;
			
		//ИначеЕсли ИмяУзла = "СубконтоКт" Тогда
		//	
		//	одПропустить(ФайлОбмена);
			
		ИначеЕсли (ИмяУзла = "Запись") И (ТипУзла = одТипУзлаXML_КонецЭлемента) Тогда
			
			Прервать;
			
		Иначе
			
			ЗаписатьВПротоколВыполнения(9);
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // УстановитьСвойстваЗаписи()

// Загружает табличную часть объекта
//
// Параметры:
//  Объект         - объект, табличную часть которого загружаем
//  Имя            - имя табличной части
//  Очистить       - если Истина, то табличная часть преварительно очищается
// 
Процедура ЗагрузитьТабличнуюЧасть(Объект, Имя, Очистить)

	ТЧ = Объект[Имя];

	Если Очистить Тогда
		Попытка
			ТЧ.Очистить();
		Исключение
			
		КонецПопытки;
		
	КонецЕсли;

	Пока ФайлОбмена.Прочитать() Цикл
		
		ИмяУзла = ФайлОбмена.ЛокальноеИмя;
		ТипУзла = ФайлОбмена.ТипУзла;
		
		Если      ИмяУзла = "Запись" Тогда
			Попытка
				Запись = ТЧ.Добавить();
			Исключение
				Запись = Неопределено;
			КонецПопытки;
			
			Если Запись = Неопределено Тогда
				одПропустить(ФайлОбмена);
			Иначе
				УстановитьСвойстваЗаписи(Запись);
			КонецЕсли;
			
		ИначеЕсли (ИмяУзла = "ТабличнаяЧасть") И (ТипУзла = одТипУзлаXML_КонецЭлемента) Тогда
			
			Прервать;
			
		Иначе
			
			ЗаписатьВПротоколВыполнения(9);
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Имя="Товары" Тогда
		КонтрольДублейСтрок(Объект);	
	КонецЕсли; 
	
КонецПроцедуры // ЗагрузитьТабличнуюЧасть() 

// Загружает движения объекта
//
// Параметры:
//  Объект         - объект, движения которого загружаем
//  Имя            - имя регистра
//  Очистить       - если Истина, то движения преварительно очищается
// 
Процедура ЗагрузитьДвижения(Объект, Имя, Очистить)

	Движения = Объект.Движения[Имя];

	Если Очистить Тогда
		
		Движения.Очистить();
		
	КонецЕсли;

	Пока ФайлОбмена.Прочитать() Цикл
		
		ИмяУзла = ФайлОбмена.ЛокальноеИмя;
		ТипУзла = ФайлОбмена.ТипУзла;
		
		Если      ИмяУзла = "Запись" Тогда
			
			Запись = Движения.Добавить();
			УстановитьСвойстваЗаписи(Запись);
			
		ИначеЕсли (ИмяУзла = "НаборЗаписей") И (ТипУзла = одТипУзлаXML_КонецЭлемента) Тогда
			
			Прервать;
			
		Иначе
			
			ЗаписатьВПротоколВыполнения(9);
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗагрузитьДвижения() 

// Загружает объект типа ОписаниеТипов из указанного xml-источника
//
// Параметры:
//  Источник         - xml-источник
// 
Функция ЗагрузитьТипыОбъекта(Источник)

	// КвалификаторыДаты

	СоставДаты =  одАтрибут(Источник, одТипСтрока,  "СоставДаты");

	
	// КвалификаторыСтроки

	Длина           =  одАтрибут(Источник, одТипЧисло,  "Длина");
	ДлинаДопустимая =  одАтрибут(Источник, одТипСтрока, "ДопустимаяДлина");

	
	// КвалификаторыЧисла

	Разрядность             = одАтрибут(Источник, одТипЧисло,  "Разрядность");
	РазрядностьДробнойЧасти = одАтрибут(Источник, одТипЧисло,  "РазрядностьДробнойЧасти");
	ЗнакДопустимый          = одАтрибут(Источник, одТипСтрока, "ДопустимыйЗнак");


	// Читаем массив типов
	
	МассивТипов = Новый Массив;
	
	Пока Источник.Прочитать() Цикл
		ИмяУзла = Источник.ЛокальноеИмя;
		ТипУзла = Источник.ТипУзла;
		Если      ИмяУзла = "Тип" Тогда
			МассивТипов.Добавить(Тип(одЗначениеЭлемента(Источник, одТипСтрока)));
		ИначеЕсли (ИмяУзла = "Типы") И (ТипУзла = одТипУзлаXML_КонецЭлемента) Тогда
			Прервать;
		Иначе
			ЗаписатьВПротоколВыполнения(9);
			Прервать;
		КонецЕсли;
	КонецЦикла;


	
	Если МассивТипов.Количество() > 0 Тогда
		
		// КвалификаторыДаты
		
		Если СоставДаты = "Дата" Тогда
			КвалификаторыДаты   = Новый КвалификаторыДаты(ЧастиДаты.Дата);
		ИначеЕсли СоставДаты = "ДатаВремя" Тогда
			КвалификаторыДаты   = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
		ИначеЕсли СоставДаты = "Время" Тогда
			КвалификаторыДаты   = Новый КвалификаторыДаты(ЧастиДаты.Время);
		Иначе
			КвалификаторыДаты   = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
		КонецЕсли; 


		// КвалификаторыЧисла
		
		Если Разрядность > 0 Тогда
			Если ЗнакДопустимый = "Неотрицательный" Тогда
				Знак = ДопустимыйЗнак.Неотрицательный;
			Иначе
				Знак = ДопустимыйЗнак.Любой;
			КонецЕсли; 
			КвалификаторыЧисла  = Новый КвалификаторыЧисла(Разрядность, РазрядностьДробнойЧасти, Знак);
		Иначе
			КвалификаторыЧисла  = Новый КвалификаторыЧисла();
		КонецЕсли; 


		// КвалификаторыСтроки

		Если Длина > 0 Тогда
			Если ДлинаДопустимая = "Фиксированная" Тогда
				ДлинаДопустимая = ДопустимаяДлина.Фиксированная;
			Иначе
				ДлинаДопустимая = ДопустимаяДлина.Переменная;
			КонецЕсли;
			КвалификаторыСтроки = Новый КвалификаторыСтроки(Длина, ДлинаДопустимая);
		Иначе
			КвалификаторыСтроки = Новый КвалификаторыСтроки();
		КонецЕсли; 
        
		Возврат Новый ОписаниеТипов(МассивТипов, КвалификаторыЧисла, КвалификаторыСтроки, КвалификаторыДаты);
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции // ЗагрузитьТипыОбъекта()

// Читает очередной объект из файла обмена, производит загрузку
//
// Параметры:
//  Нет.
// 
Процедура ПрочитатьОбъект()

	Нпп						= одАтрибут(ФайлОбмена, одТипЧисло,  "Нпп");
	Источник				= одАтрибут(ФайлОбмена, одТипСтрока, "Источник");
	ИмяПравила				= одАтрибут(ФайлОбмена, одТипСтрока, "ИмяПравила");
	НеЗамещатьОбъект 		= одАтрибут(ФайлОбмена, одТипБулево, "НеЗамещать");
	ПрефиксАвтонумерации	= одАтрибут(ФайлОбмена, одТипСтрока, "ПрефиксАвтонумерации");
	ТипОбъектаСтрокой       = одАтрибут(ФайлОбмена, одТипСтрока, "Тип");
	ТипОбъекта 				= Тип(ТипОбъектаСтрокой);


	Если ФлагКомментироватьОбработкуОбъектов Тогда
		
		СтрокаСообщения = "Загрузка объекта № " + Нпп;
		ЗП = ПолучитьСтруктуруЗаписиПротокола();
		
		Если Не ПустаяСтрока(ИмяПравила) Тогда
			
			ЗП.ИмяПКО = ИмяПравила;
			
		КонецЕсли;
		
		Если Не ПустаяСтрока(Источник) Тогда
			
			ЗП.Источник = Источник;
			
		КонецЕсли;
		
		ЗП.ТипОбъекта = ТипОбъекта;
		ЗаписатьВПротоколВыполнения(СтрокаСообщения, ЗП, Ложь);
		
	КонецЕсли; 
    
	
	СтруктураСвойств = Менеджеры[ТипОбъекта];
	ИмяТипаОбъекта   = СтруктураСвойств.ИмяТипа;


	Если ИмяТипаОбъекта = "Документ" Тогда
		
		РежимЗаписи     = одАтрибут(ФайлОбмена, одТипСтрока, "РежимЗаписи");
		РежимПроведения = одАтрибут(ФайлОбмена, одТипСтрока, "РежимПроведения");
		
	КонецЕсли;
	
	
	Объект          = Неопределено;
	ОбъектНайден    = Истина;
	ПометкаУдаления = Неопределено;
	
	СвойстваПоиска  = Новый Соответствие;


	ЕстьОбработчикПередЗагрузкой = Ложь;
	ЕстьОбработчикПриЗагрузке    = Ложь;
	ЕстьОбработчикПослеЗагрузки  = Ложь;
	
	Если Не ПустаяСтрока(ИмяПравила) Тогда
		
		Правило = Правила[ИмяПравила];
		ЕстьОбработчикПередЗагрузкой = Правило.ЕстьОбработчикПередЗагрузкой;
		ЕстьОбработчикПриЗагрузке    = Правило.ЕстьОбработчикПриЗагрузке;
		ЕстьОбработчикПослеЗагрузки  = Правило.ЕстьОбработчикПослеЗагрузки;
		
	КонецЕсли;


    // Глобальный обработчик события ПередЗагрузкойОбъекта
	
	Если ЕстьГлобальныйОбработчикПередЗагрузкойОбъекта Тогда
		
		Отказ = Ложь;
		
		Если ФлагРежимОтладки Тогда
			
			Попытка
				
				Выполнить(Конвертация.ПередЗагрузкойОбъекта);
				
			Исключение
				
				СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
				ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");

				ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
				ЗП.ИмяПКО                 = ИмяПравила;
				
				Если Не ПустаяСтрока(Источник) Тогда
					
					ЗП.Источник           = Источник;
					
				КонецЕсли;
				
				ЗП.ТипОбъекта             = ТипОбъекта;
				
				ЗП.Обработчик             = "ПередЗагрузкойОбъекта (глобальный)";
				ЗП.ОписаниеОшибки         = ОписаниеОшибки;
				ЗП.ПозицияМодуля          = СтрокаМодуля;
				ЗП.КодСообщения           = 53;
				ЗаписатьВПротоколВыполнения(53, ЗП);
				
			КонецПопытки;
			
		Иначе
			
			Выполнить(Конвертация.ПередЗагрузкойОбъекта);
			
		КонецЕсли;
		
		Если Отказ Тогда	//	Отказ от загрузки объекта
			
			одПропустить(ФайлОбмена, "Объект");
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
    // Обработчик события ПередЗагрузкойОбъекта
	
	Если ЕстьОбработчикПередЗагрузкой Тогда
		
		Отказ = Ложь;
		
		Если ФлагРежимОтладки Тогда
			
			Попытка
				
				Выполнить(Правило.ПередЗагрузкой);
				
			Исключение
				
				СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
				ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");

				ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
				ЗП.ИмяПКО                 = ИмяПравила;
				Если Не ПустаяСтрока(Источник) Тогда
					
					ЗП.Источник           = Источник;
					
				КонецЕсли;
				
				ЗП.ТипОбъекта             = ТипОбъекта;
				
				ЗП.Обработчик             = "ПередЗагрузкойОбъекта";
				ЗП.ОписаниеОшибки         = ОписаниеОшибки;
				ЗП.ПозицияМодуля          = СтрокаМодуля;
				ЗП.КодСообщения           = 19;
				ЗаписатьВПротоколВыполнения(19, ЗП);
				
			КонецПопытки;
			
		Иначе
			
			Выполнить(Правило.ПередЗагрузкой);
			
		КонецЕсли;
		
		Если Отказ Тогда // Отказ от загрузки объекта
			
			одПропустить(ФайлОбмена, "Объект");
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;

	ЕстьИзмененияСвойств=Ложь;
	ИзмененнныеСвойства="";
	
	Пока ФайлОбмена.Прочитать() Цикл
		
		ИмяУзла = ФайлОбмена.ЛокальноеИмя;
		ТипУзла = ФайлОбмена.ТипУзла;
		
		Если ИмяУзла = "Свойство" Тогда
			
			Если Объект = Неопределено Тогда
				
				ОбъектНайден = Ложь;

			    // Обработчик события ПриЗагрузкеОбъекта
				
				Если ЕстьОбработчикПриЗагрузке Тогда
					
					Если ФлагРежимОтладки Тогда
						
						Попытка
							
							Выполнить(Правило.ПриЗагрузке);
							
						Исключение
							
							СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
							ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
							ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
							ЗП.ИмяПКО                 = ИмяПравила;
							
							Если Не ПустаяСтрока(Источник) Тогда
								
								ЗП.Источник           = Источник;
								
							КонецЕсли;
							
							ЗП.ТипОбъекта             = ТипОбъекта;
							ЗП.Объект                 = Строка(Объект);
							ЗП.Обработчик             = "ПриЗагрузкеОбъекта";
							ЗП.ОписаниеОшибки         = ОписаниеОшибки;
							ЗП.ПозицияМодуля          = СтрокаМодуля;
							ЗП.КодСообщения           = 20;
							ЗаписатьВПротоколВыполнения(20, ЗП);
							
						КонецПопытки;
						
					Иначе
						
						Выполнить(Правило.ПриЗагрузке);
						
					КонецЕсли;
					
				КонецЕсли;

				Если Объект = Неопределено Тогда
					
					Если ИмяТипаОбъекта = "РегистрСведений" Тогда
						
						Объект = СоздатьНовыйОбъект(ТипОбъекта, СвойстваПоиска);
						
					ИначеЕсли ИмяТипаОбъекта = "Константы" Тогда
						
						Объект = Константы.СоздатьНабор();
						Объект.Прочитать();
						
					Иначе
						
						Ссылка = СоздатьНовыйОбъект(ТипОбъекта, СвойстваПоиска);
						Объект = Ссылка.ПолучитьОбъект();
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли; 

			
			Имя                = одАтрибут(ФайлОбмена, одТипСтрока, "Имя");
			НеЗамещатьСвойство = одАтрибут(ФайлОбмена, одТипБулево, "НеЗамещать");

			Попытка
			Если (ОбъектНайден И НеЗамещатьСвойство) ИЛИ (Имя = "ЭтоГруппа") ИЛИ (Объект[Имя] = NULL) Тогда
				
				одПропустить(ФайлОбмена, "Свойство");
				Продолжить;
				
			КонецЕсли; 
		Исключение
			Сообщить(""+Объект.Метаданные().имя+" "+Объект+" "+имя);
			КонецПопытки;

			
			ТипСвойства = Тип(одАтрибут(ФайлОбмена, одТипСтрока,  "Тип"));
			Значение    = ПрочитатьСвойство(ТипСвойства);

			
			Если Имя = "ПометкаУдаления" Тогда
				
				ПометкаУдаления = Значение;
				
			Иначе
				
				Если ФлагРежимОтладки Тогда
					
					Попытка
						
						Если Объект[Имя] <> Значение Тогда
							Объект[Имя] = Значение;					
							ЕстьИзмененияСвойств	=Истина;					
							ИзмененнныеСвойства     =ИзмененнныеСвойства+Имя+" ";
						КонецЕсли;					
						
					Исключение
						
						СтрокаМодуля    = ОтделитьРазделителем(ОписаниеОшибки(), "{");
						ОписаниеОшибки  = ОтделитьРазделителем(СтрокаМодуля, "}: ");
						ЗП = ПолучитьСтруктуруЗаписиПротокола();
						ЗП.ИмяПКО           = ИмяПравила;
						ЗП.Нпп              = Нпп;
						ЗП.Источник         = Источник;
						ЗП.Объект           = Объект;
						ЗП.ТипОбъекта       = ТипОбъекта;
						ЗП.Свойство         = Имя;
						ЗП.Значение         = Значение;
						ЗП.ТипЗначения      = ТипЗнч(Значение);
						ЗП.ОписаниеОшибки   = ОписаниеОшибки;
						ЗП.КодСообщения     = 26;
						ЗаписатьВПротоколВыполнения(26, ЗП, Истина);
						
					КонецПопытки;
					
				Иначе
					
					Если Объект[Имя] <> Значение Тогда
						Объект[Имя] = Значение;					
						ЕстьИзмененияСвойств=Истина;					
						ИзмененнныеСвойства     =ИзмененнныеСвойства+Имя+" ";
					КонецЕсли;					
					
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ИмяУзла = "Ссылка" Тогда

			Ссылка = НайтиОбъектПоСсылке(ТипОбъекта, СвойстваПоиска, ОбъектНайден);
			
			Если Перечисления.ТипВсеСсылки().СодержитТип(ТипЗнч(Ссылка)) Тогда
				
			Иначе
				Если НЕ ОбъектНайден И Ссылка.ПометкаУдаления Тогда // Объект создан по ссылке
					
					Объект = Ссылка.ПолучитьОбъект();
					УстановитьОбменДаннымиЗагрузка(Объект);
					Объект.УстановитьПометкуУдаления(Ложь);
					
				ИначеЕсли ОбъектНайден И НеЗамещатьОбъект И (Не ЕстьОбработчикПриЗагрузке) Тогда
					
					одПропустить(ФайлОбмена, "Объект");
					Прервать;
					
				Иначе
					
					Объект = Ссылка.ПолучитьОбъект();
					
					Если Документы.ТипВсеСсылки().СодержитТип(ТипОбъекта) И СвойстваПоиска.Получить("Дата")<>Неопределено И Объект.Дата<>СвойстваПоиска["Дата"] Тогда
						Объект.Дата=СвойстваПоиска["Дата"];					
					КонецЕсли; 					
				КонецЕсли; 		
			КонецЕсли;			
			

			
		    // Обработчик события ПриЗагрузкеОбъекта
			
			Если ЕстьОбработчикПриЗагрузке Тогда
				
				Если ФлагРежимОтладки Тогда
					
					Попытка
						
						Выполнить(Правило.ПриЗагрузке);
						
					Исключение
						
						СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
						ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
						ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
						ЗП.ИмяПКО                 = ИмяПравила;
						Если Не ПустаяСтрока(Источник) Тогда
							ЗП.Источник           = Источник;
						КонецЕсли; 
						ЗП.ТипОбъекта             = ТипОбъекта;
						ЗП.Объект                 = Строка(Объект);
						ЗП.Обработчик             = "ПриЗагрузкеОбъекта";
						ЗП.ОписаниеОшибки         = ОписаниеОшибки;
						ЗП.ПозицияМодуля          = СтрокаМодуля;
						ЗП.КодСообщения           = 20;
						ЗаписатьВПротоколВыполнения(20, ЗП);
						
					КонецПопытки;
					
				Иначе
					
					Выполнить(Правило.ПриЗагрузке);
					
				КонецЕсли;
				
				Если ОбъектНайден И НеЗамещатьОбъект Тогда
					
					одПропустить(ФайлОбмена, "Объект");
					Прервать;
					
				КонецЕсли;
				
			КонецЕсли;
			
			
		ИначеЕсли ИмяУзла = "ТабличнаяЧасть" Тогда

			Если Объект = Неопределено Тогда
				
				ОбъектНайден = Ложь;

			    // Обработчик события ПриЗагрузкеОбъекта
				
				Если ЕстьОбработчикПриЗагрузке Тогда
					
					Если ФлагРежимОтладки Тогда
						
						Попытка
							
							Выполнить(Правило.ПриЗагрузке);
							
						Исключение
							
							СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
							ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
							ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
							ЗП.ИмяПКО                 = ИмяПравила;
							
							Если Не ПустаяСтрока(Источник) Тогда
								
								ЗП.Источник           = Источник;
								
							КонецЕсли; 
							
							ЗП.ТипОбъекта             = ТипОбъекта;
							ЗП.Объект                 = Строка(Объект);
							ЗП.Обработчик             = "ПриЗагрузкеОбъекта";
							ЗП.ОписаниеОшибки         = ОписаниеОшибки;
							ЗП.ПозицияМодуля          = СтрокаМодуля;
							ЗП.КодСообщения           = 20;
							ЗаписатьВПротоколВыполнения(20, ЗП);
							
						КонецПопытки;
						
					Иначе
						
						Выполнить(Правило.ПриЗагрузке);
						
					КонецЕсли;
					
				КонецЕсли;

				Если Объект = Неопределено Тогда
					
					Ссылка = СоздатьНовыйОбъект(ТипОбъекта, СвойстваПоиска);
					Объект = Ссылка.ПолучитьОбъект();
					
				КонецЕсли;
				
			КонецЕсли;
			

			Имя                = одАтрибут(ФайлОбмена, одТипСтрока, "Имя");
			НеЗамещатьСвойство = одАтрибут(ФайлОбмена, одТипБулево, "НеЗамещать");
			НеОчищать          = одАтрибут(ФайлОбмена, одТипБулево, "НеОчищать");

			Если ОбъектНайден И НеЗамещатьСвойство Тогда
				
				одПропустить(ФайлОбмена, "ТабличнаяЧасть");
				Продолжить;
				
			КонецЕсли; 

			ЗагрузитьТабличнуюЧасть(Объект, Имя, Не НеОчищать);
			
		ИначеЕсли ИмяУзла = "НаборЗаписей" Тогда
			
			Если Объект = Неопределено Тогда
				
				ОбъектНайден = Ложь;

			    // Обработчик события ПриЗагрузкеОбъекта
				
				Если ЕстьОбработчикПриЗагрузке Тогда
					
					Если ФлагРежимОтладки Тогда
						
						Попытка
							
							Выполнить(Правило.ПриЗагрузке);
							
						Исключение
							
							СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
							ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
							ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
							ЗП.ИмяПКО                 = ИмяПравила;
							
							Если Не ПустаяСтрока(Источник) Тогда
								
								ЗП.Источник           = Источник;
								
							КонецЕсли; 
							
							ЗП.ТипОбъекта             = ТипОбъекта;
							ЗП.Объект                 = Строка(Объект);
							ЗП.Обработчик             = "ПриЗагрузкеОбъекта";
							ЗП.ОписаниеОшибки         = ОписаниеОшибки;
							ЗП.ПозицияМодуля          = СтрокаМодуля;
							ЗП.КодСообщения           = 20;
							ЗаписатьВПротоколВыполнения(20, ЗП);
							
						КонецПопытки;
						
					Иначе
						
						Выполнить(Правило.ПриЗагрузке);
						
					КонецЕсли;
					
				КонецЕсли;

				Если Объект = Неопределено Тогда
					
					Ссылка = СоздатьНовыйОбъект(ТипОбъекта, СвойстваПоиска);
					Объект = Ссылка.ПолучитьОбъект();
					
				КонецЕсли;
				
			КонецЕсли;
			

			Имя                = одАтрибут(ФайлОбмена, одТипСтрока, "Имя");
			НеЗамещатьСвойство = одАтрибут(ФайлОбмена, одТипБулево, "НеЗамещать");
			НеОчищать          = одАтрибут(ФайлОбмена, одТипБулево, "НеОчищать");

			Если ОбъектНайден И НеЗамещатьСвойство Тогда
				
				одПропустить(ФайлОбмена, "НаборЗаписей");
				Продолжить;
				
			КонецЕсли; 

			ЗагрузитьДвижения(Объект, Имя, Не НеОчищать);
			
		ИначеЕсли (ИмяУзла = "Объект") И (ТипУзла = одТипУзлаXML_КонецЭлемента) Тогда
			
		    // Глобальный обработчик события ПослеЗагрузкиОбъекта
			
			Если ЕстьГлобальныйОбработчикПослеЗагрузкиОбъекта Тогда
				
				Если ФлагРежимОтладки Тогда
					
					Попытка
						
						Выполнить(Конвертация.ПослеЗагрузкиОбъекта);
						
					Исключение
						
						СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
						ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
						ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
						ЗП.ИмяПКО                 = ИмяПравила;
						
						Если Не ПустаяСтрока(Источник) Тогда
							
							ЗП.Источник           = Источник;
							
						КонецЕсли;
						
						ЗП.ТипОбъекта             = ТипОбъекта;
						ЗП.Объект                 = Строка(Объект);
						ЗП.Обработчик             = "ПослеЗагрузкиОбъекта (глобальный)";
						ЗП.ОписаниеОшибки         = ОписаниеОшибки;
						ЗП.ПозицияМодуля          = СтрокаМодуля;
						ЗП.КодСообщения           = 54;
						ЗаписатьВПротоколВыполнения(54, ЗП);
						
					КонецПопытки;
					
				Иначе
					
					Выполнить(Конвертация.ПослеЗагрузкиОбъекта);
					
				КонецЕсли;
				
			КонецЕсли;

			
		    // Обработчик события ПослеЗагрузкиОбъекта
			
			Если ЕстьОбработчикПослеЗагрузки Тогда
				
				Если ФлагРежимОтладки Тогда
					
					Попытка
						
						Если ТипОбъекта(Объект)="Документ" И НЕ ПустаяСтрока(Правило.ПослеЗагрузки) И фНеОбрабатыватьПравилаПослеЗагрузкиДокументов Тогда
							Сообщить("Пропускаем правило: "+ТипОбъекта(Объект)+" "+Объект.Метаданные().Имя+" "+Правило.ПослеЗагрузки);						
						Иначе
							Выполнить(Правило.ПослеЗагрузки);							
						КонецЕсли;					
						
					Исключение
						
						СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
						ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
						ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
						ЗП.ИмяПКО                 = ИмяПравила;
						
						Если Не ПустаяСтрока(Источник) Тогда
							
							ЗП.Источник           = Источник;
							
						КонецЕсли;
						
						ЗП.ТипОбъекта             = ТипОбъекта;
						ЗП.Объект                 = Строка(Объект);
						ЗП.Обработчик             = "ПослеЗагрузкиОбъекта";
						ЗП.ОписаниеОшибки         = ОписаниеОшибки;
						ЗП.ПозицияМодуля          = СтрокаМодуля;
						ЗП.КодСообщения           = 21;
						ЗаписатьВПротоколВыполнения(21, ЗП);
						
					КонецПопытки;
					
				Иначе
					
					Выполнить(Правило.ПослеЗагрузки);
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ИмяТипаОбъекта = "Документ" Тогда
				
				Если РежимЗаписи = "Проведение" Тогда
					
					РежимЗаписи = РежимЗаписиДокумента.Проведение;
					
				ИначеЕсли РежимЗаписи = "ОтменаПроведения" Тогда
					
					РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
					
				Иначе
					
					РежимЗаписи = РежимЗаписиДокумента.Запись;
					
				КонецЕсли;
				
				Если РежимПроведения = "Оперативный" Тогда
					
					РежимПроведения = РежимПроведенияДокумента.Оперативный;
					
				Иначе
					
					РежимПроведения = РежимПроведенияДокумента.Неоперативный;
					
				КонецЕсли;

				ОбъектЗагружен=Ложь;
				
				Если Объект.ПометкаУдаления Тогда
					
					Если Объект.Проведен Тогда
						
						Объект.Проведен = Ложь;
						
						Если ФлагРежимОтладки Тогда
							
							Попытка
								
								УстановитьОбменДаннымиЗагрузка(Объект);
								Объект.Записать();
								
								ОбъектЗагружен=Истина;
							Исключение
								
								СтрокаМодуля    = ОтделитьРазделителем(ОписаниеОшибки(), "{");
								ОписаниеОшибки  = ОтделитьРазделителем(СтрокаМодуля, "}: ");
								ЗП = ПолучитьСтруктуруЗаписиПротокола();
								ЗП.Объект         = Объект;
								ЗП.ТипОбъекта     = ТипОбъекта;
								ЗП.ОписаниеОшибки = ОписаниеОшибки;
								ЗП.КодСообщения   = 26;
								ЗаписатьВПротоколВыполнения(26, ЗП, Истина);
								
								ЕстьОшибкиЗагрузки=Истина;
							КонецПопытки;
							
						Иначе
							
							УстановитьОбменДаннымиЗагрузка(Объект);
							Объект.Записать();
							
							ОбъектЗагружен=Истина;
						КонецЕсли;
						
						УстановитьОбменДаннымиЗагрузка(Объект);
						Объект.УстановитьПометкуУдаления(Ложь);
						Объект.Проведен = Истина;
						
					Иначе
						
						Если ФлагРежимОтладки Тогда
							
							Попытка
								
								УстановитьОбменДаннымиЗагрузка(Объект);
								Объект.Записать();
								
								ОбъектЗагружен=Истина;
							Исключение
								
								СтрокаМодуля    = ОтделитьРазделителем(ОписаниеОшибки(), "{");
								ОписаниеОшибки  = ОтделитьРазделителем(СтрокаМодуля, "}: ");
								ЗП = ПолучитьСтруктуруЗаписиПротокола();
								ЗП.Объект         = Объект;
								ЗП.ТипОбъекта     = ТипОбъекта;
								ЗП.ОписаниеОшибки = ОписаниеОшибки;
								ЗП.КодСообщения   = 26;
								ЗаписатьВПротоколВыполнения(26, ЗП, Истина);
								
								ЕстьОшибкиЗагрузки=Истина;
							КонецПопытки; 
							
						Иначе
							
							УстановитьОбменДаннымиЗагрузка(Объект);
							Объект.Записать();
							
							ОбъектЗагружен=Истина;
						КонецЕсли;
						
						УстановитьОбменДаннымиЗагрузка(Объект);
						Объект.УстановитьПометкуУдаления(Ложь);
						
					КонецЕсли;
					
				КонецЕсли;
				
				
				Если ФлагРежимОтладки Тогда
					
					Попытка
						
						УстановитьОбменДаннымиЗагрузка(Объект, РежимЗаписи = РежимЗаписиДокумента.Запись);
						Объект.Записать(РежимЗаписи, РежимПроведения);
						
						ОбъектЗагружен=Истина;
					Исключение
						
						СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
						ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
						ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
						ЗП.ИмяПКО                 = ИмяПравила;
						
						Если Не ПустаяСтрока(Источник) Тогда
							
							ЗП.Источник           = Источник;
							
						КонецЕсли;
						
						ЗП.ТипОбъекта             = ТипОбъекта;
						ЗП.Объект                 = Строка(Объект);
						ЗП.ОписаниеОшибки         = ОписаниеОшибки;
						ЗП.ПозицияМодуля          = СтрокаМодуля;
						ЗП.КодСообщения           = 25;
						ЗаписатьВПротоколВыполнения(25, ЗП);
						
						ЕстьОшибкиЗагрузки=Истина;
					КонецПопытки;
					
				Иначе
					
					УстановитьОбменДаннымиЗагрузка(Объект, РежимЗаписи = РежимЗаписиДокумента.Запись);
					Объект.Записать(РежимЗаписи, РежимПроведения);
					
					ОбъектЗагружен=Истина;
				КонецЕсли;
				
				Если ОбъектЗагружен Тогда
					СтрокаТД=ТаблицаЗагруженныхОбъектов.Добавить();
					
					Вид=Объект.Метаданные().Имя;
					Если Вид="РасходнаяНакладная" Тогда
						Если Объект.ВидОплаты=Перечисления.ВидыОплаты.НАЛ Тогда
							СтрокаТД.Вид="РасходнаяНал";
						Иначе
							СтрокаТД.Вид="РасходнаяБН";						
						КонецЕсли;
					Иначе
						СтрокаТД.Вид=Вид;
					КонецЕсли;	
					
					СтрокаТД.Номер	=Объект.Номер;
					СтрокаТД.Дата	=Формат(Объект.Дата,"ДФ=dd.MM.yyyy");
					СтрокаТД.Время	=Формат(Объект.Дата,"ДФ=ЧЧ.мм.сс");
					
					СтрокаТД.Тип			="Документ";
					//СтрокаТД.НомерСообщения = Параметры.НомерСообщения;
					
					//Если Объект.Метаданные().Реквизиты.Найти("ИД_77")<>Неопределено Тогда
					//	СтрокаТД.ИД_77=Объект.ИД_77;											
					//КонецЕсли; 
				КонецЕсли;
				
			ИначеЕсли ИмяТипаОбъекта = "РегистрСведений" Тогда
				
				ОбъектМД = СтруктураСвойств.ОбъектМД;
				Периодический = (ОбъектМД.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический);
				
				Если Периодический Тогда
					
					Если одПустое(Объект.Период) Тогда
						
						Объект.Период = РабочаяДата;
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если ФлагРежимОтладки Тогда
					
					Попытка
						
						УстановитьОбменДаннымиЗагрузка(Объект);
						Объект.Записать();
						
					Исключение
						
						СтрокаМодуля    = ОтделитьРазделителем(ОписаниеОшибки(), "{");
						ОписаниеОшибки  = ОтделитьРазделителем(СтрокаМодуля, "}: ");
						ЗП = ПолучитьСтруктуруЗаписиПротокола();
						ЗП.Объект         = Объект;
						ЗП.ТипОбъекта     = ТипОбъекта;
						ЗП.ОписаниеОшибки = ОписаниеОшибки;
						ЗП.КодСообщения   = 26;
						ЗаписатьВПротоколВыполнения(26, ЗП, Истина);
						
						ЕстьОшибкиЗагрузки=Истина;
					КонецПопытки;
					
				Иначе
					
					УстановитьОбменДаннымиЗагрузка(Объект);
					Объект.Записать();
					
				КонецЕсли;
				
			ИначеЕсли ИмяТипаОбъекта="Перечисление" Тогда
			Иначе				
				
				Если ФлагРежимОтладки Тогда
					
					Попытка
						
						УстановитьОбменДаннымиЗагрузка(Объект);
						
						
						ТипОбъекта=ТипОбъекта(Объект);
						
						Если ТипОбъекта="Справочник" И НЕ ЕстьИзмененияСвойств Тогда
						Иначе
							Сообщить("Запись объекта: "+ТипОбъекта+"."+Объект.Метаданные().Имя++" "+Объект+" , есть изм. свойств: "+ЕстьИзмененияСвойств+"("+ИзмененнныеСвойства+")");
							
							Объект.Записать();					
						КонецЕсли;				
						
					Исключение
						
						СтрокаМодуля    = ОтделитьРазделителем(ОписаниеОшибки(), "{");
						ОписаниеОшибки  = ОтделитьРазделителем(СтрокаМодуля, "}: ");
						ЗП = ПолучитьСтруктуруЗаписиПротокола();
						ЗП.Объект         = Объект;
						ЗП.ТипОбъекта     = ТипОбъекта;
						ЗП.ОписаниеОшибки = ОписаниеОшибки;
						ЗП.КодСообщения   = 26;
						ЗаписатьВПротоколВыполнения(26, ЗП, Истина);
						
						//Функция ЗаписатьВЛог(ИмяЛога,Сообщение,ТипСообщения,ВыводитьСообщения=Ложь) Экспорт
						ЕстьОшибкиЗагрузки=Истина;

						Если Объект<>Неопределено Тогда
							ЗаписатьВЛог("Загрузка77","Ошибка записи элемента справочника ! "+Объект.Метаданные().Имя+" "+Объект+" "+ОписаниеОшибки,"Ошибка");
						Иначе							
							ЗаписатьВЛог("Загрузка77","Попытка записи пустого объекта ! Тип: """+ИмяТипаОбъекта+""","""+Ссылка+""" "+ОписаниеОшибки,"Ошибка");						
						КонецЕсли;						
					КонецПопытки;
					
				Иначе
					
					УстановитьОбменДаннымиЗагрузка(Объект);
					
					ТипОбъекта=ТипОбъекта(Объект);
										
					Если ТипОбъекта="Справочник" И НЕ ЕстьИзмененияСвойств Тогда
					Иначе
						Сообщить("Запись объекта: "+ТипОбъекта+" "+Объект+" , есть изм. свойств: "+ЕстьИзмененияСвойств+" ("+ИзмененнныеСвойства+")");
						
						Объект.Записать();					
					КонецЕсли;				
					
				КонецЕсли;
				
				Если ТипОбъекта="Справочник" Тогда
					СтрокаТО=ТаблицаЗагруженныхОбъектов.Добавить();
					
					СтрокаТО.Тип = "Справочник";					
					СтрокаТО.Вид=Объект.Метаданные().Имя;				
					
					СтрокаТО.Код			= Объект.Код;
					СтрокаТО.Наименование	= Объект.Наименование;					
					//СтрокаТО.НомерСообщения = Параметры.НомерСообщения;
					
					Если Объект.Метаданные().Реквизиты.Найти("ИД_77")<>Неопределено Тогда
						СтрокаТО.ИД_77=Объект.ИД_77;											
					КонецЕсли;
				КонецЕсли;
			КонецЕсли; 

			
			Если (ИмяТипаОбъекта <> "РегистрСведений") И (ИмяТипаОбъекта <> "Константы") И (ИмяТипаОбъекта<>"Перечисление")Тогда
				
				Если ПометкаУдаления <> Неопределено Тогда
					
					УстановитьОбменДаннымиЗагрузка(Объект);
					Попытка
						Объект.УстановитьПометкуУдаления(ПометкаУдаления);
					Исключение
						Сообщить("Ошибка записи объекта ! Тип: "+ТипОбъекта(Объект)+", вид: "+Объект.Метаданные().Имя,СтатусСообщения.ОченьВажное);
//						ттт=3/0;
					КонецПопытки;					
					
				ИначеЕсли Объект.ПометкаУдаления Тогда
					
					УстановитьОбменДаннымиЗагрузка(Объект);
					Объект.УстановитьПометкуУдаления(Ложь);
					
				КонецЕсли;
				
			КонецЕсли;

			Прервать;
			
		ИначеЕсли ИмяУзла = "НаборЗаписейПоследовательности" Тогда
			
			одПропустить(ФайлОбмена);
			
		ИначеЕсли ИмяУзла = "Типы" Тогда

			Если Объект = Неопределено Тогда
				
				ОбъектНайден = Ложь;
				Ссылка       = СоздатьНовыйОбъект(ТипОбъекта, СвойстваПоиска);
				Объект       = Ссылка.ПолучитьОбъект();
				
			КонецЕсли; 

			ОписаниеТиповОбъекта = ЗагрузитьТипыОбъекта(ФайлОбмена);

			Если ОписаниеТиповОбъекта <> Неопределено Тогда
				
				Объект.ТипЗначения = ОписаниеТиповОбъекта;
				
			КонецЕсли; 
			
		Иначе
			
			ЗаписатьВПротоколВыполнения(9);
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры // ПрочитатьОбъект() 


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ВЫГРУЗКИ ДАННЫХ ПО ПРАВИЛАМ ОБМЕНА

// Формирует узлы свойств объекта приемника в соответствии с указанной коллекцией правил конвертации свойств
//
// Параметры:
//  Источник		     - произвольный источник данных
//  Приемник		     - xml-узел объекта приемника
//  ВходящиеДанные	     - произвольные вспомогательные данные, передаваемые правилу
//                         для выполнения конвертации
//  ИсходящиеДанные      - произвольные вспомогательные данные, передаваемые правилам
//                         конвертации объектов свойств
//  ПКО				     - ссылка на правило конвертации объектов (родитель коллекции правил конвертации свойств)
//  ПКГС                 - ссылка на правило конвертации группы свойств
//  УзелКоллекцииСвойств - xml-узел коллекции свойств
// 
Процедура ВыгрузитьГруппуСвойств(Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО, ПКГС, УзелКоллекцииСвойств)

	
	КоллекцияОбъектов = Неопределено;
	НеЗамещать        = ПКГС.НеЗамещать;
	НеОчищать         = Ложь;

	
	// Обработчик ПередОбработкойВыгрузки

	Если ПКГС.ЕстьОбработчикПередОбработкойВыгрузки Тогда
		
		Отказ = Ложь;
		Если ФлагРежимОтладки Тогда
			
			Попытка
				
				Выполнить(ПКГС.ПередОбработкойВыгрузки);
				
			Исключение
				
				СтрокаМодуля    = ОтделитьРазделителем(ОписаниеОшибки(), "{");
				ОписаниеОшибки  = ОтделитьРазделителем(СтрокаМодуля, "}: ");
				ЗП = ПолучитьСтруктуруЗаписиПротокола();
				ЗП.ПКО                    = ПКО.Имя + "  (" + ПКО.Наименование + ")";
				ЗП.ПКГС                   = ПКГС.Имя + "  (" + ПКГС.Наименование + ")";
				ЗП.Объект                 = Строка(Источник) + "  (" + ТипЗнч(Источник) + ")";
				ЗП.ОписаниеОшибки         = ОписаниеОшибки;
				ЗП.ПозицияМодуля          = СтрокаМодуля;
				ЗП.Обработчик             = "ПередОбработкойВыгрузкиГруппыСвойств";
				ЗП.КодСообщения           = 48;
				ЗаписатьВПротоколВыполнения(48, ЗП);
				
			КонецПопытки;
			
		Иначе
			
			Выполнить(ПКГС.ПередОбработкойВыгрузки);
			
		КонецЕсли;
		
		Если Отказ Тогда // Отказ от обработки группы свойств
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;

	
    ВидПриемника = ПКГС.ВидПриемника;
	ВидИсточника = ПКГС.ВидИсточника;
	
	
    // Создание узла коллекции подчиненных объектов
	
	Если ВидПриемника = "ТабличнаяЧасть" Тогда
		
		УзелКоллекцииОбъектов = СоздатьУзел("ТабличнаяЧасть");
		УстановитьАтрибут(УзелКоллекцииОбъектов, "Имя",	ПКГС.Приемник);
		
		Если НеЗамещать Тогда
			
			УстановитьАтрибут(УзелКоллекцииОбъектов, "НеЗамещать", "true");
			
		КонецЕсли;
		
		Если НеОчищать Тогда
			
			УстановитьАтрибут(УзелКоллекцииОбъектов, "НеОчищать", "true");
			
		КонецЕсли;
		
	ИначеЕсли ВидПриемника = "ПодчиненныйСправочник" Тогда
		
		УзелКоллекцииОбъектов = Неопределено;
		
	ИначеЕсли ВидПриемника = "НаборЗаписейПоследовательности" Тогда
		
		УзелКоллекцииОбъектов = СоздатьУзел("НаборЗаписей");
		УстановитьАтрибут(УзелКоллекцииОбъектов, "Имя",	ПКГС.Приемник);
		
	ИначеЕсли Найти(ВидПриемника, "НаборДвижений") > 0 Тогда
		
		УзелКоллекцииОбъектов = СоздатьУзел("НаборЗаписей");
		УстановитьАтрибут(УзелКоллекцииОбъектов, "Имя",	ПКГС.Приемник);
		
		Если НеЗамещать Тогда
			
			УстановитьАтрибут(УзелКоллекцииОбъектов, "НеЗамещать",	"true");
			
		КонецЕсли;
		
		Если НеОчищать Тогда
			
			УстановитьАтрибут(УзелКоллекцииОбъектов, "НеОчищать",	"true");
			
		КонецЕсли;
		
	Иначе  // это простая группировка
		
		ВыгрузитьСвойства(Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО, ПКГС.ПравилаГруппы, УзелКоллекцииСвойств);
		
		Если ПКГС.ЕстьОбработчикПослеОбработкиВыгрузки Тогда
			
			Попытка
				
				Выполнить(ПКГС.ПослеОбработкиВыгрузки);
				
			Исключение
				
				ЗаписатьВПротоколВыполнения(49);
				
			КонецПопытки;
			
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;

	
	// Получение коллекции подчиненных объектов
	
	Если КоллекцияОбъектов <> Неопределено Тогда
		
		// Инициализировали коллекцию в обработчике ПередОбработкой
		
	ИначеЕсли ПКГС.ПолучитьИзВходящихДанных Тогда
		
		Попытка
			
			КоллекцияОбъектов = ВходящиеДанные[ПКГС.Приемник];
			
		Исключение
			
            ЗаписатьВПротоколВыполнения(66);
			Возврат;
			
		КонецПопытки;
		
	ИначеЕсли ВидИсточника = "ТабличнаяЧасть" Тогда
		
		КоллекцияОбъектов = Источник[ПКГС.Источник];
		
	ИначеЕсли ВидИсточника = "ПодчиненныйСправочник" Тогда
		
	ИначеЕсли Найти(ВидИсточника, "НаборДвижений") > 0 Тогда
		
		НаборДвиженийДокумента = Источник.ПолучитьОбъект().Движения[ПКГС.Источник];
		НаборДвиженийДокумента.Прочитать();
		КоллекцияОбъектов = НаборДвиженийДокумента;
		
	ИначеЕсли ПустаяСтрока(ПКГС.Источник) Тогда
		
		КоллекцияОбъектов = Источник[ПКГС.Приемник];
		
	КонецЕсли;

	
	Для каждого ОбъектКоллекции Из КоллекцияОбъектов Цикл

		
		// Обработчик ПередВыгрузкой
		Если ПКГС.ЕстьОбработчикПередВыгрузкой Тогда
			
			Отказ = Ложь;
			
			Попытка
				
				Выполнить(ПКГС.ПередВыгрузкой);
				
			Исключение
				
				ЗаписатьВПротоколВыполнения(50);
				Прервать;
				
			КонецПопытки;
			
			Если Отказ Тогда	//	Отказ от выгрузки подчиненного объекта
				
				Продолжить;
				
			КонецЕсли;
			
		КонецЕсли; 

		
		// Обработчик ПриВыгрузке
		
		УзелОбъектаКоллекции = СоздатьУзел("Запись");
		СтандартнаяОбработка	= Истина;
		
		Если ПКГС.ЕстьОбработчикПриВыгрузке Тогда
			
			Попытка
				
				Выполнить(ПКГС.ПриВыгрузке);
				
			Исключение
				
				ЗаписатьВПротоколВыполнения(51);
				Прервать;
				
			КонецПопытки;
			
		КонецЕсли;


		//	Выгрузка свойств объекта коллекции
		
		Если СтандартнаяОбработка Тогда
			
			Если ПКГС.ПравилаГруппы.Количество() > 0 Тогда
				
				ВыгрузитьСвойства(Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО, ПКГС.ПравилаГруппы, УзелОбъектаКоллекции, ОбъектКоллекции);
				
			Иначе
				
				//	ПО ПРАВИЛУ
				
			КонецЕсли;
			
		КонецЕсли;

		
		// Обработчик ПослеВыгрузки
		
		Если ПКГС.ЕстьОбработчикПослеВыгрузки Тогда
			
			Отказ = Ложь;
			
			Попытка
				
				Выполнить(ПКГС.ПослеВыгрузки);
			Исключение
				
				ЗаписатьВПротоколВыполнения(52);
				Прервать;
			КонецПопытки; 
			
			Если Отказ Тогда	//	Отказ от выгрузки подчиненного объекта
				
				Продолжить;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ДобавитьПодчиненный(УзелКоллекцииОбъектов, УзелОбъектаКоллекции);
		
	КонецЦикла;

	
    // Обработчик ПослеОбработкиВыгрузки

	Если ПКГС.ЕстьОбработчикПослеОбработкиВыгрузки Тогда
		
		Отказ = Ложь;
		
		Попытка
			
			Выполнить(ПКГС.ПослеОбработкиВыгрузки);
			
		Исключение
			
			ЗаписатьВПротоколВыполнения(49);
			
		КонецПопытки; 
		
		Если Отказ Тогда	//	Отказ от записи коллекции подчиненных объектов
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;

	
	ДобавитьПодчиненный(УзелКоллекцииСвойств, УзелКоллекцииОбъектов);

КонецПроцедуры // ВыгрузитьГруппуСвойств()

Процедура _ВыгрузитьСубконто(Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО, ПКС, УзелКоллекцииСвойств = Неопределено, ОбъектКоллекции = Неопределено)
	
	// Инициализация значения
	Значение = Неопределено;
	ИмяПКО = "";
	ИмяПКОВидСубконто = "";
	
	// Обработчик ПередВыгрузкой
	Если ПКС.ЕстьОбработчикПередВыгрузкой Тогда
		
		Отказ = Ложь;
		
		Если ФлагРежимОтладки Тогда
			
			Попытка
				
				Выполнить(ПКС.ПередВыгрузкой);
				
			Исключение
				
				СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
				ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
				ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
				ЗП.ПКО                    = ПКО.Имя + "  (" + ПКО.Наименование + ")";
				ЗП.ПКС                    = ПКС.Имя + "  (" + ПКС.Наименование + ")";
				ЗП.Объект                 = Строка(Источник) + "  (" + ТипЗнч(Источник) + ")";
				ЗП.СвойствоПриемника      = ПКС.Приемник + "  (" + ПКС.ТипПриемника + ")";
				ЗП.КонвертируемоеЗначение = Строка(Значение) + "  (" + ТипЗнч(Значение) + ")";
				ЗП.Обработчик             = "ПередВыгрузкойСвойства";
				ЗП.ОписаниеОшибки         = ОписаниеОшибки;
				ЗП.ПозицияМодуля          = СтрокаМодуля;
				ЗП.КодСообщения           = 55;
				ЗаписатьВПротоколВыполнения(55, ЗП);
				
			КонецПопытки;
			
		Иначе
			
			Выполнить(ПКС.ПередВыгрузкой);
			
		КонецЕсли;
		
		Если Отказ Тогда // Отказ от выгрузки
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Значение = Неопределено Тогда
		
		Если ОбъектКоллекции <> Неопределено Тогда
			
			Если ПКС.ПолучитьИзВходящихДанных Тогда
				
				Если ФлагРежимОтладки Тогда
					
					Попытка
						
						Значение = ВходящиеДанные[ПКС.Приемник];
						
					Исключение
						
						СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
						ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
						ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
						ЗП.ПКО                    = ПКО.Имя + "  (" + ПКО.Наименование + ")";
						ЗП.ПКС                    = ПКС.Имя + "  (" + ПКС.Наименование + ")";
						ЗП.Объект                 = Строка(Источник) + "  (" + ТипЗнч(Источник) + ")";
						ЗП.СвойствоПриемника      = ПКС.Приемник + "  (" + ПКС.ТипПриемника + ")";
						ЗП.ОписаниеОшибки         = ОписаниеОшибки;
						ЗП.ПозицияМодуля          = СтрокаМодуля;
						ЗП.КодСообщения           = 67;
						ЗаписатьВПротоколВыполнения(67, ЗП);
						
					КонецПопытки;
					
				Иначе
					
					Значение = ВходящиеДанные[ПКС.Приемник];
					
				КонецЕсли;
				
			ИначеЕсли Не ПустаяСтрока(ПКС.Источник) Тогда
				
				Если ФлагРежимОтладки Тогда
					
					Попытка
						
						Значение = ОбъектКоллекции[ПКС.Источник];
						
					Исключение
						
						СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
						ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
						ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
						ЗП.ПКО                    = ПКО.Имя + "  (" + ПКО.Наименование + ")";
						ЗП.ПКС                    = ПКС.Имя + "  (" + ПКС.Наименование + ")";
						ЗП.Объект                 = Строка(Источник) + "  (" + ТипЗнч(Источник) + ")";
						ЗП.СвойствоПриемника      = ПКС.Приемник + "  (" + ПКС.ТипПриемника + ")";
						ЗП.ОписаниеОшибки         = ОписаниеОшибки;
						ЗП.ПозицияМодуля          = СтрокаМодуля;
						ЗП.КодСообщения           = 16;
						ЗаписатьВПротоколВыполнения(16, ЗП);
						
					КонецПопытки;
					
				Иначе
					
					Значение = ОбъектКоллекции[ПКС.Источник];
					
				КонецЕсли;
				
			Иначе

				Если ФлагРежимОтладки Тогда
					
					Попытка
						
						Значение = ОбъектКоллекции[ПКС.Приемник];
						
					Исключение
						
						СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
						ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
						ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
						ЗП.ПКО                    = ПКО.Имя + "  (" + ПКО.Наименование + ")";
						ЗП.ПКС                    = ПКС.Имя + "  (" + ПКС.Наименование + ")";
						ЗП.Объект                 = Строка(Источник) + "  (" + ТипЗнч(Источник) + ")";
						ЗП.СвойствоПриемника      = ПКС.Приемник + "  (" + ПКС.ТипПриемника + ")";
						ЗП.ОписаниеОшибки         = ОписаниеОшибки;
						ЗП.ПозицияМодуля          = СтрокаМодуля;
						ЗП.КодСообщения           = 17;
						ЗаписатьВПротоколВыполнения(17, ЗП);
						
					КонецПопытки;
					
				Иначе
					
					Значение = ОбъектКоллекции[ПКС.Приемник];
					
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ПКС.ПолучитьИзВходящихДанных Тогда
			
			Если ФлагРежимОтладки Тогда
				
				Попытка
					
					Значение = ВходящиеДанные[ПКС.Приемник];
					
				Исключение
					
					СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
					ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
					ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
					ЗП.ПКО                    = ПКО.Имя + "  (" + ПКО.Наименование + ")";
					ЗП.ПКС                    = ПКС.Имя + "  (" + ПКС.Наименование + ")";
					ЗП.Объект                 = Строка(Источник) + "  (" + ТипЗнч(Источник) + ")";
					ЗП.СвойствоПриемника      = ПКС.Приемник + "  (" + ПКС.ТипПриемника + ")";
					ЗП.ОписаниеОшибки         = ОписаниеОшибки;
					ЗП.ПозицияМодуля          = СтрокаМодуля;
					ЗП.КодСообщения           = 68;
					ЗаписатьВПротоколВыполнения(68, ЗП);
					
				КонецПопытки;
				
			Иначе
				
				Значение = ВходящиеДанные[ПКС.Приемник];
				
			КонецЕсли;
			
		ИначеЕсли Не ПустаяСтрока(ПКС.Источник) Тогда
			
			Если ФлагРежимОтладки Тогда
				
				Попытка
					
					Значение = Источник[ПКС.Источник];
					
				Исключение
					
					СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
					ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
					ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
					ЗП.ПКО                    = ПКО.Имя + "  (" + ПКО.Наименование + ")";
					ЗП.ПКС                    = ПКС.Имя + "  (" + ПКС.Наименование + ")";
					ЗП.Объект                 = Строка(Источник) + "  (" + ТипЗнч(Источник) + ")";
					ЗП.СвойствоПриемника      = ПКС.Приемник + "  (" + ПКС.ТипПриемника + ")";
					ЗП.ОписаниеОшибки         = ОписаниеОшибки;
					ЗП.ПозицияМодуля          = СтрокаМодуля;
					ЗП.КодСообщения           = 13;
					ЗаписатьВПротоколВыполнения(13, ЗП);
					
				КонецПопытки;
				
			Иначе
				
				Значение = Источник[ПКС.Источник];
				
			КонецЕсли;
			
		Иначе
			
			Если ФлагРежимОтладки Тогда
				
				Попытка
					
					Значение = Источник[ПКС.Приемник];
					
				Исключение
					
					СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
					ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
					ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
					ЗП.ПКО                    = ПКО.Имя + "  (" + ПКО.Наименование + ")";
					ЗП.ПКС                    = ПКС.Имя + "  (" + ПКС.Наименование + ")";
					ЗП.Объект                 = Строка(Источник) + "  (" + ТипЗнч(Источник) + ")";
					ЗП.СвойствоПриемника      = ПКС.Приемник + "  (" + ПКС.ТипПриемника + ")";
					ЗП.ОписаниеОшибки         = ОписаниеОшибки;
					ЗП.ПозицияМодуля          = СтрокаМодуля;
					ЗП.КодСообщения           = 14;
					ЗаписатьВПротоколВыполнения(14, ЗП);
					
				КонецПопытки;
				
			Иначе
				
				Значение = Источник[ПКС.Приемник];
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для каждого КлючИЗначение из Значение Цикл
		
		ВидСубконто = КлючИЗначение.Ключ;
		Субконто = КлючИЗначение.Значение;
		
		// Обработчик ПриВыгрузке
		Если ПКС.ЕстьОбработчикПриВыгрузке Тогда
			
			Отказ = Ложь;
			
			Если ФлагРежимОтладки Тогда
				
				Попытка
					
					Выполнить(ПКС.ПриВыгрузке);
					
				Исключение
					
					СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
					ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
					ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
					ЗП.ПКО                    = ПКО.Имя + "  (" + ПКО.Наименование + ")";
					ЗП.ПКС                    = ПКС.Имя + "  (" + ПКС.Наименование + ")";
					ЗП.Объект                 = Строка(Источник) + "  (" + ТипЗнч(Источник) + ")";
					ЗП.СвойствоПриемника      = ПКС.Приемник + "  (" + ПКС.ТипПриемника + ")";
					ЗП.КонвертируемоеЗначение = Строка(Значение) + "  (" + ТипЗнч(Значение) + ")";
					ЗП.Обработчик             = "ПриВыгрузкеСвойства";
					ЗП.ОписаниеОшибки         = ОписаниеОшибки;
					ЗП.ПозицияМодуля          = СтрокаМодуля;
					ЗП.КодСообщения           = 56;
					ЗаписатьВПротоколВыполнения(56, ЗП);
					
				КонецПопытки;
				
			Иначе
				
				Выполнить(ПКС.ПриВыгрузке);
				
			КонецЕсли;
			
			Если Отказ Тогда // Отказ от выгрузки субконто
				
				Продолжить;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если КлючИЗначение.Значение <> Неопределено Тогда
			
			УзелСубконто = СоздатьУзел(ПКС.Приемник);
			
			// Ключ
			УзелСвойства = СоздатьУзел("Свойство");
			
			Если ИмяПКОВидСубконто = "" Тогда
				
				ПКОКлюч = НайтиПравило(ВидСубконто);
				
			Иначе
				
				ПКОКлюч = НайтиПравило(, ИмяПКОВидСубконто);
				
			КонецЕсли;
			
			УстановитьАтрибут(УзелСвойства, "Имя", "Ключ");
			УстановитьАтрибут(УзелСвойства, "Тип", ПКОКлюч.Приемник);
			
			УзелСсылки = ВыгрузитьПоПравилу(ВидСубконто,, ИсходящиеДанные,, ИмяПКОВидСубконто,,, ПКОКлюч);
			
			Если УзелСсылки <> Неопределено Тогда
				
				ДобавитьПодчиненный(УзелСвойства, УзелСсылки);
				
			КонецЕсли;
			
			ДобавитьПодчиненный(УзелСубконто, УзелСвойства);
			
			// Значение
			УзелСвойства = СоздатьУзел("Свойство");
			
			ПКОЗначение = НайтиПравило(Субконто);
			
			УстановитьАтрибут(УзелСвойства, "Имя", "Значение");
			УстановитьАтрибут(УзелСвойства, "Тип", ПКОЗначение.Приемник);
			
			УзелСсылки = ВыгрузитьПоПравилу(Субконто,, ИсходящиеДанные,, ИмяПКО,,, ПКОЗначение);
			
			ТипУзлаСсылки = ТипЗнч(УзелСсылки);
			
			Если УзелСсылки = Неопределено Тогда
				
				Продолжить;
				
			ИначеЕсли ТипУзлаСсылки = одТипСтрока Тогда
				
				Если Найти(УзелСсылки, "</Ссылка>") > 0 Тогда
					
					ДобавитьПодчиненный(УзелСвойства, УзелСсылки);
					
				Иначе
					
					одЗаписатьЭлемент(УзелСвойства, "Значение", УзелСсылки);
					
				КонецЕсли;
				
			ИначеЕсли ТипУзлаСсылки = одТипЧисло Тогда
				
				одЗаписатьЭлемент(УзелСвойства, "Нпп", УзелСсылки);
				
			Иначе
				
				ДобавитьПодчиненный(УзелСвойства, УзелСсылки);
				
			КонецЕсли;
			
			ДобавитьПодчиненный(УзелСубконто, УзелСвойства);
			
			// Обработчик ПослеВыгрузки
			Если ПКС.ЕстьОбработчикПослеВыгрузки Тогда
				
				Отказ = Ложь;
				
				Если ФлагРежимОтладки Тогда
					
					Попытка
						
						Выполнить(ПКС.ПослеВыгрузки);
						
					Исключение
						
						СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
						ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
						ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
						ЗП.ПКО                    = ПКО.Имя + "  (" + ПКО.Наименование + ")";
						ЗП.ПКС                    = ПКС.Имя + "  (" + ПКС.Наименование + ")";
						ЗП.Объект                 = Строка(Источник) + "  (" + ТипЗнч(Источник) + ")";
						ЗП.СвойствоПриемника      = ПКС.Приемник + "  (" + ПКС.ТипПриемника + ")";
						ЗП.КонвертируемоеЗначение = Строка(Значение) + "  (" + ТипЗнч(Значение) + ")";
						ЗП.Обработчик             = "ПослеВыгрузкиСвойства";
						ЗП.ОписаниеОшибки         = ОписаниеОшибки;
						ЗП.ПозицияМодуля          = СтрокаМодуля;
						ЗП.КодСообщения           = 57;
						ЗаписатьВПротоколВыполнения(57, ЗП);
						
					КонецПопытки;
					
				Иначе
					
					Выполнить(ПКС.ПослеВыгрузки);
					
				КонецЕсли;
				
				Если Отказ Тогда // Отказ от выгрузки
					
					Продолжить;
					
				КонецЕсли;
				
			КонецЕсли;
				
			ДобавитьПодчиненный(УзелКоллекцииСвойств, УзелСубконто);
				
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // _ВыгрузитьСубконто()

// Формирует узлы свойств объекта приемника в соответствии с указанной коллекцией правил конвертации свойств
//
// Параметры:
//  Источник		     - произвольный источник данных
//  Приемник		     - xml-узел объекта приемника
//  ВходящиеДанные	     - произвольные вспомогательные данные, передаваемые правилу
//                         для выполнения конвертации
//  ИсходящиеДанные      - произвольные вспомогательные данные, передаваемые правилам
//                         конвертации объектов свойств
//  ПКО				     - ссылка на правило конвертации объектов (родитель коллекции правил конвертации свойств)
//  КоллекцияПКС         - коллекция правил конвертации свойств
//  УзелКоллекцииСвойств - xml-узел коллекции свойств
//  ОбъектКоллекции      - если указан, то выполняется выгрузка свойсвт объекта коллекции, иначе Источника
//  ИмяПредопределенногоЭлемента - если указан, то в свойствах пишется имя предопределенного элемента
// 
Процедура ВыгрузитьСвойства(Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО, КоллекцияПКС, УзелКоллекцииСвойств = Неопределено, ОбъектКоллекции = Неопределено, ИмяПредопределенногоЭлемента = Неопределено)
							
	Если УзелКоллекцииСвойств = Неопределено Тогда
		
		УзелКоллекцииСвойств = Приемник;
		
	КонецЕсли; 							
	
	
	// Выгружаем имя предопределенного если оно указано
	Если НЕ ИмяПредопределенногоЭлемента = Неопределено Тогда
			УзелСвойства = СоздатьУзел("Свойство");
			УстановитьАтрибут(УзелСвойства, "Имя", "{ИмяПредопределенногоЭлемента}");
			УстановитьАтрибут(УзелСвойства, "Тип", "Строка");
			одЗаписатьЭлемент(УзелСвойства, "Значение", ИмяПредопределенногоЭлемента);
			ДобавитьПодчиненный(УзелКоллекцииСвойств, УзелСвойства);
	КонецЕсли;
	
	
	Для каждого ПКС Из КоллекцияПКС Цикл
		
		Если ПКС.ВидПриемника = "ВидыСубконтоСчета" Тогда
			
			_ВыгрузитьСубконто(Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО, ПКС, УзелКоллекцииСвойств, ОбъектКоллекции);
			
			Продолжить;
			
		КонецЕсли;
		
		Если ПКС.Имя = "{УникальныйИдентификатор}" И ПКС.Источник = "{УникальныйИдентификатор}" И ПКС.Приемник = "{УникальныйИдентификатор}" Тогда
			
			Попытка
				
				УникальныйИдентификатор = Источник.УникальныйИдентификатор();
				
			Исключение
				
				Попытка
					
					УникальныйИдентификатор = Источник.Ссылка.УникальныйИдентификатор();
					
				Исключение
					
					Продолжить;
					
				КонецПопытки;
				
			КонецПопытки;
			
			УзелСвойства = СоздатьУзел("Свойство");
			УстановитьАтрибут(УзелСвойства, "Имя", "{УникальныйИдентификатор}");
			УстановитьАтрибут(УзелСвойства, "Тип", "Строка");
			одЗаписатьЭлемент(УзелСвойства, "Значение", УникальныйИдентификатор);
			ДобавитьПодчиненный(УзелКоллекцииСвойств, УзелСвойства);
			
			Продолжить;
			
		КонецЕсли;
		
		Если ПКС.ЭтоГруппа Тогда
			
			ВыгрузитьГруппуСвойств(Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО, ПКС, УзелКоллекцииСвойств);
			Продолжить;
			
		КонецЕсли;

		
		//	Инициализируем значение, которое будем конвертировать
		
        Значение 	 = Неопределено;
		ИмяПКО		 = ПКС.ПравилоКонвертации;
		НеЗамещать   = ПКС.НеЗамещать;
		
		Пусто		 = Ложь;
		Выражение	 = Неопределено;
		ТипПриемника = ПКС.ТипПриемника;

		ЭтоNULL      = Ложь;

		
		// Обработчик ПередВыгрузкой

		Если ПКС.ЕстьОбработчикПередВыгрузкой Тогда
			
			Отказ = Ложь;
			
			Если ФлагРежимОтладки Тогда
				
				Попытка
					
					Выполнить(ПКС.ПередВыгрузкой);
					
				Исключение
					
					СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
					ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
					ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
					ЗП.ПКО                    = ПКО.Имя + "  (" + ПКО.Наименование + ")";
					ЗП.ПКС                    = ПКС.Имя + "  (" + ПКС.Наименование + ")";
					ЗП.Объект                 = Строка(Источник) + "  (" + ТипЗнч(Источник) + ")";
					ЗП.СвойствоПриемника      = ПКС.Приемник + "  (" + ПКС.ТипПриемника + ")";
					ЗП.КонвертируемоеЗначение = Строка(Значение) + "  (" + ТипЗнч(Значение) + ")";
					ЗП.Обработчик             = "ПередВыгрузкойСвойства";
					ЗП.ОписаниеОшибки         = ОписаниеОшибки;
					ЗП.ПозицияМодуля          = СтрокаМодуля;
					ЗП.КодСообщения           = 55;
					ЗаписатьВПротоколВыполнения(55, ЗП);
					
				КонецПопытки;
				
			Иначе
				
				Выполнить(ПКС.ПередВыгрузкой);
				
			КонецЕсли;
			
			Если Отказ Тогда	//	Отказ от выгрузки свойства
				
				Продолжить;
				
			КонецЕсли;
			
		КонецЕсли;


		
        //	Создаем узел свойства
		
		УзелСвойства = СоздатьУзел("Свойство");
		УстановитьАтрибут(УзелСвойства, "Имя", ПКС.Приемник);
		
		Если НеЗамещать Тогда
			
			УстановитьАтрибут(УзелСвойства, "НеЗамещать",	"true");
			
		КонецЕсли;


		
		//	Возможно правило конвертации уже определено
		
		ПКОСвойств = Неопределено;
		
		Если Не ПустаяСтрока(ИмяПКО) Тогда
			
			ПКОСвойств = Правила[ИмяПКО]
			
		КонецЕсли;


		
		//	Попытка определить тип свойства приемника
		
		Если Не ПустаяСтрока(ТипПриемника) Тогда
			
			УстановитьАтрибут(УзелСвойства, "Тип", ТипПриемника);
			
		ИначеЕсли ПКОСвойств <> Неопределено Тогда
			
			ТипПриемника = ПКОСвойств.Приемник;
			УстановитьАтрибут(УзелСвойства, "Тип", ТипПриемника);
			
		КонецЕсли;

		

		//	Определяем конвертируемое значение
		
		Если Выражение <> Неопределено Тогда
			
			одЗаписатьЭлемент(УзелСвойства, "Выражение", Выражение);
			ДобавитьПодчиненный(УзелКоллекцииСвойств, УзелСвойства);
			Продолжить;
			
		ИначеЕсли Пусто Тогда
			
			Если ПустаяСтрока(ТипПриемника) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			одЗаписатьЭлемент(УзелСвойства, "Пусто");
			ДобавитьПодчиненный(УзелКоллекцииСвойств, УзелСвойства);
			Продолжить;
			
		ИначеЕсли Значение = Неопределено Тогда
			
			Если ОбъектКоллекции <> Неопределено Тогда
				
				Если ПКС.ПолучитьИзВходящихДанных Тогда
					
					Если ФлагРежимОтладки Тогда
						
						Попытка
							
							Значение = ВходящиеДанные[ПКС.Приемник];
							
						Исключение
							
							СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
							ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
							ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
							ЗП.ПКО                    = ПКО.Имя + "  (" + ПКО.Наименование + ")";
							ЗП.ПКС                    = ПКС.Имя + "  (" + ПКС.Наименование + ")";
							ЗП.Объект                 = Строка(Источник) + "  (" + ТипЗнч(Источник) + ")";
							ЗП.СвойствоПриемника      = ПКС.Приемник + "  (" + ПКС.ТипПриемника + ")";
							ЗП.ОписаниеОшибки         = ОписаниеОшибки;
							ЗП.ПозицияМодуля          = СтрокаМодуля;
							ЗП.КодСообщения           = 67;
							ЗаписатьВПротоколВыполнения(67, ЗП);
							
						КонецПопытки;
						
					Иначе
						
						Значение = ВходящиеДанные[ПКС.Приемник];
						
					КонецЕсли;
					
				ИначеЕсли Не ПустаяСтрока(ПКС.Источник) Тогда
					
					Если ФлагРежимОтладки Тогда
						
						Попытка
							
							Значение = ОбъектКоллекции[ПКС.Источник];
							
						Исключение
							
							СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
							ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
							ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
							ЗП.ПКО                    = ПКО.Имя + "  (" + ПКО.Наименование + ")";
							ЗП.ПКС                    = ПКС.Имя + "  (" + ПКС.Наименование + ")";
							ЗП.Объект                 = Строка(Источник) + "  (" + ТипЗнч(Источник) + ")";
							ЗП.СвойствоПриемника      = ПКС.Приемник + "  (" + ПКС.ТипПриемника + ")";
							ЗП.ОписаниеОшибки         = ОписаниеОшибки;
							ЗП.ПозицияМодуля          = СтрокаМодуля;
							ЗП.КодСообщения           = 16;
							ЗаписатьВПротоколВыполнения(16, ЗП);
							
						КонецПопытки;
						
					Иначе
						
						Значение = ОбъектКоллекции[ПКС.Источник];
						
					КонецЕсли;
					
				Иначе

					Если ФлагРежимОтладки Тогда
						
						Попытка
							
							Значение	= ОбъектКоллекции[ПКС.Приемник];
							
						Исключение
							
							СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
							ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
							ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
							ЗП.ПКО                    = ПКО.Имя + "  (" + ПКО.Наименование + ")";
							ЗП.ПКС                    = ПКС.Имя + "  (" + ПКС.Наименование + ")";
							ЗП.Объект                 = Строка(Источник) + "  (" + ТипЗнч(Источник) + ")";
							ЗП.СвойствоПриемника      = ПКС.Приемник + "  (" + ПКС.ТипПриемника + ")";
							ЗП.ОписаниеОшибки         = ОписаниеОшибки;
							ЗП.ПозицияМодуля          = СтрокаМодуля;
							ЗП.КодСообщения           = 17;
							ЗаписатьВПротоколВыполнения(17, ЗП);
							
						КонецПопытки;
						
					Иначе
						
						Значение	= ОбъектКоллекции[ПКС.Приемник];
						
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли ПКС.ПолучитьИзВходящихДанных Тогда
				
				Если ФлагРежимОтладки Тогда
					
					Попытка
						
						Значение = ВходящиеДанные[ПКС.Приемник];
						
					Исключение
						
						СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
						ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
						ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
						ЗП.ПКО                    = ПКО.Имя + "  (" + ПКО.Наименование + ")";
						ЗП.ПКС                    = ПКС.Имя + "  (" + ПКС.Наименование + ")";
						ЗП.Объект                 = Строка(Источник) + "  (" + ТипЗнч(Источник) + ")";
						ЗП.СвойствоПриемника      = ПКС.Приемник + "  (" + ПКС.ТипПриемника + ")";
						ЗП.ОписаниеОшибки         = ОписаниеОшибки;
						ЗП.ПозицияМодуля          = СтрокаМодуля;
						ЗП.КодСообщения           = 68;
						ЗаписатьВПротоколВыполнения(68, ЗП);
						
					КонецПопытки;
					
				Иначе
					
					Значение = ВходящиеДанные[ПКС.Приемник];
					
				КонецЕсли;
				
			ИначеЕсли Не ПустаяСтрока(ПКС.Источник) Тогда
				
				Если ФлагРежимОтладки Тогда
					
					Попытка
						
						Значение	= Источник[ПКС.Источник];
						
					Исключение
						
						СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
						ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
						ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
						ЗП.ПКО                    = ПКО.Имя + "  (" + ПКО.Наименование + ")";
						ЗП.ПКС                    = ПКС.Имя + "  (" + ПКС.Наименование + ")";
						ЗП.Объект                 = Строка(Источник) + "  (" + ТипЗнч(Источник) + ")";
						ЗП.СвойствоПриемника      = ПКС.Приемник + "  (" + ПКС.ТипПриемника + ")";
						ЗП.ОписаниеОшибки         = ОписаниеОшибки;
						ЗП.ПозицияМодуля          = СтрокаМодуля;
						ЗП.КодСообщения           = 13;
						ЗаписатьВПротоколВыполнения(13, ЗП);
						
					КонецПопытки;
					
				Иначе
					
					Значение	= Источник[ПКС.Источник];
					
				КонецЕсли;
				
			Иначе // получаем конвертируемое значение по имени свойства приемника
				
				Если ФлагРежимОтладки Тогда
					
					Попытка
						
						Значение = Источник[ПКС.Приемник];
						
					Исключение
						
						СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
						ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
						ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
						ЗП.ПКО                    = ПКО.Имя + "  (" + ПКО.Наименование + ")";
						ЗП.ПКС                    = ПКС.Имя + "  (" + ПКС.Наименование + ")";
						ЗП.Объект                 = Строка(Источник) + "  (" + ТипЗнч(Источник) + ")";
						ЗП.СвойствоПриемника      = ПКС.Приемник + "  (" + ПКС.ТипПриемника + ")";
						ЗП.ОписаниеОшибки         = ОписаниеОшибки;
						ЗП.ПозицияМодуля          = СтрокаМодуля;
						ЗП.КодСообщения           = 14;
						ЗаписатьВПротоколВыполнения(14, ЗП);
						
					КонецПопытки;
					
				Иначе
					
					Значение = Источник[ПКС.Приемник];
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;


		Пусто = одПустое(Значение, ЭтоNULL);

		
		// Обработчик ПриВыгрузке

		Если ПКС.ЕстьОбработчикПриВыгрузке Тогда
			
			Отказ = Ложь;
			
			Если ФлагРежимОтладки Тогда
				
				Попытка
					
					Выполнить(ПКС.ПриВыгрузке);
					
				Исключение
					
					СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
					ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
					ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
					ЗП.ПКО                    = ПКО.Имя + "  (" + ПКО.Наименование + ")";
					ЗП.ПКС                    = ПКС.Имя + "  (" + ПКС.Наименование + ")";
					ЗП.Объект                 = Строка(Источник) + "  (" + ТипЗнч(Источник) + ")";
					ЗП.СвойствоПриемника      = ПКС.Приемник + "  (" + ПКС.ТипПриемника + ")";
					ЗП.КонвертируемоеЗначение = Строка(Значение) + "  (" + ТипЗнч(Значение) + ")";
					ЗП.Обработчик             = "ПриВыгрузкеСвойства";
					ЗП.ОписаниеОшибки         = ОписаниеОшибки;
					ЗП.ПозицияМодуля          = СтрокаМодуля;
					ЗП.КодСообщения           = 56;
					ЗаписатьВПротоколВыполнения(56, ЗП);
					
				КонецПопытки;
				
			Иначе
				
				Выполнить(ПКС.ПриВыгрузке);
				
			КонецЕсли;
			
			Если Отказ Тогда	//	Отказ от выгрузки свойства
				
				Продолжить;
				
			КонецЕсли;
			
		КонецЕсли;


		// Инициализируем еще раз переменную Пусто, может быть Значение было изменено 
		// в обработчике "При выгрузке"
		Пусто = одПустое(Значение, ЭтоNULL);

		Если Пусто Тогда
			
			Если ЭтоNULL Или ПустаяСтрока(ТипПриемника) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			одЗаписатьЭлемент(УзелСвойства, "Пусто");
			ДобавитьПодчиненный(УзелКоллекцииСвойств, УзелСвойства);
			Продолжить;
			
		КонецЕсли;


		
		УзелСсылки = Неопределено;
		
		Если (ПКОСвойств <> Неопределено) Или (Не ПустаяСтрока(ИмяПКО)) Тогда
			
			УзелСсылки    = ВыгрузитьПоПравилу(Значение,,ИсходящиеДанные,,ИмяПКО,,,ПКОСвойств);
			ТипУзлаСсылки = ТипЗнч(УзелСсылки);

			Если ПустаяСтрока(ТипПриемника) Тогда
				
				ТипПриемника  = ПКОСвойств.Приемник;
				УстановитьАтрибут(УзелСвойства, "Тип", ТипПриемника);
				
			КонецЕсли;
			
			Если УзелСсылки = Неопределено Тогда
				
				Продолжить;
				
			ИначеЕсли ТипУзлаСсылки = одТипСтрока Тогда
				
				Если Найти(УзелСсылки, "</Ссылка>") > 0 Тогда
					
					ДобавитьПодчиненный(УзелСвойства, УзелСсылки);
					
				Иначе
					
					одЗаписатьЭлемент(УзелСвойства, "Значение", УзелСсылки);
					
				КонецЕсли;
				
			ИначеЕсли ТипУзлаСсылки = одТипЧисло Тогда
				
				одЗаписатьЭлемент(УзелСвойства, "Нпп", УзелСсылки);
				
			Иначе
				
				ДобавитьПодчиненный(УзелСвойства, УзелСсылки);
				
			КонецЕсли;
			
		Иначе
			
			ТипЗначения = ТипЗнч(Значение);
			
			Если ТипЗначения = одТипСтрока Тогда
				
				Если ТипПриемника = "Строка"  Тогда
				ИначеЕсли ТипПриемника = "Число"  Тогда
					
					Значение = Число(Значение);
					
				ИначеЕсли ТипПриемника = "Булево"  Тогда
					
					Значение = Булево(Значение);
					
				ИначеЕсли ТипПриемника = "Дата"  Тогда
					
					Значение = Дата(Значение);
					
				ИначеЕсли ТипПриемника = "ХранилищеЗначения"  Тогда
					
					Значение = Новый ХранилищеЗначения(Значение);
					
				ИначеЕсли ПустаяСтрока(ТипПриемника) Тогда
					
					УстановитьАтрибут(УзелСвойства, "Тип", "Строка");
					
				Иначе
					
					//	Могут использоваться имя значения перечисления, код счета и т.п.
					
				КонецЕсли;
				
				одЗаписатьЭлемент(УзелСвойства, 	"Значение", Значение);
				
			ИначеЕсли ТипЗначения = одТипЧисло Тогда
				
				Если ТипПриемника = "Число"  Тогда
				ИначеЕсли ТипПриемника = "Булево"  Тогда
					
					Значение = Булево(Значение);
					
				ИначеЕсли ТипПриемника = "Строка"  Тогда
				ИначеЕсли ПустаяСтрока(ТипПриемника) Тогда
					
					УстановитьАтрибут(УзелСвойства, "Тип", "Число");
					
				Иначе
					
					Продолжить;
					
				КонецЕсли;
				
				одЗаписатьЭлемент(УзелСвойства, "Значение", Значение);
				
			ИначеЕсли ТипЗначения = одТипДата Тогда
				
				Если ТипПриемника = "Дата"  Тогда
				ИначеЕсли ТипПриемника = "Строка"  Тогда
					
					Значение = Лев(Строка(Значение), 10);
					
				ИначеЕсли ПустаяСтрока(ТипПриемника) Тогда
					
					УстановитьАтрибут(УзелСвойства, "Тип", "Дата");
					
				Иначе
					
					Продолжить;
					
				КонецЕсли;
				
				одЗаписатьЭлемент(УзелСвойства, "Значение", Значение);  // Формат(Значение, "ДФ=""ггггММддЧЧммсс""")
				
			ИначеЕсли ТипЗначения = одТипБулево Тогда
				
				Если ТипПриемника = "Булево"  Тогда
				ИначеЕсли ТипПриемника = "Число"  Тогда
					
					Значение = Число(Значение);
					
				ИначеЕсли ПустаяСтрока(ТипПриемника) Тогда
					
					УстановитьАтрибут(УзелСвойства, "Тип", "Булево");
					
				Иначе
					
					Продолжить;
					
				КонецЕсли;
				
				одЗаписатьЭлемент(УзелСвойства, "Значение", Значение);
				
			ИначеЕсли ТипЗначения = одТипХранилищеЗначения Тогда
				
				Если ПустаяСтрока(ТипПриемника) Тогда
					
					УстановитьАтрибут(УзелСвойства, "Тип", "ХранилищеЗначения");
					
				ИначеЕсли ТипПриемника <> "ХранилищеЗначения"  Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				одЗаписатьЭлемент(УзелСвойства, "Значение", Значение);
				
			Иначе
				
				ПКОСвойств = Менеджеры[ТипЗначения].ПКО;
				
				Если ПКОСвойств <> Неопределено Тогда
					
					ИмяПКО = ПКОСвойств.Имя;
					
					Если ПустаяСтрока(ТипПриемника) Тогда
						
						ТипПриемника  = ПКОСвойств.Приемник;
						УстановитьАтрибут(УзелСвойства, "Тип", ТипПриемника);
						
					КонецЕсли;
					
					УзелСсылки    = ВыгрузитьПоПравилу(Значение,,ИсходящиеДанные,,ИмяПКО,,,ПКОСвойств);
					ТипУзлаСсылки = ТипЗнч(УзелСсылки);
					
					Если УзелСсылки = Неопределено Тогда
						
						Продолжить;
						
					ИначеЕсли ТипУзлаСсылки = одТипСтрока Тогда
						
						Если Найти(УзелСсылки, "</Ссылка>") > 0 Тогда
							
							ДобавитьПодчиненный(УзелСвойства, УзелСсылки);
							
						Иначе
							
							одЗаписатьЭлемент(УзелСвойства, "Значение", УзелСсылки);
							
						КонецЕсли;
						
					ИначеЕсли ТипУзлаСсылки = одТипЧисло Тогда
						
						одЗаписатьЭлемент(УзелСвойства, "Нпп", УзелСсылки);
						
					Иначе
						
						ДобавитьПодчиненный(УзелСвойства, УзелСсылки);
						
					КонецЕсли;
					
				Иначе
					
					Продолжить;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;


		
		// Обработчик ПослеВыгрузки

		Если ПКС.ЕстьОбработчикПослеВыгрузки Тогда
			
			Отказ = Ложь;
			
			Если ФлагРежимОтладки Тогда
				
				Попытка
					
					Выполнить(ПКС.ПослеВыгрузки);
					
				Исключение
					
					СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
					ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
					ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
					ЗП.ПКО                    = ПКО.Имя + "  (" + ПКО.Наименование + ")";
					ЗП.ПКС                    = ПКС.Имя + "  (" + ПКС.Наименование + ")";
					ЗП.Объект                 = Строка(Источник) + "  (" + ТипЗнч(Источник) + ")";
					ЗП.СвойствоПриемника      = ПКС.Приемник + "  (" + ПКС.ТипПриемника + ")";
					ЗП.КонвертируемоеЗначение = Строка(Значение) + "  (" + ТипЗнч(Значение) + ")";
					ЗП.Обработчик             = "ПослеВыгрузкиСвойства";
					ЗП.ОписаниеОшибки         = ОписаниеОшибки;
					ЗП.ПозицияМодуля          = СтрокаМодуля;
					ЗП.КодСообщения           = 57;
					ЗаписатьВПротоколВыполнения(57, ЗП);
					
				КонецПопытки;
				
			Иначе
				
				Выполнить(ПКС.ПослеВыгрузки);
				
			КонецЕсли;
			
			Если Отказ Тогда	//	Отказ от выгрузки свойства
				
				Продолжить;
				
			КонецЕсли;
			
		КонецЕсли;

		
		ДобавитьПодчиненный(УзелКоллекцииСвойств, УзелСвойства);
		
	КонецЦикла;		//	по ПКС

КонецПроцедуры // ВыгрузитьСвойства()

// Производит выгрузку объекта в соответствии с указанным правилом конвертации
//
// Параметры:
//  Источник				 - произвольный источник данных
//  Приемник				 - xml-узел объекта приемника
//  ВходящиеДанные			 - произвольные вспомогательные данные, передаваемые правилу
//                             для выполнения конвертации
//  ИсходящиеДанные			 - произвольные вспомогательные данные, передаваемые правилам
//                             конвертации свойств
//  ИмяПКО					 - имя правила конвертации, согласно которому осуществляется выгрузка
//  УзелСсылки				 - xml-узел ссылки объекта приемника
//  ТолькоПолучитьУзелСсылки - если Истина, то выгрузка объекта не производится, только формируется
//                             xml-узел ссылки
//  ПКО						 - ссылка на правило конвертации
//
// Возвращаемое значение:
//  xml-узел ссылки или значение приемника
//
Функция ВыгрузитьПоПравилу(Источник					= Неопределено,
						   Приемник					= Неопределено,
						   ВходящиеДанные			= Неопределено,
						   ИсходящиеДанные			= Неопределено,
						   ИмяПКО					= "",
						   УзелСсылки				= Неопределено,
						   ТолькоПолучитьУзелСсылки	= Ложь,
						   ПКО						= Неопределено)

						   
	ОбработкаПрерыванияПользователя();
	
						   
	// Поиск ПКО
	
	Если ПКО = Неопределено Тогда
        ПКО = НайтиПравило(Источник, ИмяПКО);
		Если ПКО = Неопределено Тогда
			ЗаписатьВПротоколВыполнения(45); // не найдено ПКО
			Возврат Неопределено;
		КонецЕсли;
	ИначеЕсли Не ПустаяСтрока(ИмяПКО) Тогда
		Если ПКО.Имя <> ИмяПКО Тогда  // Правило переопределено. Больший приоритет имеет Имя!
	        ПКО = НайтиПравило(Источник, ИмяПКО);
			Если ПКО = Неопределено Тогда
				ЗаписатьВПротоколВыполнения(45); // не найдено ПКО
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;


	Если ФлагКомментироватьОбработкуОбъектов Тогда
		ЗП        = ПолучитьСтруктуруЗаписиПротокола();
		ЗП.ПКО    = ИмяПКО + "  (" + ПКО.Наименование + ")";
		Попытка
			ИсточникВСтроку = Строка(Источник);
		Исключение
			ИсточникВСтроку = " ";
		КонецПопытки;
		ПрОбъекта = ИсточникВСтроку + "  (" + ТипЗнч(Источник) + ")";
		ЗаписатьВПротоколВыполнения("Конвертация объекта или получение ссылки:  " + ПрОбъекта, ЗП, Ложь, 2, 7);
	КонецЕсли;


	ЗапоминатьВыгруженные       = ПКО.ЗапоминатьВыгруженные;
	ВыгруженныеОбъекты          = ПКО.Выгруженные;
	ВсеОбъектыВыгружены         = ПКО.ВсеОбъектыВыгружены;
	НеЗамещатьОбъектПриЗагрузке = ПКО.НеЗамещать;

	ПрефиксАвтонумерации		= "";
	РежимЗаписи     			= "";
	РежимПроведения 			= "";


	ИмяТипа          = "";
	СтруктураСвойств = Менеджеры[ПКО.Источник];
	Если СтруктураСвойств <> Неопределено Тогда
		ИмяТипа = СтруктураСвойств.ИмяТипа;
	Иначе
		СтруктураСвойств = Менеджеры[ТипЗнч(Источник)];
		Если СтруктураСвойств <> Неопределено Тогда
			ИмяТипа = СтруктураСвойств.ИмяТипа;
		КонецЕсли;
	КонецЕсли;

	// КлючВыгружаемыхДанных
	
	Если (Источник <> Неопределено) И ЗапоминатьВыгруженные Тогда
		Если ИмяТипа = "РегистрСведений" ИЛИ ПустаяСтрока(ИмяТипа) Тогда
			ЗапоминатьВыгруженные = Ложь;
		Иначе
			КлючВыгружаемыхДанных = ЗначениеВСтрокуВнутр(Источник);
		КонецЕсли;
	Иначе
		КлючВыгружаемыхДанных = ИмяПКО;
		ЗапоминатьВыгруженные = Ложь;
	КонецЕсли;
	
	
	// Переменная для хранения имени предопределенного элемента
	ИмяПредопределенногоЭлемента = Неопределено;

	// Глобальный обработчик ПередКонвертациейОбъекта

	Если ЕстьГлобальныйОбработчикПередКонвертациейОбъекта Тогда
		Отказ = Ложь;
		
		Если ФлагРежимОтладки Тогда
			Попытка
				Выполнить(Конвертация.ПередКонвертациейОбъекта);
			Исключение
				СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
				ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
				ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
				ЗП.ПКО                    = ПКО.Имя + "  (" + ПКО.Наименование + ")";
				ЗП.Объект                 = Строка(Источник) + "  (" + ТипЗнч(Источник) + ")";
				ЗП.Обработчик             = "ПередКонвертациейОбъекта (глобальный)";
				ЗП.ОписаниеОшибки         = ОписаниеОшибки;
				ЗП.ПозицияМодуля          = СтрокаМодуля;
				ЗП.КодСообщения           = 64;
				ЗаписатьВПротоколВыполнения(64, ЗП);
			КонецПопытки;
		Иначе
			Выполнить(Конвертация.ПередКонвертациейОбъекта);
		КонецЕсли;
		
		Если Отказ Тогда	//	Отказ от дальнейшей обработки правила
			Возврат Приемник;
		КонецЕсли;
	КонецЕсли;


	
	// Обработчик ПередВыгрузкой

	Если ПКО.ЕстьОбработчикПередВыгрузкой Тогда
		Отказ = Ложь;
		
		Если ФлагРежимОтладки Тогда
			Попытка
				Выполнить(ПКО.ПередВыгрузкой);
			Исключение
				СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
				ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
				ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
				ЗП.ПКО                    = ПКО.Имя + "  (" + ПКО.Наименование + ")";
				ЗП.Объект                 = Строка(Источник) + "  (" + ТипЗнч(Источник) + ")";
				ЗП.Обработчик             = "ПередВыгрузкойОбъекта";
				ЗП.ОписаниеОшибки         = ОписаниеОшибки;
				ЗП.ПозицияМодуля          = СтрокаМодуля;
				ЗП.КодСообщения           = 41;
				ЗаписатьВПротоколВыполнения(41, ЗП);
			КонецПопытки;
		Иначе
			Выполнить(ПКО.ПередВыгрузкой);
		КонецЕсли;
		
		Если Отказ Тогда	//	Отказ от дальнейшей обработки правила
			Возврат Приемник;
		КонецЕсли;
	КонецЕсли;



	// Возможно такие данные уже выгружались

	Если Не ВсеОбъектыВыгружены Тогда
		
		Если ЗапоминатьВыгруженные Тогда
			УзелСсылки = ВыгруженныеОбъекты[КлючВыгружаемыхДанных];
			Если УзелСсылки <> Неопределено Тогда
				Возврат УзелСсылки;
			КонецЕсли;
		КонецЕсли;
		
		мСчетчикВыгруженныхОбъектов = 1 + мСчетчикВыгруженныхОбъектов;
		Нпп                         = мСчетчикВыгруженныхОбъектов;

		
		// Это позволит избежать циклических ссылок

		Если ЗапоминатьВыгруженные Тогда
			ВыгруженныеОбъекты[КлючВыгружаемыхДанных] = Нпп;
		КонецЕсли;

	КонецЕсли;

	СоответствиеЗначений = ПКО.Значения;
	
	// Обработка  соответствий предопределенных элементов
	Если ВерсияПлатформыПриемника = "8.0" Тогда
		Попытка
			ИмяПредопределенногоИсточник = СтруктураСвойств.Менеджер.ПолучитьИмяПредопределенного(Источник.Ссылка)
		Исключение
			ИмяПредопределенногоИсточник = "";
		КонецПопытки;
		Если НЕ ПустаяСтрока(ИмяПредопределенногоИсточник) Тогда
			Если СоответствиеЗначений.Количество() > 0 Тогда
				ИмяПредопределенногоЭлемента = СоответствиеЗначений[Источник];
				СоответствиеЗначений.Очистить();
			КонецЕсли;
		КонецЕсли;
	Иначе
		ИмяПредопределенногоИсточник = "";
	КонецЕсли;

	Если СоответствиеЗначений.Количество() = 0 Тогда
		Если ПКО.СвойстваПоиска.Количество() > 0 ИЛИ НЕ ИмяПредопределенногоЭлемента = Неопределено Тогда
			//	Формируем узел ссылки
			УзелСсылки = СоздатьУзел("Ссылка");
			Если ЗапоминатьВыгруженные И (Не ВсеОбъектыВыгружены) Тогда
				УстановитьАтрибут(УзелСсылки, "Нпп", Нпп);
				ВыгрузитьСвойства(Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО, ПКО.СвойстваПоиска, УзелСсылки, , ИмяПредопределенногоЭлемента);
				УзелСсылки.ЗаписатьКонецЭлемента();
				УзелСсылки = УзелСсылки.Закрыть();
				ВыгруженныеОбъекты[КлючВыгружаемыхДанных] = УзелСсылки;
				//ВыгруженныеОбъекты[КлючВыгружаемыхДанных] = КопироватьУзел(УзелСсылки);
			Иначе
				ВыгрузитьСвойства(Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО, ПКО.СвойстваПоиска, УзелСсылки, , ИмяПредопределенногоЭлемента);
				УзелСсылки.ЗаписатьКонецЭлемента();
				УзелСсылки = УзелСсылки.Закрыть();
			КонецЕсли;
		Иначе
			УзелСсылки = Нпп;
		КонецЕсли;
	Иначе
		// Поиск в соответствии значений по ПКЗ
		УзелСсылки = СоответствиеЗначений[Источник];
		Если УзелСсылки = Неопределено Тогда
			ЗаписатьВПротоколВыполнения(71);
			Возврат Неопределено;
		КонецЕсли;
		Если ЗапоминатьВыгруженные Тогда
			ВыгруженныеОбъекты[КлючВыгружаемыхДанных] = УзелСсылки;
		КонецЕсли;
		Возврат УзелСсылки;
	КонецЕсли;

	
	
	Если ТолькоПолучитьУзелСсылки
	 Или ВсеОбъектыВыгружены Тогда
	 //Или ПКО.СпособВыгрузки = "ИспользоватьТолькоСсылку" Тогда
		Возврат УзелСсылки;
	КонецЕсли; 


	
	Если Приемник = Неопределено Тогда
		Приемник = СоздатьУзел("Объект");
		УстановитьАтрибут(Приемник, "Нпп",			Нпп);
		УстановитьАтрибут(Приемник, "Тип", 			ПКО.Приемник);
		УстановитьАтрибут(Приемник, "ИмяПравила",	ПКО.Имя);
		Если НеЗамещатьОбъектПриЗагрузке Тогда
			УстановитьАтрибут(Приемник, "НеЗамещать",	"true");
		КонецЕсли;
		Если Не ПустаяСтрока(ПрефиксАвтонумерации) Тогда
			УстановитьАтрибут(Приемник, "ПрефиксАвтонумерации",	ПрефиксАвтонумерации);
		КонецЕсли;
		Если Не ПустаяСтрока(РежимЗаписи) Тогда
			УстановитьАтрибут(Приемник, "РежимЗаписи",	РежимЗаписи);
			Если Не ПустаяСтрока(РежимПроведения) Тогда
				УстановитьАтрибут(Приемник, "РежимПроведения",	РежимПроведения);
			КонецЕсли;
		КонецЕсли;
		Если ТипЗнч(УзелСсылки) <> одТипЧисло Тогда
			ДобавитьПодчиненный(Приемник, УзелСсылки);
		КонецЕсли; 
	КонецЕсли;


	
    // Обработчик ПриВыгрузке
	
	СтандартнаяОбработка = Истина;
	
	Если ПКО.ЕстьОбработчикПриВыгрузке Тогда
		
		Если ФлагРежимОтладки Тогда
			Попытка
				Выполнить(ПКО.ПриВыгрузке);
			Исключение
				СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
				ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
				ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
				ЗП.ПКО                    = ПКО.Имя + "  (" + ПКО.Наименование + ")";
				ЗП.Объект                 = Строка(Источник) + "  (" + ТипЗнч(Источник) + ")";
				ЗП.Обработчик             = "ПриВыгрузкеОбъекта";
				ЗП.ОписаниеОшибки         = ОписаниеОшибки;
				ЗП.ПозицияМодуля          = СтрокаМодуля;
				ЗП.КодСообщения           = 42;
				ЗаписатьВПротоколВыполнения(42, ЗП);
			КонецПопытки;
		Иначе
			Выполнить(ПКО.ПриВыгрузке);
		КонецЕсли;
		
	КонецЕсли;



	// Выгрузка свойств
	
	Если СтандартнаяОбработка Тогда
        ВыгрузитьСвойства(Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО, ПКО.Свойства);
	КонецЕсли; 


	
    // Обработчик ПослеВыгрузки

	Если ПКО.ЕстьОбработчикПослеВыгрузки Тогда
		Отказ = Ложь;

		Если ФлагРежимОтладки Тогда
			Попытка
				Выполнить(ПКО.ПослеВыгрузки);
			Исключение
				СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
				ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
				ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
				ЗП.ПКО                    = ПКО.Имя + "  (" + ПКО.Наименование + ")";
				ЗП.Объект                 = Строка(Источник) + "  (" + ТипЗнч(Источник) + ")";
				ЗП.Обработчик             = "ПослеВыгрузкиОбъекта";
				ЗП.ОписаниеОшибки         = ОписаниеОшибки;
				ЗП.ПозицияМодуля          = СтрокаМодуля;
				ЗП.КодСообщения           = 43;
				ЗаписатьВПротоколВыполнения(43, ЗП);
			КонецПопытки;
		Иначе
			Выполнить(ПКО.ПослеВыгрузки);
		КонецЕсли;
		
		Если Отказ Тогда	//	отказ от записи объекта в файл
			Возврат УзелСсылки;
		КонецЕсли;
	КонецЕсли;


	//	Запись объекта в файл

	
	Приемник.ЗаписатьКонецЭлемента();
	
	ЗаписатьВФайл(Приемник);
	
	Возврат УзелСсылки;

КонецФункции	//	ВыгрузитьПоПравилу()

// Производит выгрузку объекта выборки в соответствии с указанным правилом
//
// Параметры:
//  Объект         - выгружаемый объект выборки
//  Правило        - ссылка на правило выгрузки данных
//  Свойства       - свойства объекта метаданного выгружаемого объекта 
//  ВходящиеДанные - произвольные вспомогательные данные
// 
Процедура ВыгрузкаОбъектаВыборки(Объект, Правило, Свойства=Неопределено, ВходящиеДанные=Неопределено)

	Если ФлагКомментироватьОбработкуОбъектов Тогда
		Попытка
			ПрОбъекта   = Строка(Объект) + "  (" + ТипЗнч(Объект) + ")";
			ЗаписатьВПротоколВыполнения("Выгрузка объекта выборки:  " + ПрОбъекта, , Ложь, 1, 7);
		Исключение
			ЗаписатьВПротоколВыполнения("Выгрузка объекта выборки:  " + ТипЗнч(Объект), , Ложь, 1, 7);
		КонецПопытки; 
	КонецЕсли;
	
	
	ИмяПКО			= Правило.ПравилоКонвертации;
	Отказ			= Ложь;
	ИсходящиеДанные	= Неопределено;
	

	// Глобальный обработчик ПередВыгрузкойОбъекта

	Если ЕстьГлобальныйОбработчикПередВыгрузкойОбъекта Тогда
		Если ФлагРежимОтладки Тогда
			Попытка
				Выполнить(Конвертация.ПередВыгрузкойОбъекта);
			Исключение
				СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
				ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
				ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
				ЗП.ПВД                    = Правило.Имя;
				ЗП.Объект                 = Строка(Объект) + "  (" + ТипЗнч(Объект) + ")";
				ЗП.Обработчик             = "ПередВыгрузкойОбъектаВыборки (глобальный)";
				ЗП.ОписаниеОшибки         = ОписаниеОшибки;
				ЗП.ПозицияМодуля          = СтрокаМодуля;
				ЗП.КодСообщения           = 65;
				ЗаписатьВПротоколВыполнения(65, ЗП);
			КонецПопытки;
		Иначе
			Выполнить(Конвертация.ПередВыгрузкойОбъекта);
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	

	// Обработчик ПередВыгрузкой
	
	Если ФлагРежимОтладки Тогда
		Попытка
			Выполнить(Правило.ПередВыгрузкой);
		Исключение
			СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
			ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
			ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
			ЗП.ПВД                    = Правило.Имя;
			ЗП.Объект                 = Строка(Объект) + "  (" + ТипЗнч(Объект) + ")";
			ЗП.Обработчик             = "ПередВыгрузкойОбъектаВыборки";
			ЗП.ОписаниеОшибки         = ОписаниеОшибки;
			ЗП.ПозицияМодуля          = СтрокаМодуля;
			ЗП.КодСообщения           = 33;
			ЗаписатьВПротоколВыполнения(33, ЗП);
		КонецПопытки;
	Иначе
		Выполнить(Правило.ПередВыгрузкой);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 


    УзелСсылки = Неопределено;
	
	ВыгрузитьПоПравилу(Объект, , ИсходящиеДанные, , ИмяПКО, УзелСсылки);


	
	// Глобальный обработчик ПослеВыгрузкиОбъекта

	Если ЕстьГлобальныйОбработчикПослеВыгрузкиОбъекта Тогда
		Если ФлагРежимОтладки Тогда
			Попытка
				Выполнить(Конвертация.ПослеВыгрузкиОбъекта);
			Исключение
				СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
				ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
				ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
				ЗП.ПВД                    = Правило.Имя;
				ЗП.Объект                 = Строка(Объект) + "  (" + ТипЗнч(Объект) + ")";
				ЗП.Обработчик             = "ПослеВыгрузкиОбъектаВыборки (глобальный)";
				ЗП.ОписаниеОшибки         = ОписаниеОшибки;
				ЗП.ПозицияМодуля          = СтрокаМодуля;
				ЗП.КодСообщения           = 69;
				ЗаписатьВПротоколВыполнения(69, ЗП);
			КонецПопытки;
		Иначе
			Выполнить(Конвертация.ПослеВыгрузкиОбъекта);
		КонецЕсли;
	КонецЕсли;

	
    // Обработчик ПослеВыгрузки
	
	Если ФлагРежимОтладки Тогда
		Попытка
			Выполнить(Правило.ПослеВыгрузки);
		Исключение
			СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
			ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
			ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
			ЗП.ПВД                    = Правило.Имя;
			ЗП.Объект                 = Строка(Объект) + "  (" + ТипЗнч(Объект) + ")";
			ЗП.Обработчик             = "ПослеВыгрузкиОбъектаВыборки";
			ЗП.ОписаниеОшибки         = ОписаниеОшибки;
			ЗП.ПозицияМодуля          = СтрокаМодуля;
			ЗП.КодСообщения           = 34;
			ЗаписатьВПротоколВыполнения(34, ЗП);
		КонецПопытки;
	Иначе
		Выполнить(Правило.ПослеВыгрузки);
	КонецЕсли;
	
КонецПроцедуры // ВыгрузкаОбъектаВыборки()

// Выгружает данные по указанному правилу
//
// Параметры:
//  Правило        - ссылка на правило выгрузки данных
// 
Процедура ВыгрузитьДанныеПоПравилу(Правило)
	
	ИмяПКО = Правило.ПравилоКонвертации;
	
	Если Не ПустаяСтрока(ИмяПКО) Тогда
		
		ПКО = Правила[ИмяПКО];
		
	КонецЕсли;


	Если ФлагКомментироватьОбработкуОбъектов Тогда
		
		//ЗП        = ПолучитьСтруктуруЗаписиПротокола();
		//ЗП.ПВД    = Правило.Имя + "  (" + Правило.Наименование + ")";
		ПрПравила   = Правило.Имя + "  (" + Правило.Наименование + ")";
		ЗаписатьВПротоколВыполнения("Начало обработки правила выгрузки данных:  " + ПрПравила, , Ложь, , 4);
		
	КонецЕсли;
	
	
	// Обработчик ПередОбработкой

	Отказ			= Ложь;
	ИсходящиеДанные	= Неопределено;
	ВыборкаДанных	= Неопределено;


	Если ФлагРежимОтладки Тогда
		
		Попытка
			
			Выполнить(Правило.ПередОбработкой);
			
		Исключение
			
			СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
			ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
			ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
			ЗП.ПВД                    = Правило.Имя;
			ЗП.Обработчик             = "ПередОбработкойВыгрузкиДанных";
			ЗП.ОписаниеОшибки         = ОписаниеОшибки;
			ЗП.ПозицияМодуля          = СтрокаМодуля;
			ЗП.КодСообщения           = 31;
			ЗаписатьВПротоколВыполнения(31, ЗП);
			
		КонецПопытки;
		
	Иначе
		
		Выполнить(Правило.ПередОбработкой);
		
	КонецЕсли;
	
	Если Отказ Тогда
		
		Возврат;
		
	КонецЕсли;


	// Стандартная выборка с отбрром
	Если Правило.СпособОтбораДанных = "СтандартнаяВыборка" И Правило.ИспользоватьОтбор Тогда

		ИмяМетаданных           = Правило.ИмяОбъектаДляЗапроса;
		ПостроительОтчета.Текст = "ВЫБРАТЬ Объект.Ссылка КАК Ссылка ИЗ " + ИмяМетаданных + " КАК Объект "+ "{ГДЕ Объект.Ссылка.* КАК " + СтрЗаменить(ИмяМетаданных, ".", "_") + "}";
		ПостроительОтчета.Отбор.Сбросить();
		Если НЕ Правило.НастройкиПостроителя = Неопределено Тогда
			ПостроительОтчета.УстановитьНастройки(Правило.НастройкиПостроителя);
		КонецЕсли;

		ПостроительОтчета.Выполнить();
		Выборка = ПостроительОтчета.Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ВыгрузкаОбъектаВыборки(Выборка.Ссылка, Правило, , ИсходящиеДанные);
		КонецЦикла;

	// Стандартная выборка без отбора
	ИначеЕсли (Правило.СпособОтбораДанных = "СтандартнаяВыборка") Тогда
		
		Свойства	= Менеджеры[Правило.ОбъектВыборки];
		ИмяТипа		= Свойства.ИмяТипа;
		
		Если	  ИмяТипа = "Справочник" Тогда
			
			Выборка =	Свойства.Менеджер.Выбрать();
			Состояние("Выгрузка справочника:  " + Свойства.Имя);
			
		ИначеЕсли ИмяТипа = "Документ" Тогда
			
			Выборка =	Свойства.Менеджер.Выбрать(ДатаНачала, ДатаОкончания);
			Состояние("Выгрузка документов:  " + Свойства.Имя);
			
		ИначеЕсли ИмяТипа = "ПланВидовХарактеристик" Тогда
			
			Выборка =	Свойства.Менеджер.Выбрать();
			Состояние("Выгрузка плана видов характеристик:  " + Свойства.Имя);
			
		ИначеЕсли ИмяТипа = "ПланСчетов" Тогда
			
			Выборка =	Свойства.Менеджер.Выбрать();
			Состояние("Выгрузка плана счетов:  " + Свойства.Имя);
			
		ИначеЕсли ИмяТипа = "ПланВидовРасчета" Тогда
			
			Выборка =	Свойства.Менеджер.Выбрать();
			Состояние("Выгрузка плана видов расчета:  " + Свойства.Имя);
			
		ИначеЕсли ИмяТипа = "РегистрСведений" Тогда
			
			Непериодический = (Свойства.ОбъектМД.ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический);
			
			Если Непериодический Тогда
				
				Выборка = Свойства.Менеджер.Выбрать();
				
			Иначе
				
				Выборка = Свойства.Менеджер.Выбрать(ДатаНачала, ДатаОкончания);
				
			КонецЕсли;
			
			Состояние("Выгрузка регистра сведений:  " + Свойства.Имя);
			
		ИначеЕсли ИмяТипа = "РегистрБухгалтерии" Тогда	
			
			Выборка =	Свойства.Менеджер.Выбрать();
			Состояние("Выгрузка регистра бухгалтерии:  " + Свойства.Имя);

		ИначеЕсли ИмяТипа = "Константы" Тогда
			
			НаборКонстант = Константы.СоздатьНабор();
			НаборКонстант.Прочитать();
			ВыгрузкаОбъектаВыборки(НаборКонстант, Правило, Свойства, ИсходящиеДанные);
			
		Иначе
			
			Возврат;
			
		КонецЕсли;

		Если ИмяТипа <> "Константы" Тогда
			
			Пока Выборка.Следующий() Цикл
				
				Если ИмяТипа =  "РегистрСведений" ИЛИ ИмяТипа =  "РегистрБухгалтерии" Тогда
					
					ВыгрузкаОбъектаВыборки(Выборка, Правило, Свойства, ИсходящиеДанные);
					
				Иначе
					
					ВыгрузкаОбъектаВыборки(Выборка.Ссылка, Правило, Свойства, ИсходящиеДанные);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;

	ИначеЕсли Правило.СпособОтбораДанных = "ПроизвольныйАлгоритм" Тогда
		
		Если ТаблицаВыгружаемыхОбъектов<>Неопределено Тогда
			ВыборкаДанных=Новый Массив;
			
			СтрокиТО=ТаблицаВыгружаемыхОбъектов.НайтиСтроки(НОвый Структура("ИмяПравила",Правило.ПравилоКонвертации));
			Для Каждого СтрокаТО Из СтрокиТО Цикл
				Для Каждого ЭлементДанных Из СтрокаТО.МассивДанных Цикл
					ВыборкаДанных.Добавить(ЭлементДанных);					
				КонецЦикла;					
			КонецЦикла;				
		КонецЕсли; 

		Если ВыборкаДанных <> Неопределено Тогда
			
            ТипВыборки = ТипЗнч(ВыборкаДанных);
			
			Если ТипВыборки = Тип("ВыборкаИзРезультатаЗапроса") Тогда
				
				Пока ВыборкаДанных.Следующий() Цикл
					
					ВыгрузкаОбъектаВыборки(ВыборкаДанных, Правило, , ИсходящиеДанные);
					
				КонецЦикла;
				
			ИначеЕсли ТипВыборки = Тип("РезультатЗапроса") Тогда
				
				Выборка = ВыборкаДанных.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					ВыгрузкаОбъектаВыборки(Выборка, Правило, , ИсходящиеДанные);
					
				КонецЦикла;
				
			ИначеЕсли ТипВыборки = Тип("Запрос") Тогда
				
				РезультатЗапроса = ВыборкаДанных.Выполнить();
				Выборка          = РезультатЗапроса.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					ВыгрузкаОбъектаВыборки(Выборка, Правило, , ИсходящиеДанные);
					
				КонецЦикла;
				
			Иначе				
								
				Для каждого Объект Из ВыборкаДанных Цикл
					
					ВыгрузкаОбъектаВыборки(Объект, Правило, , ИсходящиеДанные);
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЕсли;

	
	// Обработчик ПослеОбработки

	//ВсеОбъектыВыгружены   = ПКО.ВсеОбъектыВыгружены;
	
	Если ФлагРежимОтладки Тогда
		
		Попытка
			
			Выполнить(Правило.ПослеОбработки);
			
		Исключение
			
			СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
			ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
			ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
			ЗП.ПВД                    = Правило.Имя;
			ЗП.Обработчик             = "ПослеОбработкиВыгрузкиДанных";
			ЗП.ОписаниеОшибки         = ОписаниеОшибки;
			ЗП.ПозицияМодуля          = СтрокаМодуля;
			ЗП.КодСообщения           = 32;
			ЗаписатьВПротоколВыполнения(32, ЗП);
			
		КонецПопытки;
		
	Иначе
		
		Выполнить(Правило.ПослеОбработки);
		
	КонецЕсли;
	
КонецПроцедуры // ВыгрузитьДанныеПоПравилу()

// Обходит дерево правил выгрузки данных и выполняет выгрузку
//
// Параметры:
//  Строки         - Коллекция строк дерева значений
// 
Процедура ОбработатьПравилаВыгрузки(Строки,ТО=НЕопределено)
	
	Для каждого ПравилоВыгрузки Из Строки Цикл
		
		Если ПравилоВыгрузки.Включить = 0 Тогда
			
			Продолжить;
			
		КонецЕсли; 

		Если ПравилоВыгрузки.ЭтоГруппа Тогда
			
			ОбработатьПравилаВыгрузки(ПравилоВыгрузки.Строки);
			Продолжить;
			
		КонецЕсли;
		
		ВыгрузитьДанныеПоПравилу(ПравилоВыгрузки);
		
	КонецЦикла; 
	
КонецПроцедуры // ОбработатьПравилаВыгрузки() 


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Открывает файл обмена, читает атрибуты корневого узла файла в соответвтии с форматом обмена
//
// Параметры:
//  ТолькоПрочитатьШапку - Булево. если Истина, то после прочтения шапки файла обмена
//  (корневой узел), файл закрывается
//
Процедура ОткрытьФайлЗагрузки(ТолькоПрочитатьШапку=Ложь) Экспорт

	Если ПустаяСтрока(ИмяФайлаОбмена) И ТолькоПрочитатьШапку Тогда
		ДатаНачала         = "";
		ДатаОкончания      = "";
		ДатаВыгрузкиДанных = "";
		ВерсияПравилОбмена = "";
		Комментарий        = "";
		Возврат;
	КонецЕсли;


    ИмяФайлаЗагрузкиДанных = ИмяФайлаОбмена;
	
	
	// Архивные файлы будем идентифицировать по расширению ".aml"
	
	Если Найти(ИмяФайлаОбмена, ".aml") > 0 Тогда
		Состояние("Выполняется распаковка файла обмена...");
		РаспаковкаФайла        = Новый ЧтениеТекста(ИмяФайлаОбмена, КодировкаТекста.UTF8);
		Хранилище              = XMLЗначение(одТипХранилищеЗначения, РаспаковкаФайла.Прочитать());
		ДвоичныеДанные         = Хранилище.Получить();
		ИмяФайлаЗагрузкиДанных = СтрЗаменить(ИмяФайлаОбмена, ".aml", ".xml");
		Попытка
			ДвоичныеДанные.Записать(ИмяФайлаЗагрузкиДанных);
		Исключение
			СтрокаМодуля    = ОтделитьРазделителем(ОписаниеОшибки(), "{");
			ОписаниеОшибки  = ОтделитьРазделителем(СтрокаМодуля, "}: ");
			ЗП = ПолучитьСтруктуруЗаписиПротокола();
			ЗП.ОписаниеОшибки = ОписаниеОшибки;
			ЗП.КодСообщения   = 2;
			ЗаписатьВПротоколВыполнения(2, ЗП, Истина);
		КонецПопытки; 
	КонецЕсли; 
	
	
	ФлагОшибки = Ложь;
	ФайлОбмена = Новый ЧтениеXML();

	Попытка
		ФайлОбмена.ОткрытьФайл(ИмяФайлаЗагрузкиДанных);
	Исключение
		ЗаписатьВПротоколВыполнения(5);
		Возврат;
	КонецПопытки;
	
	ФайлОбмена.Прочитать();


	мАтрибутыФайлаОбмена = Новый Структура;
	
	
	Если ФайлОбмена.ЛокальноеИмя = "ФайлОбмена" Тогда
		мАтрибутыФайлаОбмена.Вставить("ВерсияФормата",            одАтрибут(ФайлОбмена, одТипСтрока, "ВерсияФормата"));
		мАтрибутыФайлаОбмена.Вставить("ДатаВыгрузки",             одАтрибут(ФайлОбмена, одТипДата,   "ДатаВыгрузки"));
		мАтрибутыФайлаОбмена.Вставить("НачалоПериодаВыгрузки",    одАтрибут(ФайлОбмена, одТипДата,   "НачалоПериодаВыгрузки"));
		мАтрибутыФайлаОбмена.Вставить("ОкончаниеПериодаВыгрузки", одАтрибут(ФайлОбмена, одТипДата,   "ОкончаниеПериодаВыгрузки"));
		мАтрибутыФайлаОбмена.Вставить("ИмяКонфигурацииИсточника", одАтрибут(ФайлОбмена, одТипСтрока, "ИмяКонфигурацииИсточника"));
		мАтрибутыФайлаОбмена.Вставить("ИмяКонфигурацииПриемника", одАтрибут(ФайлОбмена, одТипСтрока, "ИмяКонфигурацииПриемника"));
		мАтрибутыФайлаОбмена.Вставить("ИдПравилКонвертации",      одАтрибут(ФайлОбмена, одТипСтрока, "ИдПравилКонвертации"));

		ДатаНачала         = мАтрибутыФайлаОбмена.НачалоПериодаВыгрузки;
		ДатаОкончания      = мАтрибутыФайлаОбмена.ОкончаниеПериодаВыгрузки;
		ДатаВыгрузкиДанных = мАтрибутыФайлаОбмена.ДатаВыгрузки;
		Комментарий        = одАтрибут(ФайлОбмена, одТипСтрока, "Комментарий");
	Иначе
		ЗаписатьВПротоколВыполнения(9);
		Возврат;
	КонецЕсли;


	ФайлОбмена.Прочитать();
			
	ИмяУзла = ФайлОбмена.ЛокальноеИмя;
	ТипУзла = ФайлОбмена.ТипУзла;

	
	Если ИмяУзла = "ПравилаОбмена" Тогда
		ЗагрузитьПравилаОбмена(ФайлОбмена, "ЧтениеXML");
	Иначе
		ФайлОбмена.Закрыть();
		ФайлОбмена = Новый ЧтениеXML();
		Попытка
			ФайлОбмена.ОткрытьФайл(ИмяФайлаЗагрузкиДанных);
		Исключение
			ЗаписатьВПротоколВыполнения(5);
			Возврат;
		КонецПопытки;
		ФайлОбмена.Прочитать();
	КонецЕсли; 

	
	Если ТолькоПрочитатьШапку Тогда
		ФайлОбмена.Закрыть();
		Возврат;
	КонецЕсли;
   
КонецПроцедуры // ОткрытьФайлЗагрузки()

// Удаляет все объекты указанного типа
//
// Параметры:
//  ТипСтрокой     - Строка. Тип ссылки в строковом представлении. Например: СправочникСсылка.Номенклатура
// 
Процедура УдалитьОбъектыТипа(ТипСтрокой)

	Менеджер = Менеджеры[Тип(ТипСтрокой)];
	ИмяТипа  = Менеджер.ИмяТипа;
	Имя      = Менеджер.Имя;

	Если ИмяТипа = "Справочник" Тогда
		
		Попытка
			
			Выборка = Справочники[Имя].ВыбратьИерархически();
			
		Исключение
			
			Выборка = Справочники[Имя].Выбрать();
			
		КонецПопытки;
		
		Состояние("Очистка справочника:  " + Имя);
		
		Пока Выборка.Следующий() Цикл
			
			ОбработкаПрерыванияПользователя();
			
			Если Выборка.Предопределенный Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Попытка
			
				Выборка.ПолучитьОбъект().Удалить();
				
			Исключение
				
			КонецПопытки;
			
		КонецЦикла;
		
	ИначеЕсли ИмяТипа = "Документ" Тогда

        Выборка	= Документы[Имя].Выбрать();
		
		Состояние("Очистка документов:  " + Имя);
		
		Пока Выборка.Следующий() Цикл
			
			ОбработкаПрерыванияПользователя();
			
			Попытка
			
				Выборка.ПолучитьОбъект().Удалить();
				
			Исключение
				
			КонецПопытки;
			
		КонецЦикла;

	ИначеЕсли ИмяТипа = "ПланВидовХарактеристик" Тогда

		Попытка
			
        	Выборка = ПланыВидовХарактеристик[Имя].ВыбратьИерархически();
			
		Исключение
			
			Выборка = ПланыВидовХарактеристик[Имя].Выбрать();
			
		КонецПопытки;
		
		Состояние("Очистка плана видов характеристик:  " + Имя);
		
		Пока Выборка.Следующий() Цикл
			
			ОбработкаПрерыванияПользователя();
			
			Если Выборка.Предопределенный Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Попытка
			
				Выборка.ПолучитьОбъект().Удалить();
				
			Исключение
				
			КонецПопытки;
			
		КонецЦикла;
		
	ИначеЕсли ИмяТипа = "ПланВидовРасчета" Тогда

		Выборка =	ПланыВидовРасчета[Имя].Выбрать();
		Состояние("Очистка плана видов расчета:  " + Имя);
		
		Пока Выборка.Следующий() Цикл
			
			ОбработкаПрерыванияПользователя();
			
			Если Выборка.Предопределенный Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Попытка
			
				Выборка.ПолучитьОбъект().Удалить();
				
			Исключение
				
			КонецПопытки;
			
		КонецЦикла;
		
	ИначеЕсли ИмяТипа = "РегистрСведений" Тогда

		Выборка = РегистрыСведений[Имя].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ОбработкаПрерыванияПользователя();
			Выборка.ПолучитьМенеджерЗаписи().Удалить();
			
		КонецЦикла;

	КонецЕсли;
	
КонецПроцедуры // УдалитьОбъектыТипа() 

// Производит очистку информаионной базы. Используется при отладке обмена
//
// Параметры:
//  Нет.
// 
Процедура УдалитьВсе() Экспорт

	Если Вопрос("Удалить всю информацию из базы данных?", РежимДиалогаВопрос.ДаНет, 60) <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	

	// Справочники
	
	Для каждого ОбъектМД Из Метаданные.Справочники Цикл
		Имя			=	ОбъектМД.Имя;
		УдалитьОбъектыТипа("СправочникСсылка." + Имя);
	КонецЦикла;

	
	// ПВХ
	
	Для каждого ОбъектМД Из Метаданные.ПланыВидовХарактеристик Цикл
		Имя			=	ОбъектМД.Имя;
		УдалитьОбъектыТипа("ПланВидовХарактеристикСсылка." + Имя);
	КонецЦикла;


	// Документы
	
	Для каждого ОбъектМД Из Метаданные.Документы Цикл
		Имя		=	ОбъектМД.Имя;
		УдалитьОбъектыТипа("ДокументСсылка." + Имя);
	КонецЦикла;

	
	// РегистрыСведений
	
	Для каждого ОбъектМД Из Метаданные.РегистрыСведений Цикл
		Имя				=	ОбъектМД.Имя;
		Подчинен		=	(ОбъектМД.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору);
		Если Подчинен Тогда Продолжить КонецЕсли;
		УдалитьОбъектыТипа("РегистрСведенийЗапись." + Имя);
	КонецЦикла;

	Состояние("Вся информация удалена!");
	
КонецПроцедуры // УдалитьВсе()

// Осуществляет загрузку правил обмена в соответствии с форматом
//
// Параметры:
//  Источник       - Объект, из которого осуществляется загрузка правил обмена;
//  ТипИсточника   - Строка, указывающая тип источника: "XMLФайл", "ЧтениеXML", "Строка"
// 
Процедура ЗагрузитьПравилаОбмена(Источник="", ТипИсточника="XMLФайл") Экспорт

	Если Менеджеры = Неопределено Тогда
		ИнициализацияМенеджеров();
	КонецЕсли; 
	
	Если одСообщения = Неопределено Тогда
		ИнициализацияСообщений();
	КонецЕсли; 

	
	ЕстьГлобальныйОбработчикПередВыгрузкойОбъекта    = Ложь;
	ЕстьГлобальныйОбработчикПослеВыгрузкиОбъекта     = Ложь;
	
	ЕстьГлобальныйОбработчикПередКонвертациейОбъекта = Ложь;

	ЕстьГлобальныйОбработчикПередЗагрузкойОбъекта    = Ложь;
	ЕстьГлобальныйОбработчикПослеЗагрузкиОбъекта     = Ложь;
	

	
	мТаблицаПравилКонвертацииСвойств = Новый ТаблицаЗначений;
	ИнициализацияТаблицыПравилКонвертацииСвойств(мТаблицаПравилКонвертацииСвойств);


	// Возможно выбраны встроенные правила обмена (один из макетов)
	
	ИмяВременногоФайлаПравилОбмена = "";
    Если ПустаяСтрока(Источник) Тогда
		Источник = ИмяФайлаПравилОбмена;
		Если мСписокМакетовПравилОбмена.НайтиПоЗначению(Источник) <> Неопределено Тогда
			Для каждого Макет Из ЭтотОбъект.Метаданные().Макеты Цикл
				Если Макет.Синоним = Источник Тогда
					Источник = Макет.Имя;
					Прервать;
				КонецЕсли; 
			КонецЦикла; 
			МакетПравилОбмена              = ПолучитьМакет(Источник);
			УникальныйИдентификатор        = Новый УникальныйИдентификатор();
			ИмяВременногоФайлаПравилОбмена = КаталогВременныхФайлов() + УникальныйИдентификатор + ".xml";
			МакетПравилОбмена.Записать(ИмяВременногоФайлаПравилОбмена);
			Источник = ИмяВременногоФайлаПравилОбмена;
		КонецЕсли;
	КонецЕсли;

	
	Если ТипИсточника="XMLФайл" Тогда
		Файл = Новый Файл(Источник);
		Если Не Файл.Существует() Тогда
			ЗаписатьВПротоколВыполнения(3);
			Возврат; 
		КонецЕсли; 
		ПравилаОбмена = Новый ЧтениеXML();
		ПравилаОбмена.ОткрытьФайл(Источник);
		ПравилаОбмена.Прочитать();
	ИначеЕсли ТипИсточника="Строка" Тогда
		ПравилаОбмена = Новый ЧтениеXML();
		ПравилаОбмена.УстановитьСтроку(Источник);
		ПравилаОбмена.Прочитать();
	ИначеЕсли ТипИсточника="ЧтениеXML" Тогда
		ПравилаОбмена = Источник;
	КонецЕсли; 
	

	Если Не ((ПравилаОбмена.ЛокальноеИмя = "ПравилаОбмена") И (ПравилаОбмена.ТипУзла = одТипУзлаXML_НачалоЭлемента)) Тогда
		ЗаписатьВПротоколВыполнения(6);
		Возврат;
	КонецЕсли;


	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.Отступ = Истина;
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПравилаОбмена");
	

	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		ОбработкаПрерыванияПользователя();

		
		// Реквизиты конвертации
		
		Если      ИмяУзла = "ВерсияФормата" Тогда
			Значение = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			Конвертация.Вставить("ВерсияФормата", Значение);
			одЗаписатьЭлемент(ЗаписьXML, ИмяУзла, Значение);
		ИначеЕсли ИмяУзла = "Ид" Тогда
			Значение = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			Конвертация.Вставить("Ид",                   Значение);
			одЗаписатьЭлемент(ЗаписьXML, ИмяУзла, Значение);
		ИначеЕсли ИмяУзла = "Наименование" Тогда
			Значение = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			Конвертация.Вставить("Наименование",         Значение);
			одЗаписатьЭлемент(ЗаписьXML, ИмяУзла, Значение);
		ИначеЕсли ИмяУзла = "ДатаВремяСоздания" Тогда
			Значение = одЗначениеЭлемента(ПравилаОбмена, одТипДата);
			Конвертация.Вставить("ДатаВремяСоздания",    Значение);
			одЗаписатьЭлемент(ЗаписьXML, ИмяУзла, Значение);
			ВерсияПравилОбмена = Конвертация.ДатаВремяСоздания;
		ИначеЕсли ИмяУзла = "Источник" Тогда
			Значение = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			Конвертация.Вставить("Источник",             Значение);
			одЗаписатьЭлемент(ЗаписьXML, ИмяУзла, Значение);
		ИначеЕсли ИмяУзла = "Приемник" Тогда
			ВерсияПлатформыПриемника = ПравилаОбмена.ПолучитьАтрибут ("ВерсияПлатформы");
			
			Значение = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			Конвертация.Вставить("Приемник",             Значение);
			одЗаписатьЭлемент(ЗаписьXML, ИмяУзла, Значение);
			
		//ИначеЕсли ИмяУзла = "Ответственный" Тогда
		//	одПропустить(ПравилаОбмена);
		
		ИначеЕсли ИмяУзла = "Комментарий" Тогда
			одПропустить(ПравилаОбмена);

		ИначеЕсли ИмяУзла = "Параметры" Тогда
			ЗагрузитьПараметры(ПравилаОбмена, ЗаписьXML)

		// События конвертации
		
		ИначеЕсли ИмяУзла = "" Тогда
		
		ИначеЕсли ИмяУзла = "ПередВыгрузкойДанных" Тогда
			Конвертация.Вставить("ПередВыгрузкойДанных", одЗначениеЭлемента(ПравилаОбмена, одТипСтрока));
			
		ИначеЕсли ИмяУзла = "ПослеВыгрузкиДанных" Тогда
			Конвертация.Вставить("ПослеВыгрузкиДанных",  одЗначениеЭлемента(ПравилаОбмена, одТипСтрока));

		ИначеЕсли ИмяУзла = "ПередВыгрузкойОбъекта" Тогда
			Конвертация.Вставить("ПередВыгрузкойОбъекта", одЗначениеЭлемента(ПравилаОбмена, одТипСтрока));
			ЕстьГлобальныйОбработчикПередВыгрузкойОбъекта = Не ПустаяСтрока(Конвертация.ПередВыгрузкойОбъекта);

		ИначеЕсли ИмяУзла = "ПослеВыгрузкиОбъекта" Тогда
			Конвертация.Вставить("ПослеВыгрузкиОбъекта", одЗначениеЭлемента(ПравилаОбмена, одТипСтрока));
			ЕстьГлобальныйОбработчикПослеВыгрузкиОбъекта = Не ПустаяСтрока(Конвертация.ПослеВыгрузкиОбъекта);

		ИначеЕсли ИмяУзла = "ПередЗагрузкойОбъекта" Тогда
			Конвертация.Вставить("ПередЗагрузкойОбъекта", одЗначениеЭлемента(ПравилаОбмена, одТипСтрока));
			ЕстьГлобальныйОбработчикПередЗагрузкойОбъекта = Не ПустаяСтрока(Конвертация.ПередЗагрузкойОбъекта);
			одЗаписатьЭлемент(ЗаписьXML, ИмяУзла, Конвертация.ПередЗагрузкойОбъекта);

		ИначеЕсли ИмяУзла = "ПослеЗагрузкиОбъекта" Тогда
			Конвертация.Вставить("ПослеЗагрузкиОбъекта", одЗначениеЭлемента(ПравилаОбмена, одТипСтрока));
			ЕстьГлобальныйОбработчикПослеЗагрузкиОбъекта = Не ПустаяСтрока(Конвертация.ПослеЗагрузкиОбъекта);
			одЗаписатьЭлемент(ЗаписьXML, ИмяУзла, Конвертация.ПослеЗагрузкиОбъекта);

		ИначеЕсли ИмяУзла = "ПередКонвертациейОбъекта" Тогда
			Конвертация.Вставить("ПередКонвертациейОбъекта", одЗначениеЭлемента(ПравилаОбмена, одТипСтрока));
			ЕстьГлобальныйОбработчикПередКонвертациейОбъекта = Не ПустаяСтрока(Конвертация.ПередКонвертациейОбъекта);
			
		ИначеЕсли ИмяУзла = "ПередЗагрузкойДанных" Тогда
			Конвертация.ПередЗагрузкойДанных = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			одЗаписатьЭлемент(ЗаписьXML, ИмяУзла, Конвертация.ПередЗагрузкойДанных);
			
		ИначеЕсли ИмяУзла = "ПослеЗагрузкиДанных" Тогда
            Конвертация.ПослеЗагрузкиДанных = одЗначениеЭлемента(ПравилаОбмена, одТипСтрока);
			одЗаписатьЭлемент(ЗаписьXML, ИмяУзла, Конвертация.ПослеЗагрузкиДанных);
			
			
		// Правила
		
		ИначеЕсли ИмяУзла = "ПравилаВыгрузкиДанных" Тогда
			Если РежимОбмена = "Загрузка" Тогда
				одПропустить(ПравилаОбмена);
			Иначе
				ЗагрузитьПравилаВыгрузки(ПравилаОбмена);
			КонецЕсли; 
			
		ИначеЕсли ИмяУзла = "ПравилаКонвертацииОбъектов" Тогда
			ЗагрузитьПравилаКонвертации(ПравилаОбмена, ЗаписьXML);
			
		ИначеЕсли ИмяУзла = "ПравилаОчисткиДанных" Тогда
			ЗагрузитьПравилаОчистки(ПравилаОбмена, ЗаписьXML)

			
		// Алгоритмы / Запросы / Обработки
		
		ИначеЕсли ИмяУзла = "Алгоритмы" Тогда
			ЗагрузитьАлгоритмы(ПравилаОбмена, ЗаписьXML);
			
		ИначеЕсли ИмяУзла = "Запросы" Тогда
			ЗагрузитьЗапросы(ПравилаОбмена, ЗаписьXML);

		ИначеЕсли ИмяУзла = "Обработки" Тогда
			ЗагрузитьОбработки(ПравилаОбмена, ЗаписьXML);
			
		// Выход
		ИначеЕсли (ИмяУзла = "ПравилаОбмена") И (ТипУзла = одТипУзлаXML_КонецЭлемента) Тогда
		    Если РежимОбмена <> "Загрузка" Тогда
				ПравилаОбмена.Закрыть();
			КонецЕсли;
			Прервать;

			
		// Ошибка формата
		Иначе
			ЗаписатьВПротоколВыполнения(7);
			Возврат;
		КонецЕсли;
	КонецЦикла;


	ЗаписьXML.ЗаписатьКонецЭлемента();
	мXMLПравила = ЗаписьXML.Закрыть();


	// Удаляем временный файл правил
	Если Не ПустаяСтрока(ИмяВременногоФайлаПравилОбмена) Тогда
		Попытка
			УдалитьФайлы(ИмяВременногоФайлаПравилОбмена);
		Исключение КонецПопытки;
	КонецЕсли;

КонецПроцедуры // ЗагрузитьПравилаОбмена()

// Выполяет загрузку данных в соответствии с установленными режимами (правилами обмена)
//
// Параметры:
//  Нет.
//
Функция ВыполнитьЗагрузку(УРБД=Ложь) Экспорт
	Результат=Новый Структура("Результат,Описание",Ложь,"");	

	ЗаписатьВПротоколВыполнения("Начало загрузки:   " + ТекущаяДата()+". Файл: "+ИмяФайлаОбмена, , Ложь);
	
    ИспользоватьТранзакции 		= Не ФлагРежимОтладки;
	
	ЕстьОшибкиЗагрузки			= Ложь;
	
	мСчетчикЗагруженныхОбъектов = 0;
	ФлагОшибки                  = Ложь;
	ЗагруженныеОбъекты          = Новый Соответствие;


	Если Менеджеры = Неопределено Тогда
		ИнициализацияМенеджеров();
	КонецЕсли; 
	
	Если одСообщения = Неопределено Тогда
		ИнициализацияСообщений();
	КонецЕсли; 
	
	ОткрытьФайлЗагрузки();
	
	Если ФлагОшибки Тогда 
		Результат.Вставить("Описание","Сбой при инициализации !");
		Возврат Результат;
	КонецЕсли;
	
	Если УРБД Тогда
		ЕстьОшибкиЗагрузки=Истина;
		
		НомерСообщения	=Неопределено;
		КодИБОтправителя=Неопределено;
		
		Если ТипЗнч(Параметры)=Тип("Структура") Тогда
			Попытка			
				НомерСообщения	=Число(Параметры["НомерСообщения"]);
				КодИБОтправителя=Параметры["КодИБОтправителя"];			
			Исключение
				Ошибки="Неверная структура параметров сообщения ! ";
				ЗаписатьВЛог("Загрузка77УРБД",Ошибки,"Ошибка");							
			КонецПопытки;			
		КонецЕсли; 
		
		Если НомерСообщения=Неопределено ИЛИ КодИБОтправителя=Неопределено Тогда
			Ошибки="Ошибка определения параметров сообщения ! ";
			ЗаписатьВЛог("Загрузка77УРБД",Ошибки,"Ошибка");
		Иначе
			Узел=ПланыОбмена.ОбменС77.НайтиПоКоду(КодИБОтправителя);
			Если Узел.Пустая() Тогда
				Ошибки="Не найден узел обмена с кодом: """+КодИБОтправителя+""" ! ";
				ЗаписатьВЛог("Загрузка77УРБД",Ошибки,"Ошибка");							
			Иначе
				Если Узел.НомерПринятого>=НомерСообщения Тогда
					Ошибки="Сообщение №: "+НомерСообщения+" уже принималось от узла: "+КодИБОтправителя+""" ! ";
					ЗаписатьВЛог("Загрузка77УРБД",Ошибки,"Ошибка");
				Иначе
					ЕстьОшибкиЗагрузки=Ложь;				
				КонецЕсли;
			КонецЕсли;					
		КонецЕсли; 
		Если ЕстьОшибкиЗагрузки Тогда
			ФайлОбмена.Закрыть();		
			
			Результат.Вставить("Описание",Ошибки);		
			
			Возврат Результат;
		КонецЕсли;	
		
		Результат.Вставить("НомерСообщения",НомерСообщения);
	КонецЕсли; 
	
	// Обработчик ПередЗагрузкойДанных
	Отказ = Ложь;
	Попытка
		Выполнить(Конвертация.ПередЗагрузкойДанных);
	Исключение
		СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
		ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
		ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
		ЗП.Обработчик             = "ПередЗагрузкойДанных (конвертация)";
		ЗП.ОписаниеОшибки         = ОписаниеОшибки;
		ЗП.ПозицияМодуля          = СтрокаМодуля;
		ЗП.КодСообщения           = 22;
		ЗаписатьВПротоколВыполнения(22, ЗП);
		Отказ = Истина;
	КонецПопытки; 
	Если Отказ Тогда // Отказ от загрузки данных
		Результат.Вставить("Описание",ОписаниеОшибки);		
		
		Возврат Результат;
	КонецЕсли; 



	// Очистка информационной базы по правилам
	
	ОбработатьПравилаОчистки(ТаблицаПравилОчистки.Строки);
	

	
	Если ИспользоватьТранзакции Тогда
		НачатьТранзакцию();
	КонецЕсли; 
	

	Пока ФайлОбмена.Прочитать() Цикл
		
		ИмяУзла = ФайлОбмена.ЛокальноеИмя;
		ТипУзла = ФайлОбмена.ТипУзла;
		
		ОбработкаПрерыванияПользователя();
		
		
		Если ИмяУзла = "Объект" Тогда
			
			ПрочитатьОбъект();
			
			мСчетчикЗагруженныхОбъектов = 1 + мСчетчикЗагруженныхОбъектов;
			
			Если мСчетчикЗагруженныхОбъектов % 10 = 0 Тогда
				Состояние("Обработано объектов:  " + мСчетчикЗагруженныхОбъектов);
				Если мСчетчикЗагруженныхОбъектов % КоличествоОбъектовНаТранзакцию = 0 Тогда
					Если ЗапоминатьЗагруженныеОбъекты Тогда
						Если ЗагруженныеОбъекты.Количество() > ЧислоХранимыхЗагруженныхОбъектов Тогда
							ЗагруженныеОбъекты.Очистить();
						КонецЕсли;
					КонецЕсли;
					Если ИспользоватьТранзакции Тогда
						ЗафиксироватьТранзакцию();
						НачатьТранзакцию();
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяУзла = "Алгоритм" Тогда
			
			Если ФлагРежимОтладки Тогда
				ТекстАлгоритма = одЗначениеЭлемента(ФайлОбмена, одТипСтрока);
				Попытка
					Выполнить(ТекстАлгоритма);
				Исключение
					СтрокаМодуля    = ОтделитьРазделителем(ОписаниеОшибки(), "{");
					ОписаниеОшибки  = ОтделитьРазделителем(СтрокаМодуля, "}: ");
					ЗП = ПолучитьСтруктуруЗаписиПротокола();
					ЗП.ОписаниеОшибки = ОписаниеОшибки;
					ЗП.Обработчик     = "АлгоритмФайлаОбмена";
					ЗП.КодСообщения   = 39;
					ЗаписатьВПротоколВыполнения(39, ЗП, Истина);
				КонецПопытки; 
			Иначе
				Выполнить(одЗначениеЭлемента(ФайлОбмена, одТипСтрока));
			КонецЕсли;
			
		ИначеЕсли ИмяУзла = "ПравилаОбмена" Тогда

			Если ТаблицаПравилКонвертации.Количество() = 0 Тогда
				ЗагрузитьПравилаОбмена(ФайлОбмена, "ЧтениеXML");
			Иначе
				одПропустить(ФайлОбмена);
			КонецЕсли; 
			
		ИначеЕсли (ИмяУзла = "ФайлОбмена") И (ТипУзла = одТипУзлаXML_КонецЭлемента) Тогда
		Иначе
			ЗаписатьВПротоколВыполнения(9);
		КонецЕсли; 
		
	КонецЦикла;


	Если ИспользоватьТранзакции Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;

	
	ФайлОбмена.Закрыть();
	
	
	// Обработчик ПослеЗагрузкиДанных
	
	Попытка
		Выполнить(Конвертация.ПослеЗагрузкиДанных);
	Исключение
		СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
		ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
		ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
		ЗП.Обработчик             = "ПослеЗагрузкиДанных (конвертация)";
		ЗП.ОписаниеОшибки         = ОписаниеОшибки;
		ЗП.ПозицияМодуля          = СтрокаМодуля;
		ЗП.КодСообщения           = 23;
		ЗаписатьВПротоколВыполнения(23, ЗП);
	КонецПопытки;

	ЗаписатьВПротоколВыполнения("Окончание загрузки: " + ТекущаяДата(), , Ложь);
	ЗаписатьВПротоколВыполнения("Загружено объектов: " + мСчетчикЗагруженныхОбъектов, , Ложь);
    
	Сообщить("Загружен файл: "+ИмяФайлаОбмена,СтатусСообщения.Информация);
	
	Результат.Вставить("Результат",Истина);
	
	Возврат Результат;
КонецФункции// ВыполнитьЗагрузку()

// Выполняет загрузку всех файлов из указанного каталога
Процедура ПакетнаяЗагрузка() Экспорт
	КаталогЗагрузки=КаталогОбмена+"80\in\";
	КаталогЗагрузки=КаталогОбмена;
	
	ЗаписатьВЛог("Загрузка77","Начало загрузки: "+КаталогЗагрузки,"Инфо");
	
	Каталог=Новый Файл(КаталогЗагрузки);
	Если НЕ Каталог.Существует() Тогда
		Сообщить("Не найден каталог загрузки: """+КаталогЗагрузки+""" !",СтатусСообщения.Важное);	
		Возврат;
	КонецЕсли; 
	
	ИмяКаталогаОтработанныхфайлов=СокрЛП(КаталогЗагрузки)+"Обработано/";
	Каталог=Новый Файл(ИмяКаталогаОтработанныхфайлов);		
	Если НЕ Каталог.Существует() Тогда			
		СоздатьКаталог(ИмяКаталогаОтработанныхфайлов);	
	КонецЕсли;
	
	ФайлыЗагрузки=НайтиФайлы(КаталогЗагрузки,"*.xml");
	Для Каждого ФайлЗагрузки Из ФайлыЗагрузки Цикл
		ИмяФайлаОбмена=ФайлЗагрузки.ПолноеИмя;		
		
		//Сообщить(ИмяФайлаОбмена);
		ВыполнитьЗагрузку();
		
		Файл=Новый Файл(ИмяФайлаОбмена);
		ПереместитьФайл(Файл.ПолноеИмя,ИмяКаталогаОтработанныхфайлов+Файл.Имя);		
	КонецЦикла;		
	
	//ЗаписатьВЛог(ИмяЛога,Сообщение,ТипСообщения,ВыводитьСообщения=Ложь) Экспорт
	ЗаписатьВЛог("Загрузка77","Окончание загрузки: "+КаталогЗагрузки,"Инфо");
	
	//ВыгрузитьПодтверждения(КаталогЗагрузки);
КонецПроцедуры

Процедура ЗагрузкаУРБД() Экспорт
	КаталогЗагрузки=КаталогОбмена+"80\in\";
	
	ЗаписатьВЛог("Загрузка77УРБД","Начало загрузки: "+КаталогЗагрузки,"Инфо");
	
	Каталог=Новый Файл(КаталогЗагрузки);
	Если НЕ Каталог.Существует() Тогда
		Сообщить("Не найден каталог загрузки: """+КаталогЗагрузки+""" !",СтатусСообщения.Важное);	
		Возврат;
	КонецЕсли; 
	
	ИмяКаталогаОтработанныхфайлов=СокрЛП(КаталогЗагрузки)+"Обработано/";
	Каталог=Новый Файл(ИмяКаталогаОтработанныхфайлов);		
	Если НЕ Каталог.Существует() Тогда			
		СоздатьКаталог(ИмяКаталогаОтработанныхфайлов);	
	КонецЕсли;	
	
	ТФ=Новый ТаблицаЗначений;
	ТФ.Колонки.Добавить("ИмяФайла");
	
	ФайлыЗагрузки=НайтиФайлы(КаталогЗагрузки,"*.xml");
	Для Каждого ФайлЗагрузки Из ФайлыЗагрузки Цикл
		СтрокаТФ=ТФ.Добавить();
		СтрокаТФ.ИмяФайла=ФайлЗагрузки.ПолноеИмя		
	КонецЦикла;		
	
	ТФ.Сортировать("ИмяФайла УБЫВ");
	Если ТФ.Количество()=0 Тогда
		ЕстьОшибкиЗагрузки=Истина;
		Ошибки="Нет файлов для загрузки !";
	Иначе
		ИмяФайлаОбмена=ТФ[0].ИмяФайла;		
		ЗаписатьВЛог("Загрузка77УРБД","Загрузка файла: """+ИмяФайлаОбмена+""".","Инфо");		
		
		ВыполнитьЗагрузку(Истина);			
	КонецЕсли;
	
	Для Каждого СтрокаТФ Из ТФ Цикл
		Файл=Новый Файл(СтрокаТФ.ИмяФайла);
		ПереместитьФайл(Файл.ПолноеИмя,ИмяКаталогаОтработанныхфайлов+Файл.Имя);	
	КонецЦикла; 
	
	//ЗаписатьВЛог(ИмяЛога,Сообщение,ТипСообщения,ВыводитьСообщения=Ложь) Экспорт
	ЗаписатьВЛог("Загрузка77УРБД","Окончание загрузки: "+КаталогЗагрузки,"Инфо");	
КонецПроцедуры
 
// Выполяет выгрузку данных в соответствии с установленными режимами (правилами обмена)
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьВыгрузку(ТО=Неопределено,ДП=Неопределено) Экспорт
	Если ТО<>Неопределено Тогда
		ТаблицаВыгружаемыхОбъектов=ТО;	
	КонецЕсли; 

	ЗаписатьВПротоколВыполнения("Начало выгрузки:   " + ТекущаяДата(), , Ложь);

	Если Менеджеры = Неопределено Тогда
		ИнициализацияМенеджеров();
	КонецЕсли; 
	
	Если одСообщения = Неопределено Тогда
		ИнициализацияСообщений();
	КонецЕсли; 
	

	мXMLДокумент                = DOM_НовыйXMLДокумент();
	мСчетчикВыгруженныхОбъектов = 0;
	ФлагОшибки                  = Ложь;

	
	ДопПараметрыОбмена=ДП;
	
    // Загрузка правил обмена	
	Если Конвертация.Количество() = 9 Тогда
		ЗагрузитьПравилаОбмена();
		Если ФлагОшибки Тогда Возврат КонецЕсли;
	Иначе
		Для каждого Правило Из ТаблицаПравилКонвертации Цикл
			Правило.Выгруженные.Очистить();
		КонецЦикла; 
	КонецЕсли; 

	//Присваиваем параметры установленные в диалоге
	УстановитьПараметрыИзДиалога();	
		
	// Открываем файл обмена
	
	ОткрытьФайлВыгрузки();
	Если ФлагОшибки Тогда Возврат КонецЕсли;

	
    // Включаем правила обмена в файл

	ФайлОбмена.ЗаписатьСтроку(мXMLПравила);

	
	
    // Обработчик ПередВыгрузкойДанных
	
	Отказ = Ложь;
	Попытка
		Выполнить(Конвертация.ПередВыгрузкойДанных);
	Исключение
		СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
		ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
		ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
		ЗП.Обработчик             = "ПередВыгрузкойДанных (конвертация)";
		ЗП.ОписаниеОшибки         = ОписаниеОшибки;
		ЗП.ПозицияМодуля          = СтрокаМодуля;
		ЗП.КодСообщения           = 62;
		ЗаписатьВПротоколВыполнения(62, ЗП);
		Отказ = Истина;
	КонецПопытки; 
	Если Отказ Тогда // Отказ от выгрузки данных
		Возврат;
	КонецЕсли; 
	

	ОбработатьПравилаВыгрузки(ТаблицаПравилВыгрузки.Строки);
	
	
	// Обработчик ПослеВыгрузкиДанных
	
	Попытка
		Выполнить(Конвертация.ПослеВыгрузкиДанных);
	Исключение
		СтрокаМодуля              = ОтделитьРазделителем(ОписаниеОшибки(), "{");
		ОписаниеОшибки            = ОтделитьРазделителем(СтрокаМодуля, "}: ");
		ЗП                        = ПолучитьСтруктуруЗаписиПротокола();
		ЗП.Обработчик             = "ПослеВыгрузкиДанных (конвертация)";
		ЗП.ОписаниеОшибки         = ОписаниеОшибки;
		ЗП.ПозицияМодуля          = СтрокаМодуля;
		ЗП.КодСообщения           = 63;
		ЗаписатьВПротоколВыполнения(63, ЗП);
	КонецПопытки; 
	Если Отказ Тогда // Отказ от записи файла данных
		Возврат;
	КонецЕсли; 

	
	// Закрываем файл обмена
	
	ЗакрытьФайл();

	
	Если АрхивироватьФайл Тогда
		Состояние("Выполняется архивация файла обмена...");
		Хранилище      = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ИмяФайлаОбмена), Новый СжатиеДанных(9));
		АрхивныйФайл   = Новый ЗаписьТекста;
		АрхивныйФайл.Открыть(ИмяФайлаОбмена, КодировкаТекста.UTF8);
	    АрхивныйФайл.ЗаписатьСтроку(XMLСтрока(Хранилище));
		АрхивныйФайл.Закрыть();
	КонецЕсли; 

		
	ЗаписатьВПротоколВыполнения("Окончание выгрузки: " + ТекущаяДата(), , Ложь);
	ЗаписатьВПротоколВыполнения("Выгружено объектов: " + мСчетчикВыгруженныхОбъектов, , Ложь);

	Если ЭтоИнтерактивныйРежим Тогда
		Предупреждение("Выгрузка данных завершена!");
	КонецЕсли; 

КонецПроцедуры // ВыполнитьВыгрузку()

Процедура ВыгрузитьПодтверждения(КаталогВыгрузки) Экспорт 
	Если ТаблицаЗагруженныхОбъектов.Количество()=0 Тогда Возврат КонецЕсли; 
	
	Файл=Новый Файл(КаталогВыгрузки);	
	
	ИмяКаталогаПодтверждений	=СтрЗаменить(?(Файл.ЭтоКаталог(),КаталогВыгрузки,Файл.Путь),"\80\in\","\80\Out\Check\");
	КаталогПодтверждений=Новый Файл(ИмяКаталогаПодтверждений);
	Если НЕ КаталогПодтверждений.Существует() Тогда
		СоздатьКаталог(ИмяКаталогаПодтверждений);	
	КонецЕсли;	
	ИмяФайлаПодтверждения	=ИмяКаталогаПодтверждений+"ch_"+Формат(ТекущаяДата(), "ДФ=yyyyMMdd_HHmmss")+".xml";	
	
	ВыгрузитьЗначениеВФайлXML(ТаблицаЗагруженныхОбъектов,ИмяФайлаПодтверждения);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ИНИЦИАЛИЗАЦИЯ ТАБЛИЦ ПРАВИЛ ОБМЕНА

// Инициализирует колонки таблицы правил конвертации свойств объектов
//
// Параметры:
//  Таб            - ТаблицаЗначений. инициализируемая таблица правил конвертации свойств
// 
Процедура ИнициализацияТаблицыПравилКонвертацииСвойств(Таб) Экспорт

	Колонки = Таб.Колонки;

	Колонки.Добавить("Имя");
	Колонки.Добавить("Наименование");
	Колонки.Добавить("Порядок");

	Колонки.Добавить("ЭтоГруппа", 			одОписаниеТипа("Булево"));
    Колонки.Добавить("ПравилаГруппы");

	Колонки.Добавить("ВидИсточника");
	Колонки.Добавить("ВидПриемника");

	Колонки.Добавить("ТипИсточника", одОписаниеТипа("Строка"));
	Колонки.Добавить("ТипПриемника", одОписаниеТипа("Строка"));
	
	Колонки.Добавить("Источник");
	Колонки.Добавить("Приемник");

	Колонки.Добавить("ПравилоКонвертации");

	Колонки.Добавить("ПолучитьИзВходящихДанных", одОписаниеТипа("Булево"));
	
	Колонки.Добавить("НеЗамещать", одОписаниеТипа("Булево"));
	
	Колонки.Добавить("ПередВыгрузкой");
	Колонки.Добавить("ПриВыгрузке");
	Колонки.Добавить("ПослеВыгрузки");

	Колонки.Добавить("ПередОбработкойВыгрузки");
	Колонки.Добавить("ПослеОбработкиВыгрузки");

	Колонки.Добавить("ЕстьОбработчикПередВыгрузкой",			одОписаниеТипа("Булево"));
	Колонки.Добавить("ЕстьОбработчикПриВыгрузке",				одОписаниеТипа("Булево"));
	Колонки.Добавить("ЕстьОбработчикПослеВыгрузки",				одОписаниеТипа("Булево"));
	
	Колонки.Добавить("ЕстьОбработчикПередОбработкойВыгрузки",	одОписаниеТипа("Булево"));
	Колонки.Добавить("ЕстьОбработчикПослеОбработкиВыгрузки",	одОписаниеТипа("Булево"));
	
КонецПроцедуры // ИнициализацияТаблицыПравилКонвертацииСвойств()

// Инициализирует колонки таблицы правил конвертации объектов
//
// Параметры:
//  Нет.
// 
Процедура ИнициализацияТаблицыПравилКонвертации()

	Колонки = ТаблицаПравилКонвертации.Колонки;
	
	Колонки.Добавить("Имя");
	Колонки.Добавить("Наименование");
	Колонки.Добавить("Порядок");

	Колонки.Добавить("СинхронизироватьПоИдентификатору");
	Колонки.Добавить("СпособВыгрузки");

	Колонки.Добавить("Источник");
	Колонки.Добавить("Приемник");

	Колонки.Добавить("ПередВыгрузкой");
	Колонки.Добавить("ПриВыгрузке");
	Колонки.Добавить("ПослеВыгрузки");

	Колонки.Добавить("ЕстьОбработчикПередВыгрузкой",	одОписаниеТипа("Булево"));
	Колонки.Добавить("ЕстьОбработчикПриВыгрузке",		одОписаниеТипа("Булево"));
	Колонки.Добавить("ЕстьОбработчикПослеВыгрузки",		одОписаниеТипа("Булево"));

	Колонки.Добавить("ПередЗагрузкой");
	Колонки.Добавить("ПриЗагрузке");
	Колонки.Добавить("ПослеЗагрузки");
	
	Колонки.Добавить("ЕстьОбработчикПередЗагрузкой", одОписаниеТипа("Булево"));
	Колонки.Добавить("ЕстьОбработчикПриЗагрузке",    одОписаниеТипа("Булево"));
	Колонки.Добавить("ЕстьОбработчикПослеЗагрузки",  одОписаниеТипа("Булево"));

	Колонки.Добавить("СвойстваПоиска",	одОписаниеТипа("ТаблицаЗначений"));
	Колонки.Добавить("Свойства",		одОписаниеТипа("ТаблицаЗначений"));
	
	Колонки.Добавить("Значения",		одОписаниеТипа("Соответствие"));

	Колонки.Добавить("Выгруженные",							одОписаниеТипа("Соответствие"));
	Колонки.Добавить("ВыгружатьПредставлениеИсточника",		одОписаниеТипа("Булево"));
	
	Колонки.Добавить("НеЗамещать",					одОписаниеТипа("Булево"));
	
	Колонки.Добавить("ЗапоминатьВыгруженные",       одОписаниеТипа("Булево"));
	Колонки.Добавить("ВсеОбъектыВыгружены",         одОписаниеТипа("Булево"));
	
КонецПроцедуры // ИнициализацияТаблицыПравилКонвертации()

// Инициализирует колонки таблицы правил выгрузки данных
//
// Параметры:
//  Нет
// 
Процедура ИнициализацияТаблицыПравилВыгрузки()

	Колонки = ТаблицаПравилВыгрузки.Колонки;

	Колонки.Добавить("Включить",		одОписаниеТипа("Число"));
	Колонки.Добавить("ЭтоГруппа",		одОписаниеТипа("Булево"));
	
	Колонки.Добавить("Имя");
	Колонки.Добавить("Наименование");
	Колонки.Добавить("Порядок");

	Колонки.Добавить("СпособОтбораДанных");
	Колонки.Добавить("ОбъектВыборки");
	
	//Колонки.Добавить("ОбъектВыборкиСтрокой");
	
	Колонки.Добавить("ПравилоКонвертации");

	Колонки.Добавить("ПередОбработкой");
	Колонки.Добавить("ПослеОбработки");

	Колонки.Добавить("ПередВыгрузкой");
	Колонки.Добавить("ПослеВыгрузки");
	
	// Колонки для подержки отбора с помощью построителя
	Колонки.Добавить("ИспользоватьОтбор", одОписаниеТипа("Булево"));
	Колонки.Добавить("НастройкиПостроителя");
	Колонки.Добавить("ИмяОбъектаДляЗапроса");

КонецПроцедуры // ИнициализацияТаблицыПравилВыгрузки()

// Инициализирует колонки таблицы правил очистки данных
//
// Параметры:
//  Нет.
// 
Процедура ИнициализацияТаблицыПравилОчистки()

	Колонки = ТаблицаПравилОчистки.Колонки;

	Колонки.Добавить("Включить",		одОписаниеТипа("Булево"));
	Колонки.Добавить("ЭтоГруппа",		одОписаниеТипа("Булево"));
	
	Колонки.Добавить("Имя");
	Колонки.Добавить("Наименование");
	Колонки.Добавить("Порядок",	одОписаниеТипа("Число"));

	Колонки.Добавить("СпособОтбораДанных");
	Колонки.Добавить("ОбъектВыборки");
	
	Колонки.Добавить("УдалятьЗаПериод");
	Колонки.Добавить("Непосредственно",	одОписаниеТипа("Булево"));

	Колонки.Добавить("ПередОбработкой");
	Колонки.Добавить("ПослеОбработки");
	Колонки.Добавить("ПередУдалением");

КонецПроцедуры // ИнициализацияТаблицыПравилОчистки()

// Инициализирует колонки таблицы настройки параметров
//
// Параметры:
//  Нет.
// 
Процедура ИнициализацияТаблицыНастройкиПараметров()

	Колонки = ТаблицаНастройкиПараметров.Колонки;

	Колонки.Добавить("Имя");
	Колонки.Добавить("Наименование");
	Колонки.Добавить("Значение");

КонецПроцедуры // ИнициализацияТаблицыПравилОчистки()

////////////////////////////////////////////////////////////////////////////////
// ИНИЦИАЛИЗАЦИЯ РЕКВИЗИТОВ И МОДУЛЬНЫХ ПЕРЕМЕННЫХ

// Инициализирует переменную одСообщения, содержащую соответствия кодов сообщений их описаниям
//
// Параметры:
//  Нет.
// 
Процедура ИнициализацияСообщений()

	одСообщения			= Новый Соответствие;
	
	//ТаблицаСообщений	= ПолучитьМакет("Сообщения");
	//Для Сч = 1 По ТаблицаСообщений.ВысотаТаблицы Цикл
	//	СтрСообщ = ТаблицаСообщений.ПолучитьОбласть(Сч, 2).ТекущаяОбласть.Текст;
	//	Если ПустаяСтрока(СтрСообщ) Тогда
	//		Сообщить("//одСообщения.Вставить(" + Строка(Сч) + ", """ + СтрСообщ + """);");
	//	Иначе
	//		Сообщить("одСообщения.Вставить(" + Строка(Сч) + ", """ + СтрСообщ + """);"); 
	//	КонецЕсли; 
	//	одСообщения.Вставить(Сч, СтрСообщ);
	//КонецЦикла; 

	
	//одСообщения.Вставить(1,  "");
	
	одСообщения.Вставить(2,    "Ошибка распаковки файла обмена. Файл заблокирован.");
	одСообщения.Вставить(3,    "Указанный файл правил обмена не существует!");
	
	одСообщения.Вставить(4,    "Ошибка при создании COM-объекта Msxml2.DOMDocument");
	одСообщения.Вставить(5,    "Ошибка открытия файла обмена");
	одСообщения.Вставить(6,    "Ошибка при загрузке правил обмена");
	одСообщения.Вставить(7,    "Ошибка формата правил обмена");
	одСообщения.Вставить(8,    "Не корректно указано имя файла обмена");
	одСообщения.Вставить(9,    "Ошибка формата файла обмена");
	
	//одСообщения.Вставить(10, "");
	
	одСообщения.Вставить(11,   "Ссылка на несуществующий объект метаданных в правилах обмена");
	
	//одСообщения.Вставить(12, "");
	
	одСообщения.Вставить(13, "Ошибка получения значения свойства объекта (по имени свойства источника)");
	одСообщения.Вставить(14, "Ошибка получения значения свойства объекта (по имени свойства приемника)");
	
	//одСообщения.Вставить(15, "");
	
	одСообщения.Вставить(16, "Ошибка получения значения свойства подчиненного объекта (по имени свойства источника)");
	одСообщения.Вставить(17, "Ошибка получения значения свойства подчиненного объекта (по имени свойства приемника)");
	
	//одСообщения.Вставить(18, "");

	одСообщения.Вставить(19, "Ошибка в обработчике события ПередЗагрузкойОбъекта");
	одСообщения.Вставить(20, "Ошибка в обработчике события ПриЗагрузкеОбъекта");
	одСообщения.Вставить(21, "Ошибка в обработчике события ПослеЗагрузкиОбъекта");
	
	одСообщения.Вставить(22, "Ошибка в обработчике события ПередЗагрузкойДанных (конвертация)");
	одСообщения.Вставить(23, "Ошибка в обработчике события ПослеЗагрузкиДанных (конвертация)");
	
	одСообщения.Вставить(24, "Ошибка при удалении объекта");
	одСообщения.Вставить(25, "Ошибка при записи документа");
	одСообщения.Вставить(26, "Ошибка записи объекта");
	
	//одСообщения.Вставить(26, "");
	
	одСообщения.Вставить(26, "Ошибка установки значения свойства объекта");
	
	одСообщения.Вставить(27, "Ошибка в обработчике события ПередОбработкойПравилаОчистки");
	одСообщения.Вставить(28, "Ошибка в обработчике события ПослеОбработкиПравилаОчистки");
	одСообщения.Вставить(29, "Ошибка в обработчике события ПередУдалениемОбъекта");
	//одСообщения.Вставить(30, "");
	одСообщения.Вставить(31, "Ошибка в обработчике события ПередОбработкойПравилаВыгрузки");
	одСообщения.Вставить(32, "Ошибка в обработчике события ПослеОбработкиПравилаВыгрузки");
	одСообщения.Вставить(33, "Ошибка в обработчике события ПередВыгрузкойОбъекта");
	одСообщения.Вставить(34, "Ошибка в обработчике события ПослеВыгрузкиОбъекта");
	
	//одСообщения.Вставить(35, "");
	//одСообщения.Вставить(36, "");
	//одСообщения.Вставить(37, "");
	//одСообщения.Вставить(38, "");
	//одСообщения.Вставить(39, "");
	
	одСообщения.Вставить(39, "Ошибка при выполнении алгоритма, содержащегося в файле обмена");
	
	//одСообщения.Вставить(40, "");
	
	одСообщения.Вставить(41, "Ошибка в обработчике события ПередВыгрузкойОбъекта");
	одСообщения.Вставить(42, "Ошибка в обработчике события ПриВыгрузкеОбъекта");
	одСообщения.Вставить(43, "Ошибка в обработчике события ПослеВыгрузкиОбъекта");
	
	//одСообщения.Вставить(44, "");
	
	одСообщения.Вставить(45, "Не найдено правило конвертации объектов");
	
	//одСообщения.Вставить(46, "");
	//одСообщения.Вставить(47, "");
	
	одСообщения.Вставить(48, "Ошибка в обработчике события ПередОбработкойВыгрузки группы свойств");
	одСообщения.Вставить(49, "Ошибка в обработчике события ПослеОбработкиВыгрузки группы свойств");
	одСообщения.Вставить(50, "Ошибка в обработчике события ПередВыгрузкой (объекта коллекции)");
	одСообщения.Вставить(51, "Ошибка в обработчике события ПриВыгрузке (объекта коллекции)");
	одСообщения.Вставить(52, "Ошибка в обработчике события ПослеВыгрузки (объекта коллекции)");
	
	одСообщения.Вставить(53, "Ошибка в глобальном обработчике события ПередЗагрузкойОбъекта (конвертация)");
	одСообщения.Вставить(54, "Ошибка в глобальном обработчике события ПослеЗагрузкиОбъекта (конвертация)");
	
	одСообщения.Вставить(55, "Ошибка в обработчике события ПередВыгрузкой (свойства)");
	одСообщения.Вставить(56, "Ошибка в обработчике события ПриВыгрузке (свойства)");
	одСообщения.Вставить(57, "Ошибка в обработчике события ПослеВыгрузки (свойства)");
	//одСообщения.Вставить(58, "");
	//одСообщения.Вставить(59, "");
	//одСообщения.Вставить(60, "");
	//одСообщения.Вставить(61, "");
	одСообщения.Вставить(62, "Ошибка в обработчике события ПередВыгрузкойДанных (конвертация)");
	одСообщения.Вставить(63, "Ошибка в обработчике события ПослеВыгрузкиДанных (конвертация)");
	
	одСообщения.Вставить(64, "Ошибка в глобальном обработчике события ПередКонвертациейОбъекта (конвертация)");
	одСообщения.Вставить(65, "Ошибка в глобальном обработчике события ПередВыгрузкойОбъекта (конвертация)");
	
	одСообщения.Вставить(66, "Ошибка получения коллекции подчиненных объектов из входящих данных ");
	одСообщения.Вставить(67, "Ошибка получения свойства подчиненного объекта из входящих данных ");
	одСообщения.Вставить(68, "Ошибка получения свойства объекта из входящих данных ");
	
	одСообщения.Вставить(69, "Ошибка в глобальном обработчике события ПослеВыгрузкиОбъекта (конвертация)");
	//одСообщения.Вставить(70, "");
	одСообщения.Вставить(71, "Не найдено соответствие для значения Источника");

КонецПроцедуры // ИнициализацияСообщений()

// Инициализирует переменную Менеджеры, содержащую соответствия типов объектов их свойствам
//
// Параметры:
//  Нет.
// 
Процедура ИнициализацияМенеджеров()

	Менеджеры = Новый Соответствие;

	ИмяТипа = "Справочник";
	
	Для каждого ОбъектМД Из Метаданные.Справочники Цикл
		
		Имя              = ОбъектМД.Имя;
		Менеджер         = Справочники[Имя];
		ТипСсылкиСтрокой = "СправочникСсылка." + Имя;
		СтрокаПоиска     = "ВЫБРАТЬ Ссылка ИЗ " + ИмяТипа + "." + Имя + " ГДЕ ";
		ТипСсылки        = Тип(ТипСсылкиСтрокой);
		Структура = Новый Структура("Имя,ИмяТипа,ТипСсылкиСтрокой,Менеджер,ОбъектМД,СтрокаПоиска,ПКО", Имя, ИмяТипа, ТипСсылкиСтрокой, Менеджер, ОбъектМД, СтрокаПоиска);
		Менеджеры.Вставить(ТипСсылки, Структура);
		
	КонецЦикла;

	ИмяТипа = "Документ";
	
	Для каждого ОбъектМД Из Метаданные.Документы Цикл
		
		Имя              = ОбъектМД.Имя;
		Менеджер         = Документы[Имя];
		ТипСсылкиСтрокой = "ДокументСсылка." + Имя;
		СтрокаПоиска     = "ВЫБРАТЬ Ссылка ИЗ " + ИмяТипа + "." + Имя + " ГДЕ ";
		ТипСсылки        = Тип(ТипСсылкиСтрокой);
		Структура = Новый Структура("Имя,ИмяТипа,ТипСсылкиСтрокой,Менеджер,ОбъектМД,СтрокаПоиска,ПКО", Имя, ИмяТипа, ТипСсылкиСтрокой, Менеджер, ОбъектМД, СтрокаПоиска);
		Менеджеры.Вставить(ТипСсылки, Структура);
		
	КонецЦикла;

	ИмяТипа = "Перечисление";
	
	Для каждого ОбъектМД Из Метаданные.Перечисления Цикл
		
		Имя              = ОбъектМД.Имя;
		Менеджер         = Перечисления[Имя];
		ТипСсылкиСтрокой = "ПеречислениеСсылка." + Имя;
		ТипСсылки        = Тип(ТипСсылкиСтрокой);
		Структура = Новый Структура("Имя,ИмяТипа,ТипСсылкиСтрокой,Менеджер,ОбъектМД,ПКО", Имя, ИмяТипа, ТипСсылкиСтрокой, Менеджер, ОбъектМД);
		Менеджеры.Вставить(ТипСсылки, Структура);
		
	КонецЦикла;
	
	ИмяТипа = "ПланВидовХарактеристик";
	
	Для каждого ОбъектМД Из Метаданные.ПланыВидовХарактеристик Цикл
		
		Имя               = ОбъектМД.Имя;
		Менеджер          = ПланыВидовХарактеристик[Имя];
		ТипСсылкиСтрокой  = "ПланВидовХарактеристикСсылка." + Имя;
		СтрокаПоиска      = "ВЫБРАТЬ Ссылка ИЗ " + ИмяТипа + "." + Имя + " ГДЕ ";
		ТипСсылки         = Тип(ТипСсылкиСтрокой);
		Структура = Новый Структура("Имя,ИмяТипа,ТипСсылкиСтрокой,Менеджер,ОбъектМД,СтрокаПоиска,ПКО", Имя, ИмяТипа, ТипСсылкиСтрокой, Менеджер, ОбъектМД, СтрокаПоиска);
		Менеджеры.Вставить(ТипСсылки, Структура);
		
	КонецЦикла;
	
	ИмяТипа = "ПланСчетов";
	
	Для каждого ОбъектМД Из Метаданные.ПланыСчетов Цикл
		
		Имя              = ОбъектМД.Имя;
		Менеджер         = ПланыСчетов[Имя];
		ТипСсылкиСтрокой = "ПланСчетовСсылка." + Имя;
		СтрокаПоиска     = "ВЫБРАТЬ Ссылка ИЗ " + ИмяТипа + "." + Имя + " ГДЕ ";
		ТипСсылки        = Тип(ТипСсылкиСтрокой);
		Структура = Новый Структура("Имя,ИмяТипа,ТипСсылкиСтрокой,Менеджер,ОбъектМД,СтрокаПоиска,ПКО", Имя, ИмяТипа, ТипСсылкиСтрокой, Менеджер, ОбъектМД, СтрокаПоиска);
		Менеджеры.Вставить(ТипСсылки, Структура);
		
	КонецЦикла;
	
	ИмяТипа = "ПланВидовРасчета";
	
	Для каждого ОбъектМД Из Метаданные.ПланыВидовРасчета Цикл
		
		Имя              = ОбъектМД.Имя;
		Менеджер         = ПланыВидовРасчета[Имя];
		ТипСсылкиСтрокой = "ПланВидовРасчетаСсылка." + Имя;
		СтрокаПоиска     = "ВЫБРАТЬ Ссылка ИЗ " + ИмяТипа + "." + Имя + " ГДЕ ";
		ТипСсылки        = Тип(ТипСсылкиСтрокой);
		Структура = Новый Структура("Имя,ИмяТипа,ТипСсылкиСтрокой,Менеджер,ОбъектМД,СтрокаПоиска,ПКО", Имя, ИмяТипа, ТипСсылкиСтрокой, Менеджер, ОбъектМД, СтрокаПоиска);
		Менеджеры.Вставить(ТипСсылки, Структура);
		
	КонецЦикла;

	ИмяТипа = "РегистрСведений";
	
	Для каждого ОбъектМД Из Метаданные.РегистрыСведений Цикл
		
		Имя					= ОбъектМД.Имя;
		Менеджер			= РегистрыСведений[Имя];
		ТипСсылкиСтрокой	= "РегистрСведенийЗапись." + Имя;
		ТипСсылки			= Тип(ТипСсылкиСтрокой);
		Структура = Новый Структура("Имя,ИмяТипа,ТипСсылкиСтрокой,Менеджер,ОбъектМД,ПКО", Имя, ИмяТипа, ТипСсылкиСтрокой, Менеджер, ОбъектМД);
		Менеджеры.Вставить(ТипСсылки, Структура);

		ТипСсылкиСтрокой	= "РегистрСведенийВыборка." + Имя;
		ТипСсылки			= Тип(ТипСсылкиСтрокой);
		Структура = Новый Структура("Имя,ИмяТипа,ТипСсылкиСтрокой,Менеджер,ОбъектМД,ПКО", Имя, ИмяТипа, ТипСсылкиСтрокой, Менеджер, ОбъектМД);
		Менеджеры.Вставить(ТипСсылки, Структура);
		
	КонецЦикла;

	ИмяТипа = "РегистрБухгалтерии";
	
	Для каждого ОбъектМД Из Метаданные.РегистрыБухгалтерии Цикл
		
		Имя					= ОбъектМД.Имя;
		Менеджер			= РегистрыБухгалтерии[Имя];
		ТипСсылкиСтрокой	= "РегистрБухгалтерииЗапись." + Имя;
		ТипСсылки			= Тип(ТипСсылкиСтрокой);
		Структура = Новый Структура("Имя,ИмяТипа,ТипСсылкиСтрокой,Менеджер,ОбъектМД,ПКО", Имя, ИмяТипа, ТипСсылкиСтрокой, Менеджер, ОбъектМД);
		Менеджеры.Вставить(ТипСсылки, Структура);

		ТипСсылкиСтрокой	= "РегистрБухгалтерииВыборка." + Имя;
		ТипСсылки			= Тип(ТипСсылкиСтрокой);
		Структура = Новый Структура("Имя,ИмяТипа,ТипСсылкиСтрокой,Менеджер,ОбъектМД,ПКО", Имя, ИмяТипа, ТипСсылкиСтрокой, Менеджер, ОбъектМД);
		Менеджеры.Вставить(ТипСсылки, Структура);
		
	КонецЦикла;
	
	ИмяТипа = "РегистрНакопления";
	
	Для каждого ОбъектМД Из Метаданные.РегистрыНакопления Цикл
		
		Имя					= ОбъектМД.Имя;
		Менеджер			= РегистрыНакопления[Имя];
		ТипСсылкиСтрокой	= "РегистрНакопленияЗапись." + Имя;
		ТипСсылки			= Тип(ТипСсылкиСтрокой);
		Структура = Новый Структура("Имя,ИмяТипа,ТипСсылкиСтрокой,Менеджер,ОбъектМД,ПКО", Имя, ИмяТипа, ТипСсылкиСтрокой, Менеджер, ОбъектМД);
		Менеджеры.Вставить(ТипСсылки, Структура);

		ТипСсылкиСтрокой	= "РегистрНакопленияВыборка." + Имя;
		ТипСсылки			= Тип(ТипСсылкиСтрокой);
		Структура = Новый Структура("Имя,ИмяТипа,ТипСсылкиСтрокой,Менеджер,ОбъектМД,ПКО", Имя, ИмяТипа, ТипСсылкиСтрокой, Менеджер, ОбъектМД);
		Менеджеры.Вставить(ТипСсылки, Структура);
		
	КонецЦикла;
	
	ИмяТипа = "РегистрРасчета";
	
	Для каждого ОбъектМД Из Метаданные.РегистрыРасчета Цикл
		
		Имя					= ОбъектМД.Имя;
		Менеджер			= РегистрыРасчета[Имя];
		ТипСсылкиСтрокой	= "РегистрРасчетаЗапись." + Имя;
		ТипСсылки			= Тип(ТипСсылкиСтрокой);
		Структура = Новый Структура("Имя,ИмяТипа,ТипСсылкиСтрокой,Менеджер,ОбъектМД,ПКО", Имя, ИмяТипа, ТипСсылкиСтрокой, Менеджер, ОбъектМД);
		Менеджеры.Вставить(ТипСсылки, Структура);

		ТипСсылкиСтрокой	= "РегистрРасчетаВыборка." + Имя;
		ТипСсылки			= Тип(ТипСсылкиСтрокой);
		Структура = Новый Структура("Имя,ИмяТипа,ТипСсылкиСтрокой,Менеджер,ОбъектМД,ПКО", Имя, ИмяТипа, ТипСсылкиСтрокой, Менеджер, ОбъектМД);
		Менеджеры.Вставить(ТипСсылки, Структура);
		
	КонецЦикла;
	
	// Константы
	ИмяТипа             = "Константы";
	ОбъектМД            = Метаданные.Константы;
	Имя					= "Константы";
	Менеджер			= Константы;
	ТипСсылкиСтрокой	= "КонстантыНабор";
	ТипСсылки			= Тип(ТипСсылкиСтрокой);
	Структура = Новый Структура("Имя,ИмяТипа,ТипСсылкиСтрокой,Менеджер,ОбъектМД,ПКО", Имя, ИмяТипа, ТипСсылкиСтрокой, Менеджер, ОбъектМД);
	Менеджеры.Вставить(ТипСсылки, Структура);
	
КонецПроцедуры // ИнициализацияМенеджеров()

// Инициализирует реквизиты обработки и модульные переменные
//
// Параметры:
//  Нет.
// 
Процедура ИнициализацияРеквизитовИМодульныхПеременных()

	ИспользоватьТранзакции           = Истина;
	КоличествоОбъектовНаТранзакцию   = 100;

	ЗапоминатьЗагруженныеОбъекты     = Истина;
	ЧислоХранимыхЗагруженныхОбъектов = 5000;
	
	ПараметрыИнициализированы        = Ложь;
	
	Менеджеры    = Неопределено;
	одСообщения  = Неопределено;
	
	ФлагОшибки   = Ложь;
	
	Конвертация  = Новый Структура("ПередВыгрузкойДанных, ПослеВыгрузкиДанных, ПередВыгрузкойОбъекта, ПослеВыгрузкиОбъекта, ПередКонвертациейОбъекта, ПередЗагрузкойОбъекта, ПослеЗагрузкиОбъекта, ПередЗагрузкойДанных, ПослеЗагрузкиДанных");
	
	Правила      = Новый Структура;
	Алгоритмы    = Новый Структура;
	ДопОбработки = Новый Структура;
	Запросы      = Новый Структура;

	Параметры    = Новый Структура;
	
	ПараметрыДопОбработок = Новый Структура;

	//ОбработкиНастройкиВыгрузки = Новый Структура;
	//ОбработкиНастройкиЗагрузки = Новый Структура;

	
	мXMLПравила  = Неопределено;
	мXMLДокумент = DOM_НовыйXMLДокумент();

	
	// Типы

	одТипСтрока                = Тип("Строка");
	одТипБулево                = Тип("Булево");
	одТипЧисло                 = Тип("Число");
	одТипДата                  = Тип("Дата");
	одТипХранилищеЗначения     = Тип("ХранилищеЗначения");
	одТипДвоичныеДанные        = Тип("ДвоичныеДанные");
	одТипВидДвиженияНакопления = Тип("ВидДвиженияНакопления");


	// Типы узлов xml
	
	одТипУзлаXML_КонецЭлемента  = ТипУзлаXML.КонецЭлемента;
	одТипУзлаXML_НачалоЭлемента = ТипУзлаXML.НачалоЭлемента;
	одТипУзлаXML_Текст          = ТипУзлаXML.Текст;


	мСписокМакетовПравилОбмена  = Новый СписокЗначений;

	Для Каждого Макет Из ЭтотОбъект.Метаданные().Макеты Цикл
		мСписокМакетовПравилОбмена.Добавить(Макет.Синоним);
	КонецЦикла;	
	
	Если ФлагОшибки Тогда Возврат КонецЕсли;
КонецПроцедуры // ИнициализацияРеквизитовИМодульныхПеременных()


////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

ИнициализацияРеквизитовИМодульныхПеременных();

ИнициализацияТаблицыПравилКонвертации();
ИнициализацияТаблицыПравилВыгрузки();
ИнициализацияТаблицыПравилОчистки();
ИнициализацияТаблицыНастройкиПараметров();

ТаблицаВыгружаемыхОбъектов=Неопределено;

ТаблицаЗагруженныхОбъектов=Новый ТаблицаЗначений;

ТаблицаЗагруженныхОбъектов.Колонки.Добавить("Тип");
ТаблицаЗагруженныхОбъектов.Колонки.Добавить("Вид");
ТаблицаЗагруженныхОбъектов.Колонки.Добавить("Номер");
ТаблицаЗагруженныхОбъектов.Колонки.Добавить("Дата");
ТаблицаЗагруженныхОбъектов.Колонки.Добавить("Время");
ТаблицаЗагруженныхОбъектов.Колонки.Добавить("Код");
ТаблицаЗагруженныхОбъектов.Колонки.Добавить("Наименование");
//ТаблицаЗагруженныхОбъектов.Колонки.Добавить("ИД_77");
//ТаблицаЗагруженныхОбъектов.Колонки.Добавить("НомерСообщения");

#КонецЕсли