&НаКлиенте
Процедура ОбслужитьОчереди(Команда)
	ОбслужитьОчереди_НаСервере();
КонецПроцедуры

&НаСервере
Функция ОбслужитьОчереди_НаСервере()
	РегистрыСведений.ОчередьЗадач.ОбслужитьОчереди();
КонецФункции

&НаКлиенте
Процедура ПерезапуститьУпавшиеЗадачи(Команда)
	рОбработки = ПерезапуститьУпавшиеЗадачи_НаСервере();
	
	Если рОбработки.Успешно Тогда
		Сообщить("Перезапущено: " + рОбработки.ОбработаноОбъектов, СтатусСообщения.Информация);
	Иначе 			
		МаркировкаКС.ВывестиОшибки(рОбработки);
	КонецЕсли;
	МаркировкаКС.ВывестиСообщения(рОбработки);
КонецПроцедуры

&НаСервере
Функция ПерезапуститьУпавшиеЗадачи_НаСервере()
	Возврат РегистрыСведений.ОчередьЗадач.ПерезапуститьУпавшиеЗадачи();
КонецФункции