Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)	
	Префикс=ПолучитьПрефиксНомеров(ЭтотОбъект);
КонецПроцедуры

////////// ПЕРЕХОД НА УПРАВЛЕНИЕ "НАСТРОЙКИ ДОСТУПА" ///////////////////////////////////////////////
// ПолномочиеПользователя ="РедактированиеДопОбработок", добавим в справочник "Настройки доступа"
// ПроизвольноеУсловие - "ПараметрыСеанса.ТипУзла <> Перечисления.ТипУзлаИБ.Склад"
////////////////////////////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////////////////////////////
// Ключ СтруктураПроверкиПолей должен содержать слово "Полномочие", значение - само Полномочие либо Синоним
///////////////////////////////////////////////////////////////////////////////////////////////////////

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ОбменДанными.Загрузка Тогда
		
		СтруктураПроверкиПолей = Новый Структура;
		СтруктураПроверкиПолей.Вставить("ПолномочиеРедактированиеДопОбработок", "РедактированиеДопОбработок");
		
		СтруктураВозврата = УстановитьОграниченияРеквизитовВМодулеОбъекта(ЭтотОбъект, СтруктураПроверкиПолей);
		
		Если СтруктураВозврата.Свойство("Ограничение") Тогда
			
			Результат = Ложь;
			
			ПроизвольноеУсловие = СокрЛП(СтруктураВозврата.Ограничение.ПроизвольноеУсловие);  // ПараметрыСеанса.ТипУзла <> Перечисления.ТипУзлаИБ.Склад
			
			Если НЕ ПустаяСтрока(ПроизвольноеУсловие) Тогда
				
				Попытка
					Выполнить("Результат = " + ПроизвольноеУсловие);
				Исключение
					Результат = Истина;
				КонецПопытки;
				
				Если Результат Тогда
					#Если Клиент Тогда
						Сообщить("Виды доп обработок редактируются на складе");
					#КонецЕсли
					Отказ = Истина;
					Возврат;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтруктураВозврата.Свойство("ПараметрыПроверки") Тогда
			
			Если СтруктураВозврата.ПараметрыПроверки.Количество() = 0 Тогда
				// Кухарь А.Ю.  05.07.2024 начало
				//
				//#Если Клиент Тогда
				//	Сообщить("Не достаточно прав для редактирования видов доп.обработок");
				//#КонецЕсли
				//Отказ = Истина;
				//Возврат;
				 
				// Кухарь А.Ю.  05.07.2024 конец
				
			КонецЕсли;
			
			Для Каждого Элемент Из СтруктураВозврата.ПараметрыПроверки Цикл
				
				Если ТипЗнч(Элемент.Ключ) = Тип("ПланВидовХарактеристикСсылка.ПолномочияПользователей") Тогда
					
					Отказ = Элемент.Значение;
					
					Если Отказ Тогда
						#Если Клиент Тогда
							Сообщить("Не достаточно прав для редактирования видов доп.обработок");
						#КонецЕсли
						Возврат;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	//вместо авторегистрации изменений
	УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	//крохин конец 31.05.2019

КонецПроцедуры
//Кухарь 04.04.17 конец