Процедура УстановитьПолучателейИзменений(ДокОбъект)	Экспорт
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли; 
	
	мПолучателей = СписокПолучателейИзменений(ДокОбъект);
	Для Каждого УзелПолучатель Из мПолучателей Цикл
		ДокОбъект.ОбменДанными.Получатели.Добавить(УзелПолучатель);
	КонецЦикла;	
	
	//Отправка подтверждений о приеме накладных складом или магазином
КонецПроцедуры

Функция СписокПолучателейИзменений(ДокОбъект, ДопИнфо = Неопределено)
	СписокПолучателей = Новый Массив;	
	
	ТипУзла				= Маркировка_ПИ.ТипТекущегоУзла();
	
	ТипОснования		= ТипЗнч(ДокОбъект.ДокОснование);
	Если ДокОбъект.КодУзлаСоздания <> Маркировка_ПИ.ЭтотУзел_Код() Тогда
		Если ТипОснования = Тип("ДокументСсылка.Перемещение") И ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			//Перемещения маршрутизируются в ЦО
		Иначе
			Возврат СписокПолучателей 	
		КонецЕсли;
	КонецЕсли;
		
	ЭтотУзел			= Маркировка_ПИ.ЭтотУзел();	
	УправляющийУзел		= Маркировка_ПИ.УправляющийУзел();	
	
	ОбменДанными		= ДокОбъект.ОбменДанными;
	Отправитель			= ОбменДанными.Отправитель;
	Загрузка			= ОбменДанными.Загрузка;
	
	УзелСклада			= ПланыОбмена.Основной.ПустаяСсылка();	
	ДокОснование		= ДокОбъект.ДокОснование;
	Если ЗначениеЗаполнено(ДокОснование) Тогда		
		Если ЕстьРеквизитДокумента("Склад", ДокОснование.Метаданные()) Тогда
			Склад				= ПолучитьРеквизитШапки(ДокОснование, "Склад");
			УзелСклада			= Маркировка_ПИ.УзелСклада(Склад);			
		ИначеЕсли ЕстьРеквизитДокумента("Подразделение", ДокОснование.Метаданные()) Тогда
			Подразделение		= ПолучитьРеквизитШапки(ДокОснование, "Подразделение");
			УзелСклада			= Маркировка_ПИ.УзелПодразделения(Подразделение);
		КонецЕсли;
	КонецЕсли;	
	
	Если ТипОснования = Тип("ДокументСсылка.РасходнаяНакладная") 
		ИЛИ ТипОснования = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда		
	
		Если ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда		
			МаркировкаС.ДобавитьУзелВПолучателей(СписокПолучателей, УзелСклада, Отправитель, Загрузка);				
		ИначеЕсли ТипУзла = Перечисления.ТипУзлаИБ.Склад 
			ИЛИ ТипУзла = Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда				
			МаркировкаС.ДобавитьУзелВПолучателей(СписокПолучателей, УправляющийУзел, Отправитель, Загрузка);					
		КонецЕсли;		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Если ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			УзелСклада = Маркировка_ПИ.УзелСклада(Справочники.Склады.НайтиПоКоду("STA-48")); //Склад Часцы (Основной)
			МаркировкаС.ДобавитьУзелВПолучателей(СписокПолучателей, УзелСклада, Отправитель, Загрузка);
		КонецЕсли;	
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.Перемещение") Тогда
		Если ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			//крохин начало 24.12.2024
			//опечатка
			//рШапки = ПолучитьРеквизитыШапки(ДокОбъект.ДокОснование, "Операция,СкладПолучатель");
			//Если рШапки.Операция = Перечисления.СкладскиеОперации.Отгрузка Тогда
			//	УзелСклада = Маркировка_ПИ.УзелСклада(рШапки.СкладПолучатель);			
			//КонецЕсли; 
			рШапки = ПолучитьРеквизитыШапки(ДокОбъект.Ссылка, "Операция");
			рШапкиДокОснования = ПолучитьРеквизитыШапки(ДокОбъект.ДокОснование, "СкладПолучатель");
			Если рШапки.Операция = Перечисления.СкладскиеОперации.Отгрузка Тогда
				УзелСклада = Маркировка_ПИ.УзелСклада(рШапкиДокОснования.СкладПолучатель);			
			КонецЕсли; 
			//крохин конец 24.12.2024
			МаркировкаС.ДобавитьУзелВПолучателей(СписокПолучателей, УзелСклада, Отправитель, Загрузка);
		Иначе
			МаркировкаС.ДобавитьУзелВПолучателей(СписокПолучателей, УправляющийУзел, Отправитель, Загрузка);
		КонецЕсли;		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаданиеНаМаркировку") Тогда
		Если ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			//Маркировки в офисе ????
		Иначе
			МаркировкаС.ДобавитьУзелВПолучателей(СписокПолучателей, УправляющийУзел, Отправитель, Загрузка);			
		КонецЕсли;		
	КонецЕсли;		
	
	Возврат ЗаполнениеДокументов.УдалитьПовторяющиесяЭлементыМассива(СписокПолучателей, Истина);	
КонецФункции //СписокПолучателейИзменений(ДокОбъект, ДопИнфо = Неопределено)

Функция ПолучитьКМпоПНК_Импорт(ПНК_Ссылка)	
	МаксЧислоКодов = 50000;
	
	Запрос = Новый Запрос(ТекстЗапроса_КМ_ПНК_Импорт_САгрегатами());
	Запрос.УстановитьПараметр("ПНК_Ссылка", ПНК_Ссылка);	
	
	Результат = Новый Массив;
	мКоды = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		мКоды.Добавить(Выборка.ШтрихкодУпаковки);
		
		Если мКоды.Количество()>=МаксЧислоКодов Тогда
			Результат.Добавить(мКоды);		
			мКоды = Новый Массив;
		КонецЕсли; 		
	КонецЦикла; 
	
	Если мКоды.Количество() > 0 Тогда
		Результат.Добавить(мКоды);
	КонецЕсли; 	
	
	Возврат Результат;
КонецФункции //ПолучитьКМпоПНК()

Функция ПолучитьКМПоОтчетамОНанесении(ТаблицаАгрегаций)	
	МаксЧислоКодов = 50000;
	
	Запрос = Новый Запрос(ТекстЗапроса_КМ_ЗПС_Импорт_ПоОтчетамОНанесении());	
	Запрос.УстановитьПараметр("ТаблицаАгрегаций",	ТаблицаАгрегаций);	
	
	Результат = Новый Массив;
	мКоды = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		мКоды.Добавить(Новый Структура("ШтрихкодКоробки,ШтрихкодУпаковки", Выборка.ШтрихкодКоробки, Выборка.ШтрихкодУпаковки));
		
		Если мКоды.Количество()>=МаксЧислоКодов Тогда
			Результат.Добавить(мКоды);		
			мКоды = Новый Массив;
		КонецЕсли; 		
	КонецЦикла; 
	
	Если мКоды.Количество() > 0 Тогда
		Результат.Добавить(мКоды);
	КонецЕсли; 	
	
	Возврат Результат;
КонецФункции //ПолучитьКМпоПНК()

Функция ПолучитьКМпоЛистуНабора(ЛистНабора) Экспорт	
	Запрос = Запрос_КМ_ПоЛистуНабора(ЛистНабора);	
	
	КоличествоНоменклатуры = 0;
	КодыМаркировки = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ТипЗаписи() = ТипЗаписиЗапроса.ОбщийИтог Тогда
			КоличествоНоменклатуры = Выборка.Номенклатура;
		Иначе			
			КодыМаркировки.Добавить(Выборка.ШтрихкодУпаковки);						
		КонецЕсли;
	КонецЦикла; 
	
	Возврат Новый Структура("КоличествоНоменклатуры,КодыМаркировки", КоличествоНоменклатуры, КодыМаркировки);
КонецФункции //ПолучитьКМпоЛистуНабора()

Функция ПолучитьКМпоЛистамНабора(ДокОтгрузки, МаксЧислоКодов = 50000) Экспорт	
	Запрос = Новый Запрос;
	
	// Кухарь А.Ю. 12.02.2025 начало
	//	Если ЕстьЛистыПереукладки(ДокОтгрузки) Тогда
	
	ПравилаРаботыСАгрегациейЧЗ=МаркировкаКС.ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладной(ДокОтгрузки);
	
	если ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияПаллет тогда
		
		Запрос.Текст = ТекстЗапроса_КМ_ПоДокументуОтгрузки_Паллеты();
		//Валетов + 25,12,2025 ПУСТАЯ ЗАДАЧА Добавление для экспозиторов
	ИначеЕсли ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияКоробок 
		Тогда  
		
		Запрос.Текст = ТекстЗапроса_КМ_ПоДокументуОтгрузки_ЛНКоробами(ДокОтгрузки); 
		//Валетов -
		// Кухарь А.Ю.  29.03.2025 начало
	иначеесли ОбщегоНазначения_ПИ.ВНакладнойТолькоСпайки(ДокОтгрузки)
		и не ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияПаллет 
		и  не ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияКоробок
		и  не ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияБлочков
		тогда
		Запрос.Текст = ТекстЗапроса_КМ_ПоДокументуОтгрузки_ЗСБ();
		// Кухарь А.Ю.  29.03.2025 конец
		
		// Кухарь А.Ю.  30.04.2025 начало
	иначеесли ОбщегоНазначения_ПИ.ВНакладнойНетСпаек(ДокОтгрузки) 
		и не ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияПаллет
		и не ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияКоробок
		и не ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияБлочков 
		и не ПравилаРаботыСАгрегациейЧЗ.РазворачиватьАгрегациюДоШтук 
		тогда

		// Кухарь А.Ю.  16.05.2026 начало      
		//OUT-216
		// 		Запрос.Текст = ТекстЗапроса_КМ_ПоДокументуОтгрузки_ЛНБезВсего();	
		если ИспользоватьЛНТолькоДляНабора(ДокОтгрузки) тогда  
			Запрос.Текст = ТекстЗапроса_КМ_ПоДокументуОтгрузки_ЛПБезВсего();
		иначе    
			Запрос.Текст = ТекстЗапроса_КМ_ПоДокументуОтгрузки_ЛНБезВсего();
		КонецЕсли;
		// Кухарь А.Ю.  16.05.2026 конец
		
		// Кухарь А.Ю.  30.04.2025 конец
    //++Данилова Е.В. 02.04.2026  MARK-3539
	//иначеЕсли ЕстьЛистыПереукладки(ДокОтгрузки) Тогда
	иначеЕсли ЕстьЛистыПереукладки(ДокОтгрузки) 
		ИЛИ (МаркировкаС.ЕстьЛПСКодамиЧЗ(ДокОтгрузки) 
		и ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияБлочков) Тогда
	//--Данилова Е.В. 02.04.2026 
		
		// Кухарь А.Ю. 12.02.2025 конец
		
		Запрос.Текст = ТекстЗапроса_КМ_ПоДокументуОтгрузки_ЛП();
	Иначе
		Запрос.Текст = ТекстЗапроса_КМ_ПоДокументуОтгрузки_ЛН(ДокОтгрузки);	
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("ДокОтгрузки", ДокОтгрузки); 
	//++Данилова Е.В. 02.04.2026 MARK-3539
	Запрос.УстановитьПараметр("АгрегацииВЛП",МаркировкаС.ЕстьЛПСКодамиЧЗ(ДокОтгрузки));
	//--Данилова Е.В. 02.04.2026 
	Запрос.УстановитьПараметр("РазворачиватьАгрегациюДоШтук",ПравилаРаботыСАгрегациейЧЗ.РазворачиватьАгрегациюДоШтук);
	
	Результат	= Новый Массив;
	мКоды 		= Новый Массив;
	Выборка 	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//Валетов+ 21,05,2025 Разворачивание Коробов до штук
		//https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5113
		//Было  мКоды.Добавить(Выборка.ШтрихкодУпаковки);
		 
		// Кухарь А.Ю.  26.02.2026 начало
		// Если Выборка.ШтрихкодУпаковки.ТипШК = Перечисления.ТипыШтрихКодов.Коробка   
		Если Выборка.ТипШК = Перечисления.ТипыШтрихКодов.Коробка   
			// Кухарь А.Ю.  26.02.2026 конец
			
			И ТипЗнч(ДокОтгрузки) = Тип("ДокументСсылка.РасходнаяНакладная")  //Исключаем ХКМ к СПН, ПНК и РКМ
			И МаксЧислоКодов > 0 											  //Исключаем заполнение док. Маркировка Товаров ИСМП
			И НЕ ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияКоробок 
			И ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.Склад 		  //Тут не уверен, но лучше ограничить 
			И ДокОтгрузки.Дата > НачалоДня(Дата('20250501')) Тогда 
			Для Каждого ЭлКороба Из Выборка.ШтрихкодУпаковки.ВложенныеШтрихкоды Цикл
				мКоды.Добавить(ЭлКороба.Штрихкод);	
			КонецЦикла;
		Иначе
			мКоды.Добавить(Выборка.ШтрихкодУпаковки);  
		КонецЕсли;
		//Валетов -	
		
		Если мКоды.Количество() >= МаксЧислоКодов И МаксЧислоКодов > 0 Тогда
			Результат.Добавить(мКоды);		
			мКоды = Новый Массив;
		КонецЕсли; 		
	КонецЦикла; 
	
	Если МаксЧислоКодов>0 Тогда	
		Если мКоды.Количество() > 0 Тогда
			Результат.Добавить(мКоды);
		КонецЕсли; 		
	Иначе            
		Результат = мКоды;		
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции //ПолучитьКМпоЛистамНабора()

Функция ПолучитьКМпоЗМО(ДокОтгрузки, МаксЧислоКодов = 50000) Экспорт	
	Запрос = Новый Запрос(ТекстЗапроса_КМ_ПоЗаданиеНаМаркировку());
	Запрос.УстановитьПараметр("ДокОтгрузки", ДокОтгрузки);	
	
	Результат	= Новый Массив;
	мКоды 		= Новый Массив;
	Выборка 	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		мКоды.Добавить(Новый Структура("ШтрихкодУпаковки,ШтрихкодКоробки", Выборка.ШтрихкодУпаковки, Выборка.ШтрихкодКоробки));
		
		Если мКоды.Количество() >= МаксЧислоКодов И МаксЧислоКодов > 0 Тогда
			Результат.Добавить(мКоды);		
			мКоды = Новый Массив;
		КонецЕсли; 		
	КонецЦикла; 
	
	Если МаксЧислоКодов>0 Тогда	
		Если мКоды.Количество() > 0 Тогда
			Результат.Добавить(мКоды);
		КонецЕсли; 		
	Иначе            
		Результат = мКоды;		
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции //ПолучитьКМпоЗМО()

Функция ПолучитьКМпоЗСБ(ЗаданиеНаСборку, МаксЧислоКодов = 75000) Экспорт	
	Запрос = Новый Запрос(ТекстЗапроса_КМ_ПоЗаданиеНаСборку());
	Запрос.УстановитьПараметр("ЗаданиеНаСборку", ЗаданиеНаСборку);	
	
	Результат	= Новый Массив;
	мКоды 		= Новый Массив;
	Выборка 	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		мКоды.Добавить(Новый Структура("ШтрихкодНабора,ШтрихкодУпаковки,КодКомплектующегоНеНанесен",
			Выборка.ШтрихкодНабора, Выборка.ШтрихкодУпаковки, Выборка.КодКомплектующегоНеНанесен));
		
		Если мКоды.Количество() >= МаксЧислоКодов И МаксЧислоКодов > 0 Тогда
			Результат.Добавить(мКоды);		
			мКоды = Новый Массив;
		КонецЕсли; 		
	КонецЦикла; 
	
	Если МаксЧислоКодов>0 Тогда	
		Если мКоды.Количество() > 0 Тогда
			Результат.Добавить(мКоды);
		КонецЕсли; 		
	Иначе            
		Результат = мКоды;		
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции //ПолучитьКМпоЗСБ()

Функция ПолучитьКМпоХКМ(ДокОтгрузки, МаксЧислоКодов = 50000) Экспорт	
	Запрос = Новый Запрос(ТекстЗапроса_КМ_ПоДокументуОтгрузки_ХКМ());
	Запрос.УстановитьПараметр("ДокОтгрузки", ДокОтгрузки);	
	
	Результат	= Новый Массив;
	мКоды 		= Новый Массив;
	Выборка 	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		мКоды.Добавить(Выборка.ШтрихкодУпаковки);
		
		Если мКоды.Количество() >= МаксЧислоКодов И МаксЧислоКодов > 0 Тогда
			Результат.Добавить(мКоды);		
			мКоды = Новый Массив;
		КонецЕсли; 		
	КонецЦикла; 
	
	Если МаксЧислоКодов>0 Тогда	
		Если мКоды.Количество() > 0 Тогда
			Результат.Добавить(мКоды);
		КонецЕсли; 		
	Иначе            
		Результат = мКоды;		
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции //ПолучитьКМпоХКМ()

Функция ТекстЗапроса_КМ_ПНК_Импорт() Экспорт
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ	
	|	Ссылка КАК ЗаказКМ
	|ПОМЕСТИТЬ
	|	ВТ_ЗаказыКМ
	|ИЗ 
	|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ
	|ГДЕ
	|	ДокументОснование В (
	|		ВЫБРАТЬ РАЗЛИЧНЫЕ		
	|			ЗПС КАК ЗПС
	|		ИЗ
	|			Документ.ПриходнаяНакладная.ЗаказыПоставщикам
	|		ГДЕ
	|			Ссылка = &ПНК_Ссылка			
	|	)	
	|;
	|ВЫБРАТЬ
	|	ВТ_ЗаказыКМ.ЗаказКМ КАК ЗаказКМ,
	|	СпрКМ.Ссылка 		КАК ШтрихкодУпаковки
	|ИЗ
	|	ВТ_ЗаказыКМ
	|ЛЕВОЕ СОЕДИНЕНИЕ	
	|	Справочник.ШтрихкодыУпаковокТоваров КАК СпрКМ
	|ПО
	|	ВТ_ЗаказыКМ.ЗаказКМ = СпрКМ.ЗаказКМ 
	|";
	
	Возврат ТекстЗапроса;
КонецФункции // ТекстЗапроса_КМ_ПНК_Импорт(ПНК_Ссылка) Экспорт

Функция ТекстЗапроса_КМ_ПНК_Импорт_САгрегатами() Экспорт
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ	
	|	Ссылка КАК ЗаказКМ
	|ПОМЕСТИТЬ
	|	ВТ_ЗаказыКМ
	|ИЗ 
	|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ
	|ГДЕ
	|	ДокументОснование В (
	|		ВЫБРАТЬ РАЗЛИЧНЫЕ		
	|			ЗПС КАК ЗПС
	|		ИЗ
	|			Документ.ПриходнаяНакладная.ЗаказыПоставщикам
	|		ГДЕ
	|			Ссылка = &ПНК_Ссылка			
	|	)	
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ	
	|	IsNULL(Агрегаты.Ссылка,СпрКМ.Ссылка) 	КАК ШтрихкодУпаковки
	|ПОМЕСТИТЬ ВТ_Коды	
	|ИЗ
	|	ВТ_ЗаказыКМ
	|ЛЕВОЕ СОЕДИНЕНИЕ	
	|	Справочник.ШтрихкодыУпаковокТоваров КАК СпрКМ
	|ПО
	|	ВТ_ЗаказыКМ.ЗаказКМ = СпрКМ.ЗаказКМ 
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК Агрегаты
	|ПО
	|	Агрегаты.ШтрихКод = СпрКМ.Ссылка	
	|;
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки.ТипКода КАК ТипКода,	
	|	*
	|ИЗ
	|	ВТ_Коды		
	|УПОРЯДОЧИТЬ ПО
	|	ШтрихкодУпаковки.ТипКода,		
	|	ШтрихкодУпаковки.Наименование	
	|";
	
	Возврат ТекстЗапроса;
КонецФункции // ТекстЗапроса_КМ_ПНК_Импорт_САгрегатами(ПНК_Ссылка) Экспорт

Функция ТекстЗапроса_КМ_ЗПС_Импорт_САгрегатами() Экспорт
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШтрихкодУпаковки КАК ШтрихкодУпаковкиХКМ
	|ПОМЕСТИТЬ ВТ_ОформленныеХКМ
	|ИЗ
	|  	Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка.ДокОснование = &ЗПС_Ссылка
	|	И Ссылка <> &ТекущийХКМ
	|ИНДЕКСИРОВАТЬ ПО
	|	ШтрихкодУпаковки
	|;	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ	
	|	ШтрихкодУпаковки.Владелец.Родитель	КАК Модель,
	|	ШтрихкодУпаковки.Владелец 			КАК Номенклатура,	
	|	ШтрихкодУпаковки					КАК ШтрихкодУпаковки,
	|	ШтрихкодКоробки				 		КАК ШтрихкодКоробки,
	|	1									КАК КоличествоКМ
	|ИЗ 
	|	Документ.МаркировкаТоваровИСМП.ШтрихКодыУпаковок КАК Агрегации
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ВТ_ОформленныеХКМ
	|ПО
	|	Агрегации.ШтрихкодУпаковки = ВТ_ОформленныеХКМ.ШтрихкодУпаковкиХКМ	
	|ГДЕ
	|	Агрегации.Ссылка.ДокументОснование = &ЗПС_Ссылка
	|	И (
	|		Агрегации.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.ОжиданиеОтложеннойОбработки) 
	|		ИЛИ Агрегации.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан) 
	|	)	
	|	И Агрегации.Ссылка.ВидОПерации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация)
	|	И Агрегации.Ссылка.Проведен
	|	И ВТ_ОформленныеХКМ.ШтрихкодУпаковкиХКМ ЕСТЬ NULL
	|УПОРЯДОЧИТЬ ПО
	|	Агрегации.ШтрихкодУпаковки.Владелец.Наименование,
	|	Агрегации.ШтрихкодКоробки.Наименование,		
	|	Агрегации.ШтрихкодУпаковки.Наименование
	|ИТОГИ СУММА(КоличествоКМ) ПО	
	|	Модель,
	|	Номенклатура
	|";	
	
	Возврат ТекстЗапроса;
КонецФункции // ТекстЗапроса_КМ_ПНК_Импорт_САгрегатами(ПНК_Ссылка) Экспорт

Функция ТекстЗапроса_КМ_ЗПС_Импорт_ПоОтчетамОНанесении() Экспорт
	ТекстЗапроса = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Агрегации ИЗ &ТаблицаАгрегаций КАК ТаблицаАгрегаций
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ	
	|	ШтрихкодУпаковки.Владелец.Родитель	КАК Модель,
	|	ШтрихкодУпаковки.Владелец			КАК Номенклатура,	
	|	ШтрихкодУпаковки					КАК ШтрихкодУпаковки,
	|	ШтрихкодКоробки						КАК ШтрихкодКоробки,
	|	1									КАК КоличествоКМ	
	|ИЗ
	|	ВТ_Агрегации		
	|УПОРЯДОЧИТЬ ПО
	|	ШтрихкодУпаковки.Владелец.Родитель.Наименование,
	|	ШтрихкодУпаковки.Владелец.Наименование,		
	|	ШтрихкодУпаковки.Наименование	
	|";	
	
	Возврат ТекстЗапроса;
КонецФункции // ТекстЗапроса_КМ_ЗПС_Импорт_ПоТаблицеАгрегаций() Экспорт

Функция Запрос_КМ_ПоЛистуНабора(ЛистНабора) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ	
	|   ШтрихкодУпаковки.Владелец КАК Номенклатура,
	|	ШтрихкодУпаковки,
	|	НомерЗаказа,
	|	1 КАК КоличествоКМ
	|ИЗ 
	|	" + ЛистНабора.Метаданные().ПолноеИмя() + ".ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка = &ЛистНабора
	|	И Ссылка.Проведен	
	|ИТОГИ 
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Номенклатура),
	|	СУММА(КоличествоКМ)
	|ПО
	|	ОБЩИЕ
	|";
	
	Запрос.УстановитьПараметр("ЛистНабора", ЛистНабора);
	
	Возврат Запрос;
КонецФункции //Запрос_КМ_ПоЛистуНабора(ЛистНабора) Экспорт

// Ихсанов Д. А. 27.08.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2464 - Добавлен параметр ДокОтгрузки
Функция ТекстЗапроса_КМ_ПоДокументуОтгрузки_ЛН(ДокОтгрузки = Неопределено) Экспорт
	
	// Ихсанов Д. А. Начало 27.08.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2464
	// Если не указан документ отгрузки, то доработка не будет вступать в силу
	Если ДокОтгрузки = Неопределено Тогда
		ДокОтгрузки = Документы.РасходнаяНакладная.ПустаяСсылка()
	КонецЕсли;
	ДопПараметрыНакладной = ОбщегоНазначения_ПИ.ПолучитьДопПараметрыНакладной(ДокОтгрузки);
	// Ихсанов Д. А. Конец  27.08.2025
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	|ПОМЕСТИТЬ ЛСК
	|ИЗ
	|	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
	|ГДЕ
	|	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.ДокОснование.ДокОснование = &ДокОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Ихсанов Д. А. Начало 27.02.2026 Рефакторинг запроса
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//// Кухарь А.Ю.  31.08.2025 начало   
	////ЕСТЬNULL(ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод, ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки) КАК ШтрихкодУпаковки,  				   
	//|ВЫБОР
	//|КОГДА ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	//|	ТОГДА ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки
	//|ИНАЧЕ ЕСТЬNULL(ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод, ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки)
	//|КОНЕЦ КАК ШтрихкодУпаковки,		   
	//// Кухарь А.Ю.  31.08.2025 конец		
	//|	ЛистНабораШтрихкодыУпаковок.НомерЗаказа КАК НомерЗаказа
	//|ПОМЕСТИТЬ ЛНДоРазвертки
	//|ИЗ
	//|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	//|		ПО ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	//// Ихсанов Д. А. Начало 27.08.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2464
	//|			%1
	//// Ихсанов Д. А. Конец  27.08.2025
	//|ГДЕ
	//|	ЛистНабораШтрихкодыУпаковок.Ссылка.ДокОснование = &ДокОтгрузки
	//|	И ЛистНабораШтрихкодыУпаковок.Ссылка.Проведен
	//|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодБлочка = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	//|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодНабора = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	//|	И ЛистНабораШтрихкодыУпаковок.Ссылка.КодАгрегации = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	////++Данилова Е.В. 27.05.2025 HELP-5130    
	//|    И (ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипКода <> Значение(Перечисление.ТипыКодовМаркировки.ЛогистическаяУпаковка) 
	//|		ИЛИ &РазворачиватьАгрегациюДоШтук = ИСТИНА)
	////--Данилова Е.В. 27.05.2025
	|ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваров.ТипШК КАК ТипШК,
	|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|	ЛистНабораШтрихкодыУпаковок.НомерЗаказа КАК НомерЗаказа
	|ПОМЕСТИТЬ ЛНДоРазвертки_Предварительный
	|ИЗ
	|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора КАК ЛистНабора
	|		ПО ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|		ПО ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваров.Ссылка
	|ГДЕ
	|	ЛистНабора.ДокОснование = &ДокОтгрузки
	|	И ЛистНабора.Проведен
	|	И ЛистНабора.КодАгрегации = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодБлочка = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодНабора = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|	И (ШтрихкодыУпаковокТоваров.ТипКода <> ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.ЛогистическаяУпаковка)
	|			ИЛИ &РазворачиватьАгрегациюДоШтук)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка КАК Ссылка,
	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ вт_ДанныеПоВложеннымШтрихКодам
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|		ПО ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка = ШтрихкодыУпаковокТоваров.Ссылка
	|ГДЕ
	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка В
	|			(ВЫБРАТЬ
	|				ЛНДоРазвертки_Предварительный.ШтрихкодУпаковки
	|			ИЗ
	|				ЛНДоРазвертки_Предварительный)
	|	%1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛНДоРазвертки_Предварительный.НомерЗаказа КАК НомерЗаказа,
	|	ВЫБОР
	|		КОГДА ЛНДоРазвертки_Предварительный.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	|			ТОГДА ЛНДоРазвертки_Предварительный.ШтрихкодУпаковки
	|		ИНАЧЕ ЕСТЬNULL(вт_ДанныеПоВложеннымШтрихКодам.Штрихкод, ЛНДоРазвертки_Предварительный.ШтрихкодУпаковки)
	|	КОНЕЦ КАК ШтрихкодУпаковки
	|ПОМЕСТИТЬ ЛНДоРазвертки
	|ИЗ
	|	ЛНДоРазвертки_Предварительный КАК ЛНДоРазвертки_Предварительный
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ДанныеПоВложеннымШтрихКодам КАК вт_ДанныеПоВложеннымШтрихКодам
	|		ПО ЛНДоРазвертки_Предварительный.ШтрихкодУпаковки = вт_ДанныеПоВложеннымШтрихКодам.Ссылка
	// Ихсанов Д. А. Конец  27.02.2026
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,     
	|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК как ТипШК,
	|	ЛистНабораШтрихкодыУпаковок.НомерЗаказа КАК НомерЗаказа
	|ПОМЕСТИТЬ ЛНБезВсего
	|ИЗ
	|	ЛНДоРазвертки КАК ЛистНабораШтрихкодыУпаковок
	|ГДЕ
	|	НЕ ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки В
	|				(ВЫБРАТЬ
	|					ЛСК.ШтрихкодУпаковки
	|				ИЗ
	|					ЛСК КАК ЛСК)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки, 
	|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК как ТипШК,
	
	|	ЛистНабораШтрихкодыУпаковок.НомерЗаказа КАК НомерЗаказа
	|ИЗ
	|	ЛНБезВсего КАК ЛистНабораШтрихкодыУпаковок
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛистНабораШтрихкодыУпаковок.ШтрихкодБлочка,    
	|	ЛистНабораШтрихкодыУпаковок.ШтрихкодБлочка.ТипШК,
	
	|	ЛистНабораШтрихкодыУпаковок.НомерЗаказа
	|ИЗ
	|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	|ГДЕ
	|	ЛистНабораШтрихкодыУпаковок.Ссылка.ДокОснование = &ДокОтгрузки
	|	И ЛистНабораШтрихкодыУпаковок.Ссылка.Проведен
	|	И ЛистНабораШтрихкодыУпаковок.Ссылка.КодАгрегации = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодБлочка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|  
	//++Данилова Е.В. 29.05.2025  HELP-5130
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШтрихкодыКоробокДляАгрегации.НовыйКодКоробки, 
	|	ШтрихкодыКоробокДляАгрегации.НовыйКодКоробки.ТипШК,
	
	|	ЛистНабораШтрихкодыУпаковок.НомерЗаказа
	|ИЗ
	|	Документ.ЛистНабора.ШтрихкодыКоробокДляАгрегации КАК ШтрихкодыКоробокДляАгрегации 
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок 
	|    По ШтрихкодыКоробокДляАгрегации.ссылка = ЛистНабораШтрихкодыУпаковок.ссылка
	|    И ШтрихкодыКоробокДляАгрегации.НовыйКодКоробки = ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки
	|ГДЕ
	|	ШтрихкодыКоробокДляАгрегации.Ссылка.ДокОснование = &ДокОтгрузки
	|	И ШтрихкодыКоробокДляАгрегации.Ссылка.Проведен
	|	И ЛистНабораШтрихкодыУпаковок.Ссылка.КодАгрегации = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	//--Данилова Е.В. 29.05.2025
	//++Данилова Е.В. 30.05.2025 HELP-5109  для отсканированных блочков 
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки,
	|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК,
	
	|	ЛистНабораШтрихкодыУпаковок.НомерЗаказа
	|ИЗ
	|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	|ГДЕ
	|	ЛистНабораШтрихкодыУпаковок.Ссылка.ДокОснование = &ДокОтгрузки
	|	И ЛистНабораШтрихкодыУпаковок.Ссылка.Проведен
	|	И ЛистНабораШтрихкодыУпаковок.Ссылка.КодАгрегации = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодБлочка = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|	И ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)
	//--Данилова Е.В. 30.05.2025
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки,    
	|	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК,
	
	|	""""
	|ИЗ
	|	Документ.ЗаданиеНаСборкуКомплектовЧЗ.ШтрихкодыУпаковок КАК ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок
	|ГДЕ
	|	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.Ссылка.ДокОснование = &ДокОтгрузки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЛистНабора.КодАгрегации,
	|	ЛистНабора.КодАгрегации.ТипШК,
	
	|	""""
	|ИЗ
	|	Документ.ЛистНабора КАК ЛистНабора
	|ГДЕ
	|	ЛистНабора.Проведен
	|	И ЛистНабора.ДокОснование = &ДокОтгрузки
	|	И НЕ ЛистНабора.КодАгрегации = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)";
	
	// Кухарь А.Ю.  31.01.2025 конец
	
	// Ихсанов Д. А. Начало 27.08.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2464
	// Отбор по типу кодов в соединении со вложенными штрихкодами должен выполняться только в случае, если
	// запрос должен быть получен по РНК с контрагентом Яндекс или Магнит
	// В ином случае запрос остается прежним и не должен влиять на заполнение документа ХКМ
	СтрокаЗамены = "";
	Если ДопПараметрыНакладной.Имя = "YANDEX_FBS" Или ДопПараметрыНакладной.Имя = "MAGNIT_FBS" Тогда
		// Ихсанов Д. А. Начало 27.02.2026 Рефакторинг запроса
		//СтрокаЗамены = "И ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка.ТипКода <> Значение(Перечисление.ТипыКодовМаркировки.Набор)";
		СтрокаЗамены = "И ШтрихкодыУпаковокТоваров.ТипКода <> ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор)";
		// Ихсанов Д. А. Конец  27.02.2026
	КонецЕсли;
	ТекстЗапроса = СтрШаблон(ТекстЗапроса, СтрокаЗамены);
	// Ихсанов Д. А. Конец  27.08.2025
	
	Возврат ТекстЗапроса;
КонецФункции // ТекстЗапроса_КМ_РНК(ПНК_Ссылка) Экспорт

Функция ТекстЗапроса_КМ_ПоДокументуОтгрузки_ЛП() Экспорт
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛистПереукладки.КодАгрегации КАК ШтрихкодУпаковки,
	|	ЛистПереукладки.КодАгрегации.ТипШК КАК ТипШК,
	|	ЛистПереукладки.НомерЗаказа КАК НомерЗаказа
	|ИЗ
	|	Документ.ЛистПереукладки КАК ЛистПереукладки
	|ГДЕ
	|	ЛистПереукладки.ДокОснование = &ДокОтгрузки
	|	И ЛистПереукладки.Проведен
	|	И ЛистПереукладки.КодАгрегации <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодБлочка,
	|	ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодБлочка.ТипШК,
	|	ЛистПереукладкиШтрихкодыУпаковок.НомерЗаказа
	|ИЗ
	|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистПереукладкиШтрихкодыУпаковок
	|ГДЕ
	|	ЛистПереукладкиШтрихкодыУпаковок.Ссылка.ДокОснование = &ДокОтгрузки
	|	И ЛистПереукладкиШтрихкодыУпаковок.Ссылка.Проведен
	|	И ЛистПереукладкиШтрихкодыУпаковок.Ссылка.КодАгрегации = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|	И ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодБлочка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	| 
	//++Данилова Е.В. 02.04.2026 MARK-3539
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки,
	|	ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК,
	|	ЛистПереукладкиШтрихкодыУпаковок.НомерЗаказа
	|ИЗ
	|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистПереукладкиШтрихкодыУпаковок
	|ГДЕ
	|	ЛистПереукладкиШтрихкодыУпаковок.Ссылка.ДокОснование = &ДокОтгрузки
	|	И ЛистПереукладкиШтрихкодыУпаковок.Ссылка.Проведен
	|	И ЛистПереукладкиШтрихкодыУпаковок.Ссылка.КодАгрегации = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|	И ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодБлочка = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|	И ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = Значение(Перечисление.ТипыШтрихКодов.Блочок)";
	//--Данилова Е.В. 02.04.2026 
	
	Возврат ТекстЗапроса;
КонецФункции //ТекстЗапроса_КМ_ПоДокументуОтгрузки_ЛП(ПНК_Ссылка) Экспорт

// Кухарь А.Ю.  30.04.2025 начало

Функция ТекстЗапроса_КМ_ПоДокументуОтгрузки_ЛНБезВсего() Экспорт
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛистНабораШтрихкодыУпаковок.НомерЗаказа КАК НомерЗаказа,    
				   |	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК как ТипШК,
	               |	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	               |ИЗ
	               |	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	               |ГДЕ
	               |	ЛистНабораШтрихкодыУпаковок.Ссылка.ДокОснование = &ДокОтгрузки
	               |	И ЛистНабораШтрихкодыУпаковок.Ссылка.Проведен
	               |	И ЛистНабораШтрихкодыУпаковок.ШтрихкодБлочка = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	               |	И ЛистНабораШтрихкодыУпаковок.ШтрихкодНабора = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	               |	И ЛистНабораШтрихкодыУпаковок.Ссылка.КодАгрегации = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)";	
	
	Возврат ТекстЗапроса;
КонецФункции // ТекстЗапроса_КМ_РНК(ПНК_Ссылка) Экспорт


// Кухарь А.Ю.  16.05.2026 начало
// OUT-216
Функция ТекстЗапроса_КМ_ПоДокументуОтгрузки_ЛПБезВсего() Экспорт
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Лист.НомерЗаказа КАК НомерЗаказа,
	               |	Лист.ШтрихкодУпаковки.ТипШК КАК ТипШК,
	               |	Лист.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	               |ИЗ
	               |	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК Лист
	               |ГДЕ
	               |	Лист.Ссылка.ДокОснование = &ДокОтгрузки
	               |	И Лист.Ссылка.Проведен
	               |	И Лист.ШтрихкодБлочка = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	               |	И Лист.Ссылка.КодАгрегации = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)";	
	
	Возврат ТекстЗапроса;
КонецФункции // ТекстЗапроса_КМ_РНК(ПНК_Ссылка) Экспорт
 
// Кухарь А.Ю.  16.05.2026 конец

//Валетов + 25,12,2025 ПУСТАЯ ЗАДАЧА Экпозиторы
Функция ТекстЗапроса_КМ_ПоДокументуОтгрузки_ЛНКоробами(ДокОтгрузки) Экспорт
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Листы.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|	Листы.ШтрихкодУпаковки.ТипШК как ТипШК
	
	|ИЗ
	|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК Листы
	|ГДЕ
	|	Листы.Ссылка.ДокОснование = &ДокОтгрузки
	|	И Листы.Ссылка.Проведен
	|	И Листы.Ссылка.КодАгрегации = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|	И Листы.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Листы.Ссылка.КодАгрегации,
	|	Листы.ШтрихкодУпаковки.ТипШК как ТипШК
	
	|ИЗ
	|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК Листы
	|ГДЕ
	|	Листы.Ссылка.Проведен
	|	И Листы.Ссылка.ДокОснование = &ДокОтгрузки
	|	И НЕ Листы.Ссылка.КодАгрегации = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)";
	
	Если ЕстьЛистыПереукладки(ДокОтгрузки) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЛистНабора","ЛистПереукладки");
	КонецЕсли;
	Возврат ТекстЗапроса;
КонецФункции 
//Валетов -

// Кухарь А.Ю.  30.04.2025 конец


// Кухарь А.Ю. 12.02.2025 начало
// Временный кусочек

Функция ТекстЗапроса_КМ_ПоДокументуОтгрузки_Паллеты() Экспорт
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПаллетаЛистыНабора.ШтрихкодУпаковкиПаллеты КАК ШтрихкодУпаковки,       
	// Кухарь А.Ю.  26.02.2026 начало
	// Пустая задача
	|	ПаллетаЛистыНабора.ШтрихкодУпаковкиПаллеты.ТипШК КАК ТипШК,
	
	// Кухарь А.Ю.  26.02.2026 конец
	
	|	"""" КАК НомерЗаказа
	|ИЗ
	|	Документ.Паллета.ЛистыНабора КАК ПаллетаЛистыНабора
	|ГДЕ
	|	ПаллетаЛистыНабора.Ссылка.Проведен
	|	И ПаллетаЛистыНабора.Документ = &ДокОтгрузки";
	
	Возврат ТекстЗапроса;
КонецФункции //ТекстЗапроса_КМ_ПоДокументуОтгрузки_ЛП(ПНК_Ссылка) Экспорт

// Кухарь А.Ю. 12.02.2025 конец


Функция ЕстьЛистыПереукладки(ДокОтгрузки) Экспорт
	Запрос = Новый Запрос;
	//Валетов+ 13,04,2026  https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-9422
	//Было
	//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//|	ЛистПереукладки.Ссылка КАК Ссылка
	//|ИЗ
	//|	Документ.ЛистПереукладки КАК ЛистПереукладки
	//|ГДЕ
	//|	ЛистПереукладки.ДокОснование = &ДокОтгрузки
	//|	И ЛистПереукладки.Проведен
	//// Кухарь А.Ю.  17.02.2025 начало
	////|	И ЛистПереукладки.КодАгрегации <> &КодАгрегации";
	//|	И (ЛистПереукладки.КодАгрегации <> &КодАгрегации
	//|	Или ЛистПереукладки.ШтрихкодыУпаковок.ШтрихкодБлочка <> &КодАгрегации)";   
	// Кухарь А.Ю.  17.02.2025 конец	
	//ПОМЕНЯЛ ЗАПРОС
	Запрос.Текст =  "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛистПереукладкиШтрихкодыУпаковок.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистПереукладкиШтрихкодыУпаковок
	|ГДЕ
	|	ЛистПереукладкиШтрихкодыУпаковок.Ссылка.ДокОснование = &ДокОтгрузки
	|	И ЛистПереукладкиШтрихкодыУпаковок.Ссылка.Проведен
	|	И (ЛистПереукладкиШтрихкодыУпаковок.Ссылка.КодАгрегации <> &КодАгрегации
	|			ИЛИ ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодБлочка <> &КодАгрегации
	|			ИЛИ ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(перечисление.ТипыШтрихКодов.Коробка))";
	//Валетов -
			   
	запрос.УстановитьПараметр("КодАгрегации",Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка());
	//Кухарь 23.12.2024 конец	
	
	Запрос.УстановитьПараметр("ДокОтгрузки", ДокОтгрузки);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат (Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка));
КонецФункции //ЕстьЛистыПереукладки(ДокОтгрузки) Экспорт 

Функция ТекстЗапроса_КМ_ПоЗаданиеНаМаркировку() Экспорт
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ	
	|	ШтрихкодУпаковки,
	|	ШтрихКодКоробки
	|ИЗ 
	|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка = &ДокОтгрузки			
	|	И Ссылка.Проведен	
	|	И Нанесен
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки,
	|	NULL КАК ШтрихКодКоробки
	|ИЗ
	|	Документ.ЛистМаркировки.ШтрихкодыУпаковок
	|ГДЕ 
	|	Ссылка.ДокОснование = &ДокОтгрузки
	|	И Ссылка.Проведен
	|";
	
	Возврат ТекстЗапроса;
КонецФункции // ТекстЗапроса_КМ_ПоЗаданиеНаМаркировку() Экспорт

Функция ТекстЗапроса_КМ_ПоЗаданиеНаСборку() Экспорт
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ	
	|	ШтрихкодУпаковки			КАК ШтрихкодУпаковки,
	|	ШтрихкодКомплекта 			КАК ШтрихкодНабора,
	|	КодКомплектующегоНеНанесен 	КАК КодКомплектующегоНеНанесен	
	|ИЗ 
	|	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка.ДокОснование = &ЗаданиеНаСборку			
	|	И Ссылка.Проведен	
	|	И Ссылка.Завершен	
	|	И ШтрихкодУпаковки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|";		
	
	Возврат ТекстЗапроса;
КонецФункции // ТекстЗапроса_КМ_ПоЗаданиеНаСборку() Экспорт

Функция ТекстЗапроса_КМ_ПоДокументуОтгрузки_ХКМ() Экспорт
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ	
	|	ШтрихкодУпаковки
	|ИЗ 
	|	Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка.ДокОснование = &ДокОтгрузки			
	|	И Ссылка.Проведен	
	|";
	
	Возврат ТекстЗапроса;
КонецФункции // ТекстЗапроса_КМ_ПоДокументуОтгрузки_ХКМ(ПНК_Ссылка) Экспорт

Функция ТекстЗапроса_КМ_ПРМ() Экспорт
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ	
	|	ШтрихкодУпаковки
	|ИЗ 
	|	Документ.ЛистНабора.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка.ДокОснование = &ДокОснование			
	|	И Ссылка.Проведен	
	|";
	
	Возврат ТекстЗапроса;
КонецФункции // ТекстЗапроса_КМ_ПРМ(ПНК_Ссылка) Экспорт

Функция ЗарегистрироватьКодыНаСклад(ХКМ_Ссылка) Экспорт
	Результат 	= МаркировкаКС.СтруктураРезультата(Ложь);
	
	рШапки		= Неопределено;
	Если ЗначениеЗаполнено(ХКМ_Ссылка) Тогда		
		рШапки = ПолучитьРеквизитыШапки(ХКМ_Ссылка, "ПланФакт,Проведен,ДокОснование,ДокОснование.Склад");		
	Иначе
		Результат.Ошибки.Добавить("Недопустимый тип документа: '" + ТипЗнч(ХКМ_Ссылка)+"' !");
	КонецЕсли;
	
	Если рШапки<>Неопределено Тогда
		ТипОснования = ТипЗнч(рШапки.ДокОснование);
		Если НЕ (                                                                        
				ТипОснования = Тип("ДокументСсылка.ПриходнаяНакладная")
				ИЛИ ТипОснования = Тип("ДокументСсылка.ЗаказПоставщику") 
			) Тогда
			Результат.Ошибки.Добавить("Недопустимый тип основания ХКМ: '" + ТипОснования+"' !");
		ИначеЕсли рШапки.ПланФакт <> Перечисления.ПланФакт.План Тогда
			//Результат.Ошибки.Добавить("Регистрация ШК КМ выполняется только для ХКМ 'План' !");
		КонецЕсли;
		
		Если НЕ рШапки.Проведен Тогда
			Результат.Ошибки.Добавить("ХКМ не проведен !");		
		КонецЕсли; 
	КонецЕсли;
	
	Если Результат.Ошибки.Количество() > 0 Тогда
		Возврат Результат;	
	КонецЕсли; 
	
	Склад 		= рШапки.ДокОснование_Склад;
	Если ТипОснования = Тип("ДокументСсылка.ЗаказПоставщику") Тогда		
		УзелСклада	= Маркировка_ПИ.УзелПоКоду("OD7cz", "ДанныеЧЗ");		
	Иначе		
		УзелСклада	= Маркировка_ПИ.УзелСклада(Склад, "ДанныеЧЗ");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(УзелСклада) Тогда
		Результат.Успешно = Ложь;
		Результат.Ошибки.Добавить(СтрШаблон("Невозможно определить узел получатель для склада: '%1' !", Склад));
		Возврат Результат;	
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = " 
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШтрихкодУпаковки
	|ПОМЕСТИТЬ ВТ_ШтрихКоды
	|ИЗ
	|	Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок 
	|ГДЕ	
	|	Ссылка = &ХКМ_Ссылка
	|;	
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки
	|ИЗ
	|	ВТ_ШтрихКоды
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ
	|	ШтрихКод КАК ШтрихкодУпаковки
	|ИЗ	
	|	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды
	|ГДЕ
	|	Ссылка В (ВЫБРАТЬ ШтрихкодУпаковки ИЗ ВТ_ШтрихКоды)
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШтрихкодКоробки	
	|ИЗ
	|	Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок 
	|ГДЕ	
	|	Ссылка = &ХКМ_Ссылка
	|	И ШтрихкодКоробки.ВерсияДанных ЕСТЬ НЕ NULL
	|";
	
	Запрос.УстановитьПараметр("ХКМ_Ссылка", ХКМ_Ссылка);
	
	рЗапроса = Запрос.Выполнить();
	
	мКодов = рЗапроса.Выгрузить().ВыгрузитьКолонку("ШтрихкодУпаковки");
	ОбменДаннымиЧЗ.УстановитьПолучателей(УзелСклада, мКодов);
		
	Результат.Успешно	= Истина;
	Результат.Данные	= УзелСклада;
	Результат.ОбработаноОбъектов = мКодов.Количество();
	
	Возврат Результат; 
КонецФункции //ЗарегистрироватьКодыНаСклад()

Функция ОпределитьОтправителяПолучателя(ДокОснование) Экспорт
	ТипОснования 	= ТипЗнч(ДокОснование);
	
	Отправитель		= Неопределено;
	Получатель		= Неопределено;
	
	ПолучательКонтрагент 	= Неопределено;
	ОтправительКонтрагент 	= Неопределено;
	
	МетаДокОснование = Метаданные.НайтиПоТипу(ТипОснования);
	Если МетаДокОснование <> Неопределено И МаркировкаС.ОбъектСуществует(ДокОснование) Тогда
		ВидОснования = МетаДокОснование.Имя;
		Если ТипОснования = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			Реквизиты = "Контрагент,Склад";
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаданиеНаМаркировку") Тогда
			Реквизиты = "Подразделение,Подразделение";						
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаданиеНаСборкуКомплектовЧЗ") Тогда
			Реквизиты = "Подразделение,Подразделение";
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
			Реквизиты = "Контрагент,Склад";
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
			Реквизиты = "Склад,Контрагент";
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.Перемещение") Тогда
			Реквизиты = "Склад,СкладПолучатель,Склад.КонтрагентДляПеремещений,СкладПолучатель.КонтрагентДляПеремещений";
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.СписаниеТМЦ") Тогда
			Реквизиты = "Склад,СтатьяЗатрат";
		Иначе
			Реквизиты = "";			
		КонецЕсли;
		
		Части = СтрРазделить(Реквизиты, ",");
		Если Части.Количество() >= 2 Тогда			
			Реквизиты = Новый Соответствие;
			Реквизиты[СокрЛП(Части[0])] = "Отправитель";
			Реквизиты[СокрЛП(Части[1])] = "Получатель";
			
			Для Сч = 2 По Части.ВГраница() Цикл
				Реквизиты[Части[Сч]] = СтрЗаменить(Части[Сч], ".", "_"); 			
			КонецЦикла; 
			
			РеквизитыШ = ПолучитьРеквизитыШапки(ДокОснование, Реквизиты); 		
			Если НЕ РеквизитыШ.Свойство("Отправитель") Тогда
				РеквизитыШ.Вставить("Отправитель", РеквизитыШ.Получатель);
			КонецЕсли;
			
			ОтправительКонтрагент	= МаркировкаКС.ПолучитьЗначениеПараметра(РеквизитыШ, "Склад_КонтрагентДляПеремещений");
			ПолучательКонтрагент	= МаркировкаКС.ПолучитьЗначениеПараметра(РеквизитыШ, "СкладПолучатель_КонтрагентДляПеремещений");
			
			Отправитель = ?(ЗначениеЗаполнено(ОтправительКонтрагент),	ОтправительКонтрагент,	РеквизитыШ.Отправитель);
			Получатель 	= ?(ЗначениеЗаполнено(ПолучательКонтрагент),	ПолучательКонтрагент,	РеквизитыШ.Получатель);
			
			Отправитель = ?(ТипЗнч(Отправитель) = Тип("СправочникСсылка.Склады"), Маркировка_ПИ.ФизическоеПодразделениеСклада(Отправитель),	Отправитель);
			Получатель	= ?(ТипЗнч(Получатель)	= Тип("СправочникСсылка.Склады"), Маркировка_ПИ.ФизическоеПодразделениеСклада(Получатель),	Получатель);		
		КонецЕсли;			
	КонецЕсли;
	
	Возврат Новый Структура("Отправитель,Получатель", Отправитель, Получатель);
КонецФункции //ОпределитьОтправителяПолучателя(ДокОснование) Экспорт

#Область СозданиеДокументов

Функция Создать_ХКМ_к_ПНК(ПНК_Ссылка, Знач ЭтоИмпорт = Ложь) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);	
	
	Если ЭтоИмпорт Тогда
		Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			Результат = Создать_ХКМ_к_ПНК_Импорт(ПНК_Ссылка);
		Иначе
			Результат.Ошибки.Добавить("Создавать ХКМ к ПНК по импорту можно только в управляющих подразделениях !");											
		КонецЕсли; 
	Иначе
		Результат = Создать_ХКМ_к_ПНК_Факт(ПНК_Ссылка);
	КонецЕсли; 
	
	Возврат Результат;	
КонецФункции //Создать_ХКМ_к_ПНК(ПНК_Ссылка)

Функция Создать_ХКМ_к_ПНК_Импорт(ПНК_Ссылка) Экспорт
	Результат	= МаркировкаКС.СтруктураРезультата(Ложь);
	
	ТекСтатус	= ПолучитьРеквизитШапки(ПНК_Ссылка, "СостояниеНакладной");
	
	ПланФакт	= Перечисления.ПланФакт.Факт;
	
	Если ТекСтатус = Перечисления.СостоянияНакладной.ВРаботе Тогда
		ТекстОшибки = "Формирование ХКМ невозможно для документа в статусе 'В работе'.";
		Результат.Ошибки.Добавить(ТекстОшибки);
		Возврат Результат;	
	КонецЕсли;
	
	рОчистки = ОчиститьПодчиненныеХКМ(ПНК_Ссылка, ПланФакт);
	Если рОчистки.Успешно Тогда		
		СуществующиеДокументы	= рОчистки.СуществующиеДокументы;		
		ПорцииКодов				= ПолучитьКМпоПНК_Импорт(ПНК_Ссылка);
		
		Сч = 0;
		Для Каждого Порция Из ПорцииКодов Цикл		
			Сч = Сч + 1;		
		
			ДокСсылка = СуществующиеДокументы[Сч];					
			Если ДокСсылка <> Неопределено Тогда
				ДокОбъект = ДокСсылка.ПолучитьОбъект();
			Иначе				
				ДокОбъект = Документы.ХранилищеКодовМаркировки.СоздатьДокумент();
				
				ДокОбъект.Дата	= ТекущаяДата();
				ДокОбъект.Заполнить(Новый Структура("ДокОснование,ТолькоШапка", ПНК_Ссылка, Истина));
			КонецЕсли;			
			
			ДокОбъект.ПланФакт	= Перечисления.ПланФакт.Факт;
			ДокОбъект.Операция	= Перечисления.СкладскиеОперации.Приемка;
			
			ДокОбъект.Товары.Очистить();
			ДокОбъект.ШтрихкодыУпаковок.Очистить();
			
			Для Каждого ШтрихКодУпаковки Из Порция Цикл
				СтрокаТЧ = ДокОбъект.ШтрихкодыУпаковок.Добавить();		
				СтрокаТЧ.ШтрихкодУпаковки = ШтрихКодУпаковки;
			КонецЦикла; 
			
			ДокОбъект.ПометкаУдаления = Ложь;
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;
		КонецЦикла;  			
	Иначе
		Результат.Успешно = Ложь;
		
		Результат.Ошибки.Добавить("Не удалось очистить подчиненные заказы на КМ !");
		МаркировкаКС.ДобавитьОшибки(Результат, рОчистки);
	КонецЕсли;       
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0 И Результат.ОбработаноОбъектов>0);	
	
	Возврат Результат;
	
КонецФункции //Создать_ХКМ_к_ПНК_План(ПНК_Ссылка)

Функция Создать_ХКМ_к_ЗПС_Импорт_ПоОтчетам(ЗПС_Ссылка, ТаблицаАгрегаций) Экспорт
	Результат	= МаркировкаКС.СтруктураРезультата(Ложь);
	
	ТекСостояние= ПолучитьРеквизитШапки(ЗПС_Ссылка, "СостояниеЗаказа");
	
	ПланФакт	= Перечисления.ПланФакт.Факт;
	
	Если ТекСостояние = Перечисления.СостояниеЗаказаПоставщику.ВРаботе Тогда
		ТекстОшибки = "Формирование ХКМ невозможно для документа в статусе 'В работе'.";
		Результат.Ошибки.Добавить(ТекстОшибки);
		Возврат Результат;	
	КонецЕсли;
	
	рОчистки = ОчиститьПодчиненныеХКМ(ЗПС_Ссылка, ПланФакт);
	Если рОчистки.Успешно Тогда		
		СуществующиеДокументы	= рОчистки.СуществующиеДокументы;		
		ПорцииКодов				= ПолучитьКМПоОтчетамОНанесении(ТаблицаАгрегаций);
		
		Сч = 0;
		Для Каждого Порция Из ПорцииКодов Цикл		
			Сч = Сч + 1;		
		
			ДокСсылка = СуществующиеДокументы[Сч];					
			Если ДокСсылка <> Неопределено Тогда
				ДокОбъект = ДокСсылка.ПолучитьОбъект();
			Иначе				
				ДокОбъект = Документы.ХранилищеКодовМаркировки.СоздатьДокумент();
				
				ДокОбъект.Дата	= ТекущаяДата();
				ДокОбъект.Заполнить(Новый Структура("ДокОснование,ТолькоШапка", ЗПС_Ссылка, Истина));
			КонецЕсли;			
			
			ДокОбъект.ПланФакт	= Перечисления.ПланФакт.Факт;
			ДокОбъект.Операция	= Перечисления.СкладскиеОперации.Приемка;
			
			ДокОбъект.Товары.Очистить();
			ДокОбъект.ШтрихкодыУпаковок.Очистить();
			
			Для Каждого ЭлементДанных Из Порция Цикл
				СтрокаТЧ = ДокОбъект.ШтрихкодыУпаковок.Добавить();		
				
				СтрокаТЧ.ШтрихКодКоробки	= ЭлементДанных.ШтрихКодКоробки;
				СтрокаТЧ.ШтрихкодУпаковки	= ЭлементДанных.ШтрихКодУпаковки;
			КонецЦикла; 
			
			ДокОбъект.ПометкаУдаления = Ложь;
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;
		КонецЦикла;  			
	Иначе
		Результат.Успешно = Ложь;
		
		Результат.Ошибки.Добавить("Не удалось очистить подчиненные заказы на КМ !");
		МаркировкаКС.ДобавитьОшибки(Результат, рОчистки);
	КонецЕсли;       
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0 И Результат.ОбработаноОбъектов>0);	
	
	Возврат Результат;
	
КонецФункции //Создать_ХКМ_к_ПНК_План(ПНК_Ссылка)

Функция Создать_ХКМ_к_ПНК_Факт(ПНК_Ссылка) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);		
	
	ТекСтатус = ПолучитьРеквизитШапки(ПНК_Ссылка, "СостояниеНакладной");
	
	Если ТекСтатус = Перечисления.СостоянияНакладной.ВРаботе Тогда
		ТекстОшибки = "Формирование ХКМ невозможно для документа в статусе 'В работе'.";
		Результат.Ошибки.Добавить(ТекстОшибки);
		Возврат Результат;	
	КонецЕсли;
	
	ПланФакт = Перечисления.ПланФакт.Факт;
	
	рОчистки = ОчиститьПодчиненныеХКМ(ПНК_Ссылка, ПланФакт);
	Если рОчистки.Успешно Тогда		
		СуществующиеДокументы	= рОчистки.СуществующиеДокументы;		
		ПорцииКодов				= ПолучитьКМпоЛистамНабора(ПНК_Ссылка);
		
		Сч = 0;
		Для Каждого Порция Из ПорцииКодов Цикл		
			Сч = Сч + 1;		
		
			ДокСсылка = СуществующиеДокументы[Сч];					
			Если ДокСсылка <> Неопределено Тогда
				ДокОбъект = ДокСсылка.ПолучитьОбъект();
			Иначе				
				ДокОбъект = Документы.ХранилищеКодовМаркировки.СоздатьДокумент();
				
				ДокОбъект.Дата	= ТекущаяДата();
				ДокОбъект.Заполнить(Новый Структура("ДокОснование,ТолькоШапка", ПНК_Ссылка, Истина));
			КонецЕсли;
			
			ДокОбъект.ПланФакт	= ПланФакт;
			ДокОбъект.Операция	= Перечисления.СкладскиеОперации.Приемка;
			
			ДокОбъект.Товары.Очистить();
			ДокОбъект.ШтрихкодыУпаковок.Очистить();
			
			Для Каждого ШтрихКодУпаковки Из Порция Цикл
				СтрокаТЧ = ДокОбъект.ШтрихкодыУпаковок.Добавить();		
				СтрокаТЧ.ШтрихкодУпаковки = ШтрихКодУпаковки;
			КонецЦикла; 
			
			ДокОбъект.ПометкаУдаления = Ложь;
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;
		КонецЦикла;  			
	Иначе
		Результат.Успешно = Ложь;
		
		Результат.Ошибки.Добавить("Не удалось очистить подчиненные ХКМ !");
		МаркировкаКС.ДобавитьОшибки(Результат, рОчистки);
	КонецЕсли;       
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0 И Результат.ОбработаноОбъектов>0);	
	
	Возврат Результат;
	
КонецФункции //Создать_ХКМ_к_ПНК_Факт(ПНК_Ссылка)

Функция Создать_ХКМ_к_РНК(РНК_Ссылка, Знач ПланФакт = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);	
	
	Если ПланФакт = Неопределено  Тогда
		ПланФакт = Перечисления.ПланФакт.Факт;	
	КонецЕсли;
	
	ТекСтатус = ПолучитьРеквизитШапки(РНК_Ссылка, "СостояниеНакладной");
	//+HELP-3206 20250312 Михайловский
	//это ремарю, переношу ниже
	//Если ТекСтатус = Перечисления.СостоянияНакладной.ВРаботе Тогда
	//	ТекстОшибки = "Формирование ХКМ невозможно для документа в статусе 'В работе'.";
	//	Результат.Ошибки.Добавить(ТекстОшибки);
	//	Возврат Результат;	
	//КонецЕсли;
	//+HELP-3206 20250312 Михайловский
	// Кухарь А.Ю. 10.03.2025 начало
	//рОчистки = ОчиститьПодчиненныеХКМ(РНК_Ссылка, ПланФакт);
	Операция=Неопределено;
	если ТипЗнч(РНК_Ссылка) = Тип("ДокументСсылка.Перемещение") тогда
		если ЭтоУзелОтправителяПоСкладу(ПолучитьРеквизитШапки(РНК_Ссылка,"Склад","Документ")) тогда
			Операция=Перечисления.СкладскиеОперации.Отгрузка;
		КонецЕсли;
	//+HELP-3206 20250312 Михайловский
	//сюда переношу
	Иначе
		Если ТекСтатус = Перечисления.СостоянияНакладной.ВРаботе Тогда
			ТекстОшибки = "Формирование ХКМ невозможно для документа в статусе 'В работе'.";
			Результат.Ошибки.Добавить(ТекстОшибки);
			Возврат Результат;	
		КонецЕсли;
	//-HELP-3206 20250312 Михайловский	
	КонецЕсли;
	рОчистки = ОчиститьПодчиненныеХКМ(РНК_Ссылка, ПланФакт,Операция);	
	// Кухарь А.Ю. 10.03.2025 конец
	
	
	Если рОчистки.Успешно Тогда		
		СуществующиеДокументы	= рОчистки.СуществующиеДокументы;		
		ПорцииКодов				= ПолучитьКМпоЛистамНабора(РНК_Ссылка);
		
		Сч = 0;
		Для Каждого Порция Из ПорцииКодов Цикл		
			Сч = Сч + 1;		
			
			ДокСсылка = СуществующиеДокументы[Сч];					
			Если ДокСсылка <> Неопределено Тогда
				ДокОбъект = ДокСсылка.ПолучитьОбъект();				
			Иначе				
				ДокОбъект = Документы.ХранилищеКодовМаркировки.СоздатьДокумент();
			
				ДокОбъект.Заполнить(Новый Структура("ДокОснование,ТолькоШапка", РНК_Ссылка, Истина));
			КонецЕсли;			
			// Кухарь А.Ю.   01.10.2025 начало
			// в РГ закрываются ЗСБ и формирование наборов создаётся на эту же дату. Нужно смещение в 1 секунду
			//ДокОбъект.Дата	= ТекущаяДата();
			ДокОбъект.Дата	= ТекущаяДата()+1;
			//  Кухарь А.Ю.  01.10.2025 конец
			
			ДокОбъект.ПланФакт 	= Перечисления.ПланФакт.Факт;
			ДокОбъект.Операция	= Перечисления.СкладскиеОперации.Отгрузка;
			
			ДокОбъект.Товары.Очистить();
			ДокОбъект.ШтрихкодыУпаковок.Очистить();
			
			Для Каждого ШтрихКодУпаковки Из Порция Цикл
				СтрокаТЧ = ДокОбъект.ШтрихкодыУпаковок.Добавить();		
				СтрокаТЧ.ШтрихкодУпаковки = ШтрихКодУпаковки;
			КонецЦикла; 
			
			ДокОбъект.ПометкаУдаления = Ложь;
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;
		КонецЦикла;  			
	Иначе
		Результат.Успешно = Ложь;
		
		Результат.Ошибки.Добавить("Не удалось очистить подчиненные ХКМ !");
		МаркировкаКС.ДобавитьОшибки(Результат, рОчистки);
	КонецЕсли;       
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0 И Результат.ОбработаноОбъектов>0);	
	
	Возврат Результат;
	
КонецФункции //Создать_ХКМ_к_РНК(РНК_Ссылка)

Функция Создать_ХКМ_к_СПН(СПН_Ссылка) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	ПланФакт = Перечисления.ПланФакт.Факт;		
	
	ТекСтатус = ПолучитьРеквизитШапки(СПН_Ссылка, "СостояниеНакладной");
	
	Если ТекСтатус = Перечисления.СостоянияНакладной.ВРаботе Тогда
		ТекстОшибки = "Формирование ХКМ невозможно для документа в статусе 'В работе'.";
		Результат.Ошибки.Добавить(ТекстОшибки);
		Возврат Результат;	
	КонецЕсли;
	
	рОчистки = ОчиститьПодчиненныеХКМ(СПН_Ссылка, ПланФакт);
	Если рОчистки.Успешно Тогда		
		СуществующиеДокументы	= рОчистки.СуществующиеДокументы;		
		ПорцииКодов				= ПолучитьКМпоЛистамНабора(СПН_Ссылка);
		
		Сч = 0;
		Для Каждого Порция Из ПорцииКодов Цикл		
			Сч = Сч + 1;		
		
			ДокСсылка = СуществующиеДокументы[Сч];					
			Если ДокСсылка <> Неопределено Тогда
				ДокОбъект = ДокСсылка.ПолучитьОбъект();
			Иначе				
				ДокОбъект = Документы.ХранилищеКодовМаркировки.СоздатьДокумент();
				
				ДокОбъект.Дата	= ТекущаяДата();
				ДокОбъект.Заполнить(Новый Структура("ДокОснование,ТолькоШапка", СПН_Ссылка, Истина));
			КонецЕсли;			
			
			ДокОбъект.ПланФакт = ПланФакт;
			ДокОбъект.Операция = Перечисления.СкладскиеОперации.Отгрузка;
			
			ДокОбъект.Товары.Очистить();
			ДокОбъект.ШтрихкодыУпаковок.Очистить();
			
			Для Каждого ШтрихКодУпаковки Из Порция Цикл
				СтрокаТЧ = ДокОбъект.ШтрихкодыУпаковок.Добавить();		
				СтрокаТЧ.ШтрихкодУпаковки = ШтрихКодУпаковки;
			КонецЦикла; 
			
			ДокОбъект.ПометкаУдаления = Ложь;
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;
		КонецЦикла;  			
	Иначе
		Результат.Успешно = Ложь;
		
		Результат.Ошибки.Добавить("Не удалось очистить подчиненные ХКМ !");
		МаркировкаКС.ДобавитьОшибки(Результат, рОчистки);
	КонецЕсли;       
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0 И Результат.ОбработаноОбъектов>0);	
	
	Возврат Результат;
	
КонецФункции //Создать_ХКМ_к_СПН(СПН_Ссылка)

Функция Создать_ХКМ_к_ЗМО(ЗМО_Ссылка, ДатаЗМО = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	ТекСтатус = ПолучитьРеквизитШапки(ЗМО_Ссылка, "СостояниеНакладной");
	
	Если ТекСтатус <> Перечисления.СостоянияНакладной.Отгружена Тогда
		ТекстОшибки = СтрШаблон("Формирование ХКМ возможно только для документа в статусе 'Отгружена', текущий статус: %1.", ТекСтатус);
		Результат.Ошибки.Добавить(ТекстОшибки);
		Возврат Результат;	
	КонецЕсли;
	
	ПланФакт = Перечисления.ПланФакт.Факт;
	
	рОчистки = ОчиститьПодчиненныеХКМ(ЗМО_Ссылка, ПланФакт);
	Если рОчистки.Успешно Тогда		
		СуществующиеДокументы	= рОчистки.СуществующиеДокументы;		
		ПорцииКодов				= ПолучитьКМпоЗМО(ЗМО_Ссылка);
		
		Сч = 0;
		Для Каждого Порция Из ПорцииКодов Цикл		
			Сч = Сч + 1;		
		
			ДокСсылка = СуществующиеДокументы[Сч];					
			Если ДокСсылка <> Неопределено Тогда
				ДокОбъект = ДокСсылка.ПолучитьОбъект();
			Иначе				
				ДокОбъект = Документы.ХранилищеКодовМаркировки.СоздатьДокумент();
				
				ДокОбъект.Дата	= ТекущаяДата();
				ДокОбъект.Заполнить(Новый Структура("ДокОснование,ТолькоШапка", ЗМО_Ссылка, Истина));
				Если ЗначениеЗаполнено(ДатаЗМО) Тогда
					ДокОбъект.Дата = ДатаЗМО;				
				КонецЕсли;
			КонецЕсли;			
			
			ДокОбъект.ПланФакт = ПланФакт;
			ДокОбъект.Операция = Перечисления.СкладскиеОперации.Приемка;
			
			ДокОбъект.Товары.Очистить();
			ДокОбъект.ШтрихкодыУпаковок.Очистить();
			
			Для Каждого Коды Из Порция Цикл
				СтрокаТЧ = ДокОбъект.ШтрихкодыУпаковок.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, Коды);
			КонецЦикла; 
			
			ДокОбъект.ПометкаУдаления = Ложь;
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;
		КонецЦикла;  			
	Иначе
		Результат.Успешно = Ложь;
		
		Результат.Ошибки.Добавить("Не удалось очистить подчиненные ХКМ !");
		МаркировкаКС.ДобавитьОшибки(Результат, рОчистки);
	КонецЕсли;       
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0 И Результат.ОбработаноОбъектов>0);	
	
	Возврат Результат;	
КонецФункции //Создать_ХКМ_к_ЗМО(ЗМО_Ссылка)

Функция Создать_ХКМ_к_ЗСБ(ЗСБ_Ссылка, ДатаЗСБ = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);	
	
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);		
	
	ТекСтатус = ПолучитьРеквизитШапки(ЗСБ_Ссылка, "СостояниеНакладной");
	
	Если НЕ (ТекСтатус = Перечисления.СостоянияНакладной.ГотоваКОтгрузке ИЛИ ТекСтатус = Перечисления.СостоянияНакладной.Отгружена) Тогда
		ТекстОшибки = СтрШаблон("Формирование ХКМ возможно только для документа в статусе 'Готова к отгрузке' или 'Отгружена', текущий статус: %1.", ТекСтатус);
		Результат.Ошибки.Добавить(ТекстОшибки);
		Возврат Результат;	
	КонецЕсли;
	
	ПланФакт = Перечисления.ПланФакт.Факт;
	
	рОчистки = ОчиститьПодчиненныеХКМ(ЗСБ_Ссылка, ПланФакт);
	Если рОчистки.Успешно Тогда		
		СуществующиеДокументы	= рОчистки.СуществующиеДокументы;		
		ПорцииКодов				= ПолучитьКМпоЗСБ(ЗСБ_Ссылка);
		
		Сч = 0;
		Для Каждого Порция Из ПорцииКодов Цикл		
			Сч = Сч + 1;		
		
			ДокСсылка = СуществующиеДокументы[Сч];					
			Если ДокСсылка <> Неопределено Тогда
				ДокОбъект = ДокСсылка.ПолучитьОбъект();
			Иначе				
				ДокОбъект = Документы.ХранилищеКодовМаркировки.СоздатьДокумент();
				
				ДокОбъект.Дата	= ТекущаяДата();
				ДокОбъект.Заполнить(Новый Структура("ДокОснование,ТолькоШапка", ЗСБ_Ссылка, Истина));
				Если ЗначениеЗаполнено(ДатаЗСБ) Тогда
					ДокОбъект.Дата = ДатаЗСБ;				
				КонецЕсли;
			КонецЕсли;			
			
			ДокОбъект.ПланФакт = ПланФакт;
			ДокОбъект.Операция = Перечисления.СкладскиеОперации.Приемка;
			
			ДокОбъект.Товары.Очистить();
			ДокОбъект.ШтрихкодыУпаковок.Очистить();
			
			Для Каждого Коды Из Порция Цикл
				СтрокаТЧ = ДокОбъект.ШтрихкодыУпаковок.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, Коды);
			КонецЦикла; 
			
			ДокОбъект.ПометкаУдаления = Ложь;
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;
		КонецЦикла;  			
	Иначе
		Результат.Успешно = Ложь;
		
		Результат.Ошибки.Добавить("Не удалось очистить подчиненные ХКМ !");
		МаркировкаКС.ДобавитьОшибки(Результат, рОчистки);
	КонецЕсли;       
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0 И Результат.ОбработаноОбъектов>0);	
	
	Возврат Результат;	
КонецФункции //Создать_ХКМ_к_ЗМО(ЗМО_Ссылка)

Функция Отменить_ХКМ_к_НАК(Док_Ссылка, ПланФакт) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);	
	
	рОчистки = ОчиститьПодчиненныеХКМ(Док_Ссылка, ПланФакт);
	Если рОчистки.Успешно Тогда			
		Результат.ОбработаноОбъектов = рОчистки.ОбработаноОбъектов;
	Иначе		
		Результат.Успешно = Ложь;
		
		Результат.Ошибки.Добавить("Не удалось очистить подчиненные ХКМ к документу: "+Док_Ссылка);
		МаркировкаКС.ДобавитьОшибки(Результат, рОчистки);
	КонецЕсли;       
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);	
	
	Возврат Результат;
	
КонецФункции //Отменить_ХКМ_к_НАК(Док_Ссылка)

// Кухарь А.Ю. 10.03.2025 начало
//Функция ОчиститьПодчиненныеХКМ(ДокОснование, ПланФакт)
Функция ОчиститьПодчиненныеХКМ(ДокОснование, ПланФакт, Операция=Неопределено)	
// Кухарь А.Ю. 10.03.2025 конец
	
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ХранилищеКодовМаркировки.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ХранилищеКодовМаркировки КАК ХранилищеКодовМаркировки
	|ГДЕ
	|	ХранилищеКодовМаркировки.ДокОснование = &ДокОснование
	|	И ХранилищеКодовМаркировки.Операция = &Операция
	|	И ХранилищеКодовМаркировки.ПланФакт = &ПланФакт";
	// Кухарь А.Ю. 10.03.2025 начало
	если Операция=Неопределено тогда
		запрос.Текст=СтрЗаменить(запрос.Текст,"И ХранилищеКодовМаркировки.Операция = &Операция","");
	иначе
		запрос.УстановитьПараметр("Операция",Операция);
	КонецЕсли;
	// Кухарь А.Ю. 10.03.2025 конец
	
	
	Запрос.УстановитьПараметр("ДокОснование",	ДокОснование);
	Запрос.УстановитьПараметр("ПланФакт",		ПланФакт);
	
	СуществующиеДокументы = Новый Соответствие;
	
	Сч = 1;
		
	НачатьТранзакцию();
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Если ДокОбъект.Проведен Тогда
			ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);		
		КонецЕсли;
		
		ДокОбъект.Товары.Очистить();
		ДокОбъект.ШтрихкодыУпаковок.Очистить();
		ДокОбъект.Проведен			= Ложь;
		ДокОбъект.ПометкаУдаления 	= Истина;
	
		ДокОбъект.Записать();		
		
		СуществующиеДокументы[Сч] = ДокОбъект.Ссылка;
		Сч	= Сч+1;
	КонецЦикла;		
	
	ЗафиксироватьТранзакцию();	

	Результат.Вставить("СуществующиеДокументы", СуществующиеДокументы);

	Возврат Результат;
КонецФункции //ОчиститьПодчиненныеХКМ(ДокОснование)


Функция ПроверитьНаличиеХКМ(ДокОснование, ПланФакт=Неопределено,ОтборПоОтправителю = Неопределено, ОтборПоПолучателю = Неопределено) экспорт
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ первые 1
	|	ХКМ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ХранилищеКодовМаркировки КАК ХКМ
	|ГДЕ
	|	ХКМ.ДокОснование = &ДокОснование
	|	И ХКМ.ПланФакт = &ПланФакт
	|	И ХКМ.Отправитель = &ОтборПоОтправителю
	|	И ХКМ.Получатель = &ОтборПоПолучателю
	|	И ХКМ.Проведен";
	запрос.УстановитьПараметр("ДокОснование",ДокОснование);
	если ПланФакт=Неопределено тогда
		запрос.Текст=СтрЗаменить(Запрос.Текст,"И ХКМ.ПланФакт = &ПланФакт","");
	иначе
		запрос.УстановитьПараметр("ПланФакт",ПланФакт);
	КонецЕсли;                         
	если ОтборПоОтправителю=Неопределено тогда
		запрос.Текст=СтрЗаменить(Запрос.Текст,"И ХКМ.Отправитель = &ОтборПоОтправителю","");
	иначе
		запрос.УстановитьПараметр("ОтборПоОтправителю",ОтборПоОтправителю);
	КонецЕсли;
	
	если ОтборПоПолучателю=Неопределено тогда
		запрос.Текст=СтрЗаменить(Запрос.Текст,"И ХКМ.Получатель = &ОтборПоПолучателю","");
	иначе
		запрос.УстановитьПараметр("ОтборПоПолучателю",ОтборПоПолучателю);
	КонецЕсли;
	результат=запрос.Выполнить().Выбрать();
	пока результат.Следующий() цикл
		возврат Истина;
	КонецЦикла;
	
	Возврат ложь;
	
КонецФункции


#КонецОбласти 


#Область ОбменСФР

 

#КонецОбласти 


// Кухарь А.Ю.  29.03.2025 начало
Функция ТекстЗапроса_КМ_ПоДокументуОтгрузки_ЗСБ() Экспорт
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
				    |	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК как ТипШК,
	               |	"""" КАК НомерЗаказа
	               |ИЗ
	               |	Документ.ЗаданиеНаСборкуКомплектовЧЗ.ШтрихкодыУпаковок КАК ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок
	               |ГДЕ
	               |	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.Ссылка.ДокОснование = &ДокОтгрузки";
	Возврат ТекстЗапроса;
КонецФункции 

Функция ЗарегистрироватьКоробкиНаСклад(ХКМ_Ссылка) Экспорт
	Результат 	= МаркировкаКС.СтруктураРезультата(Ложь);
	
	рШапки		= Неопределено;
	Если ЗначениеЗаполнено(ХКМ_Ссылка) Тогда		
		рШапки = ПолучитьРеквизитыШапки(ХКМ_Ссылка, "ПланФакт,Проведен,ДокОснование,ДокОснование.Склад");		
	Иначе
		Результат.Ошибки.Добавить("Недопустимый тип документа: '" + ТипЗнч(ХКМ_Ссылка)+"' !");
	КонецЕсли;
	
	Если рШапки <> Неопределено Тогда
		ТипОснования = ТипЗнч(рШапки.ДокОснование);
		Если ТипОснования <> Тип("ДокументСсылка.ЗаказПоставщику") Тогда			
			Результат.Ошибки.Добавить("Недопустимый тип основания ХКМ: '" + ТипОснования+"', ожидаемый тип 'ЗаказПоставщику' !");
		ИначеЕсли рШапки.ПланФакт <> Перечисления.ПланФакт.Факт Тогда
			Результат.Ошибки.Добавить("Регистрация ШК КМ выполняется только для ХКМ 'Факт' !");
		КонецЕсли;
		
		Если НЕ рШапки.Проведен Тогда
			Результат.Ошибки.Добавить("ХКМ не проведен !");		
		КонецЕсли; 
	КонецЕсли; 
	
	Если Результат.Ошибки.Количество() > 0 Тогда
		Возврат Результат;	
	КонецЕсли;
	
	УзелСклада	= Маркировка_ПИ.УзелПоКоду("OD7cz", "ДанныеЧЗ");
	
	Если НЕ ЗначениеЗаполнено(УзелСклада) Тогда
		Результат.Успешно = Ложь;
		Результат.Ошибки.Добавить("Невозможно определить узел : 'OD7cz' !");
		Возврат Результат;	
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = " 
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШтрихкодКоробки	КАК КМ
	|ИЗ
	|	Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок 
	|ГДЕ	
	|	Ссылка = &ХКМ_Ссылка
	|	И НЕ ШтрихкодКоробки.ВерсияДанных ЕСТЬ NULL
	|";
	
	Запрос.УстановитьПараметр("ХКМ_Ссылка", ХКМ_Ссылка);
	
	рЗапроса	= Запрос.Выполнить();	
	мКодов		= рЗапроса.Выгрузить().ВыгрузитьКолонку("КМ");	
	
	ОбменДаннымиЧЗ.УстановитьПолучателей(УзелСклада, мКодов);
	
	Результат.Успешно	= Истина;
	Результат.Данные	= УзелСклада;
	Результат.ОбработаноОбъектов = мКодов.Количество();
	
	Возврат Результат; 
КонецФункции //ЗарегистрироватьКоробкиНаСклад()

Функция ПолучитьКМДляПроверки(ДокСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ		
	|	ШтрихкодКоробки.Наименование КАК КМ
	|ИЗ
	|	Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка = &ДокСсылка
	|	И ШтрихкодКоробки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|	И ШтрихкодКоробки.Наименование ЕСТЬ НЕ NULL
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ РАЗЛИЧНЫЕ		
	|	ШтрихкодУпаковки.Наименование КАК КМ
	|ИЗ
	|	Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка = &ДокСсылка
	|	И ШтрихкодУпаковки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)		
	|	И ШтрихкодУпаковки.Наименование ЕСТЬ НЕ NULL
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ РАЗЛИЧНЫЕ		
	|	ШтрихкодНабора.Наименование КАК КМ
	|ИЗ
	|	Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка = &ДокСсылка
	|	И ШтрихкодНабора <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)	
	|	И ШтрихкодНабора.Наименование ЕСТЬ НЕ NULL
	|";
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("КМ");
КонецФункции //ПолучитьКМДляПроверки(ДокСсылка) Экспорт

Функция ПолучитьТаблицуКМДокумента(ДокСсылка, ДопПараметры = Неопределено) Экспорт	
	Запрос = Новый Запрос;
	Запрос.Текст = " 	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ       
	|	ШтрихкодУпаковки
	|ИЗ	
	|	Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка = &ДокСсылка
	|	И (
	|		ШтрихкодУпаковки.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.ЛогистическаяУпаковка)
	|		ИЛИ ШтрихкодУпаковки.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор)
	|	)
	|";
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	мШтрихКоды = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШтрихкодУпаковки");
	
	тШК = Новый ТаблицаЗначений;
	тШК.Колонки.Добавить("ШтрихКодУпаковки", Новый ОписаниеТипов("СправочникСсылка.ШтрихкодыУпаковокТоваров"));

	Для Каждого ШтрихКодУпаковки Из Документы.МаркировкаТоваровИСМП.ПолучитьВложенныеКоды(мШтрихКоды) Цикл
		СтрокаТ = тШК.Добавить();
		СтрокаТ.ШтрихкодУпаковки = ШтрихкодУпаковки;
	КонецЦикла;  
	
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_ШК ИЗ &тШК КАК тШК
	|;                                        
	|ВЫБРАТЬ РАЗЛИЧНЫЕ       
	|	ШтрихкодУпаковки	
	|ИЗ	
	|	Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка = &ДокСсылка
	|	И ШтрихкодУпаковки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)	
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШтрихКодУпаковки КАК ШтрихКодУпаковки
	|ИЗ
	|	ВТ_ШК
	|ГДЕ
	|	ВТ_ШК.ШтрихКодУпаковки ЕСТЬ НЕ NULL 
	|";	
	
	Запрос.УстановитьПараметр("тШК", тШК);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции //ПолучитьТаблицуКМДокумента()
