//////////////////////////////////////////////////////////////////////////////// 
// ПЕРЕМЕННЫЕ МОДУЛЯ 
// 

// Каталог временных файлов
Перем КаталогВременныхФайлов Экспорт;

// Сервер обновлений
Перем СерверОбновлений Экспорт;
Перем КаталогШаблонов Экспорт;
Перем ИмяФайлаСпискаШаблонов Экспорт;

// Доступное обновление
Перем ДоступноеОбновление Экспорт;
Перем ПоследняяВерсияКонфигурации Экспорт;

// Файл обновления
Перем КаталогФайлаОбновления Экспорт;
Перем ИмяФайлаОбновления Экспорт;

// Файл описания обновления
Перем ИмяФайлаОписанияОбновления Экспорт;
Перем ЕстьИнформацияОбОбновлении Экспорт;

// Признак выполнения обновления
Перем ВыполняетсяОбновление Экспорт;

// Обновление конфигурации
Перем КаталогПрограммы;
Перем ИмяФайлаПрограммы;
Перем ПутьКИнформационнойБазе;
Перем ИмяФайлаСлужебныхСообщений;
Перем ИмяФайлаОтчетаОбОбновлении;
Перем ИмяКомандногоФайлаОбновленияКонфигурации;

// Служебные пользователи
Перем ПрефиксИмениПользователя;

// Реклама
Перем ЕстьРеклама;
Перем ФайлАрхиваРекламы;
//Перем ИмяКаталогаРекламы;
Перем ФайлРекламы;

//////////////////////////////////////////////////////////////////////////////// 
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ
// 

// Инициализация экспортных переменных.
//
Процедура ИнициализироватьПеременные() Экспорт

	// Определение каталога временных файлов.
	КаталогВременныхФайлов = КаталогВременныхФайлов();
	
	// Определение каталога программы.
	КаталогПрограммы = КаталогПрограммы();
	
	// Определение пути к информационной базе.
	ПутьКИнформационнойБазе = ПутьКИнформационнойБазе();
	
	// Определение каталога рекламы.
//	ИмяКаталогаРекламы = КаталогВременныхФайлов + Обработки.Обозреватель.Создать().АдресРесурсовОбозревателя();
	
	// Установка признака выполнения обновления.
	ВыполняетсяОбновление = Ложь;

КонецПроцедуры 

// Добавляет перед управляющими символами знак ^
//
// Параметр:
//  ИсходнаяСтрока - строка, которую требуется подготовить для использования
//                 в командной строке.
//
// Возвращаемое значение:
//  Строка - строка, подготовленная для использования в командной строке.
// 
Функция ПодготовитьСтрокуДляКоманднойСтроки(Знач ИсходнаяСтрока) Экспорт
	
	СтрокаРезультат = ИсходнаяСтрока;
	Спецсимволы     = РазложитьСтрокуВМассивПодстрок("( ) < > | & % """, " ");
	
	Для Каждого СпецСимвол Из Спецсимволы Цикл
		
		СтрокаРезультат = СтрЗаменить(СтрокаРезультат, СпецСимвол, "^" + СпецСимвол);
		
	КонецЦикла;
	
	Возврат СтрокаРезультат;
	
КонецФункции // ПодготовитьСтрокуДляКоманднойСтроки()

//////////////////////////////////////////////////////////////////////////////// 
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С РЕКЛАМОЙ
// 

// Распаковка файла рекламы.
//
Процедура РаспаковатьРекламу() Экспорт

	//ПутьКФайлуАрхиваРекламы = ИмяКаталогаРекламы + "\" + ФайлАрхиваРекламы;
	//		
	//Если ФайлСуществует(ПутьКФайлуАрхиваРекламы) Тогда
	//	ЧтениеZip = Новый ЧтениеZipФайла(ПутьКФайлуАрхиваРекламы);
	//	ЧтениеZip.ИзвлечьВсе(ИмяКаталогаРекламы, РежимВосстановленияПутейФайловZIP.Восстанавливать);
	//	УдалитьФайлы(ИмяКаталогаРекламы, "*.zip");
	//КонецЕсли;

КонецПроцедуры // РаспаковатьРекламу() 

//////////////////////////////////////////////////////////////////////////////// 
// ФУНКЦИИ ДЛЯ РАБОТЫ С ОПЕРАЦИОННОЙ СИСТЕМОЙ
// 

// Определение каталога "Мои документы" текущего пользователя Windows
//
Функция КаталогМоиДокументы() Экспорт
	
	WshShell = Новый COMОбъект("WScript.Shell");
	Возврат WshShell.SpecialFolders.Item("MyDocuments");
	
КонецФункции // КаталогМоиДокументы()

//////////////////////////////////////////////////////////////////////////////// 
// ФУНКЦИИ ДЛЯ РАБОТЫ С ФАЙЛАМИ
// 

// Проверка существования файла или каталога.
//
// Параметр:
//  ПутьКФайлу   - Строка - путь к файлу или каталогу, существование которого
//                 нужно проверить.
//
// Возвращаемое значение:
//  Булево - признак существования файла или каталога.
//
Функция ФайлСуществует(ПутьКФайлу) Экспорт
	
	Файл = Новый Файл(ПутьКФайлу);
	
	Возврат Файл.Существует();
	
КонецФункции // ФайлСуществует()

//////////////////////////////////////////////////////////////////////////////// 
// ФУНКЦИИ ДЛЯ РАБОТЫ С ИНТЕРНЕТОМ
// 

// Выполнение соединения с сервером обновлений.
//
// Возвращаемое значение:
//  HTTPсоединение
//
Функция СоединениеССерверомОбновлений()
	
	// Установка параметров прокси-сервера
	Если ПроксиСерверТребуетАутентификации Тогда
		ПроксиСервер = Новый ИнтернетПрокси();
		ПроксиСервер.Пользователь = ПользовательПроксиСервера;
		ПроксиСервер.Пароль       = ПарольПроксиСервера;
	КонецЕсли;
	
	// Создание HTTP-соединения с сервером обновлений
	Соединение = Новый HTTPСоединение(СерверОбновлений,
	                                  ,
	                                  КодПользователяСервераОбновлений,
	                                  ПарольСервераОбновлений,
	                                  ?(ПроксиСерверТребуетАутентификации, ПроксиСервер, Неопределено));
	
	Возврат Соединение;								  
	
КонецФункции // СоединениеССерверомОбновлений()

// Получение файла с сервера.
//
// Параметры:
//  Адрес        - адрес файла на сервере
//  ЛокальныйПуть - путь для сохранения файла на локальном компьютере
//  ВыдаватьСообщения - признак необходимости выдачи сообщений в случае ошибки
//                      (необязательный, по умолчаню равен Истина)
//
// Возвращаемое значение:
//  Булево - результат получения файла с сервера
//
Функция ПолучитьФайлССервера(Адрес, ЛокальныйПуть, ВыдаватьСообщения = Истина) Экспорт
	
	Если ЗначениеНеЗаполнено(Адрес) ИЛИ ЗначениеНеЗаполнено(ЛокальныйПуть) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Соединение = УстановитьFTPСоединение(СерверОбновлений,КодПользователяСервераОбновлений,ПарольСервераОбновлений);
	Если Соединение=Неопределено Тогда Возврат Ложь КонецЕсли; 
	
	Попытка
	
		Соединение.Получить(Адрес, ЛокальныйПуть);

	Исключение
		
		Если НЕ (Найти(ОписаниеОшибки(), "401") = 0) Тогда
			
			Если ВыдаватьСообщения Тогда 
				ПредупреждениеОбОшибке("Неправильно указан код пользователя или пароль.");
			КонецЕсли;
			
			Возврат Ложь;
			
		КонецЕсли;
		
		Если ВыдаватьСообщения Тогда 
			СообщитьОбОшибке("Ошибка при обращении к " + Соединение.Сервер + "/" + Адрес + "
		    	             |" + ОписаниеОшибки());
		КонецЕсли;					 
	
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции // ПолучитьФайлССервера()

// Получение файла описания обновления с сервера.
//
Функция ПолучитьФайлОписанияОбновления(ДоступноеОбновление) Экспорт
	
	Если ДоступноеОбновление = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ПолучитьФайлССервера(КаталогШаблонов +  "/" + СтрЗаменить(ДоступноеОбновление.ПутьКФайлуОбновления, ИмяФайлаОбновления, "") + ИмяФайлаОписанияОбновления,
	                             КаталогВременныхФайлов + ИмяФайлаОписанияОбновления);
	
	
КонецФункции // ПолучитьФайлОписанияОбновления()

// Получение файла списка шаблонов с сервера.
//
Функция ПолучитьФайлСпискаШаблонов(ВыдаватьСообщения = Истина) Экспорт
	
	Возврат ПолучитьФайлССервера(КаталогШаблонов + "/" + ИмяФайлаСпискаШаблонов,
	                             КаталогВременныхФайлов + ИмяФайлаСпискаШаблонов, 
	                             ВыдаватьСообщения);
	
КонецФункции // ПолучитьФайлОписанияОбновления()

// Получение каталога файла обновления.
//
// Параметр:
//  ДоступноеОбновление - Строка таблицы значений, содержащая информацию о
//                        доступном обновлении.
// 
// Возвращаемое значение:
//  Строка - каталог файла обновления.
//
Функция ПолучитьКаталогФайлаОбновления(ДоступноеОбновление) Экспорт
	
	Если ДоступноеОбновление = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СтрЗаменить(СтрЗаменить(КаталогПрограммы, "bin", КаталогШаблонов) + СтрЗаменить(ДоступноеОбновление.ПутьКФайлуОбновления, ИмяФайлаОбновления, ""), "/", "\");
	
КонецФункции // ПолучитьПутьКФайлуОбновления()

// Создание таблицы значений для хранения списка файлов, которые нужно получить
// с сервера.
//
// Парметры:
//  Нет.
//
// Возвращаемое значение:
//  ТаблицаЗначений
//
Функция СоздатьТаблицуСписокФайлов()
	
	СписокФайлов = Новый ТаблицаЗначений;
	СписокФайлов.Колонки.Добавить("Адрес");
	СписокФайлов.Колонки.Добавить("ЛокальныйПуть");
	СписокФайлов.Колонки.Добавить("Обязательный"); // файл обязателен к получению
	СписокФайлов.Колонки.Добавить("Получен");      // признак успешного получения файла
	
	Возврат СписокФайлов;
	
КонецФункции // СоздатьТаблицуСписокФайлов()

// Получение файлов обновления и рекламы с сервера.
//
Функция ПолучитьФайлыССервера() Экспорт

	ПолучатьФайлы = Истина;
	
	Если ФайлСуществует(КаталогФайлаОбновления + ИмяФайлаОбновления) Тогда
		
	    Если ВопросДаНет("В каталоге шаблонов обнаружен файл обновления конфигурации.
	                     |Возможно, он был получен ранее.
	                     |
	                     |Получить файл обновления конфигурации повторно?") Тогда
				
			ПолучатьФайлы = Истина;
			
		Иначе
			
			ПолучатьФайлы = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПолучатьФайлы Тогда 				
		
		СписокФайлов = СоздатьТаблицуСписокФайлов();
		
		// Создание каталога для сохранения файла обновления.
		СоздатьКаталог(КаталогФайлаОбновления);
		
		// Описание файла обновления.
		НовыйФайл = СписокФайлов.Добавить();
		НовыйФайл.Адрес         = КаталогШаблонов + "/" + ДоступноеОбновление.ПутьКФайлуОбновления;
		НовыйФайл.ЛокальныйПуть = КаталогФайлаОбновления + ИмяФайлаОбновления;
		НовыйФайл.Обязательный  = Истина;
		
		// Создание каталога для хранения рекламы.
		//СоздатьКаталог(ИмяКаталогаРекламы);
		//УдалитьФайлы(ИмяКаталогаРекламы, "*.*");
		
		// Архив рекламы ФайлАрхиваРекламы лежит "рядом" с обновлением конфигурации.
		Поз = Найти(ДоступноеОбновление.ПутьКФайлуОбновления, СтрЗаменить(ДоступноеОбновление.Версия, ".", "_"));
		
		//// Описание файла рекламы
		//НовыйФайл = СписокФайлов.Добавить();
		//НовыйФайл.Адрес         = КаталогШаблонов + "/" + Лев(ДоступноеОбновление.ПутьКФайлуОбновления, Поз-1) + ФайлАрхиваРекламы;
		//НовыйФайл.ЛокальныйПуть = ИмяКаталогаРекламы + "\" + ФайлАрхиваРекламы;
		//НовыйФайл.Обязательный  = Ложь;
		
		// Получение файлов
		Форма = ПолучитьФорму("ПолучениеОбновления");
		Форма.КодПользователя  = КодПользователяСервераОбновлений;
		Форма.Пароль           = ПарольСервераОбновлений;
		Форма.СерверОбновлений = СерверОбновлений;
		Форма.СписокФайлов     = СписокФайлов;
		СписокПолученныхФайлов = Форма.ОткрытьМодально();
		
		// Проверка, все ли обязательные к получению файлы были получены
		РезультатПолученияФайлов = Истина;
		Для Каждого Файл Из СписокПолученныхФайлов Цикл
			Если Файл.Обязательный И НЕ Файл.Получен Тогда
				РезультатПолученияФайлов = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Возврат РезультатПолученияФайлов;
		
	Иначе
		
		Возврат Истина;
		
	КонецЕсли;
			
КонецФункции // ПолучитьОбновлениеИзИнтернета()

//////////////////////////////////////////////////////////////////////////////// 
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ СО СПИСКОМ ДОСТУПНЫХ ОБНОВЛЕНИЙ
// 

// Загрузка списка обновлений из файла XML
//
Функция ВыполнитьЗагрузкуСпискаОбновлений(ИмяФайлаЗагрузки)
	
	СообщениеОбОшибке = "Ошибка при чтении файла списка обновлений.";
	
	Если НЕ ФайлСуществует(ИмяФайлаЗагрузки) Тогда
		ПредупреждениеОбОшибке(СообщениеОбОшибке);
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		
		ТаблицаЗначений = Новый ТаблицаЗначений;		
		ТаблицаЗначений.Колонки.Добавить("Конфигурация",          ПолучитьОписаниеТиповСтроки(0));
		ТаблицаЗначений.Колонки.Добавить("Поставщик",             ПолучитьОписаниеТиповСтроки(0));
		ТаблицаЗначений.Колонки.Добавить("Версия",                ПолучитьОписаниеТиповСтроки(0));
		ТаблицаЗначений.Колонки.Добавить("ВерсияДляОбновления",   ПолучитьОписаниеТиповСтроки(0));
		ТаблицаЗначений.Колонки.Добавить("ПутьКФайлуОбновления",  ПолучитьОписаниеТиповСтроки(0));
		ТаблицаЗначений.Колонки.Добавить("РазмерФайлаОбновления", ПолучитьОписаниеТиповЧисла(15, 0));
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ИмяФайлаЗагрузки);
		ЧтениеXML.Прочитать(); // <?xml version="1.0" encoding="UTF-8" ?> 
		
		// Дата формирования файла.
		ЧтениеXML.Прочитать();
		ЧтениеXML.Прочитать();
		ДатаФормирования = ЧтениеXML.Значение;
		ЧтениеXML.Прочитать();
		
		// Читаем начало элемента Update или конец элемента UpdateList.
		Пока ЧтениеXML.Прочитать() Цикл
			
			Если ЧтениеXML.Имя = "v8u:updateList" Тогда
				Прервать;					
			Иначе		
				
				Конфигурация = ЧтениеXML.ПолучитьАтрибут("configuration");
				
				Пока ЧтениеXML.Прочитать() Цикл
					
					Если ЧтениеXML.Имя = "v8u:update" Тогда
						Прервать;					
					Иначе		
						
						Если ЧтениеXML.Имя = "v8u:vendor" Тогда
							ЧтениеXML.Прочитать();
							Поставщик = ЧтениеXML.Значение;							
						ИначеЕсли ЧтениеXML.Имя = "v8u:version" Тогда
							ЧтениеXML.Прочитать();
							Версия = ЧтениеXML.Значение;
						ИначеЕсли ЧтениеXML.Имя = "v8u:file" Тогда
							ЧтениеXML.Прочитать();
							ПутьКФайлуОбновления = ЧтениеXML.Значение;
						ИначеЕсли ЧтениеXML.Имя = "v8u:size" Тогда
							ЧтениеXML.Прочитать();
							РазмерФайлаОбновления = ЧтениеXML.Значение;
						ИначеЕсли ЧтениеXML.Имя = "v8u:target" Тогда
							ЧтениеXML.Прочитать();
							НоваяСтрока = ТаблицаЗначений.Добавить();
							НоваяСтрока.Конфигурация          = Конфигурация;
							НоваяСтрока.Поставщик             = Поставщик;
							НоваяСтрока.Версия                = Версия;
							НоваяСтрока.ВерсияДляОбновления	  = ЧтениеXML.Значение;
							НоваяСтрока.ПутьКФайлуОбновления  = ПутьКФайлуОбновления;
							НоваяСтрока.РазмерФайлаОбновления = РазмерФайлаОбновления;
						КонецЕсли;
						
						ЧтениеXML.Прочитать();
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Исключение
		
		ПредупреждениеОбОшибке(СообщениеОбОшибке);
		Возврат Неопределено;
		
	КонецПопытки;
		
	Возврат ТаблицаЗначений;	
	
КонецФункции // ВыполнитьЗагрузкуСпискаОбновлений()

// Определение последней версии конфигурации и доступного для неее обновления в 
// списке обновлений
//
Процедура ОпределитьПоследнююВерсиюКонфигурацииИДоступноеОбновление(ПоследняяВерсияКонфигурации, ДоступноеОбновление) Экспорт
	
	ПутьКФайлуСпискаОбновлений = КаталогВременныхФайлов + ИмяФайлаСпискаШаблонов;
	
	ТаблицаОбновлений = ВыполнитьЗагрузкуСпискаОбновлений(ПутьКФайлуСпискаОбновлений);
	
	Если ТаблицаОбновлений = Неопределено Тогда // ошибки при чтении файла
		Возврат;		
   	КонецЕсли;
	
	ТаблицаОбновленийКонфигурации = Новый ТаблицаЗначений();
	ТаблицаОбновленийКонфигурации.Колонки.Добавить("Конфигурация",         ПолучитьОписаниеТиповСтроки(0));
	ТаблицаОбновленийКонфигурации.Колонки.Добавить("Поставщик",            ПолучитьОписаниеТиповСтроки(0));
	ТаблицаОбновленийКонфигурации.Колонки.Добавить("Версия",               ПолучитьОписаниеТиповСтроки(0));
	ТаблицаОбновленийКонфигурации.Колонки.Добавить("Версия1Разряд",        ПолучитьОписаниеТиповЧисла(3));
	ТаблицаОбновленийКонфигурации.Колонки.Добавить("Версия2Разряд",        ПолучитьОписаниеТиповЧисла(3));
	ТаблицаОбновленийКонфигурации.Колонки.Добавить("Версия3Разряд",        ПолучитьОписаниеТиповЧисла(3));
	ТаблицаОбновленийКонфигурации.Колонки.Добавить("Версия4Разряд",        ПолучитьОписаниеТиповЧисла(3));
	ТаблицаОбновленийКонфигурации.Колонки.Добавить("ВерсияДляОбновления",  ПолучитьОписаниеТиповСтроки(0));
	ТаблицаОбновленийКонфигурации.Колонки.Добавить("ПутьКФайлуОбновления", ПолучитьОписаниеТиповСтроки(0));
	
	ТаблицаДоступныхОбновленийКонфигурации = ТаблицаОбновленийКонфигурации.Скопировать();
	
	// Определение последней версии конфигурации.
	Отбор = Новый Структура("Конфигурация, Поставщик", Метаданные.Имя, Метаданные.Поставщик);
							
	МассивДоступныхОбновлений = ТаблицаОбновлений.НайтиСтроки(Отбор);
	
	Для Каждого Обновление Из МассивДоступныхОбновлений Цикл
		
		НоваяСтрока = ТаблицаОбновленийКонфигурации.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Обновление);
		
		НомерВерсии = РазложитьСтрокуВМассивПодстрок(Обновление.Версия, ".");
		
		НоваяСтрока.Версия1Разряд = Число(НомерВерсии[0]);
		НоваяСтрока.Версия2Разряд = Число(НомерВерсии[1]);
		НоваяСтрока.Версия3Разряд = Число(НомерВерсии[2]);
		НоваяСтрока.Версия4Разряд = Число(НомерВерсии[3]);
		
	КонецЦикла;
	
	ТаблицаОбновленийКонфигурации.Сортировать("Версия1Разряд Убыв,
	                                          |Версия2Разряд Убыв,
	                                          |Версия3Разряд Убыв,
	                                          |Версия4Разряд Убыв");
	
	ПоследняяВерсияКонфигурации = ?(ТаблицаОбновленийКонфигурации.Количество() = 0, Неопределено, ТаблицаОбновленийКонфигурации[0].Версия);
	
	// Поиск доступного обновления.
	Отбор = Новый Структура("ВерсияДляОбновления", Метаданные.Версия);
	
	МассивДоступныхОбновлений = ТаблицаОбновленийКонфигурации.НайтиСтроки(Отбор);
	
	Для Каждого Обновление Из МассивДоступныхОбновлений Цикл
		
		НоваяСтрока = ТаблицаДоступныхОбновленийКонфигурации.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Обновление);
		
		НомерВерсии = РазложитьСтрокуВМассивПодстрок(Обновление.Версия, ".");
		
		НоваяСтрока.Версия1Разряд = Число(НомерВерсии[0]);
		НоваяСтрока.Версия2Разряд = Число(НомерВерсии[1]);
		НоваяСтрока.Версия3Разряд = Число(НомерВерсии[2]);
		НоваяСтрока.Версия4Разряд = Число(НомерВерсии[3]);
		
	КонецЦикла;
	
	ТаблицаДоступныхОбновленийКонфигурации.Сортировать("Версия1Разряд Убыв,
	                                                   |Версия2Разряд Убыв,
	                                                   |Версия3Разряд Убыв,
	                                                   |Версия4Разряд Убыв");
	
	ДоступноеОбновление = ?(ТаблицаДоступныхОбновленийКонфигурации.Количество() = 0, Неопределено, ТаблицаДоступныхОбновленийКонфигурации[0]);

КонецПроцедуры // ОпределитьПоследнююВерсиюКонфигурацииИДоступноеОбновление()

//////////////////////////////////////////////////////////////////////////////// 
// ФУНКЦИИ ДЛЯ РАБОТЫ С ИНФОРМАЦИОННОЙ БАЗОЙ
// 

// Определение пути к информационной базе
//
Функция ПутьКИнформационнойБазе() Экспорт
	
	СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	
	ПозицияПоиска = Найти(Врег(СтрокаСоединения), "FILE=");
	
	Если ПозицияПоиска = 1 Тогда // файловая ИБ
		
		ПутьКИБ = "/F"+Сред(СтрокаСоединения, 6, СтрДлина(СтрокаСоединения) - 6);
		
	Иначе
		
		ПозицияПоиска = Найти(Врег(СтрокаСоединения), "SRVR=");
		
		Если НЕ (ПозицияПоиска = 1) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ПозицияТочкиСЗапятой = Найти(СтрокаСоединения, ";");
		НачальнаяПозицияКопирования = 6 + 1;
		КонечнаяПозицияКопирования = ПозицияТочкиСЗапятой - 2; 
		
		ИмяСервера = Сред(СтрокаСоединения, НачальнаяПозицияКопирования, КонечнаяПозицияКопирования - НачальнаяПозицияКопирования + 1);
		
		СтрокаСоединения = Сред(СтрокаСоединения, ПозицияТочкиСЗапятой + 1);
		
		// позиция имени сервера
		ПозицияПоиска = Найти(Врег(СтрокаСоединения), "REF=");
		
		Если НЕ (ПозицияПоиска = 1) Тогда
			Возврат Неопределено;
		КонецЕсли;
				
		НачальнаяПозицияКопирования = 6;
		ПозицияТочкиСЗапятой = Найти(СтрокаСоединения, ";");
		КонечнаяПозицияКопирования = ПозицияТочкиСЗапятой - 2; 
		
		ИмяИБНаСервере = Сред(СтрокаСоединения, НачальнаяПозицияКопирования, КонечнаяПозицияКопирования - НачальнаяПозицияКопирования + 1);
		
		ПутьКИБ = "/S"+"""" + ИмяСервера + "\" + ИмяИБНаСервере + """";
		
	КонецЕсли;
	
	Возврат ПутьКИБ;
	
КонецФункции // ПутьКИнформационнойБазе()

//////////////////////////////////////////////////////////////////////////////// 
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С СОЕДИНЕНИЯМИ ИНФОРМАЦИОННОЙ БАЗЫ
// 

// Проверка наличия активных соединений с информационной базой.
//
// Возвращаемое значение:
//  Булево       - Истина, если соединения есть,
//                 Ложь, если соединений нет.
//
Функция НаличиеАктивныхСоединений() Экспорт
	
	МассивСоединений = ПолучитьСоединенияИнформационнойБазы();
	
	Если МассивСоединений.Количество() > 1 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // НаличиеАктивныхСоединений()

// Проверка наличия соединения конфигуратором.
//
// Возвращаемое значение:
//  Булево       - Истина, если соединение есть,
//                 Ложь, если соединения нет.
//
Функция НаличиеСоединенияКонфигуратором() Экспорт
	
	МассивСоединений = ПолучитьСоединенияИнформационнойБазы();
	
	Для Каждого Соединение Из МассивСоединений Цикл
		
		Если Соединение.ИмяПриложения = "Config" Тогда 
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции // НаличиеСоединенияКонфигуратором()

// Проверка необходимости изменения режима заверешения работы пользователей.
//
// Возвращаемое значение:
//  Булево.
//
Функция НеобходимоИзменятьРежимЗавершенияРаботыПользователей()
	
	// Если нет ни одного пользователя, устанавливать режим завершения работы не нужно.
	Если (ПользователиИнформационнойБазы_ПолучитьПользователей().Количество() = 0) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	// Проверка, есть ли у пользователя права на изменение режима завершения работы пользователей.
	Если НЕ (Метаданные.Роли.Найти("ПравоЗавершенияРаботыПользователей") = Неопределено) Тогда
		
		Возврат РольДоступна("ПравоЗавершенияРаботыПользователей");
		
	Иначе
		
		Возврат ПравоДоступа("Изменение", Метаданные.Константы.РежимЗавершенияРаботыПользователей);
		
	КонецЕсли;
	
КонецФункции // НеобходимоИзменятьРежимЗавершенияРаботыПользователей()

// Установка режима завершения работы пользователей
//
Процедура УстановитьРежимЗавершенияРаботыПользователейДляОбновления(Знач Режим = Неопределено) Экспорт
	
	Если НЕ НеобходимоИзменятьРежимЗавершенияРаботыПользователей() Тогда
		Возврат;
	КонецЕсли;
	
	// Если режим не определен, делается попытка установить режим заверешния работы
	// с сохранением данных пользователей.
	Если Режим = Неопределено Тогда
	
		Если НЕ (Метаданные.Перечисления.РежимыЗавершенияРаботыПользователей.ЗначенияПеречисления.Найти("ЗавершитьССохранениемДанныхПользователей") = Неопределено) Тогда
			
			Режим = Перечисления.РежимыЗавершенияРаботыПользователей.ЗавершитьССохранениемДанныхПользователей;
			
		ИначеЕсли НЕ (Метаданные.Перечисления.РежимыЗавершенияРаботыПользователей.ЗначенияПеречисления.Найти("ЗавершитьССохранениемДанныхПользователя") = Неопределено) Тогда
			
			Режим = Перечисления.РежимыЗавершенияРаботыПользователей.ЗавершитьССохранениемДанныхПользователя;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Константы.РежимЗавершенияРаботыПользователей.Установить(Режим);
	
КонецПроцедуры // УстановитьРежимЗавершенияРаботыПользователейДляОбновления()

//////////////////////////////////////////////////////////////////////////////// 
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ СО СПИСКОМ ПОЛЬЗОВАТЕЛЕЙ
// 

// Получение параметров аутентификации пользователя для обновления.
// Создает виртуального пользователя, если в этом есть необходимость.
//
// Возвращаемое значение
//  Строка       - Имя созданного виртуального пользователя
//
Функция ПолучитьПараметрыАутентификацииПользователяДляОбновления() Экспорт

	//// Если пользователей нет, можно обновляться без указания пользователя.
	//Если (ПользователиИнформационнойБазы_ПолучитьПользователей().Количество() = 0) Тогда
	//				
	//	Возврат "";
	//	
	//КонецЕсли;
	//
	//// Если у текущего пользователя Windows-авторизация, нужно явно указать на нее.
	//Если ПользователиИнформационнойБазы_ТекущийПользователь().АутентификацияОС Тогда
	//				
	//	Возврат "/WA+";
	//	
	//КонецЕсли;
	//
	//// Если у текущего пользователя не задан пароль, можно указать только имя пользователя.
	//Если НЕ (ПользователиИнформационнойБазы_ТекущийПользователь().ПарольУстановлен) Тогда
	//				
	//	Возврат "/N""" + ИмяПользователя() + """";
	//	
	//КонецЕсли;
	
	// Создание служебного пользователя.
	ИмяПользователя = ПрефиксИмениПользователя + Строка(Новый УникальныйИдентификатор());
					
	Пока НЕ (ПользователиИнформационнойБазы_НайтиПоИмени(ИмяПользователя) = Неопределено) Цикл
		ИмяПользователя = ПрефиксИмениПользователя + Строка(Новый УникальныйИдентификатор());
	КонецЦикла;
	
	ПарольПользователя = Строка(Новый УникальныйИдентификатор());
					
	ПользователиИнформационнойБазы_СоздатьПользователя(ИмяПользователя,ПарольПользователя);	
	
	Возврат "/N""" + ИмяПользователя + """ /P""" + ПарольПользователя + """";				
КонецФункции // СоздатьВирутальногоПользователя()

//////////////////////////////////////////////////////////////////////////////// 
// ПРОЦЕДУРЫ ОБНОВЛЕНИЯ КОНФИГУРАЦИИ
// 

// Резервное копирование и обновление конфигурации
//
Процедура ВыполнитьОбновлениеКонфигурации() Экспорт
	
	ПутьКФайлуСлужебныхСообщений     = """" + КаталогВременныхФайлов + ИмяФайлаСлужебныхСообщений + """";
	ПутьКФайлуОтчетаОбОбновлении     = """" + КаталогВременныхФайлов + ИмяФайлаОтчетаОбОбновлении + """";
	ПутьКФайлуОбновленияКонфигурации = """" + КаталогФайлаОбновления + ИмяФайлаОбновления + """";
	ПутьКПрограмме                   = """" + КаталогПрограммы + ИмяФайлаПрограммы + """"; 
	ФайлРезервнойКопии               = """" + КаталогРезервногоКопирования + "\" + Метаданные.Имя + "_" + СтрЗаменить(Метаданные.Версия, ".", "_") + "_" + Формат(ТекущаяДата(), "ДФ=yyyy_MM_dd_HH_mm_ss") + ".dt" + """";
	
	ПараметрыАутентификацииПользователяДляОбновления = ПолучитьПараметрыАутентификацииПользователяДляОбновления();
	
	ПараметрыАутентификацииПользователя = ?((ПользователиИнформационнойБазы_ПолучитьПользователей().Количество() = 0)
	                                        ИЛИ (ПользователиИнформационнойБазы_ТекущийПользователь().АутентификацияОС),
	                                        "",
	                                        "/N""" + ИмяПользователя() + """");
											
	ТекстКомандногоФайла = Новый ТаблицаЗначений();
	ТекстКомандногоФайла.Колонки.Добавить("Текст");
	ТекстКомандногоФайла.Колонки.Добавить("Кодировка");
	
	РазделительОтчета = "-------------------------------------------------------------------------------";
	
	ФрагментТекста = ТекстКомандногоФайла.Добавить();
	ФрагментТекста.Кодировка = КодировкаТекста.OEM;
	ФрагментТекста.Текст = 
	"@echo off
	|color F1
	|";
	
	// Реклама.
	//ПутьКФайлуРекламы = ИмяКаталогаРекламы + "\" + ФайлРекламы;
	//
	//Если ФайлСуществует(ПутьКФайлуРекламы) Тогда
	//	
	//	ФрагментТекста = ТекстКомандногоФайла.Добавить();
	//	ФрагментТекста.Кодировка = КодировкаТекста.OEM;
	//	ФрагментТекста.Текст = 
	//	"start """" """ + ПутьКФайлуРекламы + """
	//	|";
	//	
	//КонецЕсли;
	
	ФрагментТекста = ТекстКомандногоФайла.Добавить();
	ФрагментТекста.Кодировка = КодировкаТекста.OEM;
	ФрагментТекста.Текст = 
	"echo " + ПодготовитьСтрокуДляКоманднойСтроки(РазделительОтчета) + "
	|echo ВЫПОЛНЯЕТСЯ ОБНОВЛЕНИЕ КОНФИГУРАЦИИ
	|echo " + ПодготовитьСтрокуДляКоманднойСтроки(РазделительОтчета) + "
	|echo Этот процесс может занять продолжительное время.
	|echo Пожалуйста, подождите...
	|";
	
	ФрагментТекста = ТекстКомандногоФайла.Добавить();
	ФрагментТекста.Кодировка = КодировкаТекста.ANSI;
	ФрагментТекста.Текст = 
	"(echo " + ПодготовитьСтрокуДляКоманднойСтроки(РазделительОтчета) + " & " +
	"echo ОТЧЕТ ОБ ОБНОВЛЕНИИ КОНФИГУРАЦИИ %date% %time% & " +
	"echo " + ПодготовитьСтрокуДляКоманднойСтроки(РазделительОтчета) + " & " +
	"echo Информационная база: " + ПодготовитьСтрокуДляКоманднойСтроки(ПутьКИнформационнойБазе) + ")>";
	ФрагментТекста = ТекстКомандногоФайла.Добавить();
	ФрагментТекста.Кодировка = КодировкаТекста.OEM;
	ФрагментТекста.Текст     = ПутьКФайлуОтчетаОбОбновлении + Символы.ПС;
	
	Если СоздатьРезервнуюКопиюИнформационнойБазы Тогда
		
		ФрагментТекста = ТекстКомандногоФайла.Добавить();
		ФрагментТекста.Кодировка = КодировкаТекста.OEM;
		ФрагментТекста.Текст = 
		"echo.
		|echo Выполняется создание резервной копии информационной базы.
		|echo Начало операции:    %time%
		|";                                       
		
		ФрагментТекста = ТекстКомандногоФайла.Добавить();
		ФрагментТекста.Кодировка = КодировкаТекста.ANSI;
		ФрагментТекста.Текст = 
		"(echo. & " +
		"echo Операция: Создание резервной копии информационной базы & " +
		"echo " + ПодготовитьСтрокуДляКоманднойСтроки(РазделительОтчета) + " & " +
		"echo Информационная база: " + ПодготовитьСтрокуДляКоманднойСтроки(ПутьКИнформационнойБазе) + " & " +
		"echo Начало операции:     %time%)>>";
		ФрагментТекста = ТекстКомандногоФайла.Добавить();
		ФрагментТекста.Кодировка = КодировкаТекста.OEM;
		ФрагментТекста.Текст     = ПутьКФайлуОтчетаОбОбновлении + Символы.ПС;

		ФрагментТекста = ТекстКомандногоФайла.Добавить();
		ФрагментТекста.Кодировка = КодировкаТекста.OEM;
		ФрагментТекста.Текст = 
		"start """" /wait " + ПутьКПрограмме + " CONFIG " + ПутьКИнформационнойБазе + ПараметрыАутентификацииПользователяДляОбновления + " /DumpIB" + ФайлРезервнойКопии + " /Out" + ПутьКФайлуСлужебныхСообщений + " /DisableStartupMessages
		|if errorlevel 1 goto on_error
		|echo Окончание операции: %time%
		|echo Создание резервной копии успешно завершено.
		|";
		
		ФрагментТекста = ТекстКомандногоФайла.Добавить();
		ФрагментТекста.Кодировка = КодировкаТекста.ANSI;
		ФрагментТекста.Текст = 
		"(echo Окончание операции:  %time% & " + 
		"echo Результат операции:)>>";
		ФрагментТекста = ТекстКомандногоФайла.Добавить();
		ФрагментТекста.Кодировка = КодировкаТекста.OEM;
		ФрагментТекста.Текст     = ПутьКФайлуОтчетаОбОбновлении + Символы.ПС;
		
		ФрагментТекста = ТекстКомандногоФайла.Добавить();
		ФрагментТекста.Кодировка = КодировкаТекста.OEM;
		ФрагментТекста.Текст = 
		"copy " + ПутьКФайлуОтчетаОбОбновлении + "+" + ПутьКФайлуСлужебныхСообщений + " " + ПутьКФайлуОтчетаОбОбновлении + ">NUL
		|";
		
	КонецЕсли;
	
	ФрагментТекста = ТекстКомандногоФайла.Добавить();
	ФрагментТекста.Кодировка = КодировкаТекста.OEM;
	ФрагментТекста.Текст = 
	"echo.	
	|echo Выполняется обновление конфигурации 
	|echo ^""" + ПодготовитьСтрокуДляКоманднойСтроки(Метаданные.Синоним) + "^""
	|echo с версии " + ПодготовитьСтрокуДляКоманднойСтроки(Метаданные.Версия) + " на версию " + ПодготовитьСтрокуДляКоманднойСтроки(ДоступноеОбновление.Версия) + ".
	|echo Начало операции:    %time%
	|";                                      
	
	ФрагментТекста = ТекстКомандногоФайла.Добавить();
	ФрагментТекста.Кодировка = КодировкаТекста.ANSI;
	ФрагментТекста.Текст = 
	"(echo. & " + 
	"echo Операция: Обновление конфигурации & " + 
	"echo " + ПодготовитьСтрокуДляКоманднойСтроки(РазделительОтчета) + " & " +
	"echo Конфигурация:        " + ПодготовитьСтрокуДляКоманднойСтроки(Метаданные.Синоним) + " & " + 
	"echo Поставщик:           " + ПодготовитьСтрокуДляКоманднойСтроки(Метаданные.Поставщик) + " & " + 
	"echo Текущая версия:      " + ПодготовитьСтрокуДляКоманднойСтроки(Метаданные.Версия) + " & " + 
	"echo Версия обновления:   " + ПодготовитьСтрокуДляКоманднойСтроки(ДоступноеОбновление.Версия) + " & " +
	"echo Начало операции:     %time%)>>";
	ФрагментТекста = ТекстКомандногоФайла.Добавить();
	ФрагментТекста.Кодировка = КодировкаТекста.OEM;
	ФрагментТекста.Текст     = ПутьКФайлуОтчетаОбОбновлении + Символы.ПС;
	
	ФрагментТекста = ТекстКомандногоФайла.Добавить();
	ФрагментТекста.Кодировка = КодировкаТекста.OEM;
	ФрагментТекста.Текст = 
	"start """" /wait " + ПутьКПрограмме + " CONFIG " + ПутьКИнформационнойБазе + ПараметрыАутентификацииПользователяДляОбновления + " /UpdateCfg" + ПутьКФайлуОбновленияКонфигурации + " /Out" + ПутьКФайлуСлужебныхСообщений + " /DisableStartupMessages
	|if errorlevel 1 goto on_error
	|echo Окончание операции: %time%
	|echo Обновление конфигурации успешно завершено.
	|echo.
	|";
	
	ФрагментТекста = ТекстКомандногоФайла.Добавить();
	ФрагментТекста.Кодировка = КодировкаТекста.ANSI;
	ФрагментТекста.Текст = 
	"(echo Окончание операции:  %time% & " + 
	"echo Результат операции:)>>";
	ФрагментТекста = ТекстКомандногоФайла.Добавить();
	ФрагментТекста.Кодировка = КодировкаТекста.OEM;
	ФрагментТекста.Текст     = ПутьКФайлуОтчетаОбОбновлении + Символы.ПС;
	
	ФрагментТекста = ТекстКомандногоФайла.Добавить();
	ФрагментТекста.Кодировка = КодировкаТекста.OEM;
	ФрагментТекста.Текст = 
	"copy " + ПутьКФайлуОтчетаОбОбновлении + "+" + ПутьКФайлуСлужебныхСообщений + " " + ПутьКФайлуОтчетаОбОбновлении + ">NUL
	|";
	
	ФрагментТекста = ТекстКомандногоФайла.Добавить();
	ФрагментТекста.Кодировка = КодировкаТекста.ANSI;
	ФрагментТекста.Текст = 
	"(echo. & " + 
	"echo Операция: Обновление конфигурации базы данных & " + 
	"echo " + ПодготовитьСтрокуДляКоманднойСтроки(РазделительОтчета) + " & " + 
	"echo Начало операции:     %time%)>>";
	ФрагментТекста = ТекстКомандногоФайла.Добавить();
	ФрагментТекста.Кодировка = КодировкаТекста.OEM;
	ФрагментТекста.Текст     = ПутьКФайлуОтчетаОбОбновлении + Символы.ПС;
	
	ФрагментТекста = ТекстКомандногоФайла.Добавить();
	ФрагментТекста.Кодировка = КодировкаТекста.OEM;
	ФрагментТекста.Текст = 
	"echo Выполняется обновление конфигурации базы данных
	|echo Начало операции:    %time%
	|start """" /wait " + ПутьКПрограмме + " CONFIG " + ПутьКИнформационнойБазе + ПараметрыАутентификацииПользователяДляОбновления + " /UpdateDBCfg /Out" + ПутьКФайлуСлужебныхСообщений + " /DisableStartupMessages
	|if errorlevel 1 goto on_error
	|echo Окончание операции: %time%
	|echo Обновление конфигурации базы данных успешно завершено.
	|";
	
	ФрагментТекста = ТекстКомандногоФайла.Добавить();
	ФрагментТекста.Кодировка = КодировкаТекста.ANSI;
	ФрагментТекста.Текст = 
	"(echo Окончание операции:  %time% & " + 
	"echo Результат операции:)>>";
	ФрагментТекста = ТекстКомандногоФайла.Добавить();
	ФрагментТекста.Кодировка = КодировкаТекста.OEM;
	ФрагментТекста.Текст     = ПутьКФайлуОтчетаОбОбновлении + Символы.ПС;
	
	ФрагментТекста = ТекстКомандногоФайла.Добавить();
	ФрагментТекста.Кодировка = КодировкаТекста.OEM;
	ФрагментТекста.Текст = 
	"copy " + ПутьКФайлуОтчетаОбОбновлении + "+" + ПутьКФайлуСлужебныхСообщений + " " + ПутьКФайлуОтчетаОбОбновлении + ">NUL
	|";
	
	Если НеобходимоИзменятьРежимЗавершенияРаботыПользователей()	Тогда
		
		ФрагментТекста = ТекстКомандногоФайла.Добавить();
		ФрагментТекста.Кодировка = КодировкаТекста.OEM;
		ФрагментТекста.Текст = 
		"start """" /wait " + ПутьКПрограмме + " ENTERPRISE " + ПутьКИнформационнойБазе + ПараметрыАутентификацииПользователя + " /CРазрешитьРаботуПользователей
		|";
		
	КонецЕсли;
	
	ФрагментТекста = ТекстКомандногоФайла.Добавить();
	ФрагментТекста.Кодировка = КодировкаТекста.OEM;
	ФрагментТекста.Текст = 
	"start """" " + ПутьКПрограмме + " ENTERPRISE " + ПутьКИнформационнойБазе + ПараметрыАутентификацииПользователя + "
	|goto end
	|:on_error
	|";
	
	ФрагментТекста = ТекстКомандногоФайла.Добавить();
	ФрагментТекста.Кодировка = КодировкаТекста.ANSI;
	ФрагментТекста.Текст = 
	"(echo Окончание операции:  %time% & " + 
	"echo. & " + 
	"echo ВНИМАНИЕ! В ходе выполнения операции возникли ошибки! & " + 
	"echo Обновление конфигурации не было завершено. & " +
	"echo. & " +
	"echo Информация о возникших ошибках:)>>";
	ФрагментТекста = ТекстКомандногоФайла.Добавить();
	ФрагментТекста.Кодировка = КодировкаТекста.OEM;
	ФрагментТекста.Текст     = ПутьКФайлуОтчетаОбОбновлении + Символы.ПС;
	
	ФрагментТекста = ТекстКомандногоФайла.Добавить();
	ФрагментТекста.Кодировка = КодировкаТекста.OEM;
	ФрагментТекста.Текст = 
	"copy " + ПутьКФайлуОтчетаОбОбновлении + "+" + ПутьКФайлуСлужебныхСообщений + " " + ПутьКФайлуОтчетаОбОбновлении + ">NUL
	|";
	
	ФрагментТекста = ТекстКомандногоФайла.Добавить();
	ФрагментТекста.Кодировка = КодировкаТекста.OEM;
	ФрагментТекста.Текст = 
	"echo Окончание операции: %time%
	|echo В ходе выполнения операции возникли ошибки.
	|echo.
	|echo Обновление конфигурации не было завершено.
	|echo Нажмите любую клавишу, чтобы открыть отчет об обновлении конфигурации.
	|pause
	|start """" notepad " + ПутьКФайлуОтчетаОбОбновлении + "
	|:end
	|del """ + КаталогВременныхФайлов + ИмяКомандногоФайлаОбновленияКонфигурации + """
	|del " + ПутьКФайлуСлужебныхСообщений + "	
	|";
	
	ДописыватьФайл = Ложь;
	Для Каждого Фрагмент Из ТекстКомандногоФайла Цикл
		КомандныйФайл = Новый ЗаписьТекста(КаталогВременныхФайлов + ИмяКомандногоФайлаОбновленияКонфигурации, Фрагмент.Кодировка, , ДописыватьФайл);
		КомандныйФайл.Записать(Фрагмент.Текст);
		КомандныйФайл.Закрыть();
		ДописыватьФайл = Истина;
	КонецЦикла;
	
	// Создание каталога резервного копирования.
	СоздатьКаталог(КаталогРезервногоКопирования);
		
	ЗапуститьПрограмму("""" + КаталогВременныхФайлов + ИмяКомандногоФайлаОбновленияКонфигурации + """", КаталогВременныхФайлов);	
КонецПроцедуры // ВыполнитьОбновлениеКонфигурации()

// Завершающие действия при обновлении конфигурации.
//
Процедура ЗавершитьОбновлениеКонфигурации() Экспорт
	
	// Удаление служебных пользователей.	
	Если НЕ ПравоДоступа("Администрирование", Метаданные) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Пользователь Из ПользователиИнформационнойБазы_ПолучитьПользователей() Цикл
		
		Если НЕ (Найти(Пользователь.Имя, ПрефиксИмениПользователя) = 0) Тогда
			
			Пользователь.Удалить();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗавершитьОбновлениеКонфигурации()

//////////////////////////////////////////////////////////////////////////////// 
// ИНИЦИАЛИЗАЦИЯ ПЕРЕМЕННЫХ
// 

// Сервер обновлений
СерверОбновлений           = СокрЛП(Константы.СерверОбновлений.Получить());
КаталогШаблонов            = СокрЛП(Константы.КаталогШаблонов.Получить());

ИмяФайлаСпискаШаблонов     = "v8cscdsc.xml";
ИмяФайлаОписанияОбновления = "news.htm";
ИмяФайлаОбновления         = "1Cv8.cfu";

// Имена служебных файлов
ИмяФайлаПрограммы                        = "1cv8.exe";
ИмяФайлаСлужебныхСообщений               = "1cv8out.txt";
ИмяФайлаОтчетаОбОбновлении               = "1cv8rpt.txt";
ИмяКомандногоФайлаОбновленияКонфигурации = "1cv8upd.bat";

// Служебные пользователи
ПрефиксИмениПользователя = "СлужебныйПользователь_ОбновлениеКонфигурации_";

// Реклама
ФайлАрхиваРекламы = "INDEX.ZIP";
ФайлРекламы       = "index.htm";