
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//Если ОбменДанными.Загрузка Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//АдресВХранилище = "";
	//Если ЭтотОбъект.ДополнительныеСвойства.Свойство("АдресВХранилище", АдресВХранилище) Тогда
	//	ДвДанные = ПолучитьИзВременногоХранилища(АдресВХранилище);
	//	ЭтотОбъект.ИсходныйФайл = Новый ХранилищеЗначения(ДвДанные);
	//КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	//Подразделение 	= ОбщегоНазначения_ПИ.ПодразделениеТекущегоУзла();
	Состояние		= Перечисления.СостоянияЗаявкиНаСторонПост.ВРаботе;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	// Вставить содержимое обработчика.
	//+HELP-7358 20251022 Михайловский
	Попытка
		Если Состояние = Перечисления.СостоянияЗаявкиНаСторонПост.Выполнена Тогда
			Если ПНК.Товары.Количество() Тогда
				ТЗТовары = ПНК.Товары.Выгрузить();
				ТЗТовары.Свернуть("Номенклатура");
				МРод = Новый Массив;
				МРод1 = Новый Массив;
				Для Каждого ТСтр Из ТЗТовары Цикл
					Род = ТСтр.Номенклатура.Родитель;
					Род1 = ТСтр.Номенклатура.Родитель.Родитель;
					Если ЗначениеЗаполнено(Род) И МРод.Найти(Род) = Неопределено Тогда
						МРод.Добавить(Род);
					КонецЕсли;
					Если ЗначениеЗаполнено(Род1) И МРод1.Найти(Род1) = Неопределено Тогда
						МРод1.Добавить(Род1);
					КонецЕсли;
				КонецЦикла;
				СчтРег = 0;
				СчтРегУсп = 0;
				Для Каждого ВыбрЗнач Из  МРод Цикл
					Рег = РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьОбъект(ВыбрЗнач);
					СчтРег = СчтРег + 1;
					Если Рег.Результат Тогда
						СчтРегУсп = СчтРегУсп + 1;
					КонецЕсли;
				КонецЦикла; 
				
				СчтРег = 0;
				СчтРегУсп = 0;
				Для Каждого ВыбрЗнач Из  МРод1 Цикл
					Рег = РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьОбъект(ВыбрЗнач);
					СчтРег = СчтРег + 1;
					Если Рег.Результат Тогда
						СчтРегУсп = СчтРегУсп + 1;
					КонецЕсли;
				КонецЦикла; 
				
			КонецЕсли;	
		КонецЕсли;
	Исключение
	КонецПопытки;
	//-HELP-7358 20251022 Михайловский
КонецПроцедуры
