Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	
	Если ТаблицаПараметров<>Неопределено Тогда
		Параметры=Новый Соответствие;
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
			ЗаписатьВЛог("Регламент","Параметр: "+СтрокаТП.Имя+" - "+СтрокаТП.Значение,"Информация");		
			Параметры.Вставить(СтрокаТП.Имя,СтрокаТП.Значение);
		КонецЦикла;	
	КонецЕсли;
	  	
		
	СписокДействующихМатриц = ПолучитьСписокДействМатриц(параметры); 
	
	ТЗСпайкиИсключить = неопределено; 
	ТЗНоменклатурыКопияСпайки = СформироватьПРМНаСпайки(СписокДействующихМатриц,Параметры,ТЗСпайкиИсключить);
	СформироватьОбратныеПРМcFBS(ТЗНоменклатурыКопияСпайки,Параметры,"Спайки");
	
	ТЗНоменклатурыКопия = СформироватьПРМнаFBS(параметры,СписокДействующихМатриц,ТЗСпайкиИсключить); 
	
	СформироватьОбратныеПРМcFBS(ТЗНоменклатурыКопия,Параметры); 
	 
	 
КонецПроцедуры

Функция ПолучитьСписокДействМатриц(Знач параметры)    
	//++Данилова Е.В. 19.02.2026 HELP-8936 	
	//Запрос1=Новый Запрос;
	//Запрос1.Текст=
	//"ВЫБРАТЬ
	//|	ИнетМагазины.Контрагент КАК Контрагент,
	//|	ИнетМагазины.Договор КАК Договор,
	////++Данилова Е.В. 09.02.2026  HELP-8786
	//|	ИнетМагазины.ПунктДоставки КАК ПунктДоставки 
	////--Данилова Е.В. 09.02.2026
	//|ИЗ
	//|	Справочник.ИнетМагазины КАК ИнетМагазины
	//|ГДЕ
	//|	ИнетМагазины.Склад = &Склад";
	//Запрос1.УстановитьПараметр("Склад",параметры.Получить("СкладFBS"));
	//ТЗКД=Запрос1.Выполнить().Выгрузить();
	//МКонтров=ТЗКД.ВыгрузитьКолонку("Контрагент");
	//МДогов=ТЗКД.ВыгрузитьКолонку("Договор");
	////++Данилова Е.В. 09.02.2026 HELP-8786
	//ПДоставки = ТЗКД.ВыгрузитьКолонку("ПунктДоставки");
	////--Данилова Е.В. 09.02.2026
	//
	//СписокДействующихМатриц = Новый СписокЗначений;
	//Запрос = Новый Запрос; 	
	//Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	Матрица.Ссылка КАК Матрица
	//|ИЗ
	//|	Документ.Матрица КАК Матрица
	////++Данилова Е.В. 09.02.2026 HELP-8786
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	//|		ПО Матрица.Ссылка = МатрицаПунктыДоставки.Ссылка 
	////--Данилова Е.В. 09.02.2026
	//|ГДЕ
	//|	Матрица.Контрагент В (&МКонтров)
	//|	И Матрица.Договор В (&МДогов)
	//|	И Матрица.Проведен
	//|	И Матрица.Дата <= &Дата
	//|	И (Матрица.ДатаОкончания > &Дата
	//|			ИЛИ Матрица.ДатаОкончания < ДАТАВРЕМЯ(2000, 1, 1))
	////++Данилова Е.В. 09.02.2026 HELP-8786
	//|	И МатрицаПунктыДоставки.ПунктДоставки В(&ПунктыДоставки)"; 
	//Запрос.УстановитьПараметр("ПунктыДоставки",ПДоставки);
	////--Данилова Е.В. 09.02.2026  	
	//Запрос.УстановитьПараметр("Дата",ТекущаяДата());
	//Запрос.УстановитьПараметр("МКонтров",МКонтров);
	//Запрос.УстановитьПараметр("МДогов",МДогов);
	СписокДействующихМатриц = Новый СписокЗначений;
	Запрос = Новый Запрос; 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИнетМагазины.Контрагент КАК Контрагент,
	|	ИнетМагазины.Договор КАК Договор,
	|	ИнетМагазины.ПунктДоставки КАК ПунктДоставки
	|ПОМЕСТИТЬ ВТДоговора
	|ИЗ
	|	Справочник.ИнетМагазины КАК ИнетМагазины
	|ГДЕ
	|	ИнетМагазины.Склад = &Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Матрица.Ссылка КАК Матрица
	//|ПОМЕСТИТЬ ВТМатрицы
	|ИЗ
	|	Документ.Матрица КАК Матрица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	|		ПО Матрица.Ссылка = МатрицаПунктыДоставки.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДоговора КАК ВТДоговора
	|		ПО (ВТДоговора.Контрагент = Матрица.Контрагент)
	|			И (ВТДоговора.Договор = Матрица.Договор)
	|			И (ВТДоговора.ПунктДоставки = МатрицаПунктыДоставки.ПунктДоставки)
	|ГДЕ
	|	Матрица.Проведен
	|	И Матрица.Дата <= &Дата
	|	И (Матрица.ДатаОкончания > &Дата
	|			ИЛИ Матрица.ДатаОкончания < ДАТАВРЕМЯ(2000, 1, 1))"; 
	
	Запрос.УстановитьПараметр("Дата",ТекущаяДата());
	Запрос.УстановитьПараметр("Склад",параметры.Получить("СкладFBS"));
	//--Данилова Е.В. 19.02.2026 
	
	Выборка = запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокДействующихМатриц.Добавить(Выборка.Матрица);
	КонецЦикла; 
	
	Возврат СписокДействующихМатриц; 

КонецФункции

Функция СформироватьПРМнаFBS1(Знач параметры, СписокДействующихМатриц,ТЗСпайкиИсключить)
	
	МассивСкладовОбычные = Новый Массив; 
	Для НомерПараметра = 1 По 10 Цикл 
		Если Параметры.Получить("СкладОтправитель"+Строка(НомерПараметра)) <> Неопределено Тогда
			
			МассивСкладовОбычные.Добавить(Параметры.Получить("СкладОтправитель"+Строка(НомерПараметра))); 
			
		КонецЕсли;	
	КонецЦикла;
	
	
	ОписаниеТиповСклад = Новый ОписаниеТипов("СправочникСсылка.Склады");
	ОписаниеТиповЧисло = Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(14)); 
	
	ТаблицаСкладовПоПриоритетам = Новый ТаблицаЗначений;
	ТаблицаСкладовПоПриоритетам.Колонки.Добавить("Склад",ОписаниеТиповСклад);
	ТаблицаСкладовПоПриоритетам.Колонки.Добавить("Приоритет",ОписаниеТиповЧисло);
	Приоритет = 1; 
	Для каждого СкладИзНастроек Из МассивСкладовОбычные Цикл
		НСтрока = ТаблицаСкладовПоПриоритетам.Добавить(); 
		НСтрока.Склад = СкладИзНастроек; 
		НСтрока.Приоритет = Приоритет; 
		
		Приоритет = Приоритет +1; 		
	КонецЦикла;
	
	//для тестов 
	//Товар = Параметры.Получить("Товар"); 	
	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	МатрицаТовары.Номенклатура КАК Номенклатура,
	//|	ВЫБОР КОГДА МАКСИМУМ(МатрицаТовары.МинимальноеКоличество)>МАКСИМУМ(МатрицаТовары.МинимальныйОстатокКоличество) ТОГДА
	//|	МАКСИМУМ(МатрицаТовары.МинимальноеКоличество) ИНАЧЕ МАКСИМУМ(МатрицаТовары.МинимальныйОстатокКоличество) КОНЕЦ КАК МинимальноеКоличество
	////|	МАКСИМУМ(МатрицаТовары.МинимальныйОстатокКоличество) КАК МинимальныйОстатокКоличество
	//|ИЗ
	//|	Документ.Матрица.Товары КАК МатрицаТовары  
	//////ТЕСТ 
	////|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
	////|	ПО МатрицаТовары.Номенклатура = НоменклатураКоплектующие.Ссылка
	//|ГДЕ
	//|	МатрицаТовары.Ссылка В(&СписокДействующихМатриц) //И  (МатрицаТовары.Номенклатура = &Товар ИЛИ НоменклатураКоплектующие.Номенклатура =  &Товар) 
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	МатрицаТовары.Номенклатура
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Номенклатура
	//|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос = Новый Запрос;
	Если ТЗСпайкиИсключить = неопределено Тогда 
		
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МатрицаТовары.Номенклатура КАК Номенклатура,
		|	ВЫБОР КОГДА МАКСИМУМ(МатрицаТовары.МинимальноеКоличество)>МАКСИМУМ(МатрицаТовары.МинимальныйОстатокКоличество) ТОГДА
		|	МАКСИМУМ(МатрицаТовары.МинимальноеКоличество) ИНАЧЕ МАКСИМУМ(МатрицаТовары.МинимальныйОстатокКоличество) КОНЕЦ КАК МинимальноеКоличество
		//|	МАКСИМУМ(МатрицаТовары.МинимальныйОстатокКоличество) КАК МинимальныйОстатокКоличество
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары  
		////ТЕСТ 
		//|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
		//|	ПО МатрицаТовары.Номенклатура = НоменклатураКоплектующие.Ссылка
		|ГДЕ
		|	МатрицаТовары.Ссылка В(&СписокДействующихМатриц) //И  (МатрицаТовары.Номенклатура = &Товар ИЛИ НоменклатураКоплектующие.Номенклатура =  &Товар) 
		|
		|СГРУППИРОВАТЬ ПО
		|	МатрицаТовары.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура
		|АВТОУПОРЯДОЧИВАНИЕ";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		|	ТЗСпайки.Номенклатура КАК Номенклатура,
		|	ТЗСпайки.КОличество КАК КОличество
		|ПОМЕСТИТЬ ВТСпайки
		|ИЗ
		|	&ТЗСпайки КАК ТЗСпайки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|	ВложенныйЗапрос.МинимальноеКоличество - ЕСТЬNULL(ВТСпайки.КОличество, 0) КАК МинимальноеКоличество
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		МатрицаТовары.Номенклатура КАК Номенклатура,
		|		ВЫБОР
		|			КОГДА МАКСИМУМ(МатрицаТовары.МинимальноеКоличество) > МАКСИМУМ(МатрицаТовары.МинимальныйОстатокКоличество)
		|				ТОГДА МАКСИМУМ(МатрицаТовары.МинимальноеКоличество)
		|			ИНАЧЕ МАКСИМУМ(МатрицаТовары.МинимальныйОстатокКоличество)
		|		КОНЕЦ КАК МинимальноеКоличество
		|	ИЗ
		|		Документ.Матрица.Товары КАК МатрицаТовары
		|	ГДЕ
		|		МатрицаТовары.Ссылка В(&СписокДействующихМатриц)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		МатрицаТовары.Номенклатура) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСпайки КАК ВТСпайки
		|		ПО (ВТСпайки.Номенклатура = ВложенныйЗапрос.Номенклатура)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВложенныйЗапрос.Номенклатура
		|АВТОУПОРЯДОЧИВАНИЕ";
		
	КонецЕсли;
	Запрос.УстановитьПараметр("СписокДействующихМатриц",СписокДействующихМатриц);
	Запрос.УстановитьПараметр("ТЗСпайки",ТЗСпайкиИсключить);
	/////////////ТЕСТ
	//Запрос.УстановитьПараметр("Товар",Товар); 
	////////////////////////////
	Выборка = Запрос.Выполнить().выбрать();
	
	
	ОписаниеТиповНоменклатура = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	
	ТЗНоменклатуры = Новый ТаблицаЗначений;
	ТЗНоменклатуры.Колонки.Добавить("Номенклатура",ОписаниеТиповНоменклатура);
	ТЗНоменклатуры.Колонки.Добавить("Количество",ОписаниеТиповЧисло);  
	
	
	//ТЗСпайки = Новый ТаблицаЗначений; 
	//ТЗСпайки.Колонки.Добавить("Номенклатура");
	//ТЗСпайки.Колонки.Добавить("Количество");
	//
	//ТЗНеСпайки = Новый ТаблицаЗначений; 
	//ТЗНеСпайки.Колонки.Добавить("Номенклатура");
	//ТЗНеСпайки.Колонки.Добавить("Количество");
	
	ОписаниеТиповНомен = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ОписаниеТиповЧисло = Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,0)); 
	ТЗНехватаетОстатков = Новый ТаблицаЗначений;
	ТЗНехватаетОстатков.Колонки.Добавить("Номенклатура",ОписаниеТиповНомен);
	ТЗНехватаетОстатков.Колонки.Добавить("Количество",ОписаниеТиповЧисло);	
	
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.МинимальноеКоличество > 0 Тогда
			СтрокаТЗ = Неопределено;
			Номенклатура = Выборка.Номенклатура;   	
			
			
			Если Номенклатура.Коплектующие.Количество() = 1  
				или (Номенклатура.родитель.ШтукВКомплекте>1 и Номенклатура.Коплектующие.Количество()>0) 
				Тогда	
				
				
				Для каждого СтрокаКомплектующих Из Номенклатура.Коплектующие Цикл
					//++Данилова Е.В. 15.01.2026
					Если СтрокаКомплектующих.Номенклатура.Родитель.ВидНоменклатуры <> Перечисления.ВидыНоменклаутры.Товар Тогда
						
						Продолжить; 	
						
					КонецЕсли;
					//--Данилова Е.В. 15.01.2026 
					СтрокаТЗ = ТЗНоменклатуры.Добавить();
					СтрокаТЗ.Номенклатура = СтрокаКомплектующих.Номенклатура;
					СтрокаТЗ.Количество = Выборка.МинимальноеКоличество*СтрокаКомплектующих.Количество;
				КонецЦикла;
				
				//СтрокаСпайки = ТЗСпайки.Добавить(); 
				//СтрокаСпайки.Номенклатура = Номенклатура; 
				//СтрокаСпайки.Количество   = Выборка.МинимальноеКоличество; 
				//
			ИначеЕсли  Номенклатура.Коплектующие.Количество() = 0 Тогда
				СтрокаТЗ = ТЗНоменклатуры.Добавить();
				СтрокаТЗ.Номенклатура = Выборка.Номенклатура;
				СтрокаТЗ.Количество = Выборка.МинимальноеКоличество;
				
				
				//СтрокаНеСпайки = ТЗНеСпайки.Добавить(); 
				//СтрокаНеСпайки.Номенклатура = Номенклатура; 
				//СтрокаНеСпайки.Количество   = Выборка.МинимальноеКоличество; 
				
			Иначе
				СообщитьИзМодуля("Некорректное количество комплектующих "+Номенклатура);
				СтрокаТЗ = ТЗНоменклатуры.Добавить();
				СтрокаТЗ.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
				СтрокаТЗ.Количество = 0;
			КонецЕсли;
			
			
			
		КонецЕсли;
	КонецЦикла; 
	
	ТЗНоменклатуры.Свернуть("Номенклатура","Количество");
	ТЗНоменклатуры.Сортировать("Номенклатура");
	
	ТЗНоменклатурыКопия = ТЗНоменклатуры.Скопировать();//для расчета обратного ПРМ  
	
	ТЗНоменклатуры.Колонки.Добавить("ОбщийОстаток",ОписаниеТиповЧисло); 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаСкладовПоПриоритетам.Склад КАК Склад,
	               |	ТаблицаСкладовПоПриоритетам.Приоритет КАК Приоритет
	               |ПОМЕСТИТЬ ВТСкладыПоПриоритетам
	               |ИЗ
	               |	&ТаблицаСкладовПоПриоритетам КАК ТаблицаСкладовПоПриоритетам
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗТовары.Количество КАК Количество,
	               |	ТЗТовары.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТТовары
	               |ИЗ
	               |	&ТЗТовары КАК ТЗТовары
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	               |	ОстаткиТМЦОстатки.КоличествоОстаток - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) КАК Количество
	               |ПОМЕСТИТЬ ВТОстаткиFBS
	               |ИЗ
	               |	РегистрНакопления.ОстаткиТМЦ.Остатки(
	               |			&Дата1,
	               |			Склад В (&СкладыFBS)
	               |				И Номенклатура В
	               |					(ВЫБРАТЬ
	               |						ВТТовары.Номенклатура
	               |					ИЗ
	               |						ВТТовары КАК ВТТовары)) КАК ОстаткиТМЦОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	               |				&Дата1,
	               |				Склад В (&СкладыFBS)
	               |					И Номенклатура В
	               |						(ВЫБРАТЬ
	               |							ВТТовары.Номенклатура
	               |						ИЗ
	               |							ВТТовары КАК ВТТовары)) КАК РезервыТМЦОстатки
	               |		ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
	               |ГДЕ
	               |	ОстаткиТМЦОстатки.КоличествоОстаток - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТТовары.Номенклатура КАК Номенклатура,
	               |	ВТТовары.Количество КАК Количество,
	               |	ВТСкладыПоПриоритетам.Склад КАК Склад,
	               |	ВТСкладыПоПриоритетам.Приоритет КАК Приоритет
	               |ПОМЕСТИТЬ ВТТоварыПоСкладам
	               |ИЗ
	               |	ВТТовары КАК ВТТовары,
	               |	ВТСкладыПоПриоритетам КАК ВТСкладыПоПриоритетам
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТТовары.Склад КАК Склад,
	               |	ВТТовары.Приоритет КАК Приоритет,
	               |	ВТТовары.Номенклатура КАК Номенклатура,
	               |	ВТТовары.Количество КАК Количество,
	               |	ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) КАК Остаток,
	               |	ЕСТЬNULL(ВТОстаткиFBS.Количество, 0) КАК ОстатокFBS
	               |ПОМЕСТИТЬ ВТОстатки
	               |ИЗ
	               |	ВТТоварыПоСкладам КАК ВТТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(
	               |				&Дата1,
	               |				Склад В
	               |					(ВЫБРАТЬ
	               |						ВТСкладыПоПриоритетам.Склад
	               |					ИЗ
	               |						ВТСкладыПоПриоритетам КАК ВТСкладыПоПриоритетам)) КАК ОстаткиТМЦОстатки
	               |		ПО ВТТовары.Номенклатура = ОстаткиТМЦОстатки.Номенклатура
	               |			И ВТТовары.Склад = ОстаткиТМЦОстатки.Склад
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	               |				&Дата1,
	               |				Склад В
	               |					(ВЫБРАТЬ
	               |						ВТСкладыПоПриоритетам.Склад
	               |					ИЗ
	               |						ВТСкладыПоПриоритетам КАК ВТСкладыПоПриоритетам)) КАК РезервыТМЦОстатки
	               |		ПО (ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура)
	               |			И (ОстаткиТМЦОстатки.Склад = РезервыТМЦОстатки.Склад)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиFBS КАК ВТОстаткиFBS
	               |		ПО (ВТОстаткиFBS.Номенклатура = ВТТовары.Номенклатура)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТОстатки.Номенклатура КАК Номенклатура,
				   //++Данилова Е.В. 15.01.2026  SNL-98
	               |	СУММА(ВЫБОР
	               |			КОГДА ВТОстатки.Остаток < 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ВТОстатки.Остаток
	               |		КОНЕЦ) КАК Остаток, 
				   //--Данилова Е.В. 15.01.2026 
	               |	МАКСИМУМ(ВТОстатки.Количество) КАК Количество,
	               |	МАКСИМУМ(ВТОстатки.ОстатокFBS) КАК ОстатокFBS
	               |ИЗ
	               |	ВТОстатки КАК ВТОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТОстатки.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТТовары.Номенклатура КАК Номенклатура,
	               |	ВЫБОР
	               |		КОГДА ВТТовары.Количество - ЕСТЬNULL(ВТОстаткиFBS.Количество, 0) > 0
	               |			ТОГДА ВТТовары.Количество - ЕСТЬNULL(ВТОстаткиFBS.Количество, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Количество
	               |ИЗ
	               |	ВТТовары КАК ВТТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиFBS КАК ВТОстаткиFBS
	               |		ПО (ВТОстаткиFBS.Номенклатура = ВТТовары.Номенклатура)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТОстатки.Склад КАК Склад,
	               |	ВТОстатки.Номенклатура КАК Номенклатура,
	               |	ВТОстатки.Остаток КАК Остаток
	               |ИЗ
	               |	ВТОстатки КАК ВТОстатки
	               |ГДЕ
	               |	ВТОстатки.Остаток > 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВТОстатки.Приоритет
	               |ИТОГИ ПО
	               |	Склад";
	
	Запрос.УстановитьПараметр("Дата1",ТекущаяДата());
	Запрос.УстановитьПараметр("ТаблицаСкладовПоПриоритетам",ТаблицаСкладовПоПриоритетам);
	Запрос.УстановитьПараметр("ТЗТовары",ТЗНоменклатуры); 
	СкладыFBS = Новый Массив;
	СкладыFBS.Добавить(Параметры.Получить("СкладFBS")); 
	СкладыFBS.Добавить(Параметры.Получить("СкладFBSМаркировка"));
	
	Запрос.УстановитьПараметр("СкладыFBS", СкладыFBS);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет(); 
	ВыборкаОбщиеОстатки 			= ПакетЗапросов[5].Выбрать();
	ТЧКоличествоДляРаспределения 	= ПакетЗапросов[6].Выгрузить();
	ВыборкаОстаткиПоСкладам = ПакетЗапросов[7].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СкладFBSПолучатель = Параметры.Получить("СкладFBS"); 
	
	Пока ВыборкаОбщиеОстатки.Следующий() Цикл
		
		Отбор = Новый Структура("Номенклатура",ВыборкаОбщиеОстатки.Номенклатура); 	
		СтрокиПоТовару = ТЗНоменклатуры.НайтиСтроки(Отбор);
		
		Если СтрокиПоТовару.Количество() > 0  Тогда
			
			СтрокиПоТовару[0].ОбщийОстаток = Макс(ВыборкаОбщиеОстатки.остаток,0) + Макс(ВыборкаОбщиеОстатки.ОстатокFBS,0); 	
			СтрокиПоТовару[0].Количество = ВыборкаОбщиеОстатки.Количество; 	
		КонецЕсли;
		
	КонецЦикла;
	МассивПРМСозданных1 = Новый Массив; 
	
	Пока ВыборкаОстаткиПоСкладам.Следующий() Цикл
		
		ПРМНовый = СоздатьДокументПРМ(СкладFBSПолучатель,ВыборкаОстаткиПоСкладам.Склад); 
		
		ВыборкаДетальныеЗаписи = ВыборкаОстаткиПоСкладам.Выбрать(); 
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ОтборНоменклатура = Новый Структура("Номенклатура",ВыборкаДетальныеЗаписи.Номенклатура); 	
			СтрокиНайденные = ТЧКоличествоДляРаспределения.НайтиСтроки(ОтборНоменклатура);
			Если СтрокиНайденные.Количество() > 0  Тогда
				
				СтрокаНайденная = СтрокиНайденные[0]; 
				НеобходимоеКоличество = СтрокаНайденная.Количество;
				
				Если НеобходимоеКоличество = 0 Тогда
					
					Продолжить;	
					
				КонецЕсли;
				
				КоличествоВПРМ = Мин(НеобходимоеКоличество,ВыборкаДетальныеЗаписи.Остаток);					
				
				СтрТЧ	=	ПРМНовый.Товары.Добавить();
				СтрТЧ.Номенклатура	=	ВыборкаДетальныеЗаписи.номенклатура;
				СтрТЧ.Заявка		=	НеобходимоеКоличество;
				стртч.ПодтвержденнаяЗаявка				=	КоличествоВПРМ;			
				стртч.ПодтвержденнаяЗаявкаПеремещения	=	стртч.ПодтвержденнаяЗаявка;
				СтрТЧ.Количество						=	стртч.ПодтвержденнаяЗаявка;				
				
				ПриИзмененииНоменклатурыТабЧасти(СтрТЧ, ПРМНовый);
				РассчитатьСуммуТабЧасти(СтрТЧ, ПРМНовый);
				
				СтрокаНайденная.Количество = СтрокаНайденная.Количество - КоличествоВПРМ; 
				
			Иначе 
				Продолжить; 
			КонецЕсли;
			
		КонецЦикла;
		
		Если ПРМНовый.Товары.Количество() > 0   Тогда
			
			МассивПРМСозданных1.Добавить(ПРМНовый); 	
			
		КонецЕсли;
		
	КонецЦикла;
	
	//кол-во
	
	//Для каждого СтрокаСпаек Из ТЗСпайки Цикл
	//	КолХватаетВсего = Неопределено;
	//	ОстатокОбщий = 0; 
	//	Для каждого СтрокаКомпл  Из СтрокаСпаек.номенклатура.Коплектующие Цикл
	//		
	//		Отбор = Новый Структура("номенклатура",СтрокаКомпл.номенклатура); 
	//		Строкинайденные = ТЗНоменклатуры.НайтиСтроки(Отбор);
	//		Если Строкинайденные.Количество() > 0  Тогда
	//			
	//			ОстатокОбщий = 	Строкинайденные[0].ОбщийОстаток;
	//			
	//			КолХватает = ЦЕЛ(ОстатокОбщий/СтрокаКомпл.Количество);
	//			
	//			Если  КолХватаетВсего = Неопределено Тогда
	//				
	//				
	//				КолХватаетВсего = КолХватает; 
	//			Иначе 
	//				
	//				КолХватаетВсего = Мин(КолХватаетВсего,КолХватает); 
	//			КонецЕсли; 				
	//		КонецЕсли; 		
	//		
	//	КонецЦикла;
	//	
	//	
	//	Нехватает = СтрокаСпаек.Количество - ЦЕЛ(КолХватаетВсего); 
	//	Для каждого СтрокаКомпл  Из СтрокаСпаек.номенклатура.Коплектующие Цикл 
	//		Если Нехватает > 0 Тогда
	//			СтрокаНеХватает = ТЗНехватаетОстатков.Добавить(); 
	//			СтрокаНеХватает.Номенклатура = СтрокаКомпл.Номенклатура; 			
	//			СтрокаНеХватает.Количество = Нехватает  * СтрокаКомпл.Количество;
	//		КонецЕсли;
	//		
	//		Отбор = Новый Структура("номенклатура",СтрокаКомпл.номенклатура); 
	//		Строкинайденные = ТЗНоменклатуры.НайтиСтроки(Отбор);
	//		Для каждого Строканайденная Из Строкинайденные Цикл
	//			
	//			Строканайденная.ОбщийОстаток = 	Строканайденная.ОбщийОстаток -  Мин(ЦЕЛ(КолХватаетВсего),СтрокаСпаек.Количество)  * СтрокаКомпл.Количество; 
	//			
	//		КонецЦикла;
	//		
	//	КонецЦикла; 		
	//	
	//КонецЦикла;
	//Для каждого СтрокаНеСпаек Из ТЗНеСпайки Цикл
	//	
	//	Отбор = Новый Структура("номенклатура",СтрокаНеСпаек.номенклатура); 
	//	Строкинайденные = ТЗНоменклатуры.НайтиСтроки(Отбор);	
	//	ОстатокОбщий = 	Строкинайденные[0].ОбщийОстаток; 
	//	
	//	НеобходимоеКоличество =  СтрокаНеСпаек.Количество - ОстатокОбщий; 
	//	Если НеобходимоеКоличество > 0  Тогда
	//		
	//		СтрокаНеХватает = ТЗНехватаетОстатков.Добавить(); 
	//		СтрокаНеХватает.Номенклатура = СтрокаНеСпаек.Номенклатура; 			
	//		СтрокаНеХватает.Количество = НеобходимоеКоличество;	
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла; 
	
	Для каждого СтрокаТЧ Из ТЗНоменклатуры Цикл 
		
		НеобходимоеКоличество = СтрокаТЧ.Количество - СтрокаТЧ.ОбщийОстаток; 	
		Если НеобходимоеКоличество > 0  Тогда
			СтрокаНеХватает = ТЗНехватаетОстатков.Добавить(); 
			СтрокаНеХватает.Номенклатура = СтрокаТЧ.Номенклатура; 			
			СтрокаНеХватает.Количество = НеобходимоеКоличество;
		КонецЕсли;
	КонецЦикла;
	
	ТЗНехватаетОстатков.Свернуть("Номенклатура","Количество"); 
	
	
	СкладFBSМаркировка = Параметры.Получить("СкладFBSМаркировка"); 
	МассивСкладовМаркировки = Новый Массив; 
	Для НомерПараметра = 1 По 10 Цикл 
		Если Параметры.Получить("СкладОтправительМаркировка"+Строка(НомерПараметра)) <> Неопределено Тогда
			
			МассивСкладовМаркировки.Добавить(Параметры.Получить("СкладОтправительМаркировка"+Строка(НомерПараметра))); 
			
		КонецЕсли;	
	КонецЦикла;
	
	ТаблицаСкладовПоПриоритетамМаркировка = Новый ТаблицаЗначений;
	ТаблицаСкладовПоПриоритетамМаркировка.Колонки.Добавить("Склад",ОписаниеТиповСклад);
	ТаблицаСкладовПоПриоритетамМаркировка.Колонки.Добавить("Приоритет",ОписаниеТиповЧисло);
	Приоритет = 1; 
	Для каждого СкладИзНастроек Из МассивСкладовМаркировки Цикл
		НСтрока = ТаблицаСкладовПоПриоритетамМаркировка.Добавить(); 
		НСтрока.Склад = СкладИзНастроек; 
		НСтрока.Приоритет = Приоритет; 
		
		Приоритет = Приоритет +1; 		
	КонецЦикла;
	
	МассивПРМСозданных = Новый Массив;
	
	Если ЗначениеЗаполнено(СкладFBSМаркировка) 
		И МассивСкладовМаркировки.Количество() > 0 
		И ТЗНехватаетОстатков.Количество() > 0 Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧНехватает.Номенклатура КАК Номенклатура,
		|	ТЧНехватает.Количество КАК Количество
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	&ТЧНеХватает КАК ТЧНехватает
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаСкладовПоПриоритетамМаркировка.склад КАК склад,
		|	ТаблицаСкладовПоПриоритетамМаркировка.Приоритет КАК Приоритет
		|ПОМЕСТИТЬ ВТСклады
		|ИЗ
		|	&ТаблицаСкладовПоПриоритетамМаркировка КАК ТаблицаСкладовПоПриоритетамМаркировка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиТМЦОстатки.КоличествоОстаток - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) КАК Количество,
		|	ОстаткиТМЦОстатки.Склад КАК Склад
		|ПОМЕСТИТЬ ВТОстаткиМаркировки
		|ИЗ
		|	РегистрНакопления.ОстаткиТМЦ.Остатки(
		|			,
		|			Склад В (&СкладыМаркировки)
		|				И Номенклатура В
		|					(ВЫБРАТЬ
		|						ВТТовары.Номенклатура
		|					ИЗ
		|						ВТТовары КАК ВТТовары)) КАК ОстаткиТМЦОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(, Склад В (&СкладыМаркировки)) КАК РезервыТМЦОстатки
		|		ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
		|			И ОстаткиТМЦОстатки.Склад = РезервыТМЦОстатки.Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТовары.Номенклатура КАК Номенклатура,
		|	ВТТовары.Количество КАК Количество
		|ИЗ
		|	ВТТовары КАК ВТТовары
		|ГДЕ
		|	ВТТовары.Количество > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТовары.Номенклатура КАК Номенклатура,
		|	ВТТовары.Количество КАК Количество,
		|	ЕСТЬNULL(ВТОстаткиМаркировки.Количество, 0) КАК Остаток,
		|	ВТОстаткиМаркировки.Склад КАК Склад
		|ИЗ
		|	ВТТовары КАК ВТТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиМаркировки КАК ВТОстаткиМаркировки
		|		ПО (ВТОстаткиМаркировки.Номенклатура = ВТТовары.Номенклатура)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСклады КАК ВТСклады
		|		ПО (ВТСклады.склад = ВТОстаткиМаркировки.Склад)
		|ГДЕ
		|	ВТТовары.Количество > 0
		|	И ЕСТЬNULL(ВТОстаткиМаркировки.Количество, 0) > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТСклады.Приоритет,
		|	Номенклатура
		|ИТОГИ ПО
		|	Склад";	
		
		Запрос.УстановитьПараметр("ТаблицаСкладовПоПриоритетамМаркировка",ТаблицаСкладовПоПриоритетамМаркировка);
		Запрос.УстановитьПараметр("СкладFBSМаркировка",СкладFBSМаркировка); 
		Запрос.УстановитьПараметр("СкладыМаркировки",МассивСкладовМаркировки);
		Запрос.УстановитьПараметр("ТЧНеХватает",ТЗНехватаетОстатков);
		
		ПакетЗапросов = Запрос.ВыполнитьПакет();
		
		ТЧНеобхКоличество = ПакетЗапросов[3].Выгрузить();
		
		ВыборкаСклады = ПакетЗапросов[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		//создание ПРМ по складам  	
		
		Пока ВыборкаСклады.Следующий() Цикл
			
			ПРМНовый = СоздатьДокументПРМ(СкладFBSМаркировка,ВыборкаСклады.Склад); 
			
			ВыборкаДетальныеЗаписи = ВыборкаСклады.Выбрать(); 
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				ОтборНоменклатура = Новый Структура("Номенклатура",ВыборкаДетальныеЗаписи.Номенклатура); 	
				СтрокиНайденные = ТЧНеобхКоличество.НайтиСтроки(ОтборНоменклатура);
				Если СтрокиНайденные.Количество() > 0  Тогда
					
					СтрокаНайденная = СтрокиНайденные[0]; 
					НеобходимоеКоличество = СтрокаНайденная.Количество;
					
					Если НеобходимоеКоличество = 0 Тогда
						
						Продолжить;	
						
					КонецЕсли;
					
					КоличествоВПРМ = Мин(НеобходимоеКоличество,ВыборкаДетальныеЗаписи.Остаток);					
					
					СтрТЧ	=	ПРМНовый.Товары.Добавить();
					СтрТЧ.Номенклатура	=	ВыборкаДетальныеЗаписи.номенклатура;
					СтрТЧ.Заявка		=	НеобходимоеКоличество;
					стртч.ПодтвержденнаяЗаявка				=	КоличествоВПРМ;			
					стртч.ПодтвержденнаяЗаявкаПеремещения	=	стртч.ПодтвержденнаяЗаявка;
					СтрТЧ.Количество						=	стртч.ПодтвержденнаяЗаявка;				
					
					ПриИзмененииНоменклатурыТабЧасти(СтрТЧ, ПРМНовый);
					РассчитатьСуммуТабЧасти(СтрТЧ, ПРМНовый);
					
					СтрокаНайденная.Количество = СтрокаНайденная.Количество - КоличествоВПРМ; 
					
				Иначе 
					Продолжить; 
				КонецЕсли;
				
			КонецЦикла;
			
			Если ПРМНовый.Товары.Количество() > 0   Тогда
				
				МассивПРМСозданных.Добавить(ПРМНовый); 	
				
			КонецЕсли;
			
		КонецЦикла;
		
		
	КонецЕсли;
	
	НачатьТранзакцию(); 
	
	Для каждого НовыйПРМ1 Из МассивПРМСозданных1 Цикл
		УстановитьНомерДокументаКлиентСервер(НовыйПРМ1);
		НовыйПРМ1.Записать(РежимЗаписиДокумента.Проведение);
		СообщитьИзМодуля(НовыйПРМ1);	
		
	КонецЦикла;  
	
	Для каждого НовыйПРМ Из МассивПРМСозданных Цикл
		УстановитьНомерДокументаКлиентСервер(НовыйПРМ);	
		НовыйПРМ.Записать(РежимЗаписиДокумента.Проведение);
		СообщитьИзМодуля(НовыйПРМ);	
		
	КонецЦикла;
	
	Если  ТранзакцияАктивна() Тогда
		
		ЗафиксироватьТранзакцию();	
		
	КонецЕсли;
	
	Попытка
		ЗаписатьВЛог("Регламент","Контроль по остатку: ","Информация"); 
		
		Для каждого   НовыйПРМ1 Из МассивПРМСозданных1  Цикл
			
			КорректировкаПРМПоОстаткам(НовыйПРМ1);	
			
		КонецЦикла;
		
		
		Для каждого НовыйПРМ Из МассивПРМСозданных Цикл
			
			КорректировкаПРМПоОстаткам(НовыйПРМ);	
			
		КонецЦикла;
		
	Исключение
		ЗаписатьВЛог("Регламент","Контроль по остатку ошибка: "+ОписаниеОшибки(),"Информация");
	КонецПопытки; 
	
	Возврат ТЗНоменклатурыКопия;

КонецФункции

Процедура Сформировать1(ТаблицаПараметров = Неопределено) Экспорт
	
	Если ТаблицаПараметров<>Неопределено Тогда
		Параметры=Новый Соответствие;
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
			ЗаписатьВЛог("Регламент","Параметр: "+СтрокаТП.Имя+" - "+СтрокаТП.Значение,"Информация");		
			Параметры.Вставить(СтрокаТП.Имя,СтрокаТП.Значение);
		КонецЦикла;	
	КонецЕсли;
	//++Данилова Е.В. 10.12.2025  SNL-51  	
	МассивСкладовОбычные = Новый Массив; 
	Для НомерПараметра = 1 По 10 Цикл 
		Если Параметры.Получить("СкладОтправитель"+Строка(НомерПараметра)) <> Неопределено Тогда
			
			МассивСкладовОбычные.Добавить(Параметры.Получить("СкладОтправитель"+Строка(НомерПараметра))); 
			
		КонецЕсли;	
	КонецЦикла;
	ОписаниеТиповСклад = Новый ОписаниеТипов("СправочникСсылка.Склады");
	ОписаниеТиповЧисло = Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(14)); 
	
	ТаблицаСкладовПоПриоритетам = Новый ТаблицаЗначений;
	ТаблицаСкладовПоПриоритетам.Колонки.Добавить("Склад",ОписаниеТиповСклад);
	ТаблицаСкладовПоПриоритетам.Колонки.Добавить("Приоритет",ОписаниеТиповЧисло);
	Приоритет = 1; 
	Для каждого СкладИзНастроек Из МассивСкладовОбычные Цикл
		НСтрока = ТаблицаСкладовПоПриоритетам.Добавить(); 
		НСтрока.Склад = СкладИзНастроек; 
		НСтрока.Приоритет = Приоритет; 
		
		Приоритет = Приоритет +1; 		
	КонецЦикла;
	//--Данилова Е.В. 10.12.2025 
	
	//для тестов 
	//Товар = Параметры.Получить("Товар"); 
	//остатки FBS
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	//|	ОстаткиТМЦОстатки.КоличествоОстаток - ЕстьNull(РезервыТМЦОстатки.КоличествоОстаток,0) КАК Количество
	//|ИЗ
	//|	РегистрНакопления.ОстаткиТМЦ.Остатки(&Дата1, Склад = &Склад) КАК ОстаткиТМЦОстатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(&Дата1, Склад = &Склад) КАК РезервыТМЦОстатки
	//|		ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура";
	//
	//Запрос.УстановитьПараметр("Дата1",ТекущаяДата());
	//Запрос.УстановитьПараметр("Склад",параметры.Получить("СкладFBS"));
	//
	//ТОFBS = запрос.Выполнить().Выгрузить();
	
	//остатки Часцы
	//++Данилова Е.В. 10.12.2025 закомментировала
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	//|	ОстаткиТМЦОстатки.КоличествоОстаток - ЕстьNull(РезервыТМЦОстатки.КоличествоОстаток,0) КАК Количество
	//|ИЗ
	//|	РегистрНакопления.ОстаткиТМЦ.Остатки(&Дата1, Склад = &Склад) КАК ОстаткиТМЦОстатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(&Дата1, Склад = &Склад) КАК РезервыТМЦОстатки
	//|		ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура";
	//
	//Запрос.УстановитьПараметр("Дата1",ТекущаяДата());
	//Запрос.УстановитьПараметр("Склад",параметры.Получить("СкладОтправитель"));
	//
	//ТООтправитель = запрос.Выполнить().Выгрузить();
	
	//остатки Часцы 2
	//++Данилова Е.В. 10.12.2025 закомментировала
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	//|	ОстаткиТМЦОстатки.КоличествоОстаток - ЕстьNull(РезервыТМЦОстатки.КоличествоОстаток,0) КАК Количество
	//|ИЗ
	//|	РегистрНакопления.ОстаткиТМЦ.Остатки(&Дата1, Склад = &Склад) КАК ОстаткиТМЦОстатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(&Дата1, Склад = &Склад) КАК РезервыТМЦОстатки
	//|		ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура";
	//
	//Запрос.УстановитьПараметр("Дата1",ТекущаяДата());
	//Запрос.УстановитьПараметр("Склад",параметры.Получить("СкладОтправитель2"));
	//
	//ТООтправитель2 = запрос.Выполнить().Выгрузить();
	//Михайловский
	Запрос1=Новый Запрос;
	Запрос1.Текст=
	"ВЫБРАТЬ
	|	ИнетМагазины.Контрагент КАК Контрагент,
	|	ИнетМагазины.Договор КАК Договор  
	|ИЗ
	|	Справочник.ИнетМагазины КАК ИнетМагазины
	|ГДЕ
	|	ИнетМагазины.Склад = &Склад";
	Запрос1.УстановитьПараметр("Склад",параметры.Получить("СкладFBS"));
	ТЗКД=Запрос1.Выполнить().Выгрузить();
	МКонтров=ТЗКД.ВыгрузитьКолонку("Контрагент");
	МДогов=ТЗКД.ВыгрузитьКолонку("Договор");
	//Михайловский
	
	//номенклатурная матрица
	//список действующих матриц
	
	СписокДействующихМатриц = Новый СписокЗначений;
	Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ 
	//               |	МатрицаПунктыДоставки.Ссылка КАК Матрица
	//               |ИЗ
	//               |	Документ.Матрица.ПунктыДоставки КАК МатрицаПунктыДоставки
	//               |ГДЕ
	//               |	МатрицаПунктыДоставки.Ссылка.Дата <= &Дата
	//               |	И МатрицаПунктыДоставки.Ссылка.ДатаОкончания >= &Дата
	//               |	И МатрицаПунктыДоставки.Ссылка.Проведен
	//               |	И МатрицаПунктыДоставки.ПунктДоставки = &ПунктДоставки
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	МатрицаПунктыДоставки.Ссылка.Дата УБЫВ";
	
	
	
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Матрица.Ссылка КАК Матрица
	|ИЗ
	|	Документ.Матрица КАК Матрица
	|ГДЕ
	|	Матрица.Контрагент В(&МКонтров)
	|	И Матрица.Договор В(&МДогов)
	|	И Матрица.Проведен
	|	И Матрица.Дата <= &Дата
	|	И (Матрица.ДатаОкончания > &Дата
	|			ИЛИ Матрица.ДатаОкончания < ДАТАВРЕМЯ(2000, 1, 1))";  
				 
	Запрос.УстановитьПараметр("Дата",ТекущаяДата());
	Запрос.УстановитьПараметр("МКонтров",МКонтров);
	Запрос.УстановитьПараметр("МДогов",МДогов);
	//запрос.УстановитьПараметр("ПунктДоставки",Параметры.Получить("ПунктДоставки"));
	
	
	
	Выборка = запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокДействующихМатриц.Добавить(Выборка.Матрица);
	КонецЦикла;
	
	//данные матрицы
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МатрицаТовары.Номенклатура КАК Номенклатура,
	|	ВЫБОР КОГДА МАКСИМУМ(МатрицаТовары.МинимальноеКоличество)>МАКСИМУМ(МатрицаТовары.МинимальныйОстатокКоличество) ТОГДА
	|	МАКСИМУМ(МатрицаТовары.МинимальноеКоличество) ИНАЧЕ МАКСИМУМ(МатрицаТовары.МинимальныйОстатокКоличество) КОНЕЦ КАК МинимальноеКоличество
	//|	МАКСИМУМ(МатрицаТовары.МинимальныйОстатокКоличество) КАК МинимальныйОстатокКоличество
	|ИЗ
	|	Документ.Матрица.Товары КАК МатрицаТовары  
	////ТЕСТ 
	//|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
	//|	ПО МатрицаТовары.Номенклатура = НоменклатураКоплектующие.Ссылка
	|ГДЕ
	|	МатрицаТовары.Ссылка В(&СписокДействующихМатриц) //И  (МатрицаТовары.Номенклатура = &Товар ИЛИ НоменклатураКоплектующие.Номенклатура =  &Товар) 
	|
	|СГРУППИРОВАТЬ ПО
	|	МатрицаТовары.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("СписокДействующихМатриц",СписокДействующихМатриц); 
	/////////////ТЕСТ
	//Запрос.УстановитьПараметр("Товар",Товар); 
	////////////////////////////
	Выборка = Запрос.Выполнить().выбрать();
	
	//++Данилова Е.В. 10.12.2025 SNL-51 
	ОписаниеТиповНоменклатура = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	
	ТЗНоменклатуры = Новый ТаблицаЗначений;
	ТЗНоменклатуры.Колонки.Добавить("Номенклатура",ОписаниеТиповНоменклатура);
	ТЗНоменклатуры.Колонки.Добавить("Количество",ОписаниеТиповЧисло);
	
	//ТЗ номенклатуры
	//ТЗНоменклатуры = Новый ТаблицаЗначений;
	//ТЗНоменклатуры.Колонки.Добавить("Номенклатура");
	//ТЗНоменклатуры.Колонки.Добавить("Количество");
	//ТЗНоменклатуры.Колонки.Добавить("КоличествоНаСкладеОтправителе");
	//
	//ТЗНоменклатуры.Колонки.Добавить("КоличествоНаСкладеОтправителе2");
	//--Данилова Е.В. 10.12.2025
	
	//++Данилова Е.В. 25.11.2025  HELP-5920 
	ТЗСпайки = Новый ТаблицаЗначений; 
	ТЗСпайки.Колонки.Добавить("Номенклатура");
	ТЗСпайки.Колонки.Добавить("Количество");
	
	ТЗНеСпайки = Новый ТаблицаЗначений; 
	ТЗНеСпайки.Колонки.Добавить("Номенклатура");
	ТЗНеСпайки.Колонки.Добавить("Количество");
	
	ОписаниеТиповНомен = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ОписаниеТиповЧисло = Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,0)); 
	ТЗНехватаетОстатков = Новый ТаблицаЗначений;
	ТЗНехватаетОстатков.Колонки.Добавить("Номенклатура",ОписаниеТиповНомен);
	ТЗНехватаетОстатков.Колонки.Добавить("Количество",ОписаниеТиповЧисло);	
	//--Данилова Е.В. 25.11.2025 
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.МинимальноеКоличество > 0 Тогда
			СтрокаТЗ = Неопределено;
			Номенклатура = Выборка.Номенклатура;
			
			
			// Кухарь А.Ю.  30.06.2022 начало
			// 			Если Номенклатура.Коплектующие.Количество() = 1 и Тогда
			Если Номенклатура.Коплектующие.Количество() = 1  
				или (Номенклатура.родитель.ШтукВКомплекте>1 и Номенклатура.Коплектующие.Количество()>0) 
				Тогда
			// Кухарь А.Ю.  30.06.2022 конец
			

				Для каждого СтрокаКомплектующих Из Номенклатура.Коплектующие Цикл
					СтрокаТЗ = ТЗНоменклатуры.Добавить();
					СтрокаТЗ.Номенклатура = СтрокаКомплектующих.Номенклатура;
					СтрокаТЗ.Количество = Выборка.МинимальноеКоличество*СтрокаКомплектующих.Количество;
				КонецЦикла;
				//++Данилова Е.В. 25.11.2025 HELP-5920 
				СтрокаСпайки = ТЗСпайки.Добавить(); 
				СтрокаСпайки.Номенклатура = Номенклатура; 
				СтрокаСпайки.Количество   = Выборка.МинимальноеКоличество; 
				//--Данилова Е.В. 25.11.2025 
			ИначеЕсли  Номенклатура.Коплектующие.Количество() = 0 Тогда
				СтрокаТЗ = ТЗНоменклатуры.Добавить();
				СтрокаТЗ.Номенклатура = Выборка.Номенклатура;
				СтрокаТЗ.Количество = Выборка.МинимальноеКоличество;
				
				//++Данилова Е.В. 25.11.2025 HELP-5920 
				СтрокаНеСпайки = ТЗНеСпайки.Добавить(); 
				СтрокаНеСпайки.Номенклатура = Номенклатура; 
				СтрокаНеСпайки.Количество   = Выборка.МинимальноеКоличество; 
				//--Данилова Е.В. 25.11.2025
			Иначе
				СообщитьИзМодуля("Некорректное количество комплектующих "+Номенклатура);
				СтрокаТЗ = ТЗНоменклатуры.Добавить();
				СтрокаТЗ.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
				СтрокаТЗ.Количество = 0;
			КонецЕсли;
			
			
			
		КонецЕсли;
	КонецЦикла;
	
	//ТЗНоменклатуры.Свернуть("Номенклатура","Количество,КоличествоНаСкладеОтправителе");
	//ТЗНоменклатуры.Свернуть("Номенклатура","Количество,КоличествоНаСкладеОтправителе,КоличествоНаСкладеОтправителе2");
	//ТЗНоменклатуры.Сортировать("Номенклатура"); 
	//++Данилова Е.В. 25.11.2025  HELP-5920 SNL-51 
	ТЗНоменклатуры.Свернуть("Номенклатура","Количество");
	ТЗНоменклатуры.Сортировать("Номенклатура");
	
	ТЗНоменклатурыКопия = ТЗНоменклатуры.Скопировать();//для расчета обратного ПРМ  
	
	ТЗНоменклатуры.Колонки.Добавить("ОбщийОстаток",ОписаниеТиповЧисло); 
	//--Данилова Е.В. 25.11.2025 
	
	//++Данилова Е.В. 10.12.2025  SNL-51 
	//Расчет остатков по складам и создание ПРМ 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаСкладовПоПриоритетам.Склад КАК Склад,
	               |	ТаблицаСкладовПоПриоритетам.Приоритет КАК Приоритет
	               |ПОМЕСТИТЬ ВТСкладыПоПриоритетам
	               |ИЗ
	               |	&ТаблицаСкладовПоПриоритетам КАК ТаблицаСкладовПоПриоритетам
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗТовары.Количество КАК Количество,
	               |	ТЗТовары.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТТовары
	               |ИЗ
	               |	&ТЗТовары КАК ТЗТовары
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	               |	ОстаткиТМЦОстатки.КоличествоОстаток - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) КАК Количество
	               |ПОМЕСТИТЬ ВТОстаткиFBS
	               |ИЗ
	               |	РегистрНакопления.ОстаткиТМЦ.Остатки(
	               |			&Дата1,
	               |			Склад В (&СкладыFBS)
	               |				И Номенклатура В
	               |					(ВЫБРАТЬ
	               |						ВТТовары.Номенклатура
	               |					ИЗ
	               |						ВТТовары КАК ВТТовары)) КАК ОстаткиТМЦОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	               |				&Дата1,
	               |				Склад В (&СкладыFBS)
	               |					И Номенклатура В
	               |						(ВЫБРАТЬ
	               |							ВТТовары.Номенклатура
	               |						ИЗ
	               |							ВТТовары КАК ВТТовары)) КАК РезервыТМЦОстатки
	               |		ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
	               |ГДЕ
	               |	ОстаткиТМЦОстатки.КоличествоОстаток - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТТовары.Номенклатура КАК Номенклатура,
	               |	ВТТовары.Количество КАК Количество,
	               |	ВТСкладыПоПриоритетам.Склад КАК Склад,
	               |	ВТСкладыПоПриоритетам.Приоритет КАК Приоритет
	               |ПОМЕСТИТЬ ВТТоварыПоСкладам
	               |ИЗ
	               |	ВТТовары КАК ВТТовары,
	               |	ВТСкладыПоПриоритетам КАК ВТСкладыПоПриоритетам
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТТовары.Склад КАК Склад,
	               |	ВТТовары.Приоритет КАК Приоритет,
	               |	ВТТовары.Номенклатура КАК Номенклатура,
	               |	ВТТовары.Количество КАК Количество,
	               |	ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) КАК Остаток,
	               |	ЕСТЬNULL(ВТОстаткиFBS.Количество, 0) КАК ОстатокFBS
	               |ПОМЕСТИТЬ ВТОстатки
	               |ИЗ
	               |	ВТТоварыПоСкладам КАК ВТТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(
	               |				&Дата1,
	               |				Склад В
	               |					(ВЫБРАТЬ
	               |						ВТСкладыПоПриоритетам.Склад
	               |					ИЗ
	               |						ВТСкладыПоПриоритетам КАК ВТСкладыПоПриоритетам)) КАК ОстаткиТМЦОстатки
	               |		ПО ВТТовары.Номенклатура = ОстаткиТМЦОстатки.Номенклатура
	               |			И ВТТовары.Склад = ОстаткиТМЦОстатки.Склад
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	               |				&Дата1,
	               |				Склад В
	               |					(ВЫБРАТЬ
	               |						ВТСкладыПоПриоритетам.Склад
	               |					ИЗ
	               |						ВТСкладыПоПриоритетам КАК ВТСкладыПоПриоритетам)) КАК РезервыТМЦОстатки
	               |		ПО (ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура)
	               |			И (ОстаткиТМЦОстатки.Склад = РезервыТМЦОстатки.Склад)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиFBS КАК ВТОстаткиFBS
	               |		ПО (ВТОстаткиFBS.Номенклатура = ВТТовары.Номенклатура)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТОстатки.Номенклатура КАК Номенклатура,
	               |	СУММА(ВТОстатки.Остаток) КАК Остаток,
	               |	МАКСИМУМ(ВТОстатки.Количество) КАК Количество,
	               |	МАКСИМУМ(ВТОстатки.ОстатокFBS) КАК ОстатокFBS
	               |ИЗ
	               |	ВТОстатки КАК ВТОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТОстатки.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТТовары.Номенклатура КАК Номенклатура,
	               |	ВЫБОР
	               |		КОГДА ВТТовары.Количество - ЕСТЬNULL(ВТОстаткиFBS.Количество, 0) > 0
	               |			ТОГДА ВТТовары.Количество - ЕСТЬNULL(ВТОстаткиFBS.Количество, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Количество
	               |ИЗ
	               |	ВТТовары КАК ВТТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиFBS КАК ВТОстаткиFBS
	               |		ПО (ВТОстаткиFBS.Номенклатура = ВТТовары.Номенклатура)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТОстатки.Склад КАК Склад,
	               |	ВТОстатки.Номенклатура КАК Номенклатура,
	               |	ВТОстатки.Остаток КАК Остаток
	               |ИЗ
	               |	ВТОстатки КАК ВТОстатки
	               |ГДЕ
	               |	ВТОстатки.Остаток > 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВТОстатки.Приоритет
	               |ИТОГИ ПО
	               |	Склад";
	
	Запрос.УстановитьПараметр("Дата1",ТекущаяДата());
	Запрос.УстановитьПараметр("ТаблицаСкладовПоПриоритетам",ТаблицаСкладовПоПриоритетам);
    Запрос.УстановитьПараметр("ТЗТовары",ТЗНоменклатуры); 
	СкладыFBS = Новый Массив;
	СкладыFBS.Добавить(Параметры.Получить("СкладFBS")); 
	СкладыFBS.Добавить(Параметры.Получить("СкладFBSМаркировка"));
	
	Запрос.УстановитьПараметр("СкладыFBS", СкладыFBS);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет(); 
	ВыборкаОбщиеОстатки 			= ПакетЗапросов[5].Выбрать();
	ТЧКоличествоДляРаспределения 	= ПакетЗапросов[6].Выгрузить();
	ВыборкаОстаткиПоСкладам = ПакетЗапросов[7].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СкладFBSПолучатель = Параметры.Получить("СкладFBS"); 
	
	Пока ВыборкаОбщиеОстатки.Следующий() Цикл
		
		Отбор = Новый Структура("Номенклатура",ВыборкаОбщиеОстатки.Номенклатура); 	
		СтрокиПоТовару = ТЗНоменклатуры.НайтиСтроки(Отбор);
		
		Если СтрокиПоТовару.Количество() > 0  Тогда
			
			СтрокиПоТовару[0].ОбщийОстаток = Макс(ВыборкаОбщиеОстатки.остаток,0) + Макс(ВыборкаОбщиеОстатки.ОстатокFBS,0); 	
			СтрокиПоТовару[0].Количество = ВыборкаОбщиеОстатки.Количество; 	
		КонецЕсли;
		
	КонецЦикла;
	МассивПРМСозданных1 = Новый Массив; 
	
	Пока ВыборкаОстаткиПоСкладам.Следующий() Цикл
		
		ПРМНовый = СоздатьДокументПРМ(СкладFBSПолучатель,ВыборкаОстаткиПоСкладам.Склад); 
		
		ВыборкаДетальныеЗаписи = ВыборкаОстаткиПоСкладам.Выбрать(); 
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ОтборНоменклатура = Новый Структура("Номенклатура",ВыборкаДетальныеЗаписи.Номенклатура); 	
			СтрокиНайденные = ТЧКоличествоДляРаспределения.НайтиСтроки(ОтборНоменклатура);
			Если СтрокиНайденные.Количество() > 0  Тогда
				
				СтрокаНайденная = СтрокиНайденные[0]; 
				НеобходимоеКоличество = СтрокаНайденная.Количество;
				
				Если НеобходимоеКоличество = 0 Тогда
					
					Продолжить;	
					
				КонецЕсли;
				
				КоличествоВПРМ = Мин(НеобходимоеКоличество,ВыборкаДетальныеЗаписи.Остаток);					
				
				СтрТЧ	=	ПРМНовый.Товары.Добавить();
				СтрТЧ.Номенклатура	=	ВыборкаДетальныеЗаписи.номенклатура;
				СтрТЧ.Заявка		=	НеобходимоеКоличество;
				стртч.ПодтвержденнаяЗаявка				=	КоличествоВПРМ;			
				стртч.ПодтвержденнаяЗаявкаПеремещения	=	стртч.ПодтвержденнаяЗаявка;
				СтрТЧ.Количество						=	стртч.ПодтвержденнаяЗаявка;				
				
				ПриИзмененииНоменклатурыТабЧасти(СтрТЧ, ПРМНовый);
				РассчитатьСуммуТабЧасти(СтрТЧ, ПРМНовый);
				
				СтрокаНайденная.Количество = СтрокаНайденная.Количество - КоличествоВПРМ; 
				
			Иначе 
				Продолжить; 
			КонецЕсли;
			
		КонецЦикла;
		
		Если ПРМНовый.Товары.Количество() > 0   Тогда
			
			МассивПРМСозданных1.Добавить(ПРМНовый); 	
			
		КонецЕсли;
		
	КонецЦикла; 	
	
	//Для Каждого СтрокаТЗ Из ТЗНоменклатуры Цикл
	//	НачальноеКоличество = строкатз.количество;
	//	СтрокаОстаткаFBS = ТОFBS.Найти(СтрокаТЗ.Номенклатура,"Номенклатура");
	//	Если СтрокаОстаткаFBS <> Неопределено Тогда
	//		СтрокаТЗ.Количество = СтрокаТЗ.Количество - Макс(СтрокаОстаткаFBS.Количество,0);
	//		СтрокаТЗ.Количество = Макс(СтрокаТЗ.Количество,0);
	//	КонецЕсли;
	//	СтрокаОстаткаОтправитель = ТООтправитель.Найти(СтрокаТЗ.Номенклатура,"Номенклатура");
	//	Если СтрокаОстаткаОтправитель <> Неопределено Тогда
	//		СтрокаТЗ.КоличествоНаСкладеОтправителе = СтрокаОстаткаОтправитель.Количество;
	//		СтрокаТЗ.КоличествоНаСкладеОтправителе = Макс(СтрокаТЗ.КоличествоНаСкладеОтправителе,0);
	//	Иначе
	//		СтрокаТЗ.КоличествоНаСкладеОтправителе = 0;
	//	КонецЕсли;	
	//	
	//	
	//	СтрокаОстаткаОтправитель2 = ТООтправитель2.Найти(СтрокаТЗ.Номенклатура,"Номенклатура");
	//	Если СтрокаОстаткаОтправитель2 <> Неопределено Тогда
	//		СтрокаТЗ.КоличествоНаСкладеОтправителе2 = СтрокаОстаткаОтправитель2.Количество;
	//		СтрокаТЗ.КоличествоНаСкладеОтправителе2 = Макс(СтрокаТЗ.КоличествоНаСкладеОтправителе2,0);
	//	Иначе
	//		СтрокаТЗ.КоличествоНаСкладеОтправителе2 = 0;
	//	КонецЕсли;	
	//	//++Данилова Е.В. 25.11.2025 HELP-5920				
	//	СтрокаТЗ.ОбщийОстаток =  ?(СтрокаОстаткаFBS <> Неопределено,Макс(СтрокаОстаткаFBS.Количество,0),0) + СтрокаТЗ.КоличествоНаСкладеОтправителе2 +  СтрокаТЗ.КоличествоНаСкладеОтправителе; 
	//	//--Данилова Е.В. 25.11.2025 
	//КонецЦикла;
	//
	//--Данилова Е.В. 10.12.2025
		
	//создать ПРМ
	//++Данилова Е.В. 26.11.2025  HELP-5920 
	//перенесла в отдельную функцию 
	
	//Подсортировка=документы.Перемещение.СоздатьДокумент();
	//Подсортировка.Склад=Параметры.Получить("СкладОтправитель");
	//Подсортировка.СкладПолучатель=Параметры.Получить("СкладFBS");
	//Подсортировка.ИБ=Справочники.ИБ.НайтиПоКоду("SSP");
	//Подсортировка.Менеджер=ПараметрыСеанса.Пользователь.ФизЛицо;
	//Подсортировка.Автор=ПараметрыСеанса.Пользователь;
	//Подсортировка.Организация=Справочники.Организации.НайтиПоКоду("SS-001");
	//УстановитьПунктДоставки1(Подсортировка,"СкладПолучатель","ПунктДоставки");
	//Подсортировка.Комментарий="Создано обработкой Формирование перемещений FBS";
	//Подсортировка.СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена;
	//Подсортировка.СостояниеНакладнойУПолучателя=Перечисления.СостоянияНакладной.Принята;
	//Подсортировка.Отгружен=Перечисления.Отгружен.Отгружен;
	//Подсортировка.Дата=ТекущаяДата();
	//Подсортировка.ДатаПриемки = ТекущаяДата();
	//Подсортировка.Валюта=Справочники.Валюты.НайтиПоКоду("810");
	//Подсортировка.Курс=1;
	//
	//УстановитьНомерДокументаКлиентСервер(Подсортировка);  
	//
	//Подсортировка2=документы.Перемещение.СоздатьДокумент();
	//Подсортировка2.Склад=Параметры.Получить("СкладОтправитель2");
	//Подсортировка2.СкладПолучатель=Параметры.Получить("СкладFBS");
	//Подсортировка2.ИБ=Справочники.ИБ.НайтиПоКоду("SSP");
	//Подсортировка2.Менеджер=ПараметрыСеанса.Пользователь.ФизЛицо;
	//Подсортировка2.Автор=ПараметрыСеанса.Пользователь;
	//Подсортировка2.Организация=Справочники.Организации.НайтиПоКоду("SS-001");
	//УстановитьПунктДоставки1(Подсортировка2,"СкладПолучатель","ПунктДоставки");
	//Подсортировка2.Комментарий="Создано обработкой Формирование перемещений FBS";
	//Подсортировка2.СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена;
	//Подсортировка2.СостояниеНакладнойУПолучателя=Перечисления.СостоянияНакладной.Принята;
	//Подсортировка2.Отгружен=Перечисления.Отгружен.Отгружен;
	//Подсортировка2.Дата=ТекущаяДата();
	//Подсортировка2.ДатаПриемки = ТекущаяДата();
	//Подсортировка2.Валюта=Справочники.Валюты.НайтиПоКоду("810");
	//Подсортировка2.Курс=1;
	//
	//УстановитьНомерДокументаКлиентСервер(Подсортировка2);
	
	//Подсортировка = СоздатьДокументПРМ(Параметры.Получить("СкладFBS"),Параметры.Получить("СкладОтправитель"));
	//Подсортировка2 = СоздатьДокументПРМ(Параметры.Получить("СкладFBS"),Параметры.Получить("СкладОтправитель2"));
	////--Данилова Е.В. 26.11.2025
	//
	//Для каждого СтрокаТЗДляПРМ из ТЗНоменклатуры цикл
	//	если СтрокаТЗДляПРМ.Количество=0 тогда Продолжить;КонецЕсли;
	//	Если СтрокаТЗДляПРМ.КоличествоНаСкладеОтправителе > 0 Тогда
	//		
	//		
	//		СтрТЧ=Подсортировка.Товары.Добавить();
	//		СтрТЧ.Номенклатура=СтрокаТЗДляПРМ.номенклатура;
	//		СтрТЧ.Заявка=СтрокаТЗДляПРМ.Количество;
	//		стртч.ПодтвержденнаяЗаявка=Мин(СтрокаТЗДляПРМ.Количество,СтрокаТЗДляПРМ.КоличествоНаСкладеОтправителе);			
	//		стртч.ПодтвержденнаяЗаявкаПеремещения=стртч.ПодтвержденнаяЗаявка;
	//		СтрТЧ.Количество=стртч.ПодтвержденнаяЗаявка;				
	//		ПриИзмененииНоменклатурыТабЧасти(СтрТЧ, Подсортировка);
	//		РассчитатьСуммуТабЧасти(СтрТЧ, Подсортировка);
	//		
	//		СтрокаТЗДляПРМ.Количество = СтрокаТЗДляПРМ.Количество - стртч.ПодтвержденнаяЗаявка;
	//		
	//	КонецЕсли;
	//	
	//	если СтрокаТЗДляПРМ.Количество=0 тогда Продолжить;КонецЕсли;
	//	Если СтрокаТЗДляПРМ.КоличествоНаСкладеОтправителе2 > 0 Тогда
	//		
	//		СтрТЧ=Подсортировка2.Товары.Добавить();
	//		СтрТЧ.Номенклатура=СтрокаТЗДляПРМ.номенклатура;
	//		СтрТЧ.Заявка=СтрокаТЗДляПРМ.Количество;
	//		стртч.ПодтвержденнаяЗаявка=Мин(СтрокаТЗДляПРМ.Количество,СтрокаТЗДляПРМ.КоличествоНаСкладеОтправителе2);			
	//		стртч.ПодтвержденнаяЗаявкаПеремещения=стртч.ПодтвержденнаяЗаявка;
	//		СтрТЧ.Количество=стртч.ПодтвержденнаяЗаявка;				
	//		ПриИзмененииНоменклатурыТабЧасти(СтрТЧ, Подсортировка2);
	//		РассчитатьСуммуТабЧасти(СтрТЧ, Подсортировка2); 		
	//		 
	//	КонецЕсли; 		
	//КонецЦикла;	
	
	//++Данилова Е.В. 25.11.2025  HELP-5920 
		
	Для каждого СтрокаСпаек Из ТЗСпайки Цикл
		КолХватаетВсего = Неопределено;
		ОстатокОбщий = 0; 
		Для каждого СтрокаКомпл  Из СтрокаСпаек.номенклатура.Коплектующие Цикл
			
			Отбор = Новый Структура("номенклатура",СтрокаКомпл.номенклатура); 
			Строкинайденные = ТЗНоменклатуры.НайтиСтроки(Отбор);
			Если Строкинайденные.Количество() > 0  Тогда
				
				ОстатокОбщий = 	Строкинайденные[0].ОбщийОстаток;
				
				КолХватает = ЦЕЛ(ОстатокОбщий/СтрокаКомпл.Количество);
				
				Если  КолХватаетВсего = Неопределено Тогда
					
					
					КолХватаетВсего = КолХватает; 
				Иначе 
					
					КолХватаетВсего = Мин(КолХватаетВсего,КолХватает); 
				КонецЕсли; 				
			КонецЕсли; 		
			
		КонецЦикла;
		
		
		Нехватает = СтрокаСпаек.Количество - ЦЕЛ(КолХватаетВсего); 
		Для каждого СтрокаКомпл  Из СтрокаСпаек.номенклатура.Коплектующие Цикл 
			Если Нехватает > 0 Тогда
				СтрокаНеХватает = ТЗНехватаетОстатков.Добавить(); 
				СтрокаНеХватает.Номенклатура = СтрокаКомпл.Номенклатура; 			
				СтрокаНеХватает.Количество = Нехватает  * СтрокаКомпл.Количество;
			КонецЕсли;
			
			Отбор = Новый Структура("номенклатура",СтрокаКомпл.номенклатура); 
			Строкинайденные = ТЗНоменклатуры.НайтиСтроки(Отбор);
			Для каждого Строканайденная Из Строкинайденные Цикл
				
				Строканайденная.ОбщийОстаток = 	Строканайденная.ОбщийОстаток -  Мин(ЦЕЛ(КолХватаетВсего),СтрокаСпаек.Количество)  * СтрокаКомпл.Количество; 
				
			КонецЦикла;
			
		КонецЦикла; 		
			
	КонецЦикла;
	Для каждого СтрокаНеСпаек Из ТЗНеСпайки Цикл
		
		Отбор = Новый Структура("номенклатура",СтрокаНеСпаек.номенклатура); 
		Строкинайденные = ТЗНоменклатуры.НайтиСтроки(Отбор);	
		ОстатокОбщий = 	Строкинайденные[0].ОбщийОстаток; 
		
		НеобходимоеКоличество =  СтрокаНеСпаек.Количество - ОстатокОбщий; 
		Если НеобходимоеКоличество > 0  Тогда
			
			СтрокаНеХватает = ТЗНехватаетОстатков.Добавить(); 
			СтрокаНеХватает.Номенклатура = СтрокаНеСпаек.Номенклатура; 			
			СтрокаНеХватает.Количество = НеобходимоеКоличество;	
			
		КонецЕсли;
		
	КонецЦикла;
	//затем берем таблицу не хватает 
	ТЗНехватаетОстатков.Свернуть("Номенклатура","Количество"); 
	//определяем остатки на складе FBS маркировка, потом остатки на складах остальных 
	
	СкладFBSМаркировка = Параметры.Получить("СкладFBSМаркировка"); 
	МассивСкладовМаркировки = Новый Массив; 
	Для НомерПараметра = 1 По 10 Цикл 
		Если Параметры.Получить("СкладОтправительМаркировка"+Строка(НомерПараметра)) <> Неопределено Тогда
			
			МассивСкладовМаркировки.Добавить(Параметры.Получить("СкладОтправительМаркировка"+Строка(НомерПараметра))); 
			
		КонецЕсли;	
	КонецЦикла;
	//++Данилова Е.В. 10.12.2025  SNL-51 
	ТаблицаСкладовПоПриоритетамМаркировка = Новый ТаблицаЗначений;
	ТаблицаСкладовПоПриоритетамМаркировка.Колонки.Добавить("Склад",ОписаниеТиповСклад);
	ТаблицаСкладовПоПриоритетамМаркировка.Колонки.Добавить("Приоритет",ОписаниеТиповЧисло);
	Приоритет = 1; 
	Для каждого СкладИзНастроек Из МассивСкладовМаркировки Цикл
		НСтрока = ТаблицаСкладовПоПриоритетамМаркировка.Добавить(); 
		НСтрока.Склад = СкладИзНастроек; 
		НСтрока.Приоритет = Приоритет; 
		
		Приоритет = Приоритет +1; 		
	КонецЦикла;
	//--Данилова Е.В. 10.12.2025 
	МассивПРМСозданных = Новый Массив;
	
	Если ЗначениеЗаполнено(СкладFBSМаркировка) 
		И МассивСкладовМаркировки.Количество() > 0 
		И ТЗНехватаетОстатков.Количество() > 0 Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧНехватает.Номенклатура КАК Номенклатура,
		|	ТЧНехватает.Количество КАК Количество
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	&ТЧНеХватает КАК ТЧНехватает
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаСкладовПоПриоритетамМаркировка.склад КАК склад,
		|	ТаблицаСкладовПоПриоритетамМаркировка.Приоритет КАК Приоритет
		|ПОМЕСТИТЬ ВТСклады
		|ИЗ
		|	&ТаблицаСкладовПоПриоритетамМаркировка КАК ТаблицаСкладовПоПриоритетамМаркировка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
		//|	ОстаткиТМЦОстатки.КоличествоОстаток - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) КАК Количество
		//|ПОМЕСТИТЬ ВТОстаткиFBS
		//|ИЗ
		//|	РегистрНакопления.ОстаткиТМЦ.Остатки(
		//|			,
		//|			Склад = &СкладFBSМаркировка
		//|				И Номенклатура В
		//|					(ВЫБРАТЬ
		//|						ВТТовары.Номенклатура
		//|					ИЗ
		//|						ВТТовары КАК ВТТовары)) КАК ОстаткиТМЦОстатки
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(, Склад = &СкладFBSМаркировка) КАК РезервыТМЦОстатки
		//|		ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
		//|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиТМЦОстатки.КоличествоОстаток - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) КАК Количество,
		|	ОстаткиТМЦОстатки.Склад КАК Склад
		|ПОМЕСТИТЬ ВТОстаткиМаркировки
		|ИЗ
		|	РегистрНакопления.ОстаткиТМЦ.Остатки(
		|			,
		|			Склад В (&СкладыМаркировки)
		|				И Номенклатура В
		|					(ВЫБРАТЬ
		|						ВТТовары.Номенклатура
		|					ИЗ
		|						ВТТовары КАК ВТТовары)) КАК ОстаткиТМЦОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(, Склад В (&СкладыМаркировки)) КАК РезервыТМЦОстатки
		|		ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
		|			И ОстаткиТМЦОстатки.Склад = РезервыТМЦОстатки.Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТовары.Номенклатура КАК Номенклатура,
		|	ВТТовары.Количество  КАК Количество //- ЕСТЬNULL(ВТОстаткиFBS.Количество, 0) КАК Количество
		|ИЗ
		|	ВТТовары КАК ВТТовары
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиFBS КАК ВТОстаткиFBS
		//|		ПО (ВТОстаткиFBS.Номенклатура = ВТТовары.Номенклатура)
		|ГДЕ
		|	ВТТовары.Количество > 0 //- ЕСТЬNULL(ВТОстаткиFBS.Количество, 0) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТовары.Номенклатура КАК Номенклатура,
		|	ВТТовары.Количество КАК Количество, //- ЕСТЬNULL(ВТОстаткиFBS.Количество, 0) КАК Количество,
		|	ЕСТЬNULL(ВТОстаткиМаркировки.Количество, 0) КАК Остаток,
		|	ВТОстаткиМаркировки.Склад КАК Склад
		|ИЗ
		|	ВТТовары КАК ВТТовары
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиFBS КАК ВТОстаткиFBS
		//|		ПО (ВТОстаткиFBS.Номенклатура = ВТТовары.Номенклатура)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиМаркировки КАК ВТОстаткиМаркировки
		|		ПО (ВТОстаткиМаркировки.Номенклатура = ВТТовары.Номенклатура)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСклады КАК ВТСклады
		|		ПО (ВТСклады.склад = ВТОстаткиМаркировки.Склад)
		|ГДЕ
		|	ВТТовары.Количество > 0 //- ЕСТЬNULL(ВТОстаткиFBS.Количество, 0) > 0
		|	И ЕСТЬNULL(ВТОстаткиМаркировки.Количество, 0) > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТСклады.Приоритет,
		|	Номенклатура
		|ИТОГИ ПО
		|	Склад";	
		
		Запрос.УстановитьПараметр("ТаблицаСкладовПоПриоритетамМаркировка",ТаблицаСкладовПоПриоритетамМаркировка);
		Запрос.УстановитьПараметр("СкладFBSМаркировка",СкладFBSМаркировка); 
		Запрос.УстановитьПараметр("СкладыМаркировки",МассивСкладовМаркировки);
		Запрос.УстановитьПараметр("ТЧНеХватает",ТЗНехватаетОстатков);
		
		ПакетЗапросов = Запрос.ВыполнитьПакет();
		
		ТЧНеобхКоличество = ПакетЗапросов[3].Выгрузить();
		
		ВыборкаСклады = ПакетЗапросов[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		//создание ПРМ по складам  	
		 
		Пока ВыборкаСклады.Следующий() Цикл
			
			ПРМНовый = СоздатьДокументПРМ(СкладFBSМаркировка,ВыборкаСклады.Склад); 
			
			ВыборкаДетальныеЗаписи = ВыборкаСклады.Выбрать(); 
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				ОтборНоменклатура = Новый Структура("Номенклатура",ВыборкаДетальныеЗаписи.Номенклатура); 	
				СтрокиНайденные = ТЧНеобхКоличество.НайтиСтроки(ОтборНоменклатура);
				Если СтрокиНайденные.Количество() > 0  Тогда
				
					СтрокаНайденная = СтрокиНайденные[0]; 
					НеобходимоеКоличество = СтрокаНайденная.Количество;
					
					Если НеобходимоеКоличество = 0 Тогда
					
						Продолжить;	
					
					КонецЕсли;
					
					КоличествоВПРМ = Мин(НеобходимоеКоличество,ВыборкаДетальныеЗаписи.Остаток);					
					
					СтрТЧ	=	ПРМНовый.Товары.Добавить();
					СтрТЧ.Номенклатура	=	ВыборкаДетальныеЗаписи.номенклатура;
					СтрТЧ.Заявка		=	НеобходимоеКоличество;
					стртч.ПодтвержденнаяЗаявка				=	КоличествоВПРМ;			
					стртч.ПодтвержденнаяЗаявкаПеремещения	=	стртч.ПодтвержденнаяЗаявка;
					СтрТЧ.Количество						=	стртч.ПодтвержденнаяЗаявка;				
					
					ПриИзмененииНоменклатурыТабЧасти(СтрТЧ, ПРМНовый);
					РассчитатьСуммуТабЧасти(СтрТЧ, ПРМНовый);
					
					СтрокаНайденная.Количество = СтрокаНайденная.Количество - КоличествоВПРМ; 
					
				Иначе 
					Продолжить; 
				КонецЕсли;
				
			КонецЦикла;
			
			Если ПРМНовый.Товары.Количество() > 0   Тогда
			
				МассивПРМСозданных.Добавить(ПРМНовый); 	
			
			КонецЕсли;
			
		КонецЦикла;
		
		
	КонецЕсли;
	//--Данилова Е.В. 25.11.2025 
	
	//Михайловский 20220914 корректировка переношу на пост-контроль +++
	
	//Михайловский 20220524 корректировка +++
	//Попытка
	//	ЗаписатьВЛог("Регламент","Контроль по остатку: ","Информация");
	//	ТЗ1=Подсортировка.Товары.Выгрузить();
	//	ТЗ2=Подсортировка2.Товары.Выгрузить();
	//	
	//	Запрос1 = Новый Запрос;
	//	Запрос1.Текст = 
	//	"ВЫБРАТЬ
	//	|ТЗНом.Номенклатура КАК Номенклатура,
	//	|ТЗНом.НомерСтроки КАК НомерСтроки,
	//	|ТЗНом.Количество КАК Количество
	//	
	//	|ПОМЕСТИТЬ ВТ_Ном
	//	|ИЗ
	//	|	&ТЗНом КАК ТЗНом
	//	|;
	//	|ВЫБРАТЬ
	//	|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	//	|	ОстаткиТМЦОстатки.КоличествоОстаток - ЕстьNull(РезервыТМЦОстатки.КоличествоОстаток,0) КАК Количество,
	//	|	ВТ_Ном.Количество КАК КолПрм,
	//	|	ВТ_Ном.НомерСтроки КАК НомерСтроки
	//	|ИЗ
	//	|	РегистрНакопления.ОстаткиТМЦ.Остатки(, Склад = &Склад) КАК ОстаткиТМЦОстатки
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(, Склад = &Склад) КАК РезервыТМЦОстатки
	//	|		ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
	//	|		СОЕДИНЕНИЕ ВТ_Ном КАК ВТ_Ном
	//	|		ПО ОстаткиТМЦОстатки.Номенклатура = ВТ_Ном.Номенклатура
	//	|		ГДЕ ВТ_Ном.Количество>(ОстаткиТМЦОстатки.КоличествоОстаток - ЕстьNull(РезервыТМЦОстатки.КоличествоОстаток,0))
	//	|	УПОРЯДОЧИТЬ ПО 4 УБЫВ
	//	|";
	//	
	//	
	//	Запрос1.УстановитьПараметр("Склад",Подсортировка.Склад);
	//	Запрос1.УстановитьПараметр("ТЗНом",ТЗ1);
	//	Выб1 = Запрос1.Выполнить().Выбрать();
	//	ЗаписатьВЛог("Регламент","Контроль по остатку:  кол поз1 "+Строка(Выб1.Количество()),"Информация");
	//	Пока Выб1.Следующий() Цикл
	//		
	//		СтрТЧ1=Подсортировка.Товары.Получить(Выб1.НомерСтроки-1);
	//		Если Выб1.Количество>0 Тогда
	//			
	//			СтрТЧ1.Заявка=Выб1.Количество;
	//			СтрТЧ1.ПодтвержденнаяЗаявка=Выб1.Количество;
	//			СтрТЧ1.Количество=Выб1.Количество;
	//			
	//			ПриИзмененииНоменклатурыТабЧасти(СтрТЧ1, Подсортировка);
	//			РассчитатьСуммуТабЧасти(СтрТЧ1, Подсортировка);
	//		Иначе
	//			Подсортировка.Товары.Удалить(Выб1.НомерСтроки-1);
	//		КонецЕсли;
	//	КонецЦикла;	
	//	Запрос2 = Новый Запрос;
	//	Запрос2.Текст = 
	//	"ВЫБРАТЬ
	//	|ТЗНом.Номенклатура КАК Номенклатура,
	//	|ТЗНом.НомерСтроки КАК НомерСтроки,
	//	|ТЗНом.Количество КАК Количество
	//	
	//	|ПОМЕСТИТЬ ВТ_Ном
	//	|ИЗ
	//	|	&ТЗНом КАК ТЗНом
	//	|;
	//	|ВЫБРАТЬ
	//	|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	//	|	ОстаткиТМЦОстатки.КоличествоОстаток - ЕстьNull(РезервыТМЦОстатки.КоличествоОстаток,0) КАК Количество,
	//	|	ВТ_Ном.Количество КАК КолПрм,
	//	|	ВТ_Ном.НомерСтроки КАК НомерСтроки
	//	|ИЗ
	//	|	РегистрНакопления.ОстаткиТМЦ.Остатки(, Склад = &Склад) КАК ОстаткиТМЦОстатки
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(, Склад = &Склад) КАК РезервыТМЦОстатки
	//	|		ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
	//	|		СОЕДИНЕНИЕ ВТ_Ном КАК ВТ_Ном
	//	|		ПО ОстаткиТМЦОстатки.Номенклатура = ВТ_Ном.Номенклатура
	//	|		ГДЕ ВТ_Ном.Количество>(ОстаткиТМЦОстатки.КоличествоОстаток - ЕстьNull(РезервыТМЦОстатки.КоличествоОстаток,0))
	//	|	УПОРЯДОЧИТЬ ПО 4 УБЫВ
	//	|";
	//	
	//	
	//	Запрос2.УстановитьПараметр("Склад",Подсортировка2.Склад);
	//	Запрос2.УстановитьПараметр("ТЗНом",ТЗ2);
	//	Выб2 = Запрос2.Выполнить().Выбрать();
	//	ЗаписатьВЛог("Регламент","Контроль по остатку:  кол поз1 "+Строка(Выб2.Количество()),"Информация");
	//	Пока Выб2.Следующий() Цикл
	//		
	//		СтрТЧ2=Подсортировка2.Товары.Получить(Выб2.НомерСтроки-1);
	//		Если Выб2.Количество>0 Тогда
	//			
	//			СтрТЧ2.Заявка=Выб2.Количество;
	//			СтрТЧ2.ПодтвержденнаяЗаявка=Выб2.Количество;
	//			СтрТЧ2.Количество=Выб2.Количество;
	//			
	//			ПриИзмененииНоменклатурыТабЧасти(СтрТЧ2, Подсортировка2);
	//			РассчитатьСуммуТабЧасти(СтрТЧ2, Подсортировка2);
	//		Иначе
	//			Подсортировка2.Товары.Удалить(Выб2.НомерСтроки-1);
	//		КонецЕсли;
	//	КонецЦикла;
	//Исключение
	//	ЗаписатьВЛог("Регламент","Контроль по остатку ошибка: "+ОписаниеОшибки(),"Информация");
	//КонецПопытки;	
	
	//Михайловский 20220524 корректировка   
	//++Данилова Е.В. 10.12.2025  SNL-51 
	
	НачатьТранзакцию(); 
	
	Для каждого НовыйПРМ1 Из МассивПРМСозданных1 Цикл
		УстановитьНомерДокументаКлиентСервер(НовыйПРМ1);
		НовыйПРМ1.Записать(РежимЗаписиДокумента.Проведение);
		СообщитьИзМодуля(НовыйПРМ1);	
		
	КонецЦикла;
	//Подсортировка.Записать(РежимЗаписиДокумента.Проведение);
	//СообщитьИзМодуля(Подсортировка);
	//
	//Подсортировка2.Записать(РежимЗаписиДокумента.Проведение);
	//СообщитьИзМодуля(Подсортировка2); 
	//--Данилова Е.В. 10.12.2025 
	//++Данилова Е.В. 26.11.2025 HELP-5920 
	Для каждого НовыйПРМ Из МассивПРМСозданных Цикл
		УстановитьНомерДокументаКлиентСервер(НовыйПРМ);	
		НовыйПРМ.Записать(РежимЗаписиДокумента.Проведение);
		СообщитьИзМодуля(НовыйПРМ);	
		
	КонецЦикла;
	
	Если  ТранзакцияАктивна() Тогда
		
		ЗафиксироватьТранзакцию();	
		
	КонецЕсли;
	//--Данилова Е.В. 26.11.2025 
	//Михайловский 20220914 корректировка переношу сюда
	Попытка
		ЗаписатьВЛог("Регламент","Контроль по остатку: ","Информация"); 
		//++Данилова Е.В. 26.11.2025 HELP-5920 
		//ТЗ1=Подсортировка.Товары.Выгрузить();
		//ТЗ2=Подсортировка2.Товары.Выгрузить();
		//
		//Запрос1 = Новый Запрос;
		//Запрос1.Текст = 
		//"ВЫБРАТЬ
		//|ТЗНом.Номенклатура КАК Номенклатура,
		//|ТЗНом.НомерСтроки КАК НомерСтроки,
		//|ТЗНом.Количество КАК Количество
		//
		//|ПОМЕСТИТЬ ВТ_Ном
		//|ИЗ
		//|	&ТЗНом КАК ТЗНом
		//|;
		//|ВЫБРАТЬ
		//|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
		//|	ОстаткиТМЦОстатки.КоличествоОстаток - ЕстьNull(РезервыТМЦОстатки.КоличествоОстаток,0) КАК Количество,
		//|	ВТ_Ном.Количество КАК КолПрм,
		//|	ВТ_Ном.НомерСтроки КАК НомерСтроки
		//|ИЗ
		//|	РегистрНакопления.ОстаткиТМЦ.Остатки(, Склад = &Склад) КАК ОстаткиТМЦОстатки
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(, Склад = &Склад) КАК РезервыТМЦОстатки
		//|		ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
		//|		СОЕДИНЕНИЕ ВТ_Ном КАК ВТ_Ном
		//|		ПО ОстаткиТМЦОстатки.Номенклатура = ВТ_Ном.Номенклатура
		//|		ГДЕ (ОстаткиТМЦОстатки.КоличествоОстаток - ЕстьNull(РезервыТМЦОстатки.КоличествоОстаток,0))<0
		//|	УПОРЯДОЧИТЬ ПО 4 УБЫВ
		//|";
		//
		//
		//Запрос1.УстановитьПараметр("Склад",Подсортировка.Склад);
		//Запрос1.УстановитьПараметр("ТЗНом",ТЗ1);
		//Выб1 = Запрос1.Выполнить().Выбрать();
		//ЗаписатьВЛог("Регламент","Контроль по остатку:  кол поз1 "+Строка(Выб1.Количество()),"Информация");
		//ЕстьМод=Ложь;
		//Пока Выб1.Следующий() Цикл
		//	ЕстьМод=Истина;
		//	СтрТЧ1=Подсортировка.Товары.Получить(Выб1.НомерСтроки-1);
		//	ФКол=Выб1.КолПрм+Выб1.Количество;
		//	Если (ФКол>0) Тогда
		//		
		//		СтрТЧ1.Заявка=ФКол;
		//		СтрТЧ1.ПодтвержденнаяЗаявка=ФКол;
		//		СтрТЧ1.Количество=ФКол;
		//		
		//		ПриИзмененииНоменклатурыТабЧасти(СтрТЧ1, Подсортировка);
		//		РассчитатьСуммуТабЧасти(СтрТЧ1, Подсортировка);
		//	Иначе
		//		Подсортировка.Товары.Удалить(Выб1.НомерСтроки-1);
		//	КонецЕсли;
		//КонецЦикла;	
		//Если ЕстьМод Тогда
		//	Подсортировка.Записать(РежимЗаписиДокумента.Проведение);
		//	ЗаписатьВЛог("Регламент","Контроль по остатку:  перезаписан документ  "+Строка(Подсортировка.Номер),"Информация");
		//КонецЕсли;	
		//Запрос2 = Новый Запрос;
		//Запрос2.Текст = 
		//"ВЫБРАТЬ
		//|ТЗНом.Номенклатура КАК Номенклатура,
		//|ТЗНом.НомерСтроки КАК НомерСтроки,
		//|ТЗНом.Количество КАК Количество
		//
		//|ПОМЕСТИТЬ ВТ_Ном
		//|ИЗ
		//|	&ТЗНом КАК ТЗНом
		//|;
		//|ВЫБРАТЬ
		//|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
		//|	ОстаткиТМЦОстатки.КоличествоОстаток - ЕстьNull(РезервыТМЦОстатки.КоличествоОстаток,0) КАК Количество,
		//|	ВТ_Ном.Количество КАК КолПрм,
		//|	ВТ_Ном.НомерСтроки КАК НомерСтроки
		//|ИЗ
		//|	РегистрНакопления.ОстаткиТМЦ.Остатки(, Склад = &Склад) КАК ОстаткиТМЦОстатки
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(, Склад = &Склад) КАК РезервыТМЦОстатки
		//|		ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
		//|		СОЕДИНЕНИЕ ВТ_Ном КАК ВТ_Ном
		//|		ПО ОстаткиТМЦОстатки.Номенклатура = ВТ_Ном.Номенклатура
		//|		ГДЕ (ОстаткиТМЦОстатки.КоличествоОстаток - ЕстьNull(РезервыТМЦОстатки.КоличествоОстаток,0))<0
		//|	УПОРЯДОЧИТЬ ПО 4 УБЫВ
		//|";
		//
		//
		//Запрос2.УстановитьПараметр("Склад",Подсортировка2.Склад);
		//Запрос2.УстановитьПараметр("ТЗНом",ТЗ2);
		//ЕстьМод1=Ложь;
		//Выб2 = Запрос2.Выполнить().Выбрать();
		//ЗаписатьВЛог("Регламент","Контроль по остатку:  кол поз2 "+Строка(Выб2.Количество()),"Информация");
		//Пока Выб2.Следующий() Цикл
		//	ЕстьМод1=Истина;
		//	СтрТЧ2=Подсортировка2.Товары.Получить(Выб2.НомерСтроки-1);
		//	ФКол1=Выб2.КолПрм+Выб2.Количество;
		//	Если (ФКол1>0) Тогда
		//		
		//		СтрТЧ2.Заявка=ФКол1;
		//		СтрТЧ2.ПодтвержденнаяЗаявка=ФКол1;
		//		СтрТЧ2.Количество=ФКол1;
		//		
		//		ПриИзмененииНоменклатурыТабЧасти(СтрТЧ2, Подсортировка2);
		//		РассчитатьСуммуТабЧасти(СтрТЧ2, Подсортировка2);
		//	Иначе
		//		Подсортировка2.Товары.Удалить(Выб2.НомерСтроки-1);
		//	КонецЕсли;
		//КонецЦикла;
		//Если ЕстьМод1 Тогда
		//	Подсортировка2.Записать(РежимЗаписиДокумента.Проведение);
		//	ЗаписатьВЛог("Регламент","Контроль по остатку:  перезаписан документ  "+Строка(Подсортировка2.Номер),"Информация");
		//КонецЕсли;
		//++Данилова Е.В. 10.12.2025
		Для каждого   НовыйПРМ1 Из МассивПРМСозданных1  Цикл
			
			КорректировкаПРМПоОстаткам(НовыйПРМ1);	
			
		КонецЦикла;
		//КорректировкаПРМПоОстаткам(Подсортировка); 
		//КорректировкаПРМПоОстаткам(Подсортировка2);
		//--Данилова Е.В. 10.12.2025 
		Для каждого НовыйПРМ Из МассивПРМСозданных Цикл
		
			КорректировкаПРМПоОстаткам(НовыйПРМ);	
		
		КонецЦикла;
		//--Данилова Е.В. 26.11.2025 
	Исключение
		ЗаписатьВЛог("Регламент","Контроль по остатку ошибка: "+ОписаниеОшибки(),"Информация");
	КонецПопытки;	
	
	
	//Михайловский 20220914 корректировка переношу на пост-контроль ---  
	//++Данилова Е.В. 10.12.2025 SNL-51 
	СформироватьОбратныеПРМcFBS(ТЗНоменклатурыКопия,Параметры); 
	//--Данилова Е.В. 10.12.2025 
	 
КонецПроцедуры

Процедура УстановитьПунктДоставки1(ДокументОбъект,ИмяРеквизитаКонтрагент="Контрагент",ИмяРеквизитаПД="ПунктДоставки") Экспорт	
	Контрагент		=ДокументОбъект[ИмяРеквизитаКонтрагент];
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Если ЕстьРеквизитДокумента("ОсновнойПунктДоставки",Контрагент.Метаданные()) И ЗначениеЗаполнено(Контрагент.ОсновнойПунктДоставки) Тогда
			ДокументОбъект[ИмяРеквизитаПД]=Контрагент.ОсновнойПунктДоставки;	
		ИначеЕсли КоличествоПД1(Контрагент)=1 Тогда		
			Выборка=Справочники.ПунктыДоставки.Выбрать(,Контрагент);
			Пока Выборка.Следующий() Цикл
				ДокументОбъект[ИмяРеквизитаПД]=Выборка.Ссылка;			
			КонецЦикла;
			//крохин начало
			//для складов, если несколько ПД, выбираем первый
		ИначеЕсли ИмяРеквизитаКонтрагент = "СкладПолучатель" Тогда
			//крохин начало 28.07.2011
			//выбираем первый по наименованию
			//Выборка=Справочники.ПунктыДоставки.Выбрать(,Контрагент);
			Выборка=Справочники.ПунктыДоставки.Выбрать(,Контрагент,,"Наименование Убыв");
			//крохин конец 28.07.2011
			Пока Выборка.Следующий() Цикл
				ДокументОбъект[ИмяРеквизитаПД]=Выборка.Ссылка;			
			КонецЦикла;
			//крохин конец
		Иначе
			ДокументОбъект[ИмяРеквизитаПД]=Неопределено;		
		КонецЕсли;		
	Иначе
		ДокументОбъект[ИмяРеквизитаПД]=Неопределено;		
	КонецЕсли;	
КонецПроцедуры

Функция КоличествоПД1(Контрагент)
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ссылка) КАК Количество
		|ИЗ
		|	Справочник.ПунктыДоставки КАК ПунктыДоставки
		|ГДЕ
		|	Владелец = &Владелец";
		
		Запрос.УстановитьПараметр("Владелец",Контрагент);
		
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Количество;			
		КонецЕсли;		
	КонецЕсли;
	
	Возврат 0;
КонецФункции //КоличествоПД(Контрагент)

//++Данилова Е.В. 26.11.2025 HELP-5920 
//перенесла создание шапки в отдельную функцию 
Функция СоздатьДокументПРМ(Знач СкладПолучатель, Знач СкладОтправитель, ДопКомментарий = "")

	Подсортировка=документы.Перемещение.СоздатьДокумент();
	Подсортировка.Склад = СкладОтправитель; //Параметры.Получить("СкладОтправитель");
	Подсортировка.СкладПолучатель = СкладПолучатель; //Параметры.Получить("СкладFBS");
	Подсортировка.ИБ=Справочники.ИБ.НайтиПоКоду("SSP");
	Подсортировка.Менеджер=ПараметрыСеанса.Пользователь.ФизЛицо;
	Подсортировка.Автор=ПараметрыСеанса.Пользователь;
	Подсортировка.Организация=Справочники.Организации.НайтиПоКоду("SS-001");
	УстановитьПунктДоставки1(Подсортировка,"СкладПолучатель","ПунктДоставки");
	
	Подсортировка.Комментарий="Создано обработкой Формирование перемещений FBS " + ДопКомментарий;
	Подсортировка.СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена;
	Подсортировка.СостояниеНакладнойУПолучателя=Перечисления.СостоянияНакладной.Принята;
	Подсортировка.Отгружен=Перечисления.Отгружен.Отгружен;
	Подсортировка.Дата=ТекущаяДата();
	Подсортировка.ДатаПриемки = ТекущаяДата();
	Подсортировка.Валюта=Справочники.Валюты.НайтиПоКоду("810");
	Подсортировка.Курс=1;
	
	УстановитьНомерДокументаКлиентСервер(Подсортировка);
	
	Возврат Подсортировка; 


КонецФункции // () 

//вынесла в отдельную процедуру 
Процедура КорректировкаПРМПоОстаткам(ПРМОбъект)

	ТЗ1 = ПРМОбъект.Товары.Выгрузить();
		
	Запрос1 = Новый Запрос;
	Запрос1.Текст = 
	"ВЫБРАТЬ
	|ТЗНом.Номенклатура КАК Номенклатура,
	|ТЗНом.НомерСтроки КАК НомерСтроки,
	|ТЗНом.Количество КАК Количество
	
	|ПОМЕСТИТЬ ВТ_Ном
	|ИЗ
	|	&ТЗНом КАК ТЗНом
	|;
	|ВЫБРАТЬ
	|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиТМЦОстатки.КоличествоОстаток - ЕстьNull(РезервыТМЦОстатки.КоличествоОстаток,0) КАК Количество,
	|	ВТ_Ном.Количество КАК КолПрм,
	|	ВТ_Ном.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(, Склад = &Склад) КАК ОстаткиТМЦОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(, Склад = &Склад) КАК РезервыТМЦОстатки
	|		ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
	|		СОЕДИНЕНИЕ ВТ_Ном КАК ВТ_Ном
	|		ПО ОстаткиТМЦОстатки.Номенклатура = ВТ_Ном.Номенклатура
	|		ГДЕ (ОстаткиТМЦОстатки.КоличествоОстаток - ЕстьNull(РезервыТМЦОстатки.КоличествоОстаток,0))<0
	|	УПОРЯДОЧИТЬ ПО 4 УБЫВ
	|";
	
	
	Запрос1.УстановитьПараметр("Склад",ПРМОбъект.Склад);
	Запрос1.УстановитьПараметр("ТЗНом",ТЗ1);
	Выб1 = Запрос1.Выполнить().Выбрать();
	ЗаписатьВЛог("Регламент","Контроль по остатку:  кол поз1 "+Строка(Выб1.Количество()),"Информация");
	ЕстьМод=Ложь;
	Пока Выб1.Следующий() Цикл
		ЕстьМод=Истина;
		СтрТЧ1=ПРМОбъект.Товары.Получить(Выб1.НомерСтроки-1);
		ФКол=Выб1.КолПрм+Выб1.Количество;
		Если (ФКол>0) Тогда
			
			СтрТЧ1.Заявка=ФКол;
			СтрТЧ1.ПодтвержденнаяЗаявка=ФКол;
			СтрТЧ1.Количество=ФКол;
			
			ПриИзмененииНоменклатурыТабЧасти(СтрТЧ1, ПРМОбъект);
			РассчитатьСуммуТабЧасти(СтрТЧ1, ПРМОбъект);
		Иначе
			ПРМОбъект.Товары.Удалить(Выб1.НомерСтроки-1);
		КонецЕсли;
	КонецЦикла;	
	Если ЕстьМод Тогда
		ПРМОбъект.Записать(РежимЗаписиДокумента.Проведение);
		ЗаписатьВЛог("Регламент","Контроль по остатку:  перезаписан документ  "+Строка(ПРМОбъект.Номер),"Информация");
	КонецЕсли;	
	

КонецПроцедуры
 //--Данилова Е.В. 26.11.2025 
 
 //++Данилова Е.В. 10.12.2025  SNL-51 
 
 Процедура СформироватьОбратныеПРМcFBS(ТЧТоваров,ПараметрыРегламента,ДопКомментарий = "")
	 
		//Возврат; 
 	   //вычислим общий остаток, вычислим разницу, чтобы перенести, получим табблицу остатков и перенесем
	   
	   СкладПолучательМаркировка = ПараметрыРегламента.Получить("СкладПолучательМаркировка");
	   СкладПолучатель = ПараметрыРегламента.Получить("СкладПолучатель"); 
	   СкладFBSОбычный = ПараметрыРегламента.Получить("СкладFBS");
	   СкладFBSМаркировка  = ПараметрыРегламента.Получить("СкладFBSМаркировка");
	   
	   Если Не ЗначениеЗаполнено(СкладПолучательМаркировка) 
		   ИЛИ НЕ ЗначениеЗаполнено(СкладПолучатель)  Тогда
		   
		   ЗаписатьВЛог("Регламент","Не заполнены склады получатели. Обработка формирования ПРМ с FBS прервана.","Информация"); 
	   
	   	Возврат; 	
	   
	   КонецЕсли;
	   
	   Запрос = Новый Запрос;
	   Запрос.Текст = "ВЫБРАТЬ
	   |	ТЗТовары.Количество КАК Количество,
	   |	ТЗТовары.Номенклатура КАК Номенклатура
	   |ПОМЕСТИТЬ ВТТовары
	   |ИЗ
	   |	&ТЗТовары КАК ТЗТовары
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ
	   |	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	   |	ОстаткиТМЦОстатки.КоличествоОстаток - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) КАК Количество
	   |ПОМЕСТИТЬ ВТОстаткиFBS
	   |ИЗ
	   |	РегистрНакопления.ОстаткиТМЦ.Остатки(
	   |			&Дата1,
	   |			Склад В (&СкладыFBS)
	   |				И Номенклатура В
	   |					(ВЫБРАТЬ
	   |						ВТТовары.Номенклатура
	   |					ИЗ
	   |						ВТТовары КАК ВТТовары)) КАК ОстаткиТМЦОстатки
	   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	   |				&Дата1,
	   |				Склад В (&СкладыFBS)
	   |					И Номенклатура В
	   |						(ВЫБРАТЬ
	   |							ВТТовары.Номенклатура
	   |						ИЗ
	   |							ВТТовары КАК ВТТовары)) КАК РезервыТМЦОстатки
	   |		ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
	   |ГДЕ
	   |	ОстаткиТМЦОстатки.КоличествоОстаток - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) > 0
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ
	   |	ВТТовары.Номенклатура КАК Номенклатура,
	   |	ВТОстаткиFBS.Количество - ВТТовары.Количество КАК Разница
	   |ПОМЕСТИТЬ ВТТоварыДляПРМ
	   |ИЗ
	   |	ВТТовары КАК ВТТовары
	   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОстаткиFBS КАК ВТОстаткиFBS
	   |		ПО ВТТовары.Номенклатура = ВТОстаткиFBS.Номенклатура
	   |ГДЕ
	   |	ВТОстаткиFBS.Количество - ВТТовары.Количество > 0
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ
	   |	ОстаткиТМЦОстатки.Склад КАК Склад,
	   |	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	   |	ОстаткиТМЦОстатки.КоличествоОстаток - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) КАК Остаток
	   |ИЗ
	   |	РегистрНакопления.ОстаткиТМЦ.Остатки(
	   |			&Дата1,
	   |			Склад В (&СкладыFBS)
	   |				И Номенклатура В
	   |					(ВЫБРАТЬ
	   |						ВТТовары.Номенклатура
	   |					ИЗ
	   |						ВТТоварыДляПРМ КАК ВТТовары)) КАК ОстаткиТМЦОстатки
	   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	   |				&Дата1,
	   |				Склад В (&СкладыFBS)
	   |					И Номенклатура В
	   |						(ВЫБРАТЬ
	   |							ВТТовары.Номенклатура
	   |						ИЗ
	   |							ВТТоварыДляПРМ КАК ВТТовары)) КАК РезервыТМЦОстатки
	   |		ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
	   |			И ОстаткиТМЦОстатки.Склад = РезервыТМЦОстатки.Склад
	   |ГДЕ
	   |	ОстаткиТМЦОстатки.КоличествоОстаток - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) > 0
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ
	   |	ВТТоварыДляПРМ.Номенклатура КАК Номенклатура,
	   |	ВТТоварыДляПРМ.Разница КАК Количество
	   |ИЗ
	   |	ВТТоварыДляПРМ КАК ВТТоварыДляПРМ";
	   Запрос.УстановитьПараметр("Дата1",ТекущаяДата());
	   Запрос.УстановитьПараметр("ТЗТовары",ТЧТоваров);
	   
	   СкладыFBS = Новый Массив; 
	   СкладыFBS.Добавить(СкладFBSОбычный);
	   СкладыFBS.Добавить(СкладFBSМаркировка);
	   
	   Запрос.УстановитьПараметр("СкладыFBS",СкладыFBS);
	   
	   ПакетРезультатов = Запрос.ВыполнитьПакет(); 
	   
	   Выборка = ПакетРезультатов[3].выбрать(); 
	   
	   ТЧТоварыДляПРМ = ПакетРезультатов[4].Выгрузить(); 
	   
	   ДокПРММаркировка = СоздатьДокументПРМ(СкладПолучательМаркировка,СкладFBSМаркировка, ДопКомментарий); 
	   ДокПРМОбычный = СоздатьДокументПРМ(СкладПолучатель,СкладFBSОбычный,ДопКомментарий); 
	   
	   Для каждого СтрокаТоваров Из ТЧТоварыДляПРМ Цикл
	   
	   	  КоличествоПереместить = СтрокаТоваров.Количество; 
		  Отбор = Новый Структура("Номенклатура",СтрокаТоваров.Номенклатура); 
		  
		  Пока Выборка.НайтиСледующий(Отбор) Цикл
			  
			  Если КоличествоПереместить = 0 Тогда
				  
				  Прервать; 	
				  
			  КонецЕсли;
			  
			  Остаток = Выборка.Остаток;
			  Кол = Мин(Остаток,КоличествоПереместить); 
			  
			  Если Выборка.Склад.ЭтоСкладМаркированногоТовара Тогда
				  
				  СтрТЧ = ДокПРММаркировка.Товары.Добавить(); 
				  СтрТЧ.Номенклатура	=	СтрокаТоваров.номенклатура;
				  СтрТЧ.Заявка		=	Кол;
				  стртч.ПодтвержденнаяЗаявка				=	Кол;			
				  стртч.ПодтвержденнаяЗаявкаПеремещения	=	стртч.ПодтвержденнаяЗаявка;
				  СтрТЧ.Количество						=	стртч.ПодтвержденнаяЗаявка;				
				  
				  ПриИзмененииНоменклатурыТабЧасти(СтрТЧ, ДокПРММаркировка);
				  РассчитатьСуммуТабЧасти(СтрТЧ, ДокПРММаркировка);
				  
			  Иначе 
				  СтрТЧ = ДокПРМОбычный.Товары.Добавить();
				  СтрТЧ.Номенклатура	=	СтрокаТоваров.номенклатура;
				  СтрТЧ.Заявка		=	Кол;
				  стртч.ПодтвержденнаяЗаявка				=	Кол;			
				  стртч.ПодтвержденнаяЗаявкаПеремещения	=	стртч.ПодтвержденнаяЗаявка;
				  СтрТЧ.Количество						=	стртч.ПодтвержденнаяЗаявка;				
				  
				  ПриИзмененииНоменклатурыТабЧасти(СтрТЧ, ДокПРМОбычный);
				  РассчитатьСуммуТабЧасти(СтрТЧ, ДокПРМОбычный);
			  КонецЕсли;
			  
			  КоличествоПереместить = КоличествоПереместить - Кол; 
			  
		  КонецЦикла;
		  
		  Выборка.Сбросить(); 
	   
	  КонецЦикла;
	  НачатьТранзакцию(); 
	  Если ДокПРМОбычный.Товары.Количество() > 0  Тогда
		  
		  
		  ДокПРМОбычный.Записать(РежимЗаписиДокумента.Проведение); 
		  
	  КонецЕсли;
	  
	  Если ДокПРММаркировка.Товары.Количество() > 0  Тогда
		  
		  
		  ДокПРММаркировка.Записать(РежимЗаписиДокумента.Проведение); 
		  
	  КонецЕсли;
	  Если ТранзакцияАктивна() Тогда
		  
		  ЗафиксироватьТранзакцию();	
		  
	  КонецЕсли;
	  
	   
	   
 КонецПроцедуры
 
 //--Данилова Е.В. 10.12.2025 
 
 //++Данилова Е.В. 19.12.2025 SNL-52 
 Функция СформироватьПРМНаСпайки(Знач СписокДействующихМатриц, Знач Параметры, ТЗСпайкиИсключить )
 
 	МассивСкладов = Новый Массив; 
	Для НомерПараметра = 1 По 10 Цикл 
		Если Параметры.Получить("СкладОтправительСпайки"+Строка(НомерПараметра)) <> Неопределено Тогда
			
			МассивСкладов.Добавить(Параметры.Получить("СкладОтправительСпайки"+Строка(НомерПараметра))); 
			
		КонецЕсли;	
	КонецЦикла;
	
	
	ОписаниеТиповСклад = Новый ОписаниеТипов("СправочникСсылка.Склады");
	ОписаниеТиповЧисло = Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(14)); 
	
	ТаблицаСкладовПоПриоритетам = Новый ТаблицаЗначений;
	ТаблицаСкладовПоПриоритетам.Колонки.Добавить("Склад",ОписаниеТиповСклад);
	ТаблицаСкладовПоПриоритетам.Колонки.Добавить("Приоритет",ОписаниеТиповЧисло);
	Приоритет = 1; 
	Для каждого СкладИзНастроек Из МассивСкладов Цикл
		НСтрока = ТаблицаСкладовПоПриоритетам.Добавить(); 
		НСтрока.Склад = СкладИзНастроек; 
		НСтрока.Приоритет = Приоритет; 
		
		Приоритет = Приоритет +1; 		
	КонецЦикла;
	
	//для тестов 
	//Товар = Параметры.Получить("Товар"); 	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МатрицаТовары.Номенклатура КАК Номенклатура,
	|	ВЫБОР КОГДА МАКСИМУМ(МатрицаТовары.МинимальноеКоличество)>МАКСИМУМ(МатрицаТовары.МинимальныйОстатокКоличество) ТОГДА
	|	МАКСИМУМ(МатрицаТовары.МинимальноеКоличество) ИНАЧЕ МАКСИМУМ(МатрицаТовары.МинимальныйОстатокКоличество) КОНЕЦ КАК Количество,
	|	0 КАК ОбщийОстаток
	|ИЗ
	|	Документ.Матрица.Товары КАК МатрицаТовары  
	////ТЕСТ 
	//|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
	//|	ПО МатрицаТовары.Номенклатура = НоменклатураКоплектующие.Ссылка
	|ГДЕ
	|	МатрицаТовары.Ссылка В(&СписокДействующихМатриц) //И  (МатрицаТовары.Номенклатура = &Товар ИЛИ НоменклатураКоплектующие.Номенклатура =  &Товар) 
	|   И  МатрицаТовары.Номенклатура.Родитель.ВидКомплекта = &Спайка
	|СГРУППИРОВАТЬ ПО
	|	МатрицаТовары.Номенклатура
	| 
	|	ИМЕЮЩИЕ ВЫБОР КОГДА МАКСИМУМ(МатрицаТовары.МинимальноеКоличество)>МАКСИМУМ(МатрицаТовары.МинимальныйОстатокКоличество) ТОГДА
	|	МАКСИМУМ(МатрицаТовары.МинимальноеКоличество) ИНАЧЕ МАКСИМУМ(МатрицаТовары.МинимальныйОстатокКоличество) КОНЕЦ > 0
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("СписокДействующихМатриц",СписокДействующихМатриц); 
	Запрос.УстановитьПараметр("Спайка",Перечисления.ВидыКомплектов.Комплект);
	/////////////ТЕСТ
	//Запрос.УстановитьПараметр("Товар",Товар); 
	////////////////////////////
	ТЗНоменклатуры = Запрос.Выполнить().Выгрузить(); 
	
    ТЗНоменклатурыКопия = ТЗНоменклатуры.Скопировать(); //для расчета обратного ПРМ 
	
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаСкладовПоПриоритетам.Склад КАК Склад,
	               |	ТаблицаСкладовПоПриоритетам.Приоритет КАК Приоритет
	               |ПОМЕСТИТЬ ВТСкладыПоПриоритетам
	               |ИЗ
	               |	&ТаблицаСкладовПоПриоритетам КАК ТаблицаСкладовПоПриоритетам
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗТовары.Количество КАК Количество,
	               |	ТЗТовары.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТТовары
	               |ИЗ
	               |	&ТЗТовары КАК ТЗТовары
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	               |	ОстаткиТМЦОстатки.КоличествоОстаток - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) КАК Количество
	               |ПОМЕСТИТЬ ВТОстаткиFBS
	               |ИЗ
	               |	РегистрНакопления.ОстаткиТМЦ.Остатки(
	               |			&Дата1,
	               |			Склад В (&СкладыFBS)
	               |				И Номенклатура В
	               |					(ВЫБРАТЬ
	               |						ВТТовары.Номенклатура
	               |					ИЗ
	               |						ВТТовары КАК ВТТовары)) КАК ОстаткиТМЦОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	               |				&Дата1,
	               |				Склад В (&СкладыFBS)
	               |					И Номенклатура В
	               |						(ВЫБРАТЬ
	               |							ВТТовары.Номенклатура
	               |						ИЗ
	               |							ВТТовары КАК ВТТовары)) КАК РезервыТМЦОстатки
	               |		ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
	               |ГДЕ
	               |	ОстаткиТМЦОстатки.КоличествоОстаток - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТТовары.Номенклатура КАК Номенклатура,
	               |	ВТТовары.Количество КАК Количество,
	               |	ВТСкладыПоПриоритетам.Склад КАК Склад,
	               |	ВТСкладыПоПриоритетам.Приоритет КАК Приоритет
	               |ПОМЕСТИТЬ ВТТоварыПоСкладам
	               |ИЗ
	               |	ВТТовары КАК ВТТовары,
	               |	ВТСкладыПоПриоритетам КАК ВТСкладыПоПриоритетам
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТТовары.Склад КАК Склад,
	               |	ВТТовары.Приоритет КАК Приоритет,
	               |	ВТТовары.Номенклатура КАК Номенклатура,
	               |	ВТТовары.Количество КАК Количество,
	               |	ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) КАК Остаток,
	               |	ЕСТЬNULL(ВТОстаткиFBS.Количество, 0) КАК ОстатокFBS
	               |ПОМЕСТИТЬ ВТОстатки
	               |ИЗ
	               |	ВТТоварыПоСкладам КАК ВТТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(
	               |				&Дата1,
	               |				Склад В
	               |					(ВЫБРАТЬ
	               |						ВТСкладыПоПриоритетам.Склад
	               |					ИЗ
	               |						ВТСкладыПоПриоритетам КАК ВТСкладыПоПриоритетам)) КАК ОстаткиТМЦОстатки
	               |		ПО ВТТовары.Номенклатура = ОстаткиТМЦОстатки.Номенклатура
	               |			И ВТТовары.Склад = ОстаткиТМЦОстатки.Склад
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	               |				&Дата1,
	               |				Склад В
	               |					(ВЫБРАТЬ
	               |						ВТСкладыПоПриоритетам.Склад
	               |					ИЗ
	               |						ВТСкладыПоПриоритетам КАК ВТСкладыПоПриоритетам)) КАК РезервыТМЦОстатки
	               |		ПО (ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура)
	               |			И (ОстаткиТМЦОстатки.Склад = РезервыТМЦОстатки.Склад)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиFBS КАК ВТОстаткиFBS
	               |		ПО (ВТОстаткиFBS.Номенклатура = ВТТовары.Номенклатура)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТОстатки.Номенклатура КАК Номенклатура,
				   //++Данилова Е.В. 15.01.2026 SNL-98
	               |	СУММА(ВЫБОР
	               |			КОГДА ВТОстатки.Остаток < 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ВТОстатки.Остаток
	               |		КОНЕЦ) КАК Остаток,
				   //--Данилова Е.В. 15.01.2026 
	               |	МАКСИМУМ(ВТОстатки.Количество) КАК КоличествоМин,
	               |	МАКСИМУМ(ВТОстатки.ОстатокFBS) КАК ОстатокFBS,
	               |	СУММА(ВТОстатки.Остаток) + МАКСИМУМ(ВТОстатки.ОстатокFBS) КАК Количество
	               |ИЗ
	               |	ВТОстатки КАК ВТОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТОстатки.Номенклатура
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(ВТОстатки.Остаток) + МАКСИМУМ(ВТОстатки.ОстатокFBS) > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТТовары.Номенклатура КАК Номенклатура,
	               |	ВЫБОР
	               |		КОГДА ВТТовары.Количество - ЕСТЬNULL(ВТОстаткиFBS.Количество, 0) > 0
	               |			ТОГДА ВТТовары.Количество - ЕСТЬNULL(ВТОстаткиFBS.Количество, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Количество
	               |ИЗ
	               |	ВТТовары КАК ВТТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиFBS КАК ВТОстаткиFBS
	               |		ПО (ВТОстаткиFBS.Номенклатура = ВТТовары.Номенклатура)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТОстатки.Склад КАК Склад,
	               |	ВТОстатки.Номенклатура КАК Номенклатура,
	               |	ВТОстатки.Остаток КАК Остаток
	               |ИЗ
	               |	ВТОстатки КАК ВТОстатки
	               |ГДЕ
	               |	ВТОстатки.Остаток > 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВТОстатки.Приоритет
	               |ИТОГИ ПО
	               |	Склад";
	
	Запрос.УстановитьПараметр("Дата1",ТекущаяДата());
	Запрос.УстановитьПараметр("ТаблицаСкладовПоПриоритетам",ТаблицаСкладовПоПриоритетам);
	Запрос.УстановитьПараметр("ТЗТовары",ТЗНоменклатуры); 
	СкладыFBS = Новый Массив;
	СкладыFBS.Добавить(Параметры.Получить("СкладFBS")); 
	СкладыFBS.Добавить(Параметры.Получить("СкладFBSМаркировка"));
	
	Запрос.УстановитьПараметр("СкладыFBS", СкладыFBS);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет(); 
	ТЗСпайкиИсключить 			= ПакетЗапросов[5].Выгрузить();
	ТЧКоличествоДляРаспределения 	= ПакетЗапросов[6].Выгрузить();
	ВыборкаОстаткиПоСкладам = ПакетЗапросов[7].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СкладFBSПолучатель = Параметры.Получить("СкладFBS");
	СкладFBSПолучательМаркировка = Параметры.Получить("СкладFBSМаркировка");

	МассивПРМСозданных1 = Новый Массив; 
	
	Пока ВыборкаОстаткиПоСкладам.Следующий() Цикл
		
		Если ВыборкаОстаткиПоСкладам.Склад.ЭтоСкладМаркированногоТовара Тогда
			
			СкладПолучатель = СкладFBSПолучательМаркировка; 	
		Иначе 
			СкладПолучатель = СкладFBSПолучатель; 
		КонецЕсли;
		
		ПРМНовый = СоздатьДокументПРМ(СкладПолучатель,ВыборкаОстаткиПоСкладам.Склад); 
		
		ВыборкаДетальныеЗаписи = ВыборкаОстаткиПоСкладам.Выбрать(); 
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ОтборНоменклатура = Новый Структура("Номенклатура",ВыборкаДетальныеЗаписи.Номенклатура); 	
			СтрокиНайденные = ТЧКоличествоДляРаспределения.НайтиСтроки(ОтборНоменклатура);
			Если СтрокиНайденные.Количество() > 0  Тогда
				
				СтрокаНайденная = СтрокиНайденные[0]; 
				НеобходимоеКоличество = СтрокаНайденная.Количество;
				
				Если НеобходимоеКоличество = 0 Тогда
					
					Продолжить;	
					
				КонецЕсли;
				
				КоличествоВПРМ = Мин(НеобходимоеКоличество,ВыборкаДетальныеЗаписи.Остаток);					
				
				СтрТЧ	=	ПРМНовый.Товары.Добавить();
				СтрТЧ.Номенклатура	=	ВыборкаДетальныеЗаписи.номенклатура;
				СтрТЧ.Заявка		=	НеобходимоеКоличество;
				стртч.ПодтвержденнаяЗаявка				=	КоличествоВПРМ;			
				стртч.ПодтвержденнаяЗаявкаПеремещения	=	стртч.ПодтвержденнаяЗаявка;
				СтрТЧ.Количество						=	стртч.ПодтвержденнаяЗаявка;				
				
				ПриИзмененииНоменклатурыТабЧасти(СтрТЧ, ПРМНовый);
				РассчитатьСуммуТабЧасти(СтрТЧ, ПРМНовый);
				
				СтрокаНайденная.Количество = СтрокаНайденная.Количество - КоличествоВПРМ; 
				
			Иначе 
				Продолжить; 
			КонецЕсли;
			
		КонецЦикла;
		
		Если ПРМНовый.Товары.Количество() > 0   Тогда
			
			МассивПРМСозданных1.Добавить(ПРМНовый); 	
			
		КонецЕсли;
		
	КонецЦикла;
	
	НачатьТранзакцию(); 
	
	Для каждого НовыйПРМ1 Из МассивПРМСозданных1 Цикл
		УстановитьНомерДокументаКлиентСервер(НовыйПРМ1);
		НовыйПРМ1.Записать(РежимЗаписиДокумента.Проведение);
		СообщитьИзМодуля(НовыйПРМ1);	
		
	КонецЦикла; 	
		
	Если  ТранзакцияАктивна() Тогда
		
		ЗафиксироватьТранзакцию();	
		
	КонецЕсли;

	
    Возврат ТЗНоменклатурыКопия;  
	
 КонецФункции // СформироватьПРМНаСпайки()
 
 //--Данилова Е.В. 19.12.2025  
 
 //++Данилова Е.В. 28.01.2026 SNL-115 
 Функция СформироватьПРМнаFBS(Знач параметры, СписокДействующихМатриц,ТЗСпайкиИсключить)
	
	МассивСкладовОтправители = Новый Массив; 
	Для НомерПараметра = 1 По 10 Цикл 
		Если Параметры.Получить("СкладОтправительМаркировка"+Строка(НомерПараметра)) <> Неопределено Тогда
			
			МассивСкладовОтправители.Добавить(Параметры.Получить("СкладОтправительМаркировка"+Строка(НомерПараметра))); 
			
		КонецЕсли;	
	КонецЦикла;
	
	
	ОписаниеТиповСклад = Новый ОписаниеТипов("СправочникСсылка.Склады");
	ОписаниеТиповЧисло = Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(14)); 
	
	ТаблицаСкладовПоПриоритетам = Новый ТаблицаЗначений;
	ТаблицаСкладовПоПриоритетам.Колонки.Добавить("Склад",ОписаниеТиповСклад);
	ТаблицаСкладовПоПриоритетам.Колонки.Добавить("Приоритет",ОписаниеТиповЧисло);
	Приоритет = 1; 
	Для каждого СкладИзНастроек Из МассивСкладовОтправители Цикл
		НСтрока = ТаблицаСкладовПоПриоритетам.Добавить(); 
		НСтрока.Склад = СкладИзНастроек; 
		НСтрока.Приоритет = Приоритет; 
		
		Приоритет = Приоритет +1; 		
	КонецЦикла;
	
	//для тестов 
	//Товар = Параметры.Получить("Товар"); 	
	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	МатрицаТовары.Номенклатура КАК Номенклатура,
	//|	ВЫБОР КОГДА МАКСИМУМ(МатрицаТовары.МинимальноеКоличество)>МАКСИМУМ(МатрицаТовары.МинимальныйОстатокКоличество) ТОГДА
	//|	МАКСИМУМ(МатрицаТовары.МинимальноеКоличество) ИНАЧЕ МАКСИМУМ(МатрицаТовары.МинимальныйОстатокКоличество) КОНЕЦ КАК МинимальноеКоличество
	////|	МАКСИМУМ(МатрицаТовары.МинимальныйОстатокКоличество) КАК МинимальныйОстатокКоличество
	//|ИЗ
	//|	Документ.Матрица.Товары КАК МатрицаТовары  
	//////ТЕСТ 
	////|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
	////|	ПО МатрицаТовары.Номенклатура = НоменклатураКоплектующие.Ссылка
	//|ГДЕ
	//|	МатрицаТовары.Ссылка В(&СписокДействующихМатриц) //И  (МатрицаТовары.Номенклатура = &Товар ИЛИ НоменклатураКоплектующие.Номенклатура =  &Товар) 
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	МатрицаТовары.Номенклатура
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Номенклатура
	//|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос = Новый Запрос;
	Если ТЗСпайкиИсключить = неопределено Тогда 
		
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МатрицаТовары.Номенклатура КАК Номенклатура,
		|	ВЫБОР КОГДА МАКСИМУМ(МатрицаТовары.МинимальноеКоличество)>МАКСИМУМ(МатрицаТовары.МинимальныйОстатокКоличество) ТОГДА
		|	МАКСИМУМ(МатрицаТовары.МинимальноеКоличество) ИНАЧЕ МАКСИМУМ(МатрицаТовары.МинимальныйОстатокКоличество) КОНЕЦ КАК МинимальноеКоличество
		//|	МАКСИМУМ(МатрицаТовары.МинимальныйОстатокКоличество) КАК МинимальныйОстатокКоличество
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары  
		////ТЕСТ 
		//|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
		//|	ПО МатрицаТовары.Номенклатура = НоменклатураКоплектующие.Ссылка
		|ГДЕ
		|	МатрицаТовары.Ссылка В(&СписокДействующихМатриц) //И  (МатрицаТовары.Номенклатура = &Товар ИЛИ НоменклатураКоплектующие.Номенклатура =  &Товар) 
		|
		|СГРУППИРОВАТЬ ПО
		|	МатрицаТовары.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура
		|АВТОУПОРЯДОЧИВАНИЕ";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		|	ТЗСпайки.Номенклатура КАК Номенклатура,
		|	ТЗСпайки.КОличество КАК КОличество
		|ПОМЕСТИТЬ ВТСпайки
		|ИЗ
		|	&ТЗСпайки КАК ТЗСпайки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|	ВложенныйЗапрос.МинимальноеКоличество - ЕСТЬNULL(ВТСпайки.КОличество, 0) КАК МинимальноеКоличество
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		МатрицаТовары.Номенклатура КАК Номенклатура,
		|		ВЫБОР
		|			КОГДА МАКСИМУМ(МатрицаТовары.МинимальноеКоличество) > МАКСИМУМ(МатрицаТовары.МинимальныйОстатокКоличество)
		|				ТОГДА МАКСИМУМ(МатрицаТовары.МинимальноеКоличество)
		|			ИНАЧЕ МАКСИМУМ(МатрицаТовары.МинимальныйОстатокКоличество)
		|		КОНЕЦ КАК МинимальноеКоличество
		|	ИЗ
		|		Документ.Матрица.Товары КАК МатрицаТовары
		|	ГДЕ
		|		МатрицаТовары.Ссылка В(&СписокДействующихМатриц)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		МатрицаТовары.Номенклатура) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСпайки КАК ВТСпайки
		|		ПО (ВТСпайки.Номенклатура = ВложенныйЗапрос.Номенклатура)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВложенныйЗапрос.Номенклатура
		|АВТОУПОРЯДОЧИВАНИЕ";
		
	КонецЕсли;
	Запрос.УстановитьПараметр("СписокДействующихМатриц",СписокДействующихМатриц);
	Запрос.УстановитьПараметр("ТЗСпайки",ТЗСпайкиИсключить);
	/////////////ТЕСТ
	//Запрос.УстановитьПараметр("Товар",Товар); 
	////////////////////////////
	Выборка = Запрос.Выполнить().выбрать();
	
	
	ОписаниеТиповНоменклатура = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	
	ТЗНоменклатуры = Новый ТаблицаЗначений;
	ТЗНоменклатуры.Колонки.Добавить("Номенклатура",ОписаниеТиповНоменклатура);
	ТЗНоменклатуры.Колонки.Добавить("Количество",ОписаниеТиповЧисло);  
	
	
	//ТЗСпайки = Новый ТаблицаЗначений; 
	//ТЗСпайки.Колонки.Добавить("Номенклатура");
	//ТЗСпайки.Колонки.Добавить("Количество");
	//
	//ТЗНеСпайки = Новый ТаблицаЗначений; 
	//ТЗНеСпайки.Колонки.Добавить("Номенклатура");
	//ТЗНеСпайки.Колонки.Добавить("Количество");
	
	ОписаниеТиповНомен = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ОписаниеТиповЧисло = Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,0)); 
	ТЗНехватаетОстатков = Новый ТаблицаЗначений;
	ТЗНехватаетОстатков.Колонки.Добавить("Номенклатура",ОписаниеТиповНомен);
	ТЗНехватаетОстатков.Колонки.Добавить("Количество",ОписаниеТиповЧисло);	
	
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.МинимальноеКоличество > 0 Тогда
			СтрокаТЗ = Неопределено;
			Номенклатура = Выборка.Номенклатура;   	
			
			
			Если Номенклатура.Коплектующие.Количество() = 1  
				или (Номенклатура.родитель.ШтукВКомплекте>1 и Номенклатура.Коплектующие.Количество()>0) 
				Тогда	
				
				
				Для каждого СтрокаКомплектующих Из Номенклатура.Коплектующие Цикл
					//++Данилова Е.В. 15.01.2026
					Если СтрокаКомплектующих.Номенклатура.Родитель.ВидНоменклатуры <> Перечисления.ВидыНоменклаутры.Товар Тогда
						
						Продолжить; 	
						
					КонецЕсли;
					//--Данилова Е.В. 15.01.2026 
					СтрокаТЗ = ТЗНоменклатуры.Добавить();
					СтрокаТЗ.Номенклатура = СтрокаКомплектующих.Номенклатура;
					СтрокаТЗ.Количество = Выборка.МинимальноеКоличество*СтрокаКомплектующих.Количество;
				КонецЦикла;
				
				//СтрокаСпайки = ТЗСпайки.Добавить(); 
				//СтрокаСпайки.Номенклатура = Номенклатура; 
				//СтрокаСпайки.Количество   = Выборка.МинимальноеКоличество; 
				//
			ИначеЕсли  Номенклатура.Коплектующие.Количество() = 0 Тогда
				СтрокаТЗ = ТЗНоменклатуры.Добавить();
				СтрокаТЗ.Номенклатура = Выборка.Номенклатура;
				СтрокаТЗ.Количество = Выборка.МинимальноеКоличество;
				
				
				//СтрокаНеСпайки = ТЗНеСпайки.Добавить(); 
				//СтрокаНеСпайки.Номенклатура = Номенклатура; 
				//СтрокаНеСпайки.Количество   = Выборка.МинимальноеКоличество; 
				
			Иначе
				СообщитьИзМодуля("Некорректное количество комплектующих "+Номенклатура);
				СтрокаТЗ = ТЗНоменклатуры.Добавить();
				СтрокаТЗ.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
				СтрокаТЗ.Количество = 0;
			КонецЕсли;
			
			
			
		КонецЕсли;
	КонецЦикла; 
	
	ТЗНоменклатуры.Свернуть("Номенклатура","Количество");
	ТЗНоменклатуры.Сортировать("Номенклатура");
	
	ТЗНоменклатурыКопия = ТЗНоменклатуры.Скопировать();//для расчета обратного ПРМ  
	
	ТЗНоменклатуры.Колонки.Добавить("ОбщийОстаток",ОписаниеТиповЧисло); 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаСкладовПоПриоритетам.Склад КАК Склад,
	               |	ТаблицаСкладовПоПриоритетам.Приоритет КАК Приоритет
	               |ПОМЕСТИТЬ ВТСкладыПоПриоритетам
	               |ИЗ
	               |	&ТаблицаСкладовПоПриоритетам КАК ТаблицаСкладовПоПриоритетам
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗТовары.Количество КАК Количество,
	               |	ТЗТовары.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТТовары
	               |ИЗ
	               |	&ТЗТовары КАК ТЗТовары
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	               |	ОстаткиТМЦОстатки.КоличествоОстаток - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) КАК Количество
	               |ПОМЕСТИТЬ ВТОстаткиFBS
	               |ИЗ
	               |	РегистрНакопления.ОстаткиТМЦ.Остатки(
	               |			&Дата1,
	               |			Склад В (&СкладыFBS)
	               |				И Номенклатура В
	               |					(ВЫБРАТЬ
	               |						ВТТовары.Номенклатура
	               |					ИЗ
	               |						ВТТовары КАК ВТТовары)) КАК ОстаткиТМЦОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	               |				&Дата1,
	               |				Склад В (&СкладыFBS)
	               |					И Номенклатура В
	               |						(ВЫБРАТЬ
	               |							ВТТовары.Номенклатура
	               |						ИЗ
	               |							ВТТовары КАК ВТТовары)) КАК РезервыТМЦОстатки
	               |		ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
	               |ГДЕ
	               |	ОстаткиТМЦОстатки.КоличествоОстаток - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТТовары.Номенклатура КАК Номенклатура,
	               |	ВТТовары.Количество КАК Количество,
	               |	ВТСкладыПоПриоритетам.Склад КАК Склад,
	               |	ВТСкладыПоПриоритетам.Приоритет КАК Приоритет
	               |ПОМЕСТИТЬ ВТТоварыПоСкладам
	               |ИЗ
	               |	ВТТовары КАК ВТТовары,
	               |	ВТСкладыПоПриоритетам КАК ВТСкладыПоПриоритетам
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТТовары.Склад КАК Склад,
	               |	ВТТовары.Приоритет КАК Приоритет,
	               |	ВТТовары.Номенклатура КАК Номенклатура,
	               |	ВТТовары.Количество КАК Количество,
	               |	ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) КАК Остаток,
	               |	ЕСТЬNULL(ВТОстаткиFBS.Количество, 0) КАК ОстатокFBS
	               |ПОМЕСТИТЬ ВТОстатки
	               |ИЗ
	               |	ВТТоварыПоСкладам КАК ВТТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(
	               |				&Дата1,
	               |				Склад В
	               |					(ВЫБРАТЬ
	               |						ВТСкладыПоПриоритетам.Склад
	               |					ИЗ
	               |						ВТСкладыПоПриоритетам КАК ВТСкладыПоПриоритетам)) КАК ОстаткиТМЦОстатки
	               |		ПО ВТТовары.Номенклатура = ОстаткиТМЦОстатки.Номенклатура
	               |			И ВТТовары.Склад = ОстаткиТМЦОстатки.Склад
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	               |				&Дата1,
	               |				Склад В
	               |					(ВЫБРАТЬ
	               |						ВТСкладыПоПриоритетам.Склад
	               |					ИЗ
	               |						ВТСкладыПоПриоритетам КАК ВТСкладыПоПриоритетам)) КАК РезервыТМЦОстатки
	               |		ПО (ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура)
	               |			И (ОстаткиТМЦОстатки.Склад = РезервыТМЦОстатки.Склад)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиFBS КАК ВТОстаткиFBS
	               |		ПО (ВТОстаткиFBS.Номенклатура = ВТТовары.Номенклатура)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТОстатки.Номенклатура КАК Номенклатура,
				   //++Данилова Е.В. 15.01.2026  SNL-98
	               |	СУММА(ВЫБОР
	               |			КОГДА ВТОстатки.Остаток < 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ВТОстатки.Остаток
	               |		КОНЕЦ) КАК Остаток, 
				   //--Данилова Е.В. 15.01.2026 
	               |	МАКСИМУМ(ВТОстатки.Количество) КАК Количество,
	               |	МАКСИМУМ(ВТОстатки.ОстатокFBS) КАК ОстатокFBS
	               |ИЗ
	               |	ВТОстатки КАК ВТОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТОстатки.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТТовары.Номенклатура КАК Номенклатура,
	               |	ВЫБОР
	               |		КОГДА ВТТовары.Количество - ЕСТЬNULL(ВТОстаткиFBS.Количество, 0) > 0
	               |			ТОГДА ВТТовары.Количество - ЕСТЬNULL(ВТОстаткиFBS.Количество, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Количество
	               |ИЗ
	               |	ВТТовары КАК ВТТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиFBS КАК ВТОстаткиFBS
	               |		ПО (ВТОстаткиFBS.Номенклатура = ВТТовары.Номенклатура)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТОстатки.Склад КАК Склад,
	               |	ВТОстатки.Номенклатура КАК Номенклатура,
	               |	ВТОстатки.Остаток КАК Остаток
	               |ИЗ
	               |	ВТОстатки КАК ВТОстатки
	               |ГДЕ
	               |	ВТОстатки.Остаток > 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВТОстатки.Приоритет
	               |ИТОГИ ПО
	               |	Склад";
	
	Запрос.УстановитьПараметр("Дата1",ТекущаяДата());
	Запрос.УстановитьПараметр("ТаблицаСкладовПоПриоритетам",ТаблицаСкладовПоПриоритетам);
	Запрос.УстановитьПараметр("ТЗТовары",ТЗНоменклатуры); 
	СкладыFBS = Новый Массив;
	СкладыFBS.Добавить(Параметры.Получить("СкладFBS")); 
	СкладыFBS.Добавить(Параметры.Получить("СкладFBSМаркировка"));
	
	Запрос.УстановитьПараметр("СкладыFBS", СкладыFBS);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет(); 
	ВыборкаОбщиеОстатки 			= ПакетЗапросов[5].Выбрать();
	ТЧКоличествоДляРаспределения 	= ПакетЗапросов[6].Выгрузить();
	ВыборкаОстаткиПоСкладам = ПакетЗапросов[7].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	//СкладFBSПолучатель = Параметры.Получить("СкладFBS");
	СкладFBSПолучатель = Параметры.Получить("СкладFBSМаркировка");
	
	Пока ВыборкаОбщиеОстатки.Следующий() Цикл
		
		Отбор = Новый Структура("Номенклатура",ВыборкаОбщиеОстатки.Номенклатура); 	
		СтрокиПоТовару = ТЗНоменклатуры.НайтиСтроки(Отбор);
		
		Если СтрокиПоТовару.Количество() > 0  Тогда
			
			СтрокиПоТовару[0].ОбщийОстаток = Макс(ВыборкаОбщиеОстатки.остаток,0) + Макс(ВыборкаОбщиеОстатки.ОстатокFBS,0); 	
			СтрокиПоТовару[0].Количество = ВыборкаОбщиеОстатки.Количество; 	
		КонецЕсли;
		
	КонецЦикла;
	МассивПРМСозданных1 = Новый Массив; 
	
	Пока ВыборкаОстаткиПоСкладам.Следующий() Цикл
		
		ПРМНовый = СоздатьДокументПРМ(СкладFBSПолучатель,ВыборкаОстаткиПоСкладам.Склад); 
		
		ВыборкаДетальныеЗаписи = ВыборкаОстаткиПоСкладам.Выбрать(); 
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ОтборНоменклатура = Новый Структура("Номенклатура",ВыборкаДетальныеЗаписи.Номенклатура); 	
			СтрокиНайденные = ТЧКоличествоДляРаспределения.НайтиСтроки(ОтборНоменклатура);
			Если СтрокиНайденные.Количество() > 0  Тогда
				
				СтрокаНайденная = СтрокиНайденные[0]; 
				НеобходимоеКоличество = СтрокаНайденная.Количество;
				
				Если НеобходимоеКоличество = 0 Тогда
					
					Продолжить;	
					
				КонецЕсли;
				
				КоличествоВПРМ = Мин(НеобходимоеКоличество,ВыборкаДетальныеЗаписи.Остаток);					
				
				СтрТЧ	=	ПРМНовый.Товары.Добавить();
				СтрТЧ.Номенклатура	=	ВыборкаДетальныеЗаписи.номенклатура;
				СтрТЧ.Заявка		=	НеобходимоеКоличество;
				стртч.ПодтвержденнаяЗаявка				=	КоличествоВПРМ;			
				стртч.ПодтвержденнаяЗаявкаПеремещения	=	стртч.ПодтвержденнаяЗаявка;
				СтрТЧ.Количество						=	стртч.ПодтвержденнаяЗаявка;				
				
				ПриИзмененииНоменклатурыТабЧасти(СтрТЧ, ПРМНовый);
				РассчитатьСуммуТабЧасти(СтрТЧ, ПРМНовый);
				
				СтрокаНайденная.Количество = СтрокаНайденная.Количество - КоличествоВПРМ; 
				
			Иначе 
				Продолжить; 
			КонецЕсли;
			
		КонецЦикла;
		
		Если ПРМНовый.Товары.Количество() > 0   Тогда
			
			МассивПРМСозданных1.Добавить(ПРМНовый); 	
			
		КонецЕсли;
		
	КонецЦикла;
	
	//кол-во
	
	//Для каждого СтрокаСпаек Из ТЗСпайки Цикл
	//	КолХватаетВсего = Неопределено;
	//	ОстатокОбщий = 0; 
	//	Для каждого СтрокаКомпл  Из СтрокаСпаек.номенклатура.Коплектующие Цикл
	//		
	//		Отбор = Новый Структура("номенклатура",СтрокаКомпл.номенклатура); 
	//		Строкинайденные = ТЗНоменклатуры.НайтиСтроки(Отбор);
	//		Если Строкинайденные.Количество() > 0  Тогда
	//			
	//			ОстатокОбщий = 	Строкинайденные[0].ОбщийОстаток;
	//			
	//			КолХватает = ЦЕЛ(ОстатокОбщий/СтрокаКомпл.Количество);
	//			
	//			Если  КолХватаетВсего = Неопределено Тогда
	//				
	//				
	//				КолХватаетВсего = КолХватает; 
	//			Иначе 
	//				
	//				КолХватаетВсего = Мин(КолХватаетВсего,КолХватает); 
	//			КонецЕсли; 				
	//		КонецЕсли; 		
	//		
	//	КонецЦикла;
	//	
	//	
	//	Нехватает = СтрокаСпаек.Количество - ЦЕЛ(КолХватаетВсего); 
	//	Для каждого СтрокаКомпл  Из СтрокаСпаек.номенклатура.Коплектующие Цикл 
	//		Если Нехватает > 0 Тогда
	//			СтрокаНеХватает = ТЗНехватаетОстатков.Добавить(); 
	//			СтрокаНеХватает.Номенклатура = СтрокаКомпл.Номенклатура; 			
	//			СтрокаНеХватает.Количество = Нехватает  * СтрокаКомпл.Количество;
	//		КонецЕсли;
	//		
	//		Отбор = Новый Структура("номенклатура",СтрокаКомпл.номенклатура); 
	//		Строкинайденные = ТЗНоменклатуры.НайтиСтроки(Отбор);
	//		Для каждого Строканайденная Из Строкинайденные Цикл
	//			
	//			Строканайденная.ОбщийОстаток = 	Строканайденная.ОбщийОстаток -  Мин(ЦЕЛ(КолХватаетВсего),СтрокаСпаек.Количество)  * СтрокаКомпл.Количество; 
	//			
	//		КонецЦикла;
	//		
	//	КонецЦикла; 		
	//	
	//КонецЦикла;
	//Для каждого СтрокаНеСпаек Из ТЗНеСпайки Цикл
	//	
	//	Отбор = Новый Структура("номенклатура",СтрокаНеСпаек.номенклатура); 
	//	Строкинайденные = ТЗНоменклатуры.НайтиСтроки(Отбор);	
	//	ОстатокОбщий = 	Строкинайденные[0].ОбщийОстаток; 
	//	
	//	НеобходимоеКоличество =  СтрокаНеСпаек.Количество - ОстатокОбщий; 
	//	Если НеобходимоеКоличество > 0  Тогда
	//		
	//		СтрокаНеХватает = ТЗНехватаетОстатков.Добавить(); 
	//		СтрокаНеХватает.Номенклатура = СтрокаНеСпаек.Номенклатура; 			
	//		СтрокаНеХватает.Количество = НеобходимоеКоличество;	
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла; 
	
	Для каждого СтрокаТЧ Из ТЗНоменклатуры Цикл 
		
		НеобходимоеКоличество = СтрокаТЧ.Количество - СтрокаТЧ.ОбщийОстаток; 	
		Если НеобходимоеКоличество > 0  Тогда
			СтрокаНеХватает = ТЗНехватаетОстатков.Добавить(); 
			СтрокаНеХватает.Номенклатура = СтрокаТЧ.Номенклатура; 			
			СтрокаНеХватает.Количество = НеобходимоеКоличество;
		КонецЕсли;
	КонецЦикла;
	
	ТЗНехватаетОстатков.Свернуть("Номенклатура","Количество"); 
	
	
	//СкладFBSМаркировка = Параметры.Получить("СкладFBSМаркировка");
	СкладFBSПолучатель2 = Параметры.Получить("СкладFBS");
	
	МассивСкладовОтправители = Новый Массив; 
	Для НомерПараметра = 1 По 10 Цикл 
		Если Параметры.Получить("СкладОтправитель"+Строка(НомерПараметра)) <> Неопределено Тогда
			
			МассивСкладовОтправители.Добавить(Параметры.Получить("СкладОтправитель"+Строка(НомерПараметра))); 
			
		КонецЕсли;	
	КонецЦикла;
	
	ТаблицаСкладовПоПриоритетам = Новый ТаблицаЗначений;
	ТаблицаСкладовПоПриоритетам.Колонки.Добавить("Склад",ОписаниеТиповСклад);
	ТаблицаСкладовПоПриоритетам.Колонки.Добавить("Приоритет",ОписаниеТиповЧисло);
	Приоритет = 1; 
	Для каждого СкладИзНастроек Из МассивСкладовОтправители Цикл
		НСтрока = ТаблицаСкладовПоПриоритетам.Добавить(); 
		НСтрока.Склад = СкладИзНастроек; 
		НСтрока.Приоритет = Приоритет; 
		
		Приоритет = Приоритет +1; 		
	КонецЦикла;
	
	МассивПРМСозданных = Новый Массив;
	
	Если ЗначениеЗаполнено(СкладFBSПолучатель2) 
		И МассивСкладовОтправители.Количество() > 0 
		И ТЗНехватаетОстатков.Количество() > 0 Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧНехватает.Номенклатура КАК Номенклатура,
		|	ТЧНехватает.Количество КАК Количество
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	&ТЧНеХватает КАК ТЧНехватает
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаСкладовПоПриоритетамМаркировка.склад КАК склад,
		|	ТаблицаСкладовПоПриоритетамМаркировка.Приоритет КАК Приоритет
		|ПОМЕСТИТЬ ВТСклады
		|ИЗ
		|	&ТаблицаСкладовПоПриоритетамМаркировка КАК ТаблицаСкладовПоПриоритетамМаркировка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиТМЦОстатки.КоличествоОстаток - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) КАК Количество,
		|	ОстаткиТМЦОстатки.Склад КАК Склад
		|ПОМЕСТИТЬ ВТОстаткиМаркировки
		|ИЗ
		|	РегистрНакопления.ОстаткиТМЦ.Остатки(
		|			,
		|			Склад В (&СкладыМаркировки)
		|				И Номенклатура В
		|					(ВЫБРАТЬ
		|						ВТТовары.Номенклатура
		|					ИЗ
		|						ВТТовары КАК ВТТовары)) КАК ОстаткиТМЦОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(, Склад В (&СкладыМаркировки)) КАК РезервыТМЦОстатки
		|		ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
		|			И ОстаткиТМЦОстатки.Склад = РезервыТМЦОстатки.Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТовары.Номенклатура КАК Номенклатура,
		|	ВТТовары.Количество КАК Количество
		|ИЗ
		|	ВТТовары КАК ВТТовары
		|ГДЕ
		|	ВТТовары.Количество > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТовары.Номенклатура КАК Номенклатура,
		|	ВТТовары.Количество КАК Количество,
		|	ЕСТЬNULL(ВТОстаткиМаркировки.Количество, 0) КАК Остаток,
		|	ВТОстаткиМаркировки.Склад КАК Склад
		|ИЗ
		|	ВТТовары КАК ВТТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиМаркировки КАК ВТОстаткиМаркировки
		|		ПО (ВТОстаткиМаркировки.Номенклатура = ВТТовары.Номенклатура)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСклады КАК ВТСклады
		|		ПО (ВТСклады.склад = ВТОстаткиМаркировки.Склад)
		|ГДЕ
		|	ВТТовары.Количество > 0
		|	И ЕСТЬNULL(ВТОстаткиМаркировки.Количество, 0) > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТСклады.Приоритет,
		|	Номенклатура
		|ИТОГИ ПО
		|	Склад";	
		
		Запрос.УстановитьПараметр("ТаблицаСкладовПоПриоритетамМаркировка",ТаблицаСкладовПоПриоритетам);
		Запрос.УстановитьПараметр("СкладFBSМаркировка",СкладFBSПолучатель2); 
		Запрос.УстановитьПараметр("СкладыМаркировки",МассивСкладовОтправители);
		Запрос.УстановитьПараметр("ТЧНеХватает",ТЗНехватаетОстатков);
		
		ПакетЗапросов = Запрос.ВыполнитьПакет();
		
		ТЧНеобхКоличество = ПакетЗапросов[3].Выгрузить();
		
		ВыборкаСклады = ПакетЗапросов[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		//создание ПРМ по складам  	
		
		Пока ВыборкаСклады.Следующий() Цикл
			
			ПРМНовый = СоздатьДокументПРМ(СкладFBSПолучатель2,ВыборкаСклады.Склад); 
			
			ВыборкаДетальныеЗаписи = ВыборкаСклады.Выбрать(); 
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				ОтборНоменклатура = Новый Структура("Номенклатура",ВыборкаДетальныеЗаписи.Номенклатура); 	
				СтрокиНайденные = ТЧНеобхКоличество.НайтиСтроки(ОтборНоменклатура);
				Если СтрокиНайденные.Количество() > 0  Тогда
					
					СтрокаНайденная = СтрокиНайденные[0]; 
					НеобходимоеКоличество = СтрокаНайденная.Количество;
					
					Если НеобходимоеКоличество = 0 Тогда
						
						Продолжить;	
						
					КонецЕсли;
					
					КоличествоВПРМ = Мин(НеобходимоеКоличество,ВыборкаДетальныеЗаписи.Остаток);					
					
					СтрТЧ	=	ПРМНовый.Товары.Добавить();
					СтрТЧ.Номенклатура	=	ВыборкаДетальныеЗаписи.номенклатура;
					СтрТЧ.Заявка		=	НеобходимоеКоличество;
					стртч.ПодтвержденнаяЗаявка				=	КоличествоВПРМ;			
					стртч.ПодтвержденнаяЗаявкаПеремещения	=	стртч.ПодтвержденнаяЗаявка;
					СтрТЧ.Количество						=	стртч.ПодтвержденнаяЗаявка;				
					
					ПриИзмененииНоменклатурыТабЧасти(СтрТЧ, ПРМНовый);
					РассчитатьСуммуТабЧасти(СтрТЧ, ПРМНовый);
					
					СтрокаНайденная.Количество = СтрокаНайденная.Количество - КоличествоВПРМ; 
					
				Иначе 
					Продолжить; 
				КонецЕсли;
				
			КонецЦикла;
			
			Если ПРМНовый.Товары.Количество() > 0   Тогда
				
				МассивПРМСозданных.Добавить(ПРМНовый); 	
				
			КонецЕсли;
			
		КонецЦикла;
		
		
	КонецЕсли;
	
	НачатьТранзакцию(); 
	
	Для каждого НовыйПРМ1 Из МассивПРМСозданных1 Цикл
		УстановитьНомерДокументаКлиентСервер(НовыйПРМ1);
		НовыйПРМ1.Записать(РежимЗаписиДокумента.Проведение);
		СообщитьИзМодуля(НовыйПРМ1);	
		
	КонецЦикла;  
	
	Для каждого НовыйПРМ Из МассивПРМСозданных Цикл
		УстановитьНомерДокументаКлиентСервер(НовыйПРМ);	
		НовыйПРМ.Записать(РежимЗаписиДокумента.Проведение);
		СообщитьИзМодуля(НовыйПРМ);	
		
	КонецЦикла;
	
	Если  ТранзакцияАктивна() Тогда
		
		ЗафиксироватьТранзакцию();	
		
	КонецЕсли;
	
	Попытка
		ЗаписатьВЛог("Регламент","Контроль по остатку: ","Информация"); 
		
		Для каждого   НовыйПРМ1 Из МассивПРМСозданных1  Цикл
			
			КорректировкаПРМПоОстаткам(НовыйПРМ1);	
			
		КонецЦикла;
		
		
		Для каждого НовыйПРМ Из МассивПРМСозданных Цикл
			
			КорректировкаПРМПоОстаткам(НовыйПРМ);	
			
		КонецЦикла;
		
	Исключение
		ЗаписатьВЛог("Регламент","Контроль по остатку ошибка: "+ОписаниеОшибки(),"Информация");
	КонецПопытки; 
	
	Возврат ТЗНоменклатурыКопия;

КонецФункции


 //--Данилова Е.В. 28.01.2026
