&НаКлиенте
Процедура ЗаписатьОтложенныеДвижения(Команда)
	сДокументы = Новый Соответствие;
	Для каждого СтрокаСписка Из Элементы.Список.ВыделенныеСтроки Цикл	
		Если ЗначениеЗаполнено(СтрокаСписка.ДокСсылка) Тогда
			сДокументы[СтрокаСписка.ДокСсылка] = Истина;		
		КонецЕсли;		
	КонецЦикла;	  
	
	ЗаписатьОтложенныеДвижения_НаСервере(сДокументы);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОтложенныеДвижения_НаСервере(сДокументы)
	Для каждого КиЗ Из сДокументы Цикл	
		рЗаписи = РегистрыСведений.ОтложенныеДвиженияДокументов.ЗаписатьОтложенныеДвиженияДокумента(КиЗ.Ключ);
		Если рЗаписи.Успешно Тогда
			Сообщить("Успешно записаны движения документа: " + КиЗ.Ключ, СтатусСообщения.Информация);
		Иначе
			МаркировкаКС.ВывестиОшибки(рЗаписи);		
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлагОшибки(Команда)
	сДокументы = Новый Соответствие;
	Для каждого СтрокаСписка Из Элементы.Список.ВыделенныеСтроки Цикл	
		Если ЗначениеЗаполнено(СтрокаСписка.ДокСсылка) Тогда
			сДокументы[СтрокаСписка.ДокСсылка] = Истина;		
		КонецЕсли;		
	КонецЦикла;	  
	
	СнятьФлагОшибки_НаСервере(сДокументы);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СнятьФлагОшибки_НаСервере(сДокументы)
	Для каждого КиЗ Из сДокументы Цикл  
		ДокСсылка = КиЗ.Ключ;                          
		Если ЗначениеЗаполнено(ДокСсылка) Тогда
			НЗ = РегистрыСведений.ОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
			НЗ.Отбор.ДокСсылка.Установить(ДокСсылка, Истина);
			
			НЗ.Прочитать();
			
			Для каждого Запись Из НЗ Цикл
				Если Запись.ОшибкаОбработки Тогда
					Запись.ОшибкаОбработки = Ложь;									
				КонецЕсли;			
			КонецЦикла;
			
			Если НЗ.Модифицированность() Тогда
				НЗ.Записать();			
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
КонецПроцедуры