
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//НаборЗаписей = РегистрыСведений.РасчетРентабельности.СоздатьНаборЗаписей();
	//НаборЗаписей		=РегистрыСведений.СкидкиНоменклатуры.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.Документ.Установить(ссылка);
	//	
	//НаборЗаписей.Прочитать();
	//НаборЗаписей.Очистить();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	СуммаДокумента = Номенклатура.Итог("Всего");
	КоличествоДокумента = Номенклатура.Итог("Количество");
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Расчет.Очистить();
КонецПроцедуры
