
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	Если НЕ Отказ Тогда
		
		Движения.ДоступкИТ_Ресурсам.Записывать = Истина;
		Движения.ДоступкИТ_Ресурсам.Очистить();
		
		Для Каждого ТекСтрока Из Доступ Цикл
			Если ЗначениеЗаполнено(ТекСтрока.ДатаВыполнения) Тогда
				Движение = Движения.ДоступкИТ_Ресурсам.Добавить();
				
				Движение.Период = ТекСтрока.ДатаВыполнения;
				Движение.Регистратор = Ссылка;
				
				Движение.Сотрудник = ТекСтрока.Сотрудник;
				Движение.ИТ_Ресурс = ТекСтрока.ИТ_Ресурс;
				Движение.ПравоДоступа = ПравоДоступа;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
