Процедура СформироватьДвиженияПоПрофиту() Экспорт	
	Регистратор			=Отбор.Регистратор.Значение;
	Если НЕ ЗначениеЗаполнено(Регистратор) Тогда Возврат КонецЕсли;
	
	СписокРеквизитов=Новый Структура("Дата");
	//крохин начало 10.04.2012
	//РНК-подарки формируют затраты, а не профит
	Если Регистратор.Метаданные().Имя = "РасходнаяНакладная" Тогда
		СписокРеквизитов.Вставить("Подарок");
		РеквизитыРегисратора=ПолучитьРеквизитыШапки(Регистратор,СписокРеквизитов);
		Если РеквизитыРегисратора.Подарок Тогда
			Возврат;
		КонецЕсли;
	Иначе
		РеквизитыРегисратора=ПолучитьРеквизитыШапки(Регистратор,СписокРеквизитов);
	КонецЕсли;
	
	
	//крохин конец 10.04.2012
	//крохин начало 08.12.2011
	//добавил рекламации (вычерки)
	//МТ=Новый ОписаниеТипов("ДокументСсылка.РасходнаяНакладная,ДокументСсылка.ПриходнаяНакладная,ДокументСсылка.ОтчетКассовойСмены,ДокументСсылка.ПродажаИМ");
	//крохин начало 19.02.2016
	//добавил корректировки цен в накладной
	//МТ=Новый ОписаниеТипов("ДокументСсылка.РасходнаяНакладная,ДокументСсылка.ПриходнаяНакладная,ДокументСсылка.ОтчетКассовойСмены,ДокументСсылка.ПродажаИМ,ДокументСсылка.РекламационнаяНакладная");
	Если РеквизитыРегисратора.Дата >= '20160201' Тогда
		МТ=Новый ОписаниеТипов("ДокументСсылка.РасходнаяНакладная,ДокументСсылка.ПриходнаяНакладная,ДокументСсылка.ОтчетКассовойСмены,ДокументСсылка.ПродажаИМ,ДокументСсылка.РекламационнаяНакладная,ДокументСсылка.КорректировкаЦенВНакладной ");
	Иначе
		МТ=Новый ОписаниеТипов("ДокументСсылка.РасходнаяНакладная,ДокументСсылка.ПриходнаяНакладная,ДокументСсылка.ОтчетКассовойСмены,ДокументСсылка.ПродажаИМ,ДокументСсылка.РекламационнаяНакладная");
	КонецЕсли;	
	
	//крохин конец 19.02.2016
	//крохин конец 08.12.2011
	
	Если НЕ МТ.СодержитТип(ТипЗнч(Регистратор)) Тогда Возврат КонецЕсли; 
	
	
	Запрос=Новый Запрос;
	//крохин начало
	//ВозвратПоставщику формирует движения по затратам, а не профиту. С 01.07.2010
	Если РеквизитыРегисратора.Дата >= '20100701' Тогда
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Период,
		|	Номенклатура.Родитель.ВидНоменклатуры КАК ВидНоменклатуры,
		|	Подразделение,
		|	КодОперации,
		|	Отправитель КАК Контрагент,
		|	СУММА(Оборот)-СУММА(ВЫБОР КОГДА ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА 1 ИНАЧЕ -1 КОНЕЦ*Сумма) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ		
		|ГДЕ
		|	ОстаткиТМЦ.Регистратор = &Регистратор
		//	|	И КодОперации В (ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.Реализация),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратОтПокупателя),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратПоставщику),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ПогашениеСертификата))
		|	И КодОперации В (ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.Реализация),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратОтПокупателя),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ПогашениеСертификата))
		|СГРУППИРОВАТЬ ПО 
		|	Период,Номенклатура.Родитель.ВидНоменклатуры,Отправитель,Подразделение,КодОперации";
	Иначе
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Период,
		|	Номенклатура.Родитель.ВидНоменклатуры КАК ВидНоменклатуры,
		|	Подразделение,
		|	КодОперации,
		|	Отправитель КАК Контрагент,
		|	СУММА(Оборот)-СУММА(ВЫБОР КОГДА ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА 1 ИНАЧЕ -1 КОНЕЦ*Сумма) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ		
		|ГДЕ
		|	ОстаткиТМЦ.Регистратор = &Регистратор
		|	И КодОперации В (ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.Реализация),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратОтПокупателя),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратПоставщику),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ПогашениеСертификата))
		|СГРУППИРОВАТЬ ПО 
		|	Период,Номенклатура.Родитель.ВидНоменклатуры,Отправитель,Подразделение,КодОперации";
		
	КонецЕсли;
	//крохин конец
	
	Запрос.УстановитьПараметр("Регистратор",Регистратор);
	Выборка=Запрос.Выполнить().Выбрать();
	
	НЗ=РегистрыНакопления.Профит.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(Регистратор);
	
	Пока Выборка.Следующий() Цикл
		Запись=НЗ.Добавить();
		
		Запись.ВидДвижения=ВидДвиженияНакопления.Приход;			
		ЗаполнитьЗначенияСвойств(Запись,Выборка);		
	КонецЦикла;		
	
	НЗ.Записать();	
КонецПроцедуры

Процедура СформироватьДвиженияПоПродажам() Экспорт
	Регистратор			=Отбор.Регистратор.Значение;
	Если НЕ ЗначениеЗаполнено(Регистратор) Тогда Возврат КонецЕсли;
	
	МТ					= Новый ОписаниеТипов("ДокументСсылка.РасходнаяНакладная,ДокументСсылка.ПриходнаяНакладная,ДокументСсылка.ОтчетКассовойСмены,ДокументСсылка.ПродажаИМ,ДокументСсылка.РекламационнаяНакладная,ДокументСсылка.КорректировкаЦенВНакладной ");	
	Если НЕ МТ.СодержитТип(ТипЗнч(Регистратор)) Тогда Возврат КонецЕсли;
	
	СписокРеквизитов	= Новый Структура("Организация,Дата");
	
	РеквизитыРегисратора= ПолучитьРеквизитыШапки(Регистратор,СписокРеквизитов);	
	
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ	
	|	ВЫБОР КОГДА ВидДвижения = &Расход ТОГДА Количество ИНАЧЕ 0 КОНЕЦ 	КАК КолРасх,
	|	ВЫБОР КОГДА ВидДвижения = &Приход ТОГДА Количество ИНАЧЕ 0 КОНЕЦ	КАК КолПрих,	
	|	ВЫБОР КОГДА ВидДвижения = &Расход ТОГДА Сумма ИНАЧЕ 0	КОНЕЦ	   	КАК СумРасх,
	|	ВЫБОР КОГДА ВидДвижения = &Приход ТОГДА Сумма	ИНАЧЕ 0	КОНЕЦ 		КАК СумПрих,
	|	ВЫБОР КОГДА ВидДвижения = &Приход ТОГДА -1 ИНАЧЕ 1 КОНЕЦ * Сумма 	КАК СумОборот,	
	|	Оборот КАК Оборот,
	|	ОборотБезСкидки КАК ОборотБезСкидки,
	|	ОборотБезСкидки - Оборот КАК Скидка,	
	|	Оборот - ВЫБОР	КОГДА ВидДвижения = &Расход	ТОГДА 1	ИНАЧЕ -1 КОНЕЦ*Сумма КАК Профит,	
	|	ВЫБОР КОГДА ВидДвижения = &Расход ТОГДА 1 ИНАЧЕ -1 КОНЕЦ*Количество КАК ПродажиБезВозврата,
	|	
	|	Период,
	|	Номенклатура,
	|	Подразделение,
	|	Отправитель 	КАК Покупатель,
	|	ПунктДоставки 	КАК ПунктДоставки,
	|	ВЫБОР КОГДА Регистратор ССЫЛКА Документ.ОтчетКассовойСмены ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ЧерезКассу,	
	|	ВЫБОР
	|		КОГДА Регистратор ССЫЛКА Документ.РасходнаяНакладная ТОГДА Регистратор.Менеджер
	|		КОГДА Регистратор ССЫЛКА Документ.ПриходнаяНакладная ТОГДА Регистратор.Менеджер
	|		КОГДА Регистратор ССЫЛКА Документ.РекламационнаяНакладная ТОГДА Регистратор.Менеджер 
	|		КОГДА Регистратор ССЫЛКА Документ.КорректировкаЦенВНакладной ТОГДА Регистратор.Менеджер
	|		КОГДА Отправитель ССЫЛКА Справочник.Контрагенты	ТОГДА Отправитель.Менеджер
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	КОНЕЦ КАК Менеджер,	
	|	КодОперации,	
	|	Регистратор.Организация КАК Организация	
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ КАК Остатки
	|ГДЕ	
	|	Регистратор=&Регистратор
	|	И Активность
	|	И КодОперации В (
	|		ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.Реализация),
	|		ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратОтПокупателя),
	|		ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратПоставщику),
	|		ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ПогашениеСертификата)
	|	)	
	|";
	
	Запрос.УстановитьПараметр("Регистратор",Регистратор);
	Запрос.УстановитьПараметр("Приход",		ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("Расход",		ВидДвиженияНакопления.Расход);
	
	Выборка	= Запрос.Выполнить().Выбрать();
	
	НЗ=РегистрыНакопления.Продажи.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(Регистратор);
	
	Пока Выборка.Следующий() Цикл
		Запись	= НЗ.Добавить();	
		ЗаполнитьЗначенияСвойств(Запись,Выборка);		
	КонецЦикла;		
	
	НЗ.Записать();
КонецПроцедуры
 

Процедура ПриЗаписи(Отказ, Замещение)
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	
	Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		СформироватьДвиженияПоПрофиту();
		СформироватьДвиженияПоПродажам();
	КонецЕсли;	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	Если НЕ ПараметрыСеанса.ОтключитьЖурнализациюЗаписи  И Отбор.Регистратор.Значение.Дата < ТекущаяДата() И ПараметрыСеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		
		Запрос=Новый запрос;
		запрос.Текст="ВЫБРАТЬ
					 |	ЛогиОстатковТМЦ.Документ,
					 |	ЛогиОстатковТМЦ.ДатаИзменения1
					 |ИЗ
					 |	РегистрСведений.ЛогиОстатковТМЦ КАК ЛогиОстатковТМЦ
					 |ГДЕ
					 |	ЛогиОстатковТМЦ.Документ = &Документ
					 |	И КОНЕЦПЕРИОДА(ЛогиОстатковТМЦ.ДатаИзменения1, ДЕНЬ) = КОНЕЦПЕРИОДА(&ДатаИзменения, ДЕНЬ)";
		
		Запрос.УстановитьПараметр("Документ", Отбор.Регистратор.Значение);
		Запрос.УстановитьПараметр("ДатаИзменения",ТекущаяДата());
			
		Выб=Запрос.Выполнить().Выбрать();
		Запись=РегистрыСведений.ЛогиОстатковТМЦ.СоздатьНаборЗаписей();
		Если выб.Следующий() тогда //Надо перезаписать
			Запись.Отбор.Документ.Установить(выб.документ.ссылка);
			Запись.Отбор.ДатаИзменения1.Установить(выб.ДатаИзменения1);
			Запись.Прочитать();
			Запись.Очистить();
			Запись.Записать();
		Конецесли;
		
		Запись=РегистрыСведений.ЛогиОстатковТМЦ.СоздатьМенеджерЗаписи();
	  	
		Если ЭтотОбъект.Количество()=0 тогда
			Запись.ДопИнф="Нули";
		Конецесли;
		
		Запись.ДатаИзменения1 = ТекущаяДата();
		Запись.Документ     =Отбор.Регистратор.Значение;
		Запись.Записать();
		
	КонецЕсли;
	
	Если ОбщегоНазначения_ПИ.ЭтоУзел_Склад() Тогда
		Для Каждого Запись Из ЭтотОбъект Цикл
			Если Запись.Сумма<>0 Тогда
				Запись.Сумма=0;			
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли; 
КонецПроцедуры

