&НаКлиенте
Процедура ЗапланироватьВыполнениеЗадач(Команда)
	ЗапланироватьВыполнениеЗадач_НаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗапланироватьВыполнениеЗадач_НаСервере()
	РегистрыСведений.ЗадачиОтложеннойОбработкиДокументов.ЗапланироватьВыполнениеЗадач();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусыЗадач(Команда)
	ОбновитьСтатусыЗадач_НаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьСтатусыЗадач_НаСервере()
	РегистрыСведений.ЗадачиОтложеннойОбработкиДокументов.ОбновитьСтатусыЗадач();
КонецПроцедуры

&НаКлиенте
Процедура ПовторнаяОбработка(Команда) 
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ПовторнаяОбработка_НаСервере(ТекДанные.Документ, ТекДанные.Задача);		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПовторнаяОбработка_НаСервере(Документ, Задача)     
	МЗ = РегистрыСведений.ЗадачиОтложеннойОбработкиДокументов.СоздатьМенеджерЗаписи();
	МЗ.Документ = Документ;
	МЗ.Задача	= Задача;
	
	МЗ.Прочитать();
	
	Если ЗначениеЗаполнено(МЗ.ИД_Задачи) Тогда
		НЗ = РегистрыСведений.ОчередьЗадач.ОчиститьОчередь(МЗ.ИД_Задачи);
		
		МЗ.ИД_Задачи = Неопределено;
		МЗ.Статус = Перечисления.СтатусыДокументовМаркировки.КОбработке;		
		
		МЗ.Записать();
	КонецЕсли;	
КонецПроцедуры