
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Результат = ПолучитьТаблицуВнешнегоНабораДанных(Документ, "Товары");
	
	ВнешниеНаборыДанных = Новый Структура;	
	ВнешниеНаборыДанных.Вставить("Данные", Результат);
	
	ДанныеРасшифровки	= Неопределено;	
	КомпоновщикМакета	= Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки		= КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,КомпоновщикНастроек.Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	#Если Клиент Тогда
	ВывестиРезультатВТабличныйДокумент(ПроцессорКомпоновки, ДокументРезультат);
	#КонецЕсли
	
	ТЗРезультат = ПолучитьТЗИзКомпоновки();
	
КонецПроцедуры

Функция ПолучитьТаблицуВнешнегоНабораДанных(Документ, ТабличнаяЧасть = "Товары") Экспорт
	
	ИмяДокумента = Документ.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Если ЗначениеЗаполнено(РеквизитОтбора) Тогда
		Запрос.УстановитьПараметр("РеквизитОтбора", РеквизитОтбора);
	КонецЕсли;
	
	РеквизитОтбораТекст = "";
	Если ТипЗнч(РеквизитОтбора) = Тип("СправочникСсылка.ТипыЦен") Тогда
		РеквизитОтбораТекст = "И ЕСТЬNULL(ТабличнаяЧасть.ТипЦен, ЗНАЧЕНИЕ(Справочник.ТипыЦен.ПустаяСсылка)) = &РеквизитОтбора";
	ИначеЕсли ТипЗнч(РеквизитОтбора) = Тип("СправочникСсылка.Номенклатура") Тогда
		РеквизитОтбораТекст = "И Номенклатура = &РеквизитОтбора";
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТабличнаяЧасть.Ссылка КАК Документ,
	|	ТабличнаяЧасть.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТабличнаяЧасть.Номенклатура.СтавкаНДС, ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)) КАК НДССтавка,
	|	ЕСТЬNULL(ТабличнаяЧасть.ТипЦен, ЗНАЧЕНИЕ(Справочник.ТипыЦен.ПустаяСсылка)) КАК ТипЦен,
	|	ЕСТЬNULL(ТабличнаяЧасть.Ссылка.БазовыйТипЦен, ЗНАЧЕНИЕ(Справочник.ТипыЦен.ПустаяСсылка)) КАК БазовыйТипЦен,
	|	ЕСТЬNULL(ТабличнаяЧасть.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(ТабличнаяЧасть.БазоваяЦена, 0) КАК БазоваяЦена,
	|	1 КАК Количество
	|ИЗ
	|	Документ." + ИмяДокумента + "." + ТабличнаяЧасть + " КАК ТабличнаяЧасть
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка = &Документ
	|	" + РеквизитОтбораТекст + "
	|";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Таблица.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("Число"));
	
	Для Каждого Стр ИЗ Таблица Цикл
		Стр.СтавкаНДС = ПроцентНДСпоСтавке(Стр.НДССтавка);	
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьТЗИзКомпоновки() Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Результат = ПолучитьТаблицуВнешнегоНабораДанных(Документ, "Товары");
	
	ВнешниеНаборыДанных = Новый Структура;	
	ВнешниеНаборыДанных.Вставить("Данные", Результат);
	
	ДанныеРасшифровки	= Неопределено;	
	КомпоновщикМакета	= Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДанныеРасшифровки, , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных; 
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ДанныеТЗ = Новый ТаблицаЗначений;
	
	ПроцессорВывода.УстановитьОбъект(ДанныеТЗ);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат ДанныеТЗ;
	
КонецФункции

////////////////////////////// ФУНКЦИЯ ИЗ ЭКСЕЛЯ ///////////////////////////////
// ФУНКЦИЯ ОКРУГЛЕНИЯ "ОКРУГЛТ" (как в EXCEL)
// y = x * Цел(ч/x)
//Функция ОКРУГЛТ(Знач Результат, Знач Показатель) Экспорт
//	Возврат ?(Показатель <> 0, Показатель * Цел(Результат/Показатель), 0);
//КонецФункции
