Перем БазаИсточник;

Функция ЗагрузитьОбъект(ИсточникЗаписьXML, ПриемникЧтениеXML, ИсточникОбъект)
	
	Попытка
		
		ИсточникЗаписьXML.УстановитьСтроку();
		БазаИсточник.ЗаписатьXML(ИсточникЗаписьXML, ИсточникОбъект);
		СтрокаXML		= ИсточникЗаписьXML.Закрыть();
		
		ПриемникЧтениеXML.УстановитьСтроку(СтрокаXML);
		ПриемникЧтениеXML.Прочитать();
		ПриемникОбъект	= ПрочитатьXML(ПриемникЧтениеXML);
		ПриемникОбъект.ОбменДанными.Загрузка = Истина;
		ПриемникОбъект.Записать();
		
	Исключение
		
		Сообщить("Исключение: " + ОписаниеОшибки());
		ПриемникОбъект	= Неопределено;
		
	КонецПопытки;
	
	Возврат ПриемникОбъект;
	
КонецФункции

Функция УстановитьСоединение_Ист()	
	#ЕСЛИ КЛИЕНТ ТОГДА
	Состояние("Установка соединения с источником.....");		
	#КОНЕЦЕСЛИ	
		
	СтрокаСоединения=Константы.СтрокаСоединенияСБазойЛогов.Получить();
	
	Если ПустаяСтрока(СтрокаСоединения) Тогда
		СообщитьОбОшибке("Не указаны параметры соединенеия с базой источником логов !");
		Возврат Ложь;	
	КонецЕсли;	
	
	Соединение_Ист = Новый COMОбъект("V81.COMConnector");
	СтрокаСоединения_Ист=СтрокаСоединения+"Usr="""+"Администратор"+""";Pwd="""+""+""";";
		
	Попытка				
		БазаИсточник	= Соединение_Ист.Connect(СтрокаСоединения_Ист);		
		Возврат Истина;
	Исключение                 		
		СообщитьОбОшибке("Ошибка установки соединения с базой источником ! "+ОписаниеОшибки());		
		Возврат Ложь;
	КонецПопытки;		
КонецФункции

Процедура ЗагрузитьЛоги() Экспорт
	Если НЕ Константы.БазаАрхиваЛогов.Получить() Тогда
		СообщитьОбОшибке("Данная база не является базой архива логов. Загрузка невозможна !");
		Возврат;
	КонецЕсли; 
	
	Если НЕ УстановитьСоединение_Ист() Тогда Возврат КонецЕсли; 
	
	Запрос=БазаИсточник.NewObject("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	День
	|ИЗ
	|	РегистрСведений.ЖурналРегистрации
	|ГДЕ
	|	Дата МЕЖДУ &Дата1 И &Дата2
	|УПОРЯДОЧИТЬ ПО День";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата2));
	
	ИсточникЗаписьXML	= БазаИсточник.NewObject("ЗаписьXML");	
	ПриемникЧтениеXML	= Новый ЧтениеXML;
	
	ВыборкаИст=Запрос.Выполнить().Выбрать();
	Пока ВыборкаИст.Следующий() Цикл
		#ЕСЛИ КЛИЕНТ ТОГДА
		ОбработкаПрерыванияПользователя();		
		Состояние("Загрузка: "+ВыборкаИст.День);
		#КОНЕЦЕСЛИ
		
		НЗ_Ист=БазаИсточник.РегистрыСведений.ЖурналРегистрации.СоздатьНаборЗаписей();
		НЗ_Ист.Отбор.День.Установить(ВыборкаИст.День,Истина);
		НЗ_Ист.Прочитать();			
		
		НЗ_Тек=ЗагрузитьОбъект(ИсточникЗаписьXML, ПриемникЧтениеXML, НЗ_Ист);
		
		НЗ_Тек.Записать();
		
		НЗ_Ист.Очистить();
		НЗ_Ист.Записать();
	КонецЦикла;	
	
	
	Запрос=БазаИсточник.NewObject("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	День
	|ИЗ
	|	РегистрСведений.Логи
	|ГДЕ
	|	Дата МЕЖДУ &Дата1 И &Дата2
	|УПОРЯДОЧИТЬ ПО День";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата2));
	
	ИсточникЗаписьXML	= БазаИсточник.NewObject("ЗаписьXML");	
	ПриемникЧтениеXML	= Новый ЧтениеXML;
	
	ВыборкаИст=Запрос.Выполнить().Выбрать();
	Пока ВыборкаИст.Следующий() Цикл
		#ЕСЛИ КЛИЕНТ ТОГДА
		ОбработкаПрерыванияПользователя();
		Состояние("Загрузка: "+ВыборкаИст.День);
		#КОНЕЦЕСЛИ
		
		НЗ_Ист=БазаИсточник.РегистрыСведений.Логи.СоздатьНаборЗаписей();
		НЗ_Ист.Отбор.День.Установить(ВыборкаИст.День,Истина);
		НЗ_Ист.Прочитать();			
		
		НЗ_Тек=ЗагрузитьОбъект(ИсточникЗаписьXML, ПриемникЧтениеXML, НЗ_Ист);
		
		НЗ_Тек.Записать();
		
		НЗ_Ист.Очистить();
		НЗ_Ист.Записать();
	КонецЦикла;	
КонецПроцедуры
