
Перем мСозданиеНевозможно Экспорт;
Перем НужноВыгружать;

Процедура ПриКопировании(ОбъектКопирования)
	
	Выгружено = ложь;
	согласована = ложь;
	состояние = перечисления.СостоянияКоррекции.ВРаботе;
	Утвердил = Справочники.ФизическиеЛица.ПустаяСсылка();
	Отработал = Утвердил;
	Сотрудники.очистить();
	//нечаева 05,12,17+++
	Период = НачалоМесяца(ТекущаяДата());
	Дата = ТекущаяДата();
	//нечаева 05,12,17---
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.	
	
	ЕстьИзменения		= Модифицированность();
	НужноВыгружать		= НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	
	//нечаева 04,10,17 ++++
	Если Выгружено = ложь Тогда
		  НужноВыгружать = ложь;
	КонецЕсли;
	//нечаева 04,10,17 ----
	
	
	Если НЕ ОбменДанными.Загрузка Тогда
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
		Если Отказ Тогда Возврат КонецЕсли; 	
	КонецЕсли;
	
	
	// только для согласованных
	Если НужноВыгружать Тогда
		//                                                                            //нечаева 04,10,17 ++++
		Если ПараметрыСеанса.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение и Выгружено = истина Тогда
			//из филиалов, если создали и провели первый раз.                         //нечаева 04,10,17 ----
			УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
		Иначе
			// Из Цо 
			Если Состояние= Перечисления.СостоянияКоррекции.Отклонена Или Состояние = Перечисления.СостоянияКоррекции.Утверждена Тогда
				УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
    	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) экспорт
	
	Если Отработал = справочники.ФизическиеЛица.ПустаяСсылка()  Тогда
		отработал = параметрысеанса.Пользователь.ФизЛицо;
	КонецЕсли;
	
КонецПроцедуры



