
Процедура УстановитьДоговорСб2б(ДокументОбъект,ИмяРеквизитаКонтрагент="Контрагент",ИмяРеквизитаДоговор="Договор") Экспорт
	Контрагент	=ДокументОбъект[ИмяРеквизитаКонтрагент];
	Договор		=ДокументОбъект[ИмяРеквизитаДоговор];
	Организация	=ДокументОбъект.Организация;
	
	КодЦБ=?(ПустаяСтрока(Контрагент.КодЦБ),Контрагент.Код,Контрагент.КодЦБ);
	
	//По просьбе Ярослава, задача № 0000000468 
	//Если НЕ(Договор.Пустая()) Тогда
	//	Если СокрЛП(Договор.КодЦБ)=СокрЛП(КодЦБ) Тогда
	//		Возврат;
	//	КонецЕсли; 		
	//КонецЕсли;
	
	ДокументОбъект[ИмяРеквизитаДоговор]=Неопределено;
	
	Если Контрагент.Пустая() Тогда Возврат КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Контрагент.ОсновнойДоговор) Тогда
		Договора=ПолучитьДоговорыКонтрагентаСб2б(Контрагент,Организация);
	Иначе
		Договора=Новый Массив;	
		Договора.Добавить(Контрагент.ОсновнойДоговор);
	КонецЕсли;	
	
	//Нечаева// 
	Если Договора.ВГраница()<0 Тогда
		//Предупреждение("Невозможно определить договор контрагента !");
	ИначеЕсли Договора.ВГраница()=0 Тогда
		ДокументОбъект[ИмяРеквизитаДоговор]=Договора[0];			
	Иначе
		#Если клиент тогда
		сообщить("У контрагента: """+Контрагент+""" заключено несколько договоров с организацией """+Организация+""" !"+Символы.ПС+
		"Основной договор для данного контрагента не указан !"+Символы.ПС+
		"Требуется вручную выбрать необходимый договор !");
		записатьвлог("b2b",""+Контрагент+" заключено несколько договоров с организацией "+Организация+"! Основной договор для данного контрагента не указан !Требуется вручную выбрать необходимый договор !",,,,);
		#конецЕсли
	КонецЕсли;	

КонецПроцедуры

Процедура УстановитьПунктДоставкиСб2б(ДокументОбъект,ИмяРеквизитаКонтрагент="Контрагент",ИмяРеквизитаПД="ПунктДоставки") Экспорт
	
	Контрагент = ДокументОбъект[ИмяРеквизитаКонтрагент];
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Если ЕстьРеквизитДокумента("ОсновнойПунктДоставки",Контрагент.Метаданные()) И ЗначениеЗаполнено(Контрагент.ОсновнойПунктДоставки) Тогда
			ДокументОбъект[ИмяРеквизитаПД]=Контрагент.ОсновнойПунктДоставки;	
		ИначеЕсли КоличествоПДСервер(Контрагент)=1 Тогда		
			Выборка=Справочники.ПунктыДоставки.Выбрать(,Контрагент);
			Пока Выборка.Следующий() Цикл
				ДокументОбъект[ИмяРеквизитаПД]=Выборка.Ссылка;			
			КонецЦикла;
			//крохин начало
			//для складов, если несколько ПД, выбираем первый
		ИначеЕсли ИмяРеквизитаКонтрагент = "СкладПолучатель" Тогда
			//крохин начало 28.07.2011
			//выбираем первый по наименованию
			//Выборка=Справочники.ПунктыДоставки.Выбрать(,Контрагент);
			Выборка=Справочники.ПунктыДоставки.Выбрать(,Контрагент,,"Наименование Убыв");
			//крохин конец 28.07.2011
			Пока Выборка.Следующий() Цикл
				ДокументОбъект[ИмяРеквизитаПД]=Выборка.Ссылка;			
			КонецЦикла;
			//крохин конец
		Иначе
			ДокументОбъект[ИмяРеквизитаПД]=Неопределено;		
		КонецЕсли;		
	Иначе
		ДокументОбъект[ИмяРеквизитаПД]=Неопределено;		
	КонецЕсли;
	
КонецПроцедуры//УстановитьПунктДоставки(ДокументОбъект,ИмяРеквизитаКонтрагент="Контрагент")

Функция ПолучитьДоговорыКонтрагентаСб2б(Контрагент,Организация=Неопределено)  Экспорт
	МассивДоговоров=Новый Массив;
	
	КодЦБ=?(ПустаяСтрока(Контрагент.КодЦБ),Контрагент.Код,Контрагент.КодЦБ);
	
	Выборка=Справочники.Договоры.Выбрать(,,Новый Структура("КодЦБ",КодЦБ));
	Пока Выборка.Следующий() Цикл
		//Если задана организация то договора с другой организацией пропускаем
		//	Если Организация<>Неопределено И НЕ Организация.Пустая() И Выборка.Организация<>Организация Тогда Продолжить КонецЕсли; 	
		
		
		МассивДоговоров.Добавить(Выборка.Ссылка);
	КонецЦикла; 
	
	Возврат МассивДоговоров;
КонецФункции // ПолучитьДОговорыКорагента()

Функция КоличествоПДСервер(Контрагент) Экспорт
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ссылка) КАК Количество
		|ИЗ
		|	Справочник.ПунктыДоставки КАК ПунктыДоставки
		|ГДЕ
		|	Владелец = &Владелец";
		
		Запрос.УстановитьПараметр("Владелец",Контрагент);
		
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Количество;			
		КонецЕсли;		
	КонецЕсли;
	
	Возврат 0;
КонецФункции //КоличествоПД(Контрагент)


