Перем НеКонтролироватьЗапись;


Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,Записывать=Ложь,Очищать=Истина)
	Для Каждого НаборДвижений Из ДвиженияПоРегистрам Цикл
		ИмяРегистра		=НаборДвижений.Ключ;
		ТаблицаДвижения =НаборДвижений.Значение;
		
		Если Движения.Найти(ИмяРегистра)=Неопределено Тогда Возврат  КонецЕсли; 
		
		НаборЗаписей=Движения[ИмяРегистра];		
		Если Очищать Тогда
			НаборЗаписей.Очистить();		
		КонецЕсли;		
		
		Для Каждого Движение Из ТаблицаДвижения Цикл
			Запись=НаборЗаписей.Добавить();	
			ЗаполнитьЗначенияСвойств(Запись,Движение);	
			
			Запись.Регистратор=Ссылка;
		КонецЦикла;	
		
		Если Записывать Тогда
			НаборЗаписей.Записать();		
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры 


//СОБЫТИЯ ОБЪЕКТА
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если НЕ обменданными.Загрузка и ПараметрыСеанса.ЭтотУзел.ТипУзла <> Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
	  Сообщить("Этот документ можно менять только в ЦО!");Отказ=ИСТИНА;Возврат;	
	Конецесли;
	
	ЕстьИзменения		=Модифицированность();	
	
	Если НЕ ОбменДанными.Загрузка Тогда
		Если НеКонтролироватьЗапись Тогда
		Иначе
			//крохин начало 09.03.2017
			//раскомментировал проверку, посмотрим, зачем её убирали
			//КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
			КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
			//крохин конец 09.03.2017
			МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
			МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		КонецЕсли;		
		
		Если Отказ Тогда Возврат КонецЕсли;		
	КонецЕсли;	
	
	Если ЕстьИзменения Тогда 
		СуммаДокумента		= Товары.Итог("Всего");
		ОбъемДокумента		= Товары.Итог("Объем");
		КоличествоДокумента = Товары.Итог("Количество");		
		
		ГруппыТоваров   	= ГруппыТоваровДокумента(ЭтотОбъект);		
		//Катаев+ 05/12/13  Делаем проверку на отрицательные значения по партиям
		Если Не ОбменДанными.Загрузка Тогда //Катаев+ 19/02/14 При обмене проверку делать не будем
		Запрос=новый запрос;
		запрос.Текст=
		"ВЫБРАТЬ
		|	ПартииОстатки.Партия КАК им7,
		|	ПартииОстатки.Номенклатура,
		|	ПартииОстатки.ШтВКоробе,
		|	СУММА(ПартииОстатки.КоличествоОстаток - ВЫБОР
		|			КОГДА (НЕ ПартииРезерв.КоличествоОстаток ЕСТЬ NULL )
		|				ТОГДА ПартииРезерв.КоличествоОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Количество
		|ИЗ
		|	РегистрНакопления.Партии.Остатки(&Кон, Склад = &Склад) КАК ПартииОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Партии.Остатки(&Кон, Склад = &СкладРезерв) КАК ПартииРезерв
		|		ПО ПартииОстатки.Номенклатура = ПартииРезерв.Номенклатура
		|			И ПартииОстатки.Партия = ПартииРезерв.Партия
		|			И ПартииОстатки.ШтВКоробе = ПартииРезерв.ШтВКоробе
		|
		|СГРУППИРОВАТЬ ПО
		|	ПартииОстатки.Партия,
		|	ПартииОстатки.Номенклатура,
		|	ПартииОстатки.ШтВКоробе";
					 
		Запрос.УстановитьПараметр("Кон",Новый граница(Дата,видграницы.Исключая));
		//крохин начало 29.04.2015
		//для закрывающих КП другая проверка
		//Запрос.УстановитьПараметр("Склад",Склад.ФизическийСклад);
		//Запрос.УстановитьПараметр("СкладРезерв",Склад);
		Если СостояниеЗаказа <> Перечисления.СостояниеЗаказаПоставщику.Закрыт Тогда
		Запрос.УстановитьПараметр("Склад",Склад.ФизическийСклад);
		Запрос.УстановитьПараметр("СкладРезерв",Склад);
	Иначе
		Запрос.УстановитьПараметр("Склад",Склад);
		Запрос.УстановитьПараметр("СкладРезерв",Справочники.Склады.ПустаяСсылка());
		КонецЕсли;
		//крохин конец 29.04.2015
		Остпартий=Запрос.Выполнить().Выгрузить();
		Для Каждого стр из ТоварыПартии Цикл
			Отбор=новый структура;
			отбор.Вставить("Им7",стр.Им7);
			отбор.Вставить("Номенклатура",стр.Номенклатура);
			отбор.Вставить("ШтВкоробе",стр.ШтукВкоробе);
			НайденныеСтроки = Остпартий.НайтиСтроки(Отбор);
			
			Если НайденныеСтроки.Количество() <> 0 Тогда
				Если стр.Количество > НайденныеСтроки[0].Количество Тогда
					Отказ = Истина;
					Сообщить("По номенклатуре "+стр.Номенклатура+" в партии "+стр.Им7+" недостаточно товара" );
				КонецЕсли;
			Иначе
				Сообщить("По номенклатуре "+стр.Номенклатура+" в партии "+стр.Им7+" недостаточно товара" );
				Отказ = Истина;
			КонецЕсли;
		//крохин начало 29.04.2015
		//Отказ - после перебора номеналатуры
		//	Если Отказ Тогда
		//		Возврат;
		//	КонецЕсли;
		//КонецЦикла;
		КонецЦикла;
		Если Отказ Тогда
			Возврат;
       	КонецЕсли;
		//крохин конец 29.04.2015
		КонецЕсли;	
		//Катаев- 05/12/13
	КонецЕсли;	
	//крохин начало 16.06.2011
	//регистрация изменений для Риги
	ЕстьИзменения		=Модифицированность();	
	НужноВыгружать		=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;
	//++Данилова Е.В. 13.03.2026 MARK-3512 
	Если ЕстьИзменения 
		И НЕ обменданными.Загрузка Тогда
		
		ДатаИзменения = ТекущаяДатаСеанса(); 	
		
	КонецЕсли;
	//--Данилова Е.В. 13.03.2026
   //крохин конец 16.06.2011 
   //++Данилова Е.В. 28.07.2025  HELP-6187
	Если ЕстьИзменения
		И Дата >= Дата(2025,07,01) Тогда
	
		ЗаполнитьТЧКомплектующие();
		 
		ПроверитьТЧКомплектующие(Отказ);
		
		
	КонецЕсли;
	//--Данилова Е.В. 28.07.2025
    //++Данилова Е.В. 13.03.2026 MARK-3512 
	Если Не Отказ Тогда
		СостояниеПроверкиДляЗаполнения = СостояниеПроверкиМарокНаТСД; 
		ОбменДаннымиПоAPI_ТСД.ПолучитьСостояниеПроверкиМарокНаТСД(Контрагент,СостояниеПроверкиДляЗаполнения);
		Если СостояниеПроверкиДляЗаполнения <> СостояниеПроверкиМарокНаТСД Тогда
		
			СостояниеПроверкиМарокНаТСД = СостояниеПроверкиДляЗаполнения; 	
		
		КонецЕсли;
	КонецЕсли;
	//--Данилова Е.В. 13.03.2026 

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	СостояниеНакладной	= Неопределено;
	Автор				= Неопределено;
	Контракт			= Неопределено;
	
	// Шворобей ВЮ 29.08.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-6835
	Если ЗначениеЗаполнено(Договор) Тогда
		Организация = Договор.Организация;
	Конецесли;
	// Шворобей ВЮ 29.08.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-6835
	
КонецПроцедуры


Функция ПроводитьПоЗаказам(ДокСсылка)
	Если ДокСсылка.СостояниеЗаказа=Перечисления.СостояниеЗаказаПоставщику.ПодтвержденныйЗаказ
			ИЛИ ДокСсылка.СостояниеЗаказа=Перечисления.СостояниеЗаказаПоставщику.ВПути			
			ИЛИ ДокСсылка.СостояниеЗаказа=Перечисления.СостояниеЗаказаПоставщику.Таможня Тогда			
		Возврат Истина;
	Иначе
		Возврат Ложь;			
	КонецЕсли;
КонецФункции // ()
 

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	ДвиженияПоРегистрам=Неопределено;
	
	если Склад.ТипСклада = Перечисления.ТипСклада.ВнешнийСклад тогда
		Сообщить("Неверный тип склада!");Отказ=ИСТИНА;Возврат;
	Конецесли;
	
	Если СостояниеЗаказа=Перечисления.СостояниеЗаказаПоставщику.ВРаботе Тогда Возврат КонецЕсли;
	
	Если Склад.ТипСклада = Перечисления.ТипСклада.ВнешнийСкладРезерв и  ТоварыПартии.Количество()>0 и СостояниеЗаказа<>Перечисления.СостояниеЗаказаПоставщику.Закрыт тогда
		Если ТоварыПартии.итог("Количество")<>Товары.итог("Количество") тогда
			Сообщить("Разное количество по товарам и по партиям. Не должно проводиться!");
			Отказ=ИСТИНА;
		Конецесли;	
	Конецесли;	
	Валюты_Курсы=ПолучитьСтруктуруВалютИКурсы(Валюта,Курс,Дата,Договор);
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	Если  Склад.ТипСклада <> Перечисления.ТипСклада.ВнешнийСкладРезерв тогда
		Если СостояниеЗаказа<>Перечисления.СостояниеЗаказаПоставщику.Ликвидирован И СостояниеЗаказа<>Перечисления.СостояниеЗаказаПоставщику.Закрыт  Тогда
			//++Данилова Е.В. 29.07.2025 HELP-6187 
			Если Дата >= Дата(2025,07,01) Тогда  									
				
				ДвиженияПоЗаказамПоставщикам("Комплектующие","ЗаказыПоставщикамШтуки");
				
			КонецЕсли;
			
			ДвиженияПоЗаказамПоставщикам("Товары","ЗаказыПоставщикам"); 
						
			//Запрос = Новый Запрос;
			//Запрос.Текст = 
			//"ВЫБРАТЬ
			//|	КонтрактСПроизводителемКомплектующие.Номенклатура КАК Номенклатура,
			//|	СУММА(КонтрактСПроизводителемКомплектующие.Количество) КАК Количество,
			//|	МАКСИМУМ(КонтрактСПроизводителемКомплектующие.Цена) КАК Цена,
			//|	СУММА(КонтрактСПроизводителемКомплектующие.Всего) КАК Всего,
			//|	КонтрактСПроизводителемКомплектующие.Коэффициент КАК Коэффициент
			//|ИЗ
			//|	Документ.КонтрактСПроизводителем.%ИмяТЧДвижений% КАК КонтрактСПроизводителемКомплектующие
			//|ГДЕ
			//|	КонтрактСПроизводителемКомплектующие.Ссылка = &Ссылка
			//|
			//|СГРУППИРОВАТЬ ПО
			//|	КонтрактСПроизводителемКомплектующие.Номенклатура,
			//|	КонтрактСПроизводителемКомплектующие.Коэффициент";
			//
			//Запрос.УстановитьПараметр("Ссылка", Ссылка);
			//Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ИмяТЧДвижений%",ИмяТЧДвижений); 
			//
			//РезультатЗапроса = Запрос.Выполнить();
			//
			//СтрокаТЧ = РезультатЗапроса.Выбрать();
			// 
			//Пока СтрокаТЧ.Следующий() Цикл  				
			//	//Для Каждого СтрокаТЧ Из Товары Цикл 
			////--Данилова Е.В. 29.07.2025
			//	Если СтрокаТЧ.Количество=0 Тогда Продолжить КонецЕсли; 					
			//	
			//	Движение=Движения.ЗаказыПоставщикам.Добавить();			
			//	
			//	Движение.Период			=Дата;
			//	Движение.ВидДвижения	=ВидДвиженияНакопления.Приход;
			//	
			//	Движение.Склад			= Склад;
			//	Движение.Номенклатура	= СтрокаТЧ.Номенклатура;
			//	Движение.Заказ			= Ссылка;
			//	
			//	Движение.Количество		= СтрокаТЧ.Количество;				
			//	Движение.СуммаРуб		= глПересчет(СтрокаТЧ.Всего,Валюта,Курс,Валюты_Курсы.ВалютаНац,	1);
			//	Движение.СуммаEUR		= глПересчет(СтрокаТЧ.Всего,Валюта,Курс,Валюты_Курсы.Евро,		Валюты_Курсы.КурсЕвро);
			//	Движение.СуммаUSD		= глПересчет(СтрокаТЧ.Всего,Валюта,Курс,Валюты_Курсы.Доллары,	Валюты_Курсы.КурсДоллара);
			//	
			//	Движение.Отправитель	= Контрагент;
			//	Движение.Контракт       = Контракт;
			//КонецЦикла;
			//--Данилова Е.В. 11.08.2025
		КонецЕсли;
		//++Данилова Е.В. 29.07.2025
		Если Дата >= Дата(2025,07,01) Тогда
			
			Если КПНаКомплекты Тогда
				
				ВыполнитьДвиженияПоРегистрам(СписатьСтарыеЗаказыПоставщикамПоКомплектующим(Ссылка,Валюты_Курсы,Ложь,истина),ОбменДанными.Загрузка,Ложь);
				Движения.ЗаказыПоставщикамШтуки.Записать();
				
				ВыполнитьДвиженияПоРегистрам(СписатьСтарыеЗаказыПоставщикамПоКомплектующим(Ссылка,Валюты_Курсы,Ложь,Ложь),ОбменДанными.Загрузка,Ложь);
				Движения.ЗаказыПоставщикам.Записать();
				
			Иначе 
				ВыполнитьДвиженияПоРегистрам(СписатьСтарыеЗаказыПоставщикамПоКомплектующим(Ссылка,Валюты_Курсы,Истина,истина),ОбменДанными.Загрузка,Ложь);
				Движения.ЗаказыПоставщикамШтуки.Записать();
				
				ВыполнитьДвиженияПоРегистрам(СписатьСтарыеЗаказыПоставщикам(Ссылка,Валюты_Курсы),ОбменДанными.Загрузка,Ложь); 
				Движения.ЗаказыПоставщикам.Записать(); 
			КонецЕсли;
		Иначе 
			ВыполнитьДвиженияПоРегистрам(СписатьСтарыеЗаказыПоставщикам(Ссылка,Валюты_Курсы),ОбменДанными.Загрузка,Ложь);
		КонецЕсли;
		 	
		//Движения.ЗаказыПоставщикам.Записать(); 
		//--Данилова Е.В. 29.07.2025
		ОткорректироватьОстаткиЗАП();
	иначе
		Если СостояниеЗаказа = Перечисления.СостояниеЗаказаПоставщику.ПодтвержденныйЗаказ или СостояниеЗаказа = Перечисления.СостояниеЗаказаПоставщику.Закрыт Тогда
			Для Каждого СтрокаТЧ Из ТоварыПартии Цикл
				Если  СтрокаТЧ.Количество = 0 Тогда Продолжить КонецЕсли;
				//кухарь 16.06.15 начало
				//есть старые КП с 0 в шт в коробе и их как-то надо закрыть.
				//Если  СтрокаТЧ.ШтукВКоробе = 0 Тогда сообщить(""+СтрокаТЧ.Номенклатура+" "+СтрокаТЧ.Им7+" не задано количество в коробе!");Отказ=ИСТИНА; КонецЕсли;
				если СостояниеЗаказа<>Перечисления.СостояниеЗаказаПоставщику.Закрыт тогда
					Если  СтрокаТЧ.ШтукВКоробе = 0 Тогда сообщить(""+СтрокаТЧ.Номенклатура+" "+СтрокаТЧ.Им7+" не задано количество в коробе!");Отказ=ИСТИНА; КонецЕсли;
				КонецЕсли;
				//кухарь 16.06.15 конец
				Движение=Движения.Партии.Добавить();		
				Движение.Период = Дата;
				Движение.ВидДвижения = ?(СостояниеЗаказа = Перечисления.СостояниеЗаказаПоставщику.Закрыт,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);
				//крохин начало 04.03.2015
				//в резервах вес и сумма не нужны
				////Катаев+ 04/12/14 
				////Движение.Вес = СтрокаТЧ.ВесВсего;
				//Вес = ПолучитьВесаПоОстаткамПартии(СтрокаТЧ.Им7, СтрокаТЧ.Номенклатура, СтрокаТЧ.Количество, Справочники.КонтрактыСПроизводителем.ПустаяСсылка(), Дата);
				//Движение.Вес = Вес.Брутто;
				//Движение.ВесНетто = Вес.Нетто;
				//
				////Катаев- 04/12/14
				Движение.Вес = 0;
				Движение.ВесНетто = 0;
				//крохин конец 04.03.2015
				Движение.Количество = СтрокаТЧ.Количество;
				Движение.Контракт = Контракт;
				Движение.Номенклатура =СтрокаТЧ.Номенклатура;
				Движение.Партия = СтрокаТЧ.Им7;
				Движение.Склад = Склад;
				//Катаев+ 06/11/14
				//Движение.Сумма = СтрокаТЧ.Сумма;
				//крохин начало 04.03.2015
				//в резервах вес и сумма не нужны
				//Движение.Сумма = ПолучитьСуммуПоПоступлению(СтрокаТЧ.Им7, СтрокаТЧ.Номенклатура, СтрокаТЧ.Количество);
				//Движение.Валюта = ПолучитьВалютуПНК(СтрокаТЧ.Им7);
				
				Движение.Сумма = 0;
				Движение.Валюта = ПолучитьВалютуПНК(СтрокаТЧ.Им7);
				//крохин конец 04.03.2015

				//Катаев- 06/11/14
				Движение.ШтВКоробе = СтрокаТЧ.ШтукВКоробе;			
			КонецЦикла;
			Движения.Партии.Записать();
		КонецЕсли;
	КонецЕсли;
	//крохин конец 25.05.2011
	
	//крохин начало 13.05.2011
	//упаковка
	Если Дата >= '20110501' Тогда
	СформироватьДвиженияПоЗабалансовымРегистрам();
	Движения.РезервыТМЦзабаланс.Записать();
	КонецЕсли;
	//крохин конец 13.05.2011
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)	
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	Если Основание=Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;
		
	ВидОснования	= Основание.Метаданные().Имя;		
	ДокОснование	= Основание;	
	
	РеквизитыОснования=Новый Структура("Организация,Подразделение,Склад,Контрагент,Договор,Менеджер,ТипЦен,ТипСкидок,Скидка,Контракт");
	ЗаполнитьЗначенияСвойств(РеквизитыОснования,Основание);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,РеквизитыОснования);	
	
	Комментарий		= ""+ДокОснование.Метаданные()+" № " + ДокОснование.Номер + " от " + Формат(ДокОснование.Дата,"ДФ=dd.MM.yy");	
	//удалить
	Комментарий = ДокОснование.Комментарий;
	//удалить
	ОстаткиЗаказов=РегистрыНакопления.ЗаказыПоставщикам.Остатки(,Новый Структура("Заказ",Основание),"Номенклатура","Количество");
	
	//Мессерле- должны сканировать
	Если  НЕ(ВидОснования="КонтрактСПроизводителем" и Основание.состояниезаказа=перечисления.СостояниеЗаказаПоставщику.Закрыт и Склад.ТипСклада=перечисления.ТипСклада.ВнешнийСкладРезерв) тогда
		Для Каждого исхСтрокаТЧ Из Основание.Товары Цикл
			СтрокаОстатка=ОстаткиЗаказов.Найти(исхСтрокаТЧ.Номенклатура,"Номенклатура");
			Если СтрокаОстатка=Неопределено ИЛИ СтрокаОстатка.Количество<=0 Тогда Продолжить; КонецЕсли; 
			
			СтрокаТЧ = Товары.Добавить();		
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,исхСтрокаТЧ);
			СтрокаТЧ.ЗаявкаПоставщику=Основание;
			
			СтрокаТЧ.Количество=СтрокаОстатка.Количество;
			СтрокаТЧ.Заявка =  СтрокаОстатка.Количество;
			СтрокаТЧ.ПодтвержденнаяЗаявка = СтрокаОстатка.Количество; 
			РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект);		
			
		КонецЦикла;	
	Конецесли;  //Мессерле- должны сканировать

	//крохин начало
	СтрокаЗаявок = ЗаявкиНаПроизводство.Добавить();
	СтрокаЗаявок.ЗаявкаНаПроизводство = Основание;
	//крохин конец
	//крохин начало 17.02.2011
	//заполняем ЕТА по ЗАП
	ДатаПоступления = ДокОснование.ДатаПоступления;
	//крохин конец 17.02.2011
	//Катаев+ 05/05/14
	Если ВидОснования = "ЗаявкаНаПроизводство" Тогда
		Валюта = ДокОснование.Валюта;
	КонецЕсли;
	//Катаев- 05/05/14
КонецПроцедуры

Процедура ОткорректироватьОстаткиЗАП()
ТЗ = новый ТаблицаЗначений;
ТЗ.Колонки.Добавить("ЗаявкаНаПроизводство");
Для Каждого СтрокаТЧ Из Товары Цикл
СтрокаТЗ = ТЗ.Добавить();
СтрокаТЗ.ЗаявкаНаПроизводство = СтрокаТЧ.ЗаявкаПоставщику;
КонецЦикла;
ТЗ.Свернуть("ЗаявкаНаПроизводство","");
Для Каждого СтрокаТЗ Из ТЗ Цикл
попытка	
ЗаявкаНаПроизводство = СтрокаТЗ.ЗаявкаНаПроизводство.ПолучитьОбъект();
исключение
продолжить;
КонецПопытки;
//Если ЗаявкаНаПроизводство.СостояниеЗаказа = Перечисления.СостояниеЗаказаПоставщику.Произведен Тогда
//	Продолжить;
//	КонецЕсли;
//крохин начало 24.03.2011
//корректируем только ЗАП
Если ЗаявкаНаПроизводство.Метаданные().Имя <> "ЗаявкаНаПроизводство" Тогда
	Продолжить;
КонецЕсли;
//крохин конец 24.03.2011
ДЛя Каждого СтрокаТЗ ИЗ ЗаявкаНаПроизводство.Товары Цикл
	СтрокаТЗ.Остаток = 0;
	КонецЦикла;
Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказыПоставщикамОстатки.Номенклатура,
	               |	ЗаказыПоставщикамОстатки.КоличествоОстаток,
	               |	ЗаказыПоставщикамОстатки.СуммаРубОстаток,
	               |	ЗаказыПоставщикамОстатки.СуммаUSDОстаток,
	               |	ЗаказыПоставщикамОстатки.СуммаEURОстаток
	               |ИЗ
	               |	РегистрНакопления.ЗаказыПоставщикам.Остатки(&НачПериода, Заказ = &Заказ) КАК ЗаказыПоставщикамОстатки";
	Запрос.УстановитьПараметр("НачПериода",ТекущаяДата());
	Запрос.УстановитьПараметр("Заказ",ЗаявкаНаПроизводство.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.КоличествоОстаток > 0 Тогда	
		СтрокаТоваров = ЗаявкаНаПроизводство.Товары.Найти(Выборка.Номенклатура,"Номенклатура");	
		СтрокаТоваров.Остаток = Выборка.КоличествоОстаток;
		КонецЕсли;
	КонецЦикла;
	ЗаявкаНаПроизводство.Записать(РежимЗаписиДокумента.Проведение);
КонецЦикла;
КонецПроцедуры

Процедура СформироватьДвиженияПоЗабалансовымРегистрам()
	//крохин начало 03.08.2015
	//не используется
//ТЗ = ПолучитьТЗУпаковки(Товары);
//Если СостояниеЗаказа = Перечисления.СостояниеЗаказаПоставщику.ПодтвержденныйЗаказ Тогда
//Для Каждого СтрокаТЗ Из ТЗ Цикл
//Движение = Движения.РезервыТМЦзабаланс.Добавить();
//Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
//Движение.Заказ = Ссылка;
//Движение.Склад = СкладУпаковки;
//Движение.Номенклатура = СтрокаТЗ.Номенклатура;
//Движение.Количество = СтрокаТЗ.Количество;
//Движение.Период = Дата;
//КонецЦикла;
//ИначеЕсли СостояниеЗаказа = Перечисления.СостояниеЗаказаПоставщику.Закрыт Тогда
//Для Каждого СтрокаТЗ Из ТЗ Цикл
//Движение = Движения.РезервыТМЦзабаланс.Добавить();
//Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
//Движение.Заказ = СтрокаТЗ.Заказ;
//Движение.Склад = СтрокаТЗ.Заказ.СкладУпаковки;
//Движение.Номенклатура = СтрокаТЗ.Номенклатура;
//Движение.Количество = СтрокаТЗ.Количество;
//Движение.Период = Дата;
//КонецЦикла;
//КонецЕсли;
   //крохин конец 03.08.2015
КонецПроцедуры

#Область Комплектующие 
//++Данилова Е.В. 28.07.2025
Процедура ЗаполнитьТЧКомплектующие()
	
	//Если Комплектующие.Количество() = 0  
	Если НЕ КПНаКомплекты Тогда  	
				
		//ЗаполнениеДокументов.ЗаполнитьТЧКомплектующие(ЭтотОбъект,,,,истина);
		ЗаполнениеДокументов.ЗаполнитьТЧКомплектующиеСоСверткой(ЭтотОбъект,,,,истина);
		Для каждого СтрокаТЧ Из Товары Цикл
			
			ЗаполнитьКоличествоКомплектующихПоСтроке(СтрокаТЧ); 
			
			Если ЗначениеЗаполнено(СтрокаТЧ.ЗаявкаПоставщику) Тогда
				
				СтрокиТЧ = Комплектующие.НайтиСтроки(Новый Структура("Продукция",СтрокаТЧ.Номенклатура)); 
				Для каждого СтрокаТЧКомпл Из СтрокиТЧ Цикл
					
					СтрокаТЧКомпл.ЗаявкаПоставщику = СтрокаТЧ.ЗаявкаПоставщику; 	
					
				КонецЦикла;
				
				
			КонецЕсли;
			
		КонецЦикла;
		
		//Сообщить("Была (пере)заполнена Табличная часть ""Комплектующие""");
		//КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьТЧКомплектующие(Отказ)

	
	КоличествоКомплектующих = Комплектующие.Итог("Количество");
	
	КоличествоКомплектующихДляСверки = Товары.Итог("КоличествоКомплектующих");
	
	Если КоличествоКомплектующихДляСверки = 0 Тогда
		Для каждого СтрокаТЧ из Товары цикл
			ЗаполнитьКоличествоКомплектующихПоСтроке(СтрокаТЧ);		
		КонецЦикла;			
	КонецЕсли;
	
	Если не ОбменДанными.Загрузка тогда
		Если Товары.Итог("КоличествоКомплектующих") <> Комплектующие.Итог("Количество") тогда
			СообщитьИзМодуля("Не совпадает количество комплектующих в таблице состав и в таблице комплектующие");
			Отказ = Истина; 
		КонецЕсли;
		
		//ТЧНоменклатура = Товары.Выгрузить(,"Номенклатура");
		//ТЧНоменклатура.Свернуть("Номенклатура"); 
		 
		МассивНоменклатуры = ПолучитьМассивНоменклатуры("Товары","Номенклатура"); //ТЧНоменклатура.ВыгрузитьКолонку("Номенклатура"); 
		
		ТЧПродукции = Комплектующие.Выгрузить(,"Продукция"); 
		ТЧПродукции.Свернуть("Продукция"); 	
		
		МассивПродукции = ПолучитьМассивНоменклатуры("Комплектующие","Продукция");//ТЧПродукции.ВыгрузитьКолонку("Продукция");
		
		Если МассивНоменклатуры.Количество() <>  МассивПродукции.Количество() Тогда
			
			Отказ = истина; 
			Сообщить("Не совпадает номенклатура на закладке Состав и Комплектующие");
		Иначе 
			Для каждого ЭлементТовара Из МассивНоменклатуры Цикл
				
				Если МассивПродукции.Найти(ЭлементТовара) = неопределено Тогда
					
					Отказ = Истина; 	
					
					Сообщить("Не совпадает номенклатура на закладке Состав:" +Строка(ЭлементТовара)  + " и Комплектующие: не найдено");
					
				КонецЕсли;	
				
			КонецЦикла; 
			
			Для каждого ЭлементТовара Из МассивПродукции Цикл
				
				Если МассивНоменклатуры.Найти(ЭлементТовара) = неопределено Тогда
					
					Отказ = Истина; 	
					
					Сообщить("Не совпадает номенклатура на закладке Комплектующие:" +Строка(ЭлементТовара)  + " и Состав: не найдено");
					
				КонецЕсли;	
				
			КонецЦикла;

		КонецЕсли;
		
	КонецЕсли;                                
	

КонецПроцедуры

Процедура ДвиженияПоЗаказамПоставщикам(ИмяТЧДвижений,ИмяРНакопления)
	
	Валюты_Курсы=ПолучитьСтруктуруВалютИКурсы(Валюта,Курс,Дата,Договор);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтрактСПроизводителемКомплектующие.Номенклатура КАК Номенклатура,
	|	СУММА(КонтрактСПроизводителемКомплектующие.Количество) КАК Количество,
	|	МАКСИМУМ(КонтрактСПроизводителемКомплектующие.Цена) КАК Цена,
	|	СУММА(КонтрактСПроизводителемКомплектующие.Всего) КАК Всего,
	|	КонтрактСПроизводителемКомплектующие.Коэффициент КАК Коэффициент
	|ИЗ
	|	Документ.КонтрактСПроизводителем.%ИмяТЧДвижений% КАК КонтрактСПроизводителемКомплектующие
	|ГДЕ
	|	КонтрактСПроизводителемКомплектующие.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтрактСПроизводителемКомплектующие.Номенклатура,
	|	КонтрактСПроизводителемКомплектующие.Коэффициент";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ИмяТЧДвижений%",ИмяТЧДвижений); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтрокаТЧ = РезультатЗапроса.Выбрать();
	
	Пока СтрокаТЧ.Следующий() Цикл  				
		
		Если СтрокаТЧ.Количество=0 Тогда Продолжить КонецЕсли; 					
		
		Движение=Движения[ИмяРНакопления].Добавить();			
		
		Движение.Период			=Дата;
		Движение.ВидДвижения	=ВидДвиженияНакопления.Приход;
		
		Движение.Склад			= Склад;
		Движение.Номенклатура	= СтрокаТЧ.Номенклатура;
		Движение.Заказ			= Ссылка;
		
		Движение.Количество		= СтрокаТЧ.Количество;				
		Движение.СуммаРуб		= глПересчет(СтрокаТЧ.Всего,Валюта,Курс,Валюты_Курсы.ВалютаНац,	1);
		Движение.СуммаEUR		= глПересчет(СтрокаТЧ.Всего,Валюта,Курс,Валюты_Курсы.Евро,		Валюты_Курсы.КурсЕвро);
		Движение.СуммаUSD		= глПересчет(СтрокаТЧ.Всего,Валюта,Курс,Валюты_Курсы.Доллары,	Валюты_Курсы.КурсДоллара);
		
		Движение.Отправитель	= Контрагент;
		Движение.Контракт       = Контракт;
	КонецЦикла;
	

КонецПроцедуры

Функция ПолучитьМассивНоменклатуры(ИмяТЧ,ИмяКолонки)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КонтрактСПроизводителемТовары.%ИмяКолонки% КАК Номенклатура,
		|	КонтрактСПроизводителемТовары.Количество КАК Количество
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	&Товары КАК КонтрактСПроизводителемТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТТовары.Номенклатура КАК Номенклатура
		|ИЗ
		|	ВТТовары КАК ВТТовары
		|ГДЕ
		|	ВТТовары.Количество > 0
		|	И ВЫРАЗИТЬ(ВТТовары.Номенклатура КАК Справочник.Номенклатура).Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)"; 	
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ИмяКолонки%",ИмяКолонки);
	
	Запрос.УстановитьПараметр("Товары",ЭтотОбъект[ИмяТЧ].Выгрузить()); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Номенклатура"); 


КонецФункции // ПолучитьМассивНоменклатуры()

//--Данилова Е.В. 28.07.2025
#КонецОбласти



НеКонтролироватьЗапись=Ложь;