&НаКлиенте
Процедура ЗаполнитьПоКодамНоменклатуры(Команда)
	//Валетов + 15,01,25 Заполнение по кодам номенклатуры. https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1895
	СТрВвода = "";
	Если Объект.товары.Количество() > 0 Тогда
		Текст = "ТЧ товары будет очищена перед заполнением. Продолжить?";
		Ответ = Вопрос(Текст, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, );
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.Товары.Очистить();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ВвестиСтроку(СТрВвода,"Введите коды номенклатуры ",,Истина) Тогда
		Для Каждого Строка Из СтрРазделить(СТрВвода, Символы.ПС) Цикл
			
			Номэл = Справочники.Номенклатура.НайтиПоКоду(Строка);
			
			Если не Номэл = Неопределено Тогда
				Если НЕ Номэл.ЭтоГруппа Тогда
					СтрТовары = Объект.Товары.Добавить();
					СтрТовары.Номенклатура   = Номэл;
					СтрТовары.ГТИН           = Номэл.ГТИН;
				КонецЕсли;
			КонецЕсли
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры