Процедура ЗапуститьФЗ(МетодФЗ,ПараметрыФЗ,ИмяФЗ) Экспорт
	Если ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("ИмяМетода,Наименование",МетодФЗ,ИмяФЗ)).Количество()>0 Тогда
		Возврат;
	КонецЕсли;	
	ФоновыеЗадания.Выполнить(МетодФЗ,ПараметрыФЗ,,ИмяФЗ);
КонецПроцедуры	
Процедура Номенклатура_УстановитьМинКоличествоДляПроизводстваПоРодителю(Родитель,ЗначениеМинКоличества) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Номенклатура.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |ГДЕ
	                      |	Номенклатура.Ссылка В ИЕРАРХИИ(&Родитель) и не Номенклатура.Ссылка=&Родитель");
	Запрос.УстановитьПараметр("Родитель",Родитель);
	
	 ПараметрыСеанса.СверткаБазы = Истина;
		Для каждого НомСсылка Из Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка") Цикл
			НомОбъект = НомСсылка.получитьОбъект();
			НомОбъект.МинимальноеКоличествоДляЗаказаНаПроизводство = ЗначениеМинКоличества;
			Попытка
				НомОбъект.Записать();
			Исключение
			КонецПопытки;	
		КонецЦикла;	
	 ПараметрыСеанса.СверткаБазы = Ложь;
КонецПроцедуры	