// Шворобей ВЮ 28.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5976
#Область КоллективныеРаботы

Функция СоздатьКоллективныеРаботыСВидомДопОбработки(МассивНакладных, ДопОбработка = Неопределено, Сотрудник = Неопределено) Экспорт
	
	КоллективнаяРабота = Документы.КоллективныеРаботы.СоздатьДокумент();
	
	Если ЗначениеЗаполнено(ДопОбработка) Тогда
		КоллективнаяРабота.ВидРаботы = ДопОбработка; // Справочники.ВидыВыполняемыхРабот.ДопОбработка;
	Иначе
		КоллективнаяРабота.ДополнительныеСвойства.Вставить("НеЗаполнятьВидРаботы", Истина);
	КонецЕсли;
	КоллективнаяРабота.ДатаНачалаРабот = ТекущаяДатаСеанса();
	КоллективнаяРабота.Состояние = Перечисления.СостоянияНакладной.ВРаботе;
	
	Для Каждого Накладная из МассивНакладных цикл
		СтрТЧ = КоллективнаяРабота.Накладные.Добавить();		
		СтрТЧ.Накладная = Накладная;
		МетаданныеДокумента = Накладная.Метаданные();
		
		СтрТЧ.КоличествоКоробок = Накладная.КоличествоКоробок;
		СтрТЧ.КоличествоСтрок = Накладная.Товары.Количество();
		СтрТЧ.КоличествоПаллет = Накладная.КоличествоПаллет;		
		
		Если ЕстьТабЧастьДокумента("Товары", МетаданныеДокумента) Тогда
			тзТовары = СтрТЧ.Накладная.Товары.Выгрузить();
		ИначеЕсли ЕстьТабЧастьДокумента("ШтрихкодыУпаковок", МетаданныеДокумента) Тогда
			тзШтрихкодыУпаковок = СтрТЧ.Накладная.ШтрихкодыУпаковок.Выгрузить();
			тзТовары = Документы.КоллективныеРаботы.ПреобразоватьШтрихкодыУпаковокВТовары(тзШтрихкодыУпаковок);
		КонецЕсли;

		СтрТЧ.КоличествоШтук = Документы.КоллективныеРаботы.НайтиКоличествоКомплектующих(тзТовары);
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		
		СтрТЧ = КоллективнаяРабота.Данные.Добавить();
		СтрТЧ.ВедущийСотрудник = Сотрудник;
		СтрТЧ.Сотрудник = Сотрудник;
		СтрТЧ.ВидРаботы = КоллективнаяРабота.ВидРаботы;
		СтрТЧ.НачалоВыполнения = ТекущаяДатаСеанса();
		
		// Кельманов А.В. - ИЗМ-0000000062 - 2026.06.26 {
	Иначе
		
		ТекБригада = ТекущаяБригада(Ложь);
		ТекНачалоВыполнения = ТекущаяДатаСеанса();
		ТекВедущийСотрудник = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
		
		Для Каждого Стр Из ТекБригада Цикл
			
			СтрТЧ = КоллективнаяРабота.Данные.Добавить();
			
			Если Не ЗначениеЗаполнено(ТекВедущийСотрудник) Тогда
				
				ТекВедущийСотрудник = Стр.Сотрудник;
				
			КонецЕсли;
			
			СтрТЧ.ВедущийСотрудник = ТекВедущийСотрудник;
			СтрТЧ.Сотрудник = Стр.Сотрудник;
			СтрТЧ.ВидРаботы = КоллективнаяРабота.ВидРаботы;
			СтрТЧ.НачалоВыполнения = ТекНачалоВыполнения;
			
		КонецЦикла;
		// Кельманов А.В. - ИЗМ-0000000062 - 2026.06.26 }
		
	КонецЕсли;
	
	КоллективнаяРабота.ДополнительныеСвойства.Вставить("Автозаполнение", Истина); // Кельманов А.В. - SNL-189 - 2026.04.24
	
	Попытка
		КоллективнаяРабота.Записать(РежимЗаписиДокумента.Проведение);
		//+++Чирков 16.01.2026
		//Возврат КоллективнаяРабота;
		Возврат КоллективнаяРабота.Ссылка;
		//---Чирков 16.01.2026
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции

Функция ЗакрыватьКоллективныеРаботы(Сотрудник = Неопределено) Экспорт
	
	МассивЗакрытия = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаЗапретаРедактирование", ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования());	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Данные.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КоллективныеРаботы.Данные КАК Данные
	|ГДЕ
	|	НЕ Данные.Ссылка.ПометкаУдаления
	|	И Данные.Сотрудник = &Сотрудник
	|	И Данные.Ссылка.Дата > &ДатаЗапретаРедактирование
	|	И Данные.Ссылка.ДатаОкончанияРабот = ДАТАВРЕМЯ(1, 1, 1)";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если ДокОбъект <> Неопределено Тогда
			ДокОбъект.Состояние = Перечисления.СостоянияНакладной.Отгружена;
			ДокОбъект.ДатаОкончанияРабот = ТекущаяДатаСеанса();
			Для Каждого Стр ИЗ ДокОбъект.Данные Цикл
				Стр.ОкончаниеВыполнения = ДокОбъект.ДатаОкончанияРабот;	
			КонецЦикла;
			ДокОбъект.ДополнительныеСвойства.Вставить("НеЗаполнятьВидРаботы", Истина);
			Попытка
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				МассивЗакрытия.Добавить(ДокОбъект.Ссылка);
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивЗакрытия;
	
КонецФункции

#КонецОбласти
// Шворобей ВЮ 28.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5976
