////////////////////////////////////////////////////////////////////////////////////////////
Функция ЗапретНаСменуДатыОтгрузки(ДокСсылка) Экспорт
	
	Если ТипЗнч(ДокСсылка) <> Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МассивСостоянийНакладной = Новый Массив;
	МассивСостоянийНакладной.Добавить(Перечисления.СостоянияНакладной.Паллетирование);
	МассивСостоянийНакладной.Добавить(Перечисления.СостоянияНакладной.Термоусадка);
	МассивСостоянийНакладной.Добавить(Перечисления.СостоянияНакладной.ГотоваКОтгрузке);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	Запрос.УстановитьПараметр("МассивСостоянийНакладной", МассивСостоянийНакладной);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасходнаяНакладная.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.Ссылка = &ДокСсылка
	|	И РасходнаяНакладная.СостояниеНакладной В(&МассивСостоянийНакладной)
	|	И (РасходнаяНакладная.НужноПаллетирование = ИСТИНА
	|			ИЛИ РасходнаяНакладная.НужнаТермоусадка = ИСТИНА)";
	
	УстановитьПривилегированныйРежим(Истина);
	Рез = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если НЕ Рез.Пустой() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
////////////////////////////////////////////////////////////////////////////////////////////
