Перем НачСостНакладной;
Перем НеКонтролироватьЗапись;
// Кухарь А.Ю. 12.05.2022 начало
//
Перем ВозниклаОшибка; 
// Кухарь А.Ю. 12.05.2022 конец


Процедура УстановитьСостояниеДокументов(НовоеСостояниеДокументов) Экспорт
	//крохин начало 09.02.2011
	//за датой запрета записываем реквизиты только в ЦО
	//НеКонтролироватьЗапись=Истина;
	//СостояниеДокументов=НовоеСостояниеДокументов;
	//Записать();
	//НеКонтролироватьЗапись=Ложь;
	Отказ = Ложь;
	Если ЭтотОбъект.Дата<=ПолучитьДатуЗапретаРедактирования(ЭтотОбъект) Тогда
		Отказ = Истина;
	КонецЕсли;
	Если Отказ Тогда
		Если	ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение  Тогда
			НеКонтролироватьЗапись=Истина;
			СостояниеДокументов=НовоеСостояниеДокументов;
			Записать();
			НеКонтролироватьЗапись=Ложь;	
		КонецЕсли;
	Иначе
		НеКонтролироватьЗапись=Истина;
		СостояниеДокументов=НовоеСостояниеДокументов;
		Записать();
		НеКонтролироватьЗапись=Ложь;
	КонецЕсли;
	//крохин конец 09.02.2011
	
КонецПроцедуры

Процедура УстановитьДатуНомерСчета(НоваяДатасчета,НовыйНомерСчета)   Экспорт
	//крохин начало 09.02.2011
	//за датой запрета записываем реквизиты только в ЦО
	//НеКонтролироватьЗапись=Истина;
	//НомерСчета=НовыйНомерСчета;
	//ДатаСчета= НоваяДатасчета;
	//Записать();
	//НеКонтролироватьЗапись=Ложь;
	Отказ = Ложь;
	Если ЭтотОбъект.Дата<=ПолучитьДатуЗапретаРедактирования(ЭтотОбъект) Тогда
		Отказ = Истина;
	КонецЕсли;
	Если Отказ Тогда
		Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			НеКонтролироватьЗапись=Истина;
			НомерСчета=НовыйНомерСчета;
			ДатаСчета= НоваяДатасчета;
			Записать();
			НеКонтролироватьЗапись=Ложь;
		КонецЕсли;	
	Иначе
		НеКонтролироватьЗапись=Истина;
		НомерСчета=НовыйНомерСчета;
		ДатаСчета= НоваяДатасчета;
		Записать();
		НеКонтролироватьЗапись=Ложь;
	КонецЕсли;
	//крохин конец 09.02.2011
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	КонтрольДатыЗапрета(ЭтотОбъект,Отказ);			
	Если Отказ Тогда Возврат КонецЕсли; 
		
	// Кельманов А.В. - HELP-2272 - 2024.12.04 {
	Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.РасходнаяНакладная") И ДокОснование.Отгружен = Перечисления.Отгружен.Отгружен 
		И ВидОплаты <> ВидОплатыДоИзменения Тогда
		
		СообщитьИзМодуля("Нельзя изменять вид оплаты в отгруженной РНК!");
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;
	// Кельманов А.В. - HELP-2272 - 2024.12.04 }
	
	//Кухарь 07.03.19 начало
	//Коррекции на основании ЗТО
	если ДокОснование.Метаданные().Имя<>"ЗаявкаВТранспортныйОтдел"  тогда
		//Кухарь 07.03.19 конец
		
		СуммаДокумента		= Товары.Итог("Всего");
		ОбъемДокумента		= Товары.Итог("Объем");
		КоличествоДокумента = Товары.Итог("Количество");
		ГруппыТоваров		= ГруппыТоваровДокумента(ЭтотОбъект);
		
		
		//крохин начало 10.04.2013
		СуммаДокументаДоИзменения = ТоварыДоИзменения.Итог("Всего");
		//крохин конец 10.04.2013
		
		
		//		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
		
		//крохин начало 10.12.2012
		
		//Кухарь 07.03.19 начало
		//Коррекции на основании ЗТО
	КонецЕсли;
	//Кухарь 07.03.19 конец
	
	//Кухарь 07.12.18 начало
	//Заполним согласования	
	если СостояниеКоррекции=Перечисления.СостоянияКоррекции.Утверждена тогда
		ТЗ=ПолучитьРаспределениеРеквизитовПоПолномочиям();
		если Согласования.Количество()=0 тогда
			Отказ=Истина;
			СообщитьИзМодуля("Нельзя утверждать коррекции без изменений");
		КонецЕсли;	 
	КонецЕсли;	
	//Кухарь 07.12.18 конец
	
	//Кухарь 14.01.19 начало
	если Отказ<>Истина тогда
		//Кухарь 14.01.19 конец
		
		//Кухарь 10.12.18 начало
		//Отработано будем ставить по кнопке отработать ткт
		//Кухарь 14.01.18 начало
		//Менять состояние коррекции нужно не только при согласовании коррекции
		//Если (Проведен ИЛИ РежимЗаписи = РежимЗаписиДокумента.Проведение) и Согласована и ссылка.Согласована=Ложь  Тогда
		Если (Проведен ИЛИ РежимЗаписи = РежимЗаписиДокумента.Проведение) и СостояниеКоррекции<>ДокОснование.СостояниеКоррекции и СостояниеКоррекции<>Перечисления.СостоянияКоррекции.Принята  Тогда	
			//Кухарь 14.01.18 конец
			дата=ТекущаяДата();
			//Кухарь 10.12.18 конец
			
			НакладнаяОбъект = ДокОснование.ПолучитьОбъект();
			НакладнаяОбъект.УстановитьСостояниеКоррекции(СостояниеКоррекции);
		КонецЕсли;
		//Кухарь 14.01.19 начало
	КонецЕсли;
	//Кухарь 14.01.19 конец
	
	//крохин конец 10.12.2012
	
	//крохин начало 26.03.2013
	//строка изменений
	Если НЕ ОбменДанными.Загрузка И Модифицированность() Тогда
		//		Если НЕ ОбменДанными.Загрузка Тогда
		СтрокаИзменений = "";
		Если Контрагент <> КонтрагентДоИзменения Тогда
			СтрокаИзменений = СтрокаИзменений + "Контрагент,";
		КонецЕсли;
		
		Если Договор <> ДоговорДоИзменения Тогда
			СтрокаИзменений = СтрокаИзменений + "Договор,";
		КонецЕсли;
		
		
		Если ДатаОплаты <>ДатаОплатыДоИзменения Тогда
			СтрокаИзменений = СтрокаИзменений + "ДатаОплаты,";
		КонецЕсли;
		
		
		
		
		Если ОтсрочкаПлатежа <>ОтсрочкаПлатежаДоИзменения Тогда
			СтрокаИзменений = СтрокаИзменений + "ОтсрочкаПлатежа,";
		КонецЕсли;
		
		
		
		Если Менеджер <> МенеджерДоИзменения Тогда
			СтрокаИзменений = СтрокаИзменений + "Менеджер,";
		КонецЕсли;
		
		
		Если Комментарий <> КомментарийДоИзменения Тогда
			СтрокаИзменений = СтрокаИзменений + "Комментарий,";
		КонецЕсли;
		
		
		
		Если ДатаЗаказа <> ДатаЗаказаДоИзменения Тогда
			СтрокаИзменений = СтрокаИзменений + "ДатаЗаказа,";
		КонецЕсли;
		
		
		
		
		Если НомерЗаказа <> НомерЗаказаДоИзменения Тогда
			СтрокаИзменений = СтрокаИзменений + "НомерЗаказа,";
		КонецЕсли;
		
		
		
		Если Подразделение <> ПодразделениеДоИзменения Тогда
			СтрокаИзменений = СтрокаИзменений + "Подразделение,";
		КонецЕсли;
		
		
		Если Организация <> ОрганизацияДоИзменения Тогда
			СтрокаИзменений = СтрокаИзменений + "Контрагент,";
		КонецЕсли;
		
		Если ДатаОтгрузки <> ДатаОтгрузкиДоИзменения Тогда
			СтрокаИзменений = СтрокаИзменений + "ДатаОтгрузки,";
			
		КонецЕсли;
		
		//Кухарь 05.02.18 начало
		//ещё 2 поля для РНК
		Если АдресПерегруза <> АдресПерегрузаДоИзменения Тогда
			СтрокаИзменений = СтрокаИзменений + "АдресПерегруза,";		
		КонецЕсли;
		
		Если ВремяПерегруза <> ВремяПерегрузаДоИзменения Тогда
			СтрокаИзменений = СтрокаИзменений + "ВремяПерегруза,";
		КонецЕсли;
		//Кухарь 05.02.18 конец
		
		
		Если ПунктДоставки <> ПунктДоставкиДоИзменения Тогда
			СтрокаИзменений = СтрокаИзменений + "ПунктДоставки,";
		КонецЕсли;
		Если ТранспортнаяКомпания  <> ТранспортнаяКомпанияДоИзменения Тогда
			СтрокаИзменений = СтрокаИзменений + "ТранспортнаяКомпания,";
		КонецЕсли;
		Если Скидка  <> СкидкаДоИзменения Тогда
			СтрокаИзменений = СтрокаИзменений + "Скидка,";
		КонецЕсли;
		Если ПунктПерегруза  <> ПунктПерегрузаДоИзменения Тогда
			СтрокаИзменений = СтрокаИзменений + "ПунктПерегруза,";
		КонецЕсли;
		
		//Кухарь 25.06.18 начало	
		//ещё 1 реквизит меняется коррекцией
		если ТипДоставки<>ТипДоставкиДоИзменения  тогда
			СтрокаИзменений = СтрокаИзменений+ "ТипДоставки"
		КонецЕсли;	
		//Кухарь 25.06.18 конец
		
		
		Если  ЕстьИзмененияТЧТовары() <> 3 Тогда
			СтрокаИзменений = СтрокаИзменений + "ТабличнаяЧасть,";
		КонецЕсли;
	КонецЕсли;
	Если Не ПустаяСтрока(СтрокаИзменений) Тогда
		СтрокаИзменений = Лев(СтрокаИзменений,СтрДлина(СтрокаИзменений)-1);
	КонецЕсли;
	//крохин конец 26.03.2013
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
КонецПроцедуры

//Кухарь 02.10.19 начало
//Для вызова из обработок
//Процедура ОбработкаЗаполнения(Основание) 
Процедура ОбработкаЗаполнения(Основание) экспорт
	//Кухарь 02.10.19 конец
	
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	Если Основание=Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;
	
	//Катаев+ 18/12/14 До окончания тестирования в основной базе закрыл возможность создавать коррекцию на основании ПРМ и ПНК
	//Если ТипЗнч(Основание.Ссылка) <> Тип("ДокументСсылка.РасходнаяНакладная") Тогда
	//	Если ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы())) = ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить())) Тогда
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	//Ктатаев- 18/12/14
	//крохин начало 19.12.2011
	//проверка на существование неотработанных коррекций
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КоррекцияРНК.Ссылка
	|ИЗ
	|	Документ.КоррекцияРНК КАК КоррекцияРНК
	|ГДЕ
	|	КоррекцияРНК.Проведен
	|	И КоррекцияРНК.ДокОснование = &ДокОснование
	|	И НЕ КоррекцияРНК.Отработана";
	Запрос.УстановитьПараметр("ДокОснование",Основание);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		#Если Клиент Тогда
			Сообщить("По этому документу уже существует неотработанная коррекция. Открыт существующий документ");
			ФормаПретензии = Выборка.Ссылка.ПолучитьФорму("ФормаДокумента");
			ФормаПретензии.Открыть();
		#КонецЕсли
		Возврат;
	КонецЦикла;
	//крохин конец 19.12.2011
	
	Если Основание.СостояниеНакладной = Перечисления.СостоянияНакладной.ВРаботе Тогда
		#Если Клиент Тогда
			Сообщить("Накладные в состоянии ""в работе"" корректируются без заявки!");
		#КонецЕсли
		
		Возврат;
	КонецЕсли;
	
	
	ВидОснования	= Основание.Метаданные().Имя;
	
	ВариантЗаполнения=Неопределено;
	ВариантЗаполнения="Целиком";
	#ЕСЛИ КЛИЕНТ ТОГДА
		//	ВариантЗаполнения=ВыбратьВариантЗаполнения();
	#КОНЕЦЕСЛИ
	
	ДокОснование	= Основание;
	//Кухарь 04.03.19 начало
	//Теперь есть коррекции на основании ЗТО
	//ИБ				= Основание.ИБ;
	ИБ				= ПолучитьРеквизитОбъекта(ДокОснование,"ИБ");
	//Кухарь 04.03.19 конец	
	Контрагент 		= ПолучитьРеквизитОбъекта(ДокОснование,"Контрагент");
	Договор			= ПолучитьРеквизитОбъекта(ДокОснование,"Договор");
	ЛевыйКонтрагент = ПолучитьРеквизитОбъекта(ДокОснование,"ЛевыйКонтрагент");
	ПунктДоставки	= ПолучитьРеквизитОбъекта(ДокОснование,"ПунктДоставки");
	Менеджер 		= ПолучитьРеквизитОбъекта(ДокОснование,"Менеджер");
	//кухарь 29.01.15 начало	
	ДатаПриемки=ОпределитьДатуАвизацииДокумента(ДокОснование);	
	//кухарь 29.01.15 конец
	
	БанковскийСчет	= ПолучитьРеквизитОбъекта(ДокОснование,"БанковскийСчет");		
	ОтсрочкаПлатежа = ПолучитьРеквизитОбъекта(ДокОснование,"ОтсрочкаПлатежа");			
	
	
	Организация		= ПолучитьРеквизитОбъекта(ДокОснование,"Организация");		
	//Катаев+ 08/10/14
	//Если ВидОснования="Перемещение" Тогда
	//	Склад		= ДокОснование.СкладПолучатель;	
	//Иначе		
	//	Склад		= ПолучитьРеквизитОбъекта(ДокОснование,"Склад");	
	//КонецЕсли;	
	Склад		= ПолучитьРеквизитОбъекта(ДокОснование,"Склад");
	//Катаев- 08/10/14
	//крохин начало 05.03.2011
	//подразделение не копируем  
	//++Данилова Е.В. 29.09.2025 HELP-7048
	//Подразделение = Менеджер.Подразделение; 
	Подразделение = ЗаполнениеДокументов.ПодразделениеПродажПоМенеджеру(Менеджер);
	//--Данилова Е.В. 29.09.2025
	Если Подразделение = Справочники.Подразделения.ПустаяСсылка() Тогда
		Подразделение = Склад.Подразделение;
	КонецЕсли;
	//крохин конец 05.03.2011
	
	
	//крохин начало
	//Группы товаров пересчитаем заново
	//ГруппыТоваров	= ПолучитьРеквизитОбъекта(ДокОснование,"ГруппыТоваров");
	//крохин конец
	
	ТипЦен			= ПолучитьРеквизитОбъекта(ДокОснование,"ТипЦен");
	ТипСкидок		= ПолучитьРеквизитОбъекта(ДокОснование,"ТипСкидок");
	Скидка			= ПолучитьРеквизитОбъекта(ДокОснование,"Скидка");
	//крохин начало 14.02.2013
	//доп.скидка
	ДопСкидкаНаНакладную = ПолучитьРеквизитОбъекта(ДокОснование,"ДопСкидкаНаНакладную");
	//крохин конец 14.02.2013
	
	ТранспортнаяКомпания = ПолучитьРеквизитОбъекта(ДокОснование,"ТранспортнаяКомпания");
	//крохин начало 28.02.2013
	ПунктПерегруза = ПолучитьРеквизитОбъекта(ДокОснование,"ПунктПерегруза");
	//крохин конец 28.02.2013
	
	//Кухарь 25.06.18 начало	
	//ещё 1 реквизит меняется коррекцией
	ТипДоставки=ПолучитьРеквизитОбъекта(ДокОснование,"ТипДоставки");		
	//Кухарь 25.06.18 конец
	
	
	Если ВидОснования="ПриходнаяНакладная" И НЕ ПолучитьПолномочиеПользователя("ВидимостьПриходныхЦен") Тогда
		ОбнулитьЦены=Истина;	
	Иначе
		ОбнулитьЦены=Ложь;	
	КонецЕсли;
	
	//Комментарий=Комментарий+ДокОснование.Метаданные()+" № " + ДокОснование.Номер + " от " + Формат(ДокОснование.Дата,"ДФ=dd.MM.yy");
	//Кухарь 04.03.19 начало
	//Теперь есть коррекции на основании ЗТО	
	если ВидОснования<>"ЗаявкаВТранспортныйОтдел" тогда
		//Кухарь 04.03.19 конец		
		Для Каждого исхСтрокаТЧ Из ДокОснование.Товары Цикл
			
			СтрокаТЧ = Товары.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,исхСтрокаТЧ);
			
		КонецЦикла;	
		//Кухарь 04.03.19 начало
		//Теперь есть коррекции на основании ЗТО
	КонецЕсли;
	//Кухарь 04.03.19 конец		
	
	//крохин начало
	ГруппыТоваров	=ГруппыТоваровДокумента(ЭтотОбъект);
	Если Дата >= '20101001' Тогда
		СекторХранения = СекторХраненияДокумента(ЭтотОбъект);
	КонецЕсли;
	//крохин конец
	
	//крохин начало 06.09.2012
	//фиксация реквизитов
	ЗаполнитьЗначенияСвойств(Ссылка,ДокОснование);
	ДатаОтгрузки  = ДокОснование.датаОтгрузки;
	//Катаев+ 21/07/14
	Если ТипЗнч(ДокОснование.Ссылка) <> Тип("ДокументСсылка.Перемещение") Тогда
		//Кухарь 04.03.19 начало
		//Теперь есть коррекции на основании ЗТО
		//  НомерЗаказа = ДокОснование.НомерЗаказа;
		//ДатаЗаказа  = ДокОснование.ДатаЗаказа;
		//ДатаОплаты  = ДокОснование.ДатаОплаты;
		//СостояниеНакладной = ДокОснование.СостояниеНакладной;
		//ДатаДоИзменения = ДокОснование.дата;
		//ДатаПослеИзменения = ДокОснование.дата;
		//Подразделение = ДокОснование.Подразделение;
		//ТранспортнаяКомпания =ДокОснование.ТранспортнаяКомпания; 
		//ТранспортнаяКомпанияДоИзменения =ДокОснование.ТранспортнаяКомпания; 
		//ПунктПерегруза = ДокОснование.ПунктПерегруза;
		//ПунктПерегрузаДоИзменения = ДокОснование.ПунктПерегруза;
		//ПодразделениеДоИзменения = ДокОснование.Подразделение;
		//ТипДоставкиДоИзменения=ДокОснование.типдоставки;
		//ТипДоставки=ТипДоставки;
		//ВидОплатыДоИзменения=ДокОснование.ВидОплаты;
		//Комментарий = ДокОснование.Комментарий;		
		НомерЗаказа = ПолучитьРеквизитОбъекта(ДокОснование,"НомерЗаказа");
		ДатаЗаказа  = ПолучитьРеквизитОбъекта(ДокОснование,"ДатаЗаказа");
		ДатаОплаты  = ПолучитьРеквизитОбъекта(ДокОснование,"ДатаОплаты");
		СостояниеНакладной = ПолучитьРеквизитОбъекта(ДокОснование,"СостояниеНакладной");
		Подразделение = ПолучитьРеквизитОбъекта(ДокОснование,"Подразделение");
		ПодразделениеДоИзменения =ПолучитьРеквизитОбъекта(ДокОснование,"Подразделение");		
		ТранспортнаяКомпания =ПолучитьРеквизитОбъекта(ДокОснование,"ТранспортнаяКомпания");
		ТранспортнаяКомпанияДоИзменения =ПолучитьРеквизитОбъекта(ДокОснование,"ТранспортнаяКомпания");
		ПунктПерегруза = ПолучитьРеквизитОбъекта(ДокОснование,"ПунктПерегруза");
		ПунктПерегрузаДоИзменения = ПолучитьРеквизитОбъекта(ДокОснование,"ПунктПерегруза");
		ТипДоставкиДоИзменения=ПолучитьРеквизитОбъекта(ДокОснование,"ТипДоставки");
		ТипДоставки=ПолучитьРеквизитОбъекта(ДокОснование,"ТипДоставки");
		ВидОплатыДоИзменения=ПолучитьРеквизитОбъекта(ДокОснование,"ВидОплаты");
		ВидОплаты=ПолучитьРеквизитОбъекта(ДокОснование,"ВидОплаты");
		Комментарий = ПолучитьРеквизитОбъекта(ДокОснование,"Комментарий");
		ДатаДоИзменения = ДокОснование.дата;
		ДатаПослеИзменения = ДокОснование.дата;
		
		если ВидОснования="ЗаявкаВТранспортныйОтдел" тогда
			Отправитель=ПолучитьРеквизитОбъекта(ДокОснование,"Отправитель");
			ОтправительДоИзменения=ПолучитьРеквизитОбъекта(ДокОснование,"Отправитель");		
			ПунктДоставкиОтправитель=ПолучитьРеквизитОбъекта(ДокОснование,"ПунктДоставкиОтправитель");
			ПунктДоставкиОтправительДоИзменения=ПолучитьРеквизитОбъекта(ДокОснование,"ПунктДоставкиОтправитель");		
			ПунктПерегрузаОтправитель=ПолучитьРеквизитОбъекта(ДокОснование,"ПунктПерегрузаОтправитель");
			ПунктПерегрузаОтправительДоИзменения=ПолучитьРеквизитОбъекта(ДокОснование,"ПунктПерегрузаОтправитель");		
			ТранспортнаяКомпанияОтправитель=ПолучитьРеквизитОбъекта(ДокОснование,"ТранспортнаяКомпанияОтправитель");
			ТранспортнаяКомпанияОтправительДоИзменения=ПолучитьРеквизитОбъекта(ДокОснование,"ТранспортнаяКомпанияОтправитель");	
			
			Получатель=ПолучитьРеквизитОбъекта(ДокОснование,"Получатель");
			ПолучательДоИзменения=ПолучитьРеквизитОбъекта(ДокОснование,"Получатель");
			ПунктДоставкиПолучатель=ПолучитьРеквизитОбъекта(ДокОснование,"ПунктДоставкиПолучатель");
			ПунктДоставкиПолучательДоИзменения=ПолучитьРеквизитОбъекта(ДокОснование,"ПунктДоставкиПолучатель");
			ПунктПерегрузаПолучатель=ПолучитьРеквизитОбъекта(ДокОснование,"ПунктПерегрузаПолучатель");
			ПунктПерегрузаПолучательДоИзменения=ПолучитьРеквизитОбъекта(ДокОснование,"ПунктПерегрузаПолучатель");	
			ТранспортнаяКомпанияПолучатель=ПолучитьРеквизитОбъекта(ДокОснование,"ТранспортнаяКомпанияПолучатель");
			ТранспортнаяКомпанияПолучательДоИзменения=ПолучитьРеквизитОбъекта(ДокОснование,"ТранспортнаяКомпанияПолучатель");	
			
			
			Содержание=ПолучитьРеквизитОбъекта(ДокОснование,"Содержание");
			СодержаниеДоИзменения=ПолучитьРеквизитОбъекта(ДокОснование,"Содержание");
			ОбъемКоробов=ПолучитьРеквизитОбъекта(ДокОснование,"ОбъемКоробов");
			ОбъемКоробовДоИзменения=ПолучитьРеквизитОбъекта(ДокОснование,"ОбъемКоробов");	
			КоличествоКоробок=ПолучитьРеквизитОбъекта(ДокОснование,"КоличествоКоробок");
			КоличествоКоробокДоИзменения=ПолучитьРеквизитОбъекта(ДокОснование,"КоличествоКоробок");		
			КоличествоДокумента=ПолучитьРеквизитОбъекта(ДокОснование,"КоличествоДокумента");
			КоличествоДокументаДоИзменения=ПолучитьРеквизитОбъекта(ДокОснование,"КоличествоДокумента");
			ДатаПриемкиДоИзменения= ОпределитьДатуАвизацииДокумента(ДокОснование);
			
		КонецЕсли;
		
		
		//Кухарь 04.03.19 конец			
		
		
		// Катаев+ 21/07/14
		Если ТипЗнч(ДокОснование.Ссылка) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
			Отгружен = ДокОснование.Отгружен;
			ТипЦенРаспродажа = ДокОснование.ТипЦенРаспродажа;
			//Кухарь 19.10.16 начало
			ДатаПриемкиДоИзменения= ОпределитьДатуАвизацииДокумента(ДокОснование);
			//Кухарь 19.10.16 конец
			
			//Кухарь 05.02.18 начало
			//ещё 2 поля для РНК
			АдресПерегруза=ДокОснование.АдресПерегруза;
			ВремяПерегруза=ДокОснование.ВремяПерегруза;
			АдресПерегрузаДоИзменения=АдресПерегруза;
			ВремяПерегрузаДоИзменения=ВремяПерегруза;
			//Кухарь 05.02.18 конец
			
			
		КонецЕсли;
		
		
		ДатаОтгрузкиДоИзменения = ДатаОтгрузки;  
		ОрганизацияДоИзменения = Организация;
		КонтрагентДоИзменения = Контрагент;
		ДоговорДоИзменения = Договор;
		ДатаОплатыДоИзменения = ДатаОплаты;
		СостояниеНакладнойДоИзменения = СостояниеНакладной;
		ОтсрочкаПлатежаДоИзменения = ОтсрочкаПлатежа;
		ПунктДоставкиДоИзменения = ПунктДоставки;
		ОтгруженДоИзменения = Отгружен;
		МенеджерДоИзменения = Менеджер;
		КомментарийДоИзменения = Комментарий;
		НомерЗаказаДоИзменения = НомерЗаказа;
		ДатаЗаказаДоИзменения = ДатаЗаказа;
		ПодразделениеДоИзменения = Подразделение;
		СкидкаДоИзменения = Скидка;
		
		
	Иначе
		Комментарий = ДокОснование.Комментарий;
		КомментарийДоИзменения = Комментарий;
		КонтрагентДоИзменения = Контрагент;
		СкидкаДоИзменения = Скидка;
		ПунктДоставкиДоИзменения = ПунктДоставки;
		ДатаОтгрузкиДоИзменения = ДатаОтгрузки;
		ОрганизацияДоИзменения = Организация;
		МенеджерДоИзменения = Менеджер;
		СостояниеНакладнойУПолучателя = ДокОснование.СостояниеНакладнойУПолучателя;
		СостояниеНакладнойУПолучателяДоИзменения = СостояниеНакладнойУПолучателя;
		//Кухарь 15.02.18 начало
		//исправление ошибки
		СостояниеНакладной=ДокОснование.состояниенакладной;
		СостояниеНакладнойДоИзменения = СостояниеНакладной;
		//Кухарь 15.02.18 конец
		//Кухарь 25.06.18 начало	
		//ещё 1 реквизит меняется коррекцией
		ТипДоставкиДоИзменения=ДокОснование.типдоставки;
		ТипДоставки=ТипДоставки;
		//Кухарь 25.06.18 конец		
	КонецЕсли;
	//Катаев- 21/07/14
	//Катаев+ 22/07/14 Новые реквизиты для коррекции
	Если ТипЗнч(ДокОснование.Ссылка) = Тип("ДокументСсылка.Перемещение") Тогда
		СкладПолучатель = ДокОснование.СкладПолучатель;
		ДатаПриемки = ДокОснование.ДатаПриемки;
		СостояниеНакладнойУПолучателя = ДокОснование.СостояниеНакладнойУПолучателя;
		СкладПолучательДоИзменения = СкладПолучатель;
		ДатаПриемкиДоИзменения = ДатаПриемки;
		СостояниеНакладнойУПолучателяДоИзменения = СостояниеНакладнойУПолучателя;
	ИначеЕсли ТипЗнч(ДокОснование.Ссылка) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		ГТ = ДокОснование.ГТ;
		ГТД = ДокОснование.ГТД;
		БухгалтерскаяКоррекция = ДокОснование.БухгалтерскаяКоррекция;
		Партия = ДокОснование.Партия;
		НомерТОРГ12Входящий = ДокОснование.НомерТОРГ12Входящий;
		НомерСФВходящий = ДокОснование.НомерСФВходящий;
		ДатаВходящихДокументов = ДокОснование.ДатаВходящихДокументов;
		ГТДоИзменения = ГТ;
		ГТДДоИзменения = ГТД;
		БухгалтерскаяКоррекцияДоИзменения = БухгалтерскаяКоррекция;
		ПартияДоИзменения = Партия;
		НомерТОРГ12ВходящийДоИзменения = НомерТОРГ12Входящий;
		НомерСФВходящийДоИзменения = НомерСФВходящий;
		ДатаВходящихДокументовДоИзменения = ДатаВходящихДокументов;
	КонецЕсли;
	//Катаев- 22/07/14
	
	//Кухарь 04.03.19 начало
	//Теперь есть коррекции на основании ЗТО	
	если ВидОснования<>"ЗаявкаВТранспортныйОтдел" тогда
		//Кухарь 04.03.19 конец			
		Для Каждого исхСтрокаТЧ Из ДокОснование.Товары Цикл
			СтрокаТЧ = ТоварыДоИзменения.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,исхСтрокаТЧ);
			
		КонецЦикла;
		//крохин конец 06.09.2012
		//Кухарь 04.03.19 начало
		//Теперь есть коррекции на основании ЗТО	
	КонецЕсли;
	//Кухарь 04.03.19 конец			
	//Кухарь 27.03.19 начало
	дата=ТекущаяДата();
	//Кухарь 27.03.19 конец
	
	//Кухарь 25.02.20 начало	
	//У коррекции к ПРМ кривой номер
	Если Лев(Номер, 10) <> Лев(ДокОснование.Номер, 10) Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	КоррекцияРНК.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.КоррекцияРНК КАК КоррекцияРНК
		               |ГДЕ
		               |	КоррекцияРНК.ДокОснование = &ДокОснование";
		
		Запрос.УстановитьПараметр("ДокОснование", ДокОснование);	
		
		// Кельманов А.В. - HELP-2879 - 2025.02.14 {
		//Номер = ДокОснование.Номер + "/" + Формат((Запрос.Выполнить().Выбрать().Количество() + 1), "ЧЦ=2; ЧДЦ=0; ЧВН=");
		КоличествоКоррекцийДокОснование = Запрос.Выполнить().Выбрать().Количество();
		
		Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.Перемещение") Тогда
			
			Номер = ДокОснование.Номер + "\" + Формат((КоличествоКоррекцийДокОснование + 1), "ЧЦ=2; ЧДЦ=0; ЧВН=");
			
		Иначе
			
			Номер = ДокОснование.Номер + "/" + Формат((КоличествоКоррекцийДокОснование + 1), "ЧЦ=2; ЧДЦ=0; ЧВН=");
			
		КонецЕсли;
		// Кельманов А.В. - HELP-2879 - 2025.02.14 }
		
	КонецЕсли;
	//Кухарь 25.02.20  конец

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)	
	Организация			=Неопределено;
	СостояниеНакладной	=Неопределено;
	Отгружен			=Неопределено;
	СостояниеДокументов	=Неопределено;	
	
	ДатаОтгрузки		=Неопределено;
	//Кухарь 19.10.16 начало
	ДатаПриемки			=Неопределено;
	//Кухарь 19.10.16 конец
	ДатаОплаты			=Неопределено;
	ДатаВыгрузки		=Неопределено;
	ДатаОформления		=Неопределено;
	
	Автор				=Неопределено;
	
	Если Менеджер.Пустая() Тогда
		Менеджер=?(ПунктДоставки.Менеджер.Пустая(),Контрагент.Менеджер,ПунктДоставки.Менеджер);
		
	КонецЕсли;
	//крохин начало	
	//++Данилова Е.В. 29.09.2025 HELP-7048
	//Подразделение = Менеджер.Подразделение; 
	Подразделение = ЗаполнениеДокументов.ПодразделениеПродажПоМенеджеру(Менеджер);
	//--Данилова Е.В. 29.09.2025
	Если Подразделение = Справочники.Подразделения.ПустаяСсылка() Тогда
		Подразделение = Склад.Подразделение;
	КонецЕсли;
	//крохин конец
	
	Если Договор.Пустая() Или Договор.НеИспользовать Тогда
		Договор=Контрагент.ОсновнойДоговор;			
	КонецЕсли; 
	//крохин начало
	//только предоплата
	Если Контрагент.Ведущий.ТолькоПредоплата Тогда
		ОтсрочкаПлатежа = Справочники.ОтсрочкиПлатежа.НайтиПоКоду("1");	
	КонецЕсли;
	//крохин конец
КонецПроцедуры


Функция НакладнаяОтгружена() Экспорт
	
	Возврат (СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена)
	Или (СостояниеНакладной = Перечисления.СостоянияНакладной.ОтгруженаНаТранзитныйСклад);
	
КонецФункции


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//крохин начало 10.12.2012
	//теперь- в перед записью меняется РНК
	//НакладнаяОбъект = ДокОснование.ПолучитьОбъект();
	//НакладнаяОбъект.УстановитьСостояниеКоррекции(СостояниеКоррекции);
	//крохин конец 10.12.2012
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
КонецПроцедуры

Функция ЕстьИзмененияТЧТовары()
	//Кухарь 04.03.19 начало
	//Коррекции на основании ЗТО
	если ДокОснование.Метаданные().Имя="ЗаявкаВТранспортныйОтдел" тогда
		возврат 3;
	КонецЕсли;
	//Кухарь 04.03.19 конец	
	
	ТЧ = Новый ТаблицаЗначений;
	ТЧ.Колонки.Добавить("НомерСтроки");
	ТЧ.Колонки.Добавить("Номенклатура");
	ТЧ.Колонки.Добавить("Количество");
	ТЧ.Колонки.Добавить("КоличествоИсх");
	ТЧ.Колонки.Добавить("КоличествоВДокументе");
	ТЧ.Колонки.Добавить("Всего");
	ТЧ.Колонки.Добавить("ВсегоИсх");
	ТЧ.Колонки.Добавить("ВсегоВДокументе");
	Для Каждого СтрокаТЗ ИЗ Товары Цикл
		СтрокаТЧ = ТЧ.Добавить();
		СтрокаТЧ.НомерСтроки = СтрокаТЗ.НомерСтроки;
		СтрокаТЧ.Номенклатура = СтрокаТЗ.Номенклатура;
		СтрокаТЧ.Количество = СтрокаТЗ.Количество;
		СтрокаТЧ.КоличествоИсх = 0;
		СтрокаТЧ.КоличествоВДокументе = 0;
		СтрокаТЧ.Всего = СтрокаТЗ.Всего;
		СтрокаТЧ.ВсегоИсх = 0;
		СтрокаТЧ.ВсегоВДокументе = 0;
	КонецЦикла;
	
	Для Каждого СтрокаТЗ ИЗ ТоварыДоИзменения Цикл
		СтрокаТЧ = ТЧ.Добавить();
		СтрокаТЧ.НомерСтроки = СтрокаТЗ.НомерСтроки;
		СтрокаТЧ.Номенклатура = СтрокаТЗ.Номенклатура;
		СтрокаТЧ.Количество = 0;
		СтрокаТЧ.КоличествоИсх = СтрокаТЗ.Количество;
		СтрокаТЧ.КоличествоВДокументе = 0;
		СтрокаТЧ.Всего = 0;
		СтрокаТЧ.ВсегоИсх = СтрокаТЗ.Всего;
		СтрокаТЧ.ВсегоВДокументе = 0;
	КонецЦикла;
	
	Для Каждого СтрокаТЗ ИЗ ДокОснование.Товары Цикл
		СтрокаТЧ = ТЧ.Добавить();
		СтрокаТЧ.НомерСтроки = СтрокаТЗ.НомерСтроки;
		СтрокаТЧ.Номенклатура = СтрокаТЗ.Номенклатура;
		СтрокаТЧ.Количество = 0;
		СтрокаТЧ.КоличествоИсх = 0;
		СтрокаТЧ.КоличествоВДокументе = СтрокаТЗ.Количество;
		СтрокаТЧ.Всего = 0;
		СтрокаТЧ.ВсегоИсх = 0;
		СтрокаТЧ.ВсегоВДокументе = СтрокаТЗ.Всего;
	КонецЦикла;
	
	ТЧ.Свернуть("НомерСтроки,Номенклатура","Количество,КоличествоИсх,КоличествоВДокументе,Всего,ВсегоИсх,ВсегоВДокументе");
	ТЧ.Сортировать("НомерСтроки");
	//ТаблицаТоваров.Колонки.Добавить("НомерСтроки");
	//ТаблицаТоваров.Колонки.Добавить("Номенклатура");
	//ТаблицаТоваров.Колонки.Добавить("Количество");
	//ТаблицаТоваров.Колонки.Добавить("КоличествоИсх");
	//ТаблицаТоваров.Колонки.Добавить("КоличествоВДокументе");
	//ТаблицаТоваров.Колонки.Добавить("Всего");
	//ТаблицаТоваров.Колонки.Добавить("ВсегоИсх");
	//ТаблицаТоваров.Колонки.Добавить("ВсегоВДокументе");
	ЕстьИзменения = Ложь;
	ЕстьНепринятыеИзменения = Ложь;
	Для Каждого СтрокаТЧ ИЗ ТЧ Цикл
		Если СтрокаТЧ.Количество <> СтрокаТЧ.количествоИсх ИЛИ СтрокаТЧ.Всего <> СтрокаТЧ.ВсегоИсх Тогда
			ЕстьИзменения = Истина;	
		КонецЕсли;
		Если СтрокаТЧ.Количество <> СтрокаТЧ.КоличествоВДокументе ИЛИ СтрокаТЧ.Всего <> СтрокаТЧ.ВсегоВДокументе Тогда
			ЕстьНепринятыеИзменения = Истина;	
		КонецЕсли;
		
	КонецЦикла;
	Если ЕстьИзменения Тогда
		ЕСЛИ ЕстьНепринятыеИзменения Тогда
			Возврат 2;
		Иначе
			Возврат 1;
		КонецЕсли;
	Иначе
		Возврат 3;
	КонецЕсли;
	
КонецФункции


//кухарь удаление СФ и перенос в ЗОГ 09.09.13 начало 

Процедура ИзменениеЗоГиСФ(ИзмДок) Экспорт 
	//Катаев+ 20/08/14 По СФ только для РНК
	Если ТипЗнч(ИзмДок) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		запросСФ=новый Запрос;
		запросСФ.Текст="ВЫБРАТЬ
		|	СчетФактураНакладные.Ссылка как СФ
		|ИЗ
		|	Документ.СчетФактура.Накладные КАК СчетФактураНакладные
		|ГДЕ
		|	СчетФактураНакладные.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
		|	И СчетФактураНакладные.Ссылка.Проведен = Истина
		|	И СчетФактураНакладные.Накладная = &Накладная";
		запросСФ.УстановитьПараметр("Дата1",НачалоДня(ДатаОтгрузкиДоИзменения));
		запросСФ.УстановитьПараметр("Дата2",КонецДня(ДатаОтгрузкиДоИзменения));
		запросСФ.УстановитьПараметр("Накладная",ИзмДок);
		результатСФ=запросСФ.Выполнить().Выгрузить();
		Для каждого стСФ из результатСФ цикл
			СФ=стСФ.сф.получитьобъект();
			//сф=документы.СчетФактура.НайтиПоНомеру().ПолучитьОбъект();
			сф.Проведен=ложь;
			сф.ПометкаУдаления=Истина;
			сф.записать();
			Сообщить("Счёт-фактура: "+сф.номер+" помечена на удаление");
		КонецЦикла;
		
		//кухарь 28.10.2013 начало 
		ДокОснование.получитьобъект().УстановитьСостояниеДокументов(Перечисления.СостояниеДокументов.НеВыписаны);
		//кухарь 28.10.2013 конец
	КонецЕсли;
	//Катаев- 20/08/14
	
	//кухарь 04.12.13 начало
	//ставим не отгружать
	если КонецДня(ДатаОтгрузкиДоИзменения)>КонецДня(ТекущаяДата()) тогда
		ЗапросЗОГ=новый запрос;
		ЗапросЗОГ.Текст= "ВЫБРАТЬ
		|	ЗаявкаНаОтгрузкуНакладные.Ссылка как ЗОГ,
		|	ЗаявкаНаОтгрузкуНакладные.НомерСтроки как НомерСтроки
		|ИЗ
		|	Документ.ЗаявкаНаОтгрузку.Накладные КАК ЗаявкаНаОтгрузкуНакладные
		|ГДЕ
		|	ЗаявкаНаОтгрузкуНакладные.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
		|	И ЗаявкаНаОтгрузкуНакладные.Накладная = &Накладная
		|	И ЗаявкаНаОтгрузкуНакладные.Ссылка.Проведен = Истина";
		запросЗОГ.УстановитьПараметр("Дата1",НачалоДня(ДатаОтгрузкиДоИзменения));
		запросЗОГ.УстановитьПараметр("Дата2",КонецДня(ДатаОтгрузкиДоИзменения));
		запросЗОГ.УстановитьПараметр("Накладная",ИзмДок);
		
		результатЗОГ=ЗапросЗОГ.Выполнить().Выгрузить();
		для каждого текЗог из результатЗОГ цикл
			ЗОГ=текЗог.зог.получитьобъект();
			зог.накладные.получить(текЗог.НомерСтроки-1).НеОтгружать=истина;
			//Кухарь 12.01.19 начало
			//ЗОГ.записать();
			ЗОГ.ЗаписьБезКонтроляПолномочий();
			//Кухарь 12.01.19 конец
		КонецЦикла;
	КонецЕсли;
	//кухарь 04.12.13 конец
	
	
	запросНовыйЗог=новый запрос;
	запросНовыйЗог.Текст="ВЫБРАТЬ
	|	ЗаявкаНаОтгрузку.Ссылка как ЗОГ
	|ИЗ
	|	Документ.ЗаявкаНаОтгрузку КАК ЗаявкаНаОтгрузку
	|ГДЕ
	|	ЗаявкаНаОтгрузку.Проведен = истина
	|	И ЗаявкаНаОтгрузку.ДатаОтгрузки = &ДатаОтгрузки
	|	И ЗаявкаНаОтгрузку.Склад = &Склад";
	запросНовыйЗог.УстановитьПараметр("ДатаОтгрузки",ДатаОтгрузки);
	запросНовыйЗог.УстановитьПараметр("Склад",Склад);
	результНовыйЗог=запросНовыйЗог.Выполнить().Выгрузить();
	если результНовыйЗог.Количество()=1 тогда
		ЗОГ=результНовыйЗог.Получить(0).зог.получитьобъект();
		если ЗОГ.накладные.найти(ИзмДок.номер)=Неопределено тогда
			
			НВЗ=ЗОГ.накладные.добавить();
			//НВЗ.накладная=ИзмДок;
			ЗОГ.ЗаполнитьСтрокуПоНакладной(НВЗ,ИзмДок);
			НВЗ.неотгружать=ложь;
			//Кухарь 12.01.19 начало
			//ЗОГ.записать();
			ЗОГ.ЗаписьБезКонтроляПолномочий();
			//Кухарь 12.01.19 конец
			
		иначе
			ЗОГ.накладные.найти(ИзмДок.номер).неотгружать=ложь;
			Сообщить(ЗОГ.номер+ " уже содержит данную накладную");
			//Кухарь 12.01.19 начало
			//ЗОГ.записать();
			ЗОГ.ЗаписьБезКонтроляПолномочий();
			//Кухарь 12.01.19 конец
			
		КонецЕсли;
	ИначеЕсли результНовыйЗог.Количество()>1 тогда
		Сообщить("Имеется несколько заявок на отгрузку на этот день, обратитесь в техподдержку");
	Иначе
		Сообщить("ЗОГ не сформирован, накладная не добавлена, проконтролируйте добавление накладной в ЗОГ после его формирования");
	КонецЕсли;
	
	//Документы.ЗаявкаВТранспортныйОтдел.НайтиПоРеквизиту("Номер","SEM-00021");
	
КонецПроцедуры
//кухарь удаление СФ и перенос в ЗОГ 09.09.13 конец 




//Кухарь 07.12.18 начало

Функция ПолучитьПризнакПропускаемогоВКоррекцииРеквизита (ИмяРеквизита) экспорт
	
	//Кухарь 07.08.19 начало
	//Коррекции к ЗТО
	если ДокОснование.Метаданные().Имя="ЗаявкаВТранспортныйОтдел" тогда
		если ИмяРеквизита<>"Отправитель" и
			ИмяРеквизита<>"ПунктДоставкиОтправитель" и
			ИмяРеквизита<>"ТранспортнаяКомпанияОтправитель" и
			ИмяРеквизита<>"ПунктПерегрузаОтправитель" и
			ИмяРеквизита<>"ПунктДоставкиПолучатель" и
			ИмяРеквизита<>"ТранспортнаяКомпанияПолучатель" и
			ИмяРеквизита<>"Подразделение" и
			ИмяРеквизита<>"Менеджер" и
			ИмяРеквизита<>"ДатаПриемки" и
			ИмяРеквизита<>"ОбъемКоробов" и
			ИмяРеквизита<>"КоличествоКоробок" и
			ИмяРеквизита<>"КоличествоДокумента" и
			ИмяРеквизита<>"Содержание" и
			ИмяРеквизита<>"ДатаОтгрузки" тогда
			Возврат Истина
		иначе
			возврат ложь;
		КонецЕсли;
	КонецЕсли;
	//Кухарь 07.08.19 конец	
	
	//Кухарь 25.04.19 начало
	если ДокОснование.Метаданные().Имя="Перемещение" и не ЕстьРеквизитДокумента(ИмяРеквизита,ДокОснование.Метаданные()) тогда
		Возврат Истина;
	КонецЕсли;
	//Кухарь 25.04.19 конец
	
	
	если ИмяРеквизита="Автор" или
		ИмяРеквизита="Валюта" или
		ИмяРеквизита="ДатаОформления" или
		ИмяРеквизита="ИБ" или
		ИмяРеквизита="Курс" или
		//ИмяРеквизита="Организация" или
		ИмяРеквизита="Склад" или
		//ИмяРеквизита="ТипЦен" или
		ИмяРеквизита="СостояниеНакладной" или
		//ИмяРеквизита="Скидка" или
		ИмяРеквизита="БанковскийСчет" или
		ИмяРеквизита="Отгружен" или
		ИмяРеквизита="ГруппыТоваров" или
		//ИмяРеквизита="ТипСкидок" или
		ИмяРеквизита="ДокОснование" или
		ИмяРеквизита="КоличествоДокумента" или	
		ИмяРеквизита="Регион" или	
		ИмяРеквизита="ОбъемКоробов" или
		//ИмяРеквизита="ТипЦенРаспродажа" или
		ИмяРеквизита="РайонДоставки" или
		ИмяРеквизита="КоличествоКоробок" или
		ИмяРеквизита="ДопСкидкаНаНакладную" или
		ИмяРеквизита="КодОперации" или
		ИмяРеквизита="неКонтролироватьДублиСтрок" или
		ИмяРеквизита="НулеваяСтавкаНДС" или
		ИмяРеквизита="Согласована" или
		ИмяРеквизита="Отработана" или
		ИмяРеквизита="СостояниеКоррекции" или
		ИмяРеквизита="Утвердил" или
		ИмяРеквизита="Отработал" или
		ИмяРеквизита="СтрокаИзменений" или
		ИмяРеквизита="ГТ" или
		ИмяРеквизита="ГТД" или
		ИмяРеквизита="БухгалтерскаяКоррекция" или
		ИмяРеквизита="Партия" или
		ИмяРеквизита="НомерТОРГ12Входящий" или
		//Кухарь 18.02.19 начало
		ИмяРеквизита="ТипЦен" или
		//Кухарь 18.02.19 конец	
		ИмяРеквизита="НомерСФВходящий" или
		ИмяРеквизита="ДатаВходящихДокументов" тогда
		
		возврат Истина;
	иначе
		возврат ложь;
	КонецЕсли;
КонецФункции


Функция ПолучитьРаспределениеРеквизитовПоПолномочиям() Экспорт
	
	ТипДокумента=ДокОснование.Метаданные().Имя;	
	Если ТипДокумента="РасходнаяНакладная" или ТипДокумента="Перемещение" тогда
		СостояниеДокумента=ДокОснование.Отгружен;	
	иначе
		СостояниеДокумента=Перечисления.Отгружен.Резерв;
	КонецЕсли;
	
	ТЗРаспределения = Новый ТаблицаЗначений;
	ТЗРаспределения.Колонки.Добавить("ИмяРеквизита");
	ТЗРаспределения.Колонки.Добавить("ЦО");
	ТЗРаспределения.Колонки.Добавить("СК");
	ТЗРаспределения.Колонки.Добавить("ОВЛ");
	ТЗРаспределения.Колонки.Добавить("ПРО");
	
	для каждого ТекРеквизит из  Метаданные().Реквизиты цикл
		если ПолучитьПризнакПропускаемогоВКоррекцииРеквизита(ТекРеквизит.Имя) тогда
			Продолжить;
		КонецЕсли;		
		ИмяИзменяемогоРеквизит=Метаданные().Реквизиты.Найти(ТекРеквизит.Имя+"ДоИзменения");	
		если ИмяИзменяемогоРеквизит=Неопределено тогда Продолжить;КонецЕсли;
		ЗначениеИзменяемогоРеквизита=ЭтотОбъект[ИмяИзменяемогоРеквизит.имя];
		ЗначениеТекущегоРеквизита=ЭтотОбъект[ТекРеквизит.имя];
		
		если ЗначениеИзменяемогоРеквизита=ЗначениеТекущегоРеквизита тогда Продолжить;КонецЕсли;
		
		СтрТЧ=ТЗРаспределения.Добавить();
		СтрТЧ.ЦО=ложь;
		СтрТЧ.СК=ложь;
		СтрТЧ.ОВЛ=ложь;
		СтрТЧ.ПРО=ложь;	
		
		ИмяРеквизита=ТекРеквизит.имя;
		СтрТЧ.ИмяРеквизита=ИмяРеквизита;
		
		Если СостояниеДокумента = Перечисления.Отгружен.Отгружен Тогда
			
			Если ТипДокумента="РасходнаяНакладная" тогда  //////////////////////////////////////Отгруженные РНК начало
				если ИмяРеквизита="ДатаПриемки" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="ДатаЗаказа" тогда	
				ИначеЕсли ИмяРеквизита="ДатаОплаты" тогда
					СтрТЧ.ЦО=истина;
				ИначеЕсли ИмяРеквизита="ДатаОтгрузки" тогда
					//// Здесь так и должно быть? Ничего не происходит?????
				ИначеЕсли ИмяРеквизита="Договор" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ПРО=Истина;
				ИначеЕсли ИмяРеквизита="Комментарий" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=истина;
				ИначеЕсли ИмяРеквизита="Менеджер" тогда	
					СтрТЧ.ЦО=истина;
				ИначеЕсли ИмяРеквизита="НомерЗаказа" тогда
				ИначеЕсли ИмяРеквизита="Организация" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ПРО=Истина;
				ИначеЕсли ИмяРеквизита="ОтсрочкаПлатежа" тогда	
					СтрТЧ.ЦО=истина;
					//Кухарь 14.01.18 начало
					//Согласование ПРО тут не нужно
					//СтрТЧ.ПРО=Истина;
					//Кухарь 14.01.18 конец
				ИначеЕсли ИмяРеквизита="Подразделение" тогда	
					СтрТЧ.ЦО=истина;
				ИначеЕсли ИмяРеквизита="Контрагент" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ПРО=Истина;
				ИначеЕсли ИмяРеквизита="ПунктДоставки" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=истина;
					СтрТЧ.ПРО=Истина;
				ИначеЕсли ИмяРеквизита="ПунктПерегруза" тогда
					// Кухарь А.Ю. 17.02.2020 начало
					//  СтрТЧ.ЦО=истина;				
					если не ПунктДоставки.ДоставкаЗаНашСчет тогда
						СтрТЧ.ЦО=истина;
					КонецЕсли;
					// Кухарь А.Ю. 17.02.2020 конец
					СтрТЧ.ОВЛ=истина;
					//Кухарь 14.01.18 начало
					//Согласование ПРО тут не нужно
					//СтрТЧ.ПРО=Истина;
					//Кухарь 14.01.18 конец
					
				ИначеЕсли ИмяРеквизита="СуммаДокумента" тогда	
				ИначеЕсли ИмяРеквизита="ТранспортнаяКомпания" тогда
					// Кухарь А.Ю. 17.02.2020 начало
					//  СтрТЧ.ЦО=истина;				
					если не ПунктДоставки.ДоставкаЗаНашСчет тогда
						СтрТЧ.ЦО=истина;
					КонецЕсли;
					// Кухарь А.Ю. 17.02.2020 конец
					
					СтрТЧ.ОВЛ=истина;
				ИначеЕсли ИмяРеквизита="ТипДоставки" тогда	
					// Кухарь А.Ю. 17.02.2020 начало
					//  СтрТЧ.ЦО=истина;				
					если не ПунктДоставки.ДоставкаЗаНашСчет тогда
						СтрТЧ.ЦО=истина;
					КонецЕсли;
					// Кухарь А.Ю. 17.02.2020 конец
					
					СтрТЧ.ОВЛ=истина;
				ИначеЕсли ИмяРеквизита="АдресПерегруза" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=истина;
				ИначеЕсли ИмяРеквизита="ВремяПерегруза" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=истина;
					//крохин начало 17.01.2020
					//вид оплаты
				ИначеЕсли ИмяРеквизита="ВидОплаты" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ПРО=истина;
					//крохин конец 17.01.2020				
				КонецЕсли;	                                       
				//////////////////////////////////////Отгруженные РНК конец
				
			ИначеЕсли ТипДокумента="Перемещение" тогда                 //////////////////////////////////////Отгруженные ПРМ Начало
				
				Если ИмяРеквизита="ДатаПриемки" тогда
				ИначеЕсли ИмяРеквизита="ДатаЗаказа" тогда	
				ИначеЕсли ИмяРеквизита="ДатаОплаты" тогда
				ИначеЕсли ИмяРеквизита="ДатаОтгрузки" тогда							
				ИначеЕсли ИмяРеквизита="Договор" тогда	
				ИначеЕсли ИмяРеквизита="Комментарий" тогда
					СтрТЧ.ЦО=истина;				
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="Менеджер" тогда	
					СтрТЧ.ЦО=истина;
				ИначеЕсли ИмяРеквизита="НомерЗаказа" тогда
				ИначеЕсли ИмяРеквизита="Организация" тогда
					СтрТЧ.ЦО=истина;				
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="ОтсрочкаПлатежа" тогда	
				ИначеЕсли ИмяРеквизита="Подразделение" тогда	
				ИначеЕсли ИмяРеквизита="Контрагент" тогда
				ИначеЕсли ИмяРеквизита="ПунктДоставки" тогда			
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="ПунктПерегруза" тогда
					// Кухарь А.Ю. 17.02.2020 начало
					//  СтрТЧ.ЦО=истина;				
					если не ПунктДоставки.ДоставкаЗаНашСчет тогда
						СтрТЧ.ЦО=истина;
					КонецЕсли;
					// Кухарь А.Ю. 17.02.2020 конец
					
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="СуммаДокумента" тогда	
				ИначеЕсли ИмяРеквизита="ТранспортнаяКомпания" тогда
					СтрТЧ.ОВЛ=истина;
				ИначеЕсли ИмяРеквизита="ТипДоставки" тогда	
					// Кухарь А.Ю. 17.02.2020 начало
					СтрТЧ.ОВЛ=истина; 
					// Кухарь А.Ю. 17.02.2020 конец
					
				ИначеЕсли ИмяРеквизита="АдресПерегруза" тогда	
				ИначеЕсли ИмяРеквизита="ВремяПерегруза" тогда
					
				КонецЕсли;	 	
				
			КонецЕсли;              
			//////////////////////////////////////Отгруженные ПРМ Конец
			
			
		Иначе // Отгружен
			
			Если ТипДокумента = "РасходнаяНакладная" тогда  //////////////////////////////////////резервные РНК начало
				Если ИмяРеквизита="ДатаПриемки" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="ДатаЗаказа" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
					СтрТЧ.СК=Истина;			
				ИначеЕсли ИмяРеквизита="ДатаОтгрузки" тогда
					
					//Кухарь 29.05.19 начало
					//Для того чтобы ОВЛ могли менять дату отгрузки через коррекцию без менеджеров
					//СтрТЧ.ЦО=истина;				
					//МенятьДатуОтгрузкиБезМенеджера=ложь;
					//ЗапВРег=РегистрыСведений.РеквизитыСправочников.СоздатьНаборЗаписей();	
					//ЗапВРег.Отбор.ИмяРеквизита.значение="МенятьДатуОтгрузкиБезМенеджера";
					//ЗапВРег.Отбор.Справочник.значение=ДокОснование.Контрагент;
					//ЗапВРег.Отбор.ИмяРеквизита.использование=Истина;
					//ЗапВРег.Отбор.Справочник.использование=Истина;	
					//ЗапВРег.Прочитать();
					//для каждого СтрЗР из ЗапВРег цикл
					//	МенятьДатуОтгрузкиБезМенеджера=СтрЗР.ЗначениеРеквизита;
					//КонецЦикла;	
					//если МенятьДатуОтгрузкиБезМенеджера=Ложь тогда
					//	СтрТЧ.ЦО=истина;
					//КонецЕсли;
					//Кухарь 29.05.19 конец
					
					// Шворобей ВЮ 02.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5711 
					/////////////////////////////////////////////////////////////////////////////////////
					// Исправляю крутейший код !!!! Узнаю руку мастера :-)))
					/////////////////////////////////////////////////////////////////////////////////////
					Запрос = Новый Запрос;
					Запрос.УстановитьПараметр("Справочник", ДокОснование.Контрагент);
					Запрос.Текст =
					"ВЫБРАТЬ
					|	РеквизитыСправочников.ЗначениеРеквизита КАК МенятьДатуОтгрузкиБезМенеджера
					|ИЗ
					|	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
					|ГДЕ
					|	РеквизитыСправочников.Справочник = &Справочник
					|	И РеквизитыСправочников.ИмяРеквизита = ""МенятьДатуОтгрузкиБезМенеджера""
					|	И ТИПЗНАЧЕНИЯ(РеквизитыСправочников.ЗначениеРеквизита) = ТИП(БУЛЕВО)";
					
					УстановитьПривилегированныйРежим(Истина);
					Выборка = Запрос.Выполнить().Выбрать();
					УстановитьПривилегированныйРежим(Ложь);
					
					МенятьДатуОтгрузкиБезМенеджера = Ложь;
					Пока Выборка.Следующий() Цикл
						МенятьДатуОтгрузкиБезМенеджера = Выборка.МенятьДатуОтгрузкиБезМенеджера;
					КонецЦикла;
					
					Если МенятьДатуОтгрузкиБезМенеджера = Ложь Тогда
						СтрТЧ.ЦО = Истина;
					КонецЕсли;
					
					Если ДокОснование.Склад.ЭтоСкладFBS = Истина Тогда
						СтрТЧ.ОВЛ = Истина;
					Иначе
						СтрТЧ.ОВЛ = Истина;
						СтрТЧ.СК = Истина;
					КонецЕсли;
					// Шворобей ВЮ 02.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5711 
					
				ИначеЕсли ИмяРеквизита="ДатаОплаты" тогда
					//Кухарь 29.05.19 начало
					//Для того чтобы ОВЛ могли менять дату отгрузки через коррекцию без менеджеров
					//СтрТЧ.ЦО=истина;
					МенятьДатуОтгрузкиБезМенеджера=ложь;
					ЗапВРег=РегистрыСведений.РеквизитыСправочников.СоздатьНаборЗаписей();	
					ЗапВРег.Отбор.ИмяРеквизита.значение="МенятьДатуОтгрузкиБезМенеджера";
					ЗапВРег.Отбор.Справочник.значение=ДокОснование.Контрагент;
					ЗапВРег.Отбор.ИмяРеквизита.использование=Истина;
					ЗапВРег.Отбор.Справочник.использование=Истина;	
					ЗапВРег.Прочитать();
					для каждого СтрЗР из ЗапВРег цикл
						МенятьДатуОтгрузкиБезМенеджера=СтрЗР.ЗначениеРеквизита;
					КонецЦикла;						
					если МенятьДатуОтгрузкиБезМенеджера=Истина и ДатаОтгрузки<>ДатаОтгрузкиДоИзменения тогда
						СтрТЧ.ОВЛ=Истина;
					иначе
						СтрТЧ.ЦО=Истина;
					КонецЕсли;					
					//Кухарь 29.05.19 конец
					
				ИначеЕсли ИмяРеквизита="Договор" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;	
				ИначеЕсли ИмяРеквизита="Комментарий" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.СК=Истина;	
				ИначеЕсли ИмяРеквизита="Менеджер" тогда	
					СтрТЧ.ЦО=истина;
				ИначеЕсли ИмяРеквизита="НомерЗаказа" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
					СтрТЧ.СК=Истина;						
				ИначеЕсли ИмяРеквизита="Организация" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;	
				ИначеЕсли ИмяРеквизита="ОтсрочкаПлатежа" тогда	
					СтрТЧ.ЦО=истина;
				ИначеЕсли ИмяРеквизита="Подразделение" тогда	
					СтрТЧ.ЦО=истина;
				ИначеЕсли ИмяРеквизита="Контрагент" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
					СтрТЧ.СК=Истина;	
				ИначеЕсли ИмяРеквизита="ПунктДоставки" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
					СтрТЧ.СК=Истина;	
				ИначеЕсли ИмяРеквизита="ПунктПерегруза" тогда
					// Кухарь А.Ю. 17.02.2020 начало
					//  СтрТЧ.ЦО=истина;				
					если не ПунктДоставки.ДоставкаЗаНашСчет тогда
						СтрТЧ.ЦО=истина;
					КонецЕсли;
					// Кухарь А.Ю. 17.02.2020 конец
					
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="СуммаДокумента" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;				
				ИначеЕсли ИмяРеквизита="ТранспортнаяКомпания" тогда
					// Кухарь А.Ю. 17.02.2020 начало
					//  СтрТЧ.ЦО=истина;				
					если не ПунктДоставки.ДоставкаЗаНашСчет тогда
						СтрТЧ.ЦО=истина;
					КонецЕсли;
					// Кухарь А.Ю. 17.02.2020 конец
					
					СтрТЧ.ОВЛ=истина;
				ИначеЕсли ИмяРеквизита="ТипДоставки" тогда	
					// Кухарь А.Ю. 17.02.2020 начало
					//  СтрТЧ.ЦО=истина;				
					если не ПунктДоставки.ДоставкаЗаНашСчет тогда
						СтрТЧ.ЦО=истина;
					КонецЕсли;
					// Кухарь А.Ю. 17.02.2020 конец
					
					СтрТЧ.ОВЛ=истина;
				ИначеЕсли ИмяРеквизита="АдресПерегруза" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=истина;
				ИначеЕсли ИмяРеквизита="ВремяПерегруза" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=истина;	
					//крохин начало 17.01.2020
					//вид оплаты
				ИначеЕсли ИмяРеквизита="ВидОплаты" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=истина;
					//крохин конец 17.01.2020
				КонецЕсли;                                           //////////////////////////////////////резервные РНК конец
				
			ИначеЕсли ТипДокумента="Перемещение" тогда              //////////////////////////////////////резервные ПРМ начало
				если ИмяРеквизита="ДатаПриемки" тогда
				ИначеЕсли ИмяРеквизита="ДатаЗаказа" тогда		
				ИначеЕсли ИмяРеквизита="ДатаОплаты" тогда
				ИначеЕсли ИмяРеквизита="ДатаОтгрузки" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
					СтрТЧ.СК=Истина;						
				ИначеЕсли ИмяРеквизита="Договор" тогда	
				ИначеЕсли ИмяРеквизита="Комментарий" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
					СтрТЧ.СК=Истина;	
				ИначеЕсли ИмяРеквизита="Менеджер" тогда	
					СтрТЧ.ЦО=истина;
				ИначеЕсли ИмяРеквизита="НомерЗаказа" тогда				
				ИначеЕсли ИмяРеквизита="Организация" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="ОтсрочкаПлатежа" тогда	
				ИначеЕсли ИмяРеквизита="Подразделение" тогда	
				ИначеЕсли ИмяРеквизита="Контрагент" тогда
				ИначеЕсли ИмяРеквизита="ПунктДоставки" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
					СтрТЧ.СК=Истина;	
				ИначеЕсли ИмяРеквизита="ПунктПерегруза" тогда
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="СуммаДокумента" тогда	
					
				ИначеЕсли ИмяРеквизита="ТранспортнаяКомпания" тогда
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="ТипДоставки" тогда	
					СтрТЧ.ОВЛ=истина;
				ИначеЕсли ИмяРеквизита="АдресПерегруза" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=истина;
				ИначеЕсли ИмяРеквизита="ВремяПерегруза" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=истина;
					
				КонецЕсли;                           //////////////////////////////////////резервные ПРМ конец
			ИначеЕсли   ТипДокумента="ПриходнаяНакладная" тогда     //////////////////////////////////////Все ПНК начало
				
				если ИмяРеквизита="ДатаПриемки" тогда
				ИначеЕсли ИмяРеквизита="ДатаЗаказа" тогда		
				ИначеЕсли ИмяРеквизита="ДатаОплаты" тогда
				ИначеЕсли ИмяРеквизита="ДатаОтгрузки" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
					СтрТЧ.СК=Истина;						
				ИначеЕсли ИмяРеквизита="Договор" тогда	
				ИначеЕсли ИмяРеквизита="Комментарий" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="Менеджер" тогда	
					//Кухарь 07.03.19 начало
					СтрТЧ.ЦО=истина;				
					//Кухарь 07.03.19 конец		
				ИначеЕсли ИмяРеквизита="НомерЗаказа" тогда				
				ИначеЕсли ИмяРеквизита="Организация" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="ОтсрочкаПлатежа" тогда	
				ИначеЕсли ИмяРеквизита="Подразделение" тогда	
					//Кухарь 07.03.19 начало
					СтрТЧ.ЦО=истина;				
					//Кухарь 07.03.19 конец							
				ИначеЕсли ИмяРеквизита="Контрагент" тогда
				ИначеЕсли ИмяРеквизита="ПунктДоставки" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="ПунктПерегруза" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="СуммаДокумента" тогда	
					
				ИначеЕсли ИмяРеквизита="ТранспортнаяКомпания" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="ТипДоставки" тогда	
					СтрТЧ.ОВЛ=истина;
				ИначеЕсли ИмяРеквизита="АдресПерегруза" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=истина;
				ИначеЕсли ИмяРеквизита="ВремяПерегруза" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=истина;			
				КонецЕсли; 	                                              //////////////////////////////////////Все ПНК конец
			ИначеЕсли   ТипДокумента="ЗаявкаВТранспортныйОтдел" тогда     //////////////////////////////////////Все ЗТО начало
				
				если ИмяРеквизита="ДатаПриемки" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
					СтрТЧ.СК=Истина;							
				ИначеЕсли ИмяРеквизита="ДатаЗаказа" тогда		
				ИначеЕсли ИмяРеквизита="ДатаОплаты" тогда
				ИначеЕсли ИмяРеквизита="ДатаОтгрузки" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
					СтрТЧ.СК=Истина;						
				ИначеЕсли ИмяРеквизита="Договор" тогда	
				ИначеЕсли ИмяРеквизита="Комментарий" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="Менеджер" тогда	
					СтрТЧ.ЦО=истина;					
				ИначеЕсли ИмяРеквизита="НомерЗаказа" тогда				
				ИначеЕсли ИмяРеквизита="Организация" тогда
				ИначеЕсли ИмяРеквизита="ОтсрочкаПлатежа" тогда	
				ИначеЕсли ИмяРеквизита="Подразделение" тогда	
					СтрТЧ.ЦО=истина;	
				ИначеЕсли ИмяРеквизита="Контрагент" тогда
				ИначеЕсли ИмяРеквизита="ПунктДоставки" тогда
				ИначеЕсли ИмяРеквизита="ПунктПерегруза" тогда
				ИначеЕсли ИмяРеквизита="СуммаДокумента" тогда	
					
				ИначеЕсли ИмяРеквизита="ТранспортнаяКомпания" тогда
				ИначеЕсли ИмяРеквизита="ТипДоставки" тогда	
					СтрТЧ.ОВЛ=истина;
				ИначеЕсли ИмяРеквизита="АдресПерегруза" тогда	
				ИначеЕсли ИмяРеквизита="ВремяПерегруза" тогда	
					//Кухарь 07.03.19 начало
				ИначеЕсли ИмяРеквизита="КоличествоДокумента" или ИмяРеквизита="КоличествоКоробок" тогда
					СтрТЧ.ЦО=истина;	
				ИначеЕсли ИмяРеквизита="Отправитель" или 
					ИмяРеквизита="ПунктДоставкиОтправитель" или 
					ИмяРеквизита="ТранспортнаяКомпанияОтправитель" или 
					ИмяРеквизита="ПунктПерегрузаОтправитель" или 
					ИмяРеквизита="ПунктДоставкиПолучатель" или 
					ИмяРеквизита="Содержание" или 					
					ИмяРеквизита="ТранспортнаяКомпанияПолучатель" тогда 
					
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
					
				ИначеЕсли ИмяРеквизита="Получатель" или ИмяРеквизита="Объем" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
					СтрТЧ.СК=Истина;
				ИначеЕсли ИмяРеквизита="КоличествоКоробок" тогда
					СтрТЧ.ЦО=истина;
					//Кухарь 07.03.19 конец
				КонецЕсли; 	       //////////////////////////////////////Все ЗТО конец
				
			КонецЕсли;
			
		КонецЕсли; // Отгружен
		
	КонецЦикла;
	
	//Заполним табличную часть Согласования если она пустая
	если Согласования.Количество()=0 тогда
		МассСтрок=ТЗРаспределения.найтистроки(Новый Структура("ПРО",Истина));
		если МассСтрок.количество()>0 тогда
			СтрТЧ=Согласования.Добавить();
			СтрТЧ.Подразделение=Справочники.Подразделения.НайтиПоКоду("SSP-0145");  //Претензионно-ревизионный отдел
		КонецЕсли;	
		
		МассСтрок=ТЗРаспределения.найтистроки(Новый Структура("ЦО",Истина));
		если МассСтрок.количество()>0 тогда
			СтрТЧ=Согласования.Добавить();
			СтрТЧ.Подразделение=Справочники.Подразделения.НайтиПоКоду("SSP-0001");  //ЦО (Управление)
		КонецЕсли;	
		
		МассСтрок=ТЗРаспределения.найтистроки(Новый Структура("ОВЛ",Истина));
		если МассСтрок.количество()>0 тогда
			СтрТЧ=Согласования.Добавить();
			СтрТЧ.Подразделение=Справочники.Подразделения.НайтиПоКоду("SMN-0434");  //ОВЛ
		КонецЕсли;	
		
		МассСтрок=ТЗРаспределения.найтистроки(Новый Структура("СК",Истина));
		если МассСтрок.количество()>0 тогда
			СтрТЧ=Согласования.Добавить();
			СтрТЧ.Подразделение=Справочники.Подразделения.НайтиПоКоду("SMN-0436");  //Складской Комплекс Общие
		КонецЕсли;	
		
		//Кухарь 10.01.19 начало
		//Создание записей в РС ПисьмаНаОтправку
		СформироватьУведомление("Уведомление об утверждении коррекции");	
		//Кухарь 10.01.19 конец
		
	КонецЕсли;
	
	
	Возврат ТЗРаспределения;	
КонецФункции



//ЭтоПоследнееИзменение это значит что этот человек поставил последнюю галку
//B ему нужно получить полный (без отбора по полномочиям) список реквизитов  для изменения  в накладной
Функция ПолучитьТЗДоступныхКИзменениюРеквизитов (ЭтоПоследнееИзменение=ложь) экспорт
	ТЗКонечная=новый ТаблицаЗначений;
	ТЗКонечная.Колонки.Добавить("ИмяРеквизита");
	ТЗРеквизитов=ПолучитьРаспределениеРеквизитовПоПолномочиям();
	Если  ПолучитьПолномочиеПользователя("ДокументКоррекцияОбработка") или ЭтоПоследнееИзменение Тогда
		МассСтрок=ТЗРеквизитов.найтистроки(Новый Структура("ПРО",Истина));
		Для каждого СтрМасс из МассСтрок цикл
			СтрТЗ=ТЗКонечная.Добавить();
			ЗаполнитьЗначенияСвойств(СтрТЗ,СтрМасс);
		КонецЦикла;
	КонецЕсли;	
	Если  ПолучитьПолномочиеПользователя("ДокументКоррекцияОбработкаЦО") или ЭтоПоследнееИзменение Тогда
		МассСтрок=ТЗРеквизитов.найтистроки(Новый Структура("ЦО",Истина));
		Для каждого СтрМасс из МассСтрок цикл
			СтрТЗ=ТЗКонечная.Добавить();
			ЗаполнитьЗначенияСвойств(СтрТЗ,СтрМасс);
		КонецЦикла;
	КонецЕсли;	
	Если  ПолучитьПолномочиеПользователя("ДокументКоррекцияОбработкаОВЛ") или ЭтоПоследнееИзменение Тогда
		МассСтрок=ТЗРеквизитов.найтистроки(Новый Структура("ОВЛ",Истина));
		Для каждого СтрМасс из МассСтрок цикл
			СтрТЗ=ТЗКонечная.Добавить();
			ЗаполнитьЗначенияСвойств(СтрТЗ,СтрМасс);
		КонецЦикла;	
	КонецЕсли;
	Если  ПолучитьПолномочиеПользователя("ДокументКоррекцияОбработкаСК") или ЭтоПоследнееИзменение Тогда
		МассСтрок=ТЗРеквизитов.найтистроки(Новый Структура("СК",Истина));
		Для каждого СтрМасс из МассСтрок цикл
			СтрТЗ=ТЗКонечная.Добавить();
			ЗаполнитьЗначенияСвойств(СтрТЗ,СтрМасс);
		КонецЦикла;
	КонецЕсли;
	
	ТЗКонечная.Свернуть("ИмяРеквизита");
	Возврат ТЗКонечная;
КонецФункции

//Кухарь 18.02.19 начало
//Накладую могут отгрузить после отработки коррекций, для отработанной корр список реквизитов нужно заполнять по другом
Функция ПолучитьТЗИзмененныхРеквизитовВОтработаннойКоррекции()  экспорт
	ТипДокумента=ДокОснование.Метаданные().Имя;	
	ТЗРеквизитов=новый ТаблицаЗначений;
	ТЗРеквизитов.Колонки.Добавить("ИмяРеквизита");
	для каждого ТекРеквизит из  Метаданные().Реквизиты цикл
		если ПолучитьПризнакПропускаемогоВКоррекцииРеквизита(ТекРеквизит.Имя) тогда
			Продолжить;
		КонецЕсли;		
		ИмяИзменяемогоРеквизит=Метаданные().Реквизиты.Найти(ТекРеквизит.Имя+"ДоИзменения");	
		если ИмяИзменяемогоРеквизит=Неопределено тогда Продолжить;КонецЕсли;
		ЗначениеИзменяемогоРеквизита=ЭтотОбъект[ИмяИзменяемогоРеквизит.имя];
		ЗначениеТекущегоРеквизита=ЭтотОбъект[ТекРеквизит.имя];	
		если ЗначениеИзменяемогоРеквизита=ЗначениеТекущегоРеквизита тогда Продолжить;КонецЕсли;	
		СтрТЧ=ТЗРеквизитов.Добавить();	
		ИмяРеквизита=ТекРеквизит.имя;
		СтрТЧ.ИмяРеквизита=ИмяРеквизита;				
	КонецЦикла;
	Возврат ТЗРеквизитов;	
КонецФункции
//Кухарь 18.02.19 конец

Функция ОтработатьКусокКоррекции (СтруктураРеквизитовДляИзменения = Неопределено) Экспорт
	
	ДатаОтгрузкиПрисутствует = Ложь;
	ЗапретСогласования = Ложь;
	
	Если ПолучитьПолномочиеПользователя("ДокументКоррекцияОбработка") тогда
		СтрТЧ=Согласования.Найти(Справочники.Подразделения.НайтиПоКоду("SSP-0145"));  //Претензионно-ревизионный отдел
		если СтрТЧ<>Неопределено и  не СтрТЧ.Согласовано тогда
			СтрТЧ.Согласовано=Истина;
			СтрТЧ.АвторСогласования=ПараметрыСеанса.Пользователь.ФизЛицо;
			// Кухарь А.Ю. 25.08.2021 начало
			//По просьбе Лисицкого М.В.
			СтрТЧ.ДатаСогласования=ТекущаяДата(); 
			//Кухарь А.Ю.  25.08.2021 конец			
		КонецЕсли;
	КонецЕсли;	
	
	Если ПолучитьПолномочиеПользователя("ДокументКоррекцияОбработкаЦО") тогда
		СтрТЧ=Согласования.Найти(Справочники.Подразделения.НайтиПоКоду("SSP-0001"));  //ЦО (Управление)
		если СтрТЧ<>Неопределено и    не СтрТЧ.Согласовано тогда
			СтрТЧ.Согласовано=Истина;
			СтрТЧ.АвторСогласования=ПараметрыСеанса.Пользователь.ФизЛицо;
			// Кухарь А.Ю. 25.08.2021 начало
			//По просьбе Лисицкого М.В.
			СтрТЧ.ДатаСогласования=ТекущаяДата(); 
			//Кухарь А.Ю.  25.08.2021 конец			
		КонецЕсли;
	КонецЕсли;	
	
	Если ПолучитьПолномочиеПользователя("ДокументКоррекцияОбработкаОВЛ") тогда
		СтрТЧ=Согласования.Найти(Справочники.Подразделения.НайтиПоКоду("SMN-0434"));  //ОВЛ
		если  СтрТЧ<>Неопределено и   не СтрТЧ.Согласовано тогда
			СтрТЧ.Согласовано=Истина;
			СтрТЧ.АвторСогласования=ПараметрыСеанса.Пользователь.ФизЛицо;
			// Кухарь А.Ю. 25.08.2021 начало
			//По просьбе Лисицкого М.В.
			СтрТЧ.ДатаСогласования=ТекущаяДата(); 
			//Кухарь А.Ю.  25.08.2021 конец			
		КонецЕсли;
	КонецЕсли;	
	
	Если ПолучитьПолномочиеПользователя("ДокументКоррекцияОбработкаСК") тогда
		СтрТЧ=Согласования.Найти(Справочники.Подразделения.НайтиПоКоду("SMN-0436"));  //Складской Комплекс Общие
		
		///////////////////////////////////////////////////////////////////////////////
		// Шворобей ВЮ 14.05.2024 ++
		Если  СтрТЧ <> Неопределено Тогда
			
			Если  СтруктураРеквизитовДляИзменения <> Неопределено И  ТипЗнч(СтруктураРеквизитовДляИзменения) = Тип("Структура") Тогда
				Если СтруктураРеквизитовДляИзменения.Свойство("СписокРеквизитовДляИзменения") Тогда
					ТаблицаРеквизитовДляИзменения = СтруктураРеквизитовДляИзменения.СписокРеквизитовДляИзменения;
					НайденнаяСтрокаТЧ = ТаблицаРеквизитовДляИзменения.Найти("ДатаОтгрузки", "ИмяРеквизита");
					Если НайденнаяСтрокаТЧ <> Неопределено Тогда
						ДатаОтгрузкиПрисутствует = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		
	    	ЗапретитьИзменениеДатыОтгрузки = Документы.КоррекцияРНК.ЗапретНаСменуДатыОтгрузки(ДокОснование);
			// Кухарь А.Ю. 20.05.2024 начало
			//  ЗапретСогласования = ДатаОтгрузкиПрисутствует И ЗапретитьИзменениеДатыОтгрузки;
			Если ДатаОтгрузкиПрисутствует И ЗапретитьИзменениеДатыОтгрузки Тогда
				СообщитьИзМодуля("Накладная проходила паллетирование. Не забудьте проверить, что нет проблем с паллетами.");
			КонецЕсли; 
			// Кухарь А.Ю. 20.05.2024 конец

			
			//Если ЗапретСогласования Тогда
			//	СообщитьИзМодуля("Склад не может согласовывать изменение Даты Отгрузки");
			//	СтрТЧ.Согласовано = Ложь;
			//Иначе
				Если НЕ СтрТЧ.Согласовано Тогда
					СтрТЧ.Согласовано = Истина;
					СтрТЧ.АвторСогласования=ПараметрыСеанса.Пользователь.ФизЛицо;
					// Кухарь А.Ю. 25.08.2021 начало
					//По просьбе Лисицкого М.В.
					СтрТЧ.ДатаСогласования=ТекущаяДата(); 
					//Кухарь А.Ю.  25.08.2021 конец			
				КонецЕсли;
			//КонецЕсли;
		///////////////////////////////////////////////////////////////////////////////
		
		КонецЕсли;
	КонецЕсли;
	
	МассНесогласованных=Согласования.НайтиСтроки(новый Структура("Согласовано",ложь));
	
	Если МассНесогласованных.Количество() = 0 И НЕ ЗапретСогласования Тогда
		ОтработатьКоррекциюЦеликом();
	Иначе
		Записать(РежимЗаписиДокумента.Запись);			
	КонецЕсли;
	// Кухарь А.Ю. 12.05.2022 начало
	//
	Если ВозниклаОшибка = Истина Тогда
		Возврат Ложь;
	КонецЕсли;
	// Кухарь А.Ю. 12.05.2022 конец
	
	возврат Истина;
КонецФункции

Функция ОтклонитьКусокКоррекции () экспорт
	СостояниеКоррекции = Перечисления.СостоянияКоррекции.Отклонена;
	Отработал=ПараметрыСеанса.Пользователь.ФизЛицо;
	Отработана=Истина;
	Записать(РежимЗаписиДокумента.Запись);
	//Кухарь 10.01.19 начало
	//Создание записей в РС ПисьмаНаОтправку
	СформироватьУведомление("Уведомление об отклонении коррекции");	
	//Кухарь 10.01.19 конец
	Возврат Истина;
КонецФункции


Процедура ОтработатьКоррекциюЦеликом() экспорт 
	
	// Кельманов А.В. - HELP-2272 - 2024.12.04 {
	Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.РасходнаяНакладная") И ДокОснование.Отгружен = Перечисления.Отгружен.Отгружен 
		И ВидОплаты <> ВидОплатыДоИзменения Тогда
		
		СообщитьИзМодуля("Нельзя изменять вид оплаты в отгруженной РНК!");
		
		ВозниклаОшибка = Истина;
		
		Возврат;
		
	КонецЕсли;
	// Кельманов А.В. - HELP-2272 - 2024.12.04 }
	
	СписокРеквизитовДляИзменения=новый ТаблицаЗначений;
	СписокРеквизитовДляИзменения.Колонки.Добавить("ИмяРеквизита");
	СписокРеквизитовДляИзменения.Колонки.Добавить("СинонимРеквизита");
	СписокРеквизитовДляИзменения.Колонки.Добавить("ДоИзменения");
	СписокРеквизитовДляИзменения.Колонки.Добавить("ПослеИзменения");
	СписокРеквизитовДляИзменения.Колонки.Добавить("ВНакладной");
	
	ТЗРеквизитов=ПолучитьТЗДоступныхКИзменениюРеквизитов(Истина);	
	для каждого ТекРеквизит из  ТЗРеквизитов цикл
		ИмяИзменяемогоРеквизит=Метаданные().Реквизиты.Найти(ТекРеквизит.ИмяРеквизита+"ДоИзменения");	
		если ИмяИзменяемогоРеквизит=Неопределено тогда Продолжить;КонецЕсли;
		ЗначениеИзменяемогоРеквизита=ЭтотОбъект[ИмяИзменяемогоРеквизит.имя];
		ЗначениеТекущегоРеквизита=ЭтотОбъект[ТекРеквизит.ИмяРеквизита];	
		если ЗначениеИзменяемогоРеквизита<>ЗначениеТекущегоРеквизита тогда
			СтрТЧ=СписокРеквизитовДляИзменения.Добавить();
			СтрТЧ.ИмяРеквизита=ТекРеквизит.ИмяРеквизита;
			СтрТЧ.СинонимРеквизита=Метаданные().Реквизиты.Найти(ТекРеквизит.ИмяРеквизита).синоним;
			СтрТЧ.ДоИзменения=ЗначениеИзменяемогоРеквизита;
			СтрТЧ.ПослеИзменения=ЗначениеТекущегоРеквизита;
			СтрТЧ.ВНакладной=ДокОснование[ТекРеквизит.ИмяРеквизита];	
		КонецЕсли;	
	КонецЦикла;
	
	НачатьТранзакцию();
	//Кухарь 17.01.19 начало
	//УстановитьДатуАвизацииДокумента(ДокОснованиеОбъект.Ссылка,ДатаПриемки);
	НужноОтработатьДатуАвизации=ложь;
	//Кухарь 17.01.19 конец
	
	
	если ДатаОтгрузки<>ДатаОтгрузкиДоИзменения тогда
		ИзменениеЗоГиСФ(ДокОснование);
	КонецЕсли;
	
	ДокОснованиеОбъект=ДокОснование.ПолучитьОбъект();
	
	для каждого ТекРеквизит из  СписокРеквизитовДляИзменения цикл
		ЗначениеТекущегоРеквизита=ЭтотОбъект[ТекРеквизит.ИмяРеквизита];	
		ДокОснованиеОбъект[ТекРеквизит.ИмяРеквизита]=ЗначениеТекущегоРеквизита;	
		если ТекРеквизит.ИмяРеквизита="ДатаПриемки" тогда
			//Кухарь 17.01.19 начало
			//УстановитьДатуАвизацииДокумента(ДокОснованиеОбъект.Ссылка,ДатаПриемки);
			ДокОснованиеОбъект.ДатаПриемки=ДатаПриемки;
			//Кухарь 17.01.19 конец
		ИначеЕсли  ТекРеквизит.ИмяРеквизита="СуммаДокумента" тогда
			Для Каждого строкаТЧ Из Товары Цикл
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("Номенклатура", строкаТЧ.Номенклатура);
				попытка
					СтрокаДокОснования = ДокОснованиеОбъект.Товары.НайтиСтроки(ПараметрыОтбора).Получить(0);
				исключение
					СообщитьИзМодуля("Невозможно принять коррекцию! Номенклатуры "+ строкаТЧ.Номенклатура+ "  нет в исходной накладной!");
					ОтменитьТранзакцию();
				конецПопытки;		
				СтрокаДокОснования.Цена = строкаТЧ.Цена;
				СтрокаДокОснования.ЦенаБезСкидки = строкаТЧ.ЦенаБезСкидки;
				СтрокаДокОснования.СтавкаНДС = строкаТЧ.СтавкаНДС;
				СтрокаДокОснования.Сумма 			= СтрокаДокОснования.Цена * СтрокаДокОснования.Количество;
				СтавкаНДС=ПроцентНДСпоСтавке(СтрокаДокОснования.СтавкаНДС);			
				СтрокаДокОснования.НДС	=СтрокаДокОснования.Сумма*СтавкаНДС/(1+СтавкаНДС);			
				СтрокаДокОснования.Всего	=СтрокаДокОснования.Сумма;
				СтрокаДокОснования.Сумма  =СтрокаДокОснования.Всего-СтрокаДокОснования.НДС; 
				СтрокаДокОснования.ВсегоБезБонуса =  СтрокаДокОснования.Всего;
				СтрокаДокОснования.ЦенаБезБонуса = СтрокаДокОснования.Цена;
				СтрокаДокОснования.Скидка =  строкаТЧ.Скидка;
				СтрокаДокОснования.ТипЦен = строкаТЧ.ТипЦен;
				Если ДокОснованиеОбъект.Контрагент.НДС_Сверху Тогда
					//Кухарь 01.04.19 начало
					//ЦенаБезНДС = Окр(СтрокаДокОснования.Цена*(1-СтавкаНДС/(1+СтавкаНДС)),2);
					ЦенаБезНДС = Окр(СтрокаДокОснования.Цена/(1+СтавкаНДС),2);					
					//Кухарь 01.04.19 конец	
					ВсегоБезНДС = ЦенаБезНДС*СтрокаДокОснования.Количество;
					СтрокаДокОснования.НДС = ВсегоБезНДС*СтавкаНДС;
					СтрокаДокОснования.Всего = ВсегоБезНДС + СтрокаДокОснования.НДС;
					СтрокаДокОснования.Сумма = ВсегоБезНДС;			
				КонецЕсли;
			КонецЦикла;			
			ДокОснованиеОбъект.Скидка = Скидка;
			ДокОснованиеОбъект.ТипЦен = ТипЦен;
			ДокОснованиеОбъект.ТипЦенРаспродажа = ТипЦенРаспродажа;
			ДокОснованиеОбъект.ТипСкидок = ТипСкидок;
			ДокОснованиеОбъект.ДопСкидкаНаНакладную = ДопСкидкаНаНакладную;
		КонецЕсли;	
	КонецЦикла;
	
	
	ДокОснованиеОбъект.СостояниеКоррекции=Перечисления.СостоянияКоррекции.Принята;
	СостояниеКоррекции=Перечисления.СостоянияКоррекции.Принята;
	//Кухарь 11.01.19 конец	
	//ДокОснованиеОбъект.Записать(?(ДокОснованиеОбъект.Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));	
	//Кухарь 17.01.19 начало
	//ДокОснованиеОбъект.ЗаписьБезКонтроляПолномочий();
	ТЗНеизменяемыхРеквизитов=новый ТаблицаЗначений;
	ТЗНеизменяемыхРеквизитов.Колонки.Добавить("ИмяРеквизита");
	СтрТЗ=ТЗНеизменяемыхРеквизитов.Добавить();
	СтрТЗ.ИмяРеквизита="ДатаАвизации";
	
	
	// Кухарь А.Ю. 12.05.2022 начало
	// База начинает висеть, в ожидании пока закроют предупреждение
	Попытка 
		// Кухарь А.Ю. 12.05.2022 конец
		
		
		если ДокОснованиеОбъект.Метаданные().Имя="РасходнаяНакладная" или ДокОснованиеОбъект.Метаданные().Имя="ПриходнаяНакладная" или ДокОснованиеОбъект.Метаданные().Имя="Перемещение" тогда
			ДокОснованиеОбъект.ЗаписьБезКонтроляПолномочий(ТЗНеизменяемыхРеквизитов);	
		иначе
			ДокОснованиеОбъект.ЗаписьБезКонтроляПолномочий();			
		КонецЕсли;
		//Кухарь 17.01.19 конец
		
		// Кухарь А.Ю. 12.05.2022 начало
		// // База начинает висеть, в ожидании пока закроют предупреждение
	Исключение
		ТекстОшибки=ОписаниеОшибки();
		если ТранзакцияАктивна() тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		СообщитьИзМодуля("Не удалось провести РНК "+ОписаниеОшибки());
		ВозниклаОшибка=Истина;
		Возврат;
	КонецПопытки;
	// Кухарь А.Ю. 12.05.2022 конец
	
	
	//Кухарь 11.01.19 конец	
	
	//Кухарь 17.01.19 начало
	если ДатаПриемки<>ПустаяДата() и ДатаПриемки<>ОпределитьДатуАвизацииДокумента(ДокОснование) тогда
		//Кухарь 13.02.19 начало
		//Иногда нужно устанавливать меньше расчётной человеку без полномочий (отработка коррекций)
		//УстановитьДатуАвизацииДокумента(ДокОснование,ДатаПриемки);
		УстановитьДатуАвизацииДокумента(ДокОснование,ДатаПриемки,Истина);
		//Кухарь 13.02.19 конец
	КонецЕсли;
	//Кухарь 17.01.19 конец	
	
	
	Отработана=Истина;
	Отработал = ПараметрыСеанса.Пользователь.ФизЛицо;
	ЭтотОбъект.Записать(РежимЗаписиДокумента.Запись);
	ЗафиксироватьТранзакцию();	
	
	СформироватьУведомление("Уведомление об отработке коррекции");	
КонецПроцедуры


Функция ОтработатьТовары (ДокОснованиеОбъект)
	Для Каждого строкаТЧ Из Товары Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Номенклатура", строкаТЧ.Номенклатура);
		попытка
			СтрокаДокОснования = ДокОснованиеОбъект.Товары.НайтиСтроки(ПараметрыОтбора).Получить(0);
		исключение
			СообщитьИзМодуля("Невозможно принять коррекцию! Номенклатуры "+ строкаТЧ.Номенклатура+ "  нет в исходной накладной!");
			возврат ложь;
		конецПопытки;		
		СтрокаДокОснования.Цена = строкаТЧ.Цена;
		СтрокаДокОснования.ЦенаБезСкидки = строкаТЧ.ЦенаБезСкидки;
		СтрокаДокОснования.СтавкаНДС = строкаТЧ.СтавкаНДС;
		СтрокаДокОснования.Сумма 			= СтрокаДокОснования.Цена * СтрокаДокОснования.Количество;
		СтавкаНДС=ПроцентНДСпоСтавке(СтрокаДокОснования.СтавкаНДС);			
		СтрокаДокОснования.НДС	=СтрокаДокОснования.Сумма*СтавкаНДС/(1+СтавкаНДС);			
		СтрокаДокОснования.Всего	=СтрокаДокОснования.Сумма;
		СтрокаДокОснования.Сумма  =СтрокаДокОснования.Всего-СтрокаДокОснования.НДС; 
		СтрокаДокОснования.ВсегоБезБонуса =  СтрокаДокОснования.Всего;
		СтрокаДокОснования.ЦенаБезБонуса = СтрокаДокОснования.Цена;
		СтрокаДокОснования.Скидка =  строкаТЧ.Скидка;
		СтрокаДокОснования.ТипЦен = строкаТЧ.ТипЦен;
		Если ДокОснованиеОбъект.Контрагент.НДС_Сверху Тогда
			//Кухарь 01.04.19 начало
			//ЦенаБезНДС = Окр(СтрокаДокОснования.Цена*(1-СтавкаНДС/(1+СтавкаНДС)),2);
			ЦенаБезНДС = Окр(СтрокаДокОснования.Цена/(1+СтавкаНДС),2);					
			//Кухарь 01.04.19 конец	
			ВсегоБезНДС = ЦенаБезНДС*СтрокаДокОснования.Количество;
			СтрокаДокОснования.НДС = ВсегоБезНДС*СтавкаНДС;
			СтрокаДокОснования.Всего = ВсегоБезНДС + СтрокаДокОснования.НДС;
			СтрокаДокОснования.Сумма = ВсегоБезНДС;			
		КонецЕсли;
	КонецЦикла;
	
	ДокОснованиеОбъект.Скидка = Скидка;
	ДокОснованиеОбъект.ТипЦен = ТипЦен;
	ДокОснованиеОбъект.ТипЦенРаспродажа = ТипЦенРаспродажа;
	ДокОснованиеОбъект.ТипСкидок = ТипСкидок;
	ДокОснованиеОбъект.ДопСкидкаНаНакладную = ДопСкидкаНаНакладную;
	Возврат Истина;
КонецФункции
//Кухарь 07.12.18 конец


//Кухарь 10.01.19 начало
//Создание записей в РС ПисьмаНаОтправку
Процедура СформироватьУведомление(ВидУведомления) экспорт
	//Кухарь 15.01.19 начало 
	//Иногда коррекции отрабатывают и утверждают массово обработкой. Отдельное письмо на каждую не рационально. Письмо будет создаваться в обработке.
	если ПараметрыСеанса.ЗапущенаОбработка = Истина тогда 
		Возврат;        
	КонецЕсли; 
	//Кухарь 15.01.19 конец
	//Михайловский С. 20220712 -придется так+++
	МИскл=Новый Массив;
	МИскл.Добавить("krohin@collant.ru");
	МИскл.Добавить("kuhar@collant.ru");
	//Михайловский С. 20220712 -придется так---
	СписокПолучателей=новый СписокЗначений;
	ТемаПисьма=ВидУведомления;
	
	ТекстПисьма="";
	
	//Кухарь 09.08.19 начало
	//По просьбе егоровой добавим контрагента и состояние коррекции
	если ДокОснование.Метаданные().Имя="РасходнаяНакладная" тогда
		ТекстКонтрагента=" по контрагенту "+ДокОснование.Контрагент.Наименование;
	иначе
		ТекстКонтрагента="";
	КонецЕсли;
	
	если ДокОснование.Метаданные().Имя="РасходнаяНакладная" тогда
		если ВидУведомления="Уведомление об отклонении коррекции" тогда
			ТекстСостояниеКоррекции=" - отклонена.";
		Иначе 
			ТекстСостояниеКоррекции=" - принята.";		
		КонецЕсли;	
		
		ТекстСостоянияКоррекции=Символы.ПС+"Состояние"+ТекстСостояниеКоррекции;
	иначе
		ТекстСостоянияКоррекции="";
	КонецЕсли;
	//Кухарь 09.08.19 конец
	
	
	
	если ВидУведомления="Уведомление об отработке коррекции" или ВидУведомления="Уведомление об отклонении коррекции" тогда	
		если Найти(автор.ФизЛицо.ЕМэйл,"@")>0 тогда
			СписокПолучателей.Добавить(СокрЛП(автор.ФизЛицо.ЕМэйл));
		КонецЕсли;
		
		если Найти(ДокОснование.Менеджер.ЕМэйл,"@")>0 тогда
			СписокПолучателей.Добавить(СокрЛП(ДокОснование.Менеджер.ЕМэйл));
		КонецЕсли;
		//Кухарь 09.08.19 начало
		//По просьбе егоровой добавим контрагента и состояние коррекции		
		//ТекстПисьма="Коррекция "+Номер+" была "+?(ВидУведомления="Уведомление об отработке коррекции"," отработана "," отклонена ")+" пользователем "+ПараметрыСеанса.Пользователь;
		ТекстПисьма="Коррекция "+Номер+ТекстКонтрагента+" была "+?(ВидУведомления="Уведомление об отработке коррекции"," отработана "," отклонена ")+" пользователем "+ПараметрыСеанса.Пользователь+ТекстСостоянияКоррекции;		
		//Кухарь 09.08.19 конец	
		
	ИначеЕсли ВидУведомления="Уведомление об утверждении коррекции"  тогда
		//Михайловский С. 20220718 -коррекция по полномочиям+++
		ДопСписок1=СформСписокПолучат(Справочники.ТипыРассылок.УведомлениеОбУтвержденииКоррекции,Справочники.Подразделения.НайтиПоКоду("SSP-0145"));
		ДопСписок2=СформСписокПолучат(Справочники.ТипыРассылок.УведомлениеОбУтвержденииКоррекции,Справочники.Подразделения.НайтиПоКоду("SMN-0434"));
		ДопСписок3=СформСписокПолучат(Справочники.ТипыРассылок.УведомлениеОбУтвержденииКоррекции,Справочники.Подразделения.НайтиПоКоду("SMN-0436"));
		СписокПолномочий=новый СписокЗначений;
		если Согласования.Найти(Справочники.Подразделения.НайтиПоКоду("SSP-0145"))<>Неопределено тогда  //Претензионно-ревизионный отдел
						
			
			Если ДопСписок1.Количество() Тогда
				Для Каждого ТЭл ИЗ ДопСписок1 Цикл
					СписокПолучателей.Добавить(ТЭл.Значение);
				КонецЦикла;	
			Иначе
				СписокПолномочий.Добавить(ПланыВидовХарактеристик.ПолномочияПользователей.ДокументКоррекцияОбработка);
			КонецЕсли;
			
		КонецЕсли;			
		//если Согласования.Найти(Справочники.Подразделения.НайтиПоКоду("SSP-0001"))<>Неопределено тогда  //ЦО (Управление)
		//	СписокПолномочий.Добавить(ПланыВидовХарактеристик.ПолномочияПользователей.ДокументКоррекцияОбработкаЦО);
		//КонецЕсли;			
		если Согласования.Найти(Справочники.Подразделения.НайтиПоКоду("SMN-0434"))<>Неопределено тогда   //ОВЛ
			
			Если ДопСписок2.Количество() Тогда
				Для Каждого ТЭл ИЗ ДопСписок2 Цикл
					СписокПолучателей.Добавить(ТЭл.Значение);
				КонецЦикла;	
			Иначе
				СписокПолномочий.Добавить(ПланыВидовХарактеристик.ПолномочияПользователей.ДокументКоррекцияОбработкаОВЛ);
			КонецЕсли;
			
		КонецЕсли;		
		если Согласования.Найти(Справочники.Подразделения.НайтиПоКоду("SMN-0436"))<>Неопределено тогда  //Складской Комплекс Общие
			
			Если ДопСписок3.Количество() Тогда
				Для Каждого ТЭл ИЗ ДопСписок3 Цикл
					СписокПолучателей.Добавить(ТЭл.Значение);
				КонецЦикла;	
			Иначе
				СписокПолномочий.Добавить(ПланыВидовХарактеристик.ПолномочияПользователей.ДокументКоррекцияОбработкаСК);
			КонецЕсли;
			
		КонецЕсли;	
		Если НЕ ДопСписок1.Количество() И НЕ ДопСписок2.Количество() И НЕ ДопСписок3.Количество() Тогда
			Запрос=новый запрос;
			запрос.Текст= "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВЫРАЗИТЬ(ПолномочияПользователей.Пользователь.ФизЛицо.ЕМэйл КАК СТРОКА(100)) КАК Почта,
			|	ПолномочияПользователей.Полномочие
			|ИЗ
			|	РегистрСведений.ПолномочияПользователей КАК ПолномочияПользователей
			|ГДЕ
			|	ПолномочияПользователей.Полномочие В(&СписокПолномочий)
			// Кухарь А.Ю.  17.06.2022 начало
			// По просьбе Никиты уволенных нужно убрать
			|	И ПолномочияПользователей.Пользователь.ФизЛицо.Штатный 
			// Кухарь А.Ю.  17.06.2022 конец			
			|	И ПолномочияПользователей.Значение = ИСТИНА";
			запрос.УстановитьПараметр("СписокПолномочий",СписокПолномочий);
			результат=запрос.Выполнить().Выбрать();
			пока результат.Следующий() цикл
				если Найти(результат.Почта,"@")>0 тогда
					//Михайловский С. 20220712 -придется так+++
					//вместо
					//СписокПолучателей.Добавить(СокрЛП(результат.Почта));
					Если МИскл.Найти(СокрЛП(результат.Почта))=неопределено Тогда
						СписокПолучателей.Добавить(СокрЛП(результат.Почта));
					КонецЕсли;	
					//Михайловский С. 20220712 -придется так---
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		//Михайловский С. 20220718 -коррекция по полномочиям---
		ТекстПисьма="Просьба отработать Коррекцию "+Номер;
	КонецЕсли;
	
	если СокрЛП(ТекстПисьма="") тогда
		ЗаписатьВЛог("Регламент","Пустой текст при формировании письма к коррекции № "+Номер,"Ошибка");		
	ИначеЕсли СписокПолучателей.Количество()=0 тогда
		ЗаписатьВЛог("Регламент","Пустой список адресатов при формировании письма к коррекции № "+Номер,"Ошибка");
	иначе
		//Кухарь 15.01.19 начало
		тз=новый ТаблицаЗначений;
		тз.Колонки.Добавить("Склад");
		тз.Колонки.Добавить("ГруппыТоваров");
		тз.Колонки.Добавить("Номер");
		// Кухарь А.Ю. 29.03.2021 начало
		если ДокОснование.метаданные().имя = "РасходнаяНакладная" тогда
			тз.Колонки.Добавить("ВидОплаты");
		КонецЕсли;
		// Кухарь А.Ю. 29.03.2021 конец
		
		тз.Колонки.Добавить("СостояниеНакладной");
		тз.Колонки.Добавить("ДатаОтгрузки");
		тз.Колонки.Добавить("Получатель");
		тз.Колонки.Добавить("ТипДоставки");
		тз.Колонки.Добавить("ПунктДоставки");
		тз.Колонки.Добавить("КоличествоДокумента");
		тз.Колонки.Добавить("Объем");
		тз.Колонки.Добавить("АвторКоррекции");
		тз.Колонки.Добавить("ИзменяемыеРеквизитыНакладной");
		тз.Колонки.Добавить("ТекущееЗначение");
		тз.Колонки.Добавить("НовоеЗначение");
		тз.Колонки.Добавить("Накладная");
		
		СтрТЗ=тз.Добавить();
		ЗаполнитьЗначенияСвойств(СтрТЗ,ДокОснование);
		если ДокОснование.ОбъемКоробов >0 тогда
			СтрТЗ.Объем=ДокОснование.ОбъемКоробов;
		иначе
			СтрТЗ.Объем=ДокОснование.ОбъемДокумента;
		КонецЕсли;
		СтрТЗ.Накладная=ДокОснование;
		СтрТЗ.АвторКОррекции=автор;
		//Кухарь 07.03.19 начало
		//СтрТЗ.Получатель=?(ДокОснование.метаданные().имя="Перемещение",ДокОснование.СкладПолучатель,ДокОснование.Контрагент);	
		если ДокОснование.метаданные().имя<>"ЗаявкаВТранспортныйОтдел" тогда
			СтрТЗ.Получатель=?(ДокОснование.метаданные().имя="Перемещение",ДокОснование.СкладПолучатель,ДокОснование.Контрагент);
		иначе
			СтрТЗ.Получатель=?(типзнч(отправитель)=тип("СправочникСсылка.Контрагенты"),Отправитель,Получатель);
		КонецЕсли;
		//Кухарь 07.03.19 
		ТЗИзменений=новый ТаблицаЗначений;
		ТЗИзменений.Колонки.Добавить("ИмяРеквизита");
		ТЗИзменений.Колонки.Добавить("СинонимРеквизита");
		ТЗИзменений.Колонки.Добавить("ДоИзменения");
		ТЗИзменений.Колонки.Добавить("ПослеИзменения");
		ТЗИзменений.Колонки.Добавить("ВНакладной");
		ТЗИзменений.Колонки.Добавить("Накладная");	
		ТЗРеквизитов=ПолучитьТЗДоступныхКИзменениюРеквизитов(Истина);	
		для каждого ТекРеквизит из  ТЗРеквизитов цикл
			ИмяИзменяемогоРеквизит=Метаданные().Реквизиты.Найти(ТекРеквизит.ИмяРеквизита+"ДоИзменения");	
			если ИмяИзменяемогоРеквизит=Неопределено тогда Продолжить;КонецЕсли;
			ЗначениеИзменяемогоРеквизита=ЭтотОбъект[ИмяИзменяемогоРеквизит.имя];
			ЗначениеТекущегоРеквизита=ЭтотОбъект[ТекРеквизит.ИмяРеквизита];	
			если ЗначениеИзменяемогоРеквизита<>ЗначениеТекущегоРеквизита тогда
				СтрТЧ=ТЗИзменений.Добавить();
				СтрТЧ.ИмяРеквизита=ТекРеквизит.ИмяРеквизита;
				СтрТЧ.СинонимРеквизита=Метаданные().Реквизиты.Найти(ТекРеквизит.ИмяРеквизита).синоним;
				СтрТЧ.ДоИзменения=ЗначениеИзменяемогоРеквизита;
				СтрТЧ.ПослеИзменения=ЗначениеТекущегоРеквизита;
				СтрТЧ.ВНакладной=ДокОснование[ТекРеквизит.ИмяРеквизита];	
				СтрТЧ.Накладная=ДокОснование;
				//Кухарь 11.12.19 начало
				//Так понятнее что именно меняется
				если СтрТЧ.ИмяРеквизита="ПунктДоставки" тогда
					//Кухарь 02.04.20 начало
					//+ изменения в доп. печати
					если СтрТЧ.ДоИзменения.ПечГрузополучательТорг12<>СтрТЧ.ПослеИзменения.ПечГрузополучательТорг12 тогда
						СтрТЧ2=ТЗИзменений.Добавить();
						ЗаполнитьЗначенияСвойств(СтрТЧ2,СтрТЧ);	
						СтрТЧ2.ДоИзменения=СтрТЧ2.ДоИзменения.ПечГрузополучательТорг12;
						СтрТЧ2.ВНакладной=СтрТЧ2.ВНакладной.ПечГрузополучательТорг12;	
						СтрТЧ2.ПослеИзменения=СтрТЧ2.ПослеИзменения.ПечГрузополучательТорг12;	
						СтрТЧ2.ИмяРеквизита="Грузополучатель торг12 из доп. печати";
						СтрТЧ2.СинонимРеквизита="Грузополучатель торг12 из доп. печати";
					КонецЕсли;
					
					если СтрТЧ.ДоИзменения.ПечГрузополучательСФ<>СтрТЧ.ПослеИзменения.ПечГрузополучательСФ тогда
						СтрТЧ2=ТЗИзменений.Добавить();
						ЗаполнитьЗначенияСвойств(СтрТЧ2,СтрТЧ);	
						СтрТЧ2.ДоИзменения=СтрТЧ2.ДоИзменения.ПечГрузополучательСФ;
						СтрТЧ2.ВНакладной=СтрТЧ2.ВНакладной.ПечГрузополучательСФ;	
						СтрТЧ2.ПослеИзменения=СтрТЧ2.ПослеИзменения.ПечГрузополучательСФ;	
						СтрТЧ2.ИмяРеквизита="Грузополучатель СФ из доп. печати";
						СтрТЧ2.СинонимРеквизита="Грузополучатель СФ из доп. печати";
					КонецЕсли;			                  
					//Кухарь 02.04.20 конец
					
					
					СтрТЧ.ДоИзменения=Строка(СтрТЧ.ДоИзменения)+"; Адрес: "+СтрТЧ.ДоИзменения.ПочтовыйАдрес;
					СтрТЧ.ПослеИзменения=Строка(СтрТЧ.ПослеИзменения)+"; Адрес: "+СтрТЧ.ПослеИзменения.ПочтовыйАдрес;
				КонецЕсли;
				//Кухарь 11.12.19 конец				
				
			КонецЕсли;	
		КонецЦикла;
		//Михайловский С. 20220712 -дополнительно+++
		ДопСписок=СформСписокПолучат(Справочники.ТипыРассылок.УведомлениеОбУтвержденииКоррекции);
		Если ДопСписок.Количество() Тогда
			Для Каждого ТЭл ИЗ ДопСписок Цикл
				СписокПолучателей.Добавить(ТЭл.Значение);
			КонецЦикла;	
		КонецЕсли;	
		//Михайловский С. 20220712 -дополнительно---
		ХТМЛТекст=ПреобразоватьТаблицуВHTMLText(тз,ТекстПисьма,ТЗИзменений);
		ТекстПисьма=ХТМЛТекст;
		//Кухарь 15.01.19 конец
		
		
		
		
		
		
		
		ПодготовитьПисьмоКОтправке (СписокПолучателей,ТекстПисьма,ТемаПисьма);
	КонецЕсли;
	
КонецПроцедуры


Процедура ПодготовитьПисьмоКОтправке (СписокПолучателей,ТекстПисьма,ТемаПисьма)
	СписокАдресов="";
	для каждого Стр из СписокПолучателей цикл
		если Найти(СписокАдресов,Стр.Значение)=0 тогда
			СписокАдресов=СписокАдресов+Стр.Значение+"##";
		КонецЕсли;
	КонецЦикла;
	СписокАдресов=лев(СписокАдресов,СтрДлина(СписокАдресов)-2);
	
	
	ЗаписьВРег=РегистрыСведений.ПисьмаНаОтправку.СоздатьМенеджерЗаписи();
	//Кухарь 15.01.19 начало	
	//ЗаписьВРег.Основание=Метаданные().Синоним+" "+Номер;
	ЗаписьВРег.Основание=Ссылка;
	//Кухарь 15.01.19 конец		
	ЗаписьВРег.ДатаСозданияПисьма=ТекущаяДата();
	ЗаписьВРег.период=ЗаписьВРег.ДатаСозданияПисьма;
	
	ЗаписьВРег.ТекстПисьма=ТекстПисьма;
	ЗаписьВРег.ТемаПисьма=ТемаПисьма;
	ЗаписьВРег.СписокПолучателей=СписокАдресов;
	ЗаписьВРег.Записать();		
КонецПроцедуры
//Кухарь 10.01.19 конец


//Кухарь 15.01.19 начало
Функция ПреобразоватьТаблицуВHTMLText(ТЗ,ДопТекст,ТЗИзменений) 
	р = 3;
	Ответ = "<HTML><HEAD><BODY>"+ДопТекст+"<TABLE border=1><TBODY>";
	
	Ответ=Ответ+"<TR bgcolor=#FFFF99>";	
	Ответ=Ответ+"<TD><P><FONT size=3> Склад </FONT></TD>";
	Ответ=Ответ+"<TD><P><FONT size=3> Группа товаров </FONT></TD>";
	Ответ=Ответ+"<TD><P><FONT size=3> Номер </FONT></TD>";	
	// Кухарь А.Ю. 29.03.2021 начало
	если ДокОснование.метаданные().имя = "РасходнаяНакладная" тогда
		Ответ=Ответ+"<TD><P><FONT size=3> Вид оплаты </FONT></TD>";	 
	КонецЕсли;
	// Кухарь А.Ю. 29.03.2021 конец
	
	Ответ=Ответ+"<TD><P><FONT size=3> Состояние накладной </FONT></TD>";
	Ответ=Ответ+"<TD><P><FONT size=3> Дата отгрузки </FONT></TD>";
	Ответ=Ответ+"<TD><P><FONT size=3> Получатель </FONT></TD>";
	Ответ=Ответ+"<TD><P><FONT size=3> Тип доставки </FONT></TD>";
	Ответ=Ответ+"<TD><P><FONT size=3> Пункт доставки </FONT></TD>";
	Ответ=Ответ+"<TD><P><FONT size=3> Кол-во </FONT></TD>";
	Ответ=Ответ+"<TD><P><FONT size=3> Объем </FONT></TD>";
	Ответ=Ответ+"<TD><P><FONT size=3> Автор корреции </FONT></TD>";
	Ответ=Ответ+"<TD><P><FONT size=3> Изменяемые реквизиты </FONT></TD>";
	Ответ=Ответ+"<TD><P><FONT size=3> Текущее значение </FONT></TD>";
	Ответ=Ответ+"<TD><P><FONT size=3> Новое значение </FONT></TD>";
	Ответ=Ответ+"</TR>";
	
	для каждого СтрокаТаблицы из ТЗ	цикл
		Ответ=Ответ+"<TR>";
		для каждого Колонка из ТЗ.колонки цикл
			если Колонка.имя="Накладная" тогда Прервать;КонецЕсли;
			Ответ=Ответ+"<TD><P><FONT size=3>"+СтрокаТаблицы[Колонка.имя]+"</FONT></P></TD>";
		КонецЦикла;
		Ответ=Ответ+"</TR>";
		
		
		МассСтрок=ТЗИзменений.НайтиСтроки(новый Структура("Накладная",СтрокаТаблицы.Накладная));
		если МассСтрок.количество()>0 тогда
			для каждого СтрМассива из МассСтрок цикл
				Ответ=Ответ+"<TR>";	
				
				// Кухарь А.Ю. 09.04.2021 начало
				//Добавилась колонка, нужно на 1 пустую ячейку больше
				// 	для сч=1 по 11 цикл 
				если ДокОснование.метаданные().имя = "РасходнаяНакладная" тогда
					ПустыхКолонок=12;	 
				иначе
					ПустыхКолонок=11;
				КонецЕсли;
				для сч=1 по ПустыхКолонок цикл 
					// Кухарь А.Ю. 09.04.2021 конец 
					Ответ=Ответ+"<TD><P><FONT size=3>"+""+"</FONT></P></TD>";
				КонецЦикла;
				
				Ответ=Ответ+"<TD><P><FONT size=3>"+СтрМассива.СинонимРеквизита+"</FONT></P></TD>";
				Ответ=Ответ+"<TD><P><FONT size=3>"+СтрМассива.ДоИзменения+"</FONT></P></TD>";
				Ответ=Ответ+"<TD><P><FONT size=3>"+СтрМассива.ПослеИзменения+"</FONT></P></TD>";
				
				Ответ=Ответ+"</TR>";
				
			КонецЦикла;
			
		КонецЕсли;
		
		
		
	КонецЦикла;		
	Ответ  =Ответ+"</TBODY></TABLE></BODY></HTML>";
	Возврат Ответ;
КонецФункции
//Кухарь 15.01.19 конец
