Функция ПользователиИнформационнойБазы_ПолучитьПользователей() Экспорт
	Возврат ПользователиИнформационнойБазы.ПолучитьПользователей();
КонецФункции


Функция ПользователиИнформационнойБазы_ТекущийПользователь() Экспорт
	Возврат ПользователиИнформационнойБазы.ТекущийПользователь();
КонецФункции //ПользователиИнформационнойБазы_ТекущийПользователь()


Функция ПользователиИнформационнойБазы_НайтиПоИмени(ИмяПользователя) Экспорт
	Возврат ПользователиИнформационнойБазы.НайтиПоИмени(ИмяПользователя);
КонецФункции //ПользователиИнформационнойБазы.НайтиПоИмени()

Функция ПользователиИнформационнойБазы_СоздатьПользователя(ИмяПользователя,ПарольПользователя) Экспорт
    Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
				
	Пользователь.Имя                       = ИмяПользователя;
	Пользователь.АутентификацияСтандартная = Истина;
	Пользователь.Пароль                    = ПарольПользователя;
	Пользователь.ПоказыватьВСпискеВыбора   = Ложь;
	
	Пользователь.Роли.Добавить(Метаданные.Роли.ОбновлениеКонфигурации);	
					
	Пользователь.Записать();
КонецФункции // ПользователиИнформационнойБазы.СоздатьПользователя()
 
	
 
 
 