
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	КаталогЗагрузки = ХранилищеОбщихНастроек.Загрузить("Справочник.ФР_ПакетыДанных", "КаталогЗагрузки");	
	КаталогЗагрузки = ВыборКаталога_(КаталогЗагрузки);
	
	Если ЗначениеЗаполнено(КаталогЗагрузки) Тогда     
		МаскаФайлов = СтрШаблон("Msg_*_%1_*.dd", Маркировка_ПИ.ЭтотУзел_Код("ДанныеЧЗ"));
	
		Файлы = НайтиФайлы(КаталогЗагрузки, МаскаФайлов);
		Для Каждого Файл Из Файлы Цикл
			рЗагрузки = Справочники.ФР_ПакетыДанных.ПрочитатьПакет(Новый ДвоичныеДанные(Файл.ПолноеИмя));	
			Если рЗагрузки.Успешно Тогда
				ЗаписатьВремяПолучения(рЗагрузки.Данные);
				
				Сообщить("Прочитан пакет: " + рЗагрузки.Данные, СтатусСообщения.Важное);				
			Иначе
				МаркировкаКС.ВывестиОшибки(рЗагрузки);
			КонецЕсли;
		КонецЦикла;
	
		ХранилищеОбщихНастроек.Сохранить("Справочник.ФР_ПакетыДанных", "КаталогЗагрузки", КаталогЗагрузки);		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВремяПолучения(Пакет)
	РегистрыСведений.СостояниеПакетовОбмена.ОбновитьСтатусПакета(Пакет, Новый Структура("ДатаПолучения", ТекущаяДата()));
КонецПроцедуры

&НаКлиенте
Функция ВыборКаталога_(Каталог, ПроверятьСуществование = Ложь) Экспорт
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	
	ДиалогВФ = Новый ДиалогВыбораФайла(Режим);
	
	ДиалогВФ.Заголовок						=	"Выберите каталог";
	ДиалогВФ.ПроверятьСуществованиеФайла	=	ПроверятьСуществование;
	ДиалогВФ.Каталог						= 	Каталог;
	
	Результат = "";  
	Если ДиалогВФ.Выбрать() Тогда
		Результат = ДиалогВФ.Каталог;	
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции //ВыборКаталога_(Каталог, ПроверятьСуществование = Ложь) Экспорт

