Функция УправляемыйРежим() Экспорт
    Если НЕ ТранзакцияАктивна() Тогда
        Возврат Ложь;
	КонецЕсли;    
	
	Если Метаданные.РежимУправленияБлокировкойДанных = Метаданные.СвойстваОбъектов.РежимУправленияБлокировкойДанныхПоУмолчанию.Управляемый Тогда
		Возврат Истина;       
	ИначеЕсли Метаданные.РежимУправленияБлокировкойДанных = Метаданные.СвойстваОбъектов.РежимУправленияБлокировкойДанныхПоУмолчанию.Автоматический Тогда	
		Возврат Ложь;
	КонецЕсли;	
	
	Попытка
        НачатьТранзакцию(РежимУправленияБлокировкойДанных.Автоматический);
        ЗафиксироватьТранзакцию();
    Исключение
        Возврат Истина;
    КонецПопытки; 
    Возврат Ложь;	
КонецФункции
Функция БлокировкаПоОбъекту(Ссылка,Отказ=Ложь) Экспорт  
	Если Ссылка = Неопределено Тогда 
		Отказ = Истина;
		Возврат Ложь;
	КонецЕсли;             
	ВидОбъекта = Ссылка.Метаданные().Имя;    
	Если ПроведениеС.УправляемыйРежим() Тогда
		Блокировка = Новый БлокировкаДанных; 
		
		Если ВидОбъекта = "АвансовыйОтчет" Тогда  
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	Док.Сотрудник КАК Контрагент,
			                      |	Док.Договор КАК Договор,
			                      |	ДокТч.Подразделение КАК Подразделение,
			                      |	ДокТч.СтатьяЗатрат КАК СтатьяЗатрат
			                      |ИЗ
			                      |	Документ.АвансовыйОтчет КАК Док
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АвансовыйОтчет.Затраты КАК ДокТч
			                      |		ПО (ДокТч.Ссылка = Док.Ссылка)
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Затраты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Подразделение", "Подразделение");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("СтатьяЗатрат", "СтатьяЗатрат");
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Взаиморасчеты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Контрагент", "Контрагент");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Договор", "Договор");
		ИначеЕсли ВидОбъекта = "АктПриемки" Тогда  //не закончен
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	Док.Номенклатура КАК Номенклатура
			                      |ИЗ
			                      |	Документ.АктПриемки.Товары КАК Док
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка
			                      |	И НЕ Док.Отправлено = Док.Принято");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасхожденияПоАкту");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
		ИначеЕсли ВидОбъекта = "Взаимозачет" Тогда  
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	Док.Контрагент_Дебитор КАК Контрагент,
			                      |	Док.Договор_Дебитор КАК Договор
			                      |ИЗ
			                      |	Документ.Взаимозачет КАК Док
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка
			                      |
			                      |ОБЪЕДИНИТЬ
			                      |
			                      |ВЫБРАТЬ
			                      |	Док.Контрагент_Кредитор,
			                      |	Док.Договор_Кредитор
			                      |ИЗ
			                      |	Документ.Взаимозачет КАК Док
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка
			                      |
			                      |ОБЪЕДИНИТЬ
			                      |
			                      |ВЫБРАТЬ
			                      |	Док.Контрагент_Дебитор,
			                      |	Док.Договор_Дебитор
			                      |ИЗ
			                      |	Документ.Взаимозачет.Взаимозачеты КАК Док
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка
			                      |
			                      |ОБЪЕДИНИТЬ
			                      |
			                      |ВЫБРАТЬ
			                      |	Док.Контрагент_Кредитор,
			                      |	Док.Договор_Кредитор
			                      |ИЗ
			                      |	Документ.Взаимозачет.Взаимозачеты КАК Док
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Взаиморасчеты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Контрагент", "Контрагент");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Договор", "Договор");
		ИначеЕсли ВидОбъекта = "ВозвратОборудования"  Тогда  
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ДокТЧ.Номенклатура КАК Номенклатура,
			                      |	Док.Сотрудник КАК Сотрудник
			                      |ИЗ
			                      |	Документ.ВозвратОборудования.Товары КАК ДокТЧ
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратОборудования КАК Док
			                      |		ПО (Док.Ссылка = ДокТЧ.Ссылка)
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Оборудование");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сотрудник", "Сотрудник");
		ИначеЕсли ВидОбъекта = "ВыдачаОборудования"  Тогда  
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ДокТЧ.Номенклатура КАК Номенклатура,
			                      |	Док.Сотрудник КАК Сотрудник
			                      |ИЗ
			                      |	Документ.ВыдачаОборудования.Товары КАК ДокТЧ
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыдачаОборудования КАК Док
			                      |		ПО (Док.Ссылка = ДокТЧ.Ссылка)
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Оборудование");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сотрудник", "Сотрудник");
		ИначеЕсли ВидОбъекта = "ДвижениеТовараВнешнегоКонтрагента"  Тогда  
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ДокТЧ.Номенклатура КАК Номенклатура,
			                      |	Док.Контрагент КАК Контрагент
			                      |ИЗ
			                      |	Документ.ДвижениеТовараВнешнегоКонтрагента.Товары КАК ДокТЧ
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДвижениеТовараВнешнегоКонтрагента КАК Док
			                      |		ПО (Док.Ссылка = ДокТЧ.Ссылка)
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиТМЦВнешние");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
			//ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Контрагент", "Контрагент");
		ИначеЕсли ВидОбъекта = "ДвиженияДенежныхСредств"  Тогда  
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ДокТЧ.Контрагент КАК Контрагент,
			                      |	ДокТЧ.Договор КАК Договор,
			                      |	ДокТЧ.Подразделение КАК Подразделение,
			                      |	ДокТЧ.СтатьяДДС КАК СтатьяЗатрат,
			                      |	ДокТЧ.Подразделение.Сейф КАК БанковскийСчет
			                      |ИЗ
			                      |	Документ.ДвиженияДенежныхСредств.Платежи КАК ДокТЧ
			                      |ГДЕ
			                      |	ДокТЧ.Ссылка = &Ссылка
			                      |
			                      |ОБЪЕДИНИТЬ
			                      |
			                      |ВЫБРАТЬ
			                      |	ДокТЧ.ФизЛицо,
			                      |	ДокТЧ.Договор,
			                      |	ДокТЧ.Подразделение,
			                      |	ДокТЧ.СтатьяДДС,
			                      |	ДокТЧ.Подразделение.Сейф
			                      |ИЗ
			                      |	Документ.ДвиженияДенежныхСредств.Платежи КАК ДокТЧ
			                      |ГДЕ
			                      |	ДокТЧ.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();            
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Затраты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			//ЭлементБлокировки.ИсточникДанных = ТБлок;
			//ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Подразделение", "Подразделение");
			//ЭлементБлокировки.ИспользоватьИзИсточникаДанных("СтатьяЗатрат", "СтатьяЗатрат");   
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Взаиморасчеты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Контрагент", "Контрагент");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Договор", "Договор");

			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ДенежныеСредства");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			//ЭлементБлокировки.ИсточникДанных = ТБлок;
			//ЭлементБлокировки.ИспользоватьИзИсточникаДанных("БанковскийСчет", "БанковскийСчет");
		ИначеЕсли ВидОбъекта = "ДоставкаСобственнымТранспортом"  Тогда  
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РаспределениеУСОпоНакладным");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ИначеЕсли ВидОбъекта = "ЗаданиеНабора"  Тогда  
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ДокТЧ.Номенклатура КАК Номенклатура,
			                      |	Док.Склад КАК Склад
			                      |ИЗ
			                      |	Документ.Заказ.Товары КАК ДокТЧ
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заказ КАК Док
			                      |		ПО (Док.Ссылка = ДокТЧ.Ссылка)
			                      |ГДЕ
			                      |	ДокТЧ.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РезервыТМЦ");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");     
			
		ИначеЕсли ВидОбъекта = "ЗаданиеНаМаркировку"  Тогда  
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	Док.ШтрихкодУпаковки КАК ШтрихКодУпаковки,
			                      |	ЕСТЬNULL(СпрНоменклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура
			                      |ИЗ
			                      |	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок КАК Док
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК СпрШК
			                      |		ПО (СпрШК.Ссылка = Док.ШтрихкодУпаковки)
			                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
			                      |		ПО (СпрНоменклатура.Ссылка = СпрШК.Владелец)
			                      |			И (СпрШК.ТипКода В (ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор)))
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СтатусыКМ_Факт");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ШтрихКодУпаковки", "ШтрихКодУпаковки");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");     
			
		ИначеЕсли ВидОбъекта = "ЗаданиеНаСборкуКомплектовЧЗ"  Тогда  
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	Док.ШтрихкодУпаковки КАК ШтрихКодУпаковки,
			                      |	ЕСТЬNULL(СпрНоменклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура
			                      |ИЗ
			                      |	Документ.ЗаданиеНаСборкуКомплектовЧЗ.ШтрихкодыУпаковок КАК Док
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК СпрШК
			                      |		ПО (СпрШК.Ссылка = Док.ШтрихкодУпаковки)
			                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
			                      |		ПО (СпрНоменклатура.Ссылка = Док.ШтрихкодУпаковки.Владелец)
			                      |			И (СпрШК.ТипКода В (ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор)))
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка
			                      |
			                      |ОБЪЕДИНИТЬ
			                      |
			                      |ВЫБРАТЬ
			                      |	Док.ШтрихкодКоробки,
			                      |	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			                      |ИЗ
			                      |	Документ.ЗаданиеНаСборкуКомплектовЧЗ.ШтрихкодыУпаковок КАК Док
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК СпрШК
			                      |		ПО Док.ШтрихкодКоробки = СпрШК.Ссылка
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СтатусыКМ_Факт");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ШтрихКодУпаковки", "ШтрихКодУпаковки");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");     
			
		ИначеЕсли ВидОбъекта = "Заказ"  Тогда  
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ДокТЧ.Номенклатура КАК Номенклатура,
			                      |	Док.Склад КАК Склад
			                      |ИЗ
			                      |	Документ.Заказ.Товары КАК ДокТЧ
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заказ КАК Док
			                      |		ПО (Док.Ссылка = ДокТЧ.Ссылка)
			                      |ГДЕ
			                      |	ДокТЧ.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РезервыТМЦ");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");     
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ДокТЧ.Номенклатура КАК Номенклатура,
			                      |	Док.Контрагент КАК Контрагент
			                      |ИЗ
			                      |	Документ.Заказ.Товары КАК ДокТЧ
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заказ КАК Док
			                      |		ПО (Док.Ссылка = ДокТЧ.Ссылка)
			                      |ГДЕ
			                      |	ДокТЧ.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ЗаказыКонтрагентов");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Контрагент", "Контрагент");
		ИначеЕсли ВидОбъекта = "ЗаказНаЭмиссиюКодовМаркировкиСУЗ"  Тогда  
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	СпрШК.Ссылка КАК ШтрихКодУпаковки,
			                      |	ВЫБОР
			                      |		КОГДА СпрШК.ТипКода В (ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор))
			                      |			ТОГДА СпрШК.Ссылка.Владелец
			                      |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			                      |	КОНЕЦ КАК Номенклатура
			                      |ИЗ
			                      |	Справочник.ШтрихкодыУпаковокТоваров КАК СпрШК
			                      |ГДЕ
			                      |	СпрШК.ЗаказКМ = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СтатусыКМ_Факт");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ШтрихКодУпаковки", "ШтрихКодУпаковки");   
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СтатусыКМ_ЧЗ");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ШтрихКодУпаковки", "ШтрихКодУпаковки");     
		ИначеЕсли ВидОбъекта = "ЗаказПоставщику" Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ДокТЧ.Номенклатура КАК Номенклатура,
			                      |	Док.Склад КАК Склад,
			                      |	Док.Ссылка КАК Заказ
			                      |ИЗ
			                      |	Документ.ЗаказПоставщику.Товары КАК ДокТЧ
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК Док
			                      |		ПО (Док.Ссылка = ДокТЧ.Ссылка)
			                      |ГДЕ
			                      |	ДокТЧ.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ЗаказыПоставщикам");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");   
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Заказ", "Заказ");   
			
		ИначеЕсли ВидОбъекта = "ЗаявкаВТранспортныйОтдел" Тогда
		ИначеЕсли ВидОбъекта = "ЗаявкаНаПередачуКарточекНоменклатурыВЧЗ" Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ДокТЧ.Номенклатура КАК Номенклатура,
			                      |	Док.Организация КАК Организация
			                      |ИЗ
			                      |	Документ.ЗаявкаНаПередачуКарточекНоменклатурыВЧЗ.Товары КАК ДокТЧ
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаПередачуКарточекНоменклатурыВЧЗ КАК Док
			                      |		ПО ДокТЧ.Ссылка = Док.Ссылка
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СтатусыНоменклатуры_ЧЗ");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура"); 
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Организация", "Организация"); 
		ИначеЕсли ВидОбъекта = "ЗаявкаНаПерепаковку" Тогда
		ИначеЕсли ВидОбъекта = "ЗаявкаНаПроизводство" Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ДокТЧ.Номенклатура КАК Номенклатура,
			                      |	Док.Склад КАК Склад,
			                      |	Док.Ссылка КАК Заказ
			                      |ИЗ
			                      |	Документ.ЗаявкаНаПроизводство.Товары КАК ДокТЧ
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаПроизводство КАК Док
			                      |		ПО ДокТЧ.Ссылка = Док.Ссылка
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ЗаказыПоставщикам");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура"); 
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Заказ", "Заказ"); 
			
		ИначеЕсли ВидОбъекта = "ЗаявкаНаТСД" Тогда
		ИначеЕсли ВидОбъекта = "Инвентаризация" Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	Док.Склад КАК Склад,
			                      |	ДокТЧ.Номенклатура КАК Номенклатура
			                      |ИЗ
			                      |	Документ.Инвентаризация КАК Док
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Инвентаризация.Товары КАК ДокТЧ
			                      |		ПО (ДокТЧ.Ссылка = Док.Ссылка)
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиТМЦ");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");    

			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Затраты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ИначеЕсли ВидОбъекта = "Комплектация" Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ДокТЧ.Номенклатура КАК Номенклатура,
			                      |	Док.Склад КАК Склад
			                      |ИЗ
			                      |	Документ.Комплектация.Товары КАК ДокТЧ
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Комплектация КАК Док
			                      |		ПО ДокТЧ.Ссылка = Док.Ссылка
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка
			                      |
			                      |ОБЪЕДИНИТЬ
			                      |
			                      |ВЫБРАТЬ
			                      |	ДокТЧ.Номенклатура,
			                      |	Док.Склад
			                      |ИЗ
			                      |	Документ.Комплектация.Комплектующие КАК ДокТЧ
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Комплектация КАК Док
			                      |		ПО ДокТЧ.Ссылка = Док.Ссылка
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиТМЦ");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура"); 
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РезервыТМЦ");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
		ИначеЕсли ВидОбъекта = "КонтрактСПроизводителем" Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ДокТЧ.Номенклатура КАК Номенклатура,
			                      |	Док.Склад КАК Склад,
			                      |	Док.Ссылка КАК Заказ
			                      |ИЗ
			                      |	Документ.КонтрактСПроизводителем.Товары КАК ДокТЧ
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонтрактСПроизводителем КАК Док
			                      |		ПО ДокТЧ.Ссылка = Док.Ссылка
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок_ЗаказыПоставщикам = Запрос.Выполнить().Выгрузить();
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ЗаказыПоставщикам");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок_ЗаказыПоставщикам;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура"); 
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Заказ", "Заказ"); 
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	Док.Контракт КАК Контракт,
			                      |	ДокТЧ.Номенклатура КАК Номенклатура,
			                      |	ДокТЧ.Им7 КАК Партия,
			                      |	Док.Склад КАК Склад
			                      |ИЗ
			                      |	Документ.КонтрактСПроизводителем.ТоварыПартии КАК ДокТЧ
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонтрактСПроизводителем КАК Док
			                      |		ПО ДокТЧ.Ссылка = Док.Ссылка
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок_ЗаказыПоставщикам = Запрос.Выполнить().Выгрузить();
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Партии");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок_ЗаказыПоставщикам;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Контракт", "Контракт");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура"); 
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Партия", "Партия"); 
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад"); 
		ИначеЕсли ВидОбъекта = "КорректировкаЗадолженности" Тогда  
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ДокТЧ.Контрагент КАК Контрагент,
			                      |	ДокТЧ.Договор КАК Договор,
			                      |	ДокТЧ.Подразделение КАК Подразделение,
			                      |	ДокТЧ.СтатьяЗатрат КАК СтатьяЗатрат
			                      |ИЗ
			                      |	Документ.КорректировкаЗадолженности.Расчеты КАК ДокТЧ
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаЗадолженности КАК Док
			                      |		ПО ДокТЧ.Ссылка = Док.Ссылка
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Затраты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("СтатьяЗатрат", "СтатьяЗатрат");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Подразделение", "Подразделение"); 

			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Взаиморасчеты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Контрагент", "Контрагент");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Договор", "Договор"); 
		ИначеЕсли ВидОбъекта = "КорректировкаЦенВНакладной" Тогда  
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	Док.ДокОснование.Подразделение КАК Подразделение,
			                      |	Док.ДокОснование.Контрагент.Ведущий КАК Контрагент,
			                      |	Док.ДокОснование.Договор КАК Договор,
			                      |	Док.Склад КАК Склад,
			                      |	ДокТЧ.Номенклатура КАК Номенклатура
			                      |ИЗ
			                      |	Документ.КорректировкаЦенВНакладной.Товары КАК ДокТЧ
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаЦенВНакладной КАК Док
			                      |		ПО ДокТЧ.Ссылка = Док.Ссылка
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Затраты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Подразделение", "Подразделение");

			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Взаиморасчеты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Контрагент", "Контрагент");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Договор", "Договор"); 

			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиТМЦ");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");    

		ИначеЕсли ВидОбъекта = "КоррекцияТоваров" Тогда  
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ДокТЧ.Номенклатура КАК Номенклатура,
			                      |	Док.ДокОснование.Склад КАК Склад
			                      |ИЗ
			                      |	Документ.КоррекцияТоваров.Товары КАК ДокТЧ
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КоррекцияТоваров КАК Док
			                      |		ПО ДокТЧ.Ссылка = Док.Ссылка
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка
			                      |
			                      |ОБЪЕДИНИТЬ
			                      |
			                      |ВЫБРАТЬ
			                      |	ДокТЧ.Номенклатура,
			                      |	Док.ДокОснование.Склад
			                      |ИЗ
			                      |	Документ.КоррекцияТоваров.ТоварыДоИзменения КАК ДокТЧ
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КоррекцияТоваров КАК Док
			                      |		ПО ДокТЧ.Ссылка = Док.Ссылка
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РезервыТМЦ");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура"); 
		ИначеЕсли ВидОбъекта = "ЛистЗагрузки" Тогда  
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ДокТЧ.ШККоробки КАК ШККоробки
			                      |ИЗ
			                      |	Документ.ЛистЗагрузки.ЛистыНабора КАК ДокТЧ
			                      |ГДЕ
			                      |	ДокТЧ.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();    
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиЗХ");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ШККоробки", "ШККоробки");
		ИначеЕсли ВидОбъекта = "ЛистНабора" Тогда  
		ИначеЕсли ВидОбъекта = "ЛистМаркировки" Тогда  
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	Док.ШтрихкодУпаковки КАК ШтрихКодУпаковки,
			                      |	ЕСТЬNULL(СпрНоменклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура
			                      |ИЗ
			                      |	Документ.ЛистМаркировки.ШтрихкодыУпаковок КАК Док
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК СпрШК
			                      |		ПО (СпрШК.Ссылка = Док.ШтрихкодУпаковки)
			                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
			                      |		ПО (СпрНоменклатура.Ссылка = СпрШК.Владелец)
			                      |			И (СпрШК.ТипКода В (ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор)))
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка
			                      |
			                      |ОБЪЕДИНИТЬ
			                      |
			                      |ВЫБРАТЬ
			                      |	Док.ШтрихкодУпаковки,
			                      |	ЕСТЬNULL(СпрНоменклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
			                      |ИЗ
			                      |	Документ.ЛистМаркировки.ШтрихкодыУпаковокРаспечатанная КАК Док
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК СпрШК
			                      |		ПО (СпрШК.Ссылка = Док.ШтрихкодУпаковки)
			                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
			                      |		ПО (СпрНоменклатура.Ссылка = СпрШК.Владелец)
			                      |			И (СпрШК.ТипКода В (ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор)))
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СтатусыКМ_Факт");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ШтрихКодУпаковки", "ШтрихКодУпаковки");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура"); 

		ИначеЕсли ВидОбъекта = "ЛистМаркировкиОстатков" Тогда  
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	Док.ШтрихкодУпаковки КАК ШтрихКодУпаковки,
			                      |	ЕСТЬNULL(СпрНоменклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура
			                      |ИЗ
			                      |	Документ.ЛистМаркировкиОстатков.ШтрихкодыУпаковок КАК Док
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК СпрШК
			                      |		ПО (СпрШК.Ссылка = Док.ШтрихкодУпаковки)
			                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
			                      |		ПО (СпрНоменклатура.Ссылка = СпрШК.Владелец)
			                      |			И (СпрШК.ТипКода В (ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор)))
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка
			                      |
			                      |ОБЪЕДИНИТЬ
			                      |
			                      |ВЫБРАТЬ
			                      |	Док.ШтрихкодКоробки,
			                      |	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			                      |ИЗ
			                      |	Документ.ЛистМаркировкиОстатков.ШтрихкодыУпаковок КАК Док
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК СпрШК
			                      |		ПО Док.ШтрихкодКоробки = СпрШК.Ссылка
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СтатусыКМ_Факт");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ШтрихКодУпаковки", "ШтрихКодУпаковки");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура"); 

		ИначеЕсли ВидОбъекта = "ЛистПереукладки" Тогда  
		ИначеЕсли ВидОбъекта = "ЛистСборкиКомплектовЧЗ" Тогда  
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	Док.ШтрихкодУпаковки КАК ШтрихКодУпаковки,
			                      |	ЕСТЬNULL(СпрНоменклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура
			                      |ИЗ
			                      |	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК Док
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК СпрШК
			                      |		ПО (СпрШК.Ссылка = Док.ШтрихкодУпаковки)
			                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
			                      |		ПО (СпрНоменклатура.Ссылка = СпрШК.Владелец)
			                      |			И (СпрШК.ТипКода В (ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор)))
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка
			                      |
			                      |ОБЪЕДИНИТЬ
			                      |
			                      |ВЫБРАТЬ
			                      |	Док.ШтрихкодКоробки,
			                      |	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			                      |ИЗ
			                      |	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК Док
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК СпрШК
			                      |		ПО Док.ШтрихкодКоробки = СпрШК.Ссылка
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СтатусыКМ_Факт");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ШтрихКодУпаковки", "ШтрихКодУпаковки");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура"); 

			//ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиДоступныхКМ");
			//ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			//ЭлементБлокировки.ИсточникДанных = ТБлок;
			//ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура"); 
		ИначеЕсли ВидОбъекта = "МаркировкаТоваровИСМП" Тогда  
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ДокТЧ.ШтрихкодУпаковки КАК ШтрихКодУпаковки,
			                      |	ЕСТЬNULL(СпрНоменклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура
			                      |ИЗ
			                      |	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК ДокТЧ
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК СпрШК
			                      |		ПО (СпрШК.Ссылка = ДокТЧ.ШтрихкодУпаковки)
			                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
			                      |		ПО (СпрНоменклатура.Ссылка = СпрШК.Владелец)
			                      |			И (СпрШК.ТипКода В (ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор)))
			                      |ГДЕ
			                      |	ДокТЧ.Ссылка = &Ссылка
			                      |
			                      |ОБЪЕДИНИТЬ
			                      |
			                      |ВЫБРАТЬ
			                      |	ДокТЧ.ШтрихкодНабора,
			                      |	ЕСТЬNULL(СпрНоменклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
			                      |ИЗ
			                      |	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК ДокТЧ
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК СпрШК
			                      |		ПО (СпрШК.Ссылка = ДокТЧ.ШтрихкодНабора)
			                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
			                      |		ПО (СпрНоменклатура.Ссылка = СпрШК.Владелец)
			                      |			И (СпрШК.ТипКода В (ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор)))
			                      |ГДЕ
			                      |	ДокТЧ.Ссылка = &Ссылка
			                      |
			                      |ОБЪЕДИНИТЬ
			                      |
			                      |ВЫБРАТЬ
			                      |	ДокТЧ.ШтрихкодКоробки,
			                      |	ЕСТЬNULL(СпрНоменклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
			                      |ИЗ
			                      |	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК ДокТЧ
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК СпрШК
			                      |		ПО (СпрШК.Ссылка = ДокТЧ.ШтрихкодКоробки)
			                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
			                      |		ПО (СпрНоменклатура.Ссылка = СпрШК.Владелец)
			                      |			И (СпрШК.ТипКода В (ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор)))
			                      |ГДЕ
			                      |	ДокТЧ.Ссылка = &Ссылка
			                      |
			                      |ОБЪЕДИНИТЬ
			                      |
			                      |ВЫБРАТЬ
			                      |	ДокТЧ.ШтрихкодКоробки,
			                      |	ЕСТЬNULL(СпрНоменклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
			                      |ИЗ
			                      |	Документ.МаркировкаТоваровИСМП.ШтрихкодыКоробок КАК ДокТЧ
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК СпрШК
			                      |		ПО (СпрШК.Ссылка = ДокТЧ.ШтрихкодКоробки)
			                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
			                      |		ПО (СпрНоменклатура.Ссылка = СпрШК.Владелец)
			                      |			И (СпрШК.ТипКода В (ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор)))
			                      |ГДЕ
			                      |	ДокТЧ.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СтатусыКМ_Факт");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ШтрихКодУпаковки", "ШтрихКодУпаковки");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");

			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СтатусыКМ_ЧЗ");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ШтрихКодУпаковки", "ШтрихКодУпаковки");
		ИначеЕсли ВидОбъекта = "Машина" Тогда  
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ДокТЧ.Контрагент КАК Контрагент,
			                      |	ДокТЧ.Договор КАК Договор,
			                      |	ДокТЧ.Подразделение КАК Подразделение,
			                      |	ДокТЧ.СтатьяЗатрат КАК СтатьяЗатрат
			                      |ИЗ
			                      |	Документ.КорректировкаЗадолженности.Расчеты КАК ДокТЧ
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаЗадолженности КАК Док
			                      |		ПО ДокТЧ.Ссылка = Док.Ссылка
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Затраты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("СтатьяЗатрат", "СтатьяЗатрат");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Подразделение", "Подразделение"); 

			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Взаиморасчеты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Контрагент", "Контрагент");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Договор", "Договор"); 
		ИначеЕсли ВидОбъекта = "ОплатаЧерезККМ" Тогда  
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	Док.Контрагент КАК Контрагент,
			                      |	Док.Договор КАК Договор
			                      |ИЗ
			                      |	Документ.ОплатаЧерезККМ КАК Док
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.АвансыЧерезККМ");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Контрагент", "Контрагент");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Договор", "Договор");
		ИначеЕсли ВидОбъекта = "ОприходованиеТМЦ" Тогда  
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ДокТЧ.Номенклатура КАК Номенклатура,
			                      |	Док.Склад КАК Склад
			                      |ИЗ
			                      |	Документ.ОприходованиеТМЦ.Товары КАК ДокТЧ
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОприходованиеТМЦ КАК Док
			                      |		ПО ДокТЧ.Ссылка = Док.Ссылка
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка
			                      |
			                      |");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РезервыТМЦ");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиТМЦ");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура"); 
		ИначеЕсли ВидОбъекта = "ОтчетАгента" Тогда  
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	Док.Контрагент КАК Контрагент,
			                      |	Док.ДоговорВознаграждения КАК ДоговорВознаграждения
			                      |ИЗ
			                      |	Документ.ОтчетАгента КАК Док
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка
			                      |
			                      |ОБЪЕДИНИТЬ
			                      |
			                      |ВЫБРАТЬ
			                      |	Док.Контрагент.Ведущий,
			                      |	Док.ДоговорВознаграждения
			                      |ИЗ
			                      |	Документ.ОтчетАгента КАК Док
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК СпрК
			                      |		ПО (СпрК.Ссылка = Док.Контрагент.Ведущий)
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Затраты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Взаиморасчеты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Контрагент", "Контрагент");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Договор", "Договор");
		ИначеЕсли ВидОбъекта = "ОтчетКассовойСмены" Тогда  
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	Док_Товары.Номенклатура КАК Номенклатура,
			                      |	Док.Склад КАК Склад,
			                      |	Док.Подразделение КАК Подразделение
			                      |ИЗ
			                      |	Документ.ОтчетКассовойСмены.Товары КАК Док_Товары
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКассовойСмены КАК Док
			                      |		ПО Док_Товары.Ссылка = Док.Ссылка
			                      |			И (Док.Ссылка = &Ссылка)");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить(); 
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиТМЦ");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");    

			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Затраты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Подразделение", "Подразделение");
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Профит");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Подразделение", "Подразделение");
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Взаиморасчеты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			//ЭлементБлокировки.ИсточникДанных = ТБлок;
			//ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Контрагент", "Контрагент");
			//ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Договор", "Договор");

			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Продажи");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Подразделение", "Подразделение");
		ИначеЕсли ВидОбъекта = "ОтчетКомиссионера" Тогда  
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	Док_Товары.Номенклатура КАК Номенклатура,
			                      |	Док.Склад КАК Склад,
			                      |	Док.Контрагент КАК Контрагент,
			                      |	Док.Договор КАК Договор,
			                      |	Док.Подразделение КАК Подразделение
			                      |ИЗ
			                      |	Документ.ОтчетКомиссионера.Товары КАК Док_Товары
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионера КАК Док
			                      |		ПО Док_Товары.Ссылка = Док.Ссылка
			                      |			И (Док.Ссылка = &Ссылка)");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить(); 
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиТМЦКомиссия");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");    
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиТМЦ");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");    

			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Затраты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Подразделение", "Подразделение");
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Взаиморасчеты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Контрагент", "Контрагент");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Договор", "Договор");
		ИначеЕсли ВидОбъекта = "Паллета" Тогда //пока так, потом переделать 

			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ДокТЧ.ШКЛистаНабора КАК ШККоробки
			                      |ИЗ
			                      |	Документ.Паллета.ЛистыНабора КАК ДокТЧ
			                      |ГДЕ
			                      |	ДокТЧ.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();    
			Запрос.Текст = "ВЫБРАТЬ
			                      |	ДокТЧ.Номенклатура КАК Номенклатура
			                      |ИЗ
			                      |	Документ.Паллета.Товары КАК ДокТЧ
			                      |ГДЕ
			                      |	ДокТЧ.Ссылка = &Ссылка
			                      |
			                      |";
			ТБлок2 = Запрос.Выполнить().Выгрузить();    
		
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиЗХ");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ШККоробки", "ШККоробки");
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.АдресноеХранениеОстатки");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;              
			ЭлементБлокировки.ИсточникДанных = ТБлок2;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
			
		ИначеЕсли ВидОбъекта = "ПереводСредств" Тогда  
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ДенежныеСредства");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ИначеЕсли ВидОбъекта = "Перемещение" Тогда  
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ДокТЧ.Номенклатура КАК Номенклатура,
			                      |	Док.Склад КАК Склад
			                      |ИЗ
			                      |	Документ.Перемещение.Товары КАК ДокТЧ
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Перемещение КАК Док
			                      |		ПО ДокТЧ.Ссылка = Док.Ссылка
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка
			                      |
			                      |ОБЪЕДИНИТЬ
			                      |
			                      |ВЫБРАТЬ
			                      |	ДокТЧ.Номенклатура,
			                      |	Док.Склад
			                      |ИЗ
			                      |	Документ.Перемещение.Упаковка КАК ДокТЧ
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Перемещение КАК Док
			                      |		ПО ДокТЧ.Ссылка = Док.Ссылка
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка
			                      |
			                      |ОБЪЕДИНИТЬ
			                      |
			                      |ВЫБРАТЬ
			                      |	ДокТЧ.Номенклатура,
			                      |	Док.Склад
			                      |ИЗ
			                      |	Документ.Перемещение.РасходныеМатериалы КАК ДокТЧ
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Перемещение КАК Док
			                      |		ПО ДокТЧ.Ссылка = Док.Ссылка
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка
			                      |
			                      |ОБЪЕДИНИТЬ
			                      |
			                      |ВЫБРАТЬ
			                      |	ДокТЧ.Номенклатура,
			                      |	Док.СкладПолучатель
			                      |ИЗ
			                      |	Документ.Перемещение.Товары КАК ДокТЧ
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Перемещение КАК Док
			                      |		ПО ДокТЧ.Ссылка = Док.Ссылка
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка
			                      |
			                      |ОБЪЕДИНИТЬ ВСЕ
			                      |
			                      |ВЫБРАТЬ
			                      |	ДокТЧ.Номенклатура,
			                      |	Док.СкладПолучатель
			                      |ИЗ
			                      |	Документ.Перемещение.Упаковка КАК ДокТЧ
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Перемещение КАК Док
			                      |		ПО ДокТЧ.Ссылка = Док.Ссылка
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка
			                      |
			                      |ОБЪЕДИНИТЬ ВСЕ
			                      |
			                      |ВЫБРАТЬ
			                      |	ДокТЧ.Номенклатура,
			                      |	Док.СкладПолучатель
			                      |ИЗ
			                      |	Документ.Перемещение.РасходныеМатериалы КАК ДокТЧ
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Перемещение КАК Док
			                      |		ПО ДокТЧ.Ссылка = Док.Ссылка
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиТМЦ");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура"); 
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РезервыТМЦ");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
		ИначеЕсли ВидОбъекта = "Переоценка" Тогда  
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиТМЦ");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Затраты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ИначеЕсли ВидОбъекта = "ПланПродаж" Тогда  
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ПланПродаж");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ИначеЕсли ВидОбъекта = "ПланПродажПоКлиентам" Тогда  
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ПланПродажПоКлиентам");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ИначеЕсли ВидОбъекта = "ПоступлениеВЗонуХранения" Тогда  

			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ДокТЧ.ШККоробки КАК ШККоробки
			                      |ИЗ
			                      |	Документ.ПоступлениеВЗонуХранения.Короба КАК ДокТЧ
			                      |ГДЕ
			                      |	ДокТЧ.Ссылка = &Ссылка
			                      |
			                      |");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();    
		
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиЗХ");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ШККоробки", "ШККоробки");
			
		ИначеЕсли ВидОбъекта = "Посылка" Тогда  
		ИначеЕсли ВидОбъекта = "Претензия" Тогда  
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	Док.Контрагент КАК Контрагент,
			                      |	Док.Договор КАК Договор,
			                      |	Док.Склад КАК Склад,
			                      |	Док.ДОкОснование.СкладКомиссия КАК СкладКомиссия,
			                      |	ДокТЧ.Номенклатура КАК Номенклатура
			                      |ИЗ
			                      |	Документ.Претензия КАК Док
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Претензия.Товары КАК ДокТЧ
			                      |		ПО (ДокТЧ.Ссылка = Док.Ссылка)
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиТМЦКомиссия");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");    

			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиТМЦ");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "СкладКомиссия");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");    
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Затраты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Взаиморасчеты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;              
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Контрагент", "Контрагент");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Договор", "Договор");    
			
		ИначеЕсли ВидОбъекта = "ПриходнаяНакладная" Тогда  
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	Док_Товары.Номенклатура КАК Номенклатура,
			                      |	Док.Склад КАК Склад
			                      |ИЗ
			                      |	Документ.ПриходнаяНакладная.Товары КАК Док_Товары
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная КАК Док
			                      |		ПО Док_Товары.Ссылка = Док.Ссылка
			                      |			И (Док.Ссылка = &Ссылка)
			                      |
			                      |");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить(); 
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РезервыТМЦзабаланс");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");    
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиТМЦ");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");    
			
			ЗапросВз = Новый Запрос("ВЫБРАТЬ
			                        |	Док.Договор КАК Договор,
			                        |	Док.Контрагент КАК Контрагент,
			                        |	Док.Подразделение КАК Подразделение,
			                        |	Док.Подразделение.Сейф КАК БанковскийСчет
			                        |ИЗ
			                        |	Документ.ПриходнаяНакладная КАК Док
			                        |ГДЕ
			                        |	Док.Ссылка = &Ссылка
			                        |
			                        |ОБЪЕДИНИТЬ
			                        |
			                        |ВЫБРАТЬ
			                        |	Док.Договор,
			                        |	СпрКВ.Ссылка,
			                        |	Док.Подразделение,
			                        |	Док.Подразделение.Сейф
			                        |ИЗ
			                        |	Документ.ПриходнаяНакладная КАК Док
			                        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК СпрК
			                        |		ПО (СпрК.Ссылка = Док.Контрагент)
			                        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК СпрКВ
			                        |		ПО (СпрКВ.Ссылка = СпрК.Ведущий)
			                        |ГДЕ
			                        |	Док.Ссылка = &Ссылка");
			ЗапросВз.УстановитьПараметр("Ссылка",Ссылка);
			ТБлокВз = ЗапросВз.Выполнить().Выгрузить(); 
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Взаиморасчеты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;              
			ЭлементБлокировки.ИсточникДанных = ТБлокВз;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Контрагент", "Контрагент");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Договор", "Договор");    
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Взаиморасчеты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;              
			ЭлементБлокировки.ИсточникДанных = ТБлокВз;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Контрагент", "Контрагент");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Договор", "Договор");    

			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ДенежныеСредства");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;              
			ЭлементБлокировки.ИсточникДанных = ТБлокВз;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("БанковскийСчет", "БанковскийСчет");

			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Затраты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;              
			ЭлементБлокировки.ИсточникДанных = ТБлокВз;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Подразделение", "Подразделение");
		ИначеЕсли ВидОбъекта = "ПриходныйКассовыйОрдер" Тогда  
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Затраты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Взаиморасчеты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;              
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ДенежныеСредства");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ИначеЕсли ВидОбъекта = "Распределение" Тогда  
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.Распределение");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
		ИначеЕсли ВидОбъекта = "РасходнаяНакладная" Тогда  //не закончен
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	РНК_Товары.Номенклатура КАК Номенклатура,
			                      |	РНК.Склад КАК Склад
			                      |ИЗ
			                      |	Документ.РасходнаяНакладная.Товары КАК РНК_Товары
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РНК
			                      |		ПО РНК_Товары.Ссылка = РНК.Ссылка
			                      |			И (РНК_Товары.Ссылка = &Ссылка)
			                      |
			                      |ОБЪЕДИНИТЬ
			                      |
			                      |ВЫБРАТЬ
			                      |	РНК_Товары.Номенклатура,
			                      |	РНК.Склад
			                      |ИЗ
			                      |	Документ.РасходнаяНакладная.Комплектующие КАК РНК_Товары
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РНК
			                      |		ПО РНК_Товары.Ссылка = РНК.Ссылка
			                      |			И (РНК_Товары.Ссылка = &Ссылка)
			                      |
			                      |ОБЪЕДИНИТЬ
			                      |
			                      |ВЫБРАТЬ
			                      |	РНК_Товары.Номенклатура,
			                      |	РНК.Склад
			                      |ИЗ
			                      |	Документ.РасходнаяНакладная.Упаковка КАК РНК_Товары
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РНК
			                      |		ПО РНК_Товары.Ссылка = РНК.Ссылка
			                      |			И (РНК_Товары.Ссылка = &Ссылка)
			                      |
			                      |ОБЪЕДИНИТЬ
			                      |
			                      |ВЫБРАТЬ
			                      |	РНК_Товары.Номенклатура,
			                      |	РНК.Склад
			                      |ИЗ
			                      |	Документ.РасходнаяНакладная.РасходныеМатериалы КАК РНК_Товары
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РНК
			                      |		ПО РНК_Товары.Ссылка = РНК.Ссылка
			                      |			И (РНК_Товары.Ссылка = &Ссылка)
			                      |
			                      |ОБЪЕДИНИТЬ
			                      |
			                      |ВЫБРАТЬ
			                      |	РНК_Товары.Номенклатура,
			                      |	РНК.Склад
			                      |ИЗ
			                      |	Документ.РасходнаяНакладная.КомплектующиеУпаковки КАК РНК_Товары
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РНК
			                      |		ПО РНК_Товары.Ссылка = РНК.Ссылка
			                      |			И (РНК_Товары.Ссылка = &Ссылка)");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиТМЦ");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");

			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РезервыТМЦ");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
		ИначеЕсли ВидОбъекта = "РасходныйКассовыйОрдер" Тогда
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Затраты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Взаиморасчеты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;              
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ДенежныеСредства");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ИначеЕсли ВидОбъекта = "РекламационнаяНакладная" Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	Док.Склад КАК Склад,
			                      |	ДокТЧ.Номенклатура КАК Номенклатура
			                      |ИЗ
			                      |	Документ.РекламационнаяНакладная КАК Док
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РекламационнаяНакладная.Товары КАК ДокТЧ
			                      |		ПО ДокТЧ.Ссылка = Док.Ссылка
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиТМЦ");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");    
			
			Запрос2 = Новый Запрос("ВЫБРАТЬ
			                      |	Док.Корреспондент КАК Контрагент,
			                      |	Док.Корреспондент КАК Покупатель,
			                      |	Док.Договор КАК Договор,
			                      |	ДокТЧ.Номенклатура КАК Номенклатура
			                      |ИЗ
			                      |	Документ.РекламационнаяНакладная КАК Док
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РекламационнаяНакладная.Товары КАК ДокТЧ
			                      |		ПО ДокТЧ.Ссылка = Док.Ссылка
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос2.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок2 = Запрос2.Выполнить().Выгрузить();
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Взаиморасчеты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок2;
			//ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Контрагент", "Контрагент");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Договор", "Договор");
			
			//ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Профит");
			//ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			//ЭлементБлокировки.ИсточникДанных = ТБлок2;
			//ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Контрагент", "Контрагент");

			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Продажи");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок2;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Покупатель", "Покупатель");
		ИначеЕсли ВидОбъекта = "СписаниеКурсовыхРазниц" Тогда
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Взаиморасчеты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ДенежныеСредства");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ИначеЕсли ВидОбъекта = "СписаниеТМЦ" Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	Док.Склад КАК Склад,
			                      |	ДокТЧ.Номенклатура КАК Номенклатура
			                      |ИЗ
			                      |	Документ.СписаниеТМЦ КАК Док
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеТМЦ.Товары КАК ДокТЧ
			                      |		ПО ДокТЧ.Ссылка = Док.Ссылка
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок_Товары = Запрос.Выполнить().Выгрузить();
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиТМЦКомиссия");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок_Товары;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
			
 			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиТМЦ");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок_Товары;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");      

			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	Док.Подразделение КАК Подразделение,
			                      |	Док.СтатьяЗатрат КАК СтатьяЗатрат
			                      |ИЗ
			                      |	Документ.СписаниеТМЦ КАК Док
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок_Затраты = Запрос.Выполнить().Выгрузить();
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Затраты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок_Затраты;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Подразделение", "Подразделение");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("СтатьяЗатрат", "СтатьяЗатрат");      
		ИначеЕсли ВидОбъекта = "СписаниеТМЦСпути" Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	Док.ДокОснование КАК Заказ,
			                      |	ДокТЧ.Подразделение КАК Подразделение,
			                      |	ДокТЧ.СтатьяЗатрат КАК СтатьяЗатрат,
			                      |	ДокТЧ.Номенклатура КАК Номенклатура
			                      |ИЗ
			                      |	Документ.СписаниеТМЦСпути КАК Док
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеТМЦСпути.Товары КАК ДокТЧ
			                      |		ПО (ДокТЧ.Ссылка = Док.Ссылка)
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок_ТоварыВПути = Запрос.Выполнить().Выгрузить();
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыВПути");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок_ТоварыВПути;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Заказ", "Заказ");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");      
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Затраты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок_ТоварыВПути;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Подразделение", "Подразделение");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("СтатьяЗатрат", "СтатьяЗатрат");  
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	Док.Контрагент.Ведущий КАК Контрагент,
			                      |	Док.ДокОснование.Договор КАК Договор
			                      |ИЗ
			                      |	Документ.СписаниеТМЦСпути КАК Док
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеТМЦСпути.Товары КАК ДокТЧ
			                      |		ПО (ДокТЧ.Ссылка = Док.Ссылка)
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
			                      |		ПО (Контрагенты.Ссылка = Док.Контрагент.Ведущий)
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка
			                      |
			                      |ОБЪЕДИНИТЬ
			                      |
			                      |ВЫБРАТЬ
			                      |	Док.Контрагент,
			                      |	Док.ДокОснование.Договор
			                      |ИЗ
			                      |	Документ.СписаниеТМЦСпути КАК Док
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеТМЦСпути.Товары КАК ДокТЧ
			                      |		ПО (ДокТЧ.Ссылка = Док.Ссылка)
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка
			                      |
			                      |ОБЪЕДИНИТЬ
			                      |
			                      |ВЫБРАТЬ
			                      |	Док.Контрагент.Ведущий,
			                      |	Док.Договор
			                      |ИЗ
			                      |	Документ.СписаниеТМЦСпути КАК Док
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеТМЦСпути.Товары КАК ДокТЧ
			                      |		ПО (ДокТЧ.Ссылка = Док.Ссылка)
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
			                      |		ПО (Контрагенты.Ссылка = Док.Контрагент.Ведущий)
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка
			                      |
			                      |ОБЪЕДИНИТЬ
			                      |
			                      |ВЫБРАТЬ
			                      |	Док.Контрагент,
			                      |	Док.Договор
			                      |ИЗ
			                      |	Документ.СписаниеТМЦСпути КАК Док
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеТМЦСпути.Товары КАК ДокТЧ
			                      |		ПО (ДокТЧ.Ссылка = Док.Ссылка)
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка
			                      |
			                      |ОБЪЕДИНИТЬ
			                      |
			                      |ВЫБРАТЬ
			                      |	Док.КонтрагентКомпенсация,
			                      |	Док.ДоговорКомпенсация
			                      |ИЗ
			                      |	Документ.СписаниеТМЦСпути КАК Док
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок_Взаиморасчеты = Запрос.Выполнить().Выгрузить();
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Взаиморасчеты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок_Взаиморасчеты;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Контрагент", "Контрагент");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Договор", "Договор");  
		ИначеЕсли ВидОбъекта = "ТоварныйДокумент" Тогда
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиГТД");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
		ИначеЕсли ВидОбъекта = "УслугиСтороннихОрганизаций" Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	Док.КонтрагентЦБ КАК Контрагент,
			                      |	Док.Договор КАК Договор
			                      |ИЗ
			                      |	Документ.УслугиСтороннихОрганизаций КАК Док
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок_Взаиморасчеты = Запрос.Выполнить().Выгрузить();
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Взаиморасчеты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок_Взаиморасчеты;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Контрагент", "Контрагент");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Договор", "Договор");

			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	Док.КонтрагентЦБ КАК Контрагент,
			                      |	Док.Договор КАК Договор,
			                      |	ДокТЧ.СтатьяДДС КАК СтатьяЗатрат,
			                      |	ДокТЧ.Подразделение КАК Подразделение
			                      |ИЗ
			                      |	Документ.УслугиСтороннихОрганизаций КАК Док
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УслугиСтороннихОрганизаций.Услуги КАК ДокТЧ
			                      |		ПО Док.Ссылка = ДокТЧ.Ссылка
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок_Затраты = Запрос.Выполнить().Выгрузить();
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Затраты");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок_Затраты;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("СтатьяЗатрат", "СтатьяЗатрат");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Подразделение", "Подразделение");

			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РаспределениеУСОпоНакладным");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
		ИначеЕсли ВидОбъекта = "УстановкаСкидокПоКонтрагентам" Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ДокК.Контрагент КАК Контрагент,
			                      |	ДокС.Номенклатура КАК Номенклатура
			                      |ИЗ
			                      |	Документ.УстановкаСкидокПоКонтрагентам.Контрагенты КАК ДокК
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УстановкаСкидокПоКонтрагентам.Скидки КАК ДокС
			                      |		ПО ДокК.Ссылка = ДокС.Ссылка
			                      |ГДЕ
			                      |	ДокК.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СкидкиНоменклатурыКонтрагентов");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Контрагент", "Контрагент");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
		ИначеЕсли ВидОбъекта = "УстановкаШКGS1" Тогда
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.РезервированиеШКGS1");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ИначеЕсли ВидОбъекта = "ХранилищеКодовМаркировки" Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	Док.ШтрихкодУпаковки КАК ШтрихКодУпаковки,
			                      |	ЕСТЬNULL(СпрНоменклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура
			                      |ИЗ
			                      |	Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок КАК Док
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК СпрШК
			                      |		ПО (СпрШК.Ссылка = Док.ШтрихкодУпаковки)
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
			                      |		ПО (СпрНоменклатура.Ссылка = СпрШК.Владелец)
			                      |			И (СпрШК.ТипКода В (ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор)))
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка
			                      |
			                      |ОБЪЕДИНИТЬ
			                      |
			                      |ВЫБРАТЬ
			                      |	Док.ШтрихкодКоробки,
			                      |	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			                      |ИЗ
			                      |	Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок КАК Док
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК СпрШК
			                      |		ПО Док.ШтрихкодКоробки = СпрШК.Ссылка
			                      |ГДЕ
			                      |	Док.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТБлок = Запрос.Выполнить().Выгрузить();
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СтатусыКМ_Факт");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТБлок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ШтрихКодУпаковки", "ШтрихКодУпаковки");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
		ИначеЕсли ВидОбъекта = "ДДС_ВнешнихКонтрагентов" Тогда
		Иначе
			ЗаписатьВЛог_Костыль("ОшибкиБлокировки","Отсутствует правило блокировки по документу "+ВидОбъекта,"Ошибка",Истина);
		КонецЕсли;	
		
		Блокировка.Заблокировать();              
		ЗаписатьНачалоБлокировки(Ссылка,ОписаниеБлокировкиДанных(Блокировка));
		Возврат Истина;	
		
		Отказ = Истина;
		Возврат Ложь;	 
	Иначе         
		Возврат Истина;
	КонецЕсли;
КонецФункции
Функция ЗаписатьВЛог_Костыль(ИмяЛога,Сообщение,ТипСообщения,ВыводитьСообщения=Ложь,НастройкиОтчета=Неопределено,ВремяВыполнения=Неопределено)
	ПараметрыСеанса.НомерЗаписиЛога=ПараметрыСеанса.НомерЗаписиЛога+1;
	
	Запись=РегистрыСведений.Логи.СоздатьМенеджерЗаписи();
	
	Запись.Дата=ТекущаяДата();
	Если Метаданные.РегистрыСведений.Логи.Измерения.Найти("День")<>Неопределено Тогда
		Запись.День=Запись.Дата;
	КонецЕсли;		
	
	Запись.НомерЗаписи	=ПараметрыСеанса.НомерЗаписиЛога;
	Запись.ИмяЛога		=ИмяЛога;
	Запись.Автор		=ПараметрыСеанса.Пользователь;
	Запись.Сообщение	=Сообщение;
	Запись.ТипСообщения	=ТипСообщения;
	
	Запись.ДопИнфо			= Новый ХранилищеЗначения(НастройкиОтчета,Новый СжатиеДанных(9));
	Запись.ВремяВыполненния = ВремяВыполнения;

	Попытка
		Запись.Записать(Ложь);
		#ЕСЛИ КЛИЕНТ ТОГДА
			Если ВыводитьСообщения Тогда
				Сообщить(Сообщение);	
			КонецЕсли; 
		#КОНЕЦЕСЛИ
	Исключение
	КонецПопытки;
КонецФункции // ЗаписатьВЛог()

Функция КонтрольПоОбъекту(Ссылка,Отказ=Ложь) Экспорт
	Возврат Истина;
КонецФункции	

Функция ОписаниеБлокировкиДанных(Блокировка)
	Данные = Новый Массив;     
	Для каждого ЭлементБлокировки из Блокировка Цикл   
		ЗаписьДанныхБлокировки = Новый Структура;  
		
		ЗаписьДанныхБлокировки.Вставить("ОбластьБлокировок",ЭлементБлокировки.Область);	    
		
		ПоляБлокировки = Новый ТаблицаЗначений();  
		ПоляБлокировки.Колонки.Добавить("Поле");
		ПоляБлокировки.Колонки.Добавить("КолонкаИсточникаДанных");
		ПоляБлокировки.Колонки.Добавить("Значение");
		Для Каждого ПолеБлокировки Из ЭлементБлокировки.Поля Цикл    
			Поле = ПоляБлокировки.Добавить();
			ЗаполнитьЗначенияСвойств(Поле,ПолеБлокировки);
		КонецЦикла;	
		ЗаписьДанныхБлокировки.Вставить("ПоляБлокировок",ПоляБлокировки);	    
		
		Если ТипЗнч(ЭлементБлокировки.ИсточникДанных) = Тип("ТаблицаЗначений") Тогда  
			ЗаписьДанныхБлокировки.Вставить("ИсточникДанных",ЭлементБлокировки.ИсточникДанных.Скопировать());	
		//Валетов + 12,05,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-9601	
		//Иначе
		//	Сообщить("Ой");	 
		//Валетов -
		КонецЕсли;
		Данные.Добавить(ЗаписьДанныхБлокировки);
	КонецЦикла;	
	Возврат Данные;
КонецФункции	
Процедура ЗаписатьНачалоБлокировки(Источник,ОбъектыБлокировки) Экспорт
    Если НЕ ТранзакцияАктивна() Тогда
        Возврат;
	КонецЕсли;    
	Если Не ОбщегоНазначения_ПИ.ИспользоватьЗамерыТранзакций() Тогда 
	    Возврат;
	КонецЕсли;    
		
	ИдТранзакции = Новый УникальныйИдентификатор(); 
	
	Блокировка = Новый БлокировкаДанных; 
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ДанныеБлокировок");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Ид", ИдТранзакции);
	Блокировка.Заблокировать();      
	
	МЗ = РегистрыСведений.ДанныеБлокировок.СоздатьМенеджерЗаписи();
	МЗ.Ид = ИдТранзакции;
	МЗ.ВремяНачала = ТекущаяДата();  
	МЗ.Источник = Источник;  
	МЗ.Записать(Ложь);      
	
	ПараметрыФЗ = Новый Массив;
	ПараметрыФЗ.Добавить(ИдТранзакции);
	
	ФоновыеЗадания.Выполнить("ПроведениеС.ЗаписатьЗавершениеБлокировки",ПараметрыФЗ);        
КонецПроцедуры
Процедура ЗаписатьЗавершениеБлокировки(ИдБлокировки) Экспорт
	
	Блокировка = Новый БлокировкаДанных; 
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ДанныеБлокировок");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Ид", ИдБлокировки);
	Успешно = Ложь;
	пока не Успешно Цикл
		НачатьТранзакцию();
		Попытка
			Блокировка.Заблокировать();  
			МЗ = РегистрыСведений.ДанныеБлокировок.СоздатьМенеджерЗаписи();      
			МЗ.Ид = ИдБлокировки;
			МЗ.Прочитать();         
			Если НЕ МЗ.Ид = ИдБлокировки Тогда
				Возврат;
			КонецЕсли;	
			МЗ.ВремяЗавершения = ТекущаяДата();
			МЗ.Записать(Истина);    
			Успешно = Истина;    
			ЗафиксироватьТранзакцию();
		Исключение      
			ОтменитьТранзакцию();
		КонецПопытки;
		Попытка   
			ВызватьПаузу(1000);
		Исключение      
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры 
Процедура ОбработатьДанныеБлокировок(ТаблицаПараметров=Неопределено) Экспорт  
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1000
	                      |	ДанныеБлокировок.Ид КАК Ид
	                      |ИЗ
	                      |	РегистрСведений.ДанныеБлокировок КАК ДанныеБлокировок
	                      |ГДЕ
	                      |	НЕ ДанныеБлокировок.ВремяЗавершения = ДАТАВРЕМЯ(1, 1, 1)"); 
	
	ТабДанных = Запрос.Выполнить().Выгрузить();
	ЕстьДанные = ТабДанных.Количество()>0;  

	Блокировка = Новый БлокировкаДанных; 
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ДанныеБлокировок");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	Пока ЕстьДанные Цикл  
		Для каждого ИдБлокировки Из ТабДанных.ВыгрузитьКолонку("Ид") Цикл
			ЭлементБлокировки.УстановитьЗначение("Ид", ИдБлокировки);
			НачатьТранзакцию();
			
			Попытка
				Блокировка.Заблокировать();  
				
				МЗИсходный = РегистрыСведений.ДанныеБлокировок.СоздатьМенеджерЗаписи();      
				МЗИсходный.Ид = ИдБлокировки;
				МЗИсходный.Прочитать();   
				
				МЗ = РегистрыСведений.ДанныеБлокировокРасширенный.СоздатьМенеджерЗаписи();  
				ЗаполнитьЗначенияСвойств(Мз,МзИсходный);  
				МЗ.Продолжительность = МЗ.ВремяЗавершения - МЗ.ВремяНачала;  
				МЗ.Записать(Ложь);    
				
				МЗИсходный.Удалить();
				
				ЗафиксироватьТранзакцию();
			Исключение                    
				ОтменитьТранзакцию();
			конецПопытки;
		КонецЦикла;
		ТабДанных = Запрос.Выполнить().Выгрузить();
		ЕстьДанные = ТабДанных.Количество()>0;  
	КонецЦикла;	
	
КонецПроцедуры	

