Функция ПечатьЭтикетки (Ссылка) экспорт
	ТабДок=новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати="ДокументПосылка";
	Макет=ПолучитьМакет("ЭтикеткаШК");
	
	ОблЭтикетка=макет.ПолучитьОбласть("Строка");
	ЗаполнитьЗначенияСвойств(ОблЭтикетка.Параметры,Ссылка);
	ОблЭтикетка.Параметры.ДатаОтгрузки=Формат(ОблЭтикетка.Параметры.ДатаОтгрузки, "ДФ=dd.MM.yy");
	ТЗРНК=Ссылка.Содержимое.выгрузить(,"Документ");
	ТЗРНК.свернуть("Документ");
	
	
	
	ОблЭтикетка.Параметры.КоличествоНакладных = ТЗРНК.Количество();
	
	Для Каждого Рисунок Из ОблЭтикетка.Рисунки Цикл	
		ОбъектШК			=Рисунок.Объект;
		ОбъектШК.Сообщение	=ПолучитьРеквизитШапки(Ссылка,"ШКПосылки","Документ");
	КонецЦикла;
	// Кухарь А.Ю.  03.11.2022 начало
	запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ
	              |	ТЗ.Документ КАК Документ
	              |ПОМЕСТИТЬ ВремТЗ
	              |ИЗ
	              |	&ТЗ КАК ТЗ
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ВремТЗ.Документ.Номер КАК Документ
	              |ИЗ
	              |	ВремТЗ КАК ВремТЗ";
	запрос.УстановитьПараметр("ТЗ",ТЗРНК);
	Результат=запрос.Выполнить().Выгрузить();

	МассивНомеров=новый Массив;
	для каждого СтрТЗ из Результат цикл
		МассивНомеров.Добавить((СтрТЗ.Документ));
	КонецЦикла;
	ОблЭтикетка.Параметры.НомераНакладных=СтрСоединить(МассивНомеров,", ");
	// Кухарь А.Ю.  03.11.2022 конец
	
	
	 табдок.Вывести(ОблЭтикетка);
	 возврат ТабДок;
КонецФункции