
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	если ОбменДанными.Загрузка=Истина тогда Возврат;КонецЕсли;
	
	если ЭтоНовый() тогда
		если не ЗначениеЗаполнено(Автор) тогда
			Автор=ПараметрыСеанса.Пользователь;
		КонецЕсли;	
		если не ЗначениеЗаполнено(ШКПосылки) тогда
			ШКПосылки="pack"+Номер;
		КонецЕсли;
		
		если не ЗначениеЗаполнено(номер) тогда
			УстановитьНомерДокументаКлиентСервер(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
	если Модифицированность() тогда
		РасчитатьКоличествоВЛН();
	КонецЕсли;
	
КонецПроцедуры

Процедура РасчитатьКоличествоВЛН ()  экспорт
	запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ
	              |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛистПереукладки.НомерЗаказа) КАК КоличествоЗаказов,
	              |	ЛистПереукладки.ДокОснование КАК Документ
	              |ИЗ
	              |	Документ.ЛистПереукладки КАК ЛистПереукладки
	              |ГДЕ
	              |	ЛистПереукладки.Дата > &Дата
	              |	И ЛистПереукладки.Проведен
	              |	И ЛистПереукладки.НомерЗаказа <> """"
	              |	И ЛистПереукладки.ДокОснование в (&Документ)
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ЛистПереукладки.ДокОснование";
	
	 запрос.УстановитьПараметр("Дата",Константы.ДатаЗапретаРедактирования.Получить());	 
	 запрос.УстановитьПараметр("Документ",Содержимое.ВыгрузитьКолонку("Документ"));
	 
	 ТЗПлан=запрос.Выполнить().Выгрузить();
	 ТЗФакт=Содержимое.Выгрузить(,"Документ,НомерЗаказа");
	 ТЗФакт.Свернуть("Документ,НомерЗаказа");
	 
	 Для каждого СтрТЧ из Содержимое цикл
		СтрТЗПлан=ТЗПлан.Найти(СтрТЧ.Документ,"Документ");
		если СтрТЗПлан<>Неопределено тогда
			СтрТЧ.ЗаказовВЛНПлан=СтрТЗПлан.КоличествоЗаказов;
		иначе
			СтрТЧ.ЗаказовВЛНПлан=0;
		КонецЕсли;
		
		
		СтрТЧ.ЗаказовВЛНФакт=ТЗФакт.НайтиСтроки(новый Структура("Документ",СтрТЧ.Документ)).Количество();

		
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Содержимое.Очистить();
	Автор=ПараметрыСеанса.Пользователь;
КонецПроцедуры
