Функция ПолучитьЗначениеПараметра(СтруктураПараметров,Имя,ЗначениеПоУмолчанию=Неопределено) Экспорт
	Результат	= ЗначениеПоУмолчанию;
	Если ТипЗнч(СтруктураПараметров)=Тип("Структура") ИЛИ ТипЗнч(СтруктураПараметров)=Тип("ФиксированнаяСтруктура") Тогда
		ВремЗнач=Неопределено;
		Если СтруктураПараметров.Свойство(Имя,ВремЗнач) Тогда
			Результат	= ВремЗнач;		
		КонецЕсли; 
	ИначеЕсли ТипЗнч(СтруктураПараметров)=Тип("ДанныеФормыСтруктура") Тогда
		ВремЗнач=Неопределено;
		Если СтруктураПараметров.Свойство(Имя,ВремЗнач) Тогда
			Результат	= ВремЗнач;		
		КонецЕсли; 
	ИначеЕсли ТипЗнч(СтруктураПараметров)=Тип("Соответствие") ИЛИ ТипЗнч(СтруктураПараметров)=Тип("ФиксированноеСоответствие") Тогда
		ВремЗнач=СтруктураПараметров.Получить(Имя);
		Если ВремЗнач<>Неопределено Тогда
			Результат=ВремЗнач;		
		КонецЕсли;				
	Иначе //Объект, выборка.....что нибудь
		Попытка		
			Результат = СтруктураПараметров[Имя];
		Исключение			
		КонецПопытки;		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПолучитьЗначениеПараметра(СтруктураПараметров,Имя,ЗначениеПоУмолчанию=Неопределено) Экспорт

Функция КонтрольныйСимволSSCC(Штрихкод) Экспорт
	КонтрольноеЧисло = 0;
	
	Цифры = Новый Массив;
	Позиций = СтрДлина(Штрихкод);
	Для НомерПозиции = 1 По Позиций Цикл		
		Попытка		
			ТекЦифра = Число(Сред(Штрихкод, НомерПозиции, 1));		
		Исключение
			ТекЦифра = 0;		
		КонецПопытки;
		
		Цифры.Добавить(ТекЦифра);
	КонецЦикла;
	
	СуммаЧетных = 0;
	СуммаНечетных = 0;
	Для НомерПозиции = 0 По Позиций-1 Цикл
		Если НомерПозиции%2=0 Тогда
			СуммаЧетных=СуммаЧетных+Цифры[НомерПозиции];
		Иначе
			СуммаНечетных=СуммаНечетных+Цифры[НомерПозиции];
		КонецЕсли;
	КонецЦикла;
	
	СверяемоеЧисло = СуммаЧетных * 3 + СуммаНечетных;
	КонтрольноеЧисло = 10 - СверяемоеЧисло%10;
	Если КонтрольноеЧисло = 10 Тогда
		КонтрольноеЧисло = 0;
	КонецЕсли;
	
	Возврат КонтрольноеЧисло;
КонецФункции

Процедура УстановитьПараметрДинамическогоСписка(Список, ИмяПараметра, Значение, Использование = Истина) Экспорт
	
	Если Использование Тогда
		ЗначениеПараметра = Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
		Если ЗначениеПараметра <> Неопределено Тогда
			Список.Параметры.УстановитьЗначениеПараметра(ИмяПараметра, Значение);
		КонецЕсли;
	Иначе
		
		ЗначениеПараметра = Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
		Если ЗначениеПараметра <> Неопределено Тогда
			Если ЗначениеПараметра.Значение <> Значение Тогда
				ЗначениеПараметра.Значение = Значение;
			КонецЕсли;
			Если ЗначениеПараметра.Использование <> Использование Тогда
				ЗначениеПараметра.Использование = Использование;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция СтруктураРезультата(Успешно = Истина) Экспорт
	Возврат Новый Структура("Успешно,Данные,Ошибки,Сообщения,ОбработаноОбъектов,ВремяВыполнения", Успешно, Новый Массив, Новый Массив, Новый Массив, 0, 0);
КонецФункции //СтруктураРезультата(Успешно = Истина)

Функция ДобавитьОшибки(Результат1, Результат2) Экспорт	
	Если ТипЗнч(Результат2)= Тип("Массив") Тогда
		ОшибкиИст = Результат2;
	Иначе
		ОшибкиИст = Результат2.Ошибки;
	КонецЕсли; 
	
	Если ТипЗнч(Результат1) = Тип("Массив") Тогда
		ОшибкиПол = Результат1;
	Иначе
		ОшибкиПол = Результат1.Ошибки;
	КонецЕсли; 
	
	Для Каждого Ошибка Из ОшибкиИст Цикл
		ОшибкиПол.Добавить(Ошибка);
	КонецЦикла;
КонецФункции //ДобавитьОшибки(Результат1, Результат2)	

Функция ЧислоБезДури(Значение) Экспорт
	Возврат Формат(Значение, "ЧГ=");
КонецФункции //ЧислоБезДури(Значение)

Процедура СообщитьПользователю(Знач Данные, Знач КлючДанных = Неопределено, Знач Поле = "", Знач ПутьКДанным = "", Отказ = Ложь) Экспорт
	
	Сообщение		= Новый СообщениеПользователю;
	
	Сообщение.Текст	= Данные;
	Сообщение.Поле	= Поле;
	
	ЭтоОбъект		= Ложь;
	
#Если НЕ ТонкийКлиент И НЕ ВебКлиент Тогда
	Если КлючДанных <> Неопределено И XMLТипЗнч(КлючДанных) <> Неопределено Тогда
		ТипЗначенияСтрокой = XMLТипЗнч(КлючДанных).ИмяТипа;
		ЭтоОбъект = Найти(ТипЗначенияСтрокой, "Object.") > 0;
	КонецЕсли;
#КонецЕсли
	
	Если ЭтоОбъект Тогда
		Сообщение.УстановитьДанные(КлючДанных);
	Иначе
		Сообщение.КлючДанных = КлючДанных;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПутьКДанным) Тогда
		Сообщение.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
		
	Сообщение.Сообщить();
	
	Отказ = Истина;
	
КонецПроцедуры

Функция ВывестиОшибки(рОбработки) Экспорт
	ТекстСообщения = СтрСоединить(рОбработки.Ошибки, Символы.ПС);
	Сообщить(ТекстСообщения, СтатусСообщения.Важное);
	
	Возврат ТекстСообщения;
КонецФункции //ВывестиОшибки(рОбработки) Экспорт
 
Функция ВывестиСообщения(рОбработки) Экспорт
	Сообщения		= МаркировкаКС.ПолучитьЗначениеПараметра(рОбработки, "Сообщения", Новый Массив);
	ТекстСообщения	= "";
	
	Если Сообщения.Количество() > 0 Тогда	
		ТекстСообщения = СтрСоединить(Сообщения, Символы.ПС);
		Сообщить(ТекстСообщения, СтатусСообщения.Важное);
	КонецЕсли;
	
	Возврат ТекстСообщения;
КонецФункции //ВывестиСообщения(рОбработки) Экспорт

Функция СохранитьОтложенныеДвижения(ДокОбъект, Отказ) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	ДокСсылка = ДокОбъект.Ссылка;
	
	ДанныеДвижений	= МаркировкаКС.ПолучитьДвиженияДокумента(ДокОбъект);	
	рСохранения		= РегистрыСведений.ОтложенныеДвиженияДокументов.СохранитьДвижения(ДокСсылка, ДанныеДвижений);
	Если рСохранения.Успешно Тогда                                               
		Для каждого Элемент Из ДанныеДвижений Цикл          
			ИмяТаблицы = Элемент.ИмяРегистра;			
			Если ИмяТаблицы = "РегистрСведений.ИспользованныеКодыАгрегаций" Тогда Продолжить КонецЕсли;
			
			ДвиженияПоРегистру = ДокОбъект.Движения[СтрРазделить(ИмяТаблицы, ".")[1]];			
			Если МаркировкаКС.ЕстьДвиженияПоРегистру(ИмяТаблицы, ДокСсылка) Тогда				
				//ДвиженияПоРегистру.Записывать = Истина;			
			КонецЕсли;
			//ДвиженияПоРегистру.Очистить();
			ДвиженияПоРегистру.Записывать = Ложь;
		КонецЦикла;		
	Иначе
		МаркировкаКС.ДобавитьОшибки(Результат, рСохранения);		
	КонецЕсли;
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Если НЕ Результат.Успешно Тогда
		Отказ = Истина;	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ЗаписатьОтложенныеДвижения(ДокОбъект) Экспорт

Функция ПолучитьДвиженияДокумента(ДокОбъект) Экспорт  
	ДанныеДвижений = Новый Массив;
	Для Каждого НЗ Из ДокОбъект.Движения Цикл	          
		СтрокаДанных = Новый Структура;
		СтрокаДанных.Вставить("ДокСсылка", 			ДокОбъект.Ссылка);
		СтрокаДанных.Вставить("ИмяРегистра",    	НЗ.Метаданные().ПолноеИмя());
		СтрокаДанных.Вставить("Движения",			Новый ХранилищеЗначения(ЗначениеВСтрокуВнутр(НЗ.Выгрузить()), Новый СжатиеДанных(5)));
		СтрокаДанных.Вставить("КоличествоЗаписей", 	НЗ.Количество());
		
		ДанныеДвижений.Добавить(СтрокаДанных);	
	КонецЦикла;	
	
	Возврат  ДанныеДвижений;	
КонецФункции //ПолучитьДвижения(ДокОбъект) Экспорт

Функция ЕстьДвиженияПоРегистру(ИмяТаблицы, Регистратор) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1 
	|	Регистратор
	|ИЗ
	|	" + ИмяТаблицы + "
	|ГДЕ
	|	Регистратор = &Регистратор
	|";
	
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат  (Выборка.Следующий() И Выборка.Регистратор = Регистратор);
КонецФункции //ЕстьДвиженияПоРегистру(ИмяТаблицы, Регистратор) Экспорт

Функция МожноЗапускатьФЗ(ИмяМетода) Экспорт
	Результат = СтруктураРезультата();
	
	ТекущееФЗ = ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание();
	
	Если ТекущееФЗ <> Неопределено Тогда
		ОтборФЗ		= Новый Структура("ИмяМетода,Состояние", ИмяМетода, СостояниеФоновогоЗадания.Активно);
		АктивныеФЗ	= ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборФЗ);	
		
		Для Каждого АктивноеФЗ Из АктивныеФЗ Цикл		
			Если АктивноеФЗ.УникальныйИдентификатор <> ТекущееФЗ.УникальныйИдентификатор Тогда
				ФЗ = АктивныеФЗ[0];
				ТекстОшибки = СтрШаблон("Обнаружено работающее ФЗ с методом '%1' ! Запущено: %2, ид.: %3 !.", ИмяМетода, ФЗ.Начало, ФЗ.УникальныйИдентификатор);
				Результат.Ошибки.Добавить(ТекстОшибки);
				
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;
КонецФункции //ПроверитьВозможностьЗапускаФЗ(ИмяМетода) Экспорт

Функция УдалитьЭлементМассива(Значения, Элемент) Экспорт
	Поз = Значения.Найти(Элемент);
	Если Поз <> Неопределено Тогда
		Значения.Удалить(Поз);
	КонецЕсли;
КонецФункции //УдалитьЭлементМассива(Значения, Элемент)

Функция Пауза(ТаймаутВСекундах)	Экспорт
	WScript = Новый COMОбъект("WScript.Shell");
   	WScript.Run("ping 127.0.0.1 -n " + ЧислоБезДури(ТаймаутВСекундах+1), 0,1);
КонецФункции //Пауза(ТаймаутВСекундах)	

//Валетов+ 16,07,2025 ПУСТАЯ ЗАДАЧА Исправил ИМЯ входящего параметра, которое затиралось первой строкой. БЫЛО: 
//Функция ЕстьОшибка404(Результат) Экспорт
Функция ЕстьОшибка404(РезультатОбработки) Экспорт
	Результат = Ложь;
	
	Для Каждого Ошибка Из РезультатОбработки.Ошибки Цикл  //И тут
		Если СтрНачинаетсяС(СокрЛП(Ошибка), "404") Тогда
			Результат = Истина;
			Прервать;		
		КонецЕсли;		
	КонецЦикла;
	
	Возврат Результат;
КонецФункции //ЕстьОшибка404(Результат) Экспорт


#Область РаботаС_JSON

Функция ЗаписатьЖСОН(Данные) Экспорт
    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ЗаписьJSON, Данные); 
	
    Возврат ЗаписьJSON.Закрыть();
КонецФункции //ЗаписатьЖСОН(Данные)

Функция ПрочитатьЖСОН(СтрокаJSON, ПрочитатьВСоответствие = Ложь) Экспорт
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Данные = ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие);
	
	ЧтениеJSON.Закрыть();
	
	Возврат Данные;
КонецФункции //ПрочитатьЖСОН(СтрокаJSON)

Функция ПричесатьЖСОН(СтрокаJSON) Экспорт
	
	Возврат ЗаписатьЖСОН(ПрочитатьЖСОН(СтрокаJSON, Истина));	

КонецФункции //ПричесатьЖСОН(СтрокаJSON)
	
#КонецОбласти

Функция СтрокуВСтруктуру(Строка, СтрПоля, Разделитель=",") Экспорт
	Части	= СтрРазделить(Строка,Разделитель);
	Поля	= СтрРазделить(СтрПоля,",");
	
	Результат	= Новый Структура;
	
	Для Сч=1 По Поля.Количество()  Цикл
		Инд=Сч-1;
		Если Сч<=Части.Количество() Тогда
			Результат.Вставить(Поля[Инд],Части[Инд]);
		Иначе
			Результат.Вставить(Поля[Инд],"");			
		КонецЕсли; 	
	КонецЦикла; 
	
	Возврат Результат;
КонецФункции // ()

Процедура ОбработкаПрерыванияПользователя_() Экспорт
	#ЕСЛИ КЛИЕНТ ТОГДА                    
		ОбработкаПрерыванияПользователя();
	#КОНЕЦЕСЛИ
КонецПроцедуры //ОбработкаПрерыванияПользователя_() Экспорт

// Кухарь А.Ю. 09.09.2024 начало
//
Функция ОпределитьЗначениеТребуетсяМаркировкаВДокументе  (ДокОбъект, Знач Контрагент=Неопределено, ИмяТоварнойТЧ="Товары",ПроверятьОбязательно=ложь) экспорт
	если не ПроверятьОбязательно тогда
		если Контрагент<>Неопределено тогда
			// Кухарь А.Ю. 18.11.2024 начало
			//РеквизитыКонтрагента=ПолучитьРеквизитыШапки(Контрагент,"РаботаСМаркированнымТоваромПодтверждена","Справочник");
			РеквизитыКонтрагента=ПолучитьРеквизитыШапки(Контрагент,"РаботаСМаркированнымТоваромПодтверждена,ДатаНачалаРаботыСМаркировкой,ИспользоватьНоменклатурнуюМатрицу,ВыполнятьПоискДатыНачалаМаркировкиВМатрице","Справочник");
			
			// Кухарь А.Ю. 18.11.2024 конец
			
			ВозможнаРаботаСМаркировкой = РеквизитыКонтрагента.РаботаСМаркированнымТоваромПодтверждена;			
		иначе
			// Кухарь А.Ю.  16.09.2024 начало
			//ВозможнаРаботаСМаркировкой = Истина;
			ВозможнаРаботаСМаркировкой=ОпределитьНеобходимостьМаркировкиПоНакладной(ДокОбъект.ссылка); 
			// Кухарь А.Ю.  16.09.2024 конец			
		КонецЕсли;
		
		если не ВозможнаРаботаСМаркировкой тогда
			возврат ложь;
		КонецЕсли;
	иначе
		ВозможнаРаботаСМаркировкой=Истина;
	КонецЕсли;
	
	// Кухарь А.Ю. 18.11.2024 начало
	//
	ВидНакладной=ДокОбъект.метаданные().имя;
	если ВидНакладной = "РасходнаяНакладная" или ВидНакладной = "Перемещение" тогда
		ТаблицаПереопределяемыхДат=ПодготовитьТаблицуСПереопределяемойДатойНачалаРаботыСМаркировкой(ДокОбъект,ИмяТоварнойТЧ);
	иначе
		ТаблицаПереопределяемыхДат = новый ТаблицаЗначений;
	КонецЕсли;
	//++Данилова Е.В. 20.08.2025 HELP-6434 
	Если ВидНакладной = "РасходнаяНакладная"
		И ДокОбъект.ТребуетсяМаркировкаПриоритет Тогда
		ВозможнаРаботаСМаркировкой = Истина; 	
	КонецЕсли; 
	//--Данилова Е.В. 20.08.2025  
	//++Данилова Е.В. 01.12.2025 HELP-5962
	ТребуетсяМаркировкаПриоритетПНК = ложь; 
	Если ВидНакладной = "ПриходнаяНакладная"
		И ДокОбъект.ТребуетсяМаркировкаПриоритет Тогда
		ВозможнаРаботаСМаркировкой = Истина; 
		ТребуетсяМаркировкаПриоритетПНК = истина; 
	КонецЕсли;
	//--Данилова Е.В. 01.12.2025 
	
	Запрос=новый запрос;
	
	//Валетов + 13,02,25  https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2841
	//Изменил запрос для учета галочки в номенклатуре ОтгрузкаТолькоЧерезЧЗ 
	если ТаблицаПереопределяемыхДат<>Неопределено и ТаблицаПереопределяемыхДат.Количество()>0 тогда 	
		запрос.Текст="ВЫБРАТЬ
		|	ТаблицаДат.ДатаНачалаРаботыСМаркировкой КАК ДатаНачалаРаботыСМаркировкой,
		|	ТаблицаДат.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ТаблицаСДатами
		|ИЗ
		|	&ТаблицаПереопределяемыхДат КАК ТаблицаДат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧ.Номенклатура КАК Номенклатура,
		|	ТЧ.Количество КАК Количество
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	&Товары КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Товары.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(ТаблицаСДатами.ДатаНачалаРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачалаРаботыСМаркировкой
		|ИЗ
		|	Товары КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСДатами КАК ТаблицаСДатами
		|		ПО Товары.Номенклатура = ТаблицаСДатами.Номенклатура
		|ГДЕ
		|	Товары.Количество > 0
		//|	И ЕСТЬNULL(ТаблицаСДатами.ДатаНачалаРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1)) <= &ДатаПроверки
		//|	И ЕСТЬNULL(ТаблицаСДатами.ДатаНачалаРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)";
		|	И ВЫБОР
		|		КОГДА Товары.Номенклатура.ОтгрузкаТолькоЧерезЧЗ	ТОГДА ИСТИНА
		|		ИНАЧЕ ЕСТЬNULL(ТаблицаСДатами.ДатаНачалаРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1)) <= &ДатаПроверки
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА Товары.Номенклатура.ОтгрузкаТолькоЧерезЧЗ	ТОГДА ИСТИНА
		|		ИНАЧЕ ЕСТЬNULL(ТаблицаСДатами.ДатаНачалаРаботыСМаркировкой, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ ";
		запрос.УстановитьПараметр("ТаблицаПереопределяемыхДат",ТаблицаПереопределяемыхДат);	

	иначе	
		запрос.Текст="ВЫБРАТЬ
		|	ТЧ.Номенклатура КАК Номенклатура,
		|	ТЧ.Количество КАК Количество
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	&Товары КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Товары.Номенклатура КАК Номенклатура
		|ИЗ
		|	Товары КАК Товары
		|ГДЕ
		|	Товары.Количество > 0
		//|	И естьnull(Товары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаРаботыСМаркировкой,ДатаВремя(1,1,1)) <> ДатаВремя(1,1,1)
		//|	И естьnull(Товары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаРаботыСМаркировкой,ДатаВремя(1,1,1)) <= &ДатаПроверки"; 
		|	И ВЫБОР
		|		КОГДА Товары.Номенклатура.ОтгрузкаТолькоЧерезЧЗ	ТОГДА ИСТИНА
		|		ИНАЧЕ естьnull(Товары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой,ДатаВремя(1,1,1)) <> ДатаВремя(1,1,1)
		|	КОНЕЦ
		|	И ВЫБОР  
		//++Данилова Е.В. 01.12.2025 HELP-5962
		|		КОГДА Товары.Номенклатура.ОтгрузкаТолькоЧерезЧЗ	ИЛИ &ТребуетсяМаркировкаПриоритетПНК ТОГДА ИСТИНА
		//|		КОГДА Товары.Номенклатура.ОтгрузкаТолькоЧерезЧЗ	ТОГДА ИСТИНА 
		//--Данилова Е.В. 01.12.2025 
		|		ИНАЧЕ естьnull(Товары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой,ДатаВремя(1,1,1)) <= &ДатаПроверки
		|	КОНЕЦ";
	КонецЕсли; 
	
	// Кухарь А.Ю.  23.12.2024 начало
	// 	запрос.УстановитьПараметр("ДатаПроверки",ДокОбъект.Дата); 
	если ВидНакладной = "ПриходнаяНакладная" тогда
		запрос.УстановитьПараметр("ДатаПроверки",ДокОбъект.ДатаОтгрузки); 
	иначе
		запрос.УстановитьПараметр("ДатаПроверки",ДокОбъект.Дата); 
	КонецЕсли;
	// Кухарь А.Ю.  23.12.2024 конец 
	//++Данилова Е.В. 01.12.2025 HELP-5962 
	запрос.УстановитьПараметр("ТребуетсяМаркировкаПриоритетПНК",ТребуетсяМаркировкаПриоритетПНК);
	//--Данилова Е.В. 01.12.2025 
	
	запрос.УстановитьПараметр("Товары",ДокОбъект[ИмяТоварнойТЧ].выгрузить());
	результат=запрос.Выполнить().Выбрать();

	если  ВозможнаРаботаСМаркировкой и результат.Количество()>0 тогда
		ТребуетсяМаркировка=Истина;
	иначе
		ТребуетсяМаркировка=ложь;	
	КонецЕсли;
	

	возврат ТребуетсяМаркировка;
	
КонецФункции

// Кухарь А.Ю. 18.11.2024 начало
//
Функция ПодготовитьТаблицуСПереопределяемойДатойНачалаРаботыСМаркировкой (ДокОбъект,ИмяТоварнойТЧ,ТЧИзЛН = неопределено) экспорт
	//Дата маркировки переопределяется либо из Матрица.Товары.ДатаНачалаРаботыСМаркировкой, либо из Контрагент.ДатаНачалаРаботыСМаркировкой
	//Берётся минимальная не пустая дата. Между датой из ТНВЭД и датой полученной из дополнительных источников
	
	//Тимофеев Ю.А. Начало   06-02-2025
	//ID-16215
	//для процедур маркетплейсов -там еще нет документов РНК , а нужно разделение
	
	Если ТипЗнч(ДокОбъект)=Тип("Структура") Тогда
		
		Товары=ДокОбъект[ИмяТоварнойТЧ];
		СтруктураДанныхНакладной=ДокОбъект;
		
	Иначе   
		
		//Тимофеев Ю.А. Конец    06-02-2025
		
		СтруктураДанныхНакладной=новый Структура("Номенклатура,ПунктДоставки,Договор,Дата,Контрагент,ПостояннаяАкция"); 
		ЗаполнитьЗначенияСвойств(СтруктураДанныхНакладной,ДокОбъект);
		Товары=ДокОбъект[ИмяТоварнойТЧ].выгрузить();
		СтруктураДанныхНакладной.Номенклатура=Товары.ВыгрузитьКолонку("Номенклатура");
		
	КонецЕсли;

	
	Контрагент=СтруктураДанныхНакладной.Контрагент;	
	// Кухарь А.Ю. 10.03.2025 начало
	// Пустая задача
	если Контрагент=Справочники.Контрагенты.ПустаяСсылка() тогда
		РеквизитыКонтрагента=новый Структура("ДатаНачалаРаботыСМаркировкой,ВыполнятьПоискДатыНачалаМаркировкиВМатрице",'20260101',ложь);
	Иначе 
		// Кухарь А.Ю. 10.03.2025 конец
		
		РеквизитыКонтрагента=ПолучитьРеквизитыШапки(Контрагент,"ДатаНачалаРаботыСМаркировкой,ВыполнятьПоискДатыНачалаМаркировкиВМатрице","Справочник");	
		// Кухарь А.Ю. 10.03.2025 начало
		// Пустая задача
	КонецЕсли;	
	// Кухарь А.Ю. 10.03.2025 конец
	
	ДатаНачалаМаркировкиИзКонтрагента=РеквизитыКонтрагента.ДатаНачалаРаботыСМаркировкой;	
	// Кухарь А.Ю. 06.03.2025 начало
	// Пустая задача
	ОтгрузкаСоСкладаМаркировки = ложь;
	//++Данилова Е.В. 20.08.2025 HELP-6434 
	ТребуетсяМаркировкаПриоритет = Ложь; 
	//--Данилова Е.В. 20.08.2025
	ТипДокумента=ТипЗнч(ДокОбъект);
	если ТипДокумента=Тип("ДокументСсылка.Перемещение") тогда
		РеквизитыСкладов=ПолучитьРеквизитыШапки(ДокОбъект,"Склад.ЭтоСкладМаркированногоТовара,СкладПолучатель.ЭтоСкладМаркированногоТовара","Документ");
		Если РеквизитыСкладов.Склад_ЭтоСкладМаркированногоТовара = Истина или РеквизитыСкладов.СкладПолучатель_ЭтоСкладМаркированногоТовара = Истина тогда
			ОтгрузкаСоСкладаМаркировки = Истина;
		КонецЕсли;
	ИначеЕсли ТипДокумента=Тип("ДокументОбъект.Перемещение") тогда
		Если ПолучитьРеквизитШапки(ДокОбъект.Склад,"ЭтоСкладМаркированногоТовара","Справочник") = Истина  
			//++Данилова Е.В. 17.11.2025  HELP-7070 
			//или ПолучитьРеквизитШапки(ДокОбъект.СкладПолучатель,"ЭтоСкладМаркированногоТовара","Справочник") тогда
			или ПолучитьРеквизитШапки(ДокОбъект.СкладПолучатель,"ЭтоСкладМаркированногоТовара","Справочник") = Истина тогда
			//--Данилова Е.В. 17.11.2025
			ОтгрузкаСоСкладаМаркировки = Истина;		
		КонецЕсли;	
	ИначеЕсли ТипДокумента=Тип("ДокументОбъект.РасходнаяНакладная") тогда
		Если ПолучитьРеквизитШапки(ДокОбъект.Склад,"ЭтоСкладМаркированногоТовара","Справочник") = Истина  тогда
			ОтгрузкаСоСкладаМаркировки = Истина;		
		КонецЕсли;
		//++Данилова Е.В. 20.08.2025  HELP-6434
		Если ДокОбъект.ТребуетсяМаркировкаПриоритет  тогда
			ТребуетсяМаркировкаПриоритет = Истина;		
		КонецЕсли;
		//--Данилова Е.В. 20.08.2025
	ИначеЕсли ТипДокумента=Тип("ДокументСсылка.РасходнаяНакладная") тогда
		Если ПолучитьРеквизитШапки(ДокОбъект,"Склад.ЭтоСкладМаркированногоТовара","Документ") = Истина  тогда
			ОтгрузкаСоСкладаМаркировки = Истина;			
		КонецЕсли;
		//++Данилова Е.В. 20.08.2025  HELP-6434
		Если ДокОбъект.ТребуетсяМаркировкаПриоритет  тогда
			ТребуетсяМаркировкаПриоритет = Истина;		
		КонецЕсли;
		//--Данилова Е.В. 20.08.2025
	КонецЕсли;
	
	
	РаботаПоМатрицам=РеквизитыКонтрагента.ВыполнятьПоискДатыНачалаМаркировкиВМатрице;
	//++Данилова Е.В. 20.08.2025 HELP-6434 
	//если ОтгрузкаСоСкладаМаркировки тогда
	если ОтгрузкаСоСкладаМаркировки 
		ИЛИ ТребуетсяМаркировкаПриоритет тогда
		//--Данилова Е.В. 20.08.2025
		РаботаПоМатрицам=ложь;
		ДатаНачалаМаркировкиИзКонтрагента=ТекущаяДата()-60*86400;		
	КонецЕсли;
	// Кухарь А.Ю. 06.03.2025 конец
	
	

	если РаботаПоМатрицам тогда
		ТаблицаМатриц=ПолучитьТаблицуМатрицСрезПоследних(СтруктураДанныхНакладной);
		ТаблицаМатриц.Свернуть("Номенклатура,ДатаНачалаРаботыСМаркировкой");
	КонецЕсли;
	
	Запрос=новый запрос;	

	
	
	если не РаботаПоМатрицам тогда
		если ДатаНачалаМаркировкиИзКонтрагента='00010101' тогда
			//Кухарь А.Ю.  10.03.2025 начало
			// Пустая задача
			ДатаНачалаМаркировкиИзКонтрагента='20260101'; 
			//Кухарь А.Ю.  10.03.2025 конец
			
		КонецЕсли;
		
		//Валетов + 25,09,2025 ПустаяЗадача Добавил ТЧизЛистовНабора, для получения дат по всем товарам если что-то есть в ЛН, но нет в ДокОсновании
		Если не ТЧИзЛН = неопределено Тогда 
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТЧ.Номенклатура КАК Номенклатура,
			|	ТЧ.Количество КАК Количество
			|ПОМЕСТИТЬ ВТ_Осн
			|ИЗ
			|	&Товары КАК ТЧ
			|ГДЕ
			|	ТЧ.Количество > 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаварыИзЛН.Номенклатура КАК Номенклатура,
			|	ТаварыИзЛН.Количество КАК Количество
			|ПОМЕСТИТЬ ВТ_ЛН
			|ИЗ
			|	&ТаварыЛН КАК ТаварыИзЛН
			|ГДЕ
			|	ТаварыИзЛН.Количество > 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЕСТЬNULL(ВТ_Осн.Номенклатура, ВТ_ЛН.Номенклатура) КАК Номенклатура
			|ПОМЕСТИТЬ Товары
			|ИЗ
			|	ВТ_Осн КАК ВТ_Осн
			|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ЛН КАК ВТ_ЛН
			|		ПО ВТ_Осн.Номенклатура = ВТ_ЛН.Номенклатура
			|;
			|";
			Запрос.УстановитьПараметр("ТаварыЛН",ТЧИзЛН);						   
		Иначе
			
			запрос.Текст="ВЫБРАТЬ
			|	ТЧ.Номенклатура КАК Номенклатура
			|ПОМЕСТИТЬ Товары
			|ИЗ
			|	&Товары как ТЧ
			|ГДЕ
			|	ТЧ.Количество > 0
			|
			|;
			|";
		КонецЕсли; 
	    запрос.Текст= запрос.Текст+"
		//Валетов -
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ВЫБОР 
		|	Когда естьnull(Товары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой,ДатаВремя(1,1,1)) = ДатаВремя(1,1,1) тогда &ДалекоеБудущее 
		// Кухарь А.Ю.  03.06.2025 начало
		|			Когда Товары.Номенклатура.ОтгрузкаТолькоЧерезЧЗ тогда ДатаВремя(2024,1,1) 	 
		// Кухарь А.Ю.  03.06.2025 конец
		
		|			КОГДА 
		|				естьnull(Товары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой,&ДалекоеБудущее) <= &ДатаНачалаМаркировкиИзКонтрагента или  &ДатаНачалаМаркировкиИзКонтрагента = ДатаВремя (1,1,1)	ТОГДА 
		|				естьnull(Товары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой,&ДалекоеБудущее)
		|			ИНАЧЕ 
		|				&ДатаНачалаМаркировкиИзКонтрагента
		|		КОНЕЦ) КАК ДатаНачалаРаботыСМаркировкой
		|ИЗ
		|	Товары КАК Товары
		|
		|СГРУППИРОВАТЬ ПО
		|	Товары.Номенклатура";	
	иначе	
		запрос.Текст="ВЫБРАТЬ
		|	ТЗМатриц.Номенклатура КАК номенклатура,
		|	ВЫБОР
		|		КОГДА ТЗМатриц.ДатаНачалаРаботыСМаркировкой = ДатаВремя(1,1,1)
		|			ТОГДА &ДалекоеБудущее
		|		ИНАЧЕ ТЗМатриц.ДатаНачалаРаботыСМаркировкой
		|	КОНЕЦ КАК ДатаНачалаРаботыСМаркировкой
		|ПОМЕСТИТЬ ВТМатриц
		|ИЗ
		|	&ТЗ КАК ТЗМатриц	
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧ.Номенклатура КАК Номенклатура,
		|	ТЧ.Количество КАК Количество
		|ПОМЕСТИТЬ ВтТовары
		|ИЗ
		|	&Товары как ТЧ
		|ГДЕ
		|	ТЧ.Количество > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЕСТЬNULL(ТЗМатриц.ДатаНачалаРаботыСМаркировкой, &ДалекоеБудущее) < естьnull(Товары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой,ДатаВремя(1,1,1))
		|				ТОГДА ЕСТЬNULL(ТЗМатриц.ДатаНачалаРаботыСМаркировкой, &ДалекоеБудущее)
		// Кухарь А.Ю.  03.06.2025 начало
		|			Когда Товары.Номенклатура.ОтгрузкаТолькоЧерезЧЗ тогда ДатаВремя(2024,1,1) 	 
		// Кухарь А.Ю.  03.06.2025 конец
		
		|			ИНАЧЕ естьnull(Товары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой,&ДалекоеБудущее)
		|		КОНЕЦ) КАК ДатаНачалаРаботыСМаркировкой
		|ИЗ
		|	ВтТовары КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМатриц КАК ТЗМатриц
		|		ПО Товары.Номенклатура = ТЗМатриц.номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	Товары.Номенклатура";

		
		// Кухарь А.Ю.  22.01.2025 начало
		// Тестовый кусочек
		если ПараметрыСеанса.ПарольКассираФискальногоРегистратора="ТестВБ" тогда
			Для каждого СтрТЗ из ТаблицаМатриц цикл
				СтрТЗ.ДатаНачалаРаботыСМаркировкой='20250101';
			КонецЦикла;	
		КонецЕсли;
		// Кухарь А.Ю.  22.01.2025 конец
		
		запрос.УстановитьПараметр("ТЗ",ТаблицаМатриц); 		
	КонецЕсли;
	
	запрос.УстановитьПараметр("ДалекоеБудущее",'20990101'); 	
		
	запрос.УстановитьПараметр("ДатаНачалаМаркировкиИзКонтрагента",ДатаНачалаМаркировкиИзКонтрагента); 		
	запрос.УстановитьПараметр("Товары",Товары);

	
	возврат запрос.Выполнить().выгрузить();
	
	
КонецФункции



Функция ПодготовитьПереопределяемыеДатыНачалаРаботыСМаркировкойПоСтроке (Знач Накладная,Контрагент,РеквизитыКонтрагента,Номенклатура) экспорт
	ДатаНачалаМаркировкиИзКонтрагента=РеквизитыКонтрагента.ДатаНачалаРаботыСМаркировкой;	
	РаботаПоМатрицам=РеквизитыКонтрагента.ВыполнятьПоискДатыНачалаМаркировкиВМатрице;
	
	// Кухарь А.Ю. 06.03.2025 начало
	// Пустая задача
	ОтгрузкаСоСкладаМаркировки = ложь;
	//++Данилова Е.В. 20.08.2025 HELP-6434 
	ТребуетсяМаркировкаПриоритет = Ложь; 
	//--Данилова Е.В. 20.08.2025
	ТипДокумента=ТипЗнч(Накладная);
	если ТипДокумента=Тип("ДокументСсылка.Перемещение") тогда
		РеквизитыСкладов=ПолучитьРеквизитыШапки(Накладная,"Склад.ЭтоСкладМаркированногоТовара,СкладПолучатель.ЭтоСкладМаркированногоТовара","Документ");
		Если РеквизитыСкладов.Склад_ЭтоСкладМаркированногоТовара = Истина или РеквизитыСкладов.СкладПолучатель_ЭтоСкладМаркированногоТовара = Истина тогда
			ОтгрузкаСоСкладаМаркировки = Истина;
		КонецЕсли;
	ИначеЕсли ТипДокумента=Тип("ДокументСсылка.РасходнаяНакладная") тогда
		Если ПолучитьРеквизитШапки(Накладная,"Склад.ЭтоСкладМаркированногоТовара","Документ") = Истина  тогда
			ОтгрузкаСоСкладаМаркировки = Истина;			
		КонецЕсли;
		//++Данилова Е.В. 20.08.2025  HELP-6434
		Если Накладная.ТребуетсяМаркировкаПриоритет  тогда
			ТребуетсяМаркировкаПриоритет = Истина;		
		КонецЕсли;
		//--Данилова Е.В. 20.08.2025

	КонецЕсли;
	
	
	//++Данилова Е.В. 20.08.2025 HELP-6434 
	//если ОтгрузкаСоСкладаМаркировки тогда
	если ОтгрузкаСоСкладаМаркировки 
		ИЛИ ТребуетсяМаркировкаПриоритет тогда
		//--Данилова Е.В. 20.08.2025
		РаботаПоМатрицам=ложь;
		ДатаНачалаМаркировкиИзКонтрагента=ТекущаяДата()-30*86400;		
	КонецЕсли;
	
	// Кухарь А.Ю. 06.03.2025 конец
	
	//Валетов + 13,03,2025  https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-3356
	Если РаботаПоМатрицам = Неопределено Тогда
		РаботаПоМатрицам = Ложь;
		Если ДатаНачалаМаркировкиИзКонтрагента = Неопределено Тогда
			ДатаНачалаМаркировкиИзКонтрагента = '00010101';
		КонецЕсли;
	КонецЕсли;
	//Валетов -
	
	если РаботаПоМатрицам тогда
		ТаблицаМатриц=ПолучитьТаблицуМатрицСрезПоследних(Накладная,,Номенклатура);
		ТаблицаМатриц.Свернуть("Номенклатура,ДатаНачалаРаботыСМаркировкой");
	КонецЕсли;
	
	Запрос=новый запрос;	
	
	
	если не РаботаПоМатрицам тогда	
		если ДатаНачалаМаркировкиИзКонтрагента='00010101' тогда
			//Кухарь А.Ю.  10.03.2025 начало
			// Пустая задача
			ДатаНачалаМаркировкиИзКонтрагента='20260101'; 
			//Кухарь А.Ю.  10.03.2025 конец

		КонецЕсли;
		запрос.Текст="ВЫБРАТЬ
		|	Товары.Ссылка КАК Номенклатура,
		|	МАКСИМУМ(ВЫБОР		
		// Кухарь А.Ю.  06.06.2025 начало
		|	Когда естьnull(Товары.Ссылка.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой,ДатаВремя(1,1,1)) = ДатаВремя(1,1,1) тогда &ДалекоеБудущее
		// Кухарь А.Ю.  06.06.2025 конец		
		|			КОГДА естьnull(Товары.Ссылка.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой,&ДалекоеБудущее) <= &ДатаНачалаМаркировкиИзКонтрагента
		|					ИЛИ &ДатаНачалаМаркировкиИзКонтрагента = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА естьnull(Товары.Ссылка.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой,&ДалекоеБудущее)
		|			ИНАЧЕ &ДатаНачалаМаркировкиИзКонтрагента
		|		КОНЕЦ) КАК ДатаНачалаРаботыСМаркировкой
		|ИЗ
		|	Справочник.Номенклатура КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	Товары.Ссылка";	
	иначе	
		запрос.Текст="ВЫБРАТЬ
		|	ТЗМатриц.Номенклатура КАК номенклатура,
		|	ВЫБОР
		|		КОГДА ТЗМатриц.ДатаНачалаРаботыСМаркировкой = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА &ДалекоеБудущее
		|		ИНАЧЕ ТЗМатриц.ДатаНачалаРаботыСМаркировкой
		|	КОНЕЦ КАК ДатаНачалаРаботыСМаркировкой
		|ПОМЕСТИТЬ ВТМатриц
		|ИЗ
		|	&ТЗ КАК ТЗМатриц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Спр.Ссылка КАК Номенклатура
		|ПОМЕСТИТЬ ВтТовары
		|ИЗ
		|	Справочник.Номенклатура КАК Спр
		|ГДЕ
		|	Спр.Ссылка = &Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ВЫБОР	
		// Кухарь А.Ю.  06.06.2025 начало
		|			КОГДА естьnull(Товары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой,ДатаВремя(1,1,1))  = ДатаВремя(1,1,1) тогда &ДалекоеБудущее		
		// Кухарь А.Ю.  06.06.2025 конец		
		|			КОГДА ЕСТЬNULL(ТЗМатриц.ДатаНачалаРаботыСМаркировкой, &ДалекоеБудущее) < естьnull(Товары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой,&ДалекоеБудущее)
		|				ТОГДА ЕСТЬNULL(ТЗМатриц.ДатаНачалаРаботыСМаркировкой, &ДалекоеБудущее)
		|			ИНАЧЕ естьnull(Товары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой,&ДалекоеБудущее)
		|		КОНЕЦ) КАК ДатаНачалаРаботыСМаркировкой
		|ИЗ
		|	ВтТовары КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМатриц КАК ТЗМатриц
		|		ПО Товары.Номенклатура = ТЗМатриц.номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	Товары.Номенклатура";
		запрос.УстановитьПараметр("ДалекоеБудущее",'20990101'); 			
		запрос.УстановитьПараметр("ТЗ",ТаблицаМатриц); 		

	КонецЕсли;
	запрос.УстановитьПараметр("ДатаНачалаМаркировкиИзКонтрагента",ДатаНачалаМаркировкиИзКонтрагента); 		
	запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	// Кухарь А.Ю.  10.02.2025 начало
	// HELP-2808
	запрос.УстановитьПараметр("ДалекоеБудущее",'20990101'); 	
	// Кухарь А.Ю.  10.02.2025 конец
	
	
	// Кухарь А.Ю.  22.01.2025 начало
	// Тестовый кусочек
	если ПараметрыСеанса.ПарольКассираФискальногоРегистратора="ТестВБ" тогда
		ТаблицаВозврата=запрос.Выполнить().Выгрузить();
		Для каждого СтрТЗ из ТаблицаВозврата цикл
			СтрТЗ.ДатаНачалаРаботыСМаркировкой='20250101';
		КонецЦикла;
		возврат ТаблицаВозврата;
		
	КонецЕсли;
	
	// Кухарь А.Ю.  22.01.2025 конец
	
	возврат запрос.Выполнить().выгрузить();


КонецФункции

// Кухарь А.Ю.  15.12.2024 начало
// Вынес в общий модуль

// Кельманов А.В. - ИЗМ-0000000061 - 2026.06.17 {
//Функция МожноСканироватьНоменклатуруОбычнымШКилиЧЗ(Номенклатура, ОтсканировалиМарку, СтруктураДанныхДокОснования, ПараметрыСканированияМарок) Экспорт	
Функция МожноСканироватьНоменклатуруОбычнымШКилиЧЗ(Номенклатура, ОтсканировалиМарку, СтруктураДанныхДокОснования, ПараметрыСканированияМарок, ТочноМожноСканироватьОбычныеШК = Ложь) Экспорт	
// Кельманов А.В. - ИЗМ-0000000061 - 2026.06.17 }
	
	ДокОснование = СтруктураДанныхДокОснования.ДокОснование;

	Результат = Новый Структура("Успешно, Ошибки, ПечататьКодЧЗ", Истина, Новый Массив, Ложь);	

	// Кухарь А.Ю.  19.12.2024 начало
	//ДанныеНоменклатурыЧЗ=ПроверкаНеобходимостиСканированияКодаЧЗ (Номенклатура,СтруктураДанныхДокОснования.ДатаОтгрузки,СтруктураДанныхДокОснования.ТребуетсяМаркировка,ДокОснование);
	Если ПараметрыСканированияМарок.Свойство("ОтключитьКонтрольСканирования") Тогда
		ОтключитьКонтрольСканирования = ПараметрыСканированияМарок.ОтключитьКонтрольСканирования;
	Иначе
		ОтключитьКонтрольСканирования = Ложь;
	КонецЕсли;
	
	ДанныеНоменклатурыЧЗ=ПроверкаНеобходимостиСканированияКодаЧЗ (Номенклатура,СтруктураДанныхДокОснования,ОтключитьКонтрольСканирования);	 
	// Кухарь А.Ю.  19.12.2024 конец

	ЕстьКарточкаВЧЗ = ДанныеНоменклатурыЧЗ.МожноСканироватьКодыЧЗ;
	НужноСканироватьКодЧЗ = ДанныеНоменклатурыЧЗ.НужноСканироватьКодыЧЗ;

	// Кельманов А.В. - ИЗМ-0000000061 - 2026.06.17 {
	Если ТочноМожноСканироватьОбычныеШК Тогда
		НужноСканироватьКодЧЗ = Ложь;
	КонецЕсли;
	// Кельманов А.В. - ИЗМ-0000000061 - 2026.06.17 }

	// Кухарь А.Ю.  13.02.2025 начало
	// // FBO со спайками ЧЗ 
	//НаборыЧЗбезОклейкиКомплектующих=ложь; 
	//если СтруктураДанныхДокОснования.свойство("НаборыЧЗбезОклейкиКомплектующих") тогда
	//	НаборыЧЗбезОклейкиКомплектующих=СтруктураДанныхДокОснования.НаборыЧЗбезОклейкиКомплектующих;
	//КонецЕсли;
	
	НанесениеКодовНеОбязательно = Ложь; 
	Если СтруктураДанныхДокОснования.свойство("НанесениеКодовНеОбязательно") Тогда
		НанесениеКодовНеОбязательно = СтруктураДанныхДокОснования.НанесениеКодовНеОбязательно;
	КонецЕсли;
	// Кухарь А.Ю.  13.02.2025 конец

	Если ОтсканировалиМарку Тогда //Щёлкнули марку. 
		Если ЕстьКарточкаВЧЗ Тогда
			Если НЕ (ПараметрыСканированияМарок.НужноСканироватьМарки Или ПараметрыСканированияМарок.СканироватьМаркиДляВнутреннихДокументов) Тогда
				ТекстСообщения = "В эту накладную маркировку сканировать не нужно, требуется отгрузить такой же товар, но без нанесённых кодов ЧЗ." 				
				+ ПараметрыСканированияМарок.Сообщение; 
				Результат.Ошибки.Добавить(ТекстСообщения);
			КонецЕсли;			
		Иначе			
			Результат.Ошибки.Добавить(СтрШаблон("Карточка номенклатуры: '%1'  отсканируйте обычный ШК товара.", Номенклатура));
		КонецЕсли;		
	Иначе //Щёлкнули обычный ШК, нужно проверить, возможно обычными ШК уже нельзя грузить.
		// Кухарь А.Ю.  21.05.2024 начало
		//
		Если Не НужноСканироватьКодЧЗ Тогда 
			// Кухарь А.Ю.  19.01.2025 начало
			// Если ЕстьКарточкаВЧЗ И (ПараметрыСканированияМарок.НужноСканироватьМарки или ПараметрыСканированияМарок.СканироватьМаркиДляВнутреннихДокументов)  тогда
			// Кухарь А.Ю.  13.02.2025 начало
			// // FBO со спайками ЧЗ 		
			//Если не НаборыЧЗбезОклейкиКомплектующих 
			Если Не НанесениеКодовНеОбязательно  
				// Кухарь А.Ю.  13.02.2025 конец
				
				// Кельманов А.В. - ИЗМ-0000000061 - 2026.06.17 {
				И Не ТочноМожноСканироватьОбычныеШК 
				// Кельманов А.В. - ИЗМ-0000000061 - 2026.06.17 }
				
				И ЕстьКарточкаВЧЗ 
				И (ПараметрыСканированияМарок.НужноСканироватьМарки Или ПараметрыСканированияМарок.СканироватьМаркиДляВнутреннихДокументов) 
				Тогда				
				// Кухарь А.Ю.  19.01.2025 конец
				
				ТекстСообщения	= СтрШаблон("Номенклатура %1 подлежит маркировке, обычным ШК её сканировать нельзя.
				|Отсканируйте код ЧЗ, если его нет на товаре, требуется нанесение этого кода на товар.", Номенклатура );
				
				Результат.Ошибки.Добавить(ТекстСообщения);
				Результат.ПечататьКодЧЗ = Истина;
			КонецЕсли;
		Иначе
			ТекстСообщения	= СтрШаблон("Номенклатура %1 подлежит обязательной маркировке, обычным ШК её сканировать нельзя.
			|Отсканируйте код ЧЗ, если его нет на товаре, требуется нанесение этого кода на товар.", Номенклатура );		
			Результат.Ошибки.Добавить(ТекстСообщения);
			Результат.ПечататьКодЧЗ = Истина;			
		КонецЕсли; 
		// Кухарь А.Ю.  21.05.2024 конец
		
	КонецЕсли;
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);		
	
	Возврат Результат;
	
КонецФункции //МожноСканироватьНоменклатуруОбычнымШКилиЧЗ(Накладная, Номенклатура, ОтсканировалиМарку = Ложь) Экспорт	

Функция ПроверкаНеобходимостиСканированияКодаЧЗ (Номенклатура,СтруктураДанныхДокОснования,ОтключитьКонтрольСканирования=ложь) экспорт
	// Кухарь А.Ю.  19.01.2025 начало
	// Переделал на входящую структуру
	ДатаОтгрузки=СтруктураДанныхДокОснования.ДатаОтгрузки;
	ДокОснование=СтруктураДанныхДокОснования.ДокОснование;
	ТребуетсяМаркировка=СтруктураДанныхДокОснования.ТребуетсяМаркировка;	 
	// Кухарь А.Ю.  19.01.2025 конец
	

	Если ДатаОтгрузки=ПустаяДата() тогда
		ДатаОтгрузки=ТекущаяДата();
	КонецЕсли;

	
	// Кухарь А.Ю.  13.02.2025 начало
	// // FBO со спайками ЧЗ 
	//НаборыЧЗбезОклейкиКомплектующих=ложь; 
	//если СтруктураДанныхДокОснования.свойство("НаборыЧЗбезОклейкиКомплектующих") тогда
	//	НаборыЧЗбезОклейкиКомплектующих=СтруктураДанныхДокОснования.НаборыЧЗбезОклейкиКомплектующих;
	//КонецЕсли;
	
	НанесениеКодовНеОбязательно=ложь; 
	если СтруктураДанныхДокОснования.свойство("НанесениеКодовНеОбязательно") тогда
		НанесениеКодовНеОбязательно=СтруктураДанныхДокОснования.НанесениеКодовНеОбязательно;
	КонецЕсли;
	// Кухарь А.Ю.  13.02.2025 конец
	
	
	
	// Кухарь А.Ю.  20.01.2025 начало
	ОтгрузкаТолькоЧерезЧЗ=ПолучитьРеквизитШапки(Номенклатура,"ОтгрузкаТолькоЧерезЧЗ","Справочник");
	// Кухарь А.Ю.  20.01.2025 конец
	// Кухарь А.Ю.  28.02.2025 начало
	
	если ОтгрузкаТолькоЧерезЧЗ=Неопределено тогда
		ОтгрузкаТолькоЧерезЧЗ=ложь;
	КонецЕсли;
	// Кухарь А.Ю.  28.02.2025 конец
	
	
	
	СтруктураВозврата=новый Структура("МожноСканироватьКодыЧЗ,НужноСканироватьКодыЧЗ",Ложь,Ложь);
	
	ДатыТНВЭД=ПолучитьРеквизитыШапки(Номенклатура,"Родитель.ТНВЭД.ДатаНачалаРаботыСМаркировкой,Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой","Справочник");
	ДатаНачалаРаботыСМаркировкой=ДатыТНВЭД.Родитель_ТНВЭД_ДатаНачалаОбязательнойРаботыСМаркировкой;
	ДатаНачалаОбязательнойРаботыСМаркировкой=ДатыТНВЭД.Родитель_ТНВЭД_ДатаНачалаОбязательнойРаботыСМаркировкой;
	
	// Кухарь А.Ю. 18.11.2024 начало
	ИмяДокумента=ОбщегоНазначения_ПИ.ПолучитьИмяДокумента(ДокОснование);
	если ИмяДокумента="РасходнаяНакладная" или ИмяДокумента="Перемещение" тогда
		Контрагент=ПолучитьРеквизитШапки(ДокОснование,"Контрагент","Документ");
		ДанныеКонтрагента=ОбщегоНазначения_ПИ.ПолучитьДанныеКонтрагента(Контрагент);
		ТаблицаДопДанных=МаркировкаКС.ПодготовитьПереопределяемыеДатыНачалаРаботыСМаркировкойПоСтроке(ДокОснование,Контрагент,ДанныеКонтрагента,Номенклатура);
		если ТаблицаДопДанных<>Неопределено и ТаблицаДопДанных.количество()>0 тогда
			ДатаНачалаРаботыСМаркировкой=ТаблицаДопДанных[0].ДатаНачалаРаботыСМаркировкой;
			ДатаНачалаОбязательнойРаботыСМаркировкой=ТаблицаДопДанных[0].ДатаНачалаРаботыСМаркировкой;
		КонецЕсли;
	КонецЕсли;
	// Кухарь А.Ю. 18.11.2024 конец
	
	
	если не ЗначениеЗаполнено(ДатаНачалаОбязательнойРаботыСМаркировкой) тогда
		ДатаНачалаОбязательнойРаботыСМаркировкой='20800101';
	КонецЕсли;
	если не ЗначениеЗаполнено(ДатаНачалаРаботыСМаркировкой) тогда
		ДатаНачалаРаботыСМаркировкой='20800101';
	КонецЕсли;
	
	//Валетов + 01,08,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-2664
	Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ПриходнаяНакладная") 
		И (ПолучитьРеквизитШапки(ДокОснование,"КодОперации","Документ") = Перечисления.КодыОперацийОстатки.ЗакупкаР
			ИЛИ ПолучитьРеквизитШапки(ДокОснование,"КодОперации","Документ") = Перечисления.КодыОперацийОстатки.Закупка) Тогда
			СтруктураВозврата.НужноСканироватьКодыЧЗ = Истина;
	КонецЕсли;
	//Валетов -
		
	Если  ДатаНачалаРаботыСМаркировкой <= ДатаОтгрузки и ТребуетсяМаркировка тогда
		СтруктураВозврата.МожноСканироватьКодыЧЗ = Истина;
		СтруктураВозврата.МожноСканироватьКодыЧЗ=Истина;
	КонецЕсли;
	
	
	// Кухарь А.Ю.  13.02.2025 начало
	// // FBO со спайками ЧЗ 
	Если  ДатаНачалаОбязательнойРаботыСМаркировкой <= ДатаОтгрузки или ОтгрузкаТолькоЧерезЧЗ тогда
		// Кухарь А.Ю.  13.02.2025 конец
		
		СтруктураВозврата.МожноСканироватьКодыЧЗ=Истина;
		
		// Кухарь А.Ю.  19.01.2025 начало
		//СтруктураВозврата.НужноСканироватьКодыЧЗ=Истина;
		// Кухарь А.Ю.  13.02.2025 начало
		// // FBO со спайками ЧЗ 
		//если не НаборыЧЗбезОклейкиКомплектующих и не ОтгрузкаТолькоЧерезЧЗ  тогда
		если не НанесениеКодовНеОбязательно тогда		
			// Кухарь А.Ю.  13.02.2025 конец	
			СтруктураВозврата.НужноСканироватьКодыЧЗ=Истина;
		КонецЕсли;
		// Кухарь А.Ю.  19.01.2025 конец
		
	КонецЕсли;
	
	//++Данилова Е.В. 01.12.2025  HELP-5962 
	Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ПриходнаяНакладная") 
		И ПолучитьРеквизитШапки(ДокОснование,"ТребуетсяМаркировкаПриоритет","Документ") = Истина Тогда 
		СтруктураВозврата.НужноСканироватьКодыЧЗ=Истина;
		СтруктураВозврата.МожноСканироватьКодыЧЗ=Истина;
	КонецЕсли;
	//--Данилова Е.В. 01.12.2025
	
	//Кухарь А.Ю.  30.09.2024 начало
	если  ОтключитьКонтрольСканирования тогда
		если ТипЗнч(ДокОснование)= Тип("ДокументСсылка.Перемещение") тогда
			СтруктураВозврата.НужноСканироватьКодыЧЗ=Ложь;				
		ИначеЕсли ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ПриходнаяНакладная") и ПолучитьРеквизитШапки(ДокОснование,"КодОперации","Документ")<>Перечисления.КодыОперацийОстатки.ЗакупкаР тогда
			СтруктураВозврата.НужноСканироватьКодыЧЗ=ложь;	
		КонецЕсли;
	КонецЕсли;
// Кухарь А.Ю.  30.09.2024 конец

	

	возврат СтруктураВозврата;
	
КонецФункции

// Кухарь А.Ю.  15.12.2024 конец



// Кухарь А.Ю.  19.01.2025 начало
//
Функция ПолучитьСвободныйКодДляПечати (ПараметрыПоиска) экспорт
	
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	//СтруктураВозврата=новый Структура("КодЧЗ,Успех,Ошибки",Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка(),Истина,"");	
		//20,01,2025 Ратманов исправление ошибки по HELP-2593 
	СтруктураВозврата=новый Структура("КодЧЗ,ЗначениеКМ,Успех,Ошибки,Цвет,Размер,Артикул,Статус",Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка(),"",Истина,"");	
	запрос=новый запрос;
	//++Ратманов
	//запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	//             |	СтатусыКМ_ФактСрезПоследних.ШтрихКодУпаковки КАК КодЧЗ,
	//             |	СтатусыКМ_ФактСрезПоследних.Статус КАК Статус,
	//             |	СтатусыКМ_ФактСрезПоследних.ШтрихКодУпаковки.ЗначениеШтрихкода КАК ЗначениеКМ,
	//             |	СтатусыКМ_ФактСрезПоследних.ШтрихКодУпаковки.Владелец.Цвет КАК Цвет,
	//             |	СтатусыКМ_ФактСрезПоследних.ШтрихКодУпаковки.Владелец.Размер КАК Размер,
	//             |	СтатусыКМ_ФактСрезПоследних.ШтрихКодУпаковки.Владелец.Родитель.КодПроизводителя КАК Артикул
	//             |ИЗ
	//             |	РегистрСведений.СтатусыКМ_Факт.СрезПоследних(
	//             |			,
	//             |			Номенклатура = &Номенклатура
	//             |				И ТипШК = &ТипШК
	//             |				И НЕ ШтрихКодУпаковки В (&МассивИсключаемыхКодов)
	//             |				И &УсловиеПоКодамЗСБ
	//             |				И ШтрихКодУпаковки.СпособВводаВОборот = ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.МаркировкаОстатков)) КАК СтатусыКМ_ФактСрезПоследних
	//             |ГДЕ
	//             |	СтатусыКМ_ФактСрезПоследних.Статус В(&Статус)
	//             |	И СтатусыКМ_ФактСрезПоследних.Местонахождение В(&СписокМестонахождений)";
	запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	             |	СтатусыКМ_ФактСрезПоследних.ШтрихКодУпаковки КАК КодЧЗ,
	             |	СтатусыКМ_ФактСрезПоследних.Статус КАК Статус,
	             |	СпрШтрихКод.ЗначениеШтрихкода КАК ЗначениеКМ,
	             |	СпрШтрихКод_Владелец.Цвет КАК Цвет,
	             |	СпрШтрихКод_Владелец.Размер КАК Размер,
	             |	СпрШтрихКод_ВладелецРодитель.КодПроизводителя КАК Артикул
	             |ИЗ
	             |	РегистрСведений.СтатусыКМ_Факт.СрезПоследних(
	             |			,
	             |			Номенклатура = &Номенклатура
	             |				И ТипШК = &ТипШК
	             |				И НЕ ШтрихКодУпаковки В (&МассивИсключаемыхКодов)
	             |				И &УсловиеПоКодамЗСБ
				 // Кухарь А.Ю.  20.03.2025 начало
				 //Потеряло актуальность
				 // |				И (
				 //|					ШтрихКодУпаковки.СпособВводаВОборот = ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.МаркировкаОстатков)
				 //|					ИЛИ ШтрихКодУпаковки.СпособВводаВОборот = ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.Перемаркировка)				
				 //|				)				  
				 // Кухарь А.Ю.  20.03.2025 конец
				 
				|		) КАК СтатусыКМ_ФактСрезПоследних
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК СпрШтрихКод
	             |		ПО (СпрШтрихКод.Ссылка = СтатусыКМ_ФактСрезПоследних.ШтрихКодУпаковки)
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрШтрихКод_Владелец
	             |		ПО (СпрШтрихКод_Владелец.Ссылка = СпрШтрихКод.Владелец)
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрШтрихКод_ВладелецРодитель
	             |		ПО (СпрШтрихКод_ВладелецРодитель.Ссылка = СпрШтрихКод_Владелец.Родитель)
	             |ГДЕ
	             |	СтатусыКМ_ФактСрезПоследних.Статус В(&Статус)
	             |	И СтатусыКМ_ФактСрезПоследних.Местонахождение В(&СписокМестонахождений)";
  	//--Ратманов	
	МассивМестоНахождений=новый Массив;
	если ОбщегоНазначения_ПИ.ЭтоУзел_ODN_или_OD7() тогда
		МассивМестоНахождений.Добавить(Неопределено);
		МассивМестоНахождений.Добавить(Справочники.Подразделения.ПустаяСсылка());
	КонецЕсли;
	МассивМестоНахождений.Добавить(ПараметрыПоиска.Подразделение);
	
	
	// Кухарь А.Ю.  19.01.2025 начало
	// Иногда коды бронируют, тогда брать нужно только из забронированных
	ОграничитьКодамиЗСБ=ложь;
	если ПараметрыПоиска.Свойство("СписокКодовИзРанееСозданныхЗСБ") и ПараметрыПоиска.Свойство("Накладная")  тогда
		Если ПараметрыПоиска.СписокКодовИзРанееСозданныхЗСБ тогда
			ОграничитьКодамиЗСБ=Истина;
			
			ЗапросЗСБ=новый запрос;
			ЗапросЗСБ.Текст="ВЫБРАТЬ различные
			|	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
			|ИЗ
			|	Документ.ЗаданиеНаСборкуКомплектовЧЗ.ШтрихкодыУпаковок КАК ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок
			|ГДЕ
			|	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.Ссылка.Проведен
			|	И ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.Ссылка.ДокОснование = &Накладная
			|	И ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.ЗабронированПодСборку";
			ЗапросЗСБ.УстановитьПараметр("Накладная",ПараметрыПоиска.Накладная);
			МассивДоступныхКодов=ЗапросЗСБ.Выполнить().Выгрузить().ВыгрузитьКолонку("ШтрихкодУпаковки");
			
		КонецЕсли;
	КонецЕсли;
	если ОграничитьКодамиЗСБ тогда
		запрос.Текст=СтрЗаменить(запрос.Текст,"И &УсловиеПоКодамЗСБ","И ШтрихКодУпаковки В (&МассивДоступныхКодов)");
		запрос.УстановитьПараметр("МассивДоступныхКодов",МассивДоступныхКодов);
	иначе
		запрос.УстановитьПараметр("УсловиеПоКодамЗСБ",Истина);
	КонецЕсли;
	// Кухарь А.Ю.  19.01.2025 конец
	
	
	запрос.УстановитьПараметр("СписокМестонахождений",МассивМестоНахождений);
	запрос.УстановитьПараметр("МассивИсключаемыхКодов",ПараметрыПоиска.МассивИсключаемыхКодов);
	запрос.УстановитьПараметр("Номенклатура",ПараметрыПоиска.Номенклатура);
	запрос.УстановитьПараметр("ТипШК",ПараметрыПоиска.ТипШК);

	
	
	если ПараметрыПоиска.свойство("ОжидаемыйСтатусКода") тогда
		//Кухарь А.Ю.  23.02.2025 начало
		// Временно на переходный период. 
		//При следующем обновлении вернуть как было 
		//запрос.УстановитьПараметр("Статус",ПараметрыПоиска.ОжидаемыйСтатусКода); 
		СписокСтатусов = новый СписокЗначений;
		СписокСтатусов.Добавить(ПараметрыПоиска.ОжидаемыйСтатусКода);
		СписокСтатусов.Добавить(Перечисления.СтатусыКодовМаркировкиФакт.НанесенВиртуально);	
		запрос.УстановитьПараметр("Статус",СписокСтатусов); 
		СтатусСтрокой=Строка(ПараметрыПоиска.ОжидаемыйСтатусКода);
		
		//Кухарь А.Ю.  23.02.2025 конец			
	иначе
		запрос.УстановитьПараметр("Статус",Перечисления.СтатусыКодовМаркировкиФакт.ГотовКПечати); 	
		СтатусСтрокой=Строка("Готов к печати");

	КонецЕсли;
	

	// Кухарь А.Ю.  19.02.2025 конец
	
	
	Выборка=запрос.Выполнить().Выбрать();
	если Выборка.Количество()=0 тогда
		СтруктураВозврата.Успех=ложь;
		
		// Кухарь А.Ю.  25.02.2025 начало
		// Пустая задача
		//СтруктураВозврата.Ошибки=СтрШаблон("Не найдено ни одного кода ЧЗ в статусе %1, по номенклатуре %2",СтатусСтрокой,ПараметрыПоиска.Номенклатура);
		СтруктураВозврата.Ошибки=СтрШаблон("Не найдено ни одного кода ЧЗ в статусе %1, по номенклатуре %2, (%3)",
		СтатусСтрокой,ПараметрыПоиска.Номенклатура,ПолучитьРеквизитШапки(ПараметрыПоиска.Номенклатура,"Код","Справочник"));
		// Кухарь А.Ю.  25.02.2025 конец
		
	КонецЕсли;
	
	пока выборка.Следующий() цикл
		СтруктураВозврата.КодЧЗ=Выборка.КодЧЗ;
		//20,01,2025 Ратманов исправление ошибки по HELP-2593
		ЗаполнитьЗначенияСвойств(СтруктураВозврата,Выборка);
		//СтруктураВозврата.ЗначениеКМ=Выборка.ЗначениеКМ;
	КонецЦикла;
	
	ТекстСообщения = "МаркировкаКС.ПолучитьСвободныйКодДляПечати";
	ЗаписатьВЛог("Мониторинг СтатусыКМ_Факт", ТекстСообщения, , , , (ТекущаяУниверсальнаяДатаВМиллисекундах()-Начало)/1000);
	
	Возврат СтруктураВозврата;
КонецФункции

// Кухарь А.Ю.  19.01.2025 начало
//
Функция ПолучитьСтруктуруКодаДляПечати (КодЧЗ) экспорт
	Запрос=новый запрос;
	СтруктураВозврата=новый Структура("Успех,Ошибки,КодЧЗ,ЗначениеКМ,Цвет,Размер,Артикул");
	СтруктураВозврата.Успех=ложь;
	СтруктураВозврата.Ошибки=новый Массив;
	запрос.Текст="ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК КодЧЗ,
	|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК ЗначениеКМ,
	|	ШтрихкодыУпаковокТоваров.Владелец.Цвет КАК Цвет,
	|	ШтрихкодыУпаковокТоваров.Владелец.Размер КАК Размер,
	|	ШтрихкодыУпаковокТоваров.Владелец.Родитель.КодПроизводителя КАК Артикул
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	ШтрихкодыУпаковокТоваров.Ссылка = &КодЧЗ";
	запрос.УстановитьПараметр("КодЧЗ",КодЧЗ);
	Выборка=запрос.Выполнить().Выбрать();
	пока Выборка.Следующий() цикл
		ЗаполнитьЗначенияСвойств(СтруктураВозврата,Выборка);
		СтруктураВозврата.Успех=Истина;
	КонецЦикла;
	если не СтруктураВозврата.Успех тогда
		СтруктураВозврата.Ошибки.Добавить("Не найден код ЧЗ");
	КонецЕсли;
	
	возврат СтруктураВозврата;
	
КонецФункции



Функция ПолучитьПоляКМДляПечати(КМ) экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Владелец							КАК Номенклатура,
	|	Владелец.Родитель.КодПроизводителя	КАК Артикул,
	|	Владелец.Цвет						КАК Цвет,
	|	Владелец.Размер						КАК Размер,
	|	Ссылка								КАК ШтрихкодУпаковки,	
	|	ЗначениеШтрихкода					КАК ЗначениеКМ
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	Ссылка = &КМ
	|";
	
	Запрос.УстановитьПараметр("КМ", КМ);
	рЗапроса = Запрос.Выполнить();
	
	Результат = Новый Структура;
	Для Каждого Кол Из рЗапроса.Колонки Цикл
		Результат.Вставить(Кол.Имя, Неопределено);	
	КонецЦикла; 
	Выборка = рЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);	
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ПолучитьПоляКМДляПечати(КМ)

Функция ДобавитьСообщения(Результат1, Результат2) Экспорт	
	Если ТипЗнч(Результат2)= Тип("Массив") Тогда
		ДанныеИст = Результат2;
	Иначе
		ДанныеИст = Результат2.Сообщения;
	КонецЕсли; 
	
	Если ТипЗнч(Результат1) = Тип("Массив") Тогда
		ДанныеПол = Результат1;
	Иначе
		ДанныеПол = Результат1.Сообщения;
	КонецЕсли; 
	
	Для Каждого Строка Из ДанныеИст Цикл
		ДанныеПол.Добавить(Строка);
	КонецЦикла;
КонецФункции //ДобавитьСообщения(Результат1, Результат2)	


// Кухарь А.Ю.  19.01.2025 конец


// Кухарь А.Ю.  25.01.2025 начало
// https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-1251
Функция ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладной (Знач Накладная) экспорт
	СтруктураВозврата=новый Структура("УстановленыПравилаРаботыСАгрегацией,РазворачиватьАгрегациюДоШтук,ТребуетсяАгрегацияБлочков,ТребуетсяАгрегацияКоробок,ТребуетсяАгрегацияПаллет,ПриАгрегацииСворачиватьПоНаименованиюКонтрагента",
	ложь,ложь,ложь,ложь,ложь,Ложь); 
	//++Данилова Е.В. 14.01.2026 ASU-2089 
	СтруктураВозврата.Вставить("ФормироватьНаборКодовАгрегацииНаПаллету",Ложь); 
	//--Данилова Е.В. 14.01.2026 
	//++Данилова Е.В. 09.02.2026 SNL-131
	если ТипЗнч(Накладная)<>тип("ДокументСсылка.РасходнаяНакладная")
		ИЛИ Не ЗначениеЗаполнено(Накладная) тогда  
	//--Данилова Е.В. 09.02.2026 
		возврат СтруктураВозврата;
	ИначеЕсли не ПолучитьРеквизитШапки(Накладная,"ТребуетсяМаркировка") тогда
		возврат СтруктураВозврата;
	КонецЕсли;
	
	
	Правила=ПолучитьРеквизитШапки(Накладная,"ПравилаАгрегацииЧестногоЗнака","Документ");
	если Правила=Справочники.ПравилаАгрегацииЧестногоЗнака.ПустаяСсылка() тогда
		возврат СтруктураВозврата;
	Иначе
		СтруктураВозврата.УстановленыПравилаРаботыСАгрегацией=Истина;
	КонецЕсли;
	//++Данилова Е.В. 14.01.2026 ASU-2089
	//РеквизитыПравил=ПолучитьРеквизитыШапки(Правила,"РазворачиватьАгрегациюДоШтук,ТребуетсяАгрегацияБлочков,ТребуетсяАгрегацияКоробок,ТребуетсяАгрегацияПаллет,ПриАгрегацииСворачиватьПоНаименованиюКонтрагента","Справочник");	
	СтрокаРеквизитов = "РазворачиватьАгрегациюДоШтук,ТребуетсяАгрегацияБлочков,ТребуетсяАгрегацияКоробок,ТребуетсяАгрегацияПаллет,
	|ПриАгрегацииСворачиватьПоНаименованиюКонтрагента,ФормироватьНаборКодовАгрегацииНаПаллету"; 
	РеквизитыПравил=ПолучитьРеквизитыШапки(Правила,СтрокаРеквизитов,"Справочник");	
	//--Данилова Е.В. 14.01.2026 
	ЗаполнитьЗначенияСвойств(СтруктураВозврата,РеквизитыПравил);
	возврат СтруктураВозврата;
	
КонецФункции

// Кухарь А.Ю. 07.04.2025 начало 
//Процедура ЗавершитьВсеЛСК (ЗСБ) экспорт
Процедура ЗавершитьВсеЛСК (ЗСБ,Проводить=ложь) экспорт
// Кухарь А.Ю. 07.04.2025 конец

	
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ЛистСборкиКомплектовЧЗ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЛистСборкиКомплектовЧЗ КАК ЛистСборкиКомплектовЧЗ
	|ГДЕ
	|	ЛистСборкиКомплектовЧЗ.Проведен
	|	И ЛистСборкиКомплектовЧЗ.ДокОснование = &ЗСБ
	|	И не ЛистСборкиКомплектовЧЗ.Завершен";
	запрос.УстановитьПараметр("ЗСБ",ЗСБ);
	Выборка = запрос.Выполнить().Выбрать();
	пока выборка.Следующий() цикл
		ЛСКОб=выборка.ссылка.ПОлучитьобъект();
		ЛСКОб.Завершен = Истина;
		
		// Кухарь А.Ю. 07.04.2025 начало
		//ЛСКОб.записать();  
		если Проводить тогда
			ЛСКОб.записать(РежимЗаписиДокумента.Проведение);  
		иначе
			ЛСКОб.записать();   
		КонецЕсли;
		// Кухарь А.Ю. 07.04.2025 конец
		
	КонецЦикла;
КонецПроцедуры
// Кухарь А.Ю.  29.01.2025 конец


// Кухарь А.Ю. 10.03.2025 начало
// Пустая задача
Процедура ЗаполнитьТабличныеЧастиПризнакомМаркировки(НакладнаяОбъект) экспорт 
	ТипНакладной=ТипЗнч(НакладнаяОбъект);
	ТаблицаТоваров=Неопределено;
	ЗаполнитьКомплектующиеПоТоварамРНК=ложь;
	если ТипНакладной=Тип("ДокументОбъект.РасходнаяНакладная") тогда
		ТаблицаТоваров=ПодготовитьТаблицуСПереопределяемойДатойНачалаРаботыСМаркировкой(НакладнаяОбъект,"Товары");
		если НакладнаяОбъект.ОтгрузкаКомплектов тогда
			ЗаполнитьКомплектующиеПоТоварамРНК = Истина;
		КонецЕсли;
	ИначеЕсли ТипНакладной=Тип("ДокументОбъект.Перемещение") тогда
		ТаблицаТоваров=ПодготовитьТаблицуСПереопределяемойДатойНачалаРаботыСМаркировкой(НакладнаяОбъект,"Товары");		
	КонецЕсли;


	
	если ТаблицаТоваров<>Неопределено тогда
		Для каждого СтрТЧ из НакладнаяОбъект.товары цикл
			СтрокаТЗ=ТаблицаТоваров.найти(СтрТЧ.Номенклатура,"Номенклатура");
			если СтрокаТЗ=Неопределено тогда      
				СтрТЧ.ТребуетсяМаркировка=ложь;
			иначе
				Если СтрокаТЗ.ДатаНачалаРаботыСМаркировкой<=НакладнаяОбъект.Дата тогда
					СтрТЧ.ТребуетсяМаркировка=Истина;
				иначе
					СтрТЧ.ТребуетсяМаркировка=ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	если ЗаполнитьКомплектующиеПоТоварамРНК тогда
		Для каждого СтрТЧ из НакладнаяОбъект.Комплектующие цикл
			ВидНоменклатуры= ОбщегоНазначения_ПИ.ПолучитьРеквизитШапкиПИ(СтрТЧ.Номенклатура,"Родитель.ВидНоменклатуры","Справочник");
			если ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Товар  тогда
				СтрокаТоваров=НакладнаяОбъект.Товары.Найти(СтрТЧ.Продукция,"Номенклатура");
				Если СтрокаТоваров=Неопределено тогда
					СтрТЧ.ТребуетсяМаркировка = ложь;
				Иначе
					СтрТЧ.ТребуетсяМаркировка =СтрокаТоваров.ТребуетсяМаркировка;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры

Функция Состояние_(ТекстСообщения) Экспорт
	#ЕСЛИ КЛИЕНТ ТОГДА
	Состояние(ТекстСообщения); 
	#КОНЕЦЕСЛИ
КонецФункции //Состояние_(ТекстСообщения) Экспорт
// Кухарь А.Ю.  29.01.2025 конец
 //++Данилова Е.В. 20.11.2025 MARK-2406 
 //ЛНОбъект или ДокументОбъект.ЛистНабора или  ДокументОбъект.ЛистПереукладки 
 //Данилова Е.В. 02.04.2026 MARK-3539  добавлен параметр
 Функция ПроверитьКорректностьЗаполненияКмБлочковПоЛН(Знач ДокументОбъект,ИспользоватьЛНТолькоДляНабора = Ложь) Экспорт 
	 //++Данилова Е.В. 02.04.2026 MARK-3539
	 Если ИспользоватьЛНТолькоДляНабора Тогда
	 
	 	Возврат истина; 	
	 
	КонецЕсли;
	//--Данилова Е.В. 02.04.2026
	 ПравилаРаботыСАгрегациейЧЗ=МаркировкаКС.ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладной(ДокументОбъект.ДокОснование); 
	 
	 Если ДокументОбъект.ШтрихкодыУпаковок.Количество() > 0 
		 И ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияБлочков тогда
		 
		 Запрос = Новый Запрос;
		 Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
		 |	ЛистНабораШтрихкодыУпаковок.ШтрихкодБлочка КАК ШтрихкодБлочка
		 |ПОМЕСТИТЬ ВТБлочки
		 |ИЗ
		 |	&ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ ПЕРВЫЕ 1
		 |	ВТБлочки.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		 |ИЗ
		 |	ВТБлочки КАК ВТБлочки
		 |ГДЕ
		 |	ВТБлочки.ШтрихкодБлочка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ ПЕРВЫЕ 1
		 |	ВТБлочки.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		 |ИЗ
		 |	ВТБлочки КАК ВТБлочки
		 |ГДЕ
		 |	ВТБлочки.ШтрихкодБлочка = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)";
		 
		 Запрос.УстановитьПараметр("ШтрихкодыУпаковок", ДокументОбъект.ШтрихкодыУпаковок.Выгрузить());
		 
		 ПакетРезультатов = Запрос.ВыполнитьПакет();
		 
		 РезультатНеПустые =  ПакетРезультатов[1];
		 РезультатПустые =  ПакетРезультатов[2];
		 
		 Если НЕ РезультатНеПустые.Пустой()
			 И НЕ РезультатПустые.Пустой() Тогда
			 
			 Возврат Ложь; 	
			 
		 КонецЕсли;
		 
		 
	 КонецЕсли;
	 
	 Возврат Истина; 
	 
 КонецФункции // ()
 
  //--Данилова Е.В. 20.11.2025
 
 //Данилова Е.В. 02.12.2025  MARK-2986 
 #Область ЗавершениеЛНЛП_ЧЗ
  
 Функция ПроверитьЗавершениеЛП(ЛНОбъект,ПравилаАгрегации) Экспорт
	 //++Данилова Е.В. 10.12.2025 исправление ошибки 
	 Если ПравилаАгрегации = Неопределено тогда
		 
		 ПравилаАгрегации = МаркировкаКС.ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладной(ЛНОбъект.Докоснование);		   
		 
	 КонецЕсли;     
	 //--Данилова Е.В. 10.12.2025 
	 НеЗавершен = Ложь; 
	 КоличествоТовара 	= ЛНОбъект.Товары.Итог("Количество");	  
	 Отсканировано 		= ЛНОбъект.Товары.Итог("Отсканировано");
	 
	 Если ПравилаАгрегации.ТребуетсяАгрегацияКоробок Тогда   
		 Если ЛНОбъект.ШтрихкодыУпаковок.Количество() > 0  Тогда
			 ТипОтсканированногоШК =  ЛНОбъект.ШтрихкодыУпаковок[0].ШтрихкодУпаковки.ТипШК; 
			 Если ТипОтсканированногоШК <> Перечисления.ТипыШтрихКодов.Коробка
				 И НЕ ЗначениеЗаполнено(ЛНОбъект.КодАгрегации) Тогда   		 
				 
				 НеЗавершен = Истина;  
				 
			 КонецЕсли;
		 Иначе 
			 НеЗавершен = Истина; 
		 КонецЕсли;
		
	 КонецЕсли; 
	 
	 Если ПравилаАгрегации.ТребуетсяАгрегацияБлочков Тогда
		 
		 Если ЛНОбъект.ШтрихкодыУпаковок.Количество() > 0  Тогда
			 ТипОтсканированногоШК =  ЛНОбъект.ШтрихкодыУпаковок[0].ШтрихкодУпаковки.ТипШК;
			 Отбор = Новый Структура("ШтрихкодБлочка",Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка());
			 БлочкиПустые = ЛНОбъект.ШтрихкодыУпаковок.НайтиСтроки(Отбор);
			 //++Данилова Е.В. 27.04.2026 MARK-3539
			 //Если (ТипОтсканированногоШК <> Перечисления.ТипыШтрихКодов.Блочок
			 //    И БлочкиПустые.Количество() > 0
			 
			 //НеЗавершен = Истина;
			 Если  БлочкиПустые.Количество() > 0	 Тогда  
				 
				 Если  ТипОтсканированногоШК <> Перечисления.ТипыШтрихКодов.Блочок 
					 И ТипОтсканированногоШК <> Перечисления.ТипыШтрихКодов.Коробка Тогда 
					 
					 НеЗавершен = Истина;
				 ИначеЕсли ТипОтсканированногоШК =  Перечисления.ТипыШтрихКодов.Коробка Тогда 
					 
					 Запрос = Новый Запрос;
					 Запрос.Текст = 
					 "ВЫБРАТЬ РАЗЛИЧНЫЕ
					 |	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка КАК Ссылка
					 |ИЗ
					 |	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
					 |ГДЕ
					 |	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка = &Ссылка
					 |	И ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Блочок)";
					 
					 Запрос.УстановитьПараметр("Ссылка", ЛНОбъект.ШтрихкодыУпаковок[0].ШтрихкодУпаковки);
					 				 
					 РезультатЗапроса = Запрос.Выполнить();
					 
					 НеЗавершен = РезультатЗапроса.Пустой(); 
					 
				 КонецЕсли;
				 //--Данилова Е.В. 27.04.2026	 
			 КонецЕсли;
		 Иначе 
			 НеЗавершен = Истина; 
		 КонецЕсли;  
		 
	 КонецЕсли;  
	 
	 Если КоличествоТовара <> Отсканировано
		 ИЛИ КоличествоТовара = 0 
		 ИЛИ Отсканировано = 0 Тогда
	 
		 НеЗавершен = Истина; 	
	 
	 КонецЕсли; 
	 
	Возврат НЕ НеЗавершен; 	
	 
 КонецФункции  
  
 Процедура ВернутьВРаботуЛН(Знач ЛНОбъект, ФормаЛН) Экспорт 
	 //++Данилова Е.В. 29.05.2026 
	 Если НЕ ПроверитьВозможностьВозвратаВработу(ЛНОбъект) Тогда
	    Сообщить("По документам маркировки по РНК выполняются операции агрегации"); 
	 	Возврат; 	
	 
	 КонецЕсли; 
	 //--Данилова Е.В. 29.05.2026 
	 ЛНОбъект.Завершен = Ложь;
	 
	 Если ТипЗнч(ЛНОбъект) = Тип("ДокументОбъект.ЛистНабора") Тогда 
		 
		 ЛНОбъект.ОкончаниеСканирования = Дата(1,1,1); 
		 ЛНОбъект.ВремяОкончанияСканирования = Дата(1,1,1);
		 
	 ИначеЕсли ТипЗнч(ЛНОбъект) = Тип("ДокументОбъект.ЛистПереукладки") Тогда
		 
		 ЛНОбъект.ДатаОкончанияСканирования = Дата(1,1,1); 
		 
	 КонецЕсли;
	 ЛНОбъект.ДополнительныеСвойства.Вставить("ВозвратВработу",Истина); 
	 ФормаЛН.ЗаписатьВФорме();
	 ЛНОбъект.ДополнительныеСвойства.Вставить("ВозвратВработу",Ложь); 
	 //++Данилова Е.В. 18.06.2026 Проб.№0000000107
	 //закомментировала, вызывает проблемы переоткрытие 
	 
	 ////++Данилова Е.В. 16.06.2026 0000001470
	 //ИсхНеПроверятьПередЗакрытием = ФормаЛН.НеПроверятьПередЗакрытием;
	 //ИсхНеПройденКонтрольАгрегации  = ФормаЛН.НеПройденКонтрольАгрегации;
	 //ИсхШтрихкодыНаКонтроль  = ФормаЛН.ШтрихкодыНаКонтроль;
	 //
	 //ФормаЛН.НеПроверятьПередЗакрытием = Истина; 
	 //ФормаЛН.закрыть();
	 //
	 //ФормаЛННов = ЛНОбъект.получитьформу(); 
	 //ФормаЛННов.НеПроверятьПередЗакрытием = ИсхНеПроверятьПередЗакрытием;
	 //ФормаЛННов.НеПройденКонтрольАгрегации =  ИсхНеПройденКонтрольАгрегации;
	 //ФормаЛННов.ШтрихкодыНаКонтроль = ИсхШтрихкодыНаКонтроль;
	 //ФормаЛННов.Открыть(); 
	 //// Кухарь А.Ю.  12.12.2025 начало
	 ////ФормаЛН.закрыть();
	 ////ЛНОбъект.получитьформу().открыть();
	 //// Кухарь А.Ю.  12.12.2025 конец
	 ////--Данилова Е.В. 16.06.2026
	 
	  //--Данилова Е.В. 18.06.2026 
	   
 КонецПроцедуры  
//Данилова Е.В. 18.06.2026 Проб.№0000000107 добавлен параметр 
Процедура УстановитьДоступностьЗавершенныхЛистовНабора(ЭтаФорма,Завершен,СохраненныеНастройкиФормы = неопределено)  Экспорт
	
	// Кухарь А.Ю.  12.12.2025 начало  
	//MARK-2986
	 //ЭтаФорма.ТолькоПросмотр = Завершен;
	 // Кухарь А.Ю.  12.12.2025 конец
	 //++Данилова Е.В. 18.06.2026 Проб.№0000000107 
	 Если СохраненныеНастройкиФормы = неопределено Тогда
	 
	 	СохраненныеНастройкиФормы = Новый Соответствие; 	
	 
	 КонецЕсли;
	 //--Данилова Е.В. 18.06.2026 
	 
	 МассивПанелей = Новый массив;             
	 // Кухарь А.Ю.  12.12.2025 начало
	 // MARK-2986
	 //МассивПанелей.Добавить("ОсновныеДействияФормы");	  
	 // Кухарь А.Ю.  12.12.2025 конец
	 
	 МассивПанелей.Добавить("ДействияФормы");
	 МассивПанелей.Добавить("КоманднаяПанель1");
	 МассивПанелей.Добавить("КоманднаяПанель2");
	 МассивПанелей.Добавить("КоманднаяПанель3");
	 МассивПанелей.Добавить("кпБрэнды");
	 МассивПанелей.Добавить("кпТовары");
	 
	// Если Завершен Тогда
	
	Для каждого ЭлементФормы Из ЭтаФорма.ЭлементыФормы Цикл 
	
		Если ТипЗнч(ЭлементФормы) = Тип("КнопкаФормы") 
			ИЛИ ТипЗнч(ЭлементФормы) = Тип("КнопкаКоманднойПанели") 
			ИЛИ ТипЗнч(ЭлементФормы) = Тип("Кнопка") 
			Тогда
			
			ЭлементФормы.Доступность = НЕ Завершен; 
			
		КонецЕсли;	
		
		// Кухарь А.Ю.  12.12.2025 начало
		если ТипЗнч(ЭлементФормы) = Тип("ТабличноеПоле") тогда    
			если Завершен тогда
				ЭлементФормы.ТолькоПросмотр = Истина; 
			//++Данилова Е.В. 18.06.2026 Проб.№0000000107
			ИначеЕсли  СохраненныеНастройкиФормы.Получить(ЭлементФормы.Имя) <> неопределено Тогда 
				 ЭлементФормы.ТолькоПросмотр  = СохраненныеНастройкиФормы.Получить(ЭлементФормы.Имя); 
			 КонецЕсли;
			 //--Данилова Е.В. 18.06.2026 
		ИначеЕсли ТипЗнч(ЭлементФормы) = Тип("ПолеВвода") или ТипЗнч(ЭлементФормы) = Тип("Флажок") тогда
			если Завершен тогда  
				ЭлементФормы.Доступность = ложь;
			//++Данилова Е.В. 18.06.2026 Проб.№0000000107
			ИначеЕсли  СохраненныеНастройкиФормы.Получить(ЭлементФормы.Имя) <> неопределено Тогда 
				 ЭлементФормы.Доступность  = СохраненныеНастройкиФормы.Получить(ЭлементФормы.Имя); 
			 КонецЕсли;
			 //--Данилова Е.В. 18.06.2026  		
		КонецЕсли;
		// Кухарь А.Ю.  12.12.2025 конец
		
	КонецЦикла;
	
	Для каждого ЭлементПанель Из МассивПанелей  Цикл
		
		Для каждого КнопкаПанели Из ЭтаФорма.ЭлементыФормы[ЭлементПанель].Кнопки Цикл
			
			Если ТипЗнч(КнопкаПанели) = Тип("КнопкаФормы") 
				ИЛИ ТипЗнч(КнопкаПанели) = Тип("КнопкаКоманднойПанели")
				ИЛИ ТипЗнч(КнопкаПанели) = Тип("Кнопка") Тогда
				//++Данилова Е.В. 17.03.2026 SNL-153 
				//Если КнопкаПанели.Имя = "ВернутьЛистВРаботу"  Тогда
				//	
				//	Продолжить; 	
				//	
				//КонецЕсли;
				//
				//КнопкаПанели.Доступность = НЕ Завершен;
				Если КнопкаПанели.Имя = "ВернутьЛистВРаботу" Тогда
					
					КнопкаПанели.Доступность = Завершен; 
				Иначе
					КнопкаПанели.Доступность = НЕ Завершен; 
				КонецЕсли;
				//--Данилова Е.В. 17.03.2026 
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	 //КонецЕсли;
	 
 КонецПроцедуры
 
Процедура УстановитьДоступностьЗавершенныхЛистовПереукладки(ЭтаФорма,Завершен)  Экспорт
	 
	ЭтаФорма.ТолькоПросмотр = Завершен;
	
	МассивПанелей = Новый массив; 
	МассивПанелей.Добавить("ОсновныеДействияФормы");
	МассивПанелей.Добавить("ДействияФормы");
	МассивПанелей.Добавить("кпТовары");
	
	// Если Завершен Тогда
	
	Для каждого ЭлементФормы Из ЭтаФорма.ЭлементыФормы Цикл
		
		Если ТипЗнч(ЭлементФормы) = Тип("КнопкаФормы") 
			ИЛИ ТипЗнч(ЭлементФормы) = Тип("КнопкаКоманднойПанели")
			ИЛИ ТипЗнч(ЭлементФормы) = Тип("Кнопка") Тогда 
			
			ЭлементФормы.Доступность = НЕ Завершен; 
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Для каждого ЭлементПанель Из МассивПанелей  Цикл
		
		Для каждого КнопкаПанели Из ЭтаФорма.ЭлементыФормы[ЭлементПанель].Кнопки Цикл
			
			Если ТипЗнч(КнопкаПанели) = Тип("КнопкаФормы") 
				ИЛИ ТипЗнч(КнопкаПанели) = Тип("КнопкаКоманднойПанели")
				ИЛИ ТипЗнч(КнопкаПанели) = Тип("Кнопка") Тогда
				//++Данилова Е.В. 17.03.2026  SNL-153 
				//Если КнопкаПанели.Имя = "ВернутьЛистВРаботу"  Тогда
				//	
				//	Продолжить; 	
				//	
				//КонецЕсли;
				//
				//КнопкаПанели.Доступность = НЕ Завершен;
				Если КнопкаПанели.Имя = "ВернутьЛистВРаботу" Тогда
					КнопкаПанели.Доступность = Завершен;	
				Иначе	
					КнопкаПанели.Доступность = НЕ Завершен;
				КонецЕсли;
				//--Данилова Е.В. 17.03.2026 
				//++Данилова Е.В. 15.06.2026 №0000001470 
				Если КнопкаПанели.Имя = "ЭтикеткаОнлайн" Тогда
				
					КнопкаПанели.Доступность = истина; 	
				
				КонецЕсли;
				//--Данилова Е.В. 15.06.2026 
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	//КонецЕсли;
	 
КонецПроцедуры

//++Данилова Е.В. 18.06.2026 Проб.№0000000107
Функция СохранитьНастройкиФормыЛНДляВосстановления(ЭтаФорма) Экспорт

	МассивПанелей = Новый массив;
	
	СоответствиеИмяДоступность = Новый Соответствие; 
	
	МассивПанелей.Добавить("ДействияФормы");
	МассивПанелей.Добавить("КоманднаяПанель1");
	МассивПанелей.Добавить("КоманднаяПанель2");
	МассивПанелей.Добавить("КоманднаяПанель3");
	МассивПанелей.Добавить("кпБрэнды");
	МассивПанелей.Добавить("кпТовары");
	
	
	
	Для каждого ЭлементФормы Из ЭтаФорма.ЭлементыФормы Цикл 
		
		Если ТипЗнч(ЭлементФормы) = Тип("КнопкаФормы") 
			ИЛИ ТипЗнч(ЭлементФормы) = Тип("КнопкаКоманднойПанели") 
			ИЛИ ТипЗнч(ЭлементФормы) = Тип("Кнопка") 
			Тогда  
			 
			СоответствиеИмяДоступность.Вставить(ЭлементФормы.Имя,ЭлементФормы.Доступность);
			
		КонецЕсли;	
		
		если ТипЗнч(ЭлементФормы) = Тип("ТабличноеПоле") тогда    
			СоответствиеИмяДоступность.Вставить(ЭлементФормы.Имя,ЭлементФормы.ТолькоПросмотр);
		ИначеЕсли ТипЗнч(ЭлементФормы) = Тип("ПолеВвода") или ТипЗнч(ЭлементФормы) = Тип("Флажок") тогда
			СоответствиеИмяДоступность.Вставить(ЭлементФормы.Имя,ЭлементФормы.Доступность);
		КонецЕсли;
		
		
	КонецЦикла;
	
	Для каждого ЭлементПанель Из МассивПанелей  Цикл
		
		Для каждого КнопкаПанели Из ЭтаФорма.ЭлементыФормы[ЭлементПанель].Кнопки Цикл
			
			Если ТипЗнч(КнопкаПанели) = Тип("КнопкаФормы") 
				ИЛИ ТипЗнч(КнопкаПанели) = Тип("КнопкаКоманднойПанели")
				ИЛИ ТипЗнч(КнопкаПанели) = Тип("Кнопка") Тогда
				
					
				СоответствиеИмяДоступность.Вставить(ЭлементФормы.Имя,ЭлементФормы.Доступность);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат СоответствиеИмяДоступность; 

КонецФункции // СохранитьНастройкиФормыДляВосстановления()

//--Данилова Е.В. 18.06.2026 
//++Данилова Е.В. 29.05.2026 SNL-223 
Функция ПроверитьВозможностьВозвратаВработу(Знач ЛНОбъект) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	МаркировкаТоваровИСМП.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
		|ГДЕ
		|	МаркировкаТоваровИСМП.Проведен
		|	И МаркировкаТоваровИСМП.ДокументОснование = &ДокументОснование
		|	И МаркировкаТоваровИСМП.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация)
		|	И МаркировкаТоваровИСМП.Статус В(&Статусы)";
	
	Статусы = Новый Массив; 
	Статусы.Добавить(Перечисления.СтатусыДокументовМаркировки.ОбработанЧЗ);
	Статусы.Добавить(Перечисления.СтатусыДокументовМаркировки.Обрабатывается);
	Статусы.Добавить(Перечисления.СтатусыДокументовМаркировки.Обработан);
	
	Запрос.УстановитьПараметр("ДокументОснование", ЛНОбъект.ДокОснование);
	Запрос.УстановитьПараметр("Статусы", Статусы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой(); 	

КонецФункции // ПроверитьВозможностьВозвратаВработу()

//--Данилова Е.В. 29.05.2026 
#КонецОбласти
#Область СканированиеКоробок
//++Данилова Е.В. 20.01.2026  SNL-107 
Функция КодАгрегатаБезПереклейки(Знач МаркаЧЗ,Знач ДокОснование) Экспорт   
	
	МожноИспользоватьФиктКоробки = ПолучитьЗначРеквСпр(ДокОснование.Контрагент,"МожноИсполКоробкиИзФиктРНК");
	
	Если  МожноИспользоватьФиктКоробки = ИСТИНА Тогда //проверка на ИСТИНУ, может вернуть и неопределено и др. значения  
		
		//заранее сформированный по РНК 
		//ШК, который был отсканирован 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШтрихкодыУпаковокТоваров.Ссылка КАК ШтрихКодУпаковки
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИспользованныеКодыАгрегаций КАК ИспользованныеКодыАгрегаций
		|		ПО ШтрихкодыУпаковокТоваров.Ссылка = ИспользованныеКодыАгрегаций.ШтрихКодУпаковки
		|			И (ИспользованныеКодыАгрегаций.ШтрихКодУпаковки = &ШК)
		|			И (ИспользованныеКодыАгрегаций.Регистратор ССЫЛКА Документ.МаркировкаТоваровИСМП)
		|			И (ИспользованныеКодыАгрегаций.Регистратор.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан))
		|			И (ИспользованныеКодыАгрегаций.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация))
		|			И (ИспользованныеКодыАгрегаций.Регистратор.ДокументОснование ССЫЛКА Документ.РасходнаяНакладная)
		|ГДЕ
		|	ШтрихкодыУпаковокТоваров.Ссылка = &ШК"; 
		
		
		Запрос.УстановитьПараметр("ШК",МаркаЧЗ); 
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Возврат НЕ РезультатЗапроса.Пустой();
		
	Иначе 
		
		Возврат ЛОЖЬ; 
		
	КонецЕсли;
	
КонецФункции 
//Данилова Е.В. 02.04.2026 MARK-3539
Функция ОтработатьСканированиеКоробаЛНЛП(Знач ЛНЛПОбъект,
	Знач ДанныеМаркиЧЗ,Знач ФормироватьНовуюЭтикеткуДляКороба, ТипШК,ЗаписатьЛНЛП = ложь,ИспользоватьЛНТолькоДляНабора = Ложь) Экспорт 
	
	СтруктураРезультата = Новый Структура("Успех,КоличествоИзШК,НовыйКод,РаспечататьНовыйКод",истина,0,Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка(),ложь); 
	//Данилова Е.В. 03.04.2026 MARK-3539	
	РезультатПроверкиСканКороба = ПроверитьОтсканированныйКоробЧЗ(ЛНЛПОбъект,ДанныеМаркиЧЗ.МаркаЧЗ,ФормироватьНовуюЭтикеткуДляКороба,ТипШК,ИспользоватьЛНТолькоДляНабора);
	//++Данилова Е.В. 02.04.2026  MARK-3539
	Если ИспользоватьЛНТолькоДляНабора  Тогда
	
		РезультатПроверкиСканКороба.ЕстьЛПЛН = Ложь; 	
	   	РезультатПроверкиСканКороба.АгрегацияПроверена  = Истина; 
	КонецЕсли;
	//--Данилова Е.В. 02.04.2026 
	Если РезультатПроверкиСканКороба.ЕстьЛПЛН Тогда
		
		СтруктураРезультата.Успех = Ложь; 	
		Возврат СтруктураРезультата; 	
		
	КонецЕсли;				
	Если НЕ РезультатПроверкиСканКороба.ВложенияПроверены Тогда
		
		Сообщить("Во вложениях короба найден ЧЗ отгруженный или списанный!!! Отсканируйте другой короб! ");					
		СтруктураРезультата.Успех = Ложь;
		Возврат СтруктураРезультата; 
	КонецЕсли;
	
	Если НЕ РезультатПроверкиСканКороба.АгрегацияПроверена Тогда
		
		Сообщить("Отсканированный короб расформирован!!! Будет сформирован новый код коробки, распечатайте и отсканируйте его!");
		
		//Если ЭтоНовый() Тогда
		Если ЗаписатьЛНЛП Тогда 	
			
			ЛНЛПОбъект.Записать(); 	
			
		КонецЕсли;
		
		НовыйАгрегационныйКод = СформироватьНовыйАгрегационныйКодКоробаДляСканирования(ЛНЛПОбъект.ссылка,ЛНЛПОбъект.ДокОснование,ДанныеМаркиЧЗ.МаркаЧЗ);
		
		СтруктураРезультата.НовыйКод = НовыйАгрегационныйКод;
		СтруктураРезультата.РаспечататьНовыйКод = ЗначениеЗаполнено(НовыйАгрегационныйКод); 
		
		Возврат СтруктураРезультата; 			 
		
	КонецЕсли;
	
	Если РезультатПроверкиСканКороба.КоличествоЧЗ > 0  Тогда
		
		ДанныеМаркиЧЗ.Количество = РезультатПроверкиСканКороба.КоличествоЧЗ; 	
		
		КоличествоИзШК =  ДанныеМаркиЧЗ.Количество;
		
		СтруктураРезультата.КоличествоИзШК = КоличествоИзШК; 
	КонецЕсли; 
	
	Возврат СтруктураРезультата; 

КонецФункции 

//Данилова Е.В. 03.04.2026 MARK-3539
Функция ПроверитьОтсканированныйКоробЧЗ(ЛНЛПОбъект, Знач МаркаЧЗ,Знач ФормироватьНовуюЭтикеткуДляКороба, ТипШК,ИспользоватьЛНТолькоДляНабора = Ложь)  Экспорт
	СтруктураПроверки = Новый Структура("АгрегацияПроверена,ВложенияПроверены,ЕстьЛПЛН,КоличествоЧЗ",истина, истина,ЛОЖЬ,0); 
	Если ТипШК <> Перечисления.ТипыШтрихКодов.Коробка Тогда
		
		Возврат СтруктураПроверки; 		
		
	КонецЕсли;
	ДокОснование = ЛНЛПОбъект.ДокОснование; 
	ПравилаРаботыСАгрегациейЧЗ = МаркировкаКС.ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладной(ДокОснование);		
	Если ТипЗнч(ЛНЛПОбъект) = Тип("ДокументОбъект.ЛистНабора") Тогда 
		ВидОбъекта = "ЛистНабора"; 
	ИначеЕсли ТипЗнч(ЛНЛПОбъект) = Тип("ДокументОбъект.ЛистПереукладки") Тогда
		ВидОбъекта = "ЛистПереукладки";
	КонецЕсли;
	//++Данилова Е.В. 30.03.2026 SNL-153 
	//Если НЕ ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияБлочков 
	//	И ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияКоробок  Тогда
	Если ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияКоробок  Тогда
		//--Данилова Е.В. 30.03.2026 
		
		Если ТипЗнч(ЛНЛПОбъект) = Тип("ДокументОбъект.ЛистНабора")
			И ЕстьЛПСАгрегацией(ДокОснование) тогда
			Сообщить("Агрегация начата в листах переукладки");
			СтруктураПроверки.ЕстьЛПЛН = Истина; 
			возврат СтруктураПроверки;
		КонецЕсли;
		
		Если ТипЗнч(ЛНЛПОбъект) = Тип("ДокументОбъект.ЛистПереукладки")
			И ОбщегоНазначения_ПИ.ЕстьЛНСКодамиАгрегации(ДокОснование,ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияКоробок,ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияБлочков) тогда
			Сообщить("Агрегация начата в листах набора");
			СтруктураПроверки.ЕстьЛПЛН = Истина; 
			возврат СтруктураПроверки;
		КонецЕсли;
		
		МассивВложенныхШК = МаркаЧЗ.ВложенныеШтрихкоды.ВыгрузитьКолонку("Штрихкод");
		Если МассивВложенныхШК.Количество() = 0 И НЕ ФормироватьНовуюЭтикеткуДляКороба Тогда
			
			ВложенияПроверены = истина;	
			
		Иначе 
			СтруктураВложенияТары = ПолучитьСтруктуруВложенныхКодов(ТипШК, МаркаЧЗ.Наименование, ВидОбъекта);
			
			Если Не СтруктураВложенияТары.Успех Тогда
				
				ВложенияПроверены = Ложь;
				СтруктураПроверки.ВложенияПроверены = Ложь;
				Сообщить(СтрСоединить(СтруктураВложенияТары.Ошибки, Символы.ПС));
				Возврат СтруктураПроверки;  
			Иначе 
				ВложенияПроверены = истина; 		
			КонецЕсли; 
		КонецЕсли;
		КМНаПереклейку = НЕ КодАгрегатаБезПереклейки(МаркаЧЗ,ДокОснование) И ФормироватьНовуюЭтикеткуДляКороба;
			
		Если НЕ КМНаПереклейку 
			//++Данилова Е.В. 03.04.2026 MARK-3539
			И НЕ ИспользоватьЛНТолькоДляНабора Тогда 
			//--Данилова Е.В. 03.04.2026 
			
			ДобавитьВТЧДляДальнейшейАгрегации(ЛНЛПОбъект,МаркаЧЗ,МаркаЧЗ);
			
		КонецЕсли;
			
		КоличествоПоКоробкеИзЧЗ = КоличествоВложенныхШтукПоМарке(МаркаЧЗ); //МассивВложенныхШК.Количество(); 
		
		Если НЕ ЗначениеЗаполнено(МаркаЧЗ.Владелец) Тогда
			
			КоличествоПоКоробкеИзЧЗ = 0; 	
			
		КонецЕсли;
		
		Возврат  Новый Структура("АгрегацияПроверена,ВложенияПроверены,ЕстьЛПЛН,КоличествоЧЗ",НЕ КМНаПереклейку, ВложенияПроверены,ЛОЖЬ,КоличествоПоКоробкеИзЧЗ);
	Иначе 
		Возврат СтруктураПроверки;  
	КонецЕсли; 
	
КонецФункции // ОтработатьСканированиеКоробаЧЗ() 

Процедура ДобавитьВТЧДляДальнейшейАгрегации(ЛНЛПОбъект, Знач НовыйКодКоробки, Знач ИсходныйКодКоробки) Экспорт
	
	Если НовыйКодКоробки = ИсходныйКодКоробки Тогда		
		
		Если  ЛНЛПОбъект.ШтрихкодыКоробокДляАгрегации.Найти(ИсходныйКодКоробки,"НовыйКодКоробки") <> неопределено Тогда
			Возврат; 
		Конецесли; 
		
	КонецЕсли;
	
	НоваяСтрокаДляАгрегации 					= ЛНЛПОбъект.ШтрихкодыКоробокДляАгрегации.Добавить(); 
	НоваяСтрокаДляАгрегации.НовыйКодКоробки 	= НовыйКодКоробки; 
	НоваяСтрокаДляАгрегации.ИсходныйКодКоробки 	= ИсходныйКодКоробки;
	
КонецПроцедуры 

Функция СформироватьНовыйАгрегационныйКодКоробаДляСканирования(Знач Ссылка,Знач Докоснование, Знач МаркаЧЗ) Экспорт
	
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();                  
	рБронирования= Документы.МаркировкаТоваровИСМП.ПолучитьРанееЗабронированныйКодАгрегацииДляЛиста(Ссылка,ДокОснование, Перечисления.ТипыШтрихКодов.Коробка);
	ВремяВыполнения = (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000;
	ЗаписатьВЛог("Мониторинг СтатусыКМ_Факт", "Документы.МаркировкаТоваровИСМП.ПолучитьРанееЗабронированныйКодАгрегацииДляЛиста (ЛН)", , , , ВремяВыполнения);    
	ПолучаемыйКодАгрегации = Неопределено;
	если не рБронирования.Успешно тогда            
		Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();      
		рБронирования = Документы.МаркировкаТоваровИСМП.ПолучитьЗабронироватьКодАгрегацииДляЛН(Ссылка, Перечисления.ТипыШтрихКодов.Коробка,МаркаЧЗ.ТипУпаковки);
	иначе
		ПолучаемыйКодАгрегации = рБронирования.Данные[0];
	КонецЕсли;
	
	ВремяВыполнения = (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000;
	ЗаписатьВЛог("Мониторинг СтатусыКМ_Факт", "Документы.МаркировкаТоваровИСМП.ПолучитьЗабронироватьКодАгрегацииДляЛН (ЛН)", , , , ВремяВыполнения);
	
	Если ТипЗнч(ссылка) = Тип("ДокументСсылка.ЛистНабора") Тогда 
		ВидОбъекта = " Документ.ЛистНабора "; 
	ИначеЕсли ТипЗнч(ссылка) = Тип("ДокументСсылка.ЛистПереукладки") Тогда
		ВидОбъекта = " Документ.ЛистПереукладки ";
	КонецЕсли;
	
	Если рБронирования.Успешно тогда	
		
		если ПолучаемыйКодАгрегации = Неопределено тогда
			ПолучаемыйКодАгрегации = рБронирования.Данные;
		КонецЕсли;
				
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛистНабораПереукладки.КодАгрегации КАК КодАгрегации,
		|	ЛистНабораПереукладки.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЛистНабора КАК ЛистНабораПереукладки
		|ГДЕ
		|	ЛистНабораПереукладки.Проведен
		|	И ЛистНабораПереукладки.КодАгрегации = &КодАгрегации
		|	И ЛистНабораПереукладки.Ссылка <> &Ссылка";
		запрос.УстановитьПараметр("КодАгрегации",ПолучаемыйКодАгрегации);
		запрос.УстановитьПараметр("Ссылка",Ссылка);
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Документ.ЛистНабора",ВидОбъекта); 
		Выборка=запрос.Выполнить().Выбрать();
		пока выборка.Следующий() Цикл 
			Сообщить(СтрШаблон("Обнаружен дубль кода %1 в %2",ПолучаемыйКодАгрегации,выборка.ссылка));
			Возврат Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка();	
		КонецЦикла;
		//
		//КодОтсканирован = РаспечататьНовыйАгрегационныйКод(ПолучаемыйКодАгрегации,МаркаЧЗ);
		//
		//Если Не КодОтсканирован Тогда
		//	
		//	Сообщить("Код не отсканирован!!!"); 	
		//	
		//КонецЕсли;
		
		Возврат  ПолучаемыйКодАгрегации; 
		
	Иначе
		МаркировкаКС.ВывестиОшибки(рБронирования);	
		Возврат Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка();;
	КонецЕсли;
	
	
КонецФункции 

Функция РаспечататьНовыйАгрегационныйКод(Знач КодАгрегацииНовый,Знач МаркаЧЗ,Знач Докоснование, Знач ссылка)  Экспорт	
	
	ДопПараметрыНакладной=ОбщегоНазначения_ПИ.ПолучитьДопПараметрыНакладной(ДокОснование); 
	
	ПечатьНовойКомпонентой=ОбщегоНазначения_ПИ.ПолучитьЗначениеРСРеквизитыСправочников(ДопПараметрыНакладной.Получатель,"НоваяПечатьКоробов",Ложь);
	Если НЕ ПечатьНовойКомпонентой Тогда 
		
		НомерКоробки="";
		
		ОбработкаПечати = Обработки.ПечатьЭтикетокЧЗ.Создать(); 
		ИмяМакета="Этикетка_40_58_Остатки";  
		Макет = ОбработкаПечати.ПолучитьМакет(ИмяМакета);
		
		ТД = Новый ТабличныйДокумент;
		ТД.ОтображатьСетку		= Ложь;
		ТД.ОтображатьЗаголовки	= Ложь;	
		ТД.ИмяПараметровПечати	= "ПараметрыПечати_КМ_"+ИмяМакета;	
		
		ДанныеДляПечати	= Неопределено;
		
		ШтукЧЗВКоробке = КоличествоВложенныхШтукПоМарке(МаркаЧЗ); //МаркаЧЗ.ВложенныеШтрихкоды.Количество();
		
		ДопПараметры = Новый Структура("Артикул", "");
		
		ДопПараметры.Вставить("ОтображатьТекст",ложь);				  
		Строкадата = строка(Докоснование.Дата);  		
		СтрокаРнк  = Строка(Докоснование);     	
		сТРОКАРНК = СтрЗаменить(СтрокаРнк,"от","");
		сТРОКАРНК = СтрЗаменить(СтрокаРнк,Строкадата,"");	
		ДопПараметры.Вставить("Рнк",сТРОКАРНК);	   
		ДопПараметры.Вставить("ГруппаТовара",	Докоснование.ГруппыТоваров);
		ДопПараметры.Вставить("Комментарий",Докоснование.Комментарий);
		ДопПараметры.Вставить("контрагент",Докоснование.контрагент);
		//ПечататьCode128ДляАгрегаций = ПолучитьЗначРеквСпр(ДокОснование.Контрагент,"ПечататьCode128ДляАгрегаций");
		ТипШКАгрегации = ПолучитьРеквизитШапки(ДокОснование.Контрагент,"ТипШКАгрегации","Справочник");
		ПечататьCode128ДляАгрегаций = ТипШКАгрегации = Перечисления.ТипыКодировокШК.Code128;	
		АгрегацияВCode128 = Ложь;
		Если ПечататьCode128ДляАгрегаций <> Неопределено Тогда
			АгрегацияВCode128 = ПечататьCode128ДляАгрегаций;	
		КонецЕсли;
		
		Если АгрегацияВCode128 Тогда 
			ДопПараметры.Вставить("АгрегацииВCode128",АгрегацияВCode128);
		иначе
			ДопПараметры.Вставить("ДобавлятьСкобочкиВТекст",Истина); 
		КонецЕсли;
		
		Область = ОбработкаПечати.СформироватьКА(Макет, ПолучитьРеквизитШапки(КодАгрегацииНовый,"Наименование","справочник"), НомерКоробки, ШтукЧЗВКоробке, ДопПараметры);
		ТД.Вывести(Область); 
		//++Данилова Е.В. 03.03.2026 SNL-153
		Если ПараметрыСеанса.ВыводитьПечатныеФормыНаПредпросмотр Тогда 
			тд.Показать();
		Иначе
			ТД.Напечатать(); 
		КонецЕсли;
		//--Данилова Е.В. 03.03.2026 
	Иначе 
			
		КолКоробок= "";
		МожноВыводитьОбщееКоличествоМест = ЛОЖЬ;
		
		СтрокаРеквизитовСсылка = "Сканировщик,ГруппыТоваров"; 
		Реквизитыссылки			=	ПолучитьРеквизитыШапки(ссылка,СтрокаРеквизитовСсылка,"Документ");
		Сканировщик = Реквизитыссылки.Сканировщик; 
		ГруппыТоваров = Реквизитыссылки.ГруппыТоваров; 
		
		СтрокаРеквизитовДокОснования	=	"Контрагент,Контрагент.Код,Контрагент.Наименование,Контрагент.Родитель.Код,
		|СостояниеНакладной,КоличествоКоробок,Номер,
		|ПунктДоставки,ПунктДоставки.Регион,ПунктДоставки.Наименование,ПунктДоставки.НомерМагазина,ПунктДоставки.АдресПолучателя,ПунктДоставки.Телефоны,
		|РайонДоставки.Сектор.Наименование,РайонДоставки.Сектор,НомерЗаказа,
		|Организация.Наименование,Организация.Телефоны,Организация.ЮридическийАдрес";
		РеквизитыДокОснования			=	ПолучитьРеквизитыШапки(ДокОснование,СтрокаРеквизитовДокОснования,"Документ");	     	
		КодКонтрагента					=	РеквизитыДокОснования.Контрагент_Код; 
		КодКонтрагентаРодителя			=	РеквизитыДокОснования.Контрагент_Родитель_Код;  
		СостояниеНакладной				=	РеквизитыДокОснования.СостояниеНакладной;        
		КоличествоКоробок				=	РеквизитыДокОснования.КоличествоКоробок; 	
		ТабДок	= Новый ТабличныйДокумент;
		Макет=Обработки.НаклейкиНаКоробки.ПолучитьМакет("ШКНоваяКомпонента");
		
		НаборПолей = Новый Структура;
		сектор = Лев(РеквизитыДокОснования.РайонДоставки_Сектор_Наименование,2);
		НаборПолей.Вставить("сектор",РеквизитыДокОснования.РайонДоставки_Сектор);	
		НаборПолей.Вставить("Отправитель",РеквизитыДокОснования.Организация_Наименование);
		НаборПолей.Вставить("Телефон",РеквизитыДокОснования.Организация_Телефоны);	
		НаборПолей.Вставить("ЮрАД",РеквизитыДокОснования.Организация_ЮридическийАдрес);		 
		
		Регион=Неопределено; 
		АдресДляЭтикеткиИзРег ="";
		Получатель	=РеквизитыДокОснования.Контрагент_наименование;
		Регион= РеквизитыДокОснования.ПунктДоставки_Регион;	
		Грузополучатель=РеквизитыДокОснования.Контрагент;		
		АдресДляЭтикеткиИзРег=ПрочитатьЗначениеРеквизитаПНКПРМРНК("АдресДляЭтикетки",ДокОснование);		
		НаборПолей.Вставить("ад", РеквизитыДокОснования.ПунктДоставки_АдресПолучателя+ " тел.: "+РеквизитыДокОснования.ПунктДоставки_Телефоны);
		если ЗначениеЗаполнено(АдресДляЭтикеткиИзРег) тогда
			НаборПолей.ад=АдресДляЭтикеткиИзРег;
		КонецЕсли;     
		
		НаборПолей.Вставить("Пользователь",Строка(Сканировщик)+?(ПараметрыСеанса.Пользователь.ФизЛицо=Сканировщик,"","\"+Строка(ПараметрыСеанса.Пользователь.ФизЛицо)));	
		НаборПолей.Вставить("Номер", РеквизитыДокОснования.Номер);	
		НаборПолей.Вставить("Получатель",Получатель);
		НаборПолей.Вставить("Регион",Регион);   
		 
		
		НужноОбрезать=Ложь; 	
		
		
		// Кухарь А.Ю. 01.05.2025 начало
		ДопПараметрыПечати=новый Структура("КодКонтрагента,КодКонтрагентаРодителя,КолКоробок,МожноВыводитьОбщееКоличествоМест,НаборПолей,НужноОбрезать,ТабДок",
		КодКонтрагента,КодКонтрагентаРодителя,КолКоробок,МожноВыводитьОбщееКоличествоМест,НаборПолей,НужноОбрезать,ТабДок);        
		
		НомерКоробки = ""; 
		ДопПараметрыПечати.Вставить("ТребуетсяАгрегацияКоробок",истина);     
		ДопПараметрыПечати.Вставить("НомерКоробки",НомерКоробки);    
		
		ДопПараметрыПечати.Вставить("ОбработкаПечати", Обработки.ПечатьЭтикетокЧЗ.Создать());     
		
		если ЗначениеЗаполнено(КодАгрегацииНовый) тогда
			ТипШКАгрегации = ПолучитьРеквизитШапки(РеквизитыДокОснования.Контрагент,"ТипШКАгрегации","Справочник"); 
			если ТипШКАгрегации = Перечисления.ТипыКодировокШК.Code128 тогда   
				ДопПараметрыПечати.Вставить("ПечататьCode128ДляАгрегаций",Истина);
			иначе
				ДопПараметрыПечати.Вставить("ПечататьCode128ДляАгрегаций",ложь);
			КонецЕсли;
		КонецЕсли;	
		
		ШтукЧЗВКоробке = КоличествоВложенныхШтукПоМарке(МаркаЧЗ); //МаркаЧЗ.ВложенныеШтрихкоды.Количество();
		ПечатьЭтикеткиОнлайнНаСтрокуКороба(ДопПараметрыПечати,ШтукЧЗВКоробке,ГруппыТоваров,ссылка,КодАгрегацииНовый, Докоснование);
		
		ТабДок.ИмяПараметровПечати	= "ПараметрыПечати_НовыйАгрегационныйКод_НаклейкиНаКоробки";
				
		ТабДок.ОтображатьСетку 		= Ложь;	
		ТабДок.ОтображатьЗаголовки 	= Ложь;	
		ТабДок.ПолеСверху=0; ТабДок.ПолеСнизу=0; ТабДок.ПолеСлева=3; ТабДок.ПолеСправа=0;
		
		//++Данилова Е.В. 03.03.2026 SNL-153
		Если ПараметрыСеанса.ВыводитьПечатныеФормыНаПредпросмотр Тогда 
			ТабДок.Показать("Наклейки "+ РеквизитыДокОснования.Номер);
		Иначе
			ТабДок.Напечатать(); 
		КонецЕсли; 	
		//ТабДок.Показать("Наклейки "+ РеквизитыДокОснования.Номер);
		//--Данилова Е.В. 03.03.2026
	КонецЕсли; 
	
	//ОжидаемыйКодОтсканированный = КодАгрегацииНовый;
	//РаспакованныйШК = МаркаЧЗ; 
	
	Возврат Истина; 
	
	
КонецФункции 

Процедура ПечатьЭтикеткиОнлайнНаСтрокуКороба(ДопПараметрыПечати,КоличествоЧЗШтук,ГруппыТоваров,ссылка, КодАгрегацииНовый, ДокОснование) 
	
	КодКонтрагента 						=	ДопПараметрыПечати.КодКонтрагента; 
	КодКонтрагентаРодителя 				=	ДопПараметрыПечати.КодКонтрагентаРодителя;
	КолКоробок 							= 	ДопПараметрыПечати.КолКоробок;
	МожноВыводитьОбщееКоличествоМест 	= 	ДопПараметрыПечати.МожноВыводитьОбщееКоличествоМест;
	НаборПолей							= 	ДопПараметрыПечати.НаборПолей;
	НужноОбрезать 						= 	ДопПараметрыПечати.НужноОбрезать;
	ТабДок 								= 	ДопПараметрыПечати.ТабДок;
	ТребуетсяАгрегацияКоробок 			=	ДопПараметрыПечати.ТребуетсяАгрегацияКоробок;              
	НомерКоробки						=	ДопПараметрыПечати.НомерКоробки;	
	ОбработкаПечати						= 	ДопПараметрыПечати.ОбработкаПечати; 
	Номенклатура						= 	"Номенклатура: Сборная ("+ ГруппыТоваров+")"; 
	ШтукВКоробе							=	КоличествоЧЗШтук; 
	
	Лист=Ссылка;
	Макет=Обработки.НаклейкиНаКоробки.ПолучитьМакет("ШКНоваяКомпонента");
	
	ОбработкаФормированияКартинки=Обработки.СформироватьКартинкуКодаШКQR.Создать();
	СтруктураДанныхКомпонентыПечати=ОбработкаФормированияКартинки.ПолучитьКомпонентуФормированияDataMatrixКода();	
	если не СтруктураДанныхКомпонентыПечати.Успех тогда 
		Сообщить(СтруктураДанныхКомпонентыПечати.Ошибки);
		возврат;
	КонецЕсли;	
	
	ОблЭтикетка=Макет.ПолучитьОбласть("Строка|Этикетка"); 
	ПечататьCode128ДляАгрегаций 		= 	ДопПараметрыПечати.ПечататьCode128ДляАгрегаций;  
	
	
	ИмяОбластиНоменклатура =  "ОбластьНоменклатура";
	ИмяОбластиКороба =  "ОбластьКороба";
	
	попытка
		Рисунок=ОблЭтикетка.Рисунки.ШтрихКод;     
	Исключение  
		СообщитьИзМодуля("В области макета не обнаружено рисунка с именем ШтрихКод");
		возврат;
	КонецПопытки;    
	
	
	//если ШтукВКоробе>0 тогда
	//	НаборПолей.Вставить("ШтукВЛН"," - "+ШтукВКоробе+"шт.");	
	//КонецЕсли;
	
	
	
	ДопПараметры = новый Структура;
	
	//КодАгрегации=ПолучитьРеквизитШапки(Лист,"КодАгрегации","Документ");
	Если ПечататьCode128ДляАгрегаций Тогда 
		ДопПараметры.Вставить("АгрегацииВCode128",ПечататьCode128ДляАгрегаций);
	иначе
		ДопПараметры.Вставить("ДобавлятьСкобочкиВТекст",Истина); 
	КонецЕсли;		 
	ДопПараметры.Вставить("НужнаТолькоКартинка",Истина);   
	ДопПараметры.Вставить("ОтображатьТекст",ложь); 
	ДопПараметры.Вставить("ВысотаРисунка",Рисунок.Высота);
	ДопПараметры.Вставить("ШиринаРисунка",Рисунок.Ширина);		 
	Рисунок.Картинка = ОбработкаПечати.СформироватьКА(Макет, ПолучитьРеквизитШапки(КодАгрегацииНовый,"Наименование","справочник"), 0, 0, ДопПараметры);  
	
	ПрефиксКодаАгрегации="";	
	если  ДопПараметры.Свойство("ДобавлятьСкобочкиВТекст") тогда
		если ДопПараметры.ДобавлятьСкобочкиВТекст=Истина тогда
			ПрефиксКодаАгрегации="(00)";		
		КонецЕсли;
	КонецЕсли;
	НаборПолей.вставить("ШтрихКод",ПрефиксКодаАгрегации+КодАгрегацииНовый);	
	
	ОблЭтикетка.Параметры.Заполнить(НаборПолей);	 	    	
	ОблЭтикетка.Параметры.номенклатура=номенклатура;  	
	
	попытка
		если СтрДлина(ОблЭтикетка.Параметры.Номенклатура)>48 и НужноОбрезать тогда
			ОблЭтикетка.Параметры.Номенклатура=СтрЗаменить(ОблЭтикетка.Параметры.Номенклатура,"АРТ:","");
		КонецЕсли;
	Исключение
	КонецПопытки; 
	ОблЭтикетка.Параметры.ВсегоКоробов=КолКоробок;
	
	ОбластьНоменклатура=ОблЭтикетка.Области.Найти(ИмяОбластиНоменклатура); 
	если ОбластьНоменклатура<>Неопределено тогда
		если СтрДлина(ОблЭтикетка.Параметры.Номенклатура)>70 тогда
			ОбластьНоменклатура.шрифт=Новый Шрифт(ОбластьНоменклатура.шрифт,,5);
		иначеесли СтрДлина(ОблЭтикетка.Параметры.Номенклатура)>50 тогда
			ОбластьНоменклатура.шрифт=Новый Шрифт(ОбластьНоменклатура.шрифт,,6);
		иначеесли СтрДлина(ОблЭтикетка.Параметры.Номенклатура)>40 тогда
			ОбластьНоменклатура.шрифт=Новый Шрифт(ОбластьНоменклатура.шрифт,,7);
		КонецЕсли;
	КонецЕсли;         
	
	ОблЭтикетка.Параметры.НомерКороба=НомерКоробки;			
	
	ОбластьКороба=ОблЭтикетка.Области.Найти(ИмяОбластиКороба); 
	
	если МожноВыводитьОбщееКоличествоМест и облЭтикетка.Параметры.НомерКороба=КолКоробок  тогда			
		ОблЭтикетка.Параметры.ВсегоКоробов=КолКоробок;
	иначе       
		если ОбластьКороба<>Неопределено тогда
			ОбластьКороба.Текст=СтрЗаменить(ОбластьКороба.Текст,"из","");         
		КонецЕсли;
	КонецЕсли;
	
	
	Если КодКонтрагента = "EKF-0301" или КодКонтрагента = "SSR-1593" или КодКонтрагентаРодителя="SSR-7156" тогда	
		АдресИзРегистра=ПрочитатьЗначениеРеквизитаПНКПРМРНК("АдресДляЭтикетки",ДокОснование);
		если ЗначениеЗаполнено(АдресИзРегистра) тогда
			ОблЭтикетка.Параметры.АД=АдресИзРегистра;
		КонецЕсли;
		ОблЭтикетка.Параметры.НомерЗаказаЭтикетка=ДокОснование.НомерЗаказа;
		ОблЭтикетка.Параметры.Регион="";
		ОблЭтикетка.Область("ГородЗаголовок").Текст="Заказ №";
	КонецЕсли;   
	
	ТабДок.Вывести(ОблЭтикетка);
	
КонецПроцедуры

Функция КоличествоВложенныхШтукПоМарке(Знач МаркаЧЗ) Экспорт

	 ТЗВложенные =  ПолучитьВложенныеШК(МаркаЧЗ);
	 
	 Возврат ТЗВложенные.ВыгрузитьКолонку("Штрихкод").Количество(); 

КонецФункции // КоличествоВложенныхШтукПоМарке()

Функция ПроверитьОтсканированныйБлочокЧЗ(ЛНЛПОбъект, Знач МаркаЧЗ,ТипШК)  Экспорт
	СтруктураПроверки = Новый Структура("ВложенияПроверены,ЕстьЛПЛН,КоличествоЧЗ",истина,ЛОЖЬ,0); 
	Если ТипШК <> Перечисления.ТипыШтрихКодов.Блочок Тогда
		
		Возврат СтруктураПроверки; 		
		
	КонецЕсли;
	ДокОснование = ЛНЛПОбъект.ДокОснование; 
	ПравилаРаботыСАгрегациейЧЗ = МаркировкаКС.ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладной(ДокОснование);		
	Если ТипЗнч(ЛНЛПОбъект) = Тип("ДокументОбъект.ЛистНабора") Тогда 
		ВидОбъекта = "ЛистНабора"; 
	ИначеЕсли ТипЗнч(ЛНЛПОбъект) = Тип("ДокументОбъект.ЛистПереукладки") Тогда
		ВидОбъекта = "ЛистПереукладки";
	КонецЕсли;
	Если ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияБлочков  Тогда		
		
		Если ТипЗнч(ЛНЛПОбъект) = Тип("ДокументОбъект.ЛистНабора")
			И ЕстьЛПСАгрегацией(ДокОснование) тогда
			Сообщить("Агрегация начата в листах переукладки");
			СтруктураПроверки.ЕстьЛПЛН = Истина; 
			возврат СтруктураПроверки;
		КонецЕсли;
		
		Если ТипЗнч(ЛНЛПОбъект) = Тип("ДокументОбъект.ЛистПереукладки")
			И ОбщегоНазначения_ПИ.ЕстьЛНСКодамиАгрегации(ДокОснование,ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияКоробок,ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияБлочков) тогда
			Сообщить("Агрегация начата в листах набора");
			СтруктураПроверки.ЕстьЛПЛН = Истина; 
			возврат СтруктураПроверки;
		КонецЕсли;
		
		МассивВложенныхШК = МаркаЧЗ.ВложенныеШтрихкоды.ВыгрузитьКолонку("Штрихкод");
		Если МассивВложенныхШК.Количество() = 0 Тогда
			
			Сообщить("Вложения по коду ЧЗ не найдены"); 
			СтруктураПроверки.ВложенияПроверены = Ложь;
			
			Возврат СтруктураПроверки;
		Иначе 
			СтруктураВложенияТары = ПолучитьСтруктуруВложенныхКодов(ТипШК, МаркаЧЗ.Наименование, ВидОбъекта);
			
			Если Не СтруктураВложенияТары.Успех Тогда
				
				ВложенияПроверены = Ложь;
				СтруктураПроверки.ВложенияПроверены = Ложь;
				Сообщить(СтрСоединить(СтруктураВложенияТары.Ошибки, Символы.ПС));
				Возврат СтруктураПроверки;  
			Иначе 
				ВложенияПроверены = истина; 		
			КонецЕсли; 
		КонецЕсли;
					
		КоличествоПоКоробкеИзЧЗ = КоличествоВложенныхШтукПоМарке(МаркаЧЗ); //МассивВложенныхШК.Количество(); 
		
		Если НЕ ЗначениеЗаполнено(МаркаЧЗ.Владелец) Тогда
			
			КоличествоПоКоробкеИзЧЗ = 0; 	
			
		КонецЕсли;
		СтруктураПроверки.ВложенияПроверены = ВложенияПроверены;
		СтруктураПроверки.КоличествоЧЗ = КоличествоПоКоробкеИзЧЗ; 
		
		Возврат  СтруктураПроверки; 
	Иначе 
		Возврат СтруктураПроверки;  
	КонецЕсли; 
	
КонецФункции // ОтработатьСканированиеКоробаЧЗ() 

Функция ОтработатьСканированиеБлочкаЛНЛП(Знач ЛНЛПОбъект, Знач ДанныеМаркиЧЗ,ТипШК,ЗаписатьЛНЛП = ложь) Экспорт 
	
	СтруктураРезультата = Новый Структура("Успех,КоличествоИзШК",истина,0); 
	Если НЕ ДанныеМаркиЧЗ.СканировалиКодЧЗ Тогда
	
		Возврат СтруктураРезультата; 	
	
	КонецЕсли;
	РезультатПроверкиСканКороба = ПроверитьОтсканированныйБлочокЧЗ(ЛНЛПОбъект,ДанныеМаркиЧЗ.МаркаЧЗ,ТипШК);
	
	Если РезультатПроверкиСканКороба.ЕстьЛПЛН Тогда
		
		СтруктураРезультата.Успех = Ложь; 	
		Возврат СтруктураРезультата; 	
		
	КонецЕсли;				
	Если НЕ РезультатПроверкиСканКороба.ВложенияПроверены Тогда
		
		Сообщить("Во вложениях короба найден ЧЗ отгруженный или списанный!!! Отсканируйте другой короб! ");					
		СтруктураРезультата.Успех = Ложь;
		Возврат СтруктураРезультата; 
	КонецЕсли;	
		
	Если РезультатПроверкиСканКороба.КоличествоЧЗ > 0  Тогда
		
		ДанныеМаркиЧЗ.Количество = РезультатПроверкиСканКороба.КоличествоЧЗ; 	
		
		КоличествоИзШК =  ДанныеМаркиЧЗ.Количество;
		
		СтруктураРезультата.КоличествоИзШК = КоличествоИзШК; 
	КонецЕсли; 
	
	Возврат СтруктураРезультата; 

КонецФункции 

//--Данилова Е.В. 20.01.2026 	
#КонецОбласти
 
