Процедура ПередЗаписью(Отказ, Замещение)
	Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		Для Каждого Запись Из ЭтотОбъект Цикл 		 
                если ТипЗнч(Запись.Значение)=тип("Справочникссылка.ГТД") тогда 
                        если Запись.Значение.ЭтоГруппа тогда 
                                отказ=Истина; 
                                СообщитьИзМодуля("Нельзя использовать группы из справочника ГТД"); 
                        КонецЕсли; 
                КонецЕсли; 
        КонецЦикла;    
    КонецЕсли;
	УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
КонецПроцедуры
