
Функция КодТипаОплатыККМПоТипуОплаты(ТипОплаты) Экспорт
	
	Если ТипОплаты = Перечисления.ТипыОплатЧекаККМ.Наличные Тогда
		
		Возврат 0;
		
	ИначеЕсли ТипОплаты = Перечисления.ТипыОплатЧекаККМ.ПлатежнаяКарта Тогда
		
		Возврат 1;
		
	ИначеЕсли ТипОплаты = Перечисления.ТипыОплатЧекаККМ.БанковскийКредит Тогда
		
		Возврат 2;
		
	ИначеЕсли ТипОплаты = Перечисления.ТипыОплатЧекаККМ.ПодарочныйСертификат Тогда
		
		Возврат 3;
		
	ИначеЕсли ТипОплаты = Перечисления.ТипыОплатЧекаККМ.Бонусы Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции