
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Для каждого ДокСсылка Из ПараметрКоманды Цикл
		рЗаписи = ЗаписатьОтложенныеДвиженияДокументов(ДокСсылка);	
		Если рЗаписи.Успешно Тогда                          
			ТекстСообщения = СтрШаблон("Успешно записаны отложеные движения документа: '%1'.", ДокСсылка);
			Сообщить(ТекстСообщения, СтатусСообщения.Информация);
		Иначе                      
			МаркировкаКС.ВывестиОшибки(рЗаписи);
		КонецЕсли;
		МаркировкаКС.ВывестиСообщения(рЗаписи);
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ЗаписатьОтложенныеДвиженияДокументов(ДокСсылка)   
	пОбработки = Новый Структура("Ссылки", ДокСсылка);
 	Возврат РегистрыСведений.ОтложенныеДвиженияДокументов.ЗаписатьОтложенныеДвиженияДокументов(пОбработки);
КонецФункции //ЗаписатьОтложенныеДвиженияДокументов(ДокСсылка) ()
