
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ВидОперации 	= МаркировкаКС.ПолучитьЗначениеПараметра(Параметры, "ВидОперации");
	ДанныеВыбора	= Новый СписокЗначений;
	Если ВидОперации = Перечисления.ВидыОперацийМаркировки.Агрегация
		ИЛИ ВидОперации = Перечисления.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов
		ИЛИ ВидОперации = Перечисления.ВидыОперацийМаркировки.РасформированиеУпаковки Тогда
		ДанныеВыбора.Добавить(Перечисления.ТипыУпаковок.МонотоварнаяУпаковка);
		ДанныеВыбора.Добавить(Перечисления.ТипыУпаковок.МультитоварнаяУпаковка);
		
		СтандартнаяОбработка = Ложь;
	ИначеЕсли ЗначениеЗаполнено(ВидОперации) Тогда
		ДанныеВыбора.Добавить(Перечисления.ТипыУпаковок.МаркированныйТовар);
		
		СтандартнаяОбработка = Ложь;
	Иначе		
		ДанныеВыбора.Добавить(Перечисления.ТипыУпаковок.МаркированныйТовар);
		ДанныеВыбора.Добавить(Перечисления.ТипыУпаковок.МонотоварнаяУпаковка);
		ДанныеВыбора.Добавить(Перечисления.ТипыУпаковок.МультитоварнаяУпаковка);	
	КонецЕсли;
КонецПроцедуры
