Процедура ОбработкаЗаполнения(Основание)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		// Заполнение шапки
		ДокОбъект = Основание.Ссылка;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
КонецПроцедуры

//крохин начало 27.10.2011
//обмен данными + контроль константы
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если ОбменДанными.Загрузка Тогда
	Иначе
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);			
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);	
			
		//Кухарь 23.04.17 начало
		//2 новых реквизита
		если ЭтоНовый() тогда
			Автор=ПараметрыСеанса.Пользователь;
		КонецЕсли;
		АвторПоследнегоИзменения=ПараметрыСеанса.Пользователь;
		
			//Кухарь 23.04.17 конец
		//Кухарь 03.09.18 начало
	//По просьбе Лисицкого, для отчётов
		ДатаПоследнегоИзменения=ТекущаяДата();
		//Кухарь 03.09.18 конец	
		
	//крохин начало 08.09.2020
	Если ЗаказнаяМашина.Водитель.НеИспользовать Тогда
		#Если Клиент Тогда
		Сообщить("Ошибка: выбран запрещенный к использованию водитель: "+ЗаказнаяМашина.Водитель+"!");	
		#КонецЕсли
	Отказ = Истина;	
	КонецЕсли;
	//крохин конец 08.09.2020
	КонецЕсли;		
	
	Если Отказ Тогда Возврат КонецЕсли; 
	
	ЕстьИзменения		=Модифицированность();	
	НужноВыгружать		=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;
	
	
КонецПроцедуры
//крохин конец 27.10.2011