//ASU-2175
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	рПроверки = ПроверитьДокументыКОбработке(ПараметрКоманды);
			
	Для Каждого ТекстОшибки Из рПроверки.ОшибкиДокументов Цикл
		Сообщить(ТекстОшибки, СтатусСообщения.Важное);	
	КонецЦикла;
	
	Для Каждого ЗаказНаЭмиссию Из рПроверки.ДокументыКОбработке Цикл
		//++Данилова Е.В. 03.06.2025  MARK-2355 
		Реквизиты = ПолучитьРеквизитыШапки(ЗаказНаЭмиссию, "ВидКомплекта");
		//--Данилова Е.В. 03.06.2025
		рОбработки = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.СоздатьЗаказыКМКомплектующие(ЗаказНаЭмиссию,Реквизиты.ВидКомплекта);
		Если рОбработки.Успешно Тогда
			
			ТекстСообщения = СтрШаблон("По документу: %1 обработано: %2 заказов КМ.", ЗаказНаЭмиссию, рОбработки.ОбработаноОбъектов);
			Сообщить(ТекстСообщения, СтатусСообщения.Информация);
			
			
		Иначе 
			Если рОбработки.Ошибки.Количество() > 0  Тогда
				
				Сообщить(СтрСоединить(рОбработки.Ошибки, Символы.ПС), СтатусСообщения.Важное);
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПроверитьДокументыКОбработке(мСсылки)
	Результат = Новый Структура("ОшибкиДокументов,ДокументыКОбработке", Новый Массив, Новый Массив);
	
	Для Каждого ДокСсылка Из мСсылки Цикл		
		рПроверки = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ПроверитьДокументПередСозданиемЗаказовКМКомплектующие(ДокСсылка);
		Если рПроверки.Успешно Тогда
			Результат.ДокументыКОбработке.Добавить(ДокСсылка);
		Иначе
			МаркировкаКС.ДобавитьОшибки(Результат.ОшибкиДокументов, рПроверки);				
		КонецЕсли;				
	КонецЦикла; 	
	
	Возврат Результат;
КонецФункции
