
Функция ЗапросGET(Запрос)
	Ответ			= "";
	КодСостояния	= 200;
	Попытка
		рОбработки = ОбработатьЗапрос(Запрос);
		Если рОбработки.Успешно Тогда
			Ответ  = рОбработки.Данные; 			
		Иначе
			Ответ  = СтрСоединить(рОбработки.Ошибки, Символы.ПС);					
			КодСостояния = 500;
		КонецЕсли; 
	Исключение
		Ответ  = ОписаниеОшибки();
		КодСостояния = 500;
	КонецПопытки;	
	
	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	Ответ.УстановитьТелоИзСтроки(Ответ);
	
	Возврат Ответ;
КонецФункции //ЗапросGET(Запрос)

Функция ОбработатьЗапрос(Запрос)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Обработка = Неопределено;
	Если Ложь Тогда
		Обработка = Обработки.ОбменЧерезHTTPсервис.Создать();		
	Иначе
		ИмяФайлаОбработки	= ОбщегоНазначения_ПИ.КаталогВнешнихОтчетов() + "ОбменЧерезHTTP_ЧЗ.epf";		
		Файл = Новый Файл(ИмяФайлаОбработки);
		Если Файл.Существует() Тогда
			Обработка = ВнешниеОбработки.Создать(ИмяФайлаОбработки);		
		Иначе
			ТекстОшибки = СтрШаблон("Не найден файл обработки запроса: '%1' !", ИмяФайлаОбработки);
			Результат.Ошибки.Добавить(ТекстОшибки);
			Результат.Успешно = Ложь;
		КонецЕсли;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Обработка) Тогда	
		Результат = Обработка.ОбработатьЗапрос(Запрос);
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ОбработатьЗапрос(Запрос)