Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	Если ОбменДанными.Загрузка Тогда
		Движения.Взаиморасчеты.Записать();
		Движения.Затраты.Записать();
		Движения.ДенежныеСредства.Записать();	
	КонецЕсли;
	ВалютаУпр			=ПараметрыСеанса.ВалютаУпр_2009;	
	ВалютаРасчетов		=ПолучитьВалютуРасчетов(Договор);
	
	Ошибки="";
	
	КурсУпр				=ПолучитьКурсВалюты_ПоРусски(ВалютаУпр,	Дата);
	КурсВалютыДокумента	=ПолучитьКурсВалюты_ПоРусски(Валюта,	Дата);
	
	СуммаУпр			=глПересчет(СуммаДокумента,Валюта,КурсВалютыДокумента,ВалютаУпр,КурсУпр);
	КурсоваяРазница		=0;
	
	Для Каждого СтрокаТЧ Из Затраты Цикл
		СуммаДок 					= СтрокаТЧ.Сумма;
		
		Если СуммаДок=0 Тогда Продолжить КонецЕсли; 
		
		Движение 					= Движения.Затраты.Добавить();
		Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;	
		
		Движение.Период				= Дата;
		
		Движение.Подразделение		= СтрокаТЧ.Подразделение;
		Движение.СтатьяЗатрат		= СтрокаТЧ.СтатьяЗатрат;			
		Движение.СубЗатрата			= СтрокаТЧ.СубЗатрата;
				
		Движение.СуммаУпр			= глПересчет(СуммаДок,Валюта,КурсВалютыДокумента,ВалютаУпр,КурсУпр);
		
		Движение.Проект				= СтрокаТЧ.Проект;
		Движение.ПериодРасходов		= ?(ЗначениеЗаполнено(СтрокаТЧ.ПериодРасходов),НачалоМесяца(СтрокаТЧ.ПериодРасходов),НачалоМесяца(Дата));
		
		Движение.Контрагент			= Сотрудник;
		Движение.Договор			= Договор;
		
		Движение.СуммаДокумента		= СуммаДок;
		Движение.ВалютаДокумента	= Валюта;
		//крохин начало
		Движение.Комментарий        = СтрокаТЧ.Комментарий;
		Движение.КапитальныеЗатраты = СтрокаТЧ.КапитальныеЗатраты;
		//крохин конец
		
		Движение.ДатаЗаписи			= ТекущаяДата();
	КонецЦикла;
	
	
	Движение 					= Движения.Взаиморасчеты.Добавить();
	Движение.ВидДвижения		= ВидДвиженияНакопления.Расход;
	
	Движение.Период				= Дата;
	Движение.Контрагент			= Сотрудник;
	Движение.Договор 			= Договор;			
	
	Движение.СуммаВал			= глПересчет(СуммаДокумента,Валюта,Курс,ВалютаРасчетов,Дата);
	Движение.СуммаУпр			= глПересчет(СуммаДокумента,Валюта,Курс,ВалютаУпр,КурсУпр);
	
	Движение.СуммаДокумента		= СуммаДокумента;
	Движение.ВалютаДокумента	= Валюта;	
	//Движение.СтатьяДДС			= СтатьяДДС;			
	
	Если ДокОснование<>Неопределено И ЕстьРеквизитДокумента("КодОперации",ДокОснование.Метаданные()) Тогда
		Движение.КодОперации=ДокОснование.КодОперации;			
	КонецЕсли;		
	
	КурсоваяРазница=СуммаУпр-Движение.СуммаУпр;
	Если КурсоваяРазница<>0 Тогда
		Движение 					= Движения.Затраты.Добавить();
		
		Движение.ВидДвижения		= ?(КурсоваяРазница>0,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);	
		
		Движение.Период				= Дата;
		
		Движение.Подразделение		= Подразделение;
		Движение.СтатьяЗатрат		= Справочники.СтатьиЗатрат.КурсовыеРазницы;			
		
		Движение.СуммаУпр			= Модуль(КурсоваяРазница);			
		
		Движение.Контрагент			= Сотрудник;
		Движение.Договор			= Договор;
		
		Движение.СуммаДокумента		= 0;
		Движение.ВалютаДокумента	= Валюта;	
		//крохин начало
		Движение.Комментарий        = "Курсовая разница";
		//крохин конец

		
		Движение.ДатаЗаписи			= ТекущаяДата();					
	КонецЕсли;	
	
КонецПроцедуры

//СОБЫТИЯ ОБЪЕКТА
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения		=Модифицированность();
	НужноВыгружать		=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	//крохин начало
	//АВО никуда не грузятся, документ только для офиса
	НужноВыгружать = Ложь;
	//крохин конец
	Если НЕ ОбменДанными.Загрузка Тогда		
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		
		Если Отказ Тогда Возврат КонецЕсли; 		
	КонецЕсли;	
	
	Если Отказ Тогда Возврат КонецЕсли;
	
	Если ЕстьИзменения Тогда
		СуммаДокумента=Затраты.Итог("Сумма");		
	КонецЕсли; 
	
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		ДокОснование		= Основание;
		
		ИБ 					= Основание.ИБ;
		Организация 		= Основание.Организация;
		Подразделение		= Основание.Склад.Подразделение;
		
		Контрагент 			= Основание.Контрагент;
		КонтрагентЦБ		= Контрагент.Ведущий;
		Договор 			= Основание.Договор;		
		
		Сумма 				= Основание.СуммаДокумента;
		Валюта 				= Основание.Валюта;
		
		СтатьяДДС			= Справочники.СтатьиЗатрат.НайтиПоНаименованию("Приход от покупателей");
		
		Комментарий 		= "На основании: "+Основание;		
	КонецЕсли;	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Автор   		= Неопределено;
	Курс			= 0;	
	Дата			= Неопределено;	
	
	Затраты.Очистить();
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры

