
//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	
//	// выводим дополнительные реквизиты
//	РаботаСЭлементамиФормыСервер.ДополнительныеРеквизиты_ПриСозданииНаСервере(Объект.Ссылка, ЭтаФорма);
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
//	
//	// записываем дополнительные реквизиты в регистр ЗначенияСвойствОбъектов
//	РаботаСЭлементамиФормыСервер.ДополнительныеРеквизиты_ПослеЗаписиНаСервере(Объект, ЭтаФорма);
//	
//КонецПроцедуры
