Функция НайтиОбъектКонфигурацииПоУИД(УникальныйИдентификаторСтрокой, ТипМетаданных = "Справочник", ВидМетаданных = "") Экспорт
	
	УИД = Новый УникальныйИдентификатор(УникальныйИдентификаторСтрокой);
	
	Если ТипМетаданных = "Справочник" Тогда
		Ссылка = ПолучитьСсылкуПоМенеджеруОбъекта(Справочники[ВидМетаданных], УИД);
	ИначеЕсли ТипМетаданных = "Документ" Тогда
		Ссылка = ПолучитьСсылкуПоМенеджеруОбъекта(Документы[ВидМетаданных], УИД);
	КонецЕсли;
	
	Если Ссылка <> Неопределено Тогда
		Возврат Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСсылкуПоМенеджеруОбъекта(ОбъектыМенеджер, УИД)
	
	СсылкаГуид = ОбъектыМенеджер.ПолучитьСсылку(УИД);
	Попытка
		ОбъектГуид = СсылкаГуид.ПолучитьОбъект();
		Если СсылкаГуид.ПолучитьОбъект() <> Неопределено Тогда
			Возврат ОбъектГуид.Ссылка;
		КонецЕсли;
	Исключение
		Возврат СсылкаГуид;
	КонецПопытки;
	
	Возврат Неопределено;	
	
КонецФункции