&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	//Валетов + 28,01,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8673 Перенес запрет на форму списка 
	Отказ = Истина;  
	Сообщить("Открытие данной формы запрещено");  
	//Валетов -

	 ЗаписатьВЛог("Форма списка КМ", "Открытие формы списка", "Информация");
 КонецПроцедуры
 
//++Данилова Е.В. MARK-1260
&НаКлиенте
Процедура Поиск(Команда)
	
	ОчиститьПоискНаСервере();
	
	ОповещениеОтработкаЗакрытия = Новый ОписаниеОповещения("ОтработкаРезультатаНастройкиПоиска",ЭтаФорма);
	
	ПараметрыОткрытия = Новый Структура;	
	ПараметрыОткрытия.Вставить("МассивПолей",ПолучитьПоляСписка());
	Если СохраненныйПоиск <> Неопределено Тогда
		
		ПараметрыОткрытия.Вставить("ВыбранныеЗначения",СохраненныйПоиск.Значение); 	
		
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ШтрихкодыУпаковокТоваров.Форма.ФормаПоиска",ПараметрыОткрытия,ЭтаФорма,,,,ОповещениеОтработкаЗакрытия,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПоляСписка()

	ДоступныеПоляОтбора =  Список.КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора;
	
	МассивПолей = Новый Массив;
	
	ПолеОтбораСохраненное = Неопределено; 
	Если СохраненныйПоиск <> Неопределено тогда 
		ПолеОтбораСохраненное = ДоступныеПоляОтбора.Элементы.Найти(СохраненныйПоиск.Ключ); 
	КонецЕсли;
	
	Исключения  = Новый Массив;
	Исключения.Добавить(Новый ПолеКомпоновкиДанных("ИмяПредопределенныхДанных"));
	Исключения.Добавить(Новый ПолеКомпоновкиДанных("Предопределенный"));
	
	Для каждого ПолеОтбора Из ДоступныеПоляОтбора.Элементы  Цикл
		
		Если Исключения.Найти(ПолеОтбора.Поле) <> неопределено Тогда
		
			Продолжить; 	
		
		КонецЕсли;
			
		СтруктураДанных = Новый Структура("Заголовок,Поле,Тип,Выбор"); 
		ЗаполнитьЗначенияСвойств(СтруктураДанных,ПолеОтбора); 
		
		Если ПолеОтбораСохраненное <> Неопределено
			И ПолеОтбора = ПолеОтбораСохраненное Тогда
			
			СтруктураДанных.Выбор = истина; 	
			
		КонецЕсли;
		
		МассивПолей.Добавить(СтруктураДанных); 
	КонецЦикла;
	
	Возврат МассивПолей; 

КонецФункции // ПолучитьПоляСписка()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ОтработкаРезультатаНастройкиПоиска(ПараметрЗакрытия,ДополнительныеПараметры) Экспорт

	Если ПараметрЗакрытия <> неопределено
		И ПараметрЗакрытия.Свойство("Ключ")
		И ЗначениеЗаполнено(ПараметрЗакрытия.Ключ) Тогда 	  
		
		ИзменитьОтборДинамическогоСписка(ПараметрЗакрытия);
		
		СохраненныйПоиск = ПараметрЗакрытия; 
		
		Элементы.Список.Обновить();
		
	КонецЕсли;

 КонецПроцедуры // ОтработкаРезультатаНастройкиПоиска()
 
 // <Описание процедуры>
 //
 // Параметры:
 //  <Параметр1>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //  <Параметр2>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //
 &НаСервере
 Процедура ИзменитьОтборДинамическогоСписка(ДанныеОтбора)
 
	 ПолеОтбора 		= ДанныеОтбора.Ключ; 
	 ЗначениеОтбора 	= ДанныеОтбора.Значение;
	 
 
	 ДоступныеПоляОтбора =  Список.КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.Элементы;
	 
	 ТекстЗапроса = Список.ТекстЗапроса; 
	 	  
	 Если ДоступныеПоляОтбора.Найти(ПолеОтбора) <> Неопределено Тогда
		 
		 Если СтрНайти(ВРег(ТекстЗапроса),"ГДЕ") > 0  Тогда
			 ТекстЗапросаГДЕ = "
			 |//+меткаОтбор 
			 | И ";
		 иначе
			 ТекстЗапросаГДЕ = "
			 |//+меткаОтбор
			 |ГДЕ  ";	 
			 
		 КонецЕсли;
	 
		 ПолеОтбора = ДоступныеПоляОтбора.Найти(ПолеОтбора);
		 //для наименования приходится по другому, СОКРЛП только с 8.3.20 
		 
		 СоответствиеПараметрЗначение = Новый Соответствие; 
		 Если ДанныеОтбора.Ключ = "Наименование"
			 И ЗначениеОтбора.Количество() > 0 Тогда
			 
			 Сч = 1;
			 ТекстЗапросаГДЕ = ТекстЗапросаГДЕ + " ("; 
			 Для каждого ОтборНаименование Из ЗначениеОтбора Цикл
				 Если Сч > 1 Тогда
					 
					 
					 ТекстЗапросаГДЕ = ТекстЗапросаГДЕ + " ИЛИ "; 
					 
				 КонецЕсли;
				 ТекстЗапросаГДЕ = ТекстЗапросаГДЕ + ДанныеОтбора.Ключ + " Подобно (&ВыбранноеЗначение"+Строка(Сч)+")" ;
				 
				 СоответствиеПараметрЗначение.Вставить("ВыбранноеЗначение" + Строка(Сч),"%" + ОтборНаименование + "%"); 
				
				 
				 Сч = Сч + 1; 
			 КонецЦикла;
			 
			 ТекстЗапросаГДЕ = ТекстЗапросаГДЕ + " )";
		 
		 ИначеЕсли ПолеОтбора.ДоступныеВидыСравнения.НайтиПоЗначению(ВидСравненияКомпоновкиДанных.ВСписке) <> Неопределено Тогда
			 
			 ТекстЗапросаГДЕ = ТекстЗапросаГДЕ + ДанныеОтбора.Ключ + " в (&ВыбранныеЗначения)" ; 
			 
		 ИначеЕсли ПолеОтбора.ДоступныеВидыСравнения.НайтиПоЗначению(ВидСравненияКомпоновкиДанных.Содержит) <> Неопределено  Тогда
			 
			 ТекстЗапросаГДЕ = ТекстЗапросаГДЕ + ДанныеОтбора.Ключ +" ПОДОБНО &ВыбранныеЗначения";    
			 
		 Иначе 
			 
			 ТекстЗапросаГДЕ = ТекстЗапросаГДЕ + ДанныеОтбора.Ключ +" = &ВыбранныеЗначения"; 
		 КонецЕсли;
		 
		 ТекстЗапросаГДЕ = ТекстЗапросаГДЕ + " 
		 |//-меткаОтбор"; 
	 КонецЕсли;
	 
	 ЗаписатьВЛог("Форма списка КМ", "модификация текста запроса. Новый текст: " + (ТекстЗапроса + ТекстЗапросаГДЕ), "Информация");
	 
	 Список.ТекстЗапроса = ТекстЗапроса + ТекстЗапросаГДЕ;
	 
	 Если ДанныеОтбора.Ключ <>  "Наименование" Тогда 
		 Список.Параметры.УстановитьЗначениеПараметра("ВыбранныеЗначения",ЗначениеОтбора);
	 Иначе 
		 Для каждого ЭлементСоответствия Из СоответствиеПараметрЗначение Цикл
		 
		 	  Список.Параметры.УстановитьЗначениеПараметра(ЭлементСоответствия.Ключ,ЭлементСоответствия.Значение);
		 
		 КонецЦикла;
	 КонецЕсли;
		 
 КонецПроцедуры // ИзменитьОтборДинамическогоСписка()

&НаКлиенте
Процедура ОчиститьПоиск(Команда)
	 СохраненныйПоиск = Неопределено; 
	 ОчиститьПоискНаСервере();
	 Элементы.Список.Обновить();
 КонецПроцедуры
 
 // <Описание процедуры>
 //
 // Параметры:
 //  <Параметр1>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //  <Параметр2>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //
 &НаСервере
 Процедура ОчиститьПоискНаСервере()
 
 	ПозицияНачало = СтрНайти(Список.ТекстЗапроса,"//+меткаОтбор"); 
	
	ПозицияКонец =  СтрНайти(Список.ТекстЗапроса,"//-меткаОтбор") + 13;
	
	Если ЗначениеЗаполнено(ПозицияНачало) Тогда
	
		ТекстЗапросаНачало = Лев(Список.ТекстЗапроса,ПозицияНачало - 1); 
		
		ТекстЗапросаКонец = Прав(Список.ТекстЗапроса,СтрДлина(Список.ТекстЗапроса) - ПозицияКонец); 
		
		ЗаписатьВЛог("Форма списка КМ", "модификация текста запроса. Новый текст: " + (ТекстЗапросаНачало + " " + ТекстЗапросаКонец), "Информация");
		
		Список.ТекстЗапроса = ТекстЗапросаНачало + " " + ТекстЗапросаКонец; 
	КонецЕсли;
 
 КонецПроцедуры // ОчиститьПоискНаСервере()
 //--Данилова Е.В. MARK-1260
 



