Перем КритичОшибки Экспорт;

Перем ПрефиксУзлаCML;
Перем НачалоЭлементаCML;
Перем КонецЭлементаCML;
Перем ПрефиксАтрибутаCML;

Перем ПараметрЗапросаHTTP_Инициализация;
Перем ПараметрЗапросаHTTP_ПередачаФайла;
Перем ПараметрЗапросаHTTP_ИмпортФайлаСервером;
Перем ПараметрЗапросаHTTP_ПолучитьДанные; 
Перем ПараметрЗапросаHTTP_УспешноеЗавершениеИмпорта;

Перем ОтветСервера_ZIPРазрешен;
Перем ОтветСервера_ОграничениеРазмераФрагментаФайлаОбмена;
Перем ОтветСервера_УспешноеЗавершениеТекущейОперации;
Перем ОтветСервера_АварийноеЗавершениеТекущейОперации;
Перем ОтветСервера_ВыполнениеТекущейОперации;

Перем ПустаяХарактеристикаСсылка;


Перем НаименованиеНалога;


Перем БулевоЗначениеCML_Истина;
Перем БулевоЗначениеCML_Да;


Перем ТипНоменклатурыCML_Услуга;
Перем ТипНоменклатурыCML_Товар;
Перем ЗначениеCML_ТипНоменклатуры;

Перем мСоответствиеНаименованийКатегорийДокумента;
Перем мСтруктураИнформацииИсторииОбмена;

Перем мВидНоменклатурыУслуга;	
Перем мВидНоменклатурыТовар;
Перем мКоэффициентПересчетаВесаТоваровВГраммыДляОбменаССайтом;


Перем мМассивЗагруженныхДокументов;

Перем мТаблицаКаталогов;

Перем мДатаФормирования;

Перем мОрганизацияВладелец;

Перем мРезультатЗапросаИерархияНоменклатуры;
Перем мРезультатЗапросаСвойстваНоменклатуры;

Перем мКаталогНаДиске;
Перем мПодкаталогФайлов;
Перем мПодкаталогБезопасностиКаталогаВыгрузки;

Перем мУчетнаяПолитика;
Перем мПринудительнаяПолнаяВыгрузка;

Перем мМВТ;

Перем мЗапросПоКартинкам, мЗапросПоФайлам;
Перем мЗапросПоЗначениямСвойствХарактеристик;
Перем мЗапросПоСвойствамНоменклатуры;
Перем мЗапросПоЦенам;
Перем мЗапросПоСкидкам;
Перем мЗапросПоВремениДействияСкидок;
Перем мЗапросПоВариантамЗначенияСвойства;
Перем мЗапросПоШК;

Перем НастройкаОбмена;
Перем Рубли;

Перем ПРиКрОш;
Перем МассивОтклоненныхДокументов;

Перем ПризПервичнойСкидки10,ТзЦвет;

Перем мКаталогВременныхФайлов;

Перем мНомерВыгрузки;
Перем ТЗФайловИМ, МассивЗнИм;
Перем НомерНастройки;


// Процедура устанавливает номер документа.
//
// Параметры:
//  ДокументОбъект  - ДокументОбъект. Экземпляр документа, которому 
//                    необходимо присвоить новый номер
//
Процедура УстановитьНомерДокумента2(ДокументОбъект) Экспорт
	// Если  нет реквизита "Организация" или для нее не задан префикс, то 
	// используем пустой префикс,
	// иначе используем префикс организации.
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	ДопБуква="";
	Если МетаданныеДокумента.Имя="РасходнаяНакладная" Тогда
		ДопБуква=?(ДокументОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН,"б","а");
	ИначеЕсли МетаданныеДокумента.Имя="ОтчетКассовойСмены" Тогда
		ДопБуква=?(ДокументОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН,"кб","кн");	
	КонецЕсли; 
	
	Вид=МетаданныеДокумента.Имя;
	Если Вид="ЛистНабора" Тогда
		ДокументОбъект.УстановитьНовыйНомер(СокрЛП(ДокументОбъект.ДокОснование.Номер)+"/");
	ИначеЕсли Вид="СчетФактура" Тогда 		
		Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
			Префикс=ПараметрыСеанса.ЭтотУзел.Код;
		Иначе
			ПрефиксКонтрагента="";
			
			Если ДокументОбъект.Накладные.Количество()>0 Тогда
				Накладная=ДокументОбъект.Накладные[0].Накладная;
				Если ЕстьРеквизитДокумента("ПунктДоставки",Накладная.Метаданные()) И ЗначениеЗаполнено(Накладная.ПунктДоставки.ПрефиксСФ) Тогда
					ПрефиксКонтрагента=СокрЛП(Накладная.ПунктДоставки.ПрефиксСФ);
				КонецЕсли;			
			КонецЕсли;			
			
			Если ПустаяСтрока(ПрефиксКонтрагента) Тогда
				ПрефиксКонтрагента=СокрЛП(ПолучитьРеквизитРодителя(ДокументОбъект.Контрагент,"ПрефиксСФ"));			
			КонецЕсли; 
			
			Если ПустаяСтрока(ПрефиксКонтрагента) Тогда
				ПрефиксСклада	=СокрЛП(ДокументОбъект.Склад.Префикс);
				ПрефиксИБ		=СокрЛП(ДокументОбъект.Склад.ПрефиксИБ);
				
				Если ПрефиксИБ="SNL" Тогда
					Префикс=ПрефиксИБ;
				Иначе
					Префикс=?(НЕ ПустаяСтрока(ДокументОбъект.Организация.Префикс),СокрЛП(ДокументОбъект.Организация.Префикс)+ПрефиксСклада,ДокументОбъект.ИБ.Код);				
				КонецЕсли;				
			Иначе				
				Префикс=?(НЕ ПустаяСтрока(ДокументОбъект.Организация.Префикс),СокрЛП(ДокументОбъект.Организация.Префикс)+ПрефиксКонтрагента,ДокументОбъект.ИБ.Код);			
			КонецЕсли;			
		КонецЕсли; 
		
		Если ПерваяСФ2(Префикс,ДокументОбъект.Дата) Тогда
			Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
				КоличествоПропусков=2;			
			ИначеЕсли Лев(Префикс,2)="КБ" Тогда
				КоличествоПропусков=4;
			Иначе	
				КоличествоПропусков=1;						
			КонецЕсли;			
		Иначе
			КоличествоПропусков=0;
		КонецЕсли;
		
		УстановитьНормальныйНовыйНомер2(ДокументОбъект,Префикс+"-",КоличествоПропусков);
	ИначеЕсли ЕстьРеквизитДокумента("ИБ",МетаданныеДокумента) Тогда
		ЭтотУзел=ПараметрыСеанса.ЭтотУзел;
		
		Если МетаданныеДокумента.Имя="РасходнаяНакладная" И СокрЛП(ДокументОбъект.Контрагент.Код)="SSP-8643" Тогда		
			КодИБ="SSP";
		Иначе
			Если ЕстьРеквизитДокумента("Склад",МетаданныеДокумента) Тогда
				ПрефиксИБ=ДокументОбъект.Склад.ПрефиксИБ;
			КонецЕсли;		
			Если ПустаяСтрока(ПрефиксИБ) Тогда
				ПрефиксИБ=ДокументОбъект.ИБ.Код;			
			КонецЕсли; 
			
			КодИБ=?(ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение,ПрефиксИБ,ЭтотУзел.Код);			
		КонецЕсли;		
		
		Если МетаданныеДокумента.Имя="ПриходнаяНакладная" И КодИБ="SSP" Тогда
			ДокументОбъект.УстановитьНовыйНомер(КодИБ+"-0");
		Иначе
			ДокументОбъект.УстановитьНовыйНомер(КодИБ+ДопБуква+"-");
		КонецЕсли;		
	ИначеЕсли Вид="УслугиСтороннихОрганизаций" Тогда
		Префикс=ДокументОбъект.Организация.Префикс+"-";
		ДокументОбъект.УстановитьНовыйНомер(Префикс);
	Иначе		
		КодИБ=ПараметрыСеанса.ЭтотУзел.Код;
		
		ДокументОбъект.УстановитьНовыйНомер(КодИБ+"-");		
	КонецЕсли;	
КонецПроцедуры // УстановитьНомерДокумента()

//  Процедура определяет ситуацию, когда при изменении своей даты документ 
//  оказывается в другом периоде нумерации документов, и в это м случае
//  присваивает документу новый уникальный номер.
//
// Параметры:
//  ДокументОбъект         - контекст документа,из которого вызвана процедура 
//  НачальнаяДатаДокумента - начальная дата документа 
// 
Функция ПроверитьНомерДокумента2(ДокументОбъект, НачальнаяДатаДокумента,Предупреждать=Истина) Экспорт   // в разработке
	
	// Определяем назначенную для данного вида документов периодичность смены номера
	ПериодСменыНомера = ДокументОбъект.Метаданные().ПериодичностьНомера;
	
	//В зависимости от установленной периодичности смены номеров,
	//определяем разность старой и новой датами документа.
	РазностьДат=0;
	
	Если ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Год Тогда
		РазностьДат = НачалоГода(НачальнаяДатаДокумента) - НачалоГода(ДокументОбъект.Дата);
		
	ИначеЕсли ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Квартал Тогда
		РазностьДат = НачалоКвартала(НачальнаяДатаДокумента) - НачалоКвартала(ДокументОбъект.Дата);
		
	ИначеЕсли ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Месяц Тогда
		РазностьДат = НачалоМесяца(НачальнаяДатаДокумента) - НачалоМесяца(ДокументОбъект.Дата);
		
	ИначеЕсли ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.День Тогда
		РазностьДат = НачальнаяДатаДокумента - ДокументОбъект.Дата; 
	КонецЕсли;
	
	Если РазностьДат <> 0 Тогда
		Если Предупреждать Тогда
			//Ответ=Вопрос("Изменена дата документа ! Номер документа будет изменен ! Продолжать ?",РежимДиалогаВопрос.ДаНет);
			//Если Ответ<>КодВозвратаДиалога.Да Тогда
			//	Возврат Ложь;			
			//КонецЕсли;
		КонецЕсли;		
		УстановитьНомерДокумента2(ДокументОбъект);
	КонецЕсли;
	
	Возврат Истина;
КонецФункции// ПроверитьНомерДокумента()

Функция ПерваяСФ2(Префикс,Дата)Экспорт 
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ
	|	Документ.СчетФактура КАК СчетФактура
	|ГДЕ
	|	Дата МЕЖДУ &Дата1 И &Дата2
	|	И Номер ПОДОБНО &Номер
	|	И НЕ ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Дата));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата));
	Запрос.УстановитьПараметр("Номер",Префикс+"%");		
	
	Возврат Запрос.Выполнить().Пустой();
КонецФункции //ПерваяСФ(Префикс,Дата)

// Процедура устанавливает номер документа.
//
// Параметры:
//  ДокументОбъект  - ДокументОбъект. Экземпляр документа, которому 
//                    необходимо присвоить новый номер
//
Функция УстановитьНормальныйНовыйНомер2(ДокументОбъект,Префикс,КоличествоПропусков=0)Экспорт 
	МетаДок=ДокументОбъект.Метаданные();	
	Периодичность=МетаДок.ПериодичностьНомера;
	ДлинаЧисловойЧасти=МетаДок.ДлинаНомера-СтрДлина(СокрЛП(Префикс));;
	
	Если МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Год Тогда
		Дата1=НачалоГода(ДокументОбъект.Дата);	
		Дата2=КонецГода(ДокументОбъект.Дата);	
	ИначеЕсли МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Квартал Тогда
		Дата1=НачалоКвартала(ДокументОбъект.Дата);	
		Дата2=КонецКвартала(ДокументОбъект.Дата);					
	ИначеЕсли МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Месяц Тогда
		Дата1=НачалоМесяца(ДокументОбъект.Дата);	
		Дата2=КонецМесяца(ДокументОбъект.Дата);					
	ИначеЕсли МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.День Тогда
		Дата1=НачалоДня(ДокументОбъект.Дата);	
		Дата2=КонецДня(ДокументОбъект.Дата);
	Иначе
		Дата1=Неопределено;		
		Дата2=Неопределено;
	КонецЕсли;
	
	Шаблон=СокрЛП(Префикс);
	Для Сч=1 По ДлинаЧисловойЧасти Цикл
		Шаблон=Шаблон+"[0-9]";	
	КонецЦикла;
	Запрос=Новый Запрос;
	
	Запрос.Текст="
	|ВЫБРАТЬ
	|	МАКСИМУМ(Номер) КАК Номер
	|ИЗ
	|	Документ."+МетаДок.Имя+"
	|ГДЕ
	|	"+?(Дата1=Неопределено,"","Дата МЕЖДУ &Дата1 И &Дата2 И ")+"
	|	Номер ПОДОБНО &Шаблон";
	
	Запрос.УстановитьПараметр("Шаблон",Шаблон);
	
	Если Дата1<>Неопределено Тогда
		Запрос.УстановитьПараметр("Дата1",Дата1);
		Запрос.УстановитьПараметр("Дата2",Дата2);
	КонецЕсли;
	
	НомерДока		=Неопределено;
	ПоследнийНомер =0;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.Номер) Тогда
			НомерДока		=Выборка.Номер;
			ПоследнийНомер	=Число(СтрЗаменить(Выборка.Номер,СокрЛП(Префикс),""));
		КонецЕсли;		
	КонецЕсли;	
	
	Коэффициент=1;
	Если НомерДока<>Неопределено Тогда	
		ПоследнийДок=Документы[МетаДок.Имя].НайтиПоНомеру(НомерДока,ДокументОбъект.Дата);
		Если ПоследнийДок<>Неопределено Тогда
			Коэффициент=Цел(Макс(1,(КонецДня(ДокументОбъект.Дата)-КонецДня(ПоследнийДок.Дата))/(24*60*60)));
		КонецЕсли;
	КонецЕсли;
	
	ДокументОбъект.Номер=СокрЛП(Префикс)+Формат(ПоследнийНомер+1+КоличествоПропусков*Коэффициент,"ЧЦ="+ДлинаЧисловойЧасти+"; ЧВН=");
КонецФункции //УстановитьНормальныйНовыйНомер(ДокументОбъект,Префикс,КоличествоПропусков=0)




////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ CML ИЗ СПИСКА ЗНАЧЕНИЙ

Процедура ЗаписатьCMLПоСпискуЗначений(ОбъектCML, СписокЗначений);
	
	Для Каждого Элемент Из СписокЗначений Цикл
		Если Элемент.Представление = КонецЭлементаCML Тогда
			ОбъектCML.ЗаписатьКонецЭлемента();
		ИначеЕсли Элемент.Представление = НачалоЭлементаCML Тогда	
			ОбъектCML.ЗаписатьНачалоЭлемента(Элемент.Значение);
		ИначеЕсли Элемент.Представление = "" Тогда
			ОбъектCML.ЗаписатьТекст(Элемент.Значение);
		ИначеЕсли Найти(Элемент.Представление, ПрефиксУзлаCML) > 0 Тогда
			ИмяУзла = СтрЗаменить(Элемент.Представление, ПрефиксУзлаCML, "");
			ЗаписатьТекстовойУзел(ОбъектCML, ИмяУзла, Элемент.Значение);	
		ИначеЕсли Найти(Элемент.Представление, ПрефиксАтрибутаCML) > 0 Тогда
			ИмяАтрибута = СтрЗаменить(Элемент.Представление, ПрефиксАтрибутаCML, "");
			ОбъектCML.ЗаписатьАтрибут(ИмяАтрибута, Элемент.Значение);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ДобавитьУзелCML(СписокЗначений, НаименованиеУзла, Значение);
	СписокЗначений.Добавить(Значение, ПрефиксУзлаCML + НаименованиеУзла);
КонецПроцедуры	

Процедура ДобавитьАтрибутCML(СписокЗначений, НаименованиеАтрибута, Значение)
	СписокЗначений.Добавить(Значение, ПрефиксАтрибутаCML + НаименованиеАтрибута);
КонецПроцедуры	

Процедура ДобавитьТекстCML(СписокЗначений, Значение)
	СписокЗначений.Добавить(Значение, "");
КонецПроцедуры	

Процедура ДобавитьНачалоЭлементаCML(СписокЗначений, НаименованиеЭлемента);
	СписокЗначений.Добавить(НаименованиеЭлемента, НачалоЭлементаCML); 
КонецПроцедуры	

Процедура ДобавитьКонецЭлементаCML(СписокЗначений);
	СписокЗначений.Добавить("", КонецЭлементаCML); 
КонецПроцедуры	

Процедура ЗаполнитьСписокЗначенийОсновныхРеквизитовТовара(СписокЗначенийCML, Товар)
	
	//++-++ - свойства товара заполнять для файла номенклатуры тут.
	
	ИдТовара = Товар.Код;
	
	ДобавитьУзелCML(СписокЗначенийCML, "Ид"				   , ИдТовара); 
	ДобавитьУзелCML(СписокЗначенийCML, "Штрихкод"		   , ""); //Товар.Штрихкод
	ДобавитьУзелCML(СписокЗначенийCML, "Артикул"		   , ""); //Товар.НоменклатураСсылка.Артикул
	ДобавитьУзелCML(СписокЗначенийCML, "Наименование"	   , ФорматНаименованияДляCML(Товар.Ссылка.Наименование));
	
	//ЭлементТов=ДокументДом.СоздатьЭлемент("БазоваяЕдиница");
	//		ТекУзелТов=ТекУзел2Т.ДобавитьДочерний(ЭлементТов);
	//		ЭлементТов.УстановитьАтрибут("Код","796");
	//		ЭлементТов.УстановитьАтрибут("НаименованиеПолное","Штука");
	//		текстДом=ДокументДом.СоздатьТекстовыйУзел("Штука");
	//		ТекУзелТов.ДобавитьДочерний(ТекстДом);
	
	
	ДобавитьНачалоЭлементаCML(СписокЗначенийCML, "БазоваяЕдиница");	
	
	ДобавитьАтрибутCML(СписокЗначенийCML, "Код"					   , "796");
	ДобавитьАтрибутCML(СписокЗначенийCML, "НаименованиеПолное"	   , "Штука");
	
	ДобавитьТекстCML(СписокЗначенийCML, "Штука");
	ДобавитьКонецЭлементаCML(СписокЗначенийCML);	
	
КонецПроцедуры

Функция ПолучитьСтрокуЗаписиДляXML(Значение)
	//преобразует в строку
	СтрокаЗаписи = Строка(Значение);
	
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		
		СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, Символы.НПП, "");
		СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, ",", ".");
		
	ИначеЕсли ТипЗнч(Значение) = Тип("Булево") Тогда
		
		Если Значение Тогда
			СтрокаЗаписи = "true";
		Иначе
			СтрокаЗаписи = "false";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтрокаЗаписи;
	
КонецФункции

Процедура ЗаписатьТекстовойУзел(ОбъектXML, Имя, Значение, ОбязательнаяПроверкаНаПустуюСтроку = Истина)
	
	СтрокаЗаписи = ПолучитьСтрокуЗаписиДляXML(Значение);
	
	Если ОбязательнаяПроверкаНаПустуюСтроку
		И НЕ ЗначениеЗаполнено(СтрокаЗаписи) Тогда
		
		Возврат;		
		
	КонецЕсли;	
	
	ОбъектXML.ЗаписатьНачалоЭлемента(Имя);
	ОбъектXML.ЗаписатьТекст(СтрокаЗаписи);
	ОбъектXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Функция ФорматКомментарияДляCML(Комментарий)
	Возврат Лев(Комментарий, 3000);
КонецФункции	

Функция ФорматНаименованияДляCML(Наименование)
	Возврат Лев(Наименование, 250);
КонецФункции	

Процедура ЗаписатьАтрибутВXML(ОбъектЗаписи, ИмяАтрибута, ЗначениеАтрибута)
	
	СтрокаЗаписи = ПолучитьСтрокуЗаписиДляXML(ЗначениеАтрибута);
	
	ОбъектЗаписи.ЗаписатьАтрибут(ИмяАтрибута, СтрокаЗаписи);	
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРА ВЫГРУЗКИ ДАННЫХ

Функция СформироватьУникальныйИдентификаторОбъекта(Объект, Характеристика = Неопределено)
	
	Ид = Строка(Объект.УникальныйИдентификатор());
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.Номенклатура")
		И (НЕ Объект.ЭтоГруппа)
		И Объект.ВестиУчетПоХарактеристикам
		И ЗначениеЗаполнено(Характеристика) Тогда
		
		Ид = Ид + "#" + Строка(Характеристика.УникальныйИдентификатор());
		
	КонецЕсли;	
	
	Возврат Ид;
	
КонецФункции

///////////////////////////////////////////////////////////////////

Функция ПолучитьОбъектДляЗаписиXML(ИмяФайла, ДатаФормирования)
	
	ЗаписьXML = Новый ЗаписьXML;
	
	Если ПустаяСтрока(ИмяФайла) Тогда
		ЗаписьXML.УстановитьСтроку("UTF-8");
	Иначе
		ЗаписьXML.ОткрытьФайл(ИмяФайла, "UTF-8"); 
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("КоммерческаяИнформация");
	//	ЗаписьXML.ЗаписатьАтрибут("ВерсияСхемы", "2.04");
	ЗаписьXML.ЗаписатьАтрибут("ДатаФормирования", Формат(ДатаФормирования, "ДФ=yyyy-MM-dd'T'ЧЧ:мм:сс"));	
	
	ЗаписьXML.ЗаписатьАтрибут("ВерсияСхемы","2.04.1CBitrix");
	ЗаписьXML.ЗаписатьАтрибут("ФорматДаты","ДФ=dd.MM.yyyy; ДЛФ=D");
	ЗаписьXML.ЗаписатьАтрибут("ФорматВремени","ДФ=ЧЧ:мм:сс; ДЛФ=T");
	ЗаписьXML.ЗаписатьАтрибут("РазделительДатаВремя","T");
	ЗаписьXML.ЗаписатьАтрибут("ФорматСуммы","ЧЦ=18; ЧДЦ=2; ЧРД=,; ЧГ=""");
	ЗаписьXML.ЗаписатьАтрибут("ФорматКоличества","ЧЦ=18; ЧДЦ=2; ЧРД=,; ЧГ=""");
	//	ЗаписьXML.ЗаписатьАтрибут("ДатаФормирования",ПараметрЗаголовка);
	
	
	Возврат ЗаписьXML;
	
КонецФункции

Процедура СообщитьКритОшибки() Экспорт
	Если не ПРиКрОш тогда
		возврат;
	КонецЕсли;
	ТзЦвет.свернуть("Цвет");
	Для Каждого текстрока из  ТзЦвет Цикл
		//ТекСтрока.
		КритичОшибки.Добавить("Не определено русское наименование для цвета : код - "+текстрока.цвет.код+",  наименование - "+текстрока.цвет.наименование );
	КонецЦикла;   
	
	
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);	
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	//------------------------------------------------
	// сообщение о критических ошибках
	//------------------------------------------------
	сообщениеКрит=новый интернетПочтовоеСообщение;
	СообщениеКрит.Получатели.Добавить("eshop@collant.ru"); //+++
	//СообщениеКрит.Получатели.Добавить("nechaeva@collant.ru");
	сообщениеКрит.Отправитель="helpdesk@collant.ru";
	СообщениеКрит.Тема="Автообмен с интернет магазином. Критические ошибки!";
	Строка="Добрый день!!!"+Символ(13);
	НомСтр=1;
	Если  КритичОшибки.Количество()>0 Тогда
		Для рр=0 по КритичОшибки.Количество()-1 Цикл
			Строка=Строка+Символ(13)+НомСтр+". "+КритичОшибки[рр];
			Строка=Строка+Символ(13);
			НомСтр=НомСтр+1;
		КонецЦикла;
	КонецЕсли;
	
	Строка=Строка+Символ(13)+"________________________________________________________________";
	//-----------------------------------------
	СообщениеКрит.Тексты.Добавить(Строка);
	Попытка
		Почта= Новый ИнтернетПочта;
		Почта.Подключиться(Профиль);
		почта.Послать(СообщениеКрит);
		Почта.Отключиться();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

//---------------------------------------------------------------------------------


// каталог  imports
Процедура ВыгрузитьКаталог(ИмяФайлаВыгрузки,Группы)
	#Если Клиент Тогда
		Сообщить(ТекущаяДата());
	#КонецЕсли
	Если НЕ ВыгружатьТовары тогда
		возврат;
	КонецЕсли;	
	
	ПРиКрОш=ложь;
	
	Если НЕ ЗначениеЗаполнено(ИмяФайлаВыгрузки) Тогда
		#Если Клиент Тогда
			Предупреждение("Не указано имя файла выгрузки !!!");
			
		#КонецЕсли
		
		
		Возврат;	
	КонецЕсли; 
	
	#Если Клиент Тогда
	#КонецЕсли
	
	
	РазделительПолей=";";
	МассивНом= Новый Массив();
	//МассивНом.Добавить(Группы);
	МассивНом=Группы;
	
	
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	//                  запись файла
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	#Если Клиент Тогда
		Состояние("Начало...");
	#КонецЕсли
	
	
	ОбъектCML = ПолучитьОбъектДляЗаписиXML(ИмяФайлаВыгрузки, ТекущаяДата());
	// начало коммерч. информация
	
	ОбъектCML.ЗаписатьНачалоЭлемента("Классификатор");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка("Id_Klassificator"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", ФорматНаименованияДляCML("Классификатор (Основаной каталог товаров СТИЛЬПАРК)"));
	
	//---------------------------------------------------------
	ОбъектCML.ЗаписатьНачалоЭлемента("Владелец");
	
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка("Id_Vladelec"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", ФорматНаименованияДляCML("СТИЛЬПАРК"));
	ЗаписатьТекстовойУзел(ОбъектCML, "ПолноеНаименование", ФорматНаименованияДляCML("СТИЛЬПАРК"));
	ОбъектCML.ЗаписатьКонецЭлемента();
	
	//--------------------------------------------------------
	
	//------------------------------------------------------------
	//            начало описания разделов     СПРАВОЧНИК  ПОДТИПЫ ТОВАРОВ
	//------------------------------------------------------------
	#Если Клиент Тогда
		Состояние("Заполнение справочника подтипов...");
	#КонецЕсли
	
	
	ОбъектCML.ЗаписатьНачалоЭлемента("Группы");
	
	//++-++!!!!!!!!!!!!!!!!!!! поправить на единицу
	
	// выбираем группы
	Запрос=Новый Запрос;
	//Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	НоменклатураПодТипыНоменклатурыДляСайта.ПодТипТовараДляСайта.Родитель КАК Родитель1,
	//|	НоменклатураПодТипыНоменклатурыДляСайта.ПодТипТовараДляСайта.Родитель.Родитель КАК Родитель2,
	//|	НоменклатураПодТипыНоменклатурыДляСайта.ПодТипТовараДляСайта.Родитель.Родитель.Родитель КАК Родитель3,
	//|	НоменклатураПодТипыНоменклатурыДляСайта.ПодТипТовараДляСайта.Код КАК Код,
	//|	НоменклатураПодТипыНоменклатурыДляСайта.ПодТипТовараДляСайта.Наименование КАК Наименование,
	//|	НоменклатураПодТипыНоменклатурыДляСайта.ПодТипТовараДляСайта.Представление КАК Представление,
	//|	НоменклатураПодТипыНоменклатурыДляСайта.ПодТипТовараДляСайта.Ссылка КАК Ссылка
	//|ИЗ
	//|	Справочник.Номенклатура.ПодТипыНоменклатурыДляСайта КАК НоменклатураПодТипыНоменклатурыДляСайта
	//|ГДЕ
	//|	НоменклатураПодТипыНоменклатурыДляСайта.ПодТипТовараДляСайта.Родитель.Родитель.Родитель.Ссылка <> &Пустая
	//|ИТОГИ ПО
	//|	Родитель3,
	//|	Родитель1,
	//|	Ссылка";
	
	//
	//Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ТипыТоваровДляСайта.Ссылка КАК Ссылка,
	//|	ТипыТоваровДляСайта.Код,
	//|	ТипыТоваровДляСайта.Наименование,
	//|	ТипыТоваровДляСайта.Представление,
	//|	ТипыТоваровДляСайта.Родитель КАК Родитель1,
	//|	ТипыТоваровДляСайта.Родитель.Родитель КАК родитель2,
	//|	ТипыТоваровДляСайта.Родитель.Родитель.Родитель КАК родитель3,
	//|	ТипыТоваровДляСайта.ТипТовараДляСайтаМиними КАК ТипТовараДляСайтаМиними
	//|ИЗ
	//|	Справочник.ТипыТоваровДляСайта КАК ТипыТоваровДляСайта
	//|ГДЕ
	//|	ТипыТоваровДляСайта.Родитель.Родитель.Родитель.Код <> &КодУнисекс
	//|	И ТипыТоваровДляСайта.Родитель.Родитель.Родитель <> &Пустая
	////нечаева 20,11,17++
	//|	И ТипыТоваровДляСайта.ПометкаУдаления = ложь
	////нечаева 20,11,17--
	//|ИТОГИ ПО
	//|	родитель3,
	//|	Родитель1";
	
	
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ном.Ссылка КАК Ссылка,
	             |	ном.Код КАК Код,
	             |	ном.Наименование КАК Наименование,
	             |	ном.Представление КАК Представление,
	             |	ном.Родитель КАК Родитель1,
	             |	ном.Родитель.Родитель КАК родитель2,
	             |	ном.Родитель.Родитель.Родитель КАК родитель3,
	             |	ВЫБОР
	             |		КОГДА ном.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |			ТОГДА ""Да""
	             |		КОГДА ном.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |			ТОГДА ""Нет""
	             |		ИНАЧЕ ВЫБОР
	             |				КОГДА ном.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |					ТОГДА ""Да""
	             |				КОГДА ном.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |					ТОГДА ""Нет""
	             |				ИНАЧЕ ВЫБОР
	             |						КОГДА ном.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |							ТОГДА ""Да""
	             |						КОГДА ном.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |							ТОГДА ""Нет""
	             |						ИНАЧЕ ВЫБОР
	             |								КОГДА ном.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |									ТОГДА ""Да""
	             |								КОГДА ном.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |									ТОГДА ""Нет""
	             |								ИНАЧЕ ВЫБОР
	             |										КОГДА ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |											ТОГДА ""Да""
	             |										КОГДА ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |											ТОГДА ""Нет""
	             |										ИНАЧЕ ""Нет""
	             |									КОНЕЦ
	             |							КОНЕЦ
	             |					КОНЕЦ
	             |			КОНЕЦ
	             |	КОНЕЦ КАК ВыгружатьНаСайт
	             |ИЗ
	             |	Справочник.Номенклатура КАК ном
	             |ГДЕ
	             |	ном.Родитель.Родитель.Родитель <> &Пустая
	             |	И ном.ПометкаУдаления = ЛОЖЬ
	             |	И ном.ЭтоГруппа = ИСТИНА
	             |	И ном.Ссылка В ИЕРАРХИИ(&текгруппа)
	             |	И ВЫБОР
	             |			КОГДА ном.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |				ТОГДА ""Да""
	             |			КОГДА ном.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |				ТОГДА ""Нет""
	             |			ИНАЧЕ ВЫБОР
	             |					КОГДА ном.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |						ТОГДА ""Да""
	             |					КОГДА ном.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |						ТОГДА ""Нет""
	             |					ИНАЧЕ ВЫБОР
	             |							КОГДА ном.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |								ТОГДА ""Да""
	             |							КОГДА ном.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |								ТОГДА ""Нет""
	             |							ИНАЧЕ ВЫБОР
	             |									КОГДА ном.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |										ТОГДА ""Да""
	             |									КОГДА ном.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |										ТОГДА ""Нет""
	             |									ИНАЧЕ ВЫБОР
	             |											КОГДА ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |												ТОГДА ""Да""
	             |											КОГДА ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |												ТОГДА ""Нет""
	             |											ИНАЧЕ ""Нет""
	             |										КОНЕЦ
	             |								КОНЕЦ
	             |						КОНЕЦ
	             |				КОНЕЦ
	             |		КОНЕЦ = ""Да""
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	родитель3,
	             |	родитель2,
	             |	Родитель1
	             |ИТОГИ ПО
	             |	родитель3,
	             |	родитель2,
	             |	Родитель1";
	
	
		
	
	Запрос.УстановитьПараметр("текгруппа",МассивНом);  //ложь
	Запрос.УстановитьПараметр("Пустая",ложь);  //ложь
	Выборка3=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Родитель3");
	ВыборкаН=Запрос.Выполнить().Выгрузить();
	
	
	//ОбъектCML.ЗаписатьНачалоЭлемента("Группа");
	//ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка("gr"+Выборка3.Родитель3.код));
		

	
	Пока Выборка3.Следующий() Цикл      // колготки носки и тп
		
		Если Выборка3.Родитель3.ссылка=Null или Выборка3.Родитель3.ссылка = неопределено   // типа товара - колготки и тп
			
			или  Выборка3.Родитель3.ссылка = справочники.Номенклатура.ПустаяСсылка()
		
			Тогда
			продолжить;
			
		КонецЕсли;	
		//
		ОбъектCML.ЗаписатьНачалоЭлемента("Группа");   // 4  +++ тип товара колготки носки
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка("gr"+Выборка3.Родитель3.код));
		
		Наим="";
			
		ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка(Выборка3.Родитель3.наименование));
		
		// след. уровень 3
		Выборка2=Выборка3.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Родитель2");   
		Если Выборка2.Количество()>0 Тогда
			ОбъектCML.ЗаписатьНачалоЭлемента("Группы");    //3+++  группы от бренда
		КонецЕсли;
		
		////-----------------------------------------------------------------------------------------
		Пока Выборка2.Следующий() Цикл                              // бренд
			ОбъектCML.ЗаписатьНачалоЭлемента("Группа");     // 2г++++
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка("gr"+Выборка2.Родитель2.код));
			ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка(Выборка2.Родитель2.Наименование));
			// след. уровень - данные
			//ВыборкаМ=Выборка2.Выбрать();
			//Если ВыборкаМ.Количество()>0 Тогда
			//	ОбъектCML.ЗаписатьНачалоЭлемента("Группы");       //----------
			//КонецЕсли;	
			
			
			//**********************************************************
			
			Выборка1=Выборка2.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Родитель1"); //для коллекции
			Если Выборка1.Количество()>0 Тогда
				ОбъектCML.ЗаписатьНачалоЭлемента("Группы");    // 2+++
			КонецЕсли;
			

			
			////-----------------------------------------------------------------------------------------
			Пока Выборка1.Следующий() Цикл
				
				ОбъектCML.ЗаписатьНачалоЭлемента("Группа");    ///  1+++
				ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка("gr"+Выборка1.Родитель1.код));
				ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка(Выборка1.Родитель1.Наименование));
				// след. уровень - данные
				ВыборкаМ=Выборка1.Выбрать();
				Если ВыборкаМ.Количество()>0 Тогда
					ОбъектCML.ЗаписатьНачалоЭлемента("Группы");  //11++++
				КонецЕсли;	
					
				 				
				Пока ВыборкаМ.Следующий() Цикл
					
						
						ОбъектCML.ЗаписатьНачалоЭлемента("Группа"); //12+++
						ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("gr"+ВыборкаМ.код));
						ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка(ВыборкаМ.Наименование));
						ОбъектCML.ЗаписатьКонецЭлемента();  //группа  //12----
				
				КонецЦикла;
				
				Если ВыборкаМ.Количество()>0 Тогда
					ОбъектCML.ЗаписатьКонецЭлемента();  //группы  для моделей закрывает   //11----
				КонецЕсли;
					
				ОбъектCML.ЗаписатьКонецЭлемента();      //-----  группа для коллекции закр  1----
				//	
			КонецЦикла;
			////-----------------------------------------------------------------------------------------
			//
			
			Если Выборка1.Количество()>0 Тогда
				ОбъектCML.ЗаписатьКонецЭлемента(); //группы для коллекций закрывает     //2-----
			КонецЕсли;	
			
			//ОбъектCML.ЗаписатьКонецЭлемента();
			
			ОбъектCML.ЗаписатьКонецЭлемента();    // группа для бренда     //2г----
			//	
		КонецЦикла;
		////-----------------------------------------------------------------------------------------
		//
		
		Если Выборка2.Количество()>0 Тогда
			ОбъектCML.ЗаписатьКонецЭлемента();   //3---- грппы от бренда
		КонецЕсли;	
		
		ОбъектCML.ЗаписатьКонецЭлемента();   // 4---- группа товара  - когдогти носки
		//КонецЦикла;
		
	КонецЦикла;	
	ОбъектCML.ЗаписатьКонецЭлемента();  // общая на группы.
	
	//---------------------------------------------------------------
	//     описания свойств
	//
	//----------------------------------------------------------------
	#Если Клиент Тогда
		Состояние("Заполнение описания свойств...");
	#КонецЕсли
	
	
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойства");
	//-------------------
	// нечаева+++ 15.05.13
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("CML2_ACTIVE"));
	//ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("CML2_ACTIVE"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("БитриксАктивность"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Множественное",Строка("false"));
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	// нечаева--- 15.05.13
	//-------------------
	
	//******************************************************************************************
	//ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	//ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("CML2_CODE"));
	//ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("CML2_CODE"));
	//ЗаписатьТекстовойУзел(ОбъектCML, "Множественное",Строка("false"));
	//ОбъектCML.ЗаписатьКонецЭлемента(); // конец "св"
	//******************************************************************************************
	
	
	
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_Udalenie"));
	ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_Udalenie"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Удаление"));
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Строка"));
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	////++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	//-------------------
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_KodModeli"));
	ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_KodModeli"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Код модели"));
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Строка"));
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	////++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_Ves"));
	ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_Ves"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Вес штуки"));
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Число"));
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	//--------------------------	
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_Ob"));
	ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_Ob"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Объем штуки"));
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Число"));
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"

	
	
	
	
	//-------------------
	//ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	//ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_KodCveta"));
	//ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_KodCveta"));
	//ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Код цвета"));
	//ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	//ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	//ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Строка"));
	//ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	//ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	//ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	//-------------------
	
	//-------------------
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_Kol_V_Bl"));
	ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_Kol_V_Bl"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Количество в блочке"));
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Строка"));
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	
	//-------------------
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_Kol_v_Kor"));
	ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_Kol_v_Kor"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Количество в коробе"));
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Строка"));
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	
	//------------------------------------------------------------------------
	
	
	
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_OstatokOb"));
	ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_OstatokOb"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Остаток общий"));
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Число"));
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	//-------------------
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_PrSkidki"));
	ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_PrSkidki"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Признак скидки"));
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Число"));
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	//-------------------
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_KollOb"));
	ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_KollOb"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Коллекция общая"));
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Строка"));
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	////-------------------
	//ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	//ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_Cvet"));
	//ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_Cvet"));
	//ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Цвет"));
	//ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	//ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	//ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Строка"));
	//ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	//ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	//ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	//-------------------
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_SostavOb"));
	ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_SostavOb"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Состав общий"));
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Строка"));
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	//----------------------------------------------------------------------------------------
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_TipTovDSite"));
	ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_TipTovDSite"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Тип товара для сайта"));
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Строка"));
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	
	
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	//----------------------------------------------------------------------------------------
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_KodTovara"));
	ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_KodTovara"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Код товара"));
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Строка"));
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	
	
	
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	//      описания справочников
	//----------------------------------------------------------------------------------------
	
	//нечаева 12,12,17+++	
	
	// Код модели в виде справочника, для группировки на стороне битрикса
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_XMLID_Kod_Modeli"));
	ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_XMLID_Kod_Modeli"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("XML Id Код модели"));
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Справочник"));
	//// подуровни
	ОбъектCML.ЗаписатьНачалоЭлемента("ВариантыЗначений");
	// код модели в виде справочника, для группировки на стороне битрикса
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Родитель.Код КАК Код,
	|	Номенклатура.Родитель.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ(&ТекНом)
	|	И Номенклатура.ЭтоГруппа = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	код";
	
	Запрос.УстановитьПараметр("ТекНом",МассивНом);
	
	ВыборкаБр=Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаБР.Следующий() Цикл
		
		ОбъектCML.ЗаписатьНачалоЭлемента("Вариант");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("km"+ВыборкаБР.код));
		ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(ВыборкаБР.Наименование));
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "вариант"
	КонецЦикла;
	
	
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "варианты значений"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	
	//нечаева 12,12,17---
	
	
	//--------------------------------------------------------------------------------------------------------
	
	//нечаева 12,12,17+++	
	
	//// Код модели в виде справочника, для группировки на стороне битрикса
	//ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	//ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_XMLID_Cvet"));
	//ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_XMLID_Cvet"));
	//ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("XML_Id Цвет"));
	//ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	//ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	//ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Справочник"));
	////// подуровни
	//ОбъектCML.ЗаписатьНачалоЭлемента("ВариантыЗначений");
	//// код модели в виде справочника, для группировки на стороне битрикса
	//Запрос=Новый Запрос;
	//Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	//			 |	Номенклатура.Цвет.Код КАК Код,
	//			 |	Номенклатура.Цвет.Наименование КАК Наименование,
	//			 |	ВЫРАЗИТЬ(Номенклатура.Цвет.РусскоеНаименование КАК СТРОКА(100)) КАК РусскоеНаименование
	//			 |ИЗ
	//			 |	Справочник.Номенклатура КАК Номенклатура
	//			 |ГДЕ
	//			 |	Номенклатура.Ссылка В ИЕРАРХИИ(&ТекНом)
	//			 |	И Номенклатура.ЭтоГруппа = ЛОЖЬ";
	//			 
	//Запрос.УстановитьПараметр("ТекНом",МассивНом);
	//
	//ВыборкаБр=Запрос.Выполнить().Выбрать();
	//
	//Пока ВыборкаБР.Следующий() Цикл
	//	
	//	ОбъектCML.ЗаписатьНачалоЭлемента("Вариант");
	//	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("kcv"+ВыборкаБР.код));
	//	
	//	Если СокрЛП(ВыборкаБР.РусскоеНаименование)<>"" Тогда
	//		НаимЦвета = ""+СокрЛП(ВыборкаБР.РусскоеНаименование)+"("+СокрЛП(ВыборкаБР.Наименование)+")";
	//	иначе
	//		НаимЦвета = ""+СокрЛП(ВыборкаБР.Наименование);
	//	КонецЕсли;
	//		
	//	ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(НаимЦвета));
	//	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "вариант"
	//КонецЦикла;
	//
	//
	//ОбъектCML.ЗаписатьКонецЭлемента(); // конец "варианты значений"
	//ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	//ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	//ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	//
	////нечаева 12,12,17---
	
	
	
	// БРЕНД ДЛЯ САЙТА
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_Brend"));
	ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_Brend"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Бренд для сайта"));
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Справочник"));
	//// подуровни
	ОбъектCML.ЗаписатьНачалоЭлемента("ВариантыЗначений");
	// БРЕНД ДЛЯ САЙТА
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	БрендыДляСайта.Код,
	|	БрендыДляСайта.Наименование
	|ИЗ
	|	Справочник.БрендыДляСайта КАК БрендыДляСайта
	|ГДЕ
	|	БрендыДляСайта.ПометкаУдаления = ЛОЖЬ";
	
	ВыборкаБр=Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаБР.Следующий() Цикл
		
		ОбъектCML.ЗаписатьНачалоЭлемента("Вариант");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("b"+ВыборкаБР.код));
		ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(ВыборкаБР.Наименование));
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "вариант"
	КонецЦикла;
	
	
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "варианты значений"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	
	
	////**************************************************************************************************************
	////  ПОЛОВОЗРАСТНОЙ ПРИЗНАК
	//------------------------------------------------------------------
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид","Id_MG");
	ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод","Id_MG");
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Половозрастной признак"));
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Справочник"));
	//// подуровни
	ОбъектCML.ЗаписатьНачалоЭлемента("ВариантыЗначений");
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоловозрастныеПризнакиНоменклатуры.Код,
	|	ПоловозрастныеПризнакиНоменклатуры.Наименование
	|ИЗ
	|	Справочник.ПоловозрастныеПризнакиНоменклатуры КАК ПоловозрастныеПризнакиНоменклатуры
	|ГДЕ
	|	ПоловозрастныеПризнакиНоменклатуры.Ссылка <> &Пустая";
	
	
	Запрос.УстановитьПараметр("Пустая",справочники.ПоловозрастныеПризнакиНоменклатуры.ПустаяСсылка());
	ВыборкаБр=Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаБР.Следующий() Цикл
		
		ОбъектCML.ЗаписатьНачалоЭлемента("Вариант");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("p"+ВыборкаБР.код));
		ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(ВыборкаБР.Наименование));
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "вариант"
	КонецЦикла;
	
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "варианты значений"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	
	////*************************************************************************************************************
	////                                СОСТАВ товара
	//***************************************************************************************************************
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид","Id_SM");
	ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_SM"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Состав товара"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Множественное",Строка("true"));
	
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Справочник"));
	// подуровни
	ОбъектCML.ЗаписатьНачалоЭлемента("ВариантыЗначений");
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МатериалыСостав.Код КАК Код,
	|	МатериалыСостав.Наименование КАК Наименование,
	|	МатериалыСостав.Ссылка
	|ИЗ
	|	Справочник.МатериалыСостав КАК МатериалыСостав
	|ГДЕ
	|	МатериалыСостав.ПометкаУдаления = ЛОЖЬ
	|	И МатериалыСостав.ЭтоГруппа = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Группы",МассивНом);
	ВыборкаС=Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаС.Следующий() Цикл
		
		ОбъектCML.ЗаписатьНачалоЭлемента("Вариант");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("sm"+ВыборкаС.код));
		ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(ВыборкаС.Наименование));
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "вариант"
		
	КонецЦикла;
	
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "варианты значений"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	// дены
	//нечаева 16,07,19+++
	
	
	Если мНомерВыгрузки = "026" или мНомерВыгрузки = "028" или мНомерВыгрузки = "029"  Тогда
		
		ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид","Kol_Den");
		ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Kol_Den"));
		ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Количество ден"));
		ЗаписатьТекстовойУзел(ОбъектCML, "Множественное",Строка("true"));
		
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
		ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Справочник"));
		// подуровни
		ОбъектCML.ЗаписатьНачалоЭлемента("ВариантыЗначений");
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	ТипыТоваровДляСайта.Наименование КАК Наименование,
		|	ТипыТоваровДляСайта.Код КАК Код
		|ИЗ
		|	Справочник.ТипыТоваровДляСайта КАК ТипыТоваровДляСайта
		|ГДЕ
		|	ТипыТоваровДляСайта.Наименование ПОДОБНО &den
		|	И ТипыТоваровДляСайта.ПометкаУдаления = ЛОЖЬ
		|	И ТипыТоваровДляСайта.Ссылка В ИЕРАРХИИ(&группа)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
		Запрос.УстановитьПараметр("den","%DEN");
		Запрос.УстановитьПараметр("Группа",справочники.ТипыТоваровДляСайта.НайтиПоКоду("000000128")); //из колготок берем
		ВыборкаС=Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаС.Следующий() Цикл
			
			ОбъектCML.ЗаписатьНачалоЭлемента("Вариант");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("den_"+ВыборкаС.код));
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(ВыборкаС.Наименование));
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "вариант"
			
		КонецЦикла;
		
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "варианты значений"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	КонецЕсли;
	//нечаева 16,07,19 ---
	
	
	//***********************************************************************
	//26,02,19 +++ нечаева
	Если мНомерВыгрузки = "026" или мНомерВыгрузки = "028" или мНомерВыгрузки = "029" Тогда
		
		// состав на ангийском
		//нечаева 14,05,19+++
		////*************************************************************************************************************
		////                                СОСТАВ товара
		//***************************************************************************************************************
		ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид","Id_SM_Ang");
		ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_SM_Ang"));
		ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Состав товара англ."));
		ЗаписатьТекстовойУзел(ОбъектCML, "Множественное",Строка("true"));
		
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
		ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Справочник"));
		// подуровни
		ОбъектCML.ЗаписатьНачалоЭлемента("ВариантыЗначений");
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МатериалыСостав.Код КАК Код,
		|	МатериалыСостав.Наименование КАК Наименование,
		|	МатериалыСостав.Ссылка,
		|	МатериалыСостав.АнглоязычноеНаименование
		|ИЗ
		|	Справочник.МатериалыСостав КАК МатериалыСостав
		|ГДЕ
		|	МатериалыСостав.ПометкаУдаления = ЛОЖЬ
		|	И МатериалыСостав.ЭтоГруппа = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Группы",МассивНом);
		ВыборкаС=Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаС.Следующий() Цикл
			
			ОбъектCML.ЗаписатьНачалоЭлемента("Вариант");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("sma"+ВыборкаС.код));
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(ВыборкаС.АнглоязычноеНаименование));
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "вариант"
			
		КонецЦикла;
		
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "варианты значений"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
		//нечаева 14,05,19----		
		
		////*************************************************************************************************************
		////                                Значки для упаковки производителя
		//***************************************************************************************************************
		ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид","Id_ZnUp");
		ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_ZnUp"));
		ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Значки для упаковки производителя"));
		ЗаписатьТекстовойУзел(ОбъектCML, "Множественное",Строка("true"));
		
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
		ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Справочник"));
		
		// подуровни
		ОбъектCML.ЗаписатьНачалоЭлемента("ВариантыЗначений");
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МатериалыСостав.Код КАК Код,
		|	МатериалыСостав.Наименование КАК Наименование,
		|	МатериалыСостав.Ссылка
		|ИЗ
		|	Справочник.ЗначкиДляУпаковки КАК МатериалыСостав
		|ГДЕ
		|	МатериалыСостав.ПометкаУдаления = ЛОЖЬ
		|	И МатериалыСостав.ЭтоГруппа = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Группы",МассивНом);
		ВыборкаС=Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаС.Следующий() Цикл
			
			ОбъектCML.ЗаписатьНачалоЭлемента("Вариант");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("ZnUp"+ВыборкаС.код));
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(ВыборкаС.Наименование));
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "вариант"
			
		КонецЦикла;
		
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "варианты значений"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
		
		// 26,02,19 -----
		
		//26,02,19 +++ нечаева
		
		
		
		////*************************************************************************************************************
		////                                Значки для упаковки производителя
		//***************************************************************************************************************
		ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид","Id_ZnUpO");
		ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_ZnUpO"));
		ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Значки для упаковки производителя основные"));
		ЗаписатьТекстовойУзел(ОбъектCML, "Множественное",Строка("true"));
		
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
		ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Справочник"));
		
		// подуровни
		ОбъектCML.ЗаписатьНачалоЭлемента("ВариантыЗначений");
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МатериалыСостав.Код КАК Код,
		|	МатериалыСостав.Наименование КАК Наименование,
		|	МатериалыСостав.Ссылка
		|ИЗ
		|	Справочник.ЗначкиДляУпаковки КАК МатериалыСостав
		|ГДЕ
		|	МатериалыСостав.ПометкаУдаления = ЛОЖЬ
		|	И МатериалыСостав.ЭтоГруппа = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Группы",МассивНом);
		ВыборкаС=Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаС.Следующий() Цикл
			
			ОбъектCML.ЗаписатьНачалоЭлемента("Вариант");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("ZnUpO"+ВыборкаС.код));
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(ВыборкаС.Наименование));
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "вариант"
			
		КонецЦикла;
		
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "варианты значений"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	КонецЕсли;
	// 26,02,19 -----
	
	
	
	
	////++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	////-------------------
	//ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	//ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_RazmOb"));
	//ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_RazmOb"));
	//ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Размер общий"));
	//ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	//ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	//ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Строка"));
	//ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	//ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	//ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	//-------------------
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_NaimDSite"));
	ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_NaimDSite"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Название для сайта"));
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Строка"));
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	
	
	//нечаева 26,02,19++++
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	//----------------------------------------------------------------------------------------
	Если мНомерВыгрузки = "026" или мНомерВыгрузки = "028" или мНомерВыгрузки = "029" Тогда
		
		ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_OpisanIt"));
		ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_OpisanIt"));
		ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Описание товара на итальянском"));
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
		ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Строка"));
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
		
		//----------------------------------------------------------------------------------------
		ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_OpisanEng"));
		ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_OpisanEng"));
		ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Описание товара на английском"));
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
		ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Строка"));
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
		
		//----------------------------------------------------------------------------------------
		ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_OpisanKaz"));
		ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_OpisanKaz"));
		ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Описание товара на казахском"));
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
		ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Строка"));
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
		
		//----------------------------------------------------------------------------------------
		ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_Slogan"));
		ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_Slogan"));
		ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Слоган"));
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
		ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Строка"));
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
		
		//----------------------------------------------------------------------------------------
		ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_SloganIt"));
		ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_SloganIt"));
		ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Слоган на итальянском"));
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
		ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Строка"));
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
		
		//----------------------------------------------------------------------------------------
		ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_SloganEng"));
		ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_SloganEng"));
		ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Слоган на английском"));
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
		ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Строка"));
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
		
		//----------------------------------------------------------------------------------------
		ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_SloganKaz"));
		ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_SloganKaz"));
		ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Слоган на казахском"));
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
		ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Строка"));
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
		
		//нечаева 14,05,19+++
		//----------------------------------------------------------------------------------------
		ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_OpisKaz"));
		ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_OpisKaz"));
		ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Описание для сайта на казахском"));
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
		ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Строка"));
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
		//----------------------------------------------------------------------------------------
		ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_OpisEng"));
		ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_OpisEng"));
		ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Описание для сайта на Английском"));
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
		ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Строка"));
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
		//----------------------------------------------------------------------------------------
		ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_OpisIt"));
		ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_OpisIt"));
		ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Описание для сайта на итальянском"));
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
		ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Строка"));
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
		//нечаева 14,05,19---
		
		
		
		
		
	КонецЕсли;
	//нечаева 26,02,19 ----
	
	
	////*************************************************************************************************************
	//                              размер для сайта
	////***************************************************************************************************************
	//ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	//ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_RazmDSite"));
	//ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_RazmDSite"));
	//ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Размер для сайта"));
	//ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	//ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	//ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Справочник"));
	//// подуровни
	//ОбъектCML.ЗаписатьНачалоЭлемента("ВариантыЗначений");
	//
	//Запрос=Новый Запрос;
	//Запрос.Текст="ВЫБРАТЬ  различные
	//|	РазмерыЧашки.Код,
	//|	РазмерыЧашки.Наименование
	//|ИЗ
	//|	Справочник.РазмерыЧашки КАК РазмерыЧашки
	//|ГДЕ
	//|	РазмерыЧашки.ЭтоГруппа = ЛОЖЬ
	//|	И РазмерыЧашки.ПометкаУдаления = ЛОЖЬ ";
	//
	//
	//ВыборкаБр=Запрос.Выполнить().Выбрать();
	//
	//Пока ВыборкаБР.Следующий() Цикл
	//	
	//	ОбъектCML.ЗаписатьНачалоЭлемента("Вариант");
	//	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("r"+ВыборкаБР.код));
	//	ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(ВыборкаБР.Наименование));
	// 	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "вариант"
	
	//КонецЦикла;
	//
	//// нечаева 12,12,17+++ 
	////Еще сюда же, в значения справочника, запишем данные простых размеров, кроме чашек. Для нового сайта
	//Запрос=Новый Запрос;
	//Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	//			 |	Номенклатура.Размер.Код КАК Код,
	//			 |	Номенклатура.Размер.Наименование КАК Наименование
	//			 |ИЗ
	//			 |	Справочник.Номенклатура КАК Номенклатура
	//			 |ГДЕ
	//			 |	Номенклатура.Ссылка В ИЕРАРХИИ(&ТекНом)
	//			 |	И Номенклатура.Ссылка.ЭтоГруппа = ЛОЖЬ
	//			 |
	//			 |УПОРЯДОЧИТЬ ПО
	//			 |	Код";
	//			 
	//Запрос.УстановитьПараметр("ТекНом",МассивНом);
	//
	//ВыборкаБр=Запрос.Выполнить().Выбрать();
	//
	//
	//Пока ВыборкаБР.Следующий() Цикл
	//	
	//	ОбъектCML.ЗаписатьНачалоЭлемента("Вариант");
	//	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("r"+ВыборкаБР.код));
	//	ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(ВыборкаБР.Наименование));
	// 	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "вариант"
	
	//КонецЦикла;
	
	//
	//// нечаева 12,12,17---
	//	 	
	//ОбъектCML.ЗаписатьКонецЭлемента(); // конец "варианты значений"
	//ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	//ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	//ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	//
	
	////**************************************************************************************************************
	////  КОЛЛЕКЦИЯ ДЛЯ САЙТА
	////**************************************************************************************************************
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_KollDSite"));
	ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_KollDSite"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Коллекция для сайта"));
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Справочник"));
	// подуровни
	ОбъектCML.ЗаписатьНачалоЭлемента("ВариантыЗначений");
	
	
	//++-++ !!!!!!!!!!!!!!
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	КоллекцииДляСайта.Код,
	|	КоллекцииДляСайта.Наименование
	|ИЗ
	|	Справочник.КоллекцииДляСайта КАК КоллекцииДляСайта
	|ГДЕ
	|	КоллекцииДляСайта.ПометкаУдаления = ЛОжь
	|	И КоллекцииДляСайта.ЭтоГруппа = ЛОжь";
	
	ВыборкаБр=Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаБР.Следующий() Цикл
		
		ОбъектCML.ЗаписатьНачалоЭлемента("Вариант");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("k"+ВыборкаБР.код));
		ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(ВыборкаБР.Наименование));
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "вариант"
		
	КонецЦикла;
	
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "варианты значений"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	
	
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойства"
	
	
	
	//*****************************************************************
	
	 //****
	
	//ТипЦен1=Справочники.ТипыЦен.НайтиПоКоду("SSP-0301"); // частное лицо
	//ТипЦен2=Справочники.ТипыЦен.НайтиПоКоду("SNL-0393"); //  сале - частное лицо
	//
	//
	
	
	ТипЦен1=Справочники.ТипыЦен.НайтиПоКоду("SNL-0229"); //обцл
	ТипЦен2=Справочники.ТипыЦен.НайтиПоКоду("SSP-0314");  // сейл опт отповая розница
	ТипЦен3=Справочники.ТипыЦен.НайтиПоКоду("SNL-0584");  // SALE ТР (точечная розница))


	
	
	
	
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЦен");
	
	//--1------------------------------------------------------------
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЦен");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка(ТипЦен1.код));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", Строка(ТипЦен1.Наименование));
	ЗаписатьТекстовойУзел(ОбъектCML, "Валюта", Строка("RUB"));
	
	ОбъектCML.ЗаписатьНачалоЭлемента("Налог");
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", Строка("НДС"));
	ЗаписатьТекстовойУзел(ОбъектCML, "УчтеноВСумме", Строка("true"));
	ОбъектCML.ЗаписатьКонецЭлемента(); // налог
	
	ОбъектCML.ЗаписатьКонецЭлемента(); // тип цен
	//--------------------------------------------------------------
	//--2------------------------------------------------------------
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЦен");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка(ТипЦен2.код));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", Строка(ТипЦен2.наименование));
	ЗаписатьТекстовойУзел(ОбъектCML, "Валюта", Строка("RUB"));
	
	ОбъектCML.ЗаписатьНачалоЭлемента("Налог");
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", Строка("НДС"));
	ЗаписатьТекстовойУзел(ОбъектCML, "УчтеноВСумме", Строка("true"));
	ОбъектCML.ЗаписатьКонецЭлемента(); // налог
	
	ОбъектCML.ЗаписатьКонецЭлемента(); // тип цен
	//--3------------------------------------------------------------
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЦен");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка(ТипЦен3.код));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", Строка(ТипЦен3.наименование));
	ЗаписатьТекстовойУзел(ОбъектCML, "Валюта", Строка("RUB"));
	
	ОбъектCML.ЗаписатьНачалоЭлемента("Налог");
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", Строка("НДС"));
	ЗаписатьТекстовойУзел(ОбъектCML, "УчтеноВСумме", Строка("true"));
	ОбъектCML.ЗаписатьКонецЭлемента(); // налог
	
	ОбъектCML.ЗаписатьКонецЭлемента(); // тип цен

	//--------------------------------------------------------------
	ОбъектCML.ЗаписатьКонецЭлемента(); // типы цен
	
	
	
	//-------------------------------------------------------------------------------
	// склады
	//---------------------------------------------------------------------------------
	//
	//<Склады>
	//        <Склад>
	//            <Ид>STC-60</Ид>
	//            <Наименование>Наименование склада STC-60</Наименование>
	//        </Склад>
	//    </Склады>
    Склад1 = справочники.Склады.НайтиПоКоду("STC-60");
	
	ОбъектCML.ЗаписатьНачалоЭлемента("Склады");
	
	//--1------------------------------------------------------------
	ОбъектCML.ЗаписатьНачалоЭлемента("Склад");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка(склад1.код));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", Строка(склад1.Наименование));
			
	ОбъектCML.ЗаписатьКонецЭлемента(); // склад
	//--------------------------------------------------------------
	
	ОбъектCML.ЗаписатьКонецЭлемента(); // склады

	//**************************************************************************	

	
	
	
	//-----------------------------------------------------------------------------------------
	//   Заполнение цен на товары
	//-----------------------------------------------------------------------------------------
	#Если Клиент Тогда
		Состояние("Заполнение цен на товары...");
	#КонецЕсли
	
	
	ОбъектCML.ЗаписатьКонецЭлемента();  // классификатор
	//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
	//     описания  товаров
	//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
	#Если Клиент Тогда
		Состояние("Заполнение каталога товаров...");
	#КонецЕсли
	
	
	ОбъектCML.ЗаписатьНачалоЭлемента("Каталог");
	ОбъектCML.ЗаписатьАтрибут("СодержитТолькоИзменения","true");
	
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_TorgKat"));
	ЗаписатьТекстовойУзел(ОбъектCML, "ИдКлассификатора","Id_Klassificator");
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Основаной каталог товаров СТИЛЬПАРК"));
	ОбъектCML.ЗаписатьНачалоЭлемента("Владелец");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_Vladelec"));
	ЗаписатьТекстовойУзел(ОбъектCML, "ПолноеНаименование","СТИЛЬПАРК");
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("СТИЛЬПАРК"));
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "владелец"
	
	////----------------------------------------------------------//------------------------------------------------------------//--------------------------------------------------------------
	////      ОПИСАНИЯ ТОВАРОВ
	////----------------------------------------------------------//------------------------------------------------------------//--------------------------------------------------------------
	
	// выбираем все товары
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ном.Родитель.Наименование КАК наименование,
	|	Ном.Родитель КАК Группа,
	|	Ном.Родитель.Родитель.Родитель.Родитель.Наименование КАК ТипТовара,
	|	Ном.Родитель.Родитель.Родитель.Наименование КАК Брэнд,
	|	Ном.Родитель.Родитель.Наименование КАК коллекция,
	|	Ном.Родитель.Код КАК Модель_Код,
	|	Ном.Родитель.Наименование КАК Модель,
	|	ВЫРАЗИТЬ(Ном.Родитель.Состав КАК СТРОКА(100)) КАК Состав,
	|	ВЫРАЗИТЬ(Ном.Родитель.ОписаниеТовараДляСайта КАК СТРОКА(500)) КАК Описание,
	|	Ном.Родитель.ТипТовараДляСайта.Наименование КАК ТипТовараДляСайта,
	|	Ном.Родитель.КатегорияИспользованияДляСайта.Наименование КАК КатегорияИспользованияДляСайта,
	|	Ном.Родитель.КоллекцияДляСайта.Код КАК КоллекцияДляСайта,
	|	Ном.Родитель.ПоловозрастнойПризнак.Код КАК ПоловозрастнойПризнак,
	|	Ном.Родитель.БрендДляСайта.Код КАК БрендДляСайта,
	|	Ном.Родитель.БрендДляСайта.Наименование КАК БрендДляСайтаНаим,
	|	Ном.ПодТипТовараДляСайта КАК ПодТипТовараДляСайта1,
	|	Ном.Родитель.Ссылка КАК ссылка,
	|	Ном.Родитель.Код КАК код,
	|	ВЫРАЗИТЬ(Ном.Родитель.НазваниеТовараДляСайта КАК СТРОКА(150)) КАК НазваниеТовараДляСайта,
	|	ВЫРАЗИТЬ(Ном.Родитель.ПодТипТовараДляСайтаСтр КАК СТРОКА(150)) КАК ПодтипТовараДляСайта,
	|	ВЫБОР
	|		КОГДА Ном.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|			ТОГДА ""Да""
	|		КОГДА Ном.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	|			ТОГДА ""Нет""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Ном.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|					ТОГДА ""Да""
	|				КОГДА Ном.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	|					ТОГДА ""Нет""
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Ном.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|							ТОГДА ""Да""
	|						КОГДА Ном.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	|							ТОГДА ""Нет""
	|						ИНАЧЕ ВЫБОР
	|								КОГДА Ном.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|									ТОГДА ""Да""
	|								КОГДА Ном.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	|									ТОГДА ""Нет""
	|								ИНАЧЕ ВЫБОР
	|										КОГДА Ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|											ТОГДА ""Да""
	|										КОГДА Ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	|											ТОГДА ""Нет""
	|										ИНАЧЕ ""Нет""
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ВыгружатьНаСайт,
	|	1 КАК КолФакт,
	|	Ном.Родитель.Ведущий КАК Ведущий
	|ИЗ
	|	Справочник.Номенклатура КАК Ном
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(
	|				&Дата2,
	|				Склад В ИЕРАРХИИ (&ТекСклад1)
	|					ИЛИ Склад В ИЕРАРХИИ (&ТекСклад2)) КАК ОстаткиТМЦОстатки
	|		ПО Ном.Ссылка = ОстаткиТМЦОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	|				&Дата2,
	|				Склад В ИЕРАРХИИ (&ТекСклад1)
	|					ИЛИ Склад В ИЕРАРХИИ (&ТекСклад2)) КАК РезервыТМЦОстатки
	|		ПО Ном.Ссылка = РезервыТМЦОстатки.Номенклатура
	|ГДЕ
	|	НЕ Ном.ЭтоГруппа
	|	И Ном.Ссылка В ИЕРАРХИИ(&Группы)
	|	И ВЫБОР
	|			КОГДА Ном.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|				ТОГДА ""Да""
	|			КОГДА Ном.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	|				ТОГДА ""Нет""
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Ном.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|						ТОГДА ""Да""
	|					КОГДА Ном.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	|						ТОГДА ""Нет""
	|					ИНАЧЕ ВЫБОР
	|							КОГДА Ном.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|								ТОГДА ""Да""
	|							КОГДА Ном.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	|								ТОГДА ""Нет""
	|							ИНАЧЕ ВЫБОР
	|									КОГДА Ном.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|										ТОГДА ""Да""
	|									КОГДА Ном.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	|										ТОГДА ""Нет""
	|									ИНАЧЕ ВЫБОР
	|											КОГДА Ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|												ТОГДА ""Да""
	|											КОГДА Ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	|												ТОГДА ""Нет""
	|											ИНАЧЕ ""Нет""
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ = ""Да""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Ном.Родитель.Наименование,
	|	Ном.Родитель,
	|	Ном.Родитель.Родитель.Родитель.Родитель.Наименование,
	|	Ном.Родитель.Родитель.Родитель.Наименование,
	|	Ном.Родитель.Родитель.Наименование,
	|	Ном.Родитель.Код,
	|	Ном.Родитель.Наименование,
	|	ВЫРАЗИТЬ(Ном.Родитель.Состав КАК СТРОКА(150)),
	|	ВЫРАЗИТЬ(Ном.Родитель.ОписаниеТовараДляСайта КАК СТРОКА(500)),
	|	Ном.Родитель.ТипТовараДляСайта.Наименование,
	|	Ном.Родитель.КатегорияИспользованияДляСайта.Наименование,
	|	Ном.Родитель.КоллекцияДляСайта.Код,
	|	Ном.Родитель.ПоловозрастнойПризнак.Код,
	|	Ном.Родитель.БрендДляСайта.Код,
	|	Ном.Родитель.БрендДляСайта.Наименование,
	|	Ном.Родитель.ПодТипТовараДляСайта,
	|	Ном.Родитель.Ссылка,
	|	Ном.Родитель.Код,
	|	ВЫРАЗИТЬ(Ном.Родитель.НазваниеТовараДляСайта КАК СТРОКА(150)),
	|	ВЫРАЗИТЬ(Ном.Родитель.ПодТипТовараДляСайтаСтр КАК СТРОКА(150)),
	|	ВЫБОР
	|		КОГДА Ном.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|			ТОГДА ""Да""
	|		КОГДА Ном.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	|			ТОГДА ""Нет""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Ном.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|					ТОГДА ""Да""
	|				КОГДА Ном.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	|					ТОГДА ""Нет""
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Ном.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|							ТОГДА ""Да""
	|						КОГДА Ном.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	|							ТОГДА ""Нет""
	|						ИНАЧЕ ВЫБОР
	|								КОГДА Ном.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|									ТОГДА ""Да""
	|								КОГДА Ном.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	|									ТОГДА ""Нет""
	|								ИНАЧЕ ВЫБОР
	|										КОГДА Ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|											ТОГДА ""Да""
	|										КОГДА Ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	|											ТОГДА ""Нет""
	|										ИНАЧЕ ""Нет""
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	0,
	|	Ном.Родитель.Ведущий
	|ИЗ
	|	Справочник.Номенклатура КАК Ном
	|ГДЕ
	|	НЕ Ном.ЭтоГруппа
	|	И Ном.Ссылка В ИЕРАРХИИ(&Группы)
	|	И ВЫБОР
	|			КОГДА Ном.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|				ТОГДА ""Да""
	|			КОГДА Ном.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	|				ТОГДА ""Нет""
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Ном.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|						ТОГДА ""Да""
	|					КОГДА Ном.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	|						ТОГДА ""Нет""
	|					ИНАЧЕ ВЫБОР
	|							КОГДА Ном.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|								ТОГДА ""Да""
	|							КОГДА Ном.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	|								ТОГДА ""Нет""
	|							ИНАЧЕ ВЫБОР
	|									КОГДА Ном.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|										ТОГДА ""Да""
	|									КОГДА Ном.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	|										ТОГДА ""Нет""
	|									ИНАЧЕ ВЫБОР
	|											КОГДА Ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|												ТОГДА ""Да""
	|											КОГДА Ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	|												ТОГДА ""Нет""
	|											ИНАЧЕ ""Нет""
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ = ""Нет""
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипТовара,
	|	Брэнд,
	|	Группа
	|ИТОГИ ПО
	|	Группа";
	
	
	Массив=Новый массив;
	Массив.Добавить(Справочники.Склады.НайтиПоКоду("SSP-22"));
	
	//Массив.Добавить(Справочники.Склады.НайтиПоКоду("SNL-82"));
	//Массив.Добавить(Справочники.Склады.НайтиПоКоду("SNL-22"));
	//Массив.Добавить(Справочники.Склады.НайтиПоКоду("SNL-76"));
	//Массив.Добавить(Справочники.Склады.НайтиПоКоду("SNL-83"));
	
	МосковскиеТЦ=Справочники.Склады.НайтиПоКоду("SSP-22");
	
	Запрос.УстановитьПараметр("ТекСклад1",Массив);
	Запрос.УстановитьПараметр("ТекСклад2",МосковскиеТЦ);
	Запрос.УстановитьПараметр("Дата2",ТекущаяДата());
	Запрос.УстановитьПараметр("Группы",МассивНом); // группа ном.
	Запрос.УстановитьПараметр("ПустаяСсылка",Справочники.Номенклатура.ПустаяСсылка());
	
	Выборка2=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Группа");
	
	//	ЭлементыФормы.Индикатор.МаксимальноеЗначение=Выборка.Количество();
	Индикатор=0;
	КолТовара=Выборка2.Количество();
	
	//	Сообщить("Количество "+Запрос.Выполнить().Выбрать().Количество());
	
	
	//------------------------------------------------------------
	//       начало раздела товары
	//------------------------------------------------------------
	ОбъектCML.ЗаписатьНачалоЭлемента("Товары");
	
	колтов=0;
	КритОшибки=Новый Массив;
	КритОшибки.Очистить();
	тзЦветов=Новый таблицаЗначений;
	тзЦветов.Очистить();
	
	
	
	Пока Выборка2.Следующий() Цикл
		
		Индикатор=Индикатор+1;
		
		#Если Клиент Тогда
			ОбработкаПрерыванияПользователя();
			Состояние("Обработка: "+Выборка2.Брэнд+" "+Выборка2.Модель);			
		#КонецЕсли	
		
		Если Выборка2.Группа.ПоловозрастнойПризнак.пустая() Тогда
			ПоловозрастнойПризнак=ПолучитьРеквизитРодителя(Выборка2.Группа,"ПоловозрастнойПризнак");
		Иначе
			ПоловозрастнойПризнак=Выборка2.Группа.ПоловозрастнойПризнак;
		КонецЕсли;
		
		Если Выборка2.Группа.ТипТовараДляСайта.пустая() Тогда
			ТипТовараДляСайта=ПолучитьРеквизитРодителя(Выборка2.Группа,"ТипТовараДляСайта");
		Иначе
			ТипТовараДляСайта=Выборка2.Группа.ТипТовараДляСайта;
		КонецЕсли;
		
		Если Выборка2.Группа.БрендДляСайта.пустая() Тогда
			БрендДляСайта=ПолучитьРеквизитРодителя(Выборка2.Группа,"БрендДляСайта");
		Иначе
			БрендДляСайта=Выборка2.Группа.БрендДляСайта;
		КонецЕсли;
		
		Если Выборка2.Группа.КоллекцияДляСайта.пустая() Тогда
			КоллекцияДляСайта=ПолучитьРеквизитРодителя(Выборка2.Группа,"КоллекцияДляСайта");
		Иначе
			КоллекцияДляСайта=Выборка2.Группа.КоллекцияДляСайта;
		КонецЕсли;
		
		Если Выборка2.Группа.ПодТипыНоменклатурыДляСайта.количество()<=0 и Выборка2.Группа.Родитель.ПодТипыНоменклатурыДляСайта.количество()<=0 
			и Выборка2.Группа.Родитель.Родитель.ПодТипыНоменклатурыДляСайта.количество()<=0 Тогда
			// нет подгрупп
			// не пишем, отправляем письмо по окончании загрузки
			
			КритичОшибки.Добавить("Не определен подтип товара "+Выборка2.Группа+"  "+Выборка2.Группа.код  );
			ПРиКрОш=Истина;
			продолжить;
		КонецЕсли;
		
		
		
		Выборка=Выборка2.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			//Если Выборка.Ссылка.Родитель.ПодТипыНоменклатурыДляСайта.количество()<=0 Тогда
			//	// нет подгрупп
			//	// не пишем, отправляем письмо по окончании загрузки
			//	КритичОшибки.Добавить("Не определен подтип товара "+Выборка.Ссылка+"  "+Выборка.Ссылка.код  );
			//	
			//	продолжить;
			//КонецЕсли;
			//
			
			
			//Нечаева 01,11,18 +++
			// тогда активность = ложь
			Если Выборка.КолФакт<=0 Тогда
				Продолжить;
			КонецЕсли;
			//Нечаева 01,11,18 ---
			
			
			
			//---------------------------------------------------------------------------------------
			//    раздел товар
			//------------------------------------------------------------
			ОбъектCML.ЗаписатьНачалоЭлемента("Товар");
			
			//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
			//    ОПИСАНИЕ ТОВАРА
			//------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
			
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка(Выборка.ссылка.Код)); //Строка(Выборка.ссылка.уникальныйИдентификатор())
			ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка(Выборка.Наименование));
			ЗаписатьТекстовойУзел(ОбъектCML, "ПолноеНаименование",Строка(Выборка.Наименование));
			//  Активность
			// Нечаева 15.05.13 +++
			Активность="true";
			Если Выборка.КолФакт>0 Тогда
				Активность="true";
			Иначе
				Активность="false";
			КонецЕсли;
			ЗаписатьТекстовойУзел(ОбъектCML, "БитриксАктивность",Строка(Активность));
			// нечаева 15.05.13 ---- конец - 
			
			
			
			
			ОбъектCML.ЗаписатьНачалоЭлемента("БазоваяЕдиница");
			ОбъектCML.ЗаписатьАтрибут("Код","796");
			ОбъектCML.ЗаписатьАтрибут("НаименованиеПолное","Штука");
			ОбъектCML.ЗаписатьТекст("Штука");
			ОбъектCML.ЗаписатьКонецЭлемента();
			
			
			
			ЗаписатьТекстовойУзел(ОбъектCML, "Описание",ПолучитьСтрокуЗаписиДляXML(Строка(Выборка.Ссылка.ОписаниеТовараДляСайта)));
			
			//Если Выборка.Ссылка.ПодТипыНоменклатурыДляСайта.количество()>0 Тогда
			//	
			//	ОбъектCML.ЗаписатьНачалоЭлемента("Группы");
			//	
			//	Для каждого ТекСтрока из Выборка.Ссылка.ПодТипыНоменклатурыДляСайта Цикл
			//		
			//		//нечаева 02,10,19+++
			//		Если мНомерВыгрузки = "026" или мНомерВыгрузки = "028" или мНомерВыгрузки = "029" Тогда
			//			
			//			Если СокрЛП(ТекСтрока.ПодТИпТовараДляСайта.ТипТовараДляСайтаМиними.Код)<>"" Тогда
			//				ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("gr"+ТекСтрока.ПодТИпТовараДляСайта.ТипТовараДляСайтаМиними.Код));
			//			иначе
			//				ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("gr"+ТекСтрока.ПодТИпТовараДляСайта.Код));
			//			КонецЕсли;
			//			
			//		иначе
			//			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("gr"+ТекСтрока.ПодТИпТовараДляСайта.Код));
			//		КонецЕсли;
			//		//нечаева 02,10,19---
			//	КонецЦикла;
			//	
			//	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "группы"
			//	
			//	
			//	
			//иначеЕсли Выборка.Ссылка.Родитель.ПодТипыНоменклатурыДляСайта.количество()>0 Тогда
			//	
			//	ОбъектCML.ЗаписатьНачалоЭлемента("Группы");
			//	Для каждого ТекСтрока из Выборка.Ссылка.Родитель.ПодТипыНоменклатурыДляСайта Цикл
			//		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("gr"+ТекСтрока.ПодТИпТовараДляСайта.Код));
			//	КонецЦикла;
			//	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "группы"
			//	
			//иначеЕсли Выборка.Ссылка.Родитель.Родитель.ПодТипыНоменклатурыДляСайта.количество()>0 Тогда		
			//	
			//	ОбъектCML.ЗаписатьНачалоЭлемента("Группы");
			//	Для каждого ТекСтрока из Выборка.Ссылка.Родитель.Родитель.Родитель.ПодТипыНоменклатурыДляСайта Цикл
			//		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("gr"+ТекСтрока.ПодТИпТовараДляСайта.Код));
			//	КонецЦикла;
			//	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "группы"
			//Иначе
			//	
			//	ОбъектCML.ЗаписатьНачалоЭлемента("Группы");
			//	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("gr"+ТипТовараДляСайта.Код));
			//	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "группы"
			//	
			//КонецЕсли;
			
			
			
			
			ОбъектCML.ЗаписатьНачалоЭлемента("Группы");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("gr"+Выборка.Ссылка.Код));  // это код модели???
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("gr"+Выборка.Ссылка.РОдитель.Код)); 
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "группы"
			
			
			
			
			
			
			///-------------------------------------------------------------------------------------------------------------------------------
			///    свойства товара
			///-------------------------------------------------------------------------------------------------------------------------------
			
			ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойств");
			
			//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
			//   подгруппы свойств
			//------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
			
			//******************************************************************************
			
			//// код модели, как привязка????
			//ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			//ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("CML2_CODE"));
			
			ННН = Выборка.Ссылка.Наименование;
			ННН = СтрЗаменить(ННН,",","");
			ННН = СтрЗаменить(ННН,".","");
			ННН = СтрЗаменить(ННН,"(","");
			ННН = СтрЗаменить(ННН,")","");
			
			ННН = СтрЗаменить(ННН," ","-");
			
			//******************************************************************************
			//
			//ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			//ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("CML2_CODE"));
			//ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(ННН));
			//ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
			//
			//**************************************************
			// Kol_Den нечаева 16,07,19+++
			
			
			Если мНомерВыгрузки = "026" или мНомерВыгрузки = "028" или мНомерВыгрузки = "029" Тогда
				
				запрос = новый запрос;
				Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	НоменклатураПодТипыНоменклатурыДляСайта.ПодТипТовараДляСайта как тип,
				|	НоменклатураПодТипыНоменклатурыДляСайта.Ссылка,
				|	ТипыТоваровДляСайта.Наименование
				|ИЗ
				|	Справочник.Номенклатура.ПодТипыНоменклатурыДляСайта КАК НоменклатураПодТипыНоменклатурыДляСайта
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыТоваровДляСайта КАК ТипыТоваровДляСайта
				|		ПО НоменклатураПодТипыНоменклатурыДляСайта.ПодТипТовараДляСайта = ТипыТоваровДляСайта.Ссылка
				|ГДЕ
				|	НоменклатураПодТипыНоменклатурыДляСайта.Ссылка В ИЕРАРХИИ(&ТекНом)
				|	И (ТипыТоваровДляСайта.Ссылка В ИЕРАРХИИ(&колготки) или
				|	 ТипыТоваровДляСайта.Ссылка В ИЕРАРХИИ(&чулки))
				|	И ТипыТоваровДляСайта.Наименование ПОДОБНО ""%DEN""";
				Запрос.УстановитьПараметр("ТекНом",Выборка.ссылка);
				Запрос.УстановитьПараметр("колготки",справочники.ТипыТоваровДляСайта.НайтиПоКоду("000000128"));	//из колготок берем
				Запрос.УстановитьПараметр("чулки",справочники.ТипыТоваровДляСайта.НайтиПоКоду("000000130"));	//из колготок берем
				РРР = Запрос.Выполнить().Выбрать();
				Пока ррр.Следующий() цикл
					ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
					ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Kol_Den"));
					ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка("den_"+ррр.тип.код));
					ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-во"
				КонецЦикла;
			конецЕсли;	
			//нечаева 16,07,19---
			
			//------------------------------------------
			//******************************************************************************
			ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_Udalenie"));
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение","0");
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
			
			//******************************************************************************
			ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_KodModeli"));
			Если Выборка.ведущий=справочники.Номенклатура.ПустаяСсылка() или Выборка.Ведущий=Null или Выборка.Ведущий=Неопределено Тогда
				КодМодели=Строка(Выборка.Группа.Код);
				//крохин начало 29.02.2012
				//для платной рекламы выгружаем только элементы
				Если ПолучитьРеквизитРодителя(Выборка.Ссылка,"ВидНоменклатуры") = Перечисления.ВидыНоменклаутры.РекламаПлатная Тогда
					КодМодели=Строка(Выборка.Код);	
				КонецЕсли;					
				//крохин конец 29.02.2012
				
			Иначе
				КодМодели=Строка(Выборка.Ведущий.Код);
				//крохин начало 29.02.2012
				//для платной рекламы выгружаем только элементы
				Если ПолучитьРеквизитРодителя(Выборка.Ссылка,"ВидНоменклатуры") = Перечисления.ВидыНоменклаутры.РекламаПлатная Тогда
					КодМодели=Строка(Выборка.Код);	
				КонецЕсли;					
				//крохин конец 29.02.2012
			КонецЕсли;
			
			
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(КодМодели));
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
			
			//нечаева 12,12,17++
			
			//******************************************************************************
			ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_XMLID_Kod_Modeli"));
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка("km"+КодМодели));
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
			
			//******************************************************************************
			ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_KodTovara"));
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(Выборка.Код));
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
			//******************************************************************************
			штуквкоробочке=0;
			Если  Выборка.ссылка.ШтукВКоробочке = 0 или Выборка.ссылка.ШтукВКоробочке = неопределено  тогда
				штуквкоробочке= 1;
			иначе
				штуквкоробочке = Выборка.ссылка.ШтукВКоробочке;
			КонецЕсли;	
			
			
			
			ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_Kol_V_Bl"));
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(штуквкоробочке));
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
			
			
			
			//-------------------------------------------------------------------------------
			
			ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_Ves"));
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Число(Выборка.ссылка.ВесБруттоШтуки));
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
			 //-------------------------------------------------------------------------------
			
			ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_Ob"));
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Число(Выборка.ссылка.ОбъемШтуки));
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"

						
			
			
			//Id_Kol_V_Bl
			//******************************************************************************
			
			ШтукВКоробке=0;
			Если  Выборка.ссылка.ШтукВКоробке = 0 или Выборка.ссылка.ШтукВКоробке = неопределено  тогда
				ШтукВКоробке= 1;
			иначе
				ШтукВКоробке = Выборка.ссылка.ШтукВКоробке;
			КонецЕсли;
			
			
			ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_Kol_v_Kor"));
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(ШтукВКоробке));
			
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
			
			
			
			//  
			//  //******************************************************************************
			//  ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			//  ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_XMLID_Cvet"));
			//  ЗаписатьТекстовойУзел(ОбъектCML, "ИдЗначения",Строка("kcv"+Выборка.КодЦвета));
			//ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
			//  		
			
			//нечаева 12,12,17---
			//
			//   //******************************************************************************
			//   ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			//   ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_KodCveta"));
			//   ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(Выборка.ЦветИМ));
			// ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
			//   	
			
			//******************************************************************************
			ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_PrSkidki"));
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение","0");
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
			
			//******************************************************************************
			ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_Brend"));
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка("b"+БрендДляСайта.код));
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
			
			//******************************************************************************
			ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_MG"));
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка("p"+ПоловозрастнойПризнак.код));
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
			
			//		//******************************************************************************
			//		ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			//		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_Cvet"));
			//		Цвет=?(СтрДлина(Выборка.ЦветРусскоеНаименование)>0,""+Выборка.ЦветРусскоеНаименование+"("+Выборка.Цвет+")",Выборка.Цвет);
			//		
			//		Если СтрДлина(Выборка.ЦветРусскоеНаименование)<=0 Тогда
			//			 ПриКрОш=истина;
			//			 Н=тзЦвет.Добавить();
			//			 Н.цвет=Выборка.ссылка.цвет;
			//			 //КритичОшибки.Добавить("Нет русского наименования у цвета "+Выборка.Цвет+" - Код цвета: "+Выборка.КодЦвета+" (код товара: "+Выборка.Код+" ).");
			//		КонецЕсли;	
			//		
			//		ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(цвет));
			// 		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
			//		
			//		//******************************************************************************
			//		ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			//		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_RazmOb"));
			//		
			//		Размер="";
			//		Если СтрДлина(СокрЛП(Выборка.Размер2))>0 Тогда
			//			Размер=Выборка.Размер2;
			//		Иначе
			//			Размер=Выборка.Размер;
			//		КонецЕсли;	
			//		
			//		Если ТипТовараДляСайта.код="000000026" Тогда //бюст
			//			
			//			Если СтрДлина(Выборка.НамРазмерДляСайта)>0 Тогда
			//				ПослБуква=СокрЛП(Прав(Выборка.НамРазмерДляСайта,1));
			//				Размер=""+Размер+" "+ПослБуква;
			//			КонецЕсли;
			//		КонецЕсли;
			//				
			//		
			//		ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(Размер));
			//
			// 		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
			//					
			//******************************************************************************
			ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_SostavOb"));
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(Выборка.Состав));
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
			
			//******************************************************************************
			ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_TipTovDSite"));
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(ТипТовараДляСайта.Наименование));
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
			
			//******************************************************************************
			
			//Если ТипТовараДляСайта.код="000000026" Тогда // не бюст
			//	
			//	ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			//	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_RazmDSite"));
			//	ЗаписатьТекстовойУзел(ОбъектCML, "ИдЗначения",Строка("r"+Выборка.РазмерДляСайта));      
			//	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
			//Иначе
			//	ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			//	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_RazmDSite"));
			//	//нечаева 12,12,17+++ было пусто
			//	ЗаписатьТекстовойУзел(ОбъектCML, "ИдЗначения",Строка("r"+Выборка.РазмерСсылка.код));      
			//	//нечаева 12,12,17---
			//	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
			//
			//КонецЕсли;
			//		
			
			//******************************************************************************
			ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_NaimDSite"));
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(Выборка.НазваниеТовараДляСайта+" "+Выборка.БрендДляСайтаНаим)); // Модель
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
			
			//******************************************************************************
			ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_KollDSite"));
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка("k"+КоллекцияДляСайта.код));
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
			
			//******************************************************************************
			ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_KollOb"));
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(Выборка.Модель));
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
			
			
			//нечаева 25,02,19++
			Если мНомерВыгрузки = "026" или мНомерВыгрузки = "028" или мНомерВыгрузки = "029"  Тогда
				
				//******************************************************************************
				ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
				ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_OpisanIt"));
				ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(Выборка.Ссылка.ОписаниеТовараДляСайтаНаИтальянском));
				ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
				//******************************************************************************
				ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
				ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_OpisanEng"));
				ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(Выборка.Ссылка.ОписаниеТовараДляСайтаНаАнглийском));
				ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
				//******************************************************************************
				Попытка
					СтрокаОТ = Строка(Выборка.Ссылка.ОписаниеТовараДляСайтаНаКазахском);
				Исключение
					СтрокаОТ = "";
				КонецПопытки;
				
				ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
				ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_OpisanKaz"));
				ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(СтрокаОТ));
				ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
				
				
				//******************************************************************************
				ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
				ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_Slogan"));
				ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(Выборка.Ссылка.Слоган));
				ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
				//******************************************************************************
				ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
				ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_SloganIt"));
				ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(Выборка.Ссылка.СлоганНаИтальянском));
				ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
				//******************************************************************************
				ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
				ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_SloganEng"));
				ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(Выборка.Ссылка.СлоганНаАнглийском));
				ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
				//******************************************************************************
				
				Попытка
					СтрокаОТ = Строка(Выборка.Ссылка.СлоганНаКазахском);
				Исключение
					СтрокаОТ = "";
				КонецПопытки;
				
				ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
				ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_SloganKaz"));
				ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(СтрокаОТ));
				ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
				
				//Нечаева 14,05,19+++
				//******************************************************************************
				ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
				ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_OpisEng"));
				ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(Выборка.Ссылка.НазваниеТовараДляСайтаНаАнглийском));
				ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
				
				//******************************************************************************
				ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
				ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_OpisIt"));
				ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(Выборка.Ссылка.НазваниеТовараДляСайтаНаИтальянском));
				ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
				
				//**************************************************************************
				ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
				ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_OpisKaz"));
				ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(Выборка.Ссылка.НазваниеТовараДляСайтаНаКазахском));
				ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
				
				//Нечаева 14,05,19---
				
				
				
			КонецЕсли;
			//нечаева 25,02,19---
			
			
			
			//******************************************************************************
			ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_OstatokOb"));
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(Выборка.колФакт));
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
			
			//******************************************************************************
			//  Активность
			// Нечаева 15.05.13 +++
			Активность="true";
			
			//Если Выборка.КолФакт>0 Тогда
			//	Активность="true";
			//Иначе
			//	Активность="false";
			//КонецЕсли;
			
			ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("CML2_ACTIVE"));
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(Активность));
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
			// Нечаева 15.05.13 ---
			
			
			
			//******************************************************************************
			//          состав товара
			//------------------------------
			
			//++-++
			Для каждого текстр из Выборка.группа.СоставНоменклатуры Цикл
				
				ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
				ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_SM"));
				ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка("sm"+ТекСтр.МатериалСостав.код));
				ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-во"
				
			КонецЦикла;
			
			Если мНомерВыгрузки = "026" или мНомерВыгрузки = "028" или мНомерВыгрузки = "029"  Тогда
				
				
				//++-++ нечаева 14,05,19+++
				Для каждого текстр из Выборка.группа.СоставНоменклатуры Цикл
					
					ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
					ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_SM_Ang"));
					ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка("sma"+ТекСтр.МатериалСостав.код));
					ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-во"
					
				КонецЦикла;
				// нечаева 14,05,19---
				
				
				//******************************************************************************
				//                значки для упаковки
				///----------------------------------------------------------------------------
				//++-++
				Для каждого текстр из Выборка.Ссылка.ЗначкиДляУпаковкиПроизводителя Цикл
					
					ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
					ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_ZnUp"));
					ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка("ZnUp"+ТекСтр.Значок.код));
					ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-во"
					
				КонецЦикла;
				
				//******************************************************************************
				//                значки для упаковки 2
				///----------------------------------------------------------------------------
				//++-++
				ТабЗнУп = Выборка.Ссылка.основнойТипУпаковки.Значки;
				Для каждого текстр из ТабЗнУп Цикл
					
					ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
					ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_ZnUpO"));
					ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка("ZnUpO"+ТекСтр.Значок.код));
					ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-во"
					
				КонецЦикла;
			КонецЕсли;
			
			//-----------------------------------------------------------------------------------
			
			
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойства"
			
			//нечаева 21,05,19+++
			Если не  мНомерВыгрузки = "026" или мНомерВыгрузки = "028" или мНомерВыгрузки = "029" Тогда
				
				// прописываем ставки налога
				
				Ставка=ПолучитьСтавкуНДС(Выборка.ссылка);
				Если Ставка=Перечисления.СтавкиНДС.НДС20 Тогда
					СтавНДС=20;
				ИначеЕсли Ставка=Перечисления.СтавкиНДС.НДС18 Тогда
					СтавНДС=18;
				ИначеЕсли Ставка=Перечисления.СтавкиНДС.НДС10 Тогда		
					СтавНДС=10;	
				Иначе
					СтавНДС=0;			
				КонецЕсли;
				
				ОбъектCML.ЗаписатьНачалоЭлемента("СтавкиНалогов");
				ОбъектCML.ЗаписатьНачалоЭлемента("СтавкаНалога");
				
				ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("НДС"));
				ЗаписатьТекстовойУзел(ОбъектCML, "Ставка",Строка(СтавНДС));
				ОбъектCML.ЗаписатьКонецЭлемента(); // конец "ставка налога"
				ОбъектCML.ЗаписатьКонецЭлемента(); // конец "ставки налогов"
			КонецЕсли;
			
			колтов=колтов+1;		
			
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "товар"
		КонецЦикла; 
		
	КонецЦикла;
	
	
	
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "товары"
	
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "каталог"
	
	//--------------------------------------------------------
	//   конец записи файла
	//--------------------------------------------------------
	
	
	
	ОбъектCML.ЗаписатьКонецЭлемента();  // комреческая информация
	ОбъектCML.Закрыть();
	
	
	#Если Клиент Тогда
		Сообщить("всего: "+колтов);
		
		Сообщить("Сформирован файл: "+ИмяФайлаВЫгрузки);
		
	#КонецЕсли
	
	//ЗаписатьВЛог("ОбменССайтом"," Интернет-магазин. Каталог выгружен!","");
	СообщитьКритОшибки();
	
КонецПроцедуры



// прайс offers
Процедура ВыгрузитьПрайс(ИмяФайлаВыгрузки,Группы)
	
	Если НЕ ВыгружатьПрайсЛист тогда
		возврат;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ИмяФайлаВыгрузки) Тогда
		#Если Клиент Тогда
			Сообщить("Не указано имя файла выгрузки !!!");
		#КонецЕсли
		
		Возврат;	
	КонецЕсли; 
	
	РазделительПолей=";";
	МассивНом= Новый Массив();
	МассивНом=Группы;
	
	
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	//                  запись файла
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	#Если Клиент Тогда
		Состояние("Начало...");
	#КонецЕсли
	
	ОбъектCML = ПолучитьОбъектДляЗаписиXML(ИмяФайлаВыгрузки, ТекущаяДата());
	//-----------------------------------------------------------------------
	ОбъектCML.ЗаписатьНачалоЭлемента("Классификатор");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка("Id_Klassificator"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", ФорматНаименованияДляCML("Пакет предложений (новый СТИЛЬПАРК)"));
	//--------
	//ОбъектCML.ЗаписатьНачалоЭлемента("Группы");
	//ОбъектCML.ЗаписатьКонецЭлемента();
	//
	
	//
	//ОбъектCML.ЗаписатьНачалоЭлемента("Группы");
	//
	//Запрос = новый Запрос;
	//Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ТипыТоваровДляСайта.Ссылка КАК Ссылка,
	//|	ТипыТоваровДляСайта.Код КАК Код,
	//|	ТипыТоваровДляСайта.Наименование КАК Наименование,
	//|	ТипыТоваровДляСайта.Представление КАК Представление,
	//|	ТипыТоваровДляСайта.Родитель КАК Родитель1,
	//|	ТипыТоваровДляСайта.Родитель.Родитель КАК родитель2,
	//|	ТипыТоваровДляСайта.Родитель.Родитель.Родитель КАК родитель3
	//|ИЗ
	//|	Справочник.Номенклатура КАК ТипыТоваровДляСайта
	//|ГДЕ
	//|	ТипыТоваровДляСайта.Родитель.Родитель.Родитель <> &Пустая
	//|	И ТипыТоваровДляСайта.ПометкаУдаления = ЛОЖЬ
	//|	И ТипыТоваровДляСайта.ЭтоГруппа = истина
	//|	И ТипыТоваровДляСайта.Ссылка В ИЕРАРХИИ(&текгруппа)
	//|ИТОГИ ПО
	//|	родитель3,
	//|	родитель2,
	//|	Родитель1";
	//
	//
	//
	//Запрос.УстановитьПараметр("текгруппа",МассивНом);  //ложь
	//Запрос.УстановитьПараметр("Пустая",ложь);  //ложь
	//Выборка3=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Родитель3");
	//ВыборкаН=Запрос.Выполнить().Выгрузить();
	//
	//
	//Пока Выборка3.Следующий() Цикл      //Ж
	//	
	//	Если Выборка3.Родитель3.ссылка=Null Тогда
	//		продолжить;
	//	КонецЕсли;	
	//	
	//	ОбъектCML.ЗаписатьНачалоЭлемента("Группа");
	//	ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка("gr"+Выборка3.Родитель3.код));
	//	
	//	Наим="";
	//		
	//	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка(Выборка3.Родитель3.наименование));
	//	
	//	// след. уровень 3
	//	Выборка2=Выборка3.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Родитель2");
	//	Если Выборка2.Количество()>0 Тогда
	//		ОбъектCML.ЗаписатьНачалоЭлемента("Группы");
	//	КонецЕсли;
	//	
	//	////-----------------------------------------------------------------------------------------
	//	Пока Выборка2.Следующий() Цикл
	//		ОбъектCML.ЗаписатьНачалоЭлемента("Группа");
	//		ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка("gr"+Выборка2.Родитель2.код));
	//		ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка(Выборка2.Родитель2.Наименование));
	//		// след. уровень - данные
	//		ВыборкаМ=Выборка2.Выбрать();
	//		Если ВыборкаМ.Количество()>0 Тогда
	//			ОбъектCML.ЗаписатьНачалоЭлемента("Группы");
	//		КонецЕсли;	
	//		
	//		
	//		//**********************************************************
	//		
	//		Выборка1=Выборка2.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Родитель1");
	//		Если Выборка1.Количество()>0 Тогда
	//			ОбъектCML.ЗаписатьНачалоЭлемента("Группы");
	//		КонецЕсли;
	//		

	//		
	//		////-----------------------------------------------------------------------------------------
	//		Пока Выборка1.Следующий() Цикл
	//			ОбъектCML.ЗаписатьНачалоЭлемента("Группа");
	//			ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка("gr"+Выборка1.Родитель1.код));
	//			ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка(Выборка1.Родитель1.Наименование));
	//			// след. уровень - данные
	//			ВыборкаМ=Выборка1.Выбрать();
	//			Если ВыборкаМ.Количество()>0 Тогда
	//				ОбъектCML.ЗаписатьНачалоЭлемента("Группы");
	//			КонецЕсли;	
	//				
	//			 				
	//			Пока ВыборкаМ.Следующий() Цикл
	//				
	//					
	//					ОбъектCML.ЗаписатьНачалоЭлемента("Группа");
	//					ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("gr"+ВыборкаМ.код));
	//					ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка(ВыборкаМ.Наименование));
	//					ОбъектCML.ЗаписатьКонецЭлемента();
	//			
	//			КонецЦикла;
	//			
	//			Если ВыборкаМ.Количество()>0 Тогда
	//				ОбъектCML.ЗаписатьКонецЭлемента();  //группы
	//			КонецЕсли;
	//				
	//			ОбъектCML.ЗаписатьКонецЭлемента();
	//			//	
	//		КонецЦикла;
	//		////-----------------------------------------------------------------------------------------
	//		//
	//		
	//		Если Выборка2.Количество()>0 Тогда
	//			ОбъектCML.ЗаписатьКонецЭлемента();
	//		КонецЕсли;	
	//		
	//		ОбъектCML.ЗаписатьКонецЭлемента();
	//		//КонецЦикла;
	//		
	//				//	
	//		ОбъектCML.ЗаписатьКонецЭлемента();
	//		//	
	//	КонецЦикла;
	//	////-----------------------------------------------------------------------------------------
	//	//
	//	
	//	Если Выборка2.Количество()>0 Тогда
	//		ОбъектCML.ЗаписатьКонецЭлемента();
	//	КонецЕсли;	
	//	
	//	ОбъектCML.ЗаписатьКонецЭлемента();
	//	//КонецЦикла;
	//	
	//КонецЦикла;	
	//ОбъектCML.ЗаписатьКонецЭлемента();

	//
	//-------
	
	
	
	
	
	
	// раздел свойства сюда переносим
	
	/// свойства 
	//********************************************************************************************************************************************
	
	
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойства");
	//-------------------
	// нечаева+++ 15.05.13
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("CML2_ACTIVE"));
	//ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("CML2_ACTIVE"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("БитриксАктивность"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Множественное",Строка("false"));
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	//******************************************************************************************
	//ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	//ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("CML2_CODE"));
	//ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("CML2_CODE"));
	//ЗаписатьТекстовойУзел(ОбъектCML, "Множественное",Строка("false"));
	//ОбъектCML.ЗаписатьКонецЭлемента(); // конец "св"
	
	
	//******************************************************************************************
	//нечаева 12,12,17+++	
	
	// Код модели в виде справочника, для группировки на стороне битрикса
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_XMLID_Kod_Modeli"));
	ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_XMLID_Kod_Modeli"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("XML Id Код модели"));
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Справочник"));
	//// подуровни
	ОбъектCML.ЗаписатьНачалоЭлемента("ВариантыЗначений");
	// код модели в виде справочника, для группировки на стороне битрикса
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Родитель.Код КАК Код,
	|	Номенклатура.Родитель.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ(&ТекНом)
	|	И Номенклатура.ЭтоГруппа = ЛОЖЬ  	
//	|	//И Номенклатура.СнятСПроизводства = ложь
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	
	Запрос.УстановитьПараметр("ТекНом",МассивНом);
	
	ВыборкаБр=Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаБР.Следующий() Цикл
		
		ОбъектCML.ЗаписатьНачалоЭлемента("Вариант");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("km"+ВыборкаБР.код));
		ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(ВыборкаБР.Наименование));
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "вариант"
	КонецЦикла;
	
	
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "варианты значений"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	
	////++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	//-------------------
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_KodModeli"));
	ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_KodModeli"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Код модели"));
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Строка"));
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	
	//-------------------
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_Shtrixkod"));
	ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_Shtrixkod"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Штрихкод"));
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Строка"));
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	
	
	
	////++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	//-------------------
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_KodCveta"));
	ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_KodCveta"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Код цвета"));
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Строка"));
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	
	////++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	//-------------------	
	// Код модели в виде справочника, для группировки на стороне битрикса
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_XMLID_Cvet"));
	ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_XMLID_Cvet"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("XML_Id Цвет"));
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Справочник"));
	//// подуровни
	ОбъектCML.ЗаписатьНачалоЭлемента("ВариантыЗначений");
	// код модели в виде справочника, для группировки на стороне битрикса
	
	Если НЕ ВыгружатьЦветаИМ ТОгда
		
		//нечаева 06,07,20 +++  было
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Номенклатура.Цвет.Код КАК Код,
		|	Номенклатура.Цвет.Наименование КАК Наименование,
		|	ВЫРАЗИТЬ(Номенклатура.Цвет.РусскоеНаименование КАК СТРОКА(100)) КАК РусскоеНаименование
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В ИЕРАРХИИ(&ТекНом)
//		|	И Номенклатура.СнятСПроизводства = ложь
		|	И Номенклатура.ЭтоГруппа = ЛОЖЬ";
		
		
	Иначе
		// новый для сложных бюстов, где все в одной папке и размеры и цвета. там берем для купальников и бюстов цвет из цветаИМ.
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА Номенклатура.Родитель.ТипТовараДляСайта = &бюсты ИЛИ Номенклатура.Родитель.ТипТовараДляСайта = &купальн
		|			ТОГДА ВЫБОР
		|					КОГДА Номенклатура.ЦветИМ.Наименование <> """"
		|						ТОГДА Номенклатура.ЦветИМ.Наименование
		|					ИНАЧЕ Номенклатура.Цвет.Наименование
		|				КОНЕЦ
		|		ИНАЧЕ Номенклатура.Цвет.Наименование
		|	КОНЕЦ КАК Наименование,
		|	ВЫБОР
		|		КОГДА Номенклатура.Родитель.ТипТовараДляСайта = &бюсты
		|				ИЛИ Номенклатура.Родитель.ТипТовараДляСайта = &купальн
		|			ТОГДА ВЫБОР
		|					КОГДА Номенклатура.ЦветИМ.Код <> """"
		|						ТОГДА Номенклатура.ЦветИМ.Код
		|					ИНАЧЕ Номенклатура.Цвет.Код
		|				КОНЕЦ
		|		ИНАЧЕ Номенклатура.Цвет.Код
		|	КОНЕЦ КАК код,
		|	ВЫБОР
		|		КОГДА Номенклатура.Родитель.ТипТовараДляСайта = &бюсты
		|				ИЛИ Номенклатура.Родитель.ТипТовараДляСайта = &купальн
		|			ТОГДА ВЫБОР
		|					КОГДА Номенклатура.ЦветИМ.Наименование <> """"
		|						ТОГДА Номенклатура.ЦветИМ.Наименование
		|					ИНАЧЕ ВЫРАЗИТЬ(Номенклатура.Цвет.РусскоеНаименование КАК СТРОКА(100))
		|				КОНЕЦ
		|		ИНАЧЕ ВЫРАЗИТЬ(Номенклатура.Цвет.РусскоеНаименование КАК СТРОКА(100))
		|	КОНЕЦ КАК РусскоеНаименование
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В ИЕРАРХИИ(&ТекНом)
//		|	И Номенклатура.СнятСПроизводства = ЛОЖЬ
		|	И Номенклатура.ЭтоГруппа = ЛОЖЬ";
		
	КонецЕсли;
	Запрос.УстановитьПараметр("бюсты",Справочники.ТипыТоваровДляСайта.НайтиПоКоду("000000026"));
	Запрос.УстановитьПараметр("купальн",Справочники.ТипыТоваровДляСайта.НайтиПоКоду("000000011"));
	
	// нечаева 06,07,20--- 
	Запрос.УстановитьПараметр("ТекНом",МассивНом);
	
	ВыборкаБр=Запрос.Выполнить().Выбрать();
	//	ВыборкаБр2=Запрос.Выполнить().Выгрузить();
	//сообщить( ВыборкаБр.Количество());
	
	Пока ВыборкаБР.Следующий() Цикл
		
		ОбъектCML.ЗаписатьНачалоЭлемента("Вариант");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("kcv"+ВыборкаБР.код));
		
		Если СокрЛП(ВыборкаБР.РусскоеНаименование)<>"" Тогда
			НаимЦвета = ""+СокрЛП(ВыборкаБР.РусскоеНаименование)+"("+СокрЛП(ВыборкаБР.Наименование)+")";
		иначе
			НаимЦвета = ""+СокрЛП(ВыборкаБР.Наименование);
		КонецЕсли;
		
		//нечаева 15,06,20 +++
		//Если СокрЛП(ВыборкаБР.РусскоеНаименование)<>"" Тогда
		//	НаимЦвета = ""+СокрЛП(ВыборкаБР.РусскоеНаименование)+"("+СокрЛП(ВыборкаБР.Наименование)+")";
		//иначе
		//	НаимЦвета = ""+СокрЛП(ВыборкаБР.Наименование);
		//КонецЕсли;
		
		// для орхидеи уберем коды чашек из наименования цвета
		
//		НаимЦвета = СтрЗаменить(НаимЦвета," A","");
		//НаимЦвета = СтрЗаменить(НаимЦвета," B","");
		//НаимЦвета = СтрЗаменить(НаимЦвета," C","");
		//НаимЦвета = СтрЗаменить(НаимЦвета," С","");
		//НаимЦвета = СтрЗаменить(НаимЦвета," D","");
		//НаимЦвета = СтрЗаменить(НаимЦвета," E","");
		//НаимЦвета = СтрЗаменить(НаимЦвета," F","");
		//НаимЦвета = СтрЗаменить(НаимЦвета," G","");
		////нечаева 15,06,20 ----
		
		
		ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(НаимЦвета));
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "вариант"
	КонецЦикла;
	
	
	
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "варианты значений"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	
	
	//-----------------------------------------------------------------------------------------------------
	// варианты цвета (красный , синий, белый)
	//15,07,19+++ нечаева
//	Если  мНомерВыгрузки = "026" или мНомерВыгрузки = "028" или мНомерВыгрузки = "029" Тогда
		
		// Код модели в виде справочника, для группировки на стороне битрикса
		ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_Variant_Cveta"));
		ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_Variant_Cveta"));
		ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Вариант цвета"));
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
		ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
		ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Справочник"));
		//// подуровни
		ОбъектCML.ЗаписатьНачалоЭлемента("ВариантыЗначений");
		// код модели в виде справочника, для группировки на стороне битрикса
		
		Запрос=Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Цвета.Код КАК код,
		|	Цвета.Наименование КАК наименование
		|	ИЗ
		|	Справочник.Цвета КАК Цвета
		|	ГДЕ
		|	 Цвета.ЭтоГруппа = истина
		|	И Цвета.ПометкаУдаления = ЛОЖЬ
		|	и Цвета.Наименование ПОДОБНО ""%Цвет колготки%"" ";
		
		//это только для сайта миними , для колготок пока	
		///Запрос.УстановитьПараметр("ТекНом",справочники.Цвета.НайтиПоКоду("22616")); // цвета колготки
		
		ВыборкаБр=Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаБР.Следующий() Цикл
			
			ОбъектCML.ЗаписатьНачалоЭлемента("Вариант");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("vc"+ВыборкаБР.код));
			Наимен324 = Сред(ВыборкаБР.Наименование, 14, СтрДлина(ВыборкаБР.Наименование)-13)  ;
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Наимен324);
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "вариант"
		КонецЦикла;
		
		
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "варианты значений"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
		
		//нечаева 12,12,17---
		
	
	 //-------------------------------------------------------------------------------------------------------------
	 //группа цвета  08,09,21++++ нечаева
	 
	 
	// Код модели в виде справочника, для группировки на стороне битрикса
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_XMLID_Cvet_Gr"));
	ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_XMLID_Cvet_Gr"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("XML_Id Группа Цвета"));
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Справочник"));
	//// подуровни
	ОбъектCML.ЗаписатьНачалоЭлемента("ВариантыЗначений");
	// код модели в виде справочника, для группировки на стороне битрикса
		
		//нечаева 06,07,20 +++  было
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Номенклатура.Цвет.РОдитель.Код КАК Код,
		|	Номенклатура.Цвет.Родитель.Наименование КАК Наименование,
		|	ВЫРАЗИТЬ(Номенклатура.Цвет.Родитель.РусскоеНаименование КАК СТРОКА(100)) КАК РусскоеНаименование
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Родитель.Ссылка В ИЕРАРХИИ(&ТекНом)
	//	|	И Номенклатура.СнятСПроизводства = ложь
		|	И Номенклатура.ЭтоГруппа = ложь";
		
	Запрос.УстановитьПараметр("ТекНом",МассивНом);
	
	ВыборкаБр=Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаБР.Следующий() Цикл
		Если ВыборкаБР.код= null или ВыборкаБР.код= неопределено или ВыборкаБР.код= "" тогда
			
			ОбъектCML.ЗаписатьНачалоЭлемента("Вариант");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("gcv000"));
							
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка("Без группы цвета"));
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "вариант"
		
			продолжить;
		КонецЕсли;	
		ОбъектCML.ЗаписатьНачалоЭлемента("Вариант");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("gcv"+ВыборкаБР.код));
		
		Если СокрЛП(ВыборкаБР.РусскоеНаименование)<>"" Тогда
			НаимЦвета = ""+СокрЛП(ВыборкаБР.РусскоеНаименование)+"("+СокрЛП(ВыборкаБР.Наименование)+")";
		иначе
			НаимЦвета = ""+СокрЛП(ВыборкаБР.Наименование);
		КонецЕсли;
	
		ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(НаимЦвета));
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "вариант"
	КонецЦикла;
	
	                   	
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "варианты значений"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	
	

	
	//нечаева 12,12,17---
	////*************************************************************************************************************
	//                              размер для сайта
	//***************************************************************************************************************
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_RazmDSite"));
	ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_RazmDSite"));
	//ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Размер для сайта"));
	//нечаева 17,08,20   +++
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Размер"));  // Размер для сайта
	// нечаева 17,08,20 ---
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Справочник"));
	// подуровни
	ОбъектCML.ЗаписатьНачалоЭлемента("ВариантыЗначений");
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ  различные
	|	РазмерыЧашки.Код,
	|	РазмерыЧашки.Наименование
	|ИЗ
	|	Справочник.РазмерыЧашки КАК РазмерыЧашки
	|ГДЕ
	|	РазмерыЧашки.ЭтоГруппа = ЛОЖЬ
	|	И РазмерыЧашки.ПометкаУдаления = ЛОЖЬ ";
	
	
	ВыборкаБр=Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаБР.Следующий() Цикл
		
		ОбъектCML.ЗаписатьНачалоЭлемента("Вариант");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("r"+ВыборкаБР.код));
		ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(ВыборкаБР.Наименование));
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "вариант"
		
	КонецЦикла;
	
	// нечаева 12,12,17+++ 
	//Еще сюда же, в значения справочника, запишем данные простых размеров, кроме чашек. Для нового сайта
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Размер.Код КАК Код,
	|	Номенклатура.Размер.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ(&ТекНом)
	|	И Номенклатура.Ссылка.ЭтоГруппа = ЛОЖЬ
//	|	И Номенклатура.СнятСПроизводства = ложь
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	
	Запрос.УстановитьПараметр("ТекНом",МассивНом);
	
	ВыборкаБр=Запрос.Выполнить().Выбрать();
	
	
	Пока ВыборкаБР.Следующий() Цикл
		
		ОбъектCML.ЗаписатьНачалоЭлемента("Вариант");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("r"+ВыборкаБР.код));
		ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(ВыборкаБР.Наименование));
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "вариант"
		
	КонецЦикла;
	
	
	// нечаева 12,12,17---
	
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "варианты значений"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	
	//---------**********************************************************************
	// размер чашки  - a, b, c
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_RazmChaski"));
	ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_RazmChaski"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Размер чашки"));  // Размер для сайта чашки - а,б,с....
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Справочник"));
	// подуровни
	ОбъектCML.ЗаписатьНачалоЭлемента("ВариантыЗначений");
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	Номенклатура.РазмерДляСайта.Родитель КАК Размер22
	             |ИЗ
	             |	Справочник.Номенклатура КАК Номенклатура
	             |ГДЕ
	             |	Номенклатура.Ссылка В ИЕРАРХИИ(&текном)
	             |	И Номенклатура.ПометкаУдаления = ЛОЖЬ
	             |	И Номенклатура.РазмерДляСайта.Родитель <> НЕОПРЕДЕЛЕНО";
	
	Запрос.УстановитьПараметр("ТекНом",МассивНом);
	ВыборкаБр2=Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаБР2.Следующий() Цикл
		
		ОбъектCML.ЗаписатьНачалоЭлемента("Вариант");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("rh"+ВыборкаБР2.Размер22.код));
		ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(ВыборкаБР2.Размер22.Наименование));
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "вариант"
		
	КонецЦикла;

	
	
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "варианты значений"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	

	//******************************************************************************
	
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_KodTovara"));
	ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("Id_KodTovara"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Код товара"));
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Строка"));
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	
	//******************************************************************************
	
	//		
	////******************************************************************************
	//	
	
	
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец раздела "свойства"
	
	//******************************************************************
	//   свойства элементов
	//******************************************************************
	ОбъектCML.ЗаписатьНачалоЭлемента("СвойстваЭлементов");
	
	//--------------------------
	
	////******************************************************************************
	//ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	//ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("COLOR"));
	//ЗаписатьТекстовойУзел(ОбъектCML, "УмныйФильтр",Строка("true"));
	//ЗаписатьТекстовойУзел(ОбъектCML, "ТипОтображения",Строка("F"));
	//ЗаписатьТекстовойУзел(ОбъектCML, "ПоказатьРазвернутым",Строка("true"));
	//ЗаписатьТекстовойУзел(ОбъектCML, "БитриксСвязанныйИнфоблок",Строка("Id_TorgKat"));
	//ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	//
	////******************************************************************************
	//ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	//ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("SIZE"));
	//ЗаписатьТекстовойУзел(ОбъектCML, "УмныйФильтр",Строка("true"));
	//ЗаписатьТекстовойУзел(ОбъектCML, "ТипОтображения",Строка("F"));
	//ЗаписатьТекстовойУзел(ОбъектCML, "ПоказатьРазвернутым",Строка("true"));
	//ЗаписатьТекстовойУзел(ОбъектCML, "БитриксСвязанныйИнфоблок",Строка("Id_TorgKat"));
	//ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	//
	
	//******************************************************************************
	ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("CML2_LINK"));
	ЗаписатьТекстовойУзел(ОбъектCML, "УмныйФильтр",Строка("false"));
	ЗаписатьТекстовойУзел(ОбъектCML, "ТипОтображения",Строка("F"));
	ЗаписатьТекстовойУзел(ОбъектCML, "ПоказатьРазвернутым",Строка("false"));
	ЗаписатьТекстовойУзел(ОбъектCML, "БитриксСвязанныйИнфоблок",Строка("Id_TorgKat"));
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	
	////******************************************************************************
	////	
	////ОбъектCML.ЗаписатьНачалоЭлемента("Свойство");
	////ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("CML2_CODE"));
	////ЗаписатьТекстовойУзел(ОбъектCML, "БитриксКод",Строка("CML2_CODE"));
	////ЗаписатьТекстовойУзел(ОбъектCML, "Наименование",Строка("Элемент каталога"));
	////ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЗначений");
	////ОбъектCML.ЗаписатьНачалоЭлемента("ТипЗначений");
	////ЗаписатьТекстовойУзел(ОбъектCML, "Тип",Строка("Строка"));
	////ОбъектCML.ЗаписатьКонецЭлемента(); // конец "тип знач"
	////ОбъектCML.ЗаписатьКонецЭлемента(); // конец "типы знач"
	//   //ОбъектCML.ЗаписатьКонецЭлемента(); // конец "свойство"
	//
	
	//
	////------------------------
	//
	ОбъектCML.ЗаписатьКонецЭлемента(); // конец раздела "свойства элементов"
	////*****************************************************************
	
	
	
	
	
	ОбъектCML.ЗаписатьКонецЭлемента();// конец классификатора
	//-----------------------------------------------------------------------
	//-----------------------------------------------------------------------
	//-----------------------------------------------------------------------
	//-----------------------------------------------------------------------
	//-----------------------------------------------------------------------
	//-----------------------------------------------------------------------
	//-----------------------------------------------------------------------
	//-----------------------------------------------------------------------
	//-----------------------------------------------------------------------
	//-----------------------------------------------------------------------
	
	
	
	
	
	
	
	ОбъектCML.ЗаписатьНачалоЭлемента("ПакетПредложений");
	ОбъектCML.ЗаписатьАтрибут("СодержитТолькоИзменения","true");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка("Id_Klassificator"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", ФорматНаименованияДляCML("Пакет предложений (новый СТИЛЬПАРК)"));
	ЗаписатьТекстовойУзел(ОбъектCML, "ИдКаталога", Строка("Id_TorgKat"));
	ЗаписатьТекстовойУзел(ОбъектCML, "ИдКлассификатора", Строка("Id_Klassificator"));
	
	//---------------------------------------------------------
	//ОбъектCML.ЗаписатьНачалоЭлемента("Владелец");
	
	//ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка("Id_Vladelec"));
	//ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", ФорматНаименованияДляCML("СТИЛЬПАРК"));
	//ЗаписатьТекстовойУзел(ОбъектCML, "ПолноеНаименование", ФорматНаименованияДляCML("СТИЛЬПАРК"));
	//ОбъектCML.ЗаписатьКонецЭлемента();
	//----------
	ОбъектCML.ЗаписатьНачалоЭлемента("БитриксКод");
	ОбъектCML.ЗаписатьКонецЭлемента();
	//-----------
	ОбъектCML.ЗаписатьНачалоЭлемента("БитриксСортировка");
	ОбъектCML.ЗаписатьТекст(Строка("500"));
	ОбъектCML.ЗаписатьКонецЭлемента();
	//-----------
	
	ОбъектCML.ЗаписатьНачалоЭлемента("БитриксURLСписок");
	ОбъектCML.ЗаписатьТекст(Строка("#SITE_DIR#/catalogtest/index.php?ID=#IBLOCK_ID#"));
	ОбъектCML.ЗаписатьКонецЭлемента();
	//-----------
	
	ОбъектCML.ЗаписатьНачалоЭлемента("БитриксКод");
	ОбъектCML.ЗаписатьТекст(Строка("#SITE_DIR#/catalogtest/#SECTION_CODE_PATH#/ELEMENT_CODE#"));	
	ОбъектCML.ЗаписатьКонецЭлемента();
	//-----------
	
	//	<БитриксURLДеталь>#SITE_DIR#/catalogtest/#SECTION_CODE_PATH#/ELEMENT_CODE#/</БитриксURLДеталь>
	
	//<БитриксURLРаздел>#SITE_DIR#/catalogtest/#SECTION_CODE_PATH#/</БитриксURLРаздел>
	
	//<БитриксURLКанонический/>
	
	//<БитриксКартинка/>
	
	//<БитриксИндексироватьЭлементы>true</БитриксИндексироватьЭлементы>
	
	//<БитриксИндексироватьРазделы>true</БитриксИндексироватьРазделы>
	
	//<БитриксДокументооборот>false</БитриксДокументооборот>
	
	
	//-<БитриксПодписи>
	
	
	//-<БитриксПодпись>
	
	//<Ид>ELEMENT_NAME</Ид>
	
	//<Значение>Элемент</Значение>
	
	//</БитриксПодпись>
	
	
	//-<БитриксПодпись>
	
	//<Ид>ELEMENTS_NAME</Ид>
	
	//<Значение>Элементы</Значение>
	
	//</БитриксПодпись>
	
	
	//-<БитриксПодпись>
	
	//<Ид>ELEMENT_ADD</Ид>
	
	//<Значение>Добавить элемент</Значение>
	
	//</БитриксПодпись>
	
	
	//-<БитриксПодпись>
	
	//<Ид>ELEMENT_EDIT</Ид>
	
	//<Значение>Изменить элемент</Значение>
	
	//</БитриксПодпись>
	
	
	//-<БитриксПодпись>
	
	//<Ид>ELEMENT_DELETE</Ид>
	
	//<Значение>Удалить элемент</Значение>
	
	//</БитриксПодпись>
	
	
	//-<БитриксПодпись>
	
	//<Ид>SECTION_NAME</Ид>
	
	//<Значение>Раздел</Значение>
	
	//</БитриксПодпись>
	
	
	//-<БитриксПодпись>
	
	//<Ид>SECTIONS_NAME</Ид>
	
	//<Значение>Разделы</Значение>
	
	//</БитриксПодпись>
	
	
	//-<БитриксПодпись>
	
	//<Ид>SECTION_ADD</Ид>
	
	//<Значение>Добавить раздел</Значение>
	
	//</БитриксПодпись>
	
	
	//-<БитриксПодпись>
	
	//<Ид>SECTION_EDIT</Ид>
	
	//<Значение>Изменить раздел</Значение>
	
	//</БитриксПодпись>
	
	
	//-<БитриксПодпись>
	
	//<Ид>SECTION_DELETE</Ид>
	
	//<Значение>Удалить раздел</Значение>
	
	//</БитриксПодпись>
	
	//</БитриксПодписи>
	//	
	//	
	
	
	
	
	
	
	
	//
	//ТипЦен1=Справочники.ТипыЦен.НайтиПоКоду("SSP-0301"); // частное лицо
	//ТипЦен2=Справочники.ТипыЦен.НайтиПоКоду("SNL-0393"); //  сале - частное лицо
	
	#Если Клиент Тогда
		Состояние("Заполнение типов цен...");
	#КонецЕсли
	
	ТипЦен1=Справочники.ТипыЦен.НайтиПоКоду("SNL-0229"); //обцл
	ТипЦен2=Справочники.ТипыЦен.НайтиПоКоду("SSP-0314");  // сейл опт отповая розница
	ТипЦен3=Справочники.ТипыЦен.НайтиПоКоду("SNL-0584");  // SALE ТР (точечная розница))


	
	
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипыЦен");
	
	//--1------------------------------------------------------------
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЦен");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка(ТипЦен1.код));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", Строка(ТипЦен1.наименование));
	ЗаписатьТекстовойУзел(ОбъектCML, "Валюта", Строка("RUB"));
	
	ОбъектCML.ЗаписатьНачалоЭлемента("Налог");
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", Строка("НДС"));
	ЗаписатьТекстовойУзел(ОбъектCML, "УчтеноВСумме", Строка("true"));
	ОбъектCML.ЗаписатьКонецЭлемента(); // налог
	
	ОбъектCML.ЗаписатьКонецЭлемента(); // тип цен
	//--------------------------------------------------------------
	//--2------------------------------------------------------------
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЦен");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка(ТипЦен2.код));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", Строка(ТипЦен2.наименование));
	ЗаписатьТекстовойУзел(ОбъектCML, "Валюта", Строка("RUB"));
	
	ОбъектCML.ЗаписатьНачалоЭлемента("Налог");
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", Строка("НДС"));
	ЗаписатьТекстовойУзел(ОбъектCML, "УчтеноВСумме", Строка("true"));
	ОбъектCML.ЗаписатьКонецЭлемента(); // налог
	
	ОбъектCML.ЗаписатьКонецЭлемента(); // тип цен
	//---------------------------------------------------------------
	
	ОбъектCML.ЗаписатьНачалоЭлемента("ТипЦен");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка(ТипЦен3.код));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", Строка(ТипЦен3.наименование));
	ЗаписатьТекстовойУзел(ОбъектCML, "Валюта", Строка("RUB"));
	
	ОбъектCML.ЗаписатьНачалоЭлемента("Налог");
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", Строка("НДС"));
	ЗаписатьТекстовойУзел(ОбъектCML, "УчтеноВСумме", Строка("true"));
	ОбъектCML.ЗаписатьКонецЭлемента(); // налог
	
	ОбъектCML.ЗаписатьКонецЭлемента(); // тип цен

	
	
	
	//--------------------------------------------------------------
	ОбъектCML.ЗаписатьКонецЭлемента(); // типы цен
	
	
	
	
	//-----------------------------------------------------------------------------------------
	//   Заполнение цен на товары
	//-----------------------------------------------------------------------------------------
	#Если Клиент Тогда
		Состояние("Заполнение цен на товары...");
	#КонецЕсли
	
	
	Массив1=Новый массив;
	// ТЦ Семеновский
	Массив1.Добавить(Справочники.Склады.НайтиПоКоду("SSP-22"));
	
	// выбираем всю номенклатуру по остаткам и с нулевыми остатками тоже выгружаем!!!!
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Модель,
	             |	ЦеныНоменклатурыСрезПоследних.ТипЦен КАК ТипЦен,
	             |	ЦеныНоменклатурыСрезПоследних.Прайс.Дата КАК ДатаПрайса,
	             |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	             |ПОМЕСТИТЬ Цены
	             |ИЗ
	             |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	             |			&Дата2 {(&Дата2)},
	             |			Прайс.Проведен
	             |				И Прайс.Дата2 >= &Дата2 {(ТипЦен).*}) КАК ЦеныНоменклатурыСрезПоследних
	             |ГДЕ
	             |	ЦеныНоменклатурыСрезПоследних.ТипЦен = &Тектипцен1
	             |
	             |ИНДЕКСИРОВАТЬ ПО
	             |	Модель,
	             |	ТипЦен
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	МАКСИМУМ(Цены.ДатаПрайса) КАК ДатаПрайса,
	             |	Цены.Модель КАК Модель,
	             |	Цены.ТипЦен КАК ТипЦен
	             |ПОМЕСТИТЬ Прайсы
	             |ИЗ
	             |	Цены КАК Цены
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	Цены.ТипЦен,
	             |	Цены.Модель
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Модель,
	             |	ЦеныНоменклатурыСрезПоследних.ТипЦен КАК ТипЦен,
	             |	ЦеныНоменклатурыСрезПоследних.Прайс.Дата КАК ДатаПрайса,
	             |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	             |ПОМЕСТИТЬ Цены2
	             |ИЗ
	             |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	             |			&Дата2 {(&Дата2)},
	             |			Прайс.Проведен
	             |				И Прайс.Дата2 >= &Дата2 {(ТипЦен).*}) КАК ЦеныНоменклатурыСрезПоследних
	             |ГДЕ
	             |	ЦеныНоменклатурыСрезПоследних.ТипЦен = &Тектипцен2
	             |
	             |ИНДЕКСИРОВАТЬ ПО
	             |	Модель,
	             |	ТипЦен
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	МАКСИМУМ(Цены2.ДатаПрайса) КАК ДатаПрайса,
	             |	Цены2.Модель КАК Модель,
	             |	Цены2.ТипЦен КАК ТипЦен
	             |ПОМЕСТИТЬ Прайсы2
	             |ИЗ
	             |	Цены2 КАК Цены2
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	Цены2.ТипЦен,
	             |	Цены2.Модель
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Модель,
	             |	ЦеныНоменклатурыСрезПоследних.ТипЦен КАК ТипЦен,
	             |	ЦеныНоменклатурыСрезПоследних.Прайс.Дата КАК ДатаПрайса,
	             |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	             |ПОМЕСТИТЬ Цены3
	             |ИЗ
	             |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	             |			&Дата2 {(&Дата2)},
	             |			Прайс.Проведен
	             |				И Прайс.Дата2 >= &Дата2 {(ТипЦен).*}) КАК ЦеныНоменклатурыСрезПоследних
	             |ГДЕ
	             |	ЦеныНоменклатурыСрезПоследних.ТипЦен = &Тектипцен3
	             |
	             |ИНДЕКСИРОВАТЬ ПО
	             |	Модель,
	             |	ТипЦен
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	МАКСИМУМ(Цены3.ДатаПрайса) КАК ДатаПрайса,
	             |	Цены3.Модель КАК Модель,
	             |	Цены3.ТипЦен КАК ТипЦен
	             |ПОМЕСТИТЬ Прайсы3
	             |ИЗ
	             |	Цены3 КАК Цены3
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	Цены3.ТипЦен,
	             |	Цены3.Модель
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	Прайсы.Модель КАК Модель,
	             |	Прайсы.ТипЦен КАК ТипЦен,
	             |	Цены.Цена КАК Цена1
	             |ПОМЕСТИТЬ ИтогоЦены1
	             |ИЗ
	             |	Прайсы КАК Прайсы
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Цены КАК Цены
	             |		ПО (Цены.Модель = Прайсы.Модель)
	             |			И (Цены.ТипЦен = Прайсы.ТипЦен)
	             |			И (Цены.ДатаПрайса = Прайсы.ДатаПрайса)
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	Прайсы2.Модель КАК Модель,
	             |	Прайсы2.ТипЦен КАК ТипЦен,
	             |	Цены2.Цена КАК Цена2
	             |ПОМЕСТИТЬ ИтогоЦены2
	             |ИЗ
	             |	Прайсы2 КАК Прайсы2
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Цены2 КАК Цены2
	             |		ПО (Цены2.Модель = Прайсы2.Модель)
	             |			И (Цены2.ТипЦен = Прайсы2.ТипЦен)
	             |			И (Цены2.ДатаПрайса = Прайсы2.ДатаПрайса)
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	Прайсы3.Модель КАК Модель,
	             |	Прайсы3.ТипЦен КАК ТипЦен,
	             |	Цены3.Цена КАК Цена3
	             |ПОМЕСТИТЬ ИтогоЦены3
	             |ИЗ
	             |	Прайсы3 КАК Прайсы3
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Цены3 КАК Цены3
	             |		ПО (Цены3.Модель = Прайсы3.Модель)
	             |			И (Цены3.ТипЦен = Прайсы3.ТипЦен)
	             |			И (Цены3.ДатаПрайса = Прайсы3.ДатаПрайса)
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	Ном.Наименование КАК наименование,
	             |	Ном.Родитель КАК Группа,
	             |	Ном.Ссылка КАК Ссылка,
	             |	ИтогоЦены1.Цена1 КАК Цена1,
	             |	ИтогоЦены2.Цена2 КАК Цена2,
	             |	ИтогоЦены3.Цена3 КАК Цена3,
	             |	1 КАК Ост,
	             |	0 КАК Рез,
	             |	1 КАК КолФакт,
	             |	Ном.Цвет КАК Цвет,
	             |	Ном.Размер КАК Размер,
	             |	Ном.РазмерДляСайта КАК РазмерДляСайта,
	             |	ВЫБОР
	             |		КОГДА Ном.Родитель.ТипТовараДляСайта = &бюсты
	             |				ИЛИ Ном.Родитель.ТипТовараДляСайта = &купальн
	             |			ТОГДА ВЫБОР
	             |					КОГДА Ном.ЦветИМ.Код <> """"
	             |						ТОГДА Ном.ЦветИМ.Код
	             |					ИНАЧЕ Ном.Цвет.Код
	             |				КОНЕЦ
	             |		ИНАЧЕ Ном.Цвет.Код
	             |	КОНЕЦ КАК кодЦвета
	             |ИЗ
	             |	Справочник.Номенклатура КАК Ном
	             |		ЛЕВОЕ СОЕДИНЕНИЕ ИтогоЦены2 КАК ИтогоЦены2
	             |		ПО (ИтогоЦены2.Модель = Ном.Родитель)
	             |		ЛЕВОЕ СОЕДИНЕНИЕ ИтогоЦены1 КАК ИтогоЦены1
	             |		ПО (ИтогоЦены1.Модель = Ном.Родитель)
	             |		ЛЕВОЕ СОЕДИНЕНИЕ ИтогоЦены3 КАК ИтогоЦены3
	             |		ПО (ИтогоЦены3.Модель = Ном.Родитель)
	             |ГДЕ
	             |	Ном.Ссылка В ИЕРАРХИИ(&ТекНом)
	             |	И НЕ Ном.ЭтоГруппа
	             |	И ВЫБОР
	             |			КОГДА Ном.Ссылка.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |				ТОГДА ""Да""
	             |			КОГДА Ном.Ссылка.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |				ТОГДА ""Нет""
	             |			ИНАЧЕ ВЫБОР
	             |					КОГДА Ном.Ссылка.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |						ТОГДА ""Да""
	             |					КОГДА Ном.Ссылка.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |						ТОГДА ""Нет""
	             |					ИНАЧЕ ВЫБОР
	             |							КОГДА Ном.Ссылка.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |								ТОГДА ""Да""
	             |							КОГДА Ном.Ссылка.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |								ТОГДА ""Нет""
	             |							ИНАЧЕ ВЫБОР
	             |									КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |										ТОГДА ""Да""
	             |									КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |										ТОГДА ""Нет""
	             |									ИНАЧЕ ВЫБОР
	             |											КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |												ТОГДА ""Да""
	             |											КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |												ТОГДА ""Нет""
	             |											ИНАЧЕ ""Нет""
	             |										КОНЕЦ
	             |								КОНЕЦ
	             |						КОНЕЦ
	             |				КОНЕЦ
	             |		КОНЕЦ = ""Да""
	             |
	             |ОБЪЕДИНИТЬ ВСЕ
	             |
	             |ВЫБРАТЬ
	             |	Ном.Наименование,
	             |	Ном.Родитель,
	             |	Ном.Ссылка,
	             |	ИтогоЦены1.Цена1,
	             |	ИтогоЦены2.Цена2,
	             |	ИтогоЦены3.Цена3,
	             |	0,
	             |	0,
	             |	0,
	             |	Ном.Цвет,
	             |	Ном.Размер,
	             |	Ном.РазмерДляСайта,
	             |	ВЫБОР
	             |		КОГДА Ном.Родитель.ТипТовараДляСайта = &бюсты
	             |				ИЛИ Ном.Родитель.ТипТовараДляСайта = &купальн
	             |			ТОГДА ВЫБОР
	             |					КОГДА Ном.ЦветИМ.Код <> """"
	             |						ТОГДА Ном.ЦветИМ.Код
	             |					ИНАЧЕ Ном.Цвет.Код
	             |				КОНЕЦ
	             |		ИНАЧЕ Ном.Цвет.Код
	             |	КОНЕЦ
	             |ИЗ
	             |	Справочник.Номенклатура КАК Ном
	             |		ЛЕВОЕ СОЕДИНЕНИЕ ИтогоЦены2 КАК ИтогоЦены2
	             |		ПО (ИтогоЦены2.Модель = Ном.Родитель)
	             |		ЛЕВОЕ СОЕДИНЕНИЕ ИтогоЦены1 КАК ИтогоЦены1
	             |		ПО (ИтогоЦены1.Модель = Ном.Родитель)
	             |		ЛЕВОЕ СОЕДИНЕНИЕ ИтогоЦены3 КАК ИтогоЦены3
	             |		ПО (ИтогоЦены3.Модель = Ном.Родитель)
	             |ГДЕ
	             |	Ном.Ссылка В ИЕРАРХИИ(&ТекНом)
	             |	И НЕ Ном.ЭтоГруппа
	             |	И ВЫБОР
	             |			КОГДА Ном.Ссылка.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |				ТОГДА ""Да""
	             |			КОГДА Ном.Ссылка.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |				ТОГДА ""Нет""
	             |			ИНАЧЕ ВЫБОР
	             |					КОГДА Ном.Ссылка.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |						ТОГДА ""Да""
	             |					КОГДА Ном.Ссылка.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |						ТОГДА ""Нет""
	             |					ИНАЧЕ ВЫБОР
	             |							КОГДА Ном.Ссылка.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |								ТОГДА ""Да""
	             |							КОГДА Ном.Ссылка.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |								ТОГДА ""Нет""
	             |							ИНАЧЕ ВЫБОР
	             |									КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |										ТОГДА ""Да""
	             |									КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |										ТОГДА ""Нет""
	             |									ИНАЧЕ ВЫБОР
	             |											КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |												ТОГДА ""Да""
	             |											КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |												ТОГДА ""Нет""
	             |											ИНАЧЕ ""Нет""
	             |										КОНЕЦ
	             |								КОНЕЦ
	             |						КОНЕЦ
	             |				КОНЕЦ
	             |		КОНЕЦ = ""Нет""";
	//Катаев- 28/13/13
	
	
	
	//	Запрос = новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//               |	ВЫБОР
	//               |		КОГДА Номенклатура.Родитель.ТипТовараДляСайта = &бюсты
	//               |			ТОГДА ВЫБОР
	//               |					КОГДА Номенклатура.ЦветИМ.Наименование <> """"
	//               |						ТОГДА Номенклатура.ЦветИМ.Наименование
	//               |					ИНАЧЕ Номенклатура.Цвет.Наименование
	//               |				КОНЕЦ
	//               |		ИНАЧЕ Номенклатура.Цвет.Наименование
	//               |	КОНЕЦ КАК Наименование,
	//               |	ВЫБОР
	//               |		КОГДА Номенклатура.Родитель.ТипТовараДляСайта = &бюсты
	//               |				ИЛИ Номенклатура.Родитель.ТипТовараДляСайта = &купальн
	//               |			ТОГДА ВЫБОР
	//               |					КОГДА Номенклатура.ЦветИМ.Код <> """"
	//               |						ТОГДА Номенклатура.ЦветИМ.Код
	//               |					ИНАЧЕ Номенклатура.Цвет.Код
	//               |				КОНЕЦ
	//               |		ИНАЧЕ Номенклатура.Цвет.Код
	//               |	КОНЕЦ КАК код,
	//               |	ВЫБОР
	//               |		КОГДА Номенклатура.Родитель.ТипТовараДляСайта = &бюсты
	//               |				ИЛИ Номенклатура.Родитель.ТипТовараДляСайта = &купальн
	//               |			ТОГДА ВЫБОР
	//               |					КОГДА Номенклатура.ЦветИМ.Наименование <> """"
	//               |						ТОГДА Номенклатура.ЦветИМ.Наименование
	//               |					ИНАЧЕ ВЫРАЗИТЬ(Номенклатура.Цвет.РусскоеНаименование КАК СТРОКА(100))
	//               |				КОНЕЦ
	//               |		ИНАЧЕ ВЫРАЗИТЬ(Номенклатура.Цвет.РусскоеНаименование КАК СТРОКА(100))
	//               |	КОНЕЦ КАК РусскоеНаименование
	//               |ИЗ
	//               |	Справочник.Номенклатура КАК Номенклатура
	//               |ГДЕ
	//               |	Номенклатура.Ссылка В ИЕРАРХИИ(&ТекНом)
	//               |	И Номенклатура.СнятСПроизводства = ЛОЖЬ
	//               |	И Номенклатура.ЭтоГруппа = ЛОЖЬ";
	//
	//
	//Запрос.УстановитьПараметр("бюсты",Справочники.ТипыТоваровДляСайта.НайтиПоКоду("000000026"));
	//Запрос.УстановитьПараметр("купальн",Справочники.ТипыТоваровДляСайта.НайтиПоКоду("000000011"));
	//
	//// нечаева 06,07,20--- 
	//Запрос.УстановитьПараметр("ТекНом",МассивНом);
	//
	//ВыборкаБр=Запрос.Выполнить().Выбрать();
	//
	//Пока ВыборкаБР.Следующий() Цикл
	
	
	
	
	
	Запрос.УстановитьПараметр("бюсты",Справочники.ТипыТоваровДляСайта.НайтиПоКоду("000000026"));
	Запрос.УстановитьПараметр("купальн",Справочники.ТипыТоваровДляСайта.НайтиПоКоду("000000011"));
	
	
	Запрос.УстановитьПараметр("ТекСклад",Массив1);
	Запрос.УстановитьПараметр("ТекТипЦен1",Типцен1);
	Запрос.УстановитьПараметр("ТекТипЦен2",Типцен2);
	Запрос.УстановитьПараметр("ТекТипЦен3",Типцен3);
	Запрос.УстановитьПараметр("ТекНом",Группы);
	Запрос.УстановитьПараметр("Дата2",ТекущаяДата());
	
	//Рез=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Группа");
	Рез=Запрос.Выполнить().Выбрать();
	#Если Клиент Тогда
		Сообщить(" Количество выгружаемого товара - "+Рез.Количество());	
	#КонецЕсли
	
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++	
	ОбъектCML.ЗаписатьНачалоЭлемента("Предложения");
	
	
	
	
	//ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", Строка("НДС"));
	//ЗаписатьТекстовойУзел(ОбъектCML, "УчтеноВСумме", Строка("true"));
	//ОбъектCML.ЗаписатьКонецЭлемента(); // налог
	
	ТипСкидок = справочники.ТипыСкидок.НайтиПоКоду("SNL-0008");  //sale ниже некуда
	ТипЦен = справочники.ТипыЦен.НайтиПоКоду("SSP-0301");  //частное лицо
	
	
	Пока Рез.Следующий() Цикл
		//нечаева 31,10,18+++
		//Если РЕз.Ссылка.СнятСПроизводства = истина ТОгда
		//	продолжить;
		//КонецЕсли;	
		//нечаева 31,10,18---
		Выборка = Рез;
		Цена1=0;
		Цена2=0;
		#Если Клиент Тогда
			ОбработкаПрерыванияПользователя();
			Состояние("Обработка: "+Рез.Группа);			
		#КонецЕсли	
		ОбъектCML.ЗаписатьНачалоЭлемента("Предложение");
		
		//	Скидка=ПолучитьСкидкуНоменклатуры(ТекСтр.Модель,ТипСкидок,Дата,ТипЦен);
		
		Скидка = ПолучитьСкидкуНоменклатуры(Рез.Ссылка.Родитель,ТипСкидок,ТекущаяДата(),ТипЦен);
		
		
		ЦенаСоСкидкой=0;
		Попытка
			Если Скидка>0 и не (Рез.Цена1=Неопределено ИЛИ Рез.Цена1=Null) Тогда
				
				ЦенаСоСкидкой=Рез.Цена1-Рез.Цена1*Скидка/100;
				
			КонецЕсли;	
		Исключение
		конецПопытки;
		
		
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка(""+Рез.Ссылка.родитель.код+"#"+Рез.Ссылка.код)); //юкод  Строка(Выборка.ссылка.уникальныйИдентификатор())
		ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", Строка(Рез.Ссылка.Наименование));
		//----
		ОбъектCML.ЗаписатьНачалоЭлемента("БитриксТеги");
		ОбъектCML.ЗаписатьКонецЭлемента();
		//-----
		//ОбъектCML.ЗаписатьНачалоЭлемента("Группы");
		//ОбъектCML.ЗаписатьКонецЭлемента();
		
		Если Выборка.Группа.ТипТовараДляСайта.пустая() Тогда
			ТипТовараДляСайта=ПолучитьРеквизитРодителя(Выборка.Группа,"ТипТовараДляСайта");
		Иначе
			ТипТовараДляСайта=Выборка.Группа.ТипТовараДляСайта;
		КонецЕсли;
		
		//Если Выборка.Ссылка.ПодТипыНоменклатурыДляСайта.количество()>0 Тогда
		//	
		//	ОбъектCML.ЗаписатьНачалоЭлемента("Группы");
		//	Для каждого ТекСтрока из Выборка.Ссылка.ПодТипыНоменклатурыДляСайта Цикл
		//		//ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("gr"+ТекСтрока.ПодТИпТовараДляСайта.Код));
		//		Для каждого ТекСтрока из Выборка.Ссылка.ПодТипыНоменклатурыДляСайта Цикл
		//			
		//			//нечаева 02,10,19+++
		//			Если мНомерВыгрузки = "026" или мНомерВыгрузки = "028" или мНомерВыгрузки = "029" Тогда
		//				
		//				Если СокрЛП(ТекСтрока.ПодТИпТовараДляСайта.ТипТовараДляСайтаМиними.Код)<>"" Тогда
		//					ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("gr"+ТекСтрока.ПодТИпТовараДляСайта.ТипТовараДляСайтаМиними.Код));
		//				иначе
		//					ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("gr"+ТекСтрока.ПодТИпТовараДляСайта.Код));
		//				КонецЕсли;
		//				
		//			иначе
		//				ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("gr"+ТекСтрока.ПодТИпТовараДляСайта.Код));
		//			КонецЕсли;
		//			//нечаева 02,10,19---
		//		КонецЦикла;
		//		
		//	КонецЦикла;
		//	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "группы"
		//	
		//иначеЕсли Выборка.Ссылка.Родитель.ПодТипыНоменклатурыДляСайта.количество()>0 Тогда
		//	
		//	ОбъектCML.ЗаписатьНачалоЭлемента("Группы");
		//	Для каждого ТекСтрока из Выборка.Ссылка.Родитель.ПодТипыНоменклатурыДляСайта Цикл
		//		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("gr"+ТекСтрока.ПодТИпТовараДляСайта.Код));
		//	КонецЦикла;
		//	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "группы"
		//	
		//иначеЕсли Выборка.Ссылка.Родитель.Родитель.ПодТипыНоменклатурыДляСайта.количество()>0 Тогда		
		//	
		//	ОбъектCML.ЗаписатьНачалоЭлемента("Группы");
		//	Для каждого ТекСтрока из Выборка.Ссылка.Родитель.Родитель.Родитель.ПодТипыНоменклатурыДляСайта Цикл
		//		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("gr"+ТекСтрока.ПодТИпТовараДляСайта.Код));
		//	КонецЦикла;
		//	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "группы"
		//Иначе
		//	
		//	ОбъектCML.ЗаписатьНачалоЭлемента("Группы");
		//	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("gr"+ТипТовараДляСайта.Код));
		//	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "группы"
		//	
		//КонецЕсли;
		//
		
		
		
		ОбъектCML.ЗаписатьНачалоЭлемента("Группы");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("gr"+Рез.Ссылка.родитель.код));
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "группы"
		
		
		
		//-----
		ОбъектCML.ЗаписатьНачалоЭлемента("Картинка");
		ОбъектCML.ЗаписатьКонецЭлемента();
		//-----
		
			
		
		
		// Нечаева 20,12,17+++ тут еще цвет размер, 
		///-------------------------------------------------------------------------------------------------------------------------------
		///    свойства товара
		///-------------------------------------------------------------------------------------------------------------------------------
		
		ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойств");
		
		//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
		//   подгруппы свойств
		//------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
		
		ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("CML2_ACTIVE"));
		ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка("true"));
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
		
		
		//******************************************************************************
		ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_XMLID_Kod_Modeli"));
		ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка("km"+Выборка.ссылка.родитель.Код)); //код модели
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
		
		//**************************************************************	
		//Id_Shtrixkod
		//нечаева 26,10,20+++
		Если  мНомерВыгрузки = "026" или мНомерВыгрузки = "028" или мНомерВыгрузки = "029"  Тогда
			//нечаева 26,10,20--
			Запрос = новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ШтрихКоды.Наименование КАК Наименование
			|ИЗ
			|	Справочник.ШтрихКоды КАК ШтрихКоды
			|ГДЕ
			|	ШтрихКоды.Владелец = &текНом
			|	И ШтрихКоды.ТипШК = &типшк
			|	И ШтрихКоды.ВидШК = &видшк";
			Запрос.УстановитьПараметр("ТекНом",Рез.Ссылка);
			Запрос.УстановитьПараметр("ТипШК",перечисления.ТипыШтрихКодов.Штука);
			Запрос.УстановитьПараметр("ВидШК",перечисления.ВидыШК.Основной);
			ШК = Запрос.Выполнить().Выбрать();
			ШкМ = "";
			Если ШК.Следующий() тогда
				Шкм = шк.наименование;
			КонецЕсли;	
			
			ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_Shtrixkod"));
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(Шкм)); //штрихкод
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
		КонецЕсли;
		
		
		//******************************************************************************
		
		//Id_KodModeli
		
		
		ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_KodModeli"));
		ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(Выборка.ссылка.родитель.код));
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
		//*************************************************************************
		
		ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_KodCveta"));
		// нечаева 06,07,20+++
		Если НЕ ВыгружатьЦветаИМ ТОгда
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(Выборка.Цвет.код));
		иначе
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(Выборка.кодЦвета));
		КонецЕсли;
		//нечаева 06,07,20---
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
		
		
		//Id_Variant_Cveta"
		//*************************************************************************
		// нечаева 15,07,19++		
	//		Если  мНомерВыгрузки = "026" или мНомерВыгрузки = "028" или мНомерВыгрузки = "029" Тогда
			
			ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_Variant_Cveta"));
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка("vc"+Выборка.Цвет.Родитель.код));
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
		//	КонецЕсли;
		// нечаева 15,07,19----
		//*********************************************************************************************************
		// группа цвета 
		
		
		Если ВыборкаБР.код= null или ВыборкаБР.код= неопределено или ВыборкаБР.код= "" тогда
			
			ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_XMLID_Cvet_Gr"));
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка("gcv000"));  // без папки цвета, в верхнем каталоге цвет
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
			
		иначе
					
			ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_XMLID_Cvet_Gr"));
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка("gcv"+Выборка.Цвет.Родитель.код));
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
				
		КонецЕсли;	

		
		
		
		//******************************************************************************
		ТипТовараДляСайта  = Рез.Ссылка.Родитель.ТипТовараДляСайта;
		
		//Если ТипТовараДляСайта.код="000000026" Тогда // не бюст
		// нечаева добавили купальники 26.06.20 +++
		Если ТипТовараДляСайта.код="000000026" или ТипТовараДляСайта.код="000000011"  Тогда // не бюст или купальник
			// нечаева добавили купальники 26.06.20 ---
			
			
			ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_RazmDSite"));
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка("r"+Выборка.РазмерДляСайта.код));      
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
		Иначе
			ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_RazmDSite"));
			//нечаева 12,12,17+++ было пусто
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка("r"+Выборка.Размер.код));      
			//нечаева 12,12,17---
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
			
		КонецЕсли;
		
		//******************************************************************************
		
		ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_XMLID_Cvet"));
		//нечаева 06,07,20+++
		Если НЕ ВыгружатьЦветаИМ ТОгда
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка("kcv"+Выборка.Цвет.код));
		Иначе
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка("kcv"+Выборка.КодЦвета));
		КонецЕсли;
		//нечаева 06,07,20---
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
			
	
			
		//******************************************************************************
		Если ТипТовараДляСайта.код="000000026" или ТипТовараДляСайта.код="000000011"  Тогда // не бюст или купальник
			// нечаева добавили купальники 26.06.20 ---
			
			ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
			ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_RazmChaski"));
			ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка("rh"+Выборка.РазмерДляСайта.родитель.код));
			ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
		конецЕсли;		
		
		//******************************************************************************
		
		ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("Id_KodTovara"));
		ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(Выборка.ссылка.Код));
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
		//******************************************************************************
		
		//// цвет размер
		//// нечаева добавили купальники 26.06.20 +++
		//Если ТипТовараДляСайта.код="000000026" или ТипТовараДляСайта.код="000000011"  Тогда // не бюст или купальник
		//	// нечаева добавили купальники 26.06.20 ---
		//	ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
		//	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("SIZE"));
		//	ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(Выборка.РазмерДляСайта.наименование));
		//	ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
		//	ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(Выборка.РазмерДляСайта.наименование));
		//	ЗаписатьТекстовойУзел(ОбъектCML, "Описание","");
		//	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
		//	
		//	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
		//	
		//	
		//	
		//	
		//	
		//иначе
		//	ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
		//	ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("SIZE"));
		//	ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(Выборка.Размер.наименование));
		//	ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
		//	ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(Выборка.Размер.наименование));
		//	ЗаписатьТекстовойУзел(ОбъектCML, "Описание","");
		//	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
		//	
		//	ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
		//конецЕсли;
		//// нечаева добавили купальники 26.06.20 ---
		//
		
		//******************************************************************************
		
		//// цвет 
		//ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
		//ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("COLOR"));
		//
		////нечаева 16,06,20 ++
		//НамЦветаНов= Выборка.Цвет.наименование;
		////Если Рез.ССылка.РОдитель.Родитель.код = "SNL-345850" или Рез.ССылка.РОдитель.код = "SNL-345850" Тогда
		//НамЦветаНов = СтрЗаменить(НамЦветаНов," A","");
		//НамЦветаНов = СтрЗаменить(НамЦветаНов," B","");
		//НамЦветаНов = СтрЗаменить(НамЦветаНов," C","");
		//НамЦветаНов = СтрЗаменить(НамЦветаНов," С","");
		//НамЦветаНов = СтрЗаменить(НамЦветаНов," D","");
		//НамЦветаНов = СтрЗаменить(НамЦветаНов," E","");
		//НамЦветаНов = СтрЗаменить(НамЦветаНов," F","");
		//НамЦветаНов = СтрЗаменить(НамЦветаНов," G","");
		////КонецЕсли;
		//
		////нечаева 16,06,20---
		//
		//ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(НамЦветаНов));
		//ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
		//ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(НамЦветаНов));
		//ЗаписатьТекстовойУзел(ОбъектCML, "Описание","");
		//ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
		//ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
		//
		//******************************************************************************
		
		// код модели, как привязка????
		ЗННН = "23380" ;
		
		//
		//ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
		//ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("CML2_LINK"));
		//ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(ЗННН)); //Выборка.Ссылка.родитель.Наименование
		//	  ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
		//	  ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(ЗННН));
		//	  //-----
		//	  ОбъектCML.ЗаписатьНачалоЭлемента("Описание");
		//	  ОбъектCML.ЗаписатьКонецЭлемента();
		//	  
		//	  //ЗаписатьТекстовойУзел(ОбъектCML, "Описание","");
		//	  ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
		//ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
		
		//CML2_CODE
		//******************************************************************************
		
		//// код модели, как привязка????
		//ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
		//ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("CML2_CODE"));
		
		ННН = Выборка.Ссылка.Наименование;
		ННН = СтрЗаменить(ННН,",","");
		ННН = СтрЗаменить(ННН,".","");
		ННН = СтрЗаменить(ННН,"(","");
		ННН = СтрЗаменить(ННН,")","");
		
		ННН = СтрЗаменить(ННН," ","-");
		
		//******************************************************************************
		
		//
		//ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
		//ЗаписатьТекстовойУзел(ОбъектCML, "Ид",Строка("CML2_CODE"));
		//ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(ННН));
		//ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
		//
		//
		//ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(ННН));
		//	  //ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияСвойства");
		//	  //ЗаписатьТекстовойУзел(ОбъектCML, "Значение",Строка(ННН));
		//	  //ЗаписатьТекстовойУзел(ОбъектCML, "Описание","");
		//	  //ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
		//ОбъектCML.ЗаписатьКонецЭлемента(); // конец "зн св-ва"
		//		
		//
		ОбъектCML.ЗаписатьКонецЭлемента(); // конец раздела " св-в"
		
		// Нечаева 20,12,17---- тут еще цвет размер, 
		
		//----------------------------------------------------------------------------------------------------------------------------
		
		
		//
		////21,05,19 +++ нечаева
		//Если Не мНомерВыгрузки = "026" или мНомерВыгрузки = "028" или мНомерВыгрузки = "029" Тогда
		//	
		//	
		//	ОбъектCML.ЗаписатьНачалоЭлемента("Цены");
		//	Если Рез.Цена1=Неопределено ИЛИ Рез.Цена1=Null Тогда
		//		Цена1=0;
		//	Иначе
		//		Цена1=Рез.Цена1;
		//	КонецЕсли;	
		//	
		//	Если Рез.Цена2=Неопределено ИЛИ Рез.Цена2=Null Тогда
		//		Цена2=0;
		//	Иначе
		//		Цена2=Рез.Цена2;
		//	КонецЕсли;
		//	
		//	
		//	Если Рез.Цена3=Неопределено ИЛИ Рез.Цена3=Null Тогда
		//		Цена3=0;
		//	Иначе
		//		Цена3=Рез.Цена3;
		//	КонецЕсли;

		//	
		//	
		//	//
		//	//Если ЦенаСоСкидкой>0 и Цена2=0  Тогда
		//	//	
		//	//	Цена2=ЦенаСоСкидкой;
		//	//	
		//	//КонецЕсли;
		//	//
		//	//
		//	//Если ЦенаСоСкидкой>0 и Цена2>ЦенаСоСкидкой  Тогда
		//	//	
		//	//	Цена2=ЦенаСоСкидкой;
		//	//	
		//	//КонецЕсли;
		//	
		////	
		////	Если Цена1<>0 и Цена1<>Null Тогда
		////		Цена1=Формат(Цена1, "ЧДЦ=2");
		////		
		////		ОбъектCML.ЗаписатьНачалоЭлемента("Цена");
		////		
		////		ЗаписатьТекстовойУзел(ОбъектCML, "Представление", Строка(""+Цена1+" RUB за шт"));
		////		ЗаписатьТекстовойУзел(ОбъектCML, "ИдТипаЦены", Строка(ТипЦен1.Код));
		////		Цен222= Формат(Цена1,"ЧЦ=18; ЧДЦ=2; ЧРД=,; ЧГ=""");
		////		ЗаписатьТекстовойУзел(ОбъектCML, "ЦенаЗаЕдиницу", Строка(Цен222));
		////		ЗаписатьТекстовойУзел(ОбъектCML, "Валюта", Строка("RUB"));
		////		ЗаписатьТекстовойУзел(ОбъектCML, "Единица", Строка("шт"));
		////		ЗаписатьТекстовойУзел(ОбъектCML, "Коэффициент", Строка("1"));
		////		ОбъектCML.ЗаписатьКонецЭлемента(); //цена			
		////		
		////	КонецЕсли;	
		////	
		////	// цену со скидкой не грузим.
		//////	Цена2 = 0; 
		////	Если Цена2<>0 и Цена2<>Null Тогда
		////		
		////		Цена2=Формат(Цена2, "ЧДЦ=2");
		////		
		////		ОбъектCML.ЗаписатьНачалоЭлемента("Цена");
		////		
		////		ЗаписатьТекстовойУзел(ОбъектCML, "Представление", Строка(""+Цена2+" RUB за шт"));
		////		ЗаписатьТекстовойУзел(ОбъектCML, "ИдТипаЦены", Строка(ТипЦен2.Код));
		////		Цен222= Формат(Цена1,"ЧЦ=18; ЧДЦ=2; ЧРД=,; ЧГ=""");
		////		ЗаписатьТекстовойУзел(ОбъектCML, "ЦенаЗаЕдиницу", Строка(Цена2));
		////		ЗаписатьТекстовойУзел(ОбъектCML, "Валюта", Строка("RUB"));
		////		ЗаписатьТекстовойУзел(ОбъектCML, "Единица", Строка("шт"));
		////		ЗаписатьТекстовойУзел(ОбъектCML, "Коэффициент", Строка("1"));
		////		ОбъектCML.ЗаписатьКонецЭлемента(); //цена	
		////		
		////	КонецЕсли;  
		////	
		////	
		////	Если Цена3<>0 и Цена3<>Null Тогда
		////		
		////		Цена3=Формат(Цена3, "ЧДЦ=2");
		////		
		////		ОбъектCML.ЗаписатьНачалоЭлемента("Цена");
		////		
		////		ЗаписатьТекстовойУзел(ОбъектCML, "Представление", Строка(""+Цена3+" RUB за шт"));
		////		ЗаписатьТекстовойУзел(ОбъектCML, "ИдТипаЦены", Строка(ТипЦен3.Код));
		////		Цен222= Формат(Цена1,"ЧЦ=18; ЧДЦ=2; ЧРД=,; ЧГ=""");
		////		ЗаписатьТекстовойУзел(ОбъектCML, "ЦенаЗаЕдиницу", Строка(Цена3));
		////		ЗаписатьТекстовойУзел(ОбъектCML, "Валюта", Строка("RUB"));
		////		ЗаписатьТекстовойУзел(ОбъектCML, "Единица", Строка("шт"));
		////		ЗаписатьТекстовойУзел(ОбъектCML, "Коэффициент", Строка("1"));
		////		ОбъектCML.ЗаписатьКонецЭлемента(); //цена	
		////		
		////	КонецЕсли;  
		////	
		////	
		////	
		////	//---------------------------------------------------------------------------------------------------------------------
		////	ОбъектCML.ЗаписатьКонецЭлемента(); // цены
		//	ЗаписатьТекстовойУзел(ОбъектCML, "Количество", Строка(РЕз.КолФакт));
		//КонецЕсли;
		////нечаева 21,05,19---
		//
		//
		
		ОбъектCML.ЗаписатьКонецЭлемента(); // предложение
		
	КонецЦикла;
	
	//--------------------------------------------------------
	//   конец записи файла
	//--------------------------------------------------------
	
	
	// предложения
	ОбъектCML.ЗаписатьКонецЭлемента(); 
	
	// пакет предложений
	ОбъектCML.ЗаписатьКонецЭлемента(); 
	
	// ком инф.
	ОбъектCML.ЗаписатьКонецЭлемента(); 
	
	ОбъектCML.Закрыть();
	
	#Если Клиент Тогда
		Сообщить("Сформирован файл: "+ИмяФайлаВЫгрузки);
		//Сообщить("Выгрузка завершена.",СтатусСообщения.Информация);
		Сообщить(ТекущаяДата());
	#КонецЕсли
	
	
	//ЗаписатьВЛог("ОбменССайтом"," Интернет-магазин. Прайс выгружен!","");
	//крохин начало 30.11.2011
	//Константы.ДатаПоследнегоУдачногоОбменаССайтом.Установить(НачалоДня(ТекущаяДата()));	
	//крохин конец 30.11.2011
	
	
КонецПроцедуры


// тут 2 файла еще добавим для выгрузки.
// прайс prices
Процедура ВыгрузитьЦены(ИмяФайлаВыгрузки,Группы)
	
	ЗаписатьВЛог("b2b"," Выгрузка цен начало... ","");

	Если НЕ ВыгружатьПрайсЛист тогда
		возврат;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ИмяФайлаВыгрузки) Тогда
		#Если Клиент Тогда
			Сообщить("Не указано имя файла выгрузки !!!");
		#КонецЕсли
		
		Возврат;	
	КонецЕсли; 
	
	РазделительПолей=";";
	МассивНом= Новый Массив();
	МассивНом=Группы;
	
	
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	//                  запись файла
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	#Если Клиент Тогда
		Состояние("Начало...");
	#КонецЕсли
	
	ОбъектCML = ПолучитьОбъектДляЗаписиXML(ИмяФайлаВыгрузки, ТекущаяДата());
	
	
	//-------------------------------------------------------------------------------------------------------------
	//         пакет предложений
	//----------------------------------------------------------------------------------------------------------
	
	ОбъектCML.ЗаписатьНачалоЭлемента("ПакетПредложений");
	ОбъектCML.ЗаписатьАтрибут("СодержитТолькоИзменения","true");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка("Id_Klassificator"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", ФорматНаименованияДляCML("Пакет предложений (новый СТИЛЬПАРК)"));
	ЗаписатьТекстовойУзел(ОбъектCML, "ИдКаталога", Строка("Id_TorgKat"));
	ЗаписатьТекстовойУзел(ОбъектCML, "ИдКлассификатора", Строка("Id_Klassificator"));
	
	
	#Если Клиент Тогда
		Состояние("Заполнение типов цен...");
	#КонецЕсли
	
	
	
	//-----------------------------------------------------------------------------------------
	//   Заполнение цен на товары
	//-----------------------------------------------------------------------------------------
	#Если Клиент Тогда
		Состояние("Заполнение цен на товары...");
	#КонецЕсли
	
	
	ТипЦен1=Справочники.ТипыЦен.НайтиПоКоду("SNL-0229"); //обцл
	ТипЦен2=Справочники.ТипыЦен.НайтиПоКоду("SSP-0314");  // сейл опт отповая розница
	ТипЦен3=Справочники.ТипыЦен.НайтиПоКоду("SNL-0584");  // SALE ТР (точечная розница))


	
	
	Массив1=Новый массив;
	// ТЦ Семеновский
	Массив1.Добавить(Справочники.Склады.НайтиПоКоду("SSP-22"));
	
	// выбираем всю номенклатуру по остаткам и с нулевыми остатками тоже выгружаем!!!!
	Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
	             |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Модель,
	             |	ЦеныНоменклатурыСрезПоследних.ТипЦен КАК ТипЦен,
	             |	ЦеныНоменклатурыСрезПоследних.Прайс.Дата КАК ДатаПрайса,
	             |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	             |ПОМЕСТИТЬ Цены
	             |ИЗ
	             |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	             |			&Дата2 {(&Дата2)},
	             |			Прайс.Проведен
	             |				И Прайс.Дата2 >= &Дата2 {(ТипЦен).*}) КАК ЦеныНоменклатурыСрезПоследних
	             |ГДЕ
	             |	ЦеныНоменклатурыСрезПоследних.ТипЦен = &Тектипцен1
	             |
	             |ИНДЕКСИРОВАТЬ ПО
	             |	Модель,
	             |	ТипЦен
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	МАКСИМУМ(Цены.ДатаПрайса) КАК ДатаПрайса,
	             |	Цены.Модель КАК Модель,
	             |	Цены.ТипЦен КАК ТипЦен
	             |ПОМЕСТИТЬ Прайсы
	             |ИЗ
	             |	Цены КАК Цены
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	Цены.ТипЦен,
	             |	Цены.Модель
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Модель,
	             |	ЦеныНоменклатурыСрезПоследних.ТипЦен КАК ТипЦен,
	             |	ЦеныНоменклатурыСрезПоследних.Прайс.Дата КАК ДатаПрайса,
	             |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	             |ПОМЕСТИТЬ Цены2
	             |ИЗ
	             |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	             |			&Дата2 {(&Дата2)},
	             |			Прайс.Проведен
	             |				И Прайс.Дата2 >= &Дата2 {(ТипЦен).*}) КАК ЦеныНоменклатурыСрезПоследних
	             |ГДЕ
	             |	ЦеныНоменклатурыСрезПоследних.ТипЦен = &Тектипцен2
	             |
	             |ИНДЕКСИРОВАТЬ ПО
	             |	Модель,
	             |	ТипЦен
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	МАКСИМУМ(Цены2.ДатаПрайса) КАК ДатаПрайса,
	             |	Цены2.Модель КАК Модель,
	             |	Цены2.ТипЦен КАК ТипЦен
	             |ПОМЕСТИТЬ Прайсы2
	             |ИЗ
	             |	Цены2 КАК Цены2
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	Цены2.ТипЦен,
	             |	Цены2.Модель
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Модель,
	             |	ЦеныНоменклатурыСрезПоследних.ТипЦен КАК ТипЦен,
	             |	ЦеныНоменклатурыСрезПоследних.Прайс.Дата КАК ДатаПрайса,
	             |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	             |ПОМЕСТИТЬ Цены3
	             |ИЗ
	             |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	             |			&Дата2 {(&Дата2)},
	             |			Прайс.Проведен
	             |				И Прайс.Дата2 >= &Дата2 {(ТипЦен).*}) КАК ЦеныНоменклатурыСрезПоследних
	             |ГДЕ
	             |	ЦеныНоменклатурыСрезПоследних.ТипЦен = &Тектипцен3
	             |
	             |ИНДЕКСИРОВАТЬ ПО
	             |	Модель,
	             |	ТипЦен
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	МАКСИМУМ(Цены3.ДатаПрайса) КАК ДатаПрайса,
	             |	Цены3.Модель КАК Модель,
	             |	Цены3.ТипЦен КАК ТипЦен
	             |ПОМЕСТИТЬ Прайсы3
	             |ИЗ
	             |	Цены3 КАК Цены3
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	Цены3.ТипЦен,
	             |	Цены3.Модель
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	Прайсы.Модель КАК Модель,
	             |	Прайсы.ТипЦен КАК ТипЦен,
	             |	Цены.Цена КАК Цена1
	             |ПОМЕСТИТЬ ИтогоЦены1
	             |ИЗ
	             |	Прайсы КАК Прайсы
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Цены КАК Цены
	             |		ПО (Цены.Модель = Прайсы.Модель)
	             |			И (Цены.ТипЦен = Прайсы.ТипЦен)
	             |			И (Цены.ДатаПрайса = Прайсы.ДатаПрайса)
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	Прайсы2.Модель КАК Модель,
	             |	Прайсы2.ТипЦен КАК ТипЦен,
	             |	Цены2.Цена КАК Цена2
	             |ПОМЕСТИТЬ ИтогоЦены2
	             |ИЗ
	             |	Прайсы2 КАК Прайсы2
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Цены2 КАК Цены2
	             |		ПО (Цены2.Модель = Прайсы2.Модель)
	             |			И (Цены2.ТипЦен = Прайсы2.ТипЦен)
	             |			И (Цены2.ДатаПрайса = Прайсы2.ДатаПрайса)
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	Прайсы3.Модель КАК Модель,
	             |	Прайсы3.ТипЦен КАК ТипЦен,
	             |	Цены3.Цена КАК Цена3
	             |ПОМЕСТИТЬ ИтогоЦены3
	             |ИЗ
	             |	Прайсы3 КАК Прайсы3
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Цены3 КАК Цены3
	             |		ПО (Цены3.Модель = Прайсы3.Модель)
	             |			И (Цены3.ТипЦен = Прайсы3.ТипЦен)
	             |			И (Цены3.ДатаПрайса = Прайсы3.ДатаПрайса)
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	Ном.Наименование КАК наименование,
	             |	Ном.Родитель КАК Группа,
	             |	Ном.Ссылка КАК Ссылка,
	             |	ИтогоЦены1.Цена1 КАК Цена1,
	             |	ИтогоЦены2.Цена2 КАК Цена2,
	             |	ИтогоЦены3.Цена3 КАК Цена3,
	             |	1 КАК Ост,
	             |	0 КАК Рез,
	             |	1 КАК КолФакт,
	             |	Ном.Цвет КАК Цвет,
	             |	Ном.Размер КАК Размер,
	             |	Ном.РазмерДляСайта КАК РазмерДляСайта,
	             |	ВЫБОР
	             |		КОГДА Ном.Родитель.ТипТовараДляСайта = &бюсты
	             |				ИЛИ Ном.Родитель.ТипТовараДляСайта = &купальн
	             |			ТОГДА ВЫБОР
	             |					КОГДА Ном.ЦветИМ.Код <> """"
	             |						ТОГДА Ном.ЦветИМ.Код
	             |					ИНАЧЕ Ном.Цвет.Код
	             |				КОНЕЦ
	             |		ИНАЧЕ Ном.Цвет.Код
	             |	КОНЕЦ КАК кодЦвета
	             |ИЗ
	             |	Справочник.Номенклатура КАК Ном
	             |		ЛЕВОЕ СОЕДИНЕНИЕ ИтогоЦены2 КАК ИтогоЦены2
	             |		ПО (ИтогоЦены2.Модель = Ном.Родитель)
	             |		ЛЕВОЕ СОЕДИНЕНИЕ ИтогоЦены1 КАК ИтогоЦены1
	             |		ПО (ИтогоЦены1.Модель = Ном.Родитель)
	             |		ЛЕВОЕ СОЕДИНЕНИЕ ИтогоЦены3 КАК ИтогоЦены3
	             |		ПО (ИтогоЦены3.Модель = Ном.Родитель)
	             |ГДЕ
	           //  |	Ном.Ссылка В ИЕРАРХИИ(&ТекНом) и
	             |	 НЕ Ном.ЭтоГруппа
	             |	И ВЫБОР
				 //|			КОГДА Ном.Ссылка.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
				 //|				ТОГДА ""Да""
				 //|			КОГДА Ном.Ссылка.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
				 //|				ТОГДА ""Нет"" 
	          //   |			иначе ВЫБОР
	             |					КОГДА Ном.Ссылка.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |						ТОГДА ""Да""
	             |					КОГДА Ном.Ссылка.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |						ТОГДА ""Нет""
	             |					ИНАЧЕ ВЫБОР
	             |							КОГДА Ном.Ссылка.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |								ТОГДА ""Да""
	             |							КОГДА Ном.Ссылка.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |								ТОГДА ""Нет""
	             |							ИНАЧЕ ВЫБОР
	             |									КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |										ТОГДА ""Да""
	             |									КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |										ТОГДА ""Нет""
	             |									ИНАЧЕ ВЫБОР
	             |											КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |												ТОГДА ""Да""
	             |											КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |												ТОГДА ""Нет""
	             |											ИНАЧЕ ""Нет""
	             |										КОНЕЦ
	         //    |								КОНЕЦ
	             |						КОНЕЦ
	             |				КОНЕЦ
	             |		КОНЕЦ = ""Да""  ";
	           //  |
	//             |ОБЪЕДИНИТЬ ВСЕ
	//             |
	//             |ВЫБРАТЬ
	//             |	Ном.Наименование,
	//             |	Ном.Родитель,
	//             |	Ном.Ссылка,
	//             |	ИтогоЦены1.Цена1,
	//             |	ИтогоЦены2.Цена2,
	//             |	ИтогоЦены3.Цена3,
	//             |	0,
	//             |	0,
	//             |	0,
	//             |	Ном.Цвет,
	//             |	Ном.Размер,
	//             |	Ном.РазмерДляСайта,
	//             |	ВЫБОР
	//             |		КОГДА Ном.Родитель.ТипТовараДляСайта = &бюсты
	//             |				ИЛИ Ном.Родитель.ТипТовараДляСайта = &купальн
	//             |			ТОГДА ВЫБОР
	//             |					КОГДА Ном.ЦветИМ.Код <> """"
	//             |						ТОГДА Ном.ЦветИМ.Код
	//             |					ИНАЧЕ Ном.Цвет.Код
	//             |				КОНЕЦ
	//             |		ИНАЧЕ Ном.Цвет.Код
	//             |	КОНЕЦ
	//             |ИЗ
	//             |	Справочник.Номенклатура КАК Ном
	//             |		ЛЕВОЕ СОЕДИНЕНИЕ ИтогоЦены2 КАК ИтогоЦены2
	//             |		ПО (ИтогоЦены2.Модель = Ном.Родитель)
	//             |		ЛЕВОЕ СОЕДИНЕНИЕ ИтогоЦены1 КАК ИтогоЦены1
	//             |		ПО (ИтогоЦены1.Модель = Ном.Родитель)
	//             |		ЛЕВОЕ СОЕДИНЕНИЕ ИтогоЦены3 КАК ИтогоЦены3
	//             |		ПО (ИтогоЦены3.Модель = Ном.Родитель)
	//             |ГДЕ
	//             |	Ном.Ссылка В ИЕРАРХИИ(&ТекНом)
	//             |	И НЕ Ном.ЭтоГруппа
	//             |	И ВЫБОР
	//             |			КОГДА Ном.Ссылка.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	//             |				ТОГДА ""Да""
	//             |			КОГДА Ном.Ссылка.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	//             |				ТОГДА ""Нет""
	//             |			ИНАЧЕ ВЫБОР
	//             |					КОГДА Ном.Ссылка.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	//             |						ТОГДА ""Да""
	//             |					КОГДА Ном.Ссылка.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	//             |						ТОГДА ""Нет""
	//             |					ИНАЧЕ ВЫБОР
	//             |							КОГДА Ном.Ссылка.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	//             |								ТОГДА ""Да""
	//             |							КОГДА Ном.Ссылка.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	//             |								ТОГДА ""Нет""
	//             |							ИНАЧЕ ВЫБОР
	//             |									КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	//             |										ТОГДА ""Да""
	//             |									КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	//             |										ТОГДА ""Нет""
	//             |									ИНАЧЕ ВЫБОР
	//             |											КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	//             |												ТОГДА ""Да""
	//             |											КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	//             |												ТОГДА ""Нет""
	//             |											ИНАЧЕ ""Нет""
	//             |										КОНЕЦ
	//             |								КОНЕЦ
	//             |						КОНЕЦ
	//             |				КОНЕЦ
	//             |		КОНЕЦ = ""Нет""";
	//
	
	
		
	ТипЦен1=Справочники.ТипыЦен.НайтиПоКоду("SNL-0229"); //обцл
	ТипЦен2=Справочники.ТипыЦен.НайтиПоКоду("SSP-0314");  // сейл опт отповая розница
	ТипЦен3=Справочники.ТипыЦен.НайтиПоКоду("SNL-0584");  // SALE ТР (точечная розница))


	
	
	Запрос.УстановитьПараметр("бюсты",Справочники.ТипыТоваровДляСайта.НайтиПоКоду("000000026"));
	Запрос.УстановитьПараметр("купальн",Справочники.ТипыТоваровДляСайта.НайтиПоКоду("000000011"));
	
	
	Запрос.УстановитьПараметр("ТекСклад",Массив1);
	Запрос.УстановитьПараметр("ТекТипЦен1",Типцен1);
	Запрос.УстановитьПараметр("ТекТипЦен2",Типцен2);
	Запрос.УстановитьПараметр("ТекТипЦен3",Типцен3);
//	Запрос.УстановитьПараметр("ТекНом",Группы);
	Запрос.УстановитьПараметр("Дата2",ТекущаяДата());
	
	//Рез=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Группа");
	Рез=Запрос.Выполнить().Выбрать();
	#Если Клиент Тогда
		Сообщить(" Количество выгружаемого товара - "+Рез.Количество());	
	#КонецЕсли
	
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++	
	ОбъектCML.ЗаписатьНачалоЭлемента("Предложения");
	
	
	ТипСкидок = справочники.ТипыСкидок.НайтиПоКоду("SNL-0008");  //sale ниже некуда
	ТипЦен = Типцен1;  //обцл	
	
	Пока Рез.Следующий() Цикл
		//нечаева 31,10,18+++
		//Если РЕз.Ссылка.СнятСПроизводства = истина ТОгда
		//	продолжить;
		//КонецЕсли;	
		//нечаева 31,10,18---
		Выборка = Рез;
		Цена1=0;
		Цена2=0;
		
		Если Рез.Цена1=Неопределено ИЛИ Рез.Цена1=Null Тогда
			Цена1=0;
		Иначе
			Цена1=Рез.Цена1;
		КонецЕсли;	
		
		Если Рез.Цена2=Неопределено ИЛИ Рез.Цена2=Null Тогда
			Цена2=0;
		Иначе
			Цена2=Рез.Цена2;
		КонецЕсли;	
		
			Если Рез.Цена3=Неопределено ИЛИ Рез.Цена3=Null Тогда
				Цена3=0;
			Иначе
				Цена3=Рез.Цена3;
			КонецЕсли;	

		// нечаева08,12,2022
		Если Цена1=0 и Цена2 = 0 и цена3=0 Тогда
			
			
			// нечаева 10,07,23+++ логирование пока отменили.
			// нечаева 08,12,2022++
			//попытка
			//	НаборЗаписей = РегистрыСведений.ЛогиОбменаССайтомb2bЦены.СоздатьНаборЗаписей(); 
			//	НаборЗаписей.Отбор.Номенклатура.Установить(Рез.Ссылка); 
			//	НаборЗаписей.Отбор.Дата.Установить(НачалоДня(ТекущаяДата())); 
			//	
			//	
			//	НоваяЗапись = НаборЗаписей.Добавить(); 
			//	НоваяЗапись.Номенклатура = Рез.Ссылка; 
			//	НоваяЗапись.Дата = НачалоДня(ТекущаяДата()); 
			//	НоваяЗапись.Цена1 = 0; 
			//	НоваяЗапись.Цена2 = 0; 
			//	НоваяЗапись.Цена3 = 0;				

			//	НаборЗаписей.Записать();    
			//Исключение
			//конецПопытки;
			//нечаева 08,12,2022---
		
			продолжить;
		КонецЕсли;	
	    //нечаева 08,12,2022 ---
		
		
		#Если Клиент Тогда
			ОбработкаПрерыванияПользователя();
			Состояние("Обработка: "+Рез.Группа);			
		#КонецЕсли	
		ОбъектCML.ЗаписатьНачалоЭлемента("Предложение");
		
		//	Скидка=ПолучитьСкидкуНоменклатуры(ТекСтр.Модель,ТипСкидок,Дата,ТипЦен);
		
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка(""+Рез.Ссылка.родитель.код+"#"+Рез.Ссылка.код)); //юкод  Строка(Выборка.ссылка.уникальныйИдентификатор())
		ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", Строка(Рез.Ссылка.Наименование));
		
		//******************************************************************************
				
			ОбъектCML.ЗаписатьНачалоЭлемента("Цены");
					
	        //++Данилова Е.В. 08.08.2025 HELP-6426 
			//Если Цена1<>0 и Цена1<>Null Тогда 
				//--Данилова Е.В. 08.08.2025
			Цена1=Формат(Цена1, "ЧДЦ=2; ЧН=0");
			
			ОбъектCML.ЗаписатьНачалоЭлемента("Цена");
			
			//	ЗаписатьТекстовойУзел(ОбъектCML, "Представление", Строка(""+Цена1+" RUB за шт"));
			ЗаписатьТекстовойУзел(ОбъектCML, "ИдТипаЦены", Строка(ТипЦен1.Код));
			Цен222= Формат(Цена1,"ЧЦ=18; ЧДЦ=2; ЧРД=,; ЧГ="""); 
			//++Данилова Е.В. 08.08.2025 HELP-6426
			//ЗаписатьТекстовойУзел(ОбъектCML, "ЦенаЗаЕдиницу", Строка(Цен222));
			ЗаписатьТекстовойУзел(ОбъектCML, "ЦенаЗаЕдиницу", Строка(Цена1),ЛОжь);
			//--Данилова Е.В. 08.08.2025
			ЗаписатьТекстовойУзел(ОбъектCML, "Валюта", Строка("руб"));
			//	ЗаписатьТекстовойУзел(ОбъектCML, "Единица", Строка("шт"));
			//	ЗаписатьТекстовойУзел(ОбъектCML, "Коэффициент", Строка("1"));
			ОбъектCML.ЗаписатьКонецЭлемента(); //цена			
			
			//КонецЕсли;	
			
			// цену со скидкой не грузим.
			//		Цена2 = 0;
			//++Данилова Е.В. 08.08.2025 HELP-6426
			//Если Цена2<>0 и Цена2<>Null Тогда  
			//--Данилова Е.В. 08.08.2025
				
			Цена2=Формат(Цена2, "ЧДЦ=2; ЧН=0");
			
			ОбъектCML.ЗаписатьНачалоЭлемента("Цена");
			
			//	ЗаписатьТекстовойУзел(ОбъектCML, "Представление", Строка(""+Цена2+" RUB за шт"));
			ЗаписатьТекстовойУзел(ОбъектCML, "ИдТипаЦены", Строка(ТипЦен2.Код));
			Цен222= Формат(Цена1,"ЧЦ=18; ЧДЦ=2; ЧРД=,; ЧГ=""");
			//++Данилова Е.В. 08.08.2025 HELP-6426
			//ЗаписатьТекстовойУзел(ОбъектCML, "ЦенаЗаЕдиницу", Строка(Цена2));
			ЗаписатьТекстовойУзел(ОбъектCML, "ЦенаЗаЕдиницу", Строка(Цена2),ложь);
			//--Данилова Е.В. 08.08.2025
			ЗаписатьТекстовойУзел(ОбъектCML, "Валюта", Строка("руб"));
			//	ЗаписатьТекстовойУзел(ОбъектCML, "Единица", Строка("шт"));
			//	ЗаписатьТекстовойУзел(ОбъектCML, "Коэффициент", Строка("1"));
			ОбъектCML.ЗаписатьКонецЭлемента(); //цена	
			
			//КонецЕсли;  
			
			//--------------------------------------------------------------------------------
			 //++Данилова Е.В. 08.08.2025 HELP-6426
			// Если Цена3<>0 и Цена3<>Null Тогда
				 //--Данилова Е.В. 08.08.2025
		 
			 Цена3=Формат(Цена3, "ЧДЦ=2; ЧН=0");
			 
			 ОбъектCML.ЗаписатьНачалоЭлемента("Цена");
			 
			 //	ЗаписатьТекстовойУзел(ОбъектCML, "Представление", Строка(""+Цена2+" RUB за шт"));
			 ЗаписатьТекстовойУзел(ОбъектCML, "ИдТипаЦены", Строка(ТипЦен3.Код));
			 Цен222= Формат(Цена1,"ЧЦ=18; ЧДЦ=2; ЧРД=,; ЧГ=""");
			 //++Данилова Е.В. 08.08.2025
			//ЗаписатьТекстовойУзел(ОбъектCML, "ЦенаЗаЕдиницу", Строка(Цена3));
			 ЗаписатьТекстовойУзел(ОбъектCML, "ЦенаЗаЕдиницу", Строка(Цена3),ложь);
			 //--Данилова Е.В. 08.08.2025
			 ЗаписатьТекстовойУзел(ОбъектCML, "Валюта", Строка("руб"));
			 //	ЗаписатьТекстовойУзел(ОбъектCML, "Единица", Строка("шт"));
			 //	ЗаписатьТекстовойУзел(ОбъектCML, "Коэффициент", Строка("1"));
			 ОбъектCML.ЗаписатьКонецЭлемента(); //цена	
				
		//	КонецЕсли;  		
				
			// нечаева 08,12,2022++
			//попытка
			//	НаборЗаписей = РегистрыСведений.ЛогиОбменаССайтомb2bЦены.СоздатьНаборЗаписей(); 
			//	НаборЗаписей.Отбор.Номенклатура.Установить(Рез.Ссылка); 
			//	НаборЗаписей.Отбор.Дата.Установить(НачалоДня(ТекущаяДата())); 
			//	
			//	
			//	НоваяЗапись = НаборЗаписей.Добавить(); 
			//	НоваяЗапись.Номенклатура = Рез.Ссылка; 
			//	НоваяЗапись.Дата = НачалоДня(ТекущаяДата()); 
			//	НоваяЗапись.Цена1 = Цена1; 
			//	НоваяЗапись.Цена2 = Цена2; 
			//	НоваяЗапись.Цена3 = Цена3;				

			//	НаборЗаписей.Записать();    
			//Исключение
			//конецПопытки;
			//нечаева 08,12,2022---

			
						
			//---------------------------------------------------------------------------------------------------------------------
			ОбъектCML.ЗаписатьКонецЭлемента(); // цены
			
		
		ОбъектCML.ЗаписатьКонецЭлемента(); // предложение
		
	КонецЦикла;
	
	//--------------------------------------------------------
	//   конец записи файла
	//--------------------------------------------------------
	
	
	// предложения
	ОбъектCML.ЗаписатьКонецЭлемента(); 
	
	// пакет предложений
	ОбъектCML.ЗаписатьКонецЭлемента(); 
	
	// ком инф.
	ОбъектCML.ЗаписатьКонецЭлемента(); 
	
	ОбъектCML.Закрыть();
	
	#Если Клиент Тогда
		Сообщить("Сформирован файл: "+ИмяФайлаВЫгрузки);
		//Сообщить("Выгрузка завершена.",СтатусСообщения.Информация);
		Сообщить(ТекущаяДата());
	#КонецЕсли
	
	ЗаписатьВЛог("b2b",".... Выгрузка цен конец ","");

	//ЗаписатьВЛог("ОбменССайтом"," Интернет-магазин. Прайс выгружен!","");
	//крохин начало 30.11.2011
	//Константы.ДатаПоследнегоУдачногоОбменаССайтом.Установить(НачалоДня(ТекущаяДата()));	
	//крохин конец 30.11.2011
	
	
КонецПроцедуры

// тут 2 файла еще добавим для выгрузки.


Процедура ВыгрузитьОстатки_ст2(ИмяФайлаВыгрузки,Группы)
	
	ЗаписатьВЛог("b2b"," Выгрузка остатков... ","");
	
	Если НЕ ВыгружатьПрайсЛист тогда
		возврат;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ИмяФайлаВыгрузки) Тогда
		#Если Клиент Тогда
			Сообщить("Не указано имя файла выгрузки !!!");
		#КонецЕсли
		
		Возврат;	
	КонецЕсли; 
	
	РазделительПолей=";";
	МассивНом= Новый Массив();
	МассивНом=Группы;
	
	
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	//                  запись файла
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	#Если Клиент Тогда
		Состояние("Начало...");
	#КонецЕсли
	
	ОбъектCML = ПолучитьОбъектДляЗаписиXML(ИмяФайлаВыгрузки, ТекущаяДата());
	
	
	//-------------------------------------------------------------------------------------------------------------
	//         пакет предложений
	//----------------------------------------------------------------------------------------------------------
	
	ОбъектCML.ЗаписатьНачалоЭлемента("ПакетПредложений");
	ОбъектCML.ЗаписатьАтрибут("СодержитТолькоИзменения","true");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка("Id_Klassificator"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", ФорматНаименованияДляCML("Пакет предложений (новый СТИЛЬПАРК)"));
	ЗаписатьТекстовойУзел(ОбъектCML, "ИдКаталога", Строка("Id_TorgKat"));
	ЗаписатьТекстовойУзел(ОбъектCML, "ИдКлассификатора", Строка("Id_Klassificator"));
	
	
	
	
	#Если Клиент Тогда
		Состояние("Заполнение типов цен...");
	#КонецЕсли
	
	
	
	//-----------------------------------------------------------------------------------------
	//   Заполнение цен на товары
	//-----------------------------------------------------------------------------------------
	#Если Клиент Тогда
		Состояние("Заполнение цен на товары...");
	#КонецЕсли
	
		

	Склады = новый Массив;
	Склады.Добавить(справочники.Склады.НайтиПоКоду("STC-60"));
	Склады.Добавить(справочники.Склады.НайтиПоКоду("STA-48"));
	
	//Запрос.УстановитьПараметр("склады", Склады);
	//Запрос.УстановитьПараметр("ТекТипЦен1",Типцен1);
	//Запрос.УстановитьПараметр("ТекТипЦен2",Типцен2);
	//Запрос.УстановитьПараметр("ТекНом",Группы);
	//Запрос.УстановитьПараметр("Дата2",ТекущаяДата());
	//Запрос.УстановитьПараметр("Дата1",ТекущаяДата());
		

	//	Рез = запрос.Выполнить().Выгрузить();
	//	СпРаспродажногоТОвара = рез.Скопировать();
	//	СпРаспродажногоТОвара.Свернуть("Ссылка");



	// Товар берем весь.
	СпРаспродажногоТОвара = новый массив;
	СпРаспродажногоТОвара.Добавить(справочники.Номенклатура.НайтиПоКоду("SNL-063480"));

	СпРаспродажногоТОвара.Добавить(справочники.Номенклатура.НайтиПоКоду("SNL-063481"));
	СпРаспродажногоТОвара.Добавить(справочники.Номенклатура.НайтиПоКоду("SNL-511499"));
	СпРаспродажногоТОвара.Добавить(справочники.Номенклатура.НайтиПоКоду("SNL-063487"));
	СпРаспродажногоТОвара.Добавить(справочники.Номенклатура.НайтиПоКоду("SNL-131551"));
	СпРаспродажногоТОвара.Добавить(справочники.Номенклатура.НайтиПоКоду("SNL-499807"));
	СпРаспродажногоТОвара.Добавить(справочники.Номенклатура.НайтиПоКоду("SNL-422359"));
	СпРаспродажногоТОвара.Добавить(справочники.Номенклатура.НайтиПоКоду("SNL-063466"));
	СпРаспродажногоТОвара.Добавить(справочники.Номенклатура.НайтиПоКоду("SNL-422360"));
	СпРаспродажногоТОвара.Добавить(справочники.Номенклатура.НайтиПоКоду("SNL-422349"));
	СпРаспродажногоТОвара.Добавить(справочники.Номенклатура.НайтиПоКоду("SNL-063488"));
	СпРаспродажногоТОвара.Добавить(справочники.Номенклатура.НайтиПоКоду("SNL-561467"));
	СпРаспродажногоТОвара.Добавить(справочники.Номенклатура.НайтиПоКоду("SNL-560970"));

	 
	//--------------------------------------------------------------------------------------------------------------------------------------------------------------
	
	
	// выбираем всю номенклатуру по остаткам и с нулевыми остатками тоже выгружаем ????
	Запрос=Новый Запрос;      //ПЕРВЫЕ 5000

	Запрос.Текст="ВЫБРАТЬ
	             |	Ном.Ссылка КАК Ссылка,
	             |	СУММА(ВложенныйЗапрос.КолКонФакт) КАК КолКонФакт
	             |ИЗ
	             |	Справочник.Номенклатура КАК Ном
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			""Остатки"" КАК Раздел,
	             |			Остатки.Номенклатура.Родитель КАК Модель,
	             |			СУММА(Остатки.КоличествоКонечныйОстаток) КАК КолКонБух,
	             |			ВЫБОР
	             |				КОГДА СУММА(Остатки.КоличествоКонечныйОстаток) = 0
	             |					ТОГДА NULL
	             |				ИНАЧЕ СУММА(Остатки.СуммаКонечныйОстаток) / СУММА(Остатки.КоличествоКонечныйОстаток)
	             |			КОНЕЦ КАК ЦенаСеб,
	             |			СУММА(Остатки.СуммаКонечныйОстаток) КАК СебестоимостьБух,
	             |			СУММА(Остатки.КоличествоКонечныйОстаток - ЕСТЬNULL(Резервы.КоличествоКонечныйОстаток, 0)) КАК КолКонФакт,
	             |			СУММА(ЕСТЬNULL(Резервы.КоличествоКонечныйОстаток, 0)) КАК Резерв,
	             |			Остатки.Склад КАК Склад,
	             |			Остатки.Номенклатура.Ссылка КАК НоменклатураСсылка
	             |		ИЗ
	             |			РегистрНакопления.ОстаткиТМЦ.ОстаткиИОбороты(&Дата1, &Дата2, Период, , Склад В ИЕРАРХИИ (&Склады)) КАК Остатки
	             |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.ОстаткиИОбороты(&дата1, &дата2, Период, , Склад В ИЕРАРХИИ (&Склады)) КАК Резервы
	             |				ПО Остатки.Номенклатура = Резервы.Номенклатура
	             |					И Остатки.Склад = Резервы.Склад
	             |		
	             |		СГРУППИРОВАТЬ ПО
	             |			Остатки.Номенклатура.Родитель,
	             |			Остатки.Склад,
	             |			Остатки.Номенклатура.Ссылка) КАК ВложенныйЗапрос
	             |		ПО Ном.Ссылка = ВложенныйЗапрос.НоменклатураСсылка
	             |ГДЕ
	             |	Ном.Ссылка В ИЕРАРХИИ(&ТекНом)
	             |	И НЕ Ном.ЭтоГруппа
	             |	И ВЫБОР
	             |			КОГДА Ном.Ссылка.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |				ТОГДА ""Да""
	             |			КОГДА Ном.Ссылка.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |				ТОГДА ""Нет""
	             |			ИНАЧЕ ВЫБОР
	             |					КОГДА Ном.Ссылка.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |						ТОГДА ""Да""
	             |					КОГДА Ном.Ссылка.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |						ТОГДА ""Нет""
	             |					ИНАЧЕ ВЫБОР
	             |							КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |								ТОГДА ""Да""
	             |							КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |								ТОГДА ""Нет""
	             |							ИНАЧЕ ВЫБОР
	             |									КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |										ТОГДА ""Да""
	             |									КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |										ТОГДА ""Нет""
	             |									ИНАЧЕ ""Нет""
	             |								КОНЕЦ
	             |						КОНЕЦ
	             |				КОНЕЦ
	             |		КОНЕЦ = ""Да""
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	Ном.Ссылка
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Ном.Наименование";
	//нечаева 27,09,22++ поменяла запрос
	
	
	
	
	Запрос.УстановитьПараметр("бюсты",Справочники.ТипыТоваровДляСайта.НайтиПоКоду("000000026"));
	Запрос.УстановитьПараметр("купальн",Справочники.ТипыТоваровДляСайта.НайтиПоКоду("000000011"));
	
	Склады = новый Массив;
	Склады.Добавить(справочники.Склады.НайтиПоКоду("STC-60"));
	Склады.Добавить(справочники.Склады.НайтиПоКоду("STA-48"));
	
	Запрос.УстановитьПараметр("склады", Склады);
	Запрос.УстановитьПараметр("ТекНом",СпРаспродажногоТОвара);
	Запрос.УстановитьПараметр("Дата2",ТекущаяДата());
	Запрос.УстановитьПараметр("Дата1",ТекущаяДата());
	


	
	//Рез=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Группа");
	Рез=Запрос.Выполнить().Выбрать();
	#Если Клиент Тогда
		Сообщить(" Количество выгружаемого товара - "+Рез.Количество());	
	#КонецЕсли
	
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++	
	ОбъектCML.ЗаписатьНачалоЭлемента("Предложения");
	
	
	//ТипСкидок = справочники.ТипыСкидок.НайтиПоКоду("SNL-0008");  //sale ниже некуда
	//ТипЦен = Типцен1;  //обцл	
	
	Пока Рез.Следующий() Цикл
		
		Выборка = Рез;
		
		Если Рез.КолКонФакт=0 или Рез.КолКонФакт=Null Тогда
           продолжить;
		КонецЕсли;  
		
		
		
		#Если Клиент Тогда
			ОбработкаПрерыванияПользователя();
			Состояние("Обработка: "+Рез.ссылка.родитель);			
		#КонецЕсли	
		ОбъектCML.ЗаписатьНачалоЭлемента("Предложение");
	
		
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка(""+Рез.Ссылка.родитель.код+"#"+Рез.Ссылка.код)); //юкод  Строка(Выборка.ссылка.уникальныйИдентификатор())
		ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", Строка(Рез.Ссылка.Наименование));
		
		//******************************************************************************
		
	
			ОбъектCML.ЗаписатьНачалоЭлемента("Остатки");
			
			Если Рез.КолКонФакт<>0 и Рез.КолКонФакт<>Null Тогда
				Цена1=Формат(Цена1, "ЧДЦ=2");
				
				ОбъектCML.ЗаписатьНачалоЭлемента("Остаток");
				
				
				Если Рез.КолКонФакт>1000 тогда
					кол = 1000;
				иначе
					кол = Рез.КолКонФакт;
				КонецЕсли;	
				
								
				ЗаписатьТекстовойУзел(ОбъектCML, "ИдСклада", Строка("STC-60"));
				Цен222= Формат(кол,"ЧЦ=18; ЧДЦ=0; ЧРД=,; ЧГ=""");
				
				ЗаписатьТекстовойУзел(ОбъектCML, "Количество", Строка(Цен222));
				
				ОбъектCML.ЗаписатьКонецЭлемента(); //цена			
				
	
			//---------------------------------------------------------------------------------------------------------------------
			ОбъектCML.ЗаписатьКонецЭлемента(); // цены
			КонецЕсли;
		
		
		ОбъектCML.ЗаписатьКонецЭлемента(); // предложение
		
	КонецЦикла;
	
	//--------------------------------------------------------
	//   конец записи файла
	//--------------------------------------------------------
	
	
	// предложения
	ОбъектCML.ЗаписатьКонецЭлемента(); 
	
	// пакет предложений
	ОбъектCML.ЗаписатьКонецЭлемента(); 
	
	// ком инф.
	ОбъектCML.ЗаписатьКонецЭлемента(); 
	
	ОбъектCML.Закрыть();
	
	#Если Клиент Тогда
		Сообщить("Сформирован файл: "+ИмяФайлаВЫгрузки);
		//Сообщить("Выгрузка завершена.",СтатусСообщения.Информация);
		Сообщить(ТекущаяДата());
	#КонецЕсли
	
	
	ЗаписатьВЛог("b2b"," Остатки выгружены! ","");
	//крохин начало 30.11.2011
	//Константы.ДатаПоследнегоУдачногоОбменаССайтом.Установить(НачалоДня(ТекущаяДата()));	
	//крохин конец 30.11.2011
	
	
КонецПроцедуры


Процедура ВыгрузитьОстатки3(ИмяФайлаВыгрузки,Группы)
	
	ЗаписатьВЛог("b2b"," Выгрузка остатков... ","");
	
	Если НЕ ВыгружатьПрайсЛист тогда
		возврат;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ИмяФайлаВыгрузки) Тогда
		#Если Клиент Тогда
			Сообщить("Не указано имя файла выгрузки !!!");
		#КонецЕсли
		
		Возврат;	
	КонецЕсли; 
	
	РазделительПолей=";";
	МассивНом= Новый Массив();
	МассивНом=Группы;
	
	
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	//                  запись файла
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	#Если Клиент Тогда
		Состояние("Начало...");
	#КонецЕсли
	
	ОбъектCML = ПолучитьОбъектДляЗаписиXML(ИмяФайлаВыгрузки, ТекущаяДата());
	
	
	//-------------------------------------------------------------------------------------------------------------
	//         пакет предложений
	//----------------------------------------------------------------------------------------------------------
	
	ОбъектCML.ЗаписатьНачалоЭлемента("ПакетПредложений");
	ОбъектCML.ЗаписатьАтрибут("СодержитТолькоИзменения","true");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка("Id_Klassificator"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", ФорматНаименованияДляCML("Пакет предложений (новый СТИЛЬПАРК)"));
	ЗаписатьТекстовойУзел(ОбъектCML, "ИдКаталога", Строка("Id_TorgKat"));
	ЗаписатьТекстовойУзел(ОбъектCML, "ИдКлассификатора", Строка("Id_Klassificator"));
	
	
	
	
	#Если Клиент Тогда
		Состояние("Заполнение типов цен...");
	#КонецЕсли
	
	
	
	//-----------------------------------------------------------------------------------------
	//   Заполнение цен на товары
	//-----------------------------------------------------------------------------------------
	#Если Клиент Тогда
		Состояние("Заполнение цен на товары...");
	#КонецЕсли
	
		

	Склады = новый Массив;
	Склады.Добавить(справочники.Склады.НайтиПоКоду("STC-60"));
	Склады.Добавить(справочники.Склады.НайтиПоКоду("STA-48"));
	
	//Запрос.УстановитьПараметр("склады", Склады);
	//Запрос.УстановитьПараметр("ТекТипЦен1",Типцен1);
	//Запрос.УстановитьПараметр("ТекТипЦен2",Типцен2);
	//Запрос.УстановитьПараметр("ТекНом",Группы);
	//Запрос.УстановитьПараметр("Дата2",ТекущаяДата());
	//Запрос.УстановитьПараметр("Дата1",ТекущаяДата());
		

	//	Рез = запрос.Выполнить().Выгрузить();
	//	СпРаспродажногоТОвара = рез.Скопировать();
	//	СпРаспродажногоТОвара.Свернуть("Ссылка");



	// Товар берем весь.
	//СпРаспродажногоТОвара = новый массив;
	//СпРаспродажногоТОвара.Добавить(справочники.Номенклатура.НайтиПоКоду("SNL-063480"));

	//СпРаспродажногоТОвара.Добавить(справочники.Номенклатура.НайтиПоКоду("SNL-063481"));
	//СпРаспродажногоТОвара.Добавить(справочники.Номенклатура.НайтиПоКоду("SNL-511499"));
	//СпРаспродажногоТОвара.Добавить(справочники.Номенклатура.НайтиПоКоду("SNL-063487"));
	//СпРаспродажногоТОвара.Добавить(справочники.Номенклатура.НайтиПоКоду("SNL-131551"));
	//СпРаспродажногоТОвара.Добавить(справочники.Номенклатура.НайтиПоКоду("SNL-499807"));
	//СпРаспродажногоТОвара.Добавить(справочники.Номенклатура.НайтиПоКоду("SNL-422359"));
	//СпРаспродажногоТОвара.Добавить(справочники.Номенклатура.НайтиПоКоду("SNL-063466"));
	//СпРаспродажногоТОвара.Добавить(справочники.Номенклатура.НайтиПоКоду("SNL-422360"));
	//СпРаспродажногоТОвара.Добавить(справочники.Номенклатура.НайтиПоКоду("SNL-422349"));
	//СпРаспродажногоТОвара.Добавить(справочники.Номенклатура.НайтиПоКоду("SNL-063488"));
	//СпРаспродажногоТОвара.Добавить(справочники.Номенклатура.НайтиПоКоду("SNL-561467"));
	//СпРаспродажногоТОвара.Добавить(справочники.Номенклатура.НайтиПоКоду("SNL-560970"));

	 
	//--------------------------------------------------------------------------------------------------------------------------------------------------------------
	
	
	// выбираем всю номенклатуру по остаткам и с нулевыми остатками тоже выгружаем ????
	Запрос=Новый Запрос;      //ПЕРВЫЕ 5000

	//Запрос.Текст="ВЫБРАТЬ
	//             |	Ном.Ссылка КАК Ссылка,
	//             |	СУММА(ВложенныйЗапрос.КолКонФакт) КАК КолКонФакт
	//             |ИЗ
	//             |	Справочник.Номенклатура КАК Ном
	//             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//             |			""Остатки"" КАК Раздел,
	//             |			Остатки.Номенклатура.Родитель КАК Модель,
	//             |			СУММА(Остатки.КоличествоКонечныйОстаток) КАК КолКонБух,
	//             |			ВЫБОР
	//             |				КОГДА СУММА(Остатки.КоличествоКонечныйОстаток) = 0
	//             |					ТОГДА NULL
	//             |				ИНАЧЕ СУММА(Остатки.СуммаКонечныйОстаток) / СУММА(Остатки.КоличествоКонечныйОстаток)
	//             |			КОНЕЦ КАК ЦенаСеб,
	//             |			СУММА(Остатки.СуммаКонечныйОстаток) КАК СебестоимостьБух,
	//             |			СУММА(Остатки.КоличествоКонечныйОстаток - ЕСТЬNULL(Резервы.КоличествоКонечныйОстаток, 0)) КАК КолКонФакт,
	//             |			СУММА(ЕСТЬNULL(Резервы.КоличествоКонечныйОстаток, 0)) КАК Резерв,
	//             |			Остатки.Склад КАК Склад,
	//             |			Остатки.Номенклатура.Ссылка КАК НоменклатураСсылка
	//             |		ИЗ
	//             |			РегистрНакопления.ОстаткиТМЦ.ОстаткиИОбороты(&Дата1, &Дата2, Период, , Склад В ИЕРАРХИИ (&Склады)) КАК Остатки
	//             |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.ОстаткиИОбороты(&дата1, &дата2, Период, , Склад В ИЕРАРХИИ (&Склады)) КАК Резервы
	//             |				ПО Остатки.Номенклатура = Резервы.Номенклатура
	//             |					И Остатки.Склад = Резервы.Склад
	//             |		
	//             |		СГРУППИРОВАТЬ ПО
	//             |			Остатки.Номенклатура.Родитель,
	//             |			Остатки.Склад,
	//             |			Остатки.Номенклатура.Ссылка) КАК ВложенныйЗапрос
	//             |		ПО Ном.Ссылка = ВложенныйЗапрос.НоменклатураСсылка
	//             |ГДЕ
	//         //    |	Ном.Ссылка В ИЕРАРХИИ(&ТекНом)
	//             |	 НЕ Ном.ЭтоГруппа
	//             |	И ВЫБОР
	//             |			КОГДА Ном.Ссылка.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	//             |				ТОГДА ""Да""
	//             |			КОГДА Ном.Ссылка.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	//             |				ТОГДА ""Нет""
	//             |			ИНАЧЕ ВЫБОР
	//             |					КОГДА Ном.Ссылка.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	//             |						ТОГДА ""Да""
	//             |					КОГДА Ном.Ссылка.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	//             |						ТОГДА ""Нет""
	//             |					ИНАЧЕ ВЫБОР
	//             |							КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	//             |								ТОГДА ""Да""
	//             |							КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	//             |								ТОГДА ""Нет""
	//             |							ИНАЧЕ ВЫБОР
	//             |									КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	//             |										ТОГДА ""Да""
	//             |									КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	//             |										ТОГДА ""Нет""
	//             |									ИНАЧЕ ""Нет""
	//             |								КОНЕЦ
	//             |						КОНЕЦ
	//             |				КОНЕЦ
	//             |		КОНЕЦ = ""Да""
	//             |
	//             |СГРУППИРОВАТЬ ПО
	//             |	Ном.Ссылка
	//             |
	//             |УПОРЯДОЧИТЬ ПО
	//             |	Ном.Наименование";
	////нечаева 27,09,22++ поменяла запрос
	//
	
	запрос.Текст = "ВЫБРАТЬ
	               |	Ном.Ссылка КАК Ссылка,
	               |	СУММА(ВложенныйЗапрос.КолКонФакт) КАК КолКонФакт,
	               |	СУММА(ВложенныйЗапрос.КолКонБух) КАК КолКонБух,
	               |	СУММА(ВложенныйЗапрос.Резерв) КАК Резерв
	               |ИЗ
	               |	Справочник.Номенклатура КАК Ном
	               |		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			СУММА(Остатки.КоличествоКонечныйОстаток) КАК КолКонБух,
	               |			ВЫБОР
	               |				КОГДА СУММА(Остатки.КоличествоКонечныйОстаток) = 0
	               |					ТОГДА NULL
	               |				ИНАЧЕ СУММА(Остатки.СуммаКонечныйОстаток) / СУММА(Остатки.КоличествоКонечныйОстаток)
	               |			КОНЕЦ КАК ЦенаСеб,
	               |			СУММА(Остатки.КоличествоКонечныйОстаток - ЕСТЬNULL(Резервы.КоличествоКонечныйОстаток, 0)) КАК КолКонФакт,
	               |			СУММА(ЕСТЬNULL(Резервы.КоличествоКонечныйОстаток, 0)) КАК Резерв,
	               |			Остатки.Номенклатура.Ссылка КАК НоменклатураСсылка,
	               |			Остатки.Склад КАК Склад
	               |		ИЗ
	               |			РегистрНакопления.ОстаткиТМЦ.ОстаткиИОбороты(&Дата1, &Дата2, Период, , Склад В ИЕРАРХИИ (&Склады)) КАК Остатки
	               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.ОстаткиИОбороты(&дата1, &дата2, Период, , Склад В ИЕРАРХИИ (&Склады)) КАК Резервы
	               |				ПО Остатки.Номенклатура = Резервы.Номенклатура
	               |					И Остатки.Склад = Резервы.Склад
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			Остатки.Номенклатура.Ссылка,
	               |			Остатки.Склад) КАК ВложенныйЗапрос
	               |		ПО Ном.Ссылка = ВложенныйЗапрос.НоменклатураСсылка
	               |ГДЕ
	             //  |	Ном.Ссылка В ИЕРАРХИИ(&ТекНом) и
	               |	 НЕ Ном.ЭтоГруппа
	               |	И ВЫБОР
	               |			КОГДА Ном.Ссылка.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	               |				ТОГДА ""Да""
	               |			КОГДА Ном.Ссылка.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	               |				ТОГДА ""Нет""
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА Ном.Ссылка.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	               |						ТОГДА ""Да""
	               |					КОГДА Ном.Ссылка.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	               |						ТОГДА ""Нет""
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	               |								ТОГДА ""Да""
	               |							КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	               |								ТОГДА ""Нет""
	               |							ИНАЧЕ ВЫБОР
	               |									КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	               |										ТОГДА ""Да""
	               |									КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	               |										ТОГДА ""Нет""
	               |									ИНАЧЕ ""Нет""
	               |								КОНЕЦ
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ = ""Да""
	               |	И Ном.ЖизненныйЦиклНоменклатуры = &активна
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Ном.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ном.Наименование";
	
	Запрос.УстановитьПараметр("бюсты",Справочники.ТипыТоваровДляСайта.НайтиПоКоду("000000026"));
	Запрос.УстановитьПараметр("купальн",Справочники.ТипыТоваровДляСайта.НайтиПоКоду("000000011"));
	
	Склады = новый Массив;
	Склады.Добавить(справочники.Склады.НайтиПоКоду("STC-60"));
	Склады.Добавить(справочники.Склады.НайтиПоКоду("STA-48"));
	
	Запрос.УстановитьПараметр("склады", Склады);
	//Запрос.УстановитьПараметр("ТекНом",СпРаспродажногоТОвара);
	Запрос.УстановитьПараметр("Дата2",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Дата1",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("активна",перечисления.ЖизненныйЦиклНоменклатуры.Активна);



	
	//Рез=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Группа");
	Рез=Запрос.Выполнить().Выбрать();
	#Если Клиент Тогда
		Сообщить(" Количество выгружаемого товара - "+Рез.Количество());	
	#КонецЕсли
	
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++	
	ОбъектCML.ЗаписатьНачалоЭлемента("Предложения");
	
	
	//ТипСкидок = справочники.ТипыСкидок.НайтиПоКоду("SNL-0008");  //sale ниже некуда
	//ТипЦен = Типцен1;  //обцл	
	
	Пока Рез.Следующий() Цикл
		
		Выборка = Рез;
		//
		//Если Рез.КолКонФакт=0 или Рез.КолКонФакт=Null Тогда
		//   продолжить;
		//КонецЕсли;  
		//
		//
		
		#Если Клиент Тогда
			ОбработкаПрерыванияПользователя();
			Состояние("Обработка: "+Рез.ссылка.родитель);			
		#КонецЕсли	
		ОбъектCML.ЗаписатьНачалоЭлемента("Предложение");
	
		
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка(""+Рез.Ссылка.родитель.код+"#"+Рез.Ссылка.код)); //юкод  Строка(Выборка.ссылка.уникальныйИдентификатор())
		ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", Строка(Рез.Ссылка.Наименование));
		
		//******************************************************************************
		
	
			ОбъектCML.ЗаписатьНачалоЭлемента("Остатки");
			
		//	Если Рез.КолКонФакт<>0 и Рез.КолКонФакт<>Null Тогда
		
				Цена1=Формат(Цена1, "ЧДЦ=2");
				
				ОбъектCML.ЗаписатьНачалоЭлемента("Остаток");
				
				//
				//Если Рез.КолКонФакт>1000 тогда
				//	кол = 1000;
				//иначе
				//	кол = Рез.КолКонФакт;
				//КонецЕсли;	
				//
				//Если Рез.КолКонФакт=0 или Рез.КолКонФакт=Null Тогда

				//   кол = "0";
				//конецЕсли;
				
				
				Если Рез.КолКонФакт = null или  Рез.КолКонФакт = неопределено Тогда
					 кол = 0;
				 иначе
					 Если Рез.КолКонФакт>1000 тогда
						 кол = 1000;
					 иначе
						 кол = Рез.КолКонФакт;
					 КонецЕсли;	
									 
				КонецЕсли;	
					
				
				ЗаписатьТекстовойУзел(ОбъектCML, "ИдСклада", Строка("STC-60"));
				Цен222= Формат(кол,"ЧЦ=18; ЧДЦ=0; ЧРД=,; ЧГ=""");
				
				ЗаписатьТекстовойУзел(ОбъектCML, "Количество", Строка(Цен222));
				
				ОбъектCML.ЗаписатьКонецЭлемента(); //цена			
				
	            				// нечаева 08,12,2022++
				попытка
					НаборЗаписей = РегистрыСведений.ЛогиОбменаССайтомb2bОстатки.СоздатьНаборЗаписей(); 
					НаборЗаписей.Отбор.Номенклатура.Установить(Рез.Ссылка); 
					НаборЗаписей.Отбор.Дата.Установить(НачалоДня(ТекущаяДата())); 
					
					
					НоваяЗапись = НаборЗаписей.Добавить(); 
					НоваяЗапись.Номенклатура = Рез.Ссылка; 
					НоваяЗапись.Дата = НачалоДня(ТекущаяДата()); 
					НоваяЗапись.Остаток = кол; 
					
					НаборЗаписей.Записать();    
				Исключение
				конецПопытки;
				//нечаева 08,12,2022---

			//---------------------------------------------------------------------------------------------------------------------
			ОбъектCML.ЗаписатьКонецЭлемента(); // цены
		//	КонецЕсли;
		
		
		ОбъектCML.ЗаписатьКонецЭлемента(); // предложение
		
	КонецЦикла;
	
	//--------------------------------------------------------
	//   конец записи файла
	//--------------------------------------------------------
	
	
	// предложения
	ОбъектCML.ЗаписатьКонецЭлемента(); 
	
	// пакет предложений
	ОбъектCML.ЗаписатьКонецЭлемента(); 
	
	// ком инф.
	ОбъектCML.ЗаписатьКонецЭлемента(); 
	
	ОбъектCML.Закрыть();
	
	#Если Клиент Тогда
		Сообщить("Сформирован файл: "+ИмяФайлаВЫгрузки);
		//Сообщить("Выгрузка завершена.",СтатусСообщения.Информация);
		Сообщить(ТекущаяДата());
	#КонецЕсли
	
	
	ЗаписатьВЛог("b2b"," Остатки выгружены! ","");
	//крохин начало 30.11.2011
	//Константы.ДатаПоследнегоУдачногоОбменаССайтом.Установить(НачалоДня(ТекущаяДата()));	
	//крохин конец 30.11.2011
	
	
КонецПроцедуры

//нечаева 21,06,23 ++++
Процедура ВыгрузитьОстатки(ИмяФайлаВыгрузки,Группы)
	
	ЗаписатьВЛог("b2b"," Выгрузка остатков... ","");
	
	Если НЕ ВыгружатьПрайсЛист тогда
		возврат;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ИмяФайлаВыгрузки) Тогда
		#Если Клиент Тогда
			Сообщить("Не указано имя файла выгрузки !!!");
		#КонецЕсли
		
		Возврат;	
	КонецЕсли; 
	
	РазделительПолей=";";
	МассивНом= Новый Массив();
	МассивНом=Группы;
	
	
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	//                  запись файла
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	#Если Клиент Тогда
		Состояние("Начало...");
	#КонецЕсли
	
	ОбъектCML = ПолучитьОбъектДляЗаписиXML(ИмяФайлаВыгрузки, ТекущаяДата());
		
	//-------------------------------------------------------------------------------------------------------------
	//         пакет предложений
	//----------------------------------------------------------------------------------------------------------
	
	ОбъектCML.ЗаписатьНачалоЭлемента("ПакетПредложений");
	ОбъектCML.ЗаписатьАтрибут("СодержитТолькоИзменения","true");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка("Id_Klassificator"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", ФорматНаименованияДляCML("Пакет предложений (новый СТИЛЬПАРК)"));
	ЗаписатьТекстовойУзел(ОбъектCML, "ИдКаталога", Строка("Id_TorgKat"));
	ЗаписатьТекстовойУзел(ОбъектCML, "ИдКлассификатора", Строка("Id_Klassificator"));
	
	//-----------------------------------------------------------------------------------------
	//   Заполнение цен на товары
	//-----------------------------------------------------------------------------------------
	#Если Клиент Тогда
		Состояние("Заполнение цен на товары...");
	#КонецЕсли

	Склады = новый Массив;
	Склады.Добавить(справочники.Склады.НайтиПоКоду("STC-60"));
	Склады.Добавить(справочники.Склады.НайтиПоКоду("STA-48"));
	//--------------------------------------------------------------------------------------------------------------------------------------------------------------
	
	
	// выбираем всю номенклатуру по остаткам и с нулевыми остатками тоже выгружаем ????
	Запрос=Новый Запрос;     
	
		запрос.Текст = "ВЫБРАТЬ
	               |	Ном.Ссылка КАК Ссылка,
	               |	ВЫБОР
	               |		КОГДА СУММА(ВложенныйЗапрос.КолКонФакт) > 1000
	               |			ТОГДА 1000
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА СУММА(ВложенныйЗапрос.КолКонФакт) = NULL
	               |						ИЛИ СУММА(ВложенныйЗапрос.КолКонФакт) = НЕОПРЕДЕЛЕНО
	               |					ТОГДА 0
	               |				ИНАЧЕ СУММА(ВложенныйЗапрос.КолКонФакт)
	               |			КОНЕЦ
	               |	КОНЕЦ КАК КолКонФакт,
	               |	СУММА(ВложенныйЗапрос.КолКонБух) КАК КолКонБух,
	               |	СУММА(ВложенныйЗапрос.Резерв) КАК Резерв,
	               |	ВложенныйЗапрос.НоменклатураСсылка.Родитель.Код КАК МодельКод,
	               |	Ном.Код КАК Код,
	               |	Ном.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.Номенклатура КАК Ном
	               |		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			СУММА(Остатки.КоличествоКонечныйОстаток) КАК КолКонБух,
	               |			ВЫБОР
	               |				КОГДА СУММА(Остатки.КоличествоКонечныйОстаток) = 0
	               |					ТОГДА NULL
	               |				ИНАЧЕ СУММА(Остатки.СуммаКонечныйОстаток) / СУММА(Остатки.КоличествоКонечныйОстаток)
	               |			КОНЕЦ КАК ЦенаСеб,
	               |			СУММА(Остатки.КоличествоКонечныйОстаток - ЕСТЬNULL(Резервы.КоличествоКонечныйОстаток, 0)) КАК КолКонФакт,
	               |			СУММА(ЕСТЬNULL(Резервы.КоличествоКонечныйОстаток, 0)) КАК Резерв,
	               |			Остатки.Номенклатура.Ссылка КАК НоменклатураСсылка,
	               |			Остатки.Склад КАК Склад
	               |		ИЗ
	               |			РегистрНакопления.ОстаткиТМЦ.ОстаткиИОбороты(&Дата1, &Дата2, Период, , Склад В ИЕРАРХИИ (&Склады)) КАК Остатки
	               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.ОстаткиИОбороты(&дата1, &дата2, Период, , Склад В ИЕРАРХИИ (&Склады)) КАК Резервы
	               |				ПО Остатки.Номенклатура = Резервы.Номенклатура
	               |					И Остатки.Склад = Резервы.Склад
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			Остатки.Номенклатура.Ссылка,
	               |			Остатки.Склад) КАК ВложенныйЗапрос
	               |		ПО Ном.Ссылка = ВложенныйЗапрос.НоменклатураСсылка
	               |ГДЕ
	               |	НЕ Ном.ЭтоГруппа
	               |	И ВЫБОР
	               |			КОГДА Ном.Ссылка.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	               |				ТОГДА ""Да""
	               |			КОГДА Ном.Ссылка.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	               |				ТОГДА ""Нет""
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА Ном.Ссылка.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	               |						ТОГДА ""Да""
	               |					КОГДА Ном.Ссылка.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	               |						ТОГДА ""Нет""
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	               |								ТОГДА ""Да""
	               |							КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	               |								ТОГДА ""Нет""
	               |							ИНАЧЕ ВЫБОР
	               |									КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	               |										ТОГДА ""Да""
	               |									КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	               |										ТОГДА ""Нет""
	               |									ИНАЧЕ ""Нет""
	               |								КОНЕЦ
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ = ""Да""
	               |	И Ном.ЖизненныйЦиклНоменклатуры = &активна
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Ном.Ссылка,
	               |	ВложенныйЗапрос.НоменклатураСсылка.Родитель.Код,
	               |	Ном.Код,
	               |	Ном.Наименование
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ном.Наименование";

	Запрос.УстановитьПараметр("бюсты",Справочники.ТипыТоваровДляСайта.НайтиПоКоду("000000026"));
	Запрос.УстановитьПараметр("купальн",Справочники.ТипыТоваровДляСайта.НайтиПоКоду("000000011"));
	
	Склады = новый Массив;
	Склады.Добавить(справочники.Склады.НайтиПоКоду("STC-60"));
	Склады.Добавить(справочники.Склады.НайтиПоКоду("STA-48"));
	
	Запрос.УстановитьПараметр("склады", Склады);
	//Запрос.УстановитьПараметр("ТекНом",СпРаспродажногоТОвара);
	Запрос.УстановитьПараметр("Дата2",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Дата1",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("активна",перечисления.ЖизненныйЦиклНоменклатуры.Активна);

	//Рез=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Группа");
	Рез=Запрос.Выполнить().Выбрать();
	#Если Клиент Тогда
		Сообщить(" Количество выгружаемого товара - "+Рез.Количество());	
	#КонецЕсли
	
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++	
	ОбъектCML.ЗаписатьНачалоЭлемента("Предложения");
	
	
	Пока Рез.Следующий() Цикл
		
		Выборка = Рез;
			
		#Если Клиент Тогда
			ОбработкаПрерыванияПользователя();
			Состояние("Обработка: "+Рез.ссылка.родитель);			
		#КонецЕсли	
		ОбъектCML.ЗаписатьНачалоЭлемента("Предложение");
	
		
		ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка(""+Рез.Моделькод+"#"+Рез.код)); //юкод  Строка(Выборка.ссылка.уникальныйИдентификатор())
		ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", Строка(Рез.Наименование));
		
		//******************************************************************************
		
	
			ОбъектCML.ЗаписатьНачалоЭлемента("Остатки");
			
	        Цена1=Формат(Цена1, "ЧДЦ=2");
				
				ОбъектCML.ЗаписатьНачалоЭлемента("Остаток");
								
				кол = Рез.КолКонФакт;
				ЗаписатьТекстовойУзел(ОбъектCML, "ИдСклада", Строка("STC-60"));
				Цен222= Формат(кол,"ЧЦ=18; ЧДЦ=0; ЧРД=,; ЧГ=""");
				
				ЗаписатьТекстовойУзел(ОбъектCML, "Количество", Строка(Цен222));
				
				ОбъектCML.ЗаписатьКонецЭлемента(); //цена			
				
	            // нечаева 08,12,2022++
				//10,07,23+++ нечаева логирование пока отменили в регистр
				//попытка
				//	НаборЗаписей = РегистрыСведений.ЛогиОбменаССайтомb2bОстатки.СоздатьНаборЗаписей(); 
				//	НаборЗаписей.Отбор.Номенклатура.Установить(Рез.Ссылка); 
				//	НаборЗаписей.Отбор.Дата.Установить(НачалоДня(ТекущаяДата())); 
				//	
				//	
				//	НоваяЗапись = НаборЗаписей.Добавить(); 
				//	НоваяЗапись.Номенклатура = Рез.Ссылка; 
				//	НоваяЗапись.Дата = НачалоДня(ТекущаяДата()); 
				//	НоваяЗапись.Остаток = кол; 
				//	
				//	НаборЗаписей.Записать();    
				//Исключение
				//конецПопытки;
				//нечаева 08,12,2022---

			//---------------------------------------------------------------------------------------------------------------------
			ОбъектCML.ЗаписатьКонецЭлемента(); // цены
		//	КонецЕсли;
		
		
		ОбъектCML.ЗаписатьКонецЭлемента(); // предложение
		
	КонецЦикла;
	
	//--------------------------------------------------------
	//   конец записи файла
	//--------------------------------------------------------
	
	
	// предложения
	ОбъектCML.ЗаписатьКонецЭлемента(); 
	
	// пакет предложений
	ОбъектCML.ЗаписатьКонецЭлемента(); 
	
	// ком инф.
	ОбъектCML.ЗаписатьКонецЭлемента(); 
	
	ОбъектCML.Закрыть();
	
	#Если Клиент Тогда
		Сообщить("Сформирован файл: "+ИмяФайлаВЫгрузки);
		//Сообщить("Выгрузка завершена.",СтатусСообщения.Информация);
		Сообщить(ТекущаяДата());
	#КонецЕсли
	
	ЗаписатьВЛог("b2b"," Остатки выгружены! ","");
	//крохин начало 30.11.2011
	//Константы.ДатаПоследнегоУдачногоОбменаССайтом.Установить(НачалоДня(ТекущаяДата()));	
	//крохин конец 30.11.2011
	
	
КонецПроцедуры
//нечаева 21,06,23 ---- 


// акции
//нечаева 220422 +++
функция ПолучитьСкидкиПоАкции(НоменклатураАк)
	
	ТЗНом = новый таблицазначений;
	МассивНом = НоменклатураАк;  //документакция.скидки.выгрузить("номенклатура");
	Запрос = новый запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ном.Родитель КАК модель,
	             |	ВЫБОР
	             |		КОГДА ном.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |					ТОГДА ""Да""
	             |				КОГДА ном.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |					ТОГДА ""Нет""
	             |				ИНАЧЕ ВЫБОР
	             |						КОГДА ном.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |							ТОГДА ""Да""
	             |						КОГДА ном.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |							ТОГДА ""Нет""
	             |						ИНАЧЕ ВЫБОР
	             |								КОГДА ном.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |									ТОГДА ""Да""
	             |								КОГДА ном.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |									ТОГДА ""Нет""
	             |								ИНАЧЕ ВЫБОР
	             |										КОГДА ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |											ТОГДА ""Да""
	             |										КОГДА ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |											ТОГДА ""Нет""
	             |										ИНАЧЕ ""Нет""
	             |									КОНЕЦ
	             |							КОНЕЦ
	             |			КОНЕЦ
	             |	КОНЕЦ КАК ВыгружатьНаСайт
	             |ИЗ
	             |	Справочник.Номенклатура КАК ном
	             |ГДЕ
	             |  ном.ПометкаУдаления = ЛОЖЬ
	             |	И ном.ЭтоГруппа = ложь
	             |	И ном.Ссылка В ИЕРАРХИИ(&текгруппа)
	             |	И ВЫБОР
	             |			КОГДА ном.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |						ТОГДА ""Да""
	             |					КОГДА ном.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |						ТОГДА ""Нет""
	             |					ИНАЧЕ ВЫБОР
	             |							КОГДА ном.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |								ТОГДА ""Да""
	             |							КОГДА ном.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |								ТОГДА ""Нет""
	             |							ИНАЧЕ ВЫБОР
	             |									КОГДА ном.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |										ТОГДА ""Да""
	             |									КОГДА ном.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |										ТОГДА ""Нет""
	             |									ИНАЧЕ ВЫБОР
	             |											КОГДА ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	             |												ТОГДА ""Да""
	             |											КОГДА ном.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	             |												ТОГДА ""Нет""
	             |											ИНАЧЕ ""Нет""
	             |										КОНЕЦ
	             |								КОНЕЦ
	             |						
	             |				КОНЕЦ
	             |		КОНЕЦ = ""Да""
	             |                     ";

	
	
		
	
	Запрос.УстановитьПараметр("текгруппа",МассивНом);  //ложь
	Запрос.УстановитьПараметр("Пустая",ложь);  //ложь
	ТзНом=Запрос.Выполнить().Выгрузить();
	
	возврат тзНом;
	
конецфункции

Процедура ВыгрузитьАкции(ИмяФайлаВыгрузки,Группы)
	
	ЗаписатьВЛог("b2b"," Выгрузка акций... ","");
	
	Если НЕ ВыгружатьПрайсЛист тогда
		возврат;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ИмяФайлаВыгрузки) Тогда
		#Если Клиент Тогда
			Сообщить("Не указано имя файла выгрузки !!!");
		#КонецЕсли
		
		Возврат;	
	КонецЕсли; 
	
	РазделительПолей=";";
	МассивНом= Новый Массив();
	МассивНом=Группы;
	
	
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	//                  запись файла
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	#Если Клиент Тогда
		Состояние("Начало...");
	#КонецЕсли
	
	ОбъектCML = ПолучитьОбъектДляЗаписиXML(ИмяФайлаВыгрузки, ТекущаяДата());
	
	
	//-------------------------------------------------------------------------------------------------------------
	//         пакет предложений
	//----------------------------------------------------------------------------------------------------------
	
	ОбъектCML.ЗаписатьНачалоЭлемента("ПакетПредложений");
	ОбъектCML.ЗаписатьАтрибут("СодержитТолькоИзменения","true");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка("Id_Klassificator"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", ФорматНаименованияДляCML("Пакет предложений (новый СТИЛЬПАРК)"));
	ЗаписатьТекстовойУзел(ОбъектCML, "ИдКаталога", Строка("Id_TorgKat"));
	ЗаписатьТекстовойУзел(ОбъектCML, "ИдКлассификатора", Строка("Id_Klassificator"));
	
	
	
	
	#Если Клиент Тогда
		Состояние("Заполнение акций...");
	#КонецЕсли
	
	
	
	//-----------------------------------------------------------------------------------------
	//   Заполнение цен на товары
	//-----------------------------------------------------------------------------------------
	#Если Клиент Тогда
		//Состояние("Заполнение цен на товары...");
	#КонецЕсли
	
	
	Массив1=Новый массив;
	// ТЦ Семеновский
	Массив1.Добавить(Справочники.Склады.НайтиПоКоду("SSP-22"));
	
	// выбираем всю номенклатуру по остаткам и с нулевыми остатками тоже выгружаем!!!!
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	УстановкаСкидокПоКонтрагентам.Ссылка КАК Ссылка,
	             |	УстановкаСкидокПоКонтрагентам.Дата КАК Дата,
	             |	КОНЕЦПЕРИОДА(УстановкаСкидокПоКонтрагентам.Дата2, ДЕНЬ) КАК Дата2
	             |ИЗ
	             |	Документ.УстановкаСкидокПоКонтрагентам КАК УстановкаСкидокПоКонтрагентам
	             |ГДЕ
	             |	УстановкаСкидокПоКонтрагентам.Проведен = ИСТИНА
	             |	И УстановкаСкидокПоКонтрагентам.Дата <= &Дата1
	             |	И УстановкаСкидокПоКонтрагентам.Дата2 >= &Дата2";
	
	
	Запрос.УстановитьПараметр("Дата2",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Дата1",КонецДня(ТекущаяДата()));
	
	
	//Рез=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Группа");
	Рез=Запрос.Выполнить().Выбрать();
	#Если Клиент Тогда
		Сообщить(" Количество выгружамых акций- "+Рез.Количество());	
	#КонецЕсли
	
	
//	
//	<КоммерческаяИнформация ВерсияСхемы="2.021" ДатаФормирования="2020-01-13T14:20:54">
//<Скидки>
//<Скидка>
//<Код>1</Код>
//<Наименование>Сезонная скидка на осень 2020</Наименование>
//<БитриксАктивность>true</БитриксАктивность>
//<Сортировка>500</Сортировка>
//<Величина>5</Величина>
//<ТипСкидки>P</ТипСкидки>
//<Разделы>
//<Раздел>1</Раздел>
//<Раздел>2</Раздел>
//</Разделы>
//<Товары>
//<Товар>1</Товар>
//<Товар>2</Товар>
//</Товары>
//<ДатаНачала> 22.07.2019 00:00:00</ДатаНачала>
//<ДатаОкончания> 31.12.2019 00:00:00</ДатаОкончания>
//<КонтрАгент>1</КонтрАгент>
//</Скидка>
//</Скидки>
//</КоммерческаяИнформация>
//	
	
	
		
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++	
	ОбъектCML.ЗаписатьНачалоЭлемента("Скидки");
	
	Пока Рез.Следующий() Цикл
		//нечаева 31,10,18+++
		//Если РЕз.Ссылка.СнятСПроизводства = истина ТОгда
		//	продолжить;
		//КонецЕсли;	
		//нечаева 31,10,18---
		Выборка = Рез;
		#Если Клиент Тогда
			ОбработкаПрерыванияПользователя();
			Состояние("Обработка: "+Рез.ссылка);			
		#КонецЕсли	
		ОбъектCML.ЗаписатьНачалоЭлемента("Скидка");
		
		//	Скидка=ПолучитьСкидкуНоменклатуры(ТекСтр.Модель,ТипСкидок,Дата,ТипЦен);
		
		
		
		ЗаписатьТекстовойУзел(ОбъектCML, "Код", Строка("sk_"+Рез.Ссылка.номер)); //юкод  Строка(Выборка.ссылка.уникальныйИдентификатор())
		ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", Строка(Рез.Ссылка.комментарий));
		ЗаписатьТекстовойУзел(ОбъектCML, "ДатаНачала", Строка(Рез.Ссылка.Дата));
		ЗаписатьТекстовойУзел(ОбъектCML, "ДатаОкончания", Строка(КонецДня(Рез.Ссылка.Дата2)));

		
		//******************************************************************************
		
		
		ОбъектCML.ЗаписатьНачалоЭлемента("Скидки");
		// выберем все различные модели, на которые действуют акции.
		ТзСкидок =Новый ТаблицаЗначений;
		ТзСкидок = ПолучитьСкидкиПоАкции(Рез.ссылка);
		
		
		
		Для каждого текстрока из рез.ссылка.Скидки цикл
			//  получим вссе модели;
			
			ТзСкидок = ПолучитьСкидкиПоАкции(ТекСтрока.номенклатура);

			Для каждого текстрока2 из тзскидок цикл
								
				ОбъектCML.ЗаписатьНачалоЭлемента("Товар");
		
				ЗаписатьТекстовойУзел(ОбъектCML, "ИдТовара", Строка(текстрока2.модель.код));
				// было
				//ЗаписатьТекстовойУзел(ОбъектCML, "Скидка", Строка(текстрока.скидка));
				////нечаева 14,06,23++
				//ЗаписатьТекстовойУзел(ОбъектCML, "СкидкаКлиента", Строка(текстрока.скидка));
				//// нечаева 14,06,23---
				
				ЗаписатьТекстовойУзел(ОбъектCML, "Скидка", Строка(текстрока.скидка));
				// Кухарь А.Ю. 20.06.2024 начало
				//
				// нечаева 06,10,23 +++
				//Если ТекСтрока.СкидкаКонечныйПокупатель<>0 Тогда
				//	ЗаписатьТекстовойУзел(ОбъектCML, "СкидкаКлиента", Строка(текстрока.СкидкаКонечныйПокупатель));
				//Иначе
				//	ЗаписатьТекстовойУзел(ОбъектCML, "СкидкаКлиента", Строка(текстрока.Скидка));
				//КонецЕсли;	
				// нечаева 06,10,23 ---
				ЗаписатьТекстовойУзел(ОбъектCML, "СкидкаКлиента", Строка(текстрока.СкидкаКонечныйПокупатель)); 
				// Кухарь А.Ю. 20.06.2024 конец
				

				ОбъектCML.ЗаписатьКонецЭлемента(); 
			конецЦикла;
			
		конеццикла;
		//---------------------------------------------------------------------------------------------------------------------
		ОбъектCML.ЗаписатьКонецЭлемента(); //товары
		//******************************************************************************************************
		// нечаева 13,07,23++
		ОбъектCML.ЗаписатьНачалоЭлемента("Контрагенты");
		
		Запрос1 = новый Запрос;
		Запрос1.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	УстановкаСкидокПоКонтрагентамКонтрагенты.Контрагент.Ведущий КАК Ведущий,
		               |	УстановкаСкидокПоКонтрагентамКонтрагенты.Контрагент.Ведущий.Наименование КАК Наименование,
		               |	УстановкаСкидокПоКонтрагентамКонтрагенты.Контрагент.Ведущий.Код КАК Код
		               |ИЗ
		               |	Документ.УстановкаСкидокПоКонтрагентам.Контрагенты КАК УстановкаСкидокПоКонтрагентамКонтрагенты
		               |ГДЕ
		               |	УстановкаСкидокПоКонтрагентамКонтрагенты.Ссылка = &текДок";
		
		запрос1.УстановитьПараметр("текДок",рез.ссылка);
		
		СпКонтрагентов = запрос1.Выполнить().Выгрузить();
				
		
		Для каждого текстрока из СпКонтрагентов цикл
			
			//нечаева 01,03,23+++
			Если Текстрока.ведущий = null или Текстрока.ведущий = неопределено Тогда
				продолжить;
			иначе
						
				ОбъектCML.ЗаписатьНачалоЭлемента("Контрагент");
				ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", Строка(текстрока.наименование));
				ЗаписатьТекстовойУзел(ОбъектCML, "код", Строка(Текстрока.код));
				ОбъектCML.ЗаписатьКонецЭлемента(); //контрагент		 
				
			КонецЕсли;	  
			//нечаева 01,03,23---
			
			
		конеццикла;

		//---------------------------------------------------------------------------------------------------------------------
		ОбъектCML.ЗаписатьКонецЭлемента(); //контрагенты
		// нечаева 13,07,23---			
			
		//*************************************************************	
			
		
		ОбъектCML.ЗаписатьКонецЭлемента(); // товар
		
	КонецЦикла;
	
	
	//--------------------------------------------------------
	//   конец записи файла
	//--------------------------------------------------------
	
	
	// предложения
	ОбъектCML.ЗаписатьКонецЭлемента(); 
	
	// пакет предложений
	ОбъектCML.ЗаписатьКонецЭлемента(); 
	
	// ком инф.
	ОбъектCML.ЗаписатьКонецЭлемента(); 
	
	ОбъектCML.Закрыть();
	
	#Если Клиент Тогда
		Сообщить("Сформирован файл: "+ИмяФайлаВЫгрузки);
		//Сообщить("Выгрузка завершена.",СтатусСообщения.Информация);
		Сообщить(ТекущаяДата());
	#КонецЕсли
	
	
	ЗаписатьВЛог("ОбменССайтом"," Интернет-магазин. Прайс выгружен!","");
	//крохин начало 30.11.2011
	//Константы.ДатаПоследнегоУдачногоОбменаССайтом.Установить(НачалоДня(ТекущаяДата()));	
	//крохин конец 30.11.2011
	
	
КонецПроцедуры


Процедура ВыгрузитьАкции_ст(ИмяФайлаВыгрузки,Группы)
	
	ЗаписатьВЛог("b2b"," Выгрузка акций... ","");
	
	Если НЕ ВыгружатьПрайсЛист тогда
		возврат;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ИмяФайлаВыгрузки) Тогда
		#Если Клиент Тогда
			Сообщить("Не указано имя файла выгрузки !!!");
		#КонецЕсли
		
		Возврат;	
	КонецЕсли; 
	
	РазделительПолей=";";
	МассивНом= Новый Массив();
	МассивНом=Группы;
	
	
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	//                  запись файла
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	#Если Клиент Тогда
		Состояние("Начало...");
	#КонецЕсли
	
	ОбъектCML = ПолучитьОбъектДляЗаписиXML(ИмяФайлаВыгрузки, ТекущаяДата());
	
	
	//-------------------------------------------------------------------------------------------------------------
	//         пакет предложений
	//----------------------------------------------------------------------------------------------------------
	
	ОбъектCML.ЗаписатьНачалоЭлемента("ПакетПредложений");
	ОбъектCML.ЗаписатьАтрибут("СодержитТолькоИзменения","true");
	ЗаписатьТекстовойУзел(ОбъектCML, "Ид", Строка("Id_Klassificator"));
	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", ФорматНаименованияДляCML("Пакет предложений (новый СТИЛЬПАРК)"));
	ЗаписатьТекстовойУзел(ОбъектCML, "ИдКаталога", Строка("Id_TorgKat"));
	ЗаписатьТекстовойУзел(ОбъектCML, "ИдКлассификатора", Строка("Id_Klassificator"));
	
	
	
	
	#Если Клиент Тогда
		Состояние("Заполнение акций...");
	#КонецЕсли
	
	
	
	//-----------------------------------------------------------------------------------------
	//   Заполнение цен на товары
	//-----------------------------------------------------------------------------------------
	#Если Клиент Тогда
		//Состояние("Заполнение цен на товары...");
	#КонецЕсли
	
	
	Массив1=Новый массив;
	// ТЦ Семеновский
	Массив1.Добавить(Справочники.Склады.НайтиПоКоду("SSP-22"));
	
	// выбираем всю номенклатуру по остаткам и с нулевыми остатками тоже выгружаем!!!!
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	УстановкаСкидокПоКонтрагентам.Ссылка КАК Ссылка,
	             |	УстановкаСкидокПоКонтрагентам.Дата КАК Дата,
	             |	УстановкаСкидокПоКонтрагентам.Дата2 КАК Дата2
	             |ИЗ
	             |	Документ.УстановкаСкидокПоКонтрагентам КАК УстановкаСкидокПоКонтрагентам
	             |ГДЕ
	             |	УстановкаСкидокПоКонтрагентам.Проведен = истина
	             |	И УстановкаСкидокПоКонтрагентам.Дата <= &Дата1
	             |	И УстановкаСкидокПоКонтрагентам.Дата2 >= &Дата2";
	
	Запрос.УстановитьПараметр("Дата2",ТекущаяДата());
	Запрос.УстановитьПараметр("Дата1",ТекущаяДата());
	
	
	//Рез=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Группа");
	Рез=Запрос.Выполнить().Выбрать();
	#Если Клиент Тогда
		Сообщить(" Количество выгружамых акций- "+Рез.Количество());	
	#КонецЕсли
	
	
//	
//	<КоммерческаяИнформация ВерсияСхемы="2.021" ДатаФормирования="2020-01-13T14:20:54">
//<Скидки>
//<Скидка>
//<Код>1</Код>
//<Наименование>Сезонная скидка на осень 2020</Наименование>
//<БитриксАктивность>true</БитриксАктивность>
//<Сортировка>500</Сортировка>
//<Величина>5</Величина>
//<ТипСкидки>P</ТипСкидки>
//<Разделы>
//<Раздел>1</Раздел>
//<Раздел>2</Раздел>
//</Разделы>
//<Товары>
//<Товар>1</Товар>
//<Товар>2</Товар>
//</Товары>
//<ДатаНачала> 22.07.2019 00:00:00</ДатаНачала>
//<ДатаОкончания> 31.12.2019 00:00:00</ДатаОкончания>
//<КонтрАгент>1</КонтрАгент>
//</Скидка>
//</Скидки>
//</КоммерческаяИнформация>
//	
	
	
		
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++	
	ОбъектCML.ЗаписатьНачалоЭлемента("Скидки");
	
	Пока Рез.Следующий() Цикл
		//нечаева 31,10,18+++
		//Если РЕз.Ссылка.СнятСПроизводства = истина ТОгда
		//	продолжить;
		//КонецЕсли;	
		//нечаева 31,10,18---
		Выборка = Рез;
		#Если Клиент Тогда
			ОбработкаПрерыванияПользователя();
			Состояние("Обработка: "+Рез.ссылка);			
		#КонецЕсли	
		ОбъектCML.ЗаписатьНачалоЭлемента("Скидка");
		
		//	Скидка=ПолучитьСкидкуНоменклатуры(ТекСтр.Модель,ТипСкидок,Дата,ТипЦен);
		
		
		
		ЗаписатьТекстовойУзел(ОбъектCML, "Код", Строка("sk_"+Рез.Ссылка.номер)); //юкод  Строка(Выборка.ссылка.уникальныйИдентификатор())
		ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", Строка(Рез.Ссылка.комментарий));
		ЗаписатьТекстовойУзел(ОбъектCML, "ДатаНачала", Строка(Рез.Ссылка.Дата));
		ЗаписатьТекстовойУзел(ОбъектCML, "ДатаОкончания", Строка(конецДня(Рез.Ссылка.Дата2)));

		
		//******************************************************************************
		
		
		ОбъектCML.ЗаписатьНачалоЭлемента("Скидки");
		Для каждого текстрока из рез.ссылка.Скидки цикл
			ОбъектCML.ЗаписатьНачалоЭлемента("Товар");
			                                                         //   grSSP-001182
			ЗаписатьТекстовойУзел(ОбъектCML, "ИдТовара", Строка(ТекСтрока.номенклатура.код));
			
			ЗаписатьТекстовойУзел(ОбъектCML, "Скидка", Строка(текстрока.скидка));
			//ЗаписатьТекстовойУзел(ОбъектCML, "Валюта", Строка("руб"));
			ОбъектCML.ЗаписатьКонецЭлемента(); //цена			
		конеццикла;
		//---------------------------------------------------------------------------------------------------------------------
		ОбъектCML.ЗаписатьКонецЭлемента(); //товары
		//******************************************************************************************************
		
		ОбъектCML.ЗаписатьНачалоЭлемента("Контрагенты");
		
		  Для каждого текстрока из рез.ссылка.контрагенты цикл
			ОбъектCML.ЗаписатьНачалоЭлемента("Контрагент");
			
			ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", Строка(текстрока.контрагент.наименование));
			
			ЗаписатьТекстовойУзел(ОбъектCML, "код", Строка(Текстрока.контрагент.ведущий.код));
			//ЗаписатьТекстовойУзел(ОбъектCML, "Валюта", Строка("руб"));
			ОбъектCML.ЗаписатьКонецЭлемента(); //контрагент			
		 конеццикла;
		//---------------------------------------------------------------------------------------------------------------------
		ОбъектCML.ЗаписатьКонецЭлемента(); //контрагенты
					
			
		//*************************************************************	
			
		
		ОбъектCML.ЗаписатьКонецЭлемента(); // товар
		
	КонецЦикла;
	
	
	//--------------------------------------------------------
	//   конец записи файла
	//--------------------------------------------------------
	
	
	// предложения
	ОбъектCML.ЗаписатьКонецЭлемента(); 
	
	// пакет предложений
	ОбъектCML.ЗаписатьКонецЭлемента(); 
	
	// ком инф.
	ОбъектCML.ЗаписатьКонецЭлемента(); 
	
	ОбъектCML.Закрыть();
	
	#Если Клиент Тогда
		Сообщить("Сформирован файл: "+ИмяФайлаВЫгрузки);
		//Сообщить("Выгрузка завершена.",СтатусСообщения.Информация);
		Сообщить(ТекущаяДата());
	#КонецЕсли
	
	
	//ЗаписатьВЛог("ОбменССайтом"," Интернет-магазин. Прайс выгружен!","");
	//крохин начало 30.11.2011
	//Константы.ДатаПоследнегоУдачногоОбменаССайтом.Установить(НачалоДня(ТекущаяДата()));	
	//крохин конец 30.11.2011
	
	
КонецПроцедуры
// нечаева 220422---


// тут 2 файла еще добавим для выгрузки.

//-----------------------------------------------------------------------------------------



Функция ПолучитьЦену(Ном,ТипЦЕн)
	
	Цена=0;
	
	Запрос=новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Модель,
	|	ЦеныНоменклатурыСрезПоследних.ТипЦен КАК ТипЦен,
	|	ЦеныНоменклатурыСрезПоследних.Прайс.Дата КАК ДатаПрайса,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ПОМЕСТИТЬ Цены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			{(&Дата2)},
	|			Прайс.Проведен
	|				И Прайс.Дата2 >= &Дата2 {(ТипЦен).*}) КАК ЦеныНоменклатурыСрезПоследних
	|ГДЕ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура В Иерархии (&ТекНом)
	|	И ЦеныНоменклатурыСрезПоследних.ТипЦен = &Тектипцен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Модель,
	|	ТипЦен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Цены.ДатаПрайса) КАК ДатаПрайса,
	|	Цены.Модель,
	|	Цены.ТипЦен
	|ПОМЕСТИТЬ Прайсы
	|ИЗ
	|	Цены КАК Цены
	|
	|СГРУППИРОВАТЬ ПО
	|	Цены.ТипЦен,
	|	Цены.Модель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Прайсы.Модель,
	|	Прайсы.ТипЦен,
	|	Цены.Цена
	|ИЗ
	|	Прайсы КАК Прайсы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цены КАК Цены
	|		ПО (Цены.Модель = Прайсы.Модель)
	|			И (Цены.ТипЦен = Прайсы.ТипЦен)
	|			И (Цены.ДатаПрайса = Прайсы.ДатаПрайса)  ";
	
	Запрос.УстановитьПараметр("ТекНом",Ном);
	Запрос.УстановитьПараметр("Тектипцен",ТипЦен);
	Запрос.УстановитьПараметр("Дата2",ТекущаяДата());
	
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Цена=Рез.Цена;
	КонецЕсли;	
	
	Возврат Цена;
	
КонецФункции		
//выгружать или нет - на сайт коллант
Функция ПроверитьВыгрузку(ТекНоменклатура)
	
	Выгружать=Ложь;
	
	
	Если (ТекНоменклатура.ВыгружатьВИнтернетМагазин = Перечисления.ВыгружатьНаСайт.Да) тогда
		Возврат Истина;
	Иначе
		Если ТекНоменклатура.ВыгружатьВИнтернетМагазин=Перечисления.ВыгружатьНаСайт.Нет Тогда
			Возврат Ложь;
		КонецЕсли;	
		
	КонецЕсли;	
	
	Выгружать1 = (ПолучитьРеквизитРодителя(ТекНоменклатура,"ВыгружатьВИнтернетМагазин") = Перечисления.ВыгружатьНаСайт.Да);
	Если Выгружать1=Истина ТОгда
		Возврат Истина;
	Иначе
		Если ТекНоменклатура.Родитель.ВыгружатьВИнтернетМагазин=Перечисления.ВыгружатьНаСайт.Нет Тогда
			Возврат Ложь;
		КонецЕсли;	
		
	КонецЕсли;	
	
	Выгружать2 = (ПолучитьРеквизитРодителя(ТекНоменклатура.Родитель,"ВыгружатьВИнтернетМагазин") = Перечисления.ВыгружатьНаСайт.Да);
	Если Выгружать2=Истина ТОгда
		Возврат Истина;
	Иначе
		Если ТекНоменклатура.Родитель.Родитель.ВыгружатьВИнтернетМагазин=Перечисления.ВыгружатьНаСайт.Нет Тогда
			Возврат Ложь;
		КонецЕсли;	
		
	КонецЕсли;
	
	Выгружать3 = (ПолучитьРеквизитРодителя(ТекНоменклатура.Родитель.Родитель,"ВыгружатьВИнтернетМагазин") = Перечисления.ВыгружатьНаСайт.Да);
	Если Выгружать3=Истина ТОгда
		Возврат Истина;
	Иначе
		Если ТекНоменклатура.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин=Перечисления.ВыгружатьНаСайт.Нет Тогда
			Возврат Ложь;
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат Выгружать;
	
КонецФункции

Функция ПолучитьСвойстваМодели(Модель)
	Запрос=Новый Запрос;
	Запрос.Текст="	
	|ВЫБРАТЬ	
	|	ВЫБОР
	|		КОГДА Объект=&Брэнд ТОГДА 1
	|		КОГДА Объект=&Модель ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК Уровень,
	|	Свойство,
	|	Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	Объект = &Модель ИЛИ Объект = &Брэнд
	|УПОРЯДОЧИТЬ ПО Уровень,Объект";	
	
	Свойства=Новый Структура;
	
	Запрос.УстановитьПараметр("Модель",Модель);
	Запрос.УстановитьПараметр("Брэнд",Модель.Родитель);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			КодСвойства=СтрЗаменить(Выборка.Свойство,"""","");	
			КодСвойства=СтрЗаменить(Выборка.Свойство," ","");
			
			Свойства.Вставить(КодСвойства,Выборка.Значение);		
		Исключение
			//Сообщить("Ошибочное свойство: "+Выборка.Свойство);
		КонецПопытки;		
	КонецЦикла;	
	
	Возврат Свойства;
КонецФункции //ПолучитьСвойстваНоменклатуры(Номенклатура) 

///////////////////////////////////////////////////////////////////////////////////////-------------------------------------------------------------------------------


Функция HTTPВыгрузитьНаСервер(СтруктураПараметровСайта, МассивПодкаталогов = Неопределено, ОжидатьЗавершенияИмпортаФайловСервером = Ложь,ТипСоединения = "catalog")
	
	
	Успешно    = Истина;
	
	ОтветСервера = "";
	Соединение = Неопределено;
	
	АдресДляРаботы = СтруктураПараметровСайта.АдресСкрипта + "?type=" + ТипСоединения; 
	
	СтрокаСообщенияПользователю = "";
	Успешно = ПроцедурыОбменаССайтом.HTTPВыполнитьАвторизациюДляСоединения(Соединение, СтруктураПараметровСайта, ОтветСервера, СтрокаСообщенияПользователю, ТипСоединения);
	Если Не ПустаяСтрока(СтрокаСообщенияПользователю) Тогда
		
		СообщитьОбОшибкеОбмена(СтрокаСообщенияПользователю, Истина);						
	КонецЕсли;
	
	Если Не Успешно Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	КукиИмя      	  = СтрПолучитьСтроку(ОтветСервера, 2);
	КукиЗначение 	  = СтрПолучитьСтроку(ОтветСервера, 3);
	ЗаголовкиЗапросов = "Cookie: " + КукиИмя + "=" + КукиЗначение;
	
	ОтобразитьСостояние("Запрос параметров обмена...");
	
	ОтветСервера = ПроцедурыОбменаССайтом.HTTPПолучитьДанныеССервера(Соединение, АдресДляРаботы + ПараметрЗапросаHTTP_Инициализация, ЗаголовкиЗапросов);
	
	Если ОтветСервера = Неопределено Тогда 
		СообщитьОбОшибкеОбмена("Не удалось получить параметры обмена с сервера.", Истина);
		Возврат Ложь;
	КонецЕсли;
	
	ZIPФайлыРазрешены = Ложь;
	ОграничениеРазмераФрагментаФайлаОбмена = 0;
	
	Если СтрЧислоСтрок(ОтветСервера) <> 2 тогда	
		СообщитьОбОшибкеОбмена("Не удалось прочитать ответ сервера. Параметры обмена не получены.", Истина);
		Возврат Ложь;
	КонецЕсли;
	
	ZIPФайлыРазрешены = СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера, 1))) = ОтветСервера_ZIPРазрешен;
	
	Попытка 
		ОграничениеРазмераФрагментаФайлаОбмена = Число(СтрЗаменить(СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера, 2))), ОтветСервера_ОграничениеРазмераФрагментаФайлаОбмена, ""));
	Исключение
		СообщитьОбИсключительнойОшибке(Истина);
		ОграничениеРазмераФрагментаФайлаОбмена = -1;
	КонецПопытки;	
	
	МассивИсходныхCMLФайлов = НайтиФайлы(мКаталогНаДиске, "*.xml");
	СписокФайловДляОтправки = ПолучитьСписокФайловДляОтправки(МассивПодкаталогов);
	
	Если ZIPФайлыРазрешены Тогда
		ОтобразитьСостояние("Подготовка ZIP-архива...");
		СписокФайловДляОтправки = ПодготовитьZIPАрхивы(СписокФайловДляОтправки);
	КонецЕсли;	
	
	Если ОграничениеРазмераФрагментаФайлаОбмена > 0 Тогда
		СписокФайловДляОтправки = РазделитьФайлыНаФрагменты(СписокФайловДляОтправки, ОграничениеРазмераФрагментаФайлаОбмена);
	КонецЕсли;	
	
	ВсегоФайлов = СписокФайловДляОтправки.Количество();
	
	Для Каждого ТекФайл Из СписокФайловДляОтправки цикл
		
		ОтобразитьСостояние("Идет отправка файла на сервер (" + Строка(СписокФайловДляОтправки.Индекс(ТекФайл) + 1) + " из " + Строка(ВсегоФайлов) + "): " + ТекФайл.Значение);
		
		ОтветСервера = HTTPОтправитьФайлНаСервер(ТекФайл.Значение, Соединение, АдресДляРаботы + ПараметрЗапросаHTTP_ПередачаФайла + ТекФайл.Представление, ЗаголовкиЗапросов);
		
		Если ZIPФайлыРазрешены Тогда
			Попытка
				УдалитьФайлы(ТекФайл.Значение);
			Исключение
			КонецПопытки;	
		КонецЕсли;	
		
		Если ОтветСервера = Неопределено Тогда
			СообщитьОбОшибкеОбмена("Не удалось получить ответ сервера. Файл не отправлен (" + ТекФайл.Значение + ").", Истина);
			Возврат Ложь;
		КонецЕсли;
		
		СостояниеОбмена = СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера,1)));
		
		Если СостояниеОбмена = ОтветСервера_АварийноеЗавершениеТекущейОперации Тогда
			
			СообщитьОбОшибкеОбмена("Произошла ошибка на стороне сервера. Файл не отправлен (" + ТекФайл.Значение + ").", Истина);
			СообщитьРасширенноеОписаниеОтветаСервера(ОтветСервера);
			Возврат Ложь;
			
		ИначеЕсли СостояниеОбмена = ОтветСервера_УспешноеЗавершениеТекущейОперации Тогда
			
			Если СтрЧислоСтрок(ОтветСервера) > 1 Тогда
				СообщитьПользователю("Получен расширенный статус успешного завершения сеанса", Истина, СтатусСообщения.Информация);
				СообщитьРасширенноеОписаниеОтветаСервера(ОтветСервера);	
			КонецЕсли;
			
		Иначе
			
			СообщитьОбОшибкеОбмена("Произошла ошибка на стороне сервера. Не получен статус завершения операции. Файл не отправлен (" + ТекФайл.Значение + ").", Истина);
			СообщитьРасширенноеОписаниеОтветаСервера(ОтветСервера);
			Возврат Ложь;
			
		КонецЕсли;		
		
	КонецЦикла;
	
	ИмпортУспешноЗавершен = Ложь;
	
	Если ОжидатьЗавершенияИмпортаФайловСервером Тогда
		
		Для Каждого ТекФайл Из МассивИсходныхCMLФайлов Цикл
			
			ИмпортПродолжается = Истина;
			ТекущееСостояние = "";
			
			Пока ИмпортПродолжается Цикл
				
				//ОбработкаПрерыванияПользователя();
				ИмпортПродолжается = Ложь;
				
				ОтобразитьСостояние("Ожидание окончания загрузки данных сервером: " + ТекущееСостояние);
				//Сообщить("Ожидание окончания загрузки данных сервером: " + ТекущееСостояние);
				ТекущееСостояние = "";
				
				ОтветСервера = ПроцедурыОбменаССайтом.HTTPПолучитьДанныеССервера(Соединение, АдресДляРаботы + ПараметрЗапросаHTTP_ИмпортФайлаСервером + ТекФайл.Имя, ЗаголовкиЗапросов);
				
				Если ОтветСервера = Неопределено Тогда 
					
					Успешно = Ложь;
					СообщитьОбОшибкеОбмена("Не удалось получить текущее состояние процесса обмена. Данные обмена отправлены, но не загружены.", Истина);
					
				ИначеЕсли СтрЧислоСтрок(ОтветСервера) = 0 Тогда
					Успешно = Ложь;
					СообщитьОбОшибкеОбмена("Не удалось прочитать данные о текущем состоянии процесса обмена. Данные обмена отправлены, но не загружены.", Истина);	
				Иначе
					
					СостояниеОбмена = СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера, 1)));
					Если СостояниеОбмена = ОтветСервера_АварийноеЗавершениеТекущейОперации Тогда
						Успешно = Ложь;
						СообщитьОбОшибкеОбмена("Произошла ошибка на стороне сервера.", Истина);
						СообщитьРасширенноеОписаниеОтветаСервера(ОтветСервера);
					ИначеЕсли СостояниеОбмена = ОтветСервера_УспешноеЗавершениеТекущейОперации Тогда
						ИмпортУспешноЗавершен = Истина;
					ИначеЕсли СостояниеОбмена = ОтветСервера_ВыполнениеТекущейОперации Тогда
						ТекущееСостояние = ТекущееСостояние + СтрПолучитьСтроку(ОтветСервера, 2);
						ИмпортПродолжается = Истина;
					Иначе
						Успешно = Ложь;
						СообщитьОбОшибкеОбмена("Произошла ошибка на стороне сервера. Получен неизвестный статус импорта.", Истина);
						СообщитьРасширенноеОписаниеОтветаСервера(ОтветСервера);
					КонецЕсли;
					
				КонецЕсли;					
				
			КонецЦикла;	//Импорт
			
			Если НЕ ИмпортУспешноЗавершен Тогда
				Прервать;
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЕсли;								
	
	Возврат Успешно;
	
КонецФункции	

Функция HTTPОтправитьФайлНаСервер(ПолноеИмяФайла, Соединение, ПараметрыЗапроса="", Заголовки="")
	
	ОтветСервера = Неопределено;
	ИмяФайлаОтвета = ПолучитьИмяВременногоФайла();
	
	Попытка
		Соединение.ОтправитьДляОбработки(ПолноеИмяФайла, СокрЛП(ПараметрыЗапроса), ИмяФайлаОтвета, СокрЛП(Заголовки));
	Исключение
		СообщитьОбИсключительнойОшибке(Истина, ОписаниеОшибки());
	КонецПопытки;	
	
	ФайлОтвета = Новый Файл(ИмяФайлаОтвета);
	
	Если ФайлОтвета.Существует() Тогда
		
		ТекстОтвета = Новый ТекстовыйДокумент();
		ТекстОтвета.Прочитать(ИмяФайлаОтвета);
		Если ТекстОтвета.КоличествоСтрок()>0 Тогда
			ОтветСервера = ТекстОтвета.ПолучитьТекст();	
		Иначе
			СообщитьПользователю("Отправка файла на сервер: Получен пустой ответ сервера.", Истина); 	
		КонецЕсли;	
		
	Иначе	
		СообщитьПользователю("Отправка файла на сервер: Ответ сервера не получен.", Истина); 
	КонецЕсли;	
	
	Попытка
		УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайлаОтвета);   
	Исключение
	КонецПопытки;
	
	Возврат ОтветСервера;	
	
КонецФункции	

Функция HTTPЗагрузитьССервера(СтруктураПараметровСайта, ТипСоединения, КоличествоОбработанныхДокументов)
	
	Успешно = Истина;
	ОтветСервера = "";
	Соединение = Неопределено;
	КоличествоОбработанныхДокументов = 0;
	
	АдресДляРаботы = СтруктураПараметровСайта.АдресСкрипта + "?type=" + ТипСоединения;
	
	СтрокаСообщенияПользователю = "";
	Успешно = ПроцедурыОбменаССайтом.HTTPВыполнитьАвторизациюДляСоединения(Соединение, СтруктураПараметровСайта, ОтветСервера, СтрокаСообщенияПользователю, ТипСоединения);
	Если Не ПустаяСтрока(СтрокаСообщенияПользователю) Тогда
		СообщитьОбОшибкеОбмена(СтрокаСообщенияПользователю, Ложь);
		//ЗаписатьВЛог("ОбменССайтом",СтрокаСообщенияПользователю,"Инф");
		//ЗаписатьВЛог("ОбменССайтом",""+СтруктураПараметровСайта.ИмяПользователя+" + "+СтруктураПараметровСайта.Пароль,"Инф");
		
	КонецЕсли;
	
	Если Не Успешно Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КукиИмя      	  = СтрПолучитьСтроку(ОтветСервера,2);
	КукиЗначение 	  = СтрПолучитьСтроку(ОтветСервера,3);
	ЗаголовкиЗапросов = "Cookie: " + КукиИмя + "=" + КукиЗначение;
	
	ОтобразитьСостояние("Загрузка данных с сервера...");
	ЗаписатьВЛог("b2b","Загрузка данных с сервера...","Инф");
	
	
	ИнформацияДляПользователя = "";
	ОтветСервера = ПроцедурыОбменаССайтом.HTTPПолучитьДанныеССервера(Соединение, АдресДляРаботы + ПараметрЗапросаHTTP_ПолучитьДанные, ЗаголовкиЗапросов, ИнформацияДляПользователя);
	Если Не ПустаяСтрока(ИнформацияДляПользователя) Тогда
		СообщитьПользователю(ИнформацияДляПользователя, Ложь);
		//ЗаписатьВЛог("ОбменССайтом",ИнформацияДляПользователя,"Инф");
	КонецЕсли;
	
	Если ОтветСервера = Неопределено Тогда 
		СообщитьОбОшибкеОбмена("Не удалось загрузить данные с сервера.", Ложь);
		ЗаписатьВЛог("b2b","Не удалось загрузить данные с сервера.","Инф");
		Возврат Ложь;
	КонецЕсли;
	
	СтрокаCML = "";
	
	Если Лев(ОтветСервера, 2) = "PK" Тогда
		СтрокаCML = РаспаковатьZIPАрхив(ОтветСервера);
	Иначе
		Если Лев(ОтветСервера, 5) = "<?xml" Тогда
			СтрокаCML = ОтветСервера;
		КонецЕсли;	
	КонецЕсли;						
	
	Если НЕ ЗначениеЗаполнено(СтрокаCML) Тогда
		СообщитьОбОшибкеОбмена("Не удалось прочитать данные, загруженные с сервера.", Ложь);
		Возврат Ложь;		
	КонецЕсли;
	
	ДеревоДокументов = РазобратьCML(СтрокаCML);
	
	Если ДеревоДокументов = Неопределено Тогда
		СообщитьОбОшибкеОбмена("Не удалось разобрать данные, загруженные с сервера.", Ложь);
		Возврат Ложь;		
	КонецЕсли;
	
	Успешно = ОбработатьДокументы(ДеревоДокументов, КоличествоОбработанныхДокументов);
	
	Если НЕ Успешно Тогда 
		СообщитьОбОшибкеОбмена("Не удалось обработать документы, загруженные с сервера.", Ложь);
		Возврат Ложь;
	КонецЕсли;
	
	ИнформацияДляПользователя = "";
	ПроцедурыОбменаССайтом.HTTPПолучитьДанныеССервера(Соединение, АдресДляРаботы + ПараметрЗапросаHTTP_УспешноеЗавершениеИмпорта, ЗаголовкиЗапросов, ИнформацияДляПользователя);
	Если Не ПустаяСтрока(ИнформацияДляПользователя) Тогда
		СообщитьПользователю(ИнформацияДляПользователя, Ложь);
	КонецЕсли;
	
	Возврат Успешно;
	
КонецФункции


// начальная процедура обмена данными.
// !!!!!!!!!!!!!!!!

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ УПРАВЛЕНИЯ ВЫГРУЗКОЙ ДАННЫХ

Процедура ВыгрузитьДанные() Экспорт
	
	//сообщить(ВыгружатьЦветаИМ);
	
//	ЗаписатьВЛог("b2b"," 1 - "+номерНастройки,"");
	//НомерНастройки = "033";
	
	мПринудительнаяПолнаяВыгрузка = ПроцедурыОбменаССайтом.ПолучитьФлагПринудительнойПолнойВыгрузки(НастройкаСсылка);
	мДатаФормирования = ТекущаяДата();
	мСтруктураИнформацииИсторииОбмена = ПолучитьСтруктуруИнформацииДляИстории();
	мСтруктураИнформацииИсторииОбмена.ДатаНачалаПоследнейВыгрузки = ТекущаяДата();
	
	мНомерВыгрузки = НомерНастройки;
	НастройкаСсылка= справочники.НастройкиОбменаССайтом.НайтиПоКоду(НомерНастройки);
	
	
	Если Настройкассылка.Пустая() Тогда
		ЗаписатьВЛог("b2b"," настройка не найдена - "+НомерНастройки,"Информация");
		возврат;
		
	КонецЕсли;
		
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкаСсылка); // заполяем параметры обработки данными.
	
	НачалоАдресаСкрипта = НастройкаСсылка.HTTPОбменАдресСайта;
	СтруктураАдреса = ПроцедурыОбменаССайтом.РазобратьАдресСайта(НачалоАдресаСкрипта);
	
	HTTPОбменПорт = СтруктураАдреса.HTTPПорт;
	HTTPОбменСервер = СтруктураАдреса.HTTPСервер;
	HTTPОбменЗащищенноеСоединение = СтруктураАдреса.HTTPЗащищенноеСоединение;
	НачалоАдресаСкрипта = СтруктураАдреса.HTTPАдресСкрипта;
	СтруктураИзменений=Неопределено;
	
	//	ЗаписатьВЛог("ОбменССайтом",""+HTTPОбменИмяПользователя+" + "+HTTPОбменПароль,"Инф");
	
	
	Если ВыгружатьТолькоИзменения Тогда
		СтруктураИзменений = ПолучитьВсеИзмененияИзПланаОбмена();
	КонецЕсли;
	
	
	Если ПустаяСтрока(КаталогВыгрузки) Тогда
		КаталогВыгрузки = КаталогВременныхФайлов(); //КаталогВременныхФайлов();
	Иначе
		ПоследнийСимвол = Сред(КаталогВыгрузки, СтрДлина(КаталогВыгрузки), 1);
		Если ПоследнийСимвол <> "\" Тогда
			КаталогВыгрузки = КаталогВыгрузки + "\";			
		КонецЕсли;
	КонецЕсли;
	
	мКаталогНаДиске = КаталогВыгрузки + мПодкаталогБезопасностиКаталогаВыгрузки+ "\";
	
	СоздатьКаталог(мКаталогНаДиске);
	
	ОчиститьКаталогНаДиске();
	
//	ЗаписатьВЛог("b2b"," 2 - ","");

	ФайлЗагрузки = мКаталогНаДиске + "\order.xml";
	
	Если ОбменТоварами Тогда 
		
		ТоварыУспешноВыгружены = ВыгрузитьТовары(СтруктураИзменений);  //СтруктураИзменений  //+++++
		
			
	Иначе
		ТоварыУспешноВыгружены = Истина;
	КонецЕсли;
	
//	ЗаписатьВЛог("b2b","3 - ","");
 	
	
	мСтруктураИнформацииИсторииОбмена.ДатаПоследнейВыгрузки = ТекущаяДата();
	мСтруктураИнформацииИсторииОбмена.РезультатПоследнейВыгрузки = ТоварыУспешноВыгружены; // И ЗаказыУспешноВыгружены;
	ЗаписатьИнформациюВПротоколОбмена(мСтруктураИнформацииИсторииОбмена);
	
	
	//ЗаписатьВЛог("ОбменССайтом"," Интернет-магазин. Загрузка закончена!","Инф");
	
	
КонецПроцедуры

//нечаева 22,04,22 ++

Функция КомандаЗагрузкиАкций(СтруктураПараметровСайта)

	ОтветСервера = Неопределено;
	ИмяФайлаОтвета = ПолучитьИмяВременногоФайла();
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".txt");
	
	АдресТ = "test.collant.ru" ;   
	попытка 
		Соединение = Новый HTTPСоединение(АдресТ,443,СтруктураПараметровСайта.ИмяПользователя,СтруктураПараметровСайта.Пароль,,,Новый ЗащищенноеСоединениеOpenSSL);  // логин  пароль сюда пропсиать
	исключение
		//Сообщить(ОписаниеОшибки());
	конецПопытки;
		
	команда = "/local/crons/import/sales.php?";   
		
	HTTPзапрос = новый HTTPзапрос();
	HTTPзапрос.АдресРесурса = Команда;
	
	// формируем файл для отправки
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".txt");
		
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json");
	ЗаголовокHTTP.Вставить("Accept", "text/xml");
	ЗаголовокHTTP.Вставить("Accept-Language", "ru");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("Content-Language", "ru");
	ЗаголовокHTTP.Вставить("Content-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("Host", "test.collant.ru");
	
	HTTPзапрос.Заголовки = ЗаголовокHTTP;

	
	попытка
		Соединение.Получить(HTTPзапрос, ИмяВременногоФайла);   
	исключение
		СообщитьПользователю("Ошибка отправки Файла по количеству товаров. "+ОписаниеОшибки(),истина);
	конецПопытки;
		
	ФайлОтвета = Новый Файл(ИмяВременногоФайла);
	ОтветСервера = неопределено;
	
	Если ФайлОтвета.Существует() Тогда
		
		ТекстОтвета = Новый ТекстовыйДокумент();
		ТекстОтвета.Прочитать(ИмяВременногоФайла);
		Если ТекстОтвета.КоличествоСтрок()>0 Тогда
			ОтветСервера = ТекстОтвета.ПолучитьТекст();	
		Иначе
			// если пустой ответ, то все прогрузилось
			//СообщитьПользователю("Файл по количеству товаров отправлен.",истина);
		КонецЕсли;	
		
	Иначе	
		//СообщитьПользователю("Отправка файла на сервер: Ответ сервера не получен.", Истина); 
	КонецЕсли;	
	//сообщить(ОтветСервера);
	
	
	//
	//
	//Попытка
	//	УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайлаОтвета);   
	//Исключение
	//КонецПопытки;

	возврат ОтветСервера;	
	

конецФункции

//нечаева 21,09,22++
Процедура СкопироватьВ_архив(ДопИмя="")

	ИмяФайла = ""+Год(ТекущаяДата())+"_"+месяц(ТекущаяДата())+"_"+День(ТекущаяДата())+"_"+Час(ТекущаяДата())+"_"+минута(ТекущаяДата());
    НовыйАрхив = Новый ЗаписьZipФайла(
        "\\srvfiles\b2b_files\"+ДопИмя+ИмяФайла+".zip",
        "", 
        "архив изменений данных для б2б товары", // комментарий к архиву
        МетодСжатияZIP.Сжатие, 
		УровеньСжатияZIP.Оптимальный,
        МетодШифрованияZIP.Zip20
    );
 
  
	//НовыйАрхив.Добавить(
	//    "c:\readme.txt" // указываем полный путь к файлу
	//);
 
     
     // А что если в "c:\work" находится другая папка, в которой
    // в свою очередь тоже есть txt файлы. Чтобы обработать
    // и эти файлы наш предыдущий пример следует изменить вот так:    
 
    НовыйАрхив.Добавить(
        мКаталогНаДиске+"\*.xml", // указываем маску к файлам
        РежимСохраненияПутейZIP.СохранятьОтносительныеПути,
        РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно
    );
       
    Попытка   
		НовыйАрхив.Записать();
	Исключение
	КонецПопытки;
	
	
	
конецПроцедуры
//нечаева 21,09,22--


//------------------------------------------------------------------------------------------------------------------


Процедура ВыгрузитьДанныеНаСайт() Экспорт

	//НомерНастройки = "033"; 
	//ЗаписатьВЛог("b2b"," Интернет-магазин. Начало выгрузки!","");
	
	//СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	//ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом Тогда        
	//	ЗаписатьВЛог("b2b","Отмена выполнения. Задача: Обмен остатками. Автообмен разрешен для базы: """+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
	//	Возврат;
	//КонецЕсли;
	
	
	мПринудительнаяПолнаяВыгрузка = ПроцедурыОбменаССайтом.ПолучитьФлагПринудительнойПолнойВыгрузки(НастройкаСсылка);
	мДатаФормирования = ТекущаяДата();
	мСтруктураИнформацииИсторииОбмена = ПолучитьСтруктуруИнформацииДляИстории();
	мСтруктураИнформацииИсторииОбмена.ДатаНачалаПоследнейВыгрузки = ТекущаяДата();
	мНомерВыгрузки = НомерНастройки;
	НастройкаСсылка= справочники.НастройкиОбменаССайтом.НайтиПоКоду(НомерНастройки);
	
	
	Если Настройкассылка.Пустая() Тогда
		ЗаписатьВЛог("b2b"," настройка не найдена - "+НомерНастройки,"Информация");
		возврат;
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкаСсылка); // заполяем параметры обработки данными.
	
	НачалоАдресаСкрипта = НастройкаСсылка.HTTPОбменАдресСайта;
	СтруктураАдреса = ПроцедурыОбменаССайтом.РазобратьАдресСайта(НачалоАдресаСкрипта);
	
	HTTPОбменПорт = СтруктураАдреса.HTTPПорт;
	HTTPОбменСервер = СтруктураАдреса.HTTPСервер;
	HTTPОбменЗащищенноеСоединение = СтруктураАдреса.HTTPЗащищенноеСоединение;
	НачалоАдресаСкрипта = СтруктураАдреса.HTTPАдресСкрипта;
	СтруктураИзменений=Неопределено;
	
	//	ЗаписатьВЛог("ОбменССайтом",""+HTTPОбменИмяПользователя+" + "+HTTPОбменПароль,"Инф");
	
	
	Если ВыгружатьТолькоИзменения Тогда
		СтруктураИзменений = ПолучитьВсеИзмененияИзПланаОбмена();
	КонецЕсли;
	
	
	Если ПустаяСтрока(КаталогВыгрузки) Тогда
		КаталогВыгрузки = КаталогВременныхФайлов(); //КаталогВременныхФайлов();
	Иначе
		ПоследнийСимвол = Сред(КаталогВыгрузки, СтрДлина(КаталогВыгрузки), 1);
		Если ПоследнийСимвол <> "\" Тогда
			КаталогВыгрузки = КаталогВыгрузки + "\";			
		КонецЕсли;
	КонецЕсли;
	
	мКаталогНаДиске = КаталогВыгрузки + мПодкаталогБезопасностиКаталогаВыгрузки+ "\";
	
	СоздатьКаталог(мКаталогНаДиске);
	
	ОчиститьКаталогНаДиске();
	
	ФайлЗагрузки = мКаталогНаДиске + "\order.xml";
	
	Если ОбменТоварами Тогда 
		
		ТоварыУспешноВыгружены = ВыгрузитьТовары(СтруктураИзменений);  //СтруктураИзменений  //+++++
		
		
	Иначе
		ТоварыУспешноВыгружены = Истина;
	КонецЕсли;
	
	//нечаева 11,01,23 ++
	СкопироватьВ_архив("Ostatki_price\"); 
	//нечаева 11,01,23 -- 

	
	//перенесем файлы на фтп ,потом 4 было
	//пп = 0;
	//пока ПП<=4 цикл
	//	
	//	ПроцедурыОбменаССайтом.СкопироватьНаFTP(""+мКаталогНаДиске+МассивЗнИм[пп],МассивЗнИм[пп],"catalog");
	//	пп=пп+1;
	//	
	//конеццикла;
	//
	
		
	//перенесем файлы на фтп, нечаева 18,01,23+++
	АдресФ = НастройкаСсылка.FTPОбменАдресСайта;
	ЛогинФ = НастройкаСсылка.FTPОбменЛогин;
	ПарольФ = НастройкаСсылка.FTPОбменПароль;
	
	Если АдресФ<>"" и ЛогинФ<>"" Тогда
		
		пп = 0;
		пока ПП<=4 цикл
					
			ПроцедурыОбменаССайтом.СкопироватьНаFTP(""+мКаталогНаДиске+МассивЗнИм[пп],МассивЗнИм[пп],"catalog",АдресФ,ЛогинФ,ПарольФ,"b2b");
			
			пп=пп+1;
			
		конеццикла;
	иначе
		//перенесем файлы на фтп ,потом 4 // тут берем прошитый пароль -логин для б2б
		пп = 0;
		пока ПП<=4 цикл
			
			ПроцедурыОбменаССайтом.СкопироватьНаFTP(""+мКаталогНаДиске+МассивЗнИм[пп],МассивЗнИм[пп],"catalog");
			пп=пп+1;
			
		конеццикла;

	КонецЕсли;

	
	СтруктураПараметровСайта = ПроцедурыОбменаССайтом.ПолучитьСтруктуруПараметровДляСоединения(ЭтотОбъект);

	// выполним команду на загрузку файлов товаров
	//	состояние("Выполняем команду");
	//КомандаЗагрузки(СтруктураПараметровСайта);
	
	// нечаева 09,12,21+++
	//-----------------------------------------------------
	// теперь акции, они по другому грузятся.
	////****************************-----------------------------------------------------------------
	
	// Смирнов М.Ю. 25.06.2025 WEB-3352 начало
	//ИмяФайлаВыгрузки	 = мКаталогНаДиске + "\promo.xml";
	//Группы = неопределено;
	//
	//ОчиститьКаталогНаДиске(); 
	//
	//ВыгрузитьАкции(ИмяФайлаВыгрузки,Группы);
	//
	//
	//// очистим папку, выгрузим на второе фтп
	//
	////нечаева 11,01,23 ++
	//СкопироватьВ_архив("Promo\"); 
	////нечаева 11,01,23 -- 

	//
	//Если АдресФ<>"" и ЛогинФ<>"" Тогда
	//	
	//	ПроцедурыОбменаССайтом.СкопироватьНаFTP(ИмяФайлаВыгрузки,"promo.xml","promo",АдресФ,ЛогинФ,ПарольФ,"b2b");
	//иначе
	//	//перенесем файлы на фтп ,потом 4 // тут берем прошитый пароль -логин для б2б
	//	ПроцедурыОбменаССайтом.СкопироватьНаFTP(ИмяФайлаВыгрузки,"promo.xml","promo");
	//
	//КонецЕсли;
    // Смирнов М.Ю. 25.06.2025 WEB-3352 конец
	
	//ПроцедурыОбменаССайтом.СкопироватьНаFTP(ИмяФайлаВыгрузки,"promo.xml","promo");
	// теперь вторую команду на загрузку акций
	//КомандаЗагрузкиАкций(СтруктураПараметровСайта);
	//
	//// нечаева 09,12,21---
	//////***************************--------------------------------------------------------------------------------------------------
	мСтруктураИнформацииИсторииОбмена.ДатаПоследнейВыгрузки = ТекущаяДата();
	мСтруктураИнформацииИсторииОбмена.РезультатПоследнейВыгрузки = ТоварыУспешноВыгружены; // И ЗаказыУспешноВыгружены;
	ЗаписатьИнформациюВПротоколОбмена(мСтруктураИнформацииИсторииОбмена);
	
	
	ЗаписатьВЛог("b2b"," Выгрузка на фтп закончена!","Инф");
	// -----------------------------------------------------------------------------------------------
	// нечаева 060422  загрузка галкок по акциям в 1с. докуент установка скидок контрагентов.
	// 10,07,23++ новый формат теперь нечаева
	//ЗагрузитьСогласиеПромоАкции();
		
	//// нечаева 0604022 ---
	
	
КонецПроцедуры

// нечаева 0604022 +++
// это к нам загрузка , в документ

Функция КомандаЗагрузкиСогласиеПромо(СтруктураПараметровСайта) Экспорт 

	ОтветСервера = Неопределено;
	ИмяФайлаОтвета = ПолучитьИмяВременногоФайла();
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".txt");
	
	АдресТ = "test.collant.ru" ;   
	попытка 
		Соединение = Новый HTTPСоединение(АдресТ,443,СтруктураПараметровСайта.ИмяПользователя,СтруктураПараметровСайта.Пароль,,,Новый ЗащищенноеСоединениеOpenSSL);  // логин  пароль сюда пропсиать
	исключение
		//Сообщить(ОписаниеОшибки());
	конецПопытки;
	//https://collant.prominado.dev/local/crons/export/promos.php?from=01.01.2021 	
	команда = "/local/crons/export/promos.php?from=01.01.2021";   
		
	HTTPзапрос = новый HTTPзапрос();
	HTTPзапрос.АдресРесурса = Команда;
	
	// формируем файл для отправки
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".xml");
		
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "text/xml;charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept", "text/xml");
	ЗаголовокHTTP.Вставить("Host", "test.collant.ru");
	
	ЗаголовокHTTP.Вставить("Accept-Language", "ru");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("Content-Language", "ru");
	ЗаголовокHTTP.Вставить("Content-Charset", "utf-8");
	//ЗаголовокHTTP.Вставить("Content-type", "application/json");
	
		
	HTTPзапрос.Заголовки = ЗаголовокHTTP;

	//Ответ = Соединение.Получить(HTTP_запрос);  // ИмяВыходногоФайла
	
	попытка
		Соединение.Получить(HTTPзапрос, ИмяВременногоФайла);   
	исключение
		СообщитьПользователю("Ошибка отправки Файла по количеству товаров. "+ОписаниеОшибки(),истина);
	конецПопытки;
		
	ФайлОтвета = Новый Файл(ИмяВременногоФайла);
	ОтветСервера = неопределено;
	
	Если ФайлОтвета.Существует() Тогда
		
		ТекстОтвета = Новый ТекстовыйДокумент();
		ТекстОтвета.Прочитать(ИмяВременногоФайла, КодировкаТекста.UTF8);
		Если ТекстОтвета.КоличествоСтрок()>0 Тогда
			ОтветСервера = ТекстОтвета.ПолучитьТекст();	
			//сообщить(ИмяВременногоФайла);
		Иначе
			// если пустой ответ, то все прогрузилось
			//СообщитьПользователю("Файл по количеству товаров отправлен.",истина);
		КонецЕсли;	
		
	Иначе	
		//СообщитьПользователю("Отправка файла на сервер: Ответ сервера не получен.", Истина); 
	КонецЕсли;	

	//сообщитьПользователю(ответсервера);
	
	//
	//
	//Попытка
	//	УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайлаОтвета);   
	//Исключение
	//КонецПопытки;

	возврат ИмяВременногоФайла;	
	

конецФункции

Процедура ЗагрузитьСогласиеПромоАкции() Экспорт
	
	возврат; //10,07,23
	СтруктураПараметровСайта = ПроцедурыОбменаССайтом.ПолучитьСтруктуруПараметровДляСоединения(ЭтотОбъект);
	ИмяПутиОтвета = КомандаЗагрузкиСогласиеПромо(СтруктураПараметровСайта);
	
	
	///------------------------------------------------------------
	// обработка и загрузка документа акции
	ТЗЗагрузки = Новый ТаблицаЗначений;
	
	 // максимальная длина строки - 20 символов
    КвалификаторыСтроки = Новый КвалификаторыСтроки(20);
    ОписаниеСтроки = Новый ОписаниеТипов("Строка", ,КвалификаторыСтроки);
	
	ТЗЗагрузки.Колонки.Добавить("Акция", ОписаниеСтроки);
	ТЗЗагрузки.Колонки.Добавить("Контрагент", ОписаниеСтроки);
	
	Файл = Новый ЧтениеXML;
	//Путь = "C:\Users\nechaeva\Desktop\Работа с заказми битрикс\confirmSales.xml";
	Путь =  ИмяПутиОтвета;
	Попытка
		Файл.ОткрытьФайл(Путь);
	Исключение
		//сообщить("Ошибка чтения файла");
		возврат;
	КонецПопытки;
	
	
	Пока Файл.Прочитать() Цикл
		
		Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Файл.ЛокальноеИмя = "Акция" тогда
			СтрокаТаблицы = ТЗЗагрузки.Добавить();
		КонецЕсли;
		
		Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Файл.ЛокальноеИмя = "КодПользователя" тогда
			файл.Прочитать(); 
			НомерК = Файл.Значение;
			СтрокаТаблицы.Контрагент = НомерК;
		КонецЕсли;
		
		Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Файл.ЛокальноеИмя = "КодАкции" тогда
			файл.Прочитать(); 
			Номер = Файл.Значение;
			СтрокаТаблицы.Акция = Номер;
		КонецЕсли;
		
	КонецЦикла;		
	// выберем различные документы акции, и потом по ним будем проставлять галки	
	ТЗАкций = новый таблицаЗначений;
	//ТЗАкций.Колонки.Добавить("Акция");
	ТЗАкций = ТЗЗагрузки.Скопировать();
	ТЗАкций.свернуть("Акция");
	
	Для каждого ТекСтрокаАкция из ТЗАкций цикл
		
		ТекКодАкции = ТекСтрокаАкция.Акция;
		ТекКод = Сред(ТекКодАкции,4,СтрДлина(ТекКодАкции)-3);
		// выберем всех контаргентов оттуда;
		
		
		ТЗ2  = Новый ТаблицаЗначений;
		ТЗ2.Колонки.Добавить("Акция", ОписаниеСтроки);
		ТЗ2.Колонки.Добавить("Контрагент", ОписаниеСтроки);
		ТЗ2.Колонки.Добавить("Родитель", ОписаниеСтроки);
		
		Запрос = Новый Запрос;
		ДанныеСкладов=Неопределено;
		МВТ = Новый МенеджерВременныхТаблиц;
		Запрос.МенеджерВременныхТаблиц = МВТ;
		Запрос.Текст  = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗ2.Акция КАК Акция,
		|	ТЗ2.Контрагент
		|ПОМЕСТИТЬ ТЗ2
		|ИЗ
		|	&ТЗ2 КАК ТЗ2
		|ГДЕ
		|	ТЗ2.Акция = &ТекАкция";
		Запрос.УстановитьПараметр("ТекАкция",ТекКодАкции);
		Запрос.УстановитьПараметр("ТЗ2", ТЗЗагрузки);
		Запрос.Выполнить();
		
		Запрос.Текст="ВЫБРАТЬ
		|	ТЗ2.акция КАК акция,
		|	ТЗ2.контрагент
		|ИЗ
		|	ТЗ2 КАК ТЗ2
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контрагент";
		РезНом=Запрос.Выполнить().Выгрузить();

		ТекДок = документы.УстановкаСкидокПоКонтрагентам.НайтиПоНомеру(ТекКод, НачалоГОда(ТекущаяДата()));
		
		Если Текдок = документы.УстановкаСкидокПоКонтрагентам.ПустаяСсылка() Тогда
			продолжить;
		КонецЕсли;
		//--------------------------------------
		НачатьТранзакцию();
		ТО = ТекДок.ПолучитьОбъект();
		естьИзменения= ложь;
		// тут контрагент ведущий, проставим по всем его подконтрагентам.
		
		Для каждого ТекСтрока из Резном цикл
			
			ТКонтрагент = Справочники.Контрагенты.НайтиПоКоду(Текстрока.контрагент);
			
		//	сообщить(ТКонтрагент);
			// это ведущий по акции, по нему найдем подчиненных и по ним по всем проставим 
			СписокПодчиненныхКонтрагентов = ВсеПодчиненныеКонтрагенты(ТКонтрагент.Код);
			Если СписокПодчиненныхКонтрагентов<> неопределено тогда
							
				Для каждого текКонтр из СписокПодчиненныхКонтрагентов цикл
					
				//	сообщить(текКонтр.ссылка);
					
					НайденнаяСтрока = ТО.Контрагенты.Найти(текКонтр.ссылка,"контрагент");
					Если НайденнаяСтрока <> Неопределено и НайденнаяСтрока.согласован = ложь  Тогда
						НайденнаяСтрока.согласован = истина;
						естьИзменения=истина; //сообщить("1");

					КонецЕсли;
				КонецЦикла;
				
			конецЕсли;
		КонецЦикла;
		
		Если ЕстьИзменения тогда
			ТО.Записать();
			ЗафиксироватьТранзакцию();
		иначе
			ОтменитьТранзакцию();
		конецЕсли;
				
	КонецЦикла;	
	
	//Сообщить("Акции прогружены");
	пп=1;
		
КонецПроцедуры
	
функция ВсеПодчиненныеКонтрагенты(ВедущийКонтрагент) Экспорт
	
	 Запрос = новый запрос;
	 Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |	Контрагенты.Ссылка КАК Ссылка
	                |ИЗ
	                |	Справочник.Контрагенты КАК Контрагенты
	                |ГДЕ
	                |	Контрагенты.Ведущий.Код = &Текконтр";
	 
	 запрос.УстановитьПараметр("Текконтр",ВедущийКонтрагент); 
	 
	 
	 Рез = Запрос.Выполнить().Выгрузить();
	
	 возврат рез;
	
КонецФункции	
// нечаева 0604022 ---

//------------------------------------------------------------------------------------------------------------------




//процедура СкопироватьНаFTP(ИмяФайла,КраткоеИмя,ИмяПапкиНаСервере="catalog")
//	//----------------------------------------------
//	//	 переносим автоматом на их фтп - сервер
//	//----------------------------------------------
//	
//	
//	Попытка
//		 
//		//Сервер=Новый FTPСоединение("80.78.249.244:22",,"serptop","cruelty-INNING-sphinx"); 
//		
//		//Сервер=Новый FTPСоединение("80.78.249.244",,"collant-1c","3A4m7R0y"); 
//		
//			
//		Сервер=Новый FTPСоединение("212.109.217.46",,"1c_collant","pB4lB6fK5hxC5b"); 
//		
//	Исключение
//		КритичОшибки.Добавить("Файл прайс листа не передан на ФТП"+ОписаниеОшибки());
//		//сообщить("Файл прайс листа не передан на ФТП"+ОписаниеОшибки());
//		//Если КритичОшибки.Количество()>0 Тогда
//		//	СообщитьКритОшибки();
//		//КонецЕсли;	
//		Возврат;
//	КонецПопытки;
//			
//	//// удаляем старый прайс-лист)
//	//Попытка
//	//	//Сервер.Удалить("/Price/"+Имя);  //+++
//	//Исключение
//	//КонецПопытки;
//	
//	Попытка
//		Сервер.Записать(ИмяФайла,"/"+ИмяПапкиНаСервере+"/"+КраткоеИмя);
//	Исключение
//		КритичОшибки.Добавить("Файл прайс листа не передан на ФТП  "+ОписаниеОшибки() );
//	КонецПопытки;
//	
//		
//	//Если КритичОшибки.Количество()>0 Тогда
//	//	СообщитьКритОшибки();
//	//КонецЕсли;	
//		
//	Сервер=Неопределено;
//		
//	//Сообщить("файл "+КраткоеИмя+ " выгружен на фтп");		
//КонецПроцедуры

//----------------------------------------------
Функция КомандаЗагрузки(СтруктураПараметровСайта)

	ОтветСервера = Неопределено;
	ИмяФайлаОтвета = ПолучитьИмяВременногоФайла();
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".txt");
	
	АдресТ = "test.collant.ru" ;   
	попытка 
		Соединение = Новый HTTPСоединение(АдресТ,443,СтруктураПараметровСайта.ИмяПользователя,СтруктураПараметровСайта.Пароль,,,Новый ЗащищенноеСоединениеOpenSSL);  // логин  пароль сюда пропсиать
	исключение
		//Сообщить(ОписаниеОшибки());
	конецПопытки;
		
	команда = "local/crons/import/catalog.php?";   
		
	HTTPзапрос = новый HTTPзапрос();
	HTTPзапрос.АдресРесурса = Команда;
	
	// формируем файл для отправки
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".txt");
		
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json");
	ЗаголовокHTTP.Вставить("Accept", "text/xml");
	ЗаголовокHTTP.Вставить("Accept-Language", "ru");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("Content-Language", "ru");
	ЗаголовокHTTP.Вставить("Content-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("Host", "test.collant.ru");
	
	HTTPзапрос.Заголовки = ЗаголовокHTTP;

	//Ответ = Соединение.Получить(HTTP_запрос);  // ИмяВыходногоФайла
	
	попытка
		Соединение.Получить(HTTPзапрос, ИмяВременногоФайла);   
	исключение
		СообщитьПользователю("Ошибка отправки Файла по количеству товаров. "+ОписаниеОшибки(),истина);
	конецПопытки;
		
	ФайлОтвета = Новый Файл(ИмяВременногоФайла);
	ОтветСервера = неопределено;
	
	Если ФайлОтвета.Существует() Тогда
		
		ТекстОтвета = Новый ТекстовыйДокумент();
		ТекстОтвета.Прочитать(ИмяВременногоФайла);
		Если ТекстОтвета.КоличествоСтрок()>0 Тогда
			ОтветСервера = ТекстОтвета.ПолучитьТекст();	
		Иначе
			// если пустой ответ, то все прогрузилось
			//СообщитьПользователю("Файл по количеству товаров отправлен.",истина);
		КонецЕсли;	
		
	Иначе	
		//СообщитьПользователю("Отправка файла на сервер: Ответ сервера не получен.", Истина); 
	КонецЕсли;	
//	сообщить(ОтветСервера);
	//
	//
	//Попытка
	//	УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайлаОтвета);   
	//Исключение
	//КонецПопытки;

	возврат ОтветСервера;	
	

конецФункции
//------------------------------------------------------------------------------------------------------------------


Процедура ОчиститьКаталогНаДиске()
	Попытка
		УдалитьФайлы(мКаталогНаДиске, "*.*");  
		
	Исключение
		СообщитьОбИсключительнойОшибке(Истина, "Не удалось очистить каталог обмена! (" + мКаталогНаДиске + ")");
	КонецПопытки;	
КонецПроцедуры	

//СтруктураИзменений
Функция ВыгрузитьТовары(СтруктураИзменений)
	
//	ЗаписатьВЛог("b2b"," 2 - выгрузить товары ","");

	Если НЕ ОпределитьМожноВыгрузитьТовары() Тогда
		
		СообщитьПользователю("Выгрузка товаров не произведена.", Истина);
		Возврат Истина;
		
	КонецЕсли;
	
	HTTPОбменАдресСкрипта = НачалоАдресаСкрипта;
	//ЗаписатьВЛог("ОбменССайтом"," Интернет-магазин. Начало выгрузки на диск!","");
	
	ВыгрузитьТоварыВКаталогНаДиске(СтруктураИзменений);   //СтруктураИзменений
	
	//ЗаписатьВЛог("ОбменССайтом"," Интернет-магазин. Окончание выгрузки на диск!","");
	
	СообщениеПользователю = "";
	
	СообщитьПользователю(СообщениеПользователю, Истина);
	
	Успешно = Истина;				  
	
	//Если ВыгружатьНаСайт   Тогда
	//	//ЗаписатьВЛог("ОбменССайтом"," Интернет-магазин. Начало выгрузки на сайт!","");
	//	
	//	Успешно = ВыгрузитьКаталогПредложенияНаСайт();			//++-++
	//	ЗаписатьВЛог("ОбменССайтом"," Интернет-магазин. Окончание выгрузки на сайт!","");
	//	
	//КонецЕсли;
	
	Если Успешно Тогда
		//
		СообщитьПользователю("Выгрузка товаров успешно завершена", Истина);
		
	Иначе
		СообщитьПользователю("Выгрузка товаров завершена с ошибками!!!", Истина)
	КонецЕсли;
	
	Возврат Успешно;
	
КонецФункции

Процедура ВыгрузитьТоварыВКаталогНаДиске(СтруктураИзменений) 
	
	// очистка логирования старых данных , храним только за неделю
	// нечаева 17,01,2022++
	попытка
		ПроцедурыОбменаССайтом.ОтборИОчисткаРегистраСведений("ЛогиОбменаССайтомb2bЦены");
		ПроцедурыОбменаССайтом.ОтборИОчисткаРегистраСведений("ЛогиОбменаССайтомb2bОстатки");
	исключение
	КонецПопытки;
	// нечаева 17,01,2022---
	
	
	
	Отказ = Ложь;
	//	ЗаписатьВЛог("b2b"," 5 - выгрузить товары в каталог на диске ","");

	ИндексФайлаОбменаСтрокой = "";
	ИмяФайлаЦен	 = мКаталогНаДиске + "\prices" + ИндексФайлаОбменаСтрокой + ".xml";
	ИмяФайлаОстатков	 = мКаталогНаДиске + "\rest" + ИндексФайлаОбменаСтрокой + ".xml";
	ИмяФайлаВыгрузки	 = мКаталогНаДиске + "\promo" + ИндексФайлаОбменаСтрокой + ".xml";

		
	
	Группы=Новый Массив;
	// Омса аттива
	Группы.Добавить(Справочники.Номенклатура.НайтиПоКоду("SNL-113718"));
	
	
	
	Если ВыгружатьТолькоИзменения Тогда
		
		Группы=СтруктураИзменений.Товары;
		
	Иначе
		
		Если НЕ НастройкаСсылка.Пустая() Тогда
			
			// заполняем список товаров
			МассивНом= Новый Массив();
			Для каждого Текстр из НастройкаСсылка.Каталоги цикл
				МассивНом.Добавить(ТекСтр.Товар);
			КонецЦикла;
			
			Группы=МассивНом;
			
		КонецЕсли;
	КонецЕсли;	
	
	ВыгрузитьЦены(ИмяФайлаЦен,Группы);
	// нечаева 11,07,23++ отдельно выгрузили
    //ВыгрузитьОстатки(ИмяФайлаОстатков,Группы);
	
	////ВыгрузитьАкции(ИмяФайлаВыгрузки,Группы);
	
	пп=1;	
	
КонецПроцедуры

// главная процедура.
Функция ВыгрузитьКаталогПредложенияНаСайт()
	
	ЗаписатьВЛог("ОбменССайтом"," Интернет-магазин. Начало загрузки данных на сайт!","");
	
	СтруктураПараметровСайта = ПроцедурыОбменаССайтом.ПолучитьСтруктуруПараметровДляСоединения(ЭтотОбъект);
	
	МассивПодкаталогов = Новый Массив;
	Если ВыгружатьКартинки ИЛИ ВыгружатьФайлы Тогда
		МассивПодкаталогов.Добавить(мПодкаталогФайлов);
	КонецЕсли;	
	
	Успешно = HTTPВыгрузитьНаСервер(СтруктураПараметровСайта, МассивПодкаталогов, Истина, "catalog");
	
	
	
	//ОчиститьКаталогНаДиске();	
	
	Возврат Успешно;
	
КонецФункции	

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ УПРАВЛЕНИЯ ПРОФИЛЯМИ (НАСТРОЙКАМИ)

Функция ОпределитьМожноВыгрузитьТовары()
	
	ЕстьКаталогВыгрузки   = ЗначениеЗаполнено(КаталогВыгрузки);
	ЕстьСайт			  = ЗначениеЗаполнено(HTTPОбменСервер);
	
	Если ВыгружатьНаСайт Тогда
		Возврат ЕстьСайт;
	Иначе
		Возврат ЕстьКаталогВыгрузки;
	КонецЕсли;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ОБРАБОТКИ ФАЙЛОВ


Функция РаспаковатьZIPАрхив(СтрокаZIP)
	
	СтрокаСодержимого = "ZIP_ERROR";
	
	ИмяФайла    = ПолучитьИмяВременногоФайла("zip");
	ИмяКаталога = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор);
	СоздатьКаталог(ИмяКаталога);
	
	СтрокаВФайл = Новый ТекстовыйДокумент;
	СтрокаВФайл.УстановитьТекст(СтрокаZIP);
	Попытка
		СтрокаВФайл.Записать(ИмяФайла);
	Исключение
	КонецПопытки;
	
	ЧтениеZIP = Новый ЧтениеZIPФайла(ИмяФайла);
	ЧтениеZIP.ИзвлечьВсе(ИмяКаталога);
	ЧтениеZIP.Закрыть();
	
	РаспакованныеФайлы = НайтиФайлы(ИмяКаталога, "*.xml");
	
	Если РаспакованныеФайлы.Количество() = 1 Тогда
		СтрокаИзФайла 	  = Новый ТекстовыйДокумент;
		СтрокаИзФайла.Прочитать(РаспакованныеФайлы[0].ПолноеИмя);
		СтрокаСодержимого = СтрокаИзФайла.ПолучитьТекст();
	КонецЕсли;
	
	Попытка
		УдалитьФайлы(ИмяФайла);
		УдалитьФайлы(ИмяКаталога);
	Исключение
	КонецПопытки;
	
	Возврат СтрокаСодержимого;
	
КонецФункции	

Функция РазделитьФайлыНаФрагменты(СписокФайлов, ОграничениеРазмераФрагмента)
	
	НовыйСписокФайлов = Новый СписокЗначений;
	Для Каждого ТекФайл Из СписокФайлов цикл
		
		ФайлНаДиске = Новый Файл(ТекФайл.Значение);
		Если ФайлНаДиске.Размер() > ОграничениеРазмераФрагмента Тогда
			МассивФрагментов = РазделитьФайл(ФайлНаДиске.ПолноеИмя, ОграничениеРазмераФрагмента);
			Для Каждого НовыйФайл Из МассивФрагментов Цикл
				НовыйСписокФайлов.Добавить(НовыйФайл, ТекФайл.Представление);
			КонецЦикла;	
			УдалитьФайлы(ФайлНаДиске.ПолноеИмя);
		Иначе
			НовыйСписокФайлов.Добавить(ТекФайл.Значение, ТекФайл.Представление);	
		КонецЕсли;	
		
	КонецЦикла;
	Возврат НовыйСписокФайлов;
	
КонецФункции

Функция ПодготовитьZIPАрхивы(СписокФайлов)
	
	ПолноеИмяФайлаАрхива = ПолучитьИмяВременногоФайла("zip");
	ЗаписьАрхива   	     = Новый ЗаписьZipФайла(ПолноеИмяФайлаАрхива);
	
	СоздатьКаталог(мКаталогНаДиске);
	
	ЗаписьАрхива.Добавить(мКаталогНаДиске + "\*.*", РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно); //.ОбрабатыватьРекурсивно;
	ЗаписьАрхива.Записать();
	
	НовыйСписокФайлов = Новый СписокЗначений;
	НовыйСписокФайлов.Добавить(ПолноеИмяФайлаАрхива, ПолучитьИмяФайла(ПолноеИмяФайлаАрхива));
	
	Возврат НовыйСписокФайлов;
	
КонецФункции

Функция ПолучитьИмяФайла(ПолноеИмяФайла)
	
	ИмяФайла = "";
	
	ПромТекст = СтрЗаменить(ПолноеИмяФайла, "/", "\");
	ПромТекст = СтрЗаменить(ПолноеИмяФайла, "\", Символы.ПС);
	
	КоличествоЭлементов = СтрЧислоСтрок(ПромТекст);
	Для Счетчик = 1 По КоличествоЭлементов Цикл
		ИмяФайла = СтрПолучитьСтроку(ПромТекст, Счетчик);
	КонецЦикла;	
	
	Возврат ИмяФайла;
	
КонецФункции

Функция ПодготовитьИмяФайлаДляСервера(ФайлОбъект)
	
	ПолноеИмяФайлаДляСервера = "";
	
	Если Найти(ФайлОбъект.Имя, ".xml") > 0 Тогда
		ПолноеИмяФайлаДляСервера = ФайлОбъект.Имя;
	Иначе	
		//у картинки надо оставить 2 папки и развернуть слэши
		ПолноеИмяФайлаДляСервера = ФайлОбъект.ПолноеИмя;
		ПутьДляУдаления 		 = мКаталогНаДиске + "\";
		ПолноеИмяФайлаДляСервера = СтрЗаменить(ПолноеИмяФайлаДляСервера, ПутьДляУдаления, "");
		ПолноеИмяФайлаДляСервера = СтрЗаменить(ПолноеИмяФайлаДляСервера, "\", "/");
	КонецЕсли;
	
	ПолноеИмяФайлаДляСервера = УдалитьДополнительныеРасширенияФайла(ПолноеИмяФайлаДляСервера);
	
	Возврат ПолноеИмяФайлаДляСервера;
	
КонецФункции	

Функция УдалитьДополнительныеРасширенияФайла(ИсходноеИмяФайла)
	
	ПозицияТочки 			  = Найти(ИсходноеИмяФайла, ".");
	ИмяФайла    			  = Лев(ИсходноеИмяФайла, ПозицияТочки - 1);
	ПраваяЧастьИсходногоИмени = Прав(ИсходноеИмяФайла, СтрДлина(ИсходноеИмяФайла) - ПозицияТочки);
	ПозицияТочки 			  = Найти(ПраваяЧастьИсходногоИмени, ".");
	Расширение 				  = ПраваяЧастьИсходногоИмени;
	Если ПозицияТочки > 0 Тогда
		Расширение = Лев(ПраваяЧастьИсходногоИмени, ПозицияТочки - 1);	
	КонецЕсли;	
	
	Возврат ИмяФайла + "." + Расширение;
	
КонецФункции	

Функция ПолучитьСписокФайловДляОтправки(МассивПодкаталогов);
	
	СписокФайлов = Новый СписокЗначений;
	Маска = "*.*";
	
	ВсеФайлыДляВыгрузки = НайтиФайлы(мКаталогНаДиске, Маска);
	
	Если МассивПодкаталогов <> Неопределено Тогда
		
		Для Каждого Подкаталог Из МассивПодкаталогов Цикл
			
			ФайлыВПодкаталоге = НайтиФайлы(мКаталогНаДиске + "\" + Подкаталог, Маска);
			Для Каждого ТекФайл Из ФайлыВПодкаталоге Цикл
				
				Если ТекФайл.ЭтоКаталог() Тогда
					
					ФайлыВДобавочномПодкаталоге = НайтиФайлы(ТекФайл.ПолноеИмя, Маска);
					Для Каждого ТекФайлВПодкаталоге Из ФайлыВДобавочномПодкаталоге Цикл
						
						Если НЕ ТекФайлВПодкаталоге.ЭтоКаталог() Тогда	
							ВсеФайлыДляВыгрузки.Добавить(ТекФайлВПодкаталоге);  								
						КонецЕсли;	
						
					КонецЦикла;	
					
				Иначе	
					ВсеФайлыДляВыгрузки.Добавить(ТекФайл);  
				КонецЕсли;	
				
			КонецЦикла;	
			
		КонецЦикла;			
		
	КонецЕсли;
	
	Для Каждого ТекФайл Из ВсеФайлыДляВыгрузки цикл
		
		Если НЕ ТекФайл.ЭтоКаталог() Тогда
			ПолноеИмяФайлаДляСервера = ПодготовитьИмяФайлаДляСервера(ТекФайл);
			СписокФайлов.Добавить(ТекФайл.ПолноеИмя, ПолноеИмяФайлаДляСервера);
		КонецЕсли;	
		
	КонецЦикла;	
	
	Возврат СписокФайлов;
	
КонецФункции		


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОПИСАНИЯ И ВЫВОДА ОШИБОК И СООБЩЕНИЙ

Функция ПолучитьСтруктуруИнформацииДляИстории()
	
	СтруктураДляИстории = Новый Структура("ДатаПоследнейЗагрузки,ДатаПоследнейВыгрузки,ДатаНачалаПоследнейЗагрузки,
	|ДатаНачалаПоследнейВыгрузки,РезультатПоследнейЗагрузки,РезультатПоследнейВыгрузки,
	|КомментарийКЗагрузкеДанных,КомментарийКВыгрузкеДанных");
	
	СтруктураДляИстории.КомментарийКЗагрузкеДанных = "";
	СтруктураДляИстории.КомментарийКВыгрузкеДанных = "";
	
	Возврат СтруктураДляИстории;
	
КонецФункции

Процедура ДобавитьТехническуюИнформацияВСообщение(СокращенноеСообщение, СообщениеСТехИнформацией)
	
	Если СокращенноеСообщение = СообщениеСТехИнформацией Тогда
		Возврат;
	КонецЕсли;
	
	СокращенноеСообщение = СокращенноеСообщение + Символы.ПС + Символы.ПС + "Техническая информация:" + Символы.ПС + СообщениеСТехИнформацией;	
	
КонецПроцедуры

Процедура ЗаписатьИнформациюВПротоколОбмена(СтруктураИнформации)
	
	ДатаПоследнегоОбмена = ТекущаяДата();				
	
	НаборЗаписейИстории = РегистрыСведений.ИсторияОбменаДанными.СоздатьНаборЗаписей();
	НаборЗаписейИстории.Отбор.УзелИнформационнойБазы.Установить(НастройкаСсылка);
	НаборЗаписейИстории.Отбор.Период.Установить(ДатаПоследнегоОбмена);
	
	СтрокаИстории = НаборЗаписейИстории.Добавить();
	
	СтрокаИстории.Период = ДатаПоследнегоОбмена;
	СтрокаИстории.УзелИнформационнойБазы = НастройкаСсылка;
	
	
	Если ЗначениеЗаполнено(СтруктураИнформации.ДатаПоследнейЗагрузки) Тогда
		
		СтрокаИстории.ДатаПоследнейЗагрузки = СтруктураИнформации.ДатаПоследнейЗагрузки;	
		СтрокаИстории.ДатаНачалаПоследнейЗагрузки = СтруктураИнформации.ДатаНачалаПоследнейЗагрузки;
		СтрокаИстории.РезультатПоследнейЗагрузки = СтруктураИнформации.РезультатПоследнейЗагрузки;
		
		СтрокаИстории.КомментарийКЗагрузкеДанных = ""; //ОбщегоНазначения.СформироватьТекстСообщения(СокрЛП(СтруктураИнформации.КомментарийКЗагрузкеДанных));
		
		Если Не ПустаяСтрока(СтрокаИстории.КомментарийКЗагрузкеДанных) 
			И Не ПустаяСтрока(СтруктураИнформации.КомментарийКЗагрузкеДанных) Тогда
			
			ДобавитьТехническуюИнформацияВСообщение(СтрокаИстории.КомментарийКЗагрузкеДанных, СтруктураИнформации.КомментарийКЗагрузкеДанных);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураИнформации.ДатаПоследнейВыгрузки) Тогда
		
		СтрокаИстории.ДатаПоследнейВыгрузки = СтруктураИнформации.ДатаПоследнейВыгрузки;	
		СтрокаИстории.ДатаНачалаПоследнейВыгрузки = СтруктураИнформации.ДатаНачалаПоследнейВыгрузки;
		СтрокаИстории.РезультатПоследнейВыгрузки = СтруктураИнформации.РезультатПоследнейВыгрузки;
		
		СтрокаИстории.КомментарийКВыгрузкеДанных = ""; // ОбщегоНазначения.СформироватьТекстСообщения(СокрЛП(СтруктураИнформации.КомментарийКВыгрузкеДанных));
		
		Если Не ПустаяСтрока(СтрокаИстории.КомментарийКВыгрузкеДанных) 
			И Не ПустаяСтрока(СтруктураИнформации.КомментарийКВыгрузкеДанных) Тогда
			
			ДобавитьТехническуюИнформацияВСообщение(СтрокаИстории.КомментарийКВыгрузкеДанных, СтруктураИнформации.КомментарийКВыгрузкеДанных);
			
		КонецЕсли;		
		
	КонецЕсли;	
	
	Попытка
		
		НаборЗаписейИстории.Записать();
		
	Исключение
		
		СообщитьОбОшибке("Возникла ошибка при записи истории обмена данными: " + ОписаниеОшибки());			
		
	КонецПопытки;	
	
КонецПроцедуры

Процедура ОтобразитьСостояние(ТекстСообщения)
	#Если Клиент Тогда
		Состояние(ТекстСообщения);
	#Иначе
		//ЗаписатьВЛог("ОбменССайтом",ТекстСообщения,"Информация"); 	
	#КонецЕсли	
КонецПроцедуры

Процедура ДобавитьТекстКСообщениюДляПользователя(ТекущееСообщение, ДобавляемоеСообщение)
	
	ТекущееСообщение = СокрЛП(ТекущееСообщение + Символы.ПС + ДобавляемоеСообщение);	
	
КонецПроцедуры

Процедура СообщитьПользователю(ТекстСообщения, ИнформацияОВыгрузке, Статус = Неопределено)
	
	//Если ИнформацияОВыгрузке Тогда
	//	ДобавитьТекстКСообщениюДляПользователя(мСтруктураИнформацииИсторииОбмена.КомментарийКВыгрузкеДанных, ТекстСообщения);
	//Иначе
	//	ДобавитьТекстКСообщениюДляПользователя(мСтруктураИнформацииИсторииОбмена.КомментарийКЗагрузкеДанных, ТекстСообщения);
	//КонецЕсли;
	
	#Если Клиент Тогда
		Если Статус = Неопределено Тогда
			Статус = СтатусСообщения.Обычное;	
		КонецЕсли;
		Сообщить(ТекстСообщения, Статус);
	#Иначе
		ЗаписатьВЛог("ОбменССайтом",ТекстСообщения,"Информация");                     
	#КонецЕсли
	
КонецПроцедуры	

// Процедура выводит текст ответа сервера, если в нем имеется
// расширенное описание ошибки (строки, начиная со 2-й)
//
// Параметры:
//  ОтветСервера - строка, текст ответа сервера
//
Процедура СообщитьРасширенноеОписаниеОтветаСервера(ОтветСервера)
	
	ТекстСообщения = "Ответ сервера:" + Символы.ПС;
	
	Если СтрЧислоСтрок(ОтветСервера) > 1 Тогда
		Для ТекСтрока = 2 по СтрЧислоСтрок(ОтветСервера) Цикл
			ТекстСообщения = ТекстСообщения + СтрПолучитьСтроку(ОтветСервера, ТекСтрока) + Символы.ПС;
		КонецЦикла;	
	КонецЕсли;
	
	СообщитьПользователю(ТекстСообщения, Истина, СтатусСообщения.Информация);	
	
КонецПроцедуры	

// Процедура выводит текст сообщения об ошибке обмена
// и текст "Обмен не выполнен."
//
// Параметры:
//  ТекстСообщения - строка, текст сообщения
//
Процедура СообщитьОбОшибкеОбмена(ТекстСообщения, ИнформацияОВыгрузке)
	
	ТекстСообщения = ТекстСообщения + Символы.ПС + "Обмен не выполнен";
	СообщитьПользователю(ТекстСообщения, ИнформацияОВыгрузке, СтатусСообщения.Важное);	
	
КонецПроцедуры	

// Процедура выводит текст сообщения об исключительной ошибке
//
// Параметры:
//
Процедура СообщитьОбИсключительнойОшибке(ИнформацияОВыгрузке, ТекстНачалаСообщения =  "", ТекстОкончанияСообщения = "")
	
	РасширеннаяИнформацияОбОшибке = ИнформацияОбОшибке();
	ТекстСообщения = "";
	Если ЗначениеЗаполнено(ТекстНачалаСообщения) Тогда
		ТекстСообщения = ТекстНачалаСообщения + Символы.ПС;
	КонецЕсли;	
	ТекстСообщения = ТекстСообщения
	+ "Произошла ошибка: "
	+ РасширеннаяИнформацияОбОшибке.Описание;
	
	Если НЕ Строка(РасширеннаяИнформацияОбОшибке.Причина) = "ИнформацияОбОшибке" Тогда
		ТекстСообщения = ТекстСообщения
		+ ". По причине: "
		+ РасширеннаяИнформацияОбОшибке.Причина;
	КонецЕсли;	
	
	ТекстСообщения = ТекстСообщения + Символы.ПС + ТекстОкончанияСообщения;
	
	СообщитьПользователю(ТекстСообщения, ИнформацияОВыгрузке, СтатусСообщения.Важное);	
	
КонецПроцедуры	

Процедура ЗаполнитьНастройкуОбменаWEB(НастройкаОбмена) Экспорт
	
	
	НастройкаОбмена=Справочники.НастройкиОбменаССайтом.НайтиПоКоду("001");
	
	Если НастройкаОбмена.Пустая() Тогда
		
		НастройкаОбмена = Справочники.НастройкиОбменаССайтом.СоздатьЭлемент();
		
		НастройкаОбмена.ОбменТоварами = Истина;
		НастройкаОбмена.ОбменЗаказами = Ложь;
		
		НастройкаОбмена.ВыгружатьТолькоИзменения = Истина;
		НастройкаОбмена.ВыгружатьНаСайт		 	 = Истина;
		
		// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
		//НастройкаОбмена.HTTPОбменИмяПользователя="*%*%*%";
		//НастройкаОбмена.HTTPОбменПароль="*$*$*$";
		НастройкаОбмена.HTTPОбменИмяПользователя = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
			Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКHTTPОбмену).Логин;
		НастройкаОбмена.HTTPОбменПароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
			Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКHTTPОбмену).Пароль;
		// Ихсанов Д. А. Конец  14.10.2025
		
		НастройкаОбмена.ВыгружатьКартинки = Истина;
		НастройкаОбмена.ВыгружатьФайлы = Истина;
		
		НастройкаОбмена.СпособИдентификацииКонтрагентов	= "Наименование";
		
		ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
		
		// ????
		ОсновнойКаталогФайлов 		=Неопределено;   //УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновнойКаталогФайлов");
		Если НЕ ЗначениеЗаполнено(ОсновнойКаталогФайлов) Тогда
			ОсновнойКаталогФайлов = "C:";	
		КонецЕсли;
		НастройкаОбмена.КаталогВыгрузки	= ОсновнойКаталогФайлов + "\1cbitrix";
		
		НастройкаОбмена.Организация = Справочники.Организации.НайтиПоКоду("SS-001"); //УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновнаяОрганизация");
		Если НЕ ЗначениеЗаполнено(НастройкаОбмена.Организация) Тогда 
			Выборка = Справочники.Организации.Выбрать();
			Если Выборка.Следующий() Тогда
				НастройкаОбмена.Организация = Выборка.Ссылка;
			КонецЕсли;	
		КонецЕсли;	
		НастройкаОбмена.Подразделение 					  = "";//УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновноеПодразделение");
		НастройкаОбмена.Ответственный 					  = "";//УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновнойОтветственный");
		//НастройкаОбмена.ЕдиницаИзмеренияНовойНоменклатуры = "";//УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновнаяЕдиницаПоКлассификатору");
		
		Если НЕ ЗначениеЗаполнено(НастройкаОбмена.ЕдиницаИзмеренияНовойНоменклатуры) Тогда 
			ЕдиницаИзмеренияНовойНоменклатуры = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт", Истина);
			Если НЕ ЗначениеЗаполнено(НастройкаОбмена.ЕдиницаИзмеренияНовойНоменклатуры) Тогда 
				НастройкаОбмена.ЕдиницаИзмеренияНовойНоменклатуры = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("796");
			КонецЕсли;	
		КонецЕсли;	
		
		НастройкаОбмена.HTTPОбменАдресСайта	 = "http://office.idexgroup.ru:162/bitrix/admin/1c_exchange.php";
		
		НастройкаОбмена.ФорматДаты 			 = "ДФ=yyyy-MM-dd; ДЛФ=D";
		НастройкаОбмена.ФорматВремени 		 = "ДФ=ЧЧ:мм:сс; ДЛФ=T";
		НастройкаОбмена.РазделительДатаВремя = "T";
		
		НастройкаОбмена.ФорматСуммы 	 = "ЧЦ=18; ЧДЦ=2; ЧРД=,; ЧГ=";
		НастройкаОбмена.ФорматКоличества = "ЧЦ=18; ЧДЦ=2; ЧРД=,; ЧГ=";
		
		НастройкаОбмена.СохраненнаяТаблицаКаталогов = Новый ХранилищеЗначения(ПроцедурыОбменаССайтом.СоздатьТаблицуКаталогов());
		
		НовТовар=НастройкаОбмена.Каталоги.Добавить();
		НовТовар.Товар=Справочники.Номенклатура.НайтиПоКоду();
		НастройкаОбмена.ВыгружатьПрайсЛист=Истина;
		НастройкаОбмена.ВыгружатьТовары=Истина;
		
		
		НастройкаОбмена.Записать();
		
	КонецЕсли;
	
КонецПроцедуры




////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ АНАЛИЗА ИЗМЕНЕНИЙ ДАННЫХ

Процедура ЗаполнитьСтруктуруИзмененийДляУзла(УзелПланаОбмена, СтруктураВозврата, ИнформацияОТоварах = Истина)
	
	Если НЕ ЗначениеЗаполнено(УзелПланаОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку();
	
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	
	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, УзелПланаОбмена);
	
	Если ИнформацияОТоварах Тогда
		СтруктураВозврата.НомерСообщенияТовары = ЗаписьСообщения.НомерСообщения;
	Иначе
		СтруктураВозврата.НомерСообщенияЗаказы = ЗаписьСообщения.НомерСообщения;
	КонецЕсли;
	
	// Получение Изменений
	#Если Клиент Тогда
		ОтобразитьСостояние("Выбор изменений ...");
		Счетчик = 0;
	#КонецЕсли
	
	Выборка = ПланыОбмена.ВыбратьИзменения(ЗаписьСообщения.Получатель, ЗаписьСообщения.НомерСообщения); 
	
	Пока Выборка.Следующий() Цикл
		
		#Если Клиент Тогда
			Счетчик = Счетчик + 1;
			Если Счетчик % 100 = 0 Тогда
				ОтобразитьСостояние("Обработано объектов: " + Счетчик);
			КонецЕсли;
		#КонецЕсли
		
		Данные 	  = Выборка.Получить();
		ТипДанных = ТипЗнч(Данные);
		
		Если ТипДанных = Тип("СправочникОбъект.Номенклатура") Тогда
			
			СтруктураВозврата.Товары.Добавить(Данные.Ссылка);
			
		ИначеЕсли ТипДанных = Тип("ДокументОбъект.ПродажаИМ") Тогда
			
			СтруктураВозврата.Заказы.Добавить(Данные.Ссылка);	
			//крохин начало 04.02.2013
			//нет такого справочника
			//	ИначеЕсли ТипДанных = Тип("СправочникОбъект.ХранилищеДополнительнойИнформации") Тогда
			
			//		СтруктураВозврата.Картинки.Добавить(Данные.Ссылка);
			//крохин конец 04.02.2013		
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьВсеИзмененияИзПланаОбмена()
	
	СтруктураВозврата = Новый Структура("Товары,Заказы,Картинки,НомерСообщенияТовары,НомерСообщенияЗаказы", 
	Новый Массив(), Новый Массив(), Новый Массив());
	
	Если ОбменТоварами Тогда
		ЗаполнитьСтруктуруИзмененийДляУзла(УзелОбменаТоварами, СтруктураВозврата, Истина);
	КонецЕсли;
	
	//Если ОбменЗаказами Тогда
	//	ЗаполнитьСтруктуруИзмененийДляУзла(УзелОбменаЗаказами, СтруктураВозврата, Ложь);
	//КонецЕсли;
	
	Возврат СтруктураВозврата; 
	
КонецФункции	




////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ УПРАВЛЕНИЯ ОБМЕНОМ ЗАКЗАМИ


Функция ВыполнитьОбменЗаказами(СтруктураИзменений)
	
	Если НЕ ОпределитьМожноВыгружатьЗаказы() Тогда
		
		СообщитьПользователю("Выгрузка заказов не произведена.", Истина);
		Возврат Истина;
		
	КонецЕсли;
	
	мМассивЗагруженныхДокументов = Новый Массив();
	КоличествоОбработанныхДокументовНаЗагрузке = 0;
	КоличествоОбработанныхДокументовНаВыгрузке = 0;
	
	Если ВыгружатьНаСайт Тогда
		
		HTTPОбменАдресСкрипта = НачалоАдресаСкрипта;
		СтруктураПараметровСайта = ПроцедурыОбменаССайтом.ПолучитьСтруктуруПараметровДляСоединения(ЭтотОбъект);		
		
		мСтруктураИнформацииИсторииОбмена.ДатаПоследнейЗагрузки = Текущаядата();
		
		УспешноЗагружено = HTTPЗагрузитьССервера(СтруктураПараметровСайта, "sale", КоличествоОбработанныхДокументовНаЗагрузке);
		
		мСтруктураИнформацииИсторииОбмена.РезультатПоследнейЗагрузки = УспешноЗагружено;
		мСтруктураИнформацииИсторииОбмена.ДатаПоследнейЗагрузки = Текущаядата();
		
		УспешноВыгружено = ВыгрузитьЗаказыНаСайт(СтруктураИзменений, СтруктураПараметровСайта, КоличествоОбработанныхДокументовНаВыгрузке);
		
	Иначе
		
		УспешноЗагружено = ЗагрузитьЗаказыИзФайла(КоличествоОбработанныхДокументовНаЗагрузке);
		//УспешноВыгружено = ВыгрузитьЗаказыВФайл(СтруктураИзменений, СтруктураПараметровСайта, КоличествоОбработанныхДокументовНаВыгрузке);
		УспешноВыгружено=Истина;
	КонецЕсли;	
	
	Успешно = УспешноЗагружено И УспешноВыгружено;
	
	Если Успешно Тогда
		
		Если КоличествоОбработанныхДокументовНаЗагрузке + КоличествоОбработанныхДокументовНаВыгрузке > 0 Тогда
			СообщитьПользователю("Обмен заказами успешно завершен", Истина);
		КонецЕсли;
		
	Иначе
		СообщитьПользователю("Обмен заказами завершен с ошибками!!!", Истина);
	КонецЕсли;
	
	Возврат Успешно;
	
КонецФункции	

Функция ВыгрузитьЗаказыНаСайт(СтруктураИзменений, СтруктураПараметровСайта, КоличествоОбработанныхДокументовНаВыгрузке)
	
	КоличествоОбработанныхДокументовНаВыгрузке = 0;
	//	Успешно = ВыгрузитьЗаказыВФайл(СтруктураИзменений, СтруктураПараметровСайта, КоличествоОбработанныхДокументовНаВыгрузке);
	Успешно=Истина;
	
	Если Не Успешно	Тогда
		Возврат Ложь;
	ИначеЕсли КоличествоОбработанныхДокументовНаВыгрузке = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Успешно = HTTPВыгрузитьНаСервер(СтруктураПараметровСайта, , , "sale");
	
	ОчиститьКаталогНаДиске();
	
	Возврат Успешно;
	
КонецФункции

Функция ЗагрузитьЗаказыИзФайла(КоличествоОбработанныхДокументов)
	
	КоличествоОбработанныхДокументов = 0;
	
	Файл = Новый Файл(ФайлЗагрузки);
	Если НЕ Файл.Существует()
		ИЛИ Файл.ЭтоКаталог() Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	мСтруктураИнформацииИсторииОбмена.ДатаПоследнейЗагрузки = Текущаядата();
	
	ФайлCML = Новый ТекстовыйДокумент;
	ФайлCML.Прочитать(ФайлЗагрузки);
	СтрокаCML = ФайлCML.ПолучитьТекст();
	ДеревоДокументов = РазобратьCML(СтрокаCML);
	
	Если ДеревоДокументов = Неопределено Тогда
		
		мСтруктураИнформацииИсторииОбмена.РезультатПоследнейЗагрузки = Истина;
		мСтруктураИнформацииИсторииОбмена.ДатаПоследнейЗагрузки = Текущаядата();
		Возврат Истина;
		
	КонецЕсли;
	
	Успешно = ОбработатьДокументы(ДеревоДокументов, КоличествоОбработанныхДокументов);
	Если НЕ Успешно Тогда 
		СообщитьОбОшибкеОбмена("Не удалось обработать документы, загруженные из файла.", Ложь);		
	КонецЕсли;	
	
	мСтруктураИнформацииИсторииОбмена.РезультатПоследнейЗагрузки = Успешно;
	мСтруктураИнформацииИсторииОбмена.ДатаПоследнейЗагрузки = Текущаядата();
	
	Возврат Успешно;
	
КонецФункции	

Функция ВыгрузитьЗаказыВФайл(СтруктураИзменений, СтруктураПараметровСайта, КоличествоВыгруженныхЗаказов = 0)
	
	возврат истина;
	Успешно = Истина;
	КоличествоВыгруженныхЗаказов = 0;
	
	МассивИзменений   = Новый Массив;
	
	Если ВыгружатьТолькоИзменения И НЕ мПринудительнаяПолнаяВыгрузка Тогда
		
		МассивИзменений = СтруктураИзменений.Заказы;
		
		// из этого массива нужно удалить все только что загруженные заказы
		Для Каждого Эл Из мМассивЗагруженныхДокументов Цикл
			
			ИндексЭлемента = МассивИзменений.Найти(Эл);
			Если ИндексЭлемента <> Неопределено Тогда
				МассивИзменений.Удалить(ИндексЭлемента);
			КонецЕсли;
			
		КонецЦикла;
		
		Если МассивИзменений.Количество() = 0 Тогда
			
			СообщитьПользователю("Изменения заказов не зарегистрированы. Выгрузка заказов не произведена.", Истина); 
			Возврат Истина;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	ОбъектCMLСтрока   = "";
	ТаблицаДокументов = СформироватьCMLСРанееЗагруженнымиЗаказами(ОбъектCMLСтрока, МассивИзменений);
	
	КоличествоВыгруженныхЗаказов = ТаблицаДокументов.Количество();
	
	Если КоличествоВыгруженныхЗаказов = 0 Тогда
		
		СообщитьПользователю("Не выгружен ни один заказ.", Истина);
		Возврат Успешно;
		
	КонецЕсли;
	
	ИмяФайлаОбмена 		 = "1cbitrix-" + Строка(Новый УникальныйИдентификатор) + ".xml";
	ПолноеИмяФайлаОбмена = мКаталогНаДиске + "\" + ИмяФайлаОбмена;
	
	ФайлCMLНаДиске = Новый ТекстовыйДокумент;
	ФайлCMLНаДиске.УстановитьТекст(ОбъектCMLСтрока);
	
	Попытка
		ФайлCMLНаДиске.Записать(ПолноеИмяФайлаОбмена, "UTF-8");
	Исключение
		СообщитьОбИсключительнойОшибке(Истина, "Не удалось записать CML файл на диск: " + ПолноеИмяФайлаОбмена + Символы.ПС + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	СообщитьПользователю("Выгружено заказов: " + ТаблицаДокументов.Количество(), Истина);	
	Возврат Истина;
	
КонецФункции

Функция ОпределитьМожноВыгружатьЗаказы()
	
	ЕстьФайлЗагрузки 			= ЗначениеЗаполнено(ФайлЗагрузки);
	ЕстьСайт			  		= ЗначениеЗаполнено(HTTPОбменСервер);	
	
	ЕстьОрганизация  			= ЗначениеЗаполнено(Организация);
	ЕстьПараметрыИдентификации  = ЗначениеЗаполнено(СпособИдентификацииКонтрагентов);
	ЕстьЕдиницаИзмерения		= ЗначениеЗаполнено(ЕдиницаИзмеренияНовойНоменклатуры);
	
	Если ВыгружатьНаСайт Тогда
		Возврат	ЕстьСайт И ЕстьОрганизация И ЕстьПараметрыИдентификации И ЕстьЕдиницаИзмерения;
	Иначе
		Возврат ЕстьФайлЗагрузки;
	КонецЕсли;	
	
КонецФункции



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТКИ ЗАГРУЖЕННЫХ ДАННЫХ


Функция ОбработатьНачалоЭлемента(ОбъектCML, Знач ИмяЭлемента, ДеревоДокументов);
	
	Успешно = Истина;
	
	ТекущаяСтрокаДерева  	  = Неопределено;
	ТекущаяСтрокаТоваровУслуг = Неопределено;
	
	КоличествоДокументов 	  = ДеревоДокументов.Строки.Количество();
	Если КоличествоДокументов > 0 Тогда
		
		ТекущаяСтрокаДерева    = ДеревоДокументов.Строки[КоличествоДокументов - 1];
		КоличествоТоваровУслуг = ТекущаяСтрокаДерева.Строки.Количество();
		
		Если КоличествоТоваровУслуг > 0 Тогда
			ТекущаяСтрокаТоваровУслуг = ТекущаяСтрокаДерева.Строки[КоличествоТоваровУслуг - 1];
		КонецЕсли;	
		
	КонецЕсли;	
	
	Если ИмяЭлемента = "Документ" Тогда
		
		НовыйДокумент = Документы.ПродажаИМ.СоздатьДокумент();
		НовыйДокумент.ТипЦен = Справочники.ТипыЦен.НайтиПоКоду("SSP-0301"); // частное лицо //++-++
		НовыйДокумент.ТипЦенРаспродажа = Справочники.ТипыЦен.НайтиПоКоду("SNL-0393"); //  или сале //++-++
		НовыйДокумент.ТипСкидок = Справочники.ТипыСкидок.НайтиПоКоду("SNL-0008"); // ниже не куда
		НовыйДокумент.Контрагент =Справочники.Контрагенты.НайтиПоКоду("SSR-0519");
		
		НовыйДокумент.ИБ=Справочники.ИБ.НайтиПоКоду("SSP"); // 
		НовыйДокумент.ВидОплаты=перечисления.ВидыОплаты.БН; //++-++
		НовыйДокумент.КодОперации=перечисления.КодыОперацийОстатки.Реализация; //++-++
		НовыйДокумент.СостояниеНакладной=перечисления.СостоянияНакладной.ВРаботе; //++-++
		//НовыйДокумент.Подразделение=справочники.Подразделения.НайтиПоКоду("SSP-0004");
		
		НовыйДокумент.Склад = Справочники.Склады.НайтиПоКоду("SSP-22"); // 
		
		
		НовыйДокумент.УчитыватьНДС	   = Истина;
		НовыйДокумент.СуммаВключаетНДС = Истина;
		НовСтрокаДерева 			   = ДеревоДокументов.Строки.Добавить();
		НовСтрокаДерева.ДокументОбъект = НовыйДокумент;
		НовСтрокаДерева.СтавкаНДС 	   = Перечисления.СтавкиНДС.БезНДС;
		НовСтрокаДерева.СтруктураДанныхКонтрагента = Новый Структура;
		
	ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент" Тогда
		
		ДеревоАдресов = Новый ДеревоЗначений;
		ДеревоАдресов.Колонки.Добавить("ВидАдреса");
		ДеревоАдресов.Колонки.Добавить("Представление");
		ДеревоАдресов.Колонки.Добавить("Комментарий");
		ДеревоАдресов.Колонки.Добавить("ПолеТип");
		ДеревоАдресов.Колонки.Добавить("ПолеЗначение");
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДеревоАдресов", ДеревоАдресов);
		
		ТаблицаКонтактов = Новый ТаблицаЗначений;
		ТаблицаКонтактов.Колонки.Добавить("КонтактТип");
		ТаблицаКонтактов.Колонки.Добавить("КонтактЗначение");
		ТаблицаКонтактов.Колонки.Добавить("КонтактКомментарий");
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ТаблицаКонтактов", ТаблицаКонтактов);
		
		ТаблицаКонтактныхЛиц = Новый ТаблицаЗначений;
		ТаблицаКонтактныхЛиц.Колонки.Добавить("Наименование");
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ТаблицаКонтактныхЛиц", ТаблицаКонтактныхЛиц);
		
		ТаблицаБанковскихРеквизитов = Новый ТаблицаЗначений;
		ТаблицаБанковскихРеквизитов.Колонки.Добавить("НомерСчета");
		ТаблицаБанковскихРеквизитов.Колонки.Добавить("Комментарий");
		ТаблицаБанковскихРеквизитов.Колонки.Добавить("Банк");
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ТаблицаБанковскихРеквизитов", ТаблицаБанковскихРеквизитов);
		
		//ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.УдостоверениеЛичности" Тогда		
		
	ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.АдресРегистрации" Тогда
		
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ДеревоАдресов", ДеревоАдресов);
		НовСтрокаДерева	= ДеревоАдресов.Строки.Добавить();
		НовСтрокаДерева.ВидАдреса = "АдресРегистрации";
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДеревоАдресов", ДеревоАдресов);
		
	ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.АдресРегистрации.АдресноеПоле" Тогда
		
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ДеревоАдресов", ДеревоАдресов);
		СтрокаДерева 	= ДеревоАдресов.Строки.Найти("АдресРегистрации", "ВидАдреса");
		НовСтрокаДерева = СтрокаДерева.Строки.Добавить();
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДеревоАдресов", ДеревоАдресов);
		
		//ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.МестоРаботы.Организация.Контрагент" Тогда	
		//ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.МестоРаботы" Тогда		
		
	ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.ЮридическийАдрес" Тогда
		
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ДеревоАдресов", ДеревоАдресов);
		НовСтрокаДерева	= ДеревоАдресов.Строки.Добавить();
		НовСтрокаДерева.ВидАдреса = "ЮридическийАдрес";
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДеревоАдресов", ДеревоАдресов);
		
	ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.ЮридическийАдрес.АдресноеПоле" Тогда
		
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ДеревоАдресов", ДеревоАдресов);
		СтрокаДерева 	= ДеревоАдресов.Строки.Найти("ЮридическийАдрес", "ВидАдреса");
		НовСтрокаДерева = СтрокаДерева.Строки.Добавить();
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДеревоАдресов", ДеревоАдресов);
		
	ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет" Тогда
		
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ТаблицаБанковскихРеквизитов", ТаблицаБанковскихРеквизитов);
		НоваяСтрокаТаблицыБанковскихРеквизитов = ТаблицаБанковскихРеквизитов.Добавить();
		
		НоваяСтрокаТаблицыБанковскихРеквизитов.Банк = Новый Структура("
		|	СчетКорреспондентский,
		|	Наименование,
		|	Адрес,
		|	БИК,
		|	SWIFT");
		
		НоваяСтрокаТаблицыБанковскихРеквизитов.Банк.Адрес = Новый Структура;
		НоваяСтрокаТаблицыБанковскихРеквизитов.Банк.Адрес.Вставить("Представление");
		ТаблицаАдресныхПолей = Новый ТаблицаЗначений;
		ТаблицаАдресныхПолей.Колонки.Добавить("ПолеТип");
		ТаблицаАдресныхПолей.Колонки.Добавить("ПолеЗначение");
		НоваяСтрокаТаблицыБанковскихРеквизитов.Банк.Адрес.Вставить("ТаблицаАдресныхПолей", ТаблицаАдресныхПолей);
		
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ТаблицаБанковскихРеквизитов", ТаблицаБанковскихРеквизитов);
		
		//ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.БанкКорреспондент.Банк" Тогда	
		//ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.БанкКорреспондент.Банк.Адрес" Тогда	
		//ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.БанкКорреспондент.Банк.Адрес.АдресноеПоле" Тогда	
		
		//ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.Банк" Тогда
		//ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.Банк.Адрес" Тогда	
		
	ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.Банк.Адрес.АдресноеПоле" Тогда		
		
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ТаблицаБанковскихРеквизитов", ТаблицаБанковскихРеквизитов);	
		СтрокаТаблицыБанковскихРеквизитов = ТаблицаБанковскихРеквизитов[ТаблицаБанковскихРеквизитов.Количество() - 1];
		СтруктураДанныхБанка = СтрокаТаблицыБанковскихРеквизитов.Банк;
		СтруктураДанныхБанка.Адрес.ТаблицаАдресныхПолей.Добавить();
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ТаблицаБанковскихРеквизитов", ТаблицаБанковскихРеквизитов);
		
	ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Адрес" Тогда	
		
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ДеревоАдресов", ДеревоАдресов);
		НовСтрокаДерева	= ДеревоАдресов.Строки.Добавить();
		НовСтрокаДерева.ВидАдреса = "Адрес";
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДеревоАдресов", ДеревоАдресов);
		
	ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Адрес.АдресноеПоле" Тогда		
		
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ДеревоАдресов", ДеревоАдресов);
		СтрокаДерева 	= ДеревоАдресов.Строки.Найти("Адрес", "ВидАдреса");
		НовСтрокаДерева = СтрокаДерева.Строки.Добавить();
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДеревоАдресов", ДеревоАдресов);
		
	ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Контакты.Контакт" Тогда
		
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ТаблицаКонтактов", ТаблицаКонтактов);
		ТаблицаКонтактов.Добавить();
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ТаблицаКонтактов", ТаблицаКонтактов);
		
	ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Представители.Представитель.Контрагент" Тогда	
		
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ТаблицаКонтактныхЛиц", ТаблицаКонтактныхЛиц);
		ТаблицаКонтактныхЛиц.Добавить();
		ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ТаблицаКонтактныхЛиц", ТаблицаКонтактныхЛиц);
		
		//ИначеЕсли ИмяЭлемента = "Документ.Налоги.Налог" Тогда
		//ИначеЕсли ИмяЭлемента = "Документ.Скидки.Скидка" Тогда
		//ИначеЕсли ИмяЭлемента = "Документ.ДопРасходы.ДопРасход" Тогда
		
	ИначеЕсли ИмяЭлемента = "Документ.Товары.Товар" Тогда
		
		НовСтрокаДерева = ТекущаяСтрокаДерева.Строки.Добавить();
		
	ИначеЕсли ИмяЭлемента = "Документ.Товары.Товар.БазоваяЕдиница" Тогда		
		
		Пока ОбъектCML.ПрочитатьАтрибут() Цикл
			Если ОбъектCML.Имя = "Код" Тогда
				КодБазовойЕдиницы = ОбъектCML.Значение;
				ТекущаяСтрокаТоваровУслуг.ТоварУслугаБазоваяЕдиницаКод = КодБазовойЕдиницы;
				Прервать;
			КонецЕсли;	
		КонецЦикла
		
	ИначеЕсли ИмяЭлемента = "Документ.Товары.Товар.ЗначенияРеквизитов.ЗначениеРеквизита" Тогда
		
		ТекущаяСтрокаТоваровУслуг.Строки.Добавить();
		
	ИначеЕсли ИмяЭлемента = "Документ.Товары.Товар.Скидки.Скидка" Тогда
		
		ТекущаяСтрокаТоваровУслуг.Строки.Добавить();
		
	ИначеЕсли ИмяЭлемента = "Документ.ЗначенияРеквизитов.ЗначениеРеквизита" Тогда
		
		НовСтрокаДерева = ТекущаяСтрокаДерева.Строки.Добавить();
		
	КонецЕсли;
	
	Возврат Успешно;
	
КонецФункции                       

Функция ОбработатьЗначениеЭлемента(Знач ИмяЭлемента, Знач ЗначениеЭлемента, ДеревоДокументов);
	
	Успешно 			 		= Истина;
	КоличествоДокументов 		= ДеревоДокументов.Строки.Количество();
	ИмяТекущегоЭлемента  		= ПолучитьИмяЭлементаИзПоследовательности(ИмяЭлемента);
	ДеревоАдресов		 		= Неопределено;
	ТаблицаКонтактов		    = Неопределено;
	ТаблицаКонтактныхЛиц 		= Неопределено;
	ТаблицаБанковскихРеквизитов = НеОпределено;
	
	Если КоличествоДокументов > 0 Тогда
		
		ТекущаяСтрокаДерева       = ДеревоДокументов.Строки[КоличествоДокументов - 1];
		ТекущийДокумент 	      = ТекущаяСтрокаДерева.ДокументОбъект;
		
		ТекущаяСтрокаТоваровУслуг = Неопределено;
		ТекущаяСтрокаСкидок 	  = Неопределено;
		
		КоличествоТоваровУслуг    = ТекущаяСтрокаДерева.Строки.Количество();
		
		Если КоличествоТоваровУслуг > 0 Тогда
			
			ТекущаяСтрокаТоваровУслуг = ТекущаяСтрокаДерева.Строки[КоличествоТоваровУслуг - 1];	
			
			КоличествоСкидок    	  = ТекущаяСтрокаТоваровУслуг.Строки.Количество();
			
			Если КоличествоСкидок > 0 Тогда
				ТекущаяСтрокаСкидок = ТекущаяСтрокаТоваровУслуг.Строки[КоличествоСкидок - 1];	
			КонецЕсли;
			
		КонецЕсли;	
		
		Если ИмяЭлемента = "Документ.Номер" Тогда
			
			ТекущийДокумент.Организация   = Организация; 
			ТекущийДокумент.Ответственный = Ответственный;
			ТекущийДокумент.Подразделение = Подразделение;
			
			ТекущийДокумент.Комментарий   = "№ " + ЗначениеЭлемента + " " + HTTPОбменСервер;
			
			ТекущийДокумент.НомерВходящегоДокументаЭлектронногоОбмена = ЗначениеЭлемента;
			ТекущаяСтрокаДерева.НомерВходящий = ЗначениеЭлемента;
			
			ОтобразитьСостояние("Обработка документа CML: " + ТекущаяСтрокаДерева.НомерВходящий);
			
		ИначеЕсли ИмяЭлемента = "Документ.Дата" Тогда
			
			ДатаВремя = ОбработатьДатуВремяCML(ЗначениеЭлемента);
			
			Если ЗаписыватьДокументыТекущейДатой Тогда
				ТекущийДокумент.Дата = ТекущаяДата();
			Иначе	
				ТекущийДокумент.Дата = ДатаВремя;
			КонецЕсли;	
			
			ТекущийДокумент.ДатаВходящегоДокументаЭлектронногоОбмена = ДатаВремя;
			
		ИначеЕсли ИмяЭлемента = "Документ.Время" Тогда
			
			Если НЕ ЗаписыватьДокументыТекущейДатой Тогда
				ТекущийДокумент.Дата = ОбработатьДатуВремяCML(ЗначениеЭлемента, ТекущийДокумент.Дата);
			КонецЕсли;	
			
			ТекущийДокумент.ДатаВходящегоДокументаЭлектронногоОбмена = ОбработатьДатуВремяCML(ЗначениеЭлемента, ТекущийДокумент.ДатаВходящегоДокументаЭлектронногоОбмена);
			
		ИначеЕсли ИмяЭлемента = "Документ.ХозОперация" Тогда
			
			Если НЕ ЗначениеЭлемента = "Заказ товара" Тогда	
				СообщитьОбОшибкеОбмена("Ошибка в значении узла <Документ>.<ХозОперация> документа CML (" + ЗначениеЭлемента + ").", Ложь);
				Успешно = Ложь;
			КонецЕсли;	
			
		ИначеЕсли ИмяЭлемента = "Документ.Валюта" Тогда
			
			ТекущийДокумент.Валюта = ОбработатьВалютуCML(ЗначениеЭлемента);
			Если НЕ ЗначениеЗаполнено(ТекущийДокумент.Валюта) Тогда
				СообщитьОбОшибкеОбмена("Ошибка в значении узла <Документ>.<Валюта> документа CML (" + ЗначениеЭлемента + ").", Ложь);
				Успешно = Ложь;
			КонецЕсли;	
			
		ИначеЕсли ИмяЭлемента = "Документ.Бонус" Тогда
			
			ТекущийДокумент.СуммаБонуса = Число(ЗначениеЭлемента);
			
		ИначеЕсли ИмяЭлемента = "Документ.Курс" Тогда
			
			КурсCML = Число(ЗначениеЭлемента);
			ТекущийДокумент.КурсВзаиморасчетов      = КурсCML;
			ТекущийДокумент.КратностьВзаиморасчетов = 1;
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Наименование" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("Наименование", ЗначениеЭлемента); 
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Комментарий" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("Комментарий", ЗначениеЭлемента); 
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.ПолноеНаименование"
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.ОфициальноеНаименование" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("НаименованиеПолное", ЗначениеЭлемента); 
			
			Если ИмяЭлемента = "Документ.Контрагенты.Контрагент.ПолноеНаименование" Тогда
				ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ЮрФизЛицо", Перечисления.ЮрФизЛицо.ФизЛицо);
			Иначе
				ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ЮрФизЛицо", Перечисления.ЮрФизЛицо.ЮрЛицо);
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Фамилия" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("Фамилия", ЗначениеЭлемента);
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Имя" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("Имя", ЗначениеЭлемента);
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Отчество" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("Отчество", ЗначениеЭлемента);
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.ДатаРождения" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДатаРождения", ЗначениеЭлемента); 
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.МестоРождения" Тогда	
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("МестоРождения", ЗначениеЭлемента); 
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Пол" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("Пол", ЗначениеЭлемента); 
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.ИНН" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ИНН", ЗначениеЭлемента); 
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.КПП" Тогда		
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("КПП", ЗначениеЭлемента);
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.УдостоверениеЛичности.ВидДокумента"
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.УдостоверениеЛичности.Серия"
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.УдостоверениеЛичности.Номер"
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.УдостоверениеЛичности.ДатаВыдачи"
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.УдостоверениеЛичности.КемВыдан" Тогда		
			
			СохраненноеЗначение = "";
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ДокументУдостоверяющийЛичность", СохраненноеЗначение); 
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДокументУдостоверяющийЛичность", СохраненноеЗначение + ЗначениеЭлемента + " "); 
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.АдресРегистрации.Представление"
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.АдресРегистрации.Комментарий" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ДеревоАдресов", ДеревоАдресов);
			СтрокаДерева = ДеревоАдресов.Строки.Найти("АдресРегистрации", "ВидАдреса");
			СтрокаДерева[ИмяТекущегоЭлемента] = ЗначениеЭлемента;
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДеревоАдресов", ДеревоАдресов);
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.АдресРегистрации.АдресноеПоле.Тип"
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.АдресРегистрации.АдресноеПоле.Значение" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ДеревоАдресов", ДеревоАдресов);
			СтрокаДерева = ДеревоАдресов.Строки.Найти("АдресРегистрации", "ВидАдреса");
			СтрокаАдресногоПоля = СтрокаДерева.Строки[СтрокаДерева.Строки.Количество() - 1];
			СтрокаАдресногоПоля["Поле" + ИмяТекущегоЭлемента] = ЗначениеЭлемента;
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДеревоАдресов", ДеревоАдресов);
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.ЮридическийАдрес.Представление"
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.ЮридическийАдрес.Комментарий" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ДеревоАдресов", ДеревоАдресов);
			СтрокаДерева = ДеревоАдресов.Строки.Найти("ЮридическийАдрес", "ВидАдреса");
			СтрокаДерева[ИмяТекущегоЭлемента] = ЗначениеЭлемента;
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДеревоАдресов", ДеревоАдресов);
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.ЮридическийАдрес.АдресноеПоле.Тип"
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.ЮридическийАдрес.АдресноеПоле.Значение" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ДеревоАдресов", ДеревоАдресов);
			СтрокаДерева = ДеревоАдресов.Строки.Найти("ЮридическийАдрес", "ВидАдреса");
			СтрокаАдресногоПоля = СтрокаДерева.Строки[СтрокаДерева.Строки.Количество() - 1];
			СтрокаАдресногоПоля["Поле" + ИмяТекущегоЭлемента] = ЗначениеЭлемента;
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДеревоАдресов", ДеревоАдресов);
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.КПП" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("КПП", ЗначениеЭлемента); 
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.ОсновнойВидДеятельности" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ОсновнойВидДеятельности", ЗначениеЭлемента); 
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.НомерСчета" 
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.Комментарий" Тогда	
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ТаблицаБанковскихРеквизитов", ТаблицаБанковскихРеквизитов);
			СтрокаТаблицы = ТаблицаБанковскихРеквизитов[ТаблицаБанковскихРеквизитов.Количество() - 1];
			СтрокаТаблицы[ИмяТекущегоЭлемента] = ЗначениеЭлемента;
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ТаблицаБанковскихРеквизитов", ТаблицаБанковскихРеквизитов);
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.Банк.СчетКорреспондентский" 
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.Банк.Наименование"	
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.Банк.БИК"
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.Банк.SWIFT" Тогда	
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ТаблицаБанковскихРеквизитов", ТаблицаБанковскихРеквизитов);
			СтрокаТаблицы = ТаблицаБанковскихРеквизитов[ТаблицаБанковскихРеквизитов.Количество() - 1];
			СтрокаТаблицы.Банк[ИмяТекущегоЭлемента] = ЗначениеЭлемента;
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ТаблицаБанковскихРеквизитов", ТаблицаБанковскихРеквизитов);
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.Банк.Адрес.Представление"	Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ТаблицаБанковскихРеквизитов", ТаблицаБанковскихРеквизитов);
			СтрокаТаблицы = ТаблицаБанковскихРеквизитов[ТаблицаБанковскихРеквизитов.Количество() - 1];
			СтрокаТаблицы.Банк.Адрес[ИмяТекущегоЭлемента] = ЗначениеЭлемента;
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ТаблицаБанковскихРеквизитов", ТаблицаБанковскихРеквизитов);
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.Банк.Адрес.АдресноеПоле.Тип"	
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.РасчетныеСчета.РасчетныйСчет.Банк.Адрес.АдресноеПоле.Значение" Тогда
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ТаблицаБанковскихРеквизитов", ТаблицаБанковскихРеквизитов);
			СтрокаТаблицы = ТаблицаБанковскихРеквизитов[ТаблицаБанковскихРеквизитов.Количество() - 1];
			СтрокаАдреса = СтрокаТаблицы.Банк.Адрес.ТаблицаАдресныхПолей[СтрокаТаблицы.Банк.Адрес.ТаблицаАдресныхПолей.Количество() - 1];
			СтрокаАдреса["Поле" + ИмяТекущегоЭлемента] = ЗначениеЭлемента;
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ТаблицаБанковскихРеквизитов", ТаблицаБанковскихРеквизитов);
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Адрес.Представление"
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.Адрес.Комментарий" Тогда	
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ДеревоАдресов", ДеревоАдресов);
			СтрокаДерева = ДеревоАдресов.Строки.Найти("Адрес", "ВидАдреса");
			СтрокаДерева[ИмяТекущегоЭлемента] = ЗначениеЭлемента;
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДеревоАдресов", ДеревоАдресов);
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Адрес.АдресноеПоле.Тип"	
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.Адрес.АдресноеПоле.Значение" Тогда	
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ДеревоАдресов", ДеревоАдресов);
			СтрокаДерева = ДеревоАдресов.Строки.Найти("Адрес", "ВидАдреса");
			СтрокаАдресногоПоля = СтрокаДерева.Строки[СтрокаДерева.Строки.Количество() - 1];
			СтрокаАдресногоПоля["Поле" + ИмяТекущегоЭлемента] = ЗначениеЭлемента;
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ДеревоАдресов", ДеревоАдресов);
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Контакты.Контакт.Тип" 
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.Контакты.Контакт.Значение"
			ИЛИ ИмяЭлемента = "Документ.Контрагенты.Контрагент.Контакты.Контакт.Комментарий" Тогда		
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ТаблицаКонтактов", ТаблицаКонтактов);
			СтрокаТаблицы = ТаблицаКонтактов[ТаблицаКонтактов.Количество() - 1];
			СтрокаТаблицы["Контакт" + ИмяТекущегоЭлемента] = ЗначениеЭлемента;
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ТаблицаКонтактов", ТаблицаКонтактов);
			
		ИначеЕсли ИмяЭлемента = "Документ.Контрагенты.Контрагент.Представители.Представитель.Контрагент.Наименование" Тогда		
			
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Свойство("ТаблицаКонтактныхЛиц", ТаблицаКонтактныхЛиц);
			СтрокаТаблицы = ТаблицаКонтактныхЛиц[ТаблицаКонтактныхЛиц.Количество() - 1];
			СтрокаТаблицы["Наименование"] = ЗначениеЭлемента;
			ТекущаяСтрокаДерева.СтруктураДанныхКонтрагента.Вставить("ТаблицаКонтактныхЛиц", ТаблицаКонтактныхЛиц);
			
		ИначеЕсли ИмяЭлемента = "Документ.Комментарий" Тогда	
			
			ТекущийДокумент.Комментарий = ТекущийДокумент.Комментарий + ": " + ЗначениеЭлемента;
			
		ИначеЕсли ИмяЭлемента = "Документ.Налоги.Налог.УчтеноВСумме" Тогда
			
			ТекущийДокумент.СуммаВключаетНДС = Ложь;
			Если ЗначениеЭлемента = БулевоЗначениеCML_Истина Тогда
				ТекущийДокумент.СуммаВключаетНДС = Истина;
			КонецЕсли;	
			
		ИначеЕсли ИмяЭлемента = "Документ.Налоги.Налог.Ставка" Тогда
			
			ТекущийДокумент.УчитыватьНДС = ЗначениеЗаполнено(ЗначениеЭлемента);
			
			Если ТекущийДокумент.УчитыватьНДС Тогда
				
				ТекущаяСтрокаДерева.СтавкаНДС = ПолучитьПоЗначениюДляВыгрузкиСтавкуНДС(ЗначениеЭлемента);
				
			КонецЕсли;	
			
		ИначеЕсли ИмяЭлемента = "Документ.Товары.Товар.СтавкиНалогов.СтавкаНалога.Ставка" Тогда
			
			ТекущийДокумент.УчитыватьНДС = ЗначениеЗаполнено(ЗначениеЭлемента);
			
			Если ТекущийДокумент.УчитыватьНДС Тогда
				
				ТекущаяСтрокаТоваровУслуг.СтавкаНДС = ПолучитьПоЗначениюДляВыгрузкиСтавкуНДС(ЗначениеЭлемента);
				
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "Документ.Скидки.Скидка.Сумма" Тогда
			
			СуммаЧисло = Число(ЗначениеЭлемента);
			ТекущаяСтрокаДерева.СуммаСкидки = СуммаЧисло;
			
		ИначеЕсли ИмяЭлемента = "Документ.Скидки.Скидка.УчтеноВСумме" Тогда
			
			ТекущаяСтрокаДерева.СкидкаВСумме = Ложь;
			Если ЗначениеЭлемента = БулевоЗначениеCML_Истина Тогда
				ТекущаяСтрокаДерева.СкидкаВСумме = Истина;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "Документ.Товары.Товар.Ид"
			ИЛИ ИмяЭлемента = "Документ.Товары.Товар.БазоваяЕдиница"
			ИЛИ ИмяЭлемента = "Документ.Товары.Товар.Наименование" Тогда
			
			ТекущаяСтрокаТоваровУслуг["ТоварУслуга" + ИмяТекущегоЭлемента] = ЗначениеЭлемента;
			
		ИначеЕсли ИмяЭлемента = "Документ.Товары.Товар.ЦенаЗаЕдиницу"
			ИЛИ ИмяЭлемента = "Документ.Товары.Товар.Сумма"
			ИЛИ ИмяЭлемента = "Документ.Товары.Товар.Количество" Тогда
			
			ТекущаяСтрокаТоваровУслуг["ТоварУслуга" + ИмяТекущегоЭлемента] = Число(ЗначениеЭлемента);			  
			
			
		ИначеЕсли ИмяЭлемента = "Документ.Товары.Товар.ЗначенияРеквизитов.ЗначениеРеквизита.Наименование"
			ИЛИ ИмяЭлемента = "Документ.Товары.Товар.ЗначенияРеквизитов.ЗначениеРеквизита.Значение" Тогда
			
			ТекущаяСтрокаСкидок["ЗначениеРеквизита" + ИмяТекущегоЭлемента] = ЗначениеЭлемента;
			
		ИначеЕсли ИмяЭлемента = "Документ.Товары.Товар.Скидки.Скидка.Сумма" Тогда
			
			СуммаЧисло = Число(ЗначениеЭлемента);
			ТекущаяСтрокаСкидок.СуммаСкидки = СуммаЧисло;
			
		ИначеЕсли ИмяЭлемента = "Документ.Товары.Товар.Скидки.Скидка.УчтеноВСумме" Тогда
			
			ТекущаяСтрокаСкидок.СкидкаВСумме = Ложь;
			Если ЗначениеЭлемента = БулевоЗначениеCML_Истина Тогда
				ТекущаяСтрокаСкидок.СкидкаВСумме = Истина;
			КонецЕсли;	
			
		ИначеЕсли ИмяЭлемента = "Документ.ЗначенияРеквизитов.ЗначениеРеквизита.Наименование"
			ИЛИ ИмяЭлемента = "Документ.ЗначенияРеквизитов.ЗначениеРеквизита.Значение" Тогда
			
			ТекущаяСтрокаТоваровУслуг["Свойство" + ИмяТекущегоЭлемента] = ЗначениеЭлемента;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат Успешно;
	
КонецФункции

Функция РазобратьCML(СтрокаCML)
	
	Успешно = Истина;
	
	ОбъектCML = Новый ЧтениеXML;
	
	Попытка
		ОбъектCML.УстановитьСтроку(СтрокаCML);
	Исключение
		СообщитьОбИсключительнойОшибке(Ложь);
		Возврат Неопределено;
	КонецПопытки;
	
	ПоследовательностьЭлементов = "";
	
	ДеревоДокументов = Новый ДеревоЗначений;
	
	ДеревоДокументов.Колонки.Добавить("ДокументОбъект");
	ДеревоДокументов.Колонки.Добавить("НомерВходящий");
	ДеревоДокументов.Колонки.Добавить("РанееЗагруженныйДокументСсылка", Новый ОписаниеТипов("ДокументСсылка.ПродажаИм"));
	ДеревоДокументов.Колонки.Добавить("ЕстьСсылкиНаРанееЗагруженныйДокумент", Новый ОписаниеТипов("Булево"));
	ДеревоДокументов.Колонки.Добавить("СтруктураДанныхКонтрагента");
	ДеревоДокументов.Колонки.Добавить("СтавкаНДС");
	ДеревоДокументов.Колонки.Добавить("Бонус");
	
	
	// Подчинение документу
	
	ДеревоДокументов.Колонки.Добавить("ТоварУслугаТипНоменклатуры");
	ДеревоДокументов.Колонки.Добавить("ТоварУслугаНаименование");
	ДеревоДокументов.Колонки.Добавить("ТоварУслугаБазоваяЕдиницаКод");
	ДеревоДокументов.Колонки.Добавить("ТоварУслугаБазоваяЕдиница");
	ДеревоДокументов.Колонки.Добавить("ТоварУслугаСумма");
	ДеревоДокументов.Колонки.Добавить("ТоварУслугаКомментарий");
	ДеревоДокументов.Колонки.Добавить("ТоварУслугаЦенаЗаЕдиницу");
	ДеревоДокументов.Колонки.Добавить("ТоварУслугаКоличество");
	ДеревоДокументов.Колонки.Добавить("ТоварУслугаИд");
	
	ДеревоДокументов.Колонки.Добавить("СвойствоНаименование");
	ДеревоДокументов.Колонки.Добавить("СвойствоЗначение");
	
	// Подчинение товарам/услугам
	
	ДеревоДокументов.Колонки.Добавить("СуммаСкидки", Новый ОписаниеТипов("Число"));
	ДеревоДокументов.Колонки.Добавить("СкидкаВСумме", Новый ОписаниеТипов("Булево"));
	
	ДеревоДокументов.Колонки.Добавить("ЗначениеРеквизитаНаименование");
	ДеревоДокументов.Колонки.Добавить("ЗначениеРеквизитаЗначение");
	
	Пока Истина Цикл
		
		ОчереднойУзелCMLПрочитан = Ложь;
		
		Попытка
			ОчереднойУзелCMLПрочитан = ОбъектCML.Прочитать();
		Исключение
			Успешно = Ложь;
			СообщитьОбИсключительнойОшибке(Ложь);
			Прервать;
		КонецПопытки;	
		
		Если НЕ ОчереднойУзелCMLПрочитан Тогда
			Прервать;
		КонецЕсли;	
		
		ТипУзла = ОбъектCML.ТипУзла;
		ИмяУзла = ОбъектCML.Имя;
		
		Если ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			ПоследовательностьЭлементов = ДобавитьЭлементКПоследовательности(ПоследовательностьЭлементов, ИмяУзла);
			Успешно = ОбработатьНачалоЭлемента(ОбъектCML, ПоследовательностьЭлементов, ДеревоДокументов);
			Если НЕ Успешно Тогда
				СообщитьПользователю("Не удалось обработать начало элемента (" + ПоследовательностьЭлементов + ").", Ложь);
				Прервать;
			КонецЕсли;	
			
		ИначеЕсли ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			
			ПоследовательностьЭлементов = УдалитьПоследнийЭлементИзПоследовательности(ПоследовательностьЭлементов);
			
		ИначеЕсли ТипУзла = ТипУзлаXML.Текст Тогда	
			
			ЗначениеЭлемента = ОбъектCML.Значение;  
			Успешно = ОбработатьЗначениеЭлемента(ПоследовательностьЭлементов, ЗначениеЭлемента, ДеревоДокументов);
			Если НЕ Успешно Тогда
				СообщитьПользователю("Не удалось обработать значение элемента (" + ПоследовательностьЭлементов + ") = (" + ЗначениеЭлемента + ").", Ложь);
				Прервать;
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбъектCML.Закрыть();
	
	Если НЕ Успешно Тогда
		ДеревоДокументов = Неопределено;
	КонецЕсли;	
	
	Возврат ДеревоДокументов;
	
КонецФункции	

Функция ДобавитьЭлементКПоследовательности(Знач ПоследовательностьЭлементов, Знач ИмяУзла)
	
	ИсключатьИзПоследовательности = Новый Массив;
	ИсключатьИзПоследовательности.Добавить("КоммерческаяИнформация");
	
	Если ИсключатьИзПоследовательности.Найти(ИмяУзла) = Неопределено Тогда
		
		Если НЕ ПоследовательностьЭлементов = "" Тогда
			ПоследовательностьЭлементов = ПоследовательностьЭлементов + ".";	
		КонецЕсли;	
		ПоследовательностьЭлементов = ПоследовательностьЭлементов + ИмяУзла;
		
	КонецЕсли;
	
	Возврат ПоследовательностьЭлементов;
	
КонецФункции	

Функция УдалитьПоследнийЭлементИзПоследовательности(Знач ПоследовательностьЭлементов);
	
	ПромСтрока 			= СтрЗаменить(ПоследовательностьЭлементов, ".", Символы.ПС);
	КоличествоЭлементов = СтрЧислоСтрок(ПромСтрока);
	
	ПоследовательностьЭлементов	= "";
	Если КоличествоЭлементов > 0 Тогда
		КоличествоЭлементов = КоличествоЭлементов - 1;
		Для Счетчик = 1 По КоличествоЭлементов Цикл
			ПоследовательностьЭлементов	= ПоследовательностьЭлементов + "." + СтрПолучитьСтроку(ПромСтрока, Счетчик);
		КонецЦикла;	
		ПоследовательностьЭлементов = Прав(ПоследовательностьЭлементов, СтрДлина(ПоследовательностьЭлементов) - 1);
	КонецЕсли;
	
	Возврат ПоследовательностьЭлементов;
КонецФункции	

Функция ПолучитьИмяЭлементаИзПоследовательности(Знач ПоследовательностьЭлементов)
	
	ПромСтрока 			= СтрЗаменить(ПоследовательностьЭлементов, ".", Символы.ПС);
	КоличествоЭлементов = СтрЧислоСтрок(ПромСтрока);
	
	ИмяПоследнегоЭлемента = "";
	Если КоличествоЭлементов > 0 Тогда
		ИмяПоследнегоЭлемента = СтрПолучитьСтроку(ПромСтрока, КоличествоЭлементов);
	КонецЕсли;
	
	Возврат ИмяПоследнегоЭлемента;
	
КонецФункции	

Функция ОбработатьДокументы(ДеревоДокументов, КоличествоОбработанныхДокументов)
	
	Успешно = Истина;
	КоличествоОбработанныхДокументов = 0;
	
	СтруктураСтатистики = Новый Структура;
	СтруктураСтатистики.Вставить("Создано"  , 0);
	СтруктураСтатистики.Вставить("Обновлено", 0);
	СтруктураСтатистики.Вставить("Пропущено", 0);
	СтруктураСтатистики.Вставить("ОплаченСписок", Новый Массив);
	СтруктураСтатистики.Вставить("ДоставкаРазрешенаСписок", Новый Массив);
	СтруктураСтатистики.Вставить("ФинальныйСтатусСписок", Новый Массив);
	
	ОтобразитьСостояние("Поиск ранее загруженных документов...");
	
	ПолучитьРанееЗагруженныеДокументы(ДеревоДокументов);
	
	
	//
	//// если не 3 статуса, тогда только обновляем статусы на сайте, номенклатуру, документы не перезаписываем!!!
	//
	//ТаблицаПараметров=Док.строки;
	//Обновлять=Ложь;                                                 // имя колонки
	//НайденнаяСтрока = ТаблицаПараметров.Найти("Статус заказа", "СвойствоНаименование");
	//Значение=Неопределено;
	//Если НайденнаяСтрока = Неопределено Тогда
	//Иначе
	//	Значение = НайденнаяСтрока.СвойствоЗначение;
	//КонецЕсли;
	//
	//Если Значение<>Неопределено Тогда
	//	Если СтрЧислоВхождений(Значение, "[T]")>0 Или СтрЧислоВхождений(Значение, "[C]")>0 или СтрЧислоВхождений(Значение, "[K]")>0 Тогда
	//		Обновлять=Истина;
	//	КонецЕСли;
	//КонецЕсли;
	
	//НачатьТранзакцию();  ///!!!!!!!!!!!!!!!!!!!
	
	//
	//Успешно = ИдентифицироватьКонтрагентов(ДеревоДокументов); 
	//
	//Если НЕ Успешно Тогда
	//	//ОтменитьТранзакцию();
	//	ЗаписатьВЛог("ОбменССайтом","Не удалось найти/создать контрагента.","Информация"); 
	//	СообщитьПользователю("Не удалось найти/создать контрагента.", Ложь);
	//	Возврат Ложь;
	//КонецЕсли;
	
	Успешно = ИдентифицироватьНоменклатуру(ДеревоДокументов);
	Если НЕ Успешно Тогда
		//ОтменитьТранзакцию();
		ЗаписатьВЛог("ОбменССайтом","Не удалось найти/создать номенклатуру.","Информация"); 
		СообщитьПользователю("Не удалось найти/создать номенклатуру.", Ложь);
		Возврат Ложь;
	КонецЕсли;
	
	МассивДокументовДляПроведения = Новый Массив();
	Успешно = СоздатьОбновитьДокументы(ДеревоДокументов, СтруктураСтатистики, МассивДокументовДляПроведения, мМассивЗагруженныхДокументов);	
	Если НЕ Успешно Тогда
		//ОтменитьТранзакцию();
		ЗаписатьВЛог("ОбменССайтом","Не удалось создать/обновить документы.","Информация"); 
		СообщитьПользователю("Не удалось создать/обновить документы.", Ложь);
		Возврат Ложь;
	КонецЕсли;
	
	
	МассивОтклоненныхДокументов = Новый Массив(); // способ доставки и т.д.
	Успешно = ЗаписатьСвойстваДокументов(ДеревоДокументов, СтруктураСтатистики, МассивОтклоненныхДокументов);
	Если НЕ Успешно Тогда
		//ОтменитьТранзакцию();
		ЗаписатьВЛог("ОбменССайтом","Не удалось записать свойства документов.","Информация"); 
		СообщитьПользователю("Не удалось записать свойства документов.", Ложь);
		Возврат Ложь;
	КонецЕсли;
	
	//ЗафиксироватьТранзакцию();  ///!!!!!!!!!!!!!!!!!!!
	
	ОтобразитьСостояние("Проведение загруженных документов...");
	
	// если документы нужно проводить, то попытаемся их провести
	РежимПроведения = ?(ПроводитьДокументыОперативно, РежимПроведенияДокумента.Оперативный, РежимПроведенияДокумента.Неоперативный);
	Для Каждого ДокументПроведения Из МассивДокументовДляПроведения Цикл
		
		Если МассивОтклоненныхДокументов.Найти(ДокументПроведения.Ссылка) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			Докк=ДокументПроведения.ПолучитьОбъект();		
			Докк.ПометкаУдаления=Ложь;
			Докк.Записать(РежимЗаписиДокумента.Проведение, РежимПроведения);			
			
		Исключение
			ЗаписатьВЛог("ОбменССайтом", "Ошибка при проведении документа: " + Строка(ДокументПроведения) + Символы.ПС + ОписаниеОшибки(),"Информация");                     
			СообщитьОбИсключительнойОшибке(Ложь, "Ошибка при проведении документа: " + Строка(ДокументПроведения) + Символы.ПС + ОписаниеОшибки());
			Возврат Ложь;
			
		КонецПопытки;
		
	КонецЦикла;
	
	
	
	
	Для Каждого ДокументПроведения Из МассивОтклоненныхДокументов Цикл
		ДокОбъект = ДокументПроведения.ПолучитьОбъект();
		Если ДействияСОтмененнымиЗаказами = 0 Тогда // Удалять
			Если НЕ ДокОбъект.ПометкаУдаления Тогда
				ДокОбъект.ПометкаУдаления = Истина;
				Попытка
					ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);			
				Исключение
					ЗаписатьВЛог("ОбменССайтом", "Ошибка при установке пометки на удаление документа: " + Строка(ДокументПроведения) + Символы.ПС + ОписаниеОшибки(),"Информация");                     
					СообщитьОбИсключительнойОшибке(Ложь, "Ошибка при установке пометки на удаление документа: " + Строка(ДокументПроведения) + Символы.ПС + ОписаниеОшибки());
					Возврат Ложь;
				КонецПопытки;
			КонецЕсли;	
		Иначе // отменять
			Если ДокОбъект.Проведен Тогда
				Попытка
					ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);			
				Исключение
					ЗаписатьВЛог("ОбменССайтом", "Ошибка при отмене проведения документа: " + Строка(ДокументПроведения) + Символы.ПС + ОписаниеОшибки(),"Информация");                     
					СообщитьОбИсключительнойОшибке(Ложь, "Ошибка при отмене проведения документа: " + Строка(ДокументПроведения) + Символы.ПС + ОписаниеОшибки());
					Возврат Ложь;
				КонецПопытки;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	
	
	
	
	//Если Док.ДокументОбъект.состояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе или 
	//	Док.ДокументОбъект.состояниеНакладной=Перечисления.СостоянияНакладной.Отгружена 
	//	Попытка
	//		Док.ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//	исключение
	//		СообщитьОбИсключительнойОшибке(Ложь, ОписаниеОшибки());
	//	конецПопытки;
	//	
	//Иначе
	//
	//	Попытка
	//		Док.ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	//	исключение
	//		СообщитьОбИсключительнойОшибке(Ложь, ОписаниеОшибки());
	//		Возврат Ложь;
	//		
	//	конецПопытки;
	//КонецЕсли;	
	//
	//
	//
	
	
	//Если НЕ ДействияСОтмененнымиЗаказами = 3 Тогда // Ничего
	//	Если ДействияСОтмененнымиЗаказами = 2 Тогда // закрыть
	//		Информация = "";
	//		Если ЗакрытьЗаказы(МассивОтклоненныхДокументов, Информация) Тогда
	//			Если НЕ ПустаяСтрока(Информация) Тогда
	//				СообщитьПользователю("Сформирован и проведен документ " + Информация, Ложь);
	//			КонецЕсли;	
	//		Иначе	
	//			СообщитьОбИсключительнойОшибке(Ложь, Информация + Символы.ПС + ОписаниеОшибки());
	//			Возврат Ложь;
	//		КонецЕсли;	
	//	Иначе	
	//		Для Каждого ДокументПроведения Из МассивОтклоненныхДокументов Цикл
	//			ДокОбъект = ДокументПроведения.ПолучитьОбъект();
	//			Если ДействияСОтмененнымиЗаказами = 0 Тогда // Удалять
	//				Если НЕ ДокОбъект.ПометкаУдаления Тогда
	//					ДокОбъект.ПометкаУдаления = Истина;
	//					Попытка
	//						ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);			
	//					Исключение
	//						СообщитьОбИсключительнойОшибке(Ложь, "Ошибка при установке пометки на удаление документа: " + Строка(ДокументПроведения) + Символы.ПС + ОписаниеОшибки());
	//						Возврат Ложь;
	//					КонецПопытки;
	//				КонецЕсли;	
	//			Иначе // отменять
	//				Если ДокОбъект.Проведен Тогда
	//					Попытка
	//						ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);			
	//					Исключение
	//						СообщитьОбИсключительнойОшибке(Ложь, "Ошибка при отмене проведения документа: " + Строка(ДокументПроведения) + Символы.ПС + ОписаниеОшибки());
	//						Возврат Ложь;
	//					КонецПопытки;
	//				КонецЕсли;	
	//			КонецЕсли;	
	//		КонецЦикла;	
	//	КонецЕсли;
	//КонецЕсли;
	
	// не нужно регистрировать изменения для только что загруженных документов
	//Если мМассивЗагруженныхДокументов.Количество() <> 0 Тогда
	//	
	//	МассивУзлов = ПроцедурыОбменаССайтом.ПолучитьМассивУзловДляРегистрации(Ложь);
	//	
	//	Для Каждого СсылкаНаДокумент Из мМассивЗагруженныхДокументов Цикл
	//		ПланыОбмена.УдалитьРегистрациюИзменений(МассивУзлов, СсылкаНаДокумент);
	//	КонецЦикла;		
	//			
	//КонецЕсли;
	
	Отступ = Символы.НПП + Символы.НПП;
	
	КоличествоОбработанныхДокументов = ДеревоДокументов.Строки.Количество();
	
	Если КоличествоОбработанныхДокументов > 0 Тогда
		
		ТекстСообщения = "Успешно получено и обработано документов: " + Строка(КоличествоОбработанныхДокументов);
		
		
		ТекстСообщения = ТекстСообщения + Символы.ПС + "Список обработанных документов: ";		
		Для Каждого СтрокаДД Из ДеревоДокументов.Строки Цикл
			ТекстСообщения = ТекстСообщения + Символы.ПС + Отступ + СтрокаДД.ДокументОбъект.Ссылка;
		КонецЦикла;
		
		ТекстСообщения = ТекстСообщения + Символы.ПС + "В том числе:";
		Если СтруктураСтатистики.Создано <> 0 Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + Отступ + "создано новых: " + СтруктураСтатистики.Создано;
		КонецЕсли;
		
		Если СтруктураСтатистики.Обновлено <> 0 Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + Отступ + "обновлено: " + СтруктураСтатистики.Обновлено;
		КонецЕсли;
		
		Если СтруктураСтатистики.Пропущено <> 0 Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + Отступ + "пропущено: " + СтруктураСтатистики.Пропущено;
		КонецЕсли;
		
		Если СтруктураСтатистики.ОплаченСписок.Количество() > 0 Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + "Получено оплаченных документов: " + СтруктураСтатистики.ОплаченСписок.Количество();
			Для Каждого Док Из СтруктураСтатистики.ОплаченСписок Цикл
				ТекстСообщения = ТекстСообщения + Символы.ПС + Отступ + Док;
			КонецЦикла;
		КонецЕсли;	
		
		Если СтруктураСтатистики.ДоставкаРазрешенаСписок.Количество() > 0 Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + "Получено документов с разрешенной доставкой: " + СтруктураСтатистики.ДоставкаРазрешенаСписок.Количество();
			Для Каждого Док Из СтруктураСтатистики.ДоставкаРазрешенаСписок Цикл
				ТекстСообщения = ТекстСообщения + Символы.ПС + Отступ + Док;
			КонецЦикла;
		КонецЕсли;	
		
		Если СтруктураСтатистики.ФинальныйСтатусСписок.Количество() > 0 Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + "Получено документов в финальном статусе: " + СтруктураСтатистики.ФинальныйСтатусСписок.Количество();
			Для Каждого Док Из СтруктураСтатистики.ФинальныйСтатусСписок Цикл
				ТекстСообщения = ТекстСообщения + Символы.ПС + Отступ + Док;
			КонецЦикла;
		КонецЕсли;
		
		СообщитьПользователю(ТекстСообщения, Ложь);
		
	КонецЕсли;
	
	Возврат Успешно;
	
КонецФункции	

Функция ЗакрытьЗаказы(МассивДокументов, Информация)
	
	Если МассивДокументов.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	ЗакрытиеЗаказовПокупателейЗаказы.Ссылка
	|ИЗ
	|	Документ.ЗакрытиеЗаказовПокупателей.Заказы КАК ЗакрытиеЗаказовПокупателейЗаказы
	|ГДЕ
	|	ЗакрытиеЗаказовПокупателейЗаказы.Ссылка.Проведен
	|	И ЗакрытиеЗаказовПокупателейЗаказы.ПродажаИМ = &ЗаказПокупателя");
	
	Док = Документы.ЗакрытиеЗаказовПокупателей.СоздатьДокумент();
	Док.ВидОперации=Перечисления.ВидыОперацийЗакрытиеЗаказовПокупателей.ЗакрытиеЗаказов;
	Док.Дата = ТекущаяДата();
	Док.Комментарий = "Создан автоматически при обмене с сайтом";
	Док.Ответственный = параметрысеанса.Пользователь; //глЗначениеПеременной("глТекущийПользователь");
	
	Для Каждого ДокЗаказ Из МассивДокументов Цикл
		Запрос.УстановитьПараметр("ЗаказПокупателя", ДокЗаказ);
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			Продолжить;
		КонецЕсли;	
		НовСтрока = Док.Заказы.Добавить();
		НовСтрока.ЗаказПокупателя = ДокЗаказ;
		НовСтрока.ПричинаЗакрытияЗаказа = ПричинаЗакрытияЗаказов;
	КонецЦикла;	
	
	Если Док.Заказы.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;	
	
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
		Информация = Строка(Док);
	Исключение
		Информация = "Не удалось провести документ " + Док + " по причине: " + ОписаниеОшибки();
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
КонецФункции

Процедура ПолучитьРанееЗагруженныеДокументы(ДеревоДокументов)
	
	МассивНомеров = ДеревоДокументов.Строки.ВыгрузитьКолонку("НомерВходящий");
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Категория"	 , Справочники.КатегорииОбъектов.ЗаказСWEBСайта);
	Запрос.УстановитьПараметр("МассивНомеров", МассивНомеров);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заказ.Ссылка КАК ДокументСсылка
	|ИЗ
	|   Документ.ПродажаИМ КАК Заказ
	|   Внутреннее соединение РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	|		ПО (КатегорииОбъектов.Объект = Заказ.Ссылка)
	|			И КатегорииОбъектов.Категория = Значение(Справочник.КатегорииОбъектов.ЗаказСWEBСайта)
	|ГДЕ
	|	Заказ.НомерВходящегоДокументаЭлектронногоОбмена В (&МассивНомеров)";		
	
	РезультатЗапроса = Запрос.Выполнить();	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	МассивНайденныхСсылокНаДокументы = Новый Массив();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрокаДД = ДеревоДокументов.Строки.Найти(Выборка.ДокументСсылка.НомерВходящегоДокументаЭлектронногоОбмена, "НомерВходящий");
		СтрокаДД.РанееЗагруженныйДокументСсылка = Выборка.ДокументСсылка;			
		
		МассивНайденныхСсылокНаДокументы.Добавить(Выборка.ДокументСсылка);
		
	КонецЦикла;
	
	
	// ищем ссылки на ранее загруженные документы
	ТаблицаСсылок = НайтиПоСсылкам(МассивНайденныхСсылокНаДокументы);
	
	Для Каждого СтрокаТС Из ТаблицаСсылок Цикл
		
		Если Метаданные.РегистрыСведений.Содержит(СтрокаТС.Метаданные)
			ИЛИ СтрокаТС.Данные = СтрокаТС.Ссылка Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		СтрокаДД = ДеревоДокументов.Строки.Найти(СтрокаТС.Ссылка, "РанееЗагруженныйДокументСсылка");
		Если СтрокаДД<>Неопределено тогда
			СтрокаДД.ЕстьСсылкиНаРанееЗагруженныйДокумент = Истина;
		конецесли;
		
	КонецЦикла;	
	
	
	Для Каждого СтрокаДД Из ДеревоДокументов.Строки Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаДД.РанееЗагруженныйДокументСсылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = СтрокаДД.РанееЗагруженныйДокументСсылка.ПолучитьОбъект();
		
		Если НЕ СтрокаДД.ЕстьСсылкиНаРанееЗагруженныйДокумент Тогда
			
			ЗаполнитьЗначенияСвойств(ДокументОбъект, СтрокаДД.ДокументОбъект, , "Номер"); 
			ДокументОбъект.Товары.Очистить();
			ДокументОбъект.Услуги.Очистить();
			
			
		КонецЕсли;	
		
		// очищаем для всех
		//++++++++++
		
		//ДокументОбъект.Товары.Очистить();
		//ДокументОбъект.Услуги.Очистить();
		
		
		// уже не очищаем, а перезаписываем соотв. значения.
		
		
		СтрокаДД.ДокументОбъект = ДокументОбъект;		
		
	КонецЦикла;
	
КонецПроцедуры	

Функция ОбработатьДатуВремяCML(ДатаВремяСтрока, НачальнаяДата = Неопределено)
	
	ДатаВремя = Неопределено;
	
	Если ЗначениеЗаполнено(НачальнаяДата) Тогда
		Время 	  = СтрЗаменить(ДатаВремяСтрока, ":", "");
		ДатаВремя = Дата(Формат(НачальнаяДата, "ДФ=yyyyMMdd") + Время);
	Иначе	
		ДатаВремя = Дата(СтрЗаменить(ДатаВремяСтрока, "-", "") + "000000");	
	КонецЕсли;	
	
	Возврат ДатаВремя;
КонецФункции

Функция ОбработатьВалютуCML(КодВалютыСтрока)
	
	Валюта = Справочники.Валюты.НайтиПоНаименованию(КодВалютыСтрока);
	Возврат Валюта;
	
КонецФункции	

Функция СоздатьОбновитьДокументы(ДеревоДокументов, СтруктураСтатистики, МассивДокументовДляПроведения, МассивЗагруженныхДокументов)
	
	Успешно = Истина;
	//сообщить("------------- создать оюновить документы");
	Для Каждого Док Из ДеревоДокументов.Строки Цикл
		
		НовыйДокумент = Истина;
		ПризнакПроведения=Док.РанееЗагруженныйДокументСсылка.Проведен;
		
		
		// если не 3 статуса, тогда только обновляем статусы на сайте, номенклатуру, документы не перезаписываем!!!
		ТаблицаПараметров=Док.строки;
		Обновлять=Ложь;                                                 // имя колонки
		НайденнаяСтрока = ТаблицаПараметров.Найти("Статус заказа", "СвойствоНаименование");
		Значение=Неопределено;
		Если НайденнаяСтрока = Неопределено Тогда
		Иначе
			Значение = НайденнаяСтрока.СвойствоЗначение;
		КонецЕсли;
		
		НеПерезаписывать=Док.РанееЗагруженныйДокументСсылка.БольшеНеПерезаписыватьДокумент;
		Если Значение<>Неопределено Тогда
			Если СтрЧислоВхождений(Значение, "[T]")>0 Или СтрЧислоВхождений(Значение, "[C]")>0 или СтрЧислоВхождений(Значение, "[K]")>0 Тогда
				Обновлять=Истина;
			КонецЕСли;
		КонецЕсли;
		
		//	сообщить(""+Док.ДокументОбъект.НомерВходящегоДокументаЭлектронногоОбмена+"  "+Значение+"   "+Док.РанееЗагруженныйДокументСсылка+"  "+Обновлять);
		
		//-----------------------------------------------------------------------------
		Если Не Обновлять или НеПерезаписывать Тогда
			продолжить;
		КонецЕсли;	
		//-----------------------------------------------------------------------------
		
		
		// если на документ есть ссылки, то он вообще пропускается и не загружается  !!!
		Если Док.ЕстьСсылкиНаРанееЗагруженныйДокумент Тогда
			СтруктураСтатистики.Пропущено = СтруктураСтатистики.Пропущено + 1;
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Док.РанееЗагруженныйДокументСсылка) Тогда
			СтруктураСтатистики.Обновлено = СтруктураСтатистики.Обновлено + 1;
			НовыйДокумент = Ложь;
		Иначе
			СтруктураСтатистики.Создано   = СтруктураСтатистики.Создано + 1;
		КонецЕсли;	
		
		Попытка
			
			// отдельная работа с комментарием
			Если Не ПустаяСтрока(Док.ДокументОбъект.Комментарий) Тогда
				Попытка
					СтрокаИмениСайта = Док.Строки.Найти("Сайт", "СвойствоНаименование");
					Если СтрокаИмениСайта = Неопределено Тогда
						ИмяСайта = HTTPОбменСервер;
					Иначе					
						ИмяСайта = СтрокаИмениСайта.СвойствоЗначение;
					КонецЕсли;
					Док.ДокументОбъект.Комментарий   = Док.ДокументОбъект.Комментарий + " " + ИмяСайта;
				Исключение
				КонецПопытки;
			КонецЕсли;
			
			
			Если НЕ НовыйДокумент Тогда
				// вдруг поменялся статус!!! он меняется после сохранения.
				Док.ДокументОбъект.СостояниеНакладной = Док.РанееЗагруженныйДокументСсылка.СостояниеНакладной;
				Док.ДокументОбъект.ВидОплаты = Док.РанееЗагруженныйДокументСсылка.ВидОплаты;
				Док.ДокументОбъект.ДатаОтгрузки = Док.РанееЗагруженныйДокументСсылка.ДатаОтгрузки;
				
				ПересчетТЧ(Док.ДокументОбъект,"Товары",Рубли,Рубли,1,1,Истина); 
				ПроверкаНаСертификаты(Док.ДокументОбъект);  // установка цен на сертификаты.
				
				Док.ДокументОбъект.ПодарочныеСертификаты.Очистить();
				
				Для каждого ТекСтрока из Док.РанееЗагруженныйДокументСсылка.ПодарочныеСертификаты цикл
					
					НовСтр=Док.ДокументОбъект.ПодарочныеСертификаты.добавить();
					НовСтр.номерСертификата=Док.РанееЗагруженныйДокументСсылка.ПодарочныеСертификаты[0].номерСертификата;
					НовСтр.Номинал=Док.РанееЗагруженныйДокументСсылка.ПодарочныеСертификаты[0].Номинал;
					НовСтр.СрокДействия=Док.РанееЗагруженныйДокументСсылка.ПодарочныеСертификаты[0].СрокДействия;
					НовСтр.Сертификат=Док.РанееЗагруженныйДокументСсылка.ПодарочныеСертификаты[0].сертификат;
					НовСтр.СуммаОплатыСертификатами=Док.РанееЗагруженныйДокументСсылка.ПодарочныеСертификаты[0].СуммаОплатыСертификатами;
					
				КонецЦикла;
				
				//------------------------------------
				// создаем сертификат
				Если Док.ДокументОбъект.СуммаБонуса<>0 Тогда
					
					// проверяем есть ли сертификаты и его сумму или создаем новый, если сертификата нет.
					Если Док.ДокументОбъект.ПодарочныеСертификаты.Количество()=0 Тогда
						
						НовыйСертиф=Справочники.ПодарочныеСертификаты.СоздатьЭлемент();
						НовыйСертиф.Владелец=Справочники.Номенклатура.НайтиПоКоду("SNL-254357");
						НовыйСертиф.ВидСертификата=справочники.ВидыПодарочныхСертификатов.ЕЕИзЧека;
						НовыйСертиф.Подарок=Истина;
						НовыйСертиф.Использован=истина;
						НовыйСертиф.Номинал=Док.ДокументОбъект.СуммаБонуса;
						//Если ТекущаяДата()>='20110401' Тогда
						//	НовыйСертиф.ПодразделениеВыдачи=Справочники.Подразделения.НайтиПоКоду("SSP-0004");  // тц
						//	НовыйСертиф.ПодразделениеПредъявления=Справочники.Подразделения.НайтиПоКоду("SSP-0004");
						//	НовыйСертиф.ПодразделениеПолучатель=Справочники.Подразделения.НайтиПоКоду("SSP-0004");
						//Иначе	
						НовыйСертиф.ПодразделениеВыдачи=Справочники.Подразделения.НайтиПоКоду("SSP-0004");
						НовыйСертиф.ПодразделениеПредъявления=Справочники.Подразделения.НайтиПоКоду("SSP-0004");
						НовыйСертиф.ПодразделениеПолучатель=Справочники.Подразделения.НайтиПоКоду("SSP-0004");
						//КонецЕсли;
						//НовыйСертиф.ПодразделениеЗатрат=Справочники.Подразделения.НайтиПоКоду("SSP-0083");
						
						НовыйСертиф.СрокДействия=360;
						НовыйСертиф.ДатаВыдачи=ТекущаяДата();
						НовыйСертиф.ДатаПогашения=ТекущаяДата();
						НовыйСертиф.НомерЧекаВыдачи=Док.РанееЗагруженныйДокументСсылка.номер;
						НовыйСертиф.НомерЧекаПогашения=Док.РанееЗагруженныйДокументСсылка.номер;
						НовыйСертиф.Записать();
						
						//-----------------------------------------------
						// добавляем в строку сетрификаты.
						
						НовСер=Док.ДокументОбъект.ПодарочныеСертификаты.добавить();
						НовСер.Сертификат=НовыйСертиф.Ссылка;
						НовСер.НомерСертификата=НовыйСертиф.Код;
						НовСер.Номинал=НовыйСертиф.номинал;
						НовСер.СуммаОплатыСертификатами=НовыйСертиф.номинал;
						
						
					КонецЕсли;
				Иначе
					
					// проверяем сумму, перезаписываем
					Если Док.ДокументОбъект.ПодарочныеСертификаты.Итог("Номинал")<>Док.ДокументОбъект.суммаБонуса Тогда
						
						Сертиф=Док.ДокументОбъект.ПодарочныеСертификаты[0].Сертификат.ПолучитьОбъект();
						Сертиф.Номинал=Док.ДокументОбъект.суммаБонуса;
						Сертиф.записать();
						
						Док.ДокументОбъект.ПодарочныеСертификаты[0].номинал=Док.ДокументОбъект.суммаБонуса;
						
						
					КонецЕсли;
					
				КонецЕсли;
				
				
				
				
			Иначе
				УстановитьНомерДокумента2(Док.ДокументОбъект);
				
				// пересчет строк
				//------------------------------------
				// создаем сертификат
				Если Док.ДокументОбъект.СуммаБонуса<>0 Тогда
					
					// проверяем есть ли сертификаты и его сумму или создаем новый, если сертификата нет.
					Если Док.ДокументОбъект.ПодарочныеСертификаты.Количество()=0 Тогда
						
						НовыйСертиф=Справочники.ПодарочныеСертификаты.СоздатьЭлемент();
						НовыйСертиф.Владелец=Справочники.Номенклатура.НайтиПоКоду("SNL-254357");
						НовыйСертиф.ВидСертификата=справочники.ВидыПодарочныхСертификатов.ЕЕИзЧека;
						НовыйСертиф.Подарок=Истина;
						НовыйСертиф.Использован=истина;
						НовыйСертиф.Номинал=Док.ДокументОбъект.СуммаБонуса;
						//Если ТекущаяДата()>='20110401' Тогда
						//	НовыйСертиф.ПодразделениеВыдачи=Справочники.Подразделения.НайтиПоКоду("SSP-0004");  // тц
						//	НовыйСертиф.ПодразделениеПредъявления=Справочники.Подразделения.НайтиПоКоду("SSP-0004");
						//	НовыйСертиф.ПодразделениеПолучатель=Справочники.Подразделения.НайтиПоКоду("SSP-0004");
						//Иначе	
						НовыйСертиф.ПодразделениеВыдачи=Справочники.Подразделения.НайтиПоКоду("SSP-0004");
						НовыйСертиф.ПодразделениеПредъявления=Справочники.Подразделения.НайтиПоКоду("SSP-0004");
						НовыйСертиф.ПодразделениеПолучатель=Справочники.Подразделения.НайтиПоКоду("SSP-0004");
						//КонецЕсли;
						
						НовыйСертиф.СрокДействия=360;
						НовыйСертиф.ДатаВыдачи=ТекущаяДата();
						НовыйСертиф.ДатаПогашения=ТекущаяДата();
						НовыйСертиф.НомерЧекаВыдачи=Док.ДокументОбъект.номер;
						НовыйСертиф.НомерЧекаПогашения=Док.ДокументОбъект.номер;
						НовыйСертиф.Записать();
						
						//-----------------------------------------------
						// добавляем в строку сертификаты.
						
						НовСер=Док.ДокументОбъект.ПодарочныеСертификаты.добавить();
						НовСер.Сертификат=НовыйСертиф.Ссылка;
						НовСер.НомерСертификата=НовыйСертиф.код;
						НовСер.Номинал=НовыйСертиф.номинал;
						НовСер.СуммаОплатыСертификатами=НовыйСертиф.номинал;
						
						
					КонецЕсли;
					
					
					
				КонецЕсли;
				//-------------------------------------
				
				ПересчетТЧ(Док.ДокументОбъект,"Товары",Рубли,Рубли,1,1,Истина); 
				ПроверкаНаСертификаты(Док.ДокументОбъект);
			КонецЕсли;	
			
			
			Попытка
				Док.ДокументОбъект.Записать();
			Исключение
				СообщитьОбИсключительнойОшибке(Ложь,""+ Док.ДокументОбъект+ ОписаниеОшибки());
				ЗаписатьВЛог("ОбменССайтом",""+ Док.ДокументОбъект+ОписаниеОшибки(),"");
				Возврат Ложь;
			конецПопытки;
			
			
			Если ПризнакПроведения Тогда
				
				МассивДокументовДляПроведения.Добавить(Док.ДокументОбъект.ссылка);
				
			КонецЕсли;	
			
			
			
			
			//*********************************************			
			
			//	Если ПризнакПроведения и НЕ Док.ДокументОбъект.ПометкаУдаления  ТОгда
			//		
			//		//МассивДокументовДляПроведения.Добавить(Док.ДокументОбъект);
			//		Попытка
			//			Док.ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			//		Исключение
			//			СообщитьОбИсключительнойОшибке(Ложь,""+ Док.ДокументОбъект+ ОписаниеОшибки());
			//			ЗаписатьВЛог("ОбменССайтом",""+ Док.ДокументОбъект+ОписаниеОшибки(),"");
			//			Возврат Ложь;
			//		конецПопытки;
			//		
			//	КонецЕсли;	
			//
			//	
			//	Если ПризнакПроведения и Док.ДокументОбъект.ПометкаУдаления  ТОгда
			//	Попытка
			//			Док.ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			//		Исключение
			//			СообщитьОбИсключительнойОшибке(Ложь,""+ Док.ДокументОбъект+ ОписаниеОшибки());
			//			ЗаписатьВЛог("ОбменССайтом",""+ Док.ДокументОбъект+ОписаниеОшибки(),"");
			//			Возврат Ложь;
			//   		конецПопытки;
			//КонецЕсли;
			//	
			//	
			//	Если НЕ ПризнакПроведения ТОгда
			//		Попытка
			//			Док.ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			//		Исключение
			//			СообщитьОбИсключительнойОшибке(Ложь,""+ Док.ДокументОбъект+ ОписаниеОшибки());
			//			ЗаписатьВЛог("ОбменССайтом",""+ Док.ДокументОбъект+ОписаниеОшибки(),"");
			//			Возврат Ложь;
			//   		конецПопытки;
			//	КонецЕсли;
			
			
			
			
			
			
			//*********************************************			
			
			СсылкаНаДокумент = Док.ДокументОбъект.Ссылка;
			
			МассивЗагруженныхДокументов.Добавить(СсылкаНаДокумент);
			
			//Если ПроводитьДокументы 
			//	ИЛИ Док.ДокументОбъект.Проведен Тогда
			//	
			//	МассивДокументовДляПроведения.Добавить(Док.ДокументОбъект);	
			//	
			//КонецЕсли;
			
		Исключение
			
			СообщитьОбИсключительнойОшибке(Ложь, ОписаниеОшибки());
			Возврат Ложь;
			
		КонецПопытки;
		
	КонецЦикла;	
	
	Возврат Успешно;
	
КонецФункции

Процедура ПроверкаНаСертификаты(Док)
	
	Для каждого ТекСтрока Из Док.Товары Цикл
		
		Если ТекСтрока.Номенклатура.Код="SNL-096562" Тогда
			ТекСтрока.Цена=500;
			ТекСтрока.ЦенаБезСкидки=500;
			ТекСтрока.Скидка=-1;
			РассчитатьСуммуТабЧасти(ТекСтрока, Док);	
		КонецЕсли;
		
		Если ТекСтрока.Номенклатура.Код="SNL-095774" Тогда
			ТекСтрока.Цена=1000;
			ТекСтрока.ЦенаБезСкидки=1000;
			ТекСтрока.Скидка=-1;
			РассчитатьСуммуТабЧасти(ТекСтрока, Док);
		КонецЕсли;
		
		Если ТекСтрока.Номенклатура.Код="SNL-096577" Тогда
			ТекСтрока.Цена=2000;
			ТекСтрока.ЦенаБезСкидки=2000;
			ТекСтрока.Скидка=-1;
			РассчитатьСуммуТабЧасти(ТекСтрока, Док);
		КонецЕсли;
		
		Если ТекСтрока.Номенклатура.Код="SNL-096561" Тогда
			ТекСтрока.Цена=3000;
			ТекСтрока.ЦенаБезСкидки=3000;
			ТекСтрока.Скидка=-1;
			РассчитатьСуммуТабЧасти(ТекСтрока, Док);
		КонецЕсли;
		
		Если ТекСтрока.Номенклатура.Код="SNL-231090" Тогда
			ТекСтрока.Цена=5000;
			ТекСтрока.ЦенаБезСкидки=5000;
			ТекСтрока.Скидка=-1;
			РассчитатьСуммуТабЧасти(ТекСтрока, Док);
		КонецЕсли;
		
		//крохин начало 22.09.2011
		Если ТекСтрока.Номенклатура.Код="SNL-279212" Тогда
			ТекСтрока.Цена=7000;
			ТекСтрока.ЦенаБезСкидки=7000;
			ТекСтрока.Скидка=-1;
			РассчитатьСуммуТабЧасти(ТекСтрока, Док);
		КонецЕсли;
		Если ТекСтрока.Номенклатура.Код="SNL-279214" Тогда
			ТекСтрока.Цена=10000;
			ТекСтрока.ЦенаБезСкидки=10000;
			ТекСтрока.Скидка=-1;
			РассчитатьСуммуТабЧасти(ТекСтрока, Док);
		КонецЕсли;
		
		
		//крохин конец 22.09.2011
		
	КонецЦикла;
	
	
	
КонецПроцедуры


Функция ЗаписатьСвойстваДокументов(ДеревоДокументов, СтруктураСтатистики, МассивОтклоненныхДокументов)
	// тут пишутся только свойства - метод оплаты способ доставки и т.д.
	Успешно = Истина;
	//Сообщить("----------записать свойства");
	Для Каждого СтрокаДД Из ДеревоДокументов.Строки Цикл
		// регистр категории объектов
		
		
		// если не 3 статуса, тогда только обновляем статусы на сайте, номенклатуру, документы не перезаписываем!!!
		ТаблицаПараметров=СтрокаДД.строки;
		Обновлять=Ложь;                                                 // имя колонки
		НайденнаяСтрока = ТаблицаПараметров.Найти("Статус заказа", "СвойствоНаименование");
		Значение=Неопределено;
		Если НайденнаяСтрока=Неопределено Тогда
		Иначе
			Значение = НайденнаяСтрока.СвойствоЗначение;
		КонецЕсли;
		
		Если Значение<>Неопределено Тогда
			Если СтрЧислоВхождений(Значение, "[T]")>0 Или СтрЧислоВхождений(Значение, "[C]")>0 или СтрЧислоВхождений(Значение, "[K]")>0 Тогда
				Обновлять=Истина;
			КонецЕСли;
		КонецЕсли;
		
		//	сообщить(""+СтрокаДД.ДокументОбъект.НомерВходящегоДокументаЭлектронногоОбмена+"  "+Значение+"   "+СтрокаДД.РанееЗагруженныйДокументСсылка+"  "+Обновлять);
		
		//-----------------------------------------------------------------------------
		Если Не Обновлять и СтрокаДД.РанееЗагруженныйДокументСсылка.Пустая() Тогда
			продолжить;
		КонецЕсли;	
		//-----------------------------------------------------------------------------
		
		
		
		
		Успешно = УстановитьКатегориюДокумента(СтрокаДД.ДокументОбъект.Ссылка, Справочники.КатегорииОбъектов.ЗаказСWEBСайта, Истина);
		
		Если НЕ Успешно Тогда
			СообщитьПользователю("Не удалось установить категорию документа ""Заказ с WEB-сайта""", Ложь);
			Прервать;
		КонецЕсли;	
		// вот тут можно перезапись документа сделать.				
		Для Каждого ТоварУслугаСвойство Из СтрокаДД.Строки Цикл
			
			Если НЕ ЗначениеЗаполнено(ТоварУслугаСвойство.СвойствоНаименование) Тогда
				Продолжить;
			КонецЕсли;
			
			КатегорияСсылка = мСоответствиеНаименованийКатегорийДокумента[ТоварУслугаСвойство.СвойствоНаименование];
			
			Если КатегорияСсылка <> Неопределено Тогда
				
				ОбъектПринадлежитКатегории = (ТоварУслугаСвойство.СвойствоЗначение = БулевоЗначениеCML_Истина)
				ИЛИ (ТоварУслугаСвойство.СвойствоЗначение = БулевоЗначениеCML_Да);
				
				Успешно = УстановитьКатегориюДокумента(СтрокаДД.ДокументОбъект.Ссылка, КатегорияСсылка, ОбъектПринадлежитКатегории);
				
				Если НЕ Успешно Тогда
					
					СообщитьПользователю("Не удалось установить категорию документа - " + Строка(КатегорияСсылка), Ложь);
					Прервать;
					
				КонецЕсли;
				
				Если ОбъектПринадлежитКатегории Тогда
					
					Если КатегорияСсылка = Справочники.КатегорииОбъектов.СостояниеЗаказаНаWEBСайтеОплачен Тогда
						СтруктураСтатистики.ОплаченСписок.Добавить(СтрокаДД.ДокументОбъект.Ссылка);
					ИначеЕсли КатегорияСсылка = Справочники.КатегорииОбъектов.СостояниеЗаказаНаWEBСайтеДоставкаРазрешена Тогда
						СтруктураСтатистики.ДоставкаРазрешенаСписок.Добавить(СтрокаДД.ДокументОбъект.Ссылка);
					ИначеЕсли КатегорияСсылка = Справочники.КатегорииОбъектов.СостояниеЗаказаНаWEBСайтеЗавершен Тогда
						СтруктураСтатистики.ФинальныйСтатусСписок.Добавить(СтрокаДД.ДокументОбъект.Ссылка);
					ИначеЕсли КатегорияСсылка = Справочники.КатегорииОбъектов.СостояниеЗаказаНаWEBСайтеОтменен Тогда
						МассивОтклоненныхДокументов.Добавить(СтрокаДД.ДокументОбъект.Ссылка);
					КонецЕСли;	
					
				КонецЕсли;
				
			Иначе 
				
				ИмяСвойства      = ТоварУслугаСвойство.СвойствоНаименование;
				ЗначениеСвойства = ТоварУслугаСвойство.СвойствоЗначение;
				
				Если ЗначениеЗаполнено(ИмяСвойства)
					И ЗначениеЗаполнено(ЗначениеСвойства) Тогда
					
					Успешно = НайтиСоздатьУстановитьСвойствоДокумента(СтрокаДД.ДокументОбъект.Ссылка, ИмяСвойства, ЗначениеСвойства);
					
					Если НЕ Успешно Тогда
						СообщитьПользователю("Не удалось установить свойство документа - " + ИмяСвойства, Ложь);
						Прервать;
					КонецЕсли;	
					
				КонецЕсли;
				
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЦикла;	
	
	Возврат Успешно;
	
КонецФункции	

Функция УстановитьКатегориюДокумента(ОбъектСсылка, КатегорияСсылка, ОбъектПринадлежитКатегории);
	
	НаборЗаписей = РегистрыСведений.КатегорииОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(ОбъектСсылка);
	НаборЗаписей.Отбор.Категория.Установить(КатегорияСсылка);
	
	Если ОбъектПринадлежитКатегории Тогда
		
		Запись = НаборЗаписей.Добавить();
		Запись.Объект = ОбъектСсылка;
		Запись.Категория = КатегорияСсылка;
		
	КонецЕсли;	
	
	Попытка
		
		НаборЗаписей.Записать();
		
	Исключение
		СообщитьОбИсключительнойОшибке(Ложь, "Не удалось установить/снять категорию """ + КатегорияСсылка.Наименование + """ документу " + Строка(ОбъектСсылка));
		Возврат Ложь;
	КонецПопытки;
	
	
	Возврат Истина;
	
КонецФункции	

Функция НайтиСоздатьУстановитьСвойствоДокумента(ОбъектСсылка, ИмяСвойства, ЗначениеСвойства);
	
	//++-++
	Успешно = Истина;
	
	//возврат успешно;
	
	СвойствоСсылка 	 = ПланыВидовХарактеристик.СвойстваОбъектов.ПустаяСсылка();
	НазначениеСсылка = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.ПродажаИМ;
	
	ТипНазначенияСвойств = Новый ОписаниеТипов("ДокументСсылка.ПродажаИМ");
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Назначение" , НазначениеСсылка);
	Запрос.УстановитьПараметр("ИмяСвойства", ИмяСвойства);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СвойстваОбъектов.Ссылка Как СвойствоСсылка
	|ИЗ
	|	ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектов
	|ГДЕ
	|	СвойстваОбъектов.НазначениеСвойства = &Назначение
	|	И СвойстваОбъектов.Наименование = &ИмяСвойства";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СвойствоСсылка = Выборка.СвойствоСсылка;	
	КонецЕсли;	
	
	Если СвойствоСсылка = ПланыВидовХарактеристик.СвойстваОбъектов.ПустаяСсылка() Тогда
		
		НовоеСвойство = ПланыВидовХарактеристик.СвойстваОбъектов.СоздатьЭлемент();
		НовоеСвойство.НазначениеСвойства = НазначениеСсылка;
		НовоеСвойство.Наименование 		 = ИмяСвойства;
		ОписаниеТипов 					 = Новый ОписаниеТипов(Строка(ТипЗнч(ЗначениеСвойства)));
		НовоеСвойство.ТипЗначения 		 = ОписаниеТипов;	
		
		Попытка 
			НовоеСвойство.Записать();
		Исключение
			СообщитьОбИсключительнойОшибке(Ложь, "Не удалось записать свойство документа " + ИмяСвойства);
			Возврат Ложь;
		КонецПопытки;	
		
		СвойствоСсылка = НовоеСвойство.Ссылка;
		
	КонецЕсли;	
	
	Запись = РегистрыСведений.ЗначенияСвойствОбъектовИнтернетМагазин.СоздатьМенеджерЗаписи();
	Запись.Значение = ЗначениеСвойства;
	Запись.Объект	= ОбъектСсылка;
	Запись.Свойство = СвойствоСсылка;
	
	Попытка
		Запись.Записать();
	Исключение
		Успешно = Ложь;
		СообщитьОбИсключительнойОшибке(Ложь, "Не удалось записать значение свойства " + ЗначениеСвойства);
	КонецПопытки;
	
	// после записи документа, устанавливаются статусы и признаки.
	//-------------------------------------------------------------------------------------------------------
	
	
	
	
	Если ОбъектСсылка.договор.пустая() Тогда
		// заполняем договор
		
		
		Если СвойствоСсылка.Наименование="Метод оплаты" Тогда
			Договор=Неопределено;
			Если ЗначениеСвойства="Наличный расчет" ТОгда
				Договор=справочники.Договоры.НайтиПоКоду("SNL-005815"); // основной
			ИначеЕсли ЗначениеСвойства="Пластиковой картой курьеру" Тогда
				Договор=справочники.Договоры.НайтиПоКоду("SNL-006149"); // без нал пк
			ИначеЕсли ЗначениеСвойства="Банковским переводом" Тогда
				Договор=справочники.Договоры.НайтиПоКоду("SNL-006147"); // почтой
			ИначеЕсли ЗначениеСвойства="Пластиковой картой, электронными деньгами, через терминалы QIWI, Элекснет, Comepay и другие, SMS платеж (предоплата)" Тогда
				Договор=справочники.Договоры.НайтиПоКоду("SNL-006148"); // инет кошелек
			КонецЕсли;	
			
			
			Если Договор<>Неопределено Тогда
				ДокОбъект=ОбъектСсылка.получитьОбъект();
				ДокОбъект.Договор=Договор;
				ДокОбъект.Записать();
			КонецЕсли;
			
		КонецЕсли;
		
		
		
		
	КонецЕсли;
	
	
	//РежимЗаписи=РежимЗаписиДокумента.Запись;
	//Если ИмяСвойства="Статус заказа" Тогда
	//	// ищем значения перепроводим документ
	//	//к оплате, упаковывается, упаковано....
	//	
	//	Если Найти(ЗначениеСвойства,"[M]")>0 или (Найти(ЗначениеСвойства,"[P]")>0)или (Найти(ЗначениеСвойства,"[A]")>0) или (Найти(ЗначениеСвойства,"[R]")>0) Тогда
	//		ДокОбъект=ОбъектСсылка.получитьОбъект();
	//		ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВНаборе;
	//	ИначеЕсли Найти(ЗначениеСвойства,"[C]")>0 или (Найти(ЗначениеСвойства,"[T]")>0) или (Найти(ЗначениеСвойства,"[G]")>0) или
	//		(Найти(ЗначениеСвойства,"[S]")>0) или (Найти(ЗначениеСвойства,"[B]")>0)  или (Найти(ЗначениеСвойства,"[F]")>0) Тогда
	//		
	//		ДокОбъект=ОбъектСсылка.получитьОбъект();
	//		ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена;
	//		
	//	ИначеЕсли Найти(ЗначениеСвойства,"[Z]")>0 или (Найти(ЗначениеСвойства,"[Y]")>0) Тогда
	//		ДокОбъект=ОбъектСсылка.получитьОбъект();
	//		ДокОбъект.пометкаУдаления=Истина;
	//		ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
	//	Иначе
	//		ДокОбъект=ОбъектСсылка.получитьОбъект();
	//		ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
	//	КонецЕсли;
	//	
	//	
	//	Если ДокОбъект.Проведен Тогда 
	//		РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения;
	//		
	//	КонецЕсли;		
	//	
	//	Если ДокОбъект.Проведен и ДокОбъект.пометкаУдаления=ЛОжь Тогда 
	//		РежимЗаписи=РежимЗаписиДокумента.Проведение;
	//	КонецЕсли;		
	//		
	//	ДокОбъект.Записать(РежимЗаписи);
	//	
	//КонецЕсли; 
	
	
	Возврат Успешно;
	
КонецФункции	

Функция ИдентифицироватьКонтрагентов(ДеревоДокументов)
	
	Успешно = Истина;
	
	Для Каждого СтрокаДД Из ДеревоДокументов.Строки Цикл
		
		Если СтрокаДД.ЕстьСсылкиНаРанееЗагруженныйДокумент Тогда
			Продолжить;
		КонецЕсли;	
		
		//ОтобразитьСостояние("Идентификация контрагента: " + СтрокаДД.СтруктураДанныхКонтрагента.Наименование);
		//	
		//	Запрос = Новый Запрос();
		//	
		//	ИНН = "";
		//	СтрокаДД.СтруктураДанныхКонтрагента.Свойство("ИНН", ИНН);
		//	Запрос.УстановитьПараметр("Наименование", СтрокаДД.СтруктураДанныхКонтрагента.Наименование);
		//	Запрос.УстановитьПараметр("ИНН", ИНН);
		//	
		//	Запрос.Текст =
		//		"ВЫБРАТЬ ПЕРВЫЕ 1
		//		|	Контрагенты.Ссылка Как Контрагент
		//		|ИЗ
		//		|	Справочник.Контрагенты КАК Контрагенты
		//		|ГДЕ
		//		|";
		//		
		//	НуженПоискПоИнн = (СпособИдентификацииКонтрагентов = "ИНН") 
		//		И ЗначениеЗаполнено(ИНН);
		//		
		//	Если НуженПоискПоИнн Тогда
		//		Запрос.Текст = Запрос.Текст + " Контрагенты.ИНН = &ИНН ";
		//	Иначе
		//		Запрос.Текст = Запрос.Текст + " Контрагенты.Наименование = &Наименование ";
		//	КонецЕсли;
		//			
		//	Выборка = Запрос.Выполнить().Выбрать();
		//	
		//	Если Выборка.Следующий() Тогда
		//		КонтрагентСсылка = Выборка.Контрагент;
		//	Иначе
		//		КонтрагентСсылка = СоздатьКонтрагента(СтрокаДД.СтруктураДанныхКонтрагента);
		//	КонецЕсли;
		//	
		//	Если НЕ ЗначениеЗаполнено(КонтрагентСсылка) Тогда
		//		
		//		Успешно = Ложь;
		//		Прервать;
		//		
		//	КонецЕсли;
		
		КонтрагентСсылка=Справочники.Контрагенты.НайтиПоКоду("SSR-0519"); // частное лицо инет магазин
		
		
		//	ЗаполнитьПодчиненныеДанныеКонтрагента(КонтрагентСсылка, СтрокаДД.СтруктураДанныхКонтрагента);
		
		Док = СтрокаДД.ДокументОбъект;
		
		Док.Контрагент = КонтрагентСсылка;
		Док.ТипСкидок=Справочники.ТипыСкидок.НайтиПоКоду("SNL-0008");
		
		//	Успешно = ПроверитьОсновнойДоговорКонтрагента(КонтрагентСсылка, Док);
		
		Если НЕ Успешно Тогда
			Прервать;
		КонецЕсли;
		//	
		//мСтруктураПараметровДляПолученияДоговора = ЗаполнениеДокументов.ПолучитьСтруктуруПараметровДляПолученияДоговораЗаказаПокупателя();
		//
		//// нужны только договоры с покупателем и все
		//мСтруктураПараметровДляПолученияДоговора.СписокДопустимыхВидовДоговоров.Очистить();
		//мСтруктураПараметровДляПолученияДоговора.СписокДопустимыхВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
		//
		//СписокДопустимыхВидовВзаиморасчетов = Новый СписокЗначений();
		//СписокДопустимыхВидовВзаиморасчетов.Добавить(Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам);
		//мСтруктураПараметровДляПолученияДоговора.Вставить("СписокДопустимыхВидовВзаиморасчетов", СписокДопустимыхВидовВзаиморасчетов);
		//
		//мСтруктураПараметровДляПолученияДоговора.Вставить("ВалютаВзаиморасчетовДоговора", Док.Валюта);
		//мСтруктураПараметровДляПолученияДоговора.Вставить("ВидСравненияВалютыВзаиморасчетов", "=");
		//
		//ЗаполнениеДокументов.ПриИзмененииЗначенияКонтрагента(Док, мСтруктураПараметровДляПолученияДоговора);							
		//
		//Если Не ЗначениеЗаполнено(Док.ДоговорКонтрагента) Тогда
		//	
		//	мСтруктураПараметровДляПолученияДоговора.Удалить("ВалютаВзаиморасчетовДоговора");
		//	мСтруктураПараметровДляПолученияДоговора.Удалить("ВидСравненияВалютыВзаиморасчетов");
		//
		//	ЗаполнениеДокументов.ПриИзмененииЗначенияКонтрагента(Док, мСтруктураПараметровДляПолученияДоговора);
		//	
		//	Если Не ЗначениеЗаполнено(Док.ДоговорКонтрагента) Тогда
		//		
		//		Док.ДоговорКонтрагента = СоздатьДоговорПоПараметрам(Док.Контрагент, Док.Организация, Док.Валюта);
		//		
		//	КонецЕсли;
		//	
		//КонецЕсли;
		
	КонецЦикла;	
	
	Возврат Успешно;
	
КонецФункции

Функция СоздатьДоговорПоПараметрам(Контрагент, Организация, ВалютаВзаиморасчетов)
	
	НайденныйДоговорОбъект = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	НайденныйДоговорОбъект.Наименование = "Договор WEB - сайт";
	
	Если НЕ ЗначениеЗаполнено(ВалютаВзаиморасчетов) Тогда
		ВалютаВзаиморасчетов = ПараметрыСеанса.ВалютаУпр; // глЗначениеПеременной("ВалютаУправленческогоУчета");
	КонецЕсли;
	
	НайденныйДоговорОбъект.ВалютаВзаиморасчетов = ВалютаВзаиморасчетов;
	НайденныйДоговорОбъект.Организация = Организация;
	НайденныйДоговорОбъект.Владелец           = Контрагент;
	НайденныйДоговорОбъект.ВидУсловийДоговора = Перечисления.ВидыУсловийДоговоровВзаиморасчетов.БезДополнительныхУсловий;
	НайденныйДоговорОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
	НайденныйДоговорОбъект.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам;
	
	Попытка
		НайденныйДоговорОбъект.Записать();
	Исключение
		СообщитьОбИсключительнойОшибке(Ложь, ОписаниеОшибки(), "Не удалось записать договор контрагента.");
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат НайденныйДоговорОбъект.Ссылка;
	
КонецФункции

Функция ПроверитьОсновнойДоговорКонтрагента(КонтрагентСсылка, ДокОбъект)
	
	Успешно = Истина;
	
	Если ЗначениеЗаполнено(КонтрагентСсылка.ОсновнойДоговорКонтрагента) Тогда
		Возврат Успешно;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокОбъект.Организация) Тогда
		
		СообщитьПользователю("Не удалось определить основной договор контрагента (не найдена организация).", Ложь);
		Возврат Ложь;	
		
	КонецЕсли;
	
	// ищем договр по контрагенту, организации и валюте
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Организация = &Организация
	|	И ДоговорыКонтрагентов.ВидВзаиморасчетов = Значение(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам)
	|	И ДоговорыКонтрагентов.ВидДоговора = Значение(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)";
	
	Запрос.УстановитьПараметр("Организация", ДокОбъект.Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТекущийДоговор = Неопределено;
	
	ВалютаВзаиморасчетов = ДокОбъект.Валюта;
	
	Если НЕ ЗначениеЗаполнено(ВалютаВзаиморасчетов) Тогда
		ВалютаВзаиморасчетов = константы.ВалютаУпрУчета.Получить(); //глЗначениеПеременной("ВалютаУправленческогоУчета");
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		ТекущийДоговор = Выборка.Ссылка;
		Если Выборка.ВалютаВзаиморасчетов = ВалютаВзаиморасчетов Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ТекущийДоговор) Тогда
		
		ТекущийДоговор = СоздатьДоговорПоПараметрам(КонтрагентСсылка, ДокОбъект.Организация, ВалютаВзаиморасчетов);
		
		Если Не ЗначениеЗаполнено(ТекущийДоговор) Тогда
			Возврат Ложь;
		КонецЕсли;	
		
	КонецЕсли;
	
	Попытка
		
		КонтрагентОбъект = КонтрагентСсылка.ПолучитьОбъект();
		КонтрагентОбъект.ОсновнойДоговорКонтрагента = ТекущийДоговор;
		КонтрагентОбъект.Записать();
		
	Исключение
		СообщитьОбИсключительнойОшибке(Ложь, ОписаниеОшибки(), "Не удалось записать основной договор контрагенту.");
		Успешно = Ложь;
	КонецПопытки;		
	
	Возврат Успешно;
	
КонецФункции

Функция ПолучитьПоСтруктуреСтрокиСФИО(СтруктураДанныхКонтрагента)
	
	ТекущаяСтрока = "";
	Фамилия = "";
	Имя = "";
	Отчество = "";
	
	СтруктураДанныхКонтрагента.Свойство("Фамилия", Фамилия);
	СтруктураДанныхКонтрагента.Свойство("Имя", Имя);
	СтруктураДанныхКонтрагента.Свойство("Отчество", Отчество);
	
	Если ЗначениеЗаполнено(Фамилия) Тогда
		ТекущаяСтрока = Фамилия;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Имя) Тогда
		ТекущаяСтрока = СокрЛП(ТекущаяСтрока + " " + Имя);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отчество) Тогда
		ТекущаяСтрока = СокрЛП(ТекущаяСтрока + " " + Отчество);
	КонецЕсли;
	
	Возврат ТекущаяСтрока;
	
КонецФункции

Функция СоздатьКонтрагента(СтруктураДанныхКонтрагента)
	
	НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
	НовыйКонтрагент.Родитель = ГруппаДляНовыхКонтрагентов;
	
	ЗаполнитьЗначенияСвойств(НовыйКонтрагент, СтруктураДанныхКонтрагента);
	СтрокаФИО = ПолучитьПоСтруктуреСтрокиСФИО(СтруктураДанныхКонтрагента);
	
	Если Не ПустаяСтрока(СтрокаФИО) 
		И СтрокаФИО <> НовыйКонтрагент.НаименованиеПолное
		Тогда
		
		НовыйКонтрагент.НаименованиеПолное = НовыйКонтрагент.НаименованиеПолное + " [" + СтрокаФИО + "]";
		
	КонецЕсли;
	
	НовыйКонтрагент.Покупатель = Истина;
	
	Попытка
		НовыйКонтрагент.Записать();
	Исключение
		СообщитьОбИсключительнойОшибке(Ложь, ОписаниеОшибки());
	КонецПопытки;	
	
	Возврат НовыйКонтрагент.Ссылка;
	
КонецФункции	

Функция ОпределитьВидНоменклатурыПоТипу(ТипНоменклатуры)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|ВидыНоменклатуры.Ссылка КАК ВидНоменклатуры
	|ИЗ
	|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|ГДЕ
	|	ВидыНоменклатуры.ТипНоменклатуры = &ТипНоменклатуры
	|";
	Запрос.УстановитьПараметр("ТипНоменклатуры", ТипНоменклатуры);	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить()[0].ВидНоменклатуры;
	
КонецФункции

Функция ИнициализироватьВидыНоменкалтуры()
	
	Если ЗначениеЗаполнено(мВидНоменклатурыТовар)
		И ЗначениеЗаполнено(мВидНоменклатурыУслуга) Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	мВидНоменклатурыТовар = Перечисления.ВидыНоменклаутры.Товар;
	мВидНоменклатурыУслуга = Перечисления.ВидыНоменклаутры.Услуга;	
	
	Если ЗначениеЗаполнено(мВидНоменклатурыТовар)
		И ЗначениеЗаполнено(мВидНоменклатурыУслуга) Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(мВидНоменклатурыТовар) Тогда
		
		СообщитьПользователю("Не удалось найти вид номенклатуры: Товар", Ложь);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(мВидНоменклатурыУслуга) Тогда
		
		СообщитьПользователю("Не удалось найти вид номенклатуры: Услуга", Ложь);
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Распределяет заданную сумму по выбранной колонке 
//
// Параметры: 
//  ИмяКолонки         - cтрока, имя колонки, по которой распределяется сумма ("Количество" или "Сумма");
//  СуммаРаспределения - число, распределяемая сумма
//
//
Процедура РаспределитьСуммуПоКолонке(ДокументОбъект, Товары, ИмяТабЧасти, СуммаРаспределения)	
	
	МассивДанныхКолонки = Товары.ВыгрузитьКолонку("Сумма");
	
	МассивРаспределения = ПроцедурыОбменаССайтом.РаспределитьПропорционально(СуммаРаспределения, МассивДанныхКолонки);
	
	Если МассивРаспределения = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	мТекущийПользователь = ПараметрыСеанса.Пользователь; //глЗначениеПеременной("глТекущийПользователь");
	
	Индекс = 0;
	Для каждого СтрокаТабличнойЧасти Из Товары Цикл
		
		СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Сумма + МассивРаспределения[Индекс];
		//ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(СтрокаТабличнойЧасти, ДокументОбъект, мТекущийПользователь ,,истина, ,истина, ИмяТабЧасти);
		
		Индекс = Индекс + 1;
	КонецЦикла;
	
КонецПроцедуры

Функция ИдентифицироватьНоменклатуру(ДеревоДокументов)
	
	//++++++++++++++++++++++++++++++++++++++++
	//	сообщить("------------ идентифицировать номенклатуры");
	Успешно = Истина;
	
	Успешно = ИнициализироватьВидыНоменкалтуры();
	
	Если НЕ Успешно Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Для Каждого СтрокаДД Из ДеревоДокументов.Строки Цикл
		
		//Если СтрокаДД.ЕстьСсылкиНаРанееЗагруженныйДокумент Тогда
		//	Продолжить;
		//КонецЕсли;	
		
		
		//*************************************************************************************
		// не грузим определененные параметры, не обновляем номенклатуру в этом случае.
		ТаблицаПараметров=СтрокаДД.строки;
		Обновлять=Ложь;                                                 // имя колонки
		НайденнаяСтрока = ТаблицаПараметров.Найти("Статус заказа", "СвойствоНаименование");
		Значение=Неопределено;
		Если НайденнаяСтрока = Неопределено Тогда
		Иначе
			Значение = НайденнаяСтрока.СвойствоЗначение;
		КонецЕсли;
		
		НеПерезаписывать=СтрокаДД.РанееЗагруженныйДокументСсылка.БольшеНеПерезаписыватьДокумент;
		
		Если Значение<>Неопределено Тогда
			Если СтрЧислоВхождений(Значение, "[T]")>0 Или СтрЧислоВхождений(Значение, "[C]")>0 или СтрЧислоВхождений(Значение, "[K]")>0  Тогда
				Обновлять=Истина;
			КонецЕСли;
		КонецЕсли;
		//сообщить(""+СтрокаДД.ДокументОбъект.НомерВходящегоДокументаЭлектронногоОбмена+"  "+Значение+"   "+СтрокаДД.РанееЗагруженныйДокументСсылка+" --"+Обновлять);
		//-------------------------------------------------------------------------------------
		Если Не Обновлять или НеПерезаписывать Тогда
			продолжить;
		КонецЕсли;	
		//-------------------------------------------------------------------------------------
		//*************************************************************************************
		
		ОтобразитьСостояние("Идентификация товаров в документе: " + СтрокаДД.ДокументОбъект);
		
		Для Каждого ТоварУслугаСвойство Из СтрокаДД.Строки Цикл
			Номенклатура=Неопределено;
			Если ЗначениеЗаполнено(ТоварУслугаСвойство.СвойствоНаименование) Тогда
				Продолжить;
			КонецЕсли;
			
			ТипНоменклатурыCML = "";
			
			Для Каждого ПодчиненнаяСтрокаТовараУслуги Из ТоварУслугаСвойство.Строки Цикл
				
				Если ЗначениеЗаполнено(ПодчиненнаяСтрокаТовараУслуги.ЗначениеРеквизитаНаименование)
					И ПодчиненнаяСтрокаТовараУслуги.ЗначениеРеквизитаНаименование = ЗначениеCML_ТипНоменклатуры Тогда
					
					ТипНоменклатурыCML = ПодчиненнаяСтрокаТовараУслуги.ЗначениеРеквизитаЗначение;
					Прервать;
					
				КонецЕсли;	
				
			КонецЦикла;			
			
			ХарактеристикаНоменклатуры =Неопределено;  //Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
			СтавкаНДСНоменклатуры = ?(ЗначениеЗаполнено(ТоварУслугаСвойство.СтавкаНДС), ТоварУслугаСвойство.СтавкаНДС, СтрокаДД.СтавкаНДС);
			
			Если ТипНоменклатурыCML = ТипНоменклатурыCML_Услуга Тогда	
				Номенклатура = НайтиСоздатьНоменклатуру(ТоварУслугаСвойство, мВидНоменклатурыУслуга, СтавкаНДСНоменклатуры);
			Иначе
				Номенклатура = НайтиСоздатьНоменклатуру(ТоварУслугаСвойство, мВидНоменклатурыТовар, СтавкаНДСНоменклатуры, ХарактеристикаНоменклатуры);
				//++-++
			КонецЕсли;
			
			РСкидка=0;
			ТипЦен=Справочники.ТипыЦен.НайтиПоКоду("SSP-0301");
			Попытка
				ЦенаТовараЧЛ=ПолучитьЦенуНоменклатуры(Номенклатура.Родитель,,ТипЦен,СтрокаДД.ДокументОбъект.Валюта,1,СтрокаДД.ДокументОбъект.ДатаВходящегоДокументаЭлектронногоОбмена);
				//крохин начало 06.03.2012
				//эл. сертификат
				Если Номенклатура.Код = "SNL-288462" Тогда
					ЦенаТовараЧЛ = ТоварУслугаСвойство.ТоварУслугаЦенаЗаЕдиницу;
				КонецЕсли;
				//крохин конец 06.03.2012
				Если Число(Формат((ЦенаТовараЧЛ*0.9),"ЧДЦ=2"))=ТоварУслугаСвойство.ТоварУслугаЦенаЗаЕдиницу Тогда
					РСкидка=10;
				КонецЕсли;	
				Если Число(Формат((ЦенаТовараЧЛ*0.8),"ЧДЦ=2"))=ТоварУслугаСвойство.ТоварУслугаЦенаЗаЕдиницу Тогда
					РСкидка=20;
				КонецЕсли;	
			Исключение
			КонецПопытки;
			
			
			
			//!!!! добавляем документ первый раз
			Если СтрокаДД.РанееЗагруженныйДокументСсылка.пустая() Тогда
				
				
				Если Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Услуга Тогда
					
					// добавляем в новый документ (обновляем старый)
					НовСтрока = СтрокаДД.ДокументОбъект.Услуги.Добавить();
					НовСтрока.Номенклатура = Номенклатура;
					НовСтрока.Единица 		     = Номенклатура.основнаяЕдиница; //.ЕдиницаХраненияОстатков;
					НовСтрока.Содержание   = Номенклатура.Наименование;
					НовСтрока.Количество   = ТоварУслугаСвойство.ТоварУслугаКоличество;
					НовСтрока.Заявка   = ТоварУслугаСвойство.ТоварУслугаКоличество;
					НовСтрока.ПодтвержденнаяЗаявка   = ТоварУслугаСвойство.ТоварУслугаКоличество;
					НовСтрока.Коэффициент      			 = Номенклатура.ОсновнаяЕдиница.Коэффициент;
					НовСтрока.СтавкаНДС    = ПолучитьСтавкуНДС(Номенклатура);
					НовСтрока.Сумма	= РассчитатьСуммуСУчетомСкидок(ТоварУслугаСвойство);
					НовСтрока.Скидка= ТоварУслугаСвойство.СуммаСкидки;
					Если РСкидка>0 Тогда 
						НовСтрока.Скидка= РСкидка;
					КонецЕсли;   
					
					
					Если ЗначениеЗаполнено(ТоварУслугаСвойство.ТоварУслугаЦенаЗаЕдиницу) Тогда
						НовСтрока.Цена = ТоварУслугаСвойство.ТоварУслугаЦенаЗаЕдиницу;
					Иначе
						Если НовСтрока.Количество > 0 Тогда
							НовСтрока.Цена = НовСтрока.Сумма / НовСтрока.Количество;	
						КонецЕсли;
					КонецЕсли;	
					
					СтавкаНДС=ПроцентНДСпоСтавке(НовСтрока.СтавкаНДС);
					НовСтрока.НДС	=НовСтрока.Сумма*СтавкаНДС/(1+СтавкаНДС);			
					НовСтрока.Всего	=НовСтрока.Сумма;
					НовСтрока.Сумма  =НовСтрока.Всего-НовСтрока.НДС;
					
					
					//	РассчитатьСуммуТабЧасти(НовСтрока, СтрокаДД.ДокументОбъект);
					//ПриИзмененииСуммыТабЧасти(НовСтрока, СтрокаДД.ДокументОбъект);
					//ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(НовСтрока, СтрокаДД.ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"),,истина, ,истина, "Услуги");
					//ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НовСтрока, СтрокаДД.ДокументОбъект);
					
				Иначе	
					// вид товар новый документ
					
					НовСтрока = СтрокаДД.ДокументОбъект.Товары.Добавить();
					НовСтрока.Номенклатура     			 = Номенклатура;
					НовСтрока.Единица 		     = Номенклатура.основнаяЕдиница; //.ЕдиницаХраненияОстатков;
					НовСтрока.Количество   	   	 = ТоварУслугаСвойство.ТоварУслугаКоличество;
					НовСтрока.Заявка   = ТоварУслугаСвойство.ТоварУслугаКоличество;
					НовСтрока.ПодтвержденнаяЗаявка   = ТоварУслугаСвойство.ТоварУслугаКоличество;
					НовСтрока.Коэффициент      			 = Номенклатура.ОсновнаяЕдиница.Коэффициент;
					НовСтрока.СтавкаНДС    = ПолучитьСтавкуНДС(Номенклатура);
					НовСтрока.Сумма	= РассчитатьСуммуСУчетомСкидок(ТоварУслугаСвойство);
					НовСтрока.Скидка= ТоварУслугаСвойство.СуммаСкидки;
					Если РСкидка>0 Тогда 
						НовСтрока.Скидка= РСкидка;
					КонецЕсли;   
					
					
					Если ЗначениеЗаполнено(ТоварУслугаСвойство.ТоварУслугаЦенаЗаЕдиницу) Тогда
						НовСтрока.Цена = ТоварУслугаСвойство.ТоварУслугаЦенаЗаЕдиницу;							
					Иначе
						Если НовСтрока.Количество > 0 Тогда
							НовСтрока.Цена = НовСтрока.Сумма / НовСтрока.Количество;	
						КонецЕсли;
					КонецЕсли;
					//РассчитатьСуммуТабЧасти(НовСтрока, СтрокаДД.ДокументОбъект);
					//ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(НовСтрока, СтрокаДД.ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"),,истина, ,истина, "Товары");
					//ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НовСтрока, СтрокаДД.ДокументОбъект);
					//
				КонецЕсли;
				
			Иначе
				//!!!!! уже есть документ, нужно проверить откорректировать данные по документу
				// Проверяем есть ли в наличии, добавляем половину со старого док, половину по новому.
				
				
				Если Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Услуга Тогда
					
					// услуги просто обновляем		
					
					// добавляем в новый документ (обновляем старый)
					НовСтрока = СтрокаДД.ДокументОбъект.Услуги.Добавить();
					НовСтрока.Номенклатура = Номенклатура;
					НовСтрока.Единица 		     = Номенклатура.основнаяЕдиница; //.ЕдиницаХраненияОстатков;
					НовСтрока.Содержание   = Номенклатура.Наименование;
					НовСтрока.Количество   = ТоварУслугаСвойство.ТоварУслугаКоличество;
					НовСтрока.Заявка   = ТоварУслугаСвойство.ТоварУслугаКоличество;
					НовСтрока.ПодтвержденнаяЗаявка   = ТоварУслугаСвойство.ТоварУслугаКоличество;
					НовСтрока.Коэффициент      			 = Номенклатура.ОсновнаяЕдиница.Коэффициент;
					НовСтрока.СтавкаНДС    = ПолучитьСтавкуНДС(Номенклатура);
					НовСтрока.Сумма	= РассчитатьСуммуСУчетомСкидок(ТоварУслугаСвойство);
					НовСтрока.Скидка= ТоварУслугаСвойство.СуммаСкидки;
					Если РСкидка>0 Тогда 
						НовСтрока.Скидка= РСкидка;
					КонецЕсли;   
					
					
					Если ЗначениеЗаполнено(ТоварУслугаСвойство.ТоварУслугаЦенаЗаЕдиницу) Тогда
						НовСтрока.Цена = ТоварУслугаСвойство.ТоварУслугаЦенаЗаЕдиницу;
					Иначе
						Если НовСтрока.Количество > 0 Тогда
							НовСтрока.Цена = НовСтрока.Сумма / НовСтрока.Количество;	
						КонецЕсли;
					КонецЕсли;	
					
					СтавкаНДС=ПроцентНДСпоСтавке(НовСтрока.СтавкаНДС);
					НовСтрока.НДС	=НовСтрока.Сумма*СтавкаНДС/(1+СтавкаНДС);			
					НовСтрока.Всего	=НовСтрока.Сумма;
					НовСтрока.Сумма  =НовСтрока.Всего-НовСтрока.НДС;
					
					
					//	РассчитатьСуммуТабЧасти(НовСтрока, СтрокаДД.ДокументОбъект);
					//ПриИзмененииСуммыТабЧасти(НовСтрока, СтрокаДД.ДокументОбъект);
					//ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(НовСтрока, СтрокаДД.ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"),,истина, ,истина, "Услуги");
					//ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НовСтрока, СтрокаДД.ДокументОбъект);
					
				Иначе
					
					// если вид товары и документ уже был загружен
					
					СтрокаИзСущДок=СтрокаДД.РанееЗагруженныйДокументСсылка.Товары;
					
					НайденнаяСтрока = СтрокаИзСущДок.Найти(Номенклатура, "Номенклатура");
					Если НайденнаяСтрока = Неопределено Тогда
						//тогда добавляем просто
						НовСтрока = СтрокаДД.ДокументОбъект.Товары.Добавить();
						НовСтрока.Номенклатура     	 = Номенклатура;
						НовСтрока.Единица 		     = Номенклатура.основнаяЕдиница; //.ЕдиницаХраненияОстатков;
						НовСтрока.Количество   	   	 = ТоварУслугаСвойство.ТоварУслугаКоличество;
						НовСтрока.Заявка   = ТоварУслугаСвойство.ТоварУслугаКоличество;
						НовСтрока.ПодтвержденнаяЗаявка   = ТоварУслугаСвойство.ТоварУслугаКоличество;
						НовСтрока.Коэффициент      		 = Номенклатура.ОсновнаяЕдиница.Коэффициент;
						НовСтрока.СтавкаНДС    = ПолучитьСтавкуНДС(Номенклатура);
						НовСтрока.Сумма	= РассчитатьСуммуСУчетомСкидок(ТоварУслугаСвойство);
						НовСтрока.Скидка= ТоварУслугаСвойство.СуммаСкидки;
						Если РСкидка>0 Тогда 
							НовСтрока.Скидка= РСкидка;
						КонецЕсли;   
						
						
						Если ЗначениеЗаполнено(ТоварУслугаСвойство.ТоварУслугаЦенаЗаЕдиницу) Тогда
							НовСтрока.Цена = ТоварУслугаСвойство.ТоварУслугаЦенаЗаЕдиницу;
						Иначе
							Если НовСтрока.Количество > 0 Тогда
								НовСтрока.Цена = НовСтрока.Сумма / НовСтрока.Количество;	
							КонецЕсли;
						КонецЕсли;
						
					Иначе
						//изменяем подтв. количество и общее количество
						
						
						НовСтрока = СтрокаДД.ДокументОбъект.Товары.Добавить();
						
						НовСтрока.Заявка   = НайденнаяСтрока.Заявка;
						
						НовСтрока.Номенклатура 	 = Номенклатура;
						НовСтрока.Единица 	= Номенклатура.основнаяЕдиница; //.ЕдиницаХраненияОстатков;
						НовСтрока.Количество   	 = ТоварУслугаСвойство.ТоварУслугаКоличество;
						НовСтрока.ПодтвержденнаяЗаявка   = ТоварУслугаСвойство.ТоварУслугаКоличество;
						НовСтрока.Коэффициент    = Номенклатура.ОсновнаяЕдиница.Коэффициент;
						НовСтрока.СтавкаНДС    = ПолучитьСтавкуНДС(Номенклатура);
						НовСтрока.Сумма	= РассчитатьСуммуСУчетомСкидок(ТоварУслугаСвойство);						
						НовСтрока.Скидка= ТоварУслугаСвойство.СуммаСкидки;
						
						Если РСкидка>0 Тогда 
							НовСтрока.Скидка= РСкидка;
						КонецЕсли;   
						
						
						Если ЗначениеЗаполнено(ТоварУслугаСвойство.ТоварУслугаЦенаЗаЕдиницу) Тогда
							НовСтрока.Цена = ТоварУслугаСвойство.ТоварУслугаЦенаЗаЕдиницу;
						Иначе
							Если НовСтрока.Количество > 0 Тогда
								НовСтрока.Цена = НовСтрока.Сумма / НовСтрока.Количество;	
							КонецЕсли;
						КонецЕсли;
						
						
					КонецЕсли;
					
					
				КонецЕсли;
				
				
				
			КонецЕсли;
			
			
			// смотрим не пропустили ли удаленные строки из заказа, их добавляем и обнуляем подтв. заявку и количество.???
			// нет они анс не интересуют		
			
			
			
		КонецЦикла;
		
		//Если НЕ СтрокаДД.СкидкаВСумме = Истина Тогда
		//	
		//	СуммаСкидки = СтрокаДД.СуммаСкидки;
		//	
		//	Если СуммаСкидки <> 0 Тогда
		//		
		//		Если СтрокаДД.ДокументОбъект.Товары.Количество() > 0 Тогда
		//			РаспределитьСуммуПоКолонке(СтрокаДД.ДокументОбъект, СтрокаДД.ДокументОбъект.Товары, "Товары", -СуммаСкидки);
		//		Иначе
		//			РаспределитьСуммуПоКолонке(СтрокаДД.ДокументОбъект, СтрокаДД.ДокументОбъект.Услуги, "Услуги", -СуммаСкидки);
		//		КонецЕсли;					
		//		
		//	КонецЕсли;
		//	
		//КонецЕсли;
		
	КонецЦикла;	
	
	Возврат Успешно;
	
КонецФункции	

Функция РассчитатьСуммуСУчетомСкидок(СтрокаТовара);
	
	Сумма 		= СтрокаТовара.ТоварУслугаСумма;
	ЦенаЗаЕдиницу 	= СтрокаТовара.ТоварУслугаЦенаЗаЕдиницу;
	СуммаСкидки = 0;
	
	Для Каждого СтрокаСкидки Из СтрокаТовара.Строки Цикл
		
		Если ЗначениеЗаполнено(СтрокаСкидки.СуммаСкидки)Тогда
			//И НЕ СтрокаСкидки.СкидкаВСумме Тогда
			
			СуммаСкидки = СуммаСкидки + СтрокаСкидки.СуммаСкидки;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Если СуммаСкидки>0 Тогда
		СтрокаТовара.СуммаСкидки=Окр((СуммаСкидки*100/(ЦенаЗаЕдиницу+СуммаСкидки)),0);
	Иначе
		СтрокаТовара.СуммаСкидки=0;
	КонецЕсли;	
	
	// Сумма = Сумма - СуммаСкидки;		
	Возврат Сумма;
	
КонецФункции

Функция ПолучитьИдНоменклатуры(Знач Ид)
	
	ПозицияРазделителя = Найти(Ид, "#");
	Если ПозицияРазделителя > 0 Тогда
		ИдНоменклатуры = Лев(Ид, ПозицияРазделителя - 1);
	Иначе
		ИдНоменклатуры = Ид;
	КонецЕсли;
	
	Если Ид="ORDER_DELIVERY" Тогда 
		Ид="SNL-228028";
	КонецЕсли;	
	
	Если Ид="ORDER_DELIVERY" Тогда 
		Ид="SNL-228028";
	КонецЕсли;	
	
	
	
	Возврат ИдНоменклатуры;
	
КонецФункции

Функция ПолучитьИдХарактеристики(Знач Ид)
	
	ПозицияРазделителя = Найти(Ид, "#");
	Если ПозицияРазделителя > 0 Тогда
		ИдХарактеристики = Прав(Ид, СтрДлина(Ид) - ПозицияРазделителя);
	Иначе
		ИдХарактеристики = "";
	КонецЕсли;	
	
	Возврат ИдХарактеристики;
	
КонецФункции

Функция ВыполнитьПоискНоменклатурыХарактеристикиПоСсылкам(СтрокаТовара, Номенклатура, ХарактеристикаНоменклатуры)
	
	Если НЕ ЗначениеЗаполнено(СтрокаТовара.ТоварУслугаИд) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		
		ИдНоменклатуры = СтрокаТовара.ТоварУслугаИд; //ПолучитьИдНоменклатуры(СтрокаТовара.ТоварУслугаИд);
		
		Если ИдНоменклатуры="ORDER_DELIVERY" Тогда
			ИдНоменклатуры="SNL-228028";
		КонецЕсли;
		
		Если ИдНоменклатуры="91206" Тогда  // 500 сертификат
			ИдНоменклатуры="SNL-096562";
		КонецЕсли;
		
		Если ИдНоменклатуры="91205" Тогда // 1000 
			ИдНоменклатуры="SNL-095774";
		КонецЕсли;
		
		Если ИдНоменклатуры="91204" Тогда // 2000 
			ИдНоменклатуры="SNL-096577";
		КонецЕсли;
		
		Если ИдНоменклатуры="91203" Тогда // 3000 
			ИдНоменклатуры="SNL-096561";
		КонецЕсли;
		//крохин начало 22.09.2011
		//завели заново на сайте
		//Если ИдНоменклатуры="91198" Тогда // 5000 
		Если ИдНоменклатуры="124354" Тогда // 5000 
			//крохин конец 22.09.2011
			ИдНоменклатуры="SNL-231090";
		КонецЕсли;
		
		//крохин начало 22.09.2011
		//новые номиналы
		Если ИдНоменклатуры="124352" Тогда // 7000
			ИдНоменклатуры="SNL-279212";
		КонецЕсли;
		Если ИдНоменклатуры="124353" Тогда // 10000
			ИдНоменклатуры="SNL-279214";
		КонецЕсли;		
		//крохин конец 22.09.2011
		
		
		Если ИдНоменклатуры="90429" Тогда
			ИдНоменклатуры="SNL-232812"; // скидка на первичный заказ
			ПризПервичнойСкидки10=Истина;
		КонецЕсли;
		
		//крохин начало 06.03.2012
		//электронные сертификаты
		Если ИдНоменклатуры="133691" Тогда // эл. сертификат
			ИдНоменклатуры="SNL-288462";
		КонецЕсли;
		//крохин конец 06.03.2012
		
		
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду(ИдНоменклатуры);   //.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдНоменклатуры));
		Если Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда			
			Возврат Ложь;
		КонецЕсли;
		
		Если Номенклатура.ПолучитьОбъект() = Неопределено Тогда
			// Объект не найден
			СообщитьПользователю("Номенклатура не найдена по уникальному идентификатору: " + ИдНоменклатуры, Ложь);
			Возврат Ложь;
		КонецЕсли;	
		
		//Если НЕ Номенклатура.ВестиУчетПоХарактеристикам Тогда
		//	Возврат Истина;
		//КонецЕсли;
		//
		//ИдХарактеристики = ПолучитьИдХарактеристики(СтрокаТовара.ТоварУслугаИд);
		//Если ПустаяСтрока(ИдХарактеристики) Тогда
		//	Возврат Истина;
		//КонецЕсли;
		
		ХарактеристикаНоменклатуры =Неопределено; //= Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдХарактеристики));
		
		//Если ХарактеристикаНоменклатуры = ПустаяХарактеристикаСсылка Тогда
		//	Возврат Истина;
		//КонецЕсли;
		//	
		//Если ХарактеристикаНоменклатуры.ПолучитьОбъект() = Неопределено Тогда
		//	СообщитьПользователю("Объект <ХарактеристикаНоменклатуры> не найден: " + Строка(ИдХарактеристики)
		//		+ ". Будет создан новый объект.", Ложь);
		//		
		//	Возврат Ложь;
		//	
		//КонецЕсли;			
		
		
		Возврат Истина;
		
	Исключение
		
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Функция НайтиНоменклатуруПоНаименованиюИВиду(НаименованиеНоменклатуры, ВидНоменклатуры)
	
	// поиск номенклатуры по наименованию и виду
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
	Запрос.УстановитьПараметр("Наименование", НаименованиеНоменклатуры);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Номенклатура.Ссылка Как Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
	|	И Номенклатура.Наименование = &Наименование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Номенклатура;
		
	КонецЕсли;	
	
	Возврат Неопределено;
	
КонецФункции

Функция НайтиСоздатьНоменклатуру(СтрокаТовара, Знач ВидНоменклатуры, СтавкаНДС, ХарактеристикаНоменклатуры = Неопределено)
	
	Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	ХарактеристикаНоменклатуры = Неопределено;
	
	УспешноНайдено = ВыполнитьПоискНоменклатурыХарактеристикиПоСсылкам(СтрокаТовара, Номенклатура, ХарактеристикаНоменклатуры);
	Если УспешноНайдено Тогда
		Возврат Номенклатура;
	КонецЕсли;	
	
	ХарактеристикаНоменклатуры = Неопределено;
	
	ВидНоменклатуры=Перечисления.ВидыНоменклаутры.Услуга; 	
	Номенклатура = НайтиНоменклатуруПоНаименованиюИВиду(СтрокаТовара.ТоварУслугаНаименование, ВидНоменклатуры);
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Номенклатура;
	КонецЕсли;
	
	ЕдиницаПоКлассификатору =неопределено;  //Справочники.Единицы.НайтиПоКоду("");   //кеди.КлассификаторЕдиницИзмерения.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(СтрокаТовара.ТоварУслугаБазоваяЕдиницаКод) Тогда
		ЕдиницаПоКлассификатору = Справочники.ОКЕИ.НайтиПоКоду(СтрокаТовара.ТоварУслугаБазоваяЕдиницаКод);
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ЕдиницаПоКлассификатору)
		И ЗначениеЗаполнено(СтрокаТовара.ТоварУслугаБазоваяЕдиница) Тогда
		
		ЕдиницаПоКлассификатору = Справочники.ОКЕИ.НайтиПоНаименованию(СтрокаТовара.ТоварУслугаБазоваяЕдиница, Истина);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЕдиницаПоКлассификатору) Тогда
		
		ЕдиницаПоКлассификатору = ЕдиницаИзмеренияНовойНоменклатуры;
		
	КонецЕсли;	
	//#tckb
	//Сообщить("Не найдена номенклатура "+СтрокаТовара.ТоварУслугаИд+" - "+СтрокаТовара.ТоварУслугаНаименование+ " создана новая ");
	Номенклатура = Справочники.Номенклатура.СоздатьЭлемент();
	
	Номенклатура.БазоваяЕдиница = ЕдиницаПоКлассификатору;
	Номенклатура.Код = СтрокаТовара.ТоварУслугаИд;
	Номенклатура.Родитель				 = ГруппаДляНовойНоменклатуры;
	Номенклатура.ВидНоменклатуры 		 = ВидНоменклатуры;
	Номенклатура.Комментарий 			 = СтрокаТовара.ТоварУслугаКомментарий;
	Номенклатура.Наименование 			 = СтрокаТовара.ТоварУслугаНаименование;
	//	Номенклатура.НаименованиеПолное		 = СтрокаТовара.ТоварУслугаНаименование;
	//Номенклатура.СтавкаНДС 				 = СтавкаНДС;
	
	
	Номенклатура.Услуга 				 = ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Услуга;	
	
	Попытка
		
		Номенклатура.Записать();
		Если ОбменТоварами
			И ВыгружатьТолькоИзменения Тогда
			//9999	
			ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбменаТоварами, Номенклатура.Ссылка);
		КонецЕсли;
		
	Исключение
		
		СообщитьОбИсключительнойОшибке(Ложь, ОписаниеОшибки());
		Возврат Справочники.Номенклатура.ПустаяСсылка();
		
	КонецПопытки;	
	
	//ЕдиницаХраненияОстатков = Справочники.Единицы.СоздатьЭлемент();
	//
	//ЕдиницаХраненияОстатков.Наименование            = Номенклатура.БазоваяЕдиница.Наименование;
	//ЕдиницаХраненияОстатков.ОКЕИ  = Номенклатура.БазоваяЕдиница;
	//ЕдиницаХраненияОстатков.Коэффициент             = 1;
	//ЕдиницаХраненияОстатков.Владелец                = Номенклатура.Ссылка;
	//
	//Попытка
	//	ЕдиницаХраненияОстатков.Записать();
	//Исключение
	//	СообщитьОбИсключительнойОшибке(Ложь, ОписаниеОшибки());
	//	Возврат Справочники.Номенклатура.ПустаяСсылка();
	//КонецПопытки;	
	//
	//Номенклатура.ЕдиницаХраненияОстатков = ЕдиницаХраненияОстатков.Ссылка;
	//Номенклатура.ЕдиницаДляОтчетов 		 = ЕдиницаХраненияОстатков.Ссылка;
	
	Попытка
		Номенклатура.Записать();
	Исключение
		СообщитьОбИсключительнойОшибке(Ложь, ОписаниеОшибки());
		Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	КонецПопытки;	
	
	Возврат Номенклатура.Ссылка;	
	
КонецФункции				

Функция ОпределитьПоТтипуИмяПоляКонтактнойИнформации(ИмяТипа)
	
	ИмяПоля = "Поле10";
	
	Если ИмяТипа = "Почтовый индекс"
		ИЛИ ИмяТипа = "Страна" Тогда
		ИмяПоля = "Поле1";
	ИначеЕсли ИмяТипа = "Регион" Тогда
		ИмяПоля = "Поле2";
	ИначеЕсли ИмяТипа = "Район" Тогда
		ИмяПоля = "Поле3";
	ИначеЕсли ИмяТипа = "Город" Тогда
		ИмяПоля = "Поле4";
	ИначеЕсли ИмяТипа = "Населенный пункт" Тогда
		ИмяПоля = "Поле5";
	ИначеЕсли ИмяТипа = "Улица" Тогда
		ИмяПоля = "Поле6";
	ИначеЕсли ИмяТипа = "Дом" Тогда
		ИмяПоля = "Поле7";
	ИначеЕсли ИмяТипа = "Корпус" Тогда
		ИмяПоля = "Поле8";
	ИначеЕсли ИмяТипа = "Квартира" Тогда
		ИмяПоля = "Поле9";
	Конецесли;		
	
	Возврат ИмяПоля;
	
КонецФункции

Процедура ОпределитьПоданнымТипВидКонтактнойИнформации(КонтактТип, ТипКИ, ВидКИ)
	
	Если КонтактТип = "ТелефонРабочий" Тогда
		
		ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон;
		ВидКИ = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
		
	ИначеЕсли КонтактТип = "Почта" Тогда
		
		ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		ВидКИ = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПодчиненныеДанныеКонтрагента(КонтрагентСсылка, СтруктураДанныхКонтрагента)
	
	возврат;
	
	ДеревоАдресов = СтруктураДанныхКонтрагента.ДеревоАдресов;
	
	Для Каждого СтрокаДерева Из ДеревоАдресов.Строки Цикл
		
		Если СтрокаДерева.ВидАдреса = "Адрес" Тогда
			ВидАдреса = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
		ИначеЕсли СтрокаДерева.ВидАдреса = "АдресДоставки" Тогда	
			ВидАдреса = Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента;
		Иначе	
			ВидАдреса = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;			
		КонецЕсли;
		
		НаборКИ = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
		НаборКИ.отбор.Объект.Установить(КонтрагентСсылка);
		НаборКИ.отбор.Тип.Установить(Перечисления.ТипыКонтактнойИнформации.Адрес);
		НаборКИ.отбор.Вид.Установить(ВидАдреса);
		
		СтрокаКи = НаборКИ.Добавить();
		СтрокаКи.Объект = КонтрагентСсылка;
		СтрокаКи.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		СтрокаКи.Вид = ВидАдреса;
		
		СтрокаКи.Комментарий = СтрокаДерева.Комментарий;
		СтрокаКи.Представление = СтрокаДерева.Представление;
		
		Для Каждого СтрокаУточнения Из СтрокаДерева.Строки Цикл
			
			Если СтранаРФ(СтрокаУточнения) Тогда
				Продолжить;
			КонецЕсли;	
			
			ИмяПоля = ОпределитьПоТтипуИмяПоляКонтактнойИнформации(СтрокаУточнения.ПолеТип);
			СтрокаКи[ИмяПоля] = СтрокаУточнения.ПолеЗначение;
			
		КонецЦикла;
		
		НаборКИ.Записать();				
		
	КонецЦикла;	
	
	//контакты
	ТаблицаКонтактов = СтруктураДанныхКонтрагента.ТаблицаКонтактов;
	Для Каждого СтрокаДерева Из ТаблицаКонтактов Цикл
		
		//КонтактТип
		//КонтактЗначение
		//КонтактКомментарий
		
		ТипКИ = Неопределено;
		ВидКИ = Неопределено;
		
		ОпределитьПоданнымТипВидКонтактнойИнформации(СтрокаДерева.КонтактТип, ТипКИ, ВидКИ);
		
		Если Не ЗначениеЗаполнено(ТипКИ)
			ИЛИ Не ЗначениеЗаполнено(ВидКИ) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		НаборКИ = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
		НаборКИ.отбор.Объект.Установить(КонтрагентСсылка);
		НаборКИ.отбор.Тип.Установить(ТипКИ);
		НаборКИ.отбор.Вид.Установить(ВидКИ);
		
		СтрокаКи = НаборКИ.Добавить();
		СтрокаКи.Объект = КонтрагентСсылка;
		СтрокаКи.Тип = ТипКИ;
		СтрокаКи.Вид = ВидКИ;
		
		СтрокаКи.Комментарий = СтрокаДерева.КонтактКомментарий;
		СтрокаКи.Представление = СтрокаДерева.КонтактЗначение;
		
		НаборКИ.Записать();				
		
	КонецЦикла;
	
	// контактные лица
	ТаблицаКонтактныхЛиц = СтруктураДанныхКонтрагента.ТаблицаКонтактныхЛиц;
	ТаблицаКонтактныхЛиц.Свернуть("Наименование");
	Для Каждого СтрокаКЛ Из ТаблицаКонтактныхЛиц Цикл
		
		КонтактноеЛицоКонтрагента = Справочники.КонтактныеЛицаКонтрагентов.НайтиПоНаименованию(СтрокаКЛ.Наименование, Истина, , КонтрагентСсылка);
		Если ЗначениеЗаполнено(КонтактноеЛицоКонтрагента) Тогда
			Продолжить;
		КонецЕсли;
		
		Элемент = Справочники.КонтактныеЛицаКонтрагентов.СоздатьЭлемент();
		Элемент.Владелец = КонтрагентСсылка;
		Элемент.Наименование = СтрокаКЛ.Наименование;
		Элемент.Записать();		
		
	КонецЦикла;
	
	//Банк
	ТаблицаБанковскихРеквизитов = СтруктураДанныхКонтрагента.ТаблицаБанковскихРеквизитов;
	Для Каждого СтрокаТаблицыБанковскихРеквизитов Из ТаблицаБанковскихРеквизитов Цикл
		
		НомерСчета = СтрЗаменить(СтрокаТаблицыБанковскихРеквизитов.НомерСчета, " ", "");
		Если ПустаяСтрока(НомерСчета) Тогда
			Продолжить;
		КонецЕсли;
		
		БИК = СтрЗаменить(СтрокаТаблицыБанковскихРеквизитов.Банк.БИК, " ", "");
		Если ПустаяСтрока(БИК) Тогда
			Продолжить;
		КонецЕсли;
		
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Банки.Ссылка
		|ИЗ
		|	Справочник.Банки КАК Банки
		|ГДЕ
		|	Банки.Код = &БИК");
		Запрос.УстановитьПараметр("БИК", БИК);
		
		Если Запрос.Выполнить().Пустой() Тогда
			БанкОбъект = Справочники.Банки.СоздатьЭлемент();
			БанкОбъект.Код = БИК;
			БанкОбъект.КоррСчет = СтрЗаменить(СтрокаТаблицыБанковскихРеквизитов.Банк.СчетКорреспондентский, " ", "");
			БанкОбъект.Наименование = СокрЛП(СтрокаТаблицыБанковскихРеквизитов.Банк.Наименование);
			БанкОбъект.Адрес = СокрЛП(СтрокаТаблицыБанковскихРеквизитов.Банк.Адрес.Представление);
			БанкОбъект.Город = ПолучитьГородБанка(СтрокаТаблицыБанковскихРеквизитов.Банк.Адрес.ТаблицаАдресныхПолей);
			Попытка
				БанкОбъект.Записать();
			Исключение
				СообщитьОбИсключительнойОшибке(Ложь, ОписаниеОшибки());
				Продолжить;
			КонецПопытки;
			БанкСсылка = БанкОбъект.Ссылка;
		Иначе
			БанкСсылка = Запрос.Выполнить().Выгрузить()[0][0];	
		КонецЕсли;	
		
		// счет
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	БанковскиеСчета.Ссылка
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|ГДЕ
		|	БанковскиеСчета.Владелец = &Владелец
		|	И БанковскиеСчета.НомерСчета = &НомерСчета
		|	И БанковскиеСчета.Банк = &Банк");
		Запрос.УстановитьПараметр("Владелец", КонтрагентСсылка);					  
		Запрос.УстановитьПараметр("НомерСчета", НомерСчета);					  
		Запрос.УстановитьПараметр("Банк", БанкСсылка);					  
		
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			Продолжить;
		КонецЕсли;	
		
		СчетОбъект = Справочники.БанковскиеСчета.СоздатьЭлемент();
		СчетОбъект.Банк = БанкСсылка;
		СчетОбъект.ВидСчета = "Расчетный";
		СчетОбъект.ВалютаДенежныхСредств = Константы.ВалютаОбменССайтомированногоУчета.Получить();
		СчетОбъект.Владелец = КонтрагентСсылка;
		СчетОбъект.Наименование = БанкСсылка.Наименование + " (" + СчетОбъект.ВидСчета + ")";
		СчетОбъект.НомерСчета = НомерСчета;
		Попытка
			СчетОбъект.Записать();
		Исключение
			СообщитьОбИсключительнойОшибке(Ложь, ОписаниеОшибки());
			Продолжить;
		КонецПопытки;
		
		Если НЕ ЗначениеЗаполнено(КонтрагентСсылка.ОсновнойБанковскийСчет) Тогда
			СчетСсылка = СчетОбъект.Ссылка;
			КонтрагентОбъект = КонтрагентСсылка.ПолучитьОбъект();
			КонтрагентОбъект.ОсновнойБанковскийСчет = СчетСсылка;
			Попытка
				КонтрагентОбъект.Записать();
			Исключение
				СообщитьОбИсключительнойОшибке(Ложь, ОписаниеОшибки());
				Продолжить;
			КонецПопытки;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры	

Функция СтранаРФ(СтруктураДанных)
	Если НЕ СтруктураДанных.ПолеТип = "Страна" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Страна = СокрЛП(ВРег(СтруктураДанных.ПолеЗначение));
	Если Страна = "РОССИЯ"
		ИЛИ Страна = "РФ"	
		ИЛИ Страна = "РОССИЙСКАЯ ФЕДЕРАЦИЯ" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции			


Функция ПолучитьГородБанка(ТаблицаАдресныхПолей)
	Город = "";
	Найдено = ТаблицаАдресныхПолей.Найти("Город", "ПолеТип");
	Если НЕ Найдено = НеОпределено Тогда
		Город = СокрЛП(Найдено.ПолеЗначение);
	КонецЕсли;	
	Возврат Город;
КонецФункции	

Функция ПолучитьПоЗначениюДляВыгрузкиСтавкуНДС(ЗначениеНалога)
	
	Если ЗначениеНалога = "0" Тогда		
		СтавкаНДС = Перечисления.СтавкиНДС.НДС0;
	ИначеЕсли ЗначениеНалога = "10" Тогда		
		СтавкаНДС = Перечисления.СтавкиНДС.НДС10;
	ИначеЕсли ЗначениеНалога = "18" Тогда		
		СтавкаНДС = Перечисления.СтавкиНДС.НДС18;
	ИначеЕсли ЗначениеНалога = "20" Тогда				
		СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
	Иначе
		СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
	КонецЕсли;
	
	Возврат СтавкаНДС;
	
КонецФункции

Функция СформироватьCMLСРанееЗагруженнымиЗаказами(СтрокаCML, МассивИзменений) 
	
	ОтобразитьСостояние("Поиск открытых заказов, загруженных с " + HTTPОбменСервер + "...");
	
	ТаблицаДокументов = ПроцедурыОбменаССайтом.ПолучитьЗаказыСОплатойИОтгрузкойПоКатегориям(МассивИзменений, мМассивЗагруженныхДокументов);
	
	Если ТаблицаДокументов.Количество() = 0 Тогда  
		Возврат ТаблицаДокументов;
	КонецЕсли;
	
	ОбъектCML = ПолучитьОбъектДляЗаписиXML("",ТекущаяДата());
	НачатьCML(ОбъектCML);
	
	Для Каждого СтрокаТД Из ТаблицаДокументов Цикл
		
		ОбъектCML.ЗаписатьНачалоЭлемента("Документ");
		
		ВыгрузитьЗаказВCML(ОбъектCML, СтрокаТД);
		
		ОбъектCML.ЗаписатьНачалоЭлемента("ЗначенияРеквизитов");
		
		ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Номер по 1С", СтрокаТД.Номер);
		ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Дата по 1С", ФорматДатыДляCML(СтрокаТД.Дата));
		ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "ПометкаУдаления", СтрокаТД.ПометкаУдаления);
		ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Проведен", СтрокаТД.Проведен);
		
		//Если СтрокаТД.Оплачен Тогда
		//	ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Номер оплаты по 1С", СтрокаТД.НомерДокументаОплаты);
		//	ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Дата оплаты по 1С", ФорматДатыДляCML(СтрокаТД.ДатаДокументаОплаты, Истина, Истина));
		//КонецЕсли;	
		//
		//Если СтрокаТД.Отгружен Тогда
		//	ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Номер отгрузки по 1С", СтрокаТД.НомерДокументаОтгрузки);
		//	ДобавитьНовоеЗначениеРеквизита(ОбъектCML, "Дата отгрузки по 1С", ФорматДатыДляCML(СтрокаТД.ДатаДокументаОтгрузки, Истина, Истина));
		//КонецЕсли;	
		
		ОбъектCML.ЗаписатьКонецЭлемента();
		ОбъектCML.ЗаписатьКонецЭлемента();
		
	КонецЦикла;	
	
	СтрокаCML = ЗавершитьCML(ОбъектCML);
	
	Возврат ТаблицаДокументов;
	
КонецФункции

Процедура НачатьCML(ЗаписьXML);
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("КоммерческаяИнформация");
	ЗаписьXML.ЗаписатьАтрибут("ВерсияСхемы"			, "2.04.1CBitrix");
	//ЗаписьXML.ЗаписатьАтрибут("ФорматДаты"			, ФорматДаты);
	//ЗаписьXML.ЗаписатьАтрибут("ФорматВремени"		, ФорматВремени);
	//ЗаписьXML.ЗаписатьАтрибут("РазделительДатаВремя", РазделительДатаВремя);
	//ЗаписьXML.ЗаписатьАтрибут("ФорматСуммы"			, ФорматСуммы);
	//ЗаписьXML.ЗаписатьАтрибут("ФорматКоличества"	, ФорматКоличества);
	//ЗаписьXML.ЗаписатьАтрибут("ДатаФормирования"	, ФорматДатыДляCML(мДатаФормирования, Истина, Истина));
	
КонецПроцедуры

Функция ЗавершитьCML(ЗаписьXML)
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Возврат ЗаписьXML.Закрыть();
КонецФункции

Процедура ВыгрузитьЗаказВCML(ОбъектCML, Док)
	
	//ЗаписатьТекстовойУзел(ОбъектCML, "Ид"	, Строка(Док.ЗаказСсылка.УникальныйИдентификатор()));
	//ЗаписатьТекстовойУзел(ОбъектCML, "Номер", Док.НомерВходящегоДокументаЭлектронногоОбмена);
	//ЗаписатьТекстовойУзел(ОбъектCML, "Дата" , ФорматДатыДляCML(Док.ДатаВходящегоДокументаЭлектронногоОбмена, Истина, Ложь));	
	//ЗаписатьТекстовойУзел(ОбъектCML, "ХозОперация", "Заказ товара");
	//
	//ЗаписатьТекстовойУзел(ОбъектCML, "Роль"		  , "Продавец");
	//ЗаписатьТекстовойУзел(ОбъектCML, "Валюта"	  , ФорматВалютыДляCML(Док.Валюта));
	//ЗаписатьТекстовойУзел(ОбъектCML, "Курс"	      , Док.КурсВзаиморасчетов);
	//ЗаписатьТекстовойУзел(ОбъектCML, "Сумма"      , ФорматЗначенияДляCML(Док.СуммаДокумента, ФорматСуммы));	
	//
	//ВыгрузитьРеквизитыКонтрагентаВCML(ОбъектCML, Док.Контрагент);
	//
	//ЗаписатьТекстовойУзел(ОбъектCML, "Время", ФорматДатыДляCML(Док.ДатаВходящегоДокументаЭлектронногоОбмена, Ложь, Истина));
	//ЗаписатьТекстовойУзел(ОбъектCML, "СрокПлатежа", ФорматДатыДляCML(Док.ДатаОплаты, Истина, Ложь));
	//
	//ЗаписатьТекстовойУзел(ОбъектCML, "Комментарий", ФорматКомментарияДляCML(Док.Комментарий));
	//
	//Если Док.УчитыватьНДС Тогда
	//	
	//	ОбъектCML.ЗаписатьНачалоЭлемента("Налоги");
	//	ОбъектCML.ЗаписатьНачалоЭлемента("Налог");
	//	ЗаписатьТекстовойУзел(ОбъектCML, "Наименование", НаименованиеНалога);
	//	ЗаписатьТекстовойУзел(ОбъектCML, "УчтеноВСумме", Док.СуммаВключаетНДС);
	//	ЗаписатьТекстовойУзел(ОбъектCML, "Сумма", ФорматЗначенияДляCML(ПолучитьСуммуНДС(Док), ФорматСуммы), Ложь);
	//	ОбъектCML.ЗаписатьКонецЭлемента();
	//	ОбъектCML.ЗаписатьКонецЭлемента();
	//	
	//КонецЕсли;
	
	//	ВыгрузитьТоварыУслугиЗаказаВCML(ОбъектCML, Док);
	
КонецПроцедуры

Процедура ДобавитьНовоеЗначениеРеквизита(ОбъектXML, Наименование, Значение, ПустоеЗначение = "", ИмяГруппыЭлементов = "ЗначениеРеквизита")
	
	ЗначениеДляЗаписи = Значение;
	Если ЗначениеДляЗаписи = Null Тогда
		ЗначениеДляЗаписи = ПустоеЗначение;
	КонецЕсли;
	
	Если ЗначениеДляЗаписи = "" Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектXML.ЗаписатьНачалоЭлемента(ИмяГруппыЭлементов);
	
	ЗаписатьТекстовойУзел(ОбъектXML, "Наименование",  Наименование, Ложь);
	ЗаписатьТекстовойУзел(ОбъектXML, "Значение",  ЗначениеДляЗаписи, Ложь);
	
	ОбъектXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Функция ФорматДатыДляCML(ЗначениеДата, ВернутьДату = Истина, ВернутьВремя = Ложь)
	
	ДатаСтрока  = Формат(ЗначениеДата, ФорматДаты);
	ВремяСтрока = Формат(ЗначениеДата, ФорматВремени);	
	Результат   = "";
	
	Если ВернутьДату И ВернутьВремя Тогда
		Результат = ДатаСтрока + РазделительДатаВремя + ВремяСтрока;
	ИначеЕсли ВернутьДату И (НЕ ВернутьВремя) Тогда	
		Результат = ДатаСтрока;
	ИначеЕсли (НЕ ВернутьДату) И ВернутьВремя Тогда		
		Результат = ВремяСтрока;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции	

// сделаем отдельно обмен, без обмена с веб сайтом
Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	
	
	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
		
	Если ТаблицаПараметров<>Неопределено Тогда
		Параметры=Новый Соответствие;
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
			ЗаписатьВЛог("Регламент","Параметр: "+СтрокаТП.Имя+" - "+СтрокаТП.Значение,"Информация");		
			Параметры.Вставить(СтрокаТП.Имя,СтрокаТП.Значение);
		КонецЦикла;	
	КонецЕсли;
	
	ФлагТестовойЗагрузки = Параметры.Получить("Тест");
	ФлагТестовойЗагрузки = ?(ФлагТестовойЗагрузки = неопределено,ложь,ФлагТестовойЗагрузки);


	//Кухарь А.Ю. 31.03.2026 начало
	// Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом 
	Если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() 
		//Кухарь А.Ю. 31.03.2026 конец
		И ФлагТестовойЗагрузки <> ИСТИНА Тогда        
		ЗаписатьВЛог("Регламент","Отмена выполнения. Задача: Выгрузка цен на сайт b2b. Автообмен разрешен для базы: """+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
		Возврат;
	КонецЕсли;
	
	ЗаписатьВЛог("b2b","Начало выполнения. Задача: Выгрузка цен. !","Информация");                     
	
	Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
		
		// выполняем обмен
		
		
		НомерНастройки = параметры.Получить("НомерНастройки");
		ЗаписатьВЛог("b2b","ном "+НомерНастройки,"Информация");
		//ВыгрузитьДанные();
		ВыгрузитьДанныеНаСайт(); // сразу на фтп, без акции
			
	КонецЕсли;
	
	
	// теперь пропишем у уже загруженных заказов кода
	ЗаписатьВЛог("b2b","Конец выполнения. Задача: Выгрузка цен. !","Информация");                     
	
		
КонецПроцедуры




ТипЦен=Справочники.ТипыЦен.НайтиПоКоду("SSP-0301");



////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ


мКаталогВременныхФайлов="С:\1c_obmen\";

ПрефиксУзлаCML	   = "CMLУзел.";
ПрефиксАтрибутаCML = "CMLАтрибут.";
НачалоЭлементаCML  = "CMLНачалоЭлемента";
КонецЭлементаCML   = "CMLКонецЭлемента";

мПодкаталогФайлов 			 	    	= "import_files";
мПодкаталогБезопасностиКаталогаВыгрузки = "1cbitrix";

ПараметрЗапросаHTTP_Инициализация       	  = "&mode=init";
ПараметрЗапросаHTTP_ПередачаФайла       	  = "&mode=file&filename=";
ПараметрЗапросаHTTP_ИмпортФайлаСервером		  = "&mode=import&filename=";
ПараметрЗапросаHTTP_ПолучитьДанные	    	  = "&mode=query"; 
ПараметрЗапросаHTTP_УспешноеЗавершениеИмпорта = "&mode=success";

ОтветСервера_ZIPРазрешен							= "zip=yes";
ОтветСервера_ОграничениеРазмераФрагментаФайлаОбмена = "file_limit=";
ОтветСервера_УспешноеЗавершениеТекущейОперации 		= "success";
ОтветСервера_АварийноеЗавершениеТекущейОперации		= "failure";
ОтветСервера_ВыполнениеТекущейОперации 				= "progress";

ПустаяХарактеристикаСсылка = Неопределено; //Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
НаименованиеНалога 			= "НДС";

БулевоЗначениеCML_Истина 	= "true";
БулевоЗначениеCML_Да = "Да";

ТипНоменклатурыCML_Услуга 	= "Услуга";
ТипНоменклатурыCML_Товар  	= "Товар";
ЗначениеCML_ТипНоменклатуры = "ТипНоменклатуры";

мСоответствиеНаименованийКатегорийДокумента = Новый Соответствие;
мСоответствиеНаименованийКатегорийДокумента.Вставить("Заказ оплачен"	 , Справочники.КатегорииОбъектов.СостояниеЗаказаНаWEBСайтеОплачен);
мСоответствиеНаименованийКатегорийДокумента.Вставить("Доставка разрешена", Справочники.КатегорииОбъектов.СостояниеЗаказаНаWEBСайтеДоставкаРазрешена);
мСоответствиеНаименованийКатегорийДокумента.Вставить("Финальный статус"	 , Справочники.КатегорииОбъектов.СостояниеЗаказаНаWEBСайтеЗавершен);
мСоответствиеНаименованийКатегорийДокумента.Вставить("Отменен"	         , Справочники.КатегорииОбъектов.СостояниеЗаказаНаWEBСайтеОтменен);

ПостроительЗапроса = Новый ПостроительЗапроса;


мКоэффициентПересчетаВесаТоваровВГраммыДляОбменаССайтом = 1;

//мКоэффициентПересчетаВесаТоваровВГраммыДляОбменаССайтом = Константы.КоэффициентПересчетаВесаТоваровВГраммыДляОбменаССайтом.Получить();
//Если НЕ ЗначениеЗаполнено(мКоэффициентПересчетаВесаТоваровВГраммыДляОбменаССайтом) Тогда
//	мКоэффициентПересчетаВесаТоваровВГраммыДляОбменаССайтом = 1;
//КонецЕсли;
//----------------------------------------------
МассивЗнИМ = Новый Массив;
МассивЗнИм.Добавить("import.xml");
МассивЗнИм.Добавить("offers.xml");
МассивЗнИм.Добавить("prices.xml");
МассивЗнИм.Добавить("rest.xml");
МассивЗнИм.Добавить("promo.xml");

ТЗФайловИМ = Новый ТаблицаЗначений;
ТЗфайловИм.Колонки.Добавить("ПолноеИмя");
ТЗФайловИм.Колонки.Добавить("Краткое");
	
//---------------------------------------------
Рубли=Константы.НациональнаяВалюта.Получить();
КэшОстатков=Новый Соответствие;	

КритичОшибки= Новый массив;
ПРиКрОш=Ложь;

ТзЦвет=Новый ТаблицаЗначений;
ТзЦвет.Колонки.Добавить("Цвет");

//////////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

//ПрефиксУзлаCML	   = "CMLУзел.";
//ПрефиксАтрибутаCML = "CMLАтрибут.";
//НачалоЭлементаCML  = "CMLНачалоЭлемента";
//КонецЭлементаCML   = "CMLКонецЭлемента";

//мПодкаталогФайлов 			 	    	= "import_files";
//мПодкаталогБезопасностиКаталогаВыгрузки = "1cbitrix";

//ПараметрЗапросаHTTP_Инициализация       	  = "&mode=init";
//ПараметрЗапросаHTTP_ПередачаФайла       	  = "&mode=file&filename=";
//ПараметрЗапросаHTTP_ИмпортФайлаСервером		  = "&mode=import&filename=";
//ПараметрЗапросаHTTP_ПолучитьДанные	    	  = "&mode=query"; 
//ПараметрЗапросаHTTP_УспешноеЗавершениеИмпорта = "&mode=success";

//ОтветСервера_ZIPРазрешен							= "zip=yes";
//ОтветСервера_ОграничениеРазмераФрагментаФайлаОбмена = "file_limit=";
//ОтветСервера_УспешноеЗавершениеТекущейОперации 		= "success";
//ОтветСервера_АварийноеЗавершениеТекущейОперации		= "failure";
//ОтветСервера_ВыполнениеТекущейОперации 				= "progress";

//ПустаяХарактеристикаСсылка = неопределено; //Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
//НаименованиеНалога 			= "НДС";

//БулевоЗначениеCML_Истина 	= "true";
//БулевоЗначениеCML_Да = "Да";

//ТипНоменклатурыCML_Услуга 	= "Услуга";
//ТипНоменклатурыCML_Товар  	= "Товар";
//ЗначениеCML_ТипНоменклатуры = "ТипНоменклатуры";


//мКоэффициентПересчетаВесаТоваровВГраммыДляОбменаССайтом = 1;



