
Процедура ПередЗаписью(Отказ, Замещение)
	
	//крохин начало 25.12.2013
	//проверка на корректность, при ошибке пишем в лог

		Для Каждого Запись Из ЭтотОбъект Цикл
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИнформацияШКЛП.ШК,
	               |	ИнформацияШКЛП.ШКЛистаПереукладки,
	               |	ИнформацияШКЛП.НомерЛП
	               |ИЗ
	               |	РегистрСведений.ИнформацияШКЛП КАК ИнформацияШКЛП
	               |ГДЕ
	               |	ИнформацияШКЛП.ШК = &ШК
	               |	И ИнформацияШКЛП.ШКЛистаПереукладки <> &ШКЛистаПереукладки";
				   Запрос.УстановитьПараметр("ШК",Запись.ШК);
				   Запрос.УстановитьПараметр("ШКЛистаПереукладки",Запись.ШКЛистаПереукладки);
				    выборка = запрос.Выполнить().Выбрать();
					Если выборка.Следующий() Тогда
						ЗаписатьВЛог("дубль ШК ЛП","ШК: "+выборка.ШК + " .ЛП существующий: "+выборка.НомерЛП+" . ШКЛП: "+выборка.ШКЛистаПереукладки+" ЛП новый: "+Запись.НомерЛП+" ШК ЛП: "+запись.ШКЛистаПереукладки  ,"Информация") ;
					КонецЕсли;
           КонецЦикла;
	//крохин конец 25.12.2013

 //Кухарь 12.01.16 начало
 //Не грузим больше
	//Если ОбменДанными.Загрузка И ПараметрыСеанса.ЭтотУзел.ТипУзла <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
	//	НадоВыгружать = Ложь;
	//Иначе
	//	НадоВыгружать = Истина;
	//КонецЕсли;
	//Если НадоВыгружать Тогда
	//	УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	//КонецЕсли;
//Кухарь 12.01.16 конец
КонецПроцедуры
