


Процедура ОбработкаПроведения(Отказ, Режим)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	СписокШК=Короба.ВыгрузитьКолонку("ШККоробки");	
	Запрос=новый запрос; 
	Запрос.Текст="ВЫБРАТЬ
	|	ОстаткиЗХОстатки.ШККоробки КАК ШККоробки,
	|	ОстаткиЗХОстатки.ЗонаХранения КАК ЗонаХранения,
	//Кухарь 19.03.17 начало
	//Для подсчёта количества паллет	
	|	ОстаткиЗХОстатки.ШКПаллеты
	//Кухарь 19.03.17 конец
	|ИЗ
	|	РегистрНакопления.ОстаткиЗХ.Остатки(&Дата, ШККоробки В (&Шк)) КАК ОстаткиЗХОстатки
	|ГДЕ
	|	ОстаткиЗХОстатки.КоличествоКоробокОстаток > 0";				 
	Запрос.УстановитьПараметр("ШК",СписокШК);	
	Запрос.УстановитьПараметр("Дата",Дата);
	ЕстьНаОстатках=запрос.Выполнить().Выгрузить();
	
	Для каждого ТекСтрока из ЕстьНаОстатках цикл
		Движение = Движения.ОстаткиЗХ.Добавить();
		ЗаполнитьЗначенияСвойств(движение,ТекСтрока);
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ЗонаХранения = ТекСтрока.ЗонаХранения;
		Движение.КоличествоКоробок = 1;	
	КонецЦикла;
	
	
	
	
	Для Каждого ТекСтрокаКороба Из Короба Цикл
		Движение = Движения.ОстаткиЗХ.Добавить();
		ЗаполнитьЗначенияСвойств(движение,ТекСтрокаКороба);	
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ЗонаХранения = ЗонаХранения;
		Движение.КоличествоКоробок = 1;
		//Кухарь 30.03.16 начало
		//Будем фиксировать   накладную
		Движение.Накладная=ТекСтрокаКороба.Накладная;
		Движение.ДатаПоступления=Дата;
		//Кухарь 30.03.16 конец
	КонецЦикла;

	
	//Кухарь 26.09.17 начало
	//Проводки по остаткам адресного хранения номенклатуры
	для каждого СтрТЧ из Товары цикл
		если СтрТЧ.Количество=0 тогда Продолжить;КонецЕсли;
		
		Движение = Движения.АдресноеХранениеОстатки.Добавить();
		ЗаполнитьЗначенияСвойств(движение,СтрТЧ);	
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		//Движение.Паллета=Паллета;
		Движение.ЗонаХранения = ЗонаХранения;
		Движение.КодОперации=Перечисления.КодыОперацийОстатки.Перемещение;
		
	КонецЦикла;
	//Кухарь 26.09.17 конец	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры


			