Функция СформироватьОписаниеОшибки(СтрокаТО)
	Если СтрокаТО.ТипОшибки="Недостаточно товара" Тогда	
		ОписаниеОшибки="Недостаточно товара на момент проведения документа ! Склад: "+СтрокаТО.Склад+",						
		|	в наличии физ. остаток: "+СтрокаТО.Остаток+", резерв: "+СтрокаТО.Резерв+", (факт. остаток: "+(СтрокаТО.Остаток-Макс(СтрокаТО.Резерв,0))+"), требуется: "+СтрокаТО.Количество+" "+СтрокаТО.Номенклатура.БазоваяЕдиница+".";
	Иначе
		ОписаниеОшибки="";		
	КонецЕсли;	
	
	Возврат ОписаниеОшибки;
КонецФункции // СформироватьОписаниеОшибки()
 
Процедура ДобавитьОшибки(ТОшибок,РезультатОперации=0) Экспорт		
	Если ТОшибок=Неопределено Тогда Возврат КонецЕсли; 
	
	ТОбъектов=ТОшибок.Скопировать();
	ТОбъектов.Колонки.Добавить("Кол");
	ТОбъектов.Свернуть("Объект","Кол");
	
	Для Каждого СтрокаОбъекта Из ТОбъектов Цикл
		СтрокиОшибок=Ошибки.НайтиСтроки(Новый Структура("Объект",СтрокаОбъекта.Объект));	
		Для Каждого СтрокаОшибок Из СтрокиОшибок Цикл
			Ошибки.Удалить(СтрокаОшибок);		
		КонецЦикла;	
	КонецЦикла; 
	
	Для Каждого СтрокаТО Из ТОшибок Цикл		
		Строка=Ошибки.Добавить();		
		
		ЗаполнитьЗначенияСвойств(Строка,СтрокаТО);
		
		Строка.ДатаРегистрации	=ТекущаяДата();
		Строка.ОписаниеОшибки	=СформироватьОписаниеОшибки(СтрокаТО);
		Строка.РезультатОперации=РезультатОперации;
		
		Если СтрокаТО.ТипОшибки="Недостаточно товара" Тогда	
			Строка.Расшифровка=""+СтрокаТО.Номенклатура;
		КонецЕсли;		
	КонецЦикла; 	
КонецПроцедуры
 