
Процедура СформироватьИЗаписатьДвижения (РегистраторОбъект) Экспорт       
	 
		РегистраторСсылка = РегистраторОбъект.Ссылка;
	  	ТекстЗапроса = ПолучитьТекстЗапросаТаблицыДвижения(РегистраторСсылка);
	    ТаблицаДвижений = ПолучитьТаблицуДвижений(ТекстЗапроса, РегистраторСсылка);
		ЗаписатьДвиженияОтстатковПлана(ТаблицаДвижений, РегистраторОбъект);
	   
КонецПроцедуры

Функция ПолучитьТекстЗапросаТаблицыДвижения (Знач Регистратор) Экспорт  
	
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.ПланПродаж") Тогда  	 
		ТекстЗапроса = ПолучитьТекстЗапросаПоПлануПродаж(Регистратор); 
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда  
		 ТекстЗапроса = ПолучитьТекстЗапросаПоРасходнойНакладной(); 
	КонецЕсли;	
	
	Возврат ТекстЗапроса;	
	
КонецФункции    


Функция ПолучитьТекстЗапросаПоРасходнойНакладной ()     
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(РасходнаяНакладнаяТовары.Заявка - РасходнаяНакладнаяТовары.Количество) КАК Количество
	               |ИЗ
	               |	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	               |ГДЕ
	               |	РасходнаяНакладнаяТовары.Ссылка = &Ссылка
	               |	И РасходнаяНакладнаяТовары.Заявка > РасходнаяНакладнаяТовары.Количество
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасходнаяНакладнаяТовары.Номенклатура";
	
	Возврат ТекстЗапроса; 
	
КонецФункции                



Функция ПолучитьТекстЗапросаПоПлануПродаж (Знач Регистратор)     
	
	Детальный = ПолучитьРеквизитШапки(Регистратор, "Детальный", "Документ");
	Если Детальный Тогда 
		ТекстЗапроса = 	"ВЫБРАТЬ
		|	ПланПродаж.Номенклатура КАК Номенклатура,
		|	СУММА(ПланПродаж.КоличествоОстаток) КАК Количество
		|ИЗ
		|	Документ.ПланПродаж.Состав КАК ПланПродаж
		|ГДЕ
		|	ПланПродаж.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПланПродаж.Номенклатура";
	Иначе   		
		ТекстЗапроса = "ВЫБРАТЬ
		|	РаспределениеСрезПоследних.Номенклатура КАК Номенклатура,
		|	СУММА(ПланПродаж.КоличествоОстаток * ЕСТЬNULL(РаспределениеСрезПоследних.Процент/100, 0)) КАК Количество
		|ИЗ
		|	Документ.ПланПродаж.Состав КАК ПланПродаж
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Распределение.СрезПоследних(&Дата, Склад = &Склад) КАК РаспределениеСрезПоследних
		|		ПО ПланПродаж.Модель = РаспределениеСрезПоследних.Номенклатура.Родитель
		|ГДЕ
		|	ПланПродаж.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РаспределениеСрезПоследних.Номенклатура";	
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции                

Функция СформироватьПустуюТаблицуДвижений ()   
	
	ТаблицаДвижений = новый ТаблицаЗначений;      
	ТаблицаДвижений.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДвижений.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТаблицаДвижений.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));	
	ТаблицаДвижений.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));	
	ТаблицаДвижений.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));	
	ТаблицаДвижений.Колонки.Добавить("ВидПланаПродаж", Новый ОписаниеТипов("СправочникСсылка.ВидыПланаПродаж"));	
	ТаблицаДвижений.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	
	Возврат ТаблицаДвижений;
	
КонецФункции

Функция ПолучитьТаблицуДвижений (Знач ТекстЗапроса, Знач Регистратор) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;  
	Запрос.УстановитьПараметр("Ссылка", Регистратор);   
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.ПланПродаж") Тогда  	
		РеквизитыШапки = ПолучитьРеквизитыШапки(Регистратор, "Дата, Склад, ВидПланаПродаж, Контрагент, Подразделение", "Документ");
		Запрос.УстановитьПараметр("Дата", КонецДня(РеквизитыШапки.Дата));
		Запрос.УстановитьПараметр("Склад", РеквизитыШапки.Склад);     
		Период = КонецМесяца(РеквизитыШапки.Дата);  
	Иначе               		
		РеквизитыШапкиНакладной = ПолучитьРеквизитыШапки(Регистратор, "Дата", "Документ");  
		ОбразецПлана = РегистрыСведений.РаспределениеПлановПродажПоНакладным.ПолучитьОбразецПланаПоНакладной(Регистратор);        
		Если ОбразецПлана <> Неопределено Тогда  
			РеквизитыШапки = ПолучитьРеквизитыШапки(ОбразецПлана,"Склад, ВидПланаПродаж, Контрагент, Подразделение", "Документ"); 	
			РеквизитыШапки.Вставить("Дата", РеквизитыШапкиНакладной.Дата)
		Иначе   
			ВызватьИсключение СтрШаблон("При расчёте проводок по остаткам планов документа %1, не обнаружена связка с планами продаж.", Регистратор);
		КонецЕсли;    
		Период = РеквизитыШапки.Дата;   
	КонецЕсли;                         
	
	Выборка = Запрос.Выполнить().Выбрать();   
	
	ТаблицаДвижений = СформироватьПустуюТаблицуДвижений();
	
	
	Пока Выборка.Следующий() Цикл    
		
		Если Выборка.Количество = 0 Тогда 
			Продолжить;
		КонецЕсли;           
		СтрокаТаблицы = ТаблицаДвижений.Добавить();   
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, РеквизитыШапки);
  		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);

		СтрокаТаблицы.Период			= Период;
 		
	КонецЦикла;
	
	Возврат ТаблицаДвижений;
	
КонецФункции

Процедура ЗаписатьДвиженияОтстатковПлана (ТаблицаДвижений, РегистраторОбъект)   
	
	Для Каждого СтрокаТаблицы Из ТаблицаДвижений Цикл   
		Движение = РегистраторОбъект.Движения.ОстаткиПлановПродаж.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, СтрокаТаблицы);	
	КонецЦикла;       

КонецПроцедуры
