
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)  экспорт
	Автор=ПараметрыСеанса.Пользователь;
	если ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.ЗаданиеНаМаркировку") тогда 
		ДокОснование=ДанныеЗаполнения;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.РасходнаяНакладная") тогда
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаданиеНаМаркировку.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаданиеНаМаркировку КАК ЗаданиеНаМаркировку
		|ГДЕ
		|	ЗаданиеНаМаркировку.Проведен
		|	И ЗаданиеНаМаркировку.ДокОснование = &ДокОснование
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаданиеНаМаркировку.Дата УБЫВ";
		запрос.УстановитьПараметр("ДокОснование",ДанныеЗаполнения);
		Выборка=запрос.Выполнить().Выбрать();
		пока Выборка.Следующий() цикл
			ДокОснование=Выборка.ссылка;
		КонецЦикла;
	КонецЕсли;
	
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки

	СтатусКМ_Факт		= Перечисления.СтатусыКодовМаркировкиФакт.Нанесен;	
	
	
	для каждого СтрТЧ из ШтрихкодыУпаковокРаспечатанная Цикл		
		Движение = Движения.СтатусыКМ_Факт.Добавить();		
		Движение.Период				= СтрТЧ.ДатаПечати;
		Движение.ШтрихКодУпаковки	= СтрТЧ.ШтрихкодУпаковки;		
		Движение.Статус				= Перечисления.СтатусыКодовМаркировкиФакт.Распечатан;	
		Движение.Местонахождение	= Подразделение;
	КонецЦикла;
	
	
	для каждого СтрТЧ из ШтрихкодыУпаковок Цикл		
		Движение = Движения.СтатусыКМ_Факт.Добавить();		
		Движение.Период				= Дата;
		Движение.ШтрихКодУпаковки	= СтрТЧ.ШтрихкодУпаковки;		
		Движение.Статус				= СтатусКМ_Факт;
		Движение.Местонахождение	= Подразделение;
	КонецЦикла;
	
	Движения.СтатусыКМ_Факт.Записывать = Истина;    
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	если не ЭтоНовый() тогда
		НаборЗаписей=РегистрыСведений.ЛогАвтоПечатиКодовЧЗПриСканировании.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(Ссылка);			
		НаборЗаписей.Записать(Истина);	
	КонецЕсли;
	
	ТаблицаПечати=ШтрихкодыУпаковокРаспечатанная.Выгрузить();
	ТаблицаПечати.Сортировать("ДатаПечати УБЫВ");
	если ТаблицаПечати.Количество()>0 тогда
		Дата=Макс(ТаблицаПечати.Получить(0).ДатаПечати+1,Дата);
	КонецЕсли;
	
	//+++Чирков 24.04.2025
	КоличествоДокумента = ШтрихкодыУпаковокРаспечатанная.Количество();
	//---Чирков 24.04.2025
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	отказ=Истина;
КонецПроцедуры

