Функция ПолучитьЗначенияСвойств(РазмерЧашки) Экспорт

	
	Запрос = Новый Запрос;
	запрос.Текст= "ВЫБРАТЬ
	              |	ЗначенияСвойствОбъектов.Свойство КАК Свойство,
	              |	ЗначенияСвойствОбъектов.Значение КАК Значение
	              |ИЗ
	              |	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	              |ГДЕ
	              |	ЗначенияСвойствОбъектов.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", 	РазмерЧашки);
	
	тСвойства = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаС Из тСвойства Цикл
		СтрокаС.Значение = СтрокаС.Свойство.ТипЗначения.ПривестиЗначение(СтрокаС.Значение);		
	КонецЦикла;
	
	Возврат тСвойства;

КонецФункции //ПолучитьЗначенияСвойствНК(Модель) Экспорт
 