
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Префикс=ПараметрыСеанса.ЭтотУзел.Код+"-";
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	если не МожноЗаписывать() тогда 
		отказ=Истина;
	иначе
		ЗаполнитьШапкуРСП();
	КонецЕсли;
	
	
КонецПроцедуры



Процедура ЗаполнитьШапкуРСП ()
	
	ВсегоПоРасходникамНакладной=РасходныеМатериалыПоНакладной.Итог("Всего");
	ВсегоПоРасходникамНоменклатуры=РасходныеМатериалыПоНоменклатуре.Итог("Всего");
	ВсегоПоВремениНаДОНоменклатуры=ЗатраченноеВремяПоНоменклатуре.Итог("Всего");
	СуммаДокументаОбщая=ВсегоПоРасходникамНакладной+ВсегоПоРасходникамНоменклатуры+ВсегоПоВремениНаДОНоменклатуры;
	
	КоличествоПоРасходникамНоменклатуры=РасходныеМатериалыПоНоменклатуре.Итог("Количество");	
	КоличествоПоРасходникамНакладной=РасходныеМатериалыПоНакладной.Итог("Количество");	
	КоличествоДокументаОбщее=КоличествоПоРасходникамНоменклатуры+ КоличествоПоРасходникамНакладной;
	
	ВремяПланОбщее=ЗатраченноеВремяПоНакладной.Итог("ВремяПлан");
	ВремяФактОбщее=ЗатраченноеВремяПоНакладной.Итог("ВремяФакт");
	
	ВремяПланДО=0;	
	ВремяФактДО=0;	
	
	МассСтрок=ЗатраченноеВремяПоНакладной.НайтиСтроки(Новый Структура("ВидРаботы",Справочники.ВидыВыполняемыхРабот.ДопОбработка));
	Для каждого СтрМасс из МассСтрок цикл
		ВремяПланДО=ВремяПланДО+СтрМасс.ВремяПлан;	
		ВремяФактДО=ВремяФактДО+СтрМасс.ВремяФакт;			
	КонецЦикла;
	
	Дата=ДокОснование.ДатаОтгрузки;
КонецПроцедуры

Функция МожноЗаписывать ()
	МожноЗаписывать=Истина;
	
	
	если не ЗначениеЗаполнено(ДокОснование) тогда
		СообщитьИзМодуля("Не заполнен документ основания.");
		МожноЗаписывать=Ложь;
	иначе
		если не ЗначениеЗаполнено(ДокОснование.ДатаОтгрузки) тогда
			СообщитьИзМодуля("Не заполнена дата отгрузки накладной "+ДокОснование);
			МожноЗаписывать=Ложь;
		КонецЕсли;	
	КонецЕсли;
	возврат МожноЗаписывать;
	
КонецФункции
