
#Область ОписаниеПеременных

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем МаркетПлейс;
Перем РеквизитыМаркетПлейс;

#КонецЕсли

#КонецОбласти

#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение
		И Не ОбменМаркетПлейсПИ.КонтрагентУчастникМаркетПлейса(Контрагент, ПунктДоставки) Тогда
		Отказ = Истина;
		
		СообщитьИзМодуля("Контрагент не является участником интернет продаж!");
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение
		И (Склад = Справочники.Склады.ПустаяСсылка()
		Или СкладПолучатель = Справочники.Склады.ПустаяСсылка()) Тогда
		Отказ = Истина;
		
		СообщитьИзМодуля("Не заполнен склад или склад получателя!");
	КонецЕсли;
	
	РеквизитыМаркетПлейс = ОбменМаркетПлейсПИ.ЗаполнитьДанныеМаркетПлейсаПоКонтрагенту(Контрагент, ПунктДоставки);
	МаркетПлейс = РеквизитыМаркетПлейс.Ссылка;
	
	ЗаполнитьКоличествоПродукции();
	
КонецПроцедуры

// Экспорт обработчика нужен для плана обмена
// @skip-check module-structure-method-in-regions
// 
// Параметры:
//  Отказ - Булево - Отказ
//  РежимПроведения - РежимПроведенияДокумента - Режим проведения
Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	
	Движения.РезервыТМЦ.Очистить();
	Движения.РезервыТМЦ.БлокироватьДляИзменения = Истина;
	Движения.РезервыТМЦ.Записывать = Истина;

	//Валетов + 03,12,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8062
	//Добавил документ в измерение Заказ РезервовТМЦ, добавил поле в запрос
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ПредварительныйЗаказКлиента.Ссылка КАК Регистратор,
	|	ПредварительныйЗаказКлиента.Дата КАК Период,
	|	ПредварительныйЗаказКлиента.Склад КАК Склад,
	|	ПредварительныйЗаказКлиента.СкладПолучатель КАК СкладПолучатель,
	|	ПредварительныйЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ПредварительныйЗаказКлиентаТовары.Количество КАК Количество,
	|	ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.Перемещение) КАК КодОперации,
	|	&Валюта КАК ВалютаДокумента,
	|	&Подразделение КАК Подразделение,
	|	ПредварительныйЗаказКлиентаТовары.НомерЗаказа КАК НомерЗаказа,
	|	ПредварительныйЗаказКлиента.Ссылка КАК Заказ
	|ПОМЕСТИТЬ вт_ПодготовленныеДанныеДвижений
	|ИЗ
	|	Документ.ПредварительныйЗаказКлиента КАК ПредварительныйЗаказКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПредварительныйЗаказКлиента.Товары КАК ПредварительныйЗаказКлиентаТовары
	|		ПО ПредварительныйЗаказКлиента.Ссылка = ПредварительныйЗаказКлиентаТовары.Ссылка
	|ГДЕ
	|	ПредварительныйЗаказКлиента.Ссылка = &Ссылка
	|	И НЕ ПредварительныйЗаказКлиента.ОтгрузкаКомплектов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПредварительныйЗаказКлиента.Ссылка,
	|	ПредварительныйЗаказКлиента.Дата,
	|	ПредварительныйЗаказКлиента.Склад,
	|	ПредварительныйЗаказКлиента.СкладПолучатель,
	|	ПредварительныйЗаказКлиентаКомплектующие.Номенклатура,
	|	ПредварительныйЗаказКлиентаКомплектующие.Количество,
	|	ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.Перемещение),
	|	&Валюта,
	|	&Подразделение,
	|	ПредварительныйЗаказКлиентаКомплектующие.НомерЗаказа,
	|	ПредварительныйЗаказКлиента.Ссылка
	|ИЗ
	|	Документ.ПредварительныйЗаказКлиента КАК ПредварительныйЗаказКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПредварительныйЗаказКлиента.Комплектующие КАК ПредварительныйЗаказКлиентаКомплектующие
	|		ПО ПредварительныйЗаказКлиента.Ссылка = ПредварительныйЗаказКлиентаКомплектующие.Ссылка
	|ГДЕ
	|	ПредварительныйЗаказКлиента.Ссылка = &Ссылка
	|	И ПредварительныйЗаказКлиента.ОтгрузкаКомплектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ПодготовленныеДанныеДвижений.Регистратор КАК Регистратор,
	|	вт_ПодготовленныеДанныеДвижений.Период КАК Период,
	|	&ВидДвиженияПриход КАК ВидДвижения,
	|	вт_ПодготовленныеДанныеДвижений.Склад КАК Склад,
	|	вт_ПодготовленныеДанныеДвижений.Номенклатура КАК Номенклатура,
	|	вт_ПодготовленныеДанныеДвижений.Склад.ФизическийСклад КАК Получатель,
	|	вт_ПодготовленныеДанныеДвижений.Количество КАК Количество,
	|	вт_ПодготовленныеДанныеДвижений.Заказ КАК Заказ
	|ИЗ
	|	вт_ПодготовленныеДанныеДвижений КАК вт_ПодготовленныеДанныеДвижений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиентаFBS.Товары КАК ЗаказКлиентаFBSТовары
	|		ПО вт_ПодготовленныеДанныеДвижений.НомерЗаказа = ЗаказКлиентаFBSТовары.НомерЗаказа
	|ГДЕ
	|	вт_ПодготовленныеДанныеДвижений.Количество > 0
	|	И ЗаказКлиентаFBSТовары.НомерЗаказа ЕСТЬ NULL");
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка",			   Ссылка);
	Запрос.УстановитьПараметр("Валюта",			   Справочники.Валюты.НайтиПоНаименованию("руб."));
	Запрос.УстановитьПараметр("Подразделение",	   Справочники.Подразделения.НайтиПоНаименованию("Отдел интернет-продаж"));
	Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
	
	Движения.РезервыТМЦ.Загрузить(Запрос.Выполнить().Выгрузить());
	Движения.Записать();
	
	ТекстыОшибок = Новый Массив;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ОстаткиТМЦОстатки.Склад КАК Склад,
	|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиТМЦОстатки.Номенклатура.Представление КАК НоменклатураПредставление,
	|	ОстаткиТМЦОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ вт_Остатки
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(
	|			&Период,
	|			Склад = &Склад
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						вт_ПодготовленныеДанныеДвижений.Номенклатура
	|					ИЗ
	|						вт_ПодготовленныеДанныеДвижений)) КАК ОстаткиТМЦОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезервыТМЦОстатки.Склад КАК Склад,
	|	РезервыТМЦОстатки.Номенклатура КАК Номенклатура,
	|	РезервыТМЦОстатки.Номенклатура.Представление КАК НоменклатураПредставление,
	|	РезервыТМЦОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ вт_Резервы
	|ИЗ
	|	РегистрНакопления.РезервыТМЦ.Остатки(
	|			&Период,
	|			Склад = &Склад
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						вт_ПодготовленныеДанныеДвижений.Номенклатура
	|					ИЗ
	|						вт_ПодготовленныеДанныеДвижений)) КАК РезервыТМЦОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Резервы.Склад КАК Склад,
	|	вт_Резервы.Номенклатура КАК Номенклатура,
	|	вт_Резервы.НоменклатураПредставление КАК НоменклатураПредставление,
	|	ЕСТЬNULL(вт_Остатки.КоличествоОстаток, 0) - вт_Резервы.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	вт_Резервы КАК вт_Резервы
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_Остатки КАК вт_Остатки
	|		ПО вт_Резервы.Склад = вт_Остатки.Склад
	|			И вт_Резервы.Номенклатура = вт_Остатки.Номенклатура
	|ГДЕ
	|	ЕСТЬNULL(вт_Остатки.КоличествоОстаток, 0) - вт_Резервы.КоличествоОстаток < 0";
	Запрос.УстановитьПараметр("Период", Новый Граница(МоментВремени()));
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Если Не ПолучитьПолномочиеПользователя("СписыватьВМинус") Тогда
			Отказ = Истина;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекстыОшибок.Добавить(СтрШаблон("Не хватает товара %1 в количестве %2",
				Выборка.НоменклатураПредставление, -Выборка.КоличествоОстаток));
		КонецЦикла;
	КонецЕсли;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СтрСоединить(ТекстыОшибок, Символы.ПС);
	Сообщение.Сообщить();
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ЗаполнитьКоличествоПродукции() Экспорт
	
	// обнуление колонки КоличествоПродукции
	Для Каждого СтрокаТЧ Из Комплектующие Цикл 
		СтрокаТЧ.КоличествоПродукции = 0;
	КонецЦикла;
	
	ТПродукции = Товары.Выгрузить(, "Номенклатура, Количество");
	ТПродукции.Свернуть("Номенклатура", "Количество");
	
	Для Каждого СтрокаТЗ Из ТПродукции Цикл
		СтрокаКомплектующих = Комплектующие.Найти(СтрокаТЗ.Номенклатура, "Продукция");
		Если СтрокаКомплектующих <> Неопределено Тогда
			СтрокаКомплектующих.КоличествоПродукции = СтрокаТЗ.Количество;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти
