Процедура ЧудесатыйВыборФайла(Форма, Элемент, Расширение, Фильтр, Знач РежимВыбора = Неопределено) Экспорт
	Если РежимВыбора=Неопределено Тогда
		РежимВыбора = РежимДиалогаВыбораФайла.Сохранение;	
	КонецЕсли; 
	Диалог = Новый ДиалогВыбораФайла(РежимВыбора);	
	Диалог.МножественныйВыбор	= Ложь;
	Если ЗначениеЗаполнено(Форма.Объект[Элемент.Имя]) Тогда
		Файл			= Новый Файл(Форма.Объект[Элемент.Имя]);	
		Диалог.Каталог	= Файл.Путь;
	КонецЕсли; 	
	Диалог.Расширение	= Расширение;
	Диалог.Фильтр		= Фильтр;
	Диалог.Показать(Новый ОписаниеОповещения("ОО_ВыборФайла",ФР_РаботаСДиалогами,Новый Структура("Форма,ЭлементИмя",Форма,Элемент.Имя)));
КонецПроцедуры

&НаКлиенте
Функция ОО_ВыборФайла(Результат,ДопПараметры=Неопределено) Экспорт
	Если ТипЗнч(Результат)=Тип("Массив") И Результат.Количество()>0 Тогда
		Форма = ДопПараметры.Форма;
		Форма.Объект[ДопПараметры.ЭлементИмя]=Результат[0];	
	КонецЕсли;	
КонецФункции //ОО_ВыборФайла(Результат,ДопПараметры=Неопределено) Экспорт

&НаКлиенте
Асинх Функция ВыборФайлаАсинх(Знач НачИмяФайла, Расширение = "dat", Знач Режим = Неопределено) Экспорт
	Результат = "";
	
	Если Режим = Неопределено Тогда	
		Режим = РежимДиалогаВыбораФайла.Сохранение;		
	КонецЕсли;	
	
	ДиалогВФ = Новый ДиалогВыбораФайла(режим);
	ДиалогВФ.Фильтр = СтрШаблон("Файл (*.%1)|*.%2",Расширение,Расширение);
	
	ДиалогВФ.ПредварительныйПросмотр = Ложь;
	ДиалогВФ.ИндексФильтра = 0;
	ДиалогВФ.ПроверятьСуществованиеФайла = (Режим <> РежимДиалогаВыбораФайла.Сохранение);
	
	ПолноеИмяФайла = НачИмяФайла;
	Если НЕ ПустаяСтрока(ПолноеИмяФайла) Тогда
		Файл = Новый Файл(ПолноеИмяФайла);			
		ДиалогВФ.Каталог = Файл.Путь;	
	КонецЕсли;
	
	Если Режим = РежимДиалогаВыбораФайла.Открытие Тогда
		ДиалогВФ.Заголовок = НСтр("ru='Выберите файл для загрузки'");
		ДиалогВФ.ПолноеИмяФайла = ПолноеИмяФайла;
	Иначе
		ДиалогВФ.Заголовок = НСтр("ru='Выберите файл для выгрузки'");			
		ДиалогВФ.ПолноеИмяФайла = ПолноеИмяФайла;
	КонецЕсли;
		
	рВыборка = Ждать ДиалогВФ.ВыбратьАсинх();
	Если ТипЗнч(рВыборка)= Тип("Массив") И рВыборка.Количество()>0 Тогда
		Результат = рВыборка[0];	
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции

&НаКлиенте
Асинх Функция ВыборКаталогаАсинх(Знач НачИмяКаталога, ПроверятьСуществованиеФайла = Истина) Экспорт
	Результат = "";
	
	ДиалогВФ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		
	ДиалогВФ.ПредварительныйПросмотр = Ложь;
	ДиалогВФ.ИндексФильтра = 0;
	ДиалогВФ.ПроверятьСуществованиеФайла = ПроверятьСуществованиеФайла;
	ДиалогВФ.Каталог = НачИмяКаталога;	
	
	ДиалогВФ.Заголовок = НСтр("ru='Выберите каталог'");
			
	рВыбора = Ждать ДиалогВФ.ВыбратьАсинх();
	Если ТипЗнч(рВыбора)= Тип("Массив") И рВыбора.Количество()>0 Тогда
		Результат = рВыбора[0];	
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции