
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Автор) Тогда
		Объект.Автор = ПараметрыСеанса.Пользователь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ВидЗаявки) Тогда
		Объект.ВидЗаявки = Перечисления.ВидыЗаявокНаСкидки.УстановкаСкидок;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура СкидкиНоменклатураПриИзмененииНаСервере(Идентификатор)
	СтрокаТаблицы = Объект.Скидки.НайтиПоИдентификатору(Идентификатор);
	Если Не СтрокаТаблицы = Неопределено Тогда
		СтрокаТаблицы.Брэнд = СтрокаТаблицы.Номенклатура.Родитель;
		Уровень = СтрокаТаблицы.Номенклатура.Уровень();
		Если Уровень=0 Тогда
			СтрокаТаблицы.ТипТовара = СтрокаТаблицы.Номенклатура;
			СтрокаТаблицы.Брэнд = Справочники.Номенклатура.ПустаяСсылка();
			СтрокаТаблицы.Модель = Справочники.Номенклатура.ПустаяСсылка();
		ИначеЕсли Уровень=1 Тогда
			СтрокаТаблицы.ТипТовара = СтрокаТаблицы.Номенклатура.Родитель;                                             
			СтрокаТаблицы.Брэнд = СтрокаТаблицы.Номенклатура;
			СтрокаТаблицы.Модель = Справочники.Номенклатура.ПустаяСсылка();
		ИначеЕсли Уровень=2 Тогда
			СтрокаТаблицы.ТипТовара = СтрокаТаблицы.Номенклатура.Родитель.Родитель;
			СтрокаТаблицы.Брэнд  = СтрокаТаблицы.Номенклатура.Родитель;
			СтрокаТаблицы.Модель = СтрокаТаблицы.Номенклатура;
		ИначеЕсли Уровень=3 Тогда
			СтрокаТаблицы.ТипТовара = СтрокаТаблицы.Номенклатура.Родитель.Родитель.Родитель;
			СтрокаТаблицы.Брэнд = СтрокаТаблицы.Номенклатура.Родитель.Родитель;
			СтрокаТаблицы.Модель = СтрокаТаблицы.Номенклатура.Родитель;                      
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СкидкиНоменклатураПриИзменении(Элемент)
	Идентификатор = Элементы.Скидки.ТекущаяСтрока;
	СкидкиНоменклатураПриИзмененииНаСервере(Идентификатор);
КонецПроцедуры

