Процедура ПередЗаписью(Отказ)	
	Если НЕ ЭтоГруппа И НЕ ОбменДанными.Загрузка Тогда
	
		СтрокаОшибки = "Элемент справочника ""Банки"" " + Наименование + " не записан!";
		
		Если ЕстьНеЦифры(КоррСчет) Тогда
			
		//крохин начало 22.02.2012
		//в Р/с банков республики Казахтан могут быть цифры
		//СообщитьОбОшибке("В составе Корр.счета банка должны быть только цифры.",, СтрокаОшибки);
	    //Отказ = Истина;
		Если СокрЛП(Родитель.Код) <> "100" Тогда
		СообщитьОбОшибке("В составе Корр.счета банка должны быть только цифры.",, СтрокаОшибки);
		Отказ = Истина;
		КонецЕсли;
		//крохин конец 22.02.2012

		КонецЕсли; 
	
		Если ЕстьНеЦифры(Код) Тогда
						//крохин начало 22.02.2012
		//в Р/с банков республики Казахтан могут быть цифры
		//СообщитьОбОшибке("В составе БИК банка должны быть только цифры.",, СтрокаОшибки);
		//Отказ = Истина;
		Если СокрЛП(Родитель.Код) <> "100" Тогда
		СообщитьОбОшибке("В составе БИК банка должны быть только цифры.",, СтрокаОшибки);
	    Отказ = Истина;
		КонецЕсли;
		//крохин конец 22.02.2012

		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры