
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЗаданиеНаМаркировку") Тогда
		
		ЗаданиеНаМаркировку = Параметры.ЗаданиеНаМаркировку; 		
				
	КонецЕсли;
	
	ДобавитьУсловноеОформление(); 
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если ТолькоПросмотр Тогда Возврат КонецЕсли;	
	Если НЕ ВводДоступен() Тогда Возврат КонецЕсли;
	
	Если НЕ ЭтоСобытиеСканера(Событие) Тогда Возврат КонецЕсли;
	
	Данные=СтрЗаменить(Данные,Символы.ПС,"");
	
	глТорговоеОборудование.СканерПосылкаДанных(1);
	глСобытиеСканераОтработано = Истина;
	
	ОтработкаДанныхШККм(Данные);

КонецПроцедуры

&НаКлиенте
Процедура ОтработкаДанныхШККм(Данные)
	
	//Перем ДанныеМаркиЧЗ, КоличествоИзШК, НоваяСтрока, Номенклатура, Отбор, СтрокиСкан, ТипАгрегацииЧКод, ШтрихкодУпаковки;
	
	ДанныеМаркиЧЗ=Неопределено;
	
	КоличествоИзШК	= 0;
	Номенклатура	= НайтиТоварПоШтрихКоду(Данные,неопределено,КоличествоИзШК,ДанныеМаркиЧЗ);
	
	Если ДанныеМаркиЧЗ.СканировалиКодЧЗ  тогда
		
		ШтрихкодУпаковки = ДанныеМаркиЧЗ.МаркаЧЗ; 		
		
		Если ЗначениеЗаполнено(КодАгрегации) Тогда
			
			//заполняем ТЧ
			Отбор = Новый Структура("КодМаркировки",ШтрихкодУпаковки);
			
			СтрокиСкан =  ДанныеОтсканированные.НайтиСтроки(Отбор); 
			Если СтрокиСкан.Количество() = 0  Тогда
				
				ТипАгрегацииЧКод = ОпределитьТипАгрегации(ШтрихкодУпаковки);
				Если ТипАгрегацииЧКод = неопределено Тогда
					
					Сообщить("неверно отсканированный код",СтатусСообщения.Важное); 
					
					Возврат; 	
					
				КонецЕсли;
				
				НоваяСтрока = ДанныеОтсканированные.Добавить();
				НоваяСтрока.КодМаркировки =  ШтрихкодУпаковки; 
				НоваяСтрока.ТипАгрегации = ТипАгрегацииЧКод;  
				
			КонецЕсли;
			
		Иначе 
			ТипАгрегацииЧКод = ОпределитьТипАгрегации(ШтрихкодУпаковки,истина);
			
			Если ТипАгрегацииЧКод = неопределено Тогда
				
				Сообщить("неверно отсканированный код",СтатусСообщения.Важное); 
				Возврат; 	
				
			КонецЕсли;
			КодАгрегации = ШтрихкодУпаковки;
			ТипАгрегации = ТипАгрегацииЧКод; 
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Функция ОпределитьТипАгрегации(ШтрихкодУпаковки,ВШапку  = Ложь)
                                                 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИСТИНА КАК ЭтоШтука,
		|	ЛОЖЬ КАК ЭтоБлочок,
		|	ЛОЖЬ КАК ЭтоКоробка,
		|	ЛОЖЬ КАК ЭтоПаллета,
		|	4 КАК ЧисловойКод
		|ИЗ
		|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок КАК ЗаданиеНаМаркировкуШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаМаркировку КАК ЗаданиеНаМаркировку
		|		ПО ЗаданиеНаМаркировкуШтрихкодыУпаковок.Ссылка = ЗаданиеНаМаркировку.Ссылка
		|ГДЕ
		|	ЗаданиеНаМаркировку.Ссылка = &Ссылка
		|	И ЗаданиеНаМаркировкуШтрихкодыУпаковок.ШтрихкодУпаковки = &ШтрихкодУпаковки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛОЖЬ,
		|	ИСТИНА,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	3
		|ИЗ
		|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок КАК ЗаданиеНаМаркировкуШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаМаркировку КАК ЗаданиеНаМаркировку
		|		ПО ЗаданиеНаМаркировкуШтрихкодыУпаковок.Ссылка = ЗаданиеНаМаркировку.Ссылка
		|ГДЕ
		|	ЗаданиеНаМаркировку.Ссылка = &Ссылка
		|	И ЗаданиеНаМаркировкуШтрихкодыУпаковок.ШтрихкодБлочка = &ШтрихкодУпаковки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ИСТИНА,
		|	ЛОЖЬ,
		|	2
		|ИЗ
		|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок КАК ЗаданиеНаМаркировкуШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаМаркировку КАК ЗаданиеНаМаркировку
		|		ПО ЗаданиеНаМаркировкуШтрихкодыУпаковок.Ссылка = ЗаданиеНаМаркировку.Ссылка
		|ГДЕ
		|	ЗаданиеНаМаркировку.Ссылка = &Ссылка
		|	И ЗаданиеНаМаркировкуШтрихкодыУпаковок.ШтрихкодКоробки = &ШтрихкодУпаковки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ИСТИНА,
		|	1
		|ИЗ
		|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок КАК ЗаданиеНаМаркировкуШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаМаркировку КАК ЗаданиеНаМаркировку
		|		ПО ЗаданиеНаМаркировкуШтрихкодыУпаковок.Ссылка = ЗаданиеНаМаркировку.Ссылка
		|ГДЕ
		|	ЗаданиеНаМаркировку.Ссылка = &Ссылка
		|	И ЗаданиеНаМаркировкуШтрихкодыУпаковок.ШтрихкодПалеты = &ШтрихкодУпаковки";
	
	Запрос.УстановитьПараметр("Ссылка", ЗаданиеНаМаркировку);
	Запрос.УстановитьПараметр("ШтрихкодУпаковки", ШтрихкодУпаковки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	 
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Если ВШапку И ВыборкаДетальныеЗаписи.ЭтоШтука Тогда
			
			Сообщить("Для проверки отсканируйте паллету, короб или блочок!!!",СтатусСообщения.Важное); 
			
			Возврат неопределено; 
		Иначе 
			
			Возврат ВыборкаДетальныеЗаписи.ЧисловойКод; 
			
		КонецЕсли;
		
	Иначе 
		
		Возврат неопределено; 
	КонецЕсли;

КонецФункции // ЗаполнитьДанныеНаФорме()


&НаКлиенте
Процедура ДобавитьКодВручную(Команда)
	
	перем КодКМ; 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаКМВручную",ЭтаФорма);
	
	ОписаниеТипов = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(200)); 
	ПоказатьВводЗначения(ОписаниеОповещения,КодКМ,"Введите КМ",ОписаниеТипов); 
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ПослеВводаКМВручную(ШККм,ДополнительныеПараметры) Экспорт 
	Если ШККм = Неопределено Тогда
	
		Возврат; 	
	
	КонецЕсли;
	
	Если СтрДлина(ШККм) = 18 Тогда
		
		ШККм = "00" + ШККм; 	
	Иначе 
		ШККм1  =  СокрЛП(Справочники.ШтрихкодыУпаковокТоваров.ВосстановитьКод_GS1(ШККм));
		
		ШККм = Лев(ШККм1, 31) + СтрЗаменить(Сред(ШККм1, 32), Символ(29), "<GS>"); 
		
		КоличествоНулей = 83 - СтрДлина(ШККм); 
		Дополнить = Формат(1,"ЧЦ="+КоличествоНулей+"; ЧВН="); 
		
		ШККм  = ШККм  + Дополнить; 
	КонецЕсли;

	ОтработкаДанныхШККм(ШККм); 

КонецПроцедуры // ОписаниеТипов()

&НаКлиенте
Процедура ПроверитьВведенныеДанные(Команда)
	Если Не ЗначениеЗаполнено(КодАгрегации)
		 ИЛИ Не ЗначениеЗаполнено(ТипАгрегации) Тогда
		
		Сообщить("Для проверки отсканируйте паллету, короб или блочок!!!",СтатусСообщения.Важное);
		
		Возврат; 
		
	КонецЕсли;
	
	Если ДанныеОтсканированные.Количество() = 0 Тогда
	
		Сообщить("Для проверки заполните таблицу!!!",СтатусСообщения.Важное);
		
		Возврат; 
		
	КонецЕсли;
	
	МассивВозможныхКодов = ПолучитьМассивКодовПоТипуАгрегации(ТипАгрегации,ЗаданиеНаМаркировку,КодАгрегации);
	
	Для каждого СтрокаДанных Из ДанныеОтсканированные Цикл
	
		Если МассивВозможныхКодов.Найти(СтрокаДанных.КодМаркировки) = Неопределено  Тогда
		
			СтрокаДанных.Ошибка = Истина;  
		Иначе 
			СтрокаДанных.Проверено = Истина;
		КонецЕсли;
		 
	
	КонецЦикла;
	
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервереБезКонтекста
Функция ПолучитьМассивКодовПоТипуАгрегации(ТипАгрегации,ДокОснование,КодКМ)
	Запрос = Новый Запрос;
	
	ТекстЗапросаШтуки = 
	"ВЫБРАТЬ Различные
	|	ЗаданиеНаМаркировкуШтрихкодыУпаковок.ШтрихкодУпаковки КАК Штрихкод
	|ИЗ
	|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок КАК ЗаданиеНаМаркировкуШтрихкодыУпаковок
	|ГДЕ
	|	ЗаданиеНаМаркировкуШтрихкодыУпаковок.%ИмяКолонки% = &КодКМ
	|	И ЗаданиеНаМаркировкуШтрихкодыУпаковок.Ссылка = &Ссылка "; 
	
	ТекстЗапросаБлочки =
	"ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаданиеНаМаркировкуШтрихкодыУпаковок.ШтрихкодБлочка
	|ИЗ
	|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок КАК ЗаданиеНаМаркировкуШтрихкодыУпаковок
	|ГДЕ
	|	ЗаданиеНаМаркировкуШтрихкодыУпаковок.%ИмяКолонки% = &КодКМ
	|	И ЗаданиеНаМаркировкуШтрихкодыУпаковок.Ссылка = &Ссылка";
	
	ТекстЗапросаКоробки =
	"ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаданиеНаМаркировкуШтрихкодыУпаковок.ШтрихкодКоробки
	|ИЗ
	|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок КАК ЗаданиеНаМаркировкуШтрихкодыУпаковок
	|ГДЕ
	|	ЗаданиеНаМаркировкуШтрихкодыУпаковок.%ИмяКолонки% = &КодКМ
	|	И ЗаданиеНаМаркировкуШтрихкодыУпаковок.Ссылка = &Ссылка";
	
	Если ТипАгрегации = 3 Тогда   //блочок
		
		Запрос.Текст = ТекстЗапросаШтуки;
		ИмяКолонки = "ШтрихкодБлочка"; 
		
	ИначеЕсли ТипАгрегации = 2 Тогда //коробка
		
		Запрос.Текст = ТекстЗапросаШтуки + ТекстЗапросаБлочки;
		ИмяКолонки = "ШтрихкодКоробки";
		
	ИначеЕсли  ТипАгрегации = 3 Тогда //паллета
		
		Запрос.Текст = ТекстЗапросаШтуки + ТекстЗапросаБлочки + ТекстЗапросаКоробки;
		ИмяКолонки = "ШтрихкодПалеты";
	КонецЕсли;		
	
	Запрос.УстановитьПараметр("КодКМ", КодКМ);
	Запрос.УстановитьПараметр("Ссылка", ДокОснование);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ИмяКолонки%",ИмяКолонки); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Штрихкод"); 

КонецФункции // ()

&НаКлиенте
Процедура ОчиститьВсе(Команда)
	КодАгрегации = ПредопределенноеЗначение("Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка"); 
	ДанныеОтсканированные.Очистить();
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ДобавитьУсловноеОформление()

	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДанныеОтсканированные.Ошибка"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОтбора.Использование = Истина;
	
	//ЭлементОформления = ЭлементОформления.Оформление.Элементы[0];
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоРозовый);
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ДанныеОтсканированные");
	ПолеОформления.Использование = Истина;
	
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДанныеОтсканированные.Проверено"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОтбора.Использование = Истина;
	
	//ЭлементОформления = ЭлементОформления.Оформление.Элементы[0];
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЗеленый);
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ДанныеОтсканированные");
	ПолеОформления.Использование = Истина;
	//////////////////////////////////////////////////
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДанныеОтсканированные.ТипАгрегации"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 1;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("текст", "Паллета");
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ДанныеОтсканированныеТипАгрегации");
	ПолеОформления.Использование = Истина;
	//////////////////////////////////////////////////
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДанныеОтсканированные.ТипАгрегации"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 2;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("текст", "Короб");
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ДанныеОтсканированныеТипАгрегации");
	ПолеОформления.Использование = Истина;
	
	//////////////////////////////////////////////////
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДанныеОтсканированные.ТипАгрегации"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 3;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("текст", "Блочок");
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ДанныеОтсканированныеТипАгрегации");
	ПолеОформления.Использование = Истина; 
	
	//////////////////////////////////////////////////
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДанныеОтсканированные.ТипАгрегации"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 4;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("текст", "Штука");
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ДанныеОтсканированныеТипАгрегации");
	ПолеОформления.Использование = Истина
	
	
КонецПроцедуры // ДобавитьУсловноеОформление()

&НаКлиенте
Процедура ОК(Команда)
	Закрыть(); 
КонецПроцедуры



