
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	#ЕСЛИ ТолстыйКлиентОбычноеПриложение ТОГДА
	ВидОперации = ПолучитьВидОперации(ПараметрКоманды);
	
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов") Тогда
		Обработка	= Обработки.ПечатьЭтикетокЧЗ.Создать();
	Иначе		
		Обработка	= ПолучитьВнешнююОбработку("ПечатьЭтикетокЧЗ.epf", "PrnForms\");		
	КонецЕсли; 
	
	Если Обработка<>Неопределено Тогда
		Обработка.ШтрихКодУпаковки	= ПолучитьСписокКодов(ПараметрКоманды);		
		Обработка.ПолучитьФорму(,, ПараметрКоманды).Открыть();	
	КонецЕсли; 
	#КОНЕЦЕСЛИ
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокКодов(МассивСсылок)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка В (&МассивСсылок)	
	|";
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШтрихкодУпаковки");
КонецФункции // ()
 
&НаСервере
Функция ПолучитьВидОперации(МассивСсылок)
	Результат = Перечисления.ВидыОперацийМаркировки.ПустаяСсылка();
	
	Если МассивСсылок.Количество() > 0 Тогда
		Результат = ПолучитьРеквизитШапки(МассивСсылок[0], "ВидОперации");	
	КонецЕсли; 	
	
	Возврат Результат;
КонецФункции //ПолучитьВидОперации(МассивСсылок)
 