&НаКлиенте
Функция ПолучитьПараметрыОбработки()
	пОбработки = Новый Структура("Дата1,Дата2,Организация", Дата1,Дата2,Организация);
	Возврат пОбработки;
КонецФункции //ПолучитьПараметрыОбработки()

&НаКлиенте
Процедура ВыполнитьРассылку(Кнопка)
	пОбработки = ПолучитьПараметрыОбработки();
	ВыполнитьРассылку_НаСервере(пОбработки);	
КонецПроцедуры

&НаСервере
Функция ВыполнитьРассылку_НаСервере(пОбработки)
	рОбработки = РеквизитФормыВЗначение("Объект").ВыполнитьРассылку(пОбработки);
	
	Если рОбработки.Успешно Тогда
		ТД_Результат.Вывести(рОбработки.Данные);	
	КонецЕсли;                              
	
	МаркировкаКС.ВывестиОшибки(рОбработки);
	МаркировкаКС.ВывестиСообщения(рОбработки);
	
	Возврат рОбработки; 
КонецФункции