
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("ДатаЗапретаРедактирования", ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования());
	
	/////////// ПОСЛЕ ТЕСТИРОВАНИЯ УДАЛИТЬ ////////////////////////////////////////////////
	
	//МассивОтгружен = Новый Массив;
	//МассивОтгружен.Добавить(Перечисления.Отгружен.Резерв);
	
	//ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отгружен");
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	//ЭлементОтбора.Использование = Истина;
	//ЭлементОтбора.ПравоеЗначение = МассивОтгружен;
	
	//ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	//ЭлементОтбора.Использование = Истина;
	//ЭлементОтбора.ПравоеЗначение = ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования();
	
КонецПроцедуры
