Процедура Заполнить() Экспорт
	Запрос=Новый ("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ
	|	СкладПолучатель.Подразделение	КАК Подразделение,	
	|	ВЫРАЗИТЬ(ДокОснование КАК Документ.РасходнаяНакладная).Контрагент КАК ЮрЛицо,
	|	
	|	МИНИМУМ(Дата) КАК Период
	|ИЗ
	|	Документ.Перемещение
	|ГДЕ 
	|	Проведен	
	|	И Склад.Подразделение.ВидПодразделения	<> ЗНАЧЕНИЕ(Перечисление.ВидыПодразделений.Франчайзинг)
	|	И СкладПолучатель.Подразделение.ВидПодразделения	= ЗНАЧЕНИЕ(Перечисление.ВидыПодразделений.Франчайзинг)		
	|	И НЕ ВЫРАЗИТЬ(ДокОснование КАК Документ.РасходнаяНакладная).Номер ЕСТЬ NULL
	|	И ВЫРАЗИТЬ(ДокОснование КАК Документ.РасходнаяНакладная).Проведен = Истина
	|	И ВЫРАЗИТЬ(ДокОснование КАК Документ.РасходнаяНакладная).СостояниеНакладной = ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.Отгружена)	
	|СГРУППИРОВАТЬ ПО 	
	|	СкладПолучатель.Подразделение,	
	|	ВЫРАЗИТЬ(ДокОснование КАК Документ.РасходнаяНакладная).Контрагент
	|ИТОГИ МИНИМУМ(Период) ПО Подразделение";		
		
	
	ВыборкаПоПодразделениям=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Подразделение");
	Пока ВыборкаПоПодразделениям.Следующий() Цикл
		Выборка=ВыборкаПоПодразделениям.Выбрать();
		Пока Выборка.Следующий() Цикл
			МЗ	= РегистрыСведений.ФР_ЮрЛицаПодразделений.СоздатьМенеджерЗаписи();				
			ЗаполнитьЗначенияСвойств(МЗ,Выборка);		
			
			//Самая первая запись на 2014 год (из-за ввода остатков)
			Если Выборка.Период	= ВыборкаПоПодразделениям.Период И ГОД(ВыборкаПоПодразделениям.Период)=2015 Тогда		
				МЗ.Период=НачалоГода(МЗ.Период)-1;
			КонецЕсли;
			
			МЗ.Записать();		
		КонецЦикла;		
	КонецЦикла;	

КонецПроцедуры
 
Функция ПолучитьЮрЛицо(Подразделение,Знач Дата=Неопределено) Экспорт
	Если Дата=Неопределено Тогда
		Дата=ТекущаяДата();	
	КонецЕсли; 
	Отбор	= Новый Структура("Подразделение",Подразделение);
	Данные	= РегистрыСведений.ФР_ЮрЛицаПодразделений.ПолучитьПоследнее(НачалоДня(Дата),Отбор);
	
	Возврат Данные.ЮрЛицо;
КонецФункции //ПолучитьЮрЛицо(Подразделение,Знач Дата=Неопределено) Экспорт
 