
&НаСервере
Процедура ПрочитатьНаСервере()
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	РеквизитыСправочников.Справочник КАК Справочник,
	|	РеквизитыСправочников.ИмяРеквизита КАК ИмяРеквизита,
	|	РеквизитыСправочников.ЗначениеРеквизита КАК ЗначениеРеквизита,
	|	ИСТИНА КАК Отметка
	|ИЗ
	|	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
	|ГДЕ
	|	РеквизитыСправочников.ИмяРеквизита = &ИмяРеквизита";
	запрос.УстановитьПараметр("ИмяРеквизита",ИмяРеквизита);
	объект.РеквизитыСправочников.Загрузить(запрос.Выполнить().Выгрузить());
	
	
	Элементы.РеквизитыСправочниковЗначениеРеквизита.ОграничениеТипа=новый ОписаниеТипов("Строка"); 
	Элементы.РеквизитыСправочниковСправочник.ОграничениеТипа=новый ОписаниеТипов("СправочникСсылка.ТипыТовара");
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьНаКлиенте(Команда)
	если ЗначениеЗаполнено(ИмяРеквизита) тогда
		
		ПрочитатьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	НЗ=РегистрыСведений.РеквизитыСправочников.СоздатьМенеджерЗаписи();
	МассСтрок=объект.РеквизитыСправочников.НайтиСтроки(новый Структура("Отметка",Истина));
	для каждого СтрМасс из МассСтрок цикл
		если не ЗначениеЗаполнено(СтрМасс.ИмяРеквизита) тогда Продолжить;КонецЕсли;
		ЗапРег=РегистрыСведений.РеквизитыСправочников.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ЗапРег,СтрМасс);
		ЗапРег.Записать(Истина);
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНаКлиенте(Команда)
	ЗаписатьНаСервере();
	ПрочитатьНаКлиенте(Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура Отметить(Команда)
	Для каждого СтрТЧ из Объект.РеквизитыСправочников цикл
		если не ЗначениеЗаполнено(СтрТЧ.ИмяРеквизита) тогда
			СтрТЧ.отметка=ложь;
		иначе
			СтрТЧ.Отметка=не СтрТЧ.Отметка;			
		КонецЕсли;

	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УдалитьВыбранныеНаСервере()
если не ЗначениеЗаполнено(ИмяРеквизита) тогда Возврат;КонецЕсли;

	МассСтрок=объект.РеквизитыСправочников.НайтиСтроки(новый Структура("Отметка",Истина));
	для каждого СтрМасс из МассСтрок цикл
		если не ЗначениеЗаполнено(СтрМасс.ИмяРеквизита) тогда Продолжить;КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.РеквизитыСправочников.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИмяРеквизита.Установить(ИмяРеквизита);
		НаборЗаписей.Отбор.Справочник.Установить(СтрМасс.Справочник);	
		НаборЗаписей.Записать();

	КонецЦикла;
	

КонецПроцедуры

&НаКлиенте
Процедура УдалитьВыбранные(Команда)
	УдалитьВыбранныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИмяРеквизитаПриИзменении(Элемент)
	ПрочитатьНаКлиенте(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		ИмяРеквизитаПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыСправочниковОтметкаПриИзменении(Элемент)
	если Элементы.РеквизитыСправочников.текущиеданные.отметка тогда 
		Элементы.РеквизитыСправочников.текущиеданные.ИмяРеквизита=ИмяРеквизита;	
	КонецЕсли;
КонецПроцедуры
