#Область СлужебныеПроцедурыИФункции        

// Кухарь А.Ю.  17.06.2026 начало
// Изменение 0000000060
Функция ПолучитьДатуОплатыПоДокументуКлиентСервер (ПараметрыРасчета) Экспорт          
		
	Возврат ОбщегоНазначенияС.ПолучитьДатуОплатыСервер(ПараметрыРасчета);    

КонецФункции  

//Валетов+ 30.06.2026 Изменение 0000000060 
//Параметры:
//ДокументОбъект -  Объект, в котором надо заполнить реквизит ДатаОплаты
//Возвращает;
//Структура - Заполняется из объекта. 
//Набор полей устанавливается в единой процедуре ПолучитьНачальныйНаборПолейИсточникаДляРасчетаДатыОплаты
Функция ПолучитьЗаполнитьПараметрыРасчетаДатыОплатыПоДокументу(ДокументОбъект) Экспорт 
	
	СтрокаПолейДляРасчетаДатыОплаты		 = СтрСоединить(ОбщегоНазначенияКС.ПолучитьНачальныйНаборПолейИсточникаДляРасчетаДатыОплаты(),", ");
	СтруктураПолейДляРасчетаДатыОплаты 	 = Новый Структура(СтрокаПолейДляРасчетаДатыОплаты); 
	ЗаполнитьЗначенияСвойств(СтруктураПолейДляРасчетаДатыОплаты, ДокументОбъект);            
	
	Возврат СтруктураПолейДляРасчетаДатыОплаты; 
	
КонецФункции
//Валетов- 

Функция ПолучитьНачальныйНаборПолейИсточникаДляРасчетаДатыОплаты () Экспорт
	
	МассивПолей = Новый Массив;
	МассивПолей.Добавить("ДатаОтгрузки");
	МассивПолей.Добавить("Договор");
	МассивПолей.Добавить("ОтсрочкаПлатежа");
	
	Возврат МассивПолей;
	
КонецФункции
// Кухарь А.Ю.  17.06.2026 конец   

//++Данилова Е.В. 30.06.2026 Изм.№0000000174
	
Процедура УстановитьНомерДокументаКлиентСервер_(ДокументОбъект) Экспорт

	ОбщегоНазначенияС.УстановитьНомерДокументаСервер(ДокументОбъект);

КонецПроцедуры // УстановитьНомерДокумента()
	
//--Данилова Е.В. 30.06.2026
#КонецОбласти
