Функция ПолучитьПараметрыУстройства(Оборудование, ИмяКомпьютера) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ	
	|	КассаККМ,
	|	Параметры
	|ИЗ
	|	РегистрСведений.ТорговоеОборудование 
	|ГДЕ
	|	Компьютер = &Компьютер
	|	И Подключено
	|	И МодельТорговогоОборудования = &МодельТорговогоОборудования	
	|";
	
	Запрос.УстановитьПараметр("МодельТорговогоОборудования",	Оборудование);
	Запрос.УстановитьПараметр("Компьютер", 						Врег(СокрЛП(ИмяКомпьютера)));
	
	Результат = Неопределено;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если НЕ ПустаяСтрока(Выборка.Параметры) Тогда		
			Результат = ЗначениеИзСтрокиВнутр(Выборка.Параметры);
		КонецЕсли;
		
		Если Результат = Неопределено Тогда
			Результат = Новый Структура;
		КонецЕсли;		
	КонецЕсли; 	
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Результат = Новый Структура;	
	КонецЕсли; 
	
	Возврат Результат;	
КонецФункции

Функция СохранитьПараметрыУстройства(Оборудование, Параметры, КассаККМ, ИмяКомпьютера, Подключено) Экспорт

	Попытка		
		Запись = РегистрыСведений.ТорговоеОборудование.СоздатьМенеджерЗаписи();
		
		Запись.МодельТорговогоОборудования = Оборудование;
		Запись.Компьютер	= Врег(СокрЛП(ИмяКомпьютера));
		Запись.КассаККМ	    = КассаККМ;
		Запись.НомерЛогическогоУстройства = 1;
		Запись.Подключено	= Подключено;
		
		Запись.Параметры	= ЗначениеВСтрокуВнутр(Параметры);
		
		Запись.Записать();
			
		Результат = Истина;
			
		ОбновитьПовторноИспользуемыеЗначения();
	Исключение
		Результат = Ложь;
	КонецПопытки;
	
	Возврат Результат;

КонецФункции

Функция ПолучитьКассуПоОборудованию(Оборудование, ИмяКомпьютера) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ	
	|	КассаККМ	
	|ИЗ
	|	РегистрСведений.ТорговоеОборудование 
	|ГДЕ
	|	Компьютер = &Компьютер
	|	И Подключено
	|	И МодельТорговогоОборудования = &МодельТорговогоОборудования
	|";
	
	Запрос.УстановитьПараметр("МодельТорговогоОборудования",	Оборудование);
	Запрос.УстановитьПараметр("Компьютер", 						Врег(СокрЛП(ИмяКомпьютера())));
	
	Результат = Справочники.Кассы.ПустаяСсылка();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.КассаККМ) Тогда		
		Результат = Выборка.КассаККМ;
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции