
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Справочник.КодыGLN.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	ЗаполнитьКоличествоКодов(ПараметрКоманды);
	ОповеститьОбИзменении(ПараметрКоманды);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКоличествоКодов(Ссылка)                                    
	ИспользованоКодов = Справочники.КодыGLN.ПолучитьКоличествоИспользованныхКодов(Ссылка);
	Если ИспользованоКодов <> Ссылка.ИспользованоКодов Тогда
		УстановитьРеквизитыОбъекта(Ссылка, Новый Структура("ИспользованоКодов", ИспользованоКодов));
	КонецЕсли;	
КонецПроцедуры
