Перем НеКонтролироватьЗапись;

Процедура ПриКопировании(ОбъектКопирования)   Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	ДвиженияПоОстаткамТМЦ = Неопределено;
	
	РезультатПроведения=ПроведениеПоРегистрамОстатков(Ссылка,ДвиженияПоОстаткамТМЦ,ОбменДанными.Загрузка);
	ВыполнитьДвиженияПоРегистрам(ДвиженияПоОстаткамТМЦ, Истина);
	
	//контроль списания в минус
	Результат=РезультатПроведения["Результат"];
	
	Если Результат<0 И НЕ ОбменДанными.Загрузка Тогда		
		Отказ=Не(ПолучитьПолномочиеПользователя("СписыватьВМинус"));		
		
		ВывестиТрассировку(РезультатПроведения["ТОшибок"],?(Отказ,-2,Результат));			
	КонецЕсли; 
	
	ДвиженияПоВзаиморасчетам=Неопределено;
	РезультатПроведения=ПроведениеПоРегистрамВзаиморасчетов(Ссылка, ДвиженияПоВзаиморасчетам);
	ВыполнитьДвиженияПоРегистрам(ДвиженияПоВзаиморасчетам, Истина);
	
	
	ДвиженияПоОстаткамТМЦКомиссия = Неопределено;
	РезультатПроведения = ПроведениеПоРегиструОстаткиТМЦКомиссия(Ссылка,ДвиженияПоОстаткамТМЦКомиссия);
	ВыполнитьДвиженияПоРегистрам(ДвиженияПоОстаткамТМЦКомиссия, Истина);
	
	СформироватьДвиженияПоЗатратам();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.	
	
	ТипУзла = ПараметрыСеанса.ТипУзла;	
	
	ЕстьИзменения		=Модифицированность();	
	НужноВыгружать		=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	
	Если НЕ ОбменДанными.Загрузка Тогда		
		Если НеКонтролироватьЗапись Тогда
		Иначе
			КонтрольДатыЗапрета(ЭтотОбъект,Отказ);			
			МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
			МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		КонецЕсли;		
	КонецЕсли;		
	Если Отказ Тогда Возврат КонецЕсли; 
	
	
	
	Если ЕстьИзменения Тогда //Чирков - 25.10.12 - не трогать !!!
		
		// Кухарь А.Ю. 26.04.2022 начало
		// Уменьшаем размер ТЧ
		СвернутьТовары(); 
		// Кухарь А.Ю. 26.04.2022 конец
		
		СуммаДокумента		= Товары.Итог("Всего");
		СуммаОплата		= Товары.Итог("Оплата");
		КоличествоДокумента = Товары.Итог("Количество");
		//  Кухарь 22.06.2020 начало
		//  Итоги по расходам
		СуммаПрочихРасходов=Товары.Итог("ПрочиеРасходы");
		СуммаТранспортныхРасходов=Товары.Итог("ТранспортныеРасходы");
		СуммаКомиссионныхРасходов=Товары.Итог("КомиссионныеРасходы");
		СуммаПередачи=Товары.Итог("ВсегоПередачи");
		СуммаСкладскаяОбработка=Товары.Итог("СкладскаяОбработка");
		СуммаПлатноеХранение=Товары.Итог("ПлатноеХранение");
		СуммаАгентскоеВознаграждение=Товары.Итог("АгентскоеВознаграждение");
		
		
		//  Кухарь 22.06.2020 конец
		
		// Кухарь А.Ю. 27.10.2021 начало
		СуммаОплатыБонусами=товары.Итог("СуммаОплатыБонусами"); 
		// Кухарь А.Ю. 27.10.2021 конец
		
		
		
	КонецЕсли;	
	
	
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
		//Мессерле 10,09,12
		УстановитьПолучателейИзмененийОбъектаВнешние(ЭтотОбъект);
		//Катаев+ 08/10/14
		Если Не ЭтотОбъект.Ссылка.Пустая() Тогда
			НужноВыгружать = Ложь;
		КонецЕсли;
		//Катаев- 08/10/14
	КонецЕсли;
КонецПроцедуры

Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,Записывать=Ложь,Очищать=Истина)
	// 2011-11-21 сезонные бонусы ***
	Для Каждого НаборДвижений Из ДвиженияПоРегистрам Цикл
		ИмяРегистра		=НаборДвижений.Ключ;
		ТаблицаДвижения =НаборДвижений.Значение;
		
		Если Движения.Найти(ИмяРегистра)=Неопределено Тогда Продолжить  КонецЕсли; 
		
		НаборЗаписей=Движения[ИмяРегистра];
		// *** 2011-11-21 сезонные бонусы
		//НаборЗаписей.Очистить();
		// ---------- заменено на:
		Если Очищать Тогда
			НаборЗаписей.Очистить();
		КонецЕсли;
		// 2011-11-21 сезонные бонусы ***
		
		Для Каждого Движение Из ТаблицаДвижения Цикл
			Запись=НаборЗаписей.Добавить();	
			ЗаполнитьЗначенияСвойств(Запись,Движение);	
			
			Запись.Регистратор=Ссылка;
		КонецЦикла;	
		
		Если Записывать Тогда
			НаборЗаписей.Записать();		
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры 

Процедура СформироватьДвиженияПоЗатратам()
	ВалютаУпр=Константы.ВалютаУпрУчета_2009.Получить();
	
	ТЗРасходов=ИнициализироватьТаблицуРасходов();	
	для каждого СтрТЗРасходов из ТЗРасходов цикл
		Расходы=Ссылка[СтрТЗРасходов.ВидРасходов];
		если Расходы>0 тогда
			Движение = Движения.Затраты.Добавить();
			
			Движение.Период			= Дата;
			
			Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;		
			
			Движение.Подразделение	= Подразделение;			
			Движение.СтатьяЗатрат	= Справочники.СтатьиЗатрат.НайтиПоКоду("320 220"); //Бонусы и вознаграждения клиентам по договорам
			
			Движение.Контрагент = Контрагент;
			Движение.Договор = СтрТЗРасходов.Договор;
			
			
			Движение.СуммаУпр		= Расходы;	
			
			Движение.СуммаДокумента	= Расходы;
			Движение.ВалютаДокумента= ВалютаУпр;
			
			Движение.Комментарий        = СтрТЗРасходов.ВидРасходов;
			
			Движение.ДатаЗаписи		= ТекущаяДата();
			//крохин начало 08.12.2020
		ИначеЕсли  Расходы<0 Тогда
			Движение = Движения.Затраты.Добавить();
			
			Движение.Период			= Дата;
			
			Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;		
			
			Движение.Подразделение	= Подразделение;			
			Движение.СтатьяЗатрат	= Справочники.СтатьиЗатрат.НайтиПоКоду("320 220"); //Бонусы и вознаграждения клиентам по договорам
			
			Движение.Контрагент = Контрагент;
			Движение.Договор = СтрТЗРасходов.Договор;
			
			
			Движение.СуммаУпр		= -Расходы;	
			
			Движение.СуммаДокумента	= -Расходы;
			Движение.ВалютаДокумента= ВалютаУпр;
			
			Движение.Комментарий        = СтрТЗРасходов.ВидРасходов;
			
			Движение.ДатаЗаписи		= ТекущаяДата();
			//крохин конец 08.12.2020
			
		КонецЕсли;
	КонецЦикла;	
	Движения.Затраты.Записать();
КонецПроцедуры



Функция ИнициализироватьТаблицуРасходов()
	ТЗРасходов=новый ТаблицаЗначений;
	ТЗРасходов.Колонки.Добавить("ВидРасходов");
	ТЗРасходов.Колонки.Добавить("Договор");
	
	
	
	Если УчитыватьКомиссионныеРасходы = Перечисления.СпособыУчетаРасходовКомиссионера.УПДкОтчетуКомиссионера ИЛИ УчитыватьКомиссионныеРасходы = Перечисления.СпособыУчетаРасходовКомиссионера.УПДотсутствует Тогда
		СтрТЗ=ТЗРасходов.Добавить();
		СтрТЗ.ВидРасходов="СуммаКомиссионныхРасходов";
		СтрТЗ.Договор=Договор;
	КонецЕсли;
	
	
	Если УчитыватьТранспортныеРасходы = Перечисления.СпособыУчетаРасходовКомиссионера.УПДкОтчетуКомиссионера ИЛИ УчитыватьТранспортныеРасходы = Перечисления.СпособыУчетаРасходовКомиссионера.УПДотсутствует Тогда
		СтрТЗ=ТЗРасходов.Добавить();
		СтрТЗ.ВидРасходов="СуммаТранспортныхРасходов";
		СтрТЗ.Договор=Договор;
	КонецЕсли;
	
	
	Если УчитыватьПрочиеРасходы = Перечисления.СпособыУчетаРасходовКомиссионера.УПДкОтчетуКомиссионера ИЛИ УчитыватьПрочиеРасходы = Перечисления.СпособыУчетаРасходовКомиссионера.УПДотсутствует Тогда
		СтрТЗ=ТЗРасходов.Добавить();
		СтрТЗ.ВидРасходов="СуммаПрочихРасходов";
		СтрТЗ.Договор=Договор;
	КонецЕсли;
	
	
	Если УчитыватьСкладскуюОбработку = Перечисления.СпособыУчетаРасходовКомиссионера.УПДкОтчетуКомиссионера ИЛИ УчитыватьСкладскуюОбработку = Перечисления.СпособыУчетаРасходовКомиссионера.УПДотсутствует Тогда
		СтрТЗ=ТЗРасходов.Добавить();
		СтрТЗ.ВидРасходов="СуммаСкладскаяОбработка";
		СтрТЗ.Договор=Договор;
	КонецЕсли;
	
	
	
	Если УчитыватьПлатноеХранение = Перечисления.СпособыУчетаРасходовКомиссионера.УПДкОтчетуКомиссионера ИЛИ УчитыватьПлатноеХранение = Перечисления.СпособыУчетаРасходовКомиссионера.УПДотсутствует Тогда
		СтрТЗ=ТЗРасходов.Добавить();
		СтрТЗ.ВидРасходов="СуммаПлатноеХранение";
		СтрТЗ.Договор=Договор;
	КонецЕсли;
	
	
	Если УчитыватьАгентскоеВознаграждение = Перечисления.СпособыУчетаРасходовКомиссионера.УПДкОтчетуКомиссионера ИЛИ УчитыватьАгентскоеВознаграждение = Перечисления.СпособыУчетаРасходовКомиссионера.УПДотсутствует Тогда
		СтрТЗ=ТЗРасходов.Добавить();
		СтрТЗ.ВидРасходов="СуммаАгентскоеВознаграждение";
		СтрТЗ.Договор=Договор;
	КонецЕсли;
	
	
	
	//крохин конец 15.08.2020
	
	если ОтдельныеДоговораРасходов тогда
		Запрос=новый запрос;
		запрос.Текст= "ВЫБРАТЬ
		|	РеквизитыСправочников.ИмяРеквизита КАК ИмяРеквизита,
		|	РеквизитыСправочников.ЗначениеРеквизита КАК ЗначениеРеквизита
		|ИЗ
		|	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
		|ГДЕ
		|	РеквизитыСправочников.Справочник = &Справочник";
		запрос.УстановитьПараметр("Справочник",Контрагент);
		результат=запрос.Выполнить().Выгрузить();	
		Для каждого СтрТЗ из ТЗРасходов цикл
			СтрокаРезультата=ТЗРасходов.Найти(СтрЗаменить(СтрТЗ.ВидРасходов,"Сумма","Договор"),"ИмяРеквизита");
			Если СтрокаРезультата<>Неопределено тогда
				СтрТЗ.Договор=СтрокаРезультата.ЗначениеРеквизита;
			КонецЕсли;	
		КонецЦикла;		
	КонецЕсли;
	
	возврат ТЗРасходов;
	
КонецФункции

Процедура СвернутьТовары ()
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ОтчетКомиссионераТовары.Номенклатура КАК Номенклатура,
	|	ОтчетКомиссионераТовары.Количество КАК Количество,
	|	ОтчетКомиссионераТовары.Всего КАК Всего, 
	//нечаева 30,12,25
	|	ОтчетКомиссионераТовары.ВсегоБезСкидкиСПП КАК ВсегоБезСкидкиСПП, 
	|	ОтчетКомиссионераТовары.ТранспортныеРасходы КАК ТранспортныеРасходы,
	|	ОтчетКомиссионераТовары.КомиссионныеРасходы КАК КомиссионныеРасходы,
	|	ОтчетКомиссионераТовары.Оплата КАК Оплата,
	|	ОтчетКомиссионераТовары.ПрочиеРасходы КАК ПрочиеРасходы,
	|	ОтчетКомиссионераТовары.СтавкаНДС КАК СтавкаНДС,
	|	ОтчетКомиссионераТовары.Сумма КАК Сумма,
	|	ОтчетКомиссионераТовары.НДС КАК НДС,
	|	ОтчетКомиссионераТовары.НДСОплата КАК НДСОплата,
	|	ОтчетКомиссионераТовары.ВсегоПередачи КАК ВсегоПередачи,
	|	ОтчетКомиссионераТовары.ШтрихКод КАК ШтрихКод,
	|	ОтчетКомиссионераТовары.СкладскаяОбработка КАК СкладскаяОбработка,
	|	ОтчетКомиссионераТовары.ПлатноеХранение КАК ПлатноеХранение,
	|	ОтчетКомиссионераТовары.АгентскоеВознаграждение КАК АгентскоеВознаграждение,
	|	ОтчетКомиссионераТовары.СуммаОплатыБонусами КАК СуммаОплатыБонусами,
	|	ОтчетКомиссионераТовары.ВсегоБезБонусов КАК ВсегоБезБонусов,
	// Кухарь А.Ю.  24.01.2023 начало
	|	ОтчетКомиссионераТовары.УслугиЭкспорт КАК УслугиЭкспорт,
	// Кухарь А.Ю.  24.01.2023 конец
	// Кухарь А.Ю. 07.08.2023 начало
	|	ОтчетКомиссионераТовары.ВсегоБухгалтерское КАК ВсегоБухгалтерское,
	// Кухарь А.Ю. 07.08.2023 конец
	// Кухарь А.Ю.  22.11.2023 начало
	//
	|	ОтчетКомиссионераТовары.Контрагент КАК Контрагент,
	|	ОтчетКомиссионераТовары.НомерУПД КАК НомерУПД,
	|	ОтчетКомиссионераТовары.ДатаУПД КАК ДатаУПД,
	
	// Кухарь А.Ю.  22.11.2023 конец
	
	
	
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионераТовары.Количество < 0
	|			ТОГДА ""Минус""
	//            |		КОГДА ОтчетКомиссионераТовары.Количество = 0
	//           |			ТОГДА ""Ноль""
	|		ИНАЧЕ ""Плюс""
	|	КОНЕЦ КАК Знак
	|ПОМЕСТИТЬ ВремТЗ
	|ИЗ
	|	&ТЗ КАК ОтчетКомиссионераТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетКомиссионераТовары.Номенклатура КАК Номенклатура,
	// Кухарь А.Ю.  22.11.2023 начало
	//
	|	ОтчетКомиссионераТовары.Контрагент КАК Контрагент,
	|	ОтчетКомиссионераТовары.НомерУПД КАК НомерУПД,
	|	ОтчетКомиссионераТовары.ДатаУПД КАК ДатаУПД,
	
	// Кухарь А.Ю.  22.11.2023 конец
	
	|	СУММА(ОтчетКомиссионераТовары.Количество) КАК Количество,
	|	СУММА(ОтчетКомиссионераТовары.Всего) КАК Всего, 
	|	сумма(ОтчетКомиссионераТовары.ВсегоБезСкидкиСПП) КАК ВсегоБезСкидкиСПП,
	|	СУММА(ОтчетКомиссионераТовары.ТранспортныеРасходы) КАК ТранспортныеРасходы,
	|	СУММА(ОтчетКомиссионераТовары.КомиссионныеРасходы) КАК КомиссионныеРасходы,
	|	СУММА(ОтчетКомиссионераТовары.Оплата) КАК Оплата,
	|	СУММА(ОтчетКомиссионераТовары.ПрочиеРасходы) КАК ПрочиеРасходы,
	|	ОтчетКомиссионераТовары.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ОтчетКомиссионераТовары.Сумма) КАК Сумма,
	|	СУММА(ОтчетКомиссионераТовары.НДС) КАК НДС,
	|	СУММА(ОтчетКомиссионераТовары.НДСОплата) КАК НДСОплата,
	|	СУММА(ОтчетКомиссионераТовары.ВсегоПередачи) КАК ВсегоПередачи,
	|	МАКСИМУМ(ОтчетКомиссионераТовары.ШтрихКод) КАК ШтрихКод,
	|	СУММА(ОтчетКомиссионераТовары.СкладскаяОбработка) КАК СкладскаяОбработка,
	|	СУММА(ОтчетКомиссионераТовары.ПлатноеХранение) КАК ПлатноеХранение,
	|	СУММА(ОтчетКомиссионераТовары.АгентскоеВознаграждение) КАК АгентскоеВознаграждение,
	|	СУММА(ОтчетКомиссионераТовары.СуммаОплатыБонусами) КАК СуммаОплатыБонусами,
	|	СУММА(ОтчетКомиссионераТовары.ВсегоБезБонусов) КАК ВсегоБезБонусов,
	// Кухарь А.Ю.  24.01.2023 начало
	|	СУММА(ОтчетКомиссионераТовары.УслугиЭкспорт) КАК УслугиЭкспорт,
	// Кухарь А.Ю.  24.01.2023 конец
	// Кухарь А.Ю.  24.01.2023 начало
	|	СУММА(ОтчетКомиссионераТовары.ВсегоБухгалтерское) КАК ВсегоБухгалтерское,
	// Кухарь А.Ю.  24.01.2023 конец
	
	|	ОтчетКомиссионераТовары.Знак КАК Знак
	|ПОМЕСТИТЬ ТЗСвернКомиссионеров
	|ИЗ
	|	ВремТЗ КАК ОтчетКомиссионераТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетКомиссионераТовары.Номенклатура,
	|	ОтчетКомиссионераТовары.СтавкаНДС,
	// Кухарь А.Ю.  22.11.2023 начало
	//
	|	ОтчетКомиссионераТовары.Контрагент,
	|	ОтчетКомиссионераТовары.НомерУПД,
	|	ОтчетКомиссионераТовары.ДатаУПД,
	
	// Кухарь А.Ю.  22.11.2023 конец
	
	|	ОтчетКомиссионераТовары.Знак
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗСвернКомиссионеров.Номенклатура КАК Номенклатура,
	// Кухарь А.Ю.  22.11.2023 начало
	//
	|	ТЗСвернКомиссионеров.Контрагент КАК Контрагент,
	|	ТЗСвернКомиссионеров.НомерУПД КАК НомерУПД,
	|	ТЗСвернКомиссионеров.ДатаУПД КАК ДатаУПД,
	
	// Кухарь А.Ю.  22.11.2023 конец
	
	|	ТЗСвернКомиссионеров.Количество КАК Количество,
	|	ТЗСвернКомиссионеров.Всего КАК Всего, 
	// нечаева 30,12,25 ++
	|	ТЗСвернКомиссионеров.ВсегоБезСкидкиСПП КАК ВсегоБезСкидкиСПП,
	|	ТЗСвернКомиссионеров.ТранспортныеРасходы КАК ТранспортныеРасходы,
	|	ТЗСвернКомиссионеров.КомиссионныеРасходы КАК КомиссионныеРасходы,
	|	ТЗСвернКомиссионеров.Оплата КАК Оплата,
	|	ТЗСвернКомиссионеров.ПрочиеРасходы КАК ПрочиеРасходы,
	|	ТЗСвернКомиссионеров.СтавкаНДС КАК СтавкаНДС,
	|	ТЗСвернКомиссионеров.Сумма КАК Сумма,
	|	ТЗСвернКомиссионеров.НДС КАК НДС,
	|	ТЗСвернКомиссионеров.НДСОплата КАК НДСОплата,
	|	ТЗСвернКомиссионеров.ВсегоПередачи КАК ВсегоПередачи,
	|	ТЗСвернКомиссионеров.ШтрихКод КАК ШтрихКод,
	|	ТЗСвернКомиссионеров.СкладскаяОбработка КАК СкладскаяОбработка,
	|	ТЗСвернКомиссионеров.ПлатноеХранение КАК ПлатноеХранение,
	|	ТЗСвернКомиссионеров.АгентскоеВознаграждение КАК АгентскоеВознаграждение,
	|	ТЗСвернКомиссионеров.СуммаОплатыБонусами КАК СуммаОплатыБонусами,
	|	ТЗСвернКомиссионеров.ВсегоБезБонусов КАК ВсегоБезБонусов,
	// Кухарь А.Ю.  24.01.2023 начало
	|	ТЗСвернКомиссионеров.УслугиЭкспорт КАК УслугиЭкспорт,
	// Кухарь А.Ю.  24.01.2023 конец
	// Кухарь А.Ю.  24.01.2023 начало
	|	ТЗСвернКомиссионеров.ВсегоБухгалтерское КАК ВсегоБухгалтерское,
	// Кухарь А.Ю.  24.01.2023 конец		
	|	ВЫБОР
	|		КОГДА ТЗСвернКомиссионеров.Количество = 0
	|			ТОГДА ТЗСвернКомиссионеров.Всего
	|		ИНАЧЕ ТЗСвернКомиссионеров.Всего / ТЗСвернКомиссионеров.Количество
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА ТЗСвернКомиссионеров.Количество = 0
	|			ТОГДА ТЗСвернКомиссионеров.ВсегоПередачи
	|		ИНАЧЕ ТЗСвернКомиссионеров.ВсегоПередачи / ТЗСвернКомиссионеров.Количество
	|	КОНЕЦ КАК ЦенаПередачи, 
	/// нечаева 30,12,25 +++
	|	ВЫБОР
	|		КОГДА ТЗСвернКомиссионеров.Количество = 0
	|			ТОГДА ТЗСвернКомиссионеров.ВсегоБезСкидкиСПП
	|		ИНАЧЕ ТЗСвернКомиссионеров.ВсегоБезСкидкиСПП / ТЗСвернКомиссионеров.Количество
	|	КОНЕЦ КАК ЦенаБезСкидкиСПП
	|ИЗ
	|	ТЗСвернКомиссионеров КАК ТЗСвернКомиссионеров";
	запрос.УстановитьПараметр("ТЗ",Товары);
	Товары.Загрузить(запрос.Выполнить().Выгрузить());
	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры
// Кухарь А.Ю. 27.10.2021 конец



НеКонтролироватьЗапись	=Ложь;
