Процедура ПриЗаписи(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;	
	
	локУстановитьПолучателей();	
КонецПроцедуры

Функция локУстановитьПолучателей()
	Для каждого Запись Из ЭтотОбъект Цикл                         
		рПакета = ПолучитьРеквизитыШапки(Запись.Пакет, "ПланОбмена,Отправитель,Получатель");
		Если Запись.КодУзла = Маркировка_ПИ.ЭтотУзел_Код(рПакета.ПланОбмена) И Запись.КодУзла = рПакета.Получатель Тогда
			УзелПолучатель = Маркировка_ПИ.УзелПоКоду(рПакета.Отправитель, рПакета.ПланОбмена);
			ПланыОбмена.ЗарегистрироватьИзменения(УзелПолучатель, ЭтотОбъект);
			Прервать;			
		КонецЕсли;	
	КонецЦикла;
КонецФункции //локУстановитьПолучателей()