
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//++Данилова Е.В. 27.01.2026 SNL-109 
	ЗаписатьДвиженияБлокировкаВыдачиВНабор(); 
	//--Данилова Е.В. 27.01.2026 
КонецПроцедуры

//++Данилова Е.В. 27.01.2026 SNL-109
Процедура ЗаписатьДвиженияБлокировкаВыдачиВНабор()
	
	Движения.БлокировкаВыдачиВНабор.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БлокировкаВыдачиВНаборСклады.Склад КАК Склад
		|ПОМЕСТИТЬ ВТСклады
		|ИЗ
		|	Документ.БлокировкаВыдачиВНабор.Склады КАК БлокировкаВыдачиВНаборСклады
		|ГДЕ
		|	БлокировкаВыдачиВНаборСклады.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БлокировкаВыдачиВНаборНоменклатура.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТНоменклатура
		|ИЗ
		|	Документ.БлокировкаВыдачиВНабор.Номенклатура КАК БлокировкаВыдачиВНаборНоменклатура
		|ГДЕ
		|	БлокировкаВыдачиВНаборНоменклатура.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСклады.Склад КАК Склад,
		|	ВТНоменклатура.Номенклатура КАК Номенклатура
		|ИЗ
		|	ВТСклады КАК ВТСклады
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНоменклатура КАК ВТНоменклатура
		|		ПО (ИСТИНА)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Склад,
		|	Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
		
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НоваяЗапись = Движения.БлокировкаВыдачиВНабор.Добавить(); 
			ЗаполнитьЗначенияСвойств(НоваяЗапись,ВыборкаДетальныеЗаписи); 
			НоваяЗапись.Активен = Истина;				
			НоваяЗапись.Период = ДатаНачала;
		КонецЦикла;
		
		ВыборкаДетальныеЗаписи.Сбросить(); 
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НоваяЗапись = Движения.БлокировкаВыдачиВНабор.Добавить(); 
			ЗаполнитьЗначенияСвойств(НоваяЗапись,ВыборкаДетальныеЗаписи); 
			НоваяЗапись.Активен = Ложь;				
			НоваяЗапись.Период = ДатаОкончания; 
		КонецЦикла;
		
		ВыборкаДетальныеЗаписи.Сбросить(); 
		
	КонецЕсли; 	

    Движения.БлокировкаВыдачиВНабор.Записать(); 
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Модифицированность()
		И (НЕ ДополнительныеСвойства.Свойство("НеПерезаписыватьДатуFBS")
		ИЛИ НЕ ДополнительныеСвойства.НеПерезаписыватьДатуFBS ) Тогда
		
		УстановитьДатуначалаБлокировкиFBS();
		
	КонецЕсли; 
	
	Если Модифицированность()  Тогда
	
		РазвернутьГруппыТоваровДоМоделей(); 	
	
	КонецЕсли;
	//++Данилова Е.В. 05.02.2026 SNL-109 
	ЕстьИзменения	= Модифицированность();
	НужноВыгружать	= НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления); 
	Если НужноВыгружать Тогда  
		
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
			
	КонецЕсли;
	//--Данилова Е.В. 05.02.2026 

КонецПроцедуры

Процедура УстановитьДатуначалаБлокировкиFBS()

	ДатаНачалаБлокировкиFBS =  ДатаНачала - 12*3600; 
	
КонецПроцедуры

Процедура РазвернутьГруппыТоваровДоМоделей()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТзНоменклатура",номенклатура.Выгрузить()); 
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БлокировкаВыдачиВНаборНоменклатура.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТНомеклатура
		|ИЗ
		|	&ТзНоменклатура КАК БлокировкаВыдачиВНаборНоменклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СпрНоменклатура.Родитель КАК Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК СпрНоменклатура
		|ГДЕ
		|	СпрНоменклатура.Ссылка В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				ВТНомеклатура.Номенклатура
		|			ИЗ
		|				ВТНомеклатура)
		|	И НЕ СпрНоменклатура.ПометкаУдаления
		|	И НЕ СпрНоменклатура.ЭтоГруппа
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура";
	
	ТЗТовары = Запрос.Выполнить().Выгрузить(); 
	Если ТЗТовары.Количество() > 0  Тогда
		
		Номенклатура.Загрузить(ТЗТовары);	
		
	КонецЕсли;
	  	


КонецПроцедуры

//--Данилова Е.В. 02.02.2026

