Процедура ОбменДанными(ТаблицаПараметров = Неопределено, АдресВозврата = Неопределено) Экспорт
	рПроверки = МожноВыполнятьОбмен();
	Если НЕ рПроверки.Успешно Тогда	
		ЗаписатьВЛог("ОбменДаннымиЧЗ", СтрСоединить(рПроверки.Ошибки, символы.ПС), "Информация");
		Возврат;
	КонецЕсли;                       
	
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();	
	
	Если ОбменДаннымиЧЗ.ЕстьЗапущенныеЗаданияОбмена() Тогда
		ТекстСообщения = "Пропуск запуска регламентнаного задания.
		|В настоящий момент уже выполняется обмен данными !";
		ЗаписатьВЛог("ОбменДаннымиЧЗ", ТекстСообщения, "Предупреждение");
		Возврат;			
	Иначе
		ЗаписатьВЛог("ОбменДаннымиЧЗ", "Начало выполнения. " + ТипЗнч(ТаблицаПараметров), "Информация");	
	КонецЕсли;	
	
	Если ТаблицаПараметров <> Неопределено Тогда
		Если ТипЗнч(ТаблицаПараметров) = Тип("ТаблицаЗначений") Тогда
			ПараметрыЗадания = ПолучитьПараметрыИзТЗ(ТаблицаПараметров);
		Иначе		
			ПараметрыЗадания = ТаблицаПараметров;		
		КонецЕсли;		
		
		КодыУзлов = МаркировкаКС.ПолучитьЗначениеПараметра(ПараметрыЗадания, "КодыУзлов", "");		
		Если ТипЗнч(КодыУзлов) = Тип("Массив") Тогда
			КодыУзлов = СтрСоединить(КодыУзлов, ",");		
		КонецЕсли;
		
		Для Каждого КодУзла Из СтрРазделить(КодыУзлов, ",") Цикл				
			УзелПолучатель = Маркировка_ПИ.УзелПоКоду(КодУзла, "ДанныеЧЗ");
			Если ЗначениеЗаполнено(УзелПолучатель) Тогда
				рПроверки = МожноВыполнятьОбменСУзлом(УзелПолучатель);					
				Если рПроверки.Успешно Тогда
					ВыполнитьОбменСУзлом(УзелПолучатель);
				Иначе
					ЗаписатьВЛог("ОбменДаннымиЧЗ", СтрСоединить(рПроверки.Ошибки, Символы.ПС), "Ошибка");												
				КонецЕсли;						
			Иначе                         
				ТекстСообщения = СтрШаблон("Ошибка выполнения ! Не найден узел с кодом: '%1' !", КодУзла);
				ЗаписатьВЛог("ОбменДаннымиЧЗ", ТекстСообщения, "Ошибка");
			КонецЕсли;					
		КонецЦикла;		
	Иначе
		ЗаписатьВЛог("ОбменДаннымиЧЗ", "Ошибка выполнения ! Не заданы параметры задачи !", "Ошибка");
	КонецЕсли;
	
	ЗаписатьВЛог("ОбменДаннымиЧЗ", "Завершение выполнения.", "Информация", , , (ТекущаяУниверсальнаяДатаВМиллисекундах()-Начало)/1000);	
КонецПроцедуры //ОбменДанными(ТаблицаПараметров = Неопределено) Экспорт

Процедура ОбменДаннымиСвертка(ТаблицаПараметров = Неопределено, АдресВозврата = Неопределено) Экспорт
	ИмяПО	= "Свертка";
	ИмяЛога = ИмяЛогаОбмена(ИмяПО);
	рПроверки = МожноВыполнятьОбмен();
	Если НЕ рПроверки.Успешно И НЕ Маркировка_ПИ.ЭтоНовыйУзелСвертки() Тогда	
		ЗаписатьВЛог(ИмяЛога, СтрСоединить(рПроверки.Ошибки, Символы.ПС), "Информация");
		Возврат;
	КонецЕсли;                       
	
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();	
			
	Если ТаблицаПараметров <> Неопределено Тогда
		Если ТипЗнч(ТаблицаПараметров) = Тип("ТаблицаЗначений") Тогда
			ПараметрыЗадания = ПолучитьПараметрыИзТЗ(ТаблицаПараметров);
		Иначе		
			ПараметрыЗадания = ТаблицаПараметров;		
		КонецЕсли;		
		
		КодыУзлов = МаркировкаКС.ПолучитьЗначениеПараметра(ПараметрыЗадания, "КодыУзлов", "");		
		Если ТипЗнч(КодыУзлов) = Тип("Массив") Тогда
			КодыУзлов = СтрСоединить(КодыУзлов, ",");		
		КонецЕсли;
		
		Для Каждого КодУзла Из СтрРазделить(КодыУзлов, ",") Цикл				
			УзелПолучатель = Маркировка_ПИ.УзелПоКоду(КодУзла, ИмяПО);
			Если ЗначениеЗаполнено(УзелПолучатель) Тогда
				рПроверки = МожноВыполнятьОбменСУзлом(УзелПолучатель);					
				Если рПроверки.Успешно Тогда
					ВыполнитьОбменСУзлом(УзелПолучатель);
				Иначе
					ЗаписатьВЛог(ИмяЛога, СтрСоединить(рПроверки.Ошибки, Символы.ПС), "Ошибка");												
				КонецЕсли;						
			Иначе                         
				ТекстСообщения = СтрШаблон("Ошибка выполнения ! Не найден узел с кодом: '%1' !", КодУзла);
				ЗаписатьВЛог(ИмяЛога, ТекстСообщения, "Ошибка");
			КонецЕсли;					
		КонецЦикла;		
	Иначе
		ЗаписатьВЛог(ИмяЛога, "Ошибка выполнения ! Не заданы параметры задачи !", "Ошибка");
	КонецЕсли;
КонецПроцедуры //ОбменДаннымиСвертка(ТаблицаПараметров = Неопределено) Экспорт

Функция ПолучитьПараметрыИзТЗ(ТЗ)
	Параметры = Новый Структура;	
	Для каждого СтрокаТЗ Из ТЗ Цикл
		ТекЗнач = МаркировкаКС.ПолучитьЗначениеПараметра(Параметры, СтрокаТЗ.Имя);
		Если ЗначениеЗаполнено(ТекЗнач) Тогда
			Если ТипЗнч(ТекЗнач) <> Тип("Массив") Тогда				
				ВремЗнач = ТекЗнач;
				ТекЗнач = Новый Массив;
				ТекЗнач.Добавить(ВремЗнач);
			КонецЕсли;
			ТекЗнач.Добавить(СтрокаТЗ.Значение);
		Иначе  
			ТекЗнач = СтрокаТЗ.Значение;						
		КонецЕсли;		
		
		Параметры.Вставить(СтрокаТЗ.Имя, ТекЗнач);
	КонецЦикла;	
	
	Возврат Параметры;
КонецФункции //ПолучитьПараметрыИзТЗ()

Функция МожноВыполнятьОбмен() Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	СтрокаСоединенияСразрешеннымОбменом	= ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения					= ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	
	//Кухарь А.Ю.  31.03.2026 начало
	//Рефакторинг. Приведение к 1й функции
	//Если ТекСтрокаСоединения <> СтрокаСоединенияСразрешеннымОбменом Тогда
	если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() тогда	
		//Кухарь А.Ю.  31.03.2026 конец
		
		Результат.Успешно = Ложь;
		
		ТекстОшибки = СтрШаблон("Отмена выполнения. Задача: Обмен данными. Автообмен разрешен для базы: '%1', тек. база: '%2' !", СтрокаСоединенияСразрешеннымОбменом, ТекСтрокаСоединения);
		Результат.Ошибки.Добавить(ТекстОшибки);		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции // МожноВыполнятьОбмен()

Функция МожноВыполнятьОбменСУзлом(УзелПолучатель)
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	МетаОбъект = Метаданные.НайтиПоТипу(ТипЗнч(УзелПолучатель));
	
	Если УзелПолучатель = Маркировка_ПИ.ЭтотУзел(МетаОбъект.Имя) Тогда
		Результат.Ошибки.Добавить(СтрШаблон("Обмен сам собой невозможен ! (Источник и получатель: '%1')", УзелПолучатель));
	Иначе
		Если ПолучитьРеквизитШапки(УзелПолучатель, "ПометкаУдаления") Тогда
			Результат.Ошибки.Добавить(СтрШаблон("Узел '%1' помечен на удаление !", УзелПолучатель));			
		Иначе
			Результат.Успешно = Истина; 
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //МожноВыполнятьОбменСУзлом(УзелПолучатель)

Функция ВыполнитьОбменСУзлом(УзелКорреспондент, АдресВозврата = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ИмяПланаОбмена	= УзелКорреспондент.Метаданные().Имя;
	ИмяЛога			= ИмяЛогаОбмена(ИмяПланаОбмена);
	
	ЗаписатьВЛог(ИмяЛога, "Начало обмена с узлом: " + УзелКорреспондент, "Информация");
	
	СоздатьПакетыВыгрузки(УзелКорреспондент);
	
	рВыгрузки = ВыгрузитьПакетыВКаталог(УзелКорреспондент);
	Если рВыгрузки.Успешно Тогда
		МаркировкаКС.ДобавитьСообщения(Результат, рВыгрузки);
	Иначе
		МаркировкаКС.ДобавитьОшибки(Результат, рВыгрузки);
	КонецЕсли; 
	
	КаталогОбмена = ПолучитьРеквизитШапки(УзелКорреспондент, "АдресОбмена");
	
	рЧтения = Справочники.ФР_ПакетыДанных.ПрочитатьПакетыИзКаталога(КаталогОбмена, ИмяПланаОбмена);
	Если рЧтения.Успешно Тогда
		Если рЧтения.ОбработаноОбъектов = 1 Тогда
			ТекстСообщения = "Прочитан " + ПолучитьСклоненияСтрокиПоЧислу("пакет данных", рЧтения.ОбработаноОбъектов)[0];
		Иначе
			ТекстСообщения = "Прочитано " + ПолучитьСклоненияСтрокиПоЧислу("пакет данных", рЧтения.ОбработаноОбъектов)[0];	
		КонецЕсли;
		
		ТекстСообщения = ТекстСообщения + СтрШаблон(" из каталога '%1'.", КаталогОбмена);
		Результат.Сообщения.Добавить(ТекстСообщения);		
	Иначе
		МаркировкаКС.ДобавитьОшибки(Результат, рЧтения);
	КонецЕсли;
	
	//+++Чирков 13.07.2026 0000003319
	//рЗагрузки = Справочники.ФР_ПакетыДанных.ЗагрузитьПакеты(, Новый Структура("ИмяПланаОбмена,фВыполнятьВФоне", ИмяПланаОбмена, Истина));
	рЗагрузки = Справочники.ФР_ПакетыДанных.ЗагрузитьПакетыПоПорядку(Новый Структура("ИмяПланаОбмена,фВыполнятьВФоне", ИмяПланаОбмена, Истина));
	//---Чирков 13.07.2026	
	Если рЗагрузки.Успешно Тогда
		Если рЗагрузки.ОбработаноОбъектов = 1 Тогда
			ТекстСообщения = "Загружен " + ПолучитьСклоненияСтрокиПоЧислу("пакет данных", рЗагрузки.ОбработаноОбъектов)[0];
		Иначе
			ТекстСообщения = "Загружено " + ПолучитьСклоненияСтрокиПоЧислу("пакет данных", рЗагрузки.ОбработаноОбъектов)[0];	
		КонецЕсли;
		
		Результат.Сообщения.Добавить(ТекстСообщения);
	Иначе
		МаркировкаКС.ДобавитьОшибки(Результат, рЗагрузки);
	КонецЕсли;	
	
	ЗаписатьВЛог(ИмяЛога, "Завершение обмена с узлом: " + УзелКорреспондент, "Информация", , , (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000);
	
	Если ЭтоАдресВременногоХранилища(АдресВозврата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресВозврата);		
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ВыполнитьОбменСУзлом(КодУзла)  

Функция ИмяЛогаОбмена(ИмяПланаОбмена) Экспорт
	мИмяПланаОбмена = "";
	Если ТипЗнч(ИмяПланаОбмена) = Тип("Строка") Тогда
		мИмяПланаОбмена = ИмяПланаОбмена;
	Иначе //Узел           
		МетаОбъект = Метаданные.НайтиПоТипу(ТипЗнч(ИмяПланаОбмена));
		Если МетаОбъект <> Неопределено Тогда
			мИмяПланаОбмена = МетаОбъект.Имя;			
		КонецЕсли;	
	КонецЕсли;
	
	Результат = "";
	Если мИмяПланаОбмена = "ДанныеЧЗ" Тогда
		Результат = "ОбменДаннымиЧЗ";
	Иначе
		Результат = "ОбменДанными_" + мИмяПланаОбмена;	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ИмяЛогаОбмена(ИмяПланаОбмена)

Функция СоздатьТаблицуИменЗапросов() Экспорт
	ТипБулево = Маркировка_ПИ.ПолучитьОТ_Булево();
	
	ТЗ = Новый ТаблицаЗначений; 
	
	ТЗ.Колонки.Добавить("Имя");
	ТЗ.Колонки.Добавить("ТекстЗапроса");
	ТЗ.Колонки.Добавить("Выгружать",	ТипБулево);
	ТЗ.Колонки.Добавить("Главная", 		ТипБулево);
	
	Возврат ТЗ;
КонецФункции //СоздатьТаблицуИмен()

Функция ДобавитьИмяТаблицы(ИменаТаблиц, Имя, ТекстЗапроса, Выгружать =  Истина, Главная = Ложь) Экспорт
	СтрокаТ 	= ИменаТаблиц.Добавить();
	
	СтрокаТ.Имя 			= Имя;
	СтрокаТ.ТекстЗапроса	= ТекстЗапроса;
	СтрокаТ.Выгружать 		= Выгружать;
	СтрокаТ.Главная 		= (Выгружать И Главная);
	
КонецФункции //ДобавитьИмяТаблицы(ИменаТаблиц, Имя, ТекстЗапроса, Выгружать =  Истина)

Функция СоздатьПакетыВыгрузки(УзелПолучатель, ДопПараметры = Неопределено) Экспорт	
	ИмяПланаОбмена	= УзелПолучатель.Метаданные().Имя;
	ИмяЛога			= ИмяЛогаОбмена(ИмяПланаОбмена);
	
	ЭтоНовыйУзелСвертки = (ИмяПланаОбмена = "Свертка") И (Маркировка_ПИ.ЭтоНовыйУзелСвертки());
	
	ИмяТаблицы = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ИмяТаблицы");
	ВыбИмяТаблицы	= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ИмяТаблицы");	
	
	ОчиститьРегистрациюЛогов(ИмяЛогаОбмена(ИмяПланаОбмена), УзелПолучатель);
	
	Для Каждого ЭлементСостава Из УзелПолучатель.Метаданные().Состав Цикл
		МетаОбъект = ЭлементСостава.Метаданные;
		
		Если ЗначениеЗаполнено(ВыбИмяТаблицы) И МетаОбъект.ПолноеИмя() <> ВыбИмяТаблицы Тогда Продолжить КонецЕсли;
		Если МетаОбъект = Метаданные.Справочники.ФР_ПакетыДанных Тогда Продолжить КонецЕсли;
		Если Метаданные.РегистрыСведений.Содержит(МетаОбъект) И МетаОбъект.Измерения.Количество() = 0 Тогда Продолжить КонецЕсли; 
		Если Метаданные.Константы.Содержит(МетаОбъект) Тогда Продолжить КонецЕсли;
		
		Если ЭтоНовыйУзелСвертки Тогда
			Если МетаОбъект <> Метаданные.РегистрыСведений.СостояниеПакетовОбмена Тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелПолучатель, МетаОбъект);
				Продолжить;
			КонецЕсли;		
		КонецЕсли;
		
		ПравилоВыгрузки = ПолучитьПравилоВыгрузкиПоОбъекту(МетаОбъект);				
		
		Если ЗначениеЗаполнено(ПравилоВыгрузки) Тогда
			СформироватьПакетыПоПравилу(ПравилоВыгрузки, УзелПолучатель);		
		Иначе	
			ТекстСообщения = СтрШаблон("Невозможно определить правило для объекта: '%1' !", МетаОбъект.ПолноеИмя());
			ЗаписатьВЛог(ИмяЛога, ТекстСообщения, "Ошибка"); 
		КонецЕсли;		
	КонецЦикла;
	
	ОчиститьРегистрациюЛогов(ИмяЛогаОбмена(ИмяПланаОбмена), УзелПолучатель);
КонецФункции

Функция ПолучитьМенеджер(МетаОбъект)
	Менеджер = Неопределено;
	Если Метаданные.Справочники.Содержит(МетаОбъект) Тогда		
		Менеджер = Справочники[МетаОбъект.Имя];		
	ИначеЕсли Метаданные.Документы.Содержит(МетаОбъект) Тогда		
		Менеджер = Документы[МетаОбъект.Имя];		
	ИначеЕсли Метаданные.РегистрыСведений.Содержит(МетаОбъект) Тогда		
		Менеджер = РегистрыСведений[МетаОбъект.Имя];
	КонецЕсли;
	
	Возврат Менеджер;
КонецФункции //ПолучитьМенеджер(МетаОбъект)

Функция ПолучитьПравилоВыгрузкиПоОбъекту(МетаОбъект)
	ПравилоВыгрузки = Неопределено;
	
	Менеджер 	= ПолучитьМенеджер(МетаОбъект);	
	
	Если Менеджер <> Неопределено Тогда
		Попытка
			ПравилоВыгрузки = Менеджер.ПолучитьПравилоВыгрузки();
		Исключение            
			ИмяТаблицы = МетаОбъект.ПолноеИмя();
			Если Метаданные.Справочники.Содержит(МетаОбъект) Тогда
				ПравилоВыгрузки = ПравилоВыгрузкиПоУмолчанию_Справочник(ИмяТаблицы);					
			ИначеЕсли Метаданные.Документы.Содержит(МетаОбъект) Тогда
				ПравилоВыгрузки = ПравилоВыгрузкиПоУмолчанию_Документ(ИмяТаблицы)
			ИначеЕсли Метаданные.РегистрыСведений.Содержит(МетаОбъект) Тогда
				ПравилоВыгрузки = ПравилоВыгрузкиПоУмолчанию_РегистрСведений(ИмяТаблицы)
			КонецЕсли;				
		КонецПопытки;
	КонецЕсли;
	
	Возврат ПравилоВыгрузки;
КонецФункции //ПолучитьПравилоВыгрузки(ИмяТаблицы, Менеджер = Неопределено)

Функция ВыгрузитьПакетыВКаталог(УзелКорреспондент) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	рПроверки = ПроверитьКаталогВыгрузки(УзелКорреспондент);
	
	Если рПроверки.Успешно Тогда
		ИмяЛога 	= ИмяЛогаОбмена(УзелКорреспондент.Метаданные().Имя);
		Пакеты		= Справочники.ФР_ПакетыДанных.ПакетыКВыгрузке(УзелКорреспондент);
		рВыгрузки	= Справочники.ФР_ПакетыДанных.ЗаписатьПакетыВКаталог(Пакеты, рПроверки.Данные);
		
		Если рВыгрузки.Успешно Тогда			
			Если рВыгрузки.ОбработаноОбъектов % 10 = 1 Тогда
				ТекстСообщения = "Выгружен " + ПолучитьСклоненияСтрокиПоЧислу("", рВыгрузки.ОбработаноОбъектов, "пакет данных")[0];
			Иначе
				ТекстСообщения = "Выгружено " + ПолучитьСклоненияСтрокиПоЧислу("", рВыгрузки.ОбработаноОбъектов, "пакет данных")[0];
			КонецЕсли; 
			ТекстСообщения = ТекстСообщения + СтрШаблон(" для узла: '%1'.", УзелКорреспондент);
			ЗаписатьВЛог(ИмяЛога, ТекстСообщения, "Информация");
			
			Результат.Сообщения.Добавить(ТекстСообщения);
		Иначе
			МаркировкаКС.ДобавитьОшибки(Результат, рПроверки);			
		КонецЕсли;
	Иначе
		МаркировкаКС.ДобавитьОшибки(Результат, рПроверки);		
		ЗаписатьВЛог(ИмяЛога, "Ошибка выгрузки пакетов. " + СтрСоединить(рПроверки.Ошибки, Символы.ПС), "Ошибка");
	КонецЕсли;	
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;
КонецФункции //ВыгрузитьПакетыВКаталог(УзелКорреспондент)

Функция ОчиститьРегистрациюЛогов(ИмяЛога, УзелПолучатель)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ 
	|	Дата,НомерЗаписи,ИмяЛога,День
	|ИЗ
	|	РегистрСведений.Логи.Изменения
	|ГДЕ
	|	ИмяЛога = &ИмяЛога
	|	И Узел = &УзелПолучатель
	|";	
	
	Запрос.УстановитьПараметр("ИмяЛога", 		ИмяЛога);
	Запрос.УстановитьПараметр("УзелПолучатель", УзелПолучатель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НЗ = РегистрыСведений.Логи.СоздатьНаборЗаписей();
		
		НЗ.Отбор.Дата.Установить(Выборка.Дата); 
		НЗ.Отбор.НомерЗаписи.Установить(Выборка.НомерЗаписи); 
		НЗ.Отбор.ИмяЛога.Установить(Выборка.ИмяЛога); 
		НЗ.Отбор.День.Установить(Выборка.День); 
		
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелПолучатель, НЗ);		
	КонецЦикла;
КонецФункции //ОчиститьРегистрациюЛогов(ИмяЛога, УзелПолучатель)

Функция ПроверитьКаталогВыгрузки(Узел)
	Результат 		= МаркировкаКС.СтруктураРезультата(Ложь);
	
	КаталогВыгрузки = ПолучитьРеквизитШапки(Узел, "АдресОбмена");
	Если ЗначениеЗаполнено(КаталогВыгрузки) Тогда
		КаталогВыгрузки = МаркировкаС.ИмяКаталогаСРазделителем(КаталогВыгрузки);
		Файл = Новый Файл(КаталогВыгрузки);	
		Если Файл.Существует() Тогда
			Если Файл.ЭтоКаталог() Тогда
				Результат.Успешно = Истина;
				Результат.Данные = КаталогВыгрузки;			
			Иначе                                  
				ТекстОшибки = СтрШаблон("Указанный путь не явялется каталогом ! Узел: '%1', каталог: '%2'.", Узел, КаталогВыгрузки);
				Результат.Ошибки.Добавить(ТекстОшибки);				
			КонецЕсли;			
		Иначе                                                                     
			ТекстОшибки = СтрШаблон("Указанный каталог выгрузки не существует ! Узел: '%1', каталог: '%2'.", Узел, КаталогВыгрузки);
			Результат.Ошибки.Добавить(ТекстОшибки);			
		КонецЕсли;
	Иначе
		Результат.Ошибки.Добавить("Не указан каталог обмена для узда: "+Узел);
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции //ПроверитьКаталогВыгрузки(Узел)

Функция СформироватьПакетыПоПравилу(ПравилоВыгрузки, УзелПолучатель) Экспорт
	РазмерПорции	= МаркировкаКС.ПолучитьЗначениеПараметра(ПравилоВыгрузки, "РазмерПорции", 1000);
	
	МассивСсылок			= Новый Массив;
	ОтборТаблицыРегистрации	= Новый Массив;
	
	ИмяЛога 				= ИмяЛогаОбмена(УзелПолучатель);
	
	ЗапросСсылок	= ОбменДаннымиЧЗ.СоздатьЗапросСсылок(ПравилоВыгрузки, УзелПолучатель);
	
	Попытка
		рЗапросаСсылок	= ЗапросСсылок.Выполнить();
	Исключение           
		ТекстОшибки = ПравилоВыгрузки.ИмяТаблицыИст + " " + ОписаниеОшибки() + " " + ЗапросСсылок.Текст;
		ЗаписатьВЛог(ИмяЛога, ТекстОшибки, "Ошибка");             
		ВызватьИсключение ОписаниеОшибки();	
	КонецПопытки;
	ЕстьКолЗаписей	= (рЗапросаСсылок.Колонки.Найти("КолЗаписей") <> Неопределено);
	Выборка 		= рЗапросаСсылок.Выбрать();
	
	ОперИмпорта		= МаркировкаКС.ПолучитьЗначениеПараметра(ПравилоВыгрузки, "ОперИмпорта", "");
	ИмяТаблицыИст	= МаркировкаКС.ПолучитьЗначениеПараметра(ПравилоВыгрузки, "ИмяТаблицыИст", "");	
	ПоляОтбора 		= МаркировкаКС.ПолучитьЗначениеПараметра(ПравилоВыгрузки, "ПоляОтбора");
	
	МетаОбъект	= Метаданные.НайтиПоПолномуИмени(ИмяТаблицыИст);
	ПланОбмена	= УзелПолучатель.Метаданные().Имя;
	КодТекУзла	= Маркировка_ПИ.ЭтотУзел_Код(ПланОбмена);
	
	ЭтоРегистр 		= СтрНачинаетсяС(ИмяТаблицыИст, "Регистр");
	Если ЭтоРегистр Тогда
		Менеджер	= Маркировка_ПИ.ПолучитьМенеджер(ИмяТаблицыИст);
	КонецЕсли;
	
	ЭтоНезависимыйРС = ОбщегоНазначения_ПИ.ЭтоНезависимыйРС(ИмяТаблицыИст);
	
	ТаблицаИзмерений = Новый ТаблицаЗначений;
	Если ЭтоНезависимыйРС Тогда
		Для каждого ПолеОтбора Из ПоляОтбора Цикл
			ТаблицаИзмерений.Колонки.Добавить(ПолеОтбора, МетаОбъект.Измерения[ПолеОтбора].Тип);		
		КонецЦикла;			
	КонецЕсли;
	
	ВсегоСтрокДанных = 0;	
	Если ЕстьКолЗаписей Тогда
		Пока Выборка.Следующий() Цикл
			ВсегоСтрокДанных = ВсегоСтрокДанных + Выборка.КолЗаписей;
		КонецЦикла;
		Выборка.Сбросить();	
		Если РазмерПорции < 50000 Тогда
			РазмерПорции = 50000;		
		КонецЕсли;
	КонецЕсли;
	
	ОбработаноСтрокВыборки 	= 0;
	ОбработаноСтрокДанных 	= 0;	
	ТекРазмерПорцииДанных	= 0;
	
	СтрокВПакете 		= 0;
	ВсегоСтрокВВыборке 	= Выборка.Количество();	
	//+++Чирков 13.07.2026 0000003319
	ДатаПорядка 		= ТекущаяДата();
	//---Чирков 13.07.2026
	
	Пока Выборка.Следующий() Цикл
		Если ЭтоРегистр Тогда
			НЗ = Менеджер.СоздатьНаборЗаписей();
			Если ЭтоНезависимыйРС Тогда				
				Для каждого ПолеОтбора Из ПоляОтбора Цикл				
					НЗ.Отбор[ПолеОтбора].Установить(Выборка[ПолеОтбора]);
				КонецЦикла;				
				
				СтрокаТИ = ТаблицаИзмерений.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТИ, Выборка);
			Иначе
				НЗ.Отбор.Регистратор.Установить(Выборка.Ссылка);
				МассивСсылок.Добавить(Выборка.Ссылка);
			КонецЕсли;
			ОтборТаблицыРегистрации.Добавить(НЗ);
		Иначе
			ОтборТаблицыРегистрации.Добавить(Выборка.Ссылка);
			МассивСсылок.Добавить(Выборка.Ссылка);
		КонецЕсли;		
		
		ТекКол = ?(ЕстьКолЗаписей, Выборка.КолЗаписей, 0);
		
		ОбработаноСтрокВыборки	= ОбработаноСтрокВыборки	+ 1;
		ТекРазмерПорцииДанных	= ТекРазмерПорцииДанных 	+ ТекКол;		
		СтрокВПакете 			= СтрокВПакете	  +	1;
		
		Если СтрокВПакете >= 5000 ИЛИ ТекРазмерПорцииДанных >= РазмерПорции ИЛИ (ОбработаноСтрокВыборки >= ВсегоСтрокВВыборке И ВсегоСтрокВВыборке > 0) Тогда
			Если МетаОбъект = Метаданные.РегистрыСведений.СостояниеПакетовОбмена Тогда
				СсылкаНовогоПакета = Справочники.ФР_ПакетыДанных.ПолучитьСсылку(Новый УникальныйИдентификатор);							
				
				СтрокаТИ = ТаблицаИзмерений.Добавить();
				СтрокаТИ.Пакет		= СсылкаНовогоПакета;
				
				РегистрыСведений.СостояниеПакетовОбмена.ОбновитьСтатусПакета(СсылкаНовогоПакета, Новый Структура("ДатаСоздания", ТекущаяДата()), ПланОбмена);
				
				НЗ = Менеджер.СоздатьНаборЗаписей();
				НЗ.Отбор.Пакет.Установить(СсылкаНовогоПакета);
				
				ОтборТаблицыРегистрации.Добавить(НЗ);
			Иначе
				СсылкаНовогоПакета = Неопределено;
			КонецЕсли;
			
			ЗаписьXML = Новый ЗаписьXML;
			ЗаписьXML.УстановитьСтроку();
			ЗаписьXML.ЗаписатьОбъявлениеXML();	
			
			ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
			ЗаписьСообщения.НачатьЗапись(ЗаписьXML, УзелПолучатель);
			
			НомерСообщения 		= ЗаписьСообщения.НомерСообщения;			
			
			ВыборкаИзменений	= ПланыОбмена.ВыбратьИзменения(УзелПолучатель, НомерСообщения, ОтборТаблицыРегистрации);
			
			ЗаписьСообщения.ЗакончитьЗапись();                            
			
			СтрокВПакете = 0;
			//+++Чирков 13.07.2026 0000003319
			//рСоздания = СоздатьПакетДанных(ПравилоВыгрузки, ?(ОбщегоНазначения_ПИ.ЭтоНезависимыйРС(ИмяТаблицыИст), ТаблицаИзмерений, МассивСсылок), УзелПолучатель, НомерСообщения);
			рСоздания = СоздатьПакетДанных(ПравилоВыгрузки, ?(ОбщегоНазначения_ПИ.ЭтоНезависимыйРС(ИмяТаблицыИст), ТаблицаИзмерений, МассивСсылок), УзелПолучатель, НомерСообщения, , ДатаПорядка);
			//---Чирков 13.07.2026
			Если рСоздания.Успешно Тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелПолучатель, НомерСообщения);			
				
				Если МетаОбъект <> Метаданные.РегистрыСведений.СостояниеПакетовОбмена Тогда
					РегистрыСведений.СостояниеПакетовОбмена.ОбновитьСтатусПакета(рСоздания.Данные, Новый Структура("ДатаСоздания", ТекущаяДата()));
				КонецЕсли;
			Иначе
				//Если не удалось создать пакет - нужно перегистрировать изменения - иначе следующий пакет с большим номером сообщения - очищшает регистрацию
				Попытка
					ПланыОбмена.ЗарегистрироватьИзменения(УзелПолучатель, ОтборТаблицыРегистрации);
				Исключение
					ТекстСообщения = СтрШаблон("Ошибка повторной регистрации данных пакета ! ОперИмпорта: '%1', таблица: '%2', получатель: '%3', строк в пакете: %4.",
						ОперИмпорта, ИмяТаблицыИст, УзелПолучатель, СтрокВПакете);
					ЗаписатьВЛог(ИмяЛога, ТекстСообщения, "Ошибка");					
				КонецПопытки;
				Если МетаОбъект <> Метаданные.РегистрыСведений.СостояниеПакетовОбмена Тогда
					Запись = РегистрыСведений.СостояниеПакетовОбмена.СоздатьМенеджерЗаписи();
					
					Запись.Пакет 	= СсылкаНовогоПакета;
					Запись.КодУзла	= КодТекУзла;
					
					Запись.Удалить();
				КонецЕсли;
			КонецЕсли;
			
			МассивСсылок.Очистить();
			ТаблицаИзмерений.Очистить();
			ОтборТаблицыРегистрации.Очистить();
			ТекРазмерПорцииДанных = 0;			
		КонецЕсли;		
	КонецЦикла;	

КонецФункции //СформироватьПакетыПоПравилу(ПравилоВыгрузки)

Функция ЗарегистрированоЗаписей()
	Результат = 0;
    Запрос = Новый Запрос("ВЫБРАТЬ	КОЛИЧЕСТВО(*) КАК КолЗаписей ИЗ	Справочник.ПодарочныеСертификаты.Изменения");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.КолЗаписей) Тогда
		Результат = Выборка.КолЗаписей;
	КонецЕсли;                         
	Возврат Результат;
КонецФункции //ЗарегистрированоЗаписей

Функция СоздатьЗапросСсылок(ОперВыгрузки, УзелПолучатель) Экспорт
	Запрос = Новый Запрос(ОперВыгрузки.ТекстЗапросаИзменений);
	
	Запрос.УстановитьПараметр("УзелПолучатель", 	УзелПолучатель);	
	Запрос.УстановитьПараметр("ТекущаяДата",		ТекущаяДата());
	
	Если Метаданные.НайтиПоТипу(ТипЗнч(УзелПолучатель)).Реквизиты.Найти("ТипУзла") <> Неопределено Тогда
		ТипУзлаПолучателя = ПолучитьРеквизитШапки(УзелПолучатель, "ТипУзла");
	Иначе                                                                   
		ТипУзлаПолучателя = Неопределено;		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТипУзлаПолучателя",	ТипУзлаПолучателя);
	
	Возврат Запрос;
КонецФункции //СоздатьЗапросСсылок(ОперВыгрузки, УзелПолучатель)

//+++Чирков 13.07.2026 0000003319
//Функция СоздатьПакетДанных(ПравилоВыгрузки, МассивСсылок, УзелПолучатель, НомерСообщения = 0, СсылкаНовогоПакета = Неопределено)
Функция СоздатьПакетДанных(ПравилоВыгрузки, МассивСсылок, УзелПолучатель, НомерСообщения = 0, СсылкаНовогоПакета = Неопределено, ДатаПорядка = Неопределено)
//---Чирков 13.07.2026
	Результат 	= МаркировкаКС.СтруктураРезультата();
	
	Начало 		= ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ИмяЛога 	= ИмяЛогаОбмена(УзелПолучатель);
	
	ОперВыгрузки = ПравилоВыгрузки.ОперИмпорта;
	
	ИмяТаблицыИст	= МаркировкаКС.ПолучитьЗначениеПараметра(ОперВыгрузки, "ИмяТаблицыИст", ОперВыгрузки);
	МетаОбъект 		= Метаданные.НайтиПоПолномуИмени(ИмяТаблицыИст);
	
	ЗапросыИст	= ПравилоВыгрузки.ЗапросыИст;
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрСоединить(ЗапросыИст.ВыгрузитьКолонку("ТекстЗапроса"), Символы.ПС+";"+Символы.ПС);	
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Если Метаданные.РегистрыСведений.Содержит(МетаОбъект) Тогда
		Если ОбщегоНазначения_ПИ.ЭтоНезависимыйРС(МетаОбъект.ПолноеИмя()) Тогда
		Иначе
			Запрос.УстановитьПараметр("Регистраторы", СоздатьТаблицуРегистраторов(МассивСсылок, МетаОбъект));			
		КонецЕсли;	
	КонецЕсли;	
		
	Попытка
		рЗапроса = Запрос.ВыполнитьПакет();
	Исключение                        
		ТекстСообщения = СтрШаблон("Ошибка получения данных пакета ! Таблица источник: '%1', ошибка: '%2' !", ИмяТаблицыИст, ОписаниеОшибки());
		
		Результат.Ошибки.Добавить(ТекстСообщения);
		Результат.Успешно = Ложь;
		
		ЗаписатьВЛог(ИмяЛога, ТекстСообщения, "Ошибка");
		
		Возврат Результат;
	КонецПопытки;
	
	СпрОбъект = Справочники.ФР_ПакетыДанных.СоздатьЭлемент();	
	Если СсылкаНовогоПакета <> Неопределено Тогда
		СпрОбъект.УстановитьСсылкуНового(СсылкаНовогоПакета);	
		СпрОбъект.ИД_Пакета = СсылкаНовогоПакета.УникальныйИдентификатор();
	КонецЕсли;
	
	КоличествоОбъектовВПакете = 0;
	Таблицы = Новый Соответствие;
	Для Каждого СтрокаТ Из ЗапросыИст Цикл
		Если СтрокаТ.Выгружать Тогда
			ТЗ = рЗапроса[ЗапросыИст.Индекс(СтрокаТ)].Выгрузить();							
			Таблицы.Вставить(СтрокаТ.Имя, ТЗ);
			
			ЕстьКолонка_Регистратор = (ТЗ.Колонки.Найти("Регистратор") <> Неопределено);
			
			Если СтрокаТ.Имя = "Шапка" Тогда
				КоличествоОбъектовВПакете = ТЗ.Количество();
				ЕстьКолОснование = (ТЗ.Колонки.Найти("Основание") <> Неопределено);
				Для Каждого СтрокаИст Из ТЗ Цикл									
					СтрокаД = СпрОбъект.ОбъектыПакета.Добавить();
					
					СтрокаД.Основание	= ?(ЕстьКолОснование, СтрокаИст.Основание, СтрокаИст.Ссылка);
					СтрокаД.Количество	= 1;
				КонецЦикла;                                       
			ИначеЕсли СтрНачинаетсяС(СтрокаТ.Имя, "Регистраторы_") Тогда
				Для Каждого СтрокаИст Из ТЗ Цикл				
					СтрокаД = СпрОбъект.ОбъектыПакета.Добавить();				
					СтрокаД.Основание	= СтрокаИст.Регистратор;
				КонецЦикла;				
			ИначеЕсли СтрНачинаетсяС(СтрокаТ.Имя, "Записи_") Тогда				
				КоличествоОбъектовВПакете = КоличествоОбъектовВПакете + ТЗ.Количество();
				Если ЕстьКолонка_Регистратор Тогда
					Для Каждого СтрокаИст Из ТЗ Цикл
						СтрокаД = СпрОбъект.ОбъектыПакета.Добавить();
						
						СтрокаД.Основание	= СтрокаИст.Регистратор;						
						СтрокаД.Количество	= 1;
					КонецЦикла;									
				КонецЕсли;
			ИначеЕсли СтрНачинаетсяС(СтрокаТ.Имя, "УдаленныеЗаписи_") Тогда			
				КоличествоОбъектовВПакете = КоличествоОбъектовВПакете + ТЗ.Количество();
				Если ЕстьКолонка_Регистратор Тогда
					Для Каждого СтрокаИст Из ТЗ Цикл
						СтрокаД = СпрОбъект.ОбъектыПакета.Добавить();
						
						СтрокаД.Основание	= СтрокаИст.Регистратор;						
						СтрокаД.Количество	= 1;
					КонецЦикла;									
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	СпрОбъект.ОбъектыПакета.Свернуть("Основание", "Количество");	
	Для каждого СтрокаО Из СпрОбъект.ОбъектыПакета Цикл		
		СтрокаО.ОперВыгрузки  = ОперВыгрузки;
	КонецЦикла;	
	
	Если КоличествоОбъектовВПакете = 0 Тогда
		КоличествоОбъектовВПакете = МассивСсылок.Количество();	
	КонецЕсли; 
	
	ДанныеПакета = Новый Соответствие;
	ДанныеПакета.Вставить("ОперВыгрузки", 	ОперВыгрузки);
	ДанныеПакета.Вставить("Таблицы", 		Таблицы);
	
	ПланОбмена = УзелПолучатель.Метаданные().Имя;
	
	СтрокаДанных = СериализоватьВJSON(ДанныеПакета);	
	
	СпрОбъект.ПланОбмена		= ПланОбмена;
	СпрОбъект.Отправитель  		= Маркировка_ПИ.ЭтотУзел_Код(ПланОбмена);
	СпрОбъект.Получатель   		= ПолучитьРеквизитШапки(УзелПолучатель, "Код");	
	СпрОбъект.НомерСообщения 	= НомерСообщения;
	
	СпрОбъект.ПравилоВыгрузки   = ОперВыгрузки;
	СпрОбъект.ДанныеПакета 		= Новый ХранилищеЗначения(СтрокаДанных, Новый СжатиеДанных(9));
	
	СпрОбъект.КоличествоОбъектовВПакете = КоличествоОбъектовВПакете;
	СпрОбъект.РазмерСообщения	= СтрДлина(СтрокаДанных);
	СпрОбъект.РазмерПакета		= СтрДлина(XMLСтрока(СпрОбъект.ДанныеПакета));
	
	СпрОбъект.ДатаСоздания		= ТекущаяДата();
	СпрОбъект.ВремяФормирования	= (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000;	
	//+++Чирков 13.07.2026 0000003319
	СпрОбъект.ДатаПорядка		= ДатаПорядка;
	//---Чирков 13.07.2026
	
	Попытка
		СпрОбъект.Записать();
		Результат.Данные = СпрОбъект.Ссылка;
	Исключение
		Результат.Успешно = Ложь;
		Результат.Ошибки.Добавить(ОписаниеОшибки());
	КонецПопытки;	
	
	Возврат Результат;
КонецФункции //СоздатьПакетДанных(ПравилоВыгрузки, МассивСсылок, УзелПолучатель, НомерСообщения = 0, СсылкаНовогоПакета = Неопределено)

Функция СоздатьТаблицуРегистраторов(МассивСсылок, МетаОбъект)
	ТипРегистратора = МетаОбъект.СтандартныеРеквизиты.Регистратор.Тип;
	
	тРегистраторы = Новый ТаблицаЗначений;
	тРегистраторы.Колонки.Добавить("Регистратор", ТипРегистратора);
	Для каждого Ссылка Из МассивСсылок Цикл
		ТекЗнач = ТипРегистратора.ПривестиЗначение(Ссылка);	
		Если ТекЗнач <> Неопределено Тогда
			СтрокаР = тРегистраторы.Добавить();		
			СтрокаР.Регистратор = ТекЗнач;		
		КонецЕсли;
	КонецЦикла;
	
	Возврат тРегистраторы;
КонецФункции //СоздатьТаблицуРегистраторов(МассивСсылок, МетаОбъект)

Функция ПравилоВыгрузкиПоУмолчанию_Справочник(ИмяТаблицы)
	
	МетаОбъект = Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);	
	
	ОперИмпорта					= ИмяТаблицы;
	ОперИмпорта_Представление   = "" + МетаОбъект;
	
	ИмяТаблицы_Тек	= ИмяТаблицы;	
	ИмяТаблицы_Ист	= ИмяТаблицы;
	
	ЗапросыИст = ОбменДаннымиЧЗ.СоздатьТаблицуИменЗапросов();	
	
	#Область ВТ_Ссылки
	
	ТекстЗапросаИзменений = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка
	|ИЗ	
	|	" + ИмяТаблицы_Ист + ".Изменения
	|ГДЕ
	|	Узел = &УзелПолучатель	
	|";			
	
	ТекстЗапроса = "
	|ВЫБРАТЬ 
	|	Ссылка	
	|ПОМЕСТИТЬ ВТ_Ссылки
	|ИЗ	
	|	" + ИмяТаблицы_Ист + "
	|ГДЕ
	|	Ссылка В (&МассивСсылок)
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка	
	|";	
	
	ОбменДаннымиЧЗ.ДобавитьИмяТаблицы(ЗапросыИст, "ВТ_Ссылки", ТекстЗапроса, Ложь);
	
	#КонецОбласти
	
	#Область Шапка
	
	Поля = Новый Массив;
	Поля.Добавить("Шапка.Ссылка");
	Поля.Добавить("Шапка.ПометкаУдаления");
	
	Если МетаОбъект.ДлинаКода > 0 Тогда    
		Поля.Добавить("Шапка.Код");			
	КонецЕсли;
	Если МетаОбъект.ДлинаНаименования > 0 Тогда    
		Поля.Добавить("Шапка.Наименование");
	КонецЕсли;
	Если МетаОбъект.Иерархический Тогда    
		Поля.Добавить("Шапка.Родитель");
		Если МетаОбъект.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда
			Поля.Добавить("Шапка.ЭтоГруппа");					
		КонецЕсли;
	КонецЕсли;
	//+++Чирков 22.12.2025 - заполнение владельца при загрузки из старой базы
	Если МетаОбъект.Владельцы.Количество() > 0 Тогда
		Поля.Добавить("Шапка.Владелец");
	КонецЕсли;
	//---Чирков 22.12.2025 - заполнение владельца при загрузки из старой базы	
	Для Каждого МетаРекв Из МетаОбъект.Реквизиты Цикл
		Поля.Добавить("Шапка." + МетаРекв.Имя);			
	КонецЦикла; 
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	" + СтрСоединить(Поля, ",") + "
    |ИЗ	
	|	" + ИмяТаблицы_Ист + " КАК Шапка
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	ВТ_Ссылки ПО ВТ_Ссылки.Ссылка = Шапка.Ссылка
	|";	                                      
	ОбменДаннымиЧЗ.ДобавитьИмяТаблицы(ЗапросыИст, "Шапка", ТекстЗапроса, Истина, Ложь);	
	
	#КонецОбласти
	
	#Область ТЧ
	
	Для Каждого МетаТЧ Из МетаОбъект.ТабличныеЧасти Цикл
		ТекстЗапроса = ПолучитьТекстЗапросаДанныхТЧ(МетаТЧ);	
    	ОбменДаннымиЧЗ.ДобавитьИмяТаблицы(ЗапросыИст, "ТЧ_" + МетаТЧ.Имя, ТекстЗапроса, Истина, Истина);
	КонецЦикла;
	
	#КонецОбласти

	Возврат Новый Структура("РазмерПорции,ТекстЗапросаИзменений,ЗапросыИст,ОперИмпорта,ОперИмпорта_Представление", 5000, ТекстЗапросаИзменений, ЗапросыИст, ОперИмпорта, ОперИмпорта_Представление);
КонецФункции //ПравилоВыгрузкиПоУмолчанию_Справочник(ИмяТаблицы)

Функция ПравилоВыгрузкиПоУмолчанию_Документ(ИмяТаблицы) Экспорт
	
	МетаОбъект = Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
	
	ОперИмпорта					= ИмяТаблицы;
	ОперИмпорта_Представление   = "" + МетаОбъект;
	
	ИмяТаблицы_Тек	= ИмяТаблицы;	
	ИмяТаблицы_Ист	= ИмяТаблицы;
	
	ЗапросыИст = ОбменДаннымиЧЗ.СоздатьТаблицуИменЗапросов();	
	
	#Область ВТ_Ссылки
	
	ТекстЗапросаИзменений = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка
	|ИЗ	
	|	" + ИмяТаблицы_Ист + ".Изменения
	|ГДЕ
	|	Узел = &УзелПолучатель	
	|";			
	
	ТекстЗапроса = "
	|ВЫБРАТЬ 
	|	Ссылка	
	|ПОМЕСТИТЬ ВТ_Ссылки
	|ИЗ	
	|	" + ИмяТаблицы_Ист + "
	|ГДЕ
	|	Ссылка В (&МассивСсылок)
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|";	
	
	ОбменДаннымиЧЗ.ДобавитьИмяТаблицы(ЗапросыИст, "ВТ_Ссылки", ТекстЗапроса, Ложь);
	
	#КонецОбласти
	
	#Область Шапка
	
	ПоляСортировки = Новый Массив;
	ПоляСортировки.Добавить("Шапка.Дата");
	
	Поля = Новый Массив;
	
	Поля.Добавить("Шапка.Ссылка");
	Поля.Добавить("Шапка.Дата");
	Поля.Добавить("Шапка.ПометкаУдаления");
	
	Если МетаОбъект.ДлинаНомера>0 Тогда
		Поля.Добавить("Шапка.Номер");	
		ПоляСортировки.Добавить("Шапка.Номер");
	КонецЕсли;
	
	Если МетаОбъект.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить Тогда
		Поля.Добавить("Шапка.Проведен");
	КонецЕсли;	
	
	Для Каждого МетаРекв Из Метаданные.ОбщиеРеквизиты Цикл
		Если МетаРекв.Состав.Содержит(МетаОбъект) Тогда		
			Поля.Добавить("Шапка." + МетаРекв.Имя);		
		КонецЕсли;
	КонецЦикла; 
	Для Каждого МетаРекв Из МетаОбъект.Реквизиты Цикл
		Поля.Добавить("Шапка." + МетаРекв.Имя);			
	КонецЦикла; 
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	" + СтрСоединить(Поля, ",") + "
    |ИЗ	
	|	" + ИмяТаблицы_Ист + " КАК Шапка
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	ВТ_Ссылки ПО ВТ_Ссылки.Ссылка = Шапка.Ссылка
	|УПОРЯДОЧИТЬ ПО 
	|	" + СтрСоединить(ПоляСортировки, ",") + "
	|";	                                      
	ОбменДаннымиЧЗ.ДобавитьИмяТаблицы(ЗапросыИст, "Шапка", ТекстЗапроса, Истина, Ложь);	
	
	#КонецОбласти
	
	#Область ТЧ
	
	Для Каждого МетаТЧ Из МетаОбъект.ТабличныеЧасти Цикл		
		ТекстЗапроса = ПолучитьТекстЗапросаДанныхТЧ(МетаТЧ);
    	ОбменДаннымиЧЗ.ДобавитьИмяТаблицы(ЗапросыИст, "ТЧ_" + МетаТЧ.Имя, ТекстЗапроса, Истина, Истина);
	КонецЦикла;
	
	#КонецОбласти

	Возврат Новый Структура("РазмерПорции,ТекстЗапросаИзменений,ЗапросыИст,ОперИмпорта,ОперИмпорта_Представление", 5000, ТекстЗапросаИзменений, ЗапросыИст, ОперИмпорта, ОперИмпорта_Представление);
КонецФункции //ПравилоВыгрузкиПоУмолчанию_Справочник(ИмяТаблицы)

Функция ПравилоВыгрузкиПоУмолчанию_РегистрСведений(ИмяТаблицы)
	МетаОбъект = Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
	
	Если ОбщегоНазначения_ПИ.ЭтоНезависимыйРС(ИмяТаблицы)Тогда
		Возврат ПолучитьПравилоВыгрузки_РС_Независимый(ИмяТаблицы, "" + МетаОбъект);
	Иначе
		Возврат ПолучитьПравилоВыгрузки_РС_ПоРегистратору(ИмяТаблицы, "" + МетаОбъект);	
	КонецЕсли;
	
КонецФункции //ПравилоВыгрузкиПоУмолчанию_РегистрСведений(ИмяТаблицы)

Функция ПолучитьТекстЗапросаДанныхТЧ(МетаТЧ)
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТЧ.*
	|ИЗ
	|	" + МетаТЧ.Родитель().ПолноеИмя() + "." + МетаТЧ.Имя + " КАК ТЧ
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ВТ_Ссылки ПО ВТ_Ссылки.Ссылка = ТЧ.Ссылка
	|";
	
	Возврат ТекстЗапроса;
КонецФункции //ПолучитьТекстЗапросаДанныхТЧ(МетаТЧ)

Функция ПолучитьВсеИзмерения(МетаРС) Экспорт
	Результат = Новый Массив;
		
	Для каждого МетаРеквизит Из МетаРС.Измерения Цикл
		Если МетаРеквизит.ОсновнойОтбор Тогда
			Результат.Добавить(МетаРеквизит.Имя);		
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции //ПолучитьВсеИзмерения(МетаРС)

Функция ПолучитьВедущиеИзмерения(МетаРС) Экспорт
	Результат = Новый Массив;
		
	Для каждого МетаРеквизит Из МетаРС.Измерения Цикл
		Если МетаРеквизит.Ведущее Тогда
			Результат.Добавить(МетаРеквизит.Имя);		
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Результат;
КонецФункции //ПолучитьВедущиеИзмерения(МетаРС)

Функция ПолучитьПравилоВыгрузки_РС_Независимый(ОперИмпорта, Знач ОперИмпорта_Представление = "", ДопПараметры = Неопределено) Экспорт
	Если ПустаяСтрока(ОперИмпорта_Представление) Тогда
		ОперИмпорта_Представление = ОперИмпорта;	
	КонецЕсли;	
	
	ИмяТаблицыИст	= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ИмяТаблицыИст", ОперИмпорта);
	ИмяТаблицыТек	= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ИмяТаблицыТек", ИмяТаблицыТек);	
	
	МетаОбъект = Метаданные.НайтиПоПолномуИмени(ИмяТаблицыИст);
	
	ЗапросыИст = ОбменДаннымиЧЗ.СоздатьТаблицуИменЗапросов();	
	
	#Область ВТ_Ссылки
	
	ВсеИзмерения	    = ПолучитьВсеИзмерения(МетаОбъект);
	ВедущиеИзмерения	= ПолучитьВедущиеИзмерения(МетаОбъект);
	
	ПоляВыборкиИзменений		= Новый Массив;
	ПоляГруппировкиИзменений	= Новый Массив;
	ПоляОтбора					= Новый Массив;	
	
	ПервоеИзмерение			= Неопределено;
	ИспользуемыеИзмерения	= ?(ВедущиеИзмерения.Количество() > 0, ВедущиеИзмерения, ВсеИзмерения);	
	Для каждого Измерение Из ИспользуемыеИзмерения Цикл		
		Если ПервоеИзмерение = Неопределено Тогда
			ПервоеИзмерение = Измерение;		
		КонецЕсли;
		ПоляВыборкиИзменений.Добавить(Измерение);
		ПоляГруппировкиИзменений.Добавить("ВТ_Измерения." + Измерение);
		ПоляОтбора.Добавить(Измерение);		
	КонецЦикла;
	
	СтрокаПолей	= СтрСоединить(ПоляВыборкиИзменений, ",");
	СтрокаГруппировки = СтрСоединить(ПоляГруппировкиИзменений, ",");
	
	Соединения = Новый Массив;
	Для каждого Измерение Из ПоляОтбора Цикл
		Соединения.Добавить("ВТ_Измерения." + Измерение + " = Записи." + Измерение);	
	КонецЦикла;
	
	ТекстЗапросаИзменений = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	" + СтрокаПолей + "
	|ПОМЕСТИТЬ ВТ_Измерения	
	|ИЗ   
	|	" + ИмяТаблицыИст + ".Изменения
	|ГДЕ
	|	Узел = &УзелПолучатель
	|;
	|ВЫБРАТЬ
	|	ВТ_Измерения.*,
	|	КОЛИЧЕСТВО(*) КАК КолЗаписей 
	|ИЗ
	|	ВТ_Измерения
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	" + ИмяТаблицыИст + " КАК Записи
	|ПО
	|	" + СтрСоединить(Соединения, Символы.ПС + "И ") + "	
	|СГРУППИРОВАТЬ ПО       
	|	" + СтрокаГруппировки + "	
	|";		
	
	ТекстЗапроса = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Измерения ИЗ &МассивСсылок КАК МассивСсылок	
	|";
	
	ОбменДаннымиЧЗ.ДобавитьИмяТаблицы(ЗапросыИст, "ВТ_Измерения", ТекстЗапроса, Ложь);
	
	#КонецОбласти
	
	#Область Записи
	
	Если ВедущиеИзмерения.Количество() > 0 Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	*
		|ИЗ
		|	ВТ_Измерения
		|";
		
	    ОбменДаннымиЧЗ.ДобавитьИмяТаблицы(ЗапросыИст, "ОтборыИзмерений_" + ИмяТаблицыИст, ТекстЗапроса, Истина, Истина);	
	КонецЕсли;	
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Записи.*
	|ИЗ	
	|	" + ИмяТаблицыИст + " КАК Записи
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	ВТ_Измерения 
	|ПО 
	|	" + СтрСоединить(Соединения, Символы.ПС + "И ") + "
	|";
	
    ОбменДаннымиЧЗ.ДобавитьИмяТаблицы(ЗапросыИст, "Записи_" + ИмяТаблицыИст, ТекстЗапроса, Истина, Истина);
	
	Если ВедущиеИзмерения.Количество() = 0 Тогда	
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ВТ_Измерения.*
		|ИЗ	
		|	ВТ_Измерения 
		|ЛЕВОЕ СОЕДИНЕНИЕ 
		|	" + ИмяТаблицыИст + " КАК Записи
		|ПО 
		|	" + СтрСоединить(Соединения, Символы.ПС + "И ") + "
		|ГДЕ
		|	Записи." + ПервоеИзмерение +  " ЕСТЬ NULL
		|";
		
	    ОбменДаннымиЧЗ.ДобавитьИмяТаблицы(ЗапросыИст, "УдаленныеЗаписи_" + ИмяТаблицыИст, ТекстЗапроса, Истина, Истина);
	КонецЕсли;
		
	#КонецОбласти
	
	Возврат Новый Структура("ИмяТаблицыИст,РазмерПорции,ТекстЗапросаИзменений,ЗапросыИст,ОперИмпорта,ОперИмпорта_Представление,ПоляОтбора", 
		ИмяТаблицыИст, 50000, ТекстЗапросаИзменений, ЗапросыИст, ОперИмпорта, ОперИмпорта_Представление,ПоляОтбора);
КонецФункции //ПолучитьПравилоВыгрузки_РС_Независимый(ОперИмпорта, Знач ОперИмпорта_Представление = "", ДопПараметры = Неопределено) Экспорт
	
Функция ПолучитьПравилоВыгрузки_РС_ПоРегистратору(ОперИмпорта, Знач ОперИмпорта_Представление = "", ДопПараметры = Неопределено) Экспорт
	ПравилоВыгрузки = ПолучитьПравилоВыгрузкиРегистра_ПоРегистратору(ОперИмпорта, ОперИмпорта_Представление, ДопПараметры);
	ПравилоВыгрузки.Вставить("РазмерПорции", 50000);
	
	Возврат ПравилоВыгрузки;	
КонецФункции //ПолучитьПравилоВыгрузки() Экспорт

Функция СериализоватьВJSON(Данные) Экспорт
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	
	СериализаторXDTO.ЗаписатьJSON(Запись, Данные, НазначениеТипаXML.Явное);
	
	Возврат Запись.Закрыть();
КонецФункции //СериализоватьВJSON(Данные)

Функция ПрочитатьИзJSON(Данные) Экспорт
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Данные);
	
	Возврат СериализаторXDTO.ПрочитатьJSON(Чтение);	
КонецФункции //ПрочитатьИзJSON(Данные)

Функция РаспределитьПоЧастям(Элементы, КолЧастей) Экспорт	
	Результат = Новый Массив;
	
	КРаспределению 		= Элементы.Количество(); 
	ВсегоРаспределено 	= 0;
	ВсегоРаспределеноФ 	= 0;
	Дельта				= 0;

	Инд = 0;

	Для Сч = 1 По КолЧастей Цикл		
		Если ВсегоРаспределено < КРаспределению Тогда
			текРезультат 		= Цел(КРаспределению/КолЧастей);				
			ВсегоРаспределено 	= ВсегоРаспределено 	+ текРезультат;			
			ВсегоРаспределеноФ 	= ВсегоРаспределеноФ 	+ КРаспределению/КолЧастей;
			
			Дельта = ВсегоРаспределеноФ - ВсегоРаспределено;		
			
			Если Дельта <= -1 Тогда		
				Корр = Цел(Дельта);			
				Дельта = Дельта - Корр;
			ИначеЕсли Дельта >= 1 Тогда
				Корр = Цел(Дельта);
			Иначе
				Корр = 0;			
			КонецЕсли;		
			
			текРезультат 		= текРезультат		+ Корр;
			ВсегоРаспределено 	= ВсегоРаспределено + Корр;			
			
			Пачка = Новый Массив;
			Для к = 1 по текРезультат Цикл
				Пачка.Добавить(Элементы[Инд]);				
				Инд = Инд + 1;
			КонецЦикла;
			
			Если Пачка.Количество() > 0 Тогда			
				Результат.Добавить(Пачка);
			КонецЕсли;
		Иначе
			Прервать;
		КонецЕсли;	
	КонецЦикла;

	Возврат Результат;	
КонецФункции //РаспределитьПоЧастям(Элементы, КолЧастей) Экспорт

Функция ЗагрузитьДанные_Регистра(ИмяТаблицы, ДанныеПакета, Отправитель, ДопПараметры = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	фПерезаписывать = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "фПерезаписывать", Ложь);
	
	Таблицы	= МаркировкаКС.ПолучитьЗначениеПараметра(ДанныеПакета, "Таблицы");	
	
	Записи 			= Неопределено;
	ОтборыИзмерений = Неопределено;
	УдаленныеЗаписи	= Неопределено;
	Регистраторы	= Неопределено;
	
	Для Каждого КиЗ Из Таблицы Цикл		
		Если СтрНачинаетсяС(КиЗ.Ключ, "Записи_") Тогда			
			Записи			= КиЗ.Значение;
		ИначеЕсли СтрНачинаетсяС(КиЗ.Ключ, "ОтборыИзмерений_") Тогда
			ОтборыИзмерений	= КиЗ.Значение;                         
		ИначеЕсли СтрНачинаетсяС(КиЗ.Ключ, "Регистраторы_") Тогда
			Регистраторы	= КиЗ.Значение;
		ИначеЕсли СтрНачинаетсяС(КиЗ.Ключ, "УдаленныеЗаписи_") Тогда
			УдаленныеЗаписи	= КиЗ.Значение;
		КонецЕсли;		
	КонецЦикла;
	
	Если Записи = Неопределено Тогда
		Результат.Ошибки.Добавить("Не обнаружено таблицы с данными записей регистра !");
		Возврат Результат;	
	КонецЕсли;         
	
	МетаРС = Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);	
	
	Если МетаРС.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору Тогда
		Если Регистраторы = Неопределено Тогда
			Результат = ЗагрузитьЗаписиРС_ПоРегистратору(МетаРС, Записи, Отправитель);
		Иначе                                                                                       
			Результат = ЗагрузитьЗаписиРС_ПоРегистратору_СОчисткой(МетаРС, Записи, Регистраторы, Отправитель);		
		КонецЕсли;		
	Иначе //Независимый		
		ВедущиеИзмерения = ПолучитьВедущиеИзмерения(МетаРС);
		Если ВедущиеИзмерения.Количество() > 0 И ТипЗнч(ОтборыИзмерений) = Тип("ТаблицаЗначений") Тогда
			Результат = ЗагрузитьЗаписиРС_ПоВедущимИзмерениям(МетаРС, Записи, ОтборыИзмерений, Отправитель, ВедущиеИзмерения);
		Иначе
			Результат = ЗагрузитьЗаписиРС_ПоЗаписям(МетаРС, Записи, УдаленныеЗаписи, Отправитель);					
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //Функция ЗагрузитьДанные_Регистра(ИмяТаблицы, ДанныеПакета, Отправитель, ДопПараметры = Неопределено) Экспорт

Функция ЗагрузитьЗаписиРС_ПоРегистратору(МетаРС, Записи, Отправитель)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Вид = МетаРС.Имя;
	
	Запрос	= Новый Запрос;	
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Записи ИЗ &Записи КАК Записи
	|;
	|ВЫБРАТЬ
	|	*
	|ИЗ
	|	ВТ_Записи
	|ИТОГИ ПО
	|	Регистратор
	|";
	
	Запрос.УстановитьПараметр("Записи", Записи);
	
	рЗапроса			= Запрос.Выполнить();
	Выборка_Регистратор = рЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Регистратор");
	
	ВсегоСтрок	= Выборка_Регистратор.Количество();
	Сч			= 0;
	
	Начало 		= ТекущаяУниверсальнаяДатаВМиллисекундах();
	СовсемНачало= Начало;
	
	ЗагрузкаИзСтаройБазы = (ЗначениеЗаполнено(Отправитель) И ТипЗнч(Отправитель) = Тип("ПланОбменаСсылка.Свертка"));
	
	ОшибокЗаписи = 0;
	
	ОшибкиЗаписи = СоздатьТаблицуОшибокЗаписи();	
	
	Пока Выборка_Регистратор.Следующий() Цикл
		#ЕСЛИ КЛИЕНТ ТОГДА
			ОбработкаПрерыванияПользователя();
		#КОНЕЦЕСЛИ
		
		Регистратор = Выборка_Регистратор.Регистратор;
		Если ЗначениеЗаполнено(Регистратор) Тогда
			НЗ = РегистрыСведений[Вид].СоздатьНаборЗаписей();
			НЗ.Отбор.Регистратор.Установить(Регистратор);
			
			Выборка = Выборка_Регистратор.Выбрать();
			Пока Выборка.Следующий() Цикл
				Запись = НЗ.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, Выборка);			
			КонецЦикла; 
			
			УстановитьОбменДаннымиИОтправителя(НЗ, Отправитель); 
			
			Попытка
				Если Вид = "СтатусыКМ_Факт" Тогда
					ЗаписатьДвижения_СтатусыКМ_Факт(НЗ, Регистратор, ЗагрузкаИзСтаройБазы);
				Иначе
					НЗ.Записать();
				КонецЕсли;
			Исключение
				СтрокаО = ОшибкиЗаписи.Добавить();
				
				СтрокаО.Основание	= Регистратор;
				СтрокаО.ТекстОшибки	= ОписаниеОшибки();
				СтрокаО.Дата		= ТекущаяДата();
				
				ОшибокЗаписи = ОшибокЗаписи + 1;					
			КонецПопытки;			
		КонецЕсли;
		
		Сч = Сч + 1;
		Если Сч % 100 = 0 Тогда
			ТекстСообщения = СтрШаблон("Загрузка РС: '%1'. Загружено: %2 из %3 записей.", Сч, ВсегоСтрок);
			инт_ДлительныеОперации.СообщитьПрогресс(Формат(100*Сч/ВсегоСтрок, "ЧДЦ=2"), ТекстСообщения);		
		КонецЕсли;		
	КонецЦикла;
	
	Результат.ОбработаноОбъектов = Сч;	
	Результат.Вставить("ПрочитаноОбъектов", Сч); 
	Результат.Вставить("ОшибокЗаписи", 		ОшибокЗаписи);
	Результат.Вставить("ОшибкиЗаписи", 		ОшибкиЗаписи);
	
	Результат.ВремяВыполнения = (ТекущаяУниверсальнаяДатаВМиллисекундах() - СовсемНачало)/1000;
	
	Если ПараметрыСеанса.Отладка Тогда
		ПланОбмена = ?(ЗначениеЗаполнено(Отправитель), "" + Отправитель.Метаданные(), "Н/У");	
		ТекстСообщения = СтрШаблон("Окончание загрузки пакета. Прочитано: %1 ('%2'), записано: %3, ошибок записи: %4.",  
			Результат.ПрочитаноОбъектов, МетаРС.ПолноеИмя(), Результат.ОбработаноОбъектов, ОшибокЗаписи);	
		ЗаписатьВЛог(ИмяЛогаОбмена(ПланОбмена), ТекстСообщения, "Информация", , , Результат.ВремяВыполнения);	
	КонецЕсли;	
	
	Возврат Результат;	
КонецФункции //ЗагрузитьЗаписиРС_ПоРегистратору()

Функция ЗагрузитьЗаписиРС_ПоРегистратору_СОчисткой(МетаРС, Записи, Регистраторы, Отправитель)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Вид = МетаРС.Имя;
	Менеджер = РегистрыСведений[Вид];
	Записи.Индексы.Добавить("Регистратор");	
	
	ВсегоСтрок		= Записи.Количество() + Регистраторы.Количество();
	ЗаписаноСтрок	= 0;
	Сч				= 0;
	
	Начало 		= ТекущаяУниверсальнаяДатаВМиллисекундах();
	СовсемНачало= Начало;
	
	ЗагрузкаИзСтаройБазы = (ЗначениеЗаполнено(Отправитель) И ТипЗнч(Отправитель) = Тип("ПланОбменаСсылка.Свертка"));
	
	ОшибокЗаписи = 0;
	
	ОшибкиЗаписи = СоздатьТаблицуОшибокЗаписи();
	
	Для каждого СтрокаР Из Регистраторы Цикл
		#ЕСЛИ КЛИЕНТ ТОГДА
			ОбработкаПрерыванияПользователя();
		#КОНЕЦЕСЛИ
		
		Регистратор = СтрокаР.Регистратор;		
		
		Если ЗначениеЗаполнено(Регистратор) Тогда
			НЗ = Менеджер.СоздатьНаборЗаписей();
			НЗ.Отбор.Регистратор.Установить(Регистратор);
			
			Для каждого ДанныеЗаписи Из Записи.НайтиСтроки(Новый Структура("Регистратор", Регистратор)) Цикл			
				Запись = НЗ.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, ДанныеЗаписи);			
			КонецЦикла; 
			
			ЗаписаноСтрок = ЗаписаноСтрок + НЗ.Количество() + 1;
			
			УстановитьОбменДаннымиИОтправителя(НЗ, Отправитель);
			
			Попытка
				Если Вид = "СтатусыКМ_Факт" Тогда
					ЗаписатьДвижения_СтатусыКМ_Факт(НЗ, Регистратор, ЗагрузкаИзСтаройБазы);					
				Иначе
					НЗ.Записать();
				КонецЕсли;				
			Исключение
				СтрокаО = ОшибкиЗаписи.Добавить();
				
				СтрокаО.Основание	= Регистратор;
				СтрокаО.ТекстОшибки	= ОписаниеОшибки();
				СтрокаО.Дата		= ТекущаяДата();
				
				ОшибокЗаписи = ОшибокЗаписи + 1;					
			КонецПопытки;			
		КонецЕсли;
		
		Сч = Сч + 1;
		Если Сч % 100 = 0 Тогда
			ТекстСообщения = СтрШаблон("Загрузка РС: '%1'. Загружено: %2 из %3 записей.", ЗаписаноСтрок, ВсегоСтрок);
			инт_ДлительныеОперации.СообщитьПрогресс(Формат(100*ЗаписаноСтрок/ВсегоСтрок, "ЧДЦ=2"), ТекстСообщения);		
		КонецЕсли;		
	КонецЦикла;
	
	Результат.ОбработаноОбъектов = Сч;	
	Результат.Вставить("ПрочитаноОбъектов", Сч); 
	Результат.Вставить("ОшибокЗаписи", 		ОшибокЗаписи);
	Результат.Вставить("ОшибкиЗаписи", 		ОшибкиЗаписи);
	
	Результат.ВремяВыполнения = (ТекущаяУниверсальнаяДатаВМиллисекундах() - СовсемНачало)/1000;
	
	Если ПараметрыСеанса.Отладка Тогда
		ПланОбмена = ?(ЗначениеЗаполнено(Отправитель), "" + Отправитель.Метаданные(), "Н/У");	
		ТекстСообщения = СтрШаблон("Окончание загрузки пакета. Прочитано: %1 ('%2'), записано: %3, ошибок записи: %4.",  
			Результат.ПрочитаноОбъектов, МетаРС.ПолноеИмя(), Результат.ОбработаноОбъектов, ОшибокЗаписи);	
		ЗаписатьВЛог(ИмяЛогаОбмена(ПланОбмена), ТекстСообщения, "Информация", , , Результат.ВремяВыполнения);	
	КонецЕсли;	
	
	Возврат Результат;	
КонецФункции //ЗагрузитьЗаписиРС_ПоРегистратору()

Функция ЗагрузитьЗаписиРС_ПоВедущимИзмерениям(МетаРС, Записи, ОтборыИзмерений, Отправитель, ВедущиеИзмерения)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Вид			= МетаРС.Имя;
	Менеджер	= РегистрыСведений[Вид];
	
	ИмяЛога = ИмяЛогаОбмена(Метаданные.НайтиПоТипу(ТипЗнч(Отправитель)).Имя);
	
	ИндексируемыеИзмерения = Новый Массив;
	Для каждого Измерение Из МетаРС.Измерения Цикл
		Если МожноИндексироватьКолонку(Записи.Колонки[Измерение.Имя].ТипЗначения) Тогда
			ИндексируемыеИзмерения.Добавить(Измерение.Имя);
		КонецЕсли;	
	КонецЦикла;
	
	Запрос	= Новый Запрос;	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Записи ИЗ &Записи КАК Записи
	|" + ?(ИндексируемыеИзмерения.Количество() > 0, " ИНДЕКСИРОВАТЬ ПО " + СтрСоединить(ИндексируемыеИзмерения, ","),"") + "
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ * ПОМЕСТИТЬ ВТ_ОтборыИзмерений ИЗ &ОтборыИзмерений КАК ОтборыИзмерений
	|;
	|ВЫБРАТЬ * ИЗ ВТ_ОтборыИзмерений
	|";
	
	Запрос.УстановитьПараметр("Записи", 			Записи);
	Запрос.УстановитьПараметр("ОтборыИзмерений",	ОтборыИзмерений);
	
	Попытка
		рЗапроса	= Запрос.Выполнить();
	Исключение         
		ТекстСообщения = СтрШаблон("Ошибка загрузки записей: '%1', %2 !", МетаРС.ПолноеИмя(), ОписаниеОшибки());
		ЗаписатьВЛог(ИмяЛога, ТекстСообщения, "Ошибка");
		
		Результат.Ошибки.Добавить(ТекстСообщения);
		Результат.Успешно = Ложь;
		
		Возврат Результат;		
	КонецПопытки;
	Выборка_ВИ	= рЗапроса.Выбрать();
	
	ВсегоСтрок		= Записи.Количество() + ОтборыИзмерений.Количество();
	ЗаписаноСтрок   = 0;
	Сч				= 0;
	
	Начало 		= ТекущаяУниверсальнаяДатаВМиллисекундах();
	СовсемНачало= Начало;
	
	ОшибокЗаписи = 0;
	
	ОшибкиЗаписи = СоздатьТаблицуОшибокЗаписи();
	
	Условия = Новый Массив;
	Для каждого ВедущееИзмерение Из ВедущиеИзмерения Цикл
		Условия.Добавить(СтрШаблон("%1 = &%1", ВедущееИзмерение));	
	КонецЦикла;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	*
	|ИЗ
	|	ВТ_Записи
	|ГДЕ
	|	" + СтрСоединить(Условия, Символы.ПС + Символы.Таб + "И ") + "
	|";
	
	Пока Выборка_ВИ.Следующий() Цикл
		#ЕСЛИ КЛИЕНТ ТОГДА
			ОбработкаПрерыванияПользователя();
		#КОНЕЦЕСЛИ
		
		НЗ = Менеджер.СоздатьНаборЗаписей();		
		
		Для каждого ВедущееИзмерение Из ВедущиеИзмерения Цикл
			ЗначениеОтбора = Выборка_ВИ[ВедущееИзмерение];
			Запрос.УстановитьПараметр(ВедущееИзмерение, ЗначениеОтбора);
			
			НЗ.Отбор[ВедущееИзмерение].Установить(ЗначениеОтбора, Истина);
		КонецЦикла;	
		
		Выборка = Запрос.Выполнить().Выбрать();
		ЗаписаноСтрок = Выборка.Количество() + 1;
		
		Пока Выборка.Следующий() Цикл
			Запись = НЗ.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);			
		КонецЦикла; 
		
		Попытка
			НЗ.ОбменДанными.Загрузка = Истина;
			Попытка
				НЗ.Отправитель = Отправитель;					
			Исключение					
			КонецПопытки;				
			
			НЗ.Записать();				
		Исключение
			СтрокаО = ОшибкиЗаписи.Добавить();
			
			СтрокаО.Основание	= Выборка_ВИ[ВедущиеИзмерения[0]];
			СтрокаО.ТекстОшибки	= ОписаниеОшибки();
			СтрокаО.Дата		= ТекущаяДата();
			
			ОшибокЗаписи = ОшибокЗаписи + 1;					
		КонецПопытки;
		
		Сч = Сч + 1;
		Если Сч % 100 = 0 Тогда
			ТекстСообщения = СтрШаблон("Загрузка РС '%1'. Загружено: %2 из %3 записей.", Вид, Сч, ВсегоСтрок);
			инт_ДлительныеОперации.СообщитьПрогресс(Формат(100*ЗаписаноСтрок/ВсегоСтрок, "ЧДЦ=2"), ТекстСообщения);		
		КонецЕсли;		
	КонецЦикла;
	
	Результат.ОбработаноОбъектов = Сч;	
	Результат.Вставить("ПрочитаноОбъектов", Сч); 
	Результат.Вставить("ОшибокЗаписи", 		ОшибокЗаписи);
	Результат.Вставить("ОшибкиЗаписи", ОшибкиЗаписи);
	
	Результат.ВремяВыполнения = (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000;
	
	Если ПараметрыСеанса.Отладка Тогда
		ПланОбмена = ?(ЗначениеЗаполнено(Отправитель), "" + Отправитель.Метаданные(), "Н/У");	
		ТекстСообщения = СтрШаблон("Окончание загрузки пакета. Прочитано: %1 ('%2'), записано: %3, ошибок записи: %4.",  
			Результат.ПрочитаноОбъектов, МетаРС.ПолноеИмя(), Результат.ОбработаноОбъектов, ОшибокЗаписи);	
		ЗаписатьВЛог(ИмяЛогаОбмена(ПланОбмена), ТекстСообщения, "Информация", , , Результат.ВремяВыполнения);
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции //ЗагрузитьЗаписиРС_ПоВедущимИзмерениям(МетаРС, Записи, ОтборыИзмерений, Отправитель, ВедущиеИзмерения)

Функция ЗагрузитьЗаписиРС_ПоЗаписям(МетаРС, Записи, УдаленныеЗаписи, Отправитель)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Начало 		= ТекущаяУниверсальнаяДатаВМиллисекундах();	
	
	Вид 		= МетаРС.Имя;
	Менеджер	= РегистрыСведений[Вид];	
	
	ПервоеИзмерение = Неопределено;
	Для каждого МетаИзмерение Из МетаРС.Измерения Цикл
		ПервоеИзмерение = МетаИзмерение.Имя;
		Прервать;
	КонецЦикла;	
	
	ВсегоСтрок	= Записи.Количество() + УдаленныеЗаписи.Количество();
	Сч			= 0;
	
	ОшибокЗаписи = 0;	
	ОшибкиЗаписи = СоздатьТаблицуОшибокЗаписи();
	
	Для каждого ДанныеЗаписи Из Записи Цикл	
		#ЕСЛИ КЛИЕНТ ТОГДА
			ОбработкаПрерыванияПользователя();
		#КОНЕЦЕСЛИ
		
		НЗ = Менеджер.СоздатьНаборЗаписей();
		
		Для каждого МетаИзмерение Из МетаРС.Измерения Цикл
			Измерение = МетаИзмерение.Имя;			
			ЗначениеОтбора = ДанныеЗаписи[Измерение];			
			
			НЗ.Отбор[Измерение].Установить(ЗначениеОтбора, Истина);
		КонецЦикла;
		
		Запись = НЗ.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, ДанныеЗаписи);
		
		УстановитьОбменДаннымиИОтправителя(НЗ, Отправитель);
		
		Попытка			
			НЗ.Записать();				
		Исключение
			СтрокаО = ОшибкиЗаписи.Добавить();
			
			СтрокаО.Основание	= ДанныеЗаписи[ПервоеИзмерение];
			СтрокаО.ТекстОшибки	= ОписаниеОшибки();
			СтрокаО.Дата		= ТекущаяДата();
			
			ОшибокЗаписи = ОшибокЗаписи + 1;					
		КонецПопытки;
		
		Сч = Сч + 1;
		Если Сч % 100 = 0 Тогда
			ТекстСообщения = СтрШаблон("Загрузка РС: '%1'. Загружено: %2 из %3 записей.", Вид, Сч, ВсегоСтрок);
			инт_ДлительныеОперации.СообщитьПрогресс(Формат(100*Сч/ВсегоСтрок, "ЧДЦ=2"), ТекстСообщения);		
		КонецЕсли;		
	КонецЦикла;
	
	Если ТипЗнч(УдаленныеЗаписи) = Тип("ТаблицаЗначений") Тогда	
		
		Для каждого ДанныеЗаписи Из УдаленныеЗаписи Цикл	
			#ЕСЛИ КЛИЕНТ ТОГДА
				ОбработкаПрерыванияПользователя();
			#КОНЕЦЕСЛИ
			
			НЗ = Менеджер.СоздатьНаборЗаписей();
			
			Для каждого МетаИзмерение Из МетаРС.Измерения Цикл
				Измерение = МетаИзмерение.Имя;			
				ЗначениеОтбора = ДанныеЗаписи[Измерение];			
				
				НЗ.Отбор[Измерение].Установить(ЗначениеОтбора, Истина);
			КонецЦикла;		
			
			УстановитьОбменДаннымиИОтправителя(НЗ, Отправитель);
			
			Попытка
				НЗ.Записать();				
			Исключение
				СтрокаО = ОшибкиЗаписи.Добавить();
				
				СтрокаО.Основание	= ДанныеЗаписи[ПервоеИзмерение];
				СтрокаО.ТекстОшибки	= ОписаниеОшибки();
				СтрокаО.Дата		= ТекущаяДата();
				
				ОшибокЗаписи = ОшибокЗаписи + 1;					
			КонецПопытки;
			
			Сч = Сч + 1;
			Если Сч % 100 = 0 Тогда
				ТекстСообщения = СтрШаблон("Загрузка РС: '%1'. Загружено: %2 из %3 записей.", Вид, Сч, ВсегоСтрок);
				инт_ДлительныеОперации.СообщитьПрогресс(Формат(100*Сч/ВсегоСтрок, "ЧДЦ=2"), ТекстСообщения);		
			КонецЕсли;		
		КонецЦикла;
		
	КонецЕсли;

	Результат.ОбработаноОбъектов = Сч;	
	Результат.Вставить("ПрочитаноОбъектов", Сч); 
	Результат.Вставить("ОшибокЗаписи", 		ОшибокЗаписи);
	Результат.Вставить("ОшибкиЗаписи", 		ОшибкиЗаписи);
	
	Результат.ВремяВыполнения = (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000;
	
	Если ПараметрыСеанса.Отладка Тогда
		ПланОбмена = ?(ЗначениеЗаполнено(Отправитель), "" + Отправитель.Метаданные(), "Н/У");	
		ТекстСообщения = СтрШаблон("Окончание загрузки пакета. Прочитано: %1 ('%2'), записано: %3, ошибок записи: %4.",  
			Результат.ПрочитаноОбъектов, МетаРС.ПолноеИмя(), Результат.ОбработаноОбъектов, ОшибокЗаписи);	
		ЗаписатьВЛог(ИмяЛогаОбмена(ПланОбмена), ТекстСообщения, "Информация", , , Результат.ВремяВыполнения);
	КонецЕсли;	
	
	Возврат Результат;	
КонецФункции //ЗагрузитьЗаписиРС_ПоЗаписям(МетаРС, Записи, УдаленныеЗаписи, Отправитель)

Функция УстановитьОбменДаннымиИОтправителя(Объект, Отправитель)
	Объект.ОбменДанными.Загрузка = Истина;
	Попытка
		Объект.Отправитель = Отправитель;					
	Исключение					
	КонецПопытки;
КонецФункции //УстановитьОбменДаннымиИОтправителя(Объект, Отправитель)

Функция ЗаписатьДвижения_СтатусыКМ_Факт(НЗ, Регистратор, ЗагрузкаИзСтаройБазы)
	Если НЕ ЗагрузкаИзСтаройБазы И Метаданные.РегистрыСведений.ОтложенныеДвиженияДокументов.Измерения.ДокСсылка.Тип.СодержитТип(ТипЗнч(Регистратор)) Тогда //По новому
		рСохранения = ЗаписатьВОтложенныеДвижения(Регистратор, НЗ);	
		Если НЕ рСохранения.Успешно Тогда
			ТекстОшибки = СтрСоединить(рСохранения.Ошибки, Символы.ПС);
			ЗаписатьВЛог("ОбменДаннымиЧЗ", ТекстОшибки, "Ошибка");		
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;                                                                                 
	Иначе
		НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);					
		Попытка
			РегистрыСведений.СтатусыКМ_Факт.УстановитьБлокировкуПоНаборуЗаписей(НЗ);
			НЗ.Записать();					
			
			ЗафиксироватьТранзакцию();						
		Исключение
			ТекстОшибки = СтрШаблон("Ошибка записи статусов док-та: '%1'. %2", Регистратор, ОписаниеОшибки());
			
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();						
			КонецЕсли;               
			
			ЗаписатьВЛог("ОбменДаннымиЧЗ", ТекстОшибки, "Ошибка");
			ВызватьИсключение ТекстОшибки;
		КонецПопытки;					
	КонецЕсли;	
КонецФункции //ЗаписатьДвижения_СтатусыКМ_Факт(НЗ, Регистратор, ЗагрузкаИзСтаройБазы)

Функция МожноИндексироватьКолонку(ОписаниеТипов)
	ЕстьСсылки 			= Ложь;
	ЕстьХЗ 				= Ложь;
	ЕстьСтроки 			= Ложь;
	ЕстьЧисла			= Ложь;
	ЕстьДлинныеСтроки 	= Ложь;
	
	Для каждого Тип Из ОписаниеТипов.Типы() Цикл
		Если Метаданные.НайтиПоТипу(Тип) <> Неопределено Тогда
			ЕстьСсылки = Истина;
		ИначеЕсли Тип = Тип("Строка") Тогда
			ЕстьСтроки = Истина;		
			Если ОписаниеТипов.КвалификаторыСтроки.Длина = 0 Тогда
				ЕстьДлинныеСтроки = Истина;			
			КонецЕсли;
		ИначеЕсли Тип = Тип("Число") Тогда
			ЕстьЧисла = Истина;
		ИначеЕсли Тип = Тип("ХранилищеЗначения") Тогда
			ЕстьХЗ = Истина;
		КонецЕсли;			
	КонецЦикла;
	
	Результат = Ложь;
	
	Если ЕстьСсылки Тогда
		Если НЕ (ЕстьСтроки ИЛИ ЕстьЧисла ИЛИ ЕстьХЗ) Тогда
			Результат = Истина;
		КонецЕсли;		
	ИначеЕсли ЕстьСтроки Тогда
		Если НЕ ЕстьДлинныеСтроки Тогда
			Результат = Истина;
		КонецЕсли;		
	ИначеЕсли ЕстьЧисла Тогда
		Результат = Истина;						
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //МожноИндексироватьИзмерение(МетаИзмерение)

Функция ЗагрузитьДанные_Справочник(ИмяТаблицы, ДанныеПакета, Отправитель, ДопПараметры = Неопределено) Экспорт	
	Результат	= МаркировкаКС.СтруктураРезультата();
	
	МетаОбъект 	= Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
	Менеджер 	= Справочники[МетаОбъект.Имя];
	
	фПерезаписывать = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "фПерезаписывать", Ложь);
	
	Таблицы	= МаркировкаКС.ПолучитьЗначениеПараметра(ДанныеПакета, "Таблицы");
	
	Шапка 		= Неопределено;
	ДанныеТЧ 	= Новый Соответствие;
	
	Для Каждого КиЗ Из Таблицы Цикл		
		Если СтрНачинаетсяС(КиЗ.Ключ,"ТЧ_") Тогда
			КиЗ.Значение.Индексы.Добавить("Ссылка");
			ДанныеТЧ[Сред(КиЗ.Ключ, 4)] = КиЗ.Значение;
		ИначеЕсли КиЗ.Ключ = "Шапка" Тогда
			Шапка = КиЗ.Значение;			
		КонецЕсли;		
	КонецЦикла;
	
	ЕстьКолонкаГруппы = (Шапка.Колонки.Найти("ЭтоГруппа") <> Неопределено) И (МетаОбъект.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов);
	
	ПоляТолькоДляГрупп 		= Новый Массив;
	ПоляТолькоДляЭлементов	= Новый Массив;
	
	Для каждого МетаРеквизит Из МетаОбъект.Реквизиты Цикл		
		Если МетаРеквизит.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы Тогда
			ПоляТолькоДляГрупп.Добавить(МетаРеквизит.Имя);
		ИначеЕсли МетаРеквизит.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента Тогда
			ПоляТолькоДляЭлементов.Добавить(МетаРеквизит.Имя);			
		КонецЕсли;	
	КонецЦикла;
	
	ТЧТолькоДляГрупп		= Новый Соответствие;
	ТЧТолькоДляЭлементов	= Новый Соответствие;
	
	Для каждого МетаТЧ Из МетаОбъект.ТабличныеЧасти Цикл
		Если МетаТЧ.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы Тогда
			ТЧТолькоДляГрупп[МетаТЧ.Имя] = Истина;
		ИначеЕсли МетаТЧ.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента Тогда
			ТЧТолькоДляЭлементов[МетаТЧ.Имя] = Истина;			
		КонецЕсли;	
	КонецЦикла;
	
	ПоляТолькоДляГрупп 		= СтрСоединить(ПоляТолькоДляГрупп, ",");
	ПоляТолькоДляЭлементов	= СтрСоединить(ПоляТолькоДляЭлементов, ",");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Шапка ИЗ &Шапка КАК Шапка
	|;
	|ВЫБРАТЬ
	|	IsNULL(Ссылка.ВерсияДанных,"""") КАК ВерсияДанных,
	|	*
	|ИЗ
	|	ВТ_Шапка
	|ГДЕ
	|	Ссылка.ВерсияДанных ЕСТЬ NULL	
	|	ИЛИ &фПерезаписывать
	|";  
	
	Запрос.УстановитьПараметр("Шапка", 				Шапка);
	Запрос.УстановитьПараметр("фПерезаписывать",	фПерезаписывать);
	
	Выборка 	= Запрос.Выполнить().Выбрать();
	
	ВсегоСтрок		= Выборка.Количество();
	Сч				= 0;	
	ОшибкиЗаписи 	= ОбменДаннымиЧЗ.СоздатьТаблицуОшибокЗаписи();
	
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();	
	
	Пока Выборка.Следующий() Цикл
		#ЕСЛИ КЛИЕНТ ТОГДА
		ОбработкаПрерыванияПользователя();
		#КОНЕЦЕСЛИ		
		
		ЭтоГруппа 			= ?(ЕстьКолонкаГруппы, Выборка.ЭтоГруппа, Ложь);
		
		ПропускаемыеПоля	= "Ссылка";
		Если ЕстьКолонкаГруппы Тогда
			Если ЭтоГруппа Тогда			
				ПропускаемыеПоля = ПропускаемыеПоля + ?(ПустаяСтрока(ПоляТолькоДляЭлементов), "", ",") + ПоляТолькоДляЭлементов;
			Иначе 
				ПропускаемыеПоля = ПропускаемыеПоля + ?(ПустаяСтрока(ПоляТолькоДляГрупп), "", ",") + ПоляТолькоДляГрупп;
			КонецЕсли;		
		КонецЕсли;		
		
		Если ЗначениеЗаполнено(Выборка.ВерсияДанных) Тогда
			СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();			
		Иначе			
			Если ЭтоГруппа Тогда			
				СпрОбъект = Менеджер.СоздатьГруппу();				
			Иначе
				СпрОбъект = Менеджер.СоздатьЭлемент();										
			КонецЕсли;			
			
			СпрОбъект.УстановитьСсылкуНового(Выборка.Ссылка);
		КонецЕсли;		
		
		ЗаполнитьЗначенияСвойств(СпрОбъект, Выборка, , ПропускаемыеПоля);
		
		Для Каждого КиЗ Из ДанныеТЧ Цикл
			ИмяТЧ = КиЗ.Ключ;
			
			СтрокиТЧ = КиЗ.Значение.НайтиСтроки(Новый Структура("Ссылка", Выборка.Ссылка));
			
			Если ЭтоГруппа И ТЧТолькоДляЭлементов.Получить(ИмяТЧ) <> Неопределено Тогда
				Продолжить;
			ИначеЕсли НЕ ЭтоГруппа И ТЧТолькоДляГрупп.Получить(ИмяТЧ) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ТЧ_Объекта = СпрОбъект[КиЗ.Ключ];
			
			ТЧ_Объекта.Очистить();
			Для Каждого СтрокаТЧ_Ист Из КиЗ.Значение.НайтиСтроки(Новый Структура("Ссылка", Выборка.Ссылка)) Цикл
				СтрокаТЧ_Тек = ТЧ_Объекта.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЧ_Тек, СтрокаТЧ_Ист);
			КонецЦикла;
		КонецЦикла;
		
		СпрОбъект.ДополнительныеСвойства.Вставить("ОтключитьЖурнализациюЗаписи", Истина);
		СпрОбъект.ОбменДанными.Загрузка = Истина;
		СпрОбъект.ОбменДанными.Отправитель = Отправитель;
		
		Попытка
			СпрОбъект.Записать();		
			Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;
		Исключение
			СтрокаО = ОшибкиЗаписи.Добавить();
				
			СтрокаО.Основание	= Выборка.Ссылка;
			СтрокаО.ТекстОшибки	= ОписаниеОшибки();
			СтрокаО.Дата		= ТекущаяДата();				
		КонецПопытки;		
		
		Сч = Сч + 1;
		Если Сч % 100 = 0 Тогда
			ТекстСообщения = СтрШаблон("Загрузка %1. Загружено: %2 из %3 элементов.", ИмяТаблицы, Сч, ВсегоСтрок);
			инт_ДлительныеОперации.СообщитьПрогресс(Формат(100*Сч/ВсегоСтрок, "ЧДЦ=2"), ТекстСообщения);		
		КонецЕсли;		
	КонецЦикла;
	
	Результат.ОбработаноОбъектов = Шапка.Количество();
	Результат.Вставить("ПрочитаноОбъектов", Шапка.Количество()); 
	Результат.Вставить("ОшибокЗаписи", 	ОшибкиЗаписи.Количество());
	Результат.Вставить("ОшибкиЗаписи", 	ОшибкиЗаписи);
	
	Результат.ВремяВыполнения = (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000;	
	
	Возврат Результат;	
КонецФункции // ()

Функция ЗагрузитьДанные_Документ(ИмяТаблицы, ДанныеПакета, Отправитель, ДопПараметры = Неопределено) Экспорт
	Результат	= МаркировкаКС.СтруктураРезультата();
	
	МетаОбъект 	= Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
	Менеджер 	= Документы[МетаОбъект.Имя];
	
	фПерезаписывать = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "фПерезаписывать", Ложь);
	
	Таблицы	= МаркировкаКС.ПолучитьЗначениеПараметра(ДанныеПакета, "Таблицы");
	
	Шапка 		= Неопределено;
	ДанныеТЧ 	= Новый Соответствие;
	
	Для Каждого КиЗ Из Таблицы Цикл		
		Если СтрНачинаетсяС(КиЗ.Ключ,"ТЧ_") Тогда
			КиЗ.Значение.Индексы.Добавить("Ссылка");
			ДанныеТЧ[Сред(КиЗ.Ключ, 4)] = КиЗ.Значение;
		ИначеЕсли КиЗ.Ключ = "Шапка" Тогда
			Шапка = КиЗ.Значение;			
		КонецЕсли;		
	КонецЦикла;	  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Шапка ИЗ &Шапка КАК Шапка
	|;
	|ВЫБРАТЬ
	|	IsNULL(Ссылка.ВерсияДанных,"""") КАК ВерсияДанных,
	|	*
	|ИЗ
	|	ВТ_Шапка
	|ГДЕ
	|	Ссылка.ВерсияДанных ЕСТЬ NULL	
	|	ИЛИ &фПерезаписывать
	|";  
	
	Запрос.УстановитьПараметр("Шапка", 				Шапка);
	Запрос.УстановитьПараметр("фПерезаписывать",	фПерезаписывать);
	
	Выборка 	= Запрос.Выполнить().Выбрать();
	
	ВсегоСтрок		= Выборка.Количество();
	Сч				= 0;
	ОшибкиЗаписи 	= ОбменДаннымиЧЗ.СоздатьТаблицуОшибокЗаписи();
	
	Начало 		= ТекущаяУниверсальнаяДатаВМиллисекундах();	
	
	Пока Выборка.Следующий() Цикл
		#ЕСЛИ КЛИЕНТ ТОГДА
		ОбработкаПрерыванияПользователя();
		#КОНЕЦЕСЛИ
		
		Если ЗначениеЗаполнено(Выборка.ВерсияДанных) Тогда
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();			
		Иначе			
			ДокОбъект = Менеджер.СоздатьДокумент();		
			ДокОбъект.УстановитьСсылкуНового(Выборка.Ссылка);
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ДокОбъект, Выборка, , "Ссылка");		
		
		Для Каждого КиЗ Из ДанныеТЧ Цикл
			СтрокиТЧ = КиЗ.Значение.НайтиСтроки(Новый Структура("Ссылка", Выборка.Ссылка));		
			
			ТЧ_Объекта = ДокОбъект[КиЗ.Ключ];
			
			ТЧ_Объекта.Очистить();			
			Для Каждого СтрокаТЧ_Ист Из КиЗ.Значение.НайтиСтроки(Новый Структура("Ссылка", Выборка.Ссылка)) Цикл
				СтрокаТЧ_Тек = ТЧ_Объекта.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЧ_Тек, СтрокаТЧ_Ист);			
			КонецЦикла; 
		КонецЦикла;
		
		ДокОбъект.ДополнительныеСвойства.Вставить("ОтключитьЖурнализациюЗаписи", Истина);
		ДокОбъект.ОбменДанными.Загрузка 	= Истина;
		ДокОбъект.ОбменДанными.Отправитель	= Отправитель;
		
		Попытка
			ДокОбъект.Записать();		
			Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;
		Исключение
			СтрокаО = ОшибкиЗаписи.Добавить();
				
			СтрокаО.Основание	= Выборка.Ссылка;
			СтрокаО.ТекстОшибки	= ОписаниеОшибки();
			СтрокаО.Дата		= ТекущаяДата();
		КонецПопытки;
		
		Сч = Сч + 1;
		Если Сч % 100 = 0 Тогда
			ТекстСообщения = СтрШаблон("Загрузка док-та: '%1'. Загружено: %2 из %3 документов.", МетаОбъект.Имя, Сч, ВсегоСтрок);
			инт_ДлительныеОперации.СообщитьПрогресс(Формат(100*Сч/ВсегоСтрок, "ЧДЦ=2"), ТекстСообщения);		
		КонецЕсли;		
	КонецЦикла;	
	
	Результат.Вставить("ПрочитаноОбъектов", Шапка.Количество()); 
	Результат.Вставить("ОшибокЗаписи", 		ОшибкиЗаписи.Количество());
	Результат.Вставить("ОшибкиЗаписи", 		ОшибкиЗаписи);
	
	Результат.ВремяВыполнения = (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000;	
	
	Возврат Результат;	
КонецФункции //ЗагрузитьДанные_Документ(ИмяТаблицы, ДанныеПакета, Отправитель, ДопПараметры = Неопределено) Экспорт

Функция ЗаписатьВОтложенныеДвижения(Регистратор, НЗ)					
	СтрокаДанных = Новый Структура;
	СтрокаДанных.Вставить("ДокСсылка", 			Регистратор);
	СтрокаДанных.Вставить("ИмяРегистра",    	НЗ.Метаданные().ПолноеИмя());
	СтрокаДанных.Вставить("Движения",			Новый ХранилищеЗначения(ЗначениеВСтрокуВнутр(НЗ.Выгрузить()), Новый СжатиеДанных(5)));
	СтрокаДанных.Вставить("КоличествоЗаписей", 	НЗ.Количество());
	
	ДанныеДвижений = Новый Массив;
	ДанныеДвижений.Добавить(СтрокаДанных);
	
	Возврат РегистрыСведений.ОтложенныеДвиженияДокументов.СохранитьДвижения(Регистратор, ДанныеДвижений);
КонецФункции //ЗаписатьВОтложенныеДвижения(Регистратор, НЗ)

Функция СоздатьТаблицуОшибокЗаписи() Экспорт
	ОшибкиЗаписи = Новый ТаблицаЗначений;
	ОшибкиЗаписи.Колонки.Добавить("Основание");
	ОшибкиЗаписи.Колонки.Добавить("ТекстОшибки");
	ОшибкиЗаписи.Колонки.Добавить("Дата");
	
	Возврат ОшибкиЗаписи;
КонецФункции // ()
 
Функция ПолучитьПравилоВыгрузкиРегистра_ПоРегистратору(ОперИмпорта, Знач ОперИмпорта_Представление = "", ДопПараметры = Неопределено) Экспорт
	Если ПустаяСтрока(ОперИмпорта_Представление) Тогда
		ОперИмпорта_Представление = ОперИмпорта;	
	КонецЕсли;	
	
	ИмяТаблицыИст	= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ИмяТаблицыИст", ОперИмпорта);
	ИмяТаблицыТек	= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ИмяТаблицыТек", ИмяТаблицыТек);	
	
	ЗапросыИст = ОбменДаннымиЧЗ.СоздатьТаблицуИменЗапросов();	
	
	#Область ВТ_Ссылки
	
	ТекстЗапросаИзменений = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Регистратор КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Регистраторы
	|ИЗ	
	|	" + ИмяТаблицыИст + ".Изменения
	|ГДЕ
	|	Узел = &УзелПолучатель	
	|;
	|ВЫБРАТЬ
	|	ВТ_Регистраторы.Ссылка 	КАК Ссылка,
	|	СУММА(
	|		ВЫБОР 
	|			КОГДА Записи.Регистратор ЕСТЬ NULL ТОГДА 0 
	|			ИНАЧЕ 1 
	|		КОНЕЦ
	|	) 						КАК КолЗаписей
	|ИЗ
	|	ВТ_Регистраторы
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	" + ИмяТаблицыИст + " КАК Записи
	|ПО
	|	ВТ_Регистраторы.Ссылка = Записи.Регистратор
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Регистраторы.Ссылка
	|";	
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Регистратор	
	|ПОМЕСТИТЬ ВТ_Ссылки
	|ИЗ		
	|	&Регистраторы КАК Регистраторы
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|";	
	
	ОбменДаннымиЧЗ.ДобавитьИмяТаблицы(ЗапросыИст, "ВТ_Ссылки", ТекстЗапроса, Ложь);
	
	#КонецОбласти
	
	#Область Записи
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Регистратор	
	|ИЗ		
	|	ВТ_Ссылки	
	|";
	
    ОбменДаннымиЧЗ.ДобавитьИмяТаблицы(ЗапросыИст, "Регистраторы_" + ИмяТаблицыИст, ТекстЗапроса, Истина, Истина);
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Записи.*
	|ИЗ	
	|	" + ИмяТаблицыИст + " КАК Записи
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	ВТ_Ссылки 
	|ПО 
	|	ВТ_Ссылки.Регистратор = Записи.Регистратор
	|";
	
    ОбменДаннымиЧЗ.ДобавитьИмяТаблицы(ЗапросыИст, "Записи_" + ИмяТаблицыИст, ТекстЗапроса, Истина, Истина);
	
	#КонецОбласти
	
	Возврат Новый Структура("ИмяТаблицыИст,РазмерПорции,ТекстЗапросаИзменений,ЗапросыИст,ОперИмпорта,ОперИмпорта_Представление", 
		ИмяТаблицыИст, 5000, ТекстЗапросаИзменений, ЗапросыИст, ОперИмпорта, ОперИмпорта_Представление);
КонецФункции //ПолучитьПравилоВыгрузки() Экспорт

Функция УстановитьПолучателей(Узлы, Данные) Экспорт
	Если МаркировкаС.ВерсияПлатформыПоРежимуСовместимости() >= "8.003.019" Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(Узлы, Данные);
	Иначе        
		Если ТипЗнч(Данные) = Тип("Массив") Тогда
			ВсегоСтрок  = Данные.Количество();
			Сч			= 0;
			Для каждого Ссылка Из Данные Цикл                          
				ПланыОбмена.ЗарегистрироватьИзменения(Узлы, Ссылка);		
				
				Сч = Сч + 1;
				Если Сч % 100 = 0 Тогда			
					ТекстСообщения = СтрШаблон("Регистрация данных к  обмену. Обработано: %1 из %2.", Сч, ВсегоСтрок);
					инт_ДлительныеОперации.СообщитьПрогресс(Формат(100*Сч/ВсегоСтрок, "ЧДЦ=2"), ТекстСообщения);
				КонецЕсли;
			КонецЦикла;		
		Иначе
			ПланыОбмена.ЗарегистрироватьИзменения(Узлы, Данные);
		КонецЕсли;		
	КонецЕсли;	
КонецФункции //УстановитьПолучателей(мСсылки, мПолучатели)

Функция ДобавитьУзелВПолучателей(СписокПолучателей, УзелПолучатель, УзелОтправитель, Загрузка) Экспорт
	Результат = Ложь;
	Если ЗначениеЗаполнено(УзелПолучатель) Тогда		
		ИмяПО = УзелПолучатель.Метаданные().Имя;
		Если УзелПолучатель <> Маркировка_ПИ.ЭтотУзел(ИмяПО) Тогда 
			Если Загрузка И УзелПолучатель = УзелОтправитель Тогда //туда-сюда гонять не будем		
			Иначе	
				СписокПолучателей.Добавить(УзелПолучатель);
				Результат = Истина;
			КонецЕсли;			
		КонецЕсли;
	КонецЕсли;	
	Возврат Результат;	
КонецФункции //ДобавитьУзелВПолучателей(СписокПолучателей, УзелПолучатель, УзелОтправитель, Загрузка) Экспорт

Функция ЕстьЗапущенныеЗаданияОбмена() Экспорт
	Результат = Ложь;
	
	ТекущееФЗ = ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание();
	
	ИмяМетода = Метаданные.РегламентныеЗадания.ОбменДаннымиЧЗ.ИмяМетода;
	
	Для Каждого ФЗ Из ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("ИмяМетода,Состояние", ИмяМетода, СостояниеФоновогоЗадания.Активно)) Цикл
		Если ТипЗнч(ТекущееФЗ) = Тип("ФоновоеЗадание") И ФЗ.УникальныйИдентификатор = ТекущееФЗ.УникальныйИдентификатор Тогда
		ИначеЕсли ФЗ.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			Результат = Истина;		
			Прервать;
		КонецЕсли;
	КонецЦикла;
		
	Возврат Результат;
КонецФункции //ЕстьЗапущенныеЗаданиеОбмена() Экспорт