Функция ПолучитьКоличествоИспользованныхКодов(Ссылка) Экспорт
	GLN = ПолучитьРеквизитШапки(Ссылка, "GLN");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "	
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка,
	|	Наименование
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	ПОДСТРОКА(Наименование, 1, 10) 	= &GLN
	|	И ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.ЛогистическаяУпаковка)
	|УПОРЯДОЧИТЬ ПО
	|	Наименование УБЫВ
	|";	
	
	Запрос.УстановитьПараметр("GLN", "0" + Лев(GLN, 9));
	
	Результат = 0;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Наименование) Тогда
		Код = СокрЛП(Выборка.Наименование);
		Код = Сред(Код,11);
		
		Результат = ПривестиСтрокуКЧислу(Лев(Код,7));		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПолучитьКоличествоИспользованныхКодов(Ссылка) Экспорт

Функция ПолучитьДействующийГЛН(ВладелецКодов) Экспорт
	Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	GLN
	|ИЗ
	|	Справочник.КодыGLN КАК КодыGLN
	|ГДЕ
	|	ВладелецКодов = &ВладелецКодов
	|	И НачалоДействия <= &ТекущаяДата 
	|	И (ОкончаниеДействия >= &ТекущаяДата ИЛИ ОкончаниеДействия=ДАТАВРЕМЯ(1,1,1)) 
	|УПОРЯДОЧИТЬ ПО
	|	НачалоДействия
	|";               
	
	Запрос.УстановитьПараметр("ТекущаяДата", 	НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ВладелецКодов", 	ВладелецКодов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.GLN) Тогда
		Результат = Выборка.GLN;	
	Иначе
		Если ТипЗнч(ВладелецКодов) = Тип("СправочникСсылка.Организации") Тогда
			Результат = ПолучитьРеквизитШапки(ВладелецКодов, "GLN");					
		КонецЕсли;		
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции //ПолучитьДействующийГЛН(ВладелецКодов)