
Процедура ПриЗаписи(Отказ, Замещение)
	РегистрироватьДопОбъекты	= Ложь;
	Если НЕ ДополнительныеСвойства.Свойство("РегистрироватьДопОбъекты",РегистрироватьДопОбъекты) Тогда
		РегистрироватьДопОбъекты = Ложь;		
	КонецЕсли; 
	
	Если РегистрироватьДопОбъекты Тогда
		ЗарегистрироватьДопОбъекты();	
	КонецЕсли; 
КонецПроцедуры

Процедура ЗарегистрироватьДопОбъекты()	
	МассивСсылок	= Новый Массив;	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если НЕ ПустаяСтрока(Запись.ВариантВыгрузки) И СтрНайти("РНК_ПНК,ПРМ_ПНК",СокрЛП(Запись.ВариантВыгрузки))<>0 Тогда
			Менеджер 	= ФР_ОбщегоНазначения_ПИ.ПолучитьМенеджер(Запись.ОбъектТип);
			
			МассивСсылок.Добавить(Менеджер.ПолучитьСсылку(Запись.ОбъектСсылкаУИД));					
		КонецЕсли; 					
	КонецЦикла;
	
	Если МассивСсылок.Количество()>0 Тогда
		Обработка	= Обработки.ВыгрузкаВоФранчБазу.Создать();
		
		Обработка.ЗарегистрироватьНоменклатуруПоНакладным(МассивСсылок);	
		Обработка.ЗарегистрироватьШКПоНакладным(МассивСсылок);
		Обработка.ЗарегистрироватьДекларацииПоНакладным(МассивСсылок);
	КонецЕсли; 
КонецПроцедуры
 
