
Перем Конвертер Экспорт;
Перем mapCode Экспорт;

// Для регламентного задания
Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт  
	
	КаталогФайловОзон = "\\srvfile-sk\FBS";
	КаталогФайловОзонPNG = КаталогФайловОзон + "\OZON-PNG";
	КаталогФайловОзонZPL = КаталогФайловОзон + "\Ozon-ZPL-TXT";
	
	Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-4991");
	
	НачалоЧасовНазад = 2;
	ОкончаниеЧасовНазад = 1;
	ВысотаКартинки = 311;
	Перезаписывать = Ложь;
	
	Если ТаблицаПараметров <> Неопределено Тогда 
		
		Для Каждого СтрокаТП Из ТаблицаПараметров Цикл 
			
			Если СтрокаТП.Имя = "НачалоЧасовНазад" Тогда			
				НачалоЧасовНазад = СтрокаТП.Значение;
			ИначеЕсли СтрокаТП.Имя = "ОкончаниеЧасовНазад" Тогда			
				ОкончаниеЧасовНазад = СтрокаТП.Значение;
			ИначеЕсли СтрокаТП.Имя = "ВысотаКартинки" Тогда
				Если ЗначениеЗаполнено(СтрокаТП.Значение) Тогда
					ВысотаКартинки = СтрокаТП.Значение;
				КонецЕсли;
			ИначеЕсли СтрокаТП.Имя = "Перезаписывать" Тогда			
				Перезаписывать = СтрокаТП.Значение;
			КонецЕсли;
			
		КонецЦикла;  

	КонецЕсли; 	

	ДатаНачала = ТекущаяДата() - НачалоЧасовНазад * 3600;
	ДатаОкончания = ДатаНачала + (НачалоЧасовНазад - ОкончаниеЧасовНазад) * 3600;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказКлиентаFBSТовары.Ссылка КАК Заказ,
	               |	ЗаказКлиентаFBSТовары.НомерЗаказа КАК НомерЗаказа
	               |ИЗ
	               |	Документ.ЗаказКлиентаFBS.Товары КАК ЗаказКлиентаFBSТовары
	               |ГДЕ
	               |	ЗаказКлиентаFBSТовары.Ссылка.Контрагент = &Контрагент
	               |	И ЗаказКлиентаFBSТовары.Ссылка.Проведен
	               |	И ЗаказКлиентаFBSТовары.Ссылка.Дата >= &ДатаНачала
	               |	И ЗаказКлиентаFBSТовары.Ссылка.Дата < &ДатаОкончания
	               |	И ЗаказКлиентаFBSТовары.НомерЗаказа <> """"
				   // Кельманов А.В. - Оптимизация работы - 2026.06.03 {
				   //|	И НЕ ЗаказКлиентаFBSТовары.Отменен
				   //|	И НЕ ЗаказКлиентаFBSТовары.ВычеркОфис
				   //|	И НЕ ЗаказКлиентаFBSТовары.ВычеркСклад
				   // Кельманов А.В. - Оптимизация работы - 2026.06.03 }
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗаказКлиентаFBSТовары.Ссылка.Дата,
	               |	ЗаказКлиентаFBSТовары.Ссылка,
	               |	ЗаказКлиентаFBSТовары.НомерСтроки";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ИмяФайлаTXT = КаталогФайловОзонZPL + "\" + Выборка.НомерЗаказа + ".txt";
		
		ФайлTXT = Новый Файл(ИмяФайлаTXT);
		
		Если Не ФайлTXT.Существует() Или Перезаписывать Тогда
			
			ИмяФайлаPNG = КаталогФайловОзонPNG + "\" + Выборка.НомерЗаказа + ".png";
			
			ФайлPNG = Новый Файл(ИмяФайлаPNG);
			
			Если ФайлPNG.Существует() Тогда
				
				Попытка
					
					ZPL = КартинкаВZPL(ИмяФайлаPNG, , ВысотаКартинки);
					
				Исключение
					
					ТекстОшибки = "Для номера заказа FBS " + Выборка.НомерЗаказа + " не удалось получить текст ZPL по файлу PNG: " + ОписаниеОшибки();
					
					ЗаписатьВЛог("Отладка", ТекстОшибки, "Информация");
				
					ZPL = Неопределено;
					
				КонецПопытки;
				
				Если ZPL <> Неопределено Тогда
					
					Текст = Новый ТекстовыйДокумент;
					Текст.ДобавитьСтроку(ZPL);
					Текст.Записать(ИмяФайлаTXT);
					
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура Установить(Отказ) Экспорт
	
	
КонецПроцедуры

Процедура Регистрация() Экспорт
	
	СсылкаНаАрхив = ПоместитьВоВременноеХранилище(ПолучитьМакет("AddInNativeConvertPDF_83_32"), Новый УникальныйИдентификатор);
	
	Результат = ПодключитьВнешнююКомпоненту(СсылкаНаАрхив, ИмяКомпоненты(), ТипВнешнейКомпоненты.Native);
	
	//Если Не Результат Тогда        
	//	
	//	УстановитьВнешнююКомпоненту(СсылкаНаАрхив);        
	//	
	//	Результат = ПодключитьВнешнююКомпоненту(СсылкаНаАрхив, ИмяКомпоненты(), ТипВнешнейКомпоненты.Native);
	//	
	//КонецЕсли;
		
КонецПроцедуры

Функция Инициализировать() Экспорт
	
	Если Конвертер = Неопределено Тогда
		Регистрация();
	КонецЕсли;
	
	Если Конвертер = Неопределено Тогда
		Конвертер = Новый("AddIn.AddInNative.AddInNativeExtension");
	КонецЕсли;
	
	Возврат Конвертер;
	
КонецФункции

Функция ИмяКомпоненты() Экспорт
	Возврат "AddInNative";
КонецФункции

Процедура ЗаписатьPdfВPng(ПолноеИмяФайлаPDF, Знач КаталогСохранения = "") Экспорт
	
	Инициализировать();
	Файл = Новый Файл(ПолноеИмяФайлаPDF);
	Если Не Файл.Существует() Тогда
		Возврат;
	КонецЕсли;
	ИмяФайла = Файл.ПолноеИмя;
	Конвертер.Прочитать(ИмяФайла);
	Конвертер.dpi = 200;
	Конвертер.ШиринаСтраницы = 0;
	Конвертер.ВысотаСтраницы = 0;
	Если ПустаяСтрока(КаталогСохранения) Тогда
		КаталогСохранения = Файл.Путь;
	КонецЕсли;
	Для i = 1 По Конвертер.КоличествоСтраниц() Цикл
		Конвертер.УстановитьТекущуюСтраницу(i);
		//ДвДанные = Конвертер.ПолучитьДанныеИзображения();
		Конвертер.ЗаписатьСтраницу(СтрШаблон("%1\%2_%3.png", КаталогСохранения, Файл.ИмяБезРасширения, i));
		Конвертер.ЗаписатьТекст(СтрШаблон("%1\%2_%3.txt", КаталогСохранения, Файл.ИмяБезРасширения, i));
		//Конвертер.ЗаписатьСтраницу(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1\%2_%3.png",Файл.Путь, Файл.ИмяБезРасширения, i), i);
		//Конвертер.ЗаписатьТекст(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1\%2_%3.txt",Файл.Путь, Файл.ИмяБезРасширения, i));
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТекстZPLПоФайлуPDF(ПолноеИмяФайлаPDF) Экспорт
	
	Инициализировать();
	
	Файл = Новый Файл(ПолноеИмяФайлаPDF);
	
	Если Не Файл.Существует() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяФайла = Файл.ПолноеИмя;
	
	Конвертер.Прочитать(ИмяФайла);
	Конвертер.dpi = 200;
	Конвертер.ШиринаСтраницы = 0;
	Конвертер.ВысотаСтраницы = 0;
	
	КаталогСохранения = КаталогВременныхФайлов();
	
	Если Конвертер.КоличествоСтраниц() <> 1 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Конвертер.УстановитьТекущуюСтраницу(1);
	
	ИмяФайлаPNG = КаталогСохранения + Файл.ИмяБезРасширения + ".png";
	
	Конвертер.ЗаписатьСтраницу(ИмяФайлаPNG);
	
	//ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайлаPNG);
	//
	//ZPL = "^XA
	//|~DYR:TEST1.PNG,P,P," + Формат(ДвоичныеДанные.Размер(), "ЧГ=0") + ",," + ПолучитьHexСтрокуИзДвоичныхДанных(ДвоичныеДанные) + "
	//|^FO0,0^IMR:TEST1.PNG^FS
	//|^IDR:TEST1.PNG^FS
	//|^XZ";
	
	ZPL = КартинкаВZPL(ИмяФайлаPNG);
		
	Возврат ZPL;
	
КонецФункции

Функция КартинкаВZPL(ИмяФайлаКартинки, УдалятьКартинку = Ложь, ВысотаКартинки = 311) Экспорт
	
	КартинкаPNG = Новый Картинка(ИмяФайлаКартинки);

	КартинкаBMP = КартинкаPNG.Преобразовать(ФорматКартинки.BMP);
	
	ОбрабатываемаяКартинка = Новый ОбрабатываемаяКартинка(КартинкаBMP);
	
	Если КартинкаBMP.Высота() > КартинкаBMP.Ширина() Тогда
		
		ОбрабатываемаяКартинка.Повернуть(90);
		
	КонецЕсли;
	
	ОбрабатываемаяКартинка.УстановитьРазмер(, ВысотаКартинки);
	
	КартинкаBMP = ОбрабатываемаяКартинка.ПолучитьКартинку();
		
	ДвоичныеДанные = КартинкаBMP.ПолучитьДвоичныеДанные();
    ЧтениеДанных = Новый ЧтениеДанных(ДвоичныеДанные,,ПорядокБайтов.LittleEndian);
		
	//BITMAPFILEHEADER
	
	bfType 		= ЧтениеДанных.ПрочитатьСимволы(2); //определяет тип файла. Здесь он должен быть BM	
    bfSize 		= ЧтениеДанных.ПрочитатьЦелое32();  //размер самого файла в байтах
    bfReserved1 = ЧтениеДанных.ПрочитатьЦелое16();
    bfReserved2 = ЧтениеДанных.ПрочитатьЦелое16();
    bfOffBits 	= ЧтениеДанных.ПрочитатьЦелое32();  //показывает, где начинается сам битовый массив относительно начала файла
	
    //BITMAPINFOHEADER  версия 3

    biSize			= ЧтениеДанных.ПрочитатьЦелое32(); // размер самой структуры
    biWidth 		= ЧтениеДанных.ПрочитатьЦелое32(); // ширина изображения в пикселах
    biHeight 		= ЧтениеДанных.ПрочитатьЦелое32(); // высота изображения в пикселах
    biPlanes 		= ЧтениеДанных.ПрочитатьЦелое16(); // задает количество плоскостей. Пока оно всегда устанавливается в 1
    biBitCount 		= ЧтениеДанных.ПрочитатьЦелое16(); // количество бит на пиксел
    biCompression 	= ЧтениеДанных.ПрочитатьЦелое32(); // тип сжатия
    biSizeImage 	= ЧтениеДанных.ПрочитатьЦелое32(); // размер изображения в байтах
    biXPelsPerMeter = ЧтениеДанных.ПрочитатьЦелое32(); // горизонтальное разрешение в пикселах на метр
    biYPelsPerMeter = ЧтениеДанных.ПрочитатьЦелое32(); // вертикальное разрешение в пикселах на метр
    biClrUsed 		= ЧтениеДанных.ПрочитатьЦелое32(); // количество используемых цветовых индексов в палитре
    biClrImportant 	= ЧтениеДанных.ПрочитатьЦелое32(); // количество важных цветов	
	
	BytesPerRow = biWidth / 8;
	BytesPerRow = ?(biWidth % 8 > 0, Цел(biWidth /8) + 1, BytesPerRow); 		
	
	BinaryByteCount = BytesPerRow * biHeight;
	
	//Если размер строки растра не кратен 4, то она дополняется от 1 до 3 пустыми (нулевыми) байтами, чтобы длина строки оказалась кратна параграфу
	Доп_Байтов = (4 - (biBitCount / 8) * biWidth % 4) % 4;
	
	БуферОпераций = Новый БуферДвоичныхДанных(1, ПорядокБайтов.LittleEndian);
	БуферОпераций[0] = ЧислоИзШестнадцатеричнойСтроки("0xFF");
	
	BlackLimit = 384;
	
	ПотокВПамяти = Новый ПотокВПамяти(BinaryByteCount);
	ЗаписьДанныхhexAscii = Новый ЗаписьДанных(ПотокВПамяти,, ПорядокБайтов.LittleEndian);
		
	БуферДвоичныхДанныхКопия = ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(ДвоичныеДанные);
	ЗаписьПотокВПамяти = Новый ПотокВПамяти(БуферДвоичныхДанныхКопия);
	ЗаписьПотокВПамяти.Перейти(bfOffBits, ПозицияВПотоке.Начало);
	
	БуферБелый = Новый БуферДвоичныхДанных(3, ПорядокБайтов.LittleEndian);
	БуферБелый.Инвертировать();
	БуферЧерный = Новый БуферДвоичныхДанных(3, ПорядокБайтов.LittleEndian);
	
	Для h = 1 По biHeight Цикл
		
		ДвоичнаяСтрока = "";
		Бит = 0;
		
		Для w = 1 По biWidth Цикл
			
	        Буфер_blue   = ЧтениеДанных.ПрочитатьВБуферДвоичныхДанных(1); // rgbtBlue, rgbtGreen, rgbtRed. Они идут именно в таком порядке.
	        Буфер_green  = ЧтениеДанных.ПрочитатьВБуферДвоичныхДанных(1);
			Буфер_red = ЧтениеДанных.ПрочитатьВБуферДвоичныхДанных(1);
			
			//Буфер_blue.ЗаписатьПобитовоеИ(0, БуферОпераций, 1);
			blue = Буфер_blue[0];
			
			//Буфер_green.ЗаписатьПобитовоеИ(0, БуферОпераций, 1);			
			green = Буфер_green[0];
			
			//Буфер_red.ЗаписатьПобитовоеИ(0, БуферОпераций, 1);
			red = Буфер_red[0];
			
			ЦветБита =  ?(blue + green + red > BlackLimit, "0", "1");
			ДвоичнаяСтрока = ДвоичнаяСтрока + ЦветБита;
			
			//Формирование новой картинки
			Если ЦветБита = "0" Тогда
				ЗаписьПотокВПамяти.Записать(БуферБелый, 0, 3);
			Иначе
				ЗаписьПотокВПамяти.Записать(БуферЧерный, 0, 3);
			КонецЕсли;
			
			Бит = Бит + 1;
			
			Если Бит = 8 Или w = biWidth Тогда
				
				ДвоичнаяСтрока = ДвоичнаяСтрока + Лев("00000000", 8 - СтрДлина(ДвоичнаяСтрока));
				КодСимвола = ЧислоИзДвоичнойСтроки("0b" + ДвоичнаяСтрока);
				
				ЗаписьДанныхhexAscii.ЗаписатьБайт(КодСимвола);
				
				ДвоичнаяСтрока = "";
				Бит = 0;
				
			КонецЕсли;
						
		КонецЦикла;
		
		Если Доп_Байтов > 0 Тогда
			ЧтениеДанных.Пропустить(Доп_Байтов);
			ЗаписьПотокВПамяти.Перейти(Доп_Байтов, ПозицияВПотоке.Текущая);
		КонецЕсли;
	
	КонецЦикла;
	
	ЗаписьДанныхhexAscii.Закрыть();
	
	ДвоичныеДанные = ПотокВПамяти.ЗакрытьИПолучитьДвоичныеДанные();
	
	ДанныеGF = ПолучитьHexСтрокуИзДвоичныхДанных(ДвоичныеДанные);
	
	//Расставим LF для правильного сжатия и наглядности
	i = BytesPerRow * 2;
	
	Пока i <= СтрДлина(ДанныеGF) Цикл
		ДанныеGF = Лев(ДанныеGF, i) + Символы.ПС + Прав(ДанныеGF, СтрДлина(ДанныеGF) - i);
		i = i + BytesPerRow * 2 + 1;
	КонецЦикла;
	
	////
	МассивСтроки = СтрРазделить(ДанныеGF, Символы.ПС);
	
	ДанныеGF = "";
	
	Счетчик = МассивСтроки.Количество();
	
	Пока Счетчик >= 1 Цикл
		
		ДанныеGF = ДанныеGF + МассивСтроки[Счетчик - 1] + Символы.ПС;
		
		Счетчик = Счетчик - 1;
		
	КонецЦикла;	
	////
	
	//Если compressHex тогда
	ДанныеGF = EncodeHexAscii(ДанныеGF, BytesPerRow);	
	//КонецЕсли;
	
	ZPL = "^XA
	|^FO0,0
	|^GFA," +
	Формат(СтрДлина(ДанныеGF), "ЧГ=0") + "," +
	Формат(BinaryByteCount, "ЧГ=0") + "," +
	Формат(BytesPerRow, "ЧГ=0") + ", " +
	ДанныеGF + 
	"^FS
	|^XZ
	|";

	Если УдалятьКартинку Тогда
		
		УдалитьФайлы(ИмяФайлаКартинки);
		
	КонецЕсли;
	
	Возврат ZPL;
	
КонецФункции

Функция EncodeHexAscii(code, BytesPerRow)
		
	mapCode = Новый Соответствие;
	mapCode.Вставить(1, "G");
	mapCode.Вставить(2, "H");
	mapCode.Вставить(3, "I");
	mapCode.Вставить(4, "J");
	mapCode.Вставить(5, "K");
	mapCode.Вставить(6, "L");
	mapCode.Вставить(7, "M");
	mapCode.Вставить(8, "N");
	mapCode.Вставить(9, "O");
	mapCode.Вставить(10, "P");
	mapCode.Вставить(11, "Q");
	mapCode.Вставить(12, "R");
	mapCode.Вставить(13, "S");
	mapCode.Вставить(14, "T");
	mapCode.Вставить(15, "U");
	mapCode.Вставить(16, "V");
	mapCode.Вставить(17, "W");
	mapCode.Вставить(18, "X");
	mapCode.Вставить(19, "Y");
	mapCode.Вставить(20, "g");
	mapCode.Вставить(40, "h");
	mapCode.Вставить(60, "i");
	mapCode.Вставить(80, "j");
	mapCode.Вставить(100, "k");
	mapCode.Вставить(120, "l");
	mapCode.Вставить(140, "m");
	mapCode.Вставить(160, "n");
	mapCode.Вставить(180, "o");
	mapCode.Вставить(200, "p");
	mapCode.Вставить(220, "q");
	mapCode.Вставить(240, "r");
	mapCode.Вставить(260, "s");
	mapCode.Вставить(280, "t");
	mapCode.Вставить(300, "u");
	mapCode.Вставить(320, "v");
	mapCode.Вставить(340, "w");
	mapCode.Вставить(360, "x");
	mapCode.Вставить(380, "y");
	mapCode.Вставить(400, "z");

	maxlinea = BytesPerRow * 2;
	sbCode = "";
	sbLinea = "";
	previousLine = null;
	counter = 0;
	aux = Лев(code, 1);
	firstChar = false;
	
	Длина_code = СтрДлина(code);
	Для i = 1 по Длина_code Цикл
		
		Если firstChar тогда
			aux = Сред(code, i, 1);
			firstChar = false;
			Продолжить;
		КонецЕсли;
		
		Если Сред(code, i, 1) = Символы.ПС тогда
			
		    Если counter >= maxlinea И aux = "0" тогда
		        sbLinea = sbLinea + ",";
		    ИначеЕсли counter >= maxlinea И aux = "F" тогда
		        sbLinea = sbLinea + "!";
		    ИначеЕсли counter > 20 тогда
		        multi20 = Цел(counter / 20) * 20;
		        resto20 = (counter % 20);
		        sbLinea = sbLinea + mapCode.Получить(multi20);
		        Если Не resto20 = 0 тогда
		            sbLinea = sbLinea + mapCode.Получить(resto20) + aux;
		        Иначе
		            sbLinea = sbLinea + aux;
		        КонецЕсли;
		    Иначе
		        sbLinea = sbLinea + mapCode.Получить(counter) + aux;
			КонецЕсли;
			
		    counter = 1;
		    firstChar = true;
			
		    Если sbLinea = previousLine тогда
		        sbCode = sbCode + ":";
		    Иначе
		        sbCode = sbCode + sbLinea;
		    КонецЕсли;
			
			previousLine = sbLinea;
		    sbLinea = "";
			Продолжить;
			
		КонецЕсли;
		
		Если aux = Сред(code, i, 1) тогда
			counter = counter + 1;
		Иначе
			Если counter > 20 тогда
				multi20 = Цел(counter / 20) * 20;
				resto20 = (counter % 20);
				sbLinea = sbLinea + mapCode.Получить(multi20);
				Если Не resto20 = 0 тогда
					sbLinea = sbLinea + mapCode.Получить(resto20) + aux;
				Иначе
					sbLinea = sbLinea + aux;
				КонецЕсли;
			Иначе
				sbLinea = sbLinea + mapCode.Получить(counter) + aux;
			КонецЕсли;
			counter = 1;
			aux = Сред(code, i, 1);
		КонецЕсли;
				
	КонецЦикла;
	
	Возврат sbCode;
	
КонецФункции

