#Область ОбработчикиКоманд

&НаКлиенте
Процедура ВыполнитьВыгрузкуКонтрагентов(Команда)
	ВыполнитьВыгрузкуНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьВыгрузкуНаСервере()
	
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	ОбъектОбработка.ВыполнитьВыгрузкуКонтрагентов(Истина, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыгрузкуАкций(Команда)
	ВыполнитьВыгрузкуАкцийНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьВыгрузкуАкцийНаСервере()
	
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	ОбъектОбработка.ВыполнитьВыгрузкуАкций(Истина, Истина);
	
КонецПроцедуры

#КонецОбласти