
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	если ЗначениеЗаполнено(объект.Ссылка) тогда
		Для Каждого СтрокаС Из ЗначенияСвойств Цикл
			МЗ = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();	
			
			МЗ.Объект	= Объект.Ссылка;
			МЗ.Свойство = СтрокаС.Свойство;
			МЗ.Значение	= СтрокаС.Значение;
			
			Если ЗначениеЗаполнено(МЗ.Значение) Тогда
				МЗ.Записать();
			Иначе
				МЗ.Удалить();		
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьЗначенияХарактеристик()
	если ЗначениеЗаполнено(Объект.Ссылка) тогда
		//ЗначенияСвойств = Справочники.РазмерыЧашки.ПолучитьЗначенияСвойств(Объект.Ссылка);
			ЗначениеВРеквизитФормы(Справочники.РазмерыЧашки.ПолучитьЗначенияСвойств(Объект.Ссылка),"ЗначенияСвойств");

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьЗначенияХарактеристик();
	
КонецПроцедуры

