
#Область ОбработчикиСобытий

#Область API_V1

// Ихсанов Д. А. Начало 26.05.2026 Наряд 0000000171 от 20.05.2026 11:18:21: e1cib/data/Документ.Наряд?ref=89690050568f680711f1542474905136
Функция ShareDataEndpointV1GET(Запрос)
	
	Возврат ОбменМаркетПлейс.ОбработкаЗапросаGETApiV1(Запрос);
	
КонецФункции

Функция ShareDataEndpointV1Other(Запрос)
	
	Возврат ОбменМаркетПлейс.ОбработкаПрочихЗапросовApiV1(Запрос);
	
КонецФункции
// Ихсанов Д. А. Конец 26.05.2026

#КонецОбласти

#КонецОбласти

Функция SearchColours(Запрос)
		//АдресВебСервиса ="http://srvrezbase-sk/od7/ws/SNL.1cws?wsdl";
		// /colours
		//	DataService
		//hq-test/ModProdCalcHS/hs/Reports/prodcalc
		// АдресхСервиса=МСтрук.Область(7,НомСт).Текст;
		//ВебАдр=АдресхСервиса;
		//HTTPСоединение = Новый HTTPСоединение(ВебАдр); 
		//
		//HTTPЗапрос = Новый HTTPЗапрос("?parstr=101"+Формат(Вариант,"ЧН=0; ЧГ=")+Формат(Период.ДатаНачала,"ДФ=yyyy-MM-dd")+Формат(Период.ДатаОкончания,"ДФ=yyyy-MM-dd")+УИДСотр+КодСотр);
		//
		//ИмяФайла = ПолучитьИмяВременногоФайла("mxl");
		//
		//Результат =  HTTPСоединение.Получить(HTTPЗапрос,ИмяФайла);
		//
		////ИмяФайла = ПолучитьИмяВременногоФайла();
		////ОтветСервера = ХТТП.Получить("/resourse", ИмяФайла, Новый Соответствие);
		//ТекстПоток = Новый ЧтениеТекста(ИмяФайла, КодировкаТекста.UTF8);
		//Текст = ТекстПоток.Прочитать();
		////сообщить(Текст);
		//Результат1.Прочитать(ИмяФайла);
	
	стрпар = Запрос.ПараметрыЗапроса.Получить("parstr");
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	СтрЦвет="#E2B2B2";
	//?parstr=10302019-06-012019-06-30000000026	
	стрОтвАвар = "
			|<html>
			|<head><meta charset=""utf-8"" />
			|</head>
			|<body align=""center"" width=100% bgcolor="""+СтрЦвет+""">
			|<title align=""center"" width=100% > Не установлены параметры запроса</title>
			|<div id=""wrapper"">   
			|<div id=""container"">   			
			|<header align=""center"" width=100%> Не установлены параметры запроса
			|</header>
			|</div></div></body></html>";
	ПолСтр="";
	Попытка
		стрТО=Лев(стрпар,3);
		ПолСтр=Сред(стрпар,4);
		//стрВО=Сред(стрпар,4,1);
		//стрДН = Сред(стрпар,5,10);
		//стрДО = Сред(стрпар,15,10);
		//УИДСотр="";
		//Если СтрДлина(стрпар)>=24 Тогда
		//	ТО = Сред(стрпар,25,1);
		//	КодСотр = Сред(стрпар,26);

		//КонецЕсли;	
	    //Ответ.УстановитьТелоИзСтроки(стрОтв);
		//НачДата=ГК_ОбщегоНазначенияНаСервере.ПолучитьДатуИзСтр(СокрЛП(стрДН));
		//КонДата=ГК_ОбщегоНазначенияНаСервере.ПолучитьДатуИзСтр(СокрЛП(стрДО));
	
	Исключение
		Ответ.УстановитьТелоИзСтроки(стрОтвАвар);
	    Возврат Ответ;
	КонецПопытки;	
	
		
	Если НЕ Лев(стрТО,1)="1" Тогда
		СтрЦвет="#E2B2E2";
	
		стрОтвАвар = "
			|<html>
			|<head><meta charset=""utf-8"" />
			|</head>
			|<body align=""center"" width=100% bgcolor="""+СтрЦвет+""">
			|<title align=""center"" width=100% > Не установлен тип отчета</title>
			|<div id=""wrapper"">   
			|<div id=""container"">   			
			|<header align=""center"" width=100%> Не установлен тип отчета "+Строка(Запрос)+"
			|</header>
			|</div></div></body></html>";
		Ответ.УстановитьТелоИзСтроки(стрОтвАвар);
	    Возврат Ответ;
	КонецЕсли;	

	СтрЦвет="#E2E2E2";
	
		стрОтв = "
			|<html>
			|<head><meta charset=""utf-8"" />
			|</head>
			|<body align=""center"" width=100% bgcolor="""+СтрЦвет+""">
			|<title align=""center"" width=100% > Не установлены параметры формирования отчета</title>
			|<div id=""wrapper"">   
			|<div id=""container"">   			
			|<header align=""center"" width=100%> Не установлены параметры формирования отчета
			|</header>
			|</div></div></body></html>";
	
	Ответ.УстановитьТелоИзСтроки(стрОтв);
	
	Попытка	
		МасКод=Новый Массив;
		
	
		
		ТабД=Новый ТабличныйДокумент;
	    ТабД.Область(1,1).Текст="Код номенклатуры";
		ТабД.Область(1,2).Текст="Цвет";
		Если Лев(стрТО,2)="11" И СтрДлина(ПолСтр) Тогда
			
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ПолСтр);
			Сода = ПрочитатьJSON(ЧтениеJSON);
			МасК=Сода["arr"];
			Для Каждого ТЭ Из МасК Цикл
				МасКод.Добавить(ТЭ);
			КонецЦикла;	
			//{"arr": ["Code1","code2"]}
			
			//ИндВО=ГК_ОбщегоНазначенияНаСервере.ПолЧиС(стрВО);
			//Отчет=Отчеты.ГК_ТабельныйУчетПоСотрудникам.Создать();
			//Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Отчет.СхемаКомпоновкиДанных.ВариантыНастроек[ИндВО].Настройки);
			//Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачП", НачалоДня(НачДата));
			//Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонП", КонецДня(КонДата));
			////Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонП1", КонецДня(КонДата));
			//
			//Если ТО="0" Тогда
			//	 //Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СотрудникЗУП", Справочники.ГК_СотрудникиКомпании.ПолучитьСсылку(Новый УникальныйИдентификатор(УИДСотр)));
			//	 Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Подразделение", Справочники.ГК_ПодразделенияОрганизаций.НайтиПоКоду(КодСотр));
			//Иначе	 
			//	МСотр=Новый Массив;
			//	МСотр.Добавить(Справочники.ГК_СотрудникиКомпании.НайтиПоКоду(ГК_ОбщегоНазначенияНаСервере.ПолЧиС(КодСотр)));
			//	Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("МСотрудникиЗУП", МСотр);

			//КонецЕсли;	
			//
			//Отчет.СкомпоноватьРезультат(ТабД);
			
	
		КонецЕсли;
		ДУ=?(МасКод.Количество()," И Номенклатура.Родитель.Код В (&МасКод) ","");
		
		Запрос=Новый Запрос;
		Запрос.Текст=
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|Номенклатура.Родитель.Код КАК РодКод,
		|Номенклатура.Цвет КАК Цвет
		|ИЗ
		|Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|НЕ Номенклатура.ЭтоГруппа
		|"+ДУ+"
		//|И Номенклатура.Родитель.Код В (&МасКод)
		|упорядочить по 1
		|";
		Если МасКод.Количество() Тогда
			Запрос.УстановитьПараметр("МасКод", МасКод);
		КонецЕсли;
		Выб=Запрос.Выполнить().Выбрать();
		
		л_Тек=2;
		Пока Выб.Следующий() Цикл

			Попытка
				ТабД.Область(л_Тек,1).Текст=СокрЛП(Выб.РодКод);
				ТабД.Область(л_Тек,2).Текст=СокрЛП(Выб.Цвет);
			Исключение
			конецПопытки;
			л_Тек=л_Тек+1;
		КонецЦикла;	
		
		Если Прав(стрТО,1)="2" Тогда
			имяФайла = ПолучитьИмяВременногоФайла( "xls" );
        	ТабД.Записать( имяФайла, ТипФайлаТабличногоДокумента.XLS );
        
		//	Текст = Новый ЧтениеТекста( имяФайла, КодировкаТекста.UTF8);
		//	ТекстHTML = Текст.Прочитать();
		//
		//	Текст.Закрыть();
		//	
		//	стрТело=НСтр("ru='"+ТекстHTML+"'");
			двДанные = Новый ДвоичныеДанные( имяФайла );
			Ответ.УстановитьТелоИзДвоичныхДанных(двДанные);
		ИначеЕсли Прав(стрТО,1)="1" Тогда
			
        	имяФайла = ПолучитьИмяВременногоФайла( "mxl" );
        	ТабД.Записать( имяФайла, ТипФайлаТабличногоДокумента.MXL );
        
        	Текст = Новый ЧтениеТекста( имяФайла, КодировкаТекста.UTF8);
        	ТекстHTML = Текст.Прочитать();
        
        	Текст.Закрыть();
        	
			стрТело=НСтр("ru='"+ТекстHTML+"'");	
			Ответ.УстановитьТелоИзСтроки(стрТело);	
			
		Иначе
			
        	имяФайла = ПолучитьИмяВременногоФайла( "html" );
        	ТабД.Записать( имяФайла, ТипФайлаТабличногоДокумента.HTML5 );
        
        	Текст = Новый ЧтениеТекста( имяФайла, КодировкаТекста.UTF8);
        	ТекстHTML = Текст.Прочитать();
        
        	Текст.Закрыть();
        	
			стрТело=НСтр("ru='"+ТекстHTML+"'");	
			Ответ.УстановитьТелоИзСтроки(стрТело);
		КонецЕсли;	
		УдалитьФайлы( имяФайла );
    Исключение
		СтрЦвет="#E2B2B2";
	
		стрОтвАвар = "
			|<html>
			|<head><meta charset=""utf-8"" />
			|</head>
			|<body align=""center"" width=100% bgcolor="""+СтрЦвет+""">
			|<title align=""center"" width=100% > Ошибка формирования отчета</title>
			|<div id=""wrapper"">   
			|<div id=""container"">   			
			|<header align=""center"" width=100%> Ошибка формирования отчета "+ОписаниеОшибки()+"
			|</header>
			|</div></div></body></html>";
	
	
		Ответ.УстановитьТелоИзСтроки(стрОтвАвар);
	    Возврат Ответ;
	КонецПопытки;
	
	
	
	Возврат Ответ;

КонецФункции


//+MARK-704 20251126 Михайловский
Функция LoadCorrBC(Запрос)
	ЕстьОшибки = Ложь;
	СтрокаОтвет = ЗагрузитьДанныеКоррШК(Запрос.ПолучитьТелоКакСтроку());  
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрокаОтвет);
		Сода = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
	Исключение
		ЕстьОшибки = Истина;
	КонецПопытки;
	КодОтвета = 200;
	Если ЕстьОшибки Тогда
		КодОтвета = 500;
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(КодОтвета);
	Ответ.УстановитьТелоИзСтроки(СтрокаОтвет);
	Возврат Ответ;
КонецФункции

Функция ЗагрузитьДанныеКоррШК(StrObjects) Экспорт
	
	стрРезультат = ВернутьСтруктуруРезультат(StrObjects);
	джЗапись = Новый ЗаписьJSON;
	джЗапись.УстановитьСтроку();
	ЗаписатьJSON(джЗапись, стрРезультат);
	Возврат джЗапись.Закрыть();
	
КонецФункции

Функция ВернутьСтруктуруРезультат(jsonstr)
	МассивОбработанных = Новый Массив;
	МассивКорр = Новый Массив;
	стрРезультат = Новый Структура("ResultArray, CorrArray, Error, ErrorDescription, ReturnMessage", МассивОбработанных, МассивКорр, "", "", "");
	Сообщение = "";
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(jsonstr);
		Сода = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		СтрКОбработке = Сода["ObjectsBC"]; 
	Исключение
		стрРезультат.Error = "readingjson_error";
		стрРезультат.ErrorDescription = "Error during reading json string error " + ОписаниеОшибки();
		Возврат стрРезультат;
	КонецПопытки;               
	
	Для Каждого СтрОбр Из СтрКОбработке  Цикл   
		
		Попытка
			УИДСпр = СокрЛП(СтрОбр["RefBC"]); 
			ЗнШК =  СокрЛП(СтрОбр["ValBC"]);
			ЗнШК1 =  СокрЛП(СтрОбр["ValBC1"]);
			СпрШК = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(УИДСпр)); 
			Если ЗначениеЗаполнено(СпрШК) Тогда
				МассивОбработанных.Добавить(УИДСпр);
				Если (СпрШК.ЗначениеШтрихкода = ЗнШК) И НЕ (СпрШК.ЗначениеШтрихкода = ЗнШК1)Тогда
					СпрШКОб = СпрШК.ПолучитьОбъект();
					Если НЕ СпрШКОб = Неопределено Тогда
						СпрШКОб.ЗначениеШтрихкода = ЗнШК1;
						СпрШКОб.Записать(); 
						МассивКорр.Добавить(УИДСпр);
						Рег = РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьОбъект(СпрШК);
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
		Исключение
			Сообщение = Сообщение + " Ошибка: " + ОписаниеОшибки();
		КонецПопытки;
	КонецЦикла;
	стрРезультат.ResultArray = МассивОбработанных;
	стрРезультат.CorrArray = МассивКорр;
	стрРезультат.ReturnMessage = Сообщение;
	Возврат стрРезультат;
КонецФункции //-MARK-704 20251126 Михайловский
