Перем мПлатежныеОперации Экспорт;
Перем ЗагрВидыДокументов;
Перем ЗагрРасчетныеСчета;
Перем ОбязательныеВрегЗАГРУЗКИ;
Перем ВидыОпераций;
Перем ПустаяДата;
Перем СписокЖурналов;
Перем СтруктураРеквизитов;	// Реквизиты загружаемого документа
Перем мВалютаРегламентированногоУчета Экспорт;
Перем СписокКонтрагентов Экспорт; // Список контрагентов не найденных в справочнике
Перем ЭтоНовыйДокумент;
       
// Структуры хранения настроечных данных при экспорте
Перем Экспорт_Выгружаемые;
Перем Экспорт_НеПустые;
Перем СтруктураЭкспорта;

// Строки с группами реквизитов платежных документов через запятую
Перем РеквизитыПлДок_Основные;
Перем РеквизитыПлДок_ВидПлатежаОплаты;
Перем РеквизитыПлДок_Квитанция;
Перем РеквизитыПлДок_Списано;
Перем РеквизитыПлДок_Поступило;
Перем РеквизитыПлДок_Плательщик;
Перем РеквизитыПлДок_ПлательщикНПР;
Перем РеквизитыПлДок_ПлательщикНПРНеОбязательные;
Перем РеквизитыПлДок_Получатель;
Перем РеквизитыПлДок_ПолучательНПР;
Перем РеквизитыПлДок_ПолучательНПРНеОбязательные;
Перем РеквизитыПлДок_БюджетПлатеж;
Перем РеквизитыПлДок_Назначение;
Перем РеквизитыПлДок_НазначениеНеОбязательные;
Перем РеквизитыПлДок_Акредитив;
Перем РеквизитыПлДок_УсловияОпл;
Перем РеквизитыПлДок_Дополнительные;

Перем РеквизитыПлДокЭкс_Основные;
Перем РеквизитыПлДокЭкс_ВидПлатежаОплаты;
Перем РеквизитыПлДокЭкс_Плательщик;
Перем РеквизитыПлДокЭкс_ПлательщикНПР;
Перем РеквизитыПлДокЭкс_Получатель;
Перем РеквизитыПлДокЭкс_ПолучательНПР;
Перем РеквизитыПлДокЭкс_БюджетПлатеж;

Перем мТекущаяВалютаВзаиморасчетов;

#Если Клиент Тогда


Процедура ВыборФайлаДляЗагрузки(Элемент) Экспорт
		
	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогФыбораФайла.Фильтр                      = "Текстовый файл (*.txt)|*.txt";
	ДиалогФыбораФайла.Заголовок                   = "Выберите файл для загрузки данных из клиента банка";
	ДиалогФыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогФыбораФайла.Расширение                  = "txt";
	ДиалогФыбораФайла.ИндексФильтра               = 0;
	ДиалогФыбораФайла.ПолноеИмяФайла              = Элемент.Значение;
	ДиалогФыбораФайла.ПроверятьСуществованиеФайла = Ложь;
	
	Если ДиалогФыбораФайла.Выбрать() Тогда
		Элемент.Значение = ДиалогФыбораФайла.ПолноеИмяФайла;
	КонецЕсли;

КонецПроцедуры
	
	
Функция ПолучитьВыборкуОрганизаций() Экспорт
	
	ЗапросПоОрганизациям = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Организация,
	|	Организации.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Организации КАК Организации
	|");
	
	Возврат ЗапросПоОрганизациям.Выполнить().Выбрать();
	
КонецФункции

//Печать отчета о выгруженных документах
//
Процедура ПечатьОтчетаОВыгруженныхПлатежныхДокументах(ПолеОтчета, Источник) Экспорт
	
	МакетОтчета = ПолучитьМакет("ОтчетОВыгруженныхПлатежныхДокументахНов");
	
	Шапка    = МакетОтчета.ПолучитьОбласть("Шапка");
	Строка   = МакетОтчета.ПолучитьОбласть("Строка");
	Подвал   = МакетОтчета.ПолучитьОбласть("Подвал");
	НазвОрг  = МакетОтчета.ПолучитьОбласть("НазваниеОрганизации");
	
	СведенияОбОрганизации = СведенияОЮрФизЛице(Организация);
	НазвОрг.Параметры.НазваниеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм");
	ПолеОтчета.Вывести(НазвОрг);
	
	Шапка.Параметры.ИмяОтчета 			= "Отчет о выгруженных платежных документах";
//	Шапка.Параметры.ИмяСуммыСписания 	= "На списание";
//	Шапка.Параметры.ИмяСуммыПоступления = "На поступление";
	Шапка.Параметры.ОписаниеПериода		= "по счету "+БанковскийСчет.НомерСчета+" с "+ Формат(НачПериода,"ДЛФ=D")  +" по " + Формат(КонПериода,"ДЛФ=D");
	ПолеОтчета.Вывести(Шапка);
	
	Индекс=0;
	ИтогоСуммаП = 0;
	ИтогоСуммаР = 0;
	
	Для Каждого СтрокаИсточника Из Источник Цикл
		
		Если СтрокаИсточника.Готовность <> -1 Тогда
			Продолжить;
		КонецЕсли;
		//Если СтрокаИсточника.ВидДокумента="Платежное поручение" Тогда
			Строка.Параметры.Плательщик     = СтрокаИсточника.ОрганизацияКратко;
			Строка.Параметры.ПлательщикСчет = СтрокаИсточника.ОрганизацияНомерСчета;
			Строка.Параметры.Получатель     = СтрокаИсточника.Контрагент;
			Строка.Параметры.ПолучательСчет = СтрокаИсточника.КонтрагентНомерСчета;				
			Строка.Параметры.СуммаСписание  = СтрокаИсточника.СуммаДокумента;
			//Строка.Параметры.СуммаПоступление = "";
			ИтогоСуммаР = ИтогоСуммаР + СтрокаИсточника.СуммаДокумента;
		//Иначе
		//	Строка.Параметры.Плательщик     = СтрокаИсточника.Контрагент;
		//	Строка.Параметры.ПлательщикСчет = СтрокаИсточника.КонтрагентНомерСчета;
		//	Строка.Параметры.Получатель     = СтрокаИсточника.Организация;
		//	Строка.Параметры.ПолучательСчет = СтрокаИсточника.ОрганизацияНомерСчета;				
		//	Строка.Параметры.СуммаСписание  = "";					
		//	Строка.Параметры.СуммаПоступление = СтрокаИсточника.СуммаДокумента;					
		//	ИтогоСуммаП = ИтогоСуммаП + СтрокаИсточника.СуммаДокумента;
		//КонецЕсли;
		
		Строка.Параметры.Документ       = СтрокаИсточника.Документ;
		Индекс = Индекс+1;
		Строка.Параметры.Индекс         = Индекс;
		
		ПолеОтчета.Вывести(Строка);
	
	КонецЦикла;
	
//	Подвал.Параметры.ИтогоСуммаП = ИтогоСуммаП;	
	Подвал.Параметры.ИтогоСуммаР = ИтогоСуммаР;	
	
	ПолеОтчета.Вывести(Подвал);
	
	ПолеОтчета.ОтображатьГруппировки = Ложь;
	ПолеОтчета.ОтображатьЗаголовки = Ложь;
	ПолеОтчета.ОтображатьСетку = Ложь;
	ПолеОтчета.ТолькоПросмотр = Истина;
	
КонецПроцедуры	


/////// НОВОЕ /////////////////////////////////////////////////////////////

Процедура УстановитьГотовность(ТекущаяГотовность, НоваяГотовность)

	Если ТекущаяГотовность < НоваяГотовность Тогда
		ТекущаяГотовность = НоваяГотовность;
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьНастройкуЗаполнения(ИмяДокумента,ИмяПараметра)
	
	Возврат НастройкаЗаполнения.Найти(ИмяДокумента,"Документ")[ИмяПараметра] 
	
КонецФункции
/////////////// Формирование управляющих данных ///////////////////////////

Процедура ЗаполнитьСтрокиРеквизитовПлДокументовДляИмпорта()
	
	РеквизитыПлДок_Основные = "Номер,Дата,Сумма";
	РеквизитыПлДок_ВидПлатежаОплаты = "ВидПлатежа,ВидОплаты";
	
	РеквизитыПлДок_Квитанция = "КвитанцияДата,КвитанцияВремя,КвитанцияСодержание";
	
	РеквизитыПлДок_Списано = "ДатаСписано";
	РеквизитыПлДок_Поступило = "ДатаПоступило";
	
	РеквизитыПлДок_Плательщик = "ПлательщикСчет,Плательщик,ПлательщикИНН,Плательщик1";
	РеквизитыПлДок_ПлательщикНПР = "ПлательщикРасчСчет,ПлательщикБанк1,ПлательщикБанк2,ПлательщикБИК,ПлательщикКорсчет";
	РеквизитыПлДок_ПлательщикНПРНеОбязательные = "Плательщик2,Плательщик3,Плательщик4";
	
	РеквизитыПлДок_Получатель = "ПолучательСчет,Получатель,ПолучательИНН,Получатель1";
	РеквизитыПлДок_ПолучательНПР = "ПолучательРасчСчет,ПолучательБанк1,ПолучательБанк2,ПолучательБИК,ПолучательКорсчет";
	РеквизитыПлДок_ПолучательНПРНеОбязательные = "Получатель2,Получатель3,Получатель4";
	
	РеквизитыПлДок_БюджетПлатеж = "СтатусСоставителя,ПлательщикКПП,ПолучательКПП,ПоказательКБК,ОКАТО,ПоказательОснования,ПоказательПериода,ПоказательНомера,ПоказательДаты,ПоказательТипа";
	
	РеквизитыПлДок_Назначение = "НазначениеПлатежа";
	РеквизитыПлДок_НазначениеНеОбязательные = "НазначениеПлатежа1,НазначениеПлатежа2,НазначениеПлатежа3,НазначениеПлатежа4,НазначениеПлатежа5,НазначениеПлатежа6";
	
	РеквизитыПлДок_Акредитив = "СрокПлатежа,Очередность";
	
	РеквизитыПлДок_УсловияОпл = "УсловиеОплаты1,УсловиеОплаты2,УсловиеОплаты3";
	
	РеквизитыПлДок_Дополнительные = "СрокАкцепта,ВидАккредитива,ПлатежПоПредст,ДополнУсловия,НомерСчетаПоставщика,ДатаОтсылкиДок";
	
КонецПроцедуры

Функция СоздатьСоответствиеИзСтроки(Знач СтрокаЧерезЗапятую)
	
	НовоеСоответствие = Новый Соответствие;

	ПозицияРазделителя = Найти(СтрокаЧерезЗапятую, ",");
	
	Пока ПозицияРазделителя > 0 Цикл
		ИмяИтема = Лев(СтрокаЧерезЗапятую, ПозицияРазделителя - 1);
		НовоеСоответствие.Вставить(ИмяИтема, Истина);
		СтрокаЧерезЗапятую = Сред(СтрокаЧерезЗапятую, ПозицияРазделителя + 1);
		ПозицияРазделителя = Найти(СтрокаЧерезЗапятую, ",");
		
	КонецЦикла;
	
	Если СтрДлина(СтрокаЧерезЗапятую) > 0 Тогда
		НовоеСоответствие.Вставить(СтрокаЧерезЗапятую, Истина);
		
	КонецЕсли;
		
	Возврат НовоеСоответствие;
	
КонецФункции

Процедура СформироватьСоответствиеВыгружаемых()
	
	Экспорт_Выгружаемые = СоздатьСоответствиеИзСтроки(
	РеквизитыПлДок_Основные + "," +
	РеквизитыПлДок_ВидПлатежаОплаты + "," +
	РеквизитыПлДок_Плательщик + "," +
	РеквизитыПлДок_ПлательщикНПР + "," +
	РеквизитыПлДок_ПлательщикНПРНеОбязательные + "," +
	РеквизитыПлДок_Получатель + "," +
	РеквизитыПлДок_ПолучательНПР + "," +
	РеквизитыПлДок_ПолучательНПРНеОбязательные + "," +
	РеквизитыПлДок_БюджетПлатеж + "," +
	РеквизитыПлДок_Назначение + "," +
	РеквизитыПлДок_НазначениеНеОбязательные + "," +
	РеквизитыПлДок_Акредитив + "," +
	РеквизитыПлДок_УсловияОпл + "," +
	РеквизитыПлДок_Дополнительные);
	
КонецПроцедуры

Процедура СформироватьСоответствияНеПустыхПриИмпорте()
	
	ИмпортНеПустые_ПлатежноеПоручение = СоздатьСоответствиеИзСтроки(
	"Номер,Дата,Сумма,ПлательщикСчет,ПлательщикИНН,ПолучательСчет,ПолучательИНН");
	
	// по наличию статуса составителя определяется что платеж - налоговый
	ИмпортНеПустые_ПлатежноеПоручениеБюджет = СоздатьСоответствиеИзСтроки(
	"Номер,Дата,Сумма,ПлательщикСчет,ПлательщикИНН,ПолучательСчет,ПолучательИНН," +
	"СтатусСоставителя,ПлательщикКПП,ПолучательКПП,ПоказательКБК,ОКАТО,ПоказательОснования," +
	"ПоказательПериода,ПоказательНомера,ПоказательДаты,ПоказательТипа");
	
	Импорт_НеПустые = Новый Массив;
	
	Импорт_НеПустые.Добавить(ИмпортНеПустые_ПлатежноеПоручение);
	Импорт_НеПустые.Добавить(ИмпортНеПустые_ПлатежноеПоручениеБюджет);
	
КонецПроцедуры

Процедура СформироватьТегиЗаголовка()
	
	СтрокаТегов = ВРЕГ("ВерсияФормата,Кодировка,Отправитель,Получатель,ДатаСоздания,ВремяСоздания,ДатаНачала,ДатаКонца");
	ТегиЗаголовка = СоздатьСоответствиеИзСтроки(СтрокаТегов);
	
	Импорт_Заголовок = Новый Структура(СтрокаТегов);
	
КонецПроцедуры

Процедура СформироватьТегиРасчетногоСчета()
	
	СтрокаТегов = ВРЕГ("ДатаНачала,ДатаКонца,РасчСчет,НачальныйОстаток,ВсегоПоступило,ВсегоСписано,КонечныйОстаток,КонецРасчСчет");
	ТегиРасчетногоСчета = СоздатьСоответствиеИзСтроки(СтрокаТегов);
	
КонецПроцедуры


///////////////// Начальное формирование таблицы и поля ////////////////////

Функция СоздатьКолонкуВТаблице(РабочаяТаблица, ТабПоле, Имя, ТипКолонки = Неопределено, Заголовок = "", СоответсвиеХарактеристик)
	
	Если ПустаяСтрока(Имя) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ШиринаКолонки = (СоответсвиеХарактеристик["Ширина"]);
	Если ТипЗнч(ШиринаКолонки) <> Тип("Число") Тогда
		ШиринаКолонки =  0;
	КонецЕсли;
	
	Если ТипЗнч(ТипКолонки) = Тип("ОписаниеТипов") Тогда
		РабочаяТаблица.Колонки.Добавить(Имя, ТипКолонки, Заголовок, ШиринаКолонки);
		
	Иначе
		РабочаяТаблица.Колонки.Добавить(Имя, , Заголовок, ШиринаКолонки);
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция СформироватьСтруктуруЭкспорта()

	СтруктураЭкспорта = новый структура;
	
	СтруктураЭкспорта.Вставить( "Выгружать",             "");  //     "_",                         
	СтруктураЭкспорта.Вставить( "Готовность",            "");  //     "Готовность",                 
	
	СтруктураЭкспорта.Вставить( "НомерДок",              "");  //     "№ Документа",                
	СтруктураЭкспорта.Вставить( "Номер",                 "");  //    "Номер",                     
	СтруктураЭкспорта.Вставить( "Дата",                  "");  //      "Дата",                      
	СтруктураЭкспорта.Вставить( "Операция",              "");  //     "Операция",                  
	СтруктураЭкспорта.Вставить( "СчетОрганизации",       "");  //   "Эл. Р/с организации",        
	СтруктураЭкспорта.Вставить( "НомерСчетаОрганизации", "");  //    "Р/с организации",          
	СтруктураЭкспорта.Вставить( "Сумма",                 "");  //   "Сумма",                     
	
	СтруктураЭкспорта.Вставить( "Контрагент",            "");  //    "Контрагент",                
	СтруктураЭкспорта.Вставить( "СчетКонтрагента",       "");  //  "Р/с контрагента",           
	СтруктураЭкспорта.Вставить( "НомерСчетаКонтрагента", "");  //     "Эл. Р/с контрагента",            
	
	СтруктураЭкспорта.Вставить( "КвитанцияДата",         "");  //       "Дата форм. квитанции",       
	СтруктураЭкспорта.Вставить( "КвитанцияВремя",        "");  //     "Время форм. квитанции",      
	СтруктураЭкспорта.Вставить( "КвитанцияСодержание",   "");  //     "Содержание квитанции",       
	
	СтруктураЭкспорта.Вставить( "ПлательщикСчет",        "");  //   "Расчетный счет плательщика", 
	СтруктураЭкспорта.Вставить( "Плательщик",            "");  //     "Плательщик",                 
	СтруктураЭкспорта.Вставить( "ПлательщикИНН",         "");  //   "ИНН плательщика",            
	СтруктураЭкспорта.Вставить( "Плательщик1",           "");  //     "Наименование плательщика",  
	СтруктураЭкспорта.Вставить( "Плательщик2",           "");  //   "Расчетный счет плательщика", 
	СтруктураЭкспорта.Вставить( "Плательщик3",           "");  //     "Банк плательщика",          
	СтруктураЭкспорта.Вставить( "Плательщик4",           "");  //     "Город банка плательщика",   
	СтруктураЭкспорта.Вставить( "ПлательщикРасчСчет",    "");  //   "Корсчет банка плательщика",  
	СтруктураЭкспорта.Вставить( "ПлательщикБанк1",       "");  //     "РЦ банка плательщика",       
	СтруктураЭкспорта.Вставить( "ПлательщикБанк2",       "");  //     "Город РЦ банка плательщика", 
	СтруктураЭкспорта.Вставить( "ПлательщикБИК",         "");  //    "БИК РЦ банка плательщика",  
	СтруктураЭкспорта.Вставить( "ПлательщикКорсчет",     "");  //   "Корсчет РЦ банка плат.",     
	
	СтруктураЭкспорта.Вставить( "ПолучательСчет",        "");  //   "Расчетный счет получателя",  
	СтруктураЭкспорта.Вставить( "Получатель",            "");  //     "Получатель",                 
	СтруктураЭкспорта.Вставить( "ПолучательИНН",         "");  //   "ИНН получателя",             
	СтруктураЭкспорта.Вставить( "Получатель1",           "");  //     "Наименование получателя",    
	СтруктураЭкспорта.Вставить( "Получатель2",           "");  //   "Расчетный счет получателя",  
	СтруктураЭкспорта.Вставить( "Получатель3",           "");  //     "Банк получателя",            
	СтруктураЭкспорта.Вставить( "Получатель4",           "");  //     "Город банка получателя",     
	СтруктураЭкспорта.Вставить( "ПолучательРасчСчет",    "");  //   "Корсчет банка получателя",   
	СтруктураЭкспорта.Вставить( "ПолучательБанк1",       "");  //     "РЦ банка получателя",        
	СтруктураЭкспорта.Вставить( "ПолучательБанк2",       "");  //     "Город РЦ банка получателя",  
	СтруктураЭкспорта.Вставить( "ПолучательБИК",         "");  //    "БИК РЦ банка получателя",   
	СтруктураЭкспорта.Вставить( "ПолучательКорсчет",     "");  //   "Корсчет РЦ банка пол.",      
	
	СтруктураЭкспорта.Вставить( "ВидПлатежа",            "");  //     "Вид платежа",                
	СтруктураЭкспорта.Вставить( "ВидОплаты",             "");  //   "Вид оплаты",                 
	СтруктураЭкспорта.Вставить( "ПеречислениеВБюджет",   "");  //   "Перечисление в бюджет",                 
	СтруктураЭкспорта.Вставить( "ВидПеречисленияВБюджет","");  //   "Вид перечисления в бюджет",                 
	
	СтруктураЭкспорта.Вставить( "СтатусСоставителя",     "");  //   "Статус составителя",         
	СтруктураЭкспорта.Вставить( "ПлательщикКПП",         "");  //   "КПП плательщика",            
	СтруктураЭкспорта.Вставить( "ПолучательКПП",         "");  //   "КПП получателя",             
	СтруктураЭкспорта.Вставить( "ПоказательКБК",         "");  //   "Показатель КБК",             
	СтруктураЭкспорта.Вставить( "ОКАТО",                 "");  //   "ОКАТО",                      
	СтруктураЭкспорта.Вставить( "ПоказательОснования",   "");  //   "Пок. основания",             
	СтруктураЭкспорта.Вставить( "ПоказательПериода",     "");  //   "Пок. нал. периода",          
	СтруктураЭкспорта.Вставить( "ПоказательНомера",      "");  //     "Пок. номера док.",           
	СтруктураЭкспорта.Вставить( "ПоказательДаты",        "");  //     "Пок. даты док.",             
	СтруктураЭкспорта.Вставить( "ПоказательТипа",        "");  //   "Пок. типа платежа",          
	
	СтруктураЭкспорта.Вставить( "СрокПлатежа",           "");  //       "Срок действия аккредитива",  
	СтруктураЭкспорта.Вставить( "Очередность",           "");  //   "Очередность платежа",        
	
	СтруктураЭкспорта.Вставить( "НазначениеПлатежа",     "");  //     "Назначение платежа",         
	СтруктураЭкспорта.Вставить( "НазначениеПлатежа1",    "");  //     "Назначение платежа, стр. 1", 
	СтруктураЭкспорта.Вставить( "НазначениеПлатежа2",    "");  //     "Назначение платежа, стр. 2", 
	СтруктураЭкспорта.Вставить( "НазначениеПлатежа3",    "");  //     "Назначение платежа, стр. 3", 
	СтруктураЭкспорта.Вставить( "НазначениеПлатежа4",    "");  //     "Назначение платежа, стр. 4", 
	СтруктураЭкспорта.Вставить( "НазначениеПлатежа5",    "");  //     "Назначение платежа, стр. 5", 
	СтруктураЭкспорта.Вставить( "НазначениеПлатежа6",    "");  //     "Назначение платежа, стр. 6", 
	
	СтруктураЭкспорта.Вставить( "СрокАкцепта",           "");  //    "Срок акцепта",               
	СтруктураЭкспорта.Вставить( "ВидАккредитива",        "");  //     "Вид аккредитива",            
	СтруктураЭкспорта.Вставить( "УсловиеОплаты1",        "");  //     "Условие оплаты, стр. 1",     
	СтруктураЭкспорта.Вставить( "УсловиеОплаты2",        "");  //     "Условие оплаты, стр. 2",     
	СтруктураЭкспорта.Вставить( "УсловиеОплаты3",        "");  //     "Условие оплаты, стр. 3",     
	СтруктураЭкспорта.Вставить( "ПлатежПоПредст",        "");  //     "Платеж по представлению",    
	СтруктураЭкспорта.Вставить( "ДополнУсловия",         "");  //     "Дополнительные условия",     
	СтруктураЭкспорта.Вставить( "НомерСчетаПоставщика",  "");  //     "№ счета поставщика",         
	СтруктураЭкспорта.Вставить( "ДатаОтсылкиДок",        "");  //       "Дата отсылки документов",    
	
	СтруктураЭкспорта.Вставить( "Документ",              "");  //   "Источник",                  
	СтруктураЭкспорта.Вставить( "СекцияДокумент",        "");  //     "Выгрузка",                   
	
	СтруктураЭкспорта.Вставить( "ОписаниеОшибок",        "");  //     "Замечания",                  
	СтруктураЭкспорта.Вставить( "ТипДокумента",          "");  //    "Тип пл. документа",    
	
	Возврат СтруктураЭкспорта;
	
КонецФункции

Процедура СформироватьСтруктуруТаблицыИмпорта(Таб, ТабПоле) Экспорт
	
	КлючиСтруктуры = "ИзменятьНастройку,ИзменятьПозицию,Видимость,Доступность,ТолькоПросмотр,ИзменениеРазмера,Ширина";
	
	Видимая      = Новый Структура(КлючиСтруктуры, Истина, Ложь,   Истина, Истина, Истина, Истина,  0);
	Видимая020   = Новый Структура(КлючиСтруктуры, Истина, Ложь,   Истина, Истина, Истина, Ложь,    2);
	Видимая080   = Новый Структура(КлючиСтруктуры, Истина, Ложь,   Истина, Истина, Истина, Ложь,   10);
	Видимая120   = Новый Структура(КлючиСтруктуры, Истина, Ложь,   Истина, Истина, Истина, Ложь,   15);
	Видимая160   = Новый Структура(КлючиСтруктуры, Истина, Ложь,   Истина, Истина, Истина, Ложь,   20);
	
	НеВидимая    = Новый Структура(КлючиСтруктуры, Истина, Ложь,   Ложь,   Истина, Истина, Истина,  0);
	
	Т_Булево    = Новый ОписаниеТипов("Булево");
	
	Т_Число15_2 = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 2));
	Т_Число1    = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(1));
	Т_Число10   = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10));
	
	Т_Строка    = Новый ОписаниеТипов("Строка");
	Т_Строка02  = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(2));
	Т_Строка09  = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(9));
	Т_Строка10  = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(10));
	Т_Строка11  = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(11));
	Т_Строка12  = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(12));
	Т_Строка20  = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(20));
	
	Т_Дата      = Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	Т_Документ  = Новый ОписаниеТипов("ДокументСсылка.ПлатежноеПоручениеИсходящее,ДокументСсылка.ПлатежноеПоручениеВходящее,ДокументСсылка.ПлатежныйОрдерПоступлениеДенежныхСредств,ДокументСсылка.ПлатежныйОрдерСписаниеДенежныхСредств,ДокументСсылка.ПлатежноеТребованиеВыставленное");
	Т_ПлОрдер   = Новый ОписаниеТипов("ДокументСсылка.ПлатежныйОрдерСписаниеДенежныхСредств");
	Т_Контрагент = Новый ОписаниеТипов("СправочникСсылка.Контрагенты,СправочникСсылка.Организации, Строка");
	Т_БанкСчет   = Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета, Строка");
	Т_ВидыОпераций  = Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОперацийППИсходящее,ПеречислениеСсылка.ВидыОперацийСписаниеБезналичныхДенежныхСредств,ПеречислениеСсылка.ВидыОперацийПоступлениеБезналичныхДенежныхСредств");
	Т_Договоры   = Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов, Строка");
	Т_СтатьяДДС   = Новый ОписаниеТипов("СправочникСсылка.СтатьиДвиженияДенежныхСредств");
	
	
	Таб.Очистить();
	Таб.Колонки.Очистить();
	
	  //Имя, заголовок, выгружать, не пустая, ширина, изменять размер
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "Проведен",             Т_Булево,    "",                          Видимая020);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "Загружать",            Т_Булево,    "_",                          Видимая020);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "Готовность",           Т_Число1,    "Готовность",                 НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "НомерСтроки",          Т_Число10,   "Номер строки",                Видимая120);
	
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "НомерДок",             Т_Строка,    "№ Документа",                Видимая120);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "Номер",                Т_Строка,    "Номер",                      НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ДатаДок",              Т_Дата,      "Дата",                       Видимая120);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "Дата",                 Т_Строка,    "Дата (из файла)",            НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "Операция",             Т_Строка,    "Операция",                   Видимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "СчетОрганизации",      Т_БанкСчет,  "Р/с организации",            Видимая160);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "СуммаДокумента",       Т_Число15_2, "Сумма",                      Видимая120);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "СуммаСписано",         Т_Число15_2, "Сумма списания",             Видимая120);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "СуммаПоступило",       Т_Число15_2, "Сумма поступления",          Видимая120);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "Сумма",                Т_Строка,    "Сумма (из файла)",           НеВидимая);
	
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "Контрагент",           Т_Контрагент,"Контрагент",                 Видимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "СчетКонтрагента",      Т_БанкСчет,  "Р/с контрагента",            Видимая160);
	
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "КвитанцияДата",        Т_Строка,    "Дата форм. квитанции",       НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "КвитанцияВремя",       Т_Строка,    "Время форм. квитанции",      НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "КвитанцияСодержание",  Т_Строка,    "Содержание квитанции",       НеВидимая);
	
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "Списано",              Т_Дата,      "Списано",                    Видимая120);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ДатаСписано",          Т_Строка,    "Списано",                    НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "Поступило",            Т_Дата,      "Поступило",                  Видимая120);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ДатаПоступило",        Т_Строка,    "Поступило",                  НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ДатаПроведения",       Т_Дата,      "Дата",                       Видимая120);
	
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ПлательщикСчет",       Т_Строка20,  "Расчетный счет плательщика", НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "Плательщик",           Т_Строка,    "Плательщик",                 НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ПлательщикИНН",        Т_Строка12,  "ИНН плательщика",            НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "Плательщик1",          Т_Строка,    "Наименование плательщика",   НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "Плательщик2",          Т_Строка20,  "Расчетный счет плательщика", НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "Плательщик3",          Т_Строка,    "Банк плательщика",           НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "Плательщик4",          Т_Строка,    "Город банка плательщика",    НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ПлательщикРасчСчет",   Т_Строка20,  "Корсчет банка плательщика",  НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ПлательщикБанк1",      Т_Строка,    "РЦ банка плательщика",       НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ПлательщикБанк2",      Т_Строка,    "Город РЦ банка плательщика", НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ПлательщикБИК",        Т_Строка09,  "БИК РЦ банка плательщика",   НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ПлательщикКорсчет",    Т_Строка20,  "Корсчет РЦ банка плат.",     НеВидимая);
	
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ПолучательСчет",       Т_Строка20,  "Расчетный счет получателя",  НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "Получатель",           Т_Строка,    "Получатель",                 НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ПолучательИНН",        Т_Строка12,  "ИНН получателя",             НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "Получатель1",          Т_Строка,    "Наименование получателя",    НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "Получатель2",          Т_Строка20,  "Расчетный счет получателя",  НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "Получатель3",          Т_Строка,    "Банк получателя",            НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "Получатель4",          Т_Строка,    "Город банка получателя",     НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ПолучательРасчСчет",   Т_Строка20,  "Корсчет банка получателя",   НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ПолучательБанк1",      Т_Строка,    "РЦ банка получателя",        НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ПолучательБанк2",      Т_Строка,    "Город РЦ банка получателя",  НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ПолучательБИК",        Т_Строка09,   "БИК РЦ банка получателя",   НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ПолучательКорсчет",    Т_Строка20,  "Корсчет РЦ банка пол.",      НеВидимая);
	
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ВидПлатежа",           Т_Строка,    "Вид платежа",                НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ВидОплаты",            Т_Строка02,  "Вид оплаты",                 НеВидимая);
	
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "СтатусСоставителя",    Т_Строка02,  "Статус составителя",         НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ПлательщикКПП",        Т_Строка09,  "КПП плательщика",            НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ПолучательКПП",        Т_Строка09,  "КПП получателя",             НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ПоказательКБК",        Т_Строка20,  "Показатель КБК",             НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ОКАТО",                Т_Строка11,  "ОКАТО",                      НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ПоказательОснования",  Т_Строка02,  "Пок. основания",             НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ПоказательПериода",    Т_Строка10,  "Пок. нал. периода",          НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ПоказательНомера",     Т_Строка,    "Пок. номера док.",           НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ПоказательДатыДок",    Т_Дата,      "Пок. даты док.",             НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ПоказательДаты",       Т_Строка,    "Пок. даты",                  НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ПоказательТипа",       Т_Строка02,  "Пок. типа платежа",          НеВидимая);
	
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "СрокПлатежаДок",       Т_Дата,      "Срок действия акк.",         НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "СрокПлатежа",          Т_Строка,    "Срок действия аккредитива",  НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "Очередность",          Т_Строка02,  "Очередность (из файла)",     НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ОчередностьПлатежа",   Т_Число1,    "Очередность",                НеВидимая);
	
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "НазначениеПлатежа",    Т_Строка,    "Назначение платежа",         Видимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "НазначениеПлатежа1",   Т_Строка,    "Назначение платежа, стр. 1", НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "НазначениеПлатежа2",   Т_Строка,    "Назначение платежа, стр. 2", НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "НазначениеПлатежа3",   Т_Строка,    "Назначение платежа, стр. 3", НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "НазначениеПлатежа4",   Т_Строка,    "Назначение платежа, стр. 4", НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "НазначениеПлатежа5",   Т_Строка,    "Назначение платежа, стр. 5", НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "НазначениеПлатежа6",   Т_Строка,    "Назначение платежа, стр. 6", НеВидимая);
	
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "СрокАкцептаДок",       Т_Число10,   "Срок акцепта",               НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "СрокАкцепта",          Т_Строка,    "Срок акцепта (из файла)",    НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ВидАккредитива",       Т_Строка,    "Вид аккредитива",            НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "УсловиеОплаты1",       Т_Строка,    "Условие оплаты, стр. 1",     НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "УсловиеОплаты2",       Т_Строка,    "Условие оплаты, стр. 2",     НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "УсловиеОплаты3",       Т_Строка,    "Условие оплаты, стр. 3",     НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ПлатежПоПредст",       Т_Строка,    "Платеж по представлению",    НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ДополнУсловия",        Т_Строка,    "Дополнительные условия",     НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "НомерСчетаПоставщика", Т_Строка,    "№ счета поставщика",         НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ДатаОтсылки",          Т_Дата,      "Дата отсылки",               НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ДатаОтсылкиДок",       Т_Строка,    "Дата отсылки документов",    НеВидимая);
	
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "Документ",             Т_Документ,  "Источник",                   НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ПлатежныйОрдер",       Т_ПлОрдер,   "Ордер",                      НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "СекцияДокумент",       Т_Строка,    "Выгрузка",                   НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "Договор",              Т_Договоры,  "Договор",                    Видимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "СтатьяДДС",            Т_СтатьяДДС,  "Статья ДДС",                 Видимая);
	
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ОписаниеОшибок",       Т_Строка,    "Замечания",                  Видимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ТипДокумента",         Т_Число10,   "Тип пл. документа",          НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ВидДокумента",         Т_Строка,    "Вид документа",              НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ИмяДокумента",         Т_Строка,    "Имя документа",              НеВидимая);
	СоздатьКолонкуВТаблице(Таб, ТабПоле, "ВидОперации",          Т_ВидыОпераций,"Вид операции пл. документа", Видимая);
	
КонецПроцедуры

Процедура СформироватьСтруктуруТаблицыРасчСчетов(Таб) Экспорт
	
	КлючиСтруктуры = "ИзменятьНастройку,ИзменятьПозицию,Видимость,Доступность,ТолькоПросмотр,ИзменениеРазмера,Ширина";
	Видимая      = Новый Структура(КлючиСтруктуры, Истина, Ложь,   Истина, Истина, Истина, Истина,  0);
	
	Т_Число15_2  = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 2));
	Т_Строка     = Новый ОписаниеТипов("Строка");
	Т_Дата       = Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	Т_Справочник = Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета");
	
	Таб.Очистить();
	Таб.Колонки.Очистить();
	
	СоздатьКолонкуВТаблице(Таб, Неопределено, "ДатаНачала",       Т_Строка,     "Дата начала интервала",      Видимая);
	СоздатьКолонкуВТаблице(Таб, Неопределено, "ДатаКонца",        Т_Строка,     "Дата конца интервала",       Видимая);
	СоздатьКолонкуВТаблице(Таб, Неопределено, "РасчСчет",         Т_Строка,     "Расчетный счет организации", Видимая);
	СоздатьКолонкуВТаблице(Таб, Неопределено, "НачальныйОстаток", Т_Строка,     "Начальный остаток",          Видимая);
	СоздатьКолонкуВТаблице(Таб, Неопределено, "ВсегоПоступило",   Т_Строка,     "Обороты входящих платежей",  Видимая);
	СоздатьКолонкуВТаблице(Таб, Неопределено, "ВсегоСписано",     Т_Строка,     "Обороты исходящих платежей", Видимая);
	СоздатьКолонкуВТаблице(Таб, Неопределено, "КонечныйОстаток",  Т_Строка,     "Конечный остаток",           Видимая);
	
	СоздатьКолонкуВТаблице(Таб, Неопределено, "Начало",           Т_Дата,       "Начало интервала",           Видимая);
	СоздатьКолонкуВТаблице(Таб, Неопределено, "Конец",            Т_Дата,       "Конец интервала",            Видимая);
	СоздатьКолонкуВТаблице(Таб, Неопределено, "РасчетныйСчет",    Т_Справочник, "Расчетный счет",            Видимая);
	СоздатьКолонкуВТаблице(Таб, Неопределено, "НачальнаяСумма",   Т_Число15_2,  "НачальнаяСумма",             Видимая);
	СоздатьКолонкуВТаблице(Таб, Неопределено, "Поступило",        Т_Число15_2,  "Всего поступило",            Видимая);
	СоздатьКолонкуВТаблице(Таб, Неопределено, "Списано",          Т_Число15_2,  "Всего списано",              Видимая);
	СоздатьКолонкуВТаблице(Таб, Неопределено, "КонечнаяСумма",    Т_Число15_2,  "Конечная сумма",             Видимая);
	
КонецПроцедуры

////////////// ОБЩИЕ //////////////////////////////////////////////////

Процедура ДобавитьВСтроку(Буфер, НоваяСтрока)
	
	Если ПустаяСтрока(Буфер) Тогда
		Буфер = НоваяСтрока;
		
	Иначе
		Буфер = Буфер + Символы.ПС + НоваяСтрока;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПривестиЗначение(Значение)
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		Возврат СокрЛП(Значение);
		
	ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат Формат(Значение, "ЧРД=.; ЧРГ=' '; ЧГ=0");
		
	ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда
		Возврат Формат(Значение, "ДФ=dd.MM.yyyy");
		
	Иначе
		Возврат "";
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДатуИзСтроки(Приемник, Источник)
	
	Буфер = Источник;
	
	ПозицияТочки = Найти(Буфер, ".");
	
	Если ПозицияТочки = 0 Тогда
		Возврат "Неверный формат строки с датой";
	КонецЕсли;
	
	ЧислоДаты = Лев(Буфер, ПозицияТочки - 1);
	Буфер = Сред(Буфер, ПозицияТочки + 1);
	
	ПозицияТочки = Найти(Буфер, ".");
	
	Если ПозицияТочки = 0 Тогда
		Возврат "Неверный формат строки с датой";
	КонецЕсли;
	
	МесяцДаты = Лев(Буфер, ПозицияТочки - 1);
	ГодДаты = Сред(Буфер, ПозицияТочки + 1);
	Если СтрДлина(ГодДаты) = 2 Тогда
		Если Число(ГодДаты) < 50 Тогда
			ГодДаты = "20" + ГодДаты;
		Иначе
			ГодДаты = "19" + ГодДаты ;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		Приемник = Дата(Число(ГодДаты), Число(МесяцДаты), Число(ЧислоДаты));
		
	Исключение
		Возврат "Не удалось преобразовать строку в дату";
		
	КонецПопытки;
	
	Возврат Приемник;
	
КонецФункции

Процедура ДобавитьЗамечание(СтруктураДокумента, НоваяГотовность, ТекстЗамечания)
	
	УстановитьГотовность(СтруктураДокумента.Готовность, НоваяГотовность);
	ДобавитьВСтроку(СтруктураДокумента.ОписаниеОшибок, ТекстЗамечания);
	
КонецПроцедуры

Функция ОрганизацияПлательщик(ВидДокумента)
	
	Если (ВидДокумента = "ПлатежноеПоручениеВходящее")
		ИЛИ (ВидДокумента = "ПлатежноеТребованиеВыставленное")
		ИЛИ (ВидДокумента = "ПлатежныйОрдерПоступлениеДенежныхСредств") Тогда
		Возврат Ложь;
		
	Иначе
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции

// Открывает для просмотра текстовой документ
//  
Процедура ОткрытьФайлДляПросмотра(Элемент, Кодировка, Заголовок) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ФайлНаДиске = Новый Файл(Элемент.Значение);
	Если Не ФайлНаДиске.Существует() Тогда
		Предупреждение("Не найден файл!");
		Возврат;
	КонецЕсли;
	
	Текст = Новый ТекстовыйДокумент();
	Если Кодировка = "DOS" Тогда
		Кодир = КодировкаТекста.OEM;
	Иначе
		Кодир = КодировкаТекста.ANSI;
	КонецЕсли;
	Текст.Прочитать(Элемент.Значение, Кодир);
	Текст.Показать(Заголовок,Элемент.Значение);
	
КонецПроцедуры

////////////// ПОДОТОВКА ВЫГРУЗКИ //////////////////////////////////////////////////

Процедура ЗаполнитьДокументыНаЭкспорт(ДокументыНаЭкспорт) Экспорт
	
	ПлатежныеДокументы.Очистить();
	
	//ВыгружатьПлатПоручения  = ТаблицаДокументов.Найти("Платежное поручение", "Название").Пометка;
	ВыгружатьПлатТребования = ТаблицаДокументов.Найти("Заявка на оплату", "Название").Пометка;
	
	Если  НЕ ВыгружатьПлатТребования Тогда
		Предупреждение("Необходимо отметить хотя бы один из выгружаемых видов платежных документов.");
		Возврат;
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(БанковскийСчет) Тогда
		Предупреждение("Необходимо выбрать банковский счет.");
		Возврат;
	КонецЕсли;

	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	""Платежное поручение"" КАК ВидДокумента,
	//|	ПлатежноеПоручениеИсходящее.Ссылка КАК Документ,
	//|	ПлатежноеПоручениеИсходящее.Проведен,
	//|	ПлатежноеПоручениеИсходящее.Номер,
	//|	ПлатежноеПоручениеИсходящее.ДатаВыписки КАК Дата,
	//|	ПлатежноеПоручениеИсходящее.ВидПлатежа,
	//|	ПлатежноеПоручениеИсходящее.ПеречислениеВБюджет,
	//|	ПлатежноеПоручениеИсходящее.ОчередностьПлатежа,
	//|	ПлатежноеПоручениеИсходящее.НазначениеПлатежа,
	//|	ПлатежноеПоручениеИсходящее.СуммаДокумента,
	//|	0 КАК СуммаНаПриход,
	//|	ПлатежноеПоручениеИсходящее.СуммаДокумента КАК СуммаНаРасход,
	//|	ПлатежноеПоручениеИсходящее.ТекстПлательщика,
	//|	ПлатежноеПоручениеИсходящее.ТекстПолучателя,
	//|	ПлатежноеПоручениеИсходящее.ИННПлательщика,
	//|	ПлатежноеПоручениеИсходящее.КПППлательщика,
	//|	ПлатежноеПоручениеИсходящее.ИННПолучателя,
	//|	ПлатежноеПоручениеИсходящее.КПППолучателя,
	//|	ПлатежноеПоручениеИсходящее.КодБК,
	//|	ПлатежноеПоручениеИсходящее.КодОКАТО,
	//|	ПлатежноеПоручениеИсходящее.ПоказательДаты,
	//|	ПлатежноеПоручениеИсходящее.ПоказательНомера,
	//|	ПлатежноеПоручениеИсходящее.ПоказательОснования,
	//|	ПлатежноеПоручениеИсходящее.ПоказательТипа,
	//|	ПлатежноеПоручениеИсходящее.ПоказательПериода,
	//|	ПлатежноеПоручениеИсходящее.СтатусСоставителя,
	//|	ВЫРАЗИТЬ(ПлатежноеПоручениеИсходящее.Организация.НаименованиеПолное КАК СТРОКА(1000)) КАК Организация,
	//|	ПлатежноеПоручениеИсходящее.Организация.Наименование КАК ОрганизацияКратко,
	//|	ПлатежноеПоручениеИсходящее.Организация.НаименованиеПлательщикаПриПеречисленииНалогов КАК ОрганизацияПеречислениеНалога,
	//|	ПлатежноеПоручениеИсходящее.Организация.ИНН КАК ОрганизацияИНН,
	//|	ПлатежноеПоручениеИсходящее.Организация.КПП КАК ОрганизацияКПП,
	//|	ПлатежноеПоручениеИсходящее.СчетОрганизации КАК ОрганизацияСчет,
	//|	ПлатежноеПоручениеИсходящее.СчетОрганизации.НомерСчета КАК ОрганизацияНомерСчета,
	//|	ПлатежноеПоручениеИсходящее.СчетОрганизации.Банк.Код КАК ОрганизацияБИКБанка,
	//|	ПлатежноеПоручениеИсходящее.СчетОрганизации.Банк.Наименование КАК ОрганизацияБанк,
	//|	ПлатежноеПоручениеИсходящее.СчетОрганизации.Банк.КоррСчет КАК ОрганизацияРасчСчет,
	//|	ПлатежноеПоручениеИсходящее.СчетОрганизации.Банк.Город КАК ОрганизацияГородБанка,
	//|	ПлатежноеПоручениеИсходящее.СчетОрганизации.БанкДляРасчетов.Наименование КАК ОрганизацияБанкДляРасчетов,
	//|	ПлатежноеПоручениеИсходящее.СчетОрганизации.БанкДляРасчетов.Город КАК ОрганизацияГородРЦБанка,
	//|	ПлатежноеПоручениеИсходящее.СчетОрганизации.БанкДляРасчетов.Код КАК ОрганизацияБИКРЦБанка,
	//|	ПлатежноеПоручениеИсходящее.СчетОрганизации.БанкДляРасчетов.КоррСчет КАК ОрганизацияКоррСчетРЦБанка,
	//|	ПлатежноеПоручениеИсходящее.СчетОрганизации.СуммаБезКопеек КАК СуммаБезКопеек,
	//|	ПлатежноеПоручениеИсходящее.СчетОрганизации.ТекстКорреспондента КАК ОрганизацияТекстКорреспондента,
	//|	ПлатежноеПоручениеИсходящее.СчетОрганизации.ТекстНазначения КАК ОрганизацияТекстНазначения,
	//|	ВЫРАЗИТЬ(ПлатежноеПоручениеИсходящее.СчетКонтрагента.Владелец.НаименованиеПолное КАК СТРОКА(1000)) КАК Контрагент,
	//|	ПлатежноеПоручениеИсходящее.СчетКонтрагента.Владелец.Наименование КАК КонтрагентКратко,
	//|	ПлатежноеПоручениеИсходящее.СчетКонтрагента.Владелец.ИНН КАК КонтрагентИНН,
	//|	ПлатежноеПоручениеИсходящее.СчетКонтрагента.Владелец.КПП КАК КонтрагентКПП,
	//|	ПлатежноеПоручениеИсходящее.СчетКонтрагента КАК КонтрагентСчет,
	//|	ПлатежноеПоручениеИсходящее.СчетКонтрагента.НомерСчета КАК КонтрагентНомерСчета,
	//|	ПлатежноеПоручениеИсходящее.СчетКонтрагента.Банк.Наименование КАК КонтрагентБанк,
	//|	ПлатежноеПоручениеИсходящее.СчетКонтрагента.Банк.КоррСчет КАК КонтрагентРасчСчет,
	//|	ПлатежноеПоручениеИсходящее.СчетКонтрагента.Банк.Город КАК КонтрагентГородБанка,
	//|	ПлатежноеПоручениеИсходящее.СчетКонтрагента.БанкДляРасчетов.Наименование КАК КонтрагентБанкДляРасчетов,
	//|	ПлатежноеПоручениеИсходящее.СчетКонтрагента.БанкДляРасчетов.Город КАК КонтрагентГородРЦБанка,
	//|	ПлатежноеПоручениеИсходящее.СчетКонтрагента.Банк.Код КАК КонтрагентБИКБанка,
	//|	ПлатежноеПоручениеИсходящее.СчетКонтрагента.БанкДляРасчетов.Код КАК КонтрагентБИКРЦБанка,
	//|	ПлатежноеПоручениеИсходящее.СчетКонтрагента.БанкДляРасчетов.КоррСчет КАК КонтрагентКоррСчетРЦБанка,
	//|	ПлатежноеПоручениеИсходящее.СчетКонтрагента.ТекстКорреспондента КАК КонтрагентТекстКорреспондента,
	//|	ПлатежноеПоручениеИсходящее.СчетКонтрагента.ТекстНазначения КАК КонтрагентТекстНазначения,
	//|	ПлатежноеПоручениеИсходящее.ВидОперации,
	//|	"""" КАК СрокАкцепта,
	//|	"""" КАК УсловиеОплаты1,
	//|	"""" КАК ДатаОтсылкиДок,
	//|	"""" КАК ОписаниеОшибок,
	//|	"""" КАК Готовность,
	//|	NULL КАК Дата1
	//|ИЗ
	//|	Документ.ПлатежноеПоручениеИсходящее КАК ПлатежноеПоручениеИсходящее
	//|ГДЕ
	//|	ПлатежноеПоручениеИсходящее.Дата МЕЖДУ &ДатаНачало И &ДатаОкончание
	//|	И (НЕ ПлатежноеПоручениеИсходящее.ПометкаУдаления)
	//|	И (НЕ ПлатежноеПоручениеИсходящее.Оплачено)
	//|	И ПлатежноеПоручениеИсходящее.СчетОрганизации = &Счет
	//|	И &ВыгружатьПлатПоручения
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	|	""ЗОП"" КАК ВидДокумента,
	|	ЗаявкаНаОплату.Ссылка как Документ,
	|	ЗаявкаНаОплату.Проведен,
	|	ЗаявкаНаОплату.НомерПлатПоруч как Номер,
	|	ЗаявкаНаОплату.ДатаПлатПоруч как Дата,
	|	ЗаявкаНаОплату.ВидПлатежа,
	|	ЗаявкаНаОплату.ПеречислениеВБюджет,
	|	ЗаявкаНаОплату.ОчередностьПлатежа,
	|	ЗаявкаНаОплату.НазначениеПлатежа,
	|	ЗаявкаНаОплату.СуммаЗаявки как СуммаДокумента,
	|	0,
	|	ЗаявкаНаОплату.СуммаЗаявки как СуммаНаРасход,
	|	ЗаявкаНаОплату.ТекстПлательщика,
	|	ЗаявкаНаОплату.ТекстПолучателя,
	|	ЗаявкаНаОплату.ИННПлательщика,
	|	ЗаявкаНаОплату.КПППлательщика,
	|	ЗаявкаНаОплату.ИННПолучателя,
	|	ЗаявкаНаОплату.КПППолучателя,
	|	ЗаявкаНаОплату.КодБК,
	|	ЗаявкаНаОплату.КодОКАТО,
	|	ЗаявкаНаОплату.ПоказательДаты,
	|	ЗаявкаНаОплату.ПоказательНомера,
	|	ЗаявкаНаОплату.ПоказательОснования,
	|	ЗаявкаНаОплату.ПоказательТипа,
	|	ЗаявкаНаОплату.ПоказательПериода,
	|	ЗаявкаНаОплату.СтатусСоставителя,
	|	ВЫРАЗИТЬ(ЗаявкаНаОплату.Организация.НаименованиеПолное КАК СТРОКА(1000)) как Организация,
	|	ЗаявкаНаОплату.Организация.Наименование как ОрганизацияКратко,
	|	ЗаявкаНаОплату.Организация.НаименованиеПлательщикаПриПеречисленииНалогов КАК ОрганизацияПеречислениеНалога,
	|	ЗаявкаНаОплату.Организация.ИНН КАК ОрганизацияИНН,
	|	ЗаявкаНаОплату.Организация.КПП как организацияКПП,
	|	ЗаявкаНаОплату.РСОрганизации КАК ОрганизацияСчет,
	|	ЗаявкаНаОплату.РСОрганизации.НомерСчета  КАК ОрганизацияНомерСчета,
	|	ЗаявкаНаОплату.РСОрганизации.Банк.Код КАК ОрганизацияБИКБанка,
	|	ЗаявкаНаОплату.РСОрганизации.Банк.Наименование КАК ОрганизацияБанк,
	|	ЗаявкаНаОплату.РСОрганизации.Банк.КоррСчет КАК ОрганизацияКоррСчетБанка,
	|	ЗаявкаНаОплату.РСОрганизации.Банк.Город КАК ОрганизацияГородБанка,
	|	ЗаявкаНаОплату.РСОрганизации.БанкДляРасчетов.Наименование КАК ОрганизацияБанкДляРасчетов,
	|	ЗаявкаНаОплату.РСОрганизации.БанкДляРасчетов.Город КАК ОрганизацияГородРЦБанка,
	|	ЗаявкаНаОплату.РСОрганизации.БанкДляРасчетов.Код КАК ОрганизацияБИКРЦБанка,
	|	ЗаявкаНаОплату.РСОрганизации.БанкДляРасчетов.КоррСчет КАК ОрганизацияКоррСчетРЦБанка,
	|	ЗаявкаНаОплату.РСОрганизации.СуммаБезКопеек КАК СуммаБезКопеек,
 	|	ЗаявкаНаОплату.РСОрганизации.ТекстКорреспондента КАК ОрганизацияТекстКорреспондента,
	|	ЗаявкаНаОплату.РСОрганизации.ТекстНазначения  КАК ОрганизацияТекстНазначения,
	|	ВЫРАЗИТЬ(ЗаявкаНаОплату.РСКонтрагента.Владелец.ПолноеНаименование КАК СТРОКА(1000))  КАК Контрагент,
	|	ЗаявкаНаОплату.РСКонтрагента.Владелец.Наименование  КАК КонтрагентКратко,
	|	ЗаявкаНаОплату.РСКонтрагента.Владелец.ИНН  КАК КонтрагентИНН,
	|	ЗаявкаНаОплату.РСКонтрагента.Владелец.КПП  КАК КонтрагентКПП,
	|	ЗаявкаНаОплату.РСКонтрагента  КАК КонтрагентСчет,
	|	ЗаявкаНаОплату.РСКонтрагента.НомерСчета КАК КонтрагентНомерСчета,
	|	ЗаявкаНаОплату.РСКонтрагента.Банк.Наименование КАК КонтрагентБанк,
	|	ЗаявкаНаОплату.РСКонтрагента.Банк.КоррСчет  КАК КонтрагентРасчСчет,
	|	ЗаявкаНаОплату.РСКонтрагента.Банк.Город КАК КонтрагентГородБанка,
	|	ЗаявкаНаОплату.РСКонтрагента.БанкДляРасчетов.Наименование КАК КонтрагентБанкДляРасчетов,
	|	ЗаявкаНаОплату.РСКонтрагента.БанкДляРасчетов.Город КАК КонтрагентГородРЦБанка,
	|	ЗаявкаНаОплату.РСКонтрагента.Банк.Код КАК КонтрагентБИКБанка,
	|	ЗаявкаНаОплату.РСКонтрагента.БанкДляРасчетов.Код КАК КонтрагентБИКРЦБанка,
	|	ЗаявкаНаОплату.РСКонтрагента.БанкДляРасчетов.КоррСчет КАК КонтрагентКоррСчетРЦБанка,
	|	ЗаявкаНаОплату.РСКонтрагента.ТекстКорреспондента КАК КонтрагентТекстКорреспондента,
	|	ЗаявкаНаОплату.РСКонтрагента.ТекстНазначения КАК КонтрагентТекстНазначения,
	|	ЗаявкаНаОплату.ВидОперации,
	|	"""" КАК СрокАкцепта,
	|	"""" КАК УсловиеОплаты1,
	|	"""" КАК ДатаОтсылкиДок,
	|	"""" КАК ОписаниеОшибок,
	|	"""" КАК Готовность,
	|	NULL КАК Дата1
   	|ИЗ
	|	Документ.ЗаявкаНаОплату КАК ЗаявкаНаОплату
	|ГДЕ
	|	ЗаявкаНаОплату.Дата МЕЖДУ &ДатаНачало И &ДатаОкончание
	|	И (НЕ ЗаявкаНаОплату.ПометкаУдаления)
	|	И (НЕ ЗаявкаНаОплату.Выгружена)
	|	И ЗаявкаНаОплату.РСОрганизации = &Счет
	|	И &ВыгружатьПлатТребования
	|	И ЗаявкаНаОплату.Состояние = &КОплате
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидДокумента,
	|	Дата,
	|	Документ";
	
	ЗапросПоДокументам = Новый Запрос(ТекстЗапроса);
	ЗапросПоДокументам.УстановитьПараметр("ДатаНачало",    НачалоДня(НачПериода));
	ЗапросПоДокументам.УстановитьПараметр("ДатаОкончание", КонецДня(КонПериода));
	ЗапросПоДокументам.УстановитьПараметр("Счет",  БанковскийСчет);
	//ЗапросПоДокументам.УстановитьПараметр("ВыгружатьПлатПоручения",  ВыгружатьПлатПоручения);
	ЗапросПоДокументам.УстановитьПараметр("ВыгружатьПлатТребования", ВыгружатьПлатТребования);
	ЗапросПоДокументам.УстановитьПараметр("КОплате", Перечисления.СостоянияЗаявокНаОплату.КОплате);
	
	ВыборкаДляЭкспорта = ЗапросПоДокументам.Выполнить().Выгрузить();
	ПлатежныеДокументы.Загрузить(ВыборкаДляЭкспорта);
	
	КоллекцияСвойств = ДокументыНаЭкспорт.Колонки;
	Для каждого СтрокаДокумента из ПлатежныеДокументы Цикл
		
		ПроверитьНаКорректностьИПустоеЗначениеЭкспорта(СтрокаДокумента,КоллекцияСвойств);
		
		СтрокаДокумента.Выгружать = ПустаяСтрока(СтрокаДокумента.ОписаниеОшибок);
		
	КонецЦикла;

КонецПроцедуры

Функция ПроверитьНаКорректностьИПустоеЗначениеЭкспорта(СтрокаДокумента,КоллекцияСвойств)
	
	ПеречислениеНалога          = Ложь;
	НепрямыеРасчетыУПлательщика = Ложь;
	НепрямыеРасчетыУПолучателя  = Ложь;

	Если СтрокаДокумента.ВидДокумента = "Платежное поручение" Тогда
		ПеречислениеНалога          = (СтрокаДокумента.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПеречислениеНалога);
		НепрямыеРасчетыУПлательщика = ЗначениеЗаполнено(СтрокаДокумента.ОрганизацияБанкДляРасчетов);
		НепрямыеРасчетыУПолучателя  = ЗначениеЗаполнено(СтрокаДокумента.КонтрагентБанкДляРасчетов);
		СтрокаДокумента.ТипДокумента= ?(ПеречислениеНалога, 1, 0) * 4 + ?(НепрямыеРасчетыУПолучателя, 1, 0) * 2 + ?(НепрямыеРасчетыУПлательщика, 1, 0) + 1;
		Плательщик =  "Организация";
		Получатель =  "Контрагент";
	Иначе
		СтрокаДокумента.ТипДокумента = 0;
		Плательщик =  "Контрагент";
		Получатель =  "Организация";
	КонецЕсли;

	РеквизитыПлДокЭкс_Основные = "Номер,Дата,СуммаДокумента";                       
	РеквизитыПлДокЭкс_Плательщик = Плательщик + "Счет," + Плательщик + "," + Плательщик + "ИНН";      
	РеквизитыПлДокЭкс_ПлательщикНПР = Плательщик + "РасчСчет," + Плательщик + "БанкДляРасчетов," + Плательщик + "ГородБанка," + Плательщик + "БИКРЦБанка";
	РеквизитыПлДокЭкс_Получатель = Получатель + "Счет," + Получатель + "," + Получатель + "ИНН";
	РеквизитыПлДокЭкс_ПолучательНПР = Получатель + "РасчСчет," + Получатель + "БанкДляРасчетов," + Получатель + "ГородБанка," + Получатель + "БИКРЦБанка";
	РеквизитыПлДокЭкс_БюджетПлатеж = "СтатусСоставителя,КПППлательщика,КПППолучателя,КодБК,КодОКАТО,ПоказательОснования,ПоказательПериода,ПоказательНомера,ПоказательДаты,ПоказательТипа";


	Экспорт_НеПустые = СоздатьСоответствиеИзСтроки(
	РеквизитыПлДокЭкс_Основные + "," +
	РеквизитыПлДокЭкс_Плательщик + "," +
	?(НепрямыеРасчетыУПлательщика,РеквизитыПлДокЭкс_ПлательщикНПР + ",","")+
	РеквизитыПлДокЭкс_Получатель + "," +
	?(НепрямыеРасчетыУПолучателя,РеквизитыПлДокЭкс_ПолучательНПР + ",",""));

	
	Для каждого Свойство из Экспорт_НеПустые Цикл
		ПроверитьНаПустоеЗначениеЭкспорта(СтрокаДокумента, Свойство.Ключ, КоллекцияСвойств.Найти(Свойство.Ключ).ТекстШапки);
	КонецЦикла;
	Если ПеречислениеНалога Тогда
		ПроверитьЗаполнениеНалоговыхРеквизитов(СтрокаДокумента);
	КонецЕсли;
	
	ПроверитьНаКорректностьНомераПриВыгрузке(СтрокаДокумента);
	                           
КонецФункции

Процедура ПроверитьНаПустоеЗначениеЭкспорта(СтрокаЭкспорта, ИмяСвойства, ПредставлениеСвойства)
	
	Если НЕ ЗначениеЗаполнено(СтрокаЭкспорта[ИмяСвойства]) Тогда
		ДобавитьЗамечание(СтрокаЭкспорта, 3, "Не заполнено """ + ПредставлениеСвойства + """!");
		УстановитьГотовность(СтрокаЭкспорта.Готовность, 4);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьНаКорректностьНомераПриВыгрузке(СтрокаЭкспорта)
	
	Значение = СокрЛП(СтрокаЭкспорта.Номер);
	Если Число(Строка(Число(Прав(Значение, 3)))) = 0 Тогда
		ДобавитьЗамечание(СтрокаЭкспорта, 4, "Номер должен оканчиваться на три цифры и не на ""000""!");
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьЗаполнениеНалоговыхРеквизитов(СтрокаЭкспорта)
	
	Ошибка = Новый СписокЗначений();
	
	П101 = СокрЛП(СтрокаЭкспорта.СтатусСоставителя );
	П104 = СокрЛП(СтрокаЭкспорта.КодБК );
	П105 = СокрЛП(СтрокаЭкспорта.КодОКАТО );
	П106 = СокрЛП(СтрокаЭкспорта.ПоказательОснования );
	П107 = ?(ПустаяСтрока(СокрЛП(СтрЗаменить(СтрокаЭкспорта.ПоказательПериода , ".", ""))) = 1, "", СтрокаЭкспорта.ПоказательПериода );
	П107 = ?(СокрЛП(СтрЗаменить(СтрокаЭкспорта.ПоказательПериода, ".", "")) = "0", "", СтрокаЭкспорта.ПоказательПериода );
	П108 = СокрЛП(СтрокаЭкспорта.ПоказательНомера );
	П109 = ?(НЕ ЗначениеЗаполнено(СтрокаЭкспорта.ПоказательДаты ), "0", Строка(СтрокаЭкспорта.ПоказательДаты ));
	П110 = СокрЛП(СтрокаЭкспорта.ПоказательТипа );
	
	Если (Найти("01,02,03,04,05,06,07,08,09,10,11,12,13,14,15", П101) = 0) или
		(ПустаяСтрока(СокрЛП(П101))) Тогда
		ДобавитьЗамечание(СтрокаЭкспорта, 3, "Не заполнено поле ""Статус составителя"" на закладке ""Реквизиты для перечисления налогов"".");	УстановитьГотовность(СтрокаЭкспорта.Готовность, 4);
	КонецЕсли;
	
	Если (СтрЗаменить(П104, "0", "") = "") и (Найти("06,07", П101) = 0) Тогда
		ДобавитьЗамечание(СтрокаЭкспорта, 3, "Не заполнено поле ""КБК"" на закладке ""Реквизиты для перечисления налогов""."); УстановитьГотовность(СтрокаЭкспорта.Готовность, 4);
	КонецЕсли;
	
	Если ПустаяСтрока(П105) Тогда
		ДобавитьЗамечание(СтрокаЭкспорта, 3, "Не заполнено поле ""Код ОКАТО"" на закладке ""Реквизиты для перечисления налогов""."); УстановитьГотовность(СтрокаЭкспорта.Готовность, 4);
	КонецЕсли;
	
	// Проверяем в зависимости от статуса составителя
	Если П101 = "08" Тогда
		Если СтрЗаменить(П106, "0", "") <> "" Тогда 
			ДобавитьЗамечание(СтрокаЭкспорта, 3, "При статусе составителя ""08"" следует указать ""0"" в поле ""Основание платежа"" на закладке ""Реквизиты для перечисления налогов""."); УстановитьГотовность(СтрокаЭкспорта.Готовность, 4);
		КонецЕсли;
		Если СтрЗаменить(П107, "0", "") <> "" Тогда
			ДобавитьЗамечание(СтрокаЭкспорта, 3, "При статусе составителя ""08"" следует указать ""0"" в поле ""Налоговый период"" на закладке ""Реквизиты для перечисления налогов""."); УстановитьГотовность(СтрокаЭкспорта.Готовность, 4);
		КонецЕсли;
		Если СтрЗаменить(П108, "0", "") <> "" Тогда
			ДобавитьЗамечание(СтрокаЭкспорта, 3, "При статусе составителя ""08"" не следует заполнять поле ""Номер документа"" на закладке ""Реквизиты для перечисления налогов""."); УстановитьГотовность(СтрокаЭкспорта.Готовность, 4);
		КонецЕсли;
		Если СтрЗаменить(П109, "0", "") <> "" Тогда
			ДобавитьЗамечание(СтрокаЭкспорта, 3, "При статусе составителя ""08"" не следует заполнять поле ""Дата документа"" на закладке ""Реквизиты для перечисления налогов""."); УстановитьГотовность(СтрокаЭкспорта.Готовность, 4);
		КонецЕсли;
		Если СтрЗаменить(П110, "0", "") <> "" Тогда
			ДобавитьЗамечание(СтрокаЭкспорта, 3, "При статусе составителя ""08"" следует указать ""0"" в поле ""Тип платежа"" на закладке ""Реквизиты для перечисления налогов""."); УстановитьГотовность(СтрокаЭкспорта.Готовность, 4);
		КонецЕсли;
	Иначе
		// Проверяем в зависимости от основания платежа
		Если СтрЗаменить(СокрЛП(П106), "0", "") = "" Тогда
			Если СтрЗаменить(П107, "0", "") <> "" Тогда
				Если НЕ ЗначениеЗаполнено(П107) Тогда
					ДобавитьЗамечание(СтрокаЭкспорта, 3, "Возможно, неверно указано значение в поле ""Налоговый период"" на закладке ""Реквизиты для перечисления налогов""."); УстановитьГотовность(СтрокаЭкспорта.Готовность, 4);
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли СтрДлина(П106) <> 2 Тогда
			Если СтрЗаменить(П107, "0", "") <> "" Тогда
				Если НЕ ЗначениеЗаполнено(П107) Тогда
					ДобавитьЗамечание(СтрокаЭкспорта, 3, "Возможно, неверно указано значение в поле ""Налоговый период"" на закладке ""Реквизиты для перечисления налогов""."); УстановитьГотовность(СтрокаЭкспорта.Готовность, 4);
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Найти("АП, АР", П106) > 0 Тогда
			Если СтрЗаменить(П107, "0", "") <> "" Тогда
				ДобавитьЗамечание(СтрокаЭкспорта, 3, "При основании платежа ""АП"" или ""АР"" следует указать ""0"" в поле ""Налоговый период"" на закладке ""Реквизиты для перечисления налогов""."); УстановитьГотовность(СтрокаЭкспорта.Готовность, 4);
			КонецЕсли;
		ИначеЕсли Найти("ТР, РС, ОТ, РТ, ВУ, ПР", П106) > 0 Тогда
			Если СтрЗаменить(П107, "0", "") <> "" Тогда
				Если НЕ ЗначениеЗаполнено(П107) Тогда
					ДобавитьЗамечание(СтрокаЭкспорта, 3, "Возможно, неверно указано значение в поле ""Налоговый период"" на закладке ""Реквизиты для перечисления налогов""."); УстановитьГотовность(СтрокаЭкспорта.Готовность, 4);
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Найти("ТП ,ЗД ", П106) > 0 Тогда
			Если СтрЗаменить(П107,"0","")<>"" Тогда
				ДД = Сред((П107), 1, 2);
				ММ = Сред((П107), 4, 2);
				ГГ = Сред((П107), 7, 4);
				
				Если НЕ ММ="" Тогда
					ММ = Число(Сред((П107), 4, 2));
				Иначе
					ММ = 0;
				КонецЕсли;	
				
				Если НЕ ГГ="" Тогда
					ГГ = Число(Сред((П107), 7, 4));
				Иначе
					ГГ = 0;
				КонецЕсли;
				
				Если (Найти("Д1, Д2, Д3, МС", ДД) > 0) Тогда
					Если (ММ < 1)или
						(ММ > 12)или 
						(ГГ < 2000)или
						(СтрДлина(П107) - СтрДлина(СтрЗаменить(П107, ".", "")) <> 2) Тогда
						ДобавитьЗамечание(СтрокаЭкспорта, 3, "Возможно, неверно указано значение в поле ""Налоговый период"" на закладке ""Реквизиты для перечисления налогов""."); УстановитьГотовность(СтрокаЭкспорта.Готовность, 4);
					КонецЕсли;
				ИначеЕсли (Найти("КВ", ДД) > 0) Тогда
					Если (ММ < 1)или
						(ММ > 4)или 
						(ГГ < 2000)или
						(СтрДлина(П107) - СтрДлина(СтрЗаменить(П107, ".", "")) <> 2) Тогда
						ДобавитьЗамечание(СтрокаЭкспорта, 3, "Неверно указано значение в поле ""Налоговый период"" на закладке ""Реквизиты для перечисления налогов""."); УстановитьГотовность(СтрокаЭкспорта.Готовность, 4);
					КонецЕсли;
				ИначеЕсли (Найти("ПЛ", ДД) > 0) Тогда
					Если (ММ < 1)или
						(ММ > 2)или 
						(ГГ < 2000)или
						(СтрДлина(П107) - СтрДлина(СтрЗаменить(П107, ".", "")) <> 2) Тогда
						ДобавитьЗамечание(СтрокаЭкспорта, 3, "Неверно указано значение в поле ""Налоговый период"" на закладке ""Реквизиты для перечисления налогов""."); УстановитьГотовность(СтрокаЭкспорта.Готовность, 4);
					КонецЕсли;
				ИначеЕсли (Найти("ГД", ДД) > 0) Тогда
					Если (ММ <> 0)или
						(ГГ < 2000)или
						(СтрДлина(П107) - СтрДлина(СтрЗаменить(П107, ".", "")) <> 2) Тогда
						ДобавитьЗамечание(СтрокаЭкспорта, 3, "Неверно указано значение в поле ""Налоговый период"" на закладке ""Реквизиты для перечисления налогов""."); УстановитьГотовность(СтрокаЭкспорта.Готовность, 4);
					КонецЕсли;
				Иначе
					Если НЕ ЗначениеЗаполнено(П107) Тогда
						ДобавитьЗамечание(СтрокаЭкспорта, 3, "Возможно, неверно указано значение в поле ""Налоговый период"" на закладке ""Реквизиты для перечисления налогов""."); УстановитьГотовность(СтрокаЭкспорта.Готовность, 4);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если СтрЗаменить(П108, "0", "") <> "" Тогда
				ДобавитьЗамечание(СтрокаЭкспорта, 3, "При основании платежа ""ТП"" или ""ЗД"" необходимо указывать ""0"" в поле ""Номер документа"" на закладке ""Реквизиты для перечисления налогов""."); УстановитьГотовность(СтрокаЭкспорта.Готовность, 4);
			КонецЕсли;
			Если Найти("ЗД ", П106) > 0 Тогда
				Если СтрЗаменить(П109, "0", "") <> "" Тогда
					ДобавитьЗамечание(СтрокаЭкспорта, 3, "При основании платежа ""ЗД"" не должно заполняться поле ""Дата документа"" на закладке ""Реквизиты для перечисления налогов""."); УстановитьГотовность(СтрокаЭкспорта.Готовность, 4);
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Найти("БФ", П106) > 0 Тогда
		Иначе
			ДобавитьЗамечание(СтрокаЭкспорта, 3, "Неверно указано значение в поле ""Основание платежа"" на закладке ""Реквизиты для перечисления налогов""."); УстановитьГотовность(СтрокаЭкспорта.Готовность, 4);
		КонецЕсли;
		Если СтрЗаменить(П110,"0","")="" Тогда
		ИначеЕсли Найти("НС, АВ, ПЕ, ПЦ, СА, АШ, ИШ, ПЛ, ГП, ВЗ", П110) > 0 Тогда
		Иначе
			ДобавитьЗамечание(СтрокаЭкспорта, 3, "Неверно указано значение в поле ""Тип платежа"" на закладке ""Реквизиты для перечисления налогов""."); УстановитьГотовность(СтрокаЭкспорта.Готовность, 4);
		КонецЕсли;
	КонецЕсли;
	
	//Выводим список найденых ошибок
	Для Ном = 0 по Ошибка.Количество()-1 Цикл
		Сообщить(Ошибка.Получить(Ном), СтатусСообщения.Важное);
	КонецЦикла;
	
	Возврат Ошибка;
	
КонецФункции // Проверить()

Процедура ВыборФайлаДляВыгрузки(Элемент) Экспорт
	
	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогФыбораФайла.Фильтр                      = "Текстовый файл (*.txt)|*.txt";
	ДиалогФыбораФайла.Заголовок                   = "Выберите файл для выгрузки данных из клиента банка";
	ДиалогФыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогФыбораФайла.Расширение                  = "txt";
	ДиалогФыбораФайла.ИндексФильтра               = 0;
	ДиалогФыбораФайла.ПолноеИмяФайла              = Элемент.Значение;
	ДиалогФыбораФайла.ПроверятьСуществованиеФайла = Ложь;
	
	Если ДиалогФыбораФайла.Выбрать() Тогда
		Элемент.Значение = ДиалогФыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

////////////// ВЫГРУЗКА //////////////////////////////////////////////////
Процедура ЗаполнитьЗначениеЭкспорта(СтрокаЭкспорта, ВыборкаДляЭкспорта)
	
	Если ВыборкаДляЭкспорта.ВидДокумента = "Платежное требование" Тогда
		Плательщик =  "Контрагент";
		Получатель =  "Организация";
	Иначе
		Плательщик =  "Организация";
		Получатель =  "Контрагент";
	КонецЕсли;
	
	//СтрокаЭкспорта.Номер = 					ПолучитьНомерВФорматеОбмена(ВыборкаДляЭкспорта.Номер, Организация.Префикс);
	СтрокаЭкспорта.Номер = 					ВыборкаДляЭкспорта.Номер;
	СтрокаЭкспорта.Дата = 					ВыборкаДляЭкспорта.Дата;
	СтрокаЭкспорта.Сумма = 					Формат(ВыборкаДляЭкспорта.СуммаДокумента, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧРГ=' '; ЧГ=0");
	СтрокаЭкспорта.ПлательщикСчет = 		ВыборкаДляЭкспорта[Плательщик + "НомерСчета"];
	СтрокаЭкспорта.ПолучательСчет = 		ВыборкаДляЭкспорта[Получатель + "НомерСчета"];
	СтрокаЭкспорта.ВидПлатежа 			= 	ВыборкаДляЭкспорта.ВидПлатежа;
	
	НепрямыеРасчетыУПлательщика = ЗначениеЗаполнено(ВыборкаДляЭкспорта[Плательщик + "БанкДляРасчетов"]);
	НепрямыеРасчетыУПолучателя  = ЗначениеЗаполнено(ВыборкаДляЭкспорта[Получатель + "БанкДляРасчетов"]);

//ВидОплаты 
	Если ВыборкаДляЭкспорта.ВидДокумента = "Платежное поручение" или ВыборкаДляЭкспорта.ВидДокумента = "ЗОП" Тогда
		СтрокаЭкспорта.ВидОплаты =  "01";
		
	//ИначеЕсли ВыборкаДляЭкспорта.ВидДокумента = "Аккредитив переданный" Тогда
	//	СтрокаЭкспорта.ВидОплаты =  "08";
	//	
	//ИначеЕсли ВыборкаДляЭкспорта.ВидДокумента = "Инкассовое поручение" Тогда
	//	СтрокаЭкспорта.ВидОплаты =  "06";
	//	
	//ИначеЕсли ВыборкаДляЭкспорта.ВидДокумента = "Платежное требование" Тогда
	//	СтрокаЭкспорта.ВидОплаты =  "02";
		
	Иначе
		СтрокаЭкспорта.ВидОплаты = "00";
	КонецЕсли;
		
//Плательщик1
	ТекстПлательщика = "";
	Если НепрямыеРасчетыУПлательщика Тогда
		ПозицияРС = найти(ВыборкаДляЭкспорта["ТекстПлательщика"],"р/с"); 
		Если ПозицияРС=0 Тогда
			ТекстПлательщика = ВыборкаДляЭкспорта["ТекстПлательщика"];
		Иначе
			ТекстПлательщика = СокрЛП((Лев(ВыборкаДляЭкспорта["ТекстПлательщика"],ПозицияРС-1)));
		КонецЕсли;
	Иначе
		ТекстПлательщика = ВыборкаДляЭкспорта["ТекстПлательщика"];
	КонецЕсли;
	СтрокаЭкспорта.Плательщик1 = СтрЗаменить(ТекстПлательщика,Символы.ПС," ");
	
//Плательщик, ПлательщикИНН
	Значение = ВыборкаДляЭкспорта.ИННПлательщика;
	Если ПустаяСтрока(Значение) Тогда
		Значение = ВыборкаДляЭкспорта[Плательщик + "ИНН"];
	КонецЕсли;
	СтрокаЭкспорта.ПлательщикИНН = Значение;
	СтрокаЭкспорта.Плательщик = "ИНН " + Значение + " " + СтрокаЭкспорта.Плательщик1; 
	
//ПлательщикРасчСчет, ПлательщикБанк1, ПлательщикБанк2, ПлательщикБИК, ПлательщикКорсчет,Плательщик2, Плательщик3, Плательщик4
	Если НепрямыеРасчетыУПлательщика Тогда
		СтрокаЭкспорта.Плательщик2 		 = ВыборкаДляЭкспорта[Плательщик + "НомерСчета"];
		//кухарь 03.12.15 начало
		если Программа <> "Система ДБО BS-Client V.3 BSS" тогда 
			СтрокаЭкспорта.Плательщик3 		 = ВыборкаДляЭкспорта[Плательщик + "Банк"];
			СтрокаЭкспорта.Плательщик4 		 = ВыборкаДляЭкспорта[Плательщик + "ГородБанка"];
			СтрокаЭкспорта.Плательщик 		 = СтрокаЭкспорта.Плательщик + " р/с " + СтрокаЭкспорта.Плательщик2 + " в " + СтрокаЭкспорта.Плательщик3 + " " + СтрокаЭкспорта.Плательщик4;
		иначе
			СтрокаЭкспорта.Плательщик 		 = СтрокаЭкспорта.Плательщик;
		КонецЕсли;
		//кухарь 03.12.15 конец

		СтрокаЭкспорта.ПлательщикРасчСчет= ВыборкаДляЭкспорта[Плательщик + "РасчСчет"];
		СтрокаЭкспорта.ПлательщикБанк1   = ВыборкаДляЭкспорта[Плательщик + "БанкДляРасчетов"];
		СтрокаЭкспорта.ПлательщикБанк2   = ВыборкаДляЭкспорта[Плательщик + "ГородРЦБанка"];
		СтрокаЭкспорта.ПлательщикБИК     = ВыборкаДляЭкспорта[Плательщик + "БИКРЦБанка"];
		СтрокаЭкспорта.ПлательщикКорсчет = ВыборкаДляЭкспорта[Плательщик + "КоррСчетРЦБанка"];
	Иначе
		СтрокаЭкспорта.ПлательщикРасчСчет= ВыборкаДляЭкспорта[Плательщик + "НомерСчета"];
		СтрокаЭкспорта.ПлательщикБанк1   = ВыборкаДляЭкспорта[Плательщик + "Банк"];
		СтрокаЭкспорта.ПлательщикБанк2   = ВыборкаДляЭкспорта[Плательщик + "ГородБанка"];
		СтрокаЭкспорта.ПлательщикБИК     = ВыборкаДляЭкспорта[Плательщик + "БИКБанка"];
		СтрокаЭкспорта.ПлательщикКорсчет = ВыборкаДляЭкспорта[Плательщик + "РасчСчет"];
	КонецЕсли;
	
//Получатель1
	ТекстПолучателя = "";
	Если НепрямыеРасчетыУПолучателя Тогда
		ПозицияРС = найти(ВыборкаДляЭкспорта["ТекстПолучателя"],"р/с");
		Если ПозицияРС=0 Тогда
			ТекстПолучателя = ВыборкаДляЭкспорта["ТекстПолучателя"];
		Иначе
			ТекстПолучателя = СокрЛП((Лев(ВыборкаДляЭкспорта["ТекстПолучателя"],ПозицияРС-1)));
		КонецЕсли;
	Иначе
		ТекстПолучателя = ВыборкаДляЭкспорта["ТекстПолучателя"];
	КонецЕсли;
	СтрокаЭкспорта.Получатель1 = СтрЗаменить(ТекстПолучателя,Символы.ПС," ");
	
//Получатель, ПолучательИНН
	Значение = ВыборкаДляЭкспорта.ИННПолучателя;
	Если ПустаяСтрока(Значение) Тогда
		Значение = ВыборкаДляЭкспорта[Получатель + "ИНН"];
	КонецЕсли;
	СтрокаЭкспорта.ПолучательИНН = Значение;
	СтрокаЭкспорта.Получатель = "ИНН " + Значение + " " + СтрокаЭкспорта.Получатель1;
	
//ПолучательРасчСчет, ПолучательБанк1, ПолучательБанк2, ПолучательБИК, ПолучательКорсчет, Получатель2, Получатель3, Получатель4
	Если НепрямыеРасчетыУПолучателя Тогда
		СтрокаЭкспорта.Получатель2 		 = ВыборкаДляЭкспорта[Получатель + "НомерСчета"];
		СтрокаЭкспорта.Получатель3 		 = ВыборкаДляЭкспорта[Получатель + "Банк"];
		СтрокаЭкспорта.Получатель4 		 = ВыборкаДляЭкспорта[Получатель + "ГородБанка"];
		СтрокаЭкспорта.Получатель 		 = СтрокаЭкспорта.Получатель + " р/с " + СтрокаЭкспорта.Получатель2 + " в " + СтрокаЭкспорта.Получатель3 + " " + СтрокаЭкспорта.Получатель4;
		СтрокаЭкспорта.ПолучательРасчСчет= ВыборкаДляЭкспорта[Получатель + "РасчСчет"];
		СтрокаЭкспорта.ПолучательБанк1   = ВыборкаДляЭкспорта[Получатель + "БанкДляРасчетов"];
		СтрокаЭкспорта.ПолучательБанк2   = ВыборкаДляЭкспорта[Получатель + "ГородРЦБанка"];
		СтрокаЭкспорта.ПолучательБИК     = ВыборкаДляЭкспорта[Получатель + "БИКРЦБанка"];
		СтрокаЭкспорта.ПолучательКорсчет = ВыборкаДляЭкспорта[Получатель + "КоррСчетРЦБанка"];
	Иначе
		СтрокаЭкспорта.ПолучательРасчСчет= ВыборкаДляЭкспорта[Получатель + "НомерСчета"];
		СтрокаЭкспорта.ПолучательБанк1   = ВыборкаДляЭкспорта[Получатель + "Банк"];
		СтрокаЭкспорта.ПолучательБанк2   = ВыборкаДляЭкспорта[Получатель + "ГородБанка"];
		СтрокаЭкспорта.ПолучательБИК     = ВыборкаДляЭкспорта[Получатель + "БИКБанка"];
		СтрокаЭкспорта.ПолучательКорсчет = ВыборкаДляЭкспорта[Получатель + "РасчСчет"];
	КонецЕсли;
	
	
//ПлательщикКПП
	Если НЕ ЗначениеЗаполнено(СтрокаЭкспорта.ПлательщикКПП) Тогда
		СтрокаЭкспорта.ПлательщикКПП = ВыборкаДляЭкспорта.КПППлательщика;
	КонецЕсли;
	
//ПолучательКПП
	Если НЕ ЗначениеЗаполнено(СтрокаЭкспорта.ПолучательКПП) Тогда
		СтрокаЭкспорта.ПолучательКПП = ВыборкаДляЭкспорта.КПППолучателя;
	КонецЕсли;
	
//СтатусСоставителя, ПлательщикКПП ПолучательКПП ПоказательКБК ОКАТО ПоказательОснования ПоказательПериода ПоказательНомера ПоказательДаты ПоказательТипа
	Если ВыборкаДляЭкспорта.ПеречислениеВБюджет Тогда
		СтрокаЭкспорта.СтатусСоставителя = ВыборкаДляЭкспорта.СтатусСоставителя;
		
		Если ПустаяСтрока(СтрокаЭкспорта.СтатусСоставителя) Тогда
			СтрокаЭкспорта.СтатусСоставителя = "0";
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаЭкспорта.ПлательщикКПП) Тогда
			СтрокаЭкспорта.ПлательщикКПП = ВыборкаДляЭкспорта.КПППлательщика;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаЭкспорта.ПлательщикКПП) Тогда
			СтрокаЭкспорта.ПлательщикКПП = "0";
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаЭкспорта.ПолучательКПП) Тогда
			СтрокаЭкспорта.ПолучательКПП = ВыборкаДляЭкспорта.КПППолучателя;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаЭкспорта.ПолучательКПП) Тогда
			СтрокаЭкспорта.ПолучательКПП = "0";
		КонецЕсли;
		
		СтрокаЭкспорта.ПоказательКБК       = ВыборкаДляЭкспорта.КодБК;
		СтрокаЭкспорта.ОКАТО               = ВыборкаДляЭкспорта.КодОКАТО;
		
		Если ПустаяСтрока(ВыборкаДляЭкспорта.ПоказательОснования) Тогда
			СтрокаЭкспорта.ПоказательОснования = "0";
		Иначе
			СтрокаЭкспорта.ПоказательОснования = ВыборкаДляЭкспорта.ПоказательОснования;
		КонецЕсли;
		
		Если ПустаяСтрока(ВыборкаДляЭкспорта.ПоказательПериода) ИЛИ (ВыборкаДляЭкспорта.ПоказательПериода = "  .  .    ") Тогда
			СтрокаЭкспорта.ПоказательПериода = "0";
		Иначе
			СтрокаЭкспорта.ПоказательПериода = ВыборкаДляЭкспорта.ПоказательПериода;
		КонецЕсли;
		
		Если ПустаяСтрока(ВыборкаДляЭкспорта.ПоказательНомера) Тогда
			СтрокаЭкспорта.ПоказательНомера = "0";
		Иначе
			СтрокаЭкспорта.ПоказательНомера = ВыборкаДляЭкспорта.ПоказательНомера;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВыборкаДляЭкспорта.ПоказательДаты) Тогда
			СтрокаЭкспорта.ПоказательДаты = "0";
		Иначе
			СтрокаЭкспорта.ПоказательДаты = Формат(ВыборкаДляЭкспорта.ПоказательДаты,"ДЛФ=Д");
		КонецЕсли;
		
		Если ПустаяСтрока(ВыборкаДляЭкспорта.ПоказательТипа) Тогда
			СтрокаЭкспорта.ПоказательТипа = "0";
		Иначе
			СтрокаЭкспорта.ПоказательТипа = ВыборкаДляЭкспорта.ПоказательТипа;
		КонецЕсли;
		
	КонецЕсли;
	
//СрокАкцепта, ДатаОтсылкиДок, УсловиеОплаты1
	Если ВыборкаДляЭкспорта.ВидДокумента = "Платежное требование" Тогда
		СтрокаЭкспорта.СрокАкцепта = ВыборкаДляЭкспорта.СрокАкцепта;
		СтрокаЭкспорта.ДатаОтсылкиДок = ВыборкаДляЭкспорта.ДатаОтсылкиДок;
		СтрокаЭкспорта.УсловиеОплаты1 = ВыборкаДляЭкспорта.УсловиеОплаты1;
	КонецЕсли;
	
//Очередность
	СтрокаЭкспорта.Очередность = "" + ВыборкаДляЭкспорта.ОчередностьПлатежа;
	
//НазначениеПлатежа, НазначениеПлатежа1 НазначениеПлатежа2 НазначениеПлатежа3 НазначениеПлатежа4 НазначениеПлатежа5 НазначениеПлатежа6
	СтрокаЭкспорта.НазначениеПлатежа = СтрЗаменить(СтрЗаменить(СтрЗаменить(ВыборкаДляЭкспорта.НазначениеПлатежа, Символы.ПС, ""), Символы.ВК, ""), Символы.ПФ, "");
	КоличествоСтрокНП = СтрЧислоСтрок(ВыборкаДляЭкспорта.НазначениеПлатежа);
	
	Если КоличествоСтрокНП > 6 Тогда
		КоличествоСтрокНП = 6;
	КонецЕсли;
	
	Для Сч = 1 По КоличествоСтрокНП Цикл
		СтрокаЭкспорта["НазначениеПлатежа" + Сч] = СтрПолучитьСтроку(ВыборкаДляЭкспорта.НазначениеПлатежа, Сч);
	КонецЦикла;
	
	Для Сч = (КоличествоСтрокНП + 1) По 6 Цикл
		СтрокаЭкспорта["НазначениеПлатежа" + Сч] = "";
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСекциюДокумент(СтруктураДокумента, КоллекцияРеквизитов)
	
	Буфер = "";
	Реквизит = "";
	СтуртураДляЗаписи = СформироватьСтруктуруЭкспорта();
	
	если Программа = "Система ДБО BS-Client V.3 BSS" тогда
		СтуртураДляЗаписи.Удалить("Плательщик3");
		СтуртураДляЗаписи.Удалить("Плательщик4");
	КонецЕсли;	
	
	ЗаполнитьЗначениеЭкспорта(СтуртураДляЗаписи,СтруктураДокумента);

	
	//ДобавитьВСтроку(Буфер, "СекцияДокумент=" + СтруктураДокумента.ВидДокумента);  // +++
	ДобавитьВСтроку(Буфер, "СекцияДокумент=Платежное поручение");
	
	Для каждого ВыгружаемыйРеквизит из СтуртураДляЗаписи Цикл
		Значение = ПривестиЗначение(ВыгружаемыйРеквизит.Значение);
		Если НЕ ПустаяСтрока(Значение) Тогда
			ДобавитьВСтроку(Буфер, ВыгружаемыйРеквизит.Ключ + "=" + Значение);
		КонецЕсли;
	КонецЦикла;
	
	ДобавитьВСтроку(Буфер, "КонецДокумента");
	
	Возврат Буфер;
	
КонецФункции

Процедура Выгрузить(ДокументыНаЭкспорт) Экспорт
	
	ПотокВыгрузки = Новый ТекстовыйДокумент();
	
	// Формируем заголовок
	ПотокВыгрузки.ДобавитьСтроку("1CClientBankExchange");
	ПотокВыгрузки.ДобавитьСтроку("ВерсияФормата=1.01");
	
	ПотокВыгрузки.ДобавитьСтроку("Кодировка=" + Кодировка);
	//ПотокВыгрузки.ДобавитьСтроку("Отправитель=Бухгалтерия предприятия, редакция 1.6");  //+++
	ПотокВыгрузки.ДобавитьСтроку("Отправитель=" + Метаданные.Синоним);
	
	Если ЭтотОБъект.БанковскийСчет=Справочники.БанковскиеСчета.НайтиПоНаименованию("ТКБ") ТОгда
		 ПотокВыгрузки.ДобавитьСтроку("Получатель=iBank 2");
	Иначе
		 ПотокВыгрузки.ДобавитьСтроку("Получатель=" + Программа);
	КонецЕсли;	 
	
	
	ПотокВыгрузки.ДобавитьСтроку("ДатаСоздания=" + Формат(ТекущаяДата(),"ДЛФ=Д"));
	ПотокВыгрузки.ДобавитьСтроку("ВремяСоздания=" + Формат(ТекущаяДата(),"ДЛФ=В"));
	ПотокВыгрузки.ДобавитьСтроку("ДатаНачала=" + Формат(НачПериода,"ДЛФ=Д"));
	ПотокВыгрузки.ДобавитьСтроку("ДатаКонца=" + Формат(КонПериода,"ДЛФ=Д"));
	
	ПотокВыгрузки.ДобавитьСтроку("РасчСчет=" + БанковскийСчет.НомерСчета);
	
	ПотокВыгрузки.ДобавитьСтроку("Документ=Платежное поручение"); //++++

	//Для каждого Строка Из ТаблицаДокументов Цикл
	//	Если Строка.Пометка = Истина Тогда
	//		ИмяДокумента = СокрЛП(Строка.Название);
	//		ПотокВыгрузки.ДобавитьСтроку("Документ=" + ИмяДокумента);
	//	КонецЕсли;	
	//КонецЦикла;
	
	// выводим отмеченные секции документов
	Для каждого СтрокаСекции из ДокументыНаЭкспорт.Значение Цикл
		Если НЕ(СтрокаСекции.Выгружать)Тогда
			Продолжить;
		КонецЕсли;
		Буфер = ПолучитьСекциюДокумент(СтрокаСекции, ДокументыНаЭкспорт.Колонки);
		//Кухарь 03.12.15 начало
		если Программа = "Система ДБО BS-Client V.3 BSS" тогда
			Буфер=СтрЗаменить(Буфер,"Плательщик2","ПлательщикРасчСчет");
			Буфер=СтрЗаменить(Буфер,"Система ДБО BS-Client V.3 BSS","Система ДБО BS-Client");
			//Буфер=СтрЗаменить(Буфер,"Плательщик3","ПлательщикБанк1");
			//Буфер=СтрЗаменить(Буфер,"Плательщик4","ПлательщикБанк2");
		КонецЕсли;
		//Кухарь 03.12.15 конец
		
		КоличествоСрокСекции = СтрЧислоСтрок(Буфер);
		Для Сч = 1 По КоличествоСрокСекции Цикл
			ПотокВыгрузки.ДобавитьСтроку(СтрПолучитьСтроку(Буфер, Сч));
		КонецЦикла;
		СтрокаСекции.Готовность = -2;
				
		//-----------------------
		// помечаем что документ, что он уже выгружался 
		
		ТекОб=СтрокаСекции.Документ.ПолучитьОбъект();
		ТекОб.Выгружена=Истина;
		ТекОб.записать();
		
	КонецЦикла;
	
	// записываем на диск
	ПотокВыгрузки.ДобавитьСтроку("КонецФайла");
	Попытка
		Если Кодировка = "DOS" Тогда
			ПотокВыгрузки.Записать(ФайлВыгрузки,КодировкаТекста.OEM);
		Иначе
			ПотокВыгрузки.Записать(ФайлВыгрузки,КодировкаТекста.ANSI);
		КонецЕсли;
		// Отметим те документы которые успешно загрузились
		Для каждого СтрокаСекции из ДокументыНаЭкспорт.Значение Цикл
			Если СтрокаСекции.Готовность = -2 Тогда
				СтрокаСекции.Готовность = -1;
			КонецЕсли;
		КонецЦикла;
		
		Сообщить("Данные успешно выгружены в файл " + ФайлВыгрузки);
	Исключение
		Сообщить("Не удалось записать данные в файл. Возможно, отсутствует каталог." + ФайлВыгрузки);
	КонецПопытки
	
КонецПроцедуры


///////////// Модуль     //////////////////////////////////////////////////

ПустаяДата = Дата("00010101");

ЗаполнитьСтрокиРеквизитовПлДокументовДляИмпорта();

// Общее
СформироватьТегиЗаголовка();
СформироватьТегиРасчетногоСчета();

// Экспорт
СформироватьСоответствиеВыгружаемых();
Импорт_ТекстДляРазбора = "";


мВалютаРегламентированногоУчета = Константы.ВалютаУпрУчета.Получить();
СписокКонтрагентов =Новый СписокЗначений();

#КонецЕсли

