
Процедура СогласованоЦОПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадачиПользователя.Согласовано КАК Согласовано
	|ИЗ
	|	Задача.ЗадачиПользователя КАК ЗадачиПользователя
	|ГДЕ
	|	ЗадачиПользователя.БизнесПроцесс = &БизнесПроцесс
	|	И ЗадачиПользователя.ТочкаМаршрута = &ТочкаМаршрута";
	
	Запрос.УстановитьПараметр("БизнесПроцесс", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ТочкаМаршрута", БизнесПроцессы.РасформированиеНакладной.ТочкиМаршрута.СогласоватьЦО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Результат = ВыборкаДетальныеЗаписи.Согласовано;
	Если Результат Тогда
	   СформироватьУведомление("Уведомление о утверждении расформирования РНК в ЦО");
	Иначе	
		СформироватьУведомление("Уведомление о отклонении расформирования РНК");
		РНКОбъект = ОбъектСогласования.ПолучитьОбъект();
		РНКОбъект.СостояниеКоррекции = Перечисления.СостоянияКоррекции.Отклонена;
		РНКОбъект.Записать(РежимЗаписиДокумента.Проведение);

	КонецЕсли;
	
КонецПроцедуры

Процедура СогласоватьЦОПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Задача = СоздатьЗадачу(ТочкаМаршрутаБизнесПроцесса);
	ФормируемыеЗадачи.Добавить(Задача);
	СформироватьУведомление("Уведомление о расформировании РНК");

КонецПроцедуры

Процедура СогласоватьСКПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Задача = СоздатьЗадачу(ТочкаМаршрутаБизнесПроцесса);
	ФормируемыеЗадачи.Добавить(Задача);
КонецПроцедуры

Процедура СогласоватьОВЛПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Задача = СоздатьЗадачу(ТочкаМаршрутаБизнесПроцесса);
	ФормируемыеЗадачи.Добавить(Задача);
КонецПроцедуры

Процедура ИнформироватьИнициатораСогласованоПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Задача = СоздатьЗадачу(ТочкаМаршрутаБизнесПроцесса);
	ФормируемыеЗадачи.Добавить(Задача);
КонецПроцедуры

Процедура ИнформироватьИнициатораНеСогласованоПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Задача = СоздатьЗадачу(ТочкаМаршрутаБизнесПроцесса);
	ФормируемыеЗадачи.Добавить(Задача);
КонецПроцедуры

Функция СоздатьЗадачу(Знач ТочкаМаршрутаБизнесПроцесса)
	
	Задача = Задачи.ЗадачиПользователя.СоздатьЗадачу();
	
	Задача.Дата                          = ТекущаяДата();
	Задача.Инициатор                     = Инициатор;
	Задача.Наименование                  = ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи;
	Задача.Объект                      	 = ОбъектСогласования;
	Если ТочкаМаршрутаБизнесПроцесса.РольИсполнителя.Пустая() Тогда
		Задача.Исполнитель = ЭтотОбъект.Инициатор;
	Иначе
		Задача.РольИсполнителя           = ТочкаМаршрутаБизнесПроцесса.РольИсполнителя;
	КонецЕсли;
	Задача.БизнесПроцесс                 = Ссылка;
	Задача.ТочкаМаршрута                 = ТочкаМаршрутаБизнесПроцесса;
	
	Возврат Задача;
	
КонецФункции

Процедура ОбработатьРезультатыОбработка(ТочкаМаршрутаБизнесПроцесса)
	Если ПараметрыСеанса.ЭтотУзел.Код = "OD7" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗаданиеНабора.Ссылка КАК ЗНБ,
		|	ЗаданиеНабора.СостояниеНакладной КАК СостояниеНакладной
		|ИЗ
		|	Документ.ЗаданиеНабора КАК ЗаданиеНабора
		|ГДЕ
		|	ЗаданиеНабора.Накладная = &Накладная
		|	";
		//Параметры запроса
		Запрос.УстановитьПараметр("Накладная",ОбъектСогласования);// РНК
		Результат = Запрос.Выполнить();
		тзЗаданияНабора=Результат.Выгрузить();
		//Выборка = Результат.Выбрать();
		//Пока Выборка.Следующий() Цикл
		//	НоваяСтрока = тзЗаданияНабора.Добавить();
		//	ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		//КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПланНабора.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПланНабора КАК ПланНабора
		|ГДЕ
		|	ПланНабора.Накладная = &Накладная";
		//Параметры запроса
		Запрос.УстановитьПараметр("Накладная",ОбъектСогласования);// Не определено
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ПланНабора = Выборка.Ссылка;
		
		//тзПланНабора.Очистить();
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПланНаборатБрэндов.НомерСтроки КАК НомерСтроки,
		|	ПланНаборатБрэндов.Состояние КАК Состояние
		|ИЗ
		|	Документ.ПланНабора.тБрэндов КАК ПланНаборатБрэндов
		|ГДЕ
		|	ПланНаборатБрэндов.Ссылка.Накладная = &Накладная";
		//Параметры запроса
		Запрос.УстановитьПараметр("Накладная",ОбъектСогласования);// РНК
		Результат = Запрос.Выполнить();
		тзПланНабора = Результат.Выгрузить();
		//Выборка = Результат.Выбрать();
		//Пока Выборка.Следующий() Цикл
		//	НоваяСтрока = тзПланНабора.Добавить();
		//	ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		//КонецЦикла;
		
		//тзЛистЗагрузкиЗаявка.Очистить();
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка КАК РНК,
		|	ЛистЗагрузкиЗаявка.Ссылка КАК ЛистЗагрузки,
		|	ЛистЗагрузкиЗаявка.НомерСтроки КАК НомерСтроки,
		|	ЛистЗагрузкиЗаявка.НомерНакладной КАК НомерНакладной,
		|	ЛистЗагрузкиЗаявка.ДатаНакладной КАК ДатаНакладной,
		|	ЛистЗагрузкиЗаявка.Получатель КАК Получатель,
		|	ЛистЗагрузкиЗаявка.ПунктДоставки КАК ПунктДоставки,
		|	ЛистЗагрузкиЗаявка.КоличествоКоробок КАК КоличествоКоробок,
		|	ЛистЗагрузкиЗаявка.ВидНакладной КАК ВидНакладной
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистЗагрузки.Заявка КАК ЛистЗагрузкиЗаявка
		|		ПО РасходнаяНакладная.Номер = ЛистЗагрузкиЗаявка.НомерНакладной
		|			И (НАЧАЛОПЕРИОДА(РасходнаяНакладная.Дата, ГОД) = НАЧАЛОПЕРИОДА(ЛистЗагрузкиЗаявка.ДатаНакладной, ГОД))
		|ГДЕ
		|	ЛистЗагрузкиЗаявка.ВидНакладной = ""РНК""
		|	И РасходнаяНакладная.Ссылка = &Ссылка";
		//Параметры запроса
		Запрос.УстановитьПараметр("Ссылка",ОбъектСогласования);// РНК
		Результат = Запрос.Выполнить();
		тзЛистЗагрузкиЗаявка = Результат.Выгрузить();
		////ЭлементыФормы.тзЛистЗагрузкиЗаявка.СоздатьКолонки();
		//Выборка = Результат.Выбрать();
		//Пока Выборка.Следующий() Цикл
		//	НоваяСтрока = тзЛистЗагрузкиЗаявка.Добавить();
		//	ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		//КонецЦикла;
		
		//тзЛистЗагрузкиЛистыНабора.Очистить();
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка КАК РНК,
		|	ЛистЗагрузкиЛистыНабора.Ссылка КАК ЛистЗагрузки,
		|	ЛистЗагрузкиЛистыНабора.Ссылка.СостояниеНакладной КАК Состояние,
		|	ЛистЗагрузкиЛистыНабора.НомерСтроки КАК НомерСтроки,
		|	ЛистЗагрузкиЛистыНабора.НомерНакладной КАК НомерНакладной,
		|	ЛистЗагрузкиЛистыНабора.ДатаНакладной КАК ДатаНакладной,
		|	ЛистЗагрузкиЛистыНабора.ШККоробки КАК ШККоробки,
		|	ЛистЗагрузкиЛистыНабора.НомерКоробки КАК НомерКоробки,
		|	ЛистЗагрузкиЛистыНабора.ВидНакладной КАК ВидНакладной,
		|	ЛистЗагрузкиЛистыНабора.ВремяСканирования КАК ВремяСканирования,
		|	ЛистЗагрузкиЛистыНабора.Получатель КАК Получатель,
		|	ЛистЗагрузкиЛистыНабора.ПунктДоставки КАК ПунктДоставки,
		|	ЛистЗагрузкиЛистыНабора.Паллета КАК Паллета,
		|	ЛистЗагрузкиЛистыНабора.ШКПаллеты КАК ШКПаллеты
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистЗагрузки.ЛистыНабора КАК ЛистЗагрузкиЛистыНабора
		|		ПО РасходнаяНакладная.Номер = ЛистЗагрузкиЛистыНабора.НомерНакладной
		|			И (НАЧАЛОПЕРИОДА(РасходнаяНакладная.ДатаОтгрузки, ДЕНЬ) = НАЧАЛОПЕРИОДА(ЛистЗагрузкиЛистыНабора.Ссылка.ДатаОтгрузки, ДЕНЬ))
		|ГДЕ
		|	ЛистЗагрузкиЛистыНабора.ВидНакладной = ""РНК""
		|	И РасходнаяНакладная.Ссылка = &Ссылка";
		//Параметры запроса
		Запрос.УстановитьПараметр("Ссылка",ОбъектСогласования);// РНК
		Результат = Запрос.Выполнить();
		
		тзЛистЗагрузкиЛистыНабора = Результат.Выгрузить();
		//ЭлементыФормы.тзЛистЗагрузкиЛистыНабора.СоздатьКолонки();
		//Выборка = Результат.Выбрать();
		//Пока Выборка.Следующий() Цикл
		//	НоваяСтрока = тзЛистЗагрузкиЛистыНабора.Добавить();
		//	ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		//КонецЦикла;
		
		//тзЗаявкаНаОтгрузкуСтроки.Очистить();
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка КАК РНК,
		|	ЗаявкаНаОтгрузкуНакладные.Ссылка КАК ЗаявкаНаОтгрузку,
		|	ЗаявкаНаОтгрузкуНакладные.НомерСтроки КАК НомерСтроки,
		|	ЗаявкаНаОтгрузкуНакладные.ДатаНакладной КАК ДатаНакладной,
		|	ЗаявкаНаОтгрузкуНакладные.ВидНакладной КАК ВидНакладной,
		|	ЗаявкаНаОтгрузкуНакладные.СостояниеНакладной КАК СостояниеНакладной,
		|	ЗаявкаНаОтгрузкуНакладные.Доставлена КАК Доставлена,
		|	ЗаявкаНаОтгрузкуНакладные.НеОтгружать КАК НеОтгружать,
		|	ЗаявкаНаОтгрузкуНакладные.Накладная КАК Накладная,
		|	ЗаявкаНаОтгрузкуНакладные.ТипДоставки КАК ТипДоставки
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаОтгрузку.Накладные КАК ЗаявкаНаОтгрузкуНакладные
		|		ПО РасходнаяНакладная.Ссылка = ЗаявкаНаОтгрузкуНакладные.Накладная
		|ГДЕ
		|	ЗаявкаНаОтгрузкуНакладные.ВидНакладной = ""РНК""
		|	И РасходнаяНакладная.Ссылка = &Ссылка";
		//Параметры запроса
		Запрос.УстановитьПараметр("Ссылка",ОбъектСогласования);// РНК
		Результат = Запрос.Выполнить();
		тзЗаявкаНаОтгрузкуСтроки = Результат.Выгрузить();
		//Выборка = Результат.Выбрать();
		//Пока Выборка.Следующий() Цикл
		//	НоваяСтрока = тзЗаявкаНаОтгрузкуСтроки.Добавить();
		//	ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		//КонецЦикла;
		НачатьТранзакцию();
		Для каждого Строка Из тзЗаданияНабора Цикл
			ЗНБОбъект = Строка.ЗНБ.ПолучитьОбъект();
			ЗНБОбъект.Заблокировать();
			ЗНБОбъект.СостояниеНакладной = Перечисления.СостоянияНакладной.Отменена;
			
			// Кухарь А.Ю.  13.09.2022 начало
			// ЗНБОбъект.Записать();
			ЗНБОбъект.Записать(РежимЗаписиДокумента.Проведение);		 
			// Кухарь А.Ю.  13.09.2022 конец
			
		КонецЦикла;
		
		Попытка
			ПланНабораОбъект = ПланНабора.ПолучитьОбъект();
			ПланНабораОбъект.Заблокировать();
			Для каждого Строка Из ПланНабораОбъект.тБрэндов Цикл
				Строка.Состояние = Перечисления.СостоянияНакладной.Отменена; 
			КонецЦикла;
			ПланНабораОбъект.Записать();
		Исключение
		КонецПопытки;
	
		УникальныеЗаявки = тзЛистЗагрузкиЗаявка.Скопировать(,"ЛистЗагрузки");
		УникальныеЗаявки.Свернуть("ЛистЗагрузки");
		Для каждого Заявка Из УникальныеЗаявки Цикл
			ЛистЗагрузкиОбъект = Заявка.ЛистЗагрузки.ПолучитьОбъект();
			ЛистЗагрузкиОбъект.Заблокировать();
			ПараметрыОтбора = Новый Структура("ЛистЗагрузки",Заявка.ЛистЗагрузки);
			МассивУдаляемыхСтрок = Новый Массив;
			МассивСтрок = тзЛистЗагрузкиЗаявка.НайтиСтроки(ПараметрыОтбора);
			Для Каждого мСтрока Из МассивСтрок Цикл
				МассивУдаляемыхСтрок.Добавить(ЛистЗагрузкиОбъект.Заявка.Получить(мСтрока.НомерСтроки - 1));
			КонецЦикла;
			Для каждого УдаляемаяСтрока Из МассивУдаляемыхСтрок Цикл
				ЛистЗагрузкиОбъект.Заявка.Удалить(УдаляемаяСтрока);
			КонецЦикла;
			ЛистЗагрузкиОбъект.Записать();
		КонецЦикла;
		
		УникальныеЗаявки = тзЛистЗагрузкиЛистыНабора.Скопировать(,"ЛистЗагрузки");
		УникальныеЗаявки.Свернуть("ЛистЗагрузки");
		Для каждого Заявка Из УникальныеЗаявки Цикл
			ЛистЗагрузкиОбъект = Заявка.ЛистЗагрузки.ПолучитьОбъект();
			ЛистЗагрузкиОбъект.Заблокировать();
			ПараметрыОтбора = Новый Структура("ЛистЗагрузки",Заявка.ЛистЗагрузки);
			МассивУдаляемыхСтрок = Новый Массив;
			МассивСтрок = тзЛистЗагрузкиЛистыНабора.НайтиСтроки(ПараметрыОтбора);
			Для Каждого мСтрока Из МассивСтрок Цикл
				МассивУдаляемыхСтрок.Добавить(ЛистЗагрузкиОбъект.ЛистыНабора.Получить(мСтрока.НомерСтроки - 1));
			КонецЦикла;
			Для каждого УдаляемаяСтрока Из МассивУдаляемыхСтрок Цикл
				ЛистЗагрузкиОбъект.ЛистыНабора.Удалить(УдаляемаяСтрока);
			КонецЦикла;
			ЛистЗагрузкиОбъект.Записать();
		КонецЦикла;
		
		УникальныеЛистыЗагрузки = тзЗаявкаНаОтгрузкуСтроки.Скопировать(,"ЗаявкаНаОтгрузку");
		УникальныеЛистыЗагрузки.Свернуть("ЗаявкаНаОтгрузку");
		Для каждого ЗаявкаНаОтгрузку Из УникальныеЛистыЗагрузки Цикл
			ЗаявкаНаОтгрузкуОбъект = ЗаявкаНаОтгрузку.ЗаявкаНаОтгрузку.ПолучитьОбъект();
			ЗаявкаНаОтгрузкуОбъект.Заблокировать();
			ПараметрыОтбора = Новый Структура("ЗаявкаНаОтгрузку",ЗаявкаНаОтгрузку.ЗаявкаНаОтгрузку);
			МассивИзменяемыхСтрок = Новый Массив;
			МассивСтрок = тзЗаявкаНаОтгрузкуСтроки.НайтиСтроки(ПараметрыОтбора);
			Для Каждого мСтрока Из МассивСтрок Цикл
				МассивИзменяемыхСтрок.Добавить(ЗаявкаНаОтгрузкуОбъект.Накладные.Получить(мСтрока.НомерСтроки - 1));
			КонецЦикла;
			Для каждого ИзменяемаяСтрока Из МассивИзменяемыхСтрок Цикл
				ИзменяемаяСтрока.НеОтгружать = Истина;
			КонецЦикла;
			ЗаявкаНаОтгрузкуОбъект.Записать();
		КонецЦикла;
		
		РНКОбъект = ОбъектСогласования.ПолучитьОбъект();
		РНКОбъект.СостояниеНакладной = Перечисления.СостоянияНакладной.Отменена;
		РНКОбъект.Отгружен = Перечисления.Отгружен.Отменен;
		РНКОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		ЗафиксироватьТранзакцию();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		// Заполнение шапки
		Дата= ТекущаяДата();
		ОбъектСогласования = ДанныеЗаполнения.Ссылка;     
		Инициатор = ПараметрыСеанса.Пользователь;
		СостояниеСогласования = Перечисления.СостояниеОбъектаСогласования.НаСогласовании;
		ДатаСтарта = Дата;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаявкаСогласованаПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	ЭтотОбъект.СостояниеСогласования = Перечисления.СостояниеОбъектаСогласования.Согласован;
	ЭтотОбъект.ДатаЗавершения = ТекущаяДата();
	РНКОбъект = ОбъектСогласования.ПолучитьОбъект();
	РНКОбъект.Отгружен = Перечисления.Отгружен.Отменен;
	//РНКОбъект.СостояниеКоррекции = Перечисления.СостоянияКоррекции.Принята;
	РНКОбъект.СостояниеКоррекции = Перечисления.СостоянияКоррекции.Отработана;
	РНКОбъект.Записать(РежимЗаписиДокумента.Проведение);

КонецПроцедуры

Процедура ЗаявкаНеСогласованаПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	ЭтотОбъект.СостояниеСогласования = Перечисления.СостояниеОбъектаСогласования.НеСогласован;
	ЭтотОбъект.ДатаЗавершения = ТекущаяДата();
КонецПроцедуры

Процедура РасформированиеСогласованоПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадачиПользователя.Согласовано КАК Согласовано,
	|	ЗадачиПользователя.Ссылка КАК Ссылка,
	|	ЗадачиПользователя.ТочкаМаршрута КАК ТочкаМаршрута,
	|	ЗадачиПользователя.БизнесПроцесс КАК БизнесПроцесс,
	|	ЗадачиПользователя.Выполнена КАК Выполнена
	|ИЗ
	|	Задача.ЗадачиПользователя КАК ЗадачиПользователя
	|ГДЕ
	|	ЗадачиПользователя.БизнесПроцесс = &БизнесПроцесс
	|	И ЗадачиПользователя.ТочкаМаршрута = &ТочкаМаршрута";
	
	Запрос.УстановитьПараметр("БизнесПроцесс", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ТочкаМаршрута", БизнесПроцессы.РасформированиеНакладной.ТочкиМаршрута.СогласоватьОВЛ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	ОВЛСогласовано = ВыборкаДетальныеЗаписи.Согласовано;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадачиПользователя.Согласовано КАК Согласовано,
	|	ЗадачиПользователя.Ссылка КАК Ссылка,
	|	ЗадачиПользователя.ТочкаМаршрута КАК ТочкаМаршрута,
	|	ЗадачиПользователя.БизнесПроцесс КАК БизнесПроцесс,
	|	ЗадачиПользователя.Выполнена КАК Выполнена
	|ИЗ
	|	Задача.ЗадачиПользователя КАК ЗадачиПользователя
	|ГДЕ
	|	ЗадачиПользователя.БизнесПроцесс = &БизнесПроцесс
	|	И ЗадачиПользователя.ТочкаМаршрута = &ТочкаМаршрута";
	
	Запрос.УстановитьПараметр("БизнесПроцесс", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ТочкаМаршрута", БизнесПроцессы.РасформированиеНакладной.ТочкиМаршрута.СогласоватьСК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	СКСогласовано = ВыборкаДетальныеЗаписи.Согласовано;
	Результат = ОВЛСогласовано И СКСогласовано;
	БизнесПроцессОбъект = ВыборкаДетальныеЗаписи.БизнесПроцесс.ПолучитьОбъект();
	Если Результат Тогда
		БизнесПроцессОбъект.СостояниеСогласования = Перечисления.СостояниеОбъектаСогласования.Согласован;
		РНКОбъект = ОбъектСогласования.ПолучитьОбъект();
		//РНКОбъект.СостояниеКоррекции = Перечисления.СостоянияКоррекции.Утверждена;
		//РНКОбъект.Записать(РежимЗаписиДокумента.Проведение);
		РНКОбъект.СостояниеКоррекции = Перечисления.СостоянияКоррекции.Принята;
		РНКОбъект.ЗаписатьБезОбработки(РежимЗаписиДокумента.Запись);
	Иначе
		БизнесПроцессОбъект.СостояниеСогласования = Перечисления.СостояниеОбъектаСогласования.НеСогласован;
		РНКОбъект = ОбъектСогласования.ПолучитьОбъект();
		РНКОбъект.СостояниеКоррекции = Перечисления.СостоянияКоррекции.Отклонена;
		//РНКОбъект.Записать(РежимЗаписиДокумента.Проведение);
		РНКОбъект.ЗаписатьБезОбработки(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	БизнесПроцессОбъект.Записать();
	Если БизнесПроцессОбъект.СостояниеСогласования = Перечисления.СостояниеОбъектаСогласования.Согласован Тогда
		СформироватьУведомление("Уведомление о утверждении расформирования РНК");
	Иначе	
		СформироватьУведомление("Уведомление о отклонении расформирования РНК");
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
КонецПроцедуры

//Кухарь 10.01.19 начало
//Создание записей в РС ПисьмаНаОтправку
Процедура СформироватьУведомление(ВидУведомления) экспорт
	
	СписокПолучателей=новый СписокЗначений;
	ТемаПисьма=ВидУведомления;
	
	ТекстПисьма="";
	Если ВидУведомления="Уведомление о расформировании РНК" Тогда	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(ИсполнителиЗадач.Исполнитель.ФизЛицо.ЕМэйл КАК СТРОКА(100)) КАК ИсполнительФизЛицоЕМэйл
		|ИЗ
		|	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
		|ГДЕ
		|	ИсполнителиЗадач.РольИсполнителя = ЗНАЧЕНИЕ(Справочник.РолиИсполнителей.Согласующий_ЦО)";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если Найти(ВыборкаДетальныеЗаписи.ИсполнительФизЛицоЕМэйл,"@")>0 тогда
				СписокПолучателей.Добавить(СокрЛП(ВыборкаДетальныеЗаписи.ИсполнительФизЛицоЕМэйл));
			КонецЕсли;
		КонецЦикла;
		
		ТекстПисьма="Утверждение расформирования "+ЭтотОбъект.ОбъектСогласования+" было инициировано пользователем "+ЭтотОбъект.Инициатор;
		
		
	ИначеЕсли ВидУведомления="Уведомление о утверждении расформирования РНК в ЦО"  тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(ИсполнителиЗадач.Исполнитель.ФизЛицо.ЕМэйл КАК СТРОКА(100)) КАК ИсполнительФизЛицоЕМэйл
		|ИЗ
		|	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
		|ГДЕ
		|	(ИсполнителиЗадач.РольИсполнителя = ЗНАЧЕНИЕ(Справочник.РолиИсполнителей.Согласующий_СК)
		|			ИЛИ ИсполнителиЗадач.РольИсполнителя = ЗНАЧЕНИЕ(Справочник.РолиИсполнителей.Согласующий_ОВЛ))";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если Найти(ВыборкаДетальныеЗаписи.ИсполнительФизЛицоЕМэйл,"@")>0 тогда
				СписокПолучателей.Добавить(СокрЛП(ВыборкаДетальныеЗаписи.ИсполнительФизЛицоЕМэйл));
			КонецЕсли;
		КонецЦикла;
		
		ТекстПисьма="Расформирование "+ЭтотОбъект.ОбъектСогласования+" было инициировано пользователем "+ЭтотОбъект.Инициатор;
		
	ИначеЕсли ВидУведомления="Уведомление о утверждении расформирования РНК"  тогда
		
		СписокПолучателей.Добавить(СокрЛП(ЭтотОбъект.Инициатор.ФизЛицо.ЕМэйл));
		
		ТекстПисьма="Расформирование "+ЭтотОбъект.ОбъектСогласования+" было утверждено.";
		
	ИначеЕсли ВидУведомления="Уведомление о отклонении расформирования РНК"  тогда
		
		СписокПолучателей.Добавить(СокрЛП(ЭтотОбъект.Инициатор.ФизЛицо.ЕМэйл));
		
		ТекстПисьма="Расформирование "+ЭтотОбъект.ОбъектСогласования+" было отклонено.";
		
	КонецЕсли;
	
	
	Если СокрЛП(ТекстПисьма="") Тогда
		ЗаписатьВЛог("Регламент","Пустой текст при формировании письма к коррекции № "+Номер,"Ошибка");		
	ИначеЕсли СписокПолучателей.Количество()=0 Тогда
		ЗаписатьВЛог("Регламент","Пустой список адресатов при формировании письма к коррекции № "+Номер,"Ошибка");
	Иначе
		ПодготовитьПисьмоКОтправке (СписокПолучателей,ТекстПисьма,ТемаПисьма);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьПисьмоКОтправке (СписокПолучателей,ТекстПисьма,ТемаПисьма)
	СписокАдресов="";
	для каждого Стр из СписокПолучателей цикл
		если Найти(СписокАдресов,Стр.Значение)=0 тогда
			СписокАдресов=СписокАдресов+Стр.Значение+"##";
		КонецЕсли;
	КонецЦикла;
	
	СписокАдресов=лев(СписокАдресов,СтрДлина(СписокАдресов)-2);
	
	
	ЗаписьВРег=РегистрыСведений.ПисьмаНаОтправку.СоздатьМенеджерЗаписи();
	ЗаписьВРег.Основание=Ссылка;	
	ЗаписьВРег.ДатаСозданияПисьма=ТекущаяДата();
	ЗаписьВРег.период=ЗаписьВРег.ДатаСозданияПисьма;
	
	ЗаписьВРег.ТекстПисьма=ТекстПисьма;
	ЗаписьВРег.ТемаПисьма=ТемаПисьма;
	ЗаписьВРег.СписокПолучателей=СписокАдресов;
	ЗаписьВРег.Записать();	
КонецПроцедуры
//Кухарь 10.01.19 конец


