Процедура ВывестиПротокол(ТабПротокола=Неопределено,УзелКорреспондент,Результат,ВидОперации="Загрузка")				
	ЭтотУзел=ПараметрыСеанса.ЭтотУзел;
	
	ТДПротокол=Новый ТабличныйДокумент;
	
	Макет=ПолучитьОбщийМакет("ПротоколОбмена");
	
	ОблЗаголовок=Макет.ПолучитьОбласть("Заголовок");
	
	Если ВидОперации="Загрузка" Тогда
		ОблЗаголовок.Параметры.УзелОтправитель	=УзелКорреспондент.Код;
		ОблЗаголовок.Параметры.УзелПолучатель	=ЭтотУзел.Код;
		
		
		ОблЗаголовок.Параметры.ВидОперации=" загрузки";
		
		Если Результат.Результат Тогда
			ОблЗаголовок.Параметры.НомерСообщения	=УзелКорреспондент.НомерПринятого;	
			ИмяФайлаПротокола="Prot_"+УзелКорреспондент.Код+"_"+ЭтотУзел.Код+"_"+Формат(УзелКорреспондент.НомерПринятого,"ЧГ=")+".mxl";
		Иначе			
			ОблЗаголовок.Параметры.НомерСообщения	="?????";	
			ИмяФайлаПротокола="Prot_"+УзелКорреспондент.Код+"_"+ЭтотУзел.Код+"_"+СокрЛП(СтрЗаменить(Результат.Описание,"!",""))+"_"+Формат(ТекущаяДата(),"ДФ=yyyyMMddHHmmss") +".mxl";		
		КонецЕсли;		
	ИначеЕсли ВидОперации="Выгрузка" Тогда
		ОблЗаголовок.Параметры.УзелОтправитель	=ЭтотУзел.Код;
		ОблЗаголовок.Параметры.УзелПолучатель	=УзелКорреспондент.Код;
		
		ОблЗаголовок.Параметры.ВидОперации=" выгрузки";
		
		Если Результат.Результат Тогда
			ОблЗаголовок.Параметры.НомерСообщения	=УзелКорреспондент.НомерОтправленного;					
			ИмяФайлаПротокола="Prot_"+ЭтотУзел.Код+"_"+УзелКорреспондент.Код+"_"+Формат(УзелКорреспондент.НомерОтправленного,"ЧГ=")+".mxl";		
		Иначе
			ОблЗаголовок.Параметры.НомерСообщения	="?????";
			ИмяФайлаПротокола="Prot_"+ЭтотУзел.Код+"_"+УзелКорреспондент.Код+"_"+СокрЛП(СтрЗаменить(Результат.Описание,"!",""))+"_"+Формат(ТекущаяДата(),"ДФ=yyyyMMddHHmmss")+".mxl";
		КонецЕсли;		
	КонецЕсли;
	
	ОблЗаголовок.Параметры.ДатаЗагрузки		=ТекущаяДата();	
	ТДПротокол.Вывести(ОблЗаголовок);
	
	Если НЕ Результат.Результат Тогда
		ОблОшибка=Макет.ПолучитьОбласть("ОшибкаОбмена");
		ОблОшибка.Параметры.Описание=Результат.Описание;
		
		ТДПротокол.Вывести(ОблОшибка);
	КонецЕсли;
	
	Если ТипЗнч(ТабПротокола)=Тип("ТаблицаЗначений") Тогда
		
		
		ТабПротокола.Сортировать("Склад,Вид,Номер");
		
		БылСклад=Неопределено;
		
		
		Для Каждого СтрокаТЗ Из ТабПротокола Цикл
			Если БылСклад<>СтрокаТЗ.Склад Тогда
				ОблСклад	=Макет.ПолучитьОбласть("Склад");
				ОблСклад.Параметры.Заполнить(СтрокаТЗ);	
				
				ТДПротокол.Вывести(ОблСклад);
				
				ОблШапка	=Макет.ПолучитьОбласть("Шапка");
				ТДПротокол.Вывести(ОблШапка);	
				
				БылСклад=СтрокаТЗ.Склад;
			КонецЕсли;		
			
			ОблСтрока=Макет.ПолучитьОбласть("Строка");
			ОблСтрока.Параметры.Заполнить(СтрокаТЗ);		
			
			ТДПротокол.Вывести(ОблСтрока);		
		КонецЦикла; 	
	КонецЕсли; 
	
	//ТДПротокол.Записать(Константы.КаталогВнешнихОтчетов.Получить()+"Протоколы обмена\"+ИмяФайлаПротокола,ТипФайлаТабличногоДокумента.MXL);	
КонецПроцедуры

Процедура ВыполнитьОбменСУзлом(КодУзла)
	УзелОбмена=ПланыОбмена.Основной.НайтиПоКоду(КодУзла);				
	Если УзелОбмена.Пустая() Тогда
		Ошибки="Не найден узел обмена с кодом: """+КодУзла+""" !";								
		ЗаписатьВЛог("Регламент",Ошибки,"Ошибка");
	Иначе
		УзелОбъект=УзелОбмена.ПолучитьОбъект();
		
		Протокол=Неопределено;
		
		Результат=УзелОбъект.ПрочитатьСообщениеСИзменениями(,Протокол);
		ВывестиПротокол(Протокол,УзелОбъект,Результат,"Загрузка");				
		
		Протокол=Неопределено;
		
		Результат=УзелОбъект.ЗаписатьСообщениеСИзменениями(Протокол);
		ВывестиПротокол(Протокол,УзелОбъект,Результат,"Выгрузка");
		
		Результат=Истина;
	КонецЕсли;
КонецПроцедуры

Функция СтрокуВСписок(ИсхСтр)
	Стр=ИсхСтр;
	Массив=Новый Массив;
	
	Поз=Найти(Стр,",");
	Пока Поз<>0 И СтрДлина(Стр)>0 Цикл
		Массив.Добавить(СокрЛП(Лев(Стр,Поз-1)));
		Стр=Сред(Стр,Поз+1);	
		Поз=Найти(Стр,",");
	КонецЦикла;
	Если СтрДлина(Стр)>0 Тогда	
		Массив.Добавить(СокрЛП(Стр));
	КонецЕсли;
	
	Возврат Массив;
КонецФункции // СтрокуВСписок()

Процедура ОбменДанными(ТаблицаПараметров=Неопределено) Экспорт
	СтрокаСоединенияСразрешеннымОбменом	=ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения					=ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Кухарь А.Ю.  31.03.2026 начало
	//Рефакторинг. Приведение к 1й функции
	//Если ТекСтрокаСоединения <> СтрокаСоединенияСразрешеннымОбменом Тогда
	если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() тогда	
		//Кухарь А.Ю.  31.03.2026 конец	
		ЗаписатьВЛог("Регламент","Отмена выполнения. Задача: Обмен данными. Автообмен разрешен для базы: """+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");		
		Возврат;
	КонецЕсли;
	
	ЗаписатьВЛог("Регламент","Начало выполнения. "+ТипЗнч(ТаблицаПараметров),"Информация");
	Если ТаблицаПараметров<>Неопределено Тогда
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
			ЗаписатьВЛог("Регламент","Параметр: "+СтрокаТП.Имя+" - "+СтрокаТП.Значение,"Информация");
			Если СтрокаТП.Имя="КодыУзлов" Тогда
				КодыУзлов=СтрокуВСписок(СтрокаТП.Значение);
				Для Каждого КодУзла Из КодыУзлов Цикл				
					ЗаписатьВЛог("Автопроцедуры","Начало обмена с узлом: "+КодУзла,"Инфо");
					ВыполнитьОбменСУзлом(КодУзла);			
				КонецЦикла;			
			КонецЕсли; 
		КонецЦикла;			
	Иначе
		ЗаписатьВЛог("Регламент","Ошибка выполнения ! Не заданы параметры задачи !","Ошибка");
	КонецЕсли; 
	
	//крохин начало 24.03.2017
	//в ЦО проверяем отсутствие проводок и перепроводим
	Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		ПроверитьДокументы();
		//Кухарь 14.01.20 начало
		//У склада будем проверять наличие ЗНБ без проводок.
	ИначеЕсли ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.Склад Тогда
		ПроверитьДокументыСклад();	
		//Кухарь 14.01.20 конец		
	КонецЕсли;
	//крохин конец 24.03.2017	
	
	ЗаписатьВЛог("Регламент","Завершение выполнения.","Информация");	
	
	Если инт_ДлительныеОперации.ЭтоФоновоеЗадание() Тогда
		ОценкаПроизводительностиКлиентСервер.ЗаписатьКэшЛогов();			
	КонецЕсли;
КонецПроцедуры

Процедура ЗагрузкаКурсов(ТаблицаПараметров=Неопределено) Экспорт
	Обработка=Обработки.КурсыВалютРБК.Создать();
	Обработка.НачДата=ТекущаяДата()-14*24*60*60;
	Обработка.КонДата=ТекущаяДата()+24*60*60;
	
	Обработка.СписокВалют.Очистить();
	Выборка=Справочники.Валюты.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка=ПараметрыСеанса.ВалютаНац Тогда Продолжить КонецЕсли; 
		Если Выборка.ПометкаУдаления Тогда Продолжить КонецЕсли; 
		
		СтрокаТЧ=Обработка.СписокВалют.Добавить();	
		СтрокаТЧ.Валюта=Выборка.Ссылка;	
	КонецЦикла; 
	
	Обработка.ЗагрузитьКурсыСРБК();
КонецПроцедуры

Процедура ПроведениеДокументов(ТаблицаПараметров=Неопределено) Экспорт
	
	
	
	// Кухарь А.Ю.  17.12.2024 начало
	//
	
	//Обработка=Обработки.ПроведениеДокументов.Создать();
	//
	//Обработка.фПакетныйРежим=Истина;
	//Обработка.ПолучитьГП();
	//Обработка.ПровестиДокументы();	 
	СчОшибок=1;
	пока Истина цикл
		РезультатЗапуска=ЗаписатьПроведение (счОшибок);
		если  РезультатЗапуска.Успешно тогда
			Прервать;
		КонецЕсли;
		СчОшибок=счОшибок+1; 
		если СчОшибок>20 тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// Кухарь А.Ю.  17.12.2024 конец
	
КонецПроцедуры

Процедура ПроведениеДокументовПути(ТаблицаПараметров=Неопределено) Экспорт
	Обработка=Обработки.ПроведениеДокументовПути.Создать();
	
	Обработка.фПакетныйРежим=Истина;
	Обработка.ПолучитьГП();
	Обработка.ПровестиДокументы();	
КонецПроцедуры

Функция ТаблицаПараметровВСоответствие(тПараметры) Экспорт
	Результат = Новый Соответствие;
	Для каждого СтрокаП Из тПараметры Цикл		
		ТекЗнач = СтрокаП.Значение;
		
		БылоЗначение = Результат[СтрокаП.Имя];
		Если БылоЗначение <> Неопределено Тогда			
			Если ТипЗнч(БылоЗначение) <> Тип("Массив") Тогда				
				ВремЗначение = БылоЗначение;
				
				БылоЗначение = Новый Массив;
				БылоЗначение.Добавить(ВремЗначение);
			КонецЕсли;						
			БылоЗначение.Добавить(ТекЗнач);
			
			ТекЗнач = БылоЗначение;
		КонецЕсли;			
		Результат[СтрокаП.Имя] = ТекЗнач;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции //ТаблицаПараметровВСоответствие()

// Шворобей ВЮ 17.04.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4200
Функция ПолучитьСледующуюДатуОтгрузки(Знач ДатаОтсчета = Неопределено, ДокументСсылка = Неопределено, Рекурсия = 0) Экспорт
	
	ФлагЭтоСкладFBS = Ложь;
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		
		текПунктДоставки = ЗначениеРеквизитаОбъекта(ДокументСсылка, "ПунктДоставки");
		
		Если ЗначениеЗаполнено(текПунктДоставки) Тогда
			
			ФлагОтгружать = ПолучитьЗначениеКатегорииОбъекта(текПунктДоставки, "Отгружать 24/7");
			
			Если ФлагОтгружать Тогда
				Возврат КонецДня(ТекущаяДата()) + 1;	
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДокументСсылка.Склад) И ДокументСсылка.Склад.ЭтоСкладFBS Тогда
			ФлагЭтоСкладFBS = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	//++Данилова Е.В. 25.10.2024
	Если ЗначениеЗаполнено(ДатаОтсчета) Тогда
		Дата0 = КонецДня(ДатаОтсчета);
	ИначеЕсли ЗначениеЗаполнено(ДокументСсылка) Тогда
		Дата0 = КонецДня(ДокументСсылка.Дата);
	Иначе
		Дата0 = КонецДня(ТекущаяДата());	
	КонецЕсли;
	Запрос.УстановитьПараметр("Дата0", Дата0);
	//--Данилова Е.В. 25.10.2024
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КалендарьДни.Дата КАК Дата
	|ИЗ
	|	Справочник.Календарь.Дни КАК КалендарьДни
	|ГДЕ
	|	КалендарьДни.Часы <> 0
	|	И КалендарьДни.Дата > &Дата0
	|	И НЕ КалендарьДни.Ссылка.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	КалендарьДни.Дата";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		СледующаяДатаОтгрузки = Выборка.Дата;
		Если Рекурсия > 0 Тогда
			Возврат СледующаяДатаОтгрузки;	
		КонецЕсли;
	Иначе	
		ЗаписатьВЛог("Регламент","Не заполнен календарь на !","Ошибка");
		//++Данилова Е.В. 25.10.2024
		Возврат Дата0 + 1;
		//--Данилова Е.В. 25.10.2024
	КонецЕсли;
	
	Если НЕ ФлагЭтоСкладFBS Тогда
		СледующаяДатаОтгрузки = ПолучитьСледующуюДатуОтгрузки(СледующаяДатаОтгрузки,, Рекурсия + 1);
	КонецЕсли;
	
	Возврат СледующаяДатаОтгрузки;
	
КонецФункции
//крохин конец 01.11.2018

Процедура ФормированиеЗаявокНаОтгрузку(ТаблицаПараметров=Неопределено) Экспорт
	ЗаписатьВЛог("Регламент","Начало выполнения. "+ТипЗнч(ТаблицаПараметров),"Информация");
	Если ТаблицаПараметров<>Неопределено Тогда
		Параметры=Новый Соответствие;
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
			ЗаписатьВЛог("Регламент","Параметр: "+СтрокаТП.Имя+" - "+СтрокаТП.Значение,"Информация");		
			Параметры.Вставить(СтрокаТП.Имя,СтрокаТП.Значение);
		КонецЦикла;	
		
		
		ДатаОтгрузки=Параметры.Получить("ДатаОтгрузки");
		Если ДатаОтгрузки=Неопределено Тогда
				 
			//Кухарь А.Ю.  28.05.2025 начало              
			//ДатаОтгрузки=ПолучитьСледующуюДатуОтгрузки();	
			ДатаОтгрузки=ПолучитьСледующуюДатуОтгрузки(,,1);	 
			//Кухарь А.Ю.  28.05.2025 конец
			
		КонецЕсли;
		
		//крохин начало 01.11.2018
		//по выходным формируем дополнительный ЗОГ отдельным заданием со служебным параметром.
		ОтгрузкаПоВыходным = Параметры.Получить("ОтгрузкаПоВыходным");
		Если ОтгрузкаПоВыходным <> Неопределено И ОтгрузкаПоВыходным Тогда
			ДатаОтгрузкиПоВыходным = ПолучитьСледующуюДатуОтгрузкиСУчетомВыходных();
			Если ДатаОтгрузкиПоВыходным = ДатаОтгрузки Тогда
				ЗаписатьВЛог("Регламент","ЗОГ по выходным. Отмена выполнения","Информация");	
				Возврат;
			Иначе
				ДатаОтгрузки = ДатаОтгрузкиПоВыходным;
				ЗаписатьВЛог("Регламент","ЗОГ по выходным. Запуск выполнения на "+ Формат(ДатаОтгрузки,"ДФ=dd.MM.yyyy"),"Информация");
			КонецЕсли;
		КонецЕсли;
		
		//крохин конец 01.11.2018
		
		ВидЗаявки=Параметры.Получить("ВидЗаявки");
		Если ВидЗаявки=Неопределено Тогда			
			ЗаписатьВЛог("Регламент","В параметрах не задан вид заявки !","Ошибка");
			Возврат;
		КонецЕсли; 
		
		Склады=ТаблицаПараметров.НайтиСтроки(Новый Структура("Имя","Склад"));
		Для Каждого СтрокаСклада Из Склады Цикл
			Склад=СтрокаСклада.Значение;
			ЗаписатьВЛог("Регламент","Формирование ЗОГ по складу: "+Склад+", вид: "+ВидЗаявки,"Информация");	
			
			Док=Неопределено;
			Выборка=Документы.ЗаявкаНаОтгрузку.Выбрать(НачалоДня(ДатаОтгрузки),КонецДня(ДатаОтгрузки),Новый Структура("Склад",Склад));
			Пока Выборка.Следующий() Цикл				
				Если Док=Неопределено Тогда
					Док=Выборка.Ссылка;			
				Иначе					
					ВремДок=Выборка.ПолучитьОбъект();					
					ВремДок.УстановитьПометкуУдаления(Истина);					
				КонецЕсли;				
			КонецЦикла;
			
			Если Док=Неопределено Тогда
				ДокОбъект=Документы.ЗаявкаНаОтгрузку.СоздатьДокумент();
				
				ДокОбъект.Дата=ДатаОтгрузки;
				ЗаполнитьШапкуДокумента(ДокОбъект,ПараметрыСеанса.Пользователь);
			Иначе		
				ДокОбъект=Док.ПолучитьОбъект();			
			КонецЕсли; 
			
			ДокОбъект.ВидЗаявки	=ВидЗаявки;
			ДокОбъект.Склад		=Склад;			
			
			Обработка=Обработки.ЗаполнениеТЧ.Создать();
			Обработка.ДокОбъект=ДокОбъект;
			
			Обработка.ЗаполнитьЗаявкуНаОтгрузку();			
			
			Если ДокОбъект.ПометкаУдаления Тогда
				ДокОбъект.ПометкаУдаления=Ложь;				
			КонецЕсли;
			
			//крохин начало
			//формируем ЗОГ по всем складам, даже если не было накладных
			//Если ДокОбъект.Накладные.Количество()>0 Тогда
			//	ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.КОтправкеНаСклад;				
			//	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);				
			//Иначе
			//	ЗаписатьВЛог("Регламент","На "+ДатаОтгрузки+" не обнаружено накладных !","Информация");					
			//КонецЕсли;
			ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.КОтправкеНаСклад;	
			//крохин начало 27.02.2013
			//не записываем пустые документы
			//ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Если ДокОбъект.Накладные.Количество() > 0 Тогда
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);	
			КонецЕсли;
			//крохин конец 27.02.2013
			//крохин конец
			
		КонецЦикла;	
		
		// Кухарь А.Ю. 04.02.2021 начало
		// Дополнение накладными вспомогательных ЗОГ
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ
		|	ЗаявкаНаОтгрузку.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаявкаНаОтгрузку КАК ЗаявкаНаОтгрузку
		|ГДЕ
		|	ЗаявкаНаОтгрузку.Дата >= &Дата
		|	И ЗаявкаНаОтгрузку.Проведен
		|	И ЗаявкаНаОтгрузку.ВидЗаявки = &Вспомогательный
		|	И ЗаявкаНаОтгрузку.ДатаОтгрузки > &ТекущаяДата";
		запрос.УстановитьПараметр("Дата",Константы.ДатаЗапретаРедактирования.Получить());
		запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
		запрос.УстановитьПараметр("Вспомогательный",Перечисления.ВидыЗавокНаОтргузку.Вспомогательная);
		результат=запрос.Выполнить().Выбрать();
		пока результат.Следующий() цикл
			ДокОбъект=результат.ссылка.ПолучитьОбъект();
			Обработка=Обработки.ЗаполнениеТЧ.Создать();
			Обработка.ДокОбъект=ДокОбъект;		
			Обработка.ЗаполнитьЗаявкуНаОтгрузку();		
			Если ДокОбъект.Накладные.Количество() > 0 Тогда
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);	
			КонецЕсли;
			
		КонецЦикла;
		// Кухарь А.Ю. 04.02.2021 конец
		
		
		
	Иначе
		ЗаписатьВЛог("Регламент","Формирование ЗОГ ! Ошибка выполнения ! Не заданы параметры задачи !","Ошибка");
	КонецЕсли; 
	ЗаписатьВЛог("Регламент","Завершение выполнения.","Информация");
КонецПроцедуры
// Шворобей ВЮ 17.04.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4200

//крохин начало 01.11.2018
Функция ПолучитьСледующуюДатуОтгрузкиСУчетомВыходных()  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Дата	
	|ИЗ
	|	Справочник.Календарь.Дни КАК КалендарьДни
	|ГДЕ
	|	(КалендарьДни.Часы <> 0 ИЛИ КалендарьДни.ОтгрузкаВВыходной)
	|	И КалендарьДни.Дата > &Дата0
	|	И НЕ Ссылка.ПометкаУдаления
	|УПОРЯДОЧИТЬ ПО Дата";
	
	Запрос.УстановитьПараметр("Дата0",КонецДня(ТекущаяДата()));
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Дата;
	Иначе	
		ЗаписатьВЛог("Регламент","Не заполнен календарь на !","Ошибка");
		
		Возврат КонецДня(ТекущаяДата())+1;		 		
	КонецЕсли;
	
КонецФункции 


Процедура ОбновлениеДанныхЗОГ(ТаблицаПараметров=Неопределено) Экспорт
	ЗаписатьВЛог("Регламент","Обновление данных ЗОГ. Начало выполнения.","Информация");
	//крохин начало 11.05.2011
	//если есть параметр, обновляем данные ЗОГ за прошлый день
	//Выборка=Документы.ЗаявкаНаОтгрузку.Выбрать(КонецДня(ТекущаяДата())+1,КонецДня(ТекущаяДата())+7*24*60*60);
	// Кухарь А.Ю. 18.03.2022 начало
	// Отбор по складу
	Склад=Неопределено; 
	// Кухарь А.Ю. 18.03.2022 конец
	
	ОбновлятьПрошлыйДень = Ложь;    
	
	ОбновлятьПаллеты     = Ложь;
	
	Если ТаблицаПараметров<>Неопределено Тогда
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
			Если СтрокаТП.Имя="ОбновлятьПрошлыйДень" Тогда
				ОбновлятьПрошлыйДень=СтрокаТП.Значение;
			КонецЕсли; 
			
			//Тимофеев Ю.А. 18.08.2023 Начало 
			Если СтрокаТП.Имя="ОбновлятьПаллеты" Тогда
				ОбновлятьПаллеты=СтрокаТП.Значение;
			КонецЕсли; 
			//Тимофеев Ю.А. 18.08.2023 Конец 
			
			// Кухарь А.Ю. 18.03.2022 начало
			//Прервать;
			Если СтрокаТП.Имя="Склад" Тогда
				Склад=СтрокаТП.Значение;
			КонецЕсли;
			// Кухарь А.Ю. 18.03.2022 конец
			
		КонецЦикла;
	КонецЕсли;
	Если ОбновлятьПрошлыйДень Тогда
		Выборка=Документы.ЗаявкаНаОтгрузку.Выбрать(НачалоДня(ТекущаяДата()),КонецДня(ТекущаяДата())+7*24*60*60);	
	Иначе
		Выборка=Документы.ЗаявкаНаОтгрузку.Выбрать(КонецДня(ТекущаяДата())+1,КонецДня(ТекущаяДата())+7*24*60*60);
	КонецЕсли;
	//крохин конец  11.05.2011
	
	Пока Выборка.Следующий() Цикл
		//крохин начало 10.06.2013
		//по ошибке могут создать лишние
		Если НЕ Выборка.Проведен Тогда Продолжить КонецЕсли;
		//крохин конец 10.06.2013
		
		// Кухарь А.Ю. 18.03.2022 начало
		// Отбор по складу
		если Склад<>Неопределено и Выборка.Склад<>Склад тогда
			Продолжить;
		КонецЕсли;
		// Кухарь А.Ю. 18.03.2022 конец
		
		
		ВремДок=Выборка.ПолучитьОбъект();					
		ВремДок.ОбновитьСостоянияНакладных();
		//Тимофеев Ю.А. 18.08.2023 Начало   
		Если ОбновлятьПаллеты Тогда
			ВремДок.ОбновитьСостояниеПаллет();
		КонецЕсли;
		//Тимофеев Ю.А. 18.08.2023 Конец
		ВремДок.Записать();
		
		ЗаписатьВЛог("Регламент","Обновление данных ЗОГ. Обработан: "+ВремДок.Ссылка,"Информация");
	КонецЦикла;		
	
	ЗаписатьВЛог("Регламент","Обновление данных ЗОГ. Завершение выполнения.","Информация");
КонецПроцедуры

Процедура ЗагрузкаЛогов() Экспорт
	Если НЕ Константы.БазаАрхиваЛогов.Получить() Тогда Возврат КонецЕсли; 
	
	Обработка=Обработки.ЗагрузкаЛогов.Создать();
	Обработка.Дата1=НачалоДня(ТекущаяДата())	-14*24*60*60;
	Обработка.Дата2=КонецДня(ТекущаяДата())		-7*24*60*60;
	
	ЗаписатьВЛог("Регламент","Загрузка логов. Начало. Период: с "+Формат(Обработка.Дата1,"ДФ=dd.MM.yyyy")+" по "+Формат(Обработка.Дата2,"ДФ=dd.MM.yyyy"),"Информация");
	
	Обработка.ЗагрузитьЛоги();
	
	ЗаписатьВЛог("Регламент","Загрузка логов. Окончание.",	"Информация");
КонецПроцедуры


//крохин начало
Процедура ВнешнееЗадание(ТаблицаПараметров) Экспорт
	//++Данилова Е.В. 19.09.2024
	ДоступРазрешенДляТестов = ДоступРазрешенДляТестирования(ТаблицаПараметров); 
	//--Данилова Е.В. 19.09.2024
	//Мессерле 18.06.12
	СтрокаСоединенияСразрешеннымОбменом	=ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения					=ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Кухарь А.Ю. 31.03.2026 начало
	// Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом 
	Если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() 
		//Кухарь А.Ю. 31.03.2026 конец
		
		И НЕ ДоступРазрешенДляТестов Тогда	
		//крохин начало 11.08.2013
		//ЗаписатьВЛог("Регламент","Отмена выполнения. Задача: Обмен данными. Автообмен разрешен для базы: """+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");
		ЗаписатьВЛог("Регламент","Отмена выполнения. Задача: Внешнее задание. Автообмен разрешен для базы: """+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");		
		//крохин конец 11.08.2013
		Возврат;
	КонецЕсли;
	//Мессерле 18.06.12
	
	
	Если ТаблицаПараметров<>Неопределено Тогда
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл

			//++Ратманов 07.02.2026 			
			Если СтрокаТП.Имя = "Обработка" Тогда
				
				МожноВыполнятьВнешние = ОбщегоНазначения_ПИ.ПолучитьЗначениеКонстанты("РазрешитьВнешниеОбработкиВРегламенте");
				
				Обработка = Неопределено;                                                  
				
				Если ТипЗнч(СтрокаТП.Значение) = Тип("Строка") И СтрНачинаетсяС(СтрокаТП.Значение, Маркировка_ПИ.КаталогВнешнихОтчетов()) Тогда                                                                     
					
					Файл = Новый Файл(СтрокаТП.Значение);
					Если Файл.Существует() Тогда                                          
						ОЗОД = Новый ОписаниеЗащитыОтОпасныхДействий;
						ОЗОД.ПредупреждатьОбОпасныхДействиях = Ложь;
						Обработка = ВнешниеОбработки.Создать(СтрокаТП.Значение, Ложь, ОЗОД);
					Иначе
						ЗаписатьВЛог("Регламент", "Запрещено использование внешних обработок в регламентных заданиях !", "Ошибка");
					КонецЕсли;                                                      
				Иначе
					Обработка = Обработки[СтрокаТП.Значение].Создать();
				КонецЕсли;
				Если Обработка = Неопределено Тогда                                                                
					ТекстОшибки = СтрШаблон("Не удалось создать обработку выполнения рег. задания ! Обработка: '%1'", СтрокаТП.Значение);
					ЗаписатьВЛог("Регламент", ТекстОшибки, "Ошибка");
					Возврат;
				КонецЕсли;
				
				ЗаписатьВЛог("ЗапускОтчетов", "" + Обработка.Метаданные().Имя + ". ", "Информация");
				
				Обработка.Сформировать(ТаблицаПараметров);                                                      
			КонецЕсли;
			//--Ратманов 07.02.2026 			
			
			// Шворобей ВЮ 30.01.2024 ++
			Если СтрокаТП.Имя = "ОК" ИЛИ СтрокаТП.Имя = "OK" Тогда
				
				//////////////////////////////////////////////////////////////////////////////////////
				// ОТЧЕТ ОК МОЖНО ИСКАТЬ ПО КОДУ И ПО НАИМЕНОВАНИЮ
				//////////////////////////////////////////////////////////////////////////////////////
				
				НайденныйОтчет = Справочники.ВнешниеОтчеты.НайтиПоКоду(СтрокаТП.Значение);
				
				Если НайденныйОтчет = Справочники.ВнешниеОтчеты.ПустаяСсылка() Тогда
					НайденныйОтчет = Справочники.ВнешниеОтчеты.НайтиПоНаименованию(СтрокаТП.Значение);
				КонецЕсли;
				
				Если НайденныйОтчет <> Справочники.ВнешниеОтчеты.ПустаяСсылка() Тогда
					
					Отчет = Отчеты.ОбщийОтчетНаКомпоновке.Создать();
					Отчет.ВидОтчета = НайденныйОтчет;
					
					ТекСхемаКомпоновки = Отчет.ВидОтчета.СхемаКомпоновки.Получить();
					Если Тип(ТекСхемаКомпоновки) = Тип("СхемаКомпоновкиДанных") Тогда	
						Отчет.СхемаКомпоновкиДанных = ТекСхемаКомпоновки;
					Иначе
						ЗаписатьВЛог("ЗапускОтчетов","Не могу найти Схему компоновки " + Отчет.Метаданные().Имя + ". ","Информация");
						Возврат;
					КонецЕсли;
					
					КомпоновщикНастроек = Отчет.КомпоновщикНастроек;
					КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Отчет.СхемаКомпоновкиДанных));
					
					///////////////////////////////////////////////////////////////////////////////////
					// Надо завести Настройки отчета
					///////////////////////////////////////////////////////////////////////////////////
					
					НайденнаяСтрока = ТаблицаПараметров.Найти("Дата1", "Имя");
					Если НайденнаяСтрока <> Неопределено Тогда
						Отчет.Дата1 = НачалоДня(НайденнаяСтрока.Значение);
					Иначе
						Отчет.Дата1 = НачалоДня(ТекущаяДатаСеанса());
					КонецЕсли;
					ЗаполнениеДокументов.УстановитьПараметрСКД(КомпоновщикНастроек, "Дата1", Отчет.Дата1);
					
					НайденнаяСтрока = ТаблицаПараметров.Найти("Дата2", "Имя");
					Если НайденнаяСтрока <> Неопределено Тогда
						Отчет.Дата2 = КонецДня(НайденнаяСтрока.Значение);
					Иначе
						Отчет.Дата2 = КонецДня(ТекущаяДатаСеанса());
					КонецЕсли;
					ЗаполнениеДокументов.УстановитьПараметрСКД(КомпоновщикНастроек, "Дата2", Отчет.Дата2);
					
					////////////////////////////////////////////////////////////////////////////////////
					// Установим остальные Параметры СКД, будем искать по Комментарию "ПараметрСКД"
					////////////////////////////////////////////////////////////////////////////////////
					
					НайденныеСтроки = ТаблицаПараметров.НайтиСтроки(Новый Структура("Комментарий", "ПараметрСКД"));
					Если НайденныеСтроки.Количество() > 0 Тогда
						Для Каждого НайденнаяСтрока ИЗ НайденныеСтроки Цикл
							ЗаполнениеДокументов.УстановитьПараметрСКД(КомпоновщикНастроек, СокрЛП(НайденнаяСтрока.Имя), НайденнаяСтрока.Значение);
						КонецЦикла;
					КонецЕсли;
					
					////////////////////////////////////////////////////////////////////////////////////
					// Установим Отборы СКД, будем искать по Комментарию "ОтборСКД"
					////////////////////////////////////////////////////////////////////////////////////
					
					НайденныеСтроки = ТаблицаПараметров.НайтиСтроки(Новый Структура("Комментарий", "ОтборСКД"));
					Если НайденныеСтроки.Количество() > 0 Тогда
						Для Каждого НайденнаяСтрока ИЗ НайденныеСтроки Цикл
							
							ВидСравненияСКД = ВидСравненияКомпоновкиДанных.Равно;
							
							Если ТипЗнч(НайденнаяСтрока.Значение) = Тип("СписокЗначений") ИЛИ
								ТипЗнч(НайденнаяСтрока.Значение) = Тип("Массив") ИЛИ
								ТипЗнч(НайденнаяСтрока.Значение) = Тип("ФиксированныйМассив") Тогда
									ВидСравненияСКД = ВидСравненияКомпоновкиДанных.ВСписке;
							КонецЕсли;
								
							Если ТипЗнч(НайденнаяСтрока.Значение) = Тип("Строка") Тогда
								ВидСравненияСКД = ВидСравненияКомпоновкиДанных.Содержит;
							КонецЕсли;
							
							ЭтоСправочник = Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(НайденнаяСтрока.Значение));
							Если ЭтоСправочник Тогда
								МетаданныеОбъекта = НайденнаяСтрока.Значение.Метаданные();
								// Проверить Справочник на Группу
								Если МетаданныеОбъекта.Иерархический Тогда
									Если НайденнаяСтрока.Значение.ЭтоГруппа Тогда
										ВидСравненияСКД = ВидСравненияКомпоновкиДанных.ВИерархии;	
									Иначе
										ВидСравненияСКД = ВидСравненияКомпоновкиДанных.Равно;
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
							
							ЗаполнениеДокументов.УстановитьОтборСКД(КомпоновщикНастроек, СокрЛП(НайденнаяСтрока.Имя), НайденнаяСтрока.Значение, ВидСравненияСКД);
							
						КонецЦикла;
					КонецЕсли;
					
					////////////////////////////////////////////////////////////////////////////////////
					
					Результат = Новый ТабличныйДокумент;
					Отчет.СкомпоноватьРезультат(Результат);
					
					////////////////////////////////////////////////////////////////////////////////////
					// СОХРАНЕНИЕ В ФАЙЛ И ОТПРАВКА
					////////////////////////////////////////////////////////////////////////////////////
					
					ИмяФайла = КаталогВременныхФайлов() + Строка(Отчет.ВидОтчета) + ".xlsx";
					Результат.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
					
					ТекстПисьма = Строка(Отчет.ВидОтчета);
					ТемаПисьма = Строка(Отчет.ВидОтчета);
					
					////////////////////////////////////////////////////////////////////////////////////
					// СПИСОК ПОЛУЧАТЕЛЕЙ
					////////////////////////////////////////////////////////////////////////////////////
					
					НайденнаяСтрока = ТаблицаПараметров.Найти("СписокПолучателей");
					Если НайденнаяСтрока <> Неопределено Тогда
						СписокПолучателей = НайденнаяСтрока.Значение;
					Иначе
						СписокПолучателей = Новый СписокЗначений;
						//СписокПолучателей.Добавить("krohin@collant.ru");
						СписокПолучателей.Добавить("shvorobei@collant.ru");
					КонецЕсли;
					
					СформироватьВнутреннееУведомление(СписокПолучателей, ТекстПисьма, ТемаПисьма, НайденныйОтчет,
						, ИмяФайла, "robot@collant.ru"); 
					
				КонецЕсли;
				
			КонецЕсли;
			// Шворобей ВЮ 30.01.2024 ++
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбменДаннымиРозница(ТаблицаПараметров) Экспорт
	Если ИмяПользователя()= "Auto" Тогда
		//    ЗаписатьВЛог("Автопроцедуры","Начало работы автопроцедур","Инфо");
		СтрокаСоединенияСразрешеннымОбменом	=ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
		ТекСтрокаСоединения					=ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
		//Кухарь А.Ю.  31.03.2026 начало
		//Рефакторинг. Приведение к 1й функции
		//Если ТекСтрокаСоединения <> СтрокаСоединенияСразрешеннымОбменом Тогда
		если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() тогда	
			//Кухарь А.Ю.  31.03.2026 конец
			ЗаписатьВЛог("Регламент","Отмена выполнения. Задача: Обмен данными. Автообмен разрешен для базы: """+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");		
			Возврат;
		КонецЕсли;
		
		
		ЗаписатьВЛог("Автопроцедуры","Начало обмена с узлом: SNL","Инфо");
		ВыполнитьОбменСУзлом("SNL");			
		
		
		ЗаписатьВЛог("Регламент","Завершение выполнения.","Информация");
		//иначе
	Конецесли;
	
	
КонецПроцедуры
//крохин конец



//Нечаева ++
Процедура ПросроченнаяЗадолженность(ТаблицаПараметров=Неопределено) Экспорт
	
	//+++
	СтрокаСоединенияСразрешеннымОбменом	=ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения					=ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Кухарь А.Ю.  31.03.2026 начало
	//Рефакторинг. Приведение к 1й функции
	//Если ТекСтрокаСоединения <> СтрокаСоединенияСразрешеннымОбменом Тогда
	если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() тогда	
		//Кухарь А.Ю.  31.03.2026 конец
		ЗаписатьВЛог("Регламент","Отмена выполнения. Задача: Обмен данными. Автообмен разрешен для базы: """+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");		
		Возврат;
	КонецЕсли;
	
	ЗаписатьВЛог("Регламент","Начало выполнения. "+ТипЗнч(ТаблицаПараметров),"Информация");
	Если ТаблицаПараметров<>Неопределено Тогда
		//крохин начало 14.06.2011
		//все переменные- из параметров, группа контрагентов - из подразделения менеджера
		//КодУзла1="";
		//Путь=""; Контрагент=Справочники.Контрагенты.ПустаяСсылка();
		//Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
		//	ЗаписатьВЛог("Регламент","Параметр: "+СтрокаТП.Имя+" - "+СтрокаТП.Значение,"Информация");
		//	
		//	Если СтрокаТП.Имя="КодУзла" Тогда
		//		КодУзла1=СтрокаТП.Значение;
		//	КонецЕсли;
		//	
		//	Если СтрокаТП.Имя="Путь" Тогда
		//		Путь=СтрокаТП.Значение;
		//	КонецЕсли;
		//	
		//	Если СтрокаТП.Имя="ГруппаКонтрагентов" Тогда
		//		Контрагент=СтрокаТП.Значение;
		//	КонецЕсли;
		//				
		//КонецЦикла;			
		//
		//ЗаписатьВЛог("Автопроцедуры","Начало выгрузки проср.задол. для узла: "+КодУзла1,"Инфо");
		//Обработка=Обработки.АвтоФормированиеПросрочЗадолжености.Создать();
		//Обработка.СформироватьАвто(КодУзла1,Путь,Контрагент);
		////ВыгрузитьПросрочЗад(КодУзла,Путь);	
		//
		Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
			Если СтрокаТП.Имя="Путь" Тогда
				Путь=СтрокаТП.Значение;
			КонецЕсли;
			
			ЗаписатьВЛог("Регламент","Параметр: "+СтрокаТП.Имя+" - "+СтрокаТП.Значение,"Информация");
			Если СтрокаТП.Имя="КодыУзлов" Тогда
				КодыУзлов=СтрокуВСписок(СтрокаТП.Значение);
				Для Каждого КодУзла Из КодыУзлов Цикл				
					ЗаписатьВЛог("Автопроцедуры","Начало обмена с узлом: "+КодУзла,"Инфо");
					Обработка=Обработки.АвтоФормированиеПросрочЗадолжености.Создать();
					Обработка.СформироватьАвто(КодУзла,Путь,Контрагент);		
				КонецЦикла;			
			КонецЕсли; 
		КонецЦикла;	
		//крохин конец 14.06.2011		
	Иначе
		ЗаписатьВЛог("Регламент","Ошибка выполнения ! Не заданы параметры задачи !","Ошибка");
	КонецЕсли; 
	ЗаписатьВЛог("Регламент","Завершение выполнения.","Информация");	
КонецПроцедуры

// для интернет-магазина
Процедура ВыгрузитьДанныеНаСайт(ТаблицаПараметров=Неопределено) Экспорт
	
	//+++
	СтрокаСоединенияСразрешеннымОбменом	=ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения					=ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Кухарь А.Ю.  31.03.2026 начало
	//Рефакторинг. Приведение к 1й функции
	//Если ТекСтрокаСоединения <> СтрокаСоединенияСразрешеннымОбменом Тогда
	если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() тогда	
		//Кухарь А.Ю.  31.03.2026 конец
		ЗаписатьВЛог("Регламент","Отмена выполнения. Задача: Обмен данными с сайтом. Автообмен разрешен для базы: """+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");		
		Возврат;
	КонецЕсли;
		
	ЗаписатьВЛог("Регламент","Начало выполнения. "+ТипЗнч(ТаблицаПараметров),"Информация");
	Если ТаблицаПараметров<>Неопределено Тогда
		
		Путь=""; ГруппаКонтрагентов="";
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
			ЗаписатьВЛог("Регламент","Параметр: "+СтрокаТП.Имя+" - "+СтрокаТП.Значение,"Информация");
			
			Если СтрокаТП.Имя="КодНастройки" Тогда
				КодНастройки=СтрокаТП.Значение;
			КонецЕсли;
			
			Настройка=Справочники.НастройкиОбменаССайтом.НайтиПоКоду(КодНастройки);
			
			Если ЗначениеЗаполнено(Настройка) Тогда
				ЗаписатьВЛог("Автопроцедуры","Начало выгрузки на сайт: ","Инфо");
				ОбработкаОбмена = Обработки.ОбменССайтом.Создать();	
				ОбработкаОбмена.НастройкаСсылка = Настройка;
				
				ОбработкаОбмена.ВыгрузитьДанные();
				
			КонецЕсли;	
			
		КонецЦикла;			
		
	Иначе
		ЗаписатьВЛог("Регламент","Ошибка выполнения ! Не заданы параметры задачи !","Ошибка");
	КонецЕсли; 
	ЗаписатьВЛог("Регламент","Завершение выполнения.","Информация");	
	
	
КонецПроцедуры




//нечаева 15042022 +++
Процедура ВыгрузитьДанныеНаСайтb2b(ТаблицаПараметров=Неопределено) Экспорт
	//++Данилова Е.В. 19.09.2024
	ДоступРазрешенДляТестов = ДоступРазрешенДляТестирования(ТаблицаПараметров); 
	//--Данилова Е.В. 19.09.2024

	//+++
	СтрокаСоединенияСразрешеннымОбменом	=ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения					=ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Кухарь А.Ю. 31.03.2026 начало
	// Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом 
	Если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() 
		//Кухарь А.Ю. 31.03.2026 конец
		И НЕ ДоступРазрешенДляТестов Тогда	
		ЗаписатьВЛог("Регламент","Отмена выполнения. Задача: Обмен данными с сайтом. Автообмен разрешен для базы: """+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");		
		Возврат;
	КонецЕсли;
	
	
	ЗаписатьВЛог("Регламент","Начало выполнения. "+ТипЗнч(ТаблицаПараметров),"Информация");
	
	Если ТаблицаПараметров<>Неопределено Тогда
		
		Путь=""; ГруппаКонтрагентов="";
		
		//++Данилова Е.В. 06.11.2024
		КодНастройки = ""; 
		//--Данилова Е.В. 06.11.2024
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
			ЗаписатьВЛог("Регламент","Параметр: "+СтрокаТП.Имя+" - "+СтрокаТП.Значение,"Информация");
			
			Если СтрокаТП.Имя="КодНастройки" Тогда
				КодНастройки=СтрокаТП.Значение;
			КонецЕсли;
			//ЗаписатьВЛог("b2b","1. "+ТипЗнч(ТаблицаПараметров),"Информация");
			//
			//Настройка=Справочники.НастройкиОбменаССайтом.НайтиПоКоду(КодНастройки);
			//
			//Если ЗначениеЗаполнено(Настройка) Тогда
			//									
			//		ЗаписатьВЛог("b2b","Начало выгрузки на сайт товаров: ","Инфо");
			//		ОбработкаОбмена = Обработки.АвтообменЗаказыТоварыСайт_b2b.Создать();	
			//		ОбработкаОбмена.НастройкаСсылка = Настройка;
			//		//ОбработкаОбмена.Автообмен = ФлагАвтообмена;  //????
			//		ОбработкаОбмена.ВыгрузитьДанные(ДоступРазрешенДляТестов);
			//		ЗаписатьВЛог("b2b","конец выгрузки товаров ","Информация");
			//			
			//КонецЕсли;	
			//
		КонецЦикла;			
		
		//++Данилова Е.В. 06.11.2024
		Настройка=Справочники.НастройкиОбменаССайтом.НайтиПоКоду(КодНастройки);
		
		Если ЗначениеЗаполнено(КодНастройки) 
			И ЗначениеЗаполнено(Настройка) Тогда
			
			ЗаписатьВЛог("b2b","Начало выгрузки на сайт товаров: ","Инфо");
			ОбработкаОбмена = Обработки.АвтообменЗаказыТоварыСайт_b2b.Создать();	
			ОбработкаОбмена.НастройкаСсылка = Настройка;
			//ОбработкаОбмена.Автообмен = ФлагАвтообмена;  //????
			ОбработкаОбмена.ВыгрузитьДанные(ДоступРазрешенДляТестов);
			ЗаписатьВЛог("b2b","конец выгрузки товаров ","Информация");
			
		КонецЕсли;
		//--Данилова Е.В. 06.11.2024
		

	Иначе
		ЗаписатьВЛог("Регламент","Ошибка выполнения ! Не заданы параметры задачи выгрузка товаров b2b !","Ошибка");
	КонецЕсли; 
	ЗаписатьВЛог("Регламент","Завершение выполнения.","Информация");	
	
		
	
КонецПроцедуры
// нечаева 150402022 ---

//Нечаева --

Процедура ДозагрузкаОшибокОбмена(ТаблицаПараметров=Неопределено) Экспорт
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	СсылкаНаОбъект,
	|	КодУзла1,
	|	КодУзла2,
	|	НомерСообщения	
	|ИЗ
	|	РегистрСведений.РассогласованияОбъектов
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаЗаписи";
	//крохин начало 09.10.2013
	ЕстьошибкиПриЗагрузке = Ложь;
	//крохин конец 09.10.2013
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись=РегистрыСведений.РассогласованияОбъектов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись,Выборка,"СсылкаНаОбъект,КодУзла1,КодУзла2");	
		
		Запись.Прочитать();
		Если ЗначениеЗаполнено(Запись.КодУзла1) Тогда
			Если ПараметрыСеанса.ЭтотУзел.Код=Запись.КодУзла1 Тогда
				СостояниеВУдаленномУзле	=Запись.СостояниеВУзле2.Получить();
				Отправитель				=ПланыОбмена.Основной.НайтиПоКоду(Запись.КодУзла2);
			Иначе			
				СостояниеВУдаленномУзле	=Запись.СостояниеВУзле1.Получить();		
				Отправитель				=ПланыОбмена.Основной.НайтиПоКоду(Запись.КодУзла1);
			КонецЕсли;
			
			//+++Чирков 29.04.13 обход ошибки с загрузкой чужих данных
			//крохин начало 09.10.2013
			//Если ПустаяСтрока(СостояниеВУдаленномУзле) Тогда Продолжить КонецЕсли;
			Если ПустаяСтрока(СостояниеВУдаленномУзле) Тогда 
				ЕстьошибкиПриЗагрузке = Истина;
				Продолжить 
			КонецЕсли;
			//крохин конец 09.10.2013
			//---Чирков
			
			Чтение=Новый ЧтениеXML;
			Чтение.УстановитьСтроку(СостояниеВУдаленномУзле);
			//крохин начало 22.08.2013
			//обход ошибки с отсутствующими объектами или изменениями в конфигурации
			//Данные=ПрочитатьXML(Чтение);
			Попытка
				Данные=ПрочитатьXML(Чтение);
			Исключение
				//крохин начало 09.10.2013
				//удалим записи после окончания обработки
				//		ЗаписатьВЛог("Ошибка дозагрузки обмена","Ошибка: "+ОписаниеОшибки()+". Запись: "+Чтение,"Информация");
				//крохин начало 06.12.2013
				//может быть ошибка при записи в лог сообщения об ошибке.
				//ЗаписатьВЛог("Ошибка дозагрузки обмена","Ошибка: "+ОписаниеОшибки()+". Запись удалена: Тип: "+Выборка.Тип+" .Вид: "+Выборка.Вид+ " .Код Узла1: "+Выборка.Кодузла1+" .КодУзла2: "+Выборка.КодУзла2+ ". Ссылка:"+Выборка.СсылкаНаОбъект+ " .Номер сообщения: "+Выборка.НомерСообщения,"Информация");
				попытка
					ЗаписатьВЛог("Ошибка дозагрузки обмена","Ошибка: "+ОписаниеОшибки()+". Запись удалена: Тип: "+Выборка.Тип+" .Вид: "+Выборка.Вид+ " .Код Узла1: "+Выборка.Кодузла1+" .КодУзла2: "+Выборка.КодУзла2+ ". Ссылка:"+Выборка.СсылкаНаОбъект+ " .Номер сообщения: "+Выборка.НомерСообщения,"Информация");
				Исключение
					ЗаписатьВЛог("Ошибка дозагрузки обмена","Ошибка: "+ОписаниеОшибки()+". Запись удалена","Информация");
				КонецПопытки;
				//крохин кенец 06.12.2013
				ЕстьошибкиПриЗагрузке = Истина;		
				//крохин конец 09.10.2013
				Продолжить;
			КонецПопытки;
			//крохин конец 22.08.2013
			
			
			Данные.ОбменДанными.Загрузка	=Истина;
			Данные.ОбменДанными.Отправитель	=Отправитель;
			
			Данные.ДополнительныеСвойства.Вставить("ПараметрыЗагрузки",Новый Структура("Отправитель,НомерСообщения",Отправитель,Выборка.НомерСообщения));
			
			УзелОбъект=ПланыОбмена.Основной.ЭтотУзел().ПолучитьОбъект();
			//ПолучитьВариантЗагрузки(Данные,ТипДанных,Отправитель,Описание) Экспорт
			Описание		="";
			
			ПараметрыСеанса.НомерСообщения=Выборка.НомерСообщения;
			
			ВариантЗагрузки	=УзелОбъект.ПолучитьВариантЗагрузки(Данные,Запись.Тип,Отправитель,Описание);
			НовыйОбъект			= Ложь;
			ОтправитьОбратно	= Ложь;
			ЕстьРассогласования = Ложь;
			ОбъектЗагружен		= Ложь;
			
			Если ВариантЗагрузки="Полная" Тогда
				ОбъектЗагружен	=УзелОбъект.ЗаписатьПолныеДанныеВБазу(Данные,Запись.Тип,Отправитель,Описание,НовыйОбъект);						
			ИначеЕсли ВариантЗагрузки="Частичная" Тогда
				ОбъектЗагружен	=УзелОбъект.ЗаписатьВозможныеДанныеВБазу(Данные,Запись.Тип,Отправитель,Описание,НовыйОбъект,ЕстьРассогласования,ОтправитьОбратно);
			КонецЕсли;			
			
			ПараметрыСеанса.НомерСообщения=0;
			УзелОбъект.УдалитьИзЖурналаРассогласований(Данные.Ссылка,Отправитель);
		КонецЕсли; 
	КонецЦикла;	
	//крохин начало 09.10.2013
	//удаляем косячные записи
	Если ЕстьошибкиПриЗагрузке Тогда
		ЗаписатьВЛог("Ошибка дозагрузки обмена","Очистка регистра","Информация");
		наборЗаписей = РегистрыСведений.РассогласованияОбъектов.СоздатьНаборЗаписей();
		наборЗаписей.Записать();
		
	КонецЕсли;
	//крохин конец 09.10.2013
КонецПроцедуры

//Чирков+++ 21.05.2013
Процедура ПрописатьТекущиеСуммыПоДК(ТаблицаПараметров=Неопределено) Экспорт
	
	//Нечаева 16,01,2014
	// сумма по сертификатам проданным по ДК
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ОтчетКассовойСменыТовары.ДК КАК ДК,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетКассовойСменыТовары.Ссылка.КодОперации = ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратОтПокупателя)
	|				ТОГДА -1
	|			ИНАЧЕ 1
	|		КОНЕЦ * ОтчетКассовойСменыТовары.Всего) КАК РасчетнаяСумма
	|ИЗ
	|	Документ.ОтчетКассовойСмены.Товары КАК ОтчетКассовойСменыТовары
	|ГДЕ
	|	ОтчетКассовойСменыТовары.Ссылка.Дата > &Дата2
	|	И ОтчетКассовойСменыТовары.ДК <> ЗНАЧЕНИЕ(Справочник.ДисконтныеКарты.ПустаяСсылка)
	|	И (НЕ ОтчетКассовойСменыТовары.ДК.Ликвидирована)
	|	И ОтчетКассовойСменыТовары.Ссылка.Проведен
	|	И ОтчетКассовойСменыТовары.Номенклатура.ВидНоменклатуры =(&ПодарСерт)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетКассовойСменыТовары.ДК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриходнаяНакладнаяТовары.Ссылка.ДК,
	|	СУММА(-ПриходнаяНакладнаяТовары.Всего)
	|ИЗ
	|	Документ.ПриходнаяНакладная.Товары КАК ПриходнаяНакладнаяТовары
	|ГДЕ
	|	ПриходнаяНакладнаяТовары.Ссылка.Дата > &Дата2
	|	И ПриходнаяНакладнаяТовары.Ссылка.Проведен
	|	И ПриходнаяНакладнаяТовары.Ссылка.ДК <> ЗНАЧЕНИЕ(Справочник.ДисконтныеКарты.ПустаяСсылка)
	|	И (НЕ ПриходнаяНакладнаяТовары.Ссылка.ДК.Ликвидирована)
	|	И ПриходнаяНакладнаяТовары.Номенклатура.ВидНоменклатуры =(&ПодарСерт)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриходнаяНакладнаяТовары.Ссылка.ДК";
	
	
	Запрос.УстановитьПараметр("Дата2",КонецДня('20140131'));   // 20140131  //с 1 февраля
	Запрос.УстановитьПараметр("ПодарСерт",Перечисления.ВидыНоменклаутры.ПодарочныйСертификат);
	ВыборкаСертификатов=Запрос.Выполнить().Выгрузить();	
	// нечаева 16,01,2014 ---
	
	
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ	
	|	ДК,
	|	ДК.ОбщаяСуммаДо2013		КАК СуммаВДК,
	|	СУММА(РасчетнаяСумма)	КАК РасчетнаяСумма	
	|ИЗ
	|(	
	|ВЫБРАТЬ
	|	ДК,
	|	СУММА(ВЫБОР КОГДА Ссылка.КодОперации=ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратОтПокупателя) ТОГДА -1 ИНАЧЕ 1 КОНЕЦ*Всего) КАК РасчетнаяСумма
	|ИЗ
	|	Документ.ОтчетКассовойСмены.Товары
	|ГДЕ
	|	Ссылка.Дата>&Дата2
	|	И ДК<>ЗНАЧЕНИЕ(Справочник.ДисконтныеКарты.ПустаяСсылка)
	//крохин начало 23.05.2013
	|	И НЕ ДК.Ликвидирована
	//крохин конец 23.05.2013
	|	И Ссылка.Проведен	
	|СГРУППИРОВАТЬ ПО ДК
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ	
	|	Ссылка.ДК,
	|	СУММА(-Всего)
	|ИЗ
	|	Документ.ПриходнаяНакладная.Товары КАК ПриходнаяНакладнаяТовары
	|ГДЕ
	|	Ссылка.Дата>&Дата2
	|	И Ссылка.Проведен 
	|	И Ссылка.ДК <> ЗНАЧЕНИЕ(Справочник.ДисконтныеКарты.ПустаяСсылка)
	//крохин начало 23.05.2013
	|	И НЕ Ссылка.ДК.Ликвидирована
	//крохин конец 23.05.2013
	|СГРУППИРОВАТЬ ПО Ссылка.ДК	
	|) КАК СВОДНЫЙ
	|СГРУППИРОВАТЬ ПО ДК
	|ИМЕЮЩИЕ 
	//крохин начало 27.05.2013
	//накопления не уменьшаются
	//|	ДК.ОбщаяСумма<>ДК.ОбщаяСуммаДо2013+СУММА(РасчетнаяСумма)";
	|	ДК.ОбщаяСумма<ДК.ОбщаяСуммаДо2013+СУММА(РасчетнаяСумма)";
	//крохин конец 27.05.2013
	
	Запрос.УстановитьПараметр("Дата2",КонецДня('20121231'));
	
	Выборка=Запрос.Выполнить().Выбрать();	
	
	Пока Выборка.Следующий() Цикл
		ДК_Объект=Выборка.ДК.ПолучитьОбъект();
		// Нечаева 16,01,2014 вычитаем подар. сертификаты с 1 февраля 2014  +++
		ПодСерт=выборкаСертификатов.Найти(Выборка.Дк);
		Сумма=Выборка.РасчетнаяСумма;
		Если ПодСерт<>Неопределено Тогда
			Сумма=Выборка.РасчетнаяСумма-ПодСерт.РасчетнаяСумма;
			//Сообщить(""+Выборка.Дк+"  "+Выборка.РасчетнаяСумма+" -- "+Сумма);
		КонецЕсли;	
		
		//нечаева 23,09,2014 +++
		//ДК_Объект.ОбщаяСумма=ДК_Объект.ОбщаяСуммаДо2013+Сумма;
		//// Нечаева 16,01,2014 вычитаем подар. сертификаты с 1 февраля 2014  ---
		//ДК_Объект.Записать();	
		
		НОбщаяСумма=ДК_Объект.ОбщаяСуммаДо2013+Сумма;
		// Нечаева 16,01,2014 вычитаем подар. сертификаты с 1 февраля 2014  ---
		Если Выборка.ДК.ОбщаяСумма<>НОбщаясумма Тогда
			ДК_Объект.ОбщаяСумма=НОбщаяСумма;
			ДК_Объект.Записать();
		КонецЕсли;	
		//нечаева 23,09,2014 ---
		
	КонецЦикла;	
КонецПроцедуры
//Чирков--- 21.05.2013

//////////////////////////////////////////////////////////////////////////////////////////////////////////////
Процедура ОповещениеОбИзмененииШтрихкодов(ТаблицаПараметров=Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	ТекстОбъекты = ""; ТекстТипРассылки = "";
	
	ТемаПисьма = "Оповещения об изменении штрих-кодов";
	
	Если ТаблицаПараметров <> Неопределено Тогда
		
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
		
			Если СтрокаТП.Имя = "ТемаПисьма" Тогда
				ТемаПисьма = ?(ЗначениеЗаполнено(СтрокаТП.Значение), СокрЛП(СтрокаТП.Значение), "Оповещения об изменении штрих-кодов");
			КонецЕсли;
			
			Если СтрокаТП.Имя = "Объекты" Тогда
				Если ЗначениеЗаполнено(СтрокаТП.Значение) Тогда
					Запрос.УстановитьПараметр("Объекты", СтрокаТП.Значение);
					ТекстОбъекты = "И Данные.Объект В(&Объекты)";
				КонецЕсли;
			КонецЕсли;
			
			Если СтрокаТП.Имя = "ТипРассылки" Тогда
				Если ЗначениеЗаполнено(СтрокаТП.Значение) Тогда
					Запрос.УстановитьПараметр("ТипРассылки", СтрокаТП.Значение);
					ТекстТипРассылки = "И Данные.ТипРассылки = &ТипРассылки";
				КонецЕсли;	
			КонецЕсли;
		
		КонецЦикла;
		                      
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Данные.Период КАК Период,
	|	Данные.Объект КАК Объект,
	|	Данные.ТипРассылки КАК ТипРассылки,
	|	Данные.ОписаниеИзменений КАК ОписаниеИзменений
	|ИЗ
	|	РегистрСведений.ДанныеДляОтправкиПочтовымУведомлением КАК Данные
	|ГДЕ
	|	Данные.ДатаФормированияУведомления = ДАТАВРЕМЯ(1, 1, 1)
	|	" + ТекстОбъекты + "
	|	" + ТекстТипРассылки + "
	|";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	ТелоПисьма = "";
	Пока Выборка.Следующий() Цикл
		ТелоПисьма = ТелоПисьма + СокрЛП(Выборка.ОписаниеИзменений) + Символы.ПС;	
	КонецЦикла;
	
	СписокПолучателей = СформСписокПолучат(Справочники.ТипыРассылок.ОповещенияОбИзмененииШтрихкодов);
	
	Если НЕ ПустаяСтрока(ТелоПисьма) И СписокПолучателей.Количество() > 0 Тогда
		Ответ = СформироватьВнутреннееУведомление(СписокПолучателей, ТелоПисьма, ТемаПисьма,,,,"robot@collant.ru");
		Если ПустаяСтрока(Ответ) Тогда
			Выборка.Сбросить();
			Пока Выборка.Следующий() Цикл
				СтруктураЗаписи = Новый Структура("Период, Объект, ТипРассылки, ОписаниеИзменений");
				ЗаполнитьЗначенияСвойств(СтруктураЗаписи, Выборка);
				ДополнительныеРеквизиты = Новый Структура("ДатаФормированияУведомления", ТекущаяДата());
				РегистрыСведений.ДанныеДляОтправкиПочтовымУведомлением.СоздатьЗаписьДляОтправкиПочтовымСообщением(СтруктураЗаписи, ДополнительныеРеквизиты);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////////////////////////////

//++Данилова Е.В. 19.09.2024
//для тестирования 
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ДоступРазрешенДляТестирования(ТаблицаПараметров)
	
	МассивДоступныхОбработок = Новый Массив; 
	МассивДоступныхОбработок.Добавить("АвтовыгрузкаЗаказовСайт_b2b");
	МассивДоступныхОбработок.Добавить("АвтовыгрузкаОстатковСайт_b2b");
	МассивДоступныхОбработок.Добавить("АвтовыгрузкаЦенАкцийСайт_b2b");
	МассивДоступныхОбработок.Добавить("АвтообменЗаказыТоварыСайт_b2b");
	МассивДоступныхОбработок.Добавить("АвтовыгрузкаРНКСайт_РНК_СФайлами");
	ОбработкаНайдена = Ложь;
	ФлагТестНайден = Ложь; 
	Если ТаблицаПараметров<>Неопределено Тогда
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
			Если СтрокаТП.Имя = "Обработка" Тогда
				Если МассивДоступныхОбработок.Найти(СтрокаТП.Значение) <> неопределено Тогда
					
					ОбработкаНайдена = истина; 
					
				КонецЕсли;
			Конецесли;
			
			Если СтрокаТП.Имя = "Тест" Тогда
				ФлагТестНайден = Истина; 
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ОбработкаНайдена и ФлагТестНайден Тогда
		
		Возврат Истина; 
	Иначе 
		Возврат Ложь; 
		
	КонецЕсли;
КонецФункции // ДоступРазрешенДляТестирования()

//--Данилова Е.В. 19.09.2024

Процедура ОповещениеОбИзмененияхПоТипуРассылки(ТаблицаПараметров = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	ТекстОбъекты = "";
	
	ТемаПисьма = "Письмо об изменениях по Типу рассылки";
	
	ТипРассылки = Справочники.ТипыРассылок.ОповещенияОбИзмененииШтрихкодов;
	ФлагРассылки = "РассылкиЭлПочта";   // "ФизЛицаРазрешениеОтгрузки"
	
	Если ТаблицаПараметров <> Неопределено Тогда
		
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
		
			Если СтрокаТП.Имя = "ТемаПисьма" Тогда
				ТемаПисьма = ?(ЗначениеЗаполнено(СтрокаТП.Значение), СокрЛП(СтрокаТП.Значение), ТемаПисьма);
			КонецЕсли;
			
			Если СтрокаТП.Имя = "Объекты" Тогда
				Если ЗначениеЗаполнено(СтрокаТП.Значение) Тогда
					Запрос.УстановитьПараметр("Объекты", СтрокаТП.Значение);
					ТекстОбъекты = "И Данные.Объект В(&Объекты)";
				КонецЕсли;
			КонецЕсли;
			
			Если СтрокаТП.Имя = "ТипРассылки" Тогда
				ТипРассылки = ?(ЗначениеЗаполнено(СтрокаТП.Значение), СтрокаТП.Значение, ТипРассылки);
			КонецЕсли;
			
			Если СтрокаТП.Имя = "ФлагРассылки" Тогда
				ФлагРассылки = ?(ЗначениеЗаполнено(СтрокаТП.Значение), СокрЛП(СтрокаТП.Значение), ФлагРассылки);
			КонецЕсли;
		
		КонецЦикла;
		                      
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Данные.Период КАК Период,
	|	Данные.Объект КАК Объект,
	|	Данные.ТипРассылки КАК ТипРассылки,
	|	Данные.ОписаниеИзменений КАК ОписаниеИзменений
	|ИЗ
	|	РегистрСведений.ДанныеДляОтправкиПочтовымУведомлением КАК Данные
	|ГДЕ
	|	Данные.ДатаФормированияУведомления = ДАТАВРЕМЯ(1, 1, 1)
	|	И Данные.ТипРассылки = &ТипРассылки
	|	" + ТекстОбъекты + "
	|";
	
	Запрос.УстановитьПараметр("ТипРассылки", ТипРассылки);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	ТелоПисьма = "";
	Пока Выборка.Следующий() Цикл
		ТелоПисьма = ТелоПисьма + СокрЛП(Выборка.ОписаниеИзменений) + Символы.ПС;	
	КонецЦикла;
	
	СписокПолучателей = СформСписокПолучат(ТипРассылки, , ФлагРассылки);
	
	Если НЕ ПустаяСтрока(ТелоПисьма) И СписокПолучателей.Количество() > 0 Тогда
		Ответ = СформироватьВнутреннееУведомление(СписокПолучателей, ТелоПисьма, ТемаПисьма,,,,"robot@collant.ru");
		Если ПустаяСтрока(Ответ) Тогда
			Выборка.Сбросить();
			Пока Выборка.Следующий() Цикл
				СтруктураЗаписи = Новый Структура("Период, Объект, ТипРассылки, ОписаниеИзменений");
				ЗаполнитьЗначенияСвойств(СтруктураЗаписи, Выборка);
				ДополнительныеРеквизиты = Новый Структура("ДатаФормированияУведомления", ТекущаяДата());
				РегистрыСведений.ДанныеДляОтправкиПочтовымУведомлением.СоздатьЗаписьДляОтправкиПочтовымСообщением(СтруктураЗаписи, ДополнительныеРеквизиты);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
//++Данилова Е.В. 25.10.2024
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьДатуОтгрузкиСУчетомВыходныхКалендаря(Знач ДатаОтгрузки) Экспорт 

	Если ТипЗнч(ДатаОтгрузки) = Тип("Строка") Тогда
	
		ДатаОтгрузки = Дата(ДатаОтгрузки); 	
	
	КонецЕсли;
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	КалендарьДни.Дата КАК Дата
	|ИЗ
	|	Справочник.Календарь.Дни КАК КалендарьДни
	|ГДЕ
	|	КалендарьДни.Часы <> 0
	|	И НАЧАЛОПЕРИОДА(КалендарьДни.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата0, ДЕНЬ)
	|	И НЕ КалендарьДни.Ссылка.ПометкаУдаления";
	Запрос.УстановитьПараметр("Дата0",ДатаОтгрузки); 
	РезультатЗапроса = Запрос.Выполнить(); 
	Если РезультатЗапроса.Пустой()  Тогда
		
		Возврат ПолучитьСледующуюДатуОтгрузки(КонецДня(ДатаОтгрузки)); 	
	Иначе 
		Возврат ДатаОтгрузки; 
	КонецЕсли; 


КонецФункции // ПолучитьДатуОтгрузкиПоЗаказуb2b()

//--Данилова Е.В. 25.10.2024

//////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Шворобей ВЮ 17.12.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-581
Процедура ОповещениеОбОтрицательныхОстаткахЗаказыПоставщикам(ТаблицаПараметров = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Остатки.Заказ КАК Заказ,
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.КоличествоОстаток КАК Остаток
	|ПОМЕСТИТЬ втОтрицательныеОстатки
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(&Период, ТИПЗНАЧЕНИЯ(Заказ) = ТИП(Документ.КонтрактСПроизводителем)) КАК Остатки
	|ГДЕ
	|	Остатки.КоличествоОстаток < 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втОтрицательныеОстатки.Заказ КАК Заказ
	|ИЗ
	|	втОтрицательныеОстатки КАК втОтрицательныеОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	втОтрицательныеОстатки.Заказ.Дата";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Количество() = 0 Тогда Возврат; КонецЕсли;
	
	ТемаПисьма = "Письмо об отрицательных остатках по регистру <Заказы поставщикам>";
	
	ТипРассылки = Справочники.ТипыРассылок.ОповещениеОбОтрицательныхОстаткахЗаказыПоставщикам;
	ФлагРассылки = "РассылкиЭлПочта";
	
	Если ТаблицаПараметров <> Неопределено Тогда
		
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
		
			Если СтрокаТП.Имя = "ТемаПисьма" Тогда
				ТемаПисьма = ?(ЗначениеЗаполнено(СтрокаТП.Значение), СокрЛП(СтрокаТП.Значение), ТемаПисьма);
			КонецЕсли;
			
			Если СтрокаТП.Имя = "ТипРассылки" Тогда
				ТипРассылки = ?(ЗначениеЗаполнено(СтрокаТП.Значение), СтрокаТП.Значение, ТипРассылки);
			КонецЕсли;
			
			Если СтрокаТП.Имя = "ФлагРассылки" Тогда
				ФлагРассылки = ?(ЗначениеЗаполнено(СтрокаТП.Значение), СокрЛП(СтрокаТП.Значение), ФлагРассылки);
			КонецЕсли;
		
		КонецЦикла;
		                      
	КонецЕсли;
	
	ТелоПисьма = "";
	Пока Выборка.Следующий() Цикл
		ТелоПисьма = ТелоПисьма + СокрЛП(Выборка.Заказ) + Символы.ПС;	
	КонецЦикла;
	
	СписокПолучателей = СформСписокПолучат(ТипРассылки, , ФлагРассылки);
	
	Если НЕ ПустаяСтрока(ТелоПисьма) И СписокПолучателей.Количество() > 0 Тогда
		Ответ = СформироватьВнутреннееУведомление(СписокПолучателей, ТелоПисьма, ТемаПисьма,,,,"robot@collant.ru");
	КонецЕсли;
	
КонецПроцедуры

// Кухарь А.Ю.  17.12.2024 начало
//
Функция ЗаписатьПроведение (счОшибок)
	СтруктураВозврата=новый Структура("Успешно");
	СтруктураВозврата.Успешно = ложь;
	Обработка=Обработки.ПроведениеДокументов.Создать();
	Обработка.фПакетныйРежим=Истина;
	Обработка.ПолучитьГП();
	попытка
		Обработка.ПровестиДокументы();
		СтруктураВозврата.Успешно = Истина;
	Исключение
		СтруктураВозврата.Успешно = Ложь;
		// Кухарь А.Ю.  15.01.2025 начало
		//
		ЗаписатьВЛог("Пакетное проведение","Ошибка проведения "+ОписаниеОшибки(),"Информация"); 
		// Кухарь А.Ю.  15.01.2025 конец
		
	КонецПопытки;
	
	Возврат СтруктураВозврата;
КонецФункции

// Шворобей ВЮ 17.12.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-581 

//++Данилова Е.В. 08.05.2025   MARK-1675
Процедура АвтоматизацияРаботыСЗаказамиКМ_ОУКЭП(ТаблицаПараметров) Экспорт
	Если ТаблицаПараметров<>Неопределено Тогда
		СоответствиеПараметры = Новый Соответствие; 
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
			СоответствиеПараметры.Вставить(СтрокаТП.Имя,СтрокаТП.Значение); 			
		КонецЦикла;
		
		ОшибкаПараметров = ложь; 
		
		Если СоответствиеПараметры.Получить("Организация") = неопределено Тогда
		
			ЗаписатьВЛог("Регламент_ЗаказыКМ_ОУКЭП","Не задан параметр ""Организация"" ","Ошибка!!!",истина);
			
			ОшибкаПараметров = истина; 
		
		КонецЕсли;
		Если СоответствиеПараметры.Получить("Подразделение") = неопределено Тогда
		
			ЗаписатьВЛог("Регламент_ЗаказыКМ_ОУКЭП","Не задан параметр ""Подразделение"" ","Ошибка!!!",истина);	
			
			ОшибкаПараметров = истина;
		КонецЕсли;
		
		Если СоответствиеПараметры.Получить("Этап") = неопределено Тогда
		
			ЗаписатьВЛог("Регламент_ЗаказыКМ_ОУКЭП","Не задан параметр ""Этап"" ","Ошибка!!!",истина);	
			
			ОшибкаПараметров = истина;
		КонецЕсли;
		
		Если ОшибкаПараметров Тогда
		
			Возврат; 	
		
		КонецЕсли;
		
		
		
		ОбработкаЗаказовКМ = Обработки.ФормированиеИОбработкаЗаказовКМ.Создать();
		ОбработкаЗаказовКМ.Организация = СоответствиеПараметры.Получить("Организация"); 
		
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
			Если СтрокаТП.Имя = "Подразделение" Тогда
				
				ОбработкаЗаказовКМ.Подразделение.Добавить(СтрокаТП.Значение); 
				
			КонецЕсли; 		
		КонецЦикла; 	
		
		//в дальнейшем их останется 3 
		Этап = СоответствиеПараметры.Получить("Этап");		
		
		ПараметрыОбработки = Новый Структура; 
		ПараметрыОбработки.Вставить("Организация",ОбработкаЗаказовКМ.Организация);
		ПараметрыОбработки.Вставить("Подразделение",ОбработкаЗаказовКМ.Подразделение.ВыгрузитьЗначения());
		
		ПроцедураОбработки = "ОбработкаЗаказовКМ.Этап"+Строка(Этап) + "(ПараметрыОбработки)"; 
		Попытка
		
			Выполнить ПроцедураОбработки;	
		
		Исключение
		    ЗаписатьВЛог("Регламент_ЗаказыКМ_ОУКЭП","Не найдена процедура обработки для выполнения или ошибка выполнения!!","Ошибка",истина);
		КонецПопытки; 		

	Иначе 
		 
	КонецЕсли;
КонецПроцедуры
//--Данилова Е.В. 08.05.2025

//Валетов+ 24,06,2025 Регламент записи регистра СтатусыЗаказаМарокДляДокументов
Процедура ЗаписатьДокументыВРегЗаказМарок(ТаблицаПараметров=Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасходнаяНакладная.Ссылка КАК Документ
	|ПОМЕСТИТЬ ВТДок
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.Дата >= &НачДата
	|	И РасходнаяНакладная.Проведен
	|	И РасходнаяНакладная.СостояниеНакладной = ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.ЗаказКМЧЗ)
	|	И РасходнаяНакладная.ТребуетсяМаркировка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Перемещение.Ссылка
	|ИЗ
	|	Документ.Перемещение КАК Перемещение
	|ГДЕ
	|	Перемещение.Проведен
	|	И Перемещение.Дата >= &НачДата
	|	И Перемещение.СостояниеНакладной = ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.ЗаказКМЧЗ)
	|	И Перемещение.ТребуетсяМаркировка
	// Кельманов А.В. - SNL-239 - 2026.05.27 {
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Комплектация.Ссылка
	|ИЗ
	|	Документ.Комплектация КАК Комплектация
	|ГДЕ
	|	Комплектация.Проведен
	|	И Комплектация.Дата >= &НачДата
	|	И Комплектация.СостояниеНакладной = ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.ЗаказКМЧЗ)
	// Кельманов А.В. - SNL-239 - 2026.05.27 }
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДок.Документ КАК Документ
	|ИЗ
	|	ВТДок КАК ВТДок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЗаказаМарокДляДокументов КАК СтатусыЗаказаМарокДляДокументов
	|		ПО ВТДок.Документ = СтатусыЗаказаМарокДляДокументов.Накладная
	|ГДЕ
	|	СтатусыЗаказаМарокДляДокументов.Накладная ЕСТЬ NULL"; 
	//Валетов + 03,12,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3340
	//Поменял 1 день назад на 3. Появились ПРМ которым статус для заказа меняют только через 2 дня.
	Запрос.УстановитьПараметр("НачДата",ТекущаяДата()-86400*3);
	
	Результат = Запрос.Выполнить().Выбрать(); 
	Пока Результат.Следующий() Цикл 
		Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			НаборЗаписей = РегистрыСведений.СтатусыЗаказаМарокДляДокументов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Накладная.Установить(Результат.Документ);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0 Тогда
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Накладная = Результат.Документ;
				НоваяЗапись.СтатусыЗаказаКодовМаркировки = Перечисления.СтатусыЗаказаКодовМаркировки.ТребуетсяЗаказМарок;
				НаборЗаписей.Записать();
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры
//Валетов-  

//Валетов+ 20,10,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5404
Процедура ПереводНакладныхИзОжиданияОбработкиЧЗвРГ(ТаблицаПараметров=Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасходнаяНакладная.Ссылка КАК Ссылка,
	               |	РасходнаяНакладная.ТребуетсяМаркировка КАК ТребуетсяМаркировка,
	               |	РасходнаяНакладная.ОтгрузкаКомплектов КАК ОтгрузкаКомплектов
	               |ИЗ
	               |	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	               |ГДЕ
	               |	РасходнаяНакладная.Проведен
	               |	И РасходнаяНакладная.СостояниеНакладной = ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.ОжиданиеОбработкиЧЗ)";
	
	Результат = Запрос.Выполнить().Выбрать(); 
	Пока Результат.Следующий() Цикл 
		ПоменятьСтатус = Истина;
		ТекстСообщения = "";
		ПравилаРаботыСАгрегациейЧЗ=МаркировкаКС.ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладной(Результат.Ссылка);		
		Если ПравилаРаботыСАгрегациейЧЗ.УстановленыПравилаРаботыСАгрегацией Тогда  
			
			НужныПаллеты = ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияПаллет;
			НужныБлочки = ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияБлочков;
			НужныКороба = ПравилаРаботыСАгрегациейЧЗ.ТребуетсяАгрегацияКоробок;
			ЕстьПаллеты = Ложь;
			ЕстьБлочки = Ложь;
			ЕстьКороба = Ложь;
			
			ЗапросОМ = Новый Запрос;
			ЗапросОМ.Текст =  "ВЫБРАТЬ
			                  |	МаркировкаТоваровИСМП.ТипШК КАК ТипШК,
			                  |	МаркировкаТоваровИСМП.Статус КАК Статус
			                  |ИЗ
			                  |	Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
			                  |ГДЕ
			                  |	МаркировкаТоваровИСМП.ДокументОснование = &ДокументОснование
			                  |	И МаркировкаТоваровИСМП.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация)";
			ЗапросОМ.УстановитьПараметр("ДокументОснование",Результат.Ссылка);
			Рез = ЗапросОМ.Выполнить().Выбрать();
			Пока Рез.Следующий() Цикл 
				
				Если Рез.ТипШК = Перечисления.ТипыШтрихКодов.Блочок И Рез.Статус = Перечисления.СтатусыДокументовМаркировки.Обработан Тогда 
					ЕстьБлочки = Истина;
				ИначеЕсли Рез.ТипШК = Перечисления.ТипыШтрихКодов.Коробка И Рез.Статус = Перечисления.СтатусыДокументовМаркировки.Обработан Тогда
					ЕстьКороба = Истина;
				ИначеЕсли Рез.ТипШК = Перечисления.ТипыШтрихКодов.Палета И Рез.Статус = Перечисления.СтатусыДокументовМаркировки.Обработан тогда
					ЕстьПаллеты = Истина;	
				КонецЕсли;	
								
			КонецЦикла;  
			Если НужныБлочки И НЕ Естьблочки Тогда
				ПоменятьСтатус = Ложь; 
				ТекстСообщения = ТекстСообщения +  " Не обработаны Блочки. ";
			КонецЕсли; 
			Если НужныКороба И НЕ ЕстьКороба Тогда
				ПоменятьСтатус = Ложь; 
				ТекстСообщения = ТекстСообщения +  " Не обработаны Короба. ";
			КонецЕсли;
			Если НужныПаллеты И НЕ ЕстьПаллеты Тогда
				ПоменятьСтатус = Ложь;
				ТекстСообщения = ТекстСообщения +  " Не обработаны Паллеты. ";
			КонецЕсли;
		КонецЕсли; 
		
		Если Результат.ТребуетсяМаркировка И Результат.ОтгрузкаКомплектов И ПоменятьСтатус Тогда
			ПоменятьСтатус = Ложь;
			ЗапросОМпоЗСб = Новый Запрос;
			ЗапросОМпоЗСб.Текст =  "ВЫБРАТЬ
			                        |	МаркировкаТоваровИСМП.ТипШК КАК ТипШК,
			                        |	МаркировкаТоваровИСМП.Статус КАК Статус
			                        |ИЗ
			                        |	Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
			                        |ГДЕ
			                        |	ВЫРАЗИТЬ(МаркировкаТоваровИСМП.ДокументОснование КАК Документ.ЗаданиеНаСборкуКомплектовЧЗ).ДокОснование = &ДокументОснование
			                        |	И МаркировкаТоваровИСМП.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.ФормированиеНабора)";
			ЗапросОМпоЗСб.УстановитьПараметр("ДокументОснование",Результат.Ссылка);
			РезНаборы = ЗапросОМпоЗСб.Выполнить().Выбрать();
			Пока РезНаборы.Следующий() Цикл 
				Если РезНаборы.Статус = Перечисления.СтатусыДокументовМаркировки.Обработан Тогда
					ПоменятьСтатус = Истина;   
				КонецЕсли; 
			КонецЦикла; 
			Если не ПоменятьСтатус Тогда
				ТекстСообщения = ТекстСообщения +  " Не обработаны Формирования наборов. ";
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПоменятьСтатус Тогда
		   ПеревестиВГотоваКОтгрузке(Результат.Ссылка);
        КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

Процедура ПеревестиВГотоваКОтгрузке(Док)
	ЕстьОшибки = Ложь; 
	СписокПолучателей = Новый СписокЗначений;
	РнкОбъект = Док.ПолучитьОбъект();  
	НовоеСостояние = Перечисления.СостоянияНакладной.ГотоваКОтгрузке;
	РнкОбъект.СостояниеНакладной = НовоеСостояние;
	Попытка 
		РнкОбъект.Записать(); 
		//Валетов + 09,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5404
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланНабора.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПланНабора КАК ПланНабора
		|ГДЕ
		|	НЕ ПланНабора.ПометкаУдаления
		|	И ПланНабора.ДокОснование = &Накладная";
		Запрос.УстановитьПараметр("Накладная",Док); 
		Результат = Запрос.Выполнить().Выгрузить();
		ПланНабора = Результат[0].Ссылка.ПолучитьОбъект();		
		Для Каждого СтрБрендов Из ПланНабора.тБрэндов Цикл
			СтрБрендов.Состояние=НовоеСостояние;
		КонецЦикла;				
		ПланНабора.ЗаписатьБезОбработки(РежимЗаписиДокумента.Запись);
		ОбновитьСостоянияЗНБ (НовоеСостояние,Док);
		//Валетов -
		
		НаборЗаписей = РегистрыСведений.СтатусГотовностиКОтгрузкеЧЗ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(Док);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Документ = Док;
		Иначе
			НоваяЗапись = НаборЗаписей[0];
		КонецЕсли;
		
		НоваяЗапись.СтатусЧЗ = Перечисления.СтатусыГотовностиКОтгрузкеЧЗ.Обработано;
		НаборЗаписей.Записать();
	Исключение  
		ЕстьОшибки = Истина;
		ТекстПисьма = ТекстПисьма + " Ошибка перевода в РГ Накладной: № "+ РнкОбъект.Номер + " от "+ РнкОбъект.Дата  + Символы.ПС + ОписаниеОшибки();
	КонецПопытки;
	
	Если ЕстьОшибки Тогда
		ТемаПисьма = "Ошибки регламентного задания перевода накладных из статуса `Ожидание Обработки ЧЗ` в `Готова к отгрузке`, в базе  " + Маркировка_ПИ.ЭтотУзел_Код();
		ОповеститьОбОшибке(ТекстПисьма,ТемаПисьма,СписокПолучателей,Док);
	КонецЕсли;

КонецПроцедуры  


Процедура ОповеститьОбОшибке(ТекстПисьма,ТемаПисьма,СписокПолучателей,ДокОшибкиСсылка)
	//Не шлем письма в течении 10 часов с последней записи с Документом Ошибки
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ПисьмаНаОтправку.ДатаСозданияПисьма КАК ДатаСозданияПисьма,
	                |	ПисьмаНаОтправку.Основание КАК Основание
	                |ИЗ
	                |	РегистрСведений.ПисьмаНаОтправку КАК ПисьмаНаОтправку
	                |ГДЕ
	                |	ПисьмаНаОтправку.Основание = &ДокОсн
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	ПисьмаНаОтправку.ДатаСозданияПисьма УБЫВ";
	Запрос.УстановитьПараметр("ДокОсн",ДокОшибкиСсылка);
	Рез = запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Если ТекущаяДата() - 3600 * 10 <= Рез.ДатаСозданияПисьма	Тогда
			Возврат;  //10 часов на обработку ошибки не прошло, пока не спамим...
		КонецЕсли;
	КонецЦикла;
	
	СписокПолучателей.Добавить("mark@collant.ru");
	//Феданченков М.С. 10.06.2026 начало
	//наряд 0000001265
	СписокПолучателей.Добавить("tp@collant.ru");
	//Феданченков М.С. 10.06.2026 конец
	
	//СписокПолучателей.Добавить("valetov@collant.ru"); 
	
	СформироватьВнутреннееУведомление(СписокПолучателей,ТекстПисьма,ТемаПисьма,ДокОшибкиСсылка);
	
КонецПроцедуры


//Валетов-


#Область Регламенты_Шворобей

// Шворобей ВЮ 29.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5976
Процедура РассылкаОНаличииНезакрытыхКоллективныхРабот(ТаблицаПараметров = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаЗапретаРедактирование", ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования());	
	Запрос.УстановитьПараметр("ДатаНачалаРабот", ТекущаяДатаСеанса() - 86400*1);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КоллективныеРаботы.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КоллективныеРаботы КАК КоллективныеРаботы
	|ГДЕ
	|	КоллективныеРаботы.ДатаНачалаРабот <= &ДатаНачалаРабот
	|	И КоллективныеРаботы.Проведен
	|	И НЕ КоллективныеРаботы.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.Отгружена), ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.Принята))
	|	И КоллективныеРаботы.Дата > &ДатаЗапретаРедактирование
	|	И КоллективныеРаботы.ДатаОкончанияРабот = ДАТАВРЕМЯ(1, 1, 1)";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Количество() = 0 Тогда Возврат; КонецЕсли;
	
	ТемаПисьма = "Рассылка о наличии незакрытых Коллективных работ";
	ТипРассылки = Справочники.ТипыРассылок.НаличиеНезакрытыхКоллективныхРабот;
	ФлагРассылки = "РассылкиЭлПочта";
	
	ТелоПисьма = "";
	Пока Выборка.Следующий() Цикл
		ТелоПисьма = ТелоПисьма + СокрЛП(Выборка.Ссылка) + Символы.ПС;	
	КонецЦикла;
	
	СписокПолучателей = СформСписокПолучат(ТипРассылки, , ФлагРассылки);
	
	Если НЕ ПустаяСтрока(ТелоПисьма) И СписокПолучателей.Количество() > 0 Тогда
		Ответ = СформироватьВнутреннееУведомление(СписокПолучателей, ТелоПисьма, ТемаПисьма,,,,"robot@collant.ru");
	КонецЕсли;
	
КонецПроцедуры
// Шворобей ВЮ 29.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5976

// Шворобей ВЮ 25.08.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-6656
Процедура ОчисткаСкладаСмешанныеСпайки(ТаблицаПараметров = Неопределено) Экспорт
	
	Если ТаблицаПараметров = Неопределено Тогда
		СкладСмешанныеСпайки = Документы.ЗаказСмешанныхСпаекFBO.ПолучитьЗначениеРеквизитыСправочников(, "СкладСмешанныеСпайки", Истина);
	Иначе
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл 
			Если СтрокаТП.Имя = "СкладСмешанныеСпайки" Тогда			
				СкладСмешанныеСпайки = СтрокаТП.Значение;
			КонецЕсли;
		КонецЦикла;  
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("СкладСмешанныеСпайки", СкладСмешанныеСпайки);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) - ЕСТЬNULL(Резервы.КоличествоОстаток, 0) КАК СвободныйОстаток
	|ПОМЕСТИТЬ вр_Остатки
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(&Период, Склад = &СкладСмешанныеСпайки) КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(&Период, Склад = &СкладСмешанныеСпайки) КАК Резервы
	|		ПО Остатки.Склад = Резервы.Склад
	|			И Остатки.Номенклатура = Резервы.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Комплектующие.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ЕСТЬNULL(Комплектующие.Количество, 0)) КАК КоличествоРНК
	|ПОМЕСТИТЬ вр_Товары
	|ИЗ
	|	Документ.РасходнаяНакладная.Комплектующие КАК Комплектующие
	|ГДЕ
	|	Комплектующие.Ссылка.Склад = &СкладСмешанныеСпайки
	|	И Комплектующие.Ссылка.Проведен
	|	И Комплектующие.Ссылка.Дата <= КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
	|	И Комплектующие.Ссылка.СостояниеНакладной В (ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.ПолученоСкладом), ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.ОжиданиеНабора))
	|
	|СГРУППИРОВАТЬ ПО
	|	Комплектующие.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(вр_Товары.Номенклатура, вр_Остатки.Номенклатура) КАК Номенклатура,
	|	СУММА(ЕСТЬNULL(вр_Остатки.СвободныйОстаток, 0) - ЕСТЬNULL(вр_Товары.КоличествоРНК, 0)) КАК ФактическийОстаток
	|ПОМЕСТИТЬ вр_Сводная
	|ИЗ
	|	вр_Остатки КАК вр_Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ вр_Товары КАК вр_Товары
	|		ПО вр_Остатки.Номенклатура = вр_Товары.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(вр_Товары.Номенклатура, вр_Остатки.Номенклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_Сводная.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(вр_Сводная.ФактическийОстаток) КАК ФактическийОстаток,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ОстаткиТМЦ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					И ОстаткиТМЦ.Склад <> &СкладСмешанныеСпайки
	|				ТОГДА ОстаткиТМЦ.Период
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ) КАК Период
	|ПОМЕСТИТЬ вр_ПериодыПоследниеПриходы
	|ИЗ
	|	вр_Сводная КАК вр_Сводная
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ
	|		ПО вр_Сводная.Номенклатура = ОстаткиТМЦ.Номенклатура
	|ГДЕ
	|	ОстаткиТМЦ.Период <= &Период
	|
	|СГРУППИРОВАТЬ ПО
	|	вр_Сводная.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_ПериодыПоследниеПриходы.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(вр_ПериодыПоследниеПриходы.ФактическийОстаток) КАК Количество,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ОстаткиТМЦ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА ОстаткиТМЦ.Склад
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|		КОНЕЦ) КАК Склад
	|ИЗ
	|	вр_ПериодыПоследниеПриходы КАК вр_ПериодыПоследниеПриходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ
	|		ПО вр_ПериодыПоследниеПриходы.Номенклатура = ОстаткиТМЦ.Номенклатура
	|			И вр_ПериодыПоследниеПриходы.Период = ОстаткиТМЦ.Период
	|			И (ВЫБОР
	|				КОГДА ОстаткиТМЦ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА ОстаткиТМЦ.Склад
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			КОНЕЦ <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))
	|ГДЕ
	|	вр_ПериодыПоследниеПриходы.ФактическийОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	вр_ПериодыПоследниеПриходы.Номенклатура";
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) - ЕСТЬNULL(Резервы.КоличествоОстаток, 0) КАК СвободныйОстаток,
	|	Остатки.Склад КАК Склад
	|ПОМЕСТИТЬ вр_Остатки
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(&Период, Склад = &СкладСмешанныеСпайки) КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки КАК Резервы
	|		ПО Остатки.Склад = Резервы.Склад
	|			И Остатки.Номенклатура = Резервы.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Комплектующие.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ЕСТЬNULL(Комплектующие.Количество, 0)) КАК КоличествоРНК
	|ПОМЕСТИТЬ вр_Товары
	|ИЗ
	|	Документ.РасходнаяНакладная.Комплектующие КАК Комплектующие
	|ГДЕ
	|	Комплектующие.Ссылка.Склад = &СкладСмешанныеСпайки
	|	И Комплектующие.Ссылка.Проведен
	|	И Комплектующие.Ссылка.Дата <= КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
	|	И Комплектующие.Ссылка.СостояниеНакладной В (ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.ПолученоСкладом), ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.ОжиданиеНабора))
	|
	|СГРУППИРОВАТЬ ПО
	|	Комплектующие.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(вр_Товары.Номенклатура, вр_Остатки.Номенклатура) КАК Номенклатура,
	|	СУММА(ЕСТЬNULL(вр_Остатки.СвободныйОстаток, 0) - ЕСТЬNULL(вр_Товары.КоличествоРНК, 0)) КАК ФактическийОстаток,
	|	вр_Остатки.Склад КАК Склад
	|ПОМЕСТИТЬ вр_Сводная
	|ИЗ
	|	вр_Остатки КАК вр_Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ вр_Товары КАК вр_Товары
	|		ПО вр_Остатки.Номенклатура = вр_Товары.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(вр_Товары.Номенклатура, вр_Остатки.Номенклатура),
	|	вр_Остатки.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиТМЦ.Период КАК Период,
	|	ОстаткиТМЦ.Регистратор КАК Регистратор,
	|	ОстаткиТМЦ.Регистратор.Склад КАК Склад,
	|	ЕСТЬNULL(ОстаткиТМЦ.Регистратор.СкладПолучатель, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК СкладПолучатель,
	|	ОстаткиТМЦ.Номенклатура КАК Номенклатура,
	|	вр_Сводная.ФактическийОстаток КАК ФактическийОстаток
	|ПОМЕСТИТЬ вр_ПериодыПоследниеПриходы
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вр_Сводная КАК вр_Сводная
	|		ПО ОстаткиТМЦ.Номенклатура = вр_Сводная.Номенклатура
	|ГДЕ
	|	ОстаткиТМЦ.Склад = &СкладСмешанныеСпайки
	|	И ОстаткиТМЦ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ОстаткиТМЦ.Период <= &Период
	|	И ЕСТЬNULL(ОстаткиТМЦ.Регистратор.СкладПолучатель, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вр_ПериодыПоследниеПриходы.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(вр_ПериодыПоследниеПриходы.Период) КАК Период,
	|	МАКСИМУМ(вр_ПериодыПоследниеПриходы.Склад) КАК Склад,
	|	МАКСИМУМ(вр_ПериодыПоследниеПриходы.ФактическийОстаток) КАК Количество
	|ИЗ
	|	вр_ПериодыПоследниеПриходы КАК вр_ПериодыПоследниеПриходы
	|
	|СГРУППИРОВАТЬ ПО
	|	вр_ПериодыПоследниеПриходы.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	Период УБЫВ";
	
	УстановитьПривилегированныйРежим(Истина);
	тзПриходы = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если тзПриходы.Количество() = 0 Тогда Возврат; КонецЕсли;
	
	ДополнительныеРеквизитыПРМ = Новый Структура;
	ДополнительныеРеквизитыПРМ.Вставить("СостояниеНакладной", Перечисления.СостоянияНакладной.Отгружена);
	ДополнительныеРеквизитыПРМ.Вставить("Отгружен", Перечисления.Отгружен.Отгружен);
	ДополнительныеРеквизитыПРМ.Вставить("СостояниеНакладнойУПолучателя", Перечисления.СостоянияНакладной.Принята);
	ДополнительныеРеквизитыПРМ.Вставить("Дата", ТекущаяДатаСеанса());
	
	МассивСкладов = ЗаполнениеДокументов.УдалитьПовторяющиесяЭлементыМассива(тзПриходы.ВыгрузитьКолонку("Склад"));
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////
	// НАДО ЛИ ОБРАБАТЫВАТЬ СИТУАЦИЮ - СКЛАД ??? ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	//////////////////////////////////////////////////////////////////////////////////////////////////////
	
	Для Каждого СтрСклад ИЗ МассивСкладов Цикл
		
		ТаблицаЗагрузки = тзПриходы.Скопировать(Новый Структура("Склад", СтрСклад));
		
		Если ТаблицаЗагрузки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПРМ = ЗаполнениеДокументов.СоздатьПеремещение(, ТаблицаЗагрузки, СкладСмешанныеСпайки,
			СтрСклад, "Очистка склада Смешанные спайки", ДополнительныеРеквизитыПРМ, Истина, Истина);
		
	КонецЦикла;
	
КонецПроцедуры
// Шворобей ВЮ 25.08.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-6656

// Шворобей ВЮ 02.09.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-6873
Процедура АвтоматическоеЗакрытиеМинусовСВычеркамиВРНК(ТаблицаПараметров = Неопределено) Экспорт
	
	МассивОфисныхСкладов = Новый Массив;
	МассивОтветственныхЛиц = Новый Массив;
	
	Если ТаблицаПараметров = Неопределено Тогда
		МассивОфисныхСкладов.Добавить(Справочники.Склады.НайтиПоКоду("STA-48"));
		////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		// МассивСкладовДляПРМ = Новый Массив;
		// А. Склад Часцы (Основной), Б. Склад Часцы (ДОП), В. Склад Часцы (Франчайзинг), Г. Склад Часцы (FBS), Д. Склад Часцы (ДСП), Е. Склад Часцы (ДСП резерв)
		////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	Иначе
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл 
			
			Если СтрокаТП.Имя = "Склад" Тогда			
				МассивОфисныхСкладов.Добавить(СтрокаТП.Значение);
			КонецЕсли;
			Если СтрокаТП.Имя = "ОтветственноеЛицо" Тогда			
				МассивОтветственныхЛиц.Добавить(СтрокаТП.Значение);
			КонецЕсли;
			
		КонецЦикла;  
	КонецЕсли;
	
	МассивОфисныхВиртуальныхСкладов = ПолучитьМассивВиртуальныхСкладов(МассивОфисныхСкладов);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОфисныхВиртуальныхСкладов", МассивОфисныхВиртуальныхСкладов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.Склад КАК Склад,
	|	Остатки.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) - ЕСТЬNULL(Резервы.КоличествоОстаток, 0) КАК СвободныйОстаток
	|ПОМЕСТИТЬ вр_Остатки
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(&Период, Склад В (&МассивОфисныхВиртуальныхСкладов)) КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(&Период, Склад В (&МассивОфисныхВиртуальныхСкладов)) КАК Резервы
	|		ПО Остатки.Склад = Резервы.Склад
	|			И Остатки.Номенклатура = Резервы.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Комплектующие.Ссылка.Склад КАК Склад,
	|	Комплектующие.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ЕСТЬNULL(Комплектующие.Количество, 0)) КАК КоличествоРНК
	|ПОМЕСТИТЬ вр_Товары
	|ИЗ
	|	Документ.РасходнаяНакладная.Комплектующие КАК Комплектующие
	|ГДЕ
	|	Комплектующие.Ссылка.Склад В(&МассивОфисныхВиртуальныхСкладов)
	|	И Комплектующие.Ссылка.Проведен
	|	И Комплектующие.Ссылка.Дата <= КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
	|	И Комплектующие.Ссылка.СостояниеНакладной В (ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.ПолученоСкладом), ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.ОжиданиеНабора))
	|
	|СГРУППИРОВАТЬ ПО
	|	Комплектующие.Ссылка.Склад,
	|	Комплектующие.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(вр_Товары.Склад, вр_Остатки.Склад) КАК Склад,
	|	ЕСТЬNULL(вр_Товары.Номенклатура, вр_Остатки.Номенклатура) КАК Номенклатура,
	|	СУММА(ЕСТЬNULL(вр_Остатки.СвободныйОстаток, 0) - ЕСТЬNULL(вр_Товары.КоличествоРНК, 0)) КАК Количество
	|ИЗ
	|	вр_Остатки КАК вр_Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ вр_Товары КАК вр_Товары
	|		ПО вр_Остатки.Номенклатура = вр_Товары.Номенклатура
	|			И вр_Остатки.Склад = вр_Товары.Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(вр_Товары.Склад, вр_Остатки.Склад),
	|	ЕСТЬNULL(вр_Товары.Номенклатура, вр_Остатки.Номенклатура)
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЕСТЬNULL(вр_Остатки.СвободныйОстаток, 0) - ЕСТЬNULL(вр_Товары.КоличествоРНК, 0)) < 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Склад";
	
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	
	УстановитьПривилегированныйРежим(Истина);
	тзМинуса = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если тзМинуса.Количество() = 0 Тогда Возврат; КонецЕсли;
	
	МассивСкладовДляПРМ = ЗаполнениеДокументов.УдалитьПовторяющиесяЭлементыМассива(тзМинуса.ВыгрузитьКолонку("Склад"));
	
	ДополнительныеРеквизитыПРМ = Новый Структура;
	ДополнительныеРеквизитыПРМ.Вставить("СостояниеНакладной", Перечисления.СостоянияНакладной.Отгружена);
	ДополнительныеРеквизитыПРМ.Вставить("Отгружен", Перечисления.Отгружен.Отгружен);
	ДополнительныеРеквизитыПРМ.Вставить("СостояниеНакладнойУПолучателя", Перечисления.СостоянияНакладной.Принята);
	ДополнительныеРеквизитыПРМ.Вставить("Дата", ТекущаяДатаСеанса());
	
	Для Каждого СкладПриемник ИЗ МассивСкладовДляПРМ Цикл
		
		ТаблицаЗагрузки = тзМинуса.Скопировать(Новый Структура("Склад", СкладПриемник));
		
		Если ТаблицаЗагрузки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Стр ИЗ ТаблицаЗагрузки Цикл
			Стр.Количество = Модуль(Стр.Количество);	
		КонецЦикла;
		
		МассивПРМ = СоздатьПРМ(ТаблицаЗагрузки, МассивОфисныхСкладов, СкладПриемник); 
		
	КонецЦикла;
	
	// Если минус не закрыт, то уменьшается количество в РНК/ПРМ в состоянии «в работе», с сортировкой по дате по убыванию, без сортировки по контрагентам.
	// При этом менеджеру контрагента (или ответственному лицу департамента) приходит письмо о вычерке.
	
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	
	УстановитьПривилегированныйРежим(Истина);
	тзМинуса = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если тзМинуса.Количество() = 0 Тогда Возврат; КонецЕсли;
	
	Запрос.УстановитьПараметр("тзМинуса", тзМинуса);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Минуса.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(Минуса.Склад КАК Справочник.Склады) КАК Склад,
	|	-(ВЫРАЗИТЬ(Минуса.Количество КАК ЧИСЛО)) КАК Количество
	|ПОМЕСТИТЬ вр_Минуса
	|ИЗ
	|	&тзМинуса КАК Минуса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыРНК.Ссылка КАК Ссылка,
	|	ТоварыРНК.Ссылка.Дата КАК Дата,
	|	ТоварыРНК.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТоварыРНК.Количество, 0) КАК КоличествоБыло,
	|	ЕСТЬNULL(ТоварыРНК.Количество, 0) - ЕСТЬNULL(вр_Минуса.Количество, 0) КАК Количество
	|ИЗ
	|	Документ.РасходнаяНакладная.Товары КАК ТоварыРНК
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вр_Минуса КАК вр_Минуса
	|		ПО ТоварыРНК.Номенклатура = вр_Минуса.Номенклатура
	|			И ТоварыРНК.Ссылка.Склад = вр_Минуса.Склад
	|ГДЕ
	|	ТоварыРНК.Ссылка.СостояниеНакладной = ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.ВРаботе)
	|	И ЕСТЬNULL(ТоварыРНК.Количество, 0) - ЕСТЬNULL(вр_Минуса.Количество, 0) > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыПРМ.Ссылка,
	|	ТоварыПРМ.Ссылка.Дата,
	|	ТоварыПРМ.Номенклатура,
	|	ЕСТЬNULL(ТоварыПРМ.Количество, 0),
	|	ЕСТЬNULL(ТоварыПРМ.Количество, 0) - ЕСТЬNULL(вр_Минуса.Количество, 0)
	|ИЗ
	|	Документ.Перемещение.Товары КАК ТоварыПРМ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вр_Минуса КАК вр_Минуса
	|		ПО ТоварыПРМ.Номенклатура = вр_Минуса.Номенклатура
	|			И ТоварыПРМ.Ссылка.СкладПолучатель = вр_Минуса.Склад
	|ГДЕ
	|	ТоварыПРМ.Ссылка.СостояниеНакладной = ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.ВРаботе)
	|	И ЕСТЬNULL(ТоварыПРМ.Количество, 0) - ЕСТЬNULL(вр_Минуса.Количество, 0) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	|ИТОГИ ПО
	|	Ссылка";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка_Ссылка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	УстановитьПривилегированныйРежим(Ложь);
	
	МассивУжеУменьшили = Новый Массив;
	
	Пока Выборка_Ссылка.Следующий() Цикл
		
		ДокОбъект = Выборка_Ссылка.Ссылка.ПолучитьОбъект();
		
		Если ДокОбъект <> Неопределено Тогда
			
			Выборка = Выборка_Ссылка.Выбрать();
			
			ДокументПерезаписывать = Ложь;
			
			МассивВычерков = Новый Массив;
			
			Пока Выборка.Следующий() Цикл
				
				Если МассивУжеУменьшили.Найти(Выборка.Номенклатура) = Неопределено Тогда
					
					НайденныеСтрокиДок = ДокОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура", Выборка.Номенклатура));
					
					Для Каждого НСтр ИЗ НайденныеСтрокиДок Цикл
						
						НСтр.Количество = Выборка.Количество;
						Если ЕстьРеквизитТабЧастиДокумента("ПодтвержденнаяЗаявка", ДокОбъект.Метаданные(), "Товары") Тогда
							НСтр.ПодтвержденнаяЗаявка = Выборка.Количество;
						КонецЕсли;
						РассчитатьСуммуТабЧасти(НСтр, ДокОбъект);
						
						МассивУжеУменьшили.Добавить(Выборка.Номенклатура);
						ДокументПерезаписывать = Истина;
						
						МассивВычерков.Добавить(Строка(Выборка.Номенклатура) + " уменьшили Количество до " + Строка(Выборка.Количество));
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если ДокументПерезаписывать Тогда	
				Попытка
					ДокОбъект.ЗаписатьБезОбработки(РежимЗаписиДокумента.Проведение);
					// При этом менеджеру контрагента (или ответственному лицу департамента) приходит письмо о вычерке.
					Если ЗначениеЗаполнено(ДокОбъект.Контрагент.Менеджер) Тогда
						
						СписокПолучателей = Новый СписокЗначений;
						Если ЗначениеЗаполнено(ДокОбъект.Контрагент.Менеджер.ЕМэйл) Тогда
							СписокПолучателей.Добавить(СокрЛП(ДокОбъект.Контрагент.Менеджер.ЕМэйл));
						КонецЕсли;
						
						Для Каждого ФизЛицо ИЗ МассивОтветственныхЛиц Цикл
							Если ЗначениеЗаполнено(ФизЛицо.ЕМэйл) Тогда
								СписокПолучателей.Добавить(ФизЛицо.ЕМэйл);	
							КонецЕсли;
						КонецЦикла;
						
						ТемаПисьма = "Рассылка о наличии вычерков в документе " + Строка(ДокОбъект.Ссылка);
						ТелоПисьма = "";
						Для Каждого ТекстВычерка ИЗ МассивВычерков Цикл
							ТелоПисьма = ТелоПисьма + ТекстВычерка + ?(МассивВычерков.Количество() > 1, Символы.ПС, "");	
						КонецЦикла;
						
						Если НЕ ПустаяСтрока(ТелоПисьма) И СписокПолучателей.Количество() > 0 Тогда
							Ответ = СформироватьВнутреннееУведомление(СписокПолучателей, ТелоПисьма, ТемаПисьма, ДокОбъект.Ссылка,,,"robot@collant.ru");
						КонецЕсли;
						
					КонецЕсли;
				Исключение
			        ЗаписатьВЛог("РегЗадание.ЗакрытиеМинусов", "Не могу записать документ " + Строка(ДокОбъект), "Информация");
				КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьМассивВиртуальныхСкладов(МассивФизическихСкладов)
	
	МассивВиртуальныхСкладов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивФизическихСкладов", МассивФизическихСкладов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Склады.Ссылка КАК Склад
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.ФизическийСклад В (&МассивФизическихСкладов)
	|	И Склады.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ВидСклада.Виртуальный)
	|	И НЕ Склады.НеИспользовать
	|	И НЕ Склады.ПометкаУдаления
	|	И НЕ Склады.ЭтоГруппа";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивВиртуальныхСкладов.Добавить(Выборка.Склад);	
	КонецЦикла; 
	
	Возврат МассивВиртуальныхСкладов;
	
КонецФункции //
// Шворобей ВЮ 02.09.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-6873

Функция СоздатьПРМ(тзСпайки, МассивСкладов, СкладПриемник)
	
	МассивПРМ = Новый Массив;
	
	ДатаПРМ = ТекущаяДатаСеанса();
	
	ДополнительныеРеквизитыПРМ = Новый Структура;
	ДополнительныеРеквизитыПРМ.Вставить("СостояниеНакладной", Перечисления.СостоянияНакладной.Отгружена);
	ДополнительныеРеквизитыПРМ.Вставить("Отгружен", Перечисления.Отгружен.Отгружен);
	ДополнительныеРеквизитыПРМ.Вставить("СостояниеНакладнойУПолучателя", Перечисления.СостоянияНакладной.Принята);
	ДополнительныеРеквизитыПРМ.Вставить("Дата", ДатаПРМ);
	ДополнительныеРеквизитыПРМ.Вставить("ДатаПриемки", ДатаПРМ);
	ДополнительныеРеквизитыПРМ.Вставить("ДатаОтгрузки", ДатаПРМ);
	
	Для Каждого СтрСклад ИЗ МассивСкладов Цикл  // Обходим Склады
		
		Если СтрСклад = СкладПриемник Тогда
			Продолжить;
		КонецЕсли;
		
		тзСпайкиПРМ = Новый ТаблицаЗначений;
		тзСпайкиПРМ.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		тзСпайкиПРМ.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
		
		Для Каждого СтрокаТЗ ИЗ тзСпайки Цикл
			
			Количество = СтрокаТЗ.Количество;
			
			Если Количество <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ОстатокНаСкладе = Документы.ЗаказСмешанныхСпаекFBO.РассчитатьОстаткиПоОдномуСкладу(СтрокаТЗ.Номенклатура, СтрСклад);
			
			Если ОстатокНаСкладе <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если Количество >= ОстатокНаСкладе Тогда
				
				НоваяСтрока = тзСпайкиПРМ.Добавить();
				НоваяСтрока.Номенклатура = СтрокаТЗ.Номенклатура;
				НоваяСтрока.Количество = ОстатокНаСкладе;
				
				СтрокаТЗ.Количество = Количество - ОстатокНаСкладе;
				
			ИначеЕсли ОстатокНаСкладе > Количество Тогда
				
				НоваяСтрока = тзСпайкиПРМ.Добавить();
				НоваяСтрока.Номенклатура = СтрокаТЗ.Номенклатура;
				НоваяСтрока.Количество = Количество;
				
				СтрокаТЗ.Количество = 0;	
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если тзСпайкиПРМ.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ДополнительныеРеквизитыПРМ.Вставить("Склад", СтрСклад);
		
		ПРМ = ЗаполнениеДокументов.СоздатьПеремещение(Неопределено, тзСпайкиПРМ, СтрСклад,
			СкладПриемник, "Закрытие минусов", ДополнительныеРеквизитыПРМ, Истина, Истина);
			
		Если ПРМ <> Неопределено Тогда
			МассивПРМ.Добавить(ПРМ);		
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивПРМ;
	
КонецФункции

#КонецОбласти

//+MARK-704 20251126 Михайловский
Процедура КорректировкаШККМ(ТаблицаПараметров=Неопределено) Экспорт
	НаборЗап = РегистрыСведений.КорректировкаЗначениеКМ.СоздатьНаборЗаписей();
	НаборЗап.Отбор.Обработано.Установить(Ложь);
	НаборЗап.Прочитать();  
	Прод = Ложь;
	Если НаборЗап.Количество() Тогда 
		Прод = Истина;
		МасЗап = Новый Массив;
		Для Каждого ТЗап Из НаборЗап Цикл
			МасЗап.Добавить(Новый Структура("RefBC, ValBC, ValBC1", XMLСтрока(ТЗап.ШтрихКодУпаковки), XMLСтрока(ТЗап.ЗначениеШтрихкода), XMLСтрока(ТЗап.ЗначениеШтрихкода1)));
		КонецЦикла;
		
	КонецЕсли;
	Если Прод И МасЗап.Количество() Тогда
		ЗаписьJSON = Новый ЗаписьJSON();
		ЗаписьJSON.УстановитьСтроку();
		СтрукКМ = Новый Структура;
	
		СтрукКМ.Вставить("ObjectsBC", МасЗап);
		ЗаписатьJSON(ЗаписьJSON, СтрукКМ);
		СтрокаJSON = ЗаписьJSON.Закрыть();
		СтрПар = ПолучитьПараметрыHTTP();
		СоединениеHTTP = Новый HTTPСоединение(СтрПар.Хост, , СтрПар.Логин, СтрПар.Пароль);
		HTTP_Запрос = Новый HTTPзапрос();
		HTTP_Запрос.УстановитьТелоИзСтроки(СтрокаJSON);
		HTTP_Запрос.АдресРесурса = СтрПар.Ресурс;
		ОтветHTTP = СоединениеHTTP.ОтправитьДляОбработки(HTTP_Запрос);
		СтрВозврат = ОтветHTTP.ПолучитьТелоКакСтроку();
		Если ОтветHTTP.КодСостояния = 200 Тогда
			Ответ = СтрВозврат;
		Иначе
			Ответ = НСтр("ru='Ошибка при обработке запроса '")+СтрВозврат;
		КонецЕсли;
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрВозврат);
		Сода = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		МасОбр = Сода["ResultArray"];
		НаборЗап1 = РегистрыСведений.КорректировкаЗначениеКМ.СоздатьНаборЗаписей();
		НаборЗап1.Прочитать();
		
		Для Каждого ТЗап Из НаборЗап1 Цикл
			Если НЕ (МасОбр.Найти(XMLСтрока(ТЗап.ШтрихКодУпаковки)) = Неопределено) Тогда
				ТЗап.Обработано = Истина;
				//с обменом не возвращается так лучше
				ОбновитьЗначШККМ(XMLСтрока(ТЗап.ШтрихКодУпаковки), ТЗап.ЗначениеШтрихкода, ТЗап.ЗначениеШтрихкода1);
			КонецЕсли;	
		КонецЦикла;	
		НаборЗап1.Записать();
	КонецЕсли;	
КонецПроцедуры

Процедура ОбновитьЗначШККМ(УИДСпр, ЗнШК, ЗнШК1)
	Попытка
		СпрШК = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(УИДСпр)); 
		Если ЗначениеЗаполнено(СпрШК) И НЕ (СпрШК.ЗначениеШтрихкода = ЗнШК1) Тогда
			СпрШКОб = СпрШК.ПолучитьОбъект();
			Если НЕ СпрШКОб = Неопределено Тогда
				СпрШКОб.ЗначениеШтрихкода = ЗнШК1;
				СпрШКОб.Записать(); 
			КонецЕсли; 
		КонецЕсли;	
	Исключение
		Сообщение = Сообщение + " Ошибка: " + ОписаниеОшибки();
	КонецПопытки;
КонецПроцедуры	

Функция ПолучитьПараметрыHTTP()
	Возврат РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
			Справочники.КлючиБезопасногоХранилищаДанных.ДанныеHTTPПубликацииSNL);
КонецФункции //-MARK-704 20251126 Михайловский

//Стырил у Андрея из Паллет 
Процедура ОбновитьСостоянияЗНБ (НовоеСостояние,Накладная)
	Запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ
	|	ЗаданиеНабора.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаданиеНабора КАК ЗаданиеНабора
	|ГДЕ
	|	ЗаданиеНабора.Накладная = &Накладная
	|	И ЗаданиеНабора.Проведен
	|	И ЗаданиеНабора.СостояниеНакладной <> &СостояниеНакладной";
	запрос.УстановитьПараметр("Накладная",Накладная);
	запрос.УстановитьПараметр("СостояниеНакладной",НовоеСостояние);
	результат=запрос.Выполнить().Выбрать();
	пока результат.Следующий() цикл
		ЗНБ=результат.ссылка.получитьобъект();
		ЗНБ.СостояниеНакладной=НовоеСостояние;
		ЗНБ.ОбменДанными.Загрузка=Истина;
		знб.Записать();
	КонецЦикла;
КонецПроцедуры   

//++Данилова Е.В. 30.06.2026 Изм.№0000000174
Процедура ПроверкаВерсииИНВПередСозданиемОПР_СПН(Знач Документрегистрации, ВерсияДанных) Экспорт

	ДокЗаписан = Ложь;
	
	МаркировкаС.ПроверкаВерсииДокументаПриЗаписи(ВерсияДанных, Документрегистрации, ДокЗаписан);
		
	Если ДокЗаписан Тогда
		Документы.Инвентаризация.СоздатьИзменитьПоИНВ_ОПР_СПН_(Документрегистрации); 
	Иначе
		
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Ошибка выполнения в фоне создания ОПР и СПН по документу ИНВ'"), УровеньЖурналаРегистрации.Ошибка,
		, , НСтр(
		"ru = 'Ошибка в ""СоздатьИзменитьПоИНВ_ОПР_СПН_ВФоне"".'"));
	КонецЕсли;


КонецПроцедуры
//--Данилова Е.В. 30.06.2026 
