Функция НайтиШКПоКМНаименование( Знач КМ) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	НЕ ШтрихкодыУпаковокТоваров.ПометкаУдаления
	|	И ШтрихкодыУпаковокТоваров.Наименование ПОДОБНО &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", СокрЛП(КМ));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ссылка; 
	КонецЕсли; 	
	Возврат Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка();

КонецФункции // ()

Функция ДанныеПоСтатусамФакт(Знач ШК) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыКМ_ФактСрезПоследних.Статус КАК Статус,
	|	СтатусыКМ_ФактСрезПоследних.Местонахождение КАК Местонахождение
	|ИЗ
	|	РегистрСведений.СтатусыКМ_Факт.СрезПоследних(, ШтрихКодУпаковки = &ШК) КАК СтатусыКМ_ФактСрезПоследних";
	
	Запрос.УстановитьПараметр("ШК", ШК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат   Новый Структура("Статус,Местонахождение",ВыборкаДетальныеЗаписи.Статус,ВыборкаДетальныеЗаписи.Местонахождение); 
		
	КонецЕсли;
	
	Возврат Новый Структура("Статус,Местонахождение",Перечисления.СтатусыКодовМаркировкиФакт.ПустаяСсылка(),неопределено);

КонецФункции // ()

