Функция ПолучитьДанныеПоКодамКМ(МассивКодовДляОтработки,АдресВозврата = Неопределено) Экспорт
	
	АПИЧЗОбъект = Обработки.АпиЧЗ.Создать(); 
	Результат = АПИЧЗОбъект.СтруктураРезультата();
	
	КоличествоСтрок = МассивКодовДляОтработки.Количество();
	
	Если КоличествоСтрок = 0 Тогда
		Результат.Успешно = Ложь;
		Результат.Ошибки.Добавить("Не найдены строки для отработки"); 
	Иначе
		СоответствиеДанных = Новый Соответствие;
		Для каждого  КодМассива Из МассивКодовДляОтработки  Цикл
			
			СтруктураДанных = Новый Структура("Cis,errorMessage,ШК,СтатусЧЗФакт,Местонахождение,productName");
			СтруктураДанных.Cis = КодМассива; 
			СтруктураДанных.ШК = Обработки.ПоискИнформацииПоКМ.НайтиШКПоКМНаименование(КодМассива);
			СтруктураДанных.productName = СтруктураДанных.ШК.Владелец.Наименование; 
			
			ДанныеФакт = Обработки.ПоискИнформацииПоКМ.ДанныеПоСтатусамФакт(СтруктураДанных.ШК);
			СтруктураДанных.СтатусЧЗФакт = ДанныеФакт.Статус;
			СтруктураДанных.Местонахождение = ДанныеФакт.Местонахождение;
			
			Если Не ЗначениеЗаполнено(СтруктураДанных.ШК) Тогда
			
				СтруктураДанных.errorMessage = "Не найден по коду ШК КМ"; 
			
			КонецЕсли;
				
			СоответствиеДанных.Вставить(КодМассива,СтруктураДанных); 
			
		КонецЦикла;
		Результат.Данные.Добавить(СоответствиеДанных); 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресВозврата) И ЭтоАдресВременногоХранилища(АдресВозврата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресВозврата);
	Иначе 
		ЗаписатьВЛог("Получение информации КМ","Не найден адрес временного хранилища","Ошибка"); 
	КонецЕсли;
	
	Возврат Результат;
КонецФункции
