Процедура РазвернутьГруппировки(Результат,Уровень=0)
	Группировка=Построитель.ИзмеренияСтроки[Уровень].Имя;
	Выборка=Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,Группировка);
	Пока Выборка.Следующий() Цикл
		Сообщить("Уровень: "+Уровень);
		Если Уровень<Построитель.ИзмеренияСтроки.Количество()-1 Тогда
			РазвернутьГруппировки(Выборка,Уровень+1)	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
 
Процедура ВыполнитьРасчет(ТД=Неопределено) Экспорт

	ВыводитьОтчет=?(ТД=Неопределено,Ложь,Истина);
	
	ТР.Очистить();
	
	Макет=ПолучитьМакет("Заголовки");
	
	Если НЕ РазделОтчета.Пустая() Тогда
		ВыборкаРазделов=Справочники.АналитикаОтчетов.Выбрать(,ВидОтчета,Новый Структура("Код",РазделОтчета.Код),"Код");		
	Иначе
		ВыборкаРазделов=Справочники.АналитикаОтчетов.Выбрать(,ВидОтчета,,"Код");		
	КонецЕсли; 
		
	Пока ВыборкаРазделов.Следующий() Цикл
		ОбработкаПрерыванияПользователя();
		
		Если ВыводитьОтчет Тогда		
			ОблРаздела=Макет.ПолучитьОбласть("РазделОтчета");
			ОблРаздела.Параметры.РазделОтчета=ВыборкаРазделов.Наименование;
			
			ТД.Вывести(ОблРаздела);	
			
			ТД.НачатьГруппуСтрок(ВыборкаРазделов.Наименование);			
		КонецЕсли;		
		
		Для Каждого Привязка Из ВыборкаРазделов.Привязки Цикл
			ОбработкаПрерыванияПользователя();
			
			Попытка
				Показатели=ВыборкаРазделов.Показатели.НайтиСтроки(Новый Структура("ИД_Привязки",Привязка.ИД_Привязки));
				
				Построитель.ТекстЗаголовка	= Привязка.Наименование;
				Построитель.ВыводитьЗаголовокОтчета=Истина;
				
				Построитель.Текст			= Привязка.ТекстПостроителя;
				Построитель.ЗаполнитьНастройки();
				
				Настройки=Привязка.Фильтр.Получить();
				Если ТипЗнч(Настройки)=Тип("НастройкиПостроителяОтчета") Тогда
					Построитель.УстановитьНастройки(Настройки);									
				КонецЕсли;
				
				Построитель.ОбрабатыватьПрерываниеПользователя=Истина;
				
				Построитель.Параметры.Вставить("Дата1",НачалоДня(Дата1));
				Построитель.Параметры.Вставить("Дата2",КонецДня(Дата2));
				
				Построитель.Параметры.Вставить("Организация",Организация);
				
				Если НЕ ДокОтчет.Подразделение.Пустая() Тогда					
					Если Построитель.ДоступныеПоля.Найти("Подразделение")<>Неопределено Тогда
						ЭО=Построитель.Отбор.Добавить("Подразделение");
						ЭО.ВидСравнения	=ВидСравнения.ВИерархии;
						ЭО.Значение		=ДокОтчет.Подразделение;
						ЭО.Использование=Истина;						
					КонецЕсли;			
				КонецЕсли; 
				
				Состояние("Расчет: "+ВыборкаРазделов.Наименование+" "+Привязка.Наименование);
				Построитель.Выполнить();
				
				ТРП=ТР.ВыгрузитьКолонки();
				
				ЕстьПодразделение=(Построитель.Результат.Колонки.найти("Подразделение")<>Неопределено); 
				
				ВыборкаРезультатов=Построитель.Результат.Выбрать();
				Пока ВыборкаРезультатов.Следующий() Цикл
					Если ВыборкаРезультатов.ТипЗаписи()=ТипЗаписиЗапроса[Привязка.ТипЗаписиРезультата] Тогда 
						Для Каждого Показатель Из Показатели Цикл
							Если НЕ ПустаяСтрока(Показатель.ПолеЗапроса) Тогда
								Значение	= ВыборкаРезультатов[Показатель.ПолеЗапроса];
							Иначе
								Значение	= 0;						
							КонецЕсли;							
							
							Значение	=?(Значение=Null,0,Значение)*Привязка.Знак;
							
							Если НЕ ЗначениеЗаполнено(Значение) Тогда Продолжить КонецЕсли; 
							
							СтрокаТР=ТРП.Добавить();
							
							СтрокаТР.РазделОтчета	=ВыборкаРазделов.Ссылка;						
							СтрокаТР.Привязка		=Привязка.Наименование;
							СтрокаТР.Показатель		=Показатель.Показатель;
							СтрокаТР.Значение		=Значение;
							СтрокаТР.Регистр		=Привязка.ИмяРегистра;
							СтрокаТР.ЗнакПривязки	=Привязка.Знак;
							
							Если ЕстьПодразделение Тогда
								СтрокаТР.Подразделение=ВыборкаРезультатов.Подразделение;							
							КонецЕсли; 
							
							Для Сч=1 По 2 Цикл
								ИмяРасшифровки="Расшифровка"+Сч;
								
								Если ЗначениеЗаполнено(Привязка[ИмяРасшифровки]) Тогда 
									Если Привязка[ИмяРасшифровки]="__Привязка" Тогда
										СтрокаТР[ИмяРасшифровки]	=Привязка.Наименование;								
									Иначе
										СтрокаТР[ИмяРасшифровки]	=ВыборкаРезультатов[Привязка[ИмяРасшифровки]];
										Если НЕ ЗначениеЗаполнено(СтрокаТР[ИмяРасшифровки]) Тогда
											СтрокаТР[ИмяРасшифровки]	="<!--НЕ ОПРЕДЕЛЕНО--!>";														
										КонецЕсли;								
									КонецЕсли;
								Иначе
									СтрокаТР[ИмяРасшифровки]		=Привязка["Значение"+ИмяРасшифровки];
								КонецЕсли;							
							КонецЦикла;							
						КонецЦикла;					
					КонецЕсли;			
				КонецЦикла;				
				
				Если СокрЛП(Привязка.ИтоговоеСальдо)="Положительное" ИЛИ СокрЛП(Привязка.ИтоговоеСальдо)="Отрицательное" Тогда
					ТРП_Св=ТРП.Скопировать();				
					ТРП_Св.Свернуть("Показатель","Значение");
					Для Каждого СтрокаТРП_Св Из ТРП_Св Цикл
						Если 
								(СокрЛП(Привязка.ИтоговоеСальдо)="Положительное" И СтрокаТРП_Св.Значение<0)
							ИЛИ (СокрЛП(Привязка.ИтоговоеСальдо)="Отрицательное" И СтрокаТРП_Св.Значение>0) Тогда
							
							СтрокиКУдалению=ТРП.НайтиСтроки(Новый Структура("Показатель",СтрокаТРП_Св.Показатель));
							Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
								ТРП.Удалить(СтрокаКУдалению);							
							КонецЦикла; 
						КонецЕсли;		
					КонецЦикла; 				
				КонецЕсли;				
				
				Для Каждого СтрокаТРП Из ТРП Цикл
					СтрокаТР=ТР.Добавить();				
					ЗаполнитьЗначенияСвойств(СтрокаТР,СтрокаТРП);				
				КонецЦикла;
				
				Если ВыводитьОтчет Тогда
					Построитель.Макет=Неопределено;
					Построитель.МакетОформления=ПолучитьМакетОформления(СтандартноеОформление.Классика);
					
					Построитель.Вывести(ТД);
				КонецЕсли;
			Исключение
				Сообщить("Ошибка расчета раздела: ("+ВыборкаРазделов.Код+") "+ВыборкаРазделов.Наименование+", привязка: "+Привязка.Наименование+". "+ОписаниеОшибки(),СтатусСообщения.Важное);
			КонецПопытки;
		КонецЦикла;	
		
		Если ВыводитьОтчет Тогда
			ТД.ЗакончитьГруппуСтрок();
		КонецЕсли;
	КонецЦикла;
	
	ТР.Свернуть("Подразделение,РазделОтчета,Регистр,Расшифровка1,Расшифровка2,Привязка,ЗнакПривязки,Показатель","Значение");
КонецПроцедуры
 