Перем ПутиПапок Экспорт;
Перем ПутиФайлов Экспорт;
Перем ИмяПути Экспорт;
Перем Контрагент Экспорт;
Перем ТипШк Экспорт;
Перем КодМетро Экспорт; 
Перем Файлы Экспорт;
Перем Ошибки Экспорт;
Перем КритичОшибки,КритичОшибкиЛента Экспорт;
Перем ТЗПЕчать,ТЗШапка,АктШапка,АктТаблица Экспорт;
Перем Ашан Экспорт;
Перем НомПП;
Перем Отказ;
Перем ОшибкиАртикул;
Перем СписокФиксПрайс;



Процедура СообщитьМенеджеру() Экспорт
	
	Если ПараметрыСеанса.Отладка Тогда
		Возврат;
	КонецЕсли;
	
	
	//СтрШапка=Шапка.Получить(0);
	
	//Катаев+ 15/04/13
	//Если СтрШапка.контрагент=Неопределено Тогда
	//Если СтрШапка.контрагент=Неопределено или стрШапка.Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
	//	возврат;
	//КонецЕсли;	
	//Катаев- 15/04/13
	
	//	Менеджер=СтрШапка.контрагент.Менеджер;
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//
	//Катаев+ 28/06/13 Добавка для филиалов
	//Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
	//	Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//	Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Иначе
	//	Профиль.АдресСервераPOP3   = "87.236.190.180";
	//	Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//КонецЕсли;
	////Катаев- 28/06/13
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);		 
	// Кухарь А.Ю.  08.09.2022 конец
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	//---------------------------------------------------------------
	//Попытка
	//	ИмяФайлаПечати=ФормированиеПечати(ТЗПечать,ТЗШапка); //+++
	//Исключение
	//	КритичОшибки.Добавить("Не сформирован файл печати! "+Символ(13));
	//КонецПопытки;
	
	// и прикрепляем файл;
	
	
	
	////----------------------------------------------------------------
	Сообщение=новый интернетПочтовоеСообщение;
//	Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	Сообщение.Получатели.Добавить("ovlto@collant.ru");
	
	Сообщение.Отправитель="ecode@collant.ru";
	
	Сообщение.Тема="Отправка УПД для Тандера!";
	Строка=Символ(13)+Символ(13)+"       Добрый день!"+Символ(13)+Символ(13);
	
	Для рр=0 по файлы.Количество()-1 Цикл
		Строка=Строка+символы.ПС+Файлы[рр];
	КонецЦикла;
	
	
	НомСтр=1;
	
	Строка=Строка+Символы.ПС;
	Если Ошибки.количество()>1 Тогда
		Строка=Строка+Символы.ПС+"Не выписаны УПД:";
	КонецЕсли;	
	Если НЕ Ошибки=Неопределено и ошибки.Количество()>0 Тогда
		Для рр=0 по ошибки.Количество()-1 Цикл
			Строка=Строка+Символы.ПС+НомСтр+". "+Ошибки[рр];
			Строка=Строка+Символы.ПС;
			НомСтр=НомСтр+1;
		КонецЦикла;
	конецЕсли;
	Строка=Строка+Символы.ПС+"________________________________________________________________";
	
	Сообщение.Тексты.Добавить(Строка);
	
	//Сообщение.Вложения.Добавить(ПутьФайла);
	
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
	исключение
		КритичОшибки.Добавить("Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки() );
	конецПопытки;
	Попытка
		Почта.Послать(Сообщение);
		ЗаписатьВЛог("Отправка писем УПД Тандер","Письмо отправлено","Информация");   
	исключение
		
	конецПопытки;
	Почта.Отключиться();
	//УдалитьФайлы(ИмяФайлаПечати);     //+++
	
КонецПроцедуры

//нечаева 10,09,19+++
Процедура СообщитьМенеджеруЛента() Экспорт
	
	Если ПараметрыСеанса.Отладка Тогда
		Возврат;
	КонецЕсли;
	
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//
	//Катаев+ 28/06/13 Добавка для филиалов
	//Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
	//	Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//	Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Иначе
	//	Профиль.АдресСервераPOP3   = "87.236.190.180";
	//	Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//КонецЕсли;
	////Катаев- 28/06/13
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);		 
	// Кухарь А.Ю.  08.09.2022 конец
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	//---------------------------------------------------------------
	//Попытка
	//	ИмяФайлаПечати=ФормированиеПечати(ТЗПечать,ТЗШапка); //+++
	//Исключение
	//	КритичОшибки.Добавить("Не сформирован файл печати! "+Символ(13));
	//КонецПопытки;
	
	// и прикрепляем файл;
	
	
	
	////----------------------------------------------------------------
	Сообщение=новый интернетПочтовоеСообщение;
//	Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	Сообщение.Получатели.Добавить("ovlto@collant.ru");
	
	Сообщение.Отправитель="ecode@collant.ru";
	
	Сообщение.Тема="Отправка УПД для Ленты!";
	Строка=Символ(13)+Символ(13)+"       Добрый день!"+Символ(13)+Символ(13);
	
	Для рр=0 по файлы.Количество()-1 Цикл
		Строка=Строка+символы.ПС+Файлы[рр];
	КонецЦикла;
	
	
	НомСтр=1;
	
	Строка=Строка+Символы.ПС;
	Если Ошибки.количество()>1 Тогда
		Строка=Строка+Символы.ПС+"Не выписаны УПД:";
	КонецЕсли;	
	Если НЕ Ошибки=Неопределено и ошибки.Количество()>0 Тогда
		Для рр=0 по ошибки.Количество()-1 Цикл
			Строка=Строка+Символы.ПС+НомСтр+". "+Ошибки[рр];
			Строка=Строка+Символы.ПС;
			НомСтр=НомСтр+1;
		КонецЦикла;
	конецЕсли;
	Строка=Строка+Символы.ПС+"________________________________________________________________";
	
	Сообщение.Тексты.Добавить(Строка);
	
	//Сообщение.Вложения.Добавить(ПутьФайла);
	
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
	исключение
		КритичОшибки.Добавить("Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки() );
	конецПопытки;
	Попытка
		Почта.Послать(Сообщение);
		//ЗаписатьВЛог("Отправка писем УПД Тандер","Письмо отправлено","Информация");   
	исключение
		
	конецПопытки;
	Почта.Отключиться();
	//УдалитьФайлы(ИмяФайлаПечати);     //+++
	
КонецПроцедуры
//нечаева 10,09,19 ---

//нечаева 17,02,20+++
Процедура СообщитьМенеджеруОбщее() Экспорт
	//возврат;
	Если ПараметрыСеанса.Отладка Тогда
		Возврат;
	КонецЕсли;
	
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);		 
	// Кухарь А.Ю.  08.09.2022 конец
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
	Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
	Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	
	////----------------------------------------------------------------
	Сообщение=новый интернетПочтовоеСообщение;
	//Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	Сообщение.Получатели.Добавить("ovlto@collant.ru");
	
	Сообщение.Отправитель="ecode@collant.ru";
	
	Сообщение.Тема="Отправка УПД !";
	Строка=Символ(13)+Символ(13)+"       Добрый день!"+Символ(13)+Символ(13);
	
	Для рр=0 по файлы.Количество()-1 Цикл
		Строка=Строка+символы.ПС+Файлы[рр];
	КонецЦикла;
	
	НомСтр=1;
	
	Строка=Строка+Символы.ПС;
	Если Ошибки.количество()>1 Тогда
		Строка=Строка+Символы.ПС+"Не выписаны УПД:";
	КонецЕсли;	
	Если НЕ Ошибки=Неопределено и ошибки.Количество()>0 Тогда
		Для рр=0 по ошибки.Количество()-1 Цикл
			Строка=Строка+Символы.ПС+НомСтр+". "+Ошибки[рр];
			Строка=Строка+Символы.ПС;
			НомСтр=НомСтр+1;
		КонецЦикла;
	конецЕсли;
	Строка=Строка+Символы.ПС+"________________________________________________________________";
	
	Сообщение.Тексты.Добавить(Строка);
	//Сообщение.Вложения.Добавить(ПутьФайла);
	
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
	исключение
		КритичОшибки.Добавить("Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки() );
	конецПопытки;
	Попытка
		Почта.Послать(Сообщение);
		//ЗаписатьВЛог("Отправка писем УПД Тандер","Письмо отправлено","Информация");   
	исключение
		
	конецПопытки;
	Почта.Отключиться();
	
КонецПроцедуры
//нечаева 17,02,20 ---


//нечаева 04,12,20+++
Процедура СообщитьМенеджеруОстаткиШК() Экспорт
	
	Если ПараметрыСеанса.Отладка Тогда
		Возврат;
	КонецЕсли;
	
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//
	//Катаев+ 28/06/13 Добавка для филиалов
	//Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
	//	Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//	Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Иначе
	//	Профиль.АдресСервераPOP3   = "87.236.190.180";
	//	Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//КонецЕсли;
	////Катаев- 28/06/13
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);		 
	// Кухарь А.Ю.  08.09.2022 конец
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	//---------------------------------------------------------------
	//Попытка
	//	ИмяФайлаПечати=ФормированиеПечати(ТЗПечать,ТЗШапка); //+++
	//Исключение
	//	КритичОшибки.Добавить("Не сформирован файл печати! "+Символ(13));
	//КонецПопытки;
	
	// и прикрепляем файл;
	
	
	
	////----------------------------------------------------------------
	Сообщение=новый интернетПочтовоеСообщение;
	//Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	Сообщение.Получатели.Добавить("emelyanova@collant.ru");
	Сообщение.Получатели.Добавить("chelnokova@collant.ru");
	Сообщение.Получатели.Добавить("elvira@collant.ru");
	
	Сообщение.Отправитель="ecode@collant.ru";
	
	Сообщение.Тема="Остатков ШК GS1 меньше 500!";
	Строка=Символ(13)+Символ(13)+"       Добрый день!"+Символ(13)+Символ(13);
	
	Для рр=0 по файлы.Количество()-1 Цикл
		Строка=Строка+символы.ПС+Файлы[рр];
	КонецЦикла;
	
	
	НомСтр=1;
	
	Строка=Строка+Символы.ПС;
	Если Ошибки.количество()>=1 Тогда
		Строка=Строка+Символы.ПС+"Заканчиваются остатки новых ШК GS1!!! Просьба завести дополнительные!!!";
	КонецЕсли;	
	Если НЕ Ошибки=Неопределено и ошибки.Количество()>0 Тогда
		Для рр=0 по ошибки.Количество()-1 Цикл
			Строка=Строка+Символы.ПС+НомСтр+". "+Ошибки[рр];
			Строка=Строка+Символы.ПС;
			НомСтр=НомСтр+1;
		КонецЦикла;
	конецЕсли;
	Строка=Строка+Символы.ПС+"________________________________________________________________";
	
	Сообщение.Тексты.Добавить(Строка);
	
	//Сообщение.Вложения.Добавить(ПутьФайла);
	
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
	исключение
		КритичОшибки.Добавить("Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки() );
	конецПопытки;
	Попытка
		Почта.Послать(Сообщение);
		//ЗаписатьВЛог("Отправка писем УПД Тандер","Письмо отправлено","Информация");   
	исключение
		
	конецПопытки;
	Почта.Отключиться();
	//УдалитьФайлы(ИмяФайлаПечати);     //+++
	
КонецПроцедуры
//нечаева 04,12,20 ---

//нечаева 05,04,22++
Процедура СообщитьМенеджеруГиперглобус() Экспорт
	
	//Если ПараметрыСеанса.Отладка Тогда
	//	Возврат;
	//КонецЕсли;
	//
		
	//	Менеджер=СтрШапка.контрагент.Менеджер;
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//
	//Катаев+ 28/06/13 Добавка для филиалов
	//Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
	//	Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//	Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Иначе
	//	Профиль.АдресСервераPOP3   = "87.236.190.180";
	//	Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//КонецЕсли;
	////Катаев- 28/06/13
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);		 
	// Кухарь А.Ю.  08.09.2022 конец
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	////----------------------------------------------------------------
	Сообщение=новый интернетПочтовоеСообщение;
	//Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	//Сообщение.Получатели.Добавить("nikolaev@collant.ru");
	Сообщение.Получатели.Добавить("pro@collant.ru");
	Сообщение.Получатели.Добавить("avanesova@collant.ru");
	Сообщение.Получатели.Добавить("anahteva@collant.ru");
		
	Сообщение.Отправитель="ecode@collant.ru";
	
	Сообщение.Тема="Просрочка отправки уведомлений Гипеглобус.";
	Строка=Символ(13)+Символ(13)+"       Добрый день!"+Символ(13)+Символ(13);
	
	//Для рр=0 по файлы.Количество()-1 Цикл
	//	Строка=Строка+символы.ПС+Файлы[рр];
	//КонецЦикла;
	
	
	НомСтр=1;
	
	Строка=Строка+Символы.ПС;
	//Если Ошибки.количество()>1 Тогда
		Строка=Строка+Символы.ПС+"Нет уведомлений об отгрузке в Ecod:";
	//КонецЕсли;	
	Если НЕ Ошибки=Неопределено и ошибки.Количество()>0 Тогда
		Для рр=0 по ошибки.Количество()-1 Цикл
			Строка=Строка+Символы.ПС+НомСтр+". "+Ошибки[рр];
			Строка=Строка+Символы.ПС;
			НомСтр=НомСтр+1;
		КонецЦикла;
	конецЕсли;
	Строка=Строка+Символы.ПС+"________________________________________________________________";
	
	Сообщение.Тексты.Добавить(Строка);
	
	//Сообщение.Вложения.Добавить(ПутьФайла);
	
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
	исключение
		КритичОшибки.Добавить("Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки() );
		//сообщить(ОписаниеОшибки());
	конецПопытки;
	Попытка
		Почта.Послать(Сообщение);
		//ЗаписатьВЛог("Проверка отправки УПД","Письмо отправлено","Информация");   
	исключение
		
	конецПопытки;
	Почта.Отключиться();
	//УдалитьФайлы(ИмяФайлаПечати);     //+++
	
КонецПроцедуры
//нечаева 05,04,22--


// нечаева 28,03,24++
//--------------------------------------------------------------

// бэст прайс.
Процедура СообщитьМенеджеруБэст(ТЕмаПИсьма) Экспорт
	
	Если ПараметрыСеанса.Отладка Тогда
		Возврат;
	КонецЕсли;
	
	
	//	Менеджер=СтрШапка.контрагент.Менеджер;
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);		 
	// Кухарь А.Ю.  08.09.2022 конец
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	////----------------------------------------------------------------
	Сообщение=новый интернетПочтовоеСообщение;
	//Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	Сообщение.Получатели.Добавить("ovlto@collant.ru");
	
	Сообщение.Отправитель="ecode@collant.ru";
	
	Сообщение.Тема = ТемаПисьма;
	Строка=Символ(13)+Символ(13)+"       Добрый день!"+Символ(13)+Символ(13);
	//
	//Для рр=0 по файлы.Количество()-1 Цикл
	//	Строка=Строка+символы.ПС+Файлы[рр];
	//КонецЦикла;
	
	
	НомСтр=1;
	
	Строка=Строка+Символы.ПС;
	Если СписокФиксПрайс.количество()>0 Тогда
		Строка=Строка+Символы.ПС+"Заведите водителей, необходима переотправка уведомлений об отгрузке:";
	КонецЕсли;	
	
	Если НЕ СписокФиксПрайс=Неопределено и СписокФиксПрайс.Количество()>0 Тогда
		Для рр=0 по СписокФиксПрайс.Количество()-1 Цикл
			Строка=Строка+Символы.ПС+НомСтр+". "+СписокФиксПрайс[рр];
			Строка=Строка+Символы.ПС;
			НомСтр=НомСтр+1;
		КонецЦикла;
	конецЕсли;
	Строка=Строка+Символы.ПС+"________________________________________________________________";
	
	Сообщение.Тексты.Добавить(Строка);
	
	//Сообщение.Вложения.Добавить(ПутьФайла);
	
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
	исключение
		КритичОшибки.Добавить("Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки() );
	конецПопытки;
	Попытка
		Почта.Послать(Сообщение);
		ЗаписатьВЛог("Отправка писем Бест Прайс","Письмо отправлено","Информация");   
	исключение
		
	конецПопытки;
	Почта.Отключиться();
	//УдалитьФайлы(ИмяФайлаПечати);     //+++
	
КонецПроцедуры

Процедура  ПроверитьФиксПрайс()
	
	Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("OD7") Тогда

	
	СписокФиксПрайс = новый Массив;
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РасходнаяНакладная.Ссылка КАК Ссылка,
	|	РасходнаяНакладная.Номер КАК Номер,
	|	РасходнаяНакладная.Дата КАК Дата,
	|	РасходнаяНакладная.ДатаОтгрузки КАК ДатаОтгрузки,
	|	РасходнаяНакладная.ДатаПриемки КАК ДатаПриемки,
	|	ВложенныйЗапрос.ЗначениеРеквизита КАК ФИоВодителя
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РеквизитыРНКПНКПРМ.ИмяРеквизита КАК ИмяРеквизита,
	|			РеквизитыРНКПНКПРМ.ЗначениеРеквизита КАК ЗначениеРеквизита,
	|			РеквизитыРНКПНКПРМ.Документ КАК Документ
	|		ИЗ
	|			РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
	|		ГДЕ
	|			РеквизитыРНКПНКПРМ.ИмяРеквизита = &ИмяВодителя) КАК ВложенныйЗапрос
	|		ПО РасходнаяНакладная.Ссылка = ВложенныйЗапрос.Документ
	|ГДЕ
	|	НачалоПериода(РасходнаяНакладная.ДатаПриемки,День) <= &ДатаПриемки
	|	И РасходнаяНакладная.СостояниеНакладной = &Отгружена
	|	И РасходнаяНакладная.Контрагент = &контрагент
	|	И НачалоПериода(РасходнаяНакладная.ДатаПриемки,день)>= &текущаяДата
	|	И РасходнаяНакладная.Дата > &ДатаРНК
	|	И РасходнаяНакладная.ПунктДоставки.ТипДоставки = &трансКомп
	|	И ВложенныйЗапрос.ЗначениеРеквизита ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ДатаПриемки",КонецДня(ТекущаяДата()+ 24*60*60));   // дата приемки завтра
	Запрос.УстановитьПараметр("ДатаРНК", НачалоДня(ТекущаяДата()- 30*24*60*60) );  // за 2 недели назад.
	Запрос.УстановитьПараметр("Отгружена",перечисления.СостоянияНакладной.Отгружена);
	Запрос.УстановитьПараметр("текущаяДата",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Контрагент",справочники.Контрагенты.НайтиПоКоду("SSR-6999"));
	Запрос.УстановитьПараметр("трансКомп",перечисления.ТипыДоставки.ТранспортнаяКомпания);
	Запрос.УстановитьПараметр("ИмяВодителя","ФиоВодителяСфера");

	
	Рез = запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() Цикл
		
	    СписокФиксПрайс.Добавить(Рез.ссылка);
	
	КонецЦикла;
	
	
	//------------------------------------------------------------------------------
	/// вторая часть, проверка, что все отправлено по УПД.
	// для фикс прайс 28,03,24 ++++   SSP-5862
	
		//выбираем тольто те, по которым не отправлен упд и состояния выписан упд <> пустому.
		запрос = Новый Запрос;
		Запрос.Текст= "ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка КАК Ссылка,
		|	РасходнаяНакладная.Дата КАК Дата,
		|	ВложенныйЗапрос.СостояниеУПД КАК СостояниеУПД
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СостояниеЭлектронногоУПД.СостояниеУПД КАК СостояниеУПД,
		|			СостояниеЭлектронногоУПД.Объект КАК Объект
		|		ИЗ
		|			РегистрСведений.СостояниеЭлектронногоУПД КАК СостояниеЭлектронногоУПД
		|		ГДЕ
		|			СостояниеЭлектронногоУПД.СостояниеУПД = &Выписан) КАК ВложенныйЗапрос
		|		ПО (РасходнаяНакладная.Ссылка = ВложенныйЗапрос.Объект)
		|ГДЕ
		|	РасходнаяНакладная.Контрагент = &Лента
		|	И РасходнаяНакладная.Проведен = ИСТИНА
		//|	И (РасходнаяНакладная.СостояниеНакладной = &Готова
		|			И РасходнаяНакладная.СостояниеНакладной = &Отгружена
		|	И РасходнаяНакладная.СуммаДокумента > 0
		|	И РасходнаяНакладная.Дата <= &Дата
		|	И РасходнаяНакладная.Дата >= &Дата1
		|	И ЕСТЬNULL(ВложенныйЗапрос.СостояниеУПД, 0) = 0";
		
		
		
		запрос.УстановитьПараметр("Лента",справочники.Контрагенты.НайтиПоКоду("SSR-6999"));	 //фикс прайс
		//запрос.УстановитьПараметр("Готова",перечисления.СостоянияНакладной.ГотоваКОтгрузке);
		запрос.УстановитьПараметр("Отгружена",перечисления.СостоянияНакладной.Отгружена);
		запрос.УстановитьПараметр("Дата",(ТекущаяДата() ));   // .
		запрос.УстановитьПараметр("Дата1", (ТекущаяДата() - 24*2*60*60));   // тек дата -2 дня назад.
		
		запрос.УстановитьПараметр("Выписан",перечисления.СостояниеУПД.ВыписанУПД);
		
		Рез = запрос.Выполнить().Выгрузить();
		
		Для каждого ТекСтрока из Рез Цикл
			
			ТекДок = Текстрока.ссылка;
			//отправляем письмо.
			Ошибки.Добавить("Для документа "+ТекДок.ссылка+" не выписан УПД");
			
		КонецЦикла;	
		
		// и проверим для не отгруженных еще. но уже готовых с сегодняшней датой отгрузки.
		Запрос = Новый Запрос;
		Запрос.текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданный.Номер КАК Номер,
		|	СчетФактураВыданный.Дата КАК Дата,
		|	СчетФактураВыданный.Контрагент КАК Контрагент,
		|	СчетФактураВыданный.Ссылка КАК Ссылка,
		|	СчетФактураВыданный.Всего КАК Сумма,
		|	ЛОЖЬ КАК Пометка,
		|	ВЫБОР
		|		КОГДА ПОДСТРОКА(СчетФактураНакладные.Накладная.ПунктДоставки.ПечГрузополучательСФ, 1, 1) = """"
		|			ТОГДА СчетФактураНакладные.Накладная.ПунктДоставки.ПочтовыйАдрес
		|		ИНАЧЕ СчетФактураНакладные.Накладная.ПунктДоставки.ПечГрузополучательСФ
		|	КОНЕЦ КАК АдресДоставки,
		|	СчетФактураНакладные.Накладная.ПунктДоставки КАК СсылкаАдреса,
		|	СчетФактураНакладные.Накладная.ДатаПриемки КАК ДатаАвизации,
		|	СчетФактураНакладные.Накладная.Номер КАК НомерРНК
		|ИЗ
		|	Документ.СчетФактура.Накладные КАК СчетФактураНакладные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактура КАК СчетФактураВыданный
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ЗначенияСвойствОбъектов.Объект.Номер КАК ОбъектНомер,
		|				ЗначенияСвойствОбъектов.Свойство КАК Свойство,
		|				ЗначенияСвойствОбъектов.Значение КАК Значение,
		|				ЗначенияСвойствОбъектов.Объект КАК Объект
		|			ИЗ
		|				РегистрСведений.ЗначенияСвойствОбъектовУПД КАК ЗначенияСвойствОбъектов
		|			ГДЕ
		|				ЗначенияСвойствОбъектов.Свойство = &ТекСвойство) КАК ВложенныйЗапрос
		|			ПО СчетФактураВыданный.Ссылка = ВложенныйЗапрос.Объект
		|		ПО СчетФактураНакладные.Ссылка = СчетФактураВыданный.Ссылка
		|ГДЕ
		|	СчетФактураВыданный.Организация = &ТекОрганизация
		|	И СчетФактураВыданный.Проведен = ИСТИНА
		|	И ВложенныйЗапрос.Значение ЕСТЬ NULL
		|	И СчетФактураВыданный.ПометкаУдаления = ЛОЖЬ
		|	И СчетФактураНакладные.Накладная.Проведен
		|	И СчетФактураНакладные.Накладная.ДатаОтгрузки МЕЖДУ &Дата1 И &Дата2
		|	И СчетФактураВыданный.Контрагент = &Лента";
		
				
		
		запрос.УстановитьПараметр("Лента",справочники.Контрагенты.НайтиПоКоду("SSR-6999"));	
		// дата отгрузки сегодня
		запрос.УстановитьПараметр("Дата1", НачалоДня(ТекущаяДата()));  
		запрос.УстановитьПараметр("Дата2", КонецДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("ТекОрганизация",справочники.Организации.НайтиПоКоду("SS-001"));
		Запрос.УстановитьПараметр("ТекСвойство",планыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("EDIНомер").Ссылка);
		
		Рез = запрос.Выполнить().Выгрузить();
		
		Для каждого ТекСтрока из Рез Цикл
			
			ТекДок = Текстрока.ссылка;
			//отправляем письмо.
			Ошибки.Добавить("Для документа "+ТекДок.ссылка+" не выписан УПД");
			
		КонецЦикла;	
	   	
	КонецЕсли;	
	
	Если Ошибки.Количество()>0 Тогда
		
		СообщитьМенеджеруОбщее();
		
	КонецЕсли;	
	

	Ошибки.Очистить();
	
	
	
КонецПроцедуры	

//--------------------------------------------------------------
// нечаева 28,03,24--

Процедура Сформировать(ТаблицаПараметров=НЕОПРЕДЕЛЕНО) Экспорт
	
	//+++
	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Кухарь А.Ю. 31.03.2026 начало
	// Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом тогда
	Если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() тогда
		//Кухарь А.Ю. 31.03.2026 конец        
		ЗаписатьВЛог("Регламент","Отмена выполнения. Задача отправка УПД Тандер: Отправка писем. Автообмен разрешен для базы: """+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
		Возврат;
	КонецЕсли;
	
	//	ЗаписатьВЛог("Отправка писем УПД Тандер","Начало выполнения.  !","Информация");  мусор не будем писать                     
	
	
	СписокФиксПрайс = новый Массив;
	СписокФиксПрайс.Очистить();
	//------------------------
	// нечаева 28,03,24+++ для фикс правйса проверка водителей
	ДатаНачалаЭДОФиксПрайс = справочники.Контрагенты.НайтиПоКоду("SSR-6999").ДатаНачалаЭСФ;
	Если ТекущаяДата()>= ДатаНачалаЭДОФиксПрайс Тогда
	     ПроверитьФиксПрайс();
		 Если СписокФиксПрайс.количество()>0 Тогда
			 СообщитьМенеджеруБэст("Отсутствуют данные по водителям. Бэст Прайс");
		 КонецЕсли;
	КонецЕсли;	

	// нечаева 28,03,24--
	//--------------------------
	Ошибки.Очистить();
	
	//Только для тандера	
	Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("OD7") Тогда
		запрос = Новый Запрос;
		Запрос.Текст= "ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка как ссылка,
		|	РасходнаяНакладная.Дата
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.Контрагент = &Лента
		|	И РасходнаяНакладная.Проведен = ИСТИНА
		|	И РасходнаяНакладная.СостояниеНакладной = &Готова
		|	И РасходнаяНакладная.СуммаДокумента > 0
		|	И РасходнаяНакладная.Дата <= &Дата
		|	И РасходнаяНакладная.Дата >= &Дата1
		|	И РасходнаяНакладная.ПунктДоставки.ФорматМагазина = &РЦ";
		
		запрос.УстановитьПараметр("Лента",справочники.Контрагенты.НайтиПоКоду("SSP-3881"));	
		запрос.УстановитьПараметр("Готова",перечисления.СостоянияНакладной.Отгружена);
		запрос.УстановитьПараметр("РЦ",справочники.ФорматыМагазина.НайтиПоКоду("000000036"));
		запрос.УстановитьПараметр("Дата",(ТекущаяДата() - 1*60*60));   // тек дата -2 часа.
		запрос.УстановитьПараметр("Дата1", (ТекущаяДата() - 24*2*60*60));   // тек дата -2 дня назад.
		
		Рез = запрос.Выполнить().Выгрузить();
		
		Для каждого ТекСтрока из Рез Цикл
			
			ТекДок = Текстрока.ссылка;
			// смотрим сколько сс кодов и паллет с сиси кодами, если не совпадает не отправляем.
			//проверим СИСИ кода
			//ДокОбъект=ТекДок.получитьОбъект();
			
			запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	СостояниеЭлектронногоУПД.Дата,
			|	СостояниеЭлектронногоУПД.Объект
			|ИЗ
			|	РегистрСведений.СостояниеЭлектронногоУПД КАК СостояниеЭлектронногоУПД
			|ГДЕ
			|	СостояниеЭлектронногоУПД.Объект = &ТекРНК
			|	И СостояниеЭлектронногоУПД.СостояниеУПД = &ВЫписан";
			запрос.УстановитьПараметр("ТекРНК",ТекДок.ссылка);
			запрос.УстановитьПараметр("Выписан",перечисления.СостояниеУПД.ВыписанУПД);
			Рез2 = Запрос.Выполнить().Выбрать();
			
			Если Рез2.Следующий() Тогда
				продолжить;
			Иначе
				//отправляем письмо.
				Ошибки.Добавить("Для документа "+ТекДок.ссылка+" не выписан УПД");
				
			КонецЕсли;	
			//нечаева 26,12,16++
			
		КонецЦикла;	
	КонецЕсли;		
	
	
	Если Ошибки.Количество()>0 Тогда
		
		СообщитьМенеджеру();
		
	КонецЕсли;	
	
	//нечаева 10,09,19 +++
	// для Ленты, если дата отгрузки с  23,09,19++ 
	Ошибки.Очистить();
	//Если ТекущаяДата()>=Дата(2019,09,17) Тогда	
	
	
	Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("OD7") Тогда
		//выбираем тольто те, по которым не отправлен упд и состояния выписан упд <> пустому.
		запрос = Новый Запрос;
		Запрос.Текст= "ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка КАК Ссылка,
		|	РасходнаяНакладная.Дата КАК Дата,
		|	ВложенныйЗапрос.СостояниеУПД КАК СостояниеУПД
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СостояниеЭлектронногоУПД.СостояниеУПД КАК СостояниеУПД,
		|			СостояниеЭлектронногоУПД.Объект КАК Объект
		|		ИЗ
		|			РегистрСведений.СостояниеЭлектронногоУПД КАК СостояниеЭлектронногоУПД
		|		ГДЕ
		|			СостояниеЭлектронногоУПД.СостояниеУПД = &Выписан) КАК ВложенныйЗапрос
		|		ПО (РасходнаяНакладная.Ссылка = ВложенныйЗапрос.Объект)
		|ГДЕ
		|	РасходнаяНакладная.Контрагент = &Лента
		|	И РасходнаяНакладная.Проведен = ИСТИНА
		//|	И (РасходнаяНакладная.СостояниеНакладной = &Готова
		|			И РасходнаяНакладная.СостояниеНакладной = &Отгружена
		|	И РасходнаяНакладная.СуммаДокумента > 0
		|	И РасходнаяНакладная.Дата <= &Дата
		|	И РасходнаяНакладная.Дата >= &Дата1
		|	И ЕСТЬNULL(ВложенныйЗапрос.СостояниеУПД, 0) = 0";
		
		
		
		запрос.УстановитьПараметр("Лента",справочники.Контрагенты.НайтиПоКоду("SSR-1593"));	
		//запрос.УстановитьПараметр("Готова",перечисления.СостоянияНакладной.ГотоваКОтгрузке);
		запрос.УстановитьПараметр("Отгружена",перечисления.СостоянияНакладной.Отгружена);
		запрос.УстановитьПараметр("Дата",(ТекущаяДата() ));   // .
		запрос.УстановитьПараметр("Дата1", (ТекущаяДата() - 24*2*60*60));   // тек дата -2 дня назад.
		
		запрос.УстановитьПараметр("Выписан",перечисления.СостояниеУПД.ВыписанУПД);
		
		Рез = запрос.Выполнить().Выгрузить();
		
		Для каждого ТекСтрока из Рез Цикл
			
			ТекДок = Текстрока.ссылка;
			//отправляем письмо.
			Ошибки.Добавить("Для документа "+ТекДок.ссылка+" не выписан УПД");
			
		КонецЦикла;	
		
		// и проверим для не отгруженных еще. но уже готовых с сегодняшней датой отгрузки.
		Запрос = Новый Запрос;
		Запрос.текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданный.Номер КАК Номер,
		|	СчетФактураВыданный.Дата КАК Дата,
		|	СчетФактураВыданный.Контрагент КАК Контрагент,
		|	СчетФактураВыданный.Ссылка КАК Ссылка,
		|	СчетФактураВыданный.Всего КАК Сумма,
		|	ЛОЖЬ КАК Пометка,
		|	ВЫБОР
		|		КОГДА ПОДСТРОКА(СчетФактураНакладные.Накладная.ПунктДоставки.ПечГрузополучательСФ, 1, 1) = """"
		|			ТОГДА СчетФактураНакладные.Накладная.ПунктДоставки.ПочтовыйАдрес
		|		ИНАЧЕ СчетФактураНакладные.Накладная.ПунктДоставки.ПечГрузополучательСФ
		|	КОНЕЦ КАК АдресДоставки,
		|	СчетФактураНакладные.Накладная.ПунктДоставки КАК СсылкаАдреса,
		|	СчетФактураНакладные.Накладная.ДатаПриемки КАК ДатаАвизации,
		|	СчетФактураНакладные.Накладная.Номер КАК НомерРНК
		|ИЗ
		|	Документ.СчетФактура.Накладные КАК СчетФактураНакладные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактура КАК СчетФактураВыданный
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ЗначенияСвойствОбъектов.Объект.Номер КАК ОбъектНомер,
		|				ЗначенияСвойствОбъектов.Свойство КАК Свойство,
		|				ЗначенияСвойствОбъектов.Значение КАК Значение,
		|				ЗначенияСвойствОбъектов.Объект КАК Объект
		|			ИЗ
		|				РегистрСведений.ЗначенияСвойствОбъектовУПД КАК ЗначенияСвойствОбъектов
		|			ГДЕ
		|				ЗначенияСвойствОбъектов.Свойство = &ТекСвойство) КАК ВложенныйЗапрос
		|			ПО СчетФактураВыданный.Ссылка = ВложенныйЗапрос.Объект
		|		ПО СчетФактураНакладные.Ссылка = СчетФактураВыданный.Ссылка
		|ГДЕ
		|	СчетФактураВыданный.Организация = &ТекОрганизация
		|	И СчетФактураВыданный.Проведен = ИСТИНА
		|	И ВложенныйЗапрос.Значение ЕСТЬ NULL
		|	И СчетФактураВыданный.ПометкаУдаления = ЛОЖЬ
		|	И СчетФактураНакладные.Накладная.Проведен
		|	И СчетФактураНакладные.Накладная.ДатаОтгрузки МЕЖДУ &Дата1 И &Дата2
		|	И СчетФактураВыданный.Контрагент = &Лента";
		
				
		
		запрос.УстановитьПараметр("Лента",справочники.Контрагенты.НайтиПоКоду("SSR-1593"));	
		// дата отгрузки сегодня
		запрос.УстановитьПараметр("Дата1", НачалоДня(ТекущаяДата()));  
		запрос.УстановитьПараметр("Дата2", КонецДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("ТекОрганизация",справочники.Организации.НайтиПоКоду("SS-001"));
		Запрос.УстановитьПараметр("ТекСвойство",планыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("EDIНомер").Ссылка);
		
		Рез = запрос.Выполнить().Выгрузить();
		
		Для каждого ТекСтрока из Рез Цикл
			
			ТекДок = Текстрока.ссылка;
			//отправляем письмо.
			Ошибки.Добавить("Для документа "+ТекДок.ссылка+" не выписан УПД");
			
		КонецЦикла;	
				
		
//	КонецЕсли;	
	
	КонецЕсли;		
	Если Ошибки.Количество()>0 Тогда
		
		СообщитьМенеджеруЛента();
		
	КонецЕсли;	
	
	ошибки.Очистить();
	
	
	// нечаева 17,02,20++++
	// для ламоды
		
	Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("OD7") Тогда
		//выбираем тольто те, по которым не отправлен упд и состояния выписан упд <> пустому.
		запрос = Новый Запрос;
		Запрос.Текст= "ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка КАК Ссылка,
		|	РасходнаяНакладная.Дата КАК Дата,
		|	ВложенныйЗапрос.СостояниеУПД КАК СостояниеУПД
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СостояниеЭлектронногоУПД.СостояниеУПД КАК СостояниеУПД,
		|			СостояниеЭлектронногоУПД.Объект КАК Объект
		|		ИЗ
		|			РегистрСведений.СостояниеЭлектронногоУПД КАК СостояниеЭлектронногоУПД
		|		ГДЕ
		|			СостояниеЭлектронногоУПД.СостояниеУПД = &Выписан) КАК ВложенныйЗапрос
		|		ПО (РасходнаяНакладная.Ссылка = ВложенныйЗапрос.Объект)
		|ГДЕ
		|	РасходнаяНакладная.Контрагент = &Лента
		|	И РасходнаяНакладная.Проведен = ИСТИНА
		//|	И (РасходнаяНакладная.СостояниеНакладной = &Готова
		|			И РасходнаяНакладная.СостояниеНакладной = &Отгружена
		|	И РасходнаяНакладная.СуммаДокумента > 0
		|	И РасходнаяНакладная.Дата <= &Дата
		|	И РасходнаяНакладная.Дата >= &Дата1
		|	И ЕСТЬNULL(ВложенныйЗапрос.СостояниеУПД, 0) = 0";
		
		
		
		запрос.УстановитьПараметр("Лента",справочники.Контрагенты.НайтиПоКоду("SSR-8987"));	
		//запрос.УстановитьПараметр("Готова",перечисления.СостоянияНакладной.ГотоваКОтгрузке);
		запрос.УстановитьПараметр("Отгружена",перечисления.СостоянияНакладной.Отгружена);
		запрос.УстановитьПараметр("Дата",(ТекущаяДата() ));   // .
		запрос.УстановитьПараметр("Дата1", (ТекущаяДата() - 24*2*60*60));   // тек дата -2 дня назад.
		
		запрос.УстановитьПараметр("Выписан",перечисления.СостояниеУПД.ВыписанУПД);
		
		Рез = запрос.Выполнить().Выгрузить();
		
		Для каждого ТекСтрока из Рез Цикл
			
			ТекДок = Текстрока.ссылка;
			//отправляем письмо.
			Ошибки.Добавить("Для документа "+ТекДок.ссылка+" не выписан УПД");
			
		КонецЦикла;	
		
		// и проверим для не отгруженных еще. но уже готовых с сегодняшней датой отгрузки.
		Запрос = Новый Запрос;
		Запрос.текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданный.Номер КАК Номер,
		|	СчетФактураВыданный.Дата КАК Дата,
		|	СчетФактураВыданный.Контрагент КАК Контрагент,
		|	СчетФактураВыданный.Ссылка КАК Ссылка,
		|	СчетФактураВыданный.Всего КАК Сумма,
		|	ЛОЖЬ КАК Пометка,
		|	ВЫБОР
		|		КОГДА ПОДСТРОКА(СчетФактураНакладные.Накладная.ПунктДоставки.ПечГрузополучательСФ, 1, 1) = """"
		|			ТОГДА СчетФактураНакладные.Накладная.ПунктДоставки.ПочтовыйАдрес
		|		ИНАЧЕ СчетФактураНакладные.Накладная.ПунктДоставки.ПечГрузополучательСФ
		|	КОНЕЦ КАК АдресДоставки,
		|	СчетФактураНакладные.Накладная.ПунктДоставки КАК СсылкаАдреса,
		|	СчетФактураНакладные.Накладная.ДатаПриемки КАК ДатаАвизации,
		|	СчетФактураНакладные.Накладная.Номер КАК НомерРНК
		|ИЗ
		|	Документ.СчетФактура.Накладные КАК СчетФактураНакладные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактура КАК СчетФактураВыданный
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ЗначенияСвойствОбъектов.Объект.Номер КАК ОбъектНомер,
		|				ЗначенияСвойствОбъектов.Свойство КАК Свойство,
		|				ЗначенияСвойствОбъектов.Значение КАК Значение,
		|				ЗначенияСвойствОбъектов.Объект КАК Объект
		|			ИЗ
		|				РегистрСведений.ЗначенияСвойствОбъектовУПД КАК ЗначенияСвойствОбъектов
		|			ГДЕ
		|				ЗначенияСвойствОбъектов.Свойство = &ТекСвойство) КАК ВложенныйЗапрос
		|			ПО СчетФактураВыданный.Ссылка = ВложенныйЗапрос.Объект
		|		ПО СчетФактураНакладные.Ссылка = СчетФактураВыданный.Ссылка
		|ГДЕ
		|	СчетФактураВыданный.Организация = &ТекОрганизация
		|	И СчетФактураВыданный.Проведен = ИСТИНА
		|	И ВложенныйЗапрос.Значение ЕСТЬ NULL
		|	И СчетФактураВыданный.ПометкаУдаления = ЛОЖЬ
		|	И СчетФактураНакладные.Накладная.Проведен
		|	И СчетФактураНакладные.Накладная.ДатаОтгрузки МЕЖДУ &Дата1 И &Дата2
		|	И СчетФактураВыданный.Контрагент = &Лента";
		
				
		
		запрос.УстановитьПараметр("Лента",справочники.Контрагенты.НайтиПоКоду("SSR-8987"));	
		// дата отгрузки сегодня
		запрос.УстановитьПараметр("Дата1", НачалоДня(ТекущаяДата()));  
		запрос.УстановитьПараметр("Дата2", КонецДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("ТекОрганизация",справочники.Организации.НайтиПоКоду("SS-001"));
		Запрос.УстановитьПараметр("ТекСвойство",планыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("EDIНомер").Ссылка);
		
		Рез = запрос.Выполнить().Выгрузить();
		
		Для каждого ТекСтрока из Рез Цикл
			
			ТекДок = Текстрока.ссылка;
			//отправляем письмо.
			Ошибки.Добавить("Для документа "+ТекДок.ссылка+" не выписан УПД");
			
		КонецЦикла;	

	
	
	КонецЕсли;		
	Если Ошибки.Количество()>0 Тогда
		
		СообщитьМенеджеруОбщее();
		
	КонецЕсли;	
	

	Ошибки.Очистить();
	
	// нечаева 17,02,20----
	
	// нечаева 21,01,23++++
	// для золотое яблоко
	
	Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("OD7") Тогда
		//выбираем тольто те, по которым не отправлен упд и состояния выписан упд <> пустому.
		запрос = Новый Запрос;
		Запрос.Текст= "ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка КАК Ссылка,
		|	РасходнаяНакладная.Дата КАК Дата,
		|	ВложенныйЗапрос.СостояниеУПД КАК СостояниеУПД
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СостояниеЭлектронногоУПД.СостояниеУПД КАК СостояниеУПД,
		|			СостояниеЭлектронногоУПД.Объект КАК Объект
		|		ИЗ
		|			РегистрСведений.СостояниеЭлектронногоУПД КАК СостояниеЭлектронногоУПД
		|		ГДЕ
		|			СостояниеЭлектронногоУПД.СостояниеУПД = &Выписан) КАК ВложенныйЗапрос
		|		ПО (РасходнаяНакладная.Ссылка = ВложенныйЗапрос.Объект)
		|ГДЕ
		|	РасходнаяНакладная.Контрагент = &Лента
		|	И РасходнаяНакладная.Проведен = ИСТИНА
		//|	И (РасходнаяНакладная.СостояниеНакладной = &Готова
		|			И РасходнаяНакладная.СостояниеНакладной = &Отгружена
		|	И РасходнаяНакладная.СуммаДокумента > 0
		|	И РасходнаяНакладная.Дата <= &Дата
		|	И РасходнаяНакладная.Дата >= &Дата1
		|	И ЕСТЬNULL(ВложенныйЗапрос.СостояниеУПД, 0) = 0";
		
		
		
		запрос.УстановитьПараметр("Лента",справочники.Контрагенты.НайтиПоКоду("EKF-0301"));	
		//запрос.УстановитьПараметр("Готова",перечисления.СостоянияНакладной.ГотоваКОтгрузке);
		запрос.УстановитьПараметр("Отгружена",перечисления.СостоянияНакладной.Отгружена);
		запрос.УстановитьПараметр("Дата",(ТекущаяДата() ));   // .
		запрос.УстановитьПараметр("Дата1", (ТекущаяДата() - 24*2*60*60));   // тек дата -2 дня назад.
		
		запрос.УстановитьПараметр("Выписан",перечисления.СостояниеУПД.ВыписанУПД);
		
		Рез = запрос.Выполнить().Выгрузить();
		
		Для каждого ТекСтрока из Рез Цикл
			
			ТекДок = Текстрока.ссылка;
			//отправляем письмо.
			Ошибки.Добавить("Для документа "+ТекДок.ссылка+" не выписан УПД");
			
		КонецЦикла;	
		
		// и проверим для не отгруженных еще. но уже готовых с сегодняшней датой отгрузки.
		Запрос = Новый Запрос;
		Запрос.текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданный.Номер КАК Номер,
		|	СчетФактураВыданный.Дата КАК Дата,
		|	СчетФактураВыданный.Контрагент КАК Контрагент,
		|	СчетФактураВыданный.Ссылка КАК Ссылка,
		|	СчетФактураВыданный.Всего КАК Сумма,
		|	ЛОЖЬ КАК Пометка,
		|	ВЫБОР
		|		КОГДА ПОДСТРОКА(СчетФактураНакладные.Накладная.ПунктДоставки.ПечГрузополучательСФ, 1, 1) = """"
		|			ТОГДА СчетФактураНакладные.Накладная.ПунктДоставки.ПочтовыйАдрес
		|		ИНАЧЕ СчетФактураНакладные.Накладная.ПунктДоставки.ПечГрузополучательСФ
		|	КОНЕЦ КАК АдресДоставки,
		|	СчетФактураНакладные.Накладная.ПунктДоставки КАК СсылкаАдреса,
		|	СчетФактураНакладные.Накладная.ДатаПриемки КАК ДатаАвизации,
		|	СчетФактураНакладные.Накладная.Номер КАК НомерРНК
		|ИЗ
		|	Документ.СчетФактура.Накладные КАК СчетФактураНакладные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактура КАК СчетФактураВыданный
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ЗначенияСвойствОбъектов.Объект.Номер КАК ОбъектНомер,
		|				ЗначенияСвойствОбъектов.Свойство КАК Свойство,
		|				ЗначенияСвойствОбъектов.Значение КАК Значение,
		|				ЗначенияСвойствОбъектов.Объект КАК Объект
		|			ИЗ
		|				РегистрСведений.ЗначенияСвойствОбъектовУПД КАК ЗначенияСвойствОбъектов
		|			ГДЕ
		|				ЗначенияСвойствОбъектов.Свойство = &ТекСвойство) КАК ВложенныйЗапрос
		|			ПО СчетФактураВыданный.Ссылка = ВложенныйЗапрос.Объект
		|		ПО СчетФактураНакладные.Ссылка = СчетФактураВыданный.Ссылка
		|ГДЕ
		|	СчетФактураВыданный.Организация = &ТекОрганизация
		|	И СчетФактураВыданный.Проведен = ИСТИНА
		|	И ВложенныйЗапрос.Значение ЕСТЬ NULL
		|	И СчетФактураВыданный.ПометкаУдаления = ЛОЖЬ
		|	И СчетФактураНакладные.Накладная.Проведен
		|	И СчетФактураНакладные.Накладная.ДатаОтгрузки МЕЖДУ &Дата1 И &Дата2
		|	И СчетФактураВыданный.Контрагент = &Лента";
		
				
		
		запрос.УстановитьПараметр("Лента",справочники.Контрагенты.НайтиПоКоду("EKF-0301"));	
		// дата отгрузки сегодня
		запрос.УстановитьПараметр("Дата1", НачалоДня(ТекущаяДата()));  
		запрос.УстановитьПараметр("Дата2", КонецДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("ТекОрганизация",справочники.Организации.НайтиПоКоду("SS-001"));
		Запрос.УстановитьПараметр("ТекСвойство",планыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("EDIНомер").Ссылка);
		
		Рез = запрос.Выполнить().Выгрузить();
		
		Для каждого ТекСтрока из Рез Цикл
			
			ТекДок = Текстрока.ссылка;
			//отправляем письмо.
			Ошибки.Добавить("Для документа "+ТекДок.ссылка+" не выписан УПД");
			
		КонецЦикла;	

	
	
	КонецЕсли;		
	Если Ошибки.Количество()>0 Тогда
		
		СообщитьМенеджеруОбщее();
		
	КонецЕсли;	
	

	Ошибки.Очистить();
	
	// нечаева 17,02,20----
	////////////////////////////////////////////////////////////////
	
	// для окей 08,06,23++++   SSP-5862
	Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("OD7") Тогда
		//выбираем тольто те, по которым не отправлен упд и состояния выписан упд <> пустому.
		запрос = Новый Запрос;
		Запрос.Текст= "ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка КАК Ссылка,
		|	РасходнаяНакладная.Дата КАК Дата,
		|	ВложенныйЗапрос.СостояниеУПД КАК СостояниеУПД
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СостояниеЭлектронногоУПД.СостояниеУПД КАК СостояниеУПД,
		|			СостояниеЭлектронногоУПД.Объект КАК Объект
		|		ИЗ
		|			РегистрСведений.СостояниеЭлектронногоУПД КАК СостояниеЭлектронногоУПД
		|		ГДЕ
		|			СостояниеЭлектронногоУПД.СостояниеУПД = &Выписан) КАК ВложенныйЗапрос
		|		ПО (РасходнаяНакладная.Ссылка = ВложенныйЗапрос.Объект)
		|ГДЕ
		|	РасходнаяНакладная.Контрагент = &Лента
		|	И РасходнаяНакладная.Проведен = ИСТИНА
		//|	И (РасходнаяНакладная.СостояниеНакладной = &Готова
		|			И РасходнаяНакладная.СостояниеНакладной = &Отгружена
		|	И РасходнаяНакладная.СуммаДокумента > 0
		|	И РасходнаяНакладная.Дата <= &Дата
		|	И РасходнаяНакладная.Дата >= &Дата1
		|	И ЕСТЬNULL(ВложенныйЗапрос.СостояниеУПД, 0) = 0";
		
		
		
		запрос.УстановитьПараметр("Лента",справочники.Контрагенты.НайтиПоКоду("SSP-5862"));	 //окей
		//запрос.УстановитьПараметр("Готова",перечисления.СостоянияНакладной.ГотоваКОтгрузке);
		запрос.УстановитьПараметр("Отгружена",перечисления.СостоянияНакладной.Отгружена);
		запрос.УстановитьПараметр("Дата",(ТекущаяДата() ));   // .
		запрос.УстановитьПараметр("Дата1", (ТекущаяДата() - 24*2*60*60));   // тек дата -2 дня назад.
		
		запрос.УстановитьПараметр("Выписан",перечисления.СостояниеУПД.ВыписанУПД);
		
		Рез = запрос.Выполнить().Выгрузить();
		
		Для каждого ТекСтрока из Рез Цикл
			
			ТекДок = Текстрока.ссылка;
			//отправляем письмо.
			Ошибки.Добавить("Для документа "+ТекДок.ссылка+" не выписан УПД");
			
		КонецЦикла;	
		
		// и проверим для не отгруженных еще. но уже готовых с сегодняшней датой отгрузки.
		Запрос = Новый Запрос;
		Запрос.текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданный.Номер КАК Номер,
		|	СчетФактураВыданный.Дата КАК Дата,
		|	СчетФактураВыданный.Контрагент КАК Контрагент,
		|	СчетФактураВыданный.Ссылка КАК Ссылка,
		|	СчетФактураВыданный.Всего КАК Сумма,
		|	ЛОЖЬ КАК Пометка,
		|	ВЫБОР
		|		КОГДА ПОДСТРОКА(СчетФактураНакладные.Накладная.ПунктДоставки.ПечГрузополучательСФ, 1, 1) = """"
		|			ТОГДА СчетФактураНакладные.Накладная.ПунктДоставки.ПочтовыйАдрес
		|		ИНАЧЕ СчетФактураНакладные.Накладная.ПунктДоставки.ПечГрузополучательСФ
		|	КОНЕЦ КАК АдресДоставки,
		|	СчетФактураНакладные.Накладная.ПунктДоставки КАК СсылкаАдреса,
		|	СчетФактураНакладные.Накладная.ДатаПриемки КАК ДатаАвизации,
		|	СчетФактураНакладные.Накладная.Номер КАК НомерРНК
		|ИЗ
		|	Документ.СчетФактура.Накладные КАК СчетФактураНакладные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактура КАК СчетФактураВыданный
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ЗначенияСвойствОбъектов.Объект.Номер КАК ОбъектНомер,
		|				ЗначенияСвойствОбъектов.Свойство КАК Свойство,
		|				ЗначенияСвойствОбъектов.Значение КАК Значение,
		|				ЗначенияСвойствОбъектов.Объект КАК Объект
		|			ИЗ
		|				РегистрСведений.ЗначенияСвойствОбъектовУПД КАК ЗначенияСвойствОбъектов
		|			ГДЕ
		|				ЗначенияСвойствОбъектов.Свойство = &ТекСвойство) КАК ВложенныйЗапрос
		|			ПО СчетФактураВыданный.Ссылка = ВложенныйЗапрос.Объект
		|		ПО СчетФактураНакладные.Ссылка = СчетФактураВыданный.Ссылка
		|ГДЕ
		|	СчетФактураВыданный.Организация = &ТекОрганизация
		|	И СчетФактураВыданный.Проведен = ИСТИНА
		|	И ВложенныйЗапрос.Значение ЕСТЬ NULL
		|	И СчетФактураВыданный.ПометкаУдаления = ЛОЖЬ
		|	И СчетФактураНакладные.Накладная.Проведен
		|	И СчетФактураНакладные.Накладная.ДатаОтгрузки МЕЖДУ &Дата1 И &Дата2
		|	И СчетФактураВыданный.Контрагент = &Лента";
		
				
		
		запрос.УстановитьПараметр("Лента",справочники.Контрагенты.НайтиПоКоду("SSP-5862"));	
		// дата отгрузки сегодня
		запрос.УстановитьПараметр("Дата1", НачалоДня(ТекущаяДата()));  
		запрос.УстановитьПараметр("Дата2", КонецДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("ТекОрганизация",справочники.Организации.НайтиПоКоду("SS-001"));
		Запрос.УстановитьПараметр("ТекСвойство",планыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("EDIНомер").Ссылка);
		
		Рез = запрос.Выполнить().Выгрузить();
		
		Для каждого ТекСтрока из Рез Цикл
			
			ТекДок = Текстрока.ссылка;
			//отправляем письмо.
			Ошибки.Добавить("Для документа "+ТекДок.ссылка+" не выписан УПД");
			
		КонецЦикла;	

	
	
	КонецЕсли;		
	Если Ошибки.Количество()>0 Тогда
		
		СообщитьМенеджеруОбщее();
		
	КонецЕсли;	
	

	Ошибки.Очистить();
	
	
	// нечаева 08,06,23----

	
	//04,12,20++++ нечаева
	Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
		//выбираем тольто те, по которым не отправлен упд и состояния выписан упд <> пустому.
		запрос = Новый Запрос;
		Запрос.Текст= "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РезервированиеШКGS1.GS1 КАК GS1,
		|	1 КАК количество
		|ИЗ
		|	РегистрСведений.РезервированиеШКGS1 КАК РезервированиеШКGS1
		|ГДЕ
		|	РезервированиеШКGS1.ДокументУстановки = &пусто
		|	И РезервированиеШКGS1.Присвоен = ЛОЖЬ
		|ИТОГИ
		|	СУММА(количество)
		|ПО
		|	ОБЩИЕ,
		|	GS1";
				
		запрос.УстановитьПараметр("пусто",документы.УстановкаШКGS1.ПустаяСсылка());	
		
		Рез = запрос.Выполнить().Выбрать(); //ОбходРезультатаЗапроса.ПоГруппировкам;
		Если РЕз.Следующий() Тогда
			
			ТекКол = рез.Количество();
			Если ТекКол<=500 Тогда
				//отправляем письмо.
				Ошибки.Добавить("Не хватает ШК");
			КонецЕсли;
			
		КонецЕсли;	
		
		Если Ошибки.Количество()>0 Тогда
			
			СообщитьМенеджеруОстаткиШК();
			
		КонецЕсли;
		
	конецЕсли;
	//04,12,20 ---- нечаева

	Ошибки.Очистить();

	//--------------------------------------------------------
	// по гиперглобусу
	
	Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
		//выбираем тольто те, по которым не отправлен упд и состояния выписан упд <> пустому.
		запрос = Новый Запрос;
		Запрос.Текст= "ВЫБРАТЬ РАЗЛИЧНЫЕ
		              |	РасходнаяНакладная.Ссылка КАК Ссылка
		              |ИЗ
		              |	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		              |ГДЕ
		              |	РасходнаяНакладная.Контрагент = &теконтр
		              |	И РасходнаяНакладная.Дата > &датаначалапроверки
		              |	И РасходнаяНакладная.ДатаОтгрузки >= &датаотгрузки
		              |	И РасходнаяНакладная.СостояниеНакладной в иерархии(&готовакотгрузке)
		              |	И РасходнаяНакладная.Проведен = ИСТИНА
		              |	И РасходнаяНакладная.ПереданПокупателюВЭлВиде = ложь";
		
		запрос.УстановитьПараметр("ДатаОтгрузки",НачалоДня(ТекущаяДата())-24*60*60);	
		запрос.УстановитьПараметр("теконтр",Справочники.Контрагенты.НайтиПоКоду("SSP-3180"));
		
		массивс = новый массив;
		массивс.Добавить(перечисления.СостоянияНакладной.ГотоваКОтгрузке);
		массивс.Добавить(перечисления.СостоянияНакладной.Отгружена);
		
		запрос.УстановитьПараметр("готоваКотгрузке",массивс);	
		запрос.УстановитьПараметр("датаначалаПроверки",ТекущаяДата()-24*60*60*12);	
		
		
		Рез = запрос.Выполнить().Выбрать(); //ОбходРезультатаЗапроса.ПоГруппировкам;
		ТекКол = РЕз.Количество() ;
		Пока Рез.Следующий() Цикл
			//отправляем письмо.
			Ошибки.Добавить(""+рез.ссылка);
		КонецЦикла;
		
		
		Если Ошибки.Количество()>0 Тогда
			
			СообщитьМенеджеругиперглобус();
			
		КонецЕсли;
		
	конецЕсли;

	Ошибки.Очистить();
	//нечаева 05,04,22
	
	
	
	//---------------------------------------------------------------------------
	// нечаева 05,09,23---
	// для УПД для Гиперглобус	
	
	Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("OD7")и ТекущаяДата()>= Дата(2023,09,12) Тогда
		//выбираем тольто те, по которым не отправлен упд и состояния выписан упд <> пустому.
		запрос = Новый Запрос;
		Запрос.Текст= "ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка КАК Ссылка,
		|	РасходнаяНакладная.Дата КАК Дата,
		|	ВложенныйЗапрос.СостояниеУПД КАК СостояниеУПД
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СостояниеЭлектронногоУПД.СостояниеУПД КАК СостояниеУПД,
		|			СостояниеЭлектронногоУПД.Объект КАК Объект
		|		ИЗ
		|			РегистрСведений.СостояниеЭлектронногоУПД КАК СостояниеЭлектронногоУПД
		|		ГДЕ
		|			СостояниеЭлектронногоУПД.СостояниеУПД = &Выписан) КАК ВложенныйЗапрос
		|		ПО (РасходнаяНакладная.Ссылка = ВложенныйЗапрос.Объект)
		|ГДЕ
		|	РасходнаяНакладная.Контрагент = &Лента
		|	И РасходнаяНакладная.Проведен = ИСТИНА
		//|	И (РасходнаяНакладная.СостояниеНакладной = &Готова
		|			И РасходнаяНакладная.СостояниеНакладной = &Отгружена
		|	И РасходнаяНакладная.СуммаДокумента > 0
		|	И РасходнаяНакладная.Дата <= &Дата
		|	И РасходнаяНакладная.Дата >= &Дата1
		|	И ЕСТЬNULL(ВложенныйЗапрос.СостояниеУПД, 0) = 0";
		
		
		
		запрос.УстановитьПараметр("Лента",справочники.Контрагенты.НайтиПоКоду("SSP-3180"));	
		//запрос.УстановитьПараметр("Готова",перечисления.СостоянияНакладной.ГотоваКОтгрузке);
		запрос.УстановитьПараметр("Отгружена",перечисления.СостоянияНакладной.Отгружена);
		запрос.УстановитьПараметр("Дата",(ТекущаяДата() ));   // .
		запрос.УстановитьПараметр("Дата1", (ТекущаяДата() - 24*2*60*60));   // тек дата -2 дня назад.
		
		запрос.УстановитьПараметр("Выписан",перечисления.СостояниеУПД.ВыписанУПД);
		
		Рез = запрос.Выполнить().Выгрузить();
		
		Для каждого ТекСтрока из Рез Цикл
			
			ТекДок = Текстрока.ссылка;
			//отправляем письмо.
			Ошибки.Добавить("Для документа "+ТекДок.ссылка+" не выписан УПД"+ТекДок.контрагент);
			
		КонецЦикла;	
		
		// и проверим для не отгруженных еще. но уже готовых с сегодняшней датой отгрузки.
		Запрос = Новый Запрос;
		Запрос.текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданный.Номер КАК Номер,
		|	СчетФактураВыданный.Дата КАК Дата,
		|	СчетФактураВыданный.Контрагент КАК Контрагент,
		|	СчетФактураВыданный.Ссылка КАК Ссылка,
		|	СчетФактураВыданный.Всего КАК Сумма,
		|	ЛОЖЬ КАК Пометка,
		|	ВЫБОР
		|		КОГДА ПОДСТРОКА(СчетФактураНакладные.Накладная.ПунктДоставки.ПечГрузополучательСФ, 1, 1) = """"
		|			ТОГДА СчетФактураНакладные.Накладная.ПунктДоставки.ПочтовыйАдрес
		|		ИНАЧЕ СчетФактураНакладные.Накладная.ПунктДоставки.ПечГрузополучательСФ
		|	КОНЕЦ КАК АдресДоставки,
		|	СчетФактураНакладные.Накладная.ПунктДоставки КАК СсылкаАдреса,
		|	СчетФактураНакладные.Накладная.ДатаПриемки КАК ДатаАвизации,
		|	СчетФактураНакладные.Накладная.Номер КАК НомерРНК
		|ИЗ
		|	Документ.СчетФактура.Накладные КАК СчетФактураНакладные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактура КАК СчетФактураВыданный
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ЗначенияСвойствОбъектов.Объект.Номер КАК ОбъектНомер,
		|				ЗначенияСвойствОбъектов.Свойство КАК Свойство,
		|				ЗначенияСвойствОбъектов.Значение КАК Значение,
		|				ЗначенияСвойствОбъектов.Объект КАК Объект
		|			ИЗ
		|				РегистрСведений.ЗначенияСвойствОбъектовУПД КАК ЗначенияСвойствОбъектов
		|			ГДЕ
		|				ЗначенияСвойствОбъектов.Свойство = &ТекСвойство) КАК ВложенныйЗапрос
		|			ПО СчетФактураВыданный.Ссылка = ВложенныйЗапрос.Объект
		|		ПО СчетФактураНакладные.Ссылка = СчетФактураВыданный.Ссылка
		|ГДЕ
		|	СчетФактураВыданный.Организация = &ТекОрганизация
		|	И СчетФактураВыданный.Проведен = ИСТИНА
		|	И ВложенныйЗапрос.Значение ЕСТЬ NULL
		|	И СчетФактураВыданный.ПометкаУдаления = ЛОЖЬ
		|	И СчетФактураНакладные.Накладная.Проведен
		|	И СчетФактураНакладные.Накладная.ДатаОтгрузки МЕЖДУ &Дата1 И &Дата2
		|	И СчетФактураВыданный.Контрагент = &Лента";
		
				
		
		запрос.УстановитьПараметр("Лента",справочники.Контрагенты.НайтиПоКоду("SSP-3180"));	
		// дата отгрузки сегодня
		запрос.УстановитьПараметр("Дата1", НачалоДня(ТекущаяДата()));  
		запрос.УстановитьПараметр("Дата2", КонецДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("ТекОрганизация",справочники.Организации.НайтиПоКоду("SS-001"));
		Запрос.УстановитьПараметр("ТекСвойство",планыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("EDIНомер").Ссылка);
		
		Рез = запрос.Выполнить().Выгрузить();
		
		Для каждого ТекСтрока из Рез Цикл
			
			ТекДок = Текстрока.ссылка;
			//отправляем письмо.
			Ошибки.Добавить("Для документа "+ТекДок.ссылка+" не выписан УПД" +ТекДок.контрагент);
			
		КонецЦикла;	

	
	
	КонецЕсли;		
	Если Ошибки.Количество()>0 Тогда
		
		СообщитьМенеджеруОбщее(); // там одно и тоже по письму
		
	КонецЕсли;	
	

	Ошибки.Очистить();
	// нечаева 05,09,23 ---

	
	//---------------------------------------------------------------------------
	// нечаева 12,09,23 ++++
	// для УПД для т и к продукты.	
	
	Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("OD7")и ТекущаяДата()>= Дата(2023,09,12) Тогда
		//выбираем тольто те, по которым не отправлен упд и состояния выписан упд <> пустому.
		запрос = Новый Запрос;
		Запрос.Текст= "ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка КАК Ссылка,
		|	РасходнаяНакладная.Дата КАК Дата,
		|	ВложенныйЗапрос.СостояниеУПД КАК СостояниеУПД
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СостояниеЭлектронногоУПД.СостояниеУПД КАК СостояниеУПД,
		|			СостояниеЭлектронногоУПД.Объект КАК Объект
		|		ИЗ
		|			РегистрСведений.СостояниеЭлектронногоУПД КАК СостояниеЭлектронногоУПД
		|		ГДЕ
		|			СостояниеЭлектронногоУПД.СостояниеУПД = &Выписан) КАК ВложенныйЗапрос
		|		ПО (РасходнаяНакладная.Ссылка = ВложенныйЗапрос.Объект)
		|ГДЕ
		|	РасходнаяНакладная.Контрагент = &Лента
		|	И РасходнаяНакладная.Проведен = ИСТИНА
		//|	И (РасходнаяНакладная.СостояниеНакладной = &Готова
		|			И РасходнаяНакладная.СостояниеНакладной = &Отгружена
		|	И РасходнаяНакладная.СуммаДокумента > 0
		|	И РасходнаяНакладная.Дата <= &Дата
		|	И РасходнаяНакладная.Дата >= &Дата1
		|	И ЕСТЬNULL(ВложенныйЗапрос.СостояниеУПД, 0) = 0";
		
		
		
		запрос.УстановитьПараметр("Лента",справочники.Контрагенты.НайтиПоКоду("SSR-1678"));	
		//запрос.УстановитьПараметр("Готова",перечисления.СостоянияНакладной.ГотоваКОтгрузке);
		запрос.УстановитьПараметр("Отгружена",перечисления.СостоянияНакладной.Отгружена);
		запрос.УстановитьПараметр("Дата",(ТекущаяДата() ));   // .
		запрос.УстановитьПараметр("Дата1", (ТекущаяДата() - 24*2*60*60));   // тек дата -2 дня назад.
		
		запрос.УстановитьПараметр("Выписан",перечисления.СостояниеУПД.ВыписанУПД);
		
		Рез = запрос.Выполнить().Выгрузить();
		
		Для каждого ТекСтрока из Рез Цикл
			
			ТекДок = Текстрока.ссылка;
			//отправляем письмо.
			Ошибки.Добавить("Для документа "+ТекДок.ссылка+" не выписан УПД"+ТекДок.контрагент);
			
		КонецЦикла;	
		
		// и проверим для не отгруженных еще. но уже готовых с сегодняшней датой отгрузки.
		Запрос = Новый Запрос;
		Запрос.текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданный.Номер КАК Номер,
		|	СчетФактураВыданный.Дата КАК Дата,
		|	СчетФактураВыданный.Контрагент КАК Контрагент,
		|	СчетФактураВыданный.Ссылка КАК Ссылка,
		|	СчетФактураВыданный.Всего КАК Сумма,
		|	ЛОЖЬ КАК Пометка,
		|	ВЫБОР
		|		КОГДА ПОДСТРОКА(СчетФактураНакладные.Накладная.ПунктДоставки.ПечГрузополучательСФ, 1, 1) = """"
		|			ТОГДА СчетФактураНакладные.Накладная.ПунктДоставки.ПочтовыйАдрес
		|		ИНАЧЕ СчетФактураНакладные.Накладная.ПунктДоставки.ПечГрузополучательСФ
		|	КОНЕЦ КАК АдресДоставки,
		|	СчетФактураНакладные.Накладная.ПунктДоставки КАК СсылкаАдреса,
		|	СчетФактураНакладные.Накладная.ДатаПриемки КАК ДатаАвизации,
		|	СчетФактураНакладные.Накладная.Номер КАК НомерРНК
		|ИЗ
		|	Документ.СчетФактура.Накладные КАК СчетФактураНакладные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактура КАК СчетФактураВыданный
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ЗначенияСвойствОбъектов.Объект.Номер КАК ОбъектНомер,
		|				ЗначенияСвойствОбъектов.Свойство КАК Свойство,
		|				ЗначенияСвойствОбъектов.Значение КАК Значение,
		|				ЗначенияСвойствОбъектов.Объект КАК Объект
		|			ИЗ
		|				РегистрСведений.ЗначенияСвойствОбъектовУПД КАК ЗначенияСвойствОбъектов
		|			ГДЕ
		|				ЗначенияСвойствОбъектов.Свойство = &ТекСвойство) КАК ВложенныйЗапрос
		|			ПО СчетФактураВыданный.Ссылка = ВложенныйЗапрос.Объект
		|		ПО СчетФактураНакладные.Ссылка = СчетФактураВыданный.Ссылка
		|ГДЕ
		|	СчетФактураВыданный.Организация = &ТекОрганизация
		|	И СчетФактураВыданный.Проведен = ИСТИНА
		|	И ВложенныйЗапрос.Значение ЕСТЬ NULL
		|	И СчетФактураВыданный.ПометкаУдаления = ЛОЖЬ
		|	И СчетФактураНакладные.Накладная.Проведен
		|	И СчетФактураНакладные.Накладная.ДатаОтгрузки МЕЖДУ &Дата1 И &Дата2
		|	И СчетФактураВыданный.Контрагент = &Лента";
		
				
		
		запрос.УстановитьПараметр("Лента",справочники.Контрагенты.НайтиПоКоду("SSR-1678"));	
		// дата отгрузки сегодня
		запрос.УстановитьПараметр("Дата1", НачалоДня(ТекущаяДата()));  
		запрос.УстановитьПараметр("Дата2", КонецДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("ТекОрганизация",справочники.Организации.НайтиПоКоду("SS-001"));
		Запрос.УстановитьПараметр("ТекСвойство",планыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("EDIНомер").Ссылка);
		
		Рез = запрос.Выполнить().Выгрузить();
		
		Для каждого ТекСтрока из Рез Цикл
			
			ТекДок = Текстрока.ссылка;
			//отправляем письмо.
			Ошибки.Добавить("Для документа "+ТекДок.ссылка+" не выписан УПД" +ТекДок.контрагент);
			
		КонецЦикла;	

	
	
	КонецЕсли;		
	Если Ошибки.Количество()>0 Тогда
		
		СообщитьМенеджеруОбщее(); // там одно и тоже по письму
		
	КонецЕсли;	
	
	Ошибки.Очистить();      
	
	
	//---------------------------------------------------------------------------
	// нечаева 12,02,26 --- HELP-7489
	// для УПД для Командор
	Контрагент = справочники.Контрагенты.НайтиПоКоду("KRF-0349"); //Командор
	ПроверитьОтправкуУПД(Контрагент);
	// нечаева 12,02,26 --- HELP-7489
     	
	
КонецПроцедуры	

// нечаева 12,02,26 +++  HELP-7489
Процедура ПроверитьОтправкуУПД(Контаргент)

      	
	Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("OD7")и ТекущаяДата()>= Дата(2023,09,12) Тогда
		//выбираем тольто те, по которым не отправлен упд и состояния выписан упд <> пустому.
		запрос = Новый Запрос;
		Запрос.Текст= "ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка КАК Ссылка,
		|	РасходнаяНакладная.Дата КАК Дата,
		|	ВложенныйЗапрос.СостояниеУПД КАК СостояниеУПД
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СостояниеЭлектронногоУПД.СостояниеУПД КАК СостояниеУПД,
		|			СостояниеЭлектронногоУПД.Объект КАК Объект
		|		ИЗ
		|			РегистрСведений.СостояниеЭлектронногоУПД КАК СостояниеЭлектронногоУПД
		|		ГДЕ
		|			СостояниеЭлектронногоУПД.СостояниеУПД = &Выписан) КАК ВложенныйЗапрос
		|		ПО (РасходнаяНакладная.Ссылка = ВложенныйЗапрос.Объект)
		|ГДЕ
		|	РасходнаяНакладная.Контрагент = &ТекКонтрагент
		|	И РасходнаяНакладная.Проведен = ИСТИНА
		|			И РасходнаяНакладная.СостояниеНакладной = &Отгружена
		|	И РасходнаяНакладная.СуммаДокумента > 0
		|	И РасходнаяНакладная.Дата <= &Дата
		|	И РасходнаяНакладная.Дата >= &Дата1
		|	И ЕСТЬNULL(ВложенныйЗапрос.СостояниеУПД, 0) = 0";
		
		
		
		запрос.УстановитьПараметр("ТекКонтрагент",Контрагент);	
		запрос.УстановитьПараметр("Отгружена",перечисления.СостоянияНакладной.Отгружена);
		запрос.УстановитьПараметр("Дата",(ТекущаяДата() ));   // .
		запрос.УстановитьПараметр("Дата1", (ТекущаяДата() - 2*14*60*60));   // тек дата -2 дня назад.
		
		запрос.УстановитьПараметр("Выписан",перечисления.СостояниеУПД.ВыписанУПД);
		
		Рез = запрос.Выполнить().Выгрузить();
		
		Для каждого ТекСтрока из Рез Цикл
			
			ТекДок = Текстрока.ссылка;
			//отправляем письмо.
			Ошибки.Добавить("Для документа "+ТекДок.ссылка+" не выписан УПД "+ТекДок.контрагент);
			
		КонецЦикла;	
		
		// и проверим для не отгруженных еще. но уже готовых с сегодняшней датой отгрузки.
		Запрос = Новый Запрос;
		Запрос.текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданный.Номер КАК Номер,
		|	СчетФактураВыданный.Дата КАК Дата,
		|	СчетФактураВыданный.Контрагент КАК Контрагент,
		|	СчетФактураВыданный.Ссылка КАК Ссылка,
		|	СчетФактураВыданный.Всего КАК Сумма,
		|	ЛОЖЬ КАК Пометка,
		|	ВЫБОР
		|		КОГДА ПОДСТРОКА(СчетФактураНакладные.Накладная.ПунктДоставки.ПечГрузополучательСФ, 1, 1) = """"
		|			ТОГДА СчетФактураНакладные.Накладная.ПунктДоставки.ПочтовыйАдрес
		|		ИНАЧЕ СчетФактураНакладные.Накладная.ПунктДоставки.ПечГрузополучательСФ
		|	КОНЕЦ КАК АдресДоставки,
		|	СчетФактураНакладные.Накладная.ПунктДоставки КАК СсылкаАдреса,
		|	СчетФактураНакладные.Накладная.ДатаПриемки КАК ДатаАвизации,
		|	СчетФактураНакладные.Накладная.Номер КАК НомерРНК
		|ИЗ
		|	Документ.СчетФактура.Накладные КАК СчетФактураНакладные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактура КАК СчетФактураВыданный
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ЗначенияСвойствОбъектов.Объект.Номер КАК ОбъектНомер,
		|				ЗначенияСвойствОбъектов.Свойство КАК Свойство,
		|				ЗначенияСвойствОбъектов.Значение КАК Значение,
		|				ЗначенияСвойствОбъектов.Объект КАК Объект
		|			ИЗ
		|				РегистрСведений.ЗначенияСвойствОбъектовУПД КАК ЗначенияСвойствОбъектов
		|			ГДЕ
		|				ЗначенияСвойствОбъектов.Свойство = &ТекСвойство) КАК ВложенныйЗапрос
		|			ПО СчетФактураВыданный.Ссылка = ВложенныйЗапрос.Объект
		|		ПО СчетФактураНакладные.Ссылка = СчетФактураВыданный.Ссылка
		|ГДЕ
		|	СчетФактураВыданный.Организация = &ТекОрганизация
		|	И СчетФактураВыданный.Проведен = ИСТИНА
		|	И ВложенныйЗапрос.Значение ЕСТЬ NULL
		|	И СчетФактураВыданный.ПометкаУдаления = ЛОЖЬ
		|	И СчетФактураНакладные.Накладная.Проведен
		|	И СчетФактураНакладные.Накладная.ДатаОтгрузки МЕЖДУ &Дата1 И &Дата2
		|	И СчетФактураВыданный.Контрагент = &ТекКонтрагент";
		
				
		
		запрос.УстановитьПараметр("ТекКонтрагент",контрагент);	
		// дата отгрузки сегодня
		запрос.УстановитьПараметр("Дата1", НачалоДня(ТекущаяДата()));  
		запрос.УстановитьПараметр("Дата2", КонецДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("ТекОрганизация",справочники.Организации.НайтиПоКоду("SS-001"));
		Запрос.УстановитьПараметр("ТекСвойство",планыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("EDIНомер").Ссылка);
		
		Рез = запрос.Выполнить().Выгрузить();
		
		Для каждого ТекСтрока из Рез Цикл
			
			ТекДок = Текстрока.ссылка;
			//отправляем письмо.
			Ошибки.Добавить("Для документа "+ТекДок.ссылка+" не выписан УПД" +ТекДок.контрагент);
			
		КонецЦикла;	
   	
	КонецЕсли;		
	Если Ошибки.Количество()>0 Тогда
		
		СообщитьМенеджеруОбщее(); // там одно и тоже по письму
		
	КонецЕсли;	

	Ошибки.Очистить();
   	
КонецПроцедуры

// нечаева 12,02,26 --- HELP-7489



КодМетро	="SSP-8643";
КритичОшибки= Новый массив;

//нечаева 11,04,17+++
КритичОшибкиЛента = Новый массив; // для отправки многопаллетных документов
//нечаева 11,04,17---


Ошибки=Новый Массив;
Файлы=Новый Массив;

ПризнакЗаписиДокумента=Истина;

ТЗПечать=Новый ТаблицаЗначений;
ТЗПечать.Колонки.Добавить("НомерСтроки",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("Найдена",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("ТипШк",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("Штрихкод",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("Название",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("КодПокуп",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("КодПрод",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("Колво",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("КолвоОтредактированное",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
ТЗПечать.Колонки.Добавить("Единица",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("КолУпак");
ТЗПечать.Колонки.Добавить("ВУпак");
ТЗПечать.Колонки.Добавить("Тип",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("ВозврУпак",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("ПромоЦена",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("ЦенаБезНДС",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("СуммаБезНДС",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("Склад",Новый ОписаниеТипов("СправочникСсылка.Склады"));
ТЗПечать.Колонки.Добавить("ПризнакГруппыНом",Новый ОписаниеТипов("Число"));

//нечаева для метро  17,08,16 +++
ТЗПечать.Колонки.Добавить("ТипШКМетро",Новый ОписаниеТипов("ПеречислениеСсылка.ТипыШтрихКодов"));//блочок или штука, если блочок разворачиваем в штуки
//нечаева для метро  17,08,16 ---




ТЗШапка=Новый ТаблицаЗначений;
ТЗШапка.Колонки.Добавить("НомЗаказа");
ТЗШапка.Колонки.Добавить("ДатаЗаказа");
ТЗШапка.Колонки.Добавить("ДатаДоставки");
//нечаева 27,11,17++ 
ТЗШапка.Колонки.Добавить("ВремяДоставки");
//нечаева 27,11,17--

ТЗШапка.Колонки.Добавить("ТипЗаказа");
ТЗШапка.Колонки.Добавить("КодВалюты");
ТЗШапка.Колонки.Добавить("ИЛНПокупателя");
ТЗШапка.Колонки.Добавить("НазваниеПокупателя");
ТЗШапка.Колонки.Добавить("ИЛНПлательщика");
ТЗШапка.Колонки.Добавить("НазваниеПлательщика");
ТЗШапка.Колонки.Добавить("ИЛНМестаДоставки");
ТЗШапка.Колонки.Добавить("НазваниеМестаДоставки");
ТЗШапка.Колонки.Добавить("АдресМестаДоставки");
ТЗШапка.Колонки.Добавить("ОбщСумма");
ТЗШапка.Колонки.Добавить("ОбщКолУпак");
ТЗШапка.Колонки.Добавить("ОбщКол");
ТЗШапка.Колонки.Добавить("КолСтрок");
ТЗШапка.Колонки.Добавить("Контрагент");
ТЗШапка.Колонки.Добавить("ТипILNКонтрагента");
ТЗШапка.Колонки.Добавить("ПунктДоставки");
ТЗШапка.Колонки.Добавить("ДатаОтгрузки");
ТЗШапка.Колонки.Добавить("Менеджер");
ТЗШапка.Колонки.Добавить("Организация");
ТЗШапка.Колонки.Добавить("КодДоговора");
//Катаев+ 31/10/13 GLN конечного пункта (для Ленты)
ТЗШапка.Колонки.Добавить("ГЛН_Конечный");
//Катаев- 31/10/13
//Катаев+ 01/12/14 Для Молнии
ТЗШапка.Колонки.Добавить("НомерЗаявкиМолния");
//Катаев- 01/12/14

//нечаева для метро  17,08,16 +++
ТЗШапка.Колонки.Добавить("ТипШК");//блочок или штука, если блочок разворачиваем в штуки

//нечаева для метро 30,10,17 +++
ТЗПечать.Колонки.Добавить("Артикул",Новый ОписаниеТипов("Строка"));//блочок или штука, если блочок разворачиваем в штуки
//нечаева для метро  30,10,17 ---




Ашан=0;

// Катаев+ 11/03/13
// Табллицы для Акта
АктШапка = Новый ТаблицаЗначений;
АктШапка.Колонки.Добавить("РНК");
АктШапка.Колонки.Добавить("НомерРНК");
АктШапка.Колонки.Добавить("ДатаРНК");
АктШапка.Колонки.Добавить("Контрагент");
АктШапка.Колонки.Добавить("НомерЗаказа");
АктШапка.Колонки.Добавить("ДатаЗаказа");
АктШапка.Колонки.Добавить("ПунктДоставки");
АктШапка.Колонки.Добавить("ДатаПриемаТовара");
АктШапка.Колонки.Добавить("СостоянияРКМ");
АктШапка.Колонки.Добавить("СостояниеДокумента");
//Катаев+ 20/11/14
АктШапка.Колонки.Добавить("НомерАкта");
//Катаев- 20/11/14

АктТаблица = Новый таблицаЗначений;
АктТаблица.Колонки.Добавить("Номенклатура");
АктТаблица.Колонки.Добавить("ШК");
АктТаблица.Колонки.Добавить("Артикул");
АктТаблица.Колонки.Добавить("Заказано");
АктТаблица.Колонки.Добавить("Отправлено");
АктТаблица.Колонки.Добавить("Принято");
АктТаблица.Колонки.Добавить("Склад");
// Катаев- 11/03/13

// Катаев+ 25/03/13
АктТаблица.Колонки.Добавить("Товар");
// катаев- 25/03/13

//нечаева для метро  17,08,16 +++
АктТаблица.Колонки.Добавить("ТипШК");//блочок или штука, если блочок разворачиваем в штуки
//нечаева для метро  17,08,16 ---



//нечаева 19,03,15+++
ОшибкиАртикул=Новый Массив;
//нечаева 19,03,15---
