
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	запрос=новый запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	РаспределениеАвтомобилей.Ссылка
	             |ИЗ
	             |	Документ.РаспределениеАвтомобилей КАК РаспределениеАвтомобилей
	             |ГДЕ
	             |	(НЕ РаспределениеАвтомобилей.ПометкаУдаления)
	             |	И РаспределениеАвтомобилей.Ссылка <> &Ссылка
	             |	И РаспределениеАвтомобилей.ТипДоставки = &ТипДоставки";
				 
				 Запрос.УстановитьПараметр("Ссылка",ссылка);
				 Запрос.УстановитьПараметр("ТипДоставки",ТипДоставки);
				 
	Выб=запрос.Выполнить().Выбрать();
	Если Выб.Количество()>0 тогда
		#ЕСЛИ КЛИЕНТ ТОГДА
		Предупреждение("Уже есть документы распределения!с типом доставки="+ТипДоставки+" (Не помеченный на удаление документ может быть только один!)");
		#КОНЕЦЕСЛИ
		
		Отказ=ИСТИНА;
	Конецесли;	
		
КонецПроцедуры
