// Валюта регламентированного учета организаций
Перем мВалютаРегламентированногоУчета Экспорт;

// фискальный регистратор
Перем млФР                     Экспорт;

// сканер штрих кодов
Перем млСШК                    Экспорт;

// ридер магнитных карт
Перем млРМК                    Экспорт;

// ККМ On-Line
Перем млККМOnLine              Экспорт;
Перем млЧековыйБуферККМOnLine  Экспорт;

// ККМ Off-Line
Перем млККМOffLine             Экспорт;

// электронные весы
Перем млВесы                   Экспорт;

// дисплей покупателя
Перем млДП                     Экспорт;
Перем млДПРежим                Экспорт;

// терминал сбора данных
Перем млТерминал               Экспорт;

#Если Клиент Тогда

//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ РАБОТЫ С ФИСКАЛЬНЫМ РЕГИСТРАТОРОМ

// Процедура осуществляет подключение ФР.
//
// Параметры
//  Модель                       - <СправочникСсылка.ТорговоеОборудование>
//                               - Модель подключаемого ФР.
//
//  НомерЛУ                      - <Число>
//                               - Номер логического устройства.
//
//  ДляПриемаНаличныхОтЮрЛиц     - <Булево>
//                               - Данный ФР подключен в режиме отражения
//                                 наличных расчетов с индивидуальными
//                                 покупателями.
//
//  КассаККМ                     - <СправочникСсылка.КассыККМ>
//                               - Касса, с которой связан данный ФР.
//
Функция ПодключитьФР(Модель, НомерЛУ, ДляПриемаНаличныхОтЮрЛиц, КассаККМ, ВсеПараметры) Экспорт

	Если Модель.ДрайверОборудования.Пустая() Тогда
		Объект    = Неопределено;
		Ответ     = "";	
		
		Параметры = Новый Структура();
		
		Параметры.Вставить("Модель",  		Модель);
		Параметры.Вставить("НомерЛУ", 		НомерЛУ);
		
		Если ТипЗнч(ВсеПараметры)=Тип("Структура") Тогда
			ДобавитьПараметры(Параметры,ВсеПараметры);		
		КонецЕсли;	
		
		Параметры.Вставить("Пароль",  ПолучитьЗначениеПоУмолчанию("ПарольАдминистратораФискальногоРегистратора"));

		Если ЗначениеНеЗаполнено(Модель.ОбработкаОбслуживания) Тогда
			Сообщить("Ошибка при подключении фискального регистратора """
			         + Модель.Наименование
			         + """: не задана обработка обслуживания.",
			         СтатусСообщения.Важное);
			Возврат Перечисления.ТООшибкиОбщие.ОшибкаНеизвестно;
		КонецЕсли;

		Форма = ПолучитьФормуОбработки(Модель.ОбработкаОбслуживания);
		Форма.ВыполнитьОперацию("Подключить", Параметры, Ответ);
		
		Если ПустаяСтрока(Ответ) Тогда
			Параметры.Свойство("Объект", Объект);
			
			ФР                          = млФР.Добавить();
			ФР.Объект                   = Объект;
			ФР.Модель                   = Модель;
			ФР.НомерЛУ                  = НомерЛУ;
			ФР.КассаККМ                 = КассаККМ;
			ФР.ДляПриемаНаличныхОтЮрЛиц = ДляПриемаНаличныхОтЮрЛиц;
			
		Иначе
			Сообщить("Ошибка при подключении фискального регистратора """
			         + Модель.Наименование
			         + """: "
			         + Ответ,
			         СтатусСообщения.Важное);
			Возврат Перечисления.ТООшибкиОбщие.ОшибкаПриПодключении;
		КонецЕсли;

		Возврат Перечисления.ТООшибкиОбщие.ПустаяСсылка();		
	Иначе //Подключение 2024 
		
		рПодключения = МенеджерОборудованияКлиент.ПроверитьПодключитьОборудование(Модель);		
		
		Если рПодключения.Успешно Тогда		
			ФР                          = млФР.Добавить();
			//ФР.Объект                   = Объект;
			ФР.Модель                   = Модель;
			//ФР.НомерЛУ                  = НомерЛУ;
			ФР.КассаККМ                 = рПодключения.КассаККМ;
			ФР.ДляПриемаНаличныхОтЮрЛиц = ДляПриемаНаличныхОтЮрЛиц;
			
			ПараметрыСеанса.КассаККМ	= ФР.КассаККМ;
			
			Возврат Перечисления.ТООшибкиОбщие.ПустаяСсылка();			
		Иначе
			Сообщить("Ошибка при подключении фискального регистратора """
			         + Модель.Наименование
			         + """: "
			         + рПодключения.Ошибки,
			         СтатусСообщения.Важное);
			Возврат Перечисления.ТООшибкиОбщие.ОшибкаПриПодключении;								
		КонецЕсли; 	
	КонецЕсли; 
	
	
КонецФункции // ПодключитьФР()

// Процедура осуществляет отключение ФР.
//
// Параметры
//  ФР - <СтрокаТаблицыЗначений>
//     - Строка таблицы подключенных ФР (млФР), соответствующая отключаемому ФР.
//
Процедура ОтключитьФР(ФР)

	Если ЗначениеНеЗаполнено(ФР) Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеНеЗаполнено(ФР.Модель.ОбработкаОбслуживания) Тогда
		Сообщить("Ошибка при отключении фискального регистратора """
		         + ФР.Модель.Наименование
		         + """: не задана обработка обслуживания.",
		         СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;

	Ответ     = "";
	Форма     = ПолучитьФормуОбработки(ФР.Модель.ОбработкаОбслуживания);
	Параметры = Новый Структура();
	Параметры.Вставить("Объект",  ФР.Объект);
	Параметры.Вставить("НомерЛУ", ФР.НомерЛУ);

	Форма.ВыполнитьОперацию("Отключить", Параметры, Ответ);
	Если ПустаяСтрока(Ответ) Тогда
		млФР.Удалить(ФР);
	Иначе
		Сообщить("Ошибка при отключении фискального регистратора """
		         + ФР.Модель.Наименование
		         + """: "
		         + Ответ,
		         СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;

КонецПроцедуры // ОтключитьФР()

// Функция осуществляет аннулирование чека на ФР.
//
// Параметры
//  ФР                - <СтрокаТаблицыЗначений>
//                    - Строка таблицы подключенных ФР (млФР), соответствующая ФР,
//                      открытый чек которого необходимо аннулировать.
//
//  Ответ             - <Строка>
//                    - Описание произошедшей в ходе выполнения операции ошибки,
//                      или пустая строка в случае успешного завершения.
//
//  ВыводитьСообщение - <Булево>
//                    - Необязательный параметр; указывает на необходимость
//                      выводить информацию об ошибке.
//
Процедура АннулироватьЧек(ФР, Ответ, ВыводитьСообщение = Истина) Экспорт

	Ответ = "";

	Если ЗначениеНеЗаполнено(ФР) Тогда
		Ответ = "Ошибка при попытке аннулировать чек: фискальный регистратор не подключен.";
	ИначеЕсли ЗначениеНеЗаполнено(ФР.Модель.ОбработкаОбслуживания) Тогда
		Ответ = "Ошибка при попытке аннулирования чека на фискальном регистраторе """
		         + ФР.Модель.Наименование
		         + """: не задана обработка обслуживания.";
	//крохин начало 09.08.2019
	//аннулировать чеки для юр.лиц можно
	//ИначеЕсли ФР.ДляПриемаНаличныхОтЮрЛиц Тогда
	//	Ответ = "Ошибка при попытке аннулирования чека на фискальном регистраторе """
	//	        + ФР.Модель.Наименование
	//	        + """: фискальный регистратор предназначен для отражения наличных денежных расчетов.";
	//крохин конец 09.08.2019			
	Иначе
		Пароль = ПараметрыСеанса.ПарольКассираФискальногоРегистратора;		
		Если ЗначениеНеЗаполнено(Пароль) Тогда
			Ответ = "Ошибка при попытке аннулирования чека на фискальном регистраторе """
		        + ФР.Модель.Наименование
		        + """: в настройках пользователя не указан пароль фискального регистратора.";
		Иначе
			Форма     = ПолучитьФормуОбработки(ФР.Модель.ОбработкаОбслуживания);
			Параметры = Новый Структура();
			Параметры.Вставить("Объект",  ФР.Объект);
			Параметры.Вставить("НомерЛУ", ФР.НомерЛУ);
			Параметры.Вставить("Пароль",  Пароль);
			Форма.ВыполнитьОперацию("АннулироватьЧек", Параметры, Ответ);
			Если Не ПустаяСтрока(Ответ) Тогда
				Ответ = "Ошибка при попытке аннулирования чека на фискальном регистраторе """
				        + ФР.Модель.Наименование
				        + """: " + Ответ;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если Не ПустаяСтрока(Ответ) И ВыводитьСообщение Тогда
		Сообщить(Ответ, СтатусСообщения.Важное);
	КонецЕсли;

КонецПроцедуры // АннулироватьЧек()

// Процедура осуществляет печать строки чека ФР.
//
// Параметры
//  ФР                - <СтрокаТаблицыЗначений>
//                    - Строка таблицы подключенных ФР (млФР), соответствующая ФР,
//                      строку чека которого необходимо напечатать.
//
//  Параметры         - <Структура>
//                    - Структура параметров операции.
//                       Входные параметры:
//                         Наименование    - <Строка>
//                                         - Наименование товара.
//                         Количество      - <Число>
//                                         - Количество товара.
//                         Цена            - <Число>
//                                         - Цена товара.
//                         Скидка          - <Число>
//                                         - Скидка в процентах.
//                         Секция,         - <Число>
//                                         - Номер секции.
//                         ПризнакВозврата - <Булево>
//                                         - Признак возврата товара.
//                        Выходные параметры:
//                         НомерЧека       - <Число>
//                                         - Номер текущего чека.
//                         НомерСмены      - <Число>
//                                         - Номер текущей смены.
//
//  Ответ             - <Строка>
//                    - Описание произошедшей в ходе выполнения операции ошибки,
//                      или пустая строка в случае успешного завершения.
//
Процедура ПечататьСтрокуЧека(ФР, Параметры, Ответ) Экспорт

	Ответ = "";

	Если ЗначениеНеЗаполнено(ФР) Тогда
		Ответ = "Ошибка при попытке печати строки чека: фискальный регистратор не подключен.";
	ИначеЕсли ЗначениеНеЗаполнено(ФР.Модель.ОбработкаОбслуживания) Тогда
		Ответ = "Ошибка при попытке печати строки чека на фискальном регистраторе """
		         + ФР.Модель.Наименование
		         + """: не задана обработка обслуживания.";
	ИначеЕсли ФР.ДляПриемаНаличныхОтЮрЛиц Тогда
		Ответ = "Ошибка при попытке печати строки чека на фискальном регистраторе """
		        + ФР.Модель.Наименование
		        + """: фискальный регистратор предназначен для отражения наличных денежных расчетов.";
	ИначеЕсли ПустаяСтрока(Параметры.Наименование) Тогда
		Ответ = "Ошибка при попытке печати строки чека на фискальном регистраторе """
		        + ФР.Модель.Наименование
		        + """: не задана номенклатура.";
	ИначеЕсли Параметры.Цена = 0 Тогда
		Ответ = "Ошибка при попытке печати строки чека на фискальном регистраторе """
		        + ФР.Модель.Наименование
		        + """: не указана цена товара.";
	ИначеЕсли Параметры.Количество = 0 Тогда
		Ответ = "Ошибка при попытке печати строки чека на фискальном регистраторе """
		        + ФР.Модель.Наименование
		        + """: не указано количество товара.";
	Иначе
		Пароль = ПолучитьЗначениеПоУмолчанию("ПарольКассираФискальногоРегистратора");
		Если ЗначениеНеЗаполнено(Пароль) Тогда
			Пароль = ПолучитьЗначениеПоУмолчанию("ПарольАдминистратораФискальногоРегистратора");
		КонецЕсли;
		Если ЗначениеНеЗаполнено(Пароль) Тогда
			Ответ = "Ошибка при попытке печати строки чека на фискальном регистраторе """
		        + ФР.Модель.Наименование
		        + """: в настройках пользователя не указан пароль фискального регистратора.";
		Иначе
			Форма     = ПолучитьФормуОбработки(ФР.Модель.ОбработкаОбслуживания);
			Параметры.Вставить("Объект",  ФР.Объект);
			Параметры.Вставить("НомерЛУ", ФР.НомерЛУ);
			Параметры.Вставить("Пароль",  Пароль);
			Форма.ВыполнитьОперацию("ПечататьСтрокуЧека", Параметры, Ответ);
			Если Не ПустаяСтрока(Ответ) Тогда
				Ответ = "Ошибка при попытке печати строки чека на фискальном регистраторе """
				        + ФР.Модель.Наименование
				        + """: " + Ответ;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПечататьСтрокуЧека()

// Процедура осуществляет закрытие чека ФР.
//
// Параметры
//  ФР                - <СтрокаТаблицыЗначений>
//                    - Строка таблицы подключенных ФР (млФР), соответствующая ФР,
//                      открытый чек который необходимо закрыть.
//
//  Параметры         - <Структура>
//                    - Структура параметров операции.
//                       Входные параметры:
//                        СуммаНал    - <Число>
//                                    - Сумма, полученная от покупателя, наличными.
//                        СуммаБезНал - <Число>
//                                    - Сумма, полученная от покупателя, безналичными.
//                       Выходные параметры:
//                        НомерЧека   - <Число>
//                                    - Номер текущего чека.
//                        НомерСмены  - <Число>
//                                    - Номер текущей смены.
//
//  Ответ             - <Строка>
//                    - Описание произошедшей в ходе выполнения операции ошибки,
//                      или пустая строка в случае успешного завершения.
//
Процедура ЗакрытьЧек(ФР, Параметры, Ответ) Экспорт

	Ответ = "";

	Если ЗначениеНеЗаполнено(ФР) Тогда
		Ответ = "Ошибка при попытке закрытия чека: фискальный регистратор не подключен.";
	ИначеЕсли ЗначениеНеЗаполнено(ФР.Модель.ОбработкаОбслуживания) Тогда
		Ответ = "Ошибка при попытке закрытия чека на фискальном регистраторе """
		         + ФР.Модель.Наименование
		         + """: не задана обработка обслуживания.";
	ИначеЕсли ФР.ДляПриемаНаличныхОтЮрЛиц Тогда
		Ответ = "Ошибка при попытке закрытия чека на фискальном регистраторе """
		        + ФР.Модель.Наименование
		        + """: фискальный регистратор предназначен для отражения наличных денежных расчетов.";
	Иначе
		Пароль = ПолучитьЗначениеПоУмолчанию("ПарольКассираФискальногоРегистратора");
		Если ЗначениеНеЗаполнено(Пароль) Тогда
			Пароль = ПолучитьЗначениеПоУмолчанию("ПарольАдминистратораФискальногоРегистратора");
		КонецЕсли;
		Если ЗначениеНеЗаполнено(Пароль) Тогда
			Ответ = "Ошибка при попытке закрытия чека на фискальном регистраторе """
		        + ФР.Модель.Наименование
		        + """: в настройках пользователя не указан пароль фискального регистратора.";
		Иначе
			Форма     = ПолучитьФормуОбработки(ФР.Модель.ОбработкаОбслуживания);
			Параметры.Вставить("Объект",  ФР.Объект);
			Параметры.Вставить("НомерЛУ", ФР.НомерЛУ);
			Параметры.Вставить("Пароль",  Пароль);
			Форма.ВыполнитьОперацию("ЗакрытьЧек", Параметры, Ответ);
			Если Не ПустаяСтрока(Ответ) Тогда
				Ответ = "Ошибка при попытке закрытия чека на фискальном регистраторе """
				        + ФР.Модель.Наименование
				        + """: " + Ответ;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ЗакрытьЧек()

// Процедура осуществляет получение номера нового чека и смены на ФР.
//
// Параметры
//  ФР                - <СтрокаТаблицыЗначений>
//                    - Строка таблицы подключенных ФР (млФР), соответствующая ФР,
//                      номер чека и смены которого необходимо получить.
//
//  Параметры         - <Структура>
//                    - Структура параметров операции.
//                       Выходные параметры:
//                        НомерЧека   - <Число>
//                                    - Номер текущего чека.
//                        НомерСмены  - <Число>
//                                    - Номер текущей смены.
//
//  Ответ             - <Строка>
//                    - Описание произошедшей в ходе выполнения операции ошибки,
//                      или пустая строка в случае успешного завершения.
//
Процедура ПолучитьНомерЧекаСмены(ФР, Параметры, Ответ) Экспорт

	Ответ = "";

	Если ЗначениеНеЗаполнено(ФР) Тогда
		Ответ = "Ошибка при попытке получения номера чека: фискальный регистратор не подключен.";
	ИначеЕсли ЗначениеНеЗаполнено(ФР.Модель.ОбработкаОбслуживания) Тогда
		Ответ = "Ошибка при попытке получения номера чека на фискальном регистраторе """
		         + ФР.Модель.Наименование
		         + """: не задана обработка обслуживания.";
	ИначеЕсли ФР.ДляПриемаНаличныхОтЮрЛиц Тогда
		Ответ = "Ошибка при попытке получения номера чека на фискальном регистраторе """
		        + ФР.Модель.Наименование
		        + """: фискальный регистратор предназначен для отражения наличных денежных расчетов.";
	Иначе
		Пароль = ПолучитьЗначениеПоУмолчанию("ПарольКассираФискальногоРегистратора");
		Если ЗначениеНеЗаполнено(Пароль) Тогда
			Пароль = ПолучитьЗначениеПоУмолчанию("ПарольАдминистратораФискальногоРегистратора");
		КонецЕсли;
		Если ЗначениеНеЗаполнено(Пароль) Тогда
			Ответ = "Ошибка при попытке получения номера чека на фискальном регистраторе """
		        + ФР.Модель.Наименование
		        + """: в настройках пользователя не указан пароль фискального регистратора.";
		Иначе
			Форма     = ПолучитьФормуОбработки(ФР.Модель.ОбработкаОбслуживания);
			Параметры.Вставить("Объект",  ФР.Объект);
			Параметры.Вставить("НомерЛУ", ФР.НомерЛУ);
			Параметры.Вставить("Пароль",  Пароль);
			Форма.ВыполнитьОперацию("ПолучитьНомерЧекаСмены", Параметры, Ответ);
			Если Не ПустаяСтрока(Ответ) Тогда
				Ответ = "Ошибка при попытке получения номера чека на фискальном регистраторе """
				        + ФР.Модель.Наименование
				        + """: " + Ответ;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПолучитьНомерЧекаСмены()

// Процедура осуществляет печать чека на ФР.
//
// Параметры
//  ФР                - <СтрокаТаблицыЗначений>
//                    - Строка таблицы подключенных ФР (млФР), соответствующая ФР,
//                      на котором необходимо напечатать чек.
//
//  Параметры         - <Структура>
//                    - Структура параметров операции.
//                       Входные параметры:
//                        НомерСекции    - <Число>
//                                       - Номер секции, которой соответствуют
//                                         позиции данного чека.
//                        ПолученоБезНал - <Число>
//                                       - Сумма, полученная от покупателя (безналичная оплата).
//                        ПолученоНал    - <Число>
//                                       - Сумма, полученная от покупателя (наличная оплата).
//                        СписокТоваров  - <ТаблицаЗначений>
//                                       - Таблица товаров, которые необходимо
//                                         отразить в чеке.
//                                         Таблица имеет следующие колонки:
//                                           "Колво"   - <Число>
//                                                     - Количество продаваемого
//                                                       товара.
//                                           "Скидка"  - <Число>
//                                                     - Процент скидки для данной
//                                                       строки чека.
//                                           "Товар"   - <Строка>
//                                                     - Наименование товара,
//                                                       который должен быть отражён
//                                                       в чеке.
//                                           "Цена"    - <Число>
//                                                     - Цена за единицу товара.
//                        ЧекНаВозврат   - <Булево>
//                                       - Данный чек является чеком на возврат.
//                       Выходные параметры:
//                        НомерЧека      - <Число>
//                                       - Номер текущего чека.
//                        НомерСмены     - <Число>
//                                       - Номер текущей смены.
//
//  Ответ             - <Строка>
//                    - Описание произошедшей в ходе выполнения операции ошибки,
//                      или пустая строка в случае успешного завершения.
//
Процедура ПечататьЧек(ФР, Параметры, Ответ) Экспорт

	Ответ = "";

	Если ЗначениеНеЗаполнено(ФР) Тогда
		Ответ = "Ошибка при попытке печати чека: фискальный регистратор не подключен.";
	ИначеЕсли ЗначениеНеЗаполнено(ФР.Модель.ОбработкаОбслуживания) Тогда
		Ответ = "Ошибка при печати строки чека на фискальном регистраторе """
		         + ФР.Модель.Наименование
		         + """: не задана обработка обслуживания.";
	ИначеЕсли ФР.ДляПриемаНаличныхОтЮрЛиц Тогда
		Ответ = "Ошибка при попытке печати чека на фискальном регистраторе """
		        + ФР.Модель.Наименование
		        + """: фискальный регистратор предназначен для отражения наличных денежных расчетов.";
	Иначе
		Пароль = ПараметрыСеанса.ПарольКассираФискальногоРегистратора;		
		Если ЗначениеНеЗаполнено(Пароль) Тогда
			Ответ = "Ошибка при попытке печати чека на фискальном регистраторе """
		        + ФР.Модель.Наименование
		        + """: в настройках пользователя не указан пароль фискального регистратора.";
		Иначе
			Форма     = ПолучитьФормуОбработки(ФР.Модель.ОбработкаОбслуживания);
			Параметры.Вставить("Объект",  ФР.Объект);
			Параметры.Вставить("НомерЛУ", ФР.НомерЛУ);
			Параметры.Вставить("Пароль",  Пароль);
			Форма.ВыполнитьОперацию("ПечататьЧек", Параметры, Ответ);
			Если Не ПустаяСтрока(Ответ) Тогда
				Ответ = "Ошибка при попытке печати чека на фискальном регистраторе """
				        + ФР.Модель.Наименование
				        + """: " + Ответ;
		    КонецЕсли;
		
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПечататьЧек()

//крохин начало
Процедура ПечататьСертификатЕЕЭ(ФР, Параметры, Ответ) Экспорт
//		сообщить("печатается сертфикат. Пункт 2");

			Форма     = ПолучитьФормуОбработки(ФР.Модель.ОбработкаОбслуживания);
			Пароль = ПараметрыСеанса.ПарольКассираФискальногоРегистратора;		
		Если ЗначениеНеЗаполнено(Пароль) Тогда
			Ответ = "Ошибка при попытке печати чека на фискальном регистраторе """
		        + ФР.Модель.Наименование
		        + """: в настройках пользователя не указан пароль фискального регистратора.";
		Иначе

			Параметры.Вставить("Объект",  ФР.Объект);
			Параметры.Вставить("НомерЛУ", ФР.НомерЛУ);
			Параметры.Вставить("Пароль",  Пароль);

			Форма.ВыполнитьОперацию("ПечататьСертификат", Параметры, Ответ);
			Если Не ПустаяСтрока(Ответ) Тогда
				Ответ = "Ошибка при попытке печати чека на фискальном регистраторе """
				        + ФР.Модель.Наименование
				        + """: " + Ответ;
		    КонецЕсли;
	           КонецЕсли;
КонецПроцедуры
//крохин конец

//крохин начало 29.11.2012

Процедура ПечататьТекстНаЧеке(ФР, Параметры, Ответ) Экспорт

			Форма     = ПолучитьФормуОбработки(ФР.Модель.ОбработкаОбслуживания);
			Пароль = ПараметрыСеанса.ПарольКассираФискальногоРегистратора;		
		Если ЗначениеНеЗаполнено(Пароль) Тогда
			Ответ = "Ошибка при попытке печати чека на фискальном регистраторе """
		        + ФР.Модель.Наименование
		        + """: в настройках пользователя не указан пароль фискального регистратора.";
		Иначе

			Параметры.Вставить("Объект",  ФР.Объект);
			Параметры.Вставить("НомерЛУ", ФР.НомерЛУ);
			Параметры.Вставить("Пароль",  Пароль);

			Форма.ВыполнитьОперацию("ПечататьТекст", Параметры, Ответ);
			Если Не ПустаяСтрока(Ответ) Тогда
				Ответ = "Ошибка при попытке печати чека на фискальном регистраторе """
				        + ФР.Модель.Наименование
				        + """: " + Ответ;
		    КонецЕсли;
	           КонецЕсли;
КонецПроцедуры

//крохин конец 29.11.2012

//крохин начало 07.11.2018

Процедура ПечататьКупонНаЧеке(ФР, Параметры, Ответ) Экспорт

			Форма     = ПолучитьФормуОбработки(ФР.Модель.ОбработкаОбслуживания);
			Пароль = ПараметрыСеанса.ПарольКассираФискальногоРегистратора;		
		Если ЗначениеНеЗаполнено(Пароль) Тогда
			Ответ = "Ошибка при попытке печати чека на фискальном регистраторе """
		        + ФР.Модель.Наименование
		        + """: в настройках пользователя не указан пароль фискального регистратора.";
		Иначе

			Параметры.Вставить("Объект",  ФР.Объект);
			Параметры.Вставить("НомерЛУ", ФР.НомерЛУ);
			Параметры.Вставить("Пароль",  Пароль);

			Форма.ВыполнитьОперацию("ПечататьКупон", Параметры, Ответ);
			Если Не ПустаяСтрока(Ответ) Тогда
				Ответ = "Ошибка при попытке печати чека на фискальном регистраторе """
				        + ФР.Модель.Наименование
				        + """: " + Ответ;
		    КонецЕсли;
	           КонецЕсли;
КонецПроцедуры


//крохин конец 07.11.2018

// Процедура осуществляет печать чека для ПКО/РКО на ФР.
//
// Параметры
//  ФР                - <СтрокаТаблицыЗначений>
//                    - Строка таблицы подключенных ФР (млФР), соответствующая ФР,
//                      на котором необходимо напечатать чек.
//
//  Параметры         - <Структура>
//                    - Структура параметров операции.
//                       Входные параметры:
//                        Заголовок      - <Строка>
//                                       - Заголовок позиции чека. Например:
//                                         "Принято от Алхимов А.А."
//                        Сумма          - <Число>
//                                       - Сумма в валюте регламентированного учета.
//                                         Если сумма < 0, то печатается чек на
//                                         возврат (РКО).
//                        НДС            - <Число>
//                                       - Ставка НДС. Может принимать одно из
//                                         слежующих значений: 0%, 10%, 18%, 20%.
//                                         Для корректной работы необходимо, чтобы
//                                         для фискального регистратора были назначены
//                                         соответствующие налоговые ставки:
//                                           Ставка 1 - 18%, "НДС 18%"
//                                           Ставка 2 - 10%, "НДС 10%"
//                                           Ставка 3 - 20%, "НДС 20%"
//                                           Ставка 4 - 0%,  "Без НДС".
//                       Выходные параметры:
//                        НомерЧека      - <Число>
//                                       - Номер текущего чека.
//                        НомерСмены     - <Число>
//                                       - Номер текущей смены.
//
//  Ответ             - <Строка>
//                    - Описание произошедшей в ходе выполнения операции ошибки,
//                      или пустая строка в случае успешного завершения.
//
Процедура ПечататьЧекДляПКО(ФР, Параметры, Ответ) Экспорт

	Ответ = "";

	Если ЗначениеНеЗаполнено(ФР) Тогда
		Ответ = "Ошибка при попытке печати чека: фискальный регистратор не подключен.";
	ИначеЕсли ЗначениеНеЗаполнено(ФР.Модель.ОбработкаОбслуживания) Тогда
		Ответ = "Ошибка при попытке печати чека на фискальном регистраторе """
		         + ФР.Модель.Наименование
		         + """: не задана обработка обслуживания.";
	ИначеЕсли Не ФР.ДляПриемаНаличныхОтЮрЛиц Тогда
		Ответ = "Ошибка при попытке печати чека на фискальном регистраторе """
		        + ФР.Модель.Наименование
		        + """: фискальный регистратор не предназначен для отражения наличных денежных расчетов.";
	ИначеЕсли ПустаяСтрока(Параметры.Заголовок) Тогда
		Ответ = "Ошибка при попытке печати чека на фискальном регистраторе """
		        + ФР.Модель.Наименование
		        + """: не указано основание.";
	ИначеЕсли Параметры.Сумма = 0 Тогда
		Ответ = "Ошибка при попытке печати чека на фискальном регистраторе """
		        + ФР.Модель.Наименование
		        + """: сумма должна быть отлична от нуля.";
	ИначеЕсли (Параметры.НДС <> 0)
	          И (Параметры.НДС <> 10)
	          И (Параметры.НДС <> 18)
	          И (Параметры.НДС <> 20) Тогда
		Ответ = "Ошибка при попытке печати чека на фискальном регистраторе """
		        + ФР.Модель.Наименование
		        + """: некорректное значение ставки НДС - """
		        + Формат(Параметры.НДС, "ЧН=0; ЧГ=0")
		        + """.";
	Иначе
		Пароль = ПолучитьЗначениеПоУмолчанию("ПарольКассираФискальногоРегистратора");
		Если ЗначениеНеЗаполнено(Пароль) Тогда
			Пароль = ПолучитьЗначениеПоУмолчанию("ПарольАдминистратораФискальногоРегистратора");
		КонецЕсли;
		Если ЗначениеНеЗаполнено(Пароль) Тогда
			Ответ = "Ошибка при попытке печати чека на фискальном регистраторе """
		        + ФР.Модель.Наименование
		        + """: в настройках пользователя не указан пароль фискального регистратора.";
		Иначе
			Врем    = Новый Структура();
			Форма   = ПолучитьФормуОбработки(ФР.Модель.ОбработкаОбслуживания);
			//крохин начало 09.08.2019
			
			ПризнакСпособаРасчета = Неопределено;
			Параметры.Свойство("ПризнакСпособаРасчета",ПризнакСпособаРасчета);
			
			Если ПризнакСпособаРасчета = Неопределено Тогда
			//крохин конец 09.08.2019

			Таблица = Новый ТаблицаЗначений();

			Таблица.Колонки.Добавить("Колво");
			Таблица.Колонки.Добавить("Скидка");
			Таблица.Колонки.Добавить("Товар");
			Таблица.Колонки.Добавить("Цена");
			//крохин начало 16.06.2017
			Таблица.Колонки.Добавить("Количество");
			Таблица.Колонки.Добавить("СуммаСкидки");
			Таблица.Колонки.Добавить("СтавкаНДС");
			Таблица.Колонки.Добавить("Номенклатура");
			Таблица.Колонки.Добавить("Секция");
			//крохин конец 16.06.2017
			
			
			Если Параметры.Сумма < 0 Тогда
				Сумма        = -Параметры.Сумма;
				ЧекНаВозврат = Истина;
			Иначе
				Сумма        = Параметры.Сумма;
				ЧекНаВозврат = Ложь;
			КонецЕсли;

			Строка        = Таблица.Добавить();
			Строка.Колво  = 1;
			//крохин начало 16.06.2017
			Строка.Количество  = 1;
			Строка.СуммаСкидки = 0;  
			//крохин начало 08.01.2019
			//Строка.СтавкаНДС = Перечисления.СтавкиНДС.НДС18;
			Строка.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
			//крохин конец 08.01.2019
			Строка.Номенклатура = Параметры.Заголовок;
			Строка.Секция = 1;
			//крохин конец 16.06.2017
			Строка.Скидка = 0;
			Строка.Товар  = Параметры.Заголовок;
			Строка.Цена   = Сумма;
			
			//крохин начало 09.08.2019	
			Врем.Вставить("ПризнакСпособаРасчета","ОплатаЗаОтгруженныйТовар");
		Иначе
			Параметры.Свойство("СписокТоваров",Таблица);
			
			Если Параметры.Сумма < 0 Тогда
				Сумма        = -Параметры.Сумма;
				ЧекНаВозврат = Истина;
			Иначе
				Сумма        = Параметры.Сумма;
				ЧекНаВозврат = Ложь;
			КонецЕсли;
			Если ПризнакСпособаРасчета = "Аванс" Тогда
				Врем.Вставить("ПризнакСпособаРасчета","Аванс");

		ИначеЕсли ПризнакСпособаРасчета = "ОплатаЗаОтгруженныйТовар" Тогда
			  	Врем.Вставить("ПризнакСпособаРасчета","ОплатаЗаОтгруженныйТовар");
							
			ИначеЕсли ПризнакСпособаРасчета = "ЗачетАванса" Тогда
				Врем.Вставить("ПризнакСпособаРасчета","ЗачетАванса");
			КонецЕсли;
			
			КонецЕсли;
			//крохин конец 09.08.2019

			Врем.Вставить("Объект",         ФР.Объект);
			Врем.Вставить("НомерЛУ",        ФР.НомерЛУ);
			Врем.Вставить("Пароль",         Пароль);
			Врем.Вставить("НомерСекции",    1);
			//крохин начало 16.06.2017
			Врем.Вставить("ПолученоБН", Параметры.ПолученоБН);
			Врем.Вставить("ПолученоНал",    Параметры.ПолученоНал);
			//крохин конец 16.06.2017
			Врем.Вставить("СписокТоваров",  Таблица);
			Врем.Вставить("ЧекНаВозврат",   ЧекНаВозврат);
			Врем.Вставить("НДС",            Параметры.НДС);
			
			//крохин начало 09.08.2019
			Врем.Вставить("КонтрагентНаименование",Параметры.КонтрагентНаименование);
			Врем.Вставить("КонтрагентИНН",Параметры.КонтрагентИНН);
			ВРем.Вставить("CustomerEmail",Параметры.CustomerEmail);
			//крохин конец 09.08.2019

			Форма.ВыполнитьОперацию("ПечататьЧек", Врем, Ответ);
			Если ПустаяСтрока(Ответ) Тогда
				Параметры.Вставить("НомерЧека",  Врем.НомерЧека);
				Параметры.Вставить("НомерСмены", Врем.НомерСмены);
			Иначе
				Ответ = "Ошибка при попытке печати чека на фискальном регистраторе """
				        + ФР.Модель.Наименование
				        + """: " + Ответ;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПечататьЧекДляПКО()

// Процедура осуществляет снятие Z-отчёта на фискальном регистраторе.
//
// Параметры
//  ФР                - <СтрокаТаблицыЗначений>
//                    - Строка таблицы подключенных ФР (млФР), соответствующая ФР,
//                      на котором необходимо снять Z-отчёт.
//
//  Ответ             - <Строка>
//                    - Описание произошедшей в ходе выполнения операции ошибки,
//                      или пустая строка в случае успешного завершения.
//
Процедура ЗакрытьСмену(ФР, Ответ) Экспорт

	Ответ = "";

	Если ЗначениеНеЗаполнено(ФР) Тогда
		Ответ = "Ошибка при попытке закрытия смены: фискальный регистратор не подключен.";
	ИначеЕсли ЗначениеНеЗаполнено(ФР.Модель.ОбработкаОбслуживания) Тогда
		Ответ = "Ошибка при попытке закрытия смены на фискальном регистраторе """
		         + ФР.Модель.Наименование
		         + """: не задана обработка обслуживания.";
	Иначе
		Пароль = ПараметрыСеанса.ПарольАдминистратораФискальногоРегистратора;
		Если ЗначениеНеЗаполнено(Пароль) Тогда
			Ответ = "Ошибка при попытке закрытия смены на фискальном регистраторе """
			        + ФР.Модель.Наименование
			        + """: в настройках пользователя не указан пароль фискального регистратора.";
		Иначе
			Форма     = ПолучитьФормуОбработки(ФР.Модель.ОбработкаОбслуживания);
			Параметры = Новый Структура();
			Параметры.Вставить("Объект",  ФР.Объект);
			Параметры.Вставить("НомерЛУ", ФР.НомерЛУ);
			Параметры.Вставить("Пароль",  Пароль);
			Форма.ВыполнитьОперацию("ЗакрытьСмену", Параметры, Ответ);
			Если Не ПустаяСтрока(Ответ) Тогда
				Ответ = "Ошибка при попытке закрытия смены на фискальном регистраторе """
				        + ФР.Модель.Наименование
				        + """: " + Ответ;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ЗакрытьСмену()

// Процедура осуществляет снятие X-отчёта на фискальном регистраторе.
//
// Параметры
//  ФР                - <СтрокаТаблицыЗначений>
//                    - Строка таблицы подключенных ФР (млФР), соответствующая ФР,
//                      на котором необходимо снять X-отчёт.
//
//  Ответ             - <Строка>
//                    - Описание произошедшей в ходе выполнения операции ошибки,
//                      или пустая строка в случае успешного завершения.
//
Процедура ХОтчет(ФР, Ответ) Экспорт

	Ответ = "";

	Если ЗначениеНеЗаполнено(ФР) Тогда
		Ответ = "Ошибка при попытке снятия X-отчета: фискальный регистратор не подключен.";
	ИначеЕсли ЗначениеНеЗаполнено(ФР.Модель.ОбработкаОбслуживания) Тогда
		Ответ = "Ошибка при попытке снятия X-отчета на фискальном регистраторе """
		         + ФР.Модель.Наименование
		         + """: не задана обработка обслуживания.";
	Иначе
		Пароль = ПараметрыСеанса.ПарольАдминистратораФискальногоРегистратора;
		Если ЗначениеНеЗаполнено(Пароль) Тогда
			Ответ = "Ошибка при попытке снятия X-отчета на фискальном регистраторе """
			        + ФР.Модель.Наименование
			        + """: в настройках пользователя не указан пароль фискального регистратора.";
		Иначе
			Форма     = ПолучитьФормуОбработки(ФР.Модель.ОбработкаОбслуживания);
			Параметры = Новый Структура();
			Параметры.Вставить("Объект",  ФР.Объект);
			Параметры.Вставить("НомерЛУ", ФР.НомерЛУ);
			Параметры.Вставить("Пароль",  Пароль);
			Форма.ВыполнитьОперацию("XОтчет", Параметры, Ответ);
			Если Не ПустаяСтрока(Ответ) Тогда
				Ответ = "Ошибка при попытке снятия X-отчета на фискальном регистраторе """
				        + ФР.Модель.Наименование
				        + """: " + Ответ;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ХОтчет()

// Процедура осуществляет открытие денежного ящика, подключенного к ФР.
//
// Параметры
//  ФР                - <СтрокаТаблицыЗначений>
//                    - Строка таблицы подключенных ФР (млФР), соответствующая ФР,
//                      к которому подключен открываемый денежный ящик.
//
//  Ответ             - <Строка>
//                    - Описание произошедшей в ходе выполнения операции ошибки,
//                      или пустая строка в случае успешного завершения.
//
Процедура ОткрытьЯщик(ФР, Ответ) Экспорт

	Ответ = "";

	Если ЗначениеНеЗаполнено(ФР) Тогда
		Ответ = "Ошибка при попытке открытия денежного ящика: фискальный регистратор не подключен.";
	ИначеЕсли ЗначениеНеЗаполнено(ФР.Модель.ОбработкаОбслуживания) Тогда
		Ответ = "Ошибка при попытке открытия денежного ящика """
		         + ФР.Модель.Наименование
		         + """: не задана обработка обслуживания.";
	Иначе
		Пароль = ПараметрыСеанса.ПарольКассираФискальногоРегистратора;
		
		Если ЗначениеНеЗаполнено(Пароль) Тогда
			Пароль = ПараметрыСеанса.ПарольАдминистратораФискальногоРегистратора;
		КонецЕсли;
		
		Если ЗначениеНеЗаполнено(Пароль) Тогда
			Ответ = "Ошибка при попытке открытия денежного ящика """
			        + ФР.Модель.Наименование
			        + """: в настройках пользователя не указан пароль фискального регистратора.";
		Иначе
			Форма     = ПолучитьФормуОбработки(ФР.Модель.ОбработкаОбслуживания);
			Параметры = Новый Структура();
			Параметры.Вставить("Объект",  ФР.Объект);
			Параметры.Вставить("НомерЛУ", ФР.НомерЛУ);
			Параметры.Вставить("Пароль",  Пароль);
			Форма.ВыполнитьОперацию("ОткрытьЯщик", Параметры, Ответ);
			Если Не ПустаяСтрока(Ответ) Тогда
				Ответ = "Ошибка при попытке открытия денежного ящика """
				        + ФР.Модель.Наименование
				        + """: " + Ответ;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ОткрытьЯщик()

// Процедура осуществляет изъятие суммы из денежного ящика, подключенного к ФР.
//
// Параметры
//  ФР                - <СтрокаТаблицыЗначений>
//                    - Строка таблицы подключенных ФР (млФР), соответствующая ФР,
//                      к которому подключен денежный ящик.
//
//  Сумма             - <Число>
//                    - Изымаемая сумма.
//
//  Ответ             - <Строка>
//                    - Описание произошедшей в ходе выполнения операции ошибки,
//                      или пустая строка в случае успешного завершения.
//
Процедура ИзъятьСумму(ФР, Сумма, Ответ) Экспорт

	Ответ = "";

	Если ЗначениеНеЗаполнено(ФР) Тогда
		Ответ = "Ошибка при попытке изъятия суммы: фискальный регистратор не подключен.";
	ИначеЕсли ЗначениеНеЗаполнено(ФР.Модель.ОбработкаОбслуживания) Тогда
		Ответ = "Ошибка при попытке изъятия суммы """
		         + ФР.Модель.Наименование
		         + """: не задана обработка обслуживания.";
	Иначе
		Пароль = ПараметрыСеанса.ПарольАдминистратораФискальногоРегистратора;		
		Если ЗначениеНеЗаполнено(Пароль) Тогда
			Ответ = "Ошибка при попытке изъятия суммы """
			        + ФР.Модель.Наименование
			        + """: не указан пароль администратора фискального регистратора.";
		Иначе
			Форма     = ПолучитьФормуОбработки(ФР.Модель.ОбработкаОбслуживания);
			Параметры = Новый Структура();
			Параметры.Вставить("Объект",  ФР.Объект);
			Параметры.Вставить("НомерЛУ", ФР.НомерЛУ);
			Параметры.Вставить("Пароль",  Пароль);
			Параметры.Вставить("Сумма",   -Сумма);
			Форма.ВыполнитьОперацию("Внести", Параметры, Ответ);
			Если Не ПустаяСтрока(Ответ) Тогда
				Ответ = "Ошибка при попытке изъятия суммы """
				        + ФР.Модель.Наименование
				        + """: " + Ответ;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ИзъятьСумму()

// Процедура осуществляет внесение суммы в денежный ящик, подключенный к ФР.
//
// Параметры
//  ФР                - <СтрокаТаблицыЗначений>
//                    - Строка таблицы подключенных ФР (млФР), соответствующая ФР,
//                      к которому подключен денежный ящик.
//
//  Сумма             - <Число>
//                    - Изымаемая сумма.
//
//  Ответ             - <Строка>
//                    - Описание произошедшей в ходе выполнения операции ошибки,
//                      или пустая строка в случае успешного завершения.
//
Процедура ВнестиСумму(ФР, Сумма, Ответ) Экспорт

	Ответ = "";

	Если ЗначениеНеЗаполнено(ФР) Тогда
		Ответ = "Ошибка при попытке внесения суммы: фискальный регистратор не подключен.";
	ИначеЕсли ЗначениеНеЗаполнено(ФР.Модель.ОбработкаОбслуживания) Тогда
		Ответ = "Ошибка при попытке внесения суммы """
		         + ФР.Модель.Наименование
		         + """: не задана обработка обслуживания.";
	Иначе
		Пароль = ПараметрыСеанса.ПарольАдминистратораФискальногоРегистратора;
		
		Если ЗначениеНеЗаполнено(Пароль) Тогда
			Ответ = "Ошибка при попытке внесения суммы """
			        + ФР.Модель.Наименование
			        + """: не указан пароль фискального регистратора.";
		Иначе
			Форма     = ПолучитьФормуОбработки(ФР.Модель.ОбработкаОбслуживания);
			Параметры = Новый Структура();
			Параметры.Вставить("Объект",  ФР.Объект);
			Параметры.Вставить("НомерЛУ", ФР.НомерЛУ);
			Параметры.Вставить("Пароль",  Пароль);
			Параметры.Вставить("Сумма",   Сумма);
			Форма.ВыполнитьОперацию("Внести", Параметры, Ответ);
			Если Не ПустаяСтрока(Ответ) Тогда
				Ответ = "Ошибка при попытке внесения суммы """
				        + ФР.Модель.Наименование
				        + """: " + Ответ;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ВнестиСумму()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ РАБОТЫ СО СКАНЕРОМ ШТРИХ-КОДОВ

// Подключение сканера штрих-кодов
//
// Параметры:
//  Модель       - модель сканера штрих-кодов (ссылка на справочник Торговое оборудование)
//  Префикс      - префикс, который возвращает сканер в начале строки со штрих-кодом
//
Процедура ПодключитьСШК(Модель, Префикс, НомерЛУ,Порт=Неопределено,ВсеПараметры)
	Перем Ответ, Объект;

	Параметры = Новый Структура();
	Параметры.Вставить("Модель" , Модель );
	Параметры.Вставить("Префикс", Префикс);
	Параметры.Вставить("Объект" , Объект );
	Параметры.Вставить("НомерЛУ", НомерЛУ);
	Параметры.Вставить("Порт", 	  Порт);

	ДобавитьПараметры(Параметры,ВсеПараметры);
	
	ОбработкаОбслуживания=ПолучитьОбработкуОбслуживания(Модель);	
	Если ОбработкаОбслуживания=Неопределено Тогда
		Сообщить("Сканер штрих-кодов """ + Модель.Наименование + """: ошибка", СтатусСообщения.Важное);
		Сообщить("    Не заполнено поле ""Обработка обслуживания""", СтатусСообщения.БезСтатуса);
		Возврат;
	КонецЕсли;	
	
	Результат=ОбработкаОбслуживания.СоздатьОбъектДрайвера(Объект, Модель, Параметры);	
	Если ЗначениеЗаполнено(Результат) Тогда
		Сообщить("Сканер штрих-кодов """ + Модель.Наименование + """: ошибка при подключении", СтатусСообщения.Важное);
		Сообщить("    " + Результат, СтатусСообщения.БезСтатуса);
		Возврат;	
	КонецЕсли;
	
	Результат=ОбработкаОбслуживания.Подключить(Объект);
	Если ЗначениеЗаполнено(Результат) Тогда
		Сообщить("Сканер штрих-кодов """ + Модель.Наименование + """: ошибка при подключении", СтатусСообщения.Важное);
		Сообщить("    " + Результат, СтатусСообщения.БезСтатуса);	
	КонецЕсли;
	
	НовыйСШК = млСШК.Добавить();
	
	НовыйСШК.Объект  				= Объект;
	НовыйСШК.Модель  				= Модель;
	НовыйСШК.Префикс 				= Префикс;
	НовыйСШК.ОбработкаОбслуживания	= ОбработкаОбслуживания;
КонецПроцедуры // ПодключитьСШК()

// Отключение сканера штрих-кодов
//
// Параметры:
//  СтрокаТаблицыСШК - строка таблицы подключенных сканеров штрих-кода
//
Процедура ОтключитьСШК(СтрокаТаблицыСШК)
	Перем Ответ;

	Если СтрокаТаблицыСШК <> Неопределено Тогда
		Если ЗначениеНеЗаполнено(СтрокаТаблицыСШК.ОбработкаОбслуживания) Тогда
			Сообщить("Сканер штрих-кодов """ + СтрокаТаблицыСШК.Модель.Наименование + """: ошибка", СтатусСообщения.Важное);
			Сообщить("    Не заполнено поле ""Обработка обслуживания""", СтатусСообщения.БезСтатуса);
			Возврат;
		КонецЕсли;
		
		СтрокаТаблицыСШК.ОбработкаОбслуживания.Отключить(СтрокаТаблицыСШК.Объект);
		
		млСШК.Удалить(СтрокаТаблицыСШК);
	КонецЕсли;
КонецПроцедуры // ОтключитьСШК()

// установка или отключение режима буферизации считанных сканером штрихкодов
//
// Параметры:
//  Флаг         - режим работы. 1 - включить режим буферизации, 0 - отключить
//
Процедура СканерПосылкаДанных(Флаг) Экспорт
	Перем Ответ;

	Для Каждого СтрокаТаблицыСШК Из млСШК Цикл
		Если ЗначениеНеЗаполнено(СтрокаТаблицыСШК.ОбработкаОбслуживания) Тогда
			Сообщить("Сканер штрих-кодов """ + СтрокаТаблицыСШК.Модель.Наименование + """: ошибка", СтатусСообщения.Важное);
			Сообщить("    Не заполнено поле ""Обработка обслуживания""", СтатусСообщения.БезСтатуса);
			Возврат;
		КонецЕсли;
		
		СтрокаТаблицыСШК.ОбработкаОбслуживания.СобытиеОбработано(СтрокаТаблицыСШК.Объект); 
	КонецЦикла;
КонецПроцедуры // СканерПосылкаДанных()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ РАБОТЫ С РИДЕРОМ МАГНИТНЫХ КАРТ

// Подключение ридера магнитных карт
//
// Параметры:
//  Модель       - модель сканера штрих-кодов (ссылка на справочник Торговое оборудование)
//  Префикс      - префикс, который возвращает сканер в начале строки со штрих-кодом
//
Процедура ПодключитьРМК(Модель, ИсточникДанных, НомерЛУ)
	Перем Ответ, Объект;

	Параметры = Новый Структура();
	Параметры.Вставить("Модель" , Модель );
	Параметры.Вставить("ИсточникДанных", ИсточникДанных);
	Параметры.Вставить("Объект" , Объект );
	Параметры.Вставить("НомерЛУ" , НомерЛУ);

	Если ЗначениеНеЗаполнено(Модель.ОбработкаОбслуживания) Тогда
		Сообщить("Ридер магнитных карт """ + Модель.Наименование + """: ошибка", СтатусСообщения.Важное);
		Сообщить("    Не заполнено поле ""Обработка обслуживания""", СтатусСообщения.БезСтатуса);
		Возврат;
	КонецЕсли;

	ФормаОбработки = ПолучитьФормуОбработки(Модель.ОбработкаОбслуживания);
	ФормаОбработки.ВыполнитьОперацию("Подключить", Параметры, Ответ);

	Параметры.Свойство("Объект", Объект  );

	Если ПустаяСтрока(Ответ) Тогда
		НовыйРМК = млРМК.Добавить();
		НовыйРМК.Объект  = Объект;
		НовыйРМК.Модель  = Модель;
		НовыйРМК.ИсточникДанных = ИсточникДанных;
	Иначе
		Сообщить("Ридер магнитных карт """ + Модель.Наименование + """: ошибка при подключении", СтатусСообщения.Важное);
		Сообщить("    " + Ответ, СтатусСообщения.БезСтатуса);
	КонецЕсли;

КонецПроцедуры // ПодключитьРМК()

// Отключение ридера магнитных карт
//
// Параметры:
//  СтрокаТаблицыСШК - строка таблицы подключенных сканеров штрих-кода
//
Процедура ОтключитьРМК(СтрокаТаблицыРМК)
	Перем Ответ;

	Если СтрокаТаблицыРМК <> Неопределено Тогда

		Параметры = Новый Структура();
		Параметры.Вставить("Объект", СтрокаТаблицыРМК.Объект);

		Если ЗначениеНеЗаполнено(СтрокаТаблицыРМК.Модель.ОбработкаОбслуживания) Тогда
			Сообщить("Ридер магнитных карт """ + СтрокаТаблицыРМК.Модель.Наименование + """: ошибка", СтатусСообщения.Важное);
			Сообщить("    Не заполнено поле ""Обработка обслуживания""", СтатусСообщения.БезСтатуса);
			Возврат;
		КонецЕсли;

		ФормаОбработки = ПолучитьФормуОбработки(СтрокаТаблицыРМК.Модель.ОбработкаОбслуживания);
		ФормаОбработки.ВыполнитьОперацию("Отключить", Параметры, Ответ);

		Если Не ПустаяСтрока(Ответ) Тогда
			Сообщить("Сканер штрих-кодов """ + СтрокаТаблицыРМК.Модель.Наименование + """: ошибка при отключении", СтатусСообщения.Важное);
			Сообщить("    " + Ответ, СтатусСообщения.БезСтатуса);
		КонецЕсли;
		млРМК.Удалить(СтрокаТаблицыРМК);

	КонецЕсли;

КонецПроцедуры // ОтключитьРМК()

// Включение считывания следующего кода карты
//
Процедура РидерПосылкаДанных() Экспорт
	Перем Ответ;

	Если млРМК.Количество() > 0 Тогда

		Параметры = Новый Структура();
		Параметры.Вставить("Объект", млРМК[0].Объект);
		Попытка
			Параметры.Вставить("НомерЛУ", млРМК[0].Объект.НомерТекущегоУстройства);
		Исключение			
		КонецПопытки;

		Если ЗначениеНеЗаполнено(млРМК[0].Модель.ОбработкаОбслуживания) Тогда
			Сообщить("Ридер магнитных карт """ + млРМК[0].Модель.Наименование + """: ошибка", СтатусСообщения.Важное);
			Сообщить("    Не заполнено поле ""Обработка обслуживания""", СтатусСообщения.БезСтатуса);
			Возврат;
		КонецЕсли;

		ФормаОбработки = ПолучитьФормуОбработки(млРМК[0].Модель.ОбработкаОбслуживания);
		ФормаОбработки.ВыполнитьОперацию("ПосылкаДанных", Параметры, Ответ);

		Если Не ПустаяСтрока(Ответ) Тогда
			Сообщить("Ридер магнитных карт """ + млРМК[0].Модель.Наименование + """: ошибка при установке режима", СтатусСообщения.Важное);
			Сообщить("    " + Ответ, СтатусСообщения.БезСтатуса);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры // РидерПосылкаДанных()



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ РАБОТЫ С ККМ ON-LINE

// Подключение ККМ в режиме On-Line
//
// Параметры:
//  Модель       - модель ККМ On-Line (ссылка на справочник Торговое оборудование)
//  ЗаводскойКод - заводской номер ККМ
//  КассаККМ     - Касса ККМ с которой связана ККМ On-Line
//
Процедура ПодключитьККМOnLine(Модель, ЗаводскойКод, КассаККМ)
	Перем Ответ, Объект;

	Если КассаККМ = Справочники.Кассы.ПустаяСсылка() Тогда
		Сообщить("Для ККМ On-Line """ + Модель + """ не настроена Касса ККМ.", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;

	ТекСклад = ПолучитьЗначениеПоУмолчанию("ОсновнойСклад");
	Если ЗначениеНеЗаполнено(ТекСклад) Тогда
		Сообщить("Для текущего пользователя не установлен склад по умолчанию, ККМ On-Line """ + Модель + """ не подключена.", СтатусСообщения.Важное);
		Возврат;
	ИначеЕсли ТекСклад.ВидСклада = Перечисления.ВидыСкладов.НеавтоматизированнаяТорговаяТочка Тогда
		Сообщить("Для текущего пользователя установлен склад по умолчанию вида НТТ, ККМ On-Line """ + Модель + """ не подключена.", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;

	Параметры = Новый Структура();
	Параметры.Вставить("Модель", Модель);
	Параметры.Вставить("Объект", Объект);

	Если ЗначениеНеЗаполнено(Модель.ОбработкаОбслуживания) Тогда
		Сообщить("ККМ On-Line """ + Модель.Наименование + """: ошибка", СтатусСообщения.Важное);
		Сообщить("    Не заполнено поле ""Обработка обслуживания""", СтатусСообщения.БезСтатуса);
		Возврат;
	КонецЕсли;

	ФормаОбработки = ПолучитьФормуОбработки(Модель.ОбработкаОбслуживания);
	ФормаОбработки.ВыполнитьОперацию("Подключить", Параметры, Ответ);

	Параметры.Свойство("Объект", Объект);

	Если ПустаяСтрока(Ответ) Тогда
		НовыйККМOnLine = млККМOnLine.Добавить();
		НовыйККМOnLine.Объект   = Объект;
		НовыйККМOnLine.Модель   = Модель;
		НовыйККМOnLine.Код      = СокрЛП(ЗаводскойКод);
		НовыйККМOnLine.КассаККМ = КассаККМ;
	Иначе
		Сообщить("ККМ On-Line """ + Модель.Наименование + """: ошибка при подключении", СтатусСообщения.Важное);
		Сообщить("    " + Ответ, СтатусСообщения.БезСтатуса);
	КонецЕсли;

КонецПроцедуры // ПодключитьККМOnLine()

// Отключение ККМ в режиме On-Line
//
// Параметры:
//  СтрокаТаблицыККМOnLine - строка таблицы подключенных ККМ в режиме OnLine
//
Процедура ОтключитьККМOnLine(СтрокаТаблицыККМOnLine)
	Перем Ответ;

	Если СтрокаТаблицыККМOnLine <> Неопределено Тогда

		Параметры = Новый Структура();
		Параметры.Вставить("Объект", СтрокаТаблицыККМOnLine.Объект);

		Если ЗначениеНеЗаполнено(СтрокаТаблицыККМOnLine.Модель.ОбработкаОбслуживания) Тогда
			Сообщить("ККМ On-Line """ + СтрокаТаблицыККМOnLine.Модель.Наименование + """: ошибка", СтатусСообщения.Важное);
			Сообщить("    Не заполнено поле ""Обработка обслуживания""", СтатусСообщения.БезСтатуса);
			Возврат;
		КонецЕсли;

		ФормаОбработки = ПолучитьФормуОбработки(СтрокаТаблицыККМOnLine.Модель.ОбработкаОбслуживания);
		ФормаОбработки.ВыполнитьОперацию("Отключить", Параметры, Ответ);

		Если Не ПустаяСтрока(Ответ) Тогда
			Сообщить("ККМ On-Line """ + СтрокаТаблицыККМOnLine.Модель.Наименование + """: ошибка при отключении", СтатусСообщения.Важное);
			Сообщить("    " + Ответ, СтатусСообщения.БезСтатуса);
		КонецЕсли;
		млККМOnLine.Удалить(СтрокаТаблицыККМOnLine);

	КонецЕсли;

КонецПроцедуры // ОтключитьККМOnLine()

// Процедура обработки события от ККМ в режиме On-Line
//
// Параметры:
//  Источник     - источник события
//  Событие      - строковое предствление события
//  Данные       - передаваемые данные
//
Процедура ОбработкаСобытияККМ(Источник, Событие, Данные) Экспорт
	Перем Ответ;

	Если Источник = "A200Online" Тогда
		ИскомаяСтрока = млККМOnLine.Найти(СокрЛП(Данные), "Код");
		Если ИскомаяСтрока <> Неопределено Тогда
			Если ИскомаяСтрока.КассаККМ <> Справочники.Кассы.ПустаяСсылка() Тогда
				Параметры = Новый Структура();
				Параметры.Вставить("Объект"  , ИскомаяСтрока.Объект   );
				Параметры.Вставить("Событие" , Событие                );
				Параметры.Вставить("КодККМ"  , СокрЛП(Данные)         );
				Параметры.Вставить("КассаККМ", ИскомаяСтрока.КассаККМ );
				Параметры.Вставить("Буфер"   , млЧековыйБуферККМOnLine);

				Если ЗначениеНеЗаполнено(ИскомаяСтрока.Модель.ОбработкаОбслуживания) Тогда
					Сообщить("ККМ On-Line """ + ИскомаяСтрока.Модель.Наименование + """: ошибка", СтатусСообщения.Важное);
					Сообщить("    Не заполнено поле ""Обработка обслуживания""", СтатусСообщения.БезСтатуса);
					Возврат;
				КонецЕсли;

				ФормаОбработки = ПолучитьФормуОбработки(ИскомаяСтрока.Модель.ОбработкаОбслуживания);
				ФормаОбработки.ВыполнитьОперацию("Событие", Параметры, Ответ);

				Параметры.Свойство("Буфер"  , млЧековыйБуферККМOnLine);

				Если Не ПустаяСтрока(Ответ) Тогда
					Сообщить("ККМ On-Line """ + ИскомаяСтрока.Модель.Наименование + """: ошибка обработки сообщения", СтатусСообщения.Важное);
					Сообщить("    " + Ответ, СтатусСообщения.БезСтатуса);
				КонецЕсли;
			Иначе
				Сообщить("Для ККМ On-Line """ + ИскомаяСтрока.Модель + """ не настроена Касса ККМ.", СтатусСообщения.Важное);
			КонецЕсли;
		Иначе
			Сообщить("ККМ On-Line не настроена (возможно не задан заводской номер).", СтатусСообщения.Важное);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ОбработкаСобытияККМ()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ РАБОТЫ С ККМ OFF-LINE

// Подключение ККМ в режиме Off-Line
//
// Параметры:
//  Модель       - модель ККМ Off-Line (ссылка на справочник Торговое оборудование)
//  Путь         - путь выгрузки информации о товарах и загрузки информации о продажах
//  НомерЛУ      - номер логического устройства с который связан Объект
//  КассаККМ     - Касса ККМ с которой связана ККМ Off-Line
//
Процедура ПодключитьККМOffLine(Модель, Путь, НомерЛУ, КассаККМ, Адрес = "", Порт = 0)
	Перем Ответ, Объект;

	Параметры = Новый Структура();
	Параметры.Вставить("Модель" , Модель );
	Параметры.Вставить("Объект" , Объект );
	Параметры.Вставить("НомерЛУ", НомерЛУ);

	Если ЗначениеНеЗаполнено(Модель.ОбработкаОбслуживания) Тогда
		Сообщить("ККМ Off-Line """ + Модель.Наименование + """: ошибка при подключении", СтатусСообщения.Важное);
		Сообщить("    Не заполнено поле ""Обработка обслуживания""", СтатусСообщения.БезСтатуса);
		Возврат;
	КонецЕсли;

	ФормаОбработки = ПолучитьФормуОбработки(Модель.ОбработкаОбслуживания);
	ФормаОбработки.ВыполнитьОперацию("Подключить", Параметры, Ответ);

	Параметры.Свойство("Объект" , Объект );

	Если ПустаяСтрока(Ответ) Тогда
		НовыйККМOffLine = млККМOffLine.Добавить();
		НовыйККМOffLine.Объект   = Объект;
		НовыйККМOffLine.Модель   = Модель;
		НовыйККМOffLine.Путь     = Путь;
		НовыйККМOffLine.НомерЛУ  = НомерЛУ;
		НовыйККМOffLine.КассаККМ = КассаККМ;
		НовыйККМOffLine.Адрес    = Адрес;
		НовыйККМOffLine.Порт     = Порт;
	Иначе
		Сообщить("ККМ Off-Line """ + Модель.Наименование + """: ошибка при подключении", СтатусСообщения.Важное);
		Сообщить("    " + Ответ, СтатусСообщения.БезСтатуса);
	КонецЕсли;

КонецПроцедуры // ПодключитьККМOffLine()

// Отключение ККМ в режиме Off-Line
//
// Параметры:
//  СтрокаТаблицыККМOffLine - строка таблицы подключенных ККМ в режиме OffLine
//
Процедура ОтключитьККМOffLine(СтрокаТаблицыККМOffLine)
	Перем Ответ;

	Если СтрокаТаблицыККМOffLine <> Неопределено Тогда

		Параметры = Новый Структура();
		Параметры.Вставить("Объект" , СтрокаТаблицыККМOffLine.Объект );
		Параметры.Вставить("НомерЛУ", СтрокаТаблицыККМOffLine.НомерЛУ);

		Если ЗначениеНеЗаполнено(СтрокаТаблицыККМOffLine.Модель.ОбработкаОбслуживания) Тогда
			Сообщить("ККМ Off-Line """ + СтрокаТаблицыККМOffLine.Модель.Наименование + """: ошибка при отключении", СтатусСообщения.Важное);
			Сообщить("    Не заполнено поле ""Обработка обслуживания""", СтатусСообщения.БезСтатуса);
			Возврат;
		КонецЕсли;

		ФормаОбработки = ПолучитьФормуОбработки(СтрокаТаблицыККМOffLine.Модель.ОбработкаОбслуживания);
		ФормаОбработки.ВыполнитьОперацию("Отключить", Параметры, Ответ);

		Если НЕ ПустаяСтрока(Ответ) Тогда
			Сообщить("ККМ Off-Line """ + СтрокаТаблицыККМOffLine.Модель.Наименование + """: ошибка при отключении", СтатусСообщения.Важное);
			Сообщить("    " + Ответ, СтатусСообщения.БезСтатуса);
		КонецЕсли;
		млККМOffLine.Удалить(СтрокаТаблицыККМOffLine);

	КонецЕсли;

КонецПроцедуры // ОтключитьККМOffLine()

// Загрузка товаров для ККМ в режиме Off-Line
//
// Параметры:
//  Параметры - Структура необходиимых для функции параметров.
//
// Возвращаемое значение:
//  строка с представлением ошибки если она произошла, иначе пустая строка
//
Функция ККМЗагрузитьТовары(Параметры) Экспорт
	Перем Ответ;

	КассаККМ = Параметры.Касса;
	ИскомаяСтрока = млККМOffLine.Найти(КассаККМ, "КассаККМ");
	Если ИскомаяСтрока <> Неопределено Тогда

		Параметры.Вставить("Объект" , ИскомаяСтрока.Объект );
		Параметры.Вставить("Путь"   , ИскомаяСтрока.Путь   );
		Параметры.Вставить("НомерЛУ", ИскомаяСтрока.НомерЛУ);
		Параметры.Вставить("Адрес"  , ИскомаяСтрока.Адрес  );
		Параметры.Вставить("Порт"   , ИскомаяСтрока.Порт   );

		Если ЗначениеНеЗаполнено(ИскомаяСтрока.Модель.ОбработкаОбслуживания) Тогда
			Сообщить("ККМ Off-Line """ + ИскомаяСтрока.Модель.Наименование + """: ошибка", СтатусСообщения.Важное);
			Сообщить("    Не заполнено поле ""Обработка обслуживания""", СтатусСообщения.БезСтатуса);
			Возврат "";
		КонецЕсли;

		ФормаОбработки = ПолучитьФормуОбработки(ИскомаяСтрока.Модель.ОбработкаОбслуживания);
		ФормаОбработки.ВыполнитьОперацию("ЗагрузитьТовары", Параметры, Ответ);

	Иначе

		Ответ = "Касса ККМ """ + КассаККМ + """ не подключена.";

	КонецЕсли;

	Возврат Ответ;

КонецФункции // ККМЗагрузитьТовары()

// Закрытие смены на ККМ в режиме Off-Line
//
// Параметры:
//  СтрокаТаблицыККМOffLine - строка таблицы подключенных ККМ в режиме OffLine
//  Дата         - дата закрытия
//  ДанныеИзККМ  - возвращаемая таблица с данными о прадажах на ККМ за день
//
// Возвращаемое значение:
//  строка с представлением ошибки если она произошла, иначе пустая строка
//
Функция ККМЗакрытьСмену(СтрокаТаблицыOffLine, Дата, ДанныеИзККМ) Экспорт
	Перем Ответ;

	Если СтрокаТаблицыOffLine <> Неопределено Тогда

		Параметры = Новый Структура();
		Параметры.Вставить("Объект" , СтрокаТаблицыOffLine.Объект  );
		Параметры.Вставить("Касса"  , СтрокаТаблицыOffLine.КассаККМ);
		Параметры.Вставить("Дата"   , Дата                         );
		Параметры.Вставить("Путь"   , СтрокаТаблицыOffLine.Путь    );
		Параметры.Вставить("НомерЛУ", СтрокаТаблицыOffLine.НомерЛУ );
		Параметры.Вставить("Адрес"  , СтрокаТаблицыOffLine.Адрес  );
		Параметры.Вставить("Порт"   , СтрокаТаблицыOffLine.Порт   );

		Если ЗначениеНеЗаполнено(СтрокаТаблицыOffLine.Модель.ОбработкаОбслуживания) Тогда
			Сообщить("ККМ Off-Line """ + СтрокаТаблицыOffLine.Модель.Наименование + """: ошибка", СтатусСообщения.Важное);
			Сообщить("    Не заполнено поле ""Обработка обслуживания""", СтатусСообщения.БезСтатуса);
			Возврат "";
		КонецЕсли;

		ФормаОбработки = ПолучитьФормуОбработки(СтрокаТаблицыOffLine.Модель.ОбработкаОбслуживания);
		ФормаОбработки.ВыполнитьОперацию("ЗакрытьСмену", Параметры, Ответ);

		Параметры.Свойство("Данные" , ДанныеИзККМ                  );

	Иначе

		Ответ = "Касса ККМ не подключена.";

	КонецЕсли;

	Возврат Ответ;

КонецФункции // ККМЗакрытьСмену()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ РАБОТЫ С ЭЛЕКТРОННЫМИ ВЕСАМИ

// Подключение электронных весов
//
// Параметры:
//  Модель       - модель весов (ссылка на справочник Торговое оборудование)
//  НомерЛУ      - номер логического устройства с который связан Объект
//
Процедура ПодключитьВесы(Модель, НомерЛУ)
	Перем Ответ, Объект;

	Параметры = Новый Структура();
	Параметры.Вставить("Модель"  , Модель );
	Параметры.Вставить("Объект"  , Объект );
	Параметры.Вставить("НомерЛУ" , НомерЛУ);

	Если ЗначениеНеЗаполнено(Модель.ОбработкаОбслуживания) Тогда
		Сообщить("Электронные весы """ + Модель.Наименование + """: ошибка при подключении", СтатусСообщения.Важное);
		Сообщить("    Не заполнено поле ""Обработка обслуживания""", СтатусСообщения.БезСтатуса);
		Возврат;
	КонецЕсли;

	ФормаОбработки = ПолучитьФормуОбработки(Модель.ОбработкаОбслуживания);
	ФормаОбработки.ВыполнитьОперацию("Подключить", Параметры, Ответ);

	Параметры.Свойство("Объект", Объект );

	Если ПустаяСтрока(Ответ) Тогда
		НовыеВесы = млВесы.Добавить();
		НовыеВесы.Объект  = Объект;
		НовыеВесы.Модель  = Модель;
		НовыеВесы.НомерЛУ = НомерЛУ;
	Иначе
		Сообщить("Электронные весы """ + Модель.Наименование + """: ошибка при подключении", СтатусСообщения.Важное);
		Сообщить("    " + Ответ, СтатусСообщения.БезСтатуса);
	КонецЕсли;

КонецПроцедуры // ПодключитьВесы()

// Отключение электронных весов
//
// Параметры:
//  СтрокаТаблицыВесов - строка таблицы подключенных весов
//
Процедура ОтключитьВесы(СтрокаТаблицыВесов)
	Перем Ответ;

	Если СтрокаТаблицыВесов <> Неопределено Тогда

		Параметры = Новый Структура();
		Параметры.Вставить("Объект" , СтрокаТаблицыВесов.Объект );
		Параметры.Вставить("НомерЛУ", СтрокаТаблицыВесов.НомерЛУ);

		Если ЗначениеНеЗаполнено(СтрокаТаблицыВесов.Модель.ОбработкаОбслуживания) Тогда
			Сообщить("Электронные весы """ + СтрокаТаблицыВесов.Модель.Наименование + """: ошибка при отключении", СтатусСообщения.Важное);
			Сообщить("    Не заполнено поле ""Обработка обслуживания""", СтатусСообщения.БезСтатуса);
			Возврат;
		КонецЕсли;

		ФормаОбработки = ПолучитьФормуОбработки(СтрокаТаблицыВесов.Модель.ОбработкаОбслуживания);
		ФормаОбработки.ВыполнитьОперацию("Отключить", Параметры, Ответ);

		Если Не ПустаяСтрока(Ответ) Тогда
			Сообщить("Электронные весы """ + СтрокаТаблицыВесов.Модель.Наименование + """: ошибка при отключении", СтатусСообщения.Важное);
			Сообщить("    " + Ответ, СтатусСообщения.БезСтатуса);
		КонецЕсли;
		млВесы.Удалить(СтрокаТаблицыВесов);

	КонецЕсли;

КонецПроцедуры // ОтключитьВесы()

// Выполнить операцию электронных весов
//
// Параметры:
//  МодельВесов  - модель весов из справочника "Торговое оборудование"
//  ИмяОперации  - строковое представление операции
//  Значение     - передаваемое или получаемое значение
//
// Возвращаемое значение:
//  строка с представлением ошибки если она произошла, иначе пустая строка
//
Функция ВыполнитьОперациюВесов(МодельВесов, ИмяОперации = "", Значение = 0) Экспорт
	Перем Ответ;

	ИскомаяСтрока = млВесы.Найти(МодельВесов, "Модель");
	Если ИскомаяСтрока <> Неопределено Тогда

		Параметры = Новый Структура();
		Параметры.Вставить("Объект",  ИскомаяСтрока.Объект );
		Параметры.Вставить("НомерЛУ", ИскомаяСтрока.НомерЛУ);

		Если ИмяОперации = "" Тогда
			Возврат "не передано имя операции";
		ИначеЕсли ИмяОперации = "УстановитьТару" Тогда
			Параметры.Вставить("ВесТары", Значение);
		ИначеЕсли ИмяОперации = "УстановитьРежим" Тогда
			Параметры.Вставить("Режим",   Значение);
		КонецЕсли;

		Если ЗначениеНеЗаполнено(ИскомаяСтрока.Модель.ОбработкаОбслуживания) Тогда
			Сообщить("Электронные весы """ + ИскомаяСтрока.Модель.Наименование + """: ошибка", СтатусСообщения.Важное);
			Сообщить("    Не заполнено поле ""Обработка обслуживания""", СтатусСообщения.БезСтатуса);
			Возврат "";
		КонецЕсли;

		ФормаОбработки = ПолучитьФормуОбработки(ИскомаяСтрока.Модель.ОбработкаОбслуживания);
		ФормаОбработки.ВыполнитьОперацию(ИмяОперации, Параметры, Ответ);

		Если ИмяОперации = "ПолучитьВес" Тогда
			Параметры.Свойство("Вес", Значение);
		КонецЕсли;

		Возврат Ответ;

	Иначе

		Возврат "Электронные весы """ + МодельВесов + """ не подключены.";

	КонецЕсли;

КонецФункции // ВыполнитьОперациюВесов()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ РАБОТЫ С ДИСПЛЕЕМ ПОКУПАТЕЛЯ

// Подключение дисплея покупателя
//
// Параметры:
//  Модель       - модель дисплея покупателя (ссылка на справочник Торговое оборудование)
//  ИнформационнаяСтрока1 - строка, ввыводимая в качестве информации на дисплее в 1ой строке
//  ИнформационнаяСтрока2 - строка, ввыводимая в качестве информации на дисплее во 2ой строке
//  НомерЛУ      - номер логического устройства с который связан Объект
//  БегущаяСтрока - признак отображения информационных строк в виде бегущей строки
//  КассаККМ     - Касса ККМ с которой связан дисплей покупателя
//
Процедура ПодключитьДисплейПокупателя(Модель, ИнформационнаяСтрока1, ИнформационнаяСтрока2, НомерЛУ, БегущаяСтрока, КассаККМ)
	Перем Ответ, Объект;

	Параметры = Новый Структура();
	Параметры.Вставить("Модель" , Модель );
	Параметры.Вставить("Объект" , Объект );
	Параметры.Вставить("НомерЛУ", НомерЛУ);

	Если ЗначениеНеЗаполнено(Модель.ОбработкаОбслуживания) Тогда
		Сообщить("Дисплей покупателя """ + Модель.Наименование + """: ошибка при подключении", СтатусСообщения.Важное);
		Сообщить("    Не заполнено поле ""Обработка обслуживания""", СтатусСообщения.БезСтатуса);
		Возврат;
	КонецЕсли;

	ФормаОбработки = ПолучитьФормуОбработки(Модель.ОбработкаОбслуживания);
	ФормаОбработки.ВыполнитьОперацию("Подключить", Параметры, Ответ);

	Параметры.Свойство("Объект", Объект  );

	Если ПустаяСтрока(Ответ) Тогда
		НовыйДисплейПокупателя = млДП.Добавить();
		НовыйДисплейПокупателя.Объект        = Объект;
		НовыйДисплейПокупателя.Модель        = Модель;
		НовыйДисплейПокупателя.Строка1       = ИнформационнаяСтрока1;
		НовыйДисплейПокупателя.Строка2       = ИнформационнаяСтрока2;
		НовыйДисплейПокупателя.БегущаяСтрока = БегущаяСтрока;
		НовыйДисплейПокупателя.НомерЛУ       = НомерЛУ;
		НовыйДисплейПокупателя.КассаККМ      = КассаККМ;

		млДПРежим                            = "Без режима";
	Иначе
		Сообщить("Дисплей покупателя """ + Модель.Наименование + """: ошибка при подключении", СтатусСообщения.Важное);
		Сообщить("    " + Ответ, СтатусСообщения.БезСтатуса);
	КонецЕсли;

КонецПроцедуры // ПодключитьДисплейПокупателя()

// Отключение дисплея покупателя
//
// Параметры:
//  СтрокаТаблицыДП - строка таблицы подключенных дисплеев покупателя
//
Процедура ОтключитьДисплейПокупателя(СтрокаТаблицыДП)
	Перем Ответ;

	Если СтрокаТаблицыДП <> Неопределено Тогда

		Параметры = Новый Структура();
		Параметры.Вставить("Объект" , СтрокаТаблицыДП.Объект );
		Параметры.Вставить("НомерЛУ", СтрокаТаблицыДП.НомерЛУ);

		Если ЗначениеНеЗаполнено(СтрокаТаблицыДП.Модель.ОбработкаОбслуживания) Тогда
			Сообщить("Дисплей покупателя """ + СтрокаТаблицыДП.Модель.Наименование + """: ошибка при отключении", СтатусСообщения.Важное);
			Сообщить("    Не заполнено поле ""Обработка обслуживания""", СтатусСообщения.БезСтатуса);
			Возврат;
		КонецЕсли;

		ФормаОбработки = ПолучитьФормуОбработки(СтрокаТаблицыДП.Модель.ОбработкаОбслуживания);
		ФормаОбработки.ВыполнитьОперацию("Отключить", Параметры, Ответ);

		Если Не ПустаяСтрока(Ответ) Тогда
			Сообщить("Дисплей покупателя """ + СтрокаТаблицыДП.Модель.Наименование + """: ошибка при отключении", СтатусСообщения.Важное);
			Сообщить("    " + Ответ, СтатусСообщения.БезСтатуса);
		КонецЕсли;
		млДП.Удалить(СтрокаТаблицыДП);

	КонецЕсли;

КонецПроцедуры // ОтключитьДисплейПокупателя()

// Выводит бегущую строку на дисплее покупателя
//
// Параметры:
//  СтрокаТаблицыДП - строка таблицы подключенных дисплеев покупателя
//
// Возвращаемое значение:
//  строка с представлением ошибки если она произошла, иначе пустая строка
//
Функция ВключитьРежимВыводаБегущейСтроки(СтрокаТаблицыДП) Экспорт
	Перем Ответ;

	Если СтрокаТаблицыДП = Неопределено Тогда

		Возврат "Дисплей покупателя не подключен";

	ИначеЕсли млДПРежим <> "Бегущия строка" Тогда

		Параметры = Новый Структура();
		Параметры.Вставить("Объект"        , СтрокаТаблицыДП.Объект );
		Параметры.Вставить("БегущаяСтрока1", СтрокаТаблицыДП.Строка1);
		Параметры.Вставить("БегущаяСтрока2", СтрокаТаблицыДП.Строка2);
		Параметры.Вставить("НомерЛУ"       , СтрокаТаблицыДП.НомерЛУ);

		Если ЗначениеНеЗаполнено(СтрокаТаблицыДП.Модель.ОбработкаОбслуживания) Тогда
			Сообщить("Дисплей покупателя """ + СтрокаТаблицыДП.Модель.Наименование + """: ошибка", СтатусСообщения.Важное);
			Сообщить("    Не заполнено поле ""Обработка обслуживания""", СтатусСообщения.БезСтатуса);
			Возврат "";
		КонецЕсли;

		ФормаОбработки = ПолучитьФормуОбработки(СтрокаТаблицыДП.Модель.ОбработкаОбслуживания);
		ФормаОбработки.ВыполнитьОперацию("БегущаяСтрока", Параметры, Ответ);

		Если Не ПустаяСтрока(Ответ) Тогда
			Возврат Ответ;
		КонецЕсли;

		млДПРежим = "Бегущия строка";

	КонецЕсли;

	Возврат "";

КонецФункции // ВключитьРежимВыводаБегущейСтроки()

// Создает логическое окно на дисплее для вывода текстовых строк
//
// Параметры:
//  СтрокаТаблицыДП - строка таблицы подключенных дисплеев покупателя
//
// Возвращаемое значение:
//  строка с представлением ошибки если она произошла, иначе пустая строка
//
Функция ВключитьРежимВыводаСтрок(СтрокаТаблицыДП) Экспорт
	Перем Ответ;

	Если СтрокаТаблицыДП = Неопределено Тогда

		Возврат "Дисплей покупателя не подключен";

	ИначеЕсли млДПРежим <> "Вывод строк" Тогда

		Параметры = Новый Структура();
		Параметры.Вставить("Объект" , СтрокаТаблицыДП.Объект );
		Параметры.Вставить("НомерЛУ", СтрокаТаблицыДП.НомерЛУ);

		Если ЗначениеНеЗаполнено(СтрокаТаблицыДП.Модель.ОбработкаОбслуживания) Тогда
			Сообщить("Дисплей покупателя """ + СтрокаТаблицыДП.Модель.Наименование + """: ошибка", СтатусСообщения.Важное);
			Сообщить("    Не заполнено поле ""Обработка обслуживания""", СтатусСообщения.БезСтатуса);
			Возврат "";
		КонецЕсли;

		ФормаОбработки = ПолучитьФормуОбработки(СтрокаТаблицыДП.Модель.ОбработкаОбслуживания);
		ФормаОбработки.ВыполнитьОперацию("СоздатьОкно", Параметры, Ответ);

		Если Не ПустаяСтрока(Ответ) Тогда
			Возврат Ответ;
		КонецЕсли;

		млДПРежим = "Вывод строк";

	КонецЕсли;

	Возврат "";

КонецФункции // ВключитьРежимВыводаСтрок()

// Выводит текстовые строки на дисплей покупателя
//
// Параметры:
//  СтрокаТаблицыДП - строка таблицы подключенных дисплеев покупателя
//  Строка1      - строка, которая будет выведена в верхнюю стоку дисплея
//  Строка2      - строка, которая будет выведена в нижнюю стоку дисплея
//
// Возвращаемое значение:
//  строка с представлением ошибки если она произошла, иначе пустая строка
//
Функция ВывестиСтрокиНаДисплей(СтрокаТаблицыДП, Строка1="", Строка2="") Экспорт
	Перем Ответ;

	Если СтрокаТаблицыДП = Неопределено Тогда
		Возврат "Дисплей покупателя не подключен";
	КонецЕсли;

	// запустим режим вывода строк
	Ответ = ВключитьРежимВыводаСтрок(СтрокаТаблицыДП);
	Если Не ПустаяСтрока(Ответ) Тогда
		Возврат "Не удалось включить режим вывода строк";
	КонецЕсли;

	Параметры = Новый Структура();
	Параметры.Вставить("Объект" , СтрокаТаблицыДП.Объект );
	Параметры.Вставить("НомерЛУ", СтрокаТаблицыДП.НомерЛУ);
	Параметры.Вставить("Строка1", Строка1                );
	Параметры.Вставить("Строка2", Строка2                );

	Если ЗначениеНеЗаполнено(СтрокаТаблицыДП.Модель.ОбработкаОбслуживания) Тогда
		Сообщить("Дисплей покупателя """ + СтрокаТаблицыДП.Модель.Наименование + """: ошибка", СтатусСообщения.Важное);
		Сообщить("    Не заполнено поле ""Обработка обслуживания""", СтатусСообщения.БезСтатуса);
		Возврат "";
	КонецЕсли;

	ФормаОбработки = ПолучитьФормуОбработки(СтрокаТаблицыДП.Модель.ОбработкаОбслуживания);
	ФормаОбработки.ВыполнитьОперацию("ВывестиСтроки", Параметры, Ответ);

	Если Не ПустаяСтрока(Ответ) Тогда
		Возврат Ответ;
	КонецЕсли;

	Возврат "";

КонецФункции // ВывестиСтрокиНаДисплей()

// Очистить дисплей покупателя
//
// Параметры:
//  СтрокаТаблицыДП - строка таблицы подключенных дисплеев покупателя
//
// Возвращаемое значение:
//  строка с представлением ошибки если она произошла, иначе пустая строка
//
Функция ОчиститьДисплейПокупателя(СтрокаТаблицыДП) Экспорт
	Перем Ответ;

	Если СтрокаТаблицыДП = Неопределено Тогда
		Возврат "Дисплей покупателя не подключен";
	КонецЕсли;

	// запустим режим вывода строк
	Ответ = ВключитьРежимВыводаСтрок(СтрокаТаблицыДП);
	Если Не ПустаяСтрока(Ответ) Тогда
		Возврат "Не удалось включить режим вывода строк";
	КонецЕсли;

	Параметры = Новый Структура();
	Параметры.Вставить("Объект" , СтрокаТаблицыДП.Объект );
	Параметры.Вставить("НомерЛУ", СтрокаТаблицыДП.НомерЛУ);

	Если ЗначениеНеЗаполнено(СтрокаТаблицыДП.Модель.ОбработкаОбслуживания) Тогда
		Сообщить("Дисплей покупателя """ + СтрокаТаблицыДП.Модель.Наименование + """: ошибка", СтатусСообщения.Важное);
		Сообщить("    Не заполнено поле ""Обработка обслуживания""", СтатусСообщения.БезСтатуса);
		Возврат "";
	КонецЕсли;

	ФормаОбработки = ПолучитьФормуОбработки(СтрокаТаблицыДП.Модель.ОбработкаОбслуживания);
	ФормаОбработки.ВыполнитьОперацию("ОчиститьДисплей", Параметры, Ответ);

	Если Не ПустаяСтрока(Ответ) Тогда
		Возврат Ответ;
	КонецЕсли;

	Возврат "";

КонецФункции // ВывестиСтрокиНаДисплей()

// Открывает денежный ящик
//
// Параметры:
//  КассаККМ     - Касса ККМ с которой связан дисплей покупателя
//
// Возвращаемое значение:
//  строка с представлением ошибки если она произошла, иначе пустая строка
//
Функция ОткрытьДенежныйЯщик(КассаККМ) Экспорт
	Перем Ответ;

	ИскомаяСтрока = млДП.Найти(КассаККМ, "КассаККМ");
	Если ИскомаяСтрока = Неопределено Тогда

		Возврат "Дисплей покупателя с денежным ящиком не подключены";

	Иначе

		Параметры = Новый Структура();
		Параметры.Вставить("Объект" , ИскомаяСтрока.Объект );
		Параметры.Вставить("НомерЛУ", ИскомаяСтрока.НомерЛУ);

		Если ЗначениеНеЗаполнено(ИскомаяСтрока.Модель.ОбработкаОбслуживания) Тогда
			Сообщить("Дисплей покупателя """ + ИскомаяСтрока.Модель.Наименование + """: ошибка", СтатусСообщения.Важное);
			Сообщить("    Не заполнено поле ""Обработка обслуживания""", СтатусСообщения.БезСтатуса);
			Возврат "";
		КонецЕсли;

		ФормаОбработки = ПолучитьФормуОбработки(ИскомаяСтрока.Модель.ОбработкаОбслуживания);
		ФормаОбработки.ВыполнитьОперацию("ОткрытьДенежныйЯщик", Параметры, Ответ);

		Если Не ПустаяСтрока(Ответ) Тогда
			Возврат Ответ;
		КонецЕсли;

	КонецЕсли;

	Возврат "";

КонецФункции // ВывестиСтрокиНаДисплей()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ РАБОТЫ С ТЕРМИНАЛОМ СБОРА ДАННЫХ

// Подключение терминала сбора данных
//
// Параметры:
//  Модель       - модель терминала сбора данных (ссылка на справочник Торговое оборудование)
//  НомерЛУ      - номер логического устройства с который связан Объект
//
Процедура ПодключитьТерминалСбораДанных(Модель, НомерЛУ,ВсеПараметры)
	Перем Ответ, Объект;

	млТерминалМодель = Модель;

	Параметры = Новый Структура();
	Параметры.Вставить("Модель" , Модель );
	Параметры.Вставить("Объект" , Объект );
	Параметры.Вставить("НомерЛУ", НомерЛУ);
	если ВсеПараметры.Свойство ("Порт") тогда
		Параметры.Вставить("Порт", 	  ВсеПараметры.Порт);
	иначе
		//Сообщить("Укажите номер порта");
		//Возврат;
	КонецЕсли;
	
	Если ЗначениеНеЗаполнено(млТерминалМодель.ОбработкаОбслуживания) Тогда
		Сообщить("Терминал сбора данных """ + млТерминалМодель.Наименование + """: ошибка", СтатусСообщения.Важное);
		Сообщить("    Не заполнено поле ""Обработка обслуживания""", СтатусСообщения.БезСтатуса);
		Возврат;                                                                                               
	КонецЕсли;

	ФормаОбработки = ПолучитьФормуОбработки(млТерминалМодель.ОбработкаОбслуживания);
	ФормаОбработки.ВыполнитьОперацию("Подключить", Параметры, Ответ);

	Параметры.Свойство("Объект" , Объект );

	Если ПустаяСтрока(Ответ) Тогда
		НовыйТерминалСбораДанных = млТерминал.Добавить();
		НовыйТерминалСбораДанных.Объект  = Объект;
		НовыйТерминалСбораДанных.Модель  = Модель;
		НовыйТерминалСбораДанных.НомерЛУ = НомерЛУ;
	Иначе
		Сообщить("Терминал сбора данных """ + Модель.Наименование + """: ошибка при подключении", СтатусСообщения.Важное);
		Сообщить("    " + Ответ, СтатусСообщения.БезСтатуса);
	КонецЕсли;
КонецПроцедуры // ПодключитьТерминалСбораДанных()

// Отключение терминала сбора данных
//
// Параметры:
//  СтрокаТаблицыТерминала - строка таблицы подключенных терминалов
//
Процедура ОтключитьТерминалСбораДанных(СтрокаТаблицыТерминала)
	Перем Ответ;

	Если СтрокаТаблицыТерминала <> Неопределено Тогда

		Параметры = Новый Структура();
		Параметры.Вставить("Объект" , СтрокаТаблицыТерминала.Объект );
		Параметры.Вставить("НомерЛУ", СтрокаТаблицыТерминала.НомерЛУ);

		Если ЗначениеНеЗаполнено(СтрокаТаблицыТерминала.Модель.ОбработкаОбслуживания) Тогда
			Сообщить("Терминал сбора данных """ + СтрокаТаблицыТерминала.Модель.Наименование + """: ошибка", СтатусСообщения.Важное);
			Сообщить("    Не заполнено поле ""Обработка обслуживания""", СтатусСообщения.БезСтатуса);
			Возврат;
		КонецЕсли;

		ФормаОбработки = ПолучитьФормуОбработки(СтрокаТаблицыТерминала.Модель.ОбработкаОбслуживания);
		ФормаОбработки.ВыполнитьОперацию("Отключить", Параметры, Ответ);

		Если Не ПустаяСтрока(Ответ) Тогда
			Сообщить("Терминал сбора данных """ + СтрокаТаблицыТерминала.Модель.Наименование + """: ошибка при отключении", СтатусСообщения.Важное);
			Сообщить("    " + Ответ, СтатусСообщения.БезСтатуса);
		КонецЕсли;
		млТерминал.Удалить(СтрокаТаблицыТерминала);

	КонецЕсли;

КонецПроцедуры // ОтключитьТерминалСбораДанных()

// Загружает параметры по умолчанию для заданного терминала сбора данных
//
// Параметры
//  Терминал  –    терминал, значения для которого загружаются
//  Формат    –    формат данных
//  Таблица   -    номер используемой таблицы
Процедура ТСДПолучитьПараметрыПоУмолчанию(Терминал, Формат, Таблица) Экспорт
	Перем ДефЗначения;
	Перем Отбор;
	Перем РезультатОтбора;
	
	Формат = Неопределено;
	Таблица = Неопределено;
	Попытка
		ДефЗначения = ВосстановитьЗначение("ТСДНастройкиПоУмолчанию");
		Если ДефЗначения <> Неопределено Тогда
			Отбор = Новый Структура();
			Отбор.Вставить("Терминал", Терминал);
			РезультатОтбора = ДефЗначения.НайтиСтроки(Отбор);
			Если РезультатОтбора.Количество() > 0 Тогда
				Формат = РезультатОтбора[0].Формат;
				Таблица = РезультатОтбора[0].Таблица;
			КонецЕсли;
		КонецЕсли;		
	Исключение
		Формат = Неопределено;
		Таблица = Неопределено;
	КонецПопытки;
КонецПроцедуры // ТСДПолучитьПараметрыПоУмолчанию()

// Сохраняет параметры по умолчанию для заданного терминала сбора данных
//
// Параметры
//  Терминал  –    терминал, значения для которого сохраняются
//  Формат    –    формат данных
//  Таблица   -    номер используемой таблицы
Процедура ТСДСохранитьПараметрыПоУмолчанию(Терминал, Формат, Таблица) Экспорт
	Перем ДефЗначения;
	Перем Отбор;
	
	Попытка
		ДефЗначения = ВосстановитьЗначение("ТСДНастройкиПоУмолчанию");
		Если ДефЗначения = Неопределено Тогда
			ДефЗначения = Новый ТаблицаЗначений();
			ДефЗначения.Колонки.Добавить("Терминал", 
										 Новый ОписаниеТипов("СправочникСсылка.ТорговоеОборудование"));
			ДефЗначения.Колонки.Добавить("Формат",
										 Новый ОписаниеТипов("СправочникСсылка.ТСДФорматыДанных"));
			ДефЗначения.Колонки.Добавить("Таблица",
										 Новый ОписаниеТипов("Число"));
		КонецЕсли;
		Отбор = Новый Структура();
		Отбор.Вставить("Терминал", Терминал);
		РезультатОтбора = ДефЗначения.НайтиСтроки(Отбор);
		Если РезультатОтбора.Количество() > 0 Тогда
			РезультатОтбора[0].Формат = Формат;
			РезультатОтбора[0].Таблица = Таблица;
		Иначе
			РезультатОтбора = ДефЗначения.Добавить();
			РезультатОтбора.Терминал = Терминал;
			РезультатОтбора.Формат = Формат;
			РезультатОтбора.Таблица = Таблица;
		КонецЕсли;
		СохранитьЗначение("ТСДНастройкиПоУмолчанию", ДефЗначения);
	Исключение
	КонецПопытки;
КонецПроцедуры // ТСДСохранитьПараметрыПоУмолчанию()

// Функция возвращает формат выгрузки, заданный в настройках пользователя
//
// Параметры
//  Нет
// Возвращаемое значение:
//   <СправочникСсылка.ТСДФорматыДанных> – формат выгрузки
//
Функция ТСДПолучитьТекущийФорматВыгрузки()

	Перем Запрос;
	Перем РезультатЗапроса;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиПользователей.Значение КАК ТекущийФормат
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	|ГДЕ
	|	  НастройкиПользователей.Пользователь = &ТекущийПользователь
	|	И НастройкиПользователей.Настройка = &Настройка");
	Запрос.УстановитьПараметр("ТекущийПользователь", глТекущийПользователь);
	Запрос.УстановитьПараметр(
		"Настройка",
		ПланыВидовХарактеристик.НастройкиПользователей.ФорматДанныхТСД);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат ?(РезультатЗапроса.Количество() = 0,
			  Справочники.ТСДФорматыДанных.ПустаяСсылка(),
			  РезультатЗапроса[0].ТекущийФормат);
			  
КонецФункции // ТСДПолучитьТекущийФорматВыгрузки()

// Функция возвращает таблицу ТСД, заданную в настройках пользователя
//
// Параметры
//  Нет
//
// Возвращаемое значение:
//   <Число> – номер таблицы ТСД
//
Функция ТСДПолучитьТекущуюТаблицу()

	Перем Запрос;
	Перем РезультатЗапроса;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиПользователей.Значение КАК ТекущаяТаблица
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	|ГДЕ
	|	  НастройкиПользователей.Пользователь = &ТекущийПользователь
	|	И НастройкиПользователей.Настройка = &Настройка");
	Запрос.УстановитьПараметр("ТекущийПользователь", глТекущийПользователь);
	Запрос.УстановитьПараметр(
		"Настройка",
		ПланыВидовХарактеристик.НастройкиПользователей.ТаблицаТСД);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат ?(РезультатЗапроса.Количество() = 0,
			  0,
			  РезультатЗапроса[0].ТекущаяТаблица);

КонецФункции // ТСДПолучитьТекущуюТаблицу()

// Функция осуществляет настройку процедуры обмена данными с ТСД и, 
// собственно, загрузку данных
//
// Параметры
//  Данные    - <ТаблицаЗначений>
//            - данные, загруженные из ТСД
//
// Возвращаемое значение:
//   <Строка> – описание произошедшей ошибки, либо "" в случае успеха
//
Функция ТСДЗагрузитьДанные(Данные) Экспорт
	
	Перем Текст;
	Перем ФормаЗагрузки;
	Перем КоличествоТСД;
	Перем ТаблицаТСД;
	Перем ФорматТСД;
	Перем ДанныеТСД;
	Перем ИндексШК;
	Перем ИндексКВ;
	Перем СтрокаДанныхТСД;
	Перем СтрокаДанных;
	Перем ТСД;
	
	Текст  = "";
	Данные = Новый ТаблицаЗначений();
	Данные.Колонки.Добавить(
		"ШтрихКод",
		Новый ОписаниеТипов("Строка"));
	Данные.Колонки.Добавить(
		"Количество",
		Новый ОписаниеТипов("Число",
							Новый КвалификаторыЧисла(
								10,
								3,
								ДопустимыйЗнак.Неотрицательный)));
								
	КоличествоТСД = млТерминал.Количество();
	Если КоличествоТСД = 0 Тогда
		Текст = "Терминал сбора данных не подключен";
		Возврат Текст;
	КонецЕсли;
	
	ФорматТСД      = ТСДПолучитьТекущийФорматВыгрузки();
	ТаблицаТСД     = ТСДПолучитьТекущуюТаблицу();
	ФормаЗагрузки  = ПолучитьФорму("ТСДЗагрузкаДанных");
	
	Если (ЗначениеНеЗаполнено(ФорматТСД)) Или (КоличествоТСД > 1) Тогда
		ДанныеТСД = ФормаЗагрузки.ОткрытьМодально();
	Иначе
		ТСД   = Новый Структура();
		ТСД.Вставить("Модель",  млТерминал[0].Модель);
		ТСД.Вставить("НомерЛУ", млТерминал[0].НомерЛУ);
		ТСД.Вставить("Объект",  млТерминал[0].Объект);
		Текст = ФормаЗагрузки.ТСДЗагрузитьДанные(ТСД,
		                                         ТаблицаТСД,
												 ФорматТСД,
												 ДанныеТСД);
	КонецЕсли;

	Если Текст = "" Тогда
		Если ДанныеТСД <> Неопределено Тогда
			ИндексШК = ДанныеТСД.Колонки.Найти(
				ФормаЗагрузки.ПолучитьНазваниеКолонки(Перечисления.ТСДПоляДанных.ШтрихКод));
			ИндексШК = ?(ИндексШК = Неопределено,
						 -1,
						 ДанныеТСД.Колонки.Индекс(ИндексШК));
			ИндексКВ = ДанныеТСД.Колонки.Найти(
				ФормаЗагрузки.ПолучитьНазваниеКолонки(Перечисления.ТСДПоляДанных.КоличествоНаСкладе));
			ИндексКВ = ?(ИндексКВ = Неопределено,
						 -1,
						 ДанныеТСД.Колонки.Индекс(ИндексКВ));
						 
			Если ИндексШК = -1 Тогда
				Текст = "Выбранный формат данных не учитывает штрих-код товара";
			Иначе
				Для Каждого СтрокаДанныхТСД Из ДанныеТСД Цикл
					СтрокаДанных = Данные.Добавить();
					СтрокаДанных.ШтрихКод   = СтрокаДанныхТСД[ИндексШК];
					СтрокаДанных.Количество = ?(ИндексКВ = -1,
												1,
												СтрокаДанныхТСД[ИндексКВ]);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Текст;

КонецФункции // ТСДЗагрузитьДанные()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБЩЕГО НАЗНАЧЕНИЯ

// Получить форму обработки торгового оборудования
//
// Параметры:
//  Значение     - ссылка на Перечиление.ОбработкаТорговогоОборудования
//
// Возвращаемое значение:
//  форма обработки "ТорговоеОборудование"
//
Функция ПолучитьФормуОбработки(Значение) Экспорт

	Если ЗначениеНеЗаполнено(Значение) Тогда
		Возврат Неопределено;
	Иначе
		ИндексЗначения 		= Перечисления.ОбработкиТорговогоОборудования.Индекс(Значение);
		ИмяФормыОбработки 	= Значение.Метаданные().ЗначенияПеречисления.Получить(ИндексЗначения).Имя;		
		ФормаОбработки 		= ЭтотОбъект.ПолучитьФорму(Строка(ИмяФормыОбработки),,);
	КонецЕсли;

	Возврат ФормаОбработки;

КонецФункции // ПолучитьФормуОбработки()

// Подключает торговое оборудование
//
Процедура ПодключитьОборудование() Экспорт
	Перем Параметр1, Параметр2, Параметр3, Параметр4;
		
	ИмяТекущегоКомпьютера = Врег(ИмяКомпьютера());

	ТорговоеОборудование = РегистрыСведений.ТорговоеОборудование;
	Оборудование = ТорговоеОборудование.Выбрать();
	Пока Оборудование.Следующий() Цикл
		//крохин начало 29.07.2020
		//Для Иркутска у каждого пользователя своё ТО
		//Если Оборудование.Компьютер <> ИмяТекущегоКомпьютера Тогда
		Если ПараметрыСеанса.ЭтотУзел.Код = "IRK" Тогда
			ПроверяемыйПараметр = ИмяТекущегоКомпьютера + СокрЛП(ПараметрыСеанса.Пользователь);
		Иначе
			ПроверяемыйПараметр = ИмяТекущегоКомпьютера;
		КонецЕсли;
		Если Оборудование.Компьютер <> ПроверяемыйПараметр Тогда
		//крохин конец 29.07.2020	

			Продолжить;

		ИначеЕсли НЕ(Оборудование.Подключено) Тогда

			Продолжить;

		Иначе

			Параметры = ЗначениеИзСтрокиВнутр(Оборудование.Параметры);
			
			Если Оборудование.МодельТорговогоОборудования.ВидТорговогоОборудования = Перечисления.ВидыТорговогоОборудования.ФискальныйРегистратор Тогда
				
				ПарольАдминистратора = "30";
				ПарольПользователя	 = "30";
				Параметры.Свойство("ДляПриемаНаличныхОтЮрЛиц"  , Параметр3);
				
				ПодключитьФР(Оборудование.МодельТорговогоОборудования,Оборудование.НомерЛогическогоУстройства, Параметр3, Оборудование.КассаККМ,Параметры);
			ИначеЕсли Оборудование.МодельТорговогоОборудования.ВидТорговогоОборудования = Перечисления.ВидыТорговогоОборудования.СканерШтрихКода Тогда
			
				Параметры.Свойство("Порт"	                   , Параметр1);
				Параметры.Свойство("Префикс"                   , Параметр2);
				ПодключитьСШК(Оборудование.МодельТорговогоОборудования, Параметр2, Оборудование.НомерЛогическогоУстройства,Параметр1,Параметры);

			ИначеЕсли Оборудование.МодельТорговогоОборудования.ВидТорговогоОборудования = Перечисления.ВидыТорговогоОборудования.РидерМагнитныхКарт Тогда
				
				Параметры.Свойство("ИсточникДанных"                   , Параметр1);
				ПодключитьРМК(Оборудование.МодельТорговогоОборудования, Параметр1, Оборудование.НомерЛогическогоУстройства);

			ИначеЕсли Оборудование.МодельТорговогоОборудования.ВидТорговогоОборудования = Перечисления.ВидыТорговогоОборудования.ККМOnLine Тогда
				
				Параметры.Свойство("ЗаводскойНомерККМ"         , Параметр1);
				ПодключитьККМOnLine(Оборудование.МодельТорговогоОборудования, Параметр1, Оборудование.КассаККМ);

			ИначеЕсли Оборудование.МодельТорговогоОборудования.ВидТорговогоОборудования = Перечисления.ВидыТорговогоОборудования.ККМOffLine Тогда
				
				Параметры.Свойство("КаталогОбменаДанными"      , Параметр1);
				Параметры.Свойство("Адрес"                     , Параметр2);
				Параметры.Свойство("Порт"                      , Параметр3);
				ПодключитьККМOffLine(Оборудование.МодельТорговогоОборудования, Параметр1, Оборудование.НомерЛогическогоУстройства, Оборудование.КассаККМ, Параметр2, Параметр3);

			ИначеЕсли Оборудование.МодельТорговогоОборудования.ВидТорговогоОборудования = Перечисления.ВидыТорговогоОборудования.ЭлектронныеВесы Тогда

				ПодключитьВесы(Оборудование.МодельТорговогоОборудования, Оборудование.НомерЛогическогоУстройства);

			ИначеЕсли Оборудование.МодельТорговогоОборудования.ВидТорговогоОборудования = Перечисления.ВидыТорговогоОборудования.ДисплейПокупателя Тогда
				
				Параметры.Свойство("ИнформационнаяСтрока1"     , Параметр1);
				Параметры.Свойство("ИнформационнаяСтрока2"     , Параметр2);
				Параметры.Свойство("БегущаяСтрока"             , Параметр3);
				ПодключитьДисплейПокупателя(Оборудование.МодельТорговогоОборудования, Параметр1, Параметр2, Оборудование.НомерЛогическогоУстройства, Параметр3, Оборудование.КассаККМ);

			ИначеЕсли Оборудование.МодельТорговогоОборудования.ВидТорговогоОборудования = Перечисления.ВидыТорговогоОборудования.ТерминалСбораДанных Тогда

				ПодключитьТерминалСбораДанных(Оборудование.МодельТорговогоОборудования, Оборудование.НомерЛогическогоУстройства,Параметры);

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // ПодключитьОборудование()

// Отключает торговое оборудование
//
Процедура ОтключитьОборудование() Экспорт

	Если млФР <> Неопределено Тогда
		Пока млФР.Количество() > 0 Цикл
			ОтключитьФР(млФР[0]);
		КонецЦикла;
	КонецЕсли;

	Если млСШК <> Неопределено Тогда
		Пока млСШК.Количество() > 0 Цикл
			ОтключитьСШК(млСШК[0]);
		КонецЦикла;
	КонецЕсли;

	Если млРМК <> Неопределено Тогда
		Пока млРМК.Количество() > 0 Цикл
			ОтключитьРМК(млРМК[0]);
		КонецЦикла;
	КонецЕсли;

	Если млККМOnLine <> Неопределено Тогда
		Пока млККМOnLine.Количество() > 0 Цикл
			ОтключитьККМOnLine(млККМOnLine[0]);
		КонецЦикла;
	КонецЕсли;

	Если млККМOffLine <> Неопределено Тогда
		Пока млККМOffLine.Количество() > 0 Цикл
			ОтключитьККМOffLine(млККМOffLine[0]);
		КонецЦикла;
	КонецЕсли;

	Если млВесы <> Неопределено Тогда
		Пока млВесы.Количество() > 0 Цикл
			ОтключитьВесы(млВесы[0]);
		КонецЦикла;
	КонецЕсли;

	Если млДП <> Неопределено Тогда
		Пока млДП.Количество() > 0 Цикл
			ОтключитьДисплейПокупателя(млДП[0]);
		КонецЦикла;
	КонецЕсли;

	Если млТерминал <> Неопределено Тогда
		Пока млТерминал.Количество() > 0 Цикл
			ОтключитьТерминалСбораДанных(млТерминал[0]);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры // ОтключитьОборудование()

// Удаляет из переданного штрих-кода префикс
//
// Параметры:
//  Штрихкод     - штрих-код (с префиксом)
//
// Возвращаемое значение:
//  Штрих-код без префикса
//
Функция УдалитьПрефиксИзШтрихКода(ШтрихКод) Экспорт

	Штрихкод = СокрЛП(Штрихкод);
	Префиксы = СокрЛП(Константы.ВозможныеПрефиксыШтрихКода.Получить());

	// Определение типа штрих-кода
	Если Не ПустаяСтрока(Префиксы) 
	   И Найти(Префиксы, Лев(Штрихкод,1)) > 0 Тогда

		// Удаляем спец. символы из штрих-кода
		Штрихкод = Сред(Штрихкод, 2);

	КонецЕсли;

	Возврат ШтрихКод;

КонецФункции

// По переданному штрих-коду ищет товар и единицу измерения.
//
// Параметры:
//  Штрихкод        - штрих-код искомого товара
//  ТаблицаТоваров  - возвращаемая таблица товаров
//
// Возвращаемое значение:
//  Истина если товар найден, иначе Ложь
//
Функция ПолучитьТоварПоШтрихкоду(Штрихкод, ТаблицаТоваров) Экспорт

	Возврат ПолучитьВладельцаПоШтрихкоду(Штрихкод, ТаблицаТоваров, "Номенклатура");

КонецФункции // ПолучитьТоварПоШтрихкоду()

// Функция осуществляет поиск владельца штрих-кода (информационная карта,
// весовой или штучный товар). Подразумевается, что тип штрих-кода
// весового товара - EAN13 и этот штрих-код начинается с префикса
// штрих-кода весового товара.
//
// Параметры
//  ШтрихКод          – <Строка>
//                    - штрих-код, поиск владельца которого производится
//
//  ТаблицаВладельцев - <ТаблицаЗначений>
//                    - выходной параметр; таблица, содержащая данные о
//                      владельцах штрих-кода
//
//  ВидВладельца      - <Строка>
//                    - имя колонки в таблице ТаблицаВладельцев, которая
//                      будет содержать ссылку на владельца штрих-кода
//
// Возвращаемое значение:
//  <Булево>          – Истина, если владелец найден
//
Функция ПолучитьВладельцаПоШтрихкоду(ШтрихКод, ТаблицаВладельцев, ВидВладельца) Экспорт

	Перем ШтрихКодБП;
	Перем Результат;
	Перем ПрефиксВесовогоТовара;
	Перем ДлинаКодаТовара;
	Перем КодТовара;
	Перем КоличествоТовара;
	Перем Запрос;
	
	Результат = Ложь;
	//
	//Если Не ЗначениеНеЗаполнено(ШтрихКод) Тогда
	//	
	//	ПрефиксВесовогоТовара = Константы.ПрефиксВесовогоТовара.Получить();
	//	ДлинаКодаТовара = Константы.ДлинаКодаВесовогоТовара.Получить();
	//	ШтрихКодБП = УдалитьПрефиксИзШтрихКода(ШтрихКод);
	//	
	//	Если Не ЗначениеНеЗаполнено(ПрефиксВесовогоТовара) И Не ЗначениеНеЗаполнено(ДлинаКодаТовара) Тогда
	//		Если ПроверитьШтрихКод(ШтрихКодБП, ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13) 
	//			И Лев(ШтрихКодБП, 2) = "2" + ПрефиксВесовогоТовара Тогда
	//			КодТовара = Лев(Прав(ШтрихКодБП, 11), ДлинаКодаТовара);
	//			КоличествоТовара = Прав(Лев(ШтрихКодБП, 12), 10 - ДлинаКодаТовара);
	//			Запрос = Новый Запрос(
	//			"ВЫБРАТЬ
	//  	 		|	&Штрихкод КАК ШтрихКод,
	//  	 		|	КодыВесовогоТовара.Номенклатура КАК " + ВидВладельца + ",
	//  	 		|	Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	//  	 		|	КодыВесовогоТовара.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//  	 		|	КодыВесовогоТовара.СерияНоменклатуры КАК СерияНоменклатуры,
	//			|   ВЫБОР
	//			|		КОГДА КодыВесовогоТовара.Качество = &НетКачества ТОГДА
	//			|			&Новый
	//			|		ИНАЧЕ
	//			|			КодыВесовогоТовара.Качество
	//			|   КОНЕЦ КАК Качество,
	//  	 		|	" + КоличествоТовара + " / 1000 КАК Количество
	//  	 		|ИЗ
	//  	 		|	РегистрСведений.КодыВесовогоТовара КАК КодыВесовогоТовара
	//			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	//			|		Справочник.Номенклатура КАК Номенклатуры
	//			|		ПО КодыВесовогоТовара.Номенклатура = Номенклатуры.Ссылка
	//  	 		|ГДЕ
	//			|	КодыВесовогоТовара.Код = " + КодТовара);
	//			Запрос.УстановитьПараметр("Штрихкод", ШтрихКодБП);
	//			Запрос.УстановитьПараметр("НетКачества", Справочники.Качество.ПустаяСсылка());
	//			Запрос.УстановитьПараметр("Новый", Справочники.Качество.Новый);
	//			ТаблицаВладельцев = Запрос.Выполнить().Выгрузить();
	//			Результат = (ТаблицаВладельцев.Количество() > 0);
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//	Если Не Результат Тогда
	//		Запрос = Новый Запрос(
	//		"ВЫБРАТЬ
	//		|	Штрихкоды.Штрихкод,
	//		|	Штрихкоды.Владелец КАК " + ВидВладельца + "
	//		|" + ?(ВидВладельца = "Номенклатура", ",
	//		|	Штрихкоды.ЕдиницаИзмерения,
	//		|	Штрихкоды.ХарактеристикаНоменклатуры,
	//		|	Штрихкоды.СерияНоменклатуры,
	//		|	ВЫБОР
	//		|		КОГДА Штрихкоды.Качество = &НетКачества ТОГДА
	//		|			&Новый
	//		|		ИНАЧЕ
	//		|			Штрихкоды.Качество
	//		|	КОНЕЦ КАК Качество,
	//		|	1 КАК Количество,
	//		|	Номенклатура.Весовой","") + "
	//		|ИЗ
	//		|	РегистрСведений.Штрихкоды КАК Штрихкоды" + ?(ВидВладельца = "Номенклатура", "
	//		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	//		|		Справочник.Номенклатура КАК Номенклатура
	//		|		ПО (Штрихкоды.Владелец = Номенклатура.Ссылка)", "") + "
	//		|ГДЕ
	//		|	Штрихкоды.Штрихкод = &Штрихкод");
	//		Запрос.УстановитьПараметр("НетКачества", Справочники.Качество.ПустаяСсылка());
	//		Запрос.УстановитьПараметр("Новый", Справочники.Качество.Новый);
	//		Запрос.УстановитьПараметр("Штрихкод", ШтрихКодБП);
	//		ТаблицаВладельцев = Запрос.Выполнить().Выгрузить();
	//		Результат = (ТаблицаВладельцев.Количество() > 0);
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Если Не Результат Тогда
	//	Сообщить("Владелец штрих-кода " + ШтрихКодБП + " не найден.");
	//КонецЕсли;

	Возврат Результат;
	
КонецФункции // ПолучитьВладельцаПоШтрихкоду()

// Дополняет передаваемую строку Строка символами Символ до строки длиной Длина слева
//
// Параметры:
//  Строка       - строка, к которой надо добавить символы
//  Символ       - добавляемый символ
//  Длина        - длина результирующей строки
//
// Возвращаемое значение:
//  строка
//
Функция ДополнитьСтрокуЛ(Строка, Символ, Длина) Экспорт

	Добавить = Длина - СтрДлина(Строка);
	ВозвращаемаяСтрока = Строка;
	Для а = 1 По Добавить Цикл
		ВозвращаемаяСтрока = Символ + ВозвращаемаяСтрока;
	КонецЦикла;

	Возврат ВозвращаемаяСтрока;

КонецФункции // ДополнитьСтрокуЛ()

// Процедура обрабатывает внешнее событие формы
//
// Параметры:
//  Форма                       - форма документа, в которую пришло событие от сканера штрих-кодов
//  ДокументОбъект              - объект документа, в форму которого пришло событие от сканера штрих-кодов
//  СтруктураИсходныхПараметров - структура параметров, переданных из формы
//  Данные                      - данные со сканера штрих-кодов
//
Процедура ОбработатьВнешнееСобытиеОтСканераДляФормы(Форма, ДокументОбъект, СтруктураИсходныхПараметров, Данные, СвернутьПоВладельцу = Ложь) Экспорт
	//Перем ТаблицаТоваров, ТаблицаВладельцев, ТаблицаПодбора;
	//Перем Команда, ТипЦен, ВалютаЦены, ИмяТабличнойЧасти;
	//Перем КоличествоПовторов;

	//МетаданныеДокумента = ДокументОбъект.Метаданные();
	//// Оповестим о выборе документ, инициировавший подбор.
	//СтруктураИсходныхПараметров.Свойство("Команда",           Команда);
	//СтруктураИсходныхПараметров.Свойство("ТипЦен",            ТипЦен);
	//СтруктураИсходныхПараметров.Свойство("ВалютаЦены",        ВалютаЦены);
	//СтруктураИсходныхПараметров.Свойство("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
	//СтруктураИсходныхПараметров.Свойство("КоличествоПовторов", КоличествоПовторов);
	//
	//КоличествоПовторов = ?(ЗначениеНеЗаполнено(КоличествоПовторов), 1, КоличествоПовторов);

	//Попытка
	//	ДокументОбъект.Заблокировать();
	//Исключение
	//	Предупреждение("Не удалось заблокировать запись. Действие (изменение, удаление или блокировка записи) не выполнено");
	//	СканерПосылкаДанных(1);
	//	Возврат;
	//КонецПопытки;

	//Если Форма.ТолькоПросмотр Тогда

	//	//Ничего не делаем. Форма открыта для просмотра.

	//ИначеЕсли Команда = "Регистрация" Тогда
	//	Если ПолучитьВладельцаПоШтрихкоду(Данные, ТаблицаВладельцев, "Пользователь") Тогда
	//		Карта = ТаблицаВладельцев[0].Пользователь;
	//		Если Карта <> Неопределено Тогда

	//			Если Карта.ТипКарты = Перечисления.ТипыИнформационныхКарт.Дисконтная Тогда
	//				Форма.ДисконтнаяКарта = Карта;
	//				СтруктураИсходныхПараметров.Команда = "РассчитатьДисконтныеСкидки";
	//			Иначе
	//				Если СтруктураИсходныхПараметров.Свойство("Пользователь") Тогда
	//					Если Карта.ВладелецКарты = Неопределено
	//					 Или Карта.ВладелецКарты = Справочники.Пользователи.ПустаяСсылка() Тогда

	//						СообщитьОбОшибке("Карте с кодом: " + Данные + ", не назначен владелец");

	//					Иначе

	//						СтруктураИсходныхПараметров.Пользователь = Карта.ВладелецКарты;

	//					КонецЕсли;

	//				КонецЕсли;
	//			КонецЕсли;

	//		Иначе

	//			СообщитьОбОшибке("Штрихкоду: """ + Данные + " не указана карта");

	//		КонецЕсли;
	//	Иначе

	//		СообщитьОбОшибке("Пользователь не найден");

	//	КонецЕсли;

	//Иначе

	//	ТаблицаПодбора = Новый ТаблицаЗначений;

	//	ТаблицаПодбора.Колонки.Добавить("Номенклатура");
	//	ТаблицаПодбора.Колонки.Добавить("Цена");
	//	ТаблицаПодбора.Колонки.Добавить("ВалютаЦены");
	//	ТаблицаПодбора.Колонки.Добавить("Количество");
	//	ТаблицаПодбора.Колонки.Добавить("ЕдиницаИзмерения");
	//	ТаблицаПодбора.Колонки.Добавить("Характеристика");
	//	ТаблицаПодбора.Колонки.Добавить("Серия");
	//	ТаблицаПодбора.Колонки.Добавить("Качество");
	//	ТаблицаПодбора.Колонки.Добавить("Команда");
	//	ТаблицаПодбора.Колонки.Добавить("Штрихкод");

	//	Если ПолучитьТоварПоШтрихкоду(Данные, ТаблицаТоваров) Тогда

	//		//Если первый владелец этого штрихкода - информационная карта - заполняем по ней и заканчиваем обработку.
	//		Если ТаблицаТоваров.Количество() > 0 Тогда
	//			Владелец = ТаблицаТоваров[0].Номенклатура;
	//			Если ТипЗнч(Владелец) = Тип("СправочникСсылка.ИнформационныеКарты") Тогда
	//				МетаданныеДокумента = ДокументОбъект.Метаданные();
	//				Если НЕ ЕстьРеквизитДокумента("ДисконтнаяКарта", МетаданныеДокумента) Тогда
	//					СканерПосылкаДанных(1);
	//					Возврат;
	//				КонецЕсли;

	//				Карта = Владелец;
	//				Если Карта <> Неопределено Тогда

	//					Если Карта.ТипКарты = Перечисления.ТипыИнформационныхКарт.Дисконтная Тогда
	//						Форма.ДисконтнаяКарта = Карта;
	//						СтруктураИсходныхПараметров.Команда = "РассчитатьДисконтныеСкидки";
	//					Иначе
	//						Если СтруктураИсходныхПараметров.Свойство("Пользователь") Тогда
	//							Если Карта.ВладелецКарты = Неопределено
	//							 Или Карта.ВладелецКарты = Справочники.Пользователи.ПустаяСсылка() Тогда

	//								СообщитьОбОшибке("Карте с кодом: " + Данные + ", не назначен владелец");

	//							Иначе

	//								СтруктураИсходныхПараметров.Пользователь = Карта.ВладелецКарты;

	//							КонецЕсли;

	//						КонецЕсли;
	//					КонецЕсли;

	//				Иначе

	//					СообщитьОбОшибке("Штрихкоду: """ + Данные + " не указана карта");

	//				КонецЕсли;
	//				СканерПосылкаДанных(1);
	//				Возврат;
	//			КонецЕсли;
	//		КонецЕсли;

	//		СтруктураПодбора = Неопределено;
	//		Для каждого СтрокаТаблицыТоваров Из ТаблицаТоваров Цикл

	//			Штрихкод           = СтрокаТаблицыТоваров.Штрихкод;
	//			ВремТовар          = СтрокаТаблицыТоваров.Номенклатура;
	//			ВремЕдиница        = СтрокаТаблицыТоваров.ЕдиницаИзмерения;
	//			ВремХарактеристика = СтрокаТаблицыТоваров.ХарактеристикаНоменклатуры;
	//			ВремСерия          = СтрокаТаблицыТоваров.СерияНоменклатуры;
	//			ВремКачество       = СтрокаТаблицыТоваров.Качество;
	//			ВремКоличество     = СтрокаТаблицыТоваров.Количество * КоличествоПовторов;

	//			Если ИмяТабличнойЧасти = "Товары"
	//			 Или ИмяТабличнойЧасти = "Комплектующие" Тогда

	//				Если ВремКачество <> Справочники.Качество.Новый Тогда
	//					Если (ТипЗнч (ДокументОбъект) = Тип("ДокументОбъект.РеализацияТоваровУслуг")
	//						  И ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия)
	//					 Или (ТипЗнч (ДокументОбъект) = Тип("ДокументОбъект.ПриходныйОрдерНаТовары")
	//						  И ДокументОбъект.ВидОперации <> Перечисления.ВидыОперацийПриходныйОрдер.Перемещение) Тогда
	//						СообщитьОбОшибке("В документ """ + МетаданныеДокумента + """ с видом операции """ + ДокументОбъект.ВидОперации
	//										 + """ можно добавлять только товарные позиции с качеством ""Новый""."
	//										 + Символы.ПС + "Считанный штрих-код соответствует качеству """ + ВремКачество + """ товара """ + ВремТовар.Наименование + """."
	//										 + Символы.ПС + "Товарная позиция в документ не добавлена!");
	//						Продолжить;

	//					ИначеЕсли НЕ ЕстьРеквизитТабЧастиДокумента("Качество", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
	//						СообщитьОбОшибке("В документ """ + МетаданныеДокумента + """ можно добавлять только товарные позиции с качеством ""Новый""."
	//										 + Символы.ПС + "Считанный штрих-код соответствует качеству """ + ВремКачество + """ товара """ + ВремТовар.Наименование + """."
	//										 + Символы.ПС + "Товарная позиция в документ не добавлена!");
	//						Продолжить;
	//					КонецЕсли;
	//				КонецЕсли;
	//			КонецЕсли;

	//			Если ВремТовар.Набор Тогда

	//				Запрос = Новый Запрос;
	//				
	//				Запрос.УстановитьПараметр("Номенклатура",               ВремТовар);
	//				Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	//				Запрос.УстановитьПараметр("ЕдиницаИзмерения",           ВремЕдиница);
	//				Запрос.УстановитьПараметр("Коэффициент",                ВремЕдиница.Коэффициент);
	//				Запрос.УстановитьПараметр("Количество",                 ВремКоличество);
	//				Запрос.Текст = "
	//				|ВЫБРАТЬ
	//				|	КомплектующиеНоменклатуры.Комплектующая                             КАК Номенклатура,
	//				|	КомплектующиеНоменклатуры.ХарактеристикаКомплектующей               КАК Характеристика,
	//				|	(КомплектующиеНоменклатуры.Количество * &Коэффициент * &Количество) КАК Количество,
	//				|	КомплектующиеНоменклатуры.ЕдиницаИзмерения
	//				|ИЗ
	//				|	РегистрСведений.КомплектующиеНоменклатуры КАК КомплектующиеНоменклатуры
	//				|
	//				|ГДЕ
	//				|	КомплектующиеНоменклатуры.Номенклатура = &Номенклатура И
	//				|	КомплектующиеНоменклатуры.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	//				|";
	//				
	//				Выборка = Запрос.Выполнить().Выбрать();
	//				
	//				Пока Выборка.Следующий() Цикл

	//					// Получим Цену
	//					Цена = 0;
	//					Если СтруктураИсходныхПараметров.Свойство("ТипЦен") Тогда
	//						Если ТипЗнч(СтруктураИсходныхПараметров.ТипЦен) = Тип("СправочникСсылка.ТипыЦенНоменклатуры") Тогда
	//							Цена = ПолучитьЦенуНоменклатуры(Выборка.Номенклатура, , СтруктураИсходныхПараметров.ТипЦен, СтруктураИсходныхПараметров.ДатаРасчетов, Выборка.ЕдиницаИзмерения, ВалютаЦены);
	//						ИначеЕсли ТипЗнч(СтруктураИсходныхПараметров.ТипЦен) = Тип("СправочникСсылка.ТипыЦенНоменклатурыКонтрагентов") Тогда
	//							Цена = ПолучитьЦенуКонтрагента(Выборка.Номенклатура, Выборка.Характеристика, СтруктураИсходныхПараметров.Контрагент,
	//														   СтруктураИсходныхПараметров.ТипЦен, СтруктураИсходныхПараметров.ДатаРасчетов, Выборка.ЕдиницаИзмерения, ВалютаЦены);
	//						КонецЕсли; 
	//					КонецЕсли;

	//					СтруктураПодбора = Новый Структура();
	//					СтруктураПодбора.Вставить("Команда",          Команда);
	//					СтруктураПодбора.Вставить("ВалютаЦены",       ВалютаЦены);
	//					СтруктураПодбора.Вставить("Номенклатура",     Выборка.Номенклатура);
	//					СтруктураПодбора.Вставить("ЕдиницаИзмерения", Выборка.ЕдиницаИзмерения);
	//					СтруктураПодбора.Вставить("Количество",       Выборка.Количество);
	//					СтруктураПодбора.Вставить("Характеристика"  , Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	//					СтруктураПодбора.Вставить("Серия"           , Справочники.СерииНоменклатуры.ПустаяСсылка());
	//					СтруктураПодбора.Вставить("Качество"        , Справочники.Качество.ПустаяСсылка());
	//					СтруктураПодбора.Вставить("Цена"            , Цена);
	//					Если СтруктураИсходныхПараметров.Свойство("Лимит") Тогда
	//						СтруктураПодбора.Вставить("Лимит"       , СтруктураИсходныхПараметров.Лимит);
	//					КонецЕсли;

	//					Форма.ОбработкаПодбора(ДокументОбъект[ИмяТабличнойЧасти], СтруктураПодбора);

	//				КонецЦикла;
	//				Прервать;
	//			Иначе

	//				// Получим Цену
	//				Цена = 0;
	//				Если СтруктураИсходныхПараметров.Свойство("ТипЦен") Тогда
	//					Если ТипЗнч(СтруктураИсходныхПараметров.ТипЦен) = Тип("СправочникСсылка.ТипыЦенНоменклатуры") Тогда
	//						Цена = ПолучитьЦенуНоменклатуры(ВремТовар,ВремХарактеристика , СтруктураИсходныхПараметров.ТипЦен, СтруктураИсходныхПараметров.ДатаРасчетов, ВремЕдиница, ВалютаЦены);
	//					ИначеЕсли ТипЗнч(СтруктураИсходныхПараметров.ТипЦен) = Тип("СправочникСсылка.ТипыЦенНоменклатурыКонтрагентов") Тогда
	//						Цена = ПолучитьЦенуКонтрагента(ВремТовар, ВремХарактеристика, СтруктураИсходныхПараметров.Контрагент,
	//													   СтруктураИсходныхПараметров.ТипЦен, СтруктураИсходныхПараметров.ДатаРасчетов, ВремЕдиница, ВалютаЦены);
	//					КонецЕсли; 
	//				КонецЕсли;

	//				СтруктураПодбора = Новый Структура();

	//				СтруктураПодбора.Вставить("Команда",          Команда);
	//				СтруктураПодбора.Вставить("ВалютаЦены",       ВалютаЦены);
	//				СтруктураПодбора.Вставить("Номенклатура",     ВремТовар);
	//				СтруктураПодбора.Вставить("ЕдиницаИзмерения", ВремЕдиница);
	//				СтруктураПодбора.Вставить("Количество",       ВремКоличество);
	//				СтруктураПодбора.Вставить("Характеристика"  , ВремХарактеристика);
	//				СтруктураПодбора.Вставить("Серия"           , ВремСерия);
	//				СтруктураПодбора.Вставить("Качество"        , ВремКачество);
	//				СтруктураПодбора.Вставить("Цена"            , Цена);

	//				СтрТаблицаПодбора = ТаблицаПодбора.Добавить();
	//				СтрТаблицаПодбора.Номенклатура = ВремТовар;
	//				СтрТаблицаПодбора.ЕдиницаИзмерения = ВремЕдиница;
	//				СтрТаблицаПодбора.Количество = ВремКоличество;
	//				СтрТаблицаПодбора.Характеристика = ВремХарактеристика;
	//				СтрТаблицаПодбора.Серия = ВремСерия;
	//				СтрТаблицаПодбора.Качество = ВремКачество;
	//				СтрТаблицаПодбора.Цена = Цена;
	//				СтрТаблицаПодбора.Команда = Команда;
	//				СтрТаблицаПодбора.ВалютаЦены = ВалютаЦены;
	//			КонецЕсли;
	//		КонецЦикла;
	//		Если СвернутьПоВладельцу Тогда
	//			ТаблицаПодбора.Свернуть("Номенклатура, ЕдиницаИзмерения");
	//		КонецЕсли;
	//		Если ТаблицаПодбора.Количество()=1 Тогда
	//			Если СвернутьПоВладельцу Тогда
	//				СтруктураПодбора.Вставить("Команда",          Команда);
	//				СтруктураПодбора.Вставить("Номенклатура",     ТаблицаПодбора[0].Номенклатура);
	//				ТекЕдиница = ?(ЗначениеНеЗаполнено(ТаблицаПодбора[0].ЕдиницаИзмерения),
	//							   ТаблицаПодбора[0].Номенклатура.ЕдиницаХраненияОстатков,
	//							   ТаблицаПодбора[0].ЕдиницаИзмерения);
	//				СтруктураПодбора.Вставить("ЕдиницаИзмерения", ТекЕдиница);
	//				СтруктураПодбора.Вставить("Количество",       ВремКоличество);
	//			КонецЕсли;
	//			Форма.ОбработкаПодбора(ДокументОбъект[ИмяТабличнойЧасти], СтруктураПодбора);
	//		ИначеЕсли ТаблицаПодбора.Количество()>1 Тогда

	//			//найдено несколько товаров, соответствущих штрихкоду
	//			СтрокаТовара = ТаблицаПодбора.ВыбратьСтроку("Выберите из найденных по штрихкоду.");
	//			Если СвернутьПоВладельцу Тогда
	//				СтруктураПодбора.Вставить("Команда",          Команда);
	//				СтруктураПодбора.Вставить("Номенклатура",     ТаблицаПодбора[0].Номенклатура);
	//				СтруктураПодбора.Вставить("ЕдиницаИзмерения", ТаблицаПодбора[0].Номенклатура.ЕдиницаХраненияОстатков);
	//				СтруктураПодбора.Вставить("Количество",       ВремКоличество);
	//			Иначе
	//				СтруктураПодбора.Вставить("Команда",          Команда);
	//				СтруктураПодбора.Вставить("ВалютаЦены",       СтрокаТовара.ВалютаЦены);
	//				СтруктураПодбора.Вставить("Номенклатура",     СтрокаТовара.Номенклатура);
	//				СтруктураПодбора.Вставить("ЕдиницаИзмерения", СтрокаТовара.ЕдиницаИзмерения);
	//				СтруктураПодбора.Вставить("Количество",       СтрокаТовара.Количество);
	//				СтруктураПодбора.Вставить("Характеристика"  , СтрокаТовара.Характеристика);
	//				СтруктураПодбора.Вставить("Серия"           , СтрокаТовара.Серия);
	//				СтруктураПодбора.Вставить("Качество"        , СтрокаТовара.Качество);
	//				СтруктураПодбора.Вставить("Цена"            , СтрокаТовара.Цена);
	//			КонецЕсли;
	//			Форма.ОбработкаПодбора(ДокументОбъект[ИмяТабличнойЧасти], СтруктураПодбора);
	//		КонецЕсли;
	//	Иначе

	//		СообщитьОбОшибке("Номенклатура не найдена");

	//	КонецЕсли;
	//КонецЕсли;

	СканерПосылкаДанных(1);

КонецПроцедуры

Функция ПолучитьДанныеОтРидера(Данные) Экспорт
	
	Попытка
		Если млРМК.Количество() >0 Тогда//Получим нужный код от ридера.

			ИсточникДанных = Число(млРМК[0].ИсточникДанных);
			Если ИсточникДанных = 1 Тогда
				ТекДанные = млРМК[0].Объект.Трек1;
			ИначеЕсли ИсточникДанных = 2 Тогда
				ТекДанные = млРМК[0].Объект.Трек2;
			ИначеЕсли ИсточникДанных = 3 Тогда
				ТекДанные = млРМК[0].Объект.Трек3;
			Иначе
				ТекДанные = млРМК[0].Объект.Данные;
			КонецЕсли;
		КонецЕсли;
	Исключение
		ТекДанные = Данные;
		Если (Лев(ТекДанные, 1) = "%") Или (Лев(ТекДанные, 1) = ";") Или (Лев(ТекДанные, 1) = "$") Тогда
			ТекДанные = Прав(ТекДанные, СтрДлина(ТекДанные) - 1);
		КонецЕсли;
		
		Если Прав(ТекДанные, 1) = "?" Тогда
			ТекДанные = Лев(ТекДанные, СтрДлина(ТекДанные) - 1);
		КонецЕсли;
	КонецПопытки;

	Возврат ТекДанные;

КонецФункции

// Процедура обрабатывает внешнее событие формы
//
// Параметры:
//  Форма                       - форма документа, в которую пришло событие от ридера магнитных карт
//  ДокументОбъект              - объект документа, в форму которого пришло событие от ридера магнитных карт
//  СтруктураИсходныхПараметров - структура параметров, переданных из формы
//  Данные                      - данные ридера магнитных карт
//
Процедура ОбработатьВнешнееСобытиеОтРидераДляФормы(Форма, ДокументОбъект, СтруктураИсходныхПараметров, Данные) Экспорт

	Карта = Неопределено;

	ТекКодКарты = ПолучитьДанныеОтРидера(Данные);

	Попытка
		ДокументОбъект.Заблокировать();
	Исключение
		Предупреждение("Не удалось заблокировать запись. Действие (изменение, удаление или блокировка записи) не выполнено");
		РидерПосылкаДанных();
		Возврат;
	КонецПопытки;

	Если Форма.ТолькоПросмотр Тогда

		//Ничего не делаем. Форма открыта для просмотра.

	ИначеЕсли ТекКодКарты <> Неопределено Тогда

		Карта = НайтиМагнитнуюКарту(ТекКодКарты);
		Если Карта <> Неопределено Тогда

			Если Карта.ТипКарты = Перечисления.ТипыИнформационныхКарт.Дисконтная Тогда
				Форма.ДисконтнаяКарта = Карта;
				СтруктураИсходныхПараметров.Команда = "РассчитатьДисконтныеСкидки";
			Иначе
				Если СтруктураИсходныхПараметров.Свойство("Пользователь") Тогда
					Если Карта.ВладелецКарты = Неопределено
					 Или Карта.ВладелецКарты = Справочники.Пользователи.ПустаяСсылка() Тогда

						СообщитьОбОшибке("Карте с кодом: " + ТекКодКарты + ", не назначен владелец");
					Иначе

						СтруктураИсходныхПараметров.Пользователь = Карта.ВладелецКарты;
					КонецЕсли;

				КонецЕсли;
			КонецЕсли;

		Иначе

			СообщитьОбОшибке("Карта с кодом: " + ТекКодКарты + ", не найдена");

		КонецЕсли;
	КонецЕсли;

	РидерПосылкаДанных();

КонецПроцедуры

// По переданному коду карты ищет элемент справочника "Магнитные карты"
//
Функция НайтиМагнитнуюКарту(Данные) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КодКарты", Данные);
	Запрос.Текст = "ВЫБРАТЬ
	|	ИнформационныеКарты.Ссылка
	|ИЗ
	|	Справочник.ИнформационныеКарты КАК ИнформационныеКарты
	|
	|ГДЕ
	|	ИнформационныеКарты.КодКарты = &КодКарты";

	Карты = Запрос.Выполнить().Выгрузить();

	Если Карты.Количество()>0 Тогда
		Карта = Карты[0].Ссылка;
	КонецЕсли;

	Возврат Карта;

КонецФункции

// Функция переносит номер логического устройства из свойств модели в измерение
// регистра сведений "Торговое оборудование" при переходе с релиза 10.1.1 на 10.1.2
//
// Параметры:
//  нет
//
// Возвращаемое значение:
//  Истина если ошибок не произошло, иначе Ложь
//
Функция ПеренестиНомераЛУИзСвойствМоделиВИзмерениеРегистраСведений() Экспорт
	Перем НомерЛУ;

	ТорговоеОборудование = РегистрыСведений.ТорговоеОборудование;
	Оборудование = ТорговоеОборудование.Выбрать();
	Пока Оборудование.Следующий() Цикл

		ИмяКомпьютера = Оборудование.Компьютер;
		Модель        = Оборудование.МодельТорговогоОборудования;
		КассаККМ      = Оборудование.КассаККМ;
		Подключено    = Оборудование.Подключено;
		Параметры     = ЗначениеИзСтрокиВнутр(Оборудование.Параметры);
		ВидТО         = Оборудование.МодельТорговогоОборудования.ВидТорговогоОборудования;

		Если ВидТО = Перечисления.ВидыТорговогоОборудования.ФискальныйРегистратор Тогда

			Параметры.Свойство("НомерЛогическогоУстройства", НомерЛУ);

		ИначеЕсли ВидТО = Перечисления.ВидыТорговогоОборудования.ДисплейПокупателя Тогда

			Параметры.Свойство("НомерЛогическогоУстройства", НомерЛУ);

		ИначеЕсли ВидТО = Перечисления.ВидыТорговогоОборудования.ККМOffLine Тогда

			Параметры.Свойство("НомерЛогическогоУстройства", НомерЛУ);

		ИначеЕсли ВидТО = Перечисления.ВидыТорговогоОборудования.ККМOnLine Тогда

			Параметры.Свойство("ЗаводскойНомерККМ"         , НомерЛУ);

		ИначеЕсли ВидТО = Перечисления.ВидыТорговогоОборудования.ТерминалСбораДанных Тогда

			Параметры.Свойство("НомерЛогическогоУстройства", НомерЛУ);

		ИначеЕсли ВидТО = Перечисления.ВидыТорговогоОборудования.ЭлектронныеВесы Тогда

			Параметры.Свойство("НомерЛогическогоУстройства", НомерЛУ);

		Иначе

			НомерЛУ = 1;

		КонецЕсли;

		МенеджерЗаписиРегистра = Оборудование.ПолучитьМенеджерЗаписи();
		МенеджерЗаписиРегистра.Удалить();
		МенеджерЗаписиРегистра.Компьютер                   = ИмяКомпьютера;
		МенеджерЗаписиРегистра.МодельТорговогоОборудования = Модель;
		МенеджерЗаписиРегистра.КассаККМ                    = КассаККМ;
		МенеджерЗаписиРегистра.Подключено                  = Подключено;
		МенеджерЗаписиРегистра.Параметры                   = ЗначениеВСтрокуВнутр(Параметры);
		МенеджерЗаписиРегистра.НомерЛогическогоУстройства  = НомерЛУ;
		МенеджерЗаписиРегистра.Записать();

	КонецЦикла;

	Возврат Истина;

КонецФункции

Процедура ДобавитьПараметры(Параметры1,Параметры2) Экспорт
	Для Каждого Элемент Из Параметры2 Цикл
		Если НЕ Параметры1.Свойство(Элемент.Ключ) Тогда
			Параметры1.Вставить(Элемент.Ключ,Элемент.Значение);							
		КонецЕсли; 		
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьВерсиюAPIКонфигурацииТО() Экспорт
	Возврат 2.05;
КонецФункции // ()

Функция ПолучитьОбработкуОбслуживания(Модель) Экспорт
	ХЗ_Обработки=Модель.ОбработкаОбслуживания83.Обработка.Получить();
	Если ХЗ_Обработки=Неопределено Тогда Возврат Неопределено КонецЕсли;	
	
	ИмяВФ=ПолучитьИмяВременногоФайла("epf"); 
	ХЗ_Обработки.Записать(ИмяВФ);	
	Обработка=ВнешниеОбработки.Создать(ИмяВФ);
	
	//Обработка=ВнешниеОбработки.Создать("C:\Users\1c\Desktop\1\НастройкаФР.epf");
	
	Возврат Обработка;
КонецФункции // ()
 

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

// фискальный регистратор
млФР = Новый ТаблицаЗначений;
млФР.Колонки.Добавить("Объект");
млФР.Колонки.Добавить("Модель");
млФР.Колонки.Добавить("НомерЛУ");
млФР.Колонки.Добавить("КассаККМ");
млФР.Колонки.Добавить("ДляПриемаНаличныхОтЮрЛиц");

// сканер штрих кодов
млСШК = Новый ТаблицаЗначений;
млСШК.Колонки.Добавить("Объект");
млСШК.Колонки.Добавить("Модель");
млСШК.Колонки.Добавить("Префикс");
млСШК.Колонки.Добавить("ОбработкаОбслуживания");

// ридер магнитных карт
млРМК = Новый ТаблицаЗначений;
млРМК.Колонки.Добавить("Объект");
млРМК.Колонки.Добавить("Модель");
млРМК.Колонки.Добавить("ИсточникДанных");

// ККМ On-Line
млККМOnLine = Новый ТаблицаЗначений;
млККМOnLine.Колонки.Добавить("Объект");
млККМOnLine.Колонки.Добавить("Модель");
млККМOnLine.Колонки.Добавить("Код");
млККМOnLine.Колонки.Добавить("КассаККМ");

// Чековый буфер ККМ On-Line
млЧековыйБуферККМOnLine = Новый ТаблицаЗначений;
млЧековыйБуферККМOnLine.Колонки.Добавить("КодККМ"      );
млЧековыйБуферККМOnLine.Колонки.Добавить("Штрихкод"    );
млЧековыйБуферККМOnLine.Колонки.Добавить("Количество"  );
млЧековыйБуферККМOnLine.Колонки.Добавить("Сумма"       );
млЧековыйБуферККМOnLine.Колонки.Добавить("НомерПокупки");

// ККМ Off-Line
млККМOffLine = Новый ТаблицаЗначений;
млККМOffLine.Колонки.Добавить("Объект");
млККМOffLine.Колонки.Добавить("Модель");
млККМOffLine.Колонки.Добавить("Путь");
млККМOffLine.Колонки.Добавить("НомерЛУ");
млККМOffLine.Колонки.Добавить("КассаККМ");
млККМOffLine.Колонки.Добавить("Адрес");
млККМOffLine.Колонки.Добавить("Порт");

// электронные весы
млВесы = Новый ТаблицаЗначений;
млВесы.Колонки.Добавить("Объект");
млВесы.Колонки.Добавить("Модель");
млВесы.Колонки.Добавить("НомерЛУ");

// дисплей покупателя
млДП = Новый ТаблицаЗначений;
млДП.Колонки.Добавить("Объект");
млДП.Колонки.Добавить("Модель");
млДП.Колонки.Добавить("Строка1");
млДП.Колонки.Добавить("Строка2");
млДП.Колонки.Добавить("БегущаяСтрока");
млДП.Колонки.Добавить("НомерЛУ");
млДП.Колонки.Добавить("КассаККМ");

// терминал сбора данных
млТерминал = Новый ТаблицаЗначений;
млТерминал.Колонки.Добавить("Объект");
млТерминал.Колонки.Добавить("Модель");
млТерминал.Колонки.Добавить("НомерЛУ");
млТерминал.Колонки.Добавить("Порт");

мВалютаРегламентированногоУчета = ПараметрыСеанса.ВалютаНац;

#КонецЕсли

