// Катаев+ 19/03/13
Перем мСозданиеНевозможно Экспорт;
// Катаев- 19/03/13
//Катаев+ 06/10/14
Перем НужноВыгружать;
//Катаев- 06/10/14

Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,Записывать=Ложь)
	Для Каждого НаборДвижений Из ДвиженияПоРегистрам Цикл
		ИмяРегистра		=НаборДвижений.Ключ;
		ТаблицаДвижения =НаборДвижений.Значение;
		
		Если Движения.Найти(ИмяРегистра)=Неопределено Тогда Возврат  КонецЕсли; 
		
		НаборЗаписей=Движения[ИмяРегистра];		
		НаборЗаписей.Очистить();
		
		Для Каждого Движение Из ТаблицаДвижения Цикл
			Запись=НаборЗаписей.Добавить();	
			ЗаполнитьЗначенияСвойств(Запись,Движение);	
			
			Запись.Регистратор=Ссылка;
		КонецЦикла;	
		
		Если Записывать Тогда
			НаборЗаписей.Записать();		
		КонецЕсли; 
	КонецЦикла;	
КонецПроцедуры 

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли; 
	
	ЕстьИзменения		= Модифицированность();
	НужноВыгружать		= НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	
	
	Если НЕ ОбменДанными.Загрузка Тогда
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
			
		
		
		
		Если Отказ Тогда Возврат КонецЕсли; 	
	КонецЕсли;
	
	Если ЕстьИзменения Тогда		
		СуммаДокумента		= Товары.Итог("Всего");
		ОбъемДокумента		= Товары.Итог("Объем");
		КоличествоДокумента = Товары.Итог("Количество");
		
		ГруппыТоваров   	= ГруппыТоваровДокумента(ЭтотОбъект);
	КонецЕсли; 
	
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
		//Катаев+ 08/10/14
		Если Не ЭтотОбъект.Ссылка.Пустая() Тогда
			НужноВыгружать = Ложь;
		КонецЕсли;
		//Катаев- 08/10/14
	КонецЕсли;
	
		
	Если НЕ ОбменДанными.Загрузка Тогда
		Если ДокОснование.Метаданные().Имя = "РасходнаяНакладная" Тогда
			Если ДокОснование.СуммаСкидкиДС <> 0 Тогда
				СуммаСкидкиДСДоИзменения = ДокОснование.СуммаСкидкиДС;
				Если ДокОснование.СуммаДокумента <> 0 Тогда
				ПроцентИзмененияСкидкиДС = СуммаДокумента/ДокОснование.СуммаДокумента;
			Иначе
				ПроцентИзмененияСкидкиДС = 0;
			КонецЕсли;
			СуммаСкидкиДС = ПроцентИзмененияСкидкиДС*СуммаСкидкиДСДоИзменения;
			ДоговорСкидкиДС = ДокОснование.ДоговорСкидкиДС;
			КонецЕсли;
        КонецЕсли;
	КонецЕсли;
	
	ОтправкаУведомленияПретензияПокупателя();

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Отработано=Ложь;
	СостояниеПретензииПокупателя = Неопределено;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)	
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	Если Основание=Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;
	
		
	ВидОснования	= Основание.Метаданные().Имя;
		
	ДокОснование	= Основание;
	



	
	
	// Катаев+ 19/03/13  Добавил заполнение на основании акта приемки
	Если ВидОснования = "АктПриемки" Тогда
		Если ДокОснование.РНК.Пустая() Тогда
			Сообщить("В акте приемки отсутствует РНК. Создание документа запрещено");
			мСозданиеНевозможно=Истина;
			Возврат;
		Конецесли;
		ПунктДоставки	= ПолучитьРеквизитОбъекта(ДокОснование,"ПунктДоставки");			
		Менеджер 		= ПолучитьРеквизитОбъекта(ДокОснование.РНК,"Менеджер");			
		Организация		= ПолучитьРеквизитОбъекта(ДокОснование.РНК,"Организация");	
		ТипЦен			= ПолучитьРеквизитОбъекта(ДокОснование.РНК,"ТипЦен");
		ТипСкидок		= ПолучитьРеквизитОбъекта(ДокОснование.РНК,"ТипСкидок");
		// нечаева 14,08,19+++
		Склад		= ПолучитьРеквизитОбъекта(ДокОснование.РНК,"Склад");
		// нечаева 14,08,19---

		//12.03.14 нечаева - цены слетают ++
		//Скидка			= ПолучитьРеквизитОбъекта(ДокОснование.РНК,"Скидка");
		//12.03.14 нечаева - цены слетают --
	Иначе
		ПунктДоставки	= ПолучитьРеквизитОбъекта(ДокОснование,"ПунктДоставки");			
		Менеджер 		= ПолучитьРеквизитОбъекта(ДокОснование,"Менеджер");			
		Организация		= ПолучитьРеквизитОбъекта(ДокОснование,"Организация");	
		ТипЦен			= ПолучитьРеквизитОбъекта(ДокОснование,"ТипЦен");
		ТипСкидок		= ПолучитьРеквизитОбъекта(ДокОснование,"ТипСкидок");
		//12.03.14 нечаева - цены слетают ++
		//Скидка			= ПолучитьРеквизитОбъекта(ДокОснование,"Скидка");
		//12.03.14 нечаева - цены слетают --
	КонецЕсли;
	// Катаев- 19/03/13 
	
	//крохин начало 29.01.2013
	//менеджер, для отчета "продажи"
	Менеджер			= ПолучитьРеквизитОбъекта(ДокОснование,"Менеджер");
	//крохин конец 29.01.2013
		
	Комментарий		= ""+ДокОснование.Метаданные()+" № " + ДокОснование.Номер + " от " + Формат(ДокОснование.Дата,"ДФ=dd.MM.yy");		
	
	Если ВидОснования="ПриходнаяНакладная" ИЛИ ВидОснования="РасходнаяНакладная" Тогда
		Корреспондент	= ДокОснование.Контрагент;		
		Склад			= ДокОснование.Склад;
		//крохин начало 06.03.2012
		ВидОплаты = ДокОснование.ВидОплаты;
	//крохин конец 06.03.2012
	//крохин начало 24.05.2012
	ДатаОплаты = Докоснование.ДатаОплаты;
	//крохин конец 24.05.2012
	ИначеЕсли ВидОснования="Перемещение" Тогда
		Корреспондент	= ДокОснование.СкладПолучатель;
		Склад			= ДокОснование.Склад;
	// Катаев+ 19/03/13 
	ИначеЕсли Видоснования="АктПриемки"	 Тогда
		Корреспондент	= ДокОснование.Контрагент;		
		Склад			= ДокОснование.Склад;
		ДатаОплаты = ДокОснование.РНК.ДатаОплаты;
		// нечаева 14,08,19+++
		Склад		= ДокОснование.РНК.Склад;
		// нечаева 14,08,19---

		//Катаев- 19/03/13
	Иначе
		Склад			= ПолучитьРеквизитОбъекта(ДокОснование,"Склад");		
	КонецЕсли;	
	
	Если ВидОснования="ПриходнаяНакладная" И ДокОснование.КодОперации=Перечисления.КодыОперацийОстатки.ЗакупкаР Тогда
		Поставщику=Истина;
		
		Для Каждого ИсхСтрокаТЧ ИЗ ДокОснование.Товары Цикл
			Если ИсхСтрокаТЧ.ПодтвержденнаяЗаявка<>ИсхСтрокаТЧ.Количество Тогда
				СтрокаТЧ=Товары.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЧ,ИсхСтрокаТЧ,,"Количество");
				
				СтрокаТЧ.КоличествоИсх	=ИсхСтрокаТЧ.ПодтвержденнаяЗаявка;
				СтрокаТЧ.КоличествоФакт	=ИсхСтрокаТЧ.Количество;
				СтрокаТЧ.Количество		=СтрокаТЧ.КоличествоФакт-СтрокаТЧ.КоличествоИсх;				
				
				РассчитатьСуммуТабЧасти(СтрокаТЧ,ЭтотОбъект);
			КонецЕсли; 			
		КонецЦикла;
	ИначеЕсли ВидОснования="Перемещение" Тогда
		Для Каждого ИсхСтрокаТЧ ИЗ ДокОснование.Товары Цикл
			Если ИсхСтрокаТЧ.ПодтвержденнаяЗаявка<>ИсхСтрокаТЧ.Количество Тогда
				СтрокаТЧ=Товары.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЧ,ИсхСтрокаТЧ,,"Количество");
				
				СтрокаТЧ.КоличествоИсх	=ИсхСтрокаТЧ.ПодтвержденнаяЗаявка;
				СтрокаТЧ.КоличествоФакт	=ИсхСтрокаТЧ.Количество;
				СтрокаТЧ.Количество		=СтрокаТЧ.КоличествоИсх-СтрокаТЧ.КоличествоФакт;				
				
				РассчитатьСуммуТабЧасти(СтрокаТЧ,ЭтотОбъект);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	//крохин начало 20.11.2011
	Если ВидОснования="РасходнаяНакладная" И КонецДня(Константы.ДатаЗапретаРедактирования.Получить()) >= ДокОснование.Дата Тогда
		ВидРекламации = Перечисления.ВидыРекламаций.Вычерк;
	Иначе
		ВидРекламации = Перечисления.ВидыРекламаций.Рекламация;
	КонецЕсли;
	//крохин конец 20.11.2011
	
	
	//Катаев+ 19/03/13 Заполнение ТЧ на основании АктаПриемки и РНК
	
	
	// нечаева 24,02,016 убрала рнк из заполнения, не правильно считает нач. остаток, если несколько вычерков
	//Если ВидОснования="РасходнаяНакладная" Или ВидОснования="АктПриемки" Тогда // было
	Если  ВидОснования="АктПриемки" Тогда
		Если ВидОснования = "АктПриемки" Тогда
			РНК = ДокОснование.РНК;
			ДокОснование = ДокОснование.РНК;
		Иначе
			РНК =ДокОснование;
		КонецЕсли;
		Запрос = новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РасхожденияПоАктуОстатки.Номенклатура,
		|	РасхожденияПоАктуОстатки.ОтправленоОстаток,
		|	РасхожденияПоАктуОстатки.ПринятоОстаток
		|ИЗ
		|	РегистрНакопления.РасхожденияПоАкту.Остатки(, РНК = &РНК) КАК РасхожденияПоАктуОстатки";
		Запрос.УстановитьПараметр("РНК", РНК);
		Выборка = запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаТЧ=Товары.Добавить();
			СтрокаТЧ.Номенклатура = Выборка.Номенклатура;
			СтрокаТЧ.КоличествоИсх = Выборка.ОтправленоОстаток;
			СтрокаТЧ.КоличествоФакт = Выборка.ПринятоОстаток;
			СтрокаТЧ.Количество	= СтрокаТЧ.КоличествоИсх-СтрокаТЧ.КоличествоФакт;				
		КонецЦикла;
	КонецЕсли;
	
	//Катаев- 19/03/13
	
	//крохин начало 05.05.2020
	//комиссионная торговля
	Если ВидОснования="РасходнаяНакладная" И  ДокОснование.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия Тогда
	СкладКомиссия = ДокОснование.СкладКомиссия;
	//ДоговорКомиссия = ДокОснование.ДоговорКомиссия;
	КонецЕсли;
	//крохин конец 05.05.2020
	
	
КонецПроцедуры


Процедура ПередУдалением(Отказ)
	
	//доработки Чиркова для свертки базы, 04.08.2016 начало
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;	
	//доработки Чиркова для свертки базы, начало 04.08.2016 конец
	
	

КонецПроцедуры

    
Процедура ПриЗаписи(Отказ)
	Если НужноВыгружать Тогда
		ЗанестиФилиалыВРегистрПолучателей(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправкаУведомленияПретензияПокупателя() Экспорт
	
	ПослатьПисьмо = Ложь;
	
	Если СтатусПретензии = Перечисления.СтатусыПретензииПокупателя.НаРассмотренииПРО Тогда	
		ТемаПисьма = "Уведомление о создании претензии покупателя";
		ТекстПисьма = "Создан новый документ ПрП "+Номер+ "("+ДокОснование+", "+Корреспондент+")";
		ПослатьПисьмо = Истина;	
	КонецЕсли;
	
	Если СтатусПретензии = Перечисления.СтатусыПретензииПокупателя.НаРассмотренииРуководителяПодразделения Тогда
		ТемаПисьма = "Уведомление о необходимости согласования претензии покупателя руководителем подразделения";
		
		ТекстПисьма = "По документу ПрП "+Номер+ "("+ДокОснование+", "+Корреспондент+") требуется решение руководителя";
		ПослатьПисьмо = Истина;
		
	КонецЕсли;
	
	Если СтатусПретензии = Перечисления.СтатусыПретензииПокупателя.ОформлениеРКМ Тогда
		ТемаПисьма = "Уведомление о необходимости создания РКМ по претензии покупателя";
		
		ТекстПисьма = "Требуется корректировка по документу ПрП "+Номер+ "("+ДокОснование+", "+Корреспондент+")";
		ПослатьПисьмо = Истина;	
	КонецЕсли;
	
	Если СтатусПретензии = Перечисления.СтатусыПретензииПокупателя.ОформлениеДокументов Тогда
		ТемаПисьма = "Уведомление о необходимости создания заявки на ТСД по претензии покупателя";
		
		ТекстПисьма = "Проведена корректировка по документу ПрП "+Номер+ "("+ДокОснование+", "+Корреспондент+"). Требуется создать заявку на выписку документов";
		ПослатьПисьмо = Истина;	
	КонецЕсли;
	
	Если ПослатьПисьмо Тогда
		СписокПолучателей = СформСписокПолучат(Справочники.ТипыРассылок.ПисьмоОТестировании);
		// "krohin@collant.ru"
		ОшибкиУведомления = СформироватьВнутреннееУведомление (СписокПолучателей,ТекстПисьма,ТемаПисьма);
	КонецЕсли;
	
КонецПроцедуры





