
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)	
	ЗаполнитьШапкуДокумента(ЭтотОбъект, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
	
	СостояниеСогласования_Покупатель= Неопределено;
	СостояниеСогласования_Поставщик	= Неопределено;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли; 
	
	Если Модифицированность() Тогда
		ГруппыТоваров		= ГруппыТоваровДокумента(ЭтотОбъект);
		
		СуммаДокумента		= Товары.Итог("Всего");
		КоличествоДокумента = Товары.Итог("Количество");	
	КонецЕсли; 
КонецПроцедуры
