
Функция GetData(Запрос)
	//http://192.168.1.203/snl/hs/B2BRoot/GetData/aaa/bbb/ccc
	//aaa -  CommandName
	//bbb -  ParamName
	//ccc -  ParamValue
	//берётся из свойства - шаблон в GetMethod (элемент выше в дереве конфигурации). 
	///GetData/{CommandName}/{ParamName}/{ParamValue}
	//На самом деле ParamName - можно выкинуть или вообще все параметры выкинуть и передать всё в заголоках
	
	КодВозврата=200;//Всё ок
	Причина="";
	
	
	//Коды ошибок пока произвольные, но так только для теста.
	
	СтруктураПараметров=новый Структура("CommandName,ParamName,ParamValue","","",Неопределено);
	Для каждого СтрСоответствия из запрос.ПараметрыURL цикл
		если СтруктураПараметров.Свойство(СтрСоответствия.ключ) тогда
			СтруктураПараметров[СтрСоответствия.ключ]=СтрСоответствия.значение;
		иначе
			Причина="Передана кривая структура ";
			КодВозврата="500";
		КонецЕсли;
	КонецЦикла;
	
	попытка
		ЖЖ="Какой-то код";
	Исключение
		КодВозврата=500; 
		Причина="ОписаниеОшибки";
		
	КонецПопытки;
	
	
	
	
	СтрJSON=СформироватьJsonB2b();
	Ответ = Новый HTTPСервисОтвет(КодВозврата);
	Ответ.Заголовки.Вставить("Content-type", "application/json");
	Ответ.Заголовки.Вставить("Charset", "utf-8");
	Ответ.Причина=Причина;
	Ответ.УстановитьТелоИзСтроки(СтрJSON);//Тут мы вернём то, что могут разобрать из тела ответа
	
	
	Возврат Ответ;
КонецФункции


Функция UVSkidke(Запрос)
	
	//http://192.168.1.203/snl/hs/B2BRoot/PostData
	//Но из браузера уже не запустишь
	КодВозврата=200;//Всё ок
	Причина="";
	
	
	//Тут по идее нужно разбирать тело
	ТекстТела=Запрос.ПолучитьТелоКакСтроку(); 	
	 
	//++Данилова Е.В. 22.04.2025 WEB-3452
	//СтрJSON = ЗагрузитьУчастиеВСкидкахb2b(ТекстТела);
	СтрJSON = b2b_ОбменЗаявками.ЗагрузитьУчастиеВСкидкахb2bПоКонтрагенту(ТекстТела);
	//--Данилова Е.В. 22.04.2025

	Ответ = Новый HTTPСервисОтвет(КодВозврата);
	Ответ.Причина=Причина;
	Ответ.Заголовки.Вставить("Content-type", "application/json");
	Ответ.Заголовки.Вставить("Charset", "utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрJSON);//Тут мы вернём на сайт ответ - то, что могут разобрать из тела ответа
	
	ЗаписатьВЛог("b2b test","Загрузка скидок 33"+текстТела,,,);
	
	Возврат Ответ;
	

КонецФункции


Функция PostData(Запрос)
	//http://192.168.1.203/snl/hs/B2BRoot/PostData
	//Но из браузера уже не запустишь
	КодВозврата=200;//Всё ок
	Причина="";
	
	
	//Тут по идее нужно разбирать тело
	ТекстТела=Запрос.ПолучитьТелоКакСтроку();
	
	
	
	СтрJSON=СформироватьJsonB2b(ТекстТела);

	Ответ = Новый HTTPСервисОтвет(КодВозврата);
	Ответ.Причина=Причина;
	Ответ.Заголовки.Вставить("Content-type", "application/json");
	Ответ.Заголовки.Вставить("Charset", "utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрJSON);//Тут мы вернём на сайт ответ - то, что могут разобрать из тела ответа
	
	ЗаписатьВЛог("b2b test","Загрузка скидок "+текстТела,,,);
	
	Возврат Ответ;
КонецФункции

//Данилова Е.В. 08.08.2025 Без задачи 
Функция OrderUpdate(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

