#Область СобытияОбъекта

// Чирков 
//	1. Перестаньте корежить процедуры - есть штатный метод "Заполнить"
//	2. Подразделение по умолчанию вынесено в общую процедуру заполнения шапки
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЗаполнитьШапкуДокумента(ЭтотОбъект, ПараметрыСеанса.Пользователь);	   
	
	// Кельманов А.В. - HELP-9912 - 2026.05.26 {
	Если ЗначениеЗаполнено(Автор) Тогда
		СборщикКомплектаТСД = Автор.ФизЛицо;
	КонецЕсли;
	// Кельманов А.В. - HELP-9912 - 2026.05.26 }	         
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
	    ДокОснование = МаркировкаКС.ПолучитьЗначениеПараметра(ДанныеЗаполнения, "ДокОснование");		
		фРежим		 = МаркировкаКС.ПолучитьЗначениеПараметра(ДанныеЗаполнения, "фРежим");
		Если фРежим = 2  Тогда
			Продукция	 = МаркировкаКС.ПолучитьЗначениеПараметра(ДанныеЗаполнения, "Продукция");
		КонецЕсли;
	Иначе
		ДокОснование = ДанныеЗаполнения;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокОснование) Тогда Возврат КонецЕсли;	
	
	ТипОснования = ТипЗнч(ДокОснование);	
	
	Если ТипОснования = Тип("ДокументСсылка.ЗаданиеНаСборкуКомплектовЧЗ") Тогда
		ЗаполнитьПоЗСБ();			
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ДополнительныеСвойства.Свойство("НеПроверятьШтрихКодНабора") Тогда
		Если ПроверяемыеРеквизиты.Свойство() Тогда
					
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	ШККомплектов = Новый Соответствие;
	Для Каждого СтрокаТЧ из ШтрихкодыУпаковок Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ШтрихкодКомплекта) Тогда Продолжить КонецЕсли;
		
		//Статус КМ набора
		Если ШККомплектов[СтрокаТЧ.ШтрихкодКомплекта] = Неопределено Тогда 			
			ШККомплектов[СтрокаТЧ.ШтрихкодКомплекта] = Истина;
			
			Движение = Движения.СтатусыКМ_Факт.Добавить();		
			
			Движение.Период				= ?(ЗначениеЗаполнено(СтрокаТЧ.ДатаФормированияКомплекта), СтрокаТЧ.ДатаФормированияКомплекта, Дата);
			Движение.ШтрихКодУпаковки	= СтрокаТЧ.ШтрихкодКомплекта;		
			Движение.Местонахождение	= Подразделение;
			
			Если СтрокаТЧ.КодКомплектаПодтвержденСканированием Тогда
				Движение.Статус			= Перечисления.СтатусыКодовМаркировкиФакт.Нанесен;					
			Иначе
				Движение.Статус			= Перечисления.СтатусыКодовМаркировкиФакт.Распечатан;			
			КонецЕсли;		
		КонецЕсли;
		
		//Статус КМ комплектующего
		Если ЗначениеЗаполнено(СтрокаТЧ.ШтрихкодУпаковки) Тогда
			ДатаЗаписи	 = ?(ЗначениеЗаполнено(СтрокаТЧ.ДатаФормированияКомплекта), СтрокаТЧ.ДатаФормированияКомплекта, Дата);
			
			Если СтрокаТЧ.КодКомплектующегоНеНанесен Тогда
				Движение = Движения.СтатусыКМ_Факт.Добавить();		
			
				Движение.Период				= ДатаЗаписи - 1;
				Движение.ШтрихКодУпаковки	= СтрокаТЧ.ШтрихкодУпаковки;		
				Движение.Местонахождение	= Подразделение;
				Движение.Статус				= Перечисления.СтатусыКодовМаркировкиФакт.НанесенВиртуально;							
			КонецЕсли;
			
			Движение = Движения.СтатусыКМ_Факт.Добавить();		
			
			Движение.Период				= ДатаЗаписи;
			Движение.ШтрихКодУпаковки	= СтрокаТЧ.ШтрихкодУпаковки;		
			Движение.Местонахождение	= Подразделение;
			Движение.Статус				= Перечисления.СтатусыКодовМаркировкиФакт.Вложен;
		КонецЕсли; 
	КонецЦикла;
	
	//+++Чирков 2025.04.29
	//тов. Крохин очень переживает что мои "гипотетические" оптимизации мешают ему проводить документы
	//впрочем, как обычно, звон есть а ни подтверждений ни понимания сути проблемы нет
	Если ШтрихкодыУпаковок.Количество() = 0 Тогда
		Движения.СтатусыКМ_Факт.Очистить();	
		Движения.СтатусыКМ_Факт_А.Очистить();
		Движения.ОстаткиДоступныхКМ.Очистить();
	КонецЕсли; 
	//---Чирков 2025.04.29
	
	Если Завершен И ВсеНаборыСобраны() Тогда		
		Если ПолучитьРеквизитШапки(ДокОснование, "СостояниеНакладной") <> Перечисления.СостоянияНакладной.ГотоваКОтгрузке Тогда
			Документы.ЗаданиеНаСборкуКомплектовЧЗ.ЗавершитьЗадание(ДокОснование);
			#ЕСЛИ КЛИЕНТ ТОГДА
				ОповеститьОбИзменении(ДокОснование);
			#КОНЕЦЕСЛИ	
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если ЗначениеЗаполнено(Организация) Тогда
		Префикс = СокрЛП(Организация.Префикс);	
	КонецЕсли; 
	Префикс = Префикс+Маркировка_ПИ.ЭтотУзел_Код("Основной")+"-";
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Автор 		= ПараметрыСеанса.Пользователь;
	Комментарий = "";	
	Завершен   	= Ложь;
	
	Товары.Очистить();
	ШтрихкодыУпаковок.Очистить();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;	
	//ОбновитьСтатусыНанесения();
		
	Если Модифицированность() Тогда
		
		Если фРежим = 2 Тогда //Пакетный режим
		Иначе
			
			// Кельманов А.В. - HELP-5254 - 2026.03.30 {
			//КоличествоДокумента = КоличествоКомплектов();
			//рПроверки = ЭтоМоноКомплектация();
			//Продукция = рПроверки.Данные; 
			КоличествоКомплектов = КоличествоКомплектов();
			
			Если КоличествоКомплектов > 0 Или Не ЗначениеЗаполнено(Продукция) Или Не фРежим = 0 Тогда
				
				КоличествоДокумента = КоличествоКомплектов;
				рПроверки = ЭтоМоноКомплектация();
				Продукция = рПроверки.Данные;
				
			КонецЕсли;
			// Кельманов А.В. - HELP-5254 - 2026.03.30 }

		КонецЕсли;
		
		КоличествоКомплектующих = ШтрихкодыУпаковок.Количество();
		
		Если КоличествоДокумента > 0 тогда
			ЗаполнитьТоварыПоКМ(ЭтотОбъект);
		КонецЕсли;
		
		ГруппыТоваров = ГруппыТоваровДокумента(ЭтотОбъект);
		
	КонецЕсли;	
	
	Если РабочееМесто.Пустая() Тогда
		Если ЗначениеЗаполнено(УзелТСД) Тогда
			РабочееМесто = Справочники.РабочиеМеста.ПолучитьРабочееМестоПоУзлу(УзелТСД);								
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли; 
	
	рПроверки = Документы.ЛистСборкиКомплектовЧЗ.ПроверитьДублиКодовКомплектов(Ссылка);
	Если НЕ рПроверки.Успешно Тогда		
		Отказ = Истина;
		ВызватьИсключение СтрСоединить(рПроверки.Ошибки, Символы.ПС);
	КонецЕсли; 
	
	Если Завершен И Проведен Тогда
		Если НЕ РегистрыСведений.ОтгружаемыеКодыМаркировки.ЕстьЗаписиПроверкиДокумента(Ссылка) Тогда
			РегистрыСведений.ОтгружаемыеКодыМаркировки.СоздатьЗадачуПроверкиДокумента(Ссылка);			
		КонецЕсли;
		//+++Чирков 01.06.2026 MARK-3589
		//Валетов+ 10.06.2026 Проблема 0000000080   
		//Пока Отключим проверку 
		//МаркировкаС.ПроверитьКМпоДокументу(Ссылка, Новый Структура("ОтложеннаяПроверка", Истина));
		//Валетов -
		//---Чирков 01.06.2026
	//+++Чирков 27.02.2026 очистка записей при откате завершенного документа	
	Иначе         		
		Если РегистрыСведений.ОтгружаемыеКодыМаркировки.ЕстьЗаписиПроверкиДокумента(Ссылка) Тогда
			РегистрыСведений.ОтгружаемыеКодыМаркировки.УдалитьЗаписиПоДокументу(Ссылка);			
		КонецЕсли;		
	//---Чирков 27.02.2026 очистка записей при откате завершенного документа		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

Функция ЭтоМоноКомплектация()
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|	Владелец КАК Продукция
	|ИЗ 
	|	Справочник.ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	Ссылка В (&МассивКодов)
	|	И НЕ Владелец.ВерсияДанных ЕСТЬ NULL
	|";
	
	МассивКодов = ШтрихкодыУпаковок.Выгрузить( , "ШтрихкодКомплекта");
	МассивКодов.Свернуть("ШтрихкодКомплекта");
	
	Запрос.УстановитьПараметр("МассивКодов", МассивКодов.ВыгрузитьКолонку("ШтрихкодКомплекта"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		
		Если ЗначениеЗаполнено(Выборка.Продукция) Тогда	
			Результат.Данные	= Выборка.Продукция;			
			Результат.Успешно	= Истина;
		КонецЕсли;	
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ЭтоМоноКомплектация() 

Функция ВсеНаборыСобраны()
	Запрос = Новый Запрос;
	Запрос.Текст = "	
	|ВЫБРАТЬ
	|	Номенклатура,
	|	СУММА(КолСобрано) КАК КолСобрано,
	|	СУММА(КолЗадание) КАК КолЗадание
	|ИЗ
	|(
	|	ВЫБРАТЬ
	|		Номенклатура,
	|		Количество*Коэффициент	КАК КолСобрано,
	|		0						КАК КолЗадание
	|	ИЗ
	|		Документ.ЛистСборкиКомплектовЧЗ.Товары КАК ЛистСборкиКомплектовЧЗТовары
	|	ГДЕ
	|		Ссылка.ДокОснование = &ДокОснование
	|		И Ссылка.Проведен И Ссылка.Завершен	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ
	|		Номенклатура,
	|		0						КАК КолСобрано,
	|		Количество*Коэффициент	КАК КолЗадание
	|	ИЗ
	|		Документ.ЗаданиеНаСборкуКомплектовЧЗ.Товары
	|	ГДЕ
	|		Ссылка = &ДокОснование
	|) КАК Сводный
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура
	|ИМЕЮЩИЕ
	|	СУММА(КолСобрано)<>СУММА(КолЗадание)
	|";	
			
	Запрос.УстановитьПараметр("ДокОснование", ДокОснование);			
	
	Возврат Запрос.Выполнить().Пустой();
КонецФункции //ВсеНаборыСобраны() 

Функция КоличествоКомплектов()
	ШККомплектов = Новый Соответствие;
	Для Каждого СтрокаТЧ Из ШтрихкодыУпаковок Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.ШтрихкодКомплекта) Тогда
			ШККомплектов[СтрокаТЧ.ШтрихкодКомплекта] = Истина;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ШККомплектов.Количество();
КонецФункции //КоличествоКомплектов() 

Функция ЗаполнитьПоЗСБ()
	
КонецФункции //ЗаполнитьПоРНК()

Функция ЗаполнитьТоварыПоКМ(ДокОбъект) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "	
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_КМ ИЗ &ШтрихкодыУпаковок КАК ШтрихкодыУпаковок
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_КМ.ШтрихкодКомплекта.Владелец КАК Номенклатура,
	|	МАКСИМУМ(Ссылка)				КАК Единица,
	|	МАКСИМУМ(Коэффициент)			КАК Коэффициент
	|ПОМЕСТИТЬ ВТ_Единицы
	|ИЗ
	|	ВТ_КМ
	|ЛЕВОЕ СОЕДИНЕНИЕ	
	|	Справочник.Единицы КАК Единицы
	|ПО
	|	Единицы.Владелец = ВТ_КМ.ШтрихкодКомплекта.Владелец
	|	И Единицы.ОКЕИ = ВТ_КМ.ШтрихкодУпаковки.Владелец.БазоваяЕдиница	
	|	И НЕ Единицы.ПометкаУдаления
	|ГДЕ
	|	ВТ_КМ.ШтрихкодУпаковки.Владелец <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	ВТ_КМ.ШтрихкодКомплекта.Владелец
	|;	
	|ВЫБРАТЬ
	|	ВТ_КМ.ШтрихкодКомплекта.Владелец 		КАК Номенклатура,
	|	МАКСИМУМ(ВТ_Единицы.Единица)			КАК Единица,
	|	МАКСИМУМ(ВТ_Единицы.Коэффициент)		КАК Коэффициент,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодКомплекта)	КАК Количество
	|ИЗ
	|	ВТ_КМ	
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ВТ_Единицы
	|ПО
	|	ВТ_Единицы.Номенклатура = ШтрихкодКомплекта.Владелец
	|ГДЕ
	|	ШтрихкодКомплекта.Владелец <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	ШтрихкодКомплекта.Владелец
	|УПОРЯДОЧИТЬ ПО
	|	ШтрихкодКомплекта.Владелец.Наименование
	|";	
	
	Запрос.УстановитьПараметр("ШтрихкодыУпаковок", ДокОбъект.ШтрихкодыУпаковок);
	
	ДокОбъект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецФункции //ЗаполнитьТоварыПоКМ(ДокОбъект) Экспорт

Процедура ОбработкаУдаленияПроведения(Отказ)
	Отказ = Истина;
КонецПроцедуры
