
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	
	Для каждого ТекСтрока из Список Цикл 
	    		
		Движение = Движения.ЗатратыМерчендайзинга.Добавить();
		Движение.Период	= НачалоМесяца(ПериодЗатрат);
		движение.Контаргент = контрагент;
			
		Движение.ВремяНаВизит = текстрока.времяНавизит;
		движение.КолSKU = текСтрока.КолSKU;
		движение.КолПосещенийМесяц = текСтрока.КолПосещенийМесяц;
		движение.КолРаботоЧасов = текСтрока.КолРаботоЧасов;
		Движение.Подразделение = текстрока.ФактическийАдрес.ДепартаментЗаКемЗакреплен;
		движение.ПунктДоставки = ТекСтрока.ФактическийАдрес;
		движение.СтавкаЧаса = ТекСтрока.СтавкаЧаса;
		Движение.Регистратор = ссылка;
		движение.ГодовойБюджет = текСтрока.КолРаботоЧасов*12*ТекСтрока.СтавкаЧаса;		
		
	КонецЦикла;
	
	
КонецПроцедуры
