Перем ПутиПапок Экспорт;
Перем ПутиФайлов Экспорт;
Перем ИмяПути Экспорт;
Перем Контрагент Экспорт;
Перем ТипШк Экспорт;
Перем КодМетро Экспорт; 
Перем Файлы Экспорт;
Перем Ошибки Экспорт;
Перем КритичОшибки,КритичОшибкиЛента Экспорт;
Перем ТЗПЕчать,ТЗШапка,АктШапка,АктТаблица Экспорт;
Перем Ашан Экспорт;
Перем НомПП;
Перем Отказ;
Перем ОшибкиАртикул;
Перем SQLiteObject;
Перем КаталогЕкода,СерверЕкода Экспорт;
Перем тзМаркиВБ, тзНашиМарки, НераспознанныеМаркиВБ, ОтсутствуютВМаркиВБ, МаркиУПД, тзМаркиКонтр, тзМарки, ТЗНайденыУНас, ТзНужноЗавести;





//ДляЛенты

//Нечаева 09,04,18+++
Функция ТаблицаНомеклатурыВПаллетах(ДокОб)
	
	
	//Соберем Таблицу Для Ленты.
	//первая часть по коробкам
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ПаллетаЛистыНабора.Ссылка КАК Паллета,
	|	ПаллетаЛистыНабора.Описание КАК НомерКоробки,
	|	ПаллетаЛистыНабора.Ссылка.ОкончаниеПаллетирования КАК ОкончаниеПаллетирования,
	|	ПаллетаЛистыНабора.ШКЛистаНабора,
	|	ПаллетаЛистыНабора.ЛистНабора,
	|	ПаллетаЛистыНабора.Ссылка.SSCCКод
	|ИЗ
	|	Документ.Паллета.ЛистыНабора КАК ПаллетаЛистыНабора
	|ГДЕ
	|	ПаллетаЛистыНабора.Ссылка.Проведен
	|	И ПаллетаЛистыНабора.Документ.Ссылка = &Документ
	|	И ПаллетаЛистыНабора.Ссылка.ОкончаниеПаллетирования <> &ОкончаниеПаллетирования
	|	И ПаллетаЛистыНабора.ЛистНабора.ТипШК = &Коробка";
	
	запрос.УстановитьПараметр("Документ", ДокОбъект.ссылка);
	запрос.УстановитьПараметр("Коробка", перечисления.ТипыШтрихКодов.Коробка);
	запрос.УстановитьПараметр("ОкончаниеПаллетирования",ПустаяДата());
	
	СписокСтрокизПаллет=запрос.Выполнить().Выгрузить();
	СписокСтрокизПаллет.Колонки.Добавить("Количество");
	СписокСтрокизПаллет.Колонки.Добавить("Номенклатура");
	
	
	Для Каждого Строка из СписокСтрокизПаллет Цикл
		
		ШККоробок = Новый ТаблицаЗначений;
		
		ШККоробок =  ПолучитьСписокШКкоробокЛистаНабора(Строка.ЛистНабора);
		// ищем По ШК и прописываем количество.
		ТекНомер = Строка.НомерКоробки;
		
		НайденнаяСтрока = ШККоробок.Найти(Число(ТекНомер), "НомерКоробки");
		Если НайденнаяСтрока = Неопределено Тогда
			//Предупреждение("Товар не найден!");
		Иначе
			
			Строка.Номенклатура = НайденнаяСтрока.Номенклатура;
			Строка.Количество = НайденнаяСтрока.Номенклатура.Родитель.ШтукВКоробке;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// вторая часть по блочкам и штукам
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПаллетаЛистыНабора.Ссылка КАК Паллета,
	|	ПаллетаЛистыНабора.ЛистНабора,
	|	ВЫРАЗИТЬ(ПаллетаЛистыНабора.Ссылка.SSCCКод КАК СТРОКА(50)) КАК SSCCКод
	|ИЗ
	|	Документ.Паллета.ЛистыНабора КАК ПаллетаЛистыНабора
	|ГДЕ
	|	ПаллетаЛистыНабора.Ссылка.Проведен
	|	И ПаллетаЛистыНабора.Документ.Ссылка = &Документ
	|	И ПаллетаЛистыНабора.Ссылка.ОкончаниеПаллетирования <> &ОкончаниеПаллетирования
	|	И ПаллетаЛистыНабора.ЛистНабора.ТипШК <> &Коробка";
	
	запрос.УстановитьПараметр("Документ", ДокОбъект.ссылка);
	запрос.УстановитьПараметр("Коробка", перечисления.ТипыШтрихКодов.Коробка);
	запрос.УстановитьПараметр("ОкончаниеПаллетирования",ПустаяДата());
	
	СписокСтрокизПаллет2=запрос.Выполнить().Выгрузить();
	СписокСтрокизПаллет2.Колонки.Добавить("Количество");
	СписокСтрокизПаллет2.Колонки.Добавить("Номенклатура");
	
	
	Для Каждого Строка из СписокСтрокизПаллет2 Цикл
		
		// весь лист набора это 1 коробка, просто переносим данные из Листа набора целиком в таблицу по этой Паллете.
		ЛНТовары = Строка.ЛистНабора.Товары;
		Для каждого ТекСтрока Из ЛНТовары Цикл
			
			НовСтр = СписокСтрокизПаллет.Добавить();
			НовСтр.Номенклатура = ТекСтрока.Номенклатура;
			НовСтр.SSCCКод = СокрЛП(Строка.SSCCКод)     ;
			НовСтр.ЛистНабора = Строка.ЛистНабора;
			НовСтр.Паллета = Строка.Паллета;
			НовСтр.количество = ТекСТрока.Количество; // тут всегда кол-во штук.
			
		КонецЦикла;
		
	КонецЦикла;
	
	СписокСтрокИзПаллет.Свернуть("Номенклатура, SSCCКод","Количество");
	СписокСтрокИзПаллет.Сортировать("Номенклатура");
	
	возврат  СписокСтрокИзПаллет;
	
	
	
КонецФункции
//Нечаева 09,04,18---


Функция МакетВТаблицуЗначений(Макет, _ТЗ=Неопределено, флДобавлятьКолонки=истина) Экспорт
	Перем ТЗ;
	
	Если _ТЗ=Неопределено Тогда
		ТЗ=Новый ТаблицаЗначений();
		флЗаполняем=ложь;
	Иначе
		ТЗ=_ТЗ;
		флЗаполняем=истина;
	КонецЕсли;
	
	//Считываем колонки
	КоличествоКолонок=0;
	ИменаКолонок=Новый Массив();
	Кол=1;
	Пока истина Цикл
		Адрес="R1C"+Формат(Кол,"ЧГ=");
		ИмяКол=Макет.Область(Адрес).Текст;
		Если ПустаяСтрока(ИмяКол) Тогда
			Прервать;
		КонецЕсли;
		КоличествоКолонок=КоличествоКолонок+1;
		Если НЕ флЗаполняем или (флЗаполняем И флДобавлятьКолонки) И ТЗ.Колонки.Найти(ИмяКол)=Неопределено Тогда
			ТЗ.Колонки.Добавить(ИмяКол);
		КонецЕсли;
		ИменаКолонок.Добавить(ИмяКол);
		Кол=Кол+1;
	КонецЦикла;
	
	//Считываем строки
	Стр=2; Кол=1;
	Пока истина Цикл
		Вставлено=ложь; Первая=истина;
		Для Инд=1 По КоличествоКолонок Цикл
			Адрес="R"+Формат(Стр,"ЧГ=")+"C"+Формат(Инд,"ЧГ=");
			Зн=СокрЛП(Макет.Область(Адрес).Текст);
			Если ПустаяСтрока(Зн) Тогда
				Продолжить;
			КонецЕсли;
			Если Первая Тогда
				ТСтр=ТЗ.Добавить();
				Первая=ложь;
				Вставлено=истина;
			КонецЕсли;
			ИмяКолонки=ИменаКолонок[Инд-1];
			Если ТЗ.Колонки.Найти(ИмяКолонки)<>Неопределено Тогда
				Если флЗаполняем Тогда
					//Проверяем тип - число, строка, булево
					ОписаниеТипаКолонки=ТЗ.Колонки[ИмяКолонки].ТипЗначения;
					Если ОписаниеТипаКолонки.СодержитТип(Тип("Число")) Тогда
						РезЗн=Число(Зн);
					ИначеЕсли ОписаниеТипаКолонки.СодержитТип(Тип("Строка")) Тогда
						РезЗн=Строка(Зн);
					ИначеЕсли ОписаниеТипаКолонки.СодержитТип(Тип("Булево")) Тогда
						РезЗн=Булево(Зн);
					ИначеЕсли ОписаниеТипаКолонки.СодержитТип(Тип("Дата")) Тогда
						РезЗн=Дата(Зн);
					Иначе
						РезЗн=Зн;
					КонецЕсли;
				Иначе
					РезЗн=Зн;
				КонецЕсли;
				ТСтр[ИмяКолонки]=РезЗн;
			КонецЕсли;
		КонецЦикла;
		Если Не вставлено Тогда
			Прервать;
		КонецЕсли;
		Стр=Стр+1;
		Кол=1;
	КонецЦикла;
	
	Возврат ТЗ;
	
КонецФункции

//нечаева 13,01,15+++
Функция ПолучитьСдвигДатыАвизации(Документ)
	если 1=2 тогда
		документ=Документы.РасходнаяНакладная.НайтиПоНомеру();
	КонецЕсли;
	
	ДатаПД= Документ.ДатаПриемки-Документ.ПунктДоставки.ДнейВпути*24*3600;
	
	Сдвиг=0;
	если ДеньНедели(ДатаПд-Сдвиг)=6 тогда
		Сдвиг=Сдвиг+24*60*60; // пятница
	ИначеЕсли ДеньНедели(ДатаПд-Сдвиг)=7 тогда
		Сдвиг=Сдвиг+2*24*60*60;         // пятница
	КонецЕсли;
	
	
	
	
	//запрос=новый запрос;
	//запрос.текст="ВЫБРАТЬ различные 
	//|	ДопРеквизитыСправочников.ЗначениеРеквизита КАК ДеньНедели
	//|ИЗ
	//|	РегистрСведений.ДопРеквизитыСправочников КАК ДопРеквизитыСправочников
	//|ГДЕ
	//|	ДопРеквизитыСправочников.ИмяРеквизита = ""ДеньОтгрузкиДляРНК""
	//|	И ДопРеквизитыСправочников.Справочник = &Справочник
	//|	И ДопРеквизитыСправочников.ВспомогательноеЗначениеРеквизита=истина";
	//запрос.УстановитьПараметр("Справочник",Документ.ПунктДоставки);	
	//результат=запрос.Выполнить().Выгрузить();
	//если результат.Количество()=0 тогда
	//	Сдвиг=0;
	//	если ДеньНедели(Документ.ДатаОтгрузки+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=6 тогда
	//		Сдвиг=Сдвиг+24*60*60;
	//	ИначеЕсли ДеньНедели(Документ.ДатаОтгрузки+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=7 тогда
	//		Сдвиг=Сдвиг+2*24*60*60;
	//	КонецЕсли;
	//	
	//	возврат Сдвиг;
	//иначе
	//	тз=новый СписокЗначений;
	//	для Каждого СтрРезультата из результат цикл
	//		если СтрРезультата.деньнедели="Понедельник" тогда
	//			текдень=1;
	//		иначеесли СтрРезультата.деньнедели="Вторник" тогда
	//			текдень=2;
	//		иначеесли СтрРезультата.деньнедели="Среда" тогда
	//			текдень=3;
	//		иначеесли СтрРезультата.деньнедели="Четверг" тогда
	//			текдень=4;
	//		иначеесли СтрРезультата.деньнедели="Пятница" тогда
	//			текдень=5;
	//		иначеесли СтрРезультата.деньнедели="Суббота" тогда
	//			текдень=6;			
	//		иначеесли СтрРезультата.деньнедели="Воскресенье" тогда
	//			текдень=7;
	//		КонецЕсли;		
	//		тз.Добавить(текдень);		
	//	КонецЦикла;
	//	тз.СортироватьПоЗначению();
	//	для Каждого СтрСписка из тз цикл
	//		если ДеньНедели(Документ.ДатаОтгрузки)<=СтрСписка.Значение тогда
	//			НашлиСдвиг=Истина;
	//			Сдвиг=(СтрСписка.Значение-ДеньНедели(Документ.ДатаОтгрузки))*24*60*60;
	//			если ДеньНедели(Документ.ДатаОтгрузки+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=6 тогда
	//				Сдвиг=Сдвиг+24*60*60;
	//			ИначеЕсли ДеньНедели(Документ.ДатаОтгрузки+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=7 тогда
	//				Сдвиг=Сдвиг+2*24*60*60;
	//			КонецЕсли;
	//			возврат Сдвиг;
	//		КонецЕсли;
	//	КонецЦикла;
	//	Сдвиг=(тз.Получить(0).Значение+7-ДеньНедели(Документ.ДатаАвизации))*24*60*60;
	//	если ДеньНедели(Документ.ДатаАвизации+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=6 тогда
	//		Сдвиг=Сдвиг+24*60*60;
	//	ИначеЕсли ДеньНедели(Документ.ДатаОтгрузки+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=7 тогда
	//		Сдвиг=Сдвиг+2*24*60*60;
	//	КонецЕсли;
	//	
	//	возврат Сдвиг;
	
	//КонецЕсли;
	
	
	возврат сдвиг;	
	
	
КонецФункции
//нечаева 13,01,15---


//крохин начало
Функция ПолучитьДатуОплаты1(ДатаОтгрузки,ОтсрочкаПлатежа)  Экспорт
	Если   ДатаОтгрузки = '00010101000000' Тогда
		Возврат  '00010101000000'
	Иначе
		Если  ОтсрочкаПлатежа.ВидОтсрочки = Перечисления.ВидыОтсрочки.БанковскиеДни Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	КалендарьДни.Дата КАК Дата
			|ИЗ
			|	Справочник.Календарь.Дни КАК КалендарьДни
			|ГДЕ
			|	КалендарьДни.Дата >= &ДатаОтгрузки
			|	И КалендарьДни.Часы <> 0
			|	И (НЕ КалендарьДни.Ссылка.ПометкаУдаления)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата
			|АВТОУПОРЯДОЧИВАНИЕ";
			Запрос.УстановитьПараметр("ДатаОтгрузки",ДатаОтгрузки);
			Выборка = Запрос.Выполнить().Выбрать();
			НПП = 0;
			Пока Выборка.Следующий() Цикл
				
				Если НПП = ОтсрочкаПлатежа.Отсрочка Тогда
					Возврат Выборка.Дата;	
				Конецесли;
				НПП = НПП + 1;
			КонецЦикла;
			
			Возврат ДатаОтгрузки+ОтсрочкаПлатежа.Отсрочка*24*60*60;		
		Иначе		
			Возврат ДатаОтгрузки+ОтсрочкаПлатежа.Отсрочка*24*60*60;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции
//крохин конец


Функция УбратьНули(Номер,Признак)
	// убираем лидирующие нули, если стоит признак в контрагенте
	Если Не Признак Тогда
		возврат Номер;
	КонецЕсли;
	
	Для НН=1 по СтрДлина(Номер) Цикл
		Проверка=Лев(Номер,1);
		Если Проверка="0" Тогда
			Номер=Прав(Номер,СтрДлина(Номер)-1);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Номер;
	
КонецФункции

//  Процедура определяет ситуацию, когда при изменении своей даты документ 
//  оказывается в другом периоде нумерации документов, и в это м случае
//  присваивает документу новый уникальный номер.
//
// Параметры:
//  ДокументОбъект         - контекст документа,из которого вызвана процедура 
//  НачальнаяДатаДокумента - начальная дата документа 
// 
Функция ПроверитьНомерДокумента2(ДокументОбъект, НачальнаяДатаДокумента,Предупреждать=Истина) Экспорт   // в разработке
	
	// Определяем назначенную для данного вида документов периодичность смены номера
	ПериодСменыНомера = ДокументОбъект.Метаданные().ПериодичностьНомера;
	
	//В зависимости от установленной периодичности смены номеров,
	//определяем разность старой и новой датами документа.
	РазностьДат=0;
	
	Если ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Год Тогда
		РазностьДат = НачалоГода(НачальнаяДатаДокумента) - НачалоГода(ДокументОбъект.Дата);
		
	ИначеЕсли ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Квартал Тогда
		РазностьДат = НачалоКвартала(НачальнаяДатаДокумента) - НачалоКвартала(ДокументОбъект.Дата);
		
	ИначеЕсли ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Месяц Тогда
		РазностьДат = НачалоМесяца(НачальнаяДатаДокумента) - НачалоМесяца(ДокументОбъект.Дата);
		
	ИначеЕсли ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.День Тогда
		РазностьДат = НачальнаяДатаДокумента - ДокументОбъект.Дата; 
	КонецЕсли;
	
	Если РазностьДат <> 0 Тогда
		Если Предупреждать Тогда
			//Ответ=Вопрос("Изменена дата документа ! Номер документа будет изменен ! Продолжать ?",РежимДиалогаВопрос.ДаНет);
			//Если Ответ<>КодВозвратаДиалога.Да Тогда
			//	Возврат Ложь;			
			//КонецЕсли;
		КонецЕсли;		
		//УстановитьНомерДокументаКлиентСервер(ДокументОбъект);
		УстановитьНомерДокументаКлиентСервер(ДокументОбъект);
	КонецЕсли;
	
	Возврат Истина;
КонецФункции// ПроверитьНомерДокумента()

Функция ПерваяСФ2(Префикс,Дата)Экспорт 
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ
	|	Документ.СчетФактура КАК СчетФактура
	|ГДЕ
	|	Дата МЕЖДУ &Дата1 И &Дата2
	|	И Номер ПОДОБНО &Номер
	|	И НЕ ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Дата));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата));
	Запрос.УстановитьПараметр("Номер",Префикс+"%");		
	
	Возврат Запрос.Выполнить().Пустой();
КонецФункции //ПерваяСФ(Префикс,Дата)

// Процедура устанавливает номер документа.
//
// Параметры:
//  ДокументОбъект  - ДокументОбъект. Экземпляр документа, которому 
//                    необходимо присвоить новый номер
//
Функция УстановитьНормальныйНовыйНомер2(ДокументОбъект,Префикс,КоличествоПропусков=0)Экспорт 
	МетаДок=ДокументОбъект.Метаданные();	
	Периодичность=МетаДок.ПериодичностьНомера;
	ДлинаЧисловойЧасти=МетаДок.ДлинаНомера-СтрДлина(СокрЛП(Префикс));;
	
	Если МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Год Тогда
		Дата1=НачалоГода(ДокументОбъект.Дата);	
		Дата2=КонецГода(ДокументОбъект.Дата);	
	ИначеЕсли МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Квартал Тогда
		Дата1=НачалоКвартала(ДокументОбъект.Дата);	
		Дата2=КонецКвартала(ДокументОбъект.Дата);					
	ИначеЕсли МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Месяц Тогда
		Дата1=НачалоМесяца(ДокументОбъект.Дата);	
		Дата2=КонецМесяца(ДокументОбъект.Дата);					
	ИначеЕсли МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.День Тогда
		Дата1=НачалоДня(ДокументОбъект.Дата);	
		Дата2=КонецДня(ДокументОбъект.Дата);
	Иначе
		Дата1=Неопределено;		
		Дата2=Неопределено;
	КонецЕсли;
	
	Шаблон=СокрЛП(Префикс);
	Для Сч=1 По ДлинаЧисловойЧасти Цикл
		Шаблон=Шаблон+"[0-9]";	
	КонецЦикла;
	Запрос=Новый Запрос;
	
	Запрос.Текст="
	|ВЫБРАТЬ
	|	МАКСИМУМ(Номер) КАК Номер
	|ИЗ
	|	Документ."+МетаДок.Имя+"
	|ГДЕ
	|	"+?(Дата1=Неопределено,"","Дата МЕЖДУ &Дата1 И &Дата2 И ")+"
	|	Номер ПОДОБНО &Шаблон";
	
	Запрос.УстановитьПараметр("Шаблон",Шаблон);
	
	Если Дата1<>Неопределено Тогда
		Запрос.УстановитьПараметр("Дата1",Дата1);
		Запрос.УстановитьПараметр("Дата2",Дата2);
	КонецЕсли;
	
	НомерДока		=Неопределено;
	ПоследнийНомер =0;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.Номер) Тогда
			НомерДока		=Выборка.Номер;
			ПоследнийНомер	=Число(СтрЗаменить(Выборка.Номер,СокрЛП(Префикс),""));
		КонецЕсли;		
	КонецЕсли;	
	
	Коэффициент=1;
	Если НомерДока<>Неопределено Тогда	
		ПоследнийДок=Документы[МетаДок.Имя].НайтиПоНомеру(НомерДока,ДокументОбъект.Дата);
		Если ПоследнийДок<>Неопределено Тогда
			Коэффициент=Цел(Макс(1,(КонецДня(ДокументОбъект.Дата)-КонецДня(ПоследнийДок.Дата))/(24*60*60)));
		КонецЕсли;
	КонецЕсли;
	
	ДокументОбъект.Номер=СокрЛП(Префикс)+Формат(ПоследнийНомер+1+КоличествоПропусков*Коэффициент,"ЧЦ="+ДлинаЧисловойЧасти+"; ЧВН=");
КонецФункции //УстановитьНормальныйНовыйНомер(ДокументОбъект,Префикс,КоличествоПропусков=0)

// Процедура устанавливает номер документа.
//
// Параметры:
//  ДокументОбъект  - ДокументОбъект. Экземпляр документа, которому 
//                    необходимо присвоить новый номер
//
Процедура УстановитьНомерДокумента2(ДокументОбъект) Экспорт
	// Если  нет реквизита "Организация" или для нее не задан префикс, то 
	// используем пустой префикс,
	// иначе используем префикс организации.
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	ДопБуква="";
	Если МетаданныеДокумента.Имя="РасходнаяНакладная" Тогда
		ДопБуква=?(ДокументОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН,"б","а");
	ИначеЕсли МетаданныеДокумента.Имя="ОтчетКассовойСмены" Тогда
		ДопБуква=?(ДокументОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН,"кб","кн");	
	КонецЕсли; 
	
	Вид=МетаданныеДокумента.Имя;
	Если Вид="ЛистНабора" Тогда
		ДокументОбъект.УстановитьНовыйНомер(СокрЛП(ДокументОбъект.ДокОснование.Номер)+"/");
	ИначеЕсли Вид="СчетФактура" Тогда 		
		Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
			Префикс=ПараметрыСеанса.ЭтотУзел.Код;
		Иначе
			ПрефиксКонтрагента="";
			
			Если ДокументОбъект.Накладные.Количество()>0 Тогда
				Накладная=ДокументОбъект.Накладные[0].Накладная;
				Если ЕстьРеквизитДокумента("ПунктДоставки",Накладная.Метаданные()) И ЗначениеЗаполнено(Накладная.ПунктДоставки.ПрефиксСФ) Тогда
					ПрефиксКонтрагента=СокрЛП(Накладная.ПунктДоставки.ПрефиксСФ);
				КонецЕсли;			
			КонецЕсли;			
			
			Если ПустаяСтрока(ПрефиксКонтрагента) Тогда
				ПрефиксКонтрагента=СокрЛП(ПолучитьРеквизитРодителя(ДокументОбъект.Контрагент,"ПрефиксСФ"));			
			КонецЕсли; 
			
			Если ПустаяСтрока(ПрефиксКонтрагента) Тогда
				ПрефиксСклада	=СокрЛП(ДокументОбъект.Склад.Префикс);
				ПрефиксИБ		=СокрЛП(ДокументОбъект.Склад.ПрефиксИБ);
				
				Если ПрефиксИБ="SNL" Тогда
					Префикс=ПрефиксИБ;
				Иначе
					Префикс=?(НЕ ПустаяСтрока(ДокументОбъект.Организация.Префикс),СокрЛП(ДокументОбъект.Организация.Префикс)+ПрефиксСклада,ДокументОбъект.ИБ.Код);				
				КонецЕсли;				
			Иначе				
				Префикс=?(НЕ ПустаяСтрока(ДокументОбъект.Организация.Префикс),СокрЛП(ДокументОбъект.Организация.Префикс)+ПрефиксКонтрагента,ДокументОбъект.ИБ.Код);			
			КонецЕсли;			
		КонецЕсли; 
		
		Если ПерваяСФ2(Префикс,ДокументОбъект.Дата) Тогда
			Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
				КоличествоПропусков=2;			
			ИначеЕсли Лев(Префикс,2)="КБ" Тогда
				КоличествоПропусков=4;
			Иначе	
				КоличествоПропусков=1;						
			КонецЕсли;			
		Иначе
			КоличествоПропусков=0;
		КонецЕсли;
		
		//Если Префикс = "SSP" тогда Префикс = "SST" КонецЕсли;
		
		УстановитьНормальныйНовыйНомер2(ДокументОбъект,Префикс+"-",КоличествоПропусков);
	ИначеЕсли ЕстьРеквизитДокумента("ИБ",МетаданныеДокумента) Тогда
		ЭтотУзел=ПараметрыСеанса.ЭтотУзел;
		
		Если МетаданныеДокумента.Имя="РасходнаяНакладная" И СокрЛП(ДокументОбъект.Контрагент.Код)="SSP-8643" Тогда		
			
			//КодИБ="SSP";
			
			КодИБ = "SSP";
			// нечаева 29,06,15+++
			ПрефиксИБ = "SSP";
			// нечаева 29,06,15-
			
			
			
			//крохин начало 02.08.2021		
			////Нечаева 30.11.20+
			//Если ДокументОбъект.Дата>Дата(2020,12,01) и ДокументОбъект.Дата<Дата(2021,01,01) Тогда
			//	КодИБ = "SST";
			//	ПрефиксИБ="SST";
			//иначе
			//	КодИБ = "SSP";
			//	// нечаева 29,06,15+++
			//	ПрефиксИБ = "SSP";
			//	// нечаева 29,06,15---
			//КонецЕсли;
			////Нечаева 30.11.20--
			Если ДеньГода(ДокументОбъект.Дата) > 334 Тогда
				КодИБ = "SST";
				ПрефиксИБ="SST";
			ИначеЕсли ДеньГода(ДокументОбъект.Дата) > 181 Тогда
				КодИБ = "SSV";
				ПрефиксИБ="SSV";	
			иначе
				КодИБ = "SSP";
				ПрефиксИБ = "SSP";
			КонецЕсли;
			//крохин конец 02.08.2021
			
		Иначе
			Если ЕстьРеквизитДокумента("Склад",МетаданныеДокумента) Тогда
				ПрефиксИБ=ДокументОбъект.Склад.ПрефиксИБ;
				
				ПрефиксИБ = "SSP";
				
				//
				//Если ДокументОбъект.Дата>Дата(2015,06,28) и ДокументОбъект.Дата<Дата(2016,01,01) Тогда
				//	
				//	ПрефиксИБ="SST";
				//иначе
				//	
				//	// нечаева 29,06,15+++
				//	ПрефиксИБ = "SSP";
				//	// нечаева 29,06,15---
				//КонецЕсли;
				//		
				
				
				//крохин начало 02.08.2021
				////Нечаева 13,12,18++
				//Если ДокументОбъект.Дата>Дата(2020,12,01) и ДокументОбъект.Дата<Дата(2021,01,01) Тогда
				//	КодИБ = "SST";
				//	ПрефиксИБ="SST";
				//иначе
				//	КодИБ = "SSP";
				//	// нечаева 29,06,15+++
				//	ПрефиксИБ = "SSP";
				//	// нечаева 29,06,15---
				//КонецЕсли;
				////Нечаева 13,12,18--
				Если ДеньГода(ДокументОбъект.Дата) > 334 Тогда
					КодИБ = "SST";
					ПрефиксИБ="SST";
				ИначеЕсли ДеньГода(ДокументОбъект.Дата) > 181 Тогда
					КодИБ = "SSV";
					ПрефиксИБ="SSV";	
				иначе
					КодИБ = "SSP";
					ПрефиксИБ = "SSP";
				КонецЕсли;
				
				//крохин конец 02.08.2021
				
				
			КонецЕсли;		
			Если ПустаяСтрока(ПрефиксИБ) Тогда
				ПрефиксИБ=ДокументОбъект.ИБ.Код;			
			КонецЕсли; 
			
			КодИБ=?(ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение,ПрефиксИБ,ЭтотУзел.Код);	
			//крохин начало 10.01.2015
			//пока не надо
			//Если КодИБ="SSP" Тогда КодИБ = "SST" КонецЕсли;
			//крохин конец 10.01.2015
			
			
		КонецЕсли;	
		
		//// нечаева временно  220622
		КодИБ = "SSK";
		ПрефиксИБ="SSK";
		
		
		
		Если МетаданныеДокумента.Имя="ПриходнаяНакладная" И КодИБ="SSP" Тогда
			ДокументОбъект.УстановитьНовыйНомер(КодИБ+"-0");
		Иначе
			ДокументОбъект.УстановитьНовыйНомер(КодИБ+ДопБуква+"-");
		КонецЕсли;		
	ИначеЕсли Вид="УслугиСтороннихОрганизаций" Тогда
		Префикс=ДокументОбъект.Организация.Префикс+"-";
		ДокументОбъект.УстановитьНовыйНомер(Префикс);
	Иначе
		попытка
			КодИБ=ПараметрыСеанса.ЭтотУзел.Код;
			
			ДокументОбъект.УстановитьНовыйНомер(КодИБ+"-");	
			
		исключение
		конецПопытки;
	КонецЕсли;	
КонецПроцедуры // УстановитьНомерДокумента()

Функция КоличествоПД2(Контрагент) Экспорт
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ссылка) КАК Количество
		|ИЗ
		|	Справочник.ПунктыДоставки КАК ПунктыДоставки
		|ГДЕ
		|	Владелец = &Владелец";
		
		Запрос.УстановитьПараметр("Владелец",Контрагент);
		
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Количество;			
		КонецЕсли;		
	КонецЕсли;
	
	Возврат 0;
КонецФункции //КоличествоПД(Контрагент)

Функция ПолучитьДоговорыКорагента(Контрагент,Организация=Неопределено)
	МассивДоговоров=Новый Массив;
	
	КодЦБ=?(ПустаяСтрока(Контрагент.КодЦБ),Контрагент.Код,Контрагент.КодЦБ);
	
	Выборка=Справочники.Договоры.Выбрать(,,Новый Структура("КодЦБ",КодЦБ));
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка.неиспользовать тогда
			продолжить;
		КонецЕсли;	
		МассивДоговоров.Добавить(Выборка.Ссылка);
	КонецЦикла; 
	
	Возврат МассивДоговоров;
КонецФункции // ПолучитьДОговорыКорагента()


функция найтиПунтДоставкиПоГЛН(ИЛНПунктаДоставки)
	
	ПунктДоставки=Справочники.ПунктыДоставки.ПустаяСсылка();
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	аа.Ссылка,
	|	аа.Владелец,
	|	аа.комментарий КАК комментарий
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПунктыДоставки.Ссылка КАК Ссылка,
	|		ПунктыДоставки.Ссылка.Владелец КАК Владелец,
	|		ВЫРАЗИТЬ(ПунктыДоставки.Комменатрий КАК СТРОКА(100)) КАК комментарий
	|	ИЗ
	|		Справочник.ПунктыДоставки.ИЛН КАК ПунктыДоставки
	|	ГДЕ
	|		ПунктыДоставки.КодИЛН = &ТекКод
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПунктыДоставки.Ссылка,
	|		ПунктыДоставки.Ссылка.Владелец,
	|		""""
	|	ИЗ
	|		Справочник.ПунктыДоставки КАК ПунктыДоставки
	|	ГДЕ
	|		ПунктыДоставки.КодИЛН = &ТекКод) КАК аа
	|
	|УПОРЯДОЧИТЬ ПО
	|	комментарий";
	
	Запрос.УстановитьПараметр("ТекКод",СокрЛП(ИЛНПунктаДоставки));
	Выборка = запрос.Выполнить().Выбрать();
	Если выборка.Следующий() Тогда
		ПунктДоставки=выборка.ссылка;
		
	Конецесли; 
	
	возврат ПунктДоставки ;
	
конецФункции	

//Катаев+ 25/04/13
Процедура Притормозить(Н)
	Если Н  = 1  Тогда
		ВремяНачала = ТекущаяДата();
		ВремяОкончания = ВремяНачала +Н;
		Пока ВремяОкончания >= ТекущаяДата() Цикл
			
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры
//Катаев- 25/04/13


//нечаева  28,08,19 добавлен ШКконтаргента дополнительный по GS1
Функция НайтиПОШКМатрица(ШК,Артикул,НамТовара="",Контрагент,НомЗак= "", ДатаДок)Экспорт
	
	НайденнаяНоменклатура=Справочники.Номенклатура.ПустаяСсылка();
	
	  	
		//ищем по артикулу  , для гипеглобуса без ограницения по дате, вернуть могут старый товар, с закрытой матрицей
		
		// Катаев+ 12/03/13 Исключаем поиск ШК если Артикул = Неопределено
		Если Артикул <> "" Тогда
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	МатрицаТовары.Номенклатура,
			|	МатрицаТовары.ШККонтрагента,
			|	МатрицаТовары.АртикулКонтрагента,
			|	МатрицаТовары.Цена
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|ГДЕ
			|	МатрицаТовары.Ссылка.Контрагент = &Контрагент
			//|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
			|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА
			|	И МатрицаТовары.АртикулКонтрагента ПОДОБНО &ТекАрт";
			
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("ТекАрт","%"+Артикул+"%");
			Запрос.УстановитьПараметр("ТекДата",Датадок);
			
			Рез=Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() Тогда
				Возврат Рез.Номенклатура;
			КонецЕсли;
		КонецЕсли;
	
	
		
		Если ШК <> "" Тогда
			
			// ищем по ШК
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	МатрицаТовары.Номенклатура КАК Номенклатура,
			|	МатрицаТовары.ШККонтрагента КАК ШККонтрагента,
			|	МатрицаТовары.ШККонтрагентаДополнительный КАК ШККонтрагентаДополнительный,
			|	МатрицаТовары.АртикулКонтрагента КАК АртикулКонтрагента,
			|	МатрицаТовары.Цена КАК Цена
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|ГДЕ
			|	(МатрицаТовары.ШККонтрагента = &ТекШК
			|			ИЛИ МатрицаТовары.ШККонтрагентаДополнительный = &ТекШК)
			|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
			//|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
			|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА";
			
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("ТекШк",ШК);
			Запрос.УстановитьПараметр("ТекДата",ДатаДок);
			
			Рез=Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() Тогда
				Возврат Рез.Номенклатура;
			КонецЕсли;
		конецЕсли;
		
		
	
	возврат НайденнаяНоменклатура;
	//----------------------------------------------------------------------------
КонецФункции // НайтиПОШК()

//нечаева  28,08,19 добавлен ШКконтаргента дополнительный по GS1
Функция НайтиПОШКМатрица2(ШК,Артикул,НамТовара="",Контрагент,НомЗак= "")Экспорт
	
	НайденнаяНоменклатура=Справочники.Номенклатура.ПустаяСсылка();
	
	ИспШтрихКодАртикул=контрагент.ИспШтрихКодАртикул;
	Если ИспШтрихКодАртикул=0 Тогда
		ИспШтрихКодАртикул=1;
	КонецЕсли;	
	
	//---------------------------------------------------------------------------
	
	
	// выбираем нужный документ матрица.
	Если ИспШтрихКодАртикул=1 Тогда
		
		///нечаева 22,10,18++
		// для тандер проверим еще на то, есть ли комплектующие с таким Шк, если есть, то берем эту номенклатуру.
		Если Контрагент.код = "SSP-3881" Тогда
			Если Артикул <> Неопределено Тогда
				Запрос=Новый Запрос;
				Запрос.Текст="ВЫБРАТЬ
				|	МатрицаТовары.ШККонтрагента,
				|	МатрицаТовары.АртикулКонтрагента,
				|	МатрицаТовары.Цена,
				|	ВложенныйЗапрос.Ссылка как ссылка
				|ИЗ
				|	(ВЫБРАТЬ
				|		СУММА(1) КАК Количество,
				|		НоменклатураКоплектующие.Ссылка КАК Ссылка
				|	ИЗ
				|		Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
				|	
				|	СГРУППИРОВАТЬ ПО
				|		НоменклатураКоплектующие.Ссылка) КАК ВложенныйЗапрос
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Матрица.Товары КАК МатрицаТовары
				|		ПО МатрицаТовары.Номенклатура = ВложенныйЗапрос.Ссылка
				|ГДЕ
				|	 МатрицаТовары.АртикулКонтрагента ПОДОБНО &ТекАрт
				|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
				|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
				|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА";
				
				Запрос.УстановитьПараметр("Контрагент",Контрагент);
				Запрос.УстановитьПараметр("ТекАрт",Артикул);
				Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
				
				Рез=Запрос.Выполнить().Выбрать();
				Если Рез.Следующий() Тогда
					Возврат Рез.ссылка;
				КонецЕсли;
				
			КонецЕсли;
			
		конецЕсли;
		///нечаева 22,10,18---
		
		// ищем по ШК
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура КАК Номенклатура,
		|	МатрицаТовары.ШККонтрагента КАК ШККонтрагента,
		|	МатрицаТовары.ШККонтрагентаДополнительный КАК ШККонтрагентаДополнительный,
		|	МатрицаТовары.АртикулКонтрагента КАК АртикулКонтрагента,
		|	МатрицаТовары.Цена КАК Цена
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	(МатрицаТовары.ШККонтрагента = &ТекШК
		|			ИЛИ МатрицаТовары.ШККонтрагентаДополнительный = &ТекШК)
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
		|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТекШк",ШК);
		Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
		
		Рез=Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() Тогда
			//Катаев+ 24/03/14 Для контрагентов участвующих в обмене ЭСФ критично несовпадение артикула и ШК из заказа и тем что занесено у нас.
			//катаев+ 28/08/14 Проверка неактуальна. Со слов менеджера в ЕКОД у Перекрестка есть и старые артикулы, которые они иногда и используют. В матрицах артикулы актуальны
			//Если Контрагент.ДатаНачалаЭСФ <> Дата(1,1,1) Тогда
			//	Если Артикул <> Рез.АртикулКонтрагента Тогда
			//		//Катаев+ 28/05/14 Записей может быть несколько. Проверяем каждую
			//		//КритичОшибки.Добавить("Для номенклатуры "+рез.Номенклатура+" не совпадает артикул из заказа ("+Артикул+") с артикулом из матрицы ("+Рез.АртикулКонтрагента+") для контрагента "+Контрагент);
			//		ЗаписьНайдена = Ложь;
			//		тНом = Рез.Номенклатура;
			//		Пока рез.Следующий() Цикл
			//			Если Артикул = Рез.АртикулКонтрагента Тогда
			//				ЗаписьНайдена = Истина;
			//				Прервать;
			//			КонецЕсли;
			//		КонецЦикла;
			//		Если Не ЗаписьНайдена Тогда
			//			КритичОшибки.Добавить("Для номенклатуры "+рез.Номенклатура+" в матрицах не найден артикул из заказа ("+Артикул+") для контрагента "+Контрагент);
			//			Возврат тНом;
			//		КонецЕсли;
			//		//Катаев- 28/05/14
			//	КонецЕсли;
			//КонецЕсли;
			//Катаев- 28/08/14
			//Катаев- 24/03/14
			Возврат Рез.Номенклатура;
		КонецЕсли;
		
		
		//ищем по артикулу
		// Катаев+ 12/03/13 Исключаем поиск ШК если Артикул = Неопределено
		Если Артикул <> Неопределено Тогда
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	МатрицаТовары.Номенклатура,
			|	МатрицаТовары.ШККонтрагента,
			|	МатрицаТовары.АртикулКонтрагента,
			|	МатрицаТовары.Цена
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|ГДЕ
			|	МатрицаТовары.Ссылка.Контрагент = &Контрагент
			|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
			|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА
			|	И МатрицаТовары.АртикулКонтрагента ПОДОБНО &ТекАрт";
			
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("ТекАрт",Артикул);
			Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
			
			Рез=Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() Тогда
				//Катаев+ 19/08/14
				////Катаев+ 24/03/14 Для контрагентов участвующих в обмене ЭСФ критично несовпадение артикула и ШК из заказа и тем что занесено у нас.
				//Если Контрагент.ДатаНачалаЭСФ <> Дата(1,1,1) Тогда
				//	Если ШК <> Рез.ШККонтрагента Тогда
				//		//Катаев+ 28/05/14 Записей может быть несколько. Проверяем каждую
				//		//КритичОшибки.Добавить("Для номенклатуры "+рез.Номенклатура+" не совпадает ШК из заказа ("+ШК+") с ШК из матрицы ("+Рез.ШККонтрагента+") для контрагента "+Контрагент);
				//		ЗаписьНайдена = Ложь;
				//		тНом = Рез.Номенклатура;
				//		Пока рез.Следующий() Цикл
				//			Если ШК = Рез.ШККонтрагента Тогда
				//				ЗаписьНайдена = Истина;
				//				Прервать;
				//			КонецЕсли;
				//		КонецЦикла;
				//		Если Не ЗаписьНайдена Тогда
				//			КритичОшибки.Добавить("Для номенклатуры "+рез.Номенклатура+" в матрицах не найден ШК из заказа ("+ШК+") для контрагента "+Контрагент);
				//			Возврат тНом;
				//		КонецЕсли;
				//		//Катаев- 28/05/14
				//	КонецЕсли;
				//КонецЕсли;
				////Катаев- 24/03/14
				Возврат Рез.Номенклатура;
			КонецЕсли;
		КонецЕсли;
		// Катаев- 12/03113
	КонецЕсли;
	
	//---------------------------------------------------------------------------
	
	
	// выбираем нужный документ матрица.
	Если ИспШтрихКодАртикул=2 Тогда
		
		//ищем по артикулу
		// Катаев+ 12/03/13 Исключаем поиск ШК если Артикул = Неопределено
		Если Артикул <> Неопределено Тогда
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	МатрицаТовары.Номенклатура,
			|	МатрицаТовары.ШККонтрагента,
			//Катаев+ 25/09/14
			|	МатрицаТовары.ШККонтрагентаБлочок,
			//Катаев- 25/09/14
			|	МатрицаТовары.АртикулКонтрагента,
			|	МатрицаТовары.Цена
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|ГДЕ
			|	МатрицаТовары.Ссылка.Контрагент = &Контрагент
			|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
			|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА
			|	И МатрицаТовары.АртикулКонтрагента ПОДОБНО &ТекАрт	
			//нечаева 22,05,17+++
			|
			|УПОРЯДОЧИТЬ ПО
			|	ШККонтрагента УБЫВ";
			//нечаева 22,05,17---
			
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("ТекАрт",СокрЛП(Артикул));
			Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
			
			Рез=Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() Тогда
				//Катаев+ 24/03/14 Для контрагентов участвующих в обмене ЭСФ критично несовпадение артикула и ШК из заказа и тем что занесено у нас.
				//нечаева 12,04,16+++ добавила исключение по ленте, для нее другая проверка.
				Если Контрагент.ДатаНачалаЭСФ <> Дата(1,1,1) и не (Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSR-1593") )  Тогда
					//нечаева 12,04,16 ----
					Если ШК <> Рез.ШККонтрагента Тогда
						//Катаев+ 28/05/14 Записей может быть несколько. Проверяем каждую
						//КритичОшибки.Добавить("Для номенклатуры "+рез.Номенклатура+" не совпадает ШК из заказа ("+ШК+") с ШК из матрицы ("+Рез.ШККонтрагента+") для контрагента "+Контрагент);
						ЗаписьНайдена = Ложь;
						тНом = Рез.Номенклатура;
						Пока рез.Следующий() Цикл
							Если ШК = Рез.ШККонтрагента Тогда
								ЗаписьНайдена = Истина;
								Прервать;
							КонецЕсли;
						КонецЦикла;
						Если Не ЗаписьНайдена Тогда
							КритичОшибки.Добавить("Для номенклатуры "+рез.Номенклатура+" в матрицах не найден ШК ("+ШК+") из заказа ("+НомЗак+") для контрагента "+Контрагент);
							Возврат тНом;
						КонецЕсли;
						//Катаев- 28/05/14
					КонецЕсли;
				КонецЕсли;
				//Катаев- 24/03/14
				//Катаев+ 25/09/14 Для Ленты сверим совпадение ШК из заказа и ШК из матриц
				//Возврат Рез.Номенклатура;
				Если Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSR-1593") Тогда
					ТНоменклатура = Рез.Номенклатура;
					Если Не ПустаяСтрока(рез.ШККонтрагентаБлочок) Тогда
						ШК_Контр = рез.ШККонтрагентаБлочок;
					Иначе
						ШК_Контр = рез.ШККонтрагента;
					КонецЕсли;
					Если ШК_Контр <> ШК Тогда
						Ошибки.Добавить("Для номенклатуры "+рез.Номенклатура+" ШК из заказа ("+ШК+") не совпадает с ШК из матрицы("+ШК_Контр+") для контрагента "+Контрагент +" из заказа -"+НомЗак);
						Возврат ТНоменклатура;
					КонецЕсли;
					Пока рез.Следующий() Цикл
						Если Не ПустаяСтрока(рез.ШККонтрагентаБлочок) Тогда
							ШК_Контр = рез.ШККонтрагентаБлочок;
						Иначе
							ШК_Контр = рез.ШККонтрагента;
						КонецЕсли;
						Если ШК_Контр <> ШК Тогда
							Ошибки.Добавить("Для номенклатуры "+рез.Номенклатура+" ШК из заказа ("+ШК+") не совпадает с ШК из матрицы("+ШК_Контр+") для контрагента "+Контрагент+" из заказа -"+НомЗак);
							Возврат ТНоменклатура;
						КонецЕсли;
					КонецЦикла;
					Возврат ТНоменклатура;
				КонецЕсли;
				//Катаев- 25/09/14
			КонецЕсли;
		КонецЕсли;
		// Катаев- 12/03113
		
		// ищем по ШК
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура КАК Номенклатура,
		|	МатрицаТовары.ШККонтрагента КАК ШККонтрагента,
		|	МатрицаТовары.АртикулКонтрагента КАК АртикулКонтрагента,
		|	МатрицаТовары.Цена КАК Цена
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	(МатрицаТовары.ШККонтрагента = &ТекШК
		|			ИЛИ МатрицаТовары.ШККонтрагентаДополнительный = &ТекШК
		|			ИЛИ МатрицаТовары.ШККонтрагентаБлочок = &ТекШК)
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
		|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТекШк",ШК);
		Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
		
		Рез=Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() Тогда
			//Катаев+ 24/03/14 Для контрагентов участвующих в обмене ЭСФ критично несовпадение артикула и ШК из заказа и тем что занесено у нас.
			Если Контрагент.ДатаНачалаЭСФ <> Дата(1,1,1) Тогда
				Если Артикул <> Рез.АртикулКонтрагента Тогда
					//Катаев+ 28/05/14 Записей может быть несколько. Проверяем каждую
					//КритичОшибки.Добавить("Для номенклатуры "+рез.Номенклатура+" не совпадает артикул из заказа ("+Артикул+") с артикулом из матрицы ("+Рез.АртикулКонтрагента+") для контрагента "+Контрагент);
					ЗаписьНайдена = Ложь;
					тНом = Рез.Номенклатура;
					Пока рез.Следующий() Цикл
						Если Артикул = Рез.АртикулКонтрагента Тогда
							ЗаписьНайдена = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если Не ЗаписьНайдена Тогда
						КритичОшибки.Добавить("Для номенклатуры "+рез.Номенклатура+" в матрицах не найден артикул из заказа ("+Артикул+") для контрагента "+Контрагент+" из заказа -"+НомЗак);
						Возврат тНом;
					КонецЕсли;
					//Катаев- 28/05/14
				КонецЕсли;
			КонецЕсли;
			//Катаев- 24/03/14
			Возврат Рез.Номенклатура;
		КонецЕсли;
		
	КонецЕсли;
	
	
	// выбираем нужный документ матрица.
	Если ИспШтрихКодАртикул=3 Тогда
		
		
		// ищем по ШК
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура,
		|	МатрицаТовары.ШККонтрагента,
		|	МатрицаТовары.АртикулКонтрагента,
		|	МатрицаТовары.Цена
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	(МатрицаТовары.ШККонтрагента = &ТекШК
		|			ИЛИ МатрицаТовары.ШККонтрагентаДополнительный = &ТекШК)
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
		|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТекШк",ШК);
		Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
		
		Рез=Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() Тогда
			//Катаев+ 24/03/14 Для контрагентов участвующих в обмене ЭСФ критично несовпадение артикула и ШК из заказа и тем что занесено у нас.
			Если Контрагент.ДатаНачалаЭСФ <> Дата(1,1,1) Тогда
				Если Артикул <> Рез.АртикулКонтрагента Тогда
					//Катаев+ 28/05/14 Записей может быть несколько. Проверяем каждую
					//КритичОшибки.Добавить("Для номенклатуры "+рез.Номенклатура+" не совпадает артикул из заказа ("+Артикул+") с артикулом из матрицы ("+Рез.АртикулКонтрагента+") для контрагента "+Контрагент);
					ЗаписьНайдена = Ложь;
					тНом = Рез.Номенклатура;
					Пока рез.Следующий() Цикл
						Если Артикул = Рез.АртикулКонтрагента Тогда
							ЗаписьНайдена = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если Не ЗаписьНайдена Тогда
						КритичОшибки.Добавить("Для номенклатуры "+рез.Номенклатура+" в матрицах не найден артикул из заказа ("+Артикул+") для контрагента "+Контрагент+" из заказа -"+НомЗак);
						Возврат тНом;
					КонецЕсли;
					//Катаев- 28/05/14
				КонецЕсли;
			КонецЕсли;
			//Катаев- 24/03/14
			Возврат Рез.Номенклатура;
		КонецЕсли;
		
	КонецЕсли;
	
	
	// выбираем нужный документ матрица.
	Если ИспШтрихКодАртикул=4 Тогда
		
		//нечаева 11.,10,18++
		// для дикси проверим еще на то, есть ли комплектующие с таким Шк, если есть, то берем эту номенклатуру.
		Если Контрагент.код = "SSP-3687" Тогда
			Если Артикул <> Неопределено Тогда
				Запрос=Новый Запрос;
				Запрос.Текст="ВЫБРАТЬ
				|	МатрицаТовары.ШККонтрагента,
				|	МатрицаТовары.АртикулКонтрагента,
				|	МатрицаТовары.Цена,
				|	ВложенныйЗапрос.Ссылка как ссылка
				|ИЗ
				|	(ВЫБРАТЬ
				|		СУММА(1) КАК Количество,
				|		НоменклатураКоплектующие.Ссылка КАК Ссылка
				|	ИЗ
				|		Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
				|	
				|	СГРУППИРОВАТЬ ПО
				|		НоменклатураКоплектующие.Ссылка) КАК ВложенныйЗапрос
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Матрица.Товары КАК МатрицаТовары
				|		ПО МатрицаТовары.Номенклатура = ВложенныйЗапрос.Ссылка
				|ГДЕ
				|	 МатрицаТовары.АртикулКонтрагента ПОДОБНО &ТекАрт
				|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
				|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
				|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА";
				
				Запрос.УстановитьПараметр("Контрагент",Контрагент);
				Запрос.УстановитьПараметр("ТекАрт",Артикул);
				Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
				
				Рез=Запрос.Выполнить().Выбрать();
				Если Рез.Следующий() Тогда
					Возврат Рез.ссылка;
				КонецЕсли;
				
			КонецЕсли;
			
		конецЕсли;
		///нечаева 11.,10,18---
		
		
		//ищем по артикулу
		// Катаев+ 12/03/13 Исключаем поиск ШК если Артикул = Неопределено
		Если Артикул <> Неопределено Тогда
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	МатрицаТовары.Номенклатура,
			|	МатрицаТовары.ШККонтрагента,
			|	МатрицаТовары.АртикулКонтрагента,
			|	МатрицаТовары.Цена
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|ГДЕ
			|	МатрицаТовары.Ссылка.Контрагент = &Контрагент
			|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
			|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА
			|	И МатрицаТовары.АртикулКонтрагента ПОДОБНО &ТекАрт";
			
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("ТекАрт",Артикул);
			Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
			
			Рез=Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() Тогда
				//Катаев+ 24/03/14 Для контрагентов участвующих в обмене ЭСФ критично несовпадение артикула и ШК из заказа и тем что занесено у нас.
				Если Контрагент.ДатаНачалаЭСФ <> Дата(1,1,1)  Тогда
					Если ШК <> Рез.ШККонтрагента Тогда
						//Катаев+ 28/05/14 Записей может быть несколько. Проверяем каждую
						//КритичОшибки.Добавить("Для номенклатуры "+рез.Номенклатура+" не совпадает ШК из заказа ("+ШК+") с ШК из матрицы ("+Рез.ШККонтрагента+") для контрагента "+Контрагент);
						ЗаписьНайдена = Ложь;
						тНом = Рез.Номенклатура;
						Пока рез.Следующий() Цикл
							Если ШК = Рез.ШККонтрагента Тогда
								ЗаписьНайдена = Истина;
								Прервать;
							КонецЕсли;
						КонецЦикла;
						Если Не ЗаписьНайдена Тогда
							КритичОшибки.Добавить("Для номенклатуры "+рез.Номенклатура+" в матрицах не найден ШК из заказа ("+ШК+") для контрагента "+Контрагент+" из заказа -"+НомЗак);
							Возврат тНом;
						КонецЕсли;
						//Катаев- 28/05/14
					КонецЕсли;
				КонецЕсли;
				//Катаев- 24/03/14
				Возврат Рез.Номенклатура;
			КонецЕсли;
		КонецЕсли;
		// Катаев- 12/03113
		
		
	КонецЕсли;
	
	//Катаев+ 28/03/14 Для Окей наш ШК = артикулу из заказа
	Если ИспШтрихКодАртикул=5 Тогда
		
		Если Артикул <> Неопределено Тогда
			Запрос=Новый Запрос;
			Запрос.Текст=
			"ВЫБРАТЬ
			|	МатрицаТовары.Номенклатура,
			|	МатрицаТовары.ШККонтрагента,
			|	МатрицаТовары.АртикулКонтрагента,
			|	МатрицаТовары.Цена
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|ГДЕ
			|	МатрицаТовары.Ссылка.Контрагент = &Контрагент
			|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
			|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА
			|	И (МатрицаТовары.ШККонтрагента = &ТекШК
			|			ИЛИ МатрицаТовары.ШККонтрагентаДополнительный = &ТекШК)";
			
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("ТекШк",Артикул);
			Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
			
			Рез=Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() Тогда
				Возврат Рез.Номенклатура;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Катаев- 28/03/14
	
	
	//нечаева ищем по шк блочка 	 для метро 17,08,16 +++ нечаева
	// выбираем нужный документ матрица.
	Если ИспШтрихКодАртикул=7 Тогда
		
		// ищем по ШК  блочка
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура,
		|	МатрицаТовары.ШККонтрагента,
		|	МатрицаТовары.АртикулКонтрагента,
		|	МатрицаТовары.Цена,
		|	МатрицаТовары.ШККонтрагентаБлочок
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	(МатрицаТовары.ШККонтрагентаБлочок = &ТекШК
		|			ИЛИ МатрицаТовары.ШККонтрагентаДополнительный = &ТекШК)
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
		|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТекШк",ШК);
		Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
		
		Рез=Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() Тогда
			//для метро критично
			//нечаева 06,11,18++
			Если Артикул <> Рез.АртикулКонтрагента Тогда
				КритичОшибки.Добавить("Для номенклатуры "+рез.Номенклатура+" не совпадает артикул из заказа ("+Артикул+") с артикулом из матрицы ("+Рез.АртикулКонтрагента+") для контрагента "+Контрагент +" из заказа -"+НомЗак);
			КонецЕсли;
			//нечаева 06,11,18--	
			
			Возврат Рез.Номенклатура;
		КонецЕсли;
		
		
		//ищем по артикулу
		// Катаев+ 12/03/13 Исключаем поиск ШК если Артикул = Неопределено
		Если Артикул <> Неопределено Тогда
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	МатрицаТовары.Номенклатура,
			|	МатрицаТовары.ШККонтрагента,
			|	МатрицаТовары.АртикулКонтрагента,
			|	МатрицаТовары.Цена
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|ГДЕ
			|	МатрицаТовары.Ссылка.Контрагент = &Контрагент
			|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
			|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА
			|	И МатрицаТовары.АртикулКонтрагента ПОДОБНО &ТекАрт";
			
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("ТекАрт",Артикул);
			Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
			
			Рез=Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() Тогда
				Возврат Рез.Номенклатура;
			КонецЕсли;
		КонецЕсли;
		
		
		// ищем по ШК 
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура,
		|	МатрицаТовары.ШККонтрагента,
		|	МатрицаТовары.АртикулКонтрагента,
		|	МатрицаТовары.Цена,
		|	МатрицаТовары.ШККонтрагента
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	(МатрицаТовары.ШККонтрагента = &ТекШК
		|			ИЛИ МатрицаТовары.ШККонтрагентаДополнительный = &ТекШК)
		
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
		|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТекШк",ШК);
		Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
		
		Рез=Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() Тогда
			Возврат Рез.Номенклатура;
		КонецЕсли;
		
		
		
	КонецЕсли;
	//нечаева 17,08,16---
	
	
	
	возврат НайденнаяНоменклатура;
	//----------------------------------------------------------------------------
КонецФункции // НайтиПОШК()

Функция НайтиПОШКБилла(ШК,Артикул,НамТовара="",Контрагент)Экспорт
	
	СписокНом=Новый СписокЗначений;
	
	Если Артикул <> Неопределено Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МатрицаТовары.Номенклатура КАК Номенклатура,
		|	МатрицаТовары.ШККонтрагента,
		|	ВЫРАЗИТЬ(МатрицаТовары.АртикулКонтрагента КАК СТРОКА(50)) КАК АртикулКонтрагента,
		|	МатрицаТовары.Кратность,
		|	МатрицаТовары.КратностьКоробки
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
		|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА
		|	И МатрицаТовары.АртикулКонтрагента ПОДОБНО &ТекАрт
		|	И МатрицаТовары.КратностьКоробки <> &Н
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура УБЫВ";
		
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТекАрт",Артикул);
		Запрос.УстановитьПараметр("Н",Число(0));
		Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
		
		Рез=Запрос.Выполнить().Выгрузить();
		
		возврат Рез;
		
		
	КонецЕсли;
	
	
	возврат СписокНом;
	
	
КонецФункции // НайтиПОШК()

//нечаева  28,08,19 ---

//нечаева 20,04,23+++
Функция НайтиКратностьПоМатрице(ШК,Артикул,НамТовара="",Контрагент,ДатаРНК=неопределено) Экспорт
	
	//---------------------------------------------------------------------------
	ДатаИсп = ТекущаяДата();
	Если  ДатаРНК<>неопределено Тогда
		ДатаРНК1 = Дата(СтрЗаменить(ДатаРНК,"-",""));
		ДатаИсп = ДатаРНК1;
	конецЕсли;
	
	
	// ищем по ШК
	Если ШК <> Неопределено Тогда
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура КАК Номенклатура,
		|	МатрицаТовары.ШККонтрагента КАК ШККонтрагента,
		|	МатрицаТовары.АртикулКонтрагента КАК АртикулКонтрагента,
		|	МатрицаТовары.Цена КАК Цена,
		|	МатрицаТовары.Кратность КАК Кратность,
		|	МатрицаТовары.ШККонтрагентаБлочок КАК ШККонтрагентаБлочок
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	МатрицаТовары.ШККонтрагента = &ТекШК
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
		|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТекШк",ШК);
		Запрос.УстановитьПараметр("ТекДата",ДатаИсп);
		
		Рез=Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() Тогда
			Возврат Рез.Кратность;
		КонецЕсли;
	КонецЕсли;
	
	//ищем по артикулу
	Если Артикул <> Неопределено Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура КАК Номенклатура,
		|	МатрицаТовары.ШККонтрагента КАК ШККонтрагента,
		|	МатрицаТовары.АртикулКонтрагента КАК АртикулКонтрагента,
		|	МатрицаТовары.Цена КАК Цена,
		|	МатрицаТовары.Кратность КАК Кратность,
		|	МатрицаТовары.ШККонтрагентаБлочок КАК ШККонтрагентаБлочок
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
		|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА
		|	И МатрицаТовары.АртикулКонтрагента ПОДОБНО &ТекАрт";
		
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТекАрт",Артикул);
		Запрос.УстановитьПараметр("ТекДата",ДатаИсп);
		
		Рез=Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() Тогда
			Возврат Рез.Кратность;
		КонецЕсли;
	КонецЕсли;
	
	
	//ищем по шк блочка
	
	// ищем по ШК
	Если ШК <> Неопределено Тогда
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура КАК Номенклатура,
		|	МатрицаТовары.ШККонтрагента КАК ШККонтрагента,
		|	МатрицаТовары.АртикулКонтрагента КАК АртикулКонтрагента,
		|	МатрицаТовары.Цена КАК Цена,
		|	МатрицаТовары.Кратность КАК Кратность,
		|	МатрицаТовары.ШККонтрагентаБлочок КАК ШККонтрагентаБлочок,
		|	МатрицаТовары.КратностьКоробки КАК КратностьКоробки
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	МатрицаТовары.ШККонтрагентаБлочок = &ТекШК
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
		|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТекШк",ШК);
		Запрос.УстановитьПараметр("ТекДата",ДатаИсп);
		
		Рез=Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() Тогда
			Возврат Рез.Кратность;
		КонецЕсли;
	КонецЕсли;
	
	
	
конецФункции
//нечаева 20,04,23---


//нечаева 30,10,17+++

Функция НайтиПОШКМатрицаПриоритетов(ШК,Артикул,НамТовара="",Контрагент)Экспорт
	
	СписокНом=Новый СписокЗначений;
	
	Если Артикул <> Неопределено Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура,
		|	МатрицаТовары.ШККонтрагента,
		|	МатрицаТовары.АртикулКонтрагента,
		|	МатрицаТовары.Кратность
		|ИЗ
		|	Документ.МатрицаПриоритетов.Товары КАК МатрицаТовары
		|ГДЕ
		|	МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
		|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА
		|	И МатрицаТовары.АртикулКонтрагента ПОДОБНО &ТекАрт	
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура УБЫВ";
		
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТекАрт",Артикул);
		Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
		
		Рез=Запрос.Выполнить().Выгрузить();
		
		возврат Рез;
		
		
	КонецЕсли;
	
	
	возврат СписокНом;
	
	
КонецФункции // НайтиПОШК()

//нечаева 30,10,17---


Процедура СообщитьМенеджеруАкт() Экспорт
	
	
	СтрШапка=АктШапка.Получить(0);
	
	Если СтрШапка.контрагент=Неопределено Тогда
		возврат;
	КонецЕсли;	
	сз = Новый СписокЗначений;
	
	Менеджер=СтрШапка.контрагент.Менеджер;
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
	//	Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//	Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Иначе
	//	Профиль.АдресСервераPOP3   = "87.236.190.180";
	//	Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//КонецЕсли;
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);		 
	// Кухарь А.Ю.  08.09.2022 конец
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	Сообщение=новый ИнтернетПочтовоеСообщение;
	Сообщение.Отправитель.Адрес = "Ecode@collant.ru";
	Если НЕ Сокрлп(Менеджер.ЕМэйл)=""  тогда
		//Катаев+ 08/04/14 Отправку делаем только по штатным сотрудникам
		//сз.Добавить(Менеджер.ЕМэйл);
		Если Менеджер.Штатный Тогда
			сз.Добавить(Менеджер.ЕМэйл);
		КонецЕсли;
		//Катаев- 08/04/14
	конецесли;
	//---------------------------------------------------
	// получаем заместителей, для отправки из справочника пользователи.
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ПользователиЗаместители.Заместитель,
	|	ПользователиЗаместители.Заместитель.ЕМэйл  как ЗамЕМэйл
	|ИЗ
	|	Справочник.Пользователи.Заместители КАК ПользователиЗаместители
	|ГДЕ
	|	ПользователиЗаместители.Ссылка.ФизЛицо = &ТекМенеджер";
	Запрос.УстановитьПараметр("ТекМенеджер",Менеджер);
	Результат=Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Если СтрДлина(Результат.ЗамЕМэйл)>5 Тогда
			//Катаев+ 08/04/14 Отправку делаем только по штатным сотрудникам
			//сз.Добавить(Результат.ЗамЕМэйл);
			Если Результат.Заместитель.Штатный Тогда
				сз.Добавить(Результат.ЗамЕМэйл);
			КонецЕсли;
			//Катаев- 08/04/14
		Иначе
			КритичОшибки.Добавить("Для менеджера (зам)"+Результат.Заместитель.Наименование+" не определен ЕМэйл. "+Символ(13));
		КонецЕсли;
	КонецЦикла;
	Если сз.Количество() = 0 Тогда
		КритичОшибки.Добавить("Для акта приемки товара по заказу № "+СтрШапка.НомерЗаказа+" не определены получатели "+Символ(13));
	Иначе
		Для каждого стр из сз Цикл
			Сообщение.Получатели.Добавить(стр.Значение);
		КонецЦикла;
		//Сообщение.Получатели.Добавить("kataev@collant.ru");
		Если стрШапка.РНК = Документы.РасходнаяНакладная.ПустаяСсылка() Или стрШапка.РНК = Неопределено Тогда
			Сообщение.Тема = "Автообмен Ecode. Получен акт о приеме товара по заказу № "+стрШапка.НомерЗаказа+" от "+стрШапка.ДатаЗаказа+". Номер РНК автоматически определить не удалось";
		Иначе
			Сообщение.Тема = "Автообмен Ecode. Получен акт о приеме товара по РНК № "+стрШапка.РНК.Номер+" от "+стрШапка.РНК.Дата;
		КонецЕсли;
		Строка = "Номер РНК в акте покупателя = "+стрШапка.НомерРНК+"<BR>Пункт доставки = "+стрШапка.ПунктДоставки+"<BR>Дата приемки товара = "+стрШапка.ДатаПриемаТовара;
		Если стрШапка.СостоянияРКМ = Перечисления.СостоянияРКМ.Отсутствует Тогда
			Строка = Строка+"<BR>По документу РНК имеются расхождения.";
		Иначе
			Строка = Строка+"<BR>По документу РНК расхождения не обнаружены.";
		КонецЕсли;
		Текст = Сообщение.Тексты.Добавить(Строка);
		Почта= Новый ИнтернетПочта;
		Текст.ТипТекста = ТипТекстаПочтовогоСообщения.HTML;
		попытка
			Почта.Подключиться(Профиль);
		исключение
			КритичОшибки.Добавить("Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки() );
			ЗаписатьВЛог("Курьер","Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки(),"Информация");
			
		КонецПопытки;
		Попытка
			Почта.Послать(Сообщение);
		Исключение
			
			КритичОшибки.Добавить("Не возможно отправить сообщение!   "+ОписаниеОшибки() );
			//Катаев+ 27/02/14 Катаев+
			КритичОшибки.Добавить("Узел - "+ПланыОбмена.Основной.ЭтотУзел());
			КритичОшибки.Добавить("Менеджер - "+Менеджер);
			попытка
				КритичОшибки.Добавить("Заказ ЕКОД - "+СтрШапка.номЗаказа);
			исключение
			конецПопытки;
			//Катаев- 27/02/14
			Для Каждого пол из сообщение.Получатели цикл
				КритичОшибки.Добавить("Получатель="+пол+" "+пол.ОтображаемоеИмя);
			КонецЦикла;
		КонецПопытки;
		Почта.Отключиться();
	КонецЕсли;
	
КонецПроцедуры

Процедура СообщитьМенеджеру(ПутьФайла, Шапка) Экспорт
	
	
	СтрШапка=Шапка.Получить(0);
	
	Если СтрШапка.контрагент=Неопределено или стрШапка.Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
		возврат;
	КонецЕсли;	
		
	Менеджер=СтрШапка.контрагент.Менеджер;
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);		 

	
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	//---------------------------------------------------------------

	//----------------------------------------------------------------
	

	Сообщение=новый интернетПочтовоеСообщение;
		
	Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	Сообщение.Получатели.Добавить("anahteva@collant.ru");
	Сообщение.Получатели.Добавить("martynova@collant.ru");

	Сообщение.Отправитель="ecode@collant.ru";
	
	
	ПунктДоставки=СтрШапка.ПунктДоставки;
	
	Если ПунктДоставки=Неопределено тогда
		ПунктДоставки="";
	Конецесли;	
	Строка= "";
	Сообщение.Тема="Автообмен Курьер. Заполнение ПНК № "+СтрШапка.НомерСФ+" - "+СтрШапка.контрагент;
	//Строка=Символ(13)+Символ(13)+"       Добрый день!"+Символ(13)+Символ(13)+Строка("Новый заказ в ECODE № "+СтрШапка.НомЗаказа+"  от компании  "+СтрШапка.контрагент+".");
	////Символы.ПС+"Сформировано новое РНК № "+Док.номер+" "+Док.Дата+".")+Символ(13)+Символ(13);
	//Для рр=0 по файлы.Количество()-1 Цикл
	//	Строка=Строка+символы.ПС+Файлы[рр];
	//КонецЦикла;
	//
	//
	//НомСтр=1;
	//Строка=Строка+Символы.ПС+символы.ПС+"Фактический адрес, пунк доставки: "+СтрШапка.ПунктДоставки;
	//Строка=Строка+Символы.ПС;
	//Если Ошибки.количество()>1 Тогда
	//	Строка=Строка+Символы.ПС+"Сообщения по загрузке данных:";
	//КонецЕсли;	
	//Если НЕ Ошибки=Неопределено и ошибки.Количество()>0 Тогда
	//	Для рр=0 по ошибки.Количество()-1 Цикл
	//		Строка=Строка+Символы.ПС+НомСтр+". "+Ошибки[рр];
	//		Строка=Строка+Символы.ПС;
	//		НомСтр=НомСтр+1;
	//	КонецЦикла;
	//конецЕсли;
	Строка=Строка+Символы.ПС+"________________________________________________________________";
	
	Сообщение.Тексты.Добавить(Строка);
	
	Сообщение.Вложения.Добавить(ПутьФайла);
	
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
	исключение
		КритичОшибки.Добавить("Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки() );
		ЗаписатьВЛог("Курьер","Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки(),"Информация");
		
	конецПопытки;
	Попытка
		Почта.Послать(Сообщение);
	исключение
		//
		//КритичОшибки.Добавить("Не возможно отправить сообщение!   "+ОписаниеОшибки() );
		////Катаев+ 27/02/14 Катаев+
		//КритичОшибки.Добавить("Узел - "+ПланыОбмена.Основной.ЭтотУзел());
		//КритичОшибки.Добавить("Менеджер - "+Менеджер);
		//КритичОшибки.Добавить("Заказ ЕКОД - "+СтрШапка.номЗаказа);
		////Катаев- 27/02/14
		//для каждого пол из сообщение.Получатели цикл
		//	КритичОшибки.Добавить("Получатель="+пол+" "+пол.ОтображаемоеИмя);
		//конеццикла;
	конецПопытки;
	Почта.Отключиться();
	//	УдалитьФайлы(ИмяФайлаПечати);     //+++
	
КонецПроцедуры

Процедура СообщитьКритОшибки() Экспорт
	
	
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
	//	Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//	Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Иначе
	//	Профиль.АдресСервераPOP3   = "87.236.190.180";
	//	Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//КонецЕсли;
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);		 
	// Кухарь А.Ю.  08.09.2022 конец
	
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	//------------------------------------------------
	// сообщение о критических ошибках
	//------------------------------------------------
	сообщениеКрит=новый интернетПочтовоеСообщение;
	//Катаев+ 09/04/13 ошибочный одрес получателя
	//СообщениеКрит.Получатели.Добавить("ecode@collant.ru"); //+++
	//Катаев- 09/04/13
	
	//Катаев+ 07/05/13 получатели критических ошибок будем брать из Регистра сведений
	//СообщениеКрит.Получатели.Добавить("nechaeva@collant.ru");
	//СообщениеКрит.Получатели.Добавить("grishakov@collant.ru");
	//СообщениеКрит.Получатели.Добавить("nikolaev@collant.ru");
	//СообщениеКрит.Получатели.Добавить("krohin@collant.ru");
	//СообщениеКрит.Получатели.Добавить("pokidyshev@collant.ru");
	//СообщениеКрит.Получатели.Добавить("gorbachenko@collant.ru");
	////крохин начало 21.06.2012
	//СообщениеКрит.Получатели.Добавить("loban@collant.ru");	
	////крохин конец 21.06.2012
	//
	////Катаев+ 22/03/13
	//СообщениеКрит.Получатели.Добавить("kataev@collant.ru");	
	////Катаев- 22/03/13
	Выборка = регистрыСведений.Емайл_КритОшибки.Выбрать();
	Пока  Выборка.Следующий() Цикл
		СообщениеКрит.Получатели.Добавить(Выборка.емайл);
	КонецЦикла;
	Если СообщениеКрит.Получатели.Количество() = 0 Тогда
		СообщениеКрит.Получатели.Добавить("krohin@collant.ru");
		//Катаев+ 27/02/14
		//СообщениеКрит.Получатели.Добавить("kataev@collant.ru");
		//20.04.15+++
		СообщениеКрит.Получатели.Добавить("nechaeva@collant.ru");
		//20.04.15*--
		//Катаев- 27/02/14
	КонецЕсли;
	//Катаев- 07/05/13
	//Катаев+ 14/07/14 Для филиалов в получатели добавляем менеджера и его замов
	Если ПланыОбмена.Основной.ЭтотУзел() <> ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
		СтрШапка = ТЗШапка.Получить(0);
		Менеджер=СтрШапка.контрагент.Менеджер;
		Если НЕ Сокрлп(Менеджер.ЕМэйл)=""  тогда
			Если Менеджер.Штатный Тогда
				СообщениеКрит.Получатели.Добавить(Менеджер.ЕМэйл);
			КонецЕсли;
		конецесли;
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	ПользователиЗаместители.Заместитель,
		|	ПользователиЗаместители.Заместитель.ЕМэйл  как ЗамЕМэйл
		|ИЗ
		|	Справочник.Пользователи.Заместители КАК ПользователиЗаместители
		|ГДЕ
		|	ПользователиЗаместители.Ссылка.ФизЛицо = &ТекМенеджер";
		Запрос.УстановитьПараметр("ТекМенеджер",Менеджер);
		Результат=Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл
			Если СтрДлина(Результат.ЗамЕМэйл)>5 Тогда
				Если Результат.Заместитель.Штатный Тогда
					СообщениеКрит.Получатели.Добавить(Результат.ЗамЕМэйл);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Конецесли;
	//Катаев- 14/07/14
	
	сообщениеКрит.Отправитель="ecode@collant.ru";
	СообщениеКрит.Тема="Автообмен Ecode. Критические ошибки!";
	Строка="Добрый день!!!"+Символ(13);
	НомСтр=1;
	Если НЕ Ошибки=Неопределено и КритичОшибки.Количество()>0 Тогда
		Для рр=0 по КритичОшибки.Количество()-1 Цикл
			Строка=Строка+Символ(13)+НомСтр+". "+КритичОшибки[рр];
			Строка=Строка+Символ(13);
			НомСтр=НомСтр+1;
		КонецЦикла;
	КонецЕсли;
	
	Строка=Строка+Символ(13)+"________________________________________________________________";
	//-----------------------------------------
	СообщениеКрит.Тексты.Добавить(Строка);
	
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
		почта.Послать(СообщениеКрит);
		Почта.Отключиться();
	исключение
		ЗаписатьВЛог("Курьер","Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки(),"Информация");
		
	конецПопытки;
	
КонецПроцедуры

//Нечаева 11,04,17+++
Процедура СообщитьКритОшибкиЛента(Док) Экспорт
	
	//	Если ПараметрыСеанса.Отладка Тогда
	//		Возврат;
	//	КонецЕсли;
	
	
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
	//	Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//	Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Иначе
	//	Профиль.АдресСервераPOP3   = "87.236.190.180";
	//	Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//КонецЕсли;
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);		 
	// Кухарь А.Ю.  08.09.2022 конец
	
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	//------------------------------------------------
	// сообщение о критических ошибках
	//------------------------------------------------
	сообщениеКрит=новый интернетПочтовоеСообщение;
	
	//СообщениеКрит.Получатели.Добавить("gorbachenko@collant.ru");
	
	Выборка = регистрыСведений.Емайл_КритОшибки.Выбрать();
	
	СообщениеКрит.Получатели.Добавить("nechaeva@collant.ru");
	
	
	////Катаев+ 14/07/14 Для филиалов в получатели добавляем менеджера и его замов
	//Если ПланыОбмена.Основной.ЭтотУзел() <> ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
	//	СтрШапка = ТЗШапка.Получить(0);
	//	Менеджер=СтрШапка.контрагент.Менеджер;
	//	Если НЕ Сокрлп(Менеджер.ЕМэйл)=""  тогда
	//		Если Менеджер.Штатный Тогда
	//			СообщениеКрит.Получатели.Добавить(Менеджер.ЕМэйл);
	//		КонецЕсли;
	//	конецесли;
	//	Запрос=Новый Запрос;
	//	Запрос.Текст="ВЫБРАТЬ
	//	|	ПользователиЗаместители.Заместитель,
	//	|	ПользователиЗаместители.Заместитель.ЕМэйл  как ЗамЕМэйл
	//	|ИЗ
	//	|	Справочник.Пользователи.Заместители КАК ПользователиЗаместители
	//	|ГДЕ
	//	|	ПользователиЗаместители.Ссылка.ФизЛицо = &ТекМенеджер";
	//	Запрос.УстановитьПараметр("ТекМенеджер",Менеджер);
	//	Результат=Запрос.Выполнить().Выбрать();
	//	Пока Результат.Следующий() Цикл
	//		Если СтрДлина(Результат.ЗамЕМэйл)>5 Тогда
	//			Если Результат.Заместитель.Штатный Тогда
	//				СообщениеКрит.Получатели.Добавить(Результат.ЗамЕМэйл);
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЦикла;
	//Конецесли;
	//Катаев- 14/07/14
	
	сообщениеКрит.Отправитель="ecode@collant.ru";
	СообщениеКрит.Тема="Автообмен Ecode. Ошибка отправки Уведомления по Ленте - РНК - "+Док.Номер+", номер заказа - "+Док.НомерЗаказа;
	Строка="Добрый день!!!"+Символ(13);
	НомСтр=1;
	Если НЕ Ошибки=Неопределено и КритичОшибкиЛента.Количество()>0 Тогда
		Для рр=0 по КритичОшибкиЛента.Количество()-1 Цикл
			Строка=Строка+Символ(13)+НомСтр+". "+КритичОшибкиЛента[рр];
			Строка=Строка+Символ(13);
			НомСтр=НомСтр+1;
		КонецЦикла;
	КонецЕсли;
	
	Строка=Строка+Символ(13)+"________________________________________________________________";
	//-----------------------------------------
	СообщениеКрит.Тексты.Добавить(Строка);
	
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
		почта.Послать(СообщениеКрит);
		Почта.Отключиться();
	исключение
		ЗаписатьВЛог("Курьер","Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки(),"Информация");
		
	конецпопытки;
	
КонецПроцедуры
//Нечаева 11,04,17---



//Нечаева 19,03,15++
Процедура СообщитьОшибкиАртикул() Экспорт
	
	//
	//Если ПараметрыСеанса.Отладка Тогда
	//	Возврат;
	//КонецЕсли;
	
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
	//	Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//	Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Иначе
	//	Профиль.АдресСервераPOP3   = "87.236.190.180";
	//	Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//КонецЕсли;
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);		 
	// Кухарь А.Ю.  08.09.2022 конец
	
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	//------------------------------------------------
	// сообщение о критических ошибках
	//------------------------------------------------
	сообщениеКрит=новый интернетПочтовоеСообщение;
	//СообщениеКрит.Получатели.Добавить("nechaeva@collant.ru");
	СообщениеКрит.Получатели.Добавить("gorbachenko@collant.ru");
	
	// пока закомментировала !!!!!
	
	//Выборка = регистрыСведений.Емайл_КритОшибки.Выбрать();
	//Пока  Выборка.Следующий() Цикл
	//	СообщениеКрит.Получатели.Добавить(Выборка.емайл);
	//КонецЦикла;
	//Если СообщениеКрит.Получатели.Количество() = 0 Тогда
	//	СообщениеКрит.Получатели.Добавить("krohin@collant.ru");
	//	СообщениеКрит.Получатели.Добавить("kataev@collant.ru");
	//	
	//КонецЕсли;
	//
	//Катаев+ 14/07/14 Для филиалов в получатели добавляем менеджера и его замов
	//Если ПланыОбмена.Основной.ЭтотУзел() <> ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
	//	СтрШапка = ТЗШапка.Получить(0);
	//	Менеджер=СтрШапка.контрагент.Менеджер;
	//	Если НЕ Сокрлп(Менеджер.ЕМэйл)=""  тогда
	//		Если Менеджер.Штатный Тогда
	//			СообщениеКрит.Получатели.Добавить(Менеджер.ЕМэйл);
	//		КонецЕсли;
	//	конецесли;
	//	Запрос=Новый Запрос;
	//	Запрос.Текст="ВЫБРАТЬ
	//	|	ПользователиЗаместители.Заместитель,
	//	|	ПользователиЗаместители.Заместитель.ЕМэйл  как ЗамЕМэйл
	//	|ИЗ
	//	|	Справочник.Пользователи.Заместители КАК ПользователиЗаместители
	//	|ГДЕ
	//	|	ПользователиЗаместители.Ссылка.ФизЛицо = &ТекМенеджер";
	//	Запрос.УстановитьПараметр("ТекМенеджер",Менеджер);
	//	Результат=Запрос.Выполнить().Выбрать();
	//	Пока Результат.Следующий() Цикл
	//		Если СтрДлина(Результат.ЗамЕМэйл)>5 Тогда
	//			Если Результат.Заместитель.Штатный Тогда
	//				СообщениеКрит.Получатели.Добавить(Результат.ЗамЕМэйл);
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЦикла;
	//Конецесли;
	////Катаев- 14/07/14
	
	сообщениеКрит.Отправитель="ecode@collant.ru";
	СообщениеКрит.Тема="Ecode. Ошибки в артикулах при загрузке!!!!";
	Строка="Добрый день!!!"+Символ(13);
	НомСтр=1;
	Если НЕ Ошибки=Неопределено и ОшибкиАртикул.Количество()>0 Тогда
		Для рр=0 по ОшибкиАртикул.Количество()-1 Цикл
			Строка=Строка+Символ(13)+НомСтр+". "+ОшибкиАртикул[рр];
			Строка=Строка+Символ(13);
			НомСтр=НомСтр+1;
		КонецЦикла;
	КонецЕсли;
	
	Строка=Строка+Символ(13)+"________________________________________________________________";
	//-----------------------------------------
	СообщениеКрит.Тексты.Добавить(Строка);
	
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
		почта.Послать(СообщениеКрит);
		Почта.Отключиться();
	исключение
		ЗаписатьВЛог("Курьер","Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки(),"Информация");
		
	конецпопытки;
	ОшибкиАртикул.Очистить();
	
	
КонецПроцедуры
//Нечаева 19,03,15---



Процедура ИзменитьСтатусДокумента(ИДДокумента,НомерДок) Экспорт
	возврат;
	//Сообщить(" Начало... " +ИДДокумента);	
	IDDok=ИДДокумента;
	
	//RegExp = Новый COMОбъект("VBScript.RegExp");	
	
	ScrptCtrl=Новый COMОбъект("MSScriptControl.ScriptControl");
	ScrptCtrl.Language="vbscript";
	
	//ScrptCtrl.AddCode("
	//|Function GetStatusDok()
	//|	const HKEY_CURRENT_USER = &H80000001
	//|	Set oReg=GetObject(""winmgmts:{impersonationLevel=impersonate}!\\.\root\default:StdRegProv"")
	//|	strKeyPath = ""Software\1C\1Cv7\7.7\Titles""
	//|	oReg.EnumValues HKEY_CURRENT_USER, strKeyPath, arrValues
	//|	strInfo=vbNullString
	//|	For i = LBound(arrValues) To UBound(arrValues)
	//|		call oReg.GetStringValue(HKEY_CURRENT_USER,strKeyPath,arrValues(i),Value)
	//|		strInfo=strInfo & arrValues(i) & vbTab & Value & vbCrLf
	//|	Next
	//|	Get1CV77Titles = strInfo
	//|End Function
	//|");
	
	ScrptCtrl.AddCode("
	|Function GetStatusDok()
	|   dim oSOAPClient 
	|   Set oSOAPClient = CreateObject(""MSSOAP.SoapClient"")
	|If (Err.Number = 0) Then
	|   Call oSOAPClient.mssoapinit(""https://www.ecod.pl/webserv2/EDIservice.asmx?WSDL"","""","""","""")
	|   dim ret
	|   If (Err.Number = 0) Then
	|     set ret = oSOAPClient.Relationships(""4607043101594"",""334WFSm"",""5000"")
	|     dim cnt
	|     set cnt = ret.item(1) 
	|     dim res
	|     set res = ret.item(0) 
	|   Else
	|     GetStatusDok=0
	|   End If
	|Else
	|   GetStatusDok=0
	|End If
	|   GetStatusDok=1
	|End Function 
	|");
	
	//|set statusDok=oSOAPClient.ChangeDocumentStatus(""4607043101594"",""334WFSm"",IDDok,""R"")
	
	Попытка	
		Текст=СокрЛП(ScrptCtrl.Run("GetStatusDok"));
	Исключение
		//Сообщить(ОписаниеОшибки());
		КритичОшибки.Добавить("Для заказа ЕКОДЕ "+НомерДок+"  не изменен статус документа!  " + ОписаниеОшибки());
		//Возврат ТаблЗнач;
		
	КонецПопытки;
	
	//Сообщить(""+ИДДокумента+" отработало! ="+Текст);
	
КонецПроцедуры

//*********************************************************************************************
Функция ФормированиеПечати(Строки,Шапка) Экспорт
	
	СтрШапка=Шапка.Получить(0);
	Организация=СтрШапка.Организация;
	
	Макет = ЭтотОбъект.ПолучитьМакет("ЗаказУпрощеннаяФорма");
	
	//Макет = ЭтотОбъект.ПолучитьМакет("Заказ");
	ТабДок= Новый ТабличныйДокумент;
	ТабДок.Очистить();
	ТабДок.Вывод=ИспользованиеВывода.Разрешить;
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.Заполнить(Шапка.Получить(0));
	Организация=Справочники.Организации.НайтиПоКоду("SSP-12"); //КБ- Стиль
	
	Если не Контрагент.Пустая() Тогда 	
		Договор=Контрагент.ОсновнойДоговор;
		Если не (Договор=Неопределено) и не (Договор=справочники.Договоры.ПустаяСсылка()) Тогда
			Если ЗначениеЗаполнено(Договор.Организация) Тогда
				Организация=Договор.Организация;		
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;		
	ГЛНПродавца="";
	ЕИ="4607182079990";
	КБ="4607182769990";
	Если Организация.код="SSP-12" Тогда
		ОбластьЗаголовок.Параметры.ГЛНПродавца=КБ;
	КонецЕсли;
	
	Если Организация.код="SS-001" Тогда
		ОбластьЗаголовок.Параметры.ГЛНПродавца=КБ;
	КонецЕсли;
	
	ОбластьЗаголовок.Параметры.НаименованиеПродавца=Организация.Наименование;
	
	ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
	ОбластьИтоги.Параметры.Заполнить(Шапка.Получить(0));
	ОбластьСтрока = Макет.ПолучитьОбласть("ТекущаяСтрока");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("Шапка");
	
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	НомПП=1;
	ОбщСумма=0; ОбщКолУпак=0;
	Для каждого ТекСтрока Из Строки Цикл
		
		ОбластьСтрока.Параметры.Заполнить(ТекСтрока);
		Если ТекСтрока.Колво-ТекСтрока.КолвоОтредактированное Тогда
			ОбластьСтрока.Область("Колво").ЦветТекста = Новый Цвет(255, 0, 0);
		Иначе
			ОбластьСтрока.Область("Колво").ЦветТекста = Новый Цвет(0, 0, 0);
		КонецЕсли;	
		
		Если ТекСтрока.Найдена Тогда
			ОбластьСтрока.Параметры.Найдена="v";
			ОбластьСтрока.Область("ТекущаяСтрока").ЦветТекста = Новый Цвет(0, 0, 0);
		Иначе	
			ОбластьСтрока.Параметры.Найдена="";
			ОбластьСтрока.Область("ТекущаяСтрока").ЦветТекста = Новый Цвет(255, 0, 0);
		КонецЕсли;
		
		ОбластьСтрока.Параметры.НомПП=НомПП;
		ТабДок.Вывести(ОбластьСтрока);
		НомПП=НомПП+1;
		ОбщСумма=ОбщСумма+ТекСтрока.СуммаБезНДС;
		Если НЕ ТекСтрока.КолУпак=Неопределено тогда
			ОбщКолУпак=ОбщКолУпак+Число(ТекСтрока.КолУпак);
		КонецЕсли;	
		
	КонецЦикла;	
	
	ОбластьИтоги.Параметры.общСумма=ОбщСумма;	
	ОбластьИтоги.Параметры.ОбщКолУпак=ОбщКолУпак;	
	ТабДок.Вывести(ОбластьИтоги);
	ТабДок.ОтображатьСетку=Ложь;
	
	
	//	ТабДок.Показать();
	
	// нечаева 04,12,19++ поменяла формат
	НомЗ = СтрЗаменить(СтрШапка.НомЗаказа, "/", "_");		
	НомЗ = СтрЗаменить(НомЗ, "\", "_");		
	НомЗ = СтрЗаменить(НомЗ, " ", "_");		
	Имя=Константы.КаталогЕКОД.Получить()+НомЗ+".xls";     //++++
	
	Попытка
		ТабДок.Вывод=ИспользованиеВывода.Разрешить;
		ТабДок.Записать(Имя,"xls");
	Исключение
		КритичОшибки.Добавить("Не возможно создать файл печати для заказа "+СтрШапка.НомЗаказа+". Контрагент - "+СтрШапка.контрагент+".  "+ОписаниеОшибки() );
	КонецПопытки;
	// нечаева 04,12,19---
	
	
	Возврат Имя;
	
КонецФункции

// доработка по контрагентам
// 1 округляем количество товаров, если нужно!
// 2 разброс по скаладам, формирование документов.
// 3 условия поиска ШК (для отдельных групп из номенклатуры - Интри, европакеты... кб-стиль)
Процедура ОбработкаДанныхЗагрузки(Шапка,Строки)
	
	СтрШапка=Шапка.Получить(0);
	ТипЦен=Справочники.ТипыЦен.ПустаяСсылка();
	ТипСкидки=Справочники.ТипыСкидок.ПустаяСсылка();
	Организация=Неопределено;
	Менеджер=Неопределено;
	Регион=Неопределено;
	Договор=Неопределено;
	Подразделение=Неопределено;
	ОтсрочкаПлатежа=Неопределено;
	КодПоставщикаКонтрагента=Неопределено;
	ПунктДоставки=Неопределено;
	НомерЗаказа=Неопределено;
	ТипILNКонтрагента=Неопределено;
	ДатаЗаказа=Неопределено;
	ДатаОтгрузки=Неопределено;
	Склад=Неопределено;   //Справочники.Склады.НайтиПоКоду("STA-61");
	Контрагент=СтрШапка.Контрагент;
	Если Контрагент=Неопределено тогда
		Контрагент=Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;	
	ПунктДоставки=СтрШапка.ПунктДоставки;
	НомЗаказа=СтрШапка.НомЗаказа;
	НомерЗаказа=СтрШапка.НомЗаказа;
	//нечаева 08,04,21+++
	КодПоставщикаШапка = СтрШапка.КодДоговора;
	//нечаева 08,04,21---
	
	
	ДатаЗаказа=СтрШапка.ДатаЗаказа;
	ДатаДоставки=СтрШапка.ДатаДоставки;
	//нечаева 27,11,17++
	ВремяДоставки = СтрШапка.ВремяДоставки;
	//нечаева 27,11,17-- 
	ТипILNКонтрагента=СтрШапка.ТипILNКонтрагента;
	
	
	//нечаева 31,08,21+++ для озона
	Если  контрагент.код = "SSP-4991" ТОгда
		
		Склад= Справочники.Склады.НайтиПоКоду("STC-60");
		
	КонецЕсли;
	//нечаева 31,08,21---
	
	//нечаева 21,04,23+++
	Если  НЕ Контрагент.ОсновнойСкладОтгрузки.пустая() ТОгда
		
		Склад= Контрагент.ОсновнойСкладОтгрузки;
		
	КонецЕсли;
	// нечаева 21,04,23---
	
	
	ПризКр=0;
	//сообщить("    запись документа");
	Если не Контрагент.Пустая() Тогда 	
		// 1. Обрабатываем количество, делаем округление  соответствуещее коли-ву в блочке
		Если Контрагент.ОткруглятьКоличество Тогда
			
			Для каждого ТекСтрока Из Строки Цикл
				ПризКратности=1;
				Ном=ТекСтрока.Номенклатура;
				КолЗаказано=ТекСтрока.Колво;
				
				Если НЕ ТипЗнч(Ном) = Тип("СправочникСсылка.Номенклатура") Тогда
					ТекСтрока.КолвоОтредактированное=КолЗаказано;
					продолжить;
				КонецЕсли;
				
				ШтукВКор=Ном.Родитель.ШтукВКоробочке;
				Если ШтукВКор-0>0 Тогда 
					// проверяем на кратность 5 или 6
					Если (ШтукВКор/5)=Цел((ШтукВКор/5)) Тогда
						ПризКратности=5
					ИначеЕсли (ШтукВКор/6)=Цел((ШтукВКор/6)) Тогда
						ПризКратности=6
					Иначе
						ПризКратности=1;
					КонецЕсли;
					
					Если (КолЗаказано/ПризКратности)<>Цел((КолЗаказано/ПризКратности)) Тогда
						КолУпак=Цел(Окр(КолЗаказано/ПризКратности,0,0));
						НовКолво=КолУпак*ПризКратности;
						ТекСтрока.КолвоОтредактированное=НовКолво;
					Иначе
						ТекСтрока.КолвоОтредактированное=КолЗаказано;
					Конецесли;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для каждого ТекСтрока Из Строки Цикл
				Если ТекСтрока.Единица<>"Блочок" Тогда
					КолЗаказано=ТекСтрока.Колво;
					ТекСтрока.КолвоОтредактированное=КолЗаказано;
				Иначе
					Попытка
						КолЗаказано=ТекСтрока.Колво*ТекСтрока.ВУпак;
						ТекСтрока.КолвоОтредактированное=КолЗаказано;
					исключение
						КолЗаказано=ТекСтрока.Колво;
						ТекСтрока.КолвоОтредактированное=КолЗаказано;
					КонецПопытки;	
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		// 2. проверяем дублированный заказ есть или нет. в пределах недели;
		Если Контрагент.ПроверятьНаличиеЗаказа Тогда
			
			Дата1=ТекущаяДата();
			Дата2=ТекущаяДата() - 60 * 60 * 24 * 7; // неделя назад;
			
			Запрос=новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	РасходнаяНакладная.Номер,
			|	РасходнаяНакладная.Дата,
			|	РасходнаяНакладная.Ссылка
			|ИЗ
			|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
			|ГДЕ
			|	РасходнаяНакладная.Контрагент = &Контрагент
			|	И РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
			|	И РасходнаяНакладная.Дата МЕЖДУ НачалоПериода(&Дата2) И КонецПериода(&Дата1)";
			
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("ПунктДоставки",ПунктДоставки);
			Запрос.УстановитьПараметр("Дата1",Дата1);
			Запрос.УстановитьПараметр("Дата2",Дата2);
			
			Рез=Запрос.Выполнить().Выбрать();
			
			// добавляем в сообщения менеджерам
			Пока Рез.Следующий() Цикл
				Строка="Для заказа ЕКОДЕ № "+НомЗаказа+" существует копия заказа РНК №"+Рез.Номер+" от "+Рез.Дата;
				Ошибки.Добавить(Строка);
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	// 3. разбивка по складам, создаем несколько документов. 
	// выбираем различные склады, и в цикла по кадому выбираем номеклатуру и создаем документы;
	
	// загрузка ТЗ в запрос
	//--------------------------------------------
	ТЗСклады=Строки;
	
	// создается для временной таблицы
	ТЗ  = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТЗ.Колонки.Добавить("Найдена", Новый ОписаниеТипов("Число"));
	
	Запрос = Новый Запрос;
	ДанныеСкладов=Неопределено;
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст  = "ВЫБРАТЬ различные
	|    ТЗ.Склад как Склад,
	|    ТЗ.Найдена
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|    &ТЗ КАК ТЗ";
	
	Запрос.УстановитьПараметр("ТЗ", ТзСклады);
	Запрос.Выполнить();
	
	Запрос.Текст="ВЫБРАТЬ
	|	ТЗ.Склад КАК Склад,
	|	ТЗ.Найдена
	|ИЗ
	|	ТЗ КАК ТЗ
	|ГДЕ
	|	ТЗ.Найдена = 1";
	РезультатСклады=Запрос.Выполнить().Выбрать();
	
	Если РезультатСклады.Количество()=0 Тогда
		// пустой документ! не формируем ?
		//Катаев+ 08/04/13 Для филиалов склад берем по умолчанию
		//Склад=Справочники.Склады.НайтиПоКоду("STA-61");
		Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
			Склад=Справочники.Склады.НайтиПоКоду("STA-61");
		Иначе
			Склад = ПолучитьЗначениеПоУмолчанию("ОсновнойСклад",Справочники.Пользователи.НастройкиПоУмолчанию);
		КонецЕсли;
		//Катаев- 08/04/13
		//нечаева 31,08,21+++ для озона
		Если  контрагент.код = "SSP-4991" ТОгда
			
			Склад= Справочники.Склады.НайтиПоКоду("STC-60");
			
		КонецЕсли;
		
		//нечаева 21,04,23+++
		Если  НЕ контрагент.ОсновнойСкладОтгрузки.пустая() ТОгда
			
			Склад= контрагент.ОсновнойСкладОтгрузки;
			
		КонецЕсли;
		// нечаева 21,04,23---
		
		
		
		//нечаева 31,08,21---
		
		// Катаев+ 21/03/13 Создавать новый документ надо только для оригинала
		//ДокОбъект=Документы.РасходнаяНакладная.СоздатьДокумент();
		//ДокОбъект = ПолучитьНакладную(Склад, Шапка.НомЗаказа, Шапка.ДатаЗаказа, Шапка.ТипЗаказа);
		ДокОбъект = ПолучитьНакладную(Склад, Шапка[0].НомЗаказа, Шапка[0].ДатаЗаказа, Шапка[0].ТипЗаказа);
		Если ДокОбъект = Неопределено Тогда
			Возврат;
		КонецЕсли;
		// Катаев- 21/03/13
		//-----------------------------------------------------------------------------------------
		//    автозаполнение параметров шапки документа, разница в шапке - в складе отгрузки
		//-----------------------------------------------------------------------------------------
		Если не Контрагент.Пустая() Тогда 	
			//------------------------------------------
			//Организация=Справочники.Организации.НайтиПоКоду("SSP-12"); //КБ- Стиль
			//нечаева18,07,17++
			Организация=Справочники.Организации.НайтиПоКоду("SS-001"); 
			//нечаева18,07,17--
			
			ТипЦен=Контрагент.ТипЦен;
			Договор=Контрагент.ОсновнойДоговор;
			
			//нечаева 24,10,17++ для дикси мегамарт два договора прописали по коду
			Если контрагент.код = "SSP-3687" ТОгда
				Договор = справочники.Договоры.НайтиПоКоду("SNL-022280");
			КонецЕсли;
			//нечаева 24,10,17*--
			
			
			Если не (Договор=Неопределено) и не (Договор=справочники.Договоры.ПустаяСсылка()) Тогда
				//ТипЦен		=Договор.ТипЦен;
				ОтсрочкаПлатежа =Договор.ОтсрочкаПлатежа;
				Если ЗначениеЗаполнено(Договор.Организация) Тогда
					Организация=Договор.Организация;		
				КонецЕсли;
			КонецЕсли;
			//Катаев+ 30/05/13 Для Перекрестка отгрузка может быть и через ГалантТрейд
			Если Контрагент.Код = "SSP-3674" Тогда
				Если СтрШапка.Организация = "4607814849991" Тогда
					Организация = Справочники.Организации.НайтиПоКоду("SNL-48");
					Договор = Справочники.Договоры.НайтиПоКоду("SMN-1143");
				КонецЕсли;
			КонецЕсли;
			//Катаев- 30/05/13
			//----  доп. обработка;
			ДокОбъект.ДопОбработки.Очистить();
			Для Каждого СтрокаТЧ Из Контрагент.ВидыДопОбработок Цикл
				СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
			КонецЦикла; 
			//нечаева 23,03,17+++
			// добавляем из пункта доставки доп. обработки.
			Попытка
				Для Каждого СтрокаТЧ Из ПунктДоставки.ВидыДопОбработок Цикл
					СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
				КонецЦикла;  
			Исключение
			КонецПопытки;
			//нечаева 23,03,17---
			//Нечаева 12,09,18+++
			// для х5 промо доп обработка
			Если  СтрШапка.Промо = 1  Тогда
				СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки = справочники.ВидыДопОбработки.НайтиПоКоду("OD7-00129");
			КонецЕсли;
			//Нечаева 12,09,18---
			
			
			
			
			//нечаева18,07,17++
			Если контрагент.код = "SSP-3687" ТОгда
				Договор = справочники.Договоры.НайтиПоКоду("SNL-022280");
			КонецЕсли;
			//нечаева18,07,17*--
			
			//-----------------------------------------------
			Менеджер=Контрагент.Менеджер;
			Если Менеджер=Неопределено или Менеджер=Справочники.ФизическиеЛица.ПустаяСсылка() и ПризКр=0 Тогда
				КритичОшибки.Добавить("Для контрагента "+контрагент.наименование+"  код - "+контрагент.код+"  не определен менеджер! Заказ екоде №"+ Номерзаказа );
			Иначе
				Если Не СтрДлина(Менеджер.Емэйл)>2  и ПризКр=0   Тогда
					КритичОшибки.Добавить("Для менеджера "+Менеджер.наименование+"  код - "+Менеджер.код+"  не определен ЕМэйл!" );
				КонецЕсли;
			КонецЕсли;
			
			Подразделение = Контрагент.Менеджер.Подразделение;
			//нечаева заглушка для метрополиса 060422
			Если Контрагент.код = "CHF-0200" Тогда
				ДокОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("SSP-0118"); // филиал екатеренбург
				Подразделение = справочники.Подразделения.НайтиПоКоду("SSP-0118"); // филиал екатеренбург
			КонецЕсли;	
			//------------------------
			// код поставщика
			//------------------------
			КодПоставщикаКонтрагента=Контрагент.КодПоставщика;
			Если КодПоставщикаконтрагента.пустая() ИЛИ кодПоставщикаКонтрагента=Неопределено Тогда
				// Берем первую из справочника коды контрагентов
				Запрос=Новый Запрос;
				Запрос.Текст="ВЫБРАТЬ
				|	КодыПоставщиков.Ссылка
				|ИЗ
				|	Справочник.КодыПоставщиков КАК КодыПоставщиков
				|ГДЕ
				|	КодыПоставщиков.Владелец = &Контрагент
				|	И (КодыПоставщиков.Организация = &ТекОрганизация
				|			ИЛИ КодыПоставщиков.Организация = &Контр2)";
				Запрос.УстановитьПараметр("Контрагент",Контрагент);		
				Запрос.УстановитьПараметр("Контр2",Справочники.Контрагенты.ПустаяСсылка());		
				Запрос.УстановитьПараметр("ТекОрганизация",Организация);		
				Результат=Запрос.Выполнить().Выбрать();
				// катаев+ 28/02/13 Исправление ошибки
				//Пока Результат.Следующий() Цикл
				//	КодПоставщикаКонтрагента=Результат.ссылка;
				//	возврат;
				//КонецЦикла;
				Если Результат.Следующий() Тогда
					КодПоставщикаКонтрагента=Результат.ссылка;
				КонецЕсли;
			КонецЕсли;
			
			//для атака проставим
			//нечаева 08,04,21+++
			Если КодПоставщикаШапка <>"" Тогда
				
				КодПоставщикаКонтрагента=СокрЛП(КодПоставщикаШапка);
				// ищем в справочнике его.
				Запрос=Новый Запрос;
				Запрос.Текст="ВЫБРАТЬ
				|	КодыПоставщиков.Ссылка
				|ИЗ
				|	Справочник.КодыПоставщиков КАК КодыПоставщиков
				|ГДЕ
				|	КодыПоставщиков.Владелец = &Контрагент
				|	И (КодыПоставщиков.Организация = &ТекОрганизация
				|			ИЛИ КодыПоставщиков.Организация = &Контр2)
				|	И КодыПоставщиков.Наименование = &ТекНаим";
				Запрос.УстановитьПараметр("Контрагент",Контрагент);		
				Запрос.УстановитьПараметр("Контр2",Справочники.Контрагенты.ПустаяСсылка());		
				Запрос.УстановитьПараметр("ТекОрганизация",Организация);
				Запрос.УстановитьПараметр("ТекНаим",КодПоставщикаКонтрагента);
				Результат=Запрос.Выполнить().Выбрать();
				Если Результат.Следующий() Тогда
					КодПоставщикаКонтрагента=Результат.ссылка;
				КонецЕсли;
				// для атак нечаева 03,06,22
				Если Контрагент.код = "SSR-6556"  ТОгда
					
					КодПоставщикаКонтрагента = СокрЛП(КодПоставщикаШапка);
					КодПоставщикаКонтрагента = СтрЗаменить(КодПоставщикаКонтрагента,"0000","");
					
					// ищем в справочнике его.
					Запрос=Новый Запрос;
					Запрос.Текст="ВЫБРАТЬ
					|	КодыПоставщиков.Ссылка
					|ИЗ
					|	Справочник.КодыПоставщиков КАК КодыПоставщиков
					|ГДЕ
					|	КодыПоставщиков.Владелец = &Контрагент
					|	И (КодыПоставщиков.Организация = &ТекОрганизация
					|			ИЛИ КодыПоставщиков.Организация = &Контр2)
					|	И КодыПоставщиков.Наименование = &ТекНаим";
					Запрос.УстановитьПараметр("Контрагент",Контрагент);		
					Запрос.УстановитьПараметр("Контр2",Справочники.Контрагенты.ПустаяСсылка());		
					Запрос.УстановитьПараметр("ТекОрганизация",Организация);
					Запрос.УстановитьПараметр("ТекНаим",КодПоставщикаКонтрагента);
					Результат=Запрос.Выполнить().Выбрать();
					Если Результат.Следующий() Тогда
						КодПоставщикаКонтрагента=Результат.ссылка;
					КонецЕсли;
				КонецЕсли;	
				
			КонецЕсли;	
			//нечаева 08,04,21---
			
			
			
		КонецЕсли;
		
		//----------------------------------------------
		//доставка
		Если не ПунктДоставки=Неопределено  Тогда 
			Если ЗначениеЗаполнено(ПунктДоставки.РайонДоставки) Тогда
				РайонДоставки=ПунктДоставки.РайонДоставки;	
				ДокОбъект.РайонДоставки=РайонДоставки;
			КонецЕсли;	
			Если ЗначениеЗаполнено(ПунктДоставки.Регион) Тогда
				Регион=ПунктДоставки.Регион;
				ДокОбъект.Регион=Регион;
			КонецЕсли;	
			//Катаев+ 10/04/14 Транспортная компания заполняется только если выбран тип доставки = "ТранспортнаяКомпания"
			//Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
			//	ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
			//	ДокОбъект.ТранспортнаяКомпания=ТранспортнаяКомпания;
			//КонецЕсли;	
			//Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
			//	ПунктПерегруза=ПунктДоставки.ПунктПерегруза;	
			//	ДокОбъект.ПунктПерегруза=ПунктПерегруза;
			//КонецЕсли;		
			Если ПунктДоставки.ТипДоставки = Перечисления.ТипыДоставки.ТранспортнаяКомпания Тогда
				Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
					ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
					ДокОбъект.ТранспортнаяКомпания=ТранспортнаяКомпания;
				КонецЕсли;
				Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
					ПунктПерегруза=ПунктДоставки.ПунктПерегруза;	
					ДокОбъект.ПунктПерегруза=ПунктПерегруза;
				КонецЕсли;		
			КонецЕсли;
			//Катаев- 10/04/14
			Если ЗначениеЗаполнено(ПунктДоставки.Грузополучатель) Тогда
				Грузополучатель=ПунктДоставки.Грузополучатель;		
				ДокОбъект.Грузополучатель=Грузополучатель;
			КонецЕсли;
			Если ЗначениеЗаполнено(ПунктДоставки.Получатель) Тогда
				Получатель=ПунктДоставки.Получатель;		
				ДокОбъект.Получатель=Получатель;
			КонецЕсли;
			Если ЗначениеЗаполнено(ПунктДоставки.ОтсрочкаПлатежа) Тогда
				ОтсрочкаПлатежа=ПунктДоставки.ОтсрочкаПлатежа;		
				ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;
			КонецЕсли;
			
			//типы цен скидки
			Если ЗначениеЗаполнено(ПунктДоставки.ТипЦен) И ТипЦен<>ПунктДоставки.ТипЦен Тогда
				ТипЦен=ПунктДоставки.ТипЦен;		
			КонецЕсли; 
			Если ЗначениеЗаполнено(ПунктДоставки.ТипСкидок) И ДокОбъект.ТипСкидок<>ПунктДоставки.ТипСкидок Тогда
				ТипСкидок=ПунктДоставки.ТипСкидок;		
			КонецЕсли;
			Если ПунктДоставки.Скидка<>0 И ПунктДоставки.Скидка<>ДокОбъект.Скидка Тогда
				Скидка=ПунктДоставки.Скидка;		
				ДокОбъект.Скидка=Скидка;
			КонецЕсли;
		КонецЕсли;
		//-------------------------------------------------------------------		
		
		ДокОбъект.Дата=ТекущаяДата();
		ЗаполнитьШапкуДокумента(ДокОбъект, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
		//УстановитьНомерДокумента2(ДокОбъект);
		ДокОбъект.Контрагент=Контрагент;
		ДокОбъект.Организация=Организация;
		ДокОбъект.Договор=Договор;
		ДокОбъект.ИБ=Справочники.ИБ.НайтиПоКоду("SSP");
		ДокОбъект.Менеджер= Менеджер;
		ДокОбъект.НомерЗаказа= УбратьНули(НомЗаказа,Контрагент.УбиратьНулиПередНомеромЗаказа);
		
		
		ДокОбъект.КодПоставщика=КодПоставщикаКонтрагента;
		
		ДокОбъект.Регион = Регион;
		ТипШК=перечисления.ТипыШтрихКодов.Штука;
		
		ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;		
		ДокОбъект.ТипЦен=ТипЦен; //Контрагент.ТипЦен;
		ДокОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН;
		ДокОбъект.Подразделение = Подразделение;
		//нечаева заглушка для метрополиса 060422
		Если Контрагент.код = "CHF-0200" Тогда
			//ДокОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("SSP-0118"); // филиал екатеренбург
			Подразделение = справочники.Подразделения.НайтиПоКоду("SSP-0118"); // филиал екатеренбург
		КонецЕсли;	
		
		ДокОбъект.ЛевыйКонтрагент=Контрагент;
		ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
		ДокОбъект.Отгружен=перечисления.Отгружен.Резерв;
		ДокОбъект.ПунктДоставки=ПунктДоставки;
		ДокОбъект.Склад=Склад;		
		//нечаева 31,08,21+++ для озона
		Если  контрагент.код = "SSP-4991" ТОгда
			
			Склад= Справочники.Склады.НайтиПоКоду("STC-60");
			
		КонецЕсли;
		//нечаева 31,08,21---
		
		//нечаева 21,04,23+++
		Если  НЕ Контрагент.ОсновнойСкладОтгрузки.пустая() ТОгда
			
			Склад= Контрагент.ОсновнойСкладОтгрузки;
			
		КонецЕсли;
		// нечаева 21,04,23---
		
		//УстановитьНомерДокумента2(ДокОбъект);
		УстановитьНомерДокументаКлиентСервер(ДокОбъект);
		
		ДокОбъект.Валюта=Справочники.Валюты.НайтиПоКоду("810");
		//ДокОбъект.Автор				=Неопределено;
		// для х5 промо 
		Если  СтрШапка.Промо = 1  Тогда
			ДокОбъект.Комментарий =  "ПРОМО"+ДокОбъект.комментарий;
		КонецЕсли;
		//Нечаева 12,09,18---
		
		
		//нечаева 13,01,15+++
		Попытка
			ДокОбъект.ДатаЗаказа=Дата(СтрЗаменить(ДатаЗаказа, "-", ""));
			
			ДатаИзЗог = Дата(1,1,1);
			Если Контрагент.Код = "SSP-5862" Тогда // только для окея
				
				ДокОбъект.датаПриемки=Дата(СтрЗаменить(ДатаДоставки, "-", ""));
				// расчитаем от даты авизации.
				// в обратную сторону
				Если ДокОбъект.ПунктДоставки.ДнейВпути>0 и ЗначениеЗаполнено(ДокОбъект.ДатаПриемки) тогда 		
					ДатаИзЗог= ДокОбъект.ДатаПриемки-ДокОбъект.ПунктДоставки.ДнейВпути*24*3600;
					Сдвиг=ПолучитьСдвигДатыАвизации(ДокОбъект);   // если выходные
					ДатаИзЗог=ДатаИзЗог-сдвиг;
				Иначе 
					ДатаИзЗог = Дата(СтрЗаменить(ДатаДоставки, "-", ""));
					ДокОбъект.датаПриемки = '00010101';
				КонецЕсли;
				
				ДокОбъект.ДатаОтгрузки =ДатаИзЗог;
				
			Иначе
				ДокОбъект.ДатаОтгрузки=Дата(СтрЗаменить(ДатаДоставки, "-", ""));
			КонецЕсли;
			
		Исключение
		КонецПопытки;
		//нечаева 13,01,15---
		
		
		
		//крохин начало 02.08.2021
		//Если СокрЛП(Контрагент.Код)=КодМетро И (Лев(ДокОбъект.Номер,3)<>"SSP" или Лев(ДокОбъект.Номер,3)<>"SST")  Тогда
		Если СокрЛП(Контрагент.Код)=КодМетро И (Лев(ДокОбъект.Номер,3)<>"SSP" или Лев(ДокОбъект.Номер,3)<>"SST" или Лев(ДокОбъект.Номер,3)<>"SSV")  Тогда
			//крохин конец 02.08.2021
			//УстановитьНомерДокумента2(ДокОбъект);
			УстановитьНомерДокументаКлиентСервер(ДокОбъект);
			
		КонецЕсли;
		
		ДокОбъект.КодОперации=Перечисления.КодыОперацийОстатки.Реализация;
		ДокОбъект.ДатаОформления	=ДокОбъект.Дата;
		СкидкаКонтрагента=ПолучитьРеквизитРодителя(Контрагент,"Скидка");
		ДокОбъект.Скидка=СкидкаКонтрагента;
		
		ПересчетТЧ(ДокОбъект,"Товары",ДокОбъект.Валюта,ДокОбъект.Валюта,ДокОбъект.Курс,ДокОбъект.Курс,Истина);	
		// нечаева биллу теперь грузим 20,04,18+++
		//Если Контрагент.КодИЛН<>"9008727000007" Тогда
		Попытка
			ДокОбъект.Записать(режимЗаписиДокумента.Запись);
			Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
			//Сообщить("Записан документ - "+ДокОбъект.Дата+" "+ДокОбъект.Номер);
		Исключение
			// Катаев+ 22/08/13 Если возникла ошибка с уникальностью номера, то пробуем обновить нумерацию объектов и сгенерировать номер заново
			Инфо = ИнформацияОбОшибке();
			Если Найти(Инфо.Описание, "Не уникальный номер документа") > 0 Тогда
				ОбновитьНумерациюОбъектов();
				//УстановитьНомерДокумента2(ЭтотОбъект);
				УстановитьНомерДокументаКлиентСервер(ЭтотОбъект);
				
				Попытка
					ДокОбъект.Записать(режимЗаписиДокумента.Запись);
					Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
				Исключение
					Если ПризКр=0 тогда
						КритичОшибки.Добавить("После обновления нумерации для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
					конецЕсли;
				КонецПопытки;
			Иначе	
				Если ПризКр=0 тогда
					КритичОшибки.Добавить("Для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
				конецЕсли;
			КонецЕсли;
			// Катаев- 22/08/13
		КонецПопытки;
		//КонецЕсли;
		//сообщить("    документ записан");
		ПризКр=ПризКр+1;
		
	КонецЕсли;
	//-------------------------------------------------------------------------------------------------------------------------------------------
	//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
	// когда складов несколько и есть данные, которые нашлись
	//-------------------------------------------------------------------------------------------------------------------------------------------
	
	КоличествоСкладов=РезультатСклады.Количество();
	//---------------------------------------------------------------------------------
	//                          по циклу смотрим данные
	//-------------------------------------------------------------------------------------
	Пока РезультатСклады.Следующий() цикл
		
		// формируем документ по складу
		//---------------------------------------------------------------------	
		// выбираем строки номенклатуры по складу, заполняем строки
		
		Склад=РезультатСклады.Склад;
		
		//нечаева 31,08,21+++ для озона
		Если  контрагент.код = "SSP-4991" ТОгда
			
			Склад= Справочники.Склады.НайтиПоКоду("STC-60");
			
		КонецЕсли;
		//нечаева 31,08,21---
		//нечаева 21,04,23+++
		Если  НЕ Контрагент.ОсновнойСкладОтгрузки.пустая() ТОгда
			
			Склад= Контрагент.ОсновнойСкладОтгрузки;
			
		КонецЕсли;
		// нечаева 21,04,23---
		
		
		// Катаев+ 21/03/13 Создавать новый документ надо только для оригинала
		//ДокОбъект=Документы.РасходнаяНакладная.СоздатьДокумент();
		//ДокОбъект = ПолучитьНакладную(Склад, Шапка.НомЗаказа, Шапка.ДатаЗаказа, Шапка.ТипЗаказа);
		ДокОбъект = ПолучитьНакладную(Склад, Шапка[0].НомЗаказа, Шапка[0].ДатаЗаказа, Шапка[0].ТипЗаказа);
		Если ДокОбъект = Неопределено Тогда
			Возврат;
		КонецЕсли;
		// Катаев- 21/03/13
		//----------------------------------------------------------------------
		
		ТЗ2  = Новый ТаблицаЗначений;
		ТЗ2.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
		ТЗ2.Колонки.Добавить("Найдена", Новый ОписаниеТипов("Число"));
		ТЗ2.Колонки.Добавить("КолвоОтредактированное",Новый ОписаниеТипов("Число"));
		ТЗ2.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		
		Запрос = Новый Запрос;
		ДанныеСкладов=Неопределено;
		МВТ = Новый МенеджерВременныхТаблиц;
		Запрос.МенеджерВременныхТаблиц = МВТ;
		Запрос.Текст  = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗ2.Склад КАК Склад,
		|	ТЗ2.Номенклатура, 
		|	ТЗ2.КолвоОтредактированное,
		|	ТЗ2.Найдена,
		|	ТЗ2.НомерСтроки
		|ПОМЕСТИТЬ ТЗ2
		|ИЗ
		|	&ТЗ2 КАК ТЗ2
		|ГДЕ
		|	ТЗ2.Склад = &ТекСклад
		|	И ТЗ2.Найдена = 1";
		Запрос.УстановитьПараметр("ТекСклад",РезультатСклады.Склад);
		Запрос.УстановитьПараметр("ТЗ2", ТзСклады);
		Запрос.Выполнить();
		
		Запрос.Текст="ВЫБРАТЬ
		|	ТЗ2.Склад КАК Склад,
		|	ТЗ2.Номенклатура,
		|	ТЗ2.КолвоОтредактированное,
		|	ТЗ2.Найдена,
		|	ТЗ2.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ТЗ2 КАК ТЗ2
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		РезНом=Запрос.Выполнить().Выбрать();
		
		// ------------------------------------------------------------------------------------------------
		Пока РезНом.Следующий() Цикл
			строкатовара = 	ДокОбъект.Товары.Добавить();
			строкатовара.Номенклатура =РезНом.Номенклатура;
			строкатовара.Заявка = РезНом.КолвоОтредактированное;
			строкатовара.Количество = РезНом.КолвоОтредактированное;
			строкатовара.ПодтвержденнаяЗаявка = РезНом.КолвоОтредактированное;
			ПриИзмененииНоменклатурыТабЧасти(строкатовара, ДокОбъект);
			РассчитатьСуммуТабЧасти(строкатовара, ДокОбъект);
		КонецЦикла;
		
		//-----------------------------------------------------------------------------------------
		//    автозаполнение параметров шапки документа, разница в шапке - в складе отгрузки
		//-----------------------------------------------------------------------------------------
		
		Если не Контрагент.Пустая() Тогда 	
			//------------------------------------------
			//Организация=Справочники.Организации.НайтиПоКоду("SSP-12"); //КБ- Стиль
			
			//нечаева18,07,17++
			Организация=Справочники.Организации.НайтиПоКоду("SS-001"); 
			//нечаева18,07,17--
			
			
			ТипЦен=Контрагент.ТипЦен;
			Договор=Контрагент.ОсновнойДоговор;
			
			//нечаева 24,10,17++ для дикси мегамарт два договора прописали по коду
			Если контрагент.код = "SSP-3687" ТОгда
				Договор = справочники.Договоры.НайтиПоКоду("SNL-022280");
			КонецЕсли;
			//нечаева 24,10,17*--
			
			
			
			Если не (Договор=Неопределено) и не (Договор=справочники.Договоры.ПустаяСсылка()) Тогда
				//ТипЦен		=Договор.ТипЦен;
				ОтсрочкаПлатежа =Договор.ОтсрочкаПлатежа;
				Если ЗначениеЗаполнено(Договор.Организация) Тогда
					Организация=Договор.Организация;		
				КонецЕсли;
			КонецЕсли;
			//
			////нечаева18,07,17++
			//Если контрагент.код = "SSP-3687" ТОгда
			//	Договор = справочники.Договоры.НайтиПоКоду("SNL-022280");
			//КонецЕсли;
			////нечаева18,07,17*--
			
			
			//-----------------  доп. обработка   --------------------------------------------------------
			ДокОбъект.ДопОбработки.Очистить();
			
			Для Каждого СтрокаТЧ Из Контрагент.ВидыДопОбработок Цикл
				
				Если СокрЛП(Контрагент.Код)="SSP-8643"  или СокрЛП(Контрагент.Код)="SSP-2412"  Тогда  
					// для метро и реал  делаем спец. обработку. 
					
					//Если КоличествоСкладов>1 И (Склад.код="SNL-79" или Склад.код="SNL-22") Тогда     
					//нечаева поменяла склад 22,01,15++
					Если КоличествоСкладов>1 И (Склад.код="STA-20" или Склад.код="STA-10") Тогда     
						//нечаева поменяла склад 22,01,15++
						// если склад белье, то одну доп обработку не берем.
						Если СтрокаТЧ.ДопОбработка.Код="ODB-00017" Тогда
							продолжить; // не пишем эту доп обработку.   палетный ярлык не пишем
						КонецЕсли;
					КонецЕсли;
					
					//Катаев+ 11/07/13
					//СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					//СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка; // остальные стандартные добавляем
					//Катаев- 11/07/13
					
				КонецЕсли;
				//Катаев+ 11/07/13
				СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка; // остальные стандартные добавляем
				//Катаев- 11/07/13
				
			КонецЦикла; 
			//нечаева 23,03,17+++
			// добавляем из пункта доставки доп. обработки.
			попытка
				Для Каждого СтрокаТЧ Из ПунктДоставки.ВидыДопОбработок Цикл
					СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
				КонецЦикла;  
			исключение
			конецПопытки;
			//нечаева 23,03,17---
			
			
			//нечаева поменяла склад 22,01,15++
			Если СокрЛП(Контрагент.Код)="SSP-2412" И (Склад.код="STA-20" или Склад.код="STA-10") Тогда     
				//нечаева поменяла склад 22,01,15++
				
				// реал
				СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("ODB-00018"); // интри
				попытка
					СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("SNL-00031"); // белье на вешалках реал
				исключение
				конецпопытки;
				
			КонецЕсли;
			
			// бельевой склад
			//Если СокрЛП(Контрагент.Код)="SSP-8643" И (Склад.код="SNL-79" или Склад.код="SNL-22") Тогда 
			//нечаева поменяла склад 22,01,15++
			Если СокрЛП(Контрагент.Код)="SSP-8643" И (Склад.код="STA-20" или Склад.код="STA-10") Тогда     
				//нечаева поменяла склад 22,01,15++
				
				
				// метро 
				попытка
					СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					//Кухарь 28.06.17 начало
					//Теперь другая ДО
					//СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("SNL-00036"); // белье на вешалках метро	
					СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("OD7-00115"); // белье на вешалках метро
					//Кухарь 28.06.17 конец
					
				исключение
				конецпопытки;
			КонецЕсли;
			
			// когда колготочный склад
			Если СокрЛП(Контрагент.Код)="SSP-8643" И (Склад.код="STA-61" или Склад.код="SNL-82") Тогда 
				// метро 
				попытка
					СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					//Кухарь 28.06.17 начало
					//Теперь другая ДО
					//СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("ODN-00014");  // антикражка + поставщик 	
					СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("OD7-00101");  // антикражка + поставщик 
					//Кухарь 28.06.17 конец
					
				исключение
				конецпопытки;
			КонецЕсли;
			
			//Нечаева 12,09,18+++
			// для х5 промо доп обработка
			Если  СтрШапка.Промо = 1  Тогда
				СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки = справочники.ВидыДопОбработки.НайтиПоКоду("OD7-00129");
			КонецЕсли;
			//Нечаева 12,09,18---
			
			
			
			
			//-------------------------------------------------------------------------------------------
			Менеджер=Контрагент.Менеджер;
			Если Менеджер=Неопределено или Менеджер=Справочники.ФизическиеЛица.ПустаяСсылка() и ПризКр=0 Тогда
				КритичОшибки.Добавить("Для контрагента "+контрагент.наименование+"  код - "+контрагент.код+"  не определен менеджер! Заказ екоде №"+ Номерзаказа );
			Иначе
				Если Не СтрДлина(Менеджер.Емэйл)>2  и ПризКр=0   Тогда
					КритичОшибки.Добавить("Для менеджера "+Менеджер.наименование+"  код - "+Менеджер.код+"  не определен ЕМэйл!" );
				КонецЕсли;
			КонецЕсли;
			
			Подразделение = Контрагент.Менеджер.Подразделение;
			//нечаева заглушка для метрополиса 060422
			Если Контрагент.код = "CHF-0200" Тогда
				//ДокОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("SSP-0118"); // филиал екатеренбург
				Подразделение = справочники.Подразделения.НайтиПоКоду("SSP-0118"); // филиал екатеренбург
			КонецЕсли;	
			
			//------------------------
			// код поставщика
			//------------------------
			КодПоставщикаКонтрагента=Контрагент.КодПоставщика;
			Если КодПоставщикаконтрагента.пустая() ИЛИ кодПоставщикаКонтрагента=Неопределено Тогда
				// Берем первую из справочника коды контрагентов
				Запрос=Новый Запрос;
				Запрос.Текст="ВЫБРАТЬ
				|	КодыПоставщиков.Ссылка
				|ИЗ
				|	Справочник.КодыПоставщиков КАК КодыПоставщиков
				|ГДЕ
				|	КодыПоставщиков.Владелец = &Контрагент
				|	И (КодыПоставщиков.Организация = &ТекОрганизация
				|			ИЛИ КодыПоставщиков.Организация = &Контр2)";
				Запрос.УстановитьПараметр("Контрагент",Контрагент);		
				Запрос.УстановитьПараметр("Контр2",Справочники.Контрагенты.ПустаяСсылка());		
				Запрос.УстановитьПараметр("ТекОрганизация",Организация);		
				Результат=Запрос.Выполнить().Выбрать();
				// катаев+ 28/02/13 Исправление ошибки
				//Пока Результат.Следующий() Цикл
				//	КодПоставщикаКонтрагента=Результат.ссылка;
				//	возврат;
				//КонецЦикла;
				Если Результат.Следующий() Тогда
					КодПоставщикаКонтрагента=Результат.ссылка;
				КонецЕсли;
				
			КонецЕсли;
			
			
			//для атака проставим
			//нечаева 08,04,21+++
			Если КодПоставщикаШапка <>"" Тогда
				
				КодПоставщикаКонтрагента=СокрЛП(КодПоставщикаШапка);
				// ищем в справочнике его.
				Запрос=Новый Запрос;
				Запрос.Текст="ВЫБРАТЬ
				|	КодыПоставщиков.Ссылка
				|ИЗ
				|	Справочник.КодыПоставщиков КАК КодыПоставщиков
				|ГДЕ
				|	КодыПоставщиков.Владелец = &Контрагент
				|	И (КодыПоставщиков.Организация = &ТекОрганизация
				|			ИЛИ КодыПоставщиков.Организация = &Контр2)
				|	И КодыПоставщиков.Наименование = &ТекНаим";
				Запрос.УстановитьПараметр("Контрагент",Контрагент);		
				Запрос.УстановитьПараметр("Контр2",Справочники.Контрагенты.ПустаяСсылка());		
				Запрос.УстановитьПараметр("ТекОрганизация",Организация);
				Запрос.УстановитьПараметр("ТекНаим",КодПоставщикаКонтрагента);
				Результат=Запрос.Выполнить().Выбрать();
				Если Результат.Следующий() Тогда
					КодПоставщикаКонтрагента=Результат.ссылка;
				КонецЕсли;
				
				// для атак нечаева 03,06,22
				Если Контрагент.код = "SSR-6556"  ТОгда
					
					КодПоставщикаКонтрагента = СокрЛП(КодПоставщикаШапка);
					КодПоставщикаКонтрагента = СтрЗаменить(КодПоставщикаКонтрагента,"0000","");
					
					// ищем в справочнике его.
					Запрос=Новый Запрос;
					Запрос.Текст="ВЫБРАТЬ
					|	КодыПоставщиков.Ссылка
					|ИЗ
					|	Справочник.КодыПоставщиков КАК КодыПоставщиков
					|ГДЕ
					|	КодыПоставщиков.Владелец = &Контрагент
					|	И (КодыПоставщиков.Организация = &ТекОрганизация
					|			ИЛИ КодыПоставщиков.Организация = &Контр2)
					|	И КодыПоставщиков.Наименование = &ТекНаим";
					Запрос.УстановитьПараметр("Контрагент",Контрагент);		
					Запрос.УстановитьПараметр("Контр2",Справочники.Контрагенты.ПустаяСсылка());		
					Запрос.УстановитьПараметр("ТекОрганизация",Организация);
					Запрос.УстановитьПараметр("ТекНаим",КодПоставщикаКонтрагента);
					Результат=Запрос.Выполнить().Выбрать();
					Если Результат.Следующий() Тогда
						КодПоставщикаКонтрагента=Результат.ссылка;
					КонецЕсли;
				КонецЕсли;	
				
				
				
			КонецЕсли;	
			//нечаева 08,04,21---
			
			
		КонецЕсли;
		
		//----------------------------------------------
		//доставка
		Если не ПунктДоставки=Неопределено  Тогда 
			Если ЗначениеЗаполнено(ПунктДоставки.РайонДоставки) Тогда
				РайонДоставки=ПунктДоставки.РайонДоставки;	
				ДокОбъект.РайонДоставки=РайонДоставки;
			КонецЕсли;	
			Если ЗначениеЗаполнено(ПунктДоставки.Регион) Тогда
				Регион=ПунктДоставки.Регион;
				ДокОбъект.Регион=Регион;
			КонецЕсли;	
			
			Если ПунктДоставки.ТипДоставки = Перечисления.ТипыДоставки.ТранспортнаяКомпания Тогда
				Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
					ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
					ДокОбъект.ТранспортнаяКомпания=ТранспортнаяКомпания;
				КонецЕсли;
				Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
					ПунктПерегруза=ПунктДоставки.ПунктПерегруза;	
					ДокОбъект.ПунктПерегруза=ПунктПерегруза;
				КонецЕсли;		
			КонецЕсли;
			//Катаев- 10/04/14
			Если ЗначениеЗаполнено(ПунктДоставки.Грузополучатель) Тогда
				Грузополучатель=ПунктДоставки.Грузополучатель;		
				ДокОбъект.Грузополучатель=Грузополучатель;
			КонецЕсли;
			Если ЗначениеЗаполнено(ПунктДоставки.Получатель) Тогда
				Получатель=ПунктДоставки.Получатель;		
				ДокОбъект.Получатель=Получатель;
			КонецЕсли;
			Если ЗначениеЗаполнено(ПунктДоставки.ОтсрочкаПлатежа) Тогда
				ОтсрочкаПлатежа=ПунктДоставки.ОтсрочкаПлатежа;		
				ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;
			КонецЕсли;
			
			//типы цен скидки
			Если ЗначениеЗаполнено(ПунктДоставки.ТипЦен) И ТипЦен<>ПунктДоставки.ТипЦен Тогда
				ТипЦен=ПунктДоставки.ТипЦен;		
			КонецЕсли; 
			Если ЗначениеЗаполнено(ПунктДоставки.ТипСкидок) И ДокОбъект.ТипСкидок<>ПунктДоставки.ТипСкидок Тогда
				ТипСкидок=ПунктДоставки.ТипСкидок;		
			КонецЕсли;
			Если ПунктДоставки.Скидка<>0 И ПунктДоставки.Скидка<>ДокОбъект.Скидка Тогда
				Скидка=ПунктДоставки.Скидка;		
				ДокОбъект.Скидка=Скидка;
			КонецЕсли;
		КонецЕсли;
		//-------------------------------------------------------------------		
		
		ДокОбъект.Дата=ТекущаяДата();
		ЗаполнитьШапкуДокумента(ДокОбъект, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
		//УстановитьНомерДокумента2(ДокОбъект);
		ДокОбъект.Контрагент=Контрагент;
		ДокОбъект.Организация=Организация;
		ДокОбъект.Договор=Договор;
		ДокОбъект.ИБ=Справочники.ИБ.НайтиПоКоду("SSP");
		ДокОбъект.Менеджер= Менеджер;
		ДокОбъект.НомерЗаказа= УбратьНули(НомерЗаказа,Контрагент.УбиратьНулиПередНомеромЗаказа);
		// для х5 промо 
		Если  СтрШапка.Промо = 1  Тогда
			ДокОбъект.Комментарий =  "ПРОМО"+ДокОбъект.комментарий;
		КонецЕсли;
		//Нечаева 12,09,18---
		
		
		Попытка
			ДокОбъект.ДатаЗаказа=Дата(СтрЗаменить(ДатаЗаказа, "-", ""));
			ДокОбъект.ДатаОтгрузки=Дата(СтрЗаменить(ДатаДоставки, "-", ""));
		Исключение
		КонецПопытки;
		
		
		//нечаева 27,11,17+++
		Попытка
			//14,05,20 нечаева
			ПервыйЗнак = Лев(ВремяДоставки,1); // если 09:00, то ищем " 9:00"
			Если ПЕрвыйЗнак = "0" ТОгда    
				ВремяДоставки =" "+Сред(СтрШапка.ВремяДоставки,2,СтрДлина(СтрШапка.ВремяДоставки)-1) ;
			КонецЕсли;	
			//14-05-20 нечаева
			
			
			
			ДокОбъект.ВремяПриемки = Справочники.ВремяПриемки.НайтиПоНаименованию(""+ВремяДоставки+":00-"+ВремяДоставки+":00");
			
			// только после сохранения докмуента возможно.
			//
			//ЗаписьВРег=РегистрыСведений.РеквизитыДокументов.СоздатьМенеджерЗаписи();
			//ЗаписьВРег.Документ=Документ.Ссылка;
			//ЗаписьВРег.ИмяРеквизита="ВремяПриемкиДляЗОГ";
			//ЗаписьВРег.Период=Документ.Ссылка.Дата;
			//ЗаписьВРег.ЗначениеРеквизита=ВремяПриемки;
			//ЗаписьВРег.Записать();
			
		Исключение
		КонецПопытки;
		//нечаева 27,11,17---
		
		
		ДокОбъект.КодПоставщика=КодПоставщикаКонтрагента;
		
		ДокОбъект.Регион = Регион;
		ТипШК=перечисления.ТипыШтрихКодов.Штука;
		
		ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;		
		ДокОбъект.ТипЦен=ТипЦен; //Контрагент.ТипЦен;
		ДокОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН;
		ДокОбъект.Подразделение = Подразделение;
		ДокОбъект.ЛевыйКонтрагент=Контрагент;
		ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
		ДокОбъект.Отгружен=перечисления.Отгружен.Резерв;
		ДокОбъект.ПунктДоставки=ПунктДоставки;
		
		ДокОбъект.Склад=Склад;	
		//нечаева 31,08,21+++ для озона
		Если  контрагент.код = "SSP-4991" ТОгда
			
			Склад= Справочники.Склады.НайтиПоКоду("STC-60");
			
		КонецЕсли;
		//нечаева 31,08,21---
		//нечаева 21,04,23+++
		Если  НЕ Контрагент.ОсновнойСкладОтгрузки.пустая() ТОгда
			
			Склад= Контрагент.ОсновнойСкладОтгрузки;
			
		КонецЕсли;
		// нечаева 21,04,23---
		
		
		//	УстановитьНомерДокумента2(ДокОбъект);
		УстановитьНомерДокументаКлиентСервер(ДокОбъект);
		
		ДокОбъект.Валюта=Справочники.Валюты.НайтиПоКоду("810");
		ДокОбъект.Автор	=Неопределено;
		
		//крохин начало 02.08.2021
		//Если СокрЛП(Контрагент.Код)=КодМетро И (Лев(ДокОбъект.Номер,3)<>"SSP" или Лев(ДокОбъект.Номер,3)<>"SST") Тогда
		Если СокрЛП(Контрагент.Код)=КодМетро И (Лев(ДокОбъект.Номер,3)<>"SSP" или Лев(ДокОбъект.Номер,3)<>"SST" или Лев(ДокОбъект.Номер,3)<>"SSV") Тогда
			//крохин конец 02.08.2021
			//УстановитьНомерДокумента2(ДокОбъект);
			УстановитьНомерДокументаКлиентСервер(ДокОбъект);
			
		КонецЕсли;
		
		ДокОбъект.КодОперации=Перечисления.КодыОперацийОстатки.Реализация;
		ДокОбъект.ДатаОформления	=ДокОбъект.Дата;
		СкидкаКонтрагента=ПолучитьРеквизитРодителя(Контрагент,"Скидка");
		ДокОбъект.Скидка=СкидкаКонтрагента;
		
		//Валетов + 30.06.2026 Изменение 0000000060
		//ДокОбъект.ДатаОплаты	    =ПолучитьДатуОплаты1(ДокОбъект.ДатаОтгрузки,ДокОбъект.ОтсрочкаПлатежа);	
		ПараметрыРасчетаДатыОплаты  = ОбщегоНазначенияКС.ПолучитьЗаполнитьПараметрыРасчетаДатыОплатыПоДокументу(ДокОбъект);
		ДокОбъект.ДатаОплаты 		= ОбщегоНазначенияКС.ПолучитьДатуОплатыПоДокументуКлиентСервер(ПараметрыРасчетаДатыОплаты); 
		//Валетов-
		
		ПересчетТЧ(ДокОбъект,"Товары",ДокОбъект.Валюта,ДокОбъект.Валюта,ДокОбъект.Курс,ДокОбъект.Курс,Истина);
		
		//проверим на пустые цены!!
		//нечаева 15,03,16+++
		
		ОтборНулевыеЦены=новый Структура("Цена",0);
		МассивНулевыхЦен=ДокОбъект.Товары.НайтиСтроки(ОтборНулевыеЦены);
		
		
		Для каждого текстрока из МассивНулевыхЦен цикл
			
			Отбор2=новый Структура("номенклатура",ТекСтрока.номенклатура);
			тстрока=ДокОбъект.Товары.НайтиСтроки(Отбор2);
			Ошибки.Добавить("Для товара -  "+ТекСтрока.номенклатура +" Цена =0, не записано в заказе, проверьте матрицу! " );
			ТекНом =тстрока[0].НомерСтроки; //.удалить()
			докобъект.товары.Удалить(ТекНом-1);
			
		КонецЦикла;
		//нечаева 15,03,16---
		
		
		//нечева 20,04,18+++ биллу теперь грузим
		//Если Контрагент.КодИЛН<>"9008727000007" Тогда
		Попытка
			ДокОбъект.Записать(режимЗаписиДокумента.Запись);
			//Катаев+ 31/10/13 В регистр сведений заносим GLN  конечного пункта (Лента)
			
			
			//Для Х5 куча реквизитов
			//нечаева 17,09,18+++
			Попытка
				
				НоваяЗаписьТек = РегистрыСведений.ЗначенияСвойствОбъектовУПД.СоздатьМенеджерЗаписи();
				НоваяЗаписьТек.Объект   = ДокОбъект.Ссылка;
				НоваяЗаписьТек.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию(СокрЛП("EDI_КонтактыЛогистов")); 
				НоваяЗаписьТек.Значение = ""+СтрШапка.ИмяЛогиста+" / "+СтрШапка.АдресЛогиста;
				НоваяЗаписьТек.Записать();
				
			Исключение
			КонецПопытки;
			
			
			
			Попытка
				Если СокрЛП(СтрШапка.ОкнаДоставки)<>"" Тогда
					НоваяЗаписьТек = РегистрыСведений.ЗначенияСвойствОбъектовУПД.СоздатьМенеджерЗаписи();
					НоваяЗаписьТек.Объект   = ДокОбъект.Ссылка;
					НоваяЗаписьТек.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию(СокрЛП("EDI_ОкнаДоставки")); 
					НоваяЗаписьТек.Значение = ""+СтрШапка.ОкнаДоставки;
					НоваяЗаписьТек.Записать();
				КонецЕсли;
				
			Исключение
			КонецПопытки;
			//нечаева 17,09,18---
			
			
			
			//нечаева 27,11,17+++   только для Окея
			Если ДокОбъект.контрагент.код = "SSP-5862" Тогда
				Попытка
					//	ДокОбъект.ВремяПриемки = Справочники.ВремяПриемки.НайтиПоНаименованию(""+ВремяДоставки+":00-"+ВремяДоставки+":00");
					//14,05,20 нечаева
					ПервыйЗнак = Лев(СтрШапка.ВремяДоставки,1); // если 09:00, то ищем " 9:00"
					Если ПЕрвыйЗнак = "0" ТОгда    
						ВремяДоставки =" "+Сред(СтрШапка.ВремяДоставки,2,СтрДлина(СтрШапка.ВремяДоставки)-1) ;
					КонецЕсли;	
					//14-05-20 нечаева
					
					// только после сохранения докмуента возможно.
					//
					ЗаписьВРег=РегистрыСведений.РеквизитыДокументов.СоздатьМенеджерЗаписи();
					ЗаписьВРег.Документ=ДокОбъект.Ссылка;
					ЗаписьВРег.ИмяРеквизита="ВремяПриемкиДляЗОГ";
					ЗаписьВРег.Период=ДокОбъект.Ссылка.Дата;
					ЗаписьВРег.ЗначениеРеквизита=Справочники.ВремяПриемки.НайтиПоНаименованию(""+ВремяДоставки+":00-"+ВремяДоставки+":00");
					ЗаписьВРег.Записать();
					
				Исключение
				КонецПопытки;
			КонецЕсли;
			//нечаева 27,11,17---
			
			
			//нечаева 02,12,19+++						
			//для виктории балтии
			Если ДокОбъект.Контрагент.Код="SSR-4726"  Тогда
				попытка
					
					НаборЗаписей = РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Документ.Установить(ДокОбъект.Ссылка); 
					НаборЗаписей.Отбор.ИмяРеквизита.Установить("GLN"); 
					НаборЗаписей.Очистить();;
					НаборЗаписей.Записать();
					
				исключение
				конецПопытки;
				
				попытка
					рег = регистрыСведений.РеквизитыРНКПНКПРМ;
					Элемент = Рег.СоздатьМенеджерЗаписи();
					Элемент.Документ = ДокОбъект.ссылка;
					Элемент.ИмяРеквизита = "GLN";
					Элемент.ЗначениеРеквизита = СтрШапка.ИЛНПлательщика;
					Элемент.Записать();
				исключение
				конецПопытки;
				
			КонецЕсли;
			//нечаева 02,12,19+++		
			
			
			// для атака
			//Нечаева 25,10,17++
			Если ДокОбъект.Контрагент.Код="SSR-6556"  Тогда
				попытка
					
					НаборЗаписей = РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Документ.Установить(ДокОбъект.Ссылка); 
					НаборЗаписей.Отбор.ИмяРеквизита.Установить("GLN"); 
					НаборЗаписей.Очистить();;
					НаборЗаписей.Записать();
					
				исключение
				конецПопытки;
				
				рег = регистрыСведений.РеквизитыРНКПНКПРМ;
				Элемент = Рег.СоздатьМенеджерЗаписи();
				Элемент.Документ = ДокОбъект.ссылка;
				Элемент.ИмяРеквизита = "GLN";
				Элемент.ЗначениеРеквизита = СтрШапка.ИЛНМестаДоставки;
				Элемент.Записать();
				
				
				
				//нечаева 02,11,17+++
				Попытка
					НаборЗаписей = РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Документ.Установить(ДокОбъект.Ссылка); 
					НаборЗаписей.Отбор.ИмяРеквизита.Установить("GLNпокупателя"); 
					НаборЗаписей.Очистить();;
					НаборЗаписей.Записать();
				Исключение
				КонецПопытки;
				
				
				Попытка
					рег = регистрыСведений.РеквизитыРНКПНКПРМ;
					Элемент = Рег.СоздатьМенеджерЗаписи();
					Элемент.Документ = ДокОбъект.ссылка;
					Элемент.ИмяРеквизита = "GLNпокупателя";
					Элемент.ЗначениеРеквизита = СтрШапка.ИЛНПокупателя;
					Элемент.Записать();
				Исключение
				КонецПопытки;
				//нечаева 02,11,17---
				
				
			КонецЕсли;
			//Нечаева 25,10,17--
			
			//нечаева 07,10,2022+++  для ленты
			Если стрШапка.контрагент.код = "SSR-1593" и ( СтрШапка.ГЛН_Конечный = "" или  СтрШапка.ГЛН_Конечный = неопределено) тогда  // это лента
				
				СтрШапка.ГЛН_Конечный = ДокОбъект.ПунктДоставки.КодИЛН;
				
			конецЕсли;	
			// нечаева 07,10,22--
			
			
			// нечаева 23,03,16 +++ если напрямую грузим! не через рц
			Если СтрШапка.ГЛН_Конечный = "" Тогда
				СтрШапка.ГЛН_Конечный = ДокОбъект.ПунктДоставки.КодИЛН;
			КонецЕсли;
			// нечаева 23,03,16 ---	
			
			
			Если СтрШапка.ГЛН_Конечный <> Неопределено Тогда
				//нечаева 13,03,17+++
				
				//было
				//рег = регистрыСведений.РеквизитыРНКПНКПРМ;
				//ВыборкаРег = Рег.Выбрать();
				//Пока ВыборкаРег.Следующий() Цикл
				//	Если ВыборкаРег.ИмяРеквизита = "GLN" И ВыборкаРег.Документ = ДокОбъект.Ссылка Тогда;
				//		ВыборкаРег.ПолучитьМенеджерЗаписи().Удалить();
				//	КонецЕсли;
				//КонецЦикла;
				//Элемент = Рег.СоздатьМенеджерЗаписи();
				//Элемент.Документ = ДокОбъект.ссылка;
				//Элемент.ИмяРеквизита = "GLN";
				//Элемент.ЗначениеРеквизита = СтрШапка.ГЛН_Конечный;
				//Элемент.Записать();
				
				попытка
					
					НаборЗаписей = РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Документ.Установить(ДокОбъект.Ссылка); 
					НаборЗаписей.Отбор.ИмяРеквизита.Установить("GLN"); 
					НаборЗаписей.Очистить();;
					НаборЗаписей.Записать();
					
				исключение
				конецПопытки;
				
				рег = регистрыСведений.РеквизитыРНКПНКПРМ;
				Элемент = Рег.СоздатьМенеджерЗаписи();
				Элемент.Документ = ДокОбъект.ссылка;
				Элемент.ИмяРеквизита = "GLN";
				Элемент.ЗначениеРеквизита = СтрШапка.ГЛН_Конечный;
				Элемент.Записать();
				
				//нечаева 13,03,17----
				
				
			КонецЕсли;
			//Катаев- 31/10/13
			//Катаев+ 01/12/14 Для Молнии заносим в регистр сведений Номер заявки
			
			//нечаева 26,11,18+++
			Если Контрагент = Справочники.Контрагенты.НайтиПоКоду("CHF-0006") ТОгда
				
				Если СтрШапка.НомерЗаявкиМолния <> Неопределено Тогда
					рег = регистрыСведений.РеквизитыРНКПНКПРМ;
					ВыборкаРег = Рег.Выбрать();
					Пока ВыборкаРег.Следующий() Цикл
						Если ВыборкаРег.ИмяРеквизита = "НомерЗаявкиМолния" И ВыборкаРег.Документ = ДокОбъект.Ссылка Тогда;
							ВыборкаРег.ПолучитьМенеджерЗаписи().Удалить();
						КонецЕсли;
					КонецЦикла;
					Элемент = Рег.СоздатьМенеджерЗаписи();
					Элемент.Документ = ДокОбъект.ссылка;
					Элемент.ИмяРеквизита = "НомерЗаявкиМолния";
					Элемент.ЗначениеРеквизита = СтрШапка.НомерЗаявкиМолния;
					Элемент.Записать();
				КонецЕсли;
			КонецЕсли;
			//нечаева 26,11,18---
			
			
			//Катаев- 01/12/14
			Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
			//Сообщить("Записан документ - "+ДокОбъект.Дата+" "+ДокОбъект.Номер);
			// записать номер в "ошибки" для вывода менеджерам
		Исключение
			// Катаев+ 22/08/13 Если возникла ошибка с уникальностью номера, то пробуем обновить нумерацию объектов и сгенерировать номер заново
			Инфо = ИнформацияОбОшибке();
			Если Найти(Инфо.Описание, "Не уникальный номер документа") > 0 Тогда
				ОбновитьНумерациюОбъектов();
				//УстановитьНомерДокумента2(ЭтотОбъект);
				УстановитьНомерДокументаКлиентСервер(ЭтотОбъект);
				
				Попытка
					ДокОбъект.Записать(режимЗаписиДокумента.Запись);
					Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
					//Катаев+ 31/10/13 В регистр сведений заносим GLN  конечного пункта (Лента)
					
					
					// для атака
					//Нечаева 25,10,17++
					Если ДокОбъект.Контрагент.Код="SSR-6556"  Тогда
						попытка
							
							НаборЗаписей = РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();
							НаборЗаписей.Отбор.Документ.Установить(ДокОбъект.Ссылка); 
							НаборЗаписей.Отбор.ИмяРеквизита.Установить("GLN"); 
							НаборЗаписей.Очистить();;
							НаборЗаписей.Записать();
							
						исключение
						конецПопытки;
						
						рег = регистрыСведений.РеквизитыРНКПНКПРМ;
						Элемент = Рег.СоздатьМенеджерЗаписи();
						Элемент.Документ = ДокОбъект.ссылка;
						Элемент.ИмяРеквизита = "GLN";
						Элемент.ЗначениеРеквизита = СтрШапка.ИЛНМестаДоставки;
						Элемент.Записать();
						
						//нечаева 02,11,17+++
						Попытка
							НаборЗаписей = РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();
							НаборЗаписей.Отбор.Документ.Установить(ДокОбъект.Ссылка); 
							НаборЗаписей.Отбор.ИмяРеквизита.Установить("GLNпокупателя"); 
							НаборЗаписей.Очистить();;
							НаборЗаписей.Записать();
						Исключение
						КонецПопытки;
						
						
						Попытка
							рег = регистрыСведений.РеквизитыРНКПНКПРМ;
							Элемент = Рег.СоздатьМенеджерЗаписи();
							Элемент.Документ = ДокОбъект.ссылка;
							Элемент.ИмяРеквизита = "GLNпокупателя";
							Элемент.ЗначениеРеквизита = СтрШапка.ИЛНПокупателя;
							Элемент.Записать();
						Исключение
						КонецПопытки;
						//нечаева 02,11,17---
						
						
					КонецЕсли;
					//Нечаева 25,10,17--
					
					//нечаева 07,10,2022+++
					Если стрШапка.контрагент.код = "SSR-1593" и ( СтрШапка.ГЛН_Конечный = "" или  СтрШапка.ГЛН_Конечный = неопределено) тогда  // это лента
						
						СтрШапка.ГЛН_Конечный = ДокОбъект.ПунктДоставки.КодИЛН;
						
					конецЕсли;	
					// нечаева 07,10,22--
					
					
					
					// нечаева 23,03,16 +++ если напрямую грузим! не через рц
					Если СтрШапка.ГЛН_Конечный = "" Тогда
						СтрШапка.ГЛН_Конечный = ДокОбъект.ПунктДоставки.КодИЛН;
					КонецЕсли;
					// нечаева 23,03,16 ---	
					
					Если СтрШапка.ГЛН_Конечный <> Неопределено Тогда
						//нечаева 13,03,17+++
						
						//было
						//рег = регистрыСведений.РеквизитыРНКПНКПРМ;
						//ВыборкаРег = Рег.Выбрать();
						//Пока ВыборкаРег.Следующий() Цикл
						//	Если ВыборкаРег.ИмяРеквизита = "GLN" И ВыборкаРег.Документ = ДокОбъект.Ссылка Тогда;
						//		ВыборкаРег.ПолучитьМенеджерЗаписи().Удалить();
						//	КонецЕсли;
						//КонецЦикла;
						//Элемент = Рег.СоздатьМенеджерЗаписи();
						//Элемент.Документ = ДокОбъект.ссылка;
						//Элемент.ИмяРеквизита = "GLN";
						//Элемент.ЗначениеРеквизита = СтрШапка.ГЛН_Конечный;
						//Элемент.Записать();
						
						попытка
							
							НаборЗаписей = РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();
							НаборЗаписей.Отбор.Документ.Установить(ДокОбъект.Ссылка); 
							НаборЗаписей.Отбор.ИмяРеквизита.Установить("GLN"); 
							НаборЗаписей.Очистить();;
							НаборЗаписей.Записать();
							
						исключение
						конецПопытки;
						
						рег = регистрыСведений.РеквизитыРНКПНКПРМ;
						Элемент = Рег.СоздатьМенеджерЗаписи();
						Элемент.Документ = ДокОбъект.ссылка;
						Элемент.ИмяРеквизита = "GLN";
						Элемент.ЗначениеРеквизита = СтрШапка.ГЛН_Конечный;
						Элемент.Записать();
						
						//нечаева 13,03,17----
						
					КонецЕсли;
					//Катаев- 31/10/13
				Исключение
					Если ПризКр=0 тогда
						КритичОшибки.Добавить("После обновления нумерации для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
						//Катаев+ 11/12/14
						Отказ = Истина;
						//Катаев- 11/12/14
					конецЕсли;
				КонецПопытки;
			Иначе	
				Если ПризКр=0 тогда
					КритичОшибки.Добавить("Для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
					//Катаев+ 11/12/14
					Отказ = Истина;
					//Катаев- 11/12/14
				конецЕсли;
			КонецЕсли;
			// Катаев- 22/08/13
			//Сообщить(ОписаниеОшибки());
		КонецПопытки;
		//КонецЕсли;
		//сообщить("    документ записан");
		ПризКр=ПризКр+1;
	КонецЦикла;
	// конец заполнения документа
	
	
КонецПроцедуры

// для ашана 
Процедура ОбработкаДанныхЗагрузкиАшан(Шапка,Строки)
	
	Ашан=1;
	
	СтрШапка=Шапка.Получить(0);
	ТипЦен=Справочники.ТипыЦен.ПустаяСсылка();
	ТипСкидки=Справочники.ТипыСкидок.ПустаяСсылка();
	Организация=Неопределено;
	Менеджер=Неопределено;
	Регион=Неопределено;
	Договор=Неопределено;
	Подразделение=Неопределено;
	ОтсрочкаПлатежа=Неопределено;
	КодПоставщикаКонтрагента=Неопределено;
	ПунктДоставки=Неопределено;
	НомерЗаказа=Неопределено;
	ТипILNКонтрагента=Неопределено;
	ДатаЗаказа=Неопределено;
	ДатаОтгрузки=Неопределено;
	Склад=Неопределено;   //Справочники.Склады.НайтиПоКоду("STA-61");
	Контрагент=СтрШапка.Контрагент;
	Если Контрагент=Неопределено тогда
		Контрагент=Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;	
	ПунктДоставки=СтрШапка.ПунктДоставки;
	НомЗаказа=СтрШапка.НомЗаказа;
	НомерЗаказа=СтрШапка.НомЗаказа;
	ДатаЗаказа=СтрШапка.ДатаЗаказа;
	ДатаДоставки=СтрШапка.ДатаДоставки;
	ТипILNКонтрагента=СтрШапка.ТипILNКонтрагента;
	
	//нечаева 13,08,19+++
	КодПоставщикаШапка = СтрШапка.КодДоговора;
	//нечаева 13,08,19---
	
	ПризКр=0;
	//сообщить("    запись документа");
	Если не Контрагент.Пустая() Тогда 	
		// 1. Обрабатываем количество, делаем округление  соответствуещее коли-ву в блочке
		Если Контрагент.ОткруглятьКоличество Тогда
			
			Для каждого ТекСтрока Из Строки Цикл
				ПризКратности=1;
				Ном=ТекСтрока.Номенклатура;
				КолЗаказано=ТекСтрока.Колво;
				
				Если НЕ ТипЗнч(Ном) = Тип("СправочникСсылка.Номенклатура") Тогда
					ТекСтрока.КолвоОтредактированное=КолЗаказано;
					продолжить;
				КонецЕсли;
				
				ШтукВКор=Ном.Родитель.ШтукВКоробочке;
				Если ШтукВКор-0>0 Тогда 
					// проверяем на кратность 5 или 6
					Если (ШтукВКор/5)=Цел((ШтукВКор/5)) Тогда
						ПризКратности=5
					ИначеЕсли (ШтукВКор/6)=Цел((ШтукВКор/6)) Тогда
						ПризКратности=6
					Иначе
						ПризКратности=1;
					КонецЕсли;
					
					Если (КолЗаказано/ПризКратности)<>Цел((КолЗаказано/ПризКратности)) Тогда
						КолУпак=Цел(Окр(КолЗаказано/ПризКратности,0,0));
						НовКолво=КолУпак*ПризКратности;
						ТекСтрока.КолвоОтредактированное=НовКолво;
					Иначе
						ТекСтрока.КолвоОтредактированное=КолЗаказано;
					Конецесли;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для каждого ТекСтрока Из Строки Цикл
				КолЗаказано=ТекСтрока.Колво;
				ТекСтрока.КолвоОтредактированное=КолЗаказано;			
			КонецЦикла;
			
		КонецЕсли;
		
		// 2. проверяем дублированный заказ есть или нет. в пределах недели;
		Если Контрагент.ПроверятьНаличиеЗаказа Тогда
			
			Дата1=ТекущаяДата();
			Дата2=ТекущаяДата() - 60 * 60 * 24 * 7; // неделя назад;
			
			Запрос=новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	РасходнаяНакладная.Номер,
			|	РасходнаяНакладная.Дата,
			|	РасходнаяНакладная.Ссылка
			|ИЗ
			|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
			|ГДЕ
			|	РасходнаяНакладная.Контрагент = &Контрагент
			|	И РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
			|	И РасходнаяНакладная.Дата МЕЖДУ НачалоПериода(&Дата2) И КонецПериода(&Дата1)";
			
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("ПунктДоставки",ПунктДоставки);
			Запрос.УстановитьПараметр("Дата1",Дата1);
			Запрос.УстановитьПараметр("Дата2",Дата2);
			
			Рез=Запрос.Выполнить().Выбрать();
			
			// добавляем в сообщения менеджерам
			Пока Рез.Следующий() Цикл
				Строка="Для заказа ЕКОДЕ № "+НомЗаказа+" существует копия заказа РНК №"+Рез.Номер+" от "+Рез.Дата;
				Ошибки.Добавить(Строка);
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	//-------------------------------------------------------------------------------------------------------------------------------------------
	//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
	// когда складов несколько и есть данные, которые нашлись
	//-------------------------------------------------------------------------------------------------------------------------------------------
	
	// загрузка ТЗ в запрос
	//--------------------------------------------
	ТЗСклады=Строки;
	
	// создается для временной таблицы
	ТЗ  = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТЗ.Колонки.Добавить("Найдена", Новый ОписаниеТипов("Число"));
	
	Запрос = Новый Запрос;
	ДанныеСкладов=Неопределено;
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст  = "ВЫБРАТЬ различные
	|    ТЗ.Склад как Склад,
	|    ТЗ.Найдена
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|    &ТЗ КАК ТЗ";
	
	Запрос.УстановитьПараметр("ТЗ", ТзСклады);
	Запрос.Выполнить();
	
	Запрос.Текст="ВЫБРАТЬ
	|	ТЗ.Склад КАК Склад,
	|	ТЗ.Найдена
	|ИЗ
	|	ТЗ КАК ТЗ
	|ГДЕ
	|	ТЗ.Найдена = 1";
	РезультатСклады=Запрос.Выполнить().Выбрать();
	
	Если РезультатСклады.Количество()=0 Тогда
		// пустой документ! не формируем ?
		// нечеаева 10,08,20+++
		Склад=Справочники.Склады.НайтиПоКоду("STA-61"); //STA-61
		//нечаева 21,04,23+++
		Если  НЕ Контрагент.ОсновнойСкладОтгрузки.пустая() ТОгда
			
			Склад= Контрагент.ОсновнойСкладОтгрузки;
			
		КонецЕсли;
		// нечаева 21,04,23---
		
		//нечаева 10,08,20---
		// Катаев+ 21/03/13 Создавать новый документ надо только для оригинала
		//ДокОбъект=Документы.РасходнаяНакладная.СоздатьДокумент();
		//ДокОбъект = ПолучитьНакладную(Склад, Шапка.НомЗаказа, Шапка.ДатаЗаказа, Шапка.ТипЗаказа);
		ДокОбъект = ПолучитьНакладную(Склад, Шапка[0].НомЗаказа, Шапка[0].ДатаЗаказа, Шапка[0].ТипЗаказа);
		Если ДокОбъект = Неопределено Тогда
			Возврат;
		КонецЕсли;
		// Катаев- 21/03/13
		//-----------------------------------------------------------------------------------------
		//    автозаполнение параметров шапки документа, разница в шапке - в складе отгрузки
		//-----------------------------------------------------------------------------------------
		Если не Контрагент.Пустая() Тогда 	
			//------------------------------------------
			Организация=Справочники.Организации.НайтиПоКоду("SSP-12"); //КБ- Стиль
			ТипЦен=Контрагент.ТипЦен;
			Договор=Контрагент.ОсновнойДоговор;
			Если не (Договор=Неопределено) и не (Договор=справочники.Договоры.ПустаяСсылка()) Тогда
				//ТипЦен		=Договор.ТипЦен;
				ОтсрочкаПлатежа =Договор.ОтсрочкаПлатежа;
				Если ЗначениеЗаполнено(Договор.Организация) Тогда
					Организация=Договор.Организация;		
				КонецЕсли;
			КонецЕсли;
			//----  доп. обработка;
			ДокОбъект.ДопОбработки.Очистить();
			Для Каждого СтрокаТЧ Из Контрагент.ВидыДопОбработок Цикл
				СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
			КонецЦикла; 
			//нечаева 23,03,17+++
			// добавляем из пункта доставки доп. обработки.
			попытка
				Для Каждого СтрокаТЧ Из ПунктДоставки.ВидыДопОбработок Цикл
					СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
				КонецЦикла;  
			исключение
			конецПопытки;
			//нечаева 23,03,17---
			
			//-----------------------------------------------
			Менеджер=Контрагент.Менеджер;
			Если Менеджер=Неопределено или Менеджер=Справочники.ФизическиеЛица.ПустаяСсылка() и ПризКр=0 Тогда
				КритичОшибки.Добавить("Для контрагента "+контрагент.наименование+"  код - "+контрагент.код+"  не определен менеджер! Заказ екоде №"+ Номерзаказа );
			Иначе
				Если Не СтрДлина(Менеджер.Емэйл)>2  и ПризКр=0   Тогда
					КритичОшибки.Добавить("Для менеджера "+Менеджер.наименование+"  код - "+Менеджер.код+"  не определен ЕМэйл!" );
				КонецЕсли;
			КонецЕсли;
			
			//Катаев+ 06/08/14 Из ЕКОД все контрагенты грузятся с использованием номенклатурной матрицы. Проверку убрал
			//Если Контрагент.ТипЦен=Справочники.ТипыЦен.ПустаяСсылка() и ПризКр=0 и Контрагент.код<>"SSP-3674" Тогда
			//	//Катаев+ 17/10/13 Проверяем есть ли тип цены по пункту доставки
			//	//КритичОшибки.Добавить("Для контрагента "+Контрагент.Наименование+" не установлен тип цен по умолчанию!");
			//	Если ПунктДоставки = Неопределено Тогда
			//		КритичОшибки.Добавить("Для контрагента "+Контрагент.Наименование+" не установлен тип цен по умолчанию!");
			//	Иначе
			//		Если Не ЗначениеЗаполнено(ПунктДоставки.ТипЦен) Тогда
			//			КритичОшибки.Добавить("Для контрагента "+Контрагент.Наименование+" не установлен тип цен по умолчанию!");
			//		КонецЕсли;
			//	КонецЕсли;
			//	//Катаев- 17/10/13
			//КонецЕсли;
			//Катаев- 06/08/14
			Подразделение = Контрагент.Менеджер.Подразделение;
			
			//------------------------
			// код поставщика
			//------------------------
			КодПоставщикаКонтрагента=Контрагент.КодПоставщика;
			//нечаева 13,08,19+++
			Если КодПоставщикаШапка <>"" Тогда
				
				КодПоставщикаКонтрагента=Лев(КодПоставщикаШапка,5);
				// ищем в справочнике его.
				Запрос=Новый Запрос;
				Запрос.Текст="ВЫБРАТЬ
				|	КодыПоставщиков.Ссылка
				|ИЗ
				|	Справочник.КодыПоставщиков КАК КодыПоставщиков
				|ГДЕ
				|	КодыПоставщиков.Владелец = &Контрагент
				|	И (КодыПоставщиков.Организация = &ТекОрганизация
				|			ИЛИ КодыПоставщиков.Организация = &Контр2)
				|	И КодыПоставщиков.Наименование = &ТекНаим";
				Запрос.УстановитьПараметр("Контрагент",Контрагент);		
				Запрос.УстановитьПараметр("Контр2",Справочники.Контрагенты.ПустаяСсылка());		
				Запрос.УстановитьПараметр("ТекОрганизация",Организация);
				Запрос.УстановитьПараметр("ТекНаим",КодПоставщикаКонтрагента);
				Результат=Запрос.Выполнить().Выбрать();
				Если Результат.Следующий() Тогда
					КодПоставщикаКонтрагента=Результат.ссылка;
				КонецЕсли;
				
				// для атак нечаева 03,06,22
				Если Контрагент.код = "SSR-6556"  ТОгда
					
					КодПоставщикаКонтрагента = СокрЛП(КодПоставщикаШапка);
					КодПоставщикаКонтрагента = СтрЗаменить(КодПоставщикаКонтрагента,"0000","");
					
					// ищем в справочнике его.
					Запрос=Новый Запрос;
					Запрос.Текст="ВЫБРАТЬ
					|	КодыПоставщиков.Ссылка
					|ИЗ
					|	Справочник.КодыПоставщиков КАК КодыПоставщиков
					|ГДЕ
					|	КодыПоставщиков.Владелец = &Контрагент
					|	И (КодыПоставщиков.Организация = &ТекОрганизация
					|			ИЛИ КодыПоставщиков.Организация = &Контр2)
					|	И КодыПоставщиков.Наименование = &ТекНаим";
					Запрос.УстановитьПараметр("Контрагент",Контрагент);		
					Запрос.УстановитьПараметр("Контр2",Справочники.Контрагенты.ПустаяСсылка());		
					Запрос.УстановитьПараметр("ТекОрганизация",Организация);
					Запрос.УстановитьПараметр("ТекНаим",КодПоставщикаКонтрагента);
					Результат=Запрос.Выполнить().Выбрать();
					Если Результат.Следующий() Тогда
						КодПоставщикаКонтрагента=Результат.ссылка;
					КонецЕсли;
				КонецЕсли;	
				
				
			КонецЕсли;	
			//нечаева 13,08,19---
			
			
			
			
			Если КодПоставщикаконтрагента.пустая() ИЛИ кодПоставщикаКонтрагента=Неопределено Тогда
				// Берем первую из справочника коды контрагентов
				Запрос=Новый Запрос;
				Запрос.Текст="ВЫБРАТЬ
				|	КодыПоставщиков.Ссылка
				|ИЗ
				|	Справочник.КодыПоставщиков КАК КодыПоставщиков
				|ГДЕ
				|	КодыПоставщиков.Владелец = &Контрагент
				|	И (КодыПоставщиков.Организация = &ТекОрганизация
				|			ИЛИ КодыПоставщиков.Организация = &Контр2)";
				Запрос.УстановитьПараметр("Контрагент",Контрагент);		
				Запрос.УстановитьПараметр("Контр2",Справочники.Контрагенты.ПустаяСсылка());		
				Запрос.УстановитьПараметр("ТекОрганизация",Организация);		
				Результат=Запрос.Выполнить().Выбрать();
				Если Результат.Следующий() Тогда
					КодПоставщикаКонтрагента=Результат.ссылка;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		//----------------------------------------------
		//доставка
		Если не ПунктДоставки=Неопределено  Тогда 
			Если ЗначениеЗаполнено(ПунктДоставки.РайонДоставки) Тогда
				РайонДоставки=ПунктДоставки.РайонДоставки;	
				ДокОбъект.РайонДоставки=РайонДоставки;
			КонецЕсли;	
			Если ЗначениеЗаполнено(ПунктДоставки.Регион) Тогда
				Регион=ПунктДоставки.Регион;
				ДокОбъект.Регион=Регион;
			КонецЕсли;	
			//Катаев+ 10/04/14 Транспортная компания заполняется только если выбран тип доставки = "ТранспортнаяКомпания"
			//Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
			//	ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
			//	ДокОбъект.ТранспортнаяКомпания=ТранспортнаяКомпания;
			//КонецЕсли;	
			//Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
			//	ПунктПерегруза=ПунктДоставки.ПунктПерегруза;	
			//	ДокОбъект.ПунктПерегруза=ПунктПерегруза;
			//КонецЕсли;		
			Если ПунктДоставки.ТипДоставки = Перечисления.ТипыДоставки.ТранспортнаяКомпания Тогда
				Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
					ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
					ДокОбъект.ТранспортнаяКомпания=ТранспортнаяКомпания;
				КонецЕсли;
				Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
					ПунктПерегруза=ПунктДоставки.ПунктПерегруза;	
					ДокОбъект.ПунктПерегруза=ПунктПерегруза;
				КонецЕсли;		
			КонецЕсли;
			//Катаев- 10/04/14
			Если ЗначениеЗаполнено(ПунктДоставки.Грузополучатель) Тогда
				Грузополучатель=ПунктДоставки.Грузополучатель;		
				ДокОбъект.Грузополучатель=Грузополучатель;
			КонецЕсли;
			Если ЗначениеЗаполнено(ПунктДоставки.Получатель) Тогда
				Получатель=ПунктДоставки.Получатель;		
				ДокОбъект.Получатель=Получатель;
			КонецЕсли;
			Если ЗначениеЗаполнено(ПунктДоставки.ОтсрочкаПлатежа) Тогда
				ОтсрочкаПлатежа=ПунктДоставки.ОтсрочкаПлатежа;		
				ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;
			КонецЕсли;
			
			//типы цен скидки
			Если ЗначениеЗаполнено(ПунктДоставки.ТипЦен) И ТипЦен<>ПунктДоставки.ТипЦен Тогда
				ТипЦен=ПунктДоставки.ТипЦен;		
			КонецЕсли; 
			Если ЗначениеЗаполнено(ПунктДоставки.ТипСкидок) И ДокОбъект.ТипСкидок<>ПунктДоставки.ТипСкидок Тогда
				ТипСкидок=ПунктДоставки.ТипСкидок;		
			КонецЕсли;
			Если ПунктДоставки.Скидка<>0 И ПунктДоставки.Скидка<>ДокОбъект.Скидка Тогда
				Скидка=ПунктДоставки.Скидка;		
				ДокОбъект.Скидка=Скидка;
			КонецЕсли;
		КонецЕсли;
		//-------------------------------------------------------------------		
		
		ДокОбъект.Дата=ТекущаяДата();
		ЗаполнитьШапкуДокумента(ДокОбъект, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
		//УстановитьНомерДокумента2(ДокОбъект);
		ДокОбъект.Контрагент=Контрагент;
		ДокОбъект.Организация=Организация;
		ДокОбъект.Договор=Договор;
		ДокОбъект.ИБ=Справочники.ИБ.НайтиПоКоду("SSP");
		ДокОбъект.Менеджер= Менеджер;
		ДокОбъект.НомерЗаказа= УбратьНули(НомЗаказа,Контрагент.УбиратьНулиПередНомеромЗаказа);
		
		Попытка
			ДокОбъект.ДатаЗаказа=Дата(СтрЗаменить(ДатаЗаказа, "-", ""));
			ДокОбъект.ДатаОтгрузки=Дата(СтрЗаменить(ДатаДоставки, "-", ""));
		Исключение
		КонецПопытки;
		ДокОбъект.КодПоставщика=КодПоставщикаКонтрагента;
		
		
		ДокОбъект.Регион = Регион;
		ТипШК=перечисления.ТипыШтрихКодов.Штука;
		
		ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;		
		ДокОбъект.ТипЦен=ТипЦен; //Контрагент.ТипЦен;
		ДокОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН;
		ДокОбъект.Подразделение = Подразделение;
		ДокОбъект.ЛевыйКонтрагент=Контрагент;
		ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
		ДокОбъект.Отгружен=перечисления.Отгружен.Резерв;
		ДокОбъект.ПунктДоставки=ПунктДоставки;
		ДокОбъект.Склад=Склад;		
		//УстановитьНомерДокумента2(ДокОбъект);
		УстановитьНомерДокументаКлиентСервер(ДокОбъект);
		
		ДокОбъект.Валюта=Справочники.Валюты.НайтиПоКоду("810");
		//ДокОбъект.Автор				=Неопределено;
		
		//Валетов + 30.06.2026 Изменение 0000000060
		//ДокОбъект.ДатаОплаты	    =ПолучитьДатуОплаты1(ДокОбъект.ДатаОтгрузки,ДокОбъект.ОтсрочкаПлатежа);	
		ПараметрыРасчетаДатыОплаты  = ОбщегоНазначенияКС.ПолучитьЗаполнитьПараметрыРасчетаДатыОплатыПоДокументу(ДокОбъект);
		ДокОбъект.ДатаОплаты 		= ОбщегоНазначенияКС.ПолучитьДатуОплатыПоДокументуКлиентСервер(ПараметрыРасчетаДатыОплаты); 
		//Валетов-
	
		
		Если СокрЛП(Контрагент.Код)=КодМетро И (Лев(ДокОбъект.Номер,3)<>"SSP" или Лев(ДокОбъект.Номер,3)<>"SST") Тогда
			//УстановитьНомерДокумента2(ДокОбъект);	 
			УстановитьНомерДокументаКлиентСервер(ДокОбъект);
			
		КонецЕсли;
		
		ДокОбъект.КодОперации=Перечисления.КодыОперацийОстатки.Реализация;
		ДокОбъект.ДатаОформления	=ДокОбъект.Дата;
		СкидкаКонтрагента=ПолучитьРеквизитРодителя(Контрагент,"Скидка");
		ДокОбъект.Скидка=СкидкаКонтрагента;
		
		// нечаева 23,09,22++
		попытка
			ДопСкидка = КодПоставщикаКонтрагента.скидка;
			Если ДопСкидка<>0 ТОгда
				ДокОбъект.скидка = допскидка;	
				докобъект.ДопСкидкаНаНакладную = истина;
				
			конецесли;
			
		исключение
		конецПопытки;	
		// нечаева 23,09,22--
		
		
		ПересчетТЧ(ДокОбъект,"Товары",ДокОбъект.Валюта,ДокОбъект.Валюта,ДокОбъект.Курс,ДокОбъект.Курс,Истина);	
		
		//*************************************************************
		// если код поставщика = 1958, то не грузим в базу этот документ.
		Если докОбъект.КодПоставщика=справочники.КодыПоставщиков.НайтиПоКоду("SSP-000002") Тогда
			
			Файлы.Добавить("Для кода поставщика=1958  - документ не создан. ");
			
		Иначе	
			
			Попытка
				ДокОбъект.Записать(режимЗаписиДокумента.Запись);
				Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
				//Сообщить("Записан документ - "+ДокОбъект.Дата+" "+ДокОбъект.Номер);
				// записать номер в "ошибки" для вывода менеджерам
			Исключение
				// Катаев+ 22/08/13 Если возникла ошибка с уникальностью номера, то пробуем обновить нумерацию объектов и сгенерировать номер заново
				Инфо = ИнформацияОбОшибке();
				Если Найти(Инфо.Описание, "Не уникальный номер документа") > 0 Тогда
					ОбновитьНумерациюОбъектов();
					//УстановитьНомерДокумента2(ЭтотОбъект);
					УстановитьНомерДокументаКлиентСервер(ЭтотОбъект);
					
					Попытка
						ДокОбъект.Записать(режимЗаписиДокумента.Запись);
						Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
					Исключение
						Если ПризКр=0 тогда
							КритичОшибки.Добавить("После обновления нумерации для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
						конецЕсли;
					КонецПопытки;
				Иначе	
					Если ПризКр=0 тогда
						КритичОшибки.Добавить("Для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
					конецЕсли;
				КонецЕсли;
				// Катаев- 22/08/13
				//Сообщить(ОписаниеОшибки());
			КонецПопытки;
			//сообщить("    документ записан");
			ПризКр=ПризКр+1;
		КонецЕсли;
	КонецЕсли;
	
	//---------------------------------------------------------------------------------
	//                          по циклу смотрим данные
	//-------------------------------------------------------------------------------------
	Пока РезультатСклады.Следующий() цикл
		
		Склад=РезультатСклады.Склад;
		// формируем документ по складу
		//---------------------------------------------------	
		// выбираем строки номенклатуры по складу, заполняем строки
		ТЗ2  = Новый ТаблицаЗначений;
		ТЗ2.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
		ТЗ2.Колонки.Добавить("Найдена", Новый ОписаниеТипов("Число"));
		ТЗ2.Колонки.Добавить("КолвоОтредактированное",Новый ОписаниеТипов("Число"));
		ТЗ2.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТЗ2.Колонки.Добавить("ПризнакГруппыНом",Новый ОписаниеТипов("Число"));
		
		Запрос = Новый Запрос;
		ДанныеСкладов=Неопределено;
		МВТ = Новый МенеджерВременныхТаблиц;
		Запрос.МенеджерВременныхТаблиц = МВТ;
		Запрос.Текст  = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗ2.Склад КАК Склад,
		|	ТЗ2.Номенклатура, 
		|	ТЗ2.КолвоОтредактированное,
		|	ТЗ2.Найдена,
		|	ТЗ2.НомерСтроки,
		|	ТЗ2.ПризнакГруппыНом
		|ПОМЕСТИТЬ ТЗ2
		|ИЗ
		|	&ТЗ2 КАК ТЗ2
		|ГДЕ
		|	ТЗ2.Склад = &ТекСклад
		|	И ТЗ2.Найдена = 1";
		Запрос.УстановитьПараметр("ТекСклад",Склад);
		Запрос.УстановитьПараметр("ТЗ2", ТзСклады);
		Запрос.Выполнить();
		
		Запрос.Текст="ВЫБРАТЬ
		|	ТЗ2.Склад КАК Склад,
		|	ТЗ2.Номенклатура,
		|	ТЗ2.КолвоОтредактированное,
		|	ТЗ2.Найдена,
		|	ТЗ2.НомерСтроки КАК НомерСтроки,
		|	ТЗ2.ПризнакГруппыНом
		|ИЗ
		|	ТЗ2 КАК ТЗ2
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		РезНом=Запрос.Выполнить().Выгрузить();
		
		
		//******************************************************************************************
		//-------------------------------------------------------------------------------------------------
		// обрабатываем на документы по папкам для ашана и гиперглобуса (создаются несколько документов)
		//-------------------------------------------------------------------------------------------------
		// выбиреам 3 типа папок - ашан , 2 типа гипер глобус  // +1 к ним - остальные папки
		// создаем  несколько таб частей и фигачим несколько документов по ним.
		
		РезНом1=Новый ТаблицаЗначений;
		РезНом2=Новый ТаблицаЗначений;
		РезНом3=Новый ТаблицаЗначений;
		РезНом4=Новый ТаблицаЗначений;
		РезНом5=Новый ТаблицаЗначений;
		РезНом6=Новый ТаблицаЗначений;
		
		
		// Сформировать структуру отбора. 
		// Найти строки. 
		Отбор = Новый Структура();
		Отбор.Вставить("ПризнакГруппыНом", 1); 
		РезНом1 = РезНом.НайтиСтроки(Отбор); 
		
		Отбор1 = Новый Структура();
		Отбор1.Вставить("ПризнакГруппыНом", 2); 
		РезНом2 = РезНом.НайтиСтроки(Отбор1);
		
		Отбор3 = Новый Структура();
		Отбор3.Вставить("ПризнакГруппыНом", 5); // колготки
		РезНом5 = РезНом.НайтиСтроки(Отбор3); 
		
		
		
		
		//----------------------------------------------
		
		Для НомПриз=1 По 5 Цикл
			
			Результат=Неопределено;
			Если НомПРиз=1 ТОгда
				Если РезНом1.количество()>0 Тогда
					Результат=резном1;
				конецЕсли;
			КонецЕсли;	
			Если НомПРиз=2 ТОгда
				Если РезНом2.количество()>0  Тогда
					Результат=резном2;
				КонецЕсли;
			КонецЕсли;	
			
			Если НомПРиз=5  Тогда
				Если РезНом5.количество()>0 Тогда
					Результат=резном5;
				конецЕсли;
			КонецЕсли;
			
			
			Если Результат=Неопределено Тогда
				продолжить;
			КонецЕсли;
			
			//Состояние(""+Контрагент+" "+Склад);
			
			Если НЕ Результат[0].Склад=Склад Тогда
				продолжить;
			КонецЕсли;	
			
			
			// Катаев+ 21/03/13 Создавать новый документ надо только для оригинала
			//ДокОбъект=Документы.РасходнаяНакладная.СоздатьДокумент();
			//ДокОбъект = ПолучитьНакладную(Склад, Шапка.НомЗаказа, Шапка.ДатаЗаказа, Шапка.ТипЗаказа);
			ДокОбъект = ПолучитьНакладную(Склад, Шапка[0].НомЗаказа, Шапка[0].ДатаЗаказа, Шапка[0].ТипЗаказа);
			Если ДокОбъект = Неопределено Тогда
				Возврат;
			КонецЕсли;
			// Катаев- 21/03/13
			// ------------------------------------------------------------------------------------------------
			Для Каждого ТекущаяСтрока Из Результат Цикл 
				СтрокаТовара = 	ДокОбъект.Товары.Добавить();
				СтрокаТовара.Номенклатура =ТекущаяСтрока.Номенклатура;
				СтрокаТовара.Заявка = ТекущаяСтрока.КолвоОтредактированное;
				СтрокаТовара.Количество = ТекущаяСтрока.КолвоОтредактированное;
				СтрокаТовара.ПодтвержденнаяЗаявка = ТекущаяСтрока.КолвоОтредактированное;
				
				ПриИзмененииНоменклатурыТабЧасти(СтрокаТовара, ДокОбъект);
				РассчитатьСуммуТабЧасти(СтрокаТовара, ДокОбъект);
			КонецЦикла;
			
			//-----------------------------------------------------------------------------------------
			//    автозаполнение параметров шапки документа, разница в шапке - в складе отгрузки
			//-----------------------------------------------------------------------------------------
			
			Если не Контрагент.Пустая() Тогда 	
				//------------------------------------------
				Организация=Справочники.Организации.НайтиПоКоду("SSP-12"); //КБ- Стиль
				ТипЦен=Контрагент.ТипЦен;
				Договор=Контрагент.ОсновнойДоговор;
				Если не (Договор=Неопределено) и не (Договор=справочники.Договоры.ПустаяСсылка()) Тогда
					//ТипЦен		=Договор.ТипЦен;
					ОтсрочкаПлатежа =Договор.ОтсрочкаПлатежа;
					Если ЗначениеЗаполнено(Договор.Организация) Тогда
						Организация=Договор.Организация;		
					КонецЕсли;
				КонецЕсли;
				
				////----------------------------------------------------------------------------------------
				////****** факт адрес и код поставщика *****************
				////----------------------------------------------------------------------------------------
				//Если ПунктДоставки=Справочники.ПунктыДоставки.НайтиПоКоду("SNL-000806") И (НомПриз=2 Или номПРиз=3) Тогда 
				//	// игры и регионы - факт адрес
				//	ДокОбъект.ТранспортнаяКомпания=Справочники.Контрагенты.НайтиПоКоду("SSP-6719");
				//	ДокОбъект.ПунктПерегруза=справочники.ПунктыДоставки.НайтиПоКоду("SNL-003951");
				//	ДокОбъект.КодПоставщика=1958;
				//Иначе
				//	ДокОбъект.ТранспортнаяКомпания=Справочники.Контрагенты.НайтиПоКоду("SSP-6719");
				//	ДокОбъект.ПунктПерегруза=справочники.ПунктыДоставки.НайтиПоКоду("SNL-003952");
				//	ДокОбъект.КодПоставщика=4661;
				//КонецЕсли; 
				//
				////************************************************
				
				//----  доп. обработка; --------------------------------
				ДокОбъект.ДопОбработки.Очистить();
				Для Каждого СтрокаТЧ Из Контрагент.ВидыДопОбработок Цикл
					СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
				КонецЦикла;  
				//нечаева 23,03,17+++
				// добавляем из пункта доставки доп. обработки.
				попытка
					Для Каждого СтрокаТЧ Из ПунктДоставки.ВидыДопОбработок Цикл
						СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
						СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
					КонецЦикла;  
				Исключение
				конецПопытки;
				//нечаева 23,03,17---
				
				//-----------------------------------------------
				
				Менеджер=Контрагент.Менеджер;
				Если Менеджер=Неопределено или Менеджер=Справочники.ФизическиеЛица.ПустаяСсылка() и ПризКр=0 Тогда
					КритичОшибки.Добавить("Для контрагента "+контрагент.наименование+"  код - "+контрагент.код+"  не определен менеджер! Заказ екоде №"+ Номерзаказа );
				Иначе
					Если Не СтрДлина(Менеджер.Емэйл)>2  и ПризКр=0   Тогда
						КритичОшибки.Добавить("Для менеджера "+Менеджер.наименование+"  код - "+Менеджер.код+"  не определен ЕМэйл!" );
					КонецЕсли;
				КонецЕсли;
				
				//Катаев+ 06/08/14 Из ЕКОД все контрагенты грузятся с использованием номенклатурной матрицы. Проверку убрал
				//Если Контрагент.ТипЦен=Справочники.ТипыЦен.ПустаяСсылка() и ПризКр=0 и Контрагент.код<>"SSP-3674" Тогда
				//	//Катаев+ 17/10/13 Проверяем есть ли тип цены по пункту доставки
				//	//КритичОшибки.Добавить("Для контрагента "+Контрагент.Наименование+" не установлен тип цен по умолчанию!");
				//	Если ПунктДоставки = Неопределено Тогда
				//		КритичОшибки.Добавить("Для контрагента "+Контрагент.Наименование+" не установлен тип цен по умолчанию!");
				//	Иначе
				//		Если Не ЗначениеЗаполнено(ПунктДоставки.ТипЦен) Тогда
				//			КритичОшибки.Добавить("Для контрагента "+Контрагент.Наименование+" не установлен тип цен по умолчанию!");
				//		КонецЕсли;
				//	КонецЕсли;
				//	//Катаев- 17/10/13
				//КонецЕсли;
				//Катаев- 06/08/14
				Подразделение = Контрагент.Менеджер.Подразделение;
				
				//------------------------
				// код поставщика
				//------------------------
				КодПоставщикаКонтрагента=Контрагент.КодПоставщика;
				//нечаева 13,08,19+++
				Если КодПоставщикаШапка <>"" Тогда
					
					КодПоставщикаКонтрагента=Лев(КодПоставщикаШапка,5);
					// ищем в справочнике его.
					Запрос=Новый Запрос;
					Запрос.Текст="ВЫБРАТЬ
					|	КодыПоставщиков.Ссылка
					|ИЗ
					|	Справочник.КодыПоставщиков КАК КодыПоставщиков
					|ГДЕ
					|	КодыПоставщиков.Владелец = &Контрагент
					|	И (КодыПоставщиков.Организация = &ТекОрганизация
					|			ИЛИ КодыПоставщиков.Организация = &Контр2)
					|	И КодыПоставщиков.Наименование = &ТекНаим";
					Запрос.УстановитьПараметр("Контрагент",Контрагент);		
					Запрос.УстановитьПараметр("Контр2",Справочники.Контрагенты.ПустаяСсылка());		
					Запрос.УстановитьПараметр("ТекОрганизация",Организация);
					Запрос.УстановитьПараметр("ТекНаим",КодПоставщикаКонтрагента);
					Результат=Запрос.Выполнить().Выбрать();
					Если Результат.Следующий() Тогда
						КодПоставщикаКонтрагента=Результат.ссылка;
					КонецЕсли;
					
					// для атак нечаева 03,06,22
					Если Контрагент.код = "SSR-6556"  ТОгда
						
						КодПоставщикаКонтрагента = СокрЛП(КодПоставщикаШапка);
						КодПоставщикаКонтрагента = СтрЗаменить(КодПоставщикаКонтрагента,"0000","");
						
						// ищем в справочнике его.
						Запрос=Новый Запрос;
						Запрос.Текст="ВЫБРАТЬ
						|	КодыПоставщиков.Ссылка
						|ИЗ
						|	Справочник.КодыПоставщиков КАК КодыПоставщиков
						|ГДЕ
						|	КодыПоставщиков.Владелец = &Контрагент
						|	И (КодыПоставщиков.Организация = &ТекОрганизация
						|			ИЛИ КодыПоставщиков.Организация = &Контр2)
						|	И КодыПоставщиков.Наименование = &ТекНаим";
						Запрос.УстановитьПараметр("Контрагент",Контрагент);		
						Запрос.УстановитьПараметр("Контр2",Справочники.Контрагенты.ПустаяСсылка());		
						Запрос.УстановитьПараметр("ТекОрганизация",Организация);
						Запрос.УстановитьПараметр("ТекНаим",КодПоставщикаКонтрагента);
						Результат=Запрос.Выполнить().Выбрать();
						Если Результат.Следующий() Тогда
							КодПоставщикаКонтрагента=Результат.ссылка;
						КонецЕсли;
					КонецЕсли;	
					
				КонецЕсли;	
				//нечаева 13,08,19---
				
				
				
				
				
				
				Если КодПоставщикаконтрагента.пустая() ИЛИ кодПоставщикаКонтрагента=Неопределено Тогда
					// Берем первую из справочника коды контрагентов
					Запрос=Новый Запрос;
					Запрос.Текст="ВЫБРАТЬ
					|	КодыПоставщиков.Ссылка
					|ИЗ
					|	Справочник.КодыПоставщиков КАК КодыПоставщиков
					|ГДЕ
					|	КодыПоставщиков.Владелец = &Контрагент
					|	И (КодыПоставщиков.Организация = &ТекОрганизация
					|			ИЛИ КодыПоставщиков.Организация = &Контр2)";
					Запрос.УстановитьПараметр("Контрагент",Контрагент);		
					Запрос.УстановитьПараметр("Контр2",Справочники.Контрагенты.ПустаяСсылка());		
					Запрос.УстановитьПараметр("ТекОрганизация",Организация);		
					Результат=Запрос.Выполнить().Выбрать();
					// катаев+ 28/02/13 Исправление ошибки
					//Пока Результат.Следующий() Цикл
					//	КодПоставщикаКонтрагента=Результат.ссылка;
					//	возврат;
					//КонецЦикла;
					Если Результат.Следующий() Тогда
						КодПоставщикаКонтрагента=Результат.ссылка;
					КонецЕсли;
					// Катаев- 28/02/13
					//Катаев+ 16/07/14
					//// если ашан то :
					//Если контрагент=Справочники.Контрагенты.НайтиПоКоду("SSP-2450") ТОгда
					//	Если Склад=Справочники.Склады.НайтиПоКоду("STA-61") тОгда
					//		КодПоставщикаКонтрагента=Справочники.КодыПоставщиков.НайтиПоКоду("SSP-000003");
					//	Иначе
					//		КодПоставщикаКонтрагента=Справочники.КодыПоставщиков.НайтиПоКоду("SSP-000002");
					//	КонецЕсли;
					//КонецЕсли;
					//Катаев- 16/07/14
				КонецЕсли;
			КонецЕсли;
			
			//----------------------------------------------
			//доставка
			Если не ПунктДоставки=Неопределено  Тогда 
				Если ЗначениеЗаполнено(ПунктДоставки.РайонДоставки) Тогда
					РайонДоставки=ПунктДоставки.РайонДоставки;	
					ДокОбъект.РайонДоставки=РайонДоставки;
				КонецЕсли;	
				Если ЗначениеЗаполнено(ПунктДоставки.Регион) Тогда
					Регион=ПунктДоставки.Регион;
					ДокОбъект.Регион=Регион;
				КонецЕсли;	
				//Катаев+ 10/04/14 Транспортная компания заполняется только если выбран тип доставки = "ТранспортнаяКомпания"
				//Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
				//	ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
				//	ДокОбъект.ТранспортнаяКомпания=ТранспортнаяКомпания;
				//КонецЕсли;	
				//Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
				//	ПунктПерегруза=ПунктДоставки.ПунктПерегруза;	
				//	ДокОбъект.ПунктПерегруза=ПунктПерегруза;
				//КонецЕсли;		
				Если ПунктДоставки.ТипДоставки = Перечисления.ТипыДоставки.ТранспортнаяКомпания Тогда
					Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
						ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
						ДокОбъект.ТранспортнаяКомпания=ТранспортнаяКомпания;
					КонецЕсли;
					Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
						ПунктПерегруза=ПунктДоставки.ПунктПерегруза;	
						ДокОбъект.ПунктПерегруза=ПунктПерегруза;
					КонецЕсли;		
				КонецЕсли;
				//Катаев- 10/04/14
				Если ЗначениеЗаполнено(ПунктДоставки.Грузополучатель) Тогда
					Грузополучатель=ПунктДоставки.Грузополучатель;		
					ДокОбъект.Грузополучатель=Грузополучатель;
				КонецЕсли;
				Если ЗначениеЗаполнено(ПунктДоставки.Получатель) Тогда
					Получатель=ПунктДоставки.Получатель;		
					ДокОбъект.Получатель=Получатель;
				КонецЕсли;
				Если ЗначениеЗаполнено(ПунктДоставки.ОтсрочкаПлатежа) Тогда
					ОтсрочкаПлатежа=ПунктДоставки.ОтсрочкаПлатежа;		
					ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;
				КонецЕсли;
				
				//типы цен скидки
				Если ЗначениеЗаполнено(ПунктДоставки.ТипЦен) И ТипЦен<>ПунктДоставки.ТипЦен Тогда
					ТипЦен=ПунктДоставки.ТипЦен;		
				КонецЕсли; 
				Если ЗначениеЗаполнено(ПунктДоставки.ТипСкидок) И ДокОбъект.ТипСкидок<>ПунктДоставки.ТипСкидок Тогда
					ТипСкидок=ПунктДоставки.ТипСкидок;		
				КонецЕсли;
				Если ПунктДоставки.Скидка<>0 И ПунктДоставки.Скидка<>ДокОбъект.Скидка Тогда
					Скидка=ПунктДоставки.Скидка;		
					ДокОбъект.Скидка=Скидка;
				КонецЕсли;
			КонецЕсли;
			//-------------------------------------------------------------------		
			
			ДокОбъект.Дата=ТекущаяДата();
			ЗаполнитьШапкуДокумента(ДокОбъект, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
			//УстановитьНомерДокумента2(ДокОбъект);
			ДокОбъект.Контрагент=Контрагент;
			ДокОбъект.Организация=Организация;
			ДокОбъект.Договор=Договор;
			ДокОбъект.ИБ=Справочники.ИБ.НайтиПоКоду("SSP");
			ДокОбъект.Менеджер= Менеджер;
			ДокОбъект.НомерЗаказа= УбратьНули(НомерЗаказа,Контрагент.УбиратьНулиПередНомеромЗаказа);
			
			Попытка
				ДокОбъект.ДатаЗаказа=Дата(СтрЗаменить(ДатаЗаказа, "-", ""));
				ДокОбъект.ДатаОтгрузки=Дата(СтрЗаменить(ДатаДоставки, "-", ""));
			Исключение
			КонецПопытки;
			
			
			ДокОбъект.КодПоставщика=КодПоставщикаКонтрагента;
			
			ДокОбъект.Регион = Регион;
			ТипШК=перечисления.ТипыШтрихКодов.Штука;
			
			ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;		
			ДокОбъект.ТипЦен=ТипЦен; //Контрагент.ТипЦен;
			ДокОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН;
			ДокОбъект.Подразделение = Подразделение;
			ДокОбъект.ЛевыйКонтрагент=Контрагент;
			ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
			ДокОбъект.Отгружен=перечисления.Отгружен.Резерв;
			ДокОбъект.ПунктДоставки=ПунктДоставки;
			ДокОбъект.Склад=Склад;		
			//УстановитьНомерДокумента2(ДокОбъект);
			УстановитьНомерДокументаКлиентСервер(ДокОбъект);
			
			ДокОбъект.Валюта=Справочники.Валюты.НайтиПоКоду("810");
			ДокОбъект.Автор	=Неопределено;
			
			Если СокрЛП(Контрагент.Код)=КодМетро И (Лев(ДокОбъект.Номер,3)<>"SSP" или Лев(ДокОбъект.Номер,3)<>"SST") Тогда
				//УстановитьНомерДокумента2(ДокОбъект);	
				УстановитьНомерДокументаКлиентСервер(ДокОбъект);
				
			КонецЕсли;
			
			ДокОбъект.КодОперации=Перечисления.КодыОперацийОстатки.Реализация;
			ДокОбъект.ДатаОформления	=ДокОбъект.Дата;
			
			
			//----------------------------------------------------------------------------------------
			//****** факт адрес и код поставщика *****************
			//----------------------------------------------------------------------------------------
			Если ПунктДоставки=Справочники.ПунктыДоставки.НайтиПоКоду("SNL-000806") И (НомПриз=2 Или номПРиз=3) Тогда 
				// игры и регионы - факт адрес
				ДокОбъект.ТранспортнаяКомпания=Справочники.Контрагенты.НайтиПоКоду("SSP-6719");
				ДокОбъект.ПунктПерегруза=справочники.ПунктыДоставки.НайтиПоКоду("SNL-003951");
				ДокОбъект.КодПоставщика=справочники.КодыПоставщиков.НайтиПоКоду("SSP-000002");
				//ДокОбъект.КодПоставщика=1958;
				//Иначе
				//	ДокОбъект.ТранспортнаяКомпания=Справочники.Контрагенты.НайтиПоКоду("SSP-6719");
				//	ДокОбъект.ПунктПерегруза=справочники.ПунктыДоставки.НайтиПоКоду("SNL-003952");
				//	ДокОбъект.КодПоставщика=справочники.КодыПоставщиков.НайтиПоКоду("SSP-000003");  //4661;
			КонецЕсли; 
			Если   Склад=Справочники.Склады.НайтиПоКоду("SNL-000806") И (НомПриз=5)  Тогда 
				// игры и регионы - факт адрес
				ДокОбъект.ТранспортнаяКомпания=Справочники.Контрагенты.НайтиПоКоду("SSP-6719");
				ДокОбъект.ПунктПерегруза=справочники.ПунктыДоставки.НайтиПоКоду("SNL-003951");
				ДокОбъект.КодПоставщика=справочники.КодыПоставщиков.НайтиПоКоду("SSP-000002");
				//ДокОбъект.КодПоставщика=1958;
			КонецЕсли;
			//--------------------------------------------------------------------------------------------
			
			//Валетов + 30.06.2026 Изменение 0000000060
			//ДокОбъект.ДатаОплаты	    =ПолучитьДатуОплаты1(ДокОбъект.ДатаОтгрузки,ДокОбъект.ОтсрочкаПлатежа);	
			ПараметрыРасчетаДатыОплаты  = ОбщегоНазначенияКС.ПолучитьЗаполнитьПараметрыРасчетаДатыОплатыПоДокументу(ДокОбъект);
			ДокОбъект.ДатаОплаты 		= ОбщегоНазначенияКС.ПолучитьДатуОплатыПоДокументуКлиентСервер(ПараметрыРасчетаДатыОплаты); 
			//Валетов-
			
			СкидкаКонтрагента=ПолучитьРеквизитРодителя(Контрагент,"Скидка");
			ДокОбъект.Скидка=СкидкаКонтрагента;
			// нечаева 23,09,22++
			попытка
				ДопСкидка = КодПоставщикаКонтрагента.скидка;
				Если ДопСкидка<>0 ТОгда
					ДокОбъект.скидка = допскидка;	
					докобъект.ДопСкидкаНаНакладную = истина;
					
				конецесли;
				
			исключение
			конецПопытки;	
			// нечаева 23,09,22--
			
			ПересчетТЧ(ДокОбъект,"Товары",ДокОбъект.Валюта,ДокОбъект.Валюта,ДокОбъект.Курс,ДокОбъект.Курс,Истина);	
			
			
			//проверим на пустые цены!!
			//нечаева 15,03,16+++
			
			ОтборНулевыеЦены=новый Структура("Цена",0);
			МассивНулевыхЦен=ДокОбъект.Товары.НайтиСтроки(ОтборНулевыеЦены);
			
			
			Для каждого текстрока из МассивНулевыхЦен цикл
				
				Отбор2=новый Структура("номенклатура",ТекСтрока.номенклатура);
				тстрока=ДокОбъект.Товары.НайтиСтроки(Отбор2);
				Ошибки.Добавить("Для товара -  "+ТекСтрока.номенклатура +" Цена =0, не записано в заказе, проверьте матрицу! " );
				ТекНом =тстрока[0].НомерСтроки; //.удалить()
				докобъект.товары.Удалить(ТекНом-1);
				
			КонецЦикла;
			//нечаева 15,03,16---
			
			
			
			
			//*************************************************************
			// если код поставщика = 1958, то не грузим в базу этот документ.
			Если докОбъект.КодПоставщика=справочники.КодыПоставщиков.НайтиПоКоду("SSP-000002") тогда
				Файлы.Добавить("Для кода поставщика=1958  - документ не создан. ");
				продолжить;
			КонецЕсли;	
			
			
			Попытка
				ДокОбъект.Записать(режимЗаписиДокумента.Запись);
				Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
				
				
				
				//Нечаева 25,10,17++
				
				попытка
					
					НаборЗаписей = РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Документ.Установить(ДокОбъект.Ссылка); 
					НаборЗаписей.Отбор.ИмяРеквизита.Установить("GLN"); 
					НаборЗаписей.Очистить();;
					НаборЗаписей.Записать();
					
				исключение
				конецПопытки;
				
				рег = регистрыСведений.РеквизитыРНКПНКПРМ;
				Элемент = Рег.СоздатьМенеджерЗаписи();
				Элемент.Документ = ДокОбъект.ссылка;
				Элемент.ИмяРеквизита = "GLN";
				Элемент.ЗначениеРеквизита = СтрШапка.ИЛНМестаДоставки;
				Элемент.Записать();
				
				//нечаева 02,11,17+++
				Попытка
					НаборЗаписей = РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Документ.Установить(ДокОбъект.Ссылка); 
					НаборЗаписей.Отбор.ИмяРеквизита.Установить("GLNпокупателя"); 
					НаборЗаписей.Очистить();;
					НаборЗаписей.Записать();
				Исключение
				КонецПопытки;
				
				
				Попытка
					рег = регистрыСведений.РеквизитыРНКПНКПРМ;
					Элемент = Рег.СоздатьМенеджерЗаписи();
					Элемент.Документ = ДокОбъект.ссылка;
					Элемент.ИмяРеквизита = "GLNпокупателя";
					Элемент.ЗначениеРеквизита = СтрШапка.ИЛНПокупателя;
					Элемент.Записать();
				Исключение
				КонецПопытки;
				//нечаева 02,11,17---
				
				
				//Нечаева 25,10,17--
				
				
				
				//Сообщить("Записан документ - "+ДокОбъект.Дата+" "+ДокОбъект.Номер);
				// записать номер в "ошибки" для вывода менеджерам
			Исключение
				// Катаев+ 22/08/13 Если возникла ошибка с уникальностью номера, то пробуем обновить нумерацию объектов и сгенерировать номер заново
				Инфо = ИнформацияОбОшибке();
				Если Найти(Инфо.Описание, "Не уникальный номер документа") > 0 Тогда
					ОбновитьНумерациюОбъектов();
					//УстановитьНомерДокумента2(ЭтотОбъект);     //  УстановитьНомерДокумента2
					УстановитьНомерДокументаКлиентСервер(ЭтотОбъект);
					
					Попытка
						ДокОбъект.Записать(режимЗаписиДокумента.Запись);
						Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
						
						
						
						//Нечаева 25,10,17++
						
						попытка
							
							НаборЗаписей = РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();
							НаборЗаписей.Отбор.Документ.Установить(ДокОбъект.Ссылка); 
							НаборЗаписей.Отбор.ИмяРеквизита.Установить("GLN"); 
							НаборЗаписей.Очистить();;
							НаборЗаписей.Записать();
							
						исключение
						конецПопытки;
						
						рег = регистрыСведений.РеквизитыРНКПНКПРМ;
						Элемент = Рег.СоздатьМенеджерЗаписи();
						Элемент.Документ = ДокОбъект.ссылка;
						Элемент.ИмяРеквизита = "GLN";
						Элемент.ЗначениеРеквизита = СтрШапка.ИЛНПМестаДоставки;
						Элемент.Записать();
						
						
						//нечаева 02,11,17+++
						Попытка
							НаборЗаписей = РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();
							НаборЗаписей.Отбор.Документ.Установить(ДокОбъект.Ссылка); 
							НаборЗаписей.Отбор.ИмяРеквизита.Установить("GLNпокупателя"); 
							НаборЗаписей.Очистить();;
							НаборЗаписей.Записать();
						Исключение
						КонецПопытки;
						
						Попытка
							рег = регистрыСведений.РеквизитыРНКПНКПРМ;
							Элемент = Рег.СоздатьМенеджерЗаписи();
							Элемент.Документ = ДокОбъект.ссылка;
							Элемент.ИмяРеквизита = "GLNпокупателя";
							Элемент.ЗначениеРеквизита = СтрШапка.ИЛНПокупателя;
							Элемент.Записать();
						Исключение
						КонецПопытки;
						//нечаева 02,11,17---
						
						//Нечаева 25,10,17--
						
						
						
					Исключение
						Если ПризКр=0 тогда
							КритичОшибки.Добавить("После обновления нумерации для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
							//Катаев+ 11/12/14
							Отказ = Истина;
							//Катаев- 11/12/14
						конецЕсли;
					КонецПопытки;
				Иначе	
					Если ПризКр=0 тогда
						КритичОшибки.Добавить("Для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
						//Катаев+ 11/12/14
						Отказ = Истина;
						//Катаев- 11/12/14
					конецЕсли;
				КонецЕсли;
				// Катаев- 22/08/13
				//Сообщить(ОписаниеОшибки());
			КонецПопытки;
			//сообщить("    документ записан");
			ПризКр=ПризКр+1;
			
			
		КонецЦикла;
	КонецЦикла;
	// конец заполнения документа
	
КонецПроцедуры

// для ГиперГлобуса
Процедура ОбработкаДанныхЗагрузкиГлобус(Шапка,Строки)
	
	СтрШапка=Шапка.Получить(0);
	ТипЦен=Справочники.ТипыЦен.ПустаяСсылка();
	ТипСкидки=Справочники.ТипыСкидок.ПустаяСсылка();
	Организация=Неопределено;
	Менеджер=Неопределено;
	Регион=Неопределено;
	Договор=Неопределено;
	Подразделение=Неопределено;
	ОтсрочкаПлатежа=Неопределено;
	КодПоставщикаКонтрагента=Неопределено;
	ПунктДоставки=Неопределено;
	НомерЗаказа=Неопределено;
	ТипILNКонтрагента=Неопределено;
	ДатаЗаказа=Неопределено;
	ДатаОтгрузки=Неопределено;
	Склад=Неопределено;   //Справочники.Склады.НайтиПоКоду("STA-61");
	Контрагент=СтрШапка.Контрагент;
	Если Контрагент=Неопределено тогда
		Контрагент=Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;	
	ПунктДоставки=СтрШапка.ПунктДоставки;
	НомЗаказа=СтрШапка.НомЗаказа;
	НомерЗаказа=СтрШапка.НомЗаказа;
	ДатаЗаказа=СтрШапка.ДатаЗаказа;
	ДатаДоставки=СтрШапка.ДатаДоставки;
	ТипILNКонтрагента=СтрШапка.ТипILNКонтрагента;
	
	
	//-----------------------------------------------------
	// проверим есть ли за сегодня такой же заказ с тем же пунктом доставки в резерве.
	// если есть не загружать.
	НомерЗаказа= УбратьНули(НомЗаказа,Контрагент.УбиратьНулиПередНомеромЗаказа);
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РасходнаяНакладная.Ссылка
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.Контрагент = &ТекКонрт
	|	И РасходнаяНакладная.ПунктДоставки = &ТекПД
	|	И РасходнаяНакладная.ДатаОтгрузки = &ДатаОтг
	|	И РасходнаяНакладная.НомерЗаказа = &НомЗаказа";
	Запрос.УстановитьПараметр("ТекКонрт",Контрагент);			   
	Запрос.УстановитьПараметр("ТекПД",ПунктДоставки);			   
	Запрос.УстановитьПараметр("ДатаОтг",Дата(СтрЗаменить(ДатаДоставки, "-", "")));			   
	Запрос.УстановитьПараметр("НомЗаказа",НомерЗаказа);			   
	
	
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество()>0 Тогда
		// это повтор
		// те файлы удаляем , они выше в пред процедуре удаляются.
		возврат;
	КонецЕсли;
	
	//-----------------------------------------------------
	
	
	ПризКр=0;
	//сообщить("    запись документа");
	Если не Контрагент.Пустая() Тогда 	
		// 1. Обрабатываем количество, делаем округление  соответствуещее коли-ву в блочке
		Если Контрагент.ОткруглятьКоличество Тогда
			
			Для каждого ТекСтрока Из Строки Цикл
				ПризКратности=1;
				Ном=ТекСтрока.Номенклатура;
				КолЗаказано=ТекСтрока.Колво;
				
				Если НЕ ТипЗнч(Ном) = Тип("СправочникСсылка.Номенклатура") Тогда
					ТекСтрока.КолвоОтредактированное=КолЗаказано;
					продолжить;
				КонецЕсли;
				
				ШтукВКор=Ном.Родитель.ШтукВКоробочке;
				Если ШтукВКор-0>0 Тогда 
					// проверяем на кратность 5 или 6
					Если (ШтукВКор/5)=Цел((ШтукВКор/5)) Тогда
						ПризКратности=5
					ИначеЕсли (ШтукВКор/6)=Цел((ШтукВКор/6)) Тогда
						ПризКратности=6
					Иначе
						ПризКратности=1;
					КонецЕсли;
					
					Если (КолЗаказано/ПризКратности)<>Цел((КолЗаказано/ПризКратности)) Тогда
						КолУпак=Цел(Окр(КолЗаказано/ПризКратности,0,0));
						НовКолво=КолУпак*ПризКратности;
						ТекСтрока.КолвоОтредактированное=НовКолво;
					Иначе
						ТекСтрока.КолвоОтредактированное=КолЗаказано;
					Конецесли;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для каждого ТекСтрока Из Строки Цикл
				КолЗаказано=ТекСтрока.Колво;
				ТекСтрока.КолвоОтредактированное=КолЗаказано;			
			КонецЦикла;
			
		КонецЕсли;
		
		// 2. проверяем дублированный заказ есть или нет. в пределах недели;
		Если Контрагент.ПроверятьНаличиеЗаказа Тогда
			
			Дата1=ТекущаяДата();
			Дата2=ТекущаяДата() - 60 * 60 * 24 * 7; // неделя назад;
			
			Запрос=новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	РасходнаяНакладная.Номер,
			|	РасходнаяНакладная.Дата,
			|	РасходнаяНакладная.Ссылка
			|ИЗ
			|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
			|ГДЕ
			|	РасходнаяНакладная.Контрагент = &Контрагент
			|	И РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
			|	И РасходнаяНакладная.Дата МЕЖДУ НачалоПериода(&Дата2) И КонецПериода(&Дата1)";
			
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("ПунктДоставки",ПунктДоставки);
			Запрос.УстановитьПараметр("Дата1",Дата1);
			Запрос.УстановитьПараметр("Дата2",Дата2);
			
			Рез=Запрос.Выполнить().Выбрать();
			
			// добавляем в сообщения менеджерам
			Пока Рез.Следующий() Цикл
				Строка="Для заказа ЕКОДЕ № "+НомЗаказа+" существует копия заказа РНК №"+Рез.Номер+" от "+Рез.Дата;
				Ошибки.Добавить(Строка);
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	//-------------------------------------------------------------------------------------------------------------------------------------------
	//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
	// когда складов несколько и есть данные, которые нашлись
	//-------------------------------------------------------------------------------------------------------------------------------------------
	
	// загрузка ТЗ в запрос
	//--------------------------------------------
	ТЗСклады=Строки;
	
	// создается для временной таблицы
	ТЗ  = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТЗ.Колонки.Добавить("Найдена", Новый ОписаниеТипов("Число"));
	
	Запрос = Новый Запрос;
	ДанныеСкладов=Неопределено;
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст  = "ВЫБРАТЬ различные
	|    ТЗ.Склад как Склад,
	|    ТЗ.Найдена
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|    &ТЗ КАК ТЗ";
	
	Запрос.УстановитьПараметр("ТЗ", ТзСклады);
	Запрос.Выполнить();
	
	Запрос.Текст="ВЫБРАТЬ
	|	ТЗ.Склад КАК Склад,
	|	ТЗ.Найдена
	|ИЗ
	|	ТЗ КАК ТЗ
	|ГДЕ
	|	ТЗ.Найдена = 1";
	РезультатСклады=Запрос.Выполнить().Выбрать();
	
	Если РезультатСклады.Количество()=0 Тогда
		// пустой документ! не формируем ?
		Склад=Справочники.Склады.НайтиПоКоду("STA-61");
		// Катаев+ 21/03/13 Создавать новый документ надо только для оригинала
		//ДокОбъект=Документы.РасходнаяНакладная.СоздатьДокумент();
		//ДокОбъект = ПолучитьНакладную(Склад, Шапка.НомЗаказа, Шапка.ДатаЗаказа, Шапка.ТипЗаказа);
		ДокОбъект = ПолучитьНакладную(Склад, Шапка[0].НомЗаказа, Шапка[0].ДатаЗаказа, Шапка[0].ТипЗаказа);
		Если ДокОбъект = Неопределено Тогда
			Возврат;
		КонецЕсли;
		// Катаев- 21/03/13
		//-----------------------------------------------------------------------------------------
		//    автозаполнение параметров шапки документа, разница в шапке - в складе отгрузки
		//-----------------------------------------------------------------------------------------
		Если не Контрагент.Пустая() Тогда 	
			//------------------------------------------
			Организация=Справочники.Организации.НайтиПоКоду("SSP-12"); //КБ- Стиль
			ТипЦен=Контрагент.ТипЦен;
			Договор=Контрагент.ОсновнойДоговор;
			Если не (Договор=Неопределено) и не (Договор=справочники.Договоры.ПустаяСсылка()) Тогда
				//ТипЦен		=Договор.ТипЦен;
				ОтсрочкаПлатежа =Договор.ОтсрочкаПлатежа;
				Если ЗначениеЗаполнено(Договор.Организация) Тогда
					Организация=Договор.Организация;		
				КонецЕсли;
			КонецЕсли;
			//----  доп. обработка;
			
			
			ДокОбъект.ДопОбработки.Очистить();
			Для Каждого СтрокаТЧ Из Контрагент.ВидыДопОбработок Цикл
				СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
			КонецЦикла;  
			//нечаева 23,03,17+++
			// добавляем из пункта доставки доп. обработки.
			попытка
				Для Каждого СтрокаТЧ Из ПунктДоставки.ВидыДопОбработок Цикл
					СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
				КонецЦикла;  
			исключение
			конецПопытки;
			//нечаева 23,03,17---
			
			//-----------------------------------------------
			Менеджер=Контрагент.Менеджер;
			Если Менеджер=Неопределено или Менеджер=Справочники.ФизическиеЛица.ПустаяСсылка() и ПризКр=0 Тогда
				КритичОшибки.Добавить("Для контрагента "+контрагент.наименование+"  код - "+контрагент.код+"  не определен менеджер! Заказ екоде №"+ Номерзаказа );
			Иначе
				Если Не СтрДлина(Менеджер.Емэйл)>2  и ПризКр=0   Тогда
					КритичОшибки.Добавить("Для менеджера "+Менеджер.наименование+"  код - "+Менеджер.код+"  не определен ЕМэйл!" );
				КонецЕсли;
			КонецЕсли;
			
			//Катаев+ 06/08/14 Из ЕКОД все контрагенты грузятся с использованием номенклатурной матрицы. Проверку убрал
			//Если Контрагент.ТипЦен=Справочники.ТипыЦен.ПустаяСсылка() и ПризКр=0 и Контрагент.код<>"SSP-3674" Тогда
			//	//Катаев+ 17/10/13 Проверяем есть ли тип цены по пункту доставки
			//	//КритичОшибки.Добавить("Для контрагента "+Контрагент.Наименование+" не установлен тип цен по умолчанию!");
			//	Если ПунктДоставки = Неопределено Тогда
			//		КритичОшибки.Добавить("Для контрагента "+Контрагент.Наименование+" не установлен тип цен по умолчанию!");
			//	Иначе
			//		Если Не ЗначениеЗаполнено(ПунктДоставки.ТипЦен) Тогда
			//			КритичОшибки.Добавить("Для контрагента "+Контрагент.Наименование+" не установлен тип цен по умолчанию!");
			//		КонецЕсли;
			//	КонецЕсли;
			//	//Катаев- 17/10/13
			//КонецЕсли;
			//Катаев- 06/08/14
			Подразделение = Контрагент.Менеджер.Подразделение;
			
			//------------------------
			// код поставщика
			//------------------------
			КодПоставщикаКонтрагента=Контрагент.КодПоставщика;
			Если КодПоставщикаконтрагента.пустая() ИЛИ кодПоставщикаКонтрагента=Неопределено Тогда
				// Берем первую из справочника коды контрагентов
				Запрос=Новый Запрос;
				Запрос.Текст="ВЫБРАТЬ
				|	КодыПоставщиков.Ссылка
				|ИЗ
				|	Справочник.КодыПоставщиков КАК КодыПоставщиков
				|ГДЕ
				|	КодыПоставщиков.Владелец = &Контрагент
				|	И (КодыПоставщиков.Организация = &ТекОрганизация
				|			ИЛИ КодыПоставщиков.Организация = &Контр2)";
				Запрос.УстановитьПараметр("Контрагент",Контрагент);		
				Запрос.УстановитьПараметр("Контр2",Справочники.Контрагенты.ПустаяСсылка());		
				Запрос.УстановитьПараметр("ТекОрганизация",Организация);		
				Результат=Запрос.Выполнить().Выбрать();
				// катаев+ 28/02/13 Исправление ошибки
				//Пока Результат.Следующий() Цикл
				//	КодПоставщикаКонтрагента=Результат.ссылка;
				//	возврат;
				//КонецЦикла;
				Если Результат.Следующий() Тогда
					КодПоставщикаКонтрагента=Результат.ссылка;
				КонецЕсли;
				// Катаев- 28/02/13
				//Катаев+ 16/07/14
				// если ашан то :
				//Если контрагент=Справочники.Контрагенты.НайтиПоКоду("SSP-2450") ТОгда
				//	Если Склад=Справочники.Склады.НайтиПоКоду("STA-61") тОгда
				//		КодПоставщикаКонтрагента=Справочники.КодыПоставщиков.НайтиПоКоду("SSP-000003");
				//	Иначе
				//		КодПоставщикаКонтрагента=Справочники.КодыПоставщиков.НайтиПоКоду("SSP-000002");
				//	КонецЕсли;
				//КонецЕсли;
				//Катаев- 16/07/14
				
			КонецЕсли;
			
		КонецЕсли;
		
		//----------------------------------------------
		//доставка
		Если не ПунктДоставки=Неопределено  Тогда 
			Если ЗначениеЗаполнено(ПунктДоставки.РайонДоставки) Тогда
				РайонДоставки=ПунктДоставки.РайонДоставки;	
				ДокОбъект.РайонДоставки=РайонДоставки;
			КонецЕсли;	
			Если ЗначениеЗаполнено(ПунктДоставки.Регион) Тогда
				Регион=ПунктДоставки.Регион;
				ДокОбъект.Регион=Регион;
			КонецЕсли;	
			//Катаев+ 10/04/14 Транспортная компания заполняется только если выбран тип доставки = "ТранспортнаяКомпания"
			//Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
			//	ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
			//	ДокОбъект.ТранспортнаяКомпания=ТранспортнаяКомпания;
			//КонецЕсли;	
			//Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
			//	ПунктПерегруза=ПунктДоставки.ПунктПерегруза;	
			//	ДокОбъект.ПунктПерегруза=ПунктПерегруза;
			//КонецЕсли;		
			Если ПунктДоставки.ТипДоставки = Перечисления.ТипыДоставки.ТранспортнаяКомпания Тогда
				Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
					ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
					ДокОбъект.ТранспортнаяКомпания=ТранспортнаяКомпания;
				КонецЕсли;
				Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
					ПунктПерегруза=ПунктДоставки.ПунктПерегруза;	
					ДокОбъект.ПунктПерегруза=ПунктПерегруза;
				КонецЕсли;		
			КонецЕсли;
			//Катаев- 10/04/14
			Если ЗначениеЗаполнено(ПунктДоставки.Грузополучатель) Тогда
				Грузополучатель=ПунктДоставки.Грузополучатель;		
				ДокОбъект.Грузополучатель=Грузополучатель;
			КонецЕсли;
			Если ЗначениеЗаполнено(ПунктДоставки.Получатель) Тогда
				Получатель=ПунктДоставки.Получатель;		
				ДокОбъект.Получатель=Получатель;
			КонецЕсли;
			Если ЗначениеЗаполнено(ПунктДоставки.ОтсрочкаПлатежа) Тогда
				ОтсрочкаПлатежа=ПунктДоставки.ОтсрочкаПлатежа;		
				ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;
			КонецЕсли;
			
			//типы цен скидки
			Если ЗначениеЗаполнено(ПунктДоставки.ТипЦен) И ТипЦен<>ПунктДоставки.ТипЦен Тогда
				ТипЦен=ПунктДоставки.ТипЦен;		
			КонецЕсли; 
			Если ЗначениеЗаполнено(ПунктДоставки.ТипСкидок) И ДокОбъект.ТипСкидок<>ПунктДоставки.ТипСкидок Тогда
				ТипСкидок=ПунктДоставки.ТипСкидок;		
			КонецЕсли;
			Если ПунктДоставки.Скидка<>0 И ПунктДоставки.Скидка<>ДокОбъект.Скидка Тогда
				Скидка=ПунктДоставки.Скидка;		
				ДокОбъект.Скидка=Скидка;
			КонецЕсли;
		КонецЕсли;
		//-------------------------------------------------------------------		
		
		ДокОбъект.Дата=ТекущаяДата();
		ЗаполнитьШапкуДокумента(ДокОбъект, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
		//УстановитьНомерДокументаКлиентСервер(ДокОбъект);
		ДокОбъект.Контрагент=Контрагент;
		ДокОбъект.Организация=Организация;
		ДокОбъект.Договор=Договор;
		ДокОбъект.ИБ=Справочники.ИБ.НайтиПоКоду("SSP");
		ДокОбъект.Менеджер= Менеджер;
		ДокОбъект.НомерЗаказа= УбратьНули(НомЗаказа,Контрагент.УбиратьНулиПередНомеромЗаказа);
		
		Попытка
			ДокОбъект.ДатаЗаказа=Дата(СтрЗаменить(ДатаЗаказа, "-", ""));
			ДокОбъект.ДатаОтгрузки=Дата(СтрЗаменить(ДатаДоставки, "-", ""));
		Исключение
		КонецПопытки;
		
		
		//----  доп. обработка;
		ДокОбъект.ДопОбработки.Очистить();
		Для Каждого СтрокаТЧ Из Контрагент.ВидыДопОбработок Цикл
			СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
			СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
		КонецЦикла; 
		//нечаева 23,03,17+++
		// добавляем из пункта доставки доп. обработки.
		Попытка
			Для Каждого СтрокаТЧ Из ПунктДоставки.ВидыДопОбработок Цикл
				СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
			КонецЦикла;  
		Исключение
		КонецПопытки;
		
		
		
		ДокОбъект.КодПоставщика=КодПоставщикаКонтрагента;
		
		ДокОбъект.Регион = Регион;
		ТипШК=перечисления.ТипыШтрихКодов.Штука;
		
		ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;		
		ДокОбъект.ТипЦен=ТипЦен; //Контрагент.ТипЦен;
		ДокОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН;
		ДокОбъект.Подразделение = Подразделение;
		ДокОбъект.ЛевыйКонтрагент=Контрагент;
		ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
		ДокОбъект.Отгружен=перечисления.Отгружен.Резерв;
		ДокОбъект.ПунктДоставки=ПунктДоставки;
		ДокОбъект.Склад=Склад;		
		УстановитьНомерДокументаКлиентСервер(ДокОбъект);
		ДокОбъект.Валюта=Справочники.Валюты.НайтиПоКоду("810");
		//ДокОбъект.Автор				=Неопределено;
		
		//Валетов + 30.06.2026 Изменение 0000000060
		//ДокОбъект.ДатаОплаты	    =ПолучитьДатуОплаты1(ДокОбъект.ДатаОтгрузки,ДокОбъект.ОтсрочкаПлатежа);	
		ПараметрыРасчетаДатыОплаты  = ОбщегоНазначенияКС.ПолучитьЗаполнитьПараметрыРасчетаДатыОплатыПоДокументу(ДокОбъект);
		ДокОбъект.ДатаОплаты 		= ОбщегоНазначенияКС.ПолучитьДатуОплатыПоДокументуКлиентСервер(ПараметрыРасчетаДатыОплаты); 
		//Валетов-	
		
		Если СокрЛП(Контрагент.Код)=КодМетро И (Лев(ДокОбъект.Номер,3)<>"SSP" или Лев(ДокОбъект.Номер,3)<>"SST") Тогда
			УстановитьНомерДокументаКлиентСервер(ДокОбъект);	
		КонецЕсли;
		
		ДокОбъект.КодОперации=Перечисления.КодыОперацийОстатки.Реализация;
		ДокОбъект.ДатаОформления	=ДокОбъект.Дата;
		СкидкаКонтрагента=ПолучитьРеквизитРодителя(Контрагент,"Скидка");
		ДокОбъект.Скидка=СкидкаКонтрагента;
		
		
		ПересчетТЧ(ДокОбъект,"Товары",ДокОбъект.Валюта,ДокОбъект.Валюта,ДокОбъект.Курс,ДокОбъект.Курс,Истина);	
		
		Попытка
			ДокОбъект.Записать(режимЗаписиДокумента.Запись);
			Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
			//Сообщить("Записан документ - "+ДокОбъект.Дата+" "+ДокОбъект.Номер);
			// записать номер в "ошибки" для вывода менеджерам
		Исключение
			// Катаев+ 22/08/13 Если возникла ошибка с уникальностью номера, то пробуем обновить нумерацию объектов и сгенерировать номер заново
			Инфо = ИнформацияОбОшибке();
			Если Найти(Инфо.Описание, "Не уникальный номер документа") > 0 Тогда
				ОбновитьНумерациюОбъектов();
				УстановитьНомерДокументаКлиентСервер(ЭтотОбъект);
				Попытка
					ДокОбъект.Записать(режимЗаписиДокумента.Запись);
					Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
				Исключение
					Если ПризКр=0 тогда
						КритичОшибки.Добавить("После обновления нумерации для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
					конецЕсли;
				КонецПопытки;
			Иначе	
				Если ПризКр=0 тогда
					КритичОшибки.Добавить("Для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
				конецЕсли;
			КонецЕсли;
			// Катаев- 22/08/13
			//Сообщить(ОписаниеОшибки());
		КонецПопытки;
		//сообщить("    документ записан");
		ПризКр=ПризКр+1;
		
	КонецЕсли;
	
	//---------------------------------------------------------------------------------
	//                          по циклу смотрим данные
	//-------------------------------------------------------------------------------------
	Пока РезультатСклады.Следующий() цикл
		
		Склад=РезультатСклады.Склад;
		// формируем документ по складу
		//---------------------------------------------------	
		// выбираем строки номенклатуры по складу, заполняем строки
		ТЗ2  = Новый ТаблицаЗначений;
		ТЗ2.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
		ТЗ2.Колонки.Добавить("Найдена", Новый ОписаниеТипов("Число"));
		ТЗ2.Колонки.Добавить("КолвоОтредактированное",Новый ОписаниеТипов("Число"));
		ТЗ2.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТЗ2.Колонки.Добавить("ПризнакГруппыНом",Новый ОписаниеТипов("Число"));
		
		Запрос = Новый Запрос;
		ДанныеСкладов=Неопределено;
		МВТ = Новый МенеджерВременныхТаблиц;
		Запрос.МенеджерВременныхТаблиц = МВТ;
		Запрос.Текст  = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗ2.Склад КАК Склад,
		|	ТЗ2.Номенклатура, 
		|	ТЗ2.КолвоОтредактированное,
		|	ТЗ2.Найдена,
		|	ТЗ2.НомерСтроки,
		|	ТЗ2.ПризнакГруппыНом
		|ПОМЕСТИТЬ ТЗ2
		|ИЗ
		|	&ТЗ2 КАК ТЗ2
		|ГДЕ
		|	ТЗ2.Склад = &ТекСклад
		|	И ТЗ2.Найдена = 1";
		Запрос.УстановитьПараметр("ТекСклад",Склад);
		Запрос.УстановитьПараметр("ТЗ2", ТзСклады);
		Запрос.Выполнить();
		
		Запрос.Текст="ВЫБРАТЬ
		|	ТЗ2.Склад КАК Склад,
		|	ТЗ2.Номенклатура,
		|	ТЗ2.КолвоОтредактированное,
		|	ТЗ2.Найдена,
		|	ТЗ2.НомерСтроки КАК НомерСтроки,
		|	ТЗ2.ПризнакГруппыНом
		|ИЗ
		|	ТЗ2 КАК ТЗ2
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		РезНом=Запрос.Выполнить().Выгрузить();
		
		
		//******************************************************************************************
		//-------------------------------------------------------------------------------------------------
		// обрабатываем на документы по папкам для ашана и гиперглобуса (создаются несколько документов)
		//-------------------------------------------------------------------------------------------------
		// выбиреам 3 типа папок - ашан , 2 типа гипер глобус  // +1 к ним - остальные папки
		// создаем  несколько таб частей и фигачим несколько документов по ним.
		
		
		РезНом1=Новый ТаблицаЗначений;
		РезНом2=Новый ТаблицаЗначений;
		РезНом3=Новый ТаблицаЗначений;
		РезНом4=Новый ТаблицаЗначений;
		РезНом5=Новый ТаблицаЗначений;
		РезНом6=Новый ТаблицаЗначений;
		
		
		// Сформировать структуру отбора. 
		// Найти строки. 
		
		Отбор1 = Новый Структура();
		Отбор1.Вставить("ПризнакГруппыНом", 1); 
		РезНом1 = РезНОм.НайтиСтроки(Отбор1); // колготки
		
		Отбор2 = Новый Структура();
		Отбор2.Вставить("ПризнакГруппыНом", 2); 
		РезНом2 = РезНОм.НайтиСтроки(Отбор2); // белье
		
		Отбор3 = Новый Структура();
		Отбор3.Вставить("ПризнакГруппыНом", 5); 
		РезНом5 = РезНом.НайтиСтроки(Отбор3); // все остальное		
		
		Отбор3 = Новый Структура();
		Отбор3.Вставить("ПризнакГруппыНом", 3); 
		РезНом3 = РезНом.НайтиСтроки(Отбор3);   // носки
		
		//----------------------------------------------
		Для НомПриз=1 По 5 Цикл
			
			Результат=Неопределено;
			
			Если НомПРиз=1 ТОгда
				Если РезНом1.количество()>0  Тогда
					Результат=резном1;
				конецЕсли;
			КонецЕсли;	
			
			Если НомПРиз=2 ТОгда
				Если РезНом2.количество()>0  Тогда
					Результат=резном2;
				конецЕсли;
			КонецЕсли;
			
			Если НомПРиз=3 ТОгда
				Если РезНом3.количество()>0  Тогда
					Результат=резном3;
				конецЕсли;
			КонецЕсли;
			
			Если НомПРиз=5 ТОгда
				Если РезНом5.количество()>0 Тогда
					Результат=резном5;
				конецЕсли;
			КонецЕсли;
			
			Если Результат=Неопределено Тогда
				продолжить;
			КонецЕсли;
			
			//Состояние(""+Контрагент+" "+Склад);
			
			Если НЕ Результат[0].Склад=Склад Тогда
				продолжить;
			КонецЕсли;	
			
			ПризМячи=0;
			
			// Катаев+ 21/03/13 Создавать новый документ надо только для оригинала
			//ДокОбъект=Документы.РасходнаяНакладная.СоздатьДокумент();
			//ДокОбъект = ПолучитьНакладную(Склад, Шапка.НомЗаказа, Шапка.ДатаЗаказа, Шапка.ТипЗаказа);
			ДокОбъект = ПолучитьНакладную(Склад, Шапка[0].НомЗаказа, Шапка[0].ДатаЗаказа, Шапка[0].ТипЗаказа);
			Если ДокОбъект = Неопределено Тогда
				Возврат;
			КонецЕсли;
			// Катаев- 21/03/13
			// ------------------------------------------------------------------------------------------------
			Для Каждого ТекущаяСтрока Из Результат Цикл 
				СтрокаТовара = 	ДокОбъект.Товары.Добавить();
				СтрокаТовара.Номенклатура =ТекущаяСтрока.Номенклатура;
				СтрокаТовара.Заявка = ТекущаяСтрока.КолвоОтредактированное;
				СтрокаТовара.Количество = ТекущаяСтрока.КолвоОтредактированное;
				СтрокаТовара.ПодтвержденнаяЗаявка = ТекущаяСтрока.КолвоОтредактированное;
				
				Если Найти(ТекущаяСтрока.Номенклатура.Наименование,"ячи")>0  Тогда
					
					ПризМячи=1;
					
				КонецЕсли; 
				
				ПриИзмененииНоменклатурыТабЧасти(СтрокаТовара, ДокОбъект);
				РассчитатьСуммуТабЧасти(СтрокаТовара, ДокОбъект);
			КонецЦикла;
			
			//-----------------------------------------------------------------------------------------
			//    автозаполнение параметров шапки документа, разница в шапке - в складе отгрузки
			//-----------------------------------------------------------------------------------------
			
			Если не Контрагент.Пустая() Тогда 	
				//------------------------------------------
				Организация=Справочники.Организации.НайтиПоКоду("SSP-12"); //КБ- Стиль
				ТипЦен=Контрагент.ТипЦен;
				Договор=Контрагент.ОсновнойДоговор;
				Если не (Договор=Неопределено) и не (Договор=справочники.Договоры.ПустаяСсылка()) Тогда
					//ТипЦен		=Договор.ТипЦен;
					ОтсрочкаПлатежа =Договор.ОтсрочкаПлатежа;
					Если ЗначениеЗаполнено(Договор.Организация) Тогда
						Организация=Договор.Организация;		
					КонецЕсли;
				КонецЕсли;
				
				
				//----  доп. обработка; --------------------------------
				
				//ДокОбъект.ДопОбработки.Очистить();
				//Для Каждого СтрокаТЧ Из Контрагент.ВидыДопОбработок Цикл
				//	СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
				//	СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
				//КонецЦикла; 
				Если ПризМячи Тогда
					
					ДокОбъект.ДопОбработки.Очистить();
					СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					// без обработки
					СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.БезОбработки;
					
					
				Иначе
					
					//// если белье
					//Если НомПРиз=4 Тогда
					//	ДокОбъект.ДопОбработки.Очистить();
					//	СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					//	// интри -европакеты
					//	СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("ODB-00018");
					//	
					//	СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					//	// белье на вешалках реал
					//	СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("SNL-00031");
					//	
					//	СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					//	// стикер "инф.пост."
					//	СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("ODN-00005");
					//КонецЕсли; 
					//// если колготки или носки
					//Если НомПРиз=5 или НомПРиз=6 Тогда
					//	ДокОбъект.ДопОбработки.Очистить();
					//							
					//	СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					//	// стикер "инф.пост."
					//	СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("ODN-00005");
					//КонецЕсли; 
					//
					
					//Если Склад=Справочники.Склады.НайтиПоКоду("SNL-79") или Склад=Справочники.Склады.НайтиПоКоду("SNL-22") Тогда
					//нечаева поменяла склад 22,01,15++
					Если Склад=Справочники.Склады.НайтиПоКоду("STA-10") или Склад=Справочники.Склады.НайтиПоКоду("STA-20") Тогда     
						//нечаева поменяла склад 22,01,15++
						
						
						// белье
						
						ДокОбъект.ДопОбработки.Очистить();
						СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
						// интри -европакеты
						СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("ODB-00018");
						
						СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
						// белье на вешалках реал
						СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("SNL-00031");
						
						СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
						// стикер "инф.пост."
						СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("ODN-00005");
						
					Иначе
						
						ДокОбъект.ДопОбработки.Очистить();
						СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
						// стикер "инф.пост."
						СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("ODN-00005");
						
					КонецЕсли; 
					
					//нечаева 23,03,17+++
					// добавляем из пункта доставки доп. обработки.
					Попытка
						Для Каждого СтрокаТЧ Из ПунктДоставки.ВидыДопОбработок Цикл
							СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
							СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
						КонецЦикла;  
					исключение
					КонецПопытки;
					//нечаева 23,03,17---
					
					
				КонецЕсли; 				
				
				
				// нечаева 08,07,22+++ возвращаем стандартную обработку??? для гиперглобуса.
				//----  доп. обработка;
				ДокОбъект.ДопОбработки.Очистить();
				Для Каждого СтрокаТЧ Из Контрагент.ВидыДопОбработок Цикл
					СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
				КонецЦикла; 
				
				// добавляем из пункта доставки доп. обработки.
				Попытка
					Для Каждого СтрокаТЧ Из ПунктДоставки.ВидыДопОбработок Цикл
						СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
						СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
					КонецЦикла;  
				Исключение
				КонецПопытки;
				// нечаева 08,07,22---
				
				//-----------------------------------------------
				
				Менеджер=Контрагент.Менеджер;
				Если Менеджер=Неопределено или Менеджер=Справочники.ФизическиеЛица.ПустаяСсылка() и ПризКр=0 Тогда
					КритичОшибки.Добавить("Для контрагента "+контрагент.наименование+"  код - "+контрагент.код+"  не определен менеджер! Заказ екоде №"+ Номерзаказа );
				Иначе
					Если Не СтрДлина(Менеджер.Емэйл)>2  и ПризКр=0   Тогда
						КритичОшибки.Добавить("Для менеджера "+Менеджер.наименование+"  код - "+Менеджер.код+"  не определен ЕМэйл!" );
					КонецЕсли;
				КонецЕсли;
				
				//Катаев+ 06/08/14 Из ЕКОД все контрагенты грузятся с использованием номенклатурной матрицы. Проверку убрал
				//Если Контрагент.ТипЦен=Справочники.ТипыЦен.ПустаяСсылка() и ПризКр=0 и Контрагент.код<>"SSP-3674" Тогда
				//	//Катаев+ 17/10/13 Проверяем есть ли тип цены по пункту доставки
				//	//КритичОшибки.Добавить("Для контрагента "+Контрагент.Наименование+" не установлен тип цен по умолчанию!");
				//	Если ПунктДоставки = Неопределено Тогда
				//		КритичОшибки.Добавить("Для контрагента "+Контрагент.Наименование+" не установлен тип цен по умолчанию!");
				//	Иначе
				//		Если Не ЗначениеЗаполнено(ПунктДоставки.ТипЦен) Тогда
				//			КритичОшибки.Добавить("Для контрагента "+Контрагент.Наименование+" не установлен тип цен по умолчанию!");
				//		КонецЕсли;
				//	КонецЕсли;
				//	//Катаев- 17/10/13
				//КонецЕсли;
				//Катаев- 06/08/14
				Подразделение = Контрагент.Менеджер.Подразделение;
				
				//------------------------
				// код поставщика
				//------------------------
				КодПоставщикаКонтрагента=Контрагент.КодПоставщика;
				Если КодПоставщикаконтрагента.пустая() ИЛИ кодПоставщикаКонтрагента=Неопределено Тогда
					// Берем первую из справочника коды контрагентов
					Запрос=Новый Запрос;
					Запрос.Текст="ВЫБРАТЬ
					|	КодыПоставщиков.Ссылка
					|ИЗ
					|	Справочник.КодыПоставщиков КАК КодыПоставщиков
					|ГДЕ
					|	КодыПоставщиков.Владелец = &Контрагент
					|	И (КодыПоставщиков.Организация = &ТекОрганизация
					|			ИЛИ КодыПоставщиков.Организация = &Контр2)";
					Запрос.УстановитьПараметр("Контрагент",Контрагент);		
					Запрос.УстановитьПараметр("Контр2",Справочники.Контрагенты.ПустаяСсылка());		
					Запрос.УстановитьПараметр("ТекОрганизация",Организация);		
					Результат=Запрос.Выполнить().Выбрать();
					// катаев+ 28/02/13 Исправление ошибки
					//Пока Результат.Следующий() Цикл
					//	КодПоставщикаКонтрагента=Результат.ссылка;
					//	возврат;
					//КонецЦикла;
					Если Результат.Следующий() Тогда
						КодПоставщикаКонтрагента=Результат.ссылка;
					КонецЕсли;
					// Катаев- 28/02/13
				КонецЕсли;
			КонецЕсли;
			
			//----------------------------------------------
			//доставка
			Если не ПунктДоставки=Неопределено  Тогда 
				Если ЗначениеЗаполнено(ПунктДоставки.РайонДоставки) Тогда
					РайонДоставки=ПунктДоставки.РайонДоставки;	
					ДокОбъект.РайонДоставки=РайонДоставки;
				КонецЕсли;	
				Если ЗначениеЗаполнено(ПунктДоставки.Регион) Тогда
					Регион=ПунктДоставки.Регион;
					ДокОбъект.Регион=Регион;
				КонецЕсли;	
				//Катаев+ 10/04/14 Транспортная компания заполняется только если выбран тип доставки = "ТранспортнаяКомпания"
				//Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
				//	ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
				//	ДокОбъект.ТранспортнаяКомпания=ТранспортнаяКомпания;
				//КонецЕсли;	
				//Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
				//	ПунктПерегруза=ПунктДоставки.ПунктПерегруза;	
				//	ДокОбъект.ПунктПерегруза=ПунктПерегруза;
				//КонецЕсли;		
				Если ПунктДоставки.ТипДоставки = Перечисления.ТипыДоставки.ТранспортнаяКомпания Тогда
					Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
						ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
						ДокОбъект.ТранспортнаяКомпания=ТранспортнаяКомпания;
					КонецЕсли;
					Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
						ПунктПерегруза=ПунктДоставки.ПунктПерегруза;	
						ДокОбъект.ПунктПерегруза=ПунктПерегруза;
					КонецЕсли;		
				КонецЕсли;
				//Катаев- 10/04/14
				Если ЗначениеЗаполнено(ПунктДоставки.Грузополучатель) Тогда
					Грузополучатель=ПунктДоставки.Грузополучатель;		
					ДокОбъект.Грузополучатель=Грузополучатель;
				КонецЕсли;
				Если ЗначениеЗаполнено(ПунктДоставки.Получатель) Тогда
					Получатель=ПунктДоставки.Получатель;		
					ДокОбъект.Получатель=Получатель;
				КонецЕсли;
				Если ЗначениеЗаполнено(ПунктДоставки.ОтсрочкаПлатежа) Тогда
					ОтсрочкаПлатежа=ПунктДоставки.ОтсрочкаПлатежа;		
					ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;
				КонецЕсли;
				
				//типы цен скидки
				Если ЗначениеЗаполнено(ПунктДоставки.ТипЦен) И ТипЦен<>ПунктДоставки.ТипЦен Тогда
					ТипЦен=ПунктДоставки.ТипЦен;		
				КонецЕсли; 
				Если ЗначениеЗаполнено(ПунктДоставки.ТипСкидок) И ДокОбъект.ТипСкидок<>ПунктДоставки.ТипСкидок Тогда
					ТипСкидок=ПунктДоставки.ТипСкидок;		
				КонецЕсли;
				Если ПунктДоставки.Скидка<>0 И ПунктДоставки.Скидка<>ДокОбъект.Скидка Тогда
					Скидка=ПунктДоставки.Скидка;		
					ДокОбъект.Скидка=Скидка;
				КонецЕсли;
			КонецЕсли;
			//-------------------------------------------------------------------		
			
			ДокОбъект.Дата=ТекущаяДата();
			ЗаполнитьШапкуДокумента(ДокОбъект, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
			//УстановитьНомерДокументаКлиентСервер(ДокОбъект);
			ДокОбъект.Контрагент=Контрагент;
			ДокОбъект.Организация=Организация;
			ДокОбъект.Договор=Договор;
			ДокОбъект.ИБ=Справочники.ИБ.НайтиПоКоду("SSP");
			ДокОбъект.Менеджер= Менеджер;
			ДокОбъект.НомерЗаказа= УбратьНули(НомерЗаказа,Контрагент.УбиратьНулиПередНомеромЗаказа);
			
			Попытка
				ДокОбъект.ДатаЗаказа=Дата(СтрЗаменить(ДатаЗаказа, "-", ""));
				ДокОбъект.ДатаОтгрузки=Дата(СтрЗаменить(ДатаДоставки, "-", ""));
			Исключение
			КонецПопытки;
			
			// нечаева 08,07,22+++ возвращаем стандартную обработку??? для гиперглобуса.
			//----  доп. обработка;
			ДокОбъект.ДопОбработки.Очистить();
			Для Каждого СтрокаТЧ Из Контрагент.ВидыДопОбработок Цикл
				СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
			КонецЦикла; 
			
			// добавляем из пункта доставки доп. обработки.
			Попытка
				Для Каждого СтрокаТЧ Из ПунктДоставки.ВидыДопОбработок Цикл
					СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
				КонецЦикла;  
			Исключение
			КонецПопытки;
			// нечаева 08,07,22---
			
			ДокОбъект.КодПоставщика=КодПоставщикаКонтрагента;
			
			ДокОбъект.Регион = Регион;
			ТипШК=перечисления.ТипыШтрихКодов.Штука;
			
			ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;		
			ДокОбъект.ТипЦен=ТипЦен; //Контрагент.ТипЦен;
			ДокОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН;
			ДокОбъект.Подразделение = Подразделение;
			ДокОбъект.ЛевыйКонтрагент=Контрагент;
			ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
			ДокОбъект.Отгружен=перечисления.Отгружен.Резерв;
			ДокОбъект.ПунктДоставки=ПунктДоставки;
			ДокОбъект.Склад=Склад;		
			УстановитьНомерДокументаКлиентСервер(ДокОбъект);
			ДокОбъект.Валюта=Справочники.Валюты.НайтиПоКоду("810");
			ДокОбъект.Автор	=Неопределено;
			
			Если СокрЛП(Контрагент.Код)=КодМетро И (Лев(ДокОбъект.Номер,3)<>"SSP" или Лев(ДокОбъект.Номер,3)<>"SST") Тогда
				УстановитьНомерДокументаКлиентСервер(ДокОбъект);	
			КонецЕсли;
			
			ДокОбъект.КодОперации=Перечисления.КодыОперацийОстатки.Реализация;
			ДокОбъект.ДатаОформления	=ДокОбъект.Дата;
			
			//Валетов + 30.06.2026 Изменение 0000000060
			//ДокОбъект.ДатаОплаты	    =ПолучитьДатуОплаты1(ДокОбъект.ДатаОтгрузки,ДокОбъект.ОтсрочкаПлатежа);	
			ПараметрыРасчетаДатыОплаты  = ОбщегоНазначенияКС.ПолучитьЗаполнитьПараметрыРасчетаДатыОплатыПоДокументу(ДокОбъект);
			ДокОбъект.ДатаОплаты 		= ОбщегоНазначенияКС.ПолучитьДатуОплатыПоДокументуКлиентСервер(ПараметрыРасчетаДатыОплаты); 
			//Валетов-
	
			СкидкаКонтрагента=ПолучитьРеквизитРодителя(Контрагент,"Скидка");
			ДокОбъект.Скидка=СкидкаКонтрагента;
			
			ПересчетТЧ(ДокОбъект,"Товары",ДокОбъект.Валюта,ДокОбъект.Валюта,ДокОбъект.Курс,ДокОбъект.Курс,Истина);	
			
			
			//проверим на пустые цены!!
			//нечаева 15,03,16+++
			
			ОтборНулевыеЦены=новый Структура("Цена",0);
			МассивНулевыхЦен=ДокОбъект.Товары.НайтиСтроки(ОтборНулевыеЦены);
			
			Для каждого текстрока из МассивНулевыхЦен цикл
				
				Отбор2=новый Структура("номенклатура",ТекСтрока.номенклатура);
				тстрока=ДокОбъект.Товары.НайтиСтроки(Отбор2);
				Ошибки.Добавить("Для товара -  "+ТекСтрока.номенклатура +" Цена =0, не записано в заказе, проверьте матрицу! " );
				ТекНом =тстрока[0].НомерСтроки; //.удалить()
				докобъект.товары.Удалить(ТекНом-1);
				
			КонецЦикла;
			//нечаева 15,03,16---
			
			
			
			Попытка
				ДокОбъект.Записать(режимЗаписиДокумента.Запись);
				Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
				//Сообщить("Записан документ - "+ДокОбъект.Дата+" "+ДокОбъект.Номер);
				// записать номер в "ошибки" для вывода менеджерам
			Исключение
				// Катаев+ 22/08/13 Если возникла ошибка с уникальностью номера, то пробуем обновить нумерацию объектов и сгенерировать номер заново
				Инфо = ИнформацияОбОшибке();
				Если Найти(Инфо.Описание, "Не уникальный номер документа") > 0 Тогда
					ОбновитьНумерациюОбъектов();
					УстановитьНомерДокументаКлиентСервер(ЭтотОбъект);
					Попытка
						ДокОбъект.Записать(режимЗаписиДокумента.Запись);
						Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
					Исключение
						Если ПризКр=0 тогда
							КритичОшибки.Добавить("После обновления нумерации для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
							//Катаев+ 11/12/14
							Отказ = Истина;
							//Катаев- 11/12/14
						конецЕсли;
					КонецПопытки;
				Иначе	
					Если ПризКр=0 тогда
						КритичОшибки.Добавить("Для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
						//Катаев+ 11/12/14
						Отказ = Истина;
						//Катаев- 11/12/14
					конецЕсли;
				КонецЕсли;
				// Катаев- 22/08/13
				//Сообщить(ОписаниеОшибки());
			КонецПопытки;
			//сообщить("    документ записан");
			ПризКр=ПризКр+1;
			
			
		КонецЦикла;
	КонецЦикла;
	// конец заполнения документа
	
КонецПроцедуры


// для Метро
//нечаева 09,09,19+++
Процедура ОбработкаДанныхЗагрузкиМетро(Шапка,Строки)
	
	//	
	//// Пробегаем по строкам и переприсваиваем значение из папки колготки на = папке кбстиль =4
	//Для каждого ТекСтр из Строки Цикл
	//	
	//	Если ТекСтр.Номенклатура.Родитель=Справочники.номенклатура.НайтиПоКоду("SNL-063466") или  // папка колготки
	//	   ТекСтр.Номенклатура.Родитель.Родитель=Справочники.номенклатура.НайтиПоКоду("SNL-063466") или
	//	   ТекСтр.Номенклатура.Родитель.Родитель.родитель=Справочники.номенклатура.НайтиПоКоду("SNL-063466") или
	//	   ТекСтр.Номенклатура.Родитель.Родитель.родитель.родитель=Справочники.номенклатура.НайтиПоКоду("SNL-063466")
	//	Тогда
	//	   ТекСтр.ПризнакГруппыНом=4;
	//	КонецЕсли;   
	//			   
	//КонецЦикла;
	
	СтрШапка=Шапка.Получить(0);
	ТипЦен=Справочники.ТипыЦен.ПустаяСсылка();
	ТипСкидки=Справочники.ТипыСкидок.ПустаяСсылка();
	Организация=Неопределено;
	Менеджер=Неопределено;
	Регион=Неопределено;
	Договор=Неопределено;
	Подразделение=Неопределено;
	ОтсрочкаПлатежа=Неопределено;
	КодПоставщикаКонтрагента=Неопределено;
	ПунктДоставки=Неопределено;
	НомерЗаказа=Неопределено;
	ТипILNКонтрагента=Неопределено;
	ДатаЗаказа=Неопределено;
	ДатаОтгрузки=Неопределено;
	Склад=Неопределено;   //Справочники.Склады.НайтиПоКоду("STA-61");
	Контрагент=СтрШапка.Контрагент;
	Если Контрагент=Неопределено тогда
		Контрагент=Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;	
	ПунктДоставки=СтрШапка.ПунктДоставки;
	НомЗаказа=СтрШапка.НомЗаказа;
	НомерЗаказа=СтрШапка.НомЗаказа;
	ДатаЗаказа=СтрШапка.ДатаЗаказа;
	ДатаДоставки=СтрШапка.ДатаДоставки;
	ТипILNКонтрагента=СтрШапка.ТипILNКонтрагента;
	КодДоговора=СтрШапка.КодДоговора;
	
	ПризКр=0;
	//сообщить("    запись документа");
	Если не Контрагент.Пустая() Тогда 	
		// 1. Обрабатываем количество, делаем округление  соответствуещее коли-ву в блочке
		Если Контрагент.ОткруглятьКоличество Тогда
			
			Для каждого ТекСтрока Из Строки Цикл
				ПризКратности=1;
				Ном=ТекСтрока.Номенклатура;
				КолЗаказано=ТекСтрока.Колво;
				
				Если НЕ ТипЗнч(Ном) = Тип("СправочникСсылка.Номенклатура") Тогда
					ТекСтрока.КолвоОтредактированное=КолЗаказано;
					продолжить;
				КонецЕсли;
				
				ШтукВКор=Ном.Родитель.ШтукВКоробочке;
				Если ШтукВКор-0>0 Тогда 
					// проверяем на кратность 5 или 6
					Если (ШтукВКор/5)=Цел((ШтукВКор/5)) Тогда
						ПризКратности=5
					ИначеЕсли (ШтукВКор/6)=Цел((ШтукВКор/6)) Тогда
						ПризКратности=6
					Иначе
						ПризКратности=1;
					КонецЕсли;
					
					Если (КолЗаказано/ПризКратности)<>Цел((КолЗаказано/ПризКратности)) Тогда
						КолУпак=Цел(Окр(КолЗаказано/ПризКратности,0,0));
						НовКолво=КолУпак*ПризКратности;
						ТекСтрока.КолвоОтредактированное=НовКолво;
					Иначе
						ТекСтрока.КолвоОтредактированное=КолЗаказано;
					Конецесли;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для каждого ТекСтрока Из Строки Цикл
				КолЗаказано=ТекСтрока.Колво;
				ТекСтрока.КолвоОтредактированное=КолЗаказано;			
			КонецЦикла;
			
		КонецЕсли;
		
		// 2. проверяем дублированный заказ есть или нет. в пределах недели;
		Если Контрагент.ПроверятьНаличиеЗаказа Тогда
			
			Дата1=ТекущаяДата();
			Дата2=ТекущаяДата() - 60 * 60 * 24 * 7; // неделя назад;
			
			Запрос=новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	РасходнаяНакладная.Номер,
			|	РасходнаяНакладная.Дата,
			|	РасходнаяНакладная.Ссылка
			|ИЗ
			|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
			|ГДЕ
			|	РасходнаяНакладная.Контрагент = &Контрагент
			|	И РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
			|	И РасходнаяНакладная.Дата МЕЖДУ НачалоПериода(&Дата2) И КонецПериода(&Дата1)";
			
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("ПунктДоставки",ПунктДоставки);
			Запрос.УстановитьПараметр("Дата1",Дата1);
			Запрос.УстановитьПараметр("Дата2",Дата2);
			
			Рез=Запрос.Выполнить().Выбрать();
			
			// добавляем в сообщения менеджерам
			Пока Рез.Следующий() Цикл
				Строка="Для заказа ЕКОДЕ № "+НомЗаказа+" существует копия заказа РНК №"+Рез.Номер+" от "+Рез.Дата;
				Ошибки.Добавить(Строка);
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	//-------------------------------------------------------------------------------------------------------------------------------------------
	//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
	// когда складов несколько и есть данные, которые нашлись
	//-------------------------------------------------------------------------------------------------------------------------------------------
	
	// загрузка ТЗ в запрос
	//--------------------------------------------
	ТЗСклады=Строки;
	
	// создается для временной таблицы
	ТЗ  = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТЗ.Колонки.Добавить("Найдена", Новый ОписаниеТипов("Число"));
	
	Запрос = Новый Запрос;
	ДанныеСкладов=Неопределено;
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст  = "ВЫБРАТЬ различные
	|    ТЗ.Склад как Склад,
	|    ТЗ.Найдена
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|    &ТЗ КАК ТЗ";
	
	Запрос.УстановитьПараметр("ТЗ", ТзСклады);
	Запрос.Выполнить();
	
	Запрос.Текст="ВЫБРАТЬ
	|	ТЗ.Склад КАК Склад,
	|	ТЗ.Найдена
	|ИЗ
	|	ТЗ КАК ТЗ
	|ГДЕ
	|	ТЗ.Найдена = 1";
	РезультатСклады=Запрос.Выполнить().Выбрать();
	
	
	КоличествоСкладов=РезультатСклады.Количество();
	
	Если РезультатСклады.Количество()=0 Тогда
		// пустой документ! не формируем ?
		Склад=Справочники.Склады.НайтиПоКоду("STA-61");
		// Катаев+ 21/03/13 Создавать новый документ надо только для оригинала
		//ДокОбъект=Документы.РасходнаяНакладная.СоздатьДокумент();
		//ДокОбъект = ПолучитьНакладную(Склад, Шапка.НомЗаказа, Шапка.ДатаЗаказа, Шапка.ТипЗаказа);
		ДокОбъект = ПолучитьНакладную(Склад, Шапка[0].НомЗаказа, Шапка[0].ДатаЗаказа, Шапка[0].ТипЗаказа);
		Если ДокОбъект = Неопределено Тогда
			Возврат;
		КонецЕсли;
		// Катаев- 21/03/13
		//-----------------------------------------------------------------------------------------
		//    автозаполнение параметров шапки документа, разница в шапке - в складе отгрузки
		//-----------------------------------------------------------------------------------------
		Если не Контрагент.Пустая() Тогда 	
			//------------------------------------------
			Организация=Справочники.Организации.НайтиПоКоду("SS-001"); //КБ- Стиль
			ТипЦен=Контрагент.ТипЦен;
			//Мессерле
			Запрос=новый запрос;
			запрос.Текст="ВЫБРАТЬ
			|	Договоры.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Договоры КАК Договоры
			|ГДЕ
			|	Договоры.КодПоставщика.Наименование = &КодПоставщика
			|	И Договоры.КодЦБ = &КодЦБ
			|	И Договоры.НеИспользовать = ложь";
			
			Запрос.УстановитьПараметр("КодПоставщика",КодДоговора);
			Запрос.УстановитьПараметр("КодЦБ",Контрагент.КодЦБ);
			
			Выб=запрос.Выполнить().Выбрать();
			Если выб.следующий() тогда
				Договор=выб.ссылка;
			иначе
				Договор=Контрагент.ОсновнойДоговор;
			Конецесли;
			//Мессерле
			
			Если не (Договор=Неопределено) и не (Договор=справочники.Договоры.ПустаяСсылка()) Тогда
				//ТипЦен		=Договор.ТипЦен;
				ОтсрочкаПлатежа =Договор.ОтсрочкаПлатежа;
				Если ЗначениеЗаполнено(Договор.Организация) Тогда
					Организация=Договор.Организация;		
				КонецЕсли;
			КонецЕсли;
			//----  доп. обработка;
			
			ДокОбъект.ДопОбработки.Очистить();
			Для Каждого СтрокаТЧ Из Контрагент.ВидыДопОбработок Цикл
				СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
			КонецЦикла;  
			//нечаева 23,03,17+++
			// добавляем из пункта доставки доп. обработки.
			Попытка
				Для Каждого СтрокаТЧ Из ПунктДоставки.ВидыДопОбработок Цикл
					СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
				КонецЦикла;  
			Исключение
			КонецПопытки;
			//нечаева 23,03,17---
			
			//-----------------------------------------------
			Менеджер=Контрагент.Менеджер;
			Если Менеджер=Неопределено или Менеджер=Справочники.ФизическиеЛица.ПустаяСсылка() и ПризКр=0 Тогда
				КритичОшибки.Добавить("Для контрагента "+контрагент.наименование+"  код - "+контрагент.код+"  не определен менеджер! Заказ екоде №"+ Номерзаказа );
			Иначе
				Если Не СтрДлина(Менеджер.Емэйл)>2  и ПризКр=0   Тогда
					КритичОшибки.Добавить("Для менеджера "+Менеджер.наименование+"  код - "+Менеджер.код+"  не определен ЕМэйл!" );
				КонецЕсли;
			КонецЕсли;
			
			//Катаев+ 06/08/14 Из ЕКОД все контрагенты грузятся с использованием номенклатурной матрицы. Проверку убрал
			//Если Контрагент.ТипЦен=Справочники.ТипыЦен.ПустаяСсылка() и ПризКр=0 и Контрагент.код<>"SSP-3674" Тогда
			//	//Катаев+ 17/10/13 Проверяем есть ли тип цены по пункту доставки
			//	//КритичОшибки.Добавить("Для контрагента "+Контрагент.Наименование+" не установлен тип цен по умолчанию!");
			//	Если ПунктДоставки = Неопределено Тогда
			//		КритичОшибки.Добавить("Для контрагента "+Контрагент.Наименование+" не установлен тип цен по умолчанию!");
			//	Иначе
			//		Если Не ЗначениеЗаполнено(ПунктДоставки.ТипЦен) Тогда
			//			КритичОшибки.Добавить("Для контрагента "+Контрагент.Наименование+" не установлен тип цен по умолчанию!");
			//		КонецЕсли;
			//	КонецЕсли;
			//	//Катаев- 17/10/13
			//КонецЕсли;
			//Катаев- 06/08/14 
			Подразделение = Контрагент.Менеджер.Подразделение;
			
			//------------------------
			// код поставщика
			//------------------------
			//Катаев+ 22/08/14 Для Метро код поставщика передается в файле Берем его
			//КодПоставщикаКонтрагента=Контрагент.КодПоставщика;
			//Если КодПоставщикаконтрагента.пустая() ИЛИ кодПоставщикаКонтрагента=Неопределено Тогда
			//	// Берем первую из справочника коды контрагентов
			//	Запрос=Новый Запрос;
			//	Запрос.Текст="ВЫБРАТЬ
			//	|	КодыПоставщиков.Ссылка
			//	|ИЗ
			//	|	Справочник.КодыПоставщиков КАК КодыПоставщиков
			//	|ГДЕ
			//	|	КодыПоставщиков.Владелец = &Контрагент
			//	|	И (КодыПоставщиков.Организация = &ТекОрганизация
			//	|			ИЛИ КодыПоставщиков.Организация = &Контр2)";
			//	Запрос.УстановитьПараметр("Контрагент",Контрагент);		
			//	Запрос.УстановитьПараметр("Контр2",Справочники.Контрагенты.ПустаяСсылка());		
			//	Запрос.УстановитьПараметр("ТекОрганизация",Организация);		
			//	Результат=Запрос.Выполнить().Выбрать();
			//	// катаев+ 28/02/13 Исправление ошибки
			//	//Пока Результат.Следующий() Цикл
			//	//	КодПоставщикаКонтрагента=Результат.ссылка;
			//	//	возврат;
			//	//КонецЦикла;
			//	Если Результат.Следующий() Тогда
			//		КодПоставщикаКонтрагента=Результат.ссылка;
			//	КонецЕсли;
			//	// Катаев- 28/02/13
			//	
			//КонецЕсли;
			Запрос = Новый Запрос;
			Запрос.Текст=
			"ВЫБРАТЬ
			|	КодыПоставщиков.Ссылка
			|ИЗ
			|	Справочник.КодыПоставщиков КАК КодыПоставщиков
			|ГДЕ
			|	КодыПоставщиков.Владелец = &Контрагент
			|	И КодыПоставщиков.Наименование = &КодДоговора";
			Запрос.УстановитьПараметр("Контрагент",Контрагент);		
			Запрос.УстановитьПараметр("КодДоговора",КодДоговора);		
			Результат=Запрос.Выполнить().Выбрать();
			Результат.Следующий();
			КодПоставщикаКонтрагента = Результат.Ссылка;
			//Катаев- 22/08/14
			
		КонецЕсли;
		
		//----------------------------------------------
		//доставка
		Если не ПунктДоставки=Неопределено  Тогда 
			Если ЗначениеЗаполнено(ПунктДоставки.РайонДоставки) Тогда
				РайонДоставки=ПунктДоставки.РайонДоставки;	
				ДокОбъект.РайонДоставки=РайонДоставки;
			КонецЕсли;	
			Если ЗначениеЗаполнено(ПунктДоставки.Регион) Тогда
				Регион=ПунктДоставки.Регион;
				ДокОбъект.Регион=Регион;
			КонецЕсли;	
			//Катаев+ 10/04/14 Транспортная компания заполняется только если выбран тип доставки = "ТранспортнаяКомпания"
			//Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
			//	ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
			//	ДокОбъект.ТранспортнаяКомпания=ТранспортнаяКомпания;
			//КонецЕсли;	
			//Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
			//	ПунктПерегруза=ПунктДоставки.ПунктПерегруза;	
			//	ДокОбъект.ПунктПерегруза=ПунктПерегруза;
			//КонецЕсли;		
			Если ПунктДоставки.ТипДоставки = Перечисления.ТипыДоставки.ТранспортнаяКомпания Тогда
				Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
					ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
					ДокОбъект.ТранспортнаяКомпания=ТранспортнаяКомпания;
				КонецЕсли;
				Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
					ПунктПерегруза=ПунктДоставки.ПунктПерегруза;	
					ДокОбъект.ПунктПерегруза=ПунктПерегруза;
				КонецЕсли;		
			КонецЕсли;
			//Катаев- 10/04/14
			Если ЗначениеЗаполнено(ПунктДоставки.Грузополучатель) Тогда
				Грузополучатель=ПунктДоставки.Грузополучатель;		
				ДокОбъект.Грузополучатель=Грузополучатель;
			КонецЕсли;
			Если ЗначениеЗаполнено(ПунктДоставки.Получатель) Тогда
				Получатель=ПунктДоставки.Получатель;		
				ДокОбъект.Получатель=Получатель;
			КонецЕсли;
			Если ЗначениеЗаполнено(ПунктДоставки.ОтсрочкаПлатежа) Тогда
				ОтсрочкаПлатежа=ПунктДоставки.ОтсрочкаПлатежа;		
				ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;
			КонецЕсли;
			
			//типы цен скидки
			Если ЗначениеЗаполнено(ПунктДоставки.ТипЦен) И ТипЦен<>ПунктДоставки.ТипЦен Тогда
				ТипЦен=ПунктДоставки.ТипЦен;		
			КонецЕсли; 
			Если ЗначениеЗаполнено(ПунктДоставки.ТипСкидок) И ДокОбъект.ТипСкидок<>ПунктДоставки.ТипСкидок Тогда
				ТипСкидок=ПунктДоставки.ТипСкидок;		
			КонецЕсли;
			Если ПунктДоставки.Скидка<>0 И ПунктДоставки.Скидка<>ДокОбъект.Скидка Тогда
				Скидка=ПунктДоставки.Скидка;		
				ДокОбъект.Скидка=Скидка;
			КонецЕсли;
		КонецЕсли;
		//-------------------------------------------------------------------		
		
		ДокОбъект.Дата=ТекущаяДата();
		ЗаполнитьШапкуДокумента(ДокОбъект, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
		//УстановитьНомерДокументаКлиентСервер(ДокОбъект);
		ДокОбъект.Контрагент=Контрагент;
		ДокОбъект.Организация=Организация;
		ДокОбъект.Договор=Договор;
		ДокОбъект.ИБ=Справочники.ИБ.НайтиПоКоду("SSP");
		ДокОбъект.Менеджер= Менеджер;
		ДокОбъект.НомерЗаказа= УбратьНули(НомЗаказа,Контрагент.УбиратьНулиПередНомеромЗаказа);
		
		Попытка
			ДокОбъект.ДатаЗаказа=Дата(СтрЗаменить(ДатаЗаказа, "-", ""));
			ДокОбъект.ДатаОтгрузки=Дата(СтрЗаменить(ДатаДоставки, "-", ""));
		Исключение
		КонецПопытки;
		
		ДокОбъект.КодПоставщика=КодПоставщикаКонтрагента;
		
		ДокОбъект.Регион = Регион;
		ТипШК=перечисления.ТипыШтрихКодов.Штука;
		
		ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;		
		ДокОбъект.ТипЦен=ТипЦен; //Контрагент.ТипЦен;
		ДокОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН;
		ДокОбъект.Подразделение = Подразделение;
		ДокОбъект.ЛевыйКонтрагент=Контрагент;
		ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
		ДокОбъект.Отгружен=перечисления.Отгружен.Резерв;
		ДокОбъект.ПунктДоставки=ПунктДоставки;
		ДокОбъект.Склад=Склад;		
		УстановитьНомерДокументаКлиентСервер(ДокОбъект);
		ДокОбъект.Валюта=Справочники.Валюты.НайтиПоКоду("810");
		//ДокОбъект.Автор				=Неопределено;
		
		//Валетов + 30.06.2026 Изменение 0000000060
		//ДокОбъект.ДатаОплаты	    =ПолучитьДатуОплаты1(ДокОбъект.ДатаОтгрузки,ДокОбъект.ОтсрочкаПлатежа);	
		ПараметрыРасчетаДатыОплаты  = ОбщегоНазначенияКС.ПолучитьЗаполнитьПараметрыРасчетаДатыОплатыПоДокументу(ДокОбъект);
		ДокОбъект.ДатаОплаты 		= ОбщегоНазначенияКС.ПолучитьДатуОплатыПоДокументуКлиентСервер(ПараметрыРасчетаДатыОплаты); 
		//Валетов-
		
		//крохин начало 02.08.2021
		//Если СокрЛП(Контрагент.Код)=КодМетро И (Лев(ДокОбъект.Номер,3)<>"SSP" или Лев(ДокОбъект.Номер,3)<>"SST") Тогда
		Если СокрЛП(Контрагент.Код)=КодМетро И (Лев(ДокОбъект.Номер,3)<>"SSP" или Лев(ДокОбъект.Номер,3)<>"SST" или Лев(ДокОбъект.Номер,3)<>"SSV") Тогда
			//крохин конец 02.08.2021
			УстановитьНомерДокументаКлиентСервер(ДокОбъект);	
		КонецЕсли;
		
		ДокОбъект.КодОперации=Перечисления.КодыОперацийОстатки.Реализация;
		ДокОбъект.ДатаОформления	=ДокОбъект.Дата;
		СкидкаКонтрагента=ПолучитьРеквизитРодителя(Контрагент,"Скидка");
		ДокОбъект.Скидка=СкидкаКонтрагента;
		
		
		ПересчетТЧ(ДокОбъект,"Товары",ДокОбъект.Валюта,ДокОбъект.Валюта,ДокОбъект.Курс,ДокОбъект.Курс,Истина);	
		
		
		
		
		
		Попытка
			ДокОбъект.Записать(режимЗаписиДокумента.Запись);
			Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
			//Сообщить("Записан документ - "+ДокОбъект.Дата+" "+ДокОбъект.Номер);
			// записать номер в "ошибки" для вывода менеджерам
		Исключение
			// Катаев+ 08/02/13
			// Если возникла ошибка с уникальностью номера, то пробуем обновить нумерацию объектов и сгенерировать номер заново
			Инфо = ИнформацияОбОшибке();
			Если Найти(Инфо.Описание, "Не уникальный номер документа") > 0 Тогда
				ОбновитьНумерациюОбъектов();
				УстановитьНомерДокументаКлиентСервер(ЭтотОбъект);
				Попытка
					ДокОбъект.Записать(режимЗаписиДокумента.Запись);
					Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
				Исключение
					Если ПризКр=0 тогда
						КритичОшибки.Добавить("После обновления нумерации для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
					конецЕсли;
				КонецПопытки;
			Иначе	
				Если ПризКр=0 тогда
					КритичОшибки.Добавить("Для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
					//КритичОшибки.Добавить("Для заказа Заказ из ECODE №"+НомерЗаказа+" документ не записан! "+ОписаниеОшибки() );
				конецЕсли;
			КонецЕсли;
			// Катаев- 08/02/13
			//Сообщить(ОписаниеОшибки());
		КонецПопытки;
		//сообщить("    документ записан");
		ПризКр=ПризКр+1;
		
	КонецЕсли;
	
	//---------------------------------------------------------------------------------
	//                          по циклу смотрим данные
	//-------------------------------------------------------------------------------------
	Пока РезультатСклады.Следующий() цикл
		
		Склад=РезультатСклады.Склад;
		// формируем документ по складу
		//---------------------------------------------------	
		// выбираем строки номенклатуры по складу, заполняем строки
		ТЗ2  = Новый ТаблицаЗначений;
		ТЗ2.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
		ТЗ2.Колонки.Добавить("Найдена", Новый ОписаниеТипов("Число"));
		ТЗ2.Колонки.Добавить("КолвоОтредактированное",Новый ОписаниеТипов("Число"));
		ТЗ2.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТЗ2.Колонки.Добавить("ПризнакГруппыНом",Новый ОписаниеТипов("Число"));
		ТЗ2.Колонки.Добавить("ТипШкМетро",Новый ОписаниеТипов("ПеречислениеСсылка.ТипыШтрихкодов"));
		
		Запрос = Новый Запрос;
		ДанныеСкладов=Неопределено;
		МВТ = Новый МенеджерВременныхТаблиц;
		Запрос.МенеджерВременныхТаблиц = МВТ;
		Запрос.Текст  = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗ2.Склад КАК Склад,
		|	ТЗ2.Номенклатура, 
		|	ТЗ2.КолвоОтредактированное,
		|	ТЗ2.Найдена,
		|	ТЗ2.НомерСтроки,
		|	ТЗ2.ПризнакГруппыНом,
		|	ТЗ2.ТипШкМетро
		|ПОМЕСТИТЬ ТЗ2
		|ИЗ
		|	&ТЗ2 КАК ТЗ2
		|ГДЕ
		|	ТЗ2.Склад = &ТекСклад
		|	И ТЗ2.Найдена = 1";
		Запрос.УстановитьПараметр("ТекСклад",Склад);
		Запрос.УстановитьПараметр("ТЗ2", ТзСклады);
		Запрос.Выполнить();
		
		Запрос.Текст="ВЫБРАТЬ
		|	ТЗ2.Склад КАК Склад,
		|	ТЗ2.Номенклатура,
		|	ТЗ2.КолвоОтредактированное,
		|	ТЗ2.Найдена,
		|	ТЗ2.НомерСтроки КАК НомерСтроки,
		|	ТЗ2.ПризнакГруппыНом,
		|	ТЗ2.ТипШкМетро
		|ИЗ
		|	ТЗ2 КАК ТЗ2
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		РезНом=Запрос.Выполнить().Выгрузить();
		
		
		//******************************************************************************************
		//-------------------------------------------------------------------------------------------------
		// обрабатываем на документы по папкам для ашана и гиперглобуса (создаются несколько документов)
		//-------------------------------------------------------------------------------------------------
		// выбиреам 3 типа папок - ашан , 2 типа гипер глобус  // +1 к ним - остальные папки
		// создаем  несколько таб частей и фигачим несколько документов по ним.
		
		
		
		РезНом1=Новый ТаблицаЗначений;
		РезНом2=Новый ТаблицаЗначений;
		РезНом3=Новый ТаблицаЗначений;
		РезНом4=Новый ТаблицаЗначений;
		РезНом5=Новый ТаблицаЗначений;
		РезНом6=Новый ТаблицаЗначений;
		
		
		// Сформировать структуру отбора. 
		// Найти строки. 
		
		Отбор1 = Новый Структура();
		Отбор1.Вставить("ПризнакГруппыНом", 1); 
		РезНом1 = РезНОм.НайтиСтроки(Отбор1); // колготки
		
		Отбор2 = Новый Структура();
		Отбор2.Вставить("ПризнакГруппыНом", 2); 
		РезНом2 = РезНОм.НайтиСтроки(Отбор2); // белье
		
		Отбор3 = Новый Структура();
		Отбор3.Вставить("ПризнакГруппыНом", 5); 
		РезНом5 = РезНом.НайтиСтроки(Отбор3); // все остальное		
		
		//Катаев+ 08/12/14 Носки тепрье вместе с колготками
		//Отбор3 = Новый Структура();
		//Отбор3.Вставить("ПризнакГруппыНом", 3); 
		//РезНом3 = РезНом.НайтиСтроки(Отбор3);   // носки
		//Катаев- 08/12/14
		
		
		//----------------------------------------------
		Для НомПриз=1 По 5 Цикл
			
			Результат=Неопределено;
			
			
			Если НомПРиз=1 ТОгда
				Если РезНом1.количество()>0  Тогда
					Результат=резном1;
				конецЕсли;
			КонецЕсли;	
			
			Если НомПРиз=5 ТОгда
				Если РезНом5.количество()>0 Тогда
					Результат=резном5;
				конецЕсли;
			КонецЕсли;
			
			Если НомПРиз=2 ТОгда
				Если РезНом2.количество()>0 Тогда
					Результат=резном2;
				конецЕсли;
			КонецЕсли;
			
			Если НомПРиз=3 ТОгда
				Если РезНом3.количество()>0 Тогда
					Результат=резном3;
				конецЕсли;
			КонецЕсли;
			
			
			Если Результат=Неопределено Тогда
				продолжить;
			КонецЕсли;
			
			//Состояние(""+Контрагент+" "+Склад);
			
			Если НЕ Результат[0].Склад=Склад Тогда
				продолжить;
			КонецЕсли;	
			
			ПризМячи=0;
			
			// Катаев+ 21/03/13 Создавать новый документ надо только для оригинала
			//ДокОбъект=Документы.РасходнаяНакладная.СоздатьДокумент();
			//ДокОбъект = ПолучитьНакладную(Склад, Шапка.НомЗаказа, Шапка.ДатаЗаказа, Шапка.ТипЗаказа);
			ДокОбъект = ПолучитьНакладную(Склад, Шапка[0].НомЗаказа, Шапка[0].ДатаЗаказа, Шапка[0].ТипЗаказа);
			Если ДокОбъект = Неопределено Тогда
				Возврат;
			КонецЕсли;
			// Катаев- 21/03/13
			// ------------------------------------------------------------------------------------------------
			
			//нечаева 09,09,19+++
			Запрос1 = Новый Запрос;
			Запрос1.Текст="ВЫБРАТЬ
			|	МатрицаТовары.Номенклатура,
			|	МатрицаТовары.ШККонтрагента,
			|	МатрицаТовары.АртикулКонтрагента,
			|	МатрицаТовары.Ссылка,
			|	МатрицаТовары.НаименованиеКонтрагента,
			|	МатрицаТовары.Кратность как Кратность,
			|	МатрицаТовары.ШККонтрагентаБлочок
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|ГДЕ
			|	МатрицаТовары.Ссылка.Контрагент = &Контрагент
			|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
			|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА
			//	|	И МатрицаТовары.Номенклатура В ИЕРАРХИИ(&ТекНом)
			|
			|УПОРЯДОЧИТЬ ПО
			|	МатрицаТовары.Ссылка.Дата УБЫВ";
			
			Запрос1.УстановитьПараметр("Контрагент",Контрагент);
			//Запрос1.УстановитьПараметр("ТекНом",ном);
			Запрос1.УстановитьПараметр("ТекДата",ТекущаяДата());
			тз1 = Запрос1.Выполнить().Выгрузить();
			
			
			Для Каждого ТекущаяСтрока Из Результат Цикл 
				СтрокаТовара = 	ДокОбъект.Товары.Добавить();
				СтрокаТовара.Номенклатура =ТекущаяСтрока.Номенклатура;
				
				
				// если тип шк = блочок, тогда умножаем на кратность из матрицы.
				//нечаева 18,08,16 ++++
				// всегда считаем, что в блочках.
				ТекущаяСтрока.типШКМетро = Перечисления.ТипыШтрихКодов.Блочок;
				КолШтВБЛочке=1;
				//Если ТекущаяСтрока.типШКМетро = Перечисления.ТипыШтрихКодов.Блочок Тогда
				КолШтВБЛочке = СтрокаТовара.Номенклатура.родитель.ШтукВКоробочке;
				// из матрицы , если есть
				НайденнаяСтрока = тз1.Найти(ТекущаяСтрока.Номенклатура,"Номенклатура");
				Если НайденнаяСтрока <> Неопределено ТОгда
					КолШтВБЛочке = НайденнаяСтрока.Кратность;
				КонецЕсли;
				// если есть в матрице кратность, то берем оттуда.
				
				Если КолШтВБЛочке = 0 или КолШтВБЛочке=неопределено Тогда
					КолШтВБЛочке = 1;
				КонецЕсли;	
				//КонецЕсли;	
				//нечаева 09,09,19---
				
				СтрокаТовара.Заявка = ТекущаяСтрока.КолвоОтредактированное*КолШтВБЛочке;
				СтрокаТовара.Количество = ТекущаяСтрока.КолвоОтредактированное*КолШтВБЛочке;
				СтрокаТовара.ПодтвержденнаяЗаявка = ТекущаяСтрока.КолвоОтредактированное*КолШтВБЛочке;
				
				//нечаева 18,08,16 ----
				
				
				Если Найти(ТекущаяСтрока.Номенклатура.Наименование,"ячи")>0  Тогда
					
					ПризМячи=1;
					
				КонецЕсли; 
				
				ПриИзмененииНоменклатурыТабЧасти(СтрокаТовара, ДокОбъект);
				РассчитатьСуммуТабЧасти(СтрокаТовара, ДокОбъект);
			КонецЦикла;
			
			//-----------------------------------------------------------------------------------------
			//    автозаполнение параметров шапки документа, разница в шапке - в складе отгрузки
			//-----------------------------------------------------------------------------------------
			
			Если не Контрагент.Пустая() Тогда 	
				//------------------------------------------
				Организация=Справочники.Организации.НайтиПоКоду("SS-001"); //КБ- Стиль
				ТипЦен=Контрагент.ТипЦен;
				//Мессерле
				Запрос=новый запрос;
				запрос.Текст="ВЫБРАТЬ
				|	Договоры.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.Договоры КАК Договоры
				|ГДЕ
				|	Договоры.КодПоставщика.Наименование = &КодПоставщика
				|	И Договоры.КодЦБ = &КодЦБ
				|	И Договоры.НеИспользовать = ложь";
				
				Запрос.УстановитьПараметр("КодПоставщика",КодДоговора);
				Запрос.УстановитьПараметр("КодЦБ",Контрагент.КодЦБ);
				
				Выб=запрос.Выполнить().Выбрать();
				Если выб.следующий() тогда
					Договор=выб.ссылка;
				иначе
					Договор=Контрагент.ОсновнойДоговор;
				Конецесли;
				//Мессерле
				
				Если не (Договор=Неопределено) и не (Договор=справочники.Договоры.ПустаяСсылка()) Тогда
					//ТипЦен		=Договор.ТипЦен;
					ОтсрочкаПлатежа =Договор.ОтсрочкаПлатежа;
					Если ЗначениеЗаполнено(Договор.Организация) Тогда
						Организация=Договор.Организация;		
					КонецЕсли;
				КонецЕсли;
				
				
				//----  доп. обработка; --------------------------------
				
				//ДокОбъект.ДопОбработки.Очистить();
				//Для Каждого СтрокаТЧ Из Контрагент.ВидыДопОбработок Цикл
				//	СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
				//	СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
				//КонецЦикла; 
				
				
				ДокОбъект.ДопОбработки.Очистить();
				
				Для Каждого СтрокаТЧ Из Контрагент.ВидыДопОбработок Цикл
					
					Если СокрЛП(Контрагент.Код)="SSP-8643" Тогда  // метро
						Если СтрокаТЧ.ДопОбработка.Код="ODN-00014" Тогда
							продолжить; // не пишем эту доп обработку.   антикражка и поставщик не пишем
						КонецЕсли;
						
						Если СтрокаТЧ.ДопОбработка.Код="SNL-00036" Тогда
							продолжить; // не пишем эту доп обработку.   белье на вешалках метро не пишем
						КонецЕсли;
						
						
					КонецЕсли;
					
					
					
					Если СокрЛП(Контрагент.Код)="SSP-8643"  или СокрЛП(Контрагент.Код)="SSP-2412"  Тогда  
						// для метро и реал  делаем спец. обработку. 
						
						//Если КоличествоСкладов>1 И (Склад.код="SNL-79" или Склад.код="SNL-22") Тогда     
						//нечаева поменяла склад 22,01,15++
						Если КоличествоСкладов>1 И (Склад.код="STA-10" или Склад.код="STA-20") Тогда     
							//нечаева поменяла склад 22,01,15++
							
							
							
							
							// если склад белье, то одну доп обработку не берем.
							Если СтрокаТЧ.ДопОбработка.Код="ODB-00017" Тогда
								продолжить; // не пишем эту доп обработку.   палетный ярлык не пишем
							КонецЕсли;
						КонецЕсли;
						
						СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
						СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка; // остальные стандартные добавляем
						
					КонецЕсли;
					
				КонецЦикла;  
				//нечаева 23,03,17+++
				// добавляем из пункта доставки доп. обработки.
				Попытка
					Для Каждого СтрокаТЧ Из ПунктДоставки.ВидыДопОбработок Цикл
						СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
						СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
					КонецЦикла;  
				исключение
				КонецПопытки;
				//нечаева 23,03,17---
				
				
				
				
				
				// бельевой склад
				//Если СокрЛП(Контрагент.Код)="SSP-8643" И (Склад.код="SNL-79" или Склад.код="SNL-22") Тогда 
				
				//нечаева поменяла склад 22,01,15++
				Если СокрЛП(Контрагент.Код)="SSP-8643" И (Склад.код="STA-10" или Склад.код="STA-20") Тогда      
					//нечаева поменяла склад 22,01,15++
					
					
					// метро 
					попытка
						СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
						СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("SNL-00036"); // белье на вешалках метро				
					исключение
					конецпопытки;
				КонецЕсли;
				
				// когда колготочный склад
				Если СокрЛП(Контрагент.Код)="SSP-8643" И (Склад.код="STA-61" или Склад.код="SNL-82") Тогда 
					// метро 
					попытка
						СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
						//СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("ODN-00014");  // антикражка + поставщик  				
						//Теперь другая ДО
						//СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("ODN-00014");  // антикражка + поставщик 	
						СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("OD7-00101");  // антикражка + поставщик 
						//Кухарь 28.06.17 конец
						
					исключение
					конецпопытки;
				КонецЕсли;
				
				
				
				
				
				//-----------------------------------------------
				
				Менеджер=Контрагент.Менеджер;
				Если Менеджер=Неопределено или Менеджер=Справочники.ФизическиеЛица.ПустаяСсылка() и ПризКр=0 Тогда
					КритичОшибки.Добавить("Для контрагента "+контрагент.наименование+"  код - "+контрагент.код+"  не определен менеджер! Заказ екоде №"+ Номерзаказа );
				Иначе
					Если Не СтрДлина(Менеджер.Емэйл)>2  и ПризКр=0   Тогда
						КритичОшибки.Добавить("Для менеджера "+Менеджер.наименование+"  код - "+Менеджер.код+"  не определен ЕМэйл!" );
					КонецЕсли;
				КонецЕсли;
				
				Подразделение = Контрагент.Менеджер.Подразделение;
				
				
				Запрос = Новый Запрос;
				Запрос.Текст=
				"ВЫБРАТЬ
				|	КодыПоставщиков.Ссылка
				|ИЗ
				|	Справочник.КодыПоставщиков КАК КодыПоставщиков
				|ГДЕ
				|	КодыПоставщиков.Владелец = &Контрагент
				|	И КодыПоставщиков.Наименование = &КодДоговора";
				Запрос.УстановитьПараметр("Контрагент",Контрагент);		
				Запрос.УстановитьПараметр("КодДоговора",КодДоговора);		
				Результат=Запрос.Выполнить().Выбрать();
				Результат.Следующий();
				КодПоставщикаКонтрагента = Результат.Ссылка;
				//Катаев- 22/08/14
			КонецЕсли;
			
			//----------------------------------------------
			//доставка
			Если не ПунктДоставки=Неопределено  Тогда 
				Если ЗначениеЗаполнено(ПунктДоставки.РайонДоставки) Тогда
					РайонДоставки=ПунктДоставки.РайонДоставки;	
					ДокОбъект.РайонДоставки=РайонДоставки;
				КонецЕсли;	
				Если ЗначениеЗаполнено(ПунктДоставки.Регион) Тогда
					Регион=ПунктДоставки.Регион;
					ДокОбъект.Регион=Регион;
				КонецЕсли;	
				//Катаев+ 10/04/14 Транспортная компания заполняется только если выбран тип доставки = "ТранспортнаяКомпания"
				//Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
				//	ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
				//	ДокОбъект.ТранспортнаяКомпания=ТранспортнаяКомпания;
				//КонецЕсли;	
				//Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
				//	ПунктПерегруза=ПунктДоставки.ПунктПерегруза;	
				//	ДокОбъект.ПунктПерегруза=ПунктПерегруза;
				//КонецЕсли;		
				Если ПунктДоставки.ТипДоставки = Перечисления.ТипыДоставки.ТранспортнаяКомпания Тогда
					Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
						ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
						ДокОбъект.ТранспортнаяКомпания=ТранспортнаяКомпания;
					КонецЕсли;
					Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
						ПунктПерегруза=ПунктДоставки.ПунктПерегруза;	
						ДокОбъект.ПунктПерегруза=ПунктПерегруза;
					КонецЕсли;		
				КонецЕсли;
				//Катаев- 10/04/14
				Если ЗначениеЗаполнено(ПунктДоставки.Грузополучатель) Тогда
					Грузополучатель=ПунктДоставки.Грузополучатель;		
					ДокОбъект.Грузополучатель=Грузополучатель;
				КонецЕсли;
				Если ЗначениеЗаполнено(ПунктДоставки.Получатель) Тогда
					Получатель=ПунктДоставки.Получатель;		
					ДокОбъект.Получатель=Получатель;
				КонецЕсли;
				Если ЗначениеЗаполнено(ПунктДоставки.ОтсрочкаПлатежа) Тогда
					ОтсрочкаПлатежа=ПунктДоставки.ОтсрочкаПлатежа;		
					ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;
				КонецЕсли;
				
				//типы цен скидки
				Если ЗначениеЗаполнено(ПунктДоставки.ТипЦен) И ТипЦен<>ПунктДоставки.ТипЦен Тогда
					ТипЦен=ПунктДоставки.ТипЦен;		
				КонецЕсли; 
				Если ЗначениеЗаполнено(ПунктДоставки.ТипСкидок) И ДокОбъект.ТипСкидок<>ПунктДоставки.ТипСкидок Тогда
					ТипСкидок=ПунктДоставки.ТипСкидок;		
				КонецЕсли;
				Если ПунктДоставки.Скидка<>0 И ПунктДоставки.Скидка<>ДокОбъект.Скидка Тогда
					Скидка=ПунктДоставки.Скидка;		
					ДокОбъект.Скидка=Скидка;
				КонецЕсли;
			КонецЕсли;
			//-------------------------------------------------------------------		
			
			ДокОбъект.Дата=ТекущаяДата();
			ЗаполнитьШапкуДокумента(ДокОбъект, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
			//УстановитьНомерДокументаКлиентСервер(ДокОбъект);
			ДокОбъект.Контрагент=Контрагент;
			ДокОбъект.Организация=Организация;
			ДокОбъект.Договор=Договор;
			ДокОбъект.ИБ=Справочники.ИБ.НайтиПоКоду("SSP");
			ДокОбъект.Менеджер= Менеджер;
			ДокОбъект.НомерЗаказа= УбратьНули(НомерЗаказа,Контрагент.УбиратьНулиПередНомеромЗаказа);
			
			Попытка
				ДокОбъект.ДатаЗаказа=Дата(СтрЗаменить(ДатаЗаказа, "-", ""));
				ДокОбъект.ДатаОтгрузки=Дата(СтрЗаменить(ДатаДоставки, "-", ""));
			Исключение
			КонецПопытки;
			
			
			ДокОбъект.КодПоставщика=КодПоставщикаКонтрагента;
			
			ДокОбъект.Регион = Регион;
			ТипШК=перечисления.ТипыШтрихКодов.Штука;
			
			ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;		
			ДокОбъект.ТипЦен=ТипЦен; //Контрагент.ТипЦен;
			ДокОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН;
			ДокОбъект.Подразделение = Подразделение;
			ДокОбъект.ЛевыйКонтрагент=Контрагент;
			ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
			ДокОбъект.Отгружен=перечисления.Отгружен.Резерв;
			ДокОбъект.ПунктДоставки=ПунктДоставки;
			ДокОбъект.Склад=Склад;		
			УстановитьНомерДокументаКлиентСервер(ДокОбъект);
			ДокОбъект.Валюта=Справочники.Валюты.НайтиПоКоду("810");
			ДокОбъект.Автор	=Неопределено;
			
			//крохин начало 02.08.2021
			//Если СокрЛП(Контрагент.Код)=КодМетро И (Лев(ДокОбъект.Номер,3)<>"SSP" или Лев(ДокОбъект.Номер,3)<>"SST") Тогда
			Если СокрЛП(Контрагент.Код)=КодМетро И (Лев(ДокОбъект.Номер,3)<>"SSP" или Лев(ДокОбъект.Номер,3)<>"SST" или Лев(ДокОбъект.Номер,3)<>"SSV") Тогда
				//крохин конец 02.08.2021
				УстановитьНомерДокументаКлиентСервер(ДокОбъект);	
			КонецЕсли;
			
			ДокОбъект.КодОперации=Перечисления.КодыОперацийОстатки.Реализация;
			ДокОбъект.ДатаОформления	=ДокОбъект.Дата;
			
			//Валетов + 30.06.2026 Изменение 0000000060
			//ДокОбъект.ДатаОплаты	    =ПолучитьДатуОплаты1(ДокОбъект.ДатаОтгрузки,ДокОбъект.ОтсрочкаПлатежа);	
			ПараметрыРасчетаДатыОплаты  = ОбщегоНазначенияКС.ПолучитьЗаполнитьПараметрыРасчетаДатыОплатыПоДокументу(ДокОбъект);
			ДокОбъект.ДатаОплаты 		= ОбщегоНазначенияКС.ПолучитьДатуОплатыПоДокументуКлиентСервер(ПараметрыРасчетаДатыОплаты); 
			//Валетов-
			
			СкидкаКонтрагента=ПолучитьРеквизитРодителя(Контрагент,"Скидка");
			ДокОбъект.Скидка=СкидкаКонтрагента;
			
			ПересчетТЧ(ДокОбъект,"Товары",ДокОбъект.Валюта,ДокОбъект.Валюта,ДокОбъект.Курс,ДокОбъект.Курс,Истина);	
			
			
			//проверим на пустые цены!!
			//нечаева 15,03,16+++
			
			ОтборНулевыеЦены=новый Структура("Цена",0);
			МассивНулевыхЦен=ДокОбъект.Товары.НайтиСтроки(ОтборНулевыеЦены);
			
			
			Для каждого текстрока из МассивНулевыхЦен цикл
				
				Отбор2=новый Структура("номенклатура",ТекСтрока.номенклатура);
				тстрока=ДокОбъект.Товары.НайтиСтроки(Отбор2);
				Ошибки.Добавить("Для товара -  "+ТекСтрока.номенклатура +" Цена =0, не записано в заказе, проверьте матрицу! " );
				ТекНом =тстрока[0].НомерСтроки; //.удалить()
				докобъект.товары.Удалить(ТекНом-1);
				
			КонецЦикла;
			//нечаева 15,03,16---
			
			
			Попытка
				ДокОбъект.Записать(режимЗаписиДокумента.Запись);
				Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
				//Сообщить("Записан документ - "+ДокОбъект.Дата+" "+ДокОбъект.Номер);
				// записать номер в "ошибки" для вывода менеджерам
			Исключение
				// Катаев+ 22/08/13 Если возникла ошибка с уникальностью номера, то пробуем обновить нумерацию объектов и сгенерировать номер заново
				Инфо = ИнформацияОбОшибке();
				Если Найти(Инфо.Описание, "Не уникальный номер документа") > 0 Тогда
					ОбновитьНумерациюОбъектов();
					УстановитьНомерДокументаКлиентСервер(ЭтотОбъект);
					Попытка
						ДокОбъект.Записать(режимЗаписиДокумента.Запись);
						Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
					Исключение
						Если ПризКр=0 тогда
							КритичОшибки.Добавить("После обновления нумерации для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
							//Катаев+ 11/12/14
							Отказ = Истина;
							//Катаев- 11/12/14
						конецЕсли;
					КонецПопытки;
				Иначе	
					Если ПризКр=0 тогда
						КритичОшибки.Добавить("Для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
						//КритичОшибки.Добавить("Для заказа Заказ из ECODE №"+НомерЗаказа+" документ не записан! "+ОписаниеОшибки() );
						//Катаев+ 11/12/14
						Отказ = Истина;
						//Катаев- 11/12/14
					конецЕсли;
				КонецЕсли;
				// Катаев- 22/08/13
				//Сообщить(ОписаниеОшибки());
			КонецПопытки;
			//сообщить("    документ записан");
			ПризКр=ПризКр+1;
			
			
		КонецЦикла;
	КонецЦикла;
	// конец заполнения документа
	
КонецПроцедуры
//нечаева 09,09,19---


//Катаев+ 29/03/13 Для Зельгроса своя загрузка
Процедура ОбработкаДанныхЗагрузкиЗельгрос(Шапка,Строки)
	
	СтрШапка=Шапка.Получить(0);
	ТипЦен=Справочники.ТипыЦен.ПустаяСсылка();
	ТипСкидки=Справочники.ТипыСкидок.ПустаяСсылка();
	Организация=Неопределено;
	Менеджер=Неопределено;
	Регион=Неопределено;
	Договор=Неопределено;
	Подразделение=Неопределено;
	ОтсрочкаПлатежа=Неопределено;
	КодПоставщикаКонтрагента=Неопределено;
	ПунктДоставки=Неопределено;
	НомерЗаказа=Неопределено;
	ТипILNКонтрагента=Неопределено;
	ДатаЗаказа=Неопределено;
	ДатаОтгрузки=Неопределено;
	Склад=Неопределено;   //Справочники.Склады.НайтиПоКоду("STA-61");
	Контрагент=СтрШапка.Контрагент;
	Если Контрагент=Неопределено тогда
		Контрагент=Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;	
	ПунктДоставки=СтрШапка.ПунктДоставки;
	НомЗаказа=СтрШапка.НомЗаказа;
	НомерЗаказа=СтрШапка.НомЗаказа;
	ДатаЗаказа=СтрШапка.ДатаЗаказа;
	ДатаДоставки=СтрШапка.ДатаДоставки;
	ТипILNКонтрагента=СтрШапка.ТипILNКонтрагента;
	
	ПризКр=0;
	//сообщить("    запись документа");
	Если не Контрагент.Пустая() Тогда 	
		// 1. Обрабатываем количество, делаем округление  соответствуещее коли-ву в блочке
		Если Контрагент.ОткруглятьКоличество Тогда
			
			Для каждого ТекСтрока Из Строки Цикл
				ПризКратности=1;
				Ном=ТекСтрока.Номенклатура;
				КолЗаказано=ТекСтрока.Колво;
				
				Если НЕ ТипЗнч(Ном) = Тип("СправочникСсылка.Номенклатура") Тогда
					ТекСтрока.КолвоОтредактированное=КолЗаказано;
					продолжить;
				КонецЕсли;
				
				ШтукВКор=Ном.Родитель.ШтукВКоробочке;
				Если ШтукВКор-0>0 Тогда 
					// проверяем на кратность 5 или 6
					Если (ШтукВКор/5)=Цел((ШтукВКор/5)) Тогда
						ПризКратности=5
					ИначеЕсли (ШтукВКор/6)=Цел((ШтукВКор/6)) Тогда
						ПризКратности=6
					Иначе
						ПризКратности=1;
					КонецЕсли;
					
					Если (КолЗаказано/ПризКратности)<>Цел((КолЗаказано/ПризКратности)) Тогда
						КолУпак=Цел(Окр(КолЗаказано/ПризКратности,0,0));
						НовКолво=КолУпак*ПризКратности;
						ТекСтрока.КолвоОтредактированное=НовКолво;
					Иначе
						ТекСтрока.КолвоОтредактированное=КолЗаказано;
					Конецесли;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для каждого ТекСтрока Из Строки Цикл
				Если ТекСтрока.Единица<>"Блочок" Тогда
					КолЗаказано=ТекСтрока.Колво;
					ТекСтрока.КолвоОтредактированное=КолЗаказано;
				Иначе
					Попытка
						КолЗаказано=ТекСтрока.Колво*ТекСтрока.ВУпак;
						ТекСтрока.КолвоОтредактированное=КолЗаказано;
					исключение
						КолЗаказано=ТекСтрока.Колво;
						ТекСтрока.КолвоОтредактированное=КолЗаказано;
					КонецПопытки;	
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		// 2. проверяем дублированный заказ есть или нет. в пределах недели;
		Если Контрагент.ПроверятьНаличиеЗаказа Тогда
			
			Дата1=ТекущаяДата();
			Дата2=ТекущаяДата() - 60 * 60 * 24 * 7; // неделя назад;
			
			Запрос=новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	РасходнаяНакладная.Номер,
			|	РасходнаяНакладная.Дата,
			|	РасходнаяНакладная.Ссылка
			|ИЗ
			|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
			|ГДЕ
			|	РасходнаяНакладная.Контрагент = &Контрагент
			|	И РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
			|	И РасходнаяНакладная.Дата МЕЖДУ НачалоПериода(&Дата2) И КонецПериода(&Дата1)";
			
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("ПунктДоставки",ПунктДоставки);
			Запрос.УстановитьПараметр("Дата1",Дата1);
			Запрос.УстановитьПараметр("Дата2",Дата2);
			
			Рез=Запрос.Выполнить().Выбрать();
			
			// добавляем в сообщения менеджерам
			Пока Рез.Следующий() Цикл
				Строка="Для заказа ЕКОДЕ № "+НомЗаказа+" существует копия заказа РНК №"+Рез.Номер+" от "+Рез.Дата;
				Ошибки.Добавить(Строка);
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	// 3. разбивка по складам, создаем несколько документов. 
	// выбираем различные склады, и в цикла по кадому выбираем номеклатуру и создаем документы;
	
	// загрузка ТЗ в запрос
	//--------------------------------------------
	ТЗСклады=Строки;
	
	// создается для временной таблицы
	ТЗ  = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТЗ.Колонки.Добавить("Найдена", Новый ОписаниеТипов("Число"));
	
	Запрос = Новый Запрос;
	ДанныеСкладов=Неопределено;
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст  = "ВЫБРАТЬ различные
	|    ТЗ.Склад как Склад,
	|    ТЗ.Найдена
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|    &ТЗ КАК ТЗ";
	
	Запрос.УстановитьПараметр("ТЗ", ТзСклады);
	Запрос.Выполнить();
	
	Запрос.Текст="ВЫБРАТЬ
	|	ТЗ.Склад КАК Склад,
	|	ТЗ.Найдена
	|ИЗ
	|	ТЗ КАК ТЗ
	|ГДЕ
	|	ТЗ.Найдена = 1";
	РезультатСклады=Запрос.Выполнить().Выбрать();
	
	Если РезультатСклады.Количество()=0 Тогда
		// пустой документ! не формируем ?
		Склад=Справочники.Склады.НайтиПоКоду("STA-61");
		// Катаев+ 21/03/13 Создавать новый документ надо только для оригинала
		//ДокОбъект=Документы.РасходнаяНакладная.СоздатьДокумент();
		//ДокОбъект = ПолучитьНакладную(Склад, Шапка.НомЗаказа, Шапка.ДатаЗаказа, Шапка.ТипЗаказа);
		ДокОбъект = ПолучитьНакладную(Склад, Шапка[0].НомЗаказа, Шапка[0].ДатаЗаказа, Шапка[0].ТипЗаказа);
		Если ДокОбъект = Неопределено Тогда
			Возврат;
		КонецЕсли;
		// Катаев- 21/03/13
		//-----------------------------------------------------------------------------------------
		//    автозаполнение параметров шапки документа, разница в шапке - в складе отгрузки
		//-----------------------------------------------------------------------------------------
		Если не Контрагент.Пустая() Тогда 	
			//------------------------------------------
			Организация=Справочники.Организации.НайтиПоКоду("SSP-12"); //КБ- Стиль
			ТипЦен=Контрагент.ТипЦен;
			Договор=Контрагент.ОсновнойДоговор;
			Если не (Договор=Неопределено) и не (Договор=справочники.Договоры.ПустаяСсылка()) Тогда
				//ТипЦен		=Договор.ТипЦен;
				ОтсрочкаПлатежа =Договор.ОтсрочкаПлатежа;
				Если ЗначениеЗаполнено(Договор.Организация) Тогда
					Организация=Договор.Организация;		
				КонецЕсли;
			КонецЕсли;
			//----  доп. обработка;
			ДокОбъект.ДопОбработки.Очистить();
			Для Каждого СтрокаТЧ Из Контрагент.ВидыДопОбработок Цикл
				СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
			КонецЦикла; 
			//нечаева 23,03,17+++
			// добавляем из пункта доставки доп. обработки.
			Попытка
				Для Каждого СтрокаТЧ Из ПунктДоставки.ВидыДопОбработок Цикл
					СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
				КонецЦикла;  
			Исключение
			конецПопытки;
			//нечаева 23,03,17---
			
			//-----------------------------------------------
			Менеджер=Контрагент.Менеджер;
			Если Менеджер=Неопределено или Менеджер=Справочники.ФизическиеЛица.ПустаяСсылка() и ПризКр=0 Тогда
				КритичОшибки.Добавить("Для контрагента "+контрагент.наименование+"  код - "+контрагент.код+"  не определен менеджер! Заказ екоде №"+ Номерзаказа );
			Иначе
				Если Не СтрДлина(Менеджер.Емэйл)>2  и ПризКр=0   Тогда
					КритичОшибки.Добавить("Для менеджера "+Менеджер.наименование+"  код - "+Менеджер.код+"  не определен ЕМэйл!" );
				КонецЕсли;
			КонецЕсли;
			
			//Катаев+ 06/08/14 Из ЕКОД все контрагенты грузятся с использованием номенклатурной матрицы. Проверку убрал
			//Если Контрагент.ТипЦен=Справочники.ТипыЦен.ПустаяСсылка() и ПризКр=0 и Контрагент.код<>"SSP-3674" Тогда
			//	//Катаев+ 17/10/13 Проверяем есть ли тип цены по пункту доставки
			//	//КритичОшибки.Добавить("Для контрагента "+Контрагент.Наименование+" не установлен тип цен по умолчанию!");
			//	Если ПунктДоставки = Неопределено Тогда
			//		КритичОшибки.Добавить("Для контрагента "+Контрагент.Наименование+" не установлен тип цен по умолчанию!");
			//	Иначе
			//		Если Не ЗначениеЗаполнено(ПунктДоставки.ТипЦен) Тогда
			//			КритичОшибки.Добавить("Для контрагента "+Контрагент.Наименование+" не установлен тип цен по умолчанию!");
			//		КонецЕсли;
			//	КонецЕсли;
			//	//Катаев- 17/10/13
			//КонецЕсли;
			//Катаев- 06/08/14
			Подразделение = Контрагент.Менеджер.Подразделение;
			
			//------------------------
			// код поставщика
			//------------------------
			КодПоставщикаКонтрагента=Контрагент.КодПоставщика;
			Если КодПоставщикаконтрагента.пустая() ИЛИ кодПоставщикаКонтрагента=Неопределено Тогда
				// Берем первую из справочника коды контрагентов
				Запрос=Новый Запрос;
				Запрос.Текст="ВЫБРАТЬ
				|	КодыПоставщиков.Ссылка
				|ИЗ
				|	Справочник.КодыПоставщиков КАК КодыПоставщиков
				|ГДЕ
				|	КодыПоставщиков.Владелец = &Контрагент
				|	И (КодыПоставщиков.Организация = &ТекОрганизация
				|			ИЛИ КодыПоставщиков.Организация = &Контр2)";
				Запрос.УстановитьПараметр("Контрагент",Контрагент);		
				Запрос.УстановитьПараметр("Контр2",Справочники.Контрагенты.ПустаяСсылка());		
				Запрос.УстановитьПараметр("ТекОрганизация",Организация);		
				Результат=Запрос.Выполнить().Выбрать();
				// катаев+ 28/02/13 Исправление ошибки
				//Пока Результат.Следующий() Цикл
				//	КодПоставщикаКонтрагента=Результат.ссылка;
				//	возврат;
				//КонецЦикла;
				Если Результат.Следующий() Тогда
					КодПоставщикаКонтрагента=Результат.ссылка;
				КонецЕсли;
				// Катаев- 28/02/13
				//Катаев+ 16/07/14
				//// если ашан то :
				//Если контрагент=Справочники.Контрагенты.НайтиПоКоду("SSP-2450") ТОгда
				//	Если Склад=Справочники.Склады.НайтиПоКоду("STA-61") тОгда
				//		КодПоставщикаКонтрагента=Справочники.КодыПоставщиков.НайтиПоКоду("SSP-000003");
				//	Иначе
				//		КодПоставщикаКонтрагента=Справочники.КодыПоставщиков.НайтиПоКоду("SSP-000002");
				//	КонецЕсли;
				//КонецЕсли;
				//Катаев- 16/07/14
				
			КонецЕсли;
			
		КонецЕсли;
		
		//----------------------------------------------
		//доставка
		Если не ПунктДоставки=Неопределено  Тогда 
			Если ЗначениеЗаполнено(ПунктДоставки.РайонДоставки) Тогда
				РайонДоставки=ПунктДоставки.РайонДоставки;	
				ДокОбъект.РайонДоставки=РайонДоставки;
			КонецЕсли;	
			Если ЗначениеЗаполнено(ПунктДоставки.Регион) Тогда
				Регион=ПунктДоставки.Регион;
				ДокОбъект.Регион=Регион;
			КонецЕсли;	
			//Катаев+ 10/04/14 Транспортная компания заполняется только если выбран тип доставки = "ТранспортнаяКомпания"
			//Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
			//	ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
			//	ДокОбъект.ТранспортнаяКомпания=ТранспортнаяКомпания;
			//КонецЕсли;	
			//Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
			//	ПунктПерегруза=ПунктДоставки.ПунктПерегруза;	
			//	ДокОбъект.ПунктПерегруза=ПунктПерегруза;
			//КонецЕсли;		
			Если ПунктДоставки.ТипДоставки = Перечисления.ТипыДоставки.ТранспортнаяКомпания Тогда
				Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
					ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
					ДокОбъект.ТранспортнаяКомпания=ТранспортнаяКомпания;
				КонецЕсли;
				Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
					ПунктПерегруза=ПунктДоставки.ПунктПерегруза;	
					ДокОбъект.ПунктПерегруза=ПунктПерегруза;
				КонецЕсли;		
			КонецЕсли;
			//Катаев- 10/04/14
			Если ЗначениеЗаполнено(ПунктДоставки.Грузополучатель) Тогда
				Грузополучатель=ПунктДоставки.Грузополучатель;		
				ДокОбъект.Грузополучатель=Грузополучатель;
			КонецЕсли;
			Если ЗначениеЗаполнено(ПунктДоставки.Получатель) Тогда
				Получатель=ПунктДоставки.Получатель;		
				ДокОбъект.Получатель=Получатель;
			КонецЕсли;
			Если ЗначениеЗаполнено(ПунктДоставки.ОтсрочкаПлатежа) Тогда
				ОтсрочкаПлатежа=ПунктДоставки.ОтсрочкаПлатежа;		
				ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;
			КонецЕсли;
			
			//типы цен скидки
			Если ЗначениеЗаполнено(ПунктДоставки.ТипЦен) И ТипЦен<>ПунктДоставки.ТипЦен Тогда
				ТипЦен=ПунктДоставки.ТипЦен;		
			КонецЕсли; 
			Если ЗначениеЗаполнено(ПунктДоставки.ТипСкидок) И ДокОбъект.ТипСкидок<>ПунктДоставки.ТипСкидок Тогда
				ТипСкидок=ПунктДоставки.ТипСкидок;		
			КонецЕсли;
			Если ПунктДоставки.Скидка<>0 И ПунктДоставки.Скидка<>ДокОбъект.Скидка Тогда
				Скидка=ПунктДоставки.Скидка;		
				ДокОбъект.Скидка=Скидка;
			КонецЕсли;
		КонецЕсли;
		//-------------------------------------------------------------------		
		
		ДокОбъект.Дата=ТекущаяДата();
		ЗаполнитьШапкуДокумента(ДокОбъект, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
		//УстановитьНомерДокументаКлиентСервер(ДокОбъект);
		ДокОбъект.Контрагент=Контрагент;
		ДокОбъект.Организация=Организация;
		ДокОбъект.Договор=Договор;
		ДокОбъект.ИБ=Справочники.ИБ.НайтиПоКоду("SSP");
		ДокОбъект.Менеджер= Менеджер;
		ДокОбъект.НомерЗаказа= УбратьНули(НомЗаказа,Контрагент.УбиратьНулиПередНомеромЗаказа);
		
		Попытка
			ДокОбъект.ДатаЗаказа=Дата(СтрЗаменить(ДатаЗаказа, "-", ""));
			ДокОбъект.ДатаОтгрузки=Дата(СтрЗаменить(ДатаДоставки, "-", ""));
		Исключение
		КонецПопытки;
		
		
		
		ДокОбъект.КодПоставщика=КодПоставщикаКонтрагента;
		
		ДокОбъект.Регион = Регион;
		ТипШК=перечисления.ТипыШтрихКодов.Штука;
		
		ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;		
		ДокОбъект.ТипЦен=ТипЦен; //Контрагент.ТипЦен;
		ДокОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН;
		ДокОбъект.Подразделение = Подразделение;
		ДокОбъект.ЛевыйКонтрагент=Контрагент;
		ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
		ДокОбъект.Отгружен=перечисления.Отгружен.Резерв;
		ДокОбъект.ПунктДоставки=ПунктДоставки;
		ДокОбъект.Склад=Склад;		
		УстановитьНомерДокументаКлиентСервер(ДокОбъект);
		ДокОбъект.Валюта=Справочники.Валюты.НайтиПоКоду("810");
		//ДокОбъект.Автор				=Неопределено;
		
		Если СокрЛП(Контрагент.Код)=КодМетро И (Лев(ДокОбъект.Номер,3)<>"SSP" или Лев(ДокОбъект.Номер,3)<>"SST") Тогда
			УстановитьНомерДокументаКлиентСервер(ДокОбъект);	
		КонецЕсли;
		
		ДокОбъект.КодОперации=Перечисления.КодыОперацийОстатки.Реализация;
		ДокОбъект.ДатаОформления	=ДокОбъект.Дата;
		СкидкаКонтрагента=ПолучитьРеквизитРодителя(Контрагент,"Скидка");
		ДокОбъект.Скидка=СкидкаКонтрагента;
		
		ПересчетТЧ(ДокОбъект,"Товары",ДокОбъект.Валюта,ДокОбъект.Валюта,ДокОбъект.Курс,ДокОбъект.Курс,Истина);	
		Если Контрагент.КодИЛН<>"9008727000007" Тогда
			Попытка
				ДокОбъект.Записать(режимЗаписиДокумента.Запись);
				Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
				//Сообщить("Записан документ - "+ДокОбъект.Дата+" "+ДокОбъект.Номер);
			Исключение
				// Катаев+ 22/08/13 Если возникла ошибка с уникальностью номера, то пробуем обновить нумерацию объектов и сгенерировать номер заново
				Инфо = ИнформацияОбОшибке();
				Если Найти(Инфо.Описание, "Не уникальный номер документа") > 0 Тогда
					ОбновитьНумерациюОбъектов();
					УстановитьНомерДокументаКлиентСервер(ЭтотОбъект);
					Попытка
						ДокОбъект.Записать(режимЗаписиДокумента.Запись);
						Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
					Исключение
						Если ПризКр=0 тогда
							КритичОшибки.Добавить("После обновления нумерации для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
						конецЕсли;
					КонецПопытки;
				Иначе	
					Если ПризКр=0 тогда
						КритичОшибки.Добавить("Для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
					конецЕсли;
				КонецЕсли;
				// Катаев- 22/08/13
			КонецПопытки;
		КонецЕсли;
		//сообщить("    документ записан");
		ПризКр=ПризКр+1;
		
	КонецЕсли;
	//-------------------------------------------------------------------------------------------------------------------------------------------
	//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
	// когда складов несколько и есть данные, которые нашлись
	//-------------------------------------------------------------------------------------------------------------------------------------------
	
	КоличествоСкладов=РезультатСклады.Количество();
	//---------------------------------------------------------------------------------
	//                          по циклу смотрим данные
	//-------------------------------------------------------------------------------------
	Пока РезультатСклады.Следующий() цикл
		
		// формируем документ по складу
		//---------------------------------------------------------------------	
		// выбираем строки номенклатуры по складу, заполняем строки
		
		Склад=РезультатСклады.Склад;
		// Катаев+ 21/03/13 Создавать новый документ надо только для оригинала
		//ДокОбъект=Документы.РасходнаяНакладная.СоздатьДокумент();
		//ДокОбъект = ПолучитьНакладную(Склад, Шапка.НомЗаказа, Шапка.ДатаЗаказа, Шапка.ТипЗаказа);
		// Катаев+ 23/04/13 Не там стоит создание РНК
		//ДокОбъект = ПолучитьНакладную(Склад, Шапка[0].НомЗаказа, Шапка[0].ДатаЗаказа, Шапка[0].ТипЗаказа);
		//Если ДокОбъект = Неопределено Тогда
		//	Возврат;
		//КонецЕсли;
		//Катаев- 23/04/13
		// Катаев- 21/03/13
		//----------------------------------------------------------------------
		
		ТЗ2  = Новый ТаблицаЗначений;
		ТЗ2.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
		ТЗ2.Колонки.Добавить("Найдена", Новый ОписаниеТипов("Число"));
		ТЗ2.Колонки.Добавить("КолвоОтредактированное",Новый ОписаниеТипов("Число"));
		ТЗ2.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		
		Запрос = Новый Запрос;
		ДанныеСкладов=Неопределено;
		МВТ = Новый МенеджерВременныхТаблиц;
		Запрос.МенеджерВременныхТаблиц = МВТ;
		Запрос.Текст  = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗ2.Склад КАК Склад,
		|	ТЗ2.Номенклатура, 
		|	ТЗ2.КолвоОтредактированное,
		|	ТЗ2.Найдена,
		|	ТЗ2.НомерСтроки,
		|	ТЗ2.ПризнакГруппыНом
		|ПОМЕСТИТЬ ТЗ2
		|ИЗ
		|	&ТЗ2 КАК ТЗ2
		|ГДЕ
		|	ТЗ2.Склад = &ТекСклад
		|	И ТЗ2.Найдена = 1";
		Запрос.УстановитьПараметр("ТекСклад",Склад);
		Запрос.УстановитьПараметр("ТЗ2", ТзСклады);
		Запрос.Выполнить();
		
		Запрос.Текст="ВЫБРАТЬ
		|	ТЗ2.Склад КАК Склад,
		|	ТЗ2.Номенклатура,
		|	ТЗ2.КолвоОтредактированное,
		|	ТЗ2.Найдена,
		|	ТЗ2.НомерСтроки КАК НомерСтроки,
		|	ТЗ2.ПризнакГруппыНом
		|ИЗ
		|	ТЗ2 КАК ТЗ2
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		//Катаев+ 02/04/13
		//РезНом=Запрос.Выполнить().Выбрать();
		РезНом=Запрос.Выполнить().Выгрузить();
		//Катаев- 02/04/13
		
		РезНом1=Новый ТаблицаЗначений;
		РезНом2=Новый ТаблицаЗначений;
		РезНом3=Новый ТаблицаЗначений;
		РезНом4=Новый ТаблицаЗначений;
		РезНом5=Новый ТаблицаЗначений;
		РезНом6=Новый ТаблицаЗначений;
		
		
		// Сформировать структуру отбора. 
		// Найти строки. 
		
		Отбор1 = Новый Структура();
		Отбор1.Вставить("ПризнакГруппыНом", 1); 
		РезНом1 = РезНом.НайтиСтроки(Отбор1); // колготки
		
		Отбор2 = Новый Структура();
		Отбор2.Вставить("ПризнакГруппыНом", 2); 
		РезНом2 = РезНом.НайтиСтроки(Отбор2); // белье
		
		Отбор3 = Новый Структура();
		Отбор3.Вставить("ПризнакГруппыНом", 5); 
		РезНом5 = РезНом.НайтиСтроки(Отбор3); // все остальное		
		
		Отбор3 = Новый Структура();
		Отбор3.Вставить("ПризнакГруппыНом", 3); 
		РезНом3 = РезНом.НайтиСтроки(Отбор3);   // детские носки
		// ------------------------------------------------------------------------------------------------
		Для НомПриз=1 По 5 Цикл
			
			Результат=Неопределено;
			
			
			Если НомПРиз=1 ТОгда
				Если РезНом1.количество()>0  Тогда
					//Катаев+ 23/04/13 Для каждой группы создается своя РНК
					ДокОбъект = ПолучитьНакладную(Склад, Шапка[0].НомЗаказа, Шапка[0].ДатаЗаказа, Шапка[0].ТипЗаказа);
					Если ДокОбъект = Неопределено Тогда
						Возврат;
					КонецЕсли;
					//Катаев- 23/04/13
					Результат=резном1;
				конецЕсли;
			КонецЕсли;	
			
			Если НомПРиз=5 ТОгда
				Если РезНом5.количество()>0 Тогда
					//Катаев+ 23/04/13 Для каждой группы создается своя РНК
					ДокОбъект = ПолучитьНакладную(Склад, Шапка[0].НомЗаказа, Шапка[0].ДатаЗаказа, Шапка[0].ТипЗаказа);
					Если ДокОбъект = Неопределено Тогда
						Возврат;
					КонецЕсли;
					//Катаев- 23/04/13
					Результат=резном5;
				конецЕсли;
			КонецЕсли;
			
			Если НомПРиз=2 ТОгда
				Если РезНом2.количество()>0 Тогда
					//Катаев+ 23/04/13 Для каждой группы создается своя РНК
					ДокОбъект = ПолучитьНакладную(Склад, Шапка[0].НомЗаказа, Шапка[0].ДатаЗаказа, Шапка[0].ТипЗаказа);
					Если ДокОбъект = Неопределено Тогда
						Возврат;
					КонецЕсли;
					//Катаев- 23/04/13
					Результат=резном2;
				конецЕсли;
			КонецЕсли;
			
			Если НомПРиз=3 ТОгда
				Если РезНом3.количество()>0 Тогда
					//Катаев+ 23/04/13 Для каждой группы создается своя РНК
					ДокОбъект = ПолучитьНакладную(Склад, Шапка[0].НомЗаказа, Шапка[0].ДатаЗаказа, Шапка[0].ТипЗаказа);
					Если ДокОбъект = Неопределено Тогда
						Возврат;
					КонецЕсли;
					//Катаев- 23/04/13
					Результат=резном3;
				конецЕсли;
			КонецЕсли;
			
			
			Если Результат=Неопределено Тогда
				продолжить;
			КонецЕсли;
			
			//Состояние(""+Контрагент+" "+Склад);
			
			Если НЕ Результат[0].Склад=Склад Тогда
				продолжить;
			КонецЕсли;	
			Для Каждого ТекущаяСтрока Из Результат Цикл 
				строкатовара = 	ДокОбъект.Товары.Добавить();
				//Катаев+ 02/04/13
				//строкатовара.Номенклатура =РезНом.Номенклатура;
				//строкатовара.Заявка = РезНом.КолвоОтредактированное;
				//строкатовара.Количество = РезНом.КолвоОтредактированное;
				//строкатовара.ПодтвержденнаяЗаявка = РезНом.КолвоОтредактированное;
				строкатовара.Номенклатура =ТекущаяСтрока.Номенклатура;
				строкатовара.Заявка = ТекущаяСтрока.КолвоОтредактированное;
				строкатовара.Количество = ТекущаяСтрока.КолвоОтредактированное;
				строкатовара.ПодтвержденнаяЗаявка = ТекущаяСтрока.КолвоОтредактированное;
				//Катаев- 02/04/13
				ПриИзмененииНоменклатурыТабЧасти(строкатовара, ДокОбъект);
				РассчитатьСуммуТабЧасти(строкатовара, ДокОбъект);
			КонецЦикла;
			
			//-----------------------------------------------------------------------------------------
			//    автозаполнение параметров шапки документа, разница в шапке - в складе отгрузки
			//-----------------------------------------------------------------------------------------
			
			Если не Контрагент.Пустая() Тогда 	
				//------------------------------------------
				Организация=Справочники.Организации.НайтиПоКоду("SSP-12"); //КБ- Стиль
				ТипЦен=Контрагент.ТипЦен;
				Договор=Контрагент.ОсновнойДоговор;
				Если не (Договор=Неопределено) и не (Договор=справочники.Договоры.ПустаяСсылка()) Тогда
					//ТипЦен		=Договор.ТипЦен;
					ОтсрочкаПлатежа =Договор.ОтсрочкаПлатежа;
					Если ЗначениеЗаполнено(Договор.Организация) Тогда
						Организация=Договор.Организация;		
					КонецЕсли;
				КонецЕсли;
				
				//-----------------  доп. обработка   --------------------------------------------------------
				ДокОбъект.ДопОбработки.Очистить();
				
				Для Каждого СтрокаТЧ Из Контрагент.ВидыДопОбработок Цикл
					
					Если СокрЛП(Контрагент.Код)="SSP-8643"  или СокрЛП(Контрагент.Код)="SSP-2412"  Тогда  
						// для метро и реал  делаем спец. обработку. 
						
						//Если КоличествоСкладов>1 И (Склад.код="SNL-79" или Склад.код="SNL-22") Тогда     
						//нечаева поменяла склад 22,01,15++
						Если КоличествоСкладов>1  И (Склад.код="STA-10" или Склад.код="STA-20") Тогда      
							//нечаева поменяла склад 22,01,15++
							
							// если склад белье, то одну доп обработку не берем.
							Если СтрокаТЧ.ДопОбработка.Код="ODB-00017" Тогда
								продолжить; // не пишем эту доп обработку.   палетный ярлык не пишем
							КонецЕсли;
						КонецЕсли;
						
						//	СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
						//	СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка; // остальные стандартные добавляем
						
					КонецЕсли;
					
					СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка; // остальные ст
				КонецЦикла;  
				
				//нечаева 23,03,17+++
				// добавляем из пункта доставки доп. обработки.
				Попытка
					Для Каждого СтрокаТЧ Из ПунктДоставки.ВидыДопОбработок Цикл
						СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
						СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
					КонецЦикла;  
				Исключение
				КонецПопытки;
				//нечаева 23,03,17---
				
				
				// бельевой склад          
				//Если СокрЛП(Контрагент.Код)="SSP-2412" И (Склад.код="SNL-79" или Склад.код="SNL-22") Тогда 
				
				//нечаева поменяла склад 22,01,15++
				Если СокрЛП(Контрагент.Код)="SSP-2412" И (Склад.код="STA-10" или Склад.код="STA-20") Тогда 
					//нечаева поменяла склад 22,01,15++
					
					
					
					
					// реал
					
					СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("ODB-00018"); // интри
					попытка
						СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
						СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("SNL-00031"); // белье на вешалках реал
					исключение
					конецпопытки;
					
				КонецЕсли;
				// бельевой склад
				//Если СокрЛП(Контрагент.Код)="SSP-8643" И (Склад.код="SNL-79" или Склад.код="SNL-22") Тогда 
				//нечаева поменяла склад 22,01,15++
				Если СокрЛП(Контрагент.Код)="SSP-8643" И (Склад.код="STA-10" или Склад.код="STA-20") Тогда 
					//нечаева поменяла склад 22,01,15++
					
					// метро 
					попытка
						СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
						СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("SNL-00036"); // белье на вешалках метро				
					исключение
					конецпопытки;
				КонецЕсли;
				
				// когда колготочный склад
				Если СокрЛП(Контрагент.Код)="SSP-8643" И (Склад.код="STA-61" или Склад.код="SNL-82") Тогда 
					// метро 
					попытка
						СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
						//СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("ODN-00014");  // антикражка + поставщик  				
						//Теперь другая ДО
						//СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("ODN-00014");  // антикражка + поставщик 	
						СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("OD7-00101");  // антикражка + поставщик 
						//Кухарь 28.06.17 конец
						
					исключение
					конецпопытки;
				КонецЕсли;
				
				
				
				//-------------------------------------------------------------------------------------------
				Менеджер=Контрагент.Менеджер;
				Если Менеджер=Неопределено или Менеджер=Справочники.ФизическиеЛица.ПустаяСсылка() и ПризКр=0 Тогда
					КритичОшибки.Добавить("Для контрагента "+контрагент.наименование+"  код - "+контрагент.код+"  не определен менеджер! Заказ екоде №"+ Номерзаказа );
				Иначе
					Если Не СтрДлина(Менеджер.Емэйл)>2  и ПризКр=0   Тогда
						КритичОшибки.Добавить("Для менеджера "+Менеджер.наименование+"  код - "+Менеджер.код+"  не определен ЕМэйл!" );
					КонецЕсли;
				КонецЕсли;
				
				//Катаев+ 06/08/14 Из ЕКОД все контрагенты грузятся с использованием номенклатурной матрицы. Проверку убрал
				//Если Контрагент.ТипЦен=Справочники.ТипыЦен.ПустаяСсылка() и ПризКр=0 и Контрагент.код<>"SSP-3674" Тогда
				//	//Катаев+ 17/10/13 Проверяем есть ли тип цены по пункту доставки
				//	//КритичОшибки.Добавить("Для контрагента "+Контрагент.Наименование+" не установлен тип цен по умолчанию!");
				//	Если ПунктДоставки = Неопределено Тогда
				//		КритичОшибки.Добавить("Для контрагента "+Контрагент.Наименование+" не установлен тип цен по умолчанию!");
				//	Иначе
				//		Если Не ЗначениеЗаполнено(ПунктДоставки.ТипЦен) Тогда
				//			КритичОшибки.Добавить("Для контрагента "+Контрагент.Наименование+" не установлен тип цен по умолчанию!");
				//		КонецЕсли;
				//	КонецЕсли;
				//	//Катаев- 17/10/13
				//КонецЕсли;
				//Катаев- 06/08/14
				Подразделение = Контрагент.Менеджер.Подразделение;
				
				//------------------------
				// код поставщика
				//------------------------
				КодПоставщикаКонтрагента=Контрагент.КодПоставщика;
				Если КодПоставщикаконтрагента.пустая() ИЛИ кодПоставщикаКонтрагента=Неопределено Тогда
					// Берем первую из справочника коды контрагентов
					Запрос=Новый Запрос;
					Запрос.Текст="ВЫБРАТЬ
					|	КодыПоставщиков.Ссылка
					|ИЗ
					|	Справочник.КодыПоставщиков КАК КодыПоставщиков
					|ГДЕ
					|	КодыПоставщиков.Владелец = &Контрагент
					|	И (КодыПоставщиков.Организация = &ТекОрганизация
					|			ИЛИ КодыПоставщиков.Организация = &Контр2)";
					Запрос.УстановитьПараметр("Контрагент",Контрагент);		
					Запрос.УстановитьПараметр("Контр2",Справочники.Контрагенты.ПустаяСсылка());		
					Запрос.УстановитьПараметр("ТекОрганизация",Организация);		
					Результат=Запрос.Выполнить().Выбрать();
					Если Результат.Следующий() Тогда
						КодПоставщикаКонтрагента=Результат.ссылка;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			//----------------------------------------------
			//доставка
			Если не ПунктДоставки=Неопределено  Тогда 
				Если ЗначениеЗаполнено(ПунктДоставки.РайонДоставки) Тогда
					РайонДоставки=ПунктДоставки.РайонДоставки;	
					ДокОбъект.РайонДоставки=РайонДоставки;
				КонецЕсли;	
				Если ЗначениеЗаполнено(ПунктДоставки.Регион) Тогда
					Регион=ПунктДоставки.Регион;
					ДокОбъект.Регион=Регион;
				КонецЕсли;	
				//Катаев+ 10/04/14 Транспортная компания заполняется только если выбран тип доставки = "ТранспортнаяКомпания"
				//Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
				//	ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
				//	ДокОбъект.ТранспортнаяКомпания=ТранспортнаяКомпания;
				//КонецЕсли;	
				//Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
				//	ПунктПерегруза=ПунктДоставки.ПунктПерегруза;	
				//	ДокОбъект.ПунктПерегруза=ПунктПерегруза;
				//КонецЕсли;		
				Если ПунктДоставки.ТипДоставки = Перечисления.ТипыДоставки.ТранспортнаяКомпания Тогда
					Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
						ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
						ДокОбъект.ТранспортнаяКомпания=ТранспортнаяКомпания;
					КонецЕсли;
					Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
						ПунктПерегруза=ПунктДоставки.ПунктПерегруза;	
						ДокОбъект.ПунктПерегруза=ПунктПерегруза;
					КонецЕсли;		
				КонецЕсли;
				//Катаев- 10/04/14
				Если ЗначениеЗаполнено(ПунктДоставки.Грузополучатель) Тогда
					Грузополучатель=ПунктДоставки.Грузополучатель;		
					ДокОбъект.Грузополучатель=Грузополучатель;
				КонецЕсли;
				Если ЗначениеЗаполнено(ПунктДоставки.Получатель) Тогда
					Получатель=ПунктДоставки.Получатель;		
					ДокОбъект.Получатель=Получатель;
				КонецЕсли;
				Если ЗначениеЗаполнено(ПунктДоставки.ОтсрочкаПлатежа) Тогда
					ОтсрочкаПлатежа=ПунктДоставки.ОтсрочкаПлатежа;		
					ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;
				КонецЕсли;
				
				//типы цен скидки
				Если ЗначениеЗаполнено(ПунктДоставки.ТипЦен) И ТипЦен<>ПунктДоставки.ТипЦен Тогда
					ТипЦен=ПунктДоставки.ТипЦен;		
				КонецЕсли; 
				Если ЗначениеЗаполнено(ПунктДоставки.ТипСкидок) И ДокОбъект.ТипСкидок<>ПунктДоставки.ТипСкидок Тогда
					ТипСкидок=ПунктДоставки.ТипСкидок;		
				КонецЕсли;
				Если ПунктДоставки.Скидка<>0 И ПунктДоставки.Скидка<>ДокОбъект.Скидка Тогда
					Скидка=ПунктДоставки.Скидка;		
					ДокОбъект.Скидка=Скидка;
				КонецЕсли;
			КонецЕсли;
			//-------------------------------------------------------------------		
			
			ДокОбъект.Дата=ТекущаяДата();
			ЗаполнитьШапкуДокумента(ДокОбъект, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
			//УстановитьНомерДокументаКлиентСервер(ДокОбъект);
			ДокОбъект.Контрагент=Контрагент;
			ДокОбъект.Организация=Организация;
			ДокОбъект.Договор=Договор;
			ДокОбъект.ИБ=Справочники.ИБ.НайтиПоКоду("SSP");
			ДокОбъект.Менеджер= Менеджер;
			ДокОбъект.НомерЗаказа= УбратьНули(НомерЗаказа,Контрагент.УбиратьНулиПередНомеромЗаказа);
			
			Попытка
				ДокОбъект.ДатаЗаказа=Дата(СтрЗаменить(ДатаЗаказа, "-", ""));
				ДокОбъект.ДатаОтгрузки=Дата(СтрЗаменить(ДатаДоставки, "-", ""));
			Исключение
			КонецПопытки;
			
			ДокОбъект.КодПоставщика=КодПоставщикаКонтрагента;
			
			ДокОбъект.Регион = Регион;
			ТипШК=перечисления.ТипыШтрихКодов.Штука;
			
			ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;		
			ДокОбъект.ТипЦен=ТипЦен; //Контрагент.ТипЦен;
			ДокОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН;
			ДокОбъект.Подразделение = Подразделение;
			ДокОбъект.ЛевыйКонтрагент=Контрагент;
			ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
			ДокОбъект.Отгружен=перечисления.Отгружен.Резерв;
			ДокОбъект.ПунктДоставки=ПунктДоставки;
			ДокОбъект.Склад=Склад;		
			УстановитьНомерДокументаКлиентСервер(ДокОбъект);
			ДокОбъект.Валюта=Справочники.Валюты.НайтиПоКоду("810");
			ДокОбъект.Автор	=Неопределено;
			
			Если СокрЛП(Контрагент.Код)=КодМетро И (Лев(ДокОбъект.Номер,3)<>"SSP" или Лев(ДокОбъект.Номер,3)<>"SST") Тогда
				УстановитьНомерДокументаКлиентСервер(ДокОбъект);	
			КонецЕсли;
			
			ДокОбъект.КодОперации=Перечисления.КодыОперацийОстатки.Реализация;
			ДокОбъект.ДатаОформления	=ДокОбъект.Дата;
			СкидкаКонтрагента=ПолучитьРеквизитРодителя(Контрагент,"Скидка");
			ДокОбъект.Скидка=СкидкаКонтрагента;
			
			//Валетов + 30.06.2026 Изменение 0000000060
			//ДокОбъект.ДатаОплаты	    =ПолучитьДатуОплаты1(ДокОбъект.ДатаОтгрузки,ДокОбъект.ОтсрочкаПлатежа);	
			ПараметрыРасчетаДатыОплаты  = ОбщегоНазначенияКС.ПолучитьЗаполнитьПараметрыРасчетаДатыОплатыПоДокументу(ДокОбъект);
			ДокОбъект.ДатаОплаты 		= ОбщегоНазначенияКС.ПолучитьДатуОплатыПоДокументуКлиентСервер(ПараметрыРасчетаДатыОплаты); 
			//Валетов-	
			
			ПересчетТЧ(ДокОбъект,"Товары",ДокОбъект.Валюта,ДокОбъект.Валюта,ДокОбъект.Курс,ДокОбъект.Курс,Истина);
			
			//проверим на пустые цены!!
			//нечаева 15,03,16+++
			
			ОтборНулевыеЦены=новый Структура("Цена",0);
			МассивНулевыхЦен=ДокОбъект.Товары.НайтиСтроки(ОтборНулевыеЦены);
			
			
			Для каждого текстрока из МассивНулевыхЦен цикл
				
				Отбор2=новый Структура("номенклатура",ТекСтрока.номенклатура);
				тстрока=ДокОбъект.Товары.НайтиСтроки(Отбор2);
				Ошибки.Добавить("Для товара -  "+ТекСтрока.номенклатура +" Цена =0, не записано в заказе, проверьте матрицу! " );
				ТекНом =тстрока[0].НомерСтроки; //.удалить()
				докобъект.товары.Удалить(ТекНом-1);
				
			КонецЦикла;
			//нечаева 15,03,16---
			
			
			
			Если Контрагент.КодИЛН<>"9008727000007" Тогда
				Попытка
					ДокОбъект.Записать(режимЗаписиДокумента.Запись);
					Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
					//Сообщить("Записан документ - "+ДокОбъект.Дата+" "+ДокОбъект.Номер);
					// записать номер в "ошибки" для вывода менеджерам
				Исключение
					// Катаев+ 22/08/13 Если возникла ошибка с уникальностью номера, то пробуем обновить нумерацию объектов и сгенерировать номер заново
					Инфо = ИнформацияОбОшибке();
					Если Найти(Инфо.Описание, "Не уникальный номер документа") > 0 Тогда
						ОбновитьНумерациюОбъектов();
						УстановитьНомерДокументаКлиентСервер(ЭтотОбъект);
						Попытка
							ДокОбъект.Записать(режимЗаписиДокумента.Запись);
							Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
						Исключение
							Если ПризКр=0 тогда
								КритичОшибки.Добавить("После обновления нумерации для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
								//Катаев+ 11/12/14
								Отказ = Истина;
								//Катаев- 11/12/14
							конецЕсли;
						КонецПопытки;
					Иначе	
						Если ПризКр=0 тогда
							КритичОшибки.Добавить("Для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
							//Катаев+ 11/12/14
							Отказ = Истина;
							//Катаев- 11/12/14
						конецЕсли;
					КонецЕсли;
					// Катаев- 22/08/13
					//Сообщить(ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
			//сообщить("    документ записан");
			ПризКр=ПризКр+1;
		КонецЦикла;
	КонецЦикла;
	// конец заполнения документа
	
	
КонецПроцедуры

//Катаев- 29/03/13
//**********************************************************************************************




//--------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------
// екод лента
//нечаева 02,12,16+++

Функция ПолучитьНомерЗаявки(ДокОбъект)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
	|ГДЕ
	|	РеквизитыРНКПНКПРМ.Документ = &Документ
	|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = &ИмяРеквизита";
	Запрос.УстановитьПараметр("Документ", ДокОбъект.Ссылка);
	Запрос.УстановитьПараметр("ИмяРеквизита", "НомерЗаявкиМолния");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЗначениеРеквизита;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции


//новое

//12,04,17 нечаева ++ + комплектации
Процедура СформироватьУведомление(ДокОбъект, Ошибка, Провайдер)
	//Катаев- 28/10/14	
	//Катаев+ 24/10/14 Код GLN теперь может быть и у родителя. так же добавил проверку на наличие номера заказа
	//ИЛНПок =  ДокОбъект.Контрагент.КодИЛН;
	
	//возврат;
	
	Если ПустаяСтрока(ДокОбъект.Контрагент.Родитель.КодИЛН) Тогда
		ИЛНПок =  ДокОбъект.Контрагент.КодИЛН;
	Иначе
		ИЛНПок =  ДокОбъект.Контрагент.Родитель.КодИЛН;
	КонецЕсли;
	
	////нечаева 02,02,015 +++
	//если контрагент.Код = "PRF-0122" Тогда  // для виват-трейд только при отгрузке
	//	Если  ДокОбъект.СостояниеНакладной <> Перечисления.СостоянияНакладной.Отгружена  тогда
	//		ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - попытка формирования уведомления для виват-трейд, возврат ","Важное");
	//		возврат;
	//	иначе
	//		ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - формирование уведомления для виват-трейд ","Важное");
	//	конецЕсли;
	//конецЕсли;	
	////нечаева 02,02,015 ---
	
	
	
	//Катаев+ 28/10/14
	//Если ПустаяСтрока(ДокОбъект.НомерЗаказа) Тогда
	//	Ошибка = 1;
	//	#Если Клиент Тогда
	//		Сообщить(Строка(ДокОбъект)+" - не заполнен номер заказа. Уведомление об отгрузке не создано");
	//	#Иначе
	//		ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - не заполнен номер заказа. Уведомление об отгрузке не создано","Важное");
	//	#КонецЕсли
	//	Возврат;
	//КонецЕсли;
	//Катаев- 28/10/14
	//Катаев- 24/10/14
	//Катаев+ 28/10/14
	//ИЛНПост = ПолучитьИЛН_Пост(ДокОбъект.Склад);
	//Если ИЛНПост = Неопределено Тогда
	//	ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - не удалось определить ИЛН поставщика для формирования уведомления","Важное");
	//	Возврат;
	//КонецЕсли;
	ИЛНПост = "4607182079990EC";
	//Катаев- 28/10/14
	//Катаен+ 02/10/14
	ПутьДляУвед = ПолучитьПутьДляУвед(Константы.КаталогЕКОД.Получить()+ИЛНПост+"\"+ИЛНПок+"\OUT\");
	Если ПутьДляУвед = Неопределено ТОгда
		ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - не удалось определить путь для сохранения файла уведомления","Важное");
		Возврат;
	КонецЕсли;
	ИмяФайлаОбмена = ПутьДляУвед+"\"+ДокОбъект.Номер+".xml";
	//Катаев+ 14/11/14
	
	
	
	Если Провайдер = 0 Тогда
		Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
			//Катаев+ 24/10/14 
			//Если ДокОбъект.Контрагент.Родитель = Справочники.Контрагенты.НайтиПоКоду("SSR-4117") Тогда
			//	ПутьДляУвед = ПолучитьПутьДляУвед(Константы.КаталогЕКОД.Получить()+ИЛНПост+"\4606038000003\OUT\");
			//ИначеЕсли ДокОбъект.Контрагент.Родитель = Справочники.Контрагенты.НайтиПоКоду("KRF-0346") Тогда
			//	ПутьДляУвед = ПолучитьПутьДляУвед(Константы.КаталогЕКОД.Получить()+ИЛНПост+"\4670014789992\OUT\");
			//Иначе
			//	ПутьДляУвед = ПолучитьПутьДляУвед(Константы.КаталогЕКОД.Получить()+ИЛНПост+"\"+ИЛНПок+"\OUT\");
			//КонецЕсли;
			ПутьДляУвед = ПолучитьПутьДляУвед(Константы.КаталогЕКОД.Получить()+ИЛНПост+"\"+ИЛНПок+"\OUT\");
			//Катаев- 24/10/14
			Если ПутьДляУвед = Неопределено ТОгда
				ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - не удалось определить путь для сохранения файла уведомления","Важное");
				//Катаев+ 06/10/14
				Ошибка = 1;
				//Катаев- 06/10/14
				Возврат;
			КонецЕсли;
			ИмяФайлаОбмена = ПутьДляУвед+"\"+ДокОбъект.Номер+".xml";
			//#Если Клиент ТОгда
			//сообщить(ИмяФайлаОбмена);
			//#КонецЕсли
		Иначе
			//Катаев+ 24/10/14
			Если ДокОбъект.Склад.КодФизическогоУзла <> ПланыОбмена.Основной.ЭтотУзел().Код Тогда
				Ошибка = 1;
				Возврат;
			КонецЕсли;
			//Катаев- 24/10/14
			УзелЦО = ПланыОбмена.Основной.НайтиПоКоду("SNL");
			//Катаев+ 24/10/14 
			////Катаев+ 02/10/14 Для Х5/Командора при определении пути надо использовать GLN Х5/Командора, а не ГЛН из карточки контрагента 
			////ПутьДляУвед = ПолучитьПутьДляУвед(Константы.КаталогЕКОД.Получить()+ИЛНПост+"\"+ИЛНПок+"\OUT\");
			//Если ДокОбъект.Контрагент.Родитель = Справочники.Контрагенты.НайтиПоКоду("SSR-4117") Тогда
			//	КаталогFTP="ediECOD\4607182079990EC\4606038000003\OUT\";
			//ИначеЕсли ДокОбъект.Контрагент.Родитель = Справочники.Контрагенты.НайтиПоКоду("KRF-0346") Тогда
			//	КаталогFTP="ediECOD\4607182079990EC\4670014789992\OUT\";
			//Иначе
			//	КаталогFTP="ediECOD\4607182079990EC\"+ИЛНПок+"\OUT\";
			//КонецЕсли;
			////Катаев- 02/10/14
			КаталогFTP="ediECOD\4607182079990EC\"+ИЛНПок+"\OUT\";
			//Катаев- 24/10/14
			ПользовательFTP = "ecode";
			Соединение=УстановитьFTPСоединение(УзелЦО.АдресОбмена,ПользовательFTP,УзелЦО.Пароль,,УзелЦО.ПассивныйРежим);
			Если Соединение=Неопределено Тогда
				Сообщить("Невозможно установить соединение с ftp");
				//Катаев+ 06/10/14
				Ошибка = 1;
				//Катаев- 06/10/14
				Возврат;
			КонецЕсли;
			Соединение.УстановитьТекущийКаталог(КаталогFTP);
			Пути = Соединение.НайтиФайлы(, "DESADV_*");
			Если Пути.Количество() = 0 Тогда
				//Катаев+ 06/10/14
				Ошибка = 1;
				//Катаев- 06/10/14
				Возврат;
			Иначе
				ПутьДляУведомления = Соединение.НайтиФайлы(, "DESADV_*")[0].Имя;
				Соединение.УстановитьТекущийКаталог(ПутьДляУведомления);
				ИмяФайлаОбменаФТП = ДокОбъект.Номер+".xml";
				ИмяФайлаОбмена = КаталогВременныхФайлов()+ДокОбъект.Номер+"_.xml";
			КонецЕсли;
		КонецЕсли;
	Иначе
		//Если ПланыОбмена.Основной.ЭтотУзел() <> ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
		//	Если ДокОбъект.Склад.КодФизическогоУзла <> ПланыОбмена.Основной.ЭтотУзел().Код Тогда
		//		Ошибка = 1;
		//		Возврат;
		//	КонецЕсли;
		//КонецЕсли;
		//КаталогFTP="Outbox";
		//ПользовательFTP = "*%*%*%";
		//ПарольFTP = "*$*$*$";
		//АдресFTP = "ftp-edi.kontur.ru";
		//Соединение=УстановитьFTPСоединение(АдресFTP,ПользовательFTP,ПарольFTP,,Истина);
		//Если Соединение=Неопределено Тогда
		//	Сообщить("Невозможно установить соединение с ftp");
		//	Ошибка = 1;
		//	Возврат;
		//КонецЕсли;
		//Соединение.УстановитьТекущийКаталог(КаталогFTP);
		//ИмяФайлаОбменаФТП = "Пз_"+ДокОбъект.НомерЗаказа+".xml";
		//ИмяФайлаОбмена = КаталогВременныхФайлов()+"Пз_"+ДокОбъект.НомерЗаказа+"_.xml";
	КонецЕсли;
	//Катаев- 14/11/14
	//Катаев- 02/10/14
	ВремФайл = КаталогВременныхФайлов()+ДокОбъект.Номер+".xml";
	
	//#Если Клиент ТОгда
	//сообщить(ИмяФайлаОбмена);
	//#КонецЕсли
	
	
	Ошибка=0;
	
	
	ЗаписьХМЛ=Новый ЗаписьXML;
	ЗаписьХМЛ.ОткрытьФайл(ВремФайл);   //(Путь+Имя+".xml");
	ДокументДом=Новый ДокументDom("","Document-DespatchAdvice");   // "http://v8.1c./8.1/sample91_DOM","Document-Order"
	КорневойЭлемент=ДокументДом.ЭлементДокумента;
	//-------- Order-Header ------------------------------------------
	ЭлементДом=ДокументДом.СоздатьЭлемент("DespatchAdvice-Header");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	//----------------------------------------------------------------
	
	Элемент2=ДокументДом.СоздатьЭлемент("DespatchAdviceNumber");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(ДокОбъект.Номер);
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	//------------------------------------------------------------
	
	//нечаева 17,08,16+++ для ленты дата документа = дате отгрузки
	ДатаДок=Формат(ДокОбъект.Дата, "ДФ=""гггг-ММ-дд""");
	Если ДокОбъект.контрагент.код = "SSR-1593"  Тогда
		ДатаДок=Формат(ДокОбъект.датаОтгрузки, "ДФ=""гггг-ММ-дд""");
	КонецЕсли;
	//нечаева 17,08,16---
	
	Элемент2=ДокументДом.СоздатьЭлемент("DespatchAdviceDate");  // дата
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаДок));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	
	//Катаев+ 30/10/14 Для 7 континента не выводить.
	Если ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-1973")  Тогда
		//------------------------------------------------------------
		
		Элемент2=ДокументДом.СоздатьЭлемент("DespatchAdviceTime");     // время
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		
		
		//нечаева 05,02,16 +++ для подружки с секундами
		Если  ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-3698")  Тогда
			
			ВремяДок=Формат(ДокОбъект.Дата, "ДФ=""ЧЧ:мм:сс""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
		иначе
			ВремяДок=Формат(ДокОбъект.Дата, "ДФ=""ЧЧ:мм""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
		КонецЕсли;
		//нечаева 05,02,16 ---
		
		текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ВремяДок));
		ТекУзел2.ДобавитьДочерний(ТекстДом);
	КонецЕсли;
	
	
	
	
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("EstimatedDeliveryDate");  // дата
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	//Катаев+ 21/08/14 Если заполнена дата авизации, то ставим ее. Если нет, то дату отгрузки
	//ДатаДок2=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
	Если ДокОбъект.ДатаПриемки = Дата(1,1,1) Тогда
		ДатаДок2=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
	Иначе
		ДатаДок2=Формат(ДокОбъект.ДатаПриемки, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
	КонецЕсли;
	
	
	
	
	//Катаев- 21/08/14
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаДок2));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	
	//Катаев+ 30/10/14 Для 7 континента не выводить
	Если ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-1973") Тогда
		//------------------------------------------------------------
		Элемент2=ДокументДом.СоздатьЭлемент("EstimatedDeliveryTime");     // время
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		//Катаев+ 21/08/14 Время доставки ставим из пункта доставки.
		//ВремяДок2=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""ЧЧ:мм""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
		//Кухарь 10.02.16 начало
		//Сначала будет проверятся нет ли времени доставки на конкретно эту накладную
		//Если ДокОбъект.ПунктДоставки.ВремяДоставки = Неопределено Тогда
		ВремяДоставки=ПолучитьВремяПриемки(ДокОбъект.ссылка);
		если ВремяДоставки=Справочники.ВремяПриемки.ПустаяСсылка() или ВремяДоставки=Неопределено тогда
			ВремяДоставки		=ДокОбъект.ПунктДоставки.ВремяДоставки;
		КонецЕсли;		
		Если ВремяДоставки = Справочники.ВремяПриемки.ПустаяСсылка() Тогда 
			//Кухарь 10.02.16 конец	
			
			//ВремяДок2=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""ЧЧ:мм""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
			
			//нечаева 05,02,16 +++ для подружки с секундами
			Если  ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-3698")  Тогда
				
				ВремяДок2=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""ЧЧ:мм:сс""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
			иначе
				ВремяДок2=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""ЧЧ:мм""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
			КонецЕсли;
			//нечаева 05,02,16 ---
			
		Иначе
			//ВремяДок2=Формат(ДокОбъект.ПунктДоставки.ВремяДоставки.КонецПериода1, "ДФ=""ЧЧ:мм""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
			
			//нечаева 05,02,16 +++ для подружки с секундами
			Если  ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-3698")  Тогда				
				//Кухарь 10.02.16 начало
				//Время доставки может быть не из пункта доставки
				//ВремяДок2=Формат(ДокОбъект.ПунктДоставки.ВремяДоставки.КонецПериода1, "ДФ=""ЧЧ:мм:сс""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
				ВремяДок2=Формат(ВремяДоставки.КонецПериода1, "ДФ=""ЧЧ:мм:сс""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
				//Кухарь 10.02.16 конец
				
			иначе						
				//Кухарь 10.02.16 начало
				//Время доставки может быть не из пункта доставки
				//ВремяДок2=Формат(ДокОбъект.ПунктДоставки.ВремяДоставки.КонецПериода1, "ДФ=""ЧЧ:мм""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
				ВремяДок2=Формат(ВремяДоставки.КонецПериода1, "ДФ=""ЧЧ:мм""");  // "ДФ=""гггг-мм-дд ЧЧ:мм"""
				//Кухарь 10.02.16 конец
			КонецЕсли;
			//нечаева 05,02,16 ---
			
			
		КонецЕсли;
		
		
		// для подружки нужно с секундами.
		//нечаева 07,04,15++
		Если ДокОбъект.контрагент.код = "SSP-1973" Тогда
			Если СокрЛП(ВремяДок2)="" Тогда 
				ВремяДок2 = "00:00";
				//ВремяДок22=Формат(ТекущаяДата(), "ДФ=""ЧЧ:мм""");
			конецЕсли;
		иначе
			Если СокрЛП(ВремяДок2)="" Тогда 
				//ВремяДок22 = "00:00";
				
				//нечаева 05,02,16 +++ для подружки с секундами
				Если  ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-3698")  Тогда
					ВремяДок22 = "00:00:00";
				иначе
					ВремяДок22 = "00:00";
				КонецЕсли;
				//нечаева 05,02,16 ---
				
			конецЕсли;
		конецЕсли;
		//нечаева 07,04,15 ---
		
		//Катаев- 21/08/14
		текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ВремяДок2));
		ТекУзел2.ДобавитьДочерний(ТекстДом);
		
	КонецЕсли;
	//----------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("BuyerOrderNumber");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(ДокОбъект.НомерЗаказа);
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("BuyerOrderDate");  // дата
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	ДатаДок=Формат(ДокОбъект.ДатаЗаказа, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаДок));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	
	
	
	//нечаева +++ 19,08,15+
	// для окей - доп поля.
	Если ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-5862") Тогда
		// номер накладной
		Элемент2=ДокументДом.СоздатьЭлемент("DespatchNumber");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(ДокОбъект.Номер);
		ТекУзел2.ДобавитьДочерний(ТекстДом);
		//------------------------------------------------------------
		// дата накладной
		Элемент2=ДокументДом.СоздатьЭлемент("DespatchDate");  
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		ДатаДок=Формат(ДокОбъект.ДатаОтгрузки, "ДФ=""гггг-ММ-дд""");  // "ДФ=""гггг-мм-дд ЧЧ:мм:сс"""
		текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ДатаДок));
		ТекУзел2.ДобавитьДочерний(ТекстДом);
		
	КонецЕсли;
	//нечаева +++ 19,08,15---
	
	
	//Катаев+ 01/12/14 Для Молнии выводим Номер заявки
	Если ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("CHF-0006") Тогда
		НомерЗаявки = ПолучитьНомерЗаявки(ДокОбъект);
		Если Номерзаявки = Неопределено Тогда
			Ошибка = 1;
		Иначе	
			Элемент2=ДокументДом.СоздатьЭлемент("SupplierOrderNumber");
			ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(НомерЗаявки);
			ТекУзел2.ДобавитьДочерний(ТекстДом);
		КонецЕсли;
	КонецЕсли;
	//Катаев- 01/12/14
	
	//Катаев+ 08/12/14 Элемент для перекрестка для Перекрестка
	Если ДокОбъект.Контрагент.Родитель = Справочники.Контрагенты.НайтиПоКоду("SSR-4117") Тогда
		Элемент2=ДокументДом.СоздатьЭлемент("DocumentFunctionCode");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		текстДом=ДокументДом.СоздатьТекстовыйУзел("O");
		ТекУзел2.ДобавитьДочерний(ТекстДом);
	КонецЕсли;
	//Катаев- 08/12/14
	
	//Катаев+ 30/10/14 Для 7 континента не выводить
	Если ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-1973") Тогда
		//------------------------------------------------------------
		Элемент2=ДокументДом.СоздатьЭлемент("Currency");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		текстДом=ДокументДом.СоздатьТекстовыйУзел("RUR");
		ТекУзел2.ДобавитьДочерний(ТекстДом);
	КонецЕсли;
	//**********************************************************
	//                второй блок данных
	//**********************************************************
	
	ЭлементДом=ДокументДом.СоздатьЭлемент("DespatchAdvice-Parties");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	//----------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("Buyer");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	
	СписокКодИЛН=ДокОбъект.ПунктДоставки.ИЛН;
	
	//Катаев+ 02/12/13
	//КодИЛН=ДокОбъект.ПунктДоставки.КодИЛН;
	КодИЛН=ДокОбъект.Контрагент.КодИЛН;
	//Катаев- 02/12/13
	
	//катаев+ 07/11/13  Убрал ошибочный код
	//Для каждого ТекНОм из СписокКодИЛН Цикл
	//	
	//	КодИЛН=ТекНом.КодИЛН;
	//	
	//КонецЦикла;
	//Катаев- 07/11/13
	
	Элемент3=ДокументДом.СоздатьЭлемент("ILN");
	ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(КодИЛН));
	ТекУзел3.ДобавитьДочерний(ТекстДом);
	//------------------------------------------------------------
	
	Элемент2=ДокументДом.СоздатьЭлемент("Seller");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	
	Элемент3=ДокументДом.СоздатьЭлемент("ILN");
	ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(Лев(ИЛНПост,13));
	ТекУзел3.ДобавитьДочерний(ТекстДом);
	
	//Катаев+ 30/10/14 Для 7 континента не выводить
	Если ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-1973") Тогда
		Элемент3=ДокументДом.СоздатьЭлемент("CodeByBuyer");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.КодПоставщика));
		ТекУзел3.ДобавитьДочерний(ТекстДом);
	КонецЕсли;
	//------------------------------------------------------------
	
	Элемент2=ДокументДом.СоздатьЭлемент("DeliveryPoint");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	
	Элемент3=ДокументДом.СоздатьЭлемент("ILN");
	ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
	КодИЛН=ДокОбъект.ПунктДоставки.КодИЛН;
	текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(КодИЛН));
	ТекУзел3.ДобавитьДочерний(ТекстДом);
	
	//Катаев+ 30/10/14 КПП организации для 7 Континента
	//------------------------------------------------------------
	Если ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-1973") Тогда
		Элемент2=ДокументДом.СоздатьЭлемент("Consignor");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		
		Элемент3=ДокументДом.СоздатьЭлемент("UtilizationRegisterNumber");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДокОбъект.Организация.КПП));
		ТекУзел3.ДобавитьДочерний(ТекстДом);
	КонецЕсли;
	//Катаев- 30/10/14
	
	//Катаев+ 02/12/13 Добавляю секцию по ГЛН пункта доставки
	Запрос = Новый запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
	|ГДЕ
	|	РеквизитыРНКПНКПРМ.Документ = &Документ
	|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = &ИмяРеквизита";
	Запрос.УстановитьПараметр("Документ", ДокОбъект.Ссылка);
	Запрос.УстановитьПараметр("ИмяРеквизита", "GLN");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() ТОгда
		КодИЛН_ПД = Выборка.ЗначениеРеквизита;
	Иначе
		КодИЛН_ПД = "";
	КонецЕсли;
	//Катаев+ 30/10/14 секцию заполнять если только есть данные
	Если КодИЛН_ПД <> "" Тогда
		Элемент2=ДокументДом.СоздатьЭлемент("UltimateCustomer");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
		
		Элемент3=ДокументДом.СоздатьЭлемент("ILN");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент3);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(КодИЛН_ПД));
		ТекУзел3.ДобавитьДочерний(ТекстДом);
	КонецЕсли;
	//Катаев- 02/12/13
	
	
	
	// номера упаковок ССИИкодов;
	ТЗУпаковок = новый ТаблицаЗначений;
	ТЗУпаковок = ПолучитьНомераУпаковок(ДокОбъект);
	
	
	
	//Катаев+ 09/10/13 Добавил секцию по упаковке
	ИДУпаковки = 0;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
	|ГДЕ
	|	РеквизитыРНКПНКПРМ.Документ = &Документ
	//Катаев+ 18/12/14 Упаковок может быть несколько
	//|	И РеквизитыРНКПНКПРМ.ИмяРеквизита = &ИмяРеквизита";
	|	И Подстрока(РеквизитыРНКПНКПРМ.ИмяРеквизита,1,21) = &ИмяРеквизита";
	//Катаев- 18/12/14
	Запрос.УстановитьПараметр("Документ", ДокОбъект.Ссылка);
	Запрос.УстановитьПараметр("ИмяРеквизита", "СерийныйНомерУпаковки");
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		Если ДокОбъект.Контрагент.Родитель = Справочники.Контрагенты.НайтиПоКоду("SSR-4117") Тогда
			НеобходимоПалетов = 0;
			Для Каждого стр из ДокОбъект.Товары Цикл
				Если стр.Количество > 0 Тогда
					НеобходимоПалетов = НеобходимоПалетов+1;
				КонецЕсли;
			КонецЦикла;
			Если НеобходимоПалетов <> Выборка.Количество() Тогда
				ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - Количество палетов не совпадает с количеством SSCC кодов. Необходимо - "+Строка(НеобходимоПалетов)+". Внесено SSCC кодов - "+Строка(Выборка.Количество()),"Важное");
				Ошибка=1;
				Возврат;
			КонецЕсли;
		Иначе
			//Если Выборка.Количество() <> 1 Тогда
			//	ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - Количество палетов не совпадает с количеством SSCC кодов. Необходимо - 1. Внесено SSCC кодов - "+Строка(Выборка.Количество()),"Важное");
			//	Ошибка=1;
			//	Возврат;
			//КонецЕсли;
		КонецЕсли;
		//Создаем корневую секцию
		ЭлементДом=ДокументДом.СоздатьЭлемент("DespatchAdvice-Consignment");
		ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
		Элемент=ДокументДом.СоздатьЭлемент("Packing-Sequence");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент);
		
		Элемент=ДокументДом.СоздатьЭлемент("PackageId");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел("1");                 
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		ИДУпаковки = 2;
		ИДУпаковки1 = 2;
		Для Каждого ТекСтрока из  ТЗУпаковок  Цикл
			
			ИДУпаковки = Текстрока.Код;
			СерийныйНомер = ТекСтрока.Номер;
			
			
			ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
			Элемент=ДокументДом.СоздатьЭлемент("Packing-Sequence");
			ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент);
			
			Элемент=ДокументДом.СоздатьЭлемент("PackageId");
			ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ИДУпаковки));                 
			ТекУзел3.ДобавитьДочерний(ТекстДом);
			
			Элемент=ДокументДом.СоздатьЭлемент("ParentId");
			ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
			текстДом=ДокументДом.СоздатьТекстовыйУзел("1");
			ТекУзел3.ДобавитьДочерний(ТекстДом);
			
			Если ДокОбъект.Контрагент.Родитель = Справочники.Контрагенты.НайтиПоКоду("SSR-4117") Тогда
				Элемент=ДокументДом.СоздатьЭлемент("PackageNumber");
				ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел("1");
				ТекУзел3.ДобавитьДочерний(ТекстДом);
			КонецЕсли;
			
			Элемент=ДокументДом.СоздатьЭлемент("PackageType");
			ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
			Если ДокОбъект.Контрагент.Родитель = Справочники.Контрагенты.НайтиПоКоду("SSR-4117") Тогда
				текстДом=ДокументДом.СоздатьТекстовыйУзел("201");
			Иначе
				текстДом=ДокументДом.СоздатьТекстовыйУзел("09");
			КонецЕсли;
			ТекУзел3.ДобавитьДочерний(ТекстДом);
			
			Элемент=ДокументДом.СоздатьЭлемент("SerialNumber");
			ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(СокрЛП(СерийныйНомер)));                 
			ТекУзел3.ДобавитьДочерний(ТекстДом);
			
			Если ДокОбъект.Контрагент.Родитель <> Справочники.Контрагенты.НайтиПоКоду("SSR-4117") Тогда
				Элемент=ДокументДом.СоздатьЭлемент("DeliveryPlace");
				ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
				//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(КодИЛН));  //было               
				
				// Для Ленты пишем код конечного покупателя, если есть
				//нечаева 17,06,15 +++
				// для Ленты
				Если ДокОбъект.Контрагент.Родитель = Справочники.Контрагенты.НайтиПоКоду("SSR-4123") Тогда
					Если Строка(КодИЛН_ПД)<>"" Тогда
						текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(КодИЛН_ПД));                 
					Иначе
						#если Клиент Тогда
							Сообщить("Документ "+ДокОбъект+"- Нет данных по GLN конечного покупателя, Уведомление об отгрузке не отправлено!");
						#КонецЕсли
						Ошибка = 1;
						возврат;
					КонецЕсли;	
				Иначе
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(КодИЛН));                 
				КонецЕсли;	
				//нечаева 17,06,15 ---
				
				
				ТекУзел3.ДобавитьДочерний(ТекстДом);
			КонецЕсли;
			
			ИДУпаковки = ИДУпаковки+1;
		КонецЦикла;
	КонецЕсли;
	//Катаев- 18/12/14
	
	//-------------------------
	//    заполнение строк
	//-------------------------
	ЭлементДом=ДокументДом.СоздатьЭлемент("DespatchAdvice-Lines");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	
	тз = ДокОбъект.Товары.Выгрузить();
	тз.Колонки.Добавить("ШККонтрагента");
	тз.Колонки.Добавить("АртикулКонтрагента");
	//Катаев+ 30/10/13
	тз.Колонки.Добавить("НаименованиеКонтрагента");
	//Катаев- 30/10/13
	//Катаев+ 07/10/14
	тз.Колонки.Добавить("Кратность");
	
	
	//нечаева 18.09.15+++
	// поменяла запрос, поставила как в поисках цен, иначе брал артикул непонятно из какой матрицы , упорядочение сделала
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	МатрицаТовары.Номенклатура,
	|	МатрицаТовары.ШККонтрагента,
	|	МатрицаТовары.АртикулКонтрагента,
	|	МатрицаТовары.Ссылка,
	|	МатрицаТовары.НаименованиеКонтрагента,
	|	МатрицаТовары.Кратность,
	|	МатрицаТовары.ШККонтрагентаБлочок
	|ИЗ
	|	Документ.Матрица.Товары КАК МатрицаТовары
	|ГДЕ
	|	МатрицаТовары.Ссылка.Дата <= &Дата1
	|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
	|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
	|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	МатрицаТовары.Ссылка.Дата УБЫВ
	|АВТОУПОРЯДОЧИВАНИЕ";
	///нечаева 18.09.15+++
	
	Запрос.УстановитьПараметр("Контрагент",ДокОбъект.Контрагент);
	Запрос.УстановитьПараметр("Дата1",КонецДня(ДокОбъект.Дата));
	Запрос.УстановитьПараметр("ТекДата",ДокОбъект.Дата);
	
	
	
	
	тз1 = Запрос.Выполнить().Выгрузить();
	
	
	
	
	Для Каждого ТекСтрока Из тз Цикл
		//Катаев+ 04/04/14 пропускаем номенклатуру без количества
		//Катаев+ 31/10/14 Для 7 континента не пропускаем
		//Если ТекСтрока.Количество<=0 Тогда
		Если ТекСтрока.Количество<=0 И ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-1973") Тогда
			//Катаев- 31/10/14
			Продолжить;
		КонецЕсли; 
		//Катаев- 04/04/14
		ШКПоМатрице=НЕопределено;
		АртикулПоМатрице=НЕопределено;
		НайденнаяСтрока = тз1.Найти(ТекСтрока.Номенклатура,"Номенклатура");
		Если НайденнаяСтрока <> Неопределено ТОгда
			//Катаев+ 04/04/14
			//АртикулПоМатрице= НайденнаяСтрока.АртикулКонтрагента;
			//Строка1 = тз1.Найти(АртикулПоМатрице, "АртикулКонтрагента");
			////Катаев+ 30/10/13 Если есть ШККонтрагентаБлочок, то ставим его
			////ТекСтрока.ШККонтрагента = Строка1.ШККонтрагента;
			//Если ПустаяСтрока(Строка1.ШККонтрагентаБлочок) Тогда
			//	ТекСтрока.ШККонтрагента = Строка1.ШККонтрагента;
			//Иначе
			//	ТекСтрока.ШККонтрагента = Строка1.ШККонтрагентаБлочок;
			//КонецЕсли;
			////Катаев- 30/10/13
			//ТекСтрока.АртикулКонтрагента = Строка1.АртикулКонтрагента;
			//ТекСтрока.Номенклатура = Строка1.Номенклатура;
			//ТекСтрока.НаименованиеКонтрагента = Строка1.НаименованиеКонтрагента;
			Если ПустаяСтрока(НайденнаяСтрока.ШККонтрагентаБлочок) Тогда
				ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагента;
			Иначе
				ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагентаБлочок;
			КонецЕсли;
			ТекСтрока.АртикулКонтрагента = НайденнаяСтрока.АртикулКонтрагента;
			ТекСтрока.НаименованиеКонтрагента = НайденнаяСтрока.НаименованиеКонтрагента;
			//Катаев- 04/04/14
			//Катаев+ 07/10/14
			ТекСтрока.Кратность = Число(НайденнаяСтрока.Кратность);
			//Катаев- 07/10/14
		Иначе
			//Сообщить("В номенклатурной матрице не найдена номенклатура "+ТекСтрока.Номенклатура);
			//Сообщить("В номенклатурной матрице не найдена номенклатура "+ТекСтрока.Номенклатура);
			////нечаева 26,02,15 ++
			//Если НЕ ОбменДанными.Загрузка Тогда	
			//	Сообщить("В номенклатурной матрице не найдена номенклатура "+ТекСтрока.Номенклатура);
			//конецесли ;
			//нечаева 26,02,15 ++
			
			
			//Катаев+ 06/10/14
			//Возврат;
			Ошибка = 1;
			//Катаев- 06/10/14
		КонецЕсли;
		
	КонецЦикла;
	//тз.Свернуть("Номенклатура, ШККонтрагента, АртикулКонтрагента, Цена","Количество, Заявка");
	///----------------------------------------------------------------------------------------------------------------------------
	//Катаев+ 06/10/14
	Если Ошибка = 1 Тогда
		Возврат;
	КонецЕсли;
	//Катаев- 06/10/14
	ОбщаяСумма=0;
	//нечаева 18,05,15 +++
	ОбщаяСуммаСНДС = 0;
	ОбщаяНДС = 0;
	//нечаева 18,05,15 ---
	РР=1;
	//Катаев+ 02/12/13
	колДок = 0;
	//Катаев- 02/12/13
	//Для Каждого ТекСтрока из тз цикл
	
	//Нечаева 06,04,15+++++
	// для 7 континента сворачиваем 5 позиций по спайкам.
	ТЗАртикулы = новый ТаблицаЗначений;
	
	Если ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-1973") Тогда
		
		ТЗАртикулы = ТЗ.скопировать();
		ТЗАртикулы.свернуть("АртикулКонтрагента,Цена,СтавкаНДС","заявка,количество,Всего,Сумма,НДС");
		ТЗАртикулы.колонки.добавить("ШККонтрагента"); 
		ТЗАртикулы.колонки.добавить("НаименованиеКонтрагента"); 
		ТЗАртикулы.колонки.добавить("Кратность"); 
		ТЗАртикулы.колонки.добавить("Номенклатура"); 
		
		
		Для Каждого ТекСтрока Из тзАртикулы Цикл
			
			ШКПоМатрице=НЕопределено;
			АртикулПоМатрице=НЕопределено;
			НайденнаяСтрока = тз1.Найти(ТекСтрока.АртикулКонтрагента,"АртикулКонтрагента");
			Если НайденнаяСтрока <> Неопределено ТОгда
				Если ПустаяСтрока(НайденнаяСтрока.ШККонтрагентаБлочок) Тогда
					ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагента;
				Иначе
					ТекСтрока.ШККонтрагента = НайденнаяСтрока.ШККонтрагентаБлочок;
				КонецЕсли;
				ТекСтрока.АртикулКонтрагента = НайденнаяСтрока.АртикулКонтрагента;
				ТекСтрока.НаименованиеКонтрагента = НайденнаяСтрока.НаименованиеКонтрагента;
				ТекСтрока.Кратность = Число(НайденнаяСтрока.Кратность);
				ТекСтрока.Номенклатура = НайденнаяСтрока.Номенклатура;
			Иначе
				
			КонецЕсли;
			Если ТекСтрока.АртикулКонтрагента = "121459" Тогда
				ШК = "8308583260760";
			КонецЕсли;
			
			Если ТекСтрока.АртикулКонтрагента = "121344" Тогда
				ШК = "88308583347850";
			КонецЕсли;
			
			Если ТекСтрока.АртикулКонтрагента = "170466" Тогда
				ШК = "8300277515859";
			КонецЕсли;
			
			Если ТекСтрока.АртикулКонтрагента = "177010" Тогда
				ШК = "8300277516931";
			КонецЕсли;
			
			Если ТекСтрока.АртикулКонтрагента = "121139" Тогда
				ШК = "8300497008261";
			КонецЕсли;
			
		КонецЦикла;
		
		
		///перенесла 09,04,15++
		// проверка, если код артикула = "" тогда не выводить ничего
		//----------------------
		Для Каждого ТекСтрока Из тзАртикулы Цикл
			Если СокрЛП(текСтрока.артикулКонтрагента) = "" Тогда
				Сообщить("Для номенклатуры - "+ТекСтрока.Номенклатура+" - не определен артикул контрагента, для выгрузки в Е-код!!! (Заполните Документ Матрица)");
				ошибка = 1;
			КонецЕсли;
		конецЦикла;
		
		
	КонецЕсли;
	
	///-------------------------------------------
	ТЗДляОтправки = ТЗ;
	// для 7 континента сворачиваем 5 позиций по спайкам.
	Если ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-1973") Тогда
		
		ТЗДляОтправки = ТЗАртикулы;
		
	КонецЕсли;
	
	//Нечаева 21,11,18+++
	ЕстьЛистыПереукладки = Ложь;
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛистПереукладки.Ссылка
	|ИЗ
	|	Документ.ЛистПереукладки КАК ЛистПереукладки
	|ГДЕ
	|	ЛистПереукладки.Проведен = истина
	|	И ЛистПереукладки.ДокОснование = &ТекДок";
	
	Запрос.УстановитьПараметр("ТекДок",ДокОбъект.ссылка);			   
	Рез = Запрос.Выполнить().Выбрать();
	Если РЕз.Количество()>0 Тогда
		ЕстьЛистыПереукладки = Истина;
	КонецЕсли;
	// Нечаева 21,1118--
	
	
	// номера упаковок ССИИкодов;
	ТЗУпаковок = новый ТаблицаЗначений;
	ТЗУпаковок = ПолучитьНомераУпаковок(ДокОбъект);
	
	//Нечаева 09,04,18+++
	СписокСтрокизПаллет = Новый ТаблицаЗначений;
	СписокСтрокизПаллет = ТаблицаНомеклатурыВПаллетах(ДокОбъект.ссылка);
	//Нечаева 09,04,18---
	
	Для Каждого ТекСтрока из тзДляОтправки Цикл
		// нечаева 06,04,015 --------	
		
		
		//Катаев+ 31/10/14 Для 7 континента не пропускаем
		//Если ТекСтрока.Количество<=0 Тогда
		Если ТекСтрока.Количество<=0 И ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-1973") Тогда
			//Катаев- 31/10/14
			Продолжить;
		КонецЕсли; 
		Если ТекСтрока.ШККонтрагента="" Тогда
			ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - Для номенклатуры - "+ТекСтрока.Номенклатура+" - не определен штрихкод, для выгрузки в Е-код!!! (Заполните Документ Матрица)","Важное");
			Сообщить("Для номенклатуры - "+ТекСтрока.Номенклатура+" - не определен штрихкод, для выгрузки в Е-код!!! (Заполните Документ Матрица)");
			Ошибка=1;
			Продолжить;
		КонецЕсли;
		//Катаев+ 30/10/13
		//Катаев+ 20/02/14 Для Зельгроса указывается штучное количество
		//ШтукВУпаковке = ТекСтрока.Номенклатура.Родитель.ШтукВКоробочке;
		//Если ШтукВУпаковке = 0 Тогда
		//	ШтукВУпаковке = 1;
		//КонецЕсли;
		////Катаев- 30/10/13
		//Катаев+ 21/08/14 Только для Ленты оставляем коробочную отгрузку. Остальным ставим штуки
		//Если ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-5905") Тогда
		Если ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSR-1593") Тогда
			ШтукВУпаковке = 1;
			КодУпаковки = "PCE";
		Иначе
			//Катаев+ 07/10/14 Если в матрице есть крмтность, то берем ее, иначе из номенклатуры
			//ШтукВУпаковке = ТекСтрока.Номенклатура.Родитель.ШтукВКоробочке;
			Если ТекСтрока.Кратность > 0 Тогда
				ШтукВУпаковке = ТекСтрока.Кратность;
			Иначе
				ШтукВУпаковке = ТекСтрока.Номенклатура.Родитель.ШтукВКоробочке;
			Конецесли;
			//Катаев- 07/10/14
			Если ШтукВУпаковке = 0 Тогда
				ШтукВУпаковке = 1;
			КонецЕсли;
			КодУпаковки = "CT";
		Конецесли;
		//Катаев- 20/02/14
		
		Элемент=ДокументДом.СоздатьЭлемент("Line");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент);
		//----------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("Line-Item");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		
		
		Элемент=ДокументДом.СоздатьЭлемент("LineNumber");
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(рр));                 
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		Элемент=ДокументДом.СоздатьЭлемент("OrderLineNumber");
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(рр));                 
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		//---------------------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("EAN");  //штрихкод
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(ТекСтрока.ШККонтрагента);                      
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		//----------------------------------------------------------
		Если Не ПустаяСтрока(ТекСтрока.АртикулКонтрагента) Тогда
			Элемент=ДокументДом.СоздатьЭлемент("BuyerItemCode");  //ариткул
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(ТекСтрока.АртикулКонтрагента);                     
			ТекУзел4.ДобавитьДочерний(ТекстДом);
		КонецЕсли;
		
		//Катаев+ 30/10/14 Для 7 континента и Подружки( табер трейд) не выводить
		Если ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-1973")
			и  ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-3698")  Тогда
			
			Элемент3=ДокументДом.СоздатьЭлемент("SupplierItemCode");
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент3);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Текстрока.Номенклатура.код);
			ТекУзел4.ДобавитьДочерний(ТекстДом);
			
		КонецЕсли;
		//----------------------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("DespatchedQuantity");  //коли отправ
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		
		//Катаев+ 19/12/14
		//Кол=ЗаменитьТочку(ТекСтрока.Количество,3);
		Кол=ЗаменитьТочку(ТекСтрока.Количество/ШтукВУпаковке,3);
		//Катаев- 19/12/14
		
		//Катаев+ 30/10/13
		//Катаев+ 19/12/14 Вернул старый текст
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Кол));
		//текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Кол/ШтукВУпаковке));                     
		//Катаев- 19/12/14
		//Катаев+ 02/12/13
		колДок = КолДок+ТекСтрока.Количество/ШтукВУпаковке;
		//Катаев- 02/12/13
		//Катаев- 30/10/13
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		//----------------------------------------------------------
		//Катаев+ 03/12/14
		//Заявка=ЗаменитьТочку(ТекСтрока.Заявка,3);
		Заявка=ЗаменитьТочку(ТекСтрока.Заявка/ШтукВУпаковке,3);
		//Катаев- 03/12/14
		
		//Катаев+ 30/10/14 Для 7 континента не выводить
		Если ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-1973") Тогда
			Элемент=ДокументДом.СоздатьЭлемент("OrderedQuantity");  //штрихкод
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			//Катаев+ 19/12/14
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Заявка));
			//Катаев- 19/12/14
			//Катаев+ 03/12/14 Вернул старый код
			//Катаев+ 30/10/13
			ТекУзел4.ДобавитьДочерний(ТекстДом);
			
			//катаев+ 30/10/13 Количество в упаковке
			//----------------------------------------------------------
			Заявка=ЗаменитьТочку(ТекСтрока.Заявка,3);
			
			//Для подружки не надо (табер трейд)
			//нечаева 05,02,16+++
			Если   ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-3698")  Тогда
				
				Элемент=ДокументДом.СоздатьЭлемент("OrderedUnitPacksize");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ШтукВУпаковке));                     
				ТекУзел4.ДобавитьДочерний(ТекстДом);
				
			КонецЕсли;
			//нечаева 05,02,15 ---
			
			
			//Катаев- 30/10/13
		КонецЕсли;
		//катаев+ 30/10/13 Количество в упаковке
		//----------------------------------------------------------
		
		//Для подружки не надо (табер трейд)
		//нечаева 05,02,16+++
		Если   ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-3698")  Тогда
			
			
			Элемент=ДокументДом.СоздатьЭлемент("UnitOfMeasure");  //штрихкод
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			//Катаев+ 20/02/14
			//текстДом=ДокументДом.СоздатьТекстовыйУзел("CT");                     
			текстДом=ДокументДом.СоздатьТекстовыйУзел(КодУпаковки);                     
			//Катаев- 20/02/14
			ТекУзел4.ДобавитьДочерний(ТекстДом);
		кОНЕЦеСЛИ;
		
		//----------------------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("ItemDescription");  // наименование номенклатуры
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		//Катаев+ 30/10/13 Если заполнено наименование контрагента, то выводить его
		//текстДом=ДокументДом.СоздатьТекстовыйУзел(ТекСтрока.Номенклатура.Наименование);                      
		Если ПустаяСтрока(ТекСтрока.НаименованиеКонтрагента) Тогда
			текстДом=ДокументДом.СоздатьТекстовыйУзел(ТекСтрока.Номенклатура.Наименование);
		Иначе
			текстДом=ДокументДом.СоздатьТекстовыйУзел(ТекСтрока.НаименованиеКонтрагента);
		КонецЕсли;
		//Катаев- 30/10/13
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		
		// Цена без НДС
		//Катаев+ 21/08/14
		//Цена= ЗаменитьТочку(ТекСтрока.Цена-(Окр(ТекСтрока.НДС/ТекСтрока.Количество,2,0)),2);
		//Катаев+ 19/12/14
		//Цена = ЗаменитьТочку(Окр(ТекСтрока.Сумма/ТекСтрока.Количество,2,0),2);
		Если ТекСтрока.Количество = 0 Тогда
			Цена = ЗаменитьТочку(ТекСтрока.Цена,2);
		Иначе
			Цена = ЗаменитьТочку(Окр(ТекСтрока.Сумма/ТекСтрока.Количество,2,0),2);
		КонецЕсли;
		//Катаев- 19/12/14
		//Катаев- 21/08/14
		
		
		//Для подружки не надо (табер трейд)
		//нечаева 05,02,16+++
		Если   ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-3698")  Тогда
			
			Элемент=ДокументДом.СоздатьЭлемент("UnitNetPrice");  // цена без ндс
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(цена));                      
			ТекУзел4.ДобавитьДочерний(ТекстДом);
			
		КонецЕсли;
		
		
		
		
		//Катаев+ 27/10/14 Для 7 континета и Молнии добавил обяхательные поля
		Если ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-1973") ИЛИ ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("CHF-0006")
			// нечаева 21.09,15 +++
			или ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSR-6024")// для красного яра.
			или ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSR-6042")// для красного яра.
			// нечаева 21.09,15 ---
			
			Тогда 
			Элемент=ДокументДом.СоздатьЭлемент("UnitGrossPrice"); //Цена с НДС
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			Цена= ЗаменитьТочку(ТекСтрока.Цена,2);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
			ТекУзел4.ДобавитьДочерний(ТекстДом);
			
			Элемент=ДокументДом.СоздатьЭлемент("TaxAmount"); //Сумма НДС
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			Цена= ЗаменитьТочку(ТекСтрока.НДС,2);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
			ТекУзел4.ДобавитьДочерний(ТекстДом);
		КонецЕсли;
		//Катаев- 27/10/14
		
		
		//Нечаева + 04,02.16  Для Табре трейд (подружка)
		Если 	ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-3698")	Тогда 
			Элемент=ДокументДом.СоздатьЭлемент("UnitGrossPrice"); //Цена с НДС
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			Цена= ЗаменитьТочку(ТекСтрока.Цена,2);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
			ТекУзел4.ДобавитьДочерний(ТекстДом);
			
		КонецЕсли;
		//Нечаева --- 04,02.16
		
		
		
		// Сумма без НДС
		//Катаев+ 21/08/14
		//Сумма=(ТекСтрока.Цена-(Окр(ТекСтрока.НДС/ТекСтрока.Количество,2,0)))*ТекСтрока.Количество;
		Сумма = ТекСтрока.Сумма;
		//Катаев- 21/08/14
		Цена= ЗаменитьТочку(Сумма,2);
		
		//Катаев+ 30/10/14 Для 7 континента не выводить
		Если ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-1973")
			
			//Для подружки не надо (табер трейд)
			//нечаева 05,02,16+++
			и   ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-3698")  Тогда
			//нечаева 05,02,16---
			Элемент=ДокументДом.СоздатьЭлемент("NetAmount");  // сумма без ндс
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
			ТекУзел4.ДобавитьДочерний(ТекстДом);
		КонецЕсли;
		
		ОбщаяСумма=ОбщаяСумма+Сумма;
		//нечаева 19,08,15++
		ОбщаяСуммаСНДС = ОбщаяСуммаСНДС+ТекСтрока.Всего;
		ОбщаяНДС = ОбщаяНДС+ТекСтрока.НДС;
		//нечаева 19,08,15--
		
		
		//Катаев+ 30/10/13 Добавил стоимость с НДС
		//Катаев+ 21/08/14
		//Сумма=ТекСтрока.Цена*ТекСтрока.Количество;
		//Цена= ЗаменитьТочку(Сумма,2);
		Цена= ЗаменитьТочку(ТекСтрока.Всего,2); //Катаев+ 21/08/14
		//Катаев- 21/08/14
		
		Элемент=ДокументДом.СоздатьЭлемент("GrossAmount");
		ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Цена));                      
		ТекУзел4.ДобавитьДочерний(ТекстДом);
		//Катаев- 30/10/13
		//Катаев+ 01/11/13
		
		
		//Для подружки не надо (табер трейд)
		//нечаева 05,02,16+++
		Если   ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-3698")  Тогда
			
			Элемент=ДокументДом.СоздатьЭлемент("TaxRate");
			ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
			//Катаев+ 21/08/14 Ставку НДМ берем тоже из документа
			//текстДом=ДокументДом.СоздатьТекстовыйУзел("18.00");                      
			Если ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
				НДС_Текст = "10.00";
			ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
				НДС_Текст = "18.00";
			ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
				НДС_Текст = "20.00";
			ИначеЕсли ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
				НДС_Текст = "0.00";
			Иначе
				НДС_Текст = "Без НДС";
			КонецЕсли;
			текстДом=ДокументДом.СоздатьТекстовыйУзел(НДС_Текст);
			ТекУзел4.ДобавитьДочерний(ТекстДом);
			//Катаев- 01/11/13
			
			
			
			//----------------------------------------------------------
			//ГТД
			
			ГТД=ПолучитьГрупповойПериодическийРеквизит(ТекСтрока.Номенклатура.Родитель,"НомерГТД",ТекущаяДата());
			
			Если ГТД = Неопределено или ГТД.СтранаПроисхождения.Наименование="РОССИЯ" Тогда
				//--------------------------------------------------------------------------------
				Элемент=ДокументДом.СоздатьЭлемент("CountryOfOriginCode");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел("RU");                      
				ТекУзел4.ДобавитьДочерний(ТекстДом);
			Иначе
				Если Врег(""+ГТД.СтранаПроисхождения)<>"РОССИЯ" И НЕ ПустаяСтрока(""+ГТД.СтранаПроисхождения) Тогда
					Страна		=""+ГТД.СтранаПроисхождения;
					НомерГТД	=СокрЛП(""+ГТД.Наименование);
				КонецЕсли;
				Если НомерГТД="" Тогда
					Сообщить("Для номенклатуры - "+ТекСтрока.Номенклатура+" - не определен номер ГТД! ");
					ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - Для номенклатуры - "+ТекСтрока.Номенклатура+" - не определен номер ГТД!","Важное");
					Ошибка=1;
				КонецЕсли;	
				
				//--------------------------------------------------------------------------------
				// ищем номер страны для гтд
				//--------------------------------------------------------------------------------
				Макет=Справочники.КлассификаторСтранМира.ПолучитьМакет("КлассификаторСтранМира");
				Искомое2 = СокрЛП(Страна);  //значение в макете есть, не находит
				Искомое = Макет.НайтиТекст(Искомое2); //,, ОбластьПоиска);
				Если Искомое<>Неопределено ТОгда
					Строка=Искомое.Низ;
					Колонка=Искомое.Лево+1; // для кода
				КонецЕсли;
				// получаем код
				
				Страна=Макет.Область(Строка,Колонка).Текст;
				//--------------------------------------------------------------------------------
				Элемент=ДокументДом.СоздатьЭлемент("CountryOfOriginCode");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Страна));                      
				ТекУзел4.ДобавитьДочерний(ТекстДом);
				
				//----------------------------------------------------------
				Элемент=ДокументДом.СоздатьЭлемент("CustomsDeclarationNumber");
				ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(НомерГТД));                      
				ТекУзел4.ДобавитьДочерний(ТекстДом);
				
			КонецЕсли; 
			// нечаева 05,05,16---
			
			
			//нечаева 25,09,18+++						
			// получим номера и кол-во упокавок, по данному товару.
			// для каждой строки проверим		
			ЭтоКомплектНом = 0;
			Если  ДокОбъект.Ссылка.ОтгрузкаКомплектов Тогда 
				//для комплектов и переклейки.
				
				
				ТЗУпаковокИНом = новый ТаблицаЗначений;       
				// тут продукция, нам нужен список комплектующих, для поиска по листам набора.
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ различные
				|	РасходнаяНакладнаяКомплектующие.Номенклатура
				|ИЗ
				|	Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
				|ГДЕ
				|	РасходнаяНакладнаяКомплектующие.Ссылка = &текдок
				|	И РасходнаяНакладнаяКомплектующие.Продукция = &текНом";
				Запрос.УстановитьПараметр("ТекДок",ДокОбъект.ссылка);
				Запрос.УстановитьПараметр("ТекНом",ТекСтрока.Номенклатура);
				СпНомВКомплекте = Запрос.Выполнить().Выгрузить();
				Если СпНомВКомплекте.Количество()>1 Тогда
					ЭтоКомплектНом = 1;
				иначе	
					//проверим переклейку
					Если СпНомВКомплекте[0].Номенклатура<> ТекСтрока.Номенклатура Тогда
						ЭтоКомплектНом = 1;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			//нечаева 21,11,18++
			Если  ДокОбъект.Ссылка.ОтгрузкаКомплектов  и ЭтоКомплектНом и НЕ ЕстьЛистыПереукладки Тогда 
				//нечаева 25,09,18 ---	                                  // нечаева 21,11,18---
				//для комплектов и переклейки.
				
				
				ТЗУпаковокИНом = новый ТаблицаЗначений;       
				// тут продукция, нам нужен список комплектующих, для поиска по листам набора.
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ различные
				|	РасходнаяНакладнаяКомплектующие.Номенклатура
				|ИЗ
				|	Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
				|ГДЕ
				|	РасходнаяНакладнаяКомплектующие.Ссылка = &текдок
				|	И РасходнаяНакладнаяКомплектующие.Продукция = &текНом";
				Запрос.УстановитьПараметр("ТекДок",ДокОбъект.ссылка);
				Запрос.УстановитьПараметр("ТекНом",ТекСтрока.Номенклатура);
				СпНомВКомплекте = Запрос.Выполнить().Выгрузить();
				
				ТЗУпаковокИНом = ПолучитьНомераУпаковокНом(СпНомВКомплекте,ДокОбъект);
				
				ТЗУпаковокИНом.свернуть("Продукция,Номер,ТипШК","Количество");
				
				ТЗУпаковокИНом.свернуть("Продукция,Номер","Количество");
				
				Для каждого СтрокаУп из ТЗУпаковокИНом     цикл
					
					Если СтрокаУп.количество = 0 Тогда
						продолжить;
					КонецЕсли;	
					
					Поиск = ТЗУпаковок.найти(СокрЛП(СтрокаУп.Номер),"Номер");
					Если Поиск<>Неопределено Тогда
						ИДУпаковки1 = СокрЛП(Поиск.код);					
					КонецЕсли;
					
					Элемент=ДокументДом.СоздатьЭлемент("Package-Reference");
					ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
					
					Элемент=ДокументДом.СоздатьЭлемент("PackageId");
					ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
					
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ИДУпаковки1));
					ТекУзел4.ДобавитьДочерний(ТекстДом);
					
					
					Элемент=ДокументДом.СоздатьЭлемент("Quantity");
					ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
					Кол=ЗаменитьТочку(СтрокаУп.Количество/ШтукВУпаковке,3);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Кол));                     
					
					ТекУзел4.ДобавитьДочерний(ТекстДом);
					
				конецЦикла;
				
			Иначе
				
				//Нечаева 09,04,18+++
				
				// не комплектация и не переклейка.			
				//ТЗУпаковокИНом = новый ТаблицаЗначений;
				//ТЗУпаковокИНом = ПолучитьНомераУпаковокНом(ТекСтрока.Номенклатура,ДокОбъект);
				//
				//ТЗУпаковокИНом.свернуть("Номенклатура,Номер,ТипШК","Количество");
				//
				//ТЗУпаковокИНом.свернуть("Номенклатура,Номер","Количество");
				
				//СписокСтрокизПаллет
				
				//нечаева 09,04,18---
				
				//Для каждого СтрокаУп из ТЗУпаковокИНом     цикл
				
				
				// и для листов переукладки, там всегда продукция
				Для каждого СтрокаУп из СписокСтрокизПаллет     цикл
					
					Если СтрокаУп.количество = 0 Тогда
						продолжить;
					КонецЕсли;	
					
					//Нечаева 09,04,18+++
					Если СтрокаУп.Номенклатура <> ТекСтрока.Номенклатура Тогда
						продолжить;
					КонецЕсли;
					
					Поиск = ТЗУпаковок.найти(СокрЛП(СтрокаУп.SSCCКод),"Номер");
					//Нечаева 09,04,18---
					Если Поиск<>Неопределено Тогда
						ИДУпаковки1 = СокрЛП(Поиск.код);					
					КонецЕсли;
					
					//
					//Поиск = ТЗУпаковок.найти(СокрЛП(СтрокаУп.Номер),"Номер");
					//Если Поиск<>Неопределено Тогда
					//	ИДУпаковки1 = СокрЛП(Поиск.код);					
					//КонецЕсли;
					
					Элемент=ДокументДом.СоздатьЭлемент("Package-Reference");
					ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
					
					Элемент=ДокументДом.СоздатьЭлемент("PackageId");
					ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
					
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ИДУпаковки1));
					ТекУзел4.ДобавитьДочерний(ТекстДом);
					
					
					Элемент=ДокументДом.СоздатьЭлемент("Quantity");
					ТекУзел4=ТекУзел3.ДобавитьДочерний(Элемент);
					Кол=ЗаменитьТочку(СтрокаУп.Количество/ШтукВУпаковке,3);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(Кол));                     
					
					ТекУзел4.ДобавитьДочерний(ТекстДом);
					
				конецЦикла;
			КонецЕсли;		
			
			
		КонецЕсли;
		
		РР=РР+1;
		
	КонецЦикла;
	
	Если Ошибка = 0 Тогда
		
		//Катаев+ 30/10/14 Для 7 континента не выводить
		Если ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-1973") Тогда
			КорневойЭлемент=ДокументДом.ЭлементДокумента;
			//-------- Order-Header ------------------------------------------
			ЭлементДом=ДокументДом.СоздатьЭлемент("DespatchAdvice-Summary");
			ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
			
			//Катаев+ 08/12/14 для Перекрестка вывод другого элемнета в подвале
			Если ДокОбъект.Контрагент.Родитель = Справочники.Контрагенты.НайтиПоКоду("SSR-4117") Тогда
				рр = рр-1;
				Элемент2=ДокументДом.СоздатьЭлемент("TotalLines");
				ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(рр));
				ТекУзел2.ДобавитьДочерний(ТекстДом);
			Иначе
				//----------------------------------------------------------------
				
				
				//Для подружки
				//Для подружки надо (табер трейд)
				//нечаева 05,02,16+++
				Если   ДокОбъект.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("SSP-3698")  Тогда
					
					Элемент2=ДокументДом.СоздатьЭлемент("TotalAmount");
					ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
					ОбщаяСумма=ЗаменитьТочку(ОбщаяСумма,2);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ОбщаяСумма));
					ТекУзел2.ДобавитьДочерний(ТекстДом);
					
				КонецЕсли;
				
				
				//------------------------------------------------------------
				Элемент2=ДокументДом.СоздатьЭлемент("TotalQuantity");  // общее количество
				ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
				текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(КолДок));
				ТекУзел2.ДобавитьДочерний(ТекстДом);
				//------------------------------------------------------------
				
				// для окей 
				// нечаева 19,08,15+++
				Если ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-5862") Тогда
					рр = рр-1;
					Элемент2=ДокументДом.СоздатьЭлемент("TotalLines");
					ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(рр));
					ТекУзел2.ДобавитьДочерний(ТекстДом);
					//------------------------------------------------------------
					//TotalGrossAmount - общая сумма с НДС
					
					Элемент2=ДокументДом.СоздатьЭлемент("TotalGrossAmount");
					ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
					ОбщаяСуммаСНДС=ЗаменитьТочку(ОбщаяСуммаСНДС,2);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ОбщаяСуммаСНдс));
					ТекУзел2.ДобавитьДочерний(ТекстДом);
					
					//------------------------------------------------------------
					//сумма НДС
					Элемент2=ДокументДом.СоздатьЭлемент("TotalTaxAmount");
					ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
					ОбщаяНДС=ЗаменитьТочку(ОбщаяНДС,2);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ОбщаяНДС));
					ТекУзел2.ДобавитьДочерний(ТекстДом);
					
				КонецЕсли;
				// нечаева 19,08,15---
				
				
				
				//Для подружки
				//Для подружки надо (табер трейд)
				//нечаева 05,02,16+++
				Если   ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-3698")  Тогда
					
					//TotalGrossAmount - общая сумма с НДС
					
					Элемент2=ДокументДом.СоздатьЭлемент("TotalGrossAmount");
					ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
					ОбщаяСуммаСНДС=ЗаменитьТочку(ОбщаяСуммаСНДС,2);
					текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ОбщаяСуммаСНдс));
					ТекУзел2.ДобавитьДочерний(ТекстДом);
				КонецЕсли;			
				
				
				
			КонецЕсли;
		КонецЕсли;
		
		//---------------------------------------------------------------
		ЗаписьДом=Новый ЗаписьDom;
		ЗаписьДом.Записать(ДокументДом,ЗаписьХМЛ);
		ЗаписьХМЛ.Закрыть();
		ф1 = новый ЧтениеТекста(ВремФайл);
		ф2 = Новый ЗаписьТекста(ИмяФайлаОбмена);
		стр = ф1.ПрочитатьСтроку();
		Пока стр <> Неопределено Цикл
			Если стр <> "<?xml version=""1.0"" encoding=""UTF-8""?>" Тогда
				ф2.ЗаписатьСтроку(стр);
			КонецЕсли;
			стр = ф1.ПрочитатьСтроку();
		КонецЦикла;
		ф2.Закрыть();
		ф1.Закрыть();
		//УдалитьФайлы(КаталогВременныхФайлов(),ДокОбъект.Номер+".xml");
		//Катаев+ 02/10/14
		
		//Сообщить("Сформирован файл: "+КаталогВременныхФайлов()+ДокОбъект.Номер+".xml");
		
		
		ДокОбъект.ПереданПокупателюВЭлВиде = Истина;
		ДокОбЪект.Записать();
		
		
		
		//ПереданПокупателюВЭлВиде = Истина;
		//ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - уведомление было успешно создано","Информация");
		//Катаев+ 14/11/14
		//Если Провайдер = 0 Тогда
		//	Если ПланыОбмена.Основной.ЭтотУзел() <> ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
		//		Соединение.Записать(ИмяФайлаОбмена, ИмяФайлаОбменаФТП);
		//		УдалитьФайлы(КаталогВременныхФайлов(),ДокОбъект.Номер+"_.xml");
		//		Сообщить("Сформирован файл на ftp: ");
		//		ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - уведомление было успешно создано","Информация");
		//	Иначе	
		#Если Клиент  Тогда
			Сообщить("Сформирован файл: "+ИмяФайлаОбмена);
		#КонецЕсли		
		ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - уведомление было успешно создано","Информация");
		
		//	КонецЕсли;
		//Иначе
		//	Соединение.Записать(ИмяФайлаОбмена, ИмяФайлаОбменаФТП);
		//	УдалитьФайлы(КаталогВременныхФайлов(),ДокОбъект.Номер+"_.xml");
		//	ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - подтверждение было успешно создано на ftp СКБ-Контур","Информация");
		//КонецЕсли;
		
		//нечаева 30,01,15 ++++
		// запишем данные в регистр сведений, чтобы не отправлять второй раз
		ЗаписатьДанныеВРегистрОтправкаЭлектронныхДокументов(ДокОбъект.ссылка,,Перечисления.ДокументЕКОД.УведомлениеОбОтгрузке);
		//нечаева 30,01,15 ---
		
		// нечаева  - пока оставим эту галку, посомтри, как будет работать обмен, до тестирования.
		//Катаев- 14/11/14
		//ДокОбъект.ПереданПокупателюВЭлВиде = Истина;
		//ДокОбЪект.Записать();
		//
		//Катаев- 02/10/14
		//	
	Иначе
		
		ЗаписатьВЛог("ЕКОД",Строка(ДокОбъект)+" - обнаружены ошибки, файл уведомления не создан!","Важное");
		#Если Клиент  Тогда
			Сообщить("Обнаружены ошибки, файл не записан!");
		#КонецЕсли
	КонецЕсли;
	
	
	
КонецПроцедуры
// 12,04,17--



Функция ПолучитьНомераУпаковокНом(ТекТовар,ДокОбъект)
	
	ТЗ = Новый ТаблицаЗначений;
	
	ТекДок = ДокОбъект.Ссылка;
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛистНабораТовары.Количество КАК Количество,
	|	ЛистНабораТовары.Номенклатура,
	|	ЛистНабораТовары.ТипШК,
	|	ВЫРАЗИТЬ(ВложенныйЗапрос.SSCCКод КАК СТРОКА(50)) КАК Номер,
	|	ВложенныйЗапрос.ЛистНабора
	|ИЗ
	|	Документ.ЛистНабора.Товары КАК ЛистНабораТовары
	|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПаллетаЛистыНабора.Ссылка.SSCCКод КАК SSCCКод,
	|			ПаллетаЛистыНабора.Ссылка КАК Ссылка,
	|			ПаллетаЛистыНабора.ЛистНабора КАК ЛистНабора
	|		ИЗ
	|			Документ.Паллета.ЛистыНабора КАК ПаллетаЛистыНабора
	|		ГДЕ
	|			ПаллетаЛистыНабора.ЛистНабора.Проведен = ИСТИНА) КАК ВложенныйЗапрос
	|		ПО ЛистНабораТовары.Ссылка = ВложенныйЗапрос.ЛистНабора
	|ГДЕ
	|	ЛистНабораТовары.Ссылка.ДокОснование = &ТекРНК
	|	И ЛистНабораТовары.Номенклатура в иерархии(&ТекНом)
	//нечаева 03,03,17++
	|	И ЛистНабораТовары.Ссылка.ПометкаУдаления = ложь
	|	И ВложенныйЗапрос.Ссылка.Проведен = истина";
	//нечаева 03,03,17--
	
	запрос.УстановитьПараметр("ТекРНК",ТекДок.ссылка);
	запрос.УстановитьПараметр("ТекНом",ТекТовар);
	резПалетты = Запрос.Выполнить().Выгрузить();
	//11,04,17 ++
	резПалетты.Колонки.Добавить("Продукция");
	//11,04,17 --
	КолПаллет = резПалетты.Количество();
	
	//11,04,17 ++
	//нечаева , если переклейка, или комплектация белье, тогда палетный ярлык по продукции, а не по номенклатуре.  
	Если  ДокОбъект.Ссылка.ОтгрузкаКомплектов Тогда
		
		ТЗПродукция = ДокОбъект.Комплектующие.Выгрузить();
		//заполним продукцию.		
		//11,04,17 ++
		//нечаева , если переклейка, или комплектация белье, тогда палетный ярлык по продукции, а не по номенклатуре.  
		Если  ДокОбъект.Ссылка.ОтгрузкаКомплектов Тогда
			
			ТЗПродукция = ДокОбъект.Комплектующие.Выгрузить();
			//заполним продукцию.		
			Для каждого текстрока из резПалетты Цикл
				НайденнаяСтрока = ТЗПродукция.Найти(ТекСтрока.номенклатура,"номенклатура");
				Если НайденнаяСтрока <> Неопределено ТОгда
					ТекСтрока.Продукция = НайденнаяСтрока.Продукция;
				КонецЕсли;
			КонецЦикла;		
			
		КонецЕсли;	
		
	КонецЕсли;	
	//11,04,17 --
	
	ТЗ = резПалетты;
	
	
	возврат ТЗ;
	
КонецФункции

Функция ПолучитьНомераУпаковок(ДокОбъект)
	
	ТЗ = Новый ТаблицаЗначений;
	
	ТекДок = ДокОбъект.Ссылка;
	
	запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеквизитыРНКПНКПРМ.ЗначениеРеквизита как Номер,
	|	0 КАК Код
	|ИЗ
	|	РегистрСведений.РеквизитыРНКПНКПРМ КАК РеквизитыРНКПНКПРМ
	|ГДЕ
	|	РеквизитыРНКПНКПРМ.Документ = &текдок
	|	И РеквизитыРНКПНКПРМ.ИмяРеквизита ПОДОБНО &рек";
	запрос.УстановитьПараметр("ТекДок",ТекДок.ссылка);
	запрос.УстановитьПараметр("рек","СерийныйНомерУпаковки%");
	РезКоды = Запрос.Выполнить().Выгрузить();
	
	РР=2;
	Для каждого Стр Из 	РезКоды цикл
		
		Стр.код = РР;
		РР=РР+1;
		
	КонецЦикла;
	
	
	ТЗ = резКоды;
	
	
	возврат ТЗ;
	
КонецФункции

Процедура  ЗаписатьДанныеВРегистрОтправкаЭлектронныхДокументов(ДокСсылка,ОшибкаЗаписи=неопределено,ВидДокумента)
	
	//очистим, если есть данные
	НаборЗаписей = РегистрыСведений.ОтправкаЭлектронныхДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВидДокумента.Установить(ВидДокумента); 
	НаборЗаписей.Отбор.Документ.Установить(ДокСсылка); 
	НаборЗаписей.Записать(); 
	
	//запишем
	НаборЗаписей = РегистрыСведений.ОтправкаЭлектронныхДокументов.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.ВидДокумента.Установить(ВидДокумента); 
	НаборЗаписей.Отбор.Документ.Установить(ДокСсылка); 
	
	НоваяЗапись = НаборЗаписей.Добавить(); 
	НоваяЗапись.ВидДокумента = ВидДокумента;
	НоваяЗапись.НомерЗаказа = ДокСсылка.НомерЗаказа;
	НоваяЗапись.датаЗаказа  = ДокСсылка.ДатаЗаказа;
	Новаязапись.Документ = ДокСсылка;
	новаязапись.ДокументОтправлен = истина;
	новаязапись.дата = ТекущаяДата();
	
	НаборЗаписей.Записать(); 
	
	//тут же Регистрируем записи в обмен  из набора записей в SNL
	// для филиалов, со складов будет в Цо писаться, обмен по регистру идет только в офис.
	Если ПараметрыСеанса.ЭтотУзел.ТипУзла <> Перечисления.ТипУзлаИБ.УправляющееПодразделение и ПараметрыСеанса.ЭтотУзел.ТипУзла <> Перечисления.ТипУзлаИБ.Склад 	Тогда
		
		тзНаборЗаписей = НаборЗаписей.Выгрузить();
		НаборЗаписей.Отбор.ВидДокумента.Установить(ВидДокумента); 
		НаборЗаписей.Отбор.ВидДокумента.Использование=Истина;
		НаборЗаписей.Отбор.Документ.Установить(ДокСсылка);
		НаборЗаписей.Отбор.Документ.Использование=Истина;
		
		НаборЗаписей.Отбор.НомерЗаказа.Установить(ДокСсылка.номерЗаказа);
		НаборЗаписей.Отбор.номерЗаказа.Использование=Истина;
		НаборЗаписей.Отбор.датаЗаказа.Установить(ДокСсылка.ДатаЗаказа);
		НаборЗаписей.Отбор.ДатаЗаказа.Использование=Истина;
		
		НаборЗаписей.Прочитать();
		НаборЗаписей.ОбменДанными.Получатели.Добавить(ПланыОбмена.Основной.НайтиПоКоду("SNL"));			  
		ПланыОбмена.ЗарегистрироватьИзменения(ПланыОбмена.Основной.НайтиПоКоду("SNL"),НаборЗаписей);
		
	КонецЕсли;	
	//конец регистрации обмена	регистра
	
КонецПроцедуры

Функция ЗаменитьТочку(ИсхЧисло,КолПослеЗапятой)
	
	//Катаев+ 19/12/14
	//СтрокаЧ=Формат(ИсхЧисло,"ЧДЦ="+КолПослеЗапятой+"");
	СтрокаЧ=Формат(ИсхЧисло,"ЧДЦ="+КолПослеЗапятой+"; ЧН=");
	//Катаев- 19/12/14
	СтрокаЧ=Строка(СтрокаЧ);
	СтрокаЧ= СтрЗаменить(СтрокаЧ,",",".");
	
	Возврат СтрокаЧ;
	
КонецФункции

Функция ПолучитьИЛН_Пост(Склад)
	Если Склад.ТипСклада = Перечисления.ТипСклада.Филиал ТОгда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ИЛН_Организации.Наименование
		|ИЗ
		|	Справочник.ИЛН_Организации КАК ИЛН_Организации
		|ГДЕ
		|	ИЛН_Организации.Узел.Подразделение = &Подразделение";
		Запрос.УстановитьПараметр("Подразделение", Склад.Подразделение);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Наименование;
		Иначе
			Возврат "4607182079990EC";
		КонецЕсли;
	Иначе
		Возврат "4607182079990EC";
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция ПолучитьПутьДляУвед(Путь)
	Пути = НайтиФайлы(Путь,"DESADV_*");
	Кол = Пути.Количество();
	Если Кол = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Пути[кол-1].ПолноеИмя;
	КонецЕсли;
КонецФункции

//----------------------------------------------------------------------------------------------
//-----------------------------------------------------------------------------------------------
//нечаева 02,12,16 ---





Процедура Сформировать(ТаблицаПараметров=НЕОПРЕДЕЛЕНО) Экспорт
	
	////+++
	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Кухарь А.Ю. 31.03.2026 начало
	// Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом тогда
	Если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() тогда
		//Кухарь А.Ю. 31.03.2026 конец
       
		ЗаписатьВЛог("Курьер","Отмена выполнения. Задача: Загрузка ПНК из Сферы Курьер. Автообмен разрешен для базы: """+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
		Возврат;
	КонецЕсли;
	

	ЗагрузитьДокументы("");
 	
	
	
	ЗаписатьВЛог("Курьер","Конец выполнения. Задача:  Загрузка ПНК из Сферы Курьер. !","Информация");                     

	
КонецПроцедуры	




//------
Процедура ЗагрузитьДокументы2()
	
	
	
	
	
КонецПроцедуры



Процедура СформироватьЗагрузкаУПД() Экспорт
	
	
	
	
	ИмяФайла = "C:\Users\nechaeva\Desktop\Гипеглобус акт расхождения\UPD_DOP_707235115_88520721_04.06.2025_7743543761_ООО ГИПЕРГЛОБУС.xml";
	
	ЗагрузитьДокументы(ИмяФайла);
	
		
КонецПроцедуры


Функция НайтиАдресПД (Индекс, город, улица,Контрагент)
	
	
	Запрос = Новый Запрос;
	запрос.текст = 	"ВЫБРАТЬ
	|	Адрес.Индекс КАК Индекс,
	|	Адрес.Регион КАК Регион,
	|	Адрес.Район КАК Район,
	|	Адрес.Город КАК Город,
	|	Адрес.НаселенныйПункт КАК НаселенныйПункт,
	|	Адрес.Улица КАК Улица,
	|	Адрес.Дом КАК Дом,
	|	Адрес.Объект.Ссылка.Владелец КАК ОбъектСсылка,
	|	Адрес.Объект.Ссылка КАК ПД
	|ИЗ
	|	(ВЫБРАТЬ
	|		КонтактнаяИнформация.Объект КАК Объект,
	|		КонтактнаяИнформация.Поле1 КАК Индекс,
	|		КонтактнаяИнформация.Поле2 КАК Регион,
	|		КонтактнаяИнформация.Поле3 КАК Район,
	|		КонтактнаяИнформация.Поле4 КАК Город,
	|		КонтактнаяИнформация.Поле5 КАК НаселенныйПункт,
	|		КонтактнаяИнформация.Поле6 КАК Улица,
	|		КонтактнаяИнформация.Поле7 КАК Дом
	|	ИЗ
	|		РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|	ГДЕ
	|		КонтактнаяИнформация.Вид = &Вид
	|		И КонтактнаяИнформация.Тип = &Тип) КАК Адрес
	|ГДЕ
	|	Адрес.Объект.Владелец = &текконтр
	|	И Адрес.Индекс = &ТекИндекс
	|
	|УПОРЯДОЧИТЬ ПО
	|	Индекс"; 
	
	
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("ТекИндекс", Индекс);
	Запрос.УстановитьПараметр("текконтр", Контрагент);
	
	РЕз = запрос.Выполнить().Выбрать();
	ПД = неопределено;
	Пока рез.Следующий() цикл
		
		ТекПД = рез.ПД;
		Наименование = ТекПД.Наименование;			               
		
		Если СтрНайти(Наименование, "на прямую") > 0 Тогда
			продолжить;;
		Иначе
			ПД = ТекПД;
			прервать;
		КонецЕсли; 
	КонецЦикла;
		
	возврат ПД;
	
	
КонецФункции	

 
Процедура ПрочитатьМаркировку(ИмяФайла=неопределено) экспорт
	
		
	//ИмяФайла = "C:\Users\nechaeva\Desktop\Гипеглобус акт расхождения\UPD_DOP_707235115_88520721_04.06.2025_7743543761_ООО ГИПЕРГЛОБУС.xml";
	ТзНужноЗавести = новый таблицаЗначений;
	ТзНужноЗавести.очистить();
	
	//Состояние("Чтение файла от ВБ");
	тзМарки.Очистить();

	ТЗНайденыУНас = новый ТаблицаЗначений;
	ТЗНайденыУНас.Очистить();
	
	МенеджерXML = Обработки.ПостроительXML.Создать();
	Данные = МенеджерXML.ПрочитатьXDTO(ИмяФайла);    
	тзМаркиВБ.Очистить();
	Ном = 0; 
	УчитыватьРасхождения = Истина;
	
	// ОснПер,ДокПодтвОтгр - заполнить тоже.	
	Версия = МенеджерXML.ЗначениеСвойстваXDTO(Данные,"ВерсФорм");       
	
	//ИдФайл = МенеджерXML.ЗначениеСвойстваXDTO(Данные,"ИдФайл");
	Документ = МенеджерXML.ЗначениеСвойстваXDTO(Данные,"Документ");
	КНД = МенеджерXML.ЗначениеСвойстваXDTO(Документ,"КНД");
	ВремИнфПр = МенеджерXML.ЗначениеСвойстваXDTO(Документ,"ВремИнфПр");
	ДатаИнфПр = МенеджерXML.ЗначениеСвойстваXDTO(Документ,"ДатаИнфПр");
	ТипУПД = МенеджерXML.ЗначениеСвойстваXDTO(Документ,"Функция");
	СвСчФакт = МенеджерXML.ЗначениеСвойстваXDTO(Документ,"СвСчФакт");  
	Если Версия = "5.01" Тогда
		НомерСчФ = МенеджерXML.ЗначениеСвойстваXDTO(СвСчФакт,"НомерСчФ");
		ДатаСчФ = МенеджерXML.ЗначениеСвойстваXDTO(СвСчФакт,"ДатаСчФ");
		КодОКВ = МенеджерXML.ЗначениеСвойстваXDTO(СвСчФакт,"КодОКВ");	    
	Иначе
		НомерСчФ = МенеджерXML.ЗначениеСвойстваXDTO(СвСчФакт,"НомерДок");
		ДатаСчФ = МенеджерXML.ЗначениеСвойстваXDTO(СвСчФакт,"ДатаДок");
		КодОКВ = "643";	    
	КонецЕсли;
	
	//-----------------------------------------------------------------------------------------
	ДокПодтвОтгрНом =  МенеджерXML.ЗначениеСвойстваXDTO(СвСчФакт,"ДокПодтвОтгрНом");
	РеквДатаДок = МенеджерXML.ЗначениеСвойстваXDTO(ДокПодтвОтгрНом,"РеквДатаДок");
	РеквНаимДок = МенеджерXML.ЗначениеСвойстваXDTO(ДокПодтвОтгрНом,"РеквНаимДок");
	РеквНомерДок = МенеджерXML.ЗначениеСвойстваXDTO(ДокПодтвОтгрНом,"РеквНомерДок");
	//-----------------------------------------------------------------------------------------
	ТаблСчФакт = МенеджерXML.ЗначениеСвойстваXDTO(Документ,"ТаблСчФакт");  
	
	СведТов = МенеджерXML.ЗначениеСвойстваXDTO(ТаблСчФакт,"СведТов");
	Если ТипЗнч(СведТов) = Тип("СписокXDTO") Тогда
		Для каждого ЭлементСписка Из СведТов Цикл
			НомСтр = МенеджерXML.ЗначениеСвойстваXDTO(ЭлементСписка,"НомСтр");  
			ДопСведТов = МенеджерXML.ЗначениеСвойстваXDTO(ЭлементСписка,"ДопСведТов"); 
							
			Наименование = МенеджерXML.ЗначениеСвойстваXDTO(ЭлементСписка,"НаимТов");  
			НомСредИдентТов = МенеджерXML.ЗначениеСвойстваXDTO(ДопСведТов,"НомСредИдентТов");  
			СписокКИЗ = МенеджерXML.ЗначениеСвойстваXDTO(НомСредИдентТов,"КИЗ");
			
			Если СписокКИЗ<>Неопределено ТОгда
				//<ИнфПолФХЖ2 Значен="8008583029786" Идентиф="SSKU"/>
				Если ТипЗнч(СписокКИЗ) = Тип("Строка") Тогда
					Ном = Ном + 1;       
					НоваяСтрока = тзМаркиВБ.Добавить();  
					//НоваяСтрока.НомерПП =  Ном;
					НоваяСтрока.Номер =  НомСтр;
					НоваяСтрока.Наименование = Наименование;
					НоваяСтрока.КИЗ = СписокКИЗ;
				Иначе		
					Для каждого ЭлементСпискаКИЗ Из СписокКИЗ Цикл
						//КИЗ = ЭлементСпискаКИЗ;	
						Ном = Ном + 1;       
						НоваяСтрока = тзМаркиВБ.Добавить();  
						НоваяСтрока.Номер =  НомСтр;
						НоваяСтрока.Наименование = Наименование;
						НоваяСтрока.КИЗ = ЭлементСпискаКИЗ;
						
						//ОбработкаПрерыванияПользователя();
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;  
	Иначе 
		// если одна строка в списке
		НомСтр = МенеджерXML.ЗначениеСвойстваXDTO(СведТов,"НомСтр");  
		ДопСведТов = МенеджерXML.ЗначениеСвойстваXDTO(СведТов,"ДопСведТов");  
		КодТов = МенеджерXML.ЗначениеСвойстваXDTO(ДопСведТов,"КодТов");  
		Наименование = МенеджерXML.ЗначениеСвойстваXDTO(СведТов,"НаимТов");  
		НомСредИдентТов = МенеджерXML.ЗначениеСвойстваXDTO(ДопСведТов,"НомСредИдентТов");  
		СписокКИЗ = МенеджерXML.ЗначениеСвойстваXDTO(НомСредИдентТов,"КИЗ"); 
		Если СписокКИЗ<>Неопределено ТОгда		
			
			Если ТипЗнч(СписокКИЗ) = Тип("Строка") Тогда
				Ном = Ном + 1;       
				НоваяСтрока = тзМаркиВБ.Добавить();  
				//НоваяСтрока.НомерПП =  Ном;
				НоваяСтрока.Номер =  НомСтр;
				НоваяСтрока.Наименование = Наименование;
				НоваяСтрока.КИЗ = СписокКИЗ; 
			Иначе		
				Для каждого ЭлементСпискаКИЗ Из СписокКИЗ Цикл
					//КИЗ = ЭлементСпискаКИЗ;	
					Ном = Ном + 1;       
					НоваяСтрока = тзМаркиВБ.Добавить();  
					//НоваяСтрока.НомерПП =  Ном;
					НоваяСтрока.Номер =  НомСтр;
					НоваяСтрока.Наименование = Наименование;
					
					НоваяСтрока.КИЗ = ЭлементСпискаКИЗ;
					//ОбработкаПрерыванияПользователя();
				КонецЦикла;
			КонецЕсли; 
		конецЕсли;
	КонецЕсли;
//	Состояние("Обработка файла от Яндекса");
	
	// с нашими данными не сверяем. Только, что марки наши проверять будем.	
	тзНашиМарки.Очистить();                
	// пока сделаем файл без проверки на наши марки.
	МаркиУПД.Очистить();  // заполним только проверенными?
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
// тут только марки, которые мы нашли у нас
	Запрос.Текст = 	"ВЫБРАТЬ
	               	|	втМарки.КИЗ КАК КИЗ
	               	|ПОМЕСТИТЬ втМарки
	               	|ИЗ
	               	|	&тзМарки КАК втМарки
	               	|;
	               	|
	               	|////////////////////////////////////////////////////////////////////////////////
	               	|ВЫБРАТЬ
	               	|	ШтрихкодыУпаковокТоваров.Ссылка КАК Марка,
	               	|	втМарки.КИЗ КАК КИЗ
	               	|ПОМЕСТИТЬ втМаркиСравнение
	               	|ИЗ
	               	|	втМарки КАК втМарки
	               	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	               	|		ПО втМарки.КИЗ = ШтрихкодыУпаковокТоваров.Наименование
	               	|;
	               	|
	               	|////////////////////////////////////////////////////////////////////////////////
	               	|ВЫБРАТЬ
	               	|	втМаркиСравнение.КИЗ КАК КИЗ
	               	|ИЗ
	               	|	втМаркиСравнение КАК втМаркиСравнение";           
	
	         	
	Запрос.УстановитьПараметр("тзМарки", тзМаркиВБ);
	Запрос.УстановитьПараметр("пусто", "");
	Запрос.УстановитьПараметр("ВыбКонтрагент", справочники.Контрагенты.НайтиПоКоду("SST-1967")); 
	ДатаСФ = СтрокаДаты_ДД_ММ_ГГГГ_ВДату(ДатаСчФ);

	Запрос.УстановитьПараметр("ВыбДата", ДатаСФ);
	ТЗНайденыУНас = Запрос.Выполнить().Выгрузить();
	ТЗМаркиУПД = ТЗНайденыУНас.ВыгрузитьКолонку("КИЗ"); // здесь марки, которые попали.  
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	втМарки.КИЗ КАК КИЗ
	               |ПОМЕСТИТЬ втМаркиН
	               |ИЗ
	               |	&тзМарки КАК втМарки
	               |ГДЕ
	               |	 НЕ (втМарки.КИЗ В(&тзТовары))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втМарки.КИЗ КАК КИЗ
	               |ИЗ
	               |	втМаркиН КАК втМарки";           
	

    запрос.УстановитьПараметр("тзМарки",тзМаркиВБ); 
	запрос.УстановитьПараметр("тзТовары",ТЗМаркиУПД);
	ТзРазхождения = запрос.Выполнить().Выгрузить();
		
	//
	ТЗ1=Новый ТаблицаЗначений;
	ТЗ1=тзМаркиВБ.Скопировать(,"КИЗ"); ТЗ12 =ТЗ1.скопировать();
	ТЗ1.сортировать("КИЗ");
	ТЗ1.Свернуть("КИЗ");
	
	ТЗ2=Новый ТаблицаЗначений;
	ТЗ2=ТЗНайденыУНас.Скопировать(,"КИЗ");   ТЗ22 =ТЗ1.скопировать();
	
	ТЗ2.Свернуть("КИЗ");
		
	Ответ = РазницаТаблицЗначений(ТЗ1, ТЗ2, "КИЗ");
	ТзНужноЗавести =Ответ.скопировать();
	
	//Если Ответ.количество()>0 Тогда
	//	ТабДокумент = Новый ТабличныйДокумент;
	//	Построитель = Новый ПостроительОтчета;
	//	
	//	Построитель.ИсточникДанных=Новый ОписаниеИсточникаДанных(ответ);       
	//	Построитель.Вывести(ТабДокумент);
	//	ТабДокумент.ОтображатьСетку = ложь;
	//	ТабДокумент.Показать("Расхождения в марках");
	//	
	//	//ЗаписатьВЛог("Маркировка","Не удалось записать документ ХКМ, к ПНК Гиперглобус - "+ТекущаяДата()+" "+ОписаниеОшибки(),,,,);

	//	//Сообщить("Количество расхождений в марках: "+ответ.количество());   // (1- НЕТ В НАШЕЙ ВЫБОРКЕ рнк, 0 - НЕТ В ФАЙЛЕ ВБ) =
	//иначе
	//	//Сообщить("Все марки есть в базе. ");	
	//КонецЕсли;	
	//

	
КонецПроцедуры //Загрузить

 Функция СтрокаДаты_ДД_ММ_ГГГГ_ВДату(Строка)
    Д = Число(Сред(Строка, 1, 2));
    М = Число(Сред(Строка, 4, 2));
    Г = Число(Сред(Строка, 7, 4));
    Возврат Дата(Г, М, Д);
    
КонецФункции 

 
функция ПолучитьСписокМарок(ТзМаркиУПД,НомерСтроки)
	
		Марки = новый ТаблицаЗначений;
		Марки.Очистить();
		
		ТЗ2  = Новый ТаблицаЗначений;
		ТЗ2.Колонки.Добавить("КИЗ", Новый ОписаниеТипов("Строка"));
		ТЗ2.Колонки.Добавить("НомСтроки", Новый ОписаниеТипов("Строка"));
			
		Запрос = Новый Запрос;
		ДанныеСкладов=Неопределено;
		МВТ = Новый МенеджерВременныхТаблиц;
		Запрос.МенеджерВременныхТаблиц = МВТ;
		Запрос.Текст  = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗ2.КИЗ КАК Киз,
		|	ТЗ2.Номер 
		|ПОМЕСТИТЬ ТЗ2
		|ИЗ
		|	&ТЗ2 КАК ТЗ2
		|ГДЕ
		|	 ТЗ2.Номер = &Номер";
			
		Запрос.УстановитьПараметр("Номер",НомерСтроки);
		Запрос.УстановитьПараметр("ТЗ2",ТзМаркиУПД);	
		Запрос.Выполнить();
		
		Запрос.Текст="ВЫБРАТЬ
		|	ТЗ2.КИЗ КАК Киз,
		|	ТЗ2.Номер 
		|ИЗ
		|	ТЗ2 КАК ТЗ2";          
		Марки=Запрос.Выполнить().Выгрузить();
		
		
     возврат Марки;
	
	
	
конецФункции
       
Функция РазницаТаблицЗначений(Таблица0, Таблица1, Измерения) Экспорт
//	состояние("Сверка кодов");
	ВсеКолонки = "";
	Для Каждого Колонка Из Таблица0.Колонки Цикл 
		ВсеКолонки = ВсеКолонки + ", " + Колонка.Имя
	КонецЦикла;
	ВсеКолонки = Сред(ВсеКолонки, 2);
	
	Таблица = Таблица1.Скопировать();    
	
	Таблица.Колонки.Добавить("Знак", Новый ОписаниеТипов("Число"));
	
	Таблица.ЗаполнитьЗначения(1, "Знак");
	
	Для Каждого Строка Из Таблица0 Цикл 
		ЗаполнитьЗначенияСвойств(Таблица.Добавить(), Строка); 
	КонецЦикла;
	
	Таблица.Колонки.Добавить("Счёт");
	Таблица.ЗаполнитьЗначения(1, "Счёт");
	
	Таблица.Свернуть(ВсеКолонки, "Знак, Счёт");   
	//Таблица = новый таблицаЗначений;
	//таблица.колонки.Удалить(1);
	
	Ответ = Таблица.Скопировать(Новый Структура("Счёт", 1), ВсеКолонки + ", Знак");
	
	Ответ.Сортировать(Измерения);
	Ответ.колонки.добавить("НеНайдено");
	Для каждого Строка из Ответ цикл
		Если Строка.Знак = 1 ТОгда Строка.НеНайдено = "нет в нашем файле"; Иначе Строка.НеНайдено = " марка не найдена в нашей базе";   конецЕсли;	
	КонецЦикла;
	Ответ.колонки.Удалить(1);
	
	Возврат Ответ
	
КонецФункции


// нечаева 22,04,26 +++ MARK-3641
Процедура ПроверкаНаКривыеМарки(ТЗ)
	
	// удалим "0102"
	Индекс = ТЗ.Количество() - 1; 
	Пока Индекс >= 0 Цикл 
		ТСтр = ТЗ[Индекс];
		Если ТСтр.КИЗ = ""  или Лев(ТСтр.КиЗ,4) = "0102" Тогда 
			ТЗ.Удалить(Индекс); 
		КонецЕсли; 
		Индекс = Индекс - 1; 
	КонецЦикла;
		
КонецПроцедуры	
// нечаева 22,04,26 --- MARK-3641

Процедура ЗагрузитьДокументы(Путь)
	
	// сгенерируем пути и их перенос в папку Архив, при загрузке.
	ПапкаДокументов = "\\SRVECOD-C\SferaConnector\Courier\Dmitrieva_S_2BK-7717115270-1027739177047\IN\Processed\7743543761\UpdInfo";  
	//// это для Гипеглобуса только. Пока только ему это нужно.
	//
	ПутьКаталога = "\\SRVECOD-C\SferaConnector\Courier\Dmitrieva_S_2BK-7717115270-1027739177047\IN\Processed\7743543761\UpdInfo";
	ПутьКаталогаКопии = "\\SRVECOD-C\SferaConnector\Courier\Dmitrieva_S_2BK-7717115270-1027739177047\IN\Processed\7743543761\UpdInfo\Arhiv\";
	
	//
	//ПапкаДокументов = "O:\test_gip";
	//ПутьКаталога = "O:\test_gip";
	//ПутьКаталогаКопии = "O:\test_gip\Arhiv\";
	
	ФайлыДанных = НайтиФайлы(ПутьКаталога,"*.xml");
	Для Каждого ФайлДанных Из ФайлыДанных Цикл
		Если ФайлДанных.ПолноеИмя +"\" <> ПутьКаталога Тогда
			КопироватьФайл(ФайлДанных.ПолноеИмя,ПутьКаталогаКопии+ФайлДанных.Имя);
			//ЗаписатьВЛог("Тестирование екод","Успешно скопирован файл "+ФайлДанных.ПолноеИмя + " в "+ПутьКаталогаКопии+ФайлДанных.Имя,"Информация");
			
		КонецЕсли;
	КонецЦикла;
	// потом удалять скопированные файлы, после обработки успешной!
	
	
	//---------------------------------------------------------
	// сама обработка файлов
	//---------------------------------------------------------
	Для Каждого ФайлДанных Из ФайлыДанных Цикл
		
		Путь1 = ФайлДанных.ПолноеИмя;
		//сообщить(путь1);
		СформироватьСтруктуруУПД(Путь1,ФайлДанных.Имя);
		// ------ прочитаем файл, если  пнк не найдено , то следующий
		ДокументДляЗагрузки = НайтиПНКСклада(ТЗШАпка[0]);
		Если ДокументДляЗагрузки = неопределено тогда
			продолжить;
		КонецЕсли; 
		// -----------Если ПНК уже загружено, не перезагружаем.		
		//ТзДК = ДокументДляЗагрузки.Заказ;
		//
		//Если тзДК.количество()>0 ТОгда
		//	//сообщить("ПНК заполнено уже");
		//	возврат истина;
		//КонецЕсли;
    	//-------------------------------------------------------
       	
		ПрочитатьМаркировку(Путь1);
		// загрузить ПНК
		Успешно = СформироватьПНК(ТЗШапка,ТЗПечать,ФайлДанных.ПолноеИмя); 
		Если Успешно Тогда
			
			ДокументДляЗагрузки = НайтиПНКСклада(ТЗШАпка[0]);
			
			// Нечаева 22.04,26 +++ /по просьбе Заболотновой уберем марки с "0102"  ,MARK-3641
			ПроверкаНаКривыеМарки(ТзНужноЗавести);
            // Нечаева 22.04,26 ---
			
			// проверка не наших марок
			Если ТзНужноЗавести.количество()>0 Тогда
				ЗавестинНеНашиМарки(ДокументДляЗагрузки,ТзНужноЗавести);   
			КонецЕсли;
			// наши марки и не наши нужно добавить 
			Если тзМаркиВБ.Количество()>0 Тогда
				ФормированиеХКМ(ДокументДляЗагрузки,тзМаркиВБ); //ТЗНайденыУНас); // а надо вообще , чтобы все добавились!!!!
			КонецЕсли;
			
		КонецЕсли;
		
		// очистим файл
		//Если Успешно ТОгда
		//	УдалитьФайлы(ФайлДанных.ПолноеИмя);
		//КонецЕсли;
		
	КонецЦикла;
	
	
	
	 
КонецПроцедуры	


Процедура ЗавестинНЕНашиМарки(ПНК,СписокМарок)
	
	Хвост="***************************************************************************************************************************************************";
	
	ТекСтрока = 1; ТекКолонкаКМ = 1; 	
	гс1=31;
	гс2=37;
	
	// ПОТОМ ИЩЕМ ПО ДОК ОСНОВАНИЮ И ЗАПИСЫВАЕМ.  
	
	Запрос = новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ХранилищеКодовМаркировки.Ссылка КАК Ссылка
	              |ИЗ
	              |	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ХранилищеКодовМаркировки
	              |ГДЕ
	              |	ХранилищеКодовМаркировки.ДокументОснование = &ТекДок
	              |	И ХранилищеКодовМаркировки.ПометкаУдаления = ЛОЖЬ";
	
	запрос.УстановитьПараметр("ТекДок", пнк);  
	
	Рез = запрос.Выполнить().Выгрузить();  
	Если рез.Количество()>0 Тогда
		Заказкм  = рез[0].ссылка;
	иначе
		Заказкм = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.СоздатьДокумент();
		Заказкм.ДокументОснование = пнк;
		Заказкм.ВидНоменклатурыЧЗВДокументе = ПЕРЕЧИСЛЕНИЯ.ВидыНоменклатурыЧЗ.Набор;
		заказкм.Комментарий = "Загрузка ПНК из СФЕРЫ";
		Заказкм.Организация = справочники.Организации.НайтиПоКоду("SS-001");  // ее
		Заказкм.Дата = ТекущаяДата();
		Заказкм.Статус = ПЕРЕЧИСЛЕНИЯ.СтатусыДокументовМаркировки.ВРаботе;  // ПОТОМ НА ОБРАБОТАН ЗАМЕНИТЬ
		Заказкм.СпособВводаВОборот = перечисления.СпособыВводаВОборотСУЗ.ПокупкаВРФ;
		Заказкм.ПодразделениеНанесения = СПРАВОЧНИКИ.Подразделения.НайтиПоКоду("SSP-0211"); // склад часцы.
		Заказкм.Записать();	
		Заказкм = заказкм.Ссылка;
	КонецЕсли;
	
	//если не ЗначениеЗаполнено(ЗаказКМ) тогда
	//	Сообщить("Заполните заказ");
	//	Возврат;
	//КонецЕсли;
	

	
	Для каждого текстрока из СписокМарок цикл

		СтруктураДанных=новый Структура("Владелец,Наименование,ЗаказКМ,ЗначениеШтрихкода,КодировкаШтрихкода,Количество,ТипКода,ТипУпаковки,ТипШК,СпособВводаВОборот");
		СтруктураДанных.СпособВводаВОборот = ЗаказКМ.СпособВводаВОборот;
		СтруктураДанных.ЗаказКМ=ЗаказКМ.Ссылка;
		СтруктураДанных.КодировкаШтрихкода = Перечисления.ТипыКодировокШК.GS1_DataMatrix;
		СтруктураДанных.Количество = 1;
		СтруктураДанных.ТипКода = Перечисления.ТипыКодовМаркировки.Товар;
		СтруктураДанных.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар;
		СтруктураДанных.ТипШК=Перечисления.ТипыШтрихКодов.Штука;
		
	
	    Кодкм= ТекстрОКА.киз;
		если КодКМ="" тогда Прервать; КонецЕсли;
		
		если СтрДлина(КодКМ)=31 тогда
			КодКМ=Лев(КодКМ+Хвост,83);
		ИначеЕсли СтрДлина(КодКМ)=83 тогда
		иначе
			//Сообщить("неправильная длинна кода ЧЗ - "+КодКМ);
			Продолжить;			
		КонецЕсли;
		
		Кусок1=Лев(КодКМ,31);
		кусок2=Сред(КодКм,32,6);
		Кусок3=Сред(КодКм,38);
		
		СтруктураДанных.ЗначениеШтрихКода=Кусок1+"<GS>"+кусок2+"<GS>"+Кусок3;
		СтруктураДанных.Наименование=Лев(КодКМ,31);
		если СтрДлина(СтруктураДанных.ЗначениеШтрихКода)<>91 тогда
			//Сообщить("неправильная длинна кода ЧЗ - "+КодКМ);
			Продолжить;
		КонецЕсли;
		ГТИН=Сред(КодКм,3,14);

		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
		             |	Номенклатура.Ссылка КАК Ссылка
		             |ИЗ
		             |	Справочник.Номенклатура КАК Номенклатура
		             |ГДЕ
		             |	Номенклатура.ГТИН = &ГТИН
		             |	И не Номенклатура.ПометкаУдаления";
		запрос.УстановитьПараметр("ГТИН",ГТИН);
		Результат=запрос.Выполнить().Выгрузить();
		если результат.Количество()=0 тогда
			//Сообщить(");
			ЗаписатьВЛог("Маркировка","по коду "+КодКМ+" не нашлось владельца - "+ пнк+" ",,,,);
           
			Продолжить;
		иначе
			СтруктураДанных.Владелец = Результат.Получить(0).ссылка;
		КонецЕсли;
		
		КодЧЗ = НайтиЧЗ(СокрЛП(СтруктураДанных.Наименование));
		Если КодЧЗ = Неопределено Тогда
			КодЧЗ=Справочники.ШтрихкодыУпаковокТоваров.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(КодЧЗ,СтруктураДанных);
			КодЧЗ.Записать();
		Иначе
			Если КодЧЗ.ЗаказКМ = ЗаказКМ Тогда
				Продолжить;     
			Иначе
				//Сообщить("Уже есть код ЧЗ "+СтруктураДанных.Наименование+" док Эмиссии: "+КодЧЗ.ЗаказКМ );
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
	
КонецПроцедуры

Функция НайтиЧЗ(Строка)
	ЗАпрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК МаркаЧЗ
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	ШтрихкодыУпаковокТоваров.Наименование = &Наименование
	|	И НЕ ШтрихкодыУпаковокТоваров.ПометкаУдаления";
	Запрос.УстановитьПараметр("Наименование",Строка);
	Рез = запрос.Выполнить().Выбрать();
	Если рез.Следующий() Тогда
		Возврат Рез.МаркаЧЗ;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции


Процедура ФормированиеХКМ(ДокПолучатель,ТЗТовары_Марки)

	//------------------------------------------------------------------------------------------
	//      создаем ХКМ
	//------------------------------------------------------------------------------------------
	// Проверим, есть ли уже ХКМ, если есть, то просто его перезаполним. Если нет, то создаем новый.
	Запрос = новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ХранилищеКодовМаркировки.Ссылка КАК Ссылка,
	              |	ХранилищеКодовМаркировки.ПометкаУдаления КАК ПометкаУдаления
	              |ИЗ
	              |	Документ.ХранилищеКодовМаркировки КАК ХранилищеКодовМаркировки
	              |ГДЕ
	              |	ХранилищеКодовМаркировки.ДокОснование = &ТекДок
	              |	И ХранилищеКодовМаркировки.ПометкаУдаления = ЛОЖЬ
	              |	И ХранилищеКодовМаркировки.ПланФакт = &план";
	
	запрос.УстановитьПараметр("ТекДок",ДокПолучатель);  
	запрос.УстановитьПараметр("План",перечисления.ПланФакт.План);
	
	Рез = запрос.Выполнить().Выгрузить();  
	Если рез.Количество()>0 Тогда
		ДокХКМ  = рез[0].ссылка;
		документХКМ = докХКМ.получитьОбъект(); 
		//!!!!!!!!!!!!!!!!!
		// если уже есть ХКМ к ПНК, то не перезаполняем ее пока.
		 возврат;
		
	иначе
		
		ДокументХКМ = Документы.ХранилищеКодовМаркировки.ПустаяСсылка(); 
		
		ДокументХКМ = документы.ХранилищеКодовМаркировки.СоздатьДокумент();
		ДокументХКМ.Автор = ПараметрыСеанса.Пользователь;
		ДокументХКМ.ДокОснование = ДокПолучатель.ссылка;
		ДокументХКМ.Организация = ДокПолучатель.организация; // единая европа?  пусть пока бтк
		ДокументХКМ.ПланФакт = перечисления.ПланФакт.План;
		ДокументХКМ.Получатель = ДокПолучатель.контрагент; //???  бтк
		ДокументХКМ.Комментарий = "Возврат от Гиперглобуса, загрузка из Сферы";
		ДокументХКМ.дата =  КонецДня(текущаядата()-24*60*60);//КонецДня(ДокПолучатель.дата);
		ДокументХКМ.УстановитьНовыйНомер( "PPP"+"-");
    
	конецЕсли;

	
	
	// заполняем марками
	//-------------------------------------------
	ДокументХКМ.ШтрихкодыУпаковок.очистить();
	ТЗТовары_Марки.Сортировать("Киз");
	
	Для каждого ТекстрМ из ТЗТовары_Марки цикл   
		//ТекМаркаТ = ТекстрМ.Марка;
		//сообщить(ТекстрМ.Марка);
		МаркаН = ДокументХКМ.ШтрихкодыУпаковок.добавить();
		//------------------------------------------------------------	
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Ссылка 			КАК КодМаркировки
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров	
		|ГДЕ
		|	Наименование = &ДанныеКМ
		|	И ( 
		|		ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Товар)
		|		ИЛИ ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор)
		|	)
		|";
		
		Запрос.УстановитьПараметр("ДанныеКМ", ТекстрМ.киз);
		
		ВыборкаМ = Запрос.Выполнить().Выгрузить();
		//-----------------------------------------------------------------------------------
		
		Если ВыборкаМ.Количество()>0 Тогда 
		МаркаН.ШтрихкодУпаковки = ВыборкаМ[0].КодМаркировки;
	иначе 
		//сообщить(" -  "+ТекстрМ.киз); 
		ЗаписатьВЛог("Маркировка","Не удалось найти и добавить марку, к "+ ДокПолучатель+ " - "+ТекстрМ.киз+" "+ТекущаяДата()+" "+ОписаниеОшибки(),,,,);

	КонецЕсли;
	
		
	КонецЦикла;
	
	попытка
		ДокументХКМ.Записать(РежимЗаписиДокумента.Запись);
	исключение
		ЗаписатьВЛог("Маркировка","Не удалось записать документ ХКМ, к ПНК Гиперглобус - "+ ДокПолучатель+"   "+ТекущаяДата()+" "+ОписаниеОшибки(),,,,);
		//сообщить(описаниеошибки());
	КонецПопытки;

	//	сообщить(ДокПолучатель);
	//	сообщить(ДокументХКМ);
	//-----------------------------------------------
	
	
	
КонецПроцедуры



// формируем структуру для загрузки до 01,04,25 ++
Процедура СформироватьСтруктуруУПД_ст(Путь,ИмяКр)
	
	// потом в регистр это записать.
	//------------------------------
	Файл = Новый ЧтениеXML;
	Попытка
		Файл.ОткрытьФайл(Путь);
		// очищаем все файлы.
		ТЗШапка.Очистить();
		СтрокаШапка=ТЗШапка.Добавить();
		//нечаева 12,09,18++
		//СтрокаШапка.Промо=0;
		//нечаева 12,09,18---
		Файлы.Очистить();
		Ошибки.Очистить();
		ТЗПечать.Очистить();
	Исключение
		//сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	//---------------------------------			
	НомСим = СтрНайти(ИмяКр,"_"); // 9 символов ид.
	ИдЭдО = Сред(ИмяКр,НомСим-9,9);
	СтрокаШапка.ИдЭДО = ИдЭДО;
	//-----------------------------------
	                                     	
	
	ШК="";
	Артикул="";
	НомерСФКонтрагента="";
	ТипСФКонтрагента="";
	Контрагент=неопределено;
	НомерСтроки=0;
	ПризнакЗаписиДокумента=Истина;
	НазваниеПунктаДоставки = "Нет названия";
	НаименованиеК = "Контрагент не определен";
	//Катаев+ 03/10/13 Принудительный сброс единицы упаковки.
	Единица = "";
	//Катаев- 03/13/13
	
	Количество=0;
	//------------------------------------------
	
	МеханизмЧтения = Новый ЧтениеXML;
	МеханизмЧтения.ОткрытьФайл(Путь);
	Построитель = Новый ПостроительDOM;
	ДокументУПД = Построитель.Прочитать(МеханизмЧтения);
	
	//цикл для обхода узлов
	Для каждого элемента Из ДокументУПД.ЭлементДокумента.ДочерниеУзлы Цикл
		//сообщить(элемента.имяУзла);
		//
		Если элемента.ИмяУзла = "Документ" Тогда
			ДокШапка = элемента;
			//атрибуты главного узла
			ТипУПД = ДокШапка.Атрибуты.ПолучитьИменованныйЭлемент("Функция").Значение;
			//сообщить(типУПД);
			Если ТИпУПД <> "ДОП" Тогда
				продолжить;
				// могут быть другие типы, их мы пока не грузим.
			КонецЕсли;
			
			// ИД в корусе получить еще
			// ------------------дальше вложенные узлы
			Для каждого значения Из ДокШапка.ДочерниеУзлы Цикл 
				//сообщить("  "+значения.ИмяУзла);
				
				// сама шапка                                             
				Если значения.ИмяУзла = "СвСчФакт" тогда 
					НомерСФ = Значения.Атрибуты.ПолучитьИменованныйЭлемент("НомерСчФ").Значение;
					ДатаСФ = Значения.Атрибуты.ПолучитьИменованныйЭлемент("ДатаСчФ").Значение;
					СвКонтрагента=Значения;
					
					СтрокаШапка.НомерСФ = НомерСФ;
					СтрокаШапка.ДатаСФ = ДатаСФ;
					
					Для каждого СвК Из СвКонтрагента.ДочерниеУзлы Цикл 
						//сообщить("   "+свк.ИмяУзла);
						//-------------------------------------------------------------------------------------------- 
						// СвПрод сведения о продавце - гиперглобус у входящего
						Если  СВК.ИмяУзла = "СвПрод" Тогда
							// только для продавца будем читать ИНН
							Для каждого ИДП1 Из СвК.ДочерниеУзлы Цикл
								//сообщить("    "+идп1.ИмяУзла);
								//ИДСв
								Для каждого ИДП2 Из ИДП1.ДочерниеУзлы Цикл
									//сообщить("     "+идп2.ИмяУзла);
									//
										
									//СвЮЛУч
									Если идп2.ИмяУзла = "СвЮЛУч" тогда
										//СвЮЛУч
										ИННЮЛ = идп2.Атрибуты.ПолучитьИменованныйЭлемент("ИННЮЛ").Значение;
										КПП = идп2.Атрибуты.ПолучитьИменованныйЭлемент("КПП").Значение;
									//	сообщить(ИННЮЛ);
										
										
										Контрагент=справочники.Контрагенты.ПустаяСсылка();
										Запрос=Новый Запрос;
										//Катаев+ 29/10/14 В запрос добавлена проверка на то что это не группа.
										Запрос.Текст=
										"ВЫБРАТЬ
										|	Контрагенты.Ссылка
										|ИЗ
										|	Справочник.Контрагенты КАК Контрагенты
										|ГДЕ
										|	Контрагенты.ИНН = &ТекКод
										|	И Контрагенты.ЭтоГруппа = ЛОЖЬ";
										//Катаев- 29/10/14
										
										Запрос.УстановитьПараметр("ТекКод",СокрЛП(ИННЮЛ));
										Выборка = запрос.Выполнить().Выбрать();
										Пока выборка.Следующий() Цикл
											Контрагент=выборка.ссылка;
											СтрокаШапка.Контрагент=Контрагент;
											прервать;
										КонецЦикла; 
										
																		
									конецЕсли;	
								конецЦикла;
							КонецЦикла; 
						конецЕсли;
						//
						// адрес грузополучателя
						//--------------------------------------------------------------------------------------------------------------
						
						Если  СВК.ИмяУзла = "ГрузОт" Тогда
							Индекс= "";
							Город = "";
							Улица = "";
							
							// только для продавца будем читать ИНН
							Для каждого ИДП1 Из СвК.ДочерниеУзлы Цикл
								//сообщить("   "+идп1.ИмяУзла);
								Для каждого ИДП2 Из ИДП1.ДочерниеУзлы Цикл
									//сообщить("     "+идп2.ИмяУзла);
									
									//СвЮЛУч
									Если идп2.ИмяУзла = "Адрес" тогда
										
										Для каждого ИДП3 Из ИДП2.ДочерниеУзлы Цикл
											//АдрРФ
											// адрес грузополучателя получить по регистру
											Индекс = идп3.Атрибуты.ПолучитьИменованныйЭлемент("Индекс").Значение;
											
											попытка
												ГОрод = идп3.Атрибуты.ПолучитьИменованныйЭлемент("Город").Значение;
											исключение
												ГОрод = "";
											конецПопытки;
											
										    // может быть не заполнено
											попытка
												Улица = идп3.Атрибуты.ПолучитьИменованныйЭлемент("Улица").Значение;
											исключение
												улица = "";
											конецпопытки;
										
											//сообщить(улица);
										конецЦикла;
									конецЕсли;	
								конецЦикла;
							КонецЦикла;
							// ищем пункт доставки через регистр
							Если Индекс<>""  и Улица<>"" Тогда
								
								ПунктДоставки = НайтиАдресПД(Индекс,ГОрод,Улица,Контрагент);
							//	сообщить(ПунктДоставки);
							//	тзШапка.ПунктДоставки = ПунктДоставки;						
							КонецЕсли;
							
						конецЕсли;
						
						//-------------------------------------------------------------------------------------------- 
						// СвПрод сведения о покупателе - гиперглобус у входящего
						Если  СВК.ИмяУзла = "СвПокуп" Тогда
							// только для продавца будем читать ИНН
							Для каждого ИДП1 Из СвК.ДочерниеУзлы Цикл
								//сообщить("    "+идп1.ИмяУзла);
								//ИДСв
								Для каждого ИДП2 Из ИДП1.ДочерниеУзлы Цикл
									//сообщить("     "+идп2.ИмяУзла);
									//
									//СвЮЛУч
									Если идп2.ИмяУзла = "СвЮЛУч" тогда
										//СвЮЛУч
										ИННОР = идп2.Атрибуты.ПолучитьИменованныйЭлемент("ИННЮЛ").Значение;
										КППОр = идп2.Атрибуты.ПолучитьИменованныйЭлемент("КПП").Значение;
										//сообщить(ИННор);
										
										
										Организация=справочники.Организации.ПустаяСсылка();
										Запрос=Новый Запрос;
										
										Запрос.Текст=
										"ВЫБРАТЬ
										|	Контрагенты.Ссылка КАК Ссылка
										|ИЗ
										|	Справочник.Организации КАК Контрагенты
										|ГДЕ
										|	Контрагенты.ИНН = &ТекКод
										|	И Контрагенты.ПометкаУдаления = ЛОЖЬ
										|	И Контрагенты.ОрганизацияНашейКомпании = &да";
											
										Запрос.УстановитьПараметр("ТекКод",СокрЛП(ИННОр));
										Запрос.УстановитьПараметр("да",истина);
										
										Выборка = запрос.Выполнить().Выбрать();
										Пока выборка.Следующий() Цикл
											Организация=выборка.ссылка;
											СтрокаШапка.Организация = Организация;
											прервать;
										КонецЦикла; 
										
																		
									конецЕсли;	
								конецЦикла;
							КонецЦикла; 
						конецЕсли;

					
												
						
					конецЦикла;
					
				КонецЕсли;//-------------------------------
				
				//******************************************************************************************
				
				// таблица СФ с товарами -----------------------------------------------------
				Если значения.ИмяУзла = "ТаблСчФакт" тогда 
					СвТоваров=Значения;						
					
					Для каждого СвТ Из СвТоваров.ДочерниеУзлы Цикл 
						
						// СведТов, строка по товару
						Если  СвТ.ИмяУзла = "СведТов" Тогда
							
							// пример от гиперглобуса, с типом ДОП
							
							//<СведТов НомСтр="1" НаимТов="Наш ном.арт.548730 НОСКИ МУЖСКИЕ OMSA БЕЛЫЙ 39-41 EAN: 8053736350255 Ваш ном.арт. OMSA ACTIVE 105" ОКЕИ_Тов="796" 
							//КолТов="23.000" ЦенаТов="73.46" СтТовБезНДС="1689.58" НалСт="20%" СтТовУчНал="2027.50">
							//  <Акциз>
							//    <БезАкциз>без акциза</БезАкциз>
							//  </Акциз>
							//  <СумНал>
							//    <СумНал>337.92</СумНал>
							//  </СумНал>
							//  <ДопСведТов НаимЕдИзм="шт" КодТов="548730" />
							//</СведТов>								
							НомСтр = СвТ.Атрибуты.ПолучитьИменованныйЭлемент("НомСтр").Значение;
							НаимТов = СвТ.Атрибуты.ПолучитьИменованныйЭлемент("НаимТов").Значение; 
							ОКЕИ_Тов = СвТ.Атрибуты.ПолучитьИменованныйЭлемент("ОКЕИ_Тов").Значение; 
							КолТов = СвТ.Атрибуты.ПолучитьИменованныйЭлемент("КолТов").Значение; //
							ЦенаТов = СвТ.Атрибуты.ПолучитьИменованныйЭлемент("ЦенаТов").Значение; 
							СтТовБезНДС = СвТ.Атрибуты.ПолучитьИменованныйЭлемент("СтТовБезНДС").Значение; // всего без ндс
							СтТовУчНал = СвТ.Атрибуты.ПолучитьИменованныйЭлемент("СтТовУчНал").Значение; // всего с ндс
														
							// доп сведения товаров
							Для каждого ДопСв Из СвТ.ДочерниеУзлы Цикл
								
								Если ДопСв.ИмяУзла = "ДопСведТов" тогда
									попытка
										КодТов = ДопСв.Атрибуты.ПолучитьИменованныйЭлемент("КодТов").Значение; // артикул товара
									исключение
										кодтов = ""; // услуги могут быть без кода
									конецПопытки;
									//сообщить(КодТов);
								конецЕсли;	
							конецЦикла;
														
							
							НовСтр = тзпечать.Добавить();
							НовСтр.номерстроки = Номстр;
							НовСтр.Название = НаимТОв;
							НовСтр.ОКЕИ_Тов = ОКЕИ_Тов;
							НовСтр.Колво = КолТов;
							НовСтр.ЦенаБезНДС = ЦенаТов;
							НовСтр.СуммаБезНДС = СтТовБезНДС;
							НовСтр.ВСего = СтТовУчНал;
							
							
							НовСтр.КодПокуп = КодТОв;
							Дата1 = Дата(ДатаСФ+" 00:00:00");
							Ном=НайтиПОШКМатрица("",КодТОв,НаимТов,Контрагент,"",Дата1);
							//сообщить(Ном);
  		                    новСтр.номенклатура=ном;
							
						конецЕсли;
						
					конецЦикла;
				
					
				КонецЕсли;
				//******************************************************************************************
	
				
			КонецЦикла; // вложенные узлы
			
		КонецЕсли;  // документ

		
	КонецЦикла;
	
	//закрытие  чтения			
	
	файл.Закрыть();	

	//******************************************************************************************************
		
		
	возврат;
	
	//
	//Если  КритичОшибки.Количество()>0   Тогда
	//	СообщитьКритОшибки();                        //++++
	//КонецЕсли;	
	//КритичОшибки.Очистить();
	
	
КонецПроцедуры //Загрузить


// формируем структуру для загрузки
//   с 1.04.25 новый формат упд
Процедура СформироватьСтруктуруУПД(Путь,ИмяКр)
	
	// потом в регистр это записать.
	//------------------------------
	Файл = Новый ЧтениеXML;
	Попытка
		Файл.ОткрытьФайл(Путь);
		// очищаем все файлы.
		ТЗШапка.Очистить();
		СтрокаШапка=ТЗШапка.Добавить();
		//нечаева 12,09,18++
		//СтрокаШапка.Промо=0;
		//нечаева 12,09,18---
		Файлы.Очистить();
		Ошибки.Очистить();
		ТЗПечать.Очистить();
	Исключение
		//сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	//-----------------------------------------------			
	// 16.04.26 +++	 поменялось заполнение по требованиям Гиперглобуса // 14649 ООО "Единая Европа - Элит" - Возвраты от Глобуса
	// HELP-6972
	ИдЭдО = СтрЗаменить(ИмяКр,".xml","");
	СтрокаШапка.ИдЭДО = ИдЭДО;  
    // 16.04.26 ---
	//-----------------------------------------------
	                                     	
	
	ШК="";
	Артикул="";
	НомерСФКонтрагента="";
	ТипСФКонтрагента="";
	Контрагент = неопределено;
	НомерСтроки = 0;
	ПризнакЗаписиДокумента=Истина;
	НазваниеПунктаДоставки = "Нет названия";
	НаименованиеК = "Контрагент не определен";
	//Катаев+ 03/10/13 Принудительный сброс единицы упаковки.
	Единица = "";
	//Катаев- 03/13/13
	
	Количество=0;
	//----------------------------------------------
	
	МеханизмЧтения = Новый ЧтениеXML;
	МеханизмЧтения.ОткрытьФайл(Путь);
	Построитель = Новый ПостроительDOM;
	ДокументУПД = Построитель.Прочитать(МеханизмЧтения);
	
	//цикл для обхода узлов
	Для каждого элемента Из ДокументУПД.ЭлементДокумента.ДочерниеУзлы Цикл
		//сообщить(элемента.имяУзла);
		//
		Если элемента.ИмяУзла = "Документ" Тогда
			ДокШапка = элемента;
			//атрибуты главного узла
			ТипУПД = ДокШапка.Атрибуты.ПолучитьИменованныйЭлемент("Функция").Значение;
			//сообщить(типУПД);
			Если ТИпУПД <> "ДОП" Тогда
				продолжить;
				// могут быть другие типы, их мы пока не грузим.
			КонецЕсли;
			
			// ИД в корусе получить еще
			// ------------------дальше вложенные узлы
			Для каждого значения Из ДокШапка.ДочерниеУзлы Цикл 
				//сообщить("  "+значения.ИмяУзла);
				
				// сама шапка                                             
				Если значения.ИмяУзла = "СвСчФакт" тогда
					
					// нечаева 27,05,25 ++ новый формат с 01.04.25
					попытка
						НомерСФ = Значения.Атрибуты.ПолучитьИменованныйЭлемент("НомерДок").Значение;
						ДатаСФ = Значения.Атрибуты.ПолучитьИменованныйЭлемент("ДатаДок").Значение; 
					исключение
						НомерСФ = Значения.Атрибуты.ПолучитьИменованныйЭлемент("НомерСчФ").Значение;
						ДатаСФ = Значения.Атрибуты.ПолучитьИменованныйЭлемент("ДатаСчФ").Значение;
					конецПопытки; 
					// нечаева 27,05,25 ---
					
					
					СвКонтрагента=Значения;
					
					СтрокаШапка.НомерСФ = НомерСФ;
					СтрокаШапка.ДатаСФ = ДатаСФ;
					
					Для каждого СвК Из СвКонтрагента.ДочерниеУзлы Цикл 
						//сообщить("   "+свк.ИмяУзла);
						//-------------------------------------------------------------------------------------------- 
						// СвПрод сведения о продавце - гиперглобус у входящего
						Если  СВК.ИмяУзла = "СвПрод" Тогда
							// только для продавца будем читать ИНН
							Для каждого ИДП1 Из СвК.ДочерниеУзлы Цикл
								//сообщить("    "+идп1.ИмяУзла);
								//ИДСв
								Для каждого ИДП2 Из ИДП1.ДочерниеУзлы Цикл
									//сообщить("     "+идп2.ИмяУзла);
									//
										
									//СвЮЛУч
									Если идп2.ИмяУзла = "СвЮЛУч" тогда
										//СвЮЛУч
										ИННЮЛ = идп2.Атрибуты.ПолучитьИменованныйЭлемент("ИННЮЛ").Значение;
										КПП = идп2.Атрибуты.ПолучитьИменованныйЭлемент("КПП").Значение;
									//	сообщить(ИННЮЛ);
										
										
										Контрагент=справочники.Контрагенты.ПустаяСсылка();
										Запрос=Новый Запрос;
										//Катаев+ 29/10/14 В запрос добавлена проверка на то что это не группа.
										Запрос.Текст=
										"ВЫБРАТЬ
										|	Контрагенты.Ссылка
										|ИЗ
										|	Справочник.Контрагенты КАК Контрагенты
										|ГДЕ
										|	Контрагенты.ИНН = &ТекКод
										|	И Контрагенты.ЭтоГруппа = ЛОЖЬ";
										//Катаев- 29/10/14
										
										Запрос.УстановитьПараметр("ТекКод",СокрЛП(ИННЮЛ));
										Выборка = запрос.Выполнить().Выбрать();
										Пока выборка.Следующий() Цикл
											Контрагент=выборка.ссылка;
											СтрокаШапка.Контрагент=Контрагент;
											прервать;
										КонецЦикла; 
										
																		
									конецЕсли;	
								конецЦикла;
							КонецЦикла; 
						конецЕсли;
						//
						// адрес грузополучателя
						//--------------------------------------------------------------------------------------------------------------
						
						Если  СВК.ИмяУзла = "ГрузОт" Тогда
							Индекс= "";
							Город = "";
							Улица = "";
							
							// только для продавца будем читать ИНН
							Для каждого ИДП1 Из СвК.ДочерниеУзлы Цикл
								//сообщить("   "+идп1.ИмяУзла);
								Для каждого ИДП2 Из ИДП1.ДочерниеУзлы Цикл
									//сообщить("     "+идп2.ИмяУзла);
									
									//СвЮЛУч
									Если идп2.ИмяУзла = "Адрес" тогда
										
										Для каждого ИДП3 Из ИДП2.ДочерниеУзлы Цикл
											//АдрРФ
											// адрес грузополучателя получить по регистру
											Индекс = идп3.Атрибуты.ПолучитьИменованныйЭлемент("Индекс").Значение;
											
											попытка
												ГОрод = идп3.Атрибуты.ПолучитьИменованныйЭлемент("Город").Значение;
											исключение
												ГОрод = "";
											конецПопытки;
											
										    // может быть не заполнено
											попытка
												Улица = идп3.Атрибуты.ПолучитьИменованныйЭлемент("Улица").Значение;
											исключение
												улица = "";
											конецпопытки;
										
											//сообщить(улица);
										конецЦикла;
									конецЕсли;	
								конецЦикла;
							КонецЦикла;
							// ищем пункт доставки через регистр
							Если Индекс<>""  и Улица<>"" Тогда
								
								ПунктДоставки = НайтиАдресПД(Индекс,ГОрод,Улица,Контрагент);
							//	сообщить(ПунктДоставки);
							//	тзШапка.ПунктДоставки = ПунктДоставки;						
							КонецЕсли;
							
						конецЕсли;
						
						//-------------------------------------------------------------------------------------------- 
						// СвПрод сведения о покупателе - гиперглобус у входящего
						Если  СВК.ИмяУзла = "СвПокуп" Тогда
							// только для продавца будем читать ИНН
							Для каждого ИДП1 Из СвК.ДочерниеУзлы Цикл
								//сообщить("    "+идп1.ИмяУзла);
								//ИДСв
								Для каждого ИДП2 Из ИДП1.ДочерниеУзлы Цикл
									//сообщить("     "+идп2.ИмяУзла);
									//
									//СвЮЛУч
									Если идп2.ИмяУзла = "СвЮЛУч" тогда
										//СвЮЛУч
										ИННОР = идп2.Атрибуты.ПолучитьИменованныйЭлемент("ИННЮЛ").Значение;
										КППОр = идп2.Атрибуты.ПолучитьИменованныйЭлемент("КПП").Значение;
										//сообщить(ИННор);
										
										
										Организация=справочники.Организации.ПустаяСсылка();
										Запрос=Новый Запрос;
										
										Запрос.Текст=
										"ВЫБРАТЬ
										|	Контрагенты.Ссылка КАК Ссылка
										|ИЗ
										|	Справочник.Организации КАК Контрагенты
										|ГДЕ
										|	Контрагенты.ИНН = &ТекКод
										|	И Контрагенты.ПометкаУдаления = ЛОЖЬ
										|	И Контрагенты.ОрганизацияНашейКомпании = &да";
											
										Запрос.УстановитьПараметр("ТекКод",СокрЛП(ИННОр));
										Запрос.УстановитьПараметр("да",истина);
										
										Выборка = запрос.Выполнить().Выбрать();
										Пока выборка.Следующий() Цикл
											Организация=выборка.ссылка;
											СтрокаШапка.Организация = Организация;
											прервать;
										КонецЦикла; 
										
																		
									конецЕсли;	
								конецЦикла;
							КонецЦикла; 
						конецЕсли;

					
												
						
					конецЦикла;
					
				КонецЕсли;//-------------------------------
				
				//******************************************************************************************
				
				// таблица СФ с товарами -----------------------------------------------------
				Если значения.ИмяУзла = "ТаблСчФакт" тогда 
					СвТоваров=Значения;						
					
					Для каждого СвТ Из СвТоваров.ДочерниеУзлы Цикл 
						
						// СведТов, строка по товару
						Если  СвТ.ИмяУзла = "СведТов" Тогда
							
							// пример от гиперглобуса, с типом ДОП
							
							//<СведТов НомСтр="1" НаимТов="Наш ном.арт.548730 НОСКИ МУЖСКИЕ OMSA БЕЛЫЙ 39-41 EAN: 8053736350255 Ваш ном.арт. OMSA ACTIVE 105" ОКЕИ_Тов="796" 
							//КолТов="23.000" ЦенаТов="73.46" СтТовБезНДС="1689.58" НалСт="20%" СтТовУчНал="2027.50">
							//  <Акциз>
							//    <БезАкциз>без акциза</БезАкциз>
							//  </Акциз>
							//  <СумНал>
							//    <СумНал>337.92</СумНал>
							//  </СумНал>
							//  <ДопСведТов НаимЕдИзм="шт" КодТов="548730" />
							//</СведТов>								
							НомСтр = СвТ.Атрибуты.ПолучитьИменованныйЭлемент("НомСтр").Значение;
							НаимТов = СвТ.Атрибуты.ПолучитьИменованныйЭлемент("НаимТов").Значение; 
							ОКЕИ_Тов = СвТ.Атрибуты.ПолучитьИменованныйЭлемент("ОКЕИ_Тов").Значение; 
							КолТов = СвТ.Атрибуты.ПолучитьИменованныйЭлемент("КолТов").Значение; //
							ЦенаТов = СвТ.Атрибуты.ПолучитьИменованныйЭлемент("ЦенаТов").Значение; 
							СтТовБезНДС = СвТ.Атрибуты.ПолучитьИменованныйЭлемент("СтТовБезНДС").Значение; // всего без ндс
							СтТовУчНал = СвТ.Атрибуты.ПолучитьИменованныйЭлемент("СтТовУчНал").Значение; // всего с ндс
														
							// доп сведения товаров
							Для каждого ДопСв Из СвТ.ДочерниеУзлы Цикл
								
								Если ДопСв.ИмяУзла = "ДопСведТов" тогда
									попытка
										КодТов = ДопСв.Атрибуты.ПолучитьИменованныйЭлемент("КодТов").Значение; // артикул товара
									исключение
										кодтов = ""; // услуги могут быть без кода
									конецПопытки;
									//сообщить(КодТов);
								конецЕсли;	
							конецЦикла;
														
							
							НовСтр = тзпечать.Добавить();
							НовСтр.номерстроки = Номстр;
							НовСтр.Название = НаимТОв;
							НовСтр.ОКЕИ_Тов = ОКЕИ_Тов;
							НовСтр.Колво = КолТов;
							НовСтр.ЦенаБезНДС = ЦенаТов;
							НовСтр.СуммаБезНДС = СтТовБезНДС;
							НовСтр.ВСего = СтТовУчНал;
							
							
							НовСтр.КодПокуп = КодТОв;
							Дата1 = Дата(ДатаСФ+" 00:00:00");
							Ном=НайтиПОШКМатрица("",КодТОв,НаимТов,Контрагент,"",Дата1);
							//сообщить(Ном);
  		                    новСтр.номенклатура=ном;
							
						конецЕсли;
						
					конецЦикла;
				
					
				КонецЕсли;
				//******************************************************************************************
	
				
			КонецЦикла; // вложенные узлы
			
		КонецЕсли;  // документ

		
	КонецЦикла;
	
	//закрытие  чтения			
	
	файл.Закрыть();	

	//******************************************************************************************************
		
		
	//возврат;
	
	//
	//Если  КритичОшибки.Количество()>0   Тогда
	//	СообщитьКритОшибки();                        //++++
	//КонецЕсли;	
	//КритичОшибки.Очистить();
	
	
КонецПроцедуры //Загрузить



функция НайтиПНКСклада(ТЗШАпка)
	
	
	ДатаСФ = Дата(ТЗШАпка.ДатаСФ+" 00:00:00");
	// найдем документ, который завел склад.  НомерТОРГ12Входящий - это номер документа покупателя.
	ДокументДляЗагрузки =неопределено;
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриходнаяНакладная.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	               |ГДЕ
	               |	ПриходнаяНакладная.Контрагент = &текконтр
	               |	И ПриходнаяНакладная.Организация = &текОрг
	               |	И ПриходнаяНакладная.ПометкаУдаления = ЛОЖЬ
	               |	И ПриходнаяНакладная.НомерТОРГ12Входящий ПОДОБНО &НомерУПД
	               |	И ПриходнаяНакладная.ДатаВходящихДокументов = &датаУПД";
 	Запрос.УстановитьПараметр("ТекКонтр",ТзШапка.Контрагент);
	запрос.УстановитьПараметр("ТекОрг",ТЗшапка.организация);
	запрос.УстановитьПараметр("НомерУПД",ТЗшапка.НомерСФ);
	запрос.УстановитьПараметр("ДатаУПД",ДатаСФ);
	
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() тогда
		ДокументДляЗагрузки = рез.ссылка;
	КонецЕсли;
	// если не найдено отправлять письмо?  не загружать? оставлять в той же папке, пока не найдется?

	возврат ДокументДляЗагрузки;
	
КонецФункции



Функция СформироватьПНК(ТЗШапка,ТЗПечать,путьф)
	
	ДокументДляЗагрузки = документы.ПриходнаяНакладная.ПустаяСсылка();
	
	// найдем документ, который завел склад.  НомерТОРГ12Входящий - это номер документа покупателя.
	ДокументДляЗагрузки = НайтиПНКСклада(ТЗШАпка[0]);
	
	// если не найдено отправлять письмо?  не загружать? оставлять в той же папке, пока не найдется?
	Если ДокументДляЗагрузки = неопределено тогда
		//записатьвлог("Екод","Документ пнк не найден "+ТЗшапка[0].НомерСФ,,,);
		//сообщить("ПНК не найдено"+ТЗшапка[0].НомерСФ);
		возврат ложь;
	иначе
		
	КонецЕсли;	
	ДокументДляЗагрузки= ДокументДляЗагрузки.получитьОБъект();
	// запишем ИДЭДО для него;
	Если ТЗШапка[0].ИдЭдо<>"" Тогда
				
		НаборЗаписей = РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Документ.Установить(ДокументДляЗагрузки.ссылка); 
		НаборЗаписей.Отбор.ИмяРеквизита.Установить("ИдЭдо"); 
			
			НоваяЗапись = НаборЗаписей.Добавить(); 
			
			НоваяЗапись.Документ = ДокументДляЗагрузки.ссылка; 
			НоваяЗапись.ИмяРеквизита = "ИдЭдо"; 
			НоваяЗапись.ЗначениеРеквизита =ТЗШапка[0].ИдЭдо; 
			
		НаборЗаписей.Записать(); 
		

	КонецЕсли;
	
	//------------------------------
	ТзДК = ДокументДляЗагрузки.Заказ;
	
	// если уже заполнено не перезаполняем. ручной ввод? временно закоментирую.
	Если тзДК.количество()>0 ТОгда
		//сообщить("ПНК заполнено уже");
		возврат истина;
	КонецЕсли;
	
	ТЗДК.очистить();
	
	// там шапка уже заполнена, надо только догрузить документ клиента.
	Для каждого ТекСтрока из тзПечать цикл
		
		НСтр = тздк.добавить();
		НСтр.номенклатура = текстрока.номенклатура;
		Нстр.ставкаНДС = текстрока.номенклатура.родитель.ставкаНДС; 
		Нстр.количество =  текстрока.колво;
		Нстр.ЦенаБезНДС = текстрока.ЦенаБезНДС;
		Нстр.всегоБезНДС =  текстрока.СуммаБезНДС;
		Нстр.всего =  текстрока.всего;
		
		//Нечаева 10,03,26 +++ HELP-6972
		Нстр.НомерВУПДКлиента = текстрока.номерстроки;
        // Нечаева 10,03,26 --- HELP-6972
		
		// пересчет данных
		РассчитатьСуммуТабЧасти(НСтр, ДокументДляЗагрузки,"ОтВсего");
		
		СтрокаТЧ = НСтр;
		СтавкаНДС=ПроцентНДСпоСтавке(СтрокаТЧ.СтавкаНДС);
		СтрокаТЧ.ЦенаБезНДС = СтрокаТЧ.Цена/(1+СтавкаНДС);
		СтрокаТЧ.ВсегоБезНДС = СтрокаТЧ.ЦенаБезНДС*СтрокаТЧ.Количество;
		СтрокаТЧ.НДС = СтрокаТЧ.Всего - СтрокаТЧ.ВсегоБезНДС;
		
		
	КонецЦикла;	
	
	попытка
		ДокументДляЗагрузки.записать();
	исключение
		
		записатьвлог("Курьер","Ошибка записи ПНК , "+ДокументДляЗагрузки,,,);
		возврат ложь;
		
	конецПопытки;
	

	Записатьвлог("Курьер","Документ пнк загружен, "+ТЗшапка[0].НомерСФ,,,);
	//ДокументДляЗагрузки.ПолучитьФорму("ФормаДокумента",,).Открыть();
	//СообщитьМенеджеру(ПутьФ, ТЗшапка);

	Возврат истина;
	
КонецФункции 



// доработка по контрагентам
// 1 округляем количество товаров, если нужно!
// 2 разброс по скаладам, формирование документов.
// 3 условия поиска ШК (для отдельных групп из номенклатуры - Интри, европакеты... кб-стиль)
Процедура ОбработкаДанныхЗагрузкиУПД(Шапка,Строки)
	
	СтрШапка=Шапка.Получить(0);
	ТипЦен=Справочники.ТипыЦен.ПустаяСсылка();
	ТипСкидки=Справочники.ТипыСкидок.ПустаяСсылка();
	Организация=Неопределено;
	Менеджер=Неопределено;
	Регион=Неопределено;
	Договор=Неопределено;
	Подразделение=Неопределено;
	ОтсрочкаПлатежа=Неопределено;
	КодПоставщикаКонтрагента=Неопределено;
	ПунктДоставки=Неопределено;
	НомерЗаказа=Неопределено;
	ТипILNКонтрагента=Неопределено;
	ДатаЗаказа=Неопределено;
	ДатаОтгрузки=Неопределено;
	Склад=Неопределено;   //Справочники.Склады.НайтиПоКоду("STA-61");
	Контрагент=СтрШапка.Контрагент;
	Если Контрагент=Неопределено тогда
		Контрагент=Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;	
	ПунктДоставки=СтрШапка.ПунктДоставки;
	НомЗаказа=СтрШапка.НомЗаказа;
	НомерЗаказа=СтрШапка.НомЗаказа;
	//нечаева 08,04,21+++
	КодПоставщикаШапка = СтрШапка.КодДоговора;
	//нечаева 08,04,21---
	
	
	ДатаЗаказа=СтрШапка.ДатаЗаказа;
	ДатаДоставки=СтрШапка.ДатаДоставки;
	//нечаева 27,11,17++
	ВремяДоставки = СтрШапка.ВремяДоставки;
	//нечаева 27,11,17-- 
	ТипILNКонтрагента=СтрШапка.ТипILNКонтрагента;
	
	
	//нечаева 31,08,21+++ для озона
	Если  контрагент.код = "SSP-4991" ТОгда
		
		Склад= Справочники.Склады.НайтиПоКоду("STC-60");
		
	КонецЕсли;
	//нечаева 31,08,21---
	
	//нечаева 21,04,23+++
	Если  НЕ Контрагент.ОсновнойСкладОтгрузки.пустая() ТОгда
		
		Склад= Контрагент.ОсновнойСкладОтгрузки;
		
	КонецЕсли;
	// нечаева 21,04,23---
	
	
	ПризКр=0;
	//сообщить("    запись документа");
	Если не Контрагент.Пустая() Тогда 	
		// 1. Обрабатываем количество, делаем округление  соответствуещее коли-ву в блочке
		Если Контрагент.ОткруглятьКоличество Тогда
			
			Для каждого ТекСтрока Из Строки Цикл
				ПризКратности=1;
				Ном=ТекСтрока.Номенклатура;
				КолЗаказано=ТекСтрока.Колво;
				
				Если НЕ ТипЗнч(Ном) = Тип("СправочникСсылка.Номенклатура") Тогда
					ТекСтрока.КолвоОтредактированное=КолЗаказано;
					продолжить;
				КонецЕсли;
				
				ШтукВКор=Ном.Родитель.ШтукВКоробочке;
				Если ШтукВКор-0>0 Тогда 
					// проверяем на кратность 5 или 6
					Если (ШтукВКор/5)=Цел((ШтукВКор/5)) Тогда
						ПризКратности=5
					ИначеЕсли (ШтукВКор/6)=Цел((ШтукВКор/6)) Тогда
						ПризКратности=6
					Иначе
						ПризКратности=1;
					КонецЕсли;
					
					Если (КолЗаказано/ПризКратности)<>Цел((КолЗаказано/ПризКратности)) Тогда
						КолУпак=Цел(Окр(КолЗаказано/ПризКратности,0,0));
						НовКолво=КолУпак*ПризКратности;
						ТекСтрока.КолвоОтредактированное=НовКолво;
					Иначе
						ТекСтрока.КолвоОтредактированное=КолЗаказано;
					Конецесли;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для каждого ТекСтрока Из Строки Цикл
				Если ТекСтрока.Единица<>"Блочок" Тогда
					КолЗаказано=ТекСтрока.Колво;
					ТекСтрока.КолвоОтредактированное=КолЗаказано;
				Иначе
					Попытка
						КолЗаказано=ТекСтрока.Колво*ТекСтрока.ВУпак;
						ТекСтрока.КолвоОтредактированное=КолЗаказано;
					исключение
						КолЗаказано=ТекСтрока.Колво;
						ТекСтрока.КолвоОтредактированное=КолЗаказано;
					КонецПопытки;	
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		// 2. проверяем дублированный заказ есть или нет. в пределах недели;
		Если Контрагент.ПроверятьНаличиеЗаказа Тогда
			
			Дата1=ТекущаяДата();
			Дата2=ТекущаяДата() - 60 * 60 * 24 * 7; // неделя назад;
			
			Запрос=новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	РасходнаяНакладная.Номер,
			|	РасходнаяНакладная.Дата,
			|	РасходнаяНакладная.Ссылка
			|ИЗ
			|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
			|ГДЕ
			|	РасходнаяНакладная.Контрагент = &Контрагент
			|	И РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
			|	И РасходнаяНакладная.Дата МЕЖДУ НачалоПериода(&Дата2) И КонецПериода(&Дата1)";
			
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("ПунктДоставки",ПунктДоставки);
			Запрос.УстановитьПараметр("Дата1",Дата1);
			Запрос.УстановитьПараметр("Дата2",Дата2);
			
			Рез=Запрос.Выполнить().Выбрать();
			
			// добавляем в сообщения менеджерам
			Пока Рез.Следующий() Цикл
				Строка="Для заказа ЕКОДЕ № "+НомЗаказа+" существует копия заказа РНК №"+Рез.Номер+" от "+Рез.Дата;
				Ошибки.Добавить(Строка);
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	// 3. разбивка по складам, создаем несколько документов. 
	// выбираем различные склады, и в цикла по кадому выбираем номеклатуру и создаем документы;
	
	// загрузка ТЗ в запрос
	//--------------------------------------------
	ТЗСклады=Строки;
	
	// создается для временной таблицы
	ТЗ  = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТЗ.Колонки.Добавить("Найдена", Новый ОписаниеТипов("Число"));
	
	Запрос = Новый Запрос;
	ДанныеСкладов=Неопределено;
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст  = "ВЫБРАТЬ различные
	|    ТЗ.Склад как Склад,
	|    ТЗ.Найдена
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|    &ТЗ КАК ТЗ";
	
	Запрос.УстановитьПараметр("ТЗ", ТзСклады);
	Запрос.Выполнить();
	
	Запрос.Текст="ВЫБРАТЬ
	|	ТЗ.Склад КАК Склад,
	|	ТЗ.Найдена
	|ИЗ
	|	ТЗ КАК ТЗ
	|ГДЕ
	|	ТЗ.Найдена = 1";
	РезультатСклады=Запрос.Выполнить().Выбрать();
	
	Если РезультатСклады.Количество()=0 Тогда
		// пустой документ! не формируем ?
		//Катаев+ 08/04/13 Для филиалов склад берем по умолчанию
		//Склад=Справочники.Склады.НайтиПоКоду("STA-61");
		Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
			Склад=Справочники.Склады.НайтиПоКоду("STA-61");
		Иначе
			Склад = ПолучитьЗначениеПоУмолчанию("ОсновнойСклад",Справочники.Пользователи.НастройкиПоУмолчанию);
		КонецЕсли;
		//Катаев- 08/04/13
		//нечаева 31,08,21+++ для озона
		Если  контрагент.код = "SSP-4991" ТОгда
			
			Склад= Справочники.Склады.НайтиПоКоду("STC-60");
			
		КонецЕсли;
		
		//нечаева 21,04,23+++
		Если  НЕ контрагент.ОсновнойСкладОтгрузки.пустая() ТОгда
			
			Склад= контрагент.ОсновнойСкладОтгрузки;
			
		КонецЕсли;
		// нечаева 21,04,23---
		
		
		
		//нечаева 31,08,21---
		
		// Катаев+ 21/03/13 Создавать новый документ надо только для оригинала
		//ДокОбъект=Документы.РасходнаяНакладная.СоздатьДокумент();
		//ДокОбъект = ПолучитьНакладную(Склад, Шапка.НомЗаказа, Шапка.ДатаЗаказа, Шапка.ТипЗаказа);
		ДокОбъект = ПолучитьНакладную(Склад, Шапка[0].НомЗаказа, Шапка[0].ДатаЗаказа, Шапка[0].ТипЗаказа);
		Если ДокОбъект = Неопределено Тогда
			Возврат;
		КонецЕсли;
		// Катаев- 21/03/13
		//-----------------------------------------------------------------------------------------
		//    автозаполнение параметров шапки документа, разница в шапке - в складе отгрузки
		//-----------------------------------------------------------------------------------------
		Если не Контрагент.Пустая() Тогда 	
			//------------------------------------------
			//Организация=Справочники.Организации.НайтиПоКоду("SSP-12"); //КБ- Стиль
			//нечаева18,07,17++
			Организация=Справочники.Организации.НайтиПоКоду("SS-001"); 
			//нечаева18,07,17--
			
			ТипЦен=Контрагент.ТипЦен;
			Договор=Контрагент.ОсновнойДоговор;
			
			//нечаева 24,10,17++ для дикси мегамарт два договора прописали по коду
			Если контрагент.код = "SSP-3687" ТОгда
				Договор = справочники.Договоры.НайтиПоКоду("SNL-022280");
			КонецЕсли;
			//нечаева 24,10,17*--
			
			
			Если не (Договор=Неопределено) и не (Договор=справочники.Договоры.ПустаяСсылка()) Тогда
				//ТипЦен		=Договор.ТипЦен;
				ОтсрочкаПлатежа =Договор.ОтсрочкаПлатежа;
				Если ЗначениеЗаполнено(Договор.Организация) Тогда
					Организация=Договор.Организация;		
				КонецЕсли;
			КонецЕсли;
			//Катаев+ 30/05/13 Для Перекрестка отгрузка может быть и через ГалантТрейд
			Если Контрагент.Код = "SSP-3674" Тогда
				Если СтрШапка.Организация = "4607814849991" Тогда
					Организация = Справочники.Организации.НайтиПоКоду("SNL-48");
					Договор = Справочники.Договоры.НайтиПоКоду("SMN-1143");
				КонецЕсли;
			КонецЕсли;
			//Катаев- 30/05/13
			//----  доп. обработка;
			ДокОбъект.ДопОбработки.Очистить();
			Для Каждого СтрокаТЧ Из Контрагент.ВидыДопОбработок Цикл
				СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
			КонецЦикла; 
			//нечаева 23,03,17+++
			// добавляем из пункта доставки доп. обработки.
			Попытка
				Для Каждого СтрокаТЧ Из ПунктДоставки.ВидыДопОбработок Цикл
					СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
				КонецЦикла;  
			Исключение
			КонецПопытки;
			//нечаева 23,03,17---
			//Нечаева 12,09,18+++
			// для х5 промо доп обработка
			Если  СтрШапка.Промо = 1  Тогда
				СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки = справочники.ВидыДопОбработки.НайтиПоКоду("OD7-00129");
			КонецЕсли;
			//Нечаева 12,09,18---
			
			
			
			
			//нечаева18,07,17++
			Если контрагент.код = "SSP-3687" ТОгда
				Договор = справочники.Договоры.НайтиПоКоду("SNL-022280");
			КонецЕсли;
			//нечаева18,07,17*--
			
			//-----------------------------------------------
			Менеджер=Контрагент.Менеджер;
			Если Менеджер=Неопределено или Менеджер=Справочники.ФизическиеЛица.ПустаяСсылка() и ПризКр=0 Тогда
				КритичОшибки.Добавить("Для контрагента "+контрагент.наименование+"  код - "+контрагент.код+"  не определен менеджер! Заказ екоде №"+ Номерзаказа );
			Иначе
				Если Не СтрДлина(Менеджер.Емэйл)>2  и ПризКр=0   Тогда
					КритичОшибки.Добавить("Для менеджера "+Менеджер.наименование+"  код - "+Менеджер.код+"  не определен ЕМэйл!" );
				КонецЕсли;
			КонецЕсли;
			
			Подразделение = Контрагент.Менеджер.Подразделение;
			//нечаева заглушка для метрополиса 060422
			Если Контрагент.код = "CHF-0200" Тогда
				ДокОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("SSP-0118"); // филиал екатеренбург
				Подразделение = справочники.Подразделения.НайтиПоКоду("SSP-0118"); // филиал екатеренбург
			КонецЕсли;	
			//------------------------
			// код поставщика
			//------------------------
			КодПоставщикаКонтрагента=Контрагент.КодПоставщика;
			Если КодПоставщикаконтрагента.пустая() ИЛИ кодПоставщикаКонтрагента=Неопределено Тогда
				// Берем первую из справочника коды контрагентов
				Запрос=Новый Запрос;
				Запрос.Текст="ВЫБРАТЬ
				|	КодыПоставщиков.Ссылка
				|ИЗ
				|	Справочник.КодыПоставщиков КАК КодыПоставщиков
				|ГДЕ
				|	КодыПоставщиков.Владелец = &Контрагент
				|	И (КодыПоставщиков.Организация = &ТекОрганизация
				|			ИЛИ КодыПоставщиков.Организация = &Контр2)";
				Запрос.УстановитьПараметр("Контрагент",Контрагент);		
				Запрос.УстановитьПараметр("Контр2",Справочники.Контрагенты.ПустаяСсылка());		
				Запрос.УстановитьПараметр("ТекОрганизация",Организация);		
				Результат=Запрос.Выполнить().Выбрать();
				// катаев+ 28/02/13 Исправление ошибки
				//Пока Результат.Следующий() Цикл
				//	КодПоставщикаКонтрагента=Результат.ссылка;
				//	возврат;
				//КонецЦикла;
				Если Результат.Следующий() Тогда
					КодПоставщикаКонтрагента=Результат.ссылка;
				КонецЕсли;
			КонецЕсли;
			
			//для атака проставим
			//нечаева 08,04,21+++
			Если КодПоставщикаШапка <>"" Тогда
				
				КодПоставщикаКонтрагента=СокрЛП(КодПоставщикаШапка);
				// ищем в справочнике его.
				Запрос=Новый Запрос;
				Запрос.Текст="ВЫБРАТЬ
				|	КодыПоставщиков.Ссылка
				|ИЗ
				|	Справочник.КодыПоставщиков КАК КодыПоставщиков
				|ГДЕ
				|	КодыПоставщиков.Владелец = &Контрагент
				|	И (КодыПоставщиков.Организация = &ТекОрганизация
				|			ИЛИ КодыПоставщиков.Организация = &Контр2)
				|	И КодыПоставщиков.Наименование = &ТекНаим";
				Запрос.УстановитьПараметр("Контрагент",Контрагент);		
				Запрос.УстановитьПараметр("Контр2",Справочники.Контрагенты.ПустаяСсылка());		
				Запрос.УстановитьПараметр("ТекОрганизация",Организация);
				Запрос.УстановитьПараметр("ТекНаим",КодПоставщикаКонтрагента);
				Результат=Запрос.Выполнить().Выбрать();
				Если Результат.Следующий() Тогда
					КодПоставщикаКонтрагента=Результат.ссылка;
				КонецЕсли;
				// для атак нечаева 03,06,22
				Если Контрагент.код = "SSR-6556"  ТОгда
					
					КодПоставщикаКонтрагента = СокрЛП(КодПоставщикаШапка);
					КодПоставщикаКонтрагента = СтрЗаменить(КодПоставщикаКонтрагента,"0000","");
					
					// ищем в справочнике его.
					Запрос=Новый Запрос;
					Запрос.Текст="ВЫБРАТЬ
					|	КодыПоставщиков.Ссылка
					|ИЗ
					|	Справочник.КодыПоставщиков КАК КодыПоставщиков
					|ГДЕ
					|	КодыПоставщиков.Владелец = &Контрагент
					|	И (КодыПоставщиков.Организация = &ТекОрганизация
					|			ИЛИ КодыПоставщиков.Организация = &Контр2)
					|	И КодыПоставщиков.Наименование = &ТекНаим";
					Запрос.УстановитьПараметр("Контрагент",Контрагент);		
					Запрос.УстановитьПараметр("Контр2",Справочники.Контрагенты.ПустаяСсылка());		
					Запрос.УстановитьПараметр("ТекОрганизация",Организация);
					Запрос.УстановитьПараметр("ТекНаим",КодПоставщикаКонтрагента);
					Результат=Запрос.Выполнить().Выбрать();
					Если Результат.Следующий() Тогда
						КодПоставщикаКонтрагента=Результат.ссылка;
					КонецЕсли;
				КонецЕсли;	
				
			КонецЕсли;	
			//нечаева 08,04,21---
			
			
			
		КонецЕсли;
		
		//----------------------------------------------
		//доставка
		Если не ПунктДоставки=Неопределено  Тогда 
			Если ЗначениеЗаполнено(ПунктДоставки.РайонДоставки) Тогда
				РайонДоставки=ПунктДоставки.РайонДоставки;	
				ДокОбъект.РайонДоставки=РайонДоставки;
			КонецЕсли;	
			Если ЗначениеЗаполнено(ПунктДоставки.Регион) Тогда
				Регион=ПунктДоставки.Регион;
				ДокОбъект.Регион=Регион;
			КонецЕсли;	
			//Катаев+ 10/04/14 Транспортная компания заполняется только если выбран тип доставки = "ТранспортнаяКомпания"
			//Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
			//	ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
			//	ДокОбъект.ТранспортнаяКомпания=ТранспортнаяКомпания;
			//КонецЕсли;	
			//Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
			//	ПунктПерегруза=ПунктДоставки.ПунктПерегруза;	
			//	ДокОбъект.ПунктПерегруза=ПунктПерегруза;
			//КонецЕсли;		
			Если ПунктДоставки.ТипДоставки = Перечисления.ТипыДоставки.ТранспортнаяКомпания Тогда
				Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
					ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
					ДокОбъект.ТранспортнаяКомпания=ТранспортнаяКомпания;
				КонецЕсли;
				Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
					ПунктПерегруза=ПунктДоставки.ПунктПерегруза;	
					ДокОбъект.ПунктПерегруза=ПунктПерегруза;
				КонецЕсли;		
			КонецЕсли;
			//Катаев- 10/04/14
			Если ЗначениеЗаполнено(ПунктДоставки.Грузополучатель) Тогда
				Грузополучатель=ПунктДоставки.Грузополучатель;		
				ДокОбъект.Грузополучатель=Грузополучатель;
			КонецЕсли;
			Если ЗначениеЗаполнено(ПунктДоставки.Получатель) Тогда
				Получатель=ПунктДоставки.Получатель;		
				ДокОбъект.Получатель=Получатель;
			КонецЕсли;
			Если ЗначениеЗаполнено(ПунктДоставки.ОтсрочкаПлатежа) Тогда
				ОтсрочкаПлатежа=ПунктДоставки.ОтсрочкаПлатежа;		
				ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;
			КонецЕсли;
			
			//типы цен скидки
			Если ЗначениеЗаполнено(ПунктДоставки.ТипЦен) И ТипЦен<>ПунктДоставки.ТипЦен Тогда
				ТипЦен=ПунктДоставки.ТипЦен;		
			КонецЕсли; 
			Если ЗначениеЗаполнено(ПунктДоставки.ТипСкидок) И ДокОбъект.ТипСкидок<>ПунктДоставки.ТипСкидок Тогда
				ТипСкидок=ПунктДоставки.ТипСкидок;		
			КонецЕсли;
			Если ПунктДоставки.Скидка<>0 И ПунктДоставки.Скидка<>ДокОбъект.Скидка Тогда
				Скидка=ПунктДоставки.Скидка;		
				ДокОбъект.Скидка=Скидка;
			КонецЕсли;
		КонецЕсли;
		//-------------------------------------------------------------------		
		
		ДокОбъект.Дата=ТекущаяДата();
		ЗаполнитьШапкуДокумента(ДокОбъект, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
		//УстановитьНомерДокумента2(ДокОбъект);
		ДокОбъект.Контрагент=Контрагент;
		ДокОбъект.Организация=Организация;
		ДокОбъект.Договор=Договор;
		ДокОбъект.ИБ=Справочники.ИБ.НайтиПоКоду("SSP");
		ДокОбъект.Менеджер= Менеджер;
		ДокОбъект.НомерЗаказа= УбратьНули(НомЗаказа,Контрагент.УбиратьНулиПередНомеромЗаказа);
		
		
		ДокОбъект.КодПоставщика=КодПоставщикаКонтрагента;
		
		ДокОбъект.Регион = Регион;
		ТипШК=перечисления.ТипыШтрихКодов.Штука;
		
		ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;		
		ДокОбъект.ТипЦен=ТипЦен; //Контрагент.ТипЦен;
		ДокОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН;
		ДокОбъект.Подразделение = Подразделение;
		//нечаева заглушка для метрополиса 060422
		Если Контрагент.код = "CHF-0200" Тогда
			//ДокОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("SSP-0118"); // филиал екатеренбург
			Подразделение = справочники.Подразделения.НайтиПоКоду("SSP-0118"); // филиал екатеренбург
		КонецЕсли;	
		
		ДокОбъект.ЛевыйКонтрагент=Контрагент;
		ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
		ДокОбъект.Отгружен=перечисления.Отгружен.Резерв;
		ДокОбъект.ПунктДоставки=ПунктДоставки;
		ДокОбъект.Склад=Склад;		
		//нечаева 31,08,21+++ для озона
		Если  контрагент.код = "SSP-4991" ТОгда
			
			Склад= Справочники.Склады.НайтиПоКоду("STC-60");
			
		КонецЕсли;
		//нечаева 31,08,21---
		
		//нечаева 21,04,23+++
		Если  НЕ Контрагент.ОсновнойСкладОтгрузки.пустая() ТОгда
			
			Склад= Контрагент.ОсновнойСкладОтгрузки;
			
		КонецЕсли;
		// нечаева 21,04,23---
		
		//УстановитьНомерДокумента2(ДокОбъект);
		УстановитьНомерДокументаКлиентСервер(ДокОбъект);
		
		ДокОбъект.Валюта=Справочники.Валюты.НайтиПоКоду("810");
		//ДокОбъект.Автор				=Неопределено;
		// для х5 промо 
		Если  СтрШапка.Промо = 1  Тогда
			ДокОбъект.Комментарий =  "ПРОМО"+ДокОбъект.комментарий;
		КонецЕсли;
		//Нечаева 12,09,18---
		
		
		//нечаева 13,01,15+++
		Попытка
			ДокОбъект.ДатаЗаказа=Дата(СтрЗаменить(ДатаЗаказа, "-", ""));
			
			ДатаИзЗог = Дата(1,1,1);
			Если Контрагент.Код = "SSP-5862" Тогда // только для окея
				
				ДокОбъект.датаПриемки=Дата(СтрЗаменить(ДатаДоставки, "-", ""));
				// расчитаем от даты авизации.
				// в обратную сторону
				Если ДокОбъект.ПунктДоставки.ДнейВпути>0 и ЗначениеЗаполнено(ДокОбъект.ДатаПриемки) тогда 		
					ДатаИзЗог= ДокОбъект.ДатаПриемки-ДокОбъект.ПунктДоставки.ДнейВпути*24*3600;
					Сдвиг=ПолучитьСдвигДатыАвизации(ДокОбъект);   // если выходные
					ДатаИзЗог=ДатаИзЗог-сдвиг;
				Иначе 
					ДатаИзЗог = Дата(СтрЗаменить(ДатаДоставки, "-", ""));
					ДокОбъект.датаПриемки = '00010101';
				КонецЕсли;
				
				ДокОбъект.ДатаОтгрузки =ДатаИзЗог;
				
			Иначе
				ДокОбъект.ДатаОтгрузки=Дата(СтрЗаменить(ДатаДоставки, "-", ""));
			КонецЕсли;
			
		Исключение
		КонецПопытки;
		//нечаева 13,01,15---
		
		
		
		//крохин начало 02.08.2021
		//Если СокрЛП(Контрагент.Код)=КодМетро И (Лев(ДокОбъект.Номер,3)<>"SSP" или Лев(ДокОбъект.Номер,3)<>"SST")  Тогда
		Если СокрЛП(Контрагент.Код)=КодМетро И (Лев(ДокОбъект.Номер,3)<>"SSP" или Лев(ДокОбъект.Номер,3)<>"SST" или Лев(ДокОбъект.Номер,3)<>"SSV")  Тогда
			//крохин конец 02.08.2021
			//УстановитьНомерДокумента2(ДокОбъект);
			УстановитьНомерДокументаКлиентСервер(ДокОбъект);
			
		КонецЕсли;
		
		ДокОбъект.КодОперации=Перечисления.КодыОперацийОстатки.Реализация;
		ДокОбъект.ДатаОформления	=ДокОбъект.Дата;
		СкидкаКонтрагента=ПолучитьРеквизитРодителя(Контрагент,"Скидка");
		ДокОбъект.Скидка=СкидкаКонтрагента;
		
		ПересчетТЧ(ДокОбъект,"Товары",ДокОбъект.Валюта,ДокОбъект.Валюта,ДокОбъект.Курс,ДокОбъект.Курс,Истина);	
		// нечаева биллу теперь грузим 20,04,18+++
		//Если Контрагент.КодИЛН<>"9008727000007" Тогда
		Попытка
			ДокОбъект.Записать(режимЗаписиДокумента.Запись);
			Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
			//Сообщить("Записан документ - "+ДокОбъект.Дата+" "+ДокОбъект.Номер);
		Исключение
			// Катаев+ 22/08/13 Если возникла ошибка с уникальностью номера, то пробуем обновить нумерацию объектов и сгенерировать номер заново
			Инфо = ИнформацияОбОшибке();
			Если Найти(Инфо.Описание, "Не уникальный номер документа") > 0 Тогда
				ОбновитьНумерациюОбъектов();
				//УстановитьНомерДокумента2(ЭтотОбъект);
				УстановитьНомерДокументаКлиентСервер(ЭтотОбъект);
				
				Попытка
					ДокОбъект.Записать(режимЗаписиДокумента.Запись);
					Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
				Исключение
					Если ПризКр=0 тогда
						КритичОшибки.Добавить("После обновления нумерации для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
					конецЕсли;
				КонецПопытки;
			Иначе	
				Если ПризКр=0 тогда
					КритичОшибки.Добавить("Для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
				конецЕсли;
			КонецЕсли;
			// Катаев- 22/08/13
		КонецПопытки;
		//КонецЕсли;
		//сообщить("    документ записан");
		ПризКр=ПризКр+1;
		
	КонецЕсли;
	//-------------------------------------------------------------------------------------------------------------------------------------------
	//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
	// когда складов несколько и есть данные, которые нашлись
	//-------------------------------------------------------------------------------------------------------------------------------------------
	
	КоличествоСкладов=РезультатСклады.Количество();
	//---------------------------------------------------------------------------------
	//                          по циклу смотрим данные
	//-------------------------------------------------------------------------------------
	Пока РезультатСклады.Следующий() цикл
		
		// формируем документ по складу
		//---------------------------------------------------------------------	
		// выбираем строки номенклатуры по складу, заполняем строки
		
		Склад=РезультатСклады.Склад;
		
		//нечаева 31,08,21+++ для озона
		Если  контрагент.код = "SSP-4991" ТОгда
			
			Склад= Справочники.Склады.НайтиПоКоду("STC-60");
			
		КонецЕсли;
		//нечаева 31,08,21---
		//нечаева 21,04,23+++
		Если  НЕ Контрагент.ОсновнойСкладОтгрузки.пустая() ТОгда
			
			Склад= Контрагент.ОсновнойСкладОтгрузки;
			
		КонецЕсли;
		// нечаева 21,04,23---
		
		
		// Катаев+ 21/03/13 Создавать новый документ надо только для оригинала
		//ДокОбъект=Документы.РасходнаяНакладная.СоздатьДокумент();
		//ДокОбъект = ПолучитьНакладную(Склад, Шапка.НомЗаказа, Шапка.ДатаЗаказа, Шапка.ТипЗаказа);
		ДокОбъект = ПолучитьНакладную(Склад, Шапка[0].НомЗаказа, Шапка[0].ДатаЗаказа, Шапка[0].ТипЗаказа);
		Если ДокОбъект = Неопределено Тогда
			Возврат;
		КонецЕсли;
		// Катаев- 21/03/13
		//----------------------------------------------------------------------
		
		ТЗ2  = Новый ТаблицаЗначений;
		ТЗ2.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
		ТЗ2.Колонки.Добавить("Найдена", Новый ОписаниеТипов("Число"));
		ТЗ2.Колонки.Добавить("КолвоОтредактированное",Новый ОписаниеТипов("Число"));
		ТЗ2.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		
		Запрос = Новый Запрос;
		ДанныеСкладов=Неопределено;
		МВТ = Новый МенеджерВременныхТаблиц;
		Запрос.МенеджерВременныхТаблиц = МВТ;
		Запрос.Текст  = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗ2.Склад КАК Склад,
		|	ТЗ2.Номенклатура, 
		|	ТЗ2.КолвоОтредактированное,
		|	ТЗ2.Найдена,
		|	ТЗ2.НомерСтроки
		|ПОМЕСТИТЬ ТЗ2
		|ИЗ
		|	&ТЗ2 КАК ТЗ2
		|ГДЕ
		|	ТЗ2.Склад = &ТекСклад
		|	И ТЗ2.Найдена = 1";
		Запрос.УстановитьПараметр("ТекСклад",РезультатСклады.Склад);
		Запрос.УстановитьПараметр("ТЗ2", ТзСклады);
		Запрос.Выполнить();
		
		Запрос.Текст="ВЫБРАТЬ
		|	ТЗ2.Склад КАК Склад,
		|	ТЗ2.Номенклатура,
		|	ТЗ2.КолвоОтредактированное,
		|	ТЗ2.Найдена,
		|	ТЗ2.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ТЗ2 КАК ТЗ2
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		РезНом=Запрос.Выполнить().Выбрать();
		
		// ------------------------------------------------------------------------------------------------
		Пока РезНом.Следующий() Цикл
			строкатовара = 	ДокОбъект.Товары.Добавить();
			строкатовара.Номенклатура =РезНом.Номенклатура;
			строкатовара.Заявка = РезНом.КолвоОтредактированное;
			строкатовара.Количество = РезНом.КолвоОтредактированное;
			строкатовара.ПодтвержденнаяЗаявка = РезНом.КолвоОтредактированное;
			ПриИзмененииНоменклатурыТабЧасти(строкатовара, ДокОбъект);
			РассчитатьСуммуТабЧасти(строкатовара, ДокОбъект);
		КонецЦикла;
		
		//-----------------------------------------------------------------------------------------
		//    автозаполнение параметров шапки документа, разница в шапке - в складе отгрузки
		//-----------------------------------------------------------------------------------------
		
		Если не Контрагент.Пустая() Тогда 	
			//------------------------------------------
			//Организация=Справочники.Организации.НайтиПоКоду("SSP-12"); //КБ- Стиль
			
			//нечаева18,07,17++
			Организация=Справочники.Организации.НайтиПоКоду("SS-001"); 
			//нечаева18,07,17--
			
			
			ТипЦен=Контрагент.ТипЦен;
			Договор=Контрагент.ОсновнойДоговор;
			
			//нечаева 24,10,17++ для дикси мегамарт два договора прописали по коду
			Если контрагент.код = "SSP-3687" ТОгда
				Договор = справочники.Договоры.НайтиПоКоду("SNL-022280");
			КонецЕсли;
			//нечаева 24,10,17*--
			
			
			
			Если не (Договор=Неопределено) и не (Договор=справочники.Договоры.ПустаяСсылка()) Тогда
				//ТипЦен		=Договор.ТипЦен;
				ОтсрочкаПлатежа =Договор.ОтсрочкаПлатежа;
				Если ЗначениеЗаполнено(Договор.Организация) Тогда
					Организация=Договор.Организация;		
				КонецЕсли;
			КонецЕсли;
			//
			////нечаева18,07,17++
			//Если контрагент.код = "SSP-3687" ТОгда
			//	Договор = справочники.Договоры.НайтиПоКоду("SNL-022280");
			//КонецЕсли;
			////нечаева18,07,17*--
			
			
			//-----------------  доп. обработка   --------------------------------------------------------
			ДокОбъект.ДопОбработки.Очистить();
			
			Для Каждого СтрокаТЧ Из Контрагент.ВидыДопОбработок Цикл
				
				Если СокрЛП(Контрагент.Код)="SSP-8643"  или СокрЛП(Контрагент.Код)="SSP-2412"  Тогда  
					// для метро и реал  делаем спец. обработку. 
					
					//Если КоличествоСкладов>1 И (Склад.код="SNL-79" или Склад.код="SNL-22") Тогда     
					//нечаева поменяла склад 22,01,15++
					Если КоличествоСкладов>1 И (Склад.код="STA-20" или Склад.код="STA-10") Тогда     
						//нечаева поменяла склад 22,01,15++
						// если склад белье, то одну доп обработку не берем.
						Если СтрокаТЧ.ДопОбработка.Код="ODB-00017" Тогда
							продолжить; // не пишем эту доп обработку.   палетный ярлык не пишем
						КонецЕсли;
					КонецЕсли;
					
					//Катаев+ 11/07/13
					//СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					//СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка; // остальные стандартные добавляем
					//Катаев- 11/07/13
					
				КонецЕсли;
				//Катаев+ 11/07/13
				СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка; // остальные стандартные добавляем
				//Катаев- 11/07/13
				
			КонецЦикла; 
			//нечаева 23,03,17+++
			// добавляем из пункта доставки доп. обработки.
			попытка
				Для Каждого СтрокаТЧ Из ПунктДоставки.ВидыДопОбработок Цикл
					СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
				КонецЦикла;  
			исключение
			конецПопытки;
			//нечаева 23,03,17---
			
			
			//нечаева поменяла склад 22,01,15++
			Если СокрЛП(Контрагент.Код)="SSP-2412" И (Склад.код="STA-20" или Склад.код="STA-10") Тогда     
				//нечаева поменяла склад 22,01,15++
				
				// реал
				СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("ODB-00018"); // интри
				попытка
					СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("SNL-00031"); // белье на вешалках реал
				исключение
				конецпопытки;
				
			КонецЕсли;
			
			// бельевой склад
			//Если СокрЛП(Контрагент.Код)="SSP-8643" И (Склад.код="SNL-79" или Склад.код="SNL-22") Тогда 
			//нечаева поменяла склад 22,01,15++
			Если СокрЛП(Контрагент.Код)="SSP-8643" И (Склад.код="STA-20" или Склад.код="STA-10") Тогда     
				//нечаева поменяла склад 22,01,15++
				
				
				// метро 
				попытка
					СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					//Кухарь 28.06.17 начало
					//Теперь другая ДО
					//СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("SNL-00036"); // белье на вешалках метро	
					СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("OD7-00115"); // белье на вешалках метро
					//Кухарь 28.06.17 конец
					
				исключение
				конецпопытки;
			КонецЕсли;
			
			// когда колготочный склад
			Если СокрЛП(Контрагент.Код)="SSP-8643" И (Склад.код="STA-61" или Склад.код="SNL-82") Тогда 
				// метро 
				попытка
					СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					//Кухарь 28.06.17 начало
					//Теперь другая ДО
					//СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("ODN-00014");  // антикражка + поставщик 	
					СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("OD7-00101");  // антикражка + поставщик 
					//Кухарь 28.06.17 конец
					
				исключение
				конецпопытки;
			КонецЕсли;
			
			//Нечаева 12,09,18+++
			// для х5 промо доп обработка
			Если  СтрШапка.Промо = 1  Тогда
				СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки = справочники.ВидыДопОбработки.НайтиПоКоду("OD7-00129");
			КонецЕсли;
			//Нечаева 12,09,18---
			
			
			
			
			//-------------------------------------------------------------------------------------------
			Менеджер=Контрагент.Менеджер;
			Если Менеджер=Неопределено или Менеджер=Справочники.ФизическиеЛица.ПустаяСсылка() и ПризКр=0 Тогда
				КритичОшибки.Добавить("Для контрагента "+контрагент.наименование+"  код - "+контрагент.код+"  не определен менеджер! Заказ екоде №"+ Номерзаказа );
			Иначе
				Если Не СтрДлина(Менеджер.Емэйл)>2  и ПризКр=0   Тогда
					КритичОшибки.Добавить("Для менеджера "+Менеджер.наименование+"  код - "+Менеджер.код+"  не определен ЕМэйл!" );
				КонецЕсли;
			КонецЕсли;
			
			Подразделение = Контрагент.Менеджер.Подразделение;
			//нечаева заглушка для метрополиса 060422
			Если Контрагент.код = "CHF-0200" Тогда
				//ДокОбъект.Подразделение = справочники.Подразделения.НайтиПоКоду("SSP-0118"); // филиал екатеренбург
				Подразделение = справочники.Подразделения.НайтиПоКоду("SSP-0118"); // филиал екатеренбург
			КонецЕсли;	
			
			//------------------------
			// код поставщика
			//------------------------
			КодПоставщикаКонтрагента=Контрагент.КодПоставщика;
			Если КодПоставщикаконтрагента.пустая() ИЛИ кодПоставщикаКонтрагента=Неопределено Тогда
				// Берем первую из справочника коды контрагентов
				Запрос=Новый Запрос;
				Запрос.Текст="ВЫБРАТЬ
				|	КодыПоставщиков.Ссылка
				|ИЗ
				|	Справочник.КодыПоставщиков КАК КодыПоставщиков
				|ГДЕ
				|	КодыПоставщиков.Владелец = &Контрагент
				|	И (КодыПоставщиков.Организация = &ТекОрганизация
				|			ИЛИ КодыПоставщиков.Организация = &Контр2)";
				Запрос.УстановитьПараметр("Контрагент",Контрагент);		
				Запрос.УстановитьПараметр("Контр2",Справочники.Контрагенты.ПустаяСсылка());		
				Запрос.УстановитьПараметр("ТекОрганизация",Организация);		
				Результат=Запрос.Выполнить().Выбрать();
				// катаев+ 28/02/13 Исправление ошибки
				//Пока Результат.Следующий() Цикл
				//	КодПоставщикаКонтрагента=Результат.ссылка;
				//	возврат;
				//КонецЦикла;
				Если Результат.Следующий() Тогда
					КодПоставщикаКонтрагента=Результат.ссылка;
				КонецЕсли;
				
			КонецЕсли;
			
			
			//для атака проставим
			//нечаева 08,04,21+++
			Если КодПоставщикаШапка <>"" Тогда
				
				КодПоставщикаКонтрагента=СокрЛП(КодПоставщикаШапка);
				// ищем в справочнике его.
				Запрос=Новый Запрос;
				Запрос.Текст="ВЫБРАТЬ
				|	КодыПоставщиков.Ссылка
				|ИЗ
				|	Справочник.КодыПоставщиков КАК КодыПоставщиков
				|ГДЕ
				|	КодыПоставщиков.Владелец = &Контрагент
				|	И (КодыПоставщиков.Организация = &ТекОрганизация
				|			ИЛИ КодыПоставщиков.Организация = &Контр2)
				|	И КодыПоставщиков.Наименование = &ТекНаим";
				Запрос.УстановитьПараметр("Контрагент",Контрагент);		
				Запрос.УстановитьПараметр("Контр2",Справочники.Контрагенты.ПустаяСсылка());		
				Запрос.УстановитьПараметр("ТекОрганизация",Организация);
				Запрос.УстановитьПараметр("ТекНаим",КодПоставщикаКонтрагента);
				Результат=Запрос.Выполнить().Выбрать();
				Если Результат.Следующий() Тогда
					КодПоставщикаКонтрагента=Результат.ссылка;
				КонецЕсли;
				
				// для атак нечаева 03,06,22
				Если Контрагент.код = "SSR-6556"  ТОгда
					
					КодПоставщикаКонтрагента = СокрЛП(КодПоставщикаШапка);
					КодПоставщикаКонтрагента = СтрЗаменить(КодПоставщикаКонтрагента,"0000","");
					
					// ищем в справочнике его.
					Запрос=Новый Запрос;
					Запрос.Текст="ВЫБРАТЬ
					|	КодыПоставщиков.Ссылка
					|ИЗ
					|	Справочник.КодыПоставщиков КАК КодыПоставщиков
					|ГДЕ
					|	КодыПоставщиков.Владелец = &Контрагент
					|	И (КодыПоставщиков.Организация = &ТекОрганизация
					|			ИЛИ КодыПоставщиков.Организация = &Контр2)
					|	И КодыПоставщиков.Наименование = &ТекНаим";
					Запрос.УстановитьПараметр("Контрагент",Контрагент);		
					Запрос.УстановитьПараметр("Контр2",Справочники.Контрагенты.ПустаяСсылка());		
					Запрос.УстановитьПараметр("ТекОрганизация",Организация);
					Запрос.УстановитьПараметр("ТекНаим",КодПоставщикаКонтрагента);
					Результат=Запрос.Выполнить().Выбрать();
					Если Результат.Следующий() Тогда
						КодПоставщикаКонтрагента=Результат.ссылка;
					КонецЕсли;
				КонецЕсли;	
				
				
				
			КонецЕсли;	
			//нечаева 08,04,21---
			
			
		КонецЕсли;
		
		//----------------------------------------------
		//доставка
		Если не ПунктДоставки=Неопределено  Тогда 
			Если ЗначениеЗаполнено(ПунктДоставки.РайонДоставки) Тогда
				РайонДоставки=ПунктДоставки.РайонДоставки;	
				ДокОбъект.РайонДоставки=РайонДоставки;
			КонецЕсли;	
			Если ЗначениеЗаполнено(ПунктДоставки.Регион) Тогда
				Регион=ПунктДоставки.Регион;
				ДокОбъект.Регион=Регион;
			КонецЕсли;	
			
			Если ПунктДоставки.ТипДоставки = Перечисления.ТипыДоставки.ТранспортнаяКомпания Тогда
				Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
					ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
					ДокОбъект.ТранспортнаяКомпания=ТранспортнаяКомпания;
				КонецЕсли;
				Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
					ПунктПерегруза=ПунктДоставки.ПунктПерегруза;	
					ДокОбъект.ПунктПерегруза=ПунктПерегруза;
				КонецЕсли;		
			КонецЕсли;
			//Катаев- 10/04/14
			Если ЗначениеЗаполнено(ПунктДоставки.Грузополучатель) Тогда
				Грузополучатель=ПунктДоставки.Грузополучатель;		
				ДокОбъект.Грузополучатель=Грузополучатель;
			КонецЕсли;
			Если ЗначениеЗаполнено(ПунктДоставки.Получатель) Тогда
				Получатель=ПунктДоставки.Получатель;		
				ДокОбъект.Получатель=Получатель;
			КонецЕсли;
			Если ЗначениеЗаполнено(ПунктДоставки.ОтсрочкаПлатежа) Тогда
				ОтсрочкаПлатежа=ПунктДоставки.ОтсрочкаПлатежа;		
				ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;
			КонецЕсли;
			
			//типы цен скидки
			Если ЗначениеЗаполнено(ПунктДоставки.ТипЦен) И ТипЦен<>ПунктДоставки.ТипЦен Тогда
				ТипЦен=ПунктДоставки.ТипЦен;		
			КонецЕсли; 
			Если ЗначениеЗаполнено(ПунктДоставки.ТипСкидок) И ДокОбъект.ТипСкидок<>ПунктДоставки.ТипСкидок Тогда
				ТипСкидок=ПунктДоставки.ТипСкидок;		
			КонецЕсли;
			Если ПунктДоставки.Скидка<>0 И ПунктДоставки.Скидка<>ДокОбъект.Скидка Тогда
				Скидка=ПунктДоставки.Скидка;		
				ДокОбъект.Скидка=Скидка;
			КонецЕсли;
		КонецЕсли;
		//-------------------------------------------------------------------		
		
		ДокОбъект.Дата=ТекущаяДата();
		ЗаполнитьШапкуДокумента(ДокОбъект, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
		//УстановитьНомерДокумента2(ДокОбъект);
		ДокОбъект.Контрагент=Контрагент;
		ДокОбъект.Организация=Организация;
		ДокОбъект.Договор=Договор;
		ДокОбъект.ИБ=Справочники.ИБ.НайтиПоКоду("SSP");
		ДокОбъект.Менеджер= Менеджер;
		ДокОбъект.НомерЗаказа= УбратьНули(НомерЗаказа,Контрагент.УбиратьНулиПередНомеромЗаказа);
		// для х5 промо 
		Если  СтрШапка.Промо = 1  Тогда
			ДокОбъект.Комментарий =  "ПРОМО"+ДокОбъект.комментарий;
		КонецЕсли;
		//Нечаева 12,09,18---
		
		
		Попытка
			ДокОбъект.ДатаЗаказа=Дата(СтрЗаменить(ДатаЗаказа, "-", ""));
			ДокОбъект.ДатаОтгрузки=Дата(СтрЗаменить(ДатаДоставки, "-", ""));
		Исключение
		КонецПопытки;
		
		
		//нечаева 27,11,17+++
		Попытка
			//14,05,20 нечаева
			ПервыйЗнак = Лев(ВремяДоставки,1); // если 09:00, то ищем " 9:00"
			Если ПЕрвыйЗнак = "0" ТОгда    
				ВремяДоставки =" "+Сред(СтрШапка.ВремяДоставки,2,СтрДлина(СтрШапка.ВремяДоставки)-1) ;
			КонецЕсли;	
			//14-05-20 нечаева
			
			
			
			ДокОбъект.ВремяПриемки = Справочники.ВремяПриемки.НайтиПоНаименованию(""+ВремяДоставки+":00-"+ВремяДоставки+":00");
			
			// только после сохранения докмуента возможно.
			//
			//ЗаписьВРег=РегистрыСведений.РеквизитыДокументов.СоздатьМенеджерЗаписи();
			//ЗаписьВРег.Документ=Документ.Ссылка;
			//ЗаписьВРег.ИмяРеквизита="ВремяПриемкиДляЗОГ";
			//ЗаписьВРег.Период=Документ.Ссылка.Дата;
			//ЗаписьВРег.ЗначениеРеквизита=ВремяПриемки;
			//ЗаписьВРег.Записать();
			
		Исключение
		КонецПопытки;
		//нечаева 27,11,17---
		
		
		ДокОбъект.КодПоставщика=КодПоставщикаКонтрагента;
		
		ДокОбъект.Регион = Регион;
		ТипШК=перечисления.ТипыШтрихКодов.Штука;
		
		ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;		
		ДокОбъект.ТипЦен=ТипЦен; //Контрагент.ТипЦен;
		ДокОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН;
		ДокОбъект.Подразделение = Подразделение;
		ДокОбъект.ЛевыйКонтрагент=Контрагент;
		ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
		ДокОбъект.Отгружен=перечисления.Отгружен.Резерв;
		ДокОбъект.ПунктДоставки=ПунктДоставки;
		
		ДокОбъект.Склад=Склад;	
		//нечаева 31,08,21+++ для озона
		Если  контрагент.код = "SSP-4991" ТОгда
			
			Склад= Справочники.Склады.НайтиПоКоду("STC-60");
			
		КонецЕсли;
		//нечаева 31,08,21---
		//нечаева 21,04,23+++
		Если  НЕ Контрагент.ОсновнойСкладОтгрузки.пустая() ТОгда
			
			Склад= Контрагент.ОсновнойСкладОтгрузки;
			
		КонецЕсли;
		// нечаева 21,04,23---
		
		
		//	УстановитьНомерДокумента2(ДокОбъект);
		УстановитьНомерДокументаКлиентСервер(ДокОбъект);
		
		ДокОбъект.Валюта=Справочники.Валюты.НайтиПоКоду("810");
		ДокОбъект.Автор	=Неопределено;
		
		//крохин начало 02.08.2021
		//Если СокрЛП(Контрагент.Код)=КодМетро И (Лев(ДокОбъект.Номер,3)<>"SSP" или Лев(ДокОбъект.Номер,3)<>"SST") Тогда
		Если СокрЛП(Контрагент.Код)=КодМетро И (Лев(ДокОбъект.Номер,3)<>"SSP" или Лев(ДокОбъект.Номер,3)<>"SST" или Лев(ДокОбъект.Номер,3)<>"SSV") Тогда
			//крохин конец 02.08.2021
			//УстановитьНомерДокумента2(ДокОбъект);
			УстановитьНомерДокументаКлиентСервер(ДокОбъект);
			
		КонецЕсли;
		
		ДокОбъект.КодОперации=Перечисления.КодыОперацийОстатки.Реализация;
		ДокОбъект.ДатаОформления	=ДокОбъект.Дата;
		СкидкаКонтрагента=ПолучитьРеквизитРодителя(Контрагент,"Скидка");
		ДокОбъект.Скидка=СкидкаКонтрагента;
		
		//Валетов + 30.06.2026 Изменение 0000000060
		//ДокОбъект.ДатаОплаты	    =ПолучитьДатуОплаты1(ДокОбъект.ДатаОтгрузки,ДокОбъект.ОтсрочкаПлатежа);	
		ПараметрыРасчетаДатыОплаты  = ОбщегоНазначенияКС.ПолучитьЗаполнитьПараметрыРасчетаДатыОплатыПоДокументу(ДокОбъект);
		ДокОбъект.ДатаОплаты 		= ОбщегоНазначенияКС.ПолучитьДатуОплатыПоДокументуКлиентСервер(ПараметрыРасчетаДатыОплаты); 
		//Валетов-	
		
		ПересчетТЧ(ДокОбъект,"Товары",ДокОбъект.Валюта,ДокОбъект.Валюта,ДокОбъект.Курс,ДокОбъект.Курс,Истина);
		
		//проверим на пустые цены!!
		//нечаева 15,03,16+++
		
		ОтборНулевыеЦены=новый Структура("Цена",0);
		МассивНулевыхЦен=ДокОбъект.Товары.НайтиСтроки(ОтборНулевыеЦены);
		
		
		Для каждого текстрока из МассивНулевыхЦен цикл
			
			Отбор2=новый Структура("номенклатура",ТекСтрока.номенклатура);
			тстрока=ДокОбъект.Товары.НайтиСтроки(Отбор2);
			Ошибки.Добавить("Для товара -  "+ТекСтрока.номенклатура +" Цена =0, не записано в заказе, проверьте матрицу! " );
			ТекНом =тстрока[0].НомерСтроки; //.удалить()
			докобъект.товары.Удалить(ТекНом-1);
			
		КонецЦикла;
		//нечаева 15,03,16---
		
		
		//нечева 20,04,18+++ биллу теперь грузим
		//Если Контрагент.КодИЛН<>"9008727000007" Тогда
		Попытка
			ДокОбъект.Записать(режимЗаписиДокумента.Запись);
			//Катаев+ 31/10/13 В регистр сведений заносим GLN  конечного пункта (Лента)
			
			
			//Для Х5 куча реквизитов
			//нечаева 17,09,18+++
			Попытка
				
				НоваяЗаписьТек = РегистрыСведений.ЗначенияСвойствОбъектовУПД.СоздатьМенеджерЗаписи();
				НоваяЗаписьТек.Объект   = ДокОбъект.Ссылка;
				НоваяЗаписьТек.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию(СокрЛП("EDI_КонтактыЛогистов")); 
				НоваяЗаписьТек.Значение = ""+СтрШапка.ИмяЛогиста+" / "+СтрШапка.АдресЛогиста;
				НоваяЗаписьТек.Записать();
				
			Исключение
			КонецПопытки;
			
			
			
			Попытка
				Если СокрЛП(СтрШапка.ОкнаДоставки)<>"" Тогда
					НоваяЗаписьТек = РегистрыСведений.ЗначенияСвойствОбъектовУПД.СоздатьМенеджерЗаписи();
					НоваяЗаписьТек.Объект   = ДокОбъект.Ссылка;
					НоваяЗаписьТек.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию(СокрЛП("EDI_ОкнаДоставки")); 
					НоваяЗаписьТек.Значение = ""+СтрШапка.ОкнаДоставки;
					НоваяЗаписьТек.Записать();
				КонецЕсли;
				
			Исключение
			КонецПопытки;
			//нечаева 17,09,18---
			
			
			
			//нечаева 27,11,17+++   только для Окея
			Если ДокОбъект.контрагент.код = "SSP-5862" Тогда
				Попытка
					//	ДокОбъект.ВремяПриемки = Справочники.ВремяПриемки.НайтиПоНаименованию(""+ВремяДоставки+":00-"+ВремяДоставки+":00");
					//14,05,20 нечаева
					ПервыйЗнак = Лев(СтрШапка.ВремяДоставки,1); // если 09:00, то ищем " 9:00"
					Если ПЕрвыйЗнак = "0" ТОгда    
						ВремяДоставки =" "+Сред(СтрШапка.ВремяДоставки,2,СтрДлина(СтрШапка.ВремяДоставки)-1) ;
					КонецЕсли;	
					//14-05-20 нечаева
					
					// только после сохранения докмуента возможно.
					//
					ЗаписьВРег=РегистрыСведений.РеквизитыДокументов.СоздатьМенеджерЗаписи();
					ЗаписьВРег.Документ=ДокОбъект.Ссылка;
					ЗаписьВРег.ИмяРеквизита="ВремяПриемкиДляЗОГ";
					ЗаписьВРег.Период=ДокОбъект.Ссылка.Дата;
					ЗаписьВРег.ЗначениеРеквизита=Справочники.ВремяПриемки.НайтиПоНаименованию(""+ВремяДоставки+":00-"+ВремяДоставки+":00");
					ЗаписьВРег.Записать();
					
				Исключение
				КонецПопытки;
			КонецЕсли;
			//нечаева 27,11,17---
			
			
			//нечаева 02,12,19+++						
			//для виктории балтии
			Если ДокОбъект.Контрагент.Код="SSR-4726"  Тогда
				попытка
					
					НаборЗаписей = РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Документ.Установить(ДокОбъект.Ссылка); 
					НаборЗаписей.Отбор.ИмяРеквизита.Установить("GLN"); 
					НаборЗаписей.Очистить();;
					НаборЗаписей.Записать();
					
				исключение
				конецПопытки;
				
				попытка
					рег = регистрыСведений.РеквизитыРНКПНКПРМ;
					Элемент = Рег.СоздатьМенеджерЗаписи();
					Элемент.Документ = ДокОбъект.ссылка;
					Элемент.ИмяРеквизита = "GLN";
					Элемент.ЗначениеРеквизита = СтрШапка.ИЛНПлательщика;
					Элемент.Записать();
				исключение
				конецПопытки;
				
			КонецЕсли;
			//нечаева 02,12,19+++		
			
			
			// для атака
			//Нечаева 25,10,17++
			Если ДокОбъект.Контрагент.Код="SSR-6556"  Тогда
				попытка
					
					НаборЗаписей = РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Документ.Установить(ДокОбъект.Ссылка); 
					НаборЗаписей.Отбор.ИмяРеквизита.Установить("GLN"); 
					НаборЗаписей.Очистить();;
					НаборЗаписей.Записать();
					
				исключение
				конецПопытки;
				
				рег = регистрыСведений.РеквизитыРНКПНКПРМ;
				Элемент = Рег.СоздатьМенеджерЗаписи();
				Элемент.Документ = ДокОбъект.ссылка;
				Элемент.ИмяРеквизита = "GLN";
				Элемент.ЗначениеРеквизита = СтрШапка.ИЛНМестаДоставки;
				Элемент.Записать();
				
				
				
				//нечаева 02,11,17+++
				Попытка
					НаборЗаписей = РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Документ.Установить(ДокОбъект.Ссылка); 
					НаборЗаписей.Отбор.ИмяРеквизита.Установить("GLNпокупателя"); 
					НаборЗаписей.Очистить();;
					НаборЗаписей.Записать();
				Исключение
				КонецПопытки;
				
				
				Попытка
					рег = регистрыСведений.РеквизитыРНКПНКПРМ;
					Элемент = Рег.СоздатьМенеджерЗаписи();
					Элемент.Документ = ДокОбъект.ссылка;
					Элемент.ИмяРеквизита = "GLNпокупателя";
					Элемент.ЗначениеРеквизита = СтрШапка.ИЛНПокупателя;
					Элемент.Записать();
				Исключение
				КонецПопытки;
				//нечаева 02,11,17---
				
				
			КонецЕсли;
			//Нечаева 25,10,17--
			
			//нечаева 07,10,2022+++  для ленты
			Если стрШапка.контрагент.код = "SSR-1593" и ( СтрШапка.ГЛН_Конечный = "" или  СтрШапка.ГЛН_Конечный = неопределено) тогда  // это лента
				
				СтрШапка.ГЛН_Конечный = ДокОбъект.ПунктДоставки.КодИЛН;
				
			конецЕсли;	
			// нечаева 07,10,22--
			
			
			// нечаева 23,03,16 +++ если напрямую грузим! не через рц
			Если СтрШапка.ГЛН_Конечный = "" Тогда
				СтрШапка.ГЛН_Конечный = ДокОбъект.ПунктДоставки.КодИЛН;
			КонецЕсли;
			// нечаева 23,03,16 ---	
			
			
			Если СтрШапка.ГЛН_Конечный <> Неопределено Тогда
				//нечаева 13,03,17+++
				
				//было
				//рег = регистрыСведений.РеквизитыРНКПНКПРМ;
				//ВыборкаРег = Рег.Выбрать();
				//Пока ВыборкаРег.Следующий() Цикл
				//	Если ВыборкаРег.ИмяРеквизита = "GLN" И ВыборкаРег.Документ = ДокОбъект.Ссылка Тогда;
				//		ВыборкаРег.ПолучитьМенеджерЗаписи().Удалить();
				//	КонецЕсли;
				//КонецЦикла;
				//Элемент = Рег.СоздатьМенеджерЗаписи();
				//Элемент.Документ = ДокОбъект.ссылка;
				//Элемент.ИмяРеквизита = "GLN";
				//Элемент.ЗначениеРеквизита = СтрШапка.ГЛН_Конечный;
				//Элемент.Записать();
				
				попытка
					
					НаборЗаписей = РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Документ.Установить(ДокОбъект.Ссылка); 
					НаборЗаписей.Отбор.ИмяРеквизита.Установить("GLN"); 
					НаборЗаписей.Очистить();;
					НаборЗаписей.Записать();
					
				исключение
				конецПопытки;
				
				рег = регистрыСведений.РеквизитыРНКПНКПРМ;
				Элемент = Рег.СоздатьМенеджерЗаписи();
				Элемент.Документ = ДокОбъект.ссылка;
				Элемент.ИмяРеквизита = "GLN";
				Элемент.ЗначениеРеквизита = СтрШапка.ГЛН_Конечный;
				Элемент.Записать();
				
				//нечаева 13,03,17----
				
				
			КонецЕсли;
			//Катаев- 31/10/13
			//Катаев+ 01/12/14 Для Молнии заносим в регистр сведений Номер заявки
			
			//нечаева 26,11,18+++
			Если Контрагент = Справочники.Контрагенты.НайтиПоКоду("CHF-0006") ТОгда
				
				Если СтрШапка.НомерЗаявкиМолния <> Неопределено Тогда
					рег = регистрыСведений.РеквизитыРНКПНКПРМ;
					ВыборкаРег = Рег.Выбрать();
					Пока ВыборкаРег.Следующий() Цикл
						Если ВыборкаРег.ИмяРеквизита = "НомерЗаявкиМолния" И ВыборкаРег.Документ = ДокОбъект.Ссылка Тогда;
							ВыборкаРег.ПолучитьМенеджерЗаписи().Удалить();
						КонецЕсли;
					КонецЦикла;
					Элемент = Рег.СоздатьМенеджерЗаписи();
					Элемент.Документ = ДокОбъект.ссылка;
					Элемент.ИмяРеквизита = "НомерЗаявкиМолния";
					Элемент.ЗначениеРеквизита = СтрШапка.НомерЗаявкиМолния;
					Элемент.Записать();
				КонецЕсли;
			КонецЕсли;
			//нечаева 26,11,18---
			
			
			//Катаев- 01/12/14
			Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
			//Сообщить("Записан документ - "+ДокОбъект.Дата+" "+ДокОбъект.Номер);
			// записать номер в "ошибки" для вывода менеджерам
		Исключение
			// Катаев+ 22/08/13 Если возникла ошибка с уникальностью номера, то пробуем обновить нумерацию объектов и сгенерировать номер заново
			Инфо = ИнформацияОбОшибке();
			Если Найти(Инфо.Описание, "Не уникальный номер документа") > 0 Тогда
				ОбновитьНумерациюОбъектов();
				//УстановитьНомерДокумента2(ЭтотОбъект);
				УстановитьНомерДокументаКлиентСервер(ЭтотОбъект);
				
				Попытка
					ДокОбъект.Записать(режимЗаписиДокумента.Запись);
					Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
					//Катаев+ 31/10/13 В регистр сведений заносим GLN  конечного пункта (Лента)
					
					
					// для атака
					//Нечаева 25,10,17++
					Если ДокОбъект.Контрагент.Код="SSR-6556"  Тогда
						попытка
							
							НаборЗаписей = РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();
							НаборЗаписей.Отбор.Документ.Установить(ДокОбъект.Ссылка); 
							НаборЗаписей.Отбор.ИмяРеквизита.Установить("GLN"); 
							НаборЗаписей.Очистить();;
							НаборЗаписей.Записать();
							
						исключение
						конецПопытки;
						
						рег = регистрыСведений.РеквизитыРНКПНКПРМ;
						Элемент = Рег.СоздатьМенеджерЗаписи();
						Элемент.Документ = ДокОбъект.ссылка;
						Элемент.ИмяРеквизита = "GLN";
						Элемент.ЗначениеРеквизита = СтрШапка.ИЛНМестаДоставки;
						Элемент.Записать();
						
						//нечаева 02,11,17+++
						Попытка
							НаборЗаписей = РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();
							НаборЗаписей.Отбор.Документ.Установить(ДокОбъект.Ссылка); 
							НаборЗаписей.Отбор.ИмяРеквизита.Установить("GLNпокупателя"); 
							НаборЗаписей.Очистить();;
							НаборЗаписей.Записать();
						Исключение
						КонецПопытки;
						
						
						Попытка
							рег = регистрыСведений.РеквизитыРНКПНКПРМ;
							Элемент = Рег.СоздатьМенеджерЗаписи();
							Элемент.Документ = ДокОбъект.ссылка;
							Элемент.ИмяРеквизита = "GLNпокупателя";
							Элемент.ЗначениеРеквизита = СтрШапка.ИЛНПокупателя;
							Элемент.Записать();
						Исключение
						КонецПопытки;
						//нечаева 02,11,17---
						
						
					КонецЕсли;
					//Нечаева 25,10,17--
					
					//нечаева 07,10,2022+++
					Если стрШапка.контрагент.код = "SSR-1593" и ( СтрШапка.ГЛН_Конечный = "" или  СтрШапка.ГЛН_Конечный = неопределено) тогда  // это лента
						
						СтрШапка.ГЛН_Конечный = ДокОбъект.ПунктДоставки.КодИЛН;
						
					конецЕсли;	
					// нечаева 07,10,22--
					
					
					
					// нечаева 23,03,16 +++ если напрямую грузим! не через рц
					Если СтрШапка.ГЛН_Конечный = "" Тогда
						СтрШапка.ГЛН_Конечный = ДокОбъект.ПунктДоставки.КодИЛН;
					КонецЕсли;
					// нечаева 23,03,16 ---	
					
					Если СтрШапка.ГЛН_Конечный <> Неопределено Тогда
						//нечаева 13,03,17+++
						
						//было
						//рег = регистрыСведений.РеквизитыРНКПНКПРМ;
						//ВыборкаРег = Рег.Выбрать();
						//Пока ВыборкаРег.Следующий() Цикл
						//	Если ВыборкаРег.ИмяРеквизита = "GLN" И ВыборкаРег.Документ = ДокОбъект.Ссылка Тогда;
						//		ВыборкаРег.ПолучитьМенеджерЗаписи().Удалить();
						//	КонецЕсли;
						//КонецЦикла;
						//Элемент = Рег.СоздатьМенеджерЗаписи();
						//Элемент.Документ = ДокОбъект.ссылка;
						//Элемент.ИмяРеквизита = "GLN";
						//Элемент.ЗначениеРеквизита = СтрШапка.ГЛН_Конечный;
						//Элемент.Записать();
						
						попытка
							
							НаборЗаписей = РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();
							НаборЗаписей.Отбор.Документ.Установить(ДокОбъект.Ссылка); 
							НаборЗаписей.Отбор.ИмяРеквизита.Установить("GLN"); 
							НаборЗаписей.Очистить();;
							НаборЗаписей.Записать();
							
						исключение
						конецПопытки;
						
						рег = регистрыСведений.РеквизитыРНКПНКПРМ;
						Элемент = Рег.СоздатьМенеджерЗаписи();
						Элемент.Документ = ДокОбъект.ссылка;
						Элемент.ИмяРеквизита = "GLN";
						Элемент.ЗначениеРеквизита = СтрШапка.ГЛН_Конечный;
						Элемент.Записать();
						
						//нечаева 13,03,17----
						
					КонецЕсли;
					//Катаев- 31/10/13
				Исключение
					Если ПризКр=0 тогда
						КритичОшибки.Добавить("После обновления нумерации для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
						//Катаев+ 11/12/14
						Отказ = Истина;
						//Катаев- 11/12/14
					конецЕсли;
				КонецПопытки;
			Иначе	
				Если ПризКр=0 тогда
					КритичОшибки.Добавить("Для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
					//Катаев+ 11/12/14
					Отказ = Истина;
					//Катаев- 11/12/14
				конецЕсли;
			КонецЕсли;
			// Катаев- 22/08/13
			//Сообщить(ОписаниеОшибки());
		КонецПопытки;
		//КонецЕсли;
		//сообщить("    документ записан");
		ПризКр=ПризКр+1;
	КонецЦикла;
	// конец заполнения документа
	
	
КонецПроцедуры



Функция SQLiteInit(ФайлБД) Экспорт
	SQLiteObject = Новый COMОбъект("ADODB.Connection");
	SQLiteConnectionString = "DRIVER=SQLite3 ODBC Driver;Database=" + ФайлБД + ";";
	Попытка
		ЗаписатьВЛог("Тестирование екод","Путь к базе :"+SQLiteConnectionString,"Информация");
		SQLiteObject.Open(SQLiteConnectionString);
		
	Исключение
		// Сообщить("Невозможно подключится к драйверу SQLite. Возможно файл [" + ФайлБД + "] открыт другим пользователем или программой!");
		ЗаписатьВЛог("Тестирование екод","Инициализация: "+ОписаниеОшибки(),"Информация");
		Возврат Ложь;
	КонецПопытки;
	Возврат Истина;
КонецФункции

Функция SQLiteQuery(Запрос) Экспорт
	SQLiteRS = Новый COMОбъект("ADODB.Recordset");
	Попытка
		SQLiteRS = SQLiteObject.Execute(Запрос);
	Исключение
		//Сообщить("Невозможно выполнить SQL запрос " + ОписаниеОшибки(), СтатусСообщения.Важное);
		ЗаписатьВЛог("Тестирование екод","Невозможно выполнить SQL запрос " + ОписаниеОшибки(),"Информация");
		Возврат Ложь;
	КонецПопытки;
	
	Возврат SQLiteRS;
КонецФункции


// отрезает нужное количество от пути "/"
Функция НайтиПодстроку(СтрокаПоиска,Итератор)
	
	Итератор=Итератор-1;
	Поиск1=Найти(СтрокаПоиска,"\"); 
	СтрокаПоиска =  Прав(СтрокаПоиска,СтрДлина(СтрокаПоиска)-Поиск1);
	Если Итератор=0 Тогда 
		
		возврат СтрокаПоиска;
	Иначе
		
		возврат НайтиПодстроку(СтрокаПоиска,Итератор);
	КонецЕсли;
	
	
КонецФункции

Функция ПолучитьЗначениеИзБазыSQl(НомерПараметра,КОбьект)
	
	ЗначениеО = неопределено;
	
	//// в два захода будем считывать.
	попытка
		ЗначениеО = КОбьект.Fields(НомерПараметра).value;
	исключение
		ЗначениеО = неопределено;
	конецПопытки;
	
	
	Возврат ЗначениеО;
	
	
КонецФункции

Функция СформироватьПутиФайловНовая() Экспорт 
	
	Путь = Новый СписокЗначений;
	
	
	// В третью колонку будем посылать что это за документ (ORDER или RECADV)
	Результат33=Новый Массив(10000,3);
	НомПП=1;
	//Катаев+ 14/11/14 Отрабатываем файлы СКБ-Контур
	
	//крохин начало 29.04.2021
	Путь=КаталогЕкода+"4607182079990EC\.config\EcodDb.sqlite3";  //сообщить(путь);
	ПутьКопии = СерверЕкода+"\db_copy\copy3\EcodDb.sqlite3";    // сообщить(путьКопии);
	ПутьКаталогаКопии = СерверЕкода+"\db_copy\copy3\";          // сообщить(ПутьКаталогаКопии);
	Попытка
		УдалитьФайлы(ПутьКаталогаКопии);
		
		ЗаписатьВЛог("Тестирование екод","База1 успешно удалены файлы из "+ПутьКаталогаКопии,"Информация");
		ФайлыДанных = НайтиФайлы(ПутьКаталогаКопии);
		КоличествоФайловПослеУдаления = 0;
		Для Каждого ФайлДанных Из ФайлыДанных Цикл
			КоличествоФайловПослеУдаления = КоличествоФайловПослеУдаления + 1;
		КонецЦикла;
		ЗаписатьВЛог("Тестирование екод","Количество файлов после удаления "+КоличествоФайловПослеУдаления,"Информация");
		СоздатьКаталог(ПутьКаталогаКопии);
		//КопироватьФайл(Путь,ПутьКопии);
		ПутьКаталога =  КаталогЕкода+"4607182079990EC\.config\";
		ФайлыДанных = НайтиФайлы(ПутьКаталога,"*.*");
		Для Каждого ФайлДанных Из ФайлыДанных Цикл
			Если ФайлДанных.ПолноеИмя +"\" <> ПутьКаталога Тогда
				КопироватьФайл(ФайлДанных.ПолноеИмя,ПутьКаталогаКопии+ФайлДанных.Имя);
				ЗаписатьВЛог("Тестирование екод","Успешно скопирован файл "+ФайлДанных.ПолноеИмя + " в "+ПутьКаталогаКопии+ФайлДанных.Имя,"Информация");
			КонецЕсли;
		КонецЦикла;
		
		ЗаписатьВЛог("Тестирование екод","База1 успешно скопирована из "+Путь + " в "+ПутьКопии,"Информация");
	Исключение
		ЗаписатьВЛог("Тестирование екод","Ошибка при копировании база 1"+ОписаниеОшибки(),"Информация");
	КонецПопытки;
	
	Путь = ПутьКопии; 
	//крохин конец 29.04.2021
	ЗаписатьВЛог("Тестирование екод","Путь номер 1!","Информация");
	//---------------------------------
	sqlite_master = SQLiteInit(Путь);
	Если sqlite_master=ложь тогда
		// значит не читается БД
		
		ЗаписатьВЛог("Тестирование екод","екод база не прочиталась1!","Информация"); 
		//возврат;
	КонецЕсли;	
	ппп=1;
	
	
	// для СКБ контура осталось.
	
	
	Файлы = НайтиФайлы(КаталогЕкода+"СКБ_Контур\","*.xml");
	Для Каждого тфайл из Файлы Цикл
		Если Найти(тФайл.Имя, "ORDERS") > 0 Тогда
			ТипДок = "ORDERS";
		ИначеЕсли Найти(тФайл.Имя, "RECADV") > 0 Тогда
			Типдок = "RECADV";
		Иначе
			Продолжить;
		КонецЕсли;
		Филиал = КонтрагентФилиала(тФайл.ПолноеИмя, ТипДок);
		Если Филиал <> Неопределено Тогда
			
			// пока закомментируем, чтобы не двоились в филиале
			//!!!!!!!!!!!!!!!!!!!!!!!!!!!
			Если Филиал <> "SNL" Тогда
				//Делаем перенос на фтп
				СохранитьФайлНаФТП(тфайл, Филиал, тФайл.ПолноеИмя);
				Продолжить;
			КонецЕсли;
			//!!!!!!!!!!!!!!!!!!!!!!!!!!!
			Результат33[НомПП][0]=""+тфайл.ПолноеИмя;
			Результат33[НомПП][1]=""+0;                  
			Результат33[НомПП][2]=""+ТипДок;                  
			НомПП=НомПП+1;
			
			// делаем  копию для архива
			
			фф=новый файл(тФайл.Путь+"ARHIV\");
			если НЕ фф.Существует() тогда
				попытка
					создатькаталог(тФайл.Путь+"ARHIV\");
				исключение
					#Если клиент тогда
						сообщить("+++++"+тФайл.Путь);
					#конецесли	
					
				конецПопытки;
			конецесли;	
			ИмяДляЗаписи=тФайл.Путь+"ARHIV\"+тФайл.Имя;
			Попытка
				КопироватьФайл(тФайл.ПолноеИмя,ИмяДляЗаписи);
			Исключение
			КонецПопытки;	
		КонецЕсли;
	КонецЦикла;
	//Катаев- 14/11/14
	
	//--------------------------------------------------------------------------------
	// тут для Сфера-Курьер.  новое  единая европа + бтк
	//--------------------------------------------------------------------------------
	// будет в будущем:
	Дата1 = ТекущаяДата() - 60 * 60 * 24; // - берем + вчерашний день, чтобы ночные заказы прогрузились!!!
	Дата2 = ТекущаяДата() + 60 * 60 * 24;
	// отформатируем дату  Формат('20020820153309', "ДФ=""дд/ММ-гггг"""); 
	
	Дата1 = Формат(Дата1,"ДФ=""гггг-ММ-дд""");
	Дата2 = Формат(Дата2,"ДФ=""гггг-ММ-дд""");
	
	// этот потом как основной использовать.
	//крохин начало 27.04.2021
	//отладка
	ТекстЗапроса = "SELECT files.Id, files.FilePath, files.FileName, FilesStatus.time FROM files, FilesStatus  WHERE  (FilesStatus.Time Between '"+Строка(Дата1)+"' AND '"+Строка(Дата2)+"') and (files.id = FilesStatus.FileId)";
	//ПутиФайлов2 = SQLiteQuery("SELECT files.Id, files.FilePath, files.FileName, FilesStatus.time FROM files, FilesStatus  WHERE  (FilesStatus.Time Between '"+Строка(Дата1)+"' AND '"+Строка(Дата2)+"') and (files.id = FilesStatus.FileId)");
	
	ЗаписатьВЛог("Тестирование екод","Пользователь :"+ПараметрыСеанса.Пользователь,"Информация");
	ЗаписатьВЛог("Тестирование екод","Имя компьютера :"+ИмяКомпьютера(),"Информация");
	ЗаписатьВЛог("Тестирование екод","Имя пользователя :"+ИмяПользователя(),"Информация");
	ЗаписатьВЛог("Тестирование екод","Сеанс :"+НомерСеансаИнформационнойБазы(),"Информация");
	f = новый COMОбъект("WScript.Network");
	ЗаписатьВЛог("Тестирование екод","Сеанс :"+f.UserName,"Информация");
	ПутиФайлов2 = SQLiteQuery(ТекстЗапроса);
	//крохин конец 27.04.2021
	
	попытка
		Если ПутиФайлов2.EOF Тогда
		КонецЕсли;	
	Исключение
		#Если Клиент Тогда
			сообщить(ОписаниеОшибки());
			
		#КонецЕсли
		
		
		ЗаписатьВЛог("Тестирование екод","екод база не прочиталась 2!"+ОписаниеОшибки(),"Информация"); 
		
		возврат Результат33;
		
		
	конецПопытки;	
	
	КоличествоФайлов = 0;
	
	Пока НЕ ПутиФайлов2.EOF Цикл
		
		КоличествоФайлов = КоличествоФайлов + 1;
		
		//ОбработкаПрерыванияПользователя();
		
		Попытка
			time = ПутиФайлов2.Fields(3).value;
		Исключение
			ПутиФайлов2.MoveNext();
			ЗаписатьВЛог("Тестирование екод","екод база не прочиталась 3!"+ОписаниеОшибки(),"Информация"); 
			
		КонецПопытки;	
		
		
		// странный косяк при считывании, считывает через раз.
		Name = ПолучитьЗначениеИзБазыSQl(1, ПутиФайлов2);
		Если Name = неопределено тогда
			Name = ПолучитьЗначениеИзБазыSQl(1, ПутиФайлов2);
		КонецЕсли;	
		
		Name2 = ПолучитьЗначениеИзБазыSQl(2, ПутиФайлов2);
		Если Name2 = неопределено тогда
			Name2 = ПолучитьЗначениеИзБазыSQl(2, ПутиФайлов2);
		КонецЕсли;	
		
		
		// по этим почему то нет таких багов. 
		попытка
			ИДНТ  = ПутиФайлов2.Fields(0).value;
			Name = Прав(Name,СтрДлина(Name)-2);
			time = ПутиФайлов2.Fields(3).value;
		исключение
			#Если клиент Тогда	
				Сообщить("ID/Name: " + ИДНТ + "/" + Name+"/" + Name2+"/"+time+ОписаниеОшибки());
			#КонецЕсли      	
			ПутиФайлов2.MoveNext();
			
		конецПопытки;
		#Если клиент Тогда	
			Сообщить("ID/Name: " + ИДНТ + "/" + Name+"/" + Name2+"/"+time);
		#КонецЕсли      	
		
		//ТекПуть = "\\SRVECODE"+ Name+"\"+Name2;
		ТекПуть = СерверЕкода+ Name+"\"+Name2;
		// DELETE FROM files WHERE StandardCost > 1000.00;
		
		// из имени файла
		НН = Name;
		// 3 первых отсекаем. ГЛН покупателя
		УрезанныйПуть=НайтиПодстроку(НН,4);
		
		ПоискИЛН=Найти(УрезанныйПуть,"\"); 
		ИЛНПок =  Лев(УрезанныйПуть,ПоискИЛН-1);
		
		// ТипДокумента
		НН = Name;
		УрезанныйПуть=НайтиПодстроку(НН,6);
		
		ПоискТипДок=Найти(УрезанныйПуть,"_"); 
		ТипДок =  Лев(УрезанныйПуть,ПоискТипДок-1);
		
		
		Если (ТипДок="ORDER" ИЛИ ТипДок="RECADV")  тогда
			
			ФайлЗап=Новый Файл(ТекПуть);		
			Если ФайлЗап.Существует() Тогда
				
				//проверка принадлежности контрагента филиалу.
				Филиал = КонтрагентФилиала(ТекПуть, ТипДок);
				Если Филиал <> Неопределено Тогда
					
					// +++++пока закомментируем.!!!!
					Если Филиал <> "SNL" Тогда
						//Делаем перенос на фтп
						СохранитьФайлНаФТП(ФайлЗап, Филиал, ТекПуть);
						ПутиФайлов2.MoveNext();
						//сообщить("1");      
						Продолжить;
					КонецЕсли;
					//!!!!!!!!!!!
					
					Результат33[НомПП][0]=""+ТекПуть;
					Результат33[НомПП][1]=""+ИДНТ;                  
					Результат33[НомПП][2]=""+ТипДок;                  
					НомПП=НомПП+1;
					
					// делаем  копию для архива
					Поиск=Найти(ТекПуть,"\"+ТипДок);
					Если Поиск>0 Тогда
						фф=новый файл(ФайлЗап.Путь+"ARHIV\");
						если НЕ фф.Существует() тогда
							попытка
								создатькаталог(ФайлЗап.Путь+"ARHIV\");
							исключение
								#Если клиент тогда
									сообщить(тФайл.Путь);
								#конецесли	
							конецпопытки;
						конецесли;	
						ИмяДляЗаписи=ФайлЗап.Путь+"ARHIV\"+ФайлЗап.Имя;
						Попытка
							КопироватьФайл(ТекПуть,ИмяДляЗаписи);
						Исключение
						КонецПопытки;	
					КонецЕсли;
				КонецЕсли;
				//Катаев- 24/04/13
			КонецЕсли;
			
		КонецЕсли; 
		
		
		ПутиФайлов2.MoveNext();
		
	КонецЦикла;
	
	Попытка
		SQLiteObject.Close();
		ЗаписатьВЛог("Тестирование екод","База 1 успешно закрыта","Информация"); 
	Исключение
		ЗаписатьВЛог("Тестирование екод","Не удалось закрыть базу 1","Информация");
	КонецПопытки;
	
	
	ЗаписатьВЛог("Тестирование екод","Количество путей файлов: "+КоличествоФайлов,"Информация");
	
	//--------------------------------------------------------------------------------------------------------------------------
	// нечаева для Сфера EDI
	// нечаева 08,09,19+++
	
	// другой путь загрузки данных
	//крохин начало 29.04.2021
	
	//Путь=каталогЕкода+"4607182079990\.config\EcodDb.sqlite3";
	
	Путь=каталогЕкода+"4607182079990WS\.config\EcodDb.sqlite3";
	ПутьКопии = СерверЕкода+"\db_copy\copy2\EcodDb.sqlite3";
	ПутьКаталогаКопии = СерверЕкода+"\db_copy\copy2\";
	Попытка
		УдалитьФайлы(ПутьКаталогаКопии);
		ЗаписатьВЛог("Тестирование екод","База2 успешно удалены файлы из "+ПутьКаталогаКопии,"Информация");
		ФайлыДанных = НайтиФайлы(ПутьКаталогаКопии);
		КоличествоФайловПослеУдаления = 0;
		Для Каждого ФайлДанных Из ФайлыДанных Цикл
			КоличествоФайловПослеУдаления = КоличествоФайловПослеУдаления + 1;
		КонецЦикла;
		ЗаписатьВЛог("Тестирование екод","Количество файлов после удаления "+КоличествоФайловПослеУдаления,"Информация");
		СоздатьКаталог(ПутьКаталогаКопии);
		//КопироватьФайл(Путь,ПутьКопии);
		//ПутьКаталога =  КаталогЕкода+"4607182079990\.config\";
		
		ПутьКаталога =  КаталогЕкода+"4607182079990WS\.config\";
		ФайлыДанных = НайтиФайлы(ПутьКаталога,"*.*");
		Для Каждого ФайлДанных Из ФайлыДанных Цикл
			Если ФайлДанных.ПолноеИмя +"\" <> ПутьКаталога Тогда
				КопироватьФайл(ФайлДанных.ПолноеИмя,ПутьКаталогаКопии+ФайлДанных.Имя);
				ЗаписатьВЛог("Тестирование екод","Успешно скопирован файл "+ФайлДанных.ПолноеИмя + " в "+ПутьКаталогаКопии+ФайлДанных.Имя,"Информация");
			КонецЕсли;
		КонецЦикла;
		
		ЗаписатьВЛог("Тестирование екод","База2 успешно скопирована из "+Путь + " в "+ПутьКопии,"Информация");
	Исключение
		ЗаписатьВЛог("Тестирование екод","Ошибка при копировании база 2 "+ОписаниеОшибки(),"Информация");
	КонецПопытки;
	
	Путь = ПутьКопии; 
	//крохин конец 29.04.2021
	ЗаписатьВЛог("Тестирование екод","Путь номер 2!","Информация");
	
	//---------------------------------
	sqlite_master = SQLiteInit(Путь);
	Если sqlite_master=ложь тогда
		// значит не читается БД
		//возврат;
	КонецЕсли;	
	ппп=1;
	
	
	Дата1 = ТекущаяДата() - 60 * 60 * 24; // - берем + вчерашний день, чтобы ночные заказы прогрузились!!!
	Дата2 = ТекущаяДата() + 60 * 60 * 24;
	// отформатируем дату  Формат('20020820153309', "ДФ=""дд/ММ-гггг"""); 
	
	Дата1 = Формат(Дата1,"ДФ=""гггг-ММ-дд""");
	Дата2 = Формат(Дата2,"ДФ=""гггг-ММ-дд""");
	
	// этот потом как основной использовать.
	ПутиФайлов2 = SQLiteQuery("SELECT files.Id, files.FilePath, files.FileName, FilesStatus.time FROM files, FilesStatus  WHERE  (FilesStatus.Time Between '"+Строка(Дата1)+"' AND '"+Строка(Дата2)+"') and (files.id = FilesStatus.FileId)");
	
	попытка
		Если ПутиФайлов2.EOF Тогда
		КонецЕсли;	
	Исключение
		#Если Клиент Тогда
			сообщить(ОписаниеОшибки());
			
		#КонецЕсли
		ЗаписатьВЛог("Тестирование екод","екод база не прочиталась 5!"+ОписаниеОшибки(),"Информация"); 
		
		
		возврат Результат33;
		
		
	конецПопытки;	
	
	КоличествоФайлов = 0;
	
	Пока НЕ ПутиФайлов2.EOF Цикл
		
		КоличествоФайлов = КоличествоФайлов + 1; 
		
		//ОбработкаПрерыванияПользователя();
		
		Попытка
			time = ПутиФайлов2.Fields(3).value;
		Исключение
			ПутиФайлов2.MoveNext();
			ЗаписатьВЛог("Тестирование екод","екод база не прочиталась 6!"+ОписаниеОшибки(),"Информация"); 
			
		КонецПопытки;	
		
		
		// странный косяк при считывании, считывает через раз.
		Name = ПолучитьЗначениеИзБазыSQl(1, ПутиФайлов2);
		Если Name = неопределено тогда
			Name = ПолучитьЗначениеИзБазыSQl(1, ПутиФайлов2);
		КонецЕсли;	
		
		Name2 = ПолучитьЗначениеИзБазыSQl(2, ПутиФайлов2);
		Если Name2 = неопределено тогда
			Name2 = ПолучитьЗначениеИзБазыSQl(2, ПутиФайлов2);
		КонецЕсли;	
		
		
		// по этим почему то нет таких багов. 
		попытка
			ИДНТ  = ПутиФайлов2.Fields(0).value;
			Name = Прав(Name,СтрДлина(Name)-2);
			time = ПутиФайлов2.Fields(3).value;
		исключение
			#Если клиент Тогда	
				Сообщить("ID/Name: " + ИДНТ + "/" + Name+"/" + Name2+"/"+time+ОписаниеОшибки());
			#КонецЕсли      	
			ПутиФайлов2.MoveNext();
			
		конецПопытки;
		#Если клиент Тогда	
			Сообщить("ID/Name: " + ИДНТ + "/" + Name+"/" + Name2+"/"+time);
		#КонецЕсли      	
		
		//ТекПуть = "\\SRVECODE"+ Name+"\"+Name2;
		ТекПуть = СерверЕкода+ Name+"\"+Name2;
		// DELETE FROM files WHERE StandardCost > 1000.00;
		
		// из имени файла
		НН = Name;
		// 3 первых отсекаем. ГЛН покупателя
		УрезанныйПуть=НайтиПодстроку(НН,4);
		
		ПоискИЛН=Найти(УрезанныйПуть,"\"); 
		ИЛНПок =  Лев(УрезанныйПуть,ПоискИЛН-1);
		
		// ТипДокумента
		НН = Name;
		УрезанныйПуть=НайтиПодстроку(НН,6);
		
		ПоискТипДок=Найти(УрезанныйПуть,"_"); 
		ТипДок =  Лев(УрезанныйПуть,ПоискТипДок-1);
		
		
		Если (ТипДок="ORDER" ИЛИ ТипДок="RECADV"  или ТипДок="ORDERS")  тогда
			
			ФайлЗап=Новый Файл(ТекПуть);		
			Если ФайлЗап.Существует() Тогда
				
				//проверка принадлежности контрагента филиалу.
				Филиал = КонтрагентФилиала(ТекПуть, ТипДок);
				Если Филиал <> Неопределено Тогда
					
					// +++++пока закомментируем.!!!!
					Если Филиал <> "SNL" Тогда
						//Делаем перенос на фтп
						СохранитьФайлНаФТП(ФайлЗап, Филиал, ТекПуть);
						ПутиФайлов2.MoveNext();
						//сообщить("1");      
						Продолжить;
					КонецЕсли;
					//!!!!!!!!!!!
					
					Результат33[НомПП][0]=""+ТекПуть;
					Результат33[НомПП][1]=""+ИДНТ;                  
					Результат33[НомПП][2]=""+ТипДок;                  
					НомПП=НомПП+1;
					
					// делаем  копию для архива
					Поиск=Найти(ТекПуть,"\"+ТипДок);
					Если Поиск>0 Тогда
						фф=новый файл(ФайлЗап.Путь+"ARHIV\");
						если НЕ фф.Существует() тогда
							//создатькаталог(ФайлЗап.Путь+"ARHIV\");
							попытка
								создатькаталог(ФайлЗап.Путь+"ARHIV\");
							исключение
								#Если клиент тогда
									сообщить(тФайл.Путь);
								#конецесли	
							конецпопытки;
							
						конецесли;	
						ИмяДляЗаписи=ФайлЗап.Путь+"ARHIV\"+ФайлЗап.Имя;
						Попытка
							КопироватьФайл(ТекПуть,ИмяДляЗаписи);
						Исключение
						КонецПопытки;	
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли; 
		
		
		ПутиФайлов2.MoveNext();
		
		
	КонецЦикла;
	//нечаева 08,09,19----
	
	Попытка
		SQLiteObject.Close();
		ЗаписатьВЛог("Тестирование екод","База 2 успешно закрыта","Информация"); 
	Исключение
		ЗаписатьВЛог("Тестирование екод","Не удалось закрыть базу 2","Информация");
	КонецПопытки;
	
	
	ЗаписатьВЛог("Тестирование екод","Количество файлов 2"+ КоличествоФайлов,"Информация"); 
	//--------------------------------------------------------------------------------------------------------------------------------------
	
	//--------------------------------------------------------------------------------------------------------------------------
	// нечаева для Сфера EDI  БТК
	// нечаева 19,04,2023+++
	
	КоличествоФайлов = 0;
	Путь=каталогЕкода+"4607196338601WS\.config\EcodDb.sqlite3";
	ПутьКопии = СерверЕкода+"\db_copy\copy2btk\EcodDb.sqlite3";
	ПутьКаталогаКопии = СерверЕкода+"\db_copy\copy2btk\";
	Попытка
		УдалитьФайлы(ПутьКаталогаКопии);
		ЗаписатьВЛог("Тестирование екод","База3 успешно удалены файлы из "+ПутьКаталогаКопии,"Информация");
		ФайлыДанных = НайтиФайлы(ПутьКаталогаКопии);
		КоличествоФайловПослеУдаления = 0;
		Для Каждого ФайлДанных Из ФайлыДанных Цикл
			КоличествоФайловПослеУдаления = КоличествоФайловПослеУдаления + 1;
		КонецЦикла;
		ЗаписатьВЛог("Тестирование екод","Количество файлов после удаления "+КоличествоФайловПослеУдаления,"Информация");
		СоздатьКаталог(ПутьКаталогаКопии);
		
		ПутьКаталога =  КаталогЕкода+"4607196338601WS\.config\";
		ФайлыДанных = НайтиФайлы(ПутьКаталога,"*.*");
		Для Каждого ФайлДанных Из ФайлыДанных Цикл
			Если ФайлДанных.ПолноеИмя +"\" <> ПутьКаталога Тогда
				КопироватьФайл(ФайлДанных.ПолноеИмя,ПутьКаталогаКопии+ФайлДанных.Имя);
				ЗаписатьВЛог("Тестирование екод","Успешно скопирован файл "+ФайлДанных.ПолноеИмя + " в "+ПутьКаталогаКопии+ФайлДанных.Имя,"Информация");
			КонецЕсли;
		КонецЦикла;
		
		ЗаписатьВЛог("Тестирование екод","База3 успешно скопирована из "+Путь + " в "+ПутьКопии,"Информация");
	Исключение
		ЗаписатьВЛог("Тестирование екод","Ошибка при копировании база 3 "+ОписаниеОшибки(),"Информация");
	КонецПопытки;
	
	Путь = ПутьКопии; 
	//крохин конец 29.04.2021
	ЗаписатьВЛог("Тестирование екод","Путь номер 3!","Информация");
	
	//---------------------------------
	sqlite_master = SQLiteInit(Путь);
	Если sqlite_master=ложь тогда
		// значит не читается БД
		//возврат;
	КонецЕсли;	
	ппп=1;
	
	
	Дата1 = ТекущаяДата() - 60 * 60 * 24; // - берем + вчерашний день, чтобы ночные заказы прогрузились!!!
	Дата2 = ТекущаяДата() + 60 * 60 * 24;
	// отформатируем дату  Формат('20020820153309', "ДФ=""дд/ММ-гггг"""); 
	
	Дата1 = Формат(Дата1,"ДФ=""гггг-ММ-дд""");
	Дата2 = Формат(Дата2,"ДФ=""гггг-ММ-дд""");
	
	// этот потом как основной использовать.
	ПутиФайлов2 = SQLiteQuery("SELECT files.Id, files.FilePath, files.FileName, FilesStatus.time FROM files, FilesStatus  WHERE  (FilesStatus.Time Between '"+Строка(Дата1)+"' AND '"+Строка(Дата2)+"') and (files.id = FilesStatus.FileId)");
	
	попытка
		Если ПутиФайлов2.EOF Тогда
		КонецЕсли;	
	Исключение
		#Если Клиент Тогда
			сообщить(ОписаниеОшибки());
			
		#КонецЕсли
		ЗаписатьВЛог("Тестирование екод","екод база не прочиталась 5!"+ОписаниеОшибки(),"Информация"); 
		
		
		возврат Результат33;
		
		
	конецПопытки;	
	
	КоличествоФайлов = 0;
	
	Пока НЕ ПутиФайлов2.EOF Цикл
		
		КоличествоФайлов = КоличествоФайлов + 1; 
		
		//ОбработкаПрерыванияПользователя();
		
		Попытка
			time = ПутиФайлов2.Fields(3).value;
		Исключение
			ПутиФайлов2.MoveNext();
			ЗаписатьВЛог("Тестирование екод","екод база не прочиталась 6!"+ОписаниеОшибки(),"Информация"); 
			
		КонецПопытки;	
		
		
		// странный косяк при считывании, считывает через раз.
		Name = ПолучитьЗначениеИзБазыSQl(1, ПутиФайлов2);
		Если Name = неопределено тогда
			Name = ПолучитьЗначениеИзБазыSQl(1, ПутиФайлов2);
		КонецЕсли;	
		
		Name2 = ПолучитьЗначениеИзБазыSQl(2, ПутиФайлов2);
		Если Name2 = неопределено тогда
			Name2 = ПолучитьЗначениеИзБазыSQl(2, ПутиФайлов2);
		КонецЕсли;	
		
		
		// по этим почему то нет таких багов. 
		попытка
			ИДНТ  = ПутиФайлов2.Fields(0).value;
			Name = Прав(Name,СтрДлина(Name)-2);
			time = ПутиФайлов2.Fields(3).value;
		исключение
			#Если клиент Тогда	
				Сообщить("ID/Name: " + ИДНТ + "/" + Name+"/" + Name2+"/"+time+ОписаниеОшибки());
			#КонецЕсли      	
			ПутиФайлов2.MoveNext();
			
		конецПопытки;
		#Если клиент Тогда	
			Сообщить("ID/Name: " + ИДНТ + "/" + Name+"/" + Name2+"/"+time);
		#КонецЕсли      	
		
		//ТекПуть = "\\SRVECODE"+ Name+"\"+Name2;
		ТекПуть = СерверЕкода+ Name+"\"+Name2;
		// DELETE FROM files WHERE StandardCost > 1000.00;
		
		// из имени файла
		НН = Name;
		// 3 первых отсекаем. ГЛН покупателя
		УрезанныйПуть=НайтиПодстроку(НН,4);
		
		ПоискИЛН=Найти(УрезанныйПуть,"\"); 
		ИЛНПок =  Лев(УрезанныйПуть,ПоискИЛН-1);
		
		// ТипДокумента
		НН = Name;
		УрезанныйПуть=НайтиПодстроку(НН,6);
		
		ПоискТипДок=Найти(УрезанныйПуть,"_"); 
		ТипДок =  Лев(УрезанныйПуть,ПоискТипДок-1);
		
		
		Если (ТипДок="ORDER" ИЛИ ТипДок="RECADV"  или ТипДок="ORDERS")  тогда
			
			ФайлЗап=Новый Файл(ТекПуть);		
			Если ФайлЗап.Существует() Тогда
				
				//проверка принадлежности контрагента филиалу.
				Филиал = КонтрагентФилиала(ТекПуть, ТипДок);
				Если Филиал <> Неопределено Тогда
					
					// +++++пока закомментируем.!!!!
					Если Филиал <> "SNL" Тогда
						//Делаем перенос на фтп
						СохранитьФайлНаФТП(ФайлЗап, Филиал, ТекПуть);
						ПутиФайлов2.MoveNext();
						//сообщить("1");      
						Продолжить;
					КонецЕсли;
					//!!!!!!!!!!!
					
					Результат33[НомПП][0]=""+ТекПуть;
					Результат33[НомПП][1]=""+ИДНТ;                  
					Результат33[НомПП][2]=""+ТипДок;                  
					НомПП=НомПП+1;
					
					// делаем  копию для архива
					Поиск=Найти(ТекПуть,"\"+ТипДок);
					Если Поиск>0 Тогда
						фф=новый файл(ФайлЗап.Путь+"ARHIV\");
						если НЕ фф.Существует() тогда
							//создатькаталог(ФайлЗап.Путь+"ARHIV\");
							попытка
								создатькаталог(ФайлЗап.Путь+"ARHIV\");
							исключение
								#Если клиент тогда
									сообщить(тФайл.Путь);
								#конецесли	
							конецпопытки;
							
						конецесли;	
						ИмяДляЗаписи=ФайлЗап.Путь+"ARHIV\"+ФайлЗап.Имя;
						Попытка
							КопироватьФайл(ТекПуть,ИмяДляЗаписи);
						Исключение
						КонецПопытки;	
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли; 
		
		
		ПутиФайлов2.MoveNext();
		
		
	КонецЦикла;
	//нечаева 08,09,19----
	
	Попытка
		SQLiteObject.Close();
		ЗаписатьВЛог("Тестирование екод","База 3 успешно закрыта","Информация"); 
	Исключение
		ЗаписатьВЛог("Тестирование екод","Не удалось закрыть базу 3","Информация");
	КонецПопытки;
	
	
	ЗаписатьВЛог("Тестирование екод","Количество файлов 3"+ КоличествоФайлов,"Информация"); 
	
	
	
	
	Возврат Результат33;	
	
КонецФункции

//Нечаева 07,02,18 ---





//---------------------------------------------------
//нечаева 11,04,17 +++
Функция ПроверитьПаллетыПоДокументу(Накладная)
	
	Отказ = ложь;
	
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ПаллетаЛистыНабора.Ссылка КАК Паллета,
	|	ПаллетаЛистыНабора.Описание КАК НомерКоробки,
	|	ПаллетаЛистыНабора.Ссылка.ОкончаниеПаллетирования КАК ОкончаниеПаллетирования
	|ИЗ
	|	Документ.Паллета.ЛистыНабора КАК ПаллетаЛистыНабора
	|ГДЕ
	|	ПаллетаЛистыНабора.Ссылка.Проведен
	|	И ПаллетаЛистыНабора.Документ.ссылка = &Документ
	|	И ПаллетаЛистыНабора.Ссылка.ОкончаниеПаллетирования <> &ОкончаниеПаллетирования";
	запрос.УстановитьПараметр("Документ", Накладная.ссылка);
	запрос.УстановитьПараметр("ОкончаниеПаллетирования",ПустаяДата());
	
	результат=запрос.Выполнить().Выгрузить();
	
	
	ОбИКол=ПолучитьКоличествоИОбъемКоробовИзРегистра(Накладная);
	если ОбИКол<>Неопределено тогда
		КоличествоКоробок=ОбИКол.КоличествоКоробок;			
	иначе
		КоличествоКоробок=Накладная.КоличествоКоробок
	КонецЕсли;
	
	для сч=1 по КоличествоКоробок цикл
		СтруктураПоиска=новый Структура;
		СтруктураПоиска.Вставить("НомерКоробки",Строка(сч));
		МассивКоробок=результат.НайтиСтроки(СтруктураПоиска);
		
		если МассивКоробок.Количество()=0 тогда
			#если клиент тогда
				сообщить("Не найдена в паллетах коробка № "+Строка(сч));
				КритичОшибкиЛента.Добавить("Не найдена в паллетах коробка № "+Строка(сч));
			#КонецЕсли
			Отказ = истина;
		ИначеЕсли МассивКоробок.Количество()>1 тогда
			СписокПаллет="";
			Для каждого СтрМасс из МассивКоробок Цикл 
				СписокПаллет=СписокПаллет+СтрМасс.Паллета.Номер+"  ";
				
			КонецЦикла;
			#если клиент тогда
				сообщить("Коробка № "+Строка(сч)+" отсканирована несколько раз в паллеты "+СписокПаллет);
				КритичОшибкиЛента.Добавить("Коробка № "+Строка(сч)+" отсканирована несколько раз в паллеты "+СписокПаллет);
			#КонецЕсли
			
			Отказ = истина;
		КонецЕсли;
	КонецЦикла;
	
	возврат отказ;
	
КонецФункции
//нечаева 11,04,17 ---


//Катаев+ 03/04/13
Процедура ПроверитьФайлыНаФТП()
	Запрос = Новый Запрос;
	ЗапросДок = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегистрФайловЕКОД.ПолноеИмяФайла,
	|	РегистрФайловЕКОД.НомерЗаказа,
	|	РегистрФайловЕКОД.ДатаЗаказа,
	|	РегистрФайловЕКОД.Узел
	|ИЗ
	|	РегистрСведений.РегистрФайловЕКОД КАК РегистрФайловЕКОД
	|ГДЕ
	|	РегистрФайловЕКОД.Документ_Создан = ЛОЖЬ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		// Находим документ по номеру и дате заказа
		Если Найти(Выборка.ПолноеИмяФайла, "ORDER") > 0 Тогда
			ЗапросДок.Текст =
			"ВЫБРАТЬ
			|	РасходнаяНакладная.Ссылка
			|ИЗ
			|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
			|ГДЕ
			|	РасходнаяНакладная.НомерЗаказа = &НомерЗаказа
			|	И РасходнаяНакладная.ДатаЗаказа = &ДатаЗаказа
			|	И РасходнаяНакладная.Склад.Подразделение = &Подразделение";
			поз = Найти(Выборка.ПолноеИмяФайла, "ORDER");
		Иначе
			ЗапросДок.Текст =
			"ВЫБРАТЬ
			|	АктПриемки.Ссылка
			|ИЗ
			|	Документ.АктПриемки КАК АктПриемки
			|ГДЕ
			|	АктПриемки.НомерЗаказа = &НомерЗаказа
			|	И АктПриемки.ДатаЗаказа = &ДатаЗаказа
			|	И АктПриемки.РНК.Склад.Подразделение = &Подразделение";
			поз = Найти(Выборка.ПолноеИмяФайла, "RECADV");
		КонецЕсли;
		ЗапросДок.УстановитьПараметр("НомерЗаказа", Выборка.НомерЗаказа);
		ЗапросДок.УстановитьПараметр("ДатаЗаказа", Выборка.ДатаЗаказа); 
		ЗапросДок.УстановитьПараметр("Подразделение", Выборка.Узел.Подразделение);
		ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
		Если ВыборкаДок.Количество() > 0 Тогда
			ПутьКФайлу = Лев(Выборка.ПолноеИмяФайла, поз-1);
			ИмяФайла = СтрЗаменить(Выборка.ПолноеИмяФайла, ПутьКФайлу, "");
			//Катаев+ 26/06/13 Добавил проверку на наличие слеша. Если он есть то оставляем только то что после него находится.
			поз = Найти(ИмяФайла,"\");
			Если поз > 0 Тогда
				ИмяФайла = Прав(ИмяФайла,стрДлина(имяФайла)-поз);
			КонецЕсли;
			//Катаев- 26/06/13
			
			//нечаева 23,05,17+++
			ПутьКФТП = "\\srvftp\ftp_1c$\snl\ecod\"+Выборка.Узел.Код+"\";
			//нечаева 23,05,17---
			
			// Удаляем файл с фтп
			//Катаев+ 14/07/14 На фтп из имени файла убраны русские буквы
			//УдалитьФайлы(ПутьКФТП, ИмяФайла);
			ИмяФайлаНаФТП = УбратьРБ(ИмяФайла);
			УдалитьФайлы(ПутьКФТП, ИмяФайлаНаФТП);
			//Катаев- 14/07/14
			// Переносим файл из папки ЕКОД в архив
			фф = новый файл(ПутьКФайлу+"ARHIV\");
			Если НЕ фф.Существует() Тогда
				//создатькаталог(ПутьКФайлу+"ARHIV\");
				попытка
					создатькаталог(ПутьКФайлу+"ARHIV\");
				исключение
					#Если клиент тогда
						сообщить(" +++++++++++++++++"+ПутьКФайлу);
					#конецесли	
				конецпопытки;
				
			КонецЕсли;	
			ИмяДляЗаписи=ПутьКФайлу+"ARHIV\"+ИмяФайла;
			Попытка
				КопироватьФайл(Выборка.ПолноеИмяФайла,ИмяДляЗаписи);
			Исключение
			КонецПопытки;	
			// Отмечаем в регистре сведений что документ создан, что бы впоследсвии не проверять его
			рег = РегистрыСведений.РегистрФайловЕКОД;
			Отбор = Новый Структура("ПолноеИмяФайла");
			Отбор.ПолноеИмяФайла = Выборка.ПолноеИмяФайла;
			ВыборкаРег = рег.Выбрать(Отбор,"Возр");
			Если ВыборкаРег.Следующий() Тогда
				СтрокаРег = ВыборкаРег.ПолучитьМенеджерЗаписи();
				СтрокаРег.Прочитать();
				СтрокаРег.Документ_Создан = Истина;
				СтрокаРег.Записать(Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПереносФайловНаФТП()
	Путь = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИЛН_Организации.Наименование,
	|	ИЛН_Организации.Узел
	|ИЗ
	|	Справочник.ИЛН_Организации КАК ИЛН_Организации
	|ГДЕ
	|	ИЛН_Организации.ПометкаУдаления = ЛОЖЬ
	|	И ИЛН_Организации.Узел <> &Узел";
	Запрос.УстановитьПараметр("Узел",ПланыОбмена.Основной.ЭтотУзел());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Путь1 = Константы.КаталогЕКОД.Получить()+Выборка.Наименование+"\.config\filebase.xml";
		Файл = Новый ЧтениеXML;
		Попытка                              
			Файл.ОткрытьФайл(Путь1);
		Исключение
			Продолжить;
		КонецПопытки;
		Пока Файл.Прочитать() Цикл
			Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Файл.ЛокальноеИмя = "doc_type" Тогда
				файл.Прочитать();
				ТипДок = Файл.Значение;
			КонецЕсли;
			
			Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Файл.ЛокальноеИмя = "file_path" Тогда
				файл.Прочитать(); 
				ТекПуть = Файл.Значение;
				//заменяем c:\ediConnector2\ediEcod\
				Нов=Прав(ТекПуть,СтрДлина(ТекПуть)-25);
				Нов=Константы.КаталогЕКОД.Получить()+Нов;
				ТекПуть=Нов;
			КонецЕсли;
			
			Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Файл.ЛокальноеИмя = "partner" и (ТипДок="ORDER" ИЛИ ТипДок="RECADV") Тогда
				ФайлКоп = Новый Файл(ТекПуть);
				//Катаев+ 24/04/13 для удобства сделал отдельную процедуру
				СохранитьФайлНаФТП(ФайлКоп, Выборка.Узел.Код, ТекПуть)
				//Катаев- 24/04/13
			Конецесли;
		КонецЦикла;
		Файл.Закрыть();
	КонецЦикла;
КонецПроцедуры

Процедура ПереносФайловСФТП(ТекущийУзел)
	Узел = ПланыОбмена.Основной.НайтиПоКоду("SNL");
	Соединение=УстановитьFTPСоединение(Узел.АдресОбмена,Узел.Пользователь,Узел.Пароль,,Узел.ПассивныйРежим);
	Попытка
		//нечаева 23,05,17+++
		Файлы = Соединение.НайтиФайлы("/SNL/ECod/"+ТекущийУзел.Код+"/","*.*");
		//нечаева 23,05,17---
	Исключение
		//сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	Для Каждого Файл Из Файлы Цикл
		ИмяФайлаСообщения = Файл.ПолноеИмя;
		ИмяФайлаФилиала = Константы.КаталогЕКОД.Получить()+Файл.Имя;
		// Проверяем  копировали уже файл или нет
		Запрос1 = Новый Запрос;
		Запрос1.Текст =
		"ВЫБРАТЬ
		|	РегистрФайловЕКОД.ПолноеИмяФайла,
		|	РегистрФайловЕКОД.Документ_Создан
		|ИЗ
		|	РегистрСведений.РегистрФайловЕКОД КАК РегистрФайловЕКОД
		|ГДЕ
		|	РегистрФайловЕКОД.ПолноеИмяФайла ПОДОБНО &ПолноеИмяФайла";
		Запрос1.УстановитьПараметр("ПолноеИмяФайла", ИмяФайлаФилиала);
		Выборка1 = Запрос1.Выполнить().Выбрать();
		Если Выборка1.Количество() = 0 Тогда
			Соединение.Получить(ИмяФайлаСообщения, ИмяФайлаФилиала);
			РазмерОригинал = Файл.Размер();
			ФайлФилиала = Новый Файл(ИмяФайлаФилиала);
			РазмерФилиал = ФайлФилиала.Размер();
			Если РазмерФилиал = РазмерОригинал Тогда
				Запись=РегистрыСведений.РегистрФайловЕКОД.СоздатьМенеджерЗаписи();
				Запись.Дата = ТекущаяДата();
				Запись.ПолноеИмяФайла = ИмяФайлаФилиала;
				Запись.Узел = ПланыОбмена.Основной.ЭтотУзел();
				Запись.Документ_Создан = Ложь;
				Запись.Записать(Ложь);
			Иначе	
				УдалитьФайлы(ФайлФилиала.Путь, ФайлФилиала.Имя);
			КонецЕсли;
		Конецесли;
	КонецЦикла;
КонецПроцедуры

Функция СформироватьПутиФайловФилиала()
	ТекПуть = Константы.КаталогЕКОД.Получить();
	Результат33 = Новый Массив(10000,3);
	//Катаев+ 28/06/13
	//Файлы = НайтиФайлы(ТекПуть,"*.*");
	Файлы = НайтиФайлы(ТекПуть,"*.xml");
	//Катаев- 28/06/13
	номПП = 1;
	Для каждого Файл из Файлы Цикл
		Если Файл.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		Если Найти(Файл.Имя, "ORDER") <> 0 Тогда
			ТипДок = "ORDER";
		Иначе
			ТипДок = "RECADV";
		КонецЕсли;
		Результат33[НомПП][0]=Файл.ПолноеИмя;
		Результат33[НомПП][1]="";                  
		Результат33[НомПП][2]=ТипДок;                  
		НомПП=НомПП+1;
		фф = новый файл(ТекПуть+"ARHIV\");
		Если НЕ фф.Существует() Тогда
			//создатькаталог(ТекПуть+"ARHIV\");
			попытка
				создатькаталог(ТекПуть+"ARHIV\");
			исключение
				#Если клиент тогда
					сообщить("++++++++++++++++++++++"+ТекПуть);
				#конецесли	
			конецпопытки;
			
		КонецЕсли;	
		ИмяДляЗаписи=ТекПуть+"ARHIV\"+Файл.Имя;
		Попытка
			КопироватьФайл(Файл.ПолноеИмя,ИмяДляЗаписи);
		Исключение
		КонецПопытки;	
	КонецЦикла;
	Возврат Результат33;
КонецФункции
//Катаев- 03/04/13

//Катаев+ 24/04/13
Процедура СохранитьФайлНаФТП(ФайлКоп, Филиал, ТекПуть)
	Если ФайлКоп.Существует() Тогда
		Запрос1 = Новый Запрос;
		Запрос1.Текст =
		"ВЫБРАТЬ
		|	РегистрФайловЕКОД.ПолноеИмяФайла,
		|	РегистрФайловЕКОД.Документ_Создан
		|ИЗ
		|	РегистрСведений.РегистрФайловЕКОД КАК РегистрФайловЕКОД
		|ГДЕ
		|	РегистрФайловЕКОД.ПолноеИмяФайла ПОДОБНО &ПолноеИмяФайла";
		Запрос1.УстановитьПараметр("ПолноеИмяФайла", ТекПуть);
		Выборка1 = Запрос1.Выполнить().Выбрать();
		Если Выборка1.Количество() = 0 Тогда
			// считываем номер и дату заказа
			ФайлЕКОД = Новый ЧтениеXML;
			ФайлЕКОД.ОткрытьФайл(ТекПуть);
			НомерЗаказа = "";
			ДатаЗаказа = Дата(1,1,1);
			Пока ФайлЕКОД.Прочитать() Цикл
				Если ФайлЕКОД.ТипУзла = ТипУзлаXML.НачалоЭлемента И (ФайлЕКОД.ЛокальноеИмя = "OrderNumber" или ФайлЕКОД.ЛокальноеИмя = "BuyerOrderNumber") Тогда
					ФайлЕКОД.Прочитать();
					НомерЗаказа = ФайлЕКОД.Значение;
				КонецЕсли;
				Если ФайлЕКОД.ТипУзла = ТипУзлаXML.НачалоЭлемента И (ФайлЕКОД.ЛокальноеИмя = "OrderDate" или ФайлЕКОД.ЛокальноеИмя ="BuyerOrderDate") Тогда
					ФайлЕКОД.Прочитать();
					ДатаЗаказа = Дата(СтрЗаменить(ФайлЕКОД.Значение,"-",""));
				КонецЕсли;
			КонецЦикла;
			ФайлЕКОД.Закрыть();        // \\srvftp\ftp_1c$\snl\ecod\
			//нечаева 23,05,17+++ новый путь
			//ПутьФТП = "\\srvftp\ftp_1c$\snl\ecod\"+Филиал+"\";
			//нечаева 20,09,23+++
			//ПутьФТП = "\\srvbase-ekf\1C_Base\E-COD\";
			ПутьФТП = "\\srv1c-ekf\E-COD\";
			//нечаева 20,09,23---
			Каталог = Новый Файл(ПутьФТП);
			Если Не Каталог.Существует() Тогда
				попытка
					создатькаталог(ПутьФТП);
				исключение
					#Если клиент тогда
						сообщить(ПутьФТП);
					#конецесли	
				конецпопытки;
				
				//	СоздатьКаталог(ПутьФТП);
			КонецЕсли;
			//Катаев+ 08/11/13 из имени файла убираем русские буквы
			//ИмяДляЗаписи = ПутьФТП+файлКоп.Имя;
			ИмяДляЗаписи = ПутьФТП+УбратьРБ(файлКоп.Имя);
			//Катаев- 08/11/13
			ФайлНов = Новый Файл(ИмяДляЗаписи);
			попытка
				КопироватьФайл(ФайлКоп.ПолноеИмя,ИмяДляЗаписи);  // на сервер екатеренбурга не кпируем, если нет доступа
				Если ФайлНов.Размер() = ФайлКоп.Размер() Тогда
					// Производим пометку что файл успешно загружен на фтп, что бы избежать повторной загрузки
					Запись=РегистрыСведений.РегистрФайловЕКОД.СоздатьМенеджерЗаписи();
					Запись.Дата = ТекущаяДата();
					Запись.ПолноеИмяФайла = ТекПуть;
					Запись.Узел = ПланыОбмена.Основной.НайтиПоКоду(Филиал);
					Запись.Документ_Создан = Ложь;
					Запись.ДатаЗаказа = ДатаЗаказа;
					Запись.НомерЗаказа = НомерЗаказа;
					Запись.Записать();
				Иначе
					УдалитьФайлы(ФайлНов.Путь, ФайлНов.Имя);
				КонецЕсли;
			исключение
			конецпопытки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
//Катаев- 24/04/13

//Катаев+ 08/11/13
Функция УбратьРБ(ИмяФайла)
	результат = ИмяФайла;
	Для код = 1040 По 1103 Цикл
		результат = стрЗаменить(результат, Символ(код),"_");
	КонецЦикла;
	Возврат результат;
КонецФункции
//Катаев- 08/11/13

//нечаева 09,03,23+++
функция ДокументПрописан(Док,состояние)
	
	ДокументПрописан= ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СостояниеЭлектронногоУПД.СостояниеУПД КАК СостояниеУПД,
	|	СостояниеЭлектронногоУПД.Дата КАК Дата
	|ИЗ
	|	РегистрСведений.СостояниеЭлектронногоУПД КАК СостояниеЭлектронногоУПД
	|ГДЕ
	|	СостояниеЭлектронногоУПД.Объект = &текдок
	|	И СостояниеЭлектронногоУПД.СостояниеУПД = &тексост";
	Запрос.УстановитьПараметр("ТекДок", Док.ссылка);
	Запрос.УстановитьПараметр("Тексост", состояние);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество()>0 Тогда
		
		ДокументПрописан = истина;
	КонецЕсли;   
	
	возврат ДокументПрописан;
	
	
КонецФункции	
//нечаева 09,03,23---


//Катаев+ 29/03/13
Функция НайтиСклад(Номенклатура)
	УровеньН = номенклатура.Уровень();
	Группа = Номенклатура.Родитель;
	Пока Группа.СкладОтгрузкиКБ = Справочники.Склады.ПустаяСсылка() И УровеньН > 1 Цикл
		Группа = Группа.Родитель;
		УровеньН = УровеньН - 1;
	КонецЦикла;
	Возврат Группа.СкладОтгрузкиКБ;
КонецФункции

Функция НайтиКодГруппыНоменклатуры(Номенклатура, ВыбУровень = 1)
	УровеньН = номенклатура.Уровень();
	Группа = Номенклатура.Родитель;
	Пока УровеньН > ВыбУровень Цикл
		Группа = Группа.Родитель;
		УровеньН = УровеньН - 1;
	КонецЦикла;
	Возврат Группа.код;
КонецФункции
//Катаев- 29/03/13

//Катаев+ 24/04/13
Функция КонтрагентФилиала(ТекПуть, ТипДок)
	Файл = Новый ЧтениеXML;
	Попытка                              
		Файл.ОткрытьФайл(ТекПуть);
	Исключение
		Возврат "SNL";
	КонецПопытки;
	Пока Файл.Прочитать() Цикл
		Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Файл.ЛокальноеИмя = "Buyer" тогда
			// ИЛН контрагента
			Пока НЕ (Файл.ТипУзла = ТипУзлаXML.КонецЭлемента И Файл.ЛокальноеИмя = "Buyer") цикл
				файл.Прочитать(); 
				Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Файл.ЛокальноеИмя = "ILN" тогда
					файл.Прочитать(); 
					ИЛНКонтрагента=Файл.Значение;
					прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Файл.ЛокальноеИмя = "DeliveryPoint" тогда
			// ИЛН пункта доставки
			Пока НЕ (Файл.ТипУзла = ТипУзлаXML.КонецЭлемента И Файл.ЛокальноеИмя = "DeliveryPoint") цикл
				файл.Прочитать(); 
				Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Файл.ЛокальноеИмя = "ILN" тогда
					файл.Прочитать(); 
					ИЛНПунктаДоставки=Файл.Значение;
					прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Файл.Закрыть();
	Контрагент = НайтиКонтрагента(ИЛНКонтрагента, ИЛНПунктаДоставки);
	Если Контрагент = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		
		//нечаева 28,01,16 +++ "ООО Молл" грузим с ЦО
		если Контрагент.код = "CHF-0006" Тогда
			Филиал = "SNL";
			Возврат Филиал;
		КонецЕсли;
		//нечаева 28,01,16 +++
		
		
		//нечаева 22,09,17 +++ "Бьюти Лайф ООО" грузим с ЦО
		если Контрагент.родитель.код = "EKF-0488" Тогда   // EKF-0488   "EKF-0735"
			Филиал = "SNL";
			Возврат Филиал;
		КонецЕсли;
		//нечаева 22,09,17 ---
		
		//нечаева 22,08,22 +++ "элемент трейд" грузим с ЦО
		если Контрагент.код = "EKF-0100" Тогда
			Филиал = "SNL";
			Возврат Филиал;
		КонецЕсли;
		//нечаева 22,08,22 ---
		
		
		
		// определяем к какому узлу он относится
		// Катаев+ 07/05/13 определяем узел по пункту доставки, если определить не получится, то определяем по контрагенту
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПунктыДоставки.УзелДоставки
		|ИЗ
		|	Справочник.ПунктыДоставки КАК ПунктыДоставки
		|ГДЕ
		|	ПунктыДоставки.КодИЛН = &КодИЛН";
		Запрос.УстановитьПараметр("КодИЛН", ИЛНПунктаДоставки);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Не ПустаяСтрока(Выборка.УзелДоставки) тогда
				Возврат Выборка.УзелДоставки.Код;
			КонецЕсли;
		КонецЕсли;
		// Катаев- 07/05/13
		
		Группа = Контрагент.Родитель;
		Филиал = "SNL";
		попытка
			//сообщить();
			Пока Группа.Уровень() > 1 Цикл
				Если Группа.РегиональныеУзлы.Количество() = 0 Тогда
					Группа = Группа.Родитель;
				Иначе
					тз = Группа.РегиональныеУзлы.Выгрузить();
					Если тз.Количество() = 1 Тогда
						Филиал = тз[0].КодУзла;
					Иначе
						Филиал = "SNL";
					КонецЕсли;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		исключение
			//Сообщить("-- "+Группа); 
			//сообщить("---"+Контрагент);
			Филиал = "SNL";
			
		конецПопытки;
		Возврат Филиал;
	КонецЕсли;
КонецФункции
//Катаев- 24/04/13

Функция НайтиКонтрагента(ИЛНКонтрагента, ИЛНПунктаДоставки)
	Запрос = Новый Запрос;
	//Катаев+ 29/10/14 В запрос добавлена проверка на то что это не группа.
	Запрос.Текст=
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.КодИЛН = &КодИЛН
	|	И Контрагенты.ЭтоГруппа = ЛОЖЬ";
	//Катаев- 29/10/14
	Запрос.УстановитьПараметр("КодИЛН", ИЛНКонтрагента);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	иначе	
		
		//добавим тут поиск для ашана по точке активности
		
		//нечаева 24,03,16 ++	
		ТЗГЛН = новый ТаблицаЗначений;
		МакетГЛН =	ЭтотОбъект.ПолучитьМакет("GLNАктивностиАшана");
		МакетВТаблицуЗначений(МакетГЛН, ТЗГЛН, истина); 
		// для ашана смотрим еще и файлик!
		//ищем в макете если есть, то это Ашан
		ЕстьДляАшана =  ТЗГЛН.Найти(СокрЛП(ИЛНКонтрагента),"GLNPok");
		Если ЕстьДляАшана<>неопределено Тогда
			Контрагент=справочники.Контрагенты.НайтиПоКоду("SSP-2450");
			Возврат Контрагент;
		КонецЕсли;
		
	КонецЕсли;
	//24,03,16---
	
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПунктыДоставки.Владелец
	|ИЗ
	|	Справочник.ПунктыДоставки КАК ПунктыДоставки
	|ГДЕ
	|	ПунктыДоставки.КодИЛН = &КодИЛН
	|	И ПунктыДоставки.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("КодИЛН", ИЛНПунктаДоставки);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Владелец;
	Иначе
		// сделать поиск по табличной части ПД и GLN
		///24,03,016++ нечаева
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПунктыДоставкиИЛН.Ссылка.Владелец КАК владелец
		|ИЗ
		|	Справочник.ПунктыДоставки.ИЛН КАК ПунктыДоставкиИЛН
		|ГДЕ
		|	ПунктыДоставкиИЛН.КодИЛН = &КодИЛН
		|	И ПунктыДоставкиИЛН.Ссылка.ПометкаУдаления = ложь";
		Запрос.УстановитьПараметр("КодИЛН", ИЛНПунктаДоставки);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Владелец;
		Иначе
			//не нашли совсем!!!
			Строка="Контрагент с кодом ИЛН = "+ИЛНКонтрагента+" и ИЛН пункта доставки = "+ИЛНПунктаДоставки+" не обнаружен";
			Ошибки.Добавить(Строка);
			Возврат Неопределено;
		КонецЕсли;
		///24,03,016-- нечаева
	КонецЕсли;
	
КонецФункции

Функция НайтиПунктДоставкиПоГЛН(ИЛНПунктаДоставки)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПунктыДоставки.Ссылка
	|ИЗ
	|	Справочник.ПунктыДоставки КАК ПунктыДоставки
	|ГДЕ
	|	ПунктыДоставки.КодИЛН = &КодИЛН
	|	И ПунктыДоставки.ПометкаУдаления = ЛОЖЬ"; // Катаев+ 17/04/13 Добавил проверку на пометку удаления.
	Запрос.УстановитьПараметр("КодИЛН", ИЛНПунктаДоставки);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		///24,03,016++ нечаева
		//	// сделать поиск по табличной части ПД и GLN  ? пока не надо
		//	
		//	Запрос.Текст =
		//	"ВЫБРАТЬ
		//	|	ПунктыДоставкиИЛН.Ссылка.Владелец  как владелец
		//	|ИЗ
		//	|	Справочник.ПунктыДоставки.ИЛН КАК ПунктыДоставкиИЛН
		//	|ГДЕ
		//	|	ПунктыДоставкиИЛН.КодИЛН = &КодИЛН
		//	|	И ПунктыДоставкиИЛН.ПометкаУдаления = ЛОЖЬ";
		//	Запрос.УстановитьПараметр("КодИЛН", ИЛНПунктаДоставки);
		//	Выборка = Запрос.Выполнить().Выбрать();
		//	Если Выборка.Следующий() Тогда
		//		Возврат Выборка.Владелец;
		//	Иначе
		//		//не нашли совсем!!!
		//		Строка="Контрагент с кодом ИЛН = "+ИЛНКонтрагента+" и ИЛН пункта доставки = "+ИЛНПунктаДоставки+" не обнаружен";
		//		Ошибки.Добавить(Строка);
		//		Возврат Неопределено;
		//	КонецЕсли;
		// ///24,03,016-- нечаева
		
		//	
		Строка="ИЛН пункта доставки = "+ИЛНПунктаДоставки+" не обнаружен";
		Ошибки.Добавить(Строка);
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

// Катаев+ 22/03/13 Функция поиска РНК переделана кардинально
Функция НайтиРНКСт(стрШапка)
	Запрос = Новый Запрос;
	сз = Новый СписокЗначений;
	//Катаев+ 28/05/14 Уведомления приходят от других пунктов доставки. Отключаем проверку на пункт доставки
	////Катаев+ 19/06/13 В уведомлении может не быть указан Пункт доставки
	//Если ПустаяСтрока(стрШапка.ПунктДоставки) Тогда
	//	Запрос.УстановитьПараметр("ВыборПунктДоставки", Ложь);
	//Иначе
	//	Запрос.УстановитьПараметр("ВыборПунктДоставки", Истина);
	//КонецЕсли;
	//Катаев- 19/06/13
	Запрос.УстановитьПараметр("ВыборПунктДоставки", Ложь);
	//Катаев- 28/05/14
	Запрос.УстановитьПараметр("ПунктДоставки", стрШапка.ПунктДоставки);
	Запрос.УстановитьПараметр("Контрагент", стрШапка.Контрагент);
	
	//нечаева 12,12,16+++
	Запрос.УстановитьПараметр("Номер", стрШапка.НомерРНК);
	//нечаева 12,12,16---
	
	// Пробуем определить по Дате и Номеру РНК
	Если стрШапка.НомерРНК <> Неопределено Тогда
		Если стрШапка.ДатаРНК = Неопределено Тогда
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РасходнаяНакладная.Ссылка
			|ИЗ
			|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
			|ГДЕ
			|	РасходнаяНакладная.Номер = &Номер
			|	И РасходнаяНакладная.Дата >= &Дата
			//Катаев+ 19/06/13
			//|	И РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
			|	И ВЫБОР
			|			КОГДА &ВыборПунктДоставки
			|				ТОГДА РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			//Катаев- 19/06/13
			|	И РасходнаяНакладная.Контрагент = &Контрагент
			|	И РасходнаяНакладная.Проведен";
			Запрос.УстановитьПараметр("Дата", стрШапка.ДатаПриемаТовара-86400*30);
		Иначе
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РасходнаяНакладная.Ссылка
			|ИЗ
			|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
			|ГДЕ
			|	РасходнаяНакладная.Номер = &Номер
			//Катаев+ 01/04/13
			//|	И РасходнаяНакладная.Дата = &Дата
			|	И НАЧАЛОПЕРИОДА(РасходнаяНакладная.Дата, ДЕНЬ) = &Дата
			//Катаев- 01/04/13
			//Катаев+ 19/06/13
			//|	И РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
			|	И ВЫБОР
			|			КОГДА &ВыборПунктДоставки
			|				ТОГДА РасходнаяНакладная.ПунктДоставки >= &ПунктДоставки
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			//Катаев- 19/06/13
			|	И РасходнаяНакладная.Контрагент = &Контрагент
			|	И РасходнаяНакладная.Проведен";
			//Катаев+ 01/04/13
			ДатаРНК = Дата(СтрЗаменить(стрШапка.ДатаРНК,"-",""));
			//нечаева 19.07.17++
			Запрос.УстановитьПараметр("Дата", НачалоДня(ДатаРНК)-86400*30);
			//нечаева 19,07,17---
			//Катаев- 01/04/13
		КонецЕсли;
		Запрос.УстановитьПараметр("Номер", стрШапка.НомерРНК);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			сз.Добавить(Выборка.Ссылка)
		КонецЦикла;
		Если сз.Количество() <> 0 Тогда
			Возврат сз;
		КонецЕсли;
	КонецЕсли;
	// Пробуем определить по Дате, Номеру заказа и адресу доставки;
	//Катаев+ 28/05/14 А здесь включаем
	Если ПустаяСтрока(стрШапка.ПунктДоставки) Тогда
		Запрос.УстановитьПараметр("ВыборПунктДоставки", Ложь);
	Иначе
		Запрос.УстановитьПараметр("ВыборПунктДоставки", Истина);
	КонецЕсли;
	//Катаев- 28/05/14
	Если стрШапка.ДатаЗаказа = Неопределено Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.НомерЗаказа = &Номер
		|	И РасходнаяНакладная.ДатаЗаказа >= &Дата
		//Катаев+ 19/06/13
		//|	И РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
		|	И ВЫБОР
		|			КОГДА &ВыборПунктДоставки
		|				ТОГДА РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		//Катаев- 19/06/13
		|	И РасходнаяНакладная.Контрагент = &Контрагент
		|	И РасходнаяНакладная.Проведен";      //нечаева 25,04,17+++
		Запрос.УстановитьПараметр("Дата", НачалоГода(стрШапка.ДатаПриемаТовара));
	Иначе                                         //нечаева 25,04,17---
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.НомерЗаказа = &Номер
		//Катаев+ 09/04/13
		|	И НАЧАЛОПЕРИОДА(РасходнаяНакладная.ДатаЗаказа, ДЕНЬ) = &Дата
		//|	И РасходнаяНакладная.ДатаЗаказа = &Дата
		//Катаев- 09/04/13
		//Катаев+ 19/06/13
		//|	И РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
		|	И ВЫБОР
		|			КОГДА &ВыборПунктДоставки
		|				ТОГДА РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		//Катаев- 19/06/13
		|	И РасходнаяНакладная.Контрагент = &Контрагент
		|	И РасходнаяНакладная.Проведен";
		//Катаев+ 01/04/13
		ДатаЗаказа = Дата(СтрЗаменить(стрШапка.ДатаЗаказа,"-",""));
		Запрос.УстановитьПараметр("Дата", ДатаЗаказа);
		//Катаев- 01/04/13
	КонецЕсли;
	Запрос.УстановитьПараметр("Номер", стрШапка.НомерЗаказа);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		сз.Добавить(Выборка.Ссылка);
	КонецЦикла;
	Если сз.Количество() <> 0 Тогда
		Возврат сз;
	Иначе
		//Катаев+ 09/04/13 Для случая что в РНК не заполнена дата заказа делаем поиск по номеру заказа и дата РНК не меньше месяца
		//Катаев+ 01/04/13
		//Строка="РНК для заказа №"+стрШапка.НомерЗаказа+" не обнаружена";
		//Строка="Уведомление о поступлении товара. РНК для заказа №"+стрШапка.НомерЗаказа+" не обнаружена";
		//Катаев- 01/04/13
		
		//нечаева 03,06,15+++
		Строка = "";
		//нечаева 03,06,15---
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.НомерЗаказа = &Номер
		|	И РасходнаяНакладная.Дата >= &Дата
		//Катаев+ 19/06/13
		//|	И РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
		//Катаев+ 21/07/14 Проверку по пункту доставки отключил
		//|	И ВЫБОР
		//|			КОГДА &ВыборПунктДоставки
		//|				ТОГДА РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
		//|			ИНАЧЕ ИСТИНА
		//|		КОНЕЦ
		//Катаев- 19/06/13
		|	И РасходнаяНакладная.Контрагент = &Контрагент
		|	И РасходнаяНакладная.Проведен";
		Запрос.УстановитьПараметр("Дата", ТекущаяДата()-86400*30);
		Запрос.УстановитьПараметр("Номер", стрШапка.НомерЗаказа);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			сз.Добавить(Выборка.Ссылка);
		КонецЦикла;
		Если сз.Количество() <> 0 Тогда
			Возврат сз;
		Иначе
			//нечаева 03,06,15++
			Если НЕ стрШапка.Контрагент.Наименование="Городской Супермаркет" Тогда
				Строка="Уведомление о поступлении товара. РНК для заказа №"+стрШапка.НомерЗаказа+" не обнаружена. ИЛН контрагента = " + стрШапка.Контрагент+" ИЛН пункта доставки = "+стрШапка.ПунктДоставки + " № РНК в уведомлении = "+стрШапка.НомерРНК;
			КонецЕсли;
			//нечаева 03,06,15--
			
		КонецЕсли;
		//нечаева 03,06,15+++
		Если Строка<>"" Тогда
			КритичОшибки.Добавить(Строка);
			//Катаев+ 02/10/14
			Ошибки.Добавить(Строка);
		конецЕсли;
		//нечаева 03.06,15 --
		
		
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
// Катаев- 22/03/13


//нечаева 14,03,18++
Функция НайтиРНКст2(стрШапка)
	Запрос = Новый Запрос;
	сз = Новый СписокЗначений;
	//Катаев+ 28/05/14 Уведомления приходят от других пунктов доставки. Отключаем проверку на пункт доставки
	////Катаев+ 19/06/13 В уведомлении может не быть указан Пункт доставки
	//Если ПустаяСтрока(стрШапка.ПунктДоставки) Тогда
	//	Запрос.УстановитьПараметр("ВыборПунктДоставки", Ложь);
	//Иначе
	//	Запрос.УстановитьПараметр("ВыборПунктДоставки", Истина);
	//КонецЕсли;
	//Катаев- 19/06/13
	
	
	
	
	Запрос.УстановитьПараметр("ВыборПунктДоставки", Ложь);
	//Катаев- 28/05/14
	Запрос.УстановитьПараметр("ПунктДоставки", стрШапка.ПунктДоставки);
	Запрос.УстановитьПараметр("Контрагент", стрШапка.Контрагент);
	
	//нечаева 12,12,16+++
	Запрос.УстановитьПараметр("Номер", стрШапка.НомерРНК);
	//нечаева 12,12,16---
	
	
	
	//нечаева 07,05,18 +++
	// для Перекрестка, ищем по номеру счет фактурs Х5
	Если стрШапка.Контрагент.родитель.код = "SSR-4117" ТОгда
		
		// Пробуем определить по Дате и Номеру РНК
		Если стрШапка.НомерРНК <> Неопределено Тогда
			Если стрШапка.ДатаРНК = Неопределено Тогда
				
				Запрос.Текст =
				"ВЫБРАТЬ
				|	СчетФактура.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.СчетФактура КАК СчетФактура
				|ГДЕ
				|	СчетФактура.Номер = &Номер
				|	И СчетФактура.Дата >= &Дата
				|	И СчетФактура.Контрагент = &Контрагент
				|	И СчетФактура.Проведен";
				
				
				Запрос.УстановитьПараметр("Дата", стрШапка.ДатаПриемаТовара-86400*30);
			Иначе
				
				Запрос.Текст =
				"ВЫБРАТЬ
				|	СчетФактура.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.СчетФактура КАК СчетФактура
				|ГДЕ
				|	СчетФактура.Номер = &Номер
				|	И СчетФактура.Дата >= &Дата
				|	И СчетФактура.Контрагент = &Контрагент
				|	И СчетФактура.Проведен";
				
				
				ДатаРНК = Дата(СтрЗаменить(стрШапка.ДатаРНК,"-",""));
				Запрос.УстановитьПараметр("Дата", НачалоДня(ДатаРНК)-86400*30);
			КонецЕсли;
			Запрос.УстановитьПараметр("Номер", стрШапка.НомерРНК);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				РНК = Выборка.Ссылка.накладные[0].накладная.ссылка;
				
				сз.Добавить(РНК);
			КонецЦикла;
			
			РНК = неопределено;
			Если сз.Количество() <> 0 Тогда
				Возврат сз;
			КонецЕсли;
		КонецЕсли;
		
		// если не нашли то смотрим старый кусок, как был поиск по РНК.
		// Пробуем определить по Дате, Номеру заказа и адресу доставки;
		
	КонецЕсли;
	
	//нечаева 07,05,18 ---
	
	//нечаева 03,04,19++
	//для табер трейда ищем сначала по номеру заказа.
	Если стрШапка.Контрагент.код = "SSP-3698" ТОгда
		
		Если стрШапка.ДатаРНК = Неопределено Тогда
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РасходнаяНакладная.Ссылка
			|ИЗ
			|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
			|ГДЕ
			|	РасходнаяНакладная.НомерЗаказа = &Номер
			|	И РасходнаяНакладная.Дата >= &Дата
			|	И ВЫБОР
			|			КОГДА &ВыборПунктДоставки
			|				ТОГДА РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|	И РасходнаяНакладная.Контрагент = &Контрагент
			|	И РасходнаяНакладная.Проведен";
			Запрос.УстановитьПараметр("Дата", стрШапка.ДатаПриемаТовара-86400*30);
		Иначе
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РасходнаяНакладная.Ссылка
			|ИЗ
			|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
			|ГДЕ
			|	РасходнаяНакладная.НомерЗаказа = &Номер
			|	И НАЧАЛОПЕРИОДА(РасходнаяНакладная.Дата, ДЕНЬ)>= &Дата
			|	И ВЫБОР
			|			КОГДА &ВыборПунктДоставки
			|				ТОГДА РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|	И РасходнаяНакладная.Контрагент = &Контрагент
			|	И РасходнаяНакладная.Проведен";
			ДатаРНК = Дата(СтрЗаменить(стрШапка.ДатаРНК,"-",""));
			
			Запрос.УстановитьПараметр("Дата", НачалоДня(ДатаРНК)-86400*30);
		КонецЕсли;
		Запрос.УстановитьПараметр("Номер", стрШапка.НомерЗаказа);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			сз.Добавить(Выборка.Ссылка)
		КонецЦикла;
		
		Если сз.Количество() <> 0 Тогда
			Возврат сз;
		КонецЕсли;
		
		
		// если не нашли то смотрим старый кусок, как был поиск по РНК.
		// Пробуем определить по Дате, Номеру заказа и адресу доставки;
		
		
	КонецЕсли;
	//нечаева 03,04,19---
	
	
	
	
	// Пробуем определить по Дате и Номеру РНК
	Если стрШапка.НомерРНК <> Неопределено Тогда
		Если стрШапка.ДатаРНК = Неопределено Тогда
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РасходнаяНакладная.Ссылка
			|ИЗ
			|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
			|ГДЕ
			|	РасходнаяНакладная.Номер = &Номер
			|	И РасходнаяНакладная.Дата >= &Дата
			//Катаев+ 19/06/13
			//|	И РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
			|	И ВЫБОР
			|			КОГДА &ВыборПунктДоставки
			|				ТОГДА РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			//Катаев- 19/06/13
			|	И РасходнаяНакладная.Контрагент = &Контрагент
			|	И РасходнаяНакладная.Проведен";
			Запрос.УстановитьПараметр("Дата", стрШапка.ДатаПриемаТовара-86400*30);
		Иначе
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РасходнаяНакладная.Ссылка
			|ИЗ
			|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
			|ГДЕ
			|	РасходнаяНакладная.Номер = &Номер
			//Катаев+ 01/04/13
			//|	И РасходнаяНакладная.Дата = &Дата
			|	И НАЧАЛОПЕРИОДА(РасходнаяНакладная.Дата, ДЕНЬ)>= &Дата
			//Катаев- 01/04/13
			//Катаев+ 19/06/13
			//|	И РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
			|	И ВЫБОР
			|			КОГДА &ВыборПунктДоставки
			|				ТОГДА РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			//Катаев- 19/06/13
			|	И РасходнаяНакладная.Контрагент = &Контрагент
			|	И РасходнаяНакладная.Проведен";
			//Катаев+ 01/04/13
			ДатаРНК = Дата(СтрЗаменить(стрШапка.ДатаРНК,"-",""));
			//нечаева 12,12,16++
			Запрос.УстановитьПараметр("Дата", НачалоДня(ДатаРНК)-86400*30);
			//нечаева 12,12,16--
			//Катаев- 01/04/13
		КонецЕсли;
		Запрос.УстановитьПараметр("Номер", стрШапка.НомерРНК);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			сз.Добавить(Выборка.Ссылка)
		КонецЦикла;
		Если сз.Количество() <> 0 Тогда
			Возврат сз;
		КонецЕсли;
	КонецЕсли;
	// Пробуем определить по Дате, Номеру заказа и адресу доставки;
	//Катаев+ 28/05/14 А здесь включаем
	Если ПустаяСтрока(стрШапка.ПунктДоставки) Тогда
		Запрос.УстановитьПараметр("ВыборПунктДоставки", Ложь);
	Иначе
		Запрос.УстановитьПараметр("ВыборПунктДоставки", Истина);
	КонецЕсли;
	//Катаев- 28/05/14
	Если стрШапка.ДатаЗаказа = Неопределено Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.НомерЗаказа = &Номер
		|	И РасходнаяНакладная.ДатаЗаказа >= &Дата
		//Катаев+ 19/06/13
		//|	И РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
		|	И ВЫБОР
		|			КОГДА &ВыборПунктДоставки
		|				ТОГДА РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		//Катаев- 19/06/13
		|	И РасходнаяНакладная.Контрагент = &Контрагент
		|	И РасходнаяНакладная.Проведен";      //нечаева 25,04,17+++
		Запрос.УстановитьПараметр("Дата", НачалоГода(стрШапка.ДатаПриемаТовара));
	Иначе                                         //нечаева 25,04,17---
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.НомерЗаказа = &Номер
		//Катаев+ 09/04/13
		|	И НАЧАЛОПЕРИОДА(РасходнаяНакладная.ДатаЗаказа, ДЕНЬ) = &Дата
		//|	И РасходнаяНакладная.ДатаЗаказа = &Дата
		//Катаев- 09/04/13
		//Катаев+ 19/06/13
		//|	И РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
		|	И ВЫБОР
		|			КОГДА &ВыборПунктДоставки
		|				ТОГДА РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		//Катаев- 19/06/13
		|	И РасходнаяНакладная.Контрагент = &Контрагент
		|	И РасходнаяНакладная.Проведен";
		//Катаев+ 01/04/13
		ДатаЗаказа = Дата(СтрЗаменить(стрШапка.ДатаЗаказа,"-",""));
		Запрос.УстановитьПараметр("Дата", ДатаЗаказа);
		//Катаев- 01/04/13
	КонецЕсли;
	Запрос.УстановитьПараметр("Номер", стрШапка.НомерЗаказа);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		сз.Добавить(Выборка.Ссылка);
	КонецЦикла;
	Если сз.Количество() <> 0 Тогда
		Возврат сз;
	Иначе
		//Катаев+ 09/04/13 Для случая что в РНК не заполнена дата заказа делаем поиск по номеру заказа и дата РНК не меньше месяца
		//Катаев+ 01/04/13
		//Строка="РНК для заказа №"+стрШапка.НомерЗаказа+" не обнаружена";
		//Строка="Уведомление о поступлении товара. РНК для заказа №"+стрШапка.НомерЗаказа+" не обнаружена";
		//Катаев- 01/04/13
		
		//нечаева 03,06,15+++
		Строка = "";
		//нечаева 03,06,15---
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.НомерЗаказа = &Номер
		|	И РасходнаяНакладная.Дата >= &Дата
		//Катаев+ 19/06/13
		//|	И РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
		//Катаев+ 21/07/14 Проверку по пункту доставки отключил
		//|	И ВЫБОР
		//|			КОГДА &ВыборПунктДоставки
		//|				ТОГДА РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
		//|			ИНАЧЕ ИСТИНА
		//|		КОНЕЦ
		//Катаев- 19/06/13
		|	И РасходнаяНакладная.Контрагент = &Контрагент
		|	И РасходнаяНакладная.Проведен";
		Запрос.УстановитьПараметр("Дата", ТекущаяДата()-86400*30);
		Запрос.УстановитьПараметр("Номер", стрШапка.НомерЗаказа);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			сз.Добавить(Выборка.Ссылка);
		КонецЦикла;
		Если сз.Количество() <> 0 Тогда
			Возврат сз;
		Иначе
			//нечаева 03,06,15++
			Если НЕ стрШапка.Контрагент.Наименование="Городской Супермаркет" Тогда
				Строка="Уведомление о поступлении товара. РНК для заказа №"+стрШапка.НомерЗаказа+" не обнаружена. ИЛН контрагента = " + стрШапка.Контрагент+" ИЛН пункта доставки = "+стрШапка.ПунктДоставки + " № РНК в уведомлении = "+стрШапка.НомерРНК;
			КонецЕсли;
			//нечаева 03,06,15--
			
		КонецЕсли;
		//нечаева 03,06,15+++
		Если Строка<>"" Тогда
			КритичОшибки.Добавить(Строка);
			//Катаев+ 02/10/14
			Ошибки.Добавить(Строка);
		конецЕсли;
		//нечаева 03.06,15 --
		
		
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
// нечаева 14,03,18---


// Катаев+ 22/03/13 Функция поиска РНК переделана кардинально
Функция НайтиРНК(стрШапка)
	Запрос = Новый Запрос;
	сз = Новый СписокЗначений;
	//Катаев+ 28/05/14 Уведомления приходят от других пунктов доставки. Отключаем проверку на пункт доставки
	////Катаев+ 19/06/13 В уведомлении может не быть указан Пункт доставки
	//Если ПустаяСтрока(стрШапка.ПунктДоставки) Тогда
	//	Запрос.УстановитьПараметр("ВыборПунктДоставки", Ложь);
	//Иначе
	//	Запрос.УстановитьПараметр("ВыборПунктДоставки", Истина);
	//КонецЕсли;
	//Катаев- 19/06/13
	Запрос.УстановитьПараметр("ВыборПунктДоставки", Ложь);
	//Катаев- 28/05/14
	Запрос.УстановитьПараметр("ПунктДоставки", стрШапка.ПунктДоставки);
	Запрос.УстановитьПараметр("Контрагент", стрШапка.Контрагент);
	
	//нечаева 12,12,16+++
	Запрос.УстановитьПараметр("Номер", стрШапка.НомерРНК);
	//нечаева 12,12,16---
	
	
	//нечаева 07,05,18 +++
	// для Перекрестка, ищем по номеру счет фактурs Х5
	Если стрШапка.Контрагент.родитель.код = "SSR-4117" ТОгда
		
		// Пробуем определить по Дате и Номеру РНК
		Если стрШапка.НомерРНК <> Неопределено Тогда
			Если стрШапка.ДатаРНК = Неопределено Тогда
				
				Запрос.Текст =
				"ВЫБРАТЬ
				|	СчетФактура.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.СчетФактура КАК СчетФактура
				|ГДЕ
				|	СчетФактура.Номер = &Номер
				|	И СчетФактура.Дата >= &Дата
				|	И СчетФактура.Контрагент = &Контрагент
				|	И СчетФактура.Проведен";
				
				
				Запрос.УстановитьПараметр("Дата", стрШапка.ДатаПриемаТовара-86400*30);
			Иначе
				
				Запрос.Текст =
				"ВЫБРАТЬ
				|	СчетФактура.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.СчетФактура КАК СчетФактура
				|ГДЕ
				|	СчетФактура.Номер = &Номер
				|	И СчетФактура.Дата >= &Дата
				|	И СчетФактура.Контрагент = &Контрагент
				|	И СчетФактура.Проведен";
				
				
				ДатаРНК = Дата(СтрЗаменить(стрШапка.ДатаРНК,"-",""));
				Запрос.УстановитьПараметр("Дата", НачалоДня(ДатаРНК)-86400*30);
			КонецЕсли;
			Запрос.УстановитьПараметр("Номер", стрШапка.НомерРНК);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				РНК = Выборка.Ссылка.накладные[0].накладная.ссылка;
				
				сз.Добавить(РНК);
			КонецЦикла;
			
			РНК = неопределено;
			Если сз.Количество() <> 0 Тогда
				Возврат сз;
			КонецЕсли;
		КонецЕсли;
		
		// если не нашли то смотрим старый кусок, как был поиск по РНК.
		// Пробуем определить по Дате, Номеру заказа и адресу доставки;
		
	КонецЕсли;
	
	//нечаева 07,05,18 ---
	
	
	//для табер трейда ищем сначала по номеру заказа.
	Если стрШапка.Контрагент.код = "SSP-3698" ТОгда
		
		Если стрШапка.ДатаРНК = Неопределено Тогда
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РасходнаяНакладная.Ссылка
			|ИЗ
			|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
			|ГДЕ
			|	РасходнаяНакладная.НомерЗаказа = &Номер
			|	И РасходнаяНакладная.Дата >= &Дата
			|	И ВЫБОР
			|			КОГДА &ВыборПунктДоставки
			|				ТОГДА РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|	И РасходнаяНакладная.Контрагент = &Контрагент
			|	И РасходнаяНакладная.Проведен";
			Запрос.УстановитьПараметр("Дата", стрШапка.ДатаПриемаТовара-86400*30);
		Иначе
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РасходнаяНакладная.Ссылка
			|ИЗ
			|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
			|ГДЕ
			|	РасходнаяНакладная.НомерЗаказа = &Номер
			|	И НАЧАЛОПЕРИОДА(РасходнаяНакладная.Дата, ДЕНЬ)>= &Дата
			|	И ВЫБОР
			|			КОГДА &ВыборПунктДоставки
			|				ТОГДА РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|	И РасходнаяНакладная.Контрагент = &Контрагент
			|	И РасходнаяНакладная.Проведен";
			ДатаРНК = Дата(СтрЗаменить(стрШапка.ДатаРНК,"-",""));
			
			Запрос.УстановитьПараметр("Дата", НачалоДня(ДатаРНК)-86400*30);
		КонецЕсли;
		Запрос.УстановитьПараметр("Номер", стрШапка.НомерЗаказа);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			сз.Добавить(Выборка.Ссылка)
		КонецЦикла;
		
		Если сз.Количество() <> 0 Тогда
			Возврат сз;
		КонецЕсли;
		
		
		// если не нашли то смотрим старый кусок, как был поиск по РНК.
		// Пробуем определить по Дате, Номеру заказа и адресу доставки;
		
		
	КонецЕсли;
	
	
	
	
	
	// Пробуем определить по Дате и Номеру РНК
	Если стрШапка.НомерРНК <> Неопределено Тогда
		Если стрШапка.ДатаРНК = Неопределено Тогда
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РасходнаяНакладная.Ссылка
			|ИЗ
			|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
			|ГДЕ
			|	РасходнаяНакладная.Номер = &Номер
			|	И РасходнаяНакладная.Дата >= &Дата
			//Катаев+ 19/06/13
			//|	И РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
			|	И ВЫБОР
			|			КОГДА &ВыборПунктДоставки
			|				ТОГДА РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			//Катаев- 19/06/13
			|	И РасходнаяНакладная.Контрагент = &Контрагент
			|	И РасходнаяНакладная.Проведен";
			Запрос.УстановитьПараметр("Дата", стрШапка.ДатаПриемаТовара-86400*30);
		Иначе
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РасходнаяНакладная.Ссылка
			|ИЗ
			|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
			|ГДЕ
			|	РасходнаяНакладная.Номер = &Номер
			//Катаев+ 01/04/13
			//|	И РасходнаяНакладная.Дата = &Дата
			|	И НАЧАЛОПЕРИОДА(РасходнаяНакладная.Дата, ДЕНЬ)>= &Дата
			//Катаев- 01/04/13
			//Катаев+ 19/06/13
			//|	И РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
			|	И ВЫБОР
			|			КОГДА &ВыборПунктДоставки
			|				ТОГДА РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			//Катаев- 19/06/13
			|	И РасходнаяНакладная.Контрагент = &Контрагент
			|	И РасходнаяНакладная.Проведен";
			//Катаев+ 01/04/13
			ДатаРНК = Дата(СтрЗаменить(стрШапка.ДатаРНК,"-",""));
			//нечаева 12,12,16++
			Запрос.УстановитьПараметр("Дата", НачалоДня(ДатаРНК)-86400*30);
			//нечаева 12,12,16--
			//Катаев- 01/04/13
		КонецЕсли;
		Запрос.УстановитьПараметр("Номер", стрШапка.НомерРНК);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			сз.Добавить(Выборка.Ссылка)
		КонецЦикла;
		Если сз.Количество() <> 0 Тогда
			Возврат сз;
		КонецЕсли;
	КонецЕсли;
	// Пробуем определить по Дате, Номеру заказа и адресу доставки;
	//Катаев+ 28/05/14 А здесь включаем
	Если ПустаяСтрока(стрШапка.ПунктДоставки) Тогда
		Запрос.УстановитьПараметр("ВыборПунктДоставки", Ложь);
	Иначе
		Запрос.УстановитьПараметр("ВыборПунктДоставки", Истина);
	КонецЕсли;
	//Катаев- 28/05/14
	Если стрШапка.ДатаЗаказа = Неопределено Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.НомерЗаказа = &Номер
		|	И РасходнаяНакладная.ДатаЗаказа >= &Дата
		//Катаев+ 19/06/13
		//|	И РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
		|	И ВЫБОР
		|			КОГДА &ВыборПунктДоставки
		|				ТОГДА РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		//Катаев- 19/06/13
		|	И РасходнаяНакладная.Контрагент = &Контрагент
		|	И РасходнаяНакладная.Проведен";      //нечаева 25,04,17+++
		Запрос.УстановитьПараметр("Дата", НачалоГода(стрШапка.ДатаПриемаТовара));
	Иначе                                         //нечаева 25,04,17---
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.НомерЗаказа = &Номер
		//Катаев+ 09/04/13
		|	И НАЧАЛОПЕРИОДА(РасходнаяНакладная.ДатаЗаказа, ДЕНЬ) = &Дата
		//|	И РасходнаяНакладная.ДатаЗаказа = &Дата
		//Катаев- 09/04/13
		//Катаев+ 19/06/13
		//|	И РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
		|	И ВЫБОР
		|			КОГДА &ВыборПунктДоставки
		|				ТОГДА РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		//Катаев- 19/06/13
		|	И РасходнаяНакладная.Контрагент = &Контрагент
		|	И РасходнаяНакладная.Проведен";
		//Катаев+ 01/04/13
		ДатаЗаказа = Дата(СтрЗаменить(стрШапка.ДатаЗаказа,"-",""));
		Запрос.УстановитьПараметр("Дата", ДатаЗаказа);
		//Катаев- 01/04/13
	КонецЕсли;
	Запрос.УстановитьПараметр("Номер", стрШапка.НомерЗаказа);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		сз.Добавить(Выборка.Ссылка);
	КонецЦикла;
	Если сз.Количество() <> 0 Тогда
		Возврат сз;
	Иначе
		//Катаев+ 09/04/13 Для случая что в РНК не заполнена дата заказа делаем поиск по номеру заказа и дата РНК не меньше месяца
		//Катаев+ 01/04/13
		//Строка="РНК для заказа №"+стрШапка.НомерЗаказа+" не обнаружена";
		//Строка="Уведомление о поступлении товара. РНК для заказа №"+стрШапка.НомерЗаказа+" не обнаружена";
		//Катаев- 01/04/13
		
		//нечаева 03,06,15+++
		Строка = "";
		//нечаева 03,06,15---
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.НомерЗаказа подобно &Номер
		|	И РасходнаяНакладная.Дата >= &Дата
		//Катаев+ 19/06/13
		//|	И РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
		//Катаев+ 21/07/14 Проверку по пункту доставки отключил
		//|	И ВЫБОР
		//|			КОГДА &ВыборПунктДоставки
		//|				ТОГДА РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
		//|			ИНАЧЕ ИСТИНА
		//|		КОНЕЦ
		//Катаев- 19/06/13
		|	И РасходнаяНакладная.Контрагент = &Контрагент
		|	И РасходнаяНакладная.Проведен";
		Запрос.УстановитьПараметр("Дата", ТекущаяДата()-86400*30);
		Запрос.УстановитьПараметр("Номер", стрШапка.НомерЗаказа);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			сз.Добавить(Выборка.Ссылка);
		КонецЦикла;
		Если сз.Количество() <> 0 Тогда
			Возврат сз;
		Иначе
			//нечаева 03,06,15++
			Если НЕ стрШапка.Контрагент.Наименование="Городской Супермаркет" Тогда
			//	сообщить("Уведомление о поступлении товара. РНК для заказа №"+стрШапка.НомерЗаказа+" не обнаружена. ИЛН контрагента = " + стрШапка.Контрагент+" ИЛН пункта доставки = "+стрШапка.ПунктДоставки + " № РНК в уведомлении = "+стрШапка.НомерРНК);
			КонецЕсли;
			//нечаева 03,06,15--
			
		КонецЕсли;
		//нечаева 03,06,15+++
		Если Строка<>"" Тогда
			КритичОшибки.Добавить(Строка);
			//Катаев+ 02/10/14
			Ошибки.Добавить(Строка);
		конецЕсли;
		//нечаева 03.06,15 --
		
		
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
// Катаев- 22/03/13

// Катаев+ 21/03/13 Генерация накладной.
Функция ПолучитьНакладную(Склад, НомерЗаказа, ДатаЗаказа, ТипЗаказа)
	Если ТипЗаказа = "Оригинал" Тогда
		Возврат Документы.РасходнаяНакладная.СоздатьДокумент();
	Иначе
		// Делаем поиск РНК по Складу, Номеру и Дате заказа
		Запрос = Новый запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка,
		|	РасходнаяНакладная.СостояниеНакладной
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.ДатаЗаказа = &ДатаЗаказа
		|	И РасходнаяНакладная.НомерЗаказа = &НомерЗаказа
		|	И РасходнаяНакладная.Склад = &Склад";
		Запрос.УстановитьПараметр("НомерЗаказа", НомерЗаказа);
		Запрос.УстановитьПараметр("Склад", Склад);
		Запрос.УстановитьПараметр("ДатаЗаказа", ДатаЗаказа);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() > 1 Тогда
			спРНК = "";
			Пока Выборка.Следующий() Цикл
				спРНК = спРНК + Выборка.Ссылка.Номер + ";"
			КонецЦикла;
			Строка = "Для заказа № "+НомерЗаказа+" пришла корректировка, но было обнаружено более одного РНК ("+спРНК+"). Корректировку необходимо провести вручную.";
			Ошибки.Добавить(Строка);
			Возврат Неопределено;
		КонецЕсли;
		Если Выборка.Следующий() Тогда
			Если Выборка.Ссылка.Проведен Тогда
				Строка = "Для РНК "+Выборка.Ссылка+" пришла корректировка, но документ уже проведен. Корректировку необходимо провести вручную";
				Ошибки.Добавить(Строка);
				Возврат Неопределено;
			КонецЕсли;
			Если Выборка.СостояниеНакладной = перечисления.СостоянияНакладной.ВРаботе Тогда
				Строка = "Для РНК "+Выборка.Ссылка+" пришла корректировка. Документ будет изменен";
				Ошибки.Добавить(Строка);
				Возврат Выборка.Ссылка.ПолучитьОбъект();
			Иначе
				Строка = "Для РНК "+Выборка.Ссылка+" пришла корректировка, но документ уже отправлен на склад. Дальнейшая загрузка РНК прекращается.";
				Ошибки.Добавить(Строка);
				Возврат Неопределено;
			КонецЕсли;
		Иначе
			Строка = "Для заказа № "+НомерЗаказа+" пришла корректировка, но РНК не обнаружена. Будет создан новый документ";
			Ошибки.Добавить(Строка);
			Возврат Документы.РасходнаяНакладная.СоздатьДокумент();
		КонецЕсли;
	Конецесли;
КонецФункции
// Катаев- 21/03/13
//--------------------------
КодМетро	="SSP-8643";
КритичОшибки= Новый массив;

//нечаева 11,04,17+++
КритичОшибкиЛента = Новый массив; // для отправки многопаллетных документов
//нечаева 11,04,17---

ТзНужноЗавести = новый ТаблицаЗначений;
Ошибки=Новый Массив;
Файлы=Новый Массив;

ПризнакЗаписиДокумента=Истина;
ТЗПечать=Новый ТаблицаЗначений;
ТЗПечать.Колонки.Добавить("НомерСтроки",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("Найдена",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("ТипШк",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("Штрихкод",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("Название",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("КодПокуп",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("ОКЕИ_Тов",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("Колво",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
ТЗПечать.Колонки.Добавить("Единица",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("ЦенаБезНДС",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("СуммаБезНДС",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("СуммаНДС",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("Всего",Новый ОписаниеТипов("Число"));


ТЗШапка=Новый ТаблицаЗначений;
ТЗШапка.Колонки.Добавить("ОбщСумма");
ТЗШапка.Колонки.Добавить("ОбщКолУпак");
ТЗШапка.Колонки.Добавить("ОбщКол");
ТЗШапка.Колонки.Добавить("КолСтрок");
ТЗШапка.Колонки.Добавить("Контрагент");
ТЗШапка.Колонки.Добавить("ПунктДоставки");
ТЗШапка.Колонки.Добавить("Организация");
ТЗШапка.Колонки.Добавить("НомерСФ");
ТЗШапка.Колонки.Добавить("ДатаСф");
ТЗШапка.Колонки.Добавить("Промо");
ТЗШапка.Колонки.Добавить("ИдЭдо");
ТЗШапка.Колонки.Добавить("ТипШК");//блочок или штука, если блочок разворачиваем в штуки


//нечаева 19,03,15+++
ОшибкиАртикул=Новый Массив;
//нечаева 19,03,15---
// нечаева 130121 ++
КаталогЕкода = Константы.КаталогЕКОД.Получить(); //\\SRVECOD\SFERAConnector2\EDI\ 
СерверЕкода = "\\SRVECOD-C"; // менять в одном месте!!1  srvecod   старый   \\SRVECOD-C\SFERAConnector\EDI
// нечаева 130121---

//-------------------------------------------------------------------------------------------------------------------------------
тзМарки = Новый ТаблицаЗначений;
тзМарки.Колонки.Добавить("Номер", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(7, 0, ДопустимыйЗнак.Любой)),"№ п/п");
тзМарки.Колонки.Добавить("КодТов", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(20, ДопустимаяДлина.Переменная)));
тзМарки.Колонки.Добавить("КИЗ", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));
тзМарки.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));	
тзМарки.Колонки.Добавить("АртикулТов", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));	
тзМарки.Колонки.Добавить("Цена", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));	
тзМарки.Колонки.Добавить("Стоимость", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));
тзМарки.Колонки.Добавить("ЗначенИнф", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));	
тзМарки.Колонки.Добавить("ИдентифИнф", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));
тзМарки.Колонки.Добавить("КолТов", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));	

тзМарки.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
тзМарки.Колонки.Добавить("Модель", новый ОписаниеТипов("СправочникСсылка.Номенклатура"));	




тзМаркиВБ = Новый ТаблицаЗначений;
тзМаркиВБ.Колонки.Добавить("Номер", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(7, 0, ДопустимыйЗнак.Любой)),"№ п/п");
тзМаркиВБ.Колонки.Добавить("КодТов", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(20, ДопустимаяДлина.Переменная)));
тзМаркиВБ.Колонки.Добавить("КИЗ", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));
тзМаркиВБ.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));	
тзМаркиВБ.Колонки.Добавить("АртикулТов", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));
тзМаркиВБ.Колонки.Добавить("Цена", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));	
тзМаркиВБ.Колонки.Добавить("Стоимость", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));
тзМаркиВБ.Колонки.Добавить("ЗначенИнф", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));	
тзМаркиВБ.Колонки.Добавить("ИдентифИнф", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));
тзМаркиВБ.Колонки.Добавить("КолТов", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));	


тзНашиМарки = Новый ТаблицаЗначений;
тзНашиМарки.Колонки.Добавить("Номер", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(7, 0, ДопустимыйЗнак.Любой)),"№ п/п");
тзНашиМарки.Колонки.Добавить("КИЗ", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));


НераспознанныеМаркиВБ = Новый ТаблицаЗначений;
НераспознанныеМаркиВБ.Колонки.Добавить("Номер", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(7, 0, ДопустимыйЗнак.Любой)),"№ п/п");
НераспознанныеМаркиВБ.Колонки.Добавить("КИЗ", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));
НераспознанныеМаркиВБ.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));	
НераспознанныеМаркиВБ.Колонки.Добавить("КодТов", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(20, ДопустимаяДлина.Переменная)));


ОтсутствуютВМаркиВБ = Новый ТаблицаЗначений;
ОтсутствуютВМаркиВБ.Колонки.Добавить("Номер", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(7, 0, ДопустимыйЗнак.Любой)),"№ п/п");
ОтсутствуютВМаркиВБ.Колонки.Добавить("КИЗ", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));


МаркиУПД = Новый ТаблицаЗначений;
МаркиУПД.Колонки.Добавить("Номер", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(7, 0, ДопустимыйЗнак.Любой)),"№ п/п");
МаркиУПД.Колонки.Добавить("КодТов", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(20, ДопустимаяДлина.Переменная)));
МаркиУПД.Колонки.Добавить("КИЗ", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));
МаркиУПД.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));	
МаркиУПД.Колонки.Добавить("АртикулТов", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));	





