
#Область ТекстыЗапросов

Функция ТекстЗапроса_НайтиНоменклатуруПоОсновномуШК() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихКоды.Владелец КАК Номенклатура,
	|	ЕСТЬNULL(ШтрихКоды.Владелец.Родитель.ШтукВКоробке, 0) КАК ДополнительныйПараметр,
	|	ВЫБОР
	|		КОГДА ШтрихКоды.Владелец <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Успех
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	НЕ ШтрихКоды.ПометкаУдаления
	|	И (ШтрихКоды.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)  
	// +++ {Кузнецов Сергей Владимирович [06.05.2025] (HELP-4610)
	|			ИЛИ ШтрихКоды.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка))
	// }Кузнецов Сергей Владимирович +++ [06.05.2025]
	|	И ШтрихКоды.Наименование = &Данные";

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапроса_НайтиНоменклатуруШтукаЧЗ() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Упаковка.Владелец КАК Номенклатура,
	|	Упаковка.Ссылка КАК ДополнительныйПараметр,
	|	ВЫБОР
	|		КОГДА Упаковка.Владелец <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				И Упаковка.Ссылка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Успех
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК Упаковка
	|ГДЕ
	|	НЕ Упаковка.ПометкаУдаления
	|	И Упаковка.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
	|	И Упаковка.Наименование = &Данные";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапроса_НайтиНоменклатуруКоробЧЗ() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Упаковка.Владелец КАК Номенклатура,
	|	Упаковка.Ссылка КАК ДополнительныйПараметр,
	|	ВЫБОР
	|		КОГДА Упаковка.Владелец <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				И Упаковка.Ссылка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Успех
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК Упаковка
	|ГДЕ
	|	НЕ Упаковка.ПометкаУдаления
	|	И Упаковка.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Коробка)
	|	И Упаковка.Наименование = &Данные";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область Поиск

///////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ТекстЗапроса = Документы.ПроверкаПоставкиМаркированногоТовара.ТекстЗапроса_НайтиНоменклатуруПоОсновномуШК();
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
Функция ПолучитьСтруктуруВозврата(Данные, ТекстЗапроса) Экспорт
	
	СтруктураВозврата = Новый Структура("Номенклатура, ДополнительныйПараметр, Успех", Неопределено, Неопределено, Ложь);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Данные", Данные);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция НайтиКоличествоЗаводское(КодАгрегации) Экспорт
	
	МассивНоменклатуры = Новый Массив;
	
	СтруктураВозврата = Новый Структура("КоличествоЗаводское, МассивНоменклатуры", 0, МассивНоменклатуры);
	
	Если НЕ ЗначениеЗаполнено(КодАгрегации) Тогда
		Сообщить("Не заполнен Код Агрегации!!!");
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КодАгрегации", КодАгрегации);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ВложенныеШтрихкоды.Штрихкод) КАК КоличествоЗаводское
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШтрихкоды
	|ГДЕ
	|	ВложенныеШтрихкоды.Ссылка = &КодАгрегации";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		СтруктураВозврата.Вставить("КоличествоЗаводское", Выборка.КоличествоЗаводское);
	КонецЦикла;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныеТовары.Номенклатура КАК Номенклатура,
	|	ВложенныеТовары.Количество КАК Количество
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеТовары КАК ВложенныеТовары
	|ГДЕ
	|	ВложенныеТовары.Ссылка = &КодАгрегации";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Количество() > 0 Тогда
	
		Пока Выборка.Следующий() Цикл
			СтруктураСтроки = Новый Структура("Номенклатура, Количество");
			СтруктураСтроки.Вставить("Номенклатура", Выборка.Номенклатура);
			СтруктураСтроки.Вставить("Количество", Выборка.Количество);
			МассивНоменклатуры.Добавить(СтруктураСтроки);
		КонецЦикла;
	
		СтруктураВозврата.Вставить("МассивНоменклатуры", МассивНоменклатуры);
	
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти

#Область Расчет

Функция КоличествоНеправильногоСодержимогоКоробки(НоменклатураОсновная, тзШтрихкодыУпаковок) Экспорт
	
	Если НЕ ЗначениеЗаполнено(НоменклатураОсновная) Тогда
		Сообщить("Не заполнена Номенклатура основная!!");
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НоменклатураОсновная", НоменклатураОсновная);
	Запрос.УстановитьПараметр("тзШтрихкодыУпаковок", тзШтрихкодыУпаковок);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(тзШтрихкодыУпаковок.ШтрихкодУпаковки КАК Справочник.ШтрихкодыУпаковокТоваров) КАК ШтрихкодУпаковки,
	|	1 КАК Количество
	|ПОМЕСТИТЬ вр_ШтрихкодыУпаковок
	|ИЗ
	|	&тзШтрихкодыУпаковок КАК тзШтрихкодыУпаковок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_ШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец КАК Номенклатура,
	|	СУММА(вр_ШтрихкодыУпаковок.Количество) КАК Количество
	|ПОМЕСТИТЬ тзвр_ШтрихкодыУпаковок
	|ИЗ
	|	вр_ШтрихкодыУпаковок КАК вр_ШтрихкодыУпаковок
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(вр_ШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец) = ТИП(Справочник.Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	вр_ШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тзвр_ШтрихкодыУпаковок.Номенклатура КАК Номенклатура,
	|	СУММА(тзвр_ШтрихкодыУпаковок.Количество) КАК Количество
	|ПОМЕСТИТЬ вр_Количество
	|ИЗ
	|	тзвр_ШтрихкодыУпаковок КАК тзвр_ШтрихкодыУпаковок
	|ГДЕ
	|	тзвр_ШтрихкодыУпаковок.Номенклатура <> &НоменклатураОсновная
	|
	|СГРУППИРОВАТЬ ПО
	|	тзвр_ШтрихкодыУпаковок.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(вр_Количество.Количество) КАК КоличествоНеправильногоСодержимогоКоробки
	|ИЗ
	|	вр_Количество КАК вр_Количество";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.КоличествоНеправильногоСодержимогоКоробки;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

Функция ОтклонениеОтЗаводскогоКоличества(КоличествоЗаводское, тзШтрихкодыУпаковок) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("тзШтрихкодыУпаковок", тзШтрихкодыУпаковок);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(тзШтрихкодыУпаковок.ШтрихкодУпаковки КАК Справочник.ШтрихкодыУпаковокТоваров) КАК ШтрихкодУпаковки,
	|	1 КАК Количество
	|ПОМЕСТИТЬ вр_ШтрихкодыУпаковок
	|ИЗ
	|	&тзШтрихкодыУпаковок КАК тзШтрихкодыУпаковок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_ШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец КАК Номенклатура,
	|	СУММА(вр_ШтрихкодыУпаковок.Количество) КАК Количество
	|ПОМЕСТИТЬ тзвр_ШтрихкодыУпаковок
	|ИЗ
	|	вр_ШтрихкодыУпаковок КАК вр_ШтрихкодыУпаковок
	|
	|СГРУППИРОВАТЬ ПО
	|	вр_ШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(тзвр_ШтрихкодыУпаковок.Количество) КАК КоличествоШК
	|ИЗ
	|	тзвр_ШтрихкодыУпаковок КАК тзвр_ШтрихкодыУпаковок";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		Возврат КоличествоЗаводское - Выборка.КоличествоШК;
	КонецЦикла;
	
	Возврат КоличествоЗаводское;
	
КонецФункции

Функция КоличествоНеверныхШтучныхКодов(КодАгрегации, тзШтрихкодыУпаковок) Экспорт
	
	Если НЕ ЗначениеЗаполнено(КодАгрегации) Тогда
		Сообщить("Не заполнен Код Агрегации!!!");
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КодАгрегации", КодАгрегации);
	Запрос.УстановитьПараметр("тзШтрихкодыУпаковок", тзШтрихкодыУпаковок);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(тзШтрихкодыУпаковок.ШтрихкодУпаковки КАК Справочник.ШтрихкодыУпаковокТоваров) КАК ШтрихкодУпаковки,
	|	1 КАК Количество
	|ПОМЕСТИТЬ вр_ШтрихкодыУпаковок
	|ИЗ
	|	&тзШтрихкодыУпаковок КАК тзШтрихкодыУпаковок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_ШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|	вр_ШтрихкодыУпаковок.Количество КАК Количество
	|ПОМЕСТИТЬ вт_Штрихкоды
	|ИЗ
	|	вр_ШтрихкодыУпаковок КАК вр_ШтрихкодыУпаковок
	|ГДЕ
	|	НЕ вр_ШтрихкодыУпаковок.ШтрихкодУпаковки В
	|				(ВЫБРАТЬ
	|					ВложенныеШтрихкоды.Штрихкод КАК ШтрихкодыАгрегации
	|				ИЗ
	|					Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШтрихкоды
	|				ГДЕ
	|					ВложенныеШтрихкоды.Ссылка = &КодАгрегации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(вт_Штрихкоды.Количество) КАК КоличествоНеверныхШтучныхКодов
	|ИЗ
	|	вт_Штрихкоды КАК вт_Штрихкоды";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.КоличествоНеверныхШтучныхКодов;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыиФункции
//++Данилова Е.В. 05.05.2026 SNL-219 
Функция НайтиЛистПоКодуАгрегации(Знач КодАгрегации) Экспорт 
	Если Не ЗначениеЗаполнено(КодАгрегации) Тогда
		Возврат Неопределено; 
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛистНабора.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЛистНабора КАК ЛистНабора
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		|		ПО (ПриходнаяНакладная.Ссылка = ЛистНабора.ДокОснование)
		|			И (ПриходнаяНакладная.Проведен)
		|			И (ПриходнаяНакладная.КодОперации = &КодОперации)
		|ГДЕ
		|	ЛистНабора.КодАгрегации = &КодАгрегации
		|	И ЛистНабора.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛистНабора.Ссылка
		|ИЗ
		|	Документ.ЛистНабора КАК ЛистНабора
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		|		ПО (ПриходнаяНакладная.Ссылка = ЛистНабора.ДокОснование)
		|			И (ПриходнаяНакладная.Проведен)
		|			И (ПриходнаяНакладная.КодОперации = &КодОперации)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		|		ПО (ЛистНабораШтрихкодыУпаковок.Ссылка = ЛистНабора.Ссылка)
		|ГДЕ
		|	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки = &КодАгрегации
		|	И ЛистНабора.Проведен";
	
	Запрос.УстановитьПараметр("КодАгрегации", КодАгрегации);
	Запрос.УстановитьПараметр("КодОперации", Перечисления.КодыОперацийОстатки.ЗакупкаР);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ссылка; 
	КонецЕсли;
	
	Возврат неопределено; 


КонецФункции // НайтиЛистПоКодуАгрегации()

//--Данилова Е.В. 05.05.2026 
#КонецОбласти