
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ТекущиеДанные.Количество = ТекущиеДанные.КоличествоИсх - ТекущиеДанные.КоличествоФакт;
		ТекущиеДанные.Всего = ТекущиеДанные.Количество * ТекущиеДанные.ЦенаФакт;
		ТекущиеДанные.НДС = ТекущиеДанные.Всего * ПроцентНДСпоСтавке(ТекущиеДанные.СтавкаНДС);
		
		СуммаДокумента = Объект.Товары.Итог("Всего");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ТекущиеДанные.Цена = ТекущиеДанные.ЦенаИсх - ТекущиеДанные.ЦенаФакт;
		ТекущиеДанные.Всего = ТекущиеДанные.Количество * ТекущиеДанные.ЦенаФакт;
		ТекущиеДанные.НДС = ТекущиеДанные.Всего * ПроцентНДСпоСтавке(ТекущиеДанные.СтавкаНДС);
		
		СуммаДокумента = Объект.Товары.Итог("Всего");
		
	КонецЕсли;
	
КонецПроцедуры
