Функция СохранитьДвижения(ДокСсылка, Движения) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Если НЕ ЗначениеЗаполнено(ДокСсылка) Тогда 
		Результат.Ошибки.Добавить("Не указан регистратор !");
		Возврат Результат;
	КонецЕсли;	
	
	Если НЕ Метаданные.РегистрыСведений.ОтложенныеДвиженияДокументов.Измерения.ДокСсылка.Тип.СодержитТип(ТипЗнч(ДокСсылка)) Тогда 
		ТекстОшибки = СтрШаблон("Движения документа: %1 не подлежат отложенной записи.", ТипЗнч(ДокСсылка));
		Результат.Ошибки.Добавить(ТекстОшибки);
		Возврат Результат;
	КонецЕсли;
	
	НЗ = РегистрыСведений.ОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
	НЗ.Отбор.ДокСсылка.Установить(ДокСсылка, Истина);
	
	Для Каждого КиЗ Из Движения Цикл           
		Запись = НЗ.Добавить();
		
		Запись.ДокСсылка	= ДокСсылка;
		Запись.ИмяРегистра	= КиЗ.Ключ;
		Запись.Движения		= КиЗ.Значение;		
	КонецЦикла;                        
	
	Попытка
		НЗ.Записать();
		Результат.Успешно = Истина;
	Исключение                     
		Результат.Ошибки.Добавить("Ошибка записи отложенных движений документа ! " + ОписаниеОшибки());				
	КонецПопытки;	
	
	Возврат Результат;
КонецФункции //СохранитьДвижения(ДокСсылка, Движения) Экспорт