
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Вставить содержимое обработчика. 
	Движения.ОстаткиТМЦ.Очистить();
	//Движения.Продажи.Очистить();
	Движения.Записать();
	
	ЕстьДвижения = Истина;
	ЕстьДвижения1 = Истина;
	ВидДвиж = ВидДвиженияНакопления.Приход;

	Опер = Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя;
	Если ЕстьДвижения Тогда
		Движения.ОстаткиТМЦ.Записывать = Истина;
		
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			Если ТекСтрокаТовары.Количество Тогда
				Движение = Движения.ОстаткиТМЦ.Добавить();
				Движение.ВидДвижения = ВидДвиж;
				Движение.Период = Дата;
				Движение.Склад = Склад;
				Движение.Номенклатура = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
				//Движение.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
				Движение.Количество = ТекСтрокаТовары.Количество;
				Движение.КодОперации = Опер;
				Движение.Отправитель = Контрагент;
			КонецЕсли;
		КонецЦикла;
		
		Движения.Записать();
		
	КонецЕсли;
	////Если ЕстьДвижения1 Тогда
	////	Движения.Продажи.Записывать = Истина;
	////	
	////	Для Каждого СтрокаТаблицы Из Товары Цикл
	////		Если СтрокаТаблицы.Количество Тогда	
	////			Движение = Движения.Продажи.Добавить();
	////			
	////			Движение.Период						= Дата;
	////			Движение.Номенклатура				= СтрокаТаблицы.Номенклатура;
	////			Движение.ХарактеристикаНоменклатуры	= СтрокаТаблицы.ХарактеристикаНоменклатуры;
	////			Движение.Подразделение				= Подразделение;
	////			Движение.КодОперации				= Опер;
	////			Движение.Организация				= ДокОснование.Организация;
	////			Движение.Количество					= -СтрокаТаблицы.Количество;
	////			Движение.Оборот_Нац					=  -СтрокаТаблицы.Всего;
	////			ВсегоБезСкидки = ?(ЗначениеЗаполнено(СтрокаТаблицы.ЦенаБезСкидки), СтрокаТаблицы.ЦенаБезСкидки ,СтрокаТаблицы.Цена) * СтрокаТаблицы.Количество;
	////			Движение.ОборотБезСкидки_Нац		=  -ВсегоБезСкидки;
	////			Движение.Скидка_Нац					=  -(ВсегоБезСкидки - СтрокаТаблицы.Всего);
	////		КонецЕсли;
	////	КонецЦикла;
	////	
	////	Движения.Записать();
	////	
	////КонецЕсли;
	//Если ШтрихкодыУпаковок.Количество() Тогда
	//	Маркировка_ПИ.НайтиСоздатьХКМФакт(Ссылка, ШтрихкодыУпаковок.Выгрузить());	
	//КонецЕсли;

КонецПроцедуры
