
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЭтотОбъект.Автор	= ПараметрыСеанса.Пользователь;
	ЭтотОбъект.Статус	= Перечисления.СтатусыЗаявокНаСкидки.ВРаботе;
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда Возврат; КонецЕсли;

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УстановкаСкидок") Тогда
		
		// Заполнение шапки
		МассивПолей = "
		|Комментарий,
		|ТипСкидок";		
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, МассивПолей);
		
		ЭтотОбъект.ДокОснование = ДанныеЗаполнения;
		ЭтотОбъект.ВидЗаявки	= Перечисления.ВидыЗаявокНаСкидки.ПродлениеСкидок;
		
		// заполнение ТЧ Скидки
		НаборЗаписей = РегистрыСведений.СкидкиНоменклатуры.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(ДанныеЗаполнения);
		НаборЗаписей.Прочитать();
		
		ЭтотОбъект.Скидки.Загрузить(НаборЗаписей.Выгрузить());
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.Автор	= ПараметрыСеанса.Пользователь;
	ЭтотОбъект.Статус	= Перечисления.СтатусыЗаявокНаСкидки.ВРаботе;
КонецПроцедуры
