#Область ОбработчикиСобытий 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьДанныеФормы();
	ОбновитьНаСервере();
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РазвернутьДерево();  
КонецПроцедуры

&НаКлиенте
Процедура АктивныеБлокировкиПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.АктивныеБлокировки.ТекущиеДанные;
	
	Элементы.АктивныеБлокировкиПометка.ТолькоПросмотр = Ложь;
	
	Если ТекущиеДанные <> Неопределено 
		И ЗначениеЗаполнено(ТекущиеДанные.ЗНБ) Тогда
	
		Элементы.АктивныеБлокировкиПометка.ТолькоПросмотр = истина; 	
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	//Данилова Е.В. 20.02.2026 HELP-8893 
	Если НЕ ВводДоступен() Тогда Возврат КонецЕсли;
	Если НЕ ЭтоСобытиеСканера(Событие) Тогда Возврат КонецЕсли;
	
	глТорговоеОборудование.СканерПосылкаДанных(1);
	глСобытиеСканераОтработано	= Истина;		
	Данные = СтрЗаменить(Данные,Символы.ПС,"");
    ТекущаяСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница; 
	
	Если  ТекущаяСтраница = Элементы.ГруппаДелениеЗНБ Тогда
		
		Если СтрДлина(Данные)>14 Тогда
			
			ДокументСпецификации= глНайтиДокПоШК(Данные);
			
			Если ДокументСпецификации<>"" и ДокументСпецификации<>Неопределено и ДокументСпецификации.метаданные().имя="ЗаданиеНабора" тогда
				Если РежимДеленияЗНБ = 1 Тогда 
					ЗНБ_ДелениеЗНБ = ДокументСпецификации; 
					
					ДелениеЗНБПриИзмененииНаСервере();
				Иначе
					//надо найти в дереве и снять флаг отсканировать и проставить метку 
					ПометитьЗНБВДеревеДляДеления(ДокументСпецификации); 
				КонецЕсли; 
				
			Иначе
				Сообщить("Не найден ЗНБ по считанным данным!",СтатусСообщения.Важное);
			КонецЕсли;
			
		Иначе
			Сообщить("Неверная длина считанных данных!",СтатусСообщения.Важное); 
		КонецЕсли; 
		
	КонецЕсли;
КонецПроцедуры    


#КонецОбласти 

#Область Команды 
&НаКлиенте
Процедура СоздатьИНВ(Команда)
	СоздатьИНВНаСервере();
	ОбновитьНаСервере();
	РазвернутьДерево();
КонецПроцедуры
&НаКлиенте
Процедура АктивныеЗНБ(Команда)
	ТабДок = АктивныеЗНБНаСервере();
	
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьСетку = Истина;
	ТабДок.ОтображатьЗаголовки = Истина;
	ТабДок.Показать("Активные ЗНБ","Активные ЗНБ_" + Формат(ТекущаяДата(),"ДФ=dd_MM_yy")); 
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
	РазвернутьДерево();
КонецПроцедуры 

&НаКлиенте
Процедура ПроверитьЗНБ(Команда)
	
	ОткрытьФорму("Обработка.ПланИнвентаризации.Форма.ФормаПроверкиЗНБ"); 

КонецПроцедуры

&НаКлиенте
Процедура СоздатьБлокировку(Команда)
	Если Номенклатура.Количество() = 0
		 ИЛИ Склады.Количество() = 0
		  ИЛИ Не ЗначениеЗаполнено(НаДату) Тогда
		  
		  ПоказатьПредупреждение(,"Необходимо заполнить все поля: склады, номенклатуру и дату!!!"); 
		  
		  Возврат; 	
	
	КонецЕсли;
	ДокБлокировки = СоздатьБлокировкуНаСервере();
	Если  ЗначениеЗаполнено(ДокБлокировки) Тогда
		СозданнаяБлокировка = ДокБлокировки; 
		ОткрытьЗначение(ДокБлокировки);	
		
	КонецЕсли;
	 
КонецПроцедуры 

&НаКлиенте
Процедура ЗавершитьБлокировки(Команда)
	ЗавершитьБлокировкиНаСервере(); 
	ОбновитьНаСервере();
	РазвернутьДерево();
КонецПроцедуры

 &НаКлиенте
Процедура ОтсканироватьЗНБВБлокировки(Команда)
	ОтсканированныеЗНБСтр = ОткрытьФормуМодально("Обработка.ПланИнвентаризации.Форма.ФормаСканирования",,ЭтаФорма);
	Если ТипЗНЧ(ОтсканированныеЗНБСтр) = Тип("Структура") Тогда
	
		ДобавитьЗНБВБлокировкиНаСервере(ОтсканированныеЗНБСтр.ЗНБ,ОтсканированныеЗНБСтр.Все);
		ОбновитьНаСервере();
		РазвернутьДерево();
	
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура ПроставитьВсеПометки(Команда)
	ПроставитьПометки(Истина); 
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокумент(Команда) 
	//++Данилова Е.В. 20.02.2026 HELP-8893 
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаДелениеЗНБ Тогда 
		
		Если ТипЗнч(Элементы.ЗНБДляДеления.ТекущийЭлемент) = Тип("ПолеФормы")  Тогда
			Если Элементы.ЗНБДляДеления.ТекущийЭлемент.Имя = "ЗНБДляДеленияЗНБ" Тогда
				Если ЗначениеЗаполнено(Элементы.ЗНБДляДеления.ТекущиеДанные.ЗНБ) Тогда 
					ОткрытьЗначение(Элементы.ЗНБДляДеления.ТекущиеДанные.ЗНБ); 	
				КонецЕсли;
			КонецЕсли;
			
			Если Элементы.ЗНБДляДеления.ТекущийЭлемент.Имя = "ЗНБДляДеленияБлокировка" Тогда
				Если ЗначениеЗаполнено(Элементы.ЗНБДляДеления.ТекущиеДанные.Блокировка) Тогда 
					ОткрытьЗначение(Элементы.ЗНБДляДеления.ТекущиеДанные.Блокировка); 	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	//--Данилова Е.В. 20.02.2026 	
	ИначеЕсли ТипЗнч(Элементы.АктивныеБлокировки.ТекущийЭлемент) = Тип("ПолеФормы")  Тогда
		
		Если Элементы.АктивныеБлокировки.ТекущийЭлемент.Имя = "АктивныеБлокировкиБлокировка" Тогда
			Если ЗначениеЗаполнено(Элементы.АктивныеБлокировки.ТекущиеДанные.Блокировка) Тогда 
				ОткрытьЗначение(Элементы.АктивныеБлокировки.ТекущиеДанные.Блокировка); 	
			КонецЕсли;
		КонецЕсли;
		
		Если Элементы.АктивныеБлокировки.ТекущийЭлемент.Имя = "АктивныеБлокировкиИНВ" Тогда
			Если ЗначениеЗаполнено(Элементы.АктивныеБлокировки.ТекущиеДанные.ИНВ) Тогда 
				ОткрытьЗначение(Элементы.АктивныеБлокировки.ТекущиеДанные.ИНВ); 	
			КонецЕсли;
		КонецЕсли;
		Если Элементы.АктивныеБлокировки.ТекущийЭлемент.Имя = "АктивныеБлокировкиЗНБ" Тогда
			Если ЗначениеЗаполнено(Элементы.АктивныеБлокировки.ТекущиеДанные.ЗНБ) Тогда 
				ОткрытьЗначение(Элементы.АктивныеБлокировки.ТекущиеДанные.ЗНБ); 	
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;
		
КонецПроцедуры

 &НаКлиенте
Процедура СнятьВсеПометки(Команда)
	ПроставитьПометки(ложь); 
КонецПроцедуры


 &НаКлиенте
Процедура РазвернутьДеревоКоманда(Команда)
	РазвернутьДерево(); 
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДеревоКоманда(Команда)
	СвернутьДерево(); 
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет1(Команда)
	ТабДок = СформироватьОтчет1НаСервере();
    Отчет1.Очистить();
	Отчет1.Вывести(ТабДок); 
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет3(Команда)
	ТабДок = АктивныеЗНБНаСервере(ПериодОтчет3);
	Отчет3.Очистить();
	Отчет3.Вывести(ТабДок);
КонецПроцедуры



#КонецОбласти 


#Область СлужебныеПроцедурыФункции

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ДобавитьЗНБВБлокировкиНаСервере(МассивЗНБ,ВсеБлокировки = Ложь)
	
	 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивЗНБ",МассивЗНБ); 
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БлокировкаВыдачиВНаборСрезПоследних.Склад КАК Склад,
		|	БлокировкаВыдачиВНаборСрезПоследних.Номенклатура КАК Номенклатура,
		|	БлокировкаВыдачиВНаборСрезПоследних.Регистратор КАК Блокировка,
		|	БлокировкаВыдачиВНаборСрезПоследних.Период КАК Датаначала
		|ПОМЕСТИТЬ ВТБлокировки
		|ИЗ
		|	РегистрСведений.БлокировкаВыдачиВНабор.СрезПоследних(%НаДату%, ) КАК БлокировкаВыдачиВНаборСрезПоследних
		|ГДЕ
		|	БлокировкаВыдачиВНаборСрезПоследних.Активен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаданиеНабора.Ссылка КАК ЗНБ,
		|	ВТБлокировки.Блокировка КАК Блокировка
		|ИЗ
		|	Документ.ЗаданиеНабора КАК ЗаданиеНабора
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТБлокировки КАК ВТБлокировки
		|		ПО (ЗаданиеНабора.Склад = ВТБлокировки.Склад
		|				ИЛИ ЗаданиеНабора.Склад.ФизическийСклад = ВТБлокировки.Склад)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНабора.Товары КАК ЗаданиеНабораТовары
		|		ПО (ЗаданиеНабораТовары.Ссылка = ЗаданиеНабора.Ссылка)
		|ГДЕ
		|	ЗаданиеНабора.Ссылка В(&МассивЗНБ)
		|	И ЗаданиеНабораТовары.Номенклатура В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				ВТБлокировки.Номенклатура
		|			ИЗ
		|				ВТБлокировки)
		|ИТОГИ ПО
		|	Блокировка";
	
	Если ВсеБлокировки Тогда 
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%НаДату%",""); 
	
	Иначе 
		
	    Запрос.Текст = СтрЗаменить(Запрос.Текст,"%НаДату%","&НаДату");
		Запрос.УстановитьПараметр("НаДату",ТекущаяДата()); 
		
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИтоги = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	МассивДобавленныхЗНБ = Новый Массив; 
	Пока ВыборкаИтоги.Следующий() Цикл 
		
		ЕстьИзменения = Ложь;
		
		БлокировкаДок = ВыборкаИтоги.Блокировка;
		
		БлокировкаДокОб = БлокировкаДок.ПолучитьОбъект(); 
		
		ВыборкаЗНБ = ВыборкаИтоги.Выбрать();
		
		ТоварыБлок = БлокировкаДок.Номенклатура.Выгрузить(); 
		
		Пока ВыборкаЗНБ.Следующий() Цикл 
			
			ОтборЗНБ = Новый Структура("ЗаданиеНабора",ВыборкаЗНБ.ЗНБ);
			СтрокиЗНБ = БлокировкаДокОб.ЗНБ.НайтиСтроки(ОтборЗНБ);
			Если СтрокиЗНБ.Количество() > 0 Тогда
			
				Продолжить;	
			
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТоварыБлок.Номенклатура КАК Номенклатура
			|ПОМЕСТИТЬ ВТТовары
			|ИЗ
			|	&ТоварыБлок КАК ТоварыБлок
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЗаданиеНабораТовары.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ЗаданиеНабора.Товары КАК ЗаданиеНабораТовары
			|ГДЕ
			|	ЗаданиеНабораТовары.Ссылка = &Ссылка
			|	И ЗаданиеНабораТовары.Номенклатура В ИЕРАРХИИ
			|			(ВЫБРАТЬ
			|				ВТТовары.Номенклатура
			|			ИЗ
			|				ВТТовары)";
			
			Запрос.УстановитьПараметр("Ссылка", ВыборкаЗНБ.ЗНБ);
			Запрос.УстановитьПараметр("ТоварыБлок",ТоварыБлок);

			РезультатЗапроса1 = Запрос.Выполнить();
			
			Если Не РезультатЗапроса1.Пустой() Тогда
				
				НоваяСтрока =  БлокировкаДокОб.ЗНБ.Добавить(); 
				НоваяСтрока.ЗаданиеНабора = ВыборкаЗНБ.ЗНБ;
				
				МассивДобавленныхЗНБ.Добавить(ВыборкаЗНБ.ЗНБ); 
				
				ЕстьИзменения = истина; 
			КонецЕсли;
			
		    Если ЕстьИзменения Тогда
			
				БлокировкаДокОб.Записать(); 	
			
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если МассивДобавленныхЗНБ.Количество() > 0  Тогда
	
		Сообщить("Необходимо отложить следующие ЗНБ:"); 	
	    Сообщить(СтрСоединить(МассивДобавленныхЗНБ,Символы.ПС));  
	Иначе 
		Сообщить("Не найдены активные блокировки по отсканированным ЗНБ!"); 
	КонецЕсли;

КонецПроцедуры // ДобавитьЗНБВБлокировкиНаСервере()


&НаСервере
Процедура СоздатьИНВНаСервере()
	//создаем ИНВ по выделенным строкам 
	//если выделено несколько складов, то по складам 
	
	АктБлокировкиДерево = РеквизитФормыВЗначение("АктивныеБлокировки",Тип("ДеревоЗначений")); 
	
	СоответствиеСкладТовары = Новый Соответствие; 
	
	Для каждого Уровень1 Из АктБлокировкиДерево.Строки Цикл 
		
		Если НЕ Уровень1.Пометка Тогда
		
			Продолжить;	
		
		КонецЕсли;
		
		Если Уровень1.Склад.ВидСклада = Перечисления.ВидСклада.Физический Тогда
			
			Склад = Уровень1.Склад; 
		Иначе 
			Склад =  Уровень1.Склад.ФизическийСклад; 
			
		КонецЕсли;
		
		МассивТоваров = СоответствиеСкладТовары.Получить(Склад);   
		Если МассивТоваров = Неопределено Тогда
			
			МассивТоваров = Новый Массив; 	
			
		КонецЕсли;
		
		Для каждого Уровень2 Из Уровень1.Строки Цикл
			Если НЕ Уровень2.Пометка 
				ИЛИ ЗначениеЗаполнено(Уровень2.ИНВ) Тогда
				
				Продолжить;	
				
			КонецЕсли;
			
			МассивТоваров.Добавить(Уровень2.Номенклатура); 	
			
		КонецЦикла;
	    Если МассивТоваров.Количество() > 0  Тогда
		
			СоответствиеСкладТовары.Вставить(Склад,МассивТоваров);	
		
		КонецЕсли;	
		 
	КонецЦикла;
	МассивДокументов = Новый Массив; 
	Для каждого  ЭлСоответствия Из СоответствиеСкладТовары Цикл
	
		 НовыйДокумент = Документы.Инвентаризация.СоздатьДокумент(); 
		 НовыйДокумент.Дата = ТекущаяДата(); 
	     ЗаполнитьШапкуДокумента(НовыйДокумент, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац);
		 НовыйДокумент.ИБ			= ФР_ОбщегоНазначения_ПИ.ТекущаяИБ(); 
		 НовыйДокумент.СостояниеНакладной = Перечисления.СостоянияНакладной.ВРаботе; 
		 НовыйДокумент.Склад = ЭлСоответствия.Ключ;
		 НовыйДокумент.СкладВременногоХранения = ЭлСоответствия.Ключ;
		 НовыйДокумент.СтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоКоду("223 240"); 
		 
		 МассивТоваров = ЭлСоответствия.Значение; 
		 Для каждого ТоварыМассива Из МассивТоваров Цикл
			 
			 СтрокаТоваров = НовыйДокумент.Товары.Добавить(); 
			 СтрокаТоваров.Номенклатура = ТоварыМассива; 	
			 
		 КонецЦикла;
		 
		 МассивДокументов.Добавить(НовыйДокумент);  
		 
	 КонецЦикла;
	 НачатьТранзакцию(); 
	 Для каждого ДокИнв Из МассивДокументов Цикл
		 Попытка
			 
			 ДокИнв.Записать(РежимЗаписиДокумента.Проведение);
			 
		 Исключение
			 Сообщить(ОписаниеОшибки()); 
		 КонецПопытки;
		 
		 
	 КонецЦикла; 
	 если ТранзакцияАктивна() Тогда 
		 ЗафиксироватьТранзакцию();
		 
		 Сообщить(СтрСоединить(МассивДокументов,Символы.ПС)); 
	 КонецЕсли;
 КонецПроцедуры

&НаСервере
Функция АктивныеЗНБНаСервере(СрезНаДату = неопределено)
	
	РезультатТЗ = СформитьТаблицуИсточникАктивныеЗНБ(СрезНаДату);
	
	Об = РеквизитФормыВЗначение("Объект");
	ТабДок = Об.СформироватьТабДокАктивныеЗНБ(РезультатТЗ);
	
	Возврат ТабДок; 
	
КонецФункции

&НаСервере
Функция СформитьТаблицуИсточникАктивныеЗНБ(СрезНаДату)
	//Данилова Е.В. 12.03.2026 SNL-159 
	//изменен запрос 
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БлокировкаВыдачиВНаборСрезПоследних.Склад КАК Склад,
	|	БлокировкаВыдачиВНаборСрезПоследних.Номенклатура КАК Номенклатура,
	|	БлокировкаВыдачиВНаборСрезПоследних.Регистратор КАК Блокировка,
	|	БлокировкаВыдачиВНаборСрезПоследних.Период КАК Датаначала
	|ПОМЕСТИТЬ ВТБлокировки
	|ИЗ
	|	РегистрСведений.БлокировкаВыдачиВНабор.СрезПоследних(&ТекущаяДата, ) КАК БлокировкаВыдачиВНаборСрезПоследних
	|ГДЕ
	|	БлокировкаВыдачиВНаборСрезПоследних.Активен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Склады.Склад КАК Ссылка
	|ПОМЕСТИТЬ ВТСкладыБлок
	|ИЗ
	|	ВТБлокировки КАК Склады
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Склады.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТСклады
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	(Склады.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТСкладыБлок.Ссылка
	|				ИЗ
	|					ВТСкладыБлок)
	|			ИЛИ Склады.ФизическийСклад В
	|				(ВЫБРАТЬ
	|					ВТСкладыБлок.Ссылка
	|				ИЗ
	|					ВТСкладыБлок))
	|	И НЕ Склады.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТТовары
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ПометкаУдаления
	|	И Номенклатура.Ссылка В ИЕРАРХИИ
	|			(ВЫБРАТЬ
	|				ВТБлокировки.Номенклатура
	|			ИЗ
	|				ВТБлокировки)
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И НЕ Номенклатура.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаданиеНабора.Ссылка КАК ЗНБ,
	|	ЗаданиеНабора.Склад КАК Склад,
	|	ЗаданиеНабораТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТАктивныеЗНБПомежуточная
	|ИЗ
	|	Документ.ЗаданиеНабора.Товары КАК ЗаданиеНабораТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНабора КАК ЗаданиеНабора
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСклады КАК ВТСклады
	|			ПО ЗаданиеНабора.Склад = ВТСклады.Ссылка
	|		ПО ЗаданиеНабораТовары.Ссылка = ЗаданиеНабора.Ссылка
	|ГДЕ
	|	ЗаданиеНабора.СостояниеНакладной В(&СостоянияЗНБ)
	|	И ЗаданиеНабораТовары.Номенклатура В
	|			(ВЫБРАТЬ
	|				ВТТовары.Ссылка
	|			ИЗ
	|				ВТТовары КАК ВТТовары)
	|	И ЗаданиеНабора.Накладная.СостояниеНакладной <> &Отгружена
	|	И ЗаданиеНабора.Накладная.Проведен
	|	И ЗаданиеНабора.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланНабора.Ссылка КАК ПланНабора,
	|	ЗаданиеНабора.Склад КАК Склад,
	|	ЗаданиеНабораТовары.Номенклатура КАК Номенклатура,
	|	ЗаданиеНабора.Ссылка КАК ЗНБ,
	|	ЗаданиеНабора.СостояниеНакладной КАК СостояниеНакладной
	|ПОМЕСТИТЬ ВТЗаблокированныеТоварыПоПроходнаяНакладная
	|ИЗ
	|	Документ.ЗаданиеНабора.Товары КАК ЗаданиеНабораТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНабора КАК ЗаданиеНабора
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСклады КАК ВТСклады
	|			ПО ЗаданиеНабора.Склад = ВТСклады.Ссылка
	|		ПО ЗаданиеНабораТовары.Ссылка = ЗаданиеНабора.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПланНабора КАК ПланНабора
	|		ПО (ПланНабора.ПроходнаяНакладная)
	|			И (ЗаданиеНабора.ДокументОснование = ПланНабора.Ссылка)
	|ГДЕ
	|	ЗаданиеНабора.СостояниеНакладной В(&СостоянияПроверкиЗНБ)
	|	И ЗаданиеНабораТовары.Номенклатура В
	|			(ВЫБРАТЬ
	|				ВТТовары.Ссылка
	|			ИЗ
	|				ВТТовары КАК ВТТовары)
	|	И ЗаданиеНабора.Накладная.СостояниеНакладной <> &Отгружена
	|	И ЗаданиеНабора.Накладная.Проведен
	|	И ЗаданиеНабора.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаданиеНабора.Ссылка КАК ЗНБ,
	|	ВТЗаблокированныеТоварыПоПроходнаяНакладная.Склад КАК Склад,
	|	ВТЗаблокированныеТоварыПоПроходнаяНакладная.Номенклатура КАК Номенклатура,
	|	ВТЗаблокированныеТоварыПоПроходнаяНакладная.ЗНБ КАК ЗНББлок
	|ПОМЕСТИТЬ ВТАктивныеЗНБ
	|ИЗ
	|	ВТЗаблокированныеТоварыПоПроходнаяНакладная КАК ВТЗаблокированныеТоварыПоПроходнаяНакладная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПланНабора КАК ПланНабораДокумент
	|		ПО ВТЗаблокированныеТоварыПоПроходнаяНакладная.ПланНабора = ПланНабораДокумент.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНабора КАК ЗаданиеНабора
	|		ПО (ПланНабораДокумент.Ссылка = ЗаданиеНабора.ДокументОснование)
	|			И (ЗаданиеНабора.СостояниеНакладной В (&СостоянияПроверкиЗНБ))
	|			И (ЗаданиеНабора.Проведен)
	|			И (ЗаданиеНабора.Ссылка <> ВТЗаблокированныеТоварыПоПроходнаяНакладная.ЗНБ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАктивныеЗНБПомежуточная КАК ВТАктивныеЗНБ
	|		ПО (ВТАктивныеЗНБ.ЗНБ = ЗаданиеНабора.Ссылка)
	|ГДЕ
	|	ВТАктивныеЗНБ.ЗНБ ЕСТЬ NULL
	|	И (ЗаданиеНабора.СостояниеНакладной В (&СостоянияЗНБ)
	|			ИЛИ ВТЗаблокированныеТоварыПоПроходнаяНакладная.СостояниеНакладной В (&СостоянияЗНБ))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТАктивныеЗНБ.ЗНБ,
	|	ВТАктивныеЗНБ.Склад,
	|	ВТАктивныеЗНБ.Номенклатура,
	|	ВТАктивныеЗНБ.ЗНБ
	|ИЗ
	|	ВТАктивныеЗНБПомежуточная КАК ВТАктивныеЗНБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	БлокировкаВыдачиВНаборЗНБ.ЗаданиеНабора КАК ЗНБ,
	|	БлокировкаВыдачиВНаборЗНБ.Ссылка КАК Блокировка
	|ПОМЕСТИТЬ ВТБлокировкиПоЗНБ
	|ИЗ
	|	РегистрСведений.БлокировкаВыдачиВНабор.СрезПоследних(&ТекущаяДата, ) КАК БлокировкаВыдачиВНаборСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.БлокировкаВыдачиВНабор.ЗНБ КАК БлокировкаВыдачиВНаборЗНБ
	|		ПО БлокировкаВыдачиВНаборСрезПоследних.Регистратор = БлокировкаВыдачиВНаборЗНБ.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАктивныеЗНБ КАК ВТАктивныеЗНБ
	|		ПО (ВТАктивныеЗНБ.ЗНБ = БлокировкаВыдачиВНаборЗНБ.ЗаданиеНабора)
	|ГДЕ
	|	БлокировкаВыдачиВНаборСрезПоследних.Активен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТАктивныеЗНБ.ЗНБ КАК ЗНБ,
	|	ВТБлокировкиПоЗНБ.Блокировка КАК Блокировка,
	|	ВТАктивныеЗНБ.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТАктивныеЗНБВБлокировках
	|ИЗ
	|	ВТАктивныеЗНБ КАК ВТАктивныеЗНБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБлокировкиПоЗНБ КАК ВТБлокировкиПоЗНБ
	|		ПО ВТАктивныеЗНБ.ЗНБ = ВТБлокировкиПоЗНБ.ЗНБ
	|ГДЕ
	|	НЕ ВТБлокировкиПоЗНБ.Блокировка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТАктивныеЗНБ.ЗНБ КАК ЗНБ,
	|	ВТАктивныеЗНБ.Номенклатура КАК Номенклатура,
	|	ВТАктивныеЗНБ.ЗНББлок КАК ЗНББлок
	|ИЗ
	|	ВТАктивныеЗНБ КАК ВТАктивныеЗНБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБлокировкиПоЗНБ КАК ВТБлокировкиПоЗНБ
	|		ПО ВТАктивныеЗНБ.ЗНБ = ВТБлокировкиПоЗНБ.ЗНБ
	|ГДЕ
	|	ВТБлокировкиПоЗНБ.Блокировка ЕСТЬ NULL
	|ИТОГИ ПО
	|	ЗНБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТАктивныеЗНБВБлокировках.ЗНБ КАК ЗНБ
	|ИЗ
	|	ВТАктивныеЗНБВБлокировках КАК ВТАктивныеЗНБВБлокировках
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТБлокировки.Блокировка КАК Блокировка,
	|	ВТБлокировки.Склад КАК Склад
	|ИЗ
	|	ВТБлокировки КАК ВТБлокировки";
	
	СостоянияЗНБ = Новый Массив; 
	СостоянияЗНБ.Добавить(Перечисления.СостоянияНакладной.ОжиданиеНабора); 
	СостоянияЗНБ.Добавить(Перечисления.СостоянияНакладной.ВНаборе);
	Запрос.УстановитьПараметр("СостоянияЗНБ", СостоянияЗНБ);
	
	СостоянияДоОжиданияНабора = Новый Массив; 
	СостоянияДоОжиданияНабора.Добавить(Перечисления.СостоянияНакладной.ПолученоСкладом); 
	СостоянияДоОжиданияНабора.Добавить(Перечисления.СостоянияНакладной.СформированыЗаданияНабора);
	СостоянияДоОжиданияНабора.Добавить(Перечисления.СостоянияНакладной.ПроверенаПоОстаткам);
	Запрос.УстановитьПараметр("СостоянияДоОжиданияНабора", СостоянияДоОжиданияНабора);
	
	СостоянияПроверкиЗНБ = Новый Массив; 
	СостоянияПроверкиЗНБ.Добавить(Перечисления.СостоянияНакладной.ОжиданиеНабора); 
	СостоянияПроверкиЗНБ.Добавить(Перечисления.СостоянияНакладной.ВНаборе);
	СостоянияПроверкиЗНБ.Добавить(Перечисления.СостоянияНакладной.ПолученоСкладом); 
	СостоянияПроверкиЗНБ.Добавить(Перечисления.СостоянияНакладной.СформированыЗаданияНабора);
	СостоянияПроверкиЗНБ.Добавить(Перечисления.СостоянияНакладной.ПроверенаПоОстаткам);
	Запрос.УстановитьПараметр("СостоянияПроверкиЗНБ", СостоянияПроверкиЗНБ);
	
	Запрос.УстановитьПараметр("Отгружена", Перечисления.СостоянияНакладной.Отгружена);
	Если НЕ ЗначениеЗаполнено(СрезНаДату) Тогда		
		Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	Иначе 
		Запрос.УстановитьПараметр("ТекущаяДата",СрезНаДату); 	
	КонецЕсли;
	 
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	ВыборкаАКтЗНБ = ПакетЗапросов[9].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	
	ВыборкаИтоги = ПакетЗапросов[10].Выбрать();
	
	ТЗБлокировки =  ПакетЗапросов[11].Выгрузить();
	
	МенеджерВременнныхТаблиц = Запрос.МенеджерВременныхТаблиц; 
	
	ТЧАктивныеЗНБ = новый ТаблицаЗначений; 
	ТЧАктивныеЗНБ.Колонки.Добавить("ЗНБ",новый ОписаниеТипов("ДокументСсылка.ЗаданиеНабора"));
	ТЧАктивныеЗНБ.Колонки.Добавить("Номенклатура",новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЧАктивныеЗНБ.Колонки.Добавить("Блокировка",новый ОписаниеТипов("ДокументСсылка.БлокировкаВыдачиВНабор"));
	
	ТЧАктивныеЗНБПроходныеРНК = новый ТаблицаЗначений; 
	ТЧАктивныеЗНБПроходныеРНК.Колонки.Добавить("ЗНББлок",новый ОписаниеТипов("ДокументСсылка.ЗаданиеНабора"));
	ТЧАктивныеЗНБПроходныеРНК.Колонки.Добавить("ЗНБАктивное",новый ОписаниеТипов("ДокументСсылка.ЗаданиеНабора"));
	ТЧАктивныеЗНБПроходныеРНК.Колонки.Добавить("Блокировка1",новый ОписаниеТипов("ДокументСсылка.БлокировкаВыдачиВНабор"));
	
	Пока ВыборкаАКтЗНБ.Следующий() Цикл  
		
		
		Для каждого ВыборкаБлокировки Из ТЗБлокировки Цикл
			//	
		//	Если ВыборкаБлокировки.Склад = ВыборкаАКтЗНБ.ЗНБ.Склад 
				//ИЛИ ВыборкаБлокировки.Склад = ВыборкаАКтЗНБ.ЗНБ.Склад.ФизическийСклад Тогда
				Запрос = Новый запрос; 
				Запрос.МенеджерВременныхТаблиц = МенеджерВременнныхТаблиц; 
				
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ВТАктивныеЗНБ.Номенклатура КАК Номенклатура,
				|	ВТАктивныеЗНБ.ЗНББлок КАК ЗНББлок
				|ПОМЕСТИТЬ ВТТоварыЗНБ
				|ИЗ
				|	ВТАктивныеЗНБ КАК ВТАктивныеЗНБ
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСклады
				|		ПО (СпрСклады.Ссылка = ВТАктивныеЗНБ.Склад)
				|ГДЕ
				|	ВТАктивныеЗНБ.ЗНБ = &ЗНБ
				|	И (СпрСклады.Ссылка = &Склад
				|			ИЛИ СпрСклады.ФизическийСклад = &Склад)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВТБлокировки.Номенклатура КАК Номенклатура
				|ПОМЕСТИТЬ ВТТоварыБлокировки
				|ИЗ
				|	ВТБлокировки КАК ВТБлокировки
				|ГДЕ
				|	ВТБлокировки.Блокировка = &Блокировка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	номенклатура.Ссылка КАК номенклатура
				|ПОМЕСТИТЬ ВТТоварыБлокировкиЭлементы
				|ИЗ
				|	Справочник.Номенклатура КАК номенклатура
				|ГДЕ
				|	номенклатура.Ссылка В ИЕРАРХИИ
				|			(ВЫБРАТЬ
				|				ВТТоварыБлокировки.Номенклатура
				|			ИЗ
				|				ВТТоварыБлокировки)
				|	И НЕ номенклатура.ЭтоГруппа
				|	И НЕ номенклатура.ПометкаУдаления
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВТТоварыЗНБ.Номенклатура КАК Номенклатура,
				|	ВТТоварыЗНБ.ЗНББлок КАК ЗНББлок
				|ИЗ
				|	ВТТоварыЗНБ КАК ВТТоварыЗНБ
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТоварыБлокировкиЭлементы КАК ВТТоварыБлокировкиЭлементы
				|		ПО ВТТоварыЗНБ.Номенклатура = ВТТоварыБлокировкиЭлементы.номенклатура
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ВТТоварыЗНБ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ВТТоварыБлокировки
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ВТТоварыБлокировкиЭлементы";
				Запрос.УстановитьПараметр("ЗНБ",ВыборкаАКтЗНБ.ЗНБ);
				Запрос.УстановитьПараметр("Склад",ВыборкаБлокировки.Склад);
				Запрос.УстановитьПараметр("Блокировка",ВыборкаБлокировки.Блокировка);
				Выборка = Запрос.Выполнить().Выбрать();
				
				Пока Выборка.Следующий() Цикл
					Если ВыборкаАКтЗНБ.ЗНБ <> Выборка.ЗНББлок Тогда
						
						НСтрока = ТЧАктивныеЗНБПроходныеРНК.Добавить(); 	
						НСтрока.ЗНБАктивное = ВыборкаАКтЗНБ.ЗНБ;
						НСтрока.ЗНББлок 	= Выборка.ЗНББлок;
						НСтрока.Блокировка1 = ВыборкаБлокировки.Блокировка;
						
					Иначе
						НСтрока = ТЧАктивныеЗНБ.Добавить(); 	
						ЗаполнитьЗначенияСвойств(НСтрока,выборка);	
						НСтрока.ЗНБ = ВыборкаАКтЗНБ.ЗНБ; 
						НСтрока.Блокировка = ВыборкаБлокировки.Блокировка;
					КонецЕсли;
				КонецЦикла;
				
				 
				
			//КонецЕсли;
			
		КонецЦикла;
		
		//ВыборкаБлокировки.Сбросить(); 
		
		//Выборка = ВыборкаАКтЗНБ.выбрать(); 
		//
		//Пока Выборка.Следующий() Цикл
		//	
		//	
		//	НСтрока = ТЧАктивныеЗНБ.Добавить(); 	
		//	ЗаполнитьЗначенияСвойств(НСтрока,выборка);	
		//	
		//КонецЦикла;  		
		
	КонецЦикла;
	
	Пока ВыборкаИтоги.Следующий() Цикл
		
		Запрос = Новый Запрос; 
		Запрос.МенеджерВременныхТаблиц = МенеджерВременнныхТаблиц; 
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	ВТАктивныеЗНБВБлокировках.Блокировка КАК Блокировка
		|ПОМЕСТИТЬ ВТБлокировкиПОЗНБ1
		|ИЗ
		|	ВТАктивныеЗНБВБлокировках КАК ВТАктивныеЗНБВБлокировках
		|ГДЕ
		|	ВТАктивныеЗНБВБлокировках.ЗНБ = &ЗНБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыБлок.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТТоварыБлокировки
		|ИЗ
		|	Документ.БлокировкаВыдачиВНабор.Номенклатура КАК ТоварыБлок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТБлокировкиПОЗНБ1 КАК ВТБлокировкиПОЗНБ
		|		ПО (ВТБлокировкиПОЗНБ.Блокировка = ТоварыБлок.Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТАктивныеЗНБВБлокировках.номенклатура КАК номенклатура
		|ИЗ
		|	ВТАктивныеЗНБВБлокировках КАК ВТАктивныеЗНБВБлокировках
		|ГДЕ
		|	ВТАктивныеЗНБВБлокировках.ЗНБ = &ЗНБ
		|	И НЕ ВТАктивныеЗНБВБлокировках.номенклатура В ИЕРАРХИИ
		|				(ВЫБРАТЬ
		|					ВТТоварыБлокировки.Номенклатура
		|				ИЗ
		|					ВТТоварыБлокировки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТБлокировкиПОЗНБ1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТТоварыБлокировки"; 
		
		Запрос.УстановитьПараметр("ЗНБ",ВыборкаИтоги.ЗНБ);
		МассивТоваровЗНБ =  Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("номенклатура"); 
		
		Для каждого ВыборкаБлокировки Из ТЗБлокировки Цикл
			//	
			//Если ВыборкаБлокировки.Склад = ВыборкаИтоги.ЗНБ.Склад
				//ИЛИ ВыборкаБлокировки.Склад = ВыборкаИтоги.ЗНБ.Склад.ФизическийСклад Тогда
				
				Запрос = Новый запрос; 
				Запрос.МенеджерВременныхТаблиц = МенеджерВременнныхТаблиц; 
				
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ВТАктивныеЗНБ.Номенклатура КАК Номенклатура
				|ПОМЕСТИТЬ ВТТоварыЗНБ
				|ИЗ
				|	ВТАктивныеЗНБ КАК ВТАктивныеЗНБ
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСклады
				|		ПО (СпрСклады.Ссылка = ВТАктивныеЗНБ.Склад)
				|ГДЕ
				|	ВТАктивныеЗНБ.ЗНБ = &ЗНБ
				|	И ВТАктивныеЗНБ.Номенклатура В(&МассивТоваров)
				|	И (СпрСклады.Ссылка = &Склад
				|			ИЛИ СпрСклады.ФизическийСклад = &Склад)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВТБлокировки.Номенклатура КАК Номенклатура
				|ПОМЕСТИТЬ ВТТоварыБлокировки
				|ИЗ
				|	ВТБлокировки КАК ВТБлокировки
				|ГДЕ
				|	ВТБлокировки.Блокировка = &Блокировка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	номенклатура.Ссылка КАК номенклатура
				|ПОМЕСТИТЬ ВТТоварыБлокировкиЭлементы
				|ИЗ
				|	Справочник.Номенклатура КАК номенклатура
				|ГДЕ
				|	номенклатура.Ссылка В ИЕРАРХИИ
				|			(ВЫБРАТЬ
				|				ВТТоварыБлокировки.Номенклатура
				|			ИЗ
				|				ВТТоварыБлокировки)
				|	И НЕ номенклатура.ЭтоГруппа
				|	И НЕ номенклатура.ПометкаУдаления
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВТТоварыЗНБ.Номенклатура КАК Номенклатура
				|ИЗ
				|	ВТТоварыЗНБ КАК ВТТоварыЗНБ
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТоварыБлокировкиЭлементы КАК ВТТоварыБлокировкиЭлементы
				|		ПО ВТТоварыЗНБ.Номенклатура = ВТТоварыБлокировкиЭлементы.номенклатура
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ВТТоварыЗНБ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ВТТоварыБлокировки
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ВТТоварыБлокировкиЭлементы";
				Запрос.УстановитьПараметр("ЗНБ",ВыборкаИтоги.ЗНБ);
				Запрос.УстановитьПараметр("Склад",ВыборкаБлокировки.Склад);
				Запрос.УстановитьПараметр("Блокировка",ВыборкаБлокировки.Блокировка); 
				Запрос.УстановитьПараметр("МассивТоваров",МассивТоваровЗНБ);
				Выборка = Запрос.Выполнить().Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					НСтрока = ТЧАктивныеЗНБ.Добавить(); 	
					ЗаполнитьЗначенияСвойств(НСтрока,выборка);	
					НСтрока.ЗНБ = ВыборкаИтоги.ЗНБ; 
					НСтрока.Блокировка = ВыборкаБлокировки.Блокировка;
					
				КонецЦикла;
				
				
			//КонецЕсли;
		КонецЦикла;
		//ВыборкаБлокировки.Сбросить(); 
		//ВыборкаОстИсключения = Запрос.Выполнить().Выбрать(); 
		//Пока ВыборкаОстИсключения Цикл
		//	
		//	НСтрока = ТЧАктивныеЗНБ.Добавить(); 	
		//	ЗаполнитьЗначенияСвойств(НСтрока,выборка);	
		//	НСтрока.ЗНБ = ВыборкаИтоги.ЗНБ; 
		//	
		//КонецЦикла;
	КонецЦикла;
	
	ТЧАктивныеЗНБПроходныеРНК.Свернуть("Блокировка1,ЗНББлок,ЗНБАктивное"); 
	
	Результат = Новый Структура("ТЧАктивныеЗНБ,ТЧАктивныеЗНБПроходныеРНК",ТЧАктивныеЗНБ,ТЧАктивныеЗНБПроходныеРНК); 
	Возврат Результат; 

КонецФункции

&НаСервере
Процедура ОбновитьНаСервере()
	// все активные блокировки на тек. дату. 
	ТекущаяДатаОтбор = ТекущаяДата(); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БлокировкаВыдачиВНаборСрезПоследних.Склад КАК Склад,
		|	БлокировкаВыдачиВНаборСрезПоследних.Номенклатура КАК Номенклатура,
		|	БлокировкаВыдачиВНаборСрезПоследних.Регистратор КАК Блокировка,
		|	БлокировкаВыдачиВНаборСрезПоследних.Период КАК Датаначала
		|ПОМЕСТИТЬ ВТБлокировки
		|ИЗ
		|	РегистрСведений.БлокировкаВыдачиВНабор.СрезПоследних(, ) КАК БлокировкаВыдачиВНаборСрезПоследних
		|ГДЕ
		|	БлокировкаВыдачиВНаборСрезПоследних.Активен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТБлокировки.Склад КАК Склад,
		|	ВТБлокировки.Номенклатура КАК Номенклатура,
		|	Инвентаризация.Ссылка КАК ИНВ,
		|	Инвентаризация.Дата КАК ДатаИНВ
		|ПОМЕСТИТЬ ВТИнвВсе
		|ИЗ
		|	Документ.Инвентаризация КАК Инвентаризация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Инвентаризация.Товары КАК ИнвентаризацияТовары
		|		ПО Инвентаризация.Ссылка = ИнвентаризацияТовары.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТБлокировки КАК ВТБлокировки
		|		ПО (Инвентаризация.Склад = ВЫБОР
		|				КОГДА ВТБлокировки.Склад.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ВидСклада.Физический)
		|					ТОГДА ВТБлокировки.Склад
		|				ИНАЧЕ ВТБлокировки.Склад.ФизическийСклад
		|			КОНЕЦ)
		|			И Инвентаризация.Дата >= ВТБлокировки.Блокировка.Дата
		|ГДЕ
		|	Инвентаризация.Проведен
		|	И ИнвентаризацияТовары.Номенклатура В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				ВТБлокировки.Номенклатура
		|			ИЗ
		|				ВТБлокировки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИнвВсе.Склад КАК Склад,
		|	ВТИнвВсе.Номенклатура КАК Номенклатура,
		|	ВТИнвВсе.ИНВ КАК ИНВ
		|ПОМЕСТИТЬ ВТИнв
		|ИЗ
		|	ВТИнвВсе КАК ВТИнвВсе
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВТИнвВсе.Склад КАК Склад,
		|			ВТИнвВсе.Номенклатура КАК Номенклатура,
		|			МАКСИМУМ(ВТИнвВсе.ДатаИНВ) КАК ДатаИНВ
		|		ИЗ
		|			ВТИнвВсе КАК ВТИнвВсе
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВТИнвВсе.Склад,
		|			ВТИнвВсе.Номенклатура) КАК ВложенныйЗАпрос
		|		ПО ВТИнвВсе.Склад = ВложенныйЗАпрос.Склад
		|			И ВТИнвВсе.Номенклатура = ВложенныйЗАпрос.Номенклатура
		|			И ВТИнвВсе.ДатаИНВ = ВложенныйЗАпрос.ДатаИНВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТБлокировки.Склад КАК Склад,
		|	ВТБлокировки.Номенклатура КАК Номенклатура,
		|	ВТБлокировки.Блокировка КАК Блокировка,
		|	ВТБлокировки.Датаначала КАК Датаначала,
		|	ЕСТЬNULL(ВТИнв.ИНВ, ЗНАЧЕНИЕ(Документ.Инвентаризация.пустаяссылка)) КАК ИНВ,
		|	ЕСТЬNULL(БлокировкаВыдачиВНаборЗНБ.ЗаданиеНабора, ЗНАЧЕНИЕ(Документ.ЗаданиеНабора.пустаяссылка)) КАК ЗНБ
		|ИЗ
		|	ВТБлокировки КАК ВТБлокировки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнвВсе КАК ВТИнв
		|		ПО ВТБлокировки.Склад = ВТИнв.Склад
		|			И ВТБлокировки.Номенклатура = ВТИнв.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.БлокировкаВыдачиВНабор.ЗНБ КАК БлокировкаВыдачиВНаборЗНБ
		|		ПО ВТБлокировки.Блокировка = БлокировкаВыдачиВНаборЗНБ.Ссылка
		|			И (БлокировкаВыдачиВНаборЗНБ.ЗаданиеНабора.Склад = ВТБлокировки.Склад
		|				ИЛИ БлокировкаВыдачиВНаборЗНБ.ЗаданиеНабора.Склад.ФизическийСклад = ВТБлокировки.Склад)
		|ИТОГИ
		|	МАКСИМУМ(Блокировка),
		|	МАКСИМУМ(Датаначала),
		|	МАКСИМУМ(ИНВ)
		|ПО
		|	Склад,
		|	Номенклатура";
	Запрос.УстановитьПараметр("СостояниеНакладной",Перечисления.СостоянияНакладной.Отгружена); 
	РезультатЗапроса = Запрос.Выполнить();
	
	ДеревоАктивныеБлокировки = РеквизитФормыВЗначение("АктивныеБлокировки",Тип("ДеревоЗначений")); 
	ДеревоАктивныеБлокировки.Строки.очистить(); 
	
	ВыборкаИтоги = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	Пока ВыборкаИтоги.Следующий() Цикл
	
		Уровень1 = ДеревоАктивныеБлокировки.Строки.Добавить(); 
		Уровень1.Склад  = ВыборкаИтоги.Склад; 
		
		ВыборкаИтоги2 = ВыборкаИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		
		Пока ВыборкаИтоги2.Следующий() Цикл
		
			Уровень2 = Уровень1.Строки.Добавить(); 
			Уровень2.Номенклатура = ВыборкаИтоги2.Номенклатура; 
			Уровень2.Блокировка = ВыборкаИтоги2.блокировка; 
			//Уровень2.ИНВ = ВыборкаИтоги2.ИНВ; 
			Уровень2.Датаначала = ВыборкаИтоги2.ДатаНачала;
			//Если ЗначениеЗаполнено(Уровень2.ИНВ) Тогда
			//
			//	Уровень2.Пометка = Истина;
			//	
			//	Уровень1.Пометка = Истина; 
			//
			//КонецЕсли;
			
			ВыборкаДетальные =  ВыборкаИтоги2.Выбрать(); 
			
			Пока ВыборкаДетальные.Следующий() Цикл
				
				Если ЗначениеЗаполнено(ВыборкаДетальные.ИНВ) Тогда
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ ПЕРВЫЕ 1
					|	ИнвентаризацияТовары.Ссылка КАК Ссылка
					|ИЗ
					|	Документ.Инвентаризация.Товары КАК ИнвентаризацияТовары
					|ГДЕ
					|	ИнвентаризацияТовары.Ссылка = &Ссылка
					|	И ИнвентаризацияТовары.Номенклатура В ИЕРАРХИИ(&Номенклатура)";
					
					Запрос.УстановитьПараметр("Номенклатура", ВыборкаИтоги2.Номенклатура);
					Запрос.УстановитьПараметр("Ссылка", ВыборкаДетальные.ИНВ);
					
					РезультатЗапроса1 = Запрос.Выполнить();
					
					Если НЕ РезультатЗапроса1.Пустой() Тогда
						
						Уровень2.ИНВ = ВыборкаДетальные.ИНВ;						 	
						
					КонецЕсли;	
					
				КонецЕсли;

				Если ЗначениеЗаполнено( ВыборкаДетальные.ЗНБ) Тогда
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ ПЕРВЫЕ 1
					|	ЗаданиеНабораТовары.Ссылка КАК Ссылка
					|ИЗ
					|	Документ.ЗаданиеНабора.Товары КАК ЗаданиеНабораТовары
					|ГДЕ
					|	ЗаданиеНабораТовары.Ссылка = &Ссылка
					|	И ЗаданиеНабораТовары.Номенклатура В ИЕРАРХИИ(&Номенклатура)";
					
					Запрос.УстановитьПараметр("Номенклатура", ВыборкаИтоги2.Номенклатура);
					Запрос.УстановитьПараметр("Ссылка", ВыборкаДетальные.ЗНБ);
					
					РезультатЗапроса1 = Запрос.Выполнить();
					
					Если НЕ РезультатЗапроса1.Пустой() Тогда
						
						Уровень3 = Уровень2.Строки.Добавить(); 
						Уровень3.ЗНБ =  ВыборкаДетальные.ЗНБ; 	
						
					КонецЕсли;
					
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если ЗначениеЗаполнено(Уровень2.ИНВ) Тогда
				
				Уровень2.Пометка = Истина;
				
				Уровень1.Пометка = Истина; 
				
			КонецЕсли;

		КонецЦикла;
	
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоАктивныеБлокировки,"АктивныеБлокировки"); 

КонецПроцедуры
&НаСервере
Процедура ЗаполнитьДанныеФормы()
	
	БезУчетаБлокировок = Истина; 
	НаДату = ТекущаяДата(); 
	ДатаНачалаБлокировкиFBS = НаДату - 12 * 3600;
	Элементы.ОтборНоменклатура.Видимость = БезУчетаБлокировок;
	//ПериодОтчет1.ДатаНачала 	= НачалоДня(ТекущаяДата()); 
	//ПериодОтчет1.ДатаОкончания 	= КонецДня(ТекущаяДата());
	//
	//ПериодОтчет2.ДатаНачала 	= НачалоДня(ТекущаяДата());
	//ПериодОтчет2.ДатаОкончания 	= КонецДня(ТекущаяДата());
КонецПроцедуры

&НаСервере
Функция СоздатьБлокировкуНаСервере()
	
	РезультатПроверки = ПроверитьДействующиеБлокировкиНаДату();
	
	Если  НЕ РезультатПроверки.Успех Тогда
		
		Сообщить(СтрСоединить(РезультатПроверки.Ошибки,Символы.ПС)); 
		Возврат Неопределено; 
		
	КонецЕсли; 
	
	НовыйДокумент = Документы.БлокировкаВыдачиВНабор.СоздатьДокумент();
	НовыйДокумент.Дата = ТекущаяДата(); 
	НовыйДокумент.Автор = ПараметрыСеанса.Пользователь;
	Если ЗначениеЗаполнено(ДатаНачалаБлокировкиFBS) Тогда
	
		НовыйДокумент.ДатаНачалаБлокировкиFBS = ДатаНачалаБлокировкиFBS; 	
	
	КонецЕсли;
	Для каждого ЭлСписка Из Номенклатура Цикл
	
		НоваяСтрока = НовыйДокумент.Номенклатура.Добавить(); 
	    НоваяСтрока.Номенклатура = ЭлСписка.Значение; 
		
	КонецЦикла;
	
	Для каждого ЭлСписка Из Склады Цикл
	
		НоваяСтрока = НовыйДокумент.Склады.Добавить(); 
	    НоваяСтрока.Склад = ЭлСписка.Значение; 
		
	КонецЦикла;
	//НовыйДокумент.Номенклатура.ЗагрузитьКолонку(Номенклатура.ВыгрузитьЗначения(),"номенклатура");  
	//НовыйДокумент.Склады.ЗагрузитьКолонку(Склады.ВыгрузитьЗначения(),"Склад");
	
	//СтрТЧ = НовыйДокумент.ВремяДействия.Добавить();
	//СтрТЧ.ДатаНачала = НаДату;
	
	НовыйДокумент.ДатаНачала  = НаДату; 
	Попытка
		Если ЗначениеЗаполнено(ДатаНачалаБлокировкиFBS) Тогда 
			НовыйДокумент.ДополнительныеСвойства.Вставить("НеПерезаписыватьДатуFBS",истина); 
		КонецЕсли;
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	     
	Исключение
	    Сообщить(ОписаниеОшибки()); 
	КонецПопытки;
	 
	Возврат НовыйДокумент.Ссылка; 
КонецФункции  

&НаСервере
Функция ПроверитьДействующиеБлокировкиНаДату()
    РезультатПроверки = Новый Структура("Успех,Ошибки",истина,новый Массив); 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БлокировкаВыдачиВНаборСрезПоследних.Склад КАК Склад,
		|	БлокировкаВыдачиВНаборСрезПоследних.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.БлокировкаВыдачиВНабор.СрезПоследних(
		|			&НаДату,
		|			Склад В (&Склады)
		|				И Номенклатура В ИЕРАРХИИ (&Номенклатура)) КАК БлокировкаВыдачиВНаборСрезПоследних
		|ГДЕ
		|	БлокировкаВыдачиВНаборСрезПоследних.Активен";
	
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("Склады", Склады.ВыгрузитьЗначения());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	МассивОшибок = Новый Массив; 
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекстОш = СтрШаблон("Есть активные блокировки по выбранным ""склад + номенклатура"": %1 - %2",ВыборкаДетальныеЗаписи.Склад,ВыборкаДетальныеЗаписи.номенклатура); 
		МассивОшибок.Добавить(ТекстОш); 
	КонецЦикла;
	РезультатПроверки.Успех = МассивОшибок.Количество() = 0; 
	РезультатПроверки.Ошибки = МассивОшибок; 
	
	Возврат РезультатПроверки; 

КонецФункции // ПроверитьДействующиеБлокировкиНаДату()

&НаКлиенте
Процедура АктивныеБлокировкиПометкаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.АктивныеБлокировки.ТекущиеДанные;
	//Данилова Е.В. 20.02.2026 HELP-8893
	ПриИзмененииПометки(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПометки(Знач ТекущиеДанные)   	
	
	Если ТекущиеДанные.ПолучитьРодителя() = неопределено Тогда
		
		Для каждого ТекЭлемент Из ТекущиеДанные.ПолучитьЭлементы() Цикл
			
			ТекЭлемент.Пометка = ТекущиеДанные.Пометка; 
			
		КонецЦикла;	
	Иначе 
		МеткаРодителя = ТекущиеДанные.Пометка; 
		РодительСтроки = ТекущиеДанные.ПолучитьРодителя();
		МеткаРодителяТек = РодительСтроки.Пометка;
		КоличествоЭл = РодительСтроки.ПолучитьЭлементы().Количество();
		Сч = 0; 
		Для каждого ЭлСтроки Из РодительСтроки.ПолучитьЭлементы() Цикл
			
			Если ЭлСтроки.Пометка = ТекущиеДанные.Пометка Тогда
				
				Сч = Сч + 1;  
				
			КонецЕсли;	
			
		КонецЦикла;
		Если КоличествоЭл = Сч Тогда
			
			РодительСтроки.Пометка = МеткаРодителя;	
			
		КонецЕсли;
		Если МеткаРодителя
			И КоличествоЭл <> Сч Тогда
			
			РодительСтроки.Пометка = истина; 
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АктивныеБлокировкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура АктивныеБлокировкиПриАктивизацииПоля(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ЗавершитьБлокировкиНаСервере() 
	ДатаЗавершения = ТекущаяДата(); 
	АктБлокировкиДерево = РеквизитФормыВЗначение("АктивныеБлокировки",Тип("ДеревоЗначений"));
	
	Блокировки = Новый Массив; 
	Для каждого Уровень1  Из АктБлокировкиДерево.Строки Цикл
		Если НЕ Уровень1.Пометка Тогда
			
			Продолжить; 
			
		КонецЕсли;
		Для каждого Уровень2 Из Уровень1.Строки Цикл
			Если НЕ Уровень2.Пометка Тогда
				
				Продолжить; 
				
			КонецЕсли;
			//проверим после 
			//Если ЗначениеЗаполнено(Уровень2.ИНВ)
			//	И Уровень2.ИНВ.СостояниеНакладной <> Перечисления.СостоянияНакладной.Отгружена Тогда
			//
			//	Продолжить; 	
			//
			//КонецЕсли;
			
			Если ЗначениеЗаполнено(Уровень2.Блокировка)
				 И Блокировки.Найти(Уровень2.Блокировка) = Неопределено Тогда
			
				 Блокировки.Добавить(Уровень2.Блокировка); 
			
			КонецЕсли;
			
		 КонецЦикла;
	
	 КонецЦикла;
	 НачатьТранзакцию(); 
	 Для каждого БлокировкаДок Из Блокировки Цикл
		 
		 РезультатПроверки = ЕстьНеЗавершИНВПоБлокировке(БлокировкаДок);
		 
		 Если  РезультатПроверки Тогда
			 
			 ТекстСооб = СтрШаблон("По блокировке %1 есть незавершенные ИНВ",БлокировкаДок.ссылка); 
		    Сообщить(ТекстСооб); 
		 	Продолжить; 	
		 
		 КонецЕсли;
		 
		 БлокировкаДокОбъект = БлокировкаДок.ПолучитьОбъект(); 
		 // СтрокиНеЗаверш = БлокировкаДокОбъект.ВремяДействия.НайтиСтроки(Новый Структура("ДатаОкончания",дата(1,1,1))); 
		 
		 //Для каждого СтрокаНеЗаверш  Из  СтрокиНеЗаверш Цикл
		 Если ДатаЗавершения <= БлокировкаДокОбъект.ДатаНачала Тогда
			 
			 БлокировкаДокОбъект.ДатаНачала = ДатаЗавершения - 1; 	
			 
		 КонецЕсли;
		 БлокировкаДокОбъект.ДатаОкончания = ДатаЗавершения; 
		 
		 //КонецЦикла;		 
		 
		 БлокировкаДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		 Сообщить("К закрытию блокировка " + Строка(БлокировкаДокОбъект.ссылка)); 
	 КонецЦикла;
	 Если  ТранзакцияАктивна() Тогда
		 
		 ЗафиксироватьТранзакцию();	
		 
	 КонецЕсли;
	 
	 
	
	
КонецПроцедуры

&НаСервере
Функция ЕстьНеЗавершИНВПоБлокировке(Знач ДокБлокировки)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БлокировкаВыдачиВНаборСрезПоследних.Склад КАК Склад,
		|	БлокировкаВыдачиВНаборСрезПоследних.Номенклатура КАК Номенклатура,
		|	БлокировкаВыдачиВНаборСрезПоследних.Регистратор КАК Блокировка,
		|	БлокировкаВыдачиВНаборСрезПоследних.Период КАК Датаначала
		|ПОМЕСТИТЬ ВТБлокировки
		|ИЗ
		|	РегистрСведений.БлокировкаВыдачиВНабор.СрезПоследних(, ) КАК БлокировкаВыдачиВНаборСрезПоследних
		|ГДЕ
		|	БлокировкаВыдачиВНаборСрезПоследних.Активен
		|	И БлокировкаВыдачиВНаборСрезПоследних.Регистратор = &Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТБлокировки.Склад КАК Склад,
		|	ВТБлокировки.Номенклатура КАК Номенклатура,
		|	Инвентаризация.Ссылка КАК ИНВ
		|ПОМЕСТИТЬ ВТИнв
		|ИЗ
		|	Документ.Инвентаризация КАК Инвентаризация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Инвентаризация.Товары КАК ИнвентаризацияТовары
		|		ПО Инвентаризация.Ссылка = ИнвентаризацияТовары.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТБлокировки КАК ВТБлокировки
		|		ПО (Инвентаризация.Склад = ВЫБОР
		|				КОГДА ВТБлокировки.Склад.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ВидСклада.Физический)
		|					ТОГДА ВТБлокировки.Склад
		|				ИНАЧЕ ВТБлокировки.Склад.ФизическийСклад
		|			КОНЕЦ)
		|ГДЕ
		|	Инвентаризация.Проведен
		|	И Инвентаризация.СостояниеНакладной <> &СостояниеНакладной
		|	И ИнвентаризацияТовары.Номенклатура В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				ВТБлокировки.Номенклатура
		|			ИЗ
		|				ВТБлокировки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТБлокировки.Блокировка КАК Блокировка
		|ИЗ
		|	ВТБлокировки КАК ВТБлокировки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТИнв КАК ВТИнв
		|		ПО ВТБлокировки.Склад = ВТИнв.Склад
		|			И ВТБлокировки.Номенклатура = ВТИнв.Номенклатура";
	
	Запрос.УстановитьПараметр("Регистратор", ДокБлокировки);
	Запрос.УстановитьПараметр("СостояниеНакладной", Перечисления.СостоянияНакладной.Отгружена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой(); 

КонецФункции // ПроверитьНеЗавершенныеИНВПоБлокировке()

&НаКлиенте
Процедура АктивныеБлокировкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура НаДатуПриИзменении(Элемент)
	Если НаДату < ТекущаяДата() Тогда
		
		НаДату = ТекущаяДата() + 1; 	
		
	КонецЕсли;
	ДатаНачалаБлокировкиFBS = НаДату - 12 * 3600; 
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ПроставитьПометки(Флаг)

	ПроставитьПометкиРек(АктивныеБлокировки.ПолучитьЭлементы(),Флаг,2,1); 

КонецПроцедуры // ПроставитьПометки()
&НаКлиенте
Процедура ПроставитьПометкиРек(СтрокаУровня,Флаг,МаксКолУровней,Уровень)
	Если  Уровень > МаксКолУровней Тогда
	
		Возврат; 	
	
	КонецЕсли; 
	
	Если СтрокаУровня.Количество() > 0  Тогда
		
		Для каждого СтрУров  Из СтрокаУровня Цикл
			
			 СтрУров.Пометка = Флаг; 
			 
			 ПроставитьПометкиРек(СтрУров.ПолучитьЭлементы(),Флаг,МаксКолУровней,Уровень + 1); 
			
		КонецЦикла;
		
		
	КонецЕсли; 
	
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура РазвернутьДерево()

	ЭлементыДерева = АктивныеБлокировки.ПолучитьЭлементы(); 
	
	Для каждого ЭлементДерева Из ЭлементыДерева Цикл
	
		Элементы.АктивныеБлокировки.Развернуть(ЭлементДерева.ПолучитьИдентификатор(),Истина); 
	
	КонецЦикла; 
	

КонецПроцедуры // РазвернутьДерево()


&НаКлиенте
Процедура СвернутьДерево()

	ЭлементыДерева = АктивныеБлокировки.ПолучитьЭлементы(); 
	
	Для каждого ЭлементДерева Из ЭлементыДерева Цикл
	
		Элементы.АктивныеБлокировки.Свернуть(ЭлементДерева.ПолучитьИдентификатор()); 
	
	КонецЦикла; 
	

КонецПроцедуры

&НаКлиенте
Процедура СвернутьДеревоПоСтроке(Команда)
	ТекущиеДанные = Элементы.АктивныеБлокировки.ТекущиеДанные;
	Элементы.АктивныеБлокировки.Свернуть(ТекущиеДанные.ПолучитьИдентификатор());
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоПоСтроке(Команда)
	ТекущиеДанные = Элементы.АктивныеБлокировки.ТекущиеДанные;
	Элементы.АктивныеБлокировки.Развернуть(ТекущиеДанные.ПолучитьИдентификатор(),Ложь);
КонецПроцедуры

&НаСервере
Функция СформироватьОтчет1НаСервере() 
	Если БезУчетаБлокировок Тогда 
		ТЗ = СформитьТаблицуИсточникНетАктивныхЗНББезУчетаБлокировок();
		
		Об = РеквизитФормыВЗначение("Объект");
		ТабДок = Об.СформироватьТабДокНоменклатураБезАктивныхЗНББезУчетаБлокировок(ТЗ);
	Иначе 
		ТЗ = СформитьТаблицуИсточникНетАктивныхЗНБ();
		
		Об = РеквизитФормыВЗначение("Объект");
		ТабДок = Об.СформироватьТабДокНоменклатураБезАктивныхЗНБ(ТЗ);
	КонецЕсли;
	Возврат ТабДок;
КонецФункции

&НаСервере
Функция СформитьТаблицуИсточникНетАктивныхЗНБ()
	
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БлокировкаВыдачиВНаборСрезПоследних.Склад КАК Склад,
	|	БлокировкаВыдачиВНаборСрезПоследних.Номенклатура КАК Номенклатура,
	|	БлокировкаВыдачиВНаборСрезПоследних.Регистратор КАК Блокировка,
	|	БлокировкаВыдачиВНаборСрезПоследних.Период КАК Датаначала
	|ПОМЕСТИТЬ ВТБлокировки
	|ИЗ
	|	РегистрСведений.БлокировкаВыдачиВНабор.СрезПоследних(&НаДату, ) КАК БлокировкаВыдачиВНаборСрезПоследних
	|ГДЕ
	|	БлокировкаВыдачиВНаборСрезПоследних.Активен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Склады.Склад КАК Ссылка
	|ПОМЕСТИТЬ ВТСкладыБлок
	|ИЗ
	|	ВТБлокировки КАК Склады
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Склады.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТСклады
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	(Склады.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТСкладыБлок.Ссылка
	|				ИЗ
	|					ВТСкладыБлок)
	|			ИЛИ Склады.ФизическийСклад В
	|				(ВЫБРАТЬ
	|					ВТСкладыБлок.Ссылка
	|				ИЗ
	|					ВТСкладыБлок))
	|	И НЕ Склады.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТТовары
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ПометкаУдаления
	|	И Номенклатура.Ссылка В ИЕРАРХИИ
	|			(ВЫБРАТЬ
	|				ВТБлокировки.Номенклатура
	|			ИЗ
	|				ВТБлокировки)
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И НЕ Номенклатура.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаданиеНабора.Ссылка КАК ЗНБ,
	|	ЗаданиеНабора.Склад КАК Склад,
	|	ЗаданиеНабораТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТАктивныеЗНБ
	|ИЗ
	|	Документ.ЗаданиеНабора.Товары КАК ЗаданиеНабораТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНабора КАК ЗаданиеНабора
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСклады КАК ВТСклады
	|			ПО ЗаданиеНабора.Склад = ВТСклады.Ссылка
	|		ПО ЗаданиеНабораТовары.Ссылка = ЗаданиеНабора.Ссылка
	|ГДЕ
	|	ЗаданиеНабора.СостояниеНакладной В(&СостоянияЗНБ)
	|	И ЗаданиеНабораТовары.Номенклатура В
	|			(ВЫБРАТЬ
	|				ВТТовары.Ссылка
	|			ИЗ
	|				ВТТовары КАК ВТТовары)
	|	И ЗаданиеНабора.Накладная.СостояниеНакладной <> &Отгружена
	|	И ЗаданиеНабора.Накладная.Проведен
	|	И ЗаданиеНабора.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	БлокировкаВыдачиВНаборЗНБ.ЗаданиеНабора КАК ЗНБ,
	|	БлокировкаВыдачиВНаборЗНБ.Ссылка КАК Блокировка
	|ПОМЕСТИТЬ ВТБлокировкиПоЗНБ
	|ИЗ
	|	РегистрСведений.БлокировкаВыдачиВНабор.СрезПоследних(&НаДату, ) КАК БлокировкаВыдачиВНаборСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.БлокировкаВыдачиВНабор.ЗНБ КАК БлокировкаВыдачиВНаборЗНБ
	|		ПО БлокировкаВыдачиВНаборСрезПоследних.Регистратор = БлокировкаВыдачиВНаборЗНБ.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАктивныеЗНБ КАК ВТАктивныеЗНБ
	|		ПО (ВТАктивныеЗНБ.ЗНБ = БлокировкаВыдачиВНаборЗНБ.ЗаданиеНабора)
	|ГДЕ
	|	БлокировкаВыдачиВНаборСрезПоследних.Активен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТАктивныеЗНБ.ЗНБ КАК ЗНБ,
	|	ВТАктивныеЗНБ.Склад КАК Склад,
	|	ВТБлокировкиПоЗНБ.Блокировка КАК Блокировка,
	|	ВТАктивныеЗНБ.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТАктивныеЗНБВБлокировках
	|ИЗ
	|	ВТАктивныеЗНБ КАК ВТАктивныеЗНБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБлокировкиПоЗНБ КАК ВТБлокировкиПоЗНБ
	|		ПО ВТАктивныеЗНБ.ЗНБ = ВТБлокировкиПоЗНБ.ЗНБ
	|ГДЕ
	|	НЕ ВТБлокировкиПоЗНБ.Блокировка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТАктивныеЗНБ.ЗНБ КАК ЗНБ,
	|	ВТАктивныеЗНБ.Номенклатура КАК Номенклатура
	|ИЗ
	|	ВТАктивныеЗНБ КАК ВТАктивныеЗНБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБлокировкиПоЗНБ КАК ВТБлокировкиПоЗНБ
	|		ПО ВТАктивныеЗНБ.ЗНБ = ВТБлокировкиПоЗНБ.ЗНБ
	|ГДЕ
	|	ВТБлокировкиПоЗНБ.Блокировка ЕСТЬ NULL
	|ИТОГИ ПО
	|	ЗНБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТАктивныеЗНБВБлокировках.ЗНБ КАК ЗНБ
	|ИЗ
	|	ВТАктивныеЗНБВБлокировках КАК ВТАктивныеЗНБВБлокировках
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТБлокировки.Блокировка КАК Блокировка,
	|	ВТБлокировки.Склад КАК Склад
	|ИЗ
	|	ВТБлокировки КАК ВТБлокировки";
	
	СостоянияЗНБ = Новый Массив; 
	СостоянияЗНБ.Добавить(Перечисления.СостоянияНакладной.ОжиданиеНабора); 
	СостоянияЗНБ.Добавить(Перечисления.СостоянияНакладной.ВНаборе);
	Запрос.УстановитьПараметр("СостоянияЗНБ", СостоянияЗНБ);
	Запрос.УстановитьПараметр("Отгружена", Перечисления.СостоянияНакладной.Отгружена);
	запрос.УстановитьПараметр("НаДату",?(НЕ ЗначениеЗаполнено(ПериодОтчет1),ТекущаяДата(),ПериодОтчет1)); 
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	ВыборкаАКтЗНБ = ПакетЗапросов[7].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	
	ВыборкаИтоги = ПакетЗапросов[8].Выбрать();
	
	ТЗБлокировки =  ПакетЗапросов[9].Выгрузить();
	
	МенеджерВременнныхТаблиц = Запрос.МенеджерВременныхТаблиц; 
	
	ТЧАктивныеЗНБ = новый ТаблицаЗначений; 
	ТЧАктивныеЗНБ.Колонки.Добавить("ЗНБ",новый ОписаниеТипов("ДокументСсылка.ЗаданиеНабора"));
	ТЧАктивныеЗНБ.Колонки.Добавить("Номенклатура",новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЧАктивныеЗНБ.Колонки.Добавить("Блокировка",новый ОписаниеТипов("ДокументСсылка.БлокировкаВыдачиВНабор"));
	
	Пока ВыборкаАКтЗНБ.Следующий() Цикл  
		
		
		Для каждого ВыборкаБлокировки Из ТЗБлокировки Цикл
			//	
			//Если ВыборкаБлокировки.Склад = ВыборкаАКтЗНБ.ЗНБ.Склад 
			//ИЛИ ВыборкаБлокировки.Склад = ВыборкаАКтЗНБ.ЗНБ.Склад.ФизическийСклад Тогда
			Запрос = Новый запрос; 
			Запрос.МенеджерВременныхТаблиц = МенеджерВременнныхТаблиц; 
			
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВТАктивныеЗНБ.Номенклатура КАК Номенклатура
			|ПОМЕСТИТЬ ВТТоварыЗНБ
			|ИЗ
			|	ВТАктивныеЗНБ КАК ВТАктивныеЗНБ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСклады
			|		ПО (СпрСклады.Ссылка = ВТАктивныеЗНБ.Склад)
			|ГДЕ
			|	ВТАктивныеЗНБ.ЗНБ = &ЗНБ
			|	И (СпрСклады.Ссылка = &Склад
			|			ИЛИ СпрСклады.ФизическийСклад = &Склад)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТБлокировки.Номенклатура КАК Номенклатура
			|ПОМЕСТИТЬ ВТТоварыБлокировки
			|ИЗ
			|	ВТБлокировки КАК ВТБлокировки
			|ГДЕ
			|	ВТБлокировки.Блокировка = &Блокировка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	номенклатура.Ссылка КАК номенклатура
			|ПОМЕСТИТЬ ВТТоварыБлокировкиЭлементы
			|ИЗ
			|	Справочник.Номенклатура КАК номенклатура
			|ГДЕ
			|	номенклатура.Ссылка В ИЕРАРХИИ
			|			(ВЫБРАТЬ
			|				ВТТоварыБлокировки.Номенклатура
			|			ИЗ
			|				ВТТоварыБлокировки)
			|	И НЕ номенклатура.ЭтоГруппа
			|	И НЕ номенклатура.ПометкаУдаления
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТТоварыЗНБ.Номенклатура КАК Номенклатура
			|ИЗ
			|	ВТТоварыЗНБ КАК ВТТоварыЗНБ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТоварыБлокировкиЭлементы КАК ВТТоварыБлокировкиЭлементы
			|		ПО ВТТоварыЗНБ.Номенклатура = ВТТоварыБлокировкиЭлементы.номенклатура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТТоварыЗНБ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТТоварыБлокировки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТТоварыБлокировкиЭлементы";
			Запрос.УстановитьПараметр("ЗНБ",ВыборкаАКтЗНБ.ЗНБ); 
			Запрос.УстановитьПараметр("Склад",ВыборкаБлокировки.Склад); 
			Запрос.УстановитьПараметр("Блокировка",ВыборкаБлокировки.Блокировка);
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				НСтрока = ТЧАктивныеЗНБ.Добавить(); 	
				ЗаполнитьЗначенияСвойств(НСтрока,выборка);	
				НСтрока.ЗНБ = ВыборкаАКтЗНБ.ЗНБ; 
				НСтрока.Блокировка = ВыборкаБлокировки.Блокировка;
				
			КонецЦикла;
			
			
			
			//КонецЕсли;
			
		КонецЦикла; 		
	КонецЦикла;
	
	Пока ВыборкаИтоги.Следующий() Цикл
		
		Запрос = Новый Запрос; 
		Запрос.МенеджерВременныхТаблиц = МенеджерВременнныхТаблиц; 
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	ВТАктивныеЗНБВБлокировках.Блокировка КАК Блокировка
		|ПОМЕСТИТЬ ВТБлокировкиПОЗНБ1
		|ИЗ
		|	ВТАктивныеЗНБВБлокировках КАК ВТАктивныеЗНБВБлокировках
		|ГДЕ
		|	ВТАктивныеЗНБВБлокировках.ЗНБ = &ЗНБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыБлок.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТТоварыБлокировки
		|ИЗ
		|	Документ.БлокировкаВыдачиВНабор.Номенклатура КАК ТоварыБлок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТБлокировкиПОЗНБ1 КАК ВТБлокировкиПОЗНБ
		|		ПО (ВТБлокировкиПОЗНБ.Блокировка = ТоварыБлок.Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТАктивныеЗНБВБлокировках.номенклатура КАК номенклатура
		|ИЗ
		|	ВТАктивныеЗНБВБлокировках КАК ВТАктивныеЗНБВБлокировках
		|ГДЕ
		|	ВТАктивныеЗНБВБлокировках.ЗНБ = &ЗНБ
		|	И НЕ ВТАктивныеЗНБВБлокировках.номенклатура В ИЕРАРХИИ
		|				(ВЫБРАТЬ
		|					ВТТоварыБлокировки.Номенклатура
		|				ИЗ
		|					ВТТоварыБлокировки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТБлокировкиПОЗНБ1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТТоварыБлокировки"; 
		
		Запрос.УстановитьПараметр("ЗНБ",ВыборкаИтоги.ЗНБ);
		МассивТоваровЗНБ =  Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("номенклатура"); 
		
		Для каждого ВыборкаБлокировки Из ТЗБлокировки Цикл
			//	
			//Если ВыборкаБлокировки.Склад = ВыборкаИтоги.ЗНБ.Склад
				//ИЛИ ВыборкаБлокировки.Склад = ВыборкаИтоги.ЗНБ.Склад.ФизическийСклад Тогда
				
				Запрос = Новый запрос; 
				Запрос.МенеджерВременныхТаблиц = МенеджерВременнныхТаблиц; 
				
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ВТАктивныеЗНБ.Номенклатура КАК Номенклатура
				|ПОМЕСТИТЬ ВТТоварыЗНБ
				|ИЗ
				|	ВТАктивныеЗНБ КАК ВТАктивныеЗНБ
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСклады
				|		ПО (СпрСклады.Ссылка = ВТАктивныеЗНБ.Склад)
				|ГДЕ
				|	ВТАктивныеЗНБ.ЗНБ = &ЗНБ
				|	И ВТАктивныеЗНБ.Номенклатура В(&МассивТоваров)
				|	И (СпрСклады.Ссылка = &Склад
				|			ИЛИ СпрСклады.ФизическийСклад = &Склад)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВТБлокировки.Номенклатура КАК Номенклатура
				|ПОМЕСТИТЬ ВТТоварыБлокировки
				|ИЗ
				|	ВТБлокировки КАК ВТБлокировки
				|ГДЕ
				|	ВТБлокировки.Блокировка = &Блокировка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	номенклатура.Ссылка КАК номенклатура
				|ПОМЕСТИТЬ ВТТоварыБлокировкиЭлементы
				|ИЗ
				|	Справочник.Номенклатура КАК номенклатура
				|ГДЕ
				|	номенклатура.Ссылка В ИЕРАРХИИ
				|			(ВЫБРАТЬ
				|				ВТТоварыБлокировки.Номенклатура
				|			ИЗ
				|				ВТТоварыБлокировки)
				|	И НЕ номенклатура.ЭтоГруппа
				|	И НЕ номенклатура.ПометкаУдаления
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВТТоварыЗНБ.Номенклатура КАК Номенклатура
				|ИЗ
				|	ВТТоварыЗНБ КАК ВТТоварыЗНБ
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТоварыБлокировкиЭлементы КАК ВТТоварыБлокировкиЭлементы
				|		ПО ВТТоварыЗНБ.Номенклатура = ВТТоварыБлокировкиЭлементы.номенклатура
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ВТТоварыЗНБ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ВТТоварыБлокировки
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ВТТоварыБлокировкиЭлементы";
				Запрос.УстановитьПараметр("ЗНБ",ВыборкаИтоги.ЗНБ);
				Запрос.УстановитьПараметр("Склад",ВыборкаБлокировки.Склад);
				Запрос.УстановитьПараметр("Блокировка",ВыборкаБлокировки.Блокировка); 
				Запрос.УстановитьПараметр("МассивТоваров",МассивТоваровЗНБ);
				Выборка = Запрос.Выполнить().Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					НСтрока = ТЧАктивныеЗНБ.Добавить(); 	
					ЗаполнитьЗначенияСвойств(НСтрока,выборка);	
					НСтрока.ЗНБ = ВыборкаИтоги.ЗНБ; 
					НСтрока.Блокировка = ВыборкаБлокировки.Блокировка;
					
				КонецЦикла;
				
				
			//КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ТЧНоменклатураБезАктивныхЗНБ = Новый ТаблицаЗначений; 	
	ТЧНоменклатураБезАктивныхЗНБ.Колонки.Добавить("Номенклатура",новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЧНоменклатураБезАктивныхЗНБ.Колонки.Добавить("Склад",новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТЧНоменклатураБезАктивныхЗНБ.Колонки.Добавить("Блокировка",новый ОписаниеТипов("ДокументСсылка.БлокировкаВыдачиВНабор"));
	
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = МенеджерВременнныхТаблиц; 
	Запрос.УстановитьПараметр("АктивныеЗНБ",ТЧАктивныеЗНБ);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АктивныеЗНБ.ЗНБ КАК ЗНБ,
	|	АктивныеЗНБ.Блокировка КАК Блокировка,
	|	АктивныеЗНБ.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ АктивныеЗНБИтог
	|ИЗ
	|	&АктивныеЗНБ КАК АктивныеЗНБ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МенеджерВременнныхТаблиц = запрос.МенеджерВременныхТаблиц; 
	//без отбора по складу 
	//если номенклатура есть в блокировке по ЗНБ, не важно, по какому складу, не попадает в отчет 
	ТЗБлокировки.Свернуть("Блокировка"); 
	Для каждого СтрокаТЧ Из ТЗБлокировки Цикл 
		
		Запрос = Новый Запрос;
		запрос.МенеджерВременныхТаблиц = МенеджерВременнныхТаблиц; 
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТБлокировки.номенклатура КАК номенклатура
		|ПОМЕСТИТЬ ВТТоварыБлокПоСкладу
		|ИЗ
		|	ВТБлокировки КАК ВТБлокировки
		|ГДЕ
		//|	ВТБлокировки.Склад = &Склад
		|	ВТБлокировки.Блокировка = &Блокировка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СпрНом.Ссылка КАК номенклатура
		|ПОМЕСТИТЬ ВТТоварыБлокПоСкладуРазвернуто
		|ИЗ
		|	Справочник.Номенклатура КАК СпрНом
		|ГДЕ
		|	СпрНом.Ссылка В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				ВТТоварыБлокПоСкладу.номенклатура
		|			ИЗ
		|				ВТТоварыБлокПоСкладу)
		|	И НЕ СпрНом.ЭтоГруппа
		|	И НЕ СпрНом.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТТоварыБлокПоСкладуРазвернуто.номенклатура.Родитель КАК Номенклатура
		|ИЗ
		|	ВТТоварыБлокПоСкладуРазвернуто КАК ВТТоварыБлокПоСкладуРазвернуто
		|		ЛЕВОЕ СОЕДИНЕНИЕ АктивныеЗНБИтог КАК АктивныеЗНБИтог
		|		ПО (АктивныеЗНБИтог.Блокировка = &Блокировка)
		|			И (АктивныеЗНБИтог.Номенклатура.Родитель = ВТТоварыБлокПоСкладуРазвернуто.номенклатура.Родитель)
		|ГДЕ
		|	АктивныеЗНБИтог.номенклатура ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТТоварыБлокПоСкладу
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТТоварыБлокПоСкладуРазвернуто";
		
		Запрос.УстановитьПараметр("Блокировка", СтрокаТЧ.Блокировка);
		//Запрос.УстановитьПараметр("Склад", СтрокаТЧ.Склад);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяСтр = ТЧНоменклатураБезАктивныхЗНБ.Добавить(); 
			НоваяСтр.Блокировка = СтрокаТЧ.Блокировка; 
			//НоваяСтр.Склад = СтрокаТЧ.Склад;
			НоваяСтр.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		КонецЦикла; 		
		
	КонецЦикла;
	
	//++Данилова Е.В. 09.03.2026 SNL-159
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ТЧНоменклатураБезАктивныхЗНБ",ТЧНоменклатураБезАктивныхЗНБ);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧТовары.Блокировка КАК Блокировка,
	|	ТЧТовары.номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТТоварыСБлокировкой
	|ИЗ
	|	&ТЧНоменклатураБезАктивныхЗНБ КАК ТЧТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТТовары
	|ИЗ
	|	ВТТоварыСБлокировкой КАК ВТТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СкладыСПр.Ссылка КАК Склад
	|ПОМЕСТИТЬ ВТСкладыПоОтбору
	|ИЗ
	|	Справочник.Склады КАК СкладыСПр
	|ГДЕ
	|	СкладыСПр.Ссылка В иерархии(&Склады)
	|	И СкладыСПр.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ВидСклада.Виртуальный)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СкладыСПр1.Ссылка
	|ИЗ
	|	Справочник.Склады КАК СкладыСПр
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК СкладыСПр1
	|		ПО СкладыСПр.ФизическийСклад = СкладыСПр1.Ссылка
	|			И (СкладыСПр.ФизическийСклад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))
	|ГДЕ
	|	СкладыСПр.Ссылка В иерархии(&Склады)
	|	И СкладыСПр.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ВидСклада.Виртуальный)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СкладыСПр.Ссылка
	|ИЗ
	|	Справочник.Склады КАК СкладыСПр
	|ГДЕ
	|	СкладыСПр.Ссылка В иерархии(&Склады)
	|	И СкладыСПр.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ВидСклада.Физический)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СкладыСПр1.Ссылка
	|ИЗ
	|	Справочник.Склады КАК СкладыСПр
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК СкладыСПр1
	|		ПО (СкладыСПр1.ФизическийСклад = СкладыСПр.Ссылка)
	|			И (СкладыСПр1.ФизическийСклад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))
	|ГДЕ
	|	СкладыСПр.Ссылка В иерархии(&Склады)
	|	И СкладыСПр.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ВидСклада.Физический)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиТМЦОстатки.КоличествоОстаток - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) КАК Количество
	|ПОМЕСТИТЬ ВТОстаткиПоСкладам
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(
	|			&НаДату,
	|			Склад В
	|					(ВЫБРАТЬ
	|						ВТСкладыПоОтбору.Склад
	|					ИЗ
	|						ВТСкладыПоОтбору)
	|				И Номенклатура В  иерархии
	|					(ВЫБРАТЬ
	|						ВТТовары.Номенклатура
	|					ИЗ
	|						ВТТовары КАК ВТТовары)) КАК ОстаткиТМЦОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	|				&НаДату,
	|				Склад В
	|						(ВЫБРАТЬ
	|							ВТСкладыПоОтбору.Склад
	|						ИЗ
	|							ВТСкладыПоОтбору)
	|					И Номенклатура В Иерархии
	|						(ВЫБРАТЬ
	|							ВТТовары.Номенклатура
	|						ИЗ
	|							ВТТовары КАК ВТТовары)) КАК РезервыТМЦОстатки
	|		ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТовары.Номенклатура  КАК Номенклатура,
	|	СУММА(ЕСТЬNULL(ВТОстаткиПоСкладам.Количество, 0)) КАК Количество
	|ПОМЕСТИТЬ ВТОстаткиПоТоварам
	|ИЗ
	|	ВТТовары КАК ВТТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиПоСкладам КАК ВТОстаткиПоСкладам
	|		ПО (ВТОстаткиПоСкладам.Номенклатура.Родитель = ВТТовары.Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТТовары.Номенклатура
	|
	|ИМЕЮЩИЕ
	|	%ИсключитьНулевыеОстатки%
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТоварыСБлокировкой.Блокировка КАК Блокировка,
	|	ВТТоварыСБлокировкой.номенклатура КАК номенклатура,
	|	ВТОстаткиПоТоварам.Количество КАК Количество
	|ИЗ
	|	ВТТоварыСБлокировкой КАК ВТТоварыСБлокировкой
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОстаткиПоТоварам КАК ВТОстаткиПоТоварам
	|		ПО ВТТоварыСБлокировкой.номенклатура = ВТОстаткиПоТоварам.Номенклатура";
	запрос.УстановитьПараметр("НаДату",?(НЕ ЗначениеЗаполнено(ПериодОтчет1),ТекущаяДата(),ПериодОтчет1));
	МассивСклады = ОтборСклады1.ВыгрузитьЗначения();
	запрос.УстановитьПараметр("Склады",МассивСклады);
	Если ИсключитьНулевыеОстатки Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ИсключитьНулевыеОстатки%", "СУММА(ЕСТЬNULL(ВТОстаткиПоСкладам.Количество, 0)) > 0"); 
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ИсключитьНулевыеОстатки%", "Истина"); 
	КонецЕсли;
	
	
	РезультатЗапроса = Запрос.Выполнить();    
	Возврат РезультатЗапроса.Выгрузить();  
	//Возврат ТЧНоменклатураБезАктивныхЗНБ; 
    //--Данилова Е.В. 09.03.2026
КонецФункции

&НаСервере
Функция СформитьТаблицуИсточникНетАктивныхЗНББезУчетаБлокировок()
	
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БлокировкаВыдачиВНаборСрезПоследних.Склад КАК Склад,
	|	БлокировкаВыдачиВНаборСрезПоследних.Номенклатура КАК Номенклатура,
	|	БлокировкаВыдачиВНаборСрезПоследних.Регистратор КАК Блокировка,
	|	БлокировкаВыдачиВНаборСрезПоследних.Период КАК Датаначала
	|ПОМЕСТИТЬ ВТБлокировки
	|ИЗ
	|	РегистрСведений.БлокировкаВыдачиВНабор.СрезПоследних(&НаДату, ) КАК БлокировкаВыдачиВНаборСрезПоследних
	|ГДЕ
	|	БлокировкаВыдачиВНаборСрезПоследних.Активен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Склады.Склад КАК Ссылка
	|ПОМЕСТИТЬ ВТСкладыБлок
	|ИЗ
	|	ВТБлокировки КАК Склады
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Склады.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТСклады
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	(Склады.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТСкладыБлок.Ссылка
	|				ИЗ
	|					ВТСкладыБлок)
	|			ИЛИ Склады.ФизическийСклад В
	|				(ВЫБРАТЬ
	|					ВТСкладыБлок.Ссылка
	|				ИЗ
	|					ВТСкладыБлок))
	|	И НЕ Склады.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТТоварыПоОтбору
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ПометкаУдаления
	|	И Номенклатура.Ссылка В ИЕРАРХИИ(&ОтборНоменклатура)
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И НЕ Номенклатура.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаданиеНабора.Ссылка КАК ЗНБ,
	|	ЗаданиеНабора.Склад КАК Склад,
	|	ЗаданиеНабораТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТАктивныеЗНБ
	|ИЗ
	|	Документ.ЗаданиеНабора.Товары КАК ЗаданиеНабораТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНабора КАК ЗаданиеНабора
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСклады КАК ВТСклады
	//|			ПО ЗаданиеНабора.Склад = ВТСклады.Ссылка
	|		ПО ЗаданиеНабораТовары.Ссылка = ЗаданиеНабора.Ссылка
	|ГДЕ
	|	ЗаданиеНабора.СостояниеНакладной В(&СостоянияЗНБ)
	|	И ЗаданиеНабораТовары.Номенклатура В
	|			(ВЫБРАТЬ
	|				ВТТоварыПоОтбору.Ссылка
	|			ИЗ
	|				ВТТоварыПоОтбору КАК ВТТоварыПоОтбору)
	|	И ЗаданиеНабора.Накладная.СостояниеНакладной <> &Отгружена
	|	И ЗаданиеНабора.Накладная.Проведен
	|	И ЗаданиеНабора.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	БлокировкаВыдачиВНаборЗНБ.ЗаданиеНабора КАК ЗНБ,
	|	БлокировкаВыдачиВНаборЗНБ.Ссылка КАК Блокировка
	|ПОМЕСТИТЬ ВТБлокировкиПоЗНБ
	|ИЗ
	|	РегистрСведений.БлокировкаВыдачиВНабор.СрезПоследних(&НаДату, ) КАК БлокировкаВыдачиВНаборСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.БлокировкаВыдачиВНабор.ЗНБ КАК БлокировкаВыдачиВНаборЗНБ
	|		ПО БлокировкаВыдачиВНаборСрезПоследних.Регистратор = БлокировкаВыдачиВНаборЗНБ.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАктивныеЗНБ КАК ВТАктивныеЗНБ
	|		ПО (ВТАктивныеЗНБ.ЗНБ = БлокировкаВыдачиВНаборЗНБ.ЗаданиеНабора)
	|ГДЕ
	|	БлокировкаВыдачиВНаборСрезПоследних.Активен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТАктивныеЗНБ.ЗНБ КАК ЗНБ,
	|	ВТАктивныеЗНБ.Склад КАК Склад,
	|	ВТБлокировкиПоЗНБ.Блокировка КАК Блокировка,
	|	ВТАктивныеЗНБ.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТАктивныеЗНБВБлокировках
	|ИЗ
	|	ВТАктивныеЗНБ КАК ВТАктивныеЗНБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБлокировкиПоЗНБ КАК ВТБлокировкиПоЗНБ
	|		ПО ВТАктивныеЗНБ.ЗНБ = ВТБлокировкиПоЗНБ.ЗНБ
	|ГДЕ
	|	НЕ ВТБлокировкиПоЗНБ.Блокировка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТАктивныеЗНБ.ЗНБ КАК ЗНБ,
	|	ВТАктивныеЗНБ.Номенклатура КАК Номенклатура
	|ИЗ
	|	ВТАктивныеЗНБ КАК ВТАктивныеЗНБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБлокировкиПоЗНБ КАК ВТБлокировкиПоЗНБ
	|		ПО ВТАктивныеЗНБ.ЗНБ = ВТБлокировкиПоЗНБ.ЗНБ
	|ГДЕ
	|	ВТБлокировкиПоЗНБ.Блокировка ЕСТЬ NULL
	|ИТОГИ ПО
	|	ЗНБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТАктивныеЗНБВБлокировках.ЗНБ КАК ЗНБ
	|ИЗ
	|	ВТАктивныеЗНБВБлокировках КАК ВТАктивныеЗНБВБлокировках
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТБлокировки.Блокировка КАК Блокировка,
	|	ВТБлокировки.Склад КАК Склад
	|ИЗ
	|	ВТБлокировки КАК ВТБлокировки";
	
	СостоянияЗНБ = Новый Массив; 
	СостоянияЗНБ.Добавить(Перечисления.СостоянияНакладной.ОжиданиеНабора); 
	СостоянияЗНБ.Добавить(Перечисления.СостоянияНакладной.ВНаборе);
	Запрос.УстановитьПараметр("СостоянияЗНБ", СостоянияЗНБ);
	Запрос.УстановитьПараметр("Отгружена", Перечисления.СостоянияНакладной.Отгружена);
	запрос.УстановитьПараметр("НаДату",?(НЕ ЗначениеЗаполнено(ПериодОтчет1),ТекущаяДата(),ПериодОтчет1));
	Запрос.УстановитьПараметр("ОтборНоменклатура",ОтборНоменклатура.ВыгрузитьЗначения()); 
		
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	ВыборкаАКтЗНБ = ПакетЗапросов[7].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	
	ВыборкаИтоги = ПакетЗапросов[8].Выбрать();
	
	ТЗБлокировки =  ПакетЗапросов[9].Выгрузить();
	
	МенеджерВременнныхТаблиц = Запрос.МенеджерВременныхТаблиц; 
	
	ТЧАктивныеЗНБ = новый ТаблицаЗначений; 
	ТЧАктивныеЗНБ.Колонки.Добавить("ЗНБ",новый ОписаниеТипов("ДокументСсылка.ЗаданиеНабора"));
	ТЧАктивныеЗНБ.Колонки.Добавить("Номенклатура",новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	
	
	Пока ВыборкаАКтЗНБ.Следующий() Цикл  
		
		ВыборкаТовары = ВыборкаАКтЗНБ.Выбрать(); 
		Пока ВыборкаТовары.Следующий() Цикл
			
			
			НСтрока = ТЧАктивныеЗНБ.Добавить(); 	
			ЗаполнитьЗначенияСвойств(НСтрока,ВыборкаТовары);	
			НСтрока.ЗНБ = ВыборкаАКтЗНБ.ЗНБ; 				
			
		КонецЦикла;
		
	КонецЦикла;
	
	Пока ВыборкаИтоги.Следующий() Цикл
		
		Запрос = Новый Запрос; 
		Запрос.МенеджерВременныхТаблиц = МенеджерВременнныхТаблиц; 
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	ВТАктивныеЗНБВБлокировках.Блокировка КАК Блокировка
		|ПОМЕСТИТЬ ВТБлокировкиПОЗНБ1
		|ИЗ
		|	ВТАктивныеЗНБВБлокировках КАК ВТАктивныеЗНБВБлокировках
		|ГДЕ
		|	ВТАктивныеЗНБВБлокировках.ЗНБ = &ЗНБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыБлок.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТТоварыБлокировки
		|ИЗ
		|	Документ.БлокировкаВыдачиВНабор.Номенклатура КАК ТоварыБлок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТБлокировкиПОЗНБ1 КАК ВТБлокировкиПОЗНБ
		|		ПО (ВТБлокировкиПОЗНБ.Блокировка = ТоварыБлок.Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТАктивныеЗНБВБлокировках.номенклатура КАК номенклатура
		|ИЗ
		|	ВТАктивныеЗНБВБлокировках КАК ВТАктивныеЗНБВБлокировках
		|ГДЕ
		|	ВТАктивныеЗНБВБлокировках.ЗНБ = &ЗНБ
		|	И НЕ ВТАктивныеЗНБВБлокировках.номенклатура В ИЕРАРХИИ
		|				(ВЫБРАТЬ
		|					ВТТоварыБлокировки.Номенклатура
		|				ИЗ
		|					ВТТоварыБлокировки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТБлокировкиПОЗНБ1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТТоварыБлокировки"; 
		
		Запрос.УстановитьПараметр("ЗНБ",ВыборкаИтоги.ЗНБ);
		МассивТоваровЗНБ =  Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("номенклатура");
		Для каждого ЭлМассива Из МассивТоваровЗНБ Цикл 		
			НСтрока = ТЧАктивныеЗНБ.Добавить(); 	
			НСтрока.Номенклатура = ЭлМассива; 	
			НСтрока.ЗНБ = ВыборкаИтоги.ЗНБ;
		КонецЦикла;
		
	КонецЦикла;  
		
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = МенеджерВременнныхТаблиц; 
	Запрос.УстановитьПараметр("АктивныеЗНБ",ТЧАктивныеЗНБ);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(АктивныеЗНБ.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
	|ПОМЕСТИТЬ АктивныеЗНБИтог
	|ИЗ
	|	&АктивныеЗНБ КАК АктивныеЗНБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТоварыПоОтбору.ссылка КАК Номенклатура
	|ПОМЕСТИТЬ ВТТовары
	|ИЗ
	|	ВТТоварыПоОтбору КАК ВТТоварыПоОтбору
	|		ЛЕВОЕ СОЕДИНЕНИЕ АктивныеЗНБИтог КАК АктивныеЗНБИтог
	|		ПО (АктивныеЗНБИтог.Номенклатура.Родитель = ВТТоварыПоОтбору.ссылка.Родитель)
	|ГДЕ
	|	АктивныеЗНБИтог.Номенклатура ЕСТЬ NULL
	|;
	| 
	//++Данилова Е.В. 09.03.2026 SNL-159
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СкладыСПр.Ссылка КАК Склад
	|ПОМЕСТИТЬ ВТСкладыПоОтбору
	|ИЗ
	|	Справочник.Склады КАК СкладыСПр
	|ГДЕ
	|	СкладыСПр.Ссылка В иерархии(&Склады)
	|	И СкладыСПр.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ВидСклада.Виртуальный)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СкладыСПр1.Ссылка
	|ИЗ
	|	Справочник.Склады КАК СкладыСПр
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК СкладыСПр1
	|		ПО СкладыСПр.ФизическийСклад = СкладыСПр1.Ссылка
	|			И (СкладыСПр.ФизическийСклад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))
	|ГДЕ
	|	СкладыСПр.Ссылка В иерархии(&Склады)
	|	И СкладыСПр.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ВидСклада.Виртуальный)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СкладыСПр.Ссылка
	|ИЗ
	|	Справочник.Склады КАК СкладыСПр
	|ГДЕ
	|	СкладыСПр.Ссылка В иерархии(&Склады)
	|	И СкладыСПр.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ВидСклада.Физический)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СкладыСПр1.Ссылка
	|ИЗ
	|	Справочник.Склады КАК СкладыСПр
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК СкладыСПр1
	|		ПО (СкладыСПр1.ФизическийСклад = СкладыСПр.Ссылка)
	|			И (СкладыСПр1.ФизическийСклад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))
	|ГДЕ
	|	СкладыСПр.Ссылка В иерархии(&Склады)
	|	И СкладыСПр.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ВидСклада.Физический)
	|;  
	|ВЫБРАТЬ
	|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиТМЦОстатки.КоличествоОстаток - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) КАК Количество
	|ПОМЕСТИТЬ ВТОстаткиПоСкладам
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(
	|			&НаДату,
	|			Склад В (ВЫБРАТЬ ВТСкладыПоОтбору.Склад ИЗ ВТСкладыПоОтбору )
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						ВТТовары.Номенклатура
	|					ИЗ
	|						ВТТовары КАК ВТТовары)) КАК ОстаткиТМЦОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	|				&НаДату,
	|				Склад В (ВЫБРАТЬ ВТСкладыПоОтбору.Склад ИЗ ВТСкладыПоОтбору)
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							ВТТовары.Номенклатура
	|						ИЗ
	|							ВТТовары КАК ВТТовары)) КАК РезервыТМЦОстатки
	|		ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВТТовары.Номенклатура КАК Справочник.Номенклатура).Родитель КАК Номенклатура,
	|	СУММА(ЕСТЬNULL(ВТОстаткиПоСкладам.Количество, 0)) КАК Количество
	|ИЗ
	|	ВТТовары КАК ВТТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиПоСкладам КАК ВТОстаткиПоСкладам
	|		ПО (ВТОстаткиПоСкладам.Номенклатура = ВТТовары.Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(ВТТовары.Номенклатура КАК Справочник.Номенклатура).Родитель
	|
	|ИМЕЮЩИЕ
	|	%ИсключитьНулевыеОстатки%";
	запрос.УстановитьПараметр("НаДату",?(НЕ ЗначениеЗаполнено(ПериодОтчет1),ТекущаяДата(),ПериодОтчет1));
	МассивСклады = ОтборСклады1.ВыгрузитьЗначения(); 
	запрос.УстановитьПараметр("Склады",МассивСклады);
	Если ИсключитьНулевыеОстатки Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ИсключитьНулевыеОстатки%", "СУММА(ЕСТЬNULL(ВТОстаткиПоСкладам.Количество, 0)) > 0"); 
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ИсключитьНулевыеОстатки%", "Истина"); 
	КонецЕсли;
	//--Данилова Е.В. 09.03.2026 
	РезультатЗапроса = Запрос.Выполнить();
	ТЧНоменклатураБезАктивныхЗНБ = РезультатЗапроса.Выгрузить(); 
		
	Возврат ТЧНоменклатураБезАктивныхЗНБ; 

КонецФункции


&НаСервере
Функция СформироватьОтчет2НаСервере()
	
	ТЗ = СформироватьТЗНоменклатураПоСкладамБезблокировки();

	Об = РеквизитФормыВЗначение("Объект");
	ТабДок = Об.СформироватьТабДокНоменклатураПоСкладамБезБлокировки(ТЗ);
	
	Возврат ТабДок;
КонецФункции

&НаСервере
Функция СформироватьТЗНоменклатураПоСкладамБезблокировки()
	
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
	Запрос.УстановитьПараметр("НаДату",?(НЕ ЗначениеЗаполнено(ПериодОтчет2),ТекущаяДата(),ПериодОтчет2));
	Запрос.УстановитьПараметр("Склады",ОтборСклады.ВыгрузитьЗначения()); 
	Запрос.УстановитьПараметр("Физический",Перечисления.Видсклада.Физический); 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Склады.ВидСклада <> &Физический
	|			ТОГДА Склады.ФизическийСклад
	|		ИНАЧЕ Склады.Ссылка
	|	КОНЕЦ КАК Склад
	|ПОМЕСТИТЬ ВТСклады
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.Ссылка В ИЕРАРХИИ(&Склады)
	|	И НЕ Склады.ЭтоГруппа
	|	И ВЫБОР
	|			КОГДА Склады.ВидСклада <> &Физический
	|				ТОГДА Склады.ФизическийСклад
	|			ИНАЧЕ Склады.Ссылка
	|		КОНЕЦ <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяССылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БлокировкаВыдачиВНаборСрезПоследних.Склад КАК Склад,
	|	БлокировкаВыдачиВНаборСрезПоследних.Номенклатура КАК Номенклатура,
	|	БлокировкаВыдачиВНаборСрезПоследних.Регистратор КАК Блокировка,
	|	БлокировкаВыдачиВНаборСрезПоследних.Период КАК Датаначала
	|ПОМЕСТИТЬ ВТБлокировки
	|ИЗ
	|	РегистрСведений.БлокировкаВыдачиВНабор.СрезПоследних(
	|			&НаДату,
	|			Склад В
	|				(ВЫБРАТЬ
	|					ВТСклады.Склад
	|				ИЗ
	|					ВТСклады)) КАК БлокировкаВыдачиВНаборСрезПоследних
	|ГДЕ
	|	БлокировкаВыдачиВНаборСрезПоследних.Активен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТСклады.Склад КАК Склад
	|ИЗ
	|	ВТСклады КАК ВТСклады";
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	МенеджерВременныхТаблиц = запрос.МенеджерВременныхТаблиц; 
	
	ТЗ = Новый ТаблицаЗначений; 	
	ТЗ.Колонки.Добавить("Номенклатура",новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ.Колонки.Добавить("Склад",новый ОписаниеТипов("СправочникСсылка.Склады"));
	
	Пока Выборка.Следующий() Цикл
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц; 
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТБлокировки.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТТоварыБлок
		|ИЗ
		|	ВТБлокировки КАК ВТБлокировки
		|ГДЕ
		|	ВТБлокировки.Склад = &Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Номенклатура.Родитель КАК Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ПометкаУдаления
		|	И Номенклатура.Ссылка В ИЕРАРХИИ(&ОтборНоменклатура)
		|	И НЕ Номенклатура.Ссылка В ИЕРАРХИИ
		|				(ВЫБРАТЬ
		|					ВТТоварыБлок.Номенклатура
		|				ИЗ
		|					ВТТоварыБлок)
		|	И НЕ Номенклатура.ЭтоГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТТоварыБлок";
		
		Запрос.УстановитьПараметр("ОтборНоменклатура", ОтборНоменклатура1.ВыгрузитьЗначения());
		Запрос.УстановитьПараметр("Склад", Выборка.Склад);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаТЗ = ТЗ.Добавить();
			СтрокаТЗ.Склад = Выборка.Склад; 
			СтрокаТЗ.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура; 
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТЗ; 

КонецФункции

&НаКлиенте
Процедура СформироватьОтчет2(Команда)
	Табдок = СформироватьОтчет2НаСервере();
	Отчет2.Очистить();
	Отчет2.Вывести(Табдок); 
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтборыСоздБлокировки(Команда)
	Номенклатура.Очистить();
	Склады.Очистить(); 
	СозданнаяБлокировка = ПредопределенноеЗначение("Документ.БлокировкаВыдачиВНабор.ПустаяСсылка");
	НаДату = ТекущаяДата(); 
	ДатаНачалаБлокировкиFBS = НаДату  - 12*3600; 
КонецПроцедуры

&НаКлиенте
Процедура БезУчетаБлокировокПриИзменении(Элемент)
	Элементы.ОтборНоменклатура.Видимость = БезУчетаБлокировок; 
КонецПроцедуры
//++Данилова Е.В. 20.02.2026 HELP-8893 
&НаСервере
Процедура ДелениеЗНБПриИзмененииНаСервере()
	//++Данилова Е.В. 11.03.2026 SNL-159 
	Если РежимДеленияЗНБ = 0  Тогда
		
		ПроходнаяНакладнаяПН = Обработки.ПланИнвентаризации.ПроходнаяНакладнаяПроверкаРНК(РНК_ДелениеЗНБ);		
		
	Иначе
		
		ПроходнаяНакладнаяПН = Обработки.ПланИнвентаризации.ЗНБПоПроходнойНакладной(ЗНБ_ДелениеЗНБ); 		
		
	КонецЕсли;
	
	Если ПроходнаяНакладнаяПН Тогда
		
		Сообщить("Проходная накладная!! Деление ЗНБ недоступно!!"); 
		
		Возврат; 	
		
	КонецЕсли;
	
	//--Данилова Е.В. 11.03.2026 	

	ДЗ = ЗаполнитьЗНБДляДеления();
	ЗначениеВРеквизитФормы(ДЗ,"ЗНБДляДеления"); 
КонецПроцедуры

&НаКлиенте
Процедура РНК_ДелениеЗНБПриИзменении(Элемент)
	ДелениеЗНБПриИзмененииНаСервере();
КонецПроцедуры  

Функция ЗаполнитьЗНБДляДеления() 
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БлокировкаВыдачиВНаборСрезПоследних.Склад КАК Склад,
	|	БлокировкаВыдачиВНаборСрезПоследних.Номенклатура КАК Номенклатура,
	|	БлокировкаВыдачиВНаборСрезПоследних.Регистратор КАК Блокировка,
	|	БлокировкаВыдачиВНаборСрезПоследних.Период КАК Датаначала
	|ПОМЕСТИТЬ ВТБлокировки
	|ИЗ
	|	РегистрСведений.БлокировкаВыдачиВНабор.СрезПоследних(&ТекущаяДата, ) КАК БлокировкаВыдачиВНаборСрезПоследних
	|ГДЕ
	|	БлокировкаВыдачиВНаборСрезПоследних.Активен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Склады.Склад КАК Ссылка
	|ПОМЕСТИТЬ ВТСкладыБлок
	|ИЗ
	|	ВТБлокировки КАК Склады
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Склады.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТСклады
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	(Склады.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТСкладыБлок.Ссылка
	|				ИЗ
	|					ВТСкладыБлок)
	|			ИЛИ Склады.ФизическийСклад В
	|				(ВЫБРАТЬ
	|					ВТСкладыБлок.Ссылка
	|				ИЗ
	|					ВТСкладыБлок))
	|	И НЕ Склады.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТТовары
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ПометкаУдаления
	|	И Номенклатура.Ссылка В ИЕРАРХИИ
	|			(ВЫБРАТЬ
	|				ВТБлокировки.Номенклатура
	|			ИЗ
	|				ВТБлокировки)
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И НЕ Номенклатура.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаданиеНабора.Ссылка КАК ЗНБ,
	|	ЗаданиеНабора.Склад КАК Склад,
	|	ЗаданиеНабораТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТАктивныеЗНБ
	|ИЗ
	|	Документ.ЗаданиеНабора.Товары КАК ЗаданиеНабораТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНабора КАК ЗаданиеНабора
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСклады КАК ВТСклады
	|			ПО ЗаданиеНабора.Склад = ВТСклады.Ссылка
	|		ПО ЗаданиеНабораТовары.Ссылка = ЗаданиеНабора.Ссылка
	|ГДЕ
	|	ЗаданиеНабора.СостояниеНакладной В(&СостоянияЗНБ)
	|	И ЗаданиеНабораТовары.Номенклатура В
	|			(ВЫБРАТЬ
	|				ВТТовары.Ссылка
	|			ИЗ
	|				ВТТовары КАК ВТТовары)
	|	И ЗаданиеНабора.Накладная.СостояниеНакладной <> &Отгружена
	|	И ЗаданиеНабора.Накладная.Проведен
	|	И ЗаданиеНабора.Проведен
	|	И ВЫБОР
	|			КОГДА &РежимСканированияРНК
	|				ТОГДА ЗаданиеНабора.Накладная = &Накладная
	|			ИНАЧЕ ЗаданиеНабора.Ссылка = &ЗНБ
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	БлокировкаВыдачиВНаборЗНБ.ЗаданиеНабора КАК ЗНБ,
	|	БлокировкаВыдачиВНаборЗНБ.Ссылка КАК Блокировка
	|ПОМЕСТИТЬ ВТБлокировкиПоЗНБ
	|ИЗ
	|	РегистрСведений.БлокировкаВыдачиВНабор.СрезПоследних(&ТекущаяДата, ) КАК БлокировкаВыдачиВНаборСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.БлокировкаВыдачиВНабор.ЗНБ КАК БлокировкаВыдачиВНаборЗНБ
	|		ПО БлокировкаВыдачиВНаборСрезПоследних.Регистратор = БлокировкаВыдачиВНаборЗНБ.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАктивныеЗНБ КАК ВТАктивныеЗНБ
	|		ПО (ВТАктивныеЗНБ.ЗНБ = БлокировкаВыдачиВНаборЗНБ.ЗаданиеНабора)
	|ГДЕ
	|	БлокировкаВыдачиВНаборСрезПоследних.Активен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТАктивныеЗНБ.ЗНБ КАК ЗНБ,
	|	ВТБлокировкиПоЗНБ.Блокировка КАК Блокировка,
	|	ВТАктивныеЗНБ.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТАктивныеЗНБВБлокировках
	|ИЗ
	|	ВТАктивныеЗНБ КАК ВТАктивныеЗНБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБлокировкиПоЗНБ КАК ВТБлокировкиПоЗНБ
	|		ПО ВТАктивныеЗНБ.ЗНБ = ВТБлокировкиПоЗНБ.ЗНБ
	|ГДЕ
	|	НЕ ВТБлокировкиПоЗНБ.Блокировка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТАктивныеЗНБ.ЗНБ КАК ЗНБ,
	|	ВТАктивныеЗНБ.Номенклатура КАК Номенклатура
	|ИЗ
	|	ВТАктивныеЗНБ КАК ВТАктивныеЗНБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБлокировкиПоЗНБ КАК ВТБлокировкиПоЗНБ
	|		ПО ВТАктивныеЗНБ.ЗНБ = ВТБлокировкиПоЗНБ.ЗНБ
	|ГДЕ
	|	ВТБлокировкиПоЗНБ.Блокировка ЕСТЬ NULL
	|ИТОГИ ПО
	|	ЗНБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТАктивныеЗНБВБлокировках.ЗНБ КАК ЗНБ
	|ИЗ
	|	ВТАктивныеЗНБВБлокировках КАК ВТАктивныеЗНБВБлокировках
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТБлокировки.Блокировка КАК Блокировка,
	|	ВТБлокировки.Склад КАК Склад
	|ИЗ
	|	ВТБлокировки КАК ВТБлокировки";
	
	СостоянияЗНБ = Новый Массив; 
	СостоянияЗНБ.Добавить(Перечисления.СостоянияНакладной.ОжиданиеНабора); 
	СостоянияЗНБ.Добавить(Перечисления.СостоянияНакладной.СформированыЗаданияНабора);
	Запрос.УстановитьПараметр("СостоянияЗНБ", СостоянияЗНБ);
	Запрос.УстановитьПараметр("Отгружена", Перечисления.СостоянияНакладной.Отгружена);
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	Запрос.УстановитьПараметр("РежимСканированияРНК",РежимДеленияЗНБ = 0); 
	Запрос.УстановитьПараметр("Накладная",РНК_ДелениеЗНБ);
	Запрос.УстановитьПараметр("ЗНБ",ЗНБ_ДелениеЗНБ);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	ВыборкаАКтЗНБ = ПакетЗапросов[7].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	
	ВыборкаИтоги = ПакетЗапросов[8].Выбрать();
	
	ТЗБлокировки =  ПакетЗапросов[9].Выгрузить();
	
	МенеджерВременнныхТаблиц = Запрос.МенеджерВременныхТаблиц; 
	
	ТЧАктивныеЗНБ = новый ТаблицаЗначений; 
	ТЧАктивныеЗНБ.Колонки.Добавить("ЗНБ",новый ОписаниеТипов("ДокументСсылка.ЗаданиеНабора"));
	ТЧАктивныеЗНБ.Колонки.Добавить("Номенклатура",новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЧАктивныеЗНБ.Колонки.Добавить("Блокировка",новый ОписаниеТипов("ДокументСсылка.БлокировкаВыдачиВНабор"));
	ТЧАктивныеЗНБ.Колонки.Добавить("ДобавленВБлокировку",новый ОписаниеТипов("Булево"));
	ТЧАктивныеЗНБ.Колонки.Добавить("Отсканировать",новый ОписаниеТипов("Булево"));
	ТЧАктивныеЗНБ.Колонки.Добавить("Пометка",новый ОписаниеТипов("Булево"));
	
	Отсканировать = Истина;
	Если РежимДеленияЗНБ = 1 Тогда
	
		Отсканировать = Ложь; 	
	
	КонецЕсли;
	Пока ВыборкаАКтЗНБ.Следующий() Цикл  
		
		
		Для каждого ВыборкаБлокировки Из ТЗБлокировки Цикл
				Запрос = Новый запрос; 
				Запрос.МенеджерВременныхТаблиц = МенеджерВременнныхТаблиц; 
				
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ВТАктивныеЗНБ.Номенклатура КАК Номенклатура
				|ПОМЕСТИТЬ ВТТоварыЗНБ
				|ИЗ
				|	ВТАктивныеЗНБ КАК ВТАктивныеЗНБ
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСклады
				|		ПО (СпрСклады.Ссылка = ВТАктивныеЗНБ.Склад)
				|ГДЕ
				|	ВТАктивныеЗНБ.ЗНБ = &ЗНБ
				|	И (СпрСклады.Ссылка = &Склад
				|			ИЛИ СпрСклады.ФизическийСклад = &Склад)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВТБлокировки.Номенклатура КАК Номенклатура
				|ПОМЕСТИТЬ ВТТоварыБлокировки
				|ИЗ
				|	ВТБлокировки КАК ВТБлокировки
				|ГДЕ
				|	ВТБлокировки.Блокировка = &Блокировка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	номенклатура.Ссылка КАК номенклатура
				|ПОМЕСТИТЬ ВТТоварыБлокировкиЭлементы
				|ИЗ
				|	Справочник.Номенклатура КАК номенклатура
				|ГДЕ
				|	номенклатура.Ссылка В ИЕРАРХИИ
				|			(ВЫБРАТЬ
				|				ВТТоварыБлокировки.Номенклатура
				|			ИЗ
				|				ВТТоварыБлокировки)
				|	И НЕ номенклатура.ЭтоГруппа
				|	И НЕ номенклатура.ПометкаУдаления
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВТТоварыЗНБ.Номенклатура КАК Номенклатура
				|ИЗ
				|	ВТТоварыЗНБ КАК ВТТоварыЗНБ
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТоварыБлокировкиЭлементы КАК ВТТоварыБлокировкиЭлементы
				|		ПО ВТТоварыЗНБ.Номенклатура = ВТТоварыБлокировкиЭлементы.номенклатура
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ВТТоварыЗНБ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ВТТоварыБлокировки
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ВТТоварыБлокировкиЭлементы";
				Запрос.УстановитьПараметр("ЗНБ",ВыборкаАКтЗНБ.ЗНБ);
				Запрос.УстановитьПараметр("Склад",ВыборкаБлокировки.Склад);
				Запрос.УстановитьПараметр("Блокировка",ВыборкаБлокировки.Блокировка);
				Выборка = Запрос.Выполнить().Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					НСтрока = ТЧАктивныеЗНБ.Добавить(); 	
					ЗаполнитьЗначенияСвойств(НСтрока,выборка);	
					НСтрока.ЗНБ = ВыборкаАКтЗНБ.ЗНБ; 
					НСтрока.Блокировка = ВыборкаБлокировки.Блокировка;
					НСтрока.Пометка = истина; 
					Если ВыборкаАКтЗНБ.ЗНБ.СостояниеНакладной = перечисления.СостоянияНакладной.ОжиданиеНабора Тогда
					
						НСтрока.Отсканировать 	= Отсканировать; 	
					    НСтрока.Пометка			 = НЕ Отсканировать;
						
					КонецЕсли;
					
				КонецЦикла;
			
			
		КонецЦикла;	 		
		
	КонецЦикла;
	
	Пока ВыборкаИтоги.Следующий() Цикл
		
		Запрос = Новый Запрос; 
		Запрос.МенеджерВременныхТаблиц = МенеджерВременнныхТаблиц; 
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	ВТАктивныеЗНБВБлокировках.Блокировка КАК Блокировка
		|ПОМЕСТИТЬ ВТБлокировкиПОЗНБ1
		|ИЗ
		|	ВТАктивныеЗНБВБлокировках КАК ВТАктивныеЗНБВБлокировках
		|ГДЕ
		|	ВТАктивныеЗНБВБлокировках.ЗНБ = &ЗНБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыБлок.Номенклатура КАК Номенклатура,
		|	ВТБлокировкиПОЗНБ.Блокировка КАК Блокировка
		|ПОМЕСТИТЬ ВТТоварыБлокировки
		|ИЗ
		|	Документ.БлокировкаВыдачиВНабор.Номенклатура КАК ТоварыБлок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТБлокировкиПОЗНБ1 КАК ВТБлокировкиПОЗНБ
		|		ПО (ВТБлокировкиПОЗНБ.Блокировка = ТоварыБлок.Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТАктивныеЗНБВБлокировках.номенклатура КАК номенклатура
		|ИЗ
		|	ВТАктивныеЗНБВБлокировках КАК ВТАктивныеЗНБВБлокировках
		|ГДЕ
		|	ВТАктивныеЗНБВБлокировках.ЗНБ = &ЗНБ
		|	И ВТАктивныеЗНБВБлокировках.номенклатура В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				ВТТоварыБлокировки.Номенклатура
		|			ИЗ
		|				ВТТоварыБлокировки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТАктивныеЗНБВБлокировках.номенклатура КАК номенклатура
		|ИЗ
		|	ВТАктивныеЗНБВБлокировках КАК ВТАктивныеЗНБВБлокировках
		|ГДЕ
		|	ВТАктивныеЗНБВБлокировках.ЗНБ = &ЗНБ
		|	И НЕ ВТАктивныеЗНБВБлокировках.номенклатура В ИЕРАРХИИ
		|				(ВЫБРАТЬ
		|					ВТТоварыБлокировки.Номенклатура
		|				ИЗ
		|					ВТТоварыБлокировки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТБлокировкиПОЗНБ1.Блокировка КАК Блокировка
		|ИЗ
		|	ВТБлокировкиПОЗНБ1 КАК ВТБлокировкиПОЗНБ1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТБлокировкиПОЗНБ1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТТоварыБлокировки"; 
		
		Запрос.УстановитьПараметр("ЗНБ",ВыборкаИтоги.ЗНБ);
		ПакетЗапросов = Запрос.ВыполнитьПакет(); 
		ВыборкаТоварыВБлокировке =  ПакетЗапросов[2].Выбрать();
		БлокировкиВыборка =  ПакетЗапросов[4].Выбрать();
		МассивТоваровЗНБ =  ПакетЗапросов[3].Выгрузить().ВыгрузитьКолонку("номенклатура"); 
		Пока БлокировкиВыборка.Следующий() Цикл
		
			Пока ВыборкаТоварыВБлокировке.Следующий()  Цикл
			
				
				НСтрока = ТЧАктивныеЗНБ.Добавить(); 	
				НСтрока.Номенклатура = ВыборкаТоварыВБлокировке.Номенклатура; 	
				НСтрока.ЗНБ = ВыборкаИтоги.ЗНБ; 
				НСтрока.Блокировка = БлокировкиВыборка.Блокировка;	
				НСтрока.ДобавленВБлокировку = Истина;	
				
				НСтрока.Пометка = истина; 
				Если ВыборкаИтоги.ЗНБ.СостояниеНакладной = перечисления.СостоянияНакладной.ОжиданиеНабора Тогда
					
					НСтрока.Отсканировать 	= Отсканировать; 	
					НСтрока.Пометка			 = НЕ Отсканировать;
					
				КонецЕсли;

			КонецЦикла;
			
		
		КонецЦикла;
				
		Для каждого ВыборкаБлокировки Из ТЗБлокировки Цикл
			//	
				
				Запрос = Новый запрос; 
				Запрос.МенеджерВременныхТаблиц = МенеджерВременнныхТаблиц; 
				
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ВТАктивныеЗНБ.Номенклатура КАК Номенклатура
				|ПОМЕСТИТЬ ВТТоварыЗНБ
				|ИЗ
				|	ВТАктивныеЗНБ КАК ВТАктивныеЗНБ
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСклады
				|		ПО (СпрСклады.Ссылка = ВТАктивныеЗНБ.Склад)
				|ГДЕ
				|	ВТАктивныеЗНБ.ЗНБ = &ЗНБ
				|	И ВТАктивныеЗНБ.Номенклатура В(&МассивТоваров)
				|	И (СпрСклады.Ссылка = &Склад
				|			ИЛИ СпрСклады.ФизическийСклад = &Склад)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВТБлокировки.Номенклатура КАК Номенклатура
				|ПОМЕСТИТЬ ВТТоварыБлокировки
				|ИЗ
				|	ВТБлокировки КАК ВТБлокировки
				|ГДЕ
				|	ВТБлокировки.Блокировка = &Блокировка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	номенклатура.Ссылка КАК номенклатура
				|ПОМЕСТИТЬ ВТТоварыБлокировкиЭлементы
				|ИЗ
				|	Справочник.Номенклатура КАК номенклатура
				|ГДЕ
				|	номенклатура.Ссылка В ИЕРАРХИИ
				|			(ВЫБРАТЬ
				|				ВТТоварыБлокировки.Номенклатура
				|			ИЗ
				|				ВТТоварыБлокировки)
				|	И НЕ номенклатура.ЭтоГруппа
				|	И НЕ номенклатура.ПометкаУдаления
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВТТоварыЗНБ.Номенклатура КАК Номенклатура
				|ИЗ
				|	ВТТоварыЗНБ КАК ВТТоварыЗНБ
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТоварыБлокировкиЭлементы КАК ВТТоварыБлокировкиЭлементы
				|		ПО ВТТоварыЗНБ.Номенклатура = ВТТоварыБлокировкиЭлементы.номенклатура
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ВТТоварыЗНБ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ВТТоварыБлокировки
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ВТТоварыБлокировкиЭлементы";
				Запрос.УстановитьПараметр("ЗНБ",ВыборкаИтоги.ЗНБ);
				Запрос.УстановитьПараметр("Склад",ВыборкаБлокировки.Склад);
				Запрос.УстановитьПараметр("Блокировка",ВыборкаБлокировки.Блокировка); 
				Запрос.УстановитьПараметр("МассивТоваров",МассивТоваровЗНБ);
				Выборка = Запрос.Выполнить().Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					НСтрока = ТЧАктивныеЗНБ.Добавить(); 	
					ЗаполнитьЗначенияСвойств(НСтрока,выборка);	
					НСтрока.ЗНБ = ВыборкаИтоги.ЗНБ; 
					НСтрока.Блокировка = ВыборкаБлокировки.Блокировка;
					НСтрока.Пометка = истина; 
					Если ВыборкаИтоги.ЗНБ.СостояниеНакладной = перечисления.СостоянияНакладной.ОжиданиеНабора Тогда
						
						НСтрока.Отсканировать 	= Отсканировать; 	
					    НСтрока.Пометка			 = НЕ Отсканировать;
						
					КонецЕсли; 
				КонецЦикла;
				
				
			//КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧЗНБ.ЗНБ КАК ЗНБ,
		|	ТЧЗНБ.Номенклатура КАК Номенклатура,
		|	ТЧЗНБ.Блокировка КАК Блокировка,
		|	ТЧЗНБ.ДобавленВБлокировку КАК ДобавленВБлокировку,
		|	ТЧЗНБ.Отсканировать КАК Отсканировать,
		|	ТЧЗНБ.Пометка КАК Пометка
		|ПОМЕСТИТЬ ВТЗНБ
		|ИЗ
		|	&ТаблицаЗНБ КАК ТЧЗНБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗНБТовары.Ссылка КАК ЗНБ,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗНБТовары.Номенклатура) КАК КоличествоТоваров
		|ПОМЕСТИТЬ ВТКолТоваровЗНБ
		|ИЗ
		|	Документ.ЗаданиеНабора.Товары КАК ЗНБТовары
		|ГДЕ
		|	ЗНБТовары.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТЗНБ.ЗНБ
		|			ИЗ
		|				ВТЗНБ)
		|	И ЗНБТовары.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗНБТовары.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТЗНБ.ЗНБ КАК ЗНБ,
		|	ВТЗНБ.Номенклатура КАК Номенклатура,
		|	ВТЗНБ.Блокировка КАК Блокировка,
		|	ВТЗНБ.ДобавленВБлокировку КАК ДобавленВБлокировку,
		|	ВТЗНБ.Отсканировать КАК Отсканировать,
		|	ВТЗНБ.Пометка КАК Пометка,
		|	ВТКолТоваровЗНБ.КоличествоТоваров КАК КоличествоТоваров
		|ИЗ
		|	ВТЗНБ КАК ВТЗНБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКолТоваровЗНБ КАК ВТКолТоваровЗНБ
		|		ПО (ВТКолТоваровЗНБ.ЗНБ = ВТЗНБ.ЗНБ)
		|ИТОГИ
		|	МАКСИМУМ(Отсканировать),
		|	МАКСИМУМ(Пометка),
		|	МАКСИМУМ(КоличествоТоваров)
		|ПО
		|	ЗНБ"; 
	
	Запрос.УстановитьПараметр("ТаблицаЗНБ",ТЧАктивныеЗНБ); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗНБ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДЗ = РеквизитФормыВЗначение("ЗНБДляДеления",Тип("ДеревоЗначений"));
	ДЗ.Строки.Очистить(); 
	
	Пока ВыборкаЗНБ.Следующий() Цикл
		Уровень1 = ДЗ.Строки.Добавить(); 
		Уровень1.ЗНБ = ВыборкаЗНБ.ЗНБ;
		Уровень1.Пометка 		= ВыборкаЗНБ.Пометка;
		Уровень1.Отсканировать 	= ВыборкаЗНБ.Отсканировать;
	     
		ВыборкаДетальныеЗаписи = ВыборкаЗНБ.Выбрать();
	    КоличествоТоваровЗНБ = ВыборкаЗНБ.КоличествоТоваров;  
		 
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Уровень2 = Уровень1.Строки.Добавить(); 
			ЗаполнитьЗначенияСвойств(Уровень2,ВыборкаДетальныеЗаписи); 
			Уровень2.ЗНБ = Документы.ЗаданиеНабора.ПустаяСсылка(); 
		КонецЦикла;
		
		Если КоличествоТоваровЗНБ = Уровень1.Строки.Количество() Тогда
		
			Уровень1.ВсеТоварыЗаблокированы = Истина; 	
		
		КонецЕсли;
	КонецЦикла; 
	
	Возврат ДЗ; 


КонецФункции // ЗаполнитьЗНБДляДеления()

 Процедура ПометитьЗНБВДеревеДляДеления(Знач ЗНБОтскан)
 
 	  Для каждого СтрокаЗНБ Из  ЗНБДляДеления.ПолучитьЭлементы() Цикл
	  
	  	   Если СтрокаЗНБ.ЗНБ = ЗНБОтскан Тогда
		   
		   	   СтрокаЗНБ.Пометка = истина; 
			   СтрокаЗНБ.Отсканировать = Ложь; 
			   
			   Для каждого СтрНом Из СтрокаЗНБ.ПолучитьЭлементы() Цикл
			   
			   	    СтрНом.Пометка = Истина;
					СтрНом.Отсканировать = Ложь;
			   
				КонецЦикла; 
				
				прервать; 
		   
		   КонецЕсли;
	  
	  КонецЦикла;
 
 КонецПроцедуры

&НаКлиенте
 Процедура ПроставитьВсеПометкиЗНБ(Команда)
	 ПроставитьПометкиРек(ЗНБДляДеления.ПолучитьЭлементы(),истина,3,1); 
 КонецПроцедуры

&НаКлиенте
 Процедура СнятьВсеПометкиЗНБ(Команда)
	 ПроставитьПометкиРек(ЗНБДляДеления.ПолучитьЭлементы(),ложь,3,1);
 КонецПроцедуры

&НаКлиенте
 Процедура ЗНБДляДеленияЗНБПриИзменении(Элемент)
	
 КонецПроцедуры

&НаКлиенте
 Процедура ИмитацияСканированияПриИзменении(Элемент)
	 ВнешнееСобытие(Неопределено,"BarCodeValue",ИмитацияСканирования);
 КонецПроцедуры

&НаКлиенте
 Процедура ЗНБДляДеленияПриАктивизацииСтроки(Элемент)
	 ТекущиеДанные = Элементы.ЗНБДляДеления.ТекущиеДанные;
	 Элементы.ЗНБДляДеленияПометка.ТолькоПросмотр = Ложь;
	 Если  ТекущиеДанные <> Неопределено 
		 И ТекущиеДанные.Отсканировать Тогда
	 
	 	Элементы.ЗНБДляДеленияПометка.ТолькоПросмотр = Истина; 	
	 
	 КонецЕсли;
 КонецПроцедуры

&НаКлиенте
 Процедура ЗНБДляДеленияПометкаПриИзменении(Элемент)
	 ТекущиеДанные = Элементы.ЗНБДляДеления.ТекущиеДанные;
	 
	 ПриИзмененииПометки(ТекущиеДанные);
 КонецПроцедуры

&НаКлиенте
 Процедура РежимДеленияЗНБПриИзменении(Элемент)
	 Элементы.РНК_ДелениеЗНБ.Видимость = РежимДеленияЗНБ = 0;
	 ЗНБДляДеления.ПолучитьЭлементы().Очистить(); 
 КонецПроцедуры

&НаКлиенте
 Процедура РазделитьЗНБ(Команда)
	 //сначала собрать по дереву ЗНБ, которые надо разделить 
	СоответствиеЗНБ = Новый Соответствие; 
	Для каждого СтрокаЗНБ Из  ЗНБДляДеления.ПолучитьЭлементы() Цикл
		
		Если НЕ СтрокаЗНБ.Пометка
			ИЛИ СтрокаЗНБ.ВсеТоварыЗаблокированы Тогда
			
			Продолжить; 	
			
		КонецЕсли; 	
		
		МассивТоваров = Новый Массив; 
		Для каждого СтрокаТовара Из СтрокаЗНБ.ПолучитьЭлементы() Цикл
			Если НЕ СтрокаТовара.Пометка Тогда
				
				Продолжить; 	
				
			КонецЕсли;
			
			МассивТоваров.Добавить(СтрокаТовара.Номенклатура);
			
		КонецЦикла;
		
		
		СоответствиеЗНБ.Вставить(СтрокаЗНБ.ЗНБ,МассивТоваров); 
		
		
	КонецЦикла; 
	
	результатРазделения = РазделитьЗНБНаСервере(СоответствиеЗНБ); 
	
	Если результатРазделения.Успешно  Тогда
		
		ДелениеЗНБПриИзмененииНаСервере();
		ОткрытьЗначение(результатРазделения.Данные);
		
		 
	Иначе
		МаркировкаКС.ВывестиОшибки(результатРазделения); 
		
	КонецЕсли;
КонецПроцедуры 

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Функция РазделитьЗНБНаСервере(СоответствиеЗНБ)
	
	результатРазделения = МаркировкаКС.СтруктураРезультата(ложь); 
	Если СоответствиеЗНБ.Количество()  = 0  Тогда
		
		результатРазделения.Ошибки.Добавить("Не найдено ЗНБ для разделения"); 
		Возврат результатРазделения; 	
		
	КонецЕсли;

	Если РежимДеленияЗНБ = 0 Тогда
		
		РНК = РНК_ДелениеЗНБ; 
		
	Иначе
		
		Для каждого ЭлСоответствия Из СоответствиеЗНБ Цикл
			
			ЗНБ = ЭлСоответствия.Ключ;	
			РНК = ЗНБ.Накладная; 
			
			Прервать; 
			
		КонецЦикла;
		
		 
	КонецЕсли;
	
	//преобразовать по номеру части 
	СоответствиеНомерЧастиТовары = Новый Соответствие; 
	
	Для каждого СтрокаСоотвествия Из СоответствиеЗНБ Цикл
	
		СоответствиеНомерЧастиТовары.Вставить(СтрокаСоотвествия.Ключ.НомерЧасти,СтрокаСоотвествия.Значение); 	
	
	КонецЦикла;
	
	результатРазделения = Обработки.ПланИнвентаризации.РазделитьЗНБ(СоответствиеНомерЧастиТовары,РНК); 
	
	Возврат результатРазделения; 

КонецФункции // РазделитьЗНБНаСервере()

&НаКлиенте
Процедура ОбновитьДелениеЗНБ(Команда)
	ДелениеЗНБПриИзмененииНаСервере(); 
КонецПроцедуры

 //--Данилова Е.В. 20.02.2026 
	
#КонецОбласти
