
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ВыборПунктаДоставки") Тогда
	
		 ВыборПунктаДоставки = Параметры.ВыборПунктаДоставки; 
		 
	
	 КонецЕсли;
	 
	 Если Параметры.Свойство("МассивКонтрагентов") Тогда
	
		 СписокКонтрагентов.ЗагрузитьЗначения(Параметры.МассивКонтрагентов); 
		 
	
	 КонецЕсли;
	 Если Параметры.Свойство("ВыборЮрЛица") Тогда
	
		 ВыборЮрЛица = Параметры.ВыборЮрЛица; 
		 
	
	 КонецЕсли;
	 
	  Если Параметры.Свойство("МассивПунктовДоставки") Тогда
	
		 СписокПунктовДоставки.ЗагрузитьЗначения(Параметры.МассивПунктовДоставки); 
		 
	
	 КонецЕсли;

	 
	 УстановитьВидимость(); 
 КонецПроцедуры
 
 // <Описание процедуры>
 //
 // Параметры:
 //  <Параметр1>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //  <Параметр2>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //
 &НаСервере
 Процедура УстановитьВидимость()
 
 	Элементы.ГруппаКонтрагенты.Видимость = ВыборЮрЛица; 
	Элементы.ГруппаПунктыДоставки.Видимость = ВыборПунктаДоставки; 
 
 КонецПроцедуры // УстановитьВидимость()


&НаКлиенте
 Процедура ВыбратьПунктДоставки(Команда)
	 
	 ПередатьПунктДоставки();

 КонецПроцедуры
 
 &НаКлиенте
 Процедура ПередатьПунктДоставки()  	
	 
	 ВыделенныеСтроки = Элементы.СписокПунктовДоставки.ВыделенныеСтроки;
	 Если ВыделенныеСтроки.Количество() = 0 Тогда
		 
		 ПоказатьПредупреждение(,"Не выбран элемент"); 
		 Возврат; 
	 КонецЕсли;
	 ЭлементИзСписка = СписокПунктовДоставки.НайтиПоИдентификатору(ВыделенныеСтроки[0]); 
	 Если ЭлементИзСписка <> неопределено Тогда
		 
		 Закрыть(ЭлементИзСписка.Значение); 	
		 
	 КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
 Процедура ПередатьКонтрагента()  	
	 
	 ВыделенныеСтроки = Элементы.СписокКонтрагентов.ВыделенныеСтроки;
	 Если ВыделенныеСтроки.Количество() = 0 Тогда
		 
		 ПоказатьПредупреждение(,"Не выбран элемент"); 
		  Возврат; 
	 КонецЕсли;
	 ЭлементИзСписка = СписокКонтрагентов.НайтиПоИдентификатору(ВыделенныеСтроки[0]); 
	 Если ЭлементИзСписка <> неопределено Тогда
		 
		 Закрыть(ЭлементИзСписка.Значение); 	
		 
	 КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЮрЛицо(Команда)
	ПередатьКонтрагента(); 
КонецПроцедуры

&НаКлиенте
Процедура СписокКонтрагентовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПередатьКонтрагента();
КонецПроцедуры

&НаКлиенте
Процедура СписокПунктовДоставкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПередатьПунктДоставки(); 
КонецПроцедуры


 
