Функция СтатусПроверкиДокументаПоЧЗ(Документ) Экспорт
	Результат = Неопределено;
	
	МЗ = РегистрыСведений.СтатусыПроверкиКМвЧЗ.СоздатьМенеджерЗаписи();
	МЗ.Документ = Документ;	
	МЗ.Прочитать();        
	
	Если МЗ.Документ = Документ  Тогда
		Результат = МЗ.Результат;	
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции //СтатусПроверкиДокументаПоЧЗ(Документ) Экспорт

Процедура УстановитьРезультатПроверкиДокументаПоЧЗ(Документ, Результат, ДопПараметры = Неопределено) Экспорт
	МЗ = РегистрыСведений.СтатусыПроверкиКМвЧЗ.СоздатьМенеджерЗаписи();
	
	МЗ.Документ 	= Документ;	
	МЗ.Результат	= Результат;
	
	МЗ.Автор 		= ПараметрыСеанса.Пользователь;
	МЗ.ДатаЗаписи   = ТекущаяДата();
	МЗ.ДопИнфо		= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ДопИнфо");
	
	МЗ.Записать();	
КонецПроцедуры

Процедура УдалитьРезультатПроверкиДокументаПоЧЗ(Документ) Экспорт
	МЗ = РегистрыСведений.СтатусыПроверкиКМвЧЗ.СоздатьМенеджерЗаписи();
	
	МЗ.Документ = Документ;		
	
	МЗ.Удалить();
КонецПроцедуры