
//// ПРОВЕРКА ЗАПОЛНЕНИЯ ПОЛЕЙ ТЧ //////////////////////////////////////////////////////
&НаСервере
Функция ЗаполненыВсеДатыВыполненияСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗДоступ", Объект.Доступ.Выгрузить());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Доступ.ДатаВыполнения КАК ДатаВыполнения
	|ПОМЕСТИТЬ Доступ
	|ИЗ
	|	&ТЗДоступ КАК Доступ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Доступ.ДатаВыполнения КАК ДатаВыполнения
	|ИЗ
	|	Доступ КАК Доступ
	|ГДЕ
	|	Доступ.ДатаВыполнения = ДАТАВРЕМЯ(1, 1, 1)";
	
	УстановитьПривилегированныйРежим(Истина);
	Рез = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если НЕ Рез.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЗаполненыВсеПоляТабличнойЧасти()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗДоступ", Объект.Доступ.Выгрузить());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Доступ.Исполнитель КАК Исполнитель,
	|	Доступ.Сотрудник КАК Сотрудник,
	|	Доступ.ИТ_Ресурс КАК ИТ_Ресурс,
	|	Доступ.ДатаВыполнения КАК ДатаВыполнения
	|ПОМЕСТИТЬ Доступ
	|ИЗ
	|	&ТЗДоступ КАК Доступ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Доступ.Исполнитель КАК Исполнитель,
	|	Доступ.Сотрудник КАК Сотрудник,
	|	Доступ.ИТ_Ресурс КАК ИТ_Ресурс,
	|	Доступ.ДатаВыполнения КАК ДатаВыполнения
	|ИЗ
	|	Доступ КАК Доступ
	|ГДЕ
	|	(Доступ.ДатаВыполнения = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ Доступ.Сотрудник = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ИЛИ Доступ.Исполнитель = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ИЛИ Доступ.ИТ_Ресурс = ЗНАЧЕНИЕ(Справочник.ИТ_Ресурсы.ПустаяСсылка))";
	
	УстановитьПривилегированныйРежим(Истина);
	Рез = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если НЕ Рез.Пустой() Тогда
		Возврат Ложь;    // ВСЕ ПОЛЯ НЕ ЗАПОЛНЕНЫ
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции
//// ПРОВЕРКА ЗАПОЛНЕНИЯ ПОЛЕЙ ТЧ //////////////////////////////////////////////////////

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Объект.ОтветственноеЛицо) Тогда
		Сообщить("Не заполнено <Ответственное лицо>");
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ПравоДоступа) Тогда
		Сообщить("Не заполнено <Право доступа>");
		Отказ = Истина;
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////////
	
	Если НЕ ЗаполненыВсеПоляТабличнойЧасти() Тогда
		Сообщить("Не заполнены ВСЕ поля табличной части <Доступ>");
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеДоступностью();
КонецПроцедуры

/////////// ПРИ ИЗМЕНЕНИИ ////////////////////////////////////////////////
&НаКлиенте
Процедура ДоступДатаВыполненияПриИзменении(Элемент)
	
	ТекущаяСтрока = Объект.Доступ.НайтиПоИдентификатору(Элементы.Доступ.ТекущаяСтрока);
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.ДатаВыполнения) И НЕ ЗначениеЗаполнено(ТекущаяСтрока.Исполнитель) Тогда
		ТекущаяСтрока.Исполнитель = ПараметрыСеанса.Пользователь.Физлицо;
	КонецЕсли;
	
	Объект.Отработано = ЗаполненыВсеДатыВыполненияСервере();
	УстановитьТолькоПросмотр();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтработаноПриИзменении(Элемент)
	УстановитьТолькоПросмотр();
КонецПроцедуры
/////////// ПРИ ИЗМЕНЕНИИ ////////////////////////////////////////////////

&НаКлиенте
Процедура УстановитьТолькоПросмотр(ИсключаяОтработано = Истина)
	
	Для Каждого Элемент из Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ДекорацияФормы") ИЛИ ТипЗнч(Элемент) = Тип("КнопкаФормы")
			ИЛИ ТипЗнч(Элемент) = Тип("ДополнениеЭлементаФормы") Тогда
			Продолжить;
		КонецЕсли;
		Если ИсключаяОтработано И Элемент.Имя = "Отработано" Тогда
			Продолжить;
		КонецЕсли;
		Элемент.ТолькоПросмотр = Объект.Отработано;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеДоступностью()
	
	ТолькоПросмотр = НЕ ПолучитьПолномочиеПользователя("РедактированиеДоступаКИТРесурсам");
	
	Если НЕ ТолькоПросмотр Тогда
		УстановитьТолькоПросмотр();
	КонецЕсли;
	
КонецПроцедуры
