

Процедура УправлениеВидимостью()	

			
	ТолькоПросмотр=НЕ МожноИзменятьДокумент(Объект.Ссылка);
 	Если ТолькоПросмотр Тогда Возврат КонецЕсли;
	
	
КонецПроцедуры 


&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Объект.Договор = Объект.контрагент.ОсновнойДоговор;
	// нечаева 04,12,25
	Объект.Валюта = Объект.Договор.ВалютаКредита;
    // нечаева 04,12,25
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
		 	
	Если объект.Контрагент <> Объект.Договор.владелец Тогда
		Объект.Контрагент = Объект.Договор.владелец;
	КонецЕсли;  
	
	Объект.Валюта = Объект.Договор.ВалютаКредита;
	 	
КонецПроцедуры  

&НаСервере
Процедура ПриОткрытииНаСервере()
	//Вставить содержимое обработчика
	  УправлениеВидимостью();
	  
	//ЭтаФорма.ТекущийЭлемент = ЭлементыФормы.Контрагент;	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка)  Тогда // проверить объект на то, что новый	
		Объект.Автор = ПараметрыСеанса.Пользователь;
		если ЗначениеЗаполнено(Объект.Договор)	тогда
			Объект.Валюта=Объект.Договор.ВалютаКредита;
		КонецЕсли;
		
		если НЕ ЗначениеЗаполнено(Объект.Валюта)	тогда
			Объект.Валюта=ПараметрыСеанса.ВалютаНац;  
			Объект.Курс=1;	
		КонецЕсли;
			
		Если Объект.КодОперации.Пустая() Тогда
			Объект.КодОперации=Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств;
		КонецЕсли;
				
	 КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	ПриОткрытииНаСервере();
	
КонецПроцедуры




