
&НаКлиенте
Процедура ОбработкаКоманды(СписокЗаказов, ПараметрыВыполненияКоманды)
	рРегистрации = ЗарегистрироватьКВыгрузке(СписокЗаказов);
	Если рРегистрации.Успешно Тогда
		Сообщить(СтрШаблон("Зарегистировано к ввыгрузке: %1 кодов маркировки.", рРегистрации.ОбработаноОбъектов)) 
	Иначе
		МаркировкаК.ВывестиОшибки(рРегистрации);	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ЗарегистрироватьКВыгрузке(СписокЗаказов)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	УзлыПолучатели = Маркировка_ПИ.ПолучитьМассивУзловПоТипу(Перечисления.ТипУзлаИБ.Склад, Метаданные.ПланыОбмена.ДанныеЧЗ.Имя); 
	
	Если УзлыПолучатели.Количество() = 0 Тогда
		Результат.Сообщения.Добавить("Не найдено узлов получателей с типом 'Склад' !");
		Результат.Успешно = Ложь;
		Возврат Результат;	
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	ЗаказКМ В(&СписокЗаказов)
	|";
	
	Запрос.УстановитьПараметр("СписокЗаказов", СписокЗаказов);
	
	Выборка		= Запрос.Выполнить().Выбрать();
	ВсегоСтрок 	= Выборка.Количество();
	Сч			= 0;
	
	Пока Выборка.Следующий() Цикл			
		Сч = Сч + 1;
		ПланыОбмена.ЗарегистрироватьИзменения(УзлыПолучатели, Выборка.Ссылка);	
		
		#ЕСЛИ КЛИЕНТ ТОГДА
			ОбработкаПрерыванияПользователя();
			Если Сч % 100 = 0 Тогда
				Состояние(ВсегоСтрок-Сч);			
			КонецЕсли; 
		#КОНЕЦЕСЛИ
	КонецЦикла;
	
	Результат.ОбработаноОбъектов = ВсегоСтрок;
	
	Возврат Результат;
КонецФункции //ЗарегистрироватьКВыгрузке(СписокЗаказов)
 