
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	//Параметры.ЗакрыватьПриВыборе = Истина;
	СписокПолей.Очистить();
	Попытка
		Запрос = Новый Запрос;
		
		ОТаблица = Параметры.ОсновнаяТаблица;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 * ИЗ " + ОТаблица;
		
		РезультатЗапроса = Запрос.Выполнить();
		
		н = 0;
		Пока (н < 10)  Цикл
			Элементы["СписокВыбораПоле" + Строка(н + 1)].Видимость = Ложь;
			н = н + 1;
		КонецЦикла;
		КолРекв = РезультатЗапроса.Колонки.Количество();
		н = 0;
		ТелоВыб = "";
		Пока (н < 10) И (н < КолРекв)  Цикл
			Колонка = РезультатЗапроса.Колонки[н];
			СписокПолей.Добавить(Колонка.Имя);
			ТелоВыб = ТелоВыб + ?(н = 0, Колонка.Имя + " КАК Поле" + Строка(н + 1), ", " + Колонка.Имя + " КАК Поле" + Строка(н + 1));
			Элементы["СписокВыбораПоле" + Строка(н + 1)].Видимость = Истина;
			Элементы["СписокВыбораПоле" + Строка(н + 1)].Заголовок = Колонка.Имя;
			н = н + 1;
		КонецЦикла;
		СписокВыбора.ТекстЗапроса = "ВЫБРАТЬ " + ТелоВыб + "  ИЗ " + ОТаблица;
	Исключение
		Сообщить(ОписаниеОшибки());
	конецпопытки;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ОтветМ = Новый Массив;
	Если Элементы.СписокВыбора.ВыделенныеСтроки.Количество() Тогда
		Для Каждого ВыдСтр Из Элементы.СписокВыбора.ВыделенныеСтроки Цикл
			ТекСтр = Элементы.СписокВыбора.ДанныеСтроки(ВыдСтр);
			ОтветС = Новый Структура;
			г = 0;
			Пока г < КолРекв Цикл
				ИмяПоля = СписокПолей.Получить(г).Значение;
				ОтветС.Вставить(ИмяПоля, ТекСтр["Поле" + Строка(г + 1)]);
				г = г + 1;
			КонецЦикла;
			ОтветМ.Добавить(ОтветС);
		КонецЦикла;
	КонецЕсли;
	ОповеститьОВыборе(ОтветМ);
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	// Вставить содержимое обработчика.
	ОтветМ = Новый Массив;
	Если Элементы.СписокВыбора.ВыделенныеСтроки.Количество() Тогда
		Для Каждого ВыдСтр Из Элементы.СписокВыбора.ВыделенныеСтроки Цикл
			ТекСтр = Элементы.СписокВыбора.ДанныеСтроки(ВыдСтр);
			ОтветС = Новый Структура;
			г = 0;
			Пока г < КолРекв Цикл
				ИмяПоля = СписокПолей.Получить(г).Значение;
				ОтветС.Вставить(ИмяПоля, ТекСтр["Поле" + Строка(г + 1)]);
				г = г + 1;
			КонецЦикла;
			ОтветМ.Добавить(ОтветС);
			КонецЦикла;
	КонецЕсли;
	ОповеститьОВыборе(ОтветМ);
КонецПроцедуры
