Процедура ПриКопировании(ОбъектКопирования)
	Картинка=Неопределено;
КонецПроцедуры


Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс=ПолучитьПрефиксНомеров(ЭтотОбъект);
КонецПроцедуры
 //Кухарь 30.08.16 начало
Процедура ПередЗаписью(Отказ)
	НадоВыгружать = Ложь;
	Если ОбменДанными.Загрузка Тогда
		НадоВыгружать = Ложь;
	Иначе 
		НадоВыгружать = Истина;
	КонецЕсли;
	Если НадоВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	КонецЕсли;
	
	
КонецПроцедуры
//Кухарь 30.08.16 конец