

Процедура Сформировать(ТаблицаПараметров=НЕОПРЕДЕЛЕНО) Экспорт
	Контрагент=Справочники.Контрагенты.НайтиПоКоду("SSP-4991");
	ДанныеМаркетПлейса=ОбменМаркетПлейсПИ.ПолучитьИнтернетМагазин(Контрагент);
	// Кухарь А.Ю. 02.12.2021 начало
	//ОбменМаркетПлейс.ОбновитьСтатусыЗаказов(ДанныеМаркетПлейса);
	//ОбменМаркетПлейс.СформироватьЭтикеткиОзон(Контрагент,ДанныеМаркетПлейса); 
	если ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
		ОбменМаркетПлейс.ОбновитьСтатусыЗаказов(ДанныеМаркетПлейса);
	ИначеЕсли ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.Склад тогда
		ОбменМаркетПлейс.СформироватьЭтикеткиОзон(Контрагент,ДанныеМаркетПлейса); 
	КонецЕсли;
	// Кухарь А.Ю. 02.12.2021 конец
	
	
	
КонецПроцедуры