Процедура ПередЗаписью(Отказ)
		//крохин начало 23.01.2012
	Если НЕ ОбменДанными.Загрузка Тогда
	ВыгрузитьВТЦ();
	КонецЕсли;
	//крохин конец 23.01.2012

	УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс=ПолучитьПрефиксНомеров(ЭтотОбъект);
КонецПроцедуры

 Процедура ВыгрузитьВТЦ()
//выгрузим контрагента в филиалы, если необходимо
ТЗ=Новый ТаблицаЗначений;
ТЗ.Колонки.Добавить("КодУзла");
ВерхнийУровень = Владелец;
Если Владелец.Метаданные().Имя <> "Контрагенты" Тогда
Возврат;
КонецЕсли;
Пока НЕ ВерхнийУровень.Пустая()  Цикл
	Для Каждого КодУзла Из ВерхнийУровень.РегиональныеУзлы Цикл
	СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.КодУзла = КодУзла.КодУзла;
КонецЦикла;
ВерхнийУровень = ВерхнийУровень.Родитель;
КонецЦикла;
ТЗ.Свернуть("КодУзла");
//из складских баз выгружаем только в ЦО
Если ПараметрыСеанса.ТипУзла <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
ТЗ.Очистить();
СтрокаТЗ = ТЗ.Добавить();
СтрокаТЗ.КодУзла = "SNL";
КонецЕсли;
Если Тз.Количество() <> 0 Тогда
СписокУзловПолучателей=Новый Массив;	
	Для Каждого строкаТЗ Из ТЗ Цикл
			СписокУзловПолучателей.Добавить(ПланыОбмена.Основной.НайтиПоКоду(СтрокаТЗ.КодУзла));	
		КонецЦикла;
	Для Н = 0 По СписокУзловПолучателей.Количество()-1 Цикл
	ЭтотОбъект.ОбменДанными.Получатели.Добавить(СписокУзловПолучателей.Получить(Н));	
	КонецЦикла;
	//ПланыОбмена.ЗарегистрироватьИзменения(СписокУзловПолучателей,ЭтотОбъект.Ссылка);		
КонецЕсли;
КонецПроцедуры


Процедура ЗаполнитьТекстКорреспондента() Экспорт

	мВладелец     = ЭтотОбъект.Владелец;

	Если ЗначениеНеЗаполнено(мВладелец) Тогда
		Возврат;
	КонецЕсли;

	ТипВладельца = ТипЗнч(мВладелец);
	Если ТипВладельца = Тип("СправочникСсылка.Контрагенты") Тогда
		СтрКорреспондента = СокрЛП(мВладелец.ПолноеНаименование);
	ИначеЕсли ТипВладельца = Тип("СправочникСсылка.Организации") Тогда
		СтрКорреспондента = СокрЛП(мВладелец.НаименованиеПолное);	
	КонецЕсли;	

	Если НЕ БанкДляРасчетов.Пустая() Тогда
		СтрКорреспондента = СтрКорреспондента + " р/с " + НомерСчета
			+ " в " + Банк + " " + Банк.Город;
	КонецЕсли;	

	ТекстКорреспондента = СтрКорреспондента;	

КонецПроцедуры