Процедура ОбработкаПроведения(Отказ, Режим)	Экспорт
	СписокСкладов=Новый Массив;
	СписокСкладов.Добавить(Склад);
	Для Каждого СтрокаСклада Из Склады Цикл
		СписокСкладов.Добавить(СтрокаСклада.Склад);	
	КонецЦикла; 
	
	Для Каждого ТекСтрокаСостав Из Состав Цикл		
		Для Каждого ТекСклад Из СписокСкладов Цикл
			Движение = Движения.Распределение2.Добавить();
			Движение.Период		= Дата;
		
			Движение.Склад			= ТекСклад;
			Движение.Номенклатура	= ТекСтрокаСостав.Номенклатура;
			Движение.Процент		= ТекСтрокаСостав.Процент;		
		КонецЦикла;		
	КонецЦикла;	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	Если ОбменДанными.Загрузка Тогда
		Движения.Распределение2.Записать();	
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ЕстьИзменения		=Модифицированность();
	НужноВыгружать		=Ложь;
	
	Если ЕстьИзменения ИЛИ ТипТовара.Пустая() ИЛИ Брэнд.Пустая() ИЛИ ПустаяСтрока(НаименованиеМодели) Тогда
		ТипТовара			=Модель.Родитель.Родитель;
		Брэнд				=Модель.Родитель;
		НаименованиеМодели  =Модель.Наименование;	
	КонецЕсли;	
	
	Если ЕстьИзменения ИЛИ (НЕ Ссылка.Проведен И РежимЗаписи=РежимЗаписиДокумента.Проведение) ИЛИ Ссылка.ПометкаУдаления<>ПометкаУдаления Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;
КонецПроцедуры
