
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл для прикрепления";
	Диалог.ПолноеИмяФайла = ""; 
	Диалог.МножественныйВыбор = Ложь;
	
	Если Диалог.Выбрать() Тогда
		Объект.Файл = Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	
	Если ПустаяСтрока(Объект.ИмяФайла) Тогда
		Сообщить("Не выбран файл загрузки!!!");
		Возврат;
	КонецЕсли;
	
	ФайлЗагрузки = Новый Файл(Объект.ИмяФайла);
	
	Если ФайлЗагрузки.Существует() Тогда 
	
		АдресВременногоХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Объект.ИмяФайла));
		
		ЗагрузитьФайлНаСервере(АдресВременногоХранилища, СтрЗаменить(ФайлЗагрузки.Расширение, ".", ""));
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьФайлНаСервере(АдресВременногоХранилища, Расширение = "xlsx")
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	
	Объект.Ссылка.ХранилищеФайлов = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФайл(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

