 //крохин начало  06.12.2012
 Перем НомерКоробкиДляОбработки Экспорт;
 //крохин конец 06.12.2012
 
 Процедура СформироватьНормальные(НомерКоробкиДляОбработки = Неопределено)  Экспорт
	 #Если клиент Тогда
		 Сообщить(ТекущаяДата());
		 Состояние("документы без ошибок");
	 #КонецЕсли
	 КаталогОшибок   = Константы.КаталогДокументов.Получить()+ "Ошибки\";
	 КаталогЗагрузки = Константы.КаталогДокументов.Получить();
//	 КаталогВыгрузки = Константы.КаталогНеобработанныхСканов.Получить();
//	 КаталогОшибок   = "\\srvfile\Сканы документов к Обработке\Ошибки\";
//	 КаталогЗагрузки = "\\srvfile\Сканы документов к Обработке\";
//Лобан 220513 +++
//ИзмененПуть Каталога
//КаталогВыгрузки = "\\srvfile\Сканы документов к Обработке\";
  КаталогВыгрузки = "\\nas-diz\efd\Сканы документов к Обработке\";

//Лобан 220513 ---
		 
	 СоздатьКаталог(КаталогОшибок+"Дубль\");
	 СоздатьКаталог(КаталогОшибок+"Ошибки\");
	 СоздатьКаталог(КаталогОшибок+"Нет документа в базе\");
	 СоздатьКаталог(КаталогОшибок+"Уже провереные\");
		 
	 
	 СписокОтработанныхКаталогов = Новый СписокЗначений;
	 НайденныеКаталогиДокументов = НайтиФайлы(КаталогВыгрузки,"*");
	 
	 Для Каждого ИскКаталогДокументов Из НайденныеКаталогиДокументов Цикл
		  //крохин начало 02.03.2012
			//Если ИскКаталогДокументов.Имя = ИскКаталогДокументов.ИмяБезРасширения  И Найти(ИскКаталогДокументов.Имя,"Нормальные") Тогда

	 Если ИскКаталогДокументов.ЭтоКаталог() И Найти(ИскКаталогДокументов.Имя,"Нормальные") Тогда


			
			//крохин конец 02.03.2012
		 	
			 НайденныеКаталогиДок = НайтиФайлы(ИскКаталогДокументов.ПолноеИмя,"*");
			 Для Каждого КаталогДок Из НайденныеКаталогиДок Цикл
			//крохин начало 02.03.2012
			//Если КаталогДок.Имя = КаталогДок.ИмяБезРасширения  И Найти(КаталогДок.Имя,"Кор") Тогда
							 //крохин начало 06.12.2012
	 //по одной коробке
	// Если КаталогДок.ЭтоКаталог() И Найти(КаталогДок.Имя,"Кор") Тогда
	Если КаталогДок.ЭтоКаталог() И Найти(КаталогДок.Имя,"Кор"+НомерКоробкиДляОбработки.Код) Тогда
	//крохин конец 06.12.2012
	
	//крохин конец 02.03.2012
			
				 
					 НайденныеКаталогиПакет = НайтиФайлы(КаталогДок.ПолноеИмя,"*");
					 НомерКоробки = ПолучитьНомерКоробки(КаталогДок);
					  //крохин начало 27.09.2011
	 //ошибки будем писать в каталог с номером коробки
	  СоздатьКаталог(КаталогОшибок+"Дубль\"+НомерКоробки+"\");
	 СоздатьКаталог(КаталогОшибок+"Ошибки\"+НомерКоробки+"\");
	 СоздатьКаталог(КаталогОшибок+"Нет документа в базе\"+НомерКоробки+"\");
	 СоздатьКаталог(КаталогОшибок+"Уже провереные\"+НомерКоробки+"\");
	 //крохин конец 27.09.2011
	 Для Каждого КаталогДокПакет Из НайденныеКаталогиПакет Цикл
		 //крохин начало 02.03.2012
			//Если КаталогДокПакет.Имя = КаталогДокПакет.ИмяБезРасширения  И Найти(КаталогДокПакет.Имя,"Доверенности") Тогда
			Если КаталогДокПакет.ЭтоКаталог() И Найти(КаталогДокПакет.Имя,"Доверенности") Тогда
			//крохин конец 02.03.2012

					
				     ЗаписатьДоверенности(КаталогДокПакет,НомерКоробки);
				     Продолжить;
			         КонецЕсли;
                     КонецЦикла;
					 Для Каждого КаталогДокПакет Из НайденныеКаталогиПакет Цикл
						 //крохин начало 02.03.2012
						 //Если КаталогДокПакет.Имя = КаталогДокПакет.ИмяБезРасширения  И Найти(КаталогДокПакет.Имя,"пакет") Тогда
						 Если КаталогДокПакет.ЭтоКаталог()  И Найти(КаталогДокПакет.Имя,"пакет") Тогда
							 //крохин конец 02.03.2012
							 НайденныеКаталоги = НайтиФайлы(КаталогДокПакет.ПолноеИмя,"*");
							 Прервать;  
						 КонецЕсли;
					 КонецЦикла;
					 Прервать;
				 КонецЕсли;	
			 КонецЦикла;
		 иначе
			 Продолжить;
		 КонецЕсли;
		 Если КаталогДок = Неопределено Тогда Продолжить КонецЕсли;	
		 Если НайденныеКаталоги = Неопределено Тогда Продолжить КонецЕсли;		 
		 //Индикатор1 = 0;
		 //ЭлементыФормы.Индикатор1.МаксимальноеЗначение = НайденныеКаталоги.Количество();
		 Для Каждого ИскКаталог Из НайденныеКаталоги Цикл
			 //	Индикатор1 = Индикатор1 + 1;
			 #Если клиент Тогда
				 
				 ОбработкаПрерыванияПользователя();
			 #КонецЕсли
			 //крохин начало 02.03.2012
			// Если ИскКаталог.Имя = ИскКаталог.ИмяБезРасширения Тогда //проверим, что это каталог
			Если ИскКаталог.ЭтоКаталог()  Тогда
			//крохин конец 02.03.2012	
				 Если СтрДлина(ИскКаталог.Имя) < 5 Тогда
					 //крохин начало 27.09.2011
					 //ошибки будем писать в каталог с номером коробки
					 //СоздатьКаталог(КаталогОшибок+"Ошибки\"+ИскКаталог.Имя+"\");
					 СоздатьКаталог(КаталогОшибок+"Ошибки\"+НомерКоробки+"\"+ИскКаталог.Имя+"\");	
					 //крохин конец 27.09.2011
					 //крохин начало 27.01.2016
					 //поменялся формат
					 //НайденныеФайлы = НайтиФайлы(ИскКаталог.ПолноеИмя,"*.tif");
					 НайденныеФайлы = НайтиФайлы(ИскКаталог.ПолноеИмя,"*.jpg");
					 //крохин конец 27.01.2016
					 Для Каждого Файл Из НайденныеФайлы Цикл
						 //крохин начало 27.09.2011
					 //ошибки будем писать в каталог с номером коробки
						// КопироватьФайл(Файл.ПолноеИмя, КаталогОшибок+"\Ошибки\"+ИскКаталог.Имя+"\"+Файл.Имя);
						 КопироватьФайл(Файл.ПолноеИмя, КаталогОшибок+"\Ошибки\"+НомерКоробки+"\"+ИскКаталог.Имя+"\"+Файл.Имя);
						 //крохин конец 27.09.2011
					 КонецЦикла;
					 Продолжить;	
				 КонецЕсли;
				 
				 Если Найти(СокрЛП(ИскКаталог.Имя)," ") <> 0 Тогда	//дубли	
					 РасшифровкаИмениКаталога=Лев(СокрЛП(ИскКаталог.Имя),Найти(СокрЛП(ИскКаталог.Имя)," "));
					 
					 РасшифровкаИмениКаталога=Раскодировать64Лок(РасшифровкаИмениКаталога);
					 РасшифровкаИмениКаталога = СокрЛП(СтрЗаменить(РасшифровкаИмениКаталога,"*"," "));
					 
					 //крохин начало 27.01.2016
					 //поменялся формат
					 //НайденныеФайлы = НайтиФайлы(ИскКаталог.ПолноеИмя,"*.tif");
					 НайденныеФайлы = НайтиФайлы(ИскКаталог.ПолноеИмя,"*.jpg");
					 //крохин конец 27.01.2016

					 Для Каждого Файл Из НайденныеФайлы Цикл
						 //крохин начало 27.09.2011
					 //ошибки будем писать в каталог с номером коробки
					 //  ИмяДубля = КаталогОшибок+СтрЗаменить("Дубль\"+РасшифровкаИмениКаталога+" "+ТекущаяДата()+".tif",":","");
					 
					 //крохин начало 27.01.2016
					 //поменялся формат
					 //ИмяДубля = КаталогОшибок+СтрЗаменить("Дубль\"+НомерКоробки+"\"+РасшифровкаИмениКаталога+" "+ТекущаяДата()+".tif",":","");
					 ИмяДубля = КаталогОшибок+СтрЗаменить("Дубль\"+НомерКоробки+"\"+РасшифровкаИмениКаталога+" "+ТекущаяДата()+".jpg",":","");
					 //крохин конец 27.01.2016
					 //крохин конец 27.09.2011						 
				     КопироватьФайл(Файл.ПолноеИмя, ИмяДубля);
					 КонецЦикла;
					 Продолжить;			
				 КонецЕсли;	
				 
				 РасшифровкаИмениКаталога=СокрЛП(ИскКаталог.Имя);
				 
				 РасшифровкаИмениКаталога=Раскодировать64Лок(РасшифровкаИмениКаталога);
				 РасшифровкаИмениКаталога = СокрЛП(СтрЗаменить(РасшифровкаИмениКаталога,"*"," "));
				 
				 
				 //крохин начало 27.01.2016
					 //поменялся формат
					 //НайденныеФайлы = НайтиФайлы(ИскКаталог.ПолноеИмя,"*.tif");
					 НайденныеФайлы = НайтиФайлы(ИскКаталог.ПолноеИмя,"*.jpg");
					 //крохин конец 27.01.2016

				 ТаблицаФайлов = Новый ТаблицаЗначений;
				 ТаблицаФайлов.Колонки.Добавить("ПутьКФайлу");
				 ТаблицаФайлов.Колонки.Добавить("НомерСтраницы");
				 Для Каждого Файл Из НайденныеФайлы Цикл
					 СтрокаТЗ = ТаблицаФайлов.Добавить();
					 СтрокаТЗ.ПутьКФайлу = Файл.ПолноеИмя;
					 
					 //крохин начало 27.01.2016
					 //поменялся формат
					 //СтрокаТЗ.НомерСтраницы = Число(СтрЗаменить(СтрЗаменить(Файл.Имя,"страница",""),".tif",""));
					 СтрокаТЗ.НомерСтраницы = Число(СтрЗаменить(СтрЗаменить(Файл.Имя,"страница",""),".jpg",""));
					 //крохин конец 27.01.2016
				 КонецЦикла;
			 КонецЕсли;
			 
			 ТаблицаФайлов.Сортировать("номерСтраницы");
			 ПервыйФайл = Истина;
			 //Индикатор = 0;
			 //ЭлементыФормы.Индикатор.МаксимальноеЗначение = ТаблицаФайлов.Количество();
			 Для Каждого СтрокаТЗ Из ТаблицаФайлов Цикл
				 //	Индикатор = Индикатор + 1;
				 Если ПервыйФайл Тогда
					 ВидДокумента = Лев(РасшифровкаИмениКаталога,Найти(РасшифровкаИмениКаталога," ")-1);
					 Если ВидДокумента <> "РНК" И ВидДокумента <> "СФ"  Тогда
						 	 //крохин начало 27.09.2011
					 //ошибки будем писать в каталог с номером коробки
					//	 ИмяОшибки = (КаталогОшибок+"Ошибки\Неверный ШК"+СтрЗаменить(ТекущаяДата(),":","")+".tif");
						 
						  //крохин начало 27.01.2016
					 //поменялся формат
					 //ИмяОшибки = (КаталогОшибок+"Ошибки\"+НомерКоробки+"\Неверный ШК"+СтрЗаменить(ТекущаяДата(),":","")+".tif");
					 ИмяОшибки = (КаталогОшибок+"Ошибки\"+НомерКоробки+"\Неверный ШК"+СтрЗаменить(ТекущаяДата(),":","")+".jpg");
					 //крохин конец 27.01.2016
                      //крохин конец
						 КопироватьФайл(СтрокаТЗ.ПутьКФайлу, ИмяОшибки);
						 Продолжить;
					 КонецЕсли;
					 Остаток = СтрЗаменить(РасшифровкаИмениКаталога,ВидДокумента + " ","");
					 НомерДокумента = Лев(Остаток,Найти(Остаток," ")-1);
					 Остаток = СтрЗаменить(Остаток,НомерДокумента + " ","");
					 Год = Лев(Остаток,2);
					 //крохин начало 18.08.2011
					 //если ШК неверный, скорее всего уже первые цифры будут кривыми
					 Попытка
						 Проверка = Дата(2000+Год,1,1);	 
					 Исключение
						 //крохин начало 27.09.2011
						 //ошибки будем писать в каталог с номером коробки
						 
						 //	  ИмяОшибки = (КаталогОшибок+"Ошибки\Неверный ШК"+СтрЗаменить(ТекущаяДата(),":","")+".tif");
						 
						  //крохин начало 27.01.2016
					 //поменялся формат
					 //ИмяОшибки = (КаталогОшибок+"Ошибки\"+НомерКоробки+"\Неверный ШК"+СтрЗаменить(ТекущаяДата(),":","")+".tif");
					 ИмяОшибки = (КаталогОшибок+"Ошибки\"+НомерКоробки+"\Неверный ШК"+СтрЗаменить(ТекущаяДата(),":","")+".jpg");
					 //крохин конец 27.01.2016
						 //крохин конец 27.09.2011
						 КопироватьФайл(СтрокаТЗ.ПутьКФайлу, ИмяОшибки);
						 Продолжить;
					 КонецПопытки;
				     //крохин конец 18.08.2011
					 Каталог = ВидДокумента + " "+НомерДокумента+" "+Год;
					 Остаток = Прав(Остаток,СтрДлина(Остаток)-3);
					 НомерСтраницы = Лев(Остаток,Найти(Остаток," ")-1);
					 Остаток = СтрЗаменить(Остаток,НомерСтраницы + " ","");
					 
					 //крохин начало 27.01.2016
					 //поменялся формат
					 //ВсегоСтраниц = СтрЗаменить(Остаток,".tif","");
					 ВсегоСтраниц = СтрЗаменить(Остаток,".jpg","");
					 //крохин конец 27.01.2016
					 Если ВидДокумента = "СФ" Тогда
						 НомерДокументаРНК = НайтиНомерРНКПоСФ(НомерДокумента,Год);
						 Если  НомерДокументаРНК <> "" Тогда
							 Каталог = "РНК" + " "+НомерДокументаРНК+" "+Год;	
						 КонецЕсли;
					 КонецЕсли;
					 ПервыйФайл = Ложь;
					 ИмяКаталогаДокумента = КаталогЗагрузки + "\"+ ВидДокумента+" "+НомерДокумента + " год 20"+Год;
					 СоздатьКаталог(КаталогЗагрузки +Каталог);
					 попытка
						 ИмяФайла =  ""+ВидДокумента+" "+НомерДокумента + " год 20"+Год+" стр "+Формат(Число(НомерСтраницы),"ЧЦ=3; ЧВН=")+" из "+Формат(Число(ВсегоСтраниц),"ЧЦ=3; ЧВН=");
					 исключение
						 НомерСтраницы = 1;
						 ВсегоСтраниц = 1;
						 ИмяФайла =  ""+ВидДокумента+" "+НомерДокумента + " год 20"+Год+" стр "+Формат(Число(НомерСтраницы),"ЧЦ=3; ЧВН=")+" из "+Формат(Число(ВсегоСтраниц),"ЧЦ=3; ЧВН=");
					 конецпопытки;
					 //проверка документа
					 Если ВидДокумента = "СФ" Тогда
						 Документ =  Документы.РасходнаяНакладная.НайтиПоНомеру(НомерДокументаРНК,Дата(2000+Год,1,1));
					 Иначе
						 Документ =  Документы.РасходнаяНакладная.НайтиПоНомеру(НомерДокумента,Дата(2000+Год,1,1));	
					 КонецЕсли;
					 Если Документ = Документы.РасходнаяНакладная.ПустаяСсылка() Тогда
						  //крохин начало 27.09.2011
						 //ошибки будем писать в каталог с номером коробки
						// КопироватьФайл(СтрокаТЗ.ПутьКФайлу, КаталогОшибок+"Нет документа в базе\"+ИмяФайла+".tif");
						 
						 //крохин начало 27.01.2016
					 //поменялся формат
					 //КопироватьФайл(СтрокаТЗ.ПутьКФайлу, КаталогОшибок+"Нет документа в базе\"+НомерКоробки+"\"+ИмяФайла+".tif");
					 КопироватьФайл(СтрокаТЗ.ПутьКФайлу, КаталогОшибок+"Нет документа в базе\"+НомерКоробки+"\"+ИмяФайла+".jpg");
					 //крохин конец 27.01.2016
						 //крохин конец 27.09.2011
						 Продолжить;	
					 КонецЕсли;
					 
					 ЗапросСостоянияДокументов = Новый запрос;
					 ЗапросСостоянияДокументов.Текст = "ВЫБРАТЬ
					 |	СостояниеСкановДокументов.Документ,
					 |	СостояниеСкановДокументов.СостояниеЭлектронногоДокумента,
					 |	СостояниеСкановДокументов.НомерКоробки
					 |ИЗ
					 |	РегистрСведений.СостояниеСкановДокументов КАК СостояниеСкановДокументов
					 |ГДЕ
					 |	СостояниеСкановДокументов.Документ = &Документ";
					 ЗапросСостоянияДокументов.УстановитьПараметр("Документ",Документ.Ссылка);
					 Выборка = ЗапросСостоянияДокументов.Выполнить().Выбрать();
					 Если Выборка.Следующий() Тогда
						 СостояниеДокументов = Выборка.СостояниеЭлектронногоДокумента;
					 Иначе
						 СостояниеДокументов = Перечисления.СостояниеЭлектронныхДокументов.СканОтсутствует;
					 КонецЕсли;
					 
					 
					 Если СостояниеДокументов = Перечисления.СостояниеЭлектронныхДокументов.СканПроверен Тогда
						  //крохин начало 27.09.2011
						 //ошибки будем писать в каталог с номером коробки
					//	 КопироватьФайл(СтрокаТЗ.ПутьКФайлу, КаталогОшибок+"Уже провереные\"+ИмяФайла+".tif");
					СоздатьКаталог(КаталогОшибок+"Уже провереные\"+НомерКоробки+"\");
						 
						  //крохин начало 27.01.2016
					 //поменялся формат
					 //КопироватьФайл(СтрокаТЗ.ПутьКФайлу, КаталогОшибок+"Уже провереные\"+НомерКоробки+"\"+ИмяФайла+".tif");
					 КопироватьФайл(СтрокаТЗ.ПутьКФайлу, КаталогОшибок+"Уже провереные\"+НомерКоробки+"\"+ИмяФайла+".jpg");
					 //крохин конец 27.01.2016
						 //крохин конец 27.09.2011
						 Продолжить;
					 КонецЕсли;
					 
					  //крохин начало 27.01.2016
					 //поменялся формат
					 //КопироватьФайл(СтрокаТЗ.ПутьКФайлу, КаталогЗагрузки +Каталог+"\"+ИмяФайла+".tif");
					 КопироватьФайл(СтрокаТЗ.ПутьКФайлу, КаталогЗагрузки +Каталог+"\"+ИмяФайла+".jpg");
					 //крохин конец 27.01.2016
					 //крохин начало 14.10.2011
					 //копируем номер коробки, для контроля. Не используем объект, это ошибка!
					 КопироватьФайл(Константы.КаталогВнешнихОтчетов.Получить()+"TEST.txt", КаталогЗагрузки +Каталог+"\"+НомерКоробки+".txt");					 
					// Документ = Документ.ПолучитьОбъект();
					 //крохин конец 14.10.2011
					 //Если Документ.СостояниеДокументов <> Перечисления.СостояниеДокументов.ПолученоИзображение Тогда
					 //	Документ.УстановитьСостояниеДокументов(Перечисления.СостояниеДокументов.ПолученоИзображение);
					 //КонецЕсли;
					 НаборЗаписей = РегистрыСведений.СостояниеСкановДокументов.СоздатьНаборЗаписей();
					 НаборЗаписей.Отбор.документ.Использование = Истина;
					 НаборЗаписей.Отбор.документ.Значение = Документ.Ссылка;
					 НаборЗаписей.Очистить();
					 Запись = НаборЗаписей.Добавить();
					 Запись.Документ = Документ.Ссылка;
					 Запись.НомерКоробки = НомерКоробки;
					 Запись.СостояниеЭлектронногоДокумента = Перечисления.СостояниеЭлектронныхДокументов.СканПолучен;
					 НаборЗаписей.Записать();
				 Иначе
					 //крохин начало 27.09.2011
						 //ошибки будем писать в каталог с номером коробки
					//	 ИмяОшибки = (КаталогОшибок+"Ошибки\"+СтрЗаменить(ТекущаяДата(),":","")+".tif");
					 
					 //крохин начало 27.01.2016
					 //поменялся формат
					 //ИмяОшибки = (КаталогОшибок+"Ошибки\"+НомерКоробки+"\"+СтрЗаменить(ТекущаяДата(),":","")+".tif");
					 ИмяОшибки = (КаталогОшибок+"Ошибки\"+НомерКоробки+"\"+СтрЗаменить(ТекущаяДата(),":","")+".jpg");
					 //крохин конец 27.01.2016
					 //крохин конец 27.09.2011
					 КопироватьФайл(СтрокаТЗ.ПутьКФайлу, ИмяОшибки);
				 КонецЕсли;
			 КонецЦикла;
			 
			 
		 КонецЦикла;
		 УдалитьФайлы(КаталогДок.ПолноеИмя); 
	 КонецЦикла;
	 
	 #Если клиент Тогда
		 Сообщить(ТекущаяДата());
		 Сообщить("Документы без ошибок. Обработка завершена");
	 #КонецЕсли
	
 КонецПроцедуры
 
 //Процедура КаталогВыгрузкиНачалоВыбора(Элемент, СтандартнаяОбработка)
 //	ВыборКаталога(Элемент,Истина);
 //КонецПроцедуры
 
 //Процедура КаталогЗагрузкиНачалоВыбора(Элемент, СтандартнаяОбработка)
 //	ВыборКаталога(Элемент,Истина);
 //КонецПроцедуры
 
 Функция НайтиНомерРНКПоСФ(НомерДокумента,Год)  
	 попытка
	 Запрос = Новый Запрос;
	 запрос.Текст = "ВЫБРАТЬ
	 |	СчетФактураНакладные.Накладная.Номер КАК Номер
	 |ИЗ
	 |	Документ.СчетФактура.Накладные КАК СчетФактураНакладные
	 |ГДЕ
	 |	СчетФактураНакладные.Ссылка.Номер = &Номер
	 |	И СчетФактураНакладные.Ссылка.Дата МЕЖДУ &НачПериода И &КонПериода";
	 Запрос.УстановитьПараметр("Номер",НомерДокумента);
	 Запрос.УстановитьПараметр("Начпериода",Дата(2000+Год,1,1));
	 Запрос.УстановитьПараметр("КонПериода",КонецГода(Дата(2000+Год,1,1)));
	 Выборка = Запрос.Выполнить().Выбрать();
	 Если Выборка.Следующий() Тогда
		 Возврат Выборка.Номер; 
	 Иначе
		 Возврат "";
	 КонецЕсли;
 Исключение
	 Возврат "";
	 КонецПопытки;
 КонецФункции
 
 //Процедура КаталогОшибокНачалоВыбора(Элемент, СтандартнаяОбработка)
 //		ВыборКаталога(Элемент,Истина);
 //КонецПроцедуры
 
 
 Функция Раскодировать64Лок(НачСтр) Экспорт 
	 База="ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";
	 
	 Стр=СокрЛП(НачСтр);
	 
	 СтрокаБит="";
	 
	 Длина=СтрДлина(Стр);
	 
	 ПолнаяСтрока="";
	 Для Сч=1 По Длина Цикл
		 Символ=Сред(Стр,Сч,1);
		 Десятичное=Найти(База,Символ)-1;		
		 СтрокаБит=СтрокаБит+Сред(БинарноеЛок(Десятичное),3);		
	 КонецЦикла;
	 
	 СтрокаИсходная="";
	 Пока СтрДлина(СтрокаБит)>0 Цикл		
		 БитовоеЗначение=Лев(СтрокаБит,8);
		 
		 СтрокаИсходная	=СтрокаИсходная+СимволпоБайтовомуКоду(ДесятичноеЛок(БитовоеЗначение));			    
		 СтрокаБит		=Сред(СтрокаБит,9);
	 КонецЦикла;                      
	 
	 Возврат СтрокаИсходная;	    
 КонецФункции //Раскодировать
 
 
 Функция БинарноеЛок(НачЗн)
	 Зн=НачЗн;	
	 Стр="";	
	 Для Сч=1 по 8 Цикл
		 Бит=Зн%2;
		 
		 Стр=""+Бит+Стр;   
		 Зн=(Зн-Бит)/2;		
	 КонецЦикла;     
	 
	 Возврат Стр;
 КонецФункции //
 
 Функция СимволПоБайтовомуКоду(Код)
	 
	 
	 КодировкаОбратная=Новый Соответствие;
	 
	 КодировкаОбратная.Вставить(32," ");
	 КодировкаОбратная.Вставить(33,"!");
	 КодировкаОбратная.Вставить(34,"""");
	 КодировкаОбратная.Вставить(35,"#");
	 КодировкаОбратная.Вставить(36,"$");
	 КодировкаОбратная.Вставить(37,"%");
	 КодировкаОбратная.Вставить(38,"&");
	 КодировкаОбратная.Вставить(39,"'");
	 КодировкаОбратная.Вставить(40,"(");
	 КодировкаОбратная.Вставить(41,")");
	 КодировкаОбратная.Вставить(42,"*");
	 КодировкаОбратная.Вставить(43,"+");
	 КодировкаОбратная.Вставить(44,",");
	 КодировкаОбратная.Вставить(45,"-");
	 КодировкаОбратная.Вставить(46,".");
	 КодировкаОбратная.Вставить(47,"/");
	 КодировкаОбратная.Вставить(48,"0");
	 КодировкаОбратная.Вставить(49,"1");
	 КодировкаОбратная.Вставить(50,"2");
	 КодировкаОбратная.Вставить(51,"3");
	 КодировкаОбратная.Вставить(52,"4");
	 КодировкаОбратная.Вставить(53,"5");
	 КодировкаОбратная.Вставить(54,"6");
	 КодировкаОбратная.Вставить(55,"7");
	 КодировкаОбратная.Вставить(56,"8");
	 КодировкаОбратная.Вставить(57,"9");
	 КодировкаОбратная.Вставить(58,":");
	 КодировкаОбратная.Вставить(59,";");
	 КодировкаОбратная.Вставить(60,"<");
	 КодировкаОбратная.Вставить(61,"=");
	 КодировкаОбратная.Вставить(62,">");
	 КодировкаОбратная.Вставить(63,"?");
	 КодировкаОбратная.Вставить(64,"@");
	 КодировкаОбратная.Вставить(65,"A");
	 КодировкаОбратная.Вставить(66,"B");
	 КодировкаОбратная.Вставить(67,"C");
	 КодировкаОбратная.Вставить(68,"D");
	 КодировкаОбратная.Вставить(69,"E");
	 КодировкаОбратная.Вставить(70,"F");
	 КодировкаОбратная.Вставить(71,"G");
	 КодировкаОбратная.Вставить(72,"H");
	 КодировкаОбратная.Вставить(73,"I");
	 КодировкаОбратная.Вставить(74,"J");
	 КодировкаОбратная.Вставить(75,"K");
	 КодировкаОбратная.Вставить(76,"L");
	 КодировкаОбратная.Вставить(77,"M");
	 КодировкаОбратная.Вставить(78,"N");
	 КодировкаОбратная.Вставить(79,"O");
	 КодировкаОбратная.Вставить(80,"P");
	 КодировкаОбратная.Вставить(81,"Q");
	 КодировкаОбратная.Вставить(82,"R");
	 КодировкаОбратная.Вставить(83,"S");
	 КодировкаОбратная.Вставить(84,"T");
	 КодировкаОбратная.Вставить(85,"U");
	 КодировкаОбратная.Вставить(86,"V");
	 КодировкаОбратная.Вставить(87,"W");
	 КодировкаОбратная.Вставить(88,"X");
	 КодировкаОбратная.Вставить(89,"Y");
	 КодировкаОбратная.Вставить(90,"Z");
	 КодировкаОбратная.Вставить(91,"[");
	 КодировкаОбратная.Вставить(92,"\");
	 КодировкаОбратная.Вставить(93,"]");
	 КодировкаОбратная.Вставить(94,"^");
	 КодировкаОбратная.Вставить(95,"_");
	 КодировкаОбратная.Вставить(96,"`");
	 КодировкаОбратная.Вставить(97,"a");
	 КодировкаОбратная.Вставить(98,"b");
	 КодировкаОбратная.Вставить(99,"c");
	 КодировкаОбратная.Вставить(100,"d");
	 КодировкаОбратная.Вставить(101,"e");
	 КодировкаОбратная.Вставить(102,"f");
	 КодировкаОбратная.Вставить(103,"g");
	 КодировкаОбратная.Вставить(104,"h");
	 КодировкаОбратная.Вставить(105,"i");
	 КодировкаОбратная.Вставить(106,"j");
	 КодировкаОбратная.Вставить(107,"k");
	 КодировкаОбратная.Вставить(108,"l");
	 КодировкаОбратная.Вставить(109,"m");
	 КодировкаОбратная.Вставить(110,"n");
	 КодировкаОбратная.Вставить(111,"o");
	 КодировкаОбратная.Вставить(112,"p");
	 КодировкаОбратная.Вставить(113,"q");
	 КодировкаОбратная.Вставить(114,"r");
	 КодировкаОбратная.Вставить(115,"s");
	 КодировкаОбратная.Вставить(116,"t");
	 КодировкаОбратная.Вставить(117,"u");
	 КодировкаОбратная.Вставить(118,"v");
	 КодировкаОбратная.Вставить(119,"w");
	 КодировкаОбратная.Вставить(120,"x");
	 КодировкаОбратная.Вставить(121,"y");
	 КодировкаОбратная.Вставить(122,"z");
	 КодировкаОбратная.Вставить(123,"{");
	 КодировкаОбратная.Вставить(124,"|");
	 КодировкаОбратная.Вставить(125,"}");
	 КодировкаОбратная.Вставить(126,"~");
	 КодировкаОбратная.Вставить(127,"");
	 КодировкаОбратная.Вставить(128,"Ђ");
	 КодировкаОбратная.Вставить(129,"Ѓ");
	 КодировкаОбратная.Вставить(130,"‚");
	 КодировкаОбратная.Вставить(131,"ѓ");
	 КодировкаОбратная.Вставить(132,"„");
	 КодировкаОбратная.Вставить(133,"…");
	 КодировкаОбратная.Вставить(134,"†");
	 КодировкаОбратная.Вставить(135,"‡");
	 КодировкаОбратная.Вставить(136,"€");
	 КодировкаОбратная.Вставить(137,"‰");
	 КодировкаОбратная.Вставить(138,"Љ");
	 КодировкаОбратная.Вставить(139,"‹");
	 КодировкаОбратная.Вставить(140,"Њ");
	 КодировкаОбратная.Вставить(141,"Ќ");
	 КодировкаОбратная.Вставить(142,"Ћ");
	 КодировкаОбратная.Вставить(143,"Џ");
	 КодировкаОбратная.Вставить(144,"ђ");
	 КодировкаОбратная.Вставить(145,"‘");
	 КодировкаОбратная.Вставить(146,"’");
	 КодировкаОбратная.Вставить(147,"“");
	 КодировкаОбратная.Вставить(148,"”");
	 КодировкаОбратная.Вставить(149,"•");
	 КодировкаОбратная.Вставить(150,"–");
	 КодировкаОбратная.Вставить(151,"—");
	 КодировкаОбратная.Вставить(152,"");
	 КодировкаОбратная.Вставить(153,"™");
	 КодировкаОбратная.Вставить(154,"љ");
	 КодировкаОбратная.Вставить(155,"›");
	 КодировкаОбратная.Вставить(156,"њ");
	 КодировкаОбратная.Вставить(157,"ќ");
	 КодировкаОбратная.Вставить(158,"ћ");
	 КодировкаОбратная.Вставить(159,"џ");
	 КодировкаОбратная.Вставить(160," ");
	 КодировкаОбратная.Вставить(161,"Ў");
	 КодировкаОбратная.Вставить(162,"ў");
	 КодировкаОбратная.Вставить(163,"Ј");
	 КодировкаОбратная.Вставить(164,"¤");
	 КодировкаОбратная.Вставить(165,"Ґ");
	 КодировкаОбратная.Вставить(166,"¦");
	 КодировкаОбратная.Вставить(167,"§");
	 КодировкаОбратная.Вставить(168,"Ё");
	 КодировкаОбратная.Вставить(169,"©");
	 КодировкаОбратная.Вставить(170,"Є");
	 КодировкаОбратная.Вставить(171,"«");
	 КодировкаОбратная.Вставить(172,"¬");
	 КодировкаОбратная.Вставить(173,"");
	 КодировкаОбратная.Вставить(174,"®");
	 КодировкаОбратная.Вставить(175,"Ї");
	 КодировкаОбратная.Вставить(176,"°");
	 КодировкаОбратная.Вставить(177,"±");
	 КодировкаОбратная.Вставить(178,"І");
	 КодировкаОбратная.Вставить(179,"і");
	 КодировкаОбратная.Вставить(180,"ґ");
	 КодировкаОбратная.Вставить(181,"µ");
	 КодировкаОбратная.Вставить(182,"¶");
	 КодировкаОбратная.Вставить(183,"·");
	 КодировкаОбратная.Вставить(184,"ё");
	 КодировкаОбратная.Вставить(185,"№");
	 КодировкаОбратная.Вставить(186,"є");
	 КодировкаОбратная.Вставить(187,"»");
	 КодировкаОбратная.Вставить(188,"ј");
	 КодировкаОбратная.Вставить(189,"Ѕ");
	 КодировкаОбратная.Вставить(190,"ѕ");
	 КодировкаОбратная.Вставить(191,"ї");
	 КодировкаОбратная.Вставить(192,"А");
	 КодировкаОбратная.Вставить(193,"Б");
	 КодировкаОбратная.Вставить(194,"В");
	 КодировкаОбратная.Вставить(195,"Г");
	 КодировкаОбратная.Вставить(196,"Д");
	 КодировкаОбратная.Вставить(197,"Е");
	 КодировкаОбратная.Вставить(198,"Ж");
	 КодировкаОбратная.Вставить(199,"З");
	 КодировкаОбратная.Вставить(200,"И");
	 КодировкаОбратная.Вставить(201,"Й");
	 КодировкаОбратная.Вставить(202,"К");
	 КодировкаОбратная.Вставить(203,"Л");
	 КодировкаОбратная.Вставить(204,"М");
	 КодировкаОбратная.Вставить(205,"Н");
	 КодировкаОбратная.Вставить(206,"О");
	 КодировкаОбратная.Вставить(207,"П");
	 КодировкаОбратная.Вставить(208,"Р");
	 КодировкаОбратная.Вставить(209,"С");
	 КодировкаОбратная.Вставить(210,"Т");
	 КодировкаОбратная.Вставить(211,"У");
	 КодировкаОбратная.Вставить(212,"Ф");
	 КодировкаОбратная.Вставить(213,"Х");
	 КодировкаОбратная.Вставить(214,"Ц");
	 КодировкаОбратная.Вставить(215,"Ч");
	 КодировкаОбратная.Вставить(216,"Ш");
	 КодировкаОбратная.Вставить(217,"Щ");
	 КодировкаОбратная.Вставить(218,"Ъ");
	 КодировкаОбратная.Вставить(219,"Ы");
	 КодировкаОбратная.Вставить(220,"Ь");
	 КодировкаОбратная.Вставить(221,"Э");
	 КодировкаОбратная.Вставить(222,"Ю");
	 КодировкаОбратная.Вставить(223,"Я");
	 КодировкаОбратная.Вставить(224,"а");
	 КодировкаОбратная.Вставить(225,"б");
	 КодировкаОбратная.Вставить(226,"в");
	 КодировкаОбратная.Вставить(227,"г");
	 КодировкаОбратная.Вставить(228,"д");
	 КодировкаОбратная.Вставить(229,"е");
	 КодировкаОбратная.Вставить(230,"ж");
	 КодировкаОбратная.Вставить(231,"з");
	 КодировкаОбратная.Вставить(232,"и");
	 КодировкаОбратная.Вставить(233,"й");
	 КодировкаОбратная.Вставить(234,"к");
	 КодировкаОбратная.Вставить(235,"л");
	 КодировкаОбратная.Вставить(236,"м");
	 КодировкаОбратная.Вставить(237,"н");
	 КодировкаОбратная.Вставить(238,"о");
	 КодировкаОбратная.Вставить(239,"п");
	 КодировкаОбратная.Вставить(240,"р");
	 КодировкаОбратная.Вставить(241,"с");
	 КодировкаОбратная.Вставить(242,"т");
	 КодировкаОбратная.Вставить(243,"у");
	 КодировкаОбратная.Вставить(244,"ф");
	 КодировкаОбратная.Вставить(245,"х");
	 КодировкаОбратная.Вставить(246,"ц");
	 КодировкаОбратная.Вставить(247,"ч");
	 КодировкаОбратная.Вставить(248,"ш");
	 КодировкаОбратная.Вставить(249,"щ");
	 КодировкаОбратная.Вставить(250,"ъ");
	 КодировкаОбратная.Вставить(251,"ы");
	 КодировкаОбратная.Вставить(252,"ь");
	 КодировкаОбратная.Вставить(253,"э");
	 КодировкаОбратная.Вставить(254,"ю");
	 КодировкаОбратная.Вставить(255,"я");
	 Возврат КодировкаОбратная[Код];
 КонецФункции // ()
 
 Функция ДесятичноеЛок(НачЗн)
	 Зн=0;
	 База=128;
	 
	 ТекДлинна=Мин(СтрДлина(НачЗн),8);
	 
	 Для Сч=1 по ТекДлинна Цикл
		 Зн=Зн+База*Число(Сред(НачЗн,Сч,1));					    
		 База=База/2;
	 КонецЦикла;
	 
	 Возврат Зн;
 КонецФункции //Десятичное
 
 
 Процедура СформироватьОшибки(НомерКоробкиДляОбработки = Неопределено)  Экспорт
	 #Если клиент Тогда
		 Сообщить(ТекущаяДата());
		 Состояние("документы с ошибками");
	 #КонецЕсли
	 КаталогОшибок   = Константы.КаталогДокументов.Получить()+ "Ошибки\";
	 КаталогЗагрузки = Константы.КаталогДокументов.Получить();
//	 КаталогВыгрузки = Константы.КаталогНеобработанныхСканов.Получить();
//	 КаталогОшибок   = "\\srvfile\Сканы документов к Обработке\Ошибки\";
//	 КаталогЗагрузки = "\\srvfile\Сканы документов к Обработке\";
	 КаталогВыгрузки = "\\srvfile\Сканы документов к Обработке\";

	 
	 СоздатьКаталог(КаталогОшибок+"Дубль\");
	 СоздатьКаталог(КаталогОшибок+"Ошибки\");
	 СоздатьКаталог(КаталогОшибок+"Нет документа в базе\");
	 СоздатьКаталог(КаталогОшибок+"Уже провереные\");
	 
	 
	 
	 СписокОтработанныхКаталогов = Новый СписокЗначений;
	 НайденныеКаталогиДокументов = НайтиФайлы(КаталогВыгрузки,"*");
	 
	 Для Каждого ИскКаталогДокументов Из НайденныеКаталогиДокументов Цикл
		 //крохин начало 02.03.2012
		 //Если ИскКаталогДокументов.Имя = ИскКаталогДокументов.ИмяБезРасширения  И Найти(ИскКаталогДокументов.Имя,"Ошибки") Тогда	
		 Если ИскКаталогДокументов.ЭтоКаталог() И Найти(ИскКаталогДокументов.Имя,"Ошибки") Тогда
			 //крохин конец 02.03.2012
			 НайденныеКаталогиДок = НайтиФайлы(ИскКаталогДокументов.ПолноеИмя,"*");
			 Для Каждого КаталогДок Из НайденныеКаталогиДок Цикл
				 //крохин начало 02.03.2012
				 //Если КаталогДок.Имя = КаталогДок.ИмяБезРасширения  И Найти(КаталогДок.Имя,"Кор") Тогда
				 					 //крохин начало 06.12.2012
	 //по одной коробке
	// Если КаталогДок.ЭтоКаталог() И Найти(КаталогДок.Имя,"Кор") Тогда
	Если КаталогДок.ЭтоКаталог() И Найти(КаталогДок.Имя,"Кор"+НомерКоробкиДляОбработки.Код) Тогда
	//крохин конец 06.12.2012

					 //крохин конец 02.03.2012
					 НайденныеКаталогиПакет = НайтиФайлы(КаталогДок.ПолноеИмя,"*");
					 НомерКоробки = ПолучитьНомерКоробки(КаталогДок);
					 				  //крохин начало 27.09.2011
	 //ошибки будем писать в каталог с номером коробки
	  СоздатьКаталог(КаталогОшибок+"Дубль\"+НомерКоробки+"\");
	 СоздатьКаталог(КаталогОшибок+"Ошибки\"+НомерКоробки+"\");
	 СоздатьКаталог(КаталогОшибок+"Нет документа в базе\"+НомерКоробки+"\");
	 СоздатьКаталог(КаталогОшибок+"Уже провереные\"+НомерКоробки+"\");
	 //крохин конец 27.09.2011
	 Для Каждого КаталогДокПакет Из НайденныеКаталогиПакет Цикл
		 //крохин начало 02.03.2012
		 //Если КаталогДокПакет.Имя = КаталогДокПакет.ИмяБезРасширения  И Найти(КаталогДокПакет.Имя,"Доверенности") Тогда	
		 Если КаталогДокПакет.ЭтоКаталог()  И Найти(КаталогДокПакет.Имя,"Доверенности") Тогда
			 //крохин конец 02.03.2012
				     ЗаписатьДоверенности(КаталогДокПакет,НомерКоробки);
				     Продолжить;
			         КонецЕсли;
                     КонецЦикла;
					 Для Каждого КаталогДокПакет Из НайденныеКаталогиПакет Цикл
						 //крохин начало 02.03.2012
						 //Если КаталогДокПакет.Имя = КаталогДокПакет.ИмяБезРасширения  И Найти(КаталогДокПакет.Имя,"пакет") Тогда
						 Если КаталогДокПакет.ЭтоКаталог() И Найти(КаталогДокПакет.Имя,"пакет") Тогда
							 //крохин конец 02.03.2012
							 НайденныеКаталоги = НайтиФайлы(КаталогДокПакет.ПолноеИмя,"*");
							 Прервать;  
						 КонецЕсли;
					 КонецЦикла;
					 Прервать;
				 КонецЕсли;	
			 КонецЦикла;
		 иначе
			 Продолжить;
		 КонецЕсли;
		 Если КаталогДок = Неопределено Тогда Продолжить КонецЕсли;	
		 Если НайденныеКаталоги = Неопределено Тогда Продолжить КонецЕсли;
		 
		 
		 //Индикатор1 = 0;
		 //ЭлементыФормы.Индикатор1.МаксимальноеЗначение = НайденныеКаталоги.Количество();
		 Для Каждого ИскКаталог Из НайденныеКаталоги Цикл
			 //	Индикатор1 = Индикатор1 + 1;
			 #Если клиент Тогда
				 
				 ОбработкаПрерыванияПользователя();
			 #КонецЕсли
			//крохин начало 02.03.2012			 
		//	Если ИскКаталог.Имя = ИскКаталог.ИмяБезРасширения Тогда //проверим, что это каталог
		Если ИскКаталог.ЭтоКаталог() Тогда //проверим, что это каталог
				//крохин конец 02.03.2012
				 Если СтрДлина(ИскКаталог.Имя) < 5 Тогда
					 //крохин начало 27.09.2011
					 //ошибки будем писать в каталог с номером коробки
					 //СоздатьКаталог(КаталогОшибок+"Ошибки\"+ИскКаталог.Имя+"\");
					 СоздатьКаталог(КаталогОшибок+"Ошибки\"+НомерКоробки+"\"+ИскКаталог.Имя+"\");
					 //крохин конец 27.09.2011
					 
					  //крохин начало 27.01.2016
					 //поменялся формат
					 //НайденныеФайлы = НайтиФайлы(ИскКаталог.ПолноеИмя,"*.tif");
					 НайденныеФайлы = НайтиФайлы(ИскКаталог.ПолноеИмя,"*.jpg");
					 //крохин конец 27.01.2016
					 Для Каждого Файл Из НайденныеФайлы Цикл
						 //крохин начало 27.09.2011
					 //ошибки будем писать в каталог с номером коробки
						 КопироватьФайл(Файл.ПолноеИмя, КаталогОшибок+"\Ошибки\"+НомерКоробки+"\"+ИскКаталог.Имя+"\"+Файл.Имя);	
						 //крохин конец 27.09.2011
					 КонецЦикла;
					 Продолжить;	
				 КонецЕсли;
				 
				 Если Найти(СокрЛП(ИскКаталог.Имя)," ") <> 0 Тогда	//дубли	
					 РасшифровкаИмениКаталога=Лев(СокрЛП(ИскКаталог.Имя),Найти(СокрЛП(ИскКаталог.Имя)," "));
					 
					 РасшифровкаИмениКаталога=Раскодировать64Лок(РасшифровкаИмениКаталога);
					 РасшифровкаИмениКаталога = СокрЛП(СтрЗаменить(РасшифровкаИмениКаталога,"*"," "));
					 
					 
					 
					  //крохин начало 27.01.2016
					 //поменялся формат
					 //НайденныеФайлы = НайтиФайлы(ИскКаталог.ПолноеИмя,"*.tif");
					 НайденныеФайлы = НайтиФайлы(ИскКаталог.ПолноеИмя,"*.jpg");
					 //крохин конец 27.01.2016
					 Для Каждого Файл Из НайденныеФайлы Цикл
						 //крохин начало 27.09.2011
					 //ошибки будем писать в каталог с номером коробки
					//	 ИмяДубля = КаталогОшибок+СтрЗаменить("Дубль\"+РасшифровкаИмениКаталога+" "+ТекущаяДата()+".tif",":","");
					
					//крохин начало 27.01.2016
					 //поменялся формат
					 //ИмяДубля = КаталогОшибок+СтрЗаменить("Дубль\"+НомерКоробки+"\"+РасшифровкаИмениКаталога+" "+ТекущаяДата()+".tif",":","");
					 ИмяДубля = КаталогОшибок+СтрЗаменить("Дубль\"+НомерКоробки+"\"+РасшифровкаИмениКаталога+" "+ТекущаяДата()+".jpg",":","");
					 //крохин конец 27.01.2016
					//крохин конец 27.09.2011
						 КопироватьФайл(Файл.ПолноеИмя, ИмяДубля);
					 КонецЦикла;
					 Продолжить;			
				 КонецЕсли;	
				 РасшифровкаИмениКаталога=СокрЛП(ИскКаталог.Имя);
				 
				 РасшифровкаИмениКаталога=Раскодировать64Лок(РасшифровкаИмениКаталога);
				 РасшифровкаИмениКаталога = СокрЛП(СтрЗаменить(РасшифровкаИмениКаталога,"*"," "));
				 
				 
				 //крохин начало 27.01.2016
					 //поменялся формат
					 //НайденныеФайлы = НайтиФайлы(ИскКаталог.ПолноеИмя,"*.tif");
					 НайденныеФайлы = НайтиФайлы(ИскКаталог.ПолноеИмя,"*.jpg");
					 //крохин конец 27.01.2016
				 ТаблицаФайлов = Новый ТаблицаЗначений;
				 ТаблицаФайлов.Колонки.Добавить("ПутьКФайлу");
				 ТаблицаФайлов.Колонки.Добавить("НомерСтраницы");
				 Для Каждого Файл Из НайденныеФайлы Цикл
					 СтрокаТЗ = ТаблицаФайлов.Добавить();
					 СтрокаТЗ.ПутьКФайлу = Файл.ПолноеИмя;
					 СтрокаТЗ.НомерСтраницы = Число(СтрЗаменить(СтрЗаменить(Файл.Имя,"страница",""),".tif",""));
					 //крохин начало 27.01.2016
					 //поменялся формат
					 //СтрокаТЗ.НомерСтраницы = Число(СтрЗаменить(СтрЗаменить(Файл.Имя,"страница",""),".tif",""));
					 СтрокаТЗ.НомерСтраницы = Число(СтрЗаменить(СтрЗаменить(Файл.Имя,"страница",""),".jpg",""));
					 //крохин конец 27.01.2016
				 КонецЦикла;
			 КонецЕсли;
			 
			 ТаблицаФайлов.Сортировать("номерСтраницы");
			 ПервыйФайл = Истина;
			 //Индикатор = 0;
			 //ЭлементыФормы.Индикатор.МаксимальноеЗначение = ТаблицаФайлов.Количество();
			 Для Каждого СтрокаТЗ Из ТаблицаФайлов Цикл
				 //	Индикатор = Индикатор + 1;
				 Если ПервыйФайл Тогда
					 ВидДокумента = Лев(РасшифровкаИмениКаталога,Найти(РасшифровкаИмениКаталога," ")-1);
					 Если ВидДокумента <> "РНК" И ВидДокумента <> "СФ"  Тогда
					 //крохин начало 27.09.2011
					 //ошибки будем писать в каталог с номером коробки	 
					 //ИмяОшибки = (КаталогОшибок+"Ошибки\Неверный ШК"+СтрЗаменить(ТекущаяДата(),":","")+".tif");				
					  //крохин начало 27.01.2016
					 //поменялся формат
					 //ИмяОшибки = (КаталогОшибок+"Ошибки\"+НомерКоробки+"\Неверный ШК"+СтрЗаменить(ТекущаяДата(),":","")+".tif");
					 ИмяОшибки = (КаталогОшибок+"Ошибки\"+НомерКоробки+"\Неверный ШК"+СтрЗаменить(ТекущаяДата(),":","")+".jpg");
					 //крохин конец 27.01.2016
					 //крохин конец 27.09.2011
					 КопироватьФайл(СтрокаТЗ.ПутьКФайлу, ИмяОшибки);
	                Продолжить;
					 КонецЕсли;

					 Остаток = СтрЗаменить(РасшифровкаИмениКаталога,ВидДокумента + " ","");
					 НомерДокумента = Лев(Остаток,Найти(Остаток," ")-1);
					 Остаток = СтрЗаменить(Остаток,НомерДокумента + " ","");
					 Год = Лев(Остаток,2);
					 Каталог = ВидДокумента + " "+НомерДокумента+" "+Год;
					 Остаток = Прав(Остаток,СтрДлина(Остаток)-3);
					 НомерСтраницы = Лев(Остаток,Найти(Остаток," ")-1);
					 Остаток = СтрЗаменить(Остаток,НомерСтраницы + " ","");
					 
					  //крохин начало 27.01.2016
					 //поменялся формат
					 //ВсегоСтраниц = СтрЗаменить(Остаток,".tif","");
					 ВсегоСтраниц = СтрЗаменить(Остаток,".jpg","");
					 //крохин конец 27.01.2016
					 Если ВидДокумента = "СФ" Тогда
						 НомерДокументаРНК = НайтиНомерРНКПоСФ(НомерДокумента,Год);
						 Если  НомерДокументаРНК <> "" Тогда
							 Каталог = "РНК" + " "+НомерДокументаРНК+" "+Год;	
						 КонецЕсли;
					 КонецЕсли;
					 ПервыйФайл = Ложь;
					 ИмяКаталогаДокумента = КаталогЗагрузки + "\"+ ВидДокумента+" "+НомерДокумента + " год 20"+Год;
					 СоздатьКаталог(КаталогЗагрузки +Каталог);
					 попытка
						 ИмяФайла =  ""+ВидДокумента+" "+НомерДокумента + " год 20"+Год+" стр "+Формат(Число(НомерСтраницы),"ЧЦ=3; ЧВН=")+" из "+Формат(Число(ВсегоСтраниц),"ЧЦ=3; ЧВН=");
					 исключение
						 НомерСтраницы = 1;
						 ВсегоСтраниц = 1;
						 ИмяФайла =  ""+ВидДокумента+" "+НомерДокумента + " год 20"+Год+" стр "+Формат(Число(НомерСтраницы),"ЧЦ=3; ЧВН=")+" из "+Формат(Число(ВсегоСтраниц),"ЧЦ=3; ЧВН=");
					 конецпопытки;
					 //проверка документа
					 Если ВидДокумента = "СФ" Тогда
						 Документ =  Документы.РасходнаяНакладная.НайтиПоНомеру(НомерДокументаРНК,Дата(2000+Год,1,1));
					 Иначе
						 Документ =  Документы.РасходнаяНакладная.НайтиПоНомеру(НомерДокумента,Дата(2000+Год,1,1));	
					 КонецЕсли;
					 Если Документ = Документы.РасходнаяНакладная.ПустаяСсылка() Тогда
						 					 //крохин начало 27.09.2011
					 //ошибки будем писать в каталог с номером коробки	
						// КопироватьФайл(СтрокаТЗ.ПутьКФайлу, КаталогОшибок+"Нет документа в базе\"+ИмяФайла+".tif");	
						 
						 //крохин начало 27.01.2016
					 //поменялся формат
					 //КопироватьФайл(СтрокаТЗ.ПутьКФайлу, КаталогОшибок+"Нет документа в базе\"+НомерКоробки+"\"+ИмяФайла+".tif");
					 КопироватьФайл(СтрокаТЗ.ПутьКФайлу, КаталогОшибок+"Нет документа в базе\"+НомерКоробки+"\"+ИмяФайла+".jpg");
					 //крохин конец 27.01.2016

						 //крохин конец 27.09.2011
						 Продолжить;	
					 КонецЕсли;
					 
					 ЗапросСостоянияДокументов = Новый запрос;
					 ЗапросСостоянияДокументов.Текст = "ВЫБРАТЬ
					 |	СостояниеСкановДокументов.Документ,
					 |	СостояниеСкановДокументов.СостояниеЭлектронногоДокумента,
					 |	СостояниеСкановДокументов.НомерКоробки
					 |ИЗ
					 |	РегистрСведений.СостояниеСкановДокументов КАК СостояниеСкановДокументов
					 |ГДЕ
					 |	СостояниеСкановДокументов.Документ = &Документ";
					 ЗапросСостоянияДокументов.УстановитьПараметр("Документ",Документ.Ссылка);
					 Выборка = ЗапросСостоянияДокументов.Выполнить().Выбрать();
					 Если Выборка.Следующий() Тогда
						 СостояниеДокументов = Выборка.СостояниеЭлектронногоДокумента;
					 Иначе
						 СостояниеДокументов = Перечисления.СостояниеЭлектронныхДокументов.СканОтсутствует;
					 КонецЕсли;
					 
					 
					 Если СостояниеДокументов = Перечисления.СостояниеЭлектронныхДокументов.СканПроверен Тогда
						 						 					 //крохин начало 27.09.2011
					 //ошибки будем писать в каталог с номером коробки	
					  //КопироватьФайл(СтрокаТЗ.ПутьКФайлу, КаталогОшибок+"Уже провереные\"+ИмяФайла+".tif");
						 
						 	 //крохин начало 27.01.2016
					 //поменялся формат
					 //КопироватьФайл(СтрокаТЗ.ПутьКФайлу, КаталогОшибок+"Уже провереные\"+НомерКоробки+"\"+ИмяФайла+".tif");
					 КопироватьФайл(СтрокаТЗ.ПутьКФайлу, КаталогОшибок+"Уже провереные\"+НомерКоробки+"\"+ИмяФайла+".jpg");
					 //крохин конец 27.01.2016

						 //крохин конец 27.09.2011
						 Продолжить;
					 КонецЕсли;
					 
					 	 	 //крохин начало 27.01.2016
					 //поменялся формат
					 //КопироватьФайл(СтрокаТЗ.ПутьКФайлу, КаталогЗагрузки +Каталог+"\"+ИмяФайла+".tif");
					 КопироватьФайл(СтрокаТЗ.ПутьКФайлу, КаталогЗагрузки +Каталог+"\"+ИмяФайла+".jpg");
					 //крохин конец 27.01.2016
					 //крохин начало 14.10.2011
					 //копируем номер коробки, для контроля. Не используем объект, это ошибка!
					 КопироватьФайл(Константы.КаталогВнешнихОтчетов.Получить()+"TEST.txt", КаталогЗагрузки +Каталог+"\"+НомерКоробки+".txt");					 
					// Документ = Документ.ПолучитьОбъект();
					 //крохин конец 14.10.2011

					 //Если Документ.СостояниеДокументов <> Перечисления.СостояниеДокументов.ПолученоИзображение Тогда
					 //	Документ.УстановитьСостояниеДокументов(Перечисления.СостояниеДокументов.ПолученоИзображение);
					 //КонецЕсли;
					 НаборЗаписей = РегистрыСведений.СостояниеСкановДокументов.СоздатьНаборЗаписей();
					 НаборЗаписей.Отбор.документ.Использование = Истина;
					 НаборЗаписей.Отбор.документ.Значение = Документ.Ссылка;
					 НаборЗаписей.Очистить();
					 Запись = НаборЗаписей.Добавить();
					 Запись.Документ = Документ.Ссылка;
					 Запись.НомерКоробки = НомерКоробки;
					 Запись.СостояниеЭлектронногоДокумента = Перечисления.СостояниеЭлектронныхДокументов.СканСОшибками;
					 НаборЗаписей.Записать();
				 Иначе
					 			 					 //крохин начало 27.09.2011
					 //ошибки будем писать в каталог с номером коробки	
					 //ИмяОшибки = (КаталогОшибок+"Ошибки\"+СтрЗаменить(ТекущаяДата(),":","")+".tif");
					 
					 //крохин начало 27.01.2016
					 //поменялся формат
					 //ИмяОшибки = (КаталогОшибок+"Ошибки\"+НомерКоробки+"\"+СтрЗаменить(ТекущаяДата(),":","")+".tif");
					 ИмяОшибки = (КаталогОшибок+"Ошибки\"+НомерКоробки+"\"+СтрЗаменить(ТекущаяДата(),":","")+".jpg");
					 //крохин конец 27.01.2016

					 //крохин конец 27.09.2011
					 
					 КопироватьФайл(СтрокаТЗ.ПутьКФайлу, ИмяОшибки);
				 КонецЕсли;
			 КонецЦикла;
			 
			 
		 КонецЦикла;
		 УдалитьФайлы(КаталогДок.ПолноеИмя); 
	 КонецЦикла;
	 #Если клиент Тогда
		 Сообщить(ТекущаяДата());
		 Сообщить("Ошибки. Обработка завершена");
	 #КонецЕсли
	 
	 
 КонецПроцедуры
 
 
 Процедура СформироватьВычерки(НомерКоробкиДляОбработки = Неопределено)  Экспорт
	 #Если клиент Тогда
		 Сообщить(ТекущаяДата());
		 Состояние("документы с вычерками");
	 #КонецЕсли
	 КаталогОшибок   = Константы.КаталогДокументов.Получить()+ "Ошибки\";
	 КаталогЗагрузки = Константы.КаталогДокументов.Получить();
//	 КаталогВыгрузки = Константы.КаталогНеобработанныхСканов.Получить();
//	 КаталогОшибок   = "\\srvfile\Сканы документов к Обработке\Ошибки\";
//	 КаталогЗагрузки = "\\srvfile\Сканы документов к Обработке\";
	 КаталогВыгрузки = "\\srvfile\Сканы документов к Обработке\";
	 
	 СоздатьКаталог(КаталогОшибок+"Дубль\");
	 СоздатьКаталог(КаталогОшибок+"Ошибки\");
	 СоздатьКаталог(КаталогОшибок+"Нет документа в базе\");
	 СоздатьКаталог(КаталогОшибок+"Уже провереные\");
	 
	 
	 
	 СписокОтработанныхКаталогов = Новый СписокЗначений;
	 НайденныеКаталогиДокументов = НайтиФайлы(КаталогВыгрузки,"*");
	 
		 Для Каждого ИскКаталогДокументов Из НайденныеКаталогиДокументов Цикл
			 //крохин начало 02.03.2012
			//Если ИскКаталогДокументов.Имя = ИскКаталогДокументов.ИмяБезРасширения  И Найти(ИскКаталогДокументов.Имя,"Вычерки") Тогда	
			Если ИскКаталогДокументов.ЭтоКаталог()  И Найти(ИскКаталогДокументов.Имя,"Вычерки") Тогда
				 //крохин конец 02.03.2012
			 НайденныеКаталогиДок = НайтиФайлы(ИскКаталогДокументов.ПолноеИмя,"*");
			 Для Каждого КаталогДок Из НайденныеКаталогиДок Цикл
				 //крохин начало 02.03.2012
				 //Если КаталогДок.Имя = КаталогДок.ИмяБезРасширения  И Найти(КаталогДок.Имя,"Кор") Тогда
				 					 //крохин начало 06.12.2012
	 //по одной коробке
	// Если КаталогДок.ЭтоКаталог() И Найти(КаталогДок.Имя,"Кор") Тогда
	Если КаталогДок.ЭтоКаталог() И Найти(КаталогДок.Имя,"Кор"+НомерКоробкиДляОбработки.Код) Тогда
	//крохин конец 06.12.2012

					 //крохин конец 02.03.2012
					 НайденныеКаталогиПакет = НайтиФайлы(КаталогДок.ПолноеИмя,"*");
					 НомерКоробки = ПолучитьНомерКоробки(КаталогДок);
					 		  //крохин начало 27.09.2011
	 //ошибки будем писать в каталог с номером коробки
	  СоздатьКаталог(КаталогОшибок+"Дубль\"+НомерКоробки+"\");
	 СоздатьКаталог(КаталогОшибок+"Ошибки\"+НомерКоробки+"\");
	 СоздатьКаталог(КаталогОшибок+"Нет документа в базе\"+НомерКоробки+"\");
	 СоздатьКаталог(КаталогОшибок+"Уже провереные\"+НомерКоробки+"\");
	 //крохин конец 27.09.2011
	 Для Каждого КаталогДокПакет Из НайденныеКаталогиПакет Цикл
		 //крохин начало 02.03.2012
		 //Если КаталогДокПакет.Имя = КаталогДокПакет.ИмяБезРасширения  И Найти(КаталогДокПакет.Имя,"Доверенности") Тогда	
		 Если КаталогДокПакет.ЭтоКаталог() И Найти(КаталогДокПакет.Имя,"Доверенности") Тогда
			 //крохин конец 02.03.2012
				     ЗаписатьДоверенности(КаталогДокПакет,НомерКоробки);
				     Продолжить;
			         КонецЕсли;
                     КонецЦикла;
					 Для Каждого КаталогДокПакет Из НайденныеКаталогиПакет Цикл
						 //крохин начало 02.03.2012
						 //Если КаталогДокПакет.Имя = КаталогДокПакет.ИмяБезРасширения  И Найти(КаталогДокПакет.Имя,"пакет") Тогда
						 Если КаталогДокПакет.ЭтоКаталог() И Найти(КаталогДокПакет.Имя,"пакет") Тогда
							 //крохин конец 02.03.2012
							 НайденныеКаталоги = НайтиФайлы(КаталогДокПакет.ПолноеИмя,"*");
							 Прервать;  
						 КонецЕсли;
					 КонецЦикла;
					 Прервать;
				 КонецЕсли;	
			 КонецЦикла;
		 иначе
			 Продолжить;
		 КонецЕсли;
		 Если КаталогДок = Неопределено Тогда Продолжить КонецЕсли;	
		 Если НайденныеКаталоги = Неопределено Тогда Продолжить КонецЕсли;
		 

		 
		 
		 //Индикатор1 = 0;
		 //ЭлементыФормы.Индикатор1.МаксимальноеЗначение = НайденныеКаталоги.Количество();
		 Для Каждого ИскКаталог Из НайденныеКаталоги Цикл
			 //	Индикатор1 = Индикатор1 + 1;
			 #Если клиент Тогда
				 
				 ОбработкаПрерыванияПользователя();
			 #КонецЕсли
			//крохин начало 02.03.2012			 
			//Если ИскКаталог.Имя = ИскКаталог.ИмяБезРасширения Тогда //проверим, что это каталог
				Если ИскКаталог.ЭтоКаталог() Тогда //проверим, что это каталог
				//крохин конец 02.03.2012
				 Если СтрДлина(ИскКаталог.Имя) < 5 Тогда
					 			 		  //крохин начало 27.09.2011
	 //ошибки будем писать в каталог с номером коробки
					// СоздатьКаталог(КаталогОшибок+"Ошибки\"+ИскКаталог.Имя+"\");
					 СоздатьКаталог(КаталогОшибок+"Ошибки\"+НомерКоробки+"\"+ИскКаталог.Имя+"\");
					 //крохин конец 27.09.2011
					 
					 //крохин начало 27.01.2016
					 //поменялся формат
					 //НайденныеФайлы = НайтиФайлы(ИскКаталог.ПолноеИмя,"*.tif");
					 НайденныеФайлы = НайтиФайлы(ИскКаталог.ПолноеИмя,"*.jpg");
					 //крохин конец 27.01.2016
					 Для Каждого Файл Из НайденныеФайлы Цикл
						  		  //крохин начало 27.09.2011
	 //ошибки будем писать в каталог с номером коробки
					//	 КопироватьФайл(Файл.ПолноеИмя, КаталогОшибок+"\Ошибки\"+ИскКаталог.Имя+"\"+Файл.Имя);
						 КопироватьФайл(Файл.ПолноеИмя, КаталогОшибок+"\Ошибки\"+НомерКоробки+"\"+ИскКаталог.Имя+"\"+Файл.Имя);	
						 //крохин конец 27.09.2011
					 КонецЦикла;
					 Продолжить;	
				 КонецЕсли;
				 
				 Если Найти(СокрЛП(ИскКаталог.Имя)," ") <> 0 Тогда	//дубли	
					 РасшифровкаИмениКаталога=Лев(СокрЛП(ИскКаталог.Имя),Найти(СокрЛП(ИскКаталог.Имя)," "));
					 
					 РасшифровкаИмениКаталога=Раскодировать64Лок(РасшифровкаИмениКаталога);
					 РасшифровкаИмениКаталога = СокрЛП(СтрЗаменить(РасшифровкаИмениКаталога,"*"," "));
					 
					 
					 //крохин начало 27.01.2016
					 //поменялся формат
					 //НайденныеФайлы = НайтиФайлы(ИскКаталог.ПолноеИмя,"*.tif");
					 НайденныеФайлы = НайтиФайлы(ИскКаталог.ПолноеИмя,"*.jpg");
					 //крохин конец 27.01.2016
					 Для Каждого Файл Из НайденныеФайлы Цикл
						 						  		  //крохин начало 27.09.2011
	                     //ошибки будем писать в каталог с номером коробки
						 //ИмяДубля = КаталогОшибок+СтрЗаменить("Дубль\"+РасшифровкаИмениКаталога+" "+ТекущаяДата()+".tif",":","");
						 
						 //крохин начало 27.01.2016
					 //поменялся формат
					 //ИмяДубля = КаталогОшибок+СтрЗаменить("Дубль\"+НомерКоробки+"\"+РасшифровкаИмениКаталога+" "+ТекущаяДата()+".tif",":","");
					 ИмяДубля = КаталогОшибок+СтрЗаменить("Дубль\"+НомерКоробки+"\"+РасшифровкаИмениКаталога+" "+ТекущаяДата()+".jpg",":","");
					 //крохин конец 27.01.2016
						 //крохин конец 27.09.2011
						 
						 КопироватьФайл(Файл.ПолноеИмя, ИмяДубля);
					 КонецЦикла;
					 Продолжить;			
				 КонецЕсли;	
				 
				 РасшифровкаИмениКаталога=СокрЛП(ИскКаталог.Имя);
				 
				 РасшифровкаИмениКаталога=Раскодировать64Лок(РасшифровкаИмениКаталога);
				 РасшифровкаИмениКаталога = СокрЛП(СтрЗаменить(РасшифровкаИмениКаталога,"*"," "));
				 
				 				  //крохин начало 27.01.2016
					 //поменялся формат
					 //НайденныеФайлы = НайтиФайлы(ИскКаталог.ПолноеИмя,"*.tif");
					 НайденныеФайлы = НайтиФайлы(ИскКаталог.ПолноеИмя,"*.jpg");
					 //крохин конец 27.01.2016
						 //крохин конец 27.09.2011
				 ТаблицаФайлов = Новый ТаблицаЗначений;
				 ТаблицаФайлов.Колонки.Добавить("ПутьКФайлу");
				 ТаблицаФайлов.Колонки.Добавить("НомерСтраницы");
				 Для Каждого Файл Из НайденныеФайлы Цикл
					 СтрокаТЗ = ТаблицаФайлов.Добавить();
					 СтрокаТЗ.ПутьКФайлу = Файл.ПолноеИмя;
					
					 //крохин начало 27.01.2016
					 //поменялся формат
					 // СтрокаТЗ.НомерСтраницы = Число(СтрЗаменить(СтрЗаменить(Файл.Имя,"страница",""),".tif",""));
					  СтрокаТЗ.НомерСтраницы = Число(СтрЗаменить(СтрЗаменить(Файл.Имя,"страница",""),".jpg",""));
					 //крохин конец 27.01.2016
				 КонецЦикла;
			 КонецЕсли;
			 
			 ТаблицаФайлов.Сортировать("номерСтраницы");
			 ПервыйФайл = Истина;
			 //Индикатор = 0;
			 //ЭлементыФормы.Индикатор.МаксимальноеЗначение = ТаблицаФайлов.Количество();
			 Для Каждого СтрокаТЗ Из ТаблицаФайлов Цикл
				 //	Индикатор = Индикатор + 1;
				 Если ПервыйФайл Тогда
					 ВидДокумента = Лев(РасшифровкаИмениКаталога,Найти(РасшифровкаИмениКаталога," ")-1);
					 Если ВидДокумента <> "РНК" И ВидДокумента <> "СФ"  Тогда
						   		  //крохин начало 27.09.2011
	                     //ошибки будем писать в каталог с номером коробки
					 //ИмяОшибки = (КаталогОшибок+"Ошибки\Неверный ШК"+СтрЗаменить(ТекущаяДата(),":","")+".tif");
					 
					 //крохин начало 27.01.2016
					 //поменялся формат
					 //ИмяОшибки = (КаталогОшибок+"Ошибки\"+НомерКоробки+"\Неверный ШК"+СтрЗаменить(ТекущаяДата(),":","")+".tif");
					  ИмяОшибки = (КаталогОшибок+"Ошибки\"+НомерКоробки+"\Неверный ШК"+СтрЗаменить(ТекущаяДата(),":","")+".jpg");
					 //крохин конец 27.01.2016
					 //крохин конец 27.09.2011
					 
					 КопироватьФайл(СтрокаТЗ.ПутьКФайлу, ИмяОшибки);
	                Продолжить;
					 КонецЕсли;
					 Остаток = СтрЗаменить(РасшифровкаИмениКаталога,ВидДокумента + " ","");
					 НомерДокумента = Лев(Остаток,Найти(Остаток," ")-1);
					 Остаток = СтрЗаменить(Остаток,НомерДокумента + " ","");
					 Год = Лев(Остаток,2);
					 Каталог = ВидДокумента + " "+НомерДокумента+" "+Год;
					 Остаток = Прав(Остаток,СтрДлина(Остаток)-3);
					 НомерСтраницы = Лев(Остаток,Найти(Остаток," ")-1);
					 Остаток = СтрЗаменить(Остаток,НомерСтраницы + " ","");
					 
					 //крохин начало 27.01.2016
					 //поменялся формат
					 //ВсегоСтраниц = СтрЗаменить(Остаток,".tif","");
					  ВсегоСтраниц = СтрЗаменить(Остаток,".jpg","");
					 //крохин конец 27.01.2016
					 Если ВидДокумента = "СФ" Тогда
						 НомерДокументаРНК = НайтиНомерРНКПоСФ(НомерДокумента,Год);
						 Если  НомерДокументаРНК <> "" Тогда
							 Каталог = "РНК" + " "+НомерДокументаРНК+" "+Год;	
						 КонецЕсли;
					 КонецЕсли;
					 ПервыйФайл = Ложь;
					 ИмяКаталогаДокумента = КаталогЗагрузки + "\"+ ВидДокумента+" "+НомерДокумента + " год 20"+Год;
					 СоздатьКаталог(КаталогЗагрузки +Каталог);
					 попытка
						 ИмяФайла =  ""+ВидДокумента+" "+НомерДокумента + " год 20"+Год+" стр "+Формат(Число(НомерСтраницы),"ЧЦ=3; ЧВН=")+" из "+Формат(Число(ВсегоСтраниц),"ЧЦ=3; ЧВН=");
					 исключение
						 НомерСтраницы = 1;
						 ВсегоСтраниц = 1;
						 ИмяФайла =  ""+ВидДокумента+" "+НомерДокумента + " год 20"+Год+" стр "+Формат(Число(НомерСтраницы),"ЧЦ=3; ЧВН=")+" из "+Формат(Число(ВсегоСтраниц),"ЧЦ=3; ЧВН=");
					 конецпопытки;
					 //проверка документа
					 Если ВидДокумента = "СФ" Тогда
						 Документ =  Документы.РасходнаяНакладная.НайтиПоНомеру(НомерДокументаРНК,Дата(2000+Год,1,1));
					 Иначе
						 Документ =  Документы.РасходнаяНакладная.НайтиПоНомеру(НомерДокумента,Дата(2000+Год,1,1));	
					 КонецЕсли;
					 Если Документ = Документы.РасходнаяНакладная.ПустаяСсылка() Тогда
						   //крохин начало 27.09.2011
	                     //ошибки будем писать в каталог с номером коробки
						 //КопироватьФайл(СтрокаТЗ.ПутьКФайлу, КаталогОшибок+"Нет документа в базе\"+ИмяФайла+".tif");	
						 
						 //крохин начало 27.01.2016
					 //поменялся формат
					 //КопироватьФайл(СтрокаТЗ.ПутьКФайлу, КаталогОшибок+"Нет документа в базе\"+НомерКоробки+"\"+ИмяФайла+".tif");
					  КопироватьФайл(СтрокаТЗ.ПутьКФайлу, КаталогОшибок+"Нет документа в базе\"+НомерКоробки+"\"+ИмяФайла+".jpg");
					 //крохин конец 27.01.2016
						 //крохин конец 27.09.2011
						 Продолжить;	
					 КонецЕсли;
					 
					 ЗапросСостоянияДокументов = Новый запрос;
					 ЗапросСостоянияДокументов.Текст = "ВЫБРАТЬ
					 |	СостояниеСкановДокументов.Документ,
					 |	СостояниеСкановДокументов.СостояниеЭлектронногоДокумента,
					 |	СостояниеСкановДокументов.НомерКоробки
					 |ИЗ
					 |	РегистрСведений.СостояниеСкановДокументов КАК СостояниеСкановДокументов
					 |ГДЕ
					 |	СостояниеСкановДокументов.Документ = &Документ";
					 ЗапросСостоянияДокументов.УстановитьПараметр("Документ",Документ.Ссылка);
					 Выборка = ЗапросСостоянияДокументов.Выполнить().Выбрать();
					 Если Выборка.Следующий() Тогда
						 СостояниеДокументов = Выборка.СостояниеЭлектронногоДокумента;
					 Иначе
						 СостояниеДокументов = Перечисления.СостояниеЭлектронныхДокументов.СканОтсутствует;
					 КонецЕсли;
					 
					 
					 Если СостояниеДокументов = Перечисления.СостояниеЭлектронныхДокументов.СканПроверен Тогда
						 					   //крохин начало 27.09.2011
	                     //ошибки будем писать в каталог с номером коробки
						 //КопироватьФайл(СтрокаТЗ.ПутьКФайлу, КаталогОшибок+"Уже провереные\"+ИмяФайла+".tif");
						 
						 //крохин начало 27.01.2016
					 //поменялся формат
					 //КопироватьФайл(СтрокаТЗ.ПутьКФайлу, КаталогОшибок+"Уже провереные\"+НомерКоробки+"\"+ИмяФайла+".tif");
					  КопироватьФайл(СтрокаТЗ.ПутьКФайлу, КаталогОшибок+"Уже провереные\"+НомерКоробки+"\"+ИмяФайла+".jpg");
					 //крохин конец 27.01.2016

						 //крохин конец 27.09.2011
						 Продолжить;
					 КонецЕсли;
					 
					 //крохин начало 27.01.2016
					 //поменялся формат
					 //КопироватьФайл(СтрокаТЗ.ПутьКФайлу, КаталогЗагрузки +Каталог+"\"+ИмяФайла+".tif");
					 КопироватьФайл(СтрокаТЗ.ПутьКФайлу, КаталогЗагрузки +Каталог+"\"+ИмяФайла+".jpg");
					 //крохин конец 27.01.2016
					 //крохин начало 14.10.2011
					 //копируем номер коробки, для контроля. Не используем объект, это ошибка!
					 КопироватьФайл(Константы.КаталогВнешнихОтчетов.Получить()+"TEST.txt", КаталогЗагрузки +Каталог+"\"+НомерКоробки+".txt");					 
					// Документ = Документ.ПолучитьОбъект();
					 //крохин конец 14.10.2011

					 //Если Документ.СостояниеДокументов <> Перечисления.СостояниеДокументов.ПолученоИзображение Тогда
					 //	Документ.УстановитьСостояниеДокументов(Перечисления.СостояниеДокументов.ПолученоИзображение);
					 //КонецЕсли;
					 НаборЗаписей = РегистрыСведений.СостояниеСкановДокументов.СоздатьНаборЗаписей();
					 НаборЗаписей.Отбор.документ.Использование = Истина;
					 НаборЗаписей.Отбор.документ.Значение = Документ.Ссылка;
					 НаборЗаписей.Очистить();
					 Запись = НаборЗаписей.Добавить();
					 Запись.Документ = Документ.Ссылка;
					 Запись.НомерКоробки = НомерКоробки;
					 Запись.СостояниеЭлектронногоДокумента = Перечисления.СостояниеЭлектронныхДокументов.СканПодКорректировку;
					 НаборЗаписей.Записать();
				 Иначе
					 //крохин начало 27.09.2011
	                     //ошибки будем писать в каталог с номером коробки
						 //ИмяОшибки = (КаталогОшибок+"Ошибки\"+СтрЗаменить(ТекущаяДата(),":","")+".tif");
					 
					 //крохин начало 27.01.2016
					 //поменялся формат
					 //ИмяОшибки = (КаталогОшибок+"Ошибки\"+НомерКоробки+"\"+СтрЗаменить(ТекущаяДата(),":","")+".tif");
					 ИмяОшибки = (КаталогОшибок+"Ошибки\"+НомерКоробки+"\"+СтрЗаменить(ТекущаяДата(),":","")+".jpg");
					 //крохин конец 27.01.2016
					 //крохин конец 27.09.2011
					 
					 КопироватьФайл(СтрокаТЗ.ПутьКФайлу, ИмяОшибки);
				 КонецЕсли;
			 КонецЦикла;
			 
			 
		 КонецЦикла;
		УдалитьФайлы(КаталогДок.ПолноеИмя); 
	 КонецЦикла;
	 
	 #Если клиент Тогда
		 Сообщить(ТекущаяДата());
		 Сообщить("Вычерки. Обработка завершена");
	 #КонецЕсли
	 
	 
 КонецПроцедуры
 
 
 
 
 Процедура Сформировать(НомерКоробкиДляОбработки = Неопределено) Экспорт
	 Если ПараметрыСеанса.ТипУзла <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		 Возврат;
	 КонецЕсли;
	 //крохин начало 06.12.2012
	 Если  НомерКоробкиДляОбработки.Пустая() Тогда
	 Сообщить("не указан номер коробки!");
	 Возврат;
	 КонецЕсли;
	 //крохин конец 06.12.2012
	 СформироватьНормальные(НомерКоробкиДляОбработки);
СформироватьВычерки(НомерКоробкиДляОбработки);
	 СформироватьОшибки(НомерКоробкиДляОбработки);
 КонецПроцедуры
 
 Функция ПолучитьНомерКоробки(КаталогДокументов) Экспорт
	 ТекущийКаталогДокументов = КаталогДокументов.Имя;
	 НомерКоробки =  ТекущийКаталогДокументов;
	 
	 Пока Найти(ТекущийКаталогДокументов,"\") > 0 Цикл
		 НомерКоробки = Лев(ТекущийКаталогДокументов,Найти(ТекущийКаталогДокументов,"\")-1);	
		 ТекущийКаталогДокументов = Прав(ТекущийКаталогДокументов,СтрДлина(ТекущийКаталогДокументов)-Найти(ТекущийКаталогДокументов,"\"));	
	 КонецЦикла;                              
	 НомерКоробки = СтрЗаменить(НомерКоробки,"Кор","");
	 возврат НомерКоробки;
 КонецФункции
 
 
 Процедура ЗаписатьДоверенности(КаталогДоверенностей,НомерКоробки)
	 
	 КаталогЗагрузки = Константы.КаталогДокументов.Получить();
	 
	 //крохин начало 27.01.2016
	 //поменялся формат
	 //НайденныеФайлы = НайтиФайлы(КаталогДоверенностей.ПолноеИмя,"*.tif");
	 НайденныеФайлы = НайтиФайлы(КаталогДоверенностей.ПолноеИмя,"*.jpg");
	 //крохин конец 27.01.2016

	 Для Каждого Файл Из НайденныеФайлы Цикл
		 
		 ВидДокумента = Лев(Файл.Имя,Найти(Файл.Имя," ")-1);
		 Остаток = СтрЗаменить(Файл.Имя,ВидДокумента + " ","");
		 НомерДокумента = Лев(Остаток,Найти(Остаток," ")-1);
		 Остаток = СтрЗаменить(Остаток,НомерДокумента + " ","");
		 Остаток = СтрЗаменить(Остаток,"год 20","");
		 Год = Лев(Остаток,2);
		 Каталог = "РНК" + " "+НомерДокумента+" "+Год;
			 //Остаток = Прав(Остаток,СтрДлина(Остаток)-3);
		 //НомерСтраницы = Лев(Остаток,Найти(Остаток," ")-1);
		 //Остаток = СтрЗаменить(Остаток,НомерСтраницы + " ","");
		 //ВсегоСтраниц = СтрЗаменить(Остаток,".tif","");
		Документ =  Документы.РасходнаяНакладная.НайтиПоНомеру(НомерДокумента,Дата(2000+Год,1,1));
		
		//крохин начало 11.12.2012
		Если ВидДокумента = "СФ" Тогда
		ЗапросСФ = Новый Запрос;
		ЗапросСФ.Текст = "ВЫБРАТЬ
		               |	СчетФактураНакладные.Накладная КАК Документ
		               |ИЗ
		               |	Документ.СчетФактура.Накладные КАК СчетФактураНакладные
		               |ГДЕ
		               |	СчетФактураНакладные.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
		               |	И СчетФактураНакладные.Ссылка.Проведен
		               |	И СчетФактураНакладные.Ссылка.Номер = &Номер";
					   
			ЗапросСФ.УстановитьПараметр("Дата1",НачалоГода(Дата(2000+Год,1,1)));
			ЗапросСФ.УстановитьПараметр("Дата2",КонецГода(Дата(2000+Год,1,1)));
			ЗапросСФ.УстановитьПараметр("Номер",НомерДокумента);
			ВыборкаСФ = ЗапросСФ.Выполнить().Выбрать();
			Если ВыборкаСФ.Следующий() Тогда
			Документ = ВыборкаСФ.Документ;	
			КонецЕсли;
		
		КонецЕсли;
		//крохин конец 11.12.2012
		
		 	 ЗапросСостоянияДокументов = Новый запрос;
					 ЗапросСостоянияДокументов.Текст = "ВЫБРАТЬ
					 |	СостояниеСкановДокументов.Документ,
					 |	СостояниеСкановДокументов.СостояниеЭлектронногоДокумента,
					 |	СостояниеСкановДокументов.НомерКоробки
					 |ИЗ
					 |	РегистрСведений.СостояниеСкановДокументов КАК СостояниеСкановДокументов
					 |ГДЕ
					 |	СостояниеСкановДокументов.Документ = &Документ";
					 ЗапросСостоянияДокументов.УстановитьПараметр("Документ",Документ.Ссылка);
					 Выборка = ЗапросСостоянияДокументов.Выполнить().Выбрать();
					 Если Выборка.Следующий() Тогда
						 СостояниеДокументов = Выборка.СостояниеЭлектронногоДокумента;
					 Иначе
						 СостояниеДокументов = Перечисления.СостояниеЭлектронныхДокументов.СканОтсутствует;
					 КонецЕсли;

		 
		 ИмяФайла =  Файл.Имя;//""+ВидДокумента+" "+НомерДокумента + " год 20"+Год+" стр "+Формат(Число(НомерСтраницы),"ЧЦ=3; ЧВН=")+" из "+Формат(Число(ВсегоСтраниц),"ЧЦ=3; ЧВН=");
		 СоздатьКаталог(КаталогЗагрузки +Каталог);
		 //Если ВидДокумента = "СФ" И Тогда
		 //НомерДокументаСФ = НайтиНомерСФпоРНК(НомерДокумента,Год);
		 //ИмяФайла = СтрЗаменить(ИмяФайла,НомерДокумента,НомерДокументаСФ);
		 //Сообщить(""+НомерДокументаСФ+"//"+НомерДокумента);
		 //КонецЕсли;
		 КопироватьФайл(Файл.ПолноеИмя, КаталогЗагрузки +Каталог+"\"+ИмяФайла);
		 
		  НаборЗаписей = РегистрыСведений.СостояниеСкановДокументов.СоздатьНаборЗаписей();
					 НаборЗаписей.Отбор.документ.Использование = Истина;
					 НаборЗаписей.Отбор.документ.Значение = Документ.Ссылка;
					 НаборЗаписей.Очистить();
					 Запись = НаборЗаписей.Добавить();
					 Запись.Документ = Документ.Ссылка;
					 Запись.НомерКоробки = НомерКоробки;
					 Запись.СостояниеЭлектронногоДокумента = Перечисления.СостояниеЭлектронныхДокументов.СканПолучен;
					 НаборЗаписей.Записать();

	 КонецЦикла;
	 
 КонецПроцедуры
 
  Функция НайтиНомерСФПоРНК(НомерДокумента,Год) Экспорт 
	 попытка
	 Запрос = Новый Запрос;
	 запрос.Текст = "ВЫБРАТЬ
	                |	СчетФактураНакладные.Ссылка.Номер КАК Номер
	                |ИЗ
	                |	Документ.СчетФактура.Накладные КАК СчетФактураНакладные
	                |ГДЕ
	                |	СчетФактураНакладные.Ссылка.Дата МЕЖДУ &НачПериода И &КонПериода
	                |	И СчетФактураНакладные.Накладная.Номер = &Номер";
	 Запрос.УстановитьПараметр("Номер",НомерДокумента);
	 Запрос.УстановитьПараметр("Начпериода",Дата(2000+Год,1,1));
	 Запрос.УстановитьПараметр("КонПериода",КонецГода(Дата(2000+Год,1,1)));
	 Выборка = Запрос.Выполнить().Выбрать();
	 Если Выборка.Следующий() Тогда
		 Возврат Выборка.Номер; 
	 Иначе
		 Возврат "";
	 КонецЕсли;
 Исключение
	 Возврат "";
	 КонецПопытки;
 КонецФункции
 

 