Перем ПутиПапок Экспорт;
Перем ПутиФайлов Экспорт;
Перем ИмяПути Экспорт;
Перем Контрагент Экспорт;
Перем ТипШк Экспорт;
Перем КодМетро Экспорт; 
Перем Файлы Экспорт;
Перем Ошибки Экспорт;
Перем КритичОшибки,КритичОшибкиЛента,КритическиеОшибкиОзон,КритическиеОшибкиОзон2 Экспорт;
Перем ТЗПЕчать,ТЗШапка,АктШапка,АктТаблица Экспорт;
Перем Ашан Экспорт;
Перем НомПП;
Перем Отказ;
Перем ОшибкиАртикул;
Перем SQLiteObject;


// сделать загрузку для заказов больше 50 штук.	 


//ДляЛенты

//Нечаева 09,04,18+++
Функция ТаблицаНомеклатурыВПаллетах(ДокОб)
	
	
	//Соберем Таблицу Для Ленты.
	//первая часть по коробкам
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ПаллетаЛистыНабора.Ссылка КАК Паллета,
	|	ПаллетаЛистыНабора.Описание КАК НомерКоробки,
	|	ПаллетаЛистыНабора.Ссылка.ОкончаниеПаллетирования КАК ОкончаниеПаллетирования,
	|	ПаллетаЛистыНабора.ШКЛистаНабора,
	|	ПаллетаЛистыНабора.ЛистНабора,
	|	ПаллетаЛистыНабора.Ссылка.SSCCКод
	|ИЗ
	|	Документ.Паллета.ЛистыНабора КАК ПаллетаЛистыНабора
	|ГДЕ
	|	ПаллетаЛистыНабора.Ссылка.Проведен
	|	И ПаллетаЛистыНабора.Документ.Ссылка = &Документ
	|	И ПаллетаЛистыНабора.Ссылка.ОкончаниеПаллетирования <> &ОкончаниеПаллетирования
	|	И ПаллетаЛистыНабора.ЛистНабора.ТипШК = &Коробка";
	
	запрос.УстановитьПараметр("Документ", ДокОбъект.ссылка);
	запрос.УстановитьПараметр("Коробка", перечисления.ТипыШтрихКодов.Коробка);
	запрос.УстановитьПараметр("ОкончаниеПаллетирования",ПустаяДата());
	
	СписокСтрокизПаллет=запрос.Выполнить().Выгрузить();
	СписокСтрокизПаллет.Колонки.Добавить("Количество");
	СписокСтрокизПаллет.Колонки.Добавить("Номенклатура");
	
	
	Для Каждого Строка из СписокСтрокизПаллет Цикл
		
		ШККоробок = Новый ТаблицаЗначений;
		
		ШККоробок =  ПолучитьСписокШКкоробокЛистаНабора(Строка.ЛистНабора);
		// ищем По ШК и прописываем количество.
		ТекНомер = Строка.НомерКоробки;
		
		НайденнаяСтрока = ШККоробок.Найти(Число(ТекНомер), "НомерКоробки");
		Если НайденнаяСтрока = Неопределено Тогда
			//Предупреждение("Товар не найден!");
		Иначе
			
			Строка.Номенклатура = НайденнаяСтрока.Номенклатура;
			Строка.Количество = НайденнаяСтрока.Номенклатура.Родитель.ШтукВКоробке;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// вторая часть по блочкам и штукам
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПаллетаЛистыНабора.Ссылка КАК Паллета,
	|	ПаллетаЛистыНабора.ЛистНабора,
	|	ВЫРАЗИТЬ(ПаллетаЛистыНабора.Ссылка.SSCCКод КАК СТРОКА(50)) КАК SSCCКод
	|ИЗ
	|	Документ.Паллета.ЛистыНабора КАК ПаллетаЛистыНабора
	|ГДЕ
	|	ПаллетаЛистыНабора.Ссылка.Проведен
	|	И ПаллетаЛистыНабора.Документ.Ссылка = &Документ
	|	И ПаллетаЛистыНабора.Ссылка.ОкончаниеПаллетирования <> &ОкончаниеПаллетирования
	|	И ПаллетаЛистыНабора.ЛистНабора.ТипШК <> &Коробка";
	
	запрос.УстановитьПараметр("Документ", ДокОбъект.ссылка);
	запрос.УстановитьПараметр("Коробка", перечисления.ТипыШтрихКодов.Коробка);
	запрос.УстановитьПараметр("ОкончаниеПаллетирования",ПустаяДата());
	
	СписокСтрокизПаллет2=запрос.Выполнить().Выгрузить();
	СписокСтрокизПаллет2.Колонки.Добавить("Количество");
	СписокСтрокизПаллет2.Колонки.Добавить("Номенклатура");
	
	
	Для Каждого Строка из СписокСтрокизПаллет2 Цикл
		
		// весь лист набора это 1 коробка, просто переносим данные из Листа набора целиком в таблицу по этой Паллете.
		ЛНТовары = Строка.ЛистНабора.Товары;
		Для каждого ТекСтрока Из ЛНТовары Цикл
			
			НовСтр = СписокСтрокизПаллет.Добавить();
			НовСтр.Номенклатура = ТекСтрока.Номенклатура;
			НовСтр.SSCCКод = СокрЛП(Строка.SSCCКод)     ;
			НовСтр.ЛистНабора = Строка.ЛистНабора;
			НовСтр.Паллета = Строка.Паллета;
			НовСтр.количество = ТекСТрока.Количество; // тут всегда кол-во штук.
			
		КонецЦикла;
		
	КонецЦикла;
	
	СписокСтрокИзПаллет.Свернуть("Номенклатура, SSCCКод","Количество");
	СписокСтрокИзПаллет.Сортировать("Номенклатура");
	
	возврат  СписокСтрокИзПаллет;
	
	
	
КонецФункции
//Нечаева 09,04,18---


Функция МакетВТаблицуЗначений(Макет, _ТЗ=Неопределено, флДобавлятьКолонки=истина) Экспорт
	Перем ТЗ;
	
	Если _ТЗ=Неопределено Тогда
		ТЗ=Новый ТаблицаЗначений();
		флЗаполняем=ложь;
	Иначе
		ТЗ=_ТЗ;
		флЗаполняем=истина;
	КонецЕсли;
	
	//Считываем колонки
	КоличествоКолонок=0;
	ИменаКолонок=Новый Массив();
	Кол=1;
	Пока истина Цикл
		Адрес="R1C"+Формат(Кол,"ЧГ=");
		ИмяКол=Макет.Область(Адрес).Текст;
		Если ПустаяСтрока(ИмяКол) Тогда
			Прервать;
		КонецЕсли;
		КоличествоКолонок=КоличествоКолонок+1;
		Если НЕ флЗаполняем или (флЗаполняем И флДобавлятьКолонки) И ТЗ.Колонки.Найти(ИмяКол)=Неопределено Тогда
			ТЗ.Колонки.Добавить(ИмяКол);
		КонецЕсли;
		ИменаКолонок.Добавить(ИмяКол);
		Кол=Кол+1;
	КонецЦикла;
	
	//Считываем строки
	Стр=2; Кол=1;
	Пока истина Цикл
		Вставлено=ложь; Первая=истина;
		Для Инд=1 По КоличествоКолонок Цикл
			Адрес="R"+Формат(Стр,"ЧГ=")+"C"+Формат(Инд,"ЧГ=");
			Зн=СокрЛП(Макет.Область(Адрес).Текст);
			Если ПустаяСтрока(Зн) Тогда
				Продолжить;
			КонецЕсли;
			Если Первая Тогда
				ТСтр=ТЗ.Добавить();
				Первая=ложь;
				Вставлено=истина;
			КонецЕсли;
			ИмяКолонки=ИменаКолонок[Инд-1];
			Если ТЗ.Колонки.Найти(ИмяКолонки)<>Неопределено Тогда
				Если флЗаполняем Тогда
					//Проверяем тип - число, строка, булево
					ОписаниеТипаКолонки=ТЗ.Колонки[ИмяКолонки].ТипЗначения;
					Если ОписаниеТипаКолонки.СодержитТип(Тип("Число")) Тогда
						РезЗн=Число(Зн);
					ИначеЕсли ОписаниеТипаКолонки.СодержитТип(Тип("Строка")) Тогда
						РезЗн=Строка(Зн);
					ИначеЕсли ОписаниеТипаКолонки.СодержитТип(Тип("Булево")) Тогда
						РезЗн=Булево(Зн);
					ИначеЕсли ОписаниеТипаКолонки.СодержитТип(Тип("Дата")) Тогда
						РезЗн=Дата(Зн);
					Иначе
						РезЗн=Зн;
					КонецЕсли;
				Иначе
					РезЗн=Зн;
				КонецЕсли;
				ТСтр[ИмяКолонки]=РезЗн;
			КонецЕсли;
		КонецЦикла;
		Если Не вставлено Тогда
			Прервать;
		КонецЕсли;
		Стр=Стр+1;
		Кол=1;
	КонецЦикла;
	
	Возврат ТЗ;
	
КонецФункции

//нечаева 13,01,15+++
Функция ПолучитьСдвигДатыАвизации(Документ)
	если 1=2 тогда
		документ=Документы.РасходнаяНакладная.НайтиПоНомеру();
	КонецЕсли;
	
	ДатаПД= Документ.ДатаПриемки-Документ.ПунктДоставки.ДнейВпути*24*3600;
	
	Сдвиг=0;
	если ДеньНедели(ДатаПд-Сдвиг)=6 тогда
		Сдвиг=Сдвиг+24*60*60; // пятница
	ИначеЕсли ДеньНедели(ДатаПд-Сдвиг)=7 тогда
		Сдвиг=Сдвиг+2*24*60*60;         // пятница
	КонецЕсли;
	
	
	
	
	//запрос=новый запрос;
	//запрос.текст="ВЫБРАТЬ различные 
	//|	ДопРеквизитыСправочников.ЗначениеРеквизита КАК ДеньНедели
	//|ИЗ
	//|	РегистрСведений.ДопРеквизитыСправочников КАК ДопРеквизитыСправочников
	//|ГДЕ
	//|	ДопРеквизитыСправочников.ИмяРеквизита = ""ДеньОтгрузкиДляРНК""
	//|	И ДопРеквизитыСправочников.Справочник = &Справочник
	//|	И ДопРеквизитыСправочников.ВспомогательноеЗначениеРеквизита=истина";
	//запрос.УстановитьПараметр("Справочник",Документ.ПунктДоставки);	
	//результат=запрос.Выполнить().Выгрузить();
	//если результат.Количество()=0 тогда
	//	Сдвиг=0;
	//	если ДеньНедели(Документ.ДатаОтгрузки+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=6 тогда
	//		Сдвиг=Сдвиг+24*60*60;
	//	ИначеЕсли ДеньНедели(Документ.ДатаОтгрузки+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=7 тогда
	//		Сдвиг=Сдвиг+2*24*60*60;
	//	КонецЕсли;
	//	
	//	возврат Сдвиг;
	//иначе
	//	тз=новый СписокЗначений;
	//	для Каждого СтрРезультата из результат цикл
	//		если СтрРезультата.деньнедели="Понедельник" тогда
	//			текдень=1;
	//		иначеесли СтрРезультата.деньнедели="Вторник" тогда
	//			текдень=2;
	//		иначеесли СтрРезультата.деньнедели="Среда" тогда
	//			текдень=3;
	//		иначеесли СтрРезультата.деньнедели="Четверг" тогда
	//			текдень=4;
	//		иначеесли СтрРезультата.деньнедели="Пятница" тогда
	//			текдень=5;
	//		иначеесли СтрРезультата.деньнедели="Суббота" тогда
	//			текдень=6;			
	//		иначеесли СтрРезультата.деньнедели="Воскресенье" тогда
	//			текдень=7;
	//		КонецЕсли;		
	//		тз.Добавить(текдень);		
	//	КонецЦикла;
	//	тз.СортироватьПоЗначению();
	//	для Каждого СтрСписка из тз цикл
	//		если ДеньНедели(Документ.ДатаОтгрузки)<=СтрСписка.Значение тогда
	//			НашлиСдвиг=Истина;
	//			Сдвиг=(СтрСписка.Значение-ДеньНедели(Документ.ДатаОтгрузки))*24*60*60;
	//			если ДеньНедели(Документ.ДатаОтгрузки+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=6 тогда
	//				Сдвиг=Сдвиг+24*60*60;
	//			ИначеЕсли ДеньНедели(Документ.ДатаОтгрузки+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=7 тогда
	//				Сдвиг=Сдвиг+2*24*60*60;
	//			КонецЕсли;
	//			возврат Сдвиг;
	//		КонецЕсли;
	//	КонецЦикла;
	//	Сдвиг=(тз.Получить(0).Значение+7-ДеньНедели(Документ.ДатаАвизации))*24*60*60;
	//	если ДеньНедели(Документ.ДатаАвизации+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=6 тогда
	//		Сдвиг=Сдвиг+24*60*60;
	//	ИначеЕсли ДеньНедели(Документ.ДатаОтгрузки+Сдвиг+Документ.ПунктДоставки.ДнейВпути*24*60*60)=7 тогда
	//		Сдвиг=Сдвиг+2*24*60*60;
	//	КонецЕсли;
	//	
	//	возврат Сдвиг;
	
	//КонецЕсли;
	
	
	возврат сдвиг;	
	
	
КонецФункции
//нечаева 13,01,15---


//крохин начало
Функция ПолучитьДатуОплаты1(ДатаОтгрузки,ОтсрочкаПлатежа)  Экспорт
	Если   ДатаОтгрузки = '00010101000000' Тогда
		Возврат  '00010101000000'
	Иначе
		Если  ОтсрочкаПлатежа.ВидОтсрочки = Перечисления.ВидыОтсрочки.БанковскиеДни Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	КалендарьДни.Дата КАК Дата
			|ИЗ
			|	Справочник.Календарь.Дни КАК КалендарьДни
			|ГДЕ
			|	КалендарьДни.Дата >= &ДатаОтгрузки
			|	И КалендарьДни.Часы <> 0
			|	И (НЕ КалендарьДни.Ссылка.ПометкаУдаления)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата
			|АВТОУПОРЯДОЧИВАНИЕ";
			Запрос.УстановитьПараметр("ДатаОтгрузки",ДатаОтгрузки);
			Выборка = Запрос.Выполнить().Выбрать();
			НПП = 0;
			Пока Выборка.Следующий() Цикл
				
				Если НПП = ОтсрочкаПлатежа.Отсрочка Тогда
					Возврат Выборка.Дата;	
				Конецесли;
				НПП = НПП + 1;
			КонецЦикла;
			
			Возврат ДатаОтгрузки+ОтсрочкаПлатежа.Отсрочка*24*60*60;		
		Иначе		
			Возврат ДатаОтгрузки+ОтсрочкаПлатежа.Отсрочка*24*60*60;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции
//крохин конец


Функция УбратьНули(Номер,Признак)
	// убираем лидирующие нули, если стоит признак в контрагенте
	Если Не Признак Тогда
		возврат Номер;
	КонецЕсли;
	
	Для НН=1 по СтрДлина(Номер) Цикл
		Проверка=Лев(Номер,1);
		Если Проверка="0" Тогда
			Номер=Прав(Номер,СтрДлина(Номер)-1);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Номер;
	
КонецФункции

//  Процедура определяет ситуацию, когда при изменении своей даты документ 
//  оказывается в другом периоде нумерации документов, и в это м случае
//  присваивает документу новый уникальный номер.
//
// Параметры:
//  ДокументОбъект         - контекст документа,из которого вызвана процедура 
//  НачальнаяДатаДокумента - начальная дата документа 
// 
Функция ПроверитьНомерДокумента2(ДокументОбъект, НачальнаяДатаДокумента,Предупреждать=Истина) Экспорт   // в разработке
	
	// Определяем назначенную для данного вида документов периодичность смены номера
	ПериодСменыНомера = ДокументОбъект.Метаданные().ПериодичностьНомера;
	
	//В зависимости от установленной периодичности смены номеров,
	//определяем разность старой и новой датами документа.
	РазностьДат=0;
	
	Если ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Год Тогда
		РазностьДат = НачалоГода(НачальнаяДатаДокумента) - НачалоГода(ДокументОбъект.Дата);
		
	ИначеЕсли ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Квартал Тогда
		РазностьДат = НачалоКвартала(НачальнаяДатаДокумента) - НачалоКвартала(ДокументОбъект.Дата);
		
	ИначеЕсли ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Месяц Тогда
		РазностьДат = НачалоМесяца(НачальнаяДатаДокумента) - НачалоМесяца(ДокументОбъект.Дата);
		
	ИначеЕсли ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.День Тогда
		РазностьДат = НачальнаяДатаДокумента - ДокументОбъект.Дата; 
	КонецЕсли;
	
	Если РазностьДат <> 0 Тогда
		Если Предупреждать Тогда
			//Ответ=Вопрос("Изменена дата документа ! Номер документа будет изменен ! Продолжать ?",РежимДиалогаВопрос.ДаНет);
			//Если Ответ<>КодВозвратаДиалога.Да Тогда
			//	Возврат Ложь;			
			//КонецЕсли;
		КонецЕсли;		
		УстановитьНомерДокумента2(ДокументОбъект);
	КонецЕсли;
	
	Возврат Истина;
КонецФункции// ПроверитьНомерДокумента()

Функция ПерваяСФ2(Префикс,Дата)Экспорт 
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ
	|	Документ.СчетФактура КАК СчетФактура
	|ГДЕ
	|	Дата МЕЖДУ &Дата1 И &Дата2
	|	И Номер ПОДОБНО &Номер
	|	И НЕ ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Дата));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата));
	Запрос.УстановитьПараметр("Номер",Префикс+"%");		
	
	Возврат Запрос.Выполнить().Пустой();
КонецФункции //ПерваяСФ(Префикс,Дата)

// Процедура устанавливает номер документа.
//
// Параметры:
//  ДокументОбъект  - ДокументОбъект. Экземпляр документа, которому 
//                    необходимо присвоить новый номер
//
Функция УстановитьНормальныйНовыйНомер2(ДокументОбъект,Префикс,КоличествоПропусков=0)Экспорт 
	МетаДок=ДокументОбъект.Метаданные();	
	Периодичность=МетаДок.ПериодичностьНомера;
	ДлинаЧисловойЧасти=МетаДок.ДлинаНомера-СтрДлина(СокрЛП(Префикс));;
	
	Если МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Год Тогда
		Дата1=НачалоГода(ДокументОбъект.Дата);	
		Дата2=КонецГода(ДокументОбъект.Дата);	
	ИначеЕсли МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Квартал Тогда
		Дата1=НачалоКвартала(ДокументОбъект.Дата);	
		Дата2=КонецКвартала(ДокументОбъект.Дата);					
	ИначеЕсли МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Месяц Тогда
		Дата1=НачалоМесяца(ДокументОбъект.Дата);	
		Дата2=КонецМесяца(ДокументОбъект.Дата);					
	ИначеЕсли МетаДок.ПериодичностьНомера=Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.День Тогда
		Дата1=НачалоДня(ДокументОбъект.Дата);	
		Дата2=КонецДня(ДокументОбъект.Дата);
	Иначе
		Дата1=Неопределено;		
		Дата2=Неопределено;
	КонецЕсли;
	
	Шаблон=СокрЛП(Префикс);
	Для Сч=1 По ДлинаЧисловойЧасти Цикл
		Шаблон=Шаблон+"[0-9]";	
	КонецЦикла;
	Запрос=Новый Запрос;
	
	Запрос.Текст="
	|ВЫБРАТЬ
	|	МАКСИМУМ(Номер) КАК Номер
	|ИЗ
	|	Документ."+МетаДок.Имя+"
	|ГДЕ
	|	"+?(Дата1=Неопределено,"","Дата МЕЖДУ &Дата1 И &Дата2 И ")+"
	|	Номер ПОДОБНО &Шаблон";
	
	Запрос.УстановитьПараметр("Шаблон",Шаблон);
	
	Если Дата1<>Неопределено Тогда
		Запрос.УстановитьПараметр("Дата1",Дата1);
		Запрос.УстановитьПараметр("Дата2",Дата2);
	КонецЕсли;
	
	НомерДока		=Неопределено;
	ПоследнийНомер =0;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.Номер) Тогда
			НомерДока		=Выборка.Номер;
			ПоследнийНомер	=Число(СтрЗаменить(Выборка.Номер,СокрЛП(Префикс),""));
		КонецЕсли;		
	КонецЕсли;	
	
	Коэффициент=1;
	Если НомерДока<>Неопределено Тогда	
		ПоследнийДок=Документы[МетаДок.Имя].НайтиПоНомеру(НомерДока,ДокументОбъект.Дата);
		Если ПоследнийДок<>Неопределено Тогда
			Коэффициент=Цел(Макс(1,(КонецДня(ДокументОбъект.Дата)-КонецДня(ПоследнийДок.Дата))/(24*60*60)));
		КонецЕсли;
	КонецЕсли;
	
	ДокументОбъект.Номер=СокрЛП(Префикс)+Формат(ПоследнийНомер+1+КоличествоПропусков*Коэффициент,"ЧЦ="+ДлинаЧисловойЧасти+"; ЧВН=");
КонецФункции //УстановитьНормальныйНовыйНомер(ДокументОбъект,Префикс,КоличествоПропусков=0)

// Процедура устанавливает номер документа.
//
// Параметры:
//  ДокументОбъект  - ДокументОбъект. Экземпляр документа, которому 
//                    необходимо присвоить новый номер
//
Процедура УстановитьНомерДокумента2(ДокументОбъект) Экспорт
	// Если  нет реквизита "Организация" или для нее не задан префикс, то 
	// используем пустой префикс,
	// иначе используем префикс организации.
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	ДопБуква="";
	Если МетаданныеДокумента.Имя="РасходнаяНакладная" Тогда
		ДопБуква=?(ДокументОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН,"б","а");
	ИначеЕсли МетаданныеДокумента.Имя="ОтчетКассовойСмены" Тогда
		ДопБуква=?(ДокументОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН,"кб","кн");	
	КонецЕсли; 
	
	Вид=МетаданныеДокумента.Имя;
	Если Вид="ЛистНабора" Тогда
		ДокументОбъект.УстановитьНовыйНомер(СокрЛП(ДокументОбъект.ДокОснование.Номер)+"/");
	ИначеЕсли Вид="СчетФактура" Тогда 		
		Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
			Префикс=ПараметрыСеанса.ЭтотУзел.Код;
		Иначе
			ПрефиксКонтрагента="";
			
			Если ДокументОбъект.Накладные.Количество()>0 Тогда
				Накладная=ДокументОбъект.Накладные[0].Накладная;
				Если ЕстьРеквизитДокумента("ПунктДоставки",Накладная.Метаданные()) И ЗначениеЗаполнено(Накладная.ПунктДоставки.ПрефиксСФ) Тогда
					ПрефиксКонтрагента=СокрЛП(Накладная.ПунктДоставки.ПрефиксСФ);
				КонецЕсли;			
			КонецЕсли;			
			
			Если ПустаяСтрока(ПрефиксКонтрагента) Тогда
				ПрефиксКонтрагента=СокрЛП(ПолучитьРеквизитРодителя(ДокументОбъект.Контрагент,"ПрефиксСФ"));			
			КонецЕсли; 
			
			Если ПустаяСтрока(ПрефиксКонтрагента) Тогда
				ПрефиксСклада	=СокрЛП(ДокументОбъект.Склад.Префикс);
				ПрефиксИБ		=СокрЛП(ДокументОбъект.Склад.ПрефиксИБ);
				
				Если ПрефиксИБ="SNL" Тогда
					Префикс=ПрефиксИБ;
				Иначе
					Префикс=?(НЕ ПустаяСтрока(ДокументОбъект.Организация.Префикс),СокрЛП(ДокументОбъект.Организация.Префикс)+ПрефиксСклада,ДокументОбъект.ИБ.Код);				
				КонецЕсли;				
			Иначе				
				Префикс=?(НЕ ПустаяСтрока(ДокументОбъект.Организация.Префикс),СокрЛП(ДокументОбъект.Организация.Префикс)+ПрефиксКонтрагента,ДокументОбъект.ИБ.Код);			
			КонецЕсли;			
		КонецЕсли; 
		
		Если ПерваяСФ2(Префикс,ДокументОбъект.Дата) Тогда
			Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
				КоличествоПропусков=2;			
			ИначеЕсли Лев(Префикс,2)="КБ" Тогда
				КоличествоПропусков=4;
			Иначе	
				КоличествоПропусков=1;						
			КонецЕсли;			
		Иначе
			КоличествоПропусков=0;
		КонецЕсли;
		
		//Если Префикс = "SSP" тогда Префикс = "SST" КонецЕсли;
		
		УстановитьНормальныйНовыйНомер2(ДокументОбъект,Префикс+"-",КоличествоПропусков);
	ИначеЕсли ЕстьРеквизитДокумента("ИБ",МетаданныеДокумента) Тогда
		ЭтотУзел=ПараметрыСеанса.ЭтотУзел;
		
		Если МетаданныеДокумента.Имя="РасходнаяНакладная" И СокрЛП(ДокументОбъект.Контрагент.Код)="SSP-8643" Тогда		
			
			//КодИБ="SSP";
			
			КодИБ = "SSP";
			// нечаева 29,06,15+++
			ПрефиксИБ = "SSP";
			// нечаева 29,06,15-
			
			
			
			//Нечаева 03.12.19+
			Если ДокументОбъект.Дата>Дата(2019,12,01) и ДокументОбъект.Дата<Дата(2020,01,01) Тогда
				КодИБ = "SST";
				ПрефиксИБ="SST";
			иначе
				КодИБ = "SSP";
				// нечаева 29,06,15+++
				ПрефиксИБ = "SSP";
				// нечаева 29,06,15---
			КонецЕсли;
			//Нечаева 13,12,18--
			
		Иначе
			Если ЕстьРеквизитДокумента("Склад",МетаданныеДокумента) Тогда
				ПрефиксИБ=ДокументОбъект.Склад.ПрефиксИБ;
				
				ПрефиксИБ = "SSP";
				
				//
				//Если ДокументОбъект.Дата>Дата(2015,06,28) и ДокументОбъект.Дата<Дата(2016,01,01) Тогда
				//	
				//	ПрефиксИБ="SST";
				//иначе
				//	
				//	// нечаева 29,06,15+++
				//	ПрефиксИБ = "SSP";
				//	// нечаева 29,06,15---
				//КонецЕсли;
				//		
				
				
				//крохин начало 02.08.2021
				////Нечаева 13,12,18++
				//Если ДокументОбъект.Дата>Дата(2020,12,01) и ДокументОбъект.Дата<Дата(2021,01,01) Тогда
				//	КодИБ = "SST";
				//	ПрефиксИБ="SST";
				//иначе
				//	КодИБ = "SSP";
				//	// нечаева 29,06,15+++
				//	ПрефиксИБ = "SSP";
				//	// нечаева 29,06,15---
				//КонецЕсли;
				////Нечаева 13,12,18--
				Если ДеньГода(ДокументОбъект.Дата) > 334 Тогда
					КодИБ = "SST";
					ПрефиксИБ="SST";
				ИначеЕсли ДеньГода(ДокументОбъект.Дата) > 181 Тогда
					КодИБ = "SSV";
					ПрефиксИБ="SSV";	
				иначе
					КодИБ = "SSP";
					ПрефиксИБ = "SSP";
				КонецЕсли;

				//крохин конец 02.08.2021

				
				
				
				
			КонецЕсли;		
			Если ПустаяСтрока(ПрефиксИБ) Тогда
				ПрефиксИБ=ДокументОбъект.ИБ.Код;			
			КонецЕсли; 
			
			КодИБ=?(ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение,ПрефиксИБ,ЭтотУзел.Код);	
			//крохин начало 10.01.2015
			//пока не надо
			//Если КодИБ="SSP" Тогда КодИБ = "SST" КонецЕсли;
			//крохин конец 10.01.2015
			
			
		КонецЕсли;		
		
		Если МетаданныеДокумента.Имя="ПриходнаяНакладная" И КодИБ="SSP" Тогда
			ДокументОбъект.УстановитьНовыйНомер(КодИБ+"-0");
		Иначе
			ДокументОбъект.УстановитьНовыйНомер(КодИБ+ДопБуква+"-");
		КонецЕсли;		
	ИначеЕсли Вид="УслугиСтороннихОрганизаций" Тогда
		Префикс=ДокументОбъект.Организация.Префикс+"-";
		ДокументОбъект.УстановитьНовыйНомер(Префикс);
	Иначе
		попытка
			КодИБ=ПараметрыСеанса.ЭтотУзел.Код;
			
			ДокументОбъект.УстановитьНовыйНомер(КодИБ+"-");	
			
		исключение
		конецПопытки;
	КонецЕсли;	
КонецПроцедуры // УстановитьНомерДокумента()

Функция КоличествоПД2(Контрагент) Экспорт
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ссылка) КАК Количество
		|ИЗ
		|	Справочник.ПунктыДоставки КАК ПунктыДоставки
		|ГДЕ
		|	Владелец = &Владелец";
		
		Запрос.УстановитьПараметр("Владелец",Контрагент);
		
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Количество;			
		КонецЕсли;		
	КонецЕсли;
	
	Возврат 0;
КонецФункции //КоличествоПД(Контрагент)

Функция ПолучитьДоговорыКорагента(Контрагент,Организация=Неопределено)
	МассивДоговоров=Новый Массив;
	
	КодЦБ=?(ПустаяСтрока(Контрагент.КодЦБ),Контрагент.Код,Контрагент.КодЦБ);
	
	Выборка=Справочники.Договоры.Выбрать(,,Новый Структура("КодЦБ",КодЦБ));
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка.неиспользовать тогда
			продолжить;
		КонецЕсли;	
		МассивДоговоров.Добавить(Выборка.Ссылка);
	КонецЦикла; 
	
	Возврат МассивДоговоров;
КонецФункции // ПолучитьДОговорыКорагента()



Процедура Притормозить(Н)
	Если Н  = 1  Тогда
		ВремяНачала = ТекущаяДата();
		ВремяОкончания = ВремяНачала +Н;
		Пока ВремяОкончания >= ТекущаяДата() Цикл
			
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры



//нечаева  28,08,19 добавлен ШКконтаргента дополнительный по GS1
Функция НайтиПОШКМатрица(ШК,Артикул,НамТовара="",Контрагент)Экспорт
	
	НайденнаяНоменклатура=Справочники.Номенклатура.ПустаяСсылка();
	
	ИспШтрихКодАртикул=контрагент.ИспШтрихКодАртикул;
	Если ИспШтрихКодАртикул=0 Тогда
		ИспШтрихКодАртикул=1;
	КонецЕсли;	
	
	//---------------------------------------------------------------------------
	
	
	// выбираем нужный документ матрица.
	Если ИспШтрихКодАртикул=1 Тогда
		
		///нечаева 22,10,18++
		// для тандер проверим еще на то, есть ли комплектующие с таким Шк, если есть, то берем эту номенклатуру.
		Если Контрагент.код = "SSP-3881" Тогда
			Если Артикул <> Неопределено Тогда
				Запрос=Новый Запрос;
				Запрос.Текст="ВЫБРАТЬ
				|	МатрицаТовары.ШККонтрагента,
				|	МатрицаТовары.АртикулКонтрагента,
				|	МатрицаТовары.Цена,
				|	ВложенныйЗапрос.Ссылка как ссылка
				|ИЗ
				|	(ВЫБРАТЬ
				|		СУММА(1) КАК Количество,
				|		НоменклатураКоплектующие.Ссылка КАК Ссылка
				|	ИЗ
				|		Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
				|	
				|	СГРУППИРОВАТЬ ПО
				|		НоменклатураКоплектующие.Ссылка) КАК ВложенныйЗапрос
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Матрица.Товары КАК МатрицаТовары
				|		ПО МатрицаТовары.Номенклатура = ВложенныйЗапрос.Ссылка
				|ГДЕ
				|	 МатрицаТовары.АртикулКонтрагента ПОДОБНО &ТекАрт
				|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
				|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
				|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА";
				
				Запрос.УстановитьПараметр("Контрагент",Контрагент);
				Запрос.УстановитьПараметр("ТекАрт",Артикул);
				Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
				
				Рез=Запрос.Выполнить().Выбрать();
				Если Рез.Следующий() Тогда
					Возврат Рез.ссылка;
				КонецЕсли;
				
			КонецЕсли;
			
		конецЕсли;
		///нечаева 22,10,18---
		
		// ищем по ШК
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура КАК Номенклатура,
		|	МатрицаТовары.ШККонтрагента КАК ШККонтрагента,
		|	МатрицаТовары.ШККонтрагентаДополнительный КАК ШККонтрагентаДополнительный,
		|	МатрицаТовары.АртикулКонтрагента КАК АртикулКонтрагента,
		|	МатрицаТовары.Цена КАК Цена
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	(МатрицаТовары.ШККонтрагента = &ТекШК
		|			ИЛИ МатрицаТовары.ШККонтрагентаДополнительный = &ТекШК)
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
		|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТекШк",ШК);
		Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
		
		Рез=Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() Тогда
			//Катаев+ 24/03/14 Для контрагентов участвующих в обмене ЭСФ критично несовпадение артикула и ШК из заказа и тем что занесено у нас.
			//катаев+ 28/08/14 Проверка неактуальна. Со слов менеджера в ЕКОД у Перекрестка есть и старые артикулы, которые они иногда и используют. В матрицах артикулы актуальны
			//Если Контрагент.ДатаНачалаЭСФ <> Дата(1,1,1) Тогда
			//	Если Артикул <> Рез.АртикулКонтрагента Тогда
			//		//Катаев+ 28/05/14 Записей может быть несколько. Проверяем каждую
			//		//КритичОшибки.Добавить("Для номенклатуры "+рез.Номенклатура+" не совпадает артикул из заказа ("+Артикул+") с артикулом из матрицы ("+Рез.АртикулКонтрагента+") для контрагента "+Контрагент);
			//		ЗаписьНайдена = Ложь;
			//		тНом = Рез.Номенклатура;
			//		Пока рез.Следующий() Цикл
			//			Если Артикул = Рез.АртикулКонтрагента Тогда
			//				ЗаписьНайдена = Истина;
			//				Прервать;
			//			КонецЕсли;
			//		КонецЦикла;
			//		Если Не ЗаписьНайдена Тогда
			//			КритичОшибки.Добавить("Для номенклатуры "+рез.Номенклатура+" в матрицах не найден артикул из заказа ("+Артикул+") для контрагента "+Контрагент);
			//			Возврат тНом;
			//		КонецЕсли;
			//		//Катаев- 28/05/14
			//	КонецЕсли;
			//КонецЕсли;
			//Катаев- 28/08/14
			//Катаев- 24/03/14
			Возврат Рез.Номенклатура;
		КонецЕсли;
		
		
		//ищем по артикулу
		// Катаев+ 12/03/13 Исключаем поиск ШК если Артикул = Неопределено
		Если Артикул <> Неопределено Тогда
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	МатрицаТовары.Номенклатура,
			|	МатрицаТовары.ШККонтрагента,
			|	МатрицаТовары.АртикулКонтрагента,
			|	МатрицаТовары.Цена
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|ГДЕ
			|	МатрицаТовары.Ссылка.Контрагент = &Контрагент
			|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
			|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА
			|	И МатрицаТовары.АртикулКонтрагента ПОДОБНО &ТекАрт";
			
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("ТекАрт",Артикул);
			Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
			
			Рез=Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() Тогда
				//Катаев+ 19/08/14
				////Катаев+ 24/03/14 Для контрагентов участвующих в обмене ЭСФ критично несовпадение артикула и ШК из заказа и тем что занесено у нас.
				//Если Контрагент.ДатаНачалаЭСФ <> Дата(1,1,1) Тогда
				//	Если ШК <> Рез.ШККонтрагента Тогда
				//		//Катаев+ 28/05/14 Записей может быть несколько. Проверяем каждую
				//		//КритичОшибки.Добавить("Для номенклатуры "+рез.Номенклатура+" не совпадает ШК из заказа ("+ШК+") с ШК из матрицы ("+Рез.ШККонтрагента+") для контрагента "+Контрагент);
				//		ЗаписьНайдена = Ложь;
				//		тНом = Рез.Номенклатура;
				//		Пока рез.Следующий() Цикл
				//			Если ШК = Рез.ШККонтрагента Тогда
				//				ЗаписьНайдена = Истина;
				//				Прервать;
				//			КонецЕсли;
				//		КонецЦикла;
				//		Если Не ЗаписьНайдена Тогда
				//			КритичОшибки.Добавить("Для номенклатуры "+рез.Номенклатура+" в матрицах не найден ШК из заказа ("+ШК+") для контрагента "+Контрагент);
				//			Возврат тНом;
				//		КонецЕсли;
				//		//Катаев- 28/05/14
				//	КонецЕсли;
				//КонецЕсли;
				////Катаев- 24/03/14
				Возврат Рез.Номенклатура;
			КонецЕсли;
		КонецЕсли;
		// Катаев- 12/03113
	КонецЕсли;
	
	//---------------------------------------------------------------------------
	
	
	// выбираем нужный документ матрица.
	Если ИспШтрихКодАртикул=2 Тогда
		
		//ищем по артикулу
		// Катаев+ 12/03/13 Исключаем поиск ШК если Артикул = Неопределено
		Если Артикул <> Неопределено Тогда
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	МатрицаТовары.Номенклатура,
			|	МатрицаТовары.ШККонтрагента,
			//Катаев+ 25/09/14
			|	МатрицаТовары.ШККонтрагентаБлочок,
			//Катаев- 25/09/14
			|	МатрицаТовары.АртикулКонтрагента,
			|	МатрицаТовары.Цена
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|ГДЕ
			|	МатрицаТовары.Ссылка.Контрагент = &Контрагент
			|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
			|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА
			|	И МатрицаТовары.АртикулКонтрагента ПОДОБНО &ТекАрт	
			//нечаева 22,05,17+++
			|
			|УПОРЯДОЧИТЬ ПО
			|	ШККонтрагента УБЫВ";
			//нечаева 22,05,17---
			
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("ТекАрт",СокрЛП(Артикул));
			Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
			
			Рез=Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() Тогда
				//Катаев+ 24/03/14 Для контрагентов участвующих в обмене ЭСФ критично несовпадение артикула и ШК из заказа и тем что занесено у нас.
				//нечаева 12,04,16+++ добавила исключение по ленте, для нее другая проверка.
				Если Контрагент.ДатаНачалаЭСФ <> Дата(1,1,1) и не (Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSR-1593") )  Тогда
					//нечаева 12,04,16 ----
					Если ШК <> Рез.ШККонтрагента Тогда
						//Катаев+ 28/05/14 Записей может быть несколько. Проверяем каждую
						//КритичОшибки.Добавить("Для номенклатуры "+рез.Номенклатура+" не совпадает ШК из заказа ("+ШК+") с ШК из матрицы ("+Рез.ШККонтрагента+") для контрагента "+Контрагент);
						ЗаписьНайдена = Ложь;
						тНом = Рез.Номенклатура;
						Пока рез.Следующий() Цикл
							Если ШК = Рез.ШККонтрагента Тогда
								ЗаписьНайдена = Истина;
								Прервать;
							КонецЕсли;
						КонецЦикла;
						Если Не ЗаписьНайдена Тогда
							КритичОшибки.Добавить("Для номенклатуры "+рез.Номенклатура+" в матрицах не найден ШК из заказа ("+ШК+") для контрагента "+Контрагент);
							Возврат тНом;
						КонецЕсли;
						//Катаев- 28/05/14
					КонецЕсли;
				КонецЕсли;
				//Катаев- 24/03/14
				//Катаев+ 25/09/14 Для Ленты сверим совпадение ШК из заказа и ШК из матриц
				//Возврат Рез.Номенклатура;
				Если Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSR-1593") Тогда
					ТНоменклатура = Рез.Номенклатура;
					Если Не ПустаяСтрока(рез.ШККонтрагентаБлочок) Тогда
						ШК_Контр = рез.ШККонтрагентаБлочок;
					Иначе
						ШК_Контр = рез.ШККонтрагента;
					КонецЕсли;
					Если ШК_Контр <> ШК Тогда
						Ошибки.Добавить("Для номенклатуры "+рез.Номенклатура+" ШК из заказа ("+ШК+") не совпадает с ШК из матрицы("+ШК_Контр+") для контрагента "+Контрагент);
						Возврат ТНоменклатура;
					КонецЕсли;
					Пока рез.Следующий() Цикл
						Если Не ПустаяСтрока(рез.ШККонтрагентаБлочок) Тогда
							ШК_Контр = рез.ШККонтрагентаБлочок;
						Иначе
							ШК_Контр = рез.ШККонтрагента;
						КонецЕсли;
						Если ШК_Контр <> ШК Тогда
							Ошибки.Добавить("Для номенклатуры "+рез.Номенклатура+" ШК из заказа ("+ШК+") не совпадает с ШК из матрицы("+ШК_Контр+") для контрагента "+Контрагент);
							Возврат ТНоменклатура;
						КонецЕсли;
					КонецЦикла;
					Возврат ТНоменклатура;
				КонецЕсли;
				//Катаев- 25/09/14
			КонецЕсли;
		КонецЕсли;
		// Катаев- 12/03113
		
		// ищем по ШК
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура КАК Номенклатура,
		|	МатрицаТовары.ШККонтрагента КАК ШККонтрагента,
		|	МатрицаТовары.АртикулКонтрагента КАК АртикулКонтрагента,
		|	МатрицаТовары.Цена КАК Цена
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	(МатрицаТовары.ШККонтрагента = &ТекШК
		|			ИЛИ МатрицаТовары.ШККонтрагентаДополнительный = &ТекШК
		|			ИЛИ МатрицаТовары.ШККонтрагентаБлочок = &ТекШК)
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
		|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТекШк",ШК);
		Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
		
		Рез=Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() Тогда
			//Катаев+ 24/03/14 Для контрагентов участвующих в обмене ЭСФ критично несовпадение артикула и ШК из заказа и тем что занесено у нас.
			Если Контрагент.ДатаНачалаЭСФ <> Дата(1,1,1) Тогда
				Если Артикул <> Рез.АртикулКонтрагента Тогда
					//Катаев+ 28/05/14 Записей может быть несколько. Проверяем каждую
					//КритичОшибки.Добавить("Для номенклатуры "+рез.Номенклатура+" не совпадает артикул из заказа ("+Артикул+") с артикулом из матрицы ("+Рез.АртикулКонтрагента+") для контрагента "+Контрагент);
					ЗаписьНайдена = Ложь;
					тНом = Рез.Номенклатура;
					Пока рез.Следующий() Цикл
						Если Артикул = Рез.АртикулКонтрагента Тогда
							ЗаписьНайдена = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если Не ЗаписьНайдена Тогда
						КритичОшибки.Добавить("Для номенклатуры "+рез.Номенклатура+" в матрицах не найден артикул из заказа ("+Артикул+") для контрагента "+Контрагент);
						Возврат тНом;
					КонецЕсли;
					//Катаев- 28/05/14
				КонецЕсли;
			КонецЕсли;
			//Катаев- 24/03/14
			Возврат Рез.Номенклатура;
		КонецЕсли;
		
	КонецЕсли;
	
	
	// выбираем нужный документ матрица.
	Если ИспШтрихКодАртикул=3 Тогда
		
		
		// ищем по ШК
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура,
		|	МатрицаТовары.ШККонтрагента,
		|	МатрицаТовары.АртикулКонтрагента,
		|	МатрицаТовары.Цена
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	(МатрицаТовары.ШККонтрагента = &ТекШК
		|			ИЛИ МатрицаТовары.ШККонтрагентаДополнительный = &ТекШК)
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
		|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТекШк",ШК);
		Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
		
		Рез=Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() Тогда
			//Катаев+ 24/03/14 Для контрагентов участвующих в обмене ЭСФ критично несовпадение артикула и ШК из заказа и тем что занесено у нас.
			Если Контрагент.ДатаНачалаЭСФ <> Дата(1,1,1) Тогда
				Если Артикул <> Рез.АртикулКонтрагента Тогда
					//Катаев+ 28/05/14 Записей может быть несколько. Проверяем каждую
					//КритичОшибки.Добавить("Для номенклатуры "+рез.Номенклатура+" не совпадает артикул из заказа ("+Артикул+") с артикулом из матрицы ("+Рез.АртикулКонтрагента+") для контрагента "+Контрагент);
					ЗаписьНайдена = Ложь;
					тНом = Рез.Номенклатура;
					Пока рез.Следующий() Цикл
						Если Артикул = Рез.АртикулКонтрагента Тогда
							ЗаписьНайдена = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если Не ЗаписьНайдена Тогда
						КритичОшибки.Добавить("Для номенклатуры "+рез.Номенклатура+" в матрицах не найден артикул из заказа ("+Артикул+") для контрагента "+Контрагент);
						Возврат тНом;
					КонецЕсли;
					//Катаев- 28/05/14
				КонецЕсли;
			КонецЕсли;
			//Катаев- 24/03/14
			Возврат Рез.Номенклатура;
		КонецЕсли;
		
	КонецЕсли;
	
	
	// выбираем нужный документ матрица.
	Если ИспШтрихКодАртикул=4 Тогда
		
		//нечаева 11.,10,18++
		// для дикси проверим еще на то, есть ли комплектующие с таким Шк, если есть, то берем эту номенклатуру.
		Если Контрагент.код = "SSP-3687" Тогда
			Если Артикул <> Неопределено Тогда
				Запрос=Новый Запрос;
				Запрос.Текст="ВЫБРАТЬ
				|	МатрицаТовары.ШККонтрагента,
				|	МатрицаТовары.АртикулКонтрагента,
				|	МатрицаТовары.Цена,
				|	ВложенныйЗапрос.Ссылка как ссылка
				|ИЗ
				|	(ВЫБРАТЬ
				|		СУММА(1) КАК Количество,
				|		НоменклатураКоплектующие.Ссылка КАК Ссылка
				|	ИЗ
				|		Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
				|	
				|	СГРУППИРОВАТЬ ПО
				|		НоменклатураКоплектующие.Ссылка) КАК ВложенныйЗапрос
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Матрица.Товары КАК МатрицаТовары
				|		ПО МатрицаТовары.Номенклатура = ВложенныйЗапрос.Ссылка
				|ГДЕ
				|	 МатрицаТовары.АртикулКонтрагента ПОДОБНО &ТекАрт
				|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
				|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
				|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА";
				
				Запрос.УстановитьПараметр("Контрагент",Контрагент);
				Запрос.УстановитьПараметр("ТекАрт",Артикул);
				Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
				
				Рез=Запрос.Выполнить().Выбрать();
				Если Рез.Следующий() Тогда
					Возврат Рез.ссылка;
				КонецЕсли;
				
			КонецЕсли;
			
		конецЕсли;
		///нечаева 11.,10,18---
		
		
		//ищем по артикулу
		// Катаев+ 12/03/13 Исключаем поиск ШК если Артикул = Неопределено
		Если Артикул <> Неопределено Тогда
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	МатрицаТовары.Номенклатура,
			|	МатрицаТовары.ШККонтрагента,
			|	МатрицаТовары.АртикулКонтрагента,
			|	МатрицаТовары.Цена
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|ГДЕ
			|	МатрицаТовары.Ссылка.Контрагент = &Контрагент
			|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
			|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА
			|	И МатрицаТовары.АртикулКонтрагента ПОДОБНО &ТекАрт";
			
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("ТекАрт",Артикул);
			Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
			
			Рез=Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() Тогда
				//Катаев+ 24/03/14 Для контрагентов участвующих в обмене ЭСФ критично несовпадение артикула и ШК из заказа и тем что занесено у нас.
				Если Контрагент.ДатаНачалаЭСФ <> Дата(1,1,1)  Тогда
					Если ШК <> Рез.ШККонтрагента Тогда
						//Катаев+ 28/05/14 Записей может быть несколько. Проверяем каждую
						//КритичОшибки.Добавить("Для номенклатуры "+рез.Номенклатура+" не совпадает ШК из заказа ("+ШК+") с ШК из матрицы ("+Рез.ШККонтрагента+") для контрагента "+Контрагент);
						ЗаписьНайдена = Ложь;
						тНом = Рез.Номенклатура;
						Пока рез.Следующий() Цикл
							Если ШК = Рез.ШККонтрагента Тогда
								ЗаписьНайдена = Истина;
								Прервать;
							КонецЕсли;
						КонецЦикла;
						Если Не ЗаписьНайдена Тогда
							КритичОшибки.Добавить("Для номенклатуры "+рез.Номенклатура+" в матрицах не найден ШК из заказа ("+ШК+") для контрагента "+Контрагент);
							Возврат тНом;
						КонецЕсли;
						//Катаев- 28/05/14
					КонецЕсли;
				КонецЕсли;
				//Катаев- 24/03/14
				Возврат Рез.Номенклатура;
			КонецЕсли;
		КонецЕсли;
		// Катаев- 12/03113
		
		
	КонецЕсли;
	
	//Катаев+ 28/03/14 Для Окей наш ШК = артикулу из заказа
	Если ИспШтрихКодАртикул=5 Тогда
		
		Если Артикул <> Неопределено Тогда
			Запрос=Новый Запрос;
			Запрос.Текст=
			"ВЫБРАТЬ
			|	МатрицаТовары.Номенклатура,
			|	МатрицаТовары.ШККонтрагента,
			|	МатрицаТовары.АртикулКонтрагента,
			|	МатрицаТовары.Цена
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|ГДЕ
			|	МатрицаТовары.Ссылка.Контрагент = &Контрагент
			|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
			|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА
			|	И (МатрицаТовары.ШККонтрагента = &ТекШК
			|			ИЛИ МатрицаТовары.ШККонтрагентаДополнительный = &ТекШК)";
			
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("ТекШк",Артикул);
			Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
			
			Рез=Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() Тогда
				Возврат Рез.Номенклатура;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Катаев- 28/03/14
	
	
	//нечаева ищем по шк блочка 	 для метро 17,08,16 +++ нечаева
	// выбираем нужный документ матрица.
	Если ИспШтрихКодАртикул=7 Тогда
		
		// ищем по ШК  блочка
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура,
		|	МатрицаТовары.ШККонтрагента,
		|	МатрицаТовары.АртикулКонтрагента,
		|	МатрицаТовары.Цена,
		|	МатрицаТовары.ШККонтрагентаБлочок
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	(МатрицаТовары.ШККонтрагентаБлочок = &ТекШК
		|			ИЛИ МатрицаТовары.ШККонтрагентаДополнительный = &ТекШК)
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
		|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТекШк",ШК);
		Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
		
		Рез=Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() Тогда
			//для метро критично
			//нечаева 06,11,18++
			Если Артикул <> Рез.АртикулКонтрагента Тогда
				КритичОшибки.Добавить("Для номенклатуры "+рез.Номенклатура+" не совпадает артикул из заказа ("+Артикул+") с артикулом из матрицы ("+Рез.АртикулКонтрагента+") для контрагента "+Контрагент);
			КонецЕсли;
			//нечаева 06,11,18--	
			
			Возврат Рез.Номенклатура;
		КонецЕсли;
		
		
		//ищем по артикулу
		// Катаев+ 12/03/13 Исключаем поиск ШК если Артикул = Неопределено
		Если Артикул <> Неопределено Тогда
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	МатрицаТовары.Номенклатура,
			|	МатрицаТовары.ШККонтрагента,
			|	МатрицаТовары.АртикулКонтрагента,
			|	МатрицаТовары.Цена
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|ГДЕ
			|	МатрицаТовары.Ссылка.Контрагент = &Контрагент
			|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
			|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА
			|	И МатрицаТовары.АртикулКонтрагента ПОДОБНО &ТекАрт";
			
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("ТекАрт",Артикул);
			Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
			
			Рез=Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() Тогда
				Возврат Рез.Номенклатура;
			КонецЕсли;
		КонецЕсли;
		
		
		// ищем по ШК 
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура,
		|	МатрицаТовары.ШККонтрагента,
		|	МатрицаТовары.АртикулКонтрагента,
		|	МатрицаТовары.Цена,
		|	МатрицаТовары.ШККонтрагента
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	(МатрицаТовары.ШККонтрагента = &ТекШК
		|			ИЛИ МатрицаТовары.ШККонтрагентаДополнительный = &ТекШК)
		
		|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
		|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТекШк",ШК);
		Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
		
		Рез=Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() Тогда
			Возврат Рез.Номенклатура;
		КонецЕсли;
		
		
		
	КонецЕсли;
	//нечаева 17,08,16---
	
	
	
	возврат НайденнаяНоменклатура;
	//----------------------------------------------------------------------------
КонецФункции // НайтиПОШК()


Процедура СообщитьМенеджеру(Док) Экспорт
	
	Если ПараметрыСеанса.Отладка Тогда
		Возврат;
	КонецЕсли;
	
	//Менеджер=СтрШапка.контрагент.Менеджер;
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
	//	Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//	Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Иначе
	//	Профиль.АдресСервераPOP3   = "87.236.190.180";
	//	Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//КонецЕсли;
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);		 
	// Кухарь А.Ю.  08.09.2022 конец

	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	//---------------------------------------------------------------
	//Попытка
	//	ИмяФайлаПечати=ФормированиеПечати(ТЗПечать,ТЗШапка); //+++
	//Исключение
	//	КритичОшибки.Добавить("Не сформирован файл печати! "+Символ(13));
	//КонецПопытки;
	
	// и прикрепляем файл;
	
	//----------------------------------------------------------------
	Сообщение=новый интернетПочтовоеСообщение;
	//Если НЕ Сокрлп(Менеджер.ЕМэйл)=""  тогда
	//	Если Менеджер.Штатный Тогда
	//		Сообщение.Получатели.Добавить(Менеджер.ЕМэйл);
	//	КонецЕсли;
	//	
	//конецесли;
	//---------------------------------------------------
	// получаем заместителей, для отправки из справочника пользователи.
	//Запрос=Новый Запрос;
	//Запрос.Текст="ВЫБРАТЬ
	//|	ПользователиЗаместители.Заместитель,
	//|	ПользователиЗаместители.Заместитель.ЕМэйл  как ЗамЕМэйл
	//|ИЗ
	//|	Справочник.Пользователи.Заместители КАК ПользователиЗаместители
	//|ГДЕ
	//|	ПользователиЗаместители.Ссылка.ФизЛицо = &ТекМенеджер";
	//Запрос.УстановитьПараметр("ТекМенеджер",Менеджер);
	//Результат=Запрос.Выполнить().Выбрать();
	//Пока Результат.Следующий() Цикл
	//	Если СтрДлина(Результат.ЗамЕМэйл)>5 Тогда
	//		Если Результат.Заместитель.Штатный Тогда
	//			Сообщение.Получатели.Добавить(Результат.ЗамЕМэйл);
	//		КонецЕсли;
	//				Иначе
	//		КритичОшибки.Добавить("Для менеджера (зам)"+Результат.Заместитель.Наименование+" не определен ЕМэйл. "+Символ(13));
	//	КонецЕсли;
	//КонецЦикла;	
	//Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	Сообщение.Получатели.Добавить("egorova_k@collant.ru");
	Сообщение.Получатели.Добавить("kulagina@collant.ru");
	
	
	//Нечаева 11,03,19+++
	//-----------------------------------------------
	//// если есть ошибки какие-то то сообщать ассистентам.
	//Если Ошибки.Количество()>0 Тогда
	//
	//		Запрос=Новый Запрос;
	//		Запрос.Текст="ВЫБРАТЬ
	//		|	УведомленияПоЕкоду.Пользователь
	//		|ИЗ
	//		|	РегистрСведений.УведомленияПоЕкоду КАК УведомленияПоЕкоду
	//		|ГДЕ
	//		|	УведомленияПоЕкоду.Контрагент = &ТекКонтр
	//		|	И УведомленияПоЕкоду.ТипУведомления = &ТипУвед";
	//		Запрос.УстановитьПараметр("ТекКонтр",СтрШапка.контрагент);
	//		Запрос.УстановитьПараметр("ТипУвед","заказ");
	//		Результат=Запрос.Выполнить().Выбрать();
	//		Пока Результат.Следующий() Цикл
	//			Попытка	
	//				Если СтрДлина(Результат.Пользователь)>5 Тогда
	//					Сообщение.Получатели.Добавить(Результат.Пользователь.ЕМэйл);
	//				Иначе
	//					КритичОшибки.Добавить("Для менеджера (зам)"+Результат.Пользователь.Наименование+" не определен ЕМэйл. "+Символ(13));
	//				КонецЕсли;
	//			Исключение	
	//				ошибки.Добавить(" добавление адресов - ошибка "+ОписаниеОшибки());
	//				Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	//			КонецПопытки;	
	//			
	//		КонецЦикла;
	//		
	//		
	//КонецЕсли;
	
	//-----------------------------------------------
	//Нечаева 11,03,19---
	
	
	//Если Сообщение.Получатели.Количество() = 0 Тогда
	//	Если Менеджер = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
	//		КритичОшибки.Добавить("У Контрагента "+СтрШапка.контрагент+" не определен менеждер. "+Символ(13));
	//	Иначе
	//		КритичОшибки.Добавить("У менеджера "+Менеджер+" и его заместителей не определен ЕМэйл. "+Символ(13));
	//	КонецЕсли;
	//	Возврат
	//КонецЕсли;
	Сообщение.Отправитель="ecode@collant.ru";
	
	//ПунктДоставки=СтрШапка.ПунктДоставки;
	//
	//Если ПунктДоставки=Неопределено тогда
	//	ПунктДоставки="";
	//Конецесли;	
	
	Сообщение.Тема=" Новый заказ из ИМ Озон № "+Док.номерЗаказа;
	Строка=Символ(13)+Символ(13)+"       Добрый день!"+Символ(13)+Символ(13)+Строка("Новый заказ ИМ Озон № "+Док.номерЗаказа+".")+
	+Символы.ПС+"Сформировано новое РНК № "+Док.номер+" "+Док.Дата+"."+Символ(13)+Символ(13);
	Для рр=0 по файлы.Количество()-1 Цикл
		Строка=Строка+символы.ПС+Файлы[рр];
	КонецЦикла;
	
	
	НомСтр=1;
	//Строка=Строка+Символы.ПС+символы.ПС+"Фактический адрес, пунк доставки: "+СтрШапка.ПунктДоставки;
	Строка=Строка+Символы.ПС;
	Если Ошибки.количество()>1 Тогда
		Строка=Строка+Символы.ПС+"Сообщения по загрузке данных:";
	КонецЕсли;	
	Если НЕ Ошибки=Неопределено и ошибки.Количество()>0 Тогда
		Для рр=0 по ошибки.Количество()-1 Цикл
			Строка=Строка+Символы.ПС+НомСтр+". "+Ошибки[рр];
			Строка=Строка+Символы.ПС;
			НомСтр=НомСтр+1;
		КонецЦикла;
	конецЕсли;
	Строка=Строка+Символы.ПС+"________________________________________________________________";
	
	Сообщение.Тексты.Добавить(Строка);
	
	//Сообщение.Вложения.Добавить(ПутьФайла);
	//Попытка
	//	Сообщение.Вложения.Добавить(ИмяФайлаПечати);     //+++
	//Исключение
	//	КритичОшибки.Добавить("Не возможно добавить файл печати для заказа "+СтрШапка.НомЗаказа+". Контрагент - "+СтрШапка.контрагент+".  "+ОписаниеОшибки() );
	//КонецПопытки;
	//
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
	исключение
		КритичОшибки.Добавить("Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки() );
	конецПопытки;
	Попытка
		Почта.Послать(Сообщение);
	исключение
		
		//КритичОшибки.Добавить("Не возможно отправить сообщение!   "+ОписаниеОшибки() );
		////Катаев+ 27/02/14 Катаев+
		//КритичОшибки.Добавить("Узел - "+ПланыОбмена.Основной.ЭтотУзел());
		//КритичОшибки.Добавить("Менеджер - "+Менеджер);
		//КритичОшибки.Добавить("Заказ ЕКОД - "+СтрШапка.номЗаказа);
		////Катаев- 27/02/14
		//для каждого пол из сообщение.Получатели цикл
		//КритичОшибки.Добавить("Получатель="+пол+" "+пол.ОтображаемоеИмя);
		//конеццикла;
	конецПопытки;
	Почта.Отключиться();
	//	УдалитьФайлы(ИмяФайлаПечати);     //+++
	
КонецПроцедуры


Процедура СообщитьМенеджеруОзон(Док) Экспорт
	
	Если ПараметрыСеанса.Отладка Тогда
		Возврат;
	КонецЕсли;
	
	//Менеджер=СтрШапка.контрагент.Менеджер;
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
	//	Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//	Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Иначе
	//	Профиль.АдресСервераPOP3   = "87.236.190.180";
	//	Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//КонецЕсли;
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);		 
	// Кухарь А.Ю.  08.09.2022 конец

	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	//---------------------------------------------------------------
	//Попытка
	//	ИмяФайлаПечати=ФормированиеПечати(ТЗПечать,ТЗШапка); //+++
	//Исключение
	//	КритичОшибки.Добавить("Не сформирован файл печати! "+Символ(13));
	//КонецПопытки;
	
	// и прикрепляем файл;
	
	//----------------------------------------------------------------
	Сообщение=новый интернетПочтовоеСообщение;
	//Если НЕ Сокрлп(Менеджер.ЕМэйл)=""  тогда
	//	Если Менеджер.Штатный Тогда
	//		Сообщение.Получатели.Добавить(Менеджер.ЕМэйл);
	//	КонецЕсли;
	//	
	//конецесли;
	//---------------------------------------------------
	// получаем заместителей, для отправки из справочника пользователи.
	//Запрос=Новый Запрос;
	//Запрос.Текст="ВЫБРАТЬ
	//|	ПользователиЗаместители.Заместитель,
	//|	ПользователиЗаместители.Заместитель.ЕМэйл  как ЗамЕМэйл
	//|ИЗ
	//|	Справочник.Пользователи.Заместители КАК ПользователиЗаместители
	//|ГДЕ
	//|	ПользователиЗаместители.Ссылка.ФизЛицо = &ТекМенеджер";
	//Запрос.УстановитьПараметр("ТекМенеджер",Менеджер);
	//Результат=Запрос.Выполнить().Выбрать();
	//Пока Результат.Следующий() Цикл
	//	Если СтрДлина(Результат.ЗамЕМэйл)>5 Тогда
	//		Если Результат.Заместитель.Штатный Тогда
	//			Сообщение.Получатели.Добавить(Результат.ЗамЕМэйл);
	//		КонецЕсли;
	//				Иначе
	//		КритичОшибки.Добавить("Для менеджера (зам)"+Результат.Заместитель.Наименование+" не определен ЕМэйл. "+Символ(13));
	//	КонецЕсли;
	//КонецЦикла;	
	//	Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	Сообщение.Получатели.Добавить("egorova_k@collant.ru");
	Сообщение.Получатели.Добавить("kulagina@collant.ru");
	
	
	//Нечаева 11,03,19+++
	//-----------------------------------------------
	//// если есть ошибки какие-то то сообщать ассистентам.
	//Если Ошибки.Количество()>0 Тогда
	//
	//		Запрос=Новый Запрос;
	//		Запрос.Текст="ВЫБРАТЬ
	//		|	УведомленияПоЕкоду.Пользователь
	//		|ИЗ
	//		|	РегистрСведений.УведомленияПоЕкоду КАК УведомленияПоЕкоду
	//		|ГДЕ
	//		|	УведомленияПоЕкоду.Контрагент = &ТекКонтр
	//		|	И УведомленияПоЕкоду.ТипУведомления = &ТипУвед";
	//		Запрос.УстановитьПараметр("ТекКонтр",СтрШапка.контрагент);
	//		Запрос.УстановитьПараметр("ТипУвед","заказ");
	//		Результат=Запрос.Выполнить().Выбрать();
	//		Пока Результат.Следующий() Цикл
	//			Попытка	
	//				Если СтрДлина(Результат.Пользователь)>5 Тогда
	//					Сообщение.Получатели.Добавить(Результат.Пользователь.ЕМэйл);
	//				Иначе
	//					КритичОшибки.Добавить("Для менеджера (зам)"+Результат.Пользователь.Наименование+" не определен ЕМэйл. "+Символ(13));
	//				КонецЕсли;
	//			Исключение	
	//				ошибки.Добавить(" добавление адресов - ошибка "+ОписаниеОшибки());
	//				Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	//			КонецПопытки;	
	//			
	//		КонецЦикла;
	//		
	//		
	//КонецЕсли;
	
	//-----------------------------------------------
	//Нечаева 11,03,19---
	
	
	//Если Сообщение.Получатели.Количество() = 0 Тогда
	//	Если Менеджер = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
	//		КритичОшибки.Добавить("У Контрагента "+СтрШапка.контрагент+" не определен менеждер. "+Символ(13));
	//	Иначе
	//		КритичОшибки.Добавить("У менеджера "+Менеджер+" и его заместителей не определен ЕМэйл. "+Символ(13));
	//	КонецЕсли;
	//	Возврат
	//КонецЕсли;
	Сообщение.Отправитель="ecode@collant.ru";
	
	//ПунктДоставки=СтрШапка.ПунктДоставки;
	//
	//Если ПунктДоставки=Неопределено тогда
	//	ПунктДоставки="";
	//Конецесли;	
	
	Сообщение.Тема=" Ошибки Озон  "+Док.номерЗаказа;
	Строка=Символ(13)+Символ(13)+"       Добрый день!"; //+Символ(13)+Символ(13)+Строка("Новый заказ ИМ Озон № "+Док.номерЗаказа+".")+
	//+Символы.ПС+"Сформировано новое РНК № "+Док.номер+" "+Док.Дата+"."+Символ(13)+Символ(13);
	//Для рр=0 по файлы.Количество()-1 Цикл
	//	Строка=Строка+символы.ПС+Файлы[рр];
	//КонецЦикла;
	
	
	НомСтр=1;
	//Строка=Строка+Символы.ПС+символы.ПС+"Фактический адрес, пунк доставки: "+СтрШапка.ПунктДоставки;
	Строка=Строка+Символы.ПС;
	Если КритическиеОшибкиОзон.количество()>1 Тогда
		Строка=Строка+Символы.ПС+"Сообщения по загрузке данных:";
	КонецЕсли;	
	Если НЕ КритическиеОшибкиОзон=Неопределено и КритическиеОшибкиОзон.Количество()>0 Тогда
		Для рр=0 по КритическиеОшибкиОзон.Количество()-1 Цикл
			Строка=Строка+Символы.ПС+НомСтр+". "+КритическиеОшибкиОзон[рр];
			Строка=Строка+Символы.ПС;
			НомСтр=НомСтр+1;
		КонецЦикла;
	конецЕсли;
	Строка=Строка+Символы.ПС+"________________________________________________________________";
	
	Сообщение.Тексты.Добавить(Строка);
	
	//Сообщение.Вложения.Добавить(ПутьФайла);
	//Попытка
	//	Сообщение.Вложения.Добавить(ИмяФайлаПечати);     //+++
	//Исключение
	//	КритичОшибки.Добавить("Не возможно добавить файл печати для заказа "+СтрШапка.НомЗаказа+". Контрагент - "+СтрШапка.контрагент+".  "+ОписаниеОшибки() );
	//КонецПопытки;
	//
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
	исключение
		КритичОшибки.Добавить("Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки() );
	конецПопытки;
	Попытка
		Почта.Послать(Сообщение);
	исключение
		
		//КритичОшибки.Добавить("Не возможно отправить сообщение!   "+ОписаниеОшибки() );
		////Катаев+ 27/02/14 Катаев+
		//КритичОшибки.Добавить("Узел - "+ПланыОбмена.Основной.ЭтотУзел());
		//КритичОшибки.Добавить("Менеджер - "+Менеджер);
		//КритичОшибки.Добавить("Заказ ЕКОД - "+СтрШапка.номЗаказа);
		////Катаев- 27/02/14
		//для каждого пол из сообщение.Получатели цикл
		//КритичОшибки.Добавить("Получатель="+пол+" "+пол.ОтображаемоеИмя);
		//конеццикла;
	конецПопытки;
	Почта.Отключиться();
	//	УдалитьФайлы(ИмяФайлаПечати);     //+++
	
КонецПроцедуры



Процедура СообщитьКритОшибки() Экспорт
	
	Если ПараметрыСеанса.Отладка Тогда
		Возврат;
	КонецЕсли;
	//Катаев- 09/04/13
	
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
	//	Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//	Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Иначе
	//	Профиль.АдресСервераPOP3   = "87.236.190.180";
	//	Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//КонецЕсли;
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);		 
	// Кухарь А.Ю.  08.09.2022 конец

	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	//------------------------------------------------
	// сообщение о критических ошибках
	//------------------------------------------------
	сообщениеКрит=новый интернетПочтовоеСообщение;
	//Катаев+ 09/04/13 ошибочный одрес получателя
	//СообщениеКрит.Получатели.Добавить("ecode@collant.ru"); //+++
	//Катаев- 09/04/13
	
	//Катаев+ 07/05/13 получатели критических ошибок будем брать из Регистра сведений
	СообщениеКрит.Получатели.Добавить("nechaeva@collant.ru");
	//СообщениеКрит.Получатели.Добавить("grishakov@collant.ru");
	//СообщениеКрит.Получатели.Добавить("nikolaev@collant.ru");
	//СообщениеКрит.Получатели.Добавить("krohin@collant.ru");
	//СообщениеКрит.Получатели.Добавить("pokidyshev@collant.ru");
	//СообщениеКрит.Получатели.Добавить("gorbachenko@collant.ru");
	////крохин начало 21.06.2012
	//СообщениеКрит.Получатели.Добавить("loban@collant.ru");	
	////крохин конец 21.06.2012
	//
	////Катаев+ 22/03/13
	//СообщениеКрит.Получатели.Добавить("kataev@collant.ru");	
	////Катаев- 22/03/13
	//Выборка = регистрыСведений.Емайл_КритОшибки.Выбрать();
	//Пока  Выборка.Следующий() Цикл
	//	СообщениеКрит.Получатели.Добавить(Выборка.емайл);
	//КонецЦикла;
	//Если СообщениеКрит.Получатели.Количество() = 0 Тогда
	//	//СообщениеКрит.Получатели.Добавить("krohin@collant.ru");
	//	//Катаев+ 27/02/14
	//	//СообщениеКрит.Получатели.Добавить("kataev@collant.ru");
	//	//20.04.15+++
	//	//СообщениеКрит.Получатели.Добавить("nechaeva@collant.ru");
	//	СообщениеКрит.Получатели.Добавить("egorova_k@collant.ru");
	//	СообщениеКрит.Получатели.Добавить("kulagina@collant.ru");
	
	//	//20.04.15*--
	//	//Катаев- 27/02/14
	//КонецЕсли;
	//Катаев- 07/05/13
	//Катаев+ 14/07/14 Для филиалов в получатели добавляем менеджера и его замов
	//Если ПланыОбмена.Основной.ЭтотУзел() <> ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
	//	СтрШапка = ТЗШапка.Получить(0);
	//	Менеджер=СтрШапка.контрагент.Менеджер;
	//	Если НЕ Сокрлп(Менеджер.ЕМэйл)=""  тогда
	//		Если Менеджер.Штатный Тогда
	//			СообщениеКрит.Получатели.Добавить(Менеджер.ЕМэйл);
	//		КонецЕсли;
	//	конецесли;
	//	Запрос=Новый Запрос;
	//	Запрос.Текст="ВЫБРАТЬ
	//	|	ПользователиЗаместители.Заместитель,
	//	|	ПользователиЗаместители.Заместитель.ЕМэйл  как ЗамЕМэйл
	//	|ИЗ
	//	|	Справочник.Пользователи.Заместители КАК ПользователиЗаместители
	//	|ГДЕ
	//	|	ПользователиЗаместители.Ссылка.ФизЛицо = &ТекМенеджер";
	//	Запрос.УстановитьПараметр("ТекМенеджер",Менеджер);
	//	Результат=Запрос.Выполнить().Выбрать();
	//	Пока Результат.Следующий() Цикл
	//		Если СтрДлина(Результат.ЗамЕМэйл)>5 Тогда
	//			Если Результат.Заместитель.Штатный Тогда
	//				СообщениеКрит.Получатели.Добавить(Результат.ЗамЕМэйл);
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЦикла;
	//Конецесли;
	//Катаев- 14/07/14
	
	сообщениеКрит.Отправитель="ecode@collant.ru";
	СообщениеКрит.Тема="Автообмен ОЗОН. Критические ошибки!";
	Строка="Добрый день!!!"+Символ(13);
	НомСтр=1;
	Если НЕ Ошибки=Неопределено и КритичОшибки.Количество()>0 Тогда
		Для рр=0 по КритичОшибки.Количество()-1 Цикл
			Строка=Строка+Символ(13)+НомСтр+". "+КритичОшибки[рр];
			Строка=Строка+Символ(13);
			НомСтр=НомСтр+1;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ Ошибки=Неопределено и КритическиеОшибкиОзон2.Количество()>0 Тогда
		Для рр=0 по КритическиеОшибкиОзон2.Количество()-1 Цикл
			Строка=Строка+Символ(13)+НомСтр+". "+КритическиеОшибкиОзон[рр];
			Строка=Строка+Символ(13);
			НомСтр=НомСтр+1;
		КонецЦикла;
	КонецЕсли;
	Строка=Строка+Символ(13)+"";
	//-----------------------------------------
	СообщениеКрит.Тексты.Добавить(Строка);
	
	Строка=Строка+Символ(13)+"________________________________________________________________";
	//-----------------------------------------
	СообщениеКрит.Тексты.Добавить(Строка);
	
	Почта= Новый ИнтернетПочта;
	Почта.Подключиться(Профиль);
	почта.Послать(СообщениеКрит);
	Почта.Отключиться();
	
КонецПроцедуры



Процедура ИзменитьСтатусДокумента(ИДДокумента,НомерДок) Экспорт
	возврат;
	//Сообщить(" Начало... " +ИДДокумента);	
	IDDok=ИДДокумента;
	
	//RegExp = Новый COMОбъект("VBScript.RegExp");	
	
	ScrptCtrl=Новый COMОбъект("MSScriptControl.ScriptControl");
	ScrptCtrl.Language="vbscript";
	
	//ScrptCtrl.AddCode("
	//|Function GetStatusDok()
	//|	const HKEY_CURRENT_USER = &H80000001
	//|	Set oReg=GetObject(""winmgmts:{impersonationLevel=impersonate}!\\.\root\default:StdRegProv"")
	//|	strKeyPath = ""Software\1C\1Cv7\7.7\Titles""
	//|	oReg.EnumValues HKEY_CURRENT_USER, strKeyPath, arrValues
	//|	strInfo=vbNullString
	//|	For i = LBound(arrValues) To UBound(arrValues)
	//|		call oReg.GetStringValue(HKEY_CURRENT_USER,strKeyPath,arrValues(i),Value)
	//|		strInfo=strInfo & arrValues(i) & vbTab & Value & vbCrLf
	//|	Next
	//|	Get1CV77Titles = strInfo
	//|End Function
	//|");
	
	ScrptCtrl.AddCode("
	|Function GetStatusDok()
	|   dim oSOAPClient 
	|   Set oSOAPClient = CreateObject(""MSSOAP.SoapClient"")
	|If (Err.Number = 0) Then
	|   Call oSOAPClient.mssoapinit(""https://www.ecod.pl/webserv2/EDIservice.asmx?WSDL"","""","""","""")
	|   dim ret
	|   If (Err.Number = 0) Then
	|     set ret = oSOAPClient.Relationships(""4607043101594"",""334WFSm"",""5000"")
	|     dim cnt
	|     set cnt = ret.item(1) 
	|     dim res
	|     set res = ret.item(0) 
	|   Else
	|     GetStatusDok=0
	|   End If
	|Else
	|   GetStatusDok=0
	|End If
	|   GetStatusDok=1
	|End Function 
	|");
	
	//|set statusDok=oSOAPClient.ChangeDocumentStatus(""4607043101594"",""334WFSm"",IDDok,""R"")
	
	Попытка	
		Текст=СокрЛП(ScrptCtrl.Run("GetStatusDok"));
	Исключение
		//Сообщить(ОписаниеОшибки());
		КритичОшибки.Добавить("Для заказа ЕКОДЕ "+НомерДок+"  не изменен статус документа!  " + ОписаниеОшибки());
		//Возврат ТаблЗнач;
		
	КонецПопытки;
	
	//Сообщить(""+ИДДокумента+" отработало! ="+Текст);
	
КонецПроцедуры

//*********************************************************************************************
Функция ФормированиеПечати(Строки,Шапка) Экспорт
	
	СтрШапка=Шапка.Получить(0);
	Организация=СтрШапка.Организация;
	
	Макет = ЭтотОбъект.ПолучитьМакет("ЗаказУпрощеннаяФорма");
	
	//Макет = ЭтотОбъект.ПолучитьМакет("Заказ");
	ТабДок= Новый ТабличныйДокумент;
	ТабДок.Очистить();
	ТабДок.Вывод=ИспользованиеВывода.Разрешить;
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.Заполнить(Шапка.Получить(0));
	Организация=Справочники.Организации.НайтиПоКоду("SSP-12"); //КБ- Стиль
	
	Если не Контрагент.Пустая() Тогда 	
		Договор=Контрагент.ОсновнойДоговор;
		Если не (Договор=Неопределено) и не (Договор=справочники.Договоры.ПустаяСсылка()) Тогда
			Если ЗначениеЗаполнено(Договор.Организация) Тогда
				Организация=Договор.Организация;		
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;		
	ГЛНПродавца="";
	ЕИ="4607182079990";
	КБ="4607182769990";
	Если Организация.код="SSP-12" Тогда
		ОбластьЗаголовок.Параметры.ГЛНПродавца=КБ;
	КонецЕсли;
	
	Если Организация.код="SS-001" Тогда
		ОбластьЗаголовок.Параметры.ГЛНПродавца=КБ;
	КонецЕсли;
	
	ОбластьЗаголовок.Параметры.НаименованиеПродавца=Организация.Наименование;
	
	ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
	ОбластьИтоги.Параметры.Заполнить(Шапка.Получить(0));
	ОбластьСтрока = Макет.ПолучитьОбласть("ТекущаяСтрока");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("Шапка");
	
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	НомПП=1;
	ОбщСумма=0; ОбщКолУпак=0;
	Для каждого ТекСтрока Из Строки Цикл
		
		ОбластьСтрока.Параметры.Заполнить(ТекСтрока);
		Если ТекСтрока.Колво-ТекСтрока.КолвоОтредактированное Тогда
			ОбластьСтрока.Область("Колво").ЦветТекста = Новый Цвет(255, 0, 0);
		Иначе
			ОбластьСтрока.Область("Колво").ЦветТекста = Новый Цвет(0, 0, 0);
		КонецЕсли;	
		
		Если ТекСтрока.Найдена Тогда
			ОбластьСтрока.Параметры.Найдена="v";
			ОбластьСтрока.Область("ТекущаяСтрока").ЦветТекста = Новый Цвет(0, 0, 0);
		Иначе	
			ОбластьСтрока.Параметры.Найдена="";
			ОбластьСтрока.Область("ТекущаяСтрока").ЦветТекста = Новый Цвет(255, 0, 0);
		КонецЕсли;
		
		ОбластьСтрока.Параметры.НомПП=НомПП;
		ТабДок.Вывести(ОбластьСтрока);
		НомПП=НомПП+1;
		ОбщСумма=ОбщСумма+ТекСтрока.СуммаБезНДС;
		Если НЕ ТекСтрока.КолУпак=Неопределено тогда
			ОбщКолУпак=ОбщКолУпак+Число(ТекСтрока.КолУпак);
		КонецЕсли;	
		
	КонецЦикла;	
	
	ОбластьИтоги.Параметры.общСумма=ОбщСумма;	
	ОбластьИтоги.Параметры.ОбщКолУпак=ОбщКолУпак;	
	ТабДок.Вывести(ОбластьИтоги);
	ТабДок.ОтображатьСетку=Ложь;
	
	
	//	ТабДок.Показать();
	
	// нечаева 04,12,19++ поменяла формат
	НомЗ = СтрЗаменить(СтрШапка.НомЗаказа, "/", "_");		
	НомЗ = СтрЗаменить(НомЗ, "\", "_");		
	НомЗ = СтрЗаменить(НомЗ, " ", "_");		
	Имя=Константы.КаталогЕКОД.Получить()+НомЗ+".xls";     //++++
	
	Попытка
		ТабДок.Вывод=ИспользованиеВывода.Разрешить;
		ТабДок.Записать(Имя,"xls");
	Исключение
		КритичОшибки.Добавить("Не возможно создать файл печати для заказа "+СтрШапка.НомЗаказа+". Контрагент - "+СтрШапка.контрагент+".  "+ОписаниеОшибки() );
	КонецПопытки;
	// нечаева 04,12,19---
	
	
	Возврат Имя;
	
КонецФункции

// доработка по контрагентам
// 1 округляем количество товаров, если нужно!
// 2 разброс по скаладам, формирование документов.
// 3 условия поиска ШК (для отдельных групп из номенклатуры - Интри, европакеты... кб-стиль)
Процедура ОбработкаДанныхЗагрузки(Шапка,Строки)
	
	СтрШапка=Шапка.Получить(0);
	ТипЦен=Справочники.ТипыЦен.ПустаяСсылка();
	ТипСкидки=Справочники.ТипыСкидок.ПустаяСсылка();
	Организация=Неопределено;
	Менеджер=Неопределено;
	Регион=Неопределено;
	Договор=Неопределено;
	Подразделение=Неопределено;
	ОтсрочкаПлатежа=Неопределено;
	КодПоставщикаКонтрагента=Неопределено;
	ПунктДоставки=Неопределено;
	НомерЗаказа=Неопределено;
	ТипILNКонтрагента=Неопределено;
	ДатаЗаказа=Неопределено;
	ДатаОтгрузки=Неопределено;
	Склад=Неопределено;   //Справочники.Склады.НайтиПоКоду("STA-61");
	Контрагент=СтрШапка.Контрагент;
	Если Контрагент=Неопределено тогда
		Контрагент=Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;	
	ПунктДоставки=СтрШапка.ПунктДоставки;
	НомЗаказа=СтрШапка.НомЗаказа;
	НомерЗаказа=СтрШапка.НомЗаказа;
	
	
	ДатаЗаказа=СтрШапка.ДатаЗаказа;
	ДатаДоставки=СтрШапка.ДатаДоставки;
	//нечаева 27,11,17++
	ВремяДоставки = СтрШапка.ВремяДоставки;
	//нечаева 27,11,17-- 
	ТипILNКонтрагента=СтрШапка.ТипILNКонтрагента;
	
	ПризКр=0;
	//сообщить("    запись документа");
	Если не Контрагент.Пустая() Тогда 	
		// 1. Обрабатываем количество, делаем округление  соответствуещее коли-ву в блочке
		Если Контрагент.ОткруглятьКоличество Тогда
			
			Для каждого ТекСтрока Из Строки Цикл
				ПризКратности=1;
				Ном=ТекСтрока.Номенклатура;
				КолЗаказано=ТекСтрока.Колво;
				
				Если НЕ ТипЗнч(Ном) = Тип("СправочникСсылка.Номенклатура") Тогда
					ТекСтрока.КолвоОтредактированное=КолЗаказано;
					продолжить;
				КонецЕсли;
				
				ШтукВКор=Ном.Родитель.ШтукВКоробочке;
				Если ШтукВКор-0>0 Тогда 
					// проверяем на кратность 5 или 6
					Если (ШтукВКор/5)=Цел((ШтукВКор/5)) Тогда
						ПризКратности=5
					ИначеЕсли (ШтукВКор/6)=Цел((ШтукВКор/6)) Тогда
						ПризКратности=6
					Иначе
						ПризКратности=1;
					КонецЕсли;
					
					Если (КолЗаказано/ПризКратности)<>Цел((КолЗаказано/ПризКратности)) Тогда
						КолУпак=Цел(Окр(КолЗаказано/ПризКратности,0,0));
						НовКолво=КолУпак*ПризКратности;
						ТекСтрока.КолвоОтредактированное=НовКолво;
					Иначе
						ТекСтрока.КолвоОтредактированное=КолЗаказано;
					Конецесли;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для каждого ТекСтрока Из Строки Цикл
				Если ТекСтрока.Единица<>"Блочок" Тогда
					КолЗаказано=ТекСтрока.Колво;
					ТекСтрока.КолвоОтредактированное=КолЗаказано;
				Иначе
					Попытка
						КолЗаказано=ТекСтрока.Колво*ТекСтрока.ВУпак;
						ТекСтрока.КолвоОтредактированное=КолЗаказано;
					исключение
						КолЗаказано=ТекСтрока.Колво;
						ТекСтрока.КолвоОтредактированное=КолЗаказано;
					КонецПопытки;	
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		// 2. проверяем дублированный заказ есть или нет. в пределах недели;
		Если Контрагент.ПроверятьНаличиеЗаказа Тогда
			
			Дата1=ТекущаяДата();
			Дата2=ТекущаяДата() - 60 * 60 * 24 * 7; // неделя назад;
			
			Запрос=новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	РасходнаяНакладная.Номер,
			|	РасходнаяНакладная.Дата,
			|	РасходнаяНакладная.Ссылка
			|ИЗ
			|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
			|ГДЕ
			|	РасходнаяНакладная.Контрагент = &Контрагент
			|	И РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
			|	И РасходнаяНакладная.Дата МЕЖДУ НачалоПериода(&Дата2) И КонецПериода(&Дата1)";
			
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("ПунктДоставки",ПунктДоставки);
			Запрос.УстановитьПараметр("Дата1",Дата1);
			Запрос.УстановитьПараметр("Дата2",Дата2);
			
			Рез=Запрос.Выполнить().Выбрать();
			
			// добавляем в сообщения менеджерам
			Пока Рез.Следующий() Цикл
				Строка="Для заказа ЕКОДЕ № "+НомЗаказа+" существует копия заказа РНК №"+Рез.Номер+" от "+Рез.Дата;
				Ошибки.Добавить(Строка);
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	// 3. разбивка по складам, создаем несколько документов. 
	// выбираем различные склады, и в цикла по кадому выбираем номеклатуру и создаем документы;
	
	// загрузка ТЗ в запрос
	//--------------------------------------------
	ТЗСклады=Строки;
	
	// создается для временной таблицы
	ТЗ  = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТЗ.Колонки.Добавить("Найдена", Новый ОписаниеТипов("Число"));
	
	Запрос = Новый Запрос;
	ДанныеСкладов=Неопределено;
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст  = "ВЫБРАТЬ различные
	|    ТЗ.Склад как Склад,
	|    ТЗ.Найдена
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|    &ТЗ КАК ТЗ";
	
	Запрос.УстановитьПараметр("ТЗ", ТзСклады);
	Запрос.Выполнить();
	
	Запрос.Текст="ВЫБРАТЬ
	|	ТЗ.Склад КАК Склад,
	|	ТЗ.Найдена
	|ИЗ
	|	ТЗ КАК ТЗ
	|ГДЕ
	|	ТЗ.Найдена = 1";
	РезультатСклады=Запрос.Выполнить().Выбрать();
	
	Если РезультатСклады.Количество()=0 Тогда
		// пустой документ! не формируем ?
		//Катаев+ 08/04/13 Для филиалов склад берем по умолчанию
		//Склад=Справочники.Склады.НайтиПоКоду("STA-61");
		Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
			Склад=Справочники.Склады.НайтиПоКоду("STA-61");
		Иначе
			Склад = ПолучитьЗначениеПоУмолчанию("ОсновнойСклад",Справочники.Пользователи.НастройкиПоУмолчанию);
		КонецЕсли;
		//Катаев- 08/04/13
		
		// Катаев+ 21/03/13 Создавать новый документ надо только для оригинала
		//ДокОбъект=Документы.РасходнаяНакладная.СоздатьДокумент();
		//ДокОбъект = ПолучитьНакладную(Склад, Шапка.НомЗаказа, Шапка.ДатаЗаказа, Шапка.ТипЗаказа);
		ДокОбъект = ПолучитьНакладную(Склад, Шапка[0].НомЗаказа, Шапка[0].ДатаЗаказа, Шапка[0].ТипЗаказа);
		Если ДокОбъект = Неопределено Тогда
			Возврат;
		КонецЕсли;
		// Катаев- 21/03/13
		//-----------------------------------------------------------------------------------------
		//    автозаполнение параметров шапки документа, разница в шапке - в складе отгрузки
		//-----------------------------------------------------------------------------------------
		Если не Контрагент.Пустая() Тогда 	
			//------------------------------------------
			//Организация=Справочники.Организации.НайтиПоКоду("SSP-12"); //КБ- Стиль
			//нечаева18,07,17++
			Организация=Справочники.Организации.НайтиПоКоду("SS-001"); 
			//нечаева18,07,17--
			
			ТипЦен=Контрагент.ТипЦен;
			Договор=Контрагент.ОсновнойДоговор;
			
			//нечаева 24,10,17++ для дикси мегамарт два договора прописали по коду
			Если контрагент.код = "SSP-3687" ТОгда
				Договор = справочники.Договоры.НайтиПоКоду("SNL-022280");
			КонецЕсли;
			//нечаева 24,10,17*--
			
			
			Если не (Договор=Неопределено) и не (Договор=справочники.Договоры.ПустаяСсылка()) Тогда
				//ТипЦен		=Договор.ТипЦен;
				ОтсрочкаПлатежа =Договор.ОтсрочкаПлатежа;
				Если ЗначениеЗаполнено(Договор.Организация) Тогда
					Организация=Договор.Организация;		
				КонецЕсли;
			КонецЕсли;
			//Катаев+ 30/05/13 Для Перекрестка отгрузка может быть и через ГалантТрейд
			Если Контрагент.Код = "SSP-3674" Тогда
				Если СтрШапка.Организация = "4607814849991" Тогда
					Организация = Справочники.Организации.НайтиПоКоду("SNL-48");
					Договор = Справочники.Договоры.НайтиПоКоду("SMN-1143");
				КонецЕсли;
			КонецЕсли;
			//Катаев- 30/05/13
			//----  доп. обработка;
			ДокОбъект.ДопОбработки.Очистить();
			Для Каждого СтрокаТЧ Из Контрагент.ВидыДопОбработок Цикл
				СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
			КонецЦикла; 
			//нечаева 23,03,17+++
			// добавляем из пункта доставки доп. обработки.
			Попытка
				Для Каждого СтрокаТЧ Из ПунктДоставки.ВидыДопОбработок Цикл
					СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
				КонецЦикла;  
			Исключение
			КонецПопытки;
			//нечаева 23,03,17---
			//Нечаева 12,09,18+++
			// для х5 промо доп обработка
			Если  СтрШапка.Промо = 1  Тогда
				СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки = справочники.ВидыДопОбработки.НайтиПоКоду("OD7-00129");
			КонецЕсли;
			//Нечаева 12,09,18---
			
			
			
			
			//нечаева18,07,17++
			Если контрагент.код = "SSP-3687" ТОгда
				Договор = справочники.Договоры.НайтиПоКоду("SNL-022280");
			КонецЕсли;
			//нечаева18,07,17*--
			
			//-----------------------------------------------
			Менеджер=Контрагент.Менеджер;
			Если Менеджер=Неопределено или Менеджер=Справочники.ФизическиеЛица.ПустаяСсылка() и ПризКр=0 Тогда
				КритичОшибки.Добавить("Для контрагента "+контрагент.наименование+"  код - "+контрагент.код+"  не определен менеджер! Заказ екоде №"+ Номерзаказа );
			Иначе
				Если Не СтрДлина(Менеджер.Емэйл)>2  и ПризКр=0   Тогда
					КритичОшибки.Добавить("Для менеджера "+Менеджер.наименование+"  код - "+Менеджер.код+"  не определен ЕМэйл!" );
				КонецЕсли;
			КонецЕсли;
			//++Данилова Е.В. 30.09.2025 HELP-7048
			//Подразделение = Контрагент.Менеджер.Подразделение;
			Подразделение = ЗаполнениеДокументов.ПодразделениеПродажПоМенеджеру(Контрагент.Менеджер);
			//--Данилова Е.В. 30.09.2025
			
			//------------------------
			// код поставщика
			//------------------------
			КодПоставщикаКонтрагента=Контрагент.КодПоставщика;
			Если КодПоставщикаконтрагента.пустая() ИЛИ кодПоставщикаКонтрагента=Неопределено Тогда
				// Берем первую из справочника коды контрагентов
				Запрос=Новый Запрос;
				Запрос.Текст="ВЫБРАТЬ
				|	КодыПоставщиков.Ссылка
				|ИЗ
				|	Справочник.КодыПоставщиков КАК КодыПоставщиков
				|ГДЕ
				|	КодыПоставщиков.Владелец = &Контрагент
				|	И (КодыПоставщиков.Организация = &ТекОрганизация
				|			ИЛИ КодыПоставщиков.Организация = &Контр2)";
				Запрос.УстановитьПараметр("Контрагент",Контрагент);		
				Запрос.УстановитьПараметр("Контр2",Справочники.Контрагенты.ПустаяСсылка());		
				Запрос.УстановитьПараметр("ТекОрганизация",Организация);		
				Результат=Запрос.Выполнить().Выбрать();
				// катаев+ 28/02/13 Исправление ошибки
				//Пока Результат.Следующий() Цикл
				//	КодПоставщикаКонтрагента=Результат.ссылка;
				//	возврат;
				//КонецЦикла;
				Если Результат.Следующий() Тогда
					КодПоставщикаКонтрагента=Результат.ссылка;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		//----------------------------------------------
		//доставка
		Если не ПунктДоставки=Неопределено  Тогда 
			Если ЗначениеЗаполнено(ПунктДоставки.РайонДоставки) Тогда
				РайонДоставки=ПунктДоставки.РайонДоставки;	
				ДокОбъект.РайонДоставки=РайонДоставки;
			КонецЕсли;	
			Если ЗначениеЗаполнено(ПунктДоставки.Регион) Тогда
				Регион=ПунктДоставки.Регион;
				ДокОбъект.Регион=Регион;
			КонецЕсли;	
			//Катаев+ 10/04/14 Транспортная компания заполняется только если выбран тип доставки = "ТранспортнаяКомпания"
			//Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
			//	ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
			//	ДокОбъект.ТранспортнаяКомпания=ТранспортнаяКомпания;
			//КонецЕсли;	
			//Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
			//	ПунктПерегруза=ПунктДоставки.ПунктПерегруза;	
			//	ДокОбъект.ПунктПерегруза=ПунктПерегруза;
			//КонецЕсли;		
			Если ПунктДоставки.ТипДоставки = Перечисления.ТипыДоставки.ТранспортнаяКомпания Тогда
				Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
					ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
					ДокОбъект.ТранспортнаяКомпания=ТранспортнаяКомпания;
				КонецЕсли;
				Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
					ПунктПерегруза=ПунктДоставки.ПунктПерегруза;	
					ДокОбъект.ПунктПерегруза=ПунктПерегруза;
				КонецЕсли;		
			КонецЕсли;
			//Катаев- 10/04/14
			Если ЗначениеЗаполнено(ПунктДоставки.Грузополучатель) Тогда
				Грузополучатель=ПунктДоставки.Грузополучатель;		
				ДокОбъект.Грузополучатель=Грузополучатель;
			КонецЕсли;
			Если ЗначениеЗаполнено(ПунктДоставки.Получатель) Тогда
				Получатель=ПунктДоставки.Получатель;		
				ДокОбъект.Получатель=Получатель;
			КонецЕсли;
			Если ЗначениеЗаполнено(ПунктДоставки.ОтсрочкаПлатежа) Тогда
				ОтсрочкаПлатежа=ПунктДоставки.ОтсрочкаПлатежа;		
				ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;
			КонецЕсли;
			
			//типы цен скидки
			Если ЗначениеЗаполнено(ПунктДоставки.ТипЦен) И ТипЦен<>ПунктДоставки.ТипЦен Тогда
				ТипЦен=ПунктДоставки.ТипЦен;		
			КонецЕсли; 
			Если ЗначениеЗаполнено(ПунктДоставки.ТипСкидок) И ДокОбъект.ТипСкидок<>ПунктДоставки.ТипСкидок Тогда
				ТипСкидок=ПунктДоставки.ТипСкидок;		
			КонецЕсли;
			Если ПунктДоставки.Скидка<>0 И ПунктДоставки.Скидка<>ДокОбъект.Скидка Тогда
				Скидка=ПунктДоставки.Скидка;		
				ДокОбъект.Скидка=Скидка;
			КонецЕсли;
		КонецЕсли;
		//-------------------------------------------------------------------		
		
		ДокОбъект.Дата=ТекущаяДата();
		ЗаполнитьШапкуДокумента(ДокОбъект, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
		//УстановитьНомерДокумента2(ДокОбъект);
		ДокОбъект.Контрагент=Контрагент;
		ДокОбъект.Организация=Организация;
		ДокОбъект.Договор=Договор;
		ДокОбъект.ИБ=Справочники.ИБ.НайтиПоКоду("SSP");
		ДокОбъект.Менеджер= Менеджер;
		ДокОбъект.НомерЗаказа= УбратьНули(НомЗаказа,Контрагент.УбиратьНулиПередНомеромЗаказа);
		
		
		ДокОбъект.КодПоставщика=КодПоставщикаКонтрагента;
		
		ДокОбъект.Регион = Регион;
		ТипШК=перечисления.ТипыШтрихКодов.Штука;
		
		ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;		
		ДокОбъект.ТипЦен=ТипЦен; //Контрагент.ТипЦен;
		ДокОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН;
		ДокОбъект.Подразделение = Подразделение;
		ДокОбъект.ЛевыйКонтрагент=Контрагент;
		ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
		ДокОбъект.Отгружен=перечисления.Отгружен.Резерв;
		ДокОбъект.ПунктДоставки=ПунктДоставки;
		ДокОбъект.Склад=Склад;		
		УстановитьНомерДокумента2(ДокОбъект);
		ДокОбъект.Валюта=Справочники.Валюты.НайтиПоКоду("810");
		//ДокОбъект.Автор				=Неопределено;
		// для х5 промо 
		Если  СтрШапка.Промо = 1  Тогда
			ДокОбъект.Комментарий =  "ПРОМО"+ДокОбъект.комментарий;
		КонецЕсли;
		//Нечаева 12,09,18---
		
		
		//нечаева 13,01,15+++
		Попытка
			ДокОбъект.ДатаЗаказа=Дата(СтрЗаменить(ДатаЗаказа, "-", ""));
			
			ДатаИзЗог = Дата(1,1,1);
			Если Контрагент.Код = "SSP-5862" Тогда // только для окея
				
				ДокОбъект.датаПриемки=Дата(СтрЗаменить(ДатаДоставки, "-", ""));
				// расчитаем от даты авизации.
				// в обратную сторону
				Если ДокОбъект.ПунктДоставки.ДнейВпути>0 и ЗначениеЗаполнено(ДокОбъект.ДатаПриемки) тогда 		
					ДатаИзЗог= ДокОбъект.ДатаПриемки-ДокОбъект.ПунктДоставки.ДнейВпути*24*3600;
					Сдвиг=ПолучитьСдвигДатыАвизации(ДокОбъект);   // если выходные
					ДатаИзЗог=ДатаИзЗог-сдвиг;
				Иначе 
					ДатаИзЗог = Дата(СтрЗаменить(ДатаДоставки, "-", ""));
					ДокОбъект.датаПриемки = '00010101';
				КонецЕсли;
				
				ДокОбъект.ДатаОтгрузки =ДатаИзЗог;
				
			Иначе
				ДокОбъект.ДатаОтгрузки=Дата(СтрЗаменить(ДатаДоставки, "-", ""));
			КонецЕсли;
			
		Исключение
		КонецПопытки;
		//нечаева 13,01,15---
		
		
		
		Если СокрЛП(Контрагент.Код)=КодМетро И (Лев(ДокОбъект.Номер,3)<>"SSP" или Лев(ДокОбъект.Номер,3)<>"SST")  Тогда
			УстановитьНомерДокумента2(ДокОбъект);	
		КонецЕсли;
		
		ДокОбъект.КодОперации=Перечисления.КодыОперацийОстатки.Реализация;
		ДокОбъект.ДатаОформления	=ДокОбъект.Дата;
		СкидкаКонтрагента=ПолучитьРеквизитРодителя(Контрагент,"Скидка");
		ДокОбъект.Скидка=СкидкаКонтрагента;
		
		ПересчетТЧ(ДокОбъект,"Товары",ДокОбъект.Валюта,ДокОбъект.Валюта,ДокОбъект.Курс,ДокОбъект.Курс,Истина);	
		// нечаева биллу теперь грузим 20,04,18+++
		//Если Контрагент.КодИЛН<>"9008727000007" Тогда
		Попытка
			ДокОбъект.Записать(режимЗаписиДокумента.Запись);
			Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
			//Сообщить("Записан документ - "+ДокОбъект.Дата+" "+ДокОбъект.Номер);
		Исключение
			// Катаев+ 22/08/13 Если возникла ошибка с уникальностью номера, то пробуем обновить нумерацию объектов и сгенерировать номер заново
			Инфо = ИнформацияОбОшибке();
			Если Найти(Инфо.Описание, "Не уникальный номер документа") > 0 Тогда
				ОбновитьНумерациюОбъектов();
				УстановитьНомерДокумента2(ЭтотОбъект);
				Попытка
					ДокОбъект.Записать(режимЗаписиДокумента.Запись);
					Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
				Исключение
					Если ПризКр=0 тогда
						КритичОшибки.Добавить("После обновления нумерации для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
					конецЕсли;
				КонецПопытки;
			Иначе	
				Если ПризКр=0 тогда
					КритичОшибки.Добавить("Для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
				конецЕсли;
			КонецЕсли;
			// Катаев- 22/08/13
		КонецПопытки;
		//КонецЕсли;
		//сообщить("    документ записан");
		ПризКр=ПризКр+1;
		
	КонецЕсли;
	//-------------------------------------------------------------------------------------------------------------------------------------------
	//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
	// когда складов несколько и есть данные, которые нашлись
	//-------------------------------------------------------------------------------------------------------------------------------------------
	
	КоличествоСкладов=РезультатСклады.Количество();
	//---------------------------------------------------------------------------------
	//                          по циклу смотрим данные
	//-------------------------------------------------------------------------------------
	Пока РезультатСклады.Следующий() цикл
		
		// формируем документ по складу
		//---------------------------------------------------------------------	
		// выбираем строки номенклатуры по складу, заполняем строки
		
		Склад=РезультатСклады.Склад;
		// Катаев+ 21/03/13 Создавать новый документ надо только для оригинала
		//ДокОбъект=Документы.РасходнаяНакладная.СоздатьДокумент();
		//ДокОбъект = ПолучитьНакладную(Склад, Шапка.НомЗаказа, Шапка.ДатаЗаказа, Шапка.ТипЗаказа);
		ДокОбъект = ПолучитьНакладную(Склад, Шапка[0].НомЗаказа, Шапка[0].ДатаЗаказа, Шапка[0].ТипЗаказа);
		Если ДокОбъект = Неопределено Тогда
			Возврат;
		КонецЕсли;
		// Катаев- 21/03/13
		//----------------------------------------------------------------------
		
		ТЗ2  = Новый ТаблицаЗначений;
		ТЗ2.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
		ТЗ2.Колонки.Добавить("Найдена", Новый ОписаниеТипов("Число"));
		ТЗ2.Колонки.Добавить("КолвоОтредактированное",Новый ОписаниеТипов("Число"));
		ТЗ2.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		
		Запрос = Новый Запрос;
		ДанныеСкладов=Неопределено;
		МВТ = Новый МенеджерВременныхТаблиц;
		Запрос.МенеджерВременныхТаблиц = МВТ;
		Запрос.Текст  = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗ2.Склад КАК Склад,
		|	ТЗ2.Номенклатура, 
		|	ТЗ2.КолвоОтредактированное,
		|	ТЗ2.Найдена,
		|	ТЗ2.НомерСтроки
		|ПОМЕСТИТЬ ТЗ2
		|ИЗ
		|	&ТЗ2 КАК ТЗ2
		|ГДЕ
		|	ТЗ2.Склад = &ТекСклад
		|	И ТЗ2.Найдена = 1";
		Запрос.УстановитьПараметр("ТекСклад",Склад);
		Запрос.УстановитьПараметр("ТЗ2", ТзСклады);
		Запрос.Выполнить();
		
		Запрос.Текст="ВЫБРАТЬ
		|	ТЗ2.Склад КАК Склад,
		|	ТЗ2.Номенклатура,
		|	ТЗ2.КолвоОтредактированное,
		|	ТЗ2.Найдена,
		|	ТЗ2.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ТЗ2 КАК ТЗ2
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		РезНом=Запрос.Выполнить().Выбрать();
		
		// ------------------------------------------------------------------------------------------------
		Пока РезНом.Следующий() Цикл
			строкатовара = 	ДокОбъект.Товары.Добавить();
			строкатовара.Номенклатура =РезНом.Номенклатура;
			строкатовара.Заявка = РезНом.КолвоОтредактированное;
			строкатовара.Количество = РезНом.КолвоОтредактированное;
			строкатовара.ПодтвержденнаяЗаявка = РезНом.КолвоОтредактированное;
			ПриИзмененииНоменклатурыТабЧасти(строкатовара, ДокОбъект);
			РассчитатьСуммуТабЧасти(строкатовара, ДокОбъект);
		КонецЦикла;
		
		//-----------------------------------------------------------------------------------------
		//    автозаполнение параметров шапки документа, разница в шапке - в складе отгрузки
		//-----------------------------------------------------------------------------------------
		
		Если не Контрагент.Пустая() Тогда 	
			//------------------------------------------
			//Организация=Справочники.Организации.НайтиПоКоду("SSP-12"); //КБ- Стиль
			
			//нечаева18,07,17++
			Организация=Справочники.Организации.НайтиПоКоду("SS-001"); 
			//нечаева18,07,17--
			
			
			ТипЦен=Контрагент.ТипЦен;
			Договор=Контрагент.ОсновнойДоговор;
			
			//нечаева 24,10,17++ для дикси мегамарт два договора прописали по коду
			Если контрагент.код = "SSP-3687" ТОгда
				Договор = справочники.Договоры.НайтиПоКоду("SNL-022280");
			КонецЕсли;
			//нечаева 24,10,17*--
			
			
			
			Если не (Договор=Неопределено) и не (Договор=справочники.Договоры.ПустаяСсылка()) Тогда
				//ТипЦен		=Договор.ТипЦен;
				ОтсрочкаПлатежа =Договор.ОтсрочкаПлатежа;
				Если ЗначениеЗаполнено(Договор.Организация) Тогда
					Организация=Договор.Организация;		
				КонецЕсли;
			КонецЕсли;
			//
			////нечаева18,07,17++
			//Если контрагент.код = "SSP-3687" ТОгда
			//	Договор = справочники.Договоры.НайтиПоКоду("SNL-022280");
			//КонецЕсли;
			////нечаева18,07,17*--
			
			
			//-----------------  доп. обработка   --------------------------------------------------------
			ДокОбъект.ДопОбработки.Очистить();
			
			Для Каждого СтрокаТЧ Из Контрагент.ВидыДопОбработок Цикл
				
				Если СокрЛП(Контрагент.Код)="SSP-8643"  или СокрЛП(Контрагент.Код)="SSP-2412"  Тогда  
					// для метро и реал  делаем спец. обработку. 
					
					//Если КоличествоСкладов>1 И (Склад.код="SNL-79" или Склад.код="SNL-22") Тогда     
					//нечаева поменяла склад 22,01,15++
					Если КоличествоСкладов>1 И (Склад.код="STA-20" или Склад.код="STA-10") Тогда     
						//нечаева поменяла склад 22,01,15++
						// если склад белье, то одну доп обработку не берем.
						Если СтрокаТЧ.ДопОбработка.Код="ODB-00017" Тогда
							продолжить; // не пишем эту доп обработку.   палетный ярлык не пишем
						КонецЕсли;
					КонецЕсли;
					
					//Катаев+ 11/07/13
					//СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					//СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка; // остальные стандартные добавляем
					//Катаев- 11/07/13
					
				КонецЕсли;
				//Катаев+ 11/07/13
				СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка; // остальные стандартные добавляем
				//Катаев- 11/07/13
				
			КонецЦикла; 
			//нечаева 23,03,17+++
			// добавляем из пункта доставки доп. обработки.
			попытка
				Для Каждого СтрокаТЧ Из ПунктДоставки.ВидыДопОбработок Цикл
					СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
				КонецЦикла;  
			исключение
			конецПопытки;
			//нечаева 23,03,17---
			
			
			//нечаева поменяла склад 22,01,15++
			Если СокрЛП(Контрагент.Код)="SSP-2412" И (Склад.код="STA-20" или Склад.код="STA-10") Тогда     
				//нечаева поменяла склад 22,01,15++
				
				// реал
				СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("ODB-00018"); // интри
				попытка
					СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("SNL-00031"); // белье на вешалках реал
				исключение
				конецпопытки;
				
			КонецЕсли;
			
			// бельевой склад
			//Если СокрЛП(Контрагент.Код)="SSP-8643" И (Склад.код="SNL-79" или Склад.код="SNL-22") Тогда 
			//нечаева поменяла склад 22,01,15++
			Если СокрЛП(Контрагент.Код)="SSP-8643" И (Склад.код="STA-20" или Склад.код="STA-10") Тогда     
				//нечаева поменяла склад 22,01,15++
				
				
				// метро 
				попытка
					СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					//Кухарь 28.06.17 начало
					//Теперь другая ДО
					//СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("SNL-00036"); // белье на вешалках метро	
					СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("OD7-00115"); // белье на вешалках метро
					//Кухарь 28.06.17 конец
					
				исключение
				конецпопытки;
			КонецЕсли;
			
			// когда колготочный склад
			Если СокрЛП(Контрагент.Код)="SSP-8643" И (Склад.код="STA-61" или Склад.код="SNL-82") Тогда 
				// метро 
				попытка
					СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
					//Кухарь 28.06.17 начало
					//Теперь другая ДО
					//СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("ODN-00014");  // антикражка + поставщик 	
					СтрокаДО.ВидДопОбработки=Справочники.ВидыДопОбработки.НайтиПоКоду("OD7-00101");  // антикражка + поставщик 
					//Кухарь 28.06.17 конец
					
				исключение
				конецпопытки;
			КонецЕсли;
			
			//Нечаева 12,09,18+++
			// для х5 промо доп обработка
			Если  СтрШапка.Промо = 1  Тогда
				СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
				СтрокаДО.ВидДопОбработки = справочники.ВидыДопОбработки.НайтиПоКоду("OD7-00129");
			КонецЕсли;
			//Нечаева 12,09,18---
			
			
			
			
			//-------------------------------------------------------------------------------------------
			Менеджер=Контрагент.Менеджер;
			Если Менеджер=Неопределено или Менеджер=Справочники.ФизическиеЛица.ПустаяСсылка() и ПризКр=0 Тогда
				КритичОшибки.Добавить("Для контрагента "+контрагент.наименование+"  код - "+контрагент.код+"  не определен менеджер! Заказ екоде №"+ Номерзаказа );
			Иначе
				Если Не СтрДлина(Менеджер.Емэйл)>2  и ПризКр=0   Тогда
					КритичОшибки.Добавить("Для менеджера "+Менеджер.наименование+"  код - "+Менеджер.код+"  не определен ЕМэйл!" );
				КонецЕсли;
			КонецЕсли;
			//++Данилова Е.В. 30.09.2025 HELP-7048
			//Подразделение = Контрагент.Менеджер.Подразделение;
			Подразделение = ЗаполнениеДокументов.ПодразделениеПродажПоМенеджеру(Контрагент.Менеджер);
			//--Данилова Е.В. 30.09.2025
			//------------------------
			// код поставщика
			//------------------------
			КодПоставщикаКонтрагента=Контрагент.КодПоставщика;
			Если КодПоставщикаконтрагента.пустая() ИЛИ кодПоставщикаКонтрагента=Неопределено Тогда
				// Берем первую из справочника коды контрагентов
				Запрос=Новый Запрос;
				Запрос.Текст="ВЫБРАТЬ
				|	КодыПоставщиков.Ссылка
				|ИЗ
				|	Справочник.КодыПоставщиков КАК КодыПоставщиков
				|ГДЕ
				|	КодыПоставщиков.Владелец = &Контрагент
				|	И (КодыПоставщиков.Организация = &ТекОрганизация
				|			ИЛИ КодыПоставщиков.Организация = &Контр2)";
				Запрос.УстановитьПараметр("Контрагент",Контрагент);		
				Запрос.УстановитьПараметр("Контр2",Справочники.Контрагенты.ПустаяСсылка());		
				Запрос.УстановитьПараметр("ТекОрганизация",Организация);		
				Результат=Запрос.Выполнить().Выбрать();
				// катаев+ 28/02/13 Исправление ошибки
				//Пока Результат.Следующий() Цикл
				//	КодПоставщикаКонтрагента=Результат.ссылка;
				//	возврат;
				//КонецЦикла;
				Если Результат.Следующий() Тогда
					КодПоставщикаКонтрагента=Результат.ссылка;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		//----------------------------------------------
		//доставка
		Если не ПунктДоставки=Неопределено  Тогда 
			Если ЗначениеЗаполнено(ПунктДоставки.РайонДоставки) Тогда
				РайонДоставки=ПунктДоставки.РайонДоставки;	
				ДокОбъект.РайонДоставки=РайонДоставки;
			КонецЕсли;	
			Если ЗначениеЗаполнено(ПунктДоставки.Регион) Тогда
				Регион=ПунктДоставки.Регион;
				ДокОбъект.Регион=Регион;
			КонецЕсли;	
			
			Если ПунктДоставки.ТипДоставки = Перечисления.ТипыДоставки.ТранспортнаяКомпания Тогда
				Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
					ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
					ДокОбъект.ТранспортнаяКомпания=ТранспортнаяКомпания;
				КонецЕсли;
				Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
					ПунктПерегруза=ПунктДоставки.ПунктПерегруза;	
					ДокОбъект.ПунктПерегруза=ПунктПерегруза;
				КонецЕсли;		
			КонецЕсли;
			//Катаев- 10/04/14
			Если ЗначениеЗаполнено(ПунктДоставки.Грузополучатель) Тогда
				Грузополучатель=ПунктДоставки.Грузополучатель;		
				ДокОбъект.Грузополучатель=Грузополучатель;
			КонецЕсли;
			Если ЗначениеЗаполнено(ПунктДоставки.Получатель) Тогда
				Получатель=ПунктДоставки.Получатель;		
				ДокОбъект.Получатель=Получатель;
			КонецЕсли;
			Если ЗначениеЗаполнено(ПунктДоставки.ОтсрочкаПлатежа) Тогда
				ОтсрочкаПлатежа=ПунктДоставки.ОтсрочкаПлатежа;		
				ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;
			КонецЕсли;
			
			//типы цен скидки
			Если ЗначениеЗаполнено(ПунктДоставки.ТипЦен) И ТипЦен<>ПунктДоставки.ТипЦен Тогда
				ТипЦен=ПунктДоставки.ТипЦен;		
			КонецЕсли; 
			Если ЗначениеЗаполнено(ПунктДоставки.ТипСкидок) И ДокОбъект.ТипСкидок<>ПунктДоставки.ТипСкидок Тогда
				ТипСкидок=ПунктДоставки.ТипСкидок;		
			КонецЕсли;
			Если ПунктДоставки.Скидка<>0 И ПунктДоставки.Скидка<>ДокОбъект.Скидка Тогда
				Скидка=ПунктДоставки.Скидка;		
				ДокОбъект.Скидка=Скидка;
			КонецЕсли;
		КонецЕсли;
		//-------------------------------------------------------------------		
		
		ДокОбъект.Дата=ТекущаяДата();
		ЗаполнитьШапкуДокумента(ДокОбъект, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
		//УстановитьНомерДокумента2(ДокОбъект);
		ДокОбъект.Контрагент=Контрагент;
		ДокОбъект.Организация=Организация;
		ДокОбъект.Договор=Договор;
		ДокОбъект.ИБ=Справочники.ИБ.НайтиПоКоду("SSP");
		ДокОбъект.Менеджер= Менеджер;
		ДокОбъект.НомерЗаказа= УбратьНули(НомерЗаказа,Контрагент.УбиратьНулиПередНомеромЗаказа);
		// для х5 промо 
		Если  СтрШапка.Промо = 1  Тогда
			ДокОбъект.Комментарий =  "ПРОМО"+ДокОбъект.комментарий;
		КонецЕсли;
		//Нечаева 12,09,18---
		
		
		Попытка
			ДокОбъект.ДатаЗаказа=Дата(СтрЗаменить(ДатаЗаказа, "-", ""));
			ДокОбъект.ДатаОтгрузки=Дата(СтрЗаменить(ДатаДоставки, "-", ""));
		Исключение
		КонецПопытки;
		
		
		//нечаева 27,11,17+++
		Попытка
			//14,05,20 нечаева
			ПервыйЗнак = Лев(ВремяДоставки,1); // если 09:00, то ищем " 9:00"
			Если ПЕрвыйЗнак = "0" ТОгда    
				ВремяДоставки =" "+Сред(СтрШапка.ВремяДоставки,2,СтрДлина(СтрШапка.ВремяДоставки)-1) ;
			КонецЕсли;	
			//14-05-20 нечаева
			
			
			
			ДокОбъект.ВремяПриемки = Справочники.ВремяПриемки.НайтиПоНаименованию(""+ВремяДоставки+":00-"+ВремяДоставки+":00");
			
			// только после сохранения докмуента возможно.
			//
			//ЗаписьВРег=РегистрыСведений.РеквизитыДокументов.СоздатьМенеджерЗаписи();
			//ЗаписьВРег.Документ=Документ.Ссылка;
			//ЗаписьВРег.ИмяРеквизита="ВремяПриемкиДляЗОГ";
			//ЗаписьВРег.Период=Документ.Ссылка.Дата;
			//ЗаписьВРег.ЗначениеРеквизита=ВремяПриемки;
			//ЗаписьВРег.Записать();
			
		Исключение
		КонецПопытки;
		//нечаева 27,11,17---
		
		
		ДокОбъект.КодПоставщика=КодПоставщикаКонтрагента;
		
		ДокОбъект.Регион = Регион;
		ТипШК=перечисления.ТипыШтрихКодов.Штука;
		
		ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;		
		ДокОбъект.ТипЦен=ТипЦен; //Контрагент.ТипЦен;
		ДокОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН;
		ДокОбъект.Подразделение = Подразделение;
		ДокОбъект.ЛевыйКонтрагент=Контрагент;
		ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
		ДокОбъект.Отгружен=перечисления.Отгружен.Резерв;
		ДокОбъект.ПунктДоставки=ПунктДоставки;
		ДокОбъект.Склад=Склад;		
		УстановитьНомерДокумента2(ДокОбъект);
		ДокОбъект.Валюта=Справочники.Валюты.НайтиПоКоду("810");
		ДокОбъект.Автор	=Неопределено;
		
		Если СокрЛП(Контрагент.Код)=КодМетро И (Лев(ДокОбъект.Номер,3)<>"SSP" или Лев(ДокОбъект.Номер,3)<>"SST") Тогда
			УстановитьНомерДокумента2(ДокОбъект);	
		КонецЕсли;
		
		ДокОбъект.КодОперации=Перечисления.КодыОперацийОстатки.Реализация;
		ДокОбъект.ДатаОформления	=ДокОбъект.Дата;
		СкидкаКонтрагента=ПолучитьРеквизитРодителя(Контрагент,"Скидка");
		ДокОбъект.Скидка=СкидкаКонтрагента;
		
		//Валетов + 30.06.2026 Изменение 0000000060
		//ДокОбъект.ДатаОплаты	    =ПолучитьДатуОплаты1(ДокОбъект.ДатаОтгрузки,ДокОбъект.ОтсрочкаПлатежа);	
		ПараметрыРасчетаДатыОплаты  = ОбщегоНазначенияКС.ПолучитьЗаполнитьПараметрыРасчетаДатыОплатыПоДокументу(ДокОбъект);
		ДокОбъект.ДатаОплаты 		= ОбщегоНазначенияКС.ПолучитьДатуОплатыПоДокументуКлиентСервер(ПараметрыРасчетаДатыОплаты); 
		//Валетов-	
		
		ПересчетТЧ(ДокОбъект,"Товары",ДокОбъект.Валюта,ДокОбъект.Валюта,ДокОбъект.Курс,ДокОбъект.Курс,Истина);
		
		//проверим на пустые цены!!
		//нечаева 15,03,16+++
		
		ОтборНулевыеЦены=новый Структура("Цена",0);
		МассивНулевыхЦен=ДокОбъект.Товары.НайтиСтроки(ОтборНулевыеЦены);
		
		
		Для каждого текстрока из МассивНулевыхЦен цикл
			
			Отбор2=новый Структура("номенклатура",ТекСтрока.номенклатура);
			тстрока=ДокОбъект.Товары.НайтиСтроки(Отбор2);
			Ошибки.Добавить("Для товара -  "+ТекСтрока.номенклатура +" Цена =0, не записано в заказе, проверьте матрицу! " );
			ТекНом =тстрока[0].НомерСтроки; //.удалить()
			докобъект.товары.Удалить(ТекНом-1);
			
		КонецЦикла;
		//нечаева 15,03,16---
		
		
		//нечева 20,04,18+++ биллу теперь грузим
		//Если Контрагент.КодИЛН<>"9008727000007" Тогда
		Попытка
			ДокОбъект.Записать(режимЗаписиДокумента.Запись);
			//Катаев+ 31/10/13 В регистр сведений заносим GLN  конечного пункта (Лента)
			
			
			//Для Х5 куча реквизитов
			//нечаева 17,09,18+++
			Попытка
				
				НоваяЗаписьТек = РегистрыСведений.ЗначенияСвойствОбъектовУПД.СоздатьМенеджерЗаписи();
				НоваяЗаписьТек.Объект   = ДокОбъект.Ссылка;
				НоваяЗаписьТек.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию(СокрЛП("EDI_КонтактыЛогистов")); 
				НоваяЗаписьТек.Значение = ""+СтрШапка.ИмяЛогиста+" / "+СтрШапка.АдресЛогиста;
				НоваяЗаписьТек.Записать();
				
			Исключение
			КонецПопытки;
			
			
			
			Попытка
				Если СокрЛП(СтрШапка.ОкнаДоставки)<>"" Тогда
					НоваяЗаписьТек = РегистрыСведений.ЗначенияСвойствОбъектовУПД.СоздатьМенеджерЗаписи();
					НоваяЗаписьТек.Объект   = ДокОбъект.Ссылка;
					НоваяЗаписьТек.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию(СокрЛП("EDI_ОкнаДоставки")); 
					НоваяЗаписьТек.Значение = ""+СтрШапка.ОкнаДоставки;
					НоваяЗаписьТек.Записать();
				КонецЕсли;
				
			Исключение
			КонецПопытки;
			//нечаева 17,09,18---
			
			
			
			//нечаева 27,11,17+++   только для Окея
			Если ДокОбъект.контрагент.код = "SSP-5862" Тогда
				Попытка
					//	ДокОбъект.ВремяПриемки = Справочники.ВремяПриемки.НайтиПоНаименованию(""+ВремяДоставки+":00-"+ВремяДоставки+":00");
					//14,05,20 нечаева
					ПервыйЗнак = Лев(СтрШапка.ВремяДоставки,1); // если 09:00, то ищем " 9:00"
					Если ПЕрвыйЗнак = "0" ТОгда    
						ВремяДоставки =" "+Сред(СтрШапка.ВремяДоставки,2,СтрДлина(СтрШапка.ВремяДоставки)-1) ;
					КонецЕсли;	
					//14-05-20 нечаева
					
					// только после сохранения докмуента возможно.
					//
					ЗаписьВРег=РегистрыСведений.РеквизитыДокументов.СоздатьМенеджерЗаписи();
					ЗаписьВРег.Документ=ДокОбъект.Ссылка;
					ЗаписьВРег.ИмяРеквизита="ВремяПриемкиДляЗОГ";
					ЗаписьВРег.Период=ДокОбъект.Ссылка.Дата;
					ЗаписьВРег.ЗначениеРеквизита=Справочники.ВремяПриемки.НайтиПоНаименованию(""+ВремяДоставки+":00-"+ВремяДоставки+":00");
					ЗаписьВРег.Записать();
					
				Исключение
				КонецПопытки;
			КонецЕсли;
			//нечаева 27,11,17---
			
			
			//нечаева 02,12,19+++						
			//для виктории балтии
			Если ДокОбъект.Контрагент.Код="SSR-4726"  Тогда
				попытка
					
					НаборЗаписей = РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Документ.Установить(ДокОбъект.Ссылка); 
					НаборЗаписей.Отбор.ИмяРеквизита.Установить("GLN"); 
					НаборЗаписей.Очистить();;
					НаборЗаписей.Записать();
					
				исключение
				конецПопытки;
				
				попытка
					рег = регистрыСведений.РеквизитыРНКПНКПРМ;
					Элемент = Рег.СоздатьМенеджерЗаписи();
					Элемент.Документ = ДокОбъект.ссылка;
					Элемент.ИмяРеквизита = "GLN";
					Элемент.ЗначениеРеквизита = СтрШапка.ИЛНПлательщика;
					Элемент.Записать();
				исключение
				конецПопытки;
				
			КонецЕсли;
			//нечаева 02,12,19+++		
			
			
			// для атака
			//Нечаева 25,10,17++
			Если ДокОбъект.Контрагент.Код="SSR-6556"  Тогда
				попытка
					
					НаборЗаписей = РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Документ.Установить(ДокОбъект.Ссылка); 
					НаборЗаписей.Отбор.ИмяРеквизита.Установить("GLN"); 
					НаборЗаписей.Очистить();;
					НаборЗаписей.Записать();
					
				исключение
				конецПопытки;
				
				рег = регистрыСведений.РеквизитыРНКПНКПРМ;
				Элемент = Рег.СоздатьМенеджерЗаписи();
				Элемент.Документ = ДокОбъект.ссылка;
				Элемент.ИмяРеквизита = "GLN";
				Элемент.ЗначениеРеквизита = СтрШапка.ИЛНМестаДоставки;
				Элемент.Записать();
				
				
				
				//нечаева 02,11,17+++
				Попытка
					НаборЗаписей = РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Документ.Установить(ДокОбъект.Ссылка); 
					НаборЗаписей.Отбор.ИмяРеквизита.Установить("GLNпокупателя"); 
					НаборЗаписей.Очистить();;
					НаборЗаписей.Записать();
				Исключение
				КонецПопытки;
				
				
				Попытка
					рег = регистрыСведений.РеквизитыРНКПНКПРМ;
					Элемент = Рег.СоздатьМенеджерЗаписи();
					Элемент.Документ = ДокОбъект.ссылка;
					Элемент.ИмяРеквизита = "GLNпокупателя";
					Элемент.ЗначениеРеквизита = СтрШапка.ИЛНПокупателя;
					Элемент.Записать();
				Исключение
				КонецПопытки;
				//нечаева 02,11,17---
				
				
			КонецЕсли;
			//Нечаева 25,10,17--
			
			
			
			// нечаева 23,03,16 +++ если напрямую грузим! не через рц
			Если СтрШапка.ГЛН_Конечный = "" Тогда
				СтрШапка.ГЛН_Конечный = ДокОбъект.ПунктДоставки.КодИЛН;
			КонецЕсли;
			// нечаева 23,03,16 ---	
			
			
			Если СтрШапка.ГЛН_Конечный <> Неопределено Тогда
				//нечаева 13,03,17+++
				
				//было
				//рег = регистрыСведений.РеквизитыРНКПНКПРМ;
				//ВыборкаРег = Рег.Выбрать();
				//Пока ВыборкаРег.Следующий() Цикл
				//	Если ВыборкаРег.ИмяРеквизита = "GLN" И ВыборкаРег.Документ = ДокОбъект.Ссылка Тогда;
				//		ВыборкаРег.ПолучитьМенеджерЗаписи().Удалить();
				//	КонецЕсли;
				//КонецЦикла;
				//Элемент = Рег.СоздатьМенеджерЗаписи();
				//Элемент.Документ = ДокОбъект.ссылка;
				//Элемент.ИмяРеквизита = "GLN";
				//Элемент.ЗначениеРеквизита = СтрШапка.ГЛН_Конечный;
				//Элемент.Записать();
				
				попытка
					
					НаборЗаписей = РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Документ.Установить(ДокОбъект.Ссылка); 
					НаборЗаписей.Отбор.ИмяРеквизита.Установить("GLN"); 
					НаборЗаписей.Очистить();;
					НаборЗаписей.Записать();
					
				исключение
				конецПопытки;
				
				рег = регистрыСведений.РеквизитыРНКПНКПРМ;
				Элемент = Рег.СоздатьМенеджерЗаписи();
				Элемент.Документ = ДокОбъект.ссылка;
				Элемент.ИмяРеквизита = "GLN";
				Элемент.ЗначениеРеквизита = СтрШапка.ГЛН_Конечный;
				Элемент.Записать();
				
				//нечаева 13,03,17----
				
				
			КонецЕсли;
			//Катаев- 31/10/13
			//Катаев+ 01/12/14 Для Молнии заносим в регистр сведений Номер заявки
			
			//нечаева 26,11,18+++
			Если Контрагент = Справочники.Контрагенты.НайтиПоКоду("CHF-0006") ТОгда
				
				Если СтрШапка.НомерЗаявкиМолния <> Неопределено Тогда
					рег = регистрыСведений.РеквизитыРНКПНКПРМ;
					ВыборкаРег = Рег.Выбрать();
					Пока ВыборкаРег.Следующий() Цикл
						Если ВыборкаРег.ИмяРеквизита = "НомерЗаявкиМолния" И ВыборкаРег.Документ = ДокОбъект.Ссылка Тогда;
							ВыборкаРег.ПолучитьМенеджерЗаписи().Удалить();
						КонецЕсли;
					КонецЦикла;
					Элемент = Рег.СоздатьМенеджерЗаписи();
					Элемент.Документ = ДокОбъект.ссылка;
					Элемент.ИмяРеквизита = "НомерЗаявкиМолния";
					Элемент.ЗначениеРеквизита = СтрШапка.НомерЗаявкиМолния;
					Элемент.Записать();
				КонецЕсли;
			КонецЕсли;
			//нечаева 26,11,18---
			
			
			//Катаев- 01/12/14
			Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
			//Сообщить("Записан документ - "+ДокОбъект.Дата+" "+ДокОбъект.Номер);
			// записать номер в "ошибки" для вывода менеджерам
		Исключение
			// Катаев+ 22/08/13 Если возникла ошибка с уникальностью номера, то пробуем обновить нумерацию объектов и сгенерировать номер заново
			Инфо = ИнформацияОбОшибке();
			Если Найти(Инфо.Описание, "Не уникальный номер документа") > 0 Тогда
				ОбновитьНумерациюОбъектов();
				УстановитьНомерДокумента2(ЭтотОбъект);
				Попытка
					ДокОбъект.Записать(режимЗаписиДокумента.Запись);
					Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
					//Катаев+ 31/10/13 В регистр сведений заносим GLN  конечного пункта (Лента)
					
					
					// для атака
					//Нечаева 25,10,17++
					Если ДокОбъект.Контрагент.Код="SSR-6556"  Тогда
						попытка
							
							НаборЗаписей = РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();
							НаборЗаписей.Отбор.Документ.Установить(ДокОбъект.Ссылка); 
							НаборЗаписей.Отбор.ИмяРеквизита.Установить("GLN"); 
							НаборЗаписей.Очистить();;
							НаборЗаписей.Записать();
							
						исключение
						конецПопытки;
						
						рег = регистрыСведений.РеквизитыРНКПНКПРМ;
						Элемент = Рег.СоздатьМенеджерЗаписи();
						Элемент.Документ = ДокОбъект.ссылка;
						Элемент.ИмяРеквизита = "GLN";
						Элемент.ЗначениеРеквизита = СтрШапка.ИЛНМестаДоставки;
						Элемент.Записать();
						
						//нечаева 02,11,17+++
						Попытка
							НаборЗаписей = РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();
							НаборЗаписей.Отбор.Документ.Установить(ДокОбъект.Ссылка); 
							НаборЗаписей.Отбор.ИмяРеквизита.Установить("GLNпокупателя"); 
							НаборЗаписей.Очистить();;
							НаборЗаписей.Записать();
						Исключение
						КонецПопытки;
						
						
						Попытка
							рег = регистрыСведений.РеквизитыРНКПНКПРМ;
							Элемент = Рег.СоздатьМенеджерЗаписи();
							Элемент.Документ = ДокОбъект.ссылка;
							Элемент.ИмяРеквизита = "GLNпокупателя";
							Элемент.ЗначениеРеквизита = СтрШапка.ИЛНПокупателя;
							Элемент.Записать();
						Исключение
						КонецПопытки;
						//нечаева 02,11,17---
						
						
					КонецЕсли;
					//Нечаева 25,10,17--
					
					
					
					
					// нечаева 23,03,16 +++ если напрямую грузим! не через рц
					Если СтрШапка.ГЛН_Конечный = "" Тогда
						СтрШапка.ГЛН_Конечный = ДокОбъект.ПунктДоставки.КодИЛН;
					КонецЕсли;
					// нечаева 23,03,16 ---	
					
					Если СтрШапка.ГЛН_Конечный <> Неопределено Тогда
						//нечаева 13,03,17+++
						
						//было
						//рег = регистрыСведений.РеквизитыРНКПНКПРМ;
						//ВыборкаРег = Рег.Выбрать();
						//Пока ВыборкаРег.Следующий() Цикл
						//	Если ВыборкаРег.ИмяРеквизита = "GLN" И ВыборкаРег.Документ = ДокОбъект.Ссылка Тогда;
						//		ВыборкаРег.ПолучитьМенеджерЗаписи().Удалить();
						//	КонецЕсли;
						//КонецЦикла;
						//Элемент = Рег.СоздатьМенеджерЗаписи();
						//Элемент.Документ = ДокОбъект.ссылка;
						//Элемент.ИмяРеквизита = "GLN";
						//Элемент.ЗначениеРеквизита = СтрШапка.ГЛН_Конечный;
						//Элемент.Записать();
						
						попытка
							
							НаборЗаписей = РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьНаборЗаписей();
							НаборЗаписей.Отбор.Документ.Установить(ДокОбъект.Ссылка); 
							НаборЗаписей.Отбор.ИмяРеквизита.Установить("GLN"); 
							НаборЗаписей.Очистить();;
							НаборЗаписей.Записать();
							
						исключение
						конецПопытки;
						
						рег = регистрыСведений.РеквизитыРНКПНКПРМ;
						Элемент = Рег.СоздатьМенеджерЗаписи();
						Элемент.Документ = ДокОбъект.ссылка;
						Элемент.ИмяРеквизита = "GLN";
						Элемент.ЗначениеРеквизита = СтрШапка.ГЛН_Конечный;
						Элемент.Записать();
						
						//нечаева 13,03,17----
						
					КонецЕсли;
					//Катаев- 31/10/13
				Исключение
					Если ПризКр=0 тогда
						КритичОшибки.Добавить("После обновления нумерации для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
						//Катаев+ 11/12/14
						Отказ = Истина;
						//Катаев- 11/12/14
					конецЕсли;
				КонецПопытки;
			Иначе	
				Если ПризКр=0 тогда
					КритичОшибки.Добавить("Для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
					//Катаев+ 11/12/14
					Отказ = Истина;
					//Катаев- 11/12/14
				конецЕсли;
			КонецЕсли;
			// Катаев- 22/08/13
			//Сообщить(ОписаниеОшибки());
		КонецПопытки;
		//КонецЕсли;
		//сообщить("    документ записан");
		ПризКр=ПризКр+1;
	КонецЦикла;
	// конец заполнения документа
	
	
КонецПроцедуры


//Катаев- 29/03/13
//**********************************************************************************************




//--------------------------------------------------
//-----------------------------------------------------------------------------------------------


//нечаева 15,12,20++++


Функция POSTЗапросИз1С(Команда,ТелоДж)
	
	// это продуктив пароли
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//НашКлючАдмин = "*#*#*#";
	НашКлючАдмин = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииОзонТокен).Токен;
	// Ихсанов Д. А. Конец  14.10.2025
	КлиентИД = 44219;
	
	//// тестовые пароли
	//КлиентИД = 836;                                                    
	//НашКлючАдмин ="*#*#*#";
	
	Лимит = 10;
	
	ИмяВыходногоФайла = ПолучитьИмяВременногоФайла(".pdf");
	
	//ДатаНачала =Формат(НачалоДня(Дата1),"ДФ=""гггг-ММ-дд""");
	//ДатаКонца = Формат(КонецДня(Дата2),"ДФ=""гггг-ММ-дд""");
	
	//АдресТ = "cb-api.ozonru.me"	; // тестовый сервер
	АдресТ = "api-seller.ozon.ru"	; // продуктив
	попытка                          
		Соединение = Новый HTTPСоединение(АдресТ,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);  
	исключение
		//Сообщить(ОписаниеОшибки());
	конецПопытки;
	
	HTTP_запрос = новый HTTPзапрос();
	
	HTTP_запрос.АдресРесурса = Команда;
	
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json");
	ЗаголовокHTTP.Вставить("Accept", "text/xml");
	ЗаголовокHTTP.Вставить("Accept-Language", "ru");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("Content-Language", "ru");
	ЗаголовокHTTP.Вставить("Content-Charset", "utf-8");
	// потмо изменить
	ЗаголовокHTTP.Вставить("Host", АдресТ); //"https://seller-api.sc.prod.s.o3.ru/v1/categories/tree?language=DEFAULT");
	ЗаголовокHTTP.Вставить("Client-Id", КлиентИД);
	ЗаголовокHTTP.Вставить("Api-Key", НашКлючАдмин );	
	//Host: api-seller.ozon.ru
	
	
	HTTP_запрос.Заголовки = ЗаголовокHTTP;
	//	ТелоДЖ="C:\Users\nechaeva\AppData\Local\Temp\8\123.json";  - так работает , на работчем столе лежит
	//HTTP_запрос.УстановитьТелоИзСтроки(ТелоДЖ,,ИспользованиеByteOrderMark.НеИспользовать);
	HTTP_запрос.УстановитьИмяФайлаТела(ТелоДЖ);
	
	
	Попытка
		//Отправляем для обрааботки на наш сервер
		Ответ = Соединение.ОтправитьДляОбработки(HTTP_запрос);  // ИмяВыходногоФайла
		
	Исключение
		#Если клиент Тогда
			Сообщить(ОписаниеОшибки());
		#КонецЕсли   
	КонецПопытки;
	//	ответ.ПолучитьИмяФайлаТела()
	Соединение.ОтправитьДляОбработки(HTTP_запрос,ИмяВыходногоФайла);
	//Сообщить(ИмяВыходногоФайла);
	
	возврат Ответ;
	
	//--------------------------------------------------------------------------------------------------------------------------------
	
	
	
КонецФункции

Функция ТабЗначВМассив(ТаблицаЗначений) Экспорт
	НашМассив = Новый Массив;
	Для Каждого СтрокаТаблицы из ТаблицаЗначений Цикл
		НашаСтруктура = Новый Структура;
		Счетчик = 0;
		Для Каждого СтрокаСтруктуры из СтрокаТаблицы Цикл
			Если НЕ ТипЗнч(СтрокаСтруктуры) = Тип(ТаблицаЗначений) тогда
				НашаСтруктура.Вставить(ТаблицаЗначений.Колонки[Счетчик].Имя,СтрокаТаблицы[Счетчик]);
			Иначе
				НашаСтруктура.Вставить(ТаблицаЗначений.Колонки[Счетчик].Имя,ТабЗначВМассив(СтрокаСтруктуры));
			КонецЕсли;
			Счетчик = Счетчик + 1;
		КонецЦикла;
		НашМассив.Добавить(НашаСтруктура);
	КонецЦикла;
	Возврат(НашМассив);
КонецФункции

// получаем и загружаем заказы.
Процедура СчитатьЗаказыССайта(Статус)
	
	//статусы отправлений
	
	//	awaiting_packaging — ожидает упаковки,
	//not_accepted — не принят в сортировочном центре,
	//arbitration — ожидает решения спора,
	//awaiting_deliver — ожидает отгрузки,
	//delivering — доставляется,
	//driver_pickup — у водителя,
	//delivered — доставлено,
	//cancelled — отменено.
	//	
	
	
	// получение списка отправлений за день.
	команда = 1;
	//POSTЗапросИз1С(Команда);  // старая проба
	
	Команда = "/v2/posting/fbs/list";  // считывает заказы с сайта
	ТелоДЖ = "";
	
	Контрагент=справочники.Контрагенты.НайтиПоКоду("SSP-4991");
	
	// Попытка         
	//    УдалитьФайлы("D:\temp\","pills.json");
	//Исключение
	//    Сообщить(ОписаниеОшибки());
	//КонецПопытки;
	
	ИмяВыходногоФайлаДЖ = ПолучитьИмяВременногоФайла(".json");
	//	сообщить(ИмяВыходногоФайлаДж);
	
	
	Запись = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( ,Символы.Таб);
	Запись.ОткрытьФайл(ИмяВыходногоФайлаДЖ,,,ПараметрыЗаписиJSON);
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата; //ЛокальнаяДата;      "2020-10-31T21:00:00Z",
	
	//ТабЗн = Новый ТаблицаЗначений;
	//ТабЗн.Колонки.Добавить("since");
	//ТабЗн.Колонки.Добавить("status");
	// //ТабЗн.Колонки.Добавить("to");
	//	НовСтр = ТабЗн.Добавить();
	//НовСтр.since= НачалоМесяца(ТекущаяДата());
	//НовСтр.to=  ТекущаяДата();
	//НовСтр.status= "delivering";
	
	//	Текдата1 = Формат(НачалоМесяца(ТекущаяДата()),"ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс'.000Z'"""); // время просят с миллисекундами
	//	Текдата2 = Формат(ТекущаяДата(),"ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс'.000Z'"""); 
	
	СтрПРо= Новый Структура;
	
	Дата1 = (ТекущаяДата()-60*60*60);
	
	//!!!!!!!!!!!!!!!!!!!!!! поправить дату
	
	СтрПро.Вставить("since",(ТекущаяДата()-60*60*60));    //ТекДата1);
	СтрПро.Вставить("status",Статус);  // ожидает отгрузки -  awaiting_deliver 
	СтрПро.Вставить("to",ТекущаяДата());
	
	
	// пример запроса	
	//{
	//  "dir": "asc",
	//  "filter": {         // как таблицу значений?
	//    "since": "2020-02-25T11:40:57.126Z",
	//    "status": "delivering",
	//    "to": "2020-03-25T11:40:57.126Z"
	//  },
	//  "limit": 1,
	//  "offset": 0,
	//  "with": {
	//    "barcodes": true
	//  }
	//}
	//	
	//	
	
	//	Текдата1 = Формат(НачалоДня(ТекущаяДата()),"ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс'.000Z'""");  // 2020-10-31T21:00:00Z07:00\
	
	ШК = Новый Структура;
	ШК.Вставить("barcodes",true);
	
	Данные = Новый Структура;
	Данные.Вставить("dir","asc");
	//	Данные.Вставить("filter",ТабЗначВМассив(ТабЗн)); - это для таблиц значений
	
	// это структуру добавили
	Данные.Вставить("filter",СтрПро);
	Данные.Вставить("limit",50); // количество заказов  макс 50 за раз,  пропишу загрузку по одному заказу временно .
	Данные.Вставить("offset",0);
	Данные.Вставить("with",ШК);
	
	
	Попытка
		ЗаписатьJSON(Запись, Данные, НастройкиСериализации);
		Запись.Закрыть();
		// Возврат Истина;
	Исключение
		//сообщить(ОписаниеОшибки());
		// ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Ошибка,,,"Прайс не сформирован, произошла ошибка " + ОписаниеОшибки());
		//  Возврат Ложь;
	КонецПопытки;;  
	
	
	// выполнение пост запроса.
	//-------------------------------
	Результат = POSTЗапросИз1С(Команда,ИмяВыходногоФайлаДЖ) ;    // ИмяВыходногоФайла?
	//-------------------------------
	р2=Результат.ПолучитьТелоКакСтроку();
	ИмяВыхОтвет=результат.ПолучитьИмяФайлаТела();
	//	Сообщить(ИмяВыхОтвет);
	
	// можно отсюда обрабатывать
	//Текст = Новый ТекстовыйДокумент;
	//Текст.УстановитьТекст(Результат.ПолучитьТелоКакСтроку());
	//	сообщить(р2);
	
	// 2 вариант для обработки, так проще.
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку());
	
	Данные = ПрочитатьJSON(ЧтениеJSON, Ложь); // тут в структуру все выгружено
	//сообщить(Данные);
	
	Для каждого ТекСтрока из Данные.result цикл
		//обработка
		#Если клиент	тогда	 
			сообщить("НомерЗаказа - "+ТекСтрока.order_number+" номер отправления - "+Текстрока.posting_number+" , дата заказа"+ (ТекСтрока.created_at) );
		#конецЕсли
		
		// проверим , есть ли уже такой заказ.
		Запрос = новый запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка КАК Ссылка,
		|	ВложенныйЗапрос.ЗначениеРеквизита КАК ЗначениеШК
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			РеквизитыДокументов.ЗначениеРеквизита КАК ЗначениеРеквизита,
		|			РеквизитыДокументов.Документ КАК Документ
		|		ИЗ
		|			РегистрСведений.РеквизитыДокументов КАК РеквизитыДокументов
		|		ГДЕ
		|			РеквизитыДокументов.ИмяРеквизита = ""НижнийШКЭтикетки"") КАК ВложенныйЗапрос
		|		ПО РасходнаяНакладная.Ссылка = ВложенныйЗапрос.Документ
		|ГДЕ
		|	РасходнаяНакладная.НомерЗаказа = &ТекНОм
		|	И РасходнаяНакладная.Контрагент = &озон
		|	И РасходнаяНакладная.Дата >= &Этотгод";
		Запрос.УстановитьПараметр("ТекНом",Текстрока.posting_number);
		Запрос.УстановитьПараметр("озон",контрагент);
		Запрос.УстановитьПараметр("этотгод",ДобавитьМесяц(ТекущаяДата(), -2));
		Рез=Запрос.Выполнить().Выбрать();
		Если рез.Следующий() тогда
			#Если клиент	тогда 
				сообщить("  .... уже загружен.");
				
			#конецЕсли
			// проставим ШК
			//   Если Статус = "awaiting_deliver" тогда // и рез.ссылка.ПереданПокупателюВЭлВиде и Рез.ссылка.состояниеНакладной <>перечисления.СостоянияНакладной.Отгружена Тогда
			//
			//Попытка
			//	Если рез.ЗначениеШК=Null или рез.ЗначениеШК=неопределено  Тогда
			//		знШк="";
			//	иначе
			//		ЗнШК=рез.ЗначениеШК;
			//	КонецЕсли;	
			//исключение
			//	ЗнШК="";
			//конецПопытки;	
			//
			//Если  ТекСтрока.barcodes <> Неопределено и знШк="" тогда
			//	
			//	ЗаписьВРег=РегистрыСведений.ИнформацияШКЛН_FBS.СоздатьМенеджерЗаписи();
			//	ЗаписьВРег.ШК=Строка(ТекСтрока.barcodes.lower_barcode);
			//	ЗаписьВРег.ШКЛистаНабора=Строка(ТекСтрока.barcodes.lower_barcode);
			//	ЗаписьВРег.год = ТекущаяДата();
			//	ЗаписьВРег.накладная = ДокОбъект.Ссылка;
			//	ЗаписьВРег.НомерНакладной = ДокОбъект.Номер; 
			//	ЗаписьВРег.Записать();
			//	
			//КонецЕсли;
			//
			//	КонецЕсли;	 
			
			
			
			продолжить;
			
			
			
		КонецЕсли;	 
		ЗагрузитьВРНК(ТекСтрока);
		
	КонецЦикла;
	
	Если  КритичОшибки.Количество()>0   Тогда
		СообщитьКритОшибки();                        //++++
	КонецЕсли;	
	КритичОшибки.Очистить();
	Если  КритическиеОшибкиОзон.количество()>0 Тогда
		СообщитьМенеджеруОзон(ДокОбъект);
	КонецЕсли; 
	КритическиеОшибкиОзон.очистить();
	
	
	
КонецПроцедуры

// добавлен ШКконтаргента дополнительный по GS1
Функция НайтиПОШКМатрица2ст(ШК,Артикул,Контрагент)Экспорт
	
	НайденнаяНоменклатура=Справочники.Номенклатура.ПустаяСсылка();
	//---------------------------------------------------------------------------
	
	
	
	Если Артикул <> Неопределено Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура,
		|	МатрицаТовары.ШККонтрагента,
		|	МатрицаТовары.АртикулКонтрагента,
		|	МатрицаТовары.Цена
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
		|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА
		|	И МатрицаТовары.АртикулКонтрагента ПОДОБНО &ТекАрт";
		
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТекАрт",Строка(Артикул));
		Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
		
		Рез=Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() Тогда
			Возврат Рез.Номенклатура;
		КонецЕсли;
	КонецЕсли;
	
	// ищем по ШК   там нет шк в заказах
	//Запрос=Новый Запрос;
	//Запрос.Текст="ВЫБРАТЬ
	//             |	МатрицаТовары.Номенклатура КАК Номенклатура,
	//             |	МатрицаТовары.ШККонтрагента КАК ШККонтрагента,
	//             |	МатрицаТовары.ШККонтрагентаДополнительный КАК ШККонтрагентаДополнительный,
	//             |	МатрицаТовары.АртикулКонтрагента КАК АртикулКонтрагента,
	//             |	МатрицаТовары.Цена КАК Цена
	//             |ИЗ
	//             |	Документ.Матрица.Товары КАК МатрицаТовары
	//             |ГДЕ
	//             |	(МатрицаТовары.ШККонтрагента = &ТекШК
	//             |			ИЛИ МатрицаТовары.ШККонтрагентаДополнительный = &ТекШК)
	//             |	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
	//             |	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
	//             |	И МатрицаТовары.Ссылка.Проведен = ИСТИНА";
	//
	//Запрос.УстановитьПараметр("Контрагент",Контрагент);
	//Запрос.УстановитьПараметр("ТекШк",ШК);
	//Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
	//
	//Рез=Запрос.Выполнить().Выбрать();
	//Если Рез.Следующий() Тогда
	//		Возврат Рез.Номенклатура;
	//КонецЕсли;
	//
	
	
	
	
	возврат НайденнаяНоменклатура;
	//----------------------------------------------------------------------------
КонецФункции // НайтиПОШК()


//нечаева  28,08,19 добавлен ШКконтаргента дополнительный по GS1
Функция НайтиПОШКМатрица2(ШК,Артикул,Контрагент)Экспорт
	
	НайденнаяНоменклатура=Справочники.Номенклатура.ПустаяСсылка();
	//---------------------------------------------------------------------------
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Матрица.Ссылка КАК Ссылка1
	|ИЗ
	|	Документ.Матрица.ПунктыДоставки КАК Матрица
	|ГДЕ
	|	Матрица.Ссылка.Контрагент = &Контрагент
	|	И Матрица.Ссылка.Дата <= &Дата1
	|	И Матрица.Ссылка.ДатаОкончания >= &Дата2
	|	И Матрица.Ссылка.Договор = &Договор
	|	И Матрица.Ссылка.Проведен = ИСТИНА
	|	И Матрица.ПунктДоставки = &ПДИМ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	
	Запрос.УстановитьПараметр("Дата2",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Дата1",КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("Договор",справочники.Договоры.НайтиПоКоду("SNL-028617"));
	Запрос.УстановитьПараметр("ПДИМ",Справочники.ПунктыДоставки.НайтиПоКоду("SNL-024031"));  // фбс озон
	
	ТЗЕстьМатрицаПоДоговору = Запрос.Выполнить().Выгрузить();
	
	
	Если Артикул <> Неопределено Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	МатрицаТовары.Номенклатура,
		|	МатрицаТовары.ШККонтрагента,
		|	МатрицаТовары.АртикулКонтрагента,
		|	МатрицаТовары.Цена
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|ГДЕ
		|	МатрицаТовары.Ссылка.Контрагент = &Контрагент
		|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
		|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА
		|	И МатрицаТовары.АртикулКонтрагента ПОДОБНО &ТекАрт
		|	И МатрицаТовары.Ссылка В ИЕРАРХИИ(&спМатриц)";
		
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ТекАрт",Строка(Артикул));
		Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
		Запрос.УстановитьПараметр("спМатриц",ТЗЕстьМатрицаПоДоговору);
		
		Рез=Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() Тогда
			Возврат Рез.Номенклатура;
		КонецЕсли;
	КонецЕсли;
	
	// ищем по ШК
	//Запрос=Новый Запрос;
	//Запрос.Текст="ВЫБРАТЬ
	//             |	МатрицаТовары.Номенклатура КАК Номенклатура,
	//             |	МатрицаТовары.ШККонтрагента КАК ШККонтрагента,
	//             |	МатрицаТовары.ШККонтрагентаДополнительный КАК ШККонтрагентаДополнительный,
	//             |	МатрицаТовары.АртикулКонтрагента КАК АртикулКонтрагента,
	//             |	МатрицаТовары.Цена КАК Цена
	//             |ИЗ
	//             |	Документ.Матрица.Товары КАК МатрицаТовары
	//             |ГДЕ
	//             |	(МатрицаТовары.ШККонтрагента = &ТекШК
	//             |			ИЛИ МатрицаТовары.ШККонтрагентаДополнительный = &ТекШК)
	//             |	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
	//             |	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
	//             |	И МатрицаТовары.Ссылка.Проведен = ИСТИНА";
	//
	//Запрос.УстановитьПараметр("Контрагент",Контрагент);
	//Запрос.УстановитьПараметр("ТекШк",ШК);
	//Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
	//
	//Рез=Запрос.Выполнить().Выбрать();
	//Если Рез.Следующий() Тогда
	//		Возврат Рез.Номенклатура;
	//КонецЕсли;
	//
	
	
	
	
	возврат НайденнаяНоменклатура;
	//----------------------------------------------------------------------------
КонецФункции // НайтиПОШК()



// проверим статусы движения РНК, пропишем Баркод этикетки для озона с сайта.

Процедура ПунктДоставки_ПриИзменении(ПунктДоставки,РНК) экспорт
	//  19.08.2020 Кухарь конец
	
	
	
	//Кухарь 01.05.18 начало
	//Будем тип доставки фиксировать в документах
	ТипДоставки=ПунктДоставки.ТипДоставки;
	//Кухарь 01.05.18 конец
	
	
	Если НЕ ПунктДоставки.Пустая() Тогда
		
		
		НуженПересчетЦен=Ложь;
		
		Если ЗначениеЗаполнено(ПунктДоставки.Договор)  Тогда
			РНК.Договор=ПунктДоставки.Договор;
			РНК.Договор_ПриИзменении(Неопределено);
		КонецЕсли;
		
		//крохин конец 07.04.2011
		
		//доставка
		Если ЗначениеЗаполнено(ПунктДоставки.РайонДоставки) Тогда
			РНК.РайонДоставки=ПунктДоставки.РайонДоставки;			
		КонецЕсли;	
		Если ЗначениеЗаполнено(ПунктДоставки.Регион) Тогда
			рнк.Регион=ПунктДоставки.Регион;			
		КонецЕсли;	
		
		если РНК.ПунктДоставки.ТипДоставки=Перечисления.ТипыДоставки.ТранспортнаяКомпания тогда
			Если ЗначениеЗаполнено(ПунктДоставки.ТраспортнаяКомпания) Тогда
				РНК.ТранспортнаяКомпания=ПунктДоставки.ТраспортнаяКомпания;	
			иначе
				РНК.ТранспортнаяКомпания=Справочники.Контрагенты.ПустаяСсылка();
			КонецЕсли;	
			Если ЗначениеЗаполнено(ПунктДоставки.ПунктПерегруза) Тогда
				РНК.ПунктПерегруза=ПунктДоставки.ПунктПерегруза;
			иначе
				РНК.ПунктПерегруза=Справочники.ПунктыДоставки.ПустаяСсылка();
			КонецЕсли;	
		иначе
			РНК.ТранспортнаяКомпания=Справочники.Контрагенты.ПустаяСсылка();	
			РНК.ПунктПерегруза=Справочники.ПунктыДоставки.ПустаяСсылка();
		КонецЕсли;
		//Кухарь 26.01.16 конец
		
		Если ЗначениеЗаполнено(ПунктДоставки.Грузополучатель) Тогда
			РНК.Грузополучатель=ПунктДоставки.Грузополучатель;		
		КонецЕсли;
		Если ЗначениеЗаполнено(ПунктДоставки.Получатель) Тогда
			РНК.Получатель=ПунктДоставки.Получатель;		
		КонецЕсли;
		Если ЗначениеЗаполнено(ПунктДоставки.ОтсрочкаПлатежа) Тогда
			РНК.ОтсрочкаПлатежа=ПунктДоставки.ОтсрочкаПлатежа;		
		КонецЕсли;
		
		//типы цен скидки
		Если ЗначениеЗаполнено(ПунктДоставки.ТипЦен) И РНК.ТипЦен<>ПунктДоставки.ТипЦен Тогда
			РНК.ТипЦен=ПунктДоставки.ТипЦен;		
			РНК.НуженПересчетЦен=Истина;
		КонецЕсли; 
		Если ЗначениеЗаполнено(ПунктДоставки.ТипСкидок) И РНК.ТипСкидок<>ПунктДоставки.ТипСкидок Тогда
			РНК.ТипСкидок=ПунктДоставки.ТипСкидок;		
			РНК.НуженПересчетЦен=Истина;
		КонецЕсли;
		Если ПунктДоставки.Скидка<>0 И ПунктДоставки.Скидка<>РНК.Скидка Тогда
			РНК.Скидка=ПунктДоставки.Скидка;		
			РНК.НуженПересчетЦен=Истина;
		КонецЕсли;
		Если НуженПересчетЦен Тогда
			ПересчетТЧ(РНК,"Товары",РНК.Валюта,РНК.Валюта,РНК.Курс,РНК.Курс,Истина);			
		КонецЕсли;	
		//крохин начало 29.03.2011
		//ставка НДС
		//Если ПунктДоставки.НулеваяСтавкаНДС или Контрагент.НулеваяСтавкаНДС Тогда
		//	РНК.НулеваяСтавкаНДС = Истина;	
		//	НулеваяСтавкаНДСПриИзменении(Неопределено);
		//	//крохин начало 03.10.2012
		//ИначеЕсли НулеваяСтавкаНДС Тогда
		//	НулеваяСтавкаНДС = Ложь;
		//	НулеваяСтавкаНДСПриИзменении(Неопределено);
		//	//крохин конец 03.10.2012
		//КонецЕсли;
		//крохин конец 29.03.2011
		//УстановитьЗаголовокКнопкиЦеныВалюта(ЭтаФорма);
	КонецЕсли; 
	//крохин начало 15.04.2011
	//Доп. обработки, заполняем из пункта доставки, если они там есть
	//Если ДопОбработки.Количество()>0 Тогда
	//	Предупреждение("Доп. обработки будут перезаполнены по умолчанию из карточки контрагента !");
	//КонецЕсли;	
	РНК.ДопОбработки.Очистить();
	Если ПунктДоставки.ВидыДопОбработок.Количество() = 0 Тогда
		Для Каждого СтрокаТЧ Из Контрагент.ВидыДопОбработок Цикл
			СтрокаДО=РНК.ДопОбработки.Добавить();	
			СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
		КонецЦикла;
	Иначе
		Для Каждого СтрокаТЧ Из ПунктДоставки.ВидыДопОбработок Цикл
			СтрокаДО=РНК.ДопОбработки.Добавить();	
			СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
		КонецЦикла;
		
	КонецЕсли;
	//крохин конец 15.04.2011
	//крохин начало 29.04.2011
	КодПоставщикаПунктаДоставки=ПунктДоставки.КодПоставщика;
	Если НЕ КодПоставщикаПунктаДоставки.Пустая() И РНК.КодПоставщика<>КодПоставщикаПунктаДоставки Тогда
		РНК.КодПоставщика=КодПоставщикаПунктаДоставки;
	КонецЕсли; 
	//крохин конец 29.04.2011
	
	//
	//РНК.ВремяДоставки=ПолучитьВремяПриемки(РНК.Ссылка);
	//если РНК.ВремяДоставки=Справочники.ВремяПриемки.ПустаяСсылка() или РНК.ВремяДоставки=Неопределено тогда
	//	пВремяДоставки=ПунктДоставки.ВремяДоставки;
	//иначе
	//	пВремяДоставки=РНК.ВремяДоставки;
	//КонецЕсли;
	
	РНК.ДатаПриемки=ОпределитьДатуАвизацииДокумента(РНК.Ссылка);	
	КодПоставщикаПунктаДоставки=ПунктДоставки.КодПоставщика;
	Если НЕ КодПоставщикаПунктаДоставки.Пустая() И РНК.КодПоставщика<>КодПоставщикаПунктаДоставки Тогда
		РНК.КодПоставщика=КодПоставщикаПунктаДоставки;
	КонецЕсли; 
	Если ЗначениеЗаполнено(ПунктДоставки.СкладКомиссия) Тогда
		РНК.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия;
		РНК.СкладКомиссия = ПунктДоставки.СкладКомиссия;
		//	ДоговорКомиссия = ПунктДоставки.ДоговорКомиссия;
	Иначе
		Если РНК.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия Тогда
			РНК.КодОперации = Перечисления.КодыОперацийОстатки.Реализация;
			РНК.СкладКомиссия = Справочники.Склады.ПустаяСсылка();
			//		ДоговорКомиссия = Справочники.Договоры.ПустаяСсылка();
			
		КонецЕсли;	
	КонецЕсли;
	
	
КонецПроцедуры



Процедура ЗагрузитьвРНК(СтруктураЗаказа)
	
	Организация=Неопределено;
	Менеджер=Неопределено;
	Регион=Неопределено;
	Договор=Неопределено;
	Подразделение=Неопределено;
	ОтсрочкаПлатежа=Неопределено;
	КодПоставщикаКонтрагента=Неопределено;
	ПунктДоставки=Неопределено;
	НомерЗаказа=Неопределено;
	ТипILNКонтрагента=Неопределено;
	ДатаЗаказа=Неопределено;
	ДатаОтгрузки=Неопределено;
	Склад=Неопределено;   //Спр
	ПРизКр=0;
	//-----------------------------------------------------------------------
	//      обрабатываем заказы.  пока в РНК грузим
	//-----------------------------------------------------------------------
	// выделяем отдельные заказы. и каждый в отдельную РНК пока.
	
	// ответ список отправлений
	//	{
	//  "result": [
	//    {
	//      "order_id": 128903259,
	//      "order_number": "29750371-0013",
	//      "posting_number": "29750371-0013-1",
	//      "status": "delivering",
	//      "cancel_reason_id": 0,
	//      "created_at": "2020-02-27T11:48:08Z",
	//      "in_process_at": "2020-02-27T12:52:11Z",
	//      "shipment_date": "2020-03-06T10:00:00Z",
	//      "products": [
	//        {
	//          "sku": 147755222,
	//          "name": "Гантель неопреновая Starfit DB-201 2.5 кг. фиолетовая",
	//          "quantity": 2,
	//          "offer_id": "УТ-00009071",
	//          "price": "529.0000"
	//        }
	//      ],
	//      "barcodes": {
	//        "upper_barcode": "%101%168789800",
	//        "lower_barcode": "17736565768000"
	//      }
	//    }
	//  ]
	//}
	
	
	НовРНК= документы.РасходнаяНакладная.СоздатьДокумент();
	ДокОбъект =НовРНК;
	
	ДатаЗаказа=Неопределено;
	ДатаОтгрузки=Неопределено;
	Склад=Неопределено;   //Справочники.Склады.НайтиПоКоду("STA-61");
	Контрагент=справочники.Контрагенты.НайтиПоКоду("SSP-4991");
	Если Контрагент=Неопределено тогда
		Контрагент=Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;	
	ПунктДоставки=справочники.ПунктыДоставки.НайтиПоКоду("SNL-024031"); // рц хоругвино
	
	НомерОтправления = СтруктураЗаказа.posting_number;
	
	НомЗаказа=СтруктураЗаказа.order_number;
	НомерЗаказа=СтруктураЗаказа.order_number;
	ДТ = СтруктураЗаказа.created_at;
	ПДТ = Лев(ДТ,СтрНайти(ДТ,"T",,,1)-1);
	Год  = Лев(ПДТ,4);
	День = Прав(ПДТ,2);
	Месяц = Сред(ПДТ,6,2);
	
	ДатаЗаказа=Дата(год,месяц,день);
	
	
	ДТ = СтруктураЗаказа.shipment_date;
	ПДТ = Лев(ДТ,СтрНайти(ДТ,"T",,,1)-1);
	Год  = Лев(ПДТ,4);
	День = Прав(ПДТ,2);
	Месяц = Сред(ПДТ,6,2);
	
	ДатаДоставки=Дата(год,месяц,день);
	
	//// время доставки найдем
	//ВремяДоставки =Прав(ДТ,9);
	//ЧасДоставки=Лев(ВремяДоставки,2);
	//Попытка
	//	
	//	ПервыйЗнак = Лев(ВремяДоставки,1); // если 09:00, то ищем " 9:00"
	//	Если ПервыйЗнак = "0" ТОгда    
	//		ЧасДоставки =" "+Сред(ЧасДоставки,2,СтрДлина(ЧасДоставки)-1) ;
	//	КонецЕсли;	
	//	
	//	//ДокОбъект.ВремяПриемки = Справочники.ВремяПриемки.НайтиПоНаименованию(""+ЧасДоставки+":00-"+ЧасДоставки+":00");
	//	
	//	// только после сохранения докмуента возможно.
	//	//
	//	//ЗаписьВРег=РегистрыСведений.РеквизитыДокументов.СоздатьМенеджерЗаписи();
	//	//ЗаписьВРег.Документ=Документ.Ссылка;
	//	//ЗаписьВРег.ИмяРеквизита="ВремяПриемкиДляЗОГ";
	//	//ЗаписьВРег.Период=Документ.Ссылка.Дата;
	//	//ЗаписьВРег.ЗначениеРеквизита=ВремяПриемки;
	//	//ЗаписьВРег.Записать();
	//	
	//Исключение
	//КонецПопытки;
	////нечаева 27,11,17---
	
	
	//ВремяДоставки = СтрШапка.ВремяДоставки;
	Организация=Справочники.Организации.НайтиПоКоду("SS-001"); 
	
	
	ТипЦен=Контрагент.ТипЦен;
	Договор=Справочники.Договоры.НайтиПоКоду("SNL-028617");
	
	Если не (Договор=Неопределено) и не (Договор=справочники.Договоры.ПустаяСсылка()) Тогда
		//ТипЦен		=Договор.ТипЦен;
		ОтсрочкаПлатежа =Договор.ОтсрочкаПлатежа;
		Если ЗначениеЗаполнено(Договор.Организация) Тогда
			Организация=Договор.Организация;		
		КонецЕсли;
	КонецЕсли;
	
	ДокОбъект.ДопОбработки.Очистить();
	Для Каждого СтрокаТЧ Из Контрагент.ВидыДопОбработок Цикл
		СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
		СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
	КонецЦикла; 
	//нечаева 23,03,17+++
	// добавляем из пункта доставки доп. обработки.
	Попытка
		Для Каждого СтрокаТЧ Из ПунктДоставки.ВидыДопОбработок Цикл
			СтрокаДО=ДокОбъект.ДопОбработки.Добавить();	
			СтрокаДО.ВидДопОбработки=СтрокаТЧ.ДопОбработка;
		КонецЦикла;  
	Исключение
	КонецПопытки;
	
	ДокОбъект.Дата=ТекущаяДата();
	ЗаполнитьШапкуДокумента(ДокОбъект, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
	//УстановитьНомерДокумента2(ДокОбъект);
	ДокОбъект.Контрагент=Контрагент;
	ДокОбъект.Организация=Организация;
	ДокОбъект.Договор=Договор;
	ДокОбъект.ИБ=Справочники.ИБ.НайтиПоКоду("SSP");
	ДокОбъект.Менеджер= Контрагент.Менеджер;
	ДокОбъект.НомерЗаказа= НомерОтправления; //УбратьНули(НомЗаказа,Контрагент.УбиратьНулиПередНомеромЗаказа);
	ДокОбъект.комментарий = "Заказ из ИМ, со склада продавца";
	//ДокОбъект.КодПоставщика=КодПоставщикаКонтрагента;
	
	//ДокОбъект.Регион = Регион;
	ТипШК=перечисления.ТипыШтрихКодов.Штука;
	ДокОбъект.КодОперации =перечисления.КодыОперацийОстатки.Комиссия;
	
	
	Склад = Справочники.Склады.НайтиПоКоду("STC-81");  // ИМ
	
	ДокОбъект.ОтсрочкаПлатежа=ОтсрочкаПлатежа;		
	ДокОбъект.ТипЦен=ТипЦен; //Контрагент.ТипЦен;
	ДокОбъект.ВидОплаты=Перечисления.ВидыОплаты.БН;
	//++Данилова Е.В. 30.09.2025 HELP-7048
	//Подразделение = Контрагент.Менеджер.Подразделение;
	Подразделение = ЗаполнениеДокументов.ПодразделениеПродажПоМенеджеру(Контрагент.Менеджер);
	//--Данилова Е.В. 30.09.2025
	ДокОбъект.Подразделение = Подразделение;
	ДокОбъект.ЛевыйКонтрагент=Контрагент;
	ДокОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе;
	ДокОбъект.Отгружен=перечисления.Отгружен.Резерв;
	ДокОбъект.ПунктДоставки=ПунктДоставки;
	ДокОбъект.Склад=Склад;		
	УстановитьНомерДокумента2(ДокОбъект);
	ДокОбъект.Валюта=Справочники.Валюты.НайтиПоКоду("810");
	
	Попытка
		ДокОбъект.ДатаЗаказа=Дата(СтрЗаменить(ДатаЗаказа, "-", ""));
		
		ДатаИзЗог = Дата(1,1,1);
		ДокОбъект.ДатаОтгрузки=Дата(СтрЗаменить(ДатаДоставки, "-", ""));
		
	Исключение
	КонецПопытки;
	
	
	//
	//Если СокрЛП(Контрагент.Код)=КодМетро И (Лев(ДокОбъект.Номер,3)<>"SSP" или Лев(ДокОбъект.Номер,3)<>"SST")  Тогда
	//	УстановитьНомерДокумента2(ДокОбъект);	
	//КонецЕсли;
	
	//ДокОбъект.КодОперации=Перечисления.КодыОперацийОстатки.Реализация;
	ДокОбъект.ДатаОформления	=ДокОбъект.Дата;
	СкидкаКонтрагента=ПолучитьРеквизитРодителя(Контрагент,"Скидка");
	ДокОбъект.Скидка=СкидкаКонтрагента;
	ПунктДоставки_ПриИзменении(ПунктДоставки,ДокОбъект);
	
	// загрузим товары из заказа
	Для каждого ТекСтр из СтруктураЗаказа.products Цикл
		
		Ном = Справочники.Номенклатура.ПустаяСсылка();
		
		Артикул = ТекСтр.sku;   // или offer_id??? 
		ШК = "";
		Наименование = ТекСтр.name;
		Ном = НайтиПОШКМатрица2(ШК,Артикул,Контрагент);
		Кол = ТекСтр.quantity;
		Цена = ТекСтр.price;
		
		Если Ном = Справочники.Номенклатура.ПустаяСсылка() ТОгда
			//Ошибки.Добавить("Для РНК "+ДокОбъект.Номер+" не найдена номенклатура. "+наименование+" "+кол+" шт." );
			КритическиеОшибкиОзон.Добавить("Для заказа "+номерзаказа+" Не найдена номенклатура "+Наименование+", артикул -" + артикул+ " количество - "+кол+ "   цена - "+цена );
			
			//	сообщить("Для заказа "+номерзаказа+" Не найдена номенклатура "+Наименование+", артикул -" + артикул+ " количество - "+кол+ "   цена - "+цена );
			продолжить;
		КонецЕсли;	
		
		Если кол >0 Тогда
			Нов = ДокОбъект.Товары.Добавить();
			Нов.Номенклатура = Ном;
			Нов.Количество = кол;
			Нов.Заявка = кол;
			Нов.ПодтвержденнаяЗаявка = кол;
			Нов.Цена = цена;
			ПриИзмененииНоменклатурыТабЧасти(Нов, ДокОбъект);
			РассчитатьСуммуТабЧасти(Нов, ДокОбъект);
			
		КонецЕсли;	
		
	КонецЦикла;
	
	
	ПересчетТЧ(ДокОбъект,"Товары",ДокОбъект.Валюта,ДокОбъект.Валюта,ДокОбъект.Курс,ДокОбъект.Курс,Истина);
	//ДокОбъект.ПолучитьФорму("ФормаДокумента").Открыть();;
	
	Если ДокОбъект.Товары.Количество() = 0 тогда
		возврат;
	конецЕсли;	
	
	
	Попытка
		ДокОбъект.Записать(режимЗаписиДокумента.запись);
		// записать ШК, для листов набора.
		//  		 "barcodes": {
		//  "upper_barcode": "%101%168789800",
		//  "lower_barcode": "17736565768000"
		//}
		
		// их еще нет в этот момент.
		
		ЗаписьВРег=РегистрыСведений.РеквизитыДокументов.СоздатьМенеджерЗаписи();
		ЗаписьВРег.Документ=ДокОбъект.Ссылка;
		ЗаписьВРег.ИмяРеквизита="ИнтернетЗаказ";
		//	ЗаписьВРег.Период=ДокОбъект.Ссылка.Дата;
		ЗаписьВРег.ЗначениеРеквизита="Да";
		ЗаписьВРег.Записать();
		
		ШкЗаписаны = истина;					  
		Если  СтруктураЗаказа.barcodes <> Неопределено тогда
			ЗаписьВРег=РегистрыСведений.РеквизитыДокументов.СоздатьМенеджерЗаписи();
			ЗаписьВРег.Документ=ДокОбъект.Ссылка;
			ЗаписьВРег.ИмяРеквизита="ВерхнийШКЭтикетки";
			//	ЗаписьВРег.Период=ДокОбъект.Ссылка.Дата;
			ЗаписьВРег.ЗначениеРеквизита=СтруктураЗаказа.barcodes.upper_barcode;
			ЗаписьВРег.Записать();
			
			ЗаписьВРег=РегистрыСведений.РеквизитыДокументов.СоздатьМенеджерЗаписи();
			ЗаписьВРег.Документ=ДокОбъект.Ссылка;
			ЗаписьВРег.ИмяРеквизита="НижнийШКЭтикетки";  // его использовать для ЛН, в верхнем лишние знаки
			//	ЗаписьВРег.Период=ДокОбъект.Ссылка.Дата;
			ЗаписьВРег.ЗначениеРеквизита=СтруктураЗаказа.barcodes.lower_barcode;
			ЗаписьВРег.Записать();
			
			ЗаписьВРег=РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьМенеджерЗаписи();
			ЗаписьВРег.Документ=ДокОбъект.Ссылка;
			ЗаписьВРег.ИмяРеквизита="НижнийШКЭтикетки";  // его использовать для ЛН, в верхнем лишние знаки
			//	ЗаписьВРег.Период=ДокОбъект.Ссылка.Дата;
			ЗаписьВРег.ЗначениеРеквизита=СтруктураЗаказа.barcodes.lower_barcode;
			ЗаписьВРег.Записать();
			// нечаева 05,02,21-+++
			Если  СтруктураЗаказа.barcodes.lower_barcode ="0" Тогда
				// перезаписать шк
				
				КритическиеОшибкиОзон2.Добавить("Заказ "+ДокОбъект.Ссылка+"нулевой ШК!");
				СообщитьКритОшибки();
				КритическиеОшибкиОзон2.очистить();
				ШкЗаписаны=ложь;
				
			КонецЕсли;	
				
			
			попытка 
				ЗаписьВРег=РегистрыСведений.ИнформацияШКЛН_FBS.СоздатьМенеджерЗаписи();
				ЗаписьВРег.ШК=Строка(СтруктураЗаказа.barcodes.lower_barcode);
				ЗаписьВРег.ШКЛистаНабора=Строка(СтруктураЗаказа.barcodes.lower_barcode);
				ЗаписьВРег.год = НачалоГода(ТекущаяДата());
				ЗаписьВРег.накладная = ДокОбъект.Ссылка;
				ЗаписьВРег.НомерНакладной = ДокОбъект.Номер; 
				ЗаписьВРег.Записать();
			исключение
				// сообщить(ОписаниеОшибки());
				КритическиеОшибкиОзон2.Добавить("Заказ "+ДокОбъект.Ссылка+"не записаны ШК!"+ОписаниеОшибки());
				СообщитьКритОшибки();
				КритическиеОшибкиОзон2.очистить();
				ШкЗаписаны=ложь;
				
			конецпопытки;
			
		Иначе
			
			КритическиеОшибкиОзон2.Добавить("Заказ "+ДокОбъект.Ссылка+"не записаны ШК!");
			СообщитьКритОшибки();
			КритическиеОшибкиОзон2.очистить();
			ШкЗаписаны=ложь;
		КонецЕсли;
		
		
		
		//Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
		//Сообщить("Записан документ - "+ДокОбъект.Дата+" "+ДокОбъект.Номер);
	Исключение
		КритическиеОшибкиОзон2.Добавить("Заказ "+ДокОбъект.Ссылка+"не записаны ШК!"+ОписаниеОшибки());
		СообщитьКритОшибки();
		КритическиеОшибкиОзон2.очистить();
		ШкЗаписаны=ложь;
		
		Инфо = ИнформацияОбОшибке();
		Если Найти(Инфо.Описание, "Не уникальный номер документа") > 0 Тогда
			ОбновитьНумерациюОбъектов();
			УстановитьНомерДокумента2(ЭтотОбъект);
			Попытка
				ДокОбъект.Записать(режимЗаписиДокумента.Запись);
				Файлы.Добавить("Создан документ: "+ДокОбъект.Дата+" "+ДокОбъект.Номер+", склад: "+ДокОбъект.Склад+".");
				//	СообщитьМенеджеру(ДокОбъект);  //+++
				
				
				//-------------------------------
				Статус = "awaiting_packaging";
				
				ИмСпр = Справочники.СостояниеНакладнойУКлиента.НайтиПоНаименованию(статус);				
				// запишем в регистр СостояниеНакладнойУКлиента
				Если имСпр = справочники.СостояниеНакладнойУКлиента.ПустаяСсылка() тогда
					//сообщить(".......не найдено - "+статус);
					//продолжить;
				КонецЕсли;	
				МенеджерЗаписи = РегистрыСведений.СостояниеНакладнойУКлиента.СоздатьМенеджерЗаписи();
				
				МенеджерЗаписи.Объект = ДокОбъект.ссылка;
				МенеджерЗаписи.Дата = ТекущаяДата();
				МенеджерЗаписи.СостояниеУклиента = ИмСпр;
				
				МенеджерЗаписи.Записать();
				
				
			Исключение
				Если ПризКр=0 тогда
					//КритичОшибки.Добавить("После обновления нумерации для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
				конецЕсли;
			КонецПопытки;
		Иначе	
			Если ПризКр=0 тогда
				//КритичОшибки.Добавить("Для заказа Заказ из ECODE №"+НомерЗаказа+".  Контрагент -"+Контрагент +". ПунктДоставки - "+ПунктДоставки+" документ не записан! "+ОписаниеОшибки() );
			конецЕсли;
		КонецЕсли;
		
	КонецПопытки;
	#если клиент тогда	
		сообщить(ДокОбъект.Номер);
	#конецЕсли	
	
	//	сообщить(ДокОбъект.Номер);
	//СообщитьМенеджеру(ДокОбъект);  //+++
	//Если  КритическиеОшибкиОзон.количество()>0 Тогда
	//	СообщитьМенеджеруОзон(ДокОбъект);
	//КонецЕсли; 
	//Ошибки.Очистить();
	
	// проведем документ и сразу отправим на склад.
	
	НакладнаяСсылка		=ДокОбъект;
	ВидНакладной		=НакладнаяСсылка.Метаданные().Имя;
	ТипУзла=ПараметрыСеанса.ЭтотУзел.ТипУзла;
	
	попытка
		если ЗначениеЗаполнено(НакладнаяСсылка.ТипДоставки) тогда
			ТекТипДоставки=НакладнаяСсылка.ТипДоставки;
		иначе
			ТекТипДоставки=НакладнаяСсылка.ПунктДоставки.ТипДоставки;
		КонецЕсли;
	Исключение
		ТекТипДоставки=НакладнаяСсылка.ПунктДоставки.ТипДоставки;
	КонецПопытки;
	
	
	НакладнаяОбъект=ДокОбъект;
	// комплектующие заполним.
	
	//--------------------------------------------------------------------------------------
	//заполним комплектующие.
	
	
	ДокОбъект.Комплектующие.Очистить();
	
	Для Каждого СтрокаТоваров Из ДокОбъект.Товары Цикл	
		
		Если СтрокаТоваров.Количество = 0 Тогда 
			Продолжить 
		КонецЕсли; 
		
		Номенклатура = СтрокаТоваров.Номенклатура;
		
		Если Номенклатура.Коплектующие.Количество() > 0 Тогда
			// комплект
			Для Каждого СтрокаКомплекта Из Номенклатура.Коплектующие Цикл
				Если СтрокаКомплекта.Количество = 0 Тогда 
					Продолжить 
				КонецЕсли; 
				
				СтрокаТЧ = ДокОбъект.Комплектующие.Добавить();	
				
				СтрокаТЧ.Продукция		= Номенклатура;
				СтрокаТЧ.Номенклатура	= СтрокаКомплекта.Номенклатура;
				
				ПриИзмененииНоменклатурыТабЧасти(СтрокаТЧ, ЭтотОбъект);
				
				СтрокаТЧ.Единица		= СтрокаКомплекта.Единица;
				СтрокаТЧ.Коэффициент	= СтрокаКомплекта.Коэффициент;
				СтрокаТЧ.Количество		= СтрокаКомплекта.Количество * СтрокаТоваров.Количество * СтрокаТоваров.Коэффициент; // и разделить на СтрокаКомплекта.Коэффициент?
				РассчитатьСуммуТабЧасти(СтрокаТЧ, ДокОбъект);
				
				ДокОбъект.ОтгрузкаКомплектов =истина;
			КонецЦикла; 
		Иначе			
			// обычный товар
			СтрокаТЧ = ДокОбъект.Комплектующие.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаТоваров);
			СтрокаТЧ.Продукция = Номенклатура;
		КонецЕсли;
		
	КонецЦикла;	
	//нечаева 02,02,21
	Если НЕ ДокОбъект.ОтгрузкаКомплектов =истина Тогда
		ДокОбъект.Комплектующие.Очистить();
	КонецЕсли;	
	// нечаева 02,02,21 ---
	попытка
		ДокОбъект.Записать();
	исключение
		КритическиеОшибкиОзон2.Добавить("Заказ "+ДокОбъект.НомерЗаказа+" не записан!");
		КритическиеОшибкиОзон2.Добавить(""+ОписаниеОшибки());
		
		СообщитьКритОшибки();
		КритическиеОшибкиОзон2.очистить();
		ШкЗаписаны=ложь;
		
		
	конецпопытки;
	//	возврат;
	
	
	
	//---------------------------------------------------------------------------------------
	
	ТабОстатков = ПолучитьОстатокТовара(ДокОбъект.Комплектующие.Выгрузитьколонку("Номенклатура"));
	// проверим по остаткам.
	хватает = 1;
	ДЛя  каждого ТекСтрока из  ДокОбъект.Комплектующие цикл
		
		колОст = 0;
		НайденнаяСтрока = ТабОстатков.Найти(ТекСтрока.Номенклатура,"Номенклатура");
		Если НайденнаяСтрока <> Неопределено ТОгда
			КолОст=НайденнаяСтрока.КолКонФакт; 
		Иначе
			колОст = 0;
		КонецЕсли;
		
		Если КолОст - Текстрока.Количество<0 ТОгда
			хватает =0;
			прервать;
		КонецЕсли;	
		
	конецЦикла;
	// Если не хватает товара, то не проводим и не сбрасываем на склад. Будут сбрасывать вручную
	Если Не Хватает Тогда
		
		Ошибки.Добавить("Для РНК "+ДокОбъект+" Не хватает номенклатуры на остатках. Документ не проведен и не сброшен на склад!");
		
		СообщитьМенеджеру(ДокОбъект);  //+++
		//Если  КритическиеОшибкиОзон.количество()>0 Тогда
		//	СообщитьМенеджеруОзон(ДокОбъект);
		//	 КритическиеОшибкиОзон.очистить();
		//КонецЕсли; 
		Ошибки.Очистить();
		
		возврат;
		
	конецЕсли;
	
	
	// сбросим на склад, если все есть на остатках
	
	Если ЗначениеНеЗаполнено(НакладнаяОбъект.ДатаВыгрузки) Тогда
		НакладнаяОбъект.ДатаВыгрузки=ТекущаяДата();			
	КонецЕсли; 
	НакладнаяОбъект.СостояниеНакладной=Перечисления.СостоянияНакладной.КОтправкеНаСклад; 		
	
	
	если НакладнаяСсылка.метаданные().имя = "РасходнаяНакладная"  или НакладнаяСсылка.метаданные().имя = "Перемещение"  тогда
		НакладнаяОбъект.дата=ТекущаяДата();
		//НакладнаяОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		попытка
			НакладнаяОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		исключение
			КритическиеОшибкиОзон2.Добавить("Заказ "+ДокОбъект.НомерЗаказа+" не проведен и не сброшен на склад!");
			КритическиеОшибкиОзон2.Добавить(""+ОписаниеОшибки());
			
			СообщитьКритОшибки();
			КритическиеОшибкиОзон2.очистить();
			ШкЗаписаны=ложь;
			
			
		конецпопытки;

		
	КонецЕсли;
		
	
	// если не собрали - соберем.
	СобратьЗаказыОзон(НакладнаяОбъект);
	
	
	
	СообщитьМенеджеру(ДокОбъект);  //+++
	Если  КритическиеОшибкиОзон.количество()>0 Тогда
		СообщитьМенеджеруОзон(ДокОбъект);
		КритическиеОшибкиОзон.очистить();
	КонецЕсли; 
	Ошибки.Очистить();
	
	
	
	// попробуем еще раз получить ШК
	попытка
		Если   ШкЗаписаны=ложь Тогда
			
			ИнфоОбОтправлении(ДокОбъект.НомерЗаказа,ДокОбъект.Ссылка);
			
		КонецЕсли;	
	Исключение
	конецПопытки;
	
	
	
	
	
	
КонецПРоцедуры	


Процедура ИнфоОбОтправлении(НомерОтправления,ТекДок)
	
	//статусы отправлений
	
	//	awaiting_packaging — ожидает упаковки,
	//not_accepted — не принят в сортировочном центре,
	//arbitration — ожидает решения спора,
	//awaiting_deliver — ожидает отгрузки,
	//delivering — доставляется,
	//driver_pickup — у водителя,
	//delivered — доставлено,
	//cancelled — отменено.
	//	
	
	//	Host: api-seller.ozon.ru
	//Client-Id: 836
	//Api-Key: 0296d4f2-70a1-4c09-b507-904fd05567b9
	//Content-Type: application/json
	
	//{
	//    "posting_number": "13076543-0001-1"
	//}
	
	
	
	РНК = ТекДок;
	
	// получение списка отправлений за день.
	команда = 1;
	//POSTЗапросИз1С(Команда);  // старая проба
	
	Команда = "/v2/posting/fbs/get";  // считывает заказы с сайта
	ТелоДЖ = "";
	
	Контрагент=справочники.Контрагенты.НайтиПоКоду("SSP-4991");
	
	// Попытка         
	//    УдалитьФайлы("D:\temp\","pills.json");
	//Исключение
	//    Сообщить(ОписаниеОшибки());
	//КонецПопытки;
	
	ИмяВыходногоФайлаДЖ = ПолучитьИмяВременногоФайла(".json");
	сообщить(ИмяВыходногоФайлаДж);
	
	
	Запись = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( ,Символы.Таб);
	Запись.ОткрытьФайл(ИмяВыходногоФайлаДЖ,,,ПараметрыЗаписиJSON);
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата; //ЛокальнаяДата;      "2020-10-31T21:00:00Z",
	
	
	//	Текдата1 = Формат(НачалоМесяца(ТекущаяДата()),"ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс'.000Z'"""); // время просят с миллисекундами
	//	Текдата2 = Формат(ТекущаяДата(),"ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс'.000Z'"""); 
	
	СтрПРо= Новый Структура;
	
	
	//	Текдата1 = Формат(НачалоДня(ТекущаяДата()),"ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс'.000Z'""");  // 2020-10-31T21:00:00Z07:00\
	
	Данные = Новый Структура;
	Данные.Вставить("posting_number",НомерОтправления);
	
	ШК = Новый Структура;
	ШК.Вставить("barcodes",true);
	
	// это структуру добавили
	Данные.Вставить("with",ШК);
	
	
	Попытка
		ЗаписатьJSON(Запись, Данные, НастройкиСериализации);
		Запись.Закрыть();
		// Возврат Истина;
	Исключение
		сообщить(ОписаниеОшибки());
		// ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Ошибка,,,"Прайс не сформирован, произошла ошибка " + ОписаниеОшибки());
		//  Возврат Ложь;
	КонецПопытки;;  
	
	
	// выполнение пост запроса.
	//-------------------------------
	Результат = POSTЗапросИз1С(Команда,ИмяВыходногоФайлаДЖ) ;    // ИмяВыходногоФайла?
	//-------------------------------
	р2=Результат.ПолучитьТелоКакСтроку();
	ИмяВыхОтвет=результат.ПолучитьИмяФайлаТела();
	//Сообщить(ИмяВыхОтвет);
	
	// можно отсюда обрабатывать
	Текст = Новый ТекстовыйДокумент;
	Текст.УстановитьТекст(Результат.ПолучитьТелоКакСтроку());
	//	сообщить(р2);
	
	
	// 2 вариант для обработки, так проще.
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку());
	
	Данные = ПрочитатьJSON(ЧтениеJSON, Ложь); // тут в структуру все выгружено
	//сообщить(Данные);
	
	
	Если НЕ РНК.пустая() Тогда
		
		попытка 
			ЗаписьВРег=РегистрыСведений.ИнформацияШКЛН_FBS.СоздатьМенеджерЗаписи();
			ЗаписьВРег.ШК=Строка(Данные.result.barcodes.lower_barcode);
			ЗаписьВРег.ШКЛистаНабора=Строка(Данные.result.barcodes.lower_barcode);
			ЗаписьВРег.год = НачалоГода(ТекущаяДата());
			ЗаписьВРег.накладная = РНК.Ссылка;
			ЗаписьВРег.НомерНакладной = РНК.Номер; 
			ЗаписьВРег.Записать();
		исключение
			// сообщить(ОписаниеОшибки());
		конецпопытки;
		
		попытка
			ЗаписьВРег=РегистрыСведений.РеквизитыРНКПНКПРМ.СоздатьМенеджерЗаписи();
			ЗаписьВРег.Документ= РНК.Ссылка;
			ЗаписьВРег.ИмяРеквизита="НижнийШКЭтикетки"; 
			ЗаписьВРег.ЗначениеРеквизита=Строка(Данные.result.barcodes.lower_barcode);;
			ЗаписьВРег.Записать();
		исключение
		конецпопытки;
		
	КонецЕсли;	
	
	
	
	
	
КонецПроцедуры




//*****************************************************************************

//нечаева 14,01,20+++
Функция ПолучитьАртикулыМатрицы(ДокОбъект)
	
	
	// для договоров не по матрице
	Попытка
		Если ДокОбъект.Договор.НеИспользоватьМатрицу Тогда
			НеИспользоватьМартицуПоДоговору=Истина;
		иначе
			НеИспользоватьМартицуПоДоговору=ложь;
		КонецЕсли;	
	Исключение
		НеИспользоватьМартицуПоДоговору=ложь;
	конецПопытки;
	ТЗ = новый ТаблицаЗначений;
	Тз.Очистить();
	
	Ссылка = ДокОбъект.ссылка;
	Попытка
		Если ДокОбъект.контрагент.ИспользоватьНоменклатурнуюМатрицу и не НеИспользоватьМартицуПоДоговору Тогда
			// проверяем по какому типу расчитывать цену - с учетом договора или нет(если по договору не найдено). 
			//Запрос = Новый Запрос;
			//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			//|	Матрица.Ссылка КАК Ссылка1
			//|ИЗ
			//|	Документ.Матрица КАК Матрица
			//|ГДЕ
			//|	Матрица.Контрагент = &Контрагент
			//|	И Матрица.Дата <= &Дата1
			//|	И Матрица.ДатаОкончания >= &Дата2
			//|	И Матрица.Договор = &Договор
			//|	И Матрица.Проведен = истина
			//|АВТОУПОРЯДОЧИВАНИЕ";
			
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Матрица.Ссылка КАК Ссылка1
			|ИЗ
			|	Документ.Матрица.ПунктыДоставки КАК Матрица
			|ГДЕ
			|	Матрица.Ссылка.Контрагент = &Контрагент
			|	И Матрица.Ссылка.Дата <= &Дата1
			|	И Матрица.Ссылка.ДатаОкончания >= &Дата2
			|	И Матрица.Ссылка.Договор = &Договор
			|	И Матрица.Ссылка.Проведен = ИСТИНА
			|	И Матрица.ПунктДоставки = &ПДИМ
			|АВТОУПОРЯДОЧИВАНИЕ";
			
			
			Запрос.УстановитьПараметр("Дата2",НачалоДня(ДокОбъект.дата));
			Запрос.УстановитьПараметр("Дата1",КонецДня(ДокОбъект.дата));
			Запрос.УстановитьПараметр("Контрагент",ДокОбъект.Контрагент);
			Запрос.УстановитьПараметр("Договор",ДокОбъект.Договор);
			Запрос.УстановитьПараметр("ПДИМ",Справочники.ПунктыДоставки.НайтиПоКоду("SNL-024031"));  // фбс озон
			
			ТЗЕстьМатрицаПоДоговору = Запрос.Выполнить().Выгрузить();
			
			
			//запрос на получение
			Запрос=Новый Запрос;
			Запрос.Текст=
			"ВЫБРАТЬ
			|	МатрицаТовары.Номенклатура КАК Номенклатура,
			|	МатрицаТовары.ШККонтрагента КАК ШККонтрагента,
			|	МатрицаТовары.АртикулКонтрагента КАК АртикулКонтрагента,
			|	МатрицаТовары.Ссылка КАК Ссылка,
			|	МатрицаТовары.НаименованиеКонтрагента КАК НаименованиеКонтрагента,
			|	МатрицаТовары.Кратность КАК Кратность,
			|	МатрицаТовары.ШККонтрагентаБлочок КАК ШККонтрагентаБлочок,
			|	МатрицаТовары.ШКСпайки КАК ШКСпайки
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|ГДЕ
			|	МатрицаТовары.Ссылка.Дата <= &Дата1
			|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
			|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
			|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА
			|	И МатрицаТовары.Ссылка В ИЕРАРХИИ(&спМатриц)";
			
			
			Если ТЗЕстьМатрицаПоДоговору.Количество()>0 Тогда
				ЕстьМатрицаПоДоговору = истина;
				//с учетом договора
				Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.Договор = &Договор";
				
			иначе
				ЕстьМатрицаПоДоговору = ложь;
			КонецЕсли;
			
			Попытка
				Если Ссылка.ПостояннаяАкция Тогда
					Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
					//постоянные акции только под галку
				Иначе
					Запрос.Текст = Запрос.Текст +" И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция";
					
				КонецЕсли;
			Исключение
			КонецПопытки;	
			Запрос.Текст = Запрос.Текст +"	
			|УПОРЯДОЧИТЬ ПО
			|	МатрицаТовары.Ссылка.Дата УБЫВ
			|АВТОУПОРЯДОЧИВАНИЕ";
			
			Запрос.УстановитьПараметр("Контрагент",ДокОбъект.Контрагент);
			Запрос.УстановитьПараметр("Договор",ДокОбъект.Договор);
			Запрос.УстановитьПараметр("Дата1",КонецДня(ДокОбъект.Дата));
			Запрос.УстановитьПараметр("ТекДата",ДокОбъект.Дата);
			Запрос.УстановитьПараметр("спМатриц",ТЗЕстьМатрицаПоДоговору);
			
			
			тз1 = Запрос.Выполнить().Выгрузить();
			
			Возврат ТЗ1;
			
		КонецЕсли;
	исключение
		Возврат ТЗ;
	конецПопытки;	
	
	возврат ТЗ; //пустая таблица
	
КонецФункции
// нечаева 14,01,20--


Функция POSTЗапросИз1С_Отправка(Команда,ТелоДж)
	
	
	// это продуктив пароли
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//НашКлючАдмин = "*#*#*#";
	НашКлючАдмин = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииОзонТокен).Токен;
	// Ихсанов Д. А. Конец  14.10.2025
	КлиентИД = 44219;
	
	// тестовые пароли
	//КлиентИД = 836;                                                    
	//НашКлючАдмин ="*#*#*#";
	//////
	
	Лимит = 10;
	
	ИмяВыходногоФайла = ПолучитьИмяВременногоФайла(".json");
	
	//ДатаНачала =Формат(НачалоДня(Дата1),"ДФ=""гггг-ММ-дд""");
	//ДатаКонца = Формат(КонецДня(Дата2),"ДФ=""гггг-ММ-дд""");
	
	//АдресТ = "cb-api.ozonru.me"	; // тестовый сервер
	АдресТ = "api-seller.ozon.ru"	; // продуктив
	попытка                          
		Соединение = Новый HTTPСоединение(АдресТ,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);  
	исключение
		#Если клиент Тогда
			Сообщить(ОписаниеОшибки());
		#КонецЕсли 
	конецПопытки;
	
	HTTP_запрос = новый HTTPзапрос();
	HTTP_запрос.АдресРесурса = Команда;
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json");
	ЗаголовокHTTP.Вставить("Accept", "text/xml");
	ЗаголовокHTTP.Вставить("Accept-Language", "ru");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("Content-Language", "ru");
	ЗаголовокHTTP.Вставить("Content-Charset", "utf-8");
	// потмо изменить
	ЗаголовокHTTP.Вставить("Host", АдресТ); //"https://seller-api.sc.prod.s.o3.ru/v1/categories/tree?language=DEFAULT");
	ЗаголовокHTTP.Вставить("Client-Id", КлиентИД);
	ЗаголовокHTTP.Вставить("Api-Key", НашКлючАдмин );	
	//Host: api-seller.ozon.ru
	
	
	HTTP_запрос.Заголовки = ЗаголовокHTTP;
	//	ТелоДЖ="C:\Users\nechaeva\AppData\Local\Temp\8\123.json";  - так работает , на работчем столе лежит
	//HTTP_запрос.УстановитьТелоИзСтроки(ТелоДЖ,,ИспользованиеByteOrderMark.НеИспользовать);
	HTTP_запрос.УстановитьИмяФайлаТела(ТелоДЖ);
	
	
	Попытка
		//Отправляем для обрааботки на наш сервер
		Ответ = Соединение.ОтправитьДляОбработки(HTTP_запрос);  // ИмяВыходногоФайла
		
	Исключение
		#Если клиент Тогда
			Сообщить(ОписаниеОшибки());
		#КонецЕсли   
	КонецПопытки;
	Соединение.ОтправитьДляОбработки(HTTP_запрос,ИмяВыходногоФайла);
	//	Сообщить(ИмяВыходногоФайла);
	
	возврат Ответ;
	
	//--------------------------------------------------------------------------------------------------------------------------------
	
	
КонецФункции

// переводим на сборку заказы
Процедура СобратьЗаказыОзон(Накладная)
	
	//	шпаргалка
	
	//	 POST /v2/posting/fbs/ship HTTP/1.1
	//Host: api-seller.ozon.ru
	//Client-Id: 836
	//Api-Key: 0296d4f2-70a1-4c09-b507-904fd05567b9
	//Content-Type: application/json
	
	//{
	//    "packages": [
	//        {
	//        "items": [
	//            {
	//                "quantity": 3,
	//                "sku": 123065
	//            }
	//        ]
	//        }
	//    ],
	//    "posting_number": "13076543-0001-1"
	//}
	//Пример ответа:
	
	//{
	//  "result": [
	//    "29750371-0013-1"
	//  ]
	//}
	
	// получение списка отправлений за день.
	команда = 1;
	//POSTЗапросИз1С(Команда);  // старая проба
	
	Команда = "/v2/posting/fbs/ship";  // считывает заказы с сайта
	ТелоДЖ = "";
	
	Контрагент=справочники.Контрагенты.НайтиПоКоду("SSP-4991");
	
	// Попытка         
	//    УдалитьФайлы("D:\temp\","pills.json");
	//Исключение
	//    Сообщить(ОписаниеОшибки());
	//КонецПопытки;
	
	ИмяВыходногоФайлаДЖ = ПолучитьИмяВременногоФайла(".json");
	//	сообщить(ИмяВыходногоФайлаДж);
	
	//{ ответ
	//    "packages": [
	//        {
	//        "items": [
	//            {
	//                "quantity": 3,
	//                "sku": 123065
	//            }
	//        ]
	//        }
	//    ],
	//    "posting_number": "13076543-0001-1"
	//}
	
	
	Запись = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( ,Символы.Таб);
	Запись.ОткрытьФайл(ИмяВыходногоФайлаДЖ,,,ПараметрыЗаписиJSON);
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата; //ЛокальнаяДата;      "2020-10-31T21:00:00Z",
	
	//	Текдата1 = Формат(НачалоМесяца(ТекущаяДата()),"ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс'.000Z'"""); // время просят с миллисекундами
	//	Текдата2 = Формат(ТекущаяДата(),"ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс'.000Z'"""); 
	
	ДокДляОтправки = Накладная; //документы.РасходнаяНакладная.НайтиПоНомеру("SSPб-52132",НачалоГода(Текущаядата()));
	
	// это массив товаров из РНК, всегда считаем что одно отправление
	Товары = Новый Массив;
	
	тз1 = ПолучитьАртикулыМатрицы(ДокДляОтправки);
	
	Для КАждого Текстрока из ДокДляОТправки.Товары цикл
		
		Если Текстрока.Количество>0 Тогда
			
			// получим артикул из матрицы
			
			АртикулКонтрагента = "";
			НайденнаяСтрока = тз1.Найти(ТекСтрока.Номенклатура,"Номенклатура");
			Если НайденнаяСтрока <> Неопределено ТОгда
				
				АртикулКонтрагента = НайденнаяСтрока.АртикулКонтрагента;
				НаименованиеКонтрагента = НайденнаяСтрока.НаименованиеКонтрагента;
				Кратность = Число(НайденнаяСтрока.Кратность);
				
			Иначе
				#Если клиент Тогда	
					Сообщить("В номенклатурной матрице не найдена номенклатура "+ТекСтрока.Номенклатура);
				#конецесли 
				Ошибка = 1;
				
			КонецЕсли;
			
			СтрПРо= Новый Структура;
			СтрПро.Вставить("quantity",ТекСтрока.Количество);    //ТекДата1);
			СтрПро.Вставить("sku",АртикулКонтрагента);  // ожидает отгрузки
			
			Товары.Добавить(СтрПРо);
		КонецЕсли;
		
	КонецЦикла;
	
	Итемс = Новый Структура;
	Итемс.Вставить("items",Товары);
	
	СпТ = Новый Массив;
	СпТ.Добавить(Итемс); 
	
	//Текдата1 = Формат(НачалоДня(ТекущаяДата()),"ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс'.000Z'""");  // 2020-10-31T21:00:00Z07:00\
	
	Данные = Новый Структура;
	Данные.Вставить("packages",СпТ);    //ТекДата1);
	Данные.Вставить("posting_number",ДокДляОтправки.НомерЗаказа);  // ожидает отгрузки
	
	Попытка
		ЗаписатьJSON(Запись, Данные, НастройкиСериализации);
		Запись.Закрыть();
		// Возврат Истина;
	Исключение
		#Если клиент Тогда	
			сообщить(ОписаниеОшибки());
		#конецесли 
		// ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Ошибка,,,"Прайс не сформирован, произошла ошибка " + ОписаниеОшибки());
		//  Возврат Ложь;
	КонецПопытки;;  
	
	//   возврат;
	//--------------------------------------------------------------------------------------------
	// выполнение пост запроса.
	//-------------------------------
	Результат = POSTЗапросИз1С_Отправка(Команда,ИмяВыходногоФайлаДЖ) ;    // ИмяВыходногоФайла?
	//-------------------------------
	р2=Результат.ПолучитьТелоКакСтроку();
	ИмяВыхОтвет=результат.ПолучитьИмяФайлаТела();
	//Сообщить(ИмяВыхОтвет);
	
	// можно отсюда обрабатывать
	Текст = Новый ТекстовыйДокумент;
	Текст.УстановитьТекст(Результат.ПолучитьТелоКакСтроку());
	//сообщить(р2);
	
	// 2 вариант для обработки, так проще.
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку());
	
	Данные = ПрочитатьJSON(ЧтениеJSON, Ложь); // тут в структуру все выгружено
	// сообщить(Данные);
	Попытка 
		Если Данные.error<>неопределено тогда
			#Если клиент Тогда	
				Если  Данные.error.message<> "POSTING_ALREADY_SHIPPED" Тогда
					сообщить(" "+Данные.error.message+". Обратитесь в ИТ отдел. Ошибка перевода заказа ИМ на сборку.");
					
					КритическиеОшибкиОзон2.Добавить(" "+Данные.error.message+". Обратитесь в ИТ отдел. Ошибка перевода заказа ИМ на сборку.");
					//КритическиеОшибкиОзон2.Добавить(""+ОписаниеОшибки());
					
					СообщитьКритОшибки();
					КритическиеОшибкиОзон2.очистить();
					
								
					возврат;
				Иначе
					сообщить("Заказ уже передан на сборку");
				КонецЕсли;
				
				Если  Данные.error.message = "HAS_INCORRECT_PRODUCT_QUANTITY" Тогда
					сообщить("Ошибка в артикуле или количестве по заказу. Просьба проверить матрицу! Заказ не передан на сборку");
				
					КритическиеОшибкиОзон2.Добавить("Ошибка в артикуле или количестве по заказу. Просьба проверить матрицу! Заказ не передан на сборку");
					//КритическиеОшибкиОзон2.Добавить(""+ОписаниеОшибки());
					
					СообщитьКритОшибки();
					КритическиеОшибкиОзон2.очистить();
					
				
					возврат;
				КонецЕсли;	
				
				
			#конецесли 
		КонецЕсли;	 
		
	исключение
		
	конецПопытки;
	
	Попытка 
		Если Данные.result<>неопределено тогда
			#Если клиент Тогда	
				сообщить("Заказ ИМ передан на сборку.");
			#конецесли 
			// тут нужно получить ШК этикеток, это мы будем получать в обработке загрузки по статусу, тут нет смысла перебирать. 
			СформироватьЭтикеткуОзон(ДокДляОтправки);
			//нечаева 28,12,20+++
			//запишем смену статуса
			попытка
				статус = "awaiting_deliver";
				ИмСпр = Справочники.СостояниеНакладнойУКлиента.НайтиПоНаименованию(статус);				
				// запишем в регистр СостояниеНакладнойУКлиента
				Если имСпр = справочники.СостояниеНакладнойУКлиента.ПустаяСсылка() тогда
					//сообщить(".......не найдено - "+статус);
					возврат;
				КонецЕсли;	
				МенеджерЗаписи = РегистрыСведений.СостояниеНакладнойУКлиента.СоздатьМенеджерЗаписи();
				
				МенеджерЗаписи.Объект = ДокДляОтправки.ссылка;
				МенеджерЗаписи.Дата = ТекущаяДата();
				МенеджерЗаписи.СостояниеУклиента = ИмСпр;
				
				МенеджерЗаписи.Записать();
				
			исключение
			конецпопытки;	 
			//нечаева 28,12,20---
			
			
			возврат;		 
		КонецЕсли;	 
		
	исключение
		 	КритическиеОшибкиОзон2.Добавить("Заказ "+ДокОбъект.НомерЗаказа+" не передан на сборку!");
			КритическиеОшибкиОзон2.Добавить(""+ОписаниеОшибки());
			
			СообщитьКритОшибки();
			КритическиеОшибкиОзон2.очистить();
					
	конецПопытки;
	
	СформироватьЭтикеткуОзон(ДокДляОтправки);
	
	
КонецПроцедуры
//Нечаева 15,02,20 ---


// нечаева 21,12,20+++
Функция ФайлЭтикеткиИз1С(Команда,ТелоДж)
	
	
	// это продуктив пароли
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//НашКлючАдмин = "*#*#*#";
	НашКлючАдмин = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииОзонТокен).Токен;
	// Ихсанов Д. А. Конец  14.10.2025
	КлиентИД = 44219;
	
	// тестовые пароли
	//КлиентИД = 836;                                                    
	//НашКлючАдмин ="*#*#*#";
	//
	
	Лимит = 10;
	
	ИмяВыходногоФайла = ПолучитьИмяВременногоФайла(".pdf");
	
	//ДатаНачала =Формат(НачалоДня(Дата1),"ДФ=""гггг-ММ-дд""");
	//ДатаКонца = Формат(КонецДня(Дата2),"ДФ=""гггг-ММ-дд""");
	
	//АдресТ = "cb-api.ozonru.me"	; // тестовый сервер
	АдресТ = "api-seller.ozon.ru"	; // продуктив
	попытка                          
		Соединение = Новый HTTPСоединение(АдресТ,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);  
	исключение
		//Сообщить(ОписаниеОшибки());
	конецПопытки;
	
	HTTP_запрос = новый HTTPзапрос();
	
	HTTP_запрос.АдресРесурса = Команда;
	
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json");
	ЗаголовокHTTP.Вставить("Accept", "text/xml");
	ЗаголовокHTTP.Вставить("Accept-Language", "ru");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("Content-Language", "ru");
	ЗаголовокHTTP.Вставить("Content-Charset", "utf-8");
	// потмо изменить
	ЗаголовокHTTP.Вставить("Host", АдресТ); //"https://seller-api.sc.prod.s.o3.ru/v1/categories/tree?language=DEFAULT");
	ЗаголовокHTTP.Вставить("Client-Id", КлиентИД);
	ЗаголовокHTTP.Вставить("Api-Key", НашКлючАдмин );	
	//Host: api-seller.ozon.ru
	
	
	HTTP_запрос.Заголовки = ЗаголовокHTTP;
	
	//HTTP_запрос.УстановитьТелоИзСтроки(ТелоДЖ,,ИспользованиеByteOrderMark.НеИспользовать);
	HTTP_запрос.УстановитьИмяФайлаТела(ТелоДЖ);
	
	
	Попытка
		//Отправляем для обработки на наш сервер
		Ответ = Соединение.ОтправитьДляОбработки(HTTP_запрос);  // ИмяВыходногоФайла
		
	Исключение
		#Если клиент Тогда
			Сообщить(ОписаниеОшибки());
		#КонецЕсли   
	КонецПопытки;
	//	ответ.ПолучитьИмяФайлаТела()
	Соединение.ОтправитьДляОбработки(HTTP_запрос,ИмяВыходногоФайла);
	//Сообщить(ИмяВыходногоФайла);
	
	возврат ИмяВыходногоФайла;
	
	//--------------------------------------------------------------------------------------------------------------------------------
	
КонецФункции

Процедура Пауза(Секунды)
	
	ВремяОкончания = ТекущаяДата() + Секунды;
	Пока ТекущаяДата() <= ВремяОкончания Цикл	
	КонецЦикла;
	
КонецПроцедуры 


Функция POSTЗапросИз1С_Статус(Команда,ТелоДж,типВыхФайла=".json")
	
	
	// это продуктив пароли
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//НашКлючАдмин = "*#*#*#";
	НашКлючАдмин = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииОзонТокен).Токен;
	// Ихсанов Д. А. Конец  14.10.2025
	КлиентИД = 44219;
	////
	// тестовые пароли
	//КлиентИД = 836;                                                    
	//НашКлючАдмин ="*#*#*#";
	//
	
	Лимит = 10;
	
	ИмяВыходногоФайла = ПолучитьИмяВременногоФайла(типВыхФайла); //(".pdf");
	
	//ДатаНачала =Формат(НачалоДня(Дата1),"ДФ=""гггг-ММ-дд""");
	//ДатаКонца = Формат(КонецДня(Дата2),"ДФ=""гггг-ММ-дд""");
	
	//АдресТ = "cb-api.ozonru.me"	; // тестовый сервер
	АдресТ = "api-seller.ozon.ru"	; // продуктив
	попытка                          
		Соединение = Новый HTTPСоединение(АдресТ,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);  
	исключение
		//	Сообщить(ОписаниеОшибки());
	конецПопытки;
	
	HTTP_запрос = новый HTTPзапрос();
	
	HTTP_запрос.АдресРесурса = Команда;
	
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json");
	ЗаголовокHTTP.Вставить("Accept", "text/xml");
	ЗаголовокHTTP.Вставить("Accept-Language", "ru");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("Content-Language", "ru");
	ЗаголовокHTTP.Вставить("Content-Charset", "utf-8");
	// потмо изменить
	ЗаголовокHTTP.Вставить("Host", АдресТ); //"https://seller-api.sc.prod.s.o3.ru/v1/categories/tree?language=DEFAULT");
	ЗаголовокHTTP.Вставить("Client-Id", КлиентИД);
	ЗаголовокHTTP.Вставить("Api-Key", НашКлючАдмин );	
	//Host: api-seller.ozon.ru
	
	
	HTTP_запрос.Заголовки = ЗаголовокHTTP;
	//	ТелоДЖ="C:\Users\nechaeva\AppData\Local\Temp\8\123.json";  - так работает , на работчем столе лежит
	//HTTP_запрос.УстановитьТелоИзСтроки(ТелоДЖ,,ИспользованиеByteOrderMark.НеИспользовать);
	HTTP_запрос.УстановитьИмяФайлаТела(ТелоДЖ);
	
	
	Попытка
		//Отправляем для обрааботки на наш сервер
		Ответ = Соединение.ОтправитьДляОбработки(HTTP_запрос);  // ИмяВыходногоФайла
		
	Исключение
		#Если клиент Тогда
			Сообщить(ОписаниеОшибки());
		#КонецЕсли   
	КонецПопытки;
	//	ответ.ПолучитьИмяФайлаТела()
	Соединение.ОтправитьДляОбработки(HTTP_запрос,ИмяВыходногоФайла);
	//	Сообщить(ИмяВыходногоФайла+"  - имя ответа");
	
	возврат Ответ;
	
	//--------------------------------------------------------------------------------------------------------------------------------
	
	
	//
	
КонецФункции


функция  ПолучитьОстатокТовара(НоменклСп)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	""Остатки"" КАК Раздел,
	|	СУММА(Остатки.КоличествоКонечныйОстаток) КАК КолКонБух,
	|	ВЫБОР
	|		КОГДА СУММА(Остатки.КоличествоКонечныйОстаток) = 0
	|			ТОГДА NULL
	|		ИНАЧЕ СУММА(Остатки.СуммаКонечныйОстаток) / СУММА(Остатки.КоличествоКонечныйОстаток)
	|	КОНЕЦ КАК ЦенаСеб,
	|	СУММА(Остатки.СуммаКонечныйОстаток) КАК СебестоимостьБух,
	|	СУММА(Остатки.КоличествоКонечныйОстаток - ЕСТЬNULL(Резервы.КоличествоКонечныйОстаток, 0)) КАК КолКонФакт,
	|	СУММА(ЕСТЬNULL(Резервы.КоличествоКонечныйОстаток, 0)) КАК Резерв,
	|	Остатки.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.ОстаткиИОбороты(
	|			НАЧАЛОПЕРИОДА(&Дата1, ДЕНЬ),
	|			КОНЕЦПЕРИОДА(&дата1, ДЕНЬ),
	|			Период,
	|			,
	|			Склад В ИЕРАРХИИ (&Склады)
	|				И Номенклатура В ИЕРАРХИИ (&Ном)) КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.ОстаткиИОбороты(
	|				НАЧАЛОПЕРИОДА(&Дата1, ДЕНЬ),
	|				КОНЕЦПЕРИОДА(&дата1, ДЕНЬ),
	|				Период,
	|				,
	|				Склад В ИЕРАРХИИ (&Склады)
	|					И Номенклатура В ИЕРАРХИИ (&Ном)) КАК Резервы
	|		ПО Остатки.Номенклатура = Резервы.Номенклатура
	|			И Остатки.Склад = Резервы.Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Номенклатура";
	Склад = справочники.Склады.НайтиПоКоду("STC-81");
	
	Запрос.УстановитьПараметр("Склады",склад);
	Запрос.УстановитьПараметр("Дата1",текущаядата());
	Запрос.УстановитьПараметр("Ном",НоменклСп);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	возврат РезультатЗапроса;
	
	
	
конецФункции	

//-------------------------------------------------------
Процедура ОбновитьСтатусыЗаказов()
	
	
	Контрагент=справочники.Контрагенты.НайтиПоКоду("SSP-4991");
	
	// получение списка отправлений за день.
	//команда = 1;
	//POSTЗапросИз1С(Команда);  // старая проба
	
	Команда = "/v2/posting/fbs/get";  // считывает заказы с сайта
	ТелоДЖ = "";
	
	
	ИмяВыходногоФайлаДЖ = ПолучитьИмяВременногоФайла(".json");
	//	сообщить(ИмяВыходногоФайлаДж);
	
	
	Запись = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( ,Символы.Таб);
	Запись.ОткрытьФайл(ИмяВыходногоФайлаДЖ,,,ПараметрыЗаписиJSON);
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата; //ЛокальнаяДата;      "2020-10-31T21:00:00Z",
	
	Дата2 =ТекущаяДата();
	Дата1 = ДобавитьДату(ТекущаяДата(),-60*60*24*7);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходнаяНакладная.Ссылка КАК Ссылка,
	|	РасходнаяНакладная.НомерЗаказа КАК НомерЗаказа
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.ПометкаУдаления = &ложь
	|	И РасходнаяНакладная.Контрагент = &озон
	|	И РасходнаяНакладная.Дата >= &Дата1
	|	И РасходнаяНакладная.Дата <= &Дата2
	|	И РасходнаяНакладная.ПунктДоставки = &ПДОзон";
	
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Дата2));
	Запрос.УстановитьПараметр("ложь", ложь);
	Запрос.УстановитьПараметр("озон", контрагент);
	Запрос.УстановитьПараметр("ПДозон", Справочники.ПунктыДоставки.НайтиПоКоду("SNL-024031"));  // пд озон
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		//	состояние( ВыборкаДетальныеЗаписи.ссылка);
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		НомерОтправления = ВыборкаДетальныеЗаписи.номерЗаказа;
		Если НомерОтправления = "" Тогда
			продолжить;
		конецЕсли;	
		ИмяВыходногоФайлаДЖ = ПолучитьИмяВременногоФайла(".json");
		//сообщить(ИмяВыходногоФайлаДж);
		
		
		Запись = Новый ЗаписьJSON;
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( ,Символы.Таб);
		Запись.ОткрытьФайл(ИмяВыходногоФайлаДЖ,,,ПараметрыЗаписиJSON);
		
		НастройкиСериализации = Новый НастройкиСериализацииJSON;
		НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
		НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата;		
		//--------------------------------------------------------------------------------
		// блок по считываю состояния документа
		СтрПРо= Новый Структура;
		
		
		Данные = Новый Структура;
		Данные.Вставить("posting_number",НомерОтправления);
		
		Попытка
			ЗаписатьJSON(Запись, Данные, НастройкиСериализации);
			Запись.Закрыть();
			// Возврат Истина;
		Исключение
			//сообщить(ОписаниеОшибки());
			// ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Ошибка,,,"Прайс не сформирован, произошла ошибка " + ОписаниеОшибки());
			//  Возврат Ложь;
		КонецПопытки;;  
		
		
		// выполнение пост запроса.
		//-------------------------------
		Результат = POSTЗапросИз1С_Статус(Команда,ИмяВыходногоФайлаДЖ,".json") ;    // ИмяВыходногоФайла?
		//-------------------------------
		р2=Результат.ПолучитьТелоКакСтроку();
		//	сообщить(р2);
		
		
		//18333880-0029-2
		
		//		
		//		awaiting_packaging — ожидает упаковки,
		//not_accepted — не принят в сортировочном центре,
		//arbitration — ожидает решения спора,
		//awaiting_deliver — ожидает отгрузки,
		//delivering — доставляется,
		//driver_pickup — у водителя,
		//delivered — доставлено,
		//cancelled — отменено.
		
		
		// 2 вариант для обработки, так проще.
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку());
		
		Данные = ПрочитатьJSON(ЧтениеJSON, Ложь); // тут в структуру все выгружено
		
		Попытка 
			Если Данные.result<>неопределено тогда
				//	пауза(1);
				Статус = Данные.result.status;
				СтатусРНК = ПоследнийСтатусРНК(ВыборкаДетальныеЗаписи.ссылка);
				Если Статус = СтатусРНК тогда
					продолжить;
				КонецЕсли;	
				
				// только новые записываем.
				
				ИмСпр = Справочники.СостояниеНакладнойУКлиента.НайтиПоНаименованию(статус);				
				// запишем в регистр СостояниеНакладнойУКлиента
				Если имСпр = справочники.СостояниеНакладнойУКлиента.ПустаяСсылка() тогда
					//сообщить(".......не найдено - "+статус);
					продолжить;
				КонецЕсли;	
				МенеджерЗаписи = РегистрыСведений.СостояниеНакладнойУКлиента.СоздатьМенеджерЗаписи();
				
				МенеджерЗаписи.Объект = ВыборкаДетальныеЗаписи.ссылка;
				МенеджерЗаписи.Дата = ТекущаяДата();
				МенеджерЗаписи.СостояниеУклиента = ИмСпр;
				
				МенеджерЗаписи.Записать();
				/// тут если отменен отправим письмо еще раз.
				
				//нечаева 05,02,21	
				Если Статус = "cancelled" Тогда
					
					сообщитьМенеджеруОтменазаказа(ВыборкаДетальныеЗаписи.ссылка);	
					
				КонецЕсли;

				
			КонецЕсли;	 
			
		исключение
			//сообщить(ОписаниеОшибки());
		конецПопытки;
		
		
		//----------------------------------------------------------------------------------------------------------------
		
	КонецЦикла;
	
	
КонецПроцедуры


Функция ПоследнийСтатусРНК(РНК)
	
	Запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	СостояниеНакладнойУКлиента.СостояниеУКлиента КАК СостояниеУКлиента,
	|	СостояниеНакладнойУКлиента.Объект КАК Объект
	|ИЗ
	|	РегистрСведений.СостояниеНакладнойУКлиента КАК СостояниеНакладнойУКлиента
	|ГДЕ
	|	СостояниеНакладнойУКлиента.Объект = &текдок
	|
	|УПОРЯДОЧИТЬ ПО
	|	СостояниеНакладнойУКлиента.Дата УБЫВ";
	//|	И СостояниеНакладнойУКлиента.СостояниеУКлиента = &отменен";
	запрос.УстановитьПараметр("текдок",рнк);
	запрос.УстановитьПараметр("отменен",справочники.СостояниеНакладнойУКлиента.НайтиПоНаименованию("cancelled"));
	
	рез2 = запрос.Выполнить().Выбрать();
	
	
	Если рез2.Следующий() тогда
		возврат рез2.состояниеуклиента.наименование;
	иначе
		возврат "";
	конецесли;	
	
	
	
конецФункции	


//нечаева 21,12,20---
//******************************************************************************




Процедура загрузитьостатки_У_Контаргента() Экспорт
	
	 	
//	
//	POST /v1/product/info/stocks HTTP/1.1
//Host: api-seller.ozon.ru
//Client-Id: 836
//Api-Key: 0296d4f2-70a1-4c09-b507-904fd05567b9
//Content-Type: application/json

//{
//  "page": 1,
//  "page_size": 100
//}
//	
	

//{
//  "result": {
//    "items":[
//      {
//        "product_id": 123,
//        "offer_id": "SAMSGGLXS10",
//        "stock": {
//          "coming": 0,
//          "present": 12,
//          "reserved": 0
//        }
//      },
//      {
//        "product_id": 345,
//        "offer_id": "SAMSGGLXS30",
//        "stock": {
//          "coming": 0,
//          "present": 24,
//          "reserved": 2
//        }
//      }
//    ]
//  }}


	  
	// максимум можем пердедать 100 товаров за раз.
	
	// получение списка отправлений за день.
	
	Команда = "/v1/product/info/stocks";  // считывает заказы с сайта
	ТелоДЖ = "";
	
	// склад пока не верный тут!!!!
	
	Контрагент=справочники.Контрагенты.НайтиПоКоду("SSP-4991");
	//	Склад = справочники.Склады.НайтиПоКоду("STC-81");      //STC-60
	
	Склад = справочники.Склады.НайтиПоКоду("STC-81");
	ИмяВыходногоФайлаДЖ = ПолучитьИмяВременногоФайла(".json");
	//сообщить(ИмяВыходногоФайлаДж);
	
	//    {
	//      "product_id": 120000,
	//      "offer_id": "PRD-1",
	//      "stock": 20
	//    },
	
	 Страница = 1;
	 КоличествоЗаписей = 1000;
	 ПрерватьЗагрузку = ложь;
	 
	 Док = документы.ДвижениеТовараВнешнегоКонтрагента.СоздатьДокумент();
	 Док.Дата = ТекущаяДата();
	 док.КодОперации = перечисления.КодыОперацийОстатки.Реализация;
	 док.Контрагент = контрагент;
	 док.Договор = справочники.Договоры.НайтиПоКоду("SNL-028617");
	 док.ПунктДоставки = справочники.ПунктыДоставки.НайтиПоКоду("SNL-024031");

	 
	 // получим таблицу номенклатуры контаргента.
	 //запрос на получение
	 Запрос=Новый Запрос;
	 Запрос.Текст=
	 "ВЫБРАТЬ
	 |	МатрицаТовары.Номенклатура КАК Номенклатура,
	 |	МатрицаТовары.НаименованиеКонтрагента КАК НаименованиеКонтрагента,
	 |	МатрицаТовары.ШККонтрагентаКоробка КАК Артикул2
	 |ИЗ
	 |	Документ.Матрица.Товары КАК МатрицаТовары
	 |ГДЕ
	 |	МатрицаТовары.Ссылка.Дата <= &Дата1
	 |	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
	 |	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
	 |	И МатрицаТовары.Ссылка.Проведен = ИСТИНА";
	 
	 
	 Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.Договор = &Договор";
	 
	 
	 Запрос.УстановитьПараметр("Контрагент",Контрагент);
	 Запрос.УстановитьПараметр("Договор",справочники.Договоры.НайтиПоКоду("SNL-028617"));
	 Запрос.УстановитьПараметр("Дата1",КонецДня(ТекущаяДата()));
	 Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
	 
	 
	 тз1 = Запрос.Выполнить().Выгрузить();
//	 сообщить(тз1.Количество());
	 //----------------------------------------------------------------------------------------
	 
	// ЗаписатьВЛог("Екод","1 . озон тест","Информация");
	 
	 Пока Не ПрерватьЗагрузку цикл  
		 
	//	 ОбработкаПрерыванияПользователя();
		 
		 ТелоДЖ = "";
		 
		 Контрагент=справочники.Контрагенты.НайтиПоКоду("SSP-4991");
			 
		 ИмяВыходногоФайлаДЖ = ПолучитьИмяВременногоФайла(".json");
		 //	сообщить(ИмяВыходногоФайлаДж);
				 
		 Запись = Новый ЗаписьJSON;
		 ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( ,Символы.Таб);
		 Запись.ОткрытьФайл(ИмяВыходногоФайлаДЖ,,,ПараметрыЗаписиJSON);
		 
		 НастройкиСериализации = Новый НастройкиСериализацииJSON;
		 НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
		 НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата; //ЛокальнаяДата;      "2020-10-31T21:00:00Z",
		 СтрПРо= Новый Структура;
		 
		 
		 Данные = Новый Структура;
		 Данные.Вставить("page",Страница);    //ТекДата1);
		 Данные.Вставить("page_size",КоличествоЗаписей);  // ожидает упаковки
		 
		 
		 Попытка
			 ЗаписатьJSON(Запись, Данные, НастройкиСериализации);
			 Запись.Закрыть();
			 // Возврат Истина;
		 Исключение
			 //сообщить(ОписаниеОшибки());
			 // ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Ошибка,,,"Прайс не сформирован, произошла ошибка " + ОписаниеОшибки());
			 //  Возврат Ложь;
		 КонецПопытки;;  
		 
	//	 ЗаписатьВЛог("Екод","2. озон тест","Информация");

		 // выполнение пост запроса.
		 //-------------------------------
		 Результат = POSTЗапросИз1С(Команда,ИмяВыходногоФайлаДЖ) ;    // ИмяВыходногоФайла?
		 //-------------------------------
		 р2=Результат.ПолучитьТелоКакСтроку();
		 ИмяВыхОтвет=результат.ПолучитьИмяФайлаТела();
		 //	Сообщить(ИмяВыхОтвет);
		 
		 // можно отсюда обрабатывать
		 Текст = Новый ТекстовыйДокумент;
		 Текст.УстановитьТекст(Результат.ПолучитьТелоКакСтроку());
	//	 сообщить(р2);
		 ЗаписатьВЛог("Екод","3. озон тест","Информация");
		 // 2 вариант для обработки, так проще.
		 ЧтениеJSON = Новый ЧтениеJSON;
		 ЧтениеJSON.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку());
		 
		 Данные = ПрочитатьJSON(ЧтениеJSON, Ложь); // тут в структуру все выгружено
		 //сообщить(Данные);
		 
		 
		 //загрузим все в новый документ.
		 
		 //  "present": 24,   это на складе в озоне самом.
		 попытка
			 Если  Данные.result.items.количество()=0 тогда
				// сообщить("нет данных. конец загрузки");
				 пп=1;
				 //продолжить;
				  прерватьЗагрузку = истина;
					прервать;
			 КонецЕсли;	
		 исключение
			// сообщить("конец загрузки");
			 прерватьЗагрузку = истина;
			 прервать;
		 конецПопытки;
		 
	   //  ЗаписатьВЛог("Екод","4. озон тест","Информация");
		 Для каждого ТекСтрока из Данные.result.items цикл
			 
			 //		  "product_id": 123,
			 //        "offer_id": "SAMSGGLXS10",
			 //        "stock": {
			 //          "coming": 0,
			 //          "present": 12,
			 //          "reserved": 0
			 
			 Если текстрока.stock.present = 0 ТОгда
				 продолжить;
			 КонецЕсли;	 
			 
			 ТекНом = справочники.Номенклатура.ПустаяСсылка();
			 // поиск по наименованию.
			 
			 НайденнаяСтрока = тз1.Найти(текстрока.offer_id,"НаименованиеКонтрагента");
			 Если НайденнаяСтрока <> Неопределено ТОгда
				 ТекНом = НайденнаяСтрока.номенклатура;
								 
			 Иначе
				// сообщить("Не найдено - "+текстрока.offer_id); 
				 продолжить;
			 КонецЕсли;

			 
			// сообщить(" продукт ид -"+текстрока.product_id+ " наименование контрагента - "+ текстрока.offer_id +"  остаток на складе озон - "+ текстрока.stock.present);
			 
			 СтрТоваров = док.Товары.Добавить();
			 Стртоваров.Номенклатура = ТекНом;
			 СтрТоваров.ОстатокКонтрагента =  текстрока.stock.present;
			
			
		 конецЦикла;
		 
		 Страница=Страница+1;
		// КоличествоЗаписей=500;
		 //
		 //Если страница>2 Тогда
		 //    
		 //    прервать;
		 //    
		 //КонецЕсли; 
		 //
		 // сообщить("-----------------------------------------------------------------");
		 
	КонецЦикла;
	
	док.Записать();
	
	попытка
		док.Записать(РежимЗаписиДокумента.Проведение);
	исключение
	конецпопытки;
	//ЗаписатьВЛог("Екод","5. озон тест","Информация");
	// открыть документ	
	//док.ПолучитьФорму("ФормаДокумента").Открыть();
	#если клиент тогда
		сообщить(док.Номер);
	#конецЕсли

КонецПроцедуры





Процедура Сформировать(ТаблицаПараметров=НЕОПРЕДЕЛЕНО) Экспорт
	
	////+++
	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Кухарь А.Ю. 31.03.2026 начало
	// Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом тогда
	Если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() тогда
		//Кухарь А.Ю. 31.03.2026 конец       
		ЗаписатьВЛог("Регламент","Отмена выполнения. Задача: Загрузка Ссайта ОЗОН. Автообмен разрешен для базы: """+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
		Возврат;
	КонецЕсли;
	
	
	
	
	ЗаписатьВЛог("Екод","Начало выполнения. Задача: Загрузка с сайта ОЗОН. !","Информация");                     
	
	Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
		// получаем заказы за текущий день, минус день назад, на всякий случай.
		 загрузитьостатки_У_Контаргента();
		
	КонецЕсли;
	
	
	
	// теперь пропишем у уже загруженных заказов кода
	ЗаписатьВЛог("Екод","Конец выполнения. Задача: Загрузка из озона. !","Информация");                     
	
	
	
	
КонецПроцедуры	




Функция НайтиСклад(Номенклатура)
	УровеньН = номенклатура.Уровень();
	Группа = Номенклатура.Родитель;
	Пока Группа.СкладОтгрузкиКБ = Справочники.Склады.ПустаяСсылка() И УровеньН > 1 Цикл
		Группа = Группа.Родитель;
		УровеньН = УровеньН - 1;
	КонецЦикла;
	Возврат Группа.СкладОтгрузкиКБ;
КонецФункции

Функция НайтиКодГруппыНоменклатуры(Номенклатура, ВыбУровень = 1)
	УровеньН = номенклатура.Уровень();
	Группа = Номенклатура.Родитель;
	Пока УровеньН > ВыбУровень Цикл
		Группа = Группа.Родитель;
		УровеньН = УровеньН - 1;
	КонецЦикла;
	Возврат Группа.код;
КонецФункции


Функция НайтиРНК(стрШапка)
	Запрос = Новый Запрос;
	сз = Новый СписокЗначений;
	//Катаев+ 28/05/14 Уведомления приходят от других пунктов доставки. Отключаем проверку на пункт доставки
	////Катаев+ 19/06/13 В уведомлении может не быть указан Пункт доставки
	//Если ПустаяСтрока(стрШапка.ПунктДоставки) Тогда
	//	Запрос.УстановитьПараметр("ВыборПунктДоставки", Ложь);
	//Иначе
	//	Запрос.УстановитьПараметр("ВыборПунктДоставки", Истина);
	//КонецЕсли;
	//Катаев- 19/06/13
	Запрос.УстановитьПараметр("ВыборПунктДоставки", Ложь);
	//Катаев- 28/05/14
	Запрос.УстановитьПараметр("ПунктДоставки", стрШапка.ПунктДоставки);
	Запрос.УстановитьПараметр("Контрагент", стрШапка.Контрагент);
	
	//нечаева 12,12,16+++
	Запрос.УстановитьПараметр("Номер", стрШапка.НомерРНК);
	//нечаева 12,12,16---
	
	
	//нечаева 07,05,18 +++
	// для Перекрестка, ищем по номеру счет фактурs Х5
	Если стрШапка.Контрагент.родитель.код = "SSR-4117" ТОгда
		
		// Пробуем определить по Дате и Номеру РНК
		Если стрШапка.НомерРНК <> Неопределено Тогда
			Если стрШапка.ДатаРНК = Неопределено Тогда
				
				Запрос.Текст =
				"ВЫБРАТЬ
				|	СчетФактура.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.СчетФактура КАК СчетФактура
				|ГДЕ
				|	СчетФактура.Номер = &Номер
				|	И СчетФактура.Дата >= &Дата
				|	И СчетФактура.Контрагент = &Контрагент
				|	И СчетФактура.Проведен";
				
				
				Запрос.УстановитьПараметр("Дата", стрШапка.ДатаПриемаТовара-86400*30);
			Иначе
				
				Запрос.Текст =
				"ВЫБРАТЬ
				|	СчетФактура.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.СчетФактура КАК СчетФактура
				|ГДЕ
				|	СчетФактура.Номер = &Номер
				|	И СчетФактура.Дата >= &Дата
				|	И СчетФактура.Контрагент = &Контрагент
				|	И СчетФактура.Проведен";
				
				
				ДатаРНК = Дата(СтрЗаменить(стрШапка.ДатаРНК,"-",""));
				Запрос.УстановитьПараметр("Дата", НачалоДня(ДатаРНК)-86400*30);
			КонецЕсли;
			Запрос.УстановитьПараметр("Номер", стрШапка.НомерРНК);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				РНК = Выборка.Ссылка.накладные[0].накладная.ссылка;
				
				сз.Добавить(РНК);
			КонецЦикла;
			
			РНК = неопределено;
			Если сз.Количество() <> 0 Тогда
				Возврат сз;
			КонецЕсли;
		КонецЕсли;
		
		// если не нашли то смотрим старый кусок, как был поиск по РНК.
		// Пробуем определить по Дате, Номеру заказа и адресу доставки;
		
	КонецЕсли;
	
	//нечаева 07,05,18 ---
	
	
	//для табер трейда ищем сначала по номеру заказа.
	Если стрШапка.Контрагент.код = "SSP-3698" ТОгда
		
		Если стрШапка.ДатаРНК = Неопределено Тогда
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РасходнаяНакладная.Ссылка
			|ИЗ
			|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
			|ГДЕ
			|	РасходнаяНакладная.НомерЗаказа = &Номер
			|	И РасходнаяНакладная.Дата >= &Дата
			|	И ВЫБОР
			|			КОГДА &ВыборПунктДоставки
			|				ТОГДА РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|	И РасходнаяНакладная.Контрагент = &Контрагент
			|	И РасходнаяНакладная.Проведен";
			Запрос.УстановитьПараметр("Дата", стрШапка.ДатаПриемаТовара-86400*30);
		Иначе
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РасходнаяНакладная.Ссылка
			|ИЗ
			|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
			|ГДЕ
			|	РасходнаяНакладная.НомерЗаказа = &Номер
			|	И НАЧАЛОПЕРИОДА(РасходнаяНакладная.Дата, ДЕНЬ)>= &Дата
			|	И ВЫБОР
			|			КОГДА &ВыборПунктДоставки
			|				ТОГДА РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|	И РасходнаяНакладная.Контрагент = &Контрагент
			|	И РасходнаяНакладная.Проведен";
			ДатаРНК = Дата(СтрЗаменить(стрШапка.ДатаРНК,"-",""));
			
			Запрос.УстановитьПараметр("Дата", НачалоДня(ДатаРНК)-86400*30);
		КонецЕсли;
		Запрос.УстановитьПараметр("Номер", стрШапка.НомерЗаказа);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			сз.Добавить(Выборка.Ссылка)
		КонецЦикла;
		
		Если сз.Количество() <> 0 Тогда
			Возврат сз;
		КонецЕсли;
		
		
		// если не нашли то смотрим старый кусок, как был поиск по РНК.
		// Пробуем определить по Дате, Номеру заказа и адресу доставки;
		
		
	КонецЕсли;
	
	
	
	
	
	// Пробуем определить по Дате и Номеру РНК
	Если стрШапка.НомерРНК <> Неопределено Тогда
		Если стрШапка.ДатаРНК = Неопределено Тогда
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РасходнаяНакладная.Ссылка
			|ИЗ
			|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
			|ГДЕ
			|	РасходнаяНакладная.Номер = &Номер
			|	И РасходнаяНакладная.Дата >= &Дата
			//Катаев+ 19/06/13
			//|	И РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
			|	И ВЫБОР
			|			КОГДА &ВыборПунктДоставки
			|				ТОГДА РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			//Катаев- 19/06/13
			|	И РасходнаяНакладная.Контрагент = &Контрагент
			|	И РасходнаяНакладная.Проведен";
			Запрос.УстановитьПараметр("Дата", стрШапка.ДатаПриемаТовара-86400*30);
		Иначе
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РасходнаяНакладная.Ссылка
			|ИЗ
			|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
			|ГДЕ
			|	РасходнаяНакладная.Номер = &Номер
			//Катаев+ 01/04/13
			//|	И РасходнаяНакладная.Дата = &Дата
			|	И НАЧАЛОПЕРИОДА(РасходнаяНакладная.Дата, ДЕНЬ)>= &Дата
			//Катаев- 01/04/13
			//Катаев+ 19/06/13
			//|	И РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
			|	И ВЫБОР
			|			КОГДА &ВыборПунктДоставки
			|				ТОГДА РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			//Катаев- 19/06/13
			|	И РасходнаяНакладная.Контрагент = &Контрагент
			|	И РасходнаяНакладная.Проведен";
			//Катаев+ 01/04/13
			ДатаРНК = Дата(СтрЗаменить(стрШапка.ДатаРНК,"-",""));
			//нечаева 12,12,16++
			Запрос.УстановитьПараметр("Дата", НачалоДня(ДатаРНК)-86400*30);
			//нечаева 12,12,16--
			//Катаев- 01/04/13
		КонецЕсли;
		Запрос.УстановитьПараметр("Номер", стрШапка.НомерРНК);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			сз.Добавить(Выборка.Ссылка)
		КонецЦикла;
		Если сз.Количество() <> 0 Тогда
			Возврат сз;
		КонецЕсли;
	КонецЕсли;
	// Пробуем определить по Дате, Номеру заказа и адресу доставки;
	//Катаев+ 28/05/14 А здесь включаем
	Если ПустаяСтрока(стрШапка.ПунктДоставки) Тогда
		Запрос.УстановитьПараметр("ВыборПунктДоставки", Ложь);
	Иначе
		Запрос.УстановитьПараметр("ВыборПунктДоставки", Истина);
	КонецЕсли;
	//Катаев- 28/05/14
	Если стрШапка.ДатаЗаказа = Неопределено Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.НомерЗаказа = &Номер
		|	И РасходнаяНакладная.ДатаЗаказа >= &Дата
		//Катаев+ 19/06/13
		//|	И РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
		|	И ВЫБОР
		|			КОГДА &ВыборПунктДоставки
		|				ТОГДА РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		//Катаев- 19/06/13
		|	И РасходнаяНакладная.Контрагент = &Контрагент
		|	И РасходнаяНакладная.Проведен";      //нечаева 25,04,17+++
		Запрос.УстановитьПараметр("Дата", НачалоГода(стрШапка.ДатаПриемаТовара));
	Иначе                                         //нечаева 25,04,17---
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.НомерЗаказа = &Номер
		//Катаев+ 09/04/13
		|	И НАЧАЛОПЕРИОДА(РасходнаяНакладная.ДатаЗаказа, ДЕНЬ) = &Дата
		//|	И РасходнаяНакладная.ДатаЗаказа = &Дата
		//Катаев- 09/04/13
		//Катаев+ 19/06/13
		//|	И РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
		|	И ВЫБОР
		|			КОГДА &ВыборПунктДоставки
		|				ТОГДА РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		//Катаев- 19/06/13
		|	И РасходнаяНакладная.Контрагент = &Контрагент
		|	И РасходнаяНакладная.Проведен";
		//Катаев+ 01/04/13
		ДатаЗаказа = Дата(СтрЗаменить(стрШапка.ДатаЗаказа,"-",""));
		Запрос.УстановитьПараметр("Дата", ДатаЗаказа);
		//Катаев- 01/04/13
	КонецЕсли;
	Запрос.УстановитьПараметр("Номер", стрШапка.НомерЗаказа);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		сз.Добавить(Выборка.Ссылка);
	КонецЦикла;
	Если сз.Количество() <> 0 Тогда
		Возврат сз;
	Иначе
		//Катаев+ 09/04/13 Для случая что в РНК не заполнена дата заказа делаем поиск по номеру заказа и дата РНК не меньше месяца
		//Катаев+ 01/04/13
		//Строка="РНК для заказа №"+стрШапка.НомерЗаказа+" не обнаружена";
		//Строка="Уведомление о поступлении товара. РНК для заказа №"+стрШапка.НомерЗаказа+" не обнаружена";
		//Катаев- 01/04/13
		
		//нечаева 03,06,15+++
		Строка = "";
		//нечаева 03,06,15---
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.НомерЗаказа подобно &Номер
		|	И РасходнаяНакладная.Дата >= &Дата
		//Катаев+ 19/06/13
		//|	И РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
		//Катаев+ 21/07/14 Проверку по пункту доставки отключил
		//|	И ВЫБОР
		//|			КОГДА &ВыборПунктДоставки
		//|				ТОГДА РасходнаяНакладная.ПунктДоставки = &ПунктДоставки
		//|			ИНАЧЕ ИСТИНА
		//|		КОНЕЦ
		//Катаев- 19/06/13
		|	И РасходнаяНакладная.Контрагент = &Контрагент
		|	И РасходнаяНакладная.Проведен";
		Запрос.УстановитьПараметр("Дата", ТекущаяДата()-86400*30);
		Запрос.УстановитьПараметр("Номер", стрШапка.НомерЗаказа);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			сз.Добавить(Выборка.Ссылка);
		КонецЦикла;
		Если сз.Количество() <> 0 Тогда
			Возврат сз;
		Иначе
			//нечаева 03,06,15++
			Если НЕ стрШапка.Контрагент.Наименование="Городской Супермаркет" Тогда
				//сообщить("Уведомление о поступлении товара. РНК для заказа №"+стрШапка.НомерЗаказа+" не обнаружена. ИЛН контрагента = " + стрШапка.Контрагент+" ИЛН пункта доставки = "+стрШапка.ПунктДоставки + " № РНК в уведомлении = "+стрШапка.НомерРНК);
			КонецЕсли;
			//нечаева 03,06,15--
			
		КонецЕсли;
		//нечаева 03,06,15+++
		Если Строка<>"" Тогда
			КритичОшибки.Добавить(Строка);
			//Катаев+ 02/10/14
			Ошибки.Добавить(Строка);
		конецЕсли;
		//нечаева 03.06,15 --
		
		
		Возврат Неопределено;
	КонецЕсли;
КонецФункции


Функция ПолучитьНакладную(Склад, НомерЗаказа, ДатаЗаказа, ТипЗаказа)
	Если ТипЗаказа = "Оригинал" Тогда
		Возврат Документы.РасходнаяНакладная.СоздатьДокумент();
	Иначе
		// Делаем поиск РНК по Складу, Номеру и Дате заказа
		Запрос = Новый запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка,
		|	РасходнаяНакладная.СостояниеНакладной
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.ДатаЗаказа = &ДатаЗаказа
		|	И РасходнаяНакладная.НомерЗаказа = &НомерЗаказа
		|	И РасходнаяНакладная.Склад = &Склад";
		Запрос.УстановитьПараметр("НомерЗаказа", НомерЗаказа);
		Запрос.УстановитьПараметр("Склад", Склад);
		Запрос.УстановитьПараметр("ДатаЗаказа", ДатаЗаказа);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() > 1 Тогда
			спРНК = "";
			Пока Выборка.Следующий() Цикл
				спРНК = спРНК + Выборка.Ссылка.Номер + ";"
			КонецЦикла;
			Строка = "Для заказа № "+НомерЗаказа+" пришла корректировка, но было обнаружено более одного РНК ("+спРНК+"). Корректировку необходимо провести вручную.";
			Ошибки.Добавить(Строка);
			Возврат Неопределено;
		КонецЕсли;
		Если Выборка.Следующий() Тогда
			Если Выборка.Ссылка.Проведен Тогда
				Строка = "Для РНК "+Выборка.Ссылка+" пришла корректировка, но документ уже проведен. Корректировку необходимо провести вручную";
				Ошибки.Добавить(Строка);
				Возврат Неопределено;
			КонецЕсли;
			Если Выборка.СостояниеНакладной = перечисления.СостоянияНакладной.ВРаботе Тогда
				Строка = "Для РНК "+Выборка.Ссылка+" пришла корректировка. Документ будет изменен";
				Ошибки.Добавить(Строка);
				Возврат Выборка.Ссылка.ПолучитьОбъект();
			Иначе
				Строка = "Для РНК "+Выборка.Ссылка+" пришла корректировка, но документ уже отправлен на склад. Дальнейшая загрузка РНК прекращается.";
				Ошибки.Добавить(Строка);
				Возврат Неопределено;
			КонецЕсли;
		Иначе
			Строка = "Для заказа № "+НомерЗаказа+" пришла корректировка, но РНК не обнаружена. Будет создан новый документ";
			Ошибки.Добавить(Строка);
			Возврат Документы.РасходнаяНакладная.СоздатьДокумент();
		КонецЕсли;
	Конецесли;
КонецФункции

//-------------------------------------



//----------------------------------------


//// нечаева 21,12,20+++
//Функция ФайлЭтикеткиИз1С(Команда,ТелоДж)
//	
//	
//	// это продуктив пароли
//	//НашКлючАдмин = "*#*#*#";
//	//КлиентИД = 44219;
//	
//	// тестовые пароли
//	КлиентИД = 836;                                                    
//	НашКлючАдмин ="*#*#*#";
//	
//	
//	Лимит = 10;
//	
//	ИмяВыходногоФайла = ПолучитьИмяВременногоФайла(".pdf");
//	
//	//ДатаНачала =Формат(НачалоДня(Дата1),"ДФ=""гггг-ММ-дд""");
//	//ДатаКонца = Формат(КонецДня(Дата2),"ДФ=""гггг-ММ-дд""");

//	АдресТ = "cb-api.ozonru.me"	; // тестовый сервер
//	//АдресТ = "api-seller.ozon.ru"	; // продуктив
//	попытка                          
//		Соединение = Новый HTTPСоединение(АдресТ,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);  
//	исключение
//		Сообщить(ОписаниеОшибки());
//	конецПопытки;
//	
//	HTTP_запрос = новый HTTPзапрос();
//	
//	HTTP_запрос.АдресРесурса = Команда;
//	
//	
//	ЗаголовокHTTP = Новый Соответствие();
//	ЗаголовокHTTP.Вставить("Content-Type", "application/json");
//	ЗаголовокHTTP.Вставить("Accept", "text/xml");
//	ЗаголовокHTTP.Вставить("Accept-Language", "ru");
//	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
//	ЗаголовокHTTP.Вставить("Content-Language", "ru");
//	ЗаголовокHTTP.Вставить("Content-Charset", "utf-8");
//	// потмо изменить
//	ЗаголовокHTTP.Вставить("Host", АдресТ); //"https://seller-api.sc.prod.s.o3.ru/v1/categories/tree?language=DEFAULT");
//	ЗаголовокHTTP.Вставить("Client-Id", КлиентИД);
//	ЗаголовокHTTP.Вставить("Api-Key", НашКлючАдмин );	
//	//Host: api-seller.ozon.ru
//	
//	
//	HTTP_запрос.Заголовки = ЗаголовокHTTP;
//	
//	//HTTP_запрос.УстановитьТелоИзСтроки(ТелоДЖ,,ИспользованиеByteOrderMark.НеИспользовать);
//	HTTP_запрос.УстановитьИмяФайлаТела(ТелоДЖ);
//	
//	
//	Попытка
//		//Отправляем для обработки на наш сервер
//		Ответ = Соединение.ОтправитьДляОбработки(HTTP_запрос);  // ИмяВыходногоФайла
//		
//	Исключение
//		#Если клиент Тогда
//			Сообщить(ОписаниеОшибки());
//		#КонецЕсли   
//	КонецПопытки;
////	ответ.ПолучитьИмяФайлаТела()
//	Соединение.ОтправитьДляОбработки(HTTP_запрос,ИмяВыходногоФайла);
//	//Сообщить(ИмяВыходногоФайла);
//	Если Ответ.КодСостояния = 404 Тогда
//		возврат "";
//	//	сообщить("ошибка формирования ");
//	иначе	
//		возврат ИмяВыходногоФайла;
//	//	сообщить(ИмяВыходногоФайла);
//	конецЕсли;
//	//--------------------------------------------------------------------------------------------------------------------------------

//КонецФункции

Процедура СформироватьЭтикеткуОзон(Док)
	
	//нечаева 21,12,20+++
	// сначала пробуем распечатать из папки, если не получится, то скачиваем с сайта, заново
	Распечатали  = 0;
	ПутьЭтик = "\\srvfile-sk\FBS";
	НомерОтправления = Док.номерЗаказа;
	НомДок = Док.Номер;
	ИмяФКопирования = ПутьЭтик +"\"+НомДок+".pdf";
	
	//нечаева 21,12,20---
	//------------------------------------------------------------------------------------------------------ 
	// получение списка отправлений
	
	команда = 1;
	
	Команда = "/v2/posting/fbs/package-label";  // получает файл маркировки отправления.
	
	ТелоДЖ = "";
	
	ИмяВыходногоФайлаДЖ = ПолучитьИмяВременногоФайла(".json");
	//сообщить(ИмяВыходногоФайлаДж);
	
	Запись = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( ,Символы.Таб);
	Запись.ОткрытьФайл(ИмяВыходногоФайлаДЖ,,,ПараметрыЗаписиJSON);
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата; //ЛокальнаяДата;      "2020-10-31T21:00:00Z",
	
	
	// пример запроса	
	//	//{
	//  "posting_number": 
	//  [
	//    "13076543-0001-1"    //   Номера отправлений через запятую.
	//  ]
	//}	
	
	//	Текдата1 = Формат(НачалоДня(ТекущаяДата()),"ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс'.000Z'""");  // 2020-10-31T21:00:00Z07:00\
	
	НомераОтправлений = Новый Массив;
	//	НомераОтправлений.Добавить("13076543-0001-1");
	Если НомерОтправления<>"" Тогда
		НомераОтправлений.Добавить(НомерОтправления);
	КонецЕсли;
	
	Данные = Новый Структура;
	Данные.Вставить("posting_number",НомераОтправлений);
	
	Попытка
		ЗаписатьJSON(Запись, Данные, НастройкиСериализации);
		Запись.Закрыть();
		// Возврат Истина;
	Исключение
		//сообщить(ОписаниеОшибки());
		// ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Ошибка,,,"Прайс не сформирован, произошла ошибка " + ОписаниеОшибки());
		//  Возврат Ложь;
	КонецПопытки;;  
	
	// выполнение пост запроса.
	//-------------------------------
	Результат = ФайлЭтикеткиИз1С(Команда,ИмяВыходногоФайлаДЖ) ;    // Тут файл ПДФ должен быть
	//-------------------------------
	//р2=Результат.ПолучитьТелоКакСтроку();
	//ИмяВыхОтвет=результат.ПолучитьИмяФайлаТела();
	//Сообщить(ИмяВыхОтвет);
	
	///Процедура ОткрытьФайл(Команда)
	
	попытка
		//
		//Файл = Новый Файл;
		//Файл.Путь= результат;
		
		
		Распечатали  = 0;
		ПутьЭтик = "\\srvfile-sk\FBS";
		ЭтикФ = ПутьЭтик +"\"+НомДок+".pdf";
		Если результат<>"" Тогда
			
			КопироватьФайл(результат,ЭтикФ);
		КонецЕсли;
	исключение
		//Сообщить(ОписаниеОшибки());
	конецпопытки;
	
	///КонецПроцедуры
	
	
	// можно отсюда обрабатывать
	//Текст = Новый ТекстовыйДокумент;
	//Текст.УстановитьТекст(Результат.ПолучитьТелоКакСтроку());
	//сообщить(р2);
	
	
КонецПроцедуры	
//нечаева 21,12,20---


//---------------------------------------
Процедура СкачатьЭтикеткиНажатие()
	
	// 57636640-0007-2
	
	
	Контрагент=справочники.Контрагенты.НайтиПоКоду("SSP-4991");
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РасходнаяНакладная.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.ДатаОтгрузки >= &Текущая
	|	И РасходнаяНакладная.Проведен = истина
	|	И РасходнаяНакладная.Контрагент = &озон ";
	//  |	И РасходнаяНакладная.СостояниеНакладной = &вработе";
	
	Запрос.УстановитьПараметр("вработе",перечисления.СостоянияНакладной.ВРаботе);	
	Запрос.УстановитьПараметр("озон",контрагент);	
	Запрос.УстановитьПараметр("текущая",ТекущаяДата());
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока рез.Следующий() цикл
		
		Запрос2 = новый Запрос ;
		Запрос2.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	СостояниеНакладнойУКлиента.СостояниеУКлиента КАК СостояниеУКлиента,
		|	СостояниеНакладнойУКлиента.Объект.Ссылка КАК ОбъектСсылка,
		|	СостояниеНакладнойУКлиента.Дата КАК Дата
		|ИЗ
		|	РегистрСведений.СостояниеНакладнойУКлиента КАК СостояниеНакладнойУКлиента
		|ГДЕ
		|	СостояниеНакладнойУКлиента.Объект = &текущая
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
		Запрос2.УстановитьПараметр("текущая",рез.ссылка);
		ПСтатуса =Запрос2.Выполнить().Выбрать();
		текСостояние = справочники.СостояниеНакладнойУКлиента.ПустаяСсылка();
		Если пстатуса.Следующий() тогда
			ТекСостояние = ПСтатуса.СостояниеУклиента;
			
		КонецЕсли;
		Если ТекСостояние.наименование = "awaiting_deliver" ТОгда
			// скачаем этикетку
			СформироватьЭтикеткуОзон(рез.ссылка);
			
		КонецЕсли;	
		
		
	КонецЦикла;
	
	
	
КонецПроцедуры

//------------------------------------------------

Процедура ПолучитьОтмененныеНажатие()
	
	// получение списка отправлений за день.
	команда = 1;
	//POSTЗапросИз1С(Команда);  // старая проба
	
	Команда = "/v2/posting/fbs/list";  // считывает заказы с сайта
	ТелоДЖ = "";
	
	Контрагент=справочники.Контрагенты.НайтиПоКоду("SSP-4991");
	
	
	ИмяВыходногоФайлаДЖ = ПолучитьИмяВременногоФайла(".json");
	//	сообщить(ИмяВыходногоФайлаДж);
	
	
	
	Запись = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( ,Символы.Таб);
	Запись.ОткрытьФайл(ИмяВыходногоФайлаДЖ,,,ПараметрыЗаписиJSON);
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата; //ЛокальнаяДата;      "2020-10-31T21:00:00Z",
	СтрПРо= Новый Структура;
	
	Дата1 = ДобавитьДату(текущаяДата(),-60*60*24*3);  // 3 дня назад. по текущую
	//Дата1 = дата(2021,01,01);
	СтрПро.Вставить("since",Дата1);    //ТекДата1);
	СтрПро.Вставить("status","cancelled");  // ожидает упаковки
	СтрПро.Вставить("to",ТекущаяДата());
	
	
	ШК = Новый Структура;
	ШК.Вставить("barcodes",true);
	
	Данные = Новый Структура;
	Данные.Вставить("dir","asc");
	//	Данные.Вставить("filter",ТабЗначВМассив(ТабЗн)); - это для таблиц значений
	
	// это структуру добавили
	Данные.Вставить("filter",СтрПро);
	Данные.Вставить("limit",50); // количество заказов  макс 50 за раз
	Данные.Вставить("offset",1);
	Данные.Вставить("with",ШК);
	
	Попытка
		ЗаписатьJSON(Запись, Данные, НастройкиСериализации);
		Запись.Закрыть();
		// Возврат Истина;
	Исключение
		//сообщить(ОписаниеОшибки());
		// ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Ошибка,,,"Прайс не сформирован, произошла ошибка " + ОписаниеОшибки());
		//  Возврат Ложь;
	КонецПопытки;;  
	
	
	// выполнение пост запроса.
	//-------------------------------
	Результат = POSTЗапросИз1С(Команда,ИмяВыходногоФайлаДЖ) ;    // ИмяВыходногоФайла?
	//-------------------------------
	р2=Результат.ПолучитьТелоКакСтроку();
	ИмяВыхОтвет=результат.ПолучитьИмяФайлаТела();
	//	Сообщить(ИмяВыхОтвет);
	
	// можно отсюда обрабатывать
	Текст = Новый ТекстовыйДокумент;
	Текст.УстановитьТекст(Результат.ПолучитьТелоКакСтроку());
	//сообщить(р2);
	
	// 2 вариант для обработки, так проще.
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку());
	
	Данные = ПрочитатьJSON(ЧтениеJSON, Ложь); // тут в структуру все выгружено
	//сообщить(Данные);
	
	Для каждого ТекСтрока из Данные.result цикл
		
		//	сообщить("НомерЗаказа - "+ТекСтрока.order_number+" номер отправления - "+Текстрока.posting_number+" , дата заказа"+ (ТекСтрока.created_at) );
		// проверим , если ли уже такой заказ.
		Запрос = новый запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.НомерЗаказа = &ТекНОм
		|	И РасходнаяНакладная.Контрагент = &озон
		|	И РасходнаяНакладная.Дата >= &Этотгод";
		Запрос.УстановитьПараметр("ТекНом",Текстрока.posting_number);
		Запрос.УстановитьПараметр("озон",контрагент);
		Запрос.УстановитьПараметр("этотгод",ДобавитьМесяц(ТекущаяДата(), -2));
		Рез=Запрос.Выполнить().Выбрать();
		Если рез.Следующий() тогда
			//сообщить("  ....текущий статус ");
			Запрос = новый запрос;
			запрос.Текст = "ВЫБРАТЬ
			|	СостояниеНакладнойУКлиента.СостояниеУКлиента КАК СостояниеУКлиента,
			|	СостояниеНакладнойУКлиента.Объект КАК Объект
			|ИЗ
			|	РегистрСведений.СостояниеНакладнойУКлиента КАК СостояниеНакладнойУКлиента
			|ГДЕ
			|	СостояниеНакладнойУКлиента.Объект = &текдок
			|	И СостояниеНакладнойУКлиента.СостояниеУКлиента = &отменен";
			запрос.УстановитьПараметр("текдок",рез.ссылка);
			запрос.УстановитьПараметр("отменен",справочники.СостояниеНакладнойУКлиента.НайтиПоНаименованию("cancelled"));
			
			рез2 = запрос.Выполнить().Выбрать();
			
			// прописываем статус - отменен.
			Если рез2.Количество()= 0 тогда
				
				Статус = "cancelled";
				
				ИмСпр = Справочники.СостояниеНакладнойУКлиента.НайтиПоНаименованию(статус);				
				// запишем в регистр СостояниеНакладнойУКлиента
				Если имСпр = справочники.СостояниеНакладнойУКлиента.ПустаяСсылка() тогда
					//	сообщить(".......не найдено - "+статус);
					продолжить;
				КонецЕсли;	
				МенеджерЗаписи = РегистрыСведений.СостояниеНакладнойУКлиента.СоздатьМенеджерЗаписи();
				
				МенеджерЗаписи.Объект = рез.ссылка;
				МенеджерЗаписи.Дата = ТекущаяДата();
				МенеджерЗаписи.СостояниеУклиента = ИмСпр;
				
				МенеджерЗаписи.Записать();
				
				сообщитьМенеджеруОтменазаказа(рез.ссылка);	
				
			конецЕсли;
			
			
			продолжить;
		КонецЕсли;	 
		
		
	КонецЦикла;
	
	
	
	
КонецПроцедуры


Процедура СообщитьМенеджеруОтменаЗаказа(Док) Экспорт
	
	Если ПараметрыСеанса.Отладка Тогда
		Возврат;
	КонецЕсли;
	
	//Менеджер=СтрШапка.контрагент.Менеджер;
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
	//	Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//	Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Иначе
	//	Профиль.АдресСервераPOP3   = "87.236.190.180";
	//	Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//КонецЕсли;
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);		 
	// Кухарь А.Ю.  08.09.2022 конец

	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	//----------------------------------------------------------------
	Сообщение=новый интернетПочтовоеСообщение;
	Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	//еще трех сюда потом добавим
	Сообщение.Получатели.Добавить("egorova_k@collant.ru");
	Сообщение.Получатели.Добавить("egorova@collant.ru");

	Сообщение.Получатели.Добавить("kulagina@collant.ru");
	
	Сообщение.Получатели.Добавить("gamova@collant.ru");
	Сообщение.Получатели.Добавить("gimelshpak@collant.ru");
	Сообщение.Получатели.Добавить("zholobov@collant.ru");
	Сообщение.Получатели.Добавить("mironov@collant.ru");
	Сообщение.Получатели.Добавить("tulchinskij@collant.ru");
	Сообщение.Получатели.Добавить("semeikina@collant.ru");
	Сообщение.Получатели.Добавить("ryabova@collant.ru");
	Сообщение.Получатели.Добавить("ovl@collant.ru"); 
	Сообщение.Получатели.Добавить("operatorschastsy@collant.ru");
	
	
	
	Сообщение.Отправитель="ecode@collant.ru";
	
	Сообщение.Тема="!!!!!! Отмена заказа Озон № "+Док.номер;
	Строка=Символ(13)+Символ(13)+"       Добрый день!"+Символ(13)+Символ(13)+Строка("Отмена заказа ИМ Озон № "+Док.номерЗаказа+".")+
	+Символы.ПС+" РНК № "+Док.номер+" "+Док.Дата+"."+Символ(13)+Символ(13)+"Заказ отменен. Просьба удалить РНК!!!";
	Для рр=0 по файлы.Количество()-1 Цикл
		Строка=Строка+символы.ПС+Файлы[рр];
	КонецЦикла;
	
	
	НомСтр=1;
	//Строка=Строка+Символы.ПС+символы.ПС+"Фактический адрес, пунк доставки: "+СтрШапка.ПунктДоставки;
	Строка=Строка+Символы.ПС;
	Если Ошибки.количество()>1 Тогда
		Строка=Строка+Символы.ПС+"Сообщения по загрузке данных:";
	КонецЕсли;	
	Если НЕ Ошибки=Неопределено и ошибки.Количество()>0 Тогда
		Для рр=0 по ошибки.Количество()-1 Цикл
			Строка=Строка+Символы.ПС+НомСтр+". "+Ошибки[рр];
			Строка=Строка+Символы.ПС;
			НомСтр=НомСтр+1;
		КонецЦикла;
	конецЕсли;
	Строка=Строка+Символы.ПС+"________________________________________________________________";
	
	Сообщение.Тексты.Добавить(Строка);
	//
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
	исключение
		КритичОшибки.Добавить("Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки() );
	конецПопытки;
	Попытка
		Почта.Послать(Сообщение);
	исключение
		
	конецПопытки;
	Почта.Отключиться();
	
	
КонецПроцедуры












// Катаев- 21/03/13
//--------------------------
КодМетро	="SSP-8643";
КритичОшибки= Новый массив;

//нечаева 11,04,17+++
КритичОшибкиЛента = Новый массив; // для отправки многопаллетных документов
//нечаева 11,04,17---


Ошибки=Новый Массив;
Файлы=Новый Массив;

ПризнакЗаписиДокумента=Истина;

ТЗПечать=Новый ТаблицаЗначений;
ТЗПечать.Колонки.Добавить("НомерСтроки",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("Найдена",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("ТипШк",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("Штрихкод",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("Название",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("КодПокуп",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("КодПрод",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("Колво",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("КолвоОтредактированное",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
ТЗПечать.Колонки.Добавить("Единица",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("КолУпак");
ТЗПечать.Колонки.Добавить("ВУпак");
ТЗПечать.Колонки.Добавить("Тип",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("ВозврУпак",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("ПромоЦена",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("ЦенаБезНДС",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("ЦенаСНДС",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("СуммаБезНДС",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("Склад",Новый ОписаниеТипов("СправочникСсылка.Склады"));
ТЗПечать.Колонки.Добавить("ПризнакГруппыНом",Новый ОписаниеТипов("Число"));

//нечаева для метро  17,08,16 +++
ТЗПечать.Колонки.Добавить("ТипШКМетро",Новый ОписаниеТипов("ПеречислениеСсылка.ТипыШтрихКодов"));//блочок или штука, если блочок разворачиваем в штуки
//нечаева для метро  17,08,16 ---




ТЗШапка=Новый ТаблицаЗначений;
ТЗШапка.Колонки.Добавить("НомЗаказа");
ТЗШапка.Колонки.Добавить("ДатаЗаказа");
ТЗШапка.Колонки.Добавить("ДатаДоставки");
//нечаева 27,11,17++ 
ТЗШапка.Колонки.Добавить("ВремяДоставки");
ТЗШапка.Колонки.Добавить("ОкнаДоставки");
//нечаева 27,11,17--

ТЗШапка.Колонки.Добавить("ТипЗаказа");
ТЗШапка.Колонки.Добавить("КодВалюты");
ТЗШапка.Колонки.Добавить("ИЛНПокупателя");
ТЗШапка.Колонки.Добавить("НазваниеПокупателя");
ТЗШапка.Колонки.Добавить("ИЛНПлательщика");
ТЗШапка.Колонки.Добавить("НазваниеПлательщика");
ТЗШапка.Колонки.Добавить("ИЛНМестаДоставки");
ТЗШапка.Колонки.Добавить("НазваниеМестаДоставки");
ТЗШапка.Колонки.Добавить("АдресМестаДоставки");
ТЗШапка.Колонки.Добавить("ОбщСумма");
ТЗШапка.Колонки.Добавить("ОбщКолУпак");
ТЗШапка.Колонки.Добавить("ОбщКол");
ТЗШапка.Колонки.Добавить("КолСтрок");
ТЗШапка.Колонки.Добавить("Контрагент");
ТЗШапка.Колонки.Добавить("ТипILNКонтрагента");
ТЗШапка.Колонки.Добавить("ПунктДоставки");
ТЗШапка.Колонки.Добавить("ДатаОтгрузки");
ТЗШапка.Колонки.Добавить("Менеджер");
ТЗШапка.Колонки.Добавить("Организация");
ТЗШапка.Колонки.Добавить("КодДоговора");
//Катаев+ 31/10/13 GLN конечного пункта (для Ленты)
ТЗШапка.Колонки.Добавить("ГЛН_Конечный");
//Катаев- 31/10/13
//Катаев+ 01/12/14 Для Молнии
ТЗШапка.Колонки.Добавить("НомерЗаявкиМолния");
//Катаев- 01/12/14

//нечаева для метро  17,08,16 +++
ТЗШапка.Колонки.Добавить("ТипШК");//блочок или штука, если блочок разворачиваем в штуки

//нечаева для метро 30,10,17 +++
ТЗПечать.Колонки.Добавить("Артикул",Новый ОписаниеТипов("Строка"));//блочок или штука, если блочок разворачиваем в штуки
//нечаева для метро  30,10,17 ---

// нечаева 06,09,18++
ТЗШапка.Колонки.Добавить("ИмяЛогиста");
ТЗШапка.Колонки.Добавить("АдресЛогиста");
// нечаева 06,09,18---




Ашан=0;

// Катаев+ 11/03/13
// Табллицы для Акта
АктШапка = Новый ТаблицаЗначений;
АктШапка.Колонки.Добавить("РНК");
АктШапка.Колонки.Добавить("НомерРНК");
АктШапка.Колонки.Добавить("ДатаРНК");
АктШапка.Колонки.Добавить("Контрагент");
АктШапка.Колонки.Добавить("НомерЗаказа");
АктШапка.Колонки.Добавить("ДатаЗаказа");
АктШапка.Колонки.Добавить("ПунктДоставки");
АктШапка.Колонки.Добавить("ДатаПриемаТовара");
АктШапка.Колонки.Добавить("СостоянияРКМ");
АктШапка.Колонки.Добавить("СостояниеДокумента");

//Катаев+ 20/11/14
АктШапка.Колонки.Добавить("НомерАкта");
//нечаева 14,11,19+++
АктШапка.Колонки.Добавить("ИдентификаторАктаПриемки");
//нечаева 14,11,19---
ТЗШапка.Колонки.Добавить("Промо");
//Катаев- 20/11/14

АктТаблица = Новый таблицаЗначений;
АктТаблица.Колонки.Добавить("Номенклатура");
АктТаблица.Колонки.Добавить("ШК");
АктТаблица.Колонки.Добавить("Артикул");
АктТаблица.Колонки.Добавить("Заказано");
АктТаблица.Колонки.Добавить("Отправлено");
АктТаблица.Колонки.Добавить("Принято");
АктТаблица.Колонки.Добавить("Склад");
АктТаблица.Колонки.Добавить("НаименованиеКонтрагента");


//нечаева 14,05,18+++
АктТаблица.Колонки.Добавить("ЦенаПриемки");
АктТаблица.Колонки.Добавить("ЦенаПриемкиСНДС");

АктТаблица.Колонки.Добавить("СуммаПриемки");
АктТаблица.Колонки.Добавить("СуммаПриемкиСНДС");
АктТаблица.Колонки.Добавить("ШтВУпаковке");
АктТаблица.Колонки.Добавить("ВидУпаковки");
//нечаева 14,05,18---




// Катаев- 11/03/13

// Катаев+ 25/03/13
АктТаблица.Колонки.Добавить("Товар");
// катаев- 25/03/13

//нечаева для метро  17,08,16 +++
АктТаблица.Колонки.Добавить("ТипШК");//блочок или штука, если блочок разворачиваем в штуки
//нечаева для метро  17,08,16 ---

КритическиеОшибкиОзон=Новый Массив;
КритическиеОшибкиОзон2=Новый Массив;


//нечаева 19,03,15+++
ОшибкиАртикул=Новый Массив;
//нечаева 19,03,15---
